{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"13": "Divorce (Kitab Al-Talaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2175,
			"arabicnumber": 2175,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول صلی اللہ علیہ وسلم نے فرمایا: جو شخص کسی عورت کو اس کے شوہر سے یا غلام کو مالک سے برگشتہ کرے وہ ہم میں سے نہیں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2176,
			"arabicnumber": 2176,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: عورت اپنی بہن کی طلاق کا مطالبہ نہ کرے تاکہ اس کا پیالہ خالی کرا لے ( یعنی اس کا حصہ خود لے لے ) اور خود نکاح کر لے، جو اس کے مقدر میں ہو گا وہ اسے ملے گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2177,
			"arabicnumber": 2177,
			"text": "محارب کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اللہ تعالیٰ کے نزدیک حلال چیزوں میں طلاق سے زیادہ ناپسندیدہ کوئی چیز نہیں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2178,
			"arabicnumber": 2178,
			"text": "عبداللہ بن عمر رضی اللہ عنہما نبی اکرم صلی اللہ علیہ وسلم سے روایت کرتے ہیں عبداللہ بن عمر رضی اللہ عنہما نبی اکرم صلی اللہ علیہ وسلم سے روایت کرتے ہیں",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2179,
			"arabicnumber": 2179,
			"text": "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں اپنی بیوی کو حالت حیض میں طلاق دے دی، تو عمر بن خطاب رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے اس کے متعلق دریافت کیا، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اسے حکم دو کہ وہ اپنی بیوی سے رجوع کر لے، پھر اسے روکے رکھے یہاں تک کہ وہ حیض سے پاک ہو جائے، پھر حیض آ جائے، پھر پاک ہو جائے، پھر اس کے بعد اگر چاہے تو رکھے، ورنہ چھونے سے پہلے طلاق دیدے، یہی وہ عدت ہے جس کا اللہ تعالیٰ نے عورتوں کو طلاق دینے کے سلسلے میں حکم دیا ہے ۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2180,
			"arabicnumber": 2180,
			"text": "نافع سے روایت ہے کہ ابن عمر رضی اللہ عنہما نے اپنی ایک عورت کو حالت حیض میں ایک طلاق دے دی، آگے مالک کی حدیث کے ہم معنی روایت ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2181,
			"arabicnumber": 2181,
			"text": "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ انہوں نے اپنی بیوی کو حالت حیض میں طلاق دے دی تو عمر رضی اللہ عنہ نے نبی اکرم صلی اللہ علیہ وسلم سے اس کا ذکر کیا، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اسے حکم دو کہ وہ رجوع کر لے پھر جب وہ پاک ہو جائے یا حاملہ ہو تو اسے طلاق دے ۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2182,
			"arabicnumber": 2182,
			"text": "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ انہوں نے اپنی بیوی کو حالت حیض میں طلاق دے دی، عمر رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے اس کا ذکر کیا، تو رسول اللہ صلی اللہ علیہ وسلم غصہ ہو گئے پھر فرمایا: اسے حکم دو کہ اس سے رجوع کر لے پھر اسے روکے رکھے یہاں تک کہ وہ حیض سے پاک ہو جائے، پھر حائضہ ہو پھر پاک ہو جائے پھر چاہیئے کہ وہ پاکی کی حالت میں اسے چھوئے بغیر طلاق دے، یہی عدت کا طلاق ہے جیسا کہ اللہ نے حکم دیا ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2183,
			"arabicnumber": 2183,
			"text": "ابن سیرین کہتے ہیں کہ مجھے یونس بن جبیر نے خبر دی کہ انہوں نے ابن عمر رضی اللہ عنہما سے دریافت کیا کہ آپ نے اپنی بیوی کو کتنی طلاق دی؟ تو انہوں نے کہا: ایک۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2184,
			"arabicnumber": 2184,
			"text": "محمد بن سیرین کہتے ہیں کہ مجھے یونس بن جبیر نے بتایا کہ میں نے عبداللہ بن عمر رضی اللہ عنہما سے مسئلہ دریافت کیا، میں نے کہا کہ جس آدمی نے اپنی بیوی کو حالت حیض میں طلاق دے دی ہے ( تو اس کا کیا حکم ہے؟ ) کہنے لگے کہ تم عبداللہ بن عمر رضی اللہ عنہما کو پہچانتے ہو؟ میں نے کہا: ہاں، تو انہوں نے کہا: عبداللہ بن عمر رضی اللہ عنہما نے اپنی بیوی کو حالت حیض میں طلاق دے دی تو عمر رضی اللہ عنہ نے نبی اکرم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہو کر مسئلہ دریافت کیا، آپ صلی اللہ علیہ وسلم نے فرمایا: اسے حکم دو کہ وہ رجوع کر لے اور عدت کے آغاز میں اسے طلاق دے ۔ میں نے پوچھا: کیا اس طلاق کا شمار ہو گا؟ انہوں نے کہا: تم کیا سمجھتے ہو اگر وہ عاجز ہو جائے یا دیوانہ ہو جائے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2185,
			"arabicnumber": 2185,
			"text": "ابن جریج کہتے ہیں کہ ہمیں ابوالزبیر نے خبر دی ہے کہ انہوں نے عروہ کے غلام عبدالرحمٰن بن ایمن کو ابن عمر رضی اللہ عنہما سے پوچھتے سنا اور وہ سن رہے تھے کہ آپ اس شخص کے متعلق کیا کہتے ہیں جس نے اپنی بیوی کو حالت حیض میں طلاق دیدی ہو؟ تو انہوں نے جواب دیا کہ عبداللہ بن عمر رضی اللہ عنہما نے رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں اپنی بیوی کو حالت حیض میں طلاق دے دی، تو عمر رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے پوچھا، اور کہا کہ عبداللہ بن عمر نے اپنی بیوی کو حالت حیض میں طلاق دے دی ہے، عبداللہ رضی اللہ عنہ کہتے ہیں: تو آپ صلی اللہ علیہ وسلم نے اس عورت کو مجھ پر لوٹا دیا اور اس طلاق کو شمار نہیں کیا اور فرمایا: جب وہ پاک ہو جائے تو وہ طلاق دے یا اسے روک لے ، ابن عمر رضی اللہ عنہما کہتے ہیں: اور نبی اکرم صلی اللہ علیہ وسلم نے یہ آیت تلاوت فرمائی «يا أيها النبي إذا طلقتم النساء فطلقوهن» اے نبی! جب تم لوگ عورتوں کو طلاق دو تو تم انہیں ان کی عدت کے شروع میں طلاق دو ( سورۃ الطلاق: ۱ ) ۔ ابوداؤد کہتے ہیں: اس حدیث کو ابن عمر رضی اللہ عنہما سے یونس بن جبیر، انس بن سیرین، سعید بن جبیر، زید بن اسلم، ابوالزبیر اور منصور نے ابووائل کے طریق سے روایت کیا ہے، سب کا مفہوم یہی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے حکم دیا کہ وہ رجوع کر لیں یہاں تک کہ وہ پاک ہو جائے پھر اگر چاہیں تو طلاق دیدیں اور چاہیں تو باقی رکھیں ۔ اسی طرح اسے محمد بن عبدالرحمٰن نے سالم سے، اور سالم نے ابن عمر رضی اللہ عنہما سے روایت کیا ہے البتہ زہری کی جو روایت سالم اور نافع کے طریق سے ابن عمر سے مروی ہے، اس میں ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے انہیں حکم دیا کہ وہ اس سے رجوع کر لیں یہاں تک کہ وہ پاک ہو جائے، پھر اسے حیض آئے اور پھر پاک ہو، پھر اگر چاہیں تو طلاق دیں اور اگر چاہیں تو رکھے رہیں، اور عطاء خراسانی سے روایت کیا گیا ہے انہوں نے حسن سے انہوں نے ابن عمر سے نافع اور زہری کی طرح روایت کی ہے، اور یہ تمام حدیثیں ابوالزبیر کی بیان کردہ روایت کے مخالف ہیں ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2186,
			"arabicnumber": 2186,
			"text": "مطرف بن عبداللہ سے روایت ہے کہ عمران بن حصین رضی اللہ عنہما سے اس شخص کے بارے میں پوچھا گیا جو اپنی بیوی کو طلاق دیدے پھر اس کے ساتھ صحبت بھی کر لے اور اپنی طلاق اور رجعت کے لیے کسی کو گواہ نہ بنائے تو انہوں نے کہا کہ تم نے سنت کے خلاف طلاق دی اور سنت کے خلاف رجعت کی، اپنی طلاق اور رجعت دونوں کے لیے گواہ بناؤ اور پھر اس طرح نہ کرنا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2187,
			"arabicnumber": 2187,
			"text": "بنی نوفل کے غلام ابوحسن نے ابن عباس رضی اللہ عنہما سے اس غلام کے بارے میں فتویٰ پوچھا جس کے نکاح میں کوئی لونڈی تھی تو اس نے اسے دو طلاق دے دی اس کے بعد وہ دونوں آزاد کر دیئے گئے، تو کیا غلام کے لیے درست ہے کہ وہ اس لونڈی کو نکاح کا پیغام دے؟ ابن عباس رضی اللہ عنہما نے کہا: ہاں رسول اللہ صلی اللہ علیہ وسلم نے اسی کا فیصلہ دیا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2188,
			"arabicnumber": 2188,
			"text": "عثمان بن عمر کہتے ہیں کہ ہمیں علی نے خبر دی ہے آگے سابقہ سند سے اسی مفہوم کی روایت مذکور ہے لیکن عنعنہ کے صیغے کے ساتھ ہے نہ کہ «أخبرنا» کے صیغے کے ساتھ، اس میں ہے کہ ابن عباس رضی اللہ عنہما نے کہا: تیرے لیے ایک طلاق باقی رہ گئی ہے، اللہ کے رسول اللہ صلی اللہ علیہ وسلم نے اسی کا فیصلہ فرمایا ہے۔ ابوداؤد کہتے ہیں: میں نے احمد بن حنبل کو کہتے سنا کہ عبدالرزاق کہتے ہیں کہ ابن مبارک نے معمر سے پوچھا کہ یہ ابوالحسن کون ہیں؟ انہوں نے ایک بھاری چٹان اٹھا لی ہے؟ ۱؎۔ ابوداؤد کہتے ہیں: ابوالحسن وہی ہیں جن سے زہری نے روایت کی ہے، زہری کہتے ہیں کہ وہ فقہاء میں سے تھے، زہری نے ابوالحسن سے کئی حدیثیں روایت کی ہیں۔ ابوداؤد کہتے ہیں: ابوالحسن معروف ہیں اور اس حدیث پر عمل نہیں ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2189,
			"arabicnumber": 2189,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: لونڈی کی طلاق دو ہیں اور اس کے قروء دو حیض ہیں ۔ ابوعاصم کہتے ہیں: مجھ سے مظاہر نے بیان کیا وہ کہتے ہیں: مجھ سے قاسم نے انہوں نے ام المؤمنین عائشہ رضی اللہ عنہا سے انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے اسی کے مثل روایت کیا ہے، لیکن اس میں ہے کہ اس کی عدت دو حیض ہے۔ ابوداؤد کہتے ہیں: یہ مجہول حدیث ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2190,
			"arabicnumber": 2190,
			"text": "عبداللہ بن عمرو بن العاص رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: طلاق صرف انہیں میں ہے جو تمہارے نکاح میں ہوں، اور آزادی صرف انہیں میں ہے جو تمہاری ملکیت میں ہوں، اور بیع بھی صرف انہیں چیزوں میں ہے جو تمہاری ملکیت میں ہوں ۔ ابن صباح کی روایت میں اتنا زیادہ ہے کہ ( تمہارے ذمہ ) صرف اسی نذر کا پورا کرنا ہے جس کے تم مالک ہو۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2191,
			"arabicnumber": 2191,
			"text": "اس سند سے بھی عبداللہ بن عمرو رضی اللہ عنہما سے اسی مفہوم کی روایت مروی ہے اس میں اتنا اضافہ ہے: جس نے گناہ کرنے کی قسم کھا لی تو اس قسم کا کوئی اعتبار نہیں نیز جس نے رشتہ توڑنے کی قسم کھا لی اس کا بھی کوئی اعتبار نہیں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2192,
			"arabicnumber": 2192,
			"text": "اس سند سے بھی عبداللہ بن عمرو رضی اللہ عنہما سے یہی روایت آئی ہے اس میں اتنا اضافہ ہے کہ وہی نذر ماننا درست ہے جس کے ذکر سے اللہ تعالیٰ کی رضا مقصود ہو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2193,
			"arabicnumber": 2193,
			"text": "محمد بن عبید بن ابوصالح (جو ایلیاء میں رہتے تھے) کہتے ہیں کہ میں عدی بن عدی کندی کے ساتھ نکلا یہاں تک کہ میں مکہ آیا تو انہوں نے مجھے صفیہ بنت شیبہ کے پاس بھیجا، اور انہوں نے ام المؤمنین عائشہ رضی اللہ عنہا سے حدیثیں یاد کر رکھی تھیں، وہ کہتی ہیں: میں نے عائشہ رضی اللہ عنہا کو کہتے سنا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: زبردستی کی صورت میں طلاق دینے اور آزاد کرنے کا اعتبار نہیں ہو گا ۔ ابوداؤد کہتے ہیں: میرا خیال ہے کہ غلاق کا مطلب غصہ ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2194,
			"arabicnumber": 2194,
			"text": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تین چیزیں ایسی ہیں کہ انہیں چاہے سنجیدگی سے کیا جائے یا ہنسی مذاق میں ان کا اعتبار ہو گا، وہ یہ ہیں: نکاح، طلاق اور رجعت ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2195,
			"arabicnumber": 2195,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں اللہ تعالیٰ کا فرمان ہے «والمطلقات يتربصن بأنفسهن ثلاثة قروء ولا يحل لهن أن يكتمن ما خلق الله في أرحامهن» اور جن عورتوں کو طلاق دے دی گئی ہے وہ تین طہر تک ٹھہری رہیں اور ان کے لیے حلال نہیں کہ اللہ تعالیٰ نے ان کے رحم میں جو پیدا کر دیا ہے اسے چھپائیں ( سورۃ البقرہ: ۲۲۸ ) یہ اس وجہ سے کہ جب آدمی اپنی بیوی کو طلاق دے دیتا تھا تو رجعت کا وہ زیادہ حقدار رہتا تھا گرچہ اس نے تین طلاقیں دے دی ہوں پھر اسے منسوخ کر دیا گیا اور ارشاد ہوا «الطلاق مرتان»یعنی طلاق کا اختیار صرف دو بار ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2196,
			"arabicnumber": 2196,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رکانہ اور اس کے بھائیوں کے والد عبد یزید نے رکانہ کی ماں کو طلاق دے دی، اور قبیلہ مزینہ کی ایک عورت سے نکاح کر لیا، وہ عورت رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئی اور اپنے سر سے ایک بال لے کر کہنے لگی کہ وہ میرے کام کا نہیں مگر اس بال برابر لہٰذا میرے اور اس کے درمیان جدائی کرا دیجئیے، یہ سن کر آپ صلی اللہ علیہ وسلم کو غصہ آ گیا، آپ نے رکانہ اور اس کے بھائیوں کو بلوا لیا، پھر پاس بیٹھے ہوئے لوگوں سے پوچھا کہ: کیا فلاں کی شکل اس اس طرح اور فلاں کی اس اس طرح عبد یزید سے نہیں ملتی؟ ، لوگوں نے کہا: ہاں ( ملتی ہے ) ، نبی اکرم صلی اللہ علیہ وسلم نے عبد یزید سے فرمایا: اسے طلاق دے دو ، چنانچہ انہوں نے طلاق دے دی، پھر فرمایا: اپنی بیوی یعنی رکانہ اور اس کے بھائیوں کی ماں سے رجوع کر لو ، عبد یزید نے کہا: اللہ کے رسول میں تو اسے تین طلاق دے چکا ہوں، آپ صلی اللہ علیہ وسلم نے فرمایا: مجھے معلوم ہے، تم اس سے رجوع کر لو ، اور آپ صلی اللہ علیہ وسلم نے یہ آیت تلاوت فرمائی «يا أيها النبي إذا طلقتم النساء فطلقوهن لعدتهن» ( سورۃ الطلاق: ۱ ) اے نبی! جب تم عورتوں کو طلاق دو تو ان کی عدت میں طلاق دو ۔ ابوداؤد کہتے ہیں: نافع بن عجیر اور عبداللہ بن علی بن یزید بن رکانہ کی حدیث جسے انہوں نے اپنے والد سے انہوں نے اپنے دادا سے روایت ( حدیث نمبر: ۲۲۰۶ ) کیا ہے کہ رکانہ نے اپنی بیوی کو طلاق بتہ دے دی، پھر بھی نبی اکرم صلی اللہ علیہ وسلم نے اس سے رجوع کرا دیا، زیادہ صحیح ہے کیونکہ رکانہ کے لڑکے اور ان کے گھر والے اس بات کو اچھی طرح جانتے تھے کہ رکانہ نے اپنی بیوی کو طلاق بتہ دی تھی تو نبی اکرم صلی اللہ علیہ وسلم نے اسے ایک ہی شمار کیا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2197,
			"arabicnumber": 2197,
			"text": "مجاہد کہتے ہیں: میں ابن عباس رضی اللہ عنہما کے پاس تھا کہ ایک آدمی آیا اور ان سے کہنے لگا کہ اس نے اپنی بیوی کو تین طلاق دے دی ہے، ابن عباس رضی اللہ عنہما خاموش رہے، یہاں تک کہ میں نے سمجھا کہ وہ اسے اس کی طرف لوٹا دیں گے، پھر انہوں نے کہا: تم لوگ بیوقوفی تو خود کرتے ہو پھر آ کر کہتے ہو: اے ابن عباس! اے ابن عباس! حالانکہ اللہ تعالیٰ کا فرمان ہے «ومن يتق الله يجعل له مخرجا» ۱؎ اور تو اللہ سے نہیں ڈرا لہٰذا میں تیرے لیے کوئی راستہ بھی نہیں پاتا، تو نے اپنے پروردگار کی نافرمانی کی لہٰذا تیری بیوی تیرے لیے بائنہ ہو گئی، اللہ تعالیٰ نے فرمایا ہے «يا أيها النبي إذا طلقتم النساء فطلقوهن» ، «في قبل عدتهن» ۲؎۔ ابوداؤد کہتے ہیں: اس حدیث کو حمید اعرج وغیرہ نے مجاہد سے، مجاہد نے ابن عباس رضی اللہ عنہما سے روایت کیا ہے۔ اور اسے شعبہ نے عمرو بن مرہ سے عمرو نے سعید بن جبیر سے سعید نے ابن عباس رضی اللہ عنہما سے روایت کیا ہے۔ اور ایوب و ابن جریج نے عکرمہ بن خالد سے عکرمہ نے سعید بن جبیر سے سعید نے ابن عباس رضی اللہ عنہما سے، اور ابن جریج نے عبدالحمید بن رافع سے ابن رافع نے عطاء سے عطاء نے ابن عباس رضی اللہ عنہما سے روایت کیا ہے۔ نیز اسے اعمش نے مالک بن حارث سے مالک نے ابن عباس رضی اللہ عنہما سے روایت کیا ہے اور ابن جریج نے عمرو بن دینار سے عمرو نے ابن عباس رضی اللہ عنہما سے روایت کیا ہے۔ ان سبھوں نے تین طلاق کے بارے میں کہا ہے کہ ابن عباس رضی اللہ عنہما نے ان کو تین ہی مانا اور کہا کہ وہ تمہارے لیے بائنہ ہو گئی جیسے اسماعیل کی روایت میں ہے جسے انہوں نے ایوب سے ایوب نے عبداللہ بن کثیر سے روایت کیا ہے۔ ابوداؤد کہتے ہیں: اور حماد بن زید نے ایوب سے ایوب نے عکرمہ سے عکرمہ نے ابن عباس رضی اللہ عنہما سے روایت کی ہے کہ جب ایک ہی منہ سے ( یکبارگی یوں کہے کہ تجھے تین طلاق دی ) تو وہ ایک شمار ہو گی۔ اور اسے اسماعیل بن ابراہیم نے ایوب سے ایوب نے عکرمہ سے روایت کیا ہے اور یہ ان کا اپنا قول ہے البتہ انہوں نے ابن عباس کا ذکر نہیں کیا بلکہ اسے عکرمہ کا قول بتایا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2198,
			"arabicnumber": 2198,
			"text": "ابوداؤد کہتے ہیں: ابن عباس رضی اللہ عنہما کا قول اگلی والی حدیث میں ہے جسے محمد بن ایاس نے روایت کیا ہے کہ ابن عباس، ابوہریرہ اور عبداللہ بن عمرو بن العاص رضی اللہ عنہم سے باکرہ ( کنواری ) کے بارے میں جسے اس کے شوہر نے تین طلاق دے دی ہو، دریافت کیا گیا تو ان سب نے کہا کہ وہ اپنے اس شوہر کے لیے اس وقت تک حلال نہیں ہو سکتی، جب تک کہ وہ کسی اور سے نکاح نہ کر لے۔ ابوداؤد کہتے ہیں: اور مالک نے یحییٰ بن سعید سے یحییٰ نے بکیر بن اشبح سے بکیر نے معاویہ بن ابی عیاش سے روایت کیا ہے کہ وہ اس واقعہ میں موجود تھے جس وقت محمد بن ایاس بن بکیر، ابن زبیر اور عاصم بن عمر کے پاس آئے، اور ان دونوں سے اس کے بارے میں دریافت کیا تو ان دونوں نے ہی کہا کہ تم ابن عباس اور ابوہریرہ رضی اللہ عنہما کے پاس جاؤ میں انہیں ام المؤمنین عائشہ رضی اللہ عنہا کے پاس چھوڑ کر آیا ہوں، پھر انہوں نے یہ پوری حدیث بیان کی۔ ابوداؤد کہتے ہیں: اور ابن عباس رضی اللہ عنہما کا یہ قول کہ تین طلاق سے عورت اپنے شوہر کے لیے بائنہ ہو جائے گی، چاہے وہ اس کا دخول ہو چکا ہو، یا ابھی دخول نہ ہوا ہو، اور وہ اس کے لیے اس وقت تک حلال نہ ہو گی، جب تک کہ کسی اور سے نکاح نہ کر لے اس کی مثال «صَرْف» والی حدیث کی طرح ہے ۱؎ اس میں ہے کہ پھر انہوں یعنی ابن عباس نے اس سے رجوع کر لیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2199,
			"arabicnumber": 2199,
			"text": "طاؤس سے روایت ہے کہ ایک صاحب جنہیں ابوصہبا کہا جاتا تھا ابن عباس رضی اللہ عنہما سے کثرت سے سوال کرتے تھے انہوں نے پوچھا: کیا آپ کو معلوم ہے کہ جب آدمی اپنی بیوی کو دخول سے پہلے ہی تین طلاق دے دیتا، تو رسول اللہ صلی اللہ علیہ وسلم اور ابوبکر رضی اللہ عنہ کے زمانے نیز عمر رضی اللہ عنہ کے ابتدائی دور خلافت میں اسے ایک طلاق مانا جاتا تھا؟ ابن عباس رضی اللہ عنہما نے جواب دیا: ہاں کیوں نہیں؟ جب آدمی اپنی بیوی کو دخول سے پہلے ہی تین طلاق دے دیتا تھا، تو اسے رسول اللہ صلی اللہ علیہ وسلم اور ابوبکر رضی اللہ عنہ کے زمانے میں نیز عمر رضی اللہ عنہ کے ابتدائی دور خلافت میں ایک ہی طلاق مانا جاتا تھا، لیکن جب عمر رضی اللہ عنہ نے دیکھا کہ لوگ بہت زیادہ ایسا کرنے لگے ہیں تو کہا کہ میں انہیں تین ہی نافذ کروں گا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2200,
			"arabicnumber": 2200,
			"text": "طاؤس سے روایت ہے کہ ابوصہباء نے ابن عباس رضی اللہ عنہما سے پوچھا: کیا آپ کو معلوم ہے کہ رسول اللہ صلی اللہ علیہ وسلم اور ابوبکر رضی اللہ عنہ کے زمانے میں نیز عمر رضی اللہ عنہ کے دور خلافت کے ابتدائی تین سالوں میں تین طلاقوں کو ایک ہی مانا جاتا تھا؟ ابن عباس رضی اللہ عنہما نے جواب دیا: ہاں ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2201,
			"arabicnumber": 2201,
			"text": "علقمہ بن وقاص لیثی کہتے ہیں کہ میں نے عمر بن خطاب رضی اللہ عنہ کو کہتے سنا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اعمال کا دارومدار نیتوں پر ہے، ہر آدمی کو وہی ملے گا جس کی اس نے نیت کی چنانچہ جس کی ہجرت اللہ اور اس کے رسول کے لیے ہو گی تو اسی کی ہجرت اللہ اور رسول کے لیے مانی جائے گی، اور جس نے دنیا حاصل کرنے یا کسی عورت سے نکاح کرنے کی غرض سے ہجرت کی ہو گی تو اس کی ہجرت اسی چیز کے لیے مانی جائے گی جس کے لیے اس نے ہجرت کی ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2202,
			"arabicnumber": 2202,
			"text": "عبداللہ بن کعب بن مالک (جو کہ اپنے والد کعب رضی اللہ عنہ کے نابینا ہو جانے کے بعد ان کے قائد تھے) کہتے ہیں کہ میں نے ( اپنے والد ) کعب بن مالک سے سنا، پھر انہوں نے جنگ تبوک والا اپنا قصہ سنایا اس میں انہوں نے بیان کیا کہ جب پچاس دنوں میں سے چالیس دن گزر گئے تو رسول اللہ صلی اللہ علیہ وسلم کا قاصد آیا اور کہنے لگا کہ رسول اللہ صلی اللہ علیہ وسلم تمہیں حکم دیتے ہیں کہ تم اپنی بیوی سے علیحدہ رہو، میں نے پوچھا: کیا میں اسے طلاق دے دوں یا کیا کروں؟ اس نے کہا: نہیں بلکہ اس سے علیحدہ رہو اس کے قریب نہ جاؤ، چنانچہ میں نے اپنی بیوی سے کہہ دیا: تم اپنے میکے چلی جاؤ ۱؎ اور جب تک اللہ تعالیٰ اس معاملہ کا فیصلہ نہ فرما دے وہیں رہنا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2203,
			"arabicnumber": 2203,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ہمیں ( اپنے عقد میں رہنے یا نہ رہنے کا ) اختیار دیا تو ہم نے آپ صلی اللہ علیہ وسلم ہی کو اختیار کیا، پھر آپ نے اسے کچھ بھی شمار نہیں کیا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2204,
			"arabicnumber": 2204,
			"text": "حماد بن زید کہتے ہیں کہ میں نے ایوب سے پوچھا: کیا آپ کو معلوم ہے کہ کسی اور نے بھی «أمرك بيدك» کے سلسلہ میں وہی بات کہی ہے جو حسن نے کہی تو انہوں نے کہا: نہیں، مگر وہی روایت ہے جسے ہم سے قتادہ نے بیان کیا، قتادہ نے کثیر مولی ابن سبرہ سے کثیر نے ابوسلمہ سے ابوسلمہ نے ابوہریرہ رضی اللہ عنہ سے ابوہریرہ رضی اللہ عنہ نے نبی اکرم صلی اللہ علیہ وسلم سے اسی طرح روایت کیا ہے۔ ایوب کہتے ہیں: تو کثیر ہمارے پاس آئے تو میں نے ان سے دریافت کیا، وہ بولے: میں نے تو کبھی یہ حدیث بیان نہیں کی، پھر میں نے قتادہ سے اس کا ذکر کیا تو انہوں نے کہا: ہاں کیوں نہیں انہوں نے اسے بیان کیا تھا لیکن وہ بھول گئے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2205,
			"arabicnumber": 2205,
			"text": "حسن سے «أمرك بيدك» کے سلسلہ میں مروی ہے کہ اس سے تین طلاق واقع ہو گی ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2206,
			"arabicnumber": 2206,
			"text": "نافع بن عجیر بن عبد یزید بن رکانہ سے روایت ہے کہ رکانہ بن عبد یزید نے اپنی بیوی سہیمہ کو طلاق بتہ ۱؎ ( قطعی طلاق ) دے دی، پھر نبی اکرم صلی اللہ علیہ وسلم کو اس کی خبر دی اور کہا: اللہ کی قسم! میں نے تو ایک ہی طلاق کی نیت کی تھی، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: قسم اللہ کی تم نے صرف ایک کی نیت کی تھی؟ رکانہ نے کہا: قسم اللہ کی میں نے صرف ایک کی نیت کی تھی، چنانچہ رسول اللہ صلی اللہ علیہ وسلم نے ان کی بیوی انہیں واپس لوٹا دی، پھر انہوں نے اسے دوسری طلاق عمر رضی اللہ عنہ کے دور خلافت میں دی اور تیسری عثمان رضی اللہ عنہ کے دور خلافت میں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2207,
			"arabicnumber": 2207,
			"text": "اس سند سے بھی رکانہ بن عبد یزید سے یہی حدیث مرفوعاً مروی ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2208,
			"arabicnumber": 2208,
			"text": "رکانہ بن عبد یزید رضی اللہ عنہ سے روایت ہے کہ انہوں نے اپنی بیوی کو طلاق بتہ دے دی پھر رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے تو آپ نے پوچھا: تم نے کیا نیت کی تھی؟ انہوں نے کہا: ایک کی، آپ صلی اللہ علیہ وسلم نے فرمایا: کیا اللہ کی قسم کھا کر کہہ رہے ہو؟ انہوں نے کہا: ہاں اللہ کی قسم کھا کر کہہ رہا ہوں، آپ صلی اللہ علیہ وسلم نے فرمایا: جس کا تم نے ارادہ کیا ہے وہی ہو گا ۔ ابوداؤد کہتے ہیں: یہ روایت ابن جریج والی روایت سے زیادہ صحیح ہے جس میں ہے کہ رکانہ نے اپنی بیوی کو تین طلاق دی تھی کیونکہ یہ روایت ان کے اہل خانہ کی بیان کردہ ہے اور وہ حقیقت حال سے زیادہ واقف ہیں اور ابن جریج والی روایت بعض بنی رافع ( جو ایک مجہول ہے ) سے منقول ہے جسے وہ عکرمہ سے روایت کرتے ہیں اور وہ ابن عباس رضی اللہ عنہما سے، ( دیکھئیے حدیث نمبر: ۲۰۹۶)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2209,
			"arabicnumber": 2209,
			"text": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: اللہ تعالیٰ نے میری امت سے ان چیزوں کو معاف کر دیا ہے جنہیں وہ زبان پر نہ لائے یا ان پر عمل نہ کرے، اور ان چیزوں کو بھی جو اس کے دل میں گزرے ۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2210,
			"arabicnumber": 2210,
			"text": "ابوتمیمہ ہجیمی سے روایت ہے کہ ایک شخص نے اپنی بیوی کو اے چھوٹی بہن! کہہ کر پکارا تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: کیا یہ تیری بہن ہے؟ آپ صلی اللہ علیہ وسلم نے اسے ناپسند فرمایا اور اس سے منع کیا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2211,
			"arabicnumber": 2211,
			"text": "ابو تمیمہ سے روایت ہے، وہ اپنی قوم کے ایک شخص سے روایت کرتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے ایک شخص کو اپنی بیوی کو اے چھوٹی بہن! کہہ کر پکارتے ہوئے سنا تو آپ نے اس سے منع فرمایا۔ ابوداؤد کہتے ہیں: اسے عبدالعزیز بن مختار نے خالد سے خالد نے ابوعثمان سے اور ابوعثمان نے ابو تمیمہ سے اور ابوتمیمہ نے نبی اکرم صلی اللہ علیہ وسلم سے مرسلاً روایت کیا ہے، نیز اسے شعبہ نے خالد سے خالد نے ایک شخص سے اس نے ابو تمیمہ سے اور ابو تمیمہ نے نبی اکرم صلی اللہ علیہ وسلم سے مرسلاً روایت کیا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2212,
			"arabicnumber": 2212,
			"text": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ابراہیم علیہ السلام نے صرف تین جھوٹ بولے ۱؎ جن میں سے دو اللہ تعالیٰ کی ذات کے لیے تھے، پہلا جب انہوں نے کہا کہ میں بیمار ہوں ۲؎، دوسرا جب انہوں نے ایک سوال کے جواب میں کہا تھا: بلکہ یہ تو ان کے اس بڑے کی کارستانی ہے، تیسرا اس موقعہ پر جب کہ وہ ایک سرکش بادشاہ کے ملک سے گزر رہے تھے ایک مقام پر انہوں نے قیام فرمایا تو اس سرکش تک یہ بات پہنچی، اور اسے بتایا گیا کہ یہاں ایک شخص ٹھہرا ہوا ہے اور اس کے ساتھ ایک انتہائی خوبصورت عورت ہے، چنانچہ اس نے ابراہیم علیہ السلام کو بلوایا اور عورت کے بارے میں دریافت کیا تو انہوں نے کہا: یہ تو میری بہن ہے ، جب وہ لوٹ کر بیوی کے پاس آئے تو انہوں نے بتایا کہ اس نے مجھ سے تمہارے بارے میں دریافت کیا تو میں نے اسے یہ بتایا ہے کہ تم میری بہن ہو کیونکہ آج میرے اور تمہارے علاوہ کوئی بھی مسلمان نہیں ہے لہٰذا تم میری دینی بہن ہو، تو تم اس کے پاس جا کر مجھے جھٹلا نہ دینا ، اور پھر پوری حدیث بیان کی۔ ابوداؤد کہتے ہیں: شعیب بن ابی حمزہ نے ابوالزناد سے ابوالزناد نے اعرج سے، اعرج نے ابوہریرہ رضی اللہ عنہ سے، ابوہریرہ نے نبی اکرم صلی اللہ علیہ وسلم سے اسی طرح کی روایت کی ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2213,
			"arabicnumber": 2213,
			"text": "سلمہ بن صخر بیاضی رضی اللہ عنہ کہتے ہیں کہ کہ لوگوں کے مقابلے میں میں کچھ زیادہ ہی عورتوں کا شوقین تھا، جب ماہ رمضان آیا تو مجھے ڈر ہوا کہ اپنی بیوی کے ساتھ کوئی ایسی حرکت نہ کر بیٹھوں جس کی برائی صبح تک پیچھا نہ چھوڑے چنانچہ میں نے ماہ رمضان کے ختم ہونے تک کے لیے اس سے ظہار کر لیا۔ ایک رات کی بات ہے وہ میری خدمت کر رہی تھی کہ اچانک اس کے جسم کا کوئی حصہ نظر آ گیا تو میں اس سے صحبت کئے بغیر نہیں رہ سکا، پھر جب میں نے صبح کی تو میں اپنی قوم کے پاس آیا اور انہیں سارا ماجرا سنایا، نیز ان سے درخواست کی کہ وہ میرے ساتھ رسول اللہ صلی اللہ علیہ وسلم کے پاس چلیں، وہ کہنے لگے: اللہ کی قسم یہ نہیں ہو سکتا تو میں خود ہی آپ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا، اور آپ صلی اللہ علیہ وسلم کو پوری بات بتائی، آپ صلی اللہ علیہ وسلم نے فرمایا: سلمہ! تم نے ایسا کیا؟ میں نے جواب دیا: ہاں اللہ کے رسول، مجھ سے یہ حرکت ہو گئی، دو بار اس طرح کہا، میں اللہ کا حکم بجا لانے کے لیے تیار ہوں، تو آپ میرے بارے میں حکم کیجئے جو اللہ آپ کو سجھائے۔ آپ صلی اللہ علیہ وسلم نے فرمایا: ایک گردن آزاد کرو ، میں نے اپنی گردن پر ہاتھ مار کر کہا: اس ذات کی قسم جس نے آپ کو حق کے ساتھ بھیجا ہے اس کے علاوہ میرے پاس کوئی گردن نہیں، آپ صلی اللہ علیہ وسلم نے فرمایا: تو دو مہینے کے مسلسل روزے رکھو ، میں نے کہا: میں تو روزے ہی کے سبب اس صورت حال سے دوچار ہوا ہوں، آپ صلی اللہ علیہ وسلم نے فرمایا: تو پھر ساٹھ صاع کھجور ساٹھ مسکینوں کو کھلاؤ ، میں نے جواب دیا: اس ذات کی قسم جس نے آپ کو حق کے ساتھ مبعوث فرمایا ہم دونوں تو رات بھی بھوکے سوئے، ہمارے پاس کھانا ہی نہیں تھا، آپ صلی اللہ علیہ وسلم نے فرمایا: بنی زریق کے صدقے والے کے پاس جاؤ، وہ تمہیں اسے دے دیں گے اور ساٹھ صاع کھجور ساٹھ مسکینوں کو کھلا دینا اور جو بچے اسے تم خود کھا لینا، اور اپنے اہل و عیال کو کھلا دینا ، اس کے بعد میں نے اپنی قوم کے پاس آ کر کہا: مجھے تمہارے پاس تنگی اور غلط رائے ملی جب کہ رسول اللہ صلی اللہ علیہ وسلم کے پاس گنجائش اور اچھی رائے ملی، آپ صلی اللہ علیہ وسلم نے مجھے یا میرے لیے تمہارے صدقے کا حکم فرمایا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2214,
			"arabicnumber": 2214,
			"text": "خویلہ بنت مالک بن ثعلبہ رضی اللہ عنہا کہتی ہیں کہ میرے شوہر اوس بن صامت نے مجھ سے ظہار کر لیا تو میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئی، میں آپ سے شکایت کر رہی تھی اور رسول اللہ صلی اللہ علیہ وسلم مجھ سے ان کے بارے میں جھگڑ رہے تھے اور آپ صلی اللہ علیہ وسلم فرما رہے تھے: اللہ سے ڈر، وہ تیرا چچا زاد بھائی ہے ، میں وہاں سے ہٹی بھی نہ تھی کہ یہ آیت نازل ہوئی: «قد سمع الله قول التي تجادلك في زوجها» اللہ تعالیٰ نے اس عورت کی گفتگو سن لی ہے جو آپ سے اپنے شوہر کے متعلق جھگڑ رہی تھی ( سورۃ المجادلہ: ۱ ) ، تو آپ صلی اللہ علیہ وسلم نے فرمایا: وہ ایک گردن آزاد کریں ، کہنے لگیں: ان کے پاس نہیں ہے۔ آپ صلی اللہ علیہ وسلم نے فرمایا: پھر وہ دو مہینے کے پے در پے روزے رکھیں ، کہنے لگیں: اللہ کے رسول! وہ بوڑھے کھوسٹ ہیں انہیں روزے کی طاقت نہیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا: تو پھر وہ ساٹھ مسکینوں کو کھانا کھلائیں ، کہنے لگیں: ان کے پاس صدقہ کرنے کے لیے کچھ بھی نہیں۔ کہتی ہیں: اسی وقت آپ صلی اللہ علیہ وسلم کے پاس کھجوروں کی ایک زنبیل آ گئی، میں نے کہا: اللہ کے رسول ( آپ یہ دے دیجئیے ) ایک اور زنبیل میں دے دوں گی، آپ صلی اللہ علیہ وسلم نے فرمایا: تم نے ٹھیک ہی کہا ہے، لے جاؤ اور ان کی جانب سے ساٹھ مسکینوں کو کھلا دو، اور اپنے چچا زاد بھائی ( یعنی شوہر ) کے پاس لوٹ جاؤ ۔ راوی کا بیان ہے کہ زنبیل ساٹھ صاع کی تھی۔ ابوداؤد کہتے ہیں: کہ اس عورت نے اپنے شوہر سے مشورہ کئے بغیر اس کی جانب سے کفارہ ادا کیا۔ ابوداؤد کہتے ہیں: یہ عبادہ بن صامت کے بھائی ہیں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2215,
			"arabicnumber": 2215,
			"text": "اس سند سے بھی ابن اسحاق سے اسی طرح کی روایت منقول ہے لیکن اس میں ہے کہ «عرق» ایسی زنبیل ہے جس میں تیس صاع کے بقدر کھجور آتی ہے۔ ابوداؤد کہتے ہیں: یہ حدیث یحییٰ بن آدم کی روایت کے مقابلے میں زیادہ صحیح ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2216,
			"arabicnumber": 2216,
			"text": "ابوسلمہ بن عبدالرحمٰن بن عوف زہری کہتے ہیں کہ «عرق» سے مراد ایسی زنبیل ہے جس میں پندرہ صاع کھجوریں آ جائیں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2217,
			"arabicnumber": 2217,
			"text": "لیمان بن یسار سے یہی حدیث مروی ہے اس میں ہے: آپ صلی اللہ علیہ وسلم کے پاس کھجوریں آئیں تو آپ نے وہ انہیں دے دیں، وہ تقریباً پندرہ صاع تھیں، آپ صلی اللہ علیہ وسلم نے فرمایا: انہیں صدقہ کر دو ، انہوں نے کہا: اللہ کے رسول! مجھ سے اور میرے گھر والوں سے زیادہ کوئی ضرورت مند نہیں، آپ صلی اللہ علیہ وسلم نے فرمایا: تم اور تمہارے گھر والے ہی انہیں کھا لو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 2218,
			"arabicnumber": 2218,
			"text": "عبادہ بن صامت رضی اللہ عنہ کے بھائی اوس رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے انہیں پندرہ صاع جو دی تاکہ ساٹھ مسکینوں کو کھلا دیں۔ ابوداؤد کہتے ہیں: عطا نے اوس کو نہیں پایا ہے اور وہ بدری صحابی ہیں ان کا انتقال بہت پہلے ہو گیا تھا، لہٰذا یہ حدیث مرسل ہے، اور لوگوں نے اسے اوزاعی سے اوزاعی نے عطاء سے روایت کیا اس میں «عن أوس» کے بجائے «أوسا» ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 2219,
			"arabicnumber": 2219,
			"text": "ہشام بن عروہ سے روایت ہے کہ جمیلہ رضی اللہ عنہا اوس بن صامت رضی اللہ عنہ کے نکاح میں تھیں، اور وہ عورتوں کے دیوانے تھے جب ان کی دیوانگی بڑھ جاتی تو وہ اپنی عورت سے ظہار کر لیتے، اللہ تعالیٰ نے انہیں کے متعلق ظہار کے کفارے کا حکم نازل فرمایا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 2220,
			"arabicnumber": 2220,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا سے بھی اسی کے مثل مروی ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 2221,
			"arabicnumber": 2221,
			"text": "عکرمہ سے روایت ہے کہ ایک شخص نے اپنی بیوی سے ظہار کر لیا، پھر کفارہ ادا کرنے سے پہلے ہی وہ اس سے صحبت کر بیٹھا چنانچہ وہ نبی اکرم صلی اللہ علیہ وسلم کے پاس آیا اور آپ کو اس کی خبر دی، تو آپ صلی اللہ علیہ وسلم نے فرمایا: تمہیں اس فعل پر کس چیز نے آمادہ کیا؟ اس نے کہا: چاندنی رات میں میں نے اس کی پنڈلی کی سفیدی دیکھی، آپ صلی اللہ علیہ وسلم نے فرمایا: پھر تم اس سے اس وقت تک الگ رہو جب تک کہ تم اپنی طرف سے کفارہ ادا نہ کر دو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 2222,
			"arabicnumber": 2222,
			"text": "عکرمہ سے روایت ہے کہ ایک شخص نے اپنی بیوی سے ظہار کر لیا، پھر اس نے چاندنی میں اس کی پنڈلی کی چمک دیکھی، تو اس سے صحبت کر بیٹھا، پھر وہ نبی اکرم صلی اللہ علیہ وسلم کے پاس آیا تو آپ نے اسے کفارہ ادا کرنے کا حکم فرمایا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 2223,
			"arabicnumber": 2223,
			"text": "اس سند سے ابن عباس رضی اللہ عنہما سے مرفوعاً اسی طرح روایت ہے لیکن اس میں پنڈلی کا ذکر نہیں ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 2224,
			"arabicnumber": 2224,
			"text": "اس سند سے بھی عکرمہ سے سے سفیان کی حدیث ( نمبر: ۲۲۲۱ ) کی طرح روایت ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 2225,
			"arabicnumber": 2225,
			"text": "ابوداؤد کہتے ہیں: میں نے محمد بن عیسیٰ کو اسے بیان کرتے سنا ہے، وہ کہتے ہیں ہم سے معتمر نے بیان کیا وہ کہتے ہیں: میں نے حکم بن ابان کو یہی حدیث بیان کرتے ہوئے سنا ہے وہ اسے عکرمہ سے روایت کر رہے تھے اس میں انہوں نے ابن عباس رضی اللہ عنہما کا ذکر نہیں کیا ہے۔ ابوداؤد کہتے ہیں: مجھے حسین بن حریث نے لکھا وہ کہتے ہیں کہ مجھے فضل بن موسیٰ نے خبر دی ہے وہ معمر سے وہ حکم بن ابان سے وہ عکرمہ سے وہ ابن عباس رضی اللہ عنہما سے وہ نبی اکرم صلی اللہ علیہ وسلم سے اسی مفہوم کی حدیث روایت کرتے ہیں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 2226,
			"arabicnumber": 2226,
			"text": "ثوبان رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس عورت نے اپنے شوہر سے بغیر کسی ایسی تکلیف کے جو اسے طلاق لینے پر مجبور کرے طلاق کا مطالبہ کیا تو اس پر جنت کی خوشبو حرام ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 2227,
			"arabicnumber": 2227,
			"text": "حبیبہ بنت سہل انصاریہ رضی اللہ عنہا سے روایت ہے کہ وہ ثابت بن قیس بن شماس رضی اللہ عنہ کے نکاح میں تھیں، ایک بار کیا ہوا کہ رسول اللہ صلی اللہ علیہ وسلم فجر پڑھنے کے لیے نکلے تو آپ نے حبیبہ بنت سہل کو اندھیرے میں اپنے دروازے پر پایا، آپ صلی اللہ علیہ وسلم نے پوچھا: کون ہے؟ بولیں: میں حبیبہ بنت سہل ہوں، آپ صلی اللہ علیہ وسلم نے فرمایا: کیا بات ہے؟ وہ اپنے شوہر ثابت بن قیس کے متعلق بولیں کہ میرا ان کے ساتھ گزارا نہیں ہو سکتا، پھر جب ثابت بن قیس آئے تو رسول اللہ صلی اللہ علیہ وسلم نے ان سے فرمایا: یہ حبیبہ بنت سہل ہیں انہوں نے مجھ سے بہت سی باتیں جنہیں اللہ نے چاہا ذکر کی ہیں ، حبیبہ کہنے لگیں: اللہ کے رسول! انہوں نے جو کچھ مجھے ( مہر وغیرہ ) دیا تھا وہ سب میرے پاس ہے، چنانچہ آپ صلی اللہ علیہ وسلم نے ثابت بن قیس سے کہا: اس ( مال ) میں سے لے لو ، تو انہوں نے اس میں سے لے لیا اور وہ اپنے گھر والوں کے پاس بیٹھی رہیں ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 2228,
			"arabicnumber": 2228,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ حبیبہ بنت سہل رضی اللہ عنہا ثابت بن قیس بن شماس رضی اللہ عنہ کے نکاح میں تھیں تو ان کو ان کے شوہر نے اتنا مارا کہ کوئی عضو ٹوٹ گیا، وہ فجر کے بعد رسول اللہ صلی اللہ علیہ وسلم کے پاس آئیں اور آپ سے ان کی شکایت کی تو نبی اکرم صلی اللہ علیہ وسلم نے ثابت کو بلوایا، اور کہا کہ تم اس سے کچھ مال لے کر اس سے الگ ہو جاؤ، ثابت نے کہا: اللہ کے رسول! کیا ایسا کرنا درست ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: ہاں ، وہ بولے، میں نے اسے دو باغ مہر میں دیئے ہیں یہ ابھی بھی اس کے پاس موجود ہیں، آپ صلی اللہ علیہ وسلم نے فرمایا: انہیں لے لو اور اس سے جدا ہو جاؤ ، چنانچہ انہوں نے ایسا ہی کیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 2229,
			"arabicnumber": 2229,
			"text": "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ ثابت بن قیس رضی اللہ عنہ کی بیوی نے ان سے خلع کر لیا تو نبی اکرم صلی اللہ علیہ وسلم نے اس کی عدت ایک حیض مقرر فرمائی۔ ابوداؤد کہتے ہیں: اس حدیث کو عبدالرزاق نے معمر سے معمر نے عمرو بن مسلم سے عمرو نے عکرمہ سے اور عکرمہ نے نبی اکرم صلی اللہ علیہ وسلم سے مرسلاً روایت کیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 2230,
			"arabicnumber": 2230,
			"text": "عبداللہ بن عمر رضی اللہ عنہما سے مروی ہے کہ خلع کرانے والی عورت کی عدت ایک حیض ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 2231,
			"arabicnumber": 2231,
			"text": "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ مغیث رضی اللہ عنہ ایک غلام تھے وہ کہنے لگے: اللہ کے رسول! اس سے میری سفارش کر دیجئیے، آپ صلی اللہ علیہ وسلم نے فرمایا: بریرہ! اللہ سے ڈرو، وہ تمہارا شوہر ہے اور تمہارے لڑکے کا باپ ہے کہنے لگیں: اللہ کے رسول! کیا آپ مجھے ایسا کرنے کا حکم فرما رہے ہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: نہیں بلکہ میں تو سفارشی ہوں مغیث کے آنسو گالوں پر بہہ رہے تھے تو رسول اللہ صلی اللہ علیہ وسلم نے عباس رضی اللہ عنہ سے کہا: کیا آپ کو مغیث کی بریرہ کے تئیں محبت اور بریرہ کی مغیث کے تئیں نفرت سے تعجب نہیں ہو رہا ہے؟ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 2232,
			"arabicnumber": 2232,
			"text": "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ بریرہ رضی اللہ عنہا کے شوہر ایک کالے کلوٹے غلام تھے جن کا نام مغیث رضی اللہ عنہ تھا، تو نبی اکرم صلی اللہ علیہ وسلم نے انہیں ( مغیث کے ساتھ رہنے یا نہ رہنے کا ) اختیار دیا اور ( نہ رہنے کی صورت میں ) انہیں عدت گزارنے کا حکم فرمایا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 2233,
			"arabicnumber": 2233,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا سے بریرہ کے قصہ میں روایت ہے کہ اس کا شوہر غلام تھا، رسول اللہ صلی اللہ علیہ وسلم نے بریرہ کو ( آزاد ہونے کے بعد ) اختیار دے دیا تو انہوں نے اپنے آپ کو اختیار کیا، اگر وہ آزاد ہوتا تو آپ اسے ( بریرہ کو ) اختیار نہ دیتے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 2234,
			"arabicnumber": 2234,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے بریرہ کو اختیار دیا اس کا شوہر غلام تھا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 2235,
			"arabicnumber": 2235,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ جس وقت بریرہ رضی اللہ عنہا آزاد ہوئی اس وقت اس کا شوہر آزاد ۱؎ تھا، اسے اختیار دیا گیا، تو اس نے کہا کہ اگر مجھے اتنا اتنا مال بھی مل جائے تب بھی میں اس کے ساتھ رہنا پسند نہ کروں گی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 2236,
			"arabicnumber": 2236,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ بریرہ رضی اللہ عنہا آزاد کی گئی اس وقت وہ آل ابواحمد کے غلام مغیث رضی اللہ عنہ کے نکاح میں تھی تو رسول اللہ صلی اللہ علیہ وسلم نے اسے اختیار دیا اور اس سے کہا: اگر اس نے تجھ سے صحبت کر لی تو پھر تجھے اختیار حاصل نہیں رہے گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 2237,
			"arabicnumber": 2237,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ انہوں نے اپنے لونڈی غلام کے ایک جوڑے کو آزاد کرنا چاہا تو نبی اکرم صلی اللہ علیہ وسلم سے اس کے متعلق دریافت کیا تو آپ نے حکم دیا کہ وہ عورت سے پہلے مرد کو آزاد کریں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 2238,
			"arabicnumber": 2238,
			"text": "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں ایک شخص مسلمان ہو کر آیا پھر اس کے بعد اس کی بیوی بھی مسلمان ہو کر آ گئی، تو اس نے کہا: اللہ کے رسول! یہ میرے ساتھ ہی مسلمان ہوئی ہے تو آپ اسے میرے پاس لوٹا دیجئیے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 2239,
			"arabicnumber": 2239,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں ایک عورت مسلمان ہو گئی اور اس نے نکاح بھی کر لیا، اس کے بعد اس کا شوہر رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا، اور کہنے لگا: اللہ کے رسول! میں اسلام لے آیا تھا اور اسے میرے اسلام لانے کا علم تھا چنانچہ رسول اللہ صلی اللہ علیہ وسلم نے دوسرے شوہر سے اسے چھین کر اس کے پہلے شوہر کو لوٹا دیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 2240,
			"arabicnumber": 2240,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنی صاحبزادی زینب رضی اللہ عنہا کو ابوالعاص کے پاس پہلے نکاح پر واپس بھیج دیا اور نئے سرے سے کوئی نکاح نہیں پڑھایا۔ محمد بن عمرو کی روایت میں ہے چھ سال کے بعد ایسا کیا اور حسن بن علی نے کہا: دو سال کے بعد",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 2241,
			"arabicnumber": 2241,
			"text": "حارث بن قیس اسدی رضی اللہ عنہ کہتے ہیں میں نے اسلام قبول کیا، میرے پاس آٹھ بیویاں تھیں تو میں نے اس کا ذکر نبی اکرم صلی اللہ علیہ وسلم سے کیا، آپ صلی اللہ علیہ وسلم نے فرمایا: ان میں سے چار کا انتخاب کر لو ( اور باقی کو طلاق دے دو ) ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 2242,
			"arabicnumber": 2242,
			"text": "اس سند سے بھی قیس بن حارث رضی اللہ عنہ سے اسی مفہوم کی حدیث مروی ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 2243,
			"arabicnumber": 2243,
			"text": "فیروز رضی اللہ عنہ کہتے ہیں کہ میں نے عرض کیا: اللہ کے رسول! میں نے اسلام قبول کر لیا ہے اور میرے نکاح میں دو بہنیں ہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: ان دونوں میں سے جس کو چاہو طلاق دے دو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 2244,
			"arabicnumber": 2244,
			"text": "رافع بن سنان رضی اللہ عنہ سے روایت ہے کہ انہوں نے اسلام قبول کر لیا، لیکن ان کی بیوی نے اسلام قبول کرنے سے انکار کر دیا، اور آپ کے پاس آ کر کہنے لگی: بیٹی میری ہے ( اسے میں اپنے پاس رکھوں گی ) اس کا دودھ چھوٹ چکا تھا، یا چھوٹنے والا تھا، اور رافع نے کہا کہ بیٹی میری ہے ( اسے میں اپنے پاس رکھوں گا ) تو رسول اللہ صلی اللہ علیہ وسلم نے رافع کو ایک طرف اور عورت کو دوسری طرف بیٹھنے کے لیے فرمایا، اور بچی کو درمیان میں بٹھا دیا، پھر دونوں کو اپنی اپنی جانب بلانے کے لیے کہا بچی ماں کی طرف مائل ہوئی، تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: اللہ اسے ہدایت دے ، چنانچہ بچی اپنے باپ کی طرف مائل ہو گئی تو انہوں نے اسے لے لیا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 2245,
			"arabicnumber": 2245,
			"text": "سہل بن سعد ساعدی رضی اللہ عنہما سے روایت ہے کہ عویمر بن اشقر عجلانی، عاصم بن عدی رضی اللہ عنہ سے آ کر کہنے لگے: عاصم! ذرا بتاؤ، اگر کوئی شخص اپنی بیوی کے پاس کسی ( اجنبی ) شخص کو پا لے تو کیا وہ اسے قتل کر دے پھر اس کے بدلے میں تم اسے بھی قتل کر دو گے، یا وہ کیا کرے؟ میرے لیے رسول اللہ صلی اللہ علیہ وسلم سے یہ مسئلہ پوچھو، چنانچہ عاصم رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے اس سلسلہ میں سوال کیا تو آپ صلی اللہ علیہ وسلم نے ( بغیر ضرورت ) اس طرح کے سوالات کو ناپسند فرمایا اور اس کی اس قدر برائی کی کہ عاصم رضی اللہ عنہ پر رسول اللہ صلی اللہ علیہ وسلم کی بات گراں گزری، جب عاصم رضی اللہ عنہ گھر لوٹے تو عویمر رضی اللہ عنہ نے ان کے پاس آ کر پوچھا کہ رسول اللہ صلی اللہ علیہ وسلم نے تم سے کیا فرمایا؟ تو عاصم رضی اللہ عنہ نے کہا: مجھے تم سے کوئی بھلائی نہیں ملی جس مسئلہ کے بارے میں، میں نے سوال کیا اسے رسول صلی اللہ علیہ وسلم نے ناپسند فرمایا۔ عویمر رضی اللہ عنہ نے کہا: اللہ کی قسم میں نبی اکرم صلی اللہ علیہ وسلم سے یہ مسئلہ پوچھ کر رہوں گا، وہ سیدھے آپ کے پاس پہنچ گئے اس وقت آپ لوگوں کے بیچ تشریف فرما تھے، عویمر رضی اللہ عنہ نے کہا: اللہ کے رسول! بتائیے اگر کوئی شخص اپنی بیوی کے ساتھ ( اجنبی ) آدمی کو پا لے تو کیا وہ اسے قتل کر دے پھر آپ لوگ اسے اس کے بدلے میں قتل کر دیں گے، یا وہ کیا کرے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: تمہارے اور تمہاری بیوی کے متعلق قرآن نازل ہوا ہے لہٰذا اسے لے کر آؤ ، سہل کا بیان ہے کہ ان دونوں نے لعان ۱؎ کیا، اس وقت میں لوگوں کے ساتھ رسول اللہ صلی اللہ علیہ وسلم کے پاس موجود تھا، جب وہ ( لعان سے ) فارغ ہو گئے تو عویمر رضی اللہ عنہ نے کہا: اگر میں اسے اپنے پاس رکھوں تو ( گویا ) میں نے جھوٹ کہا ہے چنانچہ عویمر رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم کے حکم سے پہلے ہی اسے تین طلاق دے دی۔ ابن شہاب زہری کہتے ہیں: تو یہی ( ان دونوں ) لعان کرنے والوں کا طریقہ بن گیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 2246,
			"arabicnumber": 2246,
			"text": "سہل رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے عاصم بن عدی رضی اللہ عنہ سے فرمایا: بچے کی ولادت تک عورت کو اپنے پاس روکے رکھو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 2247,
			"arabicnumber": 2247,
			"text": "سہل بن سعد ساعدی رضی اللہ عنہ کہتے ہیں کہ میں ان دونوں کے لعان میں نبی اکرم صلی اللہ علیہ وسلم کے پاس موجود رہا اور میں پندرہ سال کا تھا، پھر انہوں نے پوری حدیث بیان کی لیکن اس میں اتنا اضافہ کیا کہ پھر وہ عورت حاملہ نکلی چنانچہ لڑکے کو اس کی ماں کی جانب منسوب کر کے پکارا جاتا تھا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 2248,
			"arabicnumber": 2248,
			"text": "لعان والی حدیث میں سہل بن سعد رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اس عورت پر نظر رکھو اگر بچہ سیاہ آنکھوں والا، بڑی سرینوں والا ہو تو میں یہی سمجھتا ہوں کہ اس ( شوہر ) نے سچ کہا ہے، اور اگر سرخ رنگ گیرو کی طرح ہو تو میں سمجھتا ہوں کی وہ جھوٹا ہے ، چنانچہ اس کا بچہ ناپسندیدہ صفت پر پیدا ہوا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 2249,
			"arabicnumber": 2249,
			"text": "اس سند سے بھی سہل بن سعد ساعدی رضی اللہ عنہ سے یہی حدیث مروی ہے اس میں ہے: تو اسے یعنی لڑکے کو اس کی ماں کی جانب منسوب کر کے پکارا جاتا تھا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 2250,
			"arabicnumber": 2250,
			"text": "اس سند سے بھی سہل بن سعد رضی اللہ عنہما سے یہی حدیث مروی ہے اس میں ہے: انہوں ( عاصم بن عدی ) نے رسول اللہ صلی اللہ علیہ وسلم کی موجودگی میں اسے تین طلاق دے دی تو رسول صلی اللہ علیہ وسلم نے اسے نافذ فرما دیا، اور جو کام آپ کی موجودگی میں کیا گیا ہو وہ سنت ہے۔ سہل رضی اللہ عنہ کا بیان ہے کہ رسول اللہ صلی اللہ علیہ وسلم کے پاس اس وقت میں موجود تھا، اس کے بعد لعان کرنے والے مرد اور عورت کے سلسلہ میں طریقہ ہی یہ ہو گیا کہ انہیں جدا کر دیا جائے، اور وہ دونوں پھر کبھی اکٹھے نہ ہوں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 2251,
			"arabicnumber": 2251,
			"text": "سہل بن سعد رضی اللہ عنہما کہتے ہیں کہ میں رسول اللہ صلی اللہ علیہ وسلم کے عہد میں دونوں لعان کرنے والوں کے پاس موجود تھا، اور میں پندرہ سال کا تھا، آپ صلی اللہ علیہ وسلم نے ان دونوں کے درمیان لعان کے بعد جدائی کرا دی، یہاں مسدد کی روایت پوری ہو گئی، دیگر لوگوں کی روایت میں ہے کہ: وہ نبی اکرم صلی اللہ علیہ وسلم کے پاس موجود تھے آپ نے دونوں لعان کرنے والے مرد اور عورت کے درمیان جدائی کرا دی تو مرد کہنے لگا: اللہ کے رسول! اگر میں اسے رکھوں تو میں نے اس پر بہتان لگایا ۔ ابوداؤد کہتے ہیں کہ سفیان ابن عیینہ کی کسی نے اس بات پر متابعت نہیں کی کہ: آپ صلی اللہ علیہ وسلم نے دونوں لعان کرنے والوں کے درمیان تفریق کرا دی ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 2252,
			"arabicnumber": 2252,
			"text": "اس سند سے سہل بن سعد رضی اللہ عنہما سے یہی حدیث مروی ہے اس میں ہے کہ: وہ عورت حاملہ تھی اور اس نے اس کے حمل کا انکار کیا، چنانچہ اس عورت کا بیٹا اسی طرف منسوب کر کے پکارا جاتا تھا، اس کے بعد میراث میں بھی یہی طریقہ رہا کہ اللہ تعالیٰ کے مقرر کردہ حصہ میں ماں لڑکے کی وارث ہوتی اور لڑکا ماں کا وارث ہوتا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 2253,
			"arabicnumber": 2253,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ میں ( ایک دفعہ ) جمعہ کی رات مسجد میں تھا کہ اچانک انصار کا ایک شخص مسجد میں آیا، اور کہنے لگا: اگر کوئی شخص اپنی بیوی کے ساتھ کسی ( اجنبی ) آدمی کو پا لے اور ( حقیقت حال ) بیان کرے تو تم لوگ اسے کوڑے لگاؤ گے، یا وہ قتل کر دے تو اس کے بدلے میں تم لوگ اسے قتل کر دو گے، اور اگر وہ چپ رہے تو اندر ہی اندر غصہ میں جلے بھنے، اللہ کی قسم، میں اس سلسلہ میں رسول اللہ صلی اللہ علیہ وسلم سے ضرور دریافت کروں گا، چنانچہ جب دوسرا دن ہوا تو وہ رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا اور اس نے عرض کیا کہ اگر کوئی شخص اپنی بیوی کے ساتھ کسی ( اجنبی ) آدمی کو پا لے اور حقیقت حال بیان کرے تو ( تہمت کی حد کے طور پر ) آپ اسے کوڑے لگائیں گے، یا وہ قتل کر دے تو اسے قتل کر دیں گے، یا وہ خاموشی اختیار کر کے اندر ہی غصہ سے جلے بھنے، یہ سن کر آپ صلی اللہ علیہ وسلم دعا کرنے لگے: اے اللہ! معاملے کی وضاحت فرما دے ، چنانچہ لعان کی آیت «والذين يرمون أزواجهم ولم يكن لهم شهداء إلا أنفسهم» اور جو لوگ اپنی بیویوں کو تہمت لگاتے ہیں اور ان کے پاس گواہ نہ ہوں ( سورۃ النور: ۶ ) آخر تک نازل ہوئی تو لوگوں میں یہی شخص اس مصیبت میں مبتلا ہوا چنانچہ وہ دونوں میاں بیوی رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور ان دونوں نے لعان کیا، اس آدمی نے چار بار اللہ کا نام لے کر اپنے سچے ہونے کی گواہی دی، اور پانچویں بار کہا کہ اگر وہ جھوٹا ہو تو اس پر اللہ کی لعنت ہو، پھر عورت لعان کرنے چلی تو آپ صلی اللہ علیہ وسلم نے فرمایا: ٹھہرو ، لیکن وہ نہیں مانی اور لعان کر ہی لیا، تو جب وہ دونوں جانے لگے، تو آپ صلی اللہ علیہ وسلم نے فرمایا: شاید یہ عورت کالا گھنگرالے بالوں والا بچہ جنم دے چنانچہ اس نے وہ کالا اور گھنگرالے بالوں والا بچہ ہی جنم دیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 2254,
			"arabicnumber": 2254,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ ہلال بن امیہ رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم کے پاس اپنی بیوی پر شریک بن سحماء کے ساتھ ( زنا کی ) تہمت لگائی تو آپ صلی اللہ علیہ وسلم نے فرمایا: ثبوت لاؤ ورنہ پیٹھ پر کوڑے لگیں گے ، تو ہلال نے کہا کہ: اللہ کے رسول! جب ہم میں سے کوئی شخص کسی آدمی کو اپنی بیوی کے ساتھ دیکھے تو وہ گواہ ڈھونڈنے جائے؟ اس پر بھی نبی اکرم صلی اللہ علیہ وسلم یہی فرمائے جا رہے تھے کہ: گواہ لاؤ، ورنہ تمہاری پیٹھ پر کوڑے پڑیں گے ، تو ہلال نے کہا: اس ذات کی قسم جس نے آپ کو حق کے ساتھ نبی بنا کر بھیجا ہے میں بالکل سچا ہوں اور اللہ تعالیٰ ضرور میرے بارے میں وحی نازل کر کے میری پیٹھ کو حد سے بری کرے گا، چنانچہ «والذين يرمون أزواجهم ولم يكن لهم شهداء إلا أنفسهم» کی آیت نازل ہوئی، آپ صلی اللہ علیہ وسلم نے اسے پڑھا یہاں تک کہ آپ پڑھتے پڑھتے «من الصادقين» ۱؎ تک پہنچے، پھر آپ صلی اللہ علیہ وسلم پلٹے اور آپ نے ان دونوں کو بلوایا، وہ دونوں آئے، پہلے ہلال بن امیہ کھڑے ہوئے اور گواہی دینے لگے، نبی اکرم صلی اللہ علیہ وسلم فرما رہے تھے: اللہ خوب جانتا ہے کہ تم میں سے ایک جھوٹا ہے، تو کیا تم دونوں میں سے کوئی توبہ کرنے والا ہے؟ پھر عورت کھڑی ہوئی اور گواہی دینے لگی، پانچویں بار میں جب ان الفاظ کے کہنے کی باری آئی کہ اگر وہ سچا ہے تو مجھ پر اللہ کا غضب نازل ہو تو لوگ اس سے کہنے لگے: یہ عذاب کو واجب کر دینے والا ہے۔ عبداللہ بن عباس رضی اللہ عنہما کا بیان ہے: تو وہ ہچکچائی اور ہٹ گئی اور ہمیں یہ گمان ہوا کہ وہ باز آ جائے گی، لیکن پھر کہنے لگی: ہمیشہ کے لیے میں اپنی قوم پر رسوائی کا داغ نہ لگاؤں گی ( یہ کہہ کر ) اس نے آخری جملہ کو بھی ادا کر دیا۔ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: دیکھو اس کا ہونے والا بچہ اگر سرمگیں آنکھوں، بڑی سرینوں اور موٹی پنڈلیوں والا ہوا تو وہ شریک بن سحماء کا ہے ، چنانچہ انہیں صفات کا بچہ پیدا ہوا تو آپ صلی اللہ علیہ وسلم نے فرمایا: اگر اللہ کی کتاب کا فیصلہ نہ آ گیا ہوتا تو میرا اور اس کا معاملہ کچھ اور ہوتا ، یعنی میں اس پر حد جاری کرتا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 2255,
			"arabicnumber": 2255,
			"text": "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے جس وقت دونوں کو لعان کا حکم فرمایا تو ایک شخص کو حکم دیا کہ پانچویں بار میں اپنا ہاتھ مرد کے منہ پر رکھ دے اور کہے: یہ ( عذاب کو ) واجب کرنے والا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 2256,
			"arabicnumber": 2256,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ ہلال بن امیہ رضی اللہ عنہ ( جو کہ ان تین اشخاص میں سے ایک تھے جن کی اللہ تعالیٰ نے ( ایک غزوہ میں پچھڑ جانے کی وجہ سے سرزنش کے بعد ) توبہ قبول فرمائی تھی، وہ ) اپنی زمین سے رات کو آئے تو اپنی بیوی کے پاس ایک آدمی کو پایا، اپنی آنکھوں سے سارا منظر دیکھا، اور کانوں سے پوری گفتگو سنی، لیکن صبح تک اس معاملہ کو دبا کر رکھا، صبح ہوئی تو رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے، اور عرض کیا: اللہ کے رسول! رات کو میں گھر آیا تو اپنی بیوی کے پاس ایک مرد کو پایا، اپنی آنکھوں سے ( سب کچھ ) دیکھا، اور کانوں سے ( سب ) سنا، ان کی ان باتوں کو آپ نے ناپسند کیا اور ان پر ناگواری کا اظہار فرمایا، تو یہ دونوں آیتیں نازل ہوئیں «والذين يرمون أزواجهم ولم يكن لهم شهداء إلا أنفسهم فشهادة أحدهم» اور جو لوگ اپنی بیویوں پر بدکاری کی تہمت لگائیں اور ان کے پاس کوئی گواہ بجز ان کی ذات کے نہ ہو تو ایسے لوگوں میں سے ہر ایک کا ثبوت یہ ہے کہ چار مرتبہ اللہ کی قسم کھا کر کہیں کہ وہ سچوں میں سے ہیں اور پانچویں مرتبہ کہے کہ اس پر اللہ تعالیٰ کی لعنت ہو اگر وہ جھوٹوں میں سے ہو ( سورۃ النور: ۷، ۶ ) پھر رسول اللہ صلی اللہ علیہ وسلم سے جب وحی کی کیفیت دور ہوئی تو آپ نے فرمایا: ہلال! خوش ہو جاؤ، اللہ تعالیٰ نے تمہارے لیے کشادگی کا راستہ نکال دیا ہے ، ہلال رضی اللہ عنہ نے کہا: مجھے اپنے پروردگار سے اسی کی امید تھی۔ اس کے بعد رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اسے بلواؤ ، تو وہ آئی تو آپ نے دونوں پر یہ آیتیں تلاوت فرمائیں، اور نصیحت کی نیز بتایا کہ: آخرت کا عذاب دنیا کے عذاب سے بہت سخت ہے ۔ ہلال رضی اللہ عنہ نے کہا: قسم اللہ کی میں نے اس کے متعلق جو کہا ہے سچ کہا ہے، وہ کہنے لگی: یہ جھوٹے ہیں، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ان کے درمیان لعان کراؤ ، چنانچہ ہلال رضی اللہ عنہ سے کہا گیا کہ وہ گواہی دیں تو انہوں نے چار بار اللہ کا نام لے کر گواہی دی کہ وہ سچے ہیں، پانچویں کے وقت کہا گیا: ہلال! اللہ سے ڈرو کیونکہ دنیا کا عذاب آخرت کے عذاب کے مقابلے میں بہت آسان ہے، اور اس بار کی گواہی تمہارے لیے عذاب کو واجب کر دے گی، وہ بولے: اللہ کی قسم! جس طرح اللہ تعالیٰ نے مجھے کوڑوں سے بچایا ہے اسی طرح عذاب سے بھی بچائے گا، چنانچہ پانچویں گواہی بھی دے دی کہ اگر وہ جھوٹے ہوں تو ان پر اللہ کی لعنت ہو۔ پھر عورت سے گواہی دینے کے لیے کہا گیا، تو اس نے بھی چار بار گواہی دی کہ وہ جھوٹے ہیں، پانچویں بار اس سے بھی کہا گیا کہ اللہ سے ڈر جا کیونکہ دنیا کا عذاب آخرت کے عذاب کے مقابلے میں بہت آسان ہے، اور اس دفعہ کی گواہی عذاب کو واجب کر دے گی، یہ سن کر وہ ایک لمحہ کے لیے ہچکچائی پھر بولی: اللہ کی قسم میں اپنی قوم کو رسوا نہ کروں گی، چنانچہ پانچویں بار بھی گواہی دے دی کہ اگر وہ سچے ہوں تو مجھ پر اللہ کی لعنت ہو۔ اس کے بعد رسول اللہ صلی اللہ علیہ وسلم نے ان کے درمیان تفریق کرا دی، اور فیصلہ فرمایا کہ اس کا لڑکا باپ کی طرف نہ منسوب کیا جائے، اور لڑکے اور عورت کو تہمت نہ لگائی جائے جو اس پر یا اس کے لڑکے پر اب تہمت لگائے گا تو اس پر تہمت کی حد جاری کی جائے گی، نیز آپ صلی اللہ علیہ وسلم نے فیصلہ فرمایا کہ اسے نان نفقہ اور رہائش نہیں ملے گی، کیونکہ ان کی جدائی نہ تو طلاق کی بنا پر ہوئی ہے اور نہ شوہر کے انتقال کی وجہ سے، اور آپ صلی اللہ علیہ وسلم نے فرمایا: اگر وہ بھورے بالوں والا، پتلی سرین والا، چوڑی پیٹھ والا اور پتلی پنڈلیوں والا بچہ جنے تو وہ ہلال کا ( نطفہ ) ہے، اور اگر مٹیالے رنگ والا، گھنگرالے بالوں والا، موٹی پنڈلیوں والا، اور بھاری سرین والا جنے تو اس کا جس کے نام کی تہمت لگائی گئی ہے ، چنانچہ اس عورت کا بچہ مٹیالے رنگ کا گھنگرالے بالوں والا، موٹی پنڈلیوں والا اور بھاری سرین والا پیدا ہوا تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اگر قسمیں نہ ہوتیں تو میرا اور اس کا معاملہ کچھ اور ہوتا ۔ عکرمہ کہتے ہیں: یہی بچہ آگے چل کر مضر کا امیر بنا، اسے باپ کی جانب منسوب نہیں کیا جاتا تھا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 2257,
			"arabicnumber": 2257,
			"text": "سعید بن جبیر کہتے ہیں: میں نے ابن عمر رضی اللہ عنہما کو کہتے سنا کہ رسول اللہ صلی اللہ علیہ وسلم نے دونوں لعان کرنے والوں سے فرمایا: تم دونوں کا حساب اللہ پر ہے، تم میں سے ایک تو جھوٹا ہے ہی ( مرد سے فرمایا ) اب تجھے اس پر کچھ اختیار نہیں ، اس پر اس نے کہا: اللہ کے رسول! میرے مال کا کیا ہو گا؟ آپ صلی اللہ علیہ وسلم نے فرمایا: تمہارا کوئی مال نہیں، اگر تم اس پر تہمت لگانے میں سچے ہو تو مال کے بدلے اس کی شرمگاہ حلال کر چکے ہو اور اگر تم نے اس پر جھوٹ بولا ہے تب تو کسی طرح بھی تم مال کے مستحق نہیں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 2258,
			"arabicnumber": 2258,
			"text": "سعید بن جبیر کہتے ہیں کہ میں نے ابن عمر رضی اللہ عنہما سے جو کہا کہ ایک شخص اپنی عورت کو تہمت لگائے تو اس کا کیا حکم ہے؟ تو انہوں نے کہا: رسول اللہ صلی اللہ علیہ وسلم نے بنو عجلان کے دونوں بھائی بہنوں ۱؎ کو ( اس صورت میں ) جدا کرا دیا تھا اور فرمایا تھا: اللہ تعالیٰ جانتا ہے کہ تم میں ایک ضرور جھوٹا ہے، تو کیا تم دونوں میں کوئی توبہ کرنے والا ہے؟ آپ صلی اللہ علیہ وسلم نے ان الفاظ کو تین بار دہرایا لیکن ان دونوں نے انکار کیا تو آپ نے ان کے درمیان علیحدگی کرا دی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 2259,
			"arabicnumber": 2259,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں ایک شخص نے اپنی عورت سے لعان کیا اور اس کے بچے کا باپ ہونے سے انکار کر دیا چنانچہ رسول اللہ صلی اللہ علیہ وسلم نے ان کے درمیان علیحدگی کرا دی، اور بچے کو عورت سے ملا دیا۱؎۔ ابوداؤد کہتے ہیں: جس کی روایت میں مالک منفرد ہیں وہ «وألحق الولد بالمرأة» کا جملہ ہے، اور یونس نے زہری سے انہوں نے سہل بن سعد رضی اللہ عنہ سے لعان کی حدیث روایت کی ہے اس میں ہے: اس نے اس کے حمل کا انکار کیا تو اس ( عورت ) کا بیٹا اسی ( عورت ) کی طرف منسوب کیا جاتا تھا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 2260,
			"arabicnumber": 2260,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم کے پاس بنی فزارہ کا ایک شخص آیا اور کہنے لگا: میری عورت نے ایک کالا بچہ جنا ہے، تو آپ صلی اللہ علیہ وسلم نے فرمایا: کیا تمہارے پاس اونٹ ہیں؟ اس نے جواب دیا: ہاں، پوچھا: کون سے رنگ کے ہیں؟ جواب دیا: سرخ ہیں، آپ صلی اللہ علیہ وسلم نے پوچھا: کیا کوئی خاکستری بھی ہے؟ جواب دیا: ہاں، خاکی رنگ کا بھی ہے، آپ صلی اللہ علیہ وسلم نے پوچھا: پھر یہ کہاں سے آ گیا؟ ، بولا: شاید کسی رگ نے یہ رنگ کھینچ لیا ہو، آپ صلی اللہ علیہ وسلم نے فرمایا: یہاں بھی ہو سکتا ہے ( تمہارے لڑکے میں بھی ) کسی رگ نے یہ رنگ کھینچ لیا ہو ۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 2261,
			"arabicnumber": 2261,
			"text": "اس سند سے بھی زہری سے اسی مفہوم کی حدیث مروی ہے لیکن اس میں یہ ہے کہ یہ کہہ کر اس کا مقصد اپنے سے بچہ کی نفی کرنی تھی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 2262,
			"arabicnumber": 2262,
			"text": "اس سند سے بھی ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ ایک دیہاتی رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور کہنے لگا: میری عورت نے ایک کالا لڑکا جنا ہے اور میں اس کا انکار کرتا ہوں، پھر راوی نے اسی مفہوم کی حدیث بیان کی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 2263,
			"arabicnumber": 2263,
			"text": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ جس وقت آیت لعان نازل ہوئی انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: جس عورت نے کسی قوم میں ایسے فرد کو شامل کر دیا جو حقیقت میں اس قوم کا فرد نہیں ہے، تو وہ اللہ کی رحمت سے دور رہے گی، اسے اللہ تعالیٰ جنت میں ہرگز داخل نہ کرے گا، اسی طرح جس شخص نے اپنے بچے کا انکار کیا حالانکہ اسے معلوم ہے کہ وہ اس کا بچہ ہے، اسے اللہ تعالیٰ کا دیدار نصیب نہ ہو گا، اور وہ اگلی پچھلی ساری مخلوق کے سامنے اسے رسوا کرے گا ۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 2264,
			"arabicnumber": 2264,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اسلام میں اجرت پر بدکاری اور زنا نہیں ہے، جس نے زمانہ جاہلیت میں بدکاری اور زنا سے کمائی کی، تو زنا سے پیدا ہونے والا بچہ اپنے عصبہ ( مالک ) سے مل جائے گا اور جس نے بغیر نکاح یا ملک کے کسی بچے کا دعویٰ کیا تو نہ تو ( بچہ ) اس کا وارث ہو گا اور نہ وہ بچے کا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 2265,
			"arabicnumber": 2265,
			"text": "عبداللہ بن عمرو بن العاص رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فیصلہ فرمایا کہ جس لڑکے کو اس کے باپ کے مرنے کے بعد اس باپ سے ملایا جائے جس کے نام سے اسے پکارا جاتا ہے اور باپ کے وارث اسے اپنے سے ملانے کا دعویٰ کریں تو اگر اس کی پیدائش ایسی لونڈی سے ہوئی ہے جو صحبت کے دن اس کے ملکیت میں رہی ہو تو ملانے والے سے اس کا نسب مل جائے گا اور جو ترکہ اس کے ملائے جانے سے پہلے تقسیم ہو گیا ہے اس میں اس کو حصہ نہ ملے گا، البتہ جو ترکہ تقسیم نہیں ہوا ہے اس میں اسے حصہ دیا جائے گا، لیکن جس باپ سے اس کا نسب ملایا جاتا ہے اس نے ( اپنی زندگی میں اس کے بیٹا ہونے سے ) انکار کیا ہو تو وارثوں کے ملانے سے وہ نہیں ملے گا، اگر وہ لڑکا ایسی لونڈی سے ہو جس کا مالک اس کا باپ نہ تھا یا آزاد عورت سے ہو جس سے اس کے باپ نے زنا کیا تو اس کا نسب نہ ملے گا اور نہ اس کا وارث ہو گا گرچہ جس کے نام سے اسے پکارا جاتا ہے اسی نے ( اپنی زندگی میں ) اس کے بیٹا ہونے کا دعویٰ کیا ہو کیونکہ وہ زنا کی اولاد ہے آزاد عورت سے ہو یا لونڈی سے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 2266,
			"arabicnumber": 2266,
			"text": "اس سند سے بھی محمد بن راشد سے اسی مفہوم کی روایت منقول ہے لیکن اس میں یہ الفاظ زائد ہیں کہ وہ ولد الزنا ہے اور اپنی ماں کے خاندان سے ملے گا چاہے وہ آزاد ہوں یا غلام، یہ شروع اسلام میں پیش آمدہ معاملہ کا حکم ہے، رہا جو مال قبل از اسلام تقسیم ہو چکا اس سے کچھ سروکار نہیں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 2267,
			"arabicnumber": 2267,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم میرے پاس ( مسدد اور ابن سرح کی روایت میں ہے ) ایک دن خوش و خرم تشریف لائے ( اور عثمان کی روایت میں ہے آپ کے چہرے پر خوشی کی لکیریں ۱؎ محسوس کی جا رہی تھیں ) تو آپ صلی اللہ علیہ وسلم نے فرمایا: عائشہ! کیا تو نے دیکھا نہیں کہ مجزز مدلجی نے زید بن حارثہ اور اسامہ بن زید کو اس حال میں دیکھا کہ وہ دونوں اپنے سر چادر سے ڈھانکے ہوئے تھے اور پیر کھلے ہوئے تھے تو کہا کہ یہ پاؤں ایک دوسرے سے ملتے جلتے ہیں ۔ ابوداؤد کہتے ہیں: اسامہ کالے تھے اور زید گورے تھے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 2268,
			"arabicnumber": 2268,
			"text": "اس سند سے بھی زہری نے اسی طریق سے اسی مفہوم کی روایت بیان کی ہے اس میں ہے کہ ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں: آپ صلی اللہ علیہ وسلم میرے پاس خوش و خرم تشریف لائے آپ کے چہرے کی لکیریں چمک رہی تھیں۔ ابوداؤد کہتے ہیں: «أسارير وجهه» کے الفاظ کو ابن عیینہ یاد نہیں رکھ سکے، ابوداؤد کہتے ہیں: «أسارير وجهه» ابن عیینہ کی جانب سے تدلیس ہے انہوں نے اسے زہری سے نہیں سنا ہے انہوں نے «أسارير وجهه» کے بجائے «لأسارير من غير» کے الفاظ سنے ہیں اور «أسارير» کا ذکر لیث وغیرہ کی حدیث میں ہے۔ ابوداؤد کہتے ہیں: میں نے احمد بن صالح کو یہ کہتے ہوئے سنا کہ اسامہ رضی اللہ عنہ تارکول کی طرح بہت زیادہ کالے تھے ۱؎ اور زید رضی اللہ عنہ روئی کی طرح سفید۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 2269,
			"arabicnumber": 2269,
			"text": "زید بن ارقم رضی اللہ عنہ کہتے ہیں کہ میں نبی اکرم صلی اللہ علیہ وسلم کے پاس بیٹھا ہوا تھا اتنے میں یمن کا ایک آدمی آیا اور کہنے لگا: اہل یمن میں سے تین آدمی علی رضی اللہ عنہ کے پاس ایک لڑکے کے لیے جھگڑتے ہوئے آئے، ان تینوں نے ایک عورت سے ایک ہی طہر ( پاکی ) میں جماع کیا تھا، تو علی رضی اللہ عنہ نے ان میں سے دو سے کہا کہ تم دونوں خوشی سے یہ لڑکا اسے ( تیسرے کو ) دے دو، یہ سن کر وہ دونوں بھڑک گئے، پھر دو سے یہی بات کہی، وہ بھی بھڑک اٹھے، پھر دو سے اسی طرح گفتگو کی لیکن وہ بھی بھڑک اٹھے، چنانچہ علی رضی اللہ عنہ نے کہا کہ: تم تو باہم ضد کرنے والے ساجھی دار ہو لہٰذا میں تمہارے درمیان قرعہ اندازی کرتا ہوں، جس کے نام کا قرعہ نکلے گا، لڑکا اسی کو ملے گا اور وہ اپنے ساتھیوں کو ایک ایک تہائی دیت ادا کرے گا ، آپ نے قرعہ ڈالا اور جس کا نام نکلا اس کو لڑکا دے دیا، یہ سن کر رسول اللہ صلی اللہ علیہ وسلم ہنسے یہاں تک کہ آپ کی ڈاڑھیں یا کچلیاں نظر آنے لگیں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 2270,
			"arabicnumber": 2270,
			"text": "زید بن ارقم رضی اللہ عنہ کہتے ہیں کہ علی رضی اللہ عنہ کے پاس یمن میں تین آدمی ( ایک لڑکے کے لیے جھگڑا لے کر ) آئے جنہوں نے ایک عورت سے ایک ہی طہر میں صحبت کی تھی، تو آپ نے ان میں سے دو سے پوچھا: کیا تم دونوں یہ لڑکا اسے ( تیسرے کو ) دے سکتے ہو؟ انہوں نے کہا: نہیں، اس طرح آپ نے سب سے دریافت کیا، اور سب نے نفی میں جواب دیا، چنانچہ ان کے درمیان قرعہ اندازی کی، اور جس کا نام نکلا اسی کو لڑکا دے دیا، نیز اس کے ذمہ ( دونوں ساتھیوں کے لیے ) دو تہائی دیت مقرر فرمائی، رسول اللہ صلی اللہ علیہ وسلم کے سامنے جب اس کا تذکرہ آیا تو آپ ہنسے یہاں تک کہ آپ کی کچلیاں ظاہر ہو گئیں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 2271,
			"arabicnumber": 2271,
			"text": "خلیل یا ابن خلیل کہتے ہیں کہ علی بن ابی طالب رضی اللہ عنہ کے پاس ایک عورت کا مقدمہ لایا گیا جس نے تین آدمیوں سے صحبت کے بعد ایک لڑکا جنا تھا، آگے اسی طرح کی روایت ہے اس میں نہ تو انہوں نے یمن کا ذکر کیا ہے، نہ ہی نبی اکرم صلی اللہ علیہ وسلم کا، اور نہ ( علی رضی اللہ عنہ کے ) اس قول کا کہ خوشی سے تم دونوں لڑکے کو اسے ( تیسرے کو ) دے دو۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 2272,
			"arabicnumber": 2272,
			"text": "محمد بن مسلم بن شہاب کہتے ہیں کہ عروہ بن زبیر نے مجھے خبر دی ہے کہ ام المؤمنین عائشہ رضی اللہ عنہا نے انہیں بتایا کہ زمانہ جاہلیت میں چار قسم کے نکاح ہوتے تھے: ایک تو ایسے ہی جیسے اس زمانے میں ہوتا ہے کہ ایک شخص دوسرے شخص کے پاس اس کی بہن یا بیٹی وغیرہ کے لیے نکاح کا پیغام دیتا ہے وہ مہر ادا کرتا ہے اور نکاح کر لیتا ہے۔ نکاح کی دوسری قسم یہ تھی کہ آدمی اپنی بیوی سے حیض سے پاک ہونے کے بعد کہہ دیتا کہ فلاں شخص کو بلوا لے، اور اس کا نطفہ حاصل کر لے پھر وہ شخص تب تک اپنی بیوی سے صحبت نہ کرتا جب تک کہ مطلوبہ شخص سے حمل نہ قرار پا جاتا، حمل ظاہر ہونے کے بعد ہی وہ چاہتا تو اس سے جماع کرتا، ایسا اس لیے کیا جاتا تھا تاکہ لڑکا نجیب ( عمدہ نسب کا ) ہو، اس نکاح کو نکاح استبضاع ( نطفہ حاصل کرنے کا نکاح ) کہا جاتا تھا۔ نکاح کی تیسری قسم یہ تھی کہ نو افراد تک کا ایک گروہ بن جاتا پھر وہ سب اس سے صحبت کرتے رہتے، جب وہ حاملہ ہو جاتی اور بچے کی ولادت ہوتی تو ولادت کے کچھ دن بعد وہ عورت ان سب لوگوں کو بلوا لیتی، کوئی آنے سے انکار نہ کرتا، جب سب جمع ہو جاتے تو کہتی: تمہیں اپنا حال معلوم ہی ہے، اور میں نے بچہ جنا ہے، پھر وہ جسے چاہتی اس کا نام لے کر کہتی کہ اے فلاں! یہ تیرا بچہ ہے، اور اس بچے کو اس کے ساتھ ملا دیا جاتا۔ نکاح کی چوتھی قسم یہ تھی کہ بہت سے لوگ جمع ہو جاتے اور ایک عورت سے صحبت کرتے، وہ کسی بھی آنے والے کو منع نہ کرتی، یہ بدکار عورتیں ہوتیں، ان کے دروازوں پر بطور نشانی جھنڈے لگے ہوتے، جو شخص بھی چاہتا ان سے صحبت کرتا، جب وہ حاملہ ہو جاتی اور بچہ جن دیتی تو سب جمع ہو جاتے، اور قیافہ شناس کو بلاتے، وہ جس کا بھی نام لیتا اس کے ساتھ ملا دیا جاتا، وہ بچہ اس کا ہو جاتا اور وہ کچھ نہ کہہ پاتا، تو جب اللہ تعالیٰ نے محمد صلی اللہ علیہ وسلم کو نبی بنا کر بھیجا تو زمانہ جاہلیت کے سارے نکاحوں کو باطل قرار دے دیا سوائے اہل اسلام کے نکاح کے جو آج رائج ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 2273,
			"arabicnumber": 2273,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ سعد بن ابی وقاص اور عبد بن زمعہ رضی اللہ عنہما دونوں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں زمعہ کی لونڈی کے بیٹے کا جھگڑا لے آئے، سعد رضی اللہ عنہ کہنے لگے: میرے بھائی عتبہ نے مجھے وصیت کی تھی کہ جب میں مکہ جاؤں تو زمعہ کی لونڈی کے بچے کو دیکھوں تو اس کو لے لوں کیونکہ وہ انہیں کا بیٹا ہے، اور عبد بن زمعہ رضی اللہ عنہ کہنے لگے: یہ میرا بھائی ہے کیونکہ میرے والد کی لونڈی کا بیٹا ہے، اور میرے والد کے بستر پر اس کی ولادت ہوئی ہے، چنانچہ رسول اللہ صلی اللہ علیہ وسلم نے عتبہ کے ساتھ کھلی مشابہت دیکھی ( اس کے باوجود ) آپ صلی اللہ علیہ وسلم نے فرمایا: بچہ بستر والے کا ہے، اور زانی کے لیے سنگساری ہے، اور سودہ! تم اس سے پردہ کرو ۔ مسدد نے اپنی روایت میں یہ الفاظ زیادہ کئے ہیں کہ آپ نے فرمایا: عبد! یہ تیرا بھائی ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 2274,
			"arabicnumber": 2274,
			"text": "عبداللہ بن عمرو رضی اللہ عنہما کہتے ہیں کہ ایک شخص کھڑا ہوا اور کہنے لگا: اللہ کے رسول! فلاں میرا بیٹا ہے میں نے زمانہ جاہلیت میں اس کی ماں سے زنا کیا تھا، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اسلام میں اس طرح کا مطالبہ صحیح نہیں، زمانہ جاہلیت کی بات ختم ہوئی، بچہ صاحب بستر کا ہے اور زانی کے لیے سنگساری ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 2275,
			"arabicnumber": 2275,
			"text": "رباح کہتے ہیں کہ میرے گھر والوں نے اپنی ایک رومی لونڈی سے میرا نکاح کر دیا، میں نے اس سے جماع کیا تو اس نے میری ہی طرح کالا لڑکا جنا جس کا نام میں نے عبداللہ رکھا، میں نے پھر جماع کیا تو اس نے میری ہی طرح ایک اور کالے لڑکے کو جنم دیا جس کا نام میں نے عبیداللہ رکھا، اس کے بعد میرے خاندان کے یوحنا نامی ایک رومی غلام نے اسے پھانس لیا اور اس نے اس سے اپنی زبان میں بات کی چنانچہ گرگٹ جیسا ( سرخ ) رنگ کا بچہ اس سے پیدا ہوا، میں نے پوچھا: یہ کیا ہے؟ کہنے لگی: یہ یوحنا کا بچہ ہے تو ہم نے یہ معاملہ عثمان رضی اللہ عنہ کی عدالت میں پیش کیا، تو انہوں نے ان سے بازپرس کی تو دونوں نے اعتراف کر لیا، پھر انہوں نے ان دونوں سے کہا: کیا تم دونوں اس بات پر رضامند ہو کہ میں تمہارا فیصلہ اس طرح کر دوں جس طرح کہ رسول اللہ صلی اللہ علیہ وسلم نے فیصلہ فرمایا تھا؟ آپ نے فیصلہ فرمایا کہ بچہ بستر والے کا ہے ۔ راوی کا خیال ہے کہ پھر ان دونوں کو کوڑے لگائے، ( سنگسار نہیں کیا ) کیونکہ وہ دونوں لونڈی و غلام تھے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 2276,
			"arabicnumber": 2276,
			"text": "عبداللہ بن عمرو رضی اللہ عنہما سے روایت ہے کہ ایک عورت نے رسول اللہ صلی اللہ علیہ وسلم سے عرض کیا: اللہ کے رسول! یہ میرا بیٹا ہے، میرا پیٹ اس کا گھر رہا، میری چھاتی اس کے پینے کا برتن بنی، میری گود اس کا ٹھکانہ بنی، اب اس کے باپ نے مجھے طلاق دے دی ہے، اور اسے مجھ سے چھیننا چاہتا ہے، تو آپ صلی اللہ علیہ وسلم نے فرمایا: جب تک تو ( دوسرا ) نکاح نہیں کر لیتی اس کی تو ہی زیادہ حقدار ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 2277,
			"arabicnumber": 2277,
			"text": "ہلال بن اسامہ سے روایت ہے کہ ابومیمونہ سلمی جو اہل مدینہ کے مولی اور ایک سچے آدمی ہیں کا بیان ہے کہ میں ایک بار ابوہریرہ رضی اللہ عنہ کے پاس بیٹھا تھا کہ اسی دوران ان کے پاس ایک فارسی عورت آئی جس کے ساتھ اس کا لڑکا بھی تھا، اس کے شوہر نے اسے طلاق دے دی تھی اور وہ دونوں ہی اس کے دعویدار تھے، عورت کہنے لگی: ابوہریرہ! ( پھر اس نے فارسی زبان میں گفتگو کی ) میرا شوہر مجھ سے میرے بیٹے کو لے لینا چاہتا ہے۔ ابوہریرہ رضی اللہ عنہ نے کہا: تم دونوں اس کے لیے قرعہ اندازی کرو، ابوہریرہ رضی اللہ عنہ نے بھی فارسی زبان ہی میں اس سے گفتگو کی، اتنے میں اس کا شوہر آیا اور کہنے لگا: میرے لڑکے کے بارے میں مجھ سے کون جھگڑا کر سکتا ہے؟ ابوہریرہ رضی اللہ عنہ نے کہا: یا اللہ! میں نے تو یہ فیصلہ صرف اس وجہ سے کیا ہے کہ میں نے ایک عورت کو کہتے سنا تھا وہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں آئی میں آپ کے پاس بیٹھا تھا، وہ کہنے لگی: اللہ کے رسول! میرا شوہر میرے بیٹے کو مجھ سے لے لینا چاہتا ہے، حالانکہ وہ ابوعنبہ کے کنویں سے مجھے پانی لا کر پلاتا ہے اور وہ مجھے فائدہ پہنچاتا ہے، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تم دونوں اس کے لیے قرعہ اندازی کرو ، اس کا شوہر بولا: میرے لڑکے کے متعلق مجھ سے کون جھگڑا کر سکتا ہے تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: یہ تیرا باپ ہے، اور یہ تیری ماں ہے، ان میں سے تو جس کا بھی چاہے ہاتھ تھام لے ، چنانچہ اس نے اپنی ماں کا ہاتھ پکڑ لیا، اور وہ اسے لے کر چلی گئی ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 2278,
			"arabicnumber": 2278,
			"text": "علی رضی اللہ عنہ کہتے ہیں کہ زید بن حارثہ رضی اللہ عنہ مکہ گئے تو حمزہ رضی اللہ عنہ کی صاحبزادی کو لے آئے، جعفر رضی اللہ عنہ کہنے لگے: اسے میں لوں گا، میں اس کا زیادہ حقدار ہوں، یہ میری چچا زاد بہن ہے، نیز اس کی خالہ میرے پاس ہے، اور خالہ ماں کے درجے میں ہوتی ہے، اور علی رضی اللہ عنہ کہنے لگے: اس کا زیادہ حقدار میں ہوں کیونکہ یہ میری چچا زاد بہن ہے، نیز رسول اللہ صلی اللہ علیہ وسلم کی بیٹی میرے نکاح میں ہے، وہ بھی اس کی زیادہ حقدار ہیں اور زید رضی اللہ عنہ نے کہا: سب سے زیادہ اس کا حقدار میں ہوں کیونکہ میں اس کے پاس گیا، اور سفر کر کے اسے لے کر آیا ہوں، اتنے میں نبی اکرم صلی اللہ علیہ وسلم تشریف لے آئے تو علی رضی اللہ عنہ نے آپ سے اس کا ذکر کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا: لڑکی کا فیصلہ میں جعفر کے حق میں کرتا ہوں وہ اپنی خالہ کے پاس رہے گی اور خالہ ماں کے درجے میں ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 2279,
			"arabicnumber": 2279,
			"text": "عبدالرحمٰن بن ابی لیلی سے یہی حدیث مروی ہے لیکن پوری نہیں ہے اس میں ہے کہ: آپ صلی اللہ علیہ وسلم نے فیصلہ فرمایا کہ لڑکی جعفر رضی اللہ عنہ کے پاس رہے گی، کیونکہ ان کے نکاح میں اس کی خالہ ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 2280,
			"arabicnumber": 2280,
			"text": "علی رضی اللہ عنہ کہتے ہیں کہ جب ہم مکہ سے نکلے تو ہمارے پیچھے پیچھے حمزہ کی لڑکی چچا چچا پکارتی آ گئی، علی رضی اللہ عنہ ہاتھ پکڑ کر اسے اپنے ساتھ لے آئے اور ( فاطمہ رضی اللہ عنہا سے ) کہا: اپنے چچا کی لڑکی کو لو، انہوں نے اسے اٹھا لیا، راوی نے پھر پورا قصہ بیان کیا اور کہا کہ: جعفر رضی اللہ عنہ کہنے لگے: یہ میرے چچا کی بیٹی ہے، اور اس کی خالہ میرے نکاح میں ہے چنانچہ رسول اللہ صلی اللہ علیہ وسلم نے خالہ کے حق میں فیصلہ دیا اور فرمایا: خالہ ماں کے درجے میں ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 2281,
			"arabicnumber": 2281,
			"text": "اسماء بنت یزید بن سکن انصاریہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں انہیں طلاق دے دی گئی، اس وقت مطلقہ کی کوئی عدت نہیں تھی تو اللہ تعالیٰ نے طلاق کی عدت کا حکم نازل فرمایا چنانچہ یہی پہلی خاتون ہیں جن کے متعلق مطلقہ عورتوں کی عدت کا حکم نازل ہوا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 2282,
			"arabicnumber": 2282,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ اللہ تعالیٰ نے ارشاد فرمایا: «والمطلقات يتربصن بأنفسهن ثلاثة قروء» اور طلاق دی ہوئی عورتیں اپنے آپ کو تین طہر تک روکے رکھیں ( سورۃ البقرہ: ۲۲۸ ) اور فرمایا: «واللائي يئسن من المحيض من نسائكم إن ارتبتم فعدتهن ثلاثة أشهر» اور تمہاری وہ عورتیں جو حیض سے ناامید ہو گئی ہوں اگر تمہیں شبہ ہو تو ان کی عدت تین مہینے ہے ( سورۃ الطلاق: ۴ ) تو یہ عورتیں پہلی آیت کے حکم سے نکال لی گئیں ہیں، اسی طرح اللہ تعالیٰ نے فرمایا: «وإن طلقتموهن من قبل أن تمسوهن» اگر تم انہیں چھونے سے پہلے ہی طلاق دے دو تو انہیں کوئی عدت گزارنے کی ضرورت نہیں ( سورۃ الاحزاب: ۴۹ ) اس آیت میں مذکور عورتوں کو بھی پہلی آیت کے حکم سے نکال دیا گیا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 2283,
			"arabicnumber": 2283,
			"text": "عمر رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے ام المؤمنین حفصہ رضی اللہ عنہا کو طلاق دی پھر آپ نے ان سے رجعت کر لی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 2284,
			"arabicnumber": 2284,
			"text": "ابوسلمہ بن عبدالرحمٰن فاطمہ بنت قیس رضی اللہ عنہا کے بارے میں روایت کرتے ہیں کہ ابوعمرو بن حفص رضی اللہ عنہ نے انہیں طلاق بتہ دے دی ۱؎ ابوعمرو موجود نہیں تھے تو ان کے وکیل نے فاطمہ کے پاس کچھ جو بھیجے، اس پر وہ برہم ہوئیں، تو اس نے کہا: اللہ کی قسم! تمہارا ہم پر کوئی حق نہیں بنتا، تو وہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئیں اور ماجرا بیان کیا تو آپ صلی اللہ علیہ وسلم نے فاطمہ سے فرمایا: اس کے ذمہ تمہارا نفقہ نہیں ہے پھر آپ صلی اللہ علیہ وسلم نے انہیں ام شریک کے گھر میں عدت گزارنے کا حکم دیا، پھر آپ صلی اللہ علیہ وسلم نے فرمایا: یہ ایک ایسی عورت ہے کہ اس کے پاس میرے صحابہ کا اکثر آنا جانا لگا رہتا ہے، لہٰذا تم ابن ام مکتوم کے گھر میں عدت گزارو کیونکہ وہ نابینا ہیں، پردے کی دقت نہ ہو گی، تم اپنے کپڑے اتار سکو گی، اور جب عدت مکمل ہو جائے تو مجھے اطلاع دینا ۔ فاطمہ رضی اللہ عنہا کا بیان ہے کہ جب عدت گزر گئی تو میں نے رسول اللہ صلی اللہ علیہ وسلم کے سامنے معاویہ بن ابی سفیان اور ابوجہم رضی اللہ عنہما کے پیغام کا ذکر کیا، آپ صلی اللہ علیہ وسلم نے فرمایا: رہے ابوجہم تو وہ کندھے سے لاٹھی ہی نہیں اتارتے ( یعنی بہت زدو کوب کرنے والے شخص ہیں ) اور جہاں تک معاویہ کا سوال ہے تو وہ کنگال ہیں، ان کے پاس مال نہیں ہے۲؎، لہٰذا تم اسامہ بن زید سے نکاح کر لو ، فاطمہ رضی اللہ عنہا کا بیان ہے کہ وہ مجھے پسند نہیں آئے، آپ صلی اللہ علیہ وسلم نے پھر فرمایا کہ اسامہ بن زید سے نکاح کر لو، چنانچہ میں نے اسامہ سے نکاح کر لیا تو اللہ تعالیٰ نے اس میں اس قدر بھلائی رکھی کہ لوگ مجھ پر رشک کرنے لگے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 2285,
			"arabicnumber": 2285,
			"text": "یحییٰ بن ابی کثیر کہتے ہیں کہ ابوسلمہ بن عبدالرحمٰن نے مجھ سے بیان کیا کہ فاطمہ بنت قیس رضی اللہ عنہا نے ان سے بیان کیا کہ ابو حفص بن مغیرہ رضی اللہ عنہ نے انہیں تینوں طلاقیں دے دیں، پھر راوی نے پوری حدیث بیان کی، اس میں ہے کہ خالد بن ولید رضی اللہ عنہ اور بنی مخزوم کے کچھ لوگ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں آئے اور انہوں نے عرض کیا: اللہ کے نبی! ابو حفص بن مغیرہ نے اپنی بیوی کو تینوں طلاقیں دے دی ہیں، اور اسے معمولی نفقہ ( خرچ ) دیا ہے، تو آپ صلی اللہ علیہ وسلم نے فرمایا: اس کے لیے نفقہ نہیں ہے ، پھر راوی نے پوری حدیث بیان کی، یہ مالک کی روایت زیادہ کامل ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 2286,
			"arabicnumber": 2286,
			"text": "ابوسلمہ بن عبدالرحمٰن بن عوف الزہری کہتے ہیں کہ مجھ سے فاطمہ بنت قیس رضی اللہ عنہا نے بیان کیا کہ ابوعمرو بن حفص مخزومی رضی اللہ عنہ نے انہیں تینوں طلاقیں دے دیں، پھر راوی نے پوری حدیث ذکر کی اور خالد بن ولید رضی اللہ عنہ والا قصہ بیان کیا کہ انہوں نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے: نہ تو اس کے لیے نفقہ ہے اور نہ رہائش ، نیز نبی اکرم صلی اللہ علیہ وسلم نے اسے یہ خبر بھیجی کہ تو اپنے بارے میں مجھ سے سبقت نہ کرنا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 2287,
			"arabicnumber": 2287,
			"text": "فاطمہ بنت قیس رضی اللہ عنہا کہتی ہیں کہ میں قبیلہ بنی مخروم کے ایک شخص کے نکاح میں تھی اس نے مجھے طلاق بتہ دے دی، پھر راوی نے مالک کی حدیث کے مثل حدیث بیان کی اس میں «ولا تفوتيني بنفسك» ہے۔ ابوداؤد کہتے ہیں: اسی طرح اسے شعبی اور بہی نے اور عطاء نے بواسطہ عبدالرحمٰن بن عاصم اور ابوبکر بن جہم اور سبھوں نے فاطمہ بنت قیس رضی اللہ عنہا سے روایت کیا ہے کہ انہیں ان کے شوہر نے تین طلاق دی ( نہ کہ طلاق بتہ ) ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 2288,
			"arabicnumber": 2288,
			"text": "فاطمہ بنت قیس رضی اللہ عنہا سے روایت ہے کہ ان کے شوہر نے انہیں تین طلاق دے دی تو رسول اللہ صلی اللہ علیہ وسلم نے نہ تو انہیں نفقہ دلایا، اور نہ ہی رہائش دلائی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 2289,
			"arabicnumber": 2289,
			"text": "ابوسلمہ بن عبدالرحمٰن بن عوف الزہری کہتے ہیں کہ فاطمہ بنت قیس رضی اللہ عنہا نے انہیں خبر دی کہ وہ ابوحفص بن مغیرہ رضی اللہ عنہ کے عقد میں تھیں، اور ابوحفص نے انہیں تین طلاق میں سے آخری طلاق بھی دے دی تو وہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئیں اور اپنے گھر نکلنے کے متعلق آپ صلی اللہ علیہ وسلم سے فتویٰ پوچھا تو آپ نے انہیں نابینا ابن ام مکتوم رضی اللہ عنہ کے گھر منتقل ہو جانے کا حکم دیا ۱؎۔ مروان نے یہ حدیث سنی تو مطلقہ کے گھر سے نکلنے کے سلسلہ میں فاطمہ رضی اللہ عنہا کی حدیث کی تصدیق کرنے سے انکار کیا، عروہ کہتے ہیں: ام المؤمنین عائشہ رضی اللہ عنہا نے بھی فاطمہ بنت قیس رضی اللہ عنہا کی بات کا انکار کیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 2290,
			"arabicnumber": 2290,
			"text": "عبیداللہ بن عبداللہ بن عتبہ کہتے ہیں کہ مروان نے فاطمہ بنت قیس رضی اللہ عنہا کو بلوایا، اور ان سے پوچھا تو انہوں نے بتایا کہ وہ ابوحفص رضی اللہ عنہ کے عقد میں تھیں، اور نبی اکرم صلی اللہ علیہ وسلم نے علی رضی اللہ عنہ کو یمن کا یعنی یمن کے بعض علاقے کا امیر بنا کر بھیجا تو ان کے شوہر بھی علی رضی اللہ عنہ کے ساتھ گئے اور وہیں سے انہیں بقیہ ایک طلاق بھیج دی، اور عیاش بن ابی ربیعہ اور حارث بن ہشام کو انہیں نفقہ دینے کے لیے کہہ دیا تو وہ دونوں کہنے لگے: اللہ کی قسم حاملہ ہونے کی صورت ہی میں وہ نفقہ کی حقدار ہو سکتی ہیں، چنانچہ وہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئیں ( اور آپ سے دریافت کیا ) آپ صلی اللہ علیہ وسلم نے فرمایا: تمہارے لیے نفقہ صرف اس صورت میں ہے کہ تم حاملہ ہو ، پھر فاطمہ نے گھر سے منتقل ہونے کی اجازت مانگی تو آپ صلی اللہ علیہ وسلم نے اجازت دے دی، پھر فاطمہ نے کہا: اللہ کے رسول! میں کہاں جاؤں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: ابن ام مکتوم کے گھر میں جا کر رہو، وہ نابینا ہیں، سو وہ ان کے پاس کپڑے بھی اتارتی تھیں تو وہ اسے دیکھ نہیں پاتے تھے ، چنانچہ وہ وہیں رہیں یہاں تک کہ ان کی عدت پوری ہو گئی پھر رسول اللہ صلی اللہ علیہ وسلم نے ان کا نکاح اسامہ رضی اللہ عنہ سے کر دیا۔ تو قبیصہ ۱؎ مروان کے پاس واپس آئے اور انہیں اس کی خبر دی تو مروان نے کہا: ہم نے یہ حدیث صرف ایک عورت کے منہ سے سنی ہے ہم تو اسی مضبوط اور صحیح بات کو اپنائیں گے جس پر ہم نے لوگوں کو پایا ہے، فاطمہ رضی اللہ عنہا کو اس کا علم ہوا تو کہنے لگیں: میرے اور تمہارے درمیان اللہ کی کتاب فیصلہ کرے گی، اللہ کا فرمان ہے «فطلقوهن لعدتهن» ، «لا تدري لعل الله يحدث بعد ذلك أمرا» ۲؎ تک یعنی خاوند کا دل مائل ہو جائے اور رجوع کر لے فاطمہ رضی اللہ عنہا نے کہا: تین طلاق کے بعد کیا نئی بات ہو گی؟ ۳؎۔ ابوداؤد کہتے ہیں: اور اسی طرح اسے یونس نے زہری سے روایت کیا ہے، رہے زبیدی تو انہوں نے دونوں حدیثوں کو ملا کر ایک ساتھ روایت کیا ہے یعنی عبیداللہ کی حدیث کو معمر کی حدیث کے ہم معنی اور ابوسلمہ کی حدیث کو عقیل کی حدیث کے ہم معنی روایت کیا ہے۔ اور اسے محمد بن اسحاق نے زہری سے روایت کیا ہے اس میں ہے کہ قبیصہ بن ذویب نے ان سے اس معنی کی حدیث بیان کی ہے جس میں عبیداللہ بن عبداللہ کی حدیث پر دلالت ہے جس وقت انہوں نے یہ کہا کہ قبیصہ مروان کے پاس لوٹے اور انہیں اس واقعہ کی خبر دی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 2291,
			"arabicnumber": 2291,
			"text": "ابواسحاق کہتے ہیں کہ میں اسود کے ساتھ جامع مسجد میں تھا تو انہوں نے کہا: فاطمہ بنت قیس رضی اللہ عنہا عمر بن خطاب رضی اللہ عنہ کے پاس آئیں انہوں نے کہا کہ ہم اپنے رب کی کتاب اور اپنے نبی کی سنت کو ایک عورت کے کہنے پر نہیں چھوڑ سکتے، پتا نہیں اسے یہ ( اصل بات ) یاد بھی ہے یا بھول گئی ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 2292,
			"arabicnumber": 2292,
			"text": "عروہ کہتے ہیں کہ ام المؤمنین عائشہ رضی اللہ عنہا فاطمہ بنت قیس رضی اللہ عنہا کی حدیث پر سخت نکیر کرتی تھیں اور کہتی تھیں: چونکہ فاطمہ ایک ویران مکان میں رہتی تھیں جس کی وجہ سے ان کے بارے میں خدشہ لاحق ہوا اسی لیے رسول اللہ صلی اللہ علیہ وسلم نے انہیں ( مکان بدلنے کی ) رخصت دی تھی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 2293,
			"arabicnumber": 2293,
			"text": "عروہ بن زبیر سے روایت ہے کہ ام المؤمنین عائشہ رضی اللہ عنہا سے فاطمہ ( فاطمہ بنت قیس ) رضی اللہ عنہا کے بیان پر اظہار خیال کرنے کے لیے کہا گیا تو انہوں نے کہا اس میں اس کے لیے کوئی فائدہ نہیں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 2294,
			"arabicnumber": 2294,
			"text": "سلیمان بن یسار سے بھی فاطمہ رضی اللہ عنہا کے گھر سے نکلنے کا قصہ مروی ہے وہ کہتے ہیں: یہ بد خلقی کی بنا پر ہوا تھا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 2295,
			"arabicnumber": 2295,
			"text": "حییٰ بن سعید قاسم بن محمد اور سلیمان بن یسار سے روایت کرتے ہیں کہ انہوں نے ان دونوں کو ذکر کرتے ہوئے سنا کہ یحییٰ بن سعید بن عاص نے عبدالرحمٰن بن حکم کی بیٹی کو تین طلاق دے دی تو عبدالرحمٰن نے انہیں اس گھر سے منتقل کر لیا تو ام المؤمنین عائشہ رضی اللہ عنہا نے اس وقت مدینہ کے امیر مروان بن حکم کو کہلا بھیجا کہ اللہ کا خوف کھاؤ اور عورت کو اس کے گھر واپس بھیج دو، بروایت سلیمان: مروان نے کہا: عبدالرحمٰن مجھ پر غالب آ گئے یعنی انہوں نے میری بات نہیں مانی، اور بروایت قاسم: کیا آپ کو فاطمہ بنت قیس رضی اللہ عنہا کا قصہ معلوم نہیں؟ تو ام المؤمنین عائشہ رضی اللہ عنہا نے کہا: فاطمہ والی حدیث نہ بیان کرو تو تمہارا کوئی نقصان نہیں ہے، تو مروان نے کہا: اگر آپ نزدیک وہاں برائی کا اندیشہ تھا تو سمجھ لو یہاں ان دونوں ( عمرہ اور ان کے شوہر یحییٰ ) کے درمیان بھی اسی برائی کا اندیشہ ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 2296,
			"arabicnumber": 2296,
			"text": "میمون بن مہران کہتے ہیں کہ میں مدینہ آیا تو سعید بن مسیب کے پاس گیا اور میں نے کہا کہ فاطمہ بنت قیس رضی اللہ عنہا کو طلاق دی گئی تو وہ اپنے گھر سے چلی گئی ( ایسا کیوں ہوا؟ ) تو سعید نے جواب دیا: اس عورت نے لوگوں کو فتنے میں مبتلا کر دیا تھا کیونکہ وہ زبان دراز تھی لہٰذا اسے ابن ام مکتوم رضی اللہ عنہ کے پاس رکھا گیا جو نابینا تھے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 2297,
			"arabicnumber": 2297,
			"text": "جابر رضی اللہ عنہ کہتے ہیں کہ میری خالہ کو تین طلاقیں دی گئیں، وہ اپنی کھجوریں توڑنے نکلیں، راستے میں ایک شخص ملا تو اس نے انہیں نکلنے سے منع کیا چنانچہ وہ نبی اکرم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئیں، اور آپ سے اس واقعہ کا ذکر کیا، آپ صلی اللہ علیہ وسلم نے فرمایا: جاؤ اور اپنی کھجوریں توڑو، ہو سکتا ہے تم اس میں سے صدقہ کرو یا اور کوئی بھلائی کا کام کرو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 2298,
			"arabicnumber": 2298,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 2299,
			"arabicnumber": 2299,
			"text": "حمید بن نافع کہتے ہیں کہ زینب بنت ابی سلمہ رضی اللہ عنہما نے انہیں ان تینوں حدیثوں کی خبر دی کہ جب ام المؤمنین ام حبیبہ رضی اللہ عنہا کے والد ابوسفیان رضی اللہ عنہ کا انتقال ہوا تو میں ان کے پاس گئی، انہوں نے زرد رنگ کی خوشبو منگا کر ایک لڑکی کو لگائی پھر اپنے دونوں رخساروں پر بھی مل لی اس کے بعد کہنے لگیں: اللہ کی قسم! مجھے خوشبو لگانے کی قطعاً حاجت نہ تھی، میں نے تو ایسا صرف اس بنا پر کیا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا تھا: کسی عورت کے لیے جو اللہ تعالیٰ اور آخرت کے دن پر ایمان رکھتی ہو یہ حلال نہیں کہ وہ کسی میت پر تین دن سے زیادہ سوگ منائے، ہاں خاوند پر چار مہینے دس دن تک سوگ منانا ہے ۔ زینب رضی اللہ عنہا کہتی ہیں: میں ام المؤمنین زینب بنت جحش رضی اللہ عنہا کے پاس گئی جس وقت کہ ان کے بھائی کا انتقال ہو گیا تھا، انہوں نے ( بھی ) خوشبو منگا کر لگائی اس کے بعد کہنے لگیں: اللہ کی قسم! مجھے خوشبو لگانے کی کوئی ضرورت نہیں تھی، میں نے ایسا صرف اس بنا پر کیا ہے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو منبر پر فرماتے سنا: کسی بھی عورت کے لیے جو اللہ اور آخرت کے دن پر ایمان رکھتی ہو یہ حلال نہیں کہ وہ کسی میت پر تین دن سے زیادہ سوگ منائے ہاں شوہر کی وفات پر سوگ چار مہینے دس دن ہے ۔ زینب رضی اللہ عنہا کہتی ہیں: میں نے اپنی والدہ ام سلمہ رضی اللہ عنہا کو کہتے ہوئے سنا: ایک عورت نے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہو کر عرض کیا: اللہ کے رسول! میری بیٹی کے شوہر کی وفات ہو گئی ہے اور اس کی آنکھیں دکھ رہی ہیں، کیا ہم اسے سرمہ لگا دیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: نہیں ، اس نے دو بار یا تین بار پوچھا، آپ صلی اللہ علیہ وسلم نے ہر بار فرمایا: نہیں ، پھر فرمایا: تم چار مہینے دس دن صبر نہیں کر سکتی، حالانکہ زمانہ جاہلیت میں جب تم میں سے کسی عورت کا شوہر مر جاتا تھا تو ایک سال پورے ہونے پر اسے مینگنی پھینکنی پڑتی تھی ۔ حمید راوی کہتے ہیں میں نے زینب رضی اللہ عنہا سے پوچھا: مینگنی پھینکنے سے کیا مراد ہے؟ تو انہوں نے بتایا کہ جاہلیت کے زمانہ میں جب کسی عورت کا شوہر مر جاتا تو وہ ایک معمولی سی جھونپڑی میں رہائش اختیار کرتی، پھٹے پرانے اور میلے کچیلے کپڑے پہنتی، نہ خوشبو استعمال کر سکتی اور نہ ہی کوئی زینت و آرائش کر سکتی تھی، جب سال پورا ہو جاتا تو اسے گدھا یا کوئی پرندہ یا بکری دی جاتی جسے وہ اپنے بدن سے رگڑتی، وہ جانور کم ہی زندہ رہ پاتا، پھر اس کو مینگنی دی جاتی جسے وہ سر پر گھما کر اپنے پیچھے پھینک دیتی، اس کے بعد وہ عدت سے باہر آتی اور زیب و زینت کرتی اور خوشبو استعمال کرتی۔ ابوداؤد کہتے ہیں:«حفش» چھوٹے گھر ( تنگ کوٹھری ) کو کہتے ہیں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 2300,
			"arabicnumber": 2300,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 2301,
			"arabicnumber": 2301,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں «غير إخراج» ( سورة البقرہ: ۲۴۰ ) والی آیت جس میں عورت کو شوہر کے گھر والوں کے پاس عدت گزارنے کا حکم ہے منسوخ کر دی گئی ہے، اب وہ جہاں چاہے عدت گزار سکتی ہے، عطاء کہتے ہیں: اگر چاہے تو شوہر کے گھر والوں کے پاس عدت گزارے اور شوہر کی وصیت سے فائدہ اٹھا کر وہیں سکونت اختیار کرے، اور اگر چاہے تو اللہ کے فرمان «فإن خرجن فلا جناح عليكم فيما فعلن» اگر وہ خود نکل جائیں تو ان کے کئے ہوئے کا تم پر کوئی گناہ نہیں کے مطابق نکل جائے، عطاء کہتے ہیں کہ پھر جب میراث کا حکم آ گیا، تو شوہر کے مکان میں رہائش کا حکم منسوخ ہو گیا اب وہ جہاں چاہے عدت گزارے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 2302,
			"arabicnumber": 2302,
			"text": "ام عطیہ رضی اللہ عنہا سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: عورت کسی پر بھی تین دن سے زیادہ سوگ نہ منائے سوائے شوہر کے، وہ اس پر چار مہینے دس دن سوگ منائے گی ( اس عرصہ میں ) وہ سفید سیاہ دھاری دار کپڑے کے علاوہ کوئی رنگین کپڑا نہ پہنے، نہ سرمہ لگائے، اور نہ خوشبو استعمال کرے، ہاں حیض سے فارغ ہونے کے بعد تھوڑی سی قسط یا اظفار کی خوشبو ( حیض کے مقام پر ) استعمال کرے ۔ راوی یعقوب نے: سفید سیاہ دھاری دار کپڑے کے بجائے: دھلے ہوئے کپڑے کا ذکر کیا، انہوں نے یہ بھی اضافہ کیا کہ اور نہ خضاب لگائے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 2303,
			"arabicnumber": 2303,
			"text": "ام عطیہ رضی اللہ عنہا سے یہی حدیث مرفوعاً مروی ہے لیکن ان دونوں راویوں کی حدیثوں میں پوری مشابہت نہیں ہے، مسمعی کا بیان ہے کہ یزید کہتے ہیں میں تو صرف یہی جانتا ہوں کہ اس میں ہے کہ خضاب نہ لگائے اور ہارون نے اس میں اتنا اور اضافہ کیا ہے کہ: رنگا ہوا کپڑا نہ پہنے سوائے سفید سیاہ دھاری دار کپڑے کے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 2304,
			"arabicnumber": 2304,
			"text": "ام المؤمنین ام سلمہ رضی اللہ عنہا کہتی ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جس عورت کا شوہر انتقال کر جائے وہ نہ زرد اور گیروے رنگ کا کپڑا پہنے نہ زیور پہنے، نہ خضاب ( مہندی وغیرہ ) لگائے، اور نہ سرمہ لگائے ۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 2305,
			"arabicnumber": 2305,
			"text": "ام حکیم بنت اسید اپنی والدہ سے روایت کرتی ہیں کہ ان کے شوہر کا انتقال ہو گیا، ان کی آنکھوں میں تکلیف رہتی تھی تو وہ «جلاء» ( سرمہ ) لگا لیتیں تو اپنی ایک لونڈی کو انہوں نے ام المؤمنین ام سلمہ رضی اللہ عنہا کے پاس بھیجا تاکہ وہ «جلاء» کے سرمہ کے متعلق ان سے پوچھے، انہوں نے کہا: اس کا سرمہ نہ لگاؤ جب تک ایسی سخت ضرورت پیش نہ آ جائے جس کے بغیر چارہ نہ ہو اس صورت میں تم اسے رات میں لگاؤ، اور دن میں پونچھ لیا کرو، پھر ام سلمہ رضی اللہ عنہا نے اسی وقت یہ بھی بتایا کہ ابوسلمہ رضی اللہ عنہ کا جب انتقال ہو گیا تو رسول اللہ صلی اللہ علیہ وسلم میرے پاس تشریف لائے، اور میں نے اپنی آنکھ میں ایلوا لگا رکھا تھا، آپ صلی اللہ علیہ وسلم نے پوچھا: ام سلمہ یہ کیا ہے؟ میں نے جواب دیا: اللہ کے رسول! یہ ایلوا ہے اور اس میں خوشبو نہیں ہے، فرمایا: یہ چہرے میں حسن پیدا کرتا ہے لہٰذا اسے رات ہی میں لگاؤ، اور دن میں ہٹا دو، اور خوشبو لگا کر کنگھی نہ کرو، اور نہ مہندی لگا کر، کیونکہ وہ خضاب ہے میں نے پوچھا: اللہ کے رسول! پھر کنگھی کس چیز سے کروں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: بیری کے پتوں کو اپنے سر پر لپیٹ کر ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 2306,
			"arabicnumber": 2306,
			"text": "ابن شہاب زہری سے روایت ہے کہ مجھ سے عبیداللہ بن عبداللہ بن عتبہ نے بیان کیا کہ ان کے والد نے عمر بن عبداللہ بن ارقم زہری کو لکھا کہ وہ سبیعہ بنت حارث اسلمیہ رضی اللہ عنہا کے پاس جا کر ان کی حدیث معلوم کریں، نیز معلوم کریں کہ جب انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے مسئلہ دریافت کیا تو آپ نے کیا ارشاد فرمایا؟ چنانچہ عمر بن عبداللہ نے عبداللہ بن عتبہ کو لکھا، وہ انہیں بتا رہے تھے کہ انہیں سبیعہ نے بتایا ہے کہ وہ سعد بن خولہ رضی اللہ عنہ کے نکاح میں تھیں ( وہ بنی عامر بن لوی کے ایک فرد، اور بدری صحابی ہیں ) حجۃ الوداع کے موقعہ پر جب وہ حاملہ تھیں تو ان کا انتقال ہو گیا، انتقال کے بعد انہوں نے بچہ جنا، جب نفاس سے پاک ہو گئیں تو نکاح کا پیغام دینے والوں کے لیے بناؤ سنگار کیا تو بنی عبدالدار کا ایک شخص ابوسنابل بن بعکک رضی اللہ عنہ ان کے پاس آئے اور کہنے لگے: میں تمہیں بنی سنوری ہوئی دیکھ رہا ہوں، شاید نکاح کرنا چاہتی ہو، اللہ کی قسم! تم چار مہینے دس دن ( کی عدت ) گزارے بغیر نکاح نہیں کر سکتی۔ سبیعہ رضی اللہ عنہا کا بیان ہے: جب انہوں نے مجھ سے اس طرح کی گفتگو کی تو میں شام کے وقت پہن اوڑھ کر رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئی اور آپ سے اس کے متعلق دریافت کیا، آپ صلی اللہ علیہ وسلم نے مجھے مسئلہ بتایا اور فرمایا کہ بچہ جننے کے بعد ہی میں حلال ہو گئی اور آپ صلی اللہ علیہ وسلم نے مجھے حکم دیا کہ اگر میں چاہوں تو شادی کر سکتی ہوں۔ ابن شہاب کہتے ہیں: میرے خیال میں بچہ جننے کے بعد عورت کے نکاح کرنے میں کوئی حرج نہیں گرچہ وہ حالت نفاس ہی میں ہو البتہ پاک ہونے تک شوہر صحبت نہیں کرے گا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 2307,
			"arabicnumber": 2307,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ جو بھی چاہے مجھ سے اس بات پر لعان ۱؎ کر لے کہ چھوٹی سورۃ نساء ( سورۃ الطلاق ) چار مہینے دس دن والے حکم کے بعد نازل ہوئی ۲؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 2308,
			"arabicnumber": 2308,
			"text": "عمرو بن العاص رضی اللہ عنہ کہتے ہیں کہ ( ہمارے نبی کریم صلی اللہ علیہ وسلم کی ) سنت کو ہم پر گڈمڈ نہ کرو، ( سنت یہ ہے کہ ) جس کا شوہر فوت ہو جائے اس کی یعنی ام ولد ۱؎ کی عدت چار مہینے دس دن ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 2309,
			"arabicnumber": 2309,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم سے اس شخص کے بارے میں مسئلہ دریافت کیا گیا جس نے اپنی بیوی کو تین طلاق دے دی، پھر اس عورت نے دوسرے شخص سے نکاح کر لیا اور وہ شخص اس کے پاس گیا لیکن جماع سے پہلے ہی اس نے اسے طلاق دے دی تو کیا وہ عورت پہلے شوہر کے لیے حلال ہو جائے گی؟ ۔ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: وہ پہلے شوہر کے لیے حلال نہیں ہو سکتی جب تک کہ وہ عورت دوسرے شوہر کی مٹھاس نہ چکھ لے اور وہ شوہر اس عورت کی مٹھاس نہ چکھ لے۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 2310,
			"arabicnumber": 2310,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ میں نے عرض کیا: اللہ کے رسول! کون سا گناہ سب سے بڑا ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: ( سب سے بڑا گناہ یہ ہے کہ ) تم اللہ کے ساتھ شریک ٹھہراؤ حالانکہ اسی نے تمہیں پیدا کیا ہے ، میں نے پوچھا اس کے بعد کون ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: تم اپنے بچے کو اس ڈر سے مار ڈالو کہ وہ تمہارے ساتھ کھائے گا ، میں نے کہا پھر اس کے بعد؟ تو آپ صلی اللہ علیہ وسلم نے فرمایا: یہ کہ تم اپنے پڑوسی کی بیوی سے زنا کرو ، نیز کہا: نبی اکرم صلی اللہ علیہ وسلم کے قول کی تصدیق کے طور پر یہ آیت نازل ہوئی «والذين لا يدعون مع الله إلها آخر ولا يقتلون النفس التي حرم الله إلا بالحق ولا يزنون الخ ( سورۃ الفرقان: ۶۸ ) جو لوگ اللہ کے علاوہ کسی کو نہیں پکارتے اور ناحق اس نفس کو قتل نہیں کرتے جس کے قتل کو اللہ نے حرام قرار دیا ہے اور نہ زنا کرتے ہیں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 2311,
			"arabicnumber": 2311,
			"text": "ابوالزبیر کہتے ہیں کہ انہوں نے جابر بن عبداللہ رضی اللہ عنہما کو کہتے سنا کہ ایک انصاری شخص کی مسکینہ لونڈی آ کر کہنے لگی کہ میرا مالک مجھے بدکاری کے لیے مجبور کرتا ہے، تو یہ آیت نازل ہوئی «ولا تكرهوا فتياتكم على البغاء» ( سورۃ النور: ۳۳ ) تمہاری جو لونڈیاں پاک دامن رہنا چاہتی ہیں انہیں دنیا کی زندگی کے فائدے کی غرض سے بدکاری پر مجبور نہ کرو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 2312,
			"arabicnumber": 2312,
			"text": "سیلمان تیمی سے روایت ہے کہ آیت کریمہ: «ومن يكرههن فإن الله من بعد إكراههن غفور رحيم» ( النور: ۳۳ ) اور جو انہیں مجبور کرے تو اللہ تعالیٰ مجبور کرنے کی صورت میں بخشنے ولا رحم کرنے والا ہے کے متعلق سعید بن ابوالحسن نے کہا: اس کا مطلب یہ ہے کہ جنہیں زنا کے لیے مجبور کیا گیا، اللہ تعالیٰ ان کو بخش دے گا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 138
			}
		}
	]
}