{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"19": "Shares of Inheritance (Kitab Al-Fara'id)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2885,
			"arabicnumber": 2885,
			"text": "عبداللہ بن عمرو بن العاص رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ( اصل ) علم تین ہیں اور ان کے علاوہ علوم کی حیثیت فضل ( زائد ) کی ہے: آیت محکمہ ۲؎، یا سنت قائمہ ۳؎، یا فریضہ عادلہ ۴؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2886,
			"arabicnumber": 2886,
			"text": "جابر رضی اللہ عنہ کہتے ہیں میں بیمار ہوا تو نبی اکرم صلی اللہ علیہ وسلم اور ابوبکر رضی اللہ عنہ مجھے دیکھنے کے لیے پیدل چل کر آئے، مجھ پر غشی طاری تھی اس لیے آپ صلی اللہ علیہ وسلم سے بات نہ کر سکا تو آپ نے وضو کیا اور وضو کے پانی کا مجھ پر چھینٹا مارا تو مجھے افاقہ ہوا، میں نے کہا: اللہ کے رسول! میں اپنا مال کیا کروں اور بہنوں کے سوا میرا کوئی وارث نہیں ہے، اس وقت میراث کی آیت«يستفتونك قل الله يفتيكم في الكلالة» آپ سے فتوی پوچھتے ہیں، آپ کہہ دیجئیے کہ اللہ تعالیٰ ( خود ) تمہیں کلالہ کے بارے میں فتویٰ دیتا ہے ( سورۃ النساء: ۱۷۶ ) ، اتری ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2887,
			"arabicnumber": 2887,
			"text": "جابر رضی اللہ عنہ کہتے ہیں میں بیمار ہوا اور میرے پاس سات بہنیں تھیں، رسول اللہ صلی اللہ علیہ وسلم میرے پاس آئے اور میرے چہرے پر پھونک ماری تو مجھے ہوش آ گیا، میں نے کہا: اللہ کے رسول! کیا میں اپنی بہنوں کے لیے ثلث مال کی وصیت نہ کر دوں؟ آپ نے فرمایا: نیکی کرو ، میں نے کہا آدھے مال کی وصیت کر دوں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: نیکی کرو ، پھر آپ مجھے چھوڑ کر چلے گئے اور آپ صلی اللہ علیہ وسلم نے فرمایا: جابر! میرا خیال ہے تم اس بیماری سے نہیں مرو گے، اور اللہ تعالیٰ نے اپنا کلام اتارا ہے اور تمہاری بہنوں کا حصہ بیان کر دیا ہے، ان کے لیے دو ثلث مقرر فرمایا ہے ۔ جابر کہا کرتے تھے کہ یہ آیت «يستفتونك قل الله يفتيكم في الكلالة» میرے ہی متعلق نازل ہوئی ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2888,
			"arabicnumber": 2888,
			"text": "براء بن عازب رضی اللہ عنہما کہتے ہیں کلالہ کے سلسلے میں آخری آیت جو نازل ہوئی ہے وہ: «يستفتونك قل الله يفتيكم في الكلالة» ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2889,
			"arabicnumber": 2889,
			"text": "براء بن عازب رضی اللہ عنہما کہتے ہیں کہ ایک شخص نبی اکرم صلی اللہ علیہ وسلم کے پاس آیا اور اس نے عرض کیا: اللہ کے رسول!«يستفتونك في الكلالة» میں کلالہ سے کیا مراد ہے؟ آپ نے فرمایا: آیت «صيف» ۱؎ تمہارے لیے کافی ہے۔ ابوبکر کہتے ہیں: میں نے ابواسحاق سے کہا: کلالہ وہی ہے نا جو نہ اولاد چھوڑے نہ والد؟ انہوں نے کہا: ہاں، لوگوں نے ایسا ہی سمجھا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2890,
			"arabicnumber": 2890,
			"text": "ہزیل بن شرحبیل اودی کہتے ہیں ایک شخص ابوموسیٰ اشعری رضی اللہ عنہ اور سلیمان بن ربیعہ کے پاس آیا اور ان دونوں سے یہ مسئلہ پوچھا کہ ایک بیٹی ہو اور ایک پوتی اور ایک سگی بہن ( یعنی ایک شخص ان کو وارث چھوڑ کر مرے ) تو اس کی میراث کیسے بٹے گی؟ ان دونوں نے جواب دیا کہ بیٹی کو آدھا اور سگی بہن کو آدھا ملے گا، اور انہوں نے پوتی کو کسی چیز کا وارث نہیں کیا ( اور ان دونوں نے پوچھنے والے سے کہا ) تم عبداللہ بن مسعود رضی اللہ عنہ سے بھی جا کر پوچھو تو وہ بھی اس مسئلہ میں ہماری موافقت کریں گے، تو وہ شخص ان کے پاس آیا اور ان سے پوچھا اور انہیں ان دونوں کی بات بتائی تو انہوں نے کہا: تب تو میں بھٹکا ہوا ہوں گا اور راہ یاب لوگوں میں سے نہ ہوں گا، لیکن میں تو رسول اللہ صلی اللہ علیہ وسلم کے فیصلہ کے مطابق فیصلہ کروں گا، اور وہ یہ کہ بیٹی کا آدھا ہو گا اور پوتی کا چھٹا حصہ ہو گا دو تہائی پورا کرنے کے لیے ( یعنی جب ایک بیٹی نے آدھا پایا تو چھٹا حصہ پوتی کو دے کر دو تہائی پورا کر دیں گے ) اور جو باقی رہے گا وہ سگی بہن کا ہو گا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2891,
			"arabicnumber": 2891,
			"text": "جابر بن عبداللہ رضی اللہ عنہما کہتے ہیں کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نکلے تو اسواف ( مدینہ کے حرم ) میں ایک انصاری عورت کے پاس پہنچے، وہ عورت اپنی دو بیٹیوں کو لے کر آئی، اور کہنے لگی: اللہ کے رسول! یہ دونوں ثابت بن قیس رضی اللہ عنہ کی بیٹیاں ہیں، جو جنگ احد میں آپ کے ساتھ لڑتے ہوئے شہید ہو گئے ہیں، ان کے چچا نے ان کا سارا مال اور میراث لے لیا، ان کے لیے کچھ بھی نہ چھوڑا، اب آپ کیا فرماتے ہیں؟ اللہ کے رسول! قسم اللہ کی! ان کا نکاح نہیں ہو سکتا جب تک کہ ان کے پاس مال نہ ہو، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اللہ تعالیٰ اس کا فیصلہ فرمائے گا ، پھر سورۃ نساء کی یہ آیتیں «يوصيكم الله في أولادكم»نازل ہوئیں، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اس عورت کو اور اس کے دیور کو بلاؤ ، تو آپ صلی اللہ علیہ وسلم نے ان دونوں لڑکیوں کے چچا سے کہا: دو تہائی مال انہیں دے دو، اور ان کی ماں کو آٹھواں حصہ دو، اور جو انہیں دینے کے بعد بچا رہے وہ تمہارا ہے۱؎ ۔ ابوداؤد کہتے ہیں: اس میں بشر نے غلطی کی ہے، یہ دونوں بیٹیاں سعد بن ربیع کی تھیں، ثابت بن قیس رضی اللہ عنہ تو جنگ یمامہ میں شہید ہوئے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2892,
			"arabicnumber": 2892,
			"text": "جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے کہ سعد بن ربیع کی عورت نے کہا: اللہ کے رسول! سعد مر گئے اور دو بیٹیاں چھوڑ گئے ہیں، پھر راوی نے اسی طرح کی حدیث بیان کی۔ ابوداؤد کہتے ہیں: یہ روایت زیادہ صحیح ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2893,
			"arabicnumber": 2893,
			"text": "اسود بن یزید کہتے ہیں کہ معاذ بن جبل رضی اللہ عنہ نے بہن اور بیٹی میں اس طرح ترکہ تقسیم کیا کہ آدھا مال بیٹی کو ملا اور آدھا بہن کو ( کیونکہ بہن بیٹی کے ساتھ عصبہ ہو جاتی ہے ) اور وہ یمن میں تھے، اور اللہ کے نبی کریم صلی اللہ علیہ وسلم اس وقت باحیات تھے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2894,
			"arabicnumber": 2894,
			"text": "قبیصہ بن ذویب کہتے ہیں کہ میت کی نانی ابوبکر صدیق رضی اللہ عنہ کے پاس میراث میں اپنا حصہ دریافت کرنے آئی تو انہوں نے کہا: اللہ کی کتاب ( قرآن پاک ) میں تمہارا کچھ حصہ نہیں ہے، اور مجھے نبی اکرم صلی اللہ علیہ وسلم کی سنت میں بھی تمہارے لیے کچھ نہیں معلوم، تم جاؤ میں لوگوں سے دریافت کر کے بتاؤں گا، پھر انہوں نے لوگوں سے پوچھا تو مغیرہ بن شعبہ رضی اللہ عنہ نے کہا کہ میں رسول اللہ صلی اللہ علیہ وسلم کے پاس موجود تھا، آپ نے اسے چھٹا حصہ دلایا ہے، اس پر ابوبکر رضی اللہ عنہ نے کہا: کیا تمہارے ساتھ کوئی اور بھی ہے ( جو اس معاملے کو جانتا ہو ) تو محمد بن مسلمہ رضی اللہ عنہ کھڑے ہوئے اور انہوں نے بھی وہی بات کہی جو مغیرہ رضی اللہ عنہ نے کہی تھی، تو ابوبکر رضی اللہ عنہ نے اس کے لیے اسی کو نافذ کر دیا، پھر عمر رضی اللہ عنہ کی خلافت میں دادی عمر رضی اللہ عنہ کے پاس اپنا میراث مانگنے آئی، عمر رضی اللہ عنہ نے کہا: اللہ کی کتاب ( قرآن ) میں تمہارے حصہ کا ذکر نہیں ہے اور پہلے ( رسول اللہ صلی اللہ علیہ وسلم اور ابوبکر رضی اللہ عنہ کے زمانہ میں ) جو حکم ہو چکا ہے وہ نانی کے معاملے میں ہوا ہے، میں اپنی طرف سے فرائض میں کچھ بڑھا نہیں سکتا، لیکن وہی چھٹا حصہ تم بھی لو، اگر نانی بھی ہو تو تم دونوں ( «سدس» ) کو بانٹ لو اور جو تم دونوں میں اکیلی ہو ( یعنی صرف نانی یا صرف دادی ) تو اس کے لیے وہی چھٹا حصہ ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2895,
			"arabicnumber": 2895,
			"text": "بریدہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے نانی کا چھٹا حصہ مقرر فرمایا ہے اگر ماں اس کے درمیان حاجب نہ ہو ( یعنی اگر میت کی ماں زندہ ہو گی تو وہ نانی کو حصے سے محروم کر دے گی ) ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2896,
			"arabicnumber": 2896,
			"text": "عمران بن حصین رضی اللہ عنہما کہتے ہیں کہ ایک شخص رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا اور کہنے لگا: میرا پوتا مر گیا ہے، مجھے اس کی میراث سے کیا ملے گا؟ آپ صلی اللہ علیہ وسلم نے فرمایا: تمہارے لیے چھٹا حصہ ہے ، جب وہ واپس ہونے لگا تو آپ نے اس کو بلایا اور فرمایا: تمہارے لیے ایک اور چھٹا حصہ ہے ، جب وہ واپس ہونے لگا تو آپ صلی اللہ علیہ وسلم نے پھر اسے بلایا اور فرمایا: یہ دوسرا «سدس» تمہارے لیے تحفہ ہے ۔ قتادہ کہتے ہیں: معلوم نہیں دادا کو کس کے ساتھ سدس حصہ دار بنایا؟ ۔ قتادہ کہتے ہیں: سب سے کم حصہ جو دادا پاتا ہے وہ «سدس» ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2897,
			"arabicnumber": 2897,
			"text": "حسن بصری کہتے ہیں کہ عمر رضی اللہ عنہ نے پوچھا: رسول اللہ صلی اللہ علیہ وسلم نے دادا کو ترکے میں سے جو دلایا ہے اسے تم میں کون جانتا ہے؟ معقل بن یسار رضی اللہ عنہ نے کہا: میں ( جانتا ہوں ) رسول اللہ صلی اللہ علیہ وسلم نے اس کو چھٹا حصہ دلایا ہے، انہوں نے پوچھا: کس وارث کے ساتھ؟ وہ کہنے لگے: یہ تو معلوم نہیں، اس پر انہوں نے کہا: تمہیں پوری بات معلوم نہیں پھر کیا فائدہ تمہارے جاننے کا؟ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2898,
			"arabicnumber": 2898,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ذوی الفروض ۱؎ میں مال کتاب اللہ کے مطابق تقسیم کر دو اور جو ان کے حصوں سے بچ رہے وہ اس مرد کو ملے گا جو میت سے سب سے زیادہ قریب ہو ۲؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2899,
			"arabicnumber": 2899,
			"text": "مقدام رضی اللہ عنہ کہتے ہیں رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو شخص بوجھ ( قرضہ یا بال بچے ) چھوڑ جائے تو وہ میری طرف ہے، اور کبھی راوی نے کہا اللہ اور اس کے رسول کی طرف ہے ۲؎ اور جو مال چھوڑ جائے تو وہ اس کے وارثوں کا ہے، اور جس کا کوئی وارث نہیں اس کا میں وارث ہوں، میں اس کی طرف سے دیت دوں گا اور اس شخص کا ترکہ لوں گا، ایسے ہی ماموں اس کا وارث ہے جس کا کوئی وارث نہیں وہ اس کی دیت دے گا اور اس کا وارث ہو گا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2900,
			"arabicnumber": 2900,
			"text": "مقدام کندی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: میں ہر مسلمان سے اس کی ذات کی نسبت قریب تر ہوں، جو کوئی اپنے ذمہ قرض چھوڑ جائے یا عیال چھوڑ جائے تو اس کا قرض ادا کرنا یا اس کے عیال کی پرورش کرنا میرے ذمہ ہے، اور جو کوئی مال چھوڑ جائے تو وہ اس کے وارثوں کا حق ہے، اور جس کا کوئی والی نہیں اس کا والی میں ہوں، میں اس کے مال کا وارث ہوں گا، اور میں اس کے قیدیوں کو چھڑاؤں گا، اور جس کا کوئی والی نہیں، اس کا ماموں اس کا والی ہے ( یہ ) اس کے مال کا وارث ہو گا اور اس کے قیدیوں کو چھڑائے گا ۔ ابوداؤد کہتے ہیں: اس روایت کو زبیدی نے راشد بن سعد سے، راشد نے ابن عائذ سے، ابن عائذ نے مقدام سے روایت کیا ہے اور اسے معاویہ بن صالح نے راشد سے روایت کیا ہے اس میں «عن المقدام» کے بجائے «سمعت المقدام» ہے۔ ابوداؤد کہتے ہیں: «ضيعة» کے معنی «عیال» کے ہیں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2901,
			"arabicnumber": 2901,
			"text": "مقدام رضی اللہ عنہ کہتے ہیں میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا کہ جس کا کوئی وارث نہیں اس کا وارث میں ہوں اس کے قیدیوں کو چھڑاؤں گا، اور اس کے مال کا وارث ہوں گا، اور ماموں اس کا وارث ہے ۱؎ جس کا کوئی وارث نہیں وہ اس کے قیدیوں کو چھڑائے گا، اور اس کے مال کا وارث ہو گا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2902,
			"arabicnumber": 2902,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا فرماتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کا ایک غلام مر گیا، کچھ مال چھوڑ گیا اور کوئی وارث نہ چھوڑ ا، نہ کوئی اولاد، اور نہ کوئی عزیز، تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: اس کا ترکہ اس کی بستی کے کسی آدمی کو دے دو ۱؎۔ ابوداؤد کہتے ہیں: سفیان کی روایت سب سے زیادہ کامل ہے، مسدد کی روایت میں ہے: نبی اکرم صلی اللہ علیہ وسلم نے پوچھا: یہاں کوئی اس کا ہم وطن ہے؟ لوگوں نے کہا: ہاں ہے، آپ صلی اللہ علیہ وسلم نے فرمایا: اس کا ترکہ اس کو دے دو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2903,
			"arabicnumber": 2903,
			"text": "بریدہ رضی اللہ عنہ کہتے ہیں ایک شخص رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا اور اس نے عرض کیا: قبیلہ ازد کے ایک آدمی کا ترکہ میرے پاس ہے اور مجھے کوئی ازدی مل نہیں رہا ہے جسے میں یہ ترکہ دے دوں، آپ صلی اللہ علیہ وسلم نے فرمایا: ایک سال تک کسی ازدی کو تلاش کرتے رہو ۔ وہ شخص پھر ایک سال بعد آپ صلی اللہ علیہ وسلم کے پاس آیا اور بولا: اللہ کے رسول! مجھے کوئی ازدی نہیں ملا کہ میں اسے ترکہ دے دیتا آپ صلی اللہ علیہ وسلم نے فرمایا: جاؤ کسی خزاعی ہی کو تلاش کرو، اگر مل جائے تو مال اس کو دے دو ، جب وہ شخص پیٹھ پھیر کر چلا تو آپ صلی اللہ علیہ وسلم نے فرمایا: آدمی کو میرے پاس بلا کے لاؤ ، جب وہ آیا تو آپ صلی اللہ علیہ وسلم نے فرمایا: دیکھو جو شخص خزاعہ میں سب سے بڑا ہو اس کو یہ مال دے دینا ۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2904,
			"arabicnumber": 2904,
			"text": "بریدہ رضی اللہ عنہ کہتے ہیں خزاعہ ( قبیلہ ) کے ایک شخص کا انتقال ہو گیا، اس کی میراث رسول اللہ صلی اللہ علیہ وسلم کے پاس لائی گئی تو آپ نے فرمایا: اس کا کوئی وارث یا ذی رحم تلاش کرو تو نہ اس کا کوئی وارث ملا، اور نہ ہی کوئی ذی رحم، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: خزاعہ میں سے جو بڑا ہو اسے میراث دیدو ۔ یحییٰ کہتے ہیں: ایک بار میں نے شریک سے سنا وہ اس حدیث میں یوں کہتے تھے: دیکھو جو شخص خزاعہ میں سب سے بڑا ہو اسے دے دو۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2905,
			"arabicnumber": 2905,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ ایک شخص رسول اللہ صلی اللہ علیہ وسلم کے زمانہ میں مر گیا اور ایک غلام کے سوا جسے وہ آزاد کر چکا تھا کوئی وارث نہ چھوڑا، رسول اللہ صلی اللہ علیہ وسلم نے پوچھا: کیا کوئی اس کا وارث ہے؟ لوگوں نے کہا: کوئی نہیں سوائے ایک غلام کے جس کو اس نے آزاد کر دیا تھا تو آپ صلی اللہ علیہ وسلم نے اسی کو اس کا ترکہ دلا دیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2906,
			"arabicnumber": 2906,
			"text": "واثلہ بن اسقع رضی اللہ عنہ نبی اکرم صلی اللہ علیہ وسلم سے روایت کرتے ہیں آپ نے فرمایا: عورت تین شخص کی میراث سمیٹ لیتی ہے: اپنے آزاد کئے ہوئے غلام کی، راہ میں پائے ہوئے بچے کی، اور اپنے اس بچے کی جس کے سلسلہ میں لعان ہوا ہو ( یعنی جس کے نسب سے شوہر منکر ہو گیا ہو ) تو عورت اس کی وارث ہو گی ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2907,
			"arabicnumber": 2907,
			"text": "مکحول کہتے ہیں رسول اللہ صلی اللہ علیہ وسلم نے لعان والی عورت کے بچے کی میراث اس کی ماں کو دلائی ہے پھر اس کی ماں کے بعد ماں کے وارثوں کو دلائی ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2908,
			"arabicnumber": 2908,
			"text": "اس سند سے بھی نبی اکرم صلی اللہ علیہ وسلم سے اسی کے مثل مروی ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2909,
			"arabicnumber": 2909,
			"text": "اسامہ بن زید رضی اللہ عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: مسلمان کافر کا اور کافر مسلمان کا وارث نہیں ہو سکتا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2910,
			"arabicnumber": 2910,
			"text": "اسامہ بن زید رضی اللہ عنہما کہتے ہیں کہ میں نے عرض کیا: اللہ کے رسول! کل آپ ( مکہ میں ) کہاں اتریں گے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: کیا عقیل نے ہمارے لیے کوئی جائے قیام چھوڑی ہے؟ پھر آپ صلی اللہ علیہ وسلم نے فرمایا: ہم بنی کنانہ کے خیف یعنی وادی محصب میں اتریں گے، جہاں قریش نے کفر پر جمے رہنے کی قسم کھائی تھی ۔ بنو کنانہ نے قریش سے عہد لیا تھا کہ وہ بنو ہاشم سے نہ نکاح کریں گے، نہ خرید و فروخت، اور نہ انہیں اپنے یہاں جگہ ( یعنی پناہ ) دیں گے۔ زہری کہتے ہیں: خیف ایک وادی کا نام ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2911,
			"arabicnumber": 2911,
			"text": "عبداللہ بن عمرو رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: دو دین والے ( یعنی مسلمان اور کافر ) کبھی ایک دوسرے کے وارث نہیں ہو سکتے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2912,
			"arabicnumber": 2912,
			"text": "عبداللہ بن بریدہ کہتے ہیں کہ دو بھائی اپنا جھگڑا یحییٰ بن یعمر کے پاس لے گئے ان میں سے ایک یہودی تھا، اور ایک مسلمان، انہوں نے مسلمان کو میراث دلائی، اور کہا کہ ابوالاسود نے مجھ سے بیان کیا ہے کہ ان سے ایک شخص نے بیان کیا کہ معاذ رضی اللہ عنہ نے اس سے بیان کیا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے: اسلام بڑھتا ہے گھٹتا نہیں ہے پھر انہوں نے مسلمان کو ترکہ دلایا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2913,
			"arabicnumber": 2913,
			"text": "ابوالاسود دیلی سے روایت ہے کہ معاذ رضی اللہ عنہ کے پاس ایک یہودی کا ترکہ لایا گیا جس کا وارث ایک مسلمان تھا، اور اسی مفہوم کی حدیث انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2914,
			"arabicnumber": 2914,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: زمانہ جاہلیت میں جو ترکہ تقسیم ہو گیا ہو وہ زمانہ اسلام میں بھی اسی حال پر باقی رہے گا، اور جو ترکہ اسلام کے زمانہ تک تقسیم نہیں ہوا تو اب اسلام کے آ جانے کے بعد اسلام کے قاعدہ و قانون کے مطابق تقسیم کیا جائے گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2915,
			"arabicnumber": 2915,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ ام المؤمنین عائشہ رضی اللہ عنہا نے ایک لونڈی خرید کر آزاد کرنا چاہا تو اس کے مالکوں نے کہا کہ ہم اسے اس شرط پر آپ کے ہاتھ بیچیں گے کہ اس کا حق ولاء ۱؎ ہمیں حاصل ہو، عائشہ رضی اللہ عنہا نے اس بات کا ذکر رسول اللہ صلی اللہ علیہ وسلم سے کیا تو آپ نے فرمایا: یہ خریدنے میں تمہارے لیے رکاوٹ نہیں کیونکہ ولاء اسی کا ہے جو آزاد کرے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2916,
			"arabicnumber": 2916,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ولاء اس شخص کا حق ہے جو قیمت دے کر خرید لے اور احسان کرے ( یعنی خرید کر غلام کو آزاد کر دے ) ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2917,
			"arabicnumber": 2917,
			"text": "عبداللہ بن عمرو رضی اللہ عنہما کہتے ہیں کہ رئاب بن حذیفہ نے ایک عورت سے شادی کی، اس کے بطن سے تین لڑکے پیدا ہوئے، پھر لڑکوں کی ماں مر گئی، اور وہ لڑکے اپنی ماں کے گھر کے اور اپنی ماں کے آزاد کئے ہوئے غلاموں کی ولاء کے مالک ہوئے، اور عمرو بن العاص رضی اللہ عنہ ان لڑکوں کے عصبہ ( یعنی وارث ) ہوئے اس کے بعد عمرو بن العاص رضی اللہ عنہ نے انہیں شام کی طرف نکال دیا، اور وہ وہاں مر گئے تو عمرو بن العاص رضی اللہ عنہ آئے اور اس عورت کا ایک آزاد کیا ہوا غلام مر گیا اور مال چھوڑ گیا تو اس عورت کے بھائی عمر بن خطاب رضی اللہ عنہ کے پاس اس عورت کے ولاء کا مقدمہ لے گئے، عمر رضی اللہ عنہ نے کہا: رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو ولاء اولاد یا باپ حاصل کرے تو وہ اس کے عصبوں کو ملے گی خواہ کوئی بھی ہو ( اولاد کے یا باپ کے مر جانے کے بعد ماں کے وارثوں کو نہ ملے گی ) پھر عمر رضی اللہ عنہ نے اس باب میں ایک فیصلہ نامہ لکھ دیا اور اس پر عبدالرحمٰن بن عوف اور زید بن ثابت رضی اللہ عنہما اور ایک اور شخص کی گواہی ثابت کر دی، جب عبدالملک بن مروان خلیفہ ہوئے تو پھر ان لوگوں نے جھگڑا کیا یہ لوگ اپنا مقدمہ ہشام بن اسماعیل یا اسماعیل بن ہشام کے پاس لے گئے انہوں نے عبدالملک کے پاس مقدمہ کو بھیج دیا، عبدالملک نے کہا: یہ فیصلہ تو ایسا لگتا ہے جیسے میں اس کو دیکھ چکا ہوں۔ راوی کہتے ہیں پھر عبدالملک نے عمر بن خطاب رضی اللہ عنہ کے فیصلہ کے مطابق فیصلہ دیا اور وہ ولاء اب تک ہمارے پاس ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2918,
			"arabicnumber": 2918,
			"text": "تمیم داری رضی اللہ عنہ کہتے ہیں کہ میں نے عرض کیا: اللہ کے رسول! اس شخص کے بارے میں شرع کا کیا حکم ہے جو کسی مسلمان شخص کے ہاتھ پر ایمان لایا ہو؟ آپ صلی اللہ علیہ وسلم نے فرمایا: وہ شخص دوسروں کی بہ نسبت اس کی موت و حیات کے زیادہ قریب ہے ( اگر اس کا کوئی اور وارث نہ ہو تو وہی وارث ہو گا ) ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2919,
			"arabicnumber": 2919,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ولاء کو بیچنے اور اسے ہبہ کرنے سے منع فرمایا ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2920,
			"arabicnumber": 2920,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جب بچہ آواز کرے تو وراثت کا حقدار ہو جائے گا ۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2921,
			"arabicnumber": 2921,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں اللہ تعالیٰ کے فرمان: «والذين عقدت أيمانكم فآتوهم نصيبهم» جن لوگوں سے تم نے قسمیں کھائی ہیں ان کو ان کا حصہ دے دو ( سورۃ النساء: ۳۳ ) کے مطابق پہلے ایک شخص دوسرے شخص سے جس سے قرابت نہ ہوتی باہمی اخوت اور ایک دوسرے کے وارث ہونے کا عہد و پیمان کرتا پھر ایک دوسرے کا وارث ہوتا، پھر یہ حکم سورۃ الانفال کی آیت:«وأولو الأرحام بعضهم أولى ببعض» اور رشتے ناتے والے ان میں سے بعض بعض سے زیادہ نزدیک ہیں ( سورۃ الانفال: ۷۵ ) سے منسوخ ہو گیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2922,
			"arabicnumber": 2922,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ اللہ تعالیٰ کے قول: «والذين عقدت أيمانكم فآتوهم نصيبهم» کا قصہ یہ ہے کہ جب مہاجرین مکہ سے مدینہ ہجرت کر کے آئے تو اس مواخات ( بھائی چارہ ) کی بنا پر جو رسول اللہ صلی اللہ علیہ وسلم نے انصار و مہاجرین کے درمیان کرا دی تھی وہ انصار کے وارث ہوتے ( اور انصار ان کے وارث ہوتے ) اور عزیز و اقارب وارث نہ ہوتے، لیکن جب یہ آیت«ولكل جعلنا موالي مما ترك» ماں باپ یا قرابت دار جو چھوڑ کر مریں اس کے وارث ہم نے ہر شخص کے مقرر کر دیے ہیں ( سورۃ النساء: ۳۳ ) نازل ہوئی تو «والذين عقدت أيمانكم فآتوهم نصيبهم» ‏‏‏‏ والی آیت کو منسوخ کر دیا، اور اس کا مطلب یہ رہ گیا کہ ان کی اعانت، خیر خواہی اور سہارے کے طور پر جو چاہے کر دے نیز ان کے لیے وہ ( ایک تہائی مال ) کی وصیت کر سکتا ہے، میراث ختم ہو گئی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2923,
			"arabicnumber": 2923,
			"text": "داود بن حصین کہتے ہیں کہ میں ام سعد بنت ربیع سے ( کلام پاک ) پڑھتا تھا وہ ابوبکر صدیق رضی اللہ عنہ کی زیر پرورش ایک یتیم بچی تھیں، میں نے اس آیت «والذين عقدت أيمانكم» کو پڑھا تو کہنے لگیں: اس آیت کو نہ پڑھو، یہ ابوبکر اور ان کے بیٹے عبدالرحمٰن رضی اللہ عنہما کے متعلق اتری ہے، جب عبدالرحمٰن نے مسلمان ہونے سے انکار کیا تو ابوبکر رضی اللہ عنہ نے قسم کھا لی کہ میں ان کو وارث نہیں بناؤں گا پھر جب وہ مسلمان ہو گئے تو اللہ نے اپنے نبی اکرم صلی اللہ علیہ وسلم کو حکم دیا کہ وہ ( ابوبکر رضی اللہ عنہ سے کہیں ) کہ وہ ان کا حصہ دیں۔ عبدالعزیز کی روایت میں اتنا زیادہ ہے کہ عبدالرحمٰن تلوار کے دباؤ میں آ کر مسلمان ہوئے ( یعنی جب اسلام کو غلبہ حاصل ہوا ) ۔ ابوداؤد کہتے ہیں: جس نے «عقدت» کہا اس نے اس سے «حلف» اور جس نے «عاقدت» کہا اس نے اس سے«حالف» مراد لیا اور صحیح طلحہ کی حدیث ہے جس میں «عاقدت» ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2924,
			"arabicnumber": 2924,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ پہلے اللہ تعالیٰ نے یوں فرمایا تھا: «والذين، ‏‏‏‏ آمنوا وهاجروا» ، «والذين آمنوا ولم يهاجروا» جو لوگ ایمان لائے اور ہجرت کی وہ ایک دوسرے کے وارث ہوں گے اور جو لوگ ایمان لائے اور ہجرت نہیں کی تو وہ ان کے وارث نہیں ہوں گے ( سورۃ الانفال: ۷۲ ) تو اعرابی ۱؎ مہاجر کا وارث نہ ہوتا اور نہ مہاجر اس کا وارث ہوتا اس کے بعد «وأولو الأرحام بعضهم أولى ببعض» اور رشتے ناتے والے ان میں سے بعض بعض سے زیادہ نزدیک ہیں ( سورۃ الانفال: ۷۵ ) والی آیت سے یہ حکم منسوخ ہو گیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2925,
			"arabicnumber": 2925,
			"text": "جبیر بن مطعم رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ( زمانہ کفر کی ) کوئی بھی قسم اور عہد و پیمان کا اسلام میں کچھ اعتبار نہیں، اور جو عہد و پیمان زمانہ جاہلیت میں ( بھلے کام کے لیے ) تھا تو اسلام نے اسے مزید مضبوطی بخشی ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2926,
			"arabicnumber": 2926,
			"text": "انس بن مالک رضی اللہ عنہ کہتے ہیں رسول اللہ صلی اللہ علیہ وسلم نے ہمارے گھر میں انصار و مہاجرین کے درمیان بھائی چارہ کرایا، تو ان ( یعنی انس ) سے کہا گیا: کیا رسول اللہ صلی اللہ علیہ وسلم نے نہیں فرمایا ہے کہ اسلام میں حلف ( عہد و پیمان ) نہیں ہے؟ تو انہوں نے دو یا تین بار زور دے کر کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے ہمارے گھر میں انصار و مہاجرین کے درمیان بھائی چارہ کرایا ہے کہ وہ بھائیوں کی طرح مل کر رہیں گے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2927,
			"arabicnumber": 2927,
			"text": "سعید کہتے ہیں کہ عمر بن خطاب رضی اللہ عنہ پہلے کہتے تھے کہ دیت کنبہ والوں پر ہے، اور عورت اپنے شوہر کی دیت سے کچھ حصہ نہ پائے گی، یہاں تک کہ ضحاک بن سفیان نے انہیں بتایا کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھے لکھ بھیجا تھا کہ اشیم ضبابی کی بیوی کو میں اس کے شوہر کی دیت میں سے حصہ دلاؤں، تو عمر رضی اللہ عنہ نے اپنے قول سے رجوع کر لیا ۱؎۔ احمد بن صالح کہتے ہیں کہ ہم سے عبدالرزاق نے یہ حدیث معمر کے واسطہ سے بیان کی ہے وہ اسے زہری سے اور وہ سعید سے روایت کرتے ہیں، اس میں ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے انہیں ( یعنی ضحاک کو ) دیہات والوں پر عامل بنایا تھا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 43
			}
		}
	]
}