{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"22": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3242,
			"arabicnumber": 3242,
			"text": "عمران بن حصین رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جو کسی دباؤ میں آ کر ( یا دیدہ و دانستہ ) جھوٹی قسم کھا لے تو چاہیئے کہ اس کے سبب وہ اپنا ٹھکانہ جہنم میں بنا لے ۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3243,
			"arabicnumber": 3243,
			"text": "عبداللہ (عبداللہ بن مسعود) رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو کسی بات پر جھوٹی قسم کھائے تاکہ اس سے کسی مسلمان کا مال ہڑپ لے تو وہ اللہ سے اس حال میں ملے گا کہ اللہ اس پر غضبناک ہو گا ۔ اشعث رضی اللہ عنہ کہتے ہیں: قسم اللہ کی آپ صلی اللہ علیہ وسلم نے یہ بات میرے ایک مقدمے میں ( جو میرے اور ایک یہودی کے درمیان تھا ) فرمائی تھی، میرے اور ایک یہودی کے درمیان ایک زمین مشترک تھی، یہودی نے میرے حصہ کا انکار کیا تو میں اس کو لے کر نبی اکرم صلی اللہ علیہ وسلم کے پاس آیا، آپ صلی اللہ علیہ وسلم نے مجھ سے پوچھا: تمہارے پاس گواہ ہیں؟ میں نے کہا: نہیں، تو آپ صلی اللہ علیہ وسلم نے یہودی سے کہا: تم قسم کھاؤ میں نے عرض کیا: اللہ کے رسول! یہ تو قسم کھا کر میرا مال ہڑپ کر لے گا، تو اللہ تعالیٰ نے یہ آیت «إن الذين يشترون بعهد الله وأيمانهم ثمنا قليلا» بیشک جو لوگ اللہ کے عہد اور اپنی قسموں کو تھوڑی قیمت پر بیچ ڈالتے ہیں، ان کے لیے آخرت میں کوئی حصہ نہیں ( سورۃ آل عمران: ۷۷ ) آخیر تک نازل فرمائی ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3244,
			"arabicnumber": 3244,
			"text": "اشعث بن قیس رضی اللہ عنہ کہتے ہیں کہ یمن کی ایک زمین کے سلسلے میں کندہ کے ایک آدمی اور حضر موت کے ایک آدمی نے جھگڑا کیا اور دونوں اپنا مقدمہ نبی اکرم صلی اللہ علیہ وسلم کے پاس لے گئے، حضرمی نے کہا: اللہ کے رسول! میری زمین کو اس شخص کے باپ نے مجھ سے چھین لی تھی اور اب وہ زمین اس شخص کے قبضہ میں ہے، آپ صلی اللہ علیہ وسلم نے اس سے پوچھا: تمہارے پاس «بیّنہ» ( ثبوت اور دلیل ) ہے؟ اس نے کہا: نہیں، لیکن میں اسے قسم دلانا چاہوں گا، اور اللہ کو خوب معلوم ہے کہ یہ میری زمین ہے جسے اس کے باپ نے مجھ سے غصب کر لی تھی، ( یہ سن کر ) کندی قسم کھانے کے لیے تیار ہو گیا، تو رسول اللہ صلی اللہ علیہ وسلم نے ( اس وقت ) فرمایا: جو شخص کسی کا مال قسم کھا کر ہڑپ کر لے گا تو قیامت کے دن وہ اللہ سے کوڑھی ہو کر ملے گا ( یہ سنا تو ) کندی نے کہا: یہ اسی کی زمین ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3245,
			"arabicnumber": 3245,
			"text": "وائل بن حجر حضرمی رضی اللہ عنہ کہتے ہیں کہ حضر موت کا ایک شخص اور کندہ کا ایک شخص دونوں رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے، حضرمی نے کہا: اللہ کے رسول! اس شخص نے میرے والد کی ایک زمین مجھ سے چھین لی ہے، کندی نے کہا: واہ یہ میری زمین ہے، میرے قبضے میں ہے میں خود اس میں کھیتی کرتا ہوں اس میں اس کا کوئی حق نہیں ہے۔ راوی کہتے ہیں: تو نبی اکرم صلی اللہ علیہ وسلم نے حضرمی سے پوچھا: کیا تمہارے پاس گواہ ہیں؟ اس نے کہا: نہیں، آپ صلی اللہ علیہ وسلم نے فرمایا: پھر تو تمہارے لیے اس کی جانب سے قسم ہے ( جیسی وہ قسم کھا لے اسی کے مطابق فیصلہ ہو جائے گا ) ، حضرمی نے کہا: اللہ کے رسول: وہ تو فاجر ہے کسی بھی قسم کی پرواہ نہیں کرتا، کسی بھی چیز سے نہیں ڈرتا، نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ( وہ کچھ بھی ہو ) تمہارے لیے تو بس اس سے اتنا ہی حق ہے ( یعنی تم اس سے بس قسم کھلا سکتے ہو ) پھر وہ قسم کھانے چلا، تو اس کے مڑتے ہی رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: دیکھو اگر کسی کا مال ہڑپ کرنے کے لیے اس نے جھوٹی قسم کھا لی تو وہ اللہ سے اس حال میں ملے گا کہ اللہ اس سے منہ پھیرے ہو گا ۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3246,
			"arabicnumber": 3246,
			"text": "جابر بن عبداللہ رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو شخص میرے منبر کے پاس جھوٹی قسم کھائے گا اگرچہ ایک تازی مسواک کے لیے کھائے تو سمجھ لو اس نے اپنا ٹھکانہ جہنم میں بنا لیا یا یہ کہا: جہنم اس پر واجب ہو گئی ۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 3247,
			"arabicnumber": 3247,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو کوئی قسم کھائے اور اپنی قسم میں یوں کہے کہ میں لات کی قسم کھاتا ہوں تو چاہیئے کہ وہ «لا إله إلا الله» کہے، اور جو کوئی اپنے دوست سے کہے کہ آؤ ہم تم جوا کھیلیں تو اس کو چاہیئے کہ کچھ نہ کچھ صدقہ کرے ( تاکہ شرک اور کلمہ شرک کا کفارہ ہو جائے ) ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3248,
			"arabicnumber": 3248,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تم اپنے باپ دادا کی قسم نہ کھاؤ، نہ اپنی ماؤں کی قسم کھانا، اور نہ ان کی قسم کھانا جنہیں لوگ اللہ کا شریک ٹھہراتے ہیں، تم صرف اللہ کی قسم کھانا، اور اللہ کی بھی قسم اسی وقت کھاؤ جب تم سچے ہو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3249,
			"arabicnumber": 3249,
			"text": "عمر بن خطاب رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے انہیں اس حال میں پایا کہ وہ ایک قافلہ میں تھے اور اپنے باپ کی قسم کھا رہے تھے تو آپ صلی اللہ علیہ وسلم نے فرمایا: اللہ تعالیٰ تمہیں اپنے باپ دادا کی قسم کھانے سے روکتا ہے اگر کسی کو قسم کھانی ہی ہے تو اللہ کی قسم کھائے ورنہ خاموش رہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3250,
			"arabicnumber": 3250,
			"text": "عمر رضی اللہ عنہ کہتے ہیں کہ مجھے رسول صلی اللہ علیہ وسلم نے ( غیر اللہ کی قسم کھاتے ہوئے ) سنا، پھر راوی نے اسی مفہوم کی حدیث:«بآبائكم» تک بیان کی، اس میں اتنا اضافہ ہے کہ عمر رضی اللہ عنہ نے کہا: قسم اللہ کی پھر میں نے نہ جان بوجھ کر اس کی قسم کھائی، اور نہ ہی کسی کی بات نقل کرتے ہوئے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3251,
			"arabicnumber": 3251,
			"text": "سعد بن عبیدہ کہتے ہیں عبداللہ بن عمر رضی اللہ عنہما نے ایک شخص کو کعبہ کی قسم کھاتے ہوئے سنا تو ابن عمر رضی اللہ عنہما نے اس سے کہا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا ہے: جس نے اللہ کے سوا کسی اور کے نام کی قسم کھائی تو اس نے شرک کیا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3252,
			"arabicnumber": 3252,
			"text": "مالک بن ابی عامر کہتے ہیں کہ طلحہ بن عبیداللہ رضی اللہ عنہ نے سنا ( یعنی اعرابی کے واقعہ میں ) نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: قسم ہے اس کے باپ کی، وہ کامیاب ہو گیا اگر وہ سچا ہے، قسم ہے اس کے باپ کی وہ جنت میں داخل ہو گیا اگر وہ سچا ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3253,
			"arabicnumber": 3253,
			"text": "بریدہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو امانت کی قسم کھائے وہ ہم میں سے نہیں ۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3254,
			"arabicnumber": 3254,
			"text": "عطاء سے یمین لغو کے بارے میں روایت ہے، وہ کہتے ہیں کہ ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: یمین لغو یہ ہے کہ آدمی اپنے گھر میں ( تکیہ کلام کے طور پر ) «كلا والله وبلى والله» ( ہرگز نہیں قسم اللہ کی، ہاں قسم اللہ کی ) کہے ۔ ابوداؤد کہتے ہیں: ابراہیم صائغ ایک نیک آدمی تھے، ابومسلم نے عرندس میں انہیں قتل کر دیا تھا، ابراہیم صائغ کا حال یہ تھا کہ اگر وہ ہتھوڑا اوپر اٹھائے ہوتے اور اذان کی آواز آ جاتی تو ( مارنے سے پہلے ) اسے چھوڑ دیتے۔ ابوداؤد کہتے ہیں: اس حدیث کو داود بن ابوالفرات نے ابراہیم صائغ سے ام المؤمنین عائشہ رضی اللہ عنہا پر موقوفاً روایت کیا ہے اور اسے اسی طرح زہری، عبدالملک بن ابی سلیمان اور مالک بن مغول نے روایت کیا ہے اور ان سب نے عطاء سے انہوں نے ام المؤمنین عائشہ رضی اللہ عنہا سے موقوفاً روایت کیا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3255,
			"arabicnumber": 3255,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تمہاری قسم کا اعتبار اسی چیز پر ہو گا جس پر تمہارا ساتھی تمہاری تصدیق کرے ۔ مسدد کی روایت میں: «أخبرني عبد الله بن أبي صالح» ہے۔ ابوداؤد کہتے ہیں: عباد بن ابی صالح اور عبداللہ بن ابی صالح دونوں ایک ہی ہیں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3256,
			"arabicnumber": 3256,
			"text": "سوید بن حنظلہ رضی اللہ عنہ کہتے ہیں ہم نکلے، رسول اللہ صلی اللہ علیہ وسلم کے پاس جانے کا ارادہ کر رہے تھے، اور ہمارے ساتھ وائل بن حجر رضی اللہ عنہ بھی تھے، انہیں ان کے ایک دشمن نے پکڑ لیا تو اور ساتھیوں نے انہیں جھوٹی قسم کھا کر چھڑا لینے کو برا سمجھا ( لیکن ) میں نے قسم کھا لی کہ وہ میرا بھائی ہے تو اس نے انہیں آنے دیا، پھر جب ہم رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے تو میں نے آپ صلی اللہ علیہ وسلم کو بتایا کہ اور لوگوں نے تو قسم کھانے میں حرج و قباحت سمجھی، اور میں نے قسم کھا لی کہ یہ میرے بھائی ہیں، آپ صلی اللہ علیہ وسلم نے فرمایا: تم نے سچ کہا، ایک مسلمان دوسرے مسلمان کا بھائی ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3257,
			"arabicnumber": 3257,
			"text": "ثابت بن ضحاک رضی اللہ عنہ نے خبر دی کہ انہوں نے درخت کے نیچے رسول اللہ صلی اللہ علیہ وسلم سے بیعت کی ۱؎، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو شخص ملت اسلام کے سوا کسی اور ملت میں ہونے کی جھوٹی قسم کھائے تو وہ ویسے ہی ہو جائے گا جیسا اس نے کہا ہے، اور جو شخص اپنے آپ کو کسی چیز سے ہلاک کر ڈالے ( یعنی خودکشی کر لے ) تو قیامت میں اس کو اسی چیز سے عذاب دیا جائے گا، اور اس آدمی کی نذر نہیں مانی جائے گی جو کسی ایسی چیز کی نذر مانے جو اس کے اختیار میں نہ ہو ۲؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 3258,
			"arabicnumber": 3258,
			"text": "بریدہ رضی اللہ عنہ کہتے ہیں رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو شخص قسم کھائے اور کہے میں اسلام سے بری ہوں ( اگر میں نے فلاں کام کیا ) اب اگر وہ جھوٹا ہے تو اس نے جیسا ہونے کو کہا ہے ویسا ہی ہو جائے گا، اور اگر سچا ہے تو بھی وہ اسلام میں سلامتی سے ہرگز واپس نہ آ سکے گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 3259,
			"arabicnumber": 3259,
			"text": "یوسف بن عبداللہ بن سلام کہتے ہیں میں نے نبی اکرم صلی اللہ علیہ وسلم کو دیکھا آپ نے روٹی کے ٹکڑے پر کھجور رکھا اور کہا یہ اس کا سالن ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 3260,
			"arabicnumber": 3260,
			"text": "اس سند سے بھی یوسف بن عبداللہ بن سلام سے اسی کے مثل مروی ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 3261,
			"arabicnumber": 3261,
			"text": "عبداللہ بن عمر رضی اللہ عنہما سے مرفوعاً روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جس نے کسی کام پر قسم کھائی پھر ان شاءاللہ کہا تو اس نے استثناء کر لیا ۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 3262,
			"arabicnumber": 3262,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس نے قسم کھائی اور ان شاءاللہ کہا تو وہ چاہے قسم کو پورا کرے چاہے نہ پورا کرے وہ حانث ( قسم توڑنے والا ) نہ ہو گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 3263,
			"arabicnumber": 3263,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں رسول اللہ صلی اللہ علیہ وسلم اکثر اس طرح قسم کھاتے تھے: «لا، ‏‏‏‏ ومقلب القلوب» نہیں! قسم ہے دلوں کے پھیرنے والے کی ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 3264,
			"arabicnumber": 3264,
			"text": "ابو سعید خدری رضی اللہ عنہ کہتے ہیں جب رسول اللہ صلی اللہ علیہ وسلم زور دے کر قسم کھاتے تو فرماتے: «والذي نفس أبي القاسم بيده» قسم ہے اس ذات کی جس کے ہاتھ میں ابوالقاسم کی جان ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 3265,
			"arabicnumber": 3265,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جب قسم کھاتے تو فرماتے: «لا، ‏‏‏‏ وأستغفر الله» نہیں، قسم ہے میں اللہ سے بخشش اور مغفرت کا طلب گار ہوں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 3266,
			"arabicnumber": 3266,
			"text": "عاصم بن لقیط کہتے ہیں کہ لقیط بن عامر رضی اللہ عنہ نبی اکرم صلی اللہ علیہ وسلم کے پاس ایک وفد لے کر گئے، لقیط رضی اللہ عنہ کہتے ہیں کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے، پھر راوی نے حدیث ذکر کی، اس میں ہے تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: قسم ہے تمہارے معبود کی ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 3267,
			"arabicnumber": 3267,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ ابوبکر رضی اللہ عنہ نے نبی اکرم صلی اللہ علیہ وسلم کو قسم دلائی، تو نبی اکرم صلی اللہ علیہ وسلم نے ان سے فرمایا: قسم مت دلاؤ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 3268,
			"arabicnumber": 3268,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ ابوہریرہ رضی اللہ عنہ بیان کر رہے تھے کہ ایک شخص رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا، اور اس نے عرض کیا کہ میں نے رات خواب دیکھا ہے، پھر اس نے اپنا خواب بیان کیا، ابوبکر رضی اللہ عنہ نے اس کی تعبیر بتائی، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تم نے کچھ تعبیر درست بیان کی ہے اور کچھ میں تم غلطی کر گئے ہو ابوبکر رضی اللہ عنہ نے کہا: قسم ہے آپ پر اے اللہ کے رسول! میرے باپ آپ پر قربان ہوں آپ ہمیں ضرور بتائیں میں نے کیا غلطی کی ہے؟ تو نبی اکرم صلی اللہ علیہ وسلم نے ان سے فرمایا: قسم مت دلاؤ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 3269,
			"arabicnumber": 3269,
			"text": "عبداللہ بن عباس رضی اللہ عنہما نے نبی اکرم صلی اللہ علیہ وسلم سے یہی حدیث روایت کی ہے لیکن اس میں انہوں نے قسم کا ذکر نہیں کیا ہے اور اس میں اتنا اضافہ ہے: آپ صلی اللہ علیہ وسلم نے انہیں ( تعبیر کی غلطی ) نہیں بتائی ۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 3270,
			"arabicnumber": 3270,
			"text": "عبدالرحمٰن بن ابوبکر رضی اللہ عنہما کہتے ہیں کہ ہمارے یہاں ہمارے کچھ مہمان آئے، اور ابوبکر رضی اللہ عنہ رات میں رسول اللہ صلی اللہ علیہ وسلم کے پاس جا کر بات چیت کیا کرتے تھے ( جاتے وقت ) کہہ گئے کہ میں واپس نہیں آ سکوں گا یہاں تک کہ تم اپنے مہمانوں کو کھلا پلا کر فارغ ہو جاؤ ( یعنی میں دیر سے آ سکوں گا تم انہیں کھانا وغیرہ کھلا دینا ) تو وہ ( عبدالرحمٰن رضی اللہ عنہ ) ان کا کھانا لے کر آئے تو مہمان کہنے لگے: ہم ابوبکر رضی اللہ عنہ کے آئے بغیر نہیں کھائیں گے، پھر وہ آئے تو پوچھا: کیا ہوا تمہارے مہمانوں کا؟ تم کھانا کھلا کر فارغ ہو گئے؟ لوگوں نے کہا: نہیں، میں نے کہا: میں ان کا کھانا لے کر ان کے پاس آیا مگر انہوں نے انکار کیا اور کہا: قسم اللہ کی جب تک وہ ( ابوبکر ) نہیں آ جائیں گے ہم نہیں کھائیں گے، تو ان لوگوں نے کہا: یہ سچ کہہ رہے ہیں، یہ ہمارے پاس کھانا لے کر آئے تھے، لیکن ہم نے ہی انکار کر دیا کہ جب تک آپ نہیں آ جاتے ہیں ہم نہیں کھائیں گے، آپ نے کہا: کس چیز نے تمہیں کھانے سے روکا؟ انہوں نے کہا: آپ کے نہ ہونے نے، انہوں نے کہا: قسم اللہ کی میں تو آج رات کھانا نہیں کھاؤں گا، مہمانوں نے کہا: جب تک آپ نہیں کھائیں گے ہم بھی نہیں کھائیں گے، ابوبکر رضی اللہ عنہ نے کہا: آج جیسی بری رات میں نے کبھی نہ دیکھی، پھر کہا: کھانا لاؤ تو ان کا کھانا لا کر لگا دیا گیا تو انہوں نے «بسم الله» کہہ کر کھانا شروع کر دیا، مہمان بھی کھانے لگے۔ عبدالرحمٰن رضی اللہ عنہ کہتے ہیں: مجھے اطلاع دی گئی کہ صبح اٹھ کر ابوبکر رضی اللہ عنہ نبی اکرم صلی اللہ علیہ وسلم کے پاس گئے، اور جو کچھ انہوں نے اور مہمانوں نے کیا تھا اس سے آپ صلی اللہ علیہ وسلم کو آگاہ کیا، تو آپ صلی اللہ علیہ وسلم نے فرمایا: تم ان لوگوں سے زیادہ قسم کو پورا کرنے والے اور صادق ہو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 3271,
			"arabicnumber": 3271,
			"text": "اس سند سے بھی عبدالرحمٰن بن ابوبکر رضی اللہ عنہما سے یہ حدیث اسی طرح مروی ہے اور اس میں مزید یہ ہے کہ سالم نے اپنی حدیث میں کہا کہ مجھے یہ معلوم نہ ہو سکا کہ ابوبکر رضی اللہ عنہ نے اس قسم کا کفارہ دیا ہو ( کیونکہ یہ قسم لغو ہے ) ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 3272,
			"arabicnumber": 3272,
			"text": "سعید بن مسیب سے روایت ہے کہ انصار کے دو بھائیوں میں میراث کی تقسیم کا معاملہ تھا، ان میں کے ایک نے دوسرے سے میراث تقسیم کر دینے کے لیے کہا تو اس نے کہا: اگر تم نے دوبارہ تقسیم کرنے کا مطالبہ کیا تو میرا سارا مال کعبہ کے دروازے کے اندر ہو گا ۱؎تو عمر رضی اللہ عنہ نے اس سے کہا: کعبہ تمہارے مال کا محتاج نہیں ہے، اپنی قسم کا کفارہ دے کر اپنے بھائی سے ( تقسیم میراث کی ) بات چیت کرو ( کیونکہ ) میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے آپ فرما رہے تھے: قسم اور نذر اللہ کی نافرمانی اور رشتہ توڑنے میں نہیں اور نہ اس مال میں ہے جس میں تمہیں اختیار نہیں ( ایسی قسم اور نذر لغو ہے ) ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 3273,
			"arabicnumber": 3273,
			"text": "عبداللہ بن عمرو رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: صرف ان چیزوں میں نذر جائز ہے جس سے اللہ کی رضا و خوشنودی مطلوب ہو اور قسم ( قطع رحمی ) ناتا توڑنے کے لیے جائز نہیں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 3274,
			"arabicnumber": 3274,
			"text": "عبداللہ بن عمرو بن العاص رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: نذر اور قسم اس چیز میں نہیں جو ابن آدم کے اختیار میں نہ ہو، اور نہ اللہ کی نافرمانی میں، اور نہ ناتا توڑنے میں، جو قسم کھائے اور پھر اسے بھلائی اس کے خلاف میں نظر آئے تو اس قسم کو چھوڑ دے ( پوری نہ کرے ) اور اس کو اختیار کرے جس میں بھلائی ہو کیونکہ اس قسم کا چھوڑ دینا ہی اس کا کفارہ ہے ۔ ابوداؤد کہتے ہیں: یہ تمام حدیثیں نبی اکرم صلی اللہ علیہ وسلم سے مروی ہیں ۱؎ اور چاہیئے کہ وہ اپنی قسم کا کفارہ دیں مگر جو قسمیں بے سوچے کھائی جاتی ہیں اور ان کا خیال نہیں کیا جاتا تو ان کا کفارہ نہیں ہے۔ ابوداؤد کہتے ہیں: میں نے احمد سے پوچھا: کیا یحییٰ بن سعید نے یحییٰ بن عبیداللہ سے روایت کی ہے؟ تو انہوں نے کہا: ہاں پہلے کی تھی، پھر ترک کر دیا، اور وہ اسی کے لائق تھے کہ ان سے روایت چھوڑ دی جائے، احمد کہتے ہیں: ان کی حدیثیں منکر ہیں اور ان کے والد غیر معروف ہیں ۲؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Munqar"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 3275,
			"arabicnumber": 3275,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ دو آدمی اپنا جھگڑا لے کر نبی اکرم صلی اللہ علیہ وسلم کے پاس آئے تو آپ نے مدعی سے گواہ طلب کیا، اس کے پاس گواہ نہ تھا تو آپ صلی اللہ علیہ وسلم نے مدعی علیہ سے قسم کھانے کے لیے کہا، اس نے اس اللہ کی قسم کھائی جس کے سوا کوئی اور معبود برحق نہیں ہے، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ہاں، تم نے کیا ہے ( یعنی جس کام کے نہ کرنے پر تم نے قسم کھائی ہے اسے کیا ہے ) لیکن تمہارے اخلاص کے ساتھ «لا إله إلا الله» کہنے کی وجہ سے اللہ نے تجھے بخش دیا ہے ۱؎ ۔ ابوداؤد کہتے ہیں: اس حدیث سے یہ نکلتا ہے کہ آپ صلی اللہ علیہ وسلم نے اسے کفارہ کا حکم نہیں دیا ۲؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 3276,
			"arabicnumber": 3276,
			"text": "ابوموسیٰ اشعری رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: قسم اللہ کی میں کسی بات کی قسم کھا لوں اور پھر بھلائی اس کے خلاف میں دیکھوں تو ان شاءاللہ میں اپنی قسم توڑ کر کفارہ دے دوں گا اور اسے اختیار کر لوں گا جس میں بھلائی ہو گی یا کہا: میں اسے اختیار کر لوں گا جس میں بھلائی ہو گی اور اپنی قسم توڑ کر کفارہ دے دوں گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 3277,
			"arabicnumber": 3277,
			"text": "عبدالرحمٰن بن سمرہ رضی اللہ عنہ کہتے ہیں کہ مجھ سے نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: عبدالرحمٰن بن سمرہ! جب تم کسی بات پر قسم کھا لو پھر اس کے بجائے دوسری چیز کو اس سے بہتر پاؤ تو اسے اختیار کر لو جو بہتر ہے اور اپنی قسم کا کفارہ دے دو ۔ ابوداؤد کہتے ہیں: میں نے احمد سے سنا ہے وہ قسم توڑنے سے پہلے کفارہ دینے کو جائز سمجھتے تھے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 3278,
			"arabicnumber": 3278,
			"text": "اس سند سے بھی عبدالرحمٰن بن سمرہ رضی اللہ عنہ سے اسی طرح مروی ہے اس میں ہے: تو قسم کا کفارہ ادا کرو پھر اس چیز کو اختیار کرو جو بہتر ہے ۔ ابوداؤد کہتے ہیں: ابوموسی اشعری، عدی بن حاتم اور ابوہریرہ رضی اللہ عنہم کی روایات جو اس موضوع سے متعلق ہیں ان میں بعض میں «الكفارة قبل الحنث» ہے اور بعض میں «الحنث قبل الكفارة» ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 3279,
			"arabicnumber": 3279,
			"text": "عبدالرحمٰن بن حرملہ کہتے ہیں کہ ام حبیب بنت ذؤیب بن قیس مزنیہ قبیلہ بنو اسلم کے ایک شخص کے نکاح میں تھیں پھر وہ ام المؤمنین صفیہ رضی اللہ عنہا کے بھتیجے کے نکاح میں آئیں، آپ نے ہم کو ایک صاع ہبہ کیا، اور ہم سے بیان کیا کہ ام المؤمنین صفیہ رضی اللہ عنہا کے بھتیجے سے روایت ہے، اور انہوں نے ام المؤمنین صفیہ سے روایت کی ہے کہ ام المؤمنین کہتی ہیں کہ یہ نبی اکرم صلی اللہ علیہ وسلم کا صاع ہے۔ انس رضی اللہ عنہ کہتے ہیں: میں نے اس کو جانچا یا کہا میں نے اس کا اندازہ کیا تو ہشام بن عبدالملک کے مد سے دو مد اور آدھے مد کے برابر پایا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 3280,
			"arabicnumber": 3280,
			"text": "محمد بن محمد بن خلاد ابوعمر کا بیان ہے کہ میرے پاس ایک مکوک ۱؎ تھا اسے مکوک خالد کہا جاتا تھا، وہ ہارون کے کیلجہ ( ایک پیمانہ ہے ) سے دو کیلجہ کے برابر تھا۔ محمد کہتے ہیں: خالد کا صاع ہشام یعنی ابن عبدالملک کا صاع ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 3281,
			"arabicnumber": 3281,
			"text": "امیہ بن خالد کہتے ہیں جب خالد قسری گورنر مقرر ہوئے تو انہوں نے صاع کو دو چند کر دیا تو ایک صاع ( ۱۶ ) رطل کا ہو گیا ۱؎۔ ابوداؤد کہتے ہیں: محمد بن محمد بن خلاد کو حبشیوں نے سامنے کھڑا کر کے قتل کر دیا تھا انہوں نے ہاتھ سے بتایا کہ اس طرح ( یہ کہہ کر ) ابوداؤد نے اپنا ہاتھ پھیلایا، اور اپنے دونوں ہاتھوں کی ہتھیلیوں کے باطن کو زمین کی طرف کیا۔ ابوداؤد کہتے ہیں: میں نے ان کو خواب میں دیکھا تو ان سے پوچھا: اللہ تعالیٰ نے آپ کے ساتھ کیا برتاؤ کیا؟ انہوں نے کہا: اللہ نے مجھے جنت میں داخل فرما دیا، تو میں نے کہا: پھر تو آپ کو حبشیوں کے سامنے کھڑا کر کے قتل کئے جانے سے کچھ نقصان نہ پہنچا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 3282,
			"arabicnumber": 3282,
			"text": "معاویہ بن حکم سلمی کہتے ہیں کہ میں نے عرض کیا: اللہ کے رسول! میری ایک لونڈی ہے میں نے اسے ایک تھپڑ مارا ہے، تو رسول صلی اللہ علیہ وسلم نے اس تھپڑ کو عظیم جانا، تو میں نے عرض کیا: میں کیوں نہ اسے آزاد کر دوں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: اسے میرے پاس لے آؤ میں اسے لے کر گیا، آپ صلی اللہ علیہ وسلم نے پوچھا: اللہ کہاں ہے؟ اس نے کہا: آسمان کے اوپر، آپ صلی اللہ علیہ وسلم نے ( پھر ) پوچھا: میں کون ہوں؟ اس نے کہا: آپ اللہ کے رسول ہیں، آپ صلی اللہ علیہ وسلم نے فرمایا: اسے آزاد کر دو، یہ مومنہ ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 3283,
			"arabicnumber": 3283,
			"text": "شرید سے روایت ہے کہ ان کی والدہ نے انہیں اپنی طرف سے ایک مومنہ لونڈی آزاد کر دینے کی وصیت کی تو وہ نبی اکرم صلی اللہ علیہ وسلم کے پاس آئے اور عرض کیا: اللہ کے رسول! میری والدہ نے مجھے وصیت کی ہے کہ میں ان کی طرف سے ایک مومنہ لونڈی آزاد کر دوں، اور میرے پاس نوبہ ( حبش کے پاس ایک ریاست ہے ) کی ایک کالی لونڈی ہے۔ ۔ ۔ پھر اوپر گزری ہوئی حدیث کی طرح ذکر کیا۔ ابوداؤد کہتے ہیں کہ خالد بن عبداللہ نے اس حدیث کو مرسلاً روایت کیا ہے، شرید کا ذکر نہیں کیا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 3284,
			"arabicnumber": 3284,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم کے پاس ایک شخص ایک کالی لونڈی لے کر آیا، اور اس نے عرض کیا: اﷲ کے رسول! میرے ذمہ ایک مومنہ لونڈی آزاد کرنا ہے، آپ صلی اللہ علیہ وسلم نے اس ( لونڈی ) سے پوچھا: اﷲ کہاں ہے؟ تو اس نے اپنی انگلی سے آسمان کی طرف اشارہ کیا ( یعنی آسمان کے اوپر ہے ) پھر آپ صلی اللہ علیہ وسلم نے اس سے پوچھا: میں کون ہوں؟ تو اس نے نبی اکرم صلی اللہ علیہ وسلم اور آسمان کی طرف اشارہ کیا یعنی ( یہ کہا ) آپ اللہ کے رسول ہیں، آپ صلی اللہ علیہ وسلم نے ( لونڈی لے کر آنے والے شخص سے ) کہا: اسے آزاد کر دو یہ مومنہ ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 3285,
			"arabicnumber": 3285,
			"text": "عکرمہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: قسم اللہ کی، میں قریش سے جہاد کروں گا، قسم اللہ کی، میں قریش سے جہاد کروں گا، قسم اللہ کی، میں قریش سے جہاد کروں گا پھر کہا: ان شاءاللہ ( اگر اللہ نے چاہا ) ۔ ابوداؤد کہتے ہیں: اس روایت کو ایک نہیں کئی لوگوں نے شریک سے، شریک نے سماک سے، سماک نے عکرمہ سے، عکرمہ نے ابن عباس رضی اللہ عنہما سے اور ابن عباس نے نبی اکرم صلی اللہ علیہ وسلم سے مسنداً بیان کیا ہے، اور ولید بن مسلم نے شریک سے روایت کیا ہے اس میں ہے: پھر آپ نے ان سے غزوہ نہیں کیا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 3286,
			"arabicnumber": 3286,
			"text": "عکرمہ سے مرفوعاً روایت ہے کہ آپ صلی اللہ علیہ وسلم نے فرمایا: قسم اللہ کی میں قریش سے جہاد کروں گا ، پھر فرمایا: ان شاءاللہ پھر فرمایا: قسم اللہ کی میں قریش سے جہاد کروں گا ان شاءاللہ پھر فرمایا: قسم اللہ کی میں قریش سے جہاد کروں گا پھر آپ خاموش رہے پھر فرمایا: ان شاءاللہ ۱؎۔ ابوداؤد کہتے ہیں کہ ولید بن مسلم نے شریک سے اپنی روایت میں اتنا اضافہ کیا ہے: پھر آپ نے ان سے جہاد نہیں کیا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 3287,
			"arabicnumber": 3287,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نذر سے منع فرماتے تھے، اور فرماتے تھے کہ نذر تقدیر کے فیصلے کو کچھ بھی نہیں ٹالتی سوائے اس کے کہ اس سے بخیل ( کی جیب ) سے کچھ نکال لیا جاتا ہے۔ مسدد کی روایت میں ہے رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: نذر کسی چیز کو ٹالتی نہیں ۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 3288,
			"arabicnumber": 3288,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ( اللہ تعالیٰ کہتا ہے: ) نذر ابن آدم کے پاس کوئی ایسی چیز نہیں لا سکتی جسے میں نے اس کے لیے مقدر نہ کیا ہو لیکن نذر اسے اس تقدیر سے ملاتی ہے جسے میں نے اس کے لیے لکھ دیا ہے، یہ بخیل سے وہ چیز نکال لیتی ہے جسے وہ اس نذر سے پہلے نہیں نکالتا ہے ( یعنی اپنی بخالت کے سبب صدقہ خیرات نہیں کرتا ہے مگر نذر کی وجہ سے کر ڈالتا ہے ) ۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 3289,
			"arabicnumber": 3289,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو اللہ کی اطاعت کی نذر مانے تو اللہ کی اطاعت کرے اور جو اللہ کی نافرمانی کرنے کی نذر مانے تو اس کی نافرمانی نہ کرے ۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 3290,
			"arabicnumber": 3290,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: معصیت کی نذر نہیں ہے ( یعنی اس کا پورا کرنا جائز نہیں ہے ) اور اس کا کفارہ وہی ہے جو قسم کا کفارہ ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 3291,
			"arabicnumber": 3291,
			"text": "اس سند سے بھی ابن شہاب سے اسی مفہوم کی حدیث اسی طریق سے مروی ہے۔ ابوداؤد کہتے ہیں میں نے احمد بن شبویہ کو کہتے سنا: ابن مبارک نے کہا ہے ( یعنی اس حدیث کے بارے میں ) کہ ابوسلمہ رضی اللہ عنہ نے بیان کیا ہے، تو اس سے معلوم ہوا کہ زہری نے اسے ابوسلمہ رضی اللہ عنہ سے نہیں سنا ہے۔ احمد بن محمد کہتے ہیں: اس کی تصدیق وہ روایت کر رہی ہے جسے ہم سے ایوب یعنی ابن سلیمان نے بیان کیا ہے۔ ابوداؤد کہتے ہیں: میں نے احمد بن حنبل کو کہتے ہوئے سنا ہے کہ لوگوں نے اس حدیث کو ہم پر فاسد کر دیا ہے ان سے پوچھا گیا: کیا آپ کے نزدیک اس حدیث کا فاسد ہونا صحیح ہے؟ اور کیا ابن اویس کے علاوہ کسی اور نے بھی اسے روایت کیا ہے؟ تو انہوں نے کہا: ایوب یعنی ایوب بن سلیمان بن بلال ان سے قوی و بہتر راوی ہیں اور اسے ایوب نے روایت کیا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 3292,
			"arabicnumber": 3292,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: معصیت کی نذر نہیں ہے ( یعنی اس کا پورا کرنا جائز نہیں ہے ) اور اس کا کفارہ وہی ہے جو قسم کا کفارہ ہے ۔ احمد بن محمد مروزی کہتے ہیں: اصل حدیث علی بن مبارک کی حدیث ہے جسے انہوں نے یحییٰ بن ابی کثیر سے انہوں نے محمد بن زبیر سے اور محمد نے اپنے والد زبیر سے اور زبیر نے عمران بن حصین رضی اللہ عنہما سے اور عمران نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہے۔ احمد کی مراد یہ ہے کہ سلیمان بن ارقم کو اس حدیث میں وہم ہو گیا ہے ان سے زہری نے لے کر اس کو مرسلاً ابوسلمہ رضی اللہ عنہ سے انہوں نے عائشہ رضی اللہ عنہا سے روایت کیا ہے۔ ابوداؤد کہتے ہیں: بقیہ نے اوزاعی سے، اوزاعی نے یحییٰ سے، یحییٰ نے محمد بن زبیر سے علی بن مبارک کی سند سے اسی کے ہم مثل روایت کیا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 3293,
			"arabicnumber": 3293,
			"text": "عقبہ بن عامر رضی اللہ عنہ نے خبر دی کہ انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے اپنی ایک بہن کے بارے میں پوچھا جس نے نذر مانی تھی کہ وہ ننگے پیر اور ننگے سر حج کرے گی، تو آپ صلی اللہ علیہ وسلم نے فرمایا: اسے حکم دو کہ اپنا سر ڈھانپ لے اور سواری پر سوار ہو اور ( بطور کفارہ ) تین دن کے روزے رکھے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 3294,
			"arabicnumber": 3294,
			"text": "عبدالرزاق کہتے ہیں: ہم سے ابن جریج نے بیان کیا ہے کہ یحییٰ بن سعید نے مجھے لکھا کہ مجھے بنو ضمرہ کے غلام عبیداللہ بن زحر نے یا کوئی بھی رہے ہوں خبر دی کہ انہیں ابوسعید رعینی نے یحییٰ کی سند سے اسی مفہوم کی حدیث کی خبر دی ہے۔",
			"grades": [
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 3295,
			"arabicnumber": 3295,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ ایک شخص نبی اکرم صلی اللہ علیہ وسلم کے پاس آیا اور اس نے عرض کیا: اللہ کے رسول! میری بہن نے پیدل حج کرنے کے لیے جانے کی نذر مانی ہے، تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: اللہ تعالیٰ تمہاری بہن کی سخت کوشی پر کچھ نہیں کرے گا ( یعنی اس مشقت کا کوئی ثواب نہ دے گا ) اسے چاہیئے کہ وہ سوار ہو کر حج کرے اور قسم کا کفارہ دیدے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 3296,
			"arabicnumber": 3296,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ عقبہ بن عامر رضی اللہ عنہ کی بہن نے پیدل بیت اللہ جانے کی نذر مانی تو رسول اللہ صلی اللہ علیہ وسلم نے اسے سواری سے جانے اور ہدی ذبح کرنے کا حکم دیا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 3297,
			"arabicnumber": 3297,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم کو جب خبر ملی کہ عقبہ بن عامر رضی اللہ عنہ کی بہن نے پیدل حج کرنے کی نذر مانی ہے تو آپ صلی اللہ علیہ وسلم نے فرمایا: اللہ تعالیٰ اس کی نذر سے بے نیاز ہے، اسے کہو: سوار ہو جائے ۔ ابوداؤد کہتے ہیں: اسے سعید بن ابی عروبہ نے اسی طرح اور خالد نے عکرمہ رضی اللہ عنہ سے انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے اسی طرح روایت کیا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 3298,
			"arabicnumber": 3298,
			"text": "عکرمہ سے روایت ہے کہ عقبہ بن عامر رضی اللہ عنہ کی بہن، آگے وہی باتیں ہیں جو ہشام کی حدیث میں ہے لیکن اس میں ہدی کا ذکر نہیں ہے نیز اس میں ہے: «مر أختك فلتركب» اپنی بہن کو حکم دو کہ وہ سوار ہو جائے ۔ ابوداؤد کہتے ہیں: اسے خالد نے عکرمہ سے ہشام کے ہم معنی روایت کیا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 3299,
			"arabicnumber": 3299,
			"text": "عقبہ بن عامر جہنی رضی اللہ عنہ کہتے ہیں میری بہن نے بیت اللہ پیدل جانے کی نذر مانی اور مجھے حکم دیا کہ میں اس کے لیے رسول اللہ صلی اللہ علیہ وسلم سے مسئلہ پوچھ کر آؤں ( کہ میں کیا کروں ) تو میں نے نبی اکرم صلی اللہ علیہ وسلم سے پوچھا تو آپ نے فرمایا: چاہیئے کہ پیدل بھی چلے اور سوار بھی ہو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 3300,
			"arabicnumber": 3300,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم خطبہ دے رہے تھے کہ اسی دوران آپ کی نظر ایک ایسے شخص پر پڑی جو دھوپ میں کھڑا تھا آپ نے اس کے متعلق پوچھا، تو لوگوں نے بتایا: یہ ابواسرائیل ہے اس نے نذر مانی ہے کہ وہ کھڑا رہے گا بیٹھے گا نہیں، نہ سایہ میں آئے گا، نہ بات کرے گا، اور روزہ رکھے گا، آپ صلی اللہ علیہ وسلم نے فرمایا: اسے حکم دو کہ وہ بات کرے، سایہ میں آئے اور بیٹھے اور اپنا روزہ پورا کرے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 3301,
			"arabicnumber": 3301,
			"text": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک شخص کو اپنے دونوں بیٹوں کے درمیان ( سہارا لے کر ) چلتے ہوئے دیکھا تو آپ نے اس کے متعلق پوچھا، لوگوں نے بتایا: اس نے ( خانہ کعبہ ) پیدل جانے کی نذر مانی ہے، آپ صلی اللہ علیہ وسلم نے فرمایا: اللہ تعالیٰ اس سے بے نیاز ہے کہ یہ اپنے آپ کو تکلیف میں ڈالے آپ نے حکم دیا کہ وہ سوار ہو کر جائے۔ ابوداؤد کہتے ہیں: عمرو بن ابی عمرو نے اعرج سے، اعرج نے ابوہریرہ رضی اللہ عنہ سے، ابوہریرہ نے نبی اکرم صلی اللہ علیہ وسلم سے اسی جیسی حدیث روایت کی ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 3302,
			"arabicnumber": 3302,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم کعبہ کا طواف کرتے ہوئے ایک ایسے انسان کے پاس سے گزرے جس کی ناک میں ناتھ ڈال کر لے جایا جا رہا تھا، تو آپ صلی اللہ علیہ وسلم نے اپنے ہاتھ سے اس کی ناتھ کاٹ دی، اور حکم دیا کہ اس کا ہاتھ پکڑ کر لے جاؤ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 3303,
			"arabicnumber": 3303,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ عقبہ بن عامر رضی اللہ عنہ کی بہن نے پیدل حج کرنے کی نذر مانی اور پیدل جانے کی طاقت نہیں رکھتی تھی، تو نبی اکرم صلی اللہ علیہ وسلم نے ( عقبہ بن عامر رضی اللہ عنہ سے ) کہا: اللہ تعالیٰ کو تمہاری بہن کے پیدل جانے کی پرواہ نہیں، ( تم اپنی بہن سے کہو کہ ) وہ سوار ہو جائیں اور ( نذر کے کفارہ کے طور پر ) ایک اونٹ کی قربانی دے دیں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 3304,
			"arabicnumber": 3304,
			"text": "عقبہ بن عامر جہنی رضی اللہ عنہ کہتے ہیں کہ انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے کہا: میری بہن نے بیت اللہ پیدل جانے کی نذر مانی تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تمہاری بہن کے پیدل بیت اللہ جانے کا اللہ کوئی ثواب نہ دے گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 3305,
			"arabicnumber": 3305,
			"text": "جابر بن عبداللہ رضی اللہ عنہما کہتے ہیں کہ فتح مکہ کے دن ایک شخص کھڑا ہوا اور کہنے لگا: اللہ کے رسول! میں نے اللہ سے نذر مانی تھی کہ اگر اللہ نے آپ کو مکہ پر فتح نصیب کیا تو میں بیت المقدس میں دو رکعت ادا کروں گا، آپ صلی اللہ علیہ وسلم نے فرمایا: تم یہیں پڑھ لو ( یعنی مسجد الحرام میں اس لیے کہ اس سے افضل ہے اور سہل تر ہے ) ، اس نے پھر وہی بات دہرائی، آپ صلی اللہ علیہ وسلم نے پھر فرمایا: یہیں پڑھ لو پھر اس نے ( سہ بارہ ) وہی بات پوچھی تو آپ صلی اللہ علیہ وسلم نے فرمایا: اب تمہاری مرضی ( چاہو تو یہاں پڑھ لو اور بیت المقدس جانا چاہو تو وہاں چلے جاؤ ) ۔ ابوداؤد کہتے ہیں: اسی طرح سے عبدالرحمٰن بن عوف رضی اللہ عنہ کے واسطے سے نبی اکرم صلی اللہ علیہ وسلم سے روایت ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 3306,
			"arabicnumber": 3306,
			"text": "عمر بن عبدالرحمٰن بن عوف نے بعض صحابہ رسول صلی اللہ علیہ وسلم سے یہی حدیث روایت کی ہے لیکن اس میں اتنا اضافہ ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: قسم ہے اس ذات کی جس نے محمد کو حق کے ساتھ بھیجا ہے اگر تم یہاں ( یعنی مسجد الحرام میں ) نماز پڑھ لیتے تو تمہارے بیت المقدس میں نماز پڑھنے کی جگہ پر کافی ہوتا ( وہاں جانے کی ضرورت نہ رہتی ) ۔ ابوداؤد کہتے ہیں: اسے انصاری نے ابن جریج سے روایت کیا ہے، لیکن انہوں نے حفص بن عمر کے بجائے جعفر بن عمر کہا ہے اور عمرو بن حنۃ کے بجائے عمر بن حیۃ کہا ہے: اور کہا ہے ان دونوں نے عبدالرحمٰن بن عوف رضی اللہ عنہ سے اور نبی اکرم صلی اللہ علیہ وسلم کے اصحاب میں سے کچھ لوگوں سے روایت کیا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 3307,
			"arabicnumber": 3307,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ سعد بن عبادہ رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے مسئلہ دریافت کیا اور کہا کہ میری والدہ کا انتقال ہو گیا ہے اور ان کے ذمہ ایک نذر تھی جسے وہ پوری نہ کر سکیں تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تم ان کی جانب سے پوری کر دو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 3308,
			"arabicnumber": 3308,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ ایک عورت بحری سفر پر نکلی اس نے نذر مانی کہ اگر وہ بخیریت پہنچ گئی تو وہ مہینے بھر کا روزہ رکھے گی، اللہ تعالیٰ نے اسے بخیریت پہنچا دیا مگر روزہ نہ رکھ پائی تھی کہ موت آ گئی، تو اس کی بیٹی یا بہن رسول اللہ صلی اللہ علیہ وسلم کے پاس ( مسئلہ پوچھنے ) آئی تو اس کی جانب سے آپ نے اسے روزے رکھنے کا حکم دیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 3309,
			"arabicnumber": 3309,
			"text": "بریدہ رضی اللہ عنہ کہتے ہیں کہ ایک عورت رسول اللہ صلی اللہ علیہ وسلم کے پاس آئی اور اس نے عرض کیا: میں نے ایک باندی اپنی والدہ کو دی تھی، اب وہ مر گئیں اور وہی باندی چھوڑ گئیں ہیں، آپ صلی اللہ علیہ وسلم تمہیں تمہارا اجر مل گیا اور باندی بھی تمہیں وراثت میں مل گئی اس نے کہا: وہ مر گئیں اور ان کے ذمہ ایک مہینے کا روزہ تھا، پھر عمرو ( عمرو بن عون ) کی حدیث ( نمبر ۳۳۰۸ ) کی طرح ذکر کیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 3310,
			"arabicnumber": 3310,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ ایک عورت نبی اکرم صلی اللہ علیہ وسلم کے پاس آئی اور اس نے عرض کیا کہ میری والدہ کے ذمے ایک مہینے کے روزے تھے کیا میں اس کی جانب سے رکھ دوں؟ آپ صلی اللہ علیہ وسلم نے پوچھا: اگر تمہاری والدہ کے ذمہ قرض ہوتا تو کیا تم اسے ادا کرتی؟ اس نے کہا: ہاں، آپ صلی اللہ علیہ وسلم نے فرمایا: اللہ کا قرض تو اور بھی زیادہ ادا کئے جانے کا مستحق ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 3311,
			"arabicnumber": 3311,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا فرماتی ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جو مر جائے اور اس کے ذمہ روزے ہوں تو اس کا ولی اس کی طرف سے روزے رکھے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 3312,
			"arabicnumber": 3312,
			"text": "عبداللہ بن عمرو رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم کے پاس ایک عورت آئی اور اس نے عرض کیا: اللہ کے رسول! میں نے نذر مانی ہے کہ میں آپ کے سر پر دف بجاؤں گی، آپ صلی اللہ علیہ وسلم نے فرمایا: ( بجا کر ) اپنی نذر پوری کر لو اس نے کہا: میں نے ایسی ایسی جگہ قربانی کرنے کی نذر ( بھی ) مانی ہے جہاں جاہلیت کے زمانہ کے لوگ ذبح کیا کرتے تھے، آپ صلی اللہ علیہ وسلم نے پوچھا: کیا کسی صنم ( بت ) کے لیے؟ اس نے کہا: نہیں، پوچھا: کسی وثن ( بت ) کے لیے؟ اس نے کہا: نہیں، آپ صلی اللہ علیہ وسلم نے فرمایا: اپنی نذر پوری کر لو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 3313,
			"arabicnumber": 3313,
			"text": "ابوقلابہ کہتے ہیں کہ مجھ سے ثابت بن ضحاک نے بیان کیا ہے، وہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے زمانہ میں ایک شخص نے نذر مانی کہ وہ بوانہ ( ایک جگہ کا نام ہے ) میں اونٹ ذبح کرے گا تو وہ شخص نبی اکرم صلی اللہ علیہ وسلم کے پاس آیا اور اس نے عرض کیا کہ میں نے بوانہ میں اونٹ ذبح کرنے کی نذر مانی ہے، تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: کیا جاہلیت کے بتوں میں سے کوئی بت وہاں تھا جس کی عبادت کی جاتی تھی؟ لوگوں نے کہا: نہیں، پھر آپ صلی اللہ علیہ وسلم نے فرمایا: کیا کفار کی عیدوں میں سے کوئی عید وہاں منائی جاتی تھی؟ لوگوں نے کہا: نہیں، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اپنی نذر پوری کر لو البتہ گناہ کی نذر پوری کرنا جائز نہیں اور نہ اس چیز میں نذر ہے جس کا آدمی مالک نہیں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 3314,
			"arabicnumber": 3314,
			"text": "میمونہ بنت کردم کہتی ہیں کہ میں اپنے والد کے ساتھ حجۃ الوداع میں نکلی، تو میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا، اور لوگوں کو کہتے ہوئے سنا کہ یہ رسول اللہ صلی اللہ علیہ وسلم ہیں، میں نے آپ پر اپنی نظریں گاڑ دیں، میرے والد آپ صلی اللہ علیہ وسلم سے قریب ہوئے آپ اپنی ایک اونٹنی پر سوار تھے، آپ صلی اللہ علیہ وسلم کے پاس معلمین مکتب کے درہ کے طرح ایک درہ تھا، میں نے بدویوں اور لوگوں کو کہتے ہوئے سنا: شن شن ( درے کی آواز جو تیزی سے مارتے اور گھماتے وقت نکلتی ہے ) تو میرے والد آپ صلی اللہ علیہ وسلم سے قریب ہو گئے اور ( جا کر ) آپ کے قدم پکڑ لیے، آپ صلی اللہ علیہ وسلم کی رسالت کا اعتراف و اقرار کیا، آپ کھڑے ہو گئے اور ان کی باتیں آپ نے توجہ سے سنیں، پھر انہوں نے کہا: اللہ کے رسول! میں نے نذر مانی ہے کہ اگر میرے یہاں لڑکا پیدا ہو گا تو میں بوانہ کی دشوار گزار پہاڑیوں میں بہت سی بکریوں کی قربانی کروں گا۔ راوی کہتے ہیں: میں یہی جانتا ہوں کہ انہوں نے پچاس بکریاں کہیں۔ آپ صلی اللہ علیہ وسلم نے پوچھا: کیا وہاں کوئی بت بھی ہے؟ انہوں نے کہا: نہیں، تو آپ صلی اللہ علیہ وسلم نے فرمایا: تم نے اللہ کے لیے جو نذر مانی ہے اسے پوری کرو انہوں نے ( بکریاں ) اکٹھا کیں، اور انہیں ذبح کرنے لگے، ان میں سے ایک بکری بدک کر بھاگ گئی تو وہ اسے ڈھونڈنے لگے اور کہہ رہے تھے اے اللہ! میری نذر پوری کر دے پھر وہ اسے پا گئے تو ذبح کیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 3315,
			"arabicnumber": 3315,
			"text": "میمونہ اپنے والد کردم بن سفیان سے اسی جیسی لیکن اس سے قدرے اختصار کے ساتھ روایت کرتی ہیں آپ نے پوچھا: کیا وہاں کوئی بت ہے یا جاہلیت کی عیدوں میں سے کوئی عید ہوتی ہے؟ انہوں نے کہا: نہیں، میں نے کہا: یہ میری والدہ ہیں ان کے ذمہ نذر ہے، اور پیدل حج کرنا ہے، کیا میں اسے ان کی طرف سے پورا کر دوں؟ اور ابن بشار نے کبھی یوں کہا ہے: کیا ہم ان کی طرف سے اسے پورا کر دیں؟ ( جمع کے صیغے کے ساتھ ) آپ نے فرمایا: ہاں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 3316,
			"arabicnumber": 3316,
			"text": "عمران بن حصین رضی اللہ عنہما کہتے ہیں کہ عضباء ۱؎ بنو عقیل کے ایک شخص کی تھی، حاجیوں کی سواریوں میں آگے چلنے والی تھی، وہ شخص گرفتار کر کے نبی اکرم صلی اللہ علیہ وسلم کے پاس بندھا ہوا لایا گیا، اس وقت آپ ایک گدھے پر سوار تھے اور آپ ایک چادر اوڑھے ہوئے تھے، اس نے کہا: محمد! آپ نے مجھے اور حاجیوں کی سواریوں میں آگے جانے والی میری اونٹنی ( عضباء ) کو کس بنا پر پکڑ رکھا ہے، آپ صلی اللہ علیہ وسلم نے فرمایا: ہم نے تمہارے حلیف ثقیف کے گناہ کے جرم میں پکڑ رکھا ہے ۔ راوی کہتے ہیں: ثقیف نے نبی اکرم صلی اللہ علیہ وسلم کے اصحاب میں سے دو شخصوں کو قید کر لیا تھا۔ اس نے جو بات کہی اس میں یہ بات بھی کہی کہ میں مسلمان ہوں، یا یہ کہا کہ میں اسلام لے آیا ہوں، تو جب نبی اکرم صلی اللہ علیہ وسلم آگے بڑھ گئے ( آپ نے کوئی جواب نہیں دیا ) تو اس نے پکارا: اے محمد! اے محمد! عمران کہتے ہیں: نبی اکرم صلی اللہ علیہ وسلم رحم دل اور نرم مزاج تھے، اس کے پاس لوٹ آئے، اور پوچھا: کیا بات ہے؟ اس نے کہا: میں مسلمان ہوں، آپ صلی اللہ علیہ وسلم نے فرمایا: اگر تم یہ پہلے کہتے جب تم اپنے معاملے کے مختار تھے تو تم بالکل بچ جاتے اس نے کہا: اے محمد! میں بھوکا ہوں، مجھے کھانا کھلاؤ، میں پیاسا ہوں مجھے پانی پلاؤ۔ عمران رضی اللہ عنہ کہتے ہیں: نبی اکرم صلی اللہ علیہ وسلم نے یہ سن کر فرمایا: یہی تمہارا مقصد ہے یا: یہی اس کا مقصد ہے ۔ راوی کہتے ہیں: پھر وہ دو آدمیوں کے بدلے فدیہ میں دے دیا گیا ۲؎ اور عضباء کو رسول اللہ صلی اللہ علیہ وسلم نے اپنی سواری کے لیے روک لیا ( یعنی واپس نہیں کیا ) ۔ پھر مشرکین نے مدینہ کے جانوروں پر حملہ کیا اور عضباء کو پکڑ لے گئے، تو جب اسے لے گئے اور ایک مسلمان عورت کو بھی پکڑ لے گئے، جب رات ہوتی تو وہ لوگ اپنے اونٹوں کو اپنے کھلے میدانوں میں سستانے کے لیے چھوڑ دیتے، ایک رات وہ سب سو گئے، تو عورت ( نکل بھاگنے کے ارادہ ) سے اٹھی تو وہ جس اونٹ پر بھی ہاتھ رکھتی وہ بلبلانے لگتا یہاں تک کہ وہ عضباء کے پاس آئی، وہ ایک سیدھی سادی سواری میں مشاق اونٹنی کے پاس آئی اور اس پر سوار ہو گئی اس نے نذر مان لی کہ اگر اللہ نے اسے بچا دیا تو وہ اسے ضرور قربان کر دے گی۔ جب وہ مدینہ پہنچی تو اونٹنی نبی اکرم صلی اللہ علیہ وسلم کی اونٹنی کی حیثیت سے پہچان لی گئی، نبی اکرم صلی اللہ علیہ وسلم کو اس کی اطلاع دی گئی، آپ نے اسے بلوایا، چنانچہ اسے بلا کر لایا گیا، اس نے اپنی نذر کے متعلق بتایا، آپ صلی اللہ علیہ وسلم نے فرمایا: کتنا برا ہے جو تم نے اسے بدلہ دینا چاہا، اللہ نے اسے اس کی وجہ سے نجات دی ہے تو وہ اسے نحر کر دے، اللہ کی معصیت میں نذر کا پورا کرنا نہیں اور نہ ہی نذر اس مال میں ہے جس کا آدمی مالک نہ ہو ۔ ابوداؤد کہتے ہیں: یہ عورت ابوذر کی بیوی تھیں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 3317,
			"arabicnumber": 3317,
			"text": "کعب بن مالک رضی اللہ عنہ کہتے ہیں کہ میں نے عرض کیا: اللہ کے رسول! میری توبہ یہ ہے کہ میں اپنے سارے مال سے دستبردار ہو کر اسے اللہ اور اس کے رسول کے لیے صدقہ کر دوں، آپ صلی اللہ علیہ وسلم نے فرمایا: اپنا کچھ مال اپنے لیے روک لو، یہ تمہارے لیے بہتر ہے تو میں نے عرض کیا: میں اپنا خیبر کا حصہ اپنے لیے روک لیتا ہوں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 3318,
			"arabicnumber": 3318,
			"text": "کعب بن مالک رضی اللہ عنہ کہتے ہیں جب ان کی توبہ قبول ہو گئی تو انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے عرض کیا: میں اپنے مال سے دستبردار ہو جاتا ہوں، پھر آگے راوی نے اسی طرح حدیث بیان کی: «خير لك» تک۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 3319,
			"arabicnumber": 3319,
			"text": "کعب بن مالک رضی اللہ عنہ کہتے ہیں انہوں نے یا ابولبابہ رضی اللہ عنہ نے یا کسی اور نے جسے اللہ نے چاہا نبی اکرم صلی اللہ علیہ وسلم سے کہا: میری توبہ میں شامل ہے کہ میں اپنے اس گھر سے جہاں مجھ سے گناہ سرزد ہوا ہے ہجرت کر جاؤں اور اپنے سارے مال کو صدقہ کر کے اس سے دستبردار ہو جاؤں، تو آپ صلی اللہ علیہ وسلم نے فرمایا: بس ایک ثلث کا صدقہ کر دینا تمہیں کافی ہو گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 3320,
			"arabicnumber": 3320,
			"text": "زہری کہتے ہیں: مجھے ابن کعب بن مالک نے خبر دی ہے، وہ کہتے ہیں کہ یہ ابولبابہ رضی اللہ عنہ تھے پھر انہوں نے اسی مفہوم کی حدیث ذکر کی اور واقعہ ابولبابہ کا ہے۔ ابوداؤد کہتے ہیں: اسے یونس نے ابن شہاب سے اور ابن شہاب نے سائب بن ابولبابہ کے بیٹوں میں سے کسی سے روایت کیا ہے نیز اسے زبیدی نے زہری سے، زہری نے حسین بن سائب بن ابی لبابہ سے اسی کے مثل روایت کیا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 3321,
			"arabicnumber": 3321,
			"text": "کعب بن مالک رضی اللہ عنہ سے اسی قصہ میں روایت ہے، وہ کہتے ہیں میں نے عرض کیا: اللہ کے رسول! میری توبہ میں یہ شامل ہے کہ میں اللہ اور اس کے رسول کی راہ میں اپنا سارا مال صدقہ کر دوں، آپ صلی اللہ علیہ وسلم نے فرمایا: نہیں میں نے کہا: نصف صدقہ کر دوں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: نہیں میں نے کہا: ثلث صدقہ کر دوں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: ہاں میں نے کہا: تو میں اپنا خیبر کا حصہ روک لیتا ہوں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 3322,
			"arabicnumber": 3322,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو شخص غیر نامزد نذر مانے تو اس کا کفارہ قسم کا کفارہ ہے اور جو کسی گناہ کی نذر مانے تو اس کا ( بھی ) کفارہ وہی ہے جو قسم کا ہے، اور جو کوئی ایسی نذر مانے جسے پوری کرنے کی طاقت نہ رکھتا ہو تو اس کا کفارہ وہی ہے جو قسم کا کفارہ ہے، اور جو کوئی ایسی نذر مانے جسے وہ پوری کر سکتا ہو تو وہ اسے پوری کرے ۔ ابوداؤد کہتے ہیں: وکیع وغیرہ نے اس حدیث کو عبداللہ بن سعید ( بن ابوہند ) سے ابن عباس رضی اللہ عنہما پر موقوفاً روایت کیا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 3323,
			"arabicnumber": 3323,
			"text": "عقبہ بن عامر رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: نذر کا کفارہ قسم کا کفارہ ہے ۔ ابوداؤد کہتے ہیں: اسے عمرو بن حارث نے کعب بن علقمہ سے انہوں نے ابن شماسہ سے اور ابن شہاب نے عقبہ سے روایت کیا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 3324,
			"arabicnumber": 3324,
			"text": "اس سند سے بھی عقبہ بن عامر رضی اللہ عنہ سے اسی کے مثل مرفوعاً مروی ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 3325,
			"arabicnumber": 3325,
			"text": "عمر رضی اللہ عنہ کہتے ہیں کہ انہوں نے عرض کیا: اللہ کے رسول! میں نے زمانہ جاہلیت میں مسجد الحرام میں ایک رات کے اعتکاف کی نذر مانی تھی تو آپ صلی اللہ علیہ وسلم نے ان سے فرمایا: اپنی نذر پوری کر لو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 84
			}
		}
	]
}