{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"27": "Drinks (Kitab Al-Ashribah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3669,
			"arabicnumber": 3669,
			"text": "عمر رضی اللہ عنہ کہتے ہیں کہ شراب کی حرمت نازل ہوئی تو اس وقت شراب پانچ چیزوں: انگور، کھجور، شہد، گیہوں اور جو سے بنتی تھی، اور شراب وہ ہے جو عقل کو ڈھانپ لے، اور تین باتیں ایسی ہیں کہ میری خواہش تھی کہ رسول اللہ صلی اللہ علیہ وسلم ہم سے جدا نہ ہوں جب تک کہ آپ انہیں ہم سے اچھی طرح بیان نہ کر دیں: ایک دادا کا حصہ، دوسرے کلالہ کا معاملہ اور تیسرے سود کے کچھ مسائل۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3670,
			"arabicnumber": 3670,
			"text": "عمر بن خطاب رضی اللہ عنہ کہتے ہیں جب شراب کی حرمت نازل ہوئی تو انہوں نے دعا کی: اے اللہ! شراب کے سلسلے میں ہمیں واضح حکم فرما جس سے تشفی ہو جائے تو سورۃ البقرہ کی یہ آیت اتری: «يسألونك عن الخمر والميسر قل فيهما إثم كبير» یعنی لوگ آپ سے شراب اور جوئے کے متعلق پوچھتے ہیں تو آپ کہہ دیجئیے ان میں بڑے گناہ ہیں ( سورة البقرہ: ۲۱۹ ) ۔ راوی کہتے ہیں: تو عمر رضی اللہ عنہ بلائے گئے اور یہ آیت انہیں پڑھ کر سنائی گئی تو انہوں نے پھر دعا کی: اے اللہ! ہمارے لیے شراب کے سلسلے میں صاف اور واضح حکم نازل فرما جس سے تشفی ہو سکے، تو سورۃ نساء کی یہ آیت نازل ہوئی: «يا أيها الذين آمنوا لا تقربوا الصلاة وأنتم سكارى» یعنی اے ایمان والو! نشے کی حالت میں نماز کے قریب مت جاؤ ( سورة النساء: ۴۳ ) چنانچہ رسول اللہ صلی اللہ علیہ وسلم کا منادی جب اقامت کہہ دی جاتی تو آواز لگاتا: خبردار کوئی نشے کی حالت میں نماز کے قریب نہ آئے، پھر عمر رضی اللہ عنہ کو بلا کر یہ آیت انہیں پڑھ کر سنائی گئی تو عمر رضی اللہ عنہ نے پھر دعا کی: اے اللہ! شراب کے سلسلے میں کوئی واضح اور صاف حکم نازل فرما، تو یہ آیت نازل ہوئی:«فهل أنتم منتهون» یعنی کیا اب باز آ جاؤ گے ( سورة المائدہ: ۹۱ ) عمر رضی اللہ عنہ نے کہا: ہم باز آ گئے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3671,
			"arabicnumber": 3671,
			"text": "علی بن ابی طالب رضی اللہ عنہ کہتے ہیں کہ انہیں اور عبدالرحمٰن بن عوف رضی اللہ عنہ کو ایک انصاری نے بلایا اور انہیں شراب پلائی اس وقت تک شراب حرام نہیں ہوئی تھی پھر علی رضی اللہ عنہ نے مغرب پڑھائی اور سورۃ «قل يا أيها الكافرون» کی تلاوت کی اور اس میں کچھ گڈ مڈ کر دیا تو آیت: «لا تقربوا الصلاة وأنتم سكارى حتى تعلموا ما تقولون» نشے کی حالت میں نماز کے قریب تک مت جاؤ یہاں تک کہ تم سمجھنے لگو جو تم پڑھو نازل ہوئی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3672,
			"arabicnumber": 3672,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ «يا أيها الذين آمنوا لا تقربوا الصلاة وأنتم سكارى» ( سورة النساء: ۴۳ ) اور «يسألونك عن الخمر والميسر قل فيهما إثم كبير ومنافع للناس» ( سورة البقرہ: ۲۱۹ ) ان دونوں آیتوں کو سورۃ المائدہ کی آیت «إنما الخمر والميسر والأنصاب» ( سورة المائدة: ۹۰ ) نے منسوخ کر دیا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3673,
			"arabicnumber": 3673,
			"text": "انس رضی اللہ عنہ کہتے ہیں کہ شراب کی حرمت کے وقت میں ابوطلحہ رضی اللہ عنہ کے گھر لوگوں کو شراب پلا رہا تھا، ہماری شراب اس روز کھجور ہی سے تیار کی گئی تھی، اتنے میں ایک شخص ہمارے پاس آیا اور اس نے کہا کہ شراب حرام کر دی گئی، رسول اللہ صلی اللہ علیہ وسلم کے منادی نے بھی آواز لگائی تو ہم نے کہا: یہ رسول اللہ صلی اللہ علیہ وسلم کا منادی ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 3674,
			"arabicnumber": 3674,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کو کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: شراب کے پینے اور پلانے والے، اس کے بیچنے اور خریدنے والے، اس کے نچوڑنے اور نچوڑوانے والے، اسے لے جانے والے اور جس کے لیے لے جائی جائے سب پر اللہ کی لعنت ہو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3675,
			"arabicnumber": 3675,
			"text": "انس بن مالک رضی اللہ عنہ سے روایت ہے کہ ابوطلحہ نے رسول اللہ صلی اللہ علیہ وسلم سے ان یتیموں کے سلسلے میں پوچھا جنہوں نے میراث میں شراب پائی تھی آپ صلی اللہ علیہ وسلم نے فرمایا: اسے بہا دو ابوطلحہ رضی اللہ عنہ نے عرض کیا: کیا میں اس کا سرکہ نہ بنا لوں آپ صلی اللہ علیہ وسلم نے فرمایا: نہیں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3676,
			"arabicnumber": 3676,
			"text": "نعمان بن بشیر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: شراب انگور کی بھی ہوتی ہے، کھجور کی بھی، شہد کی بھی ہوتی ہے، گیہوں کی بھی ہوتی ہے، اور جو کی بھی ہوتی ہے ۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3677,
			"arabicnumber": 3677,
			"text": "نعمان بن بشیر رضی اللہ عنہما کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو کہتے ہوئے سنا: شراب انگور کے رس، کشمش، کھجور، گیہوں، جو اور مکئی سے بنتی ہے، اور میں تمہیں ہر نشہ آور چیز سے منع کرتا ہوں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3678,
			"arabicnumber": 3678,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: شراب ان دو درختوں کھجور اور انگور سے بنتی ہے ۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3679,
			"arabicnumber": 3679,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ہر نشہ آور چیز شراب ہے، اور ہر نشہ آور چیز حرام ہے ۱؎، اور جو مر گیا اور وہ شراب پیتا تھا اور اس کا عادی تھا تو وہ آخرت میں اسے نہیں پئے گا ( یعنی جنت کی شراب سے محروم رہے گا ) ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3680,
			"arabicnumber": 3680,
			"text": "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ہر نشہ آور چیز شراب ہے اور ہر نشہ آور چیز حرام ہے، اور جس نے کوئی نشہ آور چیز استعمال کی تو اس کی چالیس روز کی نماز کم کر دی جائے گی، اگر اس نے اللہ سے توبہ کر لی تو اللہ اسے معاف کر دے گا اور اگر چوتھی بار پھر اس نے پی تو اللہ کے لیے یہ روا ہو جاتا ہے کہ اسے «طینہ الخبال» پلائے عرض کیا گیا: «طینہ الخبال» کیا ہے؟ اللہ کے رسول! آپ نے فرمایا: جہنمیوں کی پیپ ہے، اور جس شخص نے کسی کمسن لڑکے کو جسے حلال و حرام کی تمیز نہ ہو شراب پلائی تو اللہ تعالیٰ اسے ضرور جہنمیوں کی پیپ پلائے گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3681,
			"arabicnumber": 3681,
			"text": "جابر بن عبداللہ رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس چیز کی زیادہ مقدار نشہ آور ہو اس کی تھوڑی مقدار بھی حرام ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3682,
			"arabicnumber": 3682,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم سے شہد کی شراب کا حکم پوچھا گیا تو آپ نے فرمایا: ہر شراب جو نشہ آور ہو حرام ہے ۔ ابوداؤد کہتے ہیں: میں نے یزید بن عبدربہ جرجسی پر اس روایت کو یوں پڑھا: آپ سے محمد بن حرب نے بیان کیا انہوں نے زبیدی سے اور زبیدی نے زہری سے یہی حدیث اسی سند سے روایت کی، اس میں اتنا اضافہ ہے کہ بتع شہد کی شراب کو کہتے ہیں، اہل یمن اسے پیتے تھے ۔ ابوداؤد کہتے ہیں: میں نے احمد بن حنبل کو کہتے ہوئے سنا: «لا إله إلا الله» جرجسی کیا ہی معتبر شخص تھا، اہل حمص میں اس کی نظیر نہیں تھی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3683,
			"arabicnumber": 3683,
			"text": "دیلم حمیری رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے دریافت کیا: اللہ کے رسول! ہم لوگ سرد علاقے میں رہتے ہیں اور سخت محنت و مشقت کے کام کرتے ہیں، ہم لوگ اس گیہوں سے شراب بنا کر اس سے اپنے کاموں کے لیے طاقت حاصل کرتے ہیں اور اپنے ملک کی سردیوں سے اپنا بچاؤ کرتے ہیں، آپ صلی اللہ علیہ وسلم نے فرمایا: کیا وہ نشہ آور ہوتا ہے؟ میں نے عرض کیا: ہاں آپ صلی اللہ علیہ وسلم نے فرمایا: پھر تو اس سے بچو ۔ راوی کہتے ہیں: میں نے عرض کیا: لوگ اسے نہیں چھوڑ سکتے، آپ نے فرمایا: اگر وہ اسے نہ چھوڑیں تو تم ان سے لڑائی کرو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3684,
			"arabicnumber": 3684,
			"text": "ابوموسیٰ رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے شہد کی شراب کے متعلق پوچھا تو آپ نے فرمایا: وہ بتع ہے میں نے کہا: جو اور مکئی سے بھی شراب بنائی جاتی ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: وہ مزر ہے پھر آپ نے فرمایا: اپنی قوم کو بتا دو کہ ہر نشہ آور چیز حرام ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 3685,
			"arabicnumber": 3685,
			"text": "عبداللہ بن عمرو رضی اللہ عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے شراب، جوا، کوبہ ( چوسر یا ڈھولک ) اور غبیراء سے منع کیا، اور فرمایا: ہر نشہ آور چیز حرام ہے ۔ ابوداؤد کہتے ہیں: ابن سلام ابو عبید نے کہا ہے: غبیراء ایسی شراب ہے جو مکئی سے بنائی جاتی ہے حبشہ کے لوگ اسے بناتے ہیں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 3686,
			"arabicnumber": 3686,
			"text": "ام المؤمنین ام سلمہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ہر نشہ آور چیز اور ہر «مفتر» ( فتور پیدا کرنے اور سستی لانے والی ) چیز سے منع فرمایا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 3687,
			"arabicnumber": 3687,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا: ہر نشہ آور چیز حرام ہے اور جو چیز فرق ۱؎ بھر نشہ لاتی ہے اس کا ایک چلو بھی حرام ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 3688,
			"arabicnumber": 3688,
			"text": "مالک بن ابی مریم کہتے ہیں کہ عبدالرحمٰن بن غنم ہمارے پاس آئے تو ہم نے ان سے طلاء ۱؎ کا ذکر کیا، انہوں نے کہا: مجھ سے ابو مالک اشعری رضی اللہ عنہ نے بیان کیا کہ انہوں نے نبی اکرم صلی اللہ علیہ وسلم کو فرماتے سنا: میری امت کے کچھ لوگ شراب پئیں گے لیکن اس کا نام شراب کے علاوہ کچھ اور رکھ لیں گے ۲؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 3689,
			"arabicnumber": 3689,
			"text": "حارث بن منصور کہتے ہیں میں نے سفیان ثوری سے سنا ان سے «داذی» ۱؎ کے متعلق پوچھا گیا تو انہوں نے کہا: رسول اللہ نے فرمایا ہے: میری امت کے بعض لوگ شراب پئیں گے لیکن اسے دوسرے نام سے موسوم کریں گے ۔ ابوداؤد کہتے ہیں: سفیان ثوری کا کہنا ہے:«داذی» فاسقوں کی شراب ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 3690,
			"arabicnumber": 3690,
			"text": "ابن عمر اور ابن عباس کہتے ہیں کہ ہم گواہی دیتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے تمبی، سبز رنگ کے برتن، تارکول ملے ہوئے برتن اور لکڑی کے برتن ۱؎ سے منع فرمایا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 3691,
			"arabicnumber": 3691,
			"text": "سعید بن جبیر کہتے ہیں میں نے عبداللہ بن عمر رضی اللہ عنہما کو کہتے سنا کہ رسول اللہ صلی اللہ علیہ وسلم نے «جر» ( مٹی کا گھڑا ) میں بنائی ہوئی نبیذ کو حرام قرار دیا ہے تو میں ان کی یہ بات سن کر گھبرایا ہوا نکلا اور ابن عباس رضی اللہ عنہما کے پاس آ کر کہا: کیا آپ نے سنا نہیں ابن عمر رضی اللہ عنہما کیا کہتے ہیں؟ ابن عباس رضی اللہ عنہما نے کہا: کیا بات ہے؟ میں نے کہا: وہ یہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے «جر» کے نبیذ کو حرام قرار دیا ہے، انہوں نے کہا: وہ سچ کہتے ہیں، رسول اللہ صلی اللہ علیہ وسلم نے «جر» کے نبیذ کو حرام قرار دیا ہے، میں نے کہا: «جر» کیا ہے؟ فرمایا: ہر وہ چیز ہے جو مٹی سے بنائی جاتی ہو۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 3692,
			"arabicnumber": 3692,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں رسول اللہ صلی اللہ علیہ وسلم کے پاس عبدالقیس کا وفد آیا اور اس نے عرض کیا: اللہ کے رسول! ہم لوگ بنو ربیعہ کا ایک قبیلہ ہیں، ہمارے اور آپ کے درمیان مضر کے کفار حائل ہیں، ہم آپ تک حرمت والے مہینوں ۱؎ ہی میں پہنچ سکتے ہیں، اس لیے آپ ہمیں کچھ ایسی چیزوں کا حکم دے دیجئیے کہ جن پر ہم خود عمل کرتے رہیں اور ان لوگوں کو بھی ان پر عمل کے لیے کہیں جو اس وفد کے ساتھ نہیں آئے ہیں، آپ صلی اللہ علیہ وسلم نے فرمایا: میں تمہیں چار باتوں کا حکم دیتا ہوں، اور چار چیزوں سے منع کرتا ہوں ( جن کا حکم دیتا ہوں وہ یہ ہیں ) اللہ پر ایمان لانا اور اس بات کی گواہی دینی کہ اللہ کے سوا کوئی عبادت کے لائق نہیں ( اور آپ صلی اللہ علیہ وسلم نے ہاتھ سے ایک کی گرہ بنائی، مسدد کہتے ہیں: آپ نے اللہ پر ایمان لانا، فرمایا، پھر اس کی تفسیر کی کہ اس کا مطلب ) اس بات کی گواہی دینا ہے کہ اللہ کے سوا کوئی بندگی کے لائق نہیں اور محمد اللہ کے رسول ہیں، اور نماز قائم کرنا، زکاۃ ادا کرنا، اور مال غنیمت سے پانچواں حصہ دینا ہے، اور میں تمہیں دباء، حنتم، مزفت اور مقیر سے منع کرتا ہوں ۔ ابن عبید نے لفظ مقیر کے بجائے نقیر اور مسدد نے نقیر اور مقیر کہا، اور مزفت کا ذکر نہیں کیا۔ ابوداؤد کہتے ہیں: ابوجمرہ کا نام نصر بن عمران ضبعی ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 3693,
			"arabicnumber": 3693,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے وفد عبدالقیس سے فرمایا: میں تمہیں لکڑی کے برتن، تار کول ملے ہوئے برتن، سبز لاکھی گھڑے، تمبی اور کٹے ہوئے چمڑے کے برتن سے منع کرتا ہوں لیکن تم اپنے چمڑے کے برتن سے پیا کرو اور اس کا منہ باندھ کر رکھو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 3694,
			"arabicnumber": 3694,
			"text": "عبداللہ بن عباس رضی اللہ عنہما سے وفد عبدالقیس کے واقعے کے سلسلے میں روایت ہے کہ وفد کے لوگوں نے پوچھا: ہم کس چیز میں پیئں اللہ کے نبی؟ تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: تم ان مشکیزوں کو لازم پکڑو جن کے منہ باندھ کر رکھے جاتے ہوں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 3695,
			"arabicnumber": 3695,
			"text": "ابوالقموص زید بن علی سے روایت ہے، کہتے ہیں مجھ سے عبدالقیس کے اس وفد میں سے جو نبی اکرم صلی اللہ علیہ وسلم کے پاس آیا تھا ایک شخص نے بیان کیا ( عوف کا خیال ہے کہ اس کا نام قیس بن نعمان تھا ) کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تم لوگ نقیر، مزفت، دباء، اور حنتم میں مت پیو، بلکہ مشکیزوں سے پیو جس پر ڈاٹ لگا ہو، اور اگر نبیذ میں تیزی آ جائے تو پانی ڈال کر اس کی تیزی توڑ دو اگر اس کے باوجود بھی تیزی نہ جائے تو اسے بہا دو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 3696,
			"arabicnumber": 3696,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں وفد عبدالقیس نے عرض کیا: اللہ کے رسول! ہم کس برتن میں پیئیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: دباء، مزفت اور نقیر میں مت پیو، اور تم نبیذ مشکیزوں میں بنایا کرو انہوں نے کہا: اللہ کے رسول اگر مشکیزے میں تیزی آ جائے تو؟ آپ صلی اللہ علیہ وسلم نے فرمایا: اس میں پانی ڈال دیا کرو وفد کے لوگوں نے کہا: اللہ کے رسول! ( اگر پھر بھی تیزی نہ جائے تو ) آپ نے ان سے تیسری یا چوتھی مرتبہ فرمایا: اسے بہا دو ۱؎ پھر آپ صلی اللہ علیہ وسلم نے فرمایا: بیشک اللہ تعالیٰ نے مجھ پر شراب، جوا، اور ڈھولک کو حرام قرار دیا ہے یا یوں کہا: شراب، جوا، اور ڈھول ۲؎ حرام قرار دے دی گئی ہے اور ہر نشہ آور چیز حرام ہے ۔ سفیان کہتے ہیں: میں نے علی بن بذیمہ سے کوبہ کے بارے میں پوچھا تو انہوں نے کہا: وہ ڈھول ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 3697,
			"arabicnumber": 3697,
			"text": "علی رضی اللہ عنہ کہتے ہیں رسول اللہ صلی اللہ علیہ وسلم نے ہمیں تونبی، سبز رنگ کے برتن، لکڑی کے برتن اور جو کی شراب سے منع فرمایا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 3698,
			"arabicnumber": 3698,
			"text": "بریدہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: میں نے تمہیں تین چیزوں سے روک دیا تھا، اب میں تمہیں ان کا حکم دیتا ہوں: میں نے تمہیں قبروں کی زیارت سے روکا تھا اب تم ان کی زیارت کرو کیونکہ یہ آخرت کو یاد دلاتی ہے ۱؎ اور میں نے تمہیں چمڑے کے علاوہ برتنوں میں پینے سے منع کیا تھا، لیکن اب تم ہر برتن میں پیو، البتہ کوئی نشہ آور چیز نہ پیو، اور میں نے تمہیں تین روز کے بعد قربانی کے گوشت کھانے سے منع کر دیا تھا، لیکن اب اسے بھی ( جب تک چاہو ) کھاؤ اور اپنے سفروں میں اس سے فائدہ اٹھاؤ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 3699,
			"arabicnumber": 3699,
			"text": "جابر بن عبداللہ رضی اللہ عنہما کہتے ہیں کہ جب رسول اللہ صلی اللہ علیہ وسلم نے برتنوں کے استعمال سے منع فرمایا تو انصار کے لوگوں نے آپ سے عرض کیا: وہ تو ہمارے لیے بہت ضروری ہیں، آپ صلی اللہ علیہ وسلم نے فرمایا: تب ممانعت نہیں رہی ( تمہیں ان کی اجازت ہے ) ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 3700,
			"arabicnumber": 3700,
			"text": "عبداللہ بن عمرو رضی اللہ عنہما کہتے ہیں رسول اللہ صلی اللہ علیہ وسلم نے دباء، حنتم، مزفت، اور نقیر کے برتنوں کا ذکر کیا ۱؎ تو ایک دیہاتی نے عرض کیا: ہمارے پاس تو اور کوئی برتن ہی نہیں رہا، تو آپ صلی اللہ علیہ وسلم نے فرمایا: اچھا جو حلال ہوا سے پیو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 3701,
			"arabicnumber": 3701,
			"text": "شریک سے اسی سند سے روایت ہے کہ آپ صلی اللہ علیہ وسلم نے فرمایا: نشہ آور چیز سے بچو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 3702,
			"arabicnumber": 3702,
			"text": "جابر بن عبداللہ رضی اللہ عنہما کہتے ہیں رسول اللہ صلی اللہ علیہ وسلم کے لیے چمڑے کے برتن میں نبیذ تیار کی جاتی تھی اور اگر وہ چمڑے کا برتن نہیں پاتے تو پتھر کے برتن میں آپ صلی اللہ علیہ وسلم کے لیے نبیذ تیار کی جاتی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 3703,
			"arabicnumber": 3703,
			"text": "جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے کشمش اور کھجور کو ایک ساتھ ملا کر نبیذ بنانے سے منع فرمایا، نیز کچی اور پکی کھجور ملا کر نبیذ بنا نے سے منع فرمایا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 3704,
			"arabicnumber": 3704,
			"text": "ابوقتادہ رضی اللہ عنہ سے روایت ہے کہ انہوں نے کشمش اور کھجور ملا کر اور پکی اور کچی کھجور ملا کر اور اسی طرح ایسی کھجور جس میں سرخی یا زردی ظاہر ہونے لگی ہو اور تازی پکی کھجور کو ملا کر نبیذ بنانے سے منع کیا، اور آپ نے فرمایا: ہر ایک کی الگ الگ نبیذ بناؤ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 3705,
			"arabicnumber": 3705,
			"text": "ایک صحابی رسول رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے کچی کھجور کو پکی ہوئی کھجور کے ساتھ اور کشمش کو کھجور کے ساتھ ملا کر نبیذ بنانے سے منع فرمایا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 3706,
			"arabicnumber": 3706,
			"text": "کبشہ بنت ابی مریم کہتی ہیں کہ میں نے ام المؤمنین ام سلمہ رضی اللہ عنہا سے ان چیزوں کے متعلق پوچھا جن سے نبی اکرم صلی اللہ علیہ وسلم منع کرتے تھے، تو انہوں نے کہا: آپ صلی اللہ علیہ وسلم ہمیں کھجور کو زیادہ پکانے سے جس سے اس کی گٹھلی ضائع ہو جائے، اور کشمش کے ساتھ کھجور ملا کر نبیذ بنانے سے منع کرتے تھے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 3707,
			"arabicnumber": 3707,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں رسول اللہ صلی اللہ علیہ وسلم کے لیے کشمکش کی نبیذ بنائی جاتی تو اس میں کھجور ڈال دی جاتی اور جب کھجور کی نبیذ بنائی جاتی تو اس میں انگور ڈال دیا جاتا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 3708,
			"arabicnumber": 3708,
			"text": "صفیہ بنت عطیہ کہتی ہیں میں عبدالقیس کی چند عورتوں کے ساتھ ام المؤمنین عائشہ رضی اللہ عنہا کے پاس گئی، اور ہم نے آپ سے کھجور اور کشمش ملا کر ( نبیذ تیار کرنے کے سلسلے میں ) پوچھا، آپ نے کہا: میں ایک مٹھی کھجور اور ایک مٹھی کشمش لیتی اور اسے ایک برتن میں ڈال دیتی، پھر اس کو ہاتھ سے مل دیتی پھر اسے نبی اکرم صلی اللہ علیہ وسلم کو پلاتی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 3709,
			"arabicnumber": 3709,
			"text": "جابر بن زید اور عکرمہ سے روایت ہے کہ وہ دونوں صرف کچی کھجور کی نبیذ کو مکروہ جانتے تھے، اور اس مذہب کو ابن عباس رضی اللہ عنہما سے لیتے تھے۔ ابن عباس رضی اللہ عنہما کہتے ہیں: میں ڈرتا ہوں کہیں یہ «مزاء» نہ ہو جس سے عبدالقیس کو منع کیا گیا تھا ہشام کہتے ہیں: میں نے قتادہ سے کہا: «مزاء» کیا ہے؟ انہوں نے کہا: حنتم اور مزفت میں تیار کی گئی نبیذ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 3710,
			"arabicnumber": 3710,
			"text": "دیلمی رضی اللہ عنہ کہتے ہیں ہم رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے اور ہم نے عرض کیا: اللہ کے رسول! آپ کو معلوم ہے کہ ہم کون ہیں اور کہاں سے آئے ہیں، لیکن کس کے پاس آئے ہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: اللہ اور اس کے رسول کے پاس پھر ہم نے عرض کیا: اے رسول اللہ! ہمارے یہاں انگور ہوتا ہے ہم اس کا کیا کریں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: اسے خشک لو ہم نے عرض کیا: اس زبیب ( سوکھے ہوئے انگور ) کو کیا کریں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: صبح کو اسے بھگو دو، اور شام کو پی لو، اور جو شام کو بھگوؤ اسے صبح کو پی لو اور چمڑوں کے برتنوں میں اسے بھگویا کرو، مٹکوں اور گھڑوں میں نہیں کیونکہ اگر نچوڑنے میں دیر ہو گی تو وہ سرکہ ہو جائے گا ۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 3711,
			"arabicnumber": 3711,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں رسول اللہ صلی اللہ علیہ وسلم کے لیے ایک ایسے چمڑے کے برتن میں نبیذ تیار کی جاتی تھی جس کا اوپری حصہ باندھ دیا جاتا، اور اس کے نیچے کی طرف بھی منہ ہوتا، صبح میں نبیذ بنائی جاتی تو اسے شام میں پیتے اور شام میں نبیذ بنائی جاتی تو اسے صبح میں پیتے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 3712,
			"arabicnumber": 3712,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا فرماتی ہیں کہ وہ نبی اکرم صلی اللہ علیہ وسلم کے لیے صبح کو نبیذ بھگوتی تھیں تو جب شام کا وقت ہوتا تو آپ شام کا کھانا کھانے کے بعد اسے پیتے، اور اگر کچھ بچ جاتی تو میں اسے پھینک دیتی یا اسے خالی کر دیتی، پھر آپ کے لیے رات میں نبیذ بھگوتی اور صبح ہوتی تو آپ اسے دن کا کھانا تناول فرما کر پیتے۔ وہ کہتی ہیں: مشک کو صبح و شام دھویا جاتا تھا۔ مقاتل کہتے ہیں: میرے والد ( حیان ) نے ان سے کہا: ایک دن میں دو بار؟ وہ بولیں: ہاں دو بار۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 3713,
			"arabicnumber": 3713,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں نبی اکرم صلی اللہ علیہ وسلم کے لیے کشمش کی نبیذ تیار کی جاتی تو آپ اس دن پیتے، دوسرے دن پیتے اور تیسرے دن کی شام تک پیتے پھر حکم فرماتے تو جو بچا ہوتا اسے خدمت گزاروں کو پلا دیا جاتا یا بہا دیا جاتا۔ ابوداؤد کہتے ہیں: خادموں کو پلانے کا مطلب یہ ہے کہ خراب ہونے سے پہلے پہلے انہیں پلا دیا جاتا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 3714,
			"arabicnumber": 3714,
			"text": "عبید بن عمیر کہتے ہیں میں نے ام المؤمنین عائشہ رضی اللہ عنہا سے سنا وہ خبر دے رہی تھیں کہ نبی اکرم صلی اللہ علیہ وسلم زینب بنت حجش رضی اللہ عنہا کے پاس ٹھہرتے اور شہد پیتے تھے تو ایک روز میں نے اور حفصہ رضی اللہ عنہما نے مشورہ کیا کہ ہم میں سے جس کے پاس آپ صلی اللہ علیہ وسلم تشریف لائیں وہ کہے: مجھے آپ سے مغافیر ۱؎ کی بو محسوس ہو رہی ہے، چنانچہ آپ صلی اللہ علیہ وسلم ان میں سے ایک کے پاس تشریف لائے، تو اس نے آپ سے ویسے ہی کہا، آپ صلی اللہ علیہ وسلم نے فرمایا: نہیں، بلکہ میں نے تو زینب بنت جحش کے پاس شہد پیا ہے اور اب دوبارہ ہرگز نہیں پیوں گا تو قرآن کریم کی آیت: «لم تحرم ما أحل الله لك تبتغي» ۲؎ سے لے کر «إن تتوبا إلى الله» ۳؎ تک عائشہ اور حفصہ رضی اللہ عنہما کے متعلق نازل ہوئی۔ «إن تتوبا» میں خطاب عائشہ اور حفصہ رضی اللہ عنہما کو ہے اور «وإذ أسر النبي إلى بعض أزواجه حديثا» میں «حديثا» سے مراد آپ کا: «بل شربت عسلا» ( بلکہ میں نے شہد پیا ہے ) کہنا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 3715,
			"arabicnumber": 3715,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم میٹھی چیزیں اور شہد پسند کرتے تھے، اور پھر انہوں نے اسی حدیث کا کچھ حصہ ذکر کیا اور کہا کہ رسول اللہ صلی اللہ علیہ وسلم کو یہ بہت ناگوار لگتا کہ آپ سے کسی قسم کی بو محسوس کی جائے اور اس حدیث میں یہ ہے کہ سودہ ۱؎ نے کہا: بلکہ آپ نے مغافیر کھائی ہے آپ صلی اللہ علیہ وسلم نے فرمایا: نہیں، بلکہ میں نے شہد پیا ہے، جسے حفصہ نے مجھے پلایا ہے تو میں نے کہا: شاید اس کی مکھی نے عرفط ۲؎ چاٹا ہو۔ ابوداؤد کہتے ہیں: مغافیر: مقلہ ہے اور وہ گوند ہے، اور جرست: کے معنی چاٹنے کے ہیں، اور عرفط شہد کی مکھی کے پودوں میں سے ایک پودا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 3716,
			"arabicnumber": 3716,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں مجھے معلوم تھا کہ رسول اللہ صلی اللہ علیہ وسلم روزے رکھا کرتے ہیں تو میں اس نبیذ کے لیے جو میں نے ایک تمبی میں بنائی تھی آپ کے روزہ نہ رکھنے کا انتظار کرتا رہا پھر میں اسے لے کر آپ صلی اللہ علیہ وسلم کے پاس آیا وہ جوش مار رہی تھی، آپ صلی اللہ علیہ وسلم نے فرمایا: اسے اس دیوار پر مار دو یہ تو اس شخص کا مشروب ہے جو اللہ اور آخرت کے دن پر ایمان نہیں رکھتا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 3717,
			"arabicnumber": 3717,
			"text": "انس رضی اللہ عنہ کہتے ہیں رسول صلی اللہ علیہ وسلم نے منع فرمایا ہے کہ آدمی کھڑے ہو کر کچھ پیئے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 3718,
			"arabicnumber": 3718,
			"text": "نزال بن سبرہ رضی اللہ عنہ کہتے ہیں کہ علی رضی اللہ عنہ نے پانی منگوایا اور اسے کھڑے ہو کر پیا اور کہا: بعض لوگ ایسا کرنے کو مکروہ اور ناپسند سمجھتے ہیں حالانکہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو ایسے ہی کرتے دیکھا ہے جیسے تم لوگوں نے مجھے کرتے دیکھا ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 3719,
			"arabicnumber": 3719,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے مشکیزے میں منہ لگا کر پینے سے، نجاست کھانے والے جانور کی سواری سے اور جس پرندہ کو باندھ کر تیر وغیرہ سے نشانہ لگا کر مارا گیا ہو اسے کھانے سے منع فرمایا۔ ابوداؤد کہتے ہیں: «جلّالہ» وہ جانور ہے جو نجاست کھاتا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 3720,
			"arabicnumber": 3720,
			"text": "ابوسعید خدری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے مشکیزوں کا منہ موڑ کر پینے سے منع فرمایا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 3721,
			"arabicnumber": 3721,
			"text": "عبداللہ انصاری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے احد کے دن ایک مشکیزہ منگوایا اور فرمایا: مشکیزے کا منہ موڑو پھر آپ صلی اللہ علیہ وسلم نے اس کے منہ سے پیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Munqar"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 3722,
			"arabicnumber": 3722,
			"text": "ابو سعید خدری رضی اللہ عنہ کہتے ہیں رسول اللہ صلی اللہ علیہ وسلم نے پیالہ کی ٹوٹی ہوئی جگہ سے پینے، اور پینے کی چیزوں میں پھونک مارنے سے منع فرمایا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 3723,
			"arabicnumber": 3723,
			"text": "ابن ابی لیلیٰ کہتے ہیں کہ حذیفہ رضی اللہ عنہ مدائن میں تھے، آپ نے پانی طلب کیا تو ایک زمیندار چاندی کے برتن میں پانی لے کر آیا تو آپ نے اسے اسی پر پھینک دیا، اور کہا: میں نے اسے اس پر صرف اس لیے پھینکا ہے کہ میں اسے منع کر چکا ہوں لیکن یہ اس سے باز نہیں آیا، حالانکہ رسول اللہ صلی اللہ علیہ وسلم نے ریشم اور دیبا پہننے سے اور سونے، چاندی کے برتن میں پینے سے منع کیا ہے، اور فرمایا ہے: یہ ان ( کافروں ) کے لیے دنیا میں ہیں اور تمہارے لیے آخرت میں ہیں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 3724,
			"arabicnumber": 3724,
			"text": "جابر بن عبداللہ رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم اور آپ کے اصحاب میں سے ایک شخص ایک انصاری کے پاس آئے وہ اپنے باغ کو پانی دے رہا تھا، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اگر تمہارے پاس مشکیزہ میں رات کا باسی پانی ہو تو بہتر ہے، ورنہ ہم منہ لگا کر نہر ہی سے پانی پی لیتے ہیں اس نے کہا: نہیں بلکہ میرے پاس مشکیزہ میں رات کا باسی پانی موجود ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 3725,
			"arabicnumber": 3725,
			"text": "عبداللہ بن ابی اوفی رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: قوم کے ساقی کو سب سے اخیر میں پینا چاہیئے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 3726,
			"arabicnumber": 3726,
			"text": "انس بن مالک رضی اللہ عنہ کہتے ہیں نبی اکرم صلی اللہ علیہ وسلم کے پاس دودھ لایا گیا جس میں پانی ملایا گیا تھا، آپ کے دائیں ایک دیہاتی اور بائیں ابوبکر بیٹھے ہوئے تھے، آپ صلی اللہ علیہ وسلم نے دودھ نوش فرمایا پھر دیہاتی کو ( پیالہ ) دے دیا اور فرمایا: دائیں طرف والا زیادہ حقدار ہے پھر وہ جو اس کے دائیں ہو ۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 3727,
			"arabicnumber": 3727,
			"text": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ جب نبی اکرم صلی اللہ علیہ وسلم پیتے تو تین سانس میں پیتے اور فرماتے: یہ خوب پیاس کو مارنے والا، ہاضم اور صحت بخش ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 3728,
			"arabicnumber": 3728,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے برتن میں سانس لینے یا پھونک مارنے سے منع فرمایا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 3729,
			"arabicnumber": 3729,
			"text": "عبداللہ بن بسر جو بنی سلیم سے تعلق رکھتے ہیں کہتے ہیں رسول اللہ صلی اللہ علیہ وسلم میرے والد کے پاس تشریف لائے اور ان کے پاس قیام کیا تو انہوں نے آپ صلی اللہ علیہ وسلم کی خدمت میں کھانا پیش کیا، پھر انہوں نے حیس ۱؎ کا ذکر کیا جسے وہ آپ صلی اللہ علیہ وسلم کے پاس لے کر آئے پھر وہ آپ کے پاس پانی لائے تو آپ صلی اللہ علیہ وسلم نے پیا پھر جو آپ کے داہنے تھا اسے دیدیا، آپ صلی اللہ علیہ وسلم نے کھجوریں کھائیں اور ان کی گٹھلیاں درمیانی اور شہادت والی انگلیوں کی پشت پر رکھ کر پھینکنے لگے، جب آپ صلی اللہ علیہ وسلم کھڑے ہوئے تو میرے والد بھی کھڑے ہوئے اور انہوں نے آپ کی سواری کی لگام پکڑ کر عرض کیا: میرے لیے اللہ سے دعا کر دیجئیے، تو آپ صلی اللہ علیہ وسلم نے فرمایا: «اللهم بارك لهم فيما رزقتهم واغفر لهم وارحمهم» اے اللہ جو روزی تو نے انہیں دی ہے اس میں برکت عطا فرما، انہیں بخش دے، اور ان پر رحم فرما ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 3730,
			"arabicnumber": 3730,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں میں ام المؤمنین میمونہ رضی اللہ عنہا کے گھر میں تھا کہ اتنے میں رسول اللہ صلی اللہ علیہ وسلم تشریف لائے، آپ صلی اللہ علیہ وسلم کے ساتھ خالد بن ولید رضی اللہ عنہ بھی تھے، لوگ دو بھنی ہوئی گوہ دو لکڑیوں پر رکھ کر لائے تو رسول اللہ صلی اللہ علیہ وسلم نے انہیں دیکھ کر تھوکا، تو خالد رضی اللہ عنہ نے عرض کیا: اللہ کے رسول! میرا خیال ہے اس سے آپ کو گھن ( کراہت ) ہو رہی ہے، آپ صلی اللہ علیہ وسلم نے فرمایا: ہاں پھر رسول اللہ صلی اللہ علیہ وسلم کے پاس دودھ لایا گیا تو آپ صلی اللہ علیہ وسلم نے اسے پیا اور فرمایا: جب تم میں سے کوئی کھانا کھائے تو اسے یہ دعا پڑھنی چاہئیے «اللهم بارك لنا فيه وأطعمنا خيرا منه» اے اللہ! تو ہمارے لیے اس میں برکت عطا فرما اور ہمیں اس سے بہتر کھانا کھلا اور آپ صلی اللہ علیہ وسلم نے فرمایا: اور جب اسے کوئی دودھ پلائے تو اسے چاہیئے کہ یہ دعا پڑھے «اللهم بارك لنا فيه وزدنا منه» اے اللہ! تو ہمارے لیے اس میں برکت عطا فرما اور اسے ہمیں اور دے کیونکہ دودھ کے علاوہ کوئی ایسی چیز نہیں جو کھانے اور پینے دونوں سے کفایت کرے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 3731,
			"arabicnumber": 3731,
			"text": "جابر رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: اللہ کا نام لے کر اپنے دروازے بند کرو کیونکہ شیطان بند دروازوں کو نہیں کھولتا، اللہ کا نام لے کر اپنے چراغ بجھاؤ، اللہ کا نام لے کر اپنے برتنوں کو ڈھانپو خواہ کسی لکڑی ہی سے ہو جسے تم اس پر چوڑائی میں رکھ دو، اور اللہ کا نام لے کر مشکیزے کا منہ باندھو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 3732,
			"arabicnumber": 3732,
			"text": "اس سند سے بھی جابر بن عبداللہ رضی اللہ عنہما نے نبی اکرم صلی اللہ علیہ وسلم سے یہی حدیث روایت کی ہے لیکن یہ پوری نہیں ہے، اس میں ہے کہ شیطان کسی بند دروازے کو نہیں کھولتا، نہ کسی بندھن کو کھولتا ہے اور نہ کسی برتن کے ڈھکنے کو، اور چوہیا لوگوں کا گھر جلا دیتی ہے، یا کہا ان کے گھروں کو جلا دیتی ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 3733,
			"arabicnumber": 3733,
			"text": "جابر بن عبداللہ رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: عشاء کے وقت اپنے بچوں کو اپنے پاس ہی رکھو ( اور مسدد کی روایت میں ہے: شام کے وقت اپنے بچوں کو اپنے پاس رکھو ) کیونکہ یہ جنوں کے پھیلنے اور ( بچوں کو ) اچک لینے کا وقت ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 3734,
			"arabicnumber": 3734,
			"text": "جابر رضی اللہ عنہ کہتے ہیں ہم لوگ نبی اکرم صلی اللہ علیہ وسلم کے ساتھ تھے آپ نے پانی طلب کیا تو قوم میں سے ایک شخص نے عرض کیا: کیا ہم آپ کو نبیذ نہ پلا دیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: ہاں ( کوئی مضائقہ نہیں ) تو وہ نکلا اور دوڑ کر ایک پیالہ نبیذ لے آیا، نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: تو نے اسے ڈھک کیوں نہیں لیا؟ ایک لکڑی ہی سے سہی جو اس کے عرض ( چوڑان ) میں رکھ لیتا ۔ ابوداؤد کہتے ہیں: اصمعی نے کہا: «تعرضه عليه» یعنی تو اسے اس پر چوڑان میں رکھ لیتا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 3735,
			"arabicnumber": 3735,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا فرماتی ہیں کہ نبی اکرم صلی اللہ علیہ وسلم کے لیے سقیا کے گھروں سے میٹھا پانی لایا جاتا۔ قتیبہ کہتے ہیں: سقیا ایک چشمہ ہے جس کی مسافت مدینہ سے دو دن کی ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 67
			}
		}
	]
}