{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"36": "Signet-Rings (Kitab Al-Khatam)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4214,
			"arabicnumber": 4214,
			"text": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے بعض شاہان عجم کو خط لکھنے کا ارادہ فرمایا تو آپ سے عرض کیا گیا کہ وہ ایسے خطوط کو جو بغیر مہر کے ہوں نہیں پڑھتے تو آپ صلی اللہ علیہ وسلم نے چاندی کی ایک انگوٹھی بنوائی اور اس میں «محمد رسول الله» کندہ کرایا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 4215,
			"arabicnumber": 4215,
			"text": "اس سند سے بھی انس سے عیسیٰ بن یونس کی روایت کے ہم معنی حدیث مروی ہے، اور اس میں یہ اضافہ ہے کہ پھر یہ انگوٹھی آپ صلی اللہ علیہ وسلم کی وفات تک آپ کے ہاتھ میں رہی پھر ابوبکر صدیق رضی اللہ عنہ کے ہاتھ میں رہی یہاں تک کہ ان کی وفات ہو گئی، پھر عمر رضی اللہ عنہ کے ہاتھ میں رہی یہاں تک کہ وہ بھی وفات پا گئے، پھر عثمان رضی اللہ عنہ کے ہاتھ میں رہی وہ ایک کنویں کے پاس تھے کہ اسی دوران انگوٹھی کنویں میں گر گئی، انہوں نے حکم دیا تو اس کا سارا پانی نکالا گیا لیکن وہ اسے پا نہیں سکے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 4216,
			"arabicnumber": 4216,
			"text": "انس رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم کی انگوٹھی چاندی کی تھی، اس کا نگینہ حبشی تھا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4217,
			"arabicnumber": 4217,
			"text": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم کی پوری انگوٹھی چاندی کی تھی، اس کا نگینہ بھی چاندی کا تھا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 4218,
			"arabicnumber": 4218,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے سونے کی انگوٹھی بنائی، اس کے نگینہ کو اپنی ہتھیلی کے پیٹ کی جانب رکھا اور اس میں «محمد رسول الله» کندہ کرایا، تو لوگوں نے بھی سونے کی انگوٹھیاں بنوا لیں، جب آپ نے انہیں سونے کی انگوٹھیاں پہنے دیکھا تو اسے پھینک دیا، اور فرمایا: اب میں کبھی اسے نہیں پہنوں گا پھر آپ صلی اللہ علیہ وسلم نے چاندی کی ایک انگوٹھی بنوائی جس میں «محمد رسول الله» کندہ کرایا، پھر آپ کے بعد وہی انگوٹھی ابوبکر رضی اللہ عنہ نے پہنی، پھر ابوبکر رضی اللہ عنہ کے بعد عمر رضی اللہ عنہ نے پھر ان کے بعد عثمان رضی اللہ عنہ نے پہنی یہاں تک کہ وہ بئراریس میں گر پڑی۔ ابوداؤد کہتے ہیں: عثمان سے لوگوں کا اختلاف اس وقت تک نہیں ہوا جب تک انگوٹھی ان کے ہاتھ میں رہی ( جب وہ گر گئی تو پھر اختلافات اور فتنے رونما ہونے شروع ہو گئے ) ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 4219,
			"arabicnumber": 4219,
			"text": "اس سند سے بھی ابن عمر رضی اللہ عنہما سے اس روایت میں مرفوعاً مروی ہے اس میں ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے «محمد رسول الله» کندہ کرایا، اور فرمایا: کوئی میری اس انگوٹھی کے طرز پر کندہ نہ کرائے پھر راوی نے آگے پوری حدیث بیان کی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 4220,
			"arabicnumber": 4220,
			"text": "اس سند سے بھی ابن عمر رضی اللہ عنہما سے مرفوعاً یہی حدیث مروی ہے، اس میں یہ اضافہ ہے کہ لوگوں نے اسے ڈھونڈا لیکن وہ ملی نہیں، تو عثمان رضی اللہ عنہ نے ایک دوسری انگوٹھی بنوائی، اور اس میں «محمد رسول الله» کندہ کرایا۔ راوی کہتے ہیں: وہ اسی سے مہر لگایا کرتے تھے، یا کہا: اسے پہنا کرتے تھے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 4221,
			"arabicnumber": 4221,
			"text": "انس بن مالک رضی اللہ عنہ سے روایت ہے کہ انہوں نے ایک دن رسول اللہ صلی اللہ علیہ وسلم کے ہاتھ میں چاندی کی ایک انگوٹھی دیکھی تو لوگوں نے بھی انگوٹھیاں بنوا لیں اور پہننے لگے، پھر نبی اکرم صلی اللہ علیہ وسلم نے انگوٹھی پھینک دی تو لوگوں نے بھی پھینک دی۔ ابوداؤد کہتے ہیں: اسے زیاد بن سعد، شعیب اور ابن مسافر نے زہری سے روایت کیا ہے، اور سبھوں نے «من ورق» کہا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 4222,
			"arabicnumber": 4222,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے تھے کہ اللہ کے نبی کریم صلی اللہ علیہ وسلم دس خصلتیں ناپسند فرماتے تھے، زردی یعنی خلوق کو، سفید بالوں کے تبدیل کرنے کو ۱؎، تہ بند ٹخنوں سے نیچے لٹکانے کو، سونے کی انگوٹھی پہننے کو، بے موقع و محل اجنبیوں کے سامنے عورتوں کے زیب و زینت کے ساتھ اور بن ٹھن کر نکلنے کو، شطرنج کھیلنے کو، معوذات کے علاوہ سے جھاڑ پھونک کرنے کو، تعویذ اور گنڈے لٹکانے کو اور ناجائز جگہ منی ڈالنے کو، اور بچے کے فساد کو یعنی اسے کمزور کرنے کو اس طرح پر کہ ایام رضاعت میں اس کی ماں سے صحبت کرے البتہ اسے حرام نہیں ٹھہراتے تھے۔ ابوداؤد کہتے ہیں: اہل بصرہ اس حدیث کی سند میں منفرد ہیں، واللہ اعلم",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Munqar"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Munqar"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 4223,
			"arabicnumber": 4223,
			"text": "بریدہ رضی اللہ عنہ کہتے ہیں کہ ایک شخص نبی اکرم صلی اللہ علیہ وسلم کی خدمت میں آیا، وہ پتیل کی انگوٹھی پہنے ہوئے تھا تو آپ صلی اللہ علیہ وسلم نے اس سے فرمایا: کیا بات ہے، میں تجھ سے بتوں کی بدبو محسوس کر رہا ہوں؟ تو اس نے اپنی انگوٹھی پھینک دی، پھر لوہے کی انگوٹھی پہن کر آیا، تو آپ صلی اللہ علیہ وسلم نے فرمایا: کیا بات ہے، میں تجھے جہنمیوں کا زیور پہنے ہوئے دیکھتا ہوں؟ تو اس نے پھر اپنی انگوٹھی پھینک دی، اور عرض کیا: اللہ کے رسول! پھر کس چیز کی انگوٹھی بنواؤں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: چاندی کی بنواؤ اور اسے ایک مثقال سے کم رکھو ۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 4224,
			"arabicnumber": 4224,
			"text": "معیقیب رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم کی انگوٹھی لوہے کی تھی اس پر چاندی کی پالش تھی کبھی کبھی وہ انگوٹھی میرے ہاتھ میں ہوتی۔ ٍ راوی کہتے ہیں: اور نبی اکرم صلی اللہ علیہ وسلم کی انگوٹھی کے امین معیقیب تھے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 4225,
			"arabicnumber": 4225,
			"text": "علی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے فرمایا: کہو: اے اللہ! مجھے ہدایت دے، اور درستگی پر قائم رکھ، اور ہدایت سے سیدھی راہ پر چلنے کی نیت رکھو، درستگی سے تیر کی طرح سیدھا رہنے یعنی سیدھی راہ پر جمے رہنے کی نیت کرو اور آپ صلی اللہ علیہ وسلم نے مجھے منع فرمایا کہ انگوٹھی اس انگلی یا اس انگلی میں رکھوں انگشت شہادت یعنی کلمہ کی یا درمیانی انگلی میں ( عاصم جو حدیث کے راوی ہیں نے شک کیا ہے ) اور مجھے «قسیہ» اور «میثرہ» سے منع فرمایا۔ ابوبردہ رضی اللہ عنہ کہتے ہیں: تو ہم نے علی رضی اللہ عنہ سے پوچھا: «قسیہ» کیا ہے؟ تو انہوں نے کہا: ایک قسم کے کپڑے ہیں جو شام یا مصر سے آتے تھے، ان کی دھاریوں میں ترنج ( چکوترہ ) بنے ہوئے ہوتے تھے اور «میثرہ» وہ بچھونا ( بستر ) ہے جسے عورتیں اپنے خاوندوں کے لیے بنایا کرتی تھیں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 4226,
			"arabicnumber": 4226,
			"text": "علی رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم سے ابوسلمہ بن عبدالرحمٰن نے بھی بیان کیا ہے کہ نبی اکرم صلی اللہ علیہ وسلم انگوٹھی اپنے داہنے ہاتھ میں پہنتے تھے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 4227,
			"arabicnumber": 4227,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم انگوٹھی اپنے بائیں ہاتھ میں پہنتے تھے اور اس کا نگینہ آپ کی ہتھیلی کے نچلے حصہ کی طرف ہوتا تھا۔ ابوداؤد کہتے ہیں: ابن اسحاق اور اسامہ نے یعنی ابن زید نے نافع سے اسی سند سے روایت کیا ہے کہ آپ صلی اللہ علیہ وسلم اسے اپنے دائیں ہاتھ میں پہنتے تھے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Shadh"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 4228,
			"arabicnumber": 4228,
			"text": "نافع سے روایت ہے کہ ابن عمر رضی اللہ عنہما انگوٹھی اپنے بائیں ہاتھ میں پہنتے تھے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 4229,
			"arabicnumber": 4229,
			"text": "محمد بن اسحاق کہتے ہیں کہ میں نے صلت بن عبداللہ بن نوفل بن عبدالمطلب کو اپنے داہنے ہاتھ کی چھنگلی میں انگوٹھی پہنے دیکھا تو کہا: یہ کیا ہے؟ انہوں نے کہا: میں نے ابن عباس رضی اللہ عنہما کو اسی طرح اپنی انگوٹھی پہنے اور اس کے نگینہ کو اپنی ہتھیلی کی پشت کی طرف کئے دیکھا، اور کہا: یہ مت سمجھنا کہ صرف ابن عباس رضی اللہ عنہما ہی ایسا کرتے تھے، بلکہ وہ ذکر کرتے تھے کہ رسول اللہ صلی اللہ علیہ وسلم بھی اپنی انگوٹھی ایسے ہی پہنا کرتے تھے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 4230,
			"arabicnumber": 4230,
			"text": "عامر بن عبداللہ بن زبیر کہتے ہیں کہ ان کی ایک لونڈی زبیر کی ایک بچی کو عمر بن خطاب رضی اللہ عنہ کے پاس لے کر گئی، اس بچی کے پاؤں میں گھنٹیاں تھیں یعنی گھونگھرو تھے تو عمر رضی اللہ عنہ نے اسے کاٹ دیا، اور کہنے لگے: میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے کہ ہر گھنٹی کے ساتھ شیطان ہوتا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 4231,
			"arabicnumber": 4231,
			"text": "عبدالرحمٰن بن حسان کی لونڈی بنانہ کہتی ہیں کہ وہ ام المؤمنین عائشہ رضی اللہ عنہا کے پاس تھیں کہ اسی دوران ایک لڑکی آپ کے پاس آئی، اس کے پاؤں میں گھونگھرو بج رہے تھے تو آپ نے کہا: اسے میرے پاس نہ آنے دو جب تک تم انہیں کاٹ نہ دو، اور کہا: میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا ہے: فرشتے اس گھر میں داخل نہیں ہوتے جس میں گھنٹی ہو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 4232,
			"arabicnumber": 4232,
			"text": "عبدالرحمٰن بن طرفہ کہتے ہیں کہ کے دادا عرفجہ بن اسعد کی ناک جنگ کلاب ۱؎ کے دن کاٹ لی گئی، تو انہوں نے چاندی کی ایک ناک بنوائی، انہیں اس کی بدبو محسوس ہوئی، تو نبی اکرم صلی اللہ علیہ وسلم نے انہیں حکم دیا، تو انہوں نے سونے کی ناک بنوا لی ۲؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 4233,
			"arabicnumber": 4233,
			"text": "اس سند سے بھی عرفجہ بن اسعد سے اسی مفہوم کی حدیث مروی ہے، یزید کہتے ہیں میں نے ابواشہب سے پوچھا: عبدالرحمٰن بن طرفہ نے اپنے دادا عرفجہ کا زمانہ پایا ہے، تو انہوں نے کہا: ہاں ( پایا ہے ) ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 4234,
			"arabicnumber": 4234,
			"text": "اس سند سے بھی اسی مفہوم کی حدیث مروی ہے۔",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 4235,
			"arabicnumber": 4235,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ نبی اکرم صلی اللہ علیہ وسلم کے پاس نجاشی کی طرف سے کچھ زیور ہدیہ میں آئے اس میں سونے کی ایک انگوٹھی تھی جس میں یمنی نگینہ جڑا ہوا تھا، تو رسول اللہ صلی اللہ علیہ وسلم نے اسے ایک لکڑی سے بغیر اس کی طرف التفات کئے پکڑا، یا اپنی بعض انگلیوں سے پکڑا، پھر اپنی نواسی زینب کی بیٹی امامہ بنت ابی العاص کو بلایا اور فرمایا: بیٹی! اسے تو پہن لے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 4236,
			"arabicnumber": 4236,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو اپنے محبوب کو آگ کا بالا پہنانا چاہے تو وہ اسے سونے کی بالی پہنا دے، اور جو اپنے محبوب کو آگ کا طوق ۱؎ پہنانا چاہے تو اسے سونے کا طوق پہنا دے اور جو اپنے محبوب کو آگ کا کنگن پہنانا چاہے وہ اسے سونے کا کنگن پہنا دے، البتہ سونے کے بجائے چاندی تمہارے لیے جائز ہے، لہٰذا تم اسی کو ناک یا کان میں استعمال کرو اور اس سے کھیلو۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 4237,
			"arabicnumber": 4237,
			"text": "حذیفہ کی بہن سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اے عورتوں کی جماعت! کیا زیور بنانے کے لیے تمہیں چاندی نہیں ملتی، سنو! تم میں جو عورت بھی سونے کا زیور پہنے گی تو اسے قیامت کے دن اسی سے عذاب دیا جائے گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 4238,
			"arabicnumber": 4238,
			"text": "اسماء بنت یزید رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس عورت نے سونے کا ہار پہنا تو قیامت کے دن اس کے گلے میں آگ کا ہار پہنایا جائے گا، اور جس عورت نے اپنے کان میں سونے کی بالی پہنی تو قیامت کے دن اس کے کان میں اسی کے ہم مثل آگ کی بالی پہنائی جائے گی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 4239,
			"arabicnumber": 4239,
			"text": "معاویہ بن ابی سفیان رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے چیتوں کی کھال پر سواری کرنے اور سونا پہننے سے منع فرمایا ہے مگر جب «مقطّع» یعنی تھوڑا اور معمولی ہو ۱؎۔ ابوداؤد کہتے ہیں: ابوقلابہ کی ملاقات معاویہ رضی اللہ عنہ سے نہیں ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 26
			}
		}
	]
}