{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"37": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4240,
			"arabicnumber": 4240,
			"text": "حذیفہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ہمارے درمیان کھڑے ہوئے، پھر اس مقام پر آپ نے قیامت تک پیش آنے والی کوئی ایسی چیز نہیں چھوڑی جسے بیان نہ فرما دیا ہو، تو جو اسے یاد رکھ سکا اس نے یاد رکھا اور جو بھول گیا وہ بھول گیا، اور وہ آپ کے ان اصحاب کو معلوم ہے، اور جب ان میں سے کوئی چیز ظہور پذیر ہو جاتی ہے تو مجھے یاد آ جاتا ہے کہ آپ صلی اللہ علیہ وسلم نے ایسے ہی فرمایا تھا، جیسے کوئی کسی کے غائب ہو جانے پر اس کے چہرہ کو یاد رکھتا ہے اور دیکھتے ہی اسے پہچان لیتا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 4241,
			"arabicnumber": 4241,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: اس امت میں چار ( بڑے بڑے ) فتنے ہوں گے ان کا آخری فناء ( قیامت ) ہو گا ۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 4242,
			"arabicnumber": 4242,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ ہم لوگ رسول اللہ صلی اللہ علیہ وسلم کے پاس بیٹھے تھے آپ نے فتنوں کے تذکرہ میں بہت سے فتنوں کا تذکرہ کیا یہاں تک کہ فتنہ احلاس کا بھی ذکر فرمایا تو ایک شخص نے عرض کیا: اللہ کے رسول! فتنہ احلاس کیا ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: وہ ایسی نفرت و عداوت اور قتل و غارت گری ہے کہ انسان ایک دوسرے سے بھاگے گا، اور باہم برسر پیکار رہے گا، پھر اس کے بعد فتنہ سراء ہے جس کا فساد میرے اہل بیت کے ایک شخص کے پیروں کے نیچے سے رونما ہو گا، وہ گمان کرے گا کہ وہ مجھ سے ہے حالانکہ وہ مجھ سے نہ ہو گا، میرے اولیاء تو وہی ہیں جو متقی ہوں، پھر لوگ ایک شخص پر اتفاق کر لیں گے جیسے سرین ایک پسلی پر ( یعنی ایسے شخص پر اتفاق ہو گا جس میں استقامت نہ ہو گی جیسے سرین پہلو کی ہڈی پر سیدھی نہیں ہوتی ) ، پھر «دھیماء» ( اندھیرے ) کا فتنہ ہو گا جو اس امت کے ہر فرد کو پہنچ کر رہے گا، جب کہا جائے گا کہ فساد ختم ہو گیا تو وہ اور بھڑک اٹھے گا جس میں صبح کو آدمی مومن ہو گا، اور شام کو کافر ہو جائے گا، یہاں تک کہ لوگ دو خیموں میں بٹ جائیں گے، ایک خیمہ اہل ایمان کا ہو گا جس میں کوئی منافق نہ ہو گا، اور ایک خیمہ اہل نفاق کا جس میں کوئی ایماندار نہ ہو گا، تو جب ایسا فتنہ رونما ہو تو اسی روز، یا اس کے دو سرے روز سے دجال کا انتظار کرنے لگ جاؤ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4243,
			"arabicnumber": 4243,
			"text": "حذیفہ بن یمان رضی اللہ عنہ کہتے ہیں قسم اللہ کی میں نہیں جانتا کہ میرے اصحاب بھول گئے ہیں؟ یا ظاہر کر رہے ہیں کہ وہ بھول گئے ہیں، قسم اللہ کی ایسا نہیں ہوا ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے قیامت تک ہونے والے کسی ایسے فتنہ کے سردار کا ذکر چھوڑ دیا ہو جس کے ساتھ تین سویا اس سے زیادہ افراد ہوں، اور اس کا اور اس کے باپ اور اس کے قبیلہ کا نام لے کر آپ صلی اللہ علیہ وسلم نے بتا نہ دیا ہو۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 4244,
			"arabicnumber": 4244,
			"text": "سبیع بن خالد کہتے ہیں کہ تستر فتح کئے جانے کے وقت میں کوفہ آیا، وہاں سے میں خچر لا رہا تھا، میں مسجد میں داخل ہوا تو دیکھا کہ چند درمیانہ قد و قامت کے لوگ ہیں، اور ایک اور شخص بیٹھا ہے جسے دیکھ کر ہی تم پہچان لیتے کہ یہ اہل حجاز میں کا ہے، میں نے پوچھا: یہ کون ہیں؟ تو لوگ میرے ساتھ ترش روئی سے پیش آئے، اور کہنے لگے: کیا تم انہیں نہیں جانتے؟ یہ رسول اللہ صلی اللہ علیہ وسلم کے صحابی حذیفہ بن یمان رضی اللہ عنہ ہیں، پھر حذیفہ نے کہا: لوگ رسول اللہ صلی اللہ علیہ وسلم سے خیر کے متعلق پوچھتے تھے، اور میں آپ سے شر کے بارے میں پوچھا کرتا تھا، تو لوگ انہیں غور سے دیکھنے لگے، انہوں نے کہا: جس پر تمہیں تعجب ہو رہا ہے وہ میں سمجھ رہا ہوں، پھر وہ کہنے لگے: میں نے رسول اللہ صلی اللہ علیہ وسلم سے عرض کیا: اللہ کے رسول! مجھے بتائیے کہ اس خیر کے بعد جسے اللہ نے ہمیں عطا کیا ہے کیا شر بھی ہو گا جیسے پہلے تھا؟ آپ صلی اللہ علیہ وسلم نے فرمایا: ہاں میں نے عرض کیا: پھر اس سے بچاؤ کی کیا صورت ہو گی؟ آپ صلی اللہ علیہ وسلم نے فرمایا: تلوار ۱؎ میں نے عرض کیا: اللہ کے رسول! پھر اس کے بعد کیا ہو گا؟ آپ صلی اللہ علیہ وسلم نے فرمایا: اگر اللہ کی طرف سے کوئی خلیفہ ( حاکم ) زمین پر ہو پھر وہ تمہاری پیٹھ پر کوڑے لگائے، اور تمہارا مال لوٹ لے جب بھی تم اس کی اطاعت کرو ورنہ تم درخت کی جڑ چبا چبا کر مر جاؤ ۲؎ میں نے عرض کیا: پھر کیا ہو گا؟ آپ صلی اللہ علیہ وسلم نے فرمایا: پھر دجال ظاہر ہو گا، اس کے ساتھ نہر بھی ہو گی اور آگ بھی جو اس کی آگ میں داخل ہو گیا تو اس کا اجر ثابت ہو گیا، اور اس کے گناہ معاف ہو گئے، اور جو اس کی ( اطاعت کر کے ) نہر میں داخل ہو گیا تو اس کا گناہ واجب ہو گیا، اور اس کا اجر ختم ہو گیا میں نے عرض کیا: پھر کیا ہو گا؟ آپ صلی اللہ علیہ وسلم نے فرمایا: پھر قیامت قائم ہو گی ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 4245,
			"arabicnumber": 4245,
			"text": "خالد بن خالد یشکری سے یہی حدیث مروی ہے اس میں یہ ہے کہ حذیفہ رضی اللہ عنہ نے کہا: میں نے عرض کیا: پھر تلوار کے بعد کیا ہو گا؟ آپ صلی اللہ علیہ وسلم نے فرمایا: باقی لوگ رہیں گے مگر دلوں میں ان کے فساد ہو گا، اور ظاہر میں صلح ہو گی پھر آگے انہوں نے پوری حدیث ذکر کی۔ راوی کہتے ہیں: قتادہ اسے ( تلوار کو ) اس فتنہ ارتداد پر محمول کرتے تھے جو ابوبکر رضی اللہ عنہ کے زمانہ میں ہوا، اور «اقذاء» کی تفسیر «قذی» سے یعنی غبار اور گندگی سے جو آنکھ یا پینے کی چیز میں پڑ جاتی ہے، اور «ھدنہ» کی تفسیر صلح سے«دخن» کی تفسیر دلوں کے فساد اور کینوں سے کرتے تھے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 4246,
			"arabicnumber": 4246,
			"text": "نصر بن عاصم لیثی کہتے ہیں کہ ہم بنی لیث کے کچھ لوگوں کے ساتھ یشکری کے پاس آئے تو انہوں نے پوچھا: تم کون لوگ ہو؟ ہم نے کہا: ہم بنی لیث کے لوگ ہیں ہم آپ کے پاس حذیفہ رضی اللہ عنہ کی حدیث پوچھنے آئے ہیں؟ تو انہوں نے پوری حدیث ذکر کی اس میں ہے: میں نے عرض کیا: اللہ کے رسول! کیا اس خیر کے بعد شر ہو گا؟ آپ صلی اللہ علیہ وسلم نے فرمایا: فتنہ اور شر ہو گا میں نے عرض کیا: اللہ کے رسول! اس شر کے بعد پھر خیر ہو گا؟ آپ صلی اللہ علیہ وسلم نے فرمایا: حذیفہ! اللہ کی کتاب کو پڑھو اور جو کچھ اس میں ہے اس کی پیروی کرو آپ نے یہ تین بار فرمایا، میں نے عرض کیا: اللہ کے رسول! کیا اس شر کے بعد پھر خیر ہو گا؟ آپ صلی اللہ علیہ وسلم نے فرمایا: «هدنة على الدخن» ہو گا اور جماعت ہو گی جس کے دلوں میں کینہ و فساد ہو گا میں نے عرض کیا:«هدنة على الدخن» کا کیا مطلب ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: لوگوں کے دل اس حالت پر نہیں واپس آئیں گے جس پر پہلے تھے ۱؎ میں نے عرض کیا: اللہ کے رسول! کیا اس خیر کے بعد بھی شر ہو گا؟ آپ صلی اللہ علیہ وسلم نے فرمایا: ایک ایسا اندھا اور بہرا فتنہ ہو گا ( اور اس کے قائد ) جہنم کے دروازوں پر بلانے والے ہوں گے، تو اے حذیفہ! تمہارا جنگل میں درخت کی جڑ چبا چبا کر مر جانا بہتر ہو گا اس بات سے کہ تم ان میں کسی کی پیروی کرو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 4247,
			"arabicnumber": 4247,
			"text": "اس سند سے بھی حذیفہ رضی اللہ عنہ سے یہی حدیث مرفوعاً مروی ہے اس میں ہے کہ ان دنوں میں اگر مسلمانوں کا کوئی خلیفہ ( حاکم ) تمہیں نہ ملے تو بھاگ کر ( جنگل میں ) چلے جاؤ یہاں تک کہ وہیں مر جاؤ، اگر تم درخت کی جڑ چبا چبا کر مر جاؤ ( تو بہتر ہے ایسے بے دینوں میں رہنے سے ) اس روایت کے آخر میں یہ ہے کہ میں نے کہا: پھر اس کے بعد کیا ہو گا؟ آپ صلی اللہ علیہ وسلم نے فرمایا: اگر کسی کی گھوڑی بچہ جننا چاہتی ہو تو وہ نہ جن سکے گی یہاں تک کہ قیامت آ جائے گی ۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 4248,
			"arabicnumber": 4248,
			"text": "عبداللہ بن عمرو رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جس شخص نے کسی امام سے بیعت کی، اس کے ہاتھ میں اپنا ہاتھ دیا، اور اس سے عہد و اقرار کیا تو اسے چاہیئے کہ جہاں تک ہو سکے وہ اس کی اطاعت کرے، اور اگر کوئی دوسرا امام بن کر اس سے جھگڑنے آئے تو اس دوسرے کی گردن مار دے ۔ عبدالرحمٰن کہتے ہیں: میں نے عبداللہ بن عمرو رضی اللہ عنہما سے پوچھا: کیا آپ نے اسے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے؟ انہوں نے کہا: ہاں اسے میرے دونوں کانوں نے سنا ہے، اور میرے دل نے یاد رکھا ہے، میں نے کہا: یہ آپ کے چچا کے لڑکے معاویہ رضی اللہ عنہ ہم سے تاکیداً کہتے ہیں کہ ہم یہ یہ کریں تو انہوں نے کہا: ان کی اطاعت ان چیزوں میں کرو جس میں اللہ کی اطاعت ہو، اور جس میں اللہ کی نافرمانی ہو اس میں ان کا کہنا نہ مانو۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 4249,
			"arabicnumber": 4249,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: خرابی اور بربادی ہے عربوں کے لیے اس شر سے جو قریب آ چکا ہے، اس میں وہی شخص فلاح یاب رہے گا جو اپنا ہاتھ روکے رکھے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 4250,
			"arabicnumber": 4250,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: قریب ہے کہ مسلمان مدینہ ہی میں محصور کر دئیے جائیں یہاں تک کہ ان کی عملداری صرف مقام سلاح تک رہ جائے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 4251,
			"arabicnumber": 4251,
			"text": "ابن شہاب زہری کہتے ہیں اور سلاح خیبر کے قریب ایک جگہ ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 4252,
			"arabicnumber": 4252,
			"text": "ثوبان رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اللہ تعالیٰ نے میرے لیے زمین سمیٹ دی یا فرمایا: میرے لیے میرے رب نے زمین سمیٹ دی، تو میں نے مشرق و مغرب کی ساری جگہیں دیکھ لیں، یقیناً میری امت کی حکمرانی وہاں تک پہنچ کر رہے گی جہاں تک زمین میرے لیے سمیٹی گئی، مجھے سرخ و سفید دونوں خزانے دئیے گئے، میں نے اپنے رب سے سوال کیا کہ میری امت کو کسی عام قحط سے ہلاک نہ کرے، ان پر ان کے علاوہ باہر سے کوئی ایسا دشمن مسلط نہ کرے جو انہیں جڑ سے مٹا دے، اور ان کا نام باقی نہ رہنے پائے، تو میرے رب نے مجھ سے فرمایا: اے محمد! جب میں کوئی فیصلہ کر لیتا ہوں تو وہ بدلتا نہیں میں تیری امت کے لوگوں کو عام قحط سے ہلاک نہیں کروں گا، اور نہ ہی ان پر کوئی ایسا دشمن مسلط کروں گا جو ان میں سے نہ ہو، اور ان کو جڑ سے مٹا دے گو ساری زمین کے کافر مل کر ان پر حملہ کریں، البتہ ایسا ہو گا کہ تیری امت کے لوگ خود آپس میں ایک دوسرے کو ہلاک کریں گے، انہیں قید کریں گے، اور میں اپنی امت پر گمراہ کر دینے والے ائمہ سے ڈرتا ہوں، اور جب میری امت میں تلوار رکھ دی جائے گی تو پھر وہ اس سے قیامت تک نہیں اٹھائی جائے گی، اور قیامت اس وقت تک قائم نہ ہو گی جب تک کہ میری امت کے کچھ لوگ مشرکین سے مل نہ جائیں اور کچھ بتوں کو نہ پوجنے لگ جائیں، اور عنقریب میری امت میں تیس ( ۳۰ ) کذاب پیدا ہوں گے، ان میں ہر ایک گمان کرے گا کہ وہ نبی ہے، حالانکہ میں خاتم النبیین ہوں، میرے بعد کوئی نبی نہیں آئے گا، میری امت کا ایک گروہ ہمیشہ حق پر قائم رہے گا ( ابن عیسیٰ کی روایت میں ہے ) وہ غالب رہے گا، ان کا مخالف ان کو ضرر نہ پہنچا سکے گا یہاں تک کہ اللہ کا حکم آ جائے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 4253,
			"arabicnumber": 4253,
			"text": "ابو مالک اشعری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اللہ نے تمہیں تین آفتوں سے بچا لیا ہے: ایک یہ کہ تمہارا نبی تم پر ایسی بدعا نہیں کرے گا کہ تم سب ہلاک ہو جاؤ، دوسری یہ کہ اہل باطل اہل حق پر غالب نہیں آئیں گے، تیسری یہ کہ تم سب گمراہی پر متفق نہیں ہو گے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 4254,
			"arabicnumber": 4254,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: اسلام کی چکی پینتیس یا چھتیس یا سینتیس سال تک گردش میں رہے گی، پھر اگر وہ ہلاک ہوئے تو ان کی راہ وہی ہو گی جو ان لوگوں کی راہ رہی جو ہلاک ہوئے اور اگر ان کا دین قائم رہا تو ستر سال تک قائم رہے گا میں نے عرض کیا: کیا اس زمانہ سے جو باقی ہے یا اس سے جو گزر گیا؟ آپ صلی اللہ علیہ وسلم نے فرمایا: اس زمانہ سے جو گزر گیا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 4255,
			"arabicnumber": 4255,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: زمانہ سمٹ جائے گا، علم کم ہو جائے گا، فتنے رونما ہوں گے، لوگوں پر بخیلی ڈال دی جائے گی، اور «هرج» کثرت سے ہو گا آپ سے عرض کیا گیا: اللہ کے رسول! وہ کیا چیز ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: قتل، قتل ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 4256,
			"arabicnumber": 4256,
			"text": "ابوبکرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: عنقریب ایک ایسا فتنہ رونما ہو گا کہ اس میں لیٹا ہوا شخص بیٹھے ہوئے سے بہتر ہو گا، بیٹھا کھڑے سے بہتر ہو گا، کھڑا چلنے والے سے بہتر ہو گا اور چلنے والا دوڑنے والے سے عرض کیا: اللہ کے رسول! اس وقت کے لیے آپ مجھے کیا حکم دیتے ہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: جس کے پاس اونٹ ہو وہ اپنے اونٹ سے جا ملے، جس کے پاس بکری ہو وہ اپنی بکری سے جا ملے، اور جس کے پاس زمین ہو تو وہ اپنی زمین ہی میں جا بیٹھے عرض کیا: جس کے پاس اس میں سے کچھ نہ ہو وہ کیا کرے؟ پھر آپ صلی اللہ علیہ وسلم نے فرمایا: جس کے پاس اس میں سے کچھ نہ ہو تو اسے چاہیئے کہ اپنی تلوار لے کر اس کی دھار ایک پتھر سے مار کر کند کر دے ( اسے لڑنے کے لائق نہ رہنے دے ) پھر چاہیئے کہ جتنی جلد ممکن ہو سکے وہ ( فتنوں سے ) گلو خلاصی حاصل کرے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 4257,
			"arabicnumber": 4257,
			"text": "سعد بن ابی وقاص رضی اللہ عنہ اس حدیث میں کہتے ہیں میں نے عرض کیا: اللہ کے رسول! ( اس فتنہ و فساد کے زمانہ میں ) اگر کوئی میرے گھر میں گھس آئے، اور اپنا ہاتھ مجھے قتل کرنے کے لیے بڑھائے تو میں کیا کروں؟ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تم آدم کے نیک بیٹے ( ہابیل ) کی طرح ہو جاؤ ، پھر یزید نے یہ آیت پڑھی «لئن بسطت إلى يدك» ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 4258,
			"arabicnumber": 4258,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا پھر انہوں نے ابی بکرہ رضی اللہ عنہ کی روایت کی بعض باتیں ذکر کیں اس میں یہ اضافہ ہے: اس فتنہ میں جو لوگ قتل کئے جائیں گے وہ جہنم میں جائیں گے اور اس میں مزید یہ ہے کہ میں نے پوچھا: ابن مسعود! یہ فتنہ کب ہو گا؟ کہا: یہ وہ زمانہ ہو گا جب قتل شروع ہو چکا ہو گا، اس طرح سے کہ آدمی اپنے ساتھی سے بھی مامون نہ رہے گا، میں نے عرض کیا: اگر میں یہ زمانہ پاؤں تو آپ ہمیں کیا حکم دیتے ہیں؟ آپ نے فرمایا: تم اپنی زبان اور ہاتھ روکے رکھنا، اور اپنے گھر کے کمبلوں میں کا ایک کمبل بن جانا ۱؎، پھر جب عثمان رضی اللہ عنہ قتل کئے گئے تو میرے دل میں یکایک خیال گزرا کہ شاید یہ وہی فتنہ ہو جس کا ذکر ابن مسعود نے کیا تھا، چنانچہ میں سواری پر بیٹھا اور دمشق آ گیا، وہاں خریم بن فاتک سے ملا اور ان سے بیان کیا تو انہوں نے اس اللہ کی قسم کھا کر کہا جس کے سوا کوئی معبود برحق نہیں کہ اسے انہوں نے بھی رسول اللہ صلی اللہ علیہ وسلم سے اسی طرح سنا ہے جیسے ابن مسعود نے اسے مجھ سے بیان کیا تھا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 4259,
			"arabicnumber": 4259,
			"text": "ابوموسی اشعری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: قیامت سے پہلے کچھ فتنے ہیں جیسے تاریک رات کی گھڑیاں ( کہ ہر گھڑی پہلی سے زیادہ تاریک ہوتی ہے ) ان فتنوں میں صبح کو آدمی مومن رہے گا، اور شام کو کافر ہو جائے گا، اور شام کو مومن رہے گا، اور صبح کو کافر ہو جائے گا، اس میں بیٹھا شخص کھڑے شخص سے بہتر ہو گا، اور چلنے والا دوڑنے والے سے بہتر ہو گا، تو تم ایسے فتنے کے وقت میں اپنی کمانیں توڑ دینا، ان کے تانت کاٹ ڈالنا، اور اپنی تلواروں کی دھار کو پتھروں سے مار کر ختم کر دینا ۱؎، پھر اگر اس پر بھی کوئی تم میں سے کسی پر چڑھ آئے، تو اسے چاہیئے کہ وہ آدم کے نیک بیٹے ( ہابیل ) کے مانند ہو جائے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 4260,
			"arabicnumber": 4260,
			"text": "عبدالرحمٰن بن سمرہ کہتے ہیں کہ میں مدینہ کے راستوں میں سے ایک راستہ میں ابن عمر رضی اللہ عنہما کا ہاتھ پکڑے چل رہا تھا کہ وہ اچانک ایک لٹکے ہوئے سر کے پاس آئے اور کہنے لگے: بدبخت ہے جس نے اسے قتل کیا، پھر جب کچھ اور آگے بڑھے تو کہا: میں تو اسے بدبخت ہی سمجھ رہا ہوں، میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا ہے: جو شخص میری امت میں سے کسی شخص کی طرف چلا تاکہ وہ اسے ( ناحق ) قتل کرے، پھر وہ اسے قتل کر دے تو قتل کرنے والا جہنم میں ہو گا، اور جسے قتل کیا گیا ہے وہ جنت میں ہو گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 4261,
			"arabicnumber": 4261,
			"text": "ابوذر رضی اللہ عنہ کہتے ہیں کہ مجھ سے رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ابوذر! میں نے عرض کیا: تعمیل حکم کے لیے حاضر ہوں، اللہ کے رسول! پھر انہوں نے حدیث ذکر کی اس میں ہے: آپ صلی اللہ علیہ وسلم نے فرمایا: ابوذر! اس دن تمہارا کیا حال ہو گا؟ جب مدینہ میں اتنی موتیں ہوں گی کہ گھر یعنی قبر ایک غلام کے بدلہ میں ملے گا؟ ۱؎ میں نے عرض کیا: اللہ اور اس کے رسول کو خوب معلوم ہے، یا کہا: اللہ اور اس کے رسول میرے لیے ایسے موقع پر کیا پسند فرماتے ہیں؟ آپ نے فرمایا: صبر کو لازم پکڑنا یا فرمایا: صبر کرنا ، پھر آپ صلی اللہ علیہ وسلم نے مجھ سے فرمایا: اے ابوذر! میں نے عرض کیا: اللہ کے رسول! ارشاد فرمائیں تعمیل حکم کے لیے حاضر ہوں، آپ صلی اللہ علیہ وسلم نے فرمایا: تمہارا کیا حال ہو گا جب تم احجار الزیت ۲؎ کو خون میں ڈوبا ہوا دیکھو گے میں نے عرض کیا: جو اللہ اور اس کے رسول میرے لیے پسند فرمائیں گے، آپ صلی اللہ علیہ وسلم نے فرمایا: اس جگہ کو لازم پکڑنا جہاں کے تم ہو ۳؎ ، میں نے عرض کیا: اللہ کے رسول! کیا میں اپنی تلوار لے کر اسے اپنے کندھے پر نہ رکھ لوں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: تب تو تم ان کے شریک بن جاؤ گے میں نے عرض کیا: پھر آپ مجھے کیا حکم دیتے ہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: اپنے گھر کو لازم پکڑنا میں نے عرض کیا: اگر کوئی میرے گھر میں گھس آئے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: اگر تمہیں یہ اندیشہ ہو کہ تلواروں کی چمک تمہاری نگاہیں خیرہ کر دے گی تو تم اپنا کپڑا اپنے چہرے پر ڈال لینا ( اور قتل ہو جانا ) وہ تمہارا اور اپنا دونوں کا گناہ سمیٹ لے گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 4262,
			"arabicnumber": 4262,
			"text": "ابوموسیٰ اشعری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تمہارے سامنے فتنے ہوں گے اندھیری رات کی گھڑیوں کی طرح ۱؎ ان میں صبح کو آدمی مومن رہے گا اور شام کو کافر، اور شام کو مومن رہے گا اور صبح کو کافر، اس میں بیٹھا ہوا کھڑے شخص سے بہتر ہو گا، اور کھڑا چلنے والے سے بہتر ہو گا، اور چلنے والا دوڑنے والے سے بہتر ہو گا ، لوگوں نے عرض کیا: تو آپ ہمیں کیا حکم دیتے ہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: تم اپنے گھر کا ٹاٹ بن جانا ۲؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 4263,
			"arabicnumber": 4263,
			"text": "مقداد بن اسود رضی اللہ عنہ کہتے ہیں کہ قسم اللہ کی میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا ہے: نیک بخت وہ ہے جو فتنوں سے دور رہا، نیک بخت وہ ہے جو فتنوں سے دور رہا، اور جو اس میں پھنس گیا پھر اس نے صبر کیا تو پھر اس کا کیا کہنا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 4264,
			"arabicnumber": 4264,
			"text": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: عنقریب ایک بہرا گونگا اور اندھا فتنہ ہو گا ۱؎ جو اس میں جھانکے گا اسے وہ اپنی لپیٹ میں لے لے گا، اور زبان چلانا اس میں ایسے ہو گا جیسے تلوار چلانا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 4265,
			"arabicnumber": 4265,
			"text": "عبداللہ بن عمرو رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: عنقریب ایک ایسا فتنہ ہو گا جو پورے عرب کو گھیر لے گا جو اس میں مارے جائیں گے جہنم میں جائیں گے، اس میں زبان کا چلانا تلوار چلانے سے بھی زیادہ سخت ہو گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 4266,
			"arabicnumber": 4266,
			"text": "عبداللہ بن عبدالقدوس نے «عن رجل يقال له زياد» کے بجائے «زیاد سیمین کوش» کہا ہے جس کے معنی سفید کان والا کے ہیں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 4267,
			"arabicnumber": 4267,
			"text": "ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: قریب ہے کہ مسلمان کا بہتر مال بکریاں ہوں، جنہیں لے کر وہ پہاڑ کی چوٹیوں اور بارش کے مقامات پر پھرتا اور اپنا دین لے کر وہ فساد اور فتنوں سے بھاگتا ہو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 4268,
			"arabicnumber": 4268,
			"text": "احنف بن قیس کہتے ہیں کہ میں لڑائی کے ارادہ سے نکلا ( تاکہ علی رضی اللہ عنہ کے ساتھ معاویہ رضی اللہ عنہ کے خلاف لڑوں ) تو مجھے ( راستہ میں ) ابوبکرہ رضی اللہ عنہ مل گئے، انہوں نے کہا: تم لوٹ جاؤ کیونکہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے: جب دو مسلمان اپنی تلوار لے کر ایک دوسرے کو مارنے اٹھیں تو قاتل اور مقتول دونوں جہنم میں جائیں گے ایک شخص نے عرض کیا: اللہ کے رسول! قاتل ( کا جہنم میں جانا ) تو سمجھ میں آتا ہے لیکن کا حال ایسا کیوں ہو گا؟ آپ صلی اللہ علیہ وسلم نے فرمایا: اس نے بھی اپنے ساتھی کو قتل کرنا چاہا تھا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 4269,
			"arabicnumber": 4269,
			"text": "اس سند سے بھی حسن سے اسی مفہوم کی حدیث مختصراً مروی ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 4270,
			"arabicnumber": 4270,
			"text": "خالد بن دہقان کہتے ہیں کہ جنگ قسطنطنیہ میں ہم ذلقیہ ۱؎ میں تھے، اتنے میں فلسطین کے اشراف و عمائدین میں سے ایک شخص آیا، اس کی اس حیثیت کو لوگ جانتے تھے، اسے ہانی بن کلثوم بن شریک کنانی کہا جاتا تھا، اس نے آ کر عبداللہ بن ابی زکریا کو سلام کیا، وہ ان کے مقام و مرتبہ سے واقف تھا، ہم سے خالد نے کہا: تو ہم سے عبداللہ بن زکریا نے حدیث بیان کی عبداللہ بن زکریا نے کہا میں نے ام الدرداء رضی اللہ عنہا سے سنا ہے وہ کہہ رہی تھیں کہ میں نے ابوالدرداء رضی اللہ عنہ سے سنا ہے، وہ کہہ رہے تھے: میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے آپ فرما رہے تھے: ہر گناہ کو اللہ بخش سکتا ہے سوائے اس کے جو مشرک ہو کر مرے یا مومن ہو کر کسی مومن کو جان بوجھ کر قتل کر دے ، تو ہانی بن کلثوم نے کہا: میں نے محمود بن ربیع کو بیان کرتے سنا وہ عبادہ بن صامت رضی اللہ عنہ سے، اور عبادہ نبی اکرم صلی اللہ علیہ وسلم سے روایت کر رہے تھے کہ آپ نے فرمایا: جو کسی مومن کو ناحق قتل کرے، پھر اس پر خوش بھی ہو، تو اللہ اس کا کوئی عمل قبول نہ فرمائے گا نہ نفل اور نہ فرض ۔ خالد نے ہم سے کہا: پھر ابن ابی زکریا نے مجھ سے بیان کیا وہ ام الدرداء سے روایت کر رہے تھے، اور وہ ابوالدرداء سے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: برابر مومن ہلکا پھلکا اور صالح رہتا ہے، جب تک وہ ناحق خون نہ کرے، اور جب وہ ناحق کسی کو قتل کر دیتا ہے تو تھک جاتا اور عاجز ہو جاتا ہے ۔ ہانی بن کلثوم نے بیان کیا، وہ محمود بن ربیع سے، محمود عبادہ بن صامت سے، عبادہ نبی اکرم صلی اللہ علیہ وسلم سے، اسی کے ہم مثل روایت کر رہے تھے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 4271,
			"arabicnumber": 4271,
			"text": "خالد بن دہقان کہتے ہیں میں نے یحییٰ بن یحییٰ غسانی سے قول نبوی «اعتبط بقتلہ» کے بارے میں پوچھا، تو آپ نے کہا: اس سے مراد وہ لوگ ہیں جو ایک دوسرے کو فتنے میں یہ سمجھ کر قتل کرتے ہیں کہ ہم ہدایت پر ہیں، پھر وہ اللہ سے توبہ و استغفار نہیں کرتے یعنی اس ( قتل ) سے۔ ابوداؤد کہتے ہیں: «اعتبط» اعتبط کے معنی ( ناحق ) خون بہانے کے ہیں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 4272,
			"arabicnumber": 4272,
			"text": "خارجہ بن زید کہتے ہیں کہ میں نے زید بن ثابت رضی اللہ عنہ سے اسی جگہ کہتے ہوئے سنا ہے کہ آیت کریمہ «ومن يقتل مؤمنا متعمدا فجزاؤه جهنم خالدا فيها» اور جو کوئی کسی مسلمان کو جان بوجھ کر قصداً قتل کر ڈالے تو اس کی سزا جہنم ہے ہے جس میں وہ ہمیشہ رہے گا ( النساء: ۹۳ ) ( سورۃ الفرقان کی آیت ) «والذين لا يدعون مع الله إلها آخر ولا يقتلون النفس التي حرم الله إلا بالحق» اور جو اللہ کے ساتھ کسی اور معبود کو نہیں پکارتے اور کسی ایسے شخص کو جسے قتل کرنا اللہ نے حرام کر دیا ہے بجز حق کے قتل نہیں کرتے ( الفرقان: ۶۸ ) کے چھ مہینے کے بعد نازل ہوئی ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Munqar"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 4273,
			"arabicnumber": 4273,
			"text": "سعید بن جبیر کہتے ہیں کہ میں نے ابن عباس رضی اللہ عنہما سے پوچھا تو آپ نے کہا: جب سورۃ الفرقان کی آیت «والذين لا يدعون مع الله إلها آخر ولا يقتلون النفس التي حرم الله إلا بالحق» نازل ہوئی تو اہل مکہ کے مشرک کہنے لگے: ہم نے بہت سی ایسی جانیں قتل کی ہیں جنہیں اللہ نے حرام کیا ہے اور ہم نے اللہ کے علاوہ دوسرے معبودوں کو پکارا ہے، اور برے کام کئے ہیں تو اللہ نے«إلا من تاب وآمن وعمل عملا صالحا فأولئك يبدل الله سيئاتهم حسنات» سوائے ان لوگوں کے جو توبہ کریں اور ایمان لائیں اور نیک کام کریں تو ایسے لوگوں کے گناہوں کو اللہ تعالیٰ نیکیوں سے بدل دیتا ہے ( الفرقان: ۷۰ ) نازل فرمائی تو یہ ان لوگوں کے لیے ہے۔ انہوں نے مزید کہا: اور سورۃ نساء کی آیت «ومن يقتل مؤمنا متعمدا فجزاؤه جهنم» الآیۃ، ایسے وقت کے لیے ہے جب آدمی مسلمان ہو جائے اور شرعی احکام کو جان لے پھر جان بوجھ کر کسی مسلمان کو قتل کر دے تو ایسے شخص کی سزا جہنم ہو گی، اور اس کی توبہ بھی قبول نہ ہو گی۔ سعید بن جبیر کہتے ہیں: میں نے ابن عباس کے اس قول کو مجاہد سے بیان کیا تو انہوں نے اس میں یہ اضافہ کیا سوائے اس شخص کے جو شرمندہ ہو ( یعنی دل سے توبہ کرے تو اس کی توبہ قبول ہو گی ) ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 4274,
			"arabicnumber": 4274,
			"text": "عبداللہ بن عباس رضی اللہ عنہما سے اسی قصہ میں مروی ہے کہ «والذين لا يدعون مع الله إلها آخر» سے مراد اہل شرک ہیں اور آیت کریمہ «يا عبادي الذين أسرفوا على أنفسهم لا تقنطوا من رحمة الله» اے میرے بندو! جنہوں نے اپنی جانوں پر زیادتی کی ہے تم اللہ کی رحمت سے ناامید مت ہو جاؤ ( الزمر: ۵۳ ) نازل ہوئی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 4275,
			"arabicnumber": 4275,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ آیت کریمہ «ومن يقتل مؤمنا متعمدا» ( کا حکم باقی ہے ) اسے کسی اور آیت نے منسوخ نہیں کیا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 4276,
			"arabicnumber": 4276,
			"text": "ابومجلز سے اللہ تعالیٰ کے قول «ومن يقتل مؤمنا متعمدا فجزاؤه جهنم» کے متعلق مروی ہے کہ ایسے شخص کا بدلہ تو یہی ہے لیکن اگر اللہ اسے معاف کرنا چاہے تو کر سکتا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 4277,
			"arabicnumber": 4277,
			"text": "سعید بن زید رضی اللہ عنہ کہتے ہیں کہ ہم نبی اکرم صلی اللہ علیہ وسلم کے پاس تھے آپ نے ایک فتنہ اور اس کی ہولناکی کا ذکر کیا تو ہم نے یا لوگوں نے عرض کیا: اللہ کے رسول! اگر اس فتنہ نے ہم کو پا لیا تو ہم کو تو تباہ کر ڈالے گا؟ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ہرگز نہیں، بس تمہارا قتل ہو جانا ہی کافی ہو گا ۔ سعید کہتے ہیں: میں نے اپنے بھائیوں کو ( جمل و صفین میں ) قتل ہوتے دیکھ لیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 4278,
			"arabicnumber": 4278,
			"text": "ابوموسیٰ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: میری اس امت پر اللہ کی رحمت ہے آخرت میں اسے عذاب ( دائمی ) نہیں ہو گا اور دنیا میں اس کا عذاب: فتنوں، زلزلوں اور قتل کی شکل میں ہو گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 39
			}
		}
	]
}