{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"41": "Types of Blood-Wit (Kitab Al-Diyat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4494,
			"arabicnumber": 4494,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ قریظہ اور نضیر دو ( یہودی ) قبیلے تھے، نضیر قریظہ سے زیادہ باعزت تھے، جب قریظہ کا کوئی آدمی نضیر کے کسی آدمی کو قتل کر دیتا تو اسے اس کے بدلے قتل کر دیا جاتا، اور جب نضیر کا کوئی آدمی قریظہ کے کسی آدمی کو قتل کر دیتا تو سو وسق کھجور فدیہ دے کر اسے چھڑا لیا جاتا، جب رسول اللہ صلی اللہ علیہ وسلم کی بعثت ہوئی تو نضیر کے ایک آدمی نے قریظہ کے ایک آدمی کو قتل کر دیا، تو انہوں نے مطالبہ کیا کہ اسے ہمارے حوالے کرو، ہم اسے قتل کریں گے، نضیر نے کہا: ہمارے اور تمہارے درمیان نبی اکرم صلی اللہ علیہ وسلم فیصلہ کریں گے، چنانچہ وہ لوگ آپ کے پاس آئے تو آیت «وإن حكمت فاحكم بينهم بالقسط» اگر تم ان کے درمیان فیصلہ کرو تو انصاف سے فیصلہ کرو اتری، اور انصاف کی بات یہ تھی کہ جان کے بدلے جان لی جائے، پھر آیت «أفحكم الجاهلية يبغون» کیا یہ لوگ جاہلیت کے فیصلہ کو پسند کرتے ہیں؟ نازل ہوئی۔ ابوداؤد کہتے ہیں: قریظہ اور نضیر دونوں ہارون علیہ السلام کی اولاد ہیں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 4495,
			"arabicnumber": 4495,
			"text": "ابورمثہ رضی اللہ عنہ کہتے ہیں کہ میں اپنے والد کے ساتھ نبی اکرم صلی اللہ علیہ وسلم کے پاس گیا، آپ نے میرے والد سے پوچھا: یہ تمہارا بیٹا ہے؟ میرے والد نے کہا: ہاں رب کعبہ کی قسم! آپ صلی اللہ علیہ وسلم نے فرمایا: سچ مچ؟ انہوں نے کہا: میں اس کی گواہی دیتا ہوں تو رسول اللہ صلی اللہ علیہ وسلم مسکرائے، کیونکہ میں اپنے والد کے مشابہ تھا، اور میرے والد نے قسم کھائی تھی، پھر آپ صلی اللہ علیہ وسلم نے فرمایا: سنو! نہ یہ تمہارے جرم میں پکڑا جائے گا، اور نہ تم اس کے جرم میں اور پھر رسول اللہ صلی اللہ علیہ وسلم نے یہ آیت پڑھی «ولا تزر وازرة وزر أخرى» کوئی جان کسی دوسری جان کا بوجھ نہ اٹھائے گی ( الانعام: ۱۶۴، الاسراء: ۱۵، الفاطر: ۱۸ ) ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 4496,
			"arabicnumber": 4496,
			"text": "ابوشریح خزاعی رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جس شخص کو ( اپنے کسی رشتہ دار کے ) قتل ہونے، یا زخمی ہونے کی تکلیف پہنچی ہو اسے تین میں سے ایک چیز کا اختیار ہو گا: یا تو قصاص لے لے، یا معاف کر دے، یا دیت لے لے، اگر وہ ان کے علاوہ کوئی چوتھی بات کرنا چاہے تو اس کا ہاتھ پکڑ لو، اور جس نے ان ( اختیارات ) میں زیادتی کی تو اس کے لیے درد ناک عذاب ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4497,
			"arabicnumber": 4497,
			"text": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ جب بھی نبی اکرم صلی اللہ علیہ وسلم کے پاس کوئی ایسا مقدمہ لایا جاتا جس میں قصاص لازم ہوتا تو میں نے آپ کو یہی دیکھا کہ ( پہلے ) آپ اس میں معاف کر دینے کا حکم دیتے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 4498,
			"arabicnumber": 4498,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم کے زمانے میں ایک شخص قتل کر دیا گیا تو یہ مقدمہ نبی اکرم صلی اللہ علیہ وسلم کی عدالت میں پیش کیا گیا، آپ نے اس ( قاتل ) کو مقتول کے وارث کے حوالے کر دیا، قاتل کہنے لگا: اللہ کے رسول! اللہ کی قسم! میرا ارادہ اسے قتل کرنے کا نہ تھا، تو رسول اللہ صلی اللہ علیہ وسلم نے وارث سے فرمایا: سنو! اگر یہ سچا ہے اور تم نے اسے قتل کر دیا، تو تم جہنم میں جاؤ گے یہ سن کر اس نے قاتل کو چھوڑ دیا، اس کے دونوں ہاتھ ایک تسمے سے بندھے ہوئے تھے، وہ اپنا تسمہ گھسیٹتا ہوا نکلا، تو اس کا نام ذوالنسعۃ یعنی تسمہ والا پڑ گیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 4499,
			"arabicnumber": 4499,
			"text": "وائل بن حجر رضی اللہ عنہ کہتے ہیں کہ میں نبی اکرم صلی اللہ علیہ وسلم کے پاس تھا کہ اتنے میں ایک قاتل لایا گیا، اس کی گردن میں تسمہ تھا آپ نے مقتول کے وارث کو بلوایا، اور اس سے پوچھا: کیا تم معاف کرو گے؟ اس نے کہا: نہیں، آپ صلی اللہ علیہ وسلم نے فرمایا: تو کیا دیت لو گے؟ اس نے کہا: نہیں، آپ صلی اللہ علیہ وسلم نے فرمایا: تو کیا تم قتل کرو گے؟ اس نے کہا: ہاں، آپ صلی اللہ علیہ وسلم نے فرمایا: اچھا لے جاؤ اسے چنانچہ جب وہ ( اسے لے کر ) چلا تو آپ صلی اللہ علیہ وسلم نے اس سے فرمایا: کیا تم اسے معاف کرو گے؟ اس نے کہا: نہیں، آپ صلی اللہ علیہ وسلم نے فرمایا: کیا تم دیت لو گے؟ اس نے کہا: نہیں، آپ صلی اللہ علیہ وسلم نے فرمایا: کیا تم قتل کرو گے؟ اس نے کہا: ہاں، آپ صلی اللہ علیہ وسلم نے فرمایا: اسے لے جاؤ چوتھی بار میں آپ صلی اللہ علیہ وسلم نے فرمایا: سنو! اگر تم اسے معاف کر دو گے تو یہ اپنا اور مقتول دونوں کا گناہ اپنے سر پر اٹھائے گا یہ سن کر اس نے اسے معاف کر دیا۔ وائل کہتے ہیں: میں نے اسے دیکھا وہ اپنے گلے میں پڑا تسمہ گھسیٹ رہا تھا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 4500,
			"arabicnumber": 4500,
			"text": "اس سند سے بھی علقمہ بن وائل سے اسی مفہوم کی روایت مروی ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 4501,
			"arabicnumber": 4501,
			"text": "وائل بن حجر رضی اللہ عنہ کہتے ہیں کہ ایک شخص ایک حبشی کو لے کر نبی اکرم صلی اللہ علیہ وسلم کے پاس آیا، اور کہنے لگا: اس نے میرے بھتیجے کو قتل کیا ہے، آپ نے اس سے پوچھا: تم نے اسے کیسے قتل کر دیا؟ وہ بولا: میں نے اس کے سر پر کلہاڑی ماری اور وہ مر گیا، میرا ارادہ اس کے قتل کا نہیں تھا، آپ نے پوچھا: کیا تمہارے پاس مال ہے کہ تم اس کی دیت ادا کر سکو اس نے کہا: نہیں، آپ نے فرمایا: بتاؤ اگر میں تمہیں چھوڑ دوں تو کیا تم لوگوں سے مانگ کر اس کی دیت اکٹھی کر سکتے ہو؟ اس نے کہا: نہیں، آپ نے فرمایا: کیا تمہارے مالکان اس کی دیت ادا کر دیں گے؟ اس نے کہا: نہیں، تب آپ نے اس شخص ( مقتول کے وارث ) سے فرمایا: اسے لے جاؤ جب وہ اسے قتل کرنے کے لیے لے کر چلا تو آپ نے فرمایا: اگر یہ اس کو قتل کر دے گا تو اسی کی طرح ہو جائے گا وہ آپ کی بات سن رہا تھا جب اس کے کان میں یہ بات پہنچی تو اس نے کہا: وہ یہ ہے، آپ جو چاہیں اس کے سلسلے میں حکم فرمائیں، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اسے چھوڑ دو، وہ اپنا اور تمہارے بھتیجے کا گناہ لے کر لوٹے گا اور جہنمیوں میں سے ہو گا چنانچہ اس نے اسے چھوڑ دیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 4502,
			"arabicnumber": 4502,
			"text": "ابوامامہ بن سہل کہتے ہیں کہ ہم عثمان رضی اللہ عنہ کے ساتھ تھے، آپ گھر میں محصور تھے، گھر میں داخل ہونے کا ایک راستہ ایسا تھا کہ جو اس میں داخل ہو جاتا وہ باہر سطح زمین پر کھڑے لوگوں کی گفتگو سن سکتا تھا، عثمان اس میں داخل ہوئے اور ہمارے پاس لوٹے تو ان کا رنگ متغیر تھا، کہنے لگے: ان لوگوں نے ابھی ابھی مجھے قتل کرنے کی دھمکی دی ہے، تو ہم نے عرض کیا: امیر المؤمنین! آپ کی ان سے حفاظت کے لیے اللہ کافی ہے، اس پر انہوں نے کہا: آخر یہ مجھے کیوں قتل کرنا چاہتے ہیں؟ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے: تین باتوں کے بغیر کسی مسلمان شخص کا خون حلال نہیں: ایک یہ کہ اسلام لانے کے بعد وہ کفر کا ارتکاب کرے، دوسرے یہ کہ شادی شدہ ہو کر زنا کرے، اور تیسرے یہ کہ ناحق کسی کو قتل کر دے تو اللہ کی قسم! میں نے نہ تو جاہلیت میں، اور نہ اسلام لانے کے بعد کبھی زنا کیا، اور جب سے اللہ نے مجھے ہدایت بخشی ہے میں نے کبھی نہیں چاہا کہ میرا دین اس کے بجائے کوئی اور ہو، اور نہ ہی میں نے کسی کو قتل کیا ہے، تو آخر کس بنیاد پر مجھے یہ قتل کریں گے؟ ۔ ابوداؤد کہتے ہیں: عثمان اور ابوبکر رضی اللہ عنہما نے تو جاہلیت میں بھی شراب سے کنارہ کشی اختیار کر رکھی تھی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 4503,
			"arabicnumber": 4503,
			"text": "زبیر بن عوام اور ان والد عوام رضی اللہ عنہما (یہ دونوں جنگ حنین میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ شریک تھے) سے روایت ہے کہ محلم بن جثامہ لیثی نے اسلام کے زمانے میں قبیلہ اشجع کے ایک شخص کو قتل کر دیا، اور یہی پہلی دیت ہے جس کا فیصلہ رسول اللہ صلی اللہ علیہ وسلم نے کیا، تو عیینہ نے اشجعی کے قتل کے متعلق گفتگو کی اس لیے کہ وہ قبیلہ عطفان سے تھا، اور اقرع بن حابس نے محلم کی جانب سے گفتگو کی اس لیے کہ وہ قبیلہ خندف سے تھا تو آوازیں بلند ہوئیں، اور شور و غل بڑھ گیا، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: عیینہ! کیا تم دیت قبول نہیں کر سکتے؟ عیینہ نے کہا: نہیں، اللہ کی قسم، اس وقت تک نہیں جب تک میں اس کی عورتوں کو وہی رنج و غم نہ پہنچا دوں جو اس نے میری عورتوں کو پہنچایا ہے، پھر آوازیں بلند ہوئیں اور شور و غل بڑھ گیا، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: عیینہ! کیا تم دیت قبول نہیں کر سکتے؟ عیینہ نے پھر اسی طرح کی بات کہی یہاں تک کہ بنی لیث کا ایک شخص کھڑا ہوا جسے مکیتل کہا جاتا تھا، وہ ہتھیار باندھے تھا اور ہاتھ میں سپر لیے ہوئے تھا، اس نے عرض کیا: اللہ کے رسول! شروع اسلام میں اس نے جو غلطی کی ہے، اسے میں یوں سمجھتا ہوں جیسے چند بکریاں چشمے پر آئیں اور ان پر تیر پھینکے جائیں تو پہلے پہل آنے والیوں کو تیر لگے، اور پچھلی انہیں دیکھ کر ہی بھاگ جائیں، آج ایک طریقہ نکالئے اور کل اسے بدل دیجئیے، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: پچاس اونٹ ابھی فوراً دے دو، اور پچاس مدینے لوٹ کر دینا ۔ اور یہ واقعہ ایک سفر کے دوران پیش آیا تھا، محلم لمبا گندمی رنگ کا ایک شخص تھا، وہ لوگوں کے کنارے بیٹھا تھا، آخر کار جب وہ چھوٹ گیا تو رسول اللہ صلی اللہ علیہ وسلم کے سامنے آ بیٹھا، اور اس کی آنکھیں اشک بار تھیں اس نے عرض کیا: اللہ کے رسول! میں نے گناہ کیا ہے جس کی خبر آپ کو پہنچی ہے، اب میں توبہ کرتا ہوں، آپ اللہ سے میری مغفرت کی دعا فرمائیے، اللہ کے رسول! تو رسول اللہ صلی اللہ علیہ وسلم نے بہ آواز بلند فرمایا: کیا تم نے اسے ابتداء اسلام میں اپنے ہتھیار سے قتل کیا ہے، اے اللہ! محلم کو نہ بخشنا ابوسلمہ نے اتنا اضافہ کیا ہے کہ یہ سن کر محلم کھڑا ہوا، وہ اپنی چادر کے کونے سے اپنے آنسو پونچھ رہا تھا، ابن اسحاق کہتے ہیں: محلم کی قوم کا خیال ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے اس کے بعد اس کے لیے مغفرت کی دعا فرمائی۔ ابوداؤد کہتے ہیں: نضر بن شمیل کا کہنا ہے کہ «غير» کے معنی دیت کے ہیں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 4504,
			"arabicnumber": 4504,
			"text": "ابوشریح کعبی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: سنو خزاعہ کے لوگو! تم نے ہذیل کے اس شخص کو قتل کیا ہے، اور میں اس کی دیت دلاؤں گا، میری اس گفتگو کے بعد کوئی قتل کیا گیا تو مقتول کے لوگوں کو دو باتوں کا اختیار ہو گا یا وہ دیت لے لیں یا قتل کر ڈالیں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 4505,
			"arabicnumber": 4505,
			"text": "ابوہریرہ رضی اللہ عنہ کا بیان ہے کہ جب مکہ فتح ہوا تو رسول اللہ صلی اللہ علیہ وسلم کھڑے ہوئے اور آپ نے فرمایا: جس کا کوئی قتل کیا گیا تو اسے اختیار ہے یا تو دیت لے لے، یا قصاص میں قتل کرے یہ سن کر یمن کا ایک شخص کھڑا ہوا جسے ابوشاہ کہا جاتا تھا اور اس نے عرض کیا: اللہ کے رسول! مجھے یہ لکھ دیجئیے ( عباس بن ولید کی روایت «اکتب لی» کے بجائے «اکتبوا لی» یہ صیغۂ جمع ہے ) رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ابو شاہ کے لیے لکھ دو ۔ ابوداؤد کہتے ہیں: «اکتبوا لی» سے مراد نبی اکرم صلی اللہ علیہ وسلم کا خطبہ ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 4506,
			"arabicnumber": 4506,
			"text": "عبداللہ بن عمرو بن العاص رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: کسی کافر کے بدلے مومن کو قتل نہیں کیا جائے گا، اور جو کسی مومن کو دانستہ طور پر قتل کرے گا، وہ مقتول کے وارثین کے حوالے کر دیا جائے گا، وہ چاہیں تو اسے قتل کریں اور چاہیں تو دیت لے لیں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 4507,
			"arabicnumber": 4507,
			"text": "جابر بن عبداللہ رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: میں اسے ہرگز نہیں معاف کروں گا ۱؎ جو دیت لینے کے بعد بھی ( قاتل کو ) قتل کر دے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 4508,
			"arabicnumber": 4508,
			"text": "انس بن مالک رضی اللہ عنہ سے روایت ہے کہ ایک یہودی عورت رسول اللہ صلی اللہ علیہ وسلم کے پاس ایک زہر آلود بکری لے کر آئی، آپ نے اس میں سے کچھ کھا لیا، تو اسے رسول اللہ صلی اللہ علیہ وسلم کے پاس لایا گیا، آپ نے اس سلسلے میں اس سے پوچھا، تو اس نے کہا: میرا ارادہ آپ کو مار ڈالنے کا تھا، آپ نے فرمایا: اللہ تجھے کبھی مجھ پر مسلط نہیں کرے گا صحابہ نے عرض کیا: کیا ہم اسے قتل نہ کر دیں، آپ نے فرمایا: نہیں چنانچہ میں اس کا اثر برابر رسول اللہ صلی اللہ علیہ وسلم کے مسوڑھوں میں دیکھا کرتا تھا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 4509,
			"arabicnumber": 4509,
			"text": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ ایک یہودی عورت نے نبی اکرم صلی اللہ علیہ وسلم کے پاس ایک زہر آلود بکری بھیجی، لیکن آپ نے اس عورت سے کوئی تعرض نہیں کیا۔ ابوداؤد کہتے ہیں: یہ مرحب کی ایک یہودی بہن تھی جس نے نبی اکرم صلی اللہ علیہ وسلم کو زہر دیا تھا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 4510,
			"arabicnumber": 4510,
			"text": "جابر بن عبداللہ رضی اللہ عنہما بیان کرتے تھے کہ خیبر کی ایک یہودی عورت نے بھنی ہوئی بکری میں زہر ملایا، پھر اسے رسول اللہ صلی اللہ علیہ وسلم کو تحفہ میں بھیجا، آپ نے دست کا گوشت لے کر اس میں سے کچھ کھایا، آپ کے ساتھ صحابہ کی ایک جماعت نے بھی کھایا، پھر ان سے آپ نے فرمایا: اپنے ہاتھ روک لو اور آپ نے اس یہودیہ کو بلا بھیجا، اور اس سے سوال کیا: کیا تم نے اس بکری میں زہر ملایا تھا؟ یہودیہ بولی: آپ کو کس نے بتایا؟ آپ نے فرمایا: دست کے اسی گوشت نے مجھے بتایا جو میرے ہاتھ میں ہے وہ بولی: ہاں ( میں نے ملایا تھا ) ، آپ نے پوچھا: اس سے تیرا کیا ارادہ تھا؟ وہ بولی: میں نے سوچا: اگر نبی ہوں گے تو زہر نقصان نہیں پہنچائے گا، اور اگر نہیں ہوں گے تو ہم کو ان سے نجات مل جائے گی، چنانچہ رسول اللہ صلی اللہ علیہ وسلم نے اسے معاف کر دیا، کوئی سزا نہیں دی، اور آپ کے بعض صحابہ جنہوں نے بکری کا گوشت کھایا تھا انتقال کر گئے، رسول اللہ صلی اللہ علیہ وسلم نے بکری کے گوشت کھانے کی وجہ سے اپنے شانوں کے درمیان پچھنے لگوائے، جسے ابوہند نے آپ کو سینگ اور چھری سے لگایا، ابوہند انصار کے قبیلہ بنی بیاضہ کے غلام تھے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 4511,
			"arabicnumber": 4511,
			"text": "ابوسلمہ رضی اللہ عنہ کہتے ہیں کہ خیبر کی ایک یہودی عورت نے رسول اللہ صلی اللہ علیہ وسلم کو بھنی ہوئی بکری تحفہ میں بھیجی، پھر راوی نے ویسے ہی بیان کیا جیسے جابر کی حدیث میں ہے، ابوسلمہ کہتے ہیں: پھر بشر بن براء بن معرور انصاری فوت ہو گئے، تو آپ نے اس یہودی عورت کو بلا بھیجا اور فرمایا: تجھے ایسا کرنے پر کس چیز نے آمادہ کیا تھا؟ پھر راوی نے اسی طرح ذکر کیا جیسے جابر کی حدیث میں ہے رسول اللہ صلی اللہ علیہ وسلم نے اس کے سلسلہ میں حکم دیا: تو وہ قتل کر دی گئی، اور انہوں نے پچھنا لگوانے کا ذکر نہیں کیا ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 4512,
			"arabicnumber": 4512,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ہدیہ قبول فرماتے تھے، اور صدقہ نہیں کھاتے تھے، نیز اسی سند سے ایک اور مقام پر ابوہریرہ کے ذکر کے بغیر صرف ابوسلمہ سے روایت ہے، وہ کہتے ہیں: رسول اللہ صلی اللہ علیہ وسلم ہدیہ قبول فرماتے تھے اور صدقہ نہیں کھاتے تھے، اس میں اتنا اضافہ ہے کہ آپ کو خیبر کی ایک یہودی عورت نے ایک بھنی ہوئی بکری تحفہ میں بھیجی جس میں اس نے زہر ملا رکھا تھا، رسول اللہ صلی اللہ علیہ وسلم نے اس میں سے کھایا اور لوگوں نے بھی کھایا، پھر آپ نے لوگوں سے فرمایا: اپنے ہاتھ روک لو، اس ( گوشت ) نے مجھے بتایا ہے کہ وہ زہر آلود ہے چنانچہ بشر بن براء بن معرور انصاری مر گئے، تو آپ نے اس یہودی عورت کو بلا کر فرمایا: ایسا کرنے پر تجھے کس چیز نے آمادہ کیا؟ وہ بولی: اگر آپ نبی ہیں تو جو میں نے کیا ہے وہ آپ کو نقصان نہیں پہنچا سکتا، اور اگر آپ بادشاہ ہیں تو میں نے لوگوں کو آپ سے نجات دلا دی، چنانچہ رسول اللہ صلی اللہ علیہ وسلم نے حکم دیا تو وہ قتل کر دی گئی، پھر آپ نے اپنی اس تکلیف کے بارے میں فرمایا: جس میں آپ نے وفات پائی کہ میں برابر خیبر کے اس کھانے کے اثر کو محسوس کرتا رہا یہاں تک کہ اب وہ وقت آ گیا کہ اس نے میری شہ رگ کاٹ دی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 4513,
			"arabicnumber": 4513,
			"text": "کعب بن مالک روایت کرتے ہیں کہ ام مبشر رضی اللہ عنہا نے نبی اکرم صلی اللہ علیہ وسلم سے اس مرض میں جس میں آپ نے وفات پائی کہا: اللہ کے رسول! آپ کا شک کس چیز پر ہے؟ میرے بیٹے کے سلسلہ میں میرا شک تو اس زہر آلود بکری پر ہے جو اس نے آپ کے ساتھ خیبر میں کھائی تھی، نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: اپنے سلسلہ میں بھی میرا شک اسی پر ہے، اور اب یہ وقت آ چکا ہے کہ اس نے میری شہ رگ کاٹ دی ہے ۔ ابوداؤد کہتے ہیں: عبدالرزاق نے کبھی اس حدیث کو معمر سے، معمر نے زہری سے، زہری نے نبی اکرم صلی اللہ علیہ وسلم سے مرسلاً روایت کیا ہے اور کبھی معمر نے اسے زہری سے اور، زہری نے عبدالرحمٰن بن کعب بن مالک کے واسطہ سے بیان کیا ہے۔ اور عبدالرزاق نے ذکر کیا ہے کہ معمر اس حدیث کو ان سے کبھی مرسلاً روایت کرتے تو وہ اسے لکھ لیتے اور کبھی مسنداً روایت کرتے تو بھی وہ اسے بھی لکھ لیتے، اور ہمارے نزدیک دونوں صحیح ہے۔ عبدالرزاق کہتے ہیں: جب ابن مبارک معمر کے پاس آئے تو معمر نے وہ تمام حدیثیں جنہیں وہ موقوفاً روایت کرتے تھے ان سے متصلًا روایت کیں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 4514,
			"arabicnumber": 4514,
			"text": "ام مبشر رضی اللہ عنہا سے روایت ہے کہ وہ نبی اکرم صلی اللہ علیہ وسلم کے پاس آئیں پھر راوی نے مخلد بن خالد کی حدیث کا مفہوم اسی طرح ذکر کیا جیسے جابر کی روایت میں ہے، اس میں ہے کہ بشر بن براء بن معرور مر گئے، تو آپ نے یہودی عورت کو بلا بھیجا اور پوچھا: یہ تجھے ایسا کرنے پر کس چیز نے آمادہ کیا تھا؟ پھر راوی نے وہی باتیں ذکر کیں جو جابر کی حدیث میں ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے حکم دیا اور وہ قتل کر دی گئی لیکن انہوں نے پچھنا لگوانے کا ذکر نہیں کیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 4515,
			"arabicnumber": 4515,
			"text": "سمرہ رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جو اپنے غلام کو قتل کرے گا ہم اسے قتل کریں گے، اور جو اس کے اعضاء کاٹے گا ہم اس کے اعضاء کاٹیں گے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 4516,
			"arabicnumber": 4516,
			"text": "اس سند سے بھی قتادہ سے بھی اسی کے مثل حدیث مروی ہے اس میں ہے رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو اپنے غلام کو خصی کرے گا ہم اسے خصی کریں گے اس کے بعد راوی نے اسی طرح ذکر کیا جیسے شعبہ اور حماد کی حدیث میں ہے۔ ابوداؤد کہتے ہیں: اسے ابوداؤد طیالسی نے ہشام سے معاذ کی حدیث کی طرح نقل کیا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 4517,
			"arabicnumber": 4517,
			"text": "اس سند سے بھی قتادہ سے شعبہ کی سند والی روایت کے مثل مروی ہے اس میں اضافہ ہے کہ پھر حسن ( راوی حدیث ) اس حدیث کو بھول گئے چنانچہ وہ کہتے تھے: آزاد غلام کے بدلے قتل نہیں کیا جائے گا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 4518,
			"arabicnumber": 4518,
			"text": "حسن بصری کہتے ہیں آزاد غلام کے بدلے قتل نہیں کیا جائے گا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 4519,
			"arabicnumber": 4519,
			"text": "عبداللہ بن عمرو بن العاص رضی اللہ عنہما کہتے ہیں کہ ایک شخص چیختا چلاتا نبی اکرم صلی اللہ علیہ وسلم کے پاس آیا، اور کہنے لگا: اللہ کے رسول! اس کی ایک لونڈی تھی، آپ نے فرمایا: ستیاناس ہو تمہارا، بتاؤ کیا ہوا؟ اس نے کہا: برا ہوا، میرے آقا کی ایک لونڈی تھی اسے میں نے دیکھ لیا، تو اسے غیرت آئی، اس نے میرا ذکر کٹوا دیا، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اس شخص کو میرے پاس لاؤ تو اسے بلایا گیا، مگر کوئی اسے نہ لا سکا تب آپ نے ( اس غلام سے ) فرمایا: جاؤ تم آزاد ہو اس نے کہا: اللہ کے رسول! میری مدد کون کرے گا؟ آپ نے فرمایا: ہر مومن پر یا کہا: ہر مسلمان پر تیری مدد لازم ہے ۔ ابوداؤد کہتے ہیں: جو آزاد ہوا اس کا نام روح بن دینار تھا، اور جس نے ذکر کاٹا تھا وہ زنباع تھا، یہ زنباع ابوروح ہیں جو غلام کے آقا تھے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 4520,
			"arabicnumber": 4520,
			"text": "سہل بن ابی حثمہ اور رافع بن خدیج رضی اللہ عنہما سے روایت ہے کہ محیصہ بن مسعود اور عبداللہ بن سہل دونوں خیبر کی طرف چلے اور کھجور کے درختوں میں ( چلتے چلتے ) دونوں ایک دوسرے سے علیحدہ ہو گئے، پھر عبداللہ بن سہل قتل کر دیے گئے، تو ان لوگوں نے یہودیوں پر تہمت لگائی، ان کے بھائی عبدالرحمٰن بن سہل اور ان کے چچازاد بھائی حویصہ اور محیصہ اکٹھا ہوئے اور وہ سب نبی اکرم صلی اللہ علیہ وسلم کے پاس آئے، عبدالرحمٰن بن سہل جو ان میں سب سے چھوٹے تھے اپنے بھائی کے معاملے میں بولنے چلے تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: بڑوں کا لحاظ کرو ( اور انہیں گفتگو کا موقع دو ) یا یوں فرمایا: بڑے کو پہلے بولنے دو چنانچہ ان دونوں ( حویصہ اور محیصہ ) نے اپنے عزیز کے سلسلے میں گفتگو کی، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تم میں سے پچاس آدمی یہودیوں کے کسی آدمی پر قسم کھائیں تو اسے رسی سے باندھ کر تمہارے حوالے کر دیا جائے ان لوگوں نے کہا: یہ ایسا معاملہ ہے جسے ہم نے دیکھا نہیں ہے، پھر ہم کیسے قسم کھا لیں؟ آپ نے فرمایا: پھر یہود اپنے پچاس آدمیوں کی قسم کے ذریعہ خود کو تم سے بچا لیں گے وہ بولے: اللہ کے رسول! یہ کافر لوگ ہیں ( ان کی قسموں کا کیا اعتبار؟ ) چنانچہ رسول اللہ صلی اللہ علیہ وسلم نے انہیں اپنی طرف سے دیت دے دی، سہل کہتے ہیں: ایک دن میں ان کے شتر خانے میں گیا، تو ان اونٹوں میں سے ایک اونٹنی نے مجھے لات مار دی، حماد نے یہی کہا یا اس جیسی کوئی بات کہی۔ ابوداؤد کہتے ہیں: اسے بشر بن مفضل اور مالک نے یحییٰ بن سعید سے روایت کیا ہے اس میں ہے: کیا تم پچاس قسمیں کھا کر اپنے ساتھی کے خون، یا اپنے قاتل کے مستحق ہوتے ہو؟ البتہ بشر نے لفظ دم یعنی خون کا ذکر نہیں کیا ہے، اور عبدہ نے یحییٰ سے اسی طرح روایت کی ہے جیسے حماد نے کی ہے، اور اسے ابن عیینہ نے یحییٰ سے روایت کیا ہے، تو انہوں نے ابتداء «تبرئكم يهود بخمسين يمينا يحلفون» سے کی ہے اور استحقاق کا ذکر انہوں نے نہیں کیا ہے۔ ابوداؤد کہتے ہیں: یہ ابن عیینہ کا وہم ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 4521,
			"arabicnumber": 4521,
			"text": "سہل بن ابی حثمہ انصاری رضی اللہ عنہ اور ان کے قبیلہ کے کچھ بڑوں سے روایت ہے کہ عبداللہ بن سہل اور محیصہ رضی اللہ عنہما کسی پریشانی کی وجہ سے جس سے وہ دو چار ہوئے خیبر کی طرف نکلے پھر کسی نے آ کر محیصہ کو خبر دی کہ عبداللہ بن سہل مار ڈالے گئے اور انہیں کسی کنویں یا چشمے میں ڈال دیا گیا، وہ ( محیصہ ) یہود کے پاس آئے اور کہنے لگے: قسم اللہ کی! تم نے ہی انہیں قتل کیا ہے، وہ بولے: اللہ کی قسم ہم نے انہیں قتل نہیں کیا ہے، پھر وہ اپنی قوم کے پاس آئے اور ان سے اس کا ذکر کیا، پھر وہ، ان کے بڑے بھائی حویصہ اور عبدالرحمٰن بن سہل تینوں ( رسول اللہ صلی اللہ علیہ وسلم کے پاس ) آئے، محیصہ نے واقعہ بیان کرنا شروع کیا کیونکہ وہی خیبر میں ساتھ تھے، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: بڑوں کو بڑائی دو آپ کی مراد عمر میں بڑائی سے تھی چنانچہ حویصہ نے گفتگو کی، پھر محیصہ نے تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: یا تو یہ لوگ تمہارے آدمی کی دیت دیں، یا لڑائی کے لیے تیار ہو جائیں پھر آپ نے اس سلسلے میں انہیں خط لکھا تو انہوں نے اس کا جواب لکھا کہ اللہ کی قسم! ہم نے انہیں قتل نہیں کیا ہے، تو آپ نے حویصہ، محیصہ اور عبدالرحمٰن سے پوچھا: کیا تم قسم کھاؤ گے کہ اپنے بھائی کے خون کا مستحق بن سکو؟ انہوں نے کہا: نہیں، اس پر آپ نے فرمایا: تو پھر یہود تمہارے لیے قسم کھائیں گے اس پر وہ کہنے لگے: وہ تو مسلمان نہیں ہیں، چنانچہ رسول اللہ صلی اللہ علیہ وسلم نے خود اپنے پاس سے ان کی دیت ادا کر دی، اور سو اونٹ بھیج دیے گئے یہاں تک کہ وہ ان کے مکان میں داخل کر دیے گئے، سہل کہتے ہیں: انہیں میں سے ایک سرخ اونٹنی نے مجھے لات ماری ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 4522,
			"arabicnumber": 4522,
			"text": "عمرو بن شعیب رسول اللہ صلی اللہ علیہ وسلم سے روایت کرتے ہیں کہ آپ نے قسامہ سے بنی نصر بن مالک کے ایک آدمی کو بحرۃالرغاء ۱؎میں لیۃالبحرہ ۲؎ کے کنارے پر قتل کیا، راوی کہتے ہیں: قاتل اور مقتول دونوں بنی نصر کے تھے، «ببحرة الرغاء على شطر لية البحر»کے یہ الفاظ محمود کے ہیں اور محمود اس حدیث کے سلسلہ میں سب سے زیادہ درست آدمی ہیں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 4523,
			"arabicnumber": 4523,
			"text": "بشیر بن یسار سے روایت ہے کہ سہل بن ابی حثمہ نامی ایک انصاری ان سے بیان کیا کہ ان کی قوم کے چند آدمی خیبر گئے، وہاں پہنچ کر وہ جدا ہو گئے، پھر اپنے میں سے ایک شخص کو مقتول پایا تو جن کے پاس اسے پایا ان سے ان لوگوں نے کہا: تم لوگوں نے ہی ہمارے ساتھی کو قتل کیا ہے، وہ کہنے لگے: ہم نے قتل نہیں کیا ہے اور نہ ہی ہمیں قاتل کا پتا ہے چنانچہ ہم لوگ اللہ کے نبی اکرم صلی اللہ علیہ وسلم کے پاس گئے، تو آپ نے ان سے فرمایا: تم اس پر گواہ لے کر آؤ کہ کس نے اسے مارا ہے؟ انہوں نے کہا: ہمارے پاس گواہ نہیں ہے، اس پر آپ نے فرمایا: پھر وہ یعنی یہود تمہارے لیے قسم کھائیں گے وہ کہنے لگے: ہم یہودیوں کی قسموں پر راضی نہیں ہوں گے، پھر آپ کو یہ بات اچھی نہیں لگی کہ اس کا خون ضائع ہو جائے چنانچہ آپ نے اس کی دیت زکوٰۃ کے اونٹوں میں سے سو اونٹ خود دے دی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 4524,
			"arabicnumber": 4524,
			"text": "رافع بن خدیج رضی اللہ عنہ کہتے ہیں کہ انصار کا ایک آدمی خیبر میں قتل کر دیا گیا، تو اس کے وارثین نبی اکرم صلی اللہ علیہ وسلم کے پاس گئے اور آپ سے اس کا ذکر کیا، آپ نے پوچھا: کیا تمہارے پاس دو گواہ ہیں جو تمہارے ساتھی کے مقتول ہو جانے کی گواہی دیں؟ انہوں نے عرض کیا: اللہ کے رسول! وہاں پر تو مسلمانوں میں سے کوئی نہیں تھا، وہ تو سب کے سب یہودی ہیں اور وہ اس سے بڑے جرم کی بھی جرات کر لیتے ہیں، آپ صلی اللہ علیہ وسلم نے فرمایا: تو ان میں پچاس افراد منتخب کر کے ان سے قسم لے لو لیکن وہ اس پر راضی نہیں ہوئے، تو آپ نے اپنے پاس سے اس کی دیت ادا کی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 4525,
			"arabicnumber": 4525,
			"text": "عبدالرحمٰن بن بجید کہتے ہیں کہ اللہ کی قسم، سہل کو اس حدیث میں وہم ہو گیا ہے، واقعہ یوں ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے یہود کو لکھا کہ تمہارے بیچ ایک مقتول ملا ہے تو تم اس کی دیت ادا کرو، تو انہوں نے جواب میں لکھا: ہم اللہ کی پچاس قسمیں کھا کر کہتے ہیں کہ ہم نے اسے قتل نہیں کیا، اور نہ ہمیں اس کے قاتل کا پتا ہے، وہ کہتے ہیں: اس پر اس کی دیت رسول اللہ صلی اللہ علیہ وسلم نے اپنے پاس سے سو اونٹ ( خود ) ادا کی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Munqar"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Munqar"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Munqar"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 4526,
			"arabicnumber": 4526,
			"text": "انصار کے کچھ لوگوں سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے پہلے یہود سے کہا: تم میں سے پچاس لوگ قسم کھائیں تو انہوں نے انکار کیا، پھر رسول اللہ صلی اللہ علیہ وسلم نے انصار سے کہا: تم اپنا حق ثابت کرو انہوں نے کہا: اللہ کے رسول! ہم ایسی بات پر قسم کھائیں جسے ہم نے دیکھا نہیں ہے؟ چنانچہ رسول اللہ صلی اللہ علیہ وسلم نے ان کی دیت یہود سے دلوائی اس لیے کہ وہ انہیں کے درمیان پایا گیا تھا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 4527,
			"arabicnumber": 4527,
			"text": "انس رضی اللہ عنہ سے روایت ہے کہ ایک لونڈی ملی جس کا سر دو پتھروں کے درمیان کچل دیا گیا تھا، اس سے پوچھا گیا: کس نے تیرے ساتھ یہ کیا ہے؟ کیا فلاں نے؟ کیا فلاں نے؟ یہاں تک کہ ایک یہودی کا نام لیا گیا تو اس نے اپنے سر کے اشارہ سے کہا: ہاں، اس پر اس یہودی کو پکڑا گیا، تو اس نے اعتراف کیا، چنانچہ رسول اللہ صلی اللہ علیہ وسلم نے حکم دیا کہ اس کا سر بھی پتھر سے کچل دیا جائے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 4528,
			"arabicnumber": 4528,
			"text": "انس رضی اللہ عنہ سے روایت ہے کہ ایک یہودی نے انصار کی ایک لونڈی کو اس کے زیور کی وجہ سے قتل کر دیا، پھر اسے ایک کنوئیں میں ڈال کر اس کا سر پتھر سے کچل دیا، تو اسے پکڑ کر نبی اکرم صلی اللہ علیہ وسلم کے پاس لایا گیا تو آپ نے اس کے متعلق حکم دیا کہ اسے رجم کر دیا جائے یہاں تک کہ وہ مر جائے تو اسے رجم کر دیا گیا یہاں تک کہ وہ مر گیا۔ ابوداؤد کہتے ہیں: اسے ابن جریج نے ایوب سے اسی طرح روایت کیا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 4529,
			"arabicnumber": 4529,
			"text": "انس رضی اللہ عنہ سے روایت ہے کہ ایک لونڈی اپنے زیور پہنے ہوئی تھی اس کے سر کو ایک یہودی نے پتھر سے کچل دیا تو رسول اللہ صلی اللہ علیہ وسلم اس کے پاس تشریف لائے، ابھی اس میں جان باقی تھی، آپ نے اس سے پوچھا: تجھے کس نے قتل کیا ہے؟ فلاں نے تجھے قتل کیا ہے؟ اس نے اپنے سر کے اشارے سے کہا: نہیں، آپ صلی اللہ علیہ وسلم نے پھر پوچھا: تجھے کس نے قتل کیا؟ فلاں نے قتل کیا ہے؟ اس نے پھر سر کے اشارے سے کہا: نہیں، آپ صلی اللہ علیہ وسلم نے پھر پوچھا: کیا فلاں نے کیا ہے؟ اس نے سر کے اشارہ سے کہا: ہاں، اس پر رسول اللہ صلی اللہ علیہ وسلم نے حکم دیا، تو اسے دو پتھروں کے درمیان ( کچل کر ) مار ڈالا گیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 4530,
			"arabicnumber": 4530,
			"text": "قیس بن عباد سے کہتے ہیں کہ میں اور اشتر دونوں علی رضی اللہ عنہ کے پاس آئے اور ہم نے کہا: کیا رسول اللہ صلی اللہ علیہ وسلم نے آپ کو کوئی خاص بات بتائی ہے جو عام لوگوں کو نہ بتائی ہو؟ وہ بولے: نہیں، سوائے اس چیز کے جو میری اس کتاب میں ہے۔ مسدد کہتے ہیں: پھر انہوں نے ایک کتاب نکالی، احمد کے الفاظ یوں ہیں اپنی تلوار کے غلاف سے ایک کتاب ( نکالی ) اس میں یہ لکھا تھا: سب مسلمانوں کا خون برابر ہے اور وہ غیروں کے مقابل ( باہمی نصرت و معاونت میں ) گویا ایک ہاتھ ہیں، اور ان میں کا ایک ادنی بھی ان کے امان کا پاس و لحاظ رکھے گا ۱؎، آگاہ رہو! کہ کوئی مومن کسی کافر کے بدلے قتل نہیں کیا جائے گا، اور نہ ہی کوئی ذمی معاہد جب تک وہ معاہد ہے قتل کیا جائے گا، اور جو شخص کوئی نئی بات نکالے گا تو اس کی ذمے داری اسی کے اوپر ہو گی، اور جو نئی بات نکالے گا، یا نئی بات نکالنے والے کسی شخص ( بدعتی ) کو پناہ دے گا تو اس پر اللہ کی فرشتوں کی اور تمام لوگوں کی لعنت ہے۔ مسدد کہتے ہیں: ابن ابی عروبہ سے منقول ہے کہ انہوں نے ایک کتاب نکالی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 4531,
			"arabicnumber": 4531,
			"text": "عبداللہ بن عمرو بن العاص رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: … پھر راوی نے علی رضی اللہ عنہ کی حدیث کی طرح ذکر کیا البتہ اس میں اتنا اضافہ ہے کہ ان کا ادنی شخص بھی امان دے سکتا ہے اور مال غنیمت میں عمدہ جانور اور کمزور جانور والے دونوں برابر ہیں، جو لشکر سے باہر نکلے اور لڑے اور وہ جو لشکر میں بیٹھا رے دونوں برابر ہیں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 4532,
			"arabicnumber": 4532,
			"text": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ سعد بن عبادہ رضی اللہ عنہ نے کہا: اللہ کے رسول! اگر کوئی شخص اپنی بیوی کے ساتھ کسی مرد کو پائے تو کیا اسے قتل کر دے؟ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: نہیں سعد نے کہا: کیوں نہیں، اللہ کے رسول! قسم ہے اس ذات کی جس نے آپ کو حق کے ساتھ عزت دی ( میں تو اسے قتل کر دوں گا ) نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: سنو! جو تمہارے سردار کہہ رہے ہیں ( عبدالوہاب کے الفاظ ہیں، ( سنو ) جو سعد کہہ رہے ہیں ) ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 4533,
			"arabicnumber": 4533,
			"text": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ سعد بن عبادہ رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے عرض کیا: بتائیے اگر میں اپنی بیوی کے ساتھ کسی مرد کو پاؤں تو کیا چار گواہ لانے تک اسے مہلت دوں؟ آپ نے فرمایا: ہاں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 4534,
			"arabicnumber": 4534,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں نبی اکرم صلی اللہ علیہ وسلم نے ابوجہم بن حذیفہ کو زکاۃ وصول کرنے کے لیے بھیجا، ایک شخص نے اپنی زکاۃ کے سلسلہ میں ان سے جھگڑا کر لیا، ابوجہم نے اسے مارا تو اس کا سر زخمی ہو گیا، تو لوگ نبی اکرم صلی اللہ علیہ وسلم کے پاس آئے اور کہا: اللہ کے رسول! قصاص دلوائیے، اس پر آپ نے ان سے فرمایا: تم اتنا اور اتنا لے لو لیکن وہ لوگ راضی نہیں ہوئے، تو آپ نے فرمایا: اچھا اتنا اور اتنا لے لو وہ اس پر بھی راضی نہیں ہوئے تو آپ نے فرمایا: اچھا اتنا اور اتنا لے لو اس پر وہ رضامند ہو گئے پھر نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: آج شام کو میں لوگوں کے سامنے خطبہ دوں گا اور انہیں تمہاری رضا مندی کی خبر دوں گا لوگوں نے کہا: ٹھیک ہے، چنانچہ رسول اللہ صلی اللہ علیہ وسلم نے خطبہ دیا، اور فرمایا: قبیلہ لیث کے یہ لوگ قصاص کے ارادے سے میرے پاس آئے ہیں تو میں نے ان کو اتنا اور اتنا مال پیش کیا اس پر یہ راضی ہو گئے ہیں ( پھر آپ نے انہیں مخاطب کر کے پوچھا: ) بتاؤ کیا تم لوگ راضی ہو؟ انہوں نے کہا: نہیں، تو مہاجرین ان پر جھپٹے تو رسول اللہ صلی اللہ علیہ وسلم نے انہیں ان سے باز رہنے کا حکم دیا، چنانچہ وہ رک گئے، پھر آپ نے انہیں بلایا، اور کچھ اضافہ کیا پھر پوچھا: کیا اب تم راضی ہو؟ انہوں نے کہا: ہاں، آپ نے فرمایا: میں لوگوں کو خطاب کروں گا، اور انہیں تمہاری رضا مندی کے بارے میں بتاؤں گا لوگوں نے کہا: ٹھیک ہے، چنانچہ نبی اکرم صلی اللہ علیہ وسلم نے خطاب کیا، اور پوچھا: کیا تم راضی ہو؟ وہ بولے: ہاں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 4535,
			"arabicnumber": 4535,
			"text": "انس رضی اللہ عنہ کہتے ہیں کہ ایک لڑکی ملی جس کا سر دو پتھروں کے درمیان کچل دیا گیا تھا، اس سے پوچھا گیا: تمہارے ساتھ یہ کس نے کیا؟ کیا فلاں نے؟ کیا فلاں نے؟ یہاں تک کہ ایک یہودی کا نام لیا گیا، تو اس نے اپنے سر کے اشارہ سے کہا: ہاں، چنانچہ اس یہودی کو پکڑا گیا، اس نے اقبال جرم کر لیا تو نبی اکرم صلی اللہ علیہ وسلم نے حکم دیا کہ اس کا سر پتھر سے کچل دیا جائے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 4536,
			"arabicnumber": 4536,
			"text": "ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کچھ تقسیم کر رہے تھے کہ اسی دوران ایک شخص آیا اور آپ کے اوپر جھک گیا تو اس کے چہرے پر خراش آ گئی تو آپ نے ایک لکڑی جو آپ کے پاس تھی اسے چبھو دی، رسول اللہ صلی اللہ علیہ وسلم نے اس سے فرمایا: آؤ قصاص لے لو ۱؎ وہ بولا: اللہ کے رسول! میں نے معاف کر دیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 4537,
			"arabicnumber": 4537,
			"text": "ابوفراس کہتے ہیں کہ عمر بن خطاب رضی اللہ عنہ نے ہم سے خطاب کیا اور کہا: میں نے اپنے گورنر اس لیے نہیں بھیجے کہ وہ تمہاری کھالوں پہ ماریں، اور نہ اس لیے کہ وہ تمہارے مال لیں، لہٰذا اگر کسی کے ساتھ ایسا سلوک ہو تو وہ اسے مجھ تک پہنچائے، میں اس سے اسے قصاص دلواؤں گا عمرو بن العاص رضی اللہ عنہ نے کہا: اگر کوئی شخص اپنی رعیت کو تادیباً سزا دے تو اس پر بھی آپ اس سے قصاص لیں گے، وہ بولے: ہاں، قسم ہے اس ذات کی جس کے ہاتھ میں میری جان ہے! میں اس سے قصاص لوں گا میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا کہ آپ نے اپنی ذات سے قصاص دلایا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 4538,
			"arabicnumber": 4538,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: لڑنے والوں پر لازم ہے کہ وہ قصاص لینے سے باز رہیں، پہلے جو سب سے قریبی ہے وہ معاف کرے، پھر اس کے بعد والے خواہ وہ عورت ہی ہو ۔ ابوداؤد کہتے ہیں: مجھے یہ بات معلوم ہوئی ہے کہ عورتوں کا قتل کے سلسلے میں قصاص معاف کر دینا جائز ہے جب وہ مقتول کے اولیاء میں سے ہوں، اور مجھے ابو عبید کے واسطے سے یہ بات پہنچی ہے کہ آپ کے قول «ينحجزوا» کے معنی قصاص سے باز رہنے کے ہیں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 4539,
			"arabicnumber": 4539,
			"text": "طاؤس کہتے ہیں کہ جو مارا جائے، اور ابن عبید کی روایت میں ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو کوئی کسی لڑائی یا دنگے میں جو لوگوں میں چھڑ گئی ہو غیر معروف پتھر، کوڑے، یا لاٹھی سے مارا جائے ۱؎ تو وہ قتل خطا ہے، اور اس کی دیت قتل خطا کی دیت ہو گی، اور جو قصداً مارا جائے تو اس میں قصاص ہے ( البتہ ابن عبید کی روایت میں ہے کہ ) اس میں ہاتھ کا قصاص ہے، ۲؎ ( پھر دونوں کی روایت ایک ہے کہ ) جو کوئی اس کے بیچ بچاؤ میں پڑے ۳؎ تو اس پر اللہ کی لعنت، اور اس کا غضب ہو، اس کی نہ توبہ قبول ہو گی اور نہ فدیہ، یا اس کے فرض قبول ہوں گے نہ نفل اور سفیان کی حدیث زیادہ کامل ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 4540,
			"arabicnumber": 4540,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا، آگے راوی نے سفیان کی حدیث کے ہم معنی حدیث ذکر کی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 4541,
			"arabicnumber": 4541,
			"text": "عبداللہ بن عمرو بن العاص رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فیصلہ فرمایا: جو غلطی سے مارا گیا تو اس کی دیت سو اونٹ ہے تیس بنت مخاض ۱؎ تیس بنت لبون ۲؎ تیس حقے ۳؎ اور دس نر اونٹ جو دو برس کے ہو چکے ہوں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 4542,
			"arabicnumber": 4542,
			"text": "عبداللہ بن عمرو بن العاص رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں دیت کی قیمت ۱؎ آٹھ سو دینار، یا آٹھ ہزار درہم تھی، اور اہل کتاب کی دیت اس وقت مسلمانوں کی دیت کی آدھی تھی، پھر اسی طرح حکم چلتا رہا، یہاں تک کہ عمر رضی اللہ عنہ خلیفہ ہوئے تو آپ نے کھڑے ہو کر خطبہ دیا، اور فرمایا: سنو، اونٹوں کی قیمت بڑھ گئی ہے، تو عمر رضی اللہ عنہ نے سونے والوں پر ایک ہزار دینار، اور چاندی والوں پر بارہ ہزار ( درہم ) دیت ٹھہرائی، اور گائے بیل والوں پر دو سو گائیں، اور بکری والوں پر دو ہزار بکریاں، اور کپڑے والوں پر دو سو جوڑوں کی دیت مقرر کی، اور ذمیوں کی دیت چھوڑ دی، ان کی دیت میں ( مسلمانوں کی دیت کی طرح ) اضافہ نہیں کیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 4543,
			"arabicnumber": 4543,
			"text": "عطا بن ابی رباح سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے دیت کے سلسلے میں فیصلہ فرمایا کہ اونٹ والوں پر سو اونٹ، گائے بیل والوں پر دو سو گائیں، بکری والوں پر دو ہزار بکریاں، اور کپڑے والوں پر دو سو جوڑے کپڑے، اور گیہوں والوں پر بھی کچھ مقرر کیا جو محمد ( محمد بن اسحاق ) کو یاد نہیں رہا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 4544,
			"arabicnumber": 4544,
			"text": "جابر بن عبداللہ رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے مقرر کیا پھر راوی نے ایسے ہی ذکر کیا جیسے موسیٰ کی روایت میں ہے البتہ اس میں اس طرح ہے کہ طَعام والوں پر کچھ مقرر کیا جو کہ مجھ کو یاد نہیں رہا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 4545,
			"arabicnumber": 4545,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: قتل خطا کی دیت میں بیس حقے، بیس جزعے، بیس بنت مخاض، بیس بنت لبون اور بیس ابن مخاض ہیں اور یہی عبداللہ بن مسعود کا قول ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 4546,
			"arabicnumber": 4546,
			"text": "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ بنی عدی کے ایک شخص کو قتل کر دیا گیا، تو رسول اللہ صلی اللہ علیہ وسلم نے اس کی دیت بارہ ہزار ٹھہرائی۔ ابوداؤد کہتے ہیں: اسے ابن عیینہ نے عمرو سے، عمرو نے عکرمہ سے اور عکرمہ نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کیا ہے اور اس میں انہوں نے ابن عباس کا ذکر نہیں کیا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 4547,
			"arabicnumber": 4547,
			"text": "عبداللہ بن عمرو رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے ( مسدد کی روایت کے مطابق ) فتح مکہ کے دن مکہ میں خطبہ دیا، آپ نے تین بار اللہ اکبر کہا، پھر فرمایا: «لا إله إلا الله وحده صدق وعده ونصر عبده وهزم الأحزاب وحده» اللہ کے سوا کوئی عبادت کے لائق نہیں، وہ تنہا ہے، اس نے اپنا وعدہ سچ کر دکھایا، اپنے بندے کی مدد کی، اور تنہا لشکروں کو شکست دی ( یہاں تک کہ حدیث مجھ سے صرف مسدد نے بیان کی ہے صرف انہیں کے واسطہ سے میں نے اسے یاد کیا ہے اور اس کے بعد سے اخیر حدیث تک سلیمان اور مسدد دونوں نے مجھ سے بیان کیا ہے آگے یوں ہے ) سنو! وہ تمام فضیلتیں جو جاہلیت میں بیان کی جاتی تھیں اور خون یا مال کے جتنے دعوے کئے جاتے تھے وہ سب میرے پاؤں تلے ہیں ( یعنی لغو اور باطل ہیں ) سوائے حاجیوں کو پانی پلانے اور بیت اللہ کی خدمت کے ( یہ اب بھی ان کے ہی سپرد رہے گی جن کے سپر د پہلے تھی پھر فرمایا: سنو! قتل خطا یعنی قتل شبہ عمد کوڑے یا لاٹھی سے ہونے کی دیت سو اونٹ ہے جن میں چالیس اونٹنیاں ایسی ہوں گی جن کے پیٹ میں بچے ہوں ( اور مسدد والی روایت زیادہ کامل ہے ) ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 4548,
			"arabicnumber": 4548,
			"text": "اس سند سے بھی اسی مفہوم کی حدیث مروی ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 4549,
			"arabicnumber": 4549,
			"text": "عبداللہ بن عمر رضی اللہ عنہما نبی اکرم صلی اللہ علیہ وسلم سے اسی مفہوم کی حدیث روایت کرتے ہیں اس میں ہے: رسول اللہ صلی اللہ علیہ وسلم نے فتح کے دن یا فتح مکہ کے دن بیت اللہ یا کعبہ کی سیڑھی پر خطبہ دیا ۔ ابوداؤد کہتے ہیں: اسے ابن عیینہ نے بھی اسی طرح علی بن زید سے، علی بن زید نے قاسم بن ربیعہ سے، قاسم نے ابن عمر سے اور ابن عمر نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہے، اور اسے ایوب سختیانی نے قاسم بن ربیعہ سے، قاسم نے عبداللہ بن عمرو رضی اللہ عنہما سے خالد کی حدیث کے مثل روایت کی ہے۔ نیز اسے حماد بن سلمہ نے علی بن زید سے، علی بن زید نے یعقوب سدوسی سے، سدوسی نے عبداللہ بن عمرو سے، اور عبداللہ بن عمرو نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کیا ہے، اور زید اور ابوموسیٰ کا قول نبی اکرم صلی اللہ علیہ وسلم کی حدیث اور عمر رضی اللہ عنہ کی حدیث کے مثل ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 4550,
			"arabicnumber": 4550,
			"text": "مجاہد کہتے ہیں عمر نے قتل شبہ عمد میں تیس حقہ، تیس جزعہ، چالیس گابھن اونٹنیوں ( جو چھ برس سے نو برس تک کی ہوں ) کی دیت کا فیصلہ کیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 4551,
			"arabicnumber": 4551,
			"text": "علی رضی اللہ عنہ کہتے ہیں شبہ عمد کی دیت میں تین قسم کے اونٹ ہوں گے، تینتیس حقہ، تینتیس جذعہ اور چونتیس ایسی اونٹنیاں جو چھ برس سے لے کر نو برس تک کی ہوں اور سب گابھن ہوں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 4552,
			"arabicnumber": 4552,
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 4553,
			"arabicnumber": 4553,
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 4554,
			"arabicnumber": 4554,
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 4555,
			"arabicnumber": 4555,
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 4556,
			"arabicnumber": 4556,
			"text": "ابوموسیٰ رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: انگلیاں سب برابر ہیں، ان کی دیت دس دس اونٹ ہیں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 4557,
			"arabicnumber": 4557,
			"text": "ابوموسیٰ اشعری رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: انگلیاں تمام برابر ہیں میں نے عرض کیا، کیا ہر انگلی کی دیت دس دس اونٹ ہے؟ آپ نے فرمایا: ہاں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 4558,
			"arabicnumber": 4558,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: یہ اور یہ برابر ہیں یعنی انگوٹھا اور چھنگلی ( کانی انگلی ) ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 4559,
			"arabicnumber": 4559,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: انگلیاں سب برابر ہیں، دانت سب برابر ہیں، سامنے کے دانت ہوں، یا ڈاڑھ کے سب برابر ہیں، یہ بھی برابر اور وہ بھی برابر ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 4560,
			"arabicnumber": 4560,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: دانت سب برابر ہیں اور انگلیاں سب برابر ہیں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 4561,
			"arabicnumber": 4561,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے دونوں ہاتھ اور دونوں پیر کی انگلیوں کو برابر قرار دیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 4562,
			"arabicnumber": 4562,
			"text": "عبداللہ بن عمرو بن العاص رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے اپنے خطبے میں جبکہ آپ اپنی پیٹھ کعبہ سے ٹیکے ہوئے تھے فرمایا: انگلیوں میں دس دس اونٹ ہیں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 4563,
			"arabicnumber": 4563,
			"text": "عبداللہ بن عمرو بن العاص رضی اللہ عنہما سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم کرم صلی اللہ علیہ وسلم نے فرمایا: دانتوں میں پانچ پانچ ( اونٹ ) ہیں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 4564,
			"arabicnumber": 4564,
			"text": "عبداللہ بن عمرو بن العاص رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم گاؤں والوں پر قتل خطا کی دیت کی قیمت چار سو دینار، یا اس کے برابر چاندی سے لگایا کرتے تھے، اور اس کی قیمت اونٹوں کی قیمتوں پر لگاتے، جب وہ مہنگے ہو جاتے تو آپ اس کی قیمت میں بھی اضافہ کر دیتے، اور جب وہ سستے ہوتے تو آپ اس کی قیمت بھی گھٹا دیتے، رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں یہ قیمت چار سو دینار سے لے کر آٹھ سو دینار تک پہنچی، اور اسی کے برابر چاندی سے ( دیت کی قیمت ) آٹھ ہزار درہم پہنچی، اور رسول اللہ صلی اللہ علیہ وسلم نے گائے بیل والوں پر ( دیت میں ) دو سو گایوں کا فیصلہ کیا، اور بکری والوں پر دو ہزار بکریوں کا۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: دیت کا مال مقتول کے وارثین کے درمیان ان کی قرابت کے مطابق تقسیم ہو گا، اب اگر اس سے کچھ بچ رہے تو وہ عصبہ کا ہے ۔ رسول اللہ صلی اللہ علیہ وسلم نے ناک کے سلسلے میں فیصلہ کیا کہ اگر وہ کاٹ دی جائے تو پوری دیت لازم ہو گی۔ اور اگر اس کا بانسہ ( دونوں نتھنوں کے بیچ کی ہڈی ) کاٹا گیا ہو تو آدھی دیت لازم ہو گی، یعنی پچاس اونٹ یا اس کے برابر سونا یا چاندی، یا سو گائیں، یا ایک ہزار بکریاں۔ اور ہاتھ جب کاٹا گیا ہو تو اس میں آدھی لازم ہو گی، پیر میں بھی آدھی دیت ہو گی۔ اور مامومہ ۱؎ میں ایک تہائی دیت ہو گی، تینتیس اونٹ اور ایک اونٹ کا تہائی یا اس کی قیمت کے برابر سونا، چاندی، گائے یا بکری اور جائفہ ۲؎ میں بھی یہی دیت ہے۔ اور انگلیوں میں ہر انگلی میں دس اونٹ اور دانتوں میں ہر دانت میں پانچ اونٹ کی دیت ہو گی۔ رسول اللہ صلی اللہ علیہ وسلم نے فیصلہ فرمایا: عورت کی جنایت کی دیت اس کے عصبات میں تقسیم ہو گی ( یعنی عورت اگر کوئی جنایت کرے تو اس کے عصبات کو دینا پڑے گا ) یعنی ان لوگوں کو جو ذوی الفروض سے بچا ہوا مال لے لیتے ہیں ( جیسے بیٹا، چچا، باپ، بھائی وغیرہ ) اور اگر وہ قتل کر دی گئی ہو تو اس کی دیت اس کے وارثوں میں تقسیم ہو گی ( نہ کہ عصبات میں ) اور وہی اپنے قاتل کو قتل کریں گے ( اگر قصاص لینا ہو ) ۔ اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: قاتل کے لیے کچھ بھی نہیں، اور اگر اس کا کوئی وارث نہ ہو تو اس کا وارث سب سے قریبی رشتے دار ہو گا لیکن قاتل کسی چیز کا وارث نہ ہو گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 4565,
			"arabicnumber": 4565,
			"text": "عبداللہ بن عمرو بن عاص رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: شبہ عمد کی دیت عمد کی دیت کی طرح سخت ہے، البتہ اس کے قاتل کو قتل نہیں کیا جائے گا ۔ خلیل کی محمد بن راشد سے روایت میں یہ اضافہ ہے یہ ( قتل شبہ عمد ) لوگوں کے درمیان ایک شیطانی فساد ہے کہ بلا کسی کینے اور بغیر ہتھیار اٹھائے خون ہو جاتا ہے اور قاتل کا پتا نہیں چلتا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 4566,
			"arabicnumber": 4566,
			"text": "عبداللہ بن عمرو رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: «مواضح» ۱؎ میں دیت پانچ اونٹ ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 4567,
			"arabicnumber": 4567,
			"text": "عبداللہ بن عمرو بن العاص رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ایسی آنکھ میں جو اپنی جگہ باقی رہے لیکن بینائی جاتی رہے، تہائی دیت کا فیصلہ فرمایا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 4568,
			"arabicnumber": 4568,
			"text": "مغیرہ بن شعبہ رضی اللہ عنہ سے روایت ہے کہ قبیلہ ہذیل کے ایک شخص کی دو بیویاں تھیں ان میں سے ایک نے دوسری کو لکڑی سے مار کر اسے اور اس کے پیٹ کے بچے کو قتل کر دیا، وہ لوگ جھگڑا لے کر رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے تو ان میں سے ایک شخص نے کہا: ہم اس کی دیت کیوں کر ادا کریں جو نہ رویا، نہ کھایا، نہ پیا، اور نہ ہی چلایا، ( اس نے یہ بات مقفّٰی عبارت میں کہی ) آپ صلی اللہ علیہ وسلم نے فرمایا: کیا تم دیہاتیوں کی طرح مقفّی و مسجّع عبارت بولتے ہو؟ تو آپ صلی اللہ علیہ وسلم نے اس میں ایک غرہ ( لونڈی یا غلام ) کی دیت کا فیصلہ کیا، اور اسے عورت کے عاقلہ ( وارثین ) کے ذمہ ٹھہرایا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 4569,
			"arabicnumber": 4569,
			"text": "اس سند سے منصور سے اسی طرح کی حدیث مروی ہے، اور اس میں اتنا اضافہ ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے مقتول عورت کی دیت قاتل عورت کے عصبات پر ٹھہرائی، اور پیٹ کے بچے کے لیے ایک غرہ ( غلام یا لونڈی ) ٹھہرایا۔ ابوداؤد کہتے ہیں: اسے اسی طرح حکم نے مجاہد سے مجاہد نے مغیرہ سے روایت کیا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 4570,
			"arabicnumber": 4570,
			"text": "مسور بن مخرمہ رضی اللہ عنہما سے روایت ہے کہ عمر رضی اللہ عنہ نے عورت کے املاص کے بارے میں لوگوں سے مشورہ لیا تو مغیرہ بن شعبہ رضی اللہ عنہ نے کہا: میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا کہ آپ نے اس میں ایک غلام یا لونڈی دینے کا فیصلہ کیا ہے، تو عمر نے کہا: میرے پاس اپنے ساتھ اس شخص کو لاؤ جو اس کی گواہی دے، تو وہ محمد بن مسلمہ رضی اللہ عنہ کو لے کر ان کے پاس آئے۔ ہارون کی روایت میں اتنا اضافہ ہے تو انہوں نے اس کی گواہی دی یعنی اس بات کی کہ کوئی آدمی عورت کے پیٹ میں مارے جو اسقاط حمل کا سبب بن جائے۔ ابوداؤد کہتے ہیں: مجھے ابو عبید سے معلوم ہوا اسقاط حمل کو املاص اس لیے کہتے ہیں کہ اس کے معنی ازلاق یعنی پھسلانے کے ہیں گویا عورت ولادت سے قبل ہی مار کی وجہ سے حمل کو پھسلا دیتی ہے اسی طرح ہاتھ یا کسی اور چیز سے جو چیز پھسل کر گر جائے تو اس کی تعبیر «مَلِصَ» سے کی جاتی ہے یعنی وہ پھسل گیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 4571,
			"arabicnumber": 4571,
			"text": "عمر رضی اللہ عنہ سے بھی اسی مفہوم کی حدیث مروی ہے ابوداؤد کہتے ہیں: اسے حماد بن زید اور حماد بن سلمہ نے ہشام بن عروہ سے، عروہ نے اپنے باپ زبیر سے روایت کیا ہے کہ عمر نے کہا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 4572,
			"arabicnumber": 4572,
			"text": "عمر رضی اللہ عنہ سے روایت ہے کہ انہوں نے اس بارے میں نبی اکرم صلی اللہ علیہ وسلم کے فیصلے کے متعلق پوچھا تو حمل بن مالک بن نابغہ کھڑے ہوئے، اور بولے: میں دونوں عورتوں کے بیچ میں تھا، ان میں سے ایک نے دوسری کو لکڑی سے مارا تو وہ مر گئی اور اس کا جنین بھی، تو رسول اللہ صلی اللہ علیہ وسلم نے اس کے جنین کے سلسلے میں ایک غلام یا لونڈی کی دیت کا، اور قاتلہ کو قتل کر دیئے جانے کا حکم دیا۔ ابوداؤد کہتے ہیں: نضر بن شمیل نے کہا: «مسطح» چوپ یعنی ( روٹی پکانے کی لکڑی ) ہے۔ ابوداؤد کہتے ہیں: ابو عبید نے کہا:«مسطح» خیمہ کی لکڑیوں میں سے ایک لکڑی ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 4573,
			"arabicnumber": 4573,
			"text": "طاؤس کہتے ہیں کہ عمر رضی اللہ عنہ منبر پر کھڑے ہوئے، آگے راوی نے اسی مفہوم کی حدیث ذکر کی البتہ اس کا ذکر نہیں کیا کہ وہ قتل کی جائے، اور انہوں نے «بغرة عبد أو أمة» کا اضافہ کیا ہے، راوی کہتے ہیں: اس پر عمر رضی اللہ عنہ نے کہا: اللہ اکبر! اگر ہم یہ حکم نہ سنے ہوتے تو اس کے خلاف فیصلہ دیتے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 4574,
			"arabicnumber": 4574,
			"text": "عبداللہ بن عباس رضی اللہ عنہما سے حمل بن مالک کے قصے میں روایت ہے، وہ کہتے ہیں تو اس نے بچہ کو جسے بال اگے ہوئے تھے ساقط کر دیا، وہ مرا ہوا تھا اور عورت بھی مر گئی، تو آپ نے وارثوں پر دیت کا فیصلہ کیا، اس پر اس کے چچا نے کہا: اللہ کے نبی! اس نے تو ایک ایسا بچہ ساقط کیا ہے جس کے بال اگ آئے تھے، تو قاتل عورت کے باپ نے کہا: یہ جھوٹا ہے، اللہ کی قسم! نہ تو وہ چیخا، نہ پیا، اور نہ کھایا، اس جیسے کا خون تو معاف ( رائیگاں ) قرار دے دیا جاتا ہے، تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: کیا جاہلیت جیسی مسجع عبارت بولتے ہو جیسے کاہن بولتے ہیں، بچے کی دیت ایک غلام یا لونڈی کی دینی ہو گی ۔ ابن عباس کہتے ہیں: ان میں سے ایک کا نام ملیکہ اور دوسری کا ام غطیف تھا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 4575,
			"arabicnumber": 4575,
			"text": "جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے کہ قبیلہ ہذیل کی دو عورتوں میں سے ایک نے دوسری کو قتل کر دیا، ان میں سے ہر ایک کے شوہر بھی تھا، اور اولاد بھی، تو رسول اللہ صلی اللہ علیہ وسلم نے مقتولہ کی دیت قاتلہ کے عصبات پر ٹھہرائی اور اس کے شوہر اور اولاد سے کوئی مواخذہ نہیں کیا، مقتولہ کے عصبات نے کہا: کیا اس کی میراث ہمیں ملے گی؟ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: نہیں، اس کی میراث تو اس کے شوہر اور اولاد کی ہو گی ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 4576,
			"arabicnumber": 4576,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ قبیلہ ہذیل کی دو عورتوں میں جھگڑا ہوا، ان میں سے ایک نے دوسری کو پتھر پھینک کر مارا تو اسے قتل ہی کر ڈالا، تو لوگ مقدمہ لے کر رسول اللہ صلی اللہ علیہ وسلم کے پاس پہنچے تو آپ نے فیصلہ کیا: جنین کی دیت ایک غلام یا لونڈی ہے، اور عورت کی دیت کا فیصلہ کیا کہ یہ اس کے عصبہ پر ہو گی اور اس دیت کا وارث مقتولہ کی اولاد کو اور ان کے ساتھ کے لوگوں کو قرار دیا۔ حمل بن مالک بن نابغہ ہذلی نے کہا: اللہ کے رسول! میں ایسی جان کی دیت کیوں ادا کروں جس نے نہ پیا، نہ کھایا، نہ بولا، اور نہ چیخا، ایسے کا خون تو لغو قرار دے دیا جاتا ہے، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: یہ کاہنوں کا بھائی معلوم ہوتا ہے آپ نے یہ بات اس کی اس «سجع» تعبیر کی وجہ سے کہی جو اس نے کی تھی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 4577,
			"arabicnumber": 4577,
			"text": "ابوہریرہ رضی اللہ عنہ سے اس قصے میں روایت ہے، وہ کہتے ہیں پھر وہ عورت، جس کے لیے رسول اللہ صلی اللہ علیہ وسلم نے لونڈی یا غلام کا فیصلہ کیا تھا، مر گئی، تو آپ نے فیصلہ فرمایا کہ اس کی میراث اس کے بیٹوں کی ہے، اور دیت قاتلہ کے عصبہ پر ہو گی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 4578,
			"arabicnumber": 4578,
			"text": "بریدہ رضی اللہ عنہ سے روایت ہے کہ ایک عورت نے دوسری عورت کو پتھر مارا تو اس کا حمل گر گیا، یہ مقدمہ رسول اللہ صلی اللہ علیہ وسلم کے پاس لے جایا گیا تو آپ نے اس بچہ کی دیت پانچ سو بکریاں مقرر فرمائی، اور لوگوں کو پتھر مارنے سے اسی دن سے منع فرما دیا۔ ابوداؤد کہتے ہیں: روایت اسی طرح ہے پانچ سو بکریوں کی لیکن صحیح سو بکریاں ہے، اسی طرح عباس نے کہا ہے حالانکہ یہ وہم ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 4579,
			"arabicnumber": 4579,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے پیٹ کے بچے میں ایک غلام یا ایک لونڈی یا ایک گھوڑے یا ایک خچر کی دیت کا فیصلہ کیا۔ ابوداؤد کہتے ہیں: اس حدیث کو حماد بن سلمہ اور خالد بن عبداللہ نے محمد بن عمرو سے روایت کیا ہے البتہ ان دونوں نے «أو فرس أو بغل» کا ذکر نہیں کیا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 4580,
			"arabicnumber": 4580,
			"text": "شعبی کہتے ہیں کہ غرہ ( غلام یا لونڈی ) کی قیمت پانچ سو درہم ہے۔ ابوداؤد کہتے ہیں: ربیعہ نے کہا: غرہ ( غلام یا لونڈی ) پچاس دینار کا ہوتا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 4581,
			"arabicnumber": 4581,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے مکاتب غلام جسے قتل کر دیا جائے کی دیت میں فیصلہ فرمایا کہ قتل کے وقت جس قدر وہ بدل کتابت ادا کر چکا ہے اتنے حصہ کی دیت آزاد کی دیت کے مثل ہو گی اور جس قدر ادائیگی باقی ہے اتنے حصے کی دیت غلام کی دیت کے مثل ہو گی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 4582,
			"arabicnumber": 4582,
			"text": "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب مکاتب کوئی حد کا کام کرے یا ترکے کا وارث ہو تو جس قدر آزاد ہوا ہے وہ اسی قدر وارث ہو گا ۔ ابوداؤد کہتے ہیں: اسے وہیب نے ایوب سے، ایوب نے عکرمہ سے، عکرمہ نے علی رضی اللہ عنہ سے اور علی نے نبی اکرم صلی اللہ علیہ وسلم سے مرفوعاً روایت کیا ہے۔ اور حماد بن زید اور اسماعیل نے ایوب سے، ایوب نے عکرمہ سے اور عکرمہ نے نبی اکرم صلی اللہ علیہ وسلم سے مرسلاً روایت کیا ہے۔ اور اسماعیل بن علیہ نے اسے عکرمہ کا قول قرار دیا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 4583,
			"arabicnumber": 4583,
			"text": "عبداللہ بن عمرو بن العاص رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ذمی معاہد کی دیت آزاد کی دیت کی آدھی ہے ۱؎ ۔ ابوداؤد کہتے ہیں: اسے اسامہ بن زید لیثی اور عبدالرحمٰن بن حارث نے بھی عمرو بن شعیب سے اسی کی مثل روایت کیا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 4584,
			"arabicnumber": 4584,
			"text": "یعلیٰ رضی اللہ عنہ کہتے ہیں کہ میرے ایک مزدور نے ایک شخص سے جھگڑا کیا اور اس کے ہاتھ کو منہ میں کر کے دانت سے دبایا، اس نے اپنا ہاتھ کھینچا تو اس کا دانت باہر نکل آیا، پھر وہ نبی اکرم صلی اللہ علیہ وسلم کے پاس آیا، تو آپ نے اسے لغو کر دیا، اور فرمایا: کیا چاہتے ہو کہ وہ اپنا ہاتھ تمہارے منہ میں دیدے، اور تم اسے سانڈ کی طرح چبا ڈالو ابن ابی ملیکہ نے اپنے دادا سے نقل کیا ہے کہ ابوبکر رضی اللہ عنہ نے اسے لغو قرار دیا اور کہا: ( اللہ کرے ) اس کا دانت نہ رہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 4585,
			"arabicnumber": 4585,
			"text": "اس سند سے بھی یعلیٰ بن امیہ سے یہی حدیث مروی ہے البتہ اتنا اضافہ ہے پھر آپ نے ( یعنی نبی اکرم صلی اللہ علیہ وسلم نے ) دانت کاٹنے والے سے فرمایا: اگر تم چاہو تو یہ ہو سکتا ہے کہ تم بھی اپنا ہاتھ اس کے منہ میں دے دو وہ اسے کاٹے پھر تم اسے اس کے منہ سے کھینچ لو اور اس کے دانتوں کی دیت باطل قرار دے دی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 4586,
			"arabicnumber": 4586,
			"text": "عبداللہ بن عمرو بن العاص رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو طب نہ جانتا ہو اور علاج کرے تو وہ ( مریض کا ) ضامن ہو گا ۔ ابوداؤد کہتے ہیں: اسے ولید کے علاوہ کسی اور نے روایت نہیں کیا، ہمیں نہیں معلوم یہ صحیح ہے یا نہیں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 4587,
			"arabicnumber": 4587,
			"text": "عبدالعزیزبن عمر بن عبدالعزیز کہتے ہیں میرے والد کے پاس آنے والوں میں سے ایک شخص نے مجھ سے بیان کیا ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو کسی قوم میں طبیب بن بیٹھے، حالانکہ اس سے پہلے اس کی طب دانی معروف نہ ہو اور مریض کا مرض بگڑ جائے اور اس کو نقصان لاحق ہو جائے تو وہ اس کا ضامن ہو گا ۔ عبدالعزیز کہتے ہیں: «اعنت نعت» سے نہیں ( بلکہ «عنت» سے ہے جس کے معنی ) رگ کاٹنے، زخم چیرنے یا داغنے کے ہیں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 4588,
			"arabicnumber": 4588,
			"text": "عبداللہ بن عمرو رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فتح مکہ کے دن خطبہ دیا آپ نے فرمایا: سنو! جاہلیت کے خون یا مال کی جتنی فضیلتیں بھی تھیں جن کا ذکر کیا جاتا تھا یا جن کے دعوے کئے جاتے تھے وہ سب میرے قدموں تلے ہیں، سوائے حاجیوں کو پانی پلانے اور بیت اللہ کی دیکھ ریکھ کے پھر فرمایا: سنو! قتل خطا جو کوڑے یا لاٹھی سے ہوا ہو شبہ عمد ہے، اس کی دیت سو اونٹ ہے، جن میں چالیس اونٹنیاں ایسی ہوں گی جن کے پیٹ میں بچے ہوں گے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 4589,
			"arabicnumber": 4589,
			"text": "اس سند سے بھی خالد سے اسی مفہوم کی حدیث مروی ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 4590,
			"arabicnumber": 4590,
			"text": "عمران بن حصین رضی اللہ عنہما سے روایت ہے کہ فقیر لوگوں کے ایک غلام نے کچھ مالدار لوگوں کے ایک غلام کا کان کاٹ لیا، تو جس غلام نے کان کاٹا تھا اس کے مالکان نے نبی اکرم صلی اللہ علیہ وسلم کے پاس آ کر کہا: اللہ کے رسول! ہم فقیر لوگ ہیں، تو آپ نے ان پر کوئی دیت نہیں ٹھہرائی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 4591,
			"arabicnumber": 4591,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو شخص اندھا دھند مارا جائے یا کسی دنگے فساد میں جو ان میں چھڑ گیا ہو، یا کسی پتھر یا کوڑے سے مارا جائے تو اس کی دیت قتل خطا کی دیت ہو گی، اور جو جان بوجھ کر عمداً کسی کو قتل کرے تو وہ موجب قصاص ہے، اب اگر کوئی ان دونوں کے بیچ میں پڑ کر ( قاتل کو بچانا چاہے ) تو اس پر اللہ کی، فرشتوں کی اور تمام لوگوں کی لعنت ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 4592,
			"arabicnumber": 4592,
			"text": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ( جانور کا ) پاؤں باطل و رائیگاں ہے اس کی کوئی دیت نہیں ہو گی ۔ ابوداؤد کہتے ہیں: جانور پیر سے مار دے جب کہ وہ اس پہ سوار ہو تو اس کی کوئی دیت نہیں",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 4593,
			"arabicnumber": 4593,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جانور کسی کو زخمی کر دے تو اس میں ہرجانہ نہیں ہے، کان میں ہلاک ہونے والے کا ہرجانہ نہیں ہے اور کنواں میں ہلاک ہو جانے والے کا ہرجانہ نہیں ہے ۱؎ اور رکاز میں پانچواں حصہ دینا ہو گا ۔ ابوداؤد کہتے ہیں: جانور سے مراد وہ جانور ہے جو چھڑا کر بھاگ گیا ہو اور اس کے ساتھ کوئی نہ ہو اور دن ہو، رات نہ ہو۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 4594,
			"arabicnumber": 4594,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: آگ باطل ہے ۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 4595,
			"arabicnumber": 4595,
			"text": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ انس بن نضر رضی اللہ عنہ کی بہن ربیع نے ایک عورت کا سامنے کا دانت توڑ دیا، تو وہ لوگ نبی اکرم صلی اللہ علیہ وسلم کے پاس آئے، آپ نے اللہ کی کتاب کے مطابق قصاص کا فیصلہ کیا، تو انس بن نضر نے کہا، اس ذات کی قسم جس نے آپ کو حق کے ساتھ بھیجا ہے! اس کا دانت تو آج نہیں توڑا جائے گا، آپ صلی اللہ علیہ وسلم نے فرمایا: اے انس! کتاب اللہ میں قصاص کا حکم ہے پھر وہ لوگ دیت پر راضی ہو گئے جسے انہوں نے لے لیا، اس پر اللہ کے نبی اکرم صلی اللہ علیہ وسلم کو تعجب ہوا اور آپ نے فرمایا: اللہ کے بعض بندے ایسے ہیں کہ اگر وہ اللہ کی قسم کھا لیں تو وہ ان کی قسم پوری کر دیتا ہے ۱؎ ۔ ابوداؤد کہتے ہیں: میں نے احمد بن حنبل کو کہتے سنا ان سے پوچھا گیا تھا کہ دانت کا قصاص کیسے لیا جائے؟ تو انہوں نے کہا: وہ ریتی سے رگڑا جائے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 102
			}
		}
	]
}