{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"5": "Prayer (Kitab Al-Salat): Voluntary Prayers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1250,
			"arabicnumber": 1250,
			"text": "ام المؤمنین ام حبیبہ رضی اللہ عنہا کہتی ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جو شخص ایک دن میں بارہ رکعتیں نفل پڑھے گا تو اس کے بدلے اس کے لیے جنت میں گھر بنایا جائے گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1251,
			"arabicnumber": 1251,
			"text": "عبداللہ بن شقیق کہتے ہیں کہ میں نے ام المؤمنین عائشہ رضی اللہ عنہا سے رسول اللہ صلی اللہ علیہ وسلم کی نفل نماز کے بارے میں پوچھا تو انہوں نے کہا: آپ ظہر سے پہلے میرے گھر میں چار رکعتیں پڑھتے، پھر نکل کر لوگوں کو نماز پڑھاتے، پھر واپس آ کر میرے گھر میں دو رکعتیں پڑھتے، اور مغرب لوگوں کے ساتھ ادا کرتے اور واپس آ کر میرے گھر میں دو رکعتیں پڑھتے، پھر آپ انہیں عشاء پڑھاتے پھر میرے گھر میں آتے اور دو رکعتیں پڑھتے اور رات میں آپ نو رکعتیں پڑھتے، ان میں وتر بھی ہوتی، اور رات میں آپ کبھی تو دیر تک کھڑے ہو کر نماز پڑھتے اور کبھی دیر تک بیٹھ کر اور جب کھڑے ہو کر قرآت فرماتے تو رکوع و سجود بھی کھڑے ہو کر کرتے اور جب بیٹھ کر قرآت کرتے تو رکوع و سجود بھی بیٹھ کر کرتے اور جب فجر طلوع ہو جاتی تو دو رکعتیں پڑھتے، پھر نکل کر لوگوں کو فجر پڑھاتے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1252,
			"arabicnumber": 1252,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ظہر سے پہلے دو رکعتیں پڑھتے تھے، اور اس کے بعد دو رکعتیں، مغرب کے بعد دو رکعتیں اپنے گھر میں پڑھتے تھے اور عشاء کے بعد دو رکعتیں پڑھتے تھے، اور جمعہ کے بعد کچھ نہیں پڑھتے تھے یہاں تک کہ فارغ ہو کر گھر واپس آ جاتے پھر دو رکعتیں پڑھتے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1253,
			"arabicnumber": 1253,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا فرماتی ہیں کہ نبی اکرم صلی اللہ علیہ وسلم ظہر ( کی فرض نماز ) سے پہلے چار رکعتیں اور صبح کی ( فرض نماز ) سے پہلے دو رکعتیں نہیں چھوڑتے تھے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1254,
			"arabicnumber": 1254,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کسی اور نفل کا اتنا خیال نہیں رکھتے تھے جتنا صبح سے پہلے کی دونوں کی رکعتوں کا رکھتے تھے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1255,
			"arabicnumber": 1255,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ نبی اکرم صلی اللہ علیہ وسلم فجر سے پہلے کی دونوں رکعتیں ہلکی پڑھتے تھے، یہاں تک کہ میں کہتی: کیا آپ نے ان میں سورۃ فاتحہ پڑھی ہے؟",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1256,
			"arabicnumber": 1256,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فجر کی دونوں رکعتوں میں «قل يا أيها الكافرون» اور «قل هو الله أحد» پڑھی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1257,
			"arabicnumber": 1257,
			"text": "عبیداللہ بن زیاد الکندی کہتے ہیں کہ بلال رضی اللہ عنہ نے ان سے بیان کیا ہے کہ وہ رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے تاکہ آپ کو نماز فجر کی خبر دیں، تو ام المؤمنین عائشہ رضی اللہ عنہا نے انہیں کسی بات میں مشغول کر لیا، وہ ان سے اس کے بارے میں پوچھ رہی تھیں، یہاں تک کہ صبح خوب نمودار اور پوری طرح روشن ہو گئی، پھر بلال اٹھے اور آپ کو نماز کی اطلاع دی اور مسلسل دیتے رہے، لیکن رسول اللہ صلی اللہ علیہ وسلم نہیں نکلے، پھر جب نکلے تو لوگوں کو نماز پڑھائی اور بلال نے آپ کو بتایا کہ ام المؤمنین عائشہ رضی اللہ عنہا نے ایک معاملے میں کچھ پوچھ کر کے مجھے باتوں میں لگا لیا یہاں تک کہ صبح خوب نمودار ہو گئی، اور آپ نے نکلنے میں دیر کی، آپ صلی اللہ علیہ وسلم نے فرمایا: میں اس وقت فجر کی دو رکعتیں پڑھ رہا تھا ، بلال نے عرض کیا: اللہ کے رسول! آپ نے تو کافی صبح کر دی، اس پر آپ صلی اللہ علیہ وسلم نے فرمایا: جتنی دیر میں نے کی، اگر اس سے بھی زیادہ دیر ہو جاتی تو بھی میں ان دونوں رکعتوں کو ادا کرتا اور انہیں اچھی طرح اور خوبصورتی سے ادا کرتا",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1258,
			"arabicnumber": 1258,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تم ان دونوں رکعتوں کو مت چھوڑا کرو اگرچہ تمہیں گھوڑے روند ڈالیں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1259,
			"arabicnumber": 1259,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ فجر کی دونوں رکعتوں میں رسول اللہ صلی اللہ علیہ وسلم اکثر جس آیت کی تلاوت کرتے تھے وہ «آمنا بالله وما أنزل إلينا» ۱؎ والی آیت ہوتی، ابن عباس رضی اللہ عنہما کہتے ہیں: اسے پہلی رکعت میں پڑھتے اور دوسری رکعت میں«آمنا بالله واشهد بأنا مسلمون» ۲؎ پڑھتے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1260,
			"arabicnumber": 1260,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو فجر کی دونوں رکعتوں میں قرآت کرتے سنا، پہلی رکعت میں آپ «قل آمنا بالله وما أنزل علينا» ۱؎ اور دوسری رکعت میں «ربنا آمنا بما أنزلت واتبعنا الرسول فاكتبنا مع الشاهدين» ۲؎ یا«إنا أرسلناك بالحق بشيرا ونذيرا ولا تسأل عن أصحاب الجحيم» ۳؎ پڑھ رہے تھے اس میں دراوردی کو شک ہوا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1261,
			"arabicnumber": 1261,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تم میں سے جب کوئی فجر سے پہلے دو رکعتیں پڑھ لے تو اپنے دائیں کروٹ لیٹ جائے ، اس پر ان سے مروان بن حکم نے کہا: کیا کسی کے لیے مسجد تک چل کر جانا کافی نہیں کہ وہ دائیں کروٹ لیٹے؟ عبیداللہ کی روایت میں ہے کہ ابوہریرہ رضی اللہ عنہ نے جواب دیا: نہیں، تو پھر یہ خبر ابن عمر رضی اللہ عنہما کو پہنچی تو انہوں نے کہا: ابوہریرہ نے ( کثرت سے روایت کر کے ) خود پر زیادتی کی ہے ( اگر ان سے اس میں سہو یا غلطی ہو تو اس کا بار ان پر ہو گا ) ، وہ کہتے ہیں: ابن عمر سے پوچھا گیا: جو ابوہریرہ کہتے ہیں، اس میں سے کسی بات سے آپ کو انکار ہے؟ تو ابن عمر نے جواب دیا: نہیں، البتہ ابوہریرہ رضی اللہ عنہ ( روایت کثرت سے بیان کرنے میں ) دلیر ہیں اور ہم کم ہمت ہیں، جب یہ بات ابوہریرہ کو معلوم ہوئی تو انہوں نے کہا: اگر مجھے یاد ہے اور وہ لوگ بھول گئے ہیں تو اس میں میرا کیا قصور ہے؟ ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1262,
			"arabicnumber": 1262,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جب آخری رات میں اپنی نماز پوری کر چکتے تو اگر میں جاگ رہی ہوتی تو آپ مجھ سے گفتگو کرتے اور اگر سو رہی ہوتی تو مجھے جگا دیتے، اور دو رکعتیں پڑھتے پھر لیٹ جاتے، یہاں تک کہ آپ کے پاس مؤذن آتا اور آپ کو نماز فجر کی خبر دیتا تو آپ دو ہلکی سی رکعتیں پڑھتے، پھر نماز کے لیے نکل جاتے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Shadh"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1263,
			"arabicnumber": 1263,
			"text": "ابوسلمہ رضی اللہ عنہ کہتے ہیں کہ ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ نبی اکرم صلی اللہ علیہ وسلم جب فجر کی دو رکعتیں پڑھ چکتے اور میں سو رہی ہوتی تو لیٹ جاتے اور اگر میں جاگ رہی ہوتی تو مجھ سے گفتگو کرتے",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1264,
			"arabicnumber": 1264,
			"text": "ابوبکرہ رضی اللہ عنہ کہتے ہیں کہ میں نبی اکرم صلی اللہ علیہ وسلم کے ساتھ فجر کے لیے نکلا، تو آپ جس آدمی کے پاس سے بھی گزرتے اسے نماز کے لیے آواز دیتے یا پیر سے جگاتے جاتے تھے۔ زیاد کی روایت میں «حدثنا أبو الفضل» کے بجائے «حدثنا أبو الفضيل»ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1265,
			"arabicnumber": 1265,
			"text": "عبداللہ بن سرجس رضی اللہ عنہ کہتے ہیں کہ ایک شخص آیا اور نبی اکرم صلی اللہ علیہ وسلم فجر پڑھا رہے تھے تو اس نے دو رکعتیں پڑھیں پھر آپ صلی اللہ علیہ وسلم کے ساتھ نماز میں شریک ہو گیا، جب آپ نماز سے فارغ ہو کر پلٹے تو فرمایا: اے فلاں! تمہاری کون سی نماز تھی؟ آیا وہ جو تو نے تنہا پڑھی یا وہ جو ہمارے ساتھ پڑھی ۱؎؟ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1266,
			"arabicnumber": 1266,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب نماز کھڑی ہو جائے تو سوائے فرض کے کوئی نماز نہیں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1267,
			"arabicnumber": 1267,
			"text": "قیس بن عمرو رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک شخص کو نماز فجر ختم ہو جانے کے بعد دو رکعتیں پڑھتے دیکھا، تو آپ صلی اللہ علیہ وسلم نے فرمایا: فجر دو ہی رکعت ہے ، اس شخص نے جواب دیا: میں نے پہلے کی دونوں رکعتیں نہیں پڑھی تھیں، وہ اب پڑھی ہیں، اس پر رسول اللہ صلی اللہ علیہ وسلم خاموش رہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1268,
			"arabicnumber": 1268,
			"text": "اس طریق سے بھی یہ حدیث سعد بن سعید سے اسی سند سے مروی ہے ابوداؤد کہتے ہیں: سعید کے دونوں بیٹے عبدربہ اور یحییٰ نے یہ حدیث مرسلاً روایت کی ہے کہ ان کے دادا زید نے نبی اکرم صلی اللہ علیہ وسلم کے ساتھ نماز پڑھی تھی اور انہیں کے ساتھ یہ واقعہ ہوا تھا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1269,
			"arabicnumber": 1269,
			"text": "ام المؤمنین ام حبیبہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو شخص ظہر سے پہلے کی چار رکعتوں اور بعد کی چار رکعتوں کی پابندی کرے گا، اس پر جہنم کی آگ حرام ہو جائے گی ۔ ابوداؤد کہتے ہیں: اسے علاء بن حارث اور سلیمان بن موسیٰ نے مکحول سے اسی سند سے اسی کے مثل روایت کیا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1270,
			"arabicnumber": 1270,
			"text": "ابوایوب رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ظہر کے پہلے کی چار رکعتیں، جن کے درمیان سلام نہیں ہے، ایسی ہیں کہ ان کے واسطے آسمان کے دروازے کھول دیئے جاتے ہیں ۔ ابوداؤد کہتے ہیں: مجھے یحییٰ بن سعید قطان کی یہ بات پہنچی ہے کہ آپ نے کہا: اگر میں عبیدہ سے کچھ روایت کرتا تو ان سے یہی حدیث روایت کرتا۔ ابوداؤد کہتے ہیں: لیکن عبیدہ ضعیف ہیں، اور ابن منجاب کا نام سہم ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1271,
			"arabicnumber": 1271,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اللہ تعالیٰ اس شخص پر رحم فرمائے جس نے عصر سے پہلے چار رکعتیں پڑھیں ۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1272,
			"arabicnumber": 1272,
			"text": "علی رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم عصر سے پہلے دو رکعتیں پڑھتے تھے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1273,
			"arabicnumber": 1273,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کے غلام کریب کہتے ہیں کہ عبداللہ بن عباس، عبدالرحمٰن بن ازہر رضی اللہ عنہ اور مسور بن مخرمہ رضی اللہ عنہ تینوں نے انہیں ام المؤمنین عائشہ رضی اللہ عنہا کے پاس بھیجا اور کہا: ان سے ہم سب کا سلام کہنا اور عصر کے بعد دو رکعت نفل کے بارے میں پوچھنا اور کہنا: ہمیں معلوم ہوا ہے کہ آپ یہ دو رکعتیں پڑھتی ہیں، حالانکہ ہم تک یہ بات پہنچی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے ان سے منع فرمایا ہے، چنانچہ میں ام المؤمنین عائشہ رضی اللہ عنہا کے پاس گیا اور انہیں ان لوگوں کا پیغام پہنچا دیا، آپ نے کہا: ام المؤمنین ام سلمہ رضی اللہ عنہا سے پوچھو! میں ان لوگوں کے پاس آیا اور ان کی بات انہیں بتا دی، تو ان سب نے مجھے ام المؤمنین ام سلمہ کے پاس اسی پیغام کے ساتھ بھیجا، جس کے ساتھ ام المؤمنین عائشہ رضی اللہ عنہا کے پاس بھیجا تھا، تو ام المؤمنین ام سلمہ رضی اللہ عنہا نے کہا: میں نے رسول اللہ صلی اللہ علیہ وسلم کو اس سے منع کرتے ہوئے سنا، پھر دیکھا کہ آپ انہیں پڑھ رہے ہیں، ایک روز آپ نے عصر پڑھی پھر میرے پاس آئے، اس وقت میرے پاس انصار کے قبیلہ بنی حرام کی کچھ عورتیں بیٹھی ہوئی تھیں، آپ نے یہ دونوں رکعتیں پڑھنا شروع کیں تو میں نے ایک لڑکی کو آپ کے پاس بھیجا اور اس سے کہا کہ تو جا کر آپ کے بغل میں کھڑی ہو جا اور آپ سے کہہ: اللہ کے رسول! ام سلمہ کہہ رہی ہیں: میں نے تو آپ کو ان دونوں رکعتوں کو پڑھنے سے منع کرتے ہوئے سنا ہے اور اب آپ ہی انہیں پڑھ رہے ہیں، اگر آپ ہاتھ سے اشارہ کریں تو پیچھے ہٹ جانا، اس لڑکی نے ایسا ہی کیا، آپ نے ہاتھ سے اشارہ کیا، تو وہ پیچھے ہٹ گئی، جب آپ نماز سے فارغ ہو گئے تو فرمایا: اے ابوامیہ کی بیٹی! تم نے مجھ سے عصر کے بعد دو رکعتیں پڑھنے کے بارے میں پوچھا ہے، دراصل میرے پاس عبدالقیس کے چند لوگ اپنی قوم کے اسلام کی خبر لے کر آئے تو ان لوگوں نے مجھے باتوں میں مشغول کر لیا اور میں ظہر کے بعد یہ دونوں رکعتیں نہیں پڑھ سکا، یہ وہی دونوں رکعتیں ہیں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1274,
			"arabicnumber": 1274,
			"text": "علی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے عصر کے بعد نماز پڑھنے سے منع فرمایا، سوائے اس کے کہ سورج بلند ہو۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1275,
			"arabicnumber": 1275,
			"text": "علی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ہر فرض نماز کے بعد دو رکعتیں پڑھتے سوائے فجر اور عصر کے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1276,
			"arabicnumber": 1276,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ میرے پاس کئی پسندیدہ لوگوں نے گواہی دی ہے، جن میں عمر بن خطاب رضی اللہ عنہ بھی تھے اور میرے نزدیک عمران میں سب سے پسندیدہ شخص تھے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: فجر کے بعد سورج نکلنے سے پہلے کوئی نماز نہیں، اور نہ عصر کے بعد سورج ڈوبنے سے پہلے کوئی نماز ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1277,
			"arabicnumber": 1277,
			"text": "عمرو بن عبسہ سلمی رضی اللہ عنہ کہتے ہیں کہ میں نے عرض کیا: اللہ کے رسول! رات کے کس حصے میں دعا زیادہ قبول ہوتی ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: رات کے آخری حصے میں، اس وقت جتنی نماز چاہو پڑھو، اس لیے کہ ان میں فرشتے حاضر ہوتے ہیں اور فجر پڑھنے تک ( ثواب ) لکھے جاتے ہیں، اس کے بعد سورج نکلنے تک رک جاؤ یہاں تک کہ وہ ایک یا دو نیزے کے برابر بلند ہو جائے، اس لیے کہ سورج شیطان کی دو سینگوں کے درمیان نکلتا ہے اور کافر ( سورج کے پجاری ) اس وقت اس کی پوجا کرتے ہیں، پھر تم جتنی نماز چاہو پڑھو، اس لیے کہ اس نماز میں فرشتے حاضر ہوتے ہیں اور ( ثواب ) لکھے جاتے ہیں، یہاں تک کہ جب نیزے کا سایہ اس کے برابر ہو جائے تو ٹھہر جاؤ، اس لیے کہ اس وقت جہنم دہکائی جاتی ہے اور اس کے دروازے کھول دیئے جاتے ہیں، پھر جب سورج ڈھل جائے تو تم جتنی نماز چاہو پڑھو، اس لیے کہ اس وقت بھی فرشتے حاضر ہوتے ہیں، یہاں تک کہ تم عصر پڑھ لو تو سورج ڈوبنے تک ٹھہر جاؤ، اس لیے کہ وہ شیطان کی دو سینگوں کے بیچ ڈوبتا ہے، اور کافر اس کی پوجا کرتے ہیں ، انہوں نے ایک لمبی حدیث بیان کی۔ عباس کہتے ہیں: ابوسلام نے اسی طرح مجھ سے ابوامامہ کے واسطہ سے بیان کیا ہے، البتہ نادانستہ مجھ سے جو بھول ہو گئی ہو تو اس کے لیے میں اللہ سے مغفرت طلب کرتا ہوں اور اس کی طرف رجوع ہوتا ہوں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1278,
			"arabicnumber": 1278,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کے غلام یسار کہتے ہیں کہ مجھے ابن عمر رضی اللہ عنہما نے فجر طلوع ہونے کے بعد نماز پڑھتے دیکھا تو فرمایا: یسار! رسول اللہ صلی اللہ علیہ وسلم باہر نکل کر آئے، اور ہم یہ نماز پڑھ رہے تھے، اس وقت آپ صلی اللہ علیہ وسلم نے فرمایا: تم میں سے موجود لوگ غیر حاضر لوگوں کو بتا دیں کہ فجر ( طلوع ) ہونے کے بعد فجر کی دو سنتوں کے علاوہ اور کوئی نماز نہ پڑھو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1279,
			"arabicnumber": 1279,
			"text": "اسود اور مسروق کہتے ہیں کہ ہم گواہی دیتے ہیں کہ ام المؤمنین عائشہ رضی اللہ عنہا نے کہا: کوئی دن ایسا نہیں ہوتا تھا کہ نبی اکرم صلی اللہ علیہ وسلم عصر کے بعد دو رکعت نہ پڑھتے رہے ہوں ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1280,
			"arabicnumber": 1280,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کے غلام ذکوان سے روایت ہے کہ ام المؤمنین عائشہ نے ان سے بیان کیا ہے کہ رسول اللہ صلی اللہ علیہ وسلم ( خود تو ) عصر کے بعد نماز پڑھتے تھے اور ( دوسروں کو ) اس سے منع فرماتے، اور پے در پے روزے بھی رکھتے تھے اور ( دوسروں کو ) مسلسل روزہ رکھنے سے منع فرماتے تھے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1281,
			"arabicnumber": 1281,
			"text": "عبداللہ مزنی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: مغرب سے پہلے دو رکعتیں پڑھو ، پھر فرمایا: مغرب سے پہلے دو رکعتیں پڑھو جس کا جی چاہے ، یہ اس اندیشے سے فرمایا کہ لوگ اس کو ( راتب ) سنت نہ بنا لیں ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1282,
			"arabicnumber": 1282,
			"text": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں مغرب سے پہلے دو رکعتیں پڑھیں۔ مختار بن فلفل کہتے ہیں: میں نے انس رضی اللہ عنہ سے کہا: کیا رسول اللہ صلی اللہ علیہ وسلم نے آپ کو یہ نماز پڑھتے دیکھا تھا؟ انہوں نے کہا: ہاں، آپ نے ہم کو دیکھا تو نہ اس کا حکم دیا اور نہ اس سے منع کیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1283,
			"arabicnumber": 1283,
			"text": "عبداللہ بن مغفل رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ہر دو اذانوں کے درمیان نماز ہے، ہر دو اذانوں ۱؎کے درمیان نماز ہے، اس شخص کے لیے جو چاہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1284,
			"arabicnumber": 1284,
			"text": "طاؤس کہتے ہیں کہ ابن عمر رضی اللہ عنہما سے مغرب کے پہلے دو رکعت سنت پڑھنے کے بارے میں پوچھا گیا، تو آپ نے کہا: میں نے رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں یہ نماز پڑھتے کسی کو نہیں دیکھا، البتہ آپ نے عصر کے بعد دو رکعت پڑھنے کی رخصت دی۔ ابوداؤد کہتے ہیں: میں نے یحییٰ بن معین کو کہتے سنا ہے کہ ( ابوشعیب کے بجائے ) وہ شعیب ہے یعنی شعبہ کو ان کے نام میں وہم ہو گیا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1285,
			"arabicnumber": 1285,
			"text": "ابوذر رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ابن آدم کے ہر جوڑ پر صبح ہوتے ہی ( بطور شکرانے کے ) ایک صدقہ ہوتا ہے، اب اگر وہ کسی ملنے والے کو سلام کرے تو یہ ایک صدقہ ہے، کسی کو بھلائی کا حکم دے تو یہ بھی صدقہ ہے، برائی سے روکے یہ بھی صدقہ ہے، راستے سے کسی تکلیف دہ چیز کو ہٹا دے تو یہ بھی صدقہ ہے، اپنی بیوی سے صحبت کرے تو یہ بھی صدقہ ہے البتہ ان سب کے بجائے اگر دو رکعت نماز چاشت کے وقت پڑھ لے تو یہ ان سب کی طرف سے کافی ہے ۱؎ ۔ ابوداؤد کہتے ہیں: عباد کی روایت زیادہ کامل ہے اور مسدد نے امر و نہی کا ذکر نہیں کیا ہے، ان کی روایت میں یہ اضافہ ہے کہ فلاں اور فلاں چیز بھی صدقہ ہے اور ابن منیع کی روایت میں یہ اضافہ ہے کہ لوگوں نے پوچھا: اللہ کے رسول! ہم میں سے ایک شخص اپنی ( بیوی سے ) شہوت پوری کرتا ہے تو یہ بھی اس کے لیے صدقہ ہے؟ آپ نے فرمایا: ( کیوں نہیں ) اگر وہ کسی حرام جگہ میں شہوت پوری کرتا تو کیا وہ گنہگار نہ ہوتا۲؎؟ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1286,
			"arabicnumber": 1286,
			"text": "ابوالاسود الدولی کہتے ہیں کہ ہم لوگ ابوذر رضی اللہ عنہ کے پاس تھے کہ اسی دوران آپ نے کہا: ہر روز صبح ہوتے ہی تم میں سے ہر شخص کے جوڑ پر ایک صدقہ ہے، تو اس کے لیے ہر نماز کے بدلہ ایک صدقہ ( کا ثواب ) ہے، ہر روزہ کے بدلہ ایک صدقہ ( کا ثواب ) ہے، ہر حج ایک صدقہ ہے، اور ہر تسبیح ایک صدقہ ہے، ہر تکبیر ایک صدقہ ہے، اور ہر تحمید ایک صدقہ ہے، اس طرح رسول اللہ صلی اللہ علیہ وسلم نے ان نیک اعمال کا شمار کیا پھر فرمایا: ان سب سے تمہیں بس چاشت کی دو رکعتیں کافی ہیں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1287,
			"arabicnumber": 1287,
			"text": "معاذ بن انس جہنی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو شخص فجر کے بعد چاشت کے وقت تک اسی جگہ بیٹھا رہے جہاں اس نے نماز پڑھی ہے پھر چاشت کی دو رکعتیں پڑھے اس دوران سوائے خیر کے کوئی اور بات زبان سے نہ نکالے تو اس کی تمام خطائیں معاف کر دی جائیں گی وہ سمندر کے جھاگ سے زیادہ ہی کیوں نہ ہوں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1288,
			"arabicnumber": 1288,
			"text": "ابوامامہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ایک نماز کے بعد دوسری نماز کی ادائیگی اور ان دونوں کے درمیان میں کوئی بیہودہ اور فضول کام نہ کرنا ایسا عمل ہے جو علیین میں لکھا جاتا ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1289,
			"arabicnumber": 1289,
			"text": "نعیم بن ہمار رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا کہ اللہ تعالیٰ فرماتا ہے: اے ابن آدم! اپنے دن کے شروع کی چار رکعتیں ۱؎ ترک نہ کر کہ میں دن کے آخر تک تجھ کو کافی ہوں گا یعنی تیرا محافظ رہوں گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1290,
			"arabicnumber": 1290,
			"text": "ام ہانی بنت ابی طالب رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فتح مکہ کے روز چاشت کی نماز آٹھ رکعت پڑھی، آپ ہر دو رکعت پر سلام پھیرتے تھے۔ احمد بن صالح کی روایت میں ہے: رسول اللہ صلی اللہ علیہ وسلم نے فتح مکہ کے روز چاشت کی نماز پڑھی، پھر انہوں نے اسی کے مثل ذکر کیا۔ ابن سرح کی روایت میں ہے کہ ام ہانی کہتی ہیں: رسول اللہ صلی اللہ علیہ وسلم میرے پاس تشریف لائے، اس میں انہوں نے چاشت کی نماز کا ذکر نہیں کیا ہے، باقی روایت ابن صالح کی روایت کے ہم معنی ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1291,
			"arabicnumber": 1291,
			"text": "ابن ابی لیلیٰ کہتے ہیں کہ کسی نے ہمیں یہ نہیں بتایا کہ اس نے نبی اکرم صلی اللہ علیہ وسلم کو چاشت کی نماز پڑھتے دیکھا ہے سوائے ام ہانی رضی اللہ عنہا کے، انہوں نے یہ بات ذکر کی ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فتح مکہ کے روز ان کے گھر میں غسل فرمایا اور آٹھ رکعتیں ادا کیں، پھر اس کے بعد کسی نے آپ کو یہ نماز پڑھتے نہیں دیکھا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1292,
			"arabicnumber": 1292,
			"text": "عبداللہ بن شقیق کہتے ہیں میں نے ام المؤمنین عائشہ رضی اللہ عنہا سے پوچھا: کیا رسول اللہ صلی اللہ علیہ وسلم چاشت کی نماز پڑھتے تھے؟ انہوں نے کہا: نہیں، سوائے اس کے کہ جب آپ سفر سے آتے۔ میں نے عرض کیا: کیا رسول اللہ صلی اللہ علیہ وسلم دو سورتیں ملا کر پڑھتے تھے؟ آپ نے کہا: مفصل کی سورتیں ( ملا کر پڑھتے تھے ) ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1293,
			"arabicnumber": 1293,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے چاشت کی نماز کبھی نہیں پڑھی، لیکن میں اسے پڑھتی ہوں، رسول اللہ صلی اللہ علیہ وسلم بسا اوقات ایک عمل کو چاہتے ہوئے بھی اسے محض اس ڈر سے ترک فرما دیتے تھے کہ لوگوں کے عمل کرنے سے کہیں وہ ان پر فرض نہ ہو جائے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1294,
			"arabicnumber": 1294,
			"text": "سماک کہتے ہیں میں نے جابر بن سمرہ رضی اللہ عنہ سے پوچھا: کیا آپ رسول اللہ صلی اللہ علیہ وسلم کی مجالست ( ہم نشینی ) کرتے تھے؟ آپ نے کہا: ہاں اکثر ( آپ کی مجلسوں میں رہتا تھا ) ، آپ صلی اللہ علیہ وسلم جس جگہ نماز فجر ادا کرتے، وہاں سے اس وقت تک نہیں اٹھتے جب تک سورج نکل نہ آتا، جب سورج نکل آتا تو آپ ( نماز اشراق کے لیے ) کھڑے ہوتے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1295,
			"arabicnumber": 1295,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: رات اور دن کی نماز دو دو رکعت ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1296,
			"arabicnumber": 1296,
			"text": "مطلب رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: نماز دو دو رکعت ہے، اس طرح کہ تم ہر دو رکعت کے بعد تشہد پڑھو اور پھر اپنی محتاجی اور فقر و فاقہ ظاہر کرو اور دونوں ہاتھ اٹھا کر دعا مانگو اور کہو: اے اللہ! اے اللہ!، جس نے ایسا نہیں کیا یعنی دل نہ لگایا، اور اپنی محتاجی اور فقر و فاقہ کا اظہار نہ کیا تو اس کی نماز ناقص ہے ۔ ابوداؤد سے رات کی نماز دو دو رکعت ہونے کے بارے میں پوچھا گیا تو انہوں نے جواب دیا: چاہو تو دو دو پڑھو اور چاہو تو چار چار۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1297,
			"arabicnumber": 1297,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے عباس بن عبدالمطلب رضی اللہ عنہ سے فرمایا: اے عباس! اے میرے چچا! کیا میں آپ کو عطا نہ کروں؟ کیا میں آپ کو بھلائی نہ پہنچاؤں؟ کیا میں آپ کو نہ دوں؟ کیا میں آپ کو دس ایسی باتیں نہ بتاؤں جب آپ ان پر عمل کرنے لگیں تو اللہ تعالیٰ آپ کے اگلے پچھلے، نئے پرانے، جانے انجانے، چھوٹے بڑے، چھپے اور کھلے، سارے گناہ معاف کر دے گا، وہ دس باتیں یہ ہیں: آپ چار رکعت نماز پڑھیں، ہر رکعت میں سورۃ فاتحہ اور کوئی ایک سورۃ پڑھیں، جب پہلی رکعت کی قرآت کر لیں تو حالت قیام ہی میں پندرہ مرتبہ «سبحان الله، والحمد لله، ولا إله إلا الله، والله أكبر» کہیں، پھر رکوع کریں تو یہی کلمات حالت رکوع میں دس بار کہیں، پھر جب رکوع سے سر اٹھائیں تو یہی کلمات دس بار کہیں، پھر جب سجدہ میں جائیں تو حالت سجدہ میں دس بار یہی کلمات کہیں، پھر سجدے سے سر اٹھائیں تو یہی کلمات دس بار کہیں، پھر ( دوسرا ) سجدہ کریں تو دس بار کہیں اور پھر جب ( دوسرے ) سجدے سے سر اٹھائیں تو دس بار کہیں، تو اس طرح یہ ہر رکعت میں پچہتر بار ہوا، یہ عمل آپ چاروں رکعتوں میں کریں، اگر پڑھ سکیں تو ہر روز ایک مرتبہ اسے پڑھیں، اور اگر روزانہ نہ پڑھ سکیں تو ہر جمعہ کو ایک بار پڑھ لیں، ایسا بھی نہ کر سکیں تو ہر مہینے میں ایک بار، یہ بھی ممکن نہ ہو تو سال میں ایک بار اور اگر یہ بھی ممکن نہ ہو تو پھر عمر بھر میں ایک بار پڑھ لیں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1298,
			"arabicnumber": 1298,
			"text": "ابوالجوزاء کہتے ہیں کہ مجھ سے ایک ایسے شخص نے جسے شرف صحبت حاصل تھا حدیث بیان کی ہے لوگوں کا خیال ہے کہ وہ عبداللہ بن عمرو رضی اللہ عنہما تھے، انہوں نے کہا: نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: کل تم میرے پاس آنا، میں تمہیں دوں گا، عنایت کروں گا اور نوازوں گا ، میں سمجھا کہ آپ مجھے کوئی عطیہ عنایت فرمائیں گے ( جب میں کل پہنچا تو ) آپ صلی اللہ علیہ وسلم نے فرمایا: جب سورج ڈھل جائے تو کھڑے ہو جاؤ اور چار رکعت نماز ادا کرو ، پھر ویسے ہی بیان کیا جیسے اوپر والی حدیث میں گزرا ہے، البتہ اس میں یہ بھی ہے کہ: پھر تم سر اٹھاؤ یعنی دوسرے سجدے سے تو اچھی طرح بیٹھ جاؤ اور کھڑے مت ہو یہاں تک کہ دس دس بار تسبیح و تحمید اور تکبیر و تہلیل کر لو پھر یہ عمل چاروں رکعتوں میں کرو ، پھر آپ صلی اللہ علیہ وسلم نے فرمایا: اگر تم اہل زمین میں سب سے بڑے گنہگار ہو گے تو بھی اس عمل سے تمہارے گناہوں کی بخشش ہو جائے گی ، میں نے عرض کیا: اگر میں اس وقت یہ نماز ادا نہ کر سکوں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: تو رات یا دن میں کسی وقت ادا کر لو ۔ ابوداؤد کہتے ہیں: حبان بن ہلال: ہلال الرای کے ماموں ہیں۔ ابوداؤد کہتے ہیں: اسے مستمر بن ریان نے ابوالجوزاء سے انہوں نے عبداللہ بن عمرو رضی اللہ عنہما سے روایت کیا ہے۔ نیز اسے روح بن مسیب اور جعفر بن سلیمان نے عمرو بن مالک نکری سے، عمرو نے ابوالجوزاء سے ابوالجوزاء نے ابن عباس رضی اللہ عنہما سے بھی موقوفاً روایت کیا ہے، البتہ راوی نے روح کی روایت میں «فقال حديث عن النبي صلی اللہ علیہ وسلم» ( تو ابن عباس نے نبی اکرم صلی اللہ علیہ وسلم کی حدیث بیان کی ) کے جملے کا اضافہ کیا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 1299,
			"arabicnumber": 1299,
			"text": "عروہ بن رویم کہتے ہیں کہ مجھ سے انصاری نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے جعفر سے یہی حدیث بیان فرمائی، پھر انہوں نے انہی لوگوں کی طرح ذکر کیا، البتہ اس میں ہے: پہلی رکعت کے دوسرے سجدہ میں بھی یہی کہا جیسے مہدی بن میمون کی حدیث میں ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 1300,
			"arabicnumber": 1300,
			"text": "کعب بن عجرہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم بنو عبدالاشہل کی مسجد میں آئے اور اس میں مغرب ادا کی، جب لوگ نماز پڑھ چکے تو آپ نے ان کو دیکھا کہ نفل پڑھ رہے ہیں، آپ صلی اللہ علیہ وسلم نے فرمایا: یہ تو گھروں کی نماز ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 1301,
			"arabicnumber": 1301,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم مغرب کے بعد کی دونوں رکعتوں میں لمبی قرآت فرماتے یہاں تک کہ مسجد کے لوگ متفرق ہو جاتے ( یعنی سنتیں پڑھ پڑھ کر چلے جاتے ) ۔ ابوداؤد کہتے ہیں: نصر مجدر نے یعقوب قمی سے اسی کے مثل روایت کی ہے اور اسے مسند قرار دیا ہے۔ ابوداؤد کہتے ہیں: ہم سے اسے محمد بن عیسی بن طباع نے بیان کیا ہے، وہ کہتے ہیں: ہم سے نصر مجدر نے بیان کیا ہے وہ یعقوب سے اسی کے مثل روایت کرتے ہیں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 1302,
			"arabicnumber": 1302,
			"text": "اس طریق سے بھی سعید بن جبیر رضی اللہ عنہ نے نبی اکرم صلی اللہ علیہ وسلم سے اسی مفہوم کی حدیث مرسلاً روایت کی ہے ابوداؤد کہتے ہیں: میں نے محمد بن حمید کو کہتے ہوئے سنا، وہ کہہ رہے تھے: میں نے یعقوب کو کہتے ہوئے سنا کہ وہ تمام روایتیں جن کو میں نے تم لوگوں سے «جعفر عن سعيد بن جبير عن النبي صلی اللہ علیہ وسلم» کے طریق سے بیان کیا ہے، وہ مسند ہیں، سعید نے یہ روایتیں ابن عباس رضی اللہ عنہما سے، اور ابن عباس نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہیں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 1303,
			"arabicnumber": 1303,
			"text": "شریح بن ہانی کہتے ہیں کہ میں نے ام المؤمنین عائشہ رضی اللہ عنہا سے رسول اللہ صلی اللہ علیہ وسلم کی نماز کے بارے میں پوچھا تو انہوں نے کہا: رسول اللہ صلی اللہ علیہ وسلم عشاء پڑھنے کے بعد جب بھی میرے پاس آئے تو آپ نے چار رکعتیں یا چھ رکعتیں پڑھیں، ایک بار رات کو بارش ہوئی تو ہم نے آپ کے لیے ایک چمڑا بچھا دیا، گویا میں اس میں ( اب بھی ) وہ سوراخ دیکھ رہی ہوں جس سے پانی نکل کر اوپر آ رہا تھا لیکن میں نے آپ کو مٹی سے اپنے کپڑے بچاتے بالکل نہیں دیکھا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 1304,
			"arabicnumber": 1304,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں سورۃ مزمل کی آیت «قم الليل إلا قليلا، نصفه» ۱؎ رات کو کھڑے رہو مگر تھوڑی رات یعنی آدھی رات کو دوسری آیت «علم أن لن تحصوه فتاب عليكم فاقرءوا ما تيسر من القرآن» ۲؎ اسے معلوم ہے کہ تم اس کو پورا نہ کر سکو گے لہٰذا اس نے تم پر مہربانی کی، لہٰذا اب تم جتنی آسانی سے ممکن ہو ( نماز میں ) قرآن پڑھا کرو نے منسوخ کر دیا ہے،«ناشئة الليل» کے معنی شروع رات کے ہیں، چنانچہ صحابہ کی نماز شروع رات میں ہوتی تھی، اس لیے کہ رات میں جو قیام اللہ نے تم پر فرض کیا تھا اس کی ادائیگی اس وقت آسان اور مناسب ہے کیونکہ انسان سو جائے تو اسے نہیں معلوم کہ وہ کب جاگے گا اور «أقوم قيلا» سے مراد یہ ہے رات کا وقت قرآن سمجھنے کے لیے بہت اچھا وقت ہے اور اس کے قول «إن لك في النهار سبحا طويلا» ۳؎ کا مطلب یہ ہے کہ دنیا کے کام کاج کے واسطے دن کو بہت فرصت ہوتی ہے ( لہٰذا رات کا وقت عبادت میں صرف کیا کرو ) ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 1305,
			"arabicnumber": 1305,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ جب سورۃ مزمل کی ابتدائی آیات نازل ہوئیں تو لوگ رات کو ( نماز میں ) کھڑے رہتے جتنا کہ رمضان میں کھڑے رہتے ہیں، یہاں تک کہ سورۃ کا آخری حصہ نازل ہوا، ان دونوں کے درمیان ایک سال کا وقفہ ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 1306,
			"arabicnumber": 1306,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: شیطان تم میں سے ہر ایک کی گدی پر رات کو سوتے وقت تین گرہیں لگا دیتا ہے اور ہر گرہ پر تھپکی دے کر کہتا ہے: ابھی لمبی رات پڑی ہے، سو جاؤ، اب اگر وہ جاگ جائے اور اللہ کا ذکر کرے تو اس کی ایک گرہ کھل جاتی ہے، اور اگر وہ وضو کر لے تو دوسری گرہ کھل جاتی ہے، اور اگر نماز پڑھ لے تو تیسری گرہ بھی کھل جاتی ہے، اب وہ صبح اٹھتا ہے تو چستی اور خوش دلی کے ساتھ اٹھتا ہے ورنہ سستی اور بد دلی کے ساتھ صبح کرتا ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 1307,
			"arabicnumber": 1307,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں تہجد ( قیام اللیل ) نہ چھوڑو کیونکہ رسول اللہ صلی اللہ علیہ وسلم اسے نہیں چھوڑتے تھے، جب آپ بیمار یا سست ہوتے تو بیٹھ کر پڑھتے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 1308,
			"arabicnumber": 1308,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اللہ تعالیٰ اس شخص پر رحم فرمائے جو رات کو اٹھے اور نماز پڑھے اور اپنی بیوی کو بھی بیدار کرے، اگر وہ نہ اٹھے تو اس کے چہرے پر پانی کے چھینٹے مارے، اللہ تعالیٰ اس عورت پر رحم فرمائے جو رات کو اٹھ کر نماز پڑھے اور اپنے شوہر کو بھی جگائے، اگر وہ نہ اٹھے تو اس کے چہرے پر پانی کے چھینٹے مارے ۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 1309,
			"arabicnumber": 1309,
			"text": "ابوسعید اور ابوہریرہ رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب آدمی اپنی بیوی کو رات میں جگائے اور وہ دونوں نماز پڑھیں تو وہ دونوں ذاکرین اور ذاکرات میں لکھے جاتے ہیں ۔ ابن کثیر نے اسے مرفوع نہیں کیا ہے اور نہ اس میں ابوہریرہ رضی اللہ عنہ کا ذکر کیا ہے اور انہوں نے اسے ابوسعید رضی اللہ عنہ کا کلام قرار دیا ہے۔ ابوداؤد کہتے ہیں: اسے ابن مہدی نے سفیان سے روایت کیا ہے اور میرا گمان ہے کہ اس میں انہوں نے ابوہریرہ رضی اللہ عنہ کا بھی ذکر کیا ہے۔ ابوداؤد کہتے ہیں: سفیان کی حدیث موقوف ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 1310,
			"arabicnumber": 1310,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا فرماتی ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: تم میں سے جب کوئی نماز میں اونگھنے لگے تو سو جائے یہاں تک کہ اس کی نیند چلی جائے، کیونکہ اگر وہ اونگھتے ہوئے نماز پڑھے گا تو شاید وہ استغفار کرنے چلے لیکن خود کو وہ بد دعا کر بیٹھے ۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 1311,
			"arabicnumber": 1311,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب تم میں سے کوئی رات میں ( نماز پڑھنے کے لیے ) کھڑا ہو اور قرآن اس کی زبان پر لڑکھڑانے لگے اور وہ نہ سمجھ پائے کہ کیا کہہ رہا ہے تو اسے چاہیئے کہ سو جائے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 1312,
			"arabicnumber": 1312,
			"text": "انس رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم مسجد میں داخل ہوئے دیکھا کہ دو ستونوں کے درمیان ایک رسی بندھی ہوئی ہے، پوچھا: یہ رسی کیسی بندھی ہے؟ ، عرض کیا گیا: یہ حمنہ بنت حجش رضی اللہ عنہا کی ہے، وہ نماز پڑھتی ہیں اور جب تھک جاتی ہیں تو اسی رسی سے لٹک جاتی ہیں، یہ سن کر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جتنی طاقت ہو اتنی ہی نماز پڑھا کریں، اور جب تھک جائیں تو بیٹھ جائیں ۔ زیاد کی روایت میں یوں ہے: آپ نے پوچھا یہ رسی کیسی ہے؟ لوگوں نے کہا: زینب رضی اللہ عنہا کی ہے، وہ نماز پڑھا کرتی ہیں، جب سست ہو جاتی ہیں یا تھک جاتی ہیں تو اس کو تھام لیتی ہیں، آپ نے فرمایا: اسے کھول دو، تم میں سے ہر ایک کو اسی وقت تک نماز پڑھنا چاہیئے جب تک «نشاط» رہے، جب سستی آنے لگے یا تھک جائے تو بیٹھ جائے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 1313,
			"arabicnumber": 1313,
			"text": "عبدالرحمٰن بن عبدالقاری کہتے ہیں کہ میں نے عمر بن خطاب رضی اللہ عنہ سے سنا، وہ کہہ رہے تھے: رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے: جو شخص اپنا پورا وظیفہ یا اس کا کچھ حصہ پڑھے بغیر سو جائے پھر اسے صبح اٹھ کر فجر اور ظہر کے درمیان میں پڑھ لے تو اسے اسی طرح لکھا جائے گا گویا اس نے اسے رات ہی کو پڑھا ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 1314,
			"arabicnumber": 1314,
			"text": "سعید بن جبیر نے ایک ایسے شخص سے جو ان کے نزدیک پسندیدہ ہے روایت کی ہے کہ ام المؤمنین عائشہ رضی اللہ عنہا نے خبر دی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: کوئی شخص جو رات کو تہجد پڑھتا ہو اور کسی رات اس پر نیند غالب آ جائے ( اور وہ نہ اٹھ سکے ) تو اس کے لیے نماز کا ثواب لکھا جائے گا، اس کی نیند اس پر صدقہ ہو گی ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 1315,
			"arabicnumber": 1315,
			"text": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ہمارا رب ہر رات جس وقت رات کا آخری ایک تہائی حصہ باقی رہ جاتا ہے، آسمان دنیا پر اترتا ہے ۱؎، پھر فرماتا ہے: کون مجھ سے دعا کرتا ہے کہ میں اس کی دعا قبول کروں؟ کون مجھ سے مانگتا ہے کہ میں اسے دوں؟ کون مجھ سے مغفرت طلب کرتا ہے کہ میں اس کی مغفرت کر دوں؟ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 1316,
			"arabicnumber": 1316,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا فرماتی ہیں رسول اللہ صلی اللہ علیہ وسلم کو اللہ تعالیٰ رات کو جگا دیتا پھر صبح نہ ہوتی کہ رسول اللہ صلی اللہ علیہ وسلم اپنے معمول سے فارغ ہو جاتے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 1317,
			"arabicnumber": 1317,
			"text": "مسروق کہتے ہیں کہ میں نے ام المؤمنین عائشہ رضی اللہ عنہا سے رسول اللہ صلی اللہ علیہ وسلم کی نماز ( تہجد ) کے بارے میں پوچھا: میں نے ان سے کہا: آپ کس وقت نماز پڑھتے تھے؟ انہوں نے فرمایا: جب آپ مرغ کی بانگ سنتے تو اٹھ کر کھڑے ہو جاتے اور نماز شروع کر دیتے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 1318,
			"arabicnumber": 1318,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں صبح ہوتی تو آپ یعنی نبی اکرم صلی اللہ علیہ وسلم میرے پاس سوئے ہوئے ہی ملتے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 1319,
			"arabicnumber": 1319,
			"text": "حذیفہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم کو جب کوئی معاملہ پیش آتا تو آپ نماز پڑھتے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 1320,
			"arabicnumber": 1320,
			"text": "ربیعہ بن کعب اسلمی رضی اللہ عنہ کہتے ہیں میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ رات گزارتا تھا، آپ کو وضو اور حاجت کا پانی لا کر دیتا، آپ صلی اللہ علیہ وسلم نے مجھ سے فرمایا: مانگو مجھ سے ، میں نے عرض کیا: میں جنت میں آپ کی رفاقت چاہتا ہوں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: اس کے علاوہ اور کچھ؟ ، میں نے کہا: بس یہی، آپ صلی اللہ علیہ وسلم نے فرمایا: اچھا تو اپنے واسطے کثرت سے سجدے کر کے ( یعنی نماز پڑھ کر ) میری مدد کرو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 1321,
			"arabicnumber": 1321,
			"text": "انس بن مالک رضی اللہ عنہ کہتے ہیں یہ جو اللہ تعالیٰ کا قول ہے «تتجا فى جنوبهم عن المضاجع يدعون ربهم خوفا وطمعا ومما رزقناهم ينفقون» ان کے پہلو بچھونوں سے جدا رہتے ہیں، اپنے رب کو ڈر اور امید کے ساتھ پکارتے ہیں، اور جو کچھ ہم نے انہیں عطا کیا اس میں سے خرچ کرتے ہیں ( سورۃ السجدۃ: ۱۶ ) اس سے مراد یہ ہے کہ وہ لوگ مغرب اور عشاء کے درمیان جاگتے اور نماز پڑھتے ہیں۔ حسن کہتے ہیں: اس سے مراد تہجد پڑھنا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 1322,
			"arabicnumber": 1322,
			"text": "انس رضی اللہ عنہ سے اللہ تعالیٰ کے اس قول «كانوا قليلا من الليل ما يهجعون» وہ رات کو بہت تھوڑا سویا کرتے تھے ( سورۃ الذاریات: ۱۷ ) کے بارے میں روایت ہے کہ اس سے مراد یہ ہے کہ لوگ مغرب اور عشاء کے درمیان نماز پڑھتے تھے۔ یحییٰ کی روایت میں یہ اضافہ ہے کہ «تتجافى جنوبهم‏» سے بھی یہی مراد ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 1323,
			"arabicnumber": 1323,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تم میں سے جب کوئی رات کو اٹھے تو دو ہلکی رکعتیں پڑھے۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 1324,
			"arabicnumber": 1324,
			"text": "اس طریق سے بھی ابوہریرہ رضی اللہ عنہ سے اسی مفہوم کی روایت مروی ہے اس میں اتنا اضافہ ہے: پھر اس کے بعد جتنا چاہے طویل کرے ۔ ابوداؤد کہتے ہیں: اس حدیث کو حماد بن سلمہ، زہیر بن معاویہ اور ایک جماعت نے ہشام سے انہوں نے محمد سے روایت کیا ہے اور اسے لوگوں نے ابوہریرہ رضی اللہ عنہ پر موقوف قرار دیا ہے، اور اسی طرح اسے ایوب اور ابن عون نے روایت کیا ہے اور ابوہریرہ رضی اللہ عنہ پر موقوف قرار دیا ہے، نیز اسے ابن عون نے محمد سے روایت کیا ہے اس میں ہے: ان دونوں رکعتوں میں تخفیف کرے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 1325,
			"arabicnumber": 1325,
			"text": "عبداللہ بن حبشی خثعمی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم سے پوچھا گیا: کون سا عمل افضل ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: ( نماز میں ) دیر تک کھڑے رہنا ۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 1326,
			"arabicnumber": 1326,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ ایک شخص نے رسول اللہ صلی اللہ علیہ وسلم سے رات کی نماز ( تہجد ) کے بارے میں پوچھا تو آپ صلی اللہ علیہ وسلم نے فرمایا: رات کی نماز دو دو رکعت ہے، جب تم میں سے کسی کو یہ ڈر ہو کہ صبح ہو جائے گی تو ایک رکعت اور پڑھ لے، یہ اس کی ساری رکعتوں کو جو اس نے پڑھی ہیں طاق ( وتر ) کر دے گی ۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 1327,
			"arabicnumber": 1327,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں نبی اکرم صلی اللہ علیہ وسلم کی قرآت اتنی اونچی آواز سے ہوتی کہ آنگن میں رہنے والے کو سنائی دیتی اور حال یہ ہوتا کہ آپ اپنے گھر میں ( نماز پڑھ رہے ) ہوتے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 1328,
			"arabicnumber": 1328,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رات میں نبی اکرم صلی اللہ علیہ وسلم کی قرآت کبھی بلند آواز سے ہوتی تھی اور کبھی دھیمی آواز سے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 1329,
			"arabicnumber": 1329,
			"text": "ابوقتادہ رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم ایک رات باہر نکلے تو دیکھا کہ ابوبکر رضی اللہ عنہ نماز پڑھ رہے ہیں اور پست آواز سے قرآت کر رہے ہیں، پھر آپ صلی اللہ علیہ وسلم عمر کے پاس سے گزرے اور وہ بلند آواز سے نماز پڑھ رہے تھے، جب دونوں ( ابوبکر و عمر ) نبی اکرم صلی اللہ علیہ وسلم کے پاس آئے تو آپ صلی اللہ علیہ وسلم نے فرمایا: اے ابوبکر! میں تمہارے پاس سے گزرا اور دیکھا کہ تم دھیمی آواز سے نماز پڑھ رہے ہو ، آپ نے جواب دیا: اللہ کے رسول! میں نے اس کو ( یعنی اللہ تعالیٰ کو ) سنا دیا ہے، جس سے میں سرگوشی کر رہا تھا، اور آپ صلی اللہ علیہ وسلم نے عمر رضی اللہ عنہ سے کہا: میں تمہارے پاس سے گزرا تو تم بلند آواز سے نماز پڑھ رہے تھے ، تو انہوں نے جواب دیا: اللہ کے رسول! میں سوتے کو جگاتا اور شیطان کو بھگاتا ہوں۔ حسن بن الصباح کی روایت میں اتنا اضافہ ہے کہ اس پر نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ابوبکر! تم اپنی آواز تھوڑی بلند کر لو ، اور عمر رضی اللہ عنہ سے کہا: تم اپنی آواز تھوڑی دھیمی کر لو ۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 1330,
			"arabicnumber": 1330,
			"text": "ابوہریرہ رضی اللہ عنہ سے بھی یہی واقعہ مرفوعاً مروی ہے اس میں «فقال لأبي بكر: ارفع من صوتك شيئًا ولعمر اخفض شيئًا»کے جملہ کا ذکر نہیں اور یہ اضافہ ہے : اے بلال! میں نے تم کو سنا ہے کہ تم تھوڑا اس سورۃ سے پڑھتے ہو اور تھوڑا اس سورۃ سے ، بلال رضی اللہ عنہ نے کہا: ایک پاکیزہ کلام ہے، اللہ بعض کو بعض کے ساتھ ملاتا ہے، اس پر نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: تم سب نے ٹھیک کیا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 1331,
			"arabicnumber": 1331,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ ایک شخص رات کی نماز ( تہجد ) کے لیے اٹھا، اس نے قرآت کی، قرآت میں اپنی آواز بلند کی تو جب صبح ہوئی تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اللہ فلاں شخص پر رحم فرمائے، کتنی ایسی آیتیں تھیں جنہیں میں بھول چلا تھا، اس نے انہیں آج رات مجھے یاد دلا دیا ۔ ابوداؤد کہتے ہیں: یہ حدیث ہارون نحوی نے حماد بن سلمہ سے سورۃ آل عمران کے سلسلہ میں روایت کی ہے کہ اللہ فلاں پر رحم کرے کہ اس نے مجھے اس سورۃ کے بعض ایسے الفاظ یاد دلا دیے جنہیں میں بھول چکا تھا اور وہ «وكأين من نبي» ( آل عمران: ۱۴۶ ) والی آیت ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 1332,
			"arabicnumber": 1332,
			"text": "ابوسعید رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے مسجد میں اعتکاف فرمایا، آپ نے لوگوں کو بلند آواز سے قرآت کرتے سنا تو پردہ ہٹایا اور فرمایا: لوگو! سنو، تم میں سے ہر ایک اپنے رب سے سرگوشی کرتا ہے، تو کوئی کسی کو ایذا نہ پہنچائے اور نہ قرآت میں ( یا کہا نماز ) میں اپنی آواز کو دوسرے کی آواز سے بلند کرے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 1333,
			"arabicnumber": 1333,
			"text": "عقبہ بن عامر جہنی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: بلند آواز سے قرآن پڑھنے والا ایسے ہے جیسے اعلانیہ طور سے خیرات کرنے والا اور آہستہ قرآن پڑھنے والا ایسے ہے جیسے چپکے سے خیرات کرنے والا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 1334,
			"arabicnumber": 1334,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں رسول اللہ صلی اللہ علیہ وسلم رات کو دس رکعتیں پڑھتے اور ایک رکعت وتر ادا کرتے اور دو رکعت فجر کی سنت پڑھتے، اس طرح یہ کل تیرہ رکعتیں ہوتیں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 1335,
			"arabicnumber": 1335,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم رات کو گیارہ رکعتیں پڑھتے تھے ان میں سے ایک رکعت وتر کی ہوتی تھی، جب آپ اس سے فارغ ہو جاتے تو داہنی کروٹ لیٹتے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 1336,
			"arabicnumber": 1336,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم عشاء سے فارغ ہو کر فجر کی پو پھوٹنے تک گیارہ رکعتیں پڑھتے تھے، ہر دو رکعت پر سلام پھیرتے اور ایک رکعت وتر کی پڑھتے، اپنے سجدوں میں اتنا ٹھہرتے کہ تم میں سے کوئی اتنی دیر میں سر اٹھانے سے پہلے پچاس آیتیں پڑھ لے، جب مؤذن فجر کی پہلی اذان کہہ کر خاموش ہوتا تو آپ کھڑے ہوتے اور ہلکی سی دو رکعتیں پڑھتے، پھر اپنے داہنے پہلو پر لیٹ جاتے یہاں تک کہ مؤذن ( بلانے کے لے ) آتا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 1337,
			"arabicnumber": 1337,
			"text": "اس طریق سے بھی ابن شہاب زہری سے اسی سند سے اسی مفہوم کی حدیث مروی ہے، اس میں ہے کہ ایک رکعت وتر پڑھتے اور اتنی دیر تک سجدہ کرتے جتنی دیر میں تم میں سے کوئی پچاس آیتیں ( رکوع سے ) سر اٹھانے سے پہلے پڑھ لے، پھر جب مؤذن فجر کی اذان کہہ کر خاموش ہوتا اور فجر ظاہر ہو جاتی، آگے راوی نے اسی مفہوم کی حدیث بیان کی البتہ بعض کی روایتوں میں بعض پر کچھ اضافہ ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 1338,
			"arabicnumber": 1338,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم رات کو میں تیرہ رکعتیں پڑھتے اور انہیں پانچ رکعتوں سے طاق بنا دیتے، ان پانچ رکعتوں میں سوائے قعدہ اخیرہ کے کوئی قعدہ نہیں ہوتا پھر سلام پھیر دیتے۔ ابوداؤد کہتے ہیں: اسے ابن نمیر نے ہشام سے اسی طرح روایت کیا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 1339,
			"arabicnumber": 1339,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں رسول اللہ صلی اللہ علیہ وسلم رات کو تیرہ رکعتیں پڑھتے پھر جب فجر کی اذان سنتے تو ہلکی سی دو رکعتیں اور پڑھتے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 1340,
			"arabicnumber": 1340,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ اللہ کے نبی کریم صلی اللہ علیہ وسلم رات کو تیرہ رکعتیں پڑھتے تھے ( پہلے ) آٹھ رکعتیں پڑھتے ( پھر ) ایک رکعت سے وتر کرتے، مسلم بن ابراہیم کی روایت میں «بعد الوتر» وتر کے بعد کے الفاظ بھی ہیں ( پھر موسیٰ اور مسلم ابن ابراہیم دونوں متفق ہیں کہ ) دو رکعتیں بیٹھ کر پڑھتے، جب رکوع کرنا چاہتے تو کھڑے ہو جاتے پھر رکوع کرتے اور دو رکعتیں فجر کی اذان اور اقامت کے درمیان پڑھتے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 1341,
			"arabicnumber": 1341,
			"text": "ابوسلمہ بن عبدالرحمٰن روایت کرتے ہیں کہ انہوں نے ام المؤمنین عائشہ رضی اللہ عنہا سے پوچھا: رمضان میں رسول اللہ صلی اللہ علیہ وسلم کی نماز ( تہجد ) کیسے ہوتی تھی؟ تو انہوں نے جواب دیا: رسول اللہ صلی اللہ علیہ وسلم رمضان یا غیر رمضان میں کبھی گیارہ رکعت سے زیادہ نہیں پڑھتے تھے ۱؎، آپ چار رکعتیں پڑھتے، ان رکعتوں کی خوبی اور لمبائی کو نہ پوچھو، پھر چار رکعتیں پڑھتے، ان کے بھی حسن اور لمبائی کو نہ پوچھو، پھر تین رکعتیں پڑھتے، ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں: میں نے عرض کیا: اللہ کے رسول! کیا آپ وتر پڑھنے سے پہلے سوتے ہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: عائشہ! میری آنکھیں سوتی ہیں لیکن میرا دل نہیں سوتا ۲؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 1342,
			"arabicnumber": 1342,
			"text": "سعد بن ہشام کہتے ہیں کہ میں نے اپنی بیوی کو طلاق دے دی، پھر میں مدینہ آیا تاکہ اپنی ایک زمین بیچ دوں اور اس سے ہتھیار خرید لوں اور جہاد کروں، تو میری ملاقات نبی اکرم صلی اللہ علیہ وسلم کے چند صحابہ سے ہوئی، ان لوگوں نے کہا: ہم میں سے چھ افراد نے ایسا ہی کرنے کا ارادہ کیا تھا تو نبی اکرم صلی اللہ علیہ وسلم نے انہیں اس سے منع کیا اور فرمایا: تمہارے لیے رسول اللہ صلی اللہ علیہ وسلم کی زندگی میں بہترین نمونہ ہے ، تو میں ابن عباس رضی اللہ عنہما کے پاس آیا اور ان سے رسول اللہ صلی اللہ علیہ وسلم کی وتر کے بارے میں پوچھا، آپ نے کہا: میں ایک ایسی ذات کی جانب تمہاری رہنمائی کرتا ہوں جو رسول اللہ صلی اللہ علیہ وسلم کے وتر کے بارے میں لوگوں میں سب سے زیادہ جاننے والی ہے، تم ام المؤمنین عائشہ رضی اللہ عنہا کے پاس جاؤ۔ چنانچہ میں ان کے پاس چلا اور حکیم بن افلح سے بھی ساتھ چلنے کو کہا، انہوں نے انکار کیا تو میں نے ان کو قسم دلائی، چنانچہ وہ میرے ساتھ ہو لیے ( پھر ہم دونوں ام المؤمنین عائشہ رضی اللہ عنہا کے گھر پہنچے ) ، ان سے اندر آنے کی اجازت طلب کی، انہوں نے پوچھا: کون ہو؟ کہا: حکیم بن افلح، انہوں نے پوچھا: تمہارے ساتھ کون ہے؟ کہا: سعد بن ہشام، پوچھا: عامر کے بیٹے ہشام جو جنگ احد میں شہید ہوئے تھے؟ میں نے عرض کیا: ہاں، وہ کہنے لگیں: عامر کیا ہی اچھے آدمی تھے، میں نے عرض کیا: ام المؤمنین مجھ سے رسول اللہ صلی اللہ علیہ وسلم کے اخلاق کا حال بیان کیجئے، انہوں نے کہا: کیا تم قرآن نہیں پڑھتے؟ رسول اللہ صلی اللہ علیہ وسلم کا اخلاق قرآن تھا، میں نے عرض کیا: آپ کی رات کی نماز ( تہجد ) کے بارے میں کچھ بیان کیجئیے، انہوں نے کہا: کیا تم سورۃ «يا أيها المزمل» نہیں پڑھتے؟ میں نے کہا: کیوں نہیں؟ انہوں نے کہا: جب اس سورۃ کی ابتدائی آیات نازل ہوئیں تو رسول اللہ صلی اللہ علیہ وسلم کے صحابہ نماز کے لیے کھڑے ہوئے یہاں تک کہ ان کے پیروں میں ورم آ گیا اور سورۃ کی آخری آیات آسمان میں بارہ ماہ تک رکی رہیں پھر نازل ہوئیں تو رات کی نماز نفل ہو گئی جب کہ وہ پہلے فرض تھی، وہ کہتے ہیں: میں نے عرض کیا: نبی اکرم صلی اللہ علیہ وسلم کی وتر کے بارے میں بیان کیجئیے، انہوں نے کہا: آپ آٹھ رکعتیں پڑھتے اور آٹھویں رکعت کے بعد پھر کھڑے ہو کر ایک رکعت پڑھتے، اس طرح آپ آٹھویں اور نویں رکعت ہی میں بیٹھتے اور آپ نویں رکعت کے بعد ہی سلام پھیرتے اس کے بعد دو رکعتیں بیٹھ کر پڑھتے، اس طرح یہ کل گیارہ رکعتیں ہوئیں، میرے بیٹے! پھر جب آپ صلی اللہ علیہ وسلم سن رسیدہ ہو گئے اور بدن پر گوشت چڑھ گیا تو سات رکعتوں سے وتر کرنے لگے، اب صرف چھٹی اور ساتویں رکعت کے بعد بیٹھتے اور ساتویں میں سلام پھیرتے پھر بیٹھ کر دو رکعتیں ادا کرتے، اس طرح یہ کل نو رکعتیں ہوتیں، میرے بیٹے! اور رسول اللہ صلی اللہ علیہ وسلم نے کسی بھی رات کو ( لگاتار ) صبح تک قیام ۱؎ نہیں کیا، اور نہ ہی کبھی ایک رات میں قرآن ختم کیا، اور نہ ہی رمضان کے علاوہ کبھی مہینہ بھر مکمل روزے رکھے، اور جب بھی آپ صلی اللہ علیہ وسلم کوئی نماز پڑھتے تو اس پر مداومت فرماتے، اور جب رات کو آنکھوں میں نیند غالب آ جاتی تو دن میں بارہ رکعتیں ادا فرماتے۔ سعد بن ہشام کہتے ہیں: میں ابن عباس کے پاس آیا اور ان سے یہ حدیث بیان کی تو انہوں نے کہا: قسم اللہ کی! حدیث یہی ہے، اگر میں ان سے بات کرتا تو میں ان کے پاس جا کر خود ان کے ہی منہ سے بالمشافہہ یہ حدیث سنتا، میں نے ان سے کہا: اگر مجھے یہ معلوم ہوتا کہ آپ ان سے بات نہیں کرتے ہیں تو میں آپ سے یہ حدیث بیان ہی نہیں کرتا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 1343,
			"arabicnumber": 1343,
			"text": "اس طریق سے بھی قتادہ سے سابقہ سند سے اسی طرح کی حدیث مروی ہے اس میں ہے: آپ صلی اللہ علیہ وسلم آٹھ رکعت پڑھتے تھے اور صرف آٹھویں رکعت ہی میں بیٹھتے تھے اور جب بیٹھتے تو اللہ تعالیٰ کو یاد کرتے پھر دعا مانگتے پھر سلام ایسے پھیرتے کہ ہمیں بھی سنا دیتے، سلام پھیرنے کے بعد بیٹھ کر دو رکعتیں پڑھتے، پھر ایک رکعت پڑھتے، اے میرے بیٹے! اس طرح یہ گیارہ رکعتیں ہوئیں، پھر جب رسول اللہ صلی اللہ علیہ وسلم بوڑھے ہو گئے اور بدن پر گوشت چڑھ گیا تو سات رکعت وتر پڑھنے لگے اور سلام پھیرنے کے بعد دو رکعتیں بیٹھ کر ادا کرتے ، پھر اسی مفہوم کی روایت لفظ «مشافهة» تک ذکر کی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 1344,
			"arabicnumber": 1344,
			"text": "اس سند سے بھی سعید نے یہی حدیث بیان کی ہے اس میں ہے: آپ اپنا سلام ہمیں سناتے جیسا کہ یحییٰ بن سعید نے کہا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 1345,
			"arabicnumber": 1345,
			"text": "اس سند سے بھی سعید نے یہی حدیث روایت کی ہے ابن بشار نے یحییٰ بن سعید کی طرح حدیث نقل کی مگر اس میں «ويسلم تسليمة يسمعنا» کے الفاظ ہیں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 1346,
			"arabicnumber": 1346,
			"text": "زرارہ بن اوفی سے روایت ہے کہ ام المؤمنین عائشہ رضی اللہ عنہا سے رسول اللہ صلی اللہ علیہ وسلم کی رات کی نماز ( تہجد ) کے متعلق پوچھا گیا تو انہوں نے کہا: آپ صلی اللہ علیہ وسلم عشاء جماعت کے ساتھ پڑھتے پھر اپنے گھر والوں کے پاس واپس آتے اور چار رکعتیں پڑھتے پھر اپنے بستر پر جاتے اور سو جاتے، آپ صلی اللہ علیہ وسلم کے سرہانے آپ کے وضو کا پانی ڈھکا رکھا ہوتا اور مسواک رکھی ہوتی یہاں تک کہ اللہ تعالیٰ رات کو جب چاہتا آپ کو اٹھا دیتا تو آپ ( اٹھ کر ) مسواک کرتے اور پوری طرح سے وضو کرتے، پھر اپنی جائے نماز پر کھڑے ہوتے اور آٹھ رکعتیں پڑھتے، ان میں سے ہر رکعت میں سورۃ فاتحہ اور اس کے ساتھ قرآن کی کوئی سورۃ اور جو اللہ کو منظور ہوتا پڑھتے اور کسی رکعت کے بعد نہیں بیٹھتے یہاں تک کہ جب آٹھویں رکعت ہو جاتی تو قعدہ کرتے اور سلام نہیں پھیرتے بلکہ نویں رکعت پڑھتے پھر قعدہ کرتے، اور اللہ جو دعا آپ سے کروانا چاہتا، کرتے اور اس سے سوال کرتے اور اس کی طرف متوجہ ہوتے اور ایک سلام پھیرتے اس قدر بلند آواز سے کہ قریب ہوتا کہ گھر کے لوگ جاگ جائیں، پھر بیٹھ کر سورۃ فاتحہ کی قرآت کرتے اور رکوع بھی بیٹھ کر کرتے، پھر دوسری رکعت پڑھتے اور بیٹھے بیٹھے رکوع اور سجدہ کرتے، پھر اللہ جتنی دعا آپ سے کروانا چاہتا کرتے پھر سلام پھیرتے اور نماز سے فارغ ہو جاتے، رسول اللہ صلی اللہ علیہ وسلم کے نماز پڑھنے کا معمول یہی رہا، یہاں تک کہ آپ موٹے ہو گئے تو آپ نے نو میں سے دو رکعتیں کم کر دیں اور اسے چھ اور سات رکعتیں کر لیں اور دو رکعتیں بیٹھ کر پڑھتے، وفات تک آپ کا یہی معمول رہا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 1347,
			"arabicnumber": 1347,
			"text": "یزید بن ہارون کہتے ہیں: ہمیں بہز بن حکیم نے خبر دی ہے پھر انہوں نے یہی حدیث اسی سند سے ذکر کی، اس میں ہے: آپ عشاء پڑھتے پھر اپنے بستر پر آتے، انہوں نے چار رکعت کا ذکر نہیں کیا ، آگے پوری حدیث بیان کی، اس میں ہے: پھر آپ آٹھ رکعتیں پڑھتے اور ان میں قرآت، رکوع اور سجدہ میں برابری کرتے اور ان میں سے کسی میں نہیں بیٹھتے سوائے آٹھویں کے، اس میں بیٹھتے تھے پھر کھڑے ہو جاتے اور ان میں سلام نہیں پھیرتے پھر ایک رکعت پڑھ کر ان کو طاق کر دیتے پھر سلام پھیرتے اس میں اپنی آواز بلند کرتے یہاں تک کہ ہمیں بیدار کر دیتے ، پھر راوی نے اسی مفہوم کو بیان کیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 1348,
			"arabicnumber": 1348,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ ان سے رسول اللہ صلی اللہ علیہ وسلم کی نماز ( تہجد ) کے بارے میں پوچھا گیا تو انہوں نے کہا: آپ لوگوں کو عشاء پڑھاتے پھر اپنے گھر والوں کے پاس آ کر چار رکعتیں پڑھتے پھر اپنے بستر پر آتے، پھر راوی نے پوری حدیث بیان کی، اس میں انہوں نے قرآت اور رکوع و سجدہ میں برابری کا ذکر نہیں کیا ہے اور نہ یہ ذکر کیا ہے کہ آپ اتنی بلند آواز سے سلام پھیرتے کہ ہم بیدار ہو جاتے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 1349,
			"arabicnumber": 1349,
			"text": "اس طریق سے بھی ام المؤمنین عائشہ رضی اللہ عنہا سے یہی حدیث مروی ہے لیکن سند کے اعتبار سے یہ ان کی جید احادیث میں سے نہیں ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 1350,
			"arabicnumber": 1350,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم رات کو تیرہ رکعتیں پڑھتے، نو رکعتیں وتر کی ہوتیں، یا کچھ اسی طرح کہا اور دو رکعتیں بیٹھ کر پڑھتے اور اذان و اقامت کے درمیان فجر کی دو رکعتیں پڑھتے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 1351,
			"arabicnumber": 1351,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نو رکعتیں وتر کی پڑھتے، پھر سات رکعتیں پڑھنے لگے، اور وتر کے بعد دو رکعتیں بیٹھ کر پڑھتے۔ ان میں قرآت کرتے، جب رکوع کرنا ہوتا تو کھڑے ہو جاتے، پھر رکوع کرتے پھر سجدہ کرتے۔ ابوداؤد کہتے ہیں: یہ دونوں حدیثیں خالد بن عبداللہ واسطی نے محمد بن عمرو سے اسی کے مثل روایت کی ہیں، اس میں ہے: کہ علقمہ بن وقاص نے کہا: اماں جان! آپ صلی اللہ علیہ وسلم دو رکعتیں کیسے پڑھتے تھے؟ پھر راوی نے اسی مفہوم کی حدیث ذکر کی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 1352,
			"arabicnumber": 1352,
			"text": "سعد بن ہشام کہتے ہیں کہ میں مدینے آیا اور ام المؤمنین عائشہ رضی اللہ عنہا کے پاس گیا اور کہا: مجھے رسول اللہ صلی اللہ علیہ وسلم کی نماز ( تہجد ) کے بارے میں بتائیے، وہ بولیں: رسول اللہ صلی اللہ علیہ وسلم لوگوں کو عشاء پڑھاتے، پھر بستر پر آ کر سو جاتے، جب آدھی رات ہو جاتی تو قضائے حاجت اور وضو کے لیے اٹھتے اور وضو کر کے مصلیٰ پر تشریف لے جاتے اور آٹھ رکعتیں پڑھتے، میرے خیال میں آپ صلی اللہ علیہ وسلم ہر رکعت میں قرآت، رکوع اور سجدہ برابر برابر کرتے، پھر ایک رکعت پڑھ کر اسے وتر بنا دیتے، پھر دو رکعتیں بیٹھ کر پڑھتے پھر اپنا پہلو ( زمین پر ) رکھتے، کبھی ایسا ہوتا کہ بلال رضی اللہ عنہ آ کر نماز کی خبر دیتے پھر آپ صلی اللہ علیہ وسلم ہلکی نیند سوتے، بسا اوقات میں شبہ میں پڑ جاتی کہ آپ سو رہے ہیں یا جاگ رہے ہیں یہاں تک کہ وہ آپ کو نماز کی خبر دیتے، یہی آپ کی نماز ( تہجد ) ہے یہاں تک کہ آپ بوڑھے اور موٹے ہو گئے، پھر انہوں نے رسول اللہ صلی اللہ علیہ وسلم کے گوشت بڑھ جانے کا حال جو اللہ نے چاہا ذکر کیا پھر راوی نے پوری حدیث ذکر کی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 1353,
			"arabicnumber": 1353,
			"text": "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ وہ نبی اکرم صلی اللہ علیہ وسلم کے پاس سوئے تو دیکھا کہ آپ بیدار ہوئے، تو مسواک اور وضو کیا اور آیت کریمہ «إن في خلق السموات والأرض» ۱؎ اخیر سورۃ تک پڑھی، پھر کھڑے ہوئے اور دو رکعتیں پڑھیں، ان میں قیام، رکوع اور سجدہ لمبا کیا، پھر آپ صلی اللہ علیہ وسلم فارغ ہوئے اور سو گئے یہاں تک کہ خراٹے لینے لگے، پھر آپ صلی اللہ علیہ وسلم نے چھ رکعتوں میں تین بار ایسا ہی کیا، ہر بار مسواک کرتے اور وضو کرتے اور انہیں آیتوں کو پڑھتے تھے پھر آپ صلی اللہ علیہ وسلم نے وتر پڑھی۔ عثمان کی روایت میں ہے کہ وتر کی تین رکعتیں پڑھیں۔ پھر مؤذن آیا تو آپ نماز کے لیے نکلے۔ ابن عیسیٰ کی روایت میں ہے: پھر آپ نے وتر پڑھی، پھر آپ کے پاس بلال رضی اللہ عنہ آئے اور جس وقت فجر طلوع ہوئی آپ کو نماز کی خبر دی تو آپ نے فجر کی دو رکعتیں ( سنتیں ) پڑھیں۔ اس کے بعد نماز کے لیے نکلے۔ آگے دونوں کی روایتیں ایک جیسی ہیں۔ آپ ( اس وقت ) فرما رہے تھے: «اللهم اجعل في قلبي نورا، واجعل في لساني نورا، واجعل في سمعي نورا، واجعل في بصري نورا، واجعل خلفي نورا، وأمامي نورا، واجعل من فوقي نورا، ومن تحتي نورا، اللهم وأعظم لي نورا» اے اللہ! تو نور پیدا فرما میرے دل میں، میری زبان میں، میرے کان میں، میری نگاہ میں، میرے پیچھے، میرے آگے، میرے اوپر اور میرے نیچے۔ اور اے اللہ! میرے لیے نور کو بڑا بنا دے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 1354,
			"arabicnumber": 1354,
			"text": "اس طریق سے بھی حصین سے اسی جیسی روایت مروی ہے اس میں «وأعظم لي نورا» کا جملہ ہے۔ ابوداؤد کہتے ہیں: اسی طرح ابوخالد دالانی نے اس حدیث میں «عن حبيبٍ» کہا ہے اور سلمہ بن کہیل نے «عن أبي رشدين عن ابن عباس» کہا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 1355,
			"arabicnumber": 1355,
			"text": "فضل بن عباس رضی اللہ عنہما کہتے ہیں کہ میں نے نبی اکرم صلی اللہ علیہ وسلم کے پاس ایک رات گزاری تاکہ دیکھوں کہ آپ نماز کیسے پڑھتے ہیں، تو آپ اٹھے اور وضو کیا، پھر دو رکعتیں پڑھیں، آپ صلی اللہ علیہ وسلم کا قیام آپ کے رکوع کے برابر اور رکوع سجدے کے برابر تھا، پھر آپ صلی اللہ علیہ وسلم سوئے رہے، پھر جاگے تو وضو اور مسواک کیا، پھر سورۃ آل عمران کی یہ پانچ آیتیں «إن في خلق السموات والأرض واختلاف الليل والنهار» ( آل عمران: ۱۹۰ ) اخیر تک پڑھیں اور پھر اسی طرح آپ کرتے رہے یہاں تک کہ آپ صلی اللہ علیہ وسلم نے دس رکعتیں ادا کیں، پھر کھڑے ہوئے اور ایک رکعت پڑھی اور اس سے وتر ( طاق ) کر لیا، اس وقت مؤذن نے اذان دی، مؤذن خاموش ہو گیا تو رسول اللہ صلی اللہ علیہ وسلم اٹھے اور ہلکی سی دو رکعتیں ادا کیں پھر بیٹھے رہے یہاں تک کہ فجر پڑھی۔ ابوداؤد کہتے ہیں: ابن بشار کی روایت کا بعض حصہ مجھ پر مخفی رہا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 1356,
			"arabicnumber": 1356,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ میں ایک رات اپنی خالہ ام المؤمنین میمونہ کے پاس رہا، شام ہو جانے کے بعد رسول اللہ صلی اللہ علیہ وسلم تشریف لائے اور پوچھا: کیا بچے نے نماز پڑھ لی؟ لوگوں نے کہا: ہاں، پھر آپ صلی اللہ علیہ وسلم لیٹ گئے یہاں تک کہ جب رات اس قدر گزر گئی جتنی اللہ کو منظور تھی تو آپ اٹھے اور وضو کر کے سات یا پانچ رکعتیں وتر کی پڑھیں اور صرف آخر میں سلام پھیرا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 1357,
			"arabicnumber": 1357,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ میں نے اپنی خالہ ام المؤمنین میمونہ بنت حارث رضی اللہ عنہ کے گھر رات گزاری تو نبی اکرم صلی اللہ علیہ وسلم نے عشاء پڑھی پھر ( گھر ) تشریف لائے تو چار رکعتیں پڑھیں، پھر سو گئے پھر اٹھ کر نماز پڑھنے لگے تو میں آپ صلی اللہ علیہ وسلم کے بائیں جانب کھڑا ہو گیا آپ نے مجھے گھما کر اپنے دائیں جانب کھڑا کر لیا، پھر پانچ رکعتیں پڑھیں اور سو گئے یہاں تک کہ مجھے آپ صلی اللہ علیہ وسلم کے خراٹوں کی آواز سنائی دینے لگی، پھر آپ صلی اللہ علیہ وسلم اٹھے اور دو رکعتیں پڑھیں پھر نکلے اور جا کر فجر پڑھی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 1358,
			"arabicnumber": 1358,
			"text": "سعید بن جبیر سے روایت ہے کہ ابن عباس رضی اللہ عنہما نے یہ قصہ ان سے بیان کیا ہے، اس میں ہے: آپ صلی اللہ علیہ وسلم کھڑے ہوئے اور دو دو کر کے آٹھ رکعتیں پڑھیں، پھر پانچ رکعتیں وتر کی پڑھیں اور ان کے بیچ میں بیٹھے نہیں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 1359,
			"arabicnumber": 1359,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم فجر کی سنتوں کو لے کر تیرہ رکعتیں پڑھتے تھے: دو دو کر کے چھ رکعتیں پڑھتے اور وتر کی پانچ رکعتیں پڑھتے اور صرف ان کے آخر میں قعدہ کرتے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 1360,
			"arabicnumber": 1360,
			"text": "عروہ کہتے ہیں کہ ام المؤمنین عائشہ رضی اللہ عنہا نے انہیں خبر دی کہ نبی اکرم صلی اللہ علیہ وسلم رات کو فجر کی سنتوں کو لے کر کل تیرہ رکعتیں پڑھتے تھے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 1361,
			"arabicnumber": 1361,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے عشاء پڑھی پھر کھڑے ہو کر آٹھ رکعتیں پڑھیں اور دو رکعتیں فجر کی دونوں اذانوں کے درمیان پڑھیں، انہیں آپ کبھی نہیں چھوڑتے تھے۔ جعفر بن مسافر کی روایت میں ہے: اور دو رکعتیں دونوں اذانوں کے درمیان بیٹھ کر پڑھیں۔ انہوں نے «جالسا» ( بیٹھ کر ) کا اضافہ کیا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 1362,
			"arabicnumber": 1362,
			"text": "عبداللہ بن ابی قیس کہتے ہیں میں نے ام المؤمنین عائشہ رضی اللہ عنہا سے پوچھا: رسول اللہ صلی اللہ علیہ وسلم وتر کتنی رکعتیں پڑھتے تھے؟ انہوں نے جواب دیا: کبھی چار اور تین، کبھی چھ اور تین، کبھی آٹھ اور تین اور کبھی دس اور تین، کبھی بھی آپ وتر میں سات سے کم اور تیرہ سے زائد رکعتیں نہیں پڑھتے تھے۔ ابوداؤد کہتے ہیں: احمد بن صالح نے اضافہ کیا ہے کہ آپ صلی اللہ علیہ وسلم فجر سے پہلے کی رکعتوں کو وتر نہیں کرتے تھے، میں نے پوچھا: انہیں وتر کرنے کا کیا مطلب؟ تو وہ بولیں: انہیں نہیں چھوڑتے تھے اور احمد نے چھ اور تین کا ذکر نہیں کیا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 1363,
			"arabicnumber": 1363,
			"text": "اسود بن یزید سے روایت ہے کہ وہ ام المؤمنین عائشہ رضی اللہ عنہا کے پاس گئے اور ان سے رسول اللہ صلی اللہ علیہ وسلم کی رات کی نماز ( تہجد ) کے بارے میں پوچھا تو انہوں نے کہا: رات کو آپ تیرہ رکعتیں پڑھتے تھے۔ پھر گیارہ رکعتیں پڑھنے لگے اور دو رکعتیں چھوڑ دیں، پھر وفات کے وقت آپ نو رکعتیں پڑھنے لگے تھے اور آپ کی رات کی آخری نماز وتر ہوتی تھی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 1364,
			"arabicnumber": 1364,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کے غلام کریب کہتے ہیں کہ میں نے ابن عباس سے پوچھا: رسول اللہ صلی اللہ علیہ وسلم کی رات کی نماز ( تہجد ) کیسے ہوتی تھی؟ تو انہوں نے کہا: ایک رات میں آپ کے پاس رہا، آپ صلی اللہ علیہ وسلم ام المؤمنین میمونہ کے پاس تھے، آپ سو گئے، جب ایک تہائی یا آدھی رات گزر گئی تو بیدار ہوئے اور اٹھ کر مشکیزے کے پاس گئے، جس میں پانی رکھا تھا، وضو فرمایا، میں نے بھی آپ صلی اللہ علیہ وسلم کے ساتھ وضو کیا، پھر آپ کھڑے ہوئے اور میں آپ صلی اللہ علیہ وسلم کے بائیں پہلو میں کھڑا ہو گیا تو آپ نے مجھے اپنے دائیں جانب کر لیا، پھر اپنا ہاتھ میرے سر پر رکھا جیسے آپ میرے کان مل رہے ہوں گویا مجھے بیدار کرنا چاہتے ہوں، پھر آپ صلی اللہ علیہ وسلم نے ہلکی سی دو رکعتیں پڑھیں ان میں سے ہر رکعت میں آپ نے سورۃ فاتحہ پڑھی، پھر سلام پھیر دیا، پھر آپ صلی اللہ علیہ وسلم نے نماز پڑھی یہاں تک کہ مع وتر گیارہ رکعتیں ادا کیں، پھر سو گئے، اس کے بعد بلال رضی اللہ عنہ آئے اور کہنے لگے: اللہ کے رسول! نماز، تو آپ صلی اللہ علیہ وسلم کھڑے ہوئے اور دو رکعتیں پڑھیں پھر آپ نے لوگوں کو نماز پڑھائی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 1365,
			"arabicnumber": 1365,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ میں نے اپنی خالہ ام المؤمنین میمونہ رضی اللہ عنہا کے پاس ایک رات گزاری تو نبی اکرم صلی اللہ علیہ وسلم رات کو اٹھ کر نماز پڑھنے لگے، آپ نے تیرہ رکعتیں پڑھیں، ان میں فجر کی دونوں رکعتیں بھی شامل تھیں، میرا اندازہ ہے کہ آپ صلی اللہ علیہ وسلم کا قیام ہر رکعت میں سورۃ مزمل کے بقدر ہوتا تھا ، نوح کی روایت میں یہ نہیں ہے: اس میں فجر کی دونوں رکعتیں بھی شامل تھیں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 1366,
			"arabicnumber": 1366,
			"text": "زید بن خالد جہنی رضی اللہ عنہ سے روایت ہے، انہوں نے کہا کہ آج رات میں رسول اللہ صلی اللہ علیہ وسلم کی نماز ( تہجد ) ضرور دیکھ کر رہوں گا، چنانچہ میں آپ کی چوکھٹ یا دروازے پر ٹیک لگا کر سوئے رہا، رسول اللہ صلی اللہ علیہ وسلم نے پہلے ہلکی سی دو رکعتیں پڑھیں، پھر دو رکعتیں لمبی، بہت لمبی بلکہ بہت زیادہ لمبی پڑھیں، پھر دو رکعتیں ان سے کچھ ہلکی، پھر دو رکعتیں ان سے بھی کچھ ہلکی، پھر دو رکعتیں ان سے بھی ہلکی، پھر دو رکعتیں ان سے بھی ہلکی پڑھیں، پھر وتر پڑھی، اس طرح یہ کل تیرہ رکعتیں ہوئیں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 1367,
			"arabicnumber": 1367,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کے غلام کریب سے روایت ہے کہ عبداللہ بن عباس رضی اللہ عنہما نے انہیں خبر دی کہ انہوں نے ایک رات ام المؤمنین میمونہ رضی اللہ عنہا کے ہاں گزاری، وہ آپ کی خالہ تھیں، وہ کہتے ہیں: میں تکیے کے عرض میں لیٹا اور رسول اللہ صلی اللہ علیہ وسلم اور آپ کی اہلیہ اس کے طول میں لیٹیں، پھر نبی اکرم صلی اللہ علیہ وسلم سو گئے، جب آدھی رات یا کچھ کم و بیش گزری تو رسول اللہ صلی اللہ علیہ وسلم بیدار ہوئے اور بیٹھ کر اپنے منہ پر ہاتھ مل کر نیند دور کی، پھر سورۃ آل عمران کے آخر کی دس آیتیں پڑھیں، اس کے بعد اٹھے اور لٹکے ہوئے مشکیزے کے پاس گئے اور وضو کیا اور اچھی طرح سے کیا، پھر نماز پڑھنے لگے، میں بھی اٹھا اور میں نے بھی آپ صلی اللہ علیہ وسلم ہی کی طرح سارا کام کیا، پھر آپ کے پہلو میں جا کر کھڑا ہو گیا، آپ صلی اللہ علیہ وسلم نے اپنا دایاں ہاتھ میرے سر پر رکھا اور میرا کان پکڑ کر ملنے لگے، پھر آپ صلی اللہ علیہ وسلم نے دو رکعتیں پڑھیں، پھر دو رکعتیں، پھر دو رکعتیں، پھر دو رکعتیں، پھر دو رکعتیں اور پھر دو رکعتیں، قعنبی کی روایت میں یوں ہے: دو دو رکعتیں چھ مرتبہ پڑھیں، پھر وتر پڑھی، پھر لیٹ گئے یہاں تک کہ مؤذن آیا تو آپ صلی اللہ علیہ وسلم اٹھے اور ہلکی سی دو رکعتیں پڑھیں پھر نکلے اور فجر پڑھائی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 1368,
			"arabicnumber": 1368,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا فرماتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: عمل کرتے رہو جتنا تم سے ہو سکے، اس لیے کہ اللہ تعالیٰ ( ثواب دینے سے ) نہیں تھکتا یہاں تک کہ تم ( عمل کرنے سے ) تھک جاؤ، اللہ تعالیٰ کے نزدیک سب سے پسندیدہ عمل وہ ہے جو پابندی کے ساتھ کیا جائے اگرچہ وہ کم ہو ، چنانچہ آپ صلی اللہ علیہ وسلم جب کوئی کام شروع کرتے تو اس پر جمے رہتے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 1369,
			"arabicnumber": 1369,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے عثمان بن مظعون رضی اللہ عنہ کو بلا بھیجا، تو وہ آپ کے پاس آئے تو آپ صلی اللہ علیہ وسلم نے فرمایا: عثمان! کیا تم نے میرے طریقے سے بے رغبتی کی ہے؟ ، انہوں نے جواب دیا: نہیں اللہ کے رسول! اللہ کی قسم، ایسی بات نہیں، میں تو آپ ہی کی سنت کا طالب رہتا ہوں، آپ صلی اللہ علیہ وسلم نے فرمایا: میں تو سوتا بھی ہوں، نماز بھی پڑھتا ہوں، روزے بھی رکھتا ہوں اور نہیں بھی رکھتا، اور عورتوں سے نکاح بھی کرتا ہوں، عثمان! تم اللہ سے ڈرو، کیونکہ تم پر تمہاری بیوی کا حق ہے، تمہارے مہمان کا بھی حق ہے، تمہاری جان کا حق ہے، لہٰذا کبھی روزہ رکھو اور کبھی نہ رکھو، اسی طرح نماز پڑھو اور سویا بھی کرو ۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 1370,
			"arabicnumber": 1370,
			"text": "علقمہ کہتے ہیں کہ میں نے ام المؤمنین عائشہ رضی اللہ عنہا سے پوچھا: رسول اللہ صلی اللہ علیہ وسلم کے عمل کا حال کیسا تھا؟ کیا آپ عمل کے لیے کچھ دن خاص کر لیتے تھے؟ انہوں نے کہا: نہیں، آپ صلی اللہ علیہ وسلم کا ہر عمل مداومت و پابندی کے ساتھ ہوتا تھا اور تم میں کون اتنی طاقت رکھتا ہے جتنی رسول اللہ صلی اللہ علیہ وسلم رکھتے تھے؟ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 121
			}
		}
	]
}