{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"6": "Prayer (Kitab Al-Salat): Detailed Injunctions about Ramadan"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1371,
			"arabicnumber": 1371,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم بغیر تاکیدی حکم دئیے رمضان کے قیام کی ترغیب دلاتے، پھر فرماتے: جس نے رمضان میں ایمان کی حالت میں اور ثواب کی نیت سے قیام کیا تو اس کے تمام سابقہ گناہ معاف کر دئیے جائیں گے ، رسول اللہ صلی اللہ علیہ وسلم کی وفات تک معاملہ اسی طرح رہا، پھر ابوبکر رضی اللہ عنہ کی خلافت اور عمر رضی اللہ عنہ کی خلافت کے شروع تک یہی معاملہ رہا ۱؎۔ ابوداؤد کہتے ہیں: اور اسی طرح عقیل، یونس اور ابواویس نے «من قام رمضان» کے الفاظ کے ساتھ روایت کیا ہے اور عقیل کی روایت میں «من صام رمضان وقامه» ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1372,
			"arabicnumber": 1372,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جس نے روزے رمضان ایمان کی حالت میں اور ثواب کی نیت سے رکھے اس کے پچھلے تمام گناہ معاف کر دیئے جائیں گے، اور جس نے شب قدر میں ایمان کی حالت میں اور ثواب کی نیت سے قیام کیا اس کے بھی پچھلے تمام گناہ معاف کر دیئے جائیں گے ۔ ابوداؤد کہتے ہیں: اسی طرح اسے یحییٰ بن ابی کثیر نے ابوسلمہ سے اور محمد بن عمرو نے ابوسلمہ سے روایت کیا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1373,
			"arabicnumber": 1373,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا فرماتی ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے مسجد میں نماز پڑھی تو آپ کے ساتھ کچھ اور لوگوں نے بھی پڑھی، پھر آپ صلی اللہ علیہ وسلم نے اگلی رات کو بھی پڑھی تو لوگوں کی تعداد بڑھ گئی پھر تیسری رات کو بھی لوگ جمع ہوئے تو رسول اللہ صلی اللہ علیہ وسلم نکلے ہی نہیں، جب صبح ہوئی تو فرمایا: میں نے تمہارے عمل کو دیکھا، لیکن مجھے سوائے اس اندیشے کے کسی اور چیز نے نکلنے سے نہیں روکا کہ کہیں وہ تم پر فرض نہ کر دی جائے ۱؎ اور یہ بات رمضان کی ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1374,
			"arabicnumber": 1374,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ لوگ رمضان میں مسجد کے اندر الگ الگ نماز پڑھا کرتے تھے تو رسول اللہ صلی اللہ علیہ وسلم نے مجھے حکم دیا، میں نے آپ کے لیے چٹائی بچھائی تو آپ صلی اللہ علیہ وسلم نے اس پر نماز پڑھی، پھر آگے انہوں نے یہی واقعہ ذکر کیا، اس میں ہے: نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: لوگو! اللہ کی قسم! میں نے بحمد اللہ یہ رات غفلت میں نہیں گذاری اور نہ ہی مجھ پر تمہارا یہاں ہونا مخفی رہا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1375,
			"arabicnumber": 1375,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1376,
			"arabicnumber": 1376,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا فرماتی ہیں کہ جب رمضان کا آخری عشرہ آتا تو نبی اکرم صلی اللہ علیہ وسلم راتوں کو جاگتے اور ( عبادت کے لیے ) کمربستہ ہو جاتے اور اپنے گھر والوں کو بھی بیدار کرتے۔ ابوداؤد کہتے ہیں: ابویعفور کا نام عبدالرحمٰن بن عبید بن نسطاس ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1377,
			"arabicnumber": 1377,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1378,
			"arabicnumber": 1378,
			"text": "زر کہتے ہیں کہ ابومنذر! مجھے شب قدر کے بارے میں بتائیے؟ اس لیے کہ ہمارے شیخ یعنی عبداللہ بن مسعود رضی اللہ عنہ سے جب اس کے بارے میں پوچھا گیا تو انہوں نے کہا: جو پورے سال قیام کرے اسے پا لے گا، ابی ابن کعب رضی اللہ عنہ نے جواب دیا: اللہ تعالیٰ ابوعبدالرحمٰن پر رحم فرمائے، اللہ کی قسم! انہیں اچھی طرح معلوم ہے کہ یہ رات رمضان میں ہے ( مسدد نے اس میں یہ اضافہ کیا ہے لیکن انہیں یہ ناپسند تھا کہ لوگ بھروسہ کر کے بیٹھ جائیں یا ان کی خواہش تھی کہ لوگ بھروسہ نہ کر لیں، ( آگے سلیمان بن حرب اور مسدد دونوں کی روایتوں میں اتفاق ہے ) اللہ کی قسم! یہ رات رمضان میں ہے اور ستائیسویں رات ہے، اس سے باہر نہیں، میں نے پوچھا: اے ابومنذر! آپ کو یہ کیوں کر معلوم ہوا؟ انہوں نے جواب دیا: اس علامت سے جو رسول اللہ صلی اللہ علیہ وسلم نے ہم کو بتائی تھی۔ ( عاصم کہتے ہیں میں نے زر سے پوچھا: وہ علامت کیا تھی؟ جواب دیا: اس رات ( کے بعد جو صبح ہوتی ہے اس میں ) سورج طشت کی طرح نکلتا ہے، جب تک بلندی کو نہ پہنچ جائے، اس میں کرنیں نہیں ہوتیں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1379,
			"arabicnumber": 1379,
			"text": "عبداللہ بن انیس رضی اللہ عنہ کہتے ہیں کہ میں بنی سلمہ کی مجلس میں تھا، اور ان میں سب سے چھوٹا تھا، لوگوں نے کہا: رسول اللہ صلی اللہ علیہ وسلم سے ہمارے لیے شب قدر کے بارے میں کون پوچھے گا؟ یہ رمضان کی اکیسویں صبح کی بات ہے، تو میں نکلا اور میں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ مغرب پڑھی، پھر آپ کے گھر کے دروازے پر کھڑا ہو گیا، تو آپ صلی اللہ علیہ وسلم میرے پاس سے گزرے اور فرمایا: اندر آ جاؤ ، میں اندر داخل ہو گیا، آپ کا شام کا کھانا آیا تو آپ نے مجھے دیکھا کہ میں کھانا تھوڑا ہونے کی وجہ سے کم کم کھا رہا ہوں، جب کھانے سے فارغ ہوئے تو فرمایا: مجھے میرا جوتا دو ، پھر آپ کھڑے ہوئے اور میں بھی آپ کے ساتھ کھڑا ہوا، پھر آپ صلی اللہ علیہ وسلم نے فرمایا: لگتا ہے تمہیں مجھ سے کوئی کام ہے؟ ، میں نے کہا: جی ہاں، مجھے قبیلہ بنی سلمہ کے کچھ لوگوں نے آپ کے پاس بھیجا ہے، وہ شب قدر کے سلسلے میں پوچھ رہے ہیں، آپ صلی اللہ علیہ وسلم نے پوچھا: آج کون سی رات ہے؟ ، میں نے کہا: بائیسویں رات، آپ صلی اللہ علیہ وسلم نے فرمایا: یہی شب قدر ہے ، پھر لوٹے اور فرمایا: یا کل کی رات ہو گی آپ کی مراد تیئسویں رات تھی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1380,
			"arabicnumber": 1380,
			"text": "عبداللہ بن انیس جہنی رضی اللہ عنہ کہتے ہیں کہ میں نے عرض کیا: اللہ کے رسول! ایک غیر آباد جگہ پر میرا گھر ہے میں اسی میں رہتا ہوں اور بحمداللہ وہیں نماز پڑھتا ہوں، آپ مجھے کوئی ایسی رات بتا دیجئیے کہ میں اس میں اس مسجد میں آیا کروں، آپ صلی اللہ علیہ وسلم نے فرمایا: تیئسویں شب کو آیا کرو ۔ محمد بن ابراہیم کہتے ہیں: میں نے عبداللہ بن انیس رضی اللہ عنہ کے بیٹے سے پوچھا: تمہارے والد کیسے کرتے تھے؟ انہوں نے کہا: جب عصر پڑھنی ہوتی تو مسجد میں داخل ہوئے پھر کسی کام سے باہر نہیں نکلتے یہاں تک کہ فجر پڑھ لیتے، پھر جب فجر پڑھ لیتے تو اپنی سواری مسجد کے دروازے پر پاتے اور اس پر بیٹھ کر اپنے بادیہ کو واپس آ جاتے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1381,
			"arabicnumber": 1381,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: تم اسے ( یعنی شب قدر کو ) رمضان کے آخری دس دنوں میں تلاش کرو جب نو راتیں باقی رہ جائیں ( یعنی اکیسویں شب کو ) اور جب سات راتیں باقی رہ جائیں ( یعنی تئیسویں شب کو ) اور جب پانچ راتیں باقی رہ جائیں ( یعنی پچیسویں شب کو ) ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1382,
			"arabicnumber": 1382,
			"text": "ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ کہ رسول اللہ صلی اللہ علیہ وسلم رمضان کے درمیانی عشرے ( دہے ) میں اعتکاف فرماتے تھے، ایک سال آپ صلی اللہ علیہ وسلم نے اعتکاف فرمایا یہاں تک کہ جب اکیسویں رات آئی جس میں آپ اعتکاف سے نکل آتے تھے، تو آپ صلی اللہ علیہ وسلم نے فرمایا: جن لوگوں نے میرے ساتھ اعتکاف کیا ہے اب وہ آخر کے دس دن بھی اعتکاف کریں، میں نے یہ ( قدر کی ) رات دیکھ لی تھی پھر مجھے بھلا دی گئی اور میں نے اپنے آپ کو دیکھا کہ میں اس رات کی صبح کو کیچڑ اور پانی میں سجدہ کر رہا ہوں، لہٰذا تم یہ رات آخری عشرے میں تلاش کرو اور وہ بھی طاق راتوں میں ۔ ابوسعید رضی اللہ عنہ کہتے ہیں: پھر اسی رات یعنی اکیسویں کی رات میں بارش ہوئی چونکہ مسجد چھپر کی تھی، اس لیے ٹپکی۔ ابوسعید رضی اللہ عنہ کہتے ہیں: میں نے اپنی آنکھوں سے دیکھا کہ رسول اللہ صلی اللہ علیہ وسلم کی پیشانی اور ناک پر اکیسویں رات کی صبح کو پانی اور کیچڑ کا نشان تھا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1383,
			"arabicnumber": 1383,
			"text": "ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: شب قدر کو رمضان کے آخری عشرے میں تلاش کرو اور اسے نویں، ساتویں اور پانچویں شب میں ڈھونڈو ۔ ابونضرہ کہتے ہیں: میں نے کہا: اے ابوسعید! آپ ہم میں سے سب سے زیادہ اعداد و شمار جانتے ہیں، انہوں نے کہا: ہاں، میں نے کہا: نویں، ساتویں اور پانچویں رات سے کیا مراد ہے؟ فرمایا: جب ( ۲۱ ) دن گزر جائیں تو اس کے بعد والی رات نویں ہے، اور جب ( ۲۳ ) دن گزر جائیں تو اس کے بعد والی رات ساتویں ہے، اور جب ( ۲۵ ) دن گزر جائیں تو اس کے بعد والی رات پانچویں ہے۔ ابوداؤد کہتے ہیں: مجھے نہیں معلوم اس میں سے کچھ مجھ پر مخفی رہ گیا ہے یا نہیں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1384,
			"arabicnumber": 1384,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ہم سے فرمایا: شب قدر کو رمضان کی سترہویں، اکیسویں اور تئیسویں رات میں تلاش کرو ، پھر چپ ہو گئے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1385,
			"arabicnumber": 1385,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: شب قدر کو اخیر کی سات راتوں میں تلاش کرو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1386,
			"arabicnumber": 1386,
			"text": "معاویہ بن ابی سفیان سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے شب قدر کے متعلق فرمایا: شب قدر ستائیسویں رات ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1387,
			"arabicnumber": 1387,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم سے شب قدر کے متعلق پوچھا گیا اور میں ( اس گفتگو کو ) سن رہا تھا تو آپ صلی اللہ علیہ وسلم نے فرمایا: یہ پورے رمضان میں کسی بھی رات ہو سکتی ہے ۱؎ ۔ ابوداؤد کہتے ہیں: سفیان اور شعبہ نے یہ حدیث ابواسحاق کے واسطے سے عبداللہ بن عمر رضی اللہ عنہما پر موقوفًا روایت کی ہے اور ان دونوں نے اسے نبی اکرم صلی اللہ علیہ وسلم سے مرفوعاً نہیں نقل کیا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1388,
			"arabicnumber": 1388,
			"text": "عبداللہ بن عمرو رضی اللہ عنہما سے روایت ہے کہ کہ نبی اکرم صلی اللہ علیہ وسلم نے ان سے فرمایا: قرآن مجید ایک مہینے میں پڑھا کرو ، انہوں نے عرض کیا: مجھے اس سے زیادہ کی طاقت ہے، آپ صلی اللہ علیہ وسلم نے فرمایا: تو بیس دن میں پڑھا کرو ، عرض کیا: مجھے اس سے بھی زیادہ طاقت ہے، آپ صلی اللہ علیہ وسلم نے فرمایا: تو پندرہ دن میں پڑھا کرو ، عرض کیا: مجھے اس سے بھی زیادہ طاقت ہے، آپ صلی اللہ علیہ وسلم نے فرمایا: تو دس دن میں پڑھا کرو ، عرض کیا: مجھے اس سے بھی زیادہ طاقت ہے، آپ صلی اللہ علیہ وسلم نے فرمایا: سات دن میں پڑھا کرو، اور اس پر ہرگز زیادتی نہ کرنا ۔ ابوداؤد کہتے ہیں: مسلم ( مسلم بن ابراہیم ) کی روایت زیادہ کامل ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1389,
			"arabicnumber": 1389,
			"text": "عبداللہ بن عمرو رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے فرمایا: ہر مہینے میں تین دن روزہ رکھا کرو اور قرآن ایک مہینے میں ختم کیا کرو ، پھر میرے اور آپ کے درمیان کم و زیادہ کرنے کی بات ہوئی ۱؎ آخر کار آپ صلی اللہ علیہ وسلم نے فرمایا: اچھا تو ایک دن روزہ رکھا کرو اور ایک دن افطار کیا کرو ۔ عطا کہتے ہیں: ہم نے اپنے والد سے روایت میں اختلاف کیا ہے، ہم میں سے بعض نے سات دن اور بعض نے پانچ دن کی روایت کی ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1390,
			"arabicnumber": 1390,
			"text": "عبداللہ بن عمرو رضی اللہ عنہما سے روایت ہے کہ انہوں نے عرض کیا: اللہ کے رسول! میں قرآن کتنے دنوں میں ختم کروں؟ فرمایا: ایک ماہ میں ، کہا: میں اس سے زیادہ کی قدرت رکھتا ہوں ( ابوموسیٰ یعنی محمد بن مثنیٰ اس بات کو باربار دہراتے رہے ) آپ اسے کم کرتے گئے یہاں تک کہ آپ صلی اللہ علیہ وسلم نے فرمایا: اسے سات دن میں ختم کیا کرو ، کہا: میں اس سے زیادہ کی طاقت رکھتا ہوں، فرمایا: وہ قرآن نہیں سمجھتا جو اسے تین دن سے کم میں پڑھے ۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1391,
			"arabicnumber": 1391,
			"text": "عبداللہ بن عمرو رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے فرمایا: قرآن ایک مہینے میں پڑھا کرو ، انہوں نے کہا: مجھے اس سے زیادہ کی طاقت ہے، آپ صلی اللہ علیہ وسلم نے فرمایا: تو تین دن میں پڑھا کرو ۔ ابوعلی کہتے ہیں: میں نے ابوداؤد کو کہتے سنا کہ احمد بن حنبل کہتے تھے: عیسیٰ بن شاذان سمجھدار آدمی ہیں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1392,
			"arabicnumber": 1392,
			"text": "ابن الہاد کہتے ہیں کہ مجھ سے نافع بن جبیر بن مطعم نے پوچھا: تم کتنے دنوں میں قرآن پڑھتے ہو؟ تو میں نے کہا: میں اس کے حصے نہیں کرتا، یہ سن کر مجھ سے نافع نے کہا: ایسا نہ کہو کہ میں اس کے حصے نہیں کرتا، اس لیے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: میں نے قرآن کا ایک حصہ پڑھا ۱؎ ۔ ابن الہاد کہتے ہیں: میرا خیال ہے کہ انہوں نے اسے مغیرہ بن شعبہ سے نقل کیا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1393,
			"arabicnumber": 1393,
			"text": "اوس بن حذیفہ رضی اللہ عنہ کہتے ہیں کہ ہم لوگ ثقیف کے ایک وفد میں رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے، وفد کے وہ لوگ جن سے معاہدہ ہوا تھا، مغیرہ بن شعبہ رضی اللہ عنہ کے پاس ٹھہرے اور بنی مالک کا قیام رسول اللہ صلی اللہ علیہ وسلم نے اپنے خیمے میں کرایا، ( مسدد کہتے ہیں: اوس بھی اس وفد میں شامل تھے، جو ثقیف کی جانب سے رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا تھا ) اوس کہتے ہیں: تو ہر رات آپ صلی اللہ علیہ وسلم عشاء کے بعد ہمارے پاس آتے اور ہم سے گفتگو کرتے۔ ابو سعید خدری رضی اللہ عنہ کی روایت میں اضافہ ہے کہ ( آپ گفتگو ) کھڑے کھڑے کرتے اور دیر تک کھڑے رہنے کی وجہ سے آپ کبھی ایک پیر پر اور کبھی دوسرے پیر پر بوجھ ڈالتے اور زیادہ تر ان واقعات کا تذکرہ کرتے، جو آپ صلی اللہ علیہ وسلم کو اپنی قوم قریش کی جانب سے پیش آئے تھے، پھر فرماتے: ہم اور وہ برابر نہ تھے، ہم مکہ میں کمزور اور ناتواں تھے، پھر جب ہم نکل کر مدینہ آ گئے تو جنگ کا ڈول ہمارے اور ان کے بیچ رہتا، کبھی ہم ان پر غالب آتے اور کبھی وہ ہم پر ۔ ایک رات آپ صلی اللہ علیہ وسلم کو حسب معمول وقت پر آنے میں تاخیر ہو گئی تو ہم نے آپ سے پوچھا: آج رات آپ نے آنے میں تاخیر کر دی؟ آپ صلی اللہ علیہ وسلم نے فرمایا: آج قرآن مجید کا میرا ایک حصہ تلاوت سے رہ گیا تھا، مجھے اسے پورا کئے بغیر آنا اچھا نہ لگا ۔ اوس کہتے ہیں: میں نے رسول اللہ صلی اللہ علیہ وسلم کے اصحاب سے پوچھا کہ وہ لوگ کیسے حصے مقرر کرتے تھے؟ تو انہوں نے کہا: پہلا حزب ( حصہ ) تین سورتوں کا، دوسرا حزب ( حصہ ) پانچ سورتوں کا، تیسرا سات سورتوں کا، چوتھا نو سورتوں کا، پانچواں گیارہ اور چھٹا تیرہ سورتوں کا اور ساتواں پورے مفصل کا ۱؎۔ ابوداؤد کہتے ہیں: ابوسعید ( عبداللہ بن سعید الاشیخ ) کی روایت کامل ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1394,
			"arabicnumber": 1394,
			"text": "عبداللہ بن عمرو رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو شخص قرآن کو تین دن سے کم میں پڑھتا ہے سمجھتا نہیں ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1395,
			"arabicnumber": 1395,
			"text": "عبداللہ بن عمرو رضی اللہ عنہما سے روایت ہے کہ انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے پوچھا: قرآن کتنے دنوں میں پڑھا جائے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: چالیس دن میں ، پھر فرمایا: ایک ماہ میں ، پھر فرمایا: بیس دن میں ، پھر فرمایا: پندرہ دن میں ، پھر فرمایا: دس دن میں ، پھر فرمایا: سات دن میں ، آپ صلی اللہ علیہ وسلم سات سے نیچے نہیں اترے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Shadh"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1396,
			"arabicnumber": 1396,
			"text": "علقمہ اور اسود کہتے ہیں کہ ابن مسعود رضی اللہ عنہ کے پاس ایک شخص آیا اور کہنے لگا: میں ایک رکعت میں مفصل پڑھ لیتا ہوں، انہوں نے کہا: کیا تم اس طرح پڑھتے ہو جیسے شعر جلدی جلدی پڑھا جاتا ہے یا جیسے سوکھی کھجوریں درخت سے جھڑتی ہیں؟ لیکن نبی اکرم صلی اللہ علیہ وسلم دو ہم مثل سورتوں کو جیسے نجم اور رحمن ایک رکعت میں، اقتربت اور الحاقة ایک رکعت میں، والطور اور الذاريات ایک رکعت میں، إذا وقعت اور نون ایک رکعت میں، سأل سائل اور النازعات ایک رکعت میں، ويل للمطففين اور عبس ایک رکعت میں، المدثر اور المزمل ایک رکعت میں، هل أتى اور لا أقسم بيوم القيامة ایک رکعت میں، عم يتسائلون اور المرسلات ایک رکعت میں، اور اسی طرح الدخان اور إذا الشمس كورت ایک رکعت میں ملا کر پڑھتے تھے۔ ابوداؤد کہتے ہیں: یہ ابن مسعود کی ترتیب ہے، اللہ ان پر رحم کرے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1397,
			"arabicnumber": 1397,
			"text": "عبدالرحمٰن بن یزید کہتے ہیں کہ میں نے ابو مسعود رضی اللہ عنہ سے پوچھا آپ بیت اللہ کا طواف کر رہے تھے تو آپ نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم کا ارشاد ہے: جس نے کسی رات میں سورۃ البقرہ کے آخر کی دو آیتیں پڑھیں تو یہ اس کے لیے کافی ہوں گی ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1398,
			"arabicnumber": 1398,
			"text": "عبداللہ بن عمرو بن العاص رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو شخص دس آیتوں ( کی تلاوت ) کے ساتھ قیام اللیل کرے گا وہ غافلوں میں نہیں لکھا جائے گا، جو سو آیتوں ( کی تلاوت ) کے ساتھ قیام کرے گا وہ عابدوں میں لکھا جائے گا، اور جو ایک ہزار آیتوں ( کی تلاوت ) کے ساتھ قیام کرے گا وہ بے انتہاء ثواب جمع کرنے والوں میں لکھا جائے گا ۔ ابوداؤد کہتے ہیں: ابن حجیرہ الاصغر سے مراد عبداللہ بن عبدالرحمٰن بن حجیرہ ہیں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1399,
			"arabicnumber": 1399,
			"text": "عبداللہ بن عمرو رضی اللہ عنہما کہتے ہیں کہ ایک شخص رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا اور عرض کیا: اللہ کے رسول! مجھے قرآن مجید پڑھائیے، آپ صلی اللہ علیہ وسلم نے فرمایا: ان تین سورتوں کو پڑھو جن کے شروع میں «الر» ہے ۱؎ ، اس نے کہا: میں عمر رسیدہ ہو چکا ہوں، میرا دل سخت اور زبان موٹی ہو گئی ہے ( اس لیے اس قدر نہیں پڑھ سکتا ) ، آپ صلی اللہ علیہ وسلم نے فرمایا: پھر «حم»والی تینوں سورتیں پڑھا کرو ، اس شخص نے پھر وہی پہلی بات دہرائی، آپ صلی اللہ علیہ وسلم نے فرمایا: تو «مسبحات» میں سے تین سورتیں پڑھا کرو ، اس شخص نے پھر پہلی بات دہرا دی اور عرض کیا: اللہ کے رسول! مجھے ایک جامع سورۃ سکھا دیجئیے، رسول اللہ صلی اللہ علیہ وسلم نے اس کو «إذا زلزلت الأرض» سکھائی، جب آپ صلی اللہ علیہ وسلم اس سے فارغ ہوئے تو اس شخص نے کہا: اس ذات کی قسم جس نے آپ کو رسول برحق بنا کر بھیجا، میں کبھی اس پر زیادہ نہیں کروں گا، جب آدمی واپس چلا گیا تو نبی اکرم صلی اللہ علیہ وسلم نے دو مرتبہ فرمایا: «أفلح الرويجل» ( بوڑھا کامیاب ہو گیا ) ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1400,
			"arabicnumber": 1400,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: قرآن کی ایک سورۃ جو تیس آیتوں والی ہے اپنے پڑھنے والے کی سفارش کرے گی یہاں تک کہ اس کی مغفرت ہو جائے اور وہ «تبارك الذي بيده الملك» ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 30
			}
		}
	]
}