{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"8": "Prayer (Kitab Al-Salat): Detailed Injunctions about Witr"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1416,
			"arabicnumber": 1416,
			"text": "علی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اے قرآن والو! ۱؎ وتر پڑھا کرو اس لیے کہ اللہ وتر (طاق) ہے اور وتر کو پسند کرتا ہے“۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1417,
			"arabicnumber": 1417,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ نے نبی اکرم صلی اللہ علیہ وسلم سے اسی مفہوم کی حدیث روایت کی ہے اس میں اتنا مزید ہے: ایک اعرابی نے کہا: آپ کیا کہہ رہے ہیں؟ تو عبداللہ بن مسعود نے کہا: یہ حکم تمہارے اور تمہارے ساتھیوں کے لیے نہیں ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1418,
			"arabicnumber": 1418,
			"text": "خارجہ بن حذافہ عدوی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ہمارے پاس تشریف لائے اور فرمایا: اللہ نے ایک ایسی نماز کے ذریعے تمہاری مدد کی ہے جو سرخ اونٹوں سے بھی تمہارے لیے زیادہ بہتر ہے اور وہ وتر ہے، اس کا وقت اس نے تمہارے لیے عشاء سے طلوع فجر تک مقرر کیا ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1419,
			"arabicnumber": 1419,
			"text": "بریدہ رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: وتر حق ہے ۱؎ جو اسے نہ پڑھے وہ ہم میں سے نہیں، وتر حق ہے، جو اسے نہ پڑھے ہم میں سے نہیں، وتر حق ہے، جو اسے نہ پڑھے ہم سے نہیں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1420,
			"arabicnumber": 1420,
			"text": "ابن محیریز کہتے ہیں کہ بنو کنانہ کے ایک شخص نے جسے مخدجی کہا جاتا تھا، شام کے ایک شخص سے سنا جسے ابومحمد کہا جاتا تھا وہ کہہ رہا تھا: وتر واجب ہے، مخدجی نے کہا: میں یہ سن کر عبادہ بن صامت رضی اللہ عنہ کے پاس گیا اور ان سے بیان کیا تو عبادہ نے کہا: ابو محمد نے غلط کہا، میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے: پانچ نمازیں ہیں جو اللہ نے بندوں پر فرض کی ہیں، پس جس شخص نے ان کو اس طرح ادا کیا ہو گا کہ ان کو ہلکا سمجھ کر ان میں کچھ بھی کمی نہ کی ہو گی تو اس کے لیے اللہ کے پاس جنت میں داخل کرنے کا عہد ہو گا، اور جو شخص ان کو ادا نہ کرے گا تو اس کے لیے اللہ کے پاس کوئی عہد نہیں، اللہ چاہے تو اسے عذاب دے اور چاہے تو اسے جنت میں داخل کرے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1421,
			"arabicnumber": 1421,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ دیہات کے ایک شخص نے نبی اکرم صلی اللہ علیہ وسلم سے تہجد کی نماز کے بارے میں پوچھا تو آپ نے اپنی دونوں انگلیوں سے اشارہ کرتے ہوئے فرمایا: اس طرح دو دو رکعتیں ہیں اور آخر رات میں وتر ایک رکعت ہے ۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1422,
			"arabicnumber": 1422,
			"text": "ابوایوب انصاری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: وتر ہر مسلمان پر حق ہے جو پانچ پڑھنا چاہے پانچ پڑھے، جو تین پڑھنا چاہے تین پڑھے اور جو ایک پڑھنا چاہے ایک پڑھے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1423,
			"arabicnumber": 1423,
			"text": "ابی بن کعب رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم وتر میں «سبح اسم ربك الأعلى» اور «قل للذين كفروا» ( یعنی«قل ياأيها الكافرون» ) اور «الله الواحد الصمد» ( یعنی «قل هو الله أحد» ) پڑھا کرتے تھے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1424,
			"arabicnumber": 1424,
			"text": "عبدالعزیز بن جریج کہتے ہیں کہ میں نے ام المؤمنین عائشہ رضی اللہ عنہا سے پوچھا: رسول اللہ صلی اللہ علیہ وسلم وتر میں کون سی سورتیں پڑھتے تھے؟ پھر انہوں نے اسی مفہوم کی حدیث بیان کی، اور کہا تیسری رکعت میں آپ «قل هو الله أحد» اور معوذتین ( یعنی «قل اعوذ برب الفلق» اور «قل اعوذ برب الناس» ) پڑھتے تھے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1425,
			"arabicnumber": 1425,
			"text": "حسن بن علی رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھے چند کلمات سکھائے جنہیں میں وتر میں کہا کرتا ہوں ( ابن جواس کی روایت میں ہے جنہیں میں وتر کے قنوت میں کہا کروں ) وہ کلمات یہ ہیں: «اللهم اهدني فيمن هديت، وعافني فيمن عافيت، وتولني فيمن توليت، وبارك لي فيما أعطيت، وقني شر ما قضيت إنك تقضي ولا يقضى عليك، وإنه لا يذل من واليت، ولا يعز من عاديت، تباركت ربنا وتعاليت» ۱؎۔ اے اللہ! مجھے ہدایت دے ان لوگوں میں ( داخل کر کے ) جن کو تو نے ہدایت دی ہے اور مجھے عافیت دے ان لوگوں میں ( داخل کر کے ) جن کو تو نے عافیت دی ہے اور میری کارسازی فرما ان لوگوں میں ( داخل کر کے ) جن کی تو نے کارسازی کی ہے اور مجھے میرے لیے اس چیز میں برکت دے جو تو نے عطا کی ہے اور مجھے اس چیز کی برائی سے بچا جو تو نے مقدر کی ہے، تو فیصلہ کرتا ہے اور تیرے خلاف فیصلہ نہیں کیا جا سکتا۔ جسے تو دوست رکھے وہ ذلیل نہیں ہو سکتا اور جس سے تو دشمنی رکھے وہ عزت نہیں پا سکتا، اے ہمارے رب تو بابرکت اور بلند و بالا ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1426,
			"arabicnumber": 1426,
			"text": "اس طریق سے بھی ابواسحاق سے اسی سند کے ساتھ اسی مفہوم کی حدیث مروی ہے لیکن اس کے آخر میں ہے کہ اسے وہ وتر کی قنوت میں کہتے تھے اور «أقولهن في الوتر» کا ذکر نہیں کیا ہے۔ ابوداؤد کہتے ہیں: ابوالحوراء کا نام ربیعہ بن شیبان ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1427,
			"arabicnumber": 1427,
			"text": "علی بن ابی طالب رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم وتر کے آخر میں یہ دعا پڑھتے تھے: «اللهم إني أعوذ برضاك من سخطك، وبمعافاتك من عقوبتك، وأعوذ بك منك لا أحصي ثناء عليك أنت كما أثنيت على نفسك» اے اللہ! میں تیری ناراضگی سے تیری رضا کی، تیری سزا سے تیری معافی کی اور تجھ سے تیری پناہ چاہتا ہوں، میں تیری تعریف شمار نہیں کر سکتا، تو اسی طرح ہے جیسے تو نے خود اپنی تعریف کی ہے ۔ ابوداؤد کہتے ہیں: ہشام حماد کے سب سے پہلے استاذ ہیں اور مجھے یحییٰ بن معین کے واسطہ سے یہ بات پہنچی ہے کہ انہوں کہا ہے کہ ہشام سے سوائے حماد بن سلمہ کے کسی اور نے روایت نہیں کی۔ ابوداؤد کہتے ہیں: عیسیٰ بن یونس نے سعید بن ابی عروبہ سے، سعید نے قتادہ سے، قتادہ نے سعید بن عبدالرحمٰن بن ابزی سے، سعید نے اپنے والد عبدالرحمٰن بن ابزی سے اور ابن ابزی نے ابی بن کعب رضی اللہ عنہ سے روایت کی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے وتر میں قنوت رکوع سے پہلے پڑھی۔ ابوداؤد کہتے ہیں: عیسیٰ بن یونس نے اس حدیث کو فطر بن خلیفہ سے بھی روایت کیا ہے اور فطر نے زبید سے، زبید نے سعید بن عبدالرحمٰن بن ابزی سے، سعید نے اپنے والد عبدالرحمٰن بن ابزی سے، ابن ابزی نے ابی بن کعب رضی اللہ عنہ سے اور ابی نے نبی اکرم صلی اللہ علیہ وسلم سے اسی کے مثل روایت کی ہے۔ نیز حفص بن غیاث سے مروی ہے، انہوں نے مسعر سے، مسعر نے زبید سے، زبید نے سعید بن عبدالرحمٰن بن ابزیٰ سے، سعید نے اپنے والد عبدالرحمٰن سے اور عبدالرحمٰن نے ابی بن کعب رضی اللہ عنہ سے روایت کی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے وتر میں رکوع سے قبل قنوت پڑھی ۔ ابوداؤد کہتے ہیں: سعید کی حدیث قتادہ سے مروی ہے، اسے یزید بن زریع نے سعید سے، سعید نے قتادہ سے، قتادہ نے عزرہ سے، عزرہ نے سعید بن عبدالرحمٰن بن ابزی سے، سعید نے اپنے والد عبدالرحمٰن بن ابزی سے اور ابن ابزی نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہے، اس میں قنوت کا ذکر نہیں ہے اور نہ ابی بن کعب رضی اللہ عنہ کا۔ اور اسی طرح اسے عبدالاعلی اور محمد بن بشر العبدی نے روایت کیا ہے، اور ان کا سماع کوفہ میں عیسیٰ بن یونس کے ساتھ ہے، انہوں نے بھی قنوت کا تذکرہ نہیں کیا ہے۔ نیز اسے ہشام دستوائی اور شعبہ نے قتادہ سے روایت کیا ہے، لیکن انہوں نے بھی قنوت کا ذکر نہیں کیا ہے۔ زبید کی روایت کو سلیمان اعمش، شعبہ، عبدالملک بن ابی سلیمان اور جریر بن حازم سبھی نے روایت کیا ہے، ان میں سے کسی ایک نے بھی قنوت کا ذکر نہیں کیا ہے، سوائے حفص بن غیاث کی روایت کے جسے انہوں نے مسعر کے واسطے سے زبید سے نقل کیا ہے، اس میں رکوع سے پہلے قنوت کا ذکر ہے۔ ابوداؤد کہتے ہیں: حفص کی یہ حدیث مشہور نہیں ہے، ہم کو اندیشہ ہے کہ حفص نے مسعر کے علاوہ کسی اور سے روایت کی ہو۔ ابوداؤد کہتے ہیں: یہ بھی مروی ہے کہ ابی بن کعب قنوت رمضان کے نصف میں پڑھا کرتے تھے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1428,
			"arabicnumber": 1428,
			"text": "محمد بن سیرین اپنے بعض اصحاب سے روایت کرتے ہیں کہ ابی بن کعب رضی اللہ عنہ نے رمضان میں ان کی امامت کی اور وہ رمضان کے نصف آخر میں قنوت پڑھتے تھے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1429,
			"arabicnumber": 1429,
			"text": "حسن بصری سے روایت ہے کہ عمر بن خطاب رضی اللہ عنہ نے لوگوں کو ابی بن کعب رضی اللہ عنہ کی امامت پر جمع کر دیا، وہ لوگوں کو بیس راتوں تک نماز ( تراویح ) پڑھایا کرتے تھے اور انہیں قنوت نصف اخیر ہی میں پڑھاتے تھے اور جب آخری عشرہ ہوتا تو مسجد نہیں آتے اپنے گھر ہی میں نماز پڑھا کرتے، لوگ کہتے کہ ابی بھاگ گئے۔ ابوداؤد کہتے ہیں: یہ دلیل ہے اس بات کی کہ قنوت کے بارے میں جو کچھ ذکر کیا گیا وہ غیر معتبر ہے اور یہ دونوں حدیثیں ابی بن کعب رضی اللہ عنہ کی اس حدیث کے ضعف پر دلالت کرتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے وتر میں قنوت پڑھی ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1430,
			"arabicnumber": 1430,
			"text": "ابی بن کعب رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جب وتر میں سلام پھیرتے تو «سبحان الملك القدوس» کہتے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1431,
			"arabicnumber": 1431,
			"text": "ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو شخص وتر پڑھے بغیر سو جائے یا اسے پڑھنا بھول جائے تو جب بھی یاد آ جائے اسے پڑھ لے ۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1432,
			"arabicnumber": 1432,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ مجھے میرے خلیل ( یار، صادق، محمد ) صلی اللہ علیہ وسلم نے تین باتوں کی وصیت کی ہے، جن کو میں سفر اور حضر کہیں بھی نہیں چھوڑتا: چاشت کی دو رکعتیں، ہر ماہ تین دن کے روزے اور وتر پڑھے بغیر نہ سونے کی ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1433,
			"arabicnumber": 1433,
			"text": "ابو الدرداء رضی اللہ عنہ کہتے ہیں کہ مجھے میرے خلیل ( محمد ) صلی اللہ علیہ وسلم نے تین باتوں کی وصیت کی ہے، میں انہیں کسی صورت میں نہیں چھوڑتا، ایک تو مجھے ہر ماہ تین دن روزے رکھنے کی وصیت کی دوسرے وتر پڑھے بغیر نہ سونے کی اور تیسرے حضر ہو کہ سفر، چاشت کی نماز پڑھنے کی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1434,
			"arabicnumber": 1434,
			"text": "ابوقتادہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے ابوبکر رضی اللہ عنہ سے پوچھا: تم وتر کب پڑھتے ہو؟ ، انہوں نے عرض کیا: میں اول شب میں وتر پڑھتا ہوں، پھر آپ صلی اللہ علیہ وسلم نے عمر رضی اللہ عنہ سے پوچھا: تم کب پڑھتے ہو؟ ، انہوں نے عرض کیا: آخر شب میں، آپ صلی اللہ علیہ وسلم نے ابوبکر سے فرمایا کہ انہوں نے احتیاط پر عمل کیا، اور عمر سے فرمایا کہ انہوں نے مشکل کام اختیار کیا جو طاقت و قوت کا متقاضی ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1435,
			"arabicnumber": 1435,
			"text": "مسروق کہتے ہیں کہ میں نے ام المؤمنین عائشہ رضی اللہ عنہا سے پوچھا: رسول اللہ صلی اللہ علیہ وسلم وتر کب پڑھتے تھے؟ انہوں نے کہا: سبھی وقتوں میں آپ نے پڑھا ہے، شروع رات میں بھی پڑھا ہے، درمیان رات میں بھی اور آخری رات میں بھی لیکن جس وقت آپ کی وفات ہوئی آپ کی وتر صبح ہو چکنے کے قریب پہنچ گئی تھی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1436,
			"arabicnumber": 1436,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: صبح ہونے سے پہلے وتر پڑھ لیا کرو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1437,
			"arabicnumber": 1437,
			"text": "عبداللہ بن ابو قیس کہتے ہیں کہ میں نے ام المؤمنین عائشہ رضی اللہ عنہا سے رسول اللہ صلی اللہ علیہ وسلم کے وتر کے بارے میں پوچھا: انہوں نے کہا: کبھی شروع رات میں وتر پڑھتے اور کبھی آخری رات میں، میں نے پوچھا: آپ کی قرآت کیسی ہوتی تھی؟ کیا سری قرآت کرتے تھے یا جہری؟ انہوں نے کہا: آپ صلی اللہ علیہ وسلم دونوں طرح سے پڑھتے تھے، کبھی قرآت سری کرتے اور کبھی جہری، کبھی غسل کر کے سوتے اور کبھی وضو کر کے سو جاتے۔ ابوداؤد کہتے ہیں: قتیبہ کے علاوہ دوسروں نے کہا ہے کہ غسل سے عائشہ رضی اللہ عنہا کی مراد غسل جنابت ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1438,
			"arabicnumber": 1438,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: اپنی رات کی آخری نماز وتر کو بنایا کرو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1439,
			"arabicnumber": 1439,
			"text": "قیس بن طلق کہتے ہیں کہ طلق بن علی رضی اللہ عنہ رمضان میں ایک دن ہمارے پاس آئے، شام تک رہے روزہ افطار کیا، پھر اس رات انہوں نے ہمارے ساتھ قیام اللیل کیا، ہمیں وتر پڑھائی پھر اپنی مسجد میں گئے اور اپنے ساتھیوں کو نماز پڑھائی یہاں تک کہ جب صرف وتر باقی رہ گئی تو ایک شخص کو آگے بڑھایا اور کہا: اپنے ساتھیوں کو وتر پڑھاؤ، اس لیے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو کہتے سنا ہے کہ ایک رات میں دو وتر نہیں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1440,
			"arabicnumber": 1440,
			"text": "ابوسلمہ بن عبدالرحمٰن کہتے ہیں کہ ہم سے ابوہریرہ رضی اللہ عنہ نے بیان کرتے ہوئے کہا: اللہ کی قسم! میں تم لوگوں کے لیے رسول اللہ صلی اللہ علیہ وسلم کی نماز سے قریب ترین نماز پڑھوں گا، چنانچہ ابوہریرہ رضی اللہ عنہ ظہر کی آخری رکعت میں اور عشاء اور فجر میں دعائے قنوت پڑھتے تھے اور مومنوں کے لیے دعا کرتے اور کافروں پر لعنت بھیجتے تھے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1441,
			"arabicnumber": 1441,
			"text": "براء رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم فجر میں قنوت پڑھتے تھے۔ ابن معاذ نے «صلاة المغرب» ( نماز مغرب میں بھی ) کا بھی اضافہ کیا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1442,
			"arabicnumber": 1442,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک ماہ تک عشاء میں دعائے قنوت پڑھی، آپ اس میں دعا فرماتے:«اللهم نج الوليد بن الوليد اللهم نج سلمة بن هشام اللهم نج المستضعفين من المؤمنين اللهم اشدد وطأتك على مضر اللهم اجعلها عليهم سنين كسني يوسف» اے اللہ! ولید بن ولید کو نجات دے، اے اللہ! سلمہ بن ہشام کو نجات دے، اے اللہ! کمزور مومنوں کو نجات دے، اے اللہ! مضر پر اپنا عذاب سخت کر اور ان پر ایسا قحط ڈال دے جیسا یوسف ( علیہ السلام ) کے زمانے میں پڑا تھا ) ۔ ابوہریرہ کہتے ہیں: ایک دن رسول اللہ صلی اللہ علیہ وسلم نے فجر میں ان لوگوں کے لیے دعا نہیں کی، تو میں نے اس کا ذکر آپ سے کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا: تم نے نہیں دیکھا کہ یہ لوگ ( اب کافروں کی قید سے نکل کر مدینہ ) آ چکے ہیں؟ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1443,
			"arabicnumber": 1443,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ظہر، عصر، مغرب، عشاء اور فجر میں ہر نماز کے بعد ایک ماہ تک مسلسل قنوت پڑھی، جب آخری رکعت میں «سمع الله لمن حمده» کہتے تو آپ صلی اللہ علیہ وسلم بنی سلیم کے قبائل: رعل، ذکوان اور عصیہ کے حق میں بد دعا کرتے اور جو لوگ آپ کے پیچھے ہوتے آمین کہتے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1444,
			"arabicnumber": 1444,
			"text": "انس بن مالک رضی اللہ عنہ سے روایت ہے ان سے پوچھا گیا: کیا رسول اللہ صلی اللہ علیہ وسلم نے فجر میں دعائے قنوت پڑھی ہے؟ تو انہوں نے کہا: ہاں، پھر ان سے پوچھا گیا: رکوع سے پہلے یا بعد میں؟ تو انہوں نے کہا: رکوع کے بعد میں ۱؎۔ مسدد کی روایت میں ہے کہ تھوڑی مدت تک ۲؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1445,
			"arabicnumber": 1445,
			"text": "انس بن مالک رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے ایک ماہ تک قنوت پڑھی پھر اسے ترک کر دیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1446,
			"arabicnumber": 1446,
			"text": "محمد بن سیرین کہتے ہیں کہ مجھ سے اس شخص نے بیان کیا ہے جس نے نبی اکرم صلی اللہ علیہ وسلم کے ساتھ فجر پڑھی کہ جب آپ دوسری رکعت سے سر اٹھاتے تو تھوڑی دیر کھڑے رہتے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1447,
			"arabicnumber": 1447,
			"text": "زید بن ثابت رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے مسجد کے ایک حصہ کو چٹائی سے گھیر کر ایک حجرہ بنا لیا، آپ رات کو نکلتے اور اس میں نماز پڑھتے تھے، کچھ لوگوں نے بھی آپ کے ساتھ نماز پڑھنی شروع کر دی وہ ہر رات آپ کے پاس آنے لگے یہاں تک کہ ایک رات آپ صلی اللہ علیہ وسلم ان کی طرف نہیں نکلے، لوگ کھنکھارنے اور آوازیں بلند کرنے لگے، اور آپ کے دروازے پر کنکر مارنے لگے، تو رسول اللہ صلی اللہ علیہ وسلم غصے میں ان کی طرف نکلے اور فرمایا: لوگو! تم مسلسل ایسا کئے جا رہے تھے یہاں تک کہ مجھے گمان ہوا کہ کہیں تم پر یہ فرض نہ کر دی جائے، لہٰذا اب تم کو چاہیئے کہ گھروں میں نماز پڑھا کرو اس لیے کہ آدمی کی سب سے بہتر نماز وہ ہے جسے وہ اپنے گھر میں پڑھے ۱؎ سوائے فرض نماز کے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1448,
			"arabicnumber": 1448,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اپنی نماز میں سے کچھ گھروں میں پڑھا کرو، اور انہیں قبرستان نہ بناؤ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1449,
			"arabicnumber": 1449,
			"text": "عبداللہ بن حبشی خثعمی رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم سے پوچھا گیا: کون سا عمل افضل ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: نماز میں دیر تک کھڑے رہنا ، پھر پوچھا گیا: کون سا صدقہ افضل ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: کم مال والا محنت کی کمائی میں سے جو صدقہ دے ، پھر پوچھا گیا: کون سی ہجرت افضل ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: اس شخص کی ہجرت جو ان چیزوں کو چھوڑ دے جنہیں اللہ نے اس پر حرام کیا ہے ، پھر پوچھا گیا: کون سا جہاد افضل ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: اس شخص کا جہاد جس نے اپنی جان و مال کے ساتھ مشرکین سے جہاد کیا ہو ، پھر پوچھا گیا: کون سا قتل افضل ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: اللہ کی راہ میں جس کا خون بہایا گیا ہو اور جس کے گھوڑے کے ہاتھ پاؤں کاٹ لیے گئے ہوں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1450,
			"arabicnumber": 1450,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اللہ اس شخص پر رحم فرمائے جو رات کو اٹھے، پھر نماز پڑھے اپنی بیوی کو بھی جگائے تو وہ بھی نماز پڑھے، اگر وہ نہ اٹھے تو اس کے منہ پر پانی کے چھینٹے مارے، اللہ رحم فرمائے اس عورت پر جو رات کو اٹھ کر نماز پڑھے، اپنے شوہر کو بھی بیدار کرے، اگر وہ نہ اٹھے تو اس کے منہ پر پانی کے چھینٹے مارے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1451,
			"arabicnumber": 1451,
			"text": "ابو سعید خدری اور ابوہریرہ رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو رات کو بیدار ہو اور اپنی بیوی کو جگائے پھر دونوں دو دو رکعتیں پڑھیں تو وہ کثرت سے اللہ کا ذکر کرنے والے مردوں اور ذکر کرنے والی عورتوں میں لکھے جائیں گے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1452,
			"arabicnumber": 1452,
			"text": "عثمان رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: تم میں بہتر وہ شخص ہے جو قرآن سیکھے اور اسے سکھائے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1453,
			"arabicnumber": 1453,
			"text": "معاذ جہنی رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس نے قرآن پڑھا اور اس کی تعلیمات پر عمل کیا تو اس کے والدین کو قیامت کے روز ایسا تاج پہنایا جائے گا جس کی چمک سورج کی اس روشنی سے بھی زیادہ ہو گی جو تمہارے گھروں میں ہوتی ہے اگر وہ تمہارے درمیان ہوتا، ( پھر جب اس کے ماں باپ کا یہ درجہ ہے ) تو خیال کرو خود اس شخص کا جس نے قرآن پر عمل کیا، کیا درجہ ہو گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1454,
			"arabicnumber": 1454,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا نبی اکرم صلی اللہ علیہ وسلم سے روایت کرتی ہیں کہ آپ نے فرمایا: جو شخص قرآن پڑھتا ہو اور اس میں ماہر ہو تو وہ بڑی عزت والے فرشتوں اور پیغمبروں کے ساتھ ہو گا اور جو شخص اٹک اٹک کر پریشانی کے ساتھ پڑھے تو اسے دہرا ثواب ملے",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1455,
			"arabicnumber": 1455,
			"text": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جو بھی قوم ( جماعت ) اللہ کے گھروں یعنی مساجد میں سے کسی گھر یعنی مسجد میں جمع ہو کر کتاب اللہ کی تلاوت کرتی اور باہم اسے پڑھتی پڑھاتی ہے اس پر سکینت نازل ہوتی ہے، اسے اللہ کی رحمت ڈھانپ لیتی ہے، فرشتے اسے گھیرے میں لے لیتے ہیں اور اللہ تعالیٰ اس کا ذکر ان لوگوں میں کرتا ہے، جو اس کے پاس رہتے ہیں یعنی مقربین ملائکہ میں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1456,
			"arabicnumber": 1456,
			"text": "عقبہ بن عامر جہنی رضی اللہ عنہ کہتے ہیں کہ ایک دن رسول اللہ صلی اللہ علیہ وسلم ہمارے پاس آئے ہم صفہ ( چبوترے ) پر تھے، آپ صلی اللہ علیہ وسلم نے فرمایا: تم میں سے کون یہ پسند کرتا ہے کہ صبح کو بطحان یا عقیق جائے، پھر بڑی کوہان والے موٹے تازے دو اونٹ بغیر کوئی گناہ یا قطع رحمی کئے لے کر آئے؟ ، صحابہ نے کہا: اللہ کے رسول! ہم میں سے سبھوں کی یہ خواہش ہے، آپ صلی اللہ علیہ وسلم نے فرمایا: تو تم میں سے کوئی اگر روزانہ صبح کو مسجد جائے اور قرآن مجید کی دو آیتیں سیکھے تو یہ اس کے لیے ان دو اونٹنیوں سے بہتر ہے اور اسی طرح سے تین آیات سیکھے تو تین اونٹنیوں سے بہتر ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1457,
			"arabicnumber": 1457,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: «الحمد لله رب العالمين» ام القرآن اور ام الکتاب ہے اور سبع مثانی ۱؎ ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1458,
			"arabicnumber": 1458,
			"text": "ابوسعید بن معلی رضی اللہ عنہ سے کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم کا گزر ان کے پاس سے ہوا وہ نماز پڑھ رہے تھے، تو آپ نے انہیں بلایا، میں ( نماز پڑھ کر ) آپ کے پاس آیا، تو آپ صلی اللہ علیہ وسلم نے پوچھا: تم نے مجھے جواب کیوں نہیں دیا؟ ، عرض کیا: میں نماز پڑھ رہا تھا، آپ صلی اللہ علیہ وسلم نے فرمایا: کیا اللہ تعالیٰ نے یہ نہیں فرمایا: اے مومنو! جواب دو اللہ اور اس کے رسول کو، جب رسول اللہ تمہیں ایسے کام کے لیے بلائیں، جس میں تمہاری زندگی ہے میں تمہیں قرآن کی سب سے بڑی سورۃ سکھاؤں گا اس سے پہلے کہ میں مسجد سے نکلوں ، ( جب آپ صلی اللہ علیہ وسلم مسجد سے نکلنے لگے ) تو میں نے عرض کیا: اللہ کے رسول! ابھی آپ نے کیا فرمایا تھا؟ آپ صلی اللہ علیہ وسلم نے فرمایا: وہ سورۃ «الحمد لله رب العالمين» ہے اور یہی سبع مثانی ہے جو مجھے دی گئی ہے اور قرآن عظیم ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1459,
			"arabicnumber": 1459,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کو سات لمبی سورتیں دی گئیں ہیں ۱؎ اور موسیٰ ( علیہ السلام ) کو چھ دی گئی تھیں، جب انہوں نے تختیاں ( جن پر تورات لکھی ہوئی تھی ) زمین پر ڈال دیں تو دو آیتیں اٹھا لی گئیں اور چار باقی رہ گئیں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1460,
			"arabicnumber": 1460,
			"text": "ابی بن کعب رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اے ابومنذر! ۱؎ کتاب اللہ کی کون سی آیت تمہارے نزدیک سب سے باعظمت ۲؎ ہے؟ ، میں نے عرض کیا: اللہ اور اس کے رسول زیادہ جانتے ہیں، آپ صلی اللہ علیہ وسلم نے پھر فرمایا: ابومنذر! کتاب اللہ کی کون سی آیت تمہارے نزدیک سب سے بڑی ہے؟ ، میں نے عرض کیا: «الله لا إله إلا هو الحي القيوم» ، تو آپ صلی اللہ علیہ وسلم نے میرے سینے کو تھپتھپایا اور فرمایا: اے ابومنذر! تمہیں علم مبارک ہو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1461,
			"arabicnumber": 1461,
			"text": "ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ ایک شخص نے دوسرے شخص کو «قل هو الله أحد» باربار پڑھتے سنا، جب صبح ہوئی تو وہ رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا اور آپ سے اس کا تذکرہ کیا، گویا وہ اس سورت کو کمتر سمجھ رہا تھا، نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: قسم ہے اس ذات کی جس کے ہاتھ میں میری جان ہے، یہ ( سورۃ ) ایک تہائی قرآن کے برابر ہے",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1462,
			"arabicnumber": 1462,
			"text": "عقبہ بن عامر رضی اللہ عنہ کہتے ہیں کہ میں ایک سفر میں رسول اللہ صلی اللہ علیہ وسلم کے اونٹ کی نکیل پکڑ کر چل رہا تھا، آپ نے فرمایا: عقبہ! کیا میں تمہیں دو بہترین سورتیں نہ سکھاؤں؟ ، پھر آپ صلی اللہ علیہ وسلم نے مجھے «قل أعوذ برب الفلق» اور «قل أعوذ برب الناس» سکھائیں، لیکن آپ صلی اللہ علیہ وسلم نے مجھے ان دونوں ( کے سیکھنے ) سے بہت زیادہ خوش ہوتے نہ پایا، چنانچہ جب آپ صلی اللہ علیہ وسلم فجر کے لیے ( سواری سے ) اترے تو لوگوں کو نماز پڑھائی اور یہی دونوں سورتیں پڑھیں، پھر جب نماز سے فارغ ہوئے تو میری طرف متوجہ ہو کر فرمایا: عقبہ! تم نے انہیں کیا سمجھا ہے ۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1463,
			"arabicnumber": 1463,
			"text": "عقبہ بن عامر رضی اللہ عنہ کہتے ہیں کہ میں حجفہ اور ابواء کے درمیان رسول اللہ صلی اللہ علیہ وسلم کے ساتھ چل رہا تھا کہ اسی دوران اچانک ہمیں تیز آندھی اور شدید تاریکی نے ڈھانپ لیا تو رسول اللہ صلی اللہ علیہ وسلم «قل أعوذ برب الفلق» اور «قل أعوذ برب الناس» پڑھنے لگے، آپ صلی اللہ علیہ وسلم فرما رہے تھے: اے عقبہ! تم بھی ان دونوں کو پڑھ کر پناہ مانگو، اس لیے کہ ان جیسی سورتوں کے ذریعہ پناہ مانگنے والے کی طرح کسی پناہ مانگنے والے نے پناہ نہیں مانگی ۔ عقبہ کہتے ہیں: میں نے آپ صلی اللہ علیہ وسلم کو سنا آپ انہیں دونوں کے ذریعہ ہماری امامت فرما رہے تھے",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1464,
			"arabicnumber": 1464,
			"text": "عبداللہ بن عمرو رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: صاحب قرآن ( حافظ قرآن یا ناظرہ خواں ) سے کہا جائے گا: پڑھتے جاؤ اور چڑھتے جاؤ اور عمدگی کے ساتھ ٹھہر ٹھہر کر پڑھو جیسا کہ تم دنیا میں عمدگی سے پڑھتے تھے، تمہاری منزل وہاں ہے، جہاں تم آخری آیت پڑھ کر قرآت ختم کرو گے ۲؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 1465,
			"arabicnumber": 1465,
			"text": "قتادہ کہتے ہیں کہ میں نے انس رضی اللہ عنہ سے نبی اکرم صلی اللہ علیہ وسلم کی قرآت کے بارے میں پوچھا تو انہوں نے کہا: آپ صلی اللہ علیہ وسلم مد کو کھینچتے تھے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 1466,
			"arabicnumber": 1466,
			"text": "یعلیٰ بن مملک سے روایت ہے کہ انہوں نے ام سلمہ رضی اللہ عنہا سے رسول اللہ صلی اللہ علیہ وسلم کی قرآت اور نماز کے بارے میں پوچھا تو انہوں نے کہا: تم کہاں اور آپ صلی اللہ علیہ وسلم کی نماز کہاں؟ آپ نماز پڑھتے اور جتنی دیر پڑھتے اتنا ہی سوتے، پھر جتنا سو لیتے اتنی دیر نماز پڑھتے، پھر جتنی دیر نماز پڑھتے اتنی دیر سوتے یہاں تک کہ صبح ہو جاتی، پھر ام سلمہ نے آپ صلی اللہ علیہ وسلم کی قرآت بیان کی تو دیکھا کہ وہ ایک ایک حرف الگ الگ پڑھ رہی تھیں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 1467,
			"arabicnumber": 1467,
			"text": "عبداللہ بن مغفل رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فتح مکہ کے روز ایک اونٹنی پر سوار دیکھا، آپ سورۃ الفتح پڑھ رہے تھے اور ( ایک ایک آیت ) کئی بار دہرا رہے تھے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 1468,
			"arabicnumber": 1468,
			"text": "براء بن عازب رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: قرآن کو اپنی آواز سے زینت دو ۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 1469,
			"arabicnumber": 1469,
			"text": "سعد بن ابی وقاص رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو شخص قرآن خوش الحانی سے نہ پڑھے، وہ ہم میں سے نہیں ۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 1470,
			"arabicnumber": 1470,
			"text": "اس سند سے بھی سعد رضی اللہ عنہ سے اسی کے مثل حدیث مرفوعاً مروی ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 1471,
			"arabicnumber": 1471,
			"text": "عبیداللہ بن ابی یزید کہتے ہیں ہمارے پاس سے ابولبابہ رضی اللہ عنہ کا گزر ہوا تو ہم ان کے پیچھے ہو لیے یہاں تک کہ وہ اپنے گھر کے اندر داخل ہو گئے تو ہم بھی داخل ہو گئے تو دیکھا کہ ایک شخص بیٹھا ہوا ہے۔ بوسیدہ سا گھر ہے اور وہ بھی خستہ حال ہے، میں نے سنا: وہ کہہ رہا تھا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو کہتے ہوئے سنا ہے: جو قرآن کو خوش الحانی سے نہ پڑھے وہ ہم میں سے نہیں ہے ۔ عبدالجبار کہتے ہیں: میں نے ابن ابی ملیکہ سے کہا: اے ابو محمد! اگر کسی کی آواز اچھی نہ ہو تو کیا کرے؟ انہوں نے جواب دیا: جہاں تک ہو سکے اسے اچھی بنائے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 1472,
			"arabicnumber": 1472,
			"text": "محمد بن سلیمان انباری کا بیان ہے، وہ کہتے ہیں وکیع اور ابن عیینہ نے کہا ہے کہ اس کا مطلب یہ ہے کہ قرآن کے ذریعہ ( دیگر کتب یا ادیان سے ) بے نیاز ہو جائے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 1473,
			"arabicnumber": 1473,
			"text": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اللہ تعالیٰ کسی کی اتنی نہیں سنتا جتنی ایک خوش الحان رسول کی سنتا ہے جب کہ وہ قرآن کو خوش الحانی سے بلند آواز سے پڑھ رہا ہو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 1474,
			"arabicnumber": 1474,
			"text": "سعد بن عبادہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو بھی آدمی قرآن پڑھتا ہو پھر اسے بھول جائے تو قیامت کے دن وہ اللہ سے مجذوم ۱؎ ہو کر ملے گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 1475,
			"arabicnumber": 1475,
			"text": "عمر بن خطاب رضی اللہ عنہ کہتے ہیں کہ میں نے ہشام بن حکیم بن حزام رضی اللہ عنہ کو سورۃ الفرقان پڑھتے سنا، وہ اس طریقے سے ہٹ کر پڑھ رہے تھے جس طرح میں پڑھتا تھا حالانکہ مجھے خود رسول اللہ صلی اللہ علیہ وسلم نے پڑھایا تھا تو قریب تھا کہ میں ان پر جلدی کر بیٹھوں ۱؎ لیکن میں نے انہیں مہلت دی اور پڑھنے دیا یہاں تک کہ وہ فارغ ہو گئے تو میں نے ان کی چادر پکڑ کر انہیں گھسیٹا اور انہیں لے کر رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا، میں نے عرض کیا: اللہ کے رسول! میں نے انہیں سورۃ الفرقان اس کے برعکس پڑھتے سنا ہے جس طرح آپ نے مجھے سکھائی ہے، رسول اللہ صلی اللہ علیہ وسلم نے ہشام سے فرمایا: تم پڑھو ، انہوں نے ویسے ہی پڑھا جیسے میں نے پڑھتے سنا تھا، اس پر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: یہ اسی طرح نازل ہوئی ہے ، پھر مجھ سے فرمایا: تم پڑھو ، میں نے بھی پڑھا، آپ صلی اللہ علیہ وسلم نے فرمایا: اسی طرح نازل ہوئی ہے ، پھر فرمایا: قرآن مجید سات حرفوں ۲؎پر نازل ہوا ہے، لہٰذا جس طرح آسان لگے پڑھ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 1476,
			"arabicnumber": 1476,
			"text": "زہری کہتے ہیں کہ یہ حروف ( اگرچہ بظاہر مختلف ہوں ) ایک ہی معاملہ سے تعلق رکھتے ہیں، ان میں حلال و حرام میں اختلاف نہیں",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 1477,
			"arabicnumber": 1477,
			"text": "ابی بن کعب رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ابی! مجھے قرآن پڑھایا گیا، پھر مجھ سے پوچھا گیا: ایک حرف پر یا دو حرف پر؟ میرے ساتھ جو فرشتہ تھا، اس نے کہا: کہو: دو حرف پر، میں نے کہا: دو حرف پر، پھر مجھ سے پوچھا گیا: دو حرف پر یا تین حرف پر؟ اس فرشتے نے جو میرے ساتھ تھا، کہا: کہو: تین حرف پر، چنانچہ میں نے کہا: تین حرف پر، اسی طرح معاملہ سات حروف تک پہنچا ، آپ صلی اللہ علیہ وسلم نے فرمایا: ان میں سے ہر ایک حرف شافی اور کافی ہے، چا ہے تم «سميعا عليما» کہو یا«عزيزا حكيما» جب تک تم عذاب کی آیت کو رحمت پر اور رحمت کی آیت کو عذاب پر ختم نہ کرو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 1478,
			"arabicnumber": 1478,
			"text": "ابی بن کعب رضی اللہ عنہ سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم بنی غفار کے تالاب کے پاس تھے کہ آپ کے پاس جبرائیل علیہ السلام تشریف لائے اور فرمایا: اللہ عزوجل آپ کو حکم دے رہا ہے کہ آپ اپنی امت کو ایک حرف پر قرآن پڑھائیں ، آپ صلی اللہ علیہ وسلم نے فرمایا: میں اللہ سے اس کی بخشش اور مغفرت مانگتا ہوں، میری امت اتنی طاقت نہیں رکھتی ہے ، پھر دوبارہ آپ صلی اللہ علیہ وسلم کے پاس آئے اور اسی طرح سے کہا، یہاں تک کہ معاملہ سات حرفوں تک پہنچ گیا، تو انہوں نے کہا: اللہ آپ کو حکم دے رہا ہے کہ آپ اپنی امت کو سات حرفوں پر پڑھائیں، لہٰذا اب وہ جس حرف پر بھی پڑھیں گے وہ صحیح ہو گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 1479,
			"arabicnumber": 1479,
			"text": "نعمان بن بشیر رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: دعا عبادت ہے ۱؎، تمہارا رب فرماتا ہے: مجھ سے دعا کرو، میں تمہاری دعا قبول کروں گا ( سورۃ غافر: ۶۰ ) ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 1480,
			"arabicnumber": 1480,
			"text": "سعد رضی اللہ عنہ کے ایک بیٹے سے روایت ہے کہ انہوں نے کہا: میرے والد نے مجھے کہتے سنا: اے اللہ! میں تجھ سے جنت کا اور اس کی نعمتوں، لذتوں اور فلاں فلاں چیزوں کا سوال کرتا ہوں اور میں تیری پناہ مانگتا ہوں جہنم سے، اس کی زنجیروں سے، اس کے طوقوں سے اور فلاں فلاں بلاؤں سے، تو انہوں نے مجھ سے کہا: میرے بیٹے! میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے: عنقریب کچھ لوگ ایسے ہوں گے جو دعاؤں میں مبالغہ اور حد سے تجاوز کریں گے، لہٰذا تم بچو کہ کہیں تم بھی ان میں سے نہ ہو جاؤ جب تمہیں جنت ملے گی تو اس کی ساری نعمتیں خود ہی مل جائیں گی اور اگر تم جہنم سے بچا لیے گئے تو اس کی تمام بلاؤں سے خودبخود بچا لئے جاؤ گے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 1481,
			"arabicnumber": 1481,
			"text": "صحابی رسول فضالہ بن عبید رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک شخص کو نماز میں دعا کرتے سنا، اس نے نہ تو اللہ تعالیٰ کی بزرگی بیان کی اور نہ ہی نبی اکرم صلی اللہ علیہ وسلم پر درود ( نماز ) بھیجا تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اس شخص نے جلد بازی سے کام لیا ، پھر اسے بلایا اور اس سے یا کسی اور سے فرمایا: جب تم میں سے کوئی نماز پڑھے تو پہلے اپنے رب کی حمد و ثنا بیان کرے، پھر نبی اکرم صلی اللہ علیہ وسلم پر درود ( نماز ) بھیجے، اس کے بعد جو چاہے دعا مانگے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 1482,
			"arabicnumber": 1482,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جامع دعائیں ۱؎ پسند فرماتے اور جو دعا جامع نہ ہوتی اسے چھوڑ دیتے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 1483,
			"arabicnumber": 1483,
			"text": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تم میں سے کوئی اس طرح دعا نہ مانگے: اے اللہ! اگر تو چاہے تو مجھے بخش دے، اے اللہ! اگر تو چاہے تو مجھ پر رحم کر، بلکہ جزم کے ساتھ سوال کرے کیونکہ اللہ پر کوئی جبر کرنے والا نہیں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 1484,
			"arabicnumber": 1484,
			"text": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تم میں سے ہر ایک کی دعا قبول کی جاتی ہے جب تک وہ جلد بازی سے کام نہیں لیتا اور یہ کہنے نہیں لگتا کہ میں نے تو دعا مانگی لیکن میری دعا قبول ہی نہیں ہوئی ۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 1485,
			"arabicnumber": 1485,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: دیواروں پر پردہ نہ ڈالو، جو شخص اپنے بھائی کا خط اس کی اجازت کے بغیر دیکھتا ہے تو وہ جہنم میں دیکھ رہا ہے، اللہ سے سیدھی ہتھیلیوں سے دعا مانگو اور ان کی پشت سے نہ مانگو اور جب دعا سے فارغ ہو جاؤ تو اپنے ہاتھ اپنے چہروں پر پھیر لو ۔ ابوداؤد کہتے ہیں: یہ حدیث محمد بن کعب سے کئی سندوں سے مروی ہے۔ ساری سندیں ضعیف ہیں اور یہ طریق ( سند ) سب سے بہتر ہے اور یہ بھی ضعیف ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 1486,
			"arabicnumber": 1486,
			"text": "مالک بن یسار سکونی عوفی رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب تم اللہ سے مانگو تو اپنی سیدھی ہتھیلیوں سے مانگو اور ان کی پشت سے نہ مانگو ۔ ابوداؤد کہتے ہیں: سلیمان بن عبدالحمید نے کہا: ہمارے نزدیک انہیں یعنی مالک بن یسار کو صحابی ہونے کا شرف حاصل ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 1487,
			"arabicnumber": 1487,
			"text": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو دونوں طرح سے دعا مانگتے دیکھا اپنی دونوں ہتھیلیاں سیدھی کر کے بھی اور ان کی پشت اوپر کر کے بھی ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 1488,
			"arabicnumber": 1488,
			"text": "سلمان رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تمہارا رب بہت باحیاء اور کریم ( کرم والا ) ہے، جب اس کا بندہ اس کے سامنے اپنے دونوں ہاتھ اٹھاتا ہے تو انہیں خالی لوٹاتے ہوئے اسے اپنے بندے سے شرم آتی ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 1489,
			"arabicnumber": 1489,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ مانگنا یہ ہے کہ تم اپنے دونوں ہاتھ اپنے کندھوں کے بالمقابل یا ان کے قریب اٹھاؤ، اور استغفار یہ ہے کہ تم صرف ایک انگلی سے اشارہ کرو اور ابتہال ( عاجزی و گریہ وزاری سے دعا مانگنا ) یہ ہے کہ تم اپنے دونوں ہاتھ پوری طرح پھیلا دو۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 1490,
			"arabicnumber": 1490,
			"text": "اس سند سے بھی ابن عباس رضی اللہ عنہما سے یہی حدیث مروی ہے اس میں ہے: ابتہال اس طرح ہے اور انہوں نے دونوں ہاتھ اتنے بلند کئے کہ ہتھیلیوں کی پشت اپنے چہرے کے قریب کر دی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 1491,
			"arabicnumber": 1491,
			"text": "اس سند سے بھی ابن عباس رضی اللہ عنہما سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا، پھر راوی نے اسی طرح کی حدیث ذکر کی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 1492,
			"arabicnumber": 1492,
			"text": "یزید رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم جب دعا مانگتے تو اپنے دونوں ہاتھ اوپر اٹھاتے اور انہیں اپنے چہرے پر پھیرتے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 1493,
			"arabicnumber": 1493,
			"text": "بریدہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک شخص کو کہتے سنا: «اللهم إني أسألك أني أشهد أنك أنت الله لا إله إلا أنت، الأحد، الصمد، الذي لم يلد ولم يولد ولم يكن له كفوا أحد» اے اللہ! میں تجھ سے مانگتا ہوں اس وسیلے سے کہ: میں گواہی دیتا ہوں کہ تو ہی اللہ ہے، تیرے سوا کوئی اور معبود نہیں، تو تنہا اور ایسا بے نیاز ہے جس نے نہ تو جنا ہے اور نہ ہی وہ جنا گیا ہے اور نہ اس کا کوئی ہمسر ہے یہ سن کر آپ صلی اللہ علیہ وسلم نے فرمایا: تو نے اللہ سے اس کا وہ نام لے کر مانگا ہے کہ جب اس سے کوئی یہ نام لے کر مانگتا ہے تو عطا کرتا ہے اور جب کوئی دعا کرتا ہے تو قبول فرماتا ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 1494,
			"arabicnumber": 1494,
			"text": "اس سند سے بھی بریدہ رضی اللہ عنہ سے یہی حدیث مروی ہے اس میں ہے: «لقد سألت الله عزوجل باسمه الأعظم» تو نے اللہ سے اس کے اسم اعظم ( عظیم نام ) کا حوالہ دے کر سوال کیا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 1495,
			"arabicnumber": 1495,
			"text": "انس رضی اللہ عنہ سے روایت ہے کہ وہ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ بیٹھے ہوئے تھے اور ایک شخص نماز پڑھ رہا تھا، ( نماز سے فارغ ہو کر ) اس نے دعا مانگی: «اللهم إني أسألك بأن لك الحمد لا إله إلا أنت المنان بديع السموات والأرض يا ذا الجلال والإكرام يا حى يا قيوم» اے اللہ! میں تجھ سے مانگتا ہوں اس وسیلے سے کہ: ساری و حمد تیرے لیے ہے، تیرے سوا کوئی اور معبود نہیں، تو ہی احسان کرنے والا اور آسمانوں اور زمین کو پیدا کرنے والا ہے، اے جلال اور عطاء و بخشش والے، اے زندہ جاوید، اے آسمانوں اور زمینوں کو تھامنے والے! یہ سن کر نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: اس نے اللہ سے اس کے اس اسم اعظم ( عظیم نام ) کے حوالے سے دعا مانگی ہے کہ جب اس کے حوالے سے دعا مانگی جاتی ہے تو وہ دعا قبول فرماتا ہے اور سوال کیا جاتا ہے تو وہ دیتا ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 1496,
			"arabicnumber": 1496,
			"text": "اسماء بنت یزید رضی اللہ عنہا سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: اللہ کا اسم اعظم ( عظیم نام ) ان دونوں آیتوں«وإلهكم إله واحد لا إله إلا هو الرحمن الرحيم» ۱؎ اور سورۃ آل عمران کی ابتدائی آیت «الله لا إله إلا هو الحي القيوم» ۲؎ میں ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 1497,
			"arabicnumber": 1497,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ ان کا ایک لحاف چرا لیا گیا تو وہ اس کے چور پر بد دعا کرنے لگیں تو رسول اللہ صلی اللہ علیہ وسلم فرمانے لگے: تم اس کے گناہ میں کمی نہ کرو ۔ ابوداؤد کہتے ہیں: «لا تسبخي» کا مطلب ہے «لا تخففي عنه» یعنی اس کے گناہ میں تخفیف نہ کرو۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 1498,
			"arabicnumber": 1498,
			"text": "عمر رضی اللہ عنہ کہتے ہیں کہ میں نے نبی اکرم صلی اللہ علیہ وسلم سے عمرہ کرنے کی اجازت طلب کی، جس کی آپ نے مجھے اجازت دے دی اور فرمایا: میرے بھائی! مجھے اپنی دعاؤں میں نہ بھولنا ، آپ نے یہ ایسی بات کہی جس سے مجھے اس قدر خوشی ہوئی کہ اگر ساری دنیا اس کے بدلے مجھے مل جاتی تو اتنی خوشی نہ ہوتی۔ ( راوی حدیث ) شعبہ کہتے ہیں: پھر میں اس کے بعد عاصم سے مدینہ میں ملا۔ انہوں نے مجھے یہ حدیث سنائی اور اس وقت «لا تنسنا يا أخى من دعائك» کے بجائے «أشركنا يا أخى في دعائك» کے الفاظ کہے اے میرے بھائی ہمیں بھی اپنی دعاؤں میں شریک رکھنا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 1499,
			"arabicnumber": 1499,
			"text": "سعد بن ابی وقاص رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم میرے پاس سے گزرے، میں اس وقت اپنی دو انگلیوں سے اشارہ کرتے ہوئے دعا مانگ رہا تھا، آپ صلی اللہ علیہ وسلم نے فرمایا: ایک انگلی سے کرو، ایک انگلی سے کرو اور آپ نے شہادت کی انگلی سے اشارہ کیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 1500,
			"arabicnumber": 1500,
			"text": "سعد بن ابی وقاص رضی اللہ عنہ سے روایت ہے کہ وہ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ایک عورت ۱؎ کے پاس گئے، اس کے سامنے گٹھلیاں یا کنکریاں رکھی تھیں، جن سے وہ تسبیح گنتی تھی ۲؎، آپ صلی اللہ علیہ وسلم نے فرمایا: میں تمہیں ایک ایسی چیز بتاتا ہوں جو تمہارے لیے اس سے زیادہ آسان ہے یا اس سے افضل ہے ، پھر آپ صلی اللہ علیہ وسلم نے فرمایا: اس طرح کہا کرو: «سبحان الله عدد ما خلق في السماء وسبحان الله عدد ما خلق في الأرض وسبحان الله عدد ما خلق بين ذلك وسبحان الله عدد ما هو خالق والله أكبر مثل ذلك والحمد لله مثل ذلك ‏.‏ ولا إله إلا الله مثل ذلك ‏.‏ ولا حول ولا قوة إلا بالله مثل ذلك» ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 1501,
			"arabicnumber": 1501,
			"text": "یسیرہ رضی اللہ عنہا کہتی ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے انہیں حکم دیا کہ وہ تکبیر، تقدیس اور تہلیل کا اہتمام کیا کریں اور اس بات کا کہ وہ انگلیوں کے پوروں سے گنا کریں اس لیے کہ انگلیوں سے ( قیامت کے روز ) سوال کیا جائے گا اور وہ بولیں گی ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 1502,
			"arabicnumber": 1502,
			"text": "عبداللہ بن عمرو رضی اللہ عنہما کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو تسبیح گنتے دیکھا ( ابن قدامہ کی روایت میں ہے ) : اپنے دائیں ہاتھ پر ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 1503,
			"arabicnumber": 1503,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جویریہ رضی اللہ عنہا کے پاس سے نکلے ( پہلے ان کا نام برہ تھا ۱؎آپ نے اسے بدل دیا ) ، جب آپ صلی اللہ علیہ وسلم نکل کر آئے تب بھی وہ اپنے مصلیٰ پر تھیں اور جب واپس اندر گئے تب بھی وہ مصلیٰ پر تھیں، آپ صلی اللہ علیہ وسلم نے پوچھا: کیا تم جب سے اپنے اسی مصلیٰ پر بیٹھی ہو؟ ، انہوں نے کہا: ہاں، آپ صلی اللہ علیہ وسلم نے فرمایا: میں نے تمہارے پاس سے نکل کر تین مرتبہ چار کلمات کہے ہیں، اگر ان کا وزن ان کلمات سے کیا جائے جو تم نے ( اتنی دیر میں ) کہے ہیں تو وہ ان پر بھاری ہوں گے: «سبحان الله وبحمده عدد خلقه ورضا نفسه وزنة عرشه ومداد كلماته» میں پاکی بیان کرتا ہوں اللہ کی اور اس کی تعریف کرتا ہوں اس کی مخلوق کی تعداد کے برابر، اس کی مرضی کے مطابق، اس کے عرش کے وزن اور اس کے کلمات کی سیاہی کے برابر ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 1504,
			"arabicnumber": 1504,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ ابوذر رضی اللہ عنہ نے کہا: اللہ کے رسول! مال والے تو ثواب لے گئے، وہ نماز پڑھتے ہیں، جس طرح ہم پڑھتے ہیں، روزے رکھتے ہیں جس طرح ہم رکھتے ہیں، البتہ ان کے پاس ضرورت سے زیادہ مال ہے، جو وہ صدقہ کرتے ہیں اور ہمارے پاس مال نہیں ہے کہ ہم صدقہ کریں؟ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ابوذر! کیا میں تمہیں ایسے کلمات نہ سکھاؤں جنہیں ادا کر کے تم ان لوگوں کے برابر پہنچ سکتے ہو، جو تم پر ( ثواب میں ) بازی لے گئے ہیں، اور جو ( ثواب میں ) تمہارے پیچھے ہیں تمہارے برابر نہیں ہو سکتے، سوائے اس شخص کے جو تمہارے جیسا عمل کرے ، انہوں نے کہا: ضرور، اے اللہ کے رسول! آپ صلی اللہ علیہ وسلم نے فرمایا: ہر نماز کے بعد ( ۳۳ ) بار «الله اكبر» ( ۳۳ ) بار «الحمد الله» ( ۳۳ ) بار «سبحان الله» کہا کرو، اور آخر میں «لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير» پڑھا کرو جو ایسا کرے گا ) اس کے تمام گناہ بخش دئیے جائیں گے اگرچہ وہ سمندر کے جھاگ کے برابر ہوں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 1505,
			"arabicnumber": 1505,
			"text": "مغیرہ بن شعبہ رضی اللہ عنہ سے روایت ہے کہ معاویہ رضی اللہ عنہ نے انہیں لکھا کہ رسول اللہ صلی اللہ علیہ وسلم جب نماز سے سلام پھیرتے تو کیا پڑھتے تھے؟ اس پر مغیرہ نے معاویہ کو لکھوا کے بھیجا، اس میں تھا: رسول اللہ صلی اللہ علیہ وسلم: «لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير، اللهم لا مانع لما أعطيت ولا معطي لما منعت ولا ينفع ذا الجد منك الجد» کوئی معبود برحق نہیں سوائے اللہ کے، وہ اکیلا ہے، اس کا کوئی شریک نہیں، اسی کے لیے بادشاہت ہے، اسی کے لیے حمد ہے، وہ ہر چیز پر قادر ہے۔ اے اللہ! جو تو دے، اسے کوئی روک نہیں سکتا اور جو تو روک دے، اسے کوئی دے نہیں سکتا اور مالدار کو اس کی مال داری نفع نہیں دے سکتی پڑھتے تھے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 1506,
			"arabicnumber": 1506,
			"text": "ابوالزبیر کہتے ہیں کہ میں نے عبداللہ بن زبیر رضی اللہ عنہما کو منبر پر کہتے سنا: نبی اکرم صلی اللہ علیہ وسلم جب نماز سے فارغ ہوتے تو کہتے: «لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير، لا إله إلا الله مخلصين له الدين ولو كره الكافرون أهل النعمة والفضل والثناء الحسن، لا إله إلا الله مخلصين له الدين ولو كره الكافرون» اللہ کے سوا کوئی معبود برحق نہیں، وہ اکیلا ہے، اس کا کوئی شریک نہیں، اسی کے لیے بادشاہت ہے، اسی کے لیے حمد ہے، وہ ہر چیز پر قادر ہے، کوئی معبود برحق نہیں سوائے اللہ کے، ہم خالص اسی کی عبادت کرتے ہیں اگرچہ کافر برا سمجھیں، وہ احسان، فضل اور اچھی تعریف کا مستحق ہے۔ کوئی معبود برحق نہیں سوائے اللہ کے، ہم خالص اسی کی عبادت کرتے ہیں، اگرچہ کافر برا سمجھیں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 1507,
			"arabicnumber": 1507,
			"text": "ابوالزبیر کہتے ہیں کہ عبداللہ بن زبیر رضی اللہ عنہما ہر نماز کے بعد «لا إله إلا الله ***» ‏‏‏‏ کہا کرتے تھے پھر انہوں نے اس جیسی دعا کا ذکر کیا، البتہ اس میں اتنا اضافہ کیا: «ولا حول ولا قوة إلا بالله لا إله إلا الله لا نعبد إلا إياه له النعمة ***» ‏‏‏‏ اور پھر آگے بقیہ حدیث بیان کی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 1508,
			"arabicnumber": 1508,
			"text": "زید بن ارقم رضی اللہ عنہ کہتے ہیں کہ میں نے نبی اکرم صلی اللہ علیہ وسلم کو فرماتے سنا- ( سلیمان کی روایت میں اس طرح ہے: رسول اللہ صلی اللہ علیہ وسلم اپنی نماز کے بعد فرماتے تھے ) : «اللهم ربنا ورب كل شىء أنا شهيد أنك أنت الرب وحدك لا شريك لك، اللهم ربنا ورب كل شىء أنا شهيد أن محمدا عبدك ورسولك، اللهم ربنا ورب كل شىء، أن العباد كلهم إخوة، اللهم ربنا ورب كل شىء، اجعلني مخلصا لك وأهلي في كل ساعة في الدنيا والآخرة يا ذا الجلال والإكرام اسمع واستجب [ الله أكبر الأكبر ] اللهم نور السموات والأرض، الله أكبر الأكبر، حسبي الله ونعم الوكيل الله أكبر الأكبر» اے اللہ! ہمارا رب اور ہر چیز کا رب، میں گواہ ہوں کہ تو اکیلا رب ہے، تیرا کوئی شریک نہیں، اے اللہ! ہمارے رب! اور اے ہر چیز کے رب! میں گواہ ہوں کہ محمد ( صلی اللہ علیہ وسلم ) تیرے بندے اور تیرے رسول ہیں، اے اللہ! ہمارے رب! اور ہر چیز کے رب! میں گواہ ہوں کہ تمام بندے بھائی بھائی ہیں، اے اللہ! ہمارے رب! اور ہر چیز کے رب! مجھے اور میرے گھر والوں کو اپنا مخلص بنا لے دنیا و آخرت کی ہر ساعت میں، اے جلال، بزرگی اور عزت والے! سن لے اور قبول فرما لے، اللہ ہر بڑے سے بڑا ہے، اے اللہ! تو آسمانوں اور زمین کا نور ہے ( سلیمان بن داود کی روایت میں نور کے بجائے رب کا لفظ ہے ) اللہ ہر بڑے سے بڑا ہے، اللہ میرے لیے کافی ہے اور بہت بہتر وکیل ہے، اللہ ہر بڑے سے بڑا ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 1509,
			"arabicnumber": 1509,
			"text": "علی بن ابی طالب رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم جب نماز سے سلام پھیرتے تو کہتے: «اللهم اغفر لي ما قدمت وما أخرت، وما أسررت وما أعلنت، وما أسرفت، وما أنت أعلم به مني، أنت المقدم وأنت المؤخر لا إله إلا أنت» اے اللہ! میرے اگلے پچھلے گناہ معاف کر دے اور وہ تمام گناہ جنہیں میں نے چھپ کر اور کھلم کھلا کیا ہو، اور جو زیادتی کی ہو اسے اور اس گناہ کو جسے تو مجھ سے زیادہ جانتا ہے، بخش دے۔ تو جسے چاہے آگے کرے، جسے چاہے پیچھے کرے، تیرے سوا کوئی معبود برحق نہیں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 1510,
			"arabicnumber": 1510,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم یہ دعا مانگتے تھے: «رب أعني ولا تعن علي، وانصرني ولا تنصر علي، وامكر لي ولا تمكر علي، واهدني ويسر هداي إلي، وانصرني على من بغى علي، اللهم اجعلني لك شاكرا لك، ذاكرا لك، راهبا لك، مطواعا إليك مخبتا أو منيبا، رب تقبل توبتي، واغسل حوبتي، وأجب دعوتي، وثبت حجتي، واهد قلبي، وسدد لساني، واسلل سخيمة قلبي» اے میرے رب! میری مدد کر، میرے خلاف کسی کی مدد نہ کر، میری تائید کر، میرے خلاف کسی کی تائید نہ کر، ایسی چال چل جو میرے حق میں ہو، نہ کہ ایسی جو میرے خلاف ہو، مجھے ہدایت دے اور جو ہدایت مجھے ملنے والی ہے، اسے مجھ تک آسانی سے پہنچا دے، اس شخص کے مقابلے میں میری مدد کر، جو مجھ پر زیادتی کرے، اے اللہ! مجھے تو اپنا شکر گزار، اپنا یاد کرنے والا اور اپنے سے ڈرنے والا بنا، اپنا اطاعت گزار، اپنی طرف گڑگڑانے والا، یا دل لگانے والا بنا، اے میرے پروردگار! میری توبہ قبول کر، میرے گناہ دھو دے، میری دعا قبول فرما، میری دلیل مضبوط کر، میرے دل کو سیدھی راہ دکھا، میری زبان کو درست کر اور میرے دل سے حسد اور کینہ نکال دے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 1511,
			"arabicnumber": 1511,
			"text": "سفیان ثوری کہتے ہیں کہ میں نے عمرو بن مرہ سے اسی سند سے اسی مفہوم کی روایت سنی ہے، اس میں «يسر هداي إلي» کے بجائے«يسر الهدى إلي» ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 1512,
			"arabicnumber": 1512,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم جب سلام پھیرتے تو فرماتے: «اللهم أنت السلام ومنك السلام تباركت يا ذا الجلال والإكرام» ۱؎ اے اللہ تو ہی سلام ہے، تیری ہی طرف سے سلام ہے، تو بڑی برکت والا ہے، اے جلال اور بزرگی والے ۔ امام ابوداؤد رحمہ اللہ کہتے ہیں: سفیان کا سماع عمرو بن مرہ سے ہے، لوگوں نے کہا ہے: انہوں نے عمرو بن مرہ سے اٹھارہ حدیثیں سنی ہیں ۲؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 1513,
			"arabicnumber": 1513,
			"text": "ثوبان مولیٰ رسول اللہ صلی اللہ علیہ وسلم سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم جب نماز سے فارغ ہو کر پلٹتے تو تین مرتبہ استغفار کرتے، اس کے بعد «اللهم» کہتے، پھر راوی نے ام المؤمنین عائشہ رضی اللہ عنہا کی اوپر والی حدیث کے ہم معنی حدیث ذکر کی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 1514,
			"arabicnumber": 1514,
			"text": "ابوبکر صدیق رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو استغفار کرتا رہا اس نے گناہ پر اصرار نہیں کیا گرچہ وہ دن بھر میں ستر بار اس گناہ کو دہرائے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 1515,
			"arabicnumber": 1515,
			"text": "اغر مزنی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: میرے دل پر غفلت کا پردہ آ جاتا ہے، حالانکہ میں اپنے پروردگار سے ہر روز سو بار استغفار کرتا ہوں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 1516,
			"arabicnumber": 1516,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ ہم ایک مجلس میں رسول اللہ صلی اللہ علیہ وسلم کے سو بار: «رب اغفر لي وتب علي إنك أنت التواب الرحيم» اے میرے رب! مجھے بخش دے، میری توبہ قبول کر، تو ہی توبہ قبول کرنے والا اور رحم فرمانے والا ہے کہنے کو شمار کرتے تھے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 1517,
			"arabicnumber": 1517,
			"text": "نبی اکرم صلی اللہ علیہ وسلم کے غلام زید رضی اللہ عنہ کہتے ہیں کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: جس نے«أستغفر الله الذي لا إله إلا هو الحي القيوم وأتوب إليه» کہا تو اس کے گناہ معاف کر دئیے جائیں گے اگرچہ وہ میدان جنگ سے بھاگ گیا ہو ۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 1518,
			"arabicnumber": 1518,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو کوئی استغفار کا التزام کر لے ۱؎ تو اللہ اس کے لیے ہر تنگی سے نکلنے اور ہر رنج سے نجات پانے کی راہ ہموار کر دے گا اور اسے ایسی جگہ سے رزق عطا فرمائے گا، جس کا وہ تصور بھی نہیں کر سکتا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 1519,
			"arabicnumber": 1519,
			"text": "عبدالعزیز بن صہیب کہتے ہیں کہ قتادہ نے انس رضی اللہ عنہ سے پوچھا: رسول اللہ صلی اللہ علیہ وسلم کون سی دعا زیادہ مانگا کرتے تھے؟ انہوں نے جواب دیا: آپ صلی اللہ علیہ وسلم سب سے زیادہ یہ دعا مانگا کرتے تھے: «اللهم ربنا آتنا في الدنيا حسنة وفي الآخرة حسنة وق قتادہ نے انس رضی اللہ عنہ سے پوچھا: رسول اللہ صلی اللہ علیہ وسلم کون سی دعا زیادہ مانگا کرتے تھے؟ انہوں نے جواب دیا: آپ صلی اللہ علیہ وسلم سب سے زیادہ یہ دعا مانگا کرتے تھے: «اللهم ربنا آتنا في الدنيا حسنة وفي الآخرة حسنة وقنا عذاب النار» اے ہمارے رب! ہمیں دنیا اور آخرت دونوں میں بھلائی عطا کر اور جہنم کے عذاب سے بچا لے ( البقرہ: ۲۰۱ ) ۔ زیاد کی روایت میں اتنا اضافہ ہے: انس جب دعا کا قصد کرتے تو یہی دعا مانگتے اور جب کوئی اور دعا مانگنا چاہتے تو اسے بھی اس میں شامل کر لیتے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 1520,
			"arabicnumber": 1520,
			"text": "سہل بن حنیف رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو اللہ سے سچے دل سے شہادت مانگے گا، اللہ اسے شہداء کے مرتبوں تک پہنچا دے گا، اگرچہ اسے اپنے بستر پر موت آئے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 1521,
			"arabicnumber": 1521,
			"text": "اسماء بن حکم فزاری کہتے ہیں کہ میں نے علی رضی اللہ عنہ کو کہتے ہوئے سنا: میں ایسا آدمی تھا کہ جب میں رسول اللہ صلی اللہ علیہ وسلم سے کوئی حدیث سنتا تو جس قدر اللہ کو منظور ہوتا اتنی وہ میرے لیے نفع بخش ہوتی اور جب میں کسی صحابی سے کوئی حدیث سنتا تو میں اسے قسم دلاتا، جب وہ قسم کھا لیتا تو میں اس کی بات مان لیتا، مجھ سے ابوبکر رضی اللہ عنہ نے حدیث بیان کی اور ابوبکر رضی اللہ عنہ نے سچ کہا، انہوں نے کہا: میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا ہے: کوئی بندہ ایسا نہیں ہے جو گناہ کرے پھر اچھی طرح وضو کر کے دو رکعتیں ادا کرے، پھر استغفار کرے تو اللہ اس کے گناہ معاف نہ کر دے، پھر انہوں نے یہ آیت تلاوت کی«والذين إذا فعلوا فاحشة أو ظلموا أنفسهم ذكروا الله *** إلى آخر الآية» ۱؎ جو لوگ برا کام کرتے ہیں یا اپنے اوپر ظلم کرتے ہیں پھر اللہ کو یاد کرتے ہیں۔ ۔ ۔ آیت کے اخیر تک ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 1522,
			"arabicnumber": 1522,
			"text": "معاذ بن جبل رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے میرا ہاتھ پکڑا اور فرمایا: اے معاذ! قسم اللہ کی، میں تم سے محبت کرتا ہوں، قسم اللہ کی میں تم سے محبت کرتا ہوں ، پھر فرمایا: اے معاذ! میں تمہیں نصیحت کرتا ہوں: ہر نماز کے بعد یہ دعا پڑھنا کبھی نہ چھوڑنا: «اللهم أعني على ذكرك وشكرك وحسن عبادتك» اے اللہ! اپنے ذکر، شکر اور اپنی بہترین عبادت کے سلسلہ میں میری مدد فرما ۔ معاذ رضی اللہ عنہ نے صنابحی کو اور صنابحی نے ابوعبدالرحمٰن کو اس کی وصیت کی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 1523,
			"arabicnumber": 1523,
			"text": "عقبہ بن عامر رضی اللہ عنہ کہتے ہیں کہ مجھے رسول اللہ صلی اللہ علیہ وسلم نے حکم دیا کہ میں ہر نماز کے بعد معوذات پڑھا کروں ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 1524,
			"arabicnumber": 1524,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم کو تین تین بار دعا مانگنا اور تین تین بار استغفار کرنا اچھا لگتا تھا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 1525,
			"arabicnumber": 1525,
			"text": "اسماء بنت عمیس رضی اللہ عنہا کہتی ہیں کہ مجھ سے رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: کیا میں تمہیں چند ایسے کلمات نہ سکھاؤں جنہیں تم مصیبت کے وقت یا مصیبت میں کہا کرو «الله الله ربي لا أشرك به شيئًا» یعنی اللہ ہی میرا رب ہے، میں اس کے ساتھ کسی کو شریک نہیں کرتی ۔ ابوداؤد کہتے ہیں: ہلال، عمر بن عبدالعزیز کے غلام ہیں، اور ابن جعفر سے مراد عبداللہ بن جعفر ہیں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 1526,
			"arabicnumber": 1526,
			"text": "ابوموسی اشعری رضی اللہ عنہ کہتے ہیں کہ میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ایک سفر میں تھا، جب لوگ مدینہ کے قریب پہنچے تو لوگوں نے تکبیر کہی اور اپنی آوازیں بلند کیں، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: لوگو! تم کسی بہرے یا غائب کو آواز نہیں دے رہے ہو، بلکہ جسے تم پکار رہے ہو وہ تمہارے اور تمہاری سواریوں کی گردنوں کے درمیان ہے ۱؎ ، پھر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اے ابوموسیٰ! کیا میں تمہیں جنت کے خزانوں میں سے ایک خزانہ نہ بتاؤں؟ ، میں نے عرض کیا: وہ کیا ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: وہ «لا حول ولا قوة إلا بالله» ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Munqar"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 1527,
			"arabicnumber": 1527,
			"text": "ابوموسیٰ اشعری رضی اللہ عنہ سے روایت ہے کہ وہ لوگ نبی اکرم صلی اللہ علیہ وسلم کے ساتھ تھے اور ایک پہاڑی پر چڑھ رہے تھے، ایک شخص تھا، وہ جب بھی پہاڑی پر چڑھتا تو «لا إله إلا الله والله أكبر» پکارتا، اس پر نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: تم لوگ کسی بہرے اور غائب کو نہیں پکار رہے ہو ۔ پھر فرمایا: اے عبداللہ بن قیس! پھر راوی نے اسی مفہوم کی حدیث بیان کی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 1528,
			"arabicnumber": 1528,
			"text": "اس سند سے بھی ابوموسیٰ رضی اللہ عنہ نے یہی حدیث روایت کی ہے البتہ اس میں یہ ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا: لوگو! اپنے اوپر آسانی کرو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 1529,
			"arabicnumber": 1529,
			"text": "ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو شخص کہے: «رضيت بالله ربا وبالإسلام دينا وبمحمد رسولا» میں اللہ کے رب ہونے، اسلام کے دین ہونے اور محمد صلی اللہ علیہ وسلم کے رسول ہونے پر راضی ہوا تو جنت اس کے لیے واجب گئی ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 1530,
			"arabicnumber": 1530,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو مجھ پر ایک بار درود ( صلاۃ ) بھیجے گا اللہ اس پر دس رحمت نازل کرے گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 1531,
			"arabicnumber": 1531,
			"text": "اوس بن اوس رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جمعہ کا دن تمہارے بہترین دنوں میں سے ہے، لہٰذا اس دن میرے اوپر کثرت سے درود ( صلاۃ ) بھیجا کرو، اس لیے کہ تمہارے درود مجھ پر پیش کئے جاتے ہیں ، لوگوں نے عرض کیا: اللہ کے رسول! آپ قبر میں بوسیدہ ہو چکے ہوں گے تو ہمارے درود ( صلاۃ ) آپ پر کیسے پیش کئے جائیں گے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: اللہ تعالیٰ نے زمین پر انبیاء کرام کے جسم حرام کر دئیے ہیں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 1532,
			"arabicnumber": 1532,
			"text": "جابر بن عبداللہ رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تم لوگ نہ اپنے لیے بد دعا کرو اور نہ اپنی اولاد کے لیے، نہ اپنے خادموں کے لیے اور نہ ہی اپنے اموال کے لیے، کہیں ایسا نہ ہو کہ وہ گھڑی ایسی ہو جس میں دعا قبول ہوتی ہو اور اللہ تمہاری بد دعا قبول کر لے ۔ ابوداؤد کہتے ہیں: یہ حدیث متصل ہے کیونکہ عبادہ بن ولید کی ملاقات جابر بن عبداللہ سے ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 1533,
			"arabicnumber": 1533,
			"text": "جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے ایک عورت نے نبی اکرم صلی اللہ علیہ وسلم سے کہا: میرے اور میرے شوہر کے لیے رحمت کی دعا فرما دیجئیے، آپ صلی اللہ علیہ وسلم نے فرمایا: «صلى الله عليك وعلى زوجك» اللہ تجھ پر اور تیرے شوہر پر رحمت نازل فرمائے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 1534,
			"arabicnumber": 1534,
			"text": "ام الدرادء رضی اللہ عنہا کہتی ہیں مجھ سے میرے شوہر ابوالدرداء رضی اللہ عنہ نے بیان کیا ہے کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: جب کوئی اپنے بھائی کے لیے غائبانے ( غائبانہ ) میں دعا کرتا ہے تو فرشتے آمین کہتے ہیں اور کہتے ہیں: تیرے لیے بھی اسی جیسا ہو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 1535,
			"arabicnumber": 1535,
			"text": "عبداللہ بن عمرو بن العاص رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: سب سے جلد قبول ہونے والی دعا وہ ہے جو غائب کسی غائب کے لیے کرے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 1536,
			"arabicnumber": 1536,
			"text": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: تین دعائیں ضرور قبول ہوتی ہیں، ان کی قبولیت میں کوئی شک نہیں: باپ کی دعا، مسافر کی دعا، مظلوم کی دعا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 1537,
			"arabicnumber": 1537,
			"text": "ابوموسیٰ عبداللہ بن قیس اشعری رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم کو جب کسی قوم سے خوف ہوتا تو فرماتے: «اللهم إنا نجعلك في نحورهم ونعوذ بك من شرورهم‏» اے اللہ! ہم تجھے ان کے بالمقابل کرتے ہیں اور ان کی برائیوں سے تیری پناہ طلب کرتے ہیں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 1538,
			"arabicnumber": 1538,
			"text": "جابر بن عبداللہ رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ہمیں استخارہ سکھاتے جیسے ہمیں قرآن کی سورۃ سکھاتے تھے، آپ صلی اللہ علیہ وسلم ہم سے فرماتے: جب تم میں سے کوئی کسی کام کا ارادہ کرے تو فرض کے علاوہ دو رکعت نفل پڑھے اور یہ دعا پڑھے:«اللهم إني أستخيرك بعلمك وأستقدرك بقدرتك وأسألك من فضلك العظيم فإنك تقدر ولاأقدر وتعلم ولا أعلم وأنت علام الغيوب اللهم إن كنت تعلم أن هذا الأمر ۱؎ خير لي في ديني ومعاشي ومعادي وعاقبة أمري فاقدره لي ويسره لي وبارك لي فيه اللهم وإن كنت تعلمه شرا لي فاصرفني عنه واصرفه عني واقدر لي الخير حيث كان ثم رضني به» اے اللہ! میں تجھ سے تیرے علم کے وسیلے سے خیر طلب کرتا ہوں، تجھ سے تیری قدرت کے وسیلے سے قوت طلب کرتا ہوں، تجھ سے تیرے بڑے فضل میں سے کچھ کا سوال کرتا ہوں، تو قدرت رکھتا ہے مجھ کو قدرت نہیں۔ تو جانتا ہے، میں نہیں جانتا، تو پوشیدہ چیزوں کا جاننے والا ہے، اے اللہ! اگر تو جانتا ہے کہ یہ معاملہ یا یہ کام ۱؎ میرے واسطے دین و دنیا، آخرت اور انجام کار کے لیے بہتر ہے تو اسے میرا مقدر بنا دے اور اسے میرے لیے آسان بنا دے اور میرے لیے اس میں برکت عطا کر، اے اللہ! اور اگر تو جانتا ہے کہ یہ کام میرے لیے دین، دنیا، آخرت اور انجام میں برا ہے تو مجھ کو اس سے پھیر دے اور اسے مجھ سے پھیر دے اور جہاں کہیں بھلائی ہو، اسے میرے لیے مقدر کر دے، پھر مجھے اس پر راضی فرما ۔ ابن مسلمہ اور ابن عیسیٰ کی روایت میں «عن محمد بن المنكدر عن جابر»ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 1539,
			"arabicnumber": 1539,
			"text": "عمر بن خطاب رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم پانچ چیزوں بزدلی، بخل، بری عمر ( پیرانہ سالی ) ، سینے کے فتنے اور قبر کے عذاب سے پناہ مانگا کرتے تھے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 1540,
			"arabicnumber": 1540,
			"text": "انس بن مالک رضی اللہ عنہ کہتے ہیں رسول اللہ صلی اللہ علیہ وسلم فرماتے تھے: «اللهم إني أعوذ بك من العجز، والكسل، والجبن، والبخل، والهرم، وأعوذ بك من عذاب القبر، وأعوذ بك من فتنة المحيا والممات» اے اللہ! میں تیری پناہ مانگتا ہوں عاجزی سے، سستی سے، بزدلی سے، بخل اور کنجوسی سے اور انتہائی بڑھاپے سے اور میں تیری پناہ مانگتا ہوں عذاب قبر سے اور میں تیری پناہ مانگتا ہوں زندگی اور موت کے فتنوں سے ۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 1541,
			"arabicnumber": 1541,
			"text": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ میں نبی اکرم صلی اللہ علیہ وسلم کی خدمت کرتا تھا تو میں اکثر آپ کو یہ دعا پڑھتے سنتا تھا:«اللهم إني أعوذ بك من الهم والحزن وضلع الدين وغلبة الرجال» اے اللہ! میں تیری پناہ مانگتا ہوں اندیشے اور غم سے، قرض کے بوجھ سے اور لوگوں کے تسلط سے اور انہوں نے بعض ان چیزوں کا ذکر کیا جنہیں تیمی ۱؎ نے ذکر کیا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 1542,
			"arabicnumber": 1542,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم انہیں یہ دعا اسی طرح سکھاتے جس طرح قرآن کی سورۃ سکھاتے تھے، فرماتے: «اللهم إني أعوذ بك من عذاب جهنم وأعوذ بك من عذاب القبر وأعوذ بك من فتنة المسيح الدجال وأعوذ بك من فتنة المحيا والممات» اے اللہ میں تیری پناہ مانگتا ہوں جہنم کے عذاب سے، تیری پناہ مانگتا ہوں قبر کے عذاب سے، تیری پناہ مانگتا ہوں مسیح دجال کے فتنے سے اور تیری پناہ مانگتا ہوں زندگی اور موت کی آزمایشوں سے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 1543,
			"arabicnumber": 1543,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم ان کلمات کے ساتھ دعا مانگتے: «اللهم إني أعوذ بك من فتنة النار، وعذاب النار، ومن شر الغنى، والفقر» اے اللہ! میں جہنم کے فتنے جہنم کے عذاب اور دولت مندی و فقر کے شر سے تیری پناہ مانگتا ہوں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 1544,
			"arabicnumber": 1544,
			"text": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم یہ دعا پڑھتے تھے: «اللهم إني أعوذ بك من الفقر، والقلة، والذلة، وأعوذ بك من أن أظلم أو أظلم» اے اللہ! میں فقر، قلت مال اور ذلت سے تیری پناہ مانگتا ہوں اور اس بات سے تیری پناہ مانگتا ہوں کہ میں کسی پر ظلم کروں یا کوئی مجھ پر ظلم کرے ۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 1545,
			"arabicnumber": 1545,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کی یہ دعا تھی: «اللهم إني أعوذ بك من زوال نعمتك، وتحويل عافيتك، وفجاءة نقمتك، وجميع سخطك» اے اللہ! میں تیری نعمت کے زوال سے، تیری دی ہوئی عافیت کے پلٹ جانے سے، تیرے ناگہانی عذاب سے اور تیرے ہر قسم کے غصے سے تیری پناہ مانگتا ہوں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 1546,
			"arabicnumber": 1546,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم دعا کرتے تو فرماتے: «اللهم إني أعوذ بك من الشقاق، والنفاق، وسوء الأخلاق» اے اللہ! میں پھوٹ، نفاق اور برے اخلاق سے تیری پناہ مانگتا ہوں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 1547,
			"arabicnumber": 1547,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم یہ دعا مانگتے تھے: «اللهم إني أعوذ بك من الجوع فإنه بئس الضجيع، وأعوذ بك من الخيانة فإنها بئست البطانة» اے اللہ! میں بھوک سے تیری پناہ مانگتا ہوں وہ بہت بری ساتھی ہے، میں خیانت سے تیری پناہ مانگتا ہوں وہ بہت بری خفیہ خصلت ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 1548,
			"arabicnumber": 1548,
			"text": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم کہتے تھے: «اللهم إني أعوذ بك من الأربع: من علم لا ينفع، ومن قلب لا يخشع، ومن نفس لا تشبع، ومن دعا لا يسمع» اے اللہ! میں چار چیزوں سے تیری پناہ مانگتا ہوں: ایسے علم سے جو نفع بخش نہ ہو، ایسے دل سے جو تجھ سے خوف زدہ نہ ہو، ایسے نفس سے جو سیر نہ ہو اور ایسی دعا سے جو سنی نہ جائے یعنی قبول نہ ہو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 1549,
			"arabicnumber": 1549,
			"text": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کہتے تھے: «اللهم إني أعوذ بك من صلاة لا تنفع» اے اللہ! میں ایسی نماز سے جو فائدہ نہ دے تیری پناہ چاہتا ہوں اور پھر راوی نے دوسری دعا کا ذکر کیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 1550,
			"arabicnumber": 1550,
			"text": "فروہ بن نوفل اشجعی کہتے ہیں کہ میں نے ام المؤمنین عائشہ رضی اللہ عنہا سے رسول اللہ صلی اللہ علیہ وسلم کی دعا کے بارے میں جو آپ مانگتے تھے پوچھا، انہوں نے کہا: آپ کہتے تھے: «اللهم إني أعوذ بك من شر ما عملت، ومن شر ما لم أعمل» اے اللہ! میں ہر اس کام کے شر سے تیری پناہ مانگتا ہوں جسے میں نے کیا ہے اور ہر اس کام کے شر سے بھی جسے میں نے نہیں کیا ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 1551,
			"arabicnumber": 1551,
			"text": "شکل بن حمید رضی اللہ عنہ کہتے ہیں کہ میں نے عرض کیا: اللہ کے رسول! مجھے کوئی دعا سکھا دیجئیے، آپ صلی اللہ علیہ وسلم نے فرمایا: کہو: «االلهم إني أعوذ بك من شر سمعي، ومن شر بصري، ومن شر لساني، ومن شر قلبي، ومن شر منيي» ۱؎ اے اللہ! میں تیری پناہ مانگتا ہوں اپنے کان کی برائی، نظر کی برائی، زبان کی برائی، دل کی برائی اور اپنی منی کی برائی سے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 1552,
			"arabicnumber": 1552,
			"text": "ابوالیسر رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم یہ دعا مانگتے تھے: «اللهم إني أعوذ بك من الهدم، وأعوذ بك من التردي، وأعوذ بك من الغرق، والحرق والهرم، وأعوذ بك أن يتخبطني الشيطان عند الموت، وأعوذ بك أن أموت في سبيلك مدبرا، وأعوذ بك أن أموت لديغا» اے اللہ! کسی مکان یا دیوار کے اپنے اوپر گرنے سے میں تیری پناہ مانگتا ہوں۔ میں اونچے مقام سے گر پڑنے سے تیری پناہ مانگتا ہوں۔ میں ڈوبنے، جل جانے اور بہت بوڑھا ہو جانے سے تیری پناہ مانگتا ہوں۔ میں تیری پناہ مانگتا ہوں اس بات سے کہ موت کے وقت مجھے شیطان اچک لے۔ اس بات سے تیری پناہ مانگتا ہوں کہ میں تیری راہ میں پیٹھ دکھا کر بھاگتے ہوئے مارا جاؤں اور اس بات سے تیری پناہ مانگتا ہوں کہ کسی زہریلے جانور کے کاٹنے سے میری موت آئے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 1553,
			"arabicnumber": 1553,
			"text": "اس سند سے بھی ابوالیسر رضی اللہ عنہ سے اسی طرح کی روایت ہے اس میں «والغم» کا اضافہ ہے یعنی تیری پناہ مانگتا ہوں غم سے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 1554,
			"arabicnumber": 1554,
			"text": "انس رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم کہتے تھے: «اللهم إني أعوذ بك من البرص، والجنون، والجذام، ومن سيئ الأسقام» اے اللہ! میں تیری پناہ مانگتا ہوں برص، دیوانگی، کوڑھ اور تمام بری بیماریوں سے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 1555,
			"arabicnumber": 1555,
			"text": "ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ایک دن مسجد میں داخل ہوئے تو اچانک آپ کی نظر ایک انصاری پر پڑی جنہیں ابوامامہ رضی اللہ عنہ کہا جاتا تھا، آپ صلی اللہ علیہ وسلم نے ان سے کہا: ابوامامہ! کیا وجہ ہے کہ میں تمہیں نماز کے وقت کے علاوہ بھی مسجد میں بیٹھا دیکھ رہا ہوں؟ انہوں نے عرض کیا: اللہ کے رسول! غموں اور قرضوں نے مجھے گھیر لیا ہے، آپ صلی اللہ علیہ وسلم نے فرمایا: کیا میں تمہیں ایسے کلمات نہ سکھاؤں کہ جب تم انہیں کہو تو اللہ تم سے تمہارے غم غلط اور قرض ادا کر دے ، میں نے کہا: ضرور، اللہ کے رسول! آپ صلی اللہ علیہ وسلم نے فرمایا: صبح و شام یہ کہا کرو: «اللهم إني أعوذ بك من الهم والحزن، وأعوذ بك من العجز والكسل، وأعوذ بك من الجبن والبخل، وأعوذ بك من غلبة الدين وقهر الرجال» اے اللہ! میں غم اور حزن سے تیری پناہ مانگتا ہوں، عاجزی و سستی سے تیری پناہ مانگتا ہوں، بزدلی اور کنجوسی سے تیری پناہ مانگتا ہوں اور قرض کے غلبہ اور لوگوں کے تسلط سے تیری پناہ مانگتا ہوں ۔ ابوامامہ رضی اللہ عنہ کہتے ہیں: میں نے یہ پڑھنا شروع کیا تو اللہ نے میرا غم دور کر دیا اور میرا قرض ادا کروا دیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 140
			}
		}
	]
}