{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"22": "Vows and Oaths"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1014,
			"arabicnumber": 1014,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ قَالَ كَانَ عَلَىَّ مَشْىٌ فَأَصَابَتْنِي خَاصِرَةٌ فَرَكِبْتُ حَتَّى أَتَيْتُ مَكَّةَ فَسَأَلْتُ عَطَاءَ بْنَ أَبِي رَبَاحٍ وَغَيْرَهُ فَقَالُوا عَلَيْكَ هَدْىٌ ‏.‏ فَلَمَّا قَدِمْتُ الْمَدِينَةَ سَأَلْتُ عُلَمَاءَهَا فَأَمَرُونِي أَنْ أَمْشِيَ مَرَّةً أُخْرَى مِنْ حَيْثُ عَجَزْتُ فَمَشَيْتُ ‏.‏ قَالَ يَحْيَى وَسَمِعْتُ مَالِكًا يَقُولُ فَالأَمْرُ عِنْدَنَا فِيمَنْ يَقُولُ عَلَىَّ مَشْىٌ إِلَى بَيْتِ اللَّهِ أَنَّهُ إِذَا عَجَزَ رَكِبَ ثُمَّ عَادَ فَمَشَى مِنْ حَيْثُ عَجَزَ فَإِنْ كَانَ لاَ يَسْتَطِيعُ الْمَشْىَ فَلْيَمْشِ مَا قَدَرَ عَلَيْهِ ثُمَّ لْيَرْكَبْ وَعَلَيْهِ هَدْىُ بَدَنَةٍ أَوْ بَقَرَةٍ أَوْ شَاةٍ إِنْ لَمْ يَجِدْ إِلاَّ هِيَ ‏.‏ وَسُئِلَ مَالِكٌ عَنِ الرَّجُلِ يَقُولُ لِلرَّجُلِ أَنَا أَحْمِلُكَ إِلَى بَيْتِ اللَّهِ فَقَالَ مَالِكٌ إِنْ نَوَى أَنْ يَحْمِلَهُ عَلَى رَقَبَتِهِ يُرِيدُ بِذَلِكَ الْمَشَقَّةَ وَتَعَبَ نَفْسِهِ فَلَيْسَ ذَلِكَ عَلَيْهِ وَلْيَمْشِ عَلَى رِجْلَيْهِ وَلْيُهْدِ وَإِنْ لَمْ يَكُنْ نَوَى شَيْئًا فَلْيَحْجُجْ وَلْيَرْكَبْ وَلْيَحْجُجْ بِذَلِكَ الرَّجُلِ مَعَهُ وَذَلِكَ أَنَّهُ قَالَ أَنَا أَحْمِلُكَ إِلَى بَيْتِ اللَّهِ فَإِنْ أَبَى أَنْ يَحُجَّ مَعَهُ فَلَيْسَ عَلَيْهِ شَىْءٌ وَقَدْ قَضَى مَا عَلَيْهِ ‏.‏ قَالَ يَحْيَى سُئِلَ مَالِكٌ عَنِ الرَّجُلِ يَحْلِفُ بِنُذُورٍ مُسَمَّاةٍ مَشْيًا إِلَى بَيْتِ اللَّهِ أَنْ لاَ يُكَلِّمَ أَخَاهُ أَوْ أَبَاهُ بِكَذَا وَكَذَا نَذْرًا لِشَىْءٍ لاَ يَقْوَى عَلَيْهِ وَلَوْ تَكَلَّفَ ذَلِكَ كُلَّ عَامٍ لَعُرِفَ أَنَّهُ لاَ يَبْلُغُ عُمْرُهُ مَا جَعَلَ عَلَى نَفْسِهِ مِنْ ذَلِكَ فَقِيلَ لَهُ هَلْ يُجْزِيهِ مِنْ ذَلِكَ نَذْرٌ وَاحِدٌ أَوْ نُذُورٌ مُسَمَّاةٌ فَقَالَ مَالِكٌ مَا أَعْلَمُهُ يُجْزِئُهُ مِنْ ذَلِكَ إِلاَّ الْوَفَاءُ بِمَا جَعَلَ عَلَى نَفْسِهِ فَلْيَمْشِ مَا قَدَرَ عَلَيْهِ مِنَ الزَّمَانِ وَلْيَتَقَرَّبْ إِلَى اللَّهِ تَعَالَى بِمَا اسْتَطَاعَ مِنَ الْخَيْرِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 1014
			}
		}
	]
}