{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"27": "Fara'id"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1076,
			"arabicnumber": 1076,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، أَنَّهُ قَالَ فَرَضَ عُمَرُ بْنُ الْخَطَّابِ وَعُثْمَانُ بْنُ عَفَّانَ وَزَيْدُ بْنُ ثَابِتٍ لِلْجَدِّ مَعَ الإِخْوَةِ الثُّلُثَ ‏.‏ قَالَ مَالِكٌ وَالأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا وَالَّذِي أَدْرَكْتُ عَلَيْهِ أَهْلَ الْعِلْمِ بِبَلَدِنَا أَنَّ الْجَدَّ أَبَا الأَبِ لاَ يَرِثُ مَعَ الأَبِ دِنْيَا شَيْئًا وَهُوَ يُفْرَضُ لَهُ مَعَ الْوَلَدِ الذَّكَرِ وَمَعَ ابْنِ الاِبْنِ الذَّكَرِ السُّدُسُ فَرِيضَةً وَهُوَ فِيمَا سِوَى ذَلِكَ مَا لَمْ يَتْرُكِ الْمُتَوَفَّى أَخًا أَوْ أُخْتًا لأَبِيهِ يُبَدَّأُ بِأَحَدٍ إِنْ شَرَّكَهُ بِفَرِيضَةٍ مُسَمَّاةٍ فَيُعْطَوْنَ فَرَائِضَهُمْ فَإِنْ فَضَلَ مِنَ الْمَالِ السُّدُسُ فَمَا فَوْقَهُ فُرِضَ لِلْجَدِّ السُّدُسُ فَرِيضَةً ‏.‏ قَالَ مَالِكٌ وَالْجَدُّ وَالإِخْوَةُ لِلأَبِ وَالأُمِّ إِذَا شَرَّكَهُمْ أَحَدٌ بِفَرِيضَةٍ مُسَمَّاةٍ يُبَدَّأُ بِمَنْ شَرَّكَهُمْ مِنْ أَهْلِ الْفَرَائِضِ فَيُعْطَوْنَ فَرَائِضَهُمْ فَمَا بَقِيَ بَعْدَ ذَلِكَ لِلْجَدِّ وَالإِخْوَةِ مِنْ شَىْءٍ فَإِنَّهُ يُنْظَرُ أَىُّ ذَلِكَ أَفْضَلُ لِحَظِّ الْجَدِّ أُعْطِيَهُ الثُّلُثُ مِمَّا بَقِيَ لَهُ وَلِلإِخْوَةِ أَوْ يَكُونُ بِمَنْزِلَةِ رَجُلٍ مِنَ الإِخْوَةِ فِيمَا يَحْصُلُ لَهُ وَلَهُمْ يُقَاسِمُهُمْ بِمِثْلِ حِصَّةِ أَحَدِهِمْ أَوِ السُّدُسُ مِنْ رَأْسِ الْمَالِ كُلِّهِ أَىُّ ذَلِكَ كَانَ أَفْضَلَ لِحَظِّ الْجَدِّ أُعْطِيَهُ الْجَدُّ وَكَانَ مَا بَقِيَ بَعْدَ ذَلِكَ لِلإِخْوَةِ لِلأَبِ وَالأُمِّ لِلذَّكَرِ مِثْلُ حَظِّ الأُنْثَيَيْنِ إِلاَّ فِي فَرِيضَةٍ وَاحِدَةٍ تَكُونُ قِسْمَتُهُمْ فِيهَا عَلَى غَيْرِ ذَلِكَ وَتِلْكَ الْفَرِيضَةُ امْرَأَةٌ تُوُفِّيَتْ وَتَرَكَتْ زَوْجَهَا وَأُمَّهَا وَأُخْتَهَا لأُمِّهَا وَأَبِيهَا وَجَدَّهَا فَلِلزَّوْجِ النِّصْفُ وَلِلأُمِّ الثُّلُثُ وَلِلْجَدِّ السُّدُسُ وَلِلأُخْتِ لِلأُمِّ وَالأَبِ النِّصْفُ ثُمَّ يُجْمَعُ سُدُسُ الْجَدِّ وَنِصْفُ الأُخْتِ فَيُقْسَمُ أَثْلاَثًا لِلذَّكَرِ مِثْلُ حَظِّ الأُنْثَيَيْنِ فَيَكُونُ لِلْجَدِّ ثُلُثَاهُ وَلِلأُخْتِ ثُلُثُهُ ‏.‏ قَالَ مَالِكٌ وَمِيرَاثُ الإِخْوَةِ لِلأَبِ مَعَ الْجَدِّ إِذَا لَمْ يَكُنْ مَعَهُمْ إِخْوَةٌ لأَبٍ وَأُمٍّ كَمِيرَاثِ الإِخْوَةِ لِلأَبِ وَالأُمِّ سَوَاءٌ ذَكَرُهُمْ كَذَكَرِهِمْ وَأُنْثَاهُمْ كَأُنْثَاهُمْ فَإِذَا اجْتَمَعَ الإِخْوَةُ لِلأَبِ وَالأُمِّ وَالإِخْوَةُ لِلأَبِ فَإِنَّ الإِخْوَةَ لِلأَبِ وَالأُمِّ يُعَادُّونَ الْجَدَّ بِإِخْوَتِهِمْ لأَبِيهِمْ فَيَمْنَعُونَهُ بِهِمْ كَثْرَةَ الْمِيرَاثِ بِعَدَدِهِمْ وَلاَ يُعَادُّونَهُ بِالإِخْوَةِ لِلأُمِّ لأَنَّهُ لَوْ لَمْ يَكُنْ مَعَ الْجَدِّ غَيْرُهُمْ لَمْ يَرِثُوا مَعَهُ شَيْئًا وَكَانَ الْمَالُ كُلُّهُ لِلْجَدِّ فَمَا حَصَلَ لِلإِخْوَةِ مِنْ بَعْدِ حَظِّ الْجَدِّ فَإِنَّهُ يَكُونُ لِلإِخْوَةِ مِنَ الأَبِ وَالأُمِّ دُونَ الإِخْوَةِ لِلأَبِ وَلاَ يَكُونُ لِلإِخْوَةِ لِلأَبِ مَعَهُمْ شَىْءٌ إِلاَّ أَنْ يَكُونَ الإِخْوَةُ لِلأَبِ وَالأُمِّ امْرَأَةً وَاحِدَةً فَإِنْ كَانَتِ امْرَأَةً وَاحِدَةً فَإِنَّهَا تُعَادُّ الْجَدَّ بِإِخْوَتِهَا لأَبِيهَا مَا كَانُوا فَمَا حَصَلَ لَهُمْ وَلَهَا مِنْ شَىْءٍ كَانَ لَهَا دُونَهُمْ مَا بَيْنَهَا وَبَيْنَ أَنْ تَسْتَكْمِلَ فَرِيضَتَهَا وَفَرِيضَتُهَا النِّصْفُ مِنْ رَأْسِ الْمَالِ كُلِّهِ فَإِنْ كَانَ فِيمَا يُحَازُ لَهَا وَلإِخْوَتِهَا لأَبِيهَا فَضْلٌ عَنْ نِصْفِ رَأْسِ الْمَالِ كُلِّهِ فَهُوَ لإِخْوَتِهَا لأَبِيهَا لِلذَّكَرِ مِثْلُ حَظِّ الأُنْثَيَيْنِ فَإِنْ لَمْ يَفْضُلْ شَىْءٌ فَلاَ شَىْءَ لَهُمْ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 1076
			}
		}
	]
}