{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"29": "Divorce"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1229,
			"arabicnumber": 1229,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ قَالَ عِدَّةُ الْمُسْتَحَاضَةِ سَنَةٌ ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا فِي الْمُطَلَّقَةِ الَّتِي تَرْفَعُهَا حَيْضَتُهَا حِينَ يُطَلِّقُهَا زَوْجُهَا أَنَّهَا تَنْتَظِرُ تِسْعَةَ أَشْهُرٍ فَإِنْ لَمْ تَحِضْ فِيهِنَّ اعْتَدَّتْ ثَلاَثَةَ أَشْهُرٍ فَإِنْ حَاضَتْ قَبْلَ أَنْ تَسْتَكْمِلَ الأَشْهُرَ الثَّلاَثَةَ اسْتَقْبَلَتِ الْحَيْضَ فَإِنْ مَرَّتْ بِهَا تِسْعَةُ أَشْهُرٍ قَبْلَ أَنْ تَحِيضَ اعْتَدَّتْ ثَلاَثَةَ أَشْهُرٍ فَإِنْ حَاضَتِ الثَّانِيَةَ قَبْلَ أَنْ تَسْتَكْمِلَ الأَشْهُرَ الثَّلاَثَةَ اسْتَقْبَلَتِ الْحَيْضَ فَإِنْ مَرَّتْ بِهَا تِسْعَةُ أَشْهُرٍ قَبْلَ أَنْ تَحِيضَ اعْتَدَّتْ ثَلاَثَةَ أَشْهُرٍ فَإِنْ حَاضَتِ الثَّالِثَةَ كَانَتْ قَدِ اسْتَكْمَلَتْ عِدَّةَ الْحَيْضِ فَإِنْ لَمْ تَحِضِ اسْتَقْبَلَتْ ثَلاَثَةَ أَشْهُرٍ ثُمَّ حَلَّتْ وَلِزَوْجِهَا عَلَيْهَا فِي ذَلِكَ الرَّجْعَةُ قَبْلَ أَنْ تَحِلَّ إِلاَّ أَنْ يَكُونَ قَدْ بَتَّ طَلاَقَهَا ‏.‏ قَالَ مَالِكٌ السُّنَّةُ عِنْدَنَا أَنَّ الرَّجُلَ إِذَا طَلَّقَ امْرَأَتَهُ وَلَهُ عَلَيْهَا رَجْعَةٌ فَاعْتَدَّتْ بَعْضَ عِدَّتِهَا ثُمَّ ارْتَجَعَهَا ثُمَّ فَارَقَهَا قَبْلَ أَنْ يَمَسَّهَا أَنَّهَا لاَ تَبْنِي عَلَى مَا مَضَى مِنْ عِدَّتِهَا وَأَنَّهَا تَسْتَأْنِفُ مِنْ يَوْمَ طَلَّقَهَا عِدَّةً مُسْتَقْبَلَةً وَقَدْ ظَلَمَ زَوْجُهَا نَفْسَهُ وَأَخْطَأَ إِنْ كَانَ ارْتَجَعَهَا وَلاَ حَاجَةَ لَهُ بِهَا ‏.‏ قَالَ مَالِكٌ وَالأَمْرُ عِنْدَنَا أَنَّ الْمَرْأَةَ إِذَا أَسْلَمَتْ وَزَوْجُهَا كَافِرٌ ثُمَّ أَسْلَمَ فَهُوَ أَحَقُّ بِهَا مَا دَامَتْ فِي عِدَّتِهَا فَإِنِ انْقَضَتْ عِدَّتُهَا فَلاَ سَبِيلَ لَهُ عَلَيْهَا وَإِنْ تَزَوَّجَهَا بَعْدَ انْقِضَاءِ عِدَّتِهَا لَمْ يُعَدَّ ذَلِكَ طَلاَقًا وَإِنَّمَا فَسَخَهَا مِنْهُ الإِسْلاَمُ بِغَيْرِ طَلاَقٍ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1229
			}
		}
	]
}