{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"31": "Business Transactions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1290,
			"arabicnumber": 1290,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ الثِّقَةِ، عِنْدَهُ عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ الْعُرْبَانِ ‏.‏ قَالَ مَالِكٌ: وَذلِكَ فِيمَا نُرَى - وَاللهُ أَعْلَمُ - أَنْ يَشْتَرِيَ الرَّجُلُ الْعَبْدَ، أَوِ الْوَلِيدَةَ. أَوْ يَتَكَارَى الدَّابَّةَ. ثُمَّ يَقُولُ لِلَّذِي اشْتَرَى مِنْهُ، أَوْ تَكَارَى مِنْهُ: أُعْطِيكَ دِينَاراً، أَوْ دِرْهَماً، أَوْ أَكْثَرَ مِنْ ذلِكَ، أَوْ أَقَلَّ. عَلَى أَنِّي إِنْ أَخَذْتُ السِّلْعَةَ، أَوْ رَكِبْتُ مَا تَكَارَيْتُ مِنْكَ، فَالَّذِي أَعْطَيْتُكَ هُوَ مِنْ ثَمَنِ السِّلْعَةِ. أَوْ مِنْ كِرَاءِ الدَّابَّةِ، وَإِنْ تَرَكْتُ ابْتِيَاعَ السِّلْعَةِ، أَوْ كِرَاءَ الدَّابَّةِ، فَمَا أَعْطَيْتُكَ لَكَ بَاطِلٌ بِغَيْرِ شَيْءٍ. قَالَ مَالِكٌ: وَالْأَمْرُ عِنْدَنَا، أَنَّهُ لاَ بَأْسَ بِأَنْ يَبْتَاعَ الْعَبْدَ التَّاجِرَ الْفَصِيحَ، بِالْأَعْبُدِ مِنَ الْحَبَشَةِ، أَوْ مِنْ جِنْسٍ مِنَ الْأَجْنَاسِ، لَيْسُوا مِثْلَهُ فِي الْفَصَاحَةِ، وَلاَ فِي التِّجَارَةِ، وَالنَّفَاذِ، وَالْمَعْرِفَةِ. لاَ بَأْسَ بِهذَا، أَنْ يَشْتَرِيَ مِنْهُ الْعَبْدَ بِالْعَبْدَيْنِ، أَوْ بِالْأَعْبُدِ إِلَى أَجَلٍ مَعْلُومٍ. إِذَا اخْتَلَفَ، فَبَانَ اخْتِلاَفُهُ .فَإِنْ أَشْبَهَ بَعْضُ ذلِكَ بَعْضاً، حَتَّى يَتَقَارَبَ، فَلاَ تَأْخُذَنْ مِنْهُ اثْنَيْنِ بِوَاحِدٍ، إِلَى أَجَلٍ. وَإِنِ اخْتَلَفَتْ أَجْنَاسُهُمْ. قَالَ مَالِكٌ: وَلاَ بَأْسَ بِأَنْ تَبِيعَ مَا اشْتَرَيْتَ مِنْ ذلِكَ، قَبْلَ أَنْ تَسْتَوْفِيَهُ. إِذَا انْتَقَدْتَ ثَمَنَهُ مِنْ غَيْرِ صَاحِبِهِ الَّذِي اشْتَرَيْتَهُ مِنْهُ. قَالَ مَالِكٌ: لاَ يَنْبَغِي أَنْ يُسْتَثْنَى جَنِينٌ فِي بَطْنِ أُمِّهِ، إِذَا بِيعَتْ. لِأَنَّ ذلِكَ غَرَرٌ. لاَ يُدْرَى أَذَكَرٌ هُوَ أَمْ (1) أُنْثَى أو حَسَنٌ (2) أَوْ قَبِيحٌ، أَوْ نَاقِصٌ، أَوْ تَامٌّ، أَوْ حَيٌّ أَوْ مَيِّتٌ؟. وَذلِكَ يَضَعُ مِنْ ثَمَنِهَا. قَالَ مَالِكٌ، فِي الرَّجُلِ يَبْتَاعُ الْعَبْدَ، أَوِ الْوَلِيدَةَ، بِمِائَةِ دِينَارٍ إِلَى أَجَلٍ. ثُمَّ يَنْدَمُ الْبَائِعُ. فَيَسْأَلُ الْمُبْتَاعَ أَنْ يُقِيلَهُ بِعَشَرَةِ دَنَانِيرَ، يَدْفَعُهَا إِلَيْهِ نَقْداً. أَوْ إِلَى أَجَلٍ. وَيَمْحُو عَنْهُ الْمِائَةَ دِينَارٍ الَّتِي لَهُ. قَالَ مَالِكٌ: لاَ بَأْسَ بِذلِكَ. وَإِنْ نَدِمَ الْمُبْتَاعُ، فَسَأَلَ الْبَائِعَ أَنْ يُقِيلَهُ فِي الْجَارِيَةِ، أَوِ الْعَبْدِ، وَيَزِيدَهُ عَشَرَةَ دَنَانِيرَ نَقْداً، أَوْ إِلَى أَجَلٍ أَبْعَدَ مِنَ الْأَجَلِ الَّذِي اشْتَرَى إِلَيْهِ الْعَبْدَ، أَوِ الْوَلِيدَةَ. فَإِنَّ ذلِكَ لاَ يَنْبَغِي. وَإِنَّمَا كَرِهَ ذلِكَ؛ لِأَنَّ الْبَائِعَ كَأَنَّهُ بَاعَ مِنْهُ مِائَةَ دِينَارٍ لَهُ، إِلَى سَنَةٍ قَبْلَ أَنْ تَحِلَّ، بِجَارِيَةٍ، وَبِعَشَرَةِ دَنَانِيرَ نَقْداً. أَوْ إِلَى أَجَلٍ أَبْعَدَ مِنَ السَّنَةِ. فَدَخَلَ فِي ذلِكَ بَيْعُ الذَّهَبِ بِالذَّهَبِ إِلَى أَجَلٍ. قَالَ مَالِكٌ، فِي الرَّجُلِ يَبِيعُ مِنَ الرَّجُلِ الْجَارِيَةَ بِمِائَةِ دِينَارٍ إِلَى أَجَلٍ، ثُمَّ يَشْتَرِيهَا بِأَكْثَرَ مِنْ ذلِكَ الثَّمَنِ الَّذِي بَاعَهَا بِهِ إِلَى أَبْعَدَ مِنْ ذلِكَ الْأَجَلِ، الَّذِي بَاعَهَا إِلَيْهِ: إِنَّ ذلِكَ لاَ يَصْلُحُ. وَتَفْسِيرُ مَا كَرِهَ مِنْ ذلِكَ، أَنْ يَبِيعَ الرَّجُلُ الْجَارِيَةَ إِلَى أَجَلٍ. ثُمَّ يَبْتَاعُهَا إِلَى أَجَلٍ أَبْعَدَ مِنْهُ. يَبِيعُهَا بِثَلاَثِينَ دِينَاراً إِلَى شَهْرٍ، ثُمَّ يَبْتَاعُهَا بِسِتِّينَ دِينَاراً، إِلَى سَنَةٍ، أَوْ إِلَى نِصْفِ سَنَةٍ. فَصَارَ، إِنْ رَجَعَتْ إِلَيْهِ سِلْعَتُهُ بِعَيْنِهَا، وَأَعْطَاهُ صَاحِبُهُ ثَلاَثِينَ دِينَاراً، إِلَى شَهْرٍ؛ بِسِتِّينَ دِينَاراً، إِلَى سَنَةٍ، أَوْ إِلَى نِصْفِ سَنَةٍ. فَهذَا لاَ يَنْبَغِي",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1290
			}
		}
	]
}