{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"31": "Business Transactions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1315,
			"arabicnumber": 1315,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْمُزَابَنَةِ وَالْمُحَاقَلَةِ وَالْمُزَابَنَةُ اشْتِرَاءُ الثَّمَرِ بِالتَّمْرِ وَالْمُحَاقَلَةُ اشْتِرَاءُ الزَّرْعِ بِالْحِنْطَةِ وَاسْتِكْرَاءُ الأَرْضِ بِالْحِنْطَةِ ‏.‏ قَالَ ابْنُ شِهَابٍ فَسَأَلْتُ سَعِيدَ بْنَ الْمُسَيَّبِ عَنِ اسْتِكْرَاءِ الأَرْضِ بِالذَّهَبِ وَالْوَرِقِ فَقَالَ لاَ بَأْسَ بِذَلِكَ ‏.‏ قَالَ مَالِكٌ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْمُزَابَنَةِ وَتَفْسِيرُ الْمُزَابَنَةِ أَنَّ كُلَّ شَىْءٍ مِنَ الْجِزَافِ الَّذِي لاَ يُعْلَمُ كَيْلُهُ وَلاَ وَزْنُهُ وَلاَ عَدَدُهُ ابْتِيعَ بِشَىْءٍ مُسَمًّى مِنَ الْكَيْلِ أَوِ الْوَزْنِ أَوِ الْعَدَدِ وَذَلِكَ أَنْ يَقُولَ الرَّجُلُ لِلرَّجُلِ يَكُونُ لَهُ الطَّعَامُ الْمُصَبَّرُ الَّذِي لاَ يُعْلَمُ كَيْلُهُ مِنَ الْحِنْطَةِ أَوِ التَّمْرِ أَوْ مَا أَشْبَهَ ذَلِكَ مِنَ الأَطْعِمَةِ أَوْ يَكُونُ لِلرَّجُلِ السِّلْعَةُ مِنَ الْحِنْطَةِ أَوِ النَّوَى أَوِ الْقَضْبِ أَوِ الْعُصْفُرِ أَوِ الْكُرْسُفِ أَوِ الْكَتَّانِ أَوِ الْقَزِّ أَوْ مَا أَشْبَهَ ذَلِكَ مِنَ السِّلَعِ لاَ يُعْلَمُ كَيْلُ شَىْءٍ مِنْ ذَلِكَ وَلاَ وَزْنُهُ وَلاَ عَدَدُهُ فَيَقُولُ الرَّجُلُ لِرَبِّ تِلْكَ السِّلْعَةِ كِلْ سِلْعَتَكَ هَذِهِ أَوْ مُرْ مَنْ يَكِيلُهَا أَوْ زِنْ مِنْ ذَلِكَ مَا يُوزَنُ أَوْ عُدَّ مِنْ ذَلِكَ مَا كَانَ يُعَدُّ فَمَا نَقَصَ عَنْ كَيْلِ كَذَا وَكَذَا صَاعًا - لِتَسْمِيَةٍ يُسَمِّيهَا - أَوْ وَزْنِ كَذَا وَكَذَا رِطْلاً أَوْ عَدَدِ كَذَا وَكَذَا فَمَا نَقَصَ مِنْ ذَلِكَ فَعَلَىَّ غُرْمُهُ لَكَ حَتَّى أُوفِيَكَ تِلْكَ التَّسْمِيَةَ فَمَا زَادَ عَلَى تِلْكَ التَّسْمِيَةِ فَهُوَ لِي أَضْمَنُ مَا نَقَصَ مِنْ ذَلِكَ عَلَى أَنْ يَكُونَ لِي مَا زَادَ ‏.‏ فَلَيْسَ ذَلِكَ بَيْعًا وَلَكِنَّهُ الْمُخَاطَرَةُ وَالْغَرَرُ وَالْقِمَارُ يَدْخُلُ هَذَا لأَنَّهُ لَمْ يَشْتَرِ مِنْهُ شَيْئًا بِشَىْءٍ أَخْرَجَهُ وَلَكِنَّهُ ضَمِنَ لَهُ مَا سُمِّيَ مِنْ ذَلِكَ الْكَيْلِ أَوِ الْوَزْنِ أَوِ الْعَدَدِ عَلَى أَنْ يَكُونَ لَهُ مَا زَادَ عَلَى ذَلِكَ فَإِنْ نَقَصَتْ تِلْكَ السِّلْعَةُ عَنْ تِلْكَ التَّسْمِيَةِ أَخَذَ مِنْ مَالِ صَاحِبِهِ مَا نَقَصَ بِغَيْرِ ثَمَنٍ وَلاَ هِبَةٍ طَيِّبَةٍ بِهَا نَفْسُهُ فَهَذَا يُشْبِهُ الْقِمَارَ وَمَا كَانَ مِثْلَ هَذَا مِنَ الأَشْيَاءِ فَذَلِكَ يَدْخُلُهُ ‏.‏ قَالَ مَالِكٌ وَمِنْ ذَلِكَ أَيْضًا أَنْ يَقُولَ الرَّجُلُ لِلرَّجُلِ لَهُ الثَّوْبُ أَضْمَنُ لَكَ مِنْ ثَوْبِكَ هَذَا كَذَا وَكَذَا ظِهَارَةَ قَلَنْسُوَةٍ قَدْرُ كُلِّ ظِهَارَةٍ كَذَا وَكَذَا - لِشَىْءٍ يُسَمِّيهِ - فَمَا نَقَصَ مِنْ ذَلِكَ فَعَلَىَّ غُرْمُهُ حَتَّى أُوفِيَكَ وَمَا زَادَ فَلِي ‏.‏ أَوْ أَنْ يَقُولَ الرَّجُلُ لِلرَّجُلِ أَضْمَنُ لَكَ مِنْ ثِيَابِكَ هَذِي كَذَا وَكَذَا قَمِيصًا ذَرْعُ كُلِّ قَمِيصٍ كَذَا وَكَذَا فَمَا نَقَصَ مِنْ ذَلِكَ فَعَلَىَّ غُرْمُهُ وَمَا زَادَ عَلَى ذَلِكَ فَلِي ‏.‏ أَوْ أَنْ يَقُولُ الرَّجُلُ لِلرَّجُلِ لَهُ الْجُلُودُ مِنْ جُلُودِ الْبَقَرِ أَوِ الإِبِلِ أُقَطِّعُ جُلُودَكَ هَذِهِ نِعَالاً عَلَى إِمَامٍ يُرِيهِ إِيَّاهُ ‏.‏ فَمَا نَقَصَ مِنْ مِائَةِ زَوْجٍ فَعَلَىَّ غُرْمُهُ وَمَا زَادَ فَهُوَ لِي بِمَا ضَمِنْتُ لَكَ ‏.‏ وَمِمَّا يُشْبِهُ ذَلِكَ أَنْ يَقُولَ الرَّجُلُ لِلرَّجُلِ عِنْدَهُ حَبُّ الْبَانِ اعْصُرْ حَبَّكَ هَذَا فَمَا نَقَصَ مِنْ كَذَا وَكَذَا رِطْلاً فَعَلَىَّ أَنْ أُعْطِيَكَهُ وَمَا زَادَ فَهُوَ لِي ‏.‏ فَهَذَا كُلُّهُ وَمَا أَشْبَهَهُ مِنَ الأَشْيَاءِ أَوْ ضَارَعَهُ مِنَ الْمُزَابَنَةِ الَّتِي لاَ تَصْلُحُ وَلاَ تَجُوزُ ‏.‏ وَكَذَلِكَ - أَيْضًا - إِذَا قَالَ الرَّجُلُ لِلرَّجُلِ لَهُ الْخَبَطُ أَوِ النَّوَى أَوِ الْكُرْسُفُ أَوِ الْكَتَّانُ أَوِ الْقَضْبُ أَوِ الْعُصْفُرُ أَبْتَاعُ مِنْكَ هَذَا الْخَبَطَ بِكَذَا وَكَذَا صَاعًا مِنْ خَبَطٍ يُخْبَطُ مِثْلَ خَبَطِهِ أَوْ هَذَا النَّوَى بِكَذَا وَكَذَا صَاعًا مِنْ نَوًى مِثْلِهِ وَفِي الْعُصْفُرِ وَالْكُرْسُفِ وَالْكَتَّانِ وَالْقَضْبِ مِثْلَ ذَلِكَ ‏.‏ فَهَذَا كُلُّهُ يَرْجِعُ إِلَى مَا وَصَفْنَا مِنَ الْمُزَابَنَةِ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1315
			}
		}
	]
}