{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"31": "Business Transactions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1342,
			"arabicnumber": 1342,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنِ ابْنِ مُعَيْقِيبٍ الدَّوْسِيِّ، مِثْلُ ذَلِكَ ‏.‏ قَالَ مَالِكٌ وَهُوَ الأَمْرُ عِنْدَنَا ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا أَنْ لاَ تُبَاعَ الْحِنْطَةُ بِالْحِنْطَةِ وَلاَ التَّمْرُ بِالتَّمْرِ وَلاَ الْحِنْطَةُ بِالتَّمْرِ وَلاَ التَّمْرُ بِالزَّبِيبِ وَلاَ الْحِنْطَةُ بِالزَّبِيبِ وَلاَ شَىْءٌ مِنَ الطَّعَامِ كُلِّهِ إِلاَّ يَدًا بِيَدٍ فَإِنْ دَخَلَ شَيْئًا مِنْ ذَلِكَ الأَجَلُ لَمْ يَصْلُحْ وَكَانَ حَرَامًا وَلاَ شَىْءَ مِنَ الأُدْمِ كُلِّهَا إِلاَّ يَدًا بِيَدٍ ‏.‏ قَالَ مَالِكٌ وَلاَ يُبَاعُ شَىْءٌ مِنَ الطَّعَامِ وَالأُدْمِ إِذَا كَانَ مِنْ صِنْفٍ وَاحِدٍ اثْنَانِ بِوَاحِدٍ فَلاَ يُبَاعُ مُدُّ حِنْطَةٍ بِمُدَّىْ حِنْطَةٍ وَلاَ مُدُّ تَمْرٍ بِمُدَّىْ تَمْرٍ وَلاَ مُدُّ زَبِيبٍ بِمُدَّىْ زَبِيبٍ وَلاَ مَا أَشْبَهَ ذَلِكَ مِنَ الْحُبُوبِ وَالأُدْمِ كُلِّهَا إِذَا كَانَ مِنْ صِنْفٍ وَاحِدٍ وَإِنْ كَانَ يَدًا بِيَدٍ إِنَّمَا ذَلِكَ بِمَنْزِلَةِ الْوَرِقِ بِالْوَرِقِ وَالذَّهَبِ بِالذَّهَبِ لاَ يَحِلُّ فِي شَىْءٍ مِنْ ذَلِكَ الْفَضْلُ وَلاَ يَحِلُّ إِلاَّ مِثْلاً بِمِثْلٍ يَدًا بِيَدٍ ‏.‏ قَالَ مَالِكٌ وَإِذَا اخْتَلَفَ مَا يُكَالُ أَوْ يُوزَنُ مِمَّا يُؤْكَلُ أَوْ يُشْرَبُ فَبَانَ اخْتِلاَفُهُ فَلاَ بَأْسَ أَنْ يُؤْخَذَ مِنْهُ اثْنَانِ بِوَاحِدٍ يَدًا بِيَدٍ وَلاَ بَأْسَ أَنْ يُؤْخَذَ صَاعٌ مِنْ تَمْرٍ بِصَاعَيْنِ مِنْ حِنْطَةٍ وَصَاعٌ مِنْ تَمْرٍ بِصَاعَيْنِ مِنْ زَبِيبٍ وَصَاعٌ مِنْ حِنْطَةٍ بِصَاعَيْنِ مِنْ سَمْنٍ فَإِذَا كَانَ الصِّنْفَانِ مِنْ هَذَا مُخْتَلِفَيْنِ فَلاَ بَأْسَ بِاثْنَيْنِ مِنْهُ بِوَاحِدٍ أَوْ أَكْثَرَ مِنْ ذَلِكَ يَدًا بِيَدٍ فَإِنْ دَخَلَ ذَلِكَ الأَجَلُ فَلاَ يَحِلُّ ‏.‏ قَالَ مَالِكٌ وَلاَ تَحِلُّ صُبْرَةُ الْحِنْطَةِ بِصُبْرَةِ الْحِنْطَةِ وَلاَ بَأْسَ بِصُبْرَةِ الْحِنْطَةِ بِصُبْرَةِ التَّمْرِ يَدًا بِيَدٍ وَذَلِكَ أَنَّهُ لاَ بَأْسَ أَنْ يُشْتَرَى الْحِنْطَةُ بِالتَّمْرِ جِزَافًا ‏.‏ قَالَ مَالِكٌ وَكُلُّ مَا اخْتَلَفَ مِنَ الطَّعَامِ وَالأُدْمِ فَبَانَ اخْتِلاَفُهُ فَلاَ بَأْسَ أَنْ يُشْتَرَى بَعْضُهُ بِبَعْضٍ جِزَافًا يَدًا بِيَدٍ فَإِنْ دَخَلَهُ الأَجَلُ فَلاَ خَيْرَ فِيهِ وَإِنَّمَا اشْتِرَاءُ ذَلِكَ جِزَافًا كَاشْتِرَاءِ بَعْضِ ذَلِكَ بِالذَّهَبِ وَالْوَرِقِ جِزَافًا ‏.‏ قَالَ مَالِكٌ وَذَلِكَ أَنَّكَ تَشْتَرِي الْحِنْطَةَ بِالْوَرِقِ جِزَافًا وَالتَّمْرَ بِالذَّهَبِ جِزَافًا فَهَذَا حَلاَلٌ لاَ بَأْسَ بِهِ ‏.‏ قَالَ مَالِكٌ وَمَنْ صَبَّرَ صُبْرَةَ طَعَامٍ وَقَدْ عَلِمَ كَيْلَهَا ثُمَّ بَاعَهَا جِزَافًا وَكَتَمَ الْمُشْتَرِي كَيْلَهَا فَإِنَّ ذَلِكَ لاَ يَصْلُحُ فَإِنْ أَحَبَّ الْمُشْتَرِي أَنْ يَرُدَّ ذَلِكَ الطَّعَامَ عَلَى الْبَائِعِ رَدَّهُ بِمَا كَتَمَهُ كَيْلَهُ وَغَرَّهُ وَكَذَلِكَ كُلُّ مَا عَلِمَ الْبَائِعُ كَيْلَهُ وَعَدَدَهُ مِنَ الطَّعَامِ وَغَيْرِهِ ثُمَّ بَاعَهُ جِزَافًا وَلَمْ يَعْلَمِ الْمُشْتَرِي ذَلِكَ فَإِنَّ الْمُشْتَرِيَ إِنْ أَحَبَّ أَنْ يَرُدَّ ذَلِكَ عَلَى الْبَائِعِ رَدَّهُ وَلَمْ يَزَلْ أَهْلُ الْعِلْمِ يَنْهَوْنَ عَنْ ذَلِكَ ‏.‏ قَالَ مَالِكٌ وَلاَ خَيْرَ فِي الْخُبْزِ قُرْصٍ بِقُرْصَيْنِ وَلاَ عَظِيمٍ بِصَغِيرٍ إِذَا كَانَ بَعْضُ ذَلِكَ أَكْبَرَ مِنْ بَعْضٍ فَأَمَّا إِذَا كَانَ يَتَحَرَّى أَنْ يَكُونَ مِثْلاً بِمِثْلٍ فَلاَ بَأْسَ بِهِ وَإِنْ لَمْ يُوزَنْ ‏.‏ قَالَ مَالِكٌ لاَ يَصْلُحُ مُدُّ زُبْدٍ وَمُدُّ لَبَنٍ بِمُدَّىْ زُبْدٍ وَهُوَ مِثْلُ الَّذِي وَصَفْنَا مِنَ التَّمْرِ الَّذِي يُبَاعُ صَاعَيْنِ مِنْ كَبِيسٍ وَصَاعًا مِنْ حَشَفٍ بِثَلاَثَةِ أَصْوُعٍ مِنْ عَجْوَةٍ حِينَ قَالَ لِصَاحِبِهِ إِنَّ صَاعَيْنِ مِنْ كَبِيسٍ بِثَلاَثَةِ أَصْوُعٍ مِنَ الْعَجْوَةِ لاَ يَصْلُحُ ‏.‏ فَفَعَلَ ذَلِكَ لِيُجِيزَ بَيْعَهُ وَإِنَّمَا جَعَلَ صَاحِبُ اللَّبَنِ اللَّبَنَ مَعَ زُبْدِهِ لِيَأْخُذَ فَضْلَ زُبْدِهِ عَلَى زُبْدِ صَاحِبِهِ حِينَ أَدْخَلَ مَعَهُ اللَّبَنَ ‏.‏ قَالَ مَالِكٌ وَالدَّقِيقُ بِالْحِنْطَةِ مِثْلاً بِمِثْلٍ لاَ بَأْسَ بِهِ وَذَلِكَ لأَنَّهُ أَخْلَصَ الدَّقِيقَ فَبَاعَهُ بِالْحِنْطَةِ مِثْلاً بِمِثْلٍ وَلَوْ جَعَلَ نِصْفَ الْمُدِّ مِنْ دَقِيقٍ وَنِصْفَهُ مِنْ حِنْطَةٍ فَبَاعَ ذَلِكَ بِمُدٍّ مِنْ حِنْطَةٍ كَانَ ذَلِكَ مِثْلَ الَّذِي وَصَفْنَا لاَ يَصْلُحُ لأَنَّهُ إِنَّمَا أَرَادَ أَنْ يَأْخُذَ فَضْلَ حِنْطَتِهِ الْجَيِّدَةِ حَتَّى جَعَلَ مَعَهَا الدَّقِيقَ فَهَذَا لاَ يَصْلُحُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1342
			}
		}
	]
}