{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"31": "Business Transactions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1344,
			"arabicnumber": 1344,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ مُحَمَّدَ بْنَ سِيرِينَ، كَانَ يَقُولُ لاَ تَبِيعُوا الْحَبَّ فِي سُنْبُلِهِ حَتَّى يَبْيَضَّ ‏.‏ قَالَ مَالِكٌ مَنِ اشْتَرَى طَعَامًا بِسِعْرٍ مَعْلُومٍ إِلَى أَجَلٍ مُسَمًّى فَلَمَّا حَلَّ الأَجَلُ قَالَ الَّذِي عَلَيْهِ الطَّعَامُ لِصَاحِبِهِ لَيْسَ عِنْدِي طَعَامٌ فَبِعْنِي الطَّعَامَ الَّذِي لَكَ عَلَىَّ إِلَى أَجَلٍ ‏.‏ فَيَقُولُ صَاحِبُ الطَّعَامِ هَذَا لاَ يَصْلُحُ لأَنَّهُ قَدْ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ بَيْعِ الطَّعَامِ حَتَّى يُسْتَوْفَى ‏.‏ فَيَقُولُ الَّذِي عَلَيْهِ الطَّعَامُ لِغَرِيمِهِ فَبِعْنِي طَعَامًا إِلَى أَجَلٍ حَتَّى أَقْضِيَكَهُ ‏.‏ فَهَذَا لاَ يَصْلُحُ لأَنَّهُ إِنَّمَا يُعْطِيهِ طَعَامًا ثُمَّ يَرُدُّهُ إِلَيْهِ ‏.‏ فَيَصِيرُ الذَّهَبُ الَّذِي أَعْطَاهُ ثَمَنَ الَّذِي كَانَ لَهُ عَلَيْهِ وَيَصِيرُ الطَّعَامُ الَّذِي أَعْطَاهُ مُحَلَّلاً فِيمَا بَيْنَهُمَا وَيَكُونُ ذَلِكَ إِذَا فَعَلاَهُ بَيْعَ الطَّعَامِ قَبْلَ أَنْ يُسْتَوْفَى ‏.‏ قَالَ مَالِكٌ فِي رَجُلٍ لَهُ عَلَى رَجُلٍ طَعَامٌ ابْتَاعَهُ مِنْهُ وَلِغَرِيمِهِ عَلَى رَجُلٍ طَعَامٌ مِثْلُ ذَلِكَ الطَّعَامِ فَقَالَ الَّذِي عَلَيْهِ الطَّعَامُ لِغَرِيمِهِ أُحِيلُكَ عَلَى غَرِيمٍ لِي عَلَيْهِ مِثْلُ الطَّعَامِ الَّذِي لَكَ عَلَىَّ بِطَعَامِكَ الَّذِي لَكَ عَلَىَّ ‏.‏ قَالَ مَالِكٌ إِنْ كَانَ الَّذِي عَلَيْهِ الطَّعَامُ إِنَّمَا هُوَ طَعَامٌ ابْتَاعَهُ فَأَرَادَ أَنْ يُحِيلَ غَرِيمَهُ بِطَعَامٍ ابْتَاعَهُ فَإِنَّ ذَلِكَ لاَ يَصْلُحُ وَذَلِكَ بَيْعُ الطَّعَامِ قَبْلَ أَنْ يُسْتَوْفَى فَإِنْ كَانَ الطَّعَامُ سَلَفًا حَالاًّ فَلاَ بَأْسَ أَنْ يُحِيلَ بِهِ غَرِيمَهُ لأَنَّ ذَلِكَ لَيْسَ بِبَيْعٍ وَلاَ يَحِلُّ بَيْعُ الطَّعَامِ قَبْلَ أَنْ يُسْتَوْفَى لِنَهْىِ رَسُولِ اللَّهِ صلى الله عليه وسلم عَنْ ذَلِكَ غَيْرَ أَنَّ أَهْلَ الْعِلْمِ قَدِ اجْتَمَعُوا عَلَى أَنَّهُ لاَ بَأْسَ بِالشِّرْكِ وَالتَّوْلِيَةِ وَالإِقَالَةِ فِي الطَّعَامِ وَغَيْرِهِ ‏.‏ قَالَ مَالِكٌ وَذَلِكَ أَنَّ أَهْلَ الْعِلْمِ أَنْزَلُوهُ عَلَى وَجْهِ الْمَعْرُوفِ وَلَمْ يُنْزِلُوهُ عَلَى وَجْهِ الْبَيْعِ وَذَلِكَ مِثْلُ الرَّجُلِ يُسَلِّفُ الدَّرَاهِمَ النُّقَّصَ فَيُقْضَى دَرَاهِمَ وَازِنَةً فِيهَا فَضْلٌ فَيَحِلُّ لَهُ ذَلِكَ وَيَجُوزُ وَلَوِ اشْتَرَى مِنْهُ دَرَاهِمَ نُقَّصًا بِوَازِنَةٍ لَمْ يَحِلَّ ذَلِكَ وَلَوِ اشْتَرَطَ عَلَيْهِ حِينَ أَسْلَفَهُ وَازِنَةً وَإِنَّمَا أَعْطَاهُ نُقَّصًا لَمْ يَحِلَّ لَهُ ذَلِكَ ‏.‏ قَالَ مَالِكٌ وَمِمَّا يُشْبِهُ ذَلِكَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ الْمُزَابَنَةِ وَأَرْخَصَ فِي بَيْعِ الْعَرَايَا بِخَرْصِهَا مِنَ التَّمْرِ وَإِنَّمَا فُرِقَ بَيْنَ ذَلِكَ أَنَّ بَيْعَ الْمُزَابَنَةِ بَيْعٌ عَلَى وَجْهِ الْمُكَايَسَةِ وَالتِّجَارَةِ وَأَنَّ بَيْعَ الْعَرَايَا عَلَى وَجْهِ الْمَعْرُوفِ لاَ مُكَايَسَةَ فِيهِ ‏.‏ قَالَ مَالِكٌ وَلاَ يَنْبَغِي أَنْ يَشْتَرِيَ رَجُلٌ طَعَامًا بِرُبُعٍ أَوْ ثُلُثٍ أَوْ كِسْرٍ مِنْ دِرْهَمٍ عَلَى أَنْ يُعْطَى بِذَلِكَ طَعَامًا إِلَى أَجَلٍ وَلاَ بَأْسَ أَنْ يَبْتَاعَ الرَّجُلُ طَعَامًا بِكِسْرٍ مِنْ دِرْهَمٍ إِلَى أَجَلٍ ثُمَّ يُعْطَى دِرْهَمًا وَيَأْخُذُ بِمَا بَقِيَ لَهُ مِنْ دِرْهَمِهِ سِلْعَةً مِنَ السِّلَعِ لأَنَّهُ أَعْطَى الْكِسْرَ الَّذِي عَلَيْهِ فِضَّةً وَأَخَذَ بِبَقِيَّةِ دِرْهَمِهِ سِلْعَةً فَهَذَا لاَ بَأْسَ بِهِ ‏.‏ قَالَ مَالِكٌ وَلاَ بَأْسَ أَنْ يَضَعَ الرَّجُلُ عِنْدَ الرَّجُلِ دِرْهَمًا ثُمَّ يَأْخُذُ مِنْهُ بِرُبُعٍ أَوْ بِثُلُثٍ أَوْ بِكِسْرٍ مَعْلُومٍ سِلْعَةً مَعْلُومَةً فَإِذَا لَمْ يَكُنْ فِي ذَلِكَ سِعْرٌ مَعْلُومٌ وَقَالَ الرَّجُلُ آخُذُ مِنْكَ بِسِعْرِ كُلِّ يَوْمٍ فَهَذَا لاَ يَحِلُّ لأَنَّهُ غَرَرٌ يَقِلُّ مَرَّةً وَيَكْثُرُ مَرَّةً وَلَمْ يَفْتَرِقَا عَلَى بَيْعٍ مَعْلُومٍ ‏.‏ قَالَ مَالِكٌ وَمَنْ بَاعَ طَعَامًا جِزَافًا وَلَمْ يَسْتَثْنِ مِنْهُ شَيْئًا ثُمَّ بَدَا لَهُ أَنْ يَشْتَرِيَ مِنْهُ شَيْئًا فَإِنَّهُ لاَ يَصْلُحُ لَهُ أَنْ يَشْتَرِيَ مِنْهُ شَيْئًا إِلاَّ مَا كَانَ يَجُوزُ لَهُ أَنْ يَسْتَثْنِيَ مِنْهُ وَذَلِكَ الثُّلُثُ فَمَا دُونَهُ فَإِنْ زَادَ عَلَى الثُّلُثِ صَارَ ذَلِكَ إِلَى الْمُزَابَنَةِ وَإِلَى مَا يُكْرَهُ فَلاَ يَنْبَغِي لَهُ أَنْ يَشْتَرِيَ مِنْهُ شَيْئًا إِلاَّ مَا كَانَ يَجُوزُ لَهُ أَنْ يَسْتَثْنِيَ مِنْهُ وَلاَ يَجُوزُ لَهُ أَنْ يَسْتَثْنِيَ مِنْهُ إِلاَّ الثُّلُثَ فَمَا دُونَهُ وَهَذَا الأَمْرُ الَّذِي لاَ اخْتِلاَفَ فِيهِ عِنْدَنَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1344
			}
		}
	]
}