{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"31": "Business Transactions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1358,
			"arabicnumber": 1358,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، أَنَّهُ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، وَرَجُلٌ، يَسْأَلُهُ عَنْ رَجُلٍ، سَلَّفَ فِي سَبَائِبَ فَأَرَادَ بَيْعَهَا قَبْلَ أَنْ يَقْبِضَهَا فَقَالَ ابْنُ عَبَّاسٍ تِلْكَ الْوَرِقُ بِالْوَرِقِ ‏.‏ وَكَرِهَ ذَلِكَ ‏.‏ قَالَ مَالِكٌ وَذَلِكَ فِيمَا نُرَى وَاللَّهُ أَعْلَمُ أَنَّهُ أَرَادَ أَنْ يَبِيعَهَا مِنْ صَاحِبِهَا الَّذِي اشْتَرَاهَا مِنْهُ بِأَكْثَرَ مِنَ الثَّمَنِ الَّذِي ابْتَاعَهَا بِهِ وَلَوْ أَنَّهُ بَاعَهَا مِنْ غَيْرِ الَّذِي اشْتَرَاهَا مِنْهُ لَمْ يَكُنْ بِذَلِكَ بَأْسٌ ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا فِيمَنْ سَلَّفَ فِي رَقِيقٍ أَوْ مَاشِيَةٍ أَوْ عُرُوضٍ فَإِذَا كَانَ كُلُّ شَىْءٍ مِنْ ذَلِكَ مَوْصُوفًا فَسَلَّفَ فِيهِ إِلَى أَجَلٍ فَحَلَّ الأَجَلُ فَإِنَّ الْمُشْتَرِيَ لاَ يَبِيعُ شَيْئًا مِنْ ذَلِكَ مِنَ الَّذِي اشْتَرَاهُ مِنْهُ بِأَكْثَرَ مِنَ الثَّمَنِ الَّذِي سَلَّفَهُ فِيهِ قَبْلَ أَنْ يَقْبِضَ مَا سَلَّفَهُ فِيهِ وَذَلِكَ أَنَّهُ إِذَا فَعَلَهُ فَهُوَ الرِّبَا صَارَ الْمُشْتَرِي إِنْ أَعْطَى الَّذِي بَاعَهُ دَنَانِيرَ أَوْ دَرَاهِمَ فَانْتَفَعَ بِهَا فَلَمَّا حَلَّتْ عَلَيْهِ السِّلْعَةُ وَلَمْ يَقْبِضْهَا الْمُشْتَرِي بَاعَهَا مِنْ صَاحِبِهَا بِأَكْثَرَ مِمَّا سَلَّفَهُ فِيهَا فَصَارَ أَنْ رَدَّ إِلَيْهِ مَا سَلَّفَهُ وَزَادَهُ مِنْ عِنْدِهِ ‏.‏ قَالَ مَالِكٌ مَنْ سَلَّفَ ذَهَبًا أَوْ وَرِقًا فِي حَيَوَانٍ أَوْ عُرُوضٍ إِذَا كَانَ مَوْصُوفًا إِلَى أَجَلٍ مُسَمًّى ثُمَّ حَلَّ الأَجَلُ فَإِنَّهُ لاَ بَأْسَ أَنْ يَبِيعَ الْمُشْتَرِي تِلْكَ السِّلْعَةَ مِنَ الْبَائِعِ قَبْلَ أَنْ يَحِلَّ الأَجَلُ أَوْ بَعْدَ مَا يَحِلُّ بِعَرْضٍ مِنَ الْعُرُوضِ يُعَجِّلُهُ وَلاَ يُؤَخِّرُهُ بَالِغًا مَا بَلَغَ ذَلِكَ الْعَرْضُ إِلاَّ الطَّعَامَ فَإِنَّهُ لاَ يَحِلُّ أَنْ يَبِيعَهُ حَتَّى يَقْبِضَهُ وَلِلْمُشْتَرِي أَنْ يَبِيعَ تِلْكَ السِّلْعَةَ مِنْ غَيْرِ صَاحِبِهِ الَّذِي ابْتَاعَهَا مِنْهُ بِذَهَبٍ أَوْ وَرِقٍ أَوْ عَرْضٍ مِنَ الْعُرُوضِ يَقْبِضُ ذَلِكَ وَلاَ يُؤَخِّرُهُ لأَنَّهُ إِذَا أَخَّرَ ذَلِكَ قَبُحَ وَدَخَلَهُ مَا يُكْرَهُ مِنَ الْكَالِئِ بِالْكَالِئِ وَالْكَالِئُ بِالْكَالِئِ أَنْ يَبِيعَ الرَّجُلُ دَيْنًا لَهُ عَلَى رَجُلٍ بِدَيْنٍ عَلَى رَجُلٍ آخَرَ ‏.‏ قَالَ مَالِكٌ وَمَنْ سَلَّفَ فِي سِلْعَةٍ إِلَى أَجَلٍ وَتِلْكَ السِّلْعَةُ مِمَّا لاَ يُؤْكَلُ وَلاَ يُشْرَبُ فَإِنَّ الْمُشْتَرِيَ يَبِيعُهَا مِمَّنْ شَاءَ بِنَقْدٍ أَوْ عَرْضٍ قَبْلَ أَنْ يَسْتَوْفِيَهَا مِنْ غَيْرِ صَاحِبِهَا الَّذِي اشْتَرَاهَا مِنْهُ وَلاَ يَنْبَغِي لَهُ أَنْ يَبِيعَهَا مِنَ الَّذِي ابْتَاعَهَا مِنْهُ إِلاَّ بِعَرْضٍ يَقْبِضُهُ وَلاَ يُؤَخِّرُهُ ‏.‏ قَالَ مَالِكٌ وَإِنْ كَانَتِ السِّلْعَةُ لَمْ تَحِلَّ فَلاَ بَأْسَ بِأَنْ يَبِيعَهَا مِنْ صَاحِبِهَا بِعَرْضٍ مُخَالِفٍ لَهَا بَيِّنٍ خِلاَفُهُ يَقْبِضُهُ وَلاَ يُؤَخِّرُهُ ‏.‏ قَالَ مَالِكٌ فِيمَنْ سَلَّفَ دَنَانِيرَ أَوْ دَرَاهِمَ فِي أَرْبَعَةِ أَثْوَابٍ مَوْصُوفَةٍ إِلَى أَجَلٍ فَلَمَّا حَلَّ الأَجَلُ تَقَاضَى صَاحِبَهَا فَلَمْ يَجِدْهَا عِنْدَهُ وَوَجَدَ عِنْدَهُ ثِيَابًا دُونَهَا مِنْ صِنْفِهَا فَقَالَ لَهُ الَّذِي عَلَيْهِ الأَثْوَابُ أُعْطِيكَ بِهَا ثَمَانِيَةَ أَثْوَابٍ مِنْ ثِيَابِي هَذِهِ ‏.‏ إِنَّهُ لاَ بَأْسَ بِذَلِكَ إِذَا أَخَذَ تِلْكَ الأَثْوَابَ الَّتِي يُعْطِيهِ قَبْلَ أَنْ يَفْتَرِقَا فَإِنْ دَخَلَ ذَلِكَ الأَجَلُ فَإِنَّهُ لاَ يَصْلُحُ وَإِنْ كَانَ ذَلِكَ قَبْلَ مَحِلِّ الأَجَلِ فَإِنَّهُ لاَ يَصْلُحُ أَيْضًا إِلاَّ أَنْ يَبِيعَهُ ثِيَابًا لَيْسَتْ مِنْ صِنْفِ الثِّيَابِ الَّتِي سَلَّفَهُ فِيهَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1358
			}
		}
	]
}