{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"31": "Business Transactions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1362,
			"arabicnumber": 1362,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي حَازِمِ بْنِ دِينَارٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ الْغَرَرِ ‏.‏ قَالَ مَالِكٌ وَمِنَ الْغَرَرِ وَالْمُخَاطَرَةِ أَنْ يَعْمِدَ الرَّجُلُ قَدْ ضَلَّتْ دَابَّتُهُ أَوْ أَبَقَ غُلاَمُهُ وَثَمَنُ الشَّىْءِ مِنْ ذَلِكَ خَمْسُونَ دِينَارًا فَيَقُولُ رَجُلٌ أَنَا آخُذُهُ مِنْكَ بِعِشْرِينَ دِينَارًا ‏.‏ فَإِنْ وَجَدَهُ الْمُبْتَاعُ ذَهَبَ مِنَ الْبَائِعِ ثَلاَثُونَ دِينَارًا وَإِنْ لَمْ يَجِدْهُ ذَهَبَ الْبَائِعُ مِنَ الْمُبْتَاعِ بِعِشْرِينَ دِينَارًا ‏.‏ قَالَ مَالِكٌ وَفِي ذَلِكَ عَيْبٌ آخَرُ إِنَّ تِلْكَ الضَّالَّةَ إِنْ وُجِدَتْ لَمْ يُدْرَ أَزَادَتْ أَمْ نَقَصَتْ أَمْ مَا حَدَثَ بِهَا مِنَ الْعُيُوبِ فَهَذَا أَعْظَمُ الْمُخَاطَرَةِ ‏.‏ قَالَ مَالِكٌ وَالأَمْرُ عِنْدَنَا أَنَّ مِنَ الْمُخَاطَرَةِ وَالْغَرَرِ اشْتِرَاءَ مَا فِي بُطُونِ الإِنَاثِ مِنَ النِّسَاءِ وَالدَّوَابِّ لأَنَّهُ لاَ يُدْرَى أَيَخْرُجُ أَمْ لاَ يَخْرُجُ فَإِنْ خَرَجَ لَمْ يُدْرَ أَيَكُونُ حَسَنًا أَمْ قَبِيحًا أَمْ تَامًّا أَمْ نَاقِصًا أَمْ ذَكَرًا أَمْ أُنْثَى وَذَلِكَ كُلُّهُ يَتَفَاضَلُ إِنْ كَانَ عَلَى كَذَا فَقِيمَتُهُ كَذَا وَإِنْ كَانَ عَلَى كَذَا فَقِيمَتُهُ كَذَا ‏.‏ قَالَ مَالِكٌ وَلاَ يَنْبَغِي بَيْعُ الإِنَاثِ وَاسْتِثْنَاءُ مَا فِي بُطُونِهَا وَذَلِكَ أَنْ يَقُولَ الرَّجُلُ لِلرَّجُلِ ثَمَنُ شَاتِي الْغَزِيرَةِ ثَلاَثَةُ دَنَانِيرَ فَهِيَ لَكَ بِدِينَارَيْنِ وَلِي مَا فِي بَطْنِهَا ‏.‏ فَهَذَا مَكْرُوهٌ لأَنَّهُ غَرَرٌ وَمُخَاطَرَةٌ ‏.‏ قَالَ مَالِكٌ وَلاَ يَحِلُّ بَيْعُ الزَّيْتُونِ بِالزَّيْتِ وَلاَ الْجُلْجُلاَنِ بِدُهْنِ الْجُلْجُلاَنِ وَلاَ الزُّبْدِ بِالسَّمْنِ لأَنَّ الْمُزَابَنَةَ تَدْخُلُهُ وَلأَنَّ الَّذِي يَشْتَرِي الْحَبَّ وَمَا أَشْبَهَهُ بِشَىْءٍ مُسَمًّى مِمَّا يَخْرُجُ مِنْهُ لاَ يَدْرِي أَيَخْرُجُ مِنْهُ أَقَلُّ مِنْ ذَلِكَ أَوْ أَكْثَرُ فَهَذَا غَرَرٌ وَمُخَاطَرَةٌ ‏.‏ قَالَ مَالِكٌ وَمِنْ ذَلِكَ أَيْضًا اشْتِرَاءُ حَبِّ الْبَانِ بِالسَّلِيخَةِ فَذَلِكَ غَرَرٌ لأَنَّ الَّذِي يَخْرُجُ مِنْ حَبِّ الْبَانِ هُوَ السَّلِيخَةُ وَلاَ بَأْسَ بِحَبِّ الْبَانِ بِالْبَانِ الْمُطَيَّبِ لأَنَّ الْبَانَ الْمُطَيَّبَ قَدْ طُيِّبَ وَنُشَّ وَتَحَوَّلَ عَنْ حَالِ السَّلِيخَةِ ‏.‏ قَالَ مَالِكٌ فِي رَجُلٍ بَاعَ سِلْعَةً مِنْ رَجُلٍ عَلَى أَنَّهُ لاَ نُقْصَانَ عَلَى الْمُبْتَاعِ إِنَّ ذَلِكَ بَيْعٌ غَيْرُ جَائِزٍ وَهُوَ مِنَ الْمُخَاطَرَةِ وَتَفْسِيرُ ذَلِكَ أَنَّهُ كَأَنَّهُ اسْتَأْجَرَهُ بِرِبْحٍ إِنْ كَانَ فِي تِلْكَ السِّلْعَةِ وَإِنْ بَاعَ بِرَأْسِ الْمَالِ أَوْ بِنُقْصَانٍ فَلاَ شَىْءَ لَهُ وَذَهَبَ عَنَاؤُهُ بَاطِلاً فَهَذَا لاَ يَصْلُحُ وَلِلْمُبْتَاعِ فِي هَذَا أُجْرَةٌ بِمِقْدَارِ مَا عَالَجَ مِنْ ذَلِكَ وَمَا كَانَ فِي تِلْكَ السِّلْعَةِ مِنْ نُقْصَانٍ أَوْ رِبْحٍ فَهُوَ لِلْبَائِعِ وَعَلَيْهِ وَإِنَّمَا يَكُونُ ذَلِكَ إِذَا فَاتَتِ السِّلْعَةُ وَبِيعَتْ ‏.‏ فَإِنْ لَمْ تَفُتْ فُسِخَ الْبَيْعُ بَيْنَهُمَا ‏.‏ قَالَ مَالِكٌ فَأَمَّا أَنْ يَبِيعَ رَجُلٌ مِنْ رَجُلٍ سِلْعَةً يَبُتُّ بَيْعَهَا ثُمَّ يَنْدَمُ الْمُشْتَرِي فَيَقُولُ لِلْبَائِعِ ضَعْ عَنِّي فَيَأْبَى الْبَائِعُ وَيَقُولُ بِعْ فَلاَ نُقْصَانَ عَلَيْكَ ‏.‏ فَهَذَا لاَ بَأْسَ بِهِ لأَنَّهُ لَيْسَ مِنَ الْمُخَاطَرَةِ وَإِنَّمَا هُوَ شَىْءٌ وَضَعَهُ لَهُ وَلَيْسَ عَلَى ذَلِكَ عَقَدَا بَيْعَهُمَا وَذَلِكَ الَّذِي عَلَيْهِ الأَمْرُ عِنْدَنَا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1362
			}
		}
	]
}