{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"35": "Pre-emption in Property"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1397,
			"arabicnumber": 1397,
			"text": "وَحَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، مِثْلُ ذَلِكَ ‏.‏ قَالَ مَالِكٌ فِي رَجُلٍ اشْتَرَى شِقْصًا مَعَ قَوْمٍ فِي أَرْضٍ بِحَيَوَانٍ عَبْدٍ أَوْ وَلِيدَةٍ أَوْ مَا أَشْبَهَ ذَلِكَ مِنَ الْعُرُوضِ فَجَاءَ الشَّرِيكُ يَأْخُذُ بِشُفْعَتِهِ بَعْدَ ذَلِكَ فَوَجَدَ الْعَبْدَ أَوِ الْوَلِيدَةَ قَدْ هَلَكَا وَلَمْ يَعْلَمْ أَحَدٌ قَدْرَ قِيمَتِهِمَا فَيَقُولُ الْمُشْتَرِي قِيمَةُ الْعَبْدِ أَوِ الْوَلِيدَةِ مِائَةُ دِينَارٍ وَيَقُولُ صَاحِبُ الشُّفْعَةِ الشَّرِيكُ بَلْ قِيمَتُهُمَا خَمْسُونَ دِينَارًا ‏.‏ قَالَ مَالِكٌ يَحْلِفُ الْمُشْتَرِي أَنَّ قِيمَةَ مَا اشْتَرَى بِهِ مِائَةُ دِينَارٍ ثُمَّ إِنْ شَاءَ أَنْ يَأْخُذَ صَاحِبُ الشُّفْعَةِ أَخَذَ أَوْ يَتْرُكَ إِلاَّ أَنْ يَأْتِيَ الشَّفِيعُ بِبَيِّنَةٍ أَنَّ قِيمَةَ الْعَبْدِ أَوِ الْوَلِيدَةِ دُونَ مَا قَالَ الْمُشْتَرِي ‏.‏ قَالَ مَالِكٌ مَنْ وَهَبَ شِقْصًا فِي دَارٍ أَوْ أَرْضٍ مُشْتَرَكَةٍ فَأَثَابَهُ الْمَوْهُوبُ لَهُ بِهَا نَقْدًا أَوْ عَرْضًا فَإِنَّ الشُّرَكَاءَ يَأْخُذُونَهَا بِالشُّفْعَةِ إِنْ شَاءُوا وَيَدْفَعُونَ إِلَى الْمَوْهُوبِ لَهُ قِيمَةَ مَثُوبَتِهِ دَنَانِيرَ أَوْ دَرَاهِمَ ‏.‏ قَالَ مَالِكٌ مَنْ وَهَبَ هِبَةً فِي دَارٍ أَوْ أَرْضٍ مُشْتَرَكَةٍ فَلَمْ يُثَبْ مِنْهَا وَلَمْ يَطْلُبْهَا فَأَرَادَ شَرِيكُهُ أَنْ يَأْخُذَهَا بِقِيمَتِهَا فَلَيْسَ ذَلِكَ لَهُ مَا لَمْ يُثَبْ عَلَيْهَا فَإِنْ أُثِيبَ فَهُوَ لِلشَّفِيعِ بِقِيمَةِ الثَّوَابِ ‏.‏ قَالَ مَالِكٌ فِي رَجُلٍ اشْتَرَى شِقْصًا فِي أَرْضٍ مُشْتَرَكَةٍ بِثَمَنٍ إِلَى أَجَلٍ فَأَرَادَ الشَّرِيكُ أَنْ يَأْخُذَهَا بِالشُّفْعَةِ ‏.‏ قَالَ مَالِكٌ إِنْ كَانَ مَلِيًّا فَلَهُ الشُّفْعَةُ بِذَلِكَ الثَّمَنِ إِلَى ذَلِكَ الأَجَلِ وَإِنْ كَانَ مَخُوفًا أَنْ لاَ يُؤَدِّيَ الثَّمَنَ إِلَى ذَلِكَ الأَجَلِ فَإِذَا جَاءَهُمْ بِحَمِيلٍ مَلِيٍّ ثِقَةٍ مِثْلِ الَّذِي اشْتَرَى مِنْهُ الشِّقْصَ فِي الأَرْضِ الْمُشْتَرَكَةِ فَذَلِكَ لَهُ ‏.‏ قَالَ مَالِكٌ لاَ تَقْطَعُ شُفْعَةَ الْغَائِبِ غَيْبَتُهُ وَإِنْ طَالَتْ غَيْبَتُهُ وَلَيْسَ لِذَلِكَ عِنْدَنَا حَدٌّ تُقْطَعُ إِلَيْهِ الشُّفْعَةُ ‏.‏ قَالَ مَالِكٌ فِي الرَّجُلِ يُوَرِّثُ الأَرْضَ نَفَرًا مِنْ وَلَدِهِ ثُمَّ يُولَدُ لأَحَدِ النَّفَرِ ثُمَّ يَهْلِكُ الأَبُ فَيَبِيعُ أَحَدُ وَلَدِ الْمَيِّتِ حَقَّهُ فِي تِلْكَ الأَرْضِ فَإِنَّ أَخَا الْبَائِعِ أَحَقُّ بِشُفْعَتِهِ مِنْ عُمُومَتِهِ شُرَكَاءِ أَبِيهِ ‏.‏ قَالَ مَالِكٌ وَهَذَا الأَمْرُ عِنْدَنَا ‏.‏ قَالَ مَالِكٌ الشُّفْعَةُ بَيْنَ الشُّرَكَاءِ عَلَى قَدْرِ حِصَصِهِمْ يَأْخُذُ كُلُّ إِنْسَانٍ مِنْهُمْ بِقَدْرِ نَصِيبِهِ إِنْ كَانَ قَلِيلاً فَقَلِيلاً وَإِنْ كَانَ كَثِيرًا فَبِقَدْرِهِ وَذَلِكَ إِنْ تَشَاحُّوا فِيهَا ‏.‏ قَالَ مَالِكٌ فَأَمَّا أَنْ يَشْتَرِيَ رَجُلٌ مِنْ رَجُلٍ مِنْ شُرَكَائِهِ حَقَّهُ فَيَقُولُ أَحَدُ الشُّرَكَاءِ أَنَا آخُذُ مِنَ الشُّفْعَةِ بِقَدْرِ حِصَّتِي ‏.‏ وَيَقُولُ الْمُشْتَرِي إِنْ شِئْتَ أَنْ تَأْخُذَ الشُّفْعَةَ كُلَّهَا أَسْلَمْتُهَا إِلَيْكَ وَإِنْ شِئْتَ أَنْ تَدَعَ فَدَعْ فَإِنَّ الْمُشْتَرِيَ إِذَا خَيَّرَهُ فِي هَذَا وَأَسْلَمَهُ إِلَيْهِ فَلَيْسَ لِلشَّفِيعِ إِلاَّ أَنْ يَأْخُذَ الشُّفْعَةَ كُلَّهَا أَوْ يُسْلِمَهَا إِلَيْهِ فَإِنْ أَخَذَهَا فَهُوَ أَحَقُّ بِهَا وَإِلاَّ فَلاَ شَىْءَ لَهُ ‏.‏ قَالَ مَالِكٌ فِي الرَّجُلِ يَشْتَرِي الأَرْضَ فَيَعْمُرُهَا بِالأَصْلِ يَضَعُهُ فِيهَا أَوِ الْبِئْرِ يَحْفِرُهَا ثُمَّ يَأْتِي رَجُلٌ فَيُدْرِكُ فِيهَا حَقًّا فَيُرِيدُ أَنْ يَأْخُذَهَا بِالشُّفْعَةِ إِنَّهُ لاَ شُفْعَةَ لَهُ فِيهَا إِلاَّ أَنْ يُعْطِيَهُ قِيمَةَ مَا عَمَرَ فَإِنْ أَعْطَاهُ قِيمَةَ مَا عَمَرَ كَانَ أَحَقَّ بِالشُّفْعَةِ وَإِلاَّ فَلاَ حَقَّ لَهُ فِيهَا ‏.‏ قَالَ مَالِكٌ مَنْ بَاعَ حِصَّتَهُ مِنْ أَرْضٍ أَوْ دَارٍ مُشْتَرَكَةٍ فَلَمَّا عَلِمَ أَنَّ صَاحِبَ الشُّفْعَةِ يَأْخُذُ بِالشُّفْعَةِ اسْتَقَالَ الْمُشْتَرِي فَأَقَالَهُ ‏.‏ قَالَ لَيْسَ ذَلِكَ لَهُ وَالشَّفِيعُ أَحَقُّ بِهَا بِالثَّمَنِ الَّذِي كَانَ بَاعَهَا بِهِ ‏.‏ قَالَ مَالِكٌ مَنِ اشْتَرَى شِقْصًا فِي دَارٍ أَوْ أَرْضٍ وَحَيَوَانًا وَعُرُوضًا فِي صَفْقَةٍ وَاحِدَةٍ فَطَلَبَ الشَّفِيعُ شُفْعَتَهُ فِي الدَّارِ أَوِ الأَرْضِ فَقَالَ الْمُشْتَرِي خُذْ مَا اشْتَرَيْتُ جَمِيعًا فَإِنِّي إِنَّمَا اشْتَرَيْتُهُ جَمِيعًا ‏.‏ قَالَ مَالِكٌ بَلْ يَأْخُذُ الشَّفِيعُ شُفْعَتَهُ فِي الدَّارِ أَوِ الأَرْضِ بِحِصَّتِهَا مِنْ ذَلِكَ الثَّمَنِ يُقَامُ كُلُّ شَىْءٍ اشْتَرَاهُ مِنْ ذَلِكَ عَلَى حِدَتِهِ عَلَى الثَّمَنِ الَّذِي اشْتَرَاهُ بِهِ ثُمَّ يَأْخُذُ الشَّفِيعُ شُفْعَتَهُ بِالَّذِي يُصِيبُهَا مِنَ الْقِيمَةِ مِنْ رَأْسِ الثَّمَنِ وَلاَ يَأْخُذُ مِنَ الْحَيَوَانِ وَالْعُرُوضِ شَيْئًا إِلاَّ أَنْ يَشَاءَ ذَلِكَ ‏.‏ قَالَ مَالِكٌ وَمَنْ بَاعَ شِقْصًا مِنْ أَرْضٍ مُشْتَرَكَةٍ فَسَلَّمَ بَعْضُ مَنْ لَهُ فِيهَا الشُّفْعَةُ لِلْبَائِعِ وَأَبَى بَعْضُهُمْ إِلاَّ أَنْ يَأْخُذَ بِشُفْعَتِهِ إِنَّ مَنْ أَبَى أَنْ يُسَلِّمَ يَأْخُذُ بِالشُّفْعَةِ كُلِّهَا وَلَيْسَ لَهُ أَنْ يَأْخُذَ بِقَدْرِ حَقِّهِ وَيَتْرُكَ مَا بَقِيَ ‏.‏ قَالَ مَالِكٌ فِي نَفَرٍ شُرَكَاءَ فِي دَارٍ وَاحِدَةٍ فَبَاعَ أَحَدُهُمْ حِصَّتَهُ وَشُرَكَاؤُهُ غُيَّبٌ كُلُّهُمْ إِلاَّ رَجُلاً فَعُرِضَ عَلَى الْحَاضِرِ أَنْ يَأْخُذَ بِالشُّفْعَةِ أَوْ يَتْرُكَ ‏.‏ فَقَالَ أَنَا آخُذُ بِحِصَّتِي وَأَتْرُكُ حِصَصَ شُرَكَائِي حَتَّى يَقْدَمُوا فَإِنْ أَخَذُوا فَذَلِكَ وَإِنْ تَرَكُوا أَخَذْتُ جَمِيعَ الشُّفْعَةِ ‏.‏ قَالَ مَالِكٌ لَيْسَ لَهُ إِلاَّ أَنْ يَأْخُذَ ذَلِكَ كُلَّهُ أَوْ يَتْرُكَ فَإِنْ جَاءَ شُرَكَاؤُهُ أَخَذُوا مِنْهُ أَوْ تَرَكُوا إِنْ شَاءُوا فَإِذَا عُرِضَ هَذَا عَلَيْهِ فَلَمْ يَقْبَلْهُ فَلاَ أَرَى لَهُ شُفْعَةً ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 1397
			}
		}
	]
}