{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"35": "Pre-emption in Property"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1398,
			"arabicnumber": 1398,
			"text": "قَالَ يَحْيَى قَالَ مَالِكٌ عَنْ مُحَمَّدِ بْنِ عُمَارَةَ، عَنْ أَبِي بَكْرِ بْنِ حَزْمٍ، أَنَّ عُثْمَانَ بْنَ عَفَّانَ، قَالَ إِذَا وَقَعَتِ الْحُدُودُ فِي الأَرْضِ فَلاَ شُفْعَةَ فِيهَا وَلاَ شُفْعَةَ فِي بِئْرٍ وَلاَ فِي فَحْلِ النَّخْلِ ‏.‏ قَالَ مَالِكٌ وَعَلَى هَذَا الأَمْرُ عِنْدَنَا ‏.‏ قَالَ مَالِكٌ وَلاَ شُفْعَةَ فِي طَرِيقٍ صَلُحَ الْقَسْمُ فِيهَا أَوْ لَمْ يَصْلُحْ ‏.‏ قَالَ مَالِكٌ وَالأَمْرُ عِنْدَنَا أَنَّهُ لاَ شُفْعَةَ فِي عَرْصَةِ دَارٍ صَلُحَ الْقَسْمُ فِيهَا أَوْ لَمْ يَصْلُحْ ‏.‏ قَالَ مَالِكٌ فِي رَجُلٍ اشْتَرَى شِقْصًا مِنْ أَرْضٍ مُشْتَرَكَةٍ عَلَى أَنَّهُ فِيهَا بِالْخِيَارِ فَأَرَادَ شُرَكَاءُ الْبَائِعِ أَنْ يَأْخُذُوا مَا بَاعَ شَرِيكُهُمْ بِالشُّفْعَةِ قَبْلَ أَنْ يَخْتَارَ الْمُشْتَرِي إِنَّ ذَلِكَ لاَ يَكُونُ لَهُمْ حَتَّى يَأْخُذَ الْمُشْتَرِي وَيَثْبُتَ لَهُ الْبَيْعُ فَإِذَا وَجَبَ لَهُ الْبَيْعُ فَلَهُمُ الشُّفْعَةُ ‏.‏ وَقَالَ مَالِكٌ فِي الرَّجُلِ يَشْتَرِي أَرْضًا فَتَمْكُثُ فِي يَدَيْهِ حِينًا ثُمَّ يَأْتِي رَجُلٌ فَيُدْرِكُ فِيهَا حَقًّا بِمِيرَاثٍ إِنَّ لَهُ الشُّفْعَةَ إِنْ ثَبَتَ حَقُّهُ وَإِنَّ مَا أَغَلَّتِ الأَرْضُ مِنْ غَلَّةٍ فَهِيَ لِلْمُشْتَرِي الأَوَّلِ إِلَى يَوْمِ يَثْبُتُ حَقُّ الآخَرِ لأَنَّهُ قَدْ كَانَ ضَمِنَهَا لَوْ هَلَكَ مَا كَانَ فِيهَا مِنْ غِرَاسٍ أَوْ ذَهَبَ بِهِ سَيْلٌ ‏.‏ قَالَ فَإِنْ طَالَ الزَّمَانُ أَوْ هَلَكَ الشُّهُودُ أَوْ مَاتَ الْبَائِعُ أَوِ الْمُشْتَرِي أَوْ هُمَا حَيَّانِ فَنُسِيَ أَصْلُ الْبَيْعِ وَالاِشْتِرَاءِ لِطُولِ الزَّمَانِ فَإِنَّ الشُّفْعَةَ تَنْقَطِعُ وَيَأْخُذُ حَقَّهُ الَّذِي ثَبَتَ لَهُ وَإِنْ كَانَ أَمْرُهُ عَلَى غَيْرِ هَذَا الْوَجْهِ فِي حَدَاثَةِ الْعَهْدِ وَقُرْبِهِ وَأَنَّهُ يَرَى أَنَّ الْبَائِعَ غَيَّبَ الثَّمَنَ وَأَخْفَاهُ لِيَقْطَعَ بِذَلِكَ حَقَّ صَاحِبِ الشُّفْعَةِ قُوِّمَتِ الأَرْضُ عَلَى قَدْرِ مَا يُرَى أَنَّهُ ثَمَنُهَا فَيَصِيرُ ثَمَنُهَا إِلَى ذَلِكَ ثُمَّ يُنْظَرُ إِلَى مَا زَادَ فِي الأَرْضِ مِنْ بِنَاءٍ أَوْ غِرَاسٍ أَوْ عِمَارَةٍ فَيَكُونُ عَلَى مَا يَكُونُ عَلَيْهِ مَنِ ابْتَاعَ الأَرْضَ بِثَمَنٍ مَعْلُومٍ ثُمَّ بَنَى فِيهَا وَغَرَسَ ثُمَّ أَخَذَهَا صَاحِبُ الشُّفْعَةِ بَعْدَ ذَلِكَ ‏.‏ قَالَ مَالِكٌ وَالشُّفْعَةُ ثَابِتَةٌ فِي مَالِ الْمَيِّتِ كَمَا هِيَ فِي مَالِ الْحَىِّ فَإِنْ خَشِيَ أَهْلُ الْمَيِّتِ أَنْ يَنْكَسِرَ مَالُ الْمَيِّتِ قَسَمُوهُ ثُمَّ بَاعُوهُ فَلَيْسَ عَلَيْهِمْ فِيهِ شُفْعَةٌ ‏.‏ قَالَ مَالِكٌ وَلاَ شُفْعَةَ عِنْدَنَا فِي عَبْدٍ وَلاَ وَلِيدَةٍ وَلاَ بَعِيرٍ وَلاَ بَقَرَةٍ وَلاَ شَاةٍ وَلاَ فِي شَىْءٍ مِنَ الْحَيَوَانِ وَلاَ فِي ثَوْبٍ وَلاَ فِي بِئْرٍ لَيْسَ لَهَا بَيَاضٌ إِنَّمَا الشُّفْعَةُ فِيمَا يَصْلُحُ أَنَّهُ يَنْقَسِمُ وَتَقَعُ فِيهِ الْحُدُودُ مِنَ الأَرْضِ فَأَمَّا مَا لاَ يَصْلُحُ فِيهِ الْقَسْمُ فَلاَ شُفْعَةَ فِيهِ ‏.‏ قَالَ مَالِكٌ وَمَنِ اشْتَرَى أَرْضًا فِيهَا شُفْعَةٌ لِنَاسٍ حُضُورٍ فَلْيَرْفَعْهُمْ إِلَى السُّلْطَانِ فَإِمَّا أَنْ يَسْتَحِقُّوا وَإِمَّا أَنْ يُسَلِّمَ لَهُ السُّلْطَانُ فَإِنْ تَرَكَهُمْ فَلَمْ يَرْفَعْ أَمْرَهُمْ إِلَى السُّلْطَانِ وَقَدْ عَلِمُوا بِاشْتِرَائِهِ فَتَرَكُوا ذَلِكَ حَتَّى طَالَ زَمَانُهُ ثُمَّ جَاءُوا يَطْلُبُونَ شُفْعَتَهُمْ فَلاَ أَرَى ذَلِكَ لَهُمْ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 1398
			}
		}
	]
}