{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"17": "Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 600,
			"arabicnumber": 600,
			"text": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ حُمَيْدِ بْنِ قَيْسٍ الْمَكِّيِّ، عَنْ طَاوُسٍ الْيَمَانِيِّ، أَنَّ مُعَاذَ بْنَ جَبَلٍ الأَنْصَارِيَّ، أَخَذَ مِنْ ثَلاَثِينَ بَقَرَةً تَبِيعًا وَمِنْ أَرْبَعِينَ بَقَرَةً مُسِنَّةً وَأُتِيَ بِمَا دُونَ ذَلِكَ فَأَبَى أَنْ يَأْخُذَ مِنْهُ شَيْئًا وَقَالَ لَمْ أَسْمَعْ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فِيهِ شَيْئًا حَتَّى أَلْقَاهُ فَأَسْأَلَهُ ‏.‏ فَتُوُفِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَبْلَ أَنْ يَقْدُمَ مُعَاذُ بْنُ جَبَلٍ ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ أَحْسَنُ مَا سَمِعْتُ فِيمَنْ كَانَتْ لَهُ غَنَمٌ عَلَى رَاعِيَيْنِ مُفْتَرِقَيْنِ أَوْ عَلَى رِعَاءٍ مُفْتَرِقِينَ فِي بُلْدَانٍ شَتَّى أَنَّ ذَلِكَ يُجْمَعُ كُلُّهُ عَلَى صَاحِبِهِ فَيُؤَدِّي مِنْهُ صَدَقَتَهُ وَمِثْلُ ذَلِكَ الرَّجُلُ يَكُونُ لَهُ الذَّهَبُ أَوِ الْوَرِقُ مُتَفَرِّقَةً فِي أَيْدِي نَاسٍ شَتَّى أَنَّهُ يَنْبَغِي لَهُ أَنْ يَجْمَعَهَا فَيُخْرِجَ مِنْهَا مَا وَجَبَ عَلَيْهِ فِي ذَلِكَ مِنْ زَكَاتِهَا ‏.‏ وَقَالَ يَحْيَى قَالَ مَالِكٌ فِي الرَّجُلِ يَكُونُ لَهُ الضَّأْنُ وَالْمَعْزُ أَنَّهَا تُجْمَعُ عَلَيْهِ فِي الصَّدَقَةِ فَإِنْ كَانَ فِيهَا مَا تَجِبُ فِيهِ الصَّدَقَةُ صُدِّقَتْ وَقَالَ إِنَّمَا هِيَ غَنَمٌ كُلُّهَا وَفِي كِتَابِ عُمَرَ بْنِ الْخَطَّابِ وَفِي سَائِمَةِ الْغَنَمِ إِذَا بَلَغَتْ أَرْبَعِينَ شَاةً شَاةٌ ‏.‏ قَالَ مَالِكٌ فَإِنْ كَانَتِ الضَّأْنُ هِيَ أَكْثَرَ مِنَ الْمَعْزِ وَلَمْ يَجِبْ عَلَى رَبِّهَا إِلاَّ شَاةٌ وَاحِدَةٌ أَخَذَ الْمُصَدِّقُ تِلْكَ الشَّاةَ الَّتِي وَجَبَتْ عَلَى رَبِّ الْمَالِ مِنَ الضَّأْنِ وَإِنْ كَانَتِ الْمَعْزُ أَكْثَرَ مِنَ الضَّأْنِ أُخِذَ مِنْهَا فَإِنِ اسْتَوَى الضَّأْنُ وَالْمَعْزُ أَخَذَ الشَّاةَ مِنْ أَيَّتِهِمَا شَاءَ ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ وَكَذَلِكَ الإِبِلُ الْعِرَابُ وَالْبُخْتُ يُجْمَعَانِ عَلَى رَبِّهِمَا فِي الصَّدَقَةِ ‏.‏ وَقَالَ إِنَّمَا هِيَ إِبِلٌ كُلُّهَا فَإِنْ كَانَتِ الْعِرَابُ هِيَ أَكْثَرَ مِنَ الْبُخْتِ وَلَمْ يَجِبْ عَلَى رَبِّهَا إِلاَّ بَعِيرٌ وَاحِدٌ فَلْيَأْخُذْ مِنَ الْعِرَابِ صَدَقَتَهَا فَإِنْ كَانَتِ الْبُخْتُ أَكْثَرَ فَلْيَأْخُذْ مِنْهَا فَإِنِ اسْتَوَتْ فَلْيَأْخُذْ مِنْ أَيَّتِهِمَا شَاءَ ‏.‏ قَالَ مَالِكٌ وَكَذَلِكَ الْبَقَرُ وَالْجَوَامِيسُ تُجْمَعُ فِي الصَّدَقَةِ عَلَى رَبِّهَا ‏.‏ وَقَالَ إِنَّمَا هِيَ بَقَرٌ كُلُّهَا فَإِنْ كَانَتِ الْبَقَرُ هِيَ أَكْثَرَ مِنَ الْجَوَامِيسِ وَلاَ تَجِبُ عَلَى رَبِّهَا إِلاَّ بَقَرَةٌ وَاحِدَةٌ فَلْيَأْخُذْ مِنَ الْبَقَرِ صَدَقَتَهُمَا وَإِنْ كَانَتِ الْجَوَامِيسُ أَكْثَرَ فَلْيَأْخُذْ مِنْهَا فَإِنِ اسْتَوَتْ فَلْيَأْخُذْ مِنْ أَيَّتِهِمَا شَاءَ فَإِذَا وَجَبَتْ فِي ذَلِكَ الصَّدَقَةُ صُدِّقَ الصِّنْفَانِ جَمِيعًا ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ مَنْ أَفَادَ مَاشِيَةً مِنْ إِبِلٍ أَوْ بَقَرٍ أَوْ غَنَمٍ فَلاَ صَدَقَةَ عَلَيْهِ فِيهَا حَتَّى يَحُولَ عَلَيْهَا الْحَوْلُ مِنْ يَوْمَ أَفَادَهَا إِلاَّ أَنْ يَكُونَ لَهُ قَبْلَهَا نِصَابُ مَاشِيَةٍ وَالنِّصَابُ مَا تَجِبُ فِيهِ الصَّدَقَةُ إِمَّا خَمْسُ ذَوْدٍ مِنَ الإِبِلِ وَإِمَّا ثَلاَثُونَ بَقَرَةً وَإِمَّا أَرْبَعُونَ شَاةً فَإِذَا كَانَ لِلرَّجُلِ خَمْسُ ذَوْدٍ مِنَ الإِبِلِ أَوْ ثَلاَثُونَ بَقَرَةً أَوْ أَرْبَعُونَ شَاةً ثُمَّ أَفَادَ إِلَيْهَا إِبِلاً أَوْ بَقَرًا أَوْ غَنَمًا بِاشْتِرَاءٍ أَوْ هِبَةٍ أَوْ مِيرَاثٍ فَإِنَّهُ يُصَدِّقُهَا مَعَ مَاشِيَتِهِ حِينَ يُصَدِّقُهَا وَإِنْ لَمْ يَحُلْ عَلَى الْفَائِدَةِ الْحَوْلُ وَإِنْ كَانَ مَا أَفَادَ مِنَ الْمَاشِيَةِ إِلَى مَاشِيَتِهِ قَدْ صُدِّقَتْ قَبْلَ أَنْ يَشْتَرِيَهَا بِيَوْمٍ وَاحِدٍ أَوْ قَبْلَ أَنْ يَرِثَهَا بِيَوْمٍ وَاحِدٍ فَإِنَّهُ يُصَدِّقُهَا مَعَ مَاشِيَتِهِ حِينَ يُصَدِّقُ مَاشِيَتَهُ ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ وَإِنَّمَا مَثَلُ ذَلِكَ مَثَلُ الْوَرِقِ يُزَكِّيهَا الرَّجُلُ ثُمَّ يَشْتَرِي بِهَا مِنْ رَجُلٍ آخَرَ عَرْضًا وَقَدْ وَجَبَتْ عَلَيْهِ فِي عَرْضِهِ ذَلِكَ إِذَا بَاعَهُ الصَّدَقَةُ فَيُخْرِجُ الرَّجُلُ الآخَرُ صَدَقَتَهَا هَذَا الْيَوْمَ وَيَكُونُ الآخَرُ قَدْ صَدَّقَهَا مِنَ الْغَدِ ‏.‏ قَالَ مَالِكٌ فِي رَجُلٍ كَانَتْ لَهُ غَنَمٌ لاَ تَجِبُ فِيهَا الصَّدَقَةُ فَاشْتَرَى إِلَيْهَا غَنَمًا كَثِيرَةً تَجِبُ فِي دُونِهَا الصَّدَقَةُ أَوْ وَرِثَهَا أَنَّهُ لاَ تَجِبُ عَلَيْهِ فِي الْغَنَمِ كُلِّهَا الصَّدَقَةُ حَتَّى يَحُولَ عَلَيْهَا الْحَوْلُ مِنْ يَوْمَ أَفَادَهَا بِاشْتِرَاءٍ أَوْ مِيرَاثٍ وَذَلِكَ أَنَّ كُلَّ مَا كَانَ عِنْدَ الرَّجُلِ مِنْ مَاشِيَةٍ لاَ تَجِبُ فِيهَا الصَّدَقَةُ مِنْ إِبِلٍ أَوْ بَقَرٍ أَوْ غَنَمٍ فَلَيْسَ يُعَدُّ ذَلِكَ نِصَابَ مَالٍ حَتَّى يَكُونَ فِي كُلِّ صِنْفٍ مِنْهَا مَا تَجِبُ فِيهِ الصَّدَقَةُ فَذَلِكَ النِّصَابُ الَّذِي يُصَدِّقُ مَعَهُ مَا أَفَادَ إِلَيْهِ صَاحِبُهُ مِنْ قَلِيلٍ أَوْ كَثِيرٍ مِنَ الْمَاشِيَةِ ‏.‏ قَالَ مَالِكٌ وَلَوْ كَانَتْ لِرَجُلٍ إِبِلٌ أَوْ بَقَرٌ أَوْ غَنَمٌ تَجِبُ فِي كُلِّ صِنْفٍ مِنْهَا الصَّدَقَةُ ثُمَّ أَفَادَ إِلَيْهَا بَعِيرًا أَوْ بَقَرَةً أَوْ شَاةً صَدَّقَهَا مَعَ مَاشِيَتِهِ حِينَ يُصَدِّقُهَا ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ وَهَذَا أَحَبُّ مَا سَمِعْتُ إِلَىَّ فِي هَذَا ‏.‏ قَالَ مَالِكٌ فِي الْفَرِيضَةِ تَجِبُ عَلَى الرَّجُلِ فَلاَ تُوجَدُ عِنْدَهُ أَنَّهَا إِنْ كَانَتِ ابْنَةَ مَخَاضٍ فَلَمْ تُوجَدْ أُخِذَ مَكَانَهَا ابْنُ لَبُونٍ ذَكَرٌ وَإِنْ كَانَتْ بِنْتَ لَبُونٍ أَوْ حِقَّةً أَوْ جَذَعَةً وَلَمْ يَكُنْ عِنْدَهُ كَانَ عَلَى رَبِّ الإِبِلِ أَنْ يَبْتَاعَهَا لَهُ حَتَّى يَأْتِيَهُ بِهَا وَلاَ أُحِبُّ أَنْ يُعْطِيَهُ قِيمَتَهَا ‏.‏ وَقَالَ مَالِكٌ فِي الإِبِلِ النَّوَاضِحِ وَالْبَقَرِ السَّوَانِي وَبَقَرِ الْحَرْثِ إِنِّي أَرَى أَنْ يُؤْخَذَ مِنْ ذَلِكَ كُلِّهِ إِذَا وَجَبَتْ فِيهِ الصَّدَقَةُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 600
			}
		}
	]
}