{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"18": "Fasting"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 641,
			"arabicnumber": 641,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ أَنَّهُ سَمِعَ أَبَا بَكْرِ بْنَ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، يَقُولُ كُنْتُ أَنَا وَأَبِي، عِنْدَ مَرْوَانَ بْنِ الْحَكَمِ - وَهُوَ أَمِيرُ الْمَدِينَةِ - فَذُكِرَ لَهُ أَنَّ أَبَا هُرَيْرَةَ يَقُولُ مَنْ أَصْبَحَ جُنُبًا أَفْطَرَ ذَلِكَ الْيَوْمَ ‏.‏ فَقَالَ مَرْوَانُ أَقْسَمْتُ عَلَيْكَ يَا عَبْدَ الرَّحْمَنِ لَتَذْهَبَنَّ إِلَى أُمَّىِ الْمُؤْمِنِينَ عَائِشَةَ وَأُمِّ سَلَمَةَ فَلَتَسْأَلَنَّهُمَا عَنْ ذَلِكَ فَذَهَبَ عَبْدُ الرَّحْمَنِ وَذَهَبْتُ مَعَهُ حَتَّى دَخَلْنَا عَلَى عَائِشَةَ فَسَلَّمَ عَلَيْهَا ثُمَّ قَالَ يَا أُمَّ الْمُؤْمِنِينَ إِنَّا كُنَّا عِنْدَ مَرْوَانَ بْنِ الْحَكَمِ فَذُكِرَ لَهُ أَنَّ أَبَا هُرَيْرَةَ يَقُولُ مَنْ أَصْبَحَ جُنُبًا أَفْطَرَ ذَلِكَ الْيَوْمَ ‏.‏ قَالَتْ عَائِشَةُ لَيْسَ كَمَا قَالَ أَبُو هُرَيْرَةَ يَا عَبْدَ الرَّحْمَنِ أَتَرْغَبُ عَمَّا كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصْنَعُ فَقَالَ عَبْدُ الرَّحْمَنِ لاَ وَاللَّهِ ‏.‏ قَالَتْ عَائِشَةُ فَأَشْهَدُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ كَانَ يُصْبِحُ جُنُبًا مِنْ جِمَاعٍ غَيْرِ احْتِلاَمٍ ثُمَّ يَصُومُ ذَلِكَ الْيَوْمَ ‏.‏ قَالَ ثُمَّ خَرَجْنَا حَتَّى دَخَلْنَا عَلَى أُمِّ سَلَمَةَ فَسَأَلَهَا عَنْ ذَلِكَ فَقَالَتْ مِثْلَ مَا قَالَتْ عَائِشَةُ ‏.‏ قَالَ فَخَرَجْنَا حَتَّى جِئْنَا مَرْوَانَ بْنَ الْحَكَمِ فَذَكَرَ لَهُ عَبْدُ الرَّحْمَنِ مَا قَالَتَا فَقَالَ مَرْوَانُ أَقْسَمْتُ عَلَيْكَ يَا أَبَا مُحَمَّدٍ لَتَرْكَبَنَّ دَابَّتِي فَإِنَّهَا بِالْبَابِ فَلْتَذْهَبَنَّ إِلَى أَبِي هُرَيْرَةَ فَإِنَّهُ بِأَرْضِهِ بِالْعَقِيقِ فَلْتُخْبِرَنَّهُ ذَلِكَ ‏.‏ فَرَكِبَ عَبْدُ الرَّحْمَنِ وَرَكِبْتُ مَعَهُ حَتَّى أَتَيْنَا أَبَا هُرَيْرَةَ فَتَحَدَّثَ مَعَهُ عَبْدُ الرَّحْمَنِ سَاعَةً ثُمَّ ذَكَرَ لَهُ ذَلِكَ فَقَالَ لَهُ أَبُو هُرَيْرَةَ لاَ عِلْمَ لِي بِذَاكَ إِنَّمَا أَخْبَرَنِيهِ مُخْبِرٌ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 641
			}
		}
	]
}