{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"19": "I'tikaf in Ramadan"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 692,
			"arabicnumber": 692,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ سَأَلَ ابْنَ شِهَابٍ عَنِ الرَّجُلِ، يَعْتَكِفُ هَلْ يَدْخُلُ لِحَاجَتِهِ تَحْتَ سَقْفٍ فَقَالَ نَعَمْ لاَ بَأْسَ بِذَلِكَ ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا الَّذِي لاَ اخْتِلاَفَ فِيهِ أَنَّهُ لاَ يُكْرَهُ الاِعْتِكَافُ فِي كُلِّ مَسْجِدٍ يُجَمَّعُ فِيهِ وَلاَ أُرَاهُ كُرِهَ الاِعْتِكَافُ فِي الْمَسَاجِدِ الَّتِي لاَ يُجَمَّعُ فِيهَا إِلاَّ كَرَاهِيَةَ أَنْ يَخْرُجَ الْمُعْتَكِفُ مِنْ مَسْجِدِهِ الَّذِي اعْتَكَفَ فِيهِ إِلَى الْجُمُعَةِ أَوْ يَدَعَهَا فَإِنْ كَانَ مَسْجِدًا لاَ يُجَمَّعُ فِيهِ الْجُمُعَةُ وَلاَ يَجِبُ عَلَى صَاحِبِهِ إِتْيَانُ الْجُمُعَةِ فِي مَسْجِدٍ سِوَاهُ فَإِنِّي لاَ أَرَى بَأْسًا بِالاِعْتِكَافِ فِيهِ لأَنَّ اللَّهَ تَبَارَكَ وَتَعَالَى قَالَ ‏{‏وَأَنْتُمْ عَاكِفُونَ فِي الْمَسَاجِدِ‏}‏ فَعَمَّ اللَّهُ الْمَسَاجِدَ كُلَّهَا وَلَمْ يَخُصَّ شَيْئًا مِنْهَا ‏.‏ قَالَ مَالِكٌ فَمِنْ هُنَالِكَ جَازَ لَهُ أَنْ يَعْتَكِفَ فِي الْمَسَاجِدِ الَّتِي لاَ يُجَمَّعُ فِيهَا الْجُمُعَةُ إِذَا كَانَ لاَ يَجِبُ عَلَيْهِ أَنْ يَخْرُجَ مِنْهُ إِلَى الْمَسْجِدِ الَّذِي تُجَمَّعُ فِيهِ الْجُمُعَةُ ‏.‏ قَالَ مَالِكٌ وَلاَ يَبِيتُ الْمُعْتَكِفُ إِلاَّ فِي الْمَسْجِدِ الَّذِي اعْتَكَفَ فِيهِ إِلاَّ أَنْ يَكُونَ خِبَاؤُهُ فِي رَحَبَةٍ مِنْ رِحَابِ الْمَسْجِدِ وَلَمْ أَسْمَعْ أَنَّ الْمُعْتَكِفَ يَضْرِبُ بِنَاءً يَبِيتُ فِيهِ إِلاَّ فِي الْمَسْجِدِ أَوْ فِي رَحَبَةٍ مِنْ رِحَابِ الْمَسْجِدِ وَمِمَّا يَدُلُّ عَلَى أَنَّهُ لاَ يَبِيتُ إِلاَّ فِي الْمَسْجِدِ قَوْلُ عَائِشَةَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا اعْتَكَفَ لاَ يَدْخُلُ الْبَيْتَ إِلاَّ لِحَاجَةِ الإِنْسَانِ ‏.‏ وَلاَ يَعْتَكِفُ فَوْقَ ظَهْرِ الْمَسْجِدِ وَلاَ فِي الْمَنَارِ يَعْنِي الصَّوْمَعَةَ ‏.‏ وَقَالَ مَالِكٌ يَدْخُلُ الْمُعْتَكِفُ الْمَكَانَ الَّذِي يُرِيدُ أَنْ يَعْتَكِفَ فِيهِ قَبْلَ غُرُوبِ الشَّمْسِ مِنَ اللَّيْلَةِ الَّتِي يُرِيدُ أَنْ يَعْتَكِفَ فِيهَا حَتَّى يَسْتَقْبِلَ بِاعْتِكَافِهِ أَوَّلَ اللَّيْلَةِ الَّتِي يُرِيدُ أَنْ يَعْتَكِفَ فِيهَا وَالْمُعْتَكِفُ مُشْتَغِلٌ بِاعْتِكَافِهِ لاَ يَعْرِضُ لِغَيْرِهِ مِمَّا يَشْتَغِلُ بِهِ مِنَ التِّجَارَاتِ أَوْ غَيْرِهَا وَلاَ بَأْسَ بِأَنْ يَأْمُرَ الْمُعْتَكِفُ بِبَعْضِ حَاجَتِهِ بِضَيْعَتِهِ وَمَصْلَحَةِ أَهْلِهِ وَأَنْ يَأْمُرَ بِبَيْعِ مَالِهِ أَوْ بِشَىْءٍ لاَ يَشْغَلُهُ فِي نَفْسِهِ فَلاَ بَأْسَ بِذَلِكَ إِذَا كَانَ خَفِيفًا أَنْ يَأْمُرَ بِذَلِكَ مَنْ يَكْفِيهِ إِيَّاهُ ‏.‏ قَالَ مَالِكٌ لَمْ أَسْمَعْ أَحَدًا مِنْ أَهْلِ الْعِلْمِ يَذْكُرُ فِي الاِعْتِكَافِ شَرْطًا وَإِنَّمَا الاِعْتِكَافُ عَمَلٌ مِنَ الأَعْمَالِ مِثْلُ الصَّلاَةِ وَالصِّيَامِ وَالْحَجِّ وَمَا أَشْبَهَ ذَلِكَ مِنَ الأَعْمَالِ مَا كَانَ مِنْ ذَلِكَ فَرِيضَةً أَوْ نَافِلَةً فَمَنْ دَخَلَ فِي شَىْءٍ مِنْ ذَلِكَ فَإِنَّمَا يَعْمَلُ بِمَا مَضَى مِنَ السُّنَّةِ وَلَيْسَ لَهُ أَنْ يُحْدِثَ فِي ذَلِكَ غَيْرَ مَا مَضَى عَلَيْهِ الْمُسْلِمُونَ لاَ مِنْ شَرْطٍ يَشْتَرِطُهُ وَلاَ يَبْتَدِعُهُ وَقَدِ اعْتَكَفَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَعَرَفَ الْمُسْلِمُونَ سُنَّةَ الاِعْتِكَافِ ‏.‏ قَالَ مَالِكٌ وَالاِعْتِكَافَ وَالْجِوَارُ سَوَاءٌ وَالاِعْتِكَافُ لِلْقَرَوِيِّ وَالْبَدَوِيِّ سَوَاءٌ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 692
			}
		}
	]
}