{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"20": "Hajj"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 804,
			"arabicnumber": 804,
			"text": "وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، أَنَّ مَعْبَدَ بْنَ حُزَابَةَ الْمَخْزُومِيَّ، صُرِعَ بِبَعْضِ طَرِيقِ مَكَّةَ وَهُوَ مُحْرِمٌ فَسَأَلَ مَنْ يَلِي عَلَى الْمَاءِ الَّذِي كَانَ عَلَيْهِ فَوَجَدَ عَبْدَ اللَّهِ بْنَ عُمَرَ وَعَبْدَ اللَّهِ بْنَ الزُّبَيْرِ وَمَرْوَانَ بْنَ الْحَكَمِ فَذَكَرَ لَهُمُ الَّذِي عَرَضَ لَهُ فَكُلُّهُمْ أَمَرَهُ أَنْ يَتَدَاوَى بِمَا لاَ بُدَّ لَهُ مِنْهُ وَيَفْتَدِيَ فَإِذَا صَحَّ اعْتَمَرَ فَحَلَّ مِنْ إِحْرَامِهِ ثُمَّ عَلَيْهِ حَجُّ قَابِلٍ وَيُهْدِي مَا اسْتَيْسَرَ مِنَ الْهَدْىِ ‏.‏ قَالَ مَالِكٌ وَعَلَى هَذَا الأَمْرُ عِنْدَنَا فِيمَنْ أُحْصِرَ بِغَيْرِ عَدُوٍّ وَقَدْ أَمَرَ عُمَرُ بْنُ الْخَطَّابِ أَبَا أَيُّوبَ الأَنْصَارِيَّ وَهَبَّارَ بْنَ الأَسْوَدِ حِينَ فَاتَهُمَا الْحَجُّ وَأَتَيَا يَوْمَ النَّحْرِ أَنْ يَحِلاَّ بِعُمْرَةٍ ثُمَّ يَرْجِعَا حَلاَلاً ثُمَّ يَحُجَّانِ عَامًا قَابِلاً وَيُهْدِيَانِ فَمَنْ لَمْ يَجِدْ فَصِيَامُ ثَلاَثَةِ أَيَّامٍ فِي الْحَجِّ وَسَبْعَةٍ إِذَا رَجَعَ إِلَى أَهْلِهِ ‏.‏ قَالَ مَالِكٌ وَكُلُّ مَنْ حُبِسَ عَنِ الْحَجِّ بَعْدَ مَا يُحْرِمُ إِمَّا بِمَرَضٍ أَوْ بِغَيْرِهِ أَوْ بِخَطَإٍ مِنَ الْعَدَدِ أَوْ خَفِيَ عَلَيْهِ الْهِلاَلُ فَهُوَ مُحْصَرٌ عَلَيْهِ مَا عَلَى الْمُحْصَرِ ‏.‏ قَالَ يَحْيَى سُئِلَ مَالِكٌ عَمَّنْ أَهَلَّ مِنْ أَهْلِ مَكَّةَ بِالْحَجِّ ثُمَّ أَصَابَهُ كَسْرٌ أَوْ بَطْنٌ مُتَحَرِّقٌ أَوِ امْرَأَةٌ تَطْلُقُ ‏.‏ قَالَ مَنْ أَصَابَهُ هَذَا مِنْهُمْ فَهُوَ مُحْصَرٌ يَكُونُ عَلَيْهِ مِثْلُ مَا عَلَى أَهْلِ الآفَاقِ إِذَا هُمْ أُحْصِرُوا ‏.‏ قَالَ مَالِكٌ فِي رَجُلٍ قَدِمَ مُعْتَمِرًا فِي أَشْهُرِ الْحَجِّ حَتَّى إِذَا قَضَى عُمْرَتَهُ أَهَلَّ بِالْحَجِّ مِنْ مَكَّةَ ثُمَّ كُسِرَ أَوْ أَصَابَهُ أَمْرٌ لاَ يَقْدِرُ عَلَى أَنْ يَحْضُرَ مَعَ النَّاسِ الْمَوْقِفَ ‏.‏ قَالَ مَالِكٌ أَرَى أَنْ يُقِيمَ حَتَّى إِذَا بَرَأَ خَرَجَ إِلَى الْحِلِّ ثُمَّ يَرْجِعُ إِلَى مَكَّةَ فَيَطُوفُ بِالْبَيْتِ وَيَسْعَى بَيْنَ الصَّفَا وَالْمَرْوَةِ ثُمَّ يَحِلُّ ثُمَّ عَلَيْهِ حَجُّ قَابِلٍ وَالْهَدْىُ ‏.‏ قَالَ مَالِكٌ فِيمَنْ أَهَلَّ بِالْحَجِّ مِنْ مَكَّةَ ثُمَّ طَافَ بِالْبَيْتِ وَسَعَى بَيْنَ الصَّفَا وَالْمَرْوَةِ ثُمَّ مَرِضَ فَلَمْ يَسْتَطِعْ أَنْ يَحْضُرَ مَعَ النَّاسِ الْمَوْقِفَ ‏.‏ قَالَ مَالِكٌ إِذَا فَاتَهُ الْحَجُّ فَإِنِ اسْتَطَاعَ خَرَجَ إِلَى الْحِلِّ فَدَخَلَ بِعُمْرَةٍ فَطَافَ بِالْبَيْتِ وَسَعَى بَيْنَ الصَّفَا وَالْمَرْوَةِ لأَنَّ الطَّوَافَ الأَوَّلَ لَمْ يَكُنْ نَوَاهُ لِلْعُمْرَةِ فَلِذَلِكَ يَعْمَلُ بِهَذَا وَعَلَيْهِ حَجُّ قَابِلٍ وَالْهَدْىُ ‏.‏ فَإِنْ كَانَ مِنْ غَيْرِ أَهْلِ مَكَّةَ فَأَصَابَهُ مَرَضٌ حَالَ بَيْنَهُ وَبَيْنَ الْحَجِّ فَطَافَ بِالْبَيْتِ وَسَعَى بَيْنَ الصَّفَا وَالْمَرْوَةِ حَلَّ بِعُمْرَةٍ وَطَافَ بِالْبَيْتِ طَوَافًا آخَرَ وَسَعَى بَيْنَ الصَّفَا وَالْمَرْوَةِ لأَنَّ طَوَافَهُ الأَوَّلَ وَسَعْيَهُ إِنَّمَا كَانَ نَوَاهُ لِلْحَجِّ وَعَلَيْهِ حَجُّ قَابِلٍ وَالْهَدْىُ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 804
			}
		}
	]
}