{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"10": "The Book of Leading the Prayer (Al-Imamah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 777,
			"arabicnumber": 777,
			"text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَهَنَّادُ بْنُ السَّرِيِّ، عَنْ حُسَيْنِ بْنِ عَلِيٍّ، عَنْ زَائِدَةَ، عَنْ عَاصِمٍ، عَنْ زِرٍّ، عَنْ عَبْدِ اللَّهِ، قَالَ لَمَّا قُبِضَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَتِ الأَنْصَارُ مِنَّا أَمِيرٌ وَمِنْكُمْ أَمِيرٌ ‏.‏ فَأَتَاهُمْ عُمَرُ فَقَالَ أَلَسْتُمْ تَعْلَمُونَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ أَمَرَ أَبَا بَكْرٍ أَنْ يُصَلِّيَ بِالنَّاسِ فَأَيُّكُمْ تَطِيبُ نَفْسُهُ أَنْ يَتَقَدَّمَ أَبَا بَكْرٍ قَالُوا نَعُوذُ بِاللَّهِ أَنْ نَتَقَدَّمَ أَبَا بَكْرٍ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 778,
			"arabicnumber": 778,
			"text": "أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، قَالَ حَدَّثَنَا أَيُّوبُ، عَنْ أَبِي الْعَالِيَةِ الْبَرَّاءِ، قَالَ أَخَّرَ زِيَادٌ الصَّلاَةَ فَأَتَانِي ابْنُ صَامِتٍ فَأَلْقَيْتُ لَهُ كُرْسِيًّا فَجَلَسَ عَلَيْهِ فَذَكَرْتُ لَهُ صُنْعَ زِيَادٍ فَعَضَّ عَلَى شَفَتَيْهِ وَضَرَبَ عَلَى فَخِذِي وَقَالَ إِنِّي سَأَلْتُ أَبَا ذَرٍّ كَمَا سَأَلْتَنِي فَضَرَبَ فَخِذِي كَمَا ضَرَبْتُ فَخِذَكَ وَقَالَ إِنِّي سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم كَمَا سَأَلْتَنِي فَضَرَبَ فَخِذِي كَمَا ضَرَبْتُ فَخِذَكَ فَقَالَ عَلَيْهِ الصَّلاَةُ وَالسَّلاَمُ ‏ \"‏ صَلِّ الصَّلاَةَ لِوَقْتِهَا فَإِنْ أَدْرَكْتَ مَعَهُمْ فَصَلِّ وَلاَ تَقُلْ إِنِّي صَلَّيْتُ فَلاَ أُصَلِّي ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 779,
			"arabicnumber": 779,
			"text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ، عَنْ عَاصِمٍ، عَنْ زِرٍّ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لَعَلَّكُمْ سَتُدْرِكُونَ أَقْوَامًا يُصَلُّونَ الصَّلاَةَ لِغَيْرِ وَقْتِهَا فَإِنْ أَدْرَكْتُمُوهُمْ فَصَلُّوا الصَّلاَةَ لِوَقْتِهَا وَصَلُّوا مَعَهُمْ وَاجْعَلُوهَا سُبْحَةً ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 780,
			"arabicnumber": 780,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ أَنْبَأَنَا فُضَيْلُ بْنُ عِيَاضٍ، عَنِ الأَعْمَشِ، عَنْ إِسْمَاعِيلَ بْنِ رَجَاءٍ، عَنْ أَوْسِ بْنِ ضَمْعَجٍ، عَنْ أَبِي مَسْعُودٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ يَؤُمُّ الْقَوْمَ أَقْرَؤُهُمْ لِكِتَابِ اللَّهِ فَإِنْ كَانُوا فِي الْقِرَاءَةِ سَوَاءً فَأَقْدَمُهُمْ فِي الْهِجْرَةِ فَإِنْ كَانُوا فِي الْهِجْرَةِ سَوَاءً فَأَعْلَمُهُمْ بِالسُّنَّةِ فَإِنْ كَانُوا فِي السُّنَّةِ سَوَاءً فَأَقْدَمُهُمْ سِنًّا وَلاَ تَؤُمَّ الرَّجُلَ فِي سُلْطَانِهِ وَلاَ تَقْعُدْ عَلَى تَكْرِمَتِهِ إِلاَّ أَنْ يَأْذَنَ لَكَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 781,
			"arabicnumber": 781,
			"text": "أَخْبَرَنَا حَاجِبُ بْنُ سُلَيْمَانَ الْمَنْبِجِيُّ، عَنْ وَكِيعٍ، عَنْ سُفْيَانَ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ أَبِي قِلاَبَةَ، عَنْ مَالِكِ بْنِ الْحُوَيْرِثِ، قَالَ أَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم أَنَا وَابْنُ عَمٍّ لِي - وَقَالَ مَرَّةً أَنَا وَصَاحِبٌ لِي - فَقَالَ ‏ \"‏ إِذَا سَافَرْتُمَا فَأَذِّنَا وَأَقِيمَا وَلْيَؤُمَّكُمَا أَكْبَرُكُمَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 782,
			"arabicnumber": 782,
			"text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، عَنْ يَحْيَى، عَنْ هِشَامٍ، قَالَ حَدَّثَنَا قَتَادَةُ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا كَانُوا ثَلاَثَةً فَلْيَؤُمَّهُمْ أَحَدُهُمْ وَأَحَقُّهُمْ بِالإِمَامَةِ أَقْرَؤُهُمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 783,
			"arabicnumber": 783,
			"text": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ مُحَمَّدٍ التَّيْمِيُّ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ شُعْبَةَ، عَنْ إِسْمَاعِيلَ بْنِ رَجَاءٍ، عَنْ أَوْسِ بْنِ ضَمْعَجٍ، عَنْ أَبِي مَسْعُودٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ يُؤَمُّ الرَّجُلُ فِي سُلْطَانِهِ وَلاَ يُجْلَسُ عَلَى تَكْرِمَتِهِ إِلاَّ بِإِذْنِهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 784,
			"arabicnumber": 784,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا يَعْقُوبُ، - وَهُوَ ابْنُ عَبْدِ الرَّحْمَنِ - عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَلَغَهُ أَنَّ بَنِي عَمْرِو بْنِ عَوْفٍ كَانَ بَيْنَهُمْ شَىْءٌ فَخَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِيُصْلِحَ بَيْنَهُمْ فِي أُنَاسٍ مَعَهُ فَحُبِسَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَحَانَتِ الأُولَى فَجَاءَ بِلاَلٌ إِلَى أَبِي بَكْرٍ فَقَالَ يَا أَبَا بَكْرٍ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ حُبِسَ وَقَدْ حَانَتِ الصَّلاَةُ فَهَلْ لَكَ أَنْ تَؤُمَّ النَّاسَ قَالَ نَعَمْ إِنْ شِئْتَ ‏.‏ فَأَقَامَ بِلاَلٌ وَتَقَدَّمَ أَبُو بَكْرٍ فَكَبَّرَ بِالنَّاسِ وَجَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَمْشِي فِي الصُّفُوفِ حَتَّى قَامَ فِي الصَّفِّ وَأَخَذَ النَّاسُ فِي التَّصْفِيقِ وَكَانَ أَبُو بَكْرٍ لاَ يَلْتَفِتُ فِي صَلاَتِهِ فَلَمَّا أَكْثَرَ النَّاسُ الْتَفَتَ فَإِذَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَشَارَ إِلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم يَأْمُرُهُ أَنْ يُصَلِّيَ فَرَفَعَ أَبُو بَكْرٍ يَدَيْهِ فَحَمِدَ اللَّهَ عَزَّ وَجَلَّ وَرَجَعَ الْقَهْقَرَى وَرَاءَهُ حَتَّى قَامَ فِي الصَّفِّ فَتَقَدَّمَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَصَلَّى بِالنَّاسِ فَلَمَّا فَرَغَ أَقْبَلَ عَلَى النَّاسِ فَقَالَ ‏ \"‏ يَا أَيُّهَا النَّاسُ مَا لَكُمْ حِينَ نَابَكُمْ شَىْءٌ فِي الصَّلاَةِ أَخَذْتُمْ فِي التَّصْفِيقِ إِنَّمَا التَّصْفِيقُ لِلنِّسَاءِ مَنْ نَابَهُ شَىْءٌ فِي صَلاَتِهِ فَلْيَقُلْ سُبْحَانَ اللَّهِ فَإِنَّهُ لاَ يَسْمَعُهُ أَحَدٌ حِينَ يَقُولُ سُبْحَانَ اللَّهِ إِلاَّ الْتَفَتَ إِلَيْهِ يَا أَبَا بَكْرٍ مَا مَنَعَكَ أَنْ تُصَلِّيَ لِلنَّاسِ حِينَ أَشَرْتُ إِلَيْكَ ‏\"‏ ‏.‏ قَالَ أَبُو بَكْرٍ مَا كَانَ يَنْبَغِي لاِبْنِ أَبِي قُحَافَةَ أَنْ يُصَلِّيَ بَيْنَ يَدَىْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 785,
			"arabicnumber": 785,
			"text": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنَا حُمَيْدٌ، عَنْ أَنَسٍ، قَالَ آخِرُ صَلاَةٍ صَلاَّهَا رَسُولُ اللَّهِ صلى الله عليه وسلم مَعَ الْقَوْمِ صَلَّى فِي ثَوْبٍ وَاحِدٍ مُتَوَشِّحًا خَلْفَ أَبِي بَكْرٍ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 786,
			"arabicnumber": 786,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا بَكْرُ بْنُ عِيسَى، - صَاحِبُ الْبُصْرَى - قَالَ سَمِعْتُ شُعْبَةَ، يَذْكُرُ عَنْ نُعَيْمِ بْنِ أَبِي هِنْدٍ، عَنْ أَبِي وَائِلٍ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، رضى الله عنها أَنَّ أَبَا بَكْرٍ، صَلَّى لِلنَّاسِ وَرَسُولُ اللَّهِ صلى الله عليه وسلم فِي الصَّفِّ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 787,
			"arabicnumber": 787,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ أَبَانَ بْنِ يَزِيدَ، قَالَ حَدَّثَنَا بُدَيْلُ بْنُ مَيْسَرَةَ، قَالَ حَدَّثَنَا أَبُو عَطِيَّةَ، مَوْلًى لَنَا عَنْ مَالِكِ بْنِ الْحُوَيْرِثِ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِذَا زَارَ أَحَدُكُمْ قَوْمًا فَلاَ يُصَلِّيَنَّ بِهِمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 788,
			"arabicnumber": 788,
			"text": "أَخْبَرَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا مَعْنٌ، قَالَ حَدَّثَنَا مَالِكٌ، ح قَالَ وَحَدَّثَنَا الْحَارِثُ بْنُ مِسْكِينٍ، قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، - وَاللَّفْظُ لَهُ - عَنِ ابْنِ الْقَاسِمِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ مَحْمُودِ بْنِ الرَّبِيعِ، ‏.‏ أَنَّ عِتْبَانَ بْنَ مَالِكٍ، كَانَ يَؤُمُّ قَوْمَهُ وَهُوَ أَعْمَى وَأَنَّهُ قَالَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم إِنَّهَا تَكُونُ الظُّلْمَةُ وَالْمَطَرُ وَالسَّيْلُ وَأَنَا رَجُلٌ ضَرِيرُ الْبَصَرِ فَصَلِّ يَا رَسُولَ اللَّهِ فِي بَيْتِي مَكَانًا أَتَّخِذُهُ مُصَلًّى ‏.‏ فَجَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏ \"‏ أَيْنَ تُحِبُّ أَنْ أُصَلِّيَ لَكَ ‏\"‏ ‏.‏ فَأَشَارَ إِلَى مَكَانٍ مِنَ الْبَيْتِ فَصَلَّى فِيهِ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 789,
			"arabicnumber": 789,
			"text": "أَخْبَرَنَا مُوسَى بْنُ عَبْدِ الرَّحْمَنِ الْمَسْرُوقِيُّ، حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ، عَنْ زَائِدَةَ، عَنْ سُفْيَانَ، عَنْ أَيُّوبَ، قَالَ حَدَّثَنِي عَمْرُو بْنُ سَلِمَةَ الْجَرْمِيُّ، قَالَ كَانَ يَمُرُّ عَلَيْنَا الرُّكْبَانُ فَنَتَعَلَّمُ مِنْهُمُ الْقُرْآنَ فَأَتَى أَبِي النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏\"‏ لِيَؤُمَّكُمْ أَكْثَرُكُمْ قُرْآنًا ‏\"‏ ‏.‏ فَجَاءَ أَبِي فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لِيَؤُمَّكُمْ أَكْثَرُكُمْ قُرْآنًا ‏\"‏ ‏.‏ فَنَظَرُوا فَكُنْتُ أَكْثَرَهُمْ قُرْآنًا فَكُنْتُ أَؤُمُّهُمْ وَأَنَا ابْنُ ثَمَانِ سِنِينَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 790,
			"arabicnumber": 790,
			"text": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ حَدَّثَنَا هُشَيْمٌ، عَنْ هِشَامِ بْنِ أَبِي عَبْدِ اللَّهِ، وَحَجَّاجُ بْنُ أَبِي عُثْمَانَ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا نُودِيَ لِلصَّلاَةِ فَلاَ تَقُومُوا حَتَّى تَرَوْنِي ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 791,
			"arabicnumber": 791,
			"text": "أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنْ أَنَسٍ، قَالَ أُقِيمَتِ الصَّلاَةُ وَرَسُولُ اللَّهِ صلى الله عليه وسلم نَجِيٌّ لِرَجُلٍ فَمَا قَامَ إِلَى الصَّلاَةِ حَتَّى نَامَ الْقَوْمُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 792,
			"arabicnumber": 792,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدِ بْنِ كَثِيرٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ، عَنِ الزُّبَيْدِيِّ، عَنِ الزُّهْرِيِّ، وَالْوَلِيدُ، عَنِ الأَوْزَاعِيِّ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ أُقِيمَتِ الصَّلاَةُ فَصَفَّ النَّاسُ صُفُوفَهُمْ وَخَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى إِذَا قَامَ فِي مُصَلاَّهُ ذَكَرَ أَنَّهُ لَمْ يَغْتَسِلْ فَقَالَ لِلنَّاسِ ‏ \"‏ مَكَانَكُمْ ‏\"‏ ‏.‏ ثُمَّ رَجَعَ إِلَى بَيْتِهِ فَخَرَجَ عَلَيْنَا يَنْطِفُ رَأْسُهُ فَاغْتَسَلَ وَنَحْنُ صُفُوفٌ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 793,
			"arabicnumber": 793,
			"text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدَةَ، عَنْ حَمَّادِ بْنِ زَيْدٍ، ثُمَّ ذَكَرَ كَلِمَةً مَعْنَاهَا قَالَ حَدَّثَنَا أَبُو حَازِمٍ، قَالَ سَهْلُ بْنُ سَعْدٍ كَانَ قِتَالٌ بَيْنَ بَنِي عَمْرِو بْنِ عَوْفٍ فَبَلَغَ ذَلِكَ النَّبِيَّ صلى الله عليه وسلم فَصَلَّى الظُّهْرَ ثُمَّ أَتَاهُمْ لِيُصْلِحَ بَيْنَهُمْ ثُمَّ قَالَ لِبِلاَلٍ ‏\"‏ يَا بِلاَلُ إِذَا حَضَرَ الْعَصْرُ وَلَمْ آتِ فَمُرْ أَبَا بَكْرٍ فَلْيُصَلِّ بِالنَّاسِ ‏\"‏ ‏.‏ فَلَمَّا حَضَرَتْ أَذَّنَ بِلاَلٌ ثُمَّ أَقَامَ فَقَالَ لأَبِي بَكْرٍ رضى الله عنه تَقَدَّمْ ‏.‏ فَتَقَدَّمَ أَبُو بَكْرٍ فَدَخَلَ فِي الصَّلاَةِ ثُمَّ جَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَجَعَلَ يَشُقُّ النَّاسَ حَتَّى قَامَ خَلْفَ أَبِي بَكْرٍ وَصَفَّحَ الْقَوْمُ وَكَانَ أَبُو بَكْرٍ إِذَا دَخَلَ فِي الصَّلاَةِ لَمْ يَلْتَفِتْ فَلَمَّا رَأَى أَبُو بَكْرٍ التَّصْفِيحَ لاَ يُمْسَكُ عَنْهُ الْتَفَتَ فَأَوْمَأَ إِلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم بِيَدِهِ فَحَمِدَ اللَّهَ عَزَّ وَجَلَّ عَلَى قَوْلِ رَسُولِ اللَّهِ صلى الله عليه وسلم لَهُ امْضِهْ ثُمَّ مَشَى أَبُو بَكْرٍ الْقَهْقَرَى عَلَى عَقِبَيْهِ فَتَأَخَّرَ فَلَمَّا رَأَى ذَلِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم تَقَدَّمَ فَصَلَّى بِالنَّاسِ فَلَمَّا قَضَى صَلاَتَهُ قَالَ ‏\"‏ يَا أَبَا بَكْرٍ مَا مَنَعَكَ إِذْ أَوْمَأْتُ إِلَيْكَ أَنْ لاَ تَكُونَ مَضَيْتَ ‏\"‏ ‏.‏ فَقَالَ لَمْ يَكُنْ لاِبْنِ أَبِي قُحَافَةَ أَنْ يَؤُمَّ رَسُولَ اللَّهِ صلى الله عليه وسلم ‏.‏ وَقَالَ لِلنَّاسِ ‏\"‏ إِذَا نَابَكُمْ شَىْءٌ فَلْيُسَبِّحِ الرِّجَالُ وَلْيُصَفِّحِ النِّسَاءُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 794,
			"arabicnumber": 794,
			"text": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ، عَنِ ابْنِ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ أَنَسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم سَقَطَ مِنْ فَرَسٍ عَلَى شِقِّهِ الأَيْمَنِ فَدَخَلُوا عَلَيْهِ يَعُودُونَهُ فَحَضَرَتِ الصَّلاَةُ فَلَمَّا قَضَى الصَّلاَةَ قَالَ ‏ \"‏ إِنَّمَا جُعِلَ الإِمَامُ لِيُؤْتَمَّ بِهِ فَإِذَا رَكَعَ فَارْكَعُوا وَإِذَا رَفَعَ فَارْفَعُوا وَإِذَا سَجَدَ فَاسْجُدُوا وَإِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ فَقُولُوا رَبَّنَا لَكَ الْحَمْدُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 795,
			"arabicnumber": 795,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ جَعْفَرِ بْنِ حَيَّانَ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ النَّبِيَّ صلى الله عليه وسلم رَأَى فِي أَصْحَابِهِ تَأَخُّرًا فَقَالَ ‏ \"‏ تَقَدَّمُوا فَأْتَمُّوا بِي وَلْيَأْتَمَّ بِكُمْ مَنْ بَعْدَكُمْ وَلاَ يَزَالُ قَوْمٌ يَتَأَخَّرُونَ حَتَّى يُؤَخِّرَهُمُ اللَّهُ عَزَّ وَجَلَّ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 796,
			"arabicnumber": 796,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنِ الْجُرَيْرِيِّ، عَنْ أَبِي نَضْرَةَ، نَحْوَهُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 797,
			"arabicnumber": 797,
			"text": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنِي أَبُو دَاوُدَ، قَالَ أَنْبَأَنَا شُعْبَةُ، عَنْ مُوسَى بْنِ أَبِي عَائِشَةَ، قَالَ سَمِعْتُ عُبَيْدَ اللَّهِ بْنَ عَبْدِ اللَّهِ، يُحَدِّثُ عَنْ عَائِشَةَ، رضى الله عنها أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَمَرَ أَبَا بَكْرٍ أَنْ يُصَلِّيَ بِالنَّاسِ قَالَتْ وَكَانَ النَّبِيُّ صلى الله عليه وسلم بَيْنَ يَدَىْ أَبِي بَكْرٍ فَصَلَّى قَاعِدًا وَأَبُو بَكْرٍ يُصَلِّي بِالنَّاسِ وَالنَّاسُ خَلْفَ أَبِي بَكْرٍ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 798,
			"arabicnumber": 798,
			"text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ فَضَالَةَ بْنِ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا يَحْيَى، - يَعْنِي ابْنَ يَحْيَى - قَالَ حَدَّثَنَا حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ حُمَيْدٍ الرُّؤَاسِيُّ، عَنْ أَبِيهِ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ صَلَّى بِنَا رَسُولُ اللَّهِ صلى الله عليه وسلم الظُّهْرَ وَأَبُو بَكْرٍ خَلْفَهُ فَإِذَا كَبَّرَ رَسُولُ اللَّهِ صلى الله عليه وسلم كَبَّرَ أَبُو بَكْرٍ يُسْمِعُنَا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 799,
			"arabicnumber": 799,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عُبَيْدٍ الْكُوفِيُّ، عَنْ مُحَمَّدِ بْنِ فُضَيْلٍ، عَنْ هَارُونَ بْنِ عَنْتَرَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الأَسْوَدِ، عَنِ الأَسْوَدِ، وَعَلْقَمَةَ، قَالاَ دَخَلْنَا عَلَى عَبْدِ اللَّهِ نِصْفَ النَّهَارِ فَقَالَ إِنَّهُ سَيَكُونُ أُمَرَاءُ يَشْتَغِلُونَ عَنْ وَقْتِ الصَّلاَةَ فَصَلُّوا لِوَقْتِهَا ‏.‏ ثُمَّ قَامَ فَصَلَّى بَيْنِي وَبَيْنَهُ فَقَالَ هَكَذَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَعَلَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 800,
			"arabicnumber": 800,
			"text": "أَخْبَرَنَا عَبْدَةُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ، قَالَ حَدَّثَنَا أَفْلَحُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا بُرَيْدَةُ بْنُ سُفْيَانَ بْنِ فَرْوَةَ الأَسْلَمِيُّ، عَنْ غُلاَمٍ، لِجَدِّهِ يُقَالُ لَهُ مَسْعُودٌ فَقَالَ مَرَّ بِي رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَبُو بَكْرٍ فَقَالَ لِي أَبُو بَكْرٍ يَا مَسْعُودُ ائْتِ أَبَا تَمِيمٍ - يَعْنِي مَوْلاَهُ - فَقُلْ لَهُ يَحْمِلْنَا عَلَى بَعِيرٍ وَيَبْعَثْ إِلَيْنَا بِزَادٍ وَدَلِيلٍ يَدُلُّنَا ‏.‏ فَجِئْتُ إِلَى مَوْلاَىَ فَأَخْبَرْتُهُ فَبَعَثَ مَعِي بِبَعِيرٍ وَوَطْبٍ مِنْ لَبَنٍ فَجَعَلْتُ آخُذُ بِهِمْ فِي إِخْفَاءِ الطَّرِيقِ وَحَضَرَتِ الصَّلاَةُ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي وَقَامَ أَبُو بَكْرٍ عَنْ يَمِينِهِ وَقَدْ عَرَفْتُ الإِسْلاَمَ وَأَنَا مَعَهُمَا فَجِئْتُ فَقُمْتُ خَلْفَهُمَا فَدَفَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي صَدْرِ أَبِي بَكْرٍ فَقُمْنَا خَلْفَهُ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ بُرَيْدَةُ هَذَا لَيْسَ بِالْقَوِيِّ فِي الْحَدِيثِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 801,
			"arabicnumber": 801,
			"text": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ جَدَّتَهُ، مُلَيْكَةَ دَعَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم لِطَعَامٍ قَدْ صَنَعَتْهُ لَهُ فَأَكَلَ مِنْهُ ثُمَّ قَالَ ‏ \"‏ قُومُوا فَلأُصَلِّيَ لَكُمْ ‏\"‏ ‏.‏ قَالَ أَنَسٌ فَقُمْتُ إِلَى حَصِيرٍ لَنَا قَدِ اسْوَدَّ مِنْ طُولِ مَا لُبِسَ فَنَضَحْتُهُ بِمَاءٍ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَصَفَفْتُ أَنَا وَالْيَتِيمُ وَرَاءَهُ وَالْعَجُوزُ مِنْ وَرَائِنَا فَصَلَّى لَنَا رَكْعَتَيْنِ ثُمَّ انْصَرَفَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 802,
			"arabicnumber": 802,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ سُلَيْمَانَ بْنِ الْمُغِيرَةِ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، قَالَ دَخَلَ عَلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَمَا هُوَ إِلاَّ أَنَا وَأُمِّي وَالْيَتِيمُ وَأُمُّ حَرَامٍ خَالَتِي فَقَالَ ‏ \"‏ قُومُوا فَلأُصَلِّيَ بِكُمْ ‏\"‏ ‏.‏ قَالَ فِي غَيْرِ وَقْتِ صَلاَةٍ - قَالَ - فَصَلَّى بِنَا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 803,
			"arabicnumber": 803,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا مُحَمَّدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ مُخْتَارٍ، يُحَدِّثُ عَنْ مُوسَى بْنِ أَنَسٍ، عَنْ أَنَسٍ، أَنَّهُ كَانَ هُوَ وَرَسُولُ اللَّهِ صلى الله عليه وسلم وَأُمُّهُ وَخَالَتُهُ فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم فَجَعَلَ أَنَسًا عَنْ يَمِينِهِ وَأُمَّهُ وَخَالَتَهُ خَلْفَهُمَا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 804,
			"arabicnumber": 804,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ بْنِ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا حَجَّاجٌ، قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي زِيَادٌ، أَنَّ قَزَعَةَ، مَوْلًى لِعَبْدِ قَيْسٍ أَخْبَرَهُ أَنَّهُ، سَمِعَ عِكْرِمَةَ، مَوْلَى ابْنِ عَبَّاسٍ قَالَ قَالَ ابْنُ عَبَّاسٍ صَلَّيْتُ إِلَى جَنْبِ النَّبِيِّ صلى الله عليه وسلم وَعَائِشَةُ خَلْفَنَا تُصَلِّي مَعَنَا وَأَنَا إِلَى جَنْبِ النَّبِيِّ صلى الله عليه وسلم أُصَلِّي مَعَهُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 805,
			"arabicnumber": 805,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ اللَّهِ بْنِ الْمُخْتَارِ، عَنْ مُوسَى بْنِ أَنَسٍ، عَنْ أَنَسٍ، قَالَ صَلَّى بِي رَسُولُ اللَّهِ صلى الله عليه وسلم وَبِامْرَأَةٍ مِنْ أَهْلِي فَأَقَامَنِي عَنْ يَمِينِهِ وَالْمَرْأَةُ خَلْفَنَا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 806,
			"arabicnumber": 806,
			"text": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا ابْنُ عُلَيَّةَ، عَنْ أَيُّوبَ، عَنْ عَبْدِ اللَّهِ بْنِ سَعِيدِ بْنِ جُبَيْرٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ بِتُّ عِنْدَ خَالَتِي مَيْمُونَةَ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي مِنَ اللَّيْلِ فَقُمْتُ عَنْ شِمَالِهِ فَقَالَ بِي هَكَذَا فَأَخَذَ بِرَأْسِي فَأَقَامَنِي عَنْ يَمِينِهِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 807,
			"arabicnumber": 807,
			"text": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ، عَنْ أَبِي مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ عُمَارَةَ بْنِ عُمَيْرٍ، عَنْ أَبِي مَعْمَرٍ، عَنْ أَبِي مَسْعُودٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَمْسَحُ مَنَاكِبَنَا فِي الصَّلاَةِ وَيَقُولُ ‏ \"‏ لاَ تَخْتَلِفُوا فَتَخْتَلِفَ قُلُوبُكُمْ لِيَلِيَنِّي مِنْكُمْ أُولُو الأَحْلاَمِ وَالنُّهَى ثُمَّ الَّذِينَ يَلُونَهُمْ ثُمَّ الَّذِينَ يَلُونَهُمْ ‏\"‏ ‏.‏ قَالَ أَبُو مَسْعُودٍ فَأَنْتُمُ الْيَوْمَ أَشَدُّ اخْتِلاَفًا ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ أَبُو مَعْمَرٍ اسْمُهُ عَبْدُ اللَّهِ بْنُ سَخْبَرَةَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 808,
			"arabicnumber": 808,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عُمَرَ بْنِ عَلِيِّ بْنِ مُقَدَّمٍ، قَالَ حَدَّثَنَا يُوسُفُ بْنُ يَعْقُوبَ، قَالَ أَخْبَرَنِي التَّيْمِيُّ، عَنْ أَبِي مِجْلَزٍ، عَنْ قَيْسِ بْنِ عَبَّادٍ، قَالَ بَيْنَا أَنَا فِي الْمَسْجِدِ، فِي الصَّفِّ الْمُقَدَّمِ فَجَبَذَنِي رَجُلٌ مِنْ خَلْفِي جَبْذَةً فَنَحَّانِي وَقَامَ مَقَامِي فَوَاللَّهِ مَا عَقَلْتُ صَلاَتِي فَلَمَّا انْصَرَفَ فَإِذَا هُوَ أُبَىُّ بْنُ كَعْبٍ فَقَالَ يَا فَتَى لاَ يَسُؤْكَ اللَّهُ إِنَّ هَذَا عَهْدٌ مِنَ النَّبِيِّ صلى الله عليه وسلم إِلَيْنَا أَنْ نَلِيَهُ ثُمَّ اسْتَقْبَلَ الْقِبْلَةَ فَقَالَ هَلَكَ أَهْلُ الْعُقَدِ وَرَبِّ الْكَعْبَةِ ثَلاَثًا ثُمَّ قَالَ وَاللَّهِ مَا عَلَيْهِمْ آسَى وَلَكِنْ آسَى عَلَى مَنْ أَضَلُّوا ‏.‏ قُلْتُ يَا أَبَا يَعْقُوبَ مَا يَعْنِي بِأَهْلِ الْعُقَدِ قَالَ الأُمَرَاءُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 809,
			"arabicnumber": 809,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ أُقِيمَتِ الصَّلاَةُ فَقُمْنَا فَعُدِّلَتِ الصُّفُوفُ قَبْلَ أَنْ يَخْرُجَ إِلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَتَانَا رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى إِذَا قَامَ فِي مُصَلاَّهُ قَبْلَ أَنْ يُكَبِّرَ فَانْصَرَفَ فَقَالَ لَنَا ‏ \"‏ مَكَانَكُمْ ‏\"‏ ‏.‏ فَلَمْ نَزَلْ قِيَامًا نَنْتَظِرُهُ حَتَّى خَرَجَ إِلَيْنَا قَدِ اغْتَسَلَ يَنْطِفُ رَأْسُهُ مَاءً فَكَبَّرَ وَصَلَّى ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 810,
			"arabicnumber": 810,
			"text": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ أَنْبَأَنَا أَبُو الأَحْوَصِ، عَنْ سِمَاكٍ، عَنِ النُّعْمَانِ بْنِ بَشِيرٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُقَوِّمُ الصُّفُوفَ كَمَا تُقَوَّمُ الْقِدَاحُ فَأَبْصَرَ رَجُلاً خَارِجًا صَدْرُهُ مِنَ الصَّفِّ فَلَقَدْ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ لَتُقِيمُنَّ صُفُوفَكُمْ أَوْ لَيُخَالِفَنَّ اللَّهُ بَيْنَ وُجُوهِكُمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 811,
			"arabicnumber": 811,
			"text": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ مَنْصُورٍ، عَنْ طَلْحَةَ بْنِ مُصَرِّفٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْسَجَةَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَتَخَلَّلُ الصُّفُوفَ مِنْ نَاحِيَةٍ إِلَى نَاحِيَةٍ يَمْسَحُ مَنَاكِبَنَا وَصُدُورَنَا وَيَقُولُ ‏\"‏ لاَ تَخْتَلِفُوا فَتَخْتَلِفَ قُلُوبُكُمْ ‏\"‏ ‏.‏ وَكَانَ يَقُولُ ‏\"‏ إِنَّ اللَّهَ وَمَلاَئِكَتَهُ يُصَلُّونَ عَلَى الصُّفُوفِ الْمُتَقَدِّمَةِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 812,
			"arabicnumber": 812,
			"text": "أَخْبَرَنَا بِشْرُ بْنُ خَالِدٍ الْعَسْكَرِيُّ، قَالَ حَدَّثَنَا غُنْدَرٌ، عَنْ شُعْبَةَ، عَنْ سُلَيْمَانَ، عَنْ عُمَارَةَ بْنِ عُمَيْرٍ، عَنْ أَبِي مَعْمَرٍ، عَنْ أَبِي مَسْعُودٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَمْسَحُ عَوَاتِقَنَا وَيَقُولُ ‏ \"‏ اسْتَوُوا وَلاَ تَخْتَلِفُوا فَتَخْتَلِفَ قُلُوبُكُمْ وَلْيَلِيَنِّي مِنْكُمْ أُولُو الأَحْلاَمِ وَالنُّهَى ثُمَّ الَّذِينَ يَلُونَهُمْ ثُمَّ الَّذِينَ يَلُونَهُمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 813,
			"arabicnumber": 813,
			"text": "أَخْبَرَنَا أَبُو بَكْرِ بْنُ نَافِعٍ، قَالَ حَدَّثَنَا بَهْزُ بْنُ أَسَدٍ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَقُولُ ‏ \"‏ اسْتَوُوا اسْتَوُوا اسْتَوُوا فَوَالَّذِي نَفْسِي بِيَدِهِ إِنِّي لأَرَاكُمْ مِنْ خَلْفِي كَمَا أَرَاكُمْ مِنْ بَيْنِ يَدَىَّ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 814,
			"arabicnumber": 814,
			"text": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، أَنْبَأَنَا إِسْمَاعِيلُ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، - رضى الله عنه - قَالَ أَقْبَلَ عَلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم بِوَجْهِهِ حِينَ قَامَ إِلَى الصَّلاَةِ قَبْلَ أَنْ يُكَبِّرَ فَقَالَ ‏ \"‏ أَقِيمُوا صُفُوفَكُمْ وَتَرَاصُّوا فَإِنِّي أَرَاكُمْ مِنْ وَرَاءِ ظَهْرِي ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 815,
			"arabicnumber": 815,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ الْمُخَرِّمِيُّ، قَالَ حَدَّثَنَا أَبُو هِشَامٍ، قَالَ حَدَّثَنَا أَبَانُ، قَالَ حَدَّثَنَا قَتَادَةُ، قَالَ حَدَّثَنَا أَنَسٌ، أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ رَاصُّوا صُفُوفَكُمْ وَقَارِبُوا بَيْنَهَا وَحَاذُوا بِالأَعْنَاقِ فَوَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ إِنِّي لأَرَى الشَّيَاطِينَ تَدْخُلُ مِنْ خَلَلِ الصَّفِّ كَأَنَّهَا الْحَذَفُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 816,
			"arabicnumber": 816,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا الْفُضَيْلُ بْنُ عِيَاضٍ، عَنِ الأَعْمَشِ، عَنِ الْمُسَيَّبِ بْنِ رَافِعٍ، عَنْ تَمِيمِ بْنِ طَرَفَةَ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ خَرَجَ إِلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَلاَ تَصُفُّونَ كَمَا تَصُفُّ الْمَلاَئِكَةُ عِنْدَ رَبِّهِمْ ‏\"‏ ‏.‏ قَالُوا وَكَيْفَ تَصُفُّ الْمَلاَئِكَةُ عِنْدَ رَبِّهِمْ قَالَ ‏\"‏ يُتِمُّونَ الصَّفَّ الأَوَّلَ ثُمَّ يَتَرَاصُّونَ فِي الصَّفِّ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 817,
			"arabicnumber": 817,
			"text": "أَخْبَرَنِي يَحْيَى بْنُ عُثْمَانَ الْحِمْصِيُّ، قَالَ حَدَّثَنَا بَقِيَّةُ، عَنْ بَحِيرِ بْنِ سَعْدٍ، عَنْ خَالِدِ بْنِ مَعْدَانَ، عَنْ جُبَيْرِ بْنِ نُفَيْرٍ، عَنِ الْعِرْبَاضِ بْنِ سَارِيَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم كَانَ يُصَلِّي عَلَى الصَّفِّ الأَوَّلِ ثَلاَثًا وَعَلَى الثَّانِي وَاحِدَةً ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 818,
			"arabicnumber": 818,
			"text": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، عَنْ خَالِدٍ، قَالَ حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ أَتِمُّوا الصَّفَّ الأَوَّلَ ثُمَّ الَّذِي يَلِيهِ وَإِنْ كَانَ نَقْصٌ فَلْيَكُنْ فِي الصَّفِّ الْمُؤَخَّرِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 819,
			"arabicnumber": 819,
			"text": "أَخْبَرَنَا عِيسَى بْنُ إِبْرَاهِيمَ بْنِ مَثْرُودٍ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ، عَنْ أَبِي الزَّاهِرِيَّةِ، عَنْ كَثِيرِ بْنِ مُرَّةَ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ وَصَلَ صَفًّا وَصَلَهُ اللَّهُ وَمَنْ قَطَعَ صَفًّا قَطَعَهُ اللَّهُ عَزَّ وَجَلَّ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 820,
			"arabicnumber": 820,
			"text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا جَرِيرٌ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ خَيْرُ صُفُوفِ الرِّجَالِ أَوَّلُهَا وَشَرُّهَا آخِرُهَا وَخَيْرُ صُفُوفِ النِّسَاءِ آخِرُهَا وَشَرُّهَا أَوَّلُهَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 821,
			"arabicnumber": 821,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ، عَنْ سُفْيَانَ، عَنْ يَحْيَى بْنِ هَانِئٍ، عَنْ عَبْدِ الْحَمِيدِ بْنِ مَحْمُودٍ، قَالَ كُنَّا مَعَ أَنَسٍ فَصَلَّيْنَا مَعَ أَمِيرٍ مِنَ الأُمَرَاءِ فَدَفَعُونَا حَتَّى قُمْنَا وَصَلَّيْنَا بَيْنَ السَّارِيَتَيْنِ فَجَعَلَ أَنَسٌ يَتَأَخَّرُ وَقَالَ قَدْ كُنَّا نَتَّقِي هَذَا عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 822,
			"arabicnumber": 822,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ مِسْعَرٍ، عَنْ ثَابِتِ بْنِ عُبَيْدٍ، عَنِ ابْنِ الْبَرَاءِ، عَنِ الْبَرَاءِ، قَالَ كُنَّا إِذَا صَلَّيْنَا خَلْفَ رَسُولِ اللَّهِ صلى الله عليه وسلم أَحْبَبْتُ أَنْ أَكُونَ عَنْ يَمِينِهِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 823,
			"arabicnumber": 823,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا صَلَّى أَحَدُكُمْ بِالنَّاسِ فَلْيُخَفِّفْ فَإِنَّ فِيهِمُ السَّقِيمَ وَالضَّعِيفَ وَالْكَبِيرَ فَإِذَا صَلَّى أَحَدُكُمْ لِنَفْسِهِ فَلْيُطَوِّلْ مَا شَاءَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 824,
			"arabicnumber": 824,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ أَخَفَّ النَّاسِ صَلاَةً فِي تَمَامٍ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 825,
			"arabicnumber": 825,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ، عَنِ الأَوْزَاعِيِّ، قَالَ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنِّي لأَقُومُ فِي الصَّلاَةِ فَأَسْمَعُ بُكَاءَ الصَّبِيِّ فَأُوجِزُ فِي صَلاَتِي كَرَاهِيَةَ أَنْ أَشُقَّ عَلَى أُمِّهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 826,
			"arabicnumber": 826,
			"text": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، عَنِ ابْنِ أَبِي ذِئْبٍ، قَالَ أَخْبَرَنِي الْحَارِثُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَأْمُرُ بِالتَّخْفِيفِ وَيَؤُمُّنَا بِالصَّافَّاتِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 827,
			"arabicnumber": 827,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عُثْمَانَ بْنِ أَبِي سُلَيْمَانَ، عَنْ عَامِرِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، عَنْ عَمْرِو بْنِ سُلَيْمٍ الزُّرَقِيِّ، عَنْ أَبِي قَتَادَةَ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَؤُمُّ النَّاسَ وَهُوَ حَامِلٌ أُمَامَةَ بِنْتَ أَبِي الْعَاصِ عَلَى عَاتِقِهِ فَإِذَا رَكَعَ وَضَعَهَا وَإِذَا رَفَعَ مِنْ سُجُودِهِ أَعَادَهَا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 828,
			"arabicnumber": 828,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ مُحَمَّدِ بْنِ زِيَادٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ مُحَمَّدٌ صلى الله عليه وسلم ‏ \"‏ أَلاَ يَخْشَى الَّذِي يَرْفَعُ رَأْسَهُ قَبْلَ الإِمَامِ أَنْ يُحَوِّلَ اللَّهُ رَأْسَهُ رَأْسَ حِمَارٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 829,
			"arabicnumber": 829,
			"text": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا ابْنُ عُلَيَّةَ، قَالَ أَنْبَأَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ يَزِيدَ، يَخْطُبُ قَالَ حَدَّثَنَا الْبَرَاءُ، وَكَانَ، غَيْرَ كَذُوبٍ أَنَّهُمْ كَانُوا إِذَا صَلَّوْا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَرَفَعَ رَأْسَهُ مِنَ الرُّكُوعِ قَامُوا قِيَامًا حَتَّى يَرَوْهُ سَاجِدًا ثُمَّ سَجَدُوا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 830,
			"arabicnumber": 830,
			"text": "أَخْبَرَنَا مُؤَمَّلُ بْنُ هِشَامٍ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، عَنْ يُونُسَ بْنِ جُبَيْرٍ، عَنْ حِطَّانَ بْنِ عَبْدِ اللَّهِ، قَالَ صَلَّى بِنَا أَبُو مُوسَى فَلَمَّا كَانَ فِي الْقَعْدَةِ دَخَلَ رَجُلٌ مِنَ الْقَوْمِ فَقَالَ أُقِرَّتِ الصَّلاَةُ بِالْبِرِّ وَالزَّكَاةِ ‏.‏ فَلَمَّا سَلَّمَ أَبُو مُوسَى أَقْبَلَ عَلَى الْقَوْمِ فَقَالَ أَيُّكُمُ الْقَائِلُ هَذِهِ الْكَلِمَةَ فَأَرَمَّ الْقَوْمُ ‏.‏ قَالَ يَا حِطَّانُ لَعَلَّكَ قُلْتَهَا قَالَ لاَ وَقَدْ خَشِيتُ أَنْ تَبْكَعَنِي بِهَا فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُعَلِّمُنَا صَلاَتَنَا وَسُنَّتَنَا فَقَالَ ‏\"‏ إِنَّمَا الإِمَامُ لِيُؤْتَمَّ بِهِ فَإِذَا كَبَّرَ فَكَبِّرُوا وَإِذَا قَالَ ‏{‏ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلاَ الضَّالِّينَ ‏}‏ فَقُولُوا آمِينَ يُجِبْكُمُ اللَّهُ وَإِذَا رَكَعَ فَارْكَعُوا وَإِذَا رَفَعَ فَقَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ فَقُولُوا رَبَّنَا لَكَ الْحَمْدُ يَسْمَعِ اللَّهُ لَكُمْ وَإِذَا سَجَدَ فَاسْجُدُوا وَإِذَا رَفَعَ فَارْفَعُوا فَإِنَّ الإِمَامَ يَسْجُدُ قَبْلَكُمْ وَيَرْفَعُ قَبْلَكُمْ ‏\"‏ ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَتِلْكَ بِتِلْكَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 831,
			"arabicnumber": 831,
			"text": "أَخْبَرَنَا وَاصِلُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا ابْنُ فُضَيْلٍ، عَنِ الأَعْمَشِ، عَنْ مُحَارِبِ بْنِ دِثَارٍ، وَأَبِي، صَالِحٍ عَنْ جَابِرٍ، قَالَ جَاءَ رَجُلٌ مِنَ الأَنْصَارِ وَقَدْ أُقِيمَتِ الصَّلاَةُ فَدَخَلَ الْمَسْجِدَ فَصَلَّى خَلْفَ مُعَاذٍ فَطَوَّلَ بِهِمْ فَانْصَرَفَ الرَّجُلُ فَصَلَّى فِي نَاحِيَةِ الْمَسْجِدِ ثُمَّ انْطَلَقَ فَلَمَّا قَضَى مُعَاذٌ الصَّلاَةَ قِيلَ لَهُ إِنَّ فُلاَنًا فَعَلَ كَذَا وَكَذَا ‏.‏ فَقَالَ مُعَاذٌ لَئِنْ أَصْبَحْتُ لأَذْكُرَنَّ ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ فَأَتَى مُعَاذٌ النَّبِيَّ صلى الله عليه وسلم فَذَكَرَ ذَلِكَ لَهُ فَأَرْسَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَيْهِ فَقَالَ ‏\"‏ مَا حَمَلَكَ عَلَى الَّذِي صَنَعْتَ ‏\"‏ ‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ عَمِلْتُ عَلَى نَاضِحِي مِنَ النَّهَارِ فَجِئْتُ وَقَدْ أُقِيمَتِ الصَّلاَةُ فَدَخَلْتُ الْمَسْجِدَ فَدَخَلْتُ مَعَهُ فِي الصَّلاَةِ فَقَرَأَ سُورَةَ كَذَا وَكَذَا فَطَوَّلَ فَانْصَرَفْتُ فَصَلَّيْتُ فِي نَاحِيَةِ الْمَسْجِدِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَفَتَّانٌ يَا مُعَاذُ أَفَتَّانٌ يَا مُعَاذُ أَفَتَّانٌ يَا مُعَاذُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 832,
			"arabicnumber": 832,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَكِبَ فَرَسًا فَصُرِعَ عَنْهُ فَجُحِشَ شِقُّهُ الأَيْمَنُ فَصَلَّى صَلاَةً مِنَ الصَّلَوَاتِ وَهُوَ قَاعِدٌ فَصَلَّيْنَا وَرَاءَهُ قُعُودًا فَلَمَّا انْصَرَفَ قَالَ ‏ \"‏ إِنَّمَا جُعِلَ الإِمَامُ لِيُؤْتَمَّ بِهِ فَإِذَا صَلَّى قَائِمًا فَصَلُّوا قِيَامًا وَإِذَا رَكَعَ فَارْكَعُوا وَإِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ فَقُولُوا رَبَّنَا لَكَ الْحَمْدُ وَإِذَا صَلَّى جَالِسًا فَصَلُّوا جُلُوسًا أَجْمَعُونَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 833,
			"arabicnumber": 833,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ لَمَّا ثَقُلَ رَسُولُ اللَّهِ صلى الله عليه وسلم جَاءَ بِلاَلٌ يُؤْذِنُهُ بِالصَّلاَةِ فَقَالَ ‏\"‏ مُرُوا أَبَا بَكْرٍ فَلْيُصَلِّ بِالنَّاسِ ‏\"‏ ‏.‏ قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ إِنَّ أَبَا بَكْرٍ رَجُلٌ أَسِيفٌ وَإِنَّهُ مَتَى يَقُومُ فِي مَقَامِكَ لاَ يُسْمِعُ النَّاسَ فَلَوْ أَمَرْتَ عُمَرَ ‏.‏ فَقَالَ ‏\"‏ مُرُوا أَبَا بَكْرٍ فَلْيُصَلِّ بِالنَّاسِ ‏\"‏ ‏.‏ فَقُلْتُ لِحَفْصَةَ قُولِي لَهُ فَقَالَتْ لَهُ ‏.‏ فَقَالَ ‏\"‏ إِنَّكُنَّ لأَنْتُنَّ صَوَاحِبَاتُ يُوسُفَ مُرُوا أَبَا بَكْرٍ فَلْيُصَلِّ بِالنَّاسِ ‏\"‏ ‏.‏ قَالَتْ فَأَمَرُوا أَبَا بَكْرٍ فَلَمَّا دَخَلَ فِي الصَّلاَةِ وَجَدَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ نَفْسِهِ خِفَّةً - قَالَتْ - فَقَامَ يُهَادَى بَيْنَ رَجُلَيْنِ وَرِجْلاَهُ تَخُطَّانِ فِي الأَرْضِ فَلَمَّا دَخَلَ الْمَسْجِدَ سَمِعَ أَبُو بَكْرٍ حِسَّهُ فَذَهَبَ لِيَتَأَخَّرَ فَأَوْمَأَ إِلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ قُمْ كَمَا أَنْتَ قَالَتْ فَجَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى قَامَ عَنْ يَسَارِ أَبِي بَكْرٍ جَالِسًا فَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي بِالنَّاسِ جَالِسًا وَأَبُو بَكْرٍ قَائِمًا يَقْتَدِي أَبُو بَكْرٍ بِرَسُولِ اللَّهِ صلى الله عليه وسلم وَالنَّاسُ يَقْتَدُونَ بِصَلاَةِ أَبِي بَكْرٍ رضى الله عنه ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 834,
			"arabicnumber": 834,
			"text": "أَخْبَرَنَا الْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ الْعَنْبَرِيُّ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، قَالَ حَدَّثَنَا زَائِدَةُ، عَنْ مُوسَى بْنِ أَبِي عَائِشَةَ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، قَالَ دَخَلْتُ عَلَى عَائِشَةَ فَقُلْتُ أَلاَ تُحَدِّثِينِي عَنْ مَرَضِ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ قَالَتْ لَمَّا ثَقُلَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَصَلَّى النَّاسُ ‏\"‏ ‏.‏ فَقُلْنَا لاَ وَهُمْ يَنْتَظِرُونَكَ يَا رَسُولَ اللَّهِ ‏.‏ فَقَالَ ‏\"‏ ضَعُوا لِي مَاءً فِي الْمِخْضَبِ ‏\"‏ ‏.‏ فَفَعَلْنَا فَاغْتَسَلَ ثُمَّ ذَهَبَ لِيَنُوءَ فَأُغْمِيَ عَلَيْهِ ثُمَّ أَفَاقَ فَقَالَ ‏\"‏ أَصَلَّى النَّاسُ ‏\"‏ ‏.‏ قُلْنَا لاَ هُمْ يَنْتَظِرُونَكَ يَا رَسُولَ اللَّهِ ‏.‏ فَقَالَ ‏\"‏ ضَعُوا لِي مَاءً فِي الْمِخْضَبِ ‏\"‏ ‏.‏ فَفَعَلْنَا فَاغْتَسَلَ ثُمَّ ذَهَبَ لِيَنُوءَ ثُمَّ أُغْمِيَ عَلَيْهِ ثُمَّ قَالَ فِي الثَّالِثَةِ مِثْلَ قَوْلِهِ قَالَتْ وَالنَّاسُ عُكُوفٌ فِي الْمَسْجِدِ يَنْتَظِرُونَ رَسُولَ اللَّهِ صلى الله عليه وسلم لِصَلاَةِ الْعِشَاءِ فَأَرْسَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى أَبِي بَكْرٍ ‏\"‏ أَنْ صَلِّ بِالنَّاسِ ‏\"‏ ‏.‏ فَجَاءَهُ الرَّسُولُ فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم يَأْمُرُكَ أَنْ تُصَلِّيَ بِالنَّاسِ وَكَانَ أَبُو بَكْرٍ رَجُلاً رَقِيقًا فَقَالَ يَا عُمَرُ صَلِّ بِالنَّاسِ ‏.‏ فَقَالَ أَنْتَ أَحَقُّ بِذَلِكَ ‏.‏ فَصَلَّى بِهِمْ أَبُو بَكْرٍ تِلْكَ الأَيَّامَ ثُمَّ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم وَجَدَ مِنْ نَفْسِهِ خِفَّةً فَجَاءَ يُهَادَى بَيْنَ رَجُلَيْنِ أَحَدُهُمَا الْعَبَّاسُ لِصَلاَةِ الظُّهْرِ فَلَمَّا رَآهُ أَبُو بَكْرٍ ذَهَبَ لِيَتَأَخَّرَ فَأَوْمَأَ إِلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ لاَ يَتَأَخَّرَ وَأَمَرَهُمَا فَأَجْلَسَاهُ إِلَى جَنْبِهِ فَجَعَلَ أَبُو بَكْرٍ يُصَلِّي قَائِمًا وَالنَّاسُ يُصَلُّونَ بِصَلاَةِ أَبِي بَكْرٍ وَرَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي قَاعِدًا ‏.‏ فَدَخَلْتُ عَلَى ابْنِ عَبَّاسٍ فَقُلْتُ أَلاَ أَعْرِضُ عَلَيْكَ مَا حَدَّثَتْنِي عَائِشَةُ عَنْ مَرَضِ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ نَعَمْ ‏.‏ فَحَدَّثْتُهُ فَمَا أَنْكَرَ مِنْهُ شَيْئًا غَيْرَ أَنَّهُ قَالَ أَسَمَّتْ لَكَ الرَّجُلَ الَّذِي كَانَ مَعَ الْعَبَّاسِ قُلْتُ لاَ ‏.‏ قَالَ هُوَ عَلِيٌّ كَرَّمَ اللَّهُ وَجْهَهُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 835,
			"arabicnumber": 835,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ كَانَ مُعَاذٌ يُصَلِّي مَعَ النَّبِيِّ صلى الله عليه وسلم ثُمَّ يَرْجِعُ إِلَى قَوْمِهِ يَؤُمُّهُمْ فَأَخَّرَ ذَاتَ لَيْلَةٍ الصَّلاَةَ وَصَلَّى مَعَ النَّبِيِّ صلى الله عليه وسلم ثُمَّ رَجَعَ إِلَى قَوْمِهِ يَؤُمُّهُمْ فَقَرَأَ سُورَةَ الْبَقَرَةِ فَلَمَّا سَمِعَ رَجُلٌ مِنَ الْقَوْمِ تَأَخَّرَ فَصَلَّى ثُمَّ خَرَجَ فَقَالُوا نَافَقْتَ يَا فُلاَنُ ‏.‏ فَقَالَ وَاللَّهِ مَا نَافَقْتُ وَلآتِيَنَّ النَّبِيَّ صلى الله عليه وسلم فَأُخْبِرُهُ ‏.‏ فَأَتَى النَّبِيَّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ مُعَاذًا يُصَلِّي مَعَكَ ثُمَّ يَأْتِينَا فَيَؤُمُّنَا وَإِنَّكَ أَخَّرْتَ الصَّلاَةَ الْبَارِحَةَ فَصَلَّى مَعَكَ ثُمَّ رَجَعَ فَأَمَّنَا فَاسْتَفْتَحَ بِسُورَةِ الْبَقَرَةِ فَلَمَّا سَمِعْتُ ذَلِكَ تَأَخَّرْتُ فَصَلَّيْتُ وَإِنَّمَا نَحْنُ أَصْحَابُ نَوَاضِحَ نَعْمَلُ بِأَيْدِينَا ‏.‏ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ يَا مُعَاذُ أَفَتَّانٌ أَنْتَ اقْرَأْ بِسُورَةِ كَذَا وَسُورَةِ كَذَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 836,
			"arabicnumber": 836,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ أَشْعَثَ، عَنِ الْحَسَنِ، عَنْ أَبِي بَكْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ صَلَّى صَلاَةَ الْخَوْفِ فَصَلَّى بِالَّذِينَ خَلْفَهُ رَكْعَتَيْنِ وَبِالَّذِينَ جَاءُوا رَكْعَتَيْنِ فَكَانَتْ لِلنَّبِيِّ صلى الله عليه وسلم أَرْبَعًا وَلِهَؤُلاَءِ رَكْعَتَيْنِ رَكْعَتَيْنِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 837,
			"arabicnumber": 837,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ صَلاَةُ الْجَمَاعَةِ تَفْضُلُ عَلَى صَلاَةِ الْفَذِّ بِسَبْعٍ وَعِشْرِينَ دَرَجَةً ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 838,
			"arabicnumber": 838,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ صَلاَةُ الْجَمَاعَةِ أَفْضَلُ مِنْ صَلاَةِ أَحَدِكُمْ وَحْدَهُ خَمْسًا وَعِشْرِينَ جُزْءًا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 839,
			"arabicnumber": 839,
			"text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَمَّارٍ، قَالَ حَدَّثَنِي الْقَاسِمُ بْنُ مُحَمَّدٍ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ صَلاَةُ الْجَمَاعَةِ تَزِيدُ عَلَى صَلاَةِ الْفَذِّ خَمْسًا وَعِشْرِينَ دَرَجَةً ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 840,
			"arabicnumber": 840,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا كَانُوا ثَلاَثَةً فَلْيَؤُمَّهُمْ أَحَدُهُمْ وَأَحَقُّهُمْ بِالإِمَامَةِ أَقْرَؤُهُمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 841,
			"arabicnumber": 841,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ بْنِ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا حَجَّاجٌ، قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي زِيَادٌ، أَنَّ قَزَعَةَ، مَوْلًى لِعَبْدِ الْقَيْسِ أَخْبَرَهُ أَنَّهُ، سَمِعَ عِكْرِمَةَ، قَالَ قَالَ ابْنُ عَبَّاسٍ صَلَّيْتُ إِلَى جَنْبِ النَّبِيِّ صلى الله عليه وسلم وَعَائِشَةُ خَلْفَنَا تُصَلِّي مَعَنَا وَأَنَا إِلَى جَنْبِ النَّبِيِّ صلى الله عليه وسلم أُصَلِّي مَعَهُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 842,
			"arabicnumber": 842,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ، عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ صَلَّيْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقُمْتُ عَنْ يَسَارِهِ فَأَخَذَنِي بِيَدِهِ الْيُسْرَى فَأَقَامَنِي عَنْ يَمِينِهِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 843,
			"arabicnumber": 843,
			"text": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، عَنْ شُعْبَةَ، عَنْ أَبِي إِسْحَاقَ، أَنَّهُ أَخْبَرَهُمْ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَصِيرٍ، عَنْ أَبِيهِ، - قَالَ شُعْبَةُ وَقَالَ أَبُو إِسْحَاقَ وَقَدْ سَمِعْتُهُ مِنْهُ، وَمِنْ أَبِيهِ - قَالَ سَمِعْتُ أُبَىَّ بْنَ كَعْبٍ، يَقُولُ صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمًا صَلاَةَ الصُّبْحِ فَقَالَ ‏\"‏ أَشَهِدَ فُلاَنٌ الصَّلاَةَ ‏\"‏ ‏.‏ قَالُوا لاَ ‏.‏ قَالَ ‏\"‏ فَفُلاَنٌ ‏\"‏ ‏.‏ قَالُوا لاَ ‏.‏ قَالَ ‏\"‏ إِنَّ هَاتَيْنِ الصَّلاَتَيْنِ مِنْ أَثْقَلِ الصَّلاَةِ عَلَى الْمُنَافِقِينَ وَلَوْ يَعْلَمُونَ مَا فِيهِمَا لأَتَوْهُمَا وَلَوْ حَبْوًا وَالصَّفُّ الأَوَّلُ عَلَى مِثْلِ صَفِّ الْمَلاَئِكَةِ وَلَوْ تَعْلَمُونَ فَضِيلَتَهُ لاَبْتَدَرْتُمُوهُ وَصَلاَةُ الرَّجُلِ مَعَ الرَّجُلِ أَزْكَى مِنْ صَلاَتِهِ وَحْدَهُ وَصَلاَةُ الرَّجُلِ مَعَ الرَّجُلَيْنِ أَزْكَى مِنْ صَلاَتِهِ مَعَ الرَّجُلِ وَمَا كَانُوا أَكْثَرَ فَهُوَ أَحَبُّ إِلَى اللَّهِ عَزَّ وَجَلَّ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 844,
			"arabicnumber": 844,
			"text": "أَخْبَرَنَا نَصْرُ بْنُ عَلِيٍّ، قَالَ أَنْبَأَنَا عَبْدُ الأَعْلَى، قَالَ حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ مَحْمُودٍ، عَنْ عِتْبَانَ بْنِ مَالِكٍ، أَنَّهُ قَالَ يَا رَسُولَ اللَّهِ إِنَّ السُّيُولَ لَتَحُولُ بَيْنِي وَبَيْنَ مَسْجِدِ قَوْمِي فَأُحِبُّ أَنْ تَأْتِيَنِي فَتُصَلِّيَ فِي مَكَانٍ مِنْ بَيْتِي أَتَّخِذُهُ مَسْجِدًا ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ سَنَفْعَلُ ‏\"‏ ‏.‏ فَلَمَّا دَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ أَيْنَ تُرِيدُ ‏\"‏ ‏.‏ فَأَشَرْتُ إِلَى نَاحِيَةٍ مِنَ الْبَيْتِ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَصَفَفْنَا خَلْفَهُ فَصَلَّى بِنَا رَكْعَتَيْنِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 845,
			"arabicnumber": 845,
			"text": "أَنْبَأَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ أَنْبَأَنَا إِسْمَاعِيلُ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، قَالَ أَقْبَلَ عَلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم بِوَجْهِهِ حِينَ قَامَ إِلَى الصَّلاَةِ قَبْلَ أَنْ يُكَبِّرَ فَقَالَ ‏ \"‏ أَقِيمُوا صُفُوفَكُمْ وَتَرَاصُّوا فَإِنِّي أَرَاكُمْ مِنْ وَرَاءِ ظَهْرِي ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 846,
			"arabicnumber": 846,
			"text": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ، قَالَ حَدَّثَنَا أَبُو زُبَيْدٍ، - وَاسْمُهُ عَبْثَرُ بْنُ الْقَاسِمِ - عَنْ حُصَيْنٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ، عَنْ أَبِيهِ، قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِذْ قَالَ بَعْضُ الْقَوْمِ لَوْ عَرَّسْتَ بِنَا يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ إِنِّي أَخَافُ أَنْ تَنَامُوا عَنِ الصَّلاَةِ ‏\"‏ ‏.‏ قَالَ بِلاَلٌ أَنَا أَحْفَظُكُمْ ‏.‏ فَاضْطَجَعُوا فَنَامُوا وَأَسْنَدَ بِلاَلٌ ظَهْرَهُ إِلَى رَاحِلَتِهِ فَاسْتَيْقَظَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَدْ طَلَعَ حَاجِبُ الشَّمْسِ فَقَالَ ‏\"‏ يَا بِلاَلُ أَيْنَ مَا قُلْتَ ‏\"‏ ‏.‏ قَالَ مَا أُلْقِيَتْ عَلَىَّ نَوْمَةٌ مِثْلُهَا قَطُّ ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ اللَّهَ عَزَّ وَجَلَّ قَبَضَ أَرْوَاحَكُمْ حِينَ شَاءَ فَرَدَّهَا حِينَ شَاءَ قُمْ يَا بِلاَلُ فَآذِنِ النَّاسَ بِالصَّلاَةِ ‏\"‏ ‏.‏ فَقَامَ بِلاَلٌ فَأَذَّنَ فَتَوَضَّئُوا - يَعْنِي حِينَ ارْتَفَعَتِ الشَّمْسُ - ثُمَّ قَامَ فَصَلَّى بِهِمْ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 847,
			"arabicnumber": 847,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ زَائِدَةَ بْنِ قُدَامَةَ، قَالَ حَدَّثَنَا السَّائِبُ بْنُ حُبَيْشٍ الْكَلاَعِيُّ، عَنْ مَعْدَانَ بْنِ أَبِي طَلْحَةَ الْيَعْمَرِيِّ، قَالَ قَالَ لِي أَبُو الدَّرْدَاءِ أَيْنَ مَسْكَنُكَ قُلْتُ فِي قَرْيَةٍ دُوَيْنَ حِمْصَ ‏.‏ فَقَالَ أَبُو الدَّرْدَاءِ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَا مِنْ ثَلاَثَةٍ فِي قَرْيَةٍ وَلاَ بَدْوٍ لاَ تُقَامُ فِيهِمُ الصَّلاَةُ إِلاَّ قَدِ اسْتَحْوَذَ عَلَيْهِمُ الشَّيْطَانُ فَعَلَيْكُمْ بِالْجَمَاعَةِ فَإِنَّمَا يَأْكُلُ الذِّئْبُ الْقَاصِيَةَ ‏\"‏ ‏.‏ قَالَ السَّائِبُ يَعْنِي بِالْجَمَاعَةِ الْجَمَاعَةَ فِي الصَّلاَةِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 848,
			"arabicnumber": 848,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ وَالَّذِي نَفْسِي بِيَدِهِ لَقَدْ هَمَمْتُ أَنْ آمُرَ بِحَطَبٍ فَيُحْطَبَ ثُمَّ آمُرَ بِالصَّلاَةِ فَيُؤَذَّنَ لَهَا ثُمَّ آمُرَ رَجُلاً فَيَؤُمَّ النَّاسَ ثُمَّ أُخَالِفَ إِلَى رِجَالٍ فَأُحَرِّقَ عَلَيْهِمْ بُيُوتَهُمْ وَالَّذِي نَفْسِي بِيَدِهِ لَوْ يَعْلَمُ أَحَدُهُمْ أَنَّهُ يَجِدُ عَظْمًا سَمِينًا أَوْ مَرْمَاتَيْنِ حَسْنَتَيْنِ لَشَهِدَ الْعِشَاءَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 849,
			"arabicnumber": 849,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنِ الْمَسْعُودِيِّ، عَنْ عَلِيِّ بْنِ الأَقْمَرِ، عَنْ أَبِي الأَحْوَصِ، عَنْ عَبْدِ اللَّهِ، أَنَّهُ كَانَ يَقُولُ مَنْ سَرَّهُ أَنْ يَلْقَى اللَّهَ عَزَّ وَجَلَّ غَدًا مُسْلِمًا فَلْيُحَافِظْ عَلَى هَؤُلاَءِ الصَّلَوَاتِ الْخَمْسِ حَيْثُ يُنَادَى بِهِنَّ فَإِنَّ اللَّهَ عَزَّ وَجَلَّ شَرَعَ لِنَبِيِّهِ صلى الله عليه وسلم سُنَنَ الْهُدَى وَإِنَّهُنَّ مِنْ سُنَنِ الْهُدَى وَإِنِّي لاَ أَحْسَبُ مِنْكُمْ أَحَدًا إِلاَّ لَهُ مَسْجِدٌ يُصَلِّي فِيهِ فِي بَيْتِهِ فَلَوْ صَلَّيْتُمْ فِي بُيُوتِكُمْ وَتَرَكْتُمْ مَسَاجِدَكُمْ لَتَرَكْتُمْ سُنَّةَ نَبِيِّكُمْ وَلَوْ تَرَكْتُمْ سُنَّةَ نَبِيِّكُمْ لَضَلَلْتُمْ وَمَا مِنْ عَبْدٍ مُسْلِمٍ يَتَوَضَّأُ فَيُحْسِنُ الْوُضُوءَ ثُمَّ يَمْشِي إِلَى صَلاَةٍ إِلاَّ كَتَبَ اللَّهُ عَزَّ وَجَلَّ لَهُ بِكُلِّ خُطْوَةٍ يَخْطُوهَا حَسَنَةً أَوْ يَرْفَعُ لَهُ بِهَا دَرَجَةً أَوْ يُكَفِّرُ عَنْهُ بِهَا خَطِيئَةً وَلَقَدْ رَأَيْتُنَا نُقَارِبُ بَيْنَ الْخُطَا وَلَقَدْ رَأَيْتُنَا وَمَا يَتَخَلَّفُ عَنْهَا إِلاَّ مُنَافِقٌ مَعْلُومٌ نِفَاقُهُ وَلَقَدْ رَأَيْتُ الرَّجُلَ يُهَادَى بَيْنَ الرَّجُلَيْنِ حَتَّى يُقَامَ فِي الصَّفِّ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 850,
			"arabicnumber": 850,
			"text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ الأَصَمِّ، عَنْ عَمِّهِ، يَزِيدَ بْنِ الأَصَمِّ عَنْ أَبِي هُرَيْرَةَ، قَالَ جَاءَ أَعْمَى إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ إِنَّهُ لَيْسَ لِي قَائِدٌ يَقُودُنِي إِلَى الصَّلاَةِ فَسَأَلَهُ أَنْ يُرَخِّصَ لَهُ أَنْ يُصَلِّيَ فِي بَيْتِهِ فَأَذِنَ لَهُ فَلَمَّا وَلَّى دَعَاهُ قَالَ لَهُ ‏\"‏ أَتَسْمَعُ النِّدَاءَ بِالصَّلاَةِ ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ قَالَ ‏\"‏ فَأَجِبْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 851,
			"arabicnumber": 851,
			"text": "أَخْبَرَنَا هَارُونُ بْنُ زَيْدِ بْنِ أَبِي الزَّرْقَاءِ، قَالَ حَدَّثَنَا أَبِي قَالَ، حَدَّثَنَا سُفْيَانُ، ح وَأَخْبَرَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ إِسْحَاقَ، قَالَ حَدَّثَنَا قَاسِمُ بْنُ يَزِيدَ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَابِسٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنِ ابْنِ أُمِّ مَكْتُومٍ، أَنَّهُ قَالَ يَا رَسُولَ اللَّهِ إِنَّ الْمَدِينَةَ كَثِيرَةُ الْهَوَامِّ وَالسِّبَاعِ ‏.‏ قَالَ ‏\"‏ هَلْ تَسْمَعُ حَىَّ عَلَى الصَّلاَةِ حَىَّ عَلَى الْفَلاَحِ ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ قَالَ ‏\"‏ فَحَىَّ هَلاً ‏\"‏ ‏.‏ وَلَمْ يُرَخِّصْ لَهُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 852,
			"arabicnumber": 852,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّ عَبْدَ اللَّهِ بْنَ أَرْقَمَ، كَانَ يَؤُمُّ أَصْحَابَهُ فَحَضَرَتِ الصَّلاَةُ يَوْمًا فَذَهَبَ لِحَاجَتِهِ ثُمَّ رَجَعَ فَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِذَا وَجَدَ أَحَدُكُمُ الْغَائِطَ فَلْيَبْدَأْ بِهِ قَبْلَ الصَّلاَةِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 853,
			"arabicnumber": 853,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ أَنَسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا حَضَرَ الْعَشَاءُ وَأُقِيمَتِ الصَّلاَةُ فَابْدَءُوا بِالْعَشَاءِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 854,
			"arabicnumber": 854,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَبِي الْمَلِيحِ، عَنْ أَبِيهِ، قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم بِحُنَيْنٍ فَأَصَابَنَا مَطَرٌ فَنَادَى مُنَادِي رَسُولِ اللَّهِ صلى الله عليه وسلم أَنْ صَلُّوا فِي رِحَالِكُمْ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 855,
			"arabicnumber": 855,
			"text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنِ ابْنِ طَحْلاَءَ، عَنْ مُحْصِنِ بْنِ عَلِيٍّ الْفِهْرِيِّ، عَنْ عَوْفِ بْنِ الْحَارِثِ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ تَوَضَّأَ فَأَحْسَنَ الْوُضُوءَ ثُمَّ خَرَجَ عَامِدًا إِلَى الْمَسْجِدِ فَوَجَدَ النَّاسَ قَدْ صَلَّوْا كَتَبَ اللَّهُ لَهُ مِثْلَ أَجْرِ مَنْ حَضَرَهَا وَلاَ يَنْقُصُ ذَلِكَ مِنْ أُجُورِهِمْ شَيْئًا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 856,
			"arabicnumber": 856,
			"text": "أَخْبَرَنَا سُلَيْمَانُ بْنُ دَاوُدَ، عَنِ ابْنِ وَهْبٍ، قَالَ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، أَنَّ الْحُكَيْمَ بْنَ عَبْدِ اللَّهِ الْقُرَشِيَّ، حَدَّثَهُ أَنَّ نَافِعَ بْنَ جُبَيْرٍ وَعَبْدَ اللَّهِ بْنَ أَبِي سَلَمَةَ حَدَّثَاهُ أَنَّ مُعَاذَ بْنَ عَبْدِ الرَّحْمَنِ حَدَّثَهُمَا عَنْ حُمْرَانَ، مَوْلَى عُثْمَانَ بْنِ عَفَّانَ عَنْ عُثْمَانَ بْنِ عَفَّانَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَنْ تَوَضَّأَ لِلصَّلاَةِ فَأَسْبَغَ الْوُضُوءَ ثُمَّ مَشَى إِلَى الصَّلاَةِ الْمَكْتُوبَةِ فَصَلاَّهَا مَعَ النَّاسِ أَوْ مَعَ الْجَمَاعَةِ أَوْ فِي الْمَسْجِدِ غَفَرَ اللَّهُ لَهُ ذُنُوبَهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 857,
			"arabicnumber": 857,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنِ زَيْدِ بْنِ أَسْلَمَ، عَنْ رَجُلٍ، مِنْ بَنِي الدِّيلِ يُقَالُ لَهُ بُسْرُ بْنُ مِحْجَنٍ عَنْ مِحْجَنٍ، أَنَّهُ كَانَ فِي مَجْلِسٍ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَذَّنَ بِالصَّلاَةِ - فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ رَجَعَ وَمِحْجَنٌ فِي مَجْلِسِهِ - فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا مَنَعَكَ أَنْ تُصَلِّيَ أَلَسْتَ بِرَجُلٍ مُسْلِمٍ ‏\"‏ ‏.‏ قَالَ بَلَى وَلَكِنِّي كُنْتُ قَدْ صَلَّيْتُ فِي أَهْلِي فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا جِئْتَ فَصَلِّ مَعَ النَّاسِ وَإِنْ كُنْتَ قَدْ صَلَّيْتَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 858,
			"arabicnumber": 858,
			"text": "أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ، قَالَ حَدَّثَنَا هُشَيْمٌ، قَالَ حَدَّثَنَا يَعْلَى بْنُ عَطَاءٍ، قَالَ حَدَّثَنَا جَابِرُ بْنُ يَزِيدَ بْنِ الأَسْوَدِ الْعَامِرِيُّ، عَنْ أَبِيهِ، قَالَ شَهِدْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم صَلاَةَ الْفَجْرِ فِي مَسْجِدِ الْخَيْفِ فَلَمَّا قَضَى صَلاَتَهُ إِذَا هُوَ بِرَجُلَيْنِ فِي آخِرِ الْقَوْمِ لَمْ يُصَلِّيَا مَعَهُ قَالَ ‏\"‏ عَلَىَّ بِهِمَا ‏\"‏ ‏.‏ فَأُتِيَ بِهِمَا تُرْعَدُ فَرَائِصُهُمَا فَقَالَ ‏\"‏ مَا مَنَعَكُمَا أَنْ تُصَلِّيَا مَعَنَا ‏\"‏ ‏.‏ قَالاَ يَا رَسُولَ اللَّهِ إِنَّا قَدْ صَلَّيْنَا فِي رِحَالِنَا ‏.‏ قَالَ ‏\"‏ فَلاَ تَفْعَلاَ إِذَا صَلَّيْتُمَا فِي رِحَالِكُمَا ثُمَّ أَتَيْتُمَا مَسْجِدَ جَمَاعَةٍ فَصَلِّيَا مَعَهُمْ فَإِنَّهَا لَكُمَا نَافِلَةٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 859,
			"arabicnumber": 859,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، وَمُحَمَّدُ بْنُ إِبْرَاهِيمَ بْنِ صُدْرَانَ، - وَاللَّفْظُ لَهُ - عَنْ خَالِدِ بْنِ الْحَارِثِ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ بُدَيْلٍ، قَالَ سَمِعْتُ أَبَا الْعَالِيَةِ، يُحَدِّثُ عَنْ عَبْدِ اللَّهِ بْنِ الصَّامِتِ، عَنْ أَبِي ذَرٍّ، قَالَ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم وَضَرَبَ فَخِذِي ‏\"‏ كَيْفَ أَنْتَ إِذَا بَقِيتَ فِي قَوْمٍ يُؤَخِّرُونَ الصَّلاَةَ عَنْ وَقْتِهَا ‏\"‏ ‏.‏ قَالَ مَا تَأْمُرُ قَالَ ‏\"‏ صَلِّ الصَّلاَةَ لِوَقْتِهَا ثُمَّ اذْهَبْ لِحَاجَتِكَ فَإِنْ أُقِيمَتِ الصَّلاَةُ وَأَنْتَ فِي الْمَسْجِدِ فَصَلِّ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 860,
			"arabicnumber": 860,
			"text": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ مُحَمَّدٍ التَّيْمِيُّ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ حُسَيْنٍ الْمُعَلِّمِ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ سُلَيْمَانَ، مَوْلَى مَيْمُونَةَ قَالَ رَأَيْتُ ابْنَ عُمَرَ جَالِسًا عَلَى الْبَلاَطِ وَالنَّاسُ يُصَلُّونَ قُلْتُ يَا أَبَا عَبْدِ الرَّحْمَنِ مَا لَكَ لاَ تُصَلِّي قَالَ إِنِّي قَدْ صَلَّيْتُ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ لاَ تُعَادُ الصَّلاَةُ فِي يَوْمٍ مَرَّتَيْنِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 861,
			"arabicnumber": 861,
			"text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ الزُّهْرِيُّ، قَالَ حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا الزُّهْرِيُّ، عَنْ سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا أَتَيْتُمُ الصَّلاَةَ فَلاَ تَأْتُوهَا وَأَنْتُمْ تَسْعَوْنَ وَأْتُوهَا تَمْشُونَ وَعَلَيْكُمُ السَّكِينَةُ فَمَا أَدْرَكْتُمْ فَصَلُّوا وَمَا فَاتَكُمْ فَاقْضُوا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 862,
			"arabicnumber": 862,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ سَوَّادِ بْنِ الأَسْوَدِ بْنِ عَمْرٍو، قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ، قَالَ أَنْبَأَنَا ابْنُ جُرَيْجٍ، عَنْ مَنْبُوذٍ، عَنِ الْفَضْلِ بْنِ عُبَيْدِ اللَّهِ، عَنْ أَبِي رَافِعٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا صَلَّى الْعَصْرَ ذَهَبَ إِلَى بَنِي عَبْدِ الأَشْهَلِ فَيَتَحَدَّثُ عِنْدَهُمْ حَتَّى يَنْحَدِرَ لِلْمَغْرِبِ ‏.‏ قَالَ أَبُو رَافِعٍ فَبَيْنَمَا النَّبِيُّ صلى الله عليه وسلم يُسْرِعُ إِلَى الْمَغْرِبِ مَرَرْنَا بِالْبَقِيعِ فَقَالَ ‏\"‏ أُفٍّ لَكَ أُفٍّ لَكَ ‏\"‏ ‏.‏ قَالَ فَكَبُرَ ذَلِكَ فِي ذَرْعِي فَاسْتَأْخَرْتُ وَظَنَنْتُ أَنَّهُ يُرِيدُنِي فَقَالَ ‏\"‏ مَا لَكَ امْشِ ‏\"‏ ‏.‏ فَقُلْتُ أَحْدَثْتُ حَدَثًا ‏.‏ قَالَ ‏\"‏ مَا ذَاكَ ‏\"‏ ‏.‏ قُلْتُ أَفَّفْتَ بِي ‏.‏ قَالَ ‏\"‏ لاَ وَلَكِنْ هَذَا فُلاَنٌ بَعَثْتُهُ سَاعِيًا عَلَى بَنِي فُلاَنٍ فَغَلَّ نَمِرَةً فَدُرِّعَ الآنَ مِثْلَهَا مِنْ نَارٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 863,
			"arabicnumber": 863,
			"text": "أَخْبَرَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمْرٍو، قَالَ حَدَّثَنَا أَبُو إِسْحَاقَ، عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي مَنْبُوذٌ، - رَجُلٌ مِنْ آلِ أَبِي رَافِعٍ - عَنِ الْفَضْلِ بْنِ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ، عَنْ أَبِي رَافِعٍ، نَحْوَهُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 864,
			"arabicnumber": 864,
			"text": "أَخْبَرَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ الْمُغِيرَةِ، قَالَ حَدَّثَنَا عُثْمَانُ، عَنْ شُعَيْبٍ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، وَأَبُو عَبْدِ اللَّهِ الأَغَرُّ، أَنَّ أَبَا هُرَيْرَةَ، حَدَّثَهُمَا ‏.‏ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّمَا مَثَلُ الْمُهَجِّرِ إِلَى الصَّلاَةِ كَمَثَلِ الَّذِي يُهْدِي الْبَدَنَةَ ثُمَّ الَّذِي عَلَى إِثْرِهِ كَالَّذِي يُهْدِي الْبَقَرَةَ ثُمَّ الَّذِي عَلَى إِثْرِهِ كَالَّذِي يُهْدِي الْكَبْشَ ثُمَّ الَّذِي عَلَى إِثْرِهِ كَالَّذِي يُهْدِي الدَّجَاجَةَ ثُمَّ الَّذِي عَلَى إِثْرِهِ كَالَّذِي يُهْدِي الْبَيْضَةَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 865,
			"arabicnumber": 865,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ زَكَرِيَّا، قَالَ حَدَّثَنِي عَمْرُو بْنُ دِينَارٍ، قَالَ سَمِعْتُ عَطَاءَ بْنَ يَسَارٍ، يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا أُقِيمَتِ الصَّلاَةُ فَلاَ صَلاَةَ إِلاَّ الْمَكْتُوبَةُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 866,
			"arabicnumber": 866,
			"text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ الْحَكَمِ، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالاَ حَدَّثَنَا مُحَمَّدٌ، عَنْ شُعْبَةَ، عَنْ وَرْقَاءَ بْنِ عُمَرَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا أُقِيمَتِ الصَّلاَةُ فَلاَ صَلاَةَ إِلاَّ الْمَكْتُوبَةُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 867,
			"arabicnumber": 867,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنِ ابْنِ بُحَيْنَةَ، قَالَ أُقِيمَتْ صَلاَةُ الصُّبْحِ فَرَأَى رَسُولُ اللَّهِ صلى الله عليه وسلم رَجُلاً يُصَلِّي وَالْمُؤَذِّنُ يُقِيمُ فَقَالَ ‏ \"‏ أَتُصَلِّي الصُّبْحَ أَرْبَعًا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 868,
			"arabicnumber": 868,
			"text": "أَخْبَرَنَا يَحْيَى بْنُ حَبِيبِ بْنِ عَرَبِيٍّ، قَالَ حَدَّثَنَا حَمَّادٌ، قَالَ حَدَّثَنَا عَاصِمٌ، عَنْ عَبْدِ اللَّهِ بْنِ سَرْجِسَ، قَالَ جَاءَ رَجُلٌ وَرَسُولُ اللَّهِ صلى الله عليه وسلم فِي صَلاَةِ الصُّبْحِ فَرَكَعَ الرَّكْعَتَيْنِ ثُمَّ دَخَلَ فَلَمَّا قَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم صَلاَتَهُ قَالَ ‏ \"‏ يَا فُلاَنُ أَيُّهُمَا صَلاَتُكَ الَّتِي صَلَّيْتَ مَعَنَا أَوِ الَّتِي صَلَّيْتَ لِنَفْسِكَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 869,
			"arabicnumber": 869,
			"text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنِي إِسْحَاقُ بْنُ عَبْدِ اللَّهِ، قَالَ سَمِعْتُ أَنَسًا، - رضى الله عنه - قَالَ أَتَانَا رَسُولُ اللَّهِ صلى الله عليه وسلم فِي بَيْتِنَا فَصَلَّيْتُ أَنَا وَيَتِيمٌ لَنَا خَلْفَهُ وَصَلَّتْ أُمُّ سُلَيْمٍ خَلْفَنَا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 870,
			"arabicnumber": 870,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا نُوحٌ، - يَعْنِي ابْنَ قَيْسٍ - عَنِ ابْنِ مَالِكٍ، - وَهُوَ عَمْرٌو - عَنْ أَبِي الْجَوْزَاءِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَتِ امْرَأَةٌ تُصَلِّي خَلْفَ رَسُولِ اللَّهِ صلى الله عليه وسلم حَسْنَاءُ مِنْ أَحْسَنِ النَّاسِ - قَالَ - فَكَانَ بَعْضُ الْقَوْمِ يَتَقَدَّمُ فِي الصَّفِّ الأَوَّلِ لِئَلاَّ يَرَاهَا وَيَسْتَأْخِرُ بَعْضُهُمْ حَتَّى يَكُونَ فِي الصَّفِّ الْمُؤَخَّرِ فَإِذَا رَكَعَ نَظَرَ مِنْ تَحْتِ إِبْطِهِ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏{‏ وَلَقَدْ عَلِمْنَا الْمُسْتَقْدِمِينَ مِنْكُمْ وَلَقَدْ عَلِمْنَا الْمُسْتَأْخِرِينَ ‏}‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 871,
			"arabicnumber": 871,
			"text": "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، عَنْ يَزِيدَ بْنِ زُرَيْعٍ، قَالَ حَدَّثَنَا سَعِيدٌ، عَنْ زِيَادٍ الأَعْلَمِ، قَالَ حَدَّثَنَا الْحَسَنُ، أَنَّ أَبَا بَكْرَةَ، حَدَّثَهُ أَنَّهُ، دَخَلَ الْمَسْجِدَ وَالنَّبِيُّ صلى الله عليه وسلم رَاكِعٌ فَرَكَعَ دُونَ الصَّفِّ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ زَادَكَ اللَّهُ حِرْصًا وَلاَ تَعُدْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 872,
			"arabicnumber": 872,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ، قَالَ حَدَّثَنِي أَبُو أُسَامَةَ، قَالَ حَدَّثَنِي الْوَلِيدُ بْنُ كَثِيرٍ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمًا ثُمَّ انْصَرَفَ فَقَالَ ‏ \"‏ يَا فُلاَنُ أَلاَ تُحَسِّنُ صَلاَتَكَ أَلاَ يَنْظُرُ الْمُصَلِّي كَيْفَ يُصَلِّي لِنَفْسِهِ إِنِّي أُبْصِرُ مِنْ وَرَائِي كَمَا أُبْصِرُ بَيْنَ يَدَىَّ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 873,
			"arabicnumber": 873,
			"text": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُصَلِّي قَبْلَ الظُّهْرِ رَكْعَتَيْنِ وَبَعْدَهَا رَكْعَتَيْنِ وَكَانَ يُصَلِّي بَعْدَ الْمَغْرِبِ رَكْعَتَيْنِ فِي بَيْتِهِ وَبَعْدَ الْعِشَاءِ رَكْعَتَيْنِ وَكَانَ لاَ يُصَلِّي بَعْدَ الْجُمُعَةِ حَتَّى يَنْصَرِفَ فَيُصَلِّيَ رَكْعَتَيْنِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 874,
			"arabicnumber": 874,
			"text": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، عَنْ عَاصِمِ بْنِ ضَمْرَةَ، قَالَ سَأَلْنَا عَلِيًّا عَنْ صَلاَةِ، رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ أَيُّكُمْ يُطِيقُ ذَلِكَ قُلْنَا إِنْ لَمْ نُطِقْهُ سَمِعْنَا ‏.‏ قَالَ كَانَ إِذَا كَانَتِ الشَّمْسُ مِنْ هَا هُنَا كَهَيْئَتِهَا مِنْ هَا هُنَا عِنْدَ الْعَصْرِ صَلَّى رَكْعَتَيْنِ فَإِذَا كَانَتْ مِنْ هَا هُنَا كَهَيْئَتِهَا مِنْ هَا هُنَا عِنْدَ الظُّهْرِ صَلَّى أَرْبَعًا وَيُصَلِّي قَبْلَ الظُّهْرِ أَرْبَعًا وَبَعْدَهَا ثِنْتَيْنِ وَيُصَلِّي قَبْلَ الْعَصْرِ أَرْبَعًا يَفْصِلُ بَيْنَ كُلِّ رَكْعَتَيْنِ بِتَسْلِيمٍ عَلَى الْمَلاَئِكَةِ الْمُقَرَّبِينَ وَالنَّبِيِّينَ وَمَنْ تَبِعَهُمْ مِنَ الْمُؤْمِنِينَ وَالْمُسْلِمِينَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "-"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 875,
			"arabicnumber": 875,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ، قَالَ حَدَّثَنَا حُصَيْنُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي إِسْحَاقَ، عَنْ عَاصِمِ بْنِ ضَمْرَةَ، قَالَ سَأَلْتُ عَلِيَّ بْنَ أَبِي طَالِبٍ عَنْ صَلاَةِ، رَسُولِ اللَّهِ صلى الله عليه وسلم فِي النَّهَارِ قَبْلَ الْمَكْتُوبَةِ قَالَ مَنْ يُطِيقُ ذَلِكَ ثُمَّ أَخْبَرَنَا قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي حِينَ تَزِيغُ الشَّمْسُ رَكْعَتَيْنِ وَقَبْلَ نِصْفِ النَّهَارِ أَرْبَعَ رَكَعَاتٍ يَجْعَلُ التَّسْلِيمَ فِي آخِرِهِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 99
			}
		}
	]
}