{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"13": "The Book of Forgetfulness (In Prayer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1179,
			"arabicnumber": 1179,
			"text": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الأَصَمِّ، قَالَ سُئِلَ أَنَسُ بْنُ مَالِكٍ عَنِ التَّكْبِيرِ، فِي الصَّلاَةِ فَقَالَ يُكَبِّرُ إِذَا رَكَعَ وَإِذَا سَجَدَ وَإِذَا رَفَعَ رَأْسَهُ مِنَ السُّجُودِ وَإِذَا قَامَ مِنَ الرَّكْعَتَيْنِ ‏.‏ فَقَالَ حُطَيْمٌ عَمَّنْ تَحْفَظُ هَذَا فَقَالَ عَنِ النَّبِيِّ صلى الله عليه وسلم وَأَبِي بَكْرٍ وَعُمَرَ - رضى الله عنهما - ثُمَّ سَكَتَ ‏.‏ فَقَالَ لَهُ حُطَيْمٌ وَعُثْمَانُ قَالَ وَعُثْمَانُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1180,
			"arabicnumber": 1180,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، قَالَ حَدَّثَنَا غَيْلاَنُ بْنُ جَرِيرٍ، عَنْ مُطَرِّفِ بْنِ عَبْدِ اللَّهِ، قَالَ صَلَّى عَلِيُّ بْنُ أَبِي طَالِبٍ فَكَانَ يُكَبِّرُ فِي كُلِّ خَفْضٍ وَرَفْعٍ يُتِمُّ التَّكْبِيرَ ‏.‏ فَقَالَ عِمْرَانُ بْنُ حُصَيْنٍ لَقَدْ ذَكَّرَنِي هَذَا صَلاَةَ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1181,
			"arabicnumber": 1181,
			"text": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ، وَمُحَمَّدُ بْنُ بَشَّارٍ، - وَاللَّفْظُ لَهُ - قَالاَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ، قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ عَمْرِو بْنِ عَطَاءٍ، عَنْ أَبِي حُمَيْدٍ السَّاعِدِيِّ، قَالَ سَمِعْتُهُ يُحَدِّثُ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا قَامَ مِنَ السَّجْدَتَيْنِ كَبَّرَ وَرَفَعَ يَدَيْهِ حَتَّى يُحَاذِيَ بِهِمَا مَنْكِبَيْهِ كَمَا صَنَعَ حِينَ افْتَتَحَ الصَّلاَةَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1182,
			"arabicnumber": 1182,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى الصَّنْعَانِيُّ، قَالَ حَدَّثَنَا الْمُعْتَمِرُ، قَالَ سَمِعْتُ عُبَيْدَ اللَّهِ، - وَهُوَ ابْنُ عُمَرَ - عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ كَانَ يَرْفَعُ يَدَيْهِ إِذَا دَخَلَ فِي الصَّلاَةِ وَإِذَا أَرَادَ أَنْ يَرْكَعَ وَإِذَا رَفَعَ رَأْسَهُ مِنَ الرُّكُوعِ وَإِذَا قَامَ مِنَ الرَّكْعَتَيْنِ يَرْفَعُ يَدَيْهِ كَذَلِكَ حَذْوَ الْمَنْكِبَيْنِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1183,
			"arabicnumber": 1183,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ بَزِيعٍ، قَالَ حَدَّثَنَا عَبْدُ الأَعْلَى بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ، - وَهُوَ ابْنُ عُمَرَ - عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، قَالَ انْطَلَقَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصْلِحُ بَيْنَ بَنِي عَمْرِو بْنِ عَوْفٍ فَحَضَرَتِ الصَّلاَةُ فَجَاءَ الْمُؤَذِّنُ إِلَى أَبِي بَكْرٍ فَأَمَرَهُ أَنْ يَجْمَعَ النَّاسَ وَيَؤُمَّهُمْ فَجَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَخَرَقَ الصُّفُوفَ حَتَّى قَامَ فِي الصَّفِّ الْمُقَدَّمِ وَصَفَّحَ النَّاسُ بِأَبِي بَكْرٍ لِيُؤْذِنُوهُ بِرَسُولِ اللَّهِ صلى الله عليه وسلم وَكَانَ أَبُو بَكْرٍ لاَ يَلْتَفِتُ فِي الصَّلاَةِ فَلَمَّا أَكْثَرُوا عَلِمَ أَنَّهُ قَدْ نَابَهُمْ شَىْءٌ فِي صَلاَتِهِمْ فَالْتَفَتَ فَإِذَا هُوَ بِرَسُولِ اللَّهِ صلى الله عليه وسلم فَأَوْمَأَ إِلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم أَىْ كَمَا أَنْتَ فَرَفَعَ أَبُو بَكْرٍ يَدَيْهِ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ لِقَوْلِ رَسُولِ اللَّهِ صلى الله عليه وسلم ثُمَّ رَجَعَ الْقَهْقَرَى وَتَقَدَّمَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَصَلَّى فَلَمَّا انْصَرَفَ قَالَ لأَبِي بَكْرٍ ‏\"‏ مَا مَنَعَكَ إِذْ أَوْمَأْتُ إِلَيْكَ أَنْ تُصَلِّيَ ‏\"‏ ‏.‏ فَقَالَ أَبُو بَكْرٍ رضى الله عنه مَا كَانَ يَنْبَغِي لاِبْنِ أَبِي قُحَافَةَ أَنْ يَؤُمَّ رَسُولَ اللَّهِ صلى الله عليه وسلم ‏.‏ ثُمَّ قَالَ لِلنَّاسِ ‏\"‏ مَا بَالُكُمْ صَفَّحْتُمْ إِنَّمَا التَّصْفِيحُ لِلنِّسَاءِ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ إِذَا نَابَكُمْ شَىْءٌ فِي صَلاَتِكُمْ فَسَبِّحُوا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1184,
			"arabicnumber": 1184,
			"text": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا عَبْثَرٌ، عَنِ الأَعْمَشِ، عَنِ الْمُسَيَّبِ بْنِ رَافِعٍ، عَنْ تَمِيمِ بْنِ طَرَفَةَ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ خَرَجَ عَلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَنَحْنُ رَافِعُو أَيْدِينَا فِي الصَّلاَةِ فَقَالَ ‏ \"‏ مَا بَالُهُمْ رَافِعِينَ أَيْدِيَهُمْ فِي الصَّلاَةِ كَأَنَّهَا أَذْنَابُ الْخَيْلِ الشُّمُسِ اسْكُنُوا فِي الصَّلاَةِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1185,
			"arabicnumber": 1185,
			"text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ، عَنْ مِسْعَرٍ، عَنْ عُبَيْدِ اللَّهِ ابْنِ الْقِبْطِيَّةِ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ كُنَّا نُصَلِّي خَلْفَ النَّبِيِّ صلى الله عليه وسلم فَنُسَلِّمُ بِأَيْدِينَا فَقَالَ ‏ \"‏ مَا بَالُ هَؤُلاَءِ يُسَلِّمُونَ بِأَيْدِيهِمْ كَأَنَّهَا أَذْنَابُ خَيْلٍ شُمْسٍ أَمَا يَكْفِي أَحَدَهُمْ أَنْ يَضَعَ يَدَهُ عَلَى فَخِذِهِ ثُمَّ يَقُولَ السَّلاَمُ عَلَيْكُمُ السَّلاَمُ عَلَيْكُمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1186,
			"arabicnumber": 1186,
			"text": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ بُكَيْرٍ، عَنْ نَابِلٍ، صَاحِبِ الْعَبَاءِ عَنِ ابْنِ عُمَرَ، عَنْ صُهَيْبٍ، صَاحِبِ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ مَرَرْتُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَهُوَ يُصَلِّي فَسَلَّمْتُ عَلَيْهِ فَرَدَّ عَلَىَّ إِشَارَةً وَلاَ أَعْلَمُ إِلاَّ أَنَّهُ قَالَ بِإِصْبَعِهِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1187,
			"arabicnumber": 1187,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ الْمَكِّيُّ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ زَيْدِ بْنِ أَسْلَمَ، قَالَ قَالَ ابْنُ عُمَرَ دَخَلَ النَّبِيُّ صلى الله عليه وسلم مَسْجِدَ قُبَاءَ لِيُصَلِّيَ فِيهِ فَدَخَلَ عَلَيْهِ رِجَالٌ يُسَلِّمُونَ عَلَيْهِ فَسَأَلْتُ صُهَيْبًا وَكَانَ مَعَهُ كَيْفَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَصْنَعُ إِذَا سُلِّمَ عَلَيْهِ قَالَ كَانَ يُشِيرُ بِيَدِهِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1188,
			"arabicnumber": 1188,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا وَهْبٌ، - يَعْنِي ابْنَ جَرِيرٍ - قَالَ حَدَّثَنَا أَبِي، عَنْ قَيْسِ بْنِ سَعْدٍ، عَنْ عَطَاءٍ، عَنْ مُحَمَّدِ بْنِ عَلِيٍّ، عَنْ عَمَّارِ بْنِ يَاسِرٍ، أَنَّهُ سَلَّمَ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَهُوَ يُصَلِّي فَرَدَّ عَلَيْهِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1189,
			"arabicnumber": 1189,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ بَعَثَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم لِحَاجَةٍ ثُمَّ أَدْرَكْتُهُ وَهُوَ يُصَلِّي فَسَلَّمْتُ عَلَيْهِ فَأَشَارَ إِلَىَّ فَلَمَّا فَرَغَ دَعَانِي فَقَالَ ‏ \"‏ إِنَّكَ سَلَّمْتَ عَلَىَّ آنِفًا وَأَنَا أُصَلِّي ‏\"‏ ‏.‏ وَإِنَّمَا هُوَ مُوَجَّهٌ يَوْمَئِذٍ إِلَى الْمَشْرِقِ",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1190,
			"arabicnumber": 1190,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ هَاشِمٍ الْبَعْلَبَكِّيُّ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ شُعَيْبِ بْنِ شَابُورٍ، عَنْ عَمْرِو بْنِ الْحَارِثِ، قَالَ أَخْبَرَنِي أَبُو الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ بَعَثَنِي النَّبِيُّ صلى الله عليه وسلم فَأَتَيْتُهُ وَهُوَ يَسِيرُ مُشَرِّقًا أَوْ مُغَرِّبًا فَسَلَّمْتُ عَلَيْهِ فَأَشَارَ بِيَدِهِ ثُمَّ سَلَّمْتُ عَلَيْهِ فَأَشَارَ بِيَدِهِ فَانْصَرَفْتُ فَنَادَانِي ‏\"‏ يَا جَابِرُ ‏\"‏ ‏.‏ فَنَادَانِي النَّاسُ يَا جَابِرُ ‏.‏ فَأَتَيْتُهُ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي سَلَّمْتُ عَلَيْكَ فَلَمْ تَرُدَّ عَلَىَّ ‏.‏ فَقَالَ ‏\"‏ إِنِّي كُنْتُ أُصَلِّي ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1191,
			"arabicnumber": 1191,
			"text": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَالْحُسَيْنُ بْنُ حُرَيْثٍ، - وَاللَّفْظُ لَهُ - عَنْ سُفْيَانَ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي الأَحْوَصِ، عَنْ أَبِي ذَرٍّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا قَامَ أَحَدُكُمْ فِي الصَّلاَةِ فَلاَ يَمْسَحِ الْحَصَى فَإِنَّ الرَّحْمَةَ تُوَاجِهُهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1192,
			"arabicnumber": 1192,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنِ الأَوْزَاعِيِّ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، قَالَ حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، قَالَ حَدَّثَنِي مُعَيْقِيبٌ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنْ كُنْتَ لاَ بُدَّ فَاعِلاً فَمَرَّةً ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1193,
			"arabicnumber": 1193,
			"text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، وَشُعَيْبُ بْنُ يُوسُفَ، عَنْ يَحْيَى، - وَهُوَ ابْنُ سَعِيدٍ الْقَطَّانُ - عَنِ ابْنِ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَا بَالُ أَقْوَامٍ يَرْفَعُونَ أَبْصَارَهُمْ إِلَى السَّمَاءِ فِي صَلاَتِهِمْ ‏\"‏ ‏.‏ فَاشْتَدَّ قَوْلُهُ فِي ذَلِكَ حَتَّى قَالَ ‏\"‏ لَيَنْتَهُنَّ عَنْ ذَلِكَ أَوْ لَتُخْطَفَنَّ أَبْصَارُهُمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1194,
			"arabicnumber": 1194,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَجُلاً، مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم حَدَّثَهُ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِذَا كَانَ أَحَدُكُمْ فِي الصَّلاَةِ فَلاَ يَرْفَعْ بَصَرَهُ إِلَى السَّمَاءِ أَنْ يُلْتَمَعَ بَصَرُهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1195,
			"arabicnumber": 1195,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ يُونُسَ، عَنِ الزُّهْرِيِّ، قَالَ سَمِعْتُ أَبَا الأَحْوَصِ، يُحَدِّثُنَا فِي مَجْلِسِ سَعِيدِ بْنِ الْمُسَيَّبِ وَابْنُ الْمُسَيَّبِ جَالِسٌ أَنَّهُ سَمِعَ أَبَا ذَرٍّ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ يَزَالُ اللَّهُ عَزَّ وَجَلَّ مُقْبِلاً عَلَى الْعَبْدِ فِي صَلاَتِهِ مَا لَمْ يَلْتَفِتْ فَإِذَا صَرَفَ وَجْهَهُ انْصَرَفَ عَنْهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1196,
			"arabicnumber": 1196,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا زَائِدَةُ، عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ، عَنْ أَبِيهِ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، - رضى الله عنها - قَالَتْ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ الاِلْتِفَاتِ فِي الصَّلاَةِ فَقَالَ ‏ \"‏ اخْتِلاَسٌ يَخْتَلِسُهُ الشَّيْطَانُ مِنَ الصَّلاَةِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1197,
			"arabicnumber": 1197,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ أَشْعَثَ، عَنْ أَبِيهِ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1198,
			"arabicnumber": 1198,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا إِسْرَائِيلُ، عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ، عَنْ أَبِي عَطِيَّةَ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1199,
			"arabicnumber": 1199,
			"text": "أَخْبَرَنَا هِلاَلُ بْنُ الْعَلاَءِ بْنِ هِلاَلٍ، قَالَ حَدَّثَنَا الْمُعَافَى بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا الْقَاسِمُ، - وَهُوَ ابْنُ مَعْنٍ - عَنِ الأَعْمَشِ، عَنْ عُمَارَةَ، عَنْ أَبِي عَطِيَّةَ، قَالَ قَالَتْ عَائِشَةُ إِنَّ الاِلْتِفَاتَ فِي الصَّلاَةِ اخْتِلاَسٌ يَخْتَلِسُهُ الشَّيْطَانُ مِنَ الصَّلاَةِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1200,
			"arabicnumber": 1200,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّهُ قَالَ اشْتَكَى رَسُولُ اللَّهِ صلى الله عليه وسلم فَصَلَّيْنَا وَرَاءَهُ وَهُوَ قَاعِدٌ وَأَبُو بَكْرٍ يُكَبِّرُ يُسْمِعُ النَّاسَ تَكْبِيرَهُ فَالْتَفَتَ إِلَيْنَا فَرَآنَا قِيَامًا فَأَشَارَ إِلَيْنَا فَقَعَدْنَا فَصَلَّيْنَا بِصَلاَتِهِ قُعُودًا فَلَمَّا سَلَّمَ قَالَ ‏ \"‏ إِنْ كُنْتُمْ آنِفًا تَفْعَلُونَ فِعْلَ فَارِسَ وَالرُّومِ يَقُومُونَ عَلَى مُلُوكِهِمْ وَهُمْ قُعُودٌ فَلاَ تَفْعَلُوا ائْتَمُّوا بِأَئِمَّتِكُمْ إِنْ صَلَّى قَائِمًا فَصَلُّوا قِيَامًا وَإِنْ صَلَّى قَاعِدًا فَصَلُّوا قُعُودًا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1201,
			"arabicnumber": 1201,
			"text": "أَخْبَرَنَا أَبُو عَمَّارٍ الْحُسَيْنُ بْنُ حُرَيْثٍ، قَالَ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى، عَنْ عَبْدِ اللَّهِ بْنِ سَعِيدِ بْنِ أَبِي هِنْدٍ، عَنْ ثَوْرِ بْنِ زَيْدٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَلْتَفِتُ فِي صَلاَتِهِ يَمِينًا وَشِمَالاً وَلاَ يَلْوِي عُنُقَهُ خَلْفَ ظَهْرِهِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1202,
			"arabicnumber": 1202,
			"text": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ سُفْيَانَ، وَيَزِيدَ، - وَهُوَ ابْنُ زُرَيْعٍ - عَنْ مَعْمَرٍ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ ضَمْضَمِ بْنِ جَوْسٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ أَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِقَتْلِ الأَسْوَدَيْنِ فِي الصَّلاَةِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1203,
			"arabicnumber": 1203,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ، قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ أَبُو دَاوُدَ، قَالَ حَدَّثَنَا هِشَامٌ، - وَهُوَ ابْنُ أَبِي عَبْدِ اللَّهِ - عَنْ مَعْمَرٍ، عَنْ يَحْيَى، عَنْ ضَمْضَمٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَمَرَ بِقَتْلِ الأَسْوَدَيْنِ فِي الصَّلاَةِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1204,
			"arabicnumber": 1204,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا مَالِكٌ، عَنْ عَامِرِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، عَنْ عَمْرِو بْنِ سُلَيْمٍ، عَنْ أَبِي قَتَادَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُصَلِّي وَهُوَ حَامِلٌ أُمَامَةَ فَإِذَا سَجَدَ وَضَعَهَا وَإِذَا قَامَ رَفَعَهَا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1205,
			"arabicnumber": 1205,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عُثْمَانَ بْنِ أَبِي سُلَيْمَانَ، عَنْ عَامِرِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، عَنْ عَمْرِو بْنِ سُلَيْمٍ، عَنْ أَبِي قَتَادَةَ، قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَؤُمُّ النَّاسَ وَهُوَ حَامِلٌ أُمَامَةَ بِنْتَ أَبِي الْعَاصِ عَلَى عَاتِقِهِ فَإِذَا رَكَعَ وَضَعَهَا فَإِذَا فَرَغَ مِنْ سُجُودِهِ أَعَادَهَا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1206,
			"arabicnumber": 1206,
			"text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا حَاتِمُ بْنُ وَرْدَانَ، قَالَ حَدَّثَنَا بُرْدُ بْنُ سِنَانَ أَبُو الْعَلاَءِ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، - رضى الله عنها - قَالَتِ اسْتَفْتَحْتُ الْبَابَ وَرَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي تَطَوُّعًا وَالْبَابُ عَلَى الْقِبْلَةِ فَمَشَى عَنْ يَمِينِهِ أَوْ عَنْ يَسَارِهِ فَفَتَحَ الْبَابَ ثُمَّ رَجَعَ إِلَى مُصَلاَّهُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1207,
			"arabicnumber": 1207,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، - وَاللَّفْظُ لَهُ - قَالاَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ التَّسْبِيحُ لِلرِّجَالِ وَالتَّصْفِيقُ لِلنِّسَاءِ ‏\"‏ ‏.‏ زَادَ ابْنُ الْمُثَنَّى ‏\"‏ فِي الصَّلاَةِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1208,
			"arabicnumber": 1208,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، وَأَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ أَنَّهُمَا سَمِعَا أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ التَّسْبِيحُ لِلرِّجَالِ وَالتَّصْفِيقُ لِلنِّسَاءِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1209,
			"arabicnumber": 1209,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا الْفُضَيْلُ بْنُ عِيَاضٍ، عَنِ الأَعْمَشِ، ح وَأَنْبَأَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ سُلَيْمَانَ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ التَّسْبِيحُ لِلرِّجَالِ وَالتَّصْفِيقُ لِلنِّسَاءِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1210,
			"arabicnumber": 1210,
			"text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ عَوْفٍ، قَالَ حَدَّثَنِي مُحَمَّدٌ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ التَّسْبِيحُ لِلرِّجَالِ وَالتَّصْفِيقُ لِلنِّسَاءِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1211,
			"arabicnumber": 1211,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ قُدَامَةَ، قَالَ حَدَّثَنَا جَرِيرٌ، عَنِ الْمُغِيرَةِ، عَنِ الْحَارِثِ الْعُكْلِيِّ، عَنْ أَبِي زُرْعَةَ بْنِ عَمْرِو بْنِ جَرِيرٍ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُجَىٍّ، عَنْ عَلِيٍّ، قَالَ كَانَ لِي مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم سَاعَةٌ آتِيهِ فِيهَا فَإِذَا أَتَيْتُهُ اسْتَأْذَنْتُ إِنْ وَجَدْتُهُ يُصَلِّي فَتَنَحْنَحَ دَخَلْتُ وَإِنْ وَجَدْتُهُ فَارِغًا أَذِنَ لِي ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1212,
			"arabicnumber": 1212,
			"text": "أَخْبَرَنِي مُحَمَّدُ بْنُ عُبَيْدٍ، قَالَ حَدَّثَنَا ابْنُ عَيَّاشٍ، عَنْ مُغِيرَةَ، عَنِ الْحَارِثِ الْعُكْلِيِّ، عَنِ ابْنِ نُجَىٍّ، قَالَ قَالَ عَلِيٌّ كَانَ لِي مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم مَدْخَلاَنِ مَدْخَلٌ بِاللَّيْلِ وَمَدْخَلٌ بِالنَّهَارِ فَكُنْتُ إِذَا دَخَلْتُ بِاللَّيْلِ تَنَحْنَحَ لِي ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1213,
			"arabicnumber": 1213,
			"text": "أَخْبَرَنَا الْقَاسِمُ بْنُ زَكَرِيَّا بْنِ دِينَارٍ، قَالَ حَدَّثَنَا أَبُو أُسَامَةَ، قَالَ حَدَّثَنِي شُرَحْبِيلُ، - يَعْنِي ابْنَ مُدْرِكٍ - قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ نُجَىٍّ، عَنْ أَبِيهِ، قَالَ قَالَ لِي عَلِيٌّ كَانَتْ لِي مَنْزِلَةٌ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم لَمْ تَكُنْ لأَحَدٍ مِنَ الْخَلاَئِقِ فَكُنْتُ آتِيهِ كُلَّ سَحَرٍ فَأَقُولُ السَّلاَمُ عَلَيْكَ يَا نَبِيَّ اللَّهِ فَإِنْ تَنَحْنَحَ انْصَرَفْتُ إِلَى أَهْلِي وَإِلاَّ دَخَلْتُ عَلَيْهِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1214,
			"arabicnumber": 1214,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ حَمَّادِ بْنِ سَلَمَةَ، عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنْ مُطَرِّفٍ، عَنْ أَبِيهِ، قَالَ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم وَهُوَ يُصَلِّي وَلِجَوْفِهِ أَزِيزٌ كَأَزِيزِ الْمِرْجَلِ يَعْنِي يَبْكِي ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1215,
			"arabicnumber": 1215,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، عَنِ ابْنِ وَهْبٍ، عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ، قَالَ حَدَّثَنِي رَبِيعَةُ بْنُ يَزِيدَ، عَنْ أَبِي إِدْرِيسَ الْخَوْلاَنِيِّ، عَنْ أَبِي الدَّرْدَاءِ، قَالَ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي فَسَمِعْنَاهُ يَقُولُ ‏\"‏ أَعُوذُ بِاللَّهِ مِنْكَ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ أَلْعَنُكَ بِلَعْنَةِ اللَّهِ ‏\"‏ ‏.‏ ثَلاَثًا وَبَسَطَ يَدَهُ كَأَنَّهُ يَتَنَاوَلُ شَيْئًا فَلَمَّا فَرَغَ مِنَ الصَّلاَةِ قُلْنَا يَا رَسُولَ اللَّهِ قَدْ سَمِعْنَاكَ تَقُولُ فِي الصَّلاَةِ شَيْئًا لَمْ نَسْمَعْكَ تَقُولُهُ قَبْلَ ذَلِكَ وَرَأَيْنَاكَ بَسَطْتَ يَدَكَ ‏.‏ قَالَ ‏\"‏ إِنَّ عَدُوَّ اللَّهِ إِبْلِيسَ جَاءَ بِشِهَابٍ مِنْ نَارٍ لِيَجْعَلَهُ فِي وَجْهِي فَقُلْتُ أَعُوذُ بِاللَّهِ مِنْكَ ثَلاَثَ مَرَّاتٍ ثُمَّ قُلْتُ أَلْعَنُكَ بِلَعْنَةِ اللَّهِ فَلَمْ يَسْتَأْخِرْ ثَلاَثَ مَرَّاتٍ ثُمَّ أَرَدْتُ أَنْ آخُذَهُ وَاللَّهِ لَوْلاَ دَعْوَةُ أَخِينَا سُلَيْمَانَ لأَصْبَحَ مُوثَقًا بِهَا يَلْعَبُ بِهِ وِلْدَانُ أَهْلِ الْمَدِينَةِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1216,
			"arabicnumber": 1216,
			"text": "أَخْبَرَنَا كَثِيرُ بْنُ عُبَيْدٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ، عَنِ الزُّبَيْدِيِّ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى الصَّلاَةِ وَقُمْنَا مَعَهُ فَقَالَ أَعْرَابِيٌّ وَهُوَ فِي الصَّلاَةِ اللَّهُمَّ ارْحَمْنِي وَمُحَمَّدًا وَلاَ تَرْحَمْ مَعَنَا أَحَدًا ‏.‏ فَلَمَّا سَلَّمَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ لِلأَعْرَابِيِّ ‏ \"‏ لَقَدْ تَحَجَّرْتَ وَاسِعًا ‏\"‏ ‏.‏ يُرِيدُ رَحْمَةَ اللَّهِ عَزَّ وَجَلَّ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1217,
			"arabicnumber": 1217,
			"text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ الزُّهْرِيُّ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ أَحْفَظُهُ مِنَ الزُّهْرِيِّ قَالَ أَخْبَرَنِي سَعِيدٌ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ أَعْرَابِيًّا، دَخَلَ الْمَسْجِدَ فَصَلَّى رَكْعَتَيْنِ ثُمَّ قَالَ اللَّهُمَّ ارْحَمْنِي وَمُحَمَّدًا وَلاَ تَرْحَمْ مَعَنَا أَحَدًا ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لَقَدْ تَحَجَّرْتَ وَاسِعًا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1218,
			"arabicnumber": 1218,
			"text": "أَخْبَرَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، قَالَ حَدَّثَنَا الأَوْزَاعِيُّ، قَالَ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ، عَنْ هِلاَلِ بْنِ أَبِي مَيْمُونَةَ، قَالَ حَدَّثَنِي عَطَاءُ بْنُ يَسَارٍ، عَنْ مُعَاوِيَةَ بْنِ الْحَكَمِ السُّلَمِيِّ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ إِنَّا حَدِيثُ عَهْدٍ بِجَاهِلِيَّةٍ فَجَاءَ اللَّهُ بِالإِسْلاَمِ وَإِنَّ رِجَالاً مِنَّا يَتَطَيَّرُونَ ‏.‏ قَالَ ‏\"‏ ذَاكَ شَىْءٌ يَجِدُونَهُ فِي صُدُورِهِمْ فَلاَ يَصُدَّنَّهُمْ ‏\"‏ ‏.‏ وَرِجَالٌ مِنَّا يَأْتُونَ الْكُهَّانَ ‏.‏ قَالَ ‏\"‏ فَلاَ تَأْتُوهُمْ ‏\"‏ ‏.‏ قَالَ يَا رَسُولَ اللَّهِ وَرِجَالٌ مِنَّا يَخُطُّونَ ‏.‏ قَالَ ‏\"‏ كَانَ نَبِيٌّ مِنَ الأَنْبِيَاءِ يَخُطُّ فَمَنْ وَافَقَ خَطُّهُ فَذَاكَ ‏\"‏ ‏.‏ قَالَ وَبَيْنَا أَنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي الصَّلاَةِ إِذْ عَطَسَ رَجُلٌ مِنَ الْقَوْمِ فَقُلْتُ يَرْحَمُكَ اللَّهُ فَحَدَّقَنِي الْقَوْمُ بِأَبْصَارِهِمْ فَقُلْتُ وَاثُكْلَ أُمِّيَاهُ مَا لَكُمْ تَنْظُرُونَ إِلَىَّ قَالَ فَضَرَبَ الْقَوْمُ بِأَيْدِيهِمْ عَلَى أَفْخَاذِهِمْ فَلَمَّا رَأَيْتُهُمْ يُسَكِّتُونِي لَكِنِّي سَكَتُّ فَلَمَّا انْصَرَفَ رَسُولُ اللَّهِ صلى الله عليه وسلم دَعَانِي بِأَبِي وَأُمِّي هُوَ مَا ضَرَبَنِي وَلاَ كَهَرَنِي وَلاَ سَبَّنِي مَا رَأَيْتُ مُعَلِّمًا قَبْلَهُ وَلاَ بَعْدَهُ أَحْسَنَ تَعْلِيمًا مِنْهُ قَالَ ‏\"‏ إِنَّ صَلاَتَنَا هَذِهِ لاَ يَصْلُحُ فِيهَا شَىْءٌ مِنْ كَلاَمِ النَّاسِ إِنَّمَا هُوَ التَّسْبِيحُ وَالتَّكْبِيرُ وَتِلاَوَةُ الْقُرْآنِ ‏\"‏ ‏.‏ قَالَ ثُمَّ اطَّلَعْتُ إِلَى غُنَيْمَةٍ لِي تَرْعَاهَا جَارِيَةٌ لِي فِي قِبَلِ أُحُدٍ وَالْجَوَّانِيَّةِ وَإِنِّي اطَّلَعْتُ فَوَجَدْتُ الذِّئْبَ قَدْ ذَهَبَ مِنْهَا بِشَاةٍ وَأَنَا رَجُلٌ مِنْ بَنِي آدَمَ آسَفُ كَمَا يَأْسَفُونَ فَصَكَكْتُهَا صَكَّةً ثُمَّ انْصَرَفْتُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَخْبَرْتُهُ فَعَظَّمَ ذَلِكَ عَلَىَّ فَقُلْتُ يَا رَسُولَ اللَّهِ أَفَلاَ أَعْتِقُهَا قَالَ ‏\"‏ ادْعُهَا ‏\"‏ ‏.‏ فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَيْنَ اللَّهُ عَزَّ وَجَلَّ ‏\"‏ ‏.‏ قَالَتْ فِي السَّمَاءِ ‏.‏ قَالَ ‏\"‏ فَمَنْ أَنَا ‏\"‏ ‏.‏ قَالَتْ أَنْتَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏ قَالَ ‏\"‏ إِنَّهَا مُؤْمِنَةٌ فَاعْتِقْهَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1219,
			"arabicnumber": 1219,
			"text": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي خَالِدٍ، قَالَ حَدَّثَنِي الْحَارِثُ بْنُ شُبَيْلٍ، عَنْ أَبِي عَمْرٍو الشَّيْبَانِيِّ، عَنْ زَيْدِ بْنِ أَرْقَمَ، قَالَ كَانَ الرَّجُلُ يُكَلِّمُ صَاحِبَهُ فِي الصَّلاَةِ بِالْحَاجَةِ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم حَتَّى نَزَلَتْ هَذِهِ الآيَةُ ‏{‏ حَافِظُوا عَلَى الصَّلَوَاتِ وَالصَّلاَةِ الْوُسْطَى وَقُومُوا لِلَّهِ قَانِتِينَ ‏}‏ فَأُمِرْنَا بِالسُّكُوتِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1220,
			"arabicnumber": 1220,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَمَّارٍ، قَالَ حَدَّثَنَا ابْنُ أَبِي غَنِيَّةَ، - وَاسْمُهُ يَحْيَى بْنُ عَبْدِ الْمَلِكِ - وَالْقَاسِمُ بْنُ يَزِيدَ الْجَرْمِيُّ عَنْ سُفْيَانَ، عَنِ الزُّبَيْرِ بْنِ عَدِيٍّ، عَنْ كُلْثُومٍ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، - وَهَذَا حَدِيثُ الْقَاسِمِ - قَالَ كُنْتُ آتِي النَّبِيَّ صلى الله عليه وسلم وَهُوَ يُصَلِّي فَأُسَلِّمُ عَلَيْهِ فَيَرُدُّ عَلَىَّ فَأَتَيْتُهُ فَسَلَّمْتُ عَلَيْهِ وَهُوَ يُصَلِّي فَلَمْ يَرُدَّ عَلَىَّ فَلَمَّا سَلَّمَ أَشَارَ إِلَى الْقَوْمِ فَقَالَ ‏ \"‏ إِنَّ اللَّهَ عَزَّ وَجَلَّ - يَعْنِي - أَحْدَثَ فِي الصَّلاَةِ أَنْ لاَ تَكَلَّمُوا إِلاَّ بِذِكْرِ اللَّهِ وَمَا يَنْبَغِي لَكُمْ وَأَنْ تَقُومُوا لِلَّهِ قَانِتِينَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1221,
			"arabicnumber": 1221,
			"text": "أَخْبَرَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَاصِمٍ، عَنْ أَبِي وَائِلٍ، عَنِ ابْنِ مَسْعُودٍ، قَالَ كُنَّا نُسَلِّمُ عَلَى النَّبِيِّ صلى الله عليه وسلم فَيَرُدُّ عَلَيْنَا السَّلاَمَ حَتَّى قَدِمْنَا مِنْ أَرْضِ الْحَبَشَةِ فَسَلَّمْتُ عَلَيْهِ فَلَمْ يَرُدَّ عَلَىَّ فَأَخَذَنِي مَا قَرُبَ وَمَا بَعُدَ فَجَلَسْتُ حَتَّى إِذَا قَضَى الصَّلاَةَ قَالَ ‏ \"‏ إِنَّ اللَّهَ عَزَّ وَجَلَّ يُحْدِثُ مِنْ أَمْرِهِ مَا يَشَاءُ وَإِنَّهُ قَدْ أَحْدَثَ مِنْ أَمْرِهِ أَنْ لاَ يُتَكَلَّمَ فِي الصَّلاَةِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1222,
			"arabicnumber": 1222,
			"text": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ الرَّحْمَنِ الأَعْرَجِ، عَنْ عَبْدِ اللَّهِ ابْنِ بُحَيْنَةَ، قَالَ صَلَّى لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم رَكْعَتَيْنِ ثُمَّ قَامَ فَلَمْ يَجْلِسْ فَقَامَ النَّاسُ مَعَهُ فَلَمَّا قَضَى صَلاَتَهُ وَنَظَرْنَا تَسْلِيمَهُ كَبَّرَ فَسَجَدَ سَجْدَتَيْنِ وَهُوَ جَالِسٌ قَبْلَ التَّسْلِيمِ ثُمَّ سَلَّمَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1223,
			"arabicnumber": 1223,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ هُرْمُزَ، عَنْ عَبْدِ اللَّهِ ابْنِ بُحَيْنَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَامَ فِي الصَّلاَةِ وَعَلَيْهِ جُلُوسٌ فَسَجَدَ سَجْدَتَيْنِ وَهُوَ جَالِسٌ قَبْلَ التَّسْلِيمِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1224,
			"arabicnumber": 1224,
			"text": "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، قَالَ حَدَّثَنَا يَزِيدُ، - وَهُوَ ابْنُ زُرَيْعٍ - قَالَ حَدَّثَنَا ابْنُ عَوْنٍ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، قَالَ قَالَ أَبُو هُرَيْرَةَ صَلَّى بِنَا النَّبِيُّ صلى الله عليه وسلم إِحْدَى صَلاَتَىِ الْعَشِيِّ ‏.‏ قَالَ قَالَ أَبُو هُرَيْرَةَ وَلَكِنِّي نَسِيتُ - قَالَ - فَصَلَّى بِنَا رَكْعَتَيْنِ ثُمَّ سَلَّمَ فَانْطَلَقَ إِلَى خَشَبَةٍ مَعْرُوضَةٍ فِي الْمَسْجِدِ فَقَالَ بِيَدِهِ عَلَيْهَا كَأَنَّهُ غَضْبَانُ وَخَرَجَتِ السَّرَعَانُ مِنْ أَبْوَابِ الْمَسْجِدِ فَقَالُوا قُصِرَتِ الصَّلاَةُ وَفِي الْقَوْمِ أَبُو بَكْرٍ وَعُمَرُ - رضى الله عنهما - فَهَابَاهُ أَنْ يُكَلِّمَاهُ وَفِي الْقَوْمِ رَجُلٌ فِي يَدَيْهِ طُولٌ قَالَ كَانَ يُسَمَّى ذَا الْيَدَيْنِ فَقَالَ يَا رَسُولَ اللَّهِ أَنَسِيتَ أَمْ قُصِرَتِ الصَّلاَةُ قَالَ ‏\"‏ لَمْ أَنْسَ وَلَمْ تُقْصَرِ الصَّلاَةُ ‏\"‏ ‏.‏ قَالَ وَقَالَ ‏\"‏ أَكَمَا قَالَ ذُو الْيَدَيْنِ ‏\"‏ ‏.‏ قَالُوا نَعَمْ ‏.‏ فَجَاءَ فَصَلَّى الَّذِي كَانَ تَرَكَهُ ثُمَّ سَلَّمَ ثُمَّ كَبَّرَ فَسَجَدَ مِثْلَ سُجُودِهِ أَوْ أَطْوَلَ ثُمَّ رَفَعَ رَأْسَهُ وَكَبَّرَ ثُمَّ سَجَدَ مِثْلَ سُجُودِهِ أَوْ أَطْوَلَ ثُمَّ رَفَعَ رَأْسَهُ ثُمَّ كَبَّرَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1225,
			"arabicnumber": 1225,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، قَالَ حَدَّثَنَا ابْنُ الْقَاسِمِ، عَنْ مَالِكٍ، قَالَ حَدَّثَنِي أَيُّوبُ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم انْصَرَفَ مِنَ اثْنَتَيْنِ فَقَالَ لَهُ ذُو الْيَدَيْنِ أَقُصِرَتِ الصَّلاَةُ أَمْ نَسِيتَ يَا رَسُولَ اللَّهِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَصَدَقَ ذُو الْيَدَيْنِ ‏\"‏ ‏.‏ فَقَالَ النَّاسُ نَعَمْ ‏.‏ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَصَلَّى اثْنَتَيْنِ ثُمَّ سَلَّمَ ثُمَّ كَبَّرَ فَسَجَدَ مِثْلَ سُجُودِهِ أَوْ أَطْوَلَ ثُمَّ رَفَعَ رَأْسَهُ ثُمَّ سَجَدَ مِثْلَ سُجُودِهِ أَوْ أَطْوَلَ ثُمَّ رَفَعَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1226,
			"arabicnumber": 1226,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ دَاوُدَ بْنِ الْحُصَيْنِ، عَنْ أَبِي سُفْيَانَ، مَوْلَى ابْنِ أَبِي أَحْمَدَ أَنَّهُ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ صَلَّى بِنَا رَسُولُ اللَّهِ صلى الله عليه وسلم صَلاَةَ الْعَصْرِ فَسَلَّمَ فِي رَكْعَتَيْنِ فَقَامَ ذُو الْيَدَيْنِ فَقَالَ أَقُصِرَتِ الصَّلاَةُ يَا رَسُولَ اللَّهِ أَمْ نَسِيتَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ كُلُّ ذَلِكَ لَمْ يَكُنْ ‏\"‏ ‏.‏ فَقَالَ قَدْ كَانَ بَعْضُ ذَلِكَ يَا رَسُولَ اللَّهِ ‏.‏ فَأَقْبَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى النَّاسِ فَقَالَ ‏\"‏ أَصَدَقَ ذُو الْيَدَيْنِ ‏\"‏ ‏.‏ فَقَالُوا نَعَمْ ‏.‏ فَأَتَمَّ رَسُولُ اللَّهِ صلى الله عليه وسلم مَا بَقِيَ مِنَ الصَّلاَةِ ثُمَّ سَجَدَ سَجْدَتَيْنِ وَهُوَ جَالِسٌ بَعْدَ التَّسْلِيمِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1227,
			"arabicnumber": 1227,
			"text": "أَخْبَرَنَا سُلَيْمَانُ بْنُ عُبَيْدِ اللَّهِ، قَالَ حَدَّثَنَا بَهْزُ بْنُ أَسَدٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، أَنَّهُ سَمِعَ أَبَا سَلَمَةَ، يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى صَلاَةَ الظُّهْرِ رَكْعَتَيْنِ ثُمَّ سَلَّمَ فَقَالُوا أَقُصِرَتِ الصَّلاَةُ فَقَامَ وَصَلَّى رَكْعَتَيْنِ ثُمَّ سَلَّمَ ثُمَّ سَجَدَ سَجْدَتَيْنِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 1228,
			"arabicnumber": 1228,
			"text": "أَخْبَرَنَا عِيسَى بْنُ حَمَّادٍ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ عِمْرَانَ بْنِ أَبِي أَنَسٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى يَوْمًا فَسَلَّمَ فِي رَكْعَتَيْنِ ثُمَّ انْصَرَفَ فَأَدْرَكَهُ ذُو الشِّمَالَيْنِ فَقَالَ يَا رَسُولَ اللَّهِ أَنُقِصَتِ الصَّلاَةُ أَمْ نَسِيتَ فَقَالَ ‏\"‏ لَمْ تُنْقَصِ الصَّلاَةُ وَلَمْ أَنْسَ ‏\"‏ ‏.‏ قَالَ بَلَى وَالَّذِي بَعَثَكَ بِالْحَقِّ ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَصَدَقَ ذُو الْيَدَيْنِ ‏\"‏ ‏.‏ قَالُوا نَعَمْ ‏.‏ فَصَلَّى بِالنَّاسِ رَكْعَتَيْنِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 1229,
			"arabicnumber": 1229,
			"text": "أَخْبَرَنَا هَارُونُ بْنُ مُوسَى الْفَرْوِيُّ، قَالَ حَدَّثَنِي أَبُو ضَمْرَةَ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ نَسِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَسَلَّمَ فِي سَجْدَتَيْنِ ‏.‏ فَقَالَ لَهُ ذُو الشِّمَالَيْنِ أَقُصِرَتِ الصَّلاَةُ أَمْ نَسِيتَ يَا رَسُولَ اللَّهِ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَصَدَقَ ذُو الْيَدَيْنِ ‏\"‏ ‏.‏ قَالُوا نَعَمْ ‏.‏ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَتَمَّ الصَّلاَةَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 1230,
			"arabicnumber": 1230,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ أَنْبَأَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، وَأَبِي، بَكْرِ بْنِ سُلَيْمَانَ بْنِ أَبِي حَثْمَةَ عَنْ أَبِي هُرَيْرَةَ، قَالَ صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم الظُّهْرَ أَوِ الْعَصْرَ فَسَلَّمَ فِي رَكْعَتَيْنِ وَانْصَرَفَ ‏.‏ فَقَالَ لَهُ ذُو الشِّمَالَيْنِ بْنُ عَمْرٍو أَنُقِصَتِ الصَّلاَةُ أَمْ نَسِيتَ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ مَا يَقُولُ ذُو الْيَدَيْنِ ‏\"‏ ‏.‏ فَقَالُوا صَدَقَ يَا نَبِيَّ اللَّهِ ‏.‏ فَأَتَمَّ بِهِمُ الرَّكْعَتَيْنِ اللَّتَيْنِ نَقَصَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 1231,
			"arabicnumber": 1231,
			"text": "أَخْبَرَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا يَعْقُوبُ، قَالَ حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ أَبَا بَكْرِ بْنَ سُلَيْمَانَ بْنِ أَبِي حَثْمَةَ، أَخْبَرَهُ أَنَّهُ، بَلَغَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى رَكْعَتَيْنِ فَقَالَ لَهُ ذُو الشِّمَالَيْنِ نَحْوَهُ ‏.‏ قَالَ ابْنُ شِهَابٍ أَخْبَرَنِي هَذَا الْخَبَرَ سَعِيدُ بْنُ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ ‏.‏ قَالَ وَأَخْبَرَنِيهِ أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ وَأَبُو بَكْرِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ وَعُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 1232,
			"arabicnumber": 1232,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ، قَالَ حَدَّثَنَا شُعَيْبٌ، قَالَ أَنْبَأَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، قَالَ حَدَّثَنِي ابْنُ شِهَابٍ، عَنْ سَعِيدٍ، وَأَبِي، سَلَمَةَ وَأَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ وَابْنِ أَبِي حَثْمَةَ عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ قَالَ لَمْ يَسْجُدْ رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمَئِذٍ قَبْلَ السَّلاَمِ وَلاَ بَعْدَهُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 1233,
			"arabicnumber": 1233,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ سَوَّادِ بْنِ الأَسْوَدِ بْنِ عَمْرٍو، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، قَالَ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ جَعْفَرِ بْنِ رَبِيعَةَ، عَنْ عِرَاكِ بْنِ مَالِكٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم سَجَدَ يَوْمَ ذِي الْيَدَيْنِ سَجْدَتَيْنِ بَعْدَ السَّلاَمِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 1234,
			"arabicnumber": 1234,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ سَوَّادِ بْنِ الأَسْوَدِ، قَالَ أَخْبَرَنَا ابْنُ وَهْبٍ، قَالَ أَنْبَأَنَا عَمْرُو بْنُ الْحَارِثِ، قَالَ حَدَّثَنَا قَتَادَةُ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم بِمِثْلِهِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 1235,
			"arabicnumber": 1235,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدِ بْنِ كَثِيرِ بْنِ دِينَارٍ، قَالَ حَدَّثَنَا بَقِيَّةُ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ وَحَدَّثَنِي ابْنُ عَوْنٍ، وَخَالِدٌ الْحَذَّاءُ، عَنِ ابْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم سَجَدَ فِي وَهْمِهِ بَعْدَ التَّسْلِيمِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 1236,
			"arabicnumber": 1236,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ عَبْدِ اللَّهِ النَّيْسَابُورِيُّ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الأَنْصَارِيُّ، قَالَ أَخْبَرَنِي أَشْعَثُ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي الْمُهَلَّبِ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم صَلَّى بِهِمْ فَسَهَا فَسَجَدَ سَجْدَتَيْنِ ثُمَّ سَلَّمَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 1237,
			"arabicnumber": 1237,
			"text": "أَخْبَرَنَا أَبُو الأَشْعَثِ، عَنْ يَزِيدَ بْنِ زُرَيْعٍ، قَالَ حَدَّثَنَا خَالِدٌ الْحَذَّاءُ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي الْمُهَلَّبِ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، قَالَ سَلَّمَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي ثَلاَثِ رَكَعَاتٍ مِنَ الْعَصْرِ فَدَخَلَ مَنْزِلَهُ فَقَامَ إِلَيْهِ رَجُلٌ يُقَالُ لَهُ الْخِرْبَاقُ فَقَالَ يَعْنِي نَقَصَتِ الصَّلاَةُ يَا رَسُولَ اللَّهِ فَخَرَجَ مُغْضَبًا يَجُرُّ رِدَاءَهُ فَقَالَ ‏ \"‏ أَصَدَقَ ‏\"‏ ‏.‏ قَالُوا نَعَمْ ‏.‏ فَقَامَ فَصَلَّى تِلْكَ الرَّكْعَةَ ثُمَّ سَلَّمَ ثُمَّ سَجَدَ سَجْدَتَيْهَا ثُمَّ سَلَّمَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 1238,
			"arabicnumber": 1238,
			"text": "أَخْبَرَنَا يَحْيَى بْنُ حَبِيبِ بْنِ عَرَبِيٍّ، قَالَ حَدَّثَنَا خَالِدٌ، عَنِ ابْنِ عَجْلاَنَ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا شَكَّ أَحَدُكُمْ فِي صَلاَتِهِ فَلْيُلْغِ الشَّكَّ وَلْيَبْنِ عَلَى الْيَقِينِ فَإِذَا اسْتَيْقَنَ بِالتَّمَامِ فَلْيَسْجُدْ سَجْدَتَيْنِ وَهُوَ قَاعِدٌ فَإِنْ كَانَ صَلَّى خَمْسًا شَفَعَتَا لَهُ صَلاَتَهُ وَإِنْ صَلَّى أَرْبَعًا كَانَتَا تَرْغِيمًا لِلشَّيْطَانِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 1239,
			"arabicnumber": 1239,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ، قَالَ حَدَّثَنَا حُجَيْنُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ، - وَهُوَ ابْنُ أَبِي سَلَمَةَ - عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا لَمْ يَدْرِ أَحَدُكُمْ صَلَّى ثَلاَثًا أَمْ أَرْبَعًا فَلْيُصَلِّ رَكْعَةً ثُمَّ يَسْجُدْ بَعْدَ ذَلِكَ سَجْدَتَيْنِ وَهُوَ جَالِسٌ فَإِنْ كَانَ صَلَّى خَمْسًا شَفَعَتَا لَهُ صَلاَتَهُ وَإِنْ صَلَّى أَرْبَعًا كَانَتَا تَرْغِيمًا لِلشَّيْطَانِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 1240,
			"arabicnumber": 1240,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ، قَالَ حَدَّثَنَا مُفَضَّلٌ، - وَهُوَ ابْنُ مُهَلْهَلٍ - عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، يَرْفَعُهُ إِلَى النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا شَكَّ أَحَدُكُمْ فِي صَلاَتِهِ فَلْيَتَحَرَّ الَّذِي يَرَى أَنَّهُ الصَّوَابُ فَيُتِمَّهُ ثُمَّ - يَعْنِي - يَسْجُدُ سَجْدَتَيْنِ ‏\"‏ ‏.‏ وَلَمْ أَفْهَمْ بَعْضَ حُرُوفِهِ كَمَا أَرَدْتُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 1241,
			"arabicnumber": 1241,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ الْمُخَرَّمِيُّ، قَالَ حَدَّثَنَا وَكِيعٌ، عَنْ مِسْعَرٍ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا شَكَّ أَحَدُكُمْ فِي صَلاَتِهِ فَلْيَتَحَرَّ وَيَسْجُدْ سَجْدَتَيْنِ بَعْدَ مَا يَفْرُغُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 1242,
			"arabicnumber": 1242,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ مِسْعَرٍ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم فَزَادَ أَوْ نَقَصَ فَلَمَّا سَلَّمَ قُلْنَا يَا رَسُولَ اللَّهِ هَلْ حَدَثَ فِي الصَّلاَةِ شَىْءٌ قَالَ ‏ \"‏ لَوْ حَدَثَ فِي الصَّلاَةِ شَىْءٌ أَنْبَأْتُكُمُوهُ وَلَكِنِّي إِنَّمَا أَنَا بَشَرٌ أَنْسَى كَمَا تَنْسَوْنَ فَأَيُّكُمْ مَا شَكَّ فِي صَلاَتِهِ فَلْيَنْظُرْ أَحْرَى ذَلِكَ إِلَى الصَّوَابِ فَلْيُتِمَّ عَلَيْهِ ثُمَّ لْيُسَلِّمْ وَلْيَسْجُدْ سَجْدَتَيْنِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 1243,
			"arabicnumber": 1243,
			"text": "أَخْبَرَنَا الْحَسَنُ بْنُ إِسْمَاعِيلَ بْنِ سُلَيْمَانَ الْمُجَالِدِيُّ، قَالَ حَدَّثَنَا الْفُضَيْلُ، - يَعْنِي ابْنَ عِيَاضٍ - عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم صَلاَةً فَزَادَ فِيهَا أَوْ نَقَصَ فَلَمَّا سَلَّمَ قُلْنَا يَا نَبِيَّ اللَّهِ هَلْ حَدَثَ فِي الصَّلاَةِ شَىْءٌ قَالَ ‏\"‏ وَمَا ذَاكَ ‏\"‏ ‏.‏ فَذَكَرْنَا لَهُ الَّذِي فَعَلَ فَثَنَى رِجْلَهُ فَاسْتَقْبَلَ الْقِبْلَةَ فَسَجَدَ سَجْدَتَىِ السَّهْوِ ثُمَّ أَقْبَلَ عَلَيْنَا بِوَجْهِهِ فَقَالَ ‏\"‏ لَوْ حَدَثَ فِي الصَّلاَةِ شَىْءٌ لأَنْبَأْتُكُمْ بِهِ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ إِنَّمَا أَنَا بَشَرٌ أَنْسَى كَمَا تَنْسَوْنَ فَأَيُّكُمْ شَكَّ فِي صَلاَتِهِ شَيْئًا فَلْيَتَحَرَّ الَّذِي يَرَى أَنَّهُ صَوَابٌ ثُمَّ يُسَلِّمْ ثُمَّ يَسْجُدْ سَجْدَتَىِ السَّهْوِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 1244,
			"arabicnumber": 1244,
			"text": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، عَنْ شُعْبَةَ، قَالَ كَتَبَ إِلَىَّ مَنْصُورٌ وَقَرَأْتُهُ عَلَيْهِ وَسَمِعْتُهُ يُحَدِّثُ رَجُلاً عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى صَلاَةَ الظُّهْرِ ثُمَّ أَقْبَلَ عَلَيْهِمْ بِوَجْهِهِ فَقَالُوا أَحَدَثَ فِي الصَّلاَةِ حَدَثٌ قَالَ ‏\"‏ وَمَا ذَاكَ ‏\"‏ ‏.‏ فَأَخْبَرُوهُ بِصَنِيعِهِ فَثَنَى رِجْلَهُ وَاسْتَقْبَلَ الْقِبْلَةَ فَسَجَدَ سَجْدَتَيْنِ ثُمَّ سَلَّمَ ثُمَّ أَقْبَلَ عَلَيْهِمْ بِوَجْهِهِ فَقَالَ ‏\"‏ إِنَّمَا أَنَا بَشَرٌ أَنْسَى كَمَا تَنْسَوْنَ فَإِذَا نَسِيتُ فَذَكِّرُونِي ‏\"‏ ‏.‏ وَقَالَ ‏\"‏ لَوْ كَانَ حَدَثَ فِي الصَّلاَةِ حَدَثٌ أَنْبَأْتُكُمْ بِهِ ‏\"‏ ‏.‏ وَقَالَ ‏\"‏ إِذَا أَوْهَمَ أَحَدُكُمْ فِي صَلاَتِهِ فَلْيَتَحَرَّ أَقْرَبَ ذَلِكَ مِنَ الصَّوَابِ ثُمَّ لْيُتِمَّ عَلَيْهِ ثُمَّ يَسْجُدْ سَجْدَتَيْنِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 1245,
			"arabicnumber": 1245,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ شُعْبَةَ، عَنِ الْحَكَمِ، قَالَ سَمِعْتُ أَبَا وَائِلٍ، يَقُولُ قَالَ عَبْدُ اللَّهِ مَنْ أَوْهَمَ فِي صَلاَتِهِ فَلْيَتَحَرَّ الصَّوَابَ ثُمَّ يَسْجُدْ سَجْدَتَيْنِ بَعْدَ مَا يَفْرُغُ وَهُوَ جَالِسٌ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 1246,
			"arabicnumber": 1246,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ مِسْعَرٍ، عَنِ الْحَكَمِ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ، قَالَ مَنْ شَكَّ أَوْ أَوْهَمَ فَلْيَتَحَرَّ الصَّوَابَ ثُمَّ لْيَسْجُدْ سَجْدَتَيْنِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 1247,
			"arabicnumber": 1247,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنِ ابْنِ عَوْنٍ، عَنْ إِبْرَاهِيمَ، قَالَ كَانُوا يَقُولُونَ إِذَا أَوْهَمَ يَتَحَرَّى الصَّوَابَ ثُمَّ يَسْجُدُ سَجْدَتَيْنِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 1248,
			"arabicnumber": 1248,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنِ ابْنِ جُرَيْجٍ، قَالَ قَالَ عَبْدُ اللَّهِ بْنُ مُسَافِعٍ عَنْ عُتْبَةَ بْنِ مُحَمَّدِ بْنِ الْحَارِثِ، عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ شَكَّ فِي صَلاَتِهِ فَلْيَسْجُدْ سَجْدَتَيْنِ بَعْدَ مَا يُسَلِّمُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 1249,
			"arabicnumber": 1249,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ هَاشِمٍ، أَنْبَأَنَا الْوَلِيدُ، أَنْبَأَنَا ابْنُ جُرَيْجٍ، عَنْ عَبْدِ اللَّهِ بْنِ مُسَافِعٍ، عَنْ عُتْبَةَ بْنِ مُحَمَّدِ بْنِ الْحَارِثِ، عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ شَكَّ فِي صَلاَتِهِ فَلْيَسْجُدْ سَجْدَتَيْنِ بَعْدَ التَّسْلِيمِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 1250,
			"arabicnumber": 1250,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ بْنِ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا حَجَّاجٌ، قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ مُسَافِعٍ، أَنَّ مُصْعَبَ بْنَ شَيْبَةَ، أَخْبَرَهُ عَنْ عُتْبَةَ بْنِ مُحَمَّدِ بْنِ الْحَارِثِ، عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ شَكَّ فِي صَلاَتِهِ فَلْيَسْجُدْ سَجْدَتَيْنِ بَعْدَ مَا يُسَلِّمُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 1251,
			"arabicnumber": 1251,
			"text": "أَخْبَرَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا حَجَّاجٌ، وَرَوْحٌ، - هُوَ ابْنُ عُبَادَةَ - عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ مُسَافِعٍ، أَنَّ مُصْعَبَ بْنَ شَيْبَةَ، أَخْبَرَهُ عَنْ عُتْبَةَ بْنِ مُحَمَّدِ بْنِ الْحَارِثِ، عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ شَكَّ فِي صَلاَتِهِ فَلْيَسْجُدْ سَجْدَتَيْنِ ‏\"‏ ‏.‏ قَالَ حَجَّاجٌ ‏\"‏ بَعْدَ مَا يُسَلِّمُ ‏\"‏ ‏.‏ وَقَالَ رَوْحٌ ‏\"‏ وَهُوَ جَالِسٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 1252,
			"arabicnumber": 1252,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ أَحَدَكُمْ إِذَا قَامَ يُصَلِّي جَاءَهُ الشَّيْطَانُ فَلَبَسَ عَلَيْهِ صَلاَتَهُ حَتَّى لاَ يَدْرِي كَمْ صَلَّى فَإِذَا وَجَدَ أَحَدُكُمْ ذَلِكَ فَلْيَسْجُدْ سَجْدَتَيْنِ وَهُوَ جَالِسٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 1253,
			"arabicnumber": 1253,
			"text": "أَخْبَرَنَا بِشْرُ بْنُ هِلاَلٍ، قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ هِشَامٍ الدَّسْتَوَائِيِّ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا نُودِيَ لِلصَّلاَةِ أَدْبَرَ الشَّيْطَانُ لَهُ ضُرَاطٌ فَإِذَا قُضِيَ التَّثْوِيبُ أَقْبَلَ حَتَّى يَخْطُرَ بَيْنَ الْمَرْءِ وَقَلْبِهِ حَتَّى لاَ يَدْرِي كَمْ صَلَّى فَإِذَا رَأَى أَحَدُكُمْ ذَلِكَ فَلْيَسْجُدْ سَجْدَتَيْنِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 1254,
			"arabicnumber": 1254,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، - وَاللَّفْظُ لاِبْنِ الْمُثَنَّى - قَالاَ حَدَّثَنَا يَحْيَى، عَنْ شُعْبَةَ، عَنِ الْحَكَمِ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ صَلَّى النَّبِيُّ صلى الله عليه وسلم الظُّهْرَ خَمْسًا فَقِيلَ لَهُ أَزِيدَ فِي الصَّلاَةِ قَالَ ‏ \"‏ وَمَا ذَاكَ ‏\"‏ ‏.‏ قَالُوا صَلَّيْتَ خَمْسًا ‏.‏ فَثَنَى رِجْلَهُ وَسَجَدَ سَجْدَتَيْنِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 1255,
			"arabicnumber": 1255,
			"text": "أَخْبَرَنَا عَبْدَةُ بْنُ عَبْدِ الرَّحِيمِ، قَالَ أَنْبَأَنَا ابْنُ شُمَيْلٍ، قَالَ أَنْبَأَنَا شُعْبَةُ، عَنِ الْحَكَمِ، وَمُغِيرَةَ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ صَلَّى بِهِمُ الظُّهْرَ خَمْسًا فَقَالُوا إِنَّكَ صَلَّيْتَ خَمْسًا ‏.‏ فَسَجَدَ سَجْدَتَيْنِ بَعْدَ مَا سَلَّمَ وَهُوَ جَالِسٌ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 1256,
			"arabicnumber": 1256,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ، قَالَ حَدَّثَنِي يَحْيَى بْنُ آدَمَ، قَالَ حَدَّثَنَا مُفَضَّلُ بْنُ مُهَلْهَلٍ، عَنِ الْحَسَنِ بْنِ عُبَيْدِ اللَّهِ، عَنْ إِبْرَاهِيمَ بْنِ سُوَيْدٍ، قَالَ صَلَّى عَلْقَمَةُ خَمْسًا فَقِيلَ لَهُ فَقَالَ مَا فَعَلْتُ ‏.‏ قُلْتُ بِرَأْسِي بَلَى ‏.‏ قَالَ وَأَنْتَ يَا أَعْوَرُ فَقُلْتُ نَعَمْ ‏.‏ فَسَجَدَ سَجْدَتَيْنِ ثُمَّ حَدَّثَنَا عَنْ عَبْدِ اللَّهِ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ صَلَّى خَمْسًا فَوَشْوَشَ الْقَوْمُ بَعْضُهُمْ إِلَى بَعْضٍ فَقَالُوا لَهُ أَزِيدَ فِي الصَّلاَةِ قَالَ ‏\"‏ لاَ ‏\"‏ ‏.‏ فَأَخْبَرُوهُ فَثَنَى رِجْلَهُ فَسَجَدَ سَجْدَتَيْنِ ثُمَّ قَالَ ‏\"‏ إِنَّمَا أَنَا بَشَرٌ أَنْسَى كَمَا تَنْسَوْنَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 1257,
			"arabicnumber": 1257,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ مَالِكِ بْنِ مِغْوَلٍ، قَالَ سَمِعْتُ الشَّعْبِيَّ، يَقُولُ سَهَا عَلْقَمَةُ بْنُ قَيْسٍ فِي صَلاَتِهِ فَذَكَرُوا لَهُ بَعْدَ مَا تَكَلَّمَ فَقَالَ أَكَذَلِكَ يَا أَعْوَرُ قَالَ نَعَمْ ‏.‏ فَحَلَّ حُبْوَتَهُ ثُمَّ سَجَدَ سَجْدَتَىِ السَّهْوِ وَقَالَ هَكَذَا فَعَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏ قَالَ وَسَمِعْتُ الْحَكَمَ يَقُولُ كَانَ عَلْقَمَةُ صَلَّى خَمْسًا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 1258,
			"arabicnumber": 1258,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ سُفْيَانَ، عَنِ الْحَسَنِ بْنِ عُبَيْدِ اللَّهِ، عَنْ إِبْرَاهِيمَ، أَنَّ عَلْقَمَةَ، صَلَّى خَمْسًا فَلَمَّا سَلَّمَ قَالَ إِبْرَاهِيمُ بْنُ سُوَيْدٍ يَا أَبَا شِبْلٍ صَلَّيْتَ خَمْسًا ‏.‏ فَقَالَ أَكَذَلِكَ يَا أَعْوَرُ فَسَجَدَ سَجْدَتَىِ السَّهْوِ ثُمَّ قَالَ هَكَذَا فَعَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 1259,
			"arabicnumber": 1259,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ أَبِي بَكْرٍ النَّهْشَلِيِّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الأَسْوَدِ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى إِحْدَى صَلاَتَىِ الْعَشِيِّ خَمْسًا فَقِيلَ لَهُ أَزِيدَ فِي الصَّلاَةِ فَقَالَ ‏\"‏ وَمَا ذَاكَ ‏\"‏ ‏.‏ قَالُوا صَلَّيْتَ خَمْسًا ‏.‏ قَالَ ‏\"‏ إِنَّمَا أَنَا بَشَرٌ أَنْسَى كَمَا تَنْسَوْنَ وَأَذْكُرُ كَمَا تَذْكُرُونَ ‏\"‏ ‏.‏ فَسَجَدَ سَجْدَتَيْنِ ثُمَّ انْفَتَلَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 1260,
			"arabicnumber": 1260,
			"text": "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا شُعَيْبُ بْنُ اللَّيْثِ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ مُحَمَّدِ بْنِ عَجْلاَنَ، عَنْ مُحَمَّدِ بْنِ يُوسُفَ، مَوْلَى عُثْمَانَ عَنْ أَبِيهِ، يُوسُفَ أَنَّ مُعَاوِيَةَ، صَلَّى إِمَامَهُمْ فَقَامَ فِي الصَّلاَةِ وَعَلَيْهِ جُلُوسٌ فَسَبَّحَ النَّاسُ فَتَمَّ عَلَى قِيَامِهِ ثُمَّ سَجَدَ سَجْدَتَيْنِ وَهُوَ جَالِسٌ بَعْدَ أَنْ أَتَمَّ الصَّلاَةَ ثُمَّ قَعَدَ عَلَى الْمِنْبَرِ فَقَالَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَنْ نَسِيَ شَيْئًا مِنْ صَلاَتِهِ فَلْيَسْجُدْ مِثْلَ هَاتَيْنِ السَّجْدَتَيْنِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 1261,
			"arabicnumber": 1261,
			"text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ، قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي عَمْرٌو، وَيُونُسُ، وَاللَّيْثُ، أَنَّ ابْنَ شِهَابٍ، أَخْبَرَهُمْ عَنْ عَبْدِ الرَّحْمَنِ الأَعْرَجِ، أَنَّ عَبْدَ اللَّهِ ابْنَ بُحَيْنَةَ، حَدَّثَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَامَ فِي الثِّنْتَيْنِ مِنَ الظُّهْرِ فَلَمْ يَجْلِسْ فَلَمَّا قَضَى صَلاَتَهُ سَجَدَ سَجْدَتَيْنِ كَبَّرَ فِي كُلِّ سَجْدَةٍ وَهُوَ جَالِسٌ قَبْلَ أَنْ يُسَلِّمَ وَسَجَدَهُمَا النَّاسُ مَعَهُ مَكَانَ مَا نَسِيَ مِنَ الْجُلُوسِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 1262,
			"arabicnumber": 1262,
			"text": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ، وَمُحَمَّدُ بْنُ بَشَّارِ، بُنْدَارٌ - وَاللَّفْظُ لَهُ - قَالاَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ، قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ عَمْرِو بْنِ عَطَاءٍ، عَنْ أَبِي حُمَيْدٍ السَّاعِدِيِّ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا كَانَ فِي الرَّكْعَتَيْنِ اللَّتَيْنِ تَنْقَضِي فِيهِمَا الصَّلاَةُ أَخَّرَ رِجْلَهُ الْيُسْرَى وَقَعَدَ عَلَى شِقِّهِ مُتَوَرِّكًا ثُمَّ سَلَّمَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 1263,
			"arabicnumber": 1263,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَاصِمِ بْنِ كُلَيْبٍ، عَنْ أَبِيهِ، عَنْ وَائِلِ بْنِ حُجْرٍ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَرْفَعُ يَدَيْهِ إِذَا افْتَتَحَ الصَّلاَةَ وَإِذَا رَكَعَ وَإِذَا رَفَعَ رَأْسَهُ مِنَ الرُّكُوعِ وَإِذَا جَلَسَ أَضْجَعَ الْيُسْرَى وَنَصَبَ الْيُمْنَى وَوَضَعَ يَدَهُ الْيُسْرَى عَلَى فَخِذِهِ الْيُسْرَى وَيَدَهُ الْيُمْنَى عَلَى فَخِذِهِ الْيُمْنَى وَعَقَدَ ثِنْتَيْنِ الْوُسْطَى وَالإِبْهَامَ وَأَشَارَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 1264,
			"arabicnumber": 1264,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَلِيِّ بْنِ مَيْمُونٍ الرَّقِّيُّ، قَالَ حَدَّثَنَا مُحَمَّدٌ، - وَهُوَ ابْنُ يُوسُفَ الْفِرْيَابِيُّ - قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَاصِمِ بْنِ كُلَيْبٍ، عَنْ أَبِيهِ، عَنْ وَائِلِ بْنِ حُجْرٍ، أَنَّهُ رَأَى النَّبِيَّ صلى الله عليه وسلم جَلَسَ فِي الصَّلاَةِ فَافْتَرَشَ رِجْلَهُ الْيُسْرَى وَوَضَعَ ذِرَاعَيْهِ عَلَى فَخِذَيْهِ وَأَشَارَ بِالسَّبَّابَةِ يَدْعُو بِهَا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 1265,
			"arabicnumber": 1265,
			"text": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ أَنْبَأَنَا بِشْرُ بْنُ الْمُفَضَّلِ، قَالَ حَدَّثَنَا عَاصِمُ بْنُ كُلَيْبٍ، عَنْ أَبِيهِ، عَنْ وَائِلِ بْنِ حُجْرٍ، قَالَ قُلْتُ لأَنْظُرَنَّ إِلَى صَلاَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم كَيْفَ يُصَلِّي فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَاسْتَقْبَلَ الْقِبْلَةَ فَرَفَعَ يَدَيْهِ حَتَّى حَاذَتَا أُذُنَيْهِ ثُمَّ أَخَذَ شِمَالَهُ بِيَمِينِهِ فَلَمَّا أَرَادَ أَنْ يَرْكَعَ رَفَعَهُمَا مِثْلَ ذَلِكَ وَوَضَعَ يَدَيْهِ عَلَى رُكْبَتَيْهِ فَلَمَّا رَفَعَ رَأْسَهُ مِنَ الرُّكُوعِ رَفَعَهُمَا مِثْلَ ذَلِكَ فَلَمَّا سَجَدَ وَضَعَ رَأْسَهُ بِذَلِكَ الْمَنْزِلِ مِنْ يَدَيْهِ ثُمَّ جَلَسَ فَافْتَرَشَ رِجْلَهُ الْيُسْرَى وَوَضَعَ يَدَهُ الْيُسْرَى عَلَى فَخِذِهِ الْيُسْرَى وَحَدَّ مِرْفَقَهُ الأَيْمَنَ عَلَى فَخِذِهِ الْيُمْنَى وَقَبَضَ ثِنْتَيْنِ وَحَلَّقَ وَرَأَيْتُهُ يَقُولُ هَكَذَا وَأَشَارَ بِشْرٌ بِالسَّبَّابَةِ مِنَ الْيُمْنَى وَحَلَّقَ الإِبْهَامَ وَالْوُسْطَى ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 1266,
			"arabicnumber": 1266,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ مُسْلِمِ بْنِ أَبِي مَرْيَمَ، - شَيْخٌ مِنْ أَهْلِ الْمَدِينَةِ - ثُمَّ لَقِيتُ الشَّيْخَ فَقَالَ سَمِعْتُ عَلِيَّ بْنَ عَبْدِ الرَّحْمَنِ يَقُولُ صَلَّيْتُ إِلَى جَنْبِ ابْنِ عُمَرَ فَقَلَّبْتُ الْحَصَى فَقَالَ لِي ابْنُ عُمَرَ لاَ تُقَلِّبِ الْحَصَى فَإِنَّ تَقْلِيبَ الْحَصَى مِنَ الشَّيْطَانِ وَافْعَلْ كَمَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَفْعَلُ ‏.‏ قُلْتُ وَكَيْفَ رَأَيْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَفْعَلُ قَالَ هَكَذَا وَنَصَبَ الْيُمْنَى وَأَضْجَعَ الْيُسْرَى وَوَضَعَ يَدَهُ الْيُمْنَى عَلَى فَخِذِهِ الْيُمْنَى وَيَدَهُ الْيُسْرَى عَلَى فَخِذِهِ الْيُسْرَى وَأَشَارَ بِالسَّبَّابَةِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 1267,
			"arabicnumber": 1267,
			"text": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكٍ، عَنْ مُسْلِمِ بْنِ أَبِي مَرْيَمَ، عَنْ عَلِيِّ بْنِ عَبْدِ الرَّحْمَنِ، قَالَ رَآنِي ابْنُ عُمَرَ وَأَنَا أَعْبَثُ، بِالْحَصَى فِي الصَّلاَةِ فَلَمَّا انْصَرَفَ نَهَانِي وَقَالَ اصْنَعْ كَمَا كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصْنَعُ ‏.‏ قُلْتُ وَكَيْفَ كَانَ يَصْنَعُ قَالَ كَانَ إِذَا جَلَسَ فِي الصَّلاَةِ وَضَعَ كَفَّهُ الْيُمْنَى عَلَى فَخِذِهِ وَقَبَضَ - يَعْنِي أَصَابِعَهُ كُلَّهَا - وَأَشَارَ بِأُصْبُعِهِ الَّتِي تَلِي الإِبْهَامَ وَوَضَعَ كَفَّهُ الْيُسْرَى عَلَى فَخِذِهِ الْيُسْرَى ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 1268,
			"arabicnumber": 1268,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ زَائِدَةَ، قَالَ حَدَّثَنَا عَاصِمُ بْنُ كُلَيْبٍ، قَالَ حَدَّثَنِي أَبِي أَنَّ وَائِلَ بْنَ حُجْرٍ، قَالَ قُلْتُ لأَنْظُرَنَّ إِلَى صَلاَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم كَيْفَ يُصَلِّي فَنَظَرْتُ إِلَيْهِ فَوَصَفَ قَالَ ثُمَّ قَعَدَ وَافْتَرَشَ رِجْلَهُ الْيُسْرَى وَوَضَعَ كَفَّهُ الْيُسْرَى عَلَى فَخِذِهِ وَرُكْبَتِهِ الْيُسْرَى وَجَعَلَ حَدَّ مِرْفَقِهِ الأَيْمَنِ عَلَى فَخِذِهِ الْيُمْنَى ثُمَّ قَبَضَ اثْنَتَيْنِ مِنْ أَصَابِعِهِ وَحَلَّقَ حَلْقَةً ثُمَّ رَفَعَ أُصْبُعَهُ فَرَأَيْتُهُ يُحَرِّكُهَا يَدْعُو بِهَا ‏.‏ مُخْتَصَرٌ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 1269,
			"arabicnumber": 1269,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ أَنْبَأَنَا مَعْمَرٌ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا جَلَسَ فِي الصَّلاَةِ وَضَعَ يَدَيْهِ عَلَى رُكْبَتَيْهِ وَرَفَعَ أُصْبُعَهُ الَّتِي تَلِي الإِبْهَامَ فَدَعَا بِهَا وَيَدَهُ الْيُسْرَى عَلَى رُكْبَتِهِ بَاسِطُهَا عَلَيْهَا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 1270,
			"arabicnumber": 1270,
			"text": "أَخْبَرَنَا أَيُّوبُ بْنُ مُحَمَّدٍ الْوَزَّانُ، قَالَ حَدَّثَنَا حَجَّاجٌ، قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي زِيَادٌ، عَنْ مُحَمَّدِ بْنِ عَجْلاَنَ، عَنْ عَامِرِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُشِيرُ بِأُصْبُعِهِ إِذَا دَعَا وَلاَ يُحَرِّكُهَا ‏.‏ قَالَ ابْنُ جُرَيْجٍ وَزَادَ عَمْرٌو قَالَ أَخْبَرَنِي عَامِرُ بْنُ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ عَنْ أَبِيهِ أَنَّهُ رَأَى النَّبِيَّ صلى الله عليه وسلم يَدْعُو كَذَلِكَ وَيَتَحَامَلُ بِيَدِهِ الْيُسْرَى عَلَى رِجْلِهِ الْيُسْرَى ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 1271,
			"arabicnumber": 1271,
			"text": "أَخْبَرَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَمَّارٍ الْمَوْصِلِيُّ، عَنِ الْمُعَافَى، عَنْ عِصَامِ بْنِ قُدَامَةَ، عَنْ مَالِكٍ، - وَهُوَ ابْنُ نُمَيْرٍ الْخُزَاعِيِّ - عَنْ أَبِيهِ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم وَاضِعًا يَدَهُ الْيُمْنَى عَلَى فَخِذِهِ الْيُمْنَى فِي الصَّلاَةِ وَيُشِيرُ بِأُصْبُعِهِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 1272,
			"arabicnumber": 1272,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا صَفْوَانُ بْنُ عِيسَى، قَالَ حَدَّثَنَا ابْنُ عَجْلاَنَ، عَنِ الْقَعْقَاعِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَجُلاً، كَانَ يَدْعُو بِأُصْبُعَيْهِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَحِّدْ أَحِّدْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 1273,
			"arabicnumber": 1273,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ الْمُخَرِّمِيُّ، قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، قَالَ حَدَّثَنَا الأَعْمَشُ، عَنْ أَبِي صَالِحٍ، عَنْ سَعْدٍ، قَالَ مَرَّ عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَنَا أَدْعُو بِأَصَابِعِي فَقَالَ ‏ \"‏ أَحِّدْ أَحِّدْ ‏\"‏ ‏.‏ وَأَشَارَ بِالسَّبَّابَةِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 1274,
			"arabicnumber": 1274,
			"text": "أَخْبَرَنِي أَحْمَدُ بْنُ يَحْيَى الصُّوفِيُّ، قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا عِصَامُ بْنُ قُدَامَةَ الْجَدَلِيُّ، قَالَ حَدَّثَنِي مَالِكُ بْنُ نُمَيْرٍ الْخُزَاعِيُّ، مِنْ أَهْلِ الْبَصْرَةِ أَنَّ أَبَاهُ، حَدَّثَهُ أَنَّهُ، رَأَى رَسُولَ اللَّهِ صلى الله عليه وسلم قَاعِدًا فِي الصَّلاَةِ وَاضِعًا ذِرَاعَهُ الْيُمْنَى عَلَى فَخِذِهِ الْيُمْنَى رَافِعًا أُصْبُعَهُ السَّبَّابَةَ قَدْ أَحْنَاهَا شَيْئًا وَهُوَ يَدْعُو ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Munqar"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 1275,
			"arabicnumber": 1275,
			"text": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا يَحْيَى، عَنِ ابْنِ عَجْلاَنَ، عَنْ عَامِرِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا قَعَدَ فِي التَّشَهُّدِ وَضَعَ كَفَّهُ الْيُسْرَى عَلَى فَخِذِهِ الْيُسْرَى وَأَشَارَ بِالسَّبَّابَةِ لاَ يُجَاوِزُ بَصَرُهُ إِشَارَتَهُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 1276,
			"arabicnumber": 1276,
			"text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ، عَنِ ابْنِ وَهْبٍ، قَالَ أَخْبَرَنِي اللَّيْثُ، عَنْ جَعْفَرِ بْنِ رَبِيعَةَ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لَيَنْتَهِيَنَّ أَقْوَامٌ عَنْ رَفْعِ أَبْصَارِهِمْ عِنْدَ الدُّعَاءِ فِي الصَّلاَةِ إِلَى السَّمَاءِ أَوْ لَتُخْطَفَنَّ أَبْصَارُهُمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 1277,
			"arabicnumber": 1277,
			"text": "أَخْبَرَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ أَبُو عُبَيْدِ اللَّهِ الْمَخْزُومِيُّ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، وَمَنْصُورٌ، عَنْ شَقِيقِ بْنِ سَلَمَةَ، عَنِ ابْنِ مَسْعُودٍ، قَالَ كُنَّا نَقُولُ فِي الصَّلاَةِ قَبْلَ أَنْ يُفْرَضَ التَّشَهُّدُ السَّلاَمُ عَلَى اللَّهِ السَّلاَمُ عَلَى جِبْرِيلَ وَمِيكَائِيلَ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ تَقُولُوا هَكَذَا فَإِنَّ اللَّهَ عَزَّ وَجَلَّ هُوَ السَّلاَمُ وَلَكِنْ قُولُوا التَّحِيَّاتُ لِلَّهِ وَالصَّلَوَاتُ وَالطَّيِّبَاتُ السَّلاَمُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلاَمُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 1278,
			"arabicnumber": 1278,
			"text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ حُمَيْدٍ، قَالَ حَدَّثَنَا أَبُو الزُّبَيْرِ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُعَلِّمُنَا التَّشَهُّدَ كَمَا يُعَلِّمُنَا السُّورَةَ مِنَ الْقُرْآنِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 1279,
			"arabicnumber": 1279,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا الْفُضَيْلُ، - وَهُوَ ابْنُ عِيَاضٍ - عَنِ الأَعْمَشِ، عَنْ شَقِيقٍ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّ اللَّهَ عَزَّ وَجَلَّ هُوَ السَّلاَمُ فَإِذَا قَعَدَ أَحَدُكُمْ فَلْيَقُلِ التَّحِيَّاتُ لِلَّهِ وَالصَّلَوَاتُ وَالطَّيِّبَاتُ السَّلاَمُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلاَمُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ ثُمَّ لْيَتَخَيَّرْ بَعْدَ ذَلِكَ مِنَ الْكَلاَمِ مَا شَاءَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 1280,
			"arabicnumber": 1280,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ هِشَامٍ، عَنْ قَتَادَةَ، ح وَأَنْبَأَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا هِشَامٌ، قَالَ حَدَّثَنَا قَتَادَةُ، عَنْ يُونُسَ بْنِ جُبَيْرٍ، عَنْ حِطَّانَ بْنِ عَبْدِ اللَّهِ، أَنَّ الأَشْعَرِيَّ، قَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَطَبَنَا فَعَلَّمَنَا سُنَّتَنَا وَبَيَّنَ لَنَا صَلاَتَنَا فَقَالَ ‏\"‏ إِذَا قُمْتُمْ إِلَى الصَّلاَةِ فَأَقِيمُوا صُفُوفَكُمْ ثُمَّ لْيَؤُمَّكُمْ أَحَدُكُمْ فَإِذَا كَبَّرَ فَكَبِّرُوا وَإِذَا قَالَ ‏{‏ وَلاَ الضَّالِّينَ ‏}‏ فَقُولُوا آمِينَ يُجِبْكُمُ اللَّهُ ثُمَّ إِذَا كَبَّرَ وَرَكَعَ فَكَبِّرُوا وَارْكَعُوا فَإِنَّ الإِمَامَ يَرْكَعُ قَبْلَكُمْ وَيَرْفَعُ قَبْلَكُمْ ‏\"‏ ‏.‏ قَالَ نَبِيُّ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَتِلْكَ بِتِلْكَ وَإِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ فَقُولُوا اللَّهُمَّ رَبَّنَا لَكَ الْحَمْدُ فَإِنَّ اللَّهَ عَزَّ وَجَلَّ قَالَ عَلَى لِسَانِ نَبِيِّهِ صلى الله عليه وسلم سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ ثُمَّ إِذَا كَبَّرَ وَسَجَدَ فَكَبِّرُوا وَاسْجُدُوا فَإِنَّ الإِمَامَ يَسْجُدُ قَبْلَكُمْ وَيَرْفَعُ قَبْلَكُمْ ‏\"‏ ‏.‏ قَالَ نَبِيُّ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَتِلْكَ بِتِلْكَ وَإِذَا كَانَ عِنْدَ الْقَعْدَةِ فَلْيَكُنْ مِنْ قَوْلِ أَحَدِكُمْ أَنْ يَقُولَ التَّحِيَّاتُ الطَّيِّبَاتُ الصَّلَوَاتُ لِلَّهِ السَّلاَمُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلاَمُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 1281,
			"arabicnumber": 1281,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا أَبُو عَاصِمٍ، قَالَ حَدَّثَنَا أَيْمَنُ بْنُ نَابِلٍ، قَالَ حَدَّثَنَا أَبُو الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُعَلِّمُنَا التَّشَهُّدَ كَمَا يُعَلِّمُنَا السُّورَةَ مِنَ الْقُرْآنِ ‏ \"‏ بِسْمِ اللَّهِ وَبِاللَّهِ التَّحِيَّاتُ لِلَّهِ وَالصَّلَوَاتُ وَالطَّيِّبَاتُ السَّلاَمُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلاَمُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ وَأَسْأَلُ اللَّهَ الْجَنَّةَ وَأَعُوذُ بِهِ مِنَ النَّارِ ‏\"‏ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ لاَ نَعْلَمُ أَحَدًا تَابَعَ أَيْمَنَ بْنَ نَابِلٍ عَلَى هَذِهِ الرِّوَايَةِ وَأَيْمَنُ عِنْدَنَا لاَ بَأْسَ بِهِ وَالْحَدِيثُ خَطَأٌ وَبِاللَّهِ التَّوْفِيقُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 1282,
			"arabicnumber": 1282,
			"text": "أَخْبَرَنَا عَبْدُ الْوَهَّابِ بْنُ عَبْدِ الْحَكَمِ الْوَرَّاقُ، قَالَ حَدَّثَنَا مُعَاذُ بْنُ مُعَاذٍ، عَنْ سُفْيَانَ بْنِ سَعِيدٍ، ح وَأَخْبَرَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا وَكِيعٌ، وَعَبْدُ الرَّزَّاقِ، عَنْ سُفْيَانَ، عَنْ عَبْدِ اللَّهِ بْنِ السَّائِبِ، عَنْ زَاذَانَ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّ لِلَّهِ مَلاَئِكَةً سَيَّاحِينَ فِي الأَرْضِ يُبَلِّغُونِي مِنْ أُمَّتِي السَّلاَمَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 1283,
			"arabicnumber": 1283,
			"text": "أَخْبَرَنَا إِسْحَاقُ بْنُ مَنْصُورٍ الْكَوْسَجُ، قَالَ أَنْبَأَنَا عَفَّانُ، قَالَ حَدَّثَنَا حَمَّادٌ، قَالَ حَدَّثَنَا ثَابِتٌ، قَالَ قَدِمَ عَلَيْنَا سُلَيْمَانُ مَوْلَى الْحَسَنِ بْنِ عَلِيٍّ زَمَنَ الْحَجَّاجِ فَحَدَّثَنَا عَنْ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم جَاءَ ذَاتَ يَوْمٍ وَالْبُشْرَى فِي وَجْهِهِ فَقُلْنَا إِنَّا لَنَرَى الْبُشْرَى فِي وَجْهِكَ ‏.‏ فَقَالَ ‏ \"‏ إِنَّهُ أَتَانِي الْمَلَكُ فَقَالَ يَا مُحَمَّدُ إِنَّ رَبَّكَ يَقُولُ أَمَا يُرْضِيكَ أَنَّهُ لاَ يُصَلِّي عَلَيْكَ أَحَدٌ إِلاَّ صَلَّيْتُ عَلَيْهِ عَشْرًا وَلاَ يُسَلِّمُ عَلَيْكَ أَحَدٌ إِلاَّ سَلَّمْتُ عَلَيْهِ عَشْرًا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 1284,
			"arabicnumber": 1284,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ حَيْوَةَ بْنِ شُرَيْحٍ، عَنْ أَبِي هَانِئٍ، أَنَّ أَبَا عَلِيٍّ الْجَنْبِيَّ، حَدَّثَهُ أَنَّهُ، سَمِعَ فَضَالَةَ بْنَ عُبَيْدٍ، يَقُولُ سَمِعَ رَسُولُ اللَّهِ صلى الله عليه وسلم رَجُلاً يَدْعُو فِي صَلاَتِهِ لَمْ يُمَجِّدِ اللَّهَ وَلَمْ يُصَلِّ عَلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ عَجِلْتَ أَيُّهَا الْمُصَلِّي ‏\"‏ ‏.‏ ثُمَّ عَلَّمَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم وَسَمِعَ رَسُولُ اللَّهِ صلى الله عليه وسلم رَجُلاً يُصَلِّي فَمَجَّدَ اللَّهَ وَحَمِدَهُ وَصَلَّى عَلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ ادْعُ تُجَبْ وَسَلْ تُعْطَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 1285,
			"arabicnumber": 1285,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، وَالْحَارِثُ بْنُ مِسْكِينٍ، قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، - وَاللَّفْظُ لَهُ - عَنِ ابْنِ الْقَاسِمِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ نُعَيْمِ بْنِ عَبْدِ اللَّهِ الْمُجْمِرِ، أَنَّ مُحَمَّدَ بْنَ عَبْدِ اللَّهِ بْنِ زَيْدٍ الأَنْصَارِيَّ، - وَعَبْدُ اللَّهِ بْنُ زَيْدٍ الَّذِي أُرِيَ النِّدَاءَ بِالصَّلاَةِ - أَخْبَرَهُ عَنْ أَبِي مَسْعُودٍ الأَنْصَارِيِّ، أَنَّهُ قَالَ أَتَانَا رَسُولُ اللَّهِ صلى الله عليه وسلم فِي مَجْلِسِ سَعْدِ بْنِ عُبَادَةَ فَقَالَ لَهُ بَشِيرُ بْنُ سَعْدٍ أَمَرَنَا اللَّهُ عَزَّ وَجَلَّ أَنْ نُصَلِّيَ عَلَيْكَ يَا رَسُولَ اللَّهِ فَكَيْفَ نُصَلِّي عَلَيْكَ فَسَكَتَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى تَمَنَّيْنَا أَنَّهُ لَمْ يَسْأَلْهُ ثُمَّ قَالَ ‏ \"‏ قُولُوا اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ وَبَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ فِي الْعَالَمِينَ إِنَّكَ حَمِيدٌ مَجِيدٌ وَالسَّلاَمُ كَمَا عَلِمْتُمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 1286,
			"arabicnumber": 1286,
			"text": "أَخْبَرَنَا زِيَادُ بْنُ يَحْيَى، قَالَ حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ عَبْدِ الْمَجِيدِ، قَالَ حَدَّثَنَا هِشَامُ بْنُ حَسَّانَ، عَنْ مُحَمَّدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ بِشْرٍ، عَنْ أَبِي مَسْعُودٍ الأَنْصَارِيِّ، قَالَ قِيلَ لِلنَّبِيِّ صلى الله عليه وسلم أُمِرْنَا أَنْ نُصَلِّيَ عَلَيْكَ وَنُسَلِّمَ أَمَّا السَّلاَمُ فَقَدْ عَرَفْنَاهُ فَكَيْفَ نُصَلِّي عَلَيْكَ قَالَ ‏ \"‏ قُولُوا اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 1287,
			"arabicnumber": 1287,
			"text": "أَخْبَرَنَا الْقَاسِمُ بْنُ زَكَرِيَّا بْنِ دِينَارٍ، مِنْ كِتَابِهِ قَالَ حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ، عَنْ زَائِدَةَ، عَنْ سُلَيْمَانَ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ كَعْبِ بْنِ عُجْرَةَ، قَالَ قُلْنَا يَا رَسُولَ اللَّهِ السَّلاَمُ عَلَيْكَ قَدْ عَرَفْنَاهُ فَكَيْفَ الصَّلاَةُ قَالَ ‏ \"‏ قُولُوا اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ ‏\"‏ ‏.‏ قَالَ ابْنُ أَبِي لَيْلَى وَنَحْنُ نَقُولُ وَعَلَيْنَا مَعَهُمْ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ حَدَّثَنَا بِهِ مِنْ كِتَابِهِ وَهَذَا خَطَأٌ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 1288,
			"arabicnumber": 1288,
			"text": "أَخْبَرَنَا الْقَاسِمُ بْنُ زَكَرِيَّا، قَالَ حَدَّثَنَا حُسَيْنٌ، عَنْ زَائِدَةَ، عَنْ سُلَيْمَانَ، عَنِ الْحَكَمِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ كَعْبِ بْنِ عُجْرَةَ، قَالَ قُلْنَا يَا رَسُولَ اللَّهِ السَّلاَمُ عَلَيْكَ قَدْ عَرَفْنَاهُ فَكَيْفَ الصَّلاَةُ عَلَيْكَ قَالَ ‏ \"‏ قُولُوا اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَآلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ وَبَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَآلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ ‏\"‏ ‏.‏ قَالَ عَبْدُ الرَّحْمَنُ وَنَحْنُ نَقُولُ وَعَلَيْنَا مَعَهُمْ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ وَهَذَا أَوْلَى بِالصَّوَابِ مِنَ الَّذِي قَبْلَهُ وَلاَ نَعْلَمُ أَحَدًا قَالَ فِيهِ عَمْرُو بْنُ مُرَّةَ غَيْرَ هَذَا وَاللَّهُ تَعَالَى أَعْلَمُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 1289,
			"arabicnumber": 1289,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ، عَنْ شُعْبَةَ، عَنِ الْحَكَمِ، عَنِ ابْنِ أَبِي لَيْلَى، قَالَ قَالَ لِي كَعْبُ بْنُ عُجْرَةَ أَلاَ أُهْدِي لَكَ هَدِيَّةً قُلْنَا يَا رَسُولَ اللَّهِ قَدْ عَرَفْنَا كَيْفَ السَّلاَمُ عَلَيْكَ فَكَيْفَ نُصَلِّي عَلَيْكَ قَالَ ‏ \"‏ قُولُوا اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 1290,
			"arabicnumber": 1290,
			"text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا مُحَمَّدُ بْنُ بِشْرٍ، قَالَ حَدَّثَنَا مُجَمِّعُ بْنُ يَحْيَى، عَنْ عُثْمَانَ بْنِ مَوْهَبٍ، عَنْ مُوسَى بْنِ طَلْحَةَ، عَنْ أَبِيهِ، قَالَ قُلْنَا يَا رَسُولَ اللَّهِ كَيْفَ الصَّلاَةُ عَلَيْكَ قَالَ ‏ \"‏ قُولُوا اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَآلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ وَبَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَآلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 1291,
			"arabicnumber": 1291,
			"text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعْدِ بْنِ إِبْرَاهِيمَ بْنِ سَعْدٍ، قَالَ حَدَّثَنَا عَمِّي، قَالَ حَدَّثَنَا شَرِيكٌ، عَنْ عُثْمَانَ بْنِ مَوْهَبٍ، عَنْ مُوسَى بْنِ طَلْحَةَ، عَنْ أَبِيهِ، أَنَّ رَجُلاً، أَتَى نَبِيَّ اللَّهِ صلى الله عليه وسلم فَقَالَ كَيْفَ نُصَلِّي عَلَيْكَ يَا نَبِيَّ اللَّهِ قَالَ ‏ \"‏ قُولُوا اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ وَبَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 1292,
			"arabicnumber": 1292,
			"text": "أَخْبَرَنَا سَعِيدُ بْنُ يَحْيَى بْنِ سَعِيدٍ الأُمَوِيُّ، فِي حَدِيثِهِ عَنْ أَبِيهِ، عَنْ عُثْمَانَ بْنِ حَكِيمٍ، عَنْ خَالِدِ بْنِ سَلَمَةَ، عَنْ مُوسَى بْنِ طَلْحَةَ، قَالَ سَأَلْتُ زَيْدَ بْنَ خَارِجَةَ قَالَ أَنَا سَأَلْتُ، رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏ \"‏ صَلُّوا عَلَىَّ وَاجْتَهِدُوا فِي الدُّعَاءِ وَقُولُوا اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 1293,
			"arabicnumber": 1293,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا بَكْرٌ، - وَهُوَ ابْنُ مُضَرَ - عَنِ ابْنِ الْهَادِ، عَنْ عَبْدِ اللَّهِ بْنِ خَبَّابٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ قُلْنَا يَا رَسُولَ اللَّهِ السَّلاَمُ عَلَيْكَ قَدْ عَرَفْنَاهُ فَكَيْفَ الصَّلاَةُ عَلَيْكَ قَالَ ‏ \"‏ قُولُوا اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ عَبْدِكَ وَرَسُولِكَ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَبَارِكْ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 1294,
			"arabicnumber": 1294,
			"text": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكٍ، وَالْحَارِثُ بْنُ مِسْكِينٍ، قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، عَنِ ابْنِ الْقَاسِمِ، حَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، عَنْ أَبِيهِ، عَنْ عَمْرِو بْنِ سُلَيْمٍ الزُّرَقِيِّ، قَالَ أَخْبَرَنِي أَبُو حُمَيْدٍ السَّاعِدِيُّ، أَنَّهُمْ قَالُوا يَا رَسُولَ اللَّهِ كَيْفَ نُصَلِّي عَلَيْكَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ قُولُوا اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَأَزْوَاجِهِ وَذُرِّيَّتِهِ ‏\"‏ ‏.‏ فِي حَدِيثِ الْحَارِثِ ‏\"‏ كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ وَبَارِكْ عَلَى مُحَمَّدٍ وَأَزْوَاجِهِ وَذُرِّيَّتِهِ ‏\"‏ ‏.‏ قَالاَ جَمِيعًا ‏\"‏ كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ ‏\"‏ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ أَنْبَأَنَا قُتَيْبَةُ بِهَذَا الْحَدِيثِ مَرَّتَيْنِ وَلَعَلَّهُ أَنْ يَكُونَ قَدْ سَقَطَ عَلَيْهِ مِنْهُ شَطْرٌ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 1295,
			"arabicnumber": 1295,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ، - يَعْنِي ابْنَ الْمُبَارَكِ - قَالَ أَنْبَأَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ سُلَيْمَانَ، مَوْلَى الْحَسَنِ بْنِ عَلِيٍّ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم جَاءَ ذَاتَ يَوْمٍ وَالْبِشْرُ يُرَى فِي وَجْهِهِ فَقَالَ ‏ \"‏ إِنَّهُ جَاءَنِي جِبْرِيلُ صلى الله عليه وسلم فَقَالَ أَمَا يُرْضِيكَ يَا مُحَمَّدُ أَنْ لاَ يُصَلِّيَ عَلَيْكَ أَحَدٌ مِنْ أُمَّتِكَ إِلاَّ صَلَّيْتُ عَلَيْهِ عَشْرًا وَلاَ يُسَلِّمَ عَلَيْكَ أَحَدٌ مِنْ أُمَّتِكَ إِلاَّ سَلَّمْتُ عَلَيْهِ عَشْرًا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 1296,
			"arabicnumber": 1296,
			"text": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنِ الْعَلاَءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ صَلَّى عَلَىَّ وَاحِدَةً صَلَّى اللَّهُ عَلَيْهِ عَشْرًا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 1297,
			"arabicnumber": 1297,
			"text": "أَخْبَرَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، قَالَ حَدَّثَنَا يُونُسُ بْنُ أَبِي إِسْحَاقَ، عَنْ بُرَيْدِ بْنِ أَبِي مَرْيَمَ، قَالَ حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ صَلَّى عَلَىَّ صَلاَةً وَاحِدَةً صَلَّى اللَّهُ عَلَيْهِ عَشْرَ صَلَوَاتٍ وَحُطَّتْ عَنْهُ عَشْرُ خَطِيئَاتٍ وَرُفِعَتْ لَهُ عَشْرُ دَرَجَاتٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 1298,
			"arabicnumber": 1298,
			"text": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ، وَعَمْرُو بْنُ عَلِيٍّ، - وَاللَّفْظُ لَهُ - قَالاَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا سُلَيْمَانُ الأَعْمَشُ، قَالَ حَدَّثَنِي شَقِيقٌ، عَنْ عَبْدِ اللَّهِ، قَالَ كُنَّا إِذَا جَلَسْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي الصَّلاَةِ قُلْنَا السَّلاَمُ عَلَى اللَّهِ مِنْ عِبَادِهِ السَّلاَمُ عَلَى فُلاَنٍ وَفُلاَنٍ ‏.‏ فَقَال�� رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ تَقُولُوا السَّلاَمُ عَلَى اللَّهِ فَإِنَّ اللَّهَ هُوَ السَّلاَمُ وَلَكِنْ إِذَا جَلَسَ أَحَدُكُمْ فَلْيَقُلِ التَّحِيَّاتُ لِلَّهِ وَالصَّلَوَاتُ وَالطَّيِّبَاتُ السَّلاَمُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلاَمُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ فَإِنَّكُمْ إِذَا قُلْتُمْ ذَلِكَ أَصَابَتْ كُلَّ عَبْدٍ صَالِحٍ فِي السَّمَاءِ وَالأَرْضِ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ ثُمَّ لْيَتَخَيَّرْ مِنَ الدُّعَاءِ بَعْدُ أَعْجَبَهُ إِلَيْهِ يَدْعُو بِهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 1299,
			"arabicnumber": 1299,
			"text": "أَخْبَرَنَا عُبَيْدُ بْنُ وَكِيعِ بْنِ الْجَرَّاحِ، أَخُو سُفْيَانَ بْنِ وَكِيعٍ قَالَ حَدَّثَنَا أَبِي، عَنْ عِكْرِمَةَ بْنِ عَمَّارٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ جَاءَتْ أُمُّ سُلَيْمٍ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ عَلِّمْنِي كَلِمَاتٍ أَدْعُو بِهِنَّ فِي صَلاَتِي ‏.‏ قَالَ ‏ \"‏ سَبِّحِي اللَّهَ عَشْرًا وَاحْمَدِيهِ عَشْرًا وَكَبِّرِيهِ عَشْرًا ثُمَّ سَلِيهِ حَاجَتَكِ يَقُلْ نَعَمْ نَعَمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 1300,
			"arabicnumber": 1300,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا خَلَفُ بْنُ خَلِيفَةَ، عَنْ حَفْصِ بْنِ أَخِي، أَنَسٍ عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كُنْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم جَالِسًا - يَعْنِي - وَرَجُلٌ قَائِمٌ يُصَلِّي فَلَمَّا رَكَعَ وَسَجَدَ وَتَشَهَّدَ دَعَا فَقَالَ فِي دُعَائِهِ اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنَّ لَكَ الْحَمْدَ لاَ إِلَهَ إِلاَّ أَنْتَ الْمَنَّانُ بَدِيعُ السَّمَوَاتِ وَالأَرْضِ يَا ذَا الْجَلاَلِ وَالإِكْرَامِ يَا حَىُّ يَا قَيُّومُ إِنِّي أَسْأَلُكَ ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم لأَصْحَابِهِ ‏\"‏ تَدْرُونَ بِمَا دَعَا ‏\"‏ ‏.‏ قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ ‏.‏ قَالَ ‏\"‏ وَالَّذِي نَفْسِي بِيَدِهِ لَقَدْ دَعَا اللَّهَ بِاسْمِهِ الْعَظِيمِ الَّذِي إِذَا دُعِيَ بِهِ أَجَابَ وَإِذَا سُئِلَ بِهِ أَعْطَى ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 1301,
			"arabicnumber": 1301,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ يَزِيدَ أَبُو بُرَيْدٍ الْبَصْرِيُّ، عَنْ عَبْدِ الصَّمَدِ بْنِ عَبْدِ الْوَارِثِ، قَالَ حَدَّثَنَا أَبِي قَالَ، حَدَّثَنَا حُسَيْنٌ الْمُعَلِّمُ، عَنِ ابْنِ بُرَيْدَةَ، قَالَ حَدَّثَنِي حَنْظَلَةُ بْنُ عَلِيٍّ، أَنَّ مِحْجَنَ بْنَ الأَدْرَعِ، حَدَّثَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم دَخَلَ الْمَسْجِدَ إِذَا رَجُلٌ قَدْ قَضَى صَلاَتَهُ وَهُوَ يَتَشَهَّدُ فَقَالَ اللَّهُمَّ إِنِّي أَسْأَلُكَ يَا اللَّهُ بِأَنَّكَ الْوَاحِدُ الأَحَدُ الصَّمَدُ الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ أَنْ تَغْفِرَ لِي ذُنُوبِي إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ قَدْ غُفِرَ لَهُ ‏\"‏ ‏.‏ ثَلاَثًا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 1302,
			"arabicnumber": 1302,
			"text": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، عَنْ أَبِي بَكْرٍ الصِّدِّيقِ، - رضى الله عنهما أَنَّهُ قَالَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم عَلِّمْنِي دُعَاءً أَدْعُو بِهِ فِي صَلاَتِي ‏.‏ قَالَ ‏ \"‏ قُلِ اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيرًا وَلاَ يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ وَارْحَمْنِي إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 1303,
			"arabicnumber": 1303,
			"text": "أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ سَمِعْتُ حَيْوَةَ، يُحَدِّثُ عَنْ عُقْبَةَ بْنِ مُسْلِمٍ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ الْحُبُلِيِّ، عَنِ الصُّنَابِحِيِّ، عَنْ مُعَاذِ بْنِ جَبَلٍ، قَالَ أَخَذَ بِيَدِي رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ إِنِّي لأُحِبُّكَ يَا مُعَاذُ ‏\"‏ ‏.‏ فَقُلْتُ وَأَنَا أُحِبُّكَ يَا رَسُولَ اللَّهِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَلاَ تَدَعْ أَنْ تَقُولَ فِي كُلِّ صَلاَةٍ رَبِّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 1304,
			"arabicnumber": 1304,
			"text": "أَخْبَرَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ سَعِيدٍ الْجُرَيْرِيِّ، عَنْ أَبِي الْعَلاَءِ، عَنْ شَدَّادِ بْنِ أَوْسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَقُولُ فِي صَلاَتِهِ ‏ \"‏ اللَّهُمَّ إِنِّي أَسْأَلُكَ الثَّبَاتَ فِي الأَمْرِ وَالْعَزِيمَةِ عَلَى الرُّشْدِ وَأَسْأَلُكَ شُكْرَ نِعْمَتِكَ وَحُسْنَ عِبَادَتِكَ وَأَسْأَلُكَ قَلْبًا سَلِيمًا وَلِسَانًا صَادِقًا وَأَسْأَلُكَ مِنْ خَيْرِ مَا تَعْلَمُ وَأَعُوذُ بِكَ مِنْ شَرِّ مَا تَعْلَمُ وَأَسْتَغْفِرُكَ لِمَا تَعْلَمُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 1305,
			"arabicnumber": 1305,
			"text": "أَخْبَرَنَا يَحْيَى بْنُ حَبِيبِ بْنِ عَرَبِيٍّ، قَالَ حَدَّثَنَا حَمَّادٌ، قَالَ حَدَّثَنَا عَطَاءُ بْنُ السَّائِبِ، عَنْ أَبِيهِ، قَالَ صَلَّى بِنَا عَمَّارُ بْنُ يَاسِرٍ صَلاَةً فَأَوْجَزَ فِيهَا فَقَالَ لَهُ بَعْضُ الْقَوْمِ لَقَدْ خَفَّفْتَ أَوْ أَوْجَزْتَ الصَّلاَةَ ‏.‏ فَقَالَ أَمَّا عَلَى ذَلِكَ فَقَدْ دَعَوْتُ فِيهَا بِدَعَوَاتٍ سَمِعْتُهُنَّ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَلَمَّا قَامَ تَبِعَهُ رَجُلٌ مِنَ الْقَوْمِ هُوَ أَبِي غَيْرَ أَنَّهُ كَنَى عَنْ نَفْسِهِ فَسَأَلَهُ عَنِ الدُّعَاءِ ثُمَّ جَاءَ فَأَخْبَرَ بِهِ الْقَوْمَ ‏ \"‏ اللَّهُمَّ بِعِلْمِكَ الْغَيْبَ وَقُدْرَتِكَ عَلَى الْخَلْقِ أَحْيِنِي مَا عَلِمْتَ الْحَيَاةَ خَيْرًا لِي وَتَوَفَّنِي إِذَا عَلِمْتَ الْوَفَاةَ خَيْرًا لِي اللَّهُمَّ وَأَسْأَلُكَ خَشْيَتَكَ فِي الْغَيْبِ وَالشَّهَادَةِ وَأَسْأَلُكَ كَلِمَةَ الْحَقِّ فِي الرِّضَا وَالْغَضَبِ وَأَسْأَلُكَ الْقَصْدَ فِي الْفَقْرِ وَالْغِنَى وَأَسْأَلُكَ نَعِيمًا لاَ يَنْفَدُ وَأَسْأَلُكَ قُرَّةَ عَيْنٍ لاَ تَنْقَطِعُ وَأَسْأَلُكَ الرِّضَاءَ بَعْدَ الْقَضَاءِ وَأَسْأَلُكَ بَرْدَ الْعَيْشِ بَعْدَ الْمَوْتِ وَأَسْأَلُكَ لَذَّةَ النَّظَرِ إِلَى وَجْهِكَ وَالشَّوْقَ إِلَى لِقَائِكَ فِي غَيْرِ ضَرَّاءَ مُضِرَّةٍ وَلاَ فِتْنَةٍ مُضِلَّةٍ اللَّهُمَّ زَيِّنَّا بِزِينَةِ الإِيمَانِ وَاجْعَلْنَا هُدَاةً مُهْتَدِينَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 1306,
			"arabicnumber": 1306,
			"text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعْدِ بْنِ إِبْرَاهِيمَ بْنِ سَعْدٍ، قَالَ حَدَّثَنَا عَمِّي، قَالَ حَدَّثَنَا شَرِيكٌ، عَنْ أَبِي هَاشِمٍ الْوَاسِطِيِّ، عَنْ أَبِي مِجْلَزٍ، عَنْ قَيْسِ بْنِ عُبَادٍ، قَالَ صَلَّى عَمَّارُ بْنُ يَاسِرٍ بِالْقَوْمِ صَلاَةً أَخَفَّهَا فَكَأَنَّهُمْ أَنْكَرُوهَا فَقَالَ أَلَمْ أُتِمَّ الرُّكُوعَ وَالسُّجُودَ قَالُوا بَلَى ‏.‏ قَالَ أَمَّا إِنِّي دَعَوْتُ فِيهَا بِدُعَاءٍ كَانَ النَّبِيُّ صلى الله عليه وسلم يَدْعُو بِهِ ‏ \"‏ اللَّهُمَّ بِعِلْمِكَ الْغَيْبَ وَقُدْرَتِكَ عَلَى الْخَلْقِ أَحْيِنِي مَا عَلِمْتَ الْحَيَاةَ خَيْرًا لِي وَتَوَفَّنِي إِذَا عَلِمْتَ الْوَفَاةَ خَيْرًا لِي وَأَسْأَلُكَ خَشْيَتَكَ فِي الْغَيْبِ وَالشَّهَادَةِ وَكَلِمَةَ الإِخْلاَصِ فِي الرِّضَا وَالْغَضَبِ وَأَسْأَلُكَ نَعِيمًا لاَ يَنْفَدُ وَقُرَّةَ عَيْنٍ لاَ تَنْقَطِعُ وَأَسْأَلُكَ الرِّضَاءَ بِالْقَضَاءِ وَبَرْدَ الْعَيْشِ بَعْدَ الْمَوْتِ وَلَذَّةَ النَّظَرِ إِلَى وَجْهِكَ وَالشَّوْقَ إِلَى لِقَائِكَ وَأَعُوذُ بِكَ مِنْ ضَرَّاءَ مُضِرَّةٍ وَفِتْنَةٍ مُضِلَّةٍ اللَّهُمَّ زَيِّنَّا بِزِينَةِ الإِيمَانِ وَاجْعَلْنَا هُدَاةً مُهْتَدِينَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 1307,
			"arabicnumber": 1307,
			"text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ هِلاَلِ بْنِ يِسَافٍ، عَنْ فَرْوَةَ بْنِ نَوْفَلٍ، قَالَ قُلْتُ لِعَائِشَةَ حَدِّثِينِي بِشَىْءٍ، كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدْعُو بِهِ فِي صَلاَتِهِ ‏.‏ فَقَالَتْ نَعَمْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ مَا عَمِلْتُ وَمِنْ شَرِّ مَا لَمْ أَعْمَلْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 1308,
			"arabicnumber": 1308,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، عَنْ مُحَمَّدٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ أَشْعَثَ، عَنْ أَبِيهِ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، - رضى الله عنها - قَالَتْ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ عَذَابِ الْقَبْرِ فَقَالَ ‏ \"‏ نَعَمْ عَذَابُ الْقَبْرِ حَقٌّ ‏\"‏ ‏.‏ قَالَتْ عَائِشَةُ فَمَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يُصَلِّي صَلاَةً بَعْدُ إِلاَّ تَعَوَّذَ مِنْ عَذَابِ الْقَبْرِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 1309,
			"arabicnumber": 1309,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ، قَالَ حَدَّثَنَا أَبِي، عَنْ شُعَيْبٍ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ، أَخْبَرَتْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَدْعُو فِي الصَّلاَةِ ‏\"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْمَأْثَمِ وَالْمَغْرَمِ ‏\"‏ ‏.‏ فَقَالَ لَهُ قَائِلٌ مَا أَكْثَرَ مَا تَسْتَعِيذُ مِنَ الْمَغْرَمِ فَقَالَ ‏\"‏ إِنَّ الرَّجُلَ إِذَا غَرِمَ حَدَّثَ فَكَذَبَ وَوَعَدَ فَأَخْلَفَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 1310,
			"arabicnumber": 1310,
			"text": "أَخْبَرَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَمَّارٍ الْمَوْصِلِيُّ، عَنِ الْمُعَافَى، عَنِ الأَوْزَاعِيِّ، ح وَأَنْبَأَنَا عَلِيُّ بْنُ خَشْرَمٍ، عَنْ عِيسَى بْنِ يُونُسَ، - وَاللَّفْظُ لَهُ - عَنِ الأَوْزَاعِيِّ، عَنْ حَسَّانَ بْنِ عَطِيَّةَ، عَنْ مُحَمَّدِ بْنِ أَبِي عَائِشَةَ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا تَشَهَّدَ أَحَدُكُمْ فَلْيَتَعَوَّذْ بِاللَّهِ مِنْ أَرْبَعٍ مِنْ عَذَابِ جَهَنَّمَ وَعَذَابِ الْقَبْرِ وَفِتْنَةِ الْمَحْيَا وَالْمَمَاتِ وَمِنْ شَرِّ الْمَسِيحِ الدَّجَّالِ ثُمَّ يَدْعُو لِنَفْسِهِ بِمَا بَدَا لَهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 1311,
			"arabicnumber": 1311,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، عَنْ جَابِرٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَقُولُ فِي صَلاَتِهِ بَعْدَ التَّشَهُّدِ ‏ \"‏ أَحْسَنُ الْكَلاَمِ كَلاَمُ اللَّهِ وَأَحْسَنُ الْهَدْىِ هَدْىُ مُحَمَّدٍ صلى الله عليه وسلم ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 1312,
			"arabicnumber": 1312,
			"text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ، قَالَ حَدَّثَنَا مَالِكٌ، - وَهُوَ ابْنُ مِغْوَلٍ - عَنْ طَلْحَةَ بْنِ مُصَرِّفٍ، عَنْ زَيْدِ بْنِ وَهْبٍ، عَنْ حُذَيْفَةَ، أَنَّهُ رَأَى رَجُلاً يُصَلِّي فَطَفَّفَ فَقَالَ لَهُ حُذَيْفَةُ مُنْذُ كَمْ تُصَلِّي هَذِهِ الصَّلاَةَ قَالَ مُنْذُ أَرْبَعِينَ عَامًا ‏.‏ قَالَ مَا صَلَّيْتُ مُنْذُ أَرْبَعِينَ سَنَةً وَلَوْ مِتَّ وَأَنْتَ تُصَلِّي هَذِهِ الصَّلاَةَ لَمِتَّ عَلَى غَيْرِ فِطْرَةِ مُحَمَّدٍ صلى الله عليه وسلم ثُمَّ قَالَ إِنَّ الرَّجُلَ لَيُخَفِّفُ وَيُتِمُّ وَيُحْسِنُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 1313,
			"arabicnumber": 1313,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ عَجْلاَنَ، عَنْ عَلِيٍّ، - وَهُوَ ابْنُ يَحْيَى - عَنْ أَبِيهِ، عَنْ عَمٍّ، لَهُ بَدْرِيٍّ أَنَّهُ حَدَّثَهُ أَنَّ رَجُلاً دَخَلَ الْمَسْجِدَ فَصَلَّى وَرَسُولُ اللَّهِ صلى الله عليه وسلم يَرْمُقُهُ وَنَحْنُ لاَ نَشْعُرُ فَلَمَّا فَرَغَ أَقْبَلَ فَسَلَّمَ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ ارْجِعْ فَصَلِّ فَإِنَّكَ لَمْ تُصَلِّ ‏\"‏ ‏.‏ فَرَجَعَ فَصَلَّى ثُمَّ أَقْبَلَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ ارْجِعْ فَصَلِّ فَإِنَّكَ لَمْ تُصَلِّ ‏\"‏ ‏.‏ مَرَّتَيْنِ أَوْ ثَلاَثًا ‏.‏ فَقَالَ لَهُ الرَّجُلُ وَالَّذِي أَكْرَمَكَ يَا رَسُولَ اللَّهِ لَقَدْ جَهِدْتُ فَعَلِّمْنِي فَقَالَ ‏\"‏ إِذَا قُمْتَ تُرِيدُ الصَّلاَةَ فَتَوَضَّأْ فَأَحْسِنْ وُضُوءَكَ ثُمَّ اسْتَقْبِلِ الْقِبْلَةَ فَكَبِّرْ ثُمَّ اقْرَأْ ثُمَّ ارْكَعْ فَاطْمَئِنَّ رَاكِعًا ثُمَّ ارْفَعْ حَتَّى تَعْتَدِلَ قَائِمًا ثُمَّ اسْجُدْ حَتَّى تَطْمَئِنَّ سَاجِدًا ثُمَّ ارْفَعْ حَتَّى تَطْمَئِنَّ قَاعِدًا ثُمَّ اسْجُدْ حَتَّى تَطْمَئِنَّ سَاجِدًا ثُمَّ ارْفَعْ ثُمَّ افْعَلْ كَذَلِكَ حَتَّى تَفْرُغَ مِنْ صَلاَتِكَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 1314,
			"arabicnumber": 1314,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ دَاوُدَ بْنِ قَيْسٍ، قَالَ حَدَّثَنِي عَلِيُّ بْنُ يَحْيَى بْنِ خَلاَّدِ بْنِ رَافِعِ بْنِ مَالِكٍ الأَنْصَارِيُّ، قَالَ حَدَّثَنِي أَبِي، عَنْ عَمٍّ، لَهُ بَدْرِيٍّ قَالَ كُنْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم جَالِسًا فِي الْمَسْجِدِ فَدَخَلَ رَجُلٌ فَصَلَّى رَكْعَتَيْنِ ثُمَّ جَاءَ فَسَلَّمَ عَلَى النَّبِيِّ صلى الله عليه وسلم وَقَدْ كَانَ النَّبِيُّ صلى الله عليه وسلم يَرْمُقُهُ فِي صَلاَتِهِ فَرَدَّ عَلَيْهِ السَّلاَمَ ثُمَّ قَالَ لَهُ ‏\"‏ ارْجِعْ فَصَلِّ فَإِنَّكَ لَمْ تُصَلِّ ‏\"‏ ‏.‏ فَرَجَعَ فَصَلَّى ثُمَّ جَاءَ فَسَلَّمَ عَلَى النَّبِيِّ صلى الله عليه وسلم فَرَدَّ عَلَيْهِ السَّلاَمَ ثُمَّ قَالَ ‏\"‏ ارْجِعْ فَصَلِّ فَإِنَّكَ لَمْ تُصَلِّ ‏\"‏ ‏.‏ حَتَّى كَانَ عِنْدَ الثَّالِثَةِ أَوِ الرَّابِعَةِ فَقَالَ وَالَّذِي أَنْزَلَ عَلَيْكَ الْكِتَابَ لَقَدْ جَهِدْتُ وَحَرَصْتُ فَأَرِنِي وَعَلِّمْنِي ‏.‏ قَالَ ‏\"‏ إِذَا أَرَدْتَ أَنْ تُصَلِّيَ فَتَوَضَّأْ فَأَحْسِنْ وُضُوءَكَ ثُمَّ اسْتَقْبِلِ الْقِبْلَةَ فَكَبِّرْ ثُمَّ اقْرَأْ ثُمَّ ارْكَعْ حَتَّى تَطْمَئِنَّ رَاكِعًا ثُمَّ ارْفَعْ حَتَّى تَعْتَدِلَ قَائِمًا ثُمَّ اسْجُدْ حَتَّى تَطْمَئِنَّ سَاجِدًا ثُمَّ ارْفَعْ حَتَّى تَطْمَئِنَّ قَاعِدًا ثُمَّ اسْجُدْ حَتَّى تَطْمَئِنَّ سَاجِدًا ثُمَّ ارْفَعْ فَإِذَا أَتْمَمْتَ صَلاَتَكَ عَلَى هَذَا فَقَدْ تَمَّتْ وَمَا انْتَقَصْتَ مِنْ هَذَا فَإِنَّمَا تَنْتَقِصُهُ مِنْ صَلاَتِكَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 1315,
			"arabicnumber": 1315,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، عَنْ زُرَارَةَ بْنِ أَوْفَى، عَنْ سَعْدِ بْنِ هِشَامٍ، قَالَ قُلْتُ يَا أُمَّ الْمُؤْمِنِينَ أَنْبِئِينِي عَنْ وَتْرِ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ قَالَتْ كُنَّا نُعِدُّ لَهُ سِوَاكَهُ وَطُهُورَهُ فَيَبْعَثُهُ اللَّهُ لِمَا شَاءَ أَنْ يَبْعَثَهُ مِنَ اللَّيْلِ فَيَتَسَوَّكُ وَيَتَوَضَّأُ وَيُصَلِّي ثَمَانِ رَكَعَاتٍ لاَ يَجْلِسُ فِيهِنَّ إِلاَّ عِنْدَ الثَّامِنَةِ فَيَجْلِسُ فَيَذْكُرُ اللَّهَ عَزَّ وَجَلَّ وَيَدْعُو ثُمَّ يُسَلِّمُ تَسْلِيمًا يُسْمِعُنَا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 1316,
			"arabicnumber": 1316,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ بْنِ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا سُلَيْمَانُ، - يَعْنِي ابْنَ دَاوُدَ الْهَاشِمِيُّ - قَالَ حَدَّثَنَا إِبْرَاهِيمُ، - وَهُوَ ابْنُ سَعْدٍ - قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ جَعْفَرٍ، - وَهُوَ ابْنُ الْمِسْوَرِ الْمَخْرَمِيُّ - عَنْ إِسْمَاعِيلَ بْنِ مُحَمَّدٍ، قَالَ حَدَّثَنِي عَامِرُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُسَلِّمُ عَنْ يَمِينِهِ وَعَنْ يَسَارِهِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 1317,
			"arabicnumber": 1317,
			"text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا أَبُو عَامِرٍ الْعَقَدِيُّ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ الْمَخْرَمِيُّ، عَنْ إِسْمَاعِيلَ بْنِ مُحَمَّدِ بْنِ سَعْدٍ، عَنْ عَامِرِ بْنِ سَعْدٍ، عَنْ سَعْدٍ، قَالَ كُنْتُ أَرَى رَسُولَ اللَّهِ صلى الله عليه وسلم يُسَلِّمُ عَنْ يَمِينِهِ وَعَنْ يَسَارِهِ حَتَّى يُرَى بَيَاضُ خَدِّهِ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ عَبْدُ اللَّهِ بْنُ جَعْفَرٍ هَذَا لَيْسَ بِهِ بَأْسٌ وَعَبْدُ اللَّهِ بْنُ جَعْفَرِ بْنِ نَجِيحٍ وَالِدُ عَلِيِّ بْنِ الْمَدِينِيِّ مَتْرُوكُ الْحَدِيثِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 1318,
			"arabicnumber": 1318,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ، عَنْ مِسْعَرٍ، عَنْ عُبَيْدِ اللَّهِ ابْنِ الْقِبْطِيَّةِ، قَالَ سَمِعْتُ جَابِرَ بْنَ سَمُرَةَ، يَقُولُ كُنَّا إِذَا صَلَّيْنَا خَلْفَ النَّبِيِّ صلى الله عليه وسلم قُلْنَا السَّلاَمُ عَلَيْكُمُ السَّلاَمُ عَلَيْكُمْ ‏.‏ وَأَشَارَ مِسْعَرٌ بِيَدِهِ عَنْ يَمِينِهِ وَعَنْ شِمَالِهِ فَقَالَ ‏ \"‏ مَا بَالُ هَؤُلاَءِ الَّذِينَ يَرْمُونَ بِأَيْدِيهِمْ كَأَنَّهَا أَذْنَابُ الْخَيْلِ الشُّمُسِ أَمَا يَكْفِي أَنْ يَضَعَ يَدَهُ عَلَى فَخِذِهِ ثُمَّ يُسَلِّمُ عَلَى أَخِيهِ عَنْ يَمِينِهِ وَعَنْ شِمَالِهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 1319,
			"arabicnumber": 1319,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا مُعَاذُ بْنُ مُعَاذٍ، قَالَ حَدَّثَنَا زُهَيْرٌ، عَنْ أَبِي إِسْحَاقَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الأَسْوَدِ، عَنِ الأَسْوَدِ، وَعَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يُكَبِّرُ فِي كُلِّ خَفْضٍ وَرَفْعٍ وَقِيَامٍ وَقُعُودٍ وَيُسَلِّمُ عَنْ يَمِينِهِ وَعَنْ شِمَالِهِ ‏ \"‏ السَّلاَمُ عَلَيْكُمْ وَرَحْمَةُ اللَّهِ السَّلاَمُ عَلَيْكُمْ وَرَحْمَةُ اللَّهِ ‏\"‏ ‏.‏ حَتَّى يُرَى بَيَاضُ خَدِّهِ وَرَأَيْتُ أَبَا بَكْرٍ وَعُمَرَ - رضى الله عنهما - يَفْعَلاَنِ ذَلِكَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 1320,
			"arabicnumber": 1320,
			"text": "أَخْبَرَنَا الْحَسَنُ بْنُ مُحَمَّدٍ الزَّعْفَرَانِيُّ، عَنْ حَجَّاجٍ، قَالَ ابْنُ جُرَيْجٍ أَنْبَأَنَا عَمْرُو بْنُ يَحْيَى، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، عَنْ عَمِّهِ، وَاسِعِ بْنِ حَبَّانَ، ‏.‏ أَنَّهُ سَأَلَ عَبْدَ اللَّهِ بْنَ عُمَرَ عَنْ صَلاَةِ، رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ اللَّهُ أَكْبَرُ كُلَّمَا وَضَعَ اللَّهُ أَكْبَرُ كُلَّمَا رَفَعَ ثُمَّ يَقُولُ ‏ \"‏ السَّلاَمُ عَلَيْكُمْ وَرَحْمَةُ اللَّهِ عَنْ يَمِينِهِ السَّلاَمُ عَلَيْكُمْ وَرَحْمَةُ اللَّهِ عَنْ يَسَارِهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 1321,
			"arabicnumber": 1321,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ، - يَعْنِي الدَّرَاوَرْدِيَّ - عَنْ عَمْرِو بْنِ يَحْيَى، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، عَنْ عَمِّهِ، وَاسِعِ بْنِ حَبَّانَ، قَالَ قُلْتُ لاِبْنِ عُمَرَ أَخْبِرْنِي عَنْ صَلاَةِ، رَسُولِ اللَّهِ صلى الله عليه وسلم كَيْفَ كَانَتْ قَالَ فَذَكَرَ التَّكْبِيرَ قَالَ يَعْنِي وَذَكَرَ ‏\"‏ السَّلاَمُ عَلَيْكُمْ وَرَحْمَةُ اللَّهِ\" عَنْ يَمِينِهِ, \"السَّلاَمُ عَلَيْكُمْ\" عَنْ يَسَارِهِ.\"‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 1322,
			"arabicnumber": 1322,
			"text": "أَخْبَرَنَا زَيْدُ بْنُ أَخْزَمَ، عَنِ ابْنِ دَاوُدَ، - يَعْنِي عَبْدَ اللَّهِ بْنَ دَاوُدَ الْخُرَيْبِيَّ - عَنْ عَلِيِّ بْنِ صَالِحٍ، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي الأَحْوَصِ، عَنْ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ كَأَنِّي أَنْظُرُ إِلَى بَيَاضِ خَدِّهِ عَنْ يَمِينِهِ ‏\"‏ السَّلاَمُ عَلَيْكُمْ وَرَحْمَةُ اللَّهِ ‏\"‏ ‏.‏ وَعَنْ يَسَارِهِ ‏\"‏ السَّلاَمُ عَلَيْكُمْ وَرَحْمَةُ اللَّهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 1323,
			"arabicnumber": 1323,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ آدَمَ، عَنْ عُمَرَ بْنِ عُبَيْدٍ، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي الأَحْوَصِ، عَنْ عَبْدِ اللَّهِ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُسَلِّمُ عَنْ يَمِينِهِ حَتَّى يَبْدُوَ بَيَاضُ خَدِّهِ وَعَنْ يَسَارِهِ حَتَّى يَبْدُوَ بَيَاضُ خَدِّهِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 1324,
			"arabicnumber": 1324,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، عَنْ سُفْيَانَ، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي الأَحْوَصِ، عَنْ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ أَنَّهُ كَانَ يُسَلِّمُ عَنْ يَمِينِهِ وَعَنْ يَسَارِهِ ‏ \"‏ السَّلاَمُ عَلَيْكُمْ وَرَحْمَةُ اللَّهِ السَّلاَمُ عَلَيْكُمْ وَرَحْمَةُ اللَّهِ ‏\"‏ ‏.‏ حَتَّى يُرَى بَيَاضُ خَدِّهِ مِنْ هَا هُنَا وَبَيَاضُ خَدِّهِ مِنْ هَا هُنَا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 1325,
			"arabicnumber": 1325,
			"text": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ يَعْقُوبَ، قَالَ حَدَّثَنَا عَلِيُّ بْنُ الْحَسَنِ بْنِ شَقِيقٍ، قَالَ أَنْبَأَنَا الْحُسَيْنُ بْنُ وَاقِدٍ، قَالَ حَدَّثَنَا أَبُو إِسْحَاقَ، عَنْ عَلْقَمَةَ، وَالأَسْوَدِ، وَأَبِي الأَحْوَصِ، قَالُوا حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْعُودٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُسَلِّمُ عَنْ يَمِينِهِ ‏\"‏ السَّلاَمُ عَلَيْكُمْ وَرَحْمَةُ اللَّهِ ‏\"‏ ‏.‏ حَتَّى يُرَى بَيَاضُ خَدِّهِ الأَيْمَنِ وَعَنْ يَسَارِهِ ‏\"‏ السَّلاَمُ عَلَيْكُمْ وَرَحْمَةُ اللَّهِ ‏\"‏ ‏.‏ حَتَّى يُرَى بَيَاضُ خَدِّهِ الأَيْسَرِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 1326,
			"arabicnumber": 1326,
			"text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، قَالَ حَدَّثَنَا إِسْرَائِيلُ، عَنْ فُرَاتٍ الْقَزَّازِ، عَنْ عُبَيْدِ اللَّهِ، - وَهُوَ ابْنُ الْقِبْطِيَّةِ - عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ صَلَّيْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَكُنَّا إِذَا سَلَّمْنَا قُلْنَا بِأَيْدِينَا السَّلاَمُ عَلَيْكُمُ السَّلاَمُ عَلَيْكُمْ - قَالَ - فَنَظَرَ إِلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏ \"‏ مَا شَأْنُكُمْ تُشِيرُونَ بِأَيْدِيكُمْ كَأَنَّهَا أَذْنَابُ خَيْلٍ شُمْسٍ إِذَا سَلَّمَ أَحَدُكُمْ فَلْيَلْتَفِتْ إِلَى صَاحِبِهِ وَلاَ يُومِئْ بِيَدِهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 1327,
			"arabicnumber": 1327,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، أَخْبَرَهُ قَالَ أَخْبَرَنِي مَحْمُودُ بْنُ الرَّبِيعِ، قَالَ سَمِعْتُ عِتْبَانَ بْنَ مَالِكٍ، يَقُولُ كُنْتُ أُصَلِّي بِقَوْمِي بَنِي سَالِمٍ فَأَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقُلْتُ إِنِّي قَدْ أَنْكَرْتُ بَصَرِي وَإِنَّ السُّيُولَ تَحُولُ بَيْنِي وَبَيْنَ مَسْجِدِ قَوْمِي فَلَوَدِدْتُ أَنَّكَ جِئْتَ فَصَلَّيْتَ فِي بَيْتِي مَكَانًا أَتَّخِذُهُ مَسْجِدًا ‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ سَأَفْعَلُ إِنْ شَاءَ اللَّهُ ‏\"‏ ‏.‏ فَغَدَا عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَبُو بَكْرٍ - رضى الله عنه - مَعَهُ بَعْدَ مَا اشْتَدَّ النَّهَارُ فَاسْتَأْذَنَ النَّبِيُّ صلى الله عليه وسلم فَأَذِنْتُ لَهُ فَلَمْ يَجْلِسْ حَتَّى قَالَ ‏\"‏ أَيْنَ تُحِبُّ أَنْ أُصَلِّيَ مِنْ بَيْتِكَ ‏\"‏ ‏.‏ فَأَشَرْتُ لَهُ إِلَى الْمَكَانِ الَّذِي أُحِبُّ أَنْ يُصَلِّيَ فِيهِ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَصَفَفْنَا خَلْفَهُ ثُمَّ سَلَّمَ وَسَلَّمْنَا حِينَ سَلَّمَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 1328,
			"arabicnumber": 1328,
			"text": "أَخْبَرَنَا سُلَيْمَانُ بْنُ دَاوُدَ بْنِ حَمَّادِ بْنِ سَعْدٍ، عَنِ ابْنِ وَهْبٍ، قَالَ أَخْبَرَنِي ابْنُ أَبِي ذِئْبٍ، وَعَمْرُو بْنُ الْحَارِثِ، وَيُونُسُ بْنُ يَزِيدَ، أَنَّ ابْنَ شِهَابٍ، أَخْبَرَهُمْ عَنْ عُرْوَةَ، قَالَ قَالَتْ عَائِشَةُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي فِيمَا بَيْنَ أَنْ يَفْرُغَ مِنْ صَلاَةِ الْعِشَاءِ إِلَى الْفَجْرِ إِحْدَى عَشْرَةَ رَكْعَةً وَيُوتِرُ بِوَاحِدَةٍ وَيَسْجُدُ سَجْدَةً قَدْرَ مَا يَقْرَأُ أَحَدُكُمْ خَمْسِينَ آيَةً قَبْلَ أَنْ يَرْفَعَ رَأْسَهُ ‏.‏ وَبَعْضُهُمْ يَزِيدُ عَلَى بَعْضٍ فِي الْحَدِيثِ ‏.‏ مُخْتَصَرٌ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 1329,
			"arabicnumber": 1329,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ آدَمَ، عَنْ حَفْصٍ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم سَلَّمَ ثُمَّ تَكَلَّمَ ثُمَّ سَجَدَ سَجْدَتَىِ السَّهْوِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 1330,
			"arabicnumber": 1330,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، عَنْ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ، عَنْ عِكْرِمَةَ بْنِ عَمَّارٍ، قَالَ حَدَّثَنَا ضَمْضَمُ بْنُ جَوْسٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم سَلَّمَ ثُمَّ سَجَدَ سَجْدَتَىِ السَّهْوِ وَهُوَ جَالِسٌ ثُمَّ سَلَّمَ ‏.‏ قَالَ ذَكَرَهُ فِي حَدِيثِ ذِي الْيَدَيْنِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 1331,
			"arabicnumber": 1331,
			"text": "أَخْبَرَنَا يَحْيَى بْنُ حَبِيبِ بْنِ عَرَبِيٍّ، قَالَ حَدَّثَنَا حَمَّادٌ، قَالَ حَدَّثَنَا خَالِدٌ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي الْمُهَلَّبِ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم صَلَّى ثَلاَثًا ثُمَّ سَلَّمَ فَقَالَ الْخِرْبَاقُ إِنَّكَ صَلَّيْتَ ثَلاَثًا ‏.‏ فَصَلَّى بِهِمُ الرَّكْعَةَ الْبَاقِيَةَ ثُمَّ سَلَّمَ ثُمَّ سَجَدَ سَجْدَتَىِ السَّهْوِ ثُمَّ سَلَّمَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 1332,
			"arabicnumber": 1332,
			"text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ هِلاَلٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ رَمَقْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي صَلاَتِهِ فَوَجَدْتُ قِيَامَهُ وَرَكْعَتَهُ وَاعْتِدَالَهُ بَعْدَ الرَّكْعَةِ فَسَجْدَتَهُ فَجَلْسَتَهُ بَيْنَ السَّجْدَتَيْنِ فَسَجْدَتَهُ فَجَلْسَتَهُ بَيْنَ التَّسْلِيمِ وَالاِنْصِرَافِ قَرِيبًا مِنَ السَّوَاءِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 1333,
			"arabicnumber": 1333,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ يُونُسَ، قَالَ ابْنُ شِهَابٍ أَخْبَرَتْنِي هِنْدُ بِنْتُ الْحَارِثِ الْفِرَاسِيَّةُ، أَنَّ أُمَّ سَلَمَةَ، أَخْبَرَتْهَا أَنَّ النِّسَاءَ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم كُنَّ إِذَا سَلَّمْنَ مِنَ الصَّلاَةِ قُمْنَ وَثَبَتَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَمَنْ صَلَّى مِنَ الرِّجَالِ مَا شَاءَ اللَّهُ فَإِذَا قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَامَ الرِّجَالُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 1334,
			"arabicnumber": 1334,
			"text": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ سُفْيَانَ، قَالَ حَدَّثَنِي يَعْلَى بْنُ عَطَاءٍ، عَنْ جَابِرِ بْنِ يَزِيدَ بْنِ الأَسْوَدِ، عَنْ أَبِيهِ، أَنَّهُ صَلَّى مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم صَلاَةَ الصُّبْحِ فَلَمَّا صَلَّى انْحَرَفَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 1335,
			"arabicnumber": 1335,
			"text": "أَخْبَرَنَا بِشْرُ بْنُ خَالِدٍ الْعَسْكَرِيُّ، قَالَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ، عَنْ سُفْيَانَ بْنِ عُيَيْنَةَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ أَبِي مَعْبَدٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ إِنَّمَا كُنْتُ أَعْلَمُ انْقِضَاءَ صَلاَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم بِالتَّكْبِيرِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 1336,
			"arabicnumber": 1336,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، عَنِ اللَّيْثِ، عَنْ حُنَيْنِ بْنِ أَبِي حَكِيمٍ، عَنْ عُلَىِّ بْنِ رَبَاحٍ، عَنْ عُقْبَةَ بْنِ عَامِرٍ، قَالَ أَمَرَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ أَقْرَأَ الْمُعَوِّذَاتِ دُبُرَ كُلِّ صَلاَةٍ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 1337,
			"arabicnumber": 1337,
			"text": "أَخْبَرَنَا مَحْمُودُ بْنُ خَالِدٍ، قَالَ حَدَّثَنَا الْوَلِيدُ، عَنْ أَبِي عَمْرٍو الأَوْزَاعِيِّ، قَالَ حَدَّثَنِي شَدَّادٌ أَبُو عَمَّارٍ، أَنَّ أَبَا أَسْمَاءَ الرَّحَبِيَّ، حَدَّثَهُ أَنَّهُ، سَمِعَ ثَوْبَانَ، مَوْلَى رَسُولِ اللَّهِ صلى الله عليه وسلم يُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا انْصَرَفَ مِنْ صَلاَتِهِ اسْتَغْفَرَ ثَلاَثًا وَقَالَ ‏ \"‏ اللَّهُمَّ أَنْتَ السَّلاَمُ وَمِنْكَ السَّلاَمُ تَبَارَكْتَ يَا ذَا الْجَلاَلِ وَالإِكْرَامِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 1338,
			"arabicnumber": 1338,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، وَمُحَمَّدُ بْنُ إِبْرَاهِيمَ بْنِ صُدْرَانَ، عَنْ خَالِدٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عَاصِمٍ، عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ، عَنْ عَائِشَةَ، - رضى الله عنها أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا سَلَّمَ قَالَ ‏ \"‏ اللَّهُمَّ أَنْتَ السَّلاَمُ وَمِنْكَ السَّلاَمُ تَبَارَكْتَ يَا ذَا الْجَلاَلِ وَالإِكْرَامِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 1339,
			"arabicnumber": 1339,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ شُجَاعٍ الْمَرُّوذِيُّ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنِ الْحَجَّاجِ بْنِ أَبِي عُثْمَانَ، قَالَ حَدَّثَنِي أَبُو الزُّبَيْرِ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ الزُّبَيْرِ، يُحَدِّثُ عَلَى هَذَا الْمِنْبَرِ وَهُوَ يَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا سَلَّمَ يَقُولُ ‏ \"‏ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ لاَ إِلَهَ إِلاَّ اللَّهُ لاَ نَعْبُدُ إِلاَّ إِيَّاهُ أَهْلَ النِّعْمَةِ وَالْفَضْلِ وَالثَّنَاءِ الْحَسَنِ لاَ إِلَهَ إِلاَّ اللَّهُ مُخْلِصِينَ لَهُ الدِّينَ وَلَوْ كَرِهَ الْكَافِرُونَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 1340,
			"arabicnumber": 1340,
			"text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا عَبْدَةُ، قَالَ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِي الزُّبَيْرِ، قَالَ كَانَ عَبْدُ اللَّهِ بْنُ الزُّبَيْرِ يُهَلِّلُ فِي دُبُرِ الصَّلاَةِ يَقُولُ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ لاَ إِلَهَ إِلاَّ اللَّهُ وَلاَ نَعْبُدُ إِلاَّ إِيَّاهُ لَهُ النِّعْمَةُ وَلَهُ الْفَضْلُ وَلَهُ الثَّنَاءُ الْحَسَنُ لاَ إِلَهَ إِلاَّ اللَّهُ مُخْلِصِينَ لَهُ الدِّينَ وَلَوْ كَرِهَ الْكَافِرُونَ ‏.‏ ثُمَّ يَقُولُ ابْنُ الزُّبَيْرِ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُهَلِّلُ بِهِنَّ فِي دُبُرِ الصَّلاَةِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 1341,
			"arabicnumber": 1341,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، عَنْ سُفْيَانَ، قَالَ سَمِعْتُهُ مِنْ، عَبْدَةَ بْنِ أَبِي لُبَابَةَ وَسَمِعْتُهُ مِنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، كِلاَهُمَا سَمِعَهُ مِنْ، وَرَّادٍ، كَاتِبِ الْمُغِيرَةِ بْنِ شُعْبَةَ قَالَ كَتَبَ مُعَاوِيَةُ إِلَى الْمُغِيرَةِ بْنِ شُعْبَةَ أَخْبِرْنِي بِشَىْءٍ، سَمِعْتَهُ مِنْ، رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ فَقَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا قَضَى الصَّلاَةَ قَالَ ‏ \"‏ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ اللَّهُمَّ لاَ مَانِعَ لِمَا أَعْطَيْتَ وَلاَ مُعْطِيَ لِمَا مَنَعْتَ وَلاَ يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 1342,
			"arabicnumber": 1342,
			"text": "أَخْبَرَنِي مُحَمَّدُ بْنُ قُدَامَةَ، قَالَ حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنِ الْمُسَيَّبِ أَبِي الْعَلاَءِ، عَنْ وَرَّادٍ، قَالَ كَتَبَ الْمُغِيرَةُ بْنُ شُعْبَةَ إِلَى مُعَاوِيَةَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَقُولُ دُبُرَ الصَّلاَةِ إِذَا سَلَّمَ ‏ \"‏ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ اللَّهُمَّ لاَ مَانِعَ لِمَا أَعْطَيْتَ وَلاَ مُعْطِيَ لِمَا مَنَعْتَ وَلاَ يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 1343,
			"arabicnumber": 1343,
			"text": "أَخْبَرَنَا الْحَسَنُ بْنُ إِسْمَاعِيلُ الْمُجَالِدِيُّ، قَالَ أَنْبَأَنَا هُشَيْمٌ، قَالَ أَنْبَأَنَا الْمُغِيرَةُ، وَذَكَرَ، آخَرَ ح وَأَنْبَأَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا هُشَيْمٌ، قَالَ أَنْبَأَنَا غَيْرُ، وَاحِدٍ، مِنْهُمُ الْمُغِيرَةُ عَنِ الشَّعْبِيِّ، عَنْ وَرَّادٍ، كَاتِبِ الْمُغِيرَةِ أَنَّ مُعَاوِيَةَ، كَتَبَ إِلَى الْمُغِيرَةِ أَنِ اكْتُبْ إِلَىَّ بِحَدِيثٍ سَمِعْتَهُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ فَكَتَبَ إِلَيْهِ الْمُغِيرَةُ إِنِّي سَمِعْتُهُ يَقُولُ عِنْدَ انْصِرَافِهِ مِنَ الصَّلاَةِ ‏ \"‏ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ ‏\"‏ ‏.‏ ثَلاَثَ مَرَّاتٍ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 1344,
			"arabicnumber": 1344,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْحَاقَ الصَّاغَانِيُّ، قَالَ حَدَّثَنَا أَبُو سَلَمَةَ الْخُزَاعِيُّ، مَنْصُورُ بْنُ سَلَمَةَ قَالَ حَدَّثَنَا خَلاَّدُ بْنُ سُلَيْمَانَ، - قَالَ أَبُو سَلَمَةَ وَكَانَ مِنَ الْخَائِفِينَ - عَنْ خَالِدِ بْنِ أَبِي عِمْرَانَ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا جَلَسَ مَجْلِسًا أَوْ صَلَّى تَكَلَّمَ بِكَلِمَاتٍ فَسَأَلَتْهُ عَائِشَةُ عَنِ الْكَلِمَاتِ فَقَالَ ‏ \"‏ إِنْ تَكَلَّمَ بِخَيْرٍ كَانَ طَابِعًا عَلَيْهِنَّ إِلَى يَوْمِ الْقِيَامَةِ وَإِنْ تَكَلَّمَ بِغَيْرِ ذَلِكَ كَانَ كَفَّارَةً لَهُ سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 1345,
			"arabicnumber": 1345,
			"text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا يَعْلَى، قَالَ حَدَّثَنَا قُدَامَةُ، عَنْ جَسْرَةَ، قَالَتْ حَدَّثَتْنِي عَائِشَةُ، - رضى الله عنها - قَالَتْ دَخَلَتْ عَلَىَّ امْرَأَةٌ مِنَ الْيَهُودِ فَقَالَتْ إِنَّ عَذَابَ الْقَبْرِ مِنَ الْبَوْلِ ‏.‏ فَقُلْتُ كَذَبْتِ ‏.‏ فَقَالَتْ بَلَى إِنَّا لَنَقْرِضُ مِنْهُ الْجِلْدَ وَالثَّوْبَ ‏.‏ فَخَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى الصَّلاَةِ وَقَدِ ارْتَفَعَتْ أَصْوَاتُنَا فَقَالَ ‏\"‏ مَا هَذَا ‏\"‏ ‏.‏ فَأَخْبَرْتُهُ بِمَا قَالَتْ فَقَالَ ‏\"‏ صَدَقَتْ ‏\"‏ ‏.‏ فَمَا صَلَّى بَعْدَ يَوْمَئِذٍ صَلاَةً إِلاَّ قَالَ فِي دُبُرِ الصَّلاَةِ ‏\"‏ رَبَّ جِبْرِيلَ وَمِيكَائِيلَ وَإِسْرَافِيلَ أَعِذْنِي مِنْ حَرِّ النَّارِ وَعَذَابِ الْقَبْرِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 1346,
			"arabicnumber": 1346,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ سَوَّادِ بْنِ الأَسْوَدِ بْنِ عَمْرٍو، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي حَفْصُ بْنُ مَيْسَرَةَ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ عَطَاءِ بْنِ أَبِي مَرْوَانَ، عَنْ أَبِيهِ، أَنَّ كَعْبًا، حَلَفَ لَهُ بِاللَّهِ الَّذِي فَلَقَ الْبَحْرَ لِمُوسَى إِنَّا لَنَجِدُ فِي التَّوْرَاةِ أَنَّ دَاوُدَ نَبِيَّ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا انْصَرَفَ مِنْ صَلاَتِهِ قَالَ ‏\"‏ اللَّهُمَّ أَصْلِحْ لِي دِينِي الَّذِي جَعَلْتَهُ لِي عِصْمَةً وَأَصْلِحْ لِي دُنْيَاىَ الَّتِي جَعَلْتَ فِيهَا مَعَاشِي اللَّهُمَّ إِنِّي أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ وَأَعُوذُ بِعَفْوِكَ مِنْ نِقْمَتِكَ وَأَعُوذُ بِكَ مِنْكَ لاَ مَانِعَ لِمَا أَعْطَيْتَ وَلاَ مُعْطِيَ لِمَا مَنَعْتَ وَلاَ يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ ‏.‏ قَالَ وَحَدَّثَنِي كَعْبٌ أَنَّ صُهَيْبًا حَدَّثَهُ أَنَّ مُحَمَّدًا صلى الله عليه وسلم كَانَ يَقُولُهُنَّ عِنْدَ انْصِرَافِهِ مِنْ صَلاَتِهِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 1347,
			"arabicnumber": 1347,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ عُثْمَانَ الشَّحَّامِ، عَنْ مُسْلِمِ بْنِ أَبِي بَكْرَةَ، قَالَ كَانَ أَبِي يَقُولُ فِي دُبُرِ الصَّلاَةِ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ وَالْفَقْرِ وَعَذَابِ الْقَبْرِ فَكُنْتُ أَقُولُهُنَّ فَقَالَ أَبِي أَىْ بُنَىَّ عَمَّنْ أَخَذْتَ هَذَا قُلْتُ عَنْكَ ‏.‏ قَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَقُولُهُنَّ فِي دُبُرِ الصَّلاَةِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 1348,
			"arabicnumber": 1348,
			"text": "أَخْبَرَنَا يَحْيَى بْنُ حَبِيبِ بْنِ عَرَبِيٍّ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ عَطَاءِ بْنِ السَّائِبِ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ خَلَّتَانِ لاَ يُحْصِيهِمَا رَجُلٌ مُسْلِمٌ إِلاَّ دَخَلَ الْجَنَّةَ وَهُمَا يَسِيرٌ وَمَنْ يَعْمَلُ بِهِمَا قَلِيلٌ ‏\"‏ ‏.‏ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الصَّلَوَاتُ الْخَمْسُ يُسَبِّحُ أَحَدُكُمْ فِي دُبُرِ كُلِّ صَلاَةٍ عَشْرًا وَيَحْمَدُ عَشْرًا وَيُكَبِّرُ عَشْرًا فَهِيَ خَمْسُونَ وَمِائَةٌ فِي اللِّسَانِ وَأَلْفٌ وَخَمْسُمِائَةٍ فِي الْمِيزَانِ ‏\"‏ ‏.‏ وَأَنَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَعْقِدُهُنَّ بِيَدِهِ ‏\"‏ وَإِذَا أَوَى أَحَدُكُمْ إِلَى فِرَاشِهِ أَوْ مَضْجَعِهِ سَبَّحَ ثَلاَثًا وَثَلاَثِينَ وَحَمِدَ ثَلاَثًا وَثَلاَثِينَ وَكَبَّرَ أَرْبَعًا وَثَلاَثِينَ فَهِيَ مِائَةٌ عَلَى اللِّسَانِ وَأَلْفٌ فِي الْمِيزَانِ ‏\"‏ ‏.‏ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَأَيُّكُمْ يَعْمَلُ فِي كُلِّ يَوْمٍ وَلَيْلَةٍ أَلْفَيْنِ وَخَمْسَمِائَةِ سَيِّئَةٍ ‏\"‏ ‏.‏ قِيلَ يَا رَسُولَ اللَّهِ وَكَيْفَ لاَ نُحْصِيهِمَا فَقَالَ ‏\"‏ إِنَّ الشَّيْطَانَ يَأْتِي أَحَدَكُمْ وَهُوَ فِي صَلاَتِهِ فَيَقُولُ اذْكُرْ كَذَا اذْكُرْ كَذَا وَيَأْتِيهِ عِنْدَ مَنَامِهِ فَيُنِيمُهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 1349,
			"arabicnumber": 1349,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ بْنِ سَمُرَةَ، عَنْ أَسْبَاطٍ، قَالَ حَدَّثَنَا عَمْرُو بْنُ قَيْسٍ، عَنِ الْحَكَمِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ كَعْبِ بْنِ عُجْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مُعَقِّبَاتٌ لاَ يَخِيبُ قَائِلُهُنَّ يُسَبِّحُ اللَّهَ فِي دُبُرِ كُلِّ صَلاَةٍ ثَلاَثًا وَثَلاَثِينَ وَيَحْمَدُهُ ثَلاَثًا وَثَلاَثِينَ وَيُكَبِّرُهُ أَرْبَعًا وَثَلاَثِينَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 1350,
			"arabicnumber": 1350,
			"text": "أَخْبَرَنَا مُوسَى بْنُ حِزَامٍ التِّرْمِذِيُّ، قَالَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ، عَنِ ابْنِ إِدْرِيسَ، عَنْ هِشَامِ بْنِ حَسَّانَ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ كَثِيرِ بْنِ أَفْلَحَ، عَنْ زَيْدِ بْنِ ثَابِتٍ، قَالَ أُمِرُوا أَنْ يُسَبِّحُوا، دُبُرَ كُلِّ صَلاَةٍ ثَلاَثًا وَثَلاَثِينَ وَيَحْمَدُوا ثَلاَثًا وَثَلاَثِينَ وَيُكَبِّرُوا أَرْبَعًا وَثَلاَثِينَ فَأُتِيَ رَجُلٌ مِنَ الأَنْصَارِ فِي مَنَامِهِ فَقِيلَ لَهُ أَمَرَكُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ تُسَبِّحُوا دُبُرَ كُلِّ صَلاَةٍ ثَلاَثًا وَثَلاَثِينَ وَتَحْمَدُوا ثَلاَثًا وَثَلاَثِينَ وَتُكَبِّرُوا أَرْبَعًا وَثَلاَثِينَ قَالَ نَعَمْ ‏.‏ قَالَ فَاجْعَلُوهَا خَمْسًا وَعِشْرِينَ وَاجْعَلُوا فِيهَا التَّهْلِيلَ فَلَمَّا أَصْبَحَ أَتَى النَّبِيَّ صلى الله عليه وسلم فَذَكَرَ ذَلِكَ لَهُ فَقَالَ ‏ \"‏ اجْعَلُوهَا كَذَلِكَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 1351,
			"arabicnumber": 1351,
			"text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْكَرِيمِ أَبُو زُرْعَةَ الرَّازِيُّ، قَالَ حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ يُونُسَ، قَالَ حَدَّثَنِي عَلِيُّ بْنُ الْفُضَيْلِ بْنِ عِيَاضٍ، عَنْ عَبْدِ الْعَزِيزِ بْنِ أَبِي رَوَّادٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَجُلاً، رَأَى فِيمَا يَرَى النَّائِمُ قِيلَ لَهُ بِأَىِّ شَىْءٍ أَمَرَكُمْ نَبِيُّكُمْ صلى الله عليه وسلم قَالَ أَمَرَنَا أَنْ نُسَبِّحَ ثَلاَثًا وَثَلاَثِينَ وَنَحْمَدَ ثَلاَثًا وَثَلاَثِينَ وَنُكَبِّرَ أَرْبَعًا وَثَلاَثِينَ فَتِلْكَ مِائَةٌ ‏.‏ قَالَ سَبِّحُوا خَمْسًا وَعِشْرِينَ وَاحْمَدُوا خَمْسًا وَعِشْرِينَ وَكَبِّرُوا خَمْسًا وَعِشْرِينَ وَهَلِّلُوا خَمْسًا وَعِشْرِينَ فَتِلْكَ مِائَةٌ فَلَمَّا أَصْبَحَ ذَكَرَ ذَلِكَ لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ افْعَلُوا كَمَا قَالَ الأَنْصَارِيُّ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 1352,
			"arabicnumber": 1352,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا مُحَمَّدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، مَوْلَى آلِ طَلْحَةَ قَالَ سَمِعْتُ كُرَيْبًا، عَنِ ابْنِ عَبَّاسٍ، عَنْ جُوَيْرِيَةَ بِنْتِ الْحَارِثِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم مَرَّ عَلَيْهَا وَهِيَ فِي الْمَسْجِدِ تَدْعُو ثُمَّ مَرَّ بِهَا قَرِيبًا مِنْ نِصْفِ النَّهَارِ فَقَالَ لَهَا ‏\"‏ مَا زِلْتِ عَلَى حَالِكِ ‏\"‏ ‏.‏ قَالَتْ نَعَمْ ‏.‏ قَالَ ‏\"‏ أَلاَ أُعَلِّمُكِ - يَعْنِي - كَلِمَاتٍ تَقُولِينَهُنَّ سُبْحَانَ اللَّهِ عَدَدَ خَلْقِهِ سُبْحَانَ اللَّهِ عَدَدَ خَلْقِهِ سُبْحَانَ اللَّهِ عَدَدَ خَلْقِهِ سُبْحَانَ اللَّهِ رِضَا نَفْسِهِ سُبْحَانَ اللَّهِ رِضَا نَفْسِهِ سُبْحَانَ اللَّهِ رِضَا نَفْسِهِ سُبْحَانَ اللَّهِ زِنَةَ عَرْشِهِ سُبْحَانَ اللَّهِ زِنَةَ عَرْشِهِ سُبْحَانَ اللَّهِ زِنَةَ عَرْشِهِ سُبْحَانَ اللَّهِ مِدَادَ كَلِمَاتِهِ سُبْحَانَ اللَّهِ مِدَادَ كَلِمَاتِهِ سُبْحَانَ اللَّهِ مِدَادَ كَلِمَاتِهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 1353,
			"arabicnumber": 1353,
			"text": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ حَدَّثَنَا عَتَّابٌ، - هُوَ ابْنُ بَشِيرٍ - عَنْ خُصَيْفٍ، عَنْ عِكْرِمَةَ، وَمُجَاهِدٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ جَاءَ الْفُقَرَاءُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالُوا يَا رَسُولَ اللَّهِ إِنَّ الأَغْنِيَاءَ يُصَلُّونَ كَمَا نُصَلِّي وَيَصُومُونَ كَمَا نَصُومُ وَلَهُمْ أَمْوَالٌ يَتَصَدَّقُونَ وَيُنْفِقُونَ ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِذَا صَلَّيْتُمْ فَقُولُوا سُبْحَانَ اللَّهِ ثَلاَثًا وَثَلاَثِينَ وَالْحَمْدُ لِلَّهِ ثَلاَثًا وَثَلاَثِينَ وَاللَّهُ أَكْبَرُ ثَلاَثًا وَثَلاَثِينَ وَلاَ إِلَهَ إِلاَّ اللَّهُ عَشْرًا فَإِنَّكُمْ تُدْرِكُونَ بِذَلِكَ مَنْ سَبَقَكُمْ وَتَسْبِقُونَ مَنْ بَعْدَكُمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Munqar"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 1354,
			"arabicnumber": 1354,
			"text": "أَخْبَرَنَا أَحْمَدُ بْنُ حَفْصِ بْنِ عَبْدِ اللَّهِ النَّيْسَابُورِيُّ، قَالَ حَدَّثَنِي أَبِي قَالَ، حَدَّثَنِي إِبْرَاهِيمُ، - يَعْنِي ابْنَ طَهْمَانَ - عَنِ الْحَجَّاجِ بْنِ الْحَجَّاجِ، عَنْ أَبِي الزُّبَيْرِ، عَنْ أَبِي عَلْقَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ سَبَّحَ فِي دُبُرِ صَلاَةِ الْغَدَاةِ مِائَةَ تَسْبِيحَةٍ وَهَلَّلَ مِائَةَ تَهْلِيلَةٍ غُفِرَتْ لَهُ ذُنُوبُهُ وَلَوْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 1355,
			"arabicnumber": 1355,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى الصَّنْعَانِيُّ، وَالْحُسَيْنُ بْنُ مُحَمَّدٍ الذَّارِعُ، - وَاللَّفْظُ لَهُ - قَالاَ حَدَّثَنَا عَثَّامُ بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا الأَعْمَشُ، عَنْ عَطَاءِ بْنِ السَّائِبِ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَعْقِدُ التَّسْبِيحَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 1356,
			"arabicnumber": 1356,
			"text": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا بَكْرٌ، - وَهُوَ ابْنُ مُضَرَ - عَنِ ابْنِ الْهَادِ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُجَاوِرُ فِي الْعَشْرِ الَّذِي فِي وَسَطِ الشَّهْرِ فَإِذَا كَانَ مِنْ حِينِ يَمْضِي عِشْرُونَ لَيْلَةً وَيَسْتَقْبِلُ إِحْدَى وَعِشْرِينَ يَرْجِعُ إِلَى مَسْكَنِهِ وَيَرْجِعُ مَنْ كَانَ يُجَاوِرُ مَعَهُ ثُمَّ إِنَّهُ أَقَامَ فِي شَهْرٍ جَاوَرَ فِيهِ تِلْكَ اللَّيْلَةَ الَّتِي كَانَ يَرْجِعُ فِيهَا فَخَطَبَ النَّاسَ فَأَمَرَهُمْ بِمَا شَاءَ اللَّهُ ثُمَّ قَالَ ‏ \"‏ إِنِّي كُنْتُ أُجَاوِرُ هَذِهِ الْعَشْرَ ثُمَّ بَدَا لِي أَنْ أُجَاوِرَ هَذِهِ الْعَشْرَ الأَوَاخِرَ فَمَنْ كَانَ اعْتَكَفَ مَعِي فَلْيَثْبُتْ فِي مُعْتَكَفِهِ وَقَدْ رَأَيْتُ هَذِهِ اللَّيْلَةَ فَأُنْسِيتُهَا فَالْتَمِسُوهَا فِي الْعَشْرِ الأَوَاخِرِ فِي كُلِّ وَتْرٍ وَقَدْ رَأَيْتُنِي أَسْجُدُ فِي مَاءٍ وَطِينٍ ‏\"‏ ‏.‏ قَالَ أَبُو سَعِيدٍ مُطِرْنَا لَيْلَةَ إِحْدَى وَعِشْرِينَ فَوَكَفَ الْمَسْجِدُ فِي مُصَلَّى رَسُولِ اللَّهِ صلى الله عليه وسلم فَنَظَرْتُ إِلَيْهِ وَقَدِ انْصَرَفَ مِنْ صَلاَةِ الصُّبْحِ وَوَجْهُهُ مُبْتَلٌّ طِينًا وَمَاءً ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 1357,
			"arabicnumber": 1357,
			"text": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ سِمَاكٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا صَلَّى الْفَجْرَ قَعَدَ فِي مُصَلاَّهُ حَتَّى تَطْلُعَ الشَّمْسُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 1358,
			"arabicnumber": 1358,
			"text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ، قَالَ حَدَّثَنَا زُهَيْرٌ، وَذَكَرَ، آخَرَ عَنْ سِمَاكِ بْنِ حَرْبٍ، قَالَ قُلْتُ لِجَابِرِ بْنِ سَمُرَةَ كُنْتَ تُجَالِسُ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ نَعَمْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا صَلَّى الْفَجْرَ جَلَسَ فِي مُصَلاَّهُ حَتَّى تَطْلُعَ الشَّمْسُ فَيَتَحَدَّثُ أَصْحَابُهُ يَذْكُرُونَ حَدِيثَ الْجَاهِلِيَّةِ وَيُنْشِدُونَ الشِّعْرَ وَيَضْحَكُونَ وَيَتَبَسَّمُ صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 1359,
			"arabicnumber": 1359,
			"text": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنِ السُّدِّيِّ، قَالَ سَأَلْتُ أَنَسَ بْنَ مَالِكٍ كَيْفَ أَنْصَرِفُ إِذَا صَلَّيْتُ عَنْ يَمِينِي، أَوْ عَنْ يَسَارِي، قَالَ أَمَّا أَنَا فَأَكْثَرُ، مَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَنْصَرِفُ عَنْ يَمِينِهِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 1360,
			"arabicnumber": 1360,
			"text": "أَخْبَرَنَا أَبُو حَفْصٍ، عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا الأَعْمَشُ، عَنْ عُمَارَةَ، عَنِ الأَسْوَدِ، قَالَ قَالَ عَبْدُ اللَّهِ لاَ يَجْعَلَنَّ أَحَدُكُمْ لِلشَّيْطَانِ مِنْ نَفْسِهِ جُزْءًا يَرَى أَنَّ حَتْمًا عَلَيْهِ أَنْ لاَ يَنْصَرِفَ إِلاَّ عَنْ يَمِينِهِ لَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم أَكْثَرَ انْصِرَافِهِ عَنْ يَسَارِهِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 1361,
			"arabicnumber": 1361,
			"text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا بَقِيَّةُ، قَالَ حَدَّثَنَا الزُّبَيْرِيُّ، أَنَّ مَكْحُولاً، حَدَّثَهُ أَنَّ مَسْرُوقَ بْنَ الأَجْدَعِ حَدَّثَهُ عَنْ عَائِشَةَ، قَالَتْ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَشْرَبُ قَائِمًا وَقَاعِدًا وَيُصَلِّي حَافِيًا وَمُنْتَعِلاً وَيَنْصَرِفُ عَنْ يَمِينِهِ وَعَنْ شِمَالِهِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 1362,
			"arabicnumber": 1362,
			"text": "أَخْبَرَنَا عَلِيُّ بْنُ خَشْرَمٍ، قَالَ أَنْبَأَنَا عِيسَى بْنُ يُونُسَ، عَنِ الأَوْزَاعِيِّ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ كَانَ النِّسَاءُ يُصَلِّينَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم الْفَجْرَ فَكَانَ إِذَا سَلَّمَ انْصَرَفْنَ مُتَلَفِّعَاتٍ بِمُرُوطِهِنَّ فَلاَ يُعْرَفْنَ مِنَ الْغَلَسِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 1363,
			"arabicnumber": 1363,
			"text": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنِ الْمُخْتَارِ بْنِ فُلْفُلٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ صَلَّى بِنَا رَسُولُ اللَّهِ صلى الله عليه وسلم ذَاتَ يَوْمٍ ثُمَّ أَقْبَلَ عَلَيْنَا بِوَجْهِهِ فَقَالَ ‏\"‏ إِنِّي إِمَامُكُمْ فَلاَ تُبَادِرُونِي بِالرُّكُوعِ وَلاَ بِالسُّجُودِ وَلاَ بِالْقِيَامِ وَلاَ بِالاِنْصِرَافِ فَإِنِّي أَرَاكُمْ مِنْ أَمَامِي وَمِنْ خَلْفِي ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ وَالَّذِي نَفْسِي بِيَدِهِ لَوْ رَأَيْتُمْ مَا رَأَيْتُ لَضَحِكْتُمْ قَلِيلاً وَلَبَكَيْتُمْ كَثِيرًا ‏\"‏ ‏.‏ قُلْنَا مَا رَأَيْتَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ رَأَيْتُ الْجَنَّةَ وَالنَّارَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 1364,
			"arabicnumber": 1364,
			"text": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا بِشْرٌ، - وَهُوَ ابْنُ الْمُفَضَّلِ - قَالَ حَدَّثَنَا دَاوُدُ بْنُ أَبِي هِنْدٍ، عَنِ الْوَلِيدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ جُبَيْرِ بْنِ نُفَيْرٍ، عَنْ أَبِي ذَرٍّ، قَالَ صُمْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم رَمَضَانَ فَلَمْ يَقُمْ بِنَا النَّبِيُّ صلى الله عليه وسلم حَتَّى بَقِيَ سَبْعٌ مِنَ الشَّهْرِ فَقَامَ بِنَا حَتَّى ذَهَبَ نَحْوٌ مِنْ ثُلُثِ اللَّيْلِ ثُمَّ كَانَتْ سَادِسَةٌ فَلَمْ يَقُمْ بِنَا فَلَمَّا كَانَتِ الْخَامِسَةُ قَامَ بِنَا حَتَّى ذَهَبَ نَحْوٌ مِنْ شَطْرِ اللَّيْلِ قُلْنَا يَا رَسُولَ اللَّهِ لَوْ نَفَلْتَنَا قِيَامَ هَذِهِ اللَّيْلَةَ ‏.‏ قَالَ ‏ \"‏ إِنَّ الرَّجُلَ إِذَا صَلَّى مَعَ الإِمَامِ حَتَّى يَنْصَرِفَ حُسِبَ لَهُ قِيَامُ لَيْلَةٍ ‏\"‏ ‏.‏ قَالَ ثُمَّ كَانَتِ الرَّابِعَةُ فَلَمْ يَقُمْ بِنَا فَلَمَّا بَقِيَ ثُلُثٌ مِنَ الشَّهْرِ أَرْسَلَ إِلَى بَنَاتِهِ وَنِسَائِهِ وَحَشَدَ النَّاسَ فَقَامَ بِنَا حَتَّى خَشِينَا أَنْ يَفُوتَنَا الْفَلاَحُ ثُمَّ لَمْ يَقُمْ بِنَا شَيْئًا مِنَ الشَّهْرِ ‏.‏ قَالَ دَاوُدُ قُلْتُ مَا الْفَلاَحُ قَالَ السُّحُورُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 1365,
			"arabicnumber": 1365,
			"text": "أَخْبَرَنَا أَحْمَدُ بْنُ بَكَّارٍ الْحَرَّانِيُّ، قَالَ حَدَّثَنَا بِشْرُ بْنُ السَّرِيِّ، عَنْ عُمَرَ بْنِ سَعِيدِ بْنِ أَبِي حُسَيْنٍ النَّوْفَلِيِّ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنْ عُقْبَةَ بْنِ الْحَارِثِ، قَالَ صَلَّيْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم الْعَصْرَ بِالْمَدِينَةِ ثُمَّ انْصَرَفَ يَتَخَطَّى رِقَابَ النَّاسِ سَرِيعًا حَتَّى تَعَجَّبَ النَّاسُ لِسُرْعَتِهِ فَتَبِعَهُ بَعْضُ أَصْحَابِهِ فَدَخَلَ عَلَى بَعْضِ أَزْوَاجِهِ ثُمَّ خَرَجَ فَقَالَ ‏ \"‏ إِنِّي ذَكَرْتُ وَأَنَا فِي الْعَصْرِ شَيْئًا مِنْ تِبْرٍ كَانَ عِنْدَنَا فَكَرِهْتُ أَنْ يَبِيتَ عِنْدَنَا فَأَمَرْتُ بِقِسْمَتِهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 187
			}
		},
		{
			"hadithnumber": 1366,
			"arabicnumber": 1366,
			"text": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، وَمُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالاَ حَدَّثَنَا خَالِدٌ، - وَهُوَ ابْنُ الْحَارِثِ - عَنْ هِشَامٍ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، يَوْمَ الْخَنْدَقِ بَعْدَ مَا غَرَبَتِ الشَّمْسُ جَعَلَ يَسُبُّ كُفَّارَ قُرَيْشٍ وَقَالَ يَا رَسُولَ اللَّهِ مَا كِدْتُ أَنْ أُصَلِّيَ حَتَّى كَادَتِ الشَّمْسُ تَغْرُبُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ فَوَاللَّهِ مَا صَلَّيْتُهَا ‏\"‏ ‏.‏ فَنَزَلْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِلَى بُطْحَانَ فَتَوَضَّأَ لِلصَّلاَةِ وَتَوَضَّأْنَا لَهَا فَصَلَّى الْعَصْرَ بَعْدَ مَا غَرَبَتِ الشَّمْسُ ثُمَّ صَلَّى بَعْدَهَا الْمَغْرِبَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 188
			}
		}
	]
}