{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"31": "The Book of Presents"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3672,
			"arabicnumber": 3672,
			"text": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ حُمَيْدٍ، ح وَأَنْبَأَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، عَنْ سُفْيَانَ، قَالَ سَمِعْنَاهُ مِنَ الزُّهْرِيِّ، أَخْبَرَنِي حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ، وَمُحَمَّدُ بْنُ النُّعْمَانِ، عَنِ النُّعْمَانِ بْنِ بَشِيرٍ، أَنَّ أَبَاهُ، نَحَلَهُ غُلاَمًا فَأَتَى النَّبِيَّ صلى الله عليه وسلم يُشْهِدُهُ فَقَالَ ‏\"‏ أَكُلَّ وَلَدِكَ نَحَلْتَ ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ فَارْدُدْهُ ‏\"‏ ‏.‏ وَاللَّفْظُ لِمُحَمَّدٍ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3673,
			"arabicnumber": 3673,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، وَالْحَارِثُ بْنُ مِسْكِينٍ، قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، عَنِ ابْنِ الْقَاسِمِ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، وَمُحَمَّدِ بْنِ النُّعْمَانِ، يُحَدِّثَانِهِ عَنِ النُّعْمَانِ بْنِ بَشِيرٍ، أَنَّ أَبَاهُ، أَتَى بِهِ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ إِنِّي نَحَلْتُ ابْنِي غُلاَمًا كَانَ لِي فَقَالَ رَسُولُ اللَّهِ ‏\"‏ أَكُلَّ وَلَدِكَ نَحَلْتَهُ ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَارْجِعْهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3674,
			"arabicnumber": 3674,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ هَاشِمٍ، قَالَ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، قَالَ حَدَّثَنَا الأَوْزَاعِيُّ، عَنِ الزُّهْرِيِّ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، وَعَنْ مُحَمَّدِ بْنِ النُّعْمَانِ، عَنِ النُّعْمَانِ بْنِ بَشِيرٍ، أَنَّ أَبَاهُ، بَشِيرَ بْنَ سَعْدٍ جَاءَ بِابْنِهِ النُّعْمَانِ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي نَحَلْتُ ابْنِي هَذَا غُلاَمًا كَانَ لِي ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَكُلَّ بَنِيكَ نَحَلْتَ ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ فَارْجِعْهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3675,
			"arabicnumber": 3675,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدٍ، قَالَ حَدَّثَنَا الْوَلِيدُ، عَنِ الأَوْزَاعِيِّ، عَنِ الزُّهْرِيِّ، أَنَّ مُحَمَّدَ بْنَ النُّعْمَانِ، وَحُمَيْدَ بْنَ عَبْدِ الرَّحْمَنِ، حَدَّثَاهُ عَنْ بَشِيرِ بْنِ سَعْدٍ، أَنَّهُ جَاءَ إِلَى النَّبِيِّ صلى الله عليه وسلم بِالنُّعْمَانِ بْنِ بَشِيرٍ فَقَالَ إِنِّي نَحَلْتُ ابْنِي هَذَا غُلاَمًا فَإِنْ رَأَيْتَ أَنْ تُنْفِذَهُ أَنْفَذْتُهُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَكُلَّ بَنِيكَ نَحَلْتَهُ ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ فَارْدُدْهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3676,
			"arabicnumber": 3676,
			"text": "أَخْبَرَنَا أَحْمَدُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنِ النُّعْمَانِ بْنِ بَشِيرٍ، أَنَّ أَبَاهُ، نَحَلَهُ نُحْلاً فَقَالَتْ لَهُ أُمُّهُ أَشْهِدِ النَّبِيَّ صلى الله عليه وسلم عَلَى مَا نَحَلْتَ ابْنِي ‏.‏ فَأَتَى النَّبِيَّ صلى الله عليه وسلم فَذَكَرَ ذَلِكَ لَهُ فَكَرِهَ النَّبِيُّ صلى الله عليه وسلم أَنْ يَشْهَدَ لَهُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 3677,
			"arabicnumber": 3677,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَعْمَرٍ، قَالَ حَدَّثَنَا أَبُو عَامِرٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ سَعْدٍ، - يَعْنِي ابْنَ إِبْرَاهِيمَ - عَنْ عُرْوَةَ، عَنْ بَشِيرٍ، أَنَّهُ نَحَلَ ابْنَهُ غُلاَمًا فَأَتَى النَّبِيَّ صلى الله عليه وسلم فَأَرَادَ أَنْ يُشْهِدَ النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَكُلَّ وَلَدِكَ نَحَلْتَهُ مِثْلَ ذَا ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ فَارْدُدْهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3678,
			"arabicnumber": 3678,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ، قَالَ حَدَّثَنَا حِبَّانُ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّ بَشِيرًا، أَتَى النَّبِيَّ صلى الله عليه وسلم فَقَالَ يَا نَبِيَّ اللَّهِ نَحَلْتُ النُّعْمَانَ نِحْلَةً ‏.‏ قَالَ ‏\"‏ أَعْطَيْتَ لإِخْوَتِهِ ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ فَارْدُدْهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3679,
			"arabicnumber": 3679,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ، قَالَ حَدَّثَنَا يَزِيدُ، - وَهُوَ ابْنُ زُرَيْعٍ - قَالَ حَدَّثَنَا دَاوُدُ، عَنِ الشَّعْبِيِّ، عَنِ النُّعْمَانِ، قَالَ انْطَلَقَ بِهِ أَبُوهُ يَحْمِلُهُ إِلَى النَّبِيِّ صلى الله عليه وسلم قَالَ اشْهَدْ أَنِّي قَدْ نَحَلْتُ النُّعْمَانَ مِنْ مَالِي كَذَا وَكَذَا ‏.‏ قَالَ ‏ \"‏ كُلَّ بَنِيكَ نَحَلْتَ مِثْلَ الَّذِي نَحَلْتَ النُّعْمَانَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3680,
			"arabicnumber": 3680,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، عَنْ عَبْدِ الْوَهَّابِ، قَالَ حَدَّثَنَا دَاوُدُ، عَنْ عَامِرٍ، عَنِ النُّعْمَانِ، أَنَّ أَبَاهُ، أَتَى بِهِ النَّبِيَّ صلى الله عليه وسلم يُشْهِدُ عَلَى نُحْلٍ نَحَلَهُ إِيَّاهُ ‏.‏ فَقَالَ ‏\"‏ أَكُلَّ وَلَدِكَ نَحَلْتَ مِثْلَ مَا نَحَلْتَهُ ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ فَلاَ أَشْهَدُ عَلَى شَىْءٍ أَلَيْسَ يَسُرُّكَ أَنْ يَكُونُوا إِلَيْكَ فِي الْبِرِّ سَوَاءً ‏\"‏ ‏.‏ قَالَ بَلَى ‏.‏ قَالَ ‏\"‏ فَلاَ إِذًا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3681,
			"arabicnumber": 3681,
			"text": "أَخْبَرَنَا مُوسَى بْنُ عَبْدِ الرَّحْمَنِ، قَالَ حَدَّثَنَا أَبُو أُسَامَةَ، قَالَ حَدَّثَنَا أَبُو حَيَّانَ، عَنِ الشَّعْبِيِّ، قَالَ حَدَّثَنِي النُّعْمَانُ بْنُ بَشِيرٍ الأَنْصَارِيُّ، أَنَّ أُمَّهُ ابْنَةَ رَوَاحَةَ، سَأَلَتْ أَبَاهُ بَعْضَ الْمَوْهِبَةِ مِنْ مَالِهِ لاِبْنِهَا فَالْتَوَى بِهَا سَنَةً ثُمَّ بَدَا لَهُ فَوَهَبَهَا لَهُ فَقَالَتْ لاَ أَرْضَى حَتَّى تُشْهِدَ رَسُولَ اللَّهِ صلى الله عليه وسلم ‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ أُمَّ هَذَا ابْنَةَ رَوَاحَةَ قَاتَلَتْنِي عَلَى الَّذِي وَهَبْتُ لَهُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَا بَشِيرُ أَلَكَ وَلَدٌ سِوَى هَذَا ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَفَكُلُّهُمْ وَهَبْتَ لَهُمْ مِثْلَ الَّذِي وَهَبْتَ لاِبْنِكَ هَذَا ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَلاَ تُشْهِدْنِي إِذًا فَإِنِّي لاَ أَشْهَدُ عَلَى جَوْرٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3682,
			"arabicnumber": 3682,
			"text": "أَخْبَرَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا يَعْلَى، قَالَ حَدَّثَنَا أَبُو حَيَّانَ، عَنِ الشَّعْبِيِّ، عَنِ النُّعْمَانِ، قَالَ سَأَلَتْ أُمِّي أَبِي بَعْضَ الْمَوْهِبَةِ فَوَهَبَهَا لِي فَقَالَتْ لاَ أَرْضَى حَتَّى أُشْهِدَ رَسُولَ اللَّهِ صلى الله عليه وسلم ‏.‏ قَالَ فَأَخَذَ أَبِي بِيَدِي وَأَنَا غُلاَمٌ فَأَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ أُمَّ هَذَا ابْنَةَ رَوَاحَةَ طَلَبَتْ مِنِّي بَعْضَ الْمَوْهِبَةِ وَقَدْ أَعْجَبَهَا أَنْ أُشْهِدَكَ عَلَى ذَلِكَ ‏.‏ قَالَ ‏\"‏ يَا بَشِيرُ أَلَكَ ابْنٌ غَيْرُ هَذَا ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ قَالَ ‏\"‏ فَوَهَبْتَ لَهُ مِثْلَ مَا وَهَبْتَ لِهَذَا ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ فَلاَ تُشْهِدْنِي إِذًا فَإِنِّي لاَ أَشْهَدُ عَلَى جَوْرٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3683,
			"arabicnumber": 3683,
			"text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، عَنْ عَامِرٍ، قَالَ أُخْبِرْتُ أَنَّ بَشِيرَ بْنَ سَعْدٍ أَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ امْرَأَتِي عَمْرَةَ بِنْتَ رَوَاحَةَ أَمَرَتْنِي أَنْ أَتَصَدَّقَ عَلَى ابْنِهَا نُعْمَانَ بِصَدَقَةٍ وَأَمَرَتْنِي أَنْ أُشْهِدَكَ عَلَى ذَلِكَ ‏.‏ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ هَلْ لَكَ بَنُونَ سِوَاهُ ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ قَالَ ‏\"‏ فَأَعْطَيْتَهُمْ مِثْلَ مَا أَعْطَيْتَ لِهَذَا ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ فَلاَ تُشْهِدْنِي عَلَى جَوْرٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3684,
			"arabicnumber": 3684,
			"text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا زَكَرِيَّا، عَنْ عَامِرٍ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عُتْبَةَ بْنِ مَسْعُودٍ، ح وَأَنْبَأَنَا مُحَمَّدُ بْنُ حَاتِمٍ، قَالَ أَنْبَأَنَا حِبَّانُ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ زَكَرِيَّا، عَنِ الشَّعْبِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، أَنَّ رَجُلاً، جَاءَ إِلَى النَّبِيِّ صلى الله عليه وسلم - وَقَالَ مُحَمَّدٌ أَتَى النَّبِيَّ صلى الله عليه وسلم - فَقَالَ إِنِّي تَصَدَّقْتُ عَلَى ابْنِي بِصَدَقَةٍ فَاشْهَدْ فَقَالَ ‏\"‏ هَلْ لَكَ وَلَدٌ غَيْرُهُ ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ قَالَ ‏\"‏ أَعْطَيْتَهُمْ كَمَا أَعْطَيْتَهُ ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ أَأَشْهَدُ عَلَى جَوْرٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3685,
			"arabicnumber": 3685,
			"text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، عَنْ يَحْيَى، عَنْ فِطْرٍ، قَالَ حَدَّثَنِي مُسْلِمُ بْنُ صُبَيْحٍ، قَالَ سَمِعْتُ النُّعْمَانَ بْنَ بَشِيرٍ، يَقُولُ ذَهَبَ بِي أَبِي إِلَى النَّبِيِّ صلى الله عليه وسلم يُشْهِدُهُ عَلَى شَىْءٍ أَعْطَانِيهِ فَقَالَ ‏ \"‏ أَلَكَ وَلَدٌ غَيْرُهُ ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ وَصَفَّ بِيَدِهِ بِكَفِّهِ أَجْمَعَ كَذَا أَلاَ سَوَّيْتَ بَيْنَهُمْ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3686,
			"arabicnumber": 3686,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ، قَالَ أَنْبَأَنَا حِبَّانُ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ فِطْرٍ، عَنْ مُسْلِمِ بْنِ صُبَيْحٍ، قَالَ سَمِعْتُ النُّعْمَانَ، يَقُولُ وَهُوَ يَخْطُبُ انْطَلَقَ بِي أَبِي إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم يُشْهِدُهُ عَلَى عَطِيَّةٍ أَعْطَانِيهَا فَقَالَ ‏\"‏ هَلْ لَكَ بَنُونَ سِوَاهُ ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ قَالَ ‏\"‏ سَوِّ بَيْنَهُمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3687,
			"arabicnumber": 3687,
			"text": "أَخْبَرَنَا يَعْقُوبُ بْنُ سُفْيَانَ، قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ حَاجِبِ بْنِ الْمُفَضَّلِ بْنِ الْمُهَلَّبِ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ النُّعْمَانَ بْنَ بَشِيرٍ، يَخْطُبُ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ اعْدِلُوا بَيْنَ أَبْنَائِكُمُ اعْدِلُوا بَيْنَ أَبْنَائِكُمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 16
			}
		}
	]
}