{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"38": "The Book of Distribution of Al-Fay'"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4133,
			"arabicnumber": 4133,
			"text": "أَخْبَرَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ الْحَمَّالُ، قَالَ حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، عَنْ يُونُسَ بْنِ يَزِيدَ، عَنِ الزُّهْرِيِّ، عَنْ يَزِيدَ بْنِ هُرْمُزَ، أَنَّ نَجْدَةَ الْحَرُورِيَّ، حِينَ خَرَجَ فِي فِتْنَةِ ابْنِ الزُّبَيْرِ أَرْسَلَ إِلَى ابْنِ عَبَّاسٍ يَسْأَلُهُ عَنْ سَهْمِ ذِي الْقُرْبَى لِمَنْ تُرَاهُ قَالَ هُوَ لَنَا لِقُرْبَى رَسُولِ اللَّهِ صلى الله عليه وسلم قَسَمَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم لَهُمْ وَقَدْ كَانَ عُمَرُ عَرَضَ عَلَيْنَا شَيْئًا رَأَيْنَاهُ دُونَ حَقِّنَا فَأَبَيْنَا أَنْ نَقْبَلَهُ وَكَانَ الَّذِي عَرَضَ عَلَيْهِمْ أَنْ يُعِينَ نَاكِحَهُمْ وَيَقْضِيَ عَنْ غَارِمِهِمْ وَيُعْطِيَ فَقِيرَهُمْ وَأَبَى أَنْ يَزِيدَهُمْ عَلَى ذَلِكَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 4134,
			"arabicnumber": 4134,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَزِيدُ، - وَهُوَ ابْنُ هَارُونَ - قَالَ أَنْبَأَنَا مُحَمَّدُ بْنُ إِسْحَاقَ، عَنِ الزُّهْرِيِّ، وَمُحَمَّدِ بْنِ عَلِيٍّ، عَنْ يَزِيدَ بْنِ هُرْمُزَ، قَالَ كَتَبَ نَجْدَةُ إِلَى ابْنِ عَبَّاسٍ يَسْأَلُهُ عَنْ سَهْمِ، ذِي الْقُرْبَى لِمَنْ هُوَ قَالَ يَزِيدُ بْنُ هُرْمُزَ وَأَنَا كَتَبْتُ كِتَابَ ابْنِ عَبَّاسٍ إِلَى نَجْدَةَ كَتَبْتُ إِلَيْهِ كَتَبْتَ تَسْأَلُنِي عَنْ سَهْمِ ذِي الْقُرْبَى لِمَنْ هُوَ وَهُوَ لَنَا أَهْلَ الْبَيْتِ وَقَدْ كَانَ عُمَرُ دَعَانَا إِلَى أَنْ يُنْكِحَ مِنْهُ أَيِّمَنَا وَيُحْذِيَ مِنْهُ عَائِلَنَا وَيَقْضِيَ مِنْهُ عَنْ غَارِمِنَا فَأَبَيْنَا إِلاَّ أَنْ يُسَلِّمَهُ لَنَا وَأَبَى ذَلِكَ فَتَرَكْنَاهُ عَلَيْهِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 4135,
			"arabicnumber": 4135,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ يَحْيَى، قَالَ حَدَّثَنَا مَحْبُوبٌ، - يَعْنِي ابْنَ مُوسَى - قَالَ أَنْبَأَنَا أَبُو إِسْحَاقَ، - وَهُوَ الْفَزَارِيُّ - عَنِ الأَوْزَاعِيِّ، قَالَ كَتَبَ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ إِلَى عُمَرَ بْنِ الْوَلِيدِ كِتَابًا فِيهِ وَقَسْمُ أَبِيكَ لَكَ الْخُمُسُ كُلُّهُ وَإِنَّمَا سَهْمُ أَبِيكَ كَسَهْمِ رَجُلٍ مِنَ الْمُسْلِمِينَ وَفِيهِ حَقُّ اللَّهِ وَحَقُّ الرَّسُولِ وَذِي الْقُرْبَى وَالْيَتَامَى وَالْمَسَاكِينِ وَابْنِ السَّبِيلِ فَمَا أَكْثَرَ خُصَمَاءَ أَبِيكَ يَوْمَ الْقِيَامَةِ فَكَيْفَ يَنْجُو مَنْ كَثُرَتْ خُصَمَاؤُهُ وَإِظْهَارُكَ الْمَعَازِفَ وَالْمِزْمَارَ بِدْعَةٌ فِي الإِسْلاَمِ وَلَقَدْ هَمَمْتُ أَنْ أَبْعَثَ إِلَيْكَ مَنْ يَجُزُّ جُمَّتَكَ جُمَّةَ السُّوءِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4136,
			"arabicnumber": 4136,
			"text": "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ، قَالَ حَدَّثَنَا شُعَيْبُ بْنُ يَحْيَى، قَالَ حَدَّثَنَا نَافِعُ بْنُ يَزِيدَ، عَنْ يُونُسَ بْنِ يَزِيدَ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ جُبَيْرَ بْنَ مُطْعِمٍ، حَدَّثَهُ أَنَّهُ، جَاءَ هُوَ وَعُثْمَانُ بْنُ عَفَّانَ رَسُولَ اللَّهِ صلى الله عليه وسلم يُكَلِّمَانِهِ فِيمَا قَسَمَ مِنْ خُمُسِ حُنَيْنٍ بَيْنَ بَنِي هَاشِمٍ وَبَنِي الْمُطَّلِبِ بْنِ عَبْدِ مَنَافٍ فَقَالاَ يَا رَسُولَ اللَّهِ قَسَمْتَ لإِخْوَانِنَا بَنِي الْمُطَّلِبِ بْنِ عَبْدِ مَنَافٍ وَلَمْ تُعْطِنَا شَيْئًا وَقَرَابَتُنَا مِثْلُ قَرَابَتِهِمْ ‏.‏ فَقَالَ لَهُمَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّمَا أَرَى هَاشِمًا وَالْمُطَّلِبَ شَيْئًا وَاحِدًا ‏\"‏ ‏.‏ قَالَ جُبَيْرُ بْنُ مُطْعِمٍ وَلَمْ يَقْسِمْ رَسُولُ اللَّهِ صلى الله عليه وسلم لِبَنِي عَبْدِ شَمْسٍ وَلاَ لِبَنِي نَوْفَلٍ مِنْ ذَلِكَ الْخُمُسِ شَيْئًا كَمَا قَسَمَ لِبَنِي هَاشِمٍ وَبَنِي الْمُطَّلِبِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 4137,
			"arabicnumber": 4137,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، قَالَ أَنْبَأَنَا مُحَمَّدُ بْنُ إِسْحَاقَ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ جُبَيْرِ بْنِ مُطْعِمٍ، قَالَ لَمَّا قَسَمَ رَسُولُ اللَّهِ صلى الله عليه وسلم سَهْمَ ذِي الْقُرْبَى بَيْنَ بَنِي هَاشِمٍ وَبَنِي الْمُطَّلِبِ أَتَيْتُهُ أَنَا وَعُثْمَانُ بْنُ عَفَّانَ فَقُلْنَا يَا رَسُولَ اللَّهِ هَؤُلاَءِ بَنُو هَاشِمٍ لاَ نُنْكِرُ فَضْلَهُمْ لِمَكَانِكَ الَّذِي جَعَلَكَ اللَّهُ بِهِ مِنْهُمْ أَرَأَيْتَ بَنِي الْمُطَّلِبِ أَعْطَيْتَهُمْ وَمَنَعْتَنَا فَإِنَّمَا نَحْنُ وَهُمْ مِنْكَ بِمَنْزِلَةٍ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّهُمْ لَمْ يُفَارِقُونِي فِي جَاهِلِيَّةٍ وَلاَ إِسْلاَمٍ إِنَّمَا بَنُو هَاشِمٍ وَبَنُو الْمُطَّلِبِ شَىْءٌ وَاحِدٌ ‏\"‏ ‏.‏ وَشَبَّكَ بَيْنَ أَصَابِعِهِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 4138,
			"arabicnumber": 4138,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ يَحْيَى بْنِ الْحَارِثِ، قَالَ حَدَّثَنَا مَحْبُوبٌ، - يَعْنِي ابْنَ مُوسَى - قَالَ أَنْبَأَنَا أَبُو إِسْحَاقَ، - وَهُوَ الْفَزَارِيُّ - عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَيَّاشٍ، عَنْ سُلَيْمَانَ بْنِ مُوسَى، عَنْ مَكْحُولٍ، عَنْ أَبِي سَلاَّمٍ، عَنْ أَبِي أُمَامَةَ الْبَاهِلِيِّ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، قَالَ أَخَذَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمَ حُنَيْنٍ وَبَرَةً مِنْ جَنْبِ بَعِيرٍ فَقَالَ ‏ \"‏ يَا أَيُّهَا النَّاسُ إِنَّهُ لاَ يَحِلُّ لِي مِمَّا أَفَاءَ اللَّهُ عَلَيْكُمْ قَدْرَ هَذِهِ إِلاَّ الْخُمُسُ وَالْخُمُسُ مَرْدُودٌ عَلَيْكُمْ ‏\"‏ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ اسْمُ أَبِي سَلاَّمٍ مَمْطُورٌ وَهُوَ حَبَشِيٌّ وَاسْمُ أَبِي أُمَامَةَ صُدَىُّ بْنُ عَجْلاَنَ وَاللَّهُ تَعَالَى أَعْلَمُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 4139,
			"arabicnumber": 4139,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ يَزِيدَ، قَالَ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَتَى بَعِيرًا فَأَخَذَ مِنْ سَنَامِهِ وَبَرَةً بَيْنَ إِصْبَعَيْهِ ثُمَّ قَالَ ‏ \"‏ إِنَّهُ لَيْسَ لِي مِنَ الْفَىْءِ شَىْءٌ وَلاَ هَذِهِ إِلاَّ الْخُمُسُ وَالْخُمُسُ مَرْدُودٌ فِيكُمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 4140,
			"arabicnumber": 4140,
			"text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، - يَعْنِي ابْنَ دِينَارٍ - عَنِ الزُّهْرِيِّ، عَنْ مَالِكِ بْنِ أَوْسِ بْنِ الْحَدَثَانِ، عَنْ عُمَرَ، قَالَ كَانَتْ أَمْوَالُ بَنِي النَّضِيرِ مِمَّا أَفَاءَ اللَّهُ عَلَى رَسُولِهِ مِمَّا لَمْ يُوجِفِ الْمُسْلِمُونَ عَلَيْهِ بِخَيْلٍ وَلاَ رِكَابٍ فَكَانَ يُنْفِقُ عَلَى نَفْسِهِ مِنْهَا قُوتَ سَنَةٍ وَمَا بَقِيَ جَعَلَهُ فِي الْكُرَاعِ وَالسِّلاَحِ عُدَّةً فِي سَبِيلِ اللَّهِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 4141,
			"arabicnumber": 4141,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ يَحْيَى بْنِ الْحَارِثِ، قَالَ حَدَّثَنَا مَحْبُوبٌ، - يَعْنِي ابْنَ مُوسَى - قَالَ أَنْبَأَنَا أَبُو إِسْحَاقَ، - هُوَ الْفَزَارِيُّ - عَنْ شُعَيْبِ بْنِ أَبِي حَمْزَةَ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، أَنَّ فَاطِمَةَ، أَرْسَلَتْ إِلَى أَبِي بَكْرٍ تَسْأَلُهُ مِيرَاثَهَا مِنَ النَّبِيِّ صلى الله عليه وسلم مِنْ صَدَقَتِهِ وَمِمَّا تَرَكَ مِنْ خُمُسِ خَيْبَرَ قَالَ أَبُو بَكْرٍ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ نُورَثُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 4142,
			"arabicnumber": 4142,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ يَحْيَى، قَالَ حَدَّثَنَا مَحْبُوبٌ، قَالَ أَنْبَأَنَا أَبُو إِسْحَاقَ، عَنْ زَائِدَةَ، عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ، عَنْ عَطَاءٍ، فِي قَوْلِهِ عَزَّ وَجَلَّ ‏{‏ وَاعْلَمُوا أَنَّمَا غَنِمْتُمْ مِنْ شَىْءٍ فَأَنَّ لِلَّهِ خُمُسَهُ وَلِلرَّسُولِ وَلِذِي الْقُرْبَى ‏}‏ قَالَ خُمُسُ اللَّهِ وَخُمُسُ رَسُولِهِ وَاحِدٌ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَحْمِلُ مِنْهُ وَيُعْطِي مِنْهُ وَيَضَعُهُ حَيْثُ شَاءَ وَيَصْنَعُ بِهِ مَا شَاءَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Mursal"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Mursal"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 4143,
			"arabicnumber": 4143,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ يَحْيَى بْنِ الْحَارِثِ، قَالَ حَدَّثَنَا مَحْبُوبٌ، - يَعْنِي ابْنَ مُوسَى - قَالَ أَنْبَأَنَا أَبُو إِسْحَاقَ، - هُوَ الْفَزَارِيُّ - عَنْ سُفْيَانَ، عَنْ قَيْسِ بْنِ مُسْلِمٍ، قَالَ سَأَلْتُ الْحَسَنَ بْنَ مُحَمَّدٍ عَنْ قَوْلِهِ عَزَّ وَجَلَّ ‏{‏ وَاعْلَمُوا أَنَّمَا غَنِمْتُمْ مِنْ شَىْءٍ فَأَنَّ لِلَّهِ خُمُسَهُ ‏}‏ قَالَ هَذَا مَفَاتِحُ كَلاَمِ اللَّهِ الدُّنْيَا وَالآخِرَةُ لِلَّهِ قَالَ اخْتَلَفُوا فِي هَذَيْنِ السَّهْمَيْنِ بَعْدَ وَفَاةِ رَسُولِ اللَّهِ صلى الله عليه وسلم سَهْمِ الرَّسُولِ وَسَهْمِ ذِي الْقُرْبَى فَقَالَ قَائِلٌ سَهْمُ الرَّسُولِ صلى الله عليه وسلم لِلْخَلِيفَةِ مِنْ بَعْدِهِ وَقَالَ قَائِلٌ سَهْمُ ذِي الْقُرْبَى لِقَرَابَةِ الرَّسُولِ صلى الله عليه وسلم وَقَالَ قَائِلٌ سَهْمُ ذِي الْقُرْبَى لِقَرَابَةِ الْخَلِيفَةِ فَاجْتَمَعَ رَأْيُهُمْ عَلَى أَنْ جَعَلُوا هَذَيْنِ السَّهْمَيْنِ فِي الْخَيْلِ وَالْعُدَّةِ فِي سَبِيلِ اللَّهِ فَكَانَا فِي ذَلِكَ خِلاَفَةَ أَبِي بَكْرٍ وَعُمَرَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Mursal"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Mursal"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 4144,
			"arabicnumber": 4144,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ يَحْيَى بْنِ الْحَارِثِ، قَالَ حَدَّثَنَا مَحْبُوبٌ، قَالَ أَنْبَأَنَا أَبُو إِسْحَاقَ، عَنْ مُوسَى بْنِ أَبِي عَائِشَةَ، قَالَ سَأَلْتُ يَحْيَى بْنَ الْجَزَّارِ عَنْ هَذِهِ الآيَةِ، ‏{‏ وَاعْلَمُوا أَنَّمَا غَنِمْتُمْ مِنْ شَىْءٍ فَأَنَّ لِلَّهِ خُمُسَهُ وَلِلرَّسُولِ ‏}‏ قَالَ قُلْتُ كَمْ كَانَ لِلنَّبِيِّ صلى الله عليه وسلم مِنَ الْخُمُسِ قَالَ خُمُسُ الْخُمُسِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Mursal"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Mursal"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 4145,
			"arabicnumber": 4145,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ يَحْيَى بْنِ الْحَارِثِ، قَالَ حَدَّثَنَا مَحْبُوبٌ، قَالَ أَنْبَأَنَا أَبُو إِسْحَاقَ، عَنْ مُطَرِّفٍ، قَالَ سُئِلَ الشَّعْبِيُّ عَنْ سَهْمِ النَّبِيِّ، صلى الله عليه وسلم وَصَفِيِّهِ فَقَالَ أَمَّا سَهْمُ النَّبِيِّ صلى الله عليه وسلم فَكَسَهْمِ رَجُلٍ مِنَ الْمُسْلِمِينَ وَأَمَّا سَهْمُ الصَّفِيِّ فَغُرَّةٌ تُخْتَارُ مِنْ أَىِّ شَىْءٍ شَاءَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Mursal"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Mursal"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 4146,
			"arabicnumber": 4146,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ يَحْيَى، قَالَ حَدَّثَنَا مَحْبُوبٌ، قَالَ أَنْبَأَنَا أَبُو إِسْحَاقَ، عَنْ سَعِيدٍ الْجُرَيْرِيِّ، عَنْ يَزِيدَ بْنِ الشِّخِّيرِ، قَالَ بَيْنَا أَنَا مَعَ، مُطَرِّفٍ بِالْمِرْبَدِ إِذْ دَخَلَ رَجُلٌ مَعَهُ قِطْعَةُ أُدْمٍ قَالَ كَتَبَ لِي هَذِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم فَهَلْ أَحَدٌ مِنْكُمْ يَقْرَأُ قَالَ قُلْتُ أَنَا أَقْرَأُ فَإِذَا فِيهَا ‏ \"‏ مِنْ مُحَمَّدٍ النَّبِيِّ صلى الله عليه وسلم لِبَنِي زُهَيْرِ بْنِ أُقَيْشٍ أَنَّهُمْ إِنْ شَهِدُوا أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ وَفَارَقُوا الْمُشْرِكِينَ وَأَقَرُّوا بِالْخُمُسِ فِي غَنَائِمِهِمْ وَسَهْمِ النَّبِيِّ صلى الله عليه وسلم وَصَفِيِّهِ فَإِنَّهُمْ آمِنُونَ بِأَمَانِ اللَّهِ وَرَسُولِهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 4147,
			"arabicnumber": 4147,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ يَحْيَى بْنِ الْحَارِثِ، قَالَ أَنْبَأَنَا مَحْبُوبٌ، قَالَ أَنْبَأَنَا أَبُو إِسْحَاقَ، عَنْ شَرِيكٍ، عَنْ خُصَيْفٍ، عَنْ مُجَاهِدٍ، قَالَ الْخُمُسُ الَّذِي لِلَّهِ وَلِلرَّسُولِ كَانَ لِلنَّبِيِّ صلى الله عليه وسلم وَقَرَابَتِهِ لاَ يَأْكُلُونَ مِنَ الصَّدَقَةِ شَيْئًا فَكَانَ لِلنَّبِيِّ صلى الله عليه وسلم خُمُسُ الْخُمُسِ وَلِذِي قَرَابَتِهِ خُمُسُ الْخُمُسِ وَلِلْيَتَامَى مِثْلُ ذَلِكَ وَلِلْمَسَاكِينِ مِثْلُ ذَلِكَ وَلاِبْنِ السَّبِيلِ مِثْلُ ذَلِكَ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ قَالَ اللَّهُ جَلَّ ثَنَاؤُهُ ‏{‏ وَاعْلَمُوا أَنَّمَا غَنِمْتُمْ مِنْ شَىْءٍ فَأَنَّ لِلَّهِ خُمُسَهُ وَلِلرَّسُولِ وَلِذِي الْقُرْبَى وَالْيَتَامَى وَالْمَسَاكِينِ وَابْنِ السَّبِيلِ ‏}‏ وَقَوْلُهُ عَزَّ وَجَلَّ لِلَّهِ ابْتِدَاءُ كَلاَمٍ لأَنَّ الأَشْيَاءَ كُلَّهَا لِلَّهِ عَزَّ وَجَلَّ وَلَعَلَّهُ إِنَّمَا اسْتَفْتَحَ الْكَلاَمَ فِي الْفَىْءِ وَالْخُمُسِ بِذِكْرِ نَفْسِهِ لأَنَّهَا أَشْرَفُ الْكَسْبِ وَلَمْ يَنْسُبِ الصَّدَقَةَ إِلَى نَفْسِهِ عَزَّ وَجَلَّ لأَنَّهَا أَوْسَاخُ النَّاسِ وَاللَّهُ تَعَالَى أَعْلَمُ وَقَدْ قِيلَ يُؤْخَذُ مِنَ الْغَنِيمَةِ شَىْءٌ فَيُجْعَلُ فِي الْكَعْبَةِ وَهُوَ السَّهْمُ الَّذِي لِلَّهِ عَزَّ وَجَلَّ وَسَهْمُ النَّبِيِّ صلى الله عليه وسلم إِلَى الإِمَامِ يَشْتَرِي الْكُرَاعَ مِنْهُ وَالسِّلاَحَ وَيُعْطِي مِنْهُ مَنْ رَأَى مِمَّنْ رَأَى فِيهِ غَنَاءً وَمَنْفَعَةً لأَهْلِ الإِسْلاَمِ وَمِنْ أَهْلِ الْحَدِيثِ وَالْعِلْمِ وَالْفِقْهِ وَالْقُرْآنِ وَسَهْمٌ لِذِي الْقُرْبَى وَهُمْ بَنُو هَاشِمٍ وَبَنُو الْمُطَّلِبِ بَيْنَهُمُ الْغَنِيُّ مِنْهُمْ وَالْفَقِيرُ وَقَدْ قِيلَ إِنَّهُ لِلْفَقِيرِ مِنْهُمْ دُونَ الْغَنِيِّ كَالْيَتَامَى وَابْنِ السَّبِيلِ وَهُوَ أَشْبَهُ الْقَوْلَيْنِ بِالصَّوَابِ عِنْدِي وَاللَّهُ تَعَالَى أَعْلَمُ وَالصَّغِيرُ وَالْكَبِيرُ وَالذَّكَرُ وَالأُنْثَى سَوَاءٌ لأَنَّ اللَّهَ عَزَّ وَجَلَّ جَعَلَ ذَلِكَ لَهُمْ وَقَسَّمَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فِيهِمْ وَلَيْسَ فِي الْحَدِيثِ أَنَّهُ فَضَّلَ بَعْضَهُمْ عَلَى بَعْضٍ وَلاَ خِلاَفَ نَعْلَمُهُ بَيْنَ الْعُلَمَاءِ فِي رَجُلٍ لَوْ أَوْصَى بِثُلُثِهِ لِبَنِي فُلاَنٍ أَنَّهُ بَيْنَهُمْ وَأَنَّ الذَّكَرَ وَالأُنْثَى فِيهِ سَوَاءٌ إِذَا كَانُوا يُحْصَوْنَ فَهَكَذَا كُلُّ شَىْءٍ صُيِّرَ لِبَنِي فُلاَنٍ أَنَّهُ بَيْنَهُمْ بِالسَّوِيَّةِ إِلاَّ أَنْ يُبَيِّنَ ذَلِكَ الآمِرُ بِهِ وَاللَّهُ وَلِيُّ التَّوْفِيقِ وَسَهْمٌ لِلْيَتَامَى مِنَ الْمُسْلِمِينَ وَسَهْمٌ لِلْمَسَاكِينِ مِنَ الْمُسْلِمِينَ وَسَهْمٌ لاِبْنِ السَّبِيلِ مِنَ الْمُسْلِمِينَ وَلاَ يُعْطَى أَحَدٌ مِنْهُمْ سَهْمُ مِسْكِينٍ وَسَهْمُ ابْنِ السَّبِيلِ وَقِيلَ لَهُ خُذْ أَيَّهُمَا شِئْتَ وَالأَرْبَعَةُ أَخْمَاسٍ يَقْسِمُهَا الإِمَامُ بَيْنَ مَنْ حَضَرَ الْقِتَالَ مِنَ الْمُسْلِمِينَ الْبَالِغِينَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 4148,
			"arabicnumber": 4148,
			"text": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، - يَعْنِي ابْنَ إِبْرَاهِيمَ - عَنْ أَيُّوبَ، عَنْ عِكْرِمَةَ بْنِ خَالِدٍ، عَنْ مَالِكِ بْنِ أَوْسِ بْنِ الْحَدَثَانِ، قَالَ جَاءَ الْعَبَّاسُ وَعَلِيٌّ إِلَى عُمَرَ يَخْتَصِمَانِ فَقَالَ الْعَبَّاسُ اقْضِ بَيْنِي وَبَيْنَ هَذَا ‏.‏ فَقَالَ النَّاسُ افْصِلْ بَيْنَهُمَا ‏.‏ فَقَالَ عُمَرُ لاَ أَفْصِلُ بَيْنَهُمَا قَدْ عَلِمَا أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ نُورَثُ مَا تَرَكْنَا صَدَقَةٌ ‏\"‏ ‏.‏ قَالَ فَقَالَ الزُّهْرِيُّ وَلِيَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَخَذَ مِنْهَا قُوتَ أَهْلِهِ وَجَعَلَ سَائِرَهُ سَبِيلَهُ سَبِيلَ الْمَالِ ثُمَّ وَلِيَهَا أَبُو بَكْرٍ بَعْدَهُ ثُمَّ وُلِّيتُهَا بَعْدَ أَبِي بَكْرٍ فَصَنَعْتُ فِيهَا الَّذِي كَانَ يَصْنَعُ ثُمَّ أَتَيَانِي فَسَأَلاَنِي أَنْ أَدْفَعَهَا إِلَيْهِمَا عَلَى أَنْ يَلِيَاهَا بِالَّذِي وَلِيَهَا بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم وَالَّذِي وَلِيَهَا بِهِ أَبُو بَكْرٍ وَالَّذِي وُلِّيتُهَا بِهِ فَدَفَعْتُهَا إِلَيْهِمَا وَأَخَذْتُ عَلَى ذَلِكَ عُهُودَهُمَا ثُمَّ أَتَيَانِي يَقُولُ هَذَا اقْسِمْ لِي بِنَصِيبِي مِنِ ابْنِ أَخِي ‏.‏ وُيَقُولُ هَذَا اقْسِمْ لِي بِنَصِيبِي مِنِ امْرَأَتِي ‏.‏ وَإِنْ شَاءَا أَنْ أَدْفَعَهَا إِلَيْهِمَا عَلَى أَنْ يَلِيَاهَا بِالَّذِي وَلِيَهَا بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم وَالَّذِي وَلِيَهَا بِهِ أَبُو بَكْرٍ وَالَّذِي وُلِّيتُهَا بِهِ دَفَعْتُهَا إِلَيْهِمَا وَإِنْ أَبَيَا كُفِيَا ذَلِكَ ثُمَّ قَالَ ‏{‏ وَاعْلَمُوا أَنَّمَا غَنِمْتُمْ مِنْ شَىْءٍ فَأَنَّ لِلَّهِ خُمُسَهُ وَلِلرَّسُولِ وَلِذِي الْقُرْبَى وَالْيَتَامَى وَالْمَسَاكِينِ وَابْنِ السَّبِيلِ ‏}‏ هَذَا لِهَؤُلاَءِ ‏{‏ إِنَّمَا الصَّدَقَاتُ لِلْفُقَرَاءِ وَالْمَسَاكِينِ وَالْعَامِلِينَ عَلَيْهَا وَالْمُؤَلَّفَةِ قُلُوبُهُمْ وَفِي الرِّقَابِ وَالْغَارِمِينَ وَفِي سَبِيلِ اللَّهِ ‏}‏ هَذِهِ لِهَؤُلاَءِ ‏{‏ وَمَا أَفَاءَ اللَّهُ عَلَى رَسُولِهِ مِنْهُمْ فَمَا أَوْجَفْتُمْ عَلَيْهِ مِنْ خَيْلٍ وَلاَ رِكَابٍ ‏}‏ قَالَ الزُّهْرِيُّ هَذِهِ لِرَسُولِ اللَّهِ صلى الله عليه وسلم خَاصَّةً قُرًى عَرَبِيَّةً فَدَكُ كَذَا وَكَذَا ‏{‏ مَا أَفَاءَ اللَّهُ عَلَى رَسُولِهِ مِنْ أَهْلِ الْقُرَى فَلِلَّهِ وَلِلرَّسُولِ وَلِذِي الْقُرْبَى وَالْيَتَامَى وَالْمَسَاكِينِ وَابْنِ السَّبِيلِ ‏}‏ وَ ‏{‏ لِلْفُقَرَاءِ الْمُهَاجِرِينَ الَّذِينَ أُخْرِجُوا مِنْ دِيَارِهِمْ وَأَمْوَالِهِمْ ‏}‏ ‏{‏ وَالَّذِينَ تَبَوَّءُوا الدَّارَ وَالإِيمَانَ مِنْ قَبْلِهِمْ ‏}‏ ‏{‏ وَالَّذِينَ جَاءُوا مِنْ بَعْدِهِمْ ‏}‏ فَاسْتَوْعَبَتْ هَذِهِ الآيَةُ النَّاسَ فَلَمْ يَبْقَ أَحَدٌ مِنَ الْمُسْلِمِينَ إِلاَّ لَهُ فِي هَذَا الْمَالِ حَقٌّ - أَوْ قَالَ حَظٌّ - إِلاَّ بَعْضَ مَنْ تَمْلِكُونَ مِنْ أَرِقَّائِكُمْ وَلَئِنْ عِشْتُ إِنْ شَاءَ اللَّهُ لَيَأْتِيَنَّ عَلَى كُلِّ مُسْلِمٍ حَقُّهُ أَوْ قَالَ حَظُّهُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 16
			}
		}
	]
}