{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"41": "The Book of al-Fara' and al-'Atirah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4222,
			"arabicnumber": 4222,
			"text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ فَرَعَ وَلاَ عَتِيرَةَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 4223,
			"arabicnumber": 4223,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثْتُ أَبَا إِسْحَاقَ، عَنْ مَعْمَرٍ، وَسُفْيَانَ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ أَحَدُهُمَا نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْفَرَعِ وَالْعَتِيرَةِ ‏.‏ وَقَالَ الآخَرُ ‏ \"‏ لاَ فَرَعَ وَلاَ عَتِيرَةَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 4224,
			"arabicnumber": 4224,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ زُرَارَةَ، قَالَ حَدَّثَنَا مُعَاذٌ، - وَهُوَ ابْنُ مُعَاذٍ - قَالَ حَدَّثَنَا ابْنُ عَوْنٍ، قَالَ حَدَّثَنَا أَبُو رَمْلَةَ، قَالَ أَنْبَأَنَا مِخْنَفُ بْنُ سُلَيْمٍ، قَالَ بَيْنَا نَحْنُ وُقُوفٌ مَعَ النَّبِيِّ صلى الله عليه وسلم بِعَرَفَةَ فَقَالَ ‏ \"‏ يَا أَيُّهَا النَّاسُ إِنَّ عَلَى أَهْلِ بَيْتٍ فِي كُلِّ عَامٍ أَضْحَاةً وَعَتِيرَةً ‏\"‏ ‏.‏ قَالَ مُعَاذٌ كَانَ ابْنُ عَوْنٍ يَعْتِرُ أَبْصَرَتْهُ عَيْنِي فِي رَجَبٍ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4225,
			"arabicnumber": 4225,
			"text": "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ يَعْقُوبَ بْنِ إِسْحَاقَ، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْمَجِيدِ أَبُو عَلِيٍّ الْحَنَفِيُّ، قَالَ حَدَّثَنَا دَاوُدُ بْنُ قَيْسٍ، قَالَ سَمِعْتُ عَمْرَو بْنَ شُعَيْبِ بْنِ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ عَمْرٍو، عَنْ أَبِيهِ، ‏{‏ عَنْ أَبِيهِ، ‏}‏ وَزَيْدِ بْنِ أَسْلَمَ قَالُوا يَا رَسُولَ اللَّهِ الْفَرَعَ ‏.‏ قَالَ ‏\"‏ حَقٌّ فَإِنْ تَرَكْتَهُ حَتَّى يَكُونَ بَكْرًا فَتَحْمِلَ عَلَيْهِ فِي سَبِيلِ اللَّهِ أَوْ تُعْطِيَهُ أَرْمَلَةً خَيْرٌ مِنْ أَنْ تَذْبَحَهُ فَيَلْصَقَ لَحْمُهُ بِوَبَرِهِ فَتُكْفِئَ إِنَاءَكَ وَتُوَلِّهَ نَاقَتَكَ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ فَالْعَتِيرَةُ قَالَ ‏\"‏ الْعَتِيرَةُ حَقٌّ ‏\"‏ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ أَبُو عَلِيٍّ الْحَنَفِيُّ هُمْ أَرْبَعَةُ إِخْوَةٍ أَحَدُهُمْ أَبُو بَكْرٍ وَبِشْرٌ وَشَرِيكٌ وَآخَرُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 4226,
			"arabicnumber": 4226,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، - يَعْنِي ابْنَ الْمُبَارَكِ - عَنْ يَحْيَى، - وَهُوَ ابْنُ زُرَارَةَ بْنِ كُرَيْمِ بْنِ الْحَارِثِ بْنِ عَمْرٍو الْبَاهِلِيُّ - قَالَ سَمِعْتُ أَبِي يَذْكُرُ، أَنَّهُ سَمِعَ جَدَّهُ الْحَارِثَ بْنَ عَمْرٍو، يُحَدِّثُ أَنَّهُ لَقِيَ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي حَجَّةِ الْوَدَاعِ وَهُوَ عَلَى نَاقَتِهِ الْعَضْبَاءِ فَأَتَيْتُهُ مِنْ أَحَدِ شِقَّيْهِ فَقُلْتُ يَا رَسُولَ اللَّهِ بِأَبِي أَنْتَ وَأُمِّي اسْتَغْفِرْ لِي ‏.‏ فَقَالَ ‏\"‏ غَفَرَ اللَّهُ لَكُمْ ‏\"‏ ‏.‏ ثُمَّ أَتَيْتُهُ مِنَ الشِّقِّ الآخَرِ أَرْجُو أَنْ يَخُصَّنِي دُونَهُمْ فَقُلْتُ يَا رَسُولَ اللَّهِ اسْتَغْفِرْ لِي ‏.‏ فَقَالَ بِيَدِهِ ‏\"‏ غَفَرَ اللَّهُ لَكُمْ ‏\"‏ ‏.‏ فَقَالَ رَجُلٌ مِنَ النَّاسِ يَا رَسُولَ اللَّهِ الْعَتَائِرُ وَالْفَرَائِعُ ‏.‏ قَالَ ‏\"‏ مَنْ شَاءَ عَتَرَ وَمَنْ شَاءَ لَمْ يَعْتِرْ وَمَنْ شَاءَ فَرَّعَ وَمَنْ شَاءَ لَمْ يُفَرِّعْ فِي الْغَنَمِ أُضْحِيَتُهَا ‏\"‏ ‏.‏ وَقَبَضَ أَصَابِعَهُ إِلاَّ وَاحِدَةً ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 4227,
			"arabicnumber": 4227,
			"text": "أَخْبَرَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا عَفَّانُ، قَالَ حَدَّثَنَا يَحْيَى بْنُ زُرَارَةَ السَّهْمِيُّ، قَالَ حَدَّثَنِي أَبِي، عَنْ جَدِّهِ الْحَارِثِ بْنِ عَمْرٍو، ح وَأَنْبَأَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا هِشَامُ بْنُ عَبْدِ الْمَلِكِ، قَالَ حَدَّثَنِي يَحْيَى بْنُ زُرَارَةَ السَّهْمِيُّ، قَالَ حَدَّثَنِي أَبِي، عَنْ جَدِّهِ الْحَارِثِ بْنِ عَمْرٍو، أَنَّهُ لَقِيَ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي حَجَّةِ الْوَدَاعِ فَقُلْتُ بِأَبِي أَنْتَ يَا رَسُولَ اللَّهِ وَأُمِّي اسْتَغْفِرْ لِي ‏.‏ فَقَالَ ‏ \"‏ غَفَرَ اللَّهُ لَكُمْ ‏\"‏ ‏.‏ وَهُوَ عَلَى نَاقَتِهِ الْعَضْبَاءِ ثُمَّ اسْتَدَرْتُ مِنَ الشِّقِّ الآخَرِ وَسَاقَ الْحَدِيثَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 4228,
			"arabicnumber": 4228,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنِ ابْنِ عَوْنٍ، قَالَ حَدَّثَنَا جَمِيلٌ، عَنْ أَبِي الْمَلِيحِ، عَنْ نُبَيْشَةَ، قَالَ ذُكِرَ لِلنَّبِيِّ صلى الله عليه وسلم قَالَ كُنَّا نَعْتِرُ فِي الْجَاهِلِيَّةِ ‏.‏ قَالَ ‏ \"‏ اذْبَحُوا لِلَّهِ عَزَّ وَجَلَّ فِي أَىِّ شَهْرٍ مَا كَانَ وَبَرُّوا اللَّهَ عَزَّ وَجَلَّ وَأَطْعِمُوا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 4229,
			"arabicnumber": 4229,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا بِشْرٌ، - وَهُوَ ابْنُ الْمُفَضَّلِ - عَنْ خَالِدٍ، وَرُبَّمَا، قَالَ عَنْ أَبِي الْمَلِيحِ، وَرُبَّمَا، ذَكَرَ أَبَا قِلاَبَةَ عَنْ نُبَيْشَةَ، قَالَ نَادَى رَجُلٌ وَهُوَ بِمِنًى فَقَالَ يَا رَسُولَ اللَّهِ إِنَّا كُنَّا نَعْتِرُ عَتِيرَةً فِي الْجَاهِلِيَّةِ فِي رَجَبٍ فَمَا تَأْمُرُنَا يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ اذْبَحُوا فِي أَىِّ شَهْرٍ مَا كَانَ وَبَرُّوا اللَّهَ عَزَّ وَجَلَّ وَأَطْعِمُوا ‏\"‏ ‏.‏ قَالَ إِنَّا كُنَّا نُفْرِعُ فَرَعًا فَمَا تَأْمُرُنَا قَالَ ‏\"‏ فِي كُلِّ سَائِمَةٍ فَرَعٌ تَغْذُوهُ مَاشِيَتُكَ حَتَّى إِذَا اسْتَحْمَلَ ذَبَحْتَهُ وَتَصَدَّقْتَ بِلَحْمِهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 4230,
			"arabicnumber": 4230,
			"text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، قَالَ حَدَّثَنَا غُنْدَرٌ، عَنْ شُعْبَةَ، عَنْ خَالِدٍ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي الْمَلِيحِ، وَأَحْسَبُنِي، قَدْ سَمِعْتُهُ مِنَ أَبِي الْمَلِيحِ، عَنْ نُبَيْشَةَ، - رَجُلٌ مِنْ هُذَيْلٍ - عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ إِنِّي كُنْتُ نَهَيْتُكُمْ عَنْ لُحُومِ الأَضَاحِي فَوْقَ ثَلاَثٍ كَيْمَا تَسَعَكُمْ فَقَدْ جَاءَ اللَّهُ عَزَّ وَجَلَّ بِالْخَيْرِ فَكُلُوا وَتَصَدَّقُوا وَادَّخِرُوا وَإِنَّ هَذِهِ الأَيَّامَ أَيَّامُ أَكْلٍ وَشُرْبٍ وَذِكْرِ اللَّهِ عَزَّ وَجَلَّ ‏\"‏ ‏.‏ فَقَالَ رَجُلٌ إِنَّا كُنَّا نَعْتِرُ عَتِيرَةً فِي الْجَاهِلِيَّةِ فِي رَجَبٍ فَمَا تَأْمُرُنَا قَالَ ‏\"‏ اذْبَحُوا لِلَّهِ عَزَّ وَجَلَّ فِي أَىِّ شَهْرٍ مَا كَانَ وَبَرُّوا اللَّهَ عَزَّ وَجَلَّ وَأَطْعِمُوا ‏\"‏ ‏.‏ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ إِنَّا كُنَّا نُفَرِّعُ فَرَعًا فِي الْجَاهِلِيَّةِ فَمَا تَأْمُرُنَا قَالَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فِي كُلِّ سَائِمَةٍ مِنَ الْغَنَمِ فَرَعٌ تَغْذُوهُ غَنَمُكَ حَتَّى إِذَا اسْتَحْمَلَ ذَبَحْتَهُ وَتَصَدَّقْتَ بِلَحْمِهِ عَلَى ابْنِ السَّبِيلِ فَإِنَّ ذَلِكَ هُوَ خَيْرٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 4231,
			"arabicnumber": 4231,
			"text": "أَخْبَرَنَا أَبُو الأَشْعَثِ، أَحْمَدُ بْنُ الْمِقْدَامِ قَالَ حَدَّثَنَا يَزِيدُ، - وَهُوَ ابْنُ زُرَيْعٍ - قَالَ أَنْبَأَنَا خَالِدٌ، عَنْ أَبِي الْمَلِيحِ، عَنْ نُبَيْشَةَ، قَالَ نَادَى النَّبِيَّ صلى الله عليه وسلم رَجُلٌ فَقَالَ إِنَّا كُنَّا نَعْتِرُ عَتِيرَةً يَعْنِي فِي الْجَاهِلِيَّةِ فِي رَجَبٍ فَمَا تَأْمُرُنَا قَالَ ‏\"‏ اذْبَحُوهَا فِي أَىِّ شَهْرٍ كَانَ وَبَرُّوا اللَّهَ عَزَّ وَجَلَّ وَأَطْعِمُوا ‏\"‏ ‏.‏ قَالَ إِنَّا كُنَّا نُفْرِعُ فَرَعًا فِي الْجَاهِلِيَّةِ ‏.‏ قَالَ ‏\"‏ فِي كُلِّ سَائِمَةٍ فَرَعٌ حَتَّى إِذَا اسْتَحْمَلَ ذَبَحْتَهُ وَتَصَدَّقْتَ بِلَحْمِهِ فَإِنَّ ذَلِكَ هُوَ خُيْرٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 4232,
			"arabicnumber": 4232,
			"text": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، عَنِ ابْنِ عُلَيَّةَ، عَنْ خَالِدٍ، قَالَ حَدَّثَنِي أَبُو قِلاَبَةَ، عَنْ أَبِي الْمَلِيحِ، فَلَقِيتُ أَبَا الْمَلِيحِ فَسَأَلْتُهُ فَحَدَّثَنِي عَنْ نُبَيْشَةَ الْهُذَلِيِّ، قَالَ قَالَ رَجُلٌ يَا رَسُولَ اللَّهِ إِنَّا كُنَّا نَعْتِرُ عَتِيرَةً فِي الْجَاهِلِيَّةِ فَمَا تَأْمُرُنَا قَالَ ‏ \"‏ اذْبَحُوا لِلَّهِ عَزَّ وَجَلَّ فِي أَىِّ شَهْرٍ مَا كَانَ وَبَرُّوا اللَّهَ عَزَّ وَجَلَّ وَأَطْعِمُوا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 4233,
			"arabicnumber": 4233,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ يَعْلَى بْنِ عَطَاءٍ، عَنْ وَكِيعِ بْنِ عُدُسٍ، عَنْ عَمِّهِ أَبِي رَزِينٍ، لَقِيطِ بْنِ عَامِرٍ الْعُقَيْلِيِّ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ إِنَّا كُنَّا نَذْبَحُ ذَبَائِحَ فِي الْجَاهِلِيَّةِ فِي رَجَبٍ فَنَأْكُلُ وَنُطْعِمُ مَنْ جَاءَنَا ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ بَأْسَ بِهِ ‏\"‏ ‏.‏ قَالَ وَكِيعُ بْنُ عُدُسٍ فَلاَ أَدَعُهُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 4234,
			"arabicnumber": 4234,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، عَنْ مَيْمُونَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم مَرَّ عَلَى شَاةٍ مَيِّتَةٍ مُلْقَاةٍ فَقَالَ ‏\"‏ لِمَنْ هَذِهِ ‏\"‏ ‏.‏ فَقَالُوا لِمَيْمُونَةَ ‏.‏ فَقَالَ ‏\"‏ مَا عَلَيْهَا لَوِ انْتَفَعَتْ بِإِهَابِهَا ‏\"‏ ‏.‏ قَالُوا إِنَّهَا مَيْتَةٌ ‏.‏ فَقَالَ ‏\"‏ إِنَّمَا حَرَّمَ اللَّهُ عَزَّ وَجَلَّ أَكْلَهَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 4235,
			"arabicnumber": 4235,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، وَالْحَارِثُ بْنُ مِسْكِينٍ، قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، - وَاللَّفْظُ لَهُ - عَنِ ابْنِ الْقَاسِمِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ مَرَّ رَسُولُ اللَّهِ صلى الله عليه وسلم بِشَاةٍ مَيِّتَةٍ كَانَ أَعْطَاهَا مَوْلاَةً لِمَيْمُونَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ هَلاَّ انْتَفَعْتُمْ بِجِلْدِهَا ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ إِنَّهَا مَيْتَةٌ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّمَا حُرِّمَ أَكْلُهَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 4236,
			"arabicnumber": 4236,
			"text": "أَخْبَرَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ بْنِ سَعْدٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ جَدِّي، عَنِ ابْنِ أَبِي حَبِيبٍ، - يَعْنِي يَزِيدَ - عَنْ حَفْصِ بْنِ الْوَلِيدِ، عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، حَدَّثَهُ أَنَّ ابْنَ عَبَّاسٍ حَدَّثَهُ قَالَ أَبْصَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم شَاةً مَيِّتَةً لِمَوْلاَةٍ لِمَيْمُونَةَ وَكَانَتْ مِنَ الصَّدَقَةِ فَقَالَ ‏\"‏ لَوْ نَزَعُوا جِلْدَهَا فَانْتَفَعُوا بِهِ ‏\"‏ ‏.‏ قَالُوا إِنَّهَا مَيْتَةٌ ‏.‏ قَالَ ‏\"‏ إِنَّمَا حُرِّمَ أَكْلُهَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 4237,
			"arabicnumber": 4237,
			"text": "أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ خَالِدٍ الْقَطَّانُ الرَّقِّيُّ، قَالَ حَدَّثَنَا حَجَّاجٌ، قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ، قَالَ أَخْبَرَنِي عَطَاءٌ، مُنْذُ حِينٍ عَنِ ابْنِ عَبَّاسٍ، أَخْبَرَتْنِي مَيْمُونَةُ، أَنَّ شَاةً، مَاتَتْ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ أَلاَّ دَفَعْتُمْ إِهَابَهَا فَاسْتَمْتَعْتُمْ بِهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 4238,
			"arabicnumber": 4238,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، عَنْ سُفْيَانَ، عَنْ عَمْرٍو، عَنْ عَطَاءٍ، قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ، قَالَ مَرَّ النَّبِيُّ صلى الله عليه وسلم بِشَاةٍ لِمَيْمُونَةَ مَيِّتَةٍ فَقَالَ ‏ \"‏ أَلاَّ أَخَذْتُمْ إِهَابَهَا فَدَبَغْتُمْ فَانْتَفَعْتُمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 4239,
			"arabicnumber": 4239,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ قُدَامَةَ، عَنْ جَرِيرٍ، عَنْ مُغِيرَةَ، عَنِ الشَّعْبِيِّ، قَالَ قَالَ ابْنُ عَبَّاسٍ مَرَّ النَّبِيُّ صلى الله عليه وسلم عَلَى شَاةٍ مَيِّتَةٍ فَقَالَ ‏ \"‏ أَلاَّ انْتَفَعْتُمْ بِإِهَابِهَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 4240,
			"arabicnumber": 4240,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ بْنِ أَبِي رِزْمَةَ، قَالَ أَنْبَأَنَا الْفَضْلُ بْنُ مُوسَى، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، عَنِ الشَّعْبِيِّ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، عَنْ سَوْدَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم قَالَتْ مَاتَتْ شَاةٌ لَنَا فَدَبَغْنَا مَسْكَهَا فَمَازِلْنَا نَنْبِذُ فِيهَا حَتَّى صَارَتْ شَنًّا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 4241,
			"arabicnumber": 4241,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، وَعَلِيُّ بْنُ حُجْرٍ، عَنْ سُفْيَانَ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنِ ابْنِ وَعْلَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَيُّمَا إِهَابٍ دُبِغَ فَقَدْ طَهُرَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 4242,
			"arabicnumber": 4242,
			"text": "أَخْبَرَنِي الرَّبِيعُ بْنُ سُلَيْمَانَ بْنِ دَاوُدَ، قَالَ حَدَّثَنَا إِسْحَاقُ بْنُ بَكْرٍ، - وَهُوَ ابْنُ مُضَرَ - قَالَ حَدَّثَنِي أَبِي، عَنْ جَعْفَرِ بْنِ رَبِيعَةَ، أَنَّهُ سَمِعَ أَبَا الْخَيْرِ، عَنِ ابْنِ وَعْلَةَ، أَنَّهُ سَأَلَ ابْنَ عَبَّاسٍ فَقَالَ إِنَّا نَغْزُو هَذَا الْمَغْرِبَ وَإِنَّهُمْ أَهْلُ وَثَنٍ وَلَهُمْ قِرَبٌ يَكُونُ فِيهَا اللَّبَنُ وَالْمَاءُ فَقَالَ ابْنُ عَبَّاسٍ الدِّبَاغُ طَهُورٌ ‏.‏ قَالَ ابْنُ وَعْلَةَ عَنْ رَأْيِكَ أَوْ شَىْءٍ سَمِعْتَهُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ بَلْ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 4243,
			"arabicnumber": 4243,
			"text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ جَوْنِ بْنِ قَتَادَةَ، عَنْ سَلَمَةَ بْنِ الْمُحَبِّقِ، أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم فِي غَزْوَةِ تَبُوكَ دَعَا بِمَاءٍ مِنْ عِنْدِ امْرَأَةٍ قَالَتْ مَا عِنْدِي إِلاَّ فِي قِرْبَةٍ لِي مَيْتَةٍ ‏.‏ قَالَ ‏\"‏ أَلَيْسَ قَدْ دَبَغْتِهَا ‏\"‏ ‏.‏ قَالَتْ بَلَى ‏.‏ قَالَ ‏\"‏ فَإِنَّ دِبَاغَهَا ذَكَاتُهَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 4244,
			"arabicnumber": 4244,
			"text": "أَخْبَرَنَا الْحُسَيْنُ بْنُ مَنْصُورِ بْنِ جَعْفَرٍ النَّيْسَابُورِيُّ، قَالَ حَدَّثَنَا الْحُسَيْنُ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا شَرِيكٌ، عَنِ الأَعْمَشِ، عَنْ عُمَارَةَ بْنِ عُمَيْرٍ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ سُئِلَ النَّبِيُّ صلى الله عليه وسلم عَنْ جُلُودِ الْمَيْتَةِ فَقَالَ ‏ \"‏ دِبَاغُهَا طَهُورُهَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 4245,
			"arabicnumber": 4245,
			"text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعْدِ بْنِ إِبْرَاهِيمَ بْنِ سَعْدٍ، قَالَ حَدَّثَنَا عَمِّي، قَالَ حَدَّثَنَا شَرِيكٌ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ سُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ جُلُودِ الْمَيْتَةِ فَقَالَ ‏ \"‏ دِبَاغُهَا ذَكَاتُهَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 4246,
			"arabicnumber": 4246,
			"text": "أَخْبَرَنَا أَيُّوبُ بْنُ مُحَمَّدٍ الْوَزَّانُ، قَالَ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا شَرِيكٌ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ ذَكَاةُ الْمَيْتَةِ دِبَاغُهَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 4247,
			"arabicnumber": 4247,
			"text": "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ يَعْقُوبَ، قَالَ حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا إِسْرَائِيلُ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ ذَكَاةُ الْمَيْتَةِ دِبَاغُهَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 4248,
			"arabicnumber": 4248,
			"text": "أَخْبَرَنَا سُلَيْمَانُ بْنُ دَاوُدَ، عَنِ ابْنِ وَهْبٍ، قَالَ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، وَاللَّيْثُ بْنُ سَعْدٍ، عَنْ كَثِيرِ بْنِ فَرْقَدٍ، أَنَّ عَبْدَ اللَّهِ بْنَ مَالِكِ بْنِ حُذَافَةَ، حَدَّثَهُ عَنِ الْعَالِيَةِ بِنْتِ سُبَيْعٍ، أَنَّ مَيْمُونَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم حَدَّثَتْهَا أَنَّهُ مَرَّ بِرَسُولِ اللَّهِ صلى الله عليه وسلم رِجَالٌ مِنْ قُرَيْشٍ يَجُرُّونَ شَاةً لَهُمْ مِثْلَ الْحِصَانِ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَوْ أَخَذْتُمْ إِهَابَهَا ‏\"‏ ‏.‏ قَالُوا إِنَّهَا مَيْتَةٌ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يُطَهِّرُهَا الْمَاءُ وَالْقَرَظُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 4249,
			"arabicnumber": 4249,
			"text": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا بِشْرٌ، - يَعْنِي ابْنَ الْمُفَضَّلِ - قَالَ حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنِ ابْنِ أَبِي لَيْلَى، عَنْ عَبْدِ اللَّهِ بْنِ عُكَيْمٍ، قَالَ قُرِئَ عَلَيْنَا كِتَابُ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَنَا غُلاَمٌ شَابٌّ ‏ \"‏ أَنْ لاَ تَنْتَفِعُوا مِنَ الْمَيْتَةِ بِإِهَابٍ وَلاَ عَصَبٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 4250,
			"arabicnumber": 4250,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ قُدَامَةَ، قَالَ حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنِ الْحَكَمِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ عَبْدِ اللَّهِ بْنِ عُكَيْمٍ، قَالَ كَتَبَ إِلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَنْ لاَ تَسْتَمْتِعُوا مِنَ الْمَيْتَةِ بِإِهَابٍ وَلاَ عَصَبٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 4251,
			"arabicnumber": 4251,
			"text": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ حَدَّثَنَا شَرِيكٌ، عَنْ هِلاَلٍ الْوَزَّانِ، عَنْ عَبْدِ اللَّهِ بْنِ عُكَيْمٍ، قَالَ كَتَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى جُهَيْنَةَ ‏ \"‏ أَنْ لاَ تَنْتَفِعُوا مِنَ الْمَيْتَةِ بِإِهَابٍ وَلاَ عَصَبٍ ‏\"‏ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ أَصَحُّ مَا فِي هَذَا الْبَابِ فِي جُلُودِ الْمَيْتَةِ إِذَا دُبِغَتْ حَدِيثُ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنِ ابْنِ عَبَّاسٍ عَنْ مَيْمُونَةَ وَاللَّهُ تَعَالَى أَعْلَمُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 4252,
			"arabicnumber": 4252,
			"text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا بِشْرُ بْنُ عُمَرَ، قَالَ حَدَّثَنَا مَالِكٌ، ح وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، عَنِ ابْنِ الْقَاسِمِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ قُسَيْطٍ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أُمِّهِ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَمَرَ أَنْ يُسْتَمْتَعَ بِجُلُودِ الْمَيْتَةِ إِذَا دُبِغَتْ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 4253,
			"arabicnumber": 4253,
			"text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، عَنْ يَحْيَى، عَنِ ابْنِ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنْ أَبِي الْمَلِيحِ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنْ جُلُودِ السِّبَاعِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 4254,
			"arabicnumber": 4254,
			"text": "أَخْبَرَنِي عَمْرُو بْنُ عُثْمَانَ، قَالَ حَدَّثَنَا بَقِيَّةُ، عَنْ بَحِيرٍ، عَنْ خَالِدِ بْنِ مَعْدَانَ، عَنِ الْمِقْدَامِ بْنِ مَعْدِيكَرِبَ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْحَرِيرِ وَالذَّهَبِ وَمَيَاثِرِ النُّمُورِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 4255,
			"arabicnumber": 4255,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ، قَالَ حَدَّثَنَا بَقِيَّةُ، عَنْ بَحِيرٍ، عَنْ خَالِدٍ، قَالَ وَفَدَ الْمِقْدَامُ بْنُ مَعْدِيكَرِبَ عَلَى مُعَاوِيَةَ فَقَالَ لَهُ أَنْشُدُكَ بِاللَّهِ هَلْ تَعْلَمُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ لُبُوسِ جُلُودِ السِّبَاعِ وَالرُّكُوبِ عَلَيْهَا قَالَ نَعَمْ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 4256,
			"arabicnumber": 4256,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَامَ الْفَتْحِ وَهُوَ بِمَكَّةَ يَقُولُ ‏\"‏ إِنَّ اللَّهَ عَزَّ وَجَلَّ وَرَسُولَهُ حَرَّمَ بَيْعَ الْخَمْرِ وَالْمَيْتَةِ وَالْخِنْزِيرِ وَالأَصْنَامِ ‏\"‏ ‏.‏ فَقِيلَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ شُحُومَ الْمَيْتَةِ فَإِنَّهُ يُطْلَى بِهَا السُّفُنُ وَيُدَّهَنُ بِهَا الْجُلُودُ وَيَسْتَصْبِحُ بِهَا النَّاسُ ‏.‏ فَقَالَ ‏\"‏ لاَ هُوَ حَرَامٌ ‏\"‏ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم عِنْدَ ذَلِكَ ‏\"‏ قَاتَلَ اللَّهُ الْيَهُودَ إِنَّ اللَّهَ عَزَّ وَجَلَّ لَمَّا حَرَّمَ عَلَيْهِمُ الشُّحُومَ جَمَّلُوهُ ثُمَّ بَاعُوهُ فَأَكَلُوا ثَمَنَهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 4257,
			"arabicnumber": 4257,
			"text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ أُبْلِغَ عُمَرُ أَنَّ سَمُرَةَ، بَاعَ خَمْرًا قَالَ قَاتَلَ اللَّهُ سَمُرَةَ أَلَمْ يَعْلَمْ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ قَاتَلَ اللَّهُ الْيَهُودَ حُرِّمَتْ عَلَيْهِمُ الشُّحُومُ فَجَمَّلُوهَا ‏\"‏ ‏.‏ قَالَ سُفْيَانُ يَعْنِي أَذَابُوهَا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 4258,
			"arabicnumber": 4258,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، عَنْ مَيْمُونَةَ، أَنَّ فَأْرَةً، وَقَعَتْ، فِي سَمْنٍ فَمَاتَتْ فَسُئِلَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏ \"‏ أَلْقُوهَا وَمَا حَوْلَهَا وَكُلُوهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 4259,
			"arabicnumber": 4259,
			"text": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ، وَمُحَمَّدُ بْنُ يَحْيَى بْنِ عَبْدِ اللَّهِ النَّيْسَابُورِيُّ، عَنْ عَبْدِ الرَّحْمَنِ، عَنْ مَالِكٍ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، عَنْ مَيْمُونَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم سُئِلَ عَنْ فَأْرَةٍ وَقَعَتْ فِي سَمْنٍ جَامِدٍ فَقَالَ ‏ \"‏ خُذُوهَا وَمَا حَوْلَهَا فَأَلْقُوهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 4260,
			"arabicnumber": 4260,
			"text": "أَخْبَرَنَا خُشَيْشُ بْنُ أَصْرَمَ، قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ بُؤْذُويَةَ، أَنَّ مَعْمَرًا، ذَكَرَهُ عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، عَنْ مَيْمُونَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ سُئِلَ عَنِ الْفَأْرَةِ تَقَعُ فِي السَّمْنِ فَقَالَ ‏ \"‏ إِنْ كَانَ جَامِدًا فَأَلْقُوهَا وَمَا حَوْلَهَا وَإِنْ كَانَ مَائِعًا فَلاَ تَقْرَبُوهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 4261,
			"arabicnumber": 4261,
			"text": "أَخْبَرَنَا سَلَمَةُ بْنُ أَحْمَدَ بْنِ سُلَيْمِ بْنِ عُثْمَانَ الْفَوْزِيُّ، قَالَ حَدَّثَنَا جَدِّي الْخَطَّابُ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ حِمْيَرٍ، قَالَ حَدَّثَنَا ثَابِتُ بْنُ عَجْلاَنَ، قَالَ سَمِعْتُ سَعِيدَ بْنَ جُبَيْرٍ، يَقُولُ سَمِعْتُ ابْنَ عَبَّاسٍ، يَقُولُ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم مَرَّ بِعَنْزٍ مَيِّتَةٍ فَقَالَ ‏ \"‏ مَا كَانَ عَلَى أَهْلِ هَذِهِ الشَّاةِ لَوِ انْتَفَعُوا بِإِهَابِهَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 4262,
			"arabicnumber": 4262,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، قَالَ حَدَّثَنِي سَعِيدُ بْنُ خَالِدٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا وَقَعَ الذُّبَابُ فِي إِنَاءِ أَحَدِكُمْ فَلْيَمْقُلْهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 41
			}
		}
	]
}