{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"42": "The Book of Hunting and Slaughtering"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4263,
			"arabicnumber": 4263,
			"text": "أَخْبَرَنَا الإِمَامُ أَبُو عَبْدِ الرَّحْمَنِ النَّسَائِيُّ، بِمِصْرَ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، عَنْ سُوَيْدِ بْنِ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ عَاصِمٍ، عَنِ الشَّعْبِيِّ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، أَنَّهُ سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الصَّيْدِ فَقَالَ ‏ \"‏ إِذَا أَرْسَلْتَ كَلْبَكَ فَاذْكُرِ اسْمَ اللَّهِ عَلَيْهِ فَإِنْ أَدْرَكْتَهُ لَمْ يَقْتُلْ فَاذْبَحْ وَاذْكُرِ اسْمَ اللَّهِ عَلَيْهِ وَإِنْ أَدْرَكْتَهُ قَدْ قَتَلَ وَلَمْ يَأْكُلْ فَكُلْ فَقَدْ أَمْسَكَهُ عَلَيْكَ فَإِنْ وَجَدْتَهُ قَدْ أَكَلَ مِنْهُ فَلاَ تَطْعَمْ مِنْهُ شَيْئًا فَإِنَّمَا أَمْسَكَ عَلَى نَفْسِهِ وَإِنْ خَالَطَ كَلْبُكَ كِلاَبًا فَقَتَلْنَ فَلَمْ يَأْكُلْنَ فَلاَ تَأْكُلْ مِنْهُ شَيْئًا فَإِنَّكَ لاَ تَدْرِي أَيُّهَا قَتَلَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 4264,
			"arabicnumber": 4264,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ، عَنْ زَكَرِيَّا، عَنِ الشَّعْبِيِّ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ صَيْدِ الْمِعْرَاضِ فَقَالَ ‏\"‏ مَا أَصَبْتَ بِحَدِّهِ فَكُلْ وَمَا أَصَبْتَ بِعَرْضِهِ فَهُوَ وَقِيذٌ ‏\"‏ ‏.‏ وَسَأَلْتُهُ عَنِ الْكَلْبِ فَقَالَ ‏\"‏ إِذَا أَرْسَلْتَ كَلْبَكَ فَأَخَذَ وَلَمْ يَأْكُلْ فَكُلْ فَإِنَّ أَخْذَهُ ذَكَاتُهُ وَإِنْ كَانَ مَعَ كَلْبِكَ كَلْبٌ آخَرُ فَخَشِيتَ أَنْ يَكُونَ أَخَذَ مَعَهُ فَقَتَلَ فَلاَ تَأْكُلْ فَإِنَّكَ إِنَّمَا سَمَّيْتَ عَلَى كَلْبِكَ وَلَمْ تُسَمِّ عَلَى غَيْرِهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 4265,
			"arabicnumber": 4265,
			"text": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا أَبُو عَبْدِ الصَّمَدِ عَبْدُ الْعَزِيزِ بْنُ عَبْدِ الصَّمَدِ، قَالَ حَدَّثَنَا مَنْصُورٌ، عَنْ إِبْرَاهِيمَ، عَنْ هَمَّامِ بْنِ الْحَارِثِ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، أَنَّهُ سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ أُرْسِلُ الْكَلْبَ الْمُعَلَّمَ فَيَأْخُذُ ‏.‏ فَقَالَ ‏\"‏ إِذَا أَرْسَلْتَ الْكَلْبَ الْمُعَلَّمَ وَذَكَرْتَ اسْمَ اللَّهِ عَلَيْهِ فَأَخَذَ فَكُلْ ‏\"‏ ‏.‏ قُلْتُ وَإِنْ قَتَلَ قَالَ ‏\"‏ وَإِنْ قَتَلَ ‏\"‏ ‏.‏ قُلْتُ أَرْمِي بِالْمِعْرَاضِ ‏.‏ قَالَ ‏\"‏ إِذَا أَصَابَ بِحَدِّهِ فَكُلْ وَإِذَا أَصَابَ بِعَرْضِهِ فَلاَ تَأْكُلْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4266,
			"arabicnumber": 4266,
			"text": "أَخْبَرَنِي مُحَمَّدُ بْنُ عُبَيْدِ بْنِ مُحَمَّدٍ الْكُوفِيُّ الْمُحَارِبِيُّ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ حَيْوَةَ بْنِ شُرَيْحٍ، قَالَ سَمِعْتُ رَبِيعَةَ بْنَ يَزِيدَ، يَقُولُ أَنْبَأَنَا أَبُو إِدْرِيسَ، عَائِذُ اللَّهِ قَالَ سَمِعْتُ أَبَا ثَعْلَبَةَ الْخُشَنِيَّ، يَقُولُ قُلْتُ يَا رَسُولَ اللَّهِ إِنَّا بِأَرْضِ صَيْدٍ أَصِيدُ بِقَوْسِي وَأَصِيدُ بِكَلْبِي الْمُعَلَّمِ وَبِكَلْبِي الَّذِي لَيْسَ بِمُعَلَّمٍ ‏.‏ فَقَالَ ‏ \"‏ مَا أَصَبْتَ بِقَوْسِكَ فَاذْكُرِ اسْمَ اللَّهِ عَلَيْهِ وَكُلْ وَمَا أَصَبْتَ بِكَلْبِكَ الْمُعَلَّمِ فَاذْكُرِ اسْمَ اللَّهِ وَكُلْ وَمَا أَصَبْتَ بِكَلْبِكَ الَّذِي لَيْسَ بِمُعَلَّمٍ فَأَدْرَكْتَ ذَكَاتَهُ فَكُلْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 4267,
			"arabicnumber": 4267,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ زُنْبُورٍ أَبُو صَالِحٍ الْمَكِّيُّ، قَالَ حَدَّثَنَا فُضَيْلُ بْنُ عِيَاضٍ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ هَمَّامِ بْنِ الْحَارِثِ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ أُرْسِلُ كِلاَبِي الْمُعَلَّمَةَ فَيُمْسِكْنَ عَلَىَّ فَآكُلُ قَالَ ‏\"‏ إِذَا أَرْسَلْتَ كِلاَبَكَ الْمُعَلَّمَةَ فَأَمْسَكْنَ عَلَيْكَ فَكُلْ ‏\"‏ ‏.‏ قُلْتُ وَإِنْ قَتَلْنَ قَالَ ‏\"‏ وَإِنْ قَتَلْنَ ‏\"‏ ‏.‏ قَالَ ‏\"‏ مَا لَمْ يَشْرَكْهُنَّ كَلْبٌ مِنْ سِوَاهُنَّ ‏\"‏ ‏.‏ قُلْتُ أَرْمِي بِالْمِعْرَاضِ فَيَخْزِقُ ‏.‏ قَالَ ‏\"‏ إِنْ خَزَقَ فَكُلْ وَإِنْ أَصَابَ بِعَرْضِهِ فَلاَ تَأْكُلْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 4268,
			"arabicnumber": 4268,
			"text": "أَخْبَرَنِي عَمْرُو بْنُ يَحْيَى بْنِ الْحَارِثِ، قَالَ حَدَّثَنَا أَحْمَدُ بْنُ أَبِي شُعَيْبٍ، قَالَ حَدَّثَنَا مُوسَى بْنُ أَعْيَنَ، عَنْ مَعْمَرٍ، عَنْ عَاصِمِ بْنِ سُلَيْمَانَ، عَنْ عَامِرٍ الشَّعْبِيِّ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، أَنَّهُ سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الصَّيْدِ فَقَالَ ‏ \"‏ إِذَا أَرْسَلْتَ كَلْبَكَ فَخَالَطَتْهُ أَكْلُبٌ لَمْ تُسَمِّ عَلَيْهَا فَلاَ تَأْكُلْ فَإِنَّكَ لاَ تَدْرِي أَيَّهَا قَتَلَهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 4269,
			"arabicnumber": 4269,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا زَكَرِيَّا، - وَهُوَ ابْنُ أَبِي زَائِدَةَ - قَالَ حَدَّثَنَا عَامِرٌ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الْكَلْبِ فَقَالَ ‏ \"‏ إِذَا أَرْسَلْتَ كَلْبَكَ فَسَمَّيْتَ فَكُلْ وَإِنْ وَجَدْتَ كَلْبًا آخَرَ مَعَ كَلْبِكَ فَلاَ تَأْكُلْ فَإِنَّمَا سَمَّيْتَ عَلَى كَلْبِكَ وَلَمْ تُسَمِّ عَلَى غَيْرِهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 4270,
			"arabicnumber": 4270,
			"text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ الْحَكَمِ، قَالَ حَدَّثَنَا مُحَمَّدٌ، - وَهُوَ ابْنُ جَعْفَرٍ - قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ سَعِيدِ بْنِ مَسْرُوقٍ، قَالَ حَدَّثَنَا الشَّعْبِيُّ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، - وَكَانَ لَنَا جَارًا وَدَخِيلاً وَرَبِيطًا بِالنَّهْرَيْنِ - أَنَّهُ سَأَلَ النَّبِيَّ صلى الله عليه وسلم قَالَ أُرْسِلُ كَلْبِي فَأَجِدُ مَعَ كَلْبِي كَلْبًا قَدْ أَخَذَ لاَ أَدْرِي أَيَّهُمَا أَخَذَ قَالَ ‏ \"‏ لاَ تَأْكُلْ فَإِنَّمَا سَمَّيْتَ عَلَى كَلْبِكَ وَلَمْ تُسَمِّ عَلَى غَيْرِهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 4271,
			"arabicnumber": 4271,
			"text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ الْحَكَمِ، قَالَ حَدَّثَنَا مُحَمَّدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، قَالَ حَدَّثَنَا عَنِ الشَّعْبِيِّ، عَنْ عَدِيٍّ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِ ذَلِكَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 4272,
			"arabicnumber": 4272,
			"text": "أَخْبَرَنَا سُلَيْمَانُ بْنُ عُبَيْدِ اللَّهِ بْنِ عَمْرٍو الْغَيْلاَنِيُّ الْبَصْرِيُّ، قَالَ حَدَّثَنَا بَهْزٌ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي السَّفَرِ، عَنْ عَامِرٍ الشَّعْبِيِّ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم قُلْتُ أُرْسِلُ كَلْبِي ‏.‏ قَالَ ‏ \"‏ إِذَا أَرْسَلْتَ كَلْبَكَ فَسَمَّيْتَ فَكُلْ وَإِنْ أَكَلَ مِنْهُ فَلاَ تَأْكُلْ فَإِنَّمَا أَمْسَكَ عَلَى نَفْسِهِ وَإِذَا أَرْسَلْتَ كَلْبَكَ فَوَجَدْتَ مَعَهُ غَيْرَهُ فَلاَ تَأْكُلْ فَإِنَّكَ إِنَّمَا سَمَّيْتَ عَلَى كَلْبِكَ وَلَمْ تُسَمِّ عَلَى غَيْرِهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 4273,
			"arabicnumber": 4273,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا أَبُو دَاوُدَ، عَنْ شُعْبَةَ، عَنِ ابْنِ أَبِي السَّفَرِ، عَنِ الشَّعْبِيِّ، وَعَنِ الْحَكَمِ، عَنِ الشَّعْبِيِّ، وَعَنْ سَعِيدِ بْنِ مَسْرُوقٍ، عَنِ الشَّعْبِيِّ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم قُلْتُ أُرْسِلُ كَلْبِي فَأَجِدُ مَعَ كَلْبِي كَلْبًا آخَرَ لاَ أَدْرِي أَيَّهُمَا أَخَذَ قَالَ ‏ \"‏ لاَ تَأْكُلْ فَإِنَّمَا سَمَّيْتَ عَلَى كَلْبِكَ وَلَمْ تُسَمِّ عَلَى غَيْرِهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 4274,
			"arabicnumber": 4274,
			"text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا يَزِيدُ، - وَهُوَ ابْنُ هَارُونَ - أَنْبَأَنَا زَكَرِيَّا، وَعَاصِمٌ، عَنِ الشَّعْبِيِّ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ صَيْدِ الْمِعْرَاضِ فَقَالَ ‏\"‏ مَا أَصَابَ بِحَدِّهِ فَكُلْ وَمَا أَصَابَ بِعَرْضِهِ فَهُوَ وَقِيذٌ ‏\"‏ ‏.‏ قَالَ وَسَأَلْتُهُ عَنْ كَلْبِ الصَّيْدِ فَقَالَ ‏\"‏ إِذَا أَرْسَلْتَ كَلْبَكَ وَذَكَرْتَ اسْمَ اللَّهِ عَلَيْهِ فَكُلْ ‏\"‏ ‏.‏ قُلْتُ وَإِنْ قَتَلَ قَالَ ‏\"‏ وَإِنْ قَتَلَ فَإِنْ أَكَلَ مِنْهُ فَلاَ تَأْكُلْ وَإِنْ وَجَدْتَ مَعَهُ كَلْبًا غَيْرَ كَلْبِكَ وَقَدْ قَتَلَهُ فَلاَ تَأْكُلْ فَإِنَّكَ إِنَّمَا ذَكَرْتَ اسْمَ اللَّهِ عَزَّ وَجَلَّ عَلَى كَلْبِكَ وَلَمْ تَذْكُرْ عَلَى غَيْرِهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 4275,
			"arabicnumber": 4275,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ يَحْيَى بْنِ الْحَارِثِ، قَالَ حَدَّثَنَا أَحْمَدُ بْنُ أَبِي شُعَيْبٍ، قَالَ حَدَّثَنَا مُوسَى بْنُ أَعْيَنَ، عَنْ مَعْمَرٍ، عَنْ عَاصِمِ بْنِ سُلَيْمَانَ، عَنِ الشَّعْبِيِّ، عَنْ عَدِيِّ بْنِ حَاتِمٍ الطَّائِيِّ، أَنَّهُ سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الصَّيْدِ قَالَ ‏ \"‏ إِذَا أَرْسَلْتَ كَلْبَكَ فَذَكَرْتَ اسْمَ اللَّهِ عَلَيْهِ فَقَتَلَ وَلَمْ يَأْكُلْ فَكُلْ وَإِنْ أَكَلَ مِنْهُ فَلاَ تَأْكُلْ فَإِنَّمَا أَمْسَكَهُ عَلَيْهِ وَلَمْ يُمْسِكْ عَلَيْكَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 4276,
			"arabicnumber": 4276,
			"text": "أَخْبَرَنَا كَثِيرُ بْنُ عُبَيْدٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ، عَنِ الزُّبَيْدِيِّ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي ابْنُ السَّبَّاقِ، قَالَ أَخْبَرَتْنِي مَيْمُونَةُ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ لَهُ جِبْرِيلُ عَلَيْهِ السَّلاَمُ لَكِنَّا لاَ نَدْخُلُ بَيْتًا فِيهِ كَلْبٌ وَلاَ صُورَةٌ ‏.‏ فَأَصْبَحَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمَئِذٍ فَأَمَرَ بِقَتْلِ الْكِلاَبِ حَتَّى إِنَّهُ لَيَأْمُرُ بِقَتْلِ الْكَلْبِ الصَّغِيرِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 4277,
			"arabicnumber": 4277,
			"text": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَمَرَ بِقَتْلِ الْكِلاَبِ غَيْرَ مَا اسْتَثْنَى مِنْهَا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 4278,
			"arabicnumber": 4278,
			"text": "أَخْبَرَنَا وَهْبُ بْنُ بَيَانٍ، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، قَالَ قَالَ ابْنُ شِهَابٍ حَدَّثَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم رَافِعًا صَوْتَهُ يَأْمُرُ بِقَتْلِ الْكِلاَبِ فَكَانَتِ الْكِلاَبُ تُقْتَلُ إِلاَّ كَلْبَ صَيْدٍ أَوْ مَاشِيَةٍ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 4279,
			"arabicnumber": 4279,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ عَمْرٍو، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَمَرَ بِقَتْلِ الْكِلاَبِ إِلاَّ كَلْبَ صَيْدٍ أَوْ كَلْبَ مَاشِيَةٍ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 4280,
			"arabicnumber": 4280,
			"text": "أَخْبَرَنَا عِمْرَانُ بْنُ مُوسَى، قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، قَالَ حَدَّثَنَا يُونُسُ، عَنِ الْحَسَنِ، عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لَوْلاَ أَنَّ الْكِلاَبَ أُمَّةٌ مِنَ الأُمَمِ لأَمَرْتُ بِقَتْلِهَا فَاقْتُلُوا مِنْهَا الأَسْوَدَ الْبَهِيمَ وَأَيُّمَا قَوْمٍ اتَّخَذُوا كَلْبًا لَيْسَ بِكَلْبِ حَرْثٍ أَوْ صَيْدٍ أَوْ مَاشِيَةٍ فَإِنَّهُ يَنْقُصُ مِنْ أَجْرِهِ كُلَّ يَوْمٍ قِيرَاطٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 4281,
			"arabicnumber": 4281,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا مُحَمَّدٌ، وَيَحْيَى بْنُ سَعِيدٍ، قَالاَ حَدَّثَنَا شُعْبَةُ، عَنْ عَلِيِّ بْنِ مُدْرِكٍ، عَنْ أَبِي زُرْعَةَ، عَنْ عَبْدِ اللَّهِ بْنِ نُجَىٍّ، عَنْ أَبِيهِ، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ الْمَلاَئِكَةُ لاَ تَدْخُلُ بَيْتًا فِيهِ صُورَةٌ وَلاَ كَلْبٌ وَلاَ جُنُبٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 4282,
			"arabicnumber": 4282,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، وَإِسْحَاقُ بْنُ مَنْصُورٍ، عَنْ سُفْيَانَ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، عَنْ أَبِي طَلْحَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ تَدْخُلُ الْمَلاَئِكَةُ بَيْتًا فِيهِ كَلْبٌ وَلاَ صُورَةٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 4283,
			"arabicnumber": 4283,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ خَالِدِ بْنِ خَلِيٍّ، قَالَ حَدَّثَنَا بِشْرُ بْنُ شُعَيْبٍ، عَنْ أَبِيهِ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي ابْنُ السَّبَّاقِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ أَخْبَرَتْنِي مَيْمُونَةُ، زَوْجُ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَصْبَحَ يَوْمًا وَاجِمًا فَقَالَتْ لَهُ مَيْمُونَةُ أَىْ رَسُولَ اللَّهِ لَقَدِ اسْتَنْكَرْتُ هَيْئَتَكَ مُنْذُ الْيَوْمَ ‏.‏ فَقَالَ ‏\"‏ إِنَّ جِبْرِيلَ عَلَيْهِ السَّلاَمُ كَانَ وَعَدَنِي أَنْ يَلْقَانِي اللَّيْلَةَ فَلَمْ يَلْقَنِي أَمَا وَاللَّهِ مَا أَخْلَفَنِي ‏\"‏ ‏.‏ قَالَ فَظَلَّ يَوْمَهُ كَذَلِكَ ثُمَّ وَقَعَ فِي نَفْسِهِ جَرْوُ كَلْبٍ تَحْتَ نَضَدٍ لَنَا فَأَمَرَ بِهِ فَأُخْرِجَ ثُمَّ أَخَذَ بِيَدِهِ مَاءً فَنَضَحَ بِهِ مَكَانَهُ فَلَمَّا أَمْسَى لَقِيَهُ جِبْرِيلُ عَلَيْهِ السَّلاَمُ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ قَدْ كُنْتَ وَعَدْتَنِي أَنْ تَلْقَانِي الْبَارِحَةَ ‏\"‏ ‏.‏ قَالَ أَجَلْ وَلَكِنَّا لاَ نَدْخُلُ بَيْتًا فِيهِ كَلْبٌ وَلاَ صُورَةٌ قَالَ فَأَصْبَحَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ ذَلِكَ الْيَوْمِ فَأَمَرَ بِقَتْلِ الْكِلاَبِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 4284,
			"arabicnumber": 4284,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرِ بْنِ سُوَيْدٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، - وَهُوَ ابْنُ الْمُبَارَكِ - عَنْ حَنْظَلَةَ، قَالَ سَمِعْتُ سَالِمًا، يُحَدِّثُ عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنِ اقْتَنَى كَلْبًا نَقَصَ مِنْ أَجْرِهِ كُلَّ يَوْمٍ قِيرَاطَانِ إِلاَّ ضَارِيًا أَوْ صَاحِبَ مَاشِيَةٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 4285,
			"arabicnumber": 4285,
			"text": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرِ بْنِ إِيَاسِ بْنِ مُقَاتِلِ بْنِ مُشَمْرِجِ بْنِ خَالِدٍ السَّعْدِيُّ، عَنْ إِسْمَاعِيلَ، - وَهُوَ ابْنُ جَعْفَرٍ - عَنْ يَزِيدَ، - وَهُوَ ابْنُ خُصَيْفَةَ - قَالَ أَخْبَرَنِي السَّائِبُ بْنُ يَزِيدَ، أَنَّهُ وَفَدَ عَلَيْهِمْ سُفْيَانُ بْنُ أَبِي زُهَيْرٍ الشَّنَائِيُّ وَقَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنِ اقْتَنَى كَلْبًا لاَ يُغْنِي عَنْهُ زَرْعًا وَلاَ ضَرْعًا نَقَصَ مِنْ عَمَلِهِ كُلَّ يَوْمٍ قِيرَاطٌ ‏\"‏ ‏.‏ قُلْتُ يَا سُفْيَانُ أَنْتَ سَمِعْتَ هَذَا مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ نَعَمْ وَرَبِّ هَذَا الْمَسْجِدِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 4286,
			"arabicnumber": 4286,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّهُ سَمِعَهُ يَقُولُ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ أَمْسَكَ كَلْبًا إِلاَّ كَلْبًا ضَارِيًا أَوْ كَلْبَ مَاشِيَةٍ نَقَصَ مِنْ أَجْرِهِ كُلَّ يَوْمٍ قِيرَاطَانِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 4287,
			"arabicnumber": 4287,
			"text": "أَخْبَرَنَا عَبْدُ الْجَبَّارِ بْنُ الْعَلاَءِ، عَنْ سُفْيَانَ، قَالَ حَدَّثَنَا الزُّهْرِيُّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنِ اقْتَنَى كَلْبًا إِلاَّ كَلْبَ صَيْدٍ أَوْ مَاشِيَةٍ نَقَصَ مِنْ أَجْرِهِ كُلَّ يَوْمٍ قِيرَاطَانِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 4288,
			"arabicnumber": 4288,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا يَحْيَى، وَابْنُ أَبِي عَدِيٍّ، وَمُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ عَوْفٍ، عَنِ الْحَسَنِ، عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنِ اتَّخَذَ كَلْبًا إِلاَّ كَلْبَ صَيْدٍ أَوْ مَاشِيَةٍ أَوْ زَرْعٍ نَقَصَ مِنْ أَجْرِهِ كُلَّ يَوْمٍ قِيرَاطٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 4289,
			"arabicnumber": 4289,
			"text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ، قَالَ حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنِ اتَّخَذَ كَلْبًا إِلاَّ كَلْبَ صَيْدٍ أَوْ زَرْعٍ أَوْ مَاشِيَةٍ نَقَصَ مِنْ عَمَلِهِ كُلَّ يَوْمٍ قِيرَاطٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 4290,
			"arabicnumber": 4290,
			"text": "أَخْبَرَنَا وَهْبُ بْنُ بَيَانٍ، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، قَالَ أَنْبَأَنَا ابْنُ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنِ اقْتَنَى كَلْبًا لَيْسَ بِكَلْبِ صَيْدٍ وَلاَ مَاشِيَةٍ وَلاَ أَرْضٍ فَإِنَّهُ يَنْقُصُ مِنْ أَجْرِهِ قِيرَاطَانِ كُلَّ يَوْمٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 4291,
			"arabicnumber": 4291,
			"text": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، - يَعْنِي ابْنَ جَعْفَرٍ - قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي حَرْمَلَةَ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنِ اقْتَنَى كَلْبًا إِلاَّ كَلْبَ مَاشِيَةٍ أَوْ كَلْبَ صَيْدٍ نَقَصَ مِنْ عَمَلِهِ كُلَّ يَوْمٍ قِيرَاطٌ ‏\"‏ ‏.‏ قَالَ عَبْدُ اللَّهِ وَقَالَ أَبُو هُرَيْرَةَ ‏\"‏ أَوْ كَلْبَ حَرْثٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 4292,
			"arabicnumber": 4292,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، أَنَّهُ سَمِعَ أَبَا مَسْعُودٍ، عُقْبَةَ قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ ثَمَنِ الْكَلْبِ وَمَهْرِ الْبَغِيِّ وَحُلْوَانِ الْكَاهِنِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 4293,
			"arabicnumber": 4293,
			"text": "أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَنْبَأَنَا مَعْرُوفُ بْنُ سُوَيْدٍ الْجُذَامِيُّ، أَنَّ عُلَىَّ بْنَ رَبَاحٍ اللَّخْمِيَّ، حَدَّثَهُ أَنَّهُ، سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لاَ يَحِلُّ ثَمَنُ الْكَلْبِ وَلاَ حُلْوَانُ الْكَاهِنِ وَلاَ مَهْرُ الْبَغِيِّ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 4294,
			"arabicnumber": 4294,
			"text": "أَخْبَرَنَا شُعَيْبُ بْنُ يُوسُفَ، عَنْ يَحْيَى، عَنْ مُحَمَّدِ بْنِ يُوسُفَ، عَنِ السَّائِبِ بْنِ يَزِيدَ، عَنْ رَافِعِ بْنِ خَدِيجٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ شَرُّ الْكَسْبِ مَهْرُ الْبَغِيِّ وَثَمَنُ الْكَلْبِ وَكَسْبُ الْحَجَّامِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 4295,
			"arabicnumber": 4295,
			"text": "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ الْحَسَنِ الْمِقْسَمِيُّ، قَالَ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، عَنْ حَمَّادِ بْنِ سَلَمَةَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ ثَمَنِ السِّنَّوْرِ وَالْكَلْبِ إِلاَّ كَلْبَ صَيْدٍ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ وَحَدِيثُ حَجَّاجٍ عَنْ حَمَّادِ بْنِ سَلَمَةَ لَيْسَ هُوَ بِصَحِيحٍ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 4296,
			"arabicnumber": 4296,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا ابْنُ سَوَاءٍ، قَالَ حَدَّثَنَا سَعِيدٌ، عَنْ أَبِي مَالِكٍ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ رَجُلاً، أَتَى النَّبِيَّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ لِي كِلاَبًا مُكَلَّبَةً فَأَفْتِنِي فِيهَا ‏.‏ قَالَ ‏\"‏ مَا أَمْسَكَ عَلَيْكَ كِلاَبُكَ فَكُلْ ‏\"‏ ‏.‏ قُلْتُ وَإِنْ قَتَلْنَ قَالَ ‏\"‏ وَإِنْ قَتَلْنَ ‏\"‏ ‏.‏ قَالَ أَفْتِنِي فِي قَوْسِي ‏.‏ قَالَ ‏\"‏ مَا رَدَّ عَلَيْكَ سَهْمُكَ فَكُلْ ‏\"‏ ‏.‏ قَالَ وَإِنْ تَغَيَّبَ عَلَىَّ قَالَ ‏\"‏ وَإِنْ تَغَيَّبَ عَلَيْكَ مَا لَمْ تَجِدْ فِيهِ أَثَرَ سَهْمٍ غَيْرَ سَهْمِكَ أَوْ تَجِدْهُ قَدْ صَلَّ ‏\"‏ ‏.‏ يَعْنِي قَدْ أَنْتَنَ ‏.‏ قَالَ ابْنُ سَوَاءٍ وَسَمِعْتُهُ مِنْ أَبِي مَالِكٍ عُبَيْدِ اللَّهِ بْنِ الأَخْنَسِ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 4297,
			"arabicnumber": 4297,
			"text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ، عَنْ زَائِدَةَ، عَنْ سَعِيدِ بْنِ مَسْرُوقٍ، عَنْ عَبَايَةَ بْنِ رِفَاعَةَ بْنِ رَافِعٍ، عَنْ رَافِعِ بْنِ خَدِيجٍ، قَالَ بَيْنَمَا نَحْنُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي ذِي الْحُلَيْفَةِ مِنْ تِهَامَةَ فَأَصَابُوا إِبِلاً وَغَنَمًا وَرَسُولُ اللَّهِ صلى الله عليه وسلم فِي أُخْرَيَاتِ الْقَوْمِ فَعَجَّلَ أَوَّلُهُمْ فَذَبَحُوا وَنَصَبُوا الْقُدُورَ فَدُفِعَ إِلَيْهِمْ رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَمَرَ بِالْقُدُورِ فَأُكْفِئَتْ ثُمَّ قَسَّمَ بَيْنَهُمْ فَعَدَلَ عَشْرًا مِنَ الشَّاءِ بِبَعِيرٍ فَبَيْنَمَا هُمْ كَذَلِكَ إِذْ نَدَّ بَعِيرٌ وَلَيْسَ فِي الْقَوْمِ إِلاَّ خَيْلٌ يَسِيرَةٌ فَطَلَبُوهُ فَأَعْيَاهُمْ فَرَمَاهُ رَجُلٌ بِسَهْمٍ فَحَبَسَهُ اللَّهُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّ لِهَذِهِ الْبَهَائِمِ أَوَابِدَ كَأَوَابِدِ الْوَحْشِ فَمَا غَلَبَكُمْ مِنْهَا فَاصْنَعُوا بِهِ هَكَذَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 4298,
			"arabicnumber": 4298,
			"text": "أَخْبَرَنَا أَحْمَدُ بْنُ مَنِيعٍ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، قَالَ أَخْبَرَنِي عَاصِمٌ الأَحْوَلُ، عَنِ الشَّعْبِيِّ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الصَّيْدِ فَقَالَ ‏ \"‏ إِذَا رَمَيْتَ سَهْمَكَ فَاذْكُرِ اسْمَ اللَّهِ عَزَّ وَجَلَّ فَإِنْ وَجَدْتَهُ قَدْ قُتِلَ فَكُلْ إِلاَّ أَنْ تَجِدَهُ قَدْ وَقَعَ فِي مَاءٍ وَلاَ تَدْرِي الْمَاءُ قَتَلَهُ أَوْ سَهْمُكَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 4299,
			"arabicnumber": 4299,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ يَحْيَى بْنِ الْحَارِثِ، قَالَ حَدَّثَنَا أَحْمَدُ بْنُ أَبِي شُعَيْبٍ، قَالَ حَدَّثَنَا مُوسَى بْنُ أَعْيَنَ، عَنْ مَعْمَرٍ، عَنْ عَاصِمِ بْنِ سُلَيْمَانَ، عَنْ عَامِرٍ الشَّعْبِيِّ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، أَنَّهُ سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الصَّيْدِ فَقَالَ ‏\"‏ إِذَا أَرْسَلْتَ سَهْمَكَ وَكَلْبَكَ وَذَكَرْتَ اسْمَ اللَّهِ فَقَتَلَ سَهْمُكَ فَكُلْ ‏\"‏ ‏.‏ قَالَ فَإِنْ بَاتَ عَنِّي لَيْلَةً يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ إِنْ وَجَدْتَ سَهْمَكَ وَلَمْ تَجِدْ فِيهِ أَثَرَ شَىْءٍ غَيْرَهُ فَكُلْ وَإِنْ وَقَعَ فِي الْمَاءِ فَلاَ تَأْكُلْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 4300,
			"arabicnumber": 4300,
			"text": "أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ، قَالَ حَدَّثَنَا هُشَيْمٌ، قَالَ أَنْبَأَنَا أَبُو بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ إِنَّا أَهْلُ الصَّيْدِ وَإِنَّ أَحَدَنَا يَرْمِي الصَّيْدَ فَيَغِيبُ عَنْهُ اللَّيْلَةَ وَاللَّيْلَتَيْنِ فَيَبْتَغِي الأَثَرَ فَيَجِدُهُ مَيِّتًا وَسَهْمُهُ فِيهِ ‏.‏ قَالَ ‏ \"‏ إِذَا وَجَدْتَ السَّهْمَ فِيهِ وَلَمْ تَجِدْ فِيهِ أَثَرَ سَبُعٍ وَعَلِمْتَ أَنَّ سَهْمَكَ قَتَلَهُ فَكُلْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 4301,
			"arabicnumber": 4301,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، وَإِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالاَ حَدَّثَنَا خَالِدٌ، عَنْ شُعْبَةَ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا رَأَيْتَ سَهْمَكَ فِيهِ وَلَمْ تَرَ فِيهِ أَثَرًا غَيْرَهُ وَعَلِمْتَ أَنَّهُ قَتَلَهُ فَكُلْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 4302,
			"arabicnumber": 4302,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الْمَلِكِ بْنِ مَيْسَرَةَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ أَرْمِي الصَّيْدَ فَأَطْلُبُ أَثَرَهُ بَعْدَ لَيْلَةٍ ‏.‏ قَالَ ‏ \"‏ إِذَا وَجَدْتَ فِيهِ سَهْمَكَ وَلَمْ يَأْكُلْ مِنْهُ سَبُعٌ فَكُلْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 4303,
			"arabicnumber": 4303,
			"text": "أَخْبَرَنِي أَحْمَدُ بْنُ خَالِدٍ الْخَلاَّلُ، قَالَ حَدَّثَنَا مَعْنٌ، قَالَ أَنْبَأَنَا مُعَاوِيَةُ، - وَهُوَ ابْنُ صَالِحٍ - عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرِ بْنِ نُفَيْرٍ، عَنْ أَبِيهِ، عَنْ أَبِي ثَعْلَبَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم فِي الَّذِي يُدْرِكُ صَيْدَهُ بَعْدَ ثَلاَثٍ فَلْيَأْكُلْهُ إِلاَّ أَنْ يُنْتِنَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 4304,
			"arabicnumber": 4304,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا خَالِدٌ، عَنْ شُعْبَةَ، عَنْ سِمَاكٍ، قَالَ سَمِعْتُ مُرِّيَّ بْنَ قَطَرِيٍّ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ أُرْسِلُ كَلْبِي فَيَأْخُذُ الصَّيْدَ وَلاَ أَجِدُ مَا أُذَكِّيهِ بِهِ فَأُذَكِّيهِ بِالْمَرْوَةِ وَالْعَصَا ‏.‏ قَالَ ‏ \"‏ أَهْرِقِ الدَّمَ بِمَا شِئْتَ وَاذْكُرِ اسْمَ اللَّهِ عَزَّ وَجَلَّ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 4305,
			"arabicnumber": 4305,
			"text": "أَخْبَرَنِي مُحَمَّدُ بْنُ قُدَامَةَ، عَنْ جَرِيرٍ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ هَمَّامٍ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ إِنِّي أُرْسِلُ الْكِلاَبَ الْمُعَلَّمَةَ فَتُمْسِكُ عَلَىَّ فَآكُلُ مِنْهُ قَالَ ‏\"‏ إِذَا أَرْسَلْتَ الْكِلاَبَ - يَعْنِي الْمُعَلَّمَةَ - وَذَكَرْتَ اسْمَ اللَّهِ فَأَمْسَكْنَ عَلَيْكَ فَكُلْ ‏\"‏ ‏.‏ قُلْتُ وَإِنْ قَتَلْنَ قَالَ ‏\"‏ وَإِنْ قَتَلْنَ مَا لَمْ يَشْرَكْهَا كَلْبٌ لَيْسَ مِنْهَا ‏\"‏ ‏.‏ قُلْتُ وَإِنِّي أَرْمِي الصَّيْدَ بِالْمِعْرَاضِ فَأُصِيبُ فَآكُلُ قَالَ ‏\"‏ إِذَا رَمَيْتَ بِالْمِعْرَاضِ وَسَمَّيْتَ فَخَزَقَ فَكُلْ وَإِذَا أَصَابَ بِعَرْضِهِ فَلاَ تَأْكُلْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 4306,
			"arabicnumber": 4306,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي السَّفَرِ، عَنِ الشَّعْبِيِّ، قَالَ سَمِعْتُ عَدِيَّ بْنَ حَاتِمٍ، قَالَ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الْمِعْرَاضِ فَقَالَ ‏ \"‏ إِذَا أَصَابَ بِحَدِّهِ فَكُلْ وَإِذَا أَصَابَ بِعَرْضِهِ فَقُتِلَ فَإِنَّهُ وَقِيذٌ فَلاَ تَأْكُلْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 4307,
			"arabicnumber": 4307,
			"text": "أَخْبَرَنَا الْحُسَيْنُ بْنُ مُحَمَّدٍ الذَّارِعُ، قَالَ حَدَّثَنَا أَبُو مِحْصَنٍ، قَالَ حَدَّثَنَا حُصَيْنٌ، عَنِ الشَّعْبِيِّ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ صَيْدِ الْمِعْرَاضِ فَقَالَ ‏ \"‏ إِذَا أَصَابَ بِحَدِّهِ فَكُلْ وَإِذَا أَصَابَ بِعَرْضِهِ فَلاَ تَأْكُلْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 4308,
			"arabicnumber": 4308,
			"text": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ أَنْبَأَنَا عِيسَى بْنُ يُونُسَ، وَغَيْرُهُ، عَنْ زَكَرِيَّا، عَنِ الشَّعْبِيِّ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ صَيْدِ الْمِعْرَاضِ فَقَالَ ‏ \"‏ مَا أَصَبْتَ بِحَدِّهِ فَكُلْ وَمَا أَصَابَ بِعَرْضِهِ فَهُوَ وَقِيذٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 4309,
			"arabicnumber": 4309,
			"text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا عَبْدُ الرَّحْمَنِ، عَنْ سُفْيَانَ، عَنْ أَبِي مُوسَى، ح وَأَنْبَأَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، عَنْ عَبْدِ الرَّحْمَنِ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي مُوسَى، عَنْ وَهْبِ بْنِ مُنَبِّهٍ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ سَكَنَ الْبَادِيَةَ جَفَا وَمَنِ اتَّبَعَ الصَّيْدَ غَفُلَ وَمَنِ اتَّبَعَ السُّلْطَانَ افْتُتِنَ ‏\"‏ ‏.‏ وَاللَّفْظُ لاِبْنِ الْمُثَنَّى ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 4310,
			"arabicnumber": 4310,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَعْمَرٍ الْبَحْرَانِيُّ، قَالَ حَدَّثَنَا حَبَّانُ، - وَهُوَ ابْنُ هِلاَلٍ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ مُوسَى بْنِ طَلْحَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ جَاءَ أَعْرَابِيٌّ إِلَى النَّبِيِّ صلى الله عليه وسلم بِأَرْنَبٍ قَدْ شَوَاهَا فَوَضَعَهَا بَيْنَ يَدَيْهِ فَأَمْسَكَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَلَمْ يَأْكُلْ وَأَمَرَ الْقَوْمَ أَنْ يَأْكُلُوا وَأَمْسَكَ الأَعْرَابِيُّ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا يَمْنَعُكَ أَنْ تَأْكُلَ ‏\"‏ ‏.‏ قَالَ إِنِّي أَصُومُ ثَلاَثَةَ أَيَّامٍ مِنْ كُلِّ شَهْرٍ ‏.‏ قَالَ ‏\"‏ إِنْ كُنْتَ صَائِمًا فَصُمِ الْغُرَّ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 4311,
			"arabicnumber": 4311,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ حَكِيمِ بْنِ جُبَيْرٍ، وَعَمْرِو بْنِ عُثْمَانَ، وَمُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ مُوسَى بْنِ طَلْحَةَ، عَنِ ابْنِ الْحَوْتَكِيَّةِ، قَالَ قَالَ عُمَرُ رضى الله عنه مَنْ حَاضِرُنَا يَوْمَ الْقَاحَةِ قَالَ قَالَ أَبُو ذَرٍّ أَنَا أُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِأَرْنَبٍ فَقَالَ الرَّجُلُ الَّذِي جَاءَ بِهَا إِنِّي رَأَيْتُهَا تَدْمَى ‏.‏ فَكَانَ النَّبِيُّ صلى الله عليه وسلم لَمْ يَأْكُلْ ثُمَّ إِنَّهُ قَالَ ‏\"‏ كُلُوا ‏\"‏ ‏.‏ فَقَالَ رَجُلٌ إِنِّي صَائِمٌ ‏.‏ قَالَ ‏\"‏ وَمَا صَوْمُكَ ‏\"‏ ‏.‏ قَالَ مِنْ كُلِّ شَهْرٍ ثَلاَثَةُ أَيَّامٍ ‏.‏ قَالَ ‏\"‏ فَأَيْنَ أَنْتَ عَنِ الْبِيضِ الْغُرِّ ثَلاَثَ عَشْرَةَ وَأَرْبَعَ عَشْرَةَ وَخَمْسَ عَشْرَةَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 4312,
			"arabicnumber": 4312,
			"text": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا خَالِدٌ، عَنْ شُعْبَةَ، عَنْ هِشَامٍ، - وَهُوَ ابْنُ زَيْدٍ - قَالَ سَمِعْتُ أَنَسًا، يَقُولُ أَنْفَجْنَا أَرْنَبًا بِمَرِّ الظَّهْرَانِ فَأَخَذْتُهَا فَجِئْتُ بِهَا إِلَى أَبِي طَلْحَةَ فَذَبَحَهَا فَبَعَثَنِي بِفَخِذَيْهَا وَوَرِكَيْهَا إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَبِلَهُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 4313,
			"arabicnumber": 4313,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا حَفْصٌ، عَنْ عَاصِمٍ، وَدَاوُدَ، عَنِ الشَّعْبِيِّ، عَنِ ابْنِ صَفْوَانَ، قَالَ أَصَبْتُ أَرْنَبَيْنِ فَلَمْ أَجِدْ مَا أُذَكِّيهِمَا بِهِ فَذَكَّيْتُهُمَا بِمَرْوَةٍ فَسَأَلْتُ النَّبِيَّ صلى الله عليه وسلم عَنْ ذَلِكَ فَأَمَرَنِي بِأَكْلِهِمَا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 4314,
			"arabicnumber": 4314,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم وَهُوَ عَلَى الْمِنْبَرِ سُئِلَ عَنِ الضَّبِّ فَقَالَ ‏ \"‏ لاَ آكُلُهُ وَلاَ أُحَرِّمُهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 4315,
			"arabicnumber": 4315,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ نَافِعٍ، وَعَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَجُلاً، قَالَ يَا رَسُولَ اللَّهِ مَا تَرَى فِي الضَّبِّ قَالَ ‏ \"‏ لَسْتُ بِآكِلِهِ وَلاَ مُحَرِّمِهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 4316,
			"arabicnumber": 4316,
			"text": "أَخْبَرَنَا كَثِيرُ بْنُ عُبَيْدٍ، عَنْ مُحَمَّدِ بْنِ حَرْبٍ، عَنِ الزُّبَيْدِيِّ، قَالَ أَخْبَرَنِي الزُّهْرِيُّ، عَنْ أَبِي أُمَامَةَ بْنِ سَهْلٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، عَنْ خَالِدِ بْنِ الْوَلِيدِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أُتِيَ بِضَبٍّ مَشْوِيٍّ فَقُرِّبَ إِلَيْهِ فَأَهْوَى إِلَيْهِ بِيَدِهِ لِيَأْكُلَ مِنْهُ قَالَ لَهُ مَنْ حَضَرَ يَا رَسُولَ اللَّهِ إِنَّهُ لَحْمُ ضَبٍّ ‏.‏ فَرَفَعَ يَدَهُ عَنْهُ فَقَالَ لَهُ خَالِدُ بْنُ الْوَلِيدِ يَا رَسُولَ اللَّهِ أَحَرَامٌ الضَّبُّ قَالَ ‏ \"‏ لاَ وَلَكِنْ لَمْ يَكُنْ بِأَرْضِ قَوْمِي فَأَجِدُنِي أَعَافُهُ ‏\"‏ ‏.‏ فَأَهْوَى خَالِدٌ إِلَى الضَّبِّ فَأَكَلَ مِنْهُ وَرَسُولُ اللَّهِ صلى الله عليه وسلم يَنْظُرُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 4317,
			"arabicnumber": 4317,
			"text": "أَخْبَرَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي أُمَامَةَ بْنِ سَهْلٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ أَخْبَرَهُ أَنَّ خَالِدَ بْنَ الْوَلِيدِ أَخْبَرَهُ أَنَّهُ، دَخَلَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم عَلَى مَيْمُونَةَ بِنْتِ الْحَارِثِ - وَهِيَ خَالَتُهُ - فَقُدِّمَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم لَحْمُ ضَبٍّ - وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم لاَ يَأْكُلُ شَيْئًا حَتَّى يَعْلَمَ مَا هُوَ - فَقَالَ بَعْضُ النِّسْوَةِ أَلاَ تُخْبِرْنَ رَسُولَ اللَّهِ صلى الله عليه وسلم مَا يَأْكُلُ فَأَخْبَرَتْهُ أَنَّهُ لَحْمُ ضَبٍّ فَتَرَكَهُ قَالَ خَالِدٌ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم أَحَرَامٌ هُوَ قَالَ ‏ \"‏ لاَ وَلَكِنَّهُ طَعَامٌ لَيْسَ فِي أَرْضِ قَوْمِي فَأَجِدُنِي أَعَافُهُ ‏\"‏ ‏.‏ قَالَ خَالِدٌ فَاجْتَرَرْتُهُ إِلَىَّ فَأَكَلْتُهُ وَرَسُولُ اللَّهِ صلى الله عليه وسلم يَنْظُرُ ‏.‏ وَحَدَّثَهُ ابْنُ الأَصَمِّ عَنْ مَيْمُونَةَ وَكَانَ فِي حَجْرِهَا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 4318,
			"arabicnumber": 4318,
			"text": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ أَهْدَتْ خَالَتِي إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم أَقِطًا وَسَمْنًا وَأَضُبًّا فَأَكَلَ مِنَ الأَقِطِ وَالسَّمْنِ وَتَرَكَ الأَضُبَّ تَقَذُّرًا وَأُكِلَ عَلَى مَائِدَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَلَوْ كَانَ حَرَامًا مَا أُكِلَ عَلَى مَائِدَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 4319,
			"arabicnumber": 4319,
			"text": "أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ، قَالَ حَدَّثَنَا هُشَيْمٌ، قَالَ أَنْبَأَنَا أَبُو بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ سُئِلَ عَنْ أَكْلِ الضِّبَابِ، فَقَالَ أَهْدَتْ أُمُّ حُفَيْدٍ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم سَمْنًا وَأَقِطًا وَأَضُبًّا فَأَكَلَ مِنَ السَّمْنِ وَالأَقِطِ وَتَرَكَ الضِّبَابَ تَقَذُّرًا لَهُنَّ فَلَوْ كَانَ حَرَامًا مَا أُكِلَ عَلَى مَائِدَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَلاَ أَمَرَ بِأَكْلِهِنَّ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 4320,
			"arabicnumber": 4320,
			"text": "أَخْبَرَنَا سُلَيْمَانُ بْنُ مَنْصُورٍ الْبَلْخِيُّ، قَالَ حَدَّثَنَا أَبُو الأَحْوَصِ، سَلاَّمُ بْنُ سُلَيْمٍ عَنْ حُصَيْنٍ، عَنْ زَيْدِ بْنِ وَهْبٍ، عَنْ ثَابِتِ بْنِ يَزِيدَ الأَنْصَارِيِّ، قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي سَفَرٍ فَنَزَلْنَا مَنْزِلاً فَأَصَابَ النَّاسُ ضِبَابًا فَأَخَذْتُ ضَبًّا فَشَوَيْتُهُ ثُمَّ أَتَيْتُ بِهِ النَّبِيَّ صلى الله عليه وسلم فَأَخَذَ عُودًا يَعُدُّ بِهِ أَصَابِعَهُ ثُمَّ قَالَ ‏ \"‏ إِنَّ أُمَّةً مِنْ بَنِي إِسْرَائِيلَ مُسِخَتْ دَوَابَّ فِي الأَرْضِ وَإِنِّي لاَ أَدْرِي أَىُّ الدَّوَابِّ هِيَ ‏\"‏ ‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ إِنَّ النَّاسَ قَدْ أَكَلُوا مِنْهَا - قَالَ - فَمَا أَمَرَ بِأَكْلِهَا وَلاَ نَهَى ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 4321,
			"arabicnumber": 4321,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ يَزِيدَ، قَالَ حَدَّثَنَا بَهْزُ بْنُ أَسَدٍ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنِي عَدِيُّ بْنُ ثَابِتٍ، قَالَ سَمِعْتُ زَيْدَ بْنَ وَهْبٍ، يُحَدِّثُ عَنْ ثَابِتِ بْنِ وَدِيعَةَ، قَالَ جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم بِضَبٍّ فَجَعَلَ يَنْظُرُ إِلَيْهِ وَيُقَلِّبُهُ وَقَالَ ‏ \"‏ إِنَّ أُمَّةً مُسِخَتْ لاَ يُدْرَى مَا فَعَلَتْ وَإِنِّي لاَ أَدْرِي لَعَلَّ هَذَا مِنْهَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 4322,
			"arabicnumber": 4322,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ زَيْدِ بْنِ وَهْبٍ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، عَنْ ثَابِتِ بْنِ وَدِيعَةَ، أَنَّ رَجُلاً، أَتَى النَّبِيَّ صلى الله عليه وسلم بِضَبٍّ فَقَالَ ‏ \"‏ إِنَّ أُمَّةً مُسِخَتْ وَاللَّهُ أَعْلَمُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 4323,
			"arabicnumber": 4323,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنِي ابْنُ جُرَيْجٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُبَيْدِ بْنِ عُمَيْرٍ، عَنِ ابْنِ أَبِي عَمَّارٍ، قَالَ سَأَلْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ عَنِ الضَّبُعِ، فَأَمَرَنِي بِأَكْلِهَا فَقُلْتُ أَصَيْدٌ هِيَ قَالَ نَعَمْ ‏.‏ قُلْتُ أَسَمِعْتَهُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ نَعَمْ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 4324,
			"arabicnumber": 4324,
			"text": "أَخْبَرَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا مَالِكٌ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي حَكِيمٍ، عَنْ عَبِيدَةَ بْنِ سُفْيَانَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ كُلُّ ذِي نَابٍ مِنَ السِّبَاعِ فَأَكْلُهُ حَرَامٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 4325,
			"arabicnumber": 4325,
			"text": "أَخْبَرَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، عَنْ سُفْيَانَ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي إِدْرِيسَ، عَنْ أَبِي ثَعْلَبَةَ الْخُشَنِيِّ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنْ أَكْلِ كُلِّ ذِي نَابٍ مِنَ السِّبَاعِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 4326,
			"arabicnumber": 4326,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ، قَالَ حَدَّثَنَا بَقِيَّةُ، عَنْ بَحِيرٍ، عَنْ خَالِدٍ، عَنْ جُبَيْرِ بْنِ نُفَيْرٍ، عَنْ أَبِي ثَعْلَبَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ تَحِلُّ النُّهْبَى وَلاَ يَحِلُّ مِنَ السِّبَاعِ كُلُّ ذِي نَابٍ وَلاَ تَحِلُّ الْمُجْثَّمَةُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 4327,
			"arabicnumber": 4327,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، وَأَحْمَدُ بْنُ عَبْدَةَ، قَالاَ حَدَّثَنَا حَمَّادٌ، عَنْ عَمْرٍو، - وَهُوَ ابْنُ دِينَارٍ - عَنْ مُحَمَّدِ بْنِ عَلِيٍّ، عَنْ جَابِرٍ، قَالَ نَهَى - وَذَكَرَ رَسُولَ اللَّهِ صلى الله عليه وسلم - يَوْمَ خَيْبَرَ عَنْ لُحُومِ الْحُمُرِ وَأَذِنَ فِي الْخَيْلِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 4328,
			"arabicnumber": 4328,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ جَابِرٍ، قَالَ أَطْعَمَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم لُحُومَ الْخَيْلِ وَنَهَانَا عَنْ لُحُومِ الْحُمُرِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 4329,
			"arabicnumber": 4329,
			"text": "أَخْبَرَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ، قَالَ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى، عَنِ الْحُسَيْنِ، - وَهُوَ ابْنُ وَاقِدٍ - عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، وَعَمْرِو بْنِ دِينَارٍ، عَنْ جَابِرٍ، وَعَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، قَالَ أَطْعَمَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمَ خَيْبَرَ لُحُومَ الْخَيْلِ وَنَهَانَا عَنْ لُحُومِ الْحُمُرِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 4330,
			"arabicnumber": 4330,
			"text": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ، - وَهُوَ ابْنُ عَمْرٍو - قَالَ حَدَّثَنَا عَبْدُ الْكَرِيمِ، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، قَالَ كُنَّا نَأْكُلُ لُحُومَ الْخَيْلِ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 4331,
			"arabicnumber": 4331,
			"text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا بَقِيَّةُ بْنُ الْوَلِيدِ، قَالَ حَدَّثَنِي ثَوْرُ بْنُ يَزِيدَ، عَنْ صَالِحِ بْنِ يَحْيَى بْنِ الْمِقْدَامِ بْنِ مَعْدِيكَرِبَ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، عَنْ خَالِدِ بْنِ الْوَلِيدِ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ لاَ يَحِلُّ أَكْلُ لُحُومِ الْخَيْلِ وَالْبِغَالِ وَالْحَمِيرِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 4332,
			"arabicnumber": 4332,
			"text": "أَخْبَرَنَا كَثِيرُ بْنُ عُبَيْدٍ، قَالَ حَدَّثَنَا بَقِيَّةُ، عَنْ ثَوْرِ بْنِ يَزِيدَ، عَنْ صَالِحِ بْنِ يَحْيَى بْنِ الْمِقْدَامِ بْنِ مَعْدِيكَرِبَ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، عَنْ خَالِدِ بْنِ الْوَلِيدِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ أَكْلِ لُحُومِ الْخَيْلِ وَالْبِغَالِ وَالْحَمِيرِ وَكُلِّ ذِي نَابٍ مِنَ السِّبَاعِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 4333,
			"arabicnumber": 4333,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، عَنْ عَبْدِ الرَّحْمَنِ، عَنْ سُفْيَانَ، عَنْ عَبْدِ الْكَرِيمِ، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، قَالَ كُنَّا نَأْكُلُ لُحُومَ الْخَيْلِ ‏.‏ قُلْتُ الْبِغَالَ قَالَ لاَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 4334,
			"arabicnumber": 4334,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، وَالْحَارِثُ بْنُ مِسْكِينٍ، قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، - وَاللَّفْظُ لَهُ - عَنْ سُفْيَانَ، عَنِ الزُّهْرِيِّ، عَنِ الْحَسَنِ بْنِ مُحَمَّدٍ، وَعَبْدِ اللَّهِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِمَا، قَالَ قَالَ عَلِيٌّ لاِبْنِ عَبَّاسٍ رضى الله عنهما إِنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنْ نِكَاحِ الْمُتْعَةِ وَعَنْ لُحُومِ الْحُمُرِ الأَهْلِيَّةِ يَوْمَ خَيْبَرَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 4335,
			"arabicnumber": 4335,
			"text": "أَخْبَرَنَا سُلَيْمَانُ بْنُ دَاوُدَ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، وَمَالِكٌ، وَأُسَامَةُ، عَنِ ابْنِ شِهَابٍ، عَنِ الْحَسَنِ، وَعَبْدِ اللَّهِ، ابْنَىْ مُحَمَّدٍ عَنْ أَبِيهِمَا، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، رضى الله عنه قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ مُتْعَةِ النِّسَاءِ يَوْمَ خَيْبَرَ وَعَنْ لُحُومِ الْحُمُرِ الإِنْسِيَّةِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 4336,
			"arabicnumber": 4336,
			"text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا مُحَمَّدُ بْنُ بِشْرٍ، قَالَ أَنْبَأَنَا عُبَيْدُ اللَّهِ، ح وَأَنْبَأَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْحُمُرِ الأَهْلِيَّةِ يَوْمَ خَيْبَرَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 4337,
			"arabicnumber": 4337,
			"text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم مِثْلَهُ وَلَمْ يَقُلْ خَيْبَرَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "-"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 4338,
			"arabicnumber": 4338,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ حَدَّثَنَا مَعْمَرٌ، عَنْ عَاصِمٍ، عَنِ الشَّعْبِيِّ، عَنِ الْبَرَاءِ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمَ خَيْبَرَ عَنْ لُحُومِ الْحُمُرِ الإِنْسِيَّةِ نَضِيجًا وَنِيئًا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 4339,
			"arabicnumber": 4339,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ الْمُقْرِئُ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي إِسْحَاقَ الشَّيْبَانِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى، قَالَ أَصَبْنَا يَوْمَ خَيْبَرَ حُمُرًا خَارِجًا مِنَ الْقَرْيَةِ فَطَبَخْنَاهَا فَنَادَى مُنَادِي النَّبِيِّ صلى الله عليه وسلم إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ حَرَّمَ لُحُومَ الْحُمُرِ فَأَكْفِئُوا الْقُدُورَ بِمَا فِيهَا ‏.‏ فَأَكْفَأْنَاهَا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 4340,
			"arabicnumber": 4340,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ أَنَسٍ، قَالَ صَبَّحَ رَسُولُ اللَّهِ صلى الله عليه وسلم خَيْبَرَ فَخَرَجُوا إِلَيْنَا وَمَعَهُمُ الْمَسَاحِي فَلَمَّا رَأَوْنَا قَالُوا مُحَمَّدٌ وَالْخَمِيسُ ‏.‏ وَرَجَعُوا إِلَى الْحِصْنِ يَسْعَوْنَ فَرَفَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدَيْهِ ثُمَّ قَالَ ‏ \"‏ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ خَرِبَتْ خَيْبَرُ إِنَّا إِذَا نَزَلْنَا بِسَاحَةِ قَوْمٍ فَسَاءَ صَبَاحُ الْمُنْذَرِينَ ‏\"‏ ‏.‏ فَأَصَبْنَا فِيهَا حُمُرًا فَطَبَخْنَاهَا فَنَادَى مُنَادِي النَّبِيِّ صلى الله عليه وسلم فَقَالَ إِنَّ اللَّهَ عَزَّ وَجَلَّ وَرَسُولَهُ يَنْهَاكُمْ عَنْ لُحُومِ الْحُمُرِ فَإِنَّهَا رِجْسٌ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 4341,
			"arabicnumber": 4341,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ، أَنْبَأَنَا بَقِيَّةُ، عَنْ بَحِيرٍ، عَنْ خَالِدِ بْنِ مَعْدَانَ، عَنْ جُبَيْرِ بْنِ نُفَيْرٍ، عَنْ أَبِي ثَعْلَبَةَ الْخُشَنِيِّ، أَنَّهُ حَدَّثَهُمْ أَنَّهُمْ، غَزَوْا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِلَى خَيْبَرَ وَالنَّاسُ جِيَاعٌ فَوَجَدُوا فِيهَا حُمُرًا مِنْ حُمُرِ الإِنْسِ فَذَبَحَ النَّاسُ مِنْهَا فَحُدِّثَ بِذَلِكَ النَّبِيُّ صلى الله عليه وسلم فَأَمَرَ عَبْدَ الرَّحْمَنِ بْنَ عَوْفٍ فَأَذَّنَ فِي النَّاسِ ‏ \"‏ أَلاَ إِنَّ لُحُومَ الْحُمُرِ الإِنْسِ لاَ تَحِلُّ لِمَنْ يَشْهَدُ أَنِّي رَسُولُ اللَّهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 4342,
			"arabicnumber": 4342,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ، عَنْ بَقِيَّةَ، قَالَ حَدَّثَنِي الزُّبَيْدِيُّ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي إِدْرِيسَ الْخَوْلاَنِيِّ، عَنْ أَبِي ثَعْلَبَةَ الْخُشَنِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ أَكْلِ كُلِّ ذِي نَابٍ مِنَ السِّبَاعِ وَعَنْ لُحُومِ الْحُمُرِ الأَهْلِيَّةِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 4343,
			"arabicnumber": 4343,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا الْمُفَضَّلُ، - هُوَ ابْنُ فَضَالَةَ - عَنِ ابْنِ جُرَيْجٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ أَكَلْنَا يَوْمَ خَيْبَرَ لُحُومَ الْخَيْلِ وَالْوَحْشِ وَنَهَانَا النَّبِيُّ صلى الله عليه وسلم عَنِ الْحِمَارِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 4344,
			"arabicnumber": 4344,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا بَكْرٌ، - هُوَ ابْنُ مُضَرَ - عَنِ ابْنِ الْهَادِ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ عِيسَى بْنِ طَلْحَةَ، عَنْ عُمَيْرِ بْنِ سَلَمَةَ الضَّمْرِيِّ، قَالَ بَيْنَا نَحْنُ نَسِيرُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم بِبَعْضِ أَثَايَا الرَّوْحَاءِ وَهُمْ حُرُمٌ إِذَا حِمَارُ وَحْشٍ مَعْقُورٌ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ دَعُوهُ فَيُوشِكُ صَاحِبُهُ أَنْ يَأْتِيَهُ ‏\"‏ ‏.‏ فَجَاءَ رَجُلٌ مِنْ بَهْزٍ هُوَ الَّذِي عَقَرَ الْحِمَارَ فَقَالَ يَا رَسُولَ اللَّهِ شَأْنَكُمْ هَذَا الْحِمَارُ ‏.‏ فَأَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَبَا بَكْرٍ يُقَسِّمُهُ بَيْنَ النَّاسِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 4345,
			"arabicnumber": 4345,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ وَهْبٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ، قَالَ حَدَّثَنِي أَبُو عَبْدِ الرَّحِيمِ، قَالَ حَدَّثَنِي زَيْدُ بْنُ أَبِي أُنَيْسَةَ، عَنْ أَبِي حَازِمٍ، عَنِ ابْنِ أَبِي قَتَادَةَ، عَنْ أَبِيهِ أَبِي قَتَادَةَ، قَالَ أَصَابَ حِمَارًا وَحْشِيًّا فَأَتَى بِهِ أَصْحَابَهُ وَهُمْ مُحْرِمُونَ وَهُوَ حَلاَلٌ فَأَكَلْنَا مِنْهُ فَقَالَ بَعْضُهُمْ لِبَعْضٍ لَوْ سَأَلْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْهُ ‏.‏ فَسَأَلْنَاهُ فَقَالَ ‏\"‏ قَدْ أَحْسَنْتُمْ ‏\"‏ ‏.‏ فَقَالَ لَنَا ‏\"‏ هَلْ مَعَكُمْ مِنْهُ شَىْءٌ ‏\"‏ ‏.‏ قُلْنَا نَعَمْ ‏.‏ قَالَ ‏\"‏ فَاهْدُوا لَنَا ‏\"‏ ‏.‏ فَأَتَيْنَاهُ مِنْهُ فَأَكَلَ مِنْهُ وَهُوَ مُحْرِمٌ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 4346,
			"arabicnumber": 4346,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنَا أَيُّوبُ، عَنْ أَبِي قِلاَبَةَ، عَنْ زَهْدَمٍ، أَنَّ أَبَا مُوسَى، أُتِيَ بِدَجَاجَةٍ فَتَنَحَّى رَجُلٌ مِنَ الْقَوْمِ فَقَالَ مَا شَأْنُكَ قَالَ إِنِّي رَأَيْتُهَا تَأْكُلُ شَيْئًا قَذِرْتُهُ فَحَلَفْتُ أَنْ لاَ آكُلَهُ ‏.‏ فَقَالَ أَبُو مُوسَى ادْنُ فَكُلْ فَإِنِّي رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَأْكُلُهُ ‏.‏ وَأَمَرَهُ أَنْ يُكَفِّرَ عَنْ يَمِينِهِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 4347,
			"arabicnumber": 4347,
			"text": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، عَنْ أَيُّوبَ، عَنِ الْقَاسِمِ التَّمِيمِيِّ، عَنْ زَهْدَمٍ الْجَرْمِيِّ، قَالَ كُنَّا عِنْدَ أَبِي مُوسَى فَقُدِّمَ طَعَامُهُ وَقُدِّمَ فِي طَعَامِهِ لَحْمُ دَجَاجٍ وَفِي الْقَوْمِ رَجُلٌ مِنْ بَنِي تَيْمِ اللَّهِ أَحْمَرُ كَأَنَّهُ مَوْلًى فَلَمْ يَدْنُ فَقَالَ لَهُ أَبُو مُوسَى ادْنُ فَإِنِّي قَدْ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَأْكُلُ مِنْهُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 4348,
			"arabicnumber": 4348,
			"text": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، عَنْ بِشْرٍ، - هُوَ ابْنُ الْمُفَضَّلِ - قَالَ حَدَّثَنَا سَعِيدٌ، عَنْ عَلِيِّ بْنِ الْحَكَمِ، عَنْ مَيْمُونِ بْنِ مِهْرَانَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم نَهَى يَوْمَ خَيْبَرَ عَنْ كُلِّ ذِي مِخْلَبٍ مِنَ الطَّيْرِ وَعَنْ كُلِّ ذِي نَابٍ مِنَ السِّبَاعِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 4349,
			"arabicnumber": 4349,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ الْمُقْرِئُ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ صُهَيْبٍ، مَوْلَى ابْنِ عَامِرٍ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَا مِنْ إِنْسَانٍ قَتَلَ عُصْفُورًا فَمَا فَوْقَهَا بِغَيْرِ حَقِّهَا إِلاَّ سَأَلَهُ اللَّهُ عَزَّ وَجَلَّ عَنْهَا ‏\"‏ ‏.‏ قِيلَ يَا رَسُولَ اللَّهِ وَمَا حَقُّهَا قَالَ ‏\"‏ يَذْبَحُهَا فَيَأْكُلُهَا وَلاَ يَقْطَعُ رَأْسَهَا يَرْمِي بِهَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 4350,
			"arabicnumber": 4350,
			"text": "أَخْبَرَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا مَالِكٌ، عَنْ صَفْوَانَ بْنِ سُلَيْمٍ، عَنْ سَعِيدِ بْنِ سَلَمَةَ، عَنِ الْمُغِيرَةِ بْنِ أَبِي بُرْدَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم فِي مَاءِ الْبَحْرِ ‏ \"‏ هُوَ الطَّهُورُ مَاؤُهُ الْحَلاَلُ مَيْتَتُهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 4351,
			"arabicnumber": 4351,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ آدَمَ، قَالَ حَدَّثَنَا عَبْدَةُ، عَنْ هِشَامٍ، عَنْ وَهْبِ بْنِ كَيْسَانَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ بَعَثَنَا النَّبِيُّ صلى الله عليه وسلم وَنَحْنُ ثَلاَثُمِائَةٍ نَحْمِلُ زَادَنَا عَلَى رِقَابِنَا فَفَنِيَ زَادُنَا حَتَّى كَانَ يَكُونُ لِلرَّجُلِ مِنَّا كُلَّ يَوْمٍ تَمْرَةٌ ‏.‏ فَقِيلَ لَهُ يَا أَبَا عَبْدِ اللَّهِ وَأَيْنَ تَقَعُ التَّمْرَةُ مِنَ الرَّجُلِ قَالَ لَقَدْ وَجَدْنَا فَقْدَهَا حِينَ فَقَدْنَاهَا فَأَتَيْنَا الْبَحْرَ فَإِذَا بِحُوتٍ قَذَفَهُ الْبَحْرُ فَأَكَلْنَا مِنْهُ ثَمَانِيَةَ عَشَرَ يَوْمًا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 4352,
			"arabicnumber": 4352,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، عَنْ سُفْيَانَ، عَنْ عَمْرٍو، قَالَ سَمِعْتُ جَابِرًا، يَقُولُ بَعَثَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم ثَلاَثَمِائَةِ رَاكِبٍ أَمِيرُنَا أَبُو عُبَيْدَةَ بْنُ الْجَرَّاحِ نَرْصُدُ عِيرَ قُرَيْشٍ فَأَقَمْنَا بِالسَّاحِلِ فَأَصَابَنَا جُوعٌ شَدِيدٌ حَتَّى أَكَلْنَا الْخَبَطَ - قَالَ - فَأَلْقَى الْبَحْرُ دَابَّةً يُقَالُ لَهَا الْعَنْبَرُ فَأَكَلْنَا مِنْهُ نِصْفَ شَهْرٍ وَادَّهَنَّا مِنْ وَدَكِهِ فَثَابَتْ أَجْسَامُنَا وَأَخَذَ أَبُو عُبَيْدَةَ ضِلَعًا مِنْ أَضْلاَعِهِ فَنَظَرَ إِلَى أَطْوَلِ جَمَلٍ وَأَطْوَلِ رَجُلٍ فِي الْجَيْشِ فَمَرَّ تَحْتَهُ ثُمَّ جَاعُوا فَنَحَرَ رَجُلٌ ثَلاَثَ جَزَائِرَ ثُمَّ جَاعُوا فَنَحَرَ رَجُلٌ ثَلاَثَ جَزَائِرَ ثُمَّ جَاعُوا فَنَحَرَ رَجُلٌ ثَلاَثَ جَزَائِرَ ثُمَّ نَهَاهُ أَبُو عُبَيْدَةَ ‏.‏ قَالَ سُفْيَانُ قَالَ أَبُو الزُّبَيْرِ عَنْ جَابِرٍ فَسَأَلْنَا النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏ \"‏ هَلْ مَعَكُمْ مِنْهُ شَىْءٌ ‏\"‏ ‏.‏ قَالَ فَأَخْرَجْنَا مِنْ عَيْنَيْهِ كَذَا وَكَذَا قُلَّةً مِنْ وَدَكٍ وَنَزَلَ فِي حِجَاجِ عَيْنِهِ أَرْبَعَةُ نَفَرٍ وَكَانَ مَعَ أَبِي عُبَيْدَةَ جِرَابٌ فِيهِ تَمْرٌ فَكَانَ يُعْطِينَا الْقَبْضَةَ ثُمَّ صَارَ إِلَى التَّمْرَةِ فَلَمَّا فَقَدْنَاهَا وَجَدْنَا فَقْدَهَا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 4353,
			"arabicnumber": 4353,
			"text": "أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ، قَالَ حَدَّثَنَا هُشَيْمٌ، قَالَ حَدَّثَنَا أَبُو الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ بَعَثَنَا النَّبِيُّ صلى الله عليه وسلم مَعَ أَبِي عُبَيْدَةَ فِي سَرِيَّةٍ فَنَفِدَ زَادُنَا فَمَرَرْنَا بِحُوتٍ قَدْ قَذَفَ بِهِ الْبَحْرُ فَأَرَدْنَا أَنْ نَأْكُلَ مِنْهُ فَنَهَانَا أَبُو عُبَيْدَةَ ثُمَّ قَالَ نَحْنُ رُسُلُ رَسُولِ اللَّهِ صلى الله عليه وسلم وَفِي سَبِيلِ اللَّهِ كُلُوا ‏.‏ فَأَكَلْنَا مِنْهُ أَيَّامًا فَلَمَّا قَدِمْنَا عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم أَخْبَرْنَاهُ فَقَالَ ‏ \"‏ إِنْ كَانَ بَقِيَ مَعَكُمْ شَىْءٌ فَابْعَثُوا بِهِ إِلَيْنَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 4354,
			"arabicnumber": 4354,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عُمَرَ بْنِ عَلِيِّ بْنِ مُقَدَّمٍ الْمُقَدَّمِيُّ، قَالَ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ بَعَثَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم مَعَ أَبِي عُبَيْدَةَ وَنَحْنُ ثَلاَثُمِائَةٍ وَبِضْعَةَ عَشَرَ وَزَوَّدَنَا جِرَابًا مِنْ تَمْرٍ فَأَعْطَانَا قَبْضَةً قَبْضَةً فَلَمَّا أَنْ جُزْنَاهُ أَعْطَانَا تَمْرَةً تَمْرَةً حَتَّى إِنْ كُنَّا لَنَمُصُّهَا كَمَا يَمُصُّ الصَّبِيُّ وَنَشْرَبُ عَلَيْهَا الْمَاءَ فَلَمَّا فَقَدْنَاهَا وَجَدْنَا فَقْدَهَا حَتَّى إِنْ كُنَّا لَنَخْبِطُ الْخَبَطَ بِقِسِيِّنَا وَنَسَفُّهُ ثُمَّ نَشْرَبُ عَلَيْهِ مِنَ الْمَاءِ حَتَّى سُمِّينَا جَيْشَ الْخَبَطِ ثُمَّ أَجَزْنَا السَّاحِلَ فَإِذَا دَابَّةٌ مِثْلُ الْكَثِيبِ يُقَالُ لَهُ الْعَنْبَرُ فَقَالَ أَبُو عُبَيْدَةَ مَيْتَةٌ لاَ تَأْكُلُوهُ ‏.‏ ثُمَّ قَالَ جَيْشُ رَسُولِ اللَّهِ صلى الله عليه وسلم وَفِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ وَنَحْنُ مُضْطَرُّونَ كُلُوا بِاسْمِ اللَّهِ ‏.‏ فَأَكَلْنَا مِنْهُ وَجَعَلْنَا مِنْهُ وَشِيقَةً وَلَقَدْ جَلَسَ فِي مَوْضِعِ عَيْنِهِ ثَلاَثَةَ عَشَرَ رَجُلاً - قَالَ - فَأَخَذَ أَبُو عُبَيْدَةَ ضِلَعًا مِنْ أَضْلاَعِهِ فَرَحَلَ بِهِ أَجْسَمَ بَعِيرٍ مِنْ أَبَاعِرِ الْقَوْمِ فَأَجَازَ تَحْتَهُ فَلَمَّا قَدِمْنَا عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَا حَبَسَكُمْ ‏\"‏ ‏.‏ قُلْنَا كُنَّا نَتَّبِعُ عِيرَاتِ قُرَيْشٍ وَذَكَرْنَا لَهُ مِنْ أَمْرِ الدَّابَّةِ فَقَالَ ‏\"‏ ذَاكَ رِزْقٌ رَزَقَكُمُوهُ اللَّهُ عَزَّ وَجَلَّ أَمَعَكُمْ مِنْهُ شَىْءٌ ‏\"‏ ‏.‏ قَالَ قُلْنَا نَعَمْ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 4355,
			"arabicnumber": 4355,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، عَنِ ابْنِ أَبِي ذِئْبٍ، عَنْ سَعِيدِ بْنِ خَالِدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عُثْمَانَ، أَنَّ طَبِيبًا، ذَكَرَ ضِفْدَعًا فِي دَوَاءٍ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَنَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ قَتْلِهِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 4356,
			"arabicnumber": 4356,
			"text": "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، عَنْ سُفْيَانَ، - وَهُوَ ابْنُ حَبِيبٍ - عَنْ شُعْبَةَ، عَنْ أَبِي يَعْفُورٍ، سَمِعَ عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى، قَالَ غَزَوْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم سَبْعَ غَزَوَاتٍ فَكُنَّا نَأْكُلُ الْجَرَادَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 4357,
			"arabicnumber": 4357,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ سُفْيَانَ، - وَهُوَ ابْنُ عُيَيْنَةَ - عَنْ أَبِي يَعْفُورٍ، قَالَ سَأَلْتُ عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى عَنْ قَتْلِ الْجَرَادِ، فَقَالَ غَزَوْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم سِتَّ غَزَوَاتٍ نَأْكُلُ الْجَرَادَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 4358,
			"arabicnumber": 4358,
			"text": "أَخْبَرَنَا وَهْبُ بْنُ بَيَانٍ، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدٍ، وَأَبِي، سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَنَّ نَمْلَةً قَرَصَتْ نَبِيًّا مِنَ الأَنْبِيَاءِ فَأَمَرَ بِقَرْيَةِ النَّمْلِ فَأُحْرِقَتْ فَأَوْحَى اللَّهُ عَزَّ وَجَلَّ إِلَيْهِ أَنْ قَدْ قَرَصَتْكَ نَمْلَةٌ أَهْلَكْتَ أُمَّةً مِنَ الأُمَمِ تُسَبِّحُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 4359,
			"arabicnumber": 4359,
			"text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا النَّضْرُ، - وَهُوَ ابْنُ شُمَيْلٍ - قَالَ أَنْبَأَنَا أَشْعَثُ، عَنِ الْحَسَنِ، نَزَلَ نَبِيٌّ مِنَ الأَنْبِيَاءِ تَحْتَ شَجَرَةٍ فَلَدَغَتْهُ نَمْلَةٌ فَأَمَرَ بِبَيْتِهِنَّ فَحُرِّقَ عَلَى مَا فِيهَا فَأَوْحَى اللَّهُ إِلَيْهِ فَهَلاَّ نَمْلَةً وَاحِدَةً ‏.‏ وَقَالَ الأَشْعَثُ عَنِ ابْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلَهُ وَزَادَ فَإِنَّهُنَّ يُسَبِّحْنَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 4360,
			"arabicnumber": 4360,
			"text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ أَبِي هُرَيْرَةَ، نَحْوَهُ وَلَمْ يَرْفَعْهُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 98
			}
		}
	]
}