{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"49": "The Book of the Etiquette of Judges"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5379,
			"arabicnumber": 5379,
			"text": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، ح وَأَنْبَأَنَا مُحَمَّدُ بْنُ آدَمَ بْنِ سُلَيْمَانَ، عَنِ ابْنِ الْمُبَارَكِ، عَنْ سُفْيَانَ بْنِ عُيَيْنَةَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ عَمْرِو بْنِ أَوْسٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ الْمُقْسِطِينَ عِنْدَ اللَّهِ تَعَالَى عَلَى مَنَابِرَ مِنْ نُورٍ عَلَى يَمِينِ الرَّحْمَنِ الَّذِينَ يَعْدِلُونَ فِي حُكْمِهِمْ وَأَهْلِيهِمْ وَمَا وَلُوا ‏\"‏‏.‏ قَالَ مُحَمَّدٌ فِي حَدِيثِهِ ‏\"‏ وَكِلْتَا يَدَيْهِ يَمِينٌ ‏\"‏‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 5380,
			"arabicnumber": 5380,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ عُبَيْدِ اللَّهِ، عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ سَبْعَةٌ يُظِلُّهُمُ اللَّهُ عَزَّ وَجَلَّ يَوْمَ الْقِيَامَةِ يَوْمَ لاَ ظِلَّ إِلاَّ ظِلُّهُ إِمَامٌ عَادِلٌ وَشَابٌّ نَشَأَ فِي عِبَادَةِ اللَّهِ عَزَّ وَجَلَّ وَرَجُلٌ ذَكَرَ اللَّهَ فِي خَلاَءٍ فَفَاضَتْ عَيْنَاهُ وَرَجُلٌ كَانَ قَلْبُهُ مُعَلَّقًا فِي الْمَسْجِدِ وَرَجُلاَنِ تَحَابَّا فِي اللَّهِ عَزَّ وَجَلَّ وَرَجُلٌ دَعَتْهُ امْرَأَةٌ ذَاتُ مَنْصِبٍ وَجَمَالٍ إِلَى نَفْسِهَا فَقَالَ إِنِّي أَخَافُ اللَّهَ عَزَّ وَجَلَّ وَرَجُلٌ تَصَدَّقَ بِصَدَقَةٍ فَأَخْفَاهَا حَتَّى لاَ تَعْلَمَ شِمَالُهُ مَا صَنَعَتْ يَمِينُهُ ‏\"‏‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 5381,
			"arabicnumber": 5381,
			"text": "أَخْبَرَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ أَنْبَأَنَا مَعْمَرٌ، عَنْ سُفْيَانَ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ أَبِي بَكْرِ، ‏{‏بْنِ‏}‏ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا حَكَمَ الْحَاكِمُ فَاجْتَهَدَ فَأَصَابَ فَلَهُ أَجْرَانِ وَإِذَا اجْتَهَدَ فَأَخْطَأَ فَلَهُ أَجْرٌ ‏\"‏‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 5382,
			"arabicnumber": 5382,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا عُمَرُ بْنُ عَلِيٍّ، عَنْ أَبِي عُمَيْسٍ، عَنْ سَعِيدِ بْنِ أَبِي بُرْدَةَ، عَنْ أَبِيهِ، عَنْ أَبِي مُوسَى، قَالَ أَتَانِي نَاسٌ مِنَ الأَشْعَرِيِّينَ فَقَالُوا اذْهَبْ مَعَنَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَإِنَّ لَنَا حَاجَةً‏.‏ فَذَهَبْتُ مَعَهُمْ فَقَالُوا يَا رَسُولَ اللَّهِ اسْتَعِنْ بِنَا فِي عَمَلِكَ‏.‏ قَالَ أَبُو مُوسَى فَاعْتَذَرْتُ مِمَّا قَالُوا وَأَخْبَرْتُ أَنِّي لاَ أَدْرِي مَا حَاجَتُهُمْ فَصَدَّقَنِي وَعَذَرَنِي‏.‏ فَقَالَ ‏ \"‏ إِنَّا لاَ نَسْتَعِينُ فِي عَمَلِنَا بِمَنْ سَأَلَنَا ‏\"‏‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 5383,
			"arabicnumber": 5383,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، قَالَ سَمِعْتُ أَنَسًا، يُحَدِّثُ عَنْ أُسَيْدِ بْنِ حُضَيْرٍ، أَنَّ رَجُلاً، مِنَ الأَنْصَارِ جَاءَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ أَلاَ تَسْتَعْمِلْنِي كَمَا اسْتَعْمَلْتَ فُلاَنًا قَالَ ‏ \"‏ إِنَّكُمْ سَتَلْقَوْنَ بَعْدِي أَثَرَةً فَاصْبِرُوا حَتَّى تَلْقَوْنِي عَلَى الْحَوْضِ ‏\"‏‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 5384,
			"arabicnumber": 5384,
			"text": "أَخْبَرَنَا مُجَاهِدُ بْنُ مُوسَى، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، عَنْ يُونُسَ، عَنِ الْحَسَنِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ، ح وَأَنْبَأَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا ابْنُ عَوْنٍ، عَنِ الْحَسَنِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ تَسْأَلِ الإِمَارَةَ فَإِنَّكَ إِنْ أُعْطِيتَهَا عَنْ مَسْأَلَةٍ وُكِلْتَ إِلَيْهَا وَإِنْ أُعْطِيتَهَا عَنْ غَيْرِ مَسْأَلَةٍ أُعِنْتَ عَلَيْهَا ‏\"‏‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 5385,
			"arabicnumber": 5385,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ آدَمَ بْنِ سُلَيْمَانَ، عَنِ ابْنِ الْمُبَارَكِ، عَنِ ابْنِ أَبِي ذِئْبٍ، عَنِ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّكُمْ سَتَحْرِصُونَ عَلَى الإِمَارَةِ وَإِنَّهَا سَتَكُونُ نَدَامَةً وَحَسْرَةً يَوْمَ الْقِيَامَةِ فَنِعْمَتِ الْمُرْضِعَةُ وَبِئْسَتِ الْفَاطِمَةُ ‏\"‏‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 5386,
			"arabicnumber": 5386,
			"text": "أَخْبَرَنَا الْحَسَنُ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا حَجَّاجٌ، عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي ابْنُ أَبِي مُلَيْكَةَ، عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، أَخْبَرَهُ أَنَّهُ، قَدِمَ رَكْبٌ مِنْ بَنِي تَمِيمٍ عَلَى النَّبِيِّ صلى الله عليه وسلم قَالَ أَبُو بَكْرٍ أَمِّرِ الْقَعْقَاعَ بْنَ مَعْبَدٍ‏.‏ وَقَالَ عُمَرُ رضى الله عنه بَلْ أَمِّرِ الأَقْرَعَ بْنَ حَابِسٍ‏.‏ فَتَمَارَيَا حَتَّى ارْتَفَعَتْ أَصْوَاتُهُمَا فَنَزَلَتْ فِي ذَلِكَ ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا لاَ تُقَدِّمُوا بَيْنَ يَدَىِ اللَّهِ وَرَسُولِهِ‏}‏ حَتَّى انْقَضَتِ الآيَةُ ‏{‏وَلَوْ أَنَّهُمْ صَبَرُوا حَتَّى تَخْرُجَ إِلَيْهِمْ لَكَانَ خَيْرًا لَهُمْ‏}‏‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 5387,
			"arabicnumber": 5387,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا يَزِيدُ، وَهُوَ ابْنُ الْمِقْدَامِ بْنِ شُرَيْحٍ ‏{‏عَنْ أَبِيهِ،‏}‏ عَنْ شُرَيْحِ بْنِ هَانِئٍ، عَنْ أَبِيهِ، هَانِئٍ أَنَّهُ لَمَّا وَفَدَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم سَمِعَهُ وَهُمْ يَكْنُونَ هَانِئًا أَبَا الْحَكَمِ فَدَعَاهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ لَهُ ‏\"‏ إِنَّ اللَّهَ هُوَ الْحَكَمُ وَإِلَيْهِ الْحُكْمُ فَلِمَ تُكَنَّى أَبَا الْحَكَمِ ‏\"‏‏.‏ فَقَالَ إِنَّ قَوْمِي إِذَا اخْتَلَفُوا فِي شَىْءٍ أَتَوْنِي فَحَكَمْتُ بَيْنَهُمْ فَرَضِيَ كِلاَ الْفَرِيقَيْنِ‏.‏ قَالَ ‏\"‏ مَا أَحْسَنَ مِنْ هَذَا فَمَا لَكَ مِنَ الْوُلْدِ ‏\"‏‏.‏ قَالَ لِي شُرَيْحٌ وَعَبْدُ اللَّهِ وَمُسْلِمٌ‏.‏ قَالَ ‏\"‏ فَمَنْ أَكْبَرُهُمْ ‏\"‏‏.‏ قَالَ شُرَيْحٌ‏.‏ قَالَ ‏\"‏ فَأَنْتَ أَبُو شُرَيْحٍ ‏\"‏‏.‏ فَدَعَا لَهُ وَلِوَلَدِهِ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 5388,
			"arabicnumber": 5388,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، قَالَ حَدَّثَنَا حُمَيْدٌ، عَنِ الْحَسَنِ، عَنْ أَبِي بَكْرَةَ، قَالَ عَصَمَنِي اللَّهُ بِشَىْءٍ سَمِعْتُهُ مِنْ، رَسُولِ اللَّهِ صلى الله عليه وسلم لَمَّا هَلَكَ كِسْرَى قَالَ ‏\"‏ مَنِ اسْتَخْلَفُوا ‏\"‏‏.‏ قَالُوا بِنْتَهُ‏.‏ قَالَ ‏\"‏ لَنْ يُفْلِحَ قَوْمٌ وَلَّوْا أَمْرَهُمُ امْرَأَةً ‏\"‏‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 5389,
			"arabicnumber": 5389,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ هَاشِمٍ، عَنِ الْوَلِيدِ، عَنِ الأَوْزَاعِيِّ، عَنِ الزُّهْرِيِّ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنِ ابْنِ عَبَّاسٍ، عَنِ الْفَضْلِ بْنِ عَبَّاسٍ، أَنَّهُ كَانَ رَدِيفَ رَسُولِ اللَّهِ صلى الله عليه وسلم غَدَاةَ النَّحْرِ فَأَتَتْهُ امْرَأَةٌ مِنْ خَثْعَمٍ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ فَرِيضَةَ اللَّهِ عَزَّ وَجَلَّ فِي الْحَجِّ عَلَى عِبَادِهِ أَدْرَكَتْ أَبِي شَيْخًا كَبِيرًا لاَ يَسْتَطِيعُ أَنْ يَرْكَبَ إِلاَّ مُعْتَرِضًا أَفَأَحُجُّ عَنْهُ قَالَ ‏ \"‏ نَعَمْ حُجِّي عَنْهُ فَإِنَّهُ لَوْ كَانَ عَلَيْهِ دَيْنٌ قَضَيْتِيهِ ‏\"‏‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 5390,
			"arabicnumber": 5390,
			"text": "أَخْبَرَنِي عَمْرُو بْنُ عُثْمَانَ، قَالَ حَدَّثَنَا الْوَلِيدُ، عَنِ الأَوْزَاعِيِّ، قَالَ أَخْبَرَنِي ابْنُ شِهَابٍ، ح وَأَخْبَرَنِي مَحْمُودُ بْنُ خَالِدٍ، قَالَ حَدَّثَنَا عُمَرُ، عَنِ الأَوْزَاعِيِّ، حَدَّثَنِي الزُّهْرِيُّ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، أَنَّ ابْنَ عَبَّاسٍ، أَخْبَرَهُ أَنَّ امْرَأَةً مِنْ خَثْعَمٍ اسْتَفْتَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم وَالْفَضْلُ رَدِيفُ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ فَرِيضَةَ اللَّهِ عَزَّ وَجَلَّ فِي الْحَجِّ عَلَى عِبَادِهِ أَدْرَكَتْ أَبِي شَيْخًا كَبِيرًا لاَ يَسْتَطِيعُ أَنْ يَسْتَوِيَ عَلَى الرَّاحِلَةِ فَهَلْ يُجْزِئُ قَالَ مَحْمُودٌ فَهَلْ يَقْضِي - أَنْ أَحُجَّ عَنْهُ فَقَالَ لَهَا ‏ \"‏ نَعَمْ ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ وَقَدْ رَوَى هَذَا الْحَدِيثَ غَيْرُ وَاحِدٍ عَنِ الزُّهْرِيِّ فَلَمْ يَذْكُرْ فِيهِ مَا ذَكَرَ الْوَلِيدُ بْنُ مُسْلِمٍ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 5391,
			"arabicnumber": 5391,
			"text": "قَالَ الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، عَنِ ابْنِ الْقَاسِمِ، حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، قَالَ كَانَ الْفَضْلُ بْنُ عَبَّاسٍ رَدِيفَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَجَاءَتْهُ امْرَأَةٌ مِنْ خَثْعَمٍ تَسْتَفْتِيهِ فَجَعَلَ الْفَضْلُ يَنْظُرُ إِلَيْهَا وَتَنْظُرُ إِلَيْهِ وَجَعَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصْرِفُ وَجْهَ الْفَضْلِ إِلَى الشِّقِّ الآخَرِ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ فَرِيضَةَ اللَّهِ عَزَّ وَجَلَّ عَلَى عِبَادِهِ فِي الْحَجِّ أَدْرَكَتْ أَبِي شَيْخًا كَبِيرًا لاَ يَسْتَطِيعُ أَنْ يَثْبُتَ عَلَى الرَّاحِلَةِ أَفَأَحُجُّ عَنْهُ قَالَ ‏ \"‏ نَعَمْ ‏\"‏‏.‏ وَذَلِكَ فِي حَجَّةِ الْوَدَاعِ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 5392,
			"arabicnumber": 5392,
			"text": "أَخْبَرَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنِي أَبِي، عَنْ صَالِحِ بْنِ كَيْسَانَ، عَنِ ابْنِ شِهَابٍ، أَنَّ سُلَيْمَانَ بْنَ يَسَارٍ، أَخْبَرَهُ أَنَّ ابْنَ عَبَّاسٍ أَخْبَرَهُ أَنَّ امْرَأَةً مِنْ خَثْعَمٍ قَالَتْ يَا رَسُولَ اللَّهِ إِنَّ فَرِيضَةَ اللَّهِ عَزَّ وَجَلَّ فِي الْحَجِّ عَلَى عِبَادِهِ أَدْرَكَتْ أَبِي شَيْخًا كَبِيرًا لاَ يَسْتَوِي عَلَى الرَّاحِلَةِ فَهَلْ يَقْضِي عَنْهُ أَنْ أَحُجَّ عَنْهُ قَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ نَعَمْ ‏\"‏‏.‏ فَأَخَذَ الْفَضْلُ يَلْتَفِتُ إِلَيْهَا - وَكَانَتِ امْرَأَةً حَسْنَاءَ - وَأَخَذَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْفَضْلَ فَحَوَّلَ وَجْهَهُ مِنَ الشِّقِّ الآخَرِ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 5393,
			"arabicnumber": 5393,
			"text": "أَخْبَرَنَا مُجَاهِدُ بْنُ مُوسَى، عَنْ هُشَيْمٍ، عَنْ يَحْيَى بْنِ أَبِي إِسْحَاقَ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّ رَجُلاً، سَأَلَ النَّبِيَّ صلى الله عليه وسلم إِنَّ أَبِي أَدْرَكَهُ الْحَجُّ وَهُوَ شَيْخٌ كَبِيرٌ لاَ يَثْبُتُ عَلَى رَاحِلَتِهِ فَإِنْ شَدَدْتُهُ خَشِيتُ أَنْ يَمُوتَ أَفَأَحُجُّ عَنْهُ قَالَ ‏\"‏ أَفَرَأَيْتَ لَوْ كَانَ عَلَيْهِ دَيْنٌ فَقَضَيْتَهُ أَكَانَ مُجْزِئًا ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏ قَالَ ‏\"‏ فَحُجَّ عَنْ أَبِيكَ ‏\"‏‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 5394,
			"arabicnumber": 5394,
			"text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا يَزِيدُ، قَالَ حَدَّثَنَا هِشَامٌ، عَنْ مُحَمَّدٍ، عَنْ يَحْيَى بْنِ أَبِي إِسْحَاقَ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنِ الْفَضْلِ بْنِ الْعَبَّاسِ، أَنَّهُ كَانَ رَدِيفَ النَّبِيِّ صلى الله عليه وسلم فَجَاءَهُ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ أُمِّي عَجُوزٌ كَبِيرَةٌ إِنْ حَمَلْتُهَا لَمْ تَسْتَمْسِكْ وَإِنْ رَبَطْتُهَا خَشِيتُ أَنْ أَقْتُلَهَا‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَرَأَيْتَ لَوْ كَانَ عَلَى أُمِّكَ دَيْنٌ أَكُنْتَ قَاضِيَهُ ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏ قَالَ ‏\"‏ فَحُجَّ عَنْ أُمِّكَ ‏\"‏‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 5395,
			"arabicnumber": 5395,
			"text": "أَخْبَرَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا الْوَلِيدُ بْنُ نَافِعٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ يَحْيَى بْنِ أَبِي إِسْحَاقَ، قَالَ سَمِعْتُ سُلَيْمَانَ بْنَ يَسَارٍ، يُحَدِّثُهُ عَنِ الْفَضْلِ بْنِ الْعَبَّاسِ، قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ يَا نَبِيَّ اللَّهِ إِنَّ أَبِي شَيْخٌ كَبِيرٌ لاَ يَسْتَطِيعُ الْحَجَّ وَإِنْ حَمَلْتُهُ لَمْ يَسْتَمْسِكْ أَفَأَحُجَّ عَنْهُ قَالَ ‏ \"‏ حُجَّ عَنْ أَبِيكَ ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ سُلَيْمَانُ لَمْ يَسْمَعْ مِنَ الْفَضْلِ بْنِ الْعَبَّاسِ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 5396,
			"arabicnumber": 5396,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَعْمَرٍ، قَالَ حَدَّثَنَا أَبُو عَاصِمٍ، عَنْ زَكَرِيَّا بْنِ إِسْحَاقَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ أَبِي الشَّعْثَاءِ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَجُلاً، جَاءَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ إِنَّ أَبِي شَيْخٌ كَبِيرٌ أَفَأَحُجُّ عَنْهُ قَالَ ‏ \"‏ نَعَمْ أَرَأَيْتَ لَوْ كَانَ عَلَيْهِ دَيْنٌ فَقَضَيْتَهُ أَكَانَ يُجْزِئُ عَنْهُ ‏\"‏‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 5397,
			"arabicnumber": 5397,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ عُمَارَةَ، هُوَ ابْنُ عُمَيْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، قَالَ أَكْثَرُوا عَلَى عَبْدِ اللَّهِ ذَاتَ يَوْمٍ فَقَالَ عَبْدُ اللَّهِ إِنَّهُ قَدْ أَتَى عَلَيْنَا زَمَانٌ وَلَسْنَا نَقْضِي وَلَسْنَا هُنَالِكَ ثُمَّ إِنَّ اللَّهَ عَزَّ وَجَلَّ قَدَّرَ عَلَيْنَا أَنْ بَلَغْنَا مَا تَرَوْنَ فَمَنْ عَرَضَ لَهُ مِنْكُمْ قَضَاءٌ بَعْدَ الْيَوْمِ فَلْيَقْضِ بِمَا فِي كِتَابِ اللَّهِ فَإِنْ جَاءَ أَمْرٌ لَيْسَ فِي كِتَابِ اللَّهِ فَلْيَقْضِ بِمَا قَضَى بِهِ نَبِيُّهُ صلى الله عليه وسلم فَإِنْ جَاءَ أَمْرٌ لَيْسَ فِي كِتَابِ اللَّهِ وَلاَ قَضَى بِهِ نَبِيُّهُ صلى الله عليه وسلم فَلْيَقْضِ بِمَا قَضَى بِهِ الصَّالِحُونَ فَإِنْ جَاءَ أَمْرٌ لَيْسَ فِي كِتَابِ اللَّهِ وَلاَ قَضَى بِهِ نَبِيُّهُ صلى الله عليه وسلم وَلاَ قَضَى بِهِ الصَّالِحُونَ فَلْيَجْتَهِدْ رَأْيَهُ وَلاَ يَقُولُ إِنِّي أَخَافُ وَإِنِّي أَخَافُ فَإِنَّ الْحَلاَلَ بَيِّنٌ وَالْحَرَامَ بَيِّنٌ وَبَيْنَ ذَلِكَ أُمُورٌ مُشْتَبِهَاتٌ فَدَعْ مَا يَرِيبُكَ إِلَى مَا لاَ يَرِيبُكَ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ هَذَا الْحَدِيثُ جَيِّدٌ جَيِّدٌ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 5398,
			"arabicnumber": 5398,
			"text": "أَخْبَرَنِي مُحَمَّدُ بْنُ عَلِيِّ بْنِ مَيْمُونٍ، قَالَ حَدَّثَنَا الْفِرْيَابِيُّ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ عُمَارَةَ بْنِ عُمَيْرٍ، عَنْ حُرَيْثِ بْنِ ظُهَيْرٍ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ أَتَى عَلَيْنَا حِينٌ وَلَسْنَا نَقْضِي وَلَسْنَا هُنَالِكَ وَإِنَّ اللَّهَ عَزَّ وَجَلَّ قَدَّرَ أَنْ بَلَغْنَا مَا تَرَوْنَ فَمَنْ عَرَضَ لَهُ قَضَاءٌ بَعْدَ الْيَوْمِ فَلْيَقْضِ فِيهِ بِمَا فِي كِتَابِ اللَّهِ فَإِنْ جَاءَ أَمْرٌ لَيْسَ فِي كِتَابِ اللَّهِ فَلْيَقْضِ بِمَا قَضَى بِهِ نَبِيُّهُ فَإِنْ جَاءَ أَمْرٌ لَيْسَ فِي كِتَابِ اللَّهِ وَلَمْ يَقْضِ بِهِ نَبِيُّهُ صلى الله عليه وسلم فَلْيَقْضِ بِمَا قَضَى بِهِ الصَّالِحُونَ وَلاَ يَقُولُ أَحَدُكُمْ إِنِّي أَخَافُ وَإِنِّي أَخَافُ فَإِنَّ الْحَلاَلَ بَيِّنٌ وَالْحَرَامَ بَيِّنٌ وَبَيْنَ ذَلِكَ أُمُورٌ مُشْتَبِهَةٌ فَدَعْ مَا يَرِيبُكَ إِلَى مَا لاَ يَرِيبُكَ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 5399,
			"arabicnumber": 5399,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا أَبُو عَامِرٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الشَّيْبَانِيِّ، عَنِ الشَّعْبِيِّ، عَنْ شُرَيْحٍ، أَنَّهُ كَتَبَ إِلَى عُمَرَ يَسْأَلُهُ فَكَتَبَ إِلَيْهِ أَنِ اقْضِ بِمَا فِي كِتَابِ اللَّهِ فَإِنْ لَمْ يَكُنْ فِي كِتَابِ اللَّهِ فَبِسُنَّةِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَإِنْ لَمْ يَكُنْ فِي كِتَابِ اللَّهِ وَلاَ فِي سُنَّةِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَاقْضِ بِمَا قَضَى بِهِ الصَّالِحُونَ فَإِنْ لَمْ يَكُنْ فِي كِتَابِ اللَّهِ وَلاَ فِي سُنَّةِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَلَمْ يَقْضِ بِهِ الصَّالِحُونَ فَإِنْ شِئْتَ فَتَقَدَّمْ وَإِنْ شِئْتَ فَتَأَخَّرْ وَلاَ أَرَى التَّأَخُّرَ إِلاَّ خَيْرًا لَكَ وَالسَّلاَمُ عَلَيْكُمْ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 5400,
			"arabicnumber": 5400,
			"text": "أَخْبَرَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ، قَالَ أَنْبَأَنَا الْفَضْلُ بْنُ مُوسَى، عَنْ سُفْيَانَ بْنِ سَعِيدٍ، عَنْ عَطَاءِ بْنِ السَّائِبِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَتْ مُلُوكٌ بَعْدَ عِيسَى ابْنِ مَرْيَمَ عَلَيْهِ الصَّلاَةُ وَالسَّلاَمُ بَدَّلُوا التَّوْرَاةَ وَالإِنْجِيلَ وَكَانَ فِيهِمْ مُؤْمِنُونَ يَقْرَءُونَ التَّوْرَاةَ قِيلَ لِمُلُوكِهِمْ مَا نَجِدُ شَتْمًا أَشَدَّ مِنْ شَتْمٍ يَشْتِمُونَّا هَؤُلاَءِ إِنَّهُمْ يَقْرَءُونَ ‏{‏وَمَنْ لَمْ يَحْكُمْ بِمَا أَنْزَلَ اللَّهُ فَأُولَئِكَ هُمُ الْكَافِرُونَ‏}‏ وَهَؤُلاَءِ الآيَاتِ مَعَ مَا يَعِيبُونَّا بِهِ فِي أَعْمَالِنَا فِي قِرَاءَتِهِمْ فَادْعُهُمْ فَلْيَقْرَءُوا كَمَا نَقْرَأُ وَلْيُؤْمِنُوا كَمَا آمَنَّا‏.‏ فَدَعَاهُمْ فَجَمَعَهُمْ وَعَرَضَ عَلَيْهِمُ الْقَتْلَ أَوْ يَتْرُكُوا قِرَاءَةَ التَّوْرَاةِ وَالإِنْجِيلِ إِلاَّ مَا بَدَّلُوا مِنْهَا فَقَالُوا مَا تُرِيدُونَ إِلَى ذَلِكَ دَعُونَا‏.‏ فَقَالَتْ طَائِفَةٌ مِنْهُمُ ابْنُوا لَنَا أُسْطُوَانَةً ثُمَّ ارْفَعُونَا إِلَيْهَا ثُمَّ اعْطُونَا شَيْئًا نَرْفَعُ بِهِ طَعَامَنَا وَشَرَابَنَا فَلاَ نَرِدُ عَلَيْكُمْ‏.‏ وَقَالَتْ طَائِفَةٌ مِنْهُمْ دَعُونَا نَسِيحُ فِي الأَرْضِ وَنَهِيمُ وَنَشْرَبُ كَمَا يَشْرَبُ الْوَحْشُ فَإِنْ قَدَرْتُمْ عَلَيْنَا فِي أَرْضِكُمْ فَاقْتُلُونَا‏.‏ وَقَالَتْ طَائِفَةٌ مِنْهُمُ ابْنُوا لَنَا دُورًا فِي الْفَيَافِي وَنَحْتَفِرُ الآبَارَ وَنَحْتَرِثُ الْبُقُولَ فَلاَ نَرِدُ عَلَيْكُمْ وَلاَ نَمُرُّ بِكُمْ وَلَيْسَ أَحَدٌ مِنَ الْقَبَائِلِ إِلاَّ وَلَهُ حَمِيمٌ فِيهِمْ‏.‏ قَالَ فَفَعَلُوا ذَلِكَ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏{‏وَرَهْبَانِيَّةً ابْتَدَعُوهَا مَا كَتَبْنَاهَا عَلَيْهِمْ إِلاَّ ابْتِغَاءَ رِضْوَانِ اللَّهِ فَمَا رَعَوْهَا حَقَّ رِعَايَتِهَا‏}‏ وَالآخَرُونَ قَالُوا نَتَعَبَّدُ كَمَا تَعَبَّدَ فُلاَنٌ وَنَسِيحُ كَمَا سَاحَ فُلاَنٌ وَنَتَّخِذُ دُورًا كَمَا اتَّخَذَ فُلاَنٌ‏.‏ وَهُمْ عَلَى شِرْكِهِمْ لاَ عِلْمَ لَهُمْ بِإِيمَانِ الَّذِينَ اقْتَدَوْا بِهِ فَلَمَّا بَعَثَ اللَّهُ النَّبِيَّ صلى الله عليه وسلم وَلَمْ يَبْقَ مِنْهُمْ إِلاَّ قَلِيلٌ انْحَطَّ رَجُلٌ مِنْ صَوْمَعَتِهِ وَجَاءَ سَائِحٌ مِنْ سِيَاحَتِهِ وَصَاحِبُ الدَّيْرِ مِنْ دَيْرِهِ فَآمَنُوا بِهِ وَصَدَّقُوهُ فَقَالَ اللَّهُ تَبَارَكَ وَتَعَالَى ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَآمِنُوا بِرَسُولِهِ يُؤْتِكُمْ كِفْلَيْنِ مِنْ رَحْمَتِهِ‏}‏ أَجْرَيْنِ بِإِيمَانِهِمْ بِعِيسَى وَبِالتَّوْرَاةِ وَالإِنْجِيلِ وَبِإِيمَانِهِمْ بِمُحَمَّدٍ صلى الله عليه وسلم وَتَصْدِيقِهِمْ قَالَ ‏{‏يَجْعَلْ لَكُمْ نُورًا تَمْشُونَ بِهِ‏}‏ الْقُرْآنَ وَاتِّبَاعَهُمُ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏{‏لِئَلاَّ يَعْلَمَ أَهْلُ الْكِتَابِ‏}‏ يَتَشَبَّهُونَ بِكُمْ ‏{‏أَنْ لاَ يَقْدِرُونَ عَلَى شَىْءٍ مِنْ فَضْلِ اللَّهِ‏}‏ الآيَةَ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 5401,
			"arabicnumber": 5401,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، قَالَ حَدَّثَنِي أَبِي، عَنْ زَيْنَبَ بِنْتِ أَبِي سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّكُمْ تَخْتَصِمُونَ إِلَىَّ وَإِنَّمَا أَنَا بَشَرٌ وَلَعَلَّ بَعْضَكُمْ أَلْحَنُ بِحُجَّتِهِ مِنْ بَعْضٍ فَمَنْ قَضَيْتُ لَهُ مِنْ حَقِّ أَخِيهِ شَيْئًا فَلاَ يَأْخُذْهُ فَإِنَّمَا أَقْطَعُهُ بِهِ قِطْعَةً مِنَ النَّارِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 5402,
			"arabicnumber": 5402,
			"text": "أَخْبَرَنَا عِمْرَانُ بْنُ بَكَّارِ بْنِ رَاشِدٍ، قَالَ حَدَّثَنَا عَلِيُّ بْنُ عَيَّاشٍ، قَالَ حَدَّثَنَا شُعَيْبٌ، قَالَ حَدَّثَنِي أَبُو الزِّنَادِ، مِمَّا حَدَّثَهُ عَبْدُ الرَّحْمَنِ الأَعْرَجُ، مِمَّا ذَكَرَ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يُحَدِّثُ بِهِ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ وَقَالَ ‏ \"‏ بَيْنَمَا امْرَأَتَانِ مَعَهُمَا ابْنَاهُمَا جَاءَ الذِّئْبُ فَذَهَبَ بِابْنِ إِحْدَاهُمَا فَقَالَتْ هَذِهِ لِصَاحِبَتِهَا إِنَّمَا ذَهَبَ بِابْنِكِ ‏.‏ وَقَالَتِ الأُخْرَى إِنَّمَا ذَهَبَ بِابْنِكِ ‏.‏ فَتَحَاكَمَتَا إِلَى دَاوُدَ عَلَيْهِ السَّلاَمُ فَقَضَى بِهِ لِلْكُبْرَى فَخَرَجَتَا إِلَى سُلَيْمَانَ بْنِ دَاوُدَ فَأَخْبَرَتَاهُ فَقَالَ ائْتُونِي بِالسِّكِّينِ أَشُقُّهُ بَيْنَهُمَا ‏.‏ فَقَالَتِ الصُّغْرَى لاَ تَفْعَلْ يَرْحَمُكَ اللَّهُ هُوَ ابْنُهَا ‏.‏ فَقَضَى بِهِ لِلصُّغْرَى ‏\"‏ ‏.‏ قَالَ أَبُو هُرَيْرَةَ وَاللَّهِ مَا سَمِعْتُ بِالسِّكِّينِ قَطُّ إِلاَّ يَوْمَئِذٍ مَا كُنَّا نَقُولُ إِلاَّ الْمُدْيَةَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 5403,
			"arabicnumber": 5403,
			"text": "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا شُعَيْبُ بْنُ اللَّيْثِ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ عَجْلاَنَ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ ‏ \"‏ خَرَجَتِ امْرَأَتَانِ مَعَهُمَا صَبِيَّانِ لَهُمَا فَعَدَا الذِّئْبُ عَلَى إِحْدَاهُمَا فَأَخَذَ وَلَدَهَا فَأَصْبَحَتَا تَخْتَصِمَانِ فِي الصَّبِيِّ الْبَاقِي إِلَى دَاوُدَ عَلَيْهِ السَّلاَمُ فَقَضَى بِهِ لِلْكُبْرَى مِنْهُمَا فَمَرَّتَا عَلَى سُلَيْمَانَ فَقَالَ كَيْفَ أَمْرُكُمَا فَقَصَّتَا عَلَيْهِ فَقَالَ ائْتُونِي بِالسِّكِّينِ أَشُقُّ الْغُلاَمَ بَيْنَهُمَا ‏.‏ فَقَالَتِ الصُّغْرَى أَتَشُقُّهُ قَالَ نَعَمْ ‏.‏ فَقَالَتْ لاَ تَفْعَلْ حَظِّي مِنْهُ لَهَا ‏.‏ قَالَ ‏.‏ هُوَ ابْنُكِ ‏.‏ فَقَضَى بِهِ لَهَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 5404,
			"arabicnumber": 5404,
			"text": "أَخْبَرَنَا الْمُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ، قَالَ حَدَّثَنَا مِسْكِينُ بْنُ بُكَيْرٍ، قَالَ حَدَّثَنَا شُعَيْبُ بْنُ أَبِي حَمْزَةَ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ خَرَجَتِ امْرَأَتَانِ مَعَهُمَا وَلَدَاهُمَا فَأَخَذَ الذِّئْبُ أَحَدَهُمَا فَاخْتَصَمَتَا فِي الْوَلَدِ إِلَى دَاوُدَ النَّبِيِّ صلى الله عليه وسلم فَقَضَى بِهِ لِلْكُبْرَى مِنْهُمَا فَمَرَّتَا عَلَى سُلَيْمَانَ عَلَيْهِ السَّلاَمُ فَقَالَ كَيْفَ قَضَى بَيْنَكُمَا قَالَتْ قَضَى بِهِ لِلْكُبْرَى ‏.‏ قَالَ سُلَيْمَانُ أَقْطَعُهُ بِنِصْفَيْنِ لِهَذِهِ نِصْفٌ وَلِهَذِهِ نِصْفٌ ‏.‏ قَالَتِ الْكُبْرَى نَعَمِ اقْطَعُوهُ ‏.‏ فَقَالَتِ الصُّغْرَى لاَ تَقْطَعْهُ هُوَ وَلَدُهَا ‏.‏ فَقَضَى بِهِ لِلَّتِي أَبَتْ أَنْ يَقْطَعَهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 5405,
			"arabicnumber": 5405,
			"text": "أَخْبَرَنَا زَكَرِيَّا بْنُ يَحْيَى، قَالَ حَدَّثَنَا عَبْدُ الأَعْلَى بْنُ حَمَّادٍ، قَالَ حَدَّثَنَا بِشْرُ بْنُ السَّرِيِّ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ مَعْمَرٍ، ح وَأَنْبَأَنَا أَحْمَدُ بْنُ عَلِيِّ بْنِ سَعِيدٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ مَعِينٍ، قَالَ حَدَّثَنَا هِشَامُ بْنُ يُوسُفَ، وَعَبْدُ الرَّزَّاقِ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، قَالَ بَعَثَ النَّبِيُّ صلى الله عليه وسلم خَالِدَ بْنَ الْوَلِيدِ إِلَى بَنِي جَذِيمَةَ فَدَعَاهُمْ إِلَى الإِسْلاَمِ فَلَمْ يُحْسِنُوا أَنْ يَقُولُوا أَسْلَمْنَا فَجَعَلُوا يَقُولُونَ صَبَأْنَا وَجَعَلَ خَالِدٌ قَتْلاً وَأَسْرًا - قَالَ - فَدَفَعَ إِلَى كُلِّ رَجُلٍ أَسِيرَهُ حَتَّى إِذَا أَصْبَحَ يَوْمُنَا أَمَرَ خَالِدُ بْنُ الْوَلِيدِ أَنْ يَقْتُلَ كُلُّ رَجُلٍ مِنَّا أَسِيرَهُ ‏.‏ قَالَ ابْنُ عُمَرَ فَقُلْتُ وَاللَّهِ لاَ أَقْتُلُ أَسِيرِي وَلاَ يَقْتُلُ أَحَدٌ - وَقَالَ بِشْرٌ - مِنْ أَصْحَابِي أَسِيرَهُ - قَالَ - فَقَدِمْنَا عَلَى النَّبِيِّ صلى الله عليه وسلم فَذُكِرَ لَهُ صُنْعُ خَالِدٍ فَقَالَ النَّبِيُّ صلى الله عليه وسلم وَرَفَعَ يَدَيْهِ ‏\"‏ اللَّهُمَّ إِنِّي أَبْرَأُ إِلَيْكَ مِمَّا صَنَعَ خَالِدٌ ‏\"‏ ‏.‏ قَالَ زَكَرِيَّا فِي حَدِيثِهِ فَذُكِرَ وَفِي حَدِيثِ بِشْرٍ فَقَالَ ‏\"‏ اللَّهُمَّ إِنِّي أَبْرَأُ إِلَيْكَ مِمَّا صَنَعَ خَالِدٌ ‏\"‏ ‏.‏ مَرَّتَيْنِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 5406,
			"arabicnumber": 5406,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ، قَالَ كَتَبَ أَبِي وَكَتَبْتُ لَهُ إِلَى عُبَيْدِ اللَّهِ بْنِ أَبِي بَكْرَةَ وَهُوَ قَاضِي سِجِسْتَانَ أَنْ لاَ، تَحْكُمَ بَيْنَ اثْنَيْنِ وَأَنْتَ غَضْبَانُ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ لاَ يَحْكُمْ أَحَدٌ بَيْنَ اثْنَيْنِ وَهُوَ غَضْبَانُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 5407,
			"arabicnumber": 5407,
			"text": "أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الأَعْلَى، وَالْحَارِثُ بْنُ مِسْكِينٍ، عَنِ ابْنِ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ بْنُ يَزِيدَ، وَاللَّيْثُ بْنُ سَعْدٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ عُرْوَةَ بْنَ الزُّبَيْرِ، حَدَّثَهُ أَنَّ عَبْدَ اللَّهِ بْنَ الزُّبَيْرِ حَدَّثَهُ عَنِ الزُّبَيْرِ بْنِ الْعَوَّامِ، أَنَّهُ خَاصَمَ رَجُلاً مِنَ الأَنْصَارِ قَدْ شَهِدَ بَدْرًا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي شِرَاجِ الْحَرَّةِ كَانَا يَسْقِيَانِ بِهِ كِلاَهُمَا النَّخْلَ فَقَالَ الأَنْصَارِيُّ سَرِّحِ الْمَاءَ يَمُرَّ عَلَيْهِ ‏.‏ فَأَبَى عَلَيْهِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اسْقِ يَا زُبَيْرُ ثُمَّ أَرْسِلِ الْمَاءَ إِلَى جَارِكَ ‏\"‏ ‏.‏ فَغَضِبَ الأَنْصَارِيُّ وَقَالَ يَا رَسُولَ اللَّهِ أَنْ كَانَ ابْنَ عَمَّتِكَ فَتَلَوَّنَ وَجْهُ رَسُولِ اللَّهِ صلى الله عليه وسلم ثُمَّ قَالَ ‏\"‏ يَا زُبَيْرُ اسْقِ ثُمَّ احْبِسِ الْمَاءَ حَتَّى يَرْجِعَ إِلَى الْجَدْرِ ‏\"‏ ‏.‏ فَاسْتَوْفَى رَسُولُ اللَّهِ صلى الله عليه وسلم لِلزُّبَيْرِ حَقَّهُ وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَبْلَ ذَلِكَ أَشَارَ عَلَى الزُّبَيْرِ بِرَأْىٍ فِيهِ السَّعَةُ لَهُ وَلِلأَنْصَارِيِّ فَلَمَّا أَحْفَظَ رَسُولَ اللَّهِ صلى الله عليه وسلم الأَنْصَارِيُّ اسْتَوْفَى لِلزُّبَيْرِ حَقَّهُ فِي صَرِيحِ الْحُكْمِ ‏.‏ قَالَ الزُّبَيْرُ لاَ أَحْسَبُ هَذِهِ الآيَةَ أُنْزِلَتْ إِلاَّ فِي ذَلِكَ ‏{‏ فَلاَ وَرَبِّكَ لاَ يُؤْمِنُونَ حَتَّى يُحَكِّمُوكَ فِيمَا شَجَرَ بَيْنَهُمْ ‏}‏ وَأَحَدُهُمَا يَزِيدُ عَلَى صَاحِبِهِ فِي الْقِصَّةِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 5408,
			"arabicnumber": 5408,
			"text": "أَخْبَرَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، قَالَ أَنْبَأَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ كَعْبٍ، عَنْ أَبِيهِ، أَنَّهُ تَقَاضَى ابْنَ أَبِي حَدْرَدٍ دَيْنًا كَانَ عَلَيْهِ فَارْتَفَعَتْ أَصْوَاتُهُمَا حَتَّى سَمِعَهُمَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَهُوَ فِي بَيْتِهِ فَخَرَجَ إِلَيْهِمَا فَكَشَفَ سِتْرَ حُجْرَتِهِ فَنَادَى ‏\"‏ يَا كَعْبُ ‏\"‏ ‏.‏ قَالَ لَبَّيْكَ يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ ضَعْ مِنْ دَيْنِكَ هَذَا ‏\"‏ ‏.‏ وَأَوْمَأَ إِلَى الشَّطْرِ قَالَ قَدْ فَعَلْتُ ‏.‏ قَالَ ‏\"‏ قُمْ فَاقْضِهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 5409,
			"arabicnumber": 5409,
			"text": "أَخْبَرَنَا الْحُسَيْنُ بْنُ مَنْصُورِ بْنِ جَعْفَرٍ، قَالَ حَدَّثَنَا مُبَشِّرُ بْنُ عَبْدِ اللَّهِ بْنِ رَزِينٍ، قَالَ حَدَّثَنَا سُفْيَانُ بْنُ حُسَيْنٍ، عَنْ أَبِي بِشْرٍ، جَعْفَرِ بْنِ إِيَاسٍ عَنْ عَبَّادِ بْنِ شَرَاحِيلَ، قَالَ قَدِمْتُ مَعَ عُمُومَتِي الْمَدِينَةَ فَدَخَلْتُ حَائِطًا مِنْ حِيطَانِهَا فَفَرَكْتُ مِنْ سُنْبُلِهِ فَجَاءَ صَاحِبُ الْحَائِطِ فَأَخَذَ كِسَائِي وَضَرَبَنِي فَأَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم أَسْتَعْدِي عَلَيْهِ فَأَرْسَلَ إِلَى الرَّجُلِ فَجَاءُوا بِهِ فَقَالَ ‏\"‏ مَا حَمَلَكَ عَلَى هَذَا ‏\"‏ ‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّهُ دَخَلَ حَائِطِي فَأَخَذَ مِنْ سُنْبُلِهِ فَفَرَكَهُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا عَلَّمْتَهُ إِذْ كَانَ جَاهِلاً وَلاَ أَطْعَمْتَهُ إِذْ كَانَ جَائِعًا ارْدُدْ عَلَيْهِ كِسَاءَهُ ‏\"‏ ‏.‏ وَأَمَرَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم بِوَسْقٍ أَوْ نِصْفِ وَسْقٍ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 5410,
			"arabicnumber": 5410,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، قَالَ أَنْبَأَنَا عَبْدُ الرَّحْمَنِ بْنُ الْقَاسِمِ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنْ أَبِي هُرَيْرَةَ، وَزَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، أَنَّهُمَا أَخْبَرَاهُ أَنَّ رَجُلَيْنِ اخْتَصَمَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ أَحَدُهُمَا اقْضِ بَيْنَنَا بِكِتَابِ اللَّهِ ‏.‏ وَقَالَ الآخَرُ وَهُوَ أَفْقَهُهُمَا ‏.‏ أَجَلْ يَا رَسُولَ اللَّهِ وَائْذَنْ لِي فِي أَنْ أَتَكَلَّمَ ‏.‏ قَالَ إِنَّ ابْنِي كَانَ عَسِيفًا عَلَى هَذَا فَزَنَى بِامْرَأَتِهِ فَأَخْبَرُونِي أَنَّ عَلَى ابْنِي الرَّجْمَ فَافْتَدَيْتُ بِمِائَةِ شَاةٍ وَبِجَارِيَةٍ لِي ثُمَّ إِنِّي سَأَلْتُ أَهْلَ الْعِلْمِ فَأَخْبَرُونِي أَنَّمَا عَلَى ابْنِي جَلْدُ مِائَةٍ وَتَغْرِيبُ عَامٍ وَإِنَّمَا الرَّجْمُ عَلَى امْرَأَتِهِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَالَّذِي نَفْسِي بِيَدِهِ لأَقْضِيَنَّ بَيْنَكُمَا بِكِتَابِ اللَّهِ أَمَّا غَنَمُكَ وَجَارِيَتُكَ فَرَدٌّ إِلَيْكَ ‏\"‏ ‏.‏ وَجَلَدَ ابْنَهُ مِائَةً وَغَرَّبَهُ عَامًا وَأَمَرَ أُنَيْسًا أَنْ يَأْتِيَ امْرَأَةَ الآخَرِ ‏\"‏ فَإِنِ اعْتَرَفَتْ فَارْجُمْهَا ‏\"‏ ‏.‏ فَاعْتَرَفَتْ فَرَجَمَهَا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 5411,
			"arabicnumber": 5411,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِي هُرَيْرَةَ، وَزَيْدِ بْنِ خَالِدٍ، وَشِبْلٍ، قَالُوا كُنَّا عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَقَامَ إِلَيْهِ رَجُلٌ فَقَالَ أَنْشُدُكَ بِاللَّهِ إِلاَّ مَا قَضَيْتَ بَيْنَنَا بِكِتَابِ اللَّهِ ‏.‏ فَقَامَ خَصْمُهُ - وَكَانَ أَفْقَهَ مِنْهُ - فَقَالَ صَدَقَ اقْضِ بَيْنَنَا بِكِتَابِ اللَّهِ ‏.‏ قَالَ ‏\"‏ قُلْ ‏\"‏ ‏.‏ قَالَ إِنَّ ابْنِي كَانَ عَسِيفًا عَلَى هَذَا فَزَنَى بِامْرَأَتِهِ فَافْتَدَيْتُ مِنْهُ بِمِائَةِ شَاةٍ وَخَادِمٍ - وَكَأَنَّهُ أُخْبِرَ أَنَّ عَلَى ابْنِهِ الرَّجْمَ فَافْتَدَى مِنْهُ - ثُمَّ سَأَلْتُ رِجَالاً مِنْ أَهْلِ الْعِلْمِ فَأَخْبَرُونِي أَنَّ عَلَى ابْنِي جَلْدُ مِائَةٍ وَتَغْرِيبُ عَامٍ ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَالَّذِي نَفْسِي بِيَدِهِ لأَقْضِيَنَّ بَيْنَكُمَا بِكِتَابِ اللَّهِ عَزَّ وَجَلَّ أَمَّا الْمِائَةُ شَاةٍ وَالْخَادِمُ فَرَدٌّ عَلَيْكَ وَعَلَى ابْنِكَ جَلْدُ مِائَةٍ وَتَغْرِيبُ عَامٍ اغْدُ يَا أُنَيْسُ عَلَى امْرَأَةِ هَذَا فَإِنِ اعْتَرَفَتْ فَارْجُمْهَا ‏\"‏ ‏.‏ فَغَدَا عَلَيْهَا فَاعْتَرَفَتْ فَرَجَمَهَا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 5412,
			"arabicnumber": 5412,
			"text": "أَخْبَرَنَا الْحَسَنُ بْنُ أَحْمَدَ الْكَرْمَانِيُّ، قَالَ حَدَّثَنَا أَبُو الرَّبِيعِ، قَالَ حَدَّثَنَا حَمَّادٌ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم أُتِيَ بِامْرَأَةٍ قَدْ زَنَتْ فَقَالَ ‏ \"‏ مِمَّنْ ‏\"‏ ‏.‏ قَالَتْ مِنَ الْمُقْعَدِ الَّذِي فِي حَائِطِ سَعْدٍ ‏.‏ فَأَرْسَلَ إِلَيْهِ فَأُتِيَ بِهِ مَحْمُولاً فَوُضِعَ بَيْنَ يَدَيْهِ فَاعْتَرَفَ فَدَعَا رَسُولُ اللَّهِ صلى الله عليه وسلم بِإِثْكَالٍ فَضَرَبَهُ وَرَحِمَهُ لِزَمَانَتِهِ وَخَفَّفَ عَنْهُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 5413,
			"arabicnumber": 5413,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنَا أَبُو حَازِمٍ، قَالَ سَمِعْتُ سَهْلَ بْنَ سَعْدٍ السَّاعِدِيَّ، يَقُولُ وَقَعَ بَيْنَ حَيَّيْنِ مِنَ الأَنْصَارِ كَلاَمٌ حَتَّى تَرَامَوْا بِالْحِجَارَةِ فَذَهَبَ النَّبِيُّ صلى الله عليه وسلم لِيُصْلِحَ بَيْنَهُمْ فَحَضَرَتِ الصَّلاَةُ فَأَذَّنَ بِلاَلٌ وَانْتُظِرَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَاحْتُبِسَ فَأَقَامَ الصَّلاَةَ وَتَقَدَّمَ أَبُو بَكْرٍ رضى الله عنه فَجَاءَ النَّبِيُّ صلى الله عليه وسلم وَأَبُو بَكْرٍ يُصَلِّي بِالنَّاسِ فَلَمَّا رَآهُ النَّاسُ صَفَّحُوا - وَكَانَ أَبُو بَكْرٍ لاَ يَلْتَفِتُ فِي الصَّلاَةِ - فَلَمَّا سَمِعَ تَصْفِيحَهُمُ الْتَفَتَ فَإِذَا هُوَ بِرَسُولِ اللَّهِ صلى الله عليه وسلم أَرَادَ أَنْ يَتَأَخَّرَ فَأَشَارَ إِلَيْهِ أَنِ اثْبُتْ فَرَفَعَ أَبُو بَكْرٍ رضى الله عنه يَعْنِي يَدَيْهِ ثُمَّ نَكَصَ الْقَهْقَرَى وَتَقَدَّمَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَصَلَّى فَلَمَّا قَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم الصَّلاَةَ قَالَ ‏\"‏ مَا مَنَعَكَ أَنْ تَثْبُتَ ‏\"‏ ‏.‏ قَالَ مَا كَانَ اللَّهُ لِيَرَى ابْنَ أَبِي قُحَافَةَ بَيْنَ يَدَىْ نَبِيِّهِ ‏.‏ ثُمَّ أَقْبَلَ عَلَى النَّاسِ فَقَالَ ‏\"‏ مَا لَكُمْ إِذَا نَابَكُمْ شَىْءٌ فِي صَلاَتِكُمْ صَفَّحْتُمْ إِنَّ ذَلِكَ لِلنِّسَاءِ مَنْ نَابَهُ شَىْءٌ فِي صَلاَتِهِ فَلْيَقُلْ سُبْحَانَ اللَّهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 5414,
			"arabicnumber": 5414,
			"text": "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا شُعَيْبُ بْنُ اللَّيْثِ، عَنْ أَبِيهِ، عَنْ جَعْفَرِ بْنِ رَبِيعَةَ، عَنْ عَبْدِ الرَّحْمَنِ الأَعْرَجِ، عَنْ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍ الأَنْصَارِيِّ، عَنْ كَعْبِ بْنِ مَالِكٍ، أَنَّهُ كَانَ لَهُ عَلَى عَبْدِ اللَّهِ بْنِ أَبِي حَدْرَدٍ الأَسْلَمِيِّ - يَعْنِي دَيْنًا - فَلَقِيَهُ فَلَزِمَهُ فَتَكَلَّمَا حَتَّى ارْتَفَعَتِ الأَصْوَاتُ فَمَرَّ بِهِمَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏ \"‏ يَا كَعْبُ ‏\"‏ ‏.‏ فَأَشَارَ بِيَدِهِ كَأَنَّهُ يَقُولُ النِّصْفَ فَأَخَذَ نِصْفًا مِمَّا عَلَيْهِ وَتَرَكَ نِصْفًا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 5415,
			"arabicnumber": 5415,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ عَوْفٍ، قَالَ حَدَّثَنِي حَمْزَةُ أَبُو عُمَرَ الْعَائِذِيُّ، قَالَ حَدَّثَنَا عَلْقَمَةُ بْنُ وَائِلٍ، عَنْ وَائِلٍ، قَالَ شَهِدْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم حِينَ جَاءَ بِالْقَاتِلِ يَقُودُهُ وَلِيُّ الْمَقْتُولِ فِي نِسْعَةٍ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِوَلِيِّ الْمَقْتُولِ ‏\"‏ أَتَعْفُو ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ فَتَأْخُذُ الدِّيَةَ ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ فَتَقْتُلُهُ ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ قَالَ ‏\"‏ اذْهَبْ بِهِ ‏\"‏ ‏.‏ فَلَمَّا ذَهَبَ فَوَلَّى مِنْ عِنْدِهِ دَعَاهُ فَقَالَ ‏\"‏ أَتَعْفُو ‏\"‏ ‏.‏ قَالَ لاَ قَالَ ‏\"‏ فَتَأْخُذُ الدِّيَةَ ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ فَتَقْتُلُهُ ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ قَالَ ‏\"‏ اذْهَبْ بِهِ ‏\"‏ ‏.‏ فَلَمَّا ذَهَبَ فَوَلَّى مِنْ عِنْدِهِ دَعَاهُ فَقَالَ ‏\"‏ أَتَعْفُو ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ فَتَأْخُذُ الدِّيَةَ ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ فَتَقْتُلُهُ ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ قَالَ ‏\"‏ اذْهَبْ بِهِ ‏\"‏ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم عِنْدَ ذَلِكَ ‏\"‏ أَمَا إِنَّكَ إِنْ عَفَوْتَ عَنْهُ يَبُوءُ بِإِثْمِهِ وَإِثْمِ صَاحِبِكَ ‏\"‏ ‏.‏ فَعَفَا عَنْهُ وَتَرَكَهُ فَأَنَا رَأَيْتُهُ يَجُرُّ نِسْعَتَهُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 5416,
			"arabicnumber": 5416,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، أَنَّهُ حَدَّثَهُ أَنَّ عَبْدَ اللَّهِ بْنَ الزُّبَيْرِ حَدَّثَهُ أَنَّ رَجُلاً مِنَ الأَنْصَارِ خَاصَمَ الزُّبَيْرَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فِي شِرَاجِ الْحَرَّةِ الَّتِي يَسْقُونَ بِهَا النَّخْلَ فَقَالَ الأَنْصَارِيُّ سَرِّحِ الْمَاءَ يَمُرَّ ‏.‏ فَأَبَى عَلَيْهِ فَاخْتَصَمُوا عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اسْقِ يَا زُبَيْرُ ثُمَّ أَرْسِلِ الْمَاءَ إِلَى جَارِكَ ‏\"‏ ‏.‏ فَغَضِبَ الأَنْصَارِيُّ فَقَالَ يَا رَسُولَ اللَّهِ أَنْ كَانَ ابْنَ عَمَّتِكَ فَتَلَوَّنَ وَجْهُ رَسُولِ اللَّهِ صلى الله عليه وسلم ثُمَّ قَالَ ‏\"‏ يَا زُبَيْرُ اسْقِ ثُمَّ احْبِسِ الْمَاءَ حَتَّى يَرْجِعَ إِلَى الْجَدْرِ ‏\"‏ ‏.‏ فَقَالَ الزُّبَيْرُ إِنِّي أَحْسَبُ أَنَّ هَذِهِ الآيَةَ نَزَلَتْ فِي ذَلِكَ ‏{‏ فَلاَ وَرَبِّكَ لاَ يُؤْمِنُونَ ‏}‏ الآيَةَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 5417,
			"arabicnumber": 5417,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا عَبْدُ الْوَهَّابِ، قَالَ حَدَّثَنَا خَالِدٌ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ زَوْجَ، بَرِيرَةَ كَانَ عَبْدًا يُقَالُ لَهُ مُغِيثٌ كَأَنِّي أَنْظُرُ إِلَيْهِ يَطُوفُ خَلْفَهَا يَبْكِي وَدُمُوعُهُ تَسِيلُ عَلَى لِحْيَتِهِ فَقَالَ النَّبِيُّ صلى الله عليه وسلم لِلْعَبَّاسِ ‏\"‏ يَا عَبَّاسُ أَلاَ تَعْجَبُ مِنْ حُبِّ مُغِيثٍ بَرِيرَةَ وَمِنْ بُغْضِ بَرِيرَةَ مُغِيثًا ‏\"‏ ‏.‏ فَقَالَ لَهَا النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لَوْ رَاجَعْتِيهِ فَإِنَّهُ أَبُو وَلَدِكِ ‏\"‏ ‏.‏ قَالَتْ يَا رَسُولَ اللَّهِ أَتَأْمُرُنِي ‏.‏ قَالَ ‏\"‏ إِنَّمَا أَنَا شَفِيعٌ ‏\"‏ ‏.‏ قَالَتْ فَلاَ حَاجَةَ لِي فِيهِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 5418,
			"arabicnumber": 5418,
			"text": "أَخْبَرَنَا عَبْدُ الأَعْلَى بْنُ وَاصِلِ بْنِ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا مُحَاضِرُ بْنُ الْمُوَرِّعِ، قَالَ حَدَّثَنَا الأَعْمَشُ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، عَنْ عَطَاءٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ أَعْتَقَ رَجُلٌ مِنَ الأَنْصَارِ غُلاَمًا لَهُ عَنْ دُبُرٍ وَكَانَ مُحْتَاجًا وَكَانَ عَلَيْهِ دَيْنٌ فَبَاعَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم بِثَمَانِمِائَةِ دِرْهَمٍ فَأَعْطَاهُ فَقَالَ ‏ \"‏ اقْضِ دَيْنَكَ وَأَنْفِقْ عَلَى عِيَالِكَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 5419,
			"arabicnumber": 5419,
			"text": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنَا الْعَلاَءُ، عَنْ مَعْبَدِ بْنِ كَعْبٍ، عَنْ أَخِيهِ عَبْدِ اللَّهِ بْنِ كَعْبٍ، عَنْ أَبِي أُمَامَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنِ اقْتَطَعَ حَقَّ امْرِئٍ مُسْلِمٍ بِيَمِينِهِ فَقَدْ أَوْجَبَ اللَّهُ لَهُ النَّارَ وَحَرَّمَ عَلَيْهِ الْجَنَّةَ ‏\"‏ ‏.‏ فَقَالَ لَهُ رَجُلٌ وَإِنْ كَانَ شَيْئًا يَسِيرًا يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ وَإِنْ كَانَ قَضِيبًا مِنْ أَرَاكٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 5420,
			"arabicnumber": 5420,
			"text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا وَكِيعٌ، قَالَ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ جَاءَتْ هِنْدٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ أَبَا سُفْيَانَ رَجُلٌ شَحِيحٌ وَلاَ يُنْفِقُ عَلَىَّ وَوَلَدِي مَا يَكْفِينِي أَفَآخُذُ مِنْ مَالِهِ وَلاَ يَشْعُرُ قَالَ ‏ \"‏ خُذِي مَا يَكْفِيكِ وَوَلَدَكِ بِالْمَعْرُوفِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 5421,
			"arabicnumber": 5421,
			"text": "أَخْبَرَنَا الْحُسَيْنُ بْنُ مَنْصُورِ بْنِ جَعْفَرٍ، قَالَ حَدَّثَنَا مُبَشِّرُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا سُفْيَانُ بْنُ حُسَيْنٍ، عَنْ جَعْفَرِ بْنِ إِيَاسٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ، - وَكَانَ عَامِلاً عَلَى سِجِسْتَانَ - قَالَ كَتَبَ إِلَىَّ أَبُو بَكْرَةَ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ لاَ يَقْضِيَنَّ أَحَدٌ فِي قَضَاءٍ بِقَضَاءَيْنِ وَلاَ يَقْضِي أَحَدٌ بَيْنَ خَصْمَيْنِ وَهُوَ غَضْبَانُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 5422,
			"arabicnumber": 5422,
			"text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا وَكِيعٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ زَيْنَبَ بِنْتِ أُمِّ سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّكُمْ تَخْتَصِمُونَ إِلَىَّ وَإِنَّمَا أَنَا بَشَرٌ وَلَعَلَّ بَعْضَكُمْ أَلْحَنُ بِحُجَّتِهِ مِنْ بَعْضٍ فَإِنَّمَا أَقْضِي بَيْنَكُمَا عَلَى نَحْوِ مَا أَسْمَعُ فَمَنْ قَضَيْتُ لَهُ مِنْ حَقِّ أَخِيهِ شَيْئًا فَإِنَّمَا أَقْطَعُ لَهُ قِطْعَةً مِنَ النَّارِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 5423,
			"arabicnumber": 5423,
			"text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا وَكِيعٌ، قَالَ حَدَّثَنَا ابْنُ جُرَيْجٍ، ح وَأَنْبَأَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنِي ابْنُ جُرَيْجٍ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّ أَبْغَضَ الرِّجَالِ إِلَى اللَّهِ الأَلَدُّ الْخَصِمُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 5424,
			"arabicnumber": 5424,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا عَبْدُ الأَعْلَى، قَالَ حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ سَعِيدِ بْنِ أَبِي بُرْدَةَ، عَنْ أَبِيهِ، عَنْ أَبِي مُوسَى، أَنَّ رَجُلَيْنِ، اخْتَصَمَا إِلَى النَّبِيِّ صلى الله عليه وسلم فِي دَابَّةٍ لَيْسَ لِوَاحِدٍ مِنْهُمَا بَيِّنَةٌ فَقَضَى بِهَا بَيْنَهُمَا نِصْفَيْنِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 5425,
			"arabicnumber": 5425,
			"text": "أَخْبَرَنَا عَلِيُّ بْنُ سَعِيدِ بْنِ مَسْرُوقٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ أَبِي زَائِدَةَ، عَنْ نَافِعِ بْنِ عُمَرَ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، قَالَ كَانَتْ جَارِيَتَانِ تَخْرُزَانِ بِالطَّائِفِ فَخَرَجَتْ إِحْدَاهُمَا وَيَدُهَا تَدْمَى فَزَعَمَتْ أَنَّ صَاحِبَتَهَا أَصَابَتْهَا وَأَنْكَرَتِ الأُخْرَى فَكَتَبْتُ إِلَى ابْنِ عَبَّاسٍ فِي ذَلِكَ فَكَتَبَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَضَى أَنَّ الْيَمِينَ عَلَى الْمُدَّعَى عَلَيْهِ وَلَوْ أَنَّ النَّاسَ أُعْطُوا بِدَعْوَاهُمْ لاَدَّعَى نَاسٌ أَمْوَالَ نَاسٍ وَدِمَاءَهُمْ فَادْعُهَا وَاتْلُ عَلَيْهَا هَذِهِ الآيَةَ ‏{‏ إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ وَأَيْمَانِهِمْ ثَمَنًا قَلِيلاً أُولَئِكَ لاَ خَلاَقَ لَهُمْ فِي الآخِرَةِ ‏}‏ حَتَّى خَتَمَ الآيَةَ فَدَعَوْتُهَا فَتَلَوْتُ عَلَيْهَا فَاعْتَرَفَتْ بِذَلِكَ فَسَرَّهُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 5426,
			"arabicnumber": 5426,
			"text": "أَخْبَرَنَا سَوَّارُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا مَرْحُومُ بْنُ عَبْدِ الْعَزِيزِ، عَنْ أَبِي نَعَامَةَ، عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ قَالَ مُعَاوِيَةُ رَضِيَ اللَّهُ عَنْهُ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ عَلَى حَلْقَةٍ - يَعْنِي مِنْ أَصْحَابِهِ - فَقَالَ ‏\"‏ مَا أَجْلَسَكُمْ ‏\"‏ ‏.‏ قَالُوا جَلَسْنَا نَدْعُو اللَّهَ وَنَحْمَدُهُ عَلَى مَا هَدَانَا لِدِينِهِ وَمَنَّ عَلَيْنَا بِكَ ‏.‏ قَالَ ‏\"‏ آللَّهِ مَا أَجْلَسَكُمْ إِلاَّ ذَلِكَ ‏\"‏ ‏.‏ قَالُوا آللَّهِ مَا أَجْلَسَنَا إِلاَّ ذَلِكَ ‏.‏ قَالَ ‏\"‏ أَمَا إِنِّي لَمْ أَسْتَحْلِفْكُمْ تُهَمَةً لَكُمْ وَإِنَّمَا أَتَانِي جِبْرِيلُ عَلَيْهِ السَّلاَمُ فَأَخْبَرَنِي أَنَّ اللَّهَ عَزَّ وَجَلَّ يُبَاهِي بِكُمُ الْمَلاَئِكَةَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 5427,
			"arabicnumber": 5427,
			"text": "أَخْبَرَنَا أَحْمَدُ بْنُ حَفْصٍ، قَالَ حَدَّثَنِي أَبِي قَالَ، حَدَّثَنِي إِبْرَاهِيمُ بْنُ طَهْمَانَ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ صَفْوَانَ بْنِ سُلَيْمٍ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ رَأَى عِيسَى ابْنُ مَرْيَمَ عَلَيْهِ السَّلاَمُ رَجُلاً يَسْرِقُ فَقَالَ لَهُ أَسَرَقْتَ قَالَ لاَ وَاللَّهِ الَّذِي لاَ إِلَهَ إِلاَّ هُوَ ‏.‏ قَالَ عِيسَى عَلَيْهِ السَّلاَمُ آمَنْتُ بِاللَّهِ وَكَذَّبْتُ بَصَرِي ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 49
			}
		}
	]
}