{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"51": "The Book of Drinks"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5540,
			"arabicnumber": 5540,
			"text": "أَخْبَرَنَا أَبُو بَكْرٍ، أَحْمَدُ بْنُ مُحَمَّدِ بْنِ إِسْحَاقَ السُّنِّيُّ قِرَاءَةً عَلَيْهِ فِي بَيْتِهِ قَالَ أَنْبَأَنَا الإِمَامُ أَبُو عَبْدِ الرَّحْمَنِ أَحْمَدُ بْنُ شُعَيْبٍ النَّسَائِيُّ رَحِمَهُ اللَّهُ تَعَالَى قَالَ أَنْبَأَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى قَالَ أَنْبَأَنَا إِسْرَائِيلُ عَنْ أَبِي إِسْحَاقَ عَنْ أَبِي مَيْسَرَةَ عَنْ عُمَرَ رضى الله عنه قَالَ لَمَّا نَزَلَ تَحْرِيمُ الْخَمْرِ قَالَ عُمَرُ اللَّهُمَّ بَيِّنْ لَنَا فِي الْخَمْرِ بَيَانًا شَافِيًا‏.‏ فَنَزَلَتِ الآيَةُ الَّتِي فِي الْبَقَرَةِ فَدُعِيَ عُمَرُ فَقُرِئَتْ عَلَيْهِ فَقَالَ عُمَرُ اللَّهُمَّ بَيِّنْ لَنَا فِي الْخَمْرِ بَيَانًا شَافِيًا‏.‏ فَنَزَلَتِ الآيَةُ الَّتِي فِي النِّسَاءِ ‏{‏ يَا أَيُّهَا الَّذِينَ آمَنُوا لاَ تَقْرَبُوا الصَّلاَةَ وَأَنْتُمْ سُكَارَى ‏}‏ فَكَانَ مُنَادِي رَسُولِ اللَّهِ صلى الله عليه وسلم إِذَا أَقَامَ الصَّلاَةَ نَادَى لاَ تَقْرَبُوا الصَّلاَةَ وَأَنْتُمْ سُكَارَى فَدُعِيَ عُمَرُ فَقُرِئَتْ عَلَيْهِ فَقَالَ اللَّهُمَّ بَيِّنْ لَنَا فِي الْخَمْرِ بَيَانًا شَافِيًا‏.‏ فَنَزَلَتِ الآيَةُ الَّتِي فِي الْمَائِدَةِ فَدُعِيَ عُمَرُ فَقُرِئَتْ عَلَيْهِ فَلَمَّا بَلَغَ ‏{‏ فَهَلْ أَنْتُمْ مُنْتَهُونَ ‏}‏ قَالَ عُمَرُ رضى الله عنه انْتَهَيْنَا انْتَهَيْنَا‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 5541,
			"arabicnumber": 5541,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، - يَعْنِي ابْنَ الْمُبَارَكِ - عَنْ سُلَيْمَانَ التَّيْمِيِّ، أَنَّ أَنَسَ بْنَ مَالِكٍ، أَخْبَرَهُمْ قَالَ بَيْنَا أَنَا قَائِمٌ، عَلَى الْحَىِّ وَأَنَا أَصْغَرُهُمْ، سِنًّا عَلَى عُمُومَتِي إِذْ جَاءَ رَجُلٌ فَقَالَ إِنَّهَا قَدْ حُرِّمَتِ الْخَمْرُ‏.‏ وَأَنَا قَائِمٌ عَلَيْهِمْ أَسْقِيهِمْ مِنْ فَضِيخٍ لَهُمْ فَقَالُوا اكْفَأْهَا‏.‏ فَكَفَأْتُهَا فَقُلْتُ لأَنَسٍ مَا هُوَ قَالَ الْبُسْرُ وَالتَّمْرُ‏.‏ قَالَ أَبُو بَكْرِ بْنُ أَنَسٍ كَانَتْ خَمْرُهُمْ يَوْمَئِذٍ فَلَمْ يُنْكِرْ أَنَسٌ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 5542,
			"arabicnumber": 5542,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، - يَعْنِي ابْنَ الْمُبَارَكِ - عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، قَالَ كُنْتُ أَسْقِي أَبَا طَلْحَةَ وَأُبَىَّ بْنَ كَعْبٍ وَأَبَا دُجَانَةَ فِي رَهْطٍ مِنَ الأَنْصَارِ فَدَخَلَ عَلَيْنَا رَجُلٌ فَقَالَ حَدَثَ خَبَرٌ نَزَلَ تَحْرِيمُ الْخَمْرِ‏.‏ فَكَفَأْنَا‏.‏ قَالَ وَمَا هِيَ يَوْمَئِذٍ إِلاَّ الْفَضِيخُ خَلِيطُ الْبُسْرِ وَالتَّمْرِ‏.‏ قَالَ وَقَالَ أَنَسٌ لَقَدْ حُرِّمَتِ الْخَمْرُ وَإِنَّ عَامَّةَ خُمُورِهِمْ يَوْمَئِذٍ الْفَضِيخُ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 5543,
			"arabicnumber": 5543,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ حُمَيْدٍ الطَّوِيلِ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ حُرِّمَتِ الْخَمْرُ حِينَ حُرِّمَتْ وَإِنَّهُ لَشَرَابُهُمُ الْبُسْرُ وَالتَّمْرُ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 5544,
			"arabicnumber": 5544,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ شُعْبَةَ، عَنْ مُحَارِبِ بْنِ دِثَارٍ، عَنْ جَابِرٍ، - يَعْنِي ابْنَ عَبْدِ اللَّهِ - قَالَ الْبُسْرُ وَالتَّمْرُ خَمْرٌ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 5545,
			"arabicnumber": 5545,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ سُفْيَانَ، عَنْ مُحَارِبِ بْنِ دِثَارٍ، قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ، قَالَ الْبُسْرُ وَالتَّمْرُ خَمْرٌ‏.‏ رَفَعَهُ الأَعْمَشُ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 5546,
			"arabicnumber": 5546,
			"text": "أَخْبَرَنَا الْقَاسِمُ بْنُ زَكَرِيَّا، قَالَ أَنْبَأَنَا عُبَيْدُ اللَّهِ، عَنْ شَيْبَانَ، عَنِ الأَعْمَشِ، عَنْ مُحَارِبِ بْنِ دِثَارٍ، عَنْ جَابِرٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ الزَّبِيبُ وَالتَّمْرُ هُوَ الْخَمْرُ ‏\"‏‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 5547,
			"arabicnumber": 5547,
			"text": "أَخْبَرَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، قَالَ أَنْبَأَنَا عَبْدُ الرَّحْمَنِ، عَنْ شُعْبَةَ، عَنِ الْحَكَمِ، عَنِ ابْنِ أَبِي لَيْلَى، عَنْ رَجُلٍ، مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنِ الْبَلَحِ وَالتَّمْرِ وَالزَّبِيبِ وَالتَّمْرِ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 5548,
			"arabicnumber": 5548,
			"text": "أَخْبَرَنَا وَاصِلُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا ابْنُ فُضَيْلٍ، عَنْ حَبِيبِ بْنِ أَبِي عَمْرَةَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الدُّبَّاءِ وَالْحَنْتَمِ وَالْمُزَفَّتِ وَالنَّقِيرِ وَأَنْ يُخْلَطَ الْبَلَحُ وَالزَّهْوُ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 5549,
			"arabicnumber": 5549,
			"text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا جَرِيرٌ، عَنْ حَبِيبِ بْنِ أَبِي عَمْرَةَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الدُّبَّاءِ وَالْمُزَفَّتِ - وَزَادَ مَرَّةً أُخْرَى - وَالنَّقِيرِ وَأَنْ يُخْلَطَ التَّمْرُ بِالزَّبِيبِ وَالزَّهْوُ بِالتَّمْرِ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 5550,
			"arabicnumber": 5550,
			"text": "أَخْبَرَنَا الْحُسَيْنُ بْنُ مَنْصُورِ بْنِ جَعْفَرٍ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، قَالَ حَدَّثَنَا الأَعْمَشُ، عَنْ حَبِيبٍ، عَنْ أَبِي أَرْطَاةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الزَّهْوِ وَالتَّمْرِ وَالزَّبِيبِ وَالتَّمْرِ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 5551,
			"arabicnumber": 5551,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنِ الأَوْزَاعِيِّ، قَالَ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي قَتَادَةَ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ تَجْمَعُوا بَيْنَ التَّمْرِ وَالزَّبِيبِ وَلاَ بَيْنَ الزَّهْوِ وَالرُّطَبِ ‏\"‏‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 5552,
			"arabicnumber": 5552,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، قَالَ حَدَّثَنَا عَلِيٌّ، - وَهُوَ ابْنُ الْمُبَارَكِ - عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي قَتَادَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ تَنْبِذُوا الزَّهْوَ وَالرُّطَبَ جَمِيعًا وَلاَ تَنْبِذُوا الزَّبِيبَ وَالرُّطَبَ جَمِيعًا ‏\"‏‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 5553,
			"arabicnumber": 5553,
			"text": "أَخْبَرَنَا أَحْمَدُ بْنُ حَفْصِ بْنِ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي أَبِي قَالَ، حَدَّثَنِي إِبْرَاهِيمُ، - هُوَ ابْنُ طَهْمَانَ - عَنْ عُمَرَ بْنِ سَعِيدٍ، عَنْ سُلَيْمَانَ، عَنْ مَالِكِ بْنِ الْحَارِثِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُخْلَطَ التَّمْرُ وَالزَّبِيبُ وَأَنْ يُخْلَطَ الزَّهْوُ وَالتَّمْرُ وَالزَّهْوُ وَالْبُسْرُ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 5554,
			"arabicnumber": 5554,
			"text": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، عَنْ يَحْيَى، - وَهُوَ ابْنُ سَعِيدٍ - عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي عَطَاءٌ، عَنْ جَابِرٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنْ خَلِيطِ التَّمْرِ وَالزَّبِيبِ وَالْبُسْرِ وَالرُّطَبِ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 5555,
			"arabicnumber": 5555,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، عَنْ أَبِي دَاوُدَ، قَالَ حَدَّثَنَا بِسْطَامٌ، قَالَ حَدَّثَنَا مَالِكُ بْنُ دِينَارٍ، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ تَخْلِطُوا الزَّبِيبَ وَالتَّمْرَ وَلاَ الْبُسْرَ وَالتَّمْرَ ‏\"‏‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 5556,
			"arabicnumber": 5556,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ نَهَى أَنْ يُنْبَذَ الزَّبِيبُ وَالتَّمْرُ جَمِيعًا وَنَهَى أَنْ يُنْبَذَ الْبُسْرُ وَالتَّمْرُ جَمِيعًا‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 5557,
			"arabicnumber": 5557,
			"text": "أَخْبَرَنَا وَاصِلُ بْنُ عَبْدِ الأَعْلَى، عَنِ ابْنِ فُضَيْلٍ، عَنْ أَبِي إِسْحَاقَ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الدُّبَّاءِ وَالْحَنْتَمِ وَالْمُزَفَّتِ وَالنَّقِيرِ وَعَنِ الْبُسْرِ وَالتَّمْرِ أَنْ يُخْلَطَا وَعَنِ الزَّبِيبِ وَالتَّمْرِ أَنْ يُخْلَطَا وَكَتَبَ إِلَى أَهْلِ هَجَرَ ‏ \"‏ أَنْ لاَ تَخْلِطُوا الزَّبِيبَ وَالتَّمْرَ جَمِيعًا ‏\"‏‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 5558,
			"arabicnumber": 5558,
			"text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا يَزِيدُ، قَالَ أَنْبَأَنَا حُمَيْدٌ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ الْبُسْرُ وَحْدَهُ حَرَامٌ وَمَعَ التَّمْرِ حَرَامٌ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 5559,
			"arabicnumber": 5559,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ آدَمَ، وَعَلِيُّ بْنُ سَعِيدٍ، قَالاَ حَدَّثَنَا عَبْدُ الرَّحِيمِ، عَنْ حَبِيبِ بْنِ أَبِي عَمْرَةَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ خَلِيطِ التَّمْرِ وَالزَّبِيبِ وَعَنِ التَّمْرِ وَالْبُسْرِ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 5560,
			"arabicnumber": 5560,
			"text": "أَخْبَرَنَا قُرَيْشُ بْنُ عَبْدِ الرَّحْمَنِ الْبَاوَرْدِيُّ، عَنْ عَلِيِّ بْنِ الْحَسَنِ، قَالَ أَنْبَأَنَا الْحُسَيْنُ بْنُ وَاقِدٍ، قَالَ حَدَّثَنِي عَمْرُو بْنُ دِينَارٍ، قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ التَّمْرِ وَالزَّبِيبِ وَنَهَى عَنِ التَّمْرِ وَالْبُسْرِ أَنْ يُنْبَذَا جَمِيعًا‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 5561,
			"arabicnumber": 5561,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ هِشَامٍ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ تَنْبِذُوا الزَّهْوَ وَالرُّطَبَ وَلاَ تَنْبِذُوا الرُّطَبَ وَالزَّبِيبَ جَمِيعًا ‏\"‏‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 5562,
			"arabicnumber": 5562,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ نَهَى أَنْ يُنْبَذَ الزَّبِيبُ وَالْبُسْرُ جَمِيعًا وَنَهَى أَنْ يُنْبَذَ الْبُسْرُ وَالرُّطَبُ جَمِيعًا‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 5563,
			"arabicnumber": 5563,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ وِقَاءِ بْنِ إِيَاسٍ، عَنِ الْمُخْتَارِ بْنِ فُلْفُلٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ نَجْمَعَ شَيْئَيْنِ نَبِيذًا يَبْغِي أَحَدُهُمَا عَلَى صَاحِبِهِ ‏.‏ قَالَ وَسَأَلْتُهُ عَنِ الْفَضِيخِ فَنَهَانِي عَنْهُ قَالَ كَانَ يَكْرَهُ الْمُذَنَّبَ مِنَ الْبُسْرِ مَخَافَةَ أَنْ يَكُونَا شَيْئَيْنِ فَكُنَّا نَقْطَعُهُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 5564,
			"arabicnumber": 5564,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، عَنْ هِشَامِ بْنِ حَسَّانَ، عَنْ أَبِي إِدْرِيسَ، قَالَ شَهِدْتُ أَنَسَ بْنَ مَالِكٍ أُتِيَ بِبُسْرٍ مُذَنَّبٍ فَجَعَلَ يَقْطَعُهُ مِنْهُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 5565,
			"arabicnumber": 5565,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، أَنَّهُ كَانَ لاَ يَدَعُ شَيْئًا قَدْ أَرْطَبَ إِلاَّ عَزَلَهُ عَنْ فَضِيخِهِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 5566,
			"arabicnumber": 5566,
			"text": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا خَالِدٌ، - يَعْنِي ابْنَ الْحَارِثِ - قَالَ حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ، عَنْ أَبِي قَتَادَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ تَنْبِذُوا الزَّهْوَ وَالرُّطَبَ جَمِيعًا وَلاَ الْبُسْرَ وَالزَّبِيبَ جَمِيعًا وَانْبِذُوا كُلَّ وَاحِدٍ مِنْهُمَا عَلَى حِدَتِهِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 5567,
			"arabicnumber": 5567,
			"text": "أَخْبَرَنَا يَحْيَى بْنُ دُرُسْتَ، قَالَ حَدَّثَنَا أَبُو إِسْمَاعِيلَ، قَالَ حَدَّثَنَا يَحْيَى، أَنَّ عَبْدَ اللَّهِ بْنَ أَبِي قَتَادَةَ، حَدَّثَهُ عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنْ خَلِيطِ الزَّهْوِ وَالتَّمْرِ وَخَلِيطِ الْبُسْرِ وَالتَّمْرِ وَقَالَ ‏ \"‏ لِتَنْبِذُوا كُلَّ وَاحِدٍ مِنْهُمَا عَلَى حِدَةٍ فِي الأَسْقِيَةِ الَّتِي يُلاَثُ عَلَى أَفْوَاهِهَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 5568,
			"arabicnumber": 5568,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ إِسْمَاعِيلَ بْنِ مُسْلِمٍ الْعَبْدِيِّ، قَالَ حَدَّثَنَا أَبُو الْمُتَوَكِّلِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُخْلَطَ بُسْرٌ بِتَمْرٍ أَوْ زَبِيبٌ بِتَمْرٍ أَوْ زَبِيبٌ بِبُسْرٍ وَقَالَ ‏ \"‏ مَنْ شَرِبَهُ مِنْكُمْ فَلْيَشْرَبْ كُلَّ وَاحِدٍ مِنْهُ فَرْدًا تَمْرًا فَرْدًا أَوْ بُسْرًا فَرْدًا أَوْ زَبِيبًا فَرْدًا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 5569,
			"arabicnumber": 5569,
			"text": "أَخْبَرَنِي أَحْمَدُ بْنُ خَالِدٍ، قَالَ حَدَّثَنَا شُعَيْبُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ مُسْلِمٍ، قَالَ حَدَّثَنَا أَبُو الْمُتَوَكِّلِ النَّاجِيُّ، قَالَ حَدَّثَنِي أَبُو سَعِيدٍ الْخُدْرِيُّ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى أَنْ يَخْلِطَ بُسْرًا بِتَمْرٍ أَوْ زَبِيبًا بِتَمْرٍ أَوْ زَبِيبًا بِبُسْرٍ وَقَالَ ‏ \"‏ مَنْ شَرِبَ مِنْكُمْ فَلْيَشْرَبْ كُلَّ وَاحِدٍ مِنْهُ فَرْدًا ‏\"‏ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ هَذَا أَبُو الْمُتَوَكِّلِ اسْمُهُ عَلِيُّ بْنُ دَاوُدَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 5570,
			"arabicnumber": 5570,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ عِكْرِمَةَ بْنِ عَمَّارٍ، قَالَ حَدَّثَنَا أَبُو كَثِيرٍ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُخْلَطَ الْبُسْرُ وَالزَّبِيبُ وَالْبُسْرُ وَالتَّمْرُ وَقَالَ ‏ \"‏ انْبِذُوا كُلَّ وَاحِدٍ مِنْهُمَا عَلَى حِدَةٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 5571,
			"arabicnumber": 5571,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَمَّارٍ، قَالَ حَدَّثَنَا الْمُعَافَى، - يَعْنِي ابْنَ عِمْرَانَ - عَنْ إِسْمَاعِيلَ بْنِ مُسْلِمٍ، عَنْ أَبِي الْمُتَوَكِّلِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى أَنْ يُنْبَذَ التَّمْرُ وَالزَّبِيبُ وَالتَّمْرُ وَالْبُسْرُ وَقَالَ ‏ \"‏ انْتَبِذُوا الزَّبِيبَ فَرْدًا وَالتَّمْرَ فَرْدًا وَالْبُسْرَ فَرْدًا ‏\"‏ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ أَبُو كَثِيرٍ اسْمُهُ يَزِيدُ بْنُ عَبْدِ الرَّحْمَنِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 5572,
			"arabicnumber": 5572,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنِ الأَوْزَاعِيِّ، قَالَ حَدَّثَنِي أَبُو كَثِيرٍ، ح وَأَنْبَأَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، عَنْ سُفْيَانَ بْنِ حَبِيبٍ، عَنِ الأَوْزَاعِيِّ، قَالَ حَدَّثَنَا أَبُو كَثِيرٍ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ الْخَمْرُ مِنْ هَاتَيْنِ ‏\"‏ ‏.‏ وَقَالَ سُوَيْدٌ فِي هَاتَيْنِ الشَّجَرَتَيْنِ النَّخْلَةُ وَالْعِنَبَةُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 5573,
			"arabicnumber": 5573,
			"text": "أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ، قَالَ حَدَّثَنَا ابْنُ عُلَيَّةَ، قَالَ حَدَّثَنَا الْحَجَّاجُ الصَّوَّافُ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، قَالَ حَدَّثَنِي أَبُو كَثِيرٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ الْخَمْرُ مِنْ هَاتَيْنِ الشَّجَرَتَيْنِ النَّخْلَةُ وَالْعِنَبَةُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 5574,
			"arabicnumber": 5574,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، عَنْ شَرِيكٍ، عَنْ مُغِيرَةَ، عَنْ إِبْرَاهِيمَ، وَالشَّعْبِيِّ، قَالاَ السَّكَرُ خَمْرٌ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 5575,
			"arabicnumber": 5575,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ سُفْيَانَ، عَنْ حَبِيبِ بْنِ أَبِي عَمْرَةَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ السَّكَرُ خَمْرٌ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 5576,
			"arabicnumber": 5576,
			"text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا جَرِيرٌ، عَنْ حَبِيبٍ، - وَهُوَ ابْنُ أَبِي عَمْرَةَ - عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ السَّكَرُ خَمْرٌ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 5577,
			"arabicnumber": 5577,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ سُفْيَانَ، عَنْ أَبِي حَصِينٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ السَّكَرُ حَرَامٌ وَالرِّزْقُ الْحَسَنُ حَلاَلٌ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 5578,
			"arabicnumber": 5578,
			"text": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا ابْنُ عُلَيَّةَ، قَالَ حَدَّثَنَا أَبُو حَيَّانَ، قَالَ حَدَّثَنَا الشَّعْبِيُّ، عَنِ ابْنِ عُمَرَ، قَالَ سَمِعْتُ عُمَرَ، رضى الله عنه يَخْطُبُ عَلَى مِنْبَرِ الْمَدِينَةِ فَقَالَ أَيُّهَا النَّاسُ أَلاَ إِنَّهُ نَزَلَ تَحْرِيمُ الْخَمْرِ يَوْمَ نَزَلَ وَهِيَ مِنْ خَمْسَةٍ مِنَ الْعِنَبِ وَالتَّمْرِ وَالْعَسَلِ وَالْحِنْطَةِ وَالشَّعِيرِ وَالْخَمْرُ مَا خَامَرَ الْعَقْلَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 5579,
			"arabicnumber": 5579,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، قَالَ أَنْبَأَنَا ابْنُ إِدْرِيسَ، عَنْ زَكَرِيَّا، وَأَبِي، حَيَّانَ عَنِ الشَّعْبِيِّ، عَنِ ابْنِ عُمَرَ، قَالَ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ، رضى الله عنه عَلَى مِنْبَرِ رَسُولِ اللَّهِ صلى الله عليه وسلم يَقُولُ أَمَّا بَعْدُ فَإِنَّ الْخَمْرَ نَزَلَ تَحْرِيمُهَا وَهِيَ مِنْ خَمْسَةٍ مِنَ الْعِنَبِ وَالْحِنْطَةِ وَالشَّعِيرِ وَالتَّمْرِ وَالْعَسَلِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 5580,
			"arabicnumber": 5580,
			"text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ إِسْرَائِيلَ، عَنْ أَبِي حَصِينٍ، عَنْ عَامِرٍ، عَنِ ابْنِ عُمَرَ، قَالَ الْخَمْرُ مِنْ خَمْسَةٍ مِنَ التَّمْرِ وَالْحِنْطَةِ وَالشَّعِيرِ وَالْعَسَلِ وَالْعِنَبِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 5581,
			"arabicnumber": 5581,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ، عَنِ ابْنِ عَوْنٍ، عَنِ ابْنِ سِيرِينَ، قَالَ جَاءَ رَجُلٌ إِلَى ابْنِ عُمَرَ فَقَالَ إِنَّ أَهْلَنَا يَنْبِذُونَ لَنَا شَرَابًا عَشِيًّا فَإِذَا أَصْبَحْنَا شَرِبْنَا ‏.‏ قَالَ أَنْهَاكَ عَنِ الْمُسْكِرِ قَلِيلِهِ وَكَثِيرِهِ وَأُشْهِدُ اللَّهَ عَلَيْكَ أَنْهَاكَ عَنِ الْمُسْكِرِ قَلِيلِهِ وَكَثِيرِهِ وَأُشْهِدُ اللَّهَ عَلَيْكَ إِنَّ أَهْلَ خَيْبَرَ يَنْتَبِذُونَ شَرَابًا مِنْ كَذَا وَكَذَا وَيُسَمُّونَهُ كَذَا وَكَذَا وَهِيَ الْخَمْرُ وَإِنَّ أَهْلَ فَدَكٍ يَنْتَبِذُونَ شَرَابًا مِنْ كَذَا وَكَذَا يُسَمُّونَهُ كَذَا وَكَذَا وَهِيَ الْخَمْرُ حَتَّى عَدَّ أَشْرِبَةً أَرْبَعَةً أَحَدُهَا الْعَسَلُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 5582,
			"arabicnumber": 5582,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، عَنْ حَمَّادِ بْنِ زَيْدٍ، قَالَ حَدَّثَنَا أَيُّوبُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ كُلُّ مُسْكِرٍ حَرَامٌ وَكُلُّ مُسْكِرٍ خَمْرٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 5583,
			"arabicnumber": 5583,
			"text": "أَخْبَرَنَا الْحُسَيْنُ بْنُ مَنْصُورِ بْنِ جَعْفَرٍ، قَالَ حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ كُلُّ مُسْكِرٍ حَرَامٌ وَكُلُّ مُسْكِرٍ خَمْرٌ ‏\"‏ ‏.‏ قَالَ الْحُسَيْنُ قَالَ أَحْمَدُ وَهَذَا حَدِيثٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 5584,
			"arabicnumber": 5584,
			"text": "أَخْبَرَنَا يَحْيَى بْنُ دُرُسْتَ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ كُلُّ مُسْكِرٍ خَمْرٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 5585,
			"arabicnumber": 5585,
			"text": "أَخْبَرَنَا عَلِيُّ بْنُ مَيْمُونٍ، قَالَ حَدَّثَنَا ابْنُ أَبِي رَوَّادٍ، قَالَ حَدَّثَنَا ابْنُ جُرَيْجٍ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ كُلُّ مُسْكِرٍ خَمْرٌ وَكُلُّ مُسْكِرٍ حَرَامٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 5586,
			"arabicnumber": 5586,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ مُحَمَّدِ بْنِ عَجْلاَنَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ كُلُّ مُسْكِرٍ حَرَامٌ وَكُلُّ مُسْكِرٍ خَمْرٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 5587,
			"arabicnumber": 5587,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ كُلُّ مُسْكِرٍ حَرَامٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 5588,
			"arabicnumber": 5588,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ كُلُّ مُسْكِرٍ حَرَامٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 5589,
			"arabicnumber": 5589,
			"text": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، عَنْ إِسْمَاعِيلَ، عَنْ مُحَمَّدٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى أَنْ يُنْبَذَ فِي الدُّبَّاءِ وَالْمُزَفَّتِ وَالنَّقِيرِ وَالْحَنْتَمِ ‏ \"‏ وَكُلُّ مُسْكِرٍ حَرَامٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 5590,
			"arabicnumber": 5590,
			"text": "أَخْبَرَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا ابْنُ زَبْرٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ تَنْبِذُوا فِي الدُّبَّاءِ وَلاَ الْمُزَفَّتِ وَلاَ النَّقِيرِ وَكُلُّ مُسْكِرٍ حَرَامٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 5591,
			"arabicnumber": 5591,
			"text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَقُتَيْبَةُ، عَنْ سُفْيَانَ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ كُلُّ شَرَابٍ أَسْكَرَ فَهُوَ حَرَامٌ ‏\"‏ ‏.‏ قَالَ قُتَيْبَةُ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 5592,
			"arabicnumber": 5592,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، ح وَأَنْبَأَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ، رَضِيَ اللَّهُ عَنْهَا أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم سُئِلَ عَنِ الْبِتْعِ فَقَالَ ‏ \"‏ كُلُّ شَرَابٍ أَسْكَرَ حَرَامٌ ‏\"‏ ‏.‏ اللَّفْظُ لِسُوَيْدٍ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 5593,
			"arabicnumber": 5593,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ، رضى اللَّهُ عَنْهَا أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم سُئِلَ عَنِ الْبِتْعِ فَقَالَ ‏ \"‏ كُلُّ شَرَابٍ أَسْكَرَ فَهُوَ حَرَامٌ وَالْبِتْعُ مِنَ الْعَسَلِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 5594,
			"arabicnumber": 5594,
			"text": "أَخْبَرَنَا عَلِيُّ بْنُ مَيْمُونٍ، قَالَ حَدَّثَنَا بِشْرُ بْنُ السَّرِيِّ، عَنْ عَبْدِ الرَّزَّاقِ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ، رضى الله عنها أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم سُئِلَ عَنِ الْبِتْعِ فَقَالَ ‏ \"‏ كُلُّ شَرَابٍ أَسْكَرَ فَهُوَ حَرَامٌ ‏\"‏ ‏.‏ وَالْبِتْعُ هُوَ نَبِيذُ الْعَسَلِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 5595,
			"arabicnumber": 5595,
			"text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ سُوَيْدِ بْنِ مَنْجُوفٍ، وَعَبْدُ اللَّهِ بْنُ الْهَيْثَمِ، عَنْ أَبِي دَاوُدَ، عَنْ شُعْبَةَ، عَنْ سَعِيدِ بْنِ أَبِي بُرْدَةَ، عَنْ أَبِيهِ، عَنْ أَبِي مُوسَى، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ كُلُّ مُسْكِرٍ حَرَامٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 5596,
			"arabicnumber": 5596,
			"text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ عَلِيٍّ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، عَنْ إِسْرَائِيلَ، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِيهِ، قَالَ بَعَثَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم أَنَا وَمُعَاذٌ إِلَى الْيَمَنِ فَقَالَ مُعَاذٌ إِنَّكَ تَبْعَثُنَا إِلَى أَرْضٍ كَثِيرٌ شَرَابُ أَهْلِهَا فَمَا أَشْرَبُ قَالَ ‏ \"‏ اشْرَبْ وَلاَ تَشْرَبْ مُسْكِرًا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 5597,
			"arabicnumber": 5597,
			"text": "أَخْبَرَنَا يَحْيَى بْنُ مُوسَى الْبَلْخِيُّ، قَالَ حَدَّثَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا حَرِيشُ بْنُ سُلَيْمٍ، قَالَ حَدَّثَنَا طَلْحَةُ الأَيَامِيُّ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ كُلُّ مُسْكِرٍ حَرَامٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 5598,
			"arabicnumber": 5598,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، قَالَ أَنْبَأَنَا الأَسْوَدُ بْنُ شَيْبَانَ السَّدُوسِيُّ، قَالَ سَمِعْتُ عَطَاءً، سَأَلَهُ رَجُلٌ فَقَالَ إِنَّا نَرْكَبُ أَسْفَارًا فَتُبْرَزُ لَنَا الأَشْرِبَةُ فِي الأَسْوَاقِ لاَ نَدْرِي أَوْعِيَتَهَا ‏.‏ فَقَالَ كُلُّ مُسْكِرٍ حَرَامٌ ‏.‏ فَذَهَبَ يُعِيدُ فَقَالَ كُلُّ مُسْكِرٍ حَرَامٌ ‏.‏ فَذَهَبَ يُعِيدُ فَقَالَ هُوَ مَا أَقُولُ لَكَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 5599,
			"arabicnumber": 5599,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ هَارُونَ بْنِ إِبْرَاهِيمَ، عَنِ ابْنِ سِيرِينَ، قَالَ كُلُّ مُسْكِرٍ حَرَامٌ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "-"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 5600,
			"arabicnumber": 5600,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ عَبْدِ الْمَلِكِ بْنِ الطُّفَيْلِ الْجَزَرِيِّ، قَالَ كَتَبَ إِلَيْنَا عُمَرُ بْنُ عَبْدِ الْعَزِيزِ لاَ تَشْرَبُوا مِنَ الطِّلاَءِ حَتَّى يَذْهَبَ ثُلُثَاهُ وَيَبْقَى ثُلُثُهُ وَكُلُّ مُسْكِرٍ حَرَامٌ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad Maqtu"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 5601,
			"arabicnumber": 5601,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنِ الصَّعْقِ بْنِ حَزْنٍ، قَالَ كَتَبَ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ إِلَى عَدِيِّ بْنِ أَرْطَاةَ كُلُّ مُسْكِرٍ حَرَامٌ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 5602,
			"arabicnumber": 5602,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا حَرِيشُ بْنُ سُلَيْمٍ، قَالَ حَدَّثَنَا طَلْحَةُ بْنُ مُصَرِّفٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ كُلُّ مُسْكِرٍ حَرَامٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 5603,
			"arabicnumber": 5603,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنِ الأَجْلَحِ، قَالَ حَدَّثَنِي أَبُو بَكْرِ بْنُ أَبِي مُوسَى، عَنْ أَبِيهِ، قَالَ بَعَثَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى الْيَمَنِ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّ بِهَا أَشْرِبَةً فَمَا أَشْرَبُ وَمَا أَدَعُ قَالَ ‏\"‏ وَمَا هِيَ ‏\"‏ ‏.‏ قُلْتُ الْبِتْعُ وَالْمِزْرُ ‏.‏ قَالَ ‏\"‏ وَمَا الْبِتْعُ وَالْمِزْرُ ‏\"‏ ‏.‏ قُلْتُ أَمَّا الْبِتْعُ فَنَبِيذُ الْعَسَلِ وَأَمَّا الْمِزْرُ فَنَبِيذُ الذُّرَةِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ تَشْرَبْ مُسْكِرًا فَإِنِّي حَرَّمْتُ كُلَّ مُسْكِرٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 5604,
			"arabicnumber": 5604,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ آدَمَ بْنِ سُلَيْمَانَ، عَنِ ابْنِ فُضَيْلٍ، عَنِ الشَّيْبَانِيِّ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِيهِ، قَالَ بَعَثَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى الْيَمَنِ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّ بِهَا أَشْرِبَةً يُقَالُ لَهَا الْبِتْعُ وَالْمِزْرُ قَالَ ‏\"‏ وَمَا الْبِتْعُ وَالْمِزْرُ ‏\"‏ ‏.‏ قُلْتُ شَرَابٌ يَكُونُ مِنَ الْعَسَلِ وَالْمِزْرُ يَكُونُ مِنَ الشَّعِيرِ ‏.‏ قَالَ ‏\"‏ كُلُّ مُسْكِرٍ حَرَامٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 5605,
			"arabicnumber": 5605,
			"text": "أَخْبَرَنَا أَبُو بَكْرِ بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ، قَالَ أَخْبَرَنِي أَبِي قَالَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ نَافِعٍ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ، قَالَ خَطَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَذَكَرَ آيَةَ الْخَمْرِ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ أَرَأَيْتَ الْمِزْرَ قَالَ ‏\"‏ وَمَا الْمِزْرُ ‏\"‏ ‏.‏ قَالَ حَبَّةٌ تُصْنَعُ بِالْيَمَنِ ‏.‏ فَقَالَ ‏\"‏ تُسْكِرُ ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ قَالَ ‏\"‏ كُلُّ مُسْكِرٍ حَرَامٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 5606,
			"arabicnumber": 5606,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي الْجُوَيْرِيَةِ، قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ، وَسُئِلَ، فَقِيلَ لَهُ أَفْتِنَا فِي الْبَاذَقِ ‏.‏ فَقَالَ سَبَقَ مُحَمَّدٌ الْبَاذَقَ وَمَا أَسْكَرَ فَهُوَ حَرَامٌ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 5607,
			"arabicnumber": 5607,
			"text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا يَحْيَى، - يَعْنِي ابْنَ سَعِيدٍ - عَنْ عُبَيْدِ اللَّهِ، قَالَ حَدَّثَنَا عَمْرُو بْنُ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَا أَسْكَرَ كَثِيرُهُ فَقَلِيلُهُ حَرَامٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 5608,
			"arabicnumber": 5608,
			"text": "أَخْبَرَنَا حُمَيْدُ بْنُ مَخْلَدٍ، قَالَ حَدَّثَنَا سَعِيدُ بْنُ الْحَكَمِ، قَالَ أَنْبَأَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ حَدَّثَنِي الضَّحَّاكُ بْنُ عُثْمَانَ، عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الأَشَجِّ، عَنْ عَامِرِ بْنِ سَعْدٍ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ أَنْهَاكُمْ عَنْ قَلِيلِ مَا أَسْكَرَ كَثِيرُهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 5609,
			"arabicnumber": 5609,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَمَّارٍ، قَالَ حَدَّثَنَا الْوَلِيدُ بْنُ كَثِيرٍ، عَنِ الضَّحَّاكِ بْنِ عُثْمَانَ، عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الأَشَجِّ، عَنْ عَامِرِ بْنِ سَعْدٍ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنْ قَلِيلِ مَا أَسْكَرَ كَثِيرُهُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 5610,
			"arabicnumber": 5610,
			"text": "أَخْبَرَنَا هِشَامُ بْنُ عَمَّارٍ، قَالَ حَدَّثَنَا صَدَقَةُ بْنُ خَالِدٍ، عَنْ زَيْدِ بْنِ وَاقِدٍ، أَخْبَرَنِي خَالِدُ بْنُ عَبْدِ اللَّهِ بْنِ حُسَيْنٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ عَلِمْتُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَصُومُ فَتَحَيَّنْتُ فِطْرَهُ بِنَبِيذٍ صَنَعْتُهُ لَهُ فِي دُبَّاءٍ فَجِئْتُهُ بِهِ فَقَالَ ‏\"‏ أَدْنِهِ ‏\"‏ ‏.‏ فَأَدْنَيْتُهُ مِنْهُ فَإِذَا هُوَ يَنِشُّ فَقَالَ ‏\"‏ اضْرِبْ بِهَذَا الْحَائِطَ فَإِنَّ هَذَا شَرَابُ مَنْ لاَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ ‏\"‏ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ وَفِي هَذَا دَلِيلٌ عَلَى تَحْرِيمِ السَّكَرِ قَلِيلِهِ وَكَثِيرِهِ وَلَيْسَ كَمَا يَقُولُ الْمُخَادِعُونَ لأَنْفُسِهِمْ بِتَحْرِيمِهِمْ آخِرِ الشَّرْبَةِ وَتَحْلِيلِهِمْ مَا تَقَدَّمَهَا الَّذِي يُشْرَبُ فِي الْفَرَقِ قَبْلَهَا وَلاَ خِلاَفَ بَيْنَ أَهْلِ الْعِلْمِ أَنَّ السُّكْرَ بِكُلِّيَّتِهِ لاَ يَحْدُثُ عَلَى الشَّرْبَةِ الآخِرَةِ دُونَ الأُولَى وَالثَّانِيَةِ بَعْدَهَا وَبِاللَّهِ التَّوْفِيقُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 5611,
			"arabicnumber": 5611,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ، قَالَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ، قَالَ حَدَّثَنَا عَمَّارُ بْنُ رُزَيْقٍ، عَنْ أَبِي إِسْحَاقَ، عَنْ صَعْصَعَةَ بْنِ صُوحَانَ، عَنْ عَلِيٍّ، كَرَّمَ اللَّهُ وَجْهَهُ قَالَ نَهَانِي النَّبِيُّ صلى الله عليه وسلم عَنْ حَلْقَةِ الذَّهَبِ وَالْقَسِّيِّ وَالْمِيثَرَةِ وَالْجِعَةِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 5612,
			"arabicnumber": 5612,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا عَبْدُ الْوَاحِدِ، عَنْ إِسْمَاعِيلَ، - وَهُوَ ابْنُ سُمَيْعٍ - قَالَ حَدَّثَنِي مَالِكُ بْنُ عُمَيْرٍ، قَالَ قَالَ صَعْصَعَةُ لِعَلِيِّ بْنِ أَبِي طَالِبٍ كَرَّمَ اللَّهُ وَجْهَهُ انْهَنَا يَا أَمِيرَ الْمُؤْمِنِينَ عَمَّا نَهَاكَ عَنْهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏ قَالَ نَهَانِي رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الدُّبَّاءِ وَالْحَنْتَمِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 5613,
			"arabicnumber": 5613,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُنْبَذُ لَهُ فِي تَوْرٍ مِنْ حِجَارَةٍ ‏.‏ ذِكْرُ الأَوْعِيَةِ الَّتِي نُهِيَ عَنْ الاِنْتِبَاذِ فِيهَا دُونَ مَا سِوَاهَا مِمَّا لاَ تَشْتَدُّ أَشْرِبَتُهَا كَاشْتِدَادِهِ فِيهَا",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 5614,
			"arabicnumber": 5614,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ سُلَيْمَانَ التَّيْمِيِّ، عَنْ طَاوُسٍ، قَالَ قَالَ رَجُلٌ لاِبْنِ عُمَرَ أَنَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ نَبِيذِ الْجَرِّ قَالَ نَعَمْ ‏.‏ قَالَ طَاوُسٌ وَاللَّهِ إِنِّي سَمِعْتُهُ مِنْهُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 5615,
			"arabicnumber": 5615,
			"text": "أَخْبَرَنَا هَارُونُ بْنُ زَيْدِ بْنِ يَزِيدَ بْنِ أَبِي الزَّرْقَاءِ، قَالَ حَدَّثَنِي أَبِي قَالَ، حَدَّثَنَا شُعْبَةُ، عَنْ سُلَيْمَانَ التَّيْمِيِّ، وَإِبْرَاهِيمَ بْنِ مَيْسَرَةَ، قَالاَ سَمِعْنَا طَاوُسًا، يَقُولُ جَاءَ رَجُلٌ إِلَى ابْنِ عُمَرَ قَالَ أَنَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ نَبِيذِ الْجَرِّ قَالَ نَعَمْ ‏.‏ زَادَ إِبْرَاهِيمُ فِي حَدِيثِهِ وَالدُّبَّاءِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 5616,
			"arabicnumber": 5616,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ، عَنْ عُيَيْنَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، قَالَ قَالَ ابْنُ عَبَّاسٍ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ نَبِيذِ الْجَرِّ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 5617,
			"arabicnumber": 5617,
			"text": "أَخْبَرَنَا عَلِيُّ بْنُ الْحُسَيْنِ، قَالَ حَدَّثَنَا أُمَيَّةُ، عَنْ شُعْبَةَ، عَنْ جَبَلَةَ بْنِ سُحَيْمٍ، عَنِ ابْنِ عُمَرَ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْحَنْتَمِ قُلْتُ مَا الْحَنْتَمُ قَالَ الْجَرُّ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 5618,
			"arabicnumber": 5618,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي مَسْلَمَةَ، قَالَ سَمِعْتُ عَبْدَ الْعَزِيزِ، - يَعْنِي ابْنَ أَسِيدٍ الطَّاحِيَّ بَصْرِيٌّ - يَقُولُ سُئِلَ ابْنُ الزُّبَيْرِ عَنْ نَبِيذِ الْجَرِّ، قَالَ نَهَانَا عَنْهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 5619,
			"arabicnumber": 5619,
			"text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ عَلِيِّ بْنِ سُوَيْدِ بْنِ مَنْجُوفٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ هِشَامِ بْنِ أَبِي عَبْدِ اللَّهِ، عَنْ أَيُّوبَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ سَأَلْنَا ابْنَ عُمَرَ عَنْ نَبِيذِ الْجَرِّ، فَقَالَ حَرَّمَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏ فَأَتَيْتُ ابْنَ عَبَّاسٍ فَقُلْتُ سَمِعْتُ الْيَوْمَ شَيْئًا عَجِبْتُ مِنْهُ ‏.‏ قَالَ مَا هُوَ قُلْتُ سَأَلْتُ ابْنَ عُمَرَ عَنْ نَبِيذِ الْجَرِّ فَقَالَ حَرَّمَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏ فَقَالَ صَدَقَ ابْنُ عُمَرَ ‏.‏ قُلْتُ مَا الْجَرُّ قَالَ كُلُّ شَىْءٍ مِنْ مَدَرٍ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 5620,
			"arabicnumber": 5620,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ زُرَارَةَ، أَنْبَأَنَا إِسْمَاعِيلُ، عَنْ أَيُّوبَ، عَنْ رَجُلٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ كُنْتُ عِنْدَ ابْنِ عُمَرَ فَسُئِلَ عَنْ نَبِيذِ الْجَرِّ، فَقَالَ حَرَّمَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏ وَشَقَّ عَلَىَّ لَمَّا سَمِعْتُهُ فَأَتَيْتُ ابْنَ عَبَّاسٍ فَقُلْتُ إِنَّ ابْنَ عُمَرَ سُئِلَ عَنْ شَىْءٍ فَجَعَلْتُ أُعَظِّمُهُ ‏.‏ قَالَ مَا هُوَ قُلْتُ سُئِلَ عَنْ نَبِيذِ الْجَرِّ ‏.‏ فَقَالَ صَدَقَ حَرَّمَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏ قُلْتُ وَمَا الْجَرُّ قَالَ كُلُّ شَىْءٍ صُنِعَ مِنْ مَدَرٍ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 5621,
			"arabicnumber": 5621,
			"text": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا أَبُو دَاوُدَ، قَالَ أَنْبَأَنَا شُعْبَةُ، عَنِ الشَّيْبَانِيِّ، قَالَ سَمِعْتُ ابْنَ أَبِي أَوْفَى، يَقُولُ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ نَبِيذِ الْجَرِّ الأَخْضَرِ ‏.‏ قُلْتُ فَالأَبْيَضُ قَالَ لاَ أَدْرِي ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 5622,
			"arabicnumber": 5622,
			"text": "أَخْبَرَنَا أَبُو عَبْدِ الرَّحْمَنِ، قَالَ أَنْبَأَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنَا أَبُو إِسْحَاقَ الشَّيْبَانِيُّ، قَالَ سَمِعْتُ ابْنَ أَبِي أَوْفَى، يَقُولُ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ نَبِيذِ الْجَرِّ الأَخْضَرِ وَالأَبْيَضِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 5623,
			"arabicnumber": 5623,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا مُحَمَّدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي رَجَاءٍ، قَالَ سَأَلْتُ الْحَسَنَ عَنْ نَبِيذِ الْجَرِّ، أَحَرَامٌ هُوَ قَالَ حَرَامٌ قَدْ حَدَّثَنَا مَنْ لَمْ يَكْذِبْ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ نَبِيذِ الْحَنْتَمِ وَالدُّبَّاءِ وَالْمُزَفَّتِ وَالنَّقِيرِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 5624,
			"arabicnumber": 5624,
			"text": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ إِبْرَاهِيمَ بْنِ مَيْسَرَةَ، عَنْ طَاوُسٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الدُّبَّاءِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 5625,
			"arabicnumber": 5625,
			"text": "أَخْبَرَنَا جَعْفَرُ بْنُ مُسَافِرٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ حَسَّانَ، قَالَ حَدَّثَنَا وُهَيْبٌ، قَالَ حَدَّثَنَا ابْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الدُّبَّاءِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 5626,
			"arabicnumber": 5626,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، وَحَمَّادٍ، وَسُلَيْمَانَ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الدُّبَّاءِ وَالْمُزَفَّتِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 5627,
			"arabicnumber": 5627,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ سُفْيَانَ، عَنْ سُلَيْمَانَ، عَنْ إِبْرَاهِيمَ التَّيْمِيِّ، عَنِ الْحَارِثِ بْنِ سُوَيْدٍ، عَنْ عَلِيٍّ، كَرَّمَ اللَّهُ وَجْهَهُ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ نَهَى عَنِ الدُّبَّاءِ وَالْمُزَفَّتِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 5628,
			"arabicnumber": 5628,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ أَبَانَ، قَالَ حَدَّثَنَا شَبَابَةُ بْنُ سَوَّارٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ بُكَيْرِ بْنِ عَطَاءٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَعْمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم نَهَى عَنِ الدُّبَّاءِ، وَالْمُزَفَّتِ، ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 5629,
			"arabicnumber": 5629,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّهُ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الدُّبَّاءِ وَالْمُزَفَّتِ أَنْ يُنْبَذَ فِيهِمَا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 5630,
			"arabicnumber": 5630,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنَا الزُّهْرِيُّ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الدُّبَّاءِ وَالْمُزَفَّتِ أَنْ يُنْبَذَ فِيهِمَا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 5631,
			"arabicnumber": 5631,
			"text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، قَالَ أَخْبَرَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْمُزَفَّتِ وَالْقَرْعِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 5632,
			"arabicnumber": 5632,
			"text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ الْحَكَمِ بْنِ فَرْوَةَ، - يُقَالُ لَهُ ابْنُ كُرْدِيٍّ بَصْرِيٌّ - قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الْخَالِقِ الشَّيْبَانِيِّ، قَالَ سَمِعْتُ سَعِيدًا، يُحَدِّثُ عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الدُّبَّاءِ وَالْحَنْتَمِ وَالنَّقِيرِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 5633,
			"arabicnumber": 5633,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنِ الْمُثَنَّى بْنِ سَعِيدٍ، عَنْ أَبِي الْمُتَوَكِّلِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الشُّرْبِ فِي الْحَنْتَمِ وَالدُّبَّاءِ وَالنَّقِيرِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 5634,
			"arabicnumber": 5634,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ شُعْبَةَ، عَنْ مُحَارِبٍ، قَالَ سَمِعْتُ ابْنَ عُمَرَ، يَقُولُ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الدُّبَّاءِ وَالْحَنْتَمِ وَالْمُزَفَّتِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 5635,
			"arabicnumber": 5635,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنِ الأَوْزَاعِيِّ، قَالَ حَدَّثَنِي يَحْيَى، حَدَّثَنِي أَبُو سَلَمَةَ، قَالَ حَدَّثَنِي أَبُو هُرَيْرَةَ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْجِرَارِ وَالدُّبَّاءِ وَالظُّرُوفِ الْمُزَفَّتَةِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 5636,
			"arabicnumber": 5636,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ عَوْنِ بْنِ صَالِحٍ الْبَارِقِيِّ، عَنْ زَيْنَبَ بِنْتِ نَصْرٍ، وَجُمَيْلَةَ بِنْتِ عَبَّادٍ، أَنَّهُمَا سَمِعَتَا عَائِشَةَ، قَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَنْهَى عَنْ شَرَابٍ صُنِعَ فِي دُبُّاءٍ أَوْ حَنْتَمٍ أَوْ مُزَفَّتٍ لاَ يَكُونُ زَيْتًا أَوْ خَلاًّ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 5637,
			"arabicnumber": 5637,
			"text": "أَخْبَرَنَا قُرَيْشُ بْنُ عَبْدِ الرَّحْمَنِ، قَالَ أَنْبَأَنَا عَلِيُّ بْنُ الْحَسَنِ، قَالَ أَنْبَأَنَا الْحُسَيْنُ، قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ زِيَادٍ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الدُّبَّاءِ وَالْحَنْتَمِ وَالنَّقِيرِ وَالْمُزَفَّتِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 5638,
			"arabicnumber": 5638,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنِ الْقَاسِمِ بْنِ الْفَضْلِ، قَالَ حَدَّثَنَا ثُمَامَةُ بْنُ حَزْنٍ الْقُشَيْرِيُّ، قَالَ لَقِيتُ عَائِشَةَ فَسَأَلْتُهَا عَنِ النَّبِيذِ، فَقَالَتْ قَدِمَ وَفْدُ عَبْدِ الْقَيْسِ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَسَأَلُوهُ فِيمَا يَنْبِذُونَ فَنَهَى النَّبِيُّ صلى الله عليه وسلم أَنْ يَنْبِذُوا فِي الدُّبَّاءِ وَالنَّقِيرِ وَالْمُقَيَّرِ وَالْحَنْتَمِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 5639,
			"arabicnumber": 5639,
			"text": "أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ، قَالَ حَدَّثَنَا ابْنُ عُلَيَّةَ، قَالَ حَدَّثَنَا إِسْحَاقُ بْنُ سُوَيْدٍ، عَنْ مُعَاذَةَ، عَنْ عَائِشَةَ، رضى الله عنها قَالَتْ نَهَى عَنِ الدُّبَّاءِ، بِذَاتِهِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 5640,
			"arabicnumber": 5640,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا الْمُعْتَمِرُ، قَالَ سَمِعْتُ إِسْحَاقَ، - وَهُوَ ابْنُ سُوَيْدٍ - يَقُولُ حَدَّثَتْنِي مُعَاذَةُ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ نَبِيذِ النَّقِيرِ وَالْمُقَيَّرِ وَالدُّبَّاءِ وَالْحَنْتَمِ ‏.‏ فِي حَدِيثِ ابْنِ عُلَيَّةَ قَالَ إِسْحَاقُ وَذَكَرَتْ هُنَيْدَةُ عَنْ عَائِشَةَ مِثْلَ حَدِيثِ مُعَاذَةَ وَسَمَّتِ الْجِرَارَ ‏.‏ قُلْتُ لِهُنَيْدَةَ أَنْتِ سَمِعْتِيهَا سَمَّتِ الْجِرَارَ قَالَتْ نَعَمْ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 5641,
			"arabicnumber": 5641,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ طَوْدِ بْنِ عَبْدِ الْمَلِكِ الْقَيْسِيِّ، - بَصْرِيٌّ - قَالَ حَدَّثَنِي أَبِي، عَنْ هُنَيْدَةَ بِنْتِ شَرِيكِ بْنِ زَبَّانَ، قَالَتْ لَقِيتُ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا بِالْخُرَيْبَةِ فَسَأَلْتُهَا عَنِ الْعَكَرِ فَنَهَتْنِي عَنْهُ وَقَالَتِ انْبِذِي عَشِيَّةً وَاشْرَبِيهِ غُدْوَةً وَأَوْكِي عَلَيْهِ ‏.‏ وَنَهَتْنِي عَنِ الدُّبَّاءِ وَالنَّقِيرِ وَالْمُزَفَّتِ وَالْحَنْتَمِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 5642,
			"arabicnumber": 5642,
			"text": "أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ، قَالَ حَدَّثَنَا ابْنُ إِدْرِيسَ، قَالَ سَمِعْتُ الْمُخْتَارَ بْنَ فُلْفُلٍ، عَنْ أَنَسٍ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الظُّرُوفِ الْمُزَفَّتَةِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 5643,
			"arabicnumber": 5643,
			"text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، قَالَ حَدَّثَنَا مَنْصُورُ بْنُ حَيَّانَ، سَمِعَ سَعِيدَ بْنَ جُبَيْرٍ، يُحَدِّثُ أَنَّهُ سَمِعَ ابْنَ عُمَرَ، وَابْنَ، عَبَّاسٍ أَنَّهُمَا شَهِدَا عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ نَهَى عَنِ الدُّبَّاءِ وَالْحَنْتَمِ وَالْمُزَفَّتِ وَالنَّقِيرِ ثُمَّ تَلاَ رَسُولُ اللَّهِ صلى الله عليه وسلم هَذِهِ الآيَةَ ‏{‏ وَمَا آتَاكُمُ الرَّسُولُ فَخُذُوهُ وَمَا نَهَاكُمْ عَنْهُ فَانْتَهُوا ‏}‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 5644,
			"arabicnumber": 5644,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ سُلَيْمَانَ التَّيْمِيِّ، عَنْ أَسْمَاءَ بِنْتِ يَزِيدَ، عَنِ ابْنِ عَمٍّ، لَهَا يُقَالُ لَهُ أَنَسٌ قَالَ قَالَ ابْنُ عَبَّاسٍ أَلَمْ يَقُلِ اللَّهُ عَزَّ وَجَلَّ ‏{‏ مَا آتَاكُمُ الرَّسُولُ فَخُذُوهُ وَمَا نَهَاكُمْ عَنْهُ فَانْتَهُوا ‏}‏ قُلْتُ بَلَى ‏.‏ قَالَ أَلَمْ يَقُلِ اللَّهُ ‏{‏ وَمَا كَانَ لِمُؤْمِنٍ وَلاَ مُؤْمِنَةٍ إِذَا قَضَى اللَّهُ وَرَسُولُهُ أَمْرًا أَنْ يَكُونَ لَهُمُ الْخِيَرَةُ مِنْ أَمْرِهِمْ ‏}‏ قُلْتُ بَلَى ‏.‏ قَالَ فَإِنِّي أَشْهَدُ أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ النَّقِيرِ وَالْمُقَيَّرِ وَالدُّبَّاءِ وَالْحَنْتَمِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 5645,
			"arabicnumber": 5645,
			"text": "أَخْبَرَنَا عَمْرُو بْنُ يَزِيدَ، قَالَ حَدَّثَنَا بَهْزُ بْنُ أَسَدٍ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي عَمْرُو بْنُ مُرَّةَ، قَالَ سَمِعْتُ زَاذَانَ، قَالَ سَأَلْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ قُلْتُ حَدِّثْنِي بِشَىْءٍ، سَمِعْتَهُ مِنْ، رَسُولِ اللَّهِ صلى الله عليه وسلم فِي الأَوْعِيَةِ وَفَسِّرْهُ قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْحَنْتَمِ وَهُوَ الَّذِي تُسَمُّونَهُ أَنْتُمُ الْجَرَّةَ وَنَهَى عَنِ الدُّبَّاءِ وَهُوَ الَّذِي تُسَمُّونَهُ أَنْتُمُ الْقَرْعَ وَنَهَى عَنِ النَّقِيرِ وَهِيَ النَّخْلَةُ يَنْقُرُونَهَا وَنَهَى عَنِ الْمُزَفَّتِ وَهُوَ الْمُقَيَّرُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 5646,
			"arabicnumber": 5646,
			"text": "أَخْبَرَنَا سَوَّارُ بْنُ عَبْدِ اللَّهِ بْنِ سَوَّارٍ، قَالَ حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ عَبْدِ الْمَجِيدِ، عَنْ هِشَامٍ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم وَفْدَ عَبْدِ الْقَيْسِ حِينَ قَدِمُوا عَلَيْهِ عَنِ الدُّبَّاءِ وَعَنِ النَّقِيرِ وَعَنِ الْمُزَفَّتِ وَالْمَزَادَةِ الْمَجْبُوبَةِ وَقَالَ ‏\"‏ انْتَبِذْ فِي سِقَائِكَ وَأَوْكِهِ وَاشْرَبْهُ حُلْوًا ‏\"‏ ‏.‏ قَالَ بَعْضُهُمُ ائْذَنْ لِي يَا رَسُولَ اللَّهِ فِي مِثْلِ هَذَا ‏.‏ قَالَ ‏\"‏ إِذًا تَجْعَلَهَا مِثْلَ هَذِهِ ‏\"‏ ‏.‏ وَأَشَارَ بِيَدِهِ يَصِفُ ذَلِكَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 5647,
			"arabicnumber": 5647,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنِ ابْنِ جُرَيْجٍ، قِرَاءَةً قَالَ وَقَالَ أَبُو الزُّبَيْرِ سَمِعْتُ جَابِرًا، يَقُولُ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْجَرِّ الْمُزَفَّتِ وَالدُّبَّاءِ وَالنَّقِيرِ وَكَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا لَمْ يَجِدْ سِقَاءً يُنْبَذْ لَهُ فِيهِ نُبِذَ لَهُ فِي تَوْرٍ مِنْ حِجَارَةٍ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 5648,
			"arabicnumber": 5648,
			"text": "أَخْبَرَنِي أَحْمَدُ بْنُ خَالِدٍ، قَالَ حَدَّثَنَا إِسْحَاقُ، - يَعْنِي الأَزْرَقَ - قَالَ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ أَبِي سُلَيْمَانَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُنْبَذُ لَهُ فِي سِقَاءٍ فَإِذَا لَمْ يَكُنْ لَهُ سِقَاءٌ نَنْبِذُ لَهُ فِي تَوْرِ بِرَامٍ ‏.‏ قَالَ وَنَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الدُّبَّاءِ وَالنَّقِيرِ وَالْمُزَفَّتِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 5649,
			"arabicnumber": 5649,
			"text": "أَخْبَرَنَا سَوَّارُ بْنُ عَبْدِ اللَّهِ بْنِ سَوَّارٍ، قَالَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، قَالَ حَدَّثَنَا عَبْدُ الْمَلِكِ، قَالَ حَدَّثَنَا أَبُو الزُّبَيْرِ، عَنْ جَابِرٍ، رضى الله عنه أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الدُّبَّاءِ وَالنَّقِيرِ وَالْجَرِّ وَالْمُزَفَّتِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 5650,
			"arabicnumber": 5650,
			"text": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنَا سُلَيْمَانُ الأَحْوَلُ، عَنْ مُجَاهِدٍ، عَنْ أَبِي عِيَاضٍ، عَنْ عَبْدِ اللَّهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم رَخَّصَ فِي الْجَرِّ غَيْرَ مُزَفَّتٍ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 5651,
			"arabicnumber": 5651,
			"text": "أَخْبَرَنَا الْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ، عَنِ الأَحْوَصِ بْنِ جَوَّابٍ، عَنْ عَمَّارِ بْنِ رُزَيْقٍ، أَنَّهُ حَدَّثَهُمْ عَنْ أَبِي إِسْحَاقَ، عَنِ الزُّبَيْرِ بْنِ عَدِيٍّ، عَنِ ابْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنِّي كُنْتُ نَهَيْتُكُمْ عَنْ لُحُومِ الأَضَاحِي فَتَزَوَّدُوا وَادَّخِرُوا وَمَنْ أَرَادَ زِيَارَةَ الْقُبُورِ فَإِنَّهَا تُذَكِّرُ الآخِرَةَ وَاشْرَبُوا وَاتَّقُوا كُلَّ مُسْكِرٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 5652,
			"arabicnumber": 5652,
			"text": "أَخْبَرَنِي مُحَمَّدُ بْنُ آدَمَ بْنِ سُلَيْمَانَ، عَنِ ابْنِ فُضَيْلٍ، عَنْ أَبِي سِنَانٍ، عَنْ مُحَارِبِ بْنِ دِثَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنِّي كُنْتُ نَهَيْتُكُمْ عَنْ زِيَارَةِ الْقُبُورِ فَزُورُوهَا وَنَهَيْتُكُمْ عَنْ لُحُومِ الأَضَاحِي فَوْقَ ثَلاَثَةِ أَيَّامٍ فَأَمْسِكُوا مَا بَدَا لَكُمْ وَنَهَيْتُكُمْ عَنِ النَّبِيذِ إِلاَّ فِي سِقَاءٍ فَاشْرَبُوا فِي الأَسْقِيَةِ كُلِّهَا وَلاَ تَشْرَبُوا مُسْكِرًا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 5653,
			"arabicnumber": 5653,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَعْدَانَ بْنِ عِيسَى بْنِ مَعْدَانَ الْحَرَّانِيُّ، قَالَ حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، قَالَ حَدَّثَنَا زُهَيْرٌ، قَالَ حَدَّثَنَا زُبَيْدٌ، عَنْ مُحَارِبٍ، عَنِ ابْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنِّي كُنْتُ نَهَيْتُكُمْ عَنْ ثَلاَثٍ زِيَارَةِ الْقُبُورِ فَزُورُوهَا وَلْتَزِدْكُمْ زِيَارَتُهَا خَيْرًا وَنَهَيْتُكُمْ عَنْ لُحُومِ الأَضَاحِي بَعْدَ ثَلاَثٍ فَكُلُوا مِنْهَا مَا شِئْتُمْ وَنَهَيْتُكُمْ عَنِ الأَشْرِبَةِ فِي الأَوْعِيَةِ فَاشْرَبُوا فِي أَىِّ وِعَاءٍ شِئْتُمْ وَلاَ تَشْرَبُوا مُسْكِرًا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 5654,
			"arabicnumber": 5654,
			"text": "أَخْبَرَنَا أَبُو بَكْرِ بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْحَجَّاجِ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ حَمَّادِ بْنِ أَبِي سُلَيْمَانَ، عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ كُنْتُ نَهَيْتُكُمْ عَنِ الأَوْعِيَةِ فَانْتَبِذُوا فِيمَا بَدَا لَكُمْ وَإِيَّاكُمْ وَكُلَّ مُسْكِرٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 5655,
			"arabicnumber": 5655,
			"text": "أَخْبَرَنَا أَبُو عَلِيٍّ، مُحَمَّدُ بْنُ يَحْيَى بْنِ أَيُّوبَ - مَرْوَزِيٌّ - قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُثْمَانَ، قَالَ حَدَّثَنَا عِيسَى بْنُ عُبَيْدٍ الْكِنْدِيُّ، - خُرَاسَانِيٌّ - قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ بُرَيْدَةَ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَيْنَا هُوَ يَسِيرُ إِذْ حَلَّ بِقَوْمٍ فَسَمِعَ لَهُمْ لَغَطًا فَقَالَ ‏\"‏ مَا هَذَا الصَّوْتُ ‏\"‏ ‏.‏ قَالُوا يَا نَبِيَّ اللَّهِ لَهُمْ شَرَابٌ يَشْرَبُونَهُ ‏.‏ فَبَعَثَ إِلَى الْقَوْمِ فَدَعَاهُمْ فَقَالَ ‏\"‏ فِي أَىِّ شَىْءٍ تَنْتَبِذُونَ ‏\"‏ ‏.‏ قَالُوا نَنْتَبِذُ فِي النَّقِيرِ وَالدُّبَّاءِ وَلَيْسَ لَنَا ظُرُوفٌ ‏.‏ فَقَالَ ‏\"‏ لاَ تَشْرَبُوا إِلاَّ فِيمَا أَوْكَيْتُمْ عَلَيْهِ ‏\"‏ ‏.‏ قَالَ فَلَبِثَ بِذَلِكَ مَا شَاءَ اللَّهُ أَنْ يَلْبَثَ ثُمَّ رَجَعَ عَلَيْهِمْ فَإِذَا هُمْ قَدْ أَصَابَهُمْ وَبَاءٌ وَاصْفَرُّوا ‏.‏ قَالَ ‏\"‏ مَا لِي أَرَاكُمْ قَدْ هَلَكْتُمْ ‏\"‏ ‏.‏ قَالُوا يَا نَبِيَّ اللَّهِ أَرْضُنَا وَبِيئَةٌ وَحَرَّمْتَ عَلَيْنَا إِلاَّ مَا أَوْكَيْنَا عَلَيْهِ ‏.‏ قَالَ ‏\"‏ اشْرَبُوا وَكُلُّ مُسْكِرٍ حَرَامٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 5656,
			"arabicnumber": 5656,
			"text": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا أَبُو دَاوُدَ الْحَفَرِيُّ، وَأَبُو أَحْمَدَ الزُّبَيْرِيُّ عَنْ سُفْيَانَ، عَنْ مَنْصُورٍ، عَنْ سَالِمٍ، عَنْ جَابِرٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمَّا نَهَى عَنِ الظُّرُوفِ شَكَتِ الأَنْصَارُ فَقَالَتْ يَا رَسُولَ اللَّهِ لَيْسَ لَنَا وِعَاءٌ ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ فَلاَ إِذًا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 5657,
			"arabicnumber": 5657,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ يُونُسَ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ أُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم لَيْلَةَ أُسْرِيَ بِهِ بِقَدَحَيْنِ مِنْ خَمْرٍ وَلَبَنٍ فَنَظَرَ إِلَيْهِمَا فَأَخَذَ اللَّبَنَ فَقَالَ لَهُ جِبْرِيلُ عَلَيْهِ السَّلاَمُ الْحَمْدُ لِلَّهِ الَّذِي هَدَاكَ لِلْفِطْرَةِ لَوْ أَخَذْتَ الْخَمْرَ غَوَتْ أُمَّتُكَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 5658,
			"arabicnumber": 5658,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، عَنْ خَالِدٍ، - وَهُوَ ابْنُ الْحَارِثِ - عَنْ شُعْبَةَ، قَالَ سَمِعْتُ أَبَا بَكْرِ بْنَ حَفْصٍ، يَقُولُ سَمِعْتُ ابْنَ مُحَيْرِيزٍ، يُحَدِّثُ عَنْ رَجُلٍ، مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ يَشْرَبُ نَاسٌ مِنْ أُمَّتِي الْخَمْرَ يُسَمُّونَهَا بِغَيْرِ اسْمِهَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 5659,
			"arabicnumber": 5659,
			"text": "أَخْبَرَنَا عِيسَى بْنُ حَمَّادٍ، قَالَ أَنْبَأَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ يَزْنِي الزَّانِي حِينَ يَزْنِي وَهُوَ مُؤْمِنٌ وَلاَ يَشْرَبُ الْخَمْرَ شَارِبُهَا حِينَ يَشْرَبُهَا وَهُوَ مُؤْمِنٌ وَلاَ يَسْرِقُ السَّارِقُ حِينَ يَسْرِقُ وَهُوَ مُؤْمِنٌ وَلاَ يَنْتَهِبُ نُهْبَةً يَرْفَعُ النَّاسُ إِلَيْهِ فِيهَا أَبْصَارَهُمْ حِينَ يَنْتَهِبُهَا وَهُوَ مُؤْمِنٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 5660,
			"arabicnumber": 5660,
			"text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، عَنِ الأَوْزَاعِيِّ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، وَأَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ وَأَبُو بَكْرِ بْنُ عَبْدِ الرَّحْمَنِ كُلُّهُمْ حَدَّثُونِي عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَزْنِي الزَّانِي حِينَ يَزْنِي وَهُوَ مُؤْمِنٌ وَلاَ يَسْرِقُ السَّارِقُ حِينَ يَسْرِقُ وَهُوَ مُؤْمِنٌ وَلاَ يَشْرَبُ الْخَمْرَ حِينَ يَشْرَبُهَا وَهُوَ مُؤْمِنٌ وَلاَ يَنْتَهِبُ نُهْبَةً ذَاتَ شَرَفٍ يَرْفَعُ الْمُسْلِمُونَ إِلَيْهِ أَبْصَارَهُمْ وَهُوَ مُؤْمِنٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 5661,
			"arabicnumber": 5661,
			"text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا جَرِيرٌ، عَنْ مُغِيرَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي نُعْمٍ، عَنِ ابْنِ عُمَرَ، وَنَفَرٍ، مِنْ أَصْحَابِ مُحَمَّدٍ صلى الله عليه وسلم قَالُوا قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ شَرِبَ الْخَمْرَ فَاجْلِدُوهُ ثُمَّ إِنْ شَرِبَ فَاجْلِدُوهُ ثُمَّ إِنْ شَرِبَ فَاجْلِدُوهُ ثُمَّ إِنْ شَرِبَ فَاقْتُلُوهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 5662,
			"arabicnumber": 5662,
			"text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا شَبَابَةُ، قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنْ خَالِهِ الْحَارِثِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا سَكِرَ فَاجْلِدُوهُ ثُمَّ إِنْ سَكِرَ فَاجْلِدُوهُ ثُمَّ إِنْ سَكِرَ فَاجْلِدُوهُ ‏\"‏ ‏.‏ ثُمَّ قَالَ فِي الرَّابِعَةِ ‏\"‏ فَاضْرِبُوا عُنُقَهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 5663,
			"arabicnumber": 5663,
			"text": "أَخْبَرَنَا وَاصِلُ بْنُ عَبْدِ الأَعْلَى، عَنِ ابْنِ فُضَيْلٍ، عَنْ وَائِلٍ أَبِي بَكْرٍ، عَنْ أَبِي بُرْدَةَ بْنِ أَبِي مُوسَى، عَنْ أَبِيهِ، رضى الله عنه أَنَّهُ كَانَ يَقُولُ مَا أُبَالِي شَرِبْتُ الْخَمْرَ أَوْ عَبَدْتُ هَذِهِ السَّارِيَةَ مِنْ دُونِ اللَّهِ عَزَّ وَجَلَّ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 5664,
			"arabicnumber": 5664,
			"text": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ أَنْبَأَنَا عُثْمَانُ بْنُ حِصْنِ بْنِ عَلاَّقٍ، - دِمَشْقِيٌّ - قَالَ حَدَّثَنَا عُرْوَةُ بْنُ، رُوَيْمٍ أَنَّ ابْنَ الدَّيْلَمِيِّ رَكِبَ يَطْلُبُ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ قَالَ ابْنُ الدَّيْلَمِيِّ فَدَخَلْتُ عَلَيْهِ فَقُلْتُ هَلْ سَمِعْتَ يَا عَبْدَ اللَّهِ بْنَ عَمْرٍو، رَسُولَ اللَّهِ صلى الله عليه وسلم ذَكَرَ شَأْنَ الْخَمْرِ بِشَىْءٍ فَقَالَ نَعَمْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ لاَ يَشْرَبُ الْخَمْرَ رَجُلٌ مِنْ أُمَّتِي فَيَقْبَلُ اللَّهُ مِنْهُ صَلاَةً أَرْبَعِينَ يَوْمًا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 5665,
			"arabicnumber": 5665,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، وَعَلِيُّ بْنُ حُجْرٍ، قَالاَ حَدَّثَنَا خَلَفٌ، - يَعْنِي ابْنَ خَلِيفَةَ - عَنْ مَنْصُورِ بْنِ زَاذَانَ، عَنِ الْحَكَمِ بْنِ عُتَيْبَةَ، عَنْ أَبِي وَائِلٍ، عَنْ مَسْرُوقٍ، قَالَ الْقَاضِي إِذَا أَكَلَ الْهَدِيَّةَ فَقَدْ أَكَلَ السُّحْتَ وَإِذَا قَبِلَ الرِّشْوَةَ بَلَغَتْ بِهِ الْكُفْرَ ‏.‏ وَقَالَ مَسْرُوقٌ مَنْ شَرِبَ الْخَمْرَ فَقَدْ كَفَرَ وَكُفْرُهُ أَنْ لَيْسَ لَهُ صَلاَةٌ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad Maqtu"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 5666,
			"arabicnumber": 5666,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ عُثْمَانَ، رضى الله عنه يَقُولُ اجْتَنِبُوا الْخَمْرَ فَإِنَّهَا أُمُّ الْخَبَائِثِ إِنَّهُ كَانَ رَجُلٌ مِمَّنْ خَلاَ قَبْلَكُمْ تَعَبَّدَ فَعَلِقَتْهُ امْرَأَةٌ غَوِيَّةٌ فَأَرْسَلَتْ إِلَيْهِ جَارِيَتَهَا فَقَالَتْ لَهُ إِنَّا نَدْعُوكَ لِلشَّهَادَةِ فَانْطَلَقَ مَعَ جَارِيَتِهَا فَطَفِقَتْ كُلَّمَا دَخَلَ بَابًا أَغْلَقَتْهُ دُونَهُ حَتَّى أَفْضَى إِلَى امْرَأَةٍ وَضِيئَةٍ عِنْدَهَا غُلاَمٌ وَبَاطِيَةُ خَمْرٍ فَقَالَتْ إِنِّي وَاللَّهِ مَا دَعَوْتُكَ لِلشَّهَادَةِ وَلَكِنْ دَعَوْتُكَ لِتَقَعَ عَلَىَّ أَوْ تَشْرَبَ مِنْ هَذِهِ الْخَمْرَةِ كَأْسًا أَوْ تَقْتُلَ هَذَا الْغُلاَمَ ‏.‏ قَالَ فَاسْقِينِي مِنْ هَذَا الْخَمْرِ كَأْسًا فَسَقَتْهُ كَأْسًا ‏.‏ قَالَ زِيدُونِي فَلَمْ يَرِمْ حَتَّى وَقَعَ عَلَيْهَا وَقَتَلَ النَّفْسَ فَاجْتَنِبُوا الْخَمْرَ فَإِنَّهَا وَاللَّهِ لاَ يَجْتَمِعُ الإِيمَانُ وَإِدْمَانُ الْخَمْرِ إِلاَّ لَيُوشِكُ أَنْ يُخْرِجَ أَحَدُهُمَا صَاحِبَهُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 5667,
			"arabicnumber": 5667,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، - يَعْنِي ابْنَ الْمُبَارَكِ - عَنْ يُونُسَ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي أَبُو بَكْرِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ، أَنَّ أَبَاهُ، قَالَ سَمِعْتُ عُثْمَانَ، يَقُولُ اجْتَنِبُوا الْخَمْرَ فَإِنَّهَا أُمُّ الْخَبَائِثِ فَإِنَّهُ كَانَ رَجُلٌ مِمَّنْ خَلاَ قَبْلَكُمْ يَتَعَبَّدُ وَيَعْتَزِلُ النَّاسَ فَذَكَرَ مِثْلَهُ قَالَ فَاجْتَنِبُوا الْخَمْرَ فَإِنَّهُ وَاللَّهِ لاَ يَجْتَمِعُ وَالإِيمَانُ أَبَدًا إِلاَّ يُوشِكُ أَحَدُهُمَا أَنْ يُخْرِجَ صَاحِبَهُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 5668,
			"arabicnumber": 5668,
			"text": "أَخْبَرَنَا أَبُو بَكْرِ بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا سُرَيْجُ بْنُ يُونُسَ، قَالَ حَدَّثَنَا يَحْيَى بْنُ عَبْدِ الْمَلِكِ، عَنِ الْعَلاَءِ، - وَهُوَ ابْنُ الْمُسَيَّبِ - عَنْ فُضَيْلٍ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عُمَرَ، قَالَ مَنْ شَرِبَ الْخَمْرَ فَلَمْ يَنْتَشِ لَمْ تُقْبَلْ لَهُ صَلاَةٌ مَادَامَ فِي جَوْفِهِ أَوْ عُرُوقِهِ مِنْهَا شَىْءٌ وَإِنْ مَاتَ مَاتَ كَافِرًا وَإِنِ انْتَشَى لَمْ تُقْبَلْ لَهُ صَلاَةٌ أَرْبَعِينَ لَيْلَةً وَإِنْ مَاتَ فِيهَا مَاتَ كَافِرًا ‏.‏ خَالَفَهُ يَزِيدُ بْنُ أَبِي زِيَادٍ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 5669,
			"arabicnumber": 5669,
			"text": "أَخْبَرَنِي مُحَمَّدُ بْنُ آدَمَ بْنِ سُلَيْمَانَ، عَنْ عَبْدِ الرَّحِيمِ، عَنْ يَزِيدَ، ح وَأَنْبَأَنَا وَاصِلُ بْنُ عَبْدِ الأَعْلَى، حَدَّثَنَا ابْنُ فُضَيْلٍ، عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ، عَنْ مُجَاهِدٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، عَنِ النَّبِيِّ صلى الله عليه وسلم وَقَالَ مُحَمَّدُ بْنُ آدَمَ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ شَرِبَ الْخَمْرَ فَجَعَلَهَا فِي بَطْنِهِ لَمْ يَقْبَلِ اللَّهُ مِنْهُ صَلاَةً سَبْعًا إِنْ مَاتَ فِيهَا ‏\"‏ ‏.‏ وَقَالَ ابْنُ آدَمَ ‏\"‏ فِيهِنَّ مَاتَ كَافِرًا فَإِنْ أَذْهَبَتْ عَقْلَهُ عَنْ شَىْءٍ مِنَ الْفَرَائِضِ ‏\"‏ ‏.‏ وَقَالَ ابْنُ آدَمَ ‏\"‏ الْقُرْآنِ لَمْ تُقْبَلْ لَهُ صَلاَةٌ أَرْبَعِينَ يَوْمًا إِنْ مَاتَ فِيهَا ‏\"‏ ‏.‏ وَقَالَ ابْنُ آدَمَ ‏\"‏ فِيهِنَّ مَاتَ كَافِرًا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 5670,
			"arabicnumber": 5670,
			"text": "أَخْبَرَنَا الْقَاسِمُ بْنُ زَكَرِيَّا بْنِ دِينَارٍ، قَالَ حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمْرٍو، حَدَّثَنَا أَبُو إِسْحَاقَ، قَالَ حَدَّثَنَا الأَوْزَاعِيُّ، قَالَ حَدَّثَنِي رَبِيعَةُ بْنُ يَزِيدَ، ح وَأَخْبَرَنِي عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدٍ، عَنْ بَقِيَّةَ، عَنْ أَبِي عَمْرٍو، - وَهُوَ الأَوْزَاعِيُّ - عَنْ رَبِيعَةَ بْنِ يَزِيدَ، عَنْ عَبْدِ اللَّهِ بْنِ الدَّيْلَمِيِّ، قَالَ دَخَلْتُ عَلَى عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ وَهُوَ فِي حَائِطٍ لَهُ بِالطَّائِفِ يُقَالُ لَهُ الْوَهْطُ وَهُوَ مُخَاصِرٌ فَتًى مِنْ قُرَيْشٍ يُزَنُّ ذَلِكَ الْفَتَى بِشُرْبِ الْخَمْرِ فَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَنْ شَرِبَ الْخَمْرَ شَرْبَةً لَمْ تُقْبَلْ لَهُ تَوْبَةٌ أَرْبَعِينَ صَبَاحًا فَإِنْ تَابَ تَابَ اللَّهُ عَلَيْهِ فَإِنْ عَادَ لَمْ تُقْبَلْ تَوْبَتُهُ أَرْبَعِينَ صَبَاحًا فَإِنْ تَابَ تَابَ اللَّهُ عَلَيْهِ فَإِنْ عَادَ كَانَ حَقًّا عَلَى اللَّهِ أَنْ يَسْقِيَهُ مِنْ طِينَةِ الْخَبَالِ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏ اللَّفْظُ لِعَمْرٍو ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 5671,
			"arabicnumber": 5671,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، وَالْحَارِثُ بْنُ مِسْكِينٍ، قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، - وَاللَّفْظُ لَهُ - عَنِ ابْنِ الْقَاسِمِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ شَرِبَ الْخَمْرَ فِي الدُّنْيَا ثُمَّ لَمْ يَتُبْ مِنْهَا حُرِمَهَا فِي الآخِرَةِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 5672,
			"arabicnumber": 5672,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، عَنْ مُحَمَّدٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ مَنْصُورٍ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ نُبَيْطٍ، عَنْ جَابَانَ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَدْخُلُ الْجَنَّةَ مَنَّانٌ وَلاَ عَاقٌّ وَلاَ مُدْمِنُ خَمْرٍ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 5673,
			"arabicnumber": 5673,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ حَمَّادِ بْنِ زَيْدٍ، قَالَ حَدَّثَنَا أَيُّوبُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ شَرِبَ الْخَمْرَ فِي الدُّنْيَا فَمَاتَ وَهُوَ يُدْمِنُهَا لَمْ يَتُبْ مِنْهَا لَمْ يَشْرَبْهَا فِي الآخِرَةِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 5674,
			"arabicnumber": 5674,
			"text": "أَخْبَرَنَا يَحْيَى بْنُ دُرُسْتَ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، رضى الله عنهما قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ شَرِبَ الْخَمْرَ فِي الدُّنْيَا فَمَاتَ وَهُوَ يُدْمِنُهَا لَمْ يَشْرَبْهَا فِي الآخِرَةِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 5675,
			"arabicnumber": 5675,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنِ الْحَسَنِ بْنِ يَحْيَى، عَنِ الضَّحَّاكِ، قَالَ مَنْ مَاتَ مُدْمِنًا لِلْخَمْرِ نُضِحَ فِي وَجْهِهِ بِالْحَمِيمِ حِينَ يُفَارِقُ الدُّنْيَا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 5676,
			"arabicnumber": 5676,
			"text": "أَخْبَرَنَا زَكَرِيَّا بْنُ يَحْيَى، قَالَ حَدَّثَنَا عَبْدُ الأَعْلَى بْنُ حَمَّادٍ، قَالَ حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنِي عَبْدُ الرَّزَّاقِ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، قَالَ غَرَّبَ عُمَرُ رضى الله عنه رَبِيعَةَ بْنَ أُمَيَّةَ فِي الْخَمْرِ إِلَى خَيْبَرَ فَلَحِقَ بِهِرَقْلَ فَتَنَصَّرَ فَقَالَ عُمَرُ رَضِيَ اللَّهُ عَنْهُ لاَ أُغَرِّبُ بَعْدَهُ مُسْلِمًا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 5677,
			"arabicnumber": 5677,
			"text": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ، عَنْ أَبِي الأَحْوَصِ، عَنْ سِمَاكٍ، عَنِ الْقَاسِمِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، عَنْ أَبِي بُرْدَةَ بْنِ نِيَارٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ اشْرَبُوا فِي الظُّرُوفِ وَلاَ تَسْكَرُوا ‏\"‏ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ وَهَذَا حَدِيثٌ مُنْكَرٌ غَلِطَ فِيهِ أَبُو الأَحْوَصِ سَلاَّمُ بْنُ سُلَيْمٍ لاَ نَعْلَمُ أَنَّ أَحَدًا تَابَعَهُ عَلَيْهِ مِنْ أَصْحَابِ سِمَاكِ بْنِ حَرْبٍ وَسِمَاكٌ لَيْسَ بِالْقَوِيِّ وَكَانَ يَقْبَلُ التَّلْقِينَ ‏.‏ قَالَ أَحْمَدُ بْنُ حَنْبَلٍ كَانَ أَبُو الأَحْوَصِ يُخْطِئُ فِي هَذَا الْحَدِيثِ ‏.‏ خَالَفَهُ شَرِيكٌ فِي إِسْنَادِهِ وَفِي لَفْظِهِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 5678,
			"arabicnumber": 5678,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا يَزِيدُ، قَالَ أَنْبَأَنَا شَرِيكٌ، عَنْ سِمَاكِ بْنِ حَرْبٍ، عَنِ ابْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الدُّبَّاءِ وَالْحَنْتَمِ وَالنَّقِيرِ وَالْمُزَفَّتِ ‏.‏ خَالَفَهُ أَبُو عَوَانَةَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 5679,
			"arabicnumber": 5679,
			"text": "أَخْبَرَنَا أَبُو بَكْرِ بْنُ عَلِيٍّ، قَالَ أَنْبَأَنَا إِبْرَاهِيمُ بْنُ حَجَّاجٍ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ سِمَاكٍ، عَنْ قُرْصَافَةَ، - امْرَأَةٌ مِنْهُمْ - عَنْ عَائِشَةَ، قَالَتِ اشْرَبُوا وَلاَ تَسْكَرُوا ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ وَهَذَا أَيْضًا غَيْرُ ثَابِتٍ وَقُرْصَافَةُ هَذِهِ لاَ نَدْرِي مَنْ هِيَ وَالْمَشْهُورُ عَنْ عَائِشَةَ خِلاَفُ مَا رَوَتْ عَنْهَا قُرْصَافَةُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 5680,
			"arabicnumber": 5680,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، عَنْ قُدَامَةَ الْعَامِرِيِّ، أَنَّ جَسْرَةَ بِنْتَ دَجَاجَةَ الْعَامِرِيَّةَ، حَدَّثَتْهُ قَالَتْ، سَمِعْتُ عَائِشَةَ، سَأَلَهَا أُنَاسٌ كُلُّهُمْ يَسْأَلُ عَنِ النَّبِيذِ، يَقُولُ نَنْبِذُ التَّمْرَ غُدْوَةً وَنَشْرَبُهُ عَشِيًّا وَنَنْبِذُهُ عَشِيًّا وَنَشْرَبُهُ غُدْوَةً ‏.‏ قَالَتْ لاَ أُحِلُّ مُسْكِرًا وَإِنْ كَانَ خُبْزًا وَإِنْ كَانَتْ مَاءً ‏.‏ قَالَتْهَا ثَلاَثَ مَرَّاتٍ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 5681,
			"arabicnumber": 5681,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ عَلِيِّ بْنِ الْمُبَارَكِ، قَالَ حَدَّثَتْنَا كَرِيمَةُ بِنْتُ هَمَّامٍ، أَنَّهَا سَمِعَتْ عَائِشَةَ أُمَّ الْمُؤْمِنِينَ، تَقُولُ نُهِيتُمْ عَنِ الدُّبَّاءِ، نُهِيتُمْ عَنِ الْحَنْتَمِ، نُهِيتُمْ عَنِ الْمُزَفَّتِ، ‏.‏ ثُمَّ أَقْبَلَتْ عَلَى النِّسَاءِ فَقَالَتْ إِيَّاكُنَّ وَالْجَرَّ الأَخْضَرَ وَإِنْ أَسْكَرَكُنَّ مَاءُ حُبِّكُنَّ فَلاَ تَشْرَبْنَهُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 5682,
			"arabicnumber": 5682,
			"text": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا أَبَانُ بْنُ صَمْعَةَ، قَالَ حَدَّثَتْنِي وَالِدَتِي، عَنْ عَائِشَةَ، أَنَّهَا سُئِلَتْ عَنِ الأَشْرِبَةِ، فَقَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَنْهَى عَنْ كُلِّ مُسْكِرٍ ‏.‏ وَاعْتَلُّوا بِحَدِيثِ عَبْدِ اللَّهِ بْنِ شَدَّادٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 5683,
			"arabicnumber": 5683,
			"text": "أَخْبَرَنَا أَبُو بَكْرِ بْنُ عَلِيٍّ، قَالَ أَنْبَأَنَا الْقَوَارِيرِيُّ، قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ، قَالَ سَمِعْتُ ابْنَ شُبْرُمَةَ، يَذْكُرُهُ عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادِ بْنِ الْهَادِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ حُرِّمَتِ الْخَمْرُ قَلِيلُهَا وَكَثِيرُهَا وَالسُّكْرُ مِنْ كُلِّ شَرَابٍ ‏.‏ ابْنُ شُبْرُمَةَ لَمْ يَسْمَعْهُ مِنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 5684,
			"arabicnumber": 5684,
			"text": "أَخْبَرَنَا أَبُو بَكْرِ بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا سُرَيْجُ بْنُ يُونُسَ، قَالَ حَدَّثَنَا هُشَيْمٌ، عَنِ ابْنِ شُبْرُمَةَ، قَالَ حَدَّثَنِي الثِّقَةُ، عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ حُرِّمَتِ الْخَمْرُ بِعَيْنِهَا قَلِيلُهَا وَكَثِيرُهَا وَالسُّكْرُ مِنْ كُلِّ شَرَابٍ ‏.‏ خَالَفَهُ أَبُو عَوْنٍ مُحَمَّدُ بْنُ عُبَيْدِ اللَّهِ الثَّقَفِيُّ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 5685,
			"arabicnumber": 5685,
			"text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ الْحَكَمِ، قَالَ حَدَّثَنَا مُحَمَّدٌ، ح وَأَنْبَأَنَا الْحُسَيْنُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ مِسْعَرٍ، عَنْ أَبِي عَوْنٍ، عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ حُرِّمَتِ الْخَمْرُ بِعَيْنِهَا قَلِيلُهَا وَكَثِيرُهَا وَالسُّكْرُ مِنْ كُلِّ شَرَابٍ ‏.‏ لَمْ يَذْكُرِ ابْنُ الْحَكَمِ قَلِيلُهَا وَكَثِيرُهَا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 5686,
			"arabicnumber": 5686,
			"text": "أَخْبَرَنَا الْحُسَيْنُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، قَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ أَبِي الْعَبَّاسِ، قَالَ حَدَّثَنَا شَرِيكٌ، عَنْ عَبَّاسِ بْنِ ذَرِيحٍ، عَنْ أَبِي عَوْنٍ، عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ حُرِّمَتِ الْخَمْرُ قَلِيلُهَا وَكَثِيرُهَا وَمَا أَسْكَرَ مِنْ كُلِّ شَرَابٍ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ وَهَذَا أَوْلَى بِالصَّوَابِ مِنْ حَدِيثِ ابْنِ شُبْرُمَةَ وَهُشَيْمُ بْنُ بَشِيرٍ كَانَ يُدَلِّسُ وَلَيْسَ فِي حَدِيثِهِ ذِكْرُ السَّمَاعِ مِنِ ابْنِ شُبْرُمَةَ وَرِوَايَةُ أَبِي عَوْنٍ أَشْبَهُ بِمَا رَوَاهُ الثِّقَاتُ عَنِ ابْنِ عَبَّاسٍ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 5687,
			"arabicnumber": 5687,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ سُفْيَانَ، عَنْ أَبِي الْجُوَيْرِيَةِ الْجَرْمِيِّ، قَالَ سَأَلْتُ ابْنَ عَبَّاسٍ وَهُوَ مُسْنِدٌ ظَهْرَهُ إِلَى الْكَعْبَةِ عَنِ الْبَاذَقِ، فَقَالَ سَبَقَ مُحَمَّدٌ الْبَاذَقَ وَمَا أَسْكَرَ فَهُوَ حَرَامٌ ‏.‏ قَالَ أَنَا أَوَّلُ الْعَرَبِ سَأَلَهُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 5688,
			"arabicnumber": 5688,
			"text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا أَبُو عَامِرٍ، وَالنَّضْرُ بْنُ شُمَيْلٍ، وَوَهْبُ بْنُ جَرِيرٍ، قَالُوا حَدَّثَنَا شُعْبَةُ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، قَالَ سَمِعْتُ أَبَا الْحَكَمِ، يُحَدِّثُ قَالَ ابْنُ عَبَّاسٍ مَنْ سَرَّهُ أَنْ يُحَرِّمَ، - إِنْ كَانَ مُحَرِّمًا مَا حَرَّمَ اللَّهُ وَرَسُولُهُ - فَلْيُحَرِّمِ النَّبِيذَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 5689,
			"arabicnumber": 5689,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ عُيَيْنَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، قَالَ قَالَ رَجُلٌ لاِبْنِ عَبَّاسٍ إِنِّي امْرُؤٌ مِنْ أَهْلِ خُرَاسَانَ وَإِنَّ أَرْضَنَا أَرْضٌ بَارِدَةٌ وَإِنَّا نَتَّخِذُ شَرَابًا نَشْرَبُهُ مِنَ الزَّبِيبِ وَالْعِنَبِ وَغَيْرِهِ وَقَدْ أُشْكِلَ عَلَىَّ ‏.‏ فَذَكَرَ لَهُ ضُرُوبًا مِنَ الأَشْرِبَةِ فَأَكْثَرَ حَتَّى ظَنَنْتُ أَنَّهُ لَمْ يَفْهَمْهُ فَقَالَ لَهُ ابْنُ عَبَّاسٍ إِنَّكَ قَدْ أَكْثَرْتَ عَلَىَّ اجْتَنِبْ مَا أَسْكَرَ مِنْ تَمْرٍ أَوْ زَبِيبٍ أَوْ غَيْرِهِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 5690,
			"arabicnumber": 5690,
			"text": "أَخْبَرَنَا أَبُو بَكْرِ بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا الْقَوَارِيرِيُّ، قَالَ حَدَّثَنَا حَمَّادٌ، قَالَ حَدَّثَنَا أَيُّوبُ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ نَبِيذُ الْبُسْرِ بَحْتًا لاَ يَحِلُّ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 5691,
			"arabicnumber": 5691,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا مُحَمَّدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي جَمْرَةَ، قَالَ كُنْتُ أُتَرْجِمُ بَيْنَ ابْنِ عَبَّاسٍ وَبَيْنَ النَّاسِ فَأَتَتْهُ امْرَأَةٌ تَسْأَلُهُ عَنْ نَبِيذِ الْجَرِّ، فَنَهَى عَنْهُ ‏.‏ قُلْتُ يَا أَبَا عَبَّاسٍ إِنِّي أَنْتَبِذُ فِي جَرَّةٍ خَضْرَاءَ نَبِيذًا حُلْوًا فَأَشْرَبُ مِنْهُ فَيُقَرْقِرُ بَطْنِي ‏.‏ قَالَ لاَ تَشْرَبْ مِنْهُ وَإِنْ كَانَ أَحْلَى مِنَ الْعَسَلِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 5692,
			"arabicnumber": 5692,
			"text": "أَخْبَرَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا أَبُو عَتَّابٍ، - وَهُوَ سَهْلُ بْنُ حَمَّادٍ - قَالَ حَدَّثَنَا قُرَّةُ، قَالَ حَدَّثَنَا أَبُو جَمْرَةَ، نَصْرٌ قَالَ قُلْتُ لاِبْنِ عَبَّاسٍ إِنَّ جَدَّةً لِي تَنْبِذُ نَبِيذًا فِي جَرٍّ أَشْرَبُهُ حُلْوًا إِنْ أَكْثَرْتُ مِنْهُ فَجَالَسْتُ الْقَوْمَ خَشِيتُ أَنْ أَفْتَضِحَ ‏.‏ فَقَالَ قَدِمَ وَفْدُ عَبْدِ الْقَيْسِ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَرْحَبًا بِالْوَفْدِ لَيْسَ بِالْخَزَايَا وَلاَ النَّادِمِينَ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ إِنَّ بَيْنَنَا وَبَيْنَكَ الْمُشْرِكِينَ وَإِنَّا لاَ نَصِلُ إِلَيْكَ إِلاَّ فِي أَشْهُرِ الْحُرُمِ فَحَدِّثْنَا بِأَمْرٍ إِنْ عَمِلْنَا بِهِ دَخَلْنَا الْجَنَّةَ وَنَدْعُو بِهِ مَنْ وَرَاءَنَا ‏.‏ قَالَ ‏\"‏ آمُرُكُمْ بِثَلاَثٍ وَأَنْهَاكُمْ عَنْ أَرْبَعٍ آمُرُكُمْ بِالإِيمَانِ بِاللَّهِ وَهَلْ تَدْرُونَ مَا الإِيمَانُ بِاللَّهِ ‏\"‏ ‏.‏ قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ ‏.‏ قَالَ ‏\"‏ شَهَادَةُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَإِقَامُ الصَّلاَةِ وَإِيتَاءُ الزَّكَاةِ وَأَنْ تُعْطُوا مِنَ الْمَغَانِمِ الْخُمُسَ وَأَنْهَاكُمْ عَنْ أَرْبَعٍ عَمَّا يُنْبَذُ فِي الدُّبَّاءِ وَالنَّقِيرِ وَالْحَنْتَمِ وَالْمُزَفَّتِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 5693,
			"arabicnumber": 5693,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ سُلَيْمَانَ التَّيْمِيِّ، عَنْ قَيْسِ بْنِ هُنَانٍ، قَالَ سَأَلْتُ ابْنَ عَبَّاسٍ قُلْتُ إِنَّ لِي جُرَيْرَةً أَنْتَبِذُ فِيهَا حَتَّى إِذَا غَلَى وَسَكَنَ شَرِبْتُهُ ‏.‏ قَالَ مُذْ كَمْ هَذَا شَرَابُكَ قُلْتُ مُذْ عِشْرُونَ سَنَةً أَوْ قَالَ مُذْ أَرْبَعُونَ سَنَةً ‏.‏ قَالَ طَالَمَا تَرَوَّتْ عُرُوقُكَ مِنَ الْخَبَثِ ‏.‏ وَمِمَّا اعْتَلُّوا بِهِ حَدِيثُ عَبْدِ الْمَلِكِ بْنِ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 5694,
			"arabicnumber": 5694,
			"text": "أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ، قَالَ حَدَّثَنَا هُشَيْمٌ، قَالَ أَنْبَأَنَا الْعَوَّامُ، عَنْ عَبْدِ الْمَلِكِ بْنِ نَافِعٍ، قَالَ قَالَ ابْنُ عُمَرَ رَأَيْتُ رَجُلاً جَاءَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم بِقَدَحٍ فِيهِ نَبِيذٌ وَهُوَ عِنْدَ الرُّكْنِ وَدَفَعَ إِلَيْهِ الْقَدَحَ فَرَفَعَهُ إِلَى فِيهِ فَوَجَدَهُ شَدِيدًا فَرَدَّهُ عَلَى صَاحِبِهِ فَقَالَ لَهُ رَجُلٌ مِنَ الْقَوْمِ يَا رَسُولَ اللَّهِ أَحَرَامٌ هُوَ فَقَالَ ‏\"‏ عَلَىَّ بِالرَّجُلِ ‏\"‏ ‏.‏ فَأُتِيَ بِهِ فَأَخَذَ مِنْهُ الْقَدَحَ ثُمَّ دَعَا بِمَاءٍ فَصَبَّهُ فِيهِ فَرَفَعَهُ إِلَى فِيهِ فَقَطَّبَ ثُمَّ دَعَا بِمَاءٍ أَيْضًا فَصَبَّهُ فِيهِ ثُمَّ قَالَ ‏\"‏ إِذَا اغْتَلَمَتْ عَلَيْكُمْ هَذِهِ الأَوْعِيَةُ فَاكْسِرُوا مُتُونَهَا بِالْمَاءِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 5695,
			"arabicnumber": 5695,
			"text": "وَأَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ، عَنْ أَبِي مُعَاوِيَةَ، قَالَ حَدَّثَنَا أَبُو إِسْحَاقَ الشَّيْبَانِيُّ، عَنْ عَبْدِ الْمَلِكِ بْنِ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِنَحْوِهِ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ عَبْدُ الْمَلِكِ بْنُ نَافِعٍ لَيْسَ بِالْمَشْهُورِ وَلاَ يُحْتَجُّ بِحَدِيثِهِ وَالْمَشْهُورُ عَنِ ابْنِ عُمَرَ خِلاَفُ حِكَايَتِهِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 5696,
			"arabicnumber": 5696,
			"text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ أَبِي عَوَانَةَ، عَنْ زَيْدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَجُلاً، سَأَلَ عَنِ الأَشْرِبَةِ، فَقَالَ اجْتَنِبْ كُلَّ شَىْءٍ يَنِشُّ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 5697,
			"arabicnumber": 5697,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ أَنْبَأَنَا أَبُو عَوَانَةَ، عَنْ زَيْدِ بْنِ جُبَيْرٍ، قَالَ سَأَلْتُ ابْنَ عُمَرَ عَنِ الأَشْرِبَةِ، فَقَالَ اجْتَنِبْ كُلَّ شَىْءٍ يَنِشُّ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 5698,
			"arabicnumber": 5698,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ سُلَيْمَانَ التَّيْمِيِّ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنِ ابْنِ عُمَرَ، قَالَ الْمُسْكِرُ قَلِيلُهُ وَكَثِيرُهُ حَرَامٌ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 5699,
			"arabicnumber": 5699,
			"text": "قَالَ الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، عَنِ ابْنِ الْقَاسِمِ، أَخْبَرَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ كُلُّ مُسْكِرٍ خَمْرٌ وَكُلُّ مُسْكِرٍ حَرَامٌ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 5700,
			"arabicnumber": 5700,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا الْمُعْتَمِرُ، قَالَ سَمِعْتُ شَبِيبًا، - وَهُوَ ابْنُ عَبْدِ الْمَلِكِ - يَقُولُ حَدَّثَنِي مُقَاتِلُ بْنُ حَيَّانَ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ حَرَّمَ اللَّهُ الْخَمْرَ وَكُلُّ مُسْكِرٍ حَرَامٌ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 5701,
			"arabicnumber": 5701,
			"text": "أَخْبَرَنَا الْحُسَيْنُ بْنُ مَنْصُورٍ، - يَعْنِي ابْنَ جَعْفَرٍ النَّيْسَابُورِيَّ - قَالَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، قَالَ أَنْبَأَنَا مُحَمَّدُ بْنُ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ كُلُّ مُسْكِرٍ حَرَامٌ وَكُلُّ مُسْكِرٍ خَمْرٌ ‏\"‏ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ وَهَؤُلاَءِ أَهْلُ الثَّبْتِ وَالْعَدَالَةِ مَشْهُورُونَ بِصِحَّةِ النَّقْلِ وَعَبْدِ الْمَلِكِ لاَ يَقُومُ مَقَامَ وَاحِدٍ مِنْهُمْ وَلَوْ عَاضَدَهُ مِنْ أَشْكَالِهِ جَمَاعَةٌ وَبِاللَّهِ التَّوْفِيقُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 5702,
			"arabicnumber": 5702,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ السَّعِيدِيِّ، قَالَ حَدَّثَتْنِي رُقَيَّةُ بِنْتُ عَمْرِو بْنِ سَعِيدٍ، قَالَتْ كُنْتُ فِي حَجْرِ ابْنِ عُمَرَ فَكَانَ يُنْقَعُ لَهُ الزَّبِيبُ فَيَشْرَبُهُ مِنَ الْغَدِ ثُمَّ يُجَفَّفُ الزَّبِيبُ وَيُلْقَى عَلَيْهِ زَبِيبٌ آخَرُ وَيُجْعَلُ فِيهِ مَاءٌ فَيَشْرَبُهُ مِنَ الْغَدِ حَتَّى إِذَا كَانَ بَعْدَ الْغَدِ طَرَحَهُ ‏.‏ وَاحْتَجُّوا بِحَدِيثِ أَبِي مَسْعُودٍ عُقْبَةَ بْنِ عَمْرٍو ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 5703,
			"arabicnumber": 5703,
			"text": "أَخْبَرَنَا الْحَسَنُ بْنُ إِسْمَاعِيلَ بْنِ سُلَيْمَانَ، قَالَ أَنْبَأَنَا يَحْيَى بْنُ يَمَانٍ، عَنْ سُفْيَانَ، عَنْ مَنْصُورٍ، عَنْ خَالِدِ بْنِ سَعْدٍ، عَنْ أَبِي مَسْعُودٍ، قَالَ عَطِشَ النَّبِيُّ صلى الله عليه وسلم حَوْلَ الْكَعْبَةِ فَاسْتَسْقَى فَأُتِيَ بِنَبِيذٍ مِنَ السِّقَايَةِ فَشَمَّهُ فَقَطَّبَ فَقَالَ ‏\"‏ عَلَىَّ بِذَنُوبٍ مِنْ زَمْزَمَ ‏\"‏ ‏.‏ فَصَبَّ عَلَيْهِ ثُمَّ شَرِبَ فَقَالَ رَجُلٌ أَحَرَامٌ هُوَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ لاَ ‏\"‏ ‏.‏ وَهَذَا خَبَرٌ ضَعِيفٌ لأَنَّ يَحْيَى بْنَ يَمَانٍ انْفَرَدَ بِهِ دُونَ أَصْحَابِ سُفْيَانَ وَيَحْيَى بْنُ يَمَانٍ لاَ يُحْتَجُّ بِحَدِيثِهِ لِسُوءِ حِفْظِهِ وَكَثْرَةِ خَطَئِهِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 5704,
			"arabicnumber": 5704,
			"text": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ حَدَّثَنَا عُثْمَانُ بْنُ حِصْنٍ، قَالَ حَدَّثَنَا زَيْدُ بْنُ وَاقِدٍ، عَنْ خَالِدِ بْنِ حُسَيْنٍ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ عَلِمْتُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَصُومُ فِي بَعْضِ الأَيَّامِ الَّتِي كَانَ يَصُومُهَا فَتَحَيَّنْتُ فِطْرَهُ بِنَبِيذٍ صَنَعْتُهُ فِي دُبَّاءٍ فَلَمَّا كَانَ الْمَسَاءُ جِئْتُهُ أَحْمِلُهَا إِلَيْهِ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي قَدْ عَلِمْتُ أَنَّكَ تَصُومُ فِي هَذَا الْيَوْمِ فَتَحَيَّنْتُ فِطْرَكَ بِهَذَا النَّبِيذِ ‏.‏ فَقَالَ ‏\"‏ أَدْنِهِ مِنِّي يَا أَبَا هُرَيْرَةَ ‏\"‏ ‏.‏ فَرَفَعْتُهُ إِلَيْهِ فَإِذَا هُوَ يَنِشُّ فَقَالَ ‏\"‏ خُذْ هَذِهِ فَاضْرِبْ بِهَا الْحَائِطَ فَإِنَّ هَذَا شَرَابُ مَنْ لاَ يُؤْمِنُ بِاللَّهِ وَلاَ بِالْيَوْمِ الآخِرِ ‏\"‏ ‏.‏ وَمِمَّا احْتَجُّوا بِهِ فِعْلُ عُمَرَ بْنِ الْخَطَّابِ رضى الله عنه ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 5705,
			"arabicnumber": 5705,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنِ السَّرِيِّ بْنِ يَحْيَى، قَالَ حَدَّثَنَا أَبُو حَفْصٍ، - إِمَامٌ لَنَا وَكَانَ مِنْ أَسْنَانِ الْحَسَنِ - عَنْ أَبِي رَافِعٍ أَنَّ عُمَرَ بْنَ الْخَطَّابِ رضى الله عنه قَالَ إِذَا خَشِيتُمْ مِنْ نَبِيذٍ شِدَّتَهُ فَاكْسِرُوهُ بِالْمَاءِ - قَالَ عَبْدُ اللَّهِ - مِنْ قَبْلِ أَنْ يَشْتَدَّ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 5706,
			"arabicnumber": 5706,
			"text": "أَخْبَرَنَا زَكَرِيَّا بْنُ يَحْيَى، قَالَ حَدَّثَنَا عَبْدُ الأَعْلَى، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ يَحْيَى بْنِ سَعِيدٍ، سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ تَلَقَّتْ ثَقِيفٌ عُمَرَ بِشَرَابٍ فَدَعَا بِهِ فَلَمَّا قَرَّبَهُ إِلَى فِيهِ كَرِهَهُ فَدَعَا بِهِ فَكَسَرَهُ بِالْمَاءِ فَقَالَ هَكَذَا فَافْعَلُوا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 5707,
			"arabicnumber": 5707,
			"text": "أَخْبَرَنَا أَبُو بَكْرِ بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا أَبُو خَيْثَمَةَ، قَالَ حَدَّثَنَا عَبْدُ الصَّمَدِ، ‏{‏ قَالَ حَدَّثَنَا أَبِي، ‏}‏ عَنْ مُحَمَّدِ بْنِ جُحَادَةَ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ، عَنْ عُتْبَةَ بْنِ فَرْقَدٍ، قَالَ كَانَ النَّبِيذُ الَّذِي يَشْرَبُهُ عُمَرُ بْنُ الْخَطَّابِ قَدْ خُلِّلَ ‏.‏ وَمِمَّا يَدُلُّ عَلَى صِحَّةِ هَذَا حَدِيثُ السَّائِبِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 5708,
			"arabicnumber": 5708,
			"text": "قَالَ الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، عَنِ ابْنِ الْقَاسِمِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنِ السَّائِبِ بْنِ يَزِيدَ، أَنَّهُ أَخْبَرَهُ أَنَّ عُمَرَ بْنَ الْخَطَّابِ خَرَجَ عَلَيْهِمْ فَقَالَ إِنِّي وَجَدْتُ مِنْ فُلاَنٍ رِيحَ شَرَابٍ فَزَعَمَ أَنَّهُ شَرَابُ الطِّلاَءِ وَأَنَا سَائِلٌ عَمَّا شَرِبَ فَإِنْ كَانَ مُسْكِرًا جَلَدْتُهُ فَجَلَدَهُ عُمَرُ بْنُ الْخَطَّابِ رضى الله عنه الْحَدَّ تَامًّا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 5709,
			"arabicnumber": 5709,
			"text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنْ عُمَارَةَ بْنِ غَزِيَّةَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ رَجُلاً، مِنْ جَيْشَانَ - وَجَيْشَانُ مِنَ الْيَمَنِ - قَدِمَ فَسَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ شَرَابٍ يَشْرَبُونَهُ بِأَرْضِهِمْ مِنَ الذُّرَةِ يُقَالُ لَهُ الْمِزْرُ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَمُسْكِرٌ هُوَ ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ كُلُّ مُسْكِرٍ حَرَامٌ إِنَّ اللَّهَ عَزَّ وَجَلَّ عَهِدَ لِمَنْ شَرِبَ الْمُسْكِرَ أَنْ يَسْقِيَهُ مِنْ طِينَةِ الْخَبَالِ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ وَمَا طِينَةُ الْخَبَالِ قَالَ ‏\"‏ عَرَقُ أَهْلِ النَّارِ أَوْ قَالَ عُصَارَةُ أَهْلِ النَّارِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 5710,
			"arabicnumber": 5710,
			"text": "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، عَنْ يَزِيدَ، - وَهُوَ ابْنُ زُرَيْعٍ - عَنِ ابْنِ عَوْنٍ، عَنِ الشَّعْبِيِّ، عَنِ النُّعْمَانِ بْنِ بَشِيرٍ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ إِنَّ الْحَلاَلَ بَيِّنٌ وَإِنَّ الْحَرَامَ بَيِّنٌ وَإِنَّ بَيْنَ ذَلِكَ أُمُورًا مُشْتَبِهَاتٍ ‏\"‏ ‏.‏ وَرُبَّمَا قَالَ ‏\"‏ وَإِنَّ بَيْنَ ذَلِكَ أُمُورًا مُشْتَبِهَةً وَسَأَضْرِبُ فِي ذَلِكَ مَثَلاً إِنَّ اللَّهَ عَزَّ وَجَلَّ حَمَى حِمًى وَإِنَّ حِمَى اللَّهِ مَا حَرَّمَ وَإِنَّهُ مَنْ يَرْعَ حَوْلَ الْحِمَى يُوشِكُ أَنْ يُخَالِطَ الْحِمَى ‏\"‏ ‏.‏ وَرُبَّمَا قَالَ ‏\"‏ يُوشِكُ أَنْ يَرْتَعَ وَإِنَّ مَنْ خَالَطَ الرِّيبَةَ يُوشِكُ أَنْ يَجْسُرَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 5711,
			"arabicnumber": 5711,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ أَبَانَ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، قَالَ أَنْبَأَنَا شُعْبَةُ، عَنْ بُرَيْدِ بْنِ أَبِي مَرْيَمَ، عَنْ أَبِي الْحَوْرَاءِ السَّعْدِيِّ، قَالَ قُلْتُ لِلْحَسَنِ بْنِ عَلِيٍّ رضى الله عنهما مَا حَفِظْتَ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ حَفِظْتُ مِنْهُ ‏ \"‏ دَعْ مَا يَرِيبُكَ إِلَى مَا لاَ يَرِيبُكَ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 5712,
			"arabicnumber": 5712,
			"text": "أَخْبَرَنَا الْجَارُودُ بْنُ مُعَاذٍ، - هُوَ بَاوَرْدِيٌّ - قَالَ حَدَّثَنَا أَبُو سُفْيَانَ، مُحَمَّدُ بْنُ حُمَيْدٍ عَنْ مَعْمَرٍ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، أَنَّهُ كَانَ يَكْرَهُ أَنْ يَبِيعَ الزَّبِيبَ، لِمَنْ يَتَّخِذُهُ نَبِيذًا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 5713,
			"arabicnumber": 5713,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ سُفْيَانَ بْنِ دِينَارٍ، عَنْ مُصْعَبِ بْنِ سَعْدٍ، قَالَ كَانَ لِسَعْدٍ كُرُومٌ وَأَعْنَابٌ كَثِيرَةٌ وَكَانَ لَهُ فِيهَا أَمِينٌ فَحَمَلَتْ عِنَبًا كَثِيرًا فَكَتَبَ إِلَيْهِ إِنِّي أَخَافُ عَلَى الأَعْنَابِ الضَّيْعَةَ فَإِنْ رَأَيْتَ أَنْ أَعْصُرَهُ عَصَرْتُهُ فَكَتَبَ إِلَيْهِ سَعْدٌ إِذَا جَاءَكَ كِتَابِي هَذَا فَاعْتَزِلْ ضَيْعَتِي فَوَاللَّهِ لاَ أَئْتَمِنُكَ عَلَى شَىْءٍ بَعْدَهُ أَبَدًا ‏.‏ فَعَزَلَهُ عَنْ ضَيْعَتِهِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 5714,
			"arabicnumber": 5714,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ هَارُونَ بْنِ إِبْرَاهِيمَ، عَنِ ابْنِ سِيرِينَ، قَالَ بِعْهُ عَصِيرًا مِمَّنْ يَتَّخِذُهُ طِلاَءً وَلاَ يَتَّخِذُهُ خَمْرًا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 5715,
			"arabicnumber": 5715,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا الْمُعْتَمِرُ، قَالَ سَمِعْتُ مَنْصُورًا، عَنْ إِبْرَاهِيمَ، عَنْ نُبَاتَةَ، عَنْ سُوَيْدِ بْنِ غَفَلَةَ، قَالَ كَتَبَ عُمَرُ بْنُ الْخَطَّابِ إِلَى بَعْضِ عُمَّالِهِ أَنِ ارْزُقِ، الْمُسْلِمِينَ مِنَ الطِّلاَءِ مَا ذَهَبَ ثُلُثَاهُ وَبَقِيَ ثُلُثُهُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 5716,
			"arabicnumber": 5716,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ سُلَيْمَانَ التَّيْمِيِّ، عَنْ أَبِي مِجْلَزٍ، عَنْ عَامِرِ بْنِ عَبْدِ اللَّهِ، أَنَّهُ قَالَ قَرَأْتُ كِتَابَ عُمَرَ بْنِ الْخَطَّابِ إِلَى أَبِي مُوسَى أَمَّا بَعْدُ فَإِنَّهَا قَدِمَتْ عَلَىَّ عِيرٌ مِنَ الشَّامِ تَحْمِلُ شَرَابًا غَلِيظًا أَسْوَدَ كَطِلاَءِ الإِبِلِ وَإِنِّي سَأَلْتُهُمْ عَلَى كَمْ يَطْبُخُونَهُ فَأَخْبَرُونِي أَنَّهُمْ يَطْبُخُونَهُ عَلَى الثُّلُثَيْنِ ذَهَبَ ثُلُثَاهُ الأَخْبَثَانِ ثُلُثٌ بِبَغْيِهِ وَثُلُثٌ بِرِيحِهِ فَمُرْ مَنْ قِبَلَكَ يَشْرَبُونَهُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 5717,
			"arabicnumber": 5717,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ هِشَامٍ، عَنِ ابْنِ سِيرِينَ، أَنَّ عَبْدَ اللَّهِ بْنَ يَزِيدَ الْخَطْمِيَّ، قَالَ كَتَبَ إِلَيْنَا عُمَرُ بْنُ الْخَطَّابِ رضى الله عنه أَمَّا بَعْدُ فَاطْبُخُوا شَرَابَكُمْ حَتَّى يَذْهَبُ مِنْهُ نَصِيبُ الشَّيْطَانِ فَإِنَّ لَهُ اثْنَيْنِ وَلَكُمْ وَاحِدٌ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 5718,
			"arabicnumber": 5718,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ جَرِيرٍ، عَنْ مُغِيرَةَ، عَنِ الشَّعْبِيِّ، قَالَ كَانَ عَلِيٌّ رضى الله عنه يَرْزُقُ النَّاسَ الطِّلاَءَ يَقَعُ فِيهِ الذُّبَابُ وَلاَ يَسْتَطِيعُ أَنْ يُخْرَجَ مِنْهُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 5719,
			"arabicnumber": 5719,
			"text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ دَاوُدَ، قَالَ سَأَلْتُ سَعِيدًا مَا الشَّرَابُ الَّذِي أَحَلَّهُ عُمَرُ رضى الله عنه قَالَ الَّذِي يُطْبَخُ حَتَّى يَذْهَبَ ثُلُثَاهُ وَيَبْقَى ثُلُثُهُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 5720,
			"arabicnumber": 5720,
			"text": "أَخْبَرَنَا زَكَرِيَّا بْنُ يَحْيَى، قَالَ حَدَّثَنَا عَبْدُ الأَعْلَى، قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ دَاوُدَ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ أَبَا الدَّرْدَاءِ، كَانَ يَشْرَبُ مَا ذَهَبَ ثُلُثَاهُ وَبَقِيَ ثُلُثُهُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 5721,
			"arabicnumber": 5721,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ هُشَيْمٍ، قَالَ أَنْبَأَنَا إِسْمَاعِيلُ بْنُ أَبِي خَالِدٍ، عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ، أَنَّهُ كَانَ يَشْرَبُ مِنَ الطِّلاَءِ مَا ذَهَبَ ثُلُثَاهُ وَبَقِيَ ثُلُثُهُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 5722,
			"arabicnumber": 5722,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ سُفْيَانَ، عَنْ يَعْلَى بْنِ عَطَاءٍ، قَالَ سَمِعْتُ سَعِيدَ بْنَ الْمُسَيَّبِ، وَسَأَلَهُ، أَعْرَابِيٌّ عَنْ شَرَابٍ، يُطْبَخُ عَلَى النِّصْفِ فَقَالَ لاَ حَتَّى يَذْهَبَ ثُلُثَاهُ وَيَبْقَى الثُّلُثُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 5723,
			"arabicnumber": 5723,
			"text": "أَخْبَرَنَا أَحْمَدُ بْنُ خَالِدٍ، عَنْ مَعْنٍ، قَالَ حَدَّثَنَا مُعَاوِيَةُ بْنُ صَالِحٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، قَالَ إِذَا طُبِخَ الطِّلاَءُ عَلَى الثُّلُثِ فَلاَ بَأْسَ بِهِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 5724,
			"arabicnumber": 5724,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ يَزِيدَ بْنِ زُرَيْعٍ، قَالَ حَدَّثَنَا أَبُو رَجَاءٍ، قَالَ سَأَلْتُ الْحَسَنَ عَنِ الطِّلاَءِ الْمُنَصَّفِ، فَقَالَ لاَ تَشْرَبْهُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "-"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 5725,
			"arabicnumber": 5725,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ بَشِيرِ بْنِ الْمُهَاجِرِ، قَالَ سَأَلْتُ الْحَسَنَ عَمَّا يُطْبَخُ مِنَ الْعَصِيرِ قَالَ مَا تَطْبُخُهُ حَتَّى يَذْهَبَ الثُّلُثَانِ وَيَبْقَى الثُّلُثُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 187
			}
		},
		{
			"hadithnumber": 5726,
			"arabicnumber": 5726,
			"text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا وَكِيعٌ، قَالَ حَدَّثَنَا سَعْدُ بْنُ أَوْسٍ، عَنْ أَنَسِ بْنِ سِيرِينَ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، يَقُولُ إِنَّ نُوحًا صلى الله عليه وسلم نَازَعَهُ الشَّيْطَانُ فِي عُودِ الْكَرْمِ فَقَالَ هَذَا لِي وَقَالَ هَذَا لِي فَاصْطَلَحَا عَلَى أَنَّ لِنُوحٍ ثُلُثَهَا وَلِلشَّيْطَانِ ثُلُثَيْهَا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 188
			}
		},
		{
			"hadithnumber": 5727,
			"arabicnumber": 5727,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ عَبْدِ الْمَلِكِ بْنِ طُفَيْلٍ الْجَزَرِيِّ، قَالَ كَتَبَ إِلَيْنَا عُمَرُ بْنُ عَبْدِ الْعَزِيزِ أَنْ لاَ، تَشْرَبُوا مِنَ الطِّلاَءِ حَتَّى يَذْهَبَ ثُلُثَاهُ وَيَبْقَى ثُلُثُهُ وَكُلُّ مُسْكِرٍ حَرَامٌ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 189
			}
		},
		{
			"hadithnumber": 5728,
			"arabicnumber": 5728,
			"text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا الْمُعْتَمِرُ، عَنْ بُرْدٍ، عَنْ مَكْحُولٍ، قَالَ كُلُّ مُسْكِرٍ حَرَامٌ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 190
			}
		},
		{
			"hadithnumber": 5729,
			"arabicnumber": 5729,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ أَبِي يَعْفُورٍ السَّلَمِيِّ، عَنْ أَبِي ثَابِتٍ الثَّعْلَبِيِّ، قَالَ كُنْتُ عِنْدَ ابْنِ عَبَّاسٍ فَجَاءَهُ رَجُلٌ فَسَأَلَهُ عَنِ الْعَصِيرِ، فَقَالَ اشْرَبْهُ مَا كَانَ طَرِيًّا ‏.‏ قَالَ إِنِّي طَبَخْتُ شَرَابًا وَفِي نَفْسِي مِنْهُ ‏.‏ قَالَ أَكُنْتَ شَارِبَهُ قَبْلَ أَنْ تَطْبُخَهُ قَالَ لاَ ‏.‏ قَالَ فَإِنَّ النَّارَ لاَ تُحِلُّ شَيْئًا قَدْ حَرُمَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 191
			}
		},
		{
			"hadithnumber": 5730,
			"arabicnumber": 5730,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنِ ابْنِ جُرَيْجٍ، قِرَاءَةً أَخْبَرَنِي عَطَاءٌ، قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ، يَقُولُ وَاللَّهِ مَا تُحِلُّ النَّارُ شَيْئًا وَلاَ تُحَرِّمُهُ ‏.‏ قَالَ ثُمَّ فَسَّرَ لِي قَوْلَهُ لاَ تُحِلُّ شَيْئًا لِقَوْلِهِمْ فِي الطِّلاَءِ وَلاَ تُحَرِّمُهُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 192
			}
		},
		{
			"hadithnumber": 5731,
			"arabicnumber": 5731,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ حَيْوَةَ بْنِ شُرَيْحٍ، قَالَ أَخْبَرَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، قَالَ اشْرَبِ الْعَصِيرَ مَا لَمْ يُزْبِدْ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 193
			}
		},
		{
			"hadithnumber": 5732,
			"arabicnumber": 5732,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ هِشَامِ بْنِ عَائِذٍ الأَسَدِيِّ، قَالَ سَأَلْتُ إِبْرَاهِيمَ عَنِ الْعَصِيرِ، قَالَ اشْرَبْهُ حَتَّى يَغْلِيَ مَا لَمْ يَتَغَيَّرْ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 194
			}
		},
		{
			"hadithnumber": 5733,
			"arabicnumber": 5733,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ عَبْدِ الْمَلِكِ، عَنْ عَطَاءٍ، فِي الْعَصِيرِ قَالَ اشْرَبْهُ حَتَّى يَغْلِيَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 195
			}
		},
		{
			"hadithnumber": 5734,
			"arabicnumber": 5734,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ حَمَّادِ بْنِ سَلَمَةَ، عَنْ دَاوُدَ، عَنِ الشَّعْبِيِّ، قَالَ اشْرَبْهُ ثَلاَثَةَ أَيَّامٍ إِلاَّ أَنْ يَغْلِيَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 196
			}
		},
		{
			"hadithnumber": 5735,
			"arabicnumber": 5735,
			"text": "أَخْبَرَنِي عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدِ بْنِ كَثِيرٍ، قَالَ حَدَّثَنَا بَقِيَّةُ، قَالَ حَدَّثَنِي الأَوْزَاعِيُّ، عَنْ يَحْيَى بْنِ أَبِي عَمْرٍو، عَنْ عَبْدِ اللَّهِ بْنِ الدَّيْلَمِيِّ، عَنْ أَبِيهِ، فَيْرُوزَ قَالَ قَدِمْتُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّا أَصْحَابُ كَرْمٍ وَقَدْ أَنْزَلَ اللَّهُ عَزَّ وَجَلَّ تَحْرِيمَ الْخَمْرِ فَمَاذَا نَصْنَعُ قَالَ ‏\"‏ تَتَّخِذُونَهُ زَبِيبًا ‏\"‏ ‏.‏ قُلْتُ فَنَصْنَعُ بِالزَّبِيبِ مَاذَا قَالَ ‏\"‏ تَنْقَعُونَهُ عَلَى غَدَائِكُمْ وَتَشْرَبُونَهُ عَلَى عَشَائِكُمْ وَتَنْقَعُونَهُ عَلَى عَشَائِكُمْ وَتَشْرَبُونَهُ عَلَى غَدَائِكُمْ ‏\"‏ ‏.‏ قُلْتُ أَفَلاَ نُؤَخِّرُهُ حَتَّى يَشْتَدَّ قَالَ ‏\"‏ لاَ تَجْعَلُوهُ فِي الْقُلَلِ وَاجْعَلُوهُ فِي الشِّنَانِ فَإِنَّهُ إِنْ تَأَخَّرَ صَارَ خَلاًّ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 197
			}
		},
		{
			"hadithnumber": 5736,
			"arabicnumber": 5736,
			"text": "أَخْبَرَنَا عِيسَى بْنُ مُحَمَّدٍ أَبُو عُمَيْرِ بْنُ النَّحَّاسِ، عَنْ ضَمْرَةَ، عَنِ الشَّيْبَانِيِّ، عَنِ ابْنِ الدَّيْلَمِيِّ، عَنْ أَبِيهِ، قَالَ قُلْنَا يَا رَسُولَ اللَّهِ إِنَّ لَنَا أَعْنَابًا فَمَاذَا نَصْنَعُ بِهَا قَالَ ‏\"‏ زَبِّبُوهَا ‏\"‏ ‏.‏ قُلْنَا فَمَا نَصْنَعُ بِالزَّبِيبِ قَالَ ‏\"‏ انْبِذُوهُ عَلَى غَدَائِكُمْ وَاشْرَبُوهُ عَلَى عَشَائِكُمْ وَانْبِذُوهُ عَلَى عَشَائِكُمْ وَاشْرَبُوهُ عَلَى غَدَائِكُمْ وَانْبِذُوهُ فِي الشِّنَانِ وَلاَ تَنْبِذُوهُ فِي الْقِلاَلِ فَإِنَّهُ إِنْ تَأَخَّرَ صَارَ خَلاًّ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 198
			}
		},
		{
			"hadithnumber": 5737,
			"arabicnumber": 5737,
			"text": "أَخْبَرَنَا أَبُو دَاوُدَ الْحَرَّانِيُّ، قَالَ حَدَّثَنَا يَعْلَى بْنُ عُبَيْدٍ، قَالَ حَدَّثَنَا مُطِيعٌ، عَنْ أَبِي عُمَرَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَ يُنْبَذُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَيَشْرَبُهُ مِنَ الْغَدِ وَمِنْ بَعْدِ الْغَدِ فَإِذَا كَانَ مَسَاءُ الثَّالِثَةِ فَإِنْ بَقِيَ فِي الإِنَاءِ شَىْءٌ لَمْ يَشْرَبُوهُ أُهْرِيقَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 199
			}
		},
		{
			"hadithnumber": 5738,
			"arabicnumber": 5738,
			"text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ، قَالَ حَدَّثَنَا شَرِيكٌ، عَنْ أَبِي إِسْحَاقَ، عَنْ يَحْيَى بْنِ عُبَيْدٍ الْبَهْرَانِيِّ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُنْقَعُ لَهُ الزَّبِيبُ فَيَشْرَبُهُ يَوْمَهُ وَالْغَدَ وَبَعْدَ الْغَدِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 200
			}
		},
		{
			"hadithnumber": 5739,
			"arabicnumber": 5739,
			"text": "أَخْبَرَنَا وَاصِلُ بْنُ عَبْدِ الأَعْلَى، عَنِ ابْنِ فُضَيْلٍ، عَنِ الأَعْمَشِ، عَنْ يَحْيَى بْنِ أَبِي عُمَرَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُنْبَذُ لَهُ نَبِيذُ الزَّبِيبِ مِنَ اللَّيْلِ فَيَجْعَلُهُ فِي سِقَاءٍ فَيَشْرَبُهُ يَوْمَهُ ذَلِكَ وَالْغَدَ وَبَعْدَ الْغَدِ فَإِذَا كَانَ مِنْ آخِرِ الثَّالِثَةِ سَقَاهُ أَوْ شَرِبَهُ فَإِنْ أَصْبَحَ مِنْهُ شَىْءٌ أَهْرَاقَهُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 201
			}
		},
		{
			"hadithnumber": 5740,
			"arabicnumber": 5740,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّهُ كَانَ يُنْبَذُ لَهُ فِي سِقَاءِ الزَّبِيبِ غُدْوَةً فَيَشْرَبُهُ مِنَ اللَّيْلِ وَيُنْبَذُ لَهُ عَشِيَّةً فَيَشْرَبُهُ غُدْوَةً وَكَانَ يَغْسِلُ الأَسْقِيَةَ وَلاَ يَجْعَلُ فِيهَا دُرْدِيًّا وَلاَ شَيْئًا ‏.‏ قَالَ نَافِعٌ فَكُنَّا نَشْرَبُهُ مِثْلَ الْعَسَلِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 202
			}
		},
		{
			"hadithnumber": 5741,
			"arabicnumber": 5741,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ بَسَّامٍ، قَالَ سَأَلْتُ أَبَا جَعْفَرٍ عَنِ النَّبِيذِ، قَالَ كَانَ عَلِيُّ بْنُ حُسَيْنٍ رضى الله عنه يُنْبَذُ لَهُ مِنَ اللَّيْلِ فَيَشْرَبُهُ غُدْوَةً وَيُنْبَذُ لَهُ غُدْوَةً فَيَشْرَبُهُ مِنَ اللَّيْلِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 203
			}
		},
		{
			"hadithnumber": 5742,
			"arabicnumber": 5742,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، قَالَ سَمِعْتُ سُفْيَانَ، سُئِلَ عَنِ النَّبِيذِ، قَالَ انْتَبِذْ عَشِيًّا وَاشْرَبْهُ غُدْوَةً ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 204
			}
		},
		{
			"hadithnumber": 5743,
			"arabicnumber": 5743,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ سُلَيْمَانَ التَّيْمِيِّ، عَنْ أَبِي عُثْمَانَ، وَلَيْسَ، بِالنَّهْدِيِّ أَنَّ أُمَّ الْفَضْلِ، أَرْسَلَتْ إِلَى أَنَسِ بْنِ مَالِكٍ تَسْأَلُهُ عَنْ نَبِيذِ الْجَرِّ فَحَدَّثَهَا عَنِ النَّضْرِ ابْنِهِ أَنَّهُ كَانَ يُنْبَذُ فِي جَرٍّ يُنْبَذُ غُدْوَةً وَيَشْرَبُهُ عَشِيَّةً ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 205
			}
		},
		{
			"hadithnumber": 5744,
			"arabicnumber": 5744,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ مَعْمَرٍ، عَنْ قَتَادَةَ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ كَانَ يَكْرَهُ أَنْ يَجْعَلَ، نَطْلَ النَّبِيذِ فِي النَّبِيذِ لِيَشْتَدَّ بِالنَّطْلِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 206
			}
		},
		{
			"hadithnumber": 5745,
			"arabicnumber": 5745,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ سُفْيَانَ، عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ قَالَ فِي النَّبِيذِ خَمْرُهُ دُرْدِيُّهُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 207
			}
		},
		{
			"hadithnumber": 5746,
			"arabicnumber": 5746,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ شُعْبَةَ، عَنْ قَتَادَةَ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، قَالَ إِنَّمَا سُمِّيَتِ الْخَمْرُ لأَنَّهَا تُرِكَتْ حَتَّى مَضَى صَفْوُهَا وَبَقِيَ كَدَرُهَا ‏.‏ وَكَانَ يَكْرَهُ كُلَّ شَىْءٍ يُنْبَذُ عَلَى عَكَرٍ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 208
			}
		},
		{
			"hadithnumber": 5747,
			"arabicnumber": 5747,
			"text": "أَخْبَرَنَا أَبُو بَكْرِ بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا الْقَوَارِيرِيُّ، قَالَ حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ، قَالَ حَدَّثَنَا حَسَنُ بْنُ عَمْرٍو، عَنْ فُضَيْلِ بْنِ عَمْرٍو، عَنْ إِبْرَاهِيمَ، قَالَ كَانُوا يَرَوْنَ أَنَّ مَنْ، شَرِبَ شَرَابًا فَسَكِرَ مِنْهُ لَمْ يَصْلُحْ لَهُ أَنْ يَعُودَ فِيهِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 209
			}
		},
		{
			"hadithnumber": 5748,
			"arabicnumber": 5748,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ سُفْيَانَ، عَنْ مُغِيرَةَ، عَنْ أَبِي مَعْشَرٍ، عَنْ إِبْرَاهِيمَ، قَالَ لاَ بَأْسَ بِنَبِيذِ الْبُخْتُجِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 210
			}
		},
		{
			"hadithnumber": 5749,
			"arabicnumber": 5749,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ أَبِي عَوَانَةَ، عَنْ أَبِي مِسْكِينٍ، قَالَ سَأَلْتُ إِبْرَاهِيمَ قُلْتُ إِنَّا نَأْخُذُ دُرْدِيَّ الْخَمْرِ أَوِ الطِّلاَءَ فَنُنَظِّفُهُ ثُمَّ نَنْقَعُ فِيهِ الزَّبِيبَ ثَلاَثًا ثُمَّ نُصَفِّيهِ ثُمَّ نَدَعُهُ حَتَّى يَبْلُغَ فَنَشْرَبُهُ قَالَ يُكْرَهُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 211
			}
		},
		{
			"hadithnumber": 5750,
			"arabicnumber": 5750,
			"text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا جَرِيرٌ، عَنِ ابْنِ شُبْرُمَةَ، قَالَ رَحِمَ اللَّهُ إِبْرَاهِيمَ شَدَّدَ النَّاسُ فِي النَّبِيذِ وَرَخَّصَ فِيهِ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 212
			}
		},
		{
			"hadithnumber": 5751,
			"arabicnumber": 5751,
			"text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، عَنْ أَبِي أُسَامَةَ، قَالَ سَمِعْتُ ابْنَ الْمُبَارَكِ، يَقُولُ مَا وَجَدْتُ الرُّخْصَةَ فِي الْمُسْكِرِ عَنْ أَحَدٍ صَحِيحًا إِلاَّ عَنْ إِبْرَاهِيمَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 213
			}
		},
		{
			"hadithnumber": 5752,
			"arabicnumber": 5752,
			"text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالَ سَمِعْتُ أَبَا أُسَامَةَ، يَقُولُ مَا رَأَيْتُ رَجُلاً أَطْلَبَ لِلْعِلْمِ مِنْ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ الشَّامَاتِ وَمِصْرَ وَالْيَمَنَ وَالْحِجَازَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 214
			}
		},
		{
			"hadithnumber": 5753,
			"arabicnumber": 5753,
			"text": "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا أَسَدُ بْنُ مُوسَى، قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، رضى الله عنه قَالَ كَانَ لأُمِّ سُلَيْمٍ قَدَحٌ مِنْ عَيْدَانٍ فَقَالَتْ سَقَيْتُ فِيهِ رَسُولَ اللَّهِ صلى الله عليه وسلم كُلَّ الشَّرَابِ الْمَاءَ وَالْعَسَلَ وَاللَّبَنَ وَالنَّبِيذَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 215
			}
		},
		{
			"hadithnumber": 5754,
			"arabicnumber": 5754,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ سُفْيَانَ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، عَنْ ذَرِّ بْنِ عَبْدِ اللَّهِ، عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى، عَنْ أَبِيهِ، قَالَ سَأَلْتُ أُبَىَّ بْنَ كَعْبٍ عَنِ النَّبِيذِ، فَقَالَ اشْرَبِ الْمَاءَ وَاشْرَبِ الْعَسَلَ وَاشْرَبِ السَّوِيقَ وَاشْرَبِ اللَّبَنَ الَّذِي نُجِعَتْ بِهِ ‏.‏ فَعَاوَدْتُهُ فَقَالَ الْخَمْرَ تُرِيدُ الْخَمْرَ تُرِيدُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 216
			}
		},
		{
			"hadithnumber": 5755,
			"arabicnumber": 5755,
			"text": "أَخْبَرَنِي أَحْمَدُ بْنُ عَلِيِّ بْنِ سَعِيدِ بْنِ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا الْقَوَارِيرِيُّ، قَالَ حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ، عَنْ أَبِيهِ، عَنْ مُحَمَّدٍ، عَنْ عَبِيدَةَ، عَنِ ابْنِ مَسْعُودٍ، قَالَ أَحْدَثَ النَّاسُ أَشْرِبَةً مَا أَدْرِي مَا هِيَ فَمَا لِي شَرَابٌ مُنْذُ عِشْرِينَ سَنَةً أَوْ قَالَ أَرْبَعِينَ سَنَةً إِلاَّ الْمَاءُ وَالسَّوِيقُ غَيْرَ أَنَّهُ لَمْ يَذْكُرِ النَّبِيذَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 217
			}
		},
		{
			"hadithnumber": 5756,
			"arabicnumber": 5756,
			"text": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنِ ابْنِ عَوْنٍ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ عَبِيدَةَ، قَالَ أَحْدَثَ النَّاسُ أَشْرِبَةً مَا أَدْرِي مَا هِيَ وَمَا لِي شَرَابٌ مُنْذُ عِشْرِينَ سَنَةً إِلاَّ الْمَاءُ وَاللَّبَنُ وَالْعَسَلُ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 218
			}
		},
		{
			"hadithnumber": 5757,
			"arabicnumber": 5757,
			"text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا جَرِيرٌ، عَنِ ابْنِ شُبْرُمَةَ، قَالَ قَالَ طَلْحَةُ لأَهْلِ الْكُوفَةِ فِي النَّبِيذِ فِتْنَةٌ يَرْبُو فِيهَا الصَّغِيرُ وَيَهْرَمُ فِيهَا الْكَبِيرُ قَالَ وَكَانَ إِذَا كَانَ فِيهِمْ عُرْسٌ كَانَ طَلْحَةُ وَزُبَيْرٌ يَسْقِيَانِ اللَّبَنَ وَالْعَسَلَ ‏.‏ فَقِيلَ لِطَلْحَةَ أَلاَ تَسْقِيهِمُ النَّبِيذَ قَالَ إِنِّي أَكْرَهُ أَنْ يَسْكَرَ مُسْلِمٌ فِي سَبَبِي ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 219
			}
		},
		{
			"hadithnumber": 5758,
			"arabicnumber": 5758,
			"text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا جَرِيرٌ، قَالَ كَانَ ابْنُ شُبْرُمَةَ لاَ يَشْرَبُ إِلاَّ الْمَاءَ وَاللَّبَنَ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 220
			}
		}
	]
}