{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"10": "The Two 'Ids"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 428,
			"arabicnumber": 428,
			"text": "Yahya related to me from Malik that he had heard more than one of their men of knowledge say, \"There has been no call to prayer or iqama for the id al-Fitr or the id al-Adha since the time of the Messenger of Allah, may Allah bless him and grant him peace.\" Malik said, \"That is the sunna about which there is no disagreement among us",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 428
			}
		},
		{
			"hadithnumber": 429,
			"arabicnumber": 429,
			"text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar used to do ghusl on the day of Fitr before going to the place of prayer",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 429
			}
		},
		{
			"hadithnumber": 430,
			"arabicnumber": 430,
			"text": "Yahya related to me from Malik from Ibn Shihab that the Messenger of Allah, may Allah bless him and grant him peace, used to pray on the day of Fitr and the day of Adha before the khutba",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 430
			}
		},
		{
			"hadithnumber": 431,
			"arabicnumber": 431,
			"text": "Yahya related to me from Malik that he had heard that Abu Bakr and Umar used to do that",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 431
			}
		},
		{
			"hadithnumber": 432,
			"arabicnumber": 432,
			"text": "Yahya related to me from Malik from Ibn Shihab that Abu Ubayd, the mawla of Ibn Azhar said, \"I was present at an id with Umar ibn al- Khattab. He prayed, and then after he had prayed he gave a khutba to the people and said, 'The Messenger of Allah, may Allah bless him and grant him peace, forbade fasting on these two days - the day you break your fast (after Ramadan), and the day you eat from your sacrifice (after Hajj) .' \" Abu Ubaydcontinued,\"Then I was present at an id with Uthman ibn Affan. He came and prayed, and when he had finished he gave a khutba and said, 'Two ids have been joined together for you on this day of yours. If any of the people of al-Aliyya (the hills outlying Madina) want to wait for the jumua they can do so, and if any of them want to return, I have given them permission.' Abu Ubayd continued, \"Then I was present at an id with AIi ibn Abi Talib (at the time when Uthman was being detained). He came and prayed, and then after he had prayed he gave a khutba",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 432
			}
		},
		{
			"hadithnumber": 433,
			"arabicnumber": 433,
			"text": "Yahya related to me from Malik from Hisham ibn Urwa from his father that he used to eat on the day of the id al-Fitr before going out",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 433
			}
		},
		{
			"hadithnumber": 434,
			"arabicnumber": 434,
			"text": "Yahya related to me from Malik from Ibn Shihab that Said al- Musayyab told him that people used to be told to eat on the day of Fitr before setting out. Malik said that he did not consider that people had to do that for Adha",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 434
			}
		},
		{
			"hadithnumber": 435,
			"arabicnumber": 435,
			"text": "Yahya related to me from Malik from Damra ibn Said al-Mazini from Ubaydullah ibn Abdullah ibn Utba ibn Masud that Umar ibn al-Khattab asked Abu Waqid al-Laythi what the Messenger of Allah, may Allah bless him and grant him peace, used to recite in the prayers of Adha and Fitr. He said, \"He used to recite Qaf (Sura 50) and al-lnshiqaq (Sura84)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 435
			}
		},
		{
			"hadithnumber": 436,
			"arabicnumber": 436,
			"text": "Yahya related to me from Malik that Nafi, the mawla of Abdullah ibn Umar said, \"I was at Adha and Fitr with Abu Hurayra and he said 'Allah is greater' seven times in the first raka, before the recitation, and five times in the second, before the recitation",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 436
			}
		},
		{
			"hadithnumber": 437,
			"arabicnumber": 437,
			"text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar did not pray either before the prayer or after it on the day of Fitr",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 437
			}
		},
		{
			"hadithnumber": 438,
			"arabicnumber": 438,
			"text": "Yahya related to me from Malik that he had heard that Said ibn al-Musayyab used to go to the place of prayer after praying subh, and before the sun rose",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 438
			}
		},
		{
			"hadithnumber": 439,
			"arabicnumber": 439,
			"text": "Yahya related to me from Malik from Abd ar-Rahman ibn al-Qasim that his father used to pray four rakas before he went to the place of prayer",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 439
			}
		},
		{
			"hadithnumber": 440,
			"arabicnumber": 440,
			"text": "Yahya related to me from Hisham ibn Urwa that his father used to pray on the day of Fitr before the prayer in the mosque",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 440
			}
		}
	]
}