{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"15": "The Qur'an"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 470,
			"arabicnumber": 470,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 470
			}
		},
		{
			"hadithnumber": 471,
			"arabicnumber": 471,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 471
			}
		},
		{
			"hadithnumber": 472,
			"arabicnumber": 472,
			"text": "Yahya related to me from Malik from Dawud ibn al-Husayn from al- Araj from Abd ar-Rahman ibn Abd al-Qari that Umar ibn al Khattab said, \"Whoever misses reading his hizb at night and reads it from when the sun has passed the meridian until the dhuhr prayer has not missed it, or it is as if he has caught it",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 472
			}
		},
		{
			"hadithnumber": 473,
			"arabicnumber": 473,
			"text": "Yahya related to me from Malik that Yahya ibn Said said, \"Once Muhammad ibn Yahya ibn Habban and I were sitting down, and Muhammad called a man over to him and said to him, 'Tell me what you have heard from your father.' The man replied that his father had told him that he went to Zayd ibn Thabit and asked him, 'What do you think of reciting the whole Qur'an in seven days?' Zayd said, 'That's good, but I prefer to recite it in two weeks, or ten days. Ask me why that is.' He said, 'I ask you then.' Zayd said, 'So that I can reflect on it and pause in it",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 473
			}
		},
		{
			"hadithnumber": 474,
			"arabicnumber": 474,
			"text": "Yahya related to me from Malik from Ibn Shihab from Urwa ibn az- Zubayr that Abd ar-Rahman ibn Abd al-Qari said that he had heard Umar ibn al-Khattab say, \"I heard Hisham ibn Hakim ibn Hizam reciting Surat al-Furqan (Sura 25) differently from me, and it was the Messenger of Allah, may Allah bless him and grant him peace, who had recited it to me. I was about to rush up to him but I granted him a respite until he had finished his prayer. Then I grabbed him by his cloak and took him to the Messenger of Allah, may Allah bless him and grant him peace, and said, 'Messenger of Allah, I heard this man reciting Surat al- Furqan differently from the way you recited it to me.' The Messenger of Allah, may Allah bless him and grant him peace, said, 'Let him go.' Then he said, 'Recite, Hisham,' and Hisham recited as I had heard him recite. The Messenger of Allah, may Allah bless him and grant him peace, said, 'It was sent down like that.' Then he said to me, 'Recite' and I recited the sura, and he said, 'It was sent down like that. This Qur'an was sent down in seven (different) ways, so recite from it whatever is easy for you",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 474
			}
		},
		{
			"hadithnumber": 475,
			"arabicnumber": 475,
			"text": "Yahya related to me from Malik from Nafi from Abdullah ibn Umar that the Messenger of Allah, may Allah bless him and grant him peace, said, \"A man who knows the Qur'an well is like a man who has a hobbled camel. If he takes care of it, he keeps it, and if he lets it go, it gets away",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 475
			}
		},
		{
			"hadithnumber": 476,
			"arabicnumber": 476,
			"text": "Yahya related to me from Malik from Hisham ibn Urwa from his father from A'isha, the wife of the Prophet, may Allah bless him and grant him peace, that al-Harith ibn Hisham asked the Messenger of Allah, may Allah bless him and grant him peace, \"How does the revelation come to you?\" and the Messenger of Allah, may Allah bless him and grant him peace, said, \"Sometimes it comes to me like the ringing of a bell, and that is the hardest for me, and when it leaves me I remember what it has said. And sometimes the angel appears to me in the likeness of a man and talks to me and I remember what he says.\" A'isha added, \"I saw it coming down on him on an intensely cold day, and when it had left him his forehead was dripping with sweat",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 476
			}
		},
		{
			"hadithnumber": 477,
			"arabicnumber": 477,
			"text": "Yahya related to me from Malik from Hisham ibn Urwa that his father said that Abasa (Sura 80) was sent down about Abdullah ibn Umm Maktum. He came to the Prophet, may Allah bless him and grant him peace, and began to say, \"O Muhammad, show me a place near you (where I can sit),\" whilst one of the leading men of the idol worshippers was in audience with the Prophet, may Allah bless him and grant him peace. The Prophet, may Allah bless him and grant him peace, began to turn away from him and give his attention to the other man, and he said to him, \"Father of so-and-so, do you see any harm in what I am saying?\" and he said, \"No, by the blood (of our sacrifices) I see no harm in what you are saying.\" And Abasa - \"He frowned and turned away when the blind man came\" - was sent down",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 477
			}
		},
		{
			"hadithnumber": 478,
			"arabicnumber": 478,
			"text": "Yahya related to me from Malik from Zayd ibn Aslam from his father that the Messenger of Allah, may Allah bless him and grant him peace, was on one of his journeys, and one night Umar ibn al-Khattab, who was travelling with him, asked him about something, but he did not answer him. He asked him again, but he did not answer him. Then he asked him again, and again he did not answer him. Umar said, \"May your mother be bereaved of you, Umar. Three times you have importuned the Messenger of Allah, may Allah bless him and grant him peace, with a question and he has not answered you at all.\" Umar continued, \"I got my camel moving until, when I was in front of the people, I feared that a piece of Qur'an was being sent down about me. It was not long before I heard a crier calling for me, and I said that I feared that a piece of Qur'an had been sent down about me.\" He continued, \"I came to the Messenger of Allah, may Allah bless him and grant him peace, and said, 'Peace be upon you' to him, and he said, 'A sura has been sent down to me this night that is more beloved to me than anything on which the sun rises.' Then he recited al-Fath (Sura 48)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 478
			}
		},
		{
			"hadithnumber": 479,
			"arabicnumber": 479,
			"text": "Yahya related to me from Malik from Yahya ibn Said from Muhammad ibn Ibrahim ibn al-Harith at-Taymi from Abu Salama ibn Abd ar Rahman that Abu Said said that he had heard the Messenger of Allah, may Allah bless him and grant him peace, say, \"A group of people will appear among you whose prayer, fasting and deeds will make you think little of your own prayer, fasting and deeds. They will recite the Qur'an, but it wil not get past their throats, and they will pass through the deen like an arrow passes through game. You look at the arrowhead, and you see nothing, and you look at the shaft, and you see nothing, and you look at the flights, and you see nothing. And you are in doubt about the notch",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 479
			}
		},
		{
			"hadithnumber": 480,
			"arabicnumber": 480,
			"text": "Yahya related to me from Malik that he had heard that it took Abdullah ibn Umar eight years to learn Surat al-Baqara. (Sura 2)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 480
			}
		},
		{
			"hadithnumber": 481,
			"arabicnumber": 481,
			"text": "Yahya related to me from Malik from Abdullah ibn Yazid, the mawla of al Aswad ibn Sufyan, from Abu Salama ibn Abd ar Rahman that Abu Hurayra recited al-Inshiqaq (Sura 84) to them and prostrated in it. When he had finished he told them that the Messenger of Allah, may Allah bless him and grant him peace, had prostrated in it",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 481
			}
		},
		{
			"hadithnumber": 482,
			"arabicnumber": 482,
			"text": "Yahya related to me from Malik from Nafi, the mawla of Ibn Umar that a man from Egypt told him that Umar ibn al-Khattab recited Surat al-Hajj (Sura 22) and prostrated twice in it, and then said, \"This sura has been given special preference by having two prostrations in it",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 482
			}
		},
		{
			"hadithnumber": 483,
			"arabicnumber": 483,
			"text": "Yahya related to me from Malik that Abdullah ibn Dinar said, \"I saw Abdullah ibn Umar prostrate twice in Surat al-Hajj (Sura 22)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 483
			}
		},
		{
			"hadithnumber": 484,
			"arabicnumber": 484,
			"text": "Yahya related to me from Malik from Ibn Shihab from al-Araj that Umar ibn al Khattab recited Surat an-Najm (Sura 53) and prostrated in it, and then got up and recited another sura",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 484
			}
		},
		{
			"hadithnumber": 485,
			"arabicnumber": 485,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 485
			}
		},
		{
			"hadithnumber": 486,
			"arabicnumber": 486,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 486
			}
		},
		{
			"hadithnumber": 487,
			"arabicnumber": 487,
			"text": "Yahya related to me from Malik from Ubaydullah ibn Abd ar-Rahman that Ubayd ibn Hunayn, the mawla of the family of Zayd ibn al Khattab, said that he had heard Abu Hurayra say, \"I was going along with the Messenger of Allah, may Allah bless him and grant him peace, when he heard a man reciting Surat al-Ikhlas (Sura 112). The Messenger of Allah, may Allah bless him and grant him peace, said, 'It is obligatory,' and I asked him, 'What is, Messenger of Allah?' and he said, 'The Garden.' I wanted to tell the man the good news but I was afraid that I would miss the midday meal with the Messenger of Allah, may Allah bless him and grant him peace, and I preferred to eat with the Messenger of Allah, may Allah bless him and grant him peace. When I went to the man afterwards I found that he had gone",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 487
			}
		},
		{
			"hadithnumber": 488,
			"arabicnumber": 488,
			"text": "Yahya related to me from Malik from Ibn Shihab that Humayd ibn Abd ar-Rahman ibn Awf had told him that Surat al-Ikhlas (Sura 112) was equal to a third of the Qur'an, and that Surat al-Mulk (Sura 67) pleaded for its owner",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 488
			}
		},
		{
			"hadithnumber": 489,
			"arabicnumber": 489,
			"text": "Yahya related to me from Malik from Sumayy, the mawla of Abu Bakr, from Abu Salih as-Samman from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, said, \"Whoever says 'There is no god but Allah, alone, without any partner. The Kingdom and praise belong to Him and He has power over everything' (La ilaha illa'llah, wahdahu la sharika lah, lahu'l mulku wa lahu'l hamd, wa huwa ala kulli shay'in qadir) one hundred times a day, it is the same for him as freeing ten slaves. One hundred good actions are written for him and one hundred wrong actions are erased from him, and it is a protection from Shaytan for that day until the night. No-one does anything more excellent than what he does except someone who does more than that",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 489
			}
		},
		{
			"hadithnumber": 490,
			"arabicnumber": 490,
			"text": "Yahya related to me from Malik from Sumayy, the mawla of Abu Bakr, from Abu Salih as-Samman from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, said, \"Whoever says, 'Glory be to Allah and with His praise' (Subhana'llah wa bi-hamdihi) one hundred times in a day will have his wrong actions taken away from him, even if they are as abundant as the foam on the sea",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 490
			}
		},
		{
			"hadithnumber": 491,
			"arabicnumber": 491,
			"text": "Yahya related to me from Malik from Abu Ubayd, the mawla of Sulayman ibn Abd al-Malik, from Ata ibn Yazid al-Laythi that Abu Hurayra said, \"Whoever says 'Glory be to Allah' (Subhana'llah) thirty- three times and 'Allah is Greater' (Allahu akbar) thirty-three times and 'Praise be to Allah' (al-hamdu lillah) thirty-three times, and seals the hundred with 'There is no god but Allah, alone without any partner. The Kingdom and praise belong to Him and He has power over everything' (La ilaha illa'llah, wahdahu la sharika lah, lahu'l mulku wa lahu'l hamd, wa huwa ala kulli shay'in qadir) after every prayer will have his wrong actions forgiven him even if they are abundant as the foam on the sea",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 491
			}
		},
		{
			"hadithnumber": 492,
			"arabicnumber": 492,
			"text": "Yahya related to me from Malik that Umara ibn Sayyad had heard Said ibn al Musayyab say about abiding good deeds that they were a slave's saying 'Allah is greater' (Allahu akbar) and 'Glory be to Allah' (Subahana'llah) and 'Praise be to Allah' (al-hamdu lillah) and 'There is no god but Allah and there is no power and no strength except by Allah.' (La ilaha illa'llah wa la hawla wa la quwwata illa bi'llah)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 492
			}
		},
		{
			"hadithnumber": 493,
			"arabicnumber": 493,
			"text": "Yahya related to me from Malik that Ziyad ibn Abi Ziyad said that Abu'd-Darda had said, \"Shall I not tell you the best of your deeds, and those that give you the highest rank, and those that are the purest with your King, and are better for you than giving gold and silver, and better for you than meeting your enemy and striking their necks?\" They said, \"Of course.\" He said, \"Remembrance (dhikr) of Allah ta ala",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 493
			}
		},
		{
			"hadithnumber": 494,
			"arabicnumber": 494,
			"text": "Malik related to me from Nuaym ibn Abdullah ibn al-Mujmir from AIi ibn Yahya az-Zuraqi from his father that Rifaa ibn Rafi said, \"One day we were praying behind the Messenger of Allah, may Allah bless him and grant him peace, when the Messenger of Allah, may Allah bless him and grant him peace, raised his head from ruku and said, 'Allah hears the one who praises Him' (Sami Allahu liman hamidah). A man behind him said, 'Our Lord, praise belongs to you - blessed, pure and abundant praise' (Rabbana wa laka'l hamd, hamdan kathiran tayiban mubarakan fihi). When the Messenger of Allah, may Allah bless him and grant him peace, had finished, he said, 'Who was it who spoke just now?' The man said, 'I did, Messenger of Allah,' and the Messenger of Allah, may Allah bless him and grant him peace, said, 'I saw more than thirty angels rushing to it to see which one of them would record it first",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 494
			}
		},
		{
			"hadithnumber": 495,
			"arabicnumber": 495,
			"text": "Yahya related to me from Malik from Abu'z-Zinad from al-Araj from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, said, \"Every prophet is given a supplication (dua), and I wish to preserve my dua as intercession for my community in the next world",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 495
			}
		},
		{
			"hadithnumber": 496,
			"arabicnumber": 496,
			"text": "Yahya related to me from Malik from Yahya ibn Said that he had heard that the Messenger of Allah, may Allah bless him and grant him peace, used to say the following dua, \"O Allah, it is You who makes the dawn break and makes the night a time for rest and appoints the sun and moon to reckon by. Relieve me of debt and enrich me from poverty and let me enjoy my hearing, my sight and my strength in Your way.\" Allahumma faliqa'l isbah, wa ja ila'l-layli sakana, wa 'sh-shamsi wa'l-qamari husbana. Iqda anniy addayna, wa'ghnaniy mina'l faqr. Na'mti aniy bi samiy wa basariy, wa quwwatiy fi sabilik",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 496
			}
		},
		{
			"hadithnumber": 497,
			"arabicnumber": 497,
			"text": "Yahya related to me from Malik from Abu'z Zinad from al-Araj from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, said, ''When you are making dua do not say; 'O Allah, forgive me if You wish. O Allah, forgive me if you wish.' You should be firm in your asking, for there is no compelling Him",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 497
			}
		},
		{
			"hadithnumber": 498,
			"arabicnumber": 498,
			"text": "Yahya related to me from Malik from Ibn Shihab from Abu Ubayd, the mawla of Ibn Azhar, from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, said, \"You will be answered as long as you are not impatient and say, 'I have made a dua and I have not been answered",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 498
			}
		},
		{
			"hadithnumber": 499,
			"arabicnumber": 499,
			"text": "Yahya related to me from Malik from Ibn Shihab from Abu Abdullah al-Agharr and from Abu Salama from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, said, \"Our Lord, the Blessed and Exalted, descends every night to the heaven of this world when the last third of the night is still to come and says, 'Who will call on Me so that I may answer him? Who will ask Me so that I may give him? Who will ask forgiveness of Me so that I may forgive him?",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 499
			}
		},
		{
			"hadithnumber": 500,
			"arabicnumber": 500,
			"text": "Yahya related to me from Malik from Yahya ibn Said from Muhammad ibn Ibrahim ibn al-Harith at-Taymi that A'isha, umm al-muminin said, \"I was sleeping by the side of the Messenger of Allah, mayAllah bless him and grant him peace, and I missed him in the night, so I felt for him with my hand and I put my hand on his feet and he was in sajda saying, 'I seek refuge in Your pleasure from Your wrath, and in Your pardon from Your punishment, and in You from You. I cannot enumerate Your praises as You praise Yourself.' \" Audhu bi ridaka min sakhatika, wa bi muafatika min uqubatika wa bika minka, la uhsiy thana'an alayka, anta kama athnayta ala nafsika",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 500
			}
		},
		{
			"hadithnumber": 501,
			"arabicnumber": 501,
			"text": "Yahya related to me from Malik from Ziyad ibn Abi Ziyad from Talha ibn Ubaydullah ibn Kariz that the Messenger of Allah, may Allah bless him and grant him peace, said, \"The best dua is dua on the day of Arafa, and the best thing that I or the Prophets before me have said is 'There is no god but Allah, alone, without any partner' (La ilaha illa'llah, wahdahu la sharika lah)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 501
			}
		},
		{
			"hadithnumber": 502,
			"arabicnumber": 502,
			"text": "Yahya related to me from Malik from Abu'zZubayr al-Makki from Tawus al-Yamani from Abdullah ibn Abbas that the Messenger of Allah, may Allah bless him and grant him peace, used to teach this dua in the same way that he would teach them a sura of the Qur'an, \"O Allah, I seek refuge in You from the torment of Jahannam, and I seek refuge in You from the trial of the Dajjal, and I seek refuge in You from the trial of life and death.\" Allahumma inniy audhu bika min adhabi jahannama, wa audhu bika min adhabi'l-qabri, wa audhu bika min fitnati'l-mahya wa mamati",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 502
			}
		},
		{
			"hadithnumber": 503,
			"arabicnumber": 503,
			"text": "Yahya related to me from Malik from Abu'z Zubayr al-Makki from Tawus al-Yamani from Abdullah ibn Abbas that the Messenger of Allah, may Allah bless him and grant him peace, used to say, when he rose for prayer in the middle of the night, \"O Allah, praise belongs to You. You are the light of the heavens and the earth and praise belongs toYou.You are the Sustainer of the heavens and the earth and praise belongs to You. You are the Lord of the heavens and the earth and whoever is in them. You are the Truth, and Your words are true. Your promise is true, and the meeting with You is true. The Garden is true and the Fire is true and the Hour is true. O Allah, I submit toYou and I accept You and I trust in You and I turn to You and I argue by You and I summon toYou for judgement. Forgive me what I have sent before me and what I have left behind, what I have kept secret and what I have proclaimed, You are my god - there is no god but You.\" Allahumma laka'l-hamdu anta nuru's-samawati wa'l-ardi, wa laka'l-hamdu anta qayamu's-Samawati wa'l-ardi, wa laka'l-hamdu anta rabbu's-Samawati wa'l-ardi,wamanfihina.Anta'l-haqqu,waqawluka'lhaqqu, wa waduka'l-haqqu, wa liqa'uka haqqun, wa jannatu haqqun, wa naru haqqun, wa sactu haqqun. Allahumma laka aslamtu, wa bikaamantu, waalayka tawakaltu, wa ilayka anabtu, wa bika khasamtu, wa ilayka hakamtu, fa'ghfirliy ma qadamtu wa akhartu wa asrartu, wa alantu. Anta ilahiy, la ilaha illa ant",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 503
			}
		},
		{
			"hadithnumber": 504,
			"arabicnumber": 504,
			"text": "Yahya related to me from Malik that Abdullah ibn Abdullah ibn Jabir ibn Atik said that Abdullah ibn Umar had come to them in Bani Muawiya, one of the villages of the Ansar, and said, \"Do you know where the Messenger of Allah, may Allah bless him and grant him peace, prayed in this mosque of yours? \"I told him, \"Yes,\" and I pointed out a place near where he was. He said, \"Do you know the three things for which he made dua here?\" I said \"Yes.\" He said, \"Tell me them then.\" I said, \"He asked that He would not make an enemy from among the non- believers triumph over the believers and that He would not destroy the believers by bad harvests, and he was given both these things. And he asked that He would not make the believers fight among themselves, and that was refused.\" Ibn Umar said, \"You have told the truth,\" and he added, \"Turmoil will not cease until the day of rising",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 504
			}
		},
		{
			"hadithnumber": 505,
			"arabicnumber": 505,
			"text": "Yahya related to me from Malik that Zayd ibn Aslam used to say, \"No-one makes a dua without one of three things happening. Either it is answered, or it is stored up for him, or wrong actions are atoned for by it",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 505
			}
		},
		{
			"hadithnumber": 506,
			"arabicnumber": 506,
			"text": "Yahya related to me from Malik that Abdullah ibn Dinar said, \"Abdullah ibn Umar saw me when I was making dua and I was pointing with two fingers, one from each hand, and he forbade me",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 506
			}
		},
		{
			"hadithnumber": 507,
			"arabicnumber": 507,
			"text": "Yahya related to me from Malik from Yahya ibn Said that Said ibn al-Musayyab used to say, \"A man is raised by the dua of his son after his death.\" He spoke with his hands turned upwards, and then lifted them up",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 507
			}
		},
		{
			"hadithnumber": 508,
			"arabicnumber": 508,
			"text": "Yahya related to me from Malik from Hisham ibn Urwa that his father said, \"The following ayat was sent down about dua - 'And do not be loud in your prayer and do not be silent in it, but seek a way between these.' \" (Sura 17 ayat 110) Yahya said that Malik was asked about making dua in obligatory prayers and he said, \"There is no harm in making dua in them",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 508
			}
		},
		{
			"hadithnumber": 509,
			"arabicnumber": 509,
			"text": "Yahya related to me from Malik that he had heard that the Messenger of Allah, may Allah bless him and grant him peace, used to make dua saying, \"O Allah, I askYou for good actions and for leaving what is disapproved of and for love of the poor. And if You wish to try people, then bring me to You without being tried.\" Allahumma inniy asa'luka fala'l-khayrati, wa tarqa'l-munqarati, wa hubba'l-masakin, wa idha aradta fi'n-nasi fitnatan fa'qbithni ilayka ghayra maftun",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 509
			}
		},
		{
			"hadithnumber": 510,
			"arabicnumber": 510,
			"text": "Yahya related to me from Malik that he had heard that the Messenger of Allah, may Allah bless him and grant him peace, said, \"No one calls to guidance without having the same reward as those who follow him without diminishing their rewards at all. And no one calls to error without having the same burdens as they do without diminishing their burdens at all",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 510
			}
		},
		{
			"hadithnumber": 511,
			"arabicnumber": 511,
			"text": "Yahya related to me from Malik that he had heard that Abdullah ibn Umar said, \"O Allah, make me one of the leaders of the people of taqwa .\" Allahumma jalniy min a'imati'l-mutaqin",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 511
			}
		},
		{
			"hadithnumber": 512,
			"arabicnumber": 512,
			"text": "Yahya related to me from Malik that he had heard that Abu'd-Darda used to rise in the middle of the night and say, \"Eyes have slept, and stars have set, and You are the Living and Self Subsistent.\" Namat'l uyun wa ghariti'n-nujum wa anta'lhayyu-l-qayyum",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 512
			}
		},
		{
			"hadithnumber": 513,
			"arabicnumber": 513,
			"text": "Yahya related to me from Malik from Zayd ibn Aslam from Ata ibn Yasar from Abdullah as-Sunabihi that the Messenger of Allah, may Allah bless him and grant him peace, said, \"The sun rises and with it is a horn of Shaytan and when the sun gets higher the horn leaves it. Then when the sun reaches the meridian the horn joins it and when the sun declines the horn leaves it, and when the sun has nearly set it joins it again.\" The Messenger of Allah, may Allah bless him and grant him peace, forbade prayer at these times",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 513
			}
		},
		{
			"hadithnumber": 514,
			"arabicnumber": 514,
			"text": "Yahya related to me from Malik from Hisham ibn Urwa that his father said that the Messenger of Allah, may Allah bless him and grant him peace, used to say, \"Delay the prayer when the edge of the sun appears until it is completely in view, and delay the prayer when the edge of the sun is disappearing until it has completely disappeared",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 514
			}
		},
		{
			"hadithnumber": 515,
			"arabicnumber": 515,
			"text": "Yahya related to me from Malik that al-Ala ibn Abd ar-Rahman said, \"We visited Anas ibn Malik after dhuhr and he stood up and prayed asr. When he had finished his prayer, we mentioned doing prayers early in their time, or he mentioned it, and he said that he had heard the Messenger of Allah, may Allah bless him and grant him peace, say, the prayer of the hypocrites, the prayer of the hypocrites, the prayer of the hypocrites is that one of them sits until the sun becomes yellow and is between the horns of Shaytan, or on the horn of Shaytan, and then gets up and rattles off four rakas, hardly remembering Allah in them at all",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 515
			}
		},
		{
			"hadithnumber": 516,
			"arabicnumber": 516,
			"text": "Yahya related to me from Malik from Nafi from Abdullah ibn Umar that the Messenger of Allah, may Allah bless him and grant him peace, said, \"You should not intend to pray either at sunrise or sunset",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 516
			}
		},
		{
			"hadithnumber": 517,
			"arabicnumber": 517,
			"text": "Yahya related to me from Malik from Muhammad ibn Yahya ibn Habban from al Araj from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, forbade prayer after asr until the sun had set, and prayer after subh until the sun had risen",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 517
			}
		},
		{
			"hadithnumber": 518,
			"arabicnumber": 518,
			"text": "Yahya related to me from Malik from Abdullah ibn Dinar from Abdullah ibn Umar that Umar ibn al-Khattab used to say, \"Do not intend to do your prayer at either sunrise or sunset, for the horns of Shaytan rise with the rising of the sun and set with its setting.\" Umar used to beat people for that kind of prayer",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 518
			}
		},
		{
			"hadithnumber": 519,
			"arabicnumber": 519,
			"text": "Yahya related to me from Malik from Ibn Shihab from as-Sa'ib ibn Yazid that he saw Umar ibn al-Khattab beating al-Munkadir for praying after asr",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 519
			}
		}
	]
}