{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"16": "Burials"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 520,
			"arabicnumber": 520,
			"text": "Yahya related to me from Malik from Jafar ibn Muhammad from his father that the Messenger of Allah, may Allah bless him and grant him peace, was washed in a long shirt",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 520
			}
		},
		{
			"hadithnumber": 521,
			"arabicnumber": 521,
			"text": "Yahya related to me from Malik from Ayyub ibn Abi Tamima as- Sakhtayani from Muhammad ibn Sirin that Umm Atiyya al-Ansariyya said, \"The Messenger of Allah, may Allah bless him and grant him peace, came to us when his daughter died and said, 'Wash her three times, or five, or more than that if you think it necessary, with water and lotus leaves, and at the end put on some camphor, or a little camphor, and when you have finished let me know.' When we finished we told him, and he gave us his waist-wrapper and said, 'Shroud her with this",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 521
			}
		},
		{
			"hadithnumber": 522,
			"arabicnumber": 522,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 522
			}
		},
		{
			"hadithnumber": 523,
			"arabicnumber": 523,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 523
			}
		},
		{
			"hadithnumber": 524,
			"arabicnumber": 524,
			"text": "Hadith Translation Not Available",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 524
			}
		},
		{
			"hadithnumber": 525,
			"arabicnumber": 525,
			"text": "Yahya related to me from Malik that Yahya ibn Said said that he had heard that when Abu Bakr as-Siddiq was ill he asked A'isha, \"How many shrouds did the Messenger of Allah, may Allah bless him and grant him peace, have?\" and she replied, \"Three pure white cotton garments.\" Abu Bakr said, \"Take this garment (a garment he was wearing on which red clay or saffron had fallen) and wash it. Then shroud me in it with two other garments.\" A'isha said, \"Why's that?\", and Abu Bakr replied, \"The living have greater need of the new than the dead. This is only for the body fluids that come out as the body decays",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 525
			}
		},
		{
			"hadithnumber": 526,
			"arabicnumber": 526,
			"text": "Yahya related to me from Malik from Ibn Shihab from Humayd ibn Abdar-Rahman ibn Awf that Abdullah ibn Amr ibn al-As said, \"A dead man is clothed in a shirt and a waist-wrapper and then wrapped in a third, and if he only has one garment he is shrouded in that",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 526
			}
		},
		{
			"hadithnumber": 527,
			"arabicnumber": 527,
			"text": "Yahya related to me from Malik from Ibn Shihab that the Messenger of Allah, may Allah bless him and grant him peace, and Abu Bakr and Umar as well as the khalifas up until this time and Abdullah ibn Umar, would walk in front of the bier",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 527
			}
		},
		{
			"hadithnumber": 528,
			"arabicnumber": 528,
			"text": "Yahya related to me from Muhammad ibn alMunkadir that Rabia ibn Abdullah ibn alHadir told him that he had seen Umar ibn al-Khattab leading people in front of the bier at the funeral of Zaynab bint Jahsh",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 528
			}
		},
		{
			"hadithnumber": 529,
			"arabicnumber": 529,
			"text": "Yahya related to me from Malik that Hisham ibn Urwa said, \"I only ever saw my father in front of a funeral procession.\" He added, \"Then he would come to al-Baqi and sit down until the procession passed him",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 529
			}
		},
		{
			"hadithnumber": 530,
			"arabicnumber": 530,
			"text": "Yahya related to me from Malik that Ibn Shihab said, \"Walking behind the bier is in contradiction to the sunna",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 530
			}
		},
		{
			"hadithnumber": 531,
			"arabicnumber": 531,
			"text": "Yahya related to me from Malik from Hisham ibn Urwa that Asma bint Abi Bakr said to her family, \"Perfume my clothes with incense when I die and then embalm me. Do not put any of the embalming substance on my shroud, and do not follow me with a burning torch",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 531
			}
		},
		{
			"hadithnumber": 532,
			"arabicnumber": 532,
			"text": "Yahya related to me from Malik from Said ibn Abi Said al-Maqburi that Abu Hurayra forbade anyone to follow him with a burning torch after his death. Yahya said, \"I heard Malik disapprove of that",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 532
			}
		},
		{
			"hadithnumber": 533,
			"arabicnumber": 533,
			"text": "Yahya related to me from Malik from Ibn Shihab from Said ibn al- Musayyab from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, announced the death of an Najashi to everyone on the day that he died, and went out with them to the place of prayer, and then formed them into rows and said \"Allah is greater\" four times",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 533
			}
		},
		{
			"hadithnumber": 534,
			"arabicnumber": 534,
			"text": "Yahya related to me from Malik from Ibn Shihab that Abu Umama ibn Sahl ibn Hunayf told him that once a poor woman fell ill and the Messenger of Allah, may Allah bless him and grant him peace, was told of her illness, and the Messenger of Allah, may Allah bless him and grant him peace, used to visit poor people frequently and ask after them. The Messenger of Allah, may Allah bless him and grant him peace, said, \"Let me know if she dies.\" Her bier was brought out at night- time and they did not want to wake up the Messenger of Allah, may Allah bless him and grant him peace. In the morning the Messenger of Allah, may Allah bless him and grant him peace, was told what had happened to her and he said, \"Didn't I tell you to let me know if she died?\" They replied, \"Messenger of Allah, we did not want to wake you up and make you come out in the night.\" Then the Messenger of Allah, may Allah bless him and grant him peace, went out and formed everyone into rows by her grave and said \"Allah is greater\" four times",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 534
			}
		},
		{
			"hadithnumber": 535,
			"arabicnumber": 535,
			"text": "Yahya related to me that Malik asked Ibn Shihab about a man who caught some of the takbirs said over the corpse and missed the rest, and Ibn Shihab said, \"He completes what he has missed",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 535
			}
		},
		{
			"hadithnumber": 536,
			"arabicnumber": 536,
			"text": "Yahya related to me from Malik from Said ibn Abi Said al-Maqburi from his father that he had asked Abu Hurayra, \"How do you pray over the dead?\" and Abu Hurayra replied, \"By the Life of Allah, I will tell you! I follow with the family and when the corpse is put down I say 'Allah is greater' and praise Allah and ask for blessings on His Prophet. Then I say, 'O Allah, he is Your slave and the son of Your male slave and Your female slave. He used to testify that there is no god but You and that Muhammad is Your slave and Your Messenger, and You know that best. O Allah, if he acted well, then increase for him his good action, and if he acted wrongly, then overlook his wrong actions. O Allah, do not deprive us of his reward, and do not try us after him.'\" Allahumma inna huwa abduka wa'bnu abdika wa'bnu amatika. Kana yash-hadu an la ilaha illa ant wa anna Muhammadan abduka wa rasooluka, wa anta alamu bihi. Allahumma in kana muhsinan zid fi ihsanihi, wa in kana musiyan fa tajawaz an sayatihi. Allahumma la tahrimna ajrahu wa lataftina badahu",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 536
			}
		},
		{
			"hadithnumber": 537,
			"arabicnumber": 537,
			"text": "Yahya related to me from Malik that Yahya ibn Said said that he heard Said ibn al-Musayyab say, \"I once prayed behind Abu Hurayra over a child who had never done a wrong action and I heard him say, 'O Allah, give him protection from the torment of the grave",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 537
			}
		},
		{
			"hadithnumber": 538,
			"arabicnumber": 538,
			"text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar used not to recite when praying over a dead person",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 538
			}
		},
		{
			"hadithnumber": 539,
			"arabicnumber": 539,
			"text": "Yahya related to me from Malik from Muhammad ibn Abi Harmala, the mawla of Abd ar-Rahman ibn Abi Sufyan ibn Huwaytib, that Zaynab bint Abi Salama died during the time that Tariq was amir of Madina and her bier was brought out after subh and put in al-Baqi. He said that Tariq used to pray subh right at the beginning of its time. He added, \"I heard Abdullah ibn Umar say to the family, 'You can either pray over your dead now or you can wait until the sun comes up",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 539
			}
		},
		{
			"hadithnumber": 540,
			"arabicnumber": 540,
			"text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar said, \"The prayer for a dead person can be done after asr and subh if these have been prayed at their times",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 540
			}
		},
		{
			"hadithnumber": 541,
			"arabicnumber": 541,
			"text": "Yahya related to me from Malik from Abu'n Nadr, the mawla of Umar ibn Ubaydullah that A'isha, the wife of the Prophet, may Allah bless him and grant him peace, ordered that the body of Sad ibn Abi Waqqas be brought past her in the mosque so that she could make dua for him. Some people disapproved of her doing that, and she said, \"How hasty people are! The Messenger of Allah, may Allah bless him and grant him peace, only prayed over Suhayl ibn Bayda in the mosque",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 541
			}
		},
		{
			"hadithnumber": 542,
			"arabicnumber": 542,
			"text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar said, \"The prayer over Umar ibn al-Khattab was done in the mosque",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 542
			}
		},
		{
			"hadithnumber": 543,
			"arabicnumber": 543,
			"text": "Yahya related to me from Malik that he had heard that Uthman ibn Affan and Abdullah ibn Umar and Abu Hurayra used to pray over the dead, both men and women, in Madina. They would put the men nearer to the imam and the women nearer to the qibla",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 543
			}
		},
		{
			"hadithnumber": 544,
			"arabicnumber": 544,
			"text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar, when he prayed over the dead, would say, \"Peace be upon you\" loud enough for whoever was near to him to hear",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 544
			}
		},
		{
			"hadithnumber": 545,
			"arabicnumber": 545,
			"text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar used to say, \"No-one should pray over a dead person unless he is in wudu.\" Yahya said that he heard Malik say, \"I have not seen any person of knowledge disapproving of praying over either a child born of adultery or its mother",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 545
			}
		},
		{
			"hadithnumber": 546,
			"arabicnumber": 546,
			"text": "Yahya related to me from Malik that he had heard that the Messenger of Allah, may Allah bless him and grant him peace, died on Monday and was buried on Tuesday and people prayed over him individually with no one leading them. Some people said that he would be buried near the mimbar, and others said that he would be buried in al-Baqi. Abu Bakr as-Siddiq came and said, \"I heard the Messenger of Allah, may Allah bless him and grant him peace, say, 'No prophet was ever buried except in the place where he died.' \"So a grave was dug for him there. When he was about to be washed they wished to take off his shirt but they heard a voice saying \"Don't take off his shirt,\" so they did not take off his shirt and he was washed with it on, may Allah bless him and grant him peace",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 546
			}
		},
		{
			"hadithnumber": 547,
			"arabicnumber": 547,
			"text": "Yahya related to me from Malik from Hisham ibn Urwa that his father said, \"There were two men in Madina, one of whom dug graves with a niche in the side wall for the body, and the other who did not, and they said, 'Whichever one comes first can do the job,' and the one who dug graves with a niche came first and dug the Messenger of Allah's grave, may Allah bless him and grant him peace",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 547
			}
		},
		{
			"hadithnumber": 548,
			"arabicnumber": 548,
			"text": "Yahya related to me from Malik that he had heard that Umm Salama, the wife of the Prophet, may Allah bless him and grant him peace, used to say, \"I did not believe that the Messenger of Allah, may Allah bless him and grant him peace, had died until I heard the pickaxes fall",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 548
			}
		},
		{
			"hadithnumber": 549,
			"arabicnumber": 549,
			"text": "Yahya related to me from Malik from Yahya ibn Said that A'isha, the wife of the Prophet, may Allah bless him and grant him peace, said, \"I saw three moons fall into my room, and I related my vision to Abu Bakr as-Siddiq. Then, when the Messenger of Allah died, may Allah bless him and grant him peace, and was buried in my house, Abu Bakr said to me, 'This is one of your moons, and he is the best of them",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 549
			}
		},
		{
			"hadithnumber": 550,
			"arabicnumber": 550,
			"text": "Yahya related to me from Malik from more than one reliable source that Sad ibn Abi Waqqas and Said ibn Zayd ibn Amr ibn Nufayl died at al-Aqiq and were carried to Madina and buried there",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 550
			}
		},
		{
			"hadithnumber": 551,
			"arabicnumber": 551,
			"text": "Yahya related to me from Malik from Hisham ibn Urwa that his father said, \"I would not want to be buried in al-Baqi. I would prefer to be buried elsewhere. The one who is buried in al-Baqi is one of two people. Either he is unjust (dhalim), and I would not like to be buried with him, or he is salih, and I would not like his bones to be disturbed for me",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 551
			}
		},
		{
			"hadithnumber": 552,
			"arabicnumber": 552,
			"text": "Yahya related to me from Malik from Yahya ibn Said from Wafid ibn Amr ibn Said ibn Muadh from Nafi ibn Jubayr ibn Mutim from Masud ibn al-Hakam from AIi ibn Abi Talib that the Messenger of Allah, may Allah bless him and grant him peace, used to stand up when a funeral procession passed by, and then sit down again afterwards",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 552
			}
		},
		{
			"hadithnumber": 553,
			"arabicnumber": 553,
			"text": "ahya related to me from Malik that he had heard that AIi ibn Abi Talib used to rest his head on graves and lie on them. Malik said, \"As far as we can see ,it is only forbidden to sit on graves to relieve oneself",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 553
			}
		},
		{
			"hadithnumber": 554,
			"arabicnumber": 554,
			"text": "Yahya related to me from Malik from Abu Bakr ibn Uthman ibn Sahl ibn Hunayf that he had heard Abu Umama ibn Sahl ibn Hunayf say, \"We used to attend funeral processions, and the last of the people would not sit until they had been given permission",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 554
			}
		},
		{
			"hadithnumber": 555,
			"arabicnumber": 555,
			"text": "Yahya related to me from Malik from Abdullah ibn Abdullah ibn Jabir ibn Atik that Atik ibn al-Harith, the grandfather of Abdullah ibn Abdullah ibn Jabir on his mother's side, told him that Jabir ibn Atik had told him that the Messenger of Allah, may Allah bless him and grant him peace, came to visit Abdullah ibn Thabit and found him in his death-throes. He called to him but he did not reply. The Messenger of Allah, may Allah bless him and grant him peace, said, \"We belong to Allah, and to Him we are returning,\" and added, \"You are being taken from us, Abur-Rabi`.\" The women cried out and wept, and Jabir began to silence them. The Messenger of Allah, may Allah bless him and grant him peace, said, \"Leave them, and when the necessary time comes, none of the women should cry.\" They said, \"Messenger of Allah, what is the necessary time?\" and he replied, \"When he dies.\" The dying man's daughter said, \"By Allah, I hope that you will be a martyr, for you have completed your preparations for battle,\" and the Messenger of Allah, may Allah bless him and grant him peace, said, \"Allah has made his reward fall according to his intention. What do you consider dying a martyr to be?\" They said, \"Death in the way of Allah.\" The Messenger of Allah, may Allah bless him and grant him peace, said, \"There are seven kinds of martyr other than those killed in the way of Allah. Someone who is killed by the plague is a martyr, someone who drowns is a martyr, someone who dies of pleurisy is a martyr, someone who dies of a disease of the belly is a martyr, someone who dies by fire is a martyr, someone who dies under a falling building is a martyr and a woman who dies in childbirth is a martyr",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 555
			}
		},
		{
			"hadithnumber": 556,
			"arabicnumber": 556,
			"text": "Yahya related to me from Malik from Abdullah ibn Abi Bakr from his father that Amra bint Abd ar-Rahman told him that she had heard A'isha, the umm al-muminin, say (when it was mentioned to her that Abdullah ibn Umar used to say, \"The dead are tormented by the weeping of the living\"), \"May Allah forgive Abu Abd ar-Rahman. Of course he has not lied, but he has forgotten, or made a mistake. The Messenger of Allah, may Allah bless him and grant him peace, passed by a jewish woman whose family were crying over her and he said, 'You are crying over her, and she is being tormented in her grave",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 556
			}
		},
		{
			"hadithnumber": 557,
			"arabicnumber": 557,
			"text": "Yahya related to me from Malik from Ibn Shihab from Said ibn al- Musayyab from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, said, \"No muslim who has three children die will be touched by the Fire except to fulfil Allah's oath",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 557
			}
		},
		{
			"hadithnumber": 558,
			"arabicnumber": 558,
			"text": "Yahya related to me from Malik from Muhammad ibn Abi Bakr ibn Amr ibn Hazm from his father from Abu'n-Nadr as-Salami that the Messenger of Allah, may Allah bless him and grant him peace, said, \"If three of a muslim's children die, and he remains content with that, they will be a protection for him from the Fire.\" A woman who was with the Messenger of Allah, may Allah bless him and grant him peace, said, \"Or two, Messengerof Allah?\", and he said, \"Or two",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 558
			}
		},
		{
			"hadithnumber": 559,
			"arabicnumber": 559,
			"text": "Yahya related to me from Malik that he had heard from Abu'l-Hubab Said ibn Yasar from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, said, \"The mumin continues to be struck by misfortune in his children and close friends until he meets Allah with no wrong actions",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 559
			}
		},
		{
			"hadithnumber": 560,
			"arabicnumber": 560,
			"text": "Yahya related to me from Malik from Abd ar-Rahman ibn al-Qasim ibn Muhammad ibn Abi Bakr that the Messenger of Allah, may Allah bless him and grant him peace, said, \"Let the misfortune that befalls me be a comfort to the Muslims in their misfortunes",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 560
			}
		},
		{
			"hadithnumber": 561,
			"arabicnumber": 561,
			"text": "Yahya related to me from Malik from Rabia ibn Abi Abd ar-Rahman from Umm Salama, the wife of the Prophet may Allah bless him and grant him peace, that the Messenger of Allah, may Allah bless him and grant him peace, said, \"If a misfortune befalls some one and he says, as Allah has ordered, 'We belong to Allah and to Him we are returning. O Allah, reward me in my misfortune and give me better than it afterwards,' Allah will do that for him\" (Inna lillahi wa inna ilayhi rajiun. Allahumma' jurniy fi musiybatiy, wa a qibhiy khayran minha, illa faala 'llahu dhalika bihi.). Umm Salama said, \"When Abu Salama died I said that, and then I said, 'Who is better than Abu Salama?' \" And then Allah left her the Messenger of Allah, may Allah bless him and grant him peace, and he married her",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 561
			}
		},
		{
			"hadithnumber": 562,
			"arabicnumber": 562,
			"text": "Yahya related to me from Malik from Yahya ibn Said that al-Qasim ibn Muhammad said, \"One of my wives died and Muhammad ibn Kab al Quradhi came to console me about her. He told me of one among the Bani Israil who was a diligent, worshipping, knowing and understanding man who had a wife that he admired and loved, and she died. He grieved over her intensely and lamented her until he withdrew into a house and locked himself in, hidden from everyone, and no-one visited him. A woman heard about him and went to him, saying, 'I need him to give me an opinion. Nothing will satisfy me except what he says about it.' Everyone went away, but she stuck to his door and said, 'I must see him.' Someone said to him, 'There is a woman who wishes to ask your opinion about something,' and she insisted, 'I will only talk to him about it.' When everyone had gone away, and she still had not left his door, he said, 'Let her in.' So she went in and saw him and said, 'I have come to ask your opinion about something.' He said, 'What is it?' She said, 'I borrowed a piece of jewellery from a neighbour of mine, and I have worn it and used it for a long time. Then they sent to me for it. Should I let them have it back?' He said, 'Yes, by Allah.' She said, 'I have had it for a long time.' He said, 'It is more correct for you to return it to them, since they have lent it to you for such a long time.' She said, 'Yes. May Allah have mercy on you. Do you then grieve over what Allah has lent you and then taken from you, when He has a greater right to it than you?' Then he saw the situation he was in, and Allah helped him by her words",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 562
			}
		},
		{
			"hadithnumber": 563,
			"arabicnumber": 563,
			"text": "Yahya related to me from Malik that Abu'r-Rijal Muhammad ibn Abd ar-Rahman heard his mother Amra bint Abd ar-Rahman say, \"The Messenger of Allah, may Allah bless him and grant him peace, cursed both men and women who dug up,\" meaning those who dug up graves",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 563
			}
		},
		{
			"hadithnumber": 564,
			"arabicnumber": 564,
			"text": "Yahya related to me from Malik that he had heard that A'isha, the wife of the Prophet, may Allah bless him and grant him peace, used to say, \"Breaking the bone of a muslim when he is dead is like breaking it when he is alive.\" She meant if done in wrong action",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 564
			}
		},
		{
			"hadithnumber": 565,
			"arabicnumber": 565,
			"text": "Yahya related to me from Malik from Hisham ibn Urwa from Abbad ibn Abdullah ibn az-Zubayr that A'isha, the wife of the Prophet, may Allah bless him and grant him peace, told him that she had heard the Messenger of Allah, may Allah bless him and grant him peace, say before he died, while he was leaning on her breast and she was listening to him, \"O Allah, forgive me and have mercy on me and join me with the highest company",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 565
			}
		},
		{
			"hadithnumber": 566,
			"arabicnumber": 566,
			"text": "Yahya related to me from Malik that he heard that A'isha said, \"The Messenger of Allah, may Allah bless him and grant him peace, said, 'No prophet dies until he is given the choice.' \" She continued, \"I heard him say ,'O Allah, the highest company,' and I knew that he was going",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 566
			}
		},
		{
			"hadithnumber": 567,
			"arabicnumber": 567,
			"text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar said that the Messenger of Allah, may Allah bless him and grant him peace, said, \"When you die, your place will be shown to you in the morning and the evening. If you are one of the people of the Garden, then you will be with the people of the Garden, and if you are one of the people of the Fire, then you will be with the people of the Fire. You will be told, 'This is your place of waiting until Allah raises you on the day of rising",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 567
			}
		},
		{
			"hadithnumber": 568,
			"arabicnumber": 568,
			"text": "Yahya related to me from Malik from Abu'z Zinad from al-Araj from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, said, \"The earth eats all of the son of Adam except the coccyx. He was created from it, and on it he is built",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 568
			}
		},
		{
			"hadithnumber": 569,
			"arabicnumber": 569,
			"text": "Yahya related to me from Malik from Ibn Shihab that Abd ar-Rahman ibn Kab ibn Malik al-Ansari told him that his father, Kab ibn Malik, used to relate that the Messenger of Allah, may Allah bless him and grant him peace, said, \"The ruh of the mumin is a bird that sits in the trees of the Garden until Allah returns it to his body on the day He raises him",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 569
			}
		},
		{
			"hadithnumber": 570,
			"arabicnumber": 570,
			"text": "Yahya related to me from Malik from Abu'z Zinad from al-Araj from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, said, \"Allah, the Blessed and Exalted, said, 'If My slave longs to meet Me, I long to meet him, and if he is averse to meeting Me, I am averse to meeting him",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 570
			}
		},
		{
			"hadithnumber": 571,
			"arabicnumber": 571,
			"text": "Yahya related to me from Malik from Abu'z Zinad from al-Araj from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, said, \"A man said to his family that he had never done a good action, and that when he died they were to burn him and then scatter half of him on the land and half of him on the sea, and by Allah, if Allah destined it for him He would punish him with a punishment which He had not punished anyone else with in all the worlds. When the man died, they did as he had told them. Then Allah told the land to collect everything that was in it, and told the sea to collect everything that was in it, and then He said to the man, 'Why did you do this?' and he said, 'From fear of You, Lord, and You know best.' \" Abu Hurayra added, \"And He forgave him",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 571
			}
		},
		{
			"hadithnumber": 572,
			"arabicnumber": 572,
			"text": "Yahya related to me from Malik from Abu'z Zinad from al-Araj from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, said, \"Every child is born on the fitra and it is his parents who make him a jew or a christian. Just as a camel is born whole - do you perceive any defect?\" They said, \"Messenger of Allah, what happens to people who die when they are (very) young?\" He said, \"Allah knows best what they used to do",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 572
			}
		},
		{
			"hadithnumber": 573,
			"arabicnumber": 573,
			"text": "Yahya related to me from Malik from Abu'z Zinad from al-Araj from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, said, \"The Hour will not come until a man passes by the grave of another and says, 'If only I were in his place",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 573
			}
		},
		{
			"hadithnumber": 574,
			"arabicnumber": 574,
			"text": "Yahya related to me from Malik from Muhammad ibn Amr ibn Halhalaad-Dili from Mabad ibn Kab ibn Malik that Abu Qatada ibn Ribi used to relate that a funeral procession passed by the Messenger of Allah, may Allah bless him and grant him peace, and he said, \"One is relieved and another others are relieved from.\" They said, \"Who is the one relieved and the one from whom others are relieved?\" He said, \"A slave who is mumin is the one who is relieved from the exhaustion and suffering of this world to the mercy of Allah, and a wrong-acting slave is the one from whom people, towns, trees and animals are relieved",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 574
			}
		},
		{
			"hadithnumber": 575,
			"arabicnumber": 575,
			"text": "Yahya related to me from Malik that Abu'n Nadr, the mawla of Umar ibn Ubaydullah, said that the Messenger of Allah, may Allah bless him and grant him peace, said, when Uthman ibn Madhun's funeral procession passed by him, \"You have gone and you were not involved in any of it",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 575
			}
		},
		{
			"hadithnumber": 576,
			"arabicnumber": 576,
			"text": "Malik related to me from AIqama ibn Abi Alqama that his mother said that she had heard A'isha, the wife of the Prophet, may Allah bless him and grant him peace, say, \"The Messenger of Allah, may Allah bless him and grant him peace, rose one night and put on his clothes and then went out. I ordered my slave-girl, Barira, to follow him, and she followed him until he got to al-Baqi. He stood near it as long as Allah willed and then he left. Barira arrived back before him and told me and I did not say anything to him until morning, and then I mentioned it to him and he explained, 'I was sent out to the people of al-Baqi to pray for them",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 576
			}
		},
		{
			"hadithnumber": 577,
			"arabicnumber": 577,
			"text": "Yahya related to me from Malik from Nafi that Abu Hurayra said, \"Make your funerals speedy, for it is only good that you are advancing him towards, or evil that you are taking off your necks",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 577
			}
		}
	]
}