{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"25": "Game"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1052,
			"arabicnumber": 1052,
			"text": "ahya related to me from Malik that Nafi said, \"I was at al-Juruf (near Madina) and threw a stone at two birds, and hit them. One of them died, and Abdullah ibn Umar threw it away, and then went to slaughter the other one with an adze. It died before he could slaughter it, so Abdullah threw that one away as well",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 1052
			}
		},
		{
			"hadithnumber": 1053,
			"arabicnumber": 1053,
			"text": "Yahya related to me from Malik that he had heard that al-Qasim ibn Muhammad disapproved of eating game that had been killed with throwing sticks and by clay pellets",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 1053
			}
		},
		{
			"hadithnumber": 1054,
			"arabicnumber": 1054,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 1054
			}
		},
		{
			"hadithnumber": 1055,
			"arabicnumber": 1055,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 1055
			}
		},
		{
			"hadithnumber": 1056,
			"arabicnumber": 1056,
			"text": "Yahya related to me from Malik that he heard Nafi say that Abdullah ibn Umar said, \"Whether it eats from it or not",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 1056
			}
		},
		{
			"hadithnumber": 1057,
			"arabicnumber": 1057,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 1057
			}
		},
		{
			"hadithnumber": 1058,
			"arabicnumber": 1058,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 1058
			}
		},
		{
			"hadithnumber": 1059,
			"arabicnumber": 1059,
			"text": "Yahya related to me from Malik from Zayd ibn Aslam that Sad al- Jari, the mawla of Umar ibn al-Khattab asked Abdullah ibn Umar about fish which had killed each other or which had died from severe cold . He said, \"There is no harm in eating them.'' Sad said,' 'I then asked Abdullah ibn Amr ibn al As and he said the same",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 1059
			}
		},
		{
			"hadithnumber": 1060,
			"arabicnumber": 1060,
			"text": "Yahya related to me from Malik from Abu'z-Zinad from Abu Salama ibn Abd ar-Rahman from Abu Hurayra and Zayd ibn Thabit that they saw no harm in eating what was cast up by the sea",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 1060
			}
		},
		{
			"hadithnumber": 1061,
			"arabicnumber": 1061,
			"text": "Yahya related to me from Malik from Abu'z-Zinad from Abu Salama ibn Abd ar-Rahman that some people from al-Jar came to Marwan ibn al- Hakam and asked him about eating what was cast up by the sea. He said, \"There is no harm in eating it.\" Marwan said, \"Go to Zayd ibn Thabit and Abu Hurayra and ask them about it, then come to me and tell me what they say.\" They went to them and asked them, and they both said, \"There is no harm in eating it \" They returned to Marwan and told him. Marwan said, \"I told you.\" Malik said that there was no harm in eating fish caught by magians, because the Messenger of Allah, may Allah bless him and grant him peace, said, \"In the sea's water is purity, and that which is dead in it is halal. \" Malik said, \"If it is eaten when it is dead, there is no harm in who catches it",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 1061
			}
		},
		{
			"hadithnumber": 1062,
			"arabicnumber": 1062,
			"text": "Yahya related to me from Malik from Ibn Shibab from Abu Idris al- Khawlani from Abu Tha~laba al-Khushani that the Messenger of Allah, may Allah bless him and grant him peace, said, \"It is haram to eat animals with fangs",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Shadh"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 1062
			}
		},
		{
			"hadithnumber": 1063,
			"arabicnumber": 1063,
			"text": "Yahya related to me from Malik from Ismail ibn Abi Hakim from Abiyda ibn Sufyan al-Hadrami from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, said, \"Eating animals with fangs is haram. \" Malik said, \"This is the custom among us",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 1063
			}
		},
		{
			"hadithnumber": 1064,
			"arabicnumber": 1064,
			"text": "Yahya related to me from Malik that the best of what he had heard about horses, mules, and donkeys was that they were not eaten because Allah, the Blessed, the Exalted,said, \"And horses, and mules and asses, for you to ride, and as an adornment. \" (Sura 16 ayat 8) . He said, may He be Blessed and Exalted, \"In cattle, some of them you ride, and some of them you eat.\" (Sura 6 ayat 79). He said, the Blessed, the Exalted, \"Mention Allah's name over what He has provided you of cattle, and eat of them and feed the beggar (al-qani) and the suppliant (al-mutarr). (Sura 22 ayat 34). Malik said \"Allah mentioned horses, mules, and donkeys for riding and adornment, and He mentioned cattle for riding and eating.\" Malik said, \"Al-qani also means the poor.\" Yahya related to me from Malik from Ibn Shihab from Ubaydullah ibn Abdullah ibn Utba ibn Masud that Abdullah ibn Abbas said, \"The Messenger of Allah, may Allah bless him and grant him peace, passed by a dead sheep which had been given to a mawla of his wife, Maimuna. He said, ' Aren't you going to use its skin?' They said, 'Messenger of Allah, but it is carrion. 'The Messenger of Allah, may Allah bless him and grant him peace, said, 'Only eating it is haram",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 1064
			}
		},
		{
			"hadithnumber": 1065,
			"arabicnumber": 1065,
			"text": "Malik related to me from Zayd ibn Aslam from Ibn Wala al-Misri from Abdullah ibn Abbas that the Messenger of Allah, may Allah bless him and grant him peace, said, \"A skin when it is tanned is pure",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 1065
			}
		},
		{
			"hadithnumber": 1066,
			"arabicnumber": 1066,
			"text": "Yahya related to me from Malik from Yazid ibn Abdullah ibn Qusayt from Muhammad ibn Abd ar-Rahman ibn Thawban from his mother that A'isha, the wife of the Prophet, may Allah bless him and grant him peace, said that the Messenger of Allah, may Allah bless him and grant him peace, ordered that the skins of carrion be used after they had been tanned",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 1066
			}
		}
	]
}