{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"31": "Business Transactions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1290,
			"arabicnumber": 1290,
			"text": "Yahya related to me from Malik from a reliable source from Amr ibn Shuayb from his father from his father's father that the Messenger of Allah, may Allah bless him and grant him peace, forbade transactions in which nonrefundable deposits were paid. Malik said, \"That is, in our opinion, but Allah knows best, that for instance, a man buys a slave or slave-girl or rents an animal and then says to the person from whom he bought the slave or leased the animal, 'I will give you a dinar or a dirham or whatever on the condition that if I actually take the goods or ride what I have rented from you, then what I have given you already goes towards payment of the goods or hire of the animal. If I do not purchase the goods or hire the animal, then what I have given you is yours without liability on your part.' \" Malik said, \"According to the way of doing things with us there is nothing wrong in bartering an",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1290
			}
		},
		{
			"hadithnumber": 1291,
			"arabicnumber": 1291,
			"text": "Yahya related to me from Malik from Nafi from Abdullah ibn Umar that Umar ibn al-Khattab said, \"If a slave who has wealth is sold, that wealth belongs to the seller unless the buyer stipulates its inclusion.\" Malik said, \"The generally agreed upon way of doing things among us is that if the buyer stipulates the inclusion of the slave's property whether it be cash, debts, or goods of known or unknown value, then they belong to the buyer, even if the slave possesses more than that for which he was purchased, whether he was bought for cash, as payment for a debt, or in exchange for goods. This is possible because a master is not asked to pay zakat on his slave's property. If a slave has a slave-girl, it is halal for him to have intercourse with her by his right of possession. If a slave is freed or put under contract (kitaba) to purchase his freedom, then his property goes with him. If he becomes bankrupt, his creditors take his property and his master is not liable for any of his debts",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1291
			}
		},
		{
			"hadithnumber": 1292,
			"arabicnumber": 1292,
			"text": "Yahya related to me from Malik from Abdullah ibn Abi Bakr ibn Muhammad ibn Amr ibn Hazm that Aban ibn Uthman and Hisham ibn Ismail used to mention in their khutbas built-in liability agreements in the sale of slaves, to cover both a three day period and a similar clause covering a year. Malik explained, \"The defects a lave or slave-girl are found to have from the time they are bought until the end of the three days are the responsibility of the seller. The year agreement is to cover insanity, leprosy, and loss of limbs due to disease. After a year, the seller is free from any liability.\" Malik said,\"An inheritor or someone else who sells a slave or slave-girl without any such built-in guarantee is not responsible for any fault in the slave and there is no liability agreement held against him unless he was aware of a fault and concealed it. If he was aware of a fault, the lack of guarantee does not protect him. The purchase is returned. In our view, built-in liability agreements only apply to the purchase of slaves",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1292
			}
		},
		{
			"hadithnumber": 1293,
			"arabicnumber": 1293,
			"text": "Yahya related to me from Malik from Yahya ibn Said from Salim ibn Abdullah that Abdullah ibn Umar sold one of his slaves for eight hundred dirhams with the stipulation that he was not responsible for defects. The person who bought the slave complained to Abdullah ibn Umar that the slave had a disease which he had not told him about. They argued and went to Uthman ibn Affan for a decision . The man said, \"He sold me a slave with a disease which he did not tell me about.\" Abdullah said, \"I sold to him with the stipulation that I was not responsible.\" Uthman ibn Affan decided that Abdullah ibn Umar should take an oath that he had sold the slave without knowing that he had any disease. Abdullah ibn Umar refused to take the oath, so the slave was returned to him and recovered his health in his possession. Abdullah sold him afterwards for 1500 dirhams. Malik said, \"The generally agreed upon way of doing things among us about a man who buys a female slave and she becomes pregnant, or who buys a slave and then frees him, or if there is any other such matter which has already happened so that he cannot return his purchase, and a clear proof is established that there was a fault in that purchase when it was in the hands of the seller or the fault is admitted by the seller or someone else, is that the slave or slave-girl is assessed for its value with the fault it is found to have had on the day of purchase and the buyer is refunded,from what he paid,the difference between the price of a slave who is sound and a slave with such a defect. Malik said, \"The generally agreed upon way of doing things among us regarding a man who buys a slave and then finds out that the slave has a defect for which he can be returned and meanwhile another defect has happened to the slave whilst in his possession, is that if the defect which occurred to the slave in his possession has harmed him, like loss of a limb, loss of an eye, or something similar, then he has a choice. If he wants, he can have the price of the slave reduced commensurate with the defect (he bought him with ) according to the prices on the day he bought him, or if he likes, he can pay compensation for the defect which the slave has suffered in his possession and return him. The choice is up to him. If the slave dies in his possession, the slave is valued with the defect which he had on the day of his purchase. It is seen what his price would really have been. If the price of the slave on the day of purchase without fault was 100 dinars, and his price on the day of purchase with fault would have been 80 dinars, the price is reduced by the difference. These prices are assessed according to the market value on the day the slave was purchased . \" Malik said, \"The generally agreed upon way of doing things among us is that if a man returns a slave girl in whom he has found a defect and he has already had intercourse with her, he must pay what he has reduced of her price if she was a virgin. If she was not a virgin, there is nothing against his having had intercourse with her because he had charge of her.\" Malik said, \"The generally agreed upon way of doing things among us regarding a person, whether he is an inheritor or not, who sells a slave, slave-girl, or animal without a liability agreement is that he is not responsible for any defect in what he sold unless he knew about the fault and concealed it. If he knew that there was a fault and concealed it, his declaration that he was free of responsibility does not absolve him, and what he sold is returned to him.\" Malik spoke about a situation where a slave-girl was bartered for two other slave-girls and then one of the slave-girls was found to have a defect for which she could be returned. He said, \"The slave-girl worth two other slave- girls is valued for her price. Then the other two slave-girls are valued, ignoring the defect which the one of them has. Then the price of the slave-girl sold for two slave-girls is divided between them according to their prices so that the proportion of each of them in her price is arrived at - to the higher priced one according to her higher price, and to the other according to her value. Then one looks at the one with the defect, and the buyer is refunded according to the amount her share is affected by the defect, be it little or great. The price of the two slave-girls is based on their market value on the day that they were bought.\" Malik spoke about a man who bought a slave and hired him out on a long-term or short-term basis and then found out that the slave had a defect which necessitated his return. He said that if the man returned the slave because of the defect, he kept the hire and revenue. \"This is the way in which things are done in our city. That is because, had the man bought a slave who then built a house for him, and the value of the house was many times the price of the slave, and he then found that the slave had a defect for which he could be returned, and he was returned, he would not have to make payment for the work the slave had done for him. Similarly, he would keep any revenue from hiring him out, because he had charge of him. This is the way of doing things among us.\" Malik said, \"The way of doing things among us when someone buys several slaves in one lot and then finds that one of them has been stolen, or has a defect, is that he looks at the one he finds has been stolen or the one in which he finds a defect. If he is the pick of those slaves, or the most expensive, or it was for his sake that he bought them, or he is the one in whom people see the most excellence, then the whole sale is returned. If the one who is found to be stolen or to have a defect is not the pick of the slaves, and he did not buy them for his sake, and there is no special virtue which people see in him, the one who is found to have a defect or to have been stolen is returned as he is, and the buyer is refunded his portion of the total price",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1293
			}
		},
		{
			"hadithnumber": 1294,
			"arabicnumber": 1294,
			"text": "Yahya related to me from Malik from Ibn Shihab that Ubaydullah ibn Abdullah ibn Utba ibn Masud told him that Abdullah ibn Masud bought a slave-girl from his wife, Zaynab Ath Thaqafiyya. She made a condition to him, that if he bought her, she could always buy her back for the price that he paid. Abdullah ibn Masud asked Umar ibn al- Khattab about that and Umar ibn al-Khattab said, \"Do not go near her while anyone has a condition concerning her over you",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1294
			}
		},
		{
			"hadithnumber": 1295,
			"arabicnumber": 1295,
			"text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar would say, \"A man should not have intercourse with a slave girl except one whom, if he wished, he could sell, if he wished, he could give away, if he wished, he could keep, if he wished, he could do with her what he wanted .\" Malik said that a man who bought a slave- girl on condition that he did not sell her, give her away, or do something of that nature, was not to have intercourse with her. That was because he was not permitted to sell her or to give her away, so if he did not own that from her, he did not have complete ownership of her because an exception had been made concerning her by the hand of someone else. If that sort of condition entered into it, it was a messy situation, and the sale was not recommended",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1295
			}
		},
		{
			"hadithnumber": 1296,
			"arabicnumber": 1296,
			"text": "Yahya related to me from Malik from Ibn Shihab that Abdullah ibn Amir gave Uthman ibn Affan a slave-girl who had a husband whom he had purchased at Basra. Uthman said, \"I will not go near her until her husband separates from her.\" Ibn Amir compensated the husband and he separated from her",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1296
			}
		},
		{
			"hadithnumber": 1297,
			"arabicnumber": 1297,
			"text": "Yahya related to me from Malik from Ibn Shihab from Abu Salama ibn Abd ar-Rahman ibn Awf that Abd ar-Rahman ibn Awf bought a slave- girl and found that she had a husband, so he returned her",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1297
			}
		},
		{
			"hadithnumber": 1298,
			"arabicnumber": 1298,
			"text": "Yahya related to me from Malik from Nafi from Abdullah ibn Umar that the Messenger of Allah, may Allah bless him and grant him peace, said, \"If palm trees are sold after they have been pollinated, the fruit belongs to the seller unless the buyer makes a stipulation about its inclusion",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1298
			}
		},
		{
			"hadithnumber": 1299,
			"arabicnumber": 1299,
			"text": "Yahya related to me from Malik from Nafi from Ibn Umar that the Messenger of Allah, may Allah bless him and grant him peace, forbade selling fruit until it had started to ripen. He forbade the transaction to both buyer and seller",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1299
			}
		},
		{
			"hadithnumber": 1300,
			"arabicnumber": 1300,
			"text": "Yahya related to me from Malik from Humayd at-Tawil from Anas ibn Malik that the Messenger of Allah, may Allah bless him and grant him peace, forbade selling fruit until it had become mellow. He was asked, \"Messenger ofAllah! What do you mean by become mellow?\" He said, \"When it becomes rosy.\" The Messenger of Allah, may Allah bless him and grant him peace, added, \"Allah may prevent the fruit from maturing, so how can you take payment from your brother for it",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1300
			}
		},
		{
			"hadithnumber": 1301,
			"arabicnumber": 1301,
			"text": "Yahya related to me from Malik from Abu'r-Rijal Muhammad ibn Abd ar-Rahman ibn Haritha from his mother, Amra bint Abd ar-Rahman that the Messenger of Allah, may Allah bless him and grant him peace, forbade selling fruit until it was clear of blight. Malik said, \"Selling fruit before it has begun to ripen is an uncertain transaction (gharar)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1301
			}
		},
		{
			"hadithnumber": 1302,
			"arabicnumber": 1302,
			"text": "Yahya related to me from Malik from Abu'z-Zinad from Kharija ibn Zayd ibn Thabit that Zayd ibn Thabit did not sell fruit until the Pleiades were visible, at the end of May. Malik said, \"The way of doing things among us about selling melons, cucumbers, water- melons, and carrots is that it is halal to sell them when it is clear that they have begun to ripen. Then the buyer has what grows until the season is over. There is no specific timing laid down for that because the time is well known with people, and it may happen that the crop will be affected by blight and put a premature end to the season. If blight strikes and a third or more of the crop is damaged, an allowance for that is deducted from the price of purchase",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1302
			}
		},
		{
			"hadithnumber": 1303,
			"arabicnumber": 1303,
			"text": "Yahya related to me from Malik from Nafi from Abdullah ibn Umar from Zayd ibn Thabit that the Messenger of Allah, may Allah bless him and grant him peace, allowed the holder of an ariya to barter the dates on the palm for the amount of dried dates it was estimated that the palms would produce",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1303
			}
		},
		{
			"hadithnumber": 1304,
			"arabicnumber": 1304,
			"text": "Yahya related to me from Malik from Da'ud ibn al-Husayn from Abu Sufyan, the mawla of Ibn Abi Ahmad, from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, allowed the produce of an ariya to be bartered for an estimation of what the produce would be when the crop was less than five awsuq or equal to five awsuq. Da'ud wasn't sure whether he said five awsuq or less than five. Malik said, ''Ariyas can be sold for an estimation of what amount of dried dates will be produced. The crop is examined and estimated while still on the palm. This is allowed because it comes into the category of delegation of responsibility, handing over rights, and involving a partner. Had it been like a form of sale, no one would have made someone else a partner in the produce until it was ready nor would he have renounced his right to any of it or put someone in charge of it until the buyer had taken possession",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1304
			}
		},
		{
			"hadithnumber": 1305,
			"arabicnumber": 1305,
			"text": "Yahya related to me from Malik that Abu'r-Rijal Muhammad ibn Abd ar-Rahman heard his mother, Amra bint Abd ar-Rahman say, \"A man bought the fruit of an enclosed orchard in the time of the Messenger of Allah, may Allah bless him and grant him peace, and he tended it while staying on the land. It became clear to him that there was going to be some loss. He asked the owner of the orchard to reduce the price for him or to revoke the sale, but the owner made an oath not to do so. The mother of the buyer went to the Messenger of Allah, may Allah bless him and grant him peace, and told him about it. The Messengerof Allah, may Allah bless him and grant him peace, said, 'By this oath, he has sworn not to do good.' The owner of the orchard heard about it and went to the Messenger of Allah, may Allah bless him and grant him peace, and said, 'Messenger of Allah, the choice is his",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1305
			}
		},
		{
			"hadithnumber": 1306,
			"arabicnumber": 1306,
			"text": "Yahya related to me from Malik that he had heard that Umar ibn Abd al-Aziz decided in a case to make a reduction for crop damage. Malik said, \"That is what we do in the situation.\" Malik added, \"Crop damage is whatever causes loss of a third or more for the purchaser. Anything less is not counted as crop damage",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1306
			}
		},
		{
			"hadithnumber": 1307,
			"arabicnumber": 1307,
			"text": "Yahya related to me from Malik from Rabia ibn Abd ar-Rahman that al-Qasim ibn Muhammad would sell produce from his orchard and keep some of it aside",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1307
			}
		},
		{
			"hadithnumber": 1308,
			"arabicnumber": 1308,
			"text": "Yahya related to me from Malik from Abdullah ibn Abi Bakr that his grandfather, Muhammad ibn Amr ibn Hazm sold the fruit of an orchard of his called al-Afraq, for 4,000 dirhams, and he kept aside 800 dirhams' worth of dry dates",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1308
			}
		},
		{
			"hadithnumber": 1309,
			"arabicnumber": 1309,
			"text": "Yahya related to me from Malik from Abu'r-Rijal, Muhammad ibn Abdar-Rahman ibn Haritha that his mother, Amra bint Abd ar-Rahman used to sell her fruit and keep some of it aside. Malik said, \"The generally agreed upon way of doing things among us is that when a man sells the fruit of his orchard, he can keep aside up to a third of the fruit, but that is not to be exceeded. There is no harm in what is less than a third.\" Malik added that he thought there was no harm for a man to sell the fruit of his orchard and keep aside only the fruit of a certain palm-tree or palm-trees which he had chosen and whose number he had specified, because the owner was only keeping aside certain fruit of his own orchard and everything else he sold",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1309
			}
		},
		{
			"hadithnumber": 1310,
			"arabicnumber": 1310,
			"text": "Yahya related to me from Malik from Zayd ibn Aslam that Ata ibn Yasar said, \"The Messenger of Allah, may Allah bless him and grant him peace, said, 'Dried dates for dried dates is like for like.' It was said to him, 'Your agent in Khaybar takes one sa for two.' The Messenger of Allah, may Allah bless him and grant him peace, said, 'all him to me.' So he was called for. The Messenger of Allah, may Allah bless him and grant him peace, asked, 'Do you take one sa for two?' He replied, 'Messengerof Allah! Why should they sell me good dates for assorted low quality dates, sa for sa!' The Messenger of Allah, may Allah bless him and grant him peace, said, 'Sell the assorted ones for dirhams, and then buy the good ones with those dirhams",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1310
			}
		},
		{
			"hadithnumber": 1311,
			"arabicnumber": 1311,
			"text": "Yahya related to me from Malik from Abd al-Hamid ibn Suhayl ibn Abd ar-Rahman ibn Awf from Said ibn al-Musayyab from Abu Said al- Khudri and from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, appointed a man as an agent in Khaybar, and he brought him some excellent dates. The Messenger of Allah, may Allah bless him and grant him peace, said to him, \"Are all the dates of Khaybar like this?\" He said,\"No. By Allah, Messenger of Allah! We take a sa of this kind for two sa or two sa for three.\" The Messenger of Allah, may Allah bless him and grant him peace, said, \"Do not do that. Sell the assorted ones for dirhams and then buy the good ones with the dirhams",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1311
			}
		},
		{
			"hadithnumber": 1312,
			"arabicnumber": 1312,
			"text": "Yahya related to me from Malik from Abdullah ibn Yazid that Zayd ibn Ayyash told him that he had once asked Sad ibn Abi Waqqas about selling white wheat for a type of good barley. Sad asked him which was the better and when he told him the white wheat, he forbade the transaction. Sad said, \"I heard the Messenger of Allah, may Allah bless him and grant him peace, being asked about selling dried dates for fresh dates, and the Messenger of Allah, may Allah bless him and grant him peace, said, 'Do the dates diminish in size when they become dry?' When he was told that they did, he forbade that",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1312
			}
		},
		{
			"hadithnumber": 1313,
			"arabicnumber": 1313,
			"text": "Yahya related to me from Malik from Nafi from Abdullah ibn Umar that the Messenger of Allah, may Allah bless him and grant him peace, forbade muzabana. Muzabana was selling fresh dates for dried dates by measure, and selling grapes for raisins by measure",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1313
			}
		},
		{
			"hadithnumber": 1314,
			"arabicnumber": 1314,
			"text": "Yahya related to me from Malik from Da'ud ibn al-Husayn from Abu Sufyan, the mawla of Ibn Abi Ahmad, from Abu Said al-Khudri that the Messenger of Allah, may Allah bless him and grant him peace, forbade muzabana and muhaqala. Muzabana was selling fresh dates for dried dates while they were still on the trees. Muhaqala was renting land in exchange for wheat",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1314
			}
		},
		{
			"hadithnumber": 1315,
			"arabicnumber": 1315,
			"text": "Yahya related to me from Malik from Ibn Shihab from Said ibn al- Musayyab that the Messenger of Allah, may Allah bless him and grant him peace, forbade muzabana and muhaqala. Muzabana was selling fresh dates for dried dates. Muhaqala was buying unharvested wheat in exchange for threshed wheat and renting land in exchange for wheat. Ibn Shihab added that he had asked Said ibn al-Musayyab about renting land for gold and silver. He said, \"There is no harm in it.\" Malik said, \"The Messenger of Allah, may Allah bless him and grant him peace, forbade muzabana. The explanation of muzabana is that it is buying something whose number, weight and measure is not known with something whose number, weight or measure is known, for instance, if a man has a stack of food whose measure is not known, either of wheat, dates, or whatever food, or the man has goods of wheat, date kernels, herbs, safflower, cotton, flax, silk, and does not know its measure or weight or number and then a buyer approaches him and proposes that he weigh or measure or count the goods, but, before he does, he specifies a certain weight, or measure, or number and guarantees to pay the price for that amount, agreeing that whatever falls short of that amount is a loss against him and whatever is in excess of that amount is a gain for him. That is not a sale. It is taking risks and it is an uncertain transaction. It falls into the category of gambling because he is not buying something from him for something definite which he pays. Everything which resembles this is also forbidden.\" Malik said that another example of that was, for instance, a man proposing to another man, \"You have cloth. I will guarantee you from this cloth of yours so many hooded cloaks, the measureof each cloak to be such-and-such, (naming a measurement). Whatever loss there is, is against me and I will fulfill you the specified amount and whatever excess there is, is mine.\" Or perhaps the man proposed, \"I will guarantee you from this cloth of yours so many shirts, the measurement of each shirt to be such-and-such, and whatever loss there is, is against me and I will fulfill the specified amount and whatever excess there is, is mine.\" Or perhaps a man proposed to a man who had cattle or camel hides, \"I will cut up these hides of yours into sandals on a pattern I will show you. Whatever falls short of a hundred pairs, I will make up its loss and whatever is over is mine because I guaranteed you.\" Another example was that a man say to a man who had ben-nuts, \"I will press these nuts of yours. Whatever falls short of such-and-such a weight by the pound, I will make it up, and whatever is more than that is mine.\" Malik said that all this and whatever else was like it or resembled it was in the category of muzabana, which was neither good nor permitted. It was also the same case for a man to say to a man, who had fodder leaves, date kernels, cotton, flax, herbs or safflower, \"I will buy these leaves from you in exchange for such-and-such a sa, (indicating leaves which are pounded like his leaves) . . or these date kernels for such-and-such a sa of kernels like them, and the like of that in the case of safflower, cotton, flax and herbs.\" Malik said, \"All this is what we have described of muzabana",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1315
			}
		},
		{
			"hadithnumber": 1316,
			"arabicnumber": 1316,
			"text": "Malik said, \"There is no harm in buying dates from specified trees or a specified orchard or buying milk from specified sheep when the buyer starts to take them as soon as he has payed the price. That is like buying oil from a container. A man buys some of it for a dinar or two and gives his gold and stipulates that it be measured out for him. There is no harm in that. If the container breaks and the oil is wasted, the buyer has his gold back and there is no transaction between them.\" Malik said, \"There is no harm in everything which is taken right away as it is, like fresh milk and fresh picked dates which the buyer can take on a day-to-day basis. If the supply runs out before the buyer has what he has paid for in full, the seller gives him back the portion of the gold that is owed to him, or else the buyer takes other goods from him to the value of what he is owed and which they mutually agree about. The buyer should stay with the seller until he has taken it. It is disapproved of for the seller to leave because the transaction would then come into the forbidden category of a debt for a debt. If a stated time period for payment or delivery enters into the transaction, it is also disapproved. Delay and deferment are not permitted in it, and are only acceptable when it is standard practice on definite terms by which the seller guarantees it to the buyer, but this is not to be from one specific orchard or from any specific ewes.\" Malik was asked about a man who bought an orchard from another man in which there were various types of palm-trees - excellent ajwa palms, good kabis palms, adhq palms and othertypes. The seller kept aside from the sale the produce of a certain palm of his choice. Malik said, \"That is not good because if he does that, and keeps aside, for instance, dates of the ajwa variety whose yield would be 15 sa, and he picks the dates of the kabis in their place, and the yield of their dates is 10 sa or he picks the ajwa which yield 15 sa and leaves the kabis which yield 10 sa, it is as if he bought the ajwa for the kabis making allowances for their difference of quality. This is the same as if a man dealing with a man who has heaps of dates before him - a heap of 15 sa of ajwa, a heap of 10 sa of kabis, and a heap of 12 sa of cadhq, gives the owner of the dates a dinar to let him choose and take whichever of the heaps he likes.\" Malik said, \"That is not good.\" Malik was asked what a man who bought fresh dates from the owner of an orchard and advanced him a dinar was entitled to if the crop was spoilt. Malik said, \"The buyer makes a reckoning with the owner of the orchard and takes what is due to him of the dinar. If the buyer has taken two-thirds of a dinar's worth of dates, he gets back the third of a dinar which is owed him. If the buyer has taken three-quarters of a dinar's worth of dates, then he gets back the quarter which is owed to him, or they come to a mutual agreement, and the buyer takes what is owed him from his dinar from the owner of the orchard in something else of his choosing. If, for instance, he prefers to take dry dates or some other goods, he takes them according to what is due. If he takes dry dates or some other goods, he should stay with him until he has been paid in full.\" Malik said, \"This is the same situation as hiring out a specified riding-camel or hiring out a slave tailor, carpenter or some other kind of worker or letting a house and taking payment in advance for the hire of the slave or the rent of the house or camel. Then an accident happens to what has been hired resulting in death or something else. The owner of the camel, slave or house returns what remains of the rent of the camel, the hire of the slave or the rent of the house to the one who advanced him the money, and the owner reckons what will settle that up in full. If, for instance, he has provided half of what the man paid for, he returns the remaining half of what he advanced, or according to whatever amount is due.\" Malik said, \"Paying in advance for something which is on hand is only good when the buyer takes possession of what he has paid for as soon as he hands over the gold, whether it be slave, camel, or house, or in the case of dates, he starts to pick them as soon as he has paid the money.\" It is not good that there be any deferment or credit in such a transaction. Malik said, \"An example illustrating what is disapproved of in this situation is that, for instance, a man may say that he will pay someone in advance for the use of his camel to ride in the hajj, and the hajj is still some time off, or he may say something similar to that about a slave or a house. When he does that, he only pays the money in advance on the understanding that if he finds the camel to be sound at the time the hire is due to begin, he will take it by virtue of what he has already paid. If an accident, or death, or something happens to the camel, then he will get his money back and the money he paid in advance will be considered as a loan.\" Malik said, \"This is distinct from someone who takes immediate possession of what he rents or hires, so that it does not fall into the category of 'uncertainty,' or disapproved payment in advance. That is following a common practice. An example of that is that a man buys a slave, or slave-girl, and takes possession of them and pays their price. If something happens to them within the period of the year indemnification contract, he takes his gold back from the one from whom he bought it. There is no harm in that. This is the precedent of the sunna in the matter of selling slaves.\" Malik said, \"Someone who rents a specified slave, or hires a specified camel, for a future date, at which time he will take possession of the camel or slave, has not acted properly because he did not take possession of what he rented or hired, nor is he advancing a loan which the person is responsible to pay back.\" Malik said, \"The generally agreed on way of doing things among us is that some one who buys some fruit, fresh or dry, should not resell it until he gets full possession of it. He should not barter things of the same type, except hand to hand. Whatever can be made into dry fruit to be stored and eaten, should not be bartered for its own kind, except hand to hand, like for like, when it is the same kind of fruit. In the case of two different kinds of fruit, there is no harm in bartering two of one kind for one of another, hand to hand on the spot. It is not good to set delayed terms. As for produce which is not dried and stored but is eaten fresh like water melon, cucumber, melon, carrots, citron, medlars, pomegranates, and soon, which when dried no longer counts as fruit, and is not a thing which is stored up as is fruit, I think that it is quite proper to barter such things two for one of the same variety hand to hand. If no term enters into it, there is no harm in it.\" Yahya related to me from Malik that Yahya ibn Said said, \"The Messenger of Allah, mayAllah bless him and grant him peace, ordered the two Sads to sell a vessel made of either gold or silver from the booty. They either sold each three units of weight for four units of weight of coins or each four units of weight for three units of weight or coins. The Messenger of Allah, may Allah bless him and grant him peace, said to them, 'You have taken usury, so return it",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1316
			}
		},
		{
			"hadithnumber": 1317,
			"arabicnumber": 1317,
			"text": "Yahya related to me from Malik from Musa ibn Abi Tamim from Abu'l Hubab Said ibn Yasar from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, said, \"A dinar for a dinar, a dirham for a dirham, no excess between the two",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1317
			}
		},
		{
			"hadithnumber": 1318,
			"arabicnumber": 1318,
			"text": "Yahya related to me from Malik from Nafi from Abu Said al-Khudri that the Messenger of Allah, may Allah bless him and grant him peace, said, \"Do not sell gold for gold except like for like and do not increase one part over another part. Do not sell silver for silver, except like for like and do not increase one part over another part. Do not sell some of it which is not there for some of it which is",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1318
			}
		},
		{
			"hadithnumber": 1319,
			"arabicnumber": 1319,
			"text": "Yahya related to me from Malik from Humayd ibn Qays al-Makki that Mujahid said, \"I was with Abdullah ibn Umar and an artisan came to him and said, 'Abu Abd ar-Rahman - I fashion gold and then sell what I have made for more than its weight. I take an amount equivalent to the work of my hand.' Abdullah forbade him to do that, so the artisan repeated the question to him, and Abdullah continued to forbid him until he came to the door of the mosque or to an animal that he intended to mount. Then Abdullah ibn Umar said, 'A dinar for a dinar, and a dirham for a dirham. There is no increase between them. This is the command of ourProphet to us and our advice to you",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1319
			}
		},
		{
			"hadithnumber": 1320,
			"arabicnumber": 1320,
			"text": "Yahya related to me from Malik that he had heard from his grandfather, Malik ibn Abi Amir that Uthman ibn Affan said, \"The Messenger of Allah, may Allah bless him and grant him peace, said to me, 'Do not sell a dinar for two dinars nor a dirham for two dirhams",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1320
			}
		},
		{
			"hadithnumber": 1321,
			"arabicnumber": 1321,
			"text": "Yahya related to me from Malik from Zayd ibn Aslam from Ata ibn Yasar that Muawiya ibn Abi Sufyan sold a gold or silver drinking- vessel for more than its weight. Abu'dDarda said, \"I heard the Messenger of Allah, may Allah bless him and grant him peace, forbidding such sales except like for like.\" Muawiya said to him, \"I don't see any harm in it.\" Abu'd-Darda said to him, \"Who will excuse me from Muawiya? I tell him something from the Messenger of Allah, may Allah bless him and grant him peace, and he gives me his own opinion! I will not live in the same land as you!\" Then Abu'd-Darda went to Umar ibn al-Khattab and mentioned that to him. Umar ibn al-Khattab therefore wrote to Muawiya, \"Do not sell it except like for like, weight for weight",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1321
			}
		},
		{
			"hadithnumber": 1322,
			"arabicnumber": 1322,
			"text": "Yahya related to me from Malik from Nafi from Abdullah ibn Umar that Umar ibn al-Khattab said, \"Do not sell gold for gold except like for like, and do not increase one part over another part. Do not sell silver for silver except like for like, and do not increase one part over another part. Do not sell silver for gold, one of them at hand and the other to be given later. If someone seeks to delay paying you until he has been to his house, do not leave him. I fear rama for you.\" Rama is usury",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1322
			}
		},
		{
			"hadithnumber": 1323,
			"arabicnumber": 1323,
			"text": "Yahya related to me from Malik from Abdullah ibn Dinar from Abdullah ibn Umar that Umar ibn al-Khattab said, \"Do not sell gold for gold except like for like. Do not increase part of it over another part. Do not sell silver for silver except like for like, and do not increase part of it over another part. Do not sell some of it which is there for some of it which is not. If someone asks you to wait for payment until he has been to his house, do not leave him. I fear rama for you.\" Rama is usury",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1323
			}
		},
		{
			"hadithnumber": 1324,
			"arabicnumber": 1324,
			"text": "Yahya related to me from Malik that he had heard that al-Oasim ibn Muhammad said, ''Umar ibn al-Khattab said, 'A dinar for a dinar, and a dirham for adirham, and a sa for a sa. Something to be collected later is not to be sold for something at hand",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1324
			}
		},
		{
			"hadithnumber": 1325,
			"arabicnumber": 1325,
			"text": "Yahya related to me from Malik that Abu'z-Zinad heard Said ibn al-Musayyab say, \"There is usury only in gold or silver or what is weighed or measured of what is eaten or drunk",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1325
			}
		},
		{
			"hadithnumber": 1326,
			"arabicnumber": 1326,
			"text": "Yahya related to me from Malik that Yahya ibn Said heard Said ibn al-Musayyab say, \"Keeping gold and silver out of circulation is part of working corruption in the land.\" Malik said, \"There is no harm in buying gold with silver or silver with gold without measuring if it is unminted or a piece of jewellery which has been made. Counted dirhams and counted dinars should not be bought without reckoning until they are known and counted. To abandon number and buy them at random would only be to speculate. That is not part of the business transactions of Muslims. As for what is weighed of unminted objects and jewellery, there is no harm in buying such things without measuring. To buy them without measuring is like buying wheat, dried dates, and such food-stuffs, which are sold without measuring, even though things like them are measured \" Malik spoke about buying a Qur'an, a sword or a signet ring which had some gold or silver work on it with dinars or dirhams. He said, \"The value of the object bought with dinars, which has gold in it is looked at. If the value of the gold is up to one-third of the price, it is permitted and there is no harm in it if the sale is hand to hand and there is no deferment in it. When something is bought with silver which has silver in it, the value is looked at. If the value of the silver is one- third, it is permitted and there is no harm in it if the sale is hand to hand. That is still the way of doing things among us",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1326
			}
		},
		{
			"hadithnumber": 1327,
			"arabicnumber": 1327,
			"text": "Yahya related to me from Malik from Ibn Shihab from Malik ibn Aus ibn al-Hadathan an-Nasri that one time he asked to exchange 100 dinars. He said, \"Talha ibn Ubaydullah called me over and we made a mutual agreement that he would make an exchange for me. He took the gold and turned it about in his hand, and then said, 'I can't do it until my treasurer brings the money to me from al-Ghaba.' Umar ibn al- Khattab was listening and Umar said, 'By Allah! Do not leave him until you have taken it from him!' Then he said, 'The Messenger of Allah, may Allah bless him and grant him peace, said, \"Gold for silver is usury except hand to hand. Wheat for wheat is usury except hand to hand. Dates for dates is usury except hand to hand. Barley for barley is usury except hand to hand.\" \"' Malik said, \"When a man buys dirhams with dinars and then finds a bad dirham among them and wants to return it, the exchange of the dinars breaks down, and he returns the silver and takes back his dinars. The explanation of what is disapproved of in that is that the Messenger of Allah, may Allah bless him and grant him peace, said, 'Gold for silver is usury except hand to hand.' and Umar ibn al-Khattab said, 'If someone asks you to wait to be paid until he has gone back to his house, do not leave him.' When he returns a dirham to him from the exchange after he has left him, it is like a debt or something deferred. For that reason, it is disapproved of, and the exchange collapses. Umar ibn al-Khattab wanted that all gold, silver and food should not be sold for goods to be paid later. He did not want there to be any delay or deferment in any such sale, whether it involved one commodity or different sorts of commodities",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1327
			}
		},
		{
			"hadithnumber": 1328,
			"arabicnumber": 1328,
			"text": "Yahya related to me from Malik that Yazid ibn Abdullah ibn Qusayt saw Said ibn al-Musayyab sell gold counterpoising for gold. He poured his gold into one pan of the scales, and the man with whom he was counterpoising put his gold in the other pan of the scale and when the tongue of the scales was balanced, they took and gave. Malik said, \"According to the way things are done among us there is no harm in selling gold for gold, and silver for silver by counterpoising weight, even if 11 dinars are taken for 10 dinars hand to hand, when the weight of gold is equal, coin for coin, even if the number is different. Dirhams in such a situation are treated the same way as dinars.\" Malik said, \"If, when counterpoising gold for gold or silver for silver, there is a difference of weight, one party should not give the other the value of the difference in silver or something else. Such a transaction is ugly and a means to usury because if one of the parties were permitted to take the difference for a separate price, it could be as if he had bought it separately, so he would be permitted. Then it would be possible for him to ask for many times the value of the difference in order to permit the completion of the transaction between the two parties. Malik said, \"If he had really been sold the difference without anything else with it, he would not have taken it for a tenth of the price for which he took it in order to put a 'legal front' on the transaction. This leads to allowing what is forbidden . The matter is forbidden.\" Malik said that it was not good when counterpoising to give good old gold coins and put along with them unminted gold in exchange for worn kufic gold, which was unpopular and to then treat the exchange as like for like. Malik said, \"The commentary on why that is disapproved is that the owner of the good gold uses the excellence of his old gold coins as an excuse to throw in the unminted gold with it. Had it not been for the superiority of his (good) gold over the gold of the other party, the other party would not have counterpoised the unminted gold for his kufic gold, and the deal would have been refused. \"It is like a man wanting to buy three sa of ajwa dried dates for two sa and a mudd of kabis dates, and on being told that it was not good, then offering two sa of kabis and a sa of poor dates desiring to make the sale possible. That is not good because the owner of the ajwa should not give him a sa of ajwa for a sa of poor dates. He would only give him that because of the excellence of kabis dates. \"Or it is like a man asking some one to sell him three sa of white wheat for two and a half sa of Syrian wheat, and being told that it was not good except like for like, and so offering two sa of wheat and one sa of barley intending to make the sale possible between them. That is not good because no one would have given a sa of barley for a sa of white wheat had that sa been by itself. It was only given because of the excellence of Syrian wheat over the white wheat. This is not good. It is the same as the case of the unminted gold.\" Malik said, \"Where gold, silver and food, things which should only be sold like for like, are concerned, something disliked and of poor quality should not be put with something good and desirable in order to make the sale possible and to make a bad situation halal. When something of desirable quality is put with something of poor quality and it is only included so that its excellence in quality is noticed, something is being sold which if it had been sold on its own, would not have been accepted and to which the buyer would not have paid any attention. It is only accepted by the buyer because of the superiority of what comes with it over his own goods. Transactions involving gold, silver, or food, must not have anything of this description enter into them. If the owner of the poor quality goods wants to sell them, he sells them on their own, and does not put anything with them. There is no harm if it is like that",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1328
			}
		},
		{
			"hadithnumber": 1329,
			"arabicnumber": 1329,
			"text": "Yahya related to me from Malik from Nafi from Abdullah ibn Umar that the Messenger of Allah, may Allah bless him and grant him peace, said, \"Someone who buys food, must not resell it until he takes delivery of it all",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1329
			}
		},
		{
			"hadithnumber": 1330,
			"arabicnumber": 1330,
			"text": "Yahya related to me from Malik from Abdullah ibn Dinar from Abdullah ibn Umar that the Messenger of Allah, may Allah bless him and grant him peace, said, \"Someone who buys food, must not sell it until he takes possession of it",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1330
			}
		},
		{
			"hadithnumber": 1331,
			"arabicnumber": 1331,
			"text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar said, \"In the time of the Messenger of Allah, may Allah bless him and grant him peace, we used to buy food. He sent orders for us to move our purchases from the place in which we purchased them to another place before we re-sold them",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1331
			}
		},
		{
			"hadithnumber": 1332,
			"arabicnumber": 1332,
			"text": "Yahya related to me from Malik from Nafi that Hakim ibn Hizam traded in food for people as Umar ibn al-Khattab had ordered him to do. Hakim re-sold the food before he had taken delivery of it. That reached Umar ibn al-Khattab and he revoked the sale and said, \"Do not sell food which you have purchased until you take delivery of it",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1332
			}
		},
		{
			"hadithnumber": 1333,
			"arabicnumber": 1333,
			"text": "Yahya related to me from Malik that he had heard that receipts were given to people in the time of Marwan ibn al-Hakam for the produce of the market at al-Jar. People bought and sold the receipts among themselves before they took delivery of the goods. Zayd Thabit and one of the Companions of the Messenger of Allah, may Allah bless him and grant him peace, went to Marwan ibn al-Hakam and said, \"Marwan! Do you make usury halal?\" He said, \"I seek refuge with Allah! What is that?\" He said, \"These receipts which people buy and sell before they take delivery of the goods.\" Marwan therefore sent a guard to follow them and to take them from people's hands and return them to their owners",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1333
			}
		},
		{
			"hadithnumber": 1334,
			"arabicnumber": 1334,
			"text": "Yahya related to me from Malik that he had heard that a man wanted to buy food from a man in advance. The man who wanted to sell the food to him went with him to the market, and he began to show him heaps, saying, \"Which one would you like me to buy for you.\" The buyer said to him, \"Are you selling me what you do not have?\" So they came to Abdullah ibn Umarand mentioned that to him. Abdallah ibn Umar said to the buyer, \"Do not buy from him what he does not have.\" He said to the seller, \"Do not sell what you do not have",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1334
			}
		},
		{
			"hadithnumber": 1335,
			"arabicnumber": 1335,
			"text": "Yahya related to me from Malik that Yahya ibn Said heard Jamil ibn Abd ar-Rahman the Muadhdhin say to Said ibn al-Musayyab, \"I am a man who buys whatever Allah wills of the receipts for the provisions which people are offered at al-Jar. I want to take payment for goods that I guarantee to deliver at a future date.\" Said said to him, \"Do you intend to settle these things with receipts for provisions you have bought?\" He said, \"Yes.\" So he forbade that. Malik said, \"The generally agreed on way of doing things among us in which there is no dispute, about buying food - wheat, barley, durra-sorghum, pearl millet, or any pulse or anything resembling pulses on which zakat is obliged, or condiments of any sort - oil, ghee, honey, vinegar, cheese, sesame oil, milk and so on, is that the buyer should not re- sell any of that until he has taken possession and complete delivery of it",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1335
			}
		},
		{
			"hadithnumber": 1336,
			"arabicnumber": 1336,
			"text": "Yahya related to me from Malik that Abu'z-Zinad heard Sa'id ibn al-Musayyab andSulayman ibn Yasar forbid a man to sell wheat for gold on delayed terms and then to buy dried dates with the gold before he had taken delivery of the gold",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1336
			}
		},
		{
			"hadithnumber": 1337,
			"arabicnumber": 1337,
			"text": "Yahya related to me from Malik that Kathir ibn Farqad asked Abu Bakr ibn Muhammad ibn Amr ibn Hazm about a man who sold food to be delivered at a future date to a man for gold and then with the gold, he bought dates before he had taken delivery of the gold. He disapproved of that and forbade it. Yahya related to me from Malik from Ibn Shihab the like of that. Malik said, ''Said ibn al-Musayyab, Sulayman ibn Yasar, Abu Bakr ibn Muhammad ibn Amr ibn Hazm, and Ibn Shihab forbade that a man sell wheat for gold and then buy dates with that gold before he had received the gold from the transaction in which he sold the wheat. There is no harm for someone to buy dates on delayed terms, on the strength of the gold for which he sold the wheat, from someone other than the person to whom he sold the wheat before taking possession of the gold, and to refer the one from whom he bought the dates to his debtor who bought the wheat, for the gold he is owed for the dates.\" Malik said, \"I asked more than one of the people of knowledge about that and they did not see any harm in it",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1337
			}
		},
		{
			"hadithnumber": 1339,
			"arabicnumber": 1339,
			"text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar said that there was no harm in a man making an advance to another man for food, with a set description and price until a set date, as long as it was not in crops, or dates which had not begun to ripen. Malik said, \"The way of doing things among us concerning someone who makes an advance for foodstuffs at a known rate until a stated date, and the date arrives and he finds that there is not enough of what he was sold with the seller to fulfill his order, and so he revokes the sale, is that he must only take back the silver, gold, or price which he paid exactly. He does not buy anything else from the man for the same price until he has got back what he paid. That is because if he took something else besides the price which he paid him or exchanged it for goods other than the goods which he bought from him, it would be selling food before getting delivery of it.\" Malik said, \"The Messenger of Allah, may Allah bless him and grant him peace, forbade selling food before getting delivery of it.\" Malik said that it was not good if the buyer regretted his purchase and asked the seller to revoke the sale for him and he would not press him immediately for what he had paid. The people of knowledge forbade that. That was because when the food was made ready for the buyer by the seller, the buyer deferred his due from the seller in order that he might revoke the sale for him. That was the sale of food with delayed terms before taking delivery of the food. Malik said, \"The explanation of that is that when the date of delivery comes and the buyer dislikes the food, the seller takes by it money to be paid later and so it is not revocation. Revocation is that in which neither the buyer nor the seller is increased. When increase occurs by deferment of payment for a time period, or by anything which increases one of them over the other or anything which gives one of them profit, it is not revocation. When either of them do that, revocation becomes a sale. There is an indulgence for revocation, partnership, and transfer, as long as i ncrease, decrease, or deferment does not come into them. If increase, decrease, or deferment comes into it, it becomes a sale. Whatever makes a sale halal makes it halal and whatever makes a sale haram makes it haram.\" Malik said, \"If someone pays in advance for Syrian wheat, there is no harm if he takes a load after the term falls due.\" Malik said, \"It is the same with whoever advances for any kind of thing. There is no harm in him taking better than whatever he has made an advance for or worse than it after the agreed delivery date. The explanation of that is that if, for instance, a man advances for a certain weight of wheat. There is no harm if he decides to take some barley or Syrian wheat. If he has made an advance for good dates, there is no harm if he decides to take poor quality dates. If he paid in advance for red raisins, there is no harm if he takes black ones, when it happens after the agreed delivery date, and when the measure of what he takes is like the measure of what he paid for in advance",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1339
			}
		},
		{
			"hadithnumber": 1340,
			"arabicnumber": 1340,
			"text": "Yahya related to me from Malik that he had heard that Sulayman ibn Yasar said, \"The fodder of the donkeys of Saad ibn Abi Waqqas ran out and so he told his slave to take some of the family's wheat and buy barley with it, and to only take a like quantity",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1340
			}
		},
		{
			"hadithnumber": 1341,
			"arabicnumber": 1341,
			"text": "Yahya related to me from Malik from Nafi that Sulayman ibn Yasar told him that one time the fodder of the animals of Abd ar-Rahman ibn al-Aswad ibn Abd Yaghuth was finished so he said to his slave, \"Take some of your family's wheat as food and buy with it barley, and take only a like quantity",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1341
			}
		},
		{
			"hadithnumber": 1342,
			"arabicnumber": 1342,
			"text": "Yahya related to me from Malik that he had heard the same as that from al-Qasim ibn Muhammad from Ibn Muayqib ad-Dawsi. Malik said, \"This is the way of doing things among us . \" Malik said, \"The generally agreed on way of doing things among us is that wheat is not sold for wheat, dates for dates, wheat for dates, dates for raisins, wheat for raisins, nor any kind of food sold for food at all, except from hand to hand. If there is any sort of delayed terms in the transaction, it is not good. It is haram. Condiments are not bartered except from hand to hand.\" Malik said, \"Food and condiments are not bartered when they are the same type, two of one kind for one of the other. A mudd of wheat is not sold for two mudds of wheat, nor a mudd of dates for two mudds of dates, nor a mudd of raisins for two mudds of raisins, nor is anything of that sort done with grains and condiments when they are of one kind, even if it is hand to hand. \"This is the same position as silver for silver and gold for gold. No increase is halal in the transaction, and only like for like, from hand to hand is halal.\" Malik said, \"If there is a clear difference in foodstuffs which are measured and weighed, there is no harm in taking two of one kind for one of another, hand to hand. There is no harm in taking a sa of dates for two sa of wheat, and a sa of dates for two sa of raisins, and a sa of wheat for two sa of ghee. If the two sorts in the transaction are different, there is no harm in two for one or more than that from hand to hand. If delayed terms enter into the sale, it is not halal .\" Malik said, \"It is not halal to trade a heap of wheat for a heap of wheat. There is no harm in a heap of wheat for a heap of dates, from hand to hand. That is because there is no harm in buying wheat with dates without precise measurement.\" Malik said, \"With kinds of foods and condiments that differ from each other, and the difference is clear, there is no harm in bartering one kind for another, without precise measurement from hand to hand. If delayed terms enter into the sale, there is no good in it. Bartering such things without precise measurement is like buying it with gold and silver without measuring precisely.\" Malik said, \"That is because you buy wheat with silver without measuring precisely, and dates with gold without measuring precisely, and it is halal. There is no harm in it.\" Malik said, \"It is not good for someone to make a heap of food, knowing its measure and then to sell it as if it had not been measured precisely, concealing its measure from the buyer. If the buyer wants to return that food to the seller, he can, because he concealed its measure and so it is an uncertain transaction. This is done with any kind of food or other goods whose measure and number the seller knows, and which he then sells without measurement and the buyer does not know that. If the buyer wants to return that to the seller, he can return t. The people of knowledge still forbid such a transaction.\" Malik said, \"There is no good in selling one round loaf of bread for two round loaves, nor large for small when some of them are bigger than others. When care is taken that they are like for like, there is no harm in the sale, even if they are not weighed.\" Malik said, \"It is not good to sell a mudd of butter and a mudd of milk for two mudds of butter. This is like what we described of selling dates when two sa of kabis and a sa of poor quality dates were sold for three sa of ajwa dates after the buyer had said to the seller, 'Two sa of kabis dates for three sa of ajwa dates is not good,' and then he did that to make the transaction possible. The owner of the milk puts the milk with his butter so that he can use the superiority of his butter over the butter of the other party to put his milk in with it.\" Malik said, \"Flour for wheat is like for like, and there is no harm in that. That is if he does not mix up anything with the flour and sell it for wheat, like for like. Had he put half a mudd of flour and half of wheat, and then sold that for a mudd of wheat, it would be like what we described, and it would not be good because he would want to use the superiority of his good wheat to put flour along with it. Such a transaction is not good",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1342
			}
		},
		{
			"hadithnumber": 1343,
			"arabicnumber": 1343,
			"text": "Yahya related to me from Malik that Muhammad ibn Abdullah ibn Abi Maryam asked Said ibn al-Musayyab's advice. \"I am a man who buys food with receipts from al-Jar. Perhaps I will buy something for a dinar and half a dirham, and will be given food for a half.\" Said said, \"No. You give a dirham, and take the rest in food.\" (A half dirham did not exist as a coin)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1343
			}
		},
		{
			"hadithnumber": 1344,
			"arabicnumber": 1344,
			"text": "Yahya related to me from Malik that he had heard that Muhammad Sirin used to say, \"Do not sell grain on the ears until it is white.\" Malik said, \"If someone buys food for a known price to be delivered at a stated date, and when the date comes, the one who owes the food says, 'I do not have any food, sell me the food which I owe you with delayed terms.' The owner of the food says, 'This is not good, because the Messenger of Allah, may Allah bless him and grant him peace, forbade selling food until the deal was completed.' The one who owes the food says to his creditor, 'Sell me any kind of food on delayed terms until I discharge the debt to you.' This is not good because he gives him food and then he returns it to him. The gold which he gave him becomes the price of that which is his right against him and the food which he gave him becomes what clears what is between them. If they do that, it becomes the sale of food before the deal is complete.\" Malik spoke about a man who was owed food which he had purchased from a man and this man was owed the like of that food by another man. The one who owed the food said to his creditor, \"I will refer you to my debtor who owes me the same amount of food as I owe you, so that you may obtain the food which I owe you .\" Malik said, \"If the man who had to deliver the food, had gone out, and bought the food to pay off his creditor, that is not good. That is selling food before taking possession of it. If the food is an advance which falls due at that particular time, there is no harm in paying off his creditor with it because that is nota sale. It is not halal to sell food before receiving it in full since the Messenger of Allah, may Allah bless him and grant him peace, forbade that. However, the people of knowledge agree that there is no harm in partnership, transfer of responsibility and revocation in sales of food and other goods.\" Malik said, \"That is because the people of knowledge consider it as a favour rendered. They do not consider it as a sale. It is like a man lending light dirhams. He is then paid back in dirhams of full weight, and so gets back more than he lent. That is halal for him and permitted. Had a man bought defective dirhams from him as being the full weight, that would not be halal. Had it been stipulated to him that he lend full weight in dirhams, and then he gave faulty ones, that would not be halal for him",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1344
			}
		},
		{
			"hadithnumber": 1345,
			"arabicnumber": 1345,
			"text": "Malik said, \"Another example of that is that the Messenger of Allah, may Allah bless him and grant him peace, forbade the sale called muzabana and granted an indulgence in the ariya for computing the equivalent in dates. It was distinguished between them that the muzabana-sale was based on shrewdness and trade, and the ariya sale was based on a favour rendered, and there was no shrewdness in it.\" Malik said, \"A man must not buy food for a fourth, a third, or a fraction of a dirham on the basis that he be given that food on credit. There is no harm in a man buying food for a fraction of a dirham on credit and then he gives a dirham and takes goods with what remains of his dirham because he gave the fraction he owed as silver, and took goods to make up the rest of his dirham. There is no harm in that transaction.\" Malik said, \"There is no harm in a man placing a dirham with another man and then taking from him known goods for a fourth, third, or a known fraction. If there was not a known price on the goods and the man said, 'I will take them from you for the price of each day,' this is not halal because there is uncertainty. It might be less one time, and more another time, and they would not part with a known sale.\" Malik said, \"If someone sells some food without measuring precisely and does not exclude any of it from the sale and then it occurs to him to buy some of it, it is not good for him to buy any of it except what it would be permitted for him to exclude from it. That is a third or less. If it is more than a third, it becomes muzabana and is disapproved. He must only purchase from what he would be permitted to exclude, and he is only permitted to exclude a third or less than that. This is the way of doing things in which there is no dispute with us.\" Yahya related to me from Malik that he had heard that Umar ibn al-Khattab said, \"There is no hoarding in our market, and men who have excess gold in their hands should not buy up one of Allah's provisions which he has sent to our courtyard and then hoard it up against us. Someone who brings imported goods through great fatigue to himself in the summer and winter, that person is the guest of Umar. Let him sell what Allah wills and keep what Allah wills",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1345
			}
		},
		{
			"hadithnumber": 1346,
			"arabicnumber": 1346,
			"text": "Yahya related to me from Malik from Yunus ibn Yusuf from Said ibn al-Musayyab that Umar ibn al-Khattab passed by Hatab ibn Abi Baltaa who was underselling some of his raisins in the market. Umar ibn al- Khattab said to him, \"Either increase the price or leave our market",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1346
			}
		},
		{
			"hadithnumber": 1347,
			"arabicnumber": 1347,
			"text": "Yahya related to me from Malik that he had heard that Uthman ibn Affan forbade hoarding",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1347
			}
		},
		{
			"hadithnumber": 1348,
			"arabicnumber": 1348,
			"text": "Yahya related to me from Malik from Salih ibn Kaysan from Hasan ibn Muhammad ibn Ali ibn Abi Talib that Ali ibn Abi Talib sold one of his camels called Usayfir for 20 camels to be delivered later",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1348
			}
		},
		{
			"hadithnumber": 1349,
			"arabicnumber": 1349,
			"text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar bought a female riding-camel for four camels and he guaranteed to give them in full to the buyer at ar-Rabadha",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1349
			}
		},
		{
			"hadithnumber": 1350,
			"arabicnumber": 1350,
			"text": "Yahya related to me that Malik asked Ibn Shihab about selling animals, two for one with delayed terms. He said, \"There is no harm in it.\" Malik said, \"The generally agreed on way of doing things among us is that there is no harm in bartering a camel for a camel like it and adding some dirhams to the exchange, from hand to hand. There is no harm in bartering a camel for a camel like it with some dirhams on top of the exchange, the camels to be exchanged from hand to hand, and the dirhams to be paid within a period.\" He said, \"There is no good however in bartering a camel for a camel like it with some dirhams on top of it, with the dirhams paid in cash and the camel to be delivered later. If both the camel and the dirhams are deferred there is no good in that either.\" Malik said, \"There is no harm in buying a riding camel with two or more pack-camels, if they are from inferior stock. There is no harm in bartering two of them for one with delayed terms, if they are different and their difference is clear. If they resemble each other whether their species are different or not, two are not to be taken for one with delayed terms.\" Malik said, \"The explanation of what is disapproved of in that, is that a camel should not be bought with two camels when there is no distinction between them in speed or hardiness. If this is according to what I have described to you, then one does not buy two of them for one with delayed terms. There is no harm in selling those of them you buy before you complete the deal to somebody other than the one from whom you bought them if you get the price in cash.\" Malik said, \"It is permitted for someone to advance something on animals for a fixed term and describe the amount and pay its price in cash. Whatever the buyer and seller have described is obliged for them. That is still permitted behaviour between people and what the people of knowledge in our land do",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1350
			}
		},
		{
			"hadithnumber": 1351,
			"arabicnumber": 1351,
			"text": "Yahya related to me from Malih from Nafi from Abdullah ibn Umar that the Messenger of Allah, may Allah bless him and grant him peace, forbade the transaction called habal alhabala. It was a transaction which the people of Jahiliya practised. A man would buy the unborn offspring of the unborn offspring of a she-camel",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1351
			}
		},
		{
			"hadithnumber": 1352,
			"arabicnumber": 1352,
			"text": "Yahya related to me from Malik from Ibn Shihab that Said ibn al- Musayyab said, \"There is no usury in animals. There are three things forbidden in animals:al-madamin, al-malaqih and habal al-habala. Al- madamin is the sale of what is in the wombs of female camels. Al- malaqih is the sale of the breeding qualities of camels\" (i.e. for stud). Malik said, \"No one should buy a specified animal when it is concealed from him or in another place, even if he has already seen it, very recently or not so recently, and was pleased enough with it to pay its price in cash.\" Malik said, \"That is disapproved of because the seller makes use of the price and it is not known whether or not those goods are found to be as the buyer saw them or not. For that reason, it is disapproved of. There is no harm in it if it is described and guaranteed",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1352
			}
		},
		{
			"hadithnumber": 1353,
			"arabicnumber": 1353,
			"text": "Yahya related to me from Malik from Zayd ibn Aslam from Said ibn al-Musayyab that the Messenger of Allah, may Allah bless him and grant him peace, forbade bartering live animals for meat",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan Lighairihi"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1353
			}
		},
		{
			"hadithnumber": 1354,
			"arabicnumber": 1354,
			"text": "Yahya related to me from Malik from Da'ud ibn al-Husayn that he heard Said ibn alMusayyab say, \"Part of the gambling of the people of Jahiliya was bartering live animals for slaughtered meat, for instance one live sheep for two slaughtered sheep",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1354
			}
		},
		{
			"hadithnumber": 1355,
			"arabicnumber": 1355,
			"text": "Yahya related to me from Malik from Abu'z-Zinad that Said ibn al- Musayyab said, \"Bartering live animals for dead meat is forbidden.\" Abu'z-Zinad said, \"I said to Said ibn Musayyab, 'What do you think of a man buying an old camel for 10 sheep?' \" Said said, \"If he buys it to slaughter it, there is no good in it.\" Abu'z-Zinad added, \"All the people (i.e. companions) that I have seen forbade bartering live animals for meat.\" Abu'z-Zinad said, \"This used to be written in the appointment letters of governors in the time of Aban ibn Uthman and Hisham ibn Ismail",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1355
			}
		},
		{
			"hadithnumber": 1356,
			"arabicnumber": 1356,
			"text": "Malik said, \"It is the generally agreed on way of doing things among us that the meat of camels, cattle, sheep and so on is not to be bartered one for one, except like for like, weight for weight, from hand to hand. There is no harm in that. If it is not weighed, then it is estimated to be like for like from hand to hand.\" Malik said, \"There is no harm in bartering the meat of fish for the meat of camels, cattle, and sheep and so on two or more for one, from hand to hand. If delayed terms enter the transaction however, there is no good in it.\" Malik said, \"I think that poultry is different from the meat of cattle and fish. I see no harm in selling some of it for something different, more of one than another, from hand to hand. None of that is to be sold on delayed terms.\" Yahya related to me from Malik from Ibn Shihab from Abu Bakr ibn Abd ar-Rahman ibn al-Harith ibn Hisham from Abu Masud al-Ansari that the Messenger of Allah, may Allah bless him and grant him peace, forbade the sale price of a dog, the earnings of a prostitute and the earnings of a fortune teller. By the earnings of a prostitute he meant what a woman was given for fornication. The earnings of a fortune teller were what he was given to tell a fortune. Malik said, \"I disapprove of the price of a dog, whether it is a hunting dog or otherwise because the Messenger of Allah, may Allah bless him and grant him peace, forbade the price of a dog",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1356
			}
		},
		{
			"hadithnumber": 1357,
			"arabicnumber": 1357,
			"text": "Yahya related to me from Malik that he had heard that the Messenger of Allah, may Allah bless him and grant him peace, forbade 'selling and lending.' Malik said, \"The explanation of what that meant is that one man says to another, 'I will take your goods for such-and-such if you lend me such-and-such.' If they agree to a transaction in this manner, it is not permitted. If the one who stipulates the loan abandons his stipulation, then the sale is permitted.\" Malik said, \"There is no harm in exchanging linen from Shata, for garments from Itribi, or Qass, or Ziqa. Or the cloth of Herat or Merv for Yemeni cloaks and shawls and such like as one for two or three, from hand to hand or with delayed terms. If the goods are of the same kind, and deferment enters into the transaction, there is no good in it.\" Malik said, \"It is not good unless they are different, and the difference between them is clear. When they resemble each other, even if the names are different, do not take two for one with delayed terms, for instance two garments of Herat for one from Merv or Quhy with delayed terms, ortwo garments of Furqub for one from Shata. All these sorts are of the same description, so do not buy two for one, on delayed terms.\" Malik said, \"There is no harm in selling what you buy of things of this nature, before you complete the deal, to some one other than the person from whom you purchased them if the price was paid in cash",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1357
			}
		},
		{
			"hadithnumber": 1358,
			"arabicnumber": 1358,
			"text": "Yahya related to me from Malik from Yahya ibn Said that al-Qasim ibn Muhammad said, ''I heard Abdullah ibn Abbas say, when a man asked him about a man making an advance on some garments and then wanting to sell them back before taking possession of them, 'That is silver for silver,' and he disapproved of it.\" Malik said, \"Our opinion is - and Allah knows best that was because he wanted to sell them to the person from whom he had bought them for more than the price for which he bought them. Had he sold them to some one other than the person from whom he had purchased them, there would not have been any harm in it.\" Malik said, \"The generally agreed on way of doing things among us concerning making an advance for slaves, cattle or goods is that when all of what is to be sold is described and an advance is made for them for a date, and the date falls due, the buyer does not sell any of that to the person from whom he has purchased it for more than the price which he advanced for it before he has taken full possession of what he has advanced for. It is usury if he does. If the buyer gives the seller dinars or dirhams and he profits with them, then, when the goods come to the buyer and he does not take them into his possession but sells them back to their owner for more than what he advanced for them, the outcome is that what he has advanced has returned to him and has been increased for him.\" Malik said, \"If someone advances gold or silver for described animals or goods which are to be delivered before a named date, and the date arrives, or it is before or after the date, there is no harm in the buyer selling those goods to the seller, for other goods, to be taken immediately and not delayed, no matter how extensive the amount of those goods is, except in the case of food because it is not halal to sell it before he has full possession of it. The buyer can sell those goods to some one other than the person from whom he purchased them for gold or silver or any goods. He takes possession of it and does not defer it because if he defers it, that is ugly and there enters into the transaction what is disapproved of:delay for delay. Delay for delay is to sell a debt against one man for a debt against another man.\" Malik said, \"If someone advances for goods to be delivered after a time, and those goods are neither something to be eaten nor drunk, he can sell them to whomever he likes for cash or goods, before he takes delivery of them, to some one other than the person from whom he purchased them. He must not sell them to the person from whom he bought them except in exchange for goods which he takes possession of immediately and does not defer.\" Malik said, \"If the delivery date for the goods has not arrived, there is no harm in selling them to the original owner for goods which are clearly different and which he takes immediate possession of and does not defer.\" Malik spoke about the case of a man who advanced dinars or dirhams for four specified pieces of cloth to be delivered before a specified time and when the term fell due, he demanded delivery from the seller and the seller did not have them. He found that the seller had cloth but inferior quality, and the seller said that he would give him eight of those cloths. Malik said, \"There is no harm in that if he takes the cloths which he offers him before they separate. It is not good if delayed terms enter into the transaction. It is also not good if that is before the end of the term, unless he sells him cloth which is notthetypeof cloth for which he made an advance",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1358
			}
		},
		{
			"hadithnumber": 1359,
			"arabicnumber": 1359,
			"text": "Malik said, \"The generally agreed on way of doing things among us about whatever is weighed but is not gold or silver, i.e. copper, brass, lead, black lead, iron, herbs, figs, cotton, and any such things that are weighed, is that there is no harm in bartering all those sorts of things two for one, hand to hand. There is no harm in taking a ritl of iron for two ritls of iron, and a ritl of brass for two ritls of brass.\" Malik said, \"There is no good in two for one of one sort with delayed terms. There is no harm in taking two of one sort for one of another on delayed terms, if the two sorts are clearly different. If both sorts resemble each other but their names are different, like lead and black lead, brass and yellow brass, I disapprove of taking two of one sort for one of the other on delayed terms.\" Malik said, \"When buying something of this nature, there is no harm in selling It beforetaking possession of it to some one other than the person from whom it was purchased, if the price is taken immediately and if it was bought originally by measure or weight. If it was bought without measuring, it should be sold to someone other than the person from whom it was bought, for cash or with delayed terms. That is because goods have to be guaranteed when they are bought without measuring, and they cannot be guaranteed when bought by weight until they are weighed and the deal is completed. This is the best of what I have heard about all these things. It is what people continue to do among us.\" Malik said, \"The way of doing things among us with what is measured or weighed of things which are not eaten or drunk, like safflower, date-stones, fodder leaves, indigo dye and the like of that is that there is no harm in bartering all those sort of things two for one, hand to hand. Do not take two for one from the same variety with delayed terms. If the types are clearly different, there is no harm in taking two of one for one of the other with delayed terms. There is no harm in selling whatever is purchased of all these sorts, before taking delivery of them if the price is taken from someone other than the person from whom they were purchased.\" Malik said, \"Anything of any variety that profits people, like gravel and gypsum, one quantity of them for two of its like with delayed terms is usury. One quantity of both of them for its equal plus any increase with delayed terms, is usury.\" Yahya related to me from Malik that he had heard that the Messenger of Allah, may Allah bless him and grant him peace, forbade two sales in one sale",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1359
			}
		},
		{
			"hadithnumber": 1360,
			"arabicnumber": 1360,
			"text": "Yahya related to me from Malik that he had heard that a man said to another, \"Buy this camel for me immediately so that I can buy him from you on credit.\" Abdullah ibn Umar was asked about that and he disapproved of it and forbade it",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1360
			}
		},
		{
			"hadithnumber": 1361,
			"arabicnumber": 1361,
			"text": "Yahya related to me from Malik that he had heard that al-Qasim ibn Muhammad was asked about a man who bought goods for 10 dinars cash or fifteen dinars on credit. He disapproved of that and forbade it. Malik said that if a man bought goods from a man for either 10 dinars or 15 dinars on credit, that one of the two prices was obliged on the buyer. It was not to be done because if he postponed paying the ten, it would be 15 on credit, and if he paid the ten, he would buy with it what was worth fifteen dinars on credit. Malik said that it was disapproved of for a man to buy goods from someone for either a dinar cash or for a described sheep on credit and that one of the two prices was obliged on him. It was not to be done because the Messenger of Allah, may Allah bless him and grant him peace, forbade two sales in one sale. This was part of two sales in the one sale. Malik spoke about a man saying to another, \"'I will either buy these fifteen sa of ajwa dates from you, or these ten sa of sayhani dates or I will buy these fifteen sa of inferior wheat or these ten sa of Syrian wheat for a dinar, and one of them is obliged to me.' Malik said that it was disapproved of and was not halal. That was because he obliged him ten sa of sayhani, and left them and took fifteen sa of ajwa, or he was obliged fifteen sa of inferior wheat and left them and took ten sa of Syrian wheat. This was also disapproved of, and was not halal. It resembled what was prohibited in the way of two sales in one sale. It was also included under the prohibition against buying two for one of the same sort of food",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1361
			}
		},
		{
			"hadithnumber": 1362,
			"arabicnumber": 1362,
			"text": "Yahya related to me from Malik from Abu Hazim ibn Dinar from Said ibn al-Musayyab that the Messenger of Allah, may Allah bless him and grant him peace, forbade the sale with uncertainty in it. Malik said, \"An example of one type of uncertain transaction and risk is that a man intends the price of a stray animal or escaped slave to be fifty dinars. A man says, 'I will take him from you for twenty dinars.' If the buyer finds him, thirty dinars goes from the seller, and if he does not find him, the seller takes twenty dinars from the buyer.\" Malik said, \"There is another fault in that. If that stray is found, it is not known whether it will have increased or decreased in value or what defects may have befallen it. This transaction is greatly uncertain and risky.\" Malik said, \"According to our way of doing things, one kind of uncertain transaction and risk is selling what is in the wombs of females - women and animals - because it is not known whether or not it will come out, and if it does come out, it is not known whether it will be beautiful or ugly, normal or disabled, male or female. All that is disparate. If it has that, its price is such-and-such, and if it has this, its price is such-and-such.\" Malik said, \"Females must not be sold with what is in their wombs excluded. That is that, for instance, a man says to another, 'The price of my sheep which has much milk is three dinars. She is yours for two dinars while I will have her future offspring.' This is disapproved because it is an uncertain transaction and a risk.\" Malik said, \"It is not halal to sell olives for olive oil or sesame for sesame oil, or butter for ghee because muzabana comes into that, because the person who buys the raw product for something specified which comes from it, does not know whether more or less will come out of that, so it is an uncertain transaction and a risk.\" Malik said, \"A similar case is the selling of ben-nuts for ben-nut oil. This is an uncertain transaction because what comes from the ben-nut is ben-oil. There is no harm in selling ben-nuts for perfumed ben because perfumed ben has been perfumed, mixed and changed from the state of raw ben-nut oil.\" Malik, speaking about a man who sold goods to a man on the provision that there was to be no loss for the buyer, (i.e. if the buyer could not re-sell the goods they could go back to the seller), said, \"This transaction is not permitted and it is part of risk. The explanation of why it is so, is that it is as if the seller hired the buyer for the profit if the goods make a profit. If he sells the stock at a loss, he has nothing, and his efforts are not compensated. This is not good. In such a transaction, the buyer should have a wage according to the work that he has contributed. Whatever there is of loss or profit in those goods is for and against the seller. This is only when the goods are gone and sold. If they do not go, the transaction between them is null and void.\" Malik said, \"As for a man who buys goods from a man and he concludes the sale and then the buyer regrets and asks to have the price reduced and the seller refuses and says, 'Sell it and I will compensate you for any loss.' There is no harm in this because there is no risk. It is something he proposes to him, and their transaction was not based on that. That is what is done among us",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1362
			}
		},
		{
			"hadithnumber": 1363,
			"arabicnumber": 1363,
			"text": "Yahya related to me from Malik from Muhammad ibn Yahya ibn Habban and from Abu'z-Zinad from al-Araj from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, forbade mulamasa and munabadha. Malik said, \"Mulamasa is when a man can feel a garment but is not allowed to unfold it or examine what is in it, or he buys by night and does not know what is in it. Munabadha is that a man throws his garment to another, and the other throws his garment without either of them making any inspection. Each of them says, 'this is for this. 'This is what is forbidden of mulamasa and munabadha.\" Malik said that selling bundles with a list of their contents was different from the sale of the cloak concealed in a bag or the cloth folded up and such things. What made it different was that it was a common practice and it was what people were familiar with, and what people had done in the past, and it was still among the permitted transactions and trading of people in which they saw no harm because in the sale of bundles with a list of contents without undoing them, an uncertain transaction was not intended and it did not resemble mulamasa",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1363
			}
		},
		{
			"hadithnumber": 1364,
			"arabicnumber": 1364,
			"text": "Yahya related to me, that Malik said, \"The generally agreed on way of doing things among us about a man buying cloth in one city, and then taking it to another city to sell as a murabaha, is that he is not reckoned to have the wage of an agent, or any allowance for ironing, folding, straightening, expenses, or the rent of a house. As for the cost of transporting the drapery, it is included in the basic price, and no share of the profit is allocated to it unless the agent tells all of that to the investor. If they agree to share the profits accordingly after knowledge of it, there is no harm in that.\" Malik said, \"As for bleaching, tailoring, dyeing, and such things, they are treated in the same way as drapery. The profit is reckoned in them as it is reckoned in drapery goods. So if he sells the drapery goods without clarifying the things we named as not getting profit, and if the drapery has already gone, the transport is to be reckoned, but no profit is given. If the drapery goods have not gone the transaction between them is null and void unless they make a new mutual agreement on what is to be permitted between them .\" Malik spoke about an agent who bought goods for gold or silver, and the exchange rate on the day of purchase was ten dirhams to the dinar. He took them to a city to sell murabaha, or sold them where he purchased them according to the exchange rate of the day on which he sold them. If he bought them for dirhams and he sold them for dinars, or he bought them for dinars and he sold them for dirhams, and the goods had not gone then he had a choice. If he wished, he accepted to sell the goods and if he wished, he left them. If the goods had been sold, he had the price for which the salesman bought them, and the salesman was reckoned to have the profit on what they were bought for, over what the investor gained as profit. Malik said, \"If a man sells goods worth one hundred dinars for one hundred and ten, and he hears after that they are worth ninety dinars, and the goods have gone, the seller has a choice. If he likes, he has the price of the goods on the day they were taken from him unless the price is more than the price for which he was obliged to sell them in the first place, and he does not have more than that - and it is one hundred and ten dinars. If he likes, it is counted as profit against ninety unless the price his goods reached was less than the value. He is given the choice between what his goods fetch and the capital plus the profit, which is ninety-nine dinars.\" Malik said, \"If someone sells goods in murabaha and he says, 'It was valued at one hundred dinars to me.' Then he hears later on, that it was worth one hundred and twenty dinars, the customer is given the choice. If he wishes, he gives the salesman the value of the goods on the day he took them, and if he wishes, he gives the price for which he bought them according to the reckoning of what profit he gives him, as far as it goes, unless that is less than the price for which he bought them, for he should not give the owner of the goods a loss from the price for which he bought them because he was satisfied with that. The owner of the goods came to seek extra, so the buyer has no argument against the salesman in that to make a reduction from the first price for which he bought it according to the list of contents.\" Malik spoke about what was done among them in the case of a group of people who bought goods, drapery or slaves, and a man heard about it and said to one of the group, \"I have heard the description and situation of the drapery goods you bought from so-and-so. Shall I give you such-and-such profit to take over your portion?\" This person agreed, and the man gave him the profit and became a partner in his place. When he looked at the purchase, he saw that it was ugly and found it too expensive. Malik said, \"It is obliged on him and there is no choice in it for him if he bought it according to a list of contents and the description was well-known.\" Malik spoke about a man who had drapery goods sent to him, and salesmen came to him and he read to them his list of contents and said, \"In each bag is such-and-such a wrap from Basra and such-and-such a light wrap from Sabir. Their size is such-and-such,\" and he named to them types of drapery goods by their sort, and he said, \"Buy them from me according to this description.\" They bought the bags according to what he described to them, and then they bought them and found them too expensive and regretted it. Malik said, \"The sale is binding on them, if the goods agree with the list of contents on which he sold them.\" Malik said, \"This is the way of doing things which people still use today. They permit the sale among them when the goods agree with the list of contents and are not different from it. \" Yahya related to me from Malik from Nafi from Abdullah ibn Umar that the Messenger of Allah, may Allah bless him and grant him peace, said, \"Both parties in a business transaction have the right of withdrawal as long as they have not separated, except in the transaction called khiyar.\" Malik said, \"There is no specified limit nor any matter which is applied in this case according to us",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1364
			}
		},
		{
			"hadithnumber": 1365,
			"arabicnumber": 1365,
			"text": "Malik related to me that he had heard that Abdullah ibn Masud used to relate that the Messenger of Allah, may Allah bless him and grant him peace, said, \"When two parties dispute about a business transaction, the seller's word is taken, or they make an agreement among themselves. Malik spoke about someone who sold goods to a man, and said at the contracting of the sale, 'I will sell to you provided I consult so-and-so. If he is satisfied, the sale is permitted. If he dislikes it, there is no sale between us.' They made the transaction on that basis. Then the buyer regretted before the seller consulted the person. Malik said, \"That sale is binding on them according to what they described. The buyer has no right of withdrawal, and it is binding on him, if the person whom the seller stipulated to him, permits it.\" Malik said, \"The way of doing things among us about a man who buys goods from another and they differ about the price, and the seller says, 'I sold them to you for ten dinars,' and the buyer says, 'I bought them from you for five dinars,' is that it is said to the seller, 'If you like, give them to the buyer for what he said. If you like, swear by Allah that you only sold your goods for what you said.' If he swears it is said to the buyer, 'Either you take the goods for what the seller said, or you swear by Allah that you bought them only for what you said.' If he swears, he is free to return the goods. That is when each of them testifies against the other",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1365
			}
		},
		{
			"hadithnumber": 1366,
			"arabicnumber": 1366,
			"text": "Yahya related to me from Malik from Abu'z-Zinad from Busr ibn Said from Ubayd, Abu Salih, the mawla of as-Saffah that he said, \"I sold drapery to the people of Dar Nakhla on credit. Then I wanted to go to Kufa, so they proposed that I reduce the price for them and they would pay me immediately . I asked Zayd ibn Thabit about that, and he said, 'I order you not to accept increase or to give to anybody",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1366
			}
		},
		{
			"hadithnumber": 1367,
			"arabicnumber": 1367,
			"text": "Yahya related to me from Malik from Uthman ibn Hafs ibn Khalda from Ibn Shihab from Salim ibn Abdullah that Abdullah ibn Umar was asked about a man who took a loan from another man for a set term. The creditor reduced the debt, and the man paid it immediately Abdullah ibn Umar disliked that, and forbade it",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1367
			}
		},
		{
			"hadithnumber": 1368,
			"arabicnumber": 1368,
			"text": "Malik related to me that Zayd ibn Aslam said, \"Usury in the Jahiliyya was that a man would give a loan to a man for a set term. When the term was due, he would say, 'Will you pay it off or increase me?' If the man paid, he took it. If not, he increased him in his debt and lengthened the term for him .\" Malik said, \"The disapproved of way of doing things about which there is no dispute among us, is that a man should give a loan to a man for a term, and then the demander reduce it and the one from whom it is demanded pay it in advance. To us that is like someone who delays repaying his debt after it is due to his creditor and his creditor increases his debt.\" Malik said, \"This is nothing else but usury. No doubt about it.\" Malik spoke about a man who loaned one hundred dinars to a man for two terms. When it was due, the person who owed the debt said to him, \"Sell me some goods, whose price is one hundred dinars in cash for one hundred and fifty on credit.\" Malik said, \"This transaction is not good, and the people of knowledge still forbid it.\" Malik said, \"This is disapproved of because the creditor himself gives the debtor the price of what the man sells him, and he defers repayment of the hundred of the first transaction for the debtor for the term which is mentioned to him in the second transaction, and the debtor increases him with fifty dinars for his deferring him. That is disapproved of and it is not good. It also resembles the hadith of Zayd ibn Aslam about the transactions of the people of the Jahiliyya. When their debts were due, they said to the person with the debt, 'Either you pay in full or you increase it.' If they paid, they took it, and if not they increased debtors in their debts, and extended the term for them",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1368
			}
		},
		{
			"hadithnumber": 1369,
			"arabicnumber": 1369,
			"text": "Yahya related to me from Malik from Abu'z-Zinad from al Araj from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, said, \"Delay in payment by a rich man is injustice, but when one of you is referred for payment to a wealthy man, let him be referred",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1369
			}
		},
		{
			"hadithnumber": 1370,
			"arabicnumber": 1370,
			"text": "Malik related to me from Musa ibn Maysara that he heard a man ask Said ibn al-Musayyab, \"I am a man who sells for a debt.\" Said said, \"Do not sell except for what you take to your camel.\" Malik spoke about a person who bought goods from a man provided that he provide him with those goods by a specific date, either in time for a market in which he hoped for their saleability, or to fulfil a need at the time he stipulated. Then the seller failed him about the date, and the buyer wanted to return those goods to the seller. Malik said, \"The buyer cannot do that, and the sale is binding on him. If the seller does bring the goods before the completion of the term, the buyer cannot be forced to take them.\" Malik spoke about a person who bought food and measured it. Then some one came to him to buy it and he told him that he had measured it for himself and taken it in full. The new buyer wanted to trust him and accept his measure. Malik said, \"Whatever is sold in this way for cash has no harm in it but whatever is sold in this way on delayed terms is disapproved of until the new buyer measures it out for himself. The sale with delayed terms is disapproved of because it leads to usury and it is feared that it will be circulated in this way without weight or measure. If the terms are delayed it is disapproved of and there is no disagreement about that with us.\" Malik said, \"One should not buy a debt owed by a man whether present or absent, without the confirmation of the one who owes the debt, nor should one buy a debt owed to a man by a dead person even if one knows what the deceased man has left. That is because to buy that is an uncertain transaction and one does not know whether the transaction will be completed or not completed.\" He said, \"The explanation of what is disapproved of in buying a debt owed by someone absent or dead, is that it is not known what unknown debtor may be connected to the dead person. If the dead person is liable for another debt, the price which the buyer gave on strength of the debt may become worthless.\" Malik said, \"There is another fault in that as well. He is buying something which is not guaranteed for him, and so if the deal is not completed, what he paid becomes worthless. This is an uncertain transaction and it is not good.\" Malik said, \"One distinguishes between a man who is only selling what he actually has and a man who is being paid in advance for something which is not yet in his possession. The man advancing the money brings his gold which he intends to buy with. The seller says, 'This is 10 dinars. What do you want me to buy for you with it?' It is as if he sold 10 dinars cash for 15 dinars to be paid later. Because of this, it is disapproved of. It is something leading to usury and fraud",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1370
			}
		},
		{
			"hadithnumber": 1371,
			"arabicnumber": 1371,
			"text": "Malik said there was no harm if a man who sold some drapery and excluded some garments by their markings, stipulated that he chose the marked ones from that. If he did not stipulate that he would choose from them when he made the exclusion, I think that he is partner in the number of drapery goods which were purchased from him. That is because two garments can be alike in marking and be greatly different in price. Malik said, \"The way of doing things among us is that there is no harm in partnership, transferring responsibility to an agent, and revocation when dealing with food and other things, whether or not possession was taken, when the transaction is with cash, and there is no profit, loss, or deferment of price in it. If profit or loss or deferment of price from one of the two enters any of these transactions, it becomes sale which is made halal by what makes sale halal, and made haram by what makes sale haram, and it is not partnership, transferring responsibility to an agent, or revocation.\" Malik spoke about some one who bought drapery goods or slaves, and the sale was concluded, then a man asked him to be his partner and he agreed and the new partner paid the whole price to the seller and then something happened to the goods which removed them from their possession. Malik said, \"The new partner takes the price from the original partner and the original partner demands from the seller the whole price unless the original partner stipulated on the new partner during the sale and before the transaction with the seller was completed that the seller was responsible to him. If the transaction has ended and the seller has gone, the pre-condition of the original partner is void, and he has the responsibility.\" Malik spoke about a man who asked another man to buy certain goods to share between them, and he wanted the other man to pay for him and he would sell the goods for the other man. Malik said, \"That is not good. When he says, 'Pay for me and I will sell it for you,' it becomes a loan which he makes to him in order that he sell it for him and if those goods are destroyed, or pass, the man who paid the price will demand from his partner what he put in for him. This is part of the advance which brings in profit.\" Malik said, \"If a man buys goods, and they are settled for him, and then a man says to him, 'Share half of these goods with me, and I will sell them all for you,' that is halal, there is no harm in it. The explanation of that is that this is a new sale and he sells him half of the goods provided that he sells the whole lot.\" Yahya related to me from Malik from Ibn Shihab from Abu Bakr ibn Abd ar-Rahman ibn al-Harith ibn Hisham that the Messenger of Allah, may Allah bless him and grant him peace, said, \"Whenever a man sells wares and then the buyer becomes bankrupt and the seller has not taken any of the price and he finds some of his property intact with the buyer, he is more entitled to it than anyone else. If the buyer dies, then the seller is the same as other creditors with respect to it",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1371
			}
		},
		{
			"hadithnumber": 1372,
			"arabicnumber": 1372,
			"text": "Malik related to me from Yahya ibn Said from Abu Bakr ibn Muhammad ibn Amr ibn Hazm from Umar ibn Abdal-Aziz from Abu Bakr ibn Abd ar-Rahman ibn al-Harith ibn Hisham from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, said, \"If anyone goes bankrupt, and a man finds his own property intact with him, he is more entitled to it than anyone else.\" Malik spoke about a man who sold a man wares, and the buyer went bankrupt. He said, \"The seller takes whatever of his goods he finds. If the buyer has sold some of them and distributed them, the seller of the wares is more entitled to them than the creditors. What the buyer has distributed does not prevent the seller from taking whatever of it he finds. It is the seller's right if he has received any of the price from the buyer and he wants to return it to take what he finds of his wares, and in what he does not find, he is like the creditors.\" Malik spoke about some one who bought spun wool or a plot of land, and then did some work on it, like building a house on the plot of land or weaving the spun wool into cloth. Then he went bankrupt after he had bought it, and the original owner of the plot said, \"I will take the plot and whatever structure is on it.\" Malik said, \"That structure is not his. However, the plot and what is in it that the buyer has improved is appraised. Then one sees what the price of the plot is and how much of that value is the price of the structure. They are partners in that. The owner of the plot has as much as his portion, and the creditors have the amount of the portion of the structure.\" Malik said, \"The explanation of that is that the value of it all is fifteen hundred dirhams. The value of the plot is five hundred dirhams, and the value of the building is one thousand dirhams. The owner of the plot has a third, and the creditors have two-thirds.\" Malik said, \"It is like that with spinning and other things of the same nature in these circumstances and the buyer has a debt which he cannot pay. This is the behaviour in such cases.\" Malik said, \"As for goods which have been sold and which the buyer does not improve, but those goods sell well and have gone up in price, so their owner wants them and the creditors also want to seize them, then the creditors choose between giving the owner of the goods the price for which he sold them and not giving him any loss and surrendering his goods to him. \"If the price of the goods has gone down, the one who sold them has a choice. If he likes, he can take his goods and he has no claim to any of his debtor's property, and that is his right. If he likes, he can be one of the creditors and take a portion of his due and not take his goods. That is up to him.\" Malik said about someone who bought a slave-girl or animal and she gave birth in his possession and the buyer went bankrupt, \"The slave-girl or the animal and the offspring belong to the seller unless the creditors desire it. In that case they give him his complete due and they take it",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1372
			}
		},
		{
			"hadithnumber": 1373,
			"arabicnumber": 1373,
			"text": "Yahya related to me from Malik from Zayd ibn Aslam from Ata ibn Yasar that Abu Rafi, the mawla of the Messenger of Allah, may Allah bless him and grant him peace, said, \"The Messenger of Allah, may Allah bless him and grant him peace, borrowed a young camel and then the camels of sadaqa came to him.\" Abu Rafi said, \"He ordered me to repay the man his young camel. I said, 'I can only find a good camel in its seventh year in the camels.' The Messenger of Allah, may Allah bless him and grant him peace, said, 'Give it to him. The best of people are those who discharge their debts in the best manner",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1373
			}
		},
		{
			"hadithnumber": 1374,
			"arabicnumber": 1374,
			"text": "Malik related to me from Humayd ibn Qays al-Makki that Mujahid said, \"Abdullah ibn Umar borrowed some dirhams from a man, then he discharged his debt with dirhams better than them. The man said, 'Abu Abdar-Rahman. These are better than the dirhams which I lent you.' Abdullah ibn Umar said, 'I know that. But I am happy with myself about that.' \" Malik said, \"There is no harm in a person who has borrowed gold, silver, food, or animals, taking to the person who lent it, something better than what he lent, when that is not a stipulation between them nor a custom. If that is by a stipulation or promise or custom, then it is disapproved, and there is no good in it.\" He said, \"That is because the Messenger of Allah, may Allah bless him and grant him peace, discharged his debt with a good camel in its seventh year in place of a young camel which he borrowed, and Abdullah ibn Umar borrowed some dirhams, and repaid them with better ones. If that is from the goodness of the borrower, and it is not by a stipulation, promise, or custom, it is halal and there is no harm in it",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1374
			}
		},
		{
			"hadithnumber": 1375,
			"arabicnumber": 1375,
			"text": "Yahya related to me from Malik that he had heard that Umar ibn al-Khattab said that he disapproved of one man lending another food on the provision that he gave it back to him in another city. He said, \"Where is the transport?",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1375
			}
		},
		{
			"hadithnumber": 1376,
			"arabicnumber": 1376,
			"text": "And Malik related to me that he had heard that a man came to Abdullah ibn Umar and said, \"Abu Abd ar-Rahman, I gave a man a loan and stipulated that he give me better than what I lent him.\" Abdullah ibn Umar said, \"That is usury.\" Abdullah said, \"Loans are of three types:A free loan which you lend by which you desire the pleasure of Allah, and so you have the pleasure of Allah. A free loan which you lend by which you desire the pleasure of your companion, so you have the pleasure of your companion, and a free loan which you lend by which you take what is impure by what is pure, and that is usury.\" He said, \"What do you order me to do, Abu Abd ar-Rahman?\" He said, \"I think that you should tear up the agreement. If he gives you the like of what you lent him, accept it. If he gives you less than what you lent him, take it and you will be rewarded. If he gives you better than what you lent him, of his own good will, that is his gratitude to you and you have the wage of the period you gave him the loan",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1376
			}
		},
		{
			"hadithnumber": 1377,
			"arabicnumber": 1377,
			"text": "Yahya related to me from Malik from Nafi that he heard Abdullah ibn Umar say, \"If someone lends something, let the only condition be that it is repaid",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1377
			}
		},
		{
			"hadithnumber": 1378,
			"arabicnumber": 1378,
			"text": "Malik related to me that he had heard that Abdullah ibn Masud used to say, \"If someone makes a loan, they should not stipulate better than it. Even if it is a handful of grass, it is usury.\" Malik said, \"The generally agreed on way of doing things among us is that there is no harm in borrowing any animals with a set description and itemisation, and one must return the like of them. This is not done in the case of female slaves. It is feared about that that it will lead to making halal what is not halal, so it is not good. The explanation of what is disapproved of in that, is that a man borrow a slave-girl and have intercourse with her as seems proper to him. Then he returns her to her owner. That is not good and it is not halal. The people of knowledge still forbid it and do not give an indulgence to any one in it",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1378
			}
		},
		{
			"hadithnumber": 1379,
			"arabicnumber": 1379,
			"text": "Yahya related to me from Malik from Nafi from Abdullah ibn Umar that the Messenger of Allah, may Allah bless him and grant him peace, said, \"Do not let any of you bid against each other",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1379
			}
		},
		{
			"hadithnumber": 1380,
			"arabicnumber": 1380,
			"text": "Malik related to me from Abu'z-Zinad from al-Araj from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, said, \"Do not go out to meet the caravans for trade, do not bid against each other, outbidding in order to raise the price, and a townsman must not buy on behalf of a man of the desert, and do not tie up the udders of camels and sheep so that they appear to have a lot of milk, for a person who buys them after that has two recourses open to him after he milks them. If he is pleased with them, he keeps them and if he is displeased with them, he can return them along with a sa of dates.\" Malik said, \"The explanation of the words of the Messenger of Allah, may Allah bless him and grant him peace, according to what we think - and Allah knows best - 'do not bid against each other,' is that it is forbidden for a man to offer a price over the price of his brother when the seller has inclined to the bargainer and made conditions about the weight of the gold and he has declared himself not liable for faults and such things by which it is recognised that the seller wants to make a transaction with the bargainer. This is what he forbade, and Allah knows best.\" Malik said, \"There is no harm, however, in more than one person bidding against each other over goods put up for sale.\" He said, \"Were people to leave off haggling when the first person started haggling, an unreal price might be taken and the disapproved would enter into the sale of the goods. This is still the way of doing things among us",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1380
			}
		},
		{
			"hadithnumber": 1381,
			"arabicnumber": 1381,
			"text": "Malik said, from Nafi from Abdullah ibn Umar that the Messenger of Allah, may Allah bless him and grant him peace, forbade najsh. Malik said, \"Najsh is to offer a man more than the worth of his goods when you do not mean to buy them and someone else follows you in bidding",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1381
			}
		},
		{
			"hadithnumber": 1382,
			"arabicnumber": 1382,
			"text": "Yahya related to me from Malik from Abdullah ibn Dinar from Abdullah ibn Umar that a man mentioned to the Messenger of Allah, may Allah bless him and grant him peace, that he was always being cheated in business transactions. The Messenger of Allah, may Allah bless him and grant him peace, said, \"When you enter a transaction, say, 'No trickery.' So whenever that man entered a transaction, he would say, 'No trickery",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1382
			}
		},
		{
			"hadithnumber": 1383,
			"arabicnumber": 1383,
			"text": "Malik related to me that Yahya ibn Said heard Said ibn al- Musayyab say, \"When you come to a land where they give full measure and full weight, stay there. When you come to a land where they shorten the measure and weight, then do not stay there very long",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1383
			}
		},
		{
			"hadithnumber": 1384,
			"arabicnumber": 1384,
			"text": "Malik related to me from Yahya ibn Said that he heard Muhammad ibn al-Munkadir say, \"Allah loves his slave who is generous when he sells, and generous when he buys, generous when he repays, and generous when he is repaid.\" Malik said about a man who bought camels or sheep or dry goods or slaves or any goods without measuring precisely, \"There is no buying without measuring precisely in anything which can be counted . \" Malik said about a man who gave a man goods to sell for him and set their price saying, \"If you sell them for this price as I have ordered you to do, you will have a dinar (or something which he has specified, which they are both satisfied with), if you do not sell them, you will have nothing,\" \"There is no harm in that when he names a price to sell them at and names a known fee. If he sells the goods, he takes the fee, and if he does not sell them, he has nothing.\" Malik said, \"This is like saying to another man, 'If you capture my runaway slave or bring my stray camel, you will have such-and-such.' This is from the category of reward, and not from the category of giving a wage. Had it been from the category of giving a wage, it would not be good.\" Malik said, \"As for a man who is given goods and told that if he sells them he will have a named percentage for every dinar, that is not good because whenever he is a dinar less than the price of the goods, he decreases the due which was named for him. This is an uncertain transaction. He does not know how much he will be given",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1384
			}
		},
		{
			"hadithnumber": 1385,
			"arabicnumber": 1385,
			"text": "Malik related to me that he asked Ibn Shihab about a man who hired an animal, and then re-hired it out for more than what he hired it for. He said, \"There is no harm in that",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1385
			}
		}
	]
}