{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"34": "Renting Land"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1390,
			"arabicnumber": 1390,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 1390
			}
		},
		{
			"hadithnumber": 1391,
			"arabicnumber": 1391,
			"text": "Malik related to me that Ibn Shihab said, \"I asked Said ibn al- Musayyab about renting land for gold or silver, and he said, 'There is no harm in it",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 1391
			}
		},
		{
			"hadithnumber": 1392,
			"arabicnumber": 1392,
			"text": "Malik related to me from Ibn Shihab that he asked Salim ibn 'Abdullah ibn Umar about renting out fields. He said, \"There is no harm in it for gold or silver.\" Ibn Shihab said, \"I said to him, 'What do you think of the hadith which is mentioned from Rafi ibn Khadij?'\" He said, ''Rafi has exaggerated. If I had a field, I would rent it out",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 1392
			}
		},
		{
			"hadithnumber": 1393,
			"arabicnumber": 1393,
			"text": "Malik related to me that he had heard that Abd ar-Rahman ibn Awf rented land, and he continued to have it in his possession until he died. His son said, \"I thought that it was ours because of the length of time which it had remained in his hands, until he mentioned it to us at his death. He ordered us to pay some rent which he owed in gold or silver",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 1393
			}
		},
		{
			"hadithnumber": 1394,
			"arabicnumber": 1394,
			"text": "Malik related to me from Hisham ibn Urwa that his father used to rent out his land for gold and silver. Malik was asked about a man who rented his field for 100 sa of dates or part of its produce of wheat or from other than its produce. He disapproved of that",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 1394
			}
		}
	]
}