{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"40": "The Mudabbar"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1497,
			"arabicnumber": 1497,
			"text": "Malik spoke to me about a man who wrote a kitaba for his slave for gold or silver and stipulated against him in his kitaba a journey, service, sacrifice or similar, which he specified by its name, and then the mukatab was able to pay all his instalments before the end of the term. He said, \"If he pays all his instalments and he is set free and his inviolability as a free man is complete, but he still has this condition to fulfil, the condition is examined, and whatever involves his person in it, like service or a journey etc., is removed from him and his master has nothing in it. Whatever there is of sacrifice, clothing, or anything that he must pay, that is in the position of dinars and dirhams, and is valued and he pays it along with his instalments, and he is not free until he has paid that along with his instalments.\" Malik said, \"The generally agreed-on way of doing things among us about which there is no dispute, is that a mukatab is in the same position as a slave whom his master will free after a service of ten years. If the master who will free him dies before ten years, what remains of his service goes to his heirs and his wala' goes to the one who contracted to free him and to his male children or paternal relations.\" Malik spoke about a man who stipulated against his mukatab that he could not travel, marry, or leave his land without his permission, and that if he did so without his permission it was in his power to cancel the kitaba. He said, \"If the mukatab does any of these things it is not in the man's power to cancel the kitaba. Let the master put that before the Sultan. The mukatab, however, should not marry, travel, or leave the land of his master without his permission, whether or not he stipulates that. That is because the man may write a kitaba for his slave for 100 dinars and the slave may have 1000 dinars or more than that. He goes off and marries a woman and pays her bride-price which sweeps away his money and then he cannot pay. He reverts to his master as a slave who has no property. Or else he may travel and his instalments fall due while he is away. He cannot do that and kitaba is not to be based on that. That is in the hand of his master. If he wishes, he gives him permission in that. If he wishes, he refuses it.\" Malik said, \"When a mukatab sets his own slaves free, it is only permitted for a mukatab to set his own slaves free with the consent of his master. If his master gives his consent and the mukatab sets his slave free, his wala' goes to the mukatab . If the mukatab then dies before he has been set free himself, the wala' of the freed slave goes to the master of the mukatab. If the freed one dies before the mukatab has been set free, the master of the mukatab inherits from him.\" Malik said, \"It is like that also when a mukatab gives his slave a kitaba and his mukatab is set free before he is himself. The wala' goes to the master of the mukatab as long as he is not free. If this one who wrote the kitaba is set free, then the wala' of his mukatab who was freed before him reverts to him. If the first mukatab dies before he pays, or he cannot pay his kitaba and he has free children, they do not inherit the wala' of their father's mukatab because the wala' has not been established for their father and he does not have the wala' until he is free.\" Malik spoke about a mukatab who was shared between two men and one of them forewent what the mukatab owed him and the other insisted on his due. Then the mukatab died and left property. Malik said, \"The one who did not abandon any of what he was owed, is paid in full. Then the property is divided between them both just as if a slave had died because what the first one did was not setting him free. He only abandoned a debt that was owed to him .\" Malik said, \"One clarification of that is that when a man dies and leaves a mukatab and he also leaves male and female children and one of the children frees his portion of the mukatab, that does not establish any of the wala' for him. Had it been a true setting free, the wala' would have been established for whichever men and women freed him.\" Malik said, \"Another clarification of that is that if one of them freed his portion and then the mukatab could not pay, the value of what was left of the mukatab would be altered because of the one who freed his portion. Had it been a true setting-free, his estimated value would have been taken from the property of the one who set free until he had been set completely free as the Messenger of Allah, may Allah bless him and grant him peace, said, 'Whoever frees his share in a slave and has money to cover the full price of the slave, justly evaluated for him, gives his partners their shares. If not, he frees of him what he frees.' \" (See Book 37 hadith 1). He said, \"Another clarification of that is that part of the sunna of the muslims in which there is no dispute, is that whoever frees his share of a mukatab, the mukatab is not set fully free using his property. Had he been truly set free, the wala' would have been his alone rather than his partners. Part of what will clarify that also is that part of the sunna of the muslims is that the wala' belongs to whoever writes the contract of kitaba. The women who inherit from the master of the mukatab do not have any of the wala' of the mukatab. If they free any of their share, the wala' belongs to the male children of the master of the mukatab or his male paternal relations.\" Malik said, \"If people are together in one kitaba, their master cannot free one of them without consulting his companions who are with him in the kitaba and obtaining their consent. If they are young, however, their consultation means nothing and it is not permitted to them. That is because a man might work for all the people and he might pay their kitaba for them to complete their freedom. Their master approaches the one who will pay for them and their rescue from slavery is through him. He frees him and so makes those who remain unable to pay. He does it intending benefit and increase for himself. It is not permitted for him to do that to those of them who remain. The Messenger of Allah, may Allah bless him and grant him peace, said, 'There must be no harm nor return of harm.' This is the most severe harm.\" Malik said about slaves who wrote a kitaba together that it was permitted for their master to free the old and exhausted of them and the young when neither of them could pay anything, and there was no help nor strength to be had from any of them in their kitaba. Malik said about a man who had his slave in a kitaba and then the mukatab died and left his umm walad, and there remained for him some of his kitaba to pay and he left what would pay it, \"The umm walad is a slave since the mukatab was not freed until he died and he did not leave children that were set free by his paying what remained, so that the umm walad of their father was freed by their being set free.\" Malik said about a mukatab who set free a slave of his or gave sadaqa with some of his property and his master did not know that until he had set the mukatab free, \"That has been performed by him and the master does not rescind it. If the master of the mukatab knows before he sets the mukatab free, he can reject that and not permit it. If the mukatab is then freed and it becomes in his power to do so, he does not have to free the slave, nor give the sadaqa unless he does it voluntarily from himself.\" Malik said, The best of what I have heard about a mukatab whose master frees him at death, is that the mukatab is valued according to what he would fetch if he were sold. If that value is less than what remains against him of his kitaba, his freedom is taken from the third that the deceased can bequeath. One does not look at the number of dirhams which remain against him in his kitaba. That is because had he been killed, his killer would not be in debt for other than his value on the day he killed him. Had he been injured, the one who injured him would not be liable for other than the blood-money of the injury on the day of his injury. One does not look at how much he has paid of dinars and dirhams of the contract he has written because he is a slave as long as any of his kitaba remains. If what remains in his kitaba is less than his value, only whatever of his kitaba remains owing from him is taken into account in the third of the property of the deceased. That is because the deceased left him what remains of his kitaba and so it becomes a bequest which the deceased made.\" Malik said, \"The illustration of that is that if the price of the mukatab is one thousand dirhams, and only one hundred dirhams remain of his kitaba, his master leaves him the one hundred dirhams which complete it for him. It is taken into account in the third of his master and by it he becomes free.\" Malik said that if a man wrote his slave a kitaba at his death, the value of the slave was estimated. If there was enough to cover the price of the slave in one third of his property, that was permitted for him. Malik said, \"The illustration of that is that the price of the slave is one thousand dinars. His master writes him a kitaba for two hundred dinars at his death. The third of the property of his master is one thousand dinars, so that is permitted for him. It is only a bequest which he makes from one third of his property. If the master has left bequests to people, and there is no surplus in the third after the value of the mukatab, one begins with the mukatab because the kitaba is setting free, and setting free has priority over bequests. When those bequests are paid from the kitaba of the mukatab, they follow it. The heirs of the testator have a choice. If they want to give the people with bequests all their bequests and the kitaba of the mukatab is theirs, they have that. If they refuse and hand over the mukatab and what he owes to the people with bequests they can do that, because the third commences with the mukatab and because all the bequests which he makes are as one.\" If the heirs then say, \"What our fellow bequeathed was more than one third of his property and he has taken what was not his,\" Malik said, \"His heirs choose. It is said to them, 'Your companion has made the bequests you know about and if you would like to give them to those who are to receive them according to the deceased's bequests, then do so. If not, hand over to the people with bequests one third of the total property of the deceased.' \" Malik continued, \"If the heirs surrender the mukatab to the people with bequests, the people with bequests have what he owes of his kitaba. If the mukatab pays what he owes of his kitaba, they take that in their bequests according to their shares. If the mukatab cannot pay, he is a slave of the people with bequests and does not return to the heirs because they gave him up when they made their choice, and because when he was surrendered to the people with bequests, they were liable. If he died, they would not have anything against the heirs. If the mukatab dies before he pays his kitaba and he leaves property which is more than what he owes, his property goes to the people with bequests. If the mukatab pays what he owes, he is free and his wala' returns to the paternal relations of the one who wrote the kitaba for him.\" Malik spoke about a mukatab who owed his master ten thousand dirhams in his kitaba, and when he died he remitted one thousand dirhams from it. He said, \"The mukatab is valued and his value is taken into consideration. If his value is one thousand dirhams and the reduction is a tenth of the kitaba, that portion of the slave's price is one hundred dirhams. It is a tenth of the price. A tenth of the kitaba is therefore reduced for him. That is converted to a tenth of the price in cash. That is as if he had had all of what he owed reduced for him. Had he done that, only the value of the slave - one thousand dirhams - would have been taken into account in the third of the property of the deceased. If that which he had remitted is half of the kitaba, half the price is taken into account in the third of the property of the deceased. If it is more or less than that, it is according to this reckoning.\" Malik said, \"When a man reduces the kitaba of his mukatab by one thousand dirhams at his death from a kitaba of ten thousand dirhams, and he does not stipulate whether it is from the beginning or the end of his kitaba, each instalment is reduced for him by one tenth.\" Malik said, \"If a man remits one thousand dirhams from his mukatab at his death from the beginning or end of his kitaba, and the original basis of the kitaba is three thousand dirhams, the mukatab's cash value is estimated. Then that value is divided. That thousand which is from the beginning of the kitaba is converted into its portion of the price according to its proximity to the term and its precedence and then the thousand which follows the first thousand is according to its precedence also until it comes to its end, and every thousand is paid according to its place in advancing and deferring the term because what is deferred of that is less in respect of its price. Then it is placed in the third of the deceased according to whatever of the price befalls that thousand according to the difference in preference of that, whether it is more or less, then it is according to this reckoning.\" Malik spoke about a man who willed a man a fourth of a mukatab or freed a fourth, and then the man died and the mukatab died and left a lot of property, more than he owed. He said, \"The heirs of the first master and the one who was willed a fourth of the mukatab are given what they are still owed by the mukatab. Then they divide what is left over, and the one willed a fourth has a third of what is left after the kitaba is paid. The heirs of his master gets two-thirds. That is because the mukatab is a slave as long as any of his kitaba remains to be paid. He is inherited from by the possession of his person.\" Malik said about a mukatab whose master freed him at death, \"If the third of the deceased will not cover him, he is freed from it according to what the third will cover and his kitaba is decreased according to that. If the mukatab owed five thousand dirhams and his value is two thousand dirhams cash, and the third of the deceased is one thousand dirhams, half of him is freed and half of the kitaba has been reduced for him.\" Malik said about a man who said in his will, \"My slave so-and-so is free and write a kitaba for so-and- so\", that the setting free had priority over the kitaba. Yahya related to me that Malik said, \"What is done in our community in the case of a man who makes his slave-girl a mudabbara and she gives birth to children after that, and then the slave-girl dies before the one who gave her a tadbir is that her children are in her position. The conditions which were confirmed for her are confirmed for them. The death of their mother does not harm them. If the one who made her mudabbara dies, they are free if their value is less than one third of his total property.\" Malik said, \"For every mother by birth as opposed to mother by suckling, her children are in her position. If she is free and she gives birth after she is free, her children are free. If she is a mudabbara or mukataba, or freed after a number of years in service, or part of her is free or pledged or she is an umm walad, each of her children are in the same position as their mother. They are set free when she is set free and they are slaves when she is a slave.\" Malik said about the mudabbara given a tadbir while she was pregnant, \"Her children are in her position. That is also the position of a man who frees his slave- girl while she is pregnant and does not know that she is pregnant.\" Malik said, \"The sunna about such women is that their children follow them and are set free by their being set free.\" Malik said, \"It is the same as if a man had bought a slave-girl while she was pregnant. The slave-girl and what is in her womb belong to the one who bought her whether or not the buyer stipulates that.\" Malik continued, \"It is not halal for the seller to make an exception about what is in her womb because that is an uncertain transaction. It reduces her price and he does not know if that will reach him or not. That is as if one sold the foetus in the womb of the mother. That is not halal because it is an uncertain transaction .\" Malik said about the mukatab or mudabbar who bought a slave- girl and had intercourse with her and she became pregnant by him and gives birth, \"The children of both of them by a slave-girl are in his position. They are set free when he is set free and they are slaves when he is a slave.\" Malik said, \"When he is set free, the umm walad is part of his property which is surrendered to him when he is set free.\" Malik spoke about a mudabbar who said to his master, \"Free me immediately and I will give fifty dinars which I will have to pay in instalments.\" His master said, \"Yes. You are free and you must pay fifty dinars, and you will pay me ten dinars every year.\" The slave was satisfied with this. Then the master dies one, two or three days after that. He said, \"The freeing is confirmed and the fifty dinars become a debt against him. His testimony is permitted, his inviolability as a free man is confirmed, as are his inheritance and his liability to the full hudud punishments. The death of his master, however, does not reduce the debt for him at all.\" Malik said that if a man who made his slave a mudabbar died and he had some property at hand and some absent property, and in the property at hand there was not enough (in the third he was allowed to bequeath) to cover the value of the mudabbar, the mudabbar was kept there together with this property, and his tax (kharaj) was gathered until the master's absent property was clear. Then if a third of what his master left would cover his value, he was freed with his property and what had gathered of his tax. If there was not enough to cover his value in what his master had left, as much of him was freed as the third would allow, and his property was left in his hands. Malik said, \"The generally agreed-on way of doing things in our community is that any setting-free which a man makes in a bequest that he wills in health or illness can be rescinded by him when he likes and changed when he likes as long as it is not a tadbir. There is no way to rescind a tadbir once he has made it. \"As for every child born to him by a slave-girl who he wills to be set free but he does not make mudabbara, her children are not freed with her when she is freed. That is because her master can change his will when he likes and rescind it when he likes, and being set free is not confirmed for her. She is in the position of a slave-girl whose master says, 'If so- and-so remains with me until I die, she is free.' \" (i.e. he does not make a definite contract.) Malik said, \"If she fulfils that, that is hers. If he wishes, before that, he can sell her and her child because he has not entered her child into any condition he has made for her. \"The bequest in setting free is different from the tadbir. The precedent of the sunna makes a distinction between them. Had a bequest been in the position of a tadbir, no testator would be able to change his will and what he mentioned in it of setting free. His property would be tied up and he would not be able to use it.\" Malik said about a man who made all his slaves mudabbar while he was well and they were his only property, \"If he made some of them mudabbar before the others, one begins with the first until the third of his property is reached. (i.e. their value is matched against the third, and those whose value is covered are free.) If he makes the mall mudabbar in his illness, and says in one statement, 'So-and-so is free. So-and-so is free. So-and-so is free if my death occurs in this illness,' or he makes them all mudabbar in one statement, they are matched against the third and one does not begin with any of them before the others. It is a bequest and they have a third of his property divided between them in shares. Then the third of his property frees each of them according to the extent of his share. \"No single one of them is given preference when that all occurs in his illness.\" Malik spoke about a master who made his slave a mudabbar and then he died and the only property he had was the mudabbar slave and the slave had property. He said, \"A third of the mudabbar is freed and his property remains in his possession.\" Malik said about a mudabbar whose master gave him a kitaba and then the master died and did not leave any property other than him, \"A third of him is freed and a third of his kitaba is reduced, and he owes two-thirds.\" Malik spoke about a man who freed half of his slave while he was ill and made irrevocable his freeing half of him or all of him, and he had made another slave of his mudabbar before that. He said, \"One begins with the slave he made mudabbar before the one he freed while he was ill. That is because the man cannot revoke what he has made mudabbar and cannot follow it with a matter which will rescind it. When this mudabbar is freed, then what remains of the third goes to the one who had half of him freed so as to complete his setting-free entirely in the third of the property of the deceased. If what is left of the third does not cover that, whatever is covered by what is left of the third is freed after the first mudabbar is freed . \" Malik related to me from Nafi that Abdullah ibn Umar made two of his slave-girls mudabbara, and he had intercourse with them while they were mudabbara",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 1497
			}
		},
		{
			"hadithnumber": 1498,
			"arabicnumber": 1498,
			"text": "Malik related to me from Yahya ibn Said that Said ibn al-Musayyab used to say, \"When a man makes his slave-girl mudabbara, he can have intercourse with her. He cannot sell her or give her away and her children are in the same position as her",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 1498
			}
		},
		{
			"hadithnumber": 1499,
			"arabicnumber": 1499,
			"text": "Malik said, \"The generally agreed on way of doing things in our community about a mudabbar is that the owner cannot sell him or change the position in which he has put him. If a debt overtakes the master, his creditors cannot sell the mudabbar as long as the master is alive. If the master dies and has no debts, the mudabbar is included in the third (of the bequest) because he expected his work from him as long as he lived. He cannot serve him all his life, and then he frees him from his heirs out of the main portion of his property when he dies. If the master of the mudabbar dies and has no property other than him, one third of him is freed, and two thirds of him belong to the heirs. If the master of the mudabbar dies and owes a debt which encompasses the mudabbar, he is sold to meet the debt because he can only be freed in the third (which is allowed for bequest) .\" He said, \"If the debt only includes half of the slave, half of him is sold for the debt. Then a third of what remains after the debt is freed. \" Malik said, \"It is not permitted to sell a mudabbar and it is not permitted for anyone to buy him unless the mudabbar buys himself from his master. He is permitted to do that. Or else some one gives the master of the mudabbar money and his master who made him a mudabbar frees him. That is also permitted for him.\" Malik said, \"His wala' belongs to his master who made him a mudabbar.\" Malik said, \"It is not permitted to sell the service of a mudabbar because it is an uncertain transaction since one does not know how long his master will live. That is uncertain and it is not good.\" Malik spoke about a slave who was shared between two men, and one of them made his portion mudabbar. He said, \"They estimate his value between them. If the one who made him mudabbar buys him, he is all mudabbar. If he does not buy him, his tadbir is revoked unless the one who retains ownership of him wishes to give his partner who made him mudabbar his value. If he gives him to him for his value, that is binding, and he is all mudabbar.\" Malik spoke about the christian man who made a christian slave of his mudabbar and then the slave became muslim. He said, \"One separates the master and the slave, and the slave is removed from his christian master and is not sold until his situation becomes clear. If the christian dies and has a debt, his debt is paid from the price of the slave unless he has in his estate what will pay the debt. Then the mudabbar is set free.\" Malik related to me that he heard that Umar ibn Abd al-Aziz gave a judgement about the mudabbar who did an injury. He said, \"The master must surrender what he owns of him to the injured person. He is made to serve the injured person and recompense (in the form of service) is taken from him as the blood-money of the injury. If he completes that before his master dies, he reverts to his master.\" Malik said, \"The generally agreed on way of doing things in our community about a mudabbar who does an injury and then his master dies and the master has no property except him is that the third (allowed to be bequeathed) is freed, and then the blood-money for the in jury is divided into thirds. A third of the blood-money is against the third of him which was set free, and two-thirds are against the two-thirds which the heirs have. If they wish, they surrender what they have of him to the party with the injury, and if they wish, they give the injured person two-thirds of the blood-money and keep their portion of the slave. That is because that injury is a criminal action by the slave and it is not a debt against the master by which whatever setting free and tadbir the master had done would be abrogated. If there were a debt to people held against the master of the slave, as well as the criminal action of the slave, part of the mudabbar would be sold in proportion to the blood-money of the injury and according to the debt. Then one would begin with the blood-money which was for the criminal action of the slave and it would be paid from the price of the slave. Then the debt of his master would be paid, and then one would look at what remained after that of the slave. His third would b be set free, and two-thirds of him would belong to the heirs. That is because the criminal action of the slave is more important than the debt of his master. That is because, if the man dies and leaves a mudabbar slave whose value is one hundred and fifty dinars, and the slave strikes a free man on the head with a blow that lays open the skull, and the blood-money is fifty dinars, and the master of the slave has a debt of fifty dinars, one begins with the fifty dinars which are the blood-money of the head wound, and it is paid from the price of the slave. Then the debt of the master is paid. Then one looks at what remains of the slave, and a third of him is set free and two-thirds of him remain for the heirs. The blood-money is more pressing against his person than the debt of his master. The debt of his master is more pressing than the tadbir which is a bequest from the third of the property of the deceased. None of the tadbir is permitted while the master of the mudabbar has a debt which is not paid. It is a bequest. That is because Allah, the Blessed, the Exalted, said, 'After any bequest that is made or any debt.' \" (Sura 4 ayat 10) Malik said, \"If there is enough in the third property that the deceased can bequeath to free all the mudabbar, he is freed and the blood-money due from his criminal action is held as a debt against him which follows him after he is set free even if that blood-money is the full blood-money. It is not a debt on the master.\" Malik spoke about a mudabbar who injured a man and his master surrendered him to the injured party, and then the master died and had a debt and did not leave any property other than the mudabbar, and the heirs said, \"We surrender the mudabbar to the party,\" whilst the creditor said, \"My debt exceeds that.\" Malik said that if the creditor's debt did exceed that at all , he was more entitled to it and it was taken from the one who owed the debt, according to what the creditor was owed in excess of the blood-money of the injury. If his debt did not exceed it at all, he did not take the slave. Malik spoke about a mudabbar who did an injury and had property, and his master refused to ransom him. He said, \"The injured party takes the property of the mudabbar for the blood-money of his injury. If there is enough to pay it, the injured party is paid in full for the blood-money of his injury and the mudabbar is returned to his master. If there is not enough to pay it, he takes it from the blood-money and uses the mudabbar for what remains of the blood-money",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 1499
			}
		}
	]
}