{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"41": "Hudud"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1500,
			"arabicnumber": 1500,
			"text": "Malik said in the case of an umm walad who injured someone, \"The blood-money of that injury is the responsibility of her master from his property, unless the blood-money of the injury is greater than the value of the umm walad. Her master does not have to pay more than her value. That is because when the master of a slave or slave-girl surrenders his slave or slave-girl for an injury which one of them has done, he does not owe any more than that, even if the blood-money is greater. As the master of the umm walad cannot surrender her because of the precedent of the sunna, when he pays her price, it is as if he had surrendered her. He does not have to pay more than that. This is the best of what I have heard about the matter. The master is not obliged to assume responsibility for more than an umm walad's value because of her criminal action.\" Malik related to me from Nafi that Abdullah ibn Umar said, \"The Jews came to the Messenger of Allah, may Allah bless him and grant him peace, and mentioned to him that a man and woman from among them had committed adultery. The Messenger of Allah, may Allah bless him and grant him peace, asked them, 'What do you find in the Torah about stoning?' They said, 'We make their wrong action known and flog them.' Abdullah ibn Salam said, 'You have lied! It has stoning for it, so bring the Torah.' They spread it out and one of them placed his hand over the ayat of stoning. Then he read what was before it and what was after it. Abdullah ibn Salam told him to lift his hand. He lifted his hand and there was the ayat of stoning. They said, 'He has spoken the truth, Muhammad. The ayat of stoning is in it.' So the Messenger of Allah, may Allah bless him and grant him peace, gave the order and they were stoned . \" Abdullah ibn Umar added, \"I saw the man leaning over the woman to protect her from the stones.\" Malik commented, \"By leaning he meant throwing himself over her so that the stones fell on him",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1500
			}
		},
		{
			"hadithnumber": 1501,
			"arabicnumber": 1501,
			"text": "Malik related to me from Yahya ibn Said from Said ibn al-Musayyab that a man from the Aslam tribe came to Abu Bakr as-Siddiq and said to him, \"I have committed adultery.\" Abu Bakr said to him, \"Have you mentioned this to anyone else?\" He said, \"No.\" Abu Bakr said to him, \"Then cover it up with the veil of Allah. Allah accepts tawba from his slaves.\" His self was still unsettled, so he went to Umar ibn al- Khattab. He told him the same as he had said to Abu Bakr, and Umar told him the same as Abu Bakr had said to him. His self was still not settled so he went to the Messenger of Allah, may Allah bless him and grant him peace, and said to him, \"I have committed adultery,\" insistently. The Messenger of Allah, may Allah bless him and grant him peace, turned away from him three times. Each time the Messenger of Allah, may Allah bless him and grant him peace, turned away from him until it became too much. The Messenger of Allah, may Allah bless him and grant him peace, questioned his family, \"Does he have an illness which affects his mind, or is he mad?\" They said, \"Messenger of Allah, by Allah, he is well.\" The Messenger of Allah, may Allah bless him and grant him peace, said, \"Unmarried or married?\" They said, \"Married, Messenger of Allah.\" The Messenger of Allah, may Allah bless him and grant him peace, gave the order and he was stoned",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1501
			}
		},
		{
			"hadithnumber": 1502,
			"arabicnumber": 1502,
			"text": "Malik related to me from Yahya ibn Said that Said ibn al-Musayyab said, \"I have heard that the Messenger of Allah, may Allah bless him and grant him peace, said to a man from the Aslam tribe called Hazzal, 'Hazzal, had you veiled him with your cloak, it would have been better for you.' \" Yahya ibn Said said, \"I related this hadith in an assembly among whom was Yazid ibn Nuaym ibn Hazzal al-Aslami. Yazid said, 'Hazzal was my grandfather. This hadith is true",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1502
			}
		},
		{
			"hadithnumber": 1503,
			"arabicnumber": 1503,
			"text": "Malik related to me that Ibn Shihab informed him that a man confessed that he had committed adultery in the time of the Messenger of Allah, may Allah bless him and grant him peace, and he testified against himself four times, so the Messenger of Allah, may Allah bless him and grant him peace, gave the order and he was stoned. Ibn Shihab said, \"Because of this a man is to be taken for his own confession against himself",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1503
			}
		},
		{
			"hadithnumber": 1504,
			"arabicnumber": 1504,
			"text": "Malik related to me from Yaqub ibn Zayd ibn Talha from his father Zayd ibn Talha that Abdullah ibn Abi Mulayka informed him that a woman came to the Messenger of Allah, may Allah bless him and grant him peace, and informed him that she had committed adultery and was pregnant. The Messenger of Allah, may Allah bless him and grant him peace, said to her, \"Go away until you give birth.\" When she had given birth, she came to him. The Messenger of Allah, may Allah bless him and grant him peace, said to her, \"Go away until you have suckled and weaned the baby.\" When she had weaned the baby, she came to him. He said, \"Go and entrust the baby to someone.\" She entrusted the baby to someone and then came to him. He gave the order and she was stoned",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1504
			}
		},
		{
			"hadithnumber": 1505,
			"arabicnumber": 1505,
			"text": "Malik related to me from Ibn Shihab from Ubaydullah ibn Abdullah ibn Utba ibn Masud that Abu Hurayra and Zayd ibn Khalid al-Juhani informed him that two men brought a dispute to the Messenger of Allah, may Allah bless him and grant him peace. One of them said, \"Messenger of Allah! Judge between us by the Book of Allah!\" The other said, and he was the wiser of the two, \"Yes, Messenger of Allah. Judge between us by the Book of Allah and give me permission to speak.\" He said, \"Speak.\" He said, \"My son was hired by this person and he committed fornication with his wife. He told me that my son deserved stoning, and I ransomed him for one hundred sheep and a slave-girl. Then I asked the people of knowledge and they told me that my son deserved to be flogged with one hundred lashes and exiled for a year, and they informed me that the woman deserved to be stoned.\" The Messenger of Allah, may Allah bless him and grant him peace, said, \"By him in whose Hand myself is, I will judge between you by the Book of Allah. As for your sheep and slave girl, they should be returned to you. Your son should have one hundred lashes and be exiled for a year.\" He ordered Unays al-Aslami to go to the wife of the other man and to stone her if she confessed . She confessed and he stoned her",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1505
			}
		},
		{
			"hadithnumber": 1506,
			"arabicnumber": 1506,
			"text": "Malik related to me from Suhayl ibn Abi Salih from his father from Abu Hurayra that Sad ibn Ubada said to the Messenger of Allah, may Allah bless him and grant him peace, \"What do you think I should do if I were to find a man with my wife? Should I leave him there until I had brought four witnesses?\" The Messenger of Allah, may Allah bless him and grant him peace, said, \"Yes",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1506
			}
		},
		{
			"hadithnumber": 1507,
			"arabicnumber": 1507,
			"text": "Malik related to me from Ibn Shihab from Ubaydullah ibn Abdullah ibn Utba ibn Masud that Abdullah ibn Abbas said, \"I heard Umar ibn al- Khattab say, 'Stoning is in the Book of Allah for those who commit adultery, men or women when they are muhsan and when there is clear proof of pregnancy or a confession",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1507
			}
		},
		{
			"hadithnumber": 1508,
			"arabicnumber": 1508,
			"text": "Malik related to me from Yahya ibn Said from Sulayman ibn Yasar from Abu Waqid al-Laythi that a man came to Umar ibn al-Khattab while he was in ash-Sham . He mentioned to him that he had found a man with his wife Umar sent Abu Waqid al-Laythi to the wife to question her about that. He came to her while there were women around her and mentioned to her what her husband had mentioned to Umar ibn al- Khattab, and informed her that she would not be punished on his word and began to suggest to her by that, that she should retract. She refused to retract and held firm to confession. Umar gave the order and she was stoned",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1508
			}
		},
		{
			"hadithnumber": 1509,
			"arabicnumber": 1509,
			"text": "Malik related to me that Yahya ibn Said heard Said ibn al- Musayyab say, \"When Umar ibn al-Khattab came from Mina, he made his camel kneel at al-Abtah, and then he gathered a pile of small stones and cast his cloak over them and dropped to the ground. Then he raised his hands to the sky and said, 'O Allah! I have become old and my strength has weakened. My flock is scattered. Take me to You with nothing missed out and without having neglected anything.' Then he went to Madina and addressed the people. He said, 'People! Sunan have been laid down for you. Obligations have been placed upon you. You have been left with a clear way unless you lead people astray right and left.' He struck one of his hands on the other and then said, 'Take care lest you destroy the ayat of stoning so that one will say, \"We do not find two hadds in the Book of Allah.\" The Messenger of Allah, may Allah bless him and grant him peace, stoned, so we have stoned. By He in Whose Hand my self is, had it not been that people would say that Umar ibn al-Khattab has added to the Book of Allah ta- ala, we would have written it, \"The full-grown man and the full-grown woman, stone them absolutely.\" We have certainly recited that.'\" Malik said, \"Yahya ibn Said said Said ibn al-Musayyab said, 'Dhu'l-Hijja had not passed before Umar was murdered, may Allah have mercy on him.' \" Yahya said that he had heard Malik say, \"As for his words 'The full-grown man and the full-grown woman' he meant, 'The man and the woman who have been married, stone them absolutely",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1509
			}
		},
		{
			"hadithnumber": 1510,
			"arabicnumber": 1510,
			"text": "Malik related to me that he had heard that Uthman ibn Affan was brought a woman who had given birth after six months and he ordered her to be stoned. Ali ibn Abi Talib said to him, \"She does not deserve that. Allah, the Blessed, the Exalted, says in His Book, 'Their carrying and weaning is thirty months,' (Sura 46 ayat 15) and he said, 'Mothers suckle their children for two full years for whoever wishes to complete the suckling.' (Sura 2 ayat 233) Pregnancy can then be six months, so she does not deserve to be stoned.\" Uthman ibn Affan sent for her and found that she had already been stoned. Malik related to me that he asked Ibn Shihab about someone who committed sodomy. Ibn Shihab said, \"He is to be stoned, whether or not he is muhsan",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1510
			}
		},
		{
			"hadithnumber": 1511,
			"arabicnumber": 1511,
			"text": "Malik related to me from Zayd ibn Aslam that a man confessed to fornication in the time of the Messenger of Allah, may Allah bless him and grant him peace. The Messenger of Allah, may Allah bless him and grant him peace, called for a whip, and he was brought a broken whip. He said, \"Above this,\" and he was brought a new whip whose knots had not been cut yet. He said, \"Below this,\" and he was brought a whip which had been used and made flexible. The Messenger of Allah, may Allah bless him and grant him peace, gave the order and he was flogged. Then he said, \"People! The time has come for you to observe the limits of Allah. Whoever has had any of these ugly things befall him should cover them up with the veil of Allah. Whoever reveals to us his wrong action, we perform what is in the Book of Allah against him",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1511
			}
		},
		{
			"hadithnumber": 1512,
			"arabicnumber": 1512,
			"text": "Malik related to me from Nafi that Safiyya bint Abi Ubayd informed him that a man who had had intercourse with a virgin slave- girl and made her pregnant was brought to Abu Bakr as-Siddiq. He confessed to fornication, and he was not muhsan. Abu Bakr gave the order and he was flogged with the hadd punishment. Then he was banished to Fadak, (thirty miles from Madina). Malik spoke about a person who confessed to fornication and then retracted it and said, \"I didn't do it. I said that for such-and-such a reason,\" and he mentioned the reason. Malik said, \"That is accepted from him and the hadd is not imposed on him. That is because the hadd is what is for Allah, and it is only applied by one of two means, either by a clear proof which establishes guilt or by a confession which is persisted in so that the hadd is imposed. If someone persists in his confession, the hadd is imposed on him.\" Malik said, \"I have not seen the people of knowledge exiling slaves who have committed adultery",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1512
			}
		},
		{
			"hadithnumber": 1513,
			"arabicnumber": 1513,
			"text": "Malik related to me from Ibn Shihab from Ubaydullah ibn Abdullah ibn Utba ibn Masud from Abu Hurayra and Zayd ibn Khalid al-Juhani that the Messenger of Allah, may Allah bless him and grant him peace, was asked about a slave-girl who committed fornication and was not muhsana. He said, \"If she commits fornication, then flog her. If she commits fornication again, then flog her, and if she commits fornication again, then sell her, if only for a rope.\" Ibn Shihab added, \"I don't know whether it was three or four times",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1513
			}
		},
		{
			"hadithnumber": 1514,
			"arabicnumber": 1514,
			"text": "Malik related to me from Nafi that a slave was in charge of the slaves in the khumus and he forced a slave-girl among those slaves against her will and had intercourse with her. Umar ibn al-Khattab had him flogged and banished him, and he did not flog the slave-girl because the slave had forced her",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1514
			}
		},
		{
			"hadithnumber": 1515,
			"arabicnumber": 1515,
			"text": "Malik related to me from Yahya ibn Said that Sulayman ibn Yasar informed him that Abdullah ibn Abbas ibn Abi Rabia al-Makhzumi said, \"Umar ibn al-Khattab gave me orders about the slaves of Quraysh and we flogged some of the slave-girls of the muslim lands fifty times each for fornication",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1515
			}
		},
		{
			"hadithnumber": 1516,
			"arabicnumber": 1516,
			"text": "Malik said, \"The position with us about a woman who is found to be pregnant and has no husband and she says, 'I was forced,' or she says, 'I was married,' is that it is not accepted from her and the hadd is inflicted on her unless she has a clear proof of what she claims about the marriage or that she was forced or she comes bleeding if she was a virgin or she calls out for help so that someone comes to her and she is in that state or what resembles it of the situation in which the violation occurred.\" He said, \"If she does not produce any of those, the hadd is inflicted on her and what she claims of that is not accepted from her.\" Malik said, \"A raped woman cannot marry until she has restored herself by three menstrual periods.\" He said, \"If she doubts her periods, she does not marry until she has freed herself of that doubt.\" Malik related to me from Abu'z-Zinad that he said, ''Umar ibn Abd al-Aziz flogged a slave with eighty lashes for slander.\" Abu'z-Zinad said, \"I asked Abdullah ibn Amir ibn Rabia about that. He said, 'I saw Umar ibn al-Khattab, Uthman ibn Affan, the Khalifs, and so on, and I did not see any of them flog a slave more than forty lashes for slander",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1516
			}
		},
		{
			"hadithnumber": 1517,
			"arabicnumber": 1517,
			"text": "Malik related to me from Zurayq ibn Hakim al-Ayli that a man called Misbah asked his son for help and he thought him unnecessarily slow. When the son came, his father said to him, \"O fornicator.\" Zurayq said, \"So the son asked me to help him against the father. When I wanted to flog him, his son said, 'By Allah, if you flog him, I will acknowledge that I have committed fornication.' When he said that, the situation was confused for me, so I wrote about it to Umar ibn Abd al- Aziz who was the governor at that time, and I mentioned it to him. Umar wrote me to permit his pardon.\" Zurayq said, \"I wrote to Umar ibn Abd al-Aziz also, 'What do you think about a man who is slandered or his parents are slandered and both or only one of them are dead?' He said, Umar wrote to me, 'If he forgives, his pardon is permitted for himself. If his parents are slandered and one or both of them are dead, take the judgement of the Book of Allah for it unless he wants to veil it.' \" Yahya said, \"I heard Malik say, 'That is because the slandered man might fear that if that is unveiled about him, a clear proof might be established. If it is according to what we have described, his pardon is permitted",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1517
			}
		},
		{
			"hadithnumber": 1518,
			"arabicnumber": 1518,
			"text": "Malik related to me from Hisham ibn Urwa that his father said that there was only one hadd against a man who slandered a group of people. Malik said, \"If they are on separate occasions there is still only one hadd against him.\" Malik related to me from Abu'r-Rijal Muhammad ibn Abd ar-Rahman ibn Haritha ibn an-Numan al- Ansari, then from the Banu'n-Najar from his mother Amra bint Abd ar- Rahman that two men cursed each other in the time of Umar ibn al- Khattab. One of them said to the other, \" By Allah, my father is not an adulterer and my mother is not an adulteress.\" Umar ibn al-Khattab asked advice about that. One person said, \"He has praised his father and mother.\" Another said, \"His father and mother have praise other than this. We think that he is to be flogged with the hadd.\" So Umar flogged him with the hadd of eighty lashes. Malik said, \"There is no hadd in our view except for slander, denial or insinuation, in which one sees that the speaker intends by that denial or slander. Then the hadd is completely imposed on the one who said it.\" Malik said, \"What is done in our community when a man denies that another man is from his father, is that he deserves the hadd. If the mother who is denied is a slave, then he deserves the hadd as well",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1518
			}
		},
		{
			"hadithnumber": 1520,
			"arabicnumber": 1520,
			"text": "Malik said, \"The best of what is heard about a slave-girl whom a man has intercourse with while he has a partner in her is that the hadd is not inflicted on him and the child is connected to him. When the slave-girl becomes pregnant, her value is estimated and he gives his partners their shares of the price and the slave-girl is his. That is what is done among us.\" Malik said about a man who made his slave-girl halal to a man that if the one for whom she was made halal had intercourse with her, her value was estimated on the day he had intercourse with her and he owed that to her owner whether or not she conceived. The hadd was averted from him by that. If she conceived the child was connected to him. Malik said about a man who had intercourse with his son's or daughter's slave-girl, \"The hadd is averted from him and he owes the estimated value of the slave-girl whether or not she conceives.\" Malik related to me from Rabia ibn Abi Abd ar-Rahman that Umar ibn al-Khattab spoke about a man who went out with his wife's slave- girl on a journey and had intercourse with her and then the wife became jealous and mentioned that to Umar ibn al-Khattab. Umar questioned him about it. He said, \"She gave her to me.\" Umar said, \"Bring me a clear proof or I will stone you.\" Rabia added, \"The wife confessed that she had given her to him",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1520
			}
		},
		{
			"hadithnumber": 1521,
			"arabicnumber": 1521,
			"text": "Malik related to me from Nafi from Abdullah ibn Umar that the Messenger of Allah, may Allah bless him and grant him peace, cut off the hand of a man who stole a shield whose price was three dirhams",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1521
			}
		},
		{
			"hadithnumber": 1522,
			"arabicnumber": 1522,
			"text": "Yahya related to me from Malik from Abdullah ibn Abd ar-Rahman abu Husayn al-Makki that the Messenger of Allah, may Allah bless him and grant him peace, said, \"The hand is not cut off for fruit hanging on the tree and for sheep kept in the mountains. So when they are taken from the fold or the place where the fruit is dried, a hand is cut off for whatever reaches the price of a shield",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1522
			}
		},
		{
			"hadithnumber": 1523,
			"arabicnumber": 1523,
			"text": "Yahya related to me from Malik from Abdullah ibn Abi Bakr from his father from Amra bint Abd ar-Rahman that a thief stole a citron in the time of Uthman Uthman ibn Affan ordered its value to be estimated and it was estimated at three dirhams at the rate of exchange of twelve dirhams for the dinar, so Uthman cut off his hand",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1523
			}
		},
		{
			"hadithnumber": 1524,
			"arabicnumber": 1524,
			"text": "Yahya related to me from Malik from Yahya ibn Said from Amra bint Abd ar-Rahman that A'isha, the wife of the Prophet, may Allah bless him and grant him peace, said, \"It has not been a long time for me and I have not forgotten. A thief's hand is cut off for a quarter of a dinar and upwards",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1524
			}
		},
		{
			"hadithnumber": 1525,
			"arabicnumber": 1525,
			"text": "Yahya related to me from Malik from Abdullah ibn Abi Bakr ibn Hazim that Amra bint Abd ar-Rahman said, \"A'isha, the wife of the Prophet, may Allah bless him and grant him peace, went out to Makka and she had two girl mawlas of hers and a slave belonging to the sons of Abdullah ibn Abi Bakr as-Siddiq . She sent a figured cloak with the two mawlas which was sewn up in a piece of green cloth.\" Amra continued, \"The slave took it and unstitched it and took out the cloak. In its place, he put some felt or skin and sewed it up again. When the mawla girls came to Madina, they gave it to his people. When they opened it, they found felt in it and did not find the cloak. They spoke to the two women and they spoke to A'isha, the wife of the Prophet, may Allah bless him and grant him peace, or they wrote to her and suspected the slave. The slave was asked about it and confessed. A'isha, the wife of the Prophet, may Allah bless him and grant him peace, gave the order and his hand was cut off. A'isha said, 'A thief's hand is cut off for a quarter of a dinar and upwards.' \" Malik said, \"The limit I prefer above which cutting off the hand is obliged is three dirhams, whether the exchange is high or low. That is because the Messenger of Allah, may Allah bless him and grant him peace, cut off the hand of a thief for a shield whose value was three dirhams, and Uthman ibn Affan cut off the hand of a thief for a citron which was estimated at three dirhams. This is what I prefer of what I have heard on the matter",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1525
			}
		},
		{
			"hadithnumber": 1526,
			"arabicnumber": 1526,
			"text": "Yahya related to me from Malik from Nafi that a slave of Abdullah ibn Umar stole while he was a runaway. Abdullah ibn Umar sent him to Said ibn al-As, who was the amir of Madina, to cut off his hand. Said refused to cut off his hand. He said, \"The hand of a runaway slave is not cut off when he steals.\" Abdullah ibn Umar said to him, \"In what Book of Allah did you find this?\" Then Abdullah ibn Umar gave the order, and his hand was cut off",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1526
			}
		},
		{
			"hadithnumber": 1527,
			"arabicnumber": 1527,
			"text": "Yahya related to me from Malik that Zurayq ibn Hakim informed him that he had a runaway slave who had stolen. He said, \"The situation was obscure for me, so I wrote to Umar ibn Abd al-Aziz to ask him about it. He was the governor at that time. I informed him that I had heard that if a runaway slave stole while he was a fugitive, his hand was not cut off. 'Umar ibn Abd al-Aziz wrote to contradict my letter, 'You wrote to me that you have heard that when the runaway slave steals, his hand is not cut off. Allah, the Blessed, the Exalted, says in His Book, 'The thief, male and female, cut off the hands of both, as a recompense for what they have earned, and an exemplary punishment from Allah. Allah is Mighty, Wise.' (Sura 5 ayat 41) When his theft reaches a quarter of a dinar, and upwards, his hand is cut off.' \" Yahya related to me from Malik that he had heard that al- Qasim ibn Muhammad and Salim ibn Abdullah and Urwa ibn az-Zubayr said, \"When a runaway slave steals something for which cutting off the hand is obliged, his hand is cut off.\" Malik said, \"The way of doing things amongst us about which there is no dispute is that when the runaway slave steals that for which cutting off the hand is obliged, his hand is cut off",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1527
			}
		},
		{
			"hadithnumber": 1529,
			"arabicnumber": 1529,
			"text": "Yahya related to me from Malik from Ibn Shihab from Safwan ibn Abdullah ibn Safwan that it was said to Safwan ibn Umayya, \"Whoever does not do hijra is ruined.\" So Safwan ibn Umayya went to Madina and slept in the mosque with his cloak as a pillow. A thief came and took his cloak and Safwan grabbed hold of the thief and brought him to the Messenger of Allah, may Allah bless him and grant him peace. The Messenger of Allah, may Allah bless him and grant him peace, said to him, \"Did you steal this cloak?\" He said, \"Yes.\" So the Messenger of Allah, may Allah bless him and grant him peace, ordered that his hand be cut off. Safwan said to him, \"I did not intend this. It is his as sadaqa.\" The Messenger of Allah, may Allah bless him and grant him peace, said, \"Why didn't you do it before bringing him to me?",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1529
			}
		},
		{
			"hadithnumber": 1530,
			"arabicnumber": 1530,
			"text": "Yahya related to me from Malik from Rabia ibn Abi Abd ar-Rahman that az-Zubayr ibn al-Awwam came across a man who had taken hold of a thief and was intending to take him to the Sultan. Az-Zubayr ibn al- Awwam interceded for him to let him go. He said, \"No. Not until I take him to the Sultan.\" Az-Zubayr said, \"When you reach the Sultan with him, Allah curses the one who intercedes and the one who accepts the intercession",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1530
			}
		},
		{
			"hadithnumber": 1531,
			"arabicnumber": 1531,
			"text": "Yahya related to me from Malik from Abd ar-Rahman ibn al-Qasim from his father that a man from Yemen who had his hand and foot cut off came and went before Abu Bakr as-Siddiq and complained to him that the governor of the Yemen had wronged him, and the man used to pray part of the night. Abu Bakr said, \"By your father, your night is not the night of a thief.\" Then they missed a necklace of Asma bint Umays, the wife of Abu Bakr as-Siddiq. The man came to go around with them looking for it. He said, \"O Allah! You are responsible for the one who invaded the people of this good house by night!\" They found the jewelry with a goldsmith. He claimed that the maimed man had brought it to him. The maimed man confessed or it was testified against him. Abu Bakr as-Siddiq ordered that his left hand be cut off. Abu Bakr said, \"By Allah! His dua against himself is more serious, as far as I am concerned, than his theft.\" Yahya said that Malik said, \"What is done among us about the person who steals several times and is then called to reckoning, is that only his hand is cut off for all he stole when the hadd has not been applied againsthim. If the hadd has been applied against him before that, and he steals what obliges cutting off, then the next limb is cut off",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1531
			}
		},
		{
			"hadithnumber": 1532,
			"arabicnumber": 1532,
			"text": "Yahya related to me from Malik that Abu'z-Zinad informed him that a governor of Umar ibn Abd al-Aziz took some people in battle and had not killed any of them. He wanted to cut off their hands or kill them, so he wrote to Umar ibn Abd al-Aziz about that Umar ibn Abd al-Aziz wrote to him, \"Better to take less than that.\" Yahya said that he heard Malik say, \"What is done among us about a person who steals the goods of people which are placed under guard in the markets, and their owners put them in their containers and store them together is that if anyone steals any of that from where it is kept, and its value reaches that for which cutting off the hand is obliged, his hand must be cut off, whether or not the owner of the goods is with his goods and whether it is night or day.\" Malik said about some one who stole something for which cutting off the hand was obliged and then what he stole was found with him and he returned it to its owner, \"His hand is cut off.\" Malik said, \"If someon says, 'How can his hand be cut off when the goods have been taken from him and returned to their owner?', it is because he is in the same position as the wine drinker when the smell of the wine is found on his breath and he is not drunk. He is flogged with the hadd. \"The hadd is imposed for drinking wine even if it does not make the man intoxicated. That is because he drank it to become intoxicated. It is the same as that with cutting off the hand of the thief for theft when it is taken from him, even if he has not profited from it and it was returned to its owner. When he stole it, he stole it to take it away.\" Malik said that if some people came to a house and robbed it together, and then they left with a sack or box or a board or basket or the like of that which they carried together, and when they took it out of its guarded place, they carried it together, and the price of what they took reached that for which cutting off the hand was obliged, and that was three dirhams and upwards, each of them had his hand cut off. \"If each of them takes out something by himself, whoever of them takes out something whose value reaches three dirhams and upwards must have his hand cut off. If any of them takes out something whose value does not reach three dirhams, he does not have his hand cut off.\" Yahya said that Malik said, \"What is done among us is that when a man's house is locked and he is the only one living in it, cutting off the hand is not obliged against the one who steals something from it until he takes it out of the house completely. That is because all of the house is a place of custody. If someone other than him lives in the house and each of them locks his door, and it is a place of custody for each of them, whoever steals anything from the apartments of that house must have his hand cut off when he leaves the apartment and goes into the main house. He has removed it from its place of custody to another place and he must have his hand cut off.\" Malik said, \"What is done in our community about a slave who steals from the property of his master is that if he is not in service and among those trusted in the house and he enters secretly and steals from his master something that for which cutting off the hand is obliged, his hand is not cut off. It is like that with a slave-girl when she steals from her master's property. Her hand is not cut off.\" Malik then spoke about a slave who was not in service and not one of those trusted in the house, and he entered secretly and stole from the property of his master's wife that for which cutting off the hand was obliged. He said, \"His hand is cut off.\" \"It is like that with the wife's slave-girl when she does not serve her or her husband nor is she trusted in the house and she enters secretly and steals from her mistress's property that for which cutting off the hand is obliged. Her hand is not cut off.\" \"It is like that with the wife's slave-girl who is not in her service and is not trusted in the house and she enters secretly and steals from the property of her mistress's husband something for which cutting off the hand is obliged. Her hand is cut off.\" It is like that with the man who steals from his wife's goods or the wife who steals from her husband's goods something for which cutting off the hand is obliged. If the thing which one of them steals from his spouse's property is in a room other than the room which they both lock for themselves, or it is in a place of custody in a room other than the room which they are in, whichever of them steals something for which cutting off the hand is obliged, their hand should be cut off.\" Malik spoke about a small child and a foreigner who does not speak clearly. He said, \"If they are robbed of something from its place of custody or from under a lock, the one who stole it has his hand cut off. If the property is outside of its place of custody or locked room(when it is stolen), the one who robbed them does not have his hand cut off. It is then in the position of sheep stolen from the mountain and uncut fruit hanging on the trees \" Malik said, \"What is done among us about a person who robs graves is that if what he takes from the grave reaches what cutting off the hand is obliged for, his hand is cut off . That is because the grave is a place of custody for what is in it just as houses are a place of custody for what is in them. \" Malik added, \"Cutting off the hand is not obliged for him until he takes it out of the grave",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1532
			}
		},
		{
			"hadithnumber": 1533,
			"arabicnumber": 1533,
			"text": "Yahya related to me from Malik from Yahya ibn Said from Muhammad ibn Yahya ibn Habban that a slave stole a small palm from a man's garden and planted it in the garden of his master. The owner of the palm went out looking for the palm and found it. He asked for help against the slave from Marwan ibn al-Hakam. Marwan jailed the slave and wanted to cut off his hand. The master of the slave rushed off to Rafi ibn Khadij and asked him about it. Rafi informed him that he heard the Messenger of Allah, may Allah bless him and grant him peace, say, \"The hand is not cut off for fruit or palm pith.\" The man said, \"Marwan ibn al-Hakam has taken a slave of mine and wants to cut off his hand. I would like you to go with me to him so you can tell him what you heard from the Messenger of Allah, may Allah bless him and grant him peace.\" So, Rafi went with him to Marwan ibn al-Hakam. He said, \"Did you arrest a slave for this?\" He said, \"Yes.\" He said, \"What will you do with him?\" He said, \"I want to cut off his hand.\" Rafi said to him, \"I heard the Messenger of Allah, may Allah bless him and grant him peace, say, 'The hand is not cut off for dates or palm pith.' Marwan therefore ordered the slave to be released",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1533
			}
		},
		{
			"hadithnumber": 1534,
			"arabicnumber": 1534,
			"text": "Yahya related to me from Malik from Ibn Shihab from as-Sa'ib ibn Yazid that Abdullah ibn Amr ibn al-Hadrami brought a slave of his to Umar ibn al-Khattab and said to him, \"Cut off the hand of this slave of mine. He has stolen.\" Umar said to him, \"What did he steal?\" He said, \"He stole a mirror belonging to my wife. Its value was sixty dirhams.\" Umar said, \"Let him go. His hand is not to be cut off. He is your servant who has stolen your belongings",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1534
			}
		},
		{
			"hadithnumber": 1535,
			"arabicnumber": 1535,
			"text": "Yahya related to me from Malik from Ibn Shihab that Marwan ibn al-Hakam was brought a man who had snatched some goods and he wanted to cut off his hand. He sent to Zayd ibn Thabit to ask him about it. Zayd ibn Thabit said to him, \"The hand is not cut off for what is stolen by chance, openly, in haste",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1535
			}
		},
		{
			"hadithnumber": 1536,
			"arabicnumber": 1536,
			"text": "Yahya related to me from Malik that Yahya ibn Said said that Abu Bakr ibn Muhammad ibn Amr ibn Hazm informed him that he had taken a Nabatean who had stolen some iron rings and jailed him in order to cut off his hand. Amra bint Abd ar-Rahman sent a girl mawla to him called Umayya. Abu Bakr said that she had come to him while he was among the people and said that his aunt Amra sent word to him saying, \"Son of my brother! You have taken a Nabatean for something insignificant which was mentioned to me. Do you want to cut off his hand?\" He had said, \"Yes.\" She said, ''Amra says to you not to cut off the hand except for a quarter of a dinar and upwards.\" Abu Bakr added, \"So I let the Nabatean go.\" Malik said, \"The generally agreed on way of doing things among us about the confession of slaves is that if a slave confesses something against himself, the hadd and punishment for it is inflicted on his body. His confession is accepted from him and one does not suspect that he would inflict something on himself.\" Malik said, \"As for the one of them who confesses to a matter which will incur damages agains this master, his confession is not accepted against his master.\" Malik said, \"One does not cut off the hand of a hireling or a man who is with some people to serve them, if he robs them, because his state is not the state of a thief. His state is the state of a treacherous one. The treacherous one does not have his hand cut off.\" Malik said about a person who borrows something and then denies it, \"His hand is not cut off. He is like a man who owes a debt to another man and denies it. He does not have his hand cut off for what he has denied.\" Malik said, \"The generally agreed-on way of dealing among us, with the thief who is found in a house and has gathered up goods and has not taken them out, is that his hand is not cut off. That is like the man who places wine before him to drink it and does not do it. The hadd is not imposed on him. That is like a man who sits with a woman and desires to have haram intercourse with her and does not do it and he does not reach her. There is no hadd against that either.\" Malik said, \"The generally agreed-on way of doing things among us is that there is no cutting off the hand for what is taken by chance, openly and in haste, whether or not its price reaches that for which the hand is cut off",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1536
			}
		}
	]
}