{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"42": "Drinks"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1537,
			"arabicnumber": 1537,
			"text": "Yahya related to me from Malik from Ibn Shihab that as-Sa'ib ibn Yazid informed him that Umar ibn al-Khattab came out to them. He said, \"I have found the smell of wine on so-and-so, and he claimed that it was the drink of boiled fruit juice, and I am inquiring about what he has drunk. If it intoxicates, I will flog him.\" Umar then flogged him with the complete hadd",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 1537
			}
		},
		{
			"hadithnumber": 1538,
			"arabicnumber": 1538,
			"text": "Yahya related to me from Malik from Thawr ibn Zayd ad-Dili that Umar ibn al-Khattab asked advice about a man drinking wine. Ali ibn Abi Talib said to him, \"We think that you flog him for it with eighty lashes. Because when he drinks, he becomes intoxicated, and when he becomes intoxicated, he talks confusedly, and when he talks confusedly, he lies.\" (80 lashes is the same amount as for slandering) Umar gave eighty lashes for drinking wine",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 1538
			}
		},
		{
			"hadithnumber": 1539,
			"arabicnumber": 1539,
			"text": "Yahya related to me from Malik from Ibn Shihab that he was asked about the hadd of the slave for wine. He said, \"I heard that he has half the hadd of a freeman for drinking wine. Umar ibn al-Khattab, Uthman ibn Affan, and Abdullah ibn Umar flogged their slaves with half of the hadd of a freeman when they drank wine",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 1539
			}
		},
		{
			"hadithnumber": 1540,
			"arabicnumber": 1540,
			"text": "Yahya related to me from Malik from Yahya ibn Said that he heard Said ibn al-Musayyab say, \"There is nothing that Allah does not like to be pardoned as long as it is not a hadd.\" Yahya said that Malik said, \"The sunna with us is that the hadd is obliged against anyone who drinks something intoxicating whether or not he becomes drunk",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 1540
			}
		},
		{
			"hadithnumber": 1541,
			"arabicnumber": 1541,
			"text": "Yahya related to me from Malik from Nafi from Abdullah ibn Umar that the Messenger of Allah, may Allah bless him and grant him peace, addressed the people in one of his raids. Abdullah ibn Umar said, \"I went towards him, but he finished before I reached him. I asked about what he had said. Someone said to me, 'He forbade preparing nabidh in a gourd or in a jug smeared with pitch",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 1541
			}
		},
		{
			"hadithnumber": 1542,
			"arabicnumber": 1542,
			"text": "Yahya related to me from Malik from al-Ala ibn Abd ar-Rahman ibn Yaqub from his father from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, forbade preparing nabidh in a gourd or in a jug smeared with pitch",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 1542
			}
		},
		{
			"hadithnumber": 1543,
			"arabicnumber": 1543,
			"text": "Yahya related to me from Malik from Zayd ibn Aslam from Ata ibn Yasar that the Messenger of Allah, may Allah bless him and grant him peace, forbade preparing nabidh from nearly ripe dates and fresh dates together, and from dates and raisins together",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 1543
			}
		},
		{
			"hadithnumber": 1544,
			"arabicnumber": 1544,
			"text": "Yahya related to me from Malik from a reliable source from Bukayr ibn Abdullah ibn al-Ashajj from Abd ar-Rahman ibn al-Hubab al-Ansari from Abu Qatada al-Ansari that the Messenger of Allah, may Allah bless him and grant him peace, forbade making nabidh from dates and raisins together, and nearly ripe dates and fresh dates together. Malik said, \"That is the way of doing things among us in which the people of knowledge in our city continue. It is disapproved of because the Messenger of Allah, may Allah bless him and grant him peace, forbade it",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 1544
			}
		},
		{
			"hadithnumber": 1545,
			"arabicnumber": 1545,
			"text": "Yahya related to me from Malik from ibn Shihab from Abu Salama ibn Abd ar-Rahman that A'isha, the wife of the Prophet, may Allah bless him and grant him peace, said, \"The Messenger of Allah, may Allah bless him and grant him peace, was asked about mead, and he replied, 'Every drink which intoxicates is haram",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 1545
			}
		},
		{
			"hadithnumber": 1546,
			"arabicnumber": 1546,
			"text": "Yahya related to me from Malik from Zayd ibn Aslam from Ata ibn Yasar that the Messenger of Allah, may Allah bless him and grant him peace, was asked about al-Ghubayra. He said, \"There is no good in it,\" and forbade it. Malik said, \"I asked Zayd ibn Aslam, 'What is al- Ghubayra?' He said, 'It is an intoxicant",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 1546
			}
		},
		{
			"hadithnumber": 1547,
			"arabicnumber": 1547,
			"text": "Yahya related to me from Malik from Nafi from Abdullah ibn Umar that the Messenger of Allah, may Allah bless him and grant him peace, said \"Whoever drinks wine in this world and does not turn from it in tawba, it is haram for him in the Next World",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 1547
			}
		},
		{
			"hadithnumber": 1548,
			"arabicnumber": 1548,
			"text": "Yahya related to me from Malik from Zayd ibn Aslam that Ibn Wala al-Misri asked Abdullah ibn Abbas about what is squeezed from the grapes. Ibn Abbas replied, \"A man gave the Messenger of Allah, may Allah bless him and grant him peace, a small water-skin of wine. The Messenger of Allah, may Allah bless him and grant him peace, said to him, 'Don't you know that Allah has made it haram?' He said, 'No.' Then a man at his side whispered to him. The Messenger of Allah, may Allah bless him and grant him peace, asked what he had whispered, and the man replied, 'I told him to sell it.' The Messenger of Allah, may Allah bless him and grant him peace, said, 'The One who made drinking it haram has made selling it haram.' The man then opened the water- skins and poured out what was in them",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 1548
			}
		},
		{
			"hadithnumber": 1549,
			"arabicnumber": 1549,
			"text": "Yahya related to me from Malik from Ishaq ibn Abdullah ibn Abi Talha that Anas ibn Malik said, \"I was serving wine to Abu Ubayda ibn al-Jarrah and Abu Talha al-Ansari and Umayy ibn Kab. The wine had been prepared from crushed ripe dates and dried dates. Someone came to them and said, 'Wine has been made haram.' Abu Talha ordered me to go and take the jugs and break them. I stood up and went to a mortar of ours and I struck them with the bottom of it until they broke",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 1549
			}
		},
		{
			"hadithnumber": 1550,
			"arabicnumber": 1550,
			"text": "Yahya related to me from Malik from Da'ud ibn al-Husayn that Waqid ibn Amr ibn Sad ibn Muadh informed him from Mahmud ibn Labid al- Ansari that when Umar ibn al-Khattab went to ash-Sham, the people of ash-Sham complained to him about the bad air of their land and its heaviness. They said, \"Only this drink helps.\" Umar said, \"Drink this honey preparation.\" They said, \"Honey does not help us.\" A man from the people of that land said, \"Can we give you something of this drink which does not intoxicate?\" He said, \"Yes.\" They cooked it until two- thirds of it evaporated and one-third of it remained. Then they brought it to Umar. Umar put his finger in it and then lifted his head and extended it. He said, \"This is fruit juice concentrated by boiling. This is like the distillation with which you smear the camel's scabs.\" Umar ordered them to drink it. Ubada ibn as-Samit said to him, \"You have made it halal, by Allah!\" Umar said, \"No, by Allah! O Allah! I will not make anything halal for them which You have made haram for them! I will not make anything haram for them which You have made halal for them",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 1550
			}
		},
		{
			"hadithnumber": 1551,
			"arabicnumber": 1551,
			"text": "Yahya related to me from Malik from Nafi from Abdullah ibn Umar that some men from Iraq said to him, \"Abu Abd ar-Rahman, we buy the fruit of the palm and grapes and we squeeze them into wine and we sell it.\" Abdullah ibn Umar said, \"I call on Allah and His angels and whoever hears of jinn and men to testify to you that I order you not to buy it nor sell it nor to press it nor to drink it nor to give it to people to drink. It is something impure from the work of Shaytan",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 1551
			}
		}
	]
}