{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"50": "The Evil Eye"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1711,
			"arabicnumber": 1711,
			"text": "Yahya related to me from Malik that Muhammad ibn Abi Umama ibn Sahl ibn Hunayf heard his father say, \"My father, Sahl ibn Hunayf did a ghusl at al-Kharrar. He removed the jubbah he had on while Amir ibn Rabia was watching, and Sahl was a man with beautiful white skin. Amir said to him, 'I have never seen anything like what I have seen today, not even the skin of a virgin.' Sahl fell ill on the spot, and his condition grew worse. Somebody went to the Messenger of Allah, may Allah bless him and grant him peace, and told him that Sahl was ill, and could not go with him. The Messenger of Allah, may Allah bless him and grant him peace, came to him, and Sahl told him what had happened with Amir. The Messenger of Allah, may Allah bless him and grant him peace, said, 'Why does one of you kill his brother? Why did you not say, \"May Allah bless you?\" (ta baraka-llah) The evil eye is true. Do wudu from it.' Amir did wudu from it and Sahl went with the Messenger of Allah, may Allah bless him and grant him peace, and there was nothing wrong with him",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1711
			}
		},
		{
			"hadithnumber": 1712,
			"arabicnumber": 1712,
			"text": "Malik related to me from Ibn Shihab that Abu Umama ibn Sahl ibn Hunayf said, ''Amir ibn Rabia saw Sahl ibn Hunayf doing a ghusl and said, 'I have not seen the like of what I see today, not even the skin of a maiden who has never been out of doors.' Sahl fell to the ground. The Messenger of Allah, may Allah bless him and grant him peace, was approached and it was said, 'Messenger of Allah, can you do anything about Sahl ibn Hunayf? By Allah, he can not raise his head.' He said, 'Do you suspect anyone of it?' They said, 'We suspect Amir ibn Rabia.' \" He continued, \"The Messenger of Allah, may Allah bless him and grant him peace, summoned Amir and was furious with him and said, 'Why does one of you kill his brother? Why did you not say, \"May Allah bless you?\" Do ghusl for it.' Amir washed his face, hands, elbows, knees, the end of his feet, and inside his lower garment in a vessel. Then he poured it over him, and Sahl went off with the people, and there was nothing wrong with him",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1712
			}
		},
		{
			"hadithnumber": 1713,
			"arabicnumber": 1713,
			"text": "Yahya related to me from Malik that Humayd ibn Qays al-Makki said, \"A man came to the Messenger of Allah, may Allah bless him and grant him peace, with the two sons of Jafar ibn Abi Talib. He said to their nursemaid, 'Why do I see them so thin?' Their nursemaid said, 'Messenger of Allah, the evil eye goes quickly to them. Nothing stops us from asking someone to make incantations (using ayats of Qur'an) for them, except that we do not know what of that would agree with you.' The Messenger of ,Allah, may Allah bless him and grant him peace, said, 'Make incantations for them. Had anything been able to precede the decree, the evil eye would precede it",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1713
			}
		},
		{
			"hadithnumber": 1714,
			"arabicnumber": 1714,
			"text": "Yahya related to me from Malik from Yahya ibn Said from Sulayman ibn Yasar that Urwa ibn az-Zubayr told him that the Messenger of Allah, may Allah bless him and grant him peace, entered the house of Umm Salama, the wife of the Prophet, may Allah bless him and grant him peace. There was a child weeping in the house, and they told him that it was from the evil eye. Urwa said, \"The Messenger of Allah, may Allah bless him and grant him peace, said, 'Why do you not find someone to make an incantation to protect it from the evil eye?",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1714
			}
		},
		{
			"hadithnumber": 1715,
			"arabicnumber": 1715,
			"text": "Yahya related to me from Malik from Zayd ibn Aslam from Ata ibn Yasar that the Messenger of Allah, may Allah bless him and grant him peace, said, \"When the slave is ill, Allah ta'ala sends two angels to him.\" He said, \"They look at what he says to his visitors. If he praises Allah and lauds Him, when they come to him, they take that up to Allah, the Mighty, the Majestic, and He knows best, and He says, 'If I make my slave die, I will make him enter the Garden. If I heal him, I will replace his flesh with better flesh and his blood with better blood and I will efface his evil actions",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1715
			}
		},
		{
			"hadithnumber": 1716,
			"arabicnumber": 1716,
			"text": "Yahya related to me from Malik from Yazid ibn Khusayfa that Urwa ibn az-Zubayr said that he heard A'isha, the wife of the Prophet, may Allah bless him and grant him peace, say, \"The Messenger of Allah, may Allah bless him and grant him peace, said, 'When a mumin is afflicted by something, even a thorn, it removes (or effaces) his wrong actions.' \" Yazid did not know which of them Urwa said",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1716
			}
		},
		{
			"hadithnumber": 1717,
			"arabicnumber": 1717,
			"text": "Yahya related to me from Malik that Muhammad ibn Abdullah ibn Abi Sasaca said that he heard Abu'l-Hubab Said ibn Yasar say that he had heard Abu Hurayra say, \"The Messenger of Allah, may Allah bless him and grant him peace, said, 'Allah afflicts the one for whom He desires good",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1717
			}
		},
		{
			"hadithnumber": 1718,
			"arabicnumber": 1718,
			"text": "Yahya related to me from Malik from Yahya ibn Said that death came to a man in the time of the Messenger of Allah, may Allah bless him and grant him peace. A man said, \"He was fortunate,\" as he had died without being tried by illness. The Messenger of Allah, may Allah bless him and grant him peace, said, \"Alas for you, what will let you know that if Allah had tried him with illness, He would have wiped out his wrong actions",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1718
			}
		},
		{
			"hadithnumber": 1719,
			"arabicnumber": 1719,
			"text": "Yahya related to me from Malik from Yazid ibn Khusayfa that Amr ibn Abdullah ibn Kab as-Salami told him that Nafi ibn Jubayr told him that Uthman ibn Abi al-As came to the Messenger of Allah, may Allah bless him and grant him peace. Uthman said that he had a pain which was enough to kill him. The Messenger of Allah, may Allah bless him and grant him peace, said, \"Rub it with your right hand seven times and say, 'I take refuge with the might of Allah and His power from the evil of what I feel.' \" Uthman added, \"I said that, and Allah removed what I had. I still command my family and others to say it",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1719
			}
		},
		{
			"hadithnumber": 1720,
			"arabicnumber": 1720,
			"text": "Yahya related to me from Malik from Ibn Shihab from Urwa ibn az- Zubayr from A'isha that the Messenger of Allah, may Allah bless him and grant him peace, when he had a complaint, would recite the last three suras of Qur'an, over himself and blow. She said, \"When his pain was great, I would recite it over him and wipe him with his right hand hoping for its blessing",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1720
			}
		},
		{
			"hadithnumber": 1721,
			"arabicnumber": 1721,
			"text": "Yahya related to me from Malik from Yahya ibn Said from Amra bint Abd ar-Rahman that Abu Bakr as-Siddiq visited A'isha while she had a [health] complaint and a jewish woman was making incantation (ruqya) for her. Abu Bakr said, \"Do it (incantation) with the Book of Allah",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1721
			}
		},
		{
			"hadithnumber": 1722,
			"arabicnumber": 1722,
			"text": "Yahya related to me from Malik from Zayd ibn Aslam that a man received a wound in the time of the Messenger of Allah, may Allah bless him and grant him peace. The blood clotted in the wound and the man called two men from the Banu Ammar tribe. They looked at it and claimed that the Messenger of Allah, may Allah bless him and grant him peace, said to them, \"Which of you is the better doctor?\" They said, \"Is there any good in medicine, Messenger of Allah?\" Zayd claimed that the Messenger of Allah, may Allah bless him and grant him peace, said, \"The one who sent down the disease sent down the remedy",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Isnaad Daif"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1722
			}
		},
		{
			"hadithnumber": 1723,
			"arabicnumber": 1723,
			"text": "Yahya related to me from Malik that Yahya ibn Said said, \"I heard that Sad ibn Zurara cauterized himself because of a pain in the throat accompanied by blood and he died",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1723
			}
		},
		{
			"hadithnumber": 1724,
			"arabicnumber": 1724,
			"text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar cauterized for the palsy and he had a talisman made for a scorpion sting",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1724
			}
		},
		{
			"hadithnumber": 1725,
			"arabicnumber": 1725,
			"text": "Yahya related to me from Malik from Hisham ibn Urwa from Fatima bint al-Mundhir that whenever a woman who had a fever, was brought to Asma bint Abi Bakr, she made dua for her and took water and poured it inside her collar. She said, \"The Messenger of Allah, may Allah bless him and grant him peace, ordered us to cool it with water",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1725
			}
		},
		{
			"hadithnumber": 1726,
			"arabicnumber": 1726,
			"text": "Yahya related to me from Malik from Hisham ibn Urwa from his father that the Messenger of Allah, may Allah bless him and grant him peace, said, \"Fever is from the vehemence of the heat of Jahannam, so cool it with water",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1726
			}
		},
		{
			"hadithnumber": 1727,
			"arabicnumber": 1727,
			"text": "Malik related to me from Nafi from Ibn Umar that the Messenger of Allah, may Allah bless him and grant him peace, said, \"Fever is from the vehemence of the heat of Jahannam, so put it out with water",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1727
			}
		},
		{
			"hadithnumber": 1728,
			"arabicnumber": 1728,
			"text": "Yahya related to me from Malik that he had heard from Jabir ibn Abdullah that the Messenger of Allah, may Allah bless him and grant him peace, said, \"When a man visits an invalid, he plunges into mercy to the extent that when he sits with him, it settles in him,\" or the like of that",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1728
			}
		},
		{
			"hadithnumber": 1729,
			"arabicnumber": 1729,
			"text": "Yahya related to me from Malik that he had heard from Bukayr ibn Abdullah ibn al-Ashajj from Ibn Atiya that the Messenger of Allah, may Allah bless him and grant him peace, said:\"There is no contagion, no hama and no serpent in a hungry belly. However, the possessor of sick livestock must not stop at the same place as the possessor of healthy livestock, but the possessor of healthy livestock may stop wherever he wishes.\" They said, \"Messenger of Allah, Why is that?\" The Messenger of Allah, may Allah bless him and grant him peace, said, \"It is harmful.\" Note: The majority of scholars interpret this to mean that these things in and of themselves do not transmit or cause harm through supernatural or hidden means but that Allah is ultimately in control and any fearful superstition around these is false",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 50,
				"hadith": 1729
			}
		}
	]
}