{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"53": "Greetings"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1756,
			"arabicnumber": 1756,
			"text": "Yahya related to me from Malik from Zayd ibn Aslam that the Messenger of Allah, may Allah bless him and grant him peace, said, \"The one riding greets the one walking, and when one of a group of people gives a greeting, it is enough for all of them",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 53,
				"hadith": 1756
			}
		},
		{
			"hadithnumber": 1757,
			"arabicnumber": 1757,
			"text": "Yahya related to me from Malik from Wahb ibn Kaysan that Muhammad ibn Amr ibn Ata said, \"I was sitting with Abdullah ibn Abbas when a Yemeni man came in. He said, 'Peace be upon you, and the mercy of Allah and His blessing' (as-salamu alaykum wa rahmatullahi wa barakatuhu), and then he added something more to that. Ibn Abbas said (and at that time his eyesight had gone), 'Who is this?' People said, 'This is a Yemeni who has come to see you,' and they introduced him. Ibn Abbas said, 'The greeting ends with the word blessing.' \" Yahya said that Malik was asked, \"Does one greet a woman?\" He said, \"As for an old woman, I do not disapprove of it. As for a young woman, I do not like it",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 53,
				"hadith": 1757
			}
		},
		{
			"hadithnumber": 1758,
			"arabicnumber": 1758,
			"text": "Yahya related to me from Malik from Abdullah ibn Dinar that Abdullah ibn Umar said that the Messenger of Allah, may Allah bless him and grant him peace, said, \"When a jew greets you, and says 'Death to you' (as-samu alaykum) say, 'And to you.' \" Yahya said, \"Malik was asked whether a person who greeted a jew or christian, should apologise for it. He said, 'No",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 53,
				"hadith": 1758
			}
		},
		{
			"hadithnumber": 1759,
			"arabicnumber": 1759,
			"text": "Yahya related to me from Malik from Ishaq ibn Abdullah ibn Abi Talha from Abu Murra, the mawla of Aqil ibn Abi Talib from Abu Waqid al-Laythi that the Messenger of Allah, may Allah bless him and grant him peace, was sitting in the mosque with some people when three people came in. Two came toward the Messenger of Allah, may Allah bless him and grant him peace, and one went away. When the two stopped at the assembly of the Messenger of Allah, may Allah bless him and grant him peace, they gave the greeting. One of them saw a gap in the circle and sat in it. The other sat down behind the circle. The third turned away and left. When the Messenger of Allah, may Allah bless him and grant him peace, finished, he said, \"Shall I tell you about three people? One of them sought shelter with Allah, so Allah gave him shelter. The other was shy, so Allah was shy to him. The other turned away, so Allah turned away from him",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 53,
				"hadith": 1759
			}
		},
		{
			"hadithnumber": 1760,
			"arabicnumber": 1760,
			"text": "Yahya related to me from Malik from Ishaq ibn Abdullah ibn Abi Talha that Anas ibn Malik heard Umar ibn al-Khattab return the greeting of a man who greeted him. Then Umar asked the man, \"How are you?\" He said, \"I praise Allah to you.\" (Ahmadu ilayka Allah) Umar said, \"That is what I wanted from you",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 53,
				"hadith": 1760
			}
		},
		{
			"hadithnumber": 1761,
			"arabicnumber": 1761,
			"text": "Yahya related to me from Malik from Ishaq ibn Abdullah ibn Abi Talha that at-Tufayl ibn Ubayy ibn Kab told him that he visited Abdullah ibn Umar one morning and went out with him to the market, and when they were out, Abdullah ibn Umar did not pass by anyone selling poor merchandise or selling commodities or a needy person or anyone but that he greeted them. At-Tufayl said, \"I came to Abdullah ibn Umar one day and he asked me to follow him to the market. I said to him, 'What will you do in the market if you will not stop to sell nor seek any goods or barter with them or sit in any of the assemblies or market?' Abdullah ibn Umar said that we should sit down and talk, and then he explained, 'Abu Batni, (lit. father of the belly, at- Tufayl had a prominent stomach), we go out in the morning only for the sake of the greeting. We greet whomever we meet",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 53,
				"hadith": 1761
			}
		},
		{
			"hadithnumber": 1762,
			"arabicnumber": 1762,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 53,
				"hadith": 1762
			}
		}
	]
}