{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"56": "Speech"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1811,
			"arabicnumber": 1811,
			"text": "Malik related to me from Abdullah ibn Dinar from Abdullah ibn Umar that the Messenger of Allah, may Allah bless him and grant him peace, said, \"If a man says to his muslim brother, 'O kafir!' it is true about one of them",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1811
			}
		},
		{
			"hadithnumber": 1812,
			"arabicnumber": 1812,
			"text": "Malik related to me from Suhayl ibn Abu Salih from his father from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, said, \"When you hear a man say, 'The people are ruined,' he himself is the most ruined of them all",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1812
			}
		},
		{
			"hadithnumber": 1813,
			"arabicnumber": 1813,
			"text": "Malik related to me from Abu'z-Zinad from al-Araj from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, said, \"Let none of you complain about time, for Allah is time",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1813
			}
		},
		{
			"hadithnumber": 1814,
			"arabicnumber": 1814,
			"text": "Malik related to me from Yahya ibn Said that Isa ibn Maryam encountered a pig on the road. He said to it, \"Go in peace.\" Somebody asked, \"Do you say this to a pig?\" Isa said, \"I fear lest I accustom my tongue to evil speech",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1814
			}
		},
		{
			"hadithnumber": 1815,
			"arabicnumber": 1815,
			"text": "Malik related to me from Muhammad ibn Amr ibn Alqama from his father from Bilal ibn al-Harith al-Muzani that the Messenger of Allah, may Allah bless him and grant him peace, said, \"A man speaks what is pleasing to Allah and he does not suspect that it will have the result that it does, and Allah will write for him His good pleasure for it until the day when he meets Him. And a man speaks what excites the wrath of Allah and he does not suspect that it will have the result that it does, and Allah will write His wrath for him for it until the day when he meets Him",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1815
			}
		},
		{
			"hadithnumber": 1816,
			"arabicnumber": 1816,
			"text": "Malik related to me from Abdullah ibn Dinar that Abu Salih as- Samman informed him that Abu Hurayra said, \"Truly a man utters words to which he attaches no importance, and by them he falls into the fire of Jahannam, and truly a man utters words to which he attaches no importance, and by them Allah raises him into the Garden",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1816
			}
		},
		{
			"hadithnumber": 1817,
			"arabicnumber": 1817,
			"text": "Malik related to me from Zayd ibn Aslam that Abdullah ibn Umar said, \"Two men from the east stood up and spoke, and people were amazed at their eloquence. The Messenger of Allah, may Allah bless him and grant him peace, said, 'Some eloquence is sorcery,' or he said, 'Part of eloquence is sorcery",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1817
			}
		},
		{
			"hadithnumber": 1818,
			"arabicnumber": 1818,
			"text": "Malik related to me that he heard that Isa ibn Maryam used to say, \"Do not speak much without the mention of Allah for you will harden your hearts. A hard heart is far from Allah, but you do not know. Do not look at the wrong actions of people as if you were lords. Look at your wrong actions as if you were slaves. Some people are afflicted by wrong action and some people are protected from it. Be merciful to the people of affliction and praise Allah for His protection",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1818
			}
		},
		{
			"hadithnumber": 1819,
			"arabicnumber": 1819,
			"text": "Malik related to me that he heard that A'isha, the wife of the Prophet, may Allah bless him and grant him peace, sent a message to one of her family after the evening prayer, saying, \"Will you not allow the recording angel to rest?",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1819
			}
		},
		{
			"hadithnumber": 1820,
			"arabicnumber": 1820,
			"text": "Malik related to me from al-Walid ibn Abdullah ibn Sayyad that al-Muttalib ibn Abdullah ibn Hantab al-Makhzumi informed him that a man asked the Messenger of Allah, may Allah bless him and grant him peace, \"What is backbiting?\" The Messenger of Allah, may Allah bless him and grant him peace, said, \"It is to mention about a man what he does not want to hear.\" He said, \"Messenger of Allah! Even if it is true?\" The Messenger of Allah, may Allah bless him and grant him peace, said, \"If you utter something false, then it is slander",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1820
			}
		},
		{
			"hadithnumber": 1821,
			"arabicnumber": 1821,
			"text": "Malik related to me from Zayd ibn Aslam from Ata ibn Yasar that the Messenger of Allah, may Allah bless him and grant him peace, said, \"Whomever Allah protects from the evil of two things will enter the Garden.\" A man said, \"Messenger of Allah, do not tell us!\" The Messenger of Allah, may Allah bless him and grant him peace, was silent. Then the Messenger of Allah, may Allah bless him and grant him peace, repeated what he had said the first time. The man said to him, \"Do not tell us, Messenger of Allah!\" The Messenger of Allah, may Allah bless him and grant him peace, was silent. Then the Messenger of Allah, may Allah bless him and grant him peace, said the same thing again. The man said, \"Do not tell us, Messenger of Allah!\" Then the Messenger of Allah, may Allah bless him and grant him peace, said the same thing again. Then the man began to say what he had said previously and a man at his side silenced him. The Messenger of Allah, may Allah bless him and grant him peace, said, \"Whomever Allah protects from the evil of two things will enter the Garden. They are what is between his jaws and what is between his legs, what is between his jaws and what is between his legs, what is between his jaws and what is between his legs",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1821
			}
		},
		{
			"hadithnumber": 1822,
			"arabicnumber": 1822,
			"text": "Malik related to me from Zayd ibn Aslam from his father that Umar ibn al-Khattab came upon Abu Bakr as-Siddiq pulling his tongue. Umar said to him, \"Stop, may Allah forgive you!\" Abu Bakr replied, \"This has brought me to dangerous places",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1822
			}
		},
		{
			"hadithnumber": 1823,
			"arabicnumber": 1823,
			"text": "Malik related to me from Abdullah ibn Dinar saying, \"Abdullah ibn Umar and I were at the house of Khalid ibn Uqba who was away at the market. A man came who wanted to speak to Abdullah ibn Umar and I was the only other person present Abdullah ibn Umar called another man so that we were four and said to me and the man whom he had called, 'Go a little way off together, because I heard the Messenger of Allah, may Allah bless him and grant him peace, say, \"Two do not converse secretly to the exclusion of another",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1823
			}
		},
		{
			"hadithnumber": 1824,
			"arabicnumber": 1824,
			"text": "Malik related to me from Nafi from Abdullah ibn Umar that the Messenger of Allah, may Allah bless him and grant him peace, said, \"Two must not converse secretly to the exclusion of another person",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1824
			}
		},
		{
			"hadithnumber": 1825,
			"arabicnumber": 1825,
			"text": "Malik related to me from Safwan ibn Sulaym that a man asked the Messenger of Allah, may Allah bless him and grant him peace, \"Can I lie to my wife, Messenger of Allah?\" The Messenger of Allah, may Allah bless him and grant him peace, said, \"There is no good in lying.\" The man said, \"Messenger of Allah! Shall I make her a promise and tell her?\" The Messenger of Allah, may Allah bless him and grant him peace, said, \"It will not be held against you",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1825
			}
		},
		{
			"hadithnumber": 1826,
			"arabicnumber": 1826,
			"text": "Malik related to me that he heard that Abdullah ibn Masud used to say, \"You must tell the truth. Truthfulness leads to right action. Right action leads to the Garden. Beware of lying. Lying leads to corruption, and corruption leads to the Fire. Don't you see that it is said, 'He speaks the truth and acts rightly,' and, 'He lies and is corrupt",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1826
			}
		},
		{
			"hadithnumber": 1827,
			"arabicnumber": 1827,
			"text": "Malik related to me that he heard that someone said to Luqman, \"What has brought you to what we see?\" meaning his high rank. Luqman said, \"Truthful speech, fulfilling the trust, and leaving what does not concern me",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1827
			}
		},
		{
			"hadithnumber": 1828,
			"arabicnumber": 1828,
			"text": "Malik related to me that he heard that Abdullah ibn Masud used to say, \"The slave continues to lie and a black spot grows in his heart until all his heart becomes black. Then he is written, in Allah's sight, among the liars",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1828
			}
		},
		{
			"hadithnumber": 1829,
			"arabicnumber": 1829,
			"text": "Malik related to me that Safwan ibn Sulaym said, \"The Messenger of Allah, may Allah bless him and grant him peace, was asked, 'Can the mumin be a coward?' He said, 'Yes.' He was asked, 'Can the mumin be a miser?' He said, 'Yes.' He was asked, 'Can the mumin be a liar?' He said, 'No",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1829
			}
		},
		{
			"hadithnumber": 1830,
			"arabicnumber": 1830,
			"text": "Malik related to me from Suhayl ibn Abi Salih from his father from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, said, \"Allah is pleased with three things from you, and He is angry with three things from you. He is pleased that you worship Him and do not associate anything with Him, and that you take hold of the rope of Allah altogether, and that you give good counsel to the one to whom Allah gives command over you. He is angry with you for gossip, squandering property, and asking too many questions",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1830
			}
		},
		{
			"hadithnumber": 1831,
			"arabicnumber": 1831,
			"text": "Malik related to me from Abu'z-Zinad from al-Araj from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, said, \"One of the most evil of people is the two-faced person who shows one face to these people and another face to those people",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1831
			}
		},
		{
			"hadithnumber": 1832,
			"arabicnumber": 1832,
			"text": "Malik related to me that he had heard that Umm Salama, the wife of the Prophet, may Allah bless him and grant him peace, said, \"Messenger of Allah! Shall we be destroyed while there are people who are salih among us?\" The Messenger of Allah, may Allah bless him and grant him peace, said, \"Yes, if there is much wickedness",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1832
			}
		},
		{
			"hadithnumber": 1833,
			"arabicnumber": 1833,
			"text": "Malik related to me that Ismail ibn Abi Hakim heard Umar ibn Abd al-Aziz say, \"Some say that Allah the Blessed, the Exalted, will not punish the many for the wrong action of the few. However, when the objectionable action is committed openly, then they all deserve to be punished",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1833
			}
		},
		{
			"hadithnumber": 1834,
			"arabicnumber": 1834,
			"text": "Malik related to me from Ishaq ibn Abdullah ibn Abi Talha that Anas ibn Malik said, \"I heard Umar ibn al-Khattab, when I was going out with him to visit an orchard, say to himself, and there was a wall between him and me and he was inside the garden, 'Umar ibn al-Khattab, amir al-muminin! Well done! Well done! By Allah, fear Allah or he will punish you",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1834
			}
		},
		{
			"hadithnumber": 1835,
			"arabicnumber": 1835,
			"text": "Malik said, \"I heard that al-Qasim ibn Muhammad used to say, 'I have seen the people, (i.e. the companions), and they were not impressed by speech.' \" Malik said, \"He meant that only action and deeds would be looked at, not words",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Hasan"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1835
			}
		},
		{
			"hadithnumber": 1836,
			"arabicnumber": 1836,
			"text": "Malik related to me that Amir ibn Abdullah ibn az-Zubayr would stop speaking when he heard thunder and say, \"Glory be to Allah whom the thunder glorifies with His praise and the angels from the fear of Him.\" (Subhana-aladhee yusabihu ar-radu bi hamdihi wa mala'ikatu min khiyfatihi.) Then he would say, \"This is a severe warning to the people of the earth",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1836
			}
		},
		{
			"hadithnumber": 1837,
			"arabicnumber": 1837,
			"text": "Malik related to me from Ibn Shihab from Urwa ibn az-Zubayr from A'isha, umm al-muminin that when the Messenger of Allah, may Allah bless him and grant him peace, died, the wives of the Prophet, may Allah bless him and grant him peace, wanted to send Uthman ibn Affan to Abu Bakr as-Siddiq to ask him about their inheritance from the Messenger of Allah, may Allah bless him and grant him peace A'isha said to them, \"Didn't the Messenger of Allah, may Allah bless him and grant him peace, say, 'No one inherits from us. What we leave is sadaqa",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1837
			}
		},
		{
			"hadithnumber": 1838,
			"arabicnumber": 1838,
			"text": "Malik related to me from Abu'z-Zinad from al-Araj from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, said, \"My inheritance is not divided up by the dinar. What I leave apart from the maintenance of my wives and provision for my servant is sadaqa",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 56,
				"hadith": 1838
			}
		}
	]
}