{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 147,
			"arabicnumber": "31",
			"text": "It is reported on the authority of Abu Huraira:We were sitting around the Messenger of Allah (may peace and blessings be upon him). Abu Bakr and Umar were also there among the audience. In the meanwhile the Messenger of Allah got up and left us, He delayed in coming back to us, which caused anxiety that he might be attacked by some enemy when we were not with him; so being alarmed we got up. I was the first to be alarmed. I, therefore, went out to look for the Messenger of Allah (may peace and blessings be upon him) and came to a garden belonging to the Banu an-Najjar, a section of the Ansar went round it looking for a gate but failed to find one. Seeing a rabi' (i. e. streamlet) flowing into the garden from a well outside, drew myself together, like a fox, and slinked into (the place) where God's Messenger was. He (the Holy Prophet) said: Is it Abu Huraira? I (Abu Huraira) replied: Yes, Messenger of Allah. He (the Holy Prophet) said: What is the matter with you? replied: You were amongst us but got up and went away and delayed for a time, so fearing that you might be attacked by some enemy when we were not with you, we became alarmed. I was the first to be alarmed. So when I came to this garden, I drew myself together as a fox does, and these people are following me. He addressed me as Abu Huraira and gave me his sandals and said: Take away these sandals of mine, and when you meet anyone outside this garden who testifies that there is no god but Allah, being assured of it in his heart, gladden him by announcing that he shall go to Paradise. Now the first one I met was Umar. He asked: What are these sandals, Abu Huraira? I replied: These are the sandals of the Messenger of Allah with which he has sent me to gladden anyone I meet who testifies that there is no god but Allah, being assured of it in his heart, with the announcement that he would go to Paradise. Thereupon 'Umar struck me on the breast and I fell on my back. He then said: Go back, Abu Huraira, So I returned to the Messenger of Allah (ﷺ), and was about to break into tears. 'Umar followed me closely and there he was behind me. The Messenger of Allah (may peace and blessings be on him) said: What is the matter with you, Abu Huraira? I said: I happened to meet 'Umar and conveyed to him the message with which you sent me. He struck me on my breast which made me fall down upon my back and ordered me to go back. Upon this the Messenger of Allah (ﷺ) said: What prompted you to do this, 'Umar? He said: Messenger of Allah, my mother and father be sacrificed to thee, did you send Abu Huraira with your sandals to gladden anyone he met and who testified that there is no god but Allah, and being assured of it in his heart, with the tidings that he would go to Paradise? He said: Yes. Umar said: Please do it not, for I am afraid that people will trust in it alone; let them go on doing (good) deeds. The Messenger of Allah (ﷺ) said: Well, let them",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 54
			}
		}
	]
}