{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"5": "The Book of Mosques and Places of Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1496,
			"arabicnumber": "33.03",
			"text": "Mahmud b. al-Rabi' reported that 'Ibn b. Malik, who was one of the Companions of the Messenger of Allah (ﷺ) and who participated in the (Battle of) Badr and was among the Ansar (of Medina), told that he came to the Messenger of Allah (ﷺ) and said:Messenger of Allah, I have lost my eyesight and I lead my people in prayer. When there is a downpour there is then a current (of water) in the valley that stands between me and them and I find it impossible to go to their mosque and lead them in prayer. Messenger of Allah, I earnestly beg of you that you should come and observe prayer at a place of worship (in my house) so that I should then use it as a place of worship. The Messenger of Allah (ﷺ) said: Well, it God so wills. I would soon do so. 'Itban said: On the following day when the day dawned, the Messenger of Allah (may peace he upon him) came along with Abu Bakr at-Siddiq, and the Messenger of Allah (ﷺ) asked permission (to get into the house). I gave him the permission, and be did not sit after entering the house, when he said: At what place in your house you desire me to say prayer? I ('Itban b. Malik) said: I pointed to a corner in the house, The Messenger of Allah (ﷺ) stood (at that place for prayer) and pronounced Allah-o-Akbar (Allah is the Greatest) (as an expression for the commencement of prayer). We too stood behind him, and he said two rak'ahs and then pronounced salutation (marking the end of the prayer). We detained him (the Holy Prophet) for the meat curry we had prepared for, him. The people of the neighbouring houses came and thus there was a good gathering in (our house). One of them said: Where is Malik b. Dukhshun? Upon this one of them remarked: He is a hypocrite; he does not love Allah and His Messenger. Thereupon the Messenger of Allah (ﷺ) said: Do not say so about him. Don't you see that he utters La ilaha ill-Allah (There is no god but Allah) and seeks the pleasure of Allah through it? They said: Allah and His Messenger know beet. One (among the audience) said: We see his inclination and wellwishing for hypocrites only. Upon this the Messenger of Allah' (ﷺ) again said: Verily Allah has forbidden the Fire for one who says: There is no god but Allah, thereby seeking Allah's pleasure. Ibn Shihab said: I asked Husain b. Muhammad al-Ansar (he was one of the leaders of Banu Salim) about the hadith transmitted by Mahmud b. Rabi' and he testified it",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 329
			}
		}
	]
}