{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"5": "The Book of Mosques and Places of Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1562,
			"arabicnumber": "681",
			"text": "Abu Qatida reported:The Messenger of Allah (way peace be upon him) addressed us and said: You would travel In the evening and the might till (God willing) you would come in the morning to a place of water. So the people travelled (self absorbed) without paying any heed to one another, and the Messenger of Allah (ﷺ) also travelled till It was midnight. I was by his side. The Messenger of Allah (ﷺ) began to doze and leaned (to one side) of his camel. I came to him and I lent him support without awaking him till he sat poised on his ride. He went on travelling till a major part of the night was over and (he again) leaned (to one side) of his camel. I supported him without awaking him till he sat\" bed on his ride. and then travelled till it was near dawn. He (again) leaned which was far more inclined than the two earlier leanings and he was about to fall down. So I came to him and supported him and he lifted his head and said; Who is this? I said: it is Abu Qatida. He (the Prophet again) said: Since how long have you been travelling along with me like this? I said: I have been travelling in this very state since the night. He said: May Allah protect you, as you have protected His Apostle (from falling down), and again said: Do you see that we are hidden from the people? - and again said: Do you see anyone? I said: Here is a rider. I again said: Here Is another rider till we gathered together and we were seven riders. The Messenger of Allah (ﷺ) stepped aside of the highway and placed his head (for sleep and said): Guard for us our prayers. The Messenger of Allah (ﷺ) was the first to wake up and the rays of the sun were falling on his back. We got up startled He (the Holy Prophet) said: Ride on So we rode on till the sun had (sufficiently) risen. He then came down from his camel and called for a jug of water which I had with me. There was a little water in that. He performed ablution with that which was less thorough as compared with his usual ablutions and some water of that had been left. He (the Holy Prophet) said to Abu Qatida: Keep a watch over your jug of water; it would have (a miraculous) condition about it. Then Bilal summoned (people) to prayer and then the Messenger of Allah (ﷺ) observed two rak'ahs and then said the morning prayer as he said every day. The Messenger of Allah (ﷺ) (then) rode on and we rode along with him and some of us whispered to the others saying: How would there be compensation for omission in our prayers? Upon this he (the Messenger of Allah) said: Is there not in me (my life) a model for you? There is no omission in sleeping. The (cognizable) emission is that one should not say prayer (intentionally) till the time of the other prayer comes. So he who did like it (omitted prayer in sleep or due to other unavoidable circumstances) should say prayer when he becomes aware of it and on the next day he should observe it at its prescribed time. He (the Holy Prophet) said: What do you think the people would have done (at this hour)? They would have in the morning found their Apostle missing from amongst them and then Abu Bakr and 'Umar would have told them that the Messenger of Allah (ﷺ) must be behind you, he cannot leave you behind (him), but the people said: The Messenger of Allah (ﷺ) is ahead of you. So if you had obeyed Abu Bakr and Umar, you would have gone on the right path. So we proceeded on till we came up to the people (from whom we had lagged behind) and the day had considerably risen and everything became hot, and they (the Companions of the Holy Prophet) said: Messenger of Allah, we are dying of thirst. Upon this he (the Holy Prophet) remarked: There is no destruction for you. And again said: Bring that small cup of mine and he then asked for the jug of water to be brought to him. The Messenger of Allah (ﷺ) began to pour water (in that small cup) and Abu Qatida gave them to drink. And when the people saw that there was (a little) water in the jug, they fell upon it. Upon this the Messenger of Allah (ﷺ) said: Behave well; the water (is enough) to satiate all of you. Then they (the Companions) began to receive (their share of) water with calmness (without showing any anxiety) and the Messenger of Allah (ﷺ) began to fill (the cap), and I began to serve them till no one was left except me and the Messenger of Allah (ﷺ). He then filled (the cup) with water and said to me: Drink it. I said: Messenger of Allah, I would not drink till you drink. Upon this he said: The server of the people Is the last among them to drink. So I drank and the Messenger of Allah (ﷺ) also drank and the people came to the place of water quite happy and satiated. 'Abdullah b. Rabah said: I am going to narrate this hadith in the great mosque, when 'Imran b. Husain said: See, O young man, how will you narrate for I was also one of the riders on that night? I said: So you must be knowing this hadith well. He said: Who are you? I said: I am one of the Ansar. Upon this he said: You narrate, for you know your hadith better. I, therefore, narrated it to the people. 'Imran said: I was also present that night, but I know not anyone else who learnt it so well as you have learnt",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 395
			}
		}
	]
}