{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"6": "The Book of Prayer - Travellers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1930,
			"arabicnumber": "832",
			"text": "Amr b. 'Abasa Sulami reported:In the state of the Ignorance (before embracing Islam), I used to think that the people were in error and they were not on anything (which may be called the right path) and worshipped the idols. Meanwhile, I heard of a man in Mecca who was giving news (on the basis of his prophetic knowledge) ; so I sat on my ride and went to him. The Messenger of Allah (ﷺ) was at that time hiding as his people had made life hard for him. I adopted a friendly attitude (towards the Meccans and thus managed) to enter Mecca and go to him (the Holy Prophet) and I said to him: Who are you? He said: I am a Prophet (of Allah). I again said: Who is a Prophet? He said: (I am a Prophet in the sense that) I have been sent by Allah. I said: What is that which you have been sent with? He said: I have been sent to join ties of relationship (with kindness and affection), to break the Idols, and to proclaim the oneness of Allah (in a manner that) nothing is to be associated with Him. I said: Who is with you in this (in these beliefs and practices)? He said: A free man and a slave. He (the narrator) said: Abu Bakr and Bilal were there with him among those who had embraced Islam by that time. I said: I intend to follow you. He said: During these days you would not be able to do so. Don't you see the (hard) condition under which I and (my) people are living? You better go back to your people and when you hear that I have been granted victory, you come to me. So I went to my family. I was in my home when the Messenger of Allah (ﷺ) came to Medina. I was among my people and used to seek news and ask people when he arrived in Medina. Then a group of people belonging to Yathrib (Medina) came. I said (to them): How is that person getting on who has come to Medina? They said: The people are hastening to him, while his people (the polytheists of Mecca) planned to kill him, but they could not do so. I (on hearing it) came to Medina and went to him and said: Messenger of Allah, do you recognise me? He said: Yes, you are the same man who met me at Mecca. I said: It is so. I again said: Prophet of Allah, tell me that which Allah has taught you and which I do not know, tell me about the prayer. He said: Observe the dawn prayer, then stop praying when the sun is rising till it is fully up, for when it rises it comes up between the horns of Satan, and the unbelievers prostrate themselves to it at that time. Then pray, for the prayer is witnessed and attended (by angels) till the shadow becomes about the length of a lance; then cease prayer, for at that time Hell is heated up. Then when the shadow moves forward, pray, for the prayer is witnessed and attended by angels, till you pray the afternoon prayer, then cease prayer till the sun sets, for it sets between the horns of devil, and at that time the unbelievers prostrate themselves before it. I said: Apostle of Allah, tell me about ablution also. He said: None of you who uses water for ablution and rinses his mouth, snuffs up water and blows it, but the sins of his face, and his mouth and his nostrils fall out. When he washes his face, as Allah has commanded him, the sins of his face fall out from the end of his beard with water. Then (when) he washes his forearms up to the elbows, the sins of his arms fall out along with water from his finger-tips. And when he wipes his head, the sins of his head fall out from the points of his hair along with water. And (when) he washes his feet up to the ankles, the sins of his feet fall out from his toes along with water. And if he stands to pray and praises Allah, lauds Him and glorifies Him with what becomes Him and shows wholehearted devotion to Allah, his sins would depart leaving him (as innocent) as he was on the day his mother bore him. 'Amr b. 'Abasa narrated this hadith to Abu Umama, a Companion of the Messenger of Allah (ﷺ), and Abu Umama said to him: 'Amr b. 'Abasa, think what you are saying that such (a great reward) is given to a man at one place (only in the act of ablution and prayer). Upon this 'Amr said: Abu Umama, I have grown old and my bones have become weak and I am at the door of death; what impetus is there for me to attribute a lie to Allah and the Messenger of Allah (ﷺ)? Had I heard it from the Messenger of Allah (ﷺ) once, twice, or three times (even seven times), I would have never narrated it, but I have heard it from him on occasions more than these",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 358
			}
		}
	]
}