{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"10": "The Book of Prayer - Eclipses"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2109,
			"arabicnumber": "907.01",
			"text": "Ibn 'Abbas reported:There was an eclipse of the sun during the lifetime of the Messenger of Allah (ﷺ). The Messenger of Allah, (ﷺ) prayed accompanied by the people. He stood for a long time, about as long as it would take to recite Surah al-Baqara; then he bowed for a long time; then he raised his head and stood for a long time, but it was less than the first qiyam. He then bowed for a long time but for a shorter while than the first. He then prostrated and then stood for a long time, but it was less than the first qiyam. He then bowed for a long time, but it was less than the first bowing. He then raised (his head) and stood for a long time, but it was less than the first qiyam. He then bowed for a long time but it was less than the first bowing. He then observed prostration, and then he finished, and the sun had cleared (by that time). He (the Holy Prophet) then said: The sun and moon are two signs from the signs of Allah. These two do not eclipse on account of the death of anyone or on account of the birth of anyone. So when you see that, remember Allah. They (his Companions) said: Messenger of Allah, we saw you reach out to something, while you were standing here, then we saw you restrain yourself. He said: I saw Paradise and reached out to a bunch of its grapes; and had I taken it you would have eaten of it as long as the world endured. I saw Hell also. No such (abominable) sight have I ever seen as that which I saw today; and I observed that most of its inhabitants were women. They said: Messenger of Allah, on what account is it so? He said: For their ingratitude or disbelief (bi-kufraihinna). It was said: Do they disbelieve in Allah? He said: (Not for their disbelief in God) but for their ingratitude to their husbands and ingratitude to kindness. If you were to treat one of them kindly for ever, but if she later saw anything (displeasing) in you, she would say: I have never seen any good in you",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 18
			}
		}
	]
}