{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"12": "The Book of Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2290,
			"arabicnumber": "987.01",
			"text": "Abu Huraira reported Allah's Messenger (way peace be upon him) as saying:If any owner of gold or silver does not pay what is due on him, when the Day of Resurrection would come, plates of fire would be beaten out for him; these would then be heated in the fire of Hell and his sides, his forehead and his back would be cauterized with them. Whenever these cool down, (the process is) repeated during a day the extent of which would be fifty thousand years, until judgment is pronounced among servants, and he sees whether his path is to take him to Paradise or to Hell. It was said: Messenger of Allah, what about the camel? He (the Holy Prophet) said: If any owner of the camel does not pay what is due on him, and of his due in that (camel) is (also) to milk it on the day when it comes down to water. When the Day of Resurrection comes a soft sandy plain would be set for him, as extensive as possible, (he will find) that not a single young one is missing, and they will trample him with their hoofs and bite him with their mouths. As often as the first of them passes him, the last of them would be made to return during a day the extent of which would be fifty thousand years, until judgment is pronounced among servants and he sees whether his path is to take him to Paradise or to Hell. It was (again) said: Messenger of Allah, what about cows (cattle) and sheep? He said: It any owner of the cattle and sheep does not pay what is due on them, when the Day of Resurrection comes a soft sandy plain would be spread for them, he will find none of them missing, with twisted horns, without horns or with a broken horn, and they will gore him with their horns and trample him with their hoofs. As often as the first of them passes him the last of them would be made to return to him during a day the extent of which would be fifty thousand years, until judgment would be pronounced among the servants. And he would be shown his path-path leading him to Paradise or to Hell. It was said: Messenger of Allah, what about the horse? Upon this he said: The horses are of three types. To one than (these are) a burden, and to another man (these are) a covering, and still to another man (these are) a source of reward. The one for whom these are a burden is the person who rears them in order to show off, for vainglory and for opposing the Muslims; so they are a burden for him. The one for whom these are a covering is the person who rears them for the sake of Allah but does not forget the right of Allah concerning their backs and their necks, and so they are a covering for him. As for those which bring reward (these refer to) the person who rears them for the sake of Allah to be used for Muslims and he puts them in meadow and field. And whatever thing do these eat from that meadow and field would be recorded on his behalf as good deeds, as would also the amount of their dung and urine. And these would not break their halter and prance a course or two without having got recorded the amount of their hoof marks and their dung as a good deed on his behalf (on behalf of their owner). And their master does not bring them past a river from which they drink, though he did not intend to quench their thirst, but Allah would record for him the amount of what they drink on his behalf as deeds. It was said: Messenger of Allah, what about the asses?, Upon this he said: Nothing has been revealed to me in regard to the asses (in particular) except this one verse of a comprehensive nature:\" He who does an atom's weight of good will see it, and he who does an atom's weight of evil will see it\" (xcix. 7)",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 28
			}
		}
	]
}