{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"12": "The Book of Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2292,
			"arabicnumber": "987.03",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:No owner of the treasure who does not pay Zakat (would be spared) but (his hoards) would be heated in the Fire of Hell and these would be made into plates and with these his sides, his forehead would be cauterised till Allah would pronounce judgment among His servants during a day, the extent of which would be fifty thousand years. He would then see his path, leading either to Paradise or to Hell. And no owner of the camels who does not pay Zakat (would be spared) but a soft sandy plain would be set for him and they (the camels) would be made to pass over him till the last of them would be made to return till Allah would pronounce judgment among His servants during a day the extent of which would be fifty thousand years. He would then see his path leading him to Paradise or leading him to Hell. And no owner of the (cattle and) goats who does not pay Zakat (would be spared) but a soft sandy plain would be set for him, he would find none of them missing, with twisted horns, without horns, or with broken horns, and they will gore him with their horns and trample him with their hoofs and they would be made to pass over him till the last of them would be made to return till Allah would pronounce judgment among His servants, during a day the extent of which would be fifty thousand years, and he would see the paths leading to Paradise or to Hell. Suhail said: I do not know whether he made mention of the cows. They said: Messenger of Allah (ﷺ), what about the horses? He said: The horses have goodness in their foreheads (or he said) or goodness is ingrained in the foreheads of the horses (Suhail said: I am in doubt as to what was actually said) up till the Day of judgement. The horses are of three kinds. They are a source of reward to a person, they are a covering to a person, and they are a burden to a person. As for those which bring reward is that a person would get reward who rears them for the sake of Allah and trains them for Him, and nothing disappears in their stomachs but Allah would record for him a good deed. And if they were to graze in the meadow, they would eat nothing but Allah would record for him a reward. And if they were to drink water from the canal, with every drop that, would disappear in their stomachs there would be reward (for the owner). He went on describing till a reward was mentioned for their urine and dung. And if they pranced a course or two, there would be recorded a reward for every pace that they covered. As for one for whom they are a covering, he is the man who rears them for honour and dignity but does not forget the right of their backs and their stomachs, in plenty and adversity, As regards one for whom they are a burden, he is that who rears them for vainglory and showing off to the people; for him they are, the burden. They said: Messenger of Allah, what about asses? He said: Allah has not revealed to me anything in regards to it except this one comprehensive verse:\" He who does an atom's weight of good will see it, and he who does an atom's weight of evil will see it\" (xcix. 7)",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 30
			}
		}
	]
}