{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"12": "The Book of Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2305,
			"arabicnumber": "94.04",
			"text": "Abu Dharr reported:I went out one night (and found) the Messenger of Allah (ﷺ) walking all alone. There was no man with him. I thought that he did not like anyone walking along with him. So I began to walk in the light of the moon. He, however turned his attention to me and saw me and said: Who is this? I said: It is Abu Dharr. Let Allah make me as ransom for you. He said: Abu Dharr, come on. He (Abu Dharr) said: So I walked along with him for some time and he said: The wealthy persons would have little (reward) on the Day of Resurrection, except upon whom Allah conferred goodness (wealth). He dispensed it to his right, left, in front of him and at his back (just as the wind diffuses fragrance) and did good with it (riches). I went along with him for some time when He said: Sit here. And he made me sit at a safe place and there were stones around it, and he said to me: Sit here till I come to you. He went away on the stony ground till I could not see him. He stayed away from me, and he prolonged his stay. Then I heard him as he came back and he was saying: Even if he committed theft and even if he committed fornication. When he came I could not help asking him: Apostle of Allah, let Allah make me ransom for you, whom were you speaking on the stony ground? I heard nobody responding to you. He (the Holy Prophet) said: It was Gabriel who met me by the side of the stony ground and said: Give glad tidings to your Ummah that he who died without associating ought with Allah would go into Paradise. I said: Gabriel, even if he committed theft and fornication? He said: Yes. I said: Even it he committed theft and fornication? He said: Yes, I again said: Even if he committed theft and fornication? He said: Yes, even if he drank wine",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 42
			}
		}
	]
}