{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"12": "The Book of Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2452,
			"arabicnumber": "1064.02",
			"text": "Abu Said al-Khudri reported:'Ali b. Abu Talib sent to the Messenger of Allah (ﷺ) from Yemen some gold alloyed with clay in a leather bag dyed in the leaves of Mimosa flava. He distributed it among four men. 'Uyaina b. Hisna, Aqra' b. Habis and Zaid al-Khail, and the fourth one was either Alqama b. 'Ulatha or 'Amir b. Tufail. A person from among his (Prophet's) Companions said: We had a better claim to this (wealth) than these (persons). This (remark) reached the Messenger of Allah (ﷺ) upon which he said: Will you not trust me, whereas I am a trustee of Him Who is in the heaven? The news come to me from the heaven morning and evening. Then there stood up a person with deep sunken eyes, prominent cheek bones, and elevated forehead, thick beard, shaven head, tucked up loincloth, and he said: Messenger of Allah, fear Allah. He (the Holy Prophet) said: Woe to thee. Do I not deserve most to fear Allah amongst the people of the earth? That man then returned. Khalid b. Walid then said: Messenger of Allah, should I not strike his neck? Upon this he (the Holy Prophet) said: Perhaps he may be observing the prayer. Khalid said: How many observers of prayer are there who profess with their tongue what is not in their heart? Upon this the Messenger of Allah (ﷺ) said: I have not been commanded to pierce through the hearts of people, nor to split their bellies (insides). He again looked at him and he was going back. Upon this he (the Holy Prophet) said: There would arise a people from the progeny of this (man) who would recite the Qur'an glibly, but it would not go beyond their throats; they would (hurriedly) pass through (the teachings of their) religion just as the arrow passes through the prey. I conceive that he (the Holy Prophet) also said this: If I find them I would certainly kill them as were killed the (people of) Thamud",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 189
			}
		}
	]
}