{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"15": "The Book of Pilgrimage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2919,
			"arabicnumber": "1211.10",
			"text": "A'isha (Allah be pleased with her) reported:We went with the Messenger of Allah (ﷺ) with no other aim but that of Hajj till we came (to the place known as) Sarif; and there I entered in the state of menses. The Messenger of Allah (ﷺ) came to me while I was weeping. He said: What makes you weep? I said: Would that I had not come (for Pilgrimage) this year. He (the Holy Prophet) said: What has happened to you? You have perhaps entered the period of menses. I said: Yes. He said: This is what has been ordained for the daughters of Adam. Do what a pilgrim does except that you should not circumambulate the House, till you are purified (of the menses). She ('A'isha) said: When I came to Mecca, the Messenger of Allah (ﷺ) said to his companions: Make this (Ihram) the Ihram for 'Umra. So the people put off Ihram except those who had sacrificial animals with them. She ('A'isha) said: The Apostle of Allah (ﷺ) had the sacrificial animal with him, and so had Abu Bakr, 'Umar and other persons of means. They (those who had put off Ihram again) put on Ihram (for Hajj) when they marched (towards Mina), and it was the 8th of Dhu'l-Hijja. She ('A'isha) said: When it was the day of sacrifice (10th of Dhu'l-Hijja), I was purified, and the Messenger of Allah (ﷺ) commanded me and I did the circumambulation of Ifada. She said that the flesh of cow was sent to us. I said: What is it? They said: The Messenger of Allah (ﷺ) has offered a cow as sacrifice on behalf of his wives. When it was the night at Hasba, I said: Messenger of Allah, people are coming back from Hajj and Umra, where as I am coming back from Hajj (alone). She (A'isha) reported: He (the Holy Prophet) commanded\" Abd al-Rahman b. Abu Bakr to mount me upon his camel behind him. She ('A'isha) said: I was very young and I well remember that I dozed off and my face touched the hind part of the haudaj (camel litter) till we came to Tan'im, and entered into the state of Ihram in lieu of Umra (which I for the time being abandoned) and which the people had performed",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 128
			}
		}
	]
}