{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"15": "The Book of Pilgrimage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2937,
			"arabicnumber": "1213.01",
			"text": "Jabir (Allah be pleased with him) said:We, in the state of lhram, came with the Messenger of Allah (ﷺ) for Hajj Mufrad (with the aim of Hajj only), and 'A'isha set out for Umra, and when we reached Sarif, she (Hadrat A'isha) entered in the state of monthly period; we proceeded on till we reached (Mecca) and circumambulated the Ka'ba and ran between (al-Safa) and al-Marwa; and the Messenger of Allah (ﷺ) commanded that one who amongst us had no sacrificial animal with him should put off Ihram. We said: What does this \"putting off\" imply? He said: Getting out completely from the state of lhram, (so we put off Ihram), and we turned to our wives and applied perfume and put on our clothes. and we were at a four night's distance from 'Arafa. And we again put on Ihram on the day of Tarwiya (8th of Dhu'l-Hijja). The Messenger of Allah (ﷺ) came to 'A'isha (Allah be pleased with her) and found her weeping, and said: What is the matter with you? She said: The matter is that I have entered in the monthly period, and the people had put off lhram, but I did not and I did not circumambulate the House, and the people are going for Hajj now (but I can't go), whereupon he said: It is the matter which Allah has ordained for the daughters of Adam, so now take a bath and put on Ihram for Hajj. She ('A'isha) did accordingly, and stayed at the places of staying till the monthly period was over. She then circumambulated the House, and (ran between) al-Safa and al-Marwa. He (the Holy Prophet) then said: Now both your Hajj and 'Umra are complete, whereupon she said: I feel in my mind that I did not circumambulate the House till I performed Hajj (I missed the circumambulation of 'Umra). Thereupon he (Allah's Apostle) said: 'Abd al-Rahman, take her to Tan'im (so as to enable her) to perform Umra (separately), and it was the night at Hasba",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 146
			}
		}
	]
}