{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 329,
			"arabicnumber": "125",
			"text": "It is reported on the authority of Abu Huraira that when it was revealed to the Messenger of Allah (ﷺ):To Allah belongs whatever is in the heavens and whatever is in the earth and whether you disclose that which is in your mind or conceal it, Allah will call you to account according to it. Then He forgives whom He pleases and chastises whom He Pleases; and Allah is over everything Potent\" (ii. 284). the Companions of the Messenger of Allah (ﷺ) felt it hard and severe and they came to the Messenger of Allah (ﷺ) and sat down on their knees and said: Messenger of Allah, we were assigned some duties which were within our power to perform, such as prayer, fasting, struggling (in the cause of Allah), charity. Then this (the above-mentioned) verse was revealed unto you and it is beyond our power to live up to it. The Messenger of Allah (ﷺ) said: Do you intend to say what the people of two books (Jews and Christians) said before you:\" We hear and disobey\"? You should rather say:\" We hear and we obey, (we seek) Thy forgiveness, our Lord! and unto Thee is the return.\" And they said:\" We hear and we obey, (we seek) Thy forgiveness, Our Lord! and unto Thee is the return.\" When the people recited it and it smoothly flowed on their tongues, then Allah revealed immediately afterwards:\" The Apostle believes in that which is sent down unto him from his Lord, and so do the believers. Each one believes in Allah and His Angels and His Books and His Apostles, saying: We differentiate not between any of His Apostles and they say: We hearken and we obey: (we seek) Thy forgiveness, our Lord! and unto Thee is the return\" (ii. 285). When they did that, Allah abrogated this (verse) and the Great, Majestic Allah revealed:\" Allah burdens not a soul beyond its capacity. It gets every good that it earns and it suffers every ill that it earns. Our Lord, punish us not if we forget or make a mistake.\" (The Prophet said: ) Yes, our Lord! do not lay on us a burden as Thou didst lay on those before us. (The Prophet said: ) Yes, our Lord, impose not on us (burdens) which we have not the strength to bear (The Prophet said: ) Yes, and pardon us and grant us protection! and have mercy on us. Thou art our Patron, so grant us victory over the disbelieving people\" (ii. 286). He (the Lord) said: Yes",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 236
			}
		}
	]
}