{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"15": "The Book of Pilgrimage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3336,
			"arabicnumber": "1374.01",
			"text": "Abu Sa'id Maula al-Mahri reported that they were hard pressed by the distress and hardship of Medina, and he come to AbU Sa'Id al-Khudri and said to him:I have a large family (to support) and we are enduring hardships; I have, therefore, made up my mind to take my family to some fertile land. Thereupon Abu Sa'id said: Don't do that, stick to Medina, for we have come out with Allah's Apostle (ﷺ), and (I think that he also said) until we reached 'Usfan, and he (the Prophet along with his Companions) stayed there for some nights. There the people said: By Allah, we are lying here idle, whereas our children are unprotected behind us, and we do not feel secure about them. This (apprehension of theirs) reached Allah's Apostle (ﷺ), whereupon he said: What is this matter concerning you that has reached me? (I do not retain how he said it, whether he said like this: ) By Him (in the name of Whom) I take oath, (or he said like this: ) By Him in Whose Hand is my life, I made up my mind or if you like (I do not retain what word did he actually say), I should command my camel to proceed and not to let it halt until it comes to Medina and then said: Ibrahim declared Mecca as the sacred territory and it became sacred, and I declare Medina as the sacred territory-the area between the two mountains ('Air and Uhud). Thus no blood is to be shed within its (bounds) and no weapon is to be carried for fighting, and the leaves of the trees there should not be beaten off except for fodder. O Allah, bless us in our city; O Allah, bless us in our sil; O Allah, bless us in our mudd; O Allah, bless us in our sa; O Allah, bless us in our mudd. O Allah, bless us in our city. O Allah, bless with this blessing two more blessings. By Him in Whose Hand is my life, there is no ravine or mountain path of Medina which is not protected by two angels until you reach there. (He then said to the people: ) Proceed, and we, therefore, proceeded and we came to Medina By Him (in Whose name) we take oath and (in Whose name) oath is taken (Hammad is in doubt about it), we had hardly put down our camel saddles on arriving at Medina that we were attacked by the people of the tribe of 'Abdullah b. Ghatafan but none dared to do it before",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 540
			}
		}
	]
}