{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"16": "The Book of Marriage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3497,
			"arabicnumber": "1365.03",
			"text": "Anas (Allah be pleased with him) reported that Allah's Messenger (ﷺ) set out on an expedition to Khaibar and we observed our morning prayer in early hours of the dawn. The Messenger of Allah (ﷺ) then mounted and so did Abu Talha ride, and I was seating myself behind Abu Talha. Allah's Apostle (ﷺ) moved in the narrow street of Khaibar (and we rode so close to each other in the street) that my knee touched the leg of Allah's Apostle (ﷺ). (A part of the) lower garment of Allah's Apostle (ﷺ) slipped from his leg and I could see the whiteness of the leg of Allah's Apostle (ﷺ). As he entered the habitation he called:Allahu Akbar (Allah is the Greatest). Khaibar is ruined. And when we get down in the valley of a people evil is the morning of the warned ones. He repeated it thrice. In the meanwhile the people went out for their work, and said: By Allah, Muhammad (has come). Abd al-'Aziz or some of our companions said: Muhammad and the army (have come). He said: We took it (the territory of Khaibar) by force, and there were gathered the prisoners of war. There came Dihya and he said: Messenger of Allah, bestow upon me a girl from among the prisoners. He said: Go and get any girl. He made a choice for Safiyya daughter of Huyayy (b. Akhtab). There came a person to Allah's Apostle (ﷺ) and said: Apostle of Allah, you have bestowed Safiyya bint Huyayy, the chief of Quraiza and al-Nadir, upon Dihya and she is worthy of you only. He said: Call him along with her. So he came along with her. When Allah's Apostle (ﷺ) saw her he said: Take any other woman from among the prisoners. He (the narrator) said: He (the Holy Prophet) then granted her emancipation and married her. Thabit said to him: Abu Hamza, how much dower did he (the Holy Prophet) give to her? He said: He granted her freedom and then married her. On the way Umm Sulaim embellished her and then sent her to him (the Holy Prophet) at night. Allah's Apostle (ﷺ) appeared as a bridegroom in the morning. He (the Holy Prophet) said: He who has anything (to eat) should bring that. Then the cloth was spread. A person came with cheese, another came with dates, and still another came with refined butter, and they prepared hais and that was the wedding feast of Allah's Messenger (ﷺ)",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 99
			}
		}
	]
}