{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 369,
			"arabicnumber": "144.01",
			"text": "It is narrated on the authority of Hudhaifa:We were sitting in the company of Umar and he said: Who amongst you has heard the Messenger of Allah (ﷺ) talking about the turmoil? Some people said: It is we who heard it. Upon this be remarked: Perhaps by turmoil you presume the unrest of man in regard to his household or neighbour, they replied: Yes. He ('Umar) observed: Such (an unrest) would be done away with by prayer, fasting and charity. But who amongst you has heard from the Apostle (ﷺ) describing that turmoil which would come like the wave of the ocean. Hudhaifa said: The people hushed into silence, I replied: It is I. He ('Umar) said: Ye, well, your father was also very pious. Hudhaifa said: I heard the Messenger of Allah (may peace be, upon him ) observing: Temptations will be presented to men's hearts as reed mat is woven stick by stick and any heart which is impregnated by them will have a black mark put into it, but any heart which rejects them will have a white mark put in it. The result is that there will become two types of hearts: one white like a white stone which will not be harmed by any turmoil or temptation, so long as the heavens and the earth endure; and the other black and dust-coloured like a vessel which is upset, not recognizing what is good or rejecting what is abominable, but being impregnated with passion. Hudhaifa said: I narrated to him ('Umar): There is between you and that (turmoil) a closed door, but there is every likelihood of its being broken. 'Umar said: Would it be broken? You have, been rendered fatherless. Had it been opened, it would have been perhaps closed also. I said: No, it would be broken, and I narrated to him: Verily that door implies a person who would be killed or die. There is no mistake in this hadith. Abu Khalid narrated: I said to Sa'd, O Abu Malik, what do you mean by the term\" Aswad Murbadda\"? He replied: High degree of whiteness in blackness. I said: What is meant by\" Alkoozu Mujakhiyyan\"? He replied: A vessel turned upside down",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 276
			}
		}
	]
}