{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"18": "The Book of Divorce "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3692,
			"arabicnumber": "1479.02",
			"text": "Abdullah b. Abbas (Allah be pleased with tlicm) reported:I intended to ask 'Umar b. al-Khattab (Allah be pleased with him) about a verse, but I waited for one year to ask him out of his fear, until he went out for Pilgrimage and I also accompanied him. As he came back and we were on the way he stepped aside towards an Arak tree to ease himself. I waited for him until he was free. I then walked along with him and said: Commander of the Faithful, who are the two among the wives of Allah's Messenger (ﷺ) who backed up one another (in their demand for extra money)? He said: They were Hafsa and 'A'isha (Allah be pleased with them). I said to him: It is for one year that I intended to ask you about this matter but I could not date so on account of the awe for you. He said: Don't do that. If you think that I have any knowledge, do ask me about that. And if I were to know that, I would inform you. He (the narrator) stated that 'Umar had said: By Allah, during the days of ignorance we had no regard for women until Allah the Exalt- ed revealed about them what He has revealed, and appointed (turn) for them what he appointed. He said: It so happened that I was thinking about some matter that my wife said: I wish you had done that and that. I said to her: It does not concern you and you should not feel disturbed in a matter which I intend to do. She said to me: How strange is it that you, O son of Khattab, do not like anyone to retort upon you, whereas your daughter retorts upon Allah's Messenger (may peace be upou him) until he spends the day in vexation. 'Umar said: I took hold of my cloak, then came out of my house until I visited Hafsa and said to her: O daughter, (I heard) that you retort upon Allah's Messenger (ﷺ) until he spends the day in vexation, whereupon Hafsa said: By Allah, we do retort upon him. I said: You should bear in mind, my daughter, that I warn you against the punishment of Allah and the wrath of His Messenger (ﷺ). You may not be misled by one whose beauty has fascinated her, and the love of Allah's Messenger (ﷺ) for her. I ('Umar) then visited Umm Salama because of my relationship with her and I talked to her. Umm Salama said to me: Umar b. al-Khattab, how strange is it that you meddle with every matter so much so that you are anxious to interfere between Allah's Messenger (ﷺ) and his wives, and this perturbed me so much that I refrained from saying what I had to say, so I came out of her apartment, and I had a friend from the Anar. When I had been absent (from the company of the Holy Prophet) he used to bring me the news and when he had been absent I used to bring him the news, and at that time we dreaded a king of Ghassan. It was mentioned to us that he intended to attack us, and our minds were haunted by him. My friend, the Ansari, came to me, and he knocked at the door and said: Open it, open it. I said: Has the Ghassani come? He said: (The matter is) more serious than that. The Messenger of Allah (ﷺ) has separated himself from his wives. I said: Let the nose of Hafsa and 'A'isha be besmeared with dust. I then took hold of my cloth and went out until I came and found Allah's Messenger (ﷺ) in his attic to which he climbed by means of a ladder made of date-palm, and the servant of Allah's Messenger (ﷺ) who was black had been sitting at the end of the ladder. I said: This is Umar. So permission was granted to me. I narrated this news to Allah's Messenger (ﷺ) and as I narrated the news concerning Umm Salama, Allah's Messenger (ﷺ) smiled. He was lying on the mat and there was nothing between him and that (mat), and under his head there was a pillow made of leather and it was stuffed with plam fibres and at his feet were lying a heap of sant tree (acacia niloctica, meant for dyeing) and near his head there was hanging a hide. And I saw the marks of the maton the side of Allah's Messenger (ﷺ), and so I wept. He said: What makes you weep? I said: Messenger of Allah, the Khusrau and the Ceasars (spendd their lives in) the midst of (luxuries), whereas you being Allah's Messenger (are leading your life in this poverty). Thereupon Allah's Messenger (ﷺ) said: Don't you like that they should have riches of their world, and you have the Hereafter",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 41
			}
		}
	]
}