{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 411,
			"arabicnumber": "162.01",
			"text": "It is narrated on the authority of Anas b. Malik that the Messenger of Allah (ﷺ) said:I was brought al-Buraq Who is an animal white and long, larger than a donkey but smaller than a mule, who would place his hoof a distance equal to the range of version. I mounted it and came to the Temple (Bait Maqdis in Jerusalem), then tethered it to the ring used by the prophets. I entered the mosque and prayed two rak'ahs in it, and then came out and Gabriel brought me a vessel of wine and a vessel of milk. I chose the milk, and Gabriel said: You have chosen the natural thing. Then he took me to heaven. Gabriel then asked the (gate of heaven) to be opened and he was asked who he was. He replied: Gabriel. He was again asked: Who is with you? He (Gabriel) said: Muhammad. It was said: Has he been sent for? Gabriel replied: He has indeed been sent for. And (the door of the heaven) was opened for us and lo! we saw Adam. He welcomed me and prayed for my good. Then we ascended to the second heaven. Gabriel (peace be upon him) (asked the door of heaven to be opened), and he was asked who he was. He answered: Gabriel; and was again asked: Who is with you? He replied: Muhammad. It was said: Has he been sent for? He replied: He has indeed been sent for. The gate was opened. When I entered 'Isa b. Maryam and Yahya b. Zakariya (peace be upon both of them), cousins from the maternal side. welcomed me and prayed for my good Then I was taken to the third heaven and Gabriel asked for the opening (of the door). He was asked: Who are you? He replied: Gabriel. He was (again) asked: Who is with you? He replied Muhammad (ﷺ). It was said: Has he been sent for? He replied He has indeed been sent for. (The gate) was opened for us and I saw Yusuf (peace of Allah be upon him) who had been given half of (world) beauty. He welcomed me prayed for my well-being. Then he ascended with us to the fourth heaven. Gabriel (peace be upon him) asked for the (gate) to be opened, and it was said: Who is he? He replied: Gabriel. It was (again) said: Who is with you? He said: Muhammad. It was said: Has he been sent for? He replied: He has indeed been sent for. The (gate) was opened for us, and lo! Idris was there. He welcomed me and prayed for my well-being (About him) Allah, the Exalted and the Glorious, has said:\" We elevated him (Idris) to the exalted position\" (Qur'an xix. 57). Then he ascended with us to the fifth heaven and Gabriel asked for the (gate) to be opened. It was said: Who is he? He replied Gabriel. It was (again) said: Who is with thee? He replied: Muhammad. It was said Has he been sent for? He replied: He has indeed been sent for. (The gate) was opened for us and then I was with Harun (Aaron-peace of Allah be upon him). He welcomed me prayed for my well-being. Then I was taken to the sixth heaven. Gabriel (peace be upon him) asked for the door to be opened. It was said: Who is he? He replied: Gabriel. It was said: Who is with thee? He replied: Muhammad. It was said: Has he been sent for? He replied: He has indeed been sent for. (The gate) was opened for us and there I was with Musa (Moses peace be upon him) He welcomed me and prayed for my well-being. Then I was taken up to the seventh heaven. Gabriel asked the (gate) to be opened. It was said: Who is he? He said: Gabriel It was said. Who is with thee? He replied: Muhammad (may peace be upon him.) It was said: Has he been sent for? He replied: He has indeed been sent for. (The gate) was opened for us and there I found Ibrahim (Abraham peace be upon him) reclining against the Bait-ul-Ma'mur and there enter into it seventy thousand angels every day, never to visit (this place) again. Then I was taken to Sidrat-ul-Muntaha whose leaves were like elephant ears and its fruit like big earthenware vessels. And when it was covered by the Command of Allah, it underwent such a change that none amongst the creation has the power to praise its beauty. Then Allah revealed to me a revelation and He made obligatory for me fifty prayers every day and night. Then I went down to Moses (peace be upon him) and he said: What has your Lord enjoined upon your Ummah? I said: Fifty prayers. He said: Return to thy Lord and beg for reduction (in the number of prayers), for your community shallnot be able to bear this burden. as I have put to test the children of Isra'il and tried them (and found them too weak to bear such a heavy burden). He (the Holy Prophet) said: I went back to my Lord and said: My Lord, make things lighter for my Ummah. (The Lord) reduced five prayers for me. I went down to Moses and said. (The Lord) reduced five (prayers) for me, He said: Verily thy Ummah shall not be able to bear this burden; return to thy Lord and ask Him to make things lighter. I then kept going back and forth between my Lord Blessed and Exalted and Moses, till He said: There are five prayers every day and night. O Muhammad, each being credited as ten, so that makes fifty prayers. He who intends to do a good deed and does not do it will have a good deed recorded for him; and if he does it, it will be recorded for him as ten; whereas he who intends to do an evil deed and does not do, it will not be recorded for him; and if he does it, only one evil deed will be recorded. I then came down and when I came to Moses and informed him, he said: Go back to thy Lord and ask Him to make things lighter. Upon this the Messenger of Allah remarked: I returned to my Lord until I felt ashamed before Him",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 316
			}
		}
	]
}