{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 415,
			"arabicnumber": "163",
			"text": "Anas b. Malik reported:Abu Dharr used to relate that the Messenger of Allah (ﷺ) said: The roof of my house was cleft when I was in Mecca and Gabriel descended and opened my heart and then washed it with the water of Zamzam. He then brought a gold basin full of wisdom and faith and after emptying it into my breast, he closed it up. Then taking me by he hand, he ascended with me to th heaven, and when we came to the lowest heaven, Gabriel said to the guardian of the lowest heaven: Open. He asked who was there? He replied. It is Gabriel. He again asked whe he there was someone with him. He replied: Yes, it is Muhammad with me. He was asked if he had been sent for, He (Gabriel) said: Yes. Then he opened (the gate). When we ascended the lowest heaven (I saw) a man seated with parties on his right side and parties on his left side. When he looked up to his right, he laughed and when he looked to his left, he wept. He said: Welcome to the righteous apostle and the righteous son. I asked Gabriel who he was and he replied: He is Adam (peace be upon him) and these parties on his right and on his left are the souls of his descendants. Those of them on his right are the inmates of Paradise and the parties which are on his left side are the inmates of Hell; so when he looked towards his right side, he laughed, and when he looked towards his left side, he wept. Then Gabriel ascended with me to the second heaven. He asked its guardian to open (its gate), and its guardian replied in the same way as the guardian of the lowest heaven had said. He (opened it). Anas b. Malik said: He (the Holy Prophet) mentioned that he found in the heavens Adam, Idris, Jesus, Moses and Abraham (may peace be on all of them), but he did not ascertain as to the nature of their abodes except that he had found Adam in the lowest heaven and Abraham in the sixth heaven. When Gabriel and the Messenger of Allah (ﷺ) passed by Idris (peace be upon him) he said: Welcome to the righteous apostle and righteous brother. He (the narrator) said: He then proceeded and said: Who is he? Gabriel replied: It is Idris. Then I passed by Moses (peace be upon him) and he said: Welcome tothe righteous apostle and righteous brother. I said to (Gabriel): Who is he? He replied: It is Moses. Then I passed by Jesus and he said: Welcome to the righteous apostle and righteous brother. I said (to Gabriel): Who is he? He replied: Jesus, son of Mary. He (the Holy Prophet) said: Then I went to Ibrahim (peace be upon him). He said: Welcome to the righteous apostle and righteous son. I asked: Who is he? He (Gabriel) replied: It is Abraham. Ibn Shihab said: Ibn Hazm told me that Ibn 'Abbas and Abd Habba al-Ansari used to say that the Messenger of Allah (ﷺ) said: Thereafter he ascended with me till I was taken to such a height where I heard the scraping of the pens. Ibn Hazm and Anas told that the Messenger of Allah (ﷺ) said: Allah then made fifty prayers obligatory for my Ummah and I returned with that and passed by Moses. Moses, (peace be upon him) said: What has thy Lord enjoined on thy people? I said: Fifty prayers have been made obligatory on them. Moses (peace be upon him) said: Return to thy Lord, for thy Ummah would not be able to bear this burden. Then I came back to my Lord and He remitted a portion out of thut. I then again went to Moses (peace be upon him) and informed him about it He said: Return to thy Lord, for thy Ummah shall not be able to bear this burden. I then went back to my Lord and He said: They are five and at the same time fifty, and what has been said will not be changed. I then returned to Moses and he said: Go back to thy Lord. whereupon I said: I feel ashamed of my Lord. Gabriel then travelled with me till we came to the farthest lote-tree Many a colour had covered it which I do not know. Then I was admitted to Paradise and saw in it domes of pearls, and its soil of musk",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 320
			}
		}
	]
}