{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"27": "The Book of Oaths"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4264,
			"arabicnumber": "1649.02",
			"text": "Abu Musa reported:My friends sent me to Allah's Messenger (ﷺ) asking him to provide them with mounts as they were going along with him in jaish al-'Usrah (the army of destitutes or of meagre means or army setting out during the hard times and that is the occasion of the expedition of Tabuk) I said: Apostle of Allah, my friends have sent me to you so that you may provide them with mounts. He (the Holy Prophet) said: By Allah, I cannot provide you with anything to ride. And it so happened that he was at that time much perturbed. I little knew of it, so I came back with a heavy heart on account of the refusal of Allah's Messenger (ﷺ), and the fear that Allah's Messenger (ﷺ) might have some feelings against me. I returned to my friends and informed them about what Allah's Messenger (ﷺ) had said. I had hardly stayed for a little that I heard Bilal calling: 'Abdullah b. Qais. I responded to his call. He said: Hasten to Allah's Messenger (ﷺ), he is calling you, When I came to the Prophet (ﷺ) he said: Take this pair, this pair, and this pair (i. e. six camels which he had bought from Sa'd), and take them to y, our friends and say: Verily Allah (or he said: Verily Allah's Messenger (ﷺ) has provided you with these animals. So ride upon them. Abu Musa said: I went along with them to my friends and said: Verily Allah's messenger (ﷺ) has provided you with these animals for riding; but by Allah, I shall not leave you until some of you go along with me to him who had heard the talk of Allah's Messenger (ﷺ) then I asked him for you, and his refusal for the first time, and then his granting them to me subsequently; so you should not think that I narrated to you something which he did not say. They said to me: By Allah, in our opinion you are certainly truthful, and we would do as you like. So Abu Musa went along withsome of the menfrom them until they came to those who had heard the words of Allah's Messenger (may, peace be upon him) and his refusal to (provide) them with (animals) ; and subsequently his granting (the animals) to them; and they narrated to them exactly as Abu Masa had narrated to them",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 11
			}
		}
	]
}