{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"28": "The Book of Oaths, Muharibin, Qasas (Retaliation), and Diyat (Blood Money)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4383,
			"arabicnumber": "1679.01",
			"text": "Abu Bakra reported that (in the Farewell Address) Allah's Apostle (ﷺ) said:Time has completed a cycle and come to the state of the day when Allah created the heavens and the earth. The year is constituted of twelve months, of which four are sacred; three of them consecutive, viz. Dhu'l-Qa'da, Dhu'l- Hijja and Muharram, and also Rajab the month of Mudar which comes between Jumada and Sha'ban. He (the Holy Prophet) then said: which month is this? We said Allah and His Messenger know best. He (the narrator) said: He (the Holy Prophet) remained silent for some time until we thought that he would give it a name other than that (by which it was known). He said: Is it not Dha'l-Hijja? We said: Yes. He (the Holy Prophet) said: Which city is this? We said: Allah and His Messenger know best. He (the Holy Prophety remained silent until we thought that he would give it another name. He (the Holy Prophet) said: Is it not the Balda (the city of Mecca)? We said: Yes. He said: What day is this? We said: Allah and His Messenger know best. He (the Holy Prophet) remained silent until we thought that he would give it another name. He said: Is it not the Day of Sacrifice? We said: Allah's Messenger. yes. Thereupon he said: Your blood, your property (Muhammad, one of the narrators, said: I think, he also said this) and your honour are sacred to you like the sacredness of this day of yours, in this city of yours, and in this month of yours. You will soon meet your Lord and He will ask you about your deeds. So do not turn after me unbelievers (or misguided), some of you striking the necks of the others. Behold I let him who is present convey to him who is absent, for many a one whom a message is conveyed has a more retentive memory than one who hears. He again said: Behold! have I not delivered (the message) to you? This hadith has been narrated through another chain of transmitters, but with a slight variation of words",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 42
			}
		}
	]
}