{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 439,
			"arabicnumber": "177.01",
			"text": "It is narrated on the authority of Masruq that he said:I was resting at (the house of) 'A'isha that she said: O Abu 'A'isha (kunya of Masruq), there are three things, and he who affirmed even one of them fabricated the greatest lie against Allah. I asked that they were. She said: He who presumed that Muhammad (ﷺ) saw his Lord (with his ocular vision) fabricated the greatest lie against Allah. I was reclining but then sat up and said: Mother of the Faithful, wait a bit and do not be in a haste. Has not Allah (Mighty and Majestic) said:\" And truly he saw him on the clear horizon\" (Al-Qur'an, Surat at-Takwir, 81:23) and\" he saw Him in another descent\" (Al-Qur'an, Surat Najm 53:13)? She said: I am the first of this Ummah who asked the Messenger of Allah (ﷺ) about it, and he said: Verily he is Gabriel. I have never seen him in his original form in which he was created except on those two occasions (to which these verses refer); I saw him descending from the heaven and filling (the space) from the sky to the earth with the greatness of his bodily structure. She said: Have you not heard Allah saying: \"Eyes comprehend Him not, but He comprehends (all) vision. and He is Subtle, and All-Aware\" (Al-Qur'an, Surat al-An`am 6:103)? (She, i.e. 'A'isha, further said): Have you not heard that, verily, Allah says: \"And it is not for any human being that Allah should speak to him except by revelation or from behind a partition or that He sends a messenger to reveal, by His permission, what He wills. Indeed, He is Most High and Wise.\" (Al-Qur'an, Surat ash-Shura, 42:51) She said: He who presumes that the Messenger of Allah (ﷺ) concealed anything from the Book of Allah fabricates the greatest lie against Allah. Allah says: \"O Messenger, announce that which has been revealed to you from your Lord, and if you do not, then you have not conveyed His message. And Allah will protect you from the people. Indeed, Allah does not guide the disbelieving people.\" (Al-Qur'an, Surat al-Ma'idah, 5:67). She said: He who presumes that he would inform about what was going to happen tomorrow fabricates the greatest lie against Allah. And Allah says \"Say, 'None in the heavens and earth knows the unseen except Allah , and they do not perceive when they will be resurrected.'\" (Al-Qur'an, Surat an-Naml, 27:65)",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 344
			}
		}
	]
}