{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4580,
			"arabicnumber": "1759.01",
			"text": "It is narrated on the authority of Urwa b. Zubair who narrated from A'isha that she informed him that Fatima, daughter of the Messenger of Allah (ﷺ), sent someone to Abu Bakr to demand from him her share of the legacy left by the Messenger of Allah (ﷺ) from what Allah had bestowed upon him at Medina and Fadak and what was left from one-filth of the income (annually received) from Khaibar. Abu Bakr said:The Messenger of Allah (ﷺ) said:\" We (prophets) do not have any heirs; what we leave behind is (to be given in) charity.\" The household of the Messenger of Allah (ﷺ) will live on the income from these properties, but, by Allah, I will not change the charity of the Messenger of Allah (ﷺ) from the condition in which it was in his own time. I will do the same with it as the Messenger of Allah (may peace be upun him) himself used to do. So Abu Bakr refused to hand over anything from it to Fatima who got angry with Abu Bakr for this reason. She forsook him and did not talk to him until the end of her life. She lived for six months after the death of the Messenger of Allah (ﷺ). When she died, her husband. 'Ali b. Abu Talib, buried her at night. He did not inform Abu Bakr about her death and offered the funeral prayer over her himself. During the lifetime of Fatima, 'All received (special) regard from the people. After she had died, he felt estrangement in the faces of the people towards him. So he sought to make peace with Abu Bakr and offer his allegiance to him. He had not yet owed allegiance to him as Caliph during these months. He sent a person to Abu Bakr requesting him to visit him unaccompanied by anyone (disapproving the presence of Umar). 'Umar said to Abu Bakr: BY Allah, you will not visit them alone. Abu Bakr said: What will they do to me? By Allah, I will visit them. And he did pay them a visit alone. 'All recited Tashahhud (as it is done in the beginning of a religious sermon) ; then said: We recognise your moral excellence and what Allah has bestowed upon you. We do not envy the favour (i. e. the Catiphate) which Allah nas conferred upon you; but you have done it (assumed the position of Caliph) alone (without consulting us), and we thought we had a right (to be consulted) on account of our kinship with the Messenger of Allah (ﷺ). He continued to talk to Abu Bakr (in this vein) until the latter's eyes welled up with tears. Then Abd Bakr spoke and said: By Allah, in Whose Hand is my life, the kinship of the Messenger of Allah (ﷺ) is dearer to me than the kinship of my own people. As regards the dispute that has arisen between you and me about these properties, I have not deviated from the right course and I have not given up doing about them what the Messenger of Allah (ﷺ) used to do. So 'Ali said to Abu Bakr: This aftetnoon is (fixed) for (swearing) allegiance (to you). So when Abu Bakr had finished his Zuhr prayer, he ascended the pulpit and recited Tashahhud, and described the status of 'Ali, his delay in swearing allegiance and the excuse which lie had offered to him (for this delay). (After this) he asked for God's forgiveness. Then 'Ali b. Abu Talib recited the Tashahhud. extolled the merits of Abu Bakr and (said that) his action was nott prompted by any jealousy of Abu Bakr on his part or his refusal to accept the high position which Allah had conferred upon him, (adding: ) But we were of the opinion that we should have a share in the government, but the matter had been decided without taking us into confidence, and this displeased us. (Hence the delay in offering allegiance. The Muslims were pleased with this (explanation) and they said: You have done the right thing. The Muslims were (again) favourably inclined to 'Ali since he adopted the proper course of action",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 61
			}
		}
	]
}