{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 463,
			"arabicnumber": "187",
			"text": "Ibn Mas'ud reported:Verily the Messenger of Allah said: The last to enter Paradise would be a man who would walk once and stumble once and be burnt by the Fire once. Then when he gets beyond it, he will turn to it and say: Blessed is He Who has saved me from thee. Allah has given me something He has not given to any one of those in earlier or later times. Then a tree would be raised up for him and he will say: O my Lord I bring me near this tree so that I may take shelter in its shade and drink of its water. Allah, the Exalted and Great, would say: O son of Adam, if I grant you this, you will ask Me for something else. He would say: No. my Lord. And he would promise Him that he would not ask for anything else. His Lord would excuse him because He sees what he cannot help desiring; so He would bring him near it, and he would take shelter in its shade and drink of its water. Afterwards a tree more beautiful than the first would be raised up before him and he would say: O my Lord! bring me near this tree in order that I may drink of its water and take shelter in its shade and I shall not ask Thee for anything else. He (Allah) would say: O son of Adam, if I bring you near it you may ask me for something else. He would promise Him that he would not ask for anything else. His Lord will excuse him because He would see something he cannot help desiring. So He would bring him near it and he would enjoy its shade and drink its water. Then a tree would be raised up for him at the gate of the Paradise, more beautiful than the first two. He would say: O my Lord! bring me near this (tree) so that I may enjoy its shade and drink from its water. I shall not ask Thee for anything else. He (Allah) would say: O son of Adam! did you not promise Me that you would not ask Me anything else? He would say: Yes, my Lord, but I shall not ask Thee for anything else. His Lord would excuse him for He sees something the temptation of which he could not resist. He (Allah) would bring him near to it, and when He would bring him near it he would hear the voices of the inhabitants of the Paradise. He would say: O my Lord! admit me to it. He (Allah) would say: O son of Adam, what will bring an end to your requests to Me? Will it please you if I give you the whole world and a like one along with it? He will say: O my Lord! art Thou mocking at me, though Thou art the Lord of the worlds? Ibn Mas'ud laughed and asked (the hearers): Why don't you ask me what I am laughing at. They (then) said: Why do you laugh? He said: It is in this way that the Messenger of Allah (ﷺ) laughed. They (the companions of the Holy Prophet) asked: Why do you laugh. Messenger of Allah? He said: On account of the laugh of the Lord of the universe, when he ldesirer of Paradise) sai Thou mocking at me though Thou art the Lord of the worlds? He would say: I am not mocking at you, but I have power to do whatever I will",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 368
			}
		}
	]
}