{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4649,
			"arabicnumber": "1794.01",
			"text": "It has been narrated on the authority of Ibn Mas'ud who said:While the Messenger of Allah (ﷺ) was saying his prayer near the Ka'ba and Abu Jahl with his companions was sitting (near by), Abu Jahl said, referring to the she-camel that had been slaughtered the previous day: Who will rise to fetch the foetus of the she-camel of so and so, and place it between the shoulders of Muhammad when he goes down in prostration (a posture in prayer). The one most accursed among the people got up, brought the foetus and, when the Prophet (ﷺ) went down in prostration, placed it between his shoulders. Then they laughed at him and some of them leaned upon the others with laughter. And I stood looking. If I had the power, I would have thrown it away from the back of the Messenger of Allah (ﷺ). The Prophet (ﷺ) had bent down his head in prostration and did not raise it, until a man went (to his house) and informed (his daughter) Fatima, who was a young girl (at that time) (about this ugly incident). She came and removed (the filthy thing) from him. Then she turned towards them rebuking them (the mischief-mongers). When the Prophet (ﷺ) had finished his prayer, he invoked God's imprecations upon them in a loud voice. When he prayed, he prayed thrice, and when he asked for God's blessings, he asked thrice. Then he said thrice: O Allah, it is for Thee to deal with the Quraish. When they heard his voice, laughter vanished from them and they feared his malediction. Then he said: O God, it is for Thee to deal with Abu Jahl b. Hisham, 'Utba b. Rabi'a, Shaiba b. Rabi'a. Walid b. Uqba, Umayya b. Khalaf, Uqba b. Abu Mu'ait (and he mentioned the name of the seventh person. which I did not remember). By One Who sent Muhammad with truth, I saw (all) those he had named lying slain on the Day of Badr. Their dead bodies were dragged to be thrown into a pit near the battlefield. Abu Ishiq had said that the name of Walid b. 'Uqba has been wrongly mentioned in this tradition",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 131
			}
		}
	]
}