{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4668,
			"arabicnumber": "1802.01",
			"text": "It has been narrated on the authority of Salama b. al-Akwa' who said:We marched upon Khaibar with the Messenger of Allah (ﷺ). We journeyed during the night. One of the people said to (my brother) 'Amir b. al-Akwa': Won't you recite to us some of your verses? Amir was a poet. So he began to chant his verses to urge the camels, reciting: O God, if Thou hadst not guided us We would have neither been guided rightly nor practised charity, Nor offered prayers. We wish to lay down our lives for Thee; so forgive Thou our lapses, And keep us steadfast when we encounter (our enemies). Bestow upon us peace and tranquillity. Behold, when with a cry they called upon us to help. The Messenger of Allah (ﷺ) said: Who is this driver (of the camels)? They said: It is 'Amir. He said: God will show mercy to him. A man said: Martyrdom is reserved for him. Messenger of Allah, would that you had allowed us to benefit ourselves from his life. (The narrator says): We reached Khaibar and besieged them, and (we continued the siege) until extreme hunger afflicted us. Then the Messenger of Allah (ﷺ) said: Behold, God has conquered it for you. When it was evening of the day on which the city was conquered. the Muslims lit many fires. The Messenger of Allah (ﷺ) said: What are these fires? And what are they cooking? They said: They are cooking meat. He asked. Which meat? They said: That of domestic asses. He said: Let them throw it away and break the pots (in which it is being cooked). A man said: Or should they throw it away and wash the pots? He said: They may do that. When the people drew themselves up in battle array 'Amir caught hold of his sword that was rather short He drove a Jew before him to strike him with it. (As he struck him), his sword recoiled and struck his own knee, and 'Amir died of the wound. When the people returned (after the conquest of Kliaibar) and he (Salama) had caught hold of my hand, and said: The Messenger of Allah (ﷺ) saw that I was silent (and dejected) ; he said: What's the matter with thee? I said to him: My father and my mother be thy ransom, people presume that 'Amir's sacrifice has been in vain. He asked: Who has said that? I said: So and so and Usaid b. Hudair al-Ansari. He said: Who has said that has lied. For him (for 'Amir) there is a double reward. (He indicated this by putting two of his fingers together.) He was a devotee of God and a warrior fighting for His cause. There will be hardly any Arab who can fight as bravely as he did. Qutaiba has differed in a few words",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 150
			}
		}
	]
}