{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4678,
			"arabicnumber": "1807.01",
			"text": "It has been narrated on the authority of Ibn Salama. He heard the tradition from his father who said:We arrived at Hudaibiya with the Messenger of Allah (ﷺ) and we were fourteen hundred in number. There were fifty goats for them which could not be watered (by the small quantity of water in the local well). So, the Messenger of Allah (ﷺ) sat on the brink of the well. Either he prayed or spat into the well The water welled up. We drank and watered (the beasts as well). Then the Messenger of Allah (ﷺ) called us to take the vow of allegiance, as he was sitting at the base of a tree. I was the first man to take the vow. Then other people took the vow. When half the number of people had done so, he said to me: You take the vow, Salama. I said: I was one of those who took the vow in the first instance. He said: (You may do) again. Then the Messenger. of Allah (ﷺ) saw that I was without weapons. He gave me a big or a small shield. Then he continued to administer vows to the people until it was the last batch of them. He said (to me): Won't you swear allegiance, Salama? I said: Messenger of Allah, I took the oath with the first batch of the people and then again when you were in the middle of the people. He said: (Doesn't matter), you may (do so) again. So I took the oath of allegiance thrice. Then he said to me: Salama, where is the shield which I gave to thee? I said: Messenger of Allah, my uncle 'Amir met me and he was without any weapons. So I gave the shield to him. The Messenger of Allah (ﷺ) laughed and said: You are like a person of the days gone by who said: O God. I seek a friend who is dearer to me than myself. (When all Companions had sworn allegiance to the Holy Prophet), the polytheists sent messages of peace, until people could move from our camp to that of the Meccans and vice versa. Finally, the peace treaty was concluded. I was a dependant of Talha b. Ubaidullah. I watered his horse, rubbed its back. I served Talha (doing odd jobs for him) and partook from his food. I had left my family and my property as an emigrant in the cause of Allah and His Messenger (may peace be uron him). When we and the people of Mecca had concluded a peace treaty and the people of one side began to mix with those of the other, I came to a tree, swept away its thorns and lay down (for rest) at its base; (while I lay there), four of the polytheists from the Meccans came to me and began to talk ill of the Messenger of Allah (ﷺ). I got enraged with them and moved to another tree. They hung their weapons (to the branches of the tree) and lay down (for rest). (While they lay there), somebody from the lower part of the valley cried out: Run up, O Muhajirs! Ibn Zunaim has been murdered. I drew my sword and attacked these four while they were asleep. I seized their arms and collected them up in my hand, and said: By the Being Who has conferred honour upon Muhammad, none of you shall raise his head, else I will smite his face. (Then) I came driving them along to the Prophet (ﷺ). (At the same time). my uncle Amir came (to him) with a man from\" Abalat called Mikraz. Amir was dragging him on a horse with a thick covering on its back along with seventy polytheists. The Messenger of Allah (ﷺ) cast a glance at them and said: Let them go (so that) they may prove guilty of breach of trust more than once (before we take action against them). So the Messenger of Allah (ﷺ) forgave them. On this occasion. God revealed the Qur'anic verse:\" It is He Who restrained their hands from you and your hands from them in the valley of Mecca after He had granted you a victory over them\" (xlviii. 24). Then we moved returning to Medina, and halted at a place where there was a mountain between us and Banu Lihyan who were polytheists. The Messenaer of Allah (ﷺ) asked God's forgiveness for one who ascended the mountain at night to act as a scout for the Messenger of Allah (ﷺ) and his Compinions. I ascended (that mountain) twice or thrice that night. (At last) we reached Medina. The Messenger of Allah (ﷺ) sent his camels with his slave, Rabah, and I was with him. I (also) went to the pasture with the horse of Talha along with the camels. When the day dawned, Abd al-Rahman al-Fazari made a raid and drove away all the camels of the Messenger of Allah (ﷺ), and killed the man who looked after them. I said: Rabah, ride this horse, take it to Talha b. 'Ubaidullah and Inform the Messenger of Allah (ﷺ) that the polytheists have made away with his camels. Then I stood upon a hillock and turning my face to Medina, shouted thrice: Come to our help I Then I set out in pursuit of the raiders, shooting at them with arrows and chanting a (self-eulogatory) verse in the Iambic metre: I am the son of al-Akwa' And today is the day of defeat for the mean. I would overtake a man from them, shoot at him an arrow which, piercing through the saddle, would reach his shoulder. and I would say: Take it, chanting at the same time the verse And I am the son of al-Akwa' And tody is the day of defeat for the mean. By God, I continued shooting at them and hamstringing their animals. Whenever a horseman turned upon me, I would come to a tree and (hid myself) sitting at its base. Then I would shoot at him and hamstring his horse. (At last) they entered a narrow mountain gorge. I ascended that mountain and held them at bay throwing stones at them. I continued to chase them in this way until I got all the camels of the Messenger of Allah (ﷺ) released and no camel was left with them. They left me; then I followed them shooting at them (continually) until they dropped more than thirty mantles and thirty lances. lightening their burden. On everything they dropped, I put a mark with the help of (a piece of) stone so that the Messenger of Allah (ﷺ) and his Companions might recognise them (that it was booty left by the enemy). (They went on) until They came to a narrow valley when so and so, son of Badr al-Fazari joined them. They (now) sat down to take their breakfast and I sat on the top of a tapering rock. Al-Fazari said: Who is that fellow I am seeing? They said: This fellow has harassed us. By God, he has not left us since dusk and has been (continually) shooting at us until he has snatched everything from our hands. He said: Four of you should make a dash at him (and kill him). (Accordingly), four of them ascended the mountain coming towards me. When it became possible for me to talk to them, I said: Do you recognise me? They said: No. Who are thou? I said: I am Salama, son of al-Akwa'. By the Being Who has honoured the countenance of Muhammad (ﷺ) I can kill any of you I like but none of you will be able to kill me. One of them said: I think (he is right). So they returned. I did not move from my place until I saw the horsemen of the Messenger of Allah (ﷺ), who came riding through the trees. Lo! the foremost among them was Akhram al-Asadi. Behind him was Abu Qatada al-Ansari and behind him was al-Miqdad b. al-Aswad al-Kindi. I caught hold of the rein of Akhram's horse (Seeing this). they (the raiders) fled. I said (to Akhram): Akhram, guard yourself against them until Allah's Messenger (ﷺ) and his Companions join you. He said: ) Salama, if you believe In Allah and the Day of Judgment and (if) you kaow that Paradise is a reality and Hell is a reality, you should not stand between me and martyrdom. so I let him go. Akhram and Abd al-Rahman (Fazari) met in combat. Akhram hamstrung Abd al-Rahman's horse and the latter struck him with his lance and killed him. Abd al-Rabman turned about riding Akhram's horse. Abu Qatada, a horse-man of the Messenger of Allah (ﷺ), met 'Abd al-Rahman (in combat), smote him with his lance and killed him. By the Being Who honoured the countenance of Muhammad (may peace oe upon him), I followed them running on my feet (so fast) that I couldn't see behind me the Companions of Muhammad (ﷺ), nor any dust raised by their horses. (I followed them) until before sunset they reached a valley which had a spring of water, which was called Dhu Qarad, so that they could have a drink, for they were thirsty. They saw me running towards them. I turned them out of the valley before they could drink a drop of its water. They left the valley and ran down a slope. I ran (behind them), overtook a man from them, shot him with an arrow through the shoulder blade and said: Take this. I am the son of al-Akwa'; and today is the day of annihilation for the people who are mean. The fellow (who was wounded) said: May his mother weep over him! Are you the Akwa' who has been chasing us since morning? I said: Yes, O enemy of thyself, the same Akwa'. They left two horses dead tired on the hillock and I came dragging them along to the Messenger of Allah (ﷺ). I met 'Amir who had with him a container having milk diluted with water and a container having water. I performed ablution with the water and drank the milk. Then I came to the Messenger of Allah (ﷺ) while he was at (the spring of) water from which I had driven them away. The Messenger of Allah (ﷺ) had captured those camels and everything else I had captured and all the lances and mantles I had snatched from the polytheists and Bilal had slaughtered a she-camel from the camels I had seized from the people, and was roasting its liver and hump for the Messenger of Allah (ﷺ). I said: Messenger of Allah, let me select from our people one hundred men and I will follow the marauders and I will finish them all so that nobody is left to convey the news (of their destruction to their people). (At these words of mine), the Messenger of Allah (ﷺ) laughed so much that his molar teeth could be seen in the light of the fire, and he said: Salama, do you think you can do this? I said: Yes, by the Being Who has honoured you. He said: Now they have reached the land of Ghatafan where they are being feted. (At this time) a man from the Ghatafan came along and said: So and so slaughtered a camel for them. When they were exposing its skin, they saw dust (being raised far off). They said: They (Akwa' and his companions) have come. So. they went away fleeing. When it was morning, the Messenger of Allah (ﷺ) said: Our best horseman today is Abu Qatada and our best footman today is Salama. Then he gave me two shares of the booty-the share meant for the horseman and the share meant for the footman, and combined both of them for me. Intending to return to Medina, he made me mount behind him on his she-camel named al-Adba'. While we were travelling, a man from the Ansar who could not be beaten in a race said: Is there anyone who could compete (with me) in race to Medina? Is there any competitor? He continued repeating this. When I heard his talk, I said: Don't you show consideration to a dignified person and don't you have awe for a noble man? He said: No, unless he be the Messenger of Allah (ﷺ). I said: Messenger of Allah, may my father and mother be thy ransom, let me get down so that I may beat this man (in the race). He said: It you wish, (you may). I said (to the man): I am coming to thee, I then turned my feet. sprang up and tan and gasped (for a while) when one or two elevated places were left and again followed his heel and again gasped (for a while) when one or two elevated places were left and again dashed until I joined him and gave a blow between his shoulders. I said: You have been overtaken, by God. He said: I think so. Thus, I reached Medina ahead of him. By God, we had stayed there only three nights when we set out to Khaibar with the Messenger of Allah (ﷺ). (On the way) my uncle, Amir, began to recite the following rajaz verses for the people: By God, if Thou hadst not guided us aright, We would have neither practised charity nor offered prayers. (O God! ) We cannot do without Thy favours; Keep us steadfast when we encounter the enemy, And descend tranquillity upon us. The Messenger of Allah (ﷺ) said: Who is this? 'Amir said: it is 'Amir. He said: May thy God forgive thee! The narrator said: Whenever the Messenger of Allah (ﷺ) asked forgiveness for a particular person, he was sure to embrace martyrdom. Umar b. Khattab who was riding on his camel called out: Prophet of Allah, I wish you had allowed us to benefit from Amir. Salama continued: When we reached Khaibar, its king named Marhab advanced brandishing his sword and chanting: Khaibar knows that I am Marhab (who behaves like) A fully armed, and well-tried warrior. When the war comes spreading its flames. My uncle, Amir, came out to combat with him, saying: Khaibar certainly knows that I am 'Amir, A fully armed veteran who plunges into battles. They exchanged blows. Marbab's sword struck the shield of 'Amir who bent forward to attack his opponent from below, but his sword recoiled upon him and cut the main artery: in his forearm which caused his death. Salama said: I came out and heard some people among the Companions of the Prophet (ﷺ) saying: Amir's deed has been wasted; he has killed himself. So I came to the Prophet (ﷺ) weeping and I said: Messenger of Allah. Amir's deed has been wasted. The Messenger (ﷺ) said: Who passed this remark? I said: Some of your Companions. He said: He who has passed that remark has told a lie, for 'Amir there is a double reward. Then he sent me to 'Ali who had sore eyes, and said: I will give the banner to a man who loves Allah and His Messenger or whom Allah and His Messenger love. So I went to 'Ali, brought him beading him along and he had sore eyes, and I took him to the Messenger of Allah (ﷺ), who applied his saliva to his eyes and he got well. The Messenger of Allah (ﷺ) gave him the banner (and 'Ali went to meet Marhab in a single combat). The latter advanced chanting: Khaibar knows certainly that I am Marhab, A fully armed and well-tried valorous warrior (hero) When war comes spreading its flames. 'Ali chanted in reply: I am the one whose mother named him Haidar, (And am) like a lion of the forest with a terror-striking countenance. I give my opponents the measure of sandara in exchange for sa' (i. e. return thir attack with one that is much more fierce). The narrator said: 'Ali struck at the head of Mirhab and killed him, so the victory (capture of Khaibar) was due to him. This long tradition has also been handed down Through a different chain of transmitters",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 160
			}
		}
	]
}