{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"43": "The Book of Virtues"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5948,
			"arabicnumber": "1392.02",
			"text": "Abu Humaid as-Sa'idi reported:We went out with Allah's Messenger (ﷺ) on the expedition to Tabuk and we came to a wadi where there was a garden belonging to a woman. Allah's Apostle (ﷺ) said. Make an assessment (of the price of its fruit). And Allah's Messenger (ﷺ) also made an assessment and it was ten wasqs. He asked that lady (to calculate the amount) until they would, God willing, come back to her. So we proceeded on until we came to Tabuk and Allah's Messenger (ﷺ) said: The violent storm will overtake you during the night, so none amongst you should stand up and he who has a camel with him should hobble it firmly. A violent storm blew and a person who had stood up was carried away by the storm and thrown between the mountains of Tayy. Then the messenger of the son of al 'Alma', the ruler of Aila, came to Allah's Messenger (ﷺ) with a letter and a gift of a white mule. Allah's Messenger (ﷺ) wrote him (the reply) and presented him a cloak. We came back until we halted in the Wadi al-Qura. Allah's Messenger (ﷺ) asked that lady about her garden and the price of the fruits in that. She said: Ten wasqs. Thereupon Allah's Messenger (ﷺ) said: I am going to depart, and he who amongst you wishes may depart with me but he who wants to stay may stay. We resumed the journey until we came to the outskirts of Medina. (It was at this time) that Allah's Messenger (ﷺ) said: This is Taba, this is Uhud, that is a mountain which loves us and we love it, and then said: The best amongst the houses of the Ansar is the house of Bani Najjar. Then the house of Bani Abd al-Ashhal, then the house of Bani Abd al-Harith b. Khazraj, then the house of Bani Sa'ida, and there is goodness in all the houses of the Ansar. Said b. Ubada came to us and Abu Usaid said to him: Did you not see that Allah's Messenger (ﷺ) has declared the houses of the Ansar good and he has kept us at the end. Said met Allah's Messenger (ﷺ) and said: Allah's Messenger, you have declared the house of the Ansar as good and have kept us at the end, whereupon he said: Is it not enough for you that you have been counted amongst the good",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 11
			}
		}
	]
}