{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6238,
			"arabicnumber": "1748.03",
			"text": "Mus'ab b. Sa'd reported on the authority of his father that many verses of the Qur'an had been revealed in connection with him. His mother Umm Sa'd had taken oath that she would never talk with him until he abandoned his faith and she neither ate nor drank and said:Allah has commanded you to treat well your parents and I am your mother and I command you to do this. She passed three days in this state until she fainted because of extreme hunger and at that time her son whose name was Umara stood up and served her drink and she began to curse Sa'd that Allah, the Exalted and Glorions, revealed these verses of the Holy Qur'an:\" And We have enjoined upon a person goodness to his parents but if they contend with thee to associate (others) with Me of which you have no knowledge, then obey them not\" (xxix. 8) ; Treat thein with customary good in this world\" (xxxi. 15). He also reported that there fell to the lot of Allah's Messenger (ﷺ) huge spoils of war and there was one sword in them. I picked that up and came to Allah's Messenger (ﷺ) and said: Bestow this sword upon me (as my share in the spoils of war) and you know my state. Thereupon he said: Return it to the place from where you picked it up. I went back until I decided to throw it in a store but my soul repulsed me so I came back and asked him to give that sword to me. He said in a loud voice to return it to the place from where I had picked it up. It was on this occasion that this verse was revealed:\" They asked about the spoils of war\" (viii. 1). He further said: I once fell ill and sent a message to Allah's Apostle (ﷺ). He visited me and I said to him: Permit me to distribute (in charity) my property as much as I like. He did not agree. I said: (Permit me to distribute) half of it. He did not agree. I said: (Permit me to distribute) the third part, whereupon he kept quiet and it was after this (that the distribution of one's property in charity) to the extent of one-third was held valid. He further said: I came to a group of persons of the Ansir and Muhajirin and they said: Come, so that we may serve you wine, and it was before the use of wine had been prohibited. I went to them in a garden and there had been with them the roasted head of a camel and a small water-skin containing wine. I ate and drank along with them and there came under discussion the Ansr (Helpers) and Muhajirin (immigrants). I said: The immigrants are better than the Ansar, that a person picked up a portion of the head (of the camel and struck me with it that my nose was injured. I came to Allah's Messenger (ﷺ) and informed him of the situation that Aliah, the Exalted and Glorious, revealed verses pertaining to wine:\" Intoxicants and the games of chance and (sacrificing to) stones set up and (divining by) arrows are only an uncleanliness, the devil's work\" (v. 90)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 68
			}
		}
	]
}