{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6381,
			"arabicnumber": "2484.01",
			"text": "Qais b. 'Ubada reported:I was in the company of some persons, amongst whom some were the Companions of Allah's Apostle (ﷺ) in Medina, that there came a person whose face depicted the fear (of Allah). Some people said: He is a person from amongst the people of Paradise; he is a person from amongst the people of Paradise. He observed two short rak'ahs of prayer and then went out. I followed him and he got into his house and I also got in and we began to converse with each other. And when he became familiar (with me) I said to Him: When you entered (the mosque) before (your entrance in the house) a person said so and so (that you are amongst the people of Paradise), whereupon he said: It is not meet for anyone to say anything which he does not know. I shall (now) tell you why they (say) this. I saw a dream during the lifetime of Allah's Messenger (ﷺ) and narrated it to him. I seemed to be in a garden [he described its vastness, its rich fructification and its verdure]; in the midst of it, there stood an iron pillar, with its base in the earth and its summit in the sky: and upon its summit there was a handhold. It was said to me: Climb up this (pillar). I said to him (visitant in the dream): I am unable to do it. Thereupon a helper came to me, and he (supported) me (by catching hold of my) garment from behind and thus helped me with his hand and so I climbed up till I was at the summit of the pillar, and grasped the handhold. It was said to me: Ho d it tightly. It was at this that I woke up when (the handhold) was in fthe grip) of my hand. I narrated it (the dream) to Allah's Apostle (ﷺ), whereupon he said: That garden implies al-Islam and that pillar implies the pillar of Islam. And that handhold is the firmest faith (as refered to in the Qur'an). And you will remain attached to Islam until you shall die. And that man was 'Abdullah b. Salim",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 211
			}
		}
	]
}