{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"0": "Introduction"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6410,
			"text": "Abu Musa reported:We were in Yemen when we heard of the migration of Allah's Messenger (ﷺ). We also set out as immigrants to him. And I was accompanied by two brothers of mine, I being the youngest of them; one of them was Abu Burda and the other one was Abu Ruhm, and there were some other persons with them. Some say they were fifty-three or fifty-two persons of my tribe. We embarked upon a boat, and the boat sailed away to the Negus of Abyssinia. There we met Ja'far b. Abu Talib and his companions. Ja'far said: Allall's Messenger (ﷺ) has sent us here and has commanded us to stay here and you should also stay with us. So we stayed with him and we came back (to Medina) and met Allah's Messenger (ﷺ) when Khaibar had been conquered. He (the Holy Prophet) allocated a share to us and in the ordinary course he did not allocate the share to one who had been absent on the occasion of the conquest of Khaibar but conferred (a share) upon him only who had been present there with him. He, however, made an exception for the people of the boat, viz. for Ja'far and his companions. He allocated a share to them, and some persons from amongst the people said to us, viz. the people of the boat: We have preceded you in migration. Asma' bint 'Umais who had migrated to Abyssinia and had come back along with them (along with immigrants) visited Hafsa, the wife of Allah's Apostle (ﷺ). (Accordingly), Umar had been sitting with her (Hafsa). As 'Umar saw Asma, he said: Who is she? She (Hafsa) said: She is Asma, daughter of 'Umais. He said: She is an Abyssinian and a sea-woman. Asma said: Yes, it is so. Thereupon 'Umar said: We preceded you in migration and so we have more right to Allah's Messenger (ﷺ) as compared with you. At this she felt annoyed and said: 'Umar, you are not stating the fact; by Allah, you had the privilege of being in the company of the Messenger (ﷺ) who fed the hungry among you and instructed the ignorant amongst you, whereas we had been far (from here) in the land of Abyssinia amongst the enemies and that was all for Allah and Allah's Messenger (ﷺ) and, by Allah, I would never take food nor take water unless I make a mention to Allah's Messenger (ﷺ) of what you have said. We remained in that country in constant trouble and dread and I shall talk about it to Allah's Messenger (way peace be upon him) and ask him (about it). By Allah, I shall not tell a lie and deviate (from the truth) and add anything to that. So, when Allah's Apostle (ﷺ) came, she said: Allah's Apostle, 'Umar says so and so. Upon this Allah's Messenger (ﷺ) said: His right is not more than yours, for him and his companions there is one migration, but for you, i. e. for the people of the boat, there are two migrations. She said: I saw Abu Musa and the people of the boat coming to me in groups and asking me about this hadith, because there was nothing more pleasing and more significant for them than this. Abu Burda reported that Asma said: I saw Abu Musa, asking me to repeat this hadith to him again and again",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}