{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"45": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6509,
			"arabicnumber": "2550.02",
			"text": "Abu Huraira reported Allah's Apostle (ﷺ) as saying:None spoke in the cradle but only three (persons), Christ son of Mary, the second one the companion of Juraij. Juraij had got constructed a temple and confined himself in that. His mother came to him as he was busy in prayer and she said: Juraij. He said: My Lord, my mother (is calling me while I am engaged in) my prayer. He continued with the prayer. She returned and she came on the next day and he was busy in prayer, and she said: Juraij. And he said: My Lord, my mother (is calling me while I am engaged) in prayer, and he continued with the prayer and she went back, and then on the next day she again came and he was busy in prayer and she said: Juraij. And he said: My Lord, my mother (is calling me while I am engaged in my prayer, and he continued with the prayer, and she said: My Lord, don't give him death unless he has seen the fate of the prostitutes. The story of Juraij and that of his meditation and prayer gained currency amongst Bani Isra'il. There was a prostitute who had been a beauty incarnate. She said (to the people): If you like I can allure him to evil. She presented herself to him but he paid no heed (to her). She came to a shepherd who lived near the temple and she offered herself to him and he had a sexual intercourse with her and so she became pregnant arid when she gave birth to a child she said: This is from Juraij. So they came and asked him to get down and demolished the temple and began to beat him. He said: What is the matter? They said: You have committed fornication with this prostitute and she has given birth to a child from your loins. He said: Where is the child? They brought him (the child) and he said: just leave me so that I should observe prayer. And he observed prayer and when he finished, he came to the child. He struck his stomach and said: O boy, who is your father? lie said: He is such shepherd. So they turned towards Juraij, kissed him and touched him (for seeking blessing) and said: We are prepared to construct your temple with gold. He said. No, just rebuild it with mud as it had been, and they did that. Then there was a babe who was sucking his mother that a person dressed in fine garment came riding upon a beast. His mother said: O Allah, make my child like this one. He (the babe) left sucking and began to see towards him, and said: O Allah, don't make me like him. He then returned to the chest and began to suck the milk of his mother. He (Abu Huraira) said: I perceived as if I am seeing Allah's Messenger (ﷺ) as he is explaining the scene of his sucking milk with his forefinger in his mouth and sucking that. He (Abu Huraira) further reported Allah's Apostle (may be peace upon him) as saying: There happened to pass by him a girl who was being beaten and they were saying: You have committed adultery and you have committed theft and she was saying: Allah is enough for me and He is my good Protector, and his mother said: O Allah, don't make my child like her and he left sucking the milk, and looked towards her and said: O Allah, make me like her, and there was a talk between them. She said: O with shaven head, a good-looking person happened to pass by and I said: O Allah, make my child like him, and you said: O Allah, don't make me like him, and they passed by a girl while they were beating her and saying: You committed fornication and you committed theft, and I said: O Allah, don't make my child like her, and you said: O Allah, make me like her. Thereupon he said: That person was a tyrant, and I said: O Allah, don't make me like him, and they were saying about her: You committed fornication whereas in fact she had not committed that and they were saying: You have committed theft whereas she had not committed theft, so I said: O Allah, make me like her",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 9
			}
		}
	]
}