{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"49": "The Book of Heart-Melting Traditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6949,
			"arabicnumber": "2743.01",
			"text": "Abdullah b. 'Umar reported that Allah's Messenger (ﷺ) said:Three persons set out on a journey. They were overtaken by rain and they had to find protection in a mountain cave where at its mouth there fell a rock of that mountain and thus blocked them altogether. One of them said to the others: Look to your good deeds that you performed for the sake of Allah and then supplicate Allah, the Exalted, that He might rescue you (from this trouble). One of them said: 0 Allah, I had my parents who were old and my wife and my small children also. I tended the flock and when I came back to them in the evening, I milked them (the sheep, goats, cows, etc.) and first served that milk to my parents. One day I was obliged to go out to a distant place in search of fodder and I could not come back before evening and found them (the parents) asleep. I milked the animals as I used to milk and brought milk to them and stood by their heads avoiding to disturb them from sleep and I did not deem it advisable to serve milk to my children before serving them. My children wept near my feet. I remained there in that very state and my parents too until it was morning. And (0 Allah) if Thou art aware that I did this in order to seek Thine pleasure, grant us riddance from this trouble. (The rock slipped a bit) that they could see the sky. The second one said: 0 Allah, I had a female cousin whom I loved more than the men love the women. I wanted to have sexual intercourse with her; she refused but on the condition of getting one hundred dinirs. It was with very great difficulty that I could collect one hundred dinirs and then paid them to her and when I was going to have a sexual intercourse with her, that she said: Servant of Allah, fear Allah and do not break the seal (of chastity) but by lawful means. I got up. 0 Allah, if Thou art aware that I did this in order to seek Thine pleasure, rid us from this trouble. The situation was somewhat eased for them. The third one said: Allah, I employed a workman for a measure of rice. After he had finished his work I gave him his dues (in the form of) a measure of rice, but he did not accept them. I used these rice as seeds, and that gave a bumper crop and I became rich enough to have cows and flocks (in my possession). He came to me and said: Fear Allah, and commit no crueltv upon me in regard to my dues. I said to him: Takeaway this flock of cows and sheep. He said: Fear Allah and do not make a fun of me. I said: I am not making a fun of you. You take the cows and the flocks. So he took them. 0 Allah, if Thou art aware that I did it for Thine pleasure, case the situation for us. And Allah relieved them from the rest of the trouble",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 13
			}
		}
	]
}