{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"52": "Characteristics of the Day of Judgment, Paradise, and Hell"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7066,
			"arabicnumber": "2798.01",
			"text": "Masruq reported:We were sitting in the company of Abdullah and he was lying on the bed that a person came and said: Abd Abd al-Rabmin, a story-teller at the gates of Kinda says that the verse (of the Qur'an) which deals with the\" smoke\" implies that which is about to come and it would hold the breath of the infidels and would inflict the believers with cold. Thereupon Abdullah got up and said in anger. O people, fear Allah and say only that which one knows amongst you and do not say which he does not know and he should simply say: Allah has the best knowledge for He has the best knowledge amongst all of you. It does not behove him to say that which he does not know. Allah has the best knowledge of it. Verily Allah, the Exalted and Glorious, said to His Prophet (ﷺ) to state:\" I do not ask from you any remuneration and I am not the one to put you in trouble,\" and when Allah's Mesqenger (ﷺ) saw people turning back (from religion) he said: O Allah, afflict thern with seven famines as was done in the case of Yusuf, so they were afflicted with famine by which they were forced to eat everything until they were obliged to eat the hides and the dead bodies because of hunger, and every one of them looked towards the sky and he found a smoke. And Abu Sufyan came and he said: Muhammad, you have come to command us to obey Allah and cement the ties of blood- relation whereas your people are undone; supplicate Allah for tlicm. Thereupon Allah, the Exalted and Glorious, said:\" Wait for the day when there would be clear smoke from the sky which would envelop people and that would be grievous torivent\" up to the words:\" you are going to return to (evil).\" (if this verse implied the torment of the next life) could the chastisement of the next (life) be averted (as the Qur'an states): On the day when We seize (them) with the most violent seizing; surely We shall exact retribution\" (xliv. 16)? The seizing (in the hadith) implies that of the Day of Badr. And so far as the sign of smoke, seizing, inevitability and signs of Rome are concern- ed, they have become things of the past now",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 22
			}
		}
	]
}