{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"55": "The Book of Zuhd and Softening of Hearts "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7431,
			"arabicnumber": "2964",
			"text": "Abu Huraira, narrated that he heard Allah's Messenger (ﷺ) as saying:There were three persons in Bani Isra'il, one suffering from leprosy, the other bald-headed and the third one blind. Allah decided to test them. So He sent an angel who came to the one who was suffering from leprosy and said: Which thing do you like most? He said: Beautiful colour and fine skin and removal of that which makes me detestable in the eye of people. He wiped him and his illness was no more and he was conferred upon beautiful colour and beautiful skin. He (the angel) again said: Which property do you like most? He said: Camels, or he said: The cow the narrator is, however, doubtful about it, but (out of the persons) suffering from leprosy or baldness one of them definitely said: The camel. And the other one said: Cow. And he (one who demanded camel) was bestowed upon a she-camel, in an advanced stage of pregnancy, and while giving he said: May Allah bless you in this. Then he came to the bald-headed person and said: Which thing do you like most? He said: Beautiful hair and that (this baldness) may be removed from me because of which people hate me. He wiped his body and his illness was removed and he was bestowed upon beautiful hair, and the angel said: Which wealth do you like most? He said: The cow. And he was given a pregnant cow and while handing it over to him he (the angel) said: May Allah bless you in this. Then he came to the blind man and he said: Which thing do you like most? He said: Allah should restore my eyesight so that I should be able to see people with the help of that. He wiped his body and Allah restored to him his eyesight, and he (the angel) also said: Which wealth do you like most? He said: The flock of sheep. And he was given a pregnant goat and that gave birth to young ones and it so happened that one valley abounded in camels and the other one in cows and the third one in sheep. He then came to the one who had suffered from leprosy in his (old) form and shape and he said: I am a poor person and my provision has run short in my journey and there is none to take me to my destination except with the help of Allah and your favour. I beg of you in His name Who gave you fine colour and fine skin, and the camel in the shape of wealth (to confer upon me) a camel which should carry me in my journey. He said: I have many responsibilities to discharge. Thereupon he said: I perceive as if I recognise you. Were you not suffering from leprosy whom people hated and you were a destitute and Allah conferred upon you (wealth)? He said: I have inherited this property from my forefathers. Thereupon he said: If you are a liar may Allah change you to that very position in which you had been. He then came to the one who was bald-headed in his (old) form and said to him the same what he had said to him (one suffering from leprosy) and he gave him the same reply as he had given him and he said: If you are a liar, may Allah turn you to your previous position in which you had been. And then he came to the blind man in his (old) form and shape and he said: I am a destitute person and a wayfarer. My provision have ran short and today there is no way to reach the destination but with the help of Allah and then with your help and I beg of you in the (name) of One Who restored your eyesight and gave you the flock of sheep to give me a sheep by which I should be able to make my provisions for the journey. He said: I was blind and Allah restored to me my eyesight; you take whatever you like and leave whatever you like. By Allah, I shall not stand in your way today for what you take in the name of God. Thereupon, he said: You keep with you what you have (in your possession). The fact is that you three were put to test and Allah is well pleased with you and He is annoyed with your companions",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 15
			}
		}
	]
}