{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"56": "The Book of Commentary on the Qur'an"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7528,
			"arabicnumber": "3018.01",
			"text": "Urwa b. Zubair reported that he asked 'A'isha about the words of Allah:\" If you fear that you will not be able to maintain equity amongst the orphan girls, then marry (those) you like from amongst the women two, three or four.\" She said: O, the son of my sister, the orphan girl is one who is under the patronage of her guardian and she shares with him in his property and her property and beauty fascinate him and her guardian makes up his mind to marry her without giving her due share of the wedding money and is not prepared (to pay so much amount) which anyone else is prepared to pay and so Allah has forbidden to marry these girls but in case when equity is observed as regards the wedding money and they are prepared to pay them the full amount of the wedding money and Allah commanded to marry other women besides them according to the liking of their heart. 'Urwa reported that 'A'isha said that people began to seek verdict from Allah's Messenger (ﷺ) after the revelation of this verse about them (orphan girls) and Allah, the Exalted and Glorious, revealed this verse:\" They asked thee verdict about women; say: Allah gives verdict to you in regard to them and what is recited to you in the Book about orphan woman, whom you give not what is ordained for them while you like to marry them\" (iv. 126). She said: The wording of Allah\" what is recited to you\" in the Book means the first verse, i. e.\" if you fear that you may not be able to observe equity in case of an orphan woman, marry what you like in case of woman\" (iv. 3). 'A'isha said: (And as for this verse [iv. 126], i. e. and you intend\" to marry one of them from amongst the orphan girls\" it pertains to one who is in charge (of orphans) having small amount of wealth and less beauty and they have been forbidden that they should marry what they like of her wealth and beauty out of the orphan girls, but with equity, because of their disliking for them",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 6
			}
		}
	]
}