{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"4": "The Book of Prayers "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 936,
			"arabicnumber": "418.01",
			"text": "Ubaidullah b. Abdullah reported:I visited 'A'isha and asked her to tell about the illness of the Messenger of Allah (ﷺ). She agreed and said: The Apostle (ﷺ) was seriously ill and he asked whether the people had prayed. We said: No, they are waiting for you, Messenger of Allah. He (the Holy Prophet) said: Put some water in the tub for me. We did accordingly and he (the Holy Prophet) took a bath;and, when he was about to move with difficulty, he fainted. When he came round, he again said: Have the people said prayer? We said: No, they are waiting for you, Messenger of Allah. He (the Holy Prophet) again said: Put some water for me in the tub. We did accordingly and he took a bag, but when he was about to move with difficultyhe fainted. When he came round, he asked whether the people had prayed. We said: No, they are waiting for you, Messenger of Allah. He said: Put some water for me in the tub. We did accordingly and he took a bath and he was about to move with difficulty when he fainted. When he came roundhe said: Have the people saidprayer? We said: No, they are waiting for you, Messenger of Allah. She ('A'isha) said: The people were staying in the mosque and waiting for the Messenger of Allah (ﷺ) to lead the last (night) prayer. She ('A'isha) said: The Messenger of Allah (ﷺ) sent (instructions) to Abu Bakr to lead the people in prayer. When the messenger came, he told him (Abd Bakr): The Messenger of Allah (ﷺ) has ordered you to lead the people in prayer. Abu Bakr who was a man of very tenderly feelings asked Umar to lead the prayer. 'Umar said: You are more entitled to that. Abu Bakr led the prayers during those days. Afterwards the Messenger of Allah (ﷺ) felt some relief and he went out supported by two men, one of them was al-'Abbas, to the noon prayer. Abu Bakr was leading the people in prayer. When Abu Bakr saw him. he began to withdraw, but the Messenger of Allah (ﷺ) told him not to withdraw. He told his two (companions) to seat him down beside him (Abu Bakr). They seated him by the side of Abu Bakr. Abu Bakr said the prayer standing while following the prayer of the Apostle (ﷺ) and the people Bald prayer (standing) while following the prayer of Abu Bakr. The Apostle (ﷺ) was seated. Ubaidullah said: I visited 'Abdullah b. 'Abbas, and said: Should I submit to you what 'A'isha had told about the illness of the Apostle (ﷺ)? He said: Go ahead. I submitted to him what had been transmitted by her ('A'isha). He objected to none of it, only asking whether she had named to him the man who accompanied al-'Abbas. I said: No. He said: It was 'Ali",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 98
			}
		}
	]
}