{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 93,
			"arabicnumber": "8.01",
			"text": "حدثني أبو خيثمة، زهير بن حرب حدثنا وكيع، عن كهمس، عن عبد الله بن بريدة، عن يحيى بن يعمر، ح وحدثنا عبيد الله بن معاذ العنبري، - وهذا حديثه - حدثنا أبي، حدثنا كهمس، عن ابن بريدة، عن يحيى بن يعمر، قال كان أول من قال في القدر بالبصرة معبد الجهني فانطلقت أنا وحميد بن عبد الرحمن الحميري حاجين أو معتمرين فقلنا لو لقينا أحدا من أصحاب رسول الله صلى الله عليه وسلم فسألناه عما يقول هؤلاء في القدر فوفق لنا عبد الله بن عمر بن الخطاب داخلا المسجد فاكتنفته أنا وصاحبي أحدنا عن يمينه والآخر عن شماله فظننت أن صاحبي سيكل الكلام إلى فقلت أبا عبد الرحمن إنه قد ظهر قبلنا ناس يقرءون القرآن ويتقفرون العلم - وذكر من شأنهم - وأنهم يزعمون أن لا قدر وأن الأمر أنف ‏.‏ قال فإذا لقيت أولئك فأخبرهم أني بريء منهم وأنهم برآء مني والذي يحلف به عبد الله بن عمر لو أن لأحدهم مثل أحد ذهبا فأنفقه ما قبل الله منه حتى يؤمن بالقدر ثم قال حدثني أبي عمر بن الخطاب قال بينما نحن عند رسول الله صلى الله عليه وسلم ذات يوم إذ طلع علينا رجل شديد بياض الثياب شديد سواد الشعر لا يرى عليه أثر السفر ولا يعرفه منا أحد حتى جلس إلى النبي صلى الله عليه وسلم فأسند ركبتيه إلى ركبتيه ووضع كفيه على فخذيه وقال يا محمد أخبرني عن الإسلام ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ الإسلام أن تشهد أن لا إله إلا الله وأن محمدا رسول الله وتقيم الصلاة وتؤتي الزكاة وتصوم رمضان وتحج البيت إن استطعت إليه سبيلا ‏.‏ قال صدقت ‏.‏ قال فعجبنا له يسأله ويصدقه ‏.‏ قال فأخبرني عن الإيمان ‏.‏ قال ‏\"‏ أن تؤمن بالله وملائكته وكتبه ورسله واليوم الآخر وتؤمن بالقدر خيره وشره ‏\"‏ ‏.‏ قال صدقت ‏.‏ قال فأخبرني عن الإحسان ‏.‏ قال ‏\"‏ أن تعبد الله كأنك تراه فإن لم تكن تراه فإنه يراك ‏\"‏ ‏.‏ قال فأخبرني عن الساعة ‏.‏ قال ‏\"‏ ما المسئول عنها بأعلم من السائل ‏\"‏ ‏.‏ قال فأخبرني عن أمارتها ‏.‏ قال ‏\"‏ أن تلد الأمة ربتها وأن ترى الحفاة العراة العالة رعاء الشاء يتطاولون في البنيان ‏\"‏ ‏.‏ قال ثم انطلق فلبثت مليا ثم قال لي ‏\"‏ يا عمر أتدري من السائل ‏\"‏ ‏.‏ قلت الله ورسوله أعلم ‏.‏ قال ‏\"‏ فإنه جبريل أتاكم يعلمكم دينكم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 94,
			"arabicnumber": "8.02",
			"text": "حدثني محمد بن عبيد الغبري، وأبو كامل الجحدري وأحمد بن عبدة قالوا حدثنا حماد بن زيد، عن مطر الوراق، عن عبد الله بن بريدة، عن يحيى بن يعمر، قال لما تكلم معبد بما تكلم به في شأن القدر أنكرنا ذلك ‏.‏ قال فحججت أنا وحميد بن عبد الرحمن الحميري حجة ‏.‏ وساقوا الحديث بمعنى حديث كهمس وإسناده ‏.‏ وفيه بعض زيادة ونقصان أحرف ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 95,
			"arabicnumber": "8.03",
			"text": "وحدثني محمد بن حاتم، حدثنا يحيى بن سعيد القطان، حدثنا عثمان بن غياث، حدثنا عبد الله بن بريدة، عن يحيى بن يعمر، وحميد بن عبد الرحمن، قالا لقينا عبد الله بن عمر فذكرنا القدر وما يقولون فيه ‏.‏ فاقتص الحديث كنحو حديثهم عن عمر - رضى الله عنه - عن النبي صلى الله عليه وسلم وفيه شىء من زيادة وقد نقص منه شيئا ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 96,
			"arabicnumber": "8.04",
			"text": "وحدثني حجاج بن الشاعر، حدثنا يونس بن محمد، حدثنا المعتمر، عن أبيه، عن يحيى بن يعمر، عن ابن عمر، عن عمر، عن النبي صلى الله عليه وسلم بنحو حديثهم ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 97,
			"arabicnumber": "8.05",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، جميعا عن ابن علية، قال زهير حدثنا إسماعيل بن إبراهيم، عن أبي حيان، عن أبي زرعة بن عمرو بن جرير، عن أبي هريرة، قال كان رسول الله صلى الله عليه وسلم يوما بارزا للناس فأتاه رجل فقال يا رسول الله ما الإيمان قال ‏\"‏ أن تؤمن بالله وملائكته وكتابه ولقائه ورسله وتؤمن بالبعث الآخر ‏\"‏ ‏.‏ قال يا رسول الله ما الإسلام قال ‏\"‏ الإسلام أن تعبد الله ولا تشرك به شيئا وتقيم الصلاة المكتوبة وتؤدي الزكاة المفروضة وتصوم رمضان ‏\"‏ ‏.‏ قال يا رسول الله ما الإحسان قال ‏\"‏ أن تعبد الله كأنك تراه فإنك إن لا تراه فإنه يراك ‏\"‏ ‏.‏ قال يا رسول الله متى الساعة قال ‏\"‏ ما المسئول عنها بأعلم من السائل ولكن سأحدثك عن أشراطها إذا ولدت الأمة ربها فذاك من أشراطها وإذا كانت العراة الحفاة رءوس الناس فذاك من أشراطها وإذا تطاول رعاء البهم في البنيان فذاك من أشراطها في خمس لا يعلمهن إلا الله ‏\"‏ ‏.‏ ثم تلا صلى الله عليه وسلم ‏{‏ إن الله عنده علم الساعة وينزل الغيث ويعلم ما في الأرحام وما تدري نفس ماذا تكسب غدا وما تدري نفس بأى أرض تموت إن الله عليم خبير‏}‏ ‏\"‏ ‏.‏ قال ثم أدبر الرجل فقال رسول الله صلى الله عليه وسلم ‏\"‏ ردوا على الرجل ‏\"‏ ‏.‏ فأخذوا ليردوه فلم يروا شيئا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ هذا جبريل جاء ليعلم الناس دينهم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 98,
			"arabicnumber": "9",
			"text": "حدثنا محمد بن عبد الله بن نمير، حدثنا محمد بن بشر، حدثنا أبو حيان التيمي، بهذا الإسناد مثله غير أن في روايته ‏ \"‏ إذا ولدت الأمة بعلها ‏\"‏ يعني السراري ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 99,
			"arabicnumber": "10",
			"text": "حدثني زهير بن حرب، حدثنا جرير، عن عمارة، - وهو ابن القعقاع - عن أبي زرعة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ سلوني ‏\"‏ فهابوه أن يسألوه ‏.‏ فجاء رجل فجلس عند ركبتيه ‏.‏ فقال يا رسول الله ما الإسلام قال ‏\"‏ لا تشرك بالله شيئا وتقيم الصلاة وتؤتي الزكاة وتصوم رمضان ‏\"‏ ‏.‏ قال صدقت ‏.‏ قال يا رسول الله ما الإيمان قال ‏\"‏ أن تؤمن بالله وملائكته وكتابه ولقائه ورسله وتؤمن بالبعث وتؤمن بالقدر كله ‏\"‏ ‏.‏ قال صدقت ‏.‏ قال يا رسول الله ما الإحسان قال ‏\"‏ أن تخشى الله كأنك تراه فإنك إن لا تكن تراه فإنه يراك ‏\"‏ ‏.‏ قال صدقت ‏.‏ قال يا رسول الله متى تقوم الساعة قال ‏\"‏ ما المسئول عنها بأعلم من السائل وسأحدثك عن أشراطها إذا رأيت المرأة تلد ربها فذاك من أشراطها وإذا رأيت الحفاة العراة الصم البكم ملوك الأرض فذاك من أشراطها وإذا رأيت رعاء البهم يتطاولون في البنيان فذاك من أشراطها في خمس من الغيب لا يعلمهن إلا الله ‏\"‏ ‏.‏ ثم قرأ ‏{‏ إن الله عنده علم الساعة وينزل الغيث ويعلم ما في الأرحام وما تدري نفس ماذا تكسب غدا وما تدري نفس بأى أرض تموت إن الله عليم خبير‏}‏ قال ثم قام الرجل فقال رسول الله صلى الله عليه وسلم ‏\"‏ ردوه على ‏\"‏ فالتمس فلم يجدوه فقال رسول الله صلى الله عليه وسلم ‏\"‏ هذا جبريل أراد أن تعلموا إذ لم تسألوا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 100,
			"arabicnumber": "11.01",
			"text": "حدثنا قتيبة بن سعيد بن جميل بن طريف بن عبد الله الثقفي، عن مالك بن أنس، - فيما قرئ عليه - عن أبي سهيل، عن أبيه، أنه سمع طلحة بن عبيد الله، يقول جاء رجل إلى رسول الله صلى الله عليه وسلم من أهل نجد ثائر الرأس نسمع دوي صوته ولا نفقه ما يقول حتى دنا من رسول الله صلى الله عليه وسلم فإذا هو يسأل عن الإسلام فقال رسول الله صلى الله عليه وسلم ‏\"‏ خمس صلوات في اليوم والليلة ‏\"‏ ‏.‏ فقال هل على غيرهن قال ‏\"‏ لا ‏.‏ إلا أن تطوع وصيام شهر رمضان ‏\"‏ ‏.‏ فقال هل على غيره فقال ‏\"‏ لا ‏.‏ إلا أن تطوع ‏\"‏ ‏.‏ وذكر له رسول الله صلى الله عليه وسلم الزكاة فقال هل على غيرها قال ‏\"‏ لا ‏.‏ إلا أن تطوع ‏\"‏ قال فأدبر الرجل وهو يقول والله لا أزيد على هذا ولا أنقص منه ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أفلح إن صدق ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 101,
			"arabicnumber": "11.02",
			"text": "حدثني يحيى بن أيوب، وقتيبة بن سعيد، جميعا عن إسماعيل بن جعفر، عن أبي سهيل، عن أبيه، عن طلحة بن عبيد الله، عن النبي صلى الله عليه وسلم بهذا الحديث نحو حديث مالك غير أنه قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ أفلح وأبيه إن صدق ‏\"‏ ‏.‏ أو ‏\"‏ دخل الجنة وأبيه إن صدق ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 102,
			"arabicnumber": "12.01",
			"text": "حدثني عمرو بن محمد بن بكير الناقد، حدثنا هاشم بن القاسم أبو النضر، حدثنا سليمان بن المغيرة، عن ثابت، عن أنس بن مالك، قال نهينا أن نسأل، رسول الله صلى الله عليه وسلم عن شىء فكان يعجبنا أن يجيء الرجل من أهل البادية العاقل فيسأله ونحن نسمع فجاء رجل من أهل البادية فقال يا محمد أتانا رسولك فزعم لنا أنك تزعم أن الله أرسلك قال ‏\"‏ صدق ‏\"‏ ‏.‏ قال فمن خلق السماء قال ‏\"‏ الله ‏\"‏ ‏.‏ قال فمن خلق الأرض قال ‏\"‏ الله ‏\"‏ ‏.‏ قال فمن نصب هذه الجبال وجعل فيها ما جعل ‏.‏ قال ‏\"‏ الله ‏\"‏ ‏.‏ قال فبالذي خلق السماء وخلق الأرض ونصب هذه الجبال آلله أرسلك قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال وزعم رسولك أن علينا خمس صلوات في يومنا وليلتنا ‏.‏ قال ‏\"‏ صدق ‏\"‏ ‏.‏ قال فبالذي أرسلك آلله أمرك بهذا قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال وزعم رسولك أن علينا زكاة في أموالنا ‏.‏ قال ‏\"‏ صدق ‏\"‏ ‏.‏ قال فبالذي أرسلك آلله أمرك بهذا قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال وزعم رسولك أن علينا صوم شهر رمضان في سنتنا ‏.‏ قال ‏\"‏ صدق ‏\"‏ ‏.‏ قال فبالذي أرسلك آلله أمرك بهذا قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال وزعم رسولك أن علينا حج البيت من استطاع إليه سبيلا ‏.‏ قال ‏\"‏ صدق ‏\"‏ ‏.‏ قال ثم ولى ‏.‏ قال والذي بعثك بالحق لا أزيد عليهن ولا أنقص منهن ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لئن صدق ليدخلن الجنة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 103,
			"arabicnumber": "12.02",
			"text": "حدثني عبد الله بن هاشم العبدي، حدثنا بهز، حدثنا سليمان بن المغيرة، عن ثابت، قال قال أنس كنا نهينا في القرآن أن نسأل رسول الله صلى الله عليه وسلم عن شىء ‏.‏ وساق الحديث بمثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 104,
			"arabicnumber": "13.01",
			"text": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا عمرو بن عثمان، حدثنا موسى بن طلحة، قال حدثني أبو أيوب، أن أعرابيا، عرض لرسول الله صلى الله عليه وسلم وهو في سفر ‏.‏ فأخذ بخطام ناقته أو بزمامها ثم قال يا رسول الله - أو يا محمد - أخبرني بما يقربني من الجنة وما يباعدني من النار ‏.‏ قال فكف النبي صلى الله عليه وسلم ثم نظر في أصحابه ثم قال ‏\"‏ لقد وفق - أو لقد هدي - قال كيف قلت ‏\"‏ ‏.‏ قال فأعاد ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ تعبد الله لا تشرك به شيئا وتقيم الصلاة وتؤتي الزكاة وتصل الرحم دع الناقة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 105,
			"arabicnumber": "13.02",
			"text": "وحدثني محمد بن حاتم، وعبد الرحمن بن بشر، قالا حدثنا بهز، حدثنا شعبة، حدثنا محمد بن عثمان بن عبد الله بن موهب، وأبوه، عثمان أنهما سمعا موسى بن طلحة، يحدث عن أبي أيوب، عن النبي صلى الله عليه وسلم بمثل هذا الحديث ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 106,
			"arabicnumber": "14.01",
			"text": "حدثنا يحيى بن يحيى التميمي، أخبرنا أبو الأحوص، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو الأحوص، عن أبي إسحاق، عن موسى بن طلحة، عن أبي أيوب، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال دلني على عمل أعمله يدنيني من الجنة ويباعدني من النار ‏.‏ قال ‏\"‏ تعبد الله لا تشرك به شيئا وتقيم الصلاة وتؤتي الزكاة وتصل ذا رحمك ‏\"‏ فلما أدبر قال رسول الله صلى الله عليه وسلم ‏\"‏ إن تمسك بما أمر به دخل الجنة ‏\"‏ ‏.‏ وفي رواية ابن أبي شيبة ‏\"‏ إن تمسك به ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 107,
			"arabicnumber": "14.02",
			"text": "وحدثني أبو بكر بن إسحاق، حدثنا عفان، حدثنا وهيب، حدثنا يحيى بن سعيد، عن أبي زرعة، عن أبي هريرة، أن أعرابيا، جاء إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله دلني على عمل إذا عملته دخلت الجنة ‏.‏ قال ‏\"‏ تعبد الله لا تشرك به شيئا وتقيم الصلاة المكتوبة وتؤدي الزكاة المفروضة وتصوم رمضان ‏\"‏ ‏.‏ قال والذي نفسي بيده لا أزيد على هذا شيئا أبدا ولا أنقص منه ‏.‏ فلما ولى قال النبي صلى الله عليه وسلم ‏\"‏ من سره أن ينظر إلى رجل من أهل الجنة فلينظر إلى هذا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 108,
			"arabicnumber": "15.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب - واللفظ لأبي كريب - قالا حدثنا أبو معاوية، عن الأعمش، عن أبي سفيان، عن جابر، قال أتى النبي صلى الله عليه وسلم النعمان بن قوقل فقال يا رسول الله أرأيت إذا صليت المكتوبة وحرمت الحرام وأحللت الحلال أأدخل الجنة فقال النبي صلى الله عليه وسلم ‏ \"‏ نعم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 109,
			"arabicnumber": "15.02",
			"text": "وحدثني حجاج بن الشاعر، والقاسم بن زكرياء، قالا حدثنا عبيد الله بن موسى، عن شيبان، عن الأعمش، عن أبي صالح، وأبي، سفيان عن جابر، قال قال النعمان بن قوقل يا رسول الله ‏.‏ بمثله ‏.‏ وزاد فيه ولم أزد على ذلك شيئا ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 110,
			"arabicnumber": "15.03",
			"text": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، - وهو ابن عبيد الله - عن أبي الزبير، عن جابر، أن رجلا، سأل رسول الله صلى الله عليه وسلم فقال أرأيت إذا صليت الصلوات المكتوبات وصمت رمضان وأحللت الحلال وحرمت الحرام ولم أزد على ذلك شيئا أأدخل الجنة قال ‏ \"‏ نعم ‏\"‏ ‏.‏ قال والله لا أزيد على ذلك شيئا ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 111,
			"arabicnumber": "16.01",
			"text": "حدثنا محمد بن عبد الله بن نمير الهمداني، حدثنا أبو خالد، - يعني سليمان بن حيان الأحمر - عن أبي مالك الأشجعي، عن سعد بن عبيدة، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏ \"‏ بني الإسلام على خمسة على أن يوحد الله وإقام الصلاة وإيتاء الزكاة وصيام رمضان والحج ‏\"‏ ‏.‏ فقال رجل الحج وصيام رمضان قال لا ‏.‏ صيام رمضان والحج ‏.‏ هكذا سمعته من رسول الله صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 112,
			"arabicnumber": "16.02",
			"text": "وحدثنا سهل بن عثمان العسكري، حدثنا يحيى بن زكرياء، حدثنا سعد بن طارق، قال حدثني سعد بن عبيدة السلمي، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏ \"‏ بني الإسلام على خمس على أن يعبد الله ويكفر بما دونه وإقام الصلاة وإيتاء الزكاة وحج البيت وصوم رمضان ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 113,
			"arabicnumber": "16.03",
			"text": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا عاصم، - وهو ابن محمد بن زيد بن عبد الله بن عمر - عن أبيه، قال قال عبد الله قال رسول الله صلى الله عليه وسلم ‏ \"‏ بني الإسلام على خمس شهادة أن لا إله إلا الله وأن محمدا عبده ورسوله وإقام الصلاة وإيتاء الزكاة وحج البيت وصوم رمضان ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 114,
			"arabicnumber": "16.04",
			"text": "وحدثني ابن نمير، حدثنا أبي، حدثنا حنظلة، قال سمعت عكرمة بن خالد، يحدث طاوسا أن رجلا، قال لعبد الله بن عمر ألا تغزو فقال إني سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ إن الإسلام بني على خمس شهادة أن لا إله إلا الله وإقام الصلاة وإيتاء الزكاة وصيام رمضان وحج البيت ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 115,
			"arabicnumber": "17.01",
			"text": "حدثنا خلف بن هشام، حدثنا حماد بن زيد، عن أبي جمرة، قال سمعت ابن عباس، ح وحدثنا يحيى بن يحيى، - واللفظ له - أخبرنا عباد بن عباد، عن أبي جمرة، عن ابن عباس، قال قدم وفد عبد القيس على رسول الله صلى الله عليه وسلم فقالوا يا رسول الله إنا هذا الحى من ربيعة وقد حالت بيننا وبينك كفار مضر فلا نخلص إليك إلا في شهر الحرام فمرنا بأمر نعمل به وندعو إليه من وراءنا ‏.‏ قال ‏\"‏ آمركم بأربع وأنهاكم عن أربع الإيمان بالله - ثم فسرها لهم فقال - شهادة أن لا إله إلا الله وأن محمدا رسول الله وإقام الصلاة وإيتاء الزكاة وأن تؤدوا خمس ما غنمتم وأنهاكم عن الدباء والحنتم والنقير والمقير ‏\"‏ ‏.‏ زاد خلف في روايته ‏\"‏ شهادة أن لا إله إلا الله ‏\"‏ ‏.‏ وعقد واحدة ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 116,
			"arabicnumber": "17.02",
			"text": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن المثنى، ومحمد بن بشار، وألفاظهم، متقاربة - قال أبو بكر حدثنا غندر، عن شعبة، وقال الآخران، حدثنا محمد بن جعفر، حدثنا شعبة، - عن أبي جمرة، قال كنت أترجم بين يدى ابن عباس وبين الناس فأتته امرأة تسأله عن نبيذ الجر، فقال إن وفد عبد القيس أتوا رسول الله صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ من الوفد أو من القوم ‏\"‏ ‏.‏ قالوا ربيعة ‏.‏ قال ‏\"‏ مرحبا بالقوم أو بالوفد غير خزايا ولا الندامى ‏\"‏ ‏.‏ قال فقالوا يا رسول الله إنا نأتيك من شقة بعيدة وإن بيننا وبينك هذا الحى من كفار مضر وإنا لا نستطيع أن نأتيك إلا في شهر الحرام فمرنا بأمر فصل نخبر به من وراءنا ندخل به الجنة ‏.‏ قال فأمرهم بأربع ونهاهم عن أربع ‏.‏ قال أمرهم بالإيمان بالله وحده ‏.‏ وقال ‏\"‏ هل تدرون ما الإيمان بالله ‏\"‏ ‏.‏ قالوا الله ورسوله أعلم ‏.‏ قال ‏\"‏ شهادة أن لا إله إلا الله وأن محمدا رسول الله وإقام الصلاة وإيتاء الزكاة وصوم رمضان وأن تؤدوا خمسا من المغنم ‏\"‏ ‏.‏ ونهاهم عن الدباء والحنتم والمزفت ‏.‏ قال شعبة وربما قال النقير ‏.‏ قال شعبة وربما قال المقير ‏.‏ وقال ‏\"‏ احفظوه وأخبروا به من ورائكم ‏\"‏ ‏.‏ وقال أبو بكر في روايته ‏\"‏ من وراءكم ‏\"‏ وليس في روايته المقير ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 117,
			"arabicnumber": "17.03",
			"text": "وحدثني عبيد الله بن معاذ، حدثنا أبي ح، وحدثنا نصر بن علي الجهضمي، قال أخبرني أبي قالا، جميعا حدثنا قرة بن خالد، عن أبي جمرة، عن ابن عباس، عن النبي صلى الله عليه وسلم بهذا الحديث نحو حديث شعبة ‏.‏ وقال ‏\"‏ أنهاكم عما ينبذ في الدباء والنقير والحنتم والمزفت ‏\"‏ ‏.‏ وزاد ابن معاذ في حديثه عن أبيه قال وقال رسول الله صلى الله عليه وسلم للأشج أشج عبد القيس ‏\"‏ إن فيك خصلتين يحبهما الله الحلم والأناة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 118,
			"arabicnumber": "18.01",
			"text": "حدثنا يحيى بن أيوب، حدثنا ابن علية، حدثنا سعيد بن أبي عروبة، عن قتادة، قال حدثنا من، لقي الوفد الذين قدموا على رسول الله صلى الله عليه وسلم من عبد القيس ‏.‏ قال سعيد وذكر قتادة أبا نضرة عن أبي سعيد الخدري في حديثه هذا ‏.‏ أن أناسا من عبد القيس قدموا على رسول الله صلى الله عليه وسلم فقالوا يا نبي الله إنا حى من ربيعة وبيننا وبينك كفار مضر ولا نقدر عليك إلا في أشهر الحرم فمرنا بأمر نأمر به من وراءنا وندخل به الجنة إذا نحن أخذنا به ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ آمركم بأربع وأنهاكم عن أربع اعبدوا الله ولا تشركوا به شيئا وأقيموا الصلاة وآتوا الزكاة وصوموا رمضان وأعطوا الخمس من الغنائم وأنهاكم عن أربع عن الدباء والحنتم والمزفت والنقير ‏\"‏ ‏.‏ قالوا يا نبي الله ما علمك بالنقير قال ‏\"‏ بلى جذع تنقرونه فتقذفون فيه من القطيعاء - قال سعيد أو قال من التمر - ثم تصبون فيه من الماء حتى إذا سكن غليانه شربتموه حتى إن أحدكم - أو إن أحدهم - ليضرب ابن عمه بالسيف ‏\"‏ ‏.‏ قال وفي القوم رجل أصابته جراحة كذلك ‏.‏ قال وكنت أخبأها حياء من رسول الله صلى الله عليه وسلم فقلت ففيم نشرب يا رسول الله قال ‏\"‏ في أسقية الأدم التي يلاث على أفواهها ‏\"‏ ‏.‏ قالوا يا رسول الله إن أرضنا كثيرة الجرذان ولا تبقى بها أسقية الأدم ‏.‏ فقال نبي الله صلى الله عليه وسلم ‏\"‏ وإن أكلتها الجرذان وإن أكلتها الجرذان وإن أكلتها الجرذان ‏\"‏ ‏.‏ قال وقال نبي الله صلى الله عليه وسلم لأشج عبد القيس ‏\"‏ إن فيك لخصلتين يحبهما الله الحلم والأناة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 119,
			"arabicnumber": "18.02",
			"text": "حدثني محمد بن المثنى، وابن، بشار قالا حدثنا ابن أبي عدي، عن سعيد، عن قتادة، قال حدثني غير، واحد، لقي ذاك الوفد ‏.‏ وذكر أبا نضرة عن أبي سعيد الخدري، أن وفد عبد القيس، لما قدموا على رسول الله صلى الله عليه وسلم بمثل حديث ابن علية غير أن فيه ‏ \"‏ وتذيفون فيه من القطيعاء أو التمر والماء ‏\"‏ ‏.‏ ولم يقل قال سعيد أو قال من التمر ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 120,
			"arabicnumber": "18.03",
			"text": "حدثني محمد بن بكار البصري، حدثنا أبو عاصم، عن ابن جريج، ح وحدثني محمد بن رافع، - واللفظ له - حدثنا عبد الرزاق، أخبرنا ابن جريج، قال أخبرني أبو قزعة، أن أبا نضرة، أخبره وحسنا، أخبرهما أن أبا سعيد الخدري أخبره أن وفد عبد القيس لما أتوا نبي الله صلى الله عليه وسلم قالوا يا نبي الله جعلنا الله فداءك ماذا يصلح لنا من الأشربة فقال ‏\"‏ لا تشربوا في النقير ‏\"‏ ‏.‏ قالوا يا نبي الله جعلنا الله فداءك أوتدري ما النقير قال ‏\"‏ نعم الجذع ينقر وسطه ولا في الدباء ولا في الحنتمة وعليكم بالموكى ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 121,
			"arabicnumber": "19.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب وإسحاق بن إبراهيم جميعا عن وكيع، - قال أبو بكر حدثنا وكيع، - عن زكرياء بن إسحاق، قال حدثني يحيى بن عبد الله بن صيفي، عن أبي معبد، عن ابن عباس، عن معاذ بن جبل، - قال أبو بكر ربما قال وكيع عن ابن عباس، أن معاذا، - قال بعثني رسول الله صلى الله عليه وسلم قال ‏ \"‏ إنك تأتي قوما من أهل الكتاب ‏.‏ فادعهم إلى شهادة أن لا إله إلا الله وأني رسول الله فإن هم أطاعوا لذلك فأعلمهم أن الله افترض عليهم خمس صلوات في كل يوم وليلة فإن هم أطاعوا لذلك فأعلمهم أن الله افترض عليهم صدقة تؤخذ من أغنيائهم فترد في فقرائهم فإن هم أطاعوا لذلك فإياك وكرائم أموالهم واتق دعوة المظلوم فإنه ليس بينها وبين الله حجاب ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 122,
			"arabicnumber": "19.02",
			"text": "حدثنا ابن أبي عمر، حدثنا بشر بن السري، حدثنا زكرياء بن إسحاق، ح وحدثنا عبد بن حميد، حدثنا أبو عاصم، عن زكرياء بن إسحاق، عن يحيى بن عبد الله بن صيفي، عن أبي معبد، عن ابن عباس، أن النبي صلى الله عليه وسلم بعث معاذا إلى اليمن فقال ‏ \"‏ إنك ستأتي قوما ‏\"‏ بمثل حديث وكيع ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 123,
			"arabicnumber": "19.03",
			"text": "حدثنا أمية بن بسطام العيشي، حدثنا يزيد بن زريع، حدثنا روح، - وهو ابن القاسم - عن إسماعيل بن أمية، عن يحيى بن عبد الله بن صيفي، عن أبي معبد، عن ابن عباس، أن رسول الله صلى الله عليه وسلم لما بعث معاذا إلى اليمن قال ‏ \"‏ إنك تقدم على قوم أهل كتاب فليكن أول ما تدعوهم إليه عبادة الله عز وجل فإذا عرفوا الله فأخبرهم أن الله فرض عليهم خمس صلوات في يومهم وليلتهم فإذا فعلوا فأخبرهم أن الله قد فرض عليهم زكاة تؤخذ من أغنيائهم فترد على فقرائهم فإذا أطاعوا بها فخذ منهم وتوق كرائم أموالهم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 124,
			"arabicnumber": "20",
			"text": "حدثنا قتيبة بن سعيد، حدثنا ليث بن سعد، عن عقيل، عن الزهري، قال أخبرني عبيد الله بن عبد الله بن عتبة بن مسعود، عن أبي هريرة، قال لما توفي رسول الله صلى الله عليه وسلم واستخلف أبو بكر بعده وكفر من كفر من العرب قال عمر بن الخطاب لأبي بكر كيف تقاتل الناس وقد قال رسول الله صلى الله عليه وسلم ‏ \"‏ أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله فمن قال لا إله إلا الله فقد عصم مني ماله ونفسه إلا بحقه وحسابه على الله ‏\"‏ ‏.‏ فقال أبو بكر والله لأقاتلن من فرق بين الصلاة والزكاة فإن الزكاة حق المال والله لو منعوني عقالا كانوا يؤدونه إلى رسول الله صلى الله عليه وسلم لقاتلتهم على منعه ‏.‏ فقال عمر بن الخطاب فوالله ما هو إلا أن رأيت الله عز وجل قد شرح صدر أبي بكر للقتال فعرفت أنه الحق ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 125,
			"arabicnumber": "21.01",
			"text": "وحدثنا أبو الطاهر، وحرملة بن يحيى، وأحمد بن عيسى، قال أحمد حدثنا وقال الآخران، أخبرنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، قال حدثني سعيد بن المسيب، أن أبا هريرة، أخبره أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله فمن قال لا إله إلا الله عصم مني ماله ونفسه إلا بحقه وحسابه على الله ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 126,
			"arabicnumber": "21.02",
			"text": "حدثنا أحمد بن عبدة الضبي، أخبرنا عبد العزيز، - يعني الدراوردي - عن العلاء، ح وحدثنا أمية بن بسطام، - واللفظ له - حدثنا يزيد بن زريع، حدثنا روح، عن العلاء بن عبد الرحمن بن يعقوب، عن أبيه، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏ \"‏ أمرت أن أقاتل الناس حتى يشهدوا أن لا إله إلا الله ويؤمنوا بي وبما جئت به فإذا فعلوا ذلك عصموا مني دماءهم وأموالهم إلا بحقها وحسابهم على الله ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 127,
			"arabicnumber": "21.03",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، عن الأعمش، عن أبي سفيان، عن جابر، وعن أبي صالح، عن أبي هريرة، قالا قال رسول الله صلى الله عليه وسلم ‏\"‏ أمرت أن أقاتل الناس ‏\"‏ ‏.‏ بمثل حديث ابن المسيب عن أبي هريرة ح وحدثني أبو بكر بن أبي شيبة، حدثنا وكيع، ح وحدثني محمد بن المثنى، حدثنا عبد الرحمن، - يعني ابن مهدي - قالا جميعا حدثنا سفيان، عن أبي الزبير، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله فإذا قالوا لا إله إلا الله عصموا مني دماءهم وأموالهم إلا بحقها وحسابهم على الله ‏\"‏ ‏.‏ ثم قرأ ‏{‏ إنما أنت مذكر * لست عليهم بمسيطر‏}‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 129,
			"arabicnumber": "22",
			"text": "حدثنا أبو غسان المسمعي، مالك بن عبد الواحد حدثنا عبد الملك بن الصباح، عن شعبة، عن واقد بن محمد بن زيد بن عبد الله بن عمر، عن أبيه، عن عبد الله بن عمر، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ أمرت أن أقاتل الناس حتى يشهدوا أن لا إله إلا الله وأن محمدا رسول الله ويقيموا الصلاة ويؤتوا الزكاة فإذا فعلوا عصموا مني دماءهم وأموالهم إلا بحقها وحسابهم على الله ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 130,
			"arabicnumber": "23.01",
			"text": "وحدثنا سويد بن سعيد، وابن أبي عمر، قالا حدثنا مروان، - يعنيان الفزاري - عن أبي مالك، عن أبيه، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ من قال لا إله إلا الله وكفر بما يعبد من دون الله حرم ماله ودمه وحسابه على الله ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 131,
			"arabicnumber": "23.02",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، ح وحدثنيه زهير بن حرب، حدثنا يزيد بن هارون، كلاهما عن أبي مالك، عن أبيه، أنه سمع النبي صلى الله عليه وسلم يقول ‏ \"‏ من وحد الله ‏\"‏ ثم ذكر بمثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 132,
			"arabicnumber": "24.01",
			"text": "وحدثني حرملة بن يحيى التجيبي، أخبرنا عبد الله بن وهب، قال أخبرني يونس، عن ابن شهاب، قال أخبرني سعيد بن المسيب، عن أبيه، قال لما حضرت أبا طالب الوفاة جاءه رسول الله صلى الله عليه وسلم فوجد عنده أبا جهل وعبد الله بن أبي أمية بن المغيرة فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا عم قل لا إله إلا الله ‏.‏ كلمة أشهد لك بها عند الله ‏\"‏ ‏.‏ فقال أبو جهل وعبد الله بن أبي أمية يا أبا طالب أترغب عن ملة عبد المطلب ‏.‏ فلم يزل رسول الله صلى الله عليه وسلم يعرضها عليه ويعيد له تلك المقالة حتى قال أبو طالب آخر ما كلمهم هو على ملة عبد المطلب ‏.‏ وأبى أن يقول لا إله إلا الله ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما والله لأستغفرن لك ما لم أنه عنك ‏\"‏ ‏.‏ فأنزل الله عز وجل ‏{‏ ما كان للنبي والذين آمنوا أن يستغفروا للمشركين ولو كانوا أولي قربى من بعد ما تبين لهم أنهم أصحاب الجحيم‏}‏ ‏.‏ وأنزل الله تعالى في أبي طالب فقال لرسول الله صلى الله عليه وسلم ‏{‏ إنك لا تهدي من أحببت ولكن الله يهدي من يشاء وهو أعلم بالمهتدين‏}‏‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 133,
			"arabicnumber": "24.02",
			"text": "وحدثنا إسحاق بن إبراهيم، وعبد بن حميد، قالا أخبرنا عبد الرزاق، أخبرنا معمر، ح وحدثنا حسن الحلواني، وعبد بن حميد، قالا حدثنا يعقوب، - وهو ابن إبراهيم بن سعد - قال حدثني أبي، عن صالح، كلاهما عن الزهري، بهذا الإسناد مثله غير أن حديث صالح انتهى عند قوله فأنزل الله عز وجل فيه ‏.‏ ولم يذكر الآيتين ‏.‏ وقال في حديثه ويعودان في تلك المقالة ‏.‏ وفي حديث معمر مكان هذه الكلمة فلم يزالا به ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 134,
			"arabicnumber": "25.01",
			"text": "حدثنا محمد بن عباد، وابن أبي عمر، قالا حدثنا مروان، عن يزيد، - وهو ابن كيسان - عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم لعمه عند الموت ‏\"‏ قل لا إله إلا الله أشهد لك بها يوم القيامة ‏\"‏ ‏.‏ فأبى فأنزل الله ‏{‏ إنك لا تهدي من أحببت‏}‏ الآية ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 135,
			"arabicnumber": "25.02",
			"text": "حدثنا محمد بن حاتم بن ميمون، حدثنا يحيى بن سعيد، حدثنا يزيد بن كيسان، عن أبي حازم الأشجعي، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم لعمه ‏\"‏ قل لا إله إلا الله أشهد لك بها يوم القيامة ‏\"‏ ‏.‏ قال لولا أن تعيرني قريش يقولون إنما حمله على ذلك الجزع لأقررت بها عينك فأنزل الله ‏{‏ إنك لا تهدي من أحببت ولكن الله يهدي من يشاء‏}‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 136,
			"arabicnumber": "26.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، كلاهما عن إسماعيل بن إبراهيم، - قال أبو بكر حدثنا ابن علية، - عن خالد، قال حدثني الوليد بن مسلم، عن حمران، عن عثمان، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من مات وهو يعلم أنه لا إله إلا الله دخل الجنة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 137,
			"arabicnumber": "26.02",
			"text": "حدثنا محمد بن أبي بكر المقدمي، حدثنا بشر بن المفضل، حدثنا خالد الحذاء، عن الوليد أبي بشر، قال سمعت حمران، يقول سمعت عثمان، يقول سمعت رسول الله صلى الله عليه وسلم يقول مثله سواء ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 138,
			"arabicnumber": "27.01",
			"text": "حدثنا أبو بكر بن النضر بن أبي النضر، قال حدثني أبو النضر، هاشم بن القاسم حدثنا عبيد الله الأشجعي، عن مالك بن مغول، عن طلحة بن مصرف، عن أبي صالح، عن أبي هريرة، قال كنا مع النبي صلى الله عليه وسلم في مسير - قال - فنفدت أزواد القوم قال حتى هم بنحر بعض حمائلهم - قال - فقال عمر يا رسول الله لو جمعت ما بقي من أزواد القوم فدعوت الله عليها ‏.‏ قال ففعل - قال - فجاء ذو البر ببره وذو التمر بتمره - قال وقال مجاهد وذو النواة بنواه - قلت وما كانوا يصنعون بالنوى قال كانوا يمصونه ويشربون عليه الماء ‏.‏ قال فدعا عليها - قال - حتى ملأ القوم أزودتهم - قال - فقال عند ذلك ‏ \"‏ أشهد أن لا إله إلا الله وأني رسول الله لا يلقى الله بهما عبد غير شاك فيهما إلا دخل الجنة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 139,
			"arabicnumber": "27.02",
			"text": "حدثنا سهل بن عثمان، وأبو كريب محمد بن العلاء جميعا عن أبي معاوية، - قال أبو كريب حدثنا أبو معاوية، - عن الأعمش، عن أبي صالح، عن أبي هريرة، أو عن أبي سعيد، - شك الأعمش - قال لما كان غزوة تبوك أصاب الناس مجاعة ‏.‏ قالوا يا رسول الله لو أذنت لنا فنحرنا نواضحنا فأكلنا وادهنا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ افعلوا ‏\"‏ ‏.‏ قال فجاء عمر فقال يا رسول الله إن فعلت قل الظهر ولكن ادعهم بفضل أزوادهم ثم ادع الله لهم عليها بالبركة لعل الله أن يجعل في ذلك ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ نعم ‏\"‏ ‏.‏ قال فدعا بنطع فبسطه ثم دعا بفضل أزوادهم - قال - فجعل الرجل يجيء بكف ذرة - قال - ويجيء الآخر بكف تمر - قال - ويجيء الآخر بكسرة حتى اجتمع على النطع من ذلك شىء يسير - قال - فدعا رسول الله صلى الله عليه وسلم عليه بالبركة ثم قال ‏\"‏ خذوا في أوعيتكم ‏\"‏ ‏.‏ قال فأخذوا في أوعيتهم حتى ما تركوا في العسكر وعاء إلا ملأوه - قال - فأكلوا حتى شبعوا وفضلت فضلة فقال رسول الله صلى الله عليه وسلم ‏\"‏ أشهد أن لا إله إلا الله وأني رسول الله لا يلقى الله بهما عبد غير شاك فيحجب عن الجنة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 140,
			"arabicnumber": "28.01",
			"text": "حدثنا داود بن رشيد، حدثنا الوليد، - يعني ابن مسلم - عن ابن جابر، قال حدثني عمير بن هانئ، قال حدثني جنادة بن أبي أمية، حدثنا عبادة بن الصامت، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من قال أشهد أن لا إله إلا الله وحده لا شريك له وأن محمدا عبده ورسوله وأن عيسى عبد الله وابن أمته وكلمته ألقاها إلى مريم وروح منه وأن الجنة حق وأن النار حق أدخله الله من أى أبواب الجنة الثمانية شاء ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 141,
			"arabicnumber": "28.02",
			"text": "وحدثني أحمد بن إبراهيم الدورقي، حدثنا مبشر بن إسماعيل، عن الأوزاعي، عن عمير بن هانئ، في هذا الإسناد بمثله غير أنه قال ‏\"‏ أدخله الله الجنة على ما كان من عمل ‏\"‏ ‏.‏ ولم يذكر ‏\"‏ من أى أبواب الجنة الثمانية شاء ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 142,
			"arabicnumber": "29",
			"text": "حدثنا قتيبة بن سعيد، حدثنا ليث، عن ابن عجلان، عن محمد بن يحيى بن حبان، عن ابن محيريز، عن الصنابحي، عن عبادة بن الصامت، أنه قال دخلت عليه وهو في الموت فبكيت فقال مهلا لم تبكي فوالله لئن استشهدت لأشهدن لك ولئن شفعت لأشفعن لك ولئن استطعت لأنفعنك ثم قال والله ما من حديث سمعته من رسول الله صلى الله عليه وسلم لكم فيه خير إلا حدثتكموه إلا حديثا واحدا وسوف أحدثكموه اليوم وقد أحيط بنفسي سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ من شهد أن لا إله إلا الله وأن محمدا رسول الله حرم الله عليه النار ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 143,
			"arabicnumber": "30.01",
			"text": "حدثنا هداب بن خالد الأزدي، حدثنا همام، حدثنا قتادة، حدثنا أنس بن مالك، عن معاذ بن جبل، قال كنت ردف النبي صلى الله عليه وسلم ليس بيني وبينه إلا مؤخرة الرحل فقال ‏\"‏ يا معاذ بن جبل ‏\"‏ ‏.‏ قلت لبيك رسول الله وسعديك ‏.‏ ثم سار ساعة ثم قال ‏\"‏ يا معاذ بن جبل ‏\"‏ ‏.‏ قلت لبيك رسول الله وسعديك ‏.‏ ثم سار ساعة ثم قال ‏\"‏ يا معاذ بن جبل ‏\"‏ ‏.‏ قلت لبيك رسول الله وسعديك ‏.‏ قال ‏\"‏ هل تدري ما حق الله على العباد ‏\"‏ ‏.‏ قال قلت الله ورسوله أعلم ‏.‏ قال ‏\"‏ فإن حق الله على العباد أن يعبدوه ولا يشركوا به شيئا ‏\"‏ ‏.‏ ثم سار ساعة ثم قال ‏\"‏ يا معاذ بن جبل ‏\"‏ ‏.‏ قلت لبيك رسول الله وسعديك ‏.‏ قال ‏\"‏ هل تدري ما حق العباد على الله إذا فعلوا ذلك ‏\"‏ ‏.‏ قال قلت الله ورسوله أعلم ‏.‏ قال ‏\"‏ أن لا يعذبهم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 144,
			"arabicnumber": "30.02",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو الأحوص، سلام بن سليم عن أبي إسحاق، عن عمرو بن ميمون، عن معاذ بن جبل، قال كنت ردف رسول الله صلى الله عليه وسلم على حمار يقال له عفير قال فقال ‏\"‏ يا معاذ تدري ما حق الله على العباد وما حق العباد على الله ‏\"‏ ‏.‏ قال قلت الله ورسوله أعلم ‏.‏ قال ‏\"‏ فإن حق الله على العباد أن يعبدوا الله ولا يشركوا به شيئا وحق العباد على الله عز وجل أن لا يعذب من لا يشرك به شيئا ‏\"‏ ‏.‏ قال قلت يا رسول الله أفلا أبشر الناس قال ‏\"‏ لا تبشرهم فيتكلوا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 145,
			"arabicnumber": "30.03",
			"text": "حدثنا محمد بن المثنى، وابن، بشار قال ابن المثنى حدثنا محمد بن جعفر، حدثنا شعبة، عن أبي حصين، والأشعث بن سليم، أنهما سمعا الأسود بن هلال، يحدث عن معاذ بن جبل، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يا معاذ أتدري ما حق الله على العباد ‏\"‏ ‏.‏ قال الله ورسوله أعلم ‏.‏ قال ‏\"‏ أن يعبد الله ولا يشرك به شىء - قال - أتدري ما حقهم عليه إذا فعلوا ذلك ‏\"‏ ‏.‏ فقال الله ورسوله أعلم ‏.‏ قال ‏\"‏ أن لا يعذبهم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 146,
			"arabicnumber": "30.04",
			"text": "حدثنا القاسم بن زكرياء، حدثنا حسين، عن زائدة، عن أبي حصين، عن الأسود بن هلال، قال سمعت معاذا، يقول دعاني رسول الله صلى الله عليه وسلم فأجبته فقال ‏ \"‏ هل تدري ما حق الله على الناس ‏\"‏ ‏.‏ نحو حديثهم ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 147,
			"arabicnumber": "31",
			"text": "حدثني زهير بن حرب، حدثنا عمر بن يونس الحنفي، حدثنا عكرمة بن عمار، قال حدثني أبو كثير، قال حدثني أبو هريرة، قال كنا قعودا حول رسول الله صلى الله عليه وسلم معنا أبو بكر وعمر في نفر فقام رسول الله صلى الله عليه وسلم من بين أظهرنا فأبطأ علينا وخشينا أن يقتطع دوننا وفزعنا فقمنا فكنت أول من فزع فخرجت أبتغي رسول الله صلى الله عليه وسلم حتى أتيت حائطا للأنصار لبني النجار فدرت به هل أجد له بابا فلم أجد فإذا ربيع يدخل في جوف حائط من بئر خارجة - والربيع الجدول - فاحتفزت كما يحتفز الثعلب فدخلت على رسول الله صلى الله عليه وسلم فقال ‏\"‏ أبو هريرة ‏\"‏ ‏.‏ فقلت نعم يا رسول الله ‏.‏ قال ‏\"‏ ما شأنك ‏\"‏ ‏.‏ قلت كنت بين أظهرنا فقمت فأبطأت علينا فخشينا أن تقتطع دوننا ففزعنا فكنت أول من فزع فأتيت هذا الحائط فاحتفزت كما يحتفز الثعلب وهؤلاء الناس ورائي فقال ‏\"‏ يا أبا هريرة ‏\"‏ ‏.‏ وأعطاني نعليه قال ‏\"‏ اذهب بنعلى هاتين فمن لقيت من وراء هذا الحائط يشهد أن لا إله إلا الله مستيقنا بها قلبه فبشره بالجنة ‏\"‏ فكان أول من لقيت عمر فقال ما هاتان النعلان يا أبا هريرة ‏.‏ فقلت هاتان نعلا رسول الله صلى الله عليه وسلم بعثني بهما من لقيت يشهد أن لا إله إلا الله مستيقنا بها قلبه بشرته بالجنة ‏.‏ فضرب عمر بيده بين ثديى فخررت لاستي فقال ارجع يا أبا هريرة فرجعت إلى رسول الله صلى الله عليه وسلم فأجهشت بكاء وركبني عمر فإذا هو على أثري فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ ما لك يا أبا هريرة ‏\"‏ ‏.‏ قلت لقيت عمر فأخبرته بالذي بعثتني به فضرب بين ثديى ضربة خررت لاستي قال ارجع ‏.‏ فقال له رسول الله صلى الله عليه وسلم ‏\"‏ يا عمر ما حملك على ما فعلت ‏\"‏ ‏.‏ قال يا رسول الله بأبي أنت وأمي أبعثت أبا هريرة بنعليك من لقي يشهد أن لا إله إلا الله مستيقنا بها قلبه بشره بالجنة ‏.‏ قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال فلا تفعل فإني أخشى أن يتكل الناس عليها فخلهم يعملون ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ فخلهم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 148,
			"arabicnumber": "32",
			"text": "حدثنا إسحاق بن منصور، أخبرنا معاذ بن هشام، قال حدثني أبي، عن قتادة، قال حدثنا أنس بن مالك، أن نبي الله صلى الله عليه وسلم ومعاذ بن جبل رديفه على الرحل قال ‏\"‏ يا معاذ ‏\"‏ ‏.‏ قال لبيك رسول الله وسعديك ‏.‏ قال ‏\"‏ يا معاذ ‏\"‏ ‏.‏ قال لبيك رسول الله وسعديك ‏.‏ قال ‏\"‏ يا معاذ ‏\"‏ ‏.‏ قال لبيك رسول الله وسعديك ‏.‏ قال ‏\"‏ ما من عبد يشهد أن لا إله إلا الله وأن محمدا عبده ورسوله إلا حرمه الله على النار ‏\"‏ ‏.‏ قال يا رسول الله أفلا أخبر بها الناس فيستبشروا قال ‏\"‏ إذا يتكلوا ‏\"‏ فأخبر بها معاذ عند موته تأثما ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 149,
			"arabicnumber": "33.01",
			"text": "حدثنا شيبان بن فروخ، حدثنا سليمان، - يعني ابن المغيرة - قال حدثنا ثابت، عن أنس بن مالك، قال حدثني محمود بن الربيع، عن عتبان بن مالك، قال قدمت المدينة فلقيت عتبان فقلت حديث بلغني عنك قال أصابني في بصري بعض الشىء فبعثت إلى رسول الله صلى الله عليه وسلم أني أحب أن تأتيني فتصلي في منزلي فأتخذه مصلى - قال - فأتى النبي صلى الله عليه وسلم ومن شاء الله من أصحابه فدخل وهو يصلي في منزلي وأصحابه يتحدثون بينهم ثم أسندوا عظم ذلك وكبره إلى مالك بن دخشم قالوا ودوا أنه دعا عليه فهلك وودوا أنه أصابه شر ‏.‏ فقضى رسول الله صلى الله عليه وسلم الصلاة وقال ‏\"‏ أليس يشهد أن لا إله إلا الله وأني رسول الله ‏\"‏ ‏.‏ قالوا إنه يقول ذلك وما هو في قلبه ‏.‏ قال ‏\"‏ لا يشهد أحد أن لا إله إلا الله وأني رسول الله فيدخل النار أو تطعمه ‏\"‏ ‏.‏ قال أنس فأعجبني هذا الحديث فقلت لابني اكتبه فكتبه ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 150,
			"arabicnumber": "33.02",
			"text": "حدثني أبو بكر بن نافع العبدي، حدثنا بهز، حدثنا حماد، حدثنا ثابت، عن أنس، قال حدثني عتبان بن مالك، أنه عمي فأرسل إلى رسول الله صلى الله عليه وسلم فقال تعال فخط لي مسجدا ‏.‏ فجاء رسول الله صلى الله عليه وسلم وجاء قومه ونعت رجل منهم يقال له مالك بن الدخشم ‏.‏ ثم ذكر نحو حديث سليمان بن المغيرة ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 151,
			"arabicnumber": "34",
			"text": "حدثنا محمد بن يحيى بن أبي عمر المكي، وبشر بن الحكم، قالا حدثنا عبد العزيز، - وهو ابن محمد - الدراوردي عن يزيد بن الهاد، عن محمد بن إبراهيم، عن عامر بن سعد، عن العباس بن عبد المطلب، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏ \"‏ ذاق طعم الإيمان من رضي بالله ربا وبالإسلام دينا وبمحمد رسولا ‏\"‏ ‏‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 152,
			"arabicnumber": "35.01",
			"text": "حدثنا عبيد الله بن سعيد، وعبد بن حميد، قالا حدثنا أبو عامر العقدي، حدثنا سليمان بن بلال، عن عبد الله بن دينار، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ الإيمان بضع وسبعون شعبة والحياء شعبة من الإيمان ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 153,
			"arabicnumber": "35.02",
			"text": "حدثنا زهير بن حرب، حدثنا جرير، عن سهيل، عن عبد الله بن دينار، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ الإيمان بضع وسبعون أو بضع وستون شعبة فأفضلها قول لا إله إلا الله وأدناها إماطة الأذى عن الطريق والحياء شعبة من الإيمان ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 154,
			"arabicnumber": "36.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، وزهير بن حرب، قالوا حدثنا سفيان بن عيينة، عن الزهري، عن سالم، عن أبيه، سمع النبي صلى الله عليه وسلم رجلا يعظ أخاه في الحياء فقال ‏ \"‏ الحياء من الإيمان ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 155,
			"arabicnumber": "36.02",
			"text": "حدثنا عبد بن حميد، حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، بهذا الإسناد وقال مر برجل من الأنصار يعظ أخاه ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 156,
			"arabicnumber": "37.02",
			"text": "حدثنا يحيى بن حبيب الحارثي، حدثنا حماد بن زيد، عن إسحاق، - وهو ابن سويد - أن أبا قتادة، حدث قال كنا عند عمران بن حصين في رهط منا وفينا بشير بن كعب فحدثنا عمران، يومئذ قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الحياء خير كله ‏\"‏ ‏.‏ قال أو قال ‏\"‏ الحياء كله خير ‏\"‏ ‏.‏ فقال بشير بن كعب إنا لنجد في بعض الكتب أو الحكمة أن منه سكينة ووقارا لله ومنه ضعف ‏.‏ قال فغضب عمران حتى احمرتا عيناه وقال ألا أراني أحدثك عن رسول الله صلى الله عليه وسلم وتعارض فيه ‏.‏ قال فأعاد عمران الحديث قال فأعاد بشير فغضب عمران قال فما زلنا نقول فيه إنه منا يا أبا نجيد إنه لا بأس به ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 157,
			"arabicnumber": "37.03",
			"text": "حدثنا إسحاق بن إبراهيم، أخبرنا النضر، حدثنا أبو نعامة العدوي، قال سمعت حجير بن الربيع العدوي، يقول عن عمران بن حصين، عن النبي صلى الله عليه وسلم نحو حديث حماد بن زيد ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 158,
			"arabicnumber": "37.01",
			"text": "حدثنا محمد بن المثنى، ومحمد بن بشار، - واللفظ لابن المثنى - قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن قتادة، قال سمعت أبا السوار، يحدث أنه سمع عمران بن حصين، يحدث عن النبي صلى الله عليه وسلم أنه قال ‏ \"‏ الحياء لا يأتي إلا بخير ‏\"‏ ‏.‏ فقال بشير بن كعب إنه مكتوب في الحكمة أن منه وقارا ومنه سكينة ‏.‏ فقال عمران أحدثك عن رسول الله صلى الله عليه وسلم وتحدثني عن صحفك ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 159,
			"arabicnumber": "38",
			"text": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا ابن نمير، ح وحدثنا قتيبة بن سعيد، وإسحاق بن إبراهيم، جميعا عن جرير، ح وحدثنا أبو كريب، حدثنا أبو أسامة، كلهم عن هشام بن عروة، عن أبيه، عن سفيان بن عبد الله الثقفي، قال قلت يا رسول الله قل لي في الإسلام قولا لا أسأل عنه أحدا بعدك - وفي حديث أبي أسامة غيرك - قال ‏ \"‏ قل آمنت بالله فاستقم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 160,
			"arabicnumber": "39",
			"text": "حدثنا قتيبة بن سعيد، حدثنا ليث، ح وحدثنا محمد بن رمح بن المهاجر، أخبرنا الليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن عبد الله بن عمرو، أن رجلا، سأل رسول الله صلى الله عليه وسلم أى الإسلام خير قال ‏ \"‏ تطعم الطعام وتقرأ السلام على من عرفت ومن لم تعرف ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 161,
			"arabicnumber": "40",
			"text": "وحدثنا أبو الطاهر، أحمد بن عمرو بن عبد الله بن عمرو بن سرح المصري أخبرنا ابن وهب، عن عمرو بن الحارث، عن يزيد بن أبي حبيب، عن أبي الخير، أنه سمع عبد الله بن عمرو بن العاص، يقول إن رجلا سأل رسول الله صلى الله عليه وسلم أى المسلمين خير قال ‏ \"‏ من سلم المسلمون من لسانه ويده ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 162,
			"arabicnumber": "41",
			"text": "حدثنا حسن الحلواني، وعبد بن حميد، جميعا عن أبي عاصم، - قال عبد أنبأنا أبو عاصم، - عن ابن جريج، أنه سمع أبا الزبير، يقول سمعت جابرا، يقول سمعت النبي صلى الله عليه وسلم يقول ‏ \"‏ المسلم من سلم المسلمون من لسانه ويده ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 163,
			"arabicnumber": "42.01",
			"text": "وحدثني سعيد بن يحيى بن سعيد الأموي، قال حدثني أبي، حدثنا أبو بردة بن عبد الله بن أبي بردة بن أبي موسى، عن أبي بردة، عن أبي موسى، قال قلت يا رسول الله أى الإسلام أفضل قال ‏ \"‏ من سلم المسلمون من لسانه ويده ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 164,
			"arabicnumber": "42.02",
			"text": "وحدثنيه إبراهيم بن سعيد الجوهري، حدثنا أبو أسامة، قال حدثني بريد بن عبد الله، بهذا الإسناد قال سئل رسول الله صلى الله عليه وسلم أى المسلمين أفضل فذكر مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 165,
			"arabicnumber": "43.01",
			"text": "حدثنا إسحاق بن إبراهيم، ومحمد بن يحيى بن أبي عمر، ومحمد بن بشار، جميعا عن الثقفي، - قال ابن أبي عمر حدثنا عبد الوهاب، - عن أيوب، عن أبي قلابة، عن أنس، عن النبي صلى الله عليه وسلم قال ‏ \"‏ ثلاث من كن فيه وجد بهن حلاوة الإيمان من كان الله ورسوله أحب إليه مما سواهما وأن يحب المرء لا يحبه إلا لله وأن يكره أن يعود في الكفر بعد أن أنقذه الله منه كما يكره أن يقذف في النار ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 166,
			"arabicnumber": "43.02",
			"text": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، قال سمعت قتادة، يحدث عن أنس، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ ثلاث من كن فيه وجد طعم الإيمان من كان يحب المرء لا يحبه إلا لله ومن كان الله ورسوله أحب إليه مما سواهما ومن كان أن يلقى في النار أحب إليه من أن يرجع في الكفر بعد أن أنقذه الله منه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 167,
			"arabicnumber": "43.03",
			"text": "حدثنا إسحاق بن منصور، أنبأنا النضر بن شميل، أنبأنا حماد، عن ثابت، عن أنس، قال قال رسول الله صلى الله عليه وسلم بنحو حديثهم غير أنه قال ‏ \"‏ من أن يرجع يهوديا أو نصرانيا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 168,
			"arabicnumber": "44.01",
			"text": "وحدثني زهير بن حرب، حدثنا إسماعيل ابن علية، ح وحدثنا شيبان بن أبي شيبة، حدثنا عبد الوارث، كلاهما عن عبد العزيز، عن أنس، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا يؤمن عبد - وفي حديث عبد الوارث الرجل - حتى أكون أحب إليه من أهله وماله والناس أجمعين ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 169,
			"arabicnumber": "44.02",
			"text": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، قال سمعت قتادة، يحدث عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا يؤمن أحدكم حتى أكون أحب إليه من ولده ووالده والناس أجمعين ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 170,
			"arabicnumber": "45.01",
			"text": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، قال سمعت قتادة، يحدث عن أنس بن مالك، عن النبي صلى الله عليه وسلم قال ‏ \"‏ لا يؤمن أحدكم حتى يحب لأخيه - أو قال لجاره - ما يحب لنفسه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 171,
			"arabicnumber": "45.02",
			"text": "وحدثني زهير بن حرب، حدثنا يحيى بن سعيد، عن حسين المعلم، عن قتادة، عن أنس، عن النبي صلى الله عليه وسلم قال ‏ \"‏ والذي نفسي بيده لا يؤمن عبد حتى يحب لجاره - أو قال لأخيه - ما يحب لنفسه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 172,
			"arabicnumber": "46",
			"text": "حدثنا يحيى بن أيوب، وقتيبة بن سعيد، وعلي بن حجر، جميعا عن إسماعيل بن جعفر، - قال ابن أيوب حدثنا إسماعيل، - قال أخبرني العلاء، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا يدخل الجنة من لا يأمن جاره بوائقه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 173,
			"arabicnumber": "47.01",
			"text": "حدثني حرملة بن يحيى، أنبأنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من كان يؤمن بالله واليوم الآخر فليقل خيرا أو ليصمت ومن كان يؤمن بالله واليوم الآخر فليكرم جاره ومن كان يؤمن بالله واليوم الآخر فليكرم ضيفه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 174,
			"arabicnumber": "47.02",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو الأحوص، عن أبي حصين، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من كان يؤمن بالله واليوم الآخر فلا يؤذي جاره ومن كان يؤمن بالله واليوم الآخر فليكرم ضيفه ومن كان يؤمن بالله واليوم الآخر فليقل خيرا أو ليسكت ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 175,
			"arabicnumber": "47.03",
			"text": "وحدثنا إسحاق بن إبراهيم، أخبرنا عيسى بن يونس، عن الأعمش، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم بمثل حديث أبي حصين غير أنه قال ‏ \"‏ فليحسن إلى جاره ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 176,
			"arabicnumber": "48",
			"text": "حدثنا زهير بن حرب، ومحمد بن عبد الله بن نمير، جميعا عن ابن عيينة، - قال ابن نمير حدثنا سفيان، - عن عمرو، أنه سمع نافع بن جبير، يخبر عن أبي شريح الخزاعي، أن النبي صلى الله عليه وسلم قال ‏ \"‏ من كان يؤمن بالله واليوم الآخر فليحسن إلى جاره ومن كان يؤمن بالله واليوم الآخر فليكرم ضيفه ومن كان يؤمن بالله واليوم الآخر فليقل خيرا أو ليسكت ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 177,
			"arabicnumber": "49.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن سفيان، ح وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، كلاهما عن قيس بن مسلم، عن طارق بن شهاب، - وهذا حديث أبي بكر - قال أول من بدأ بالخطبة يوم العيد قبل الصلاة مروان فقام إليه رجل فقال الصلاة قبل الخطبة ‏.‏ فقال قد ترك ما هنالك ‏.‏ فقال أبو سعيد أما هذا فقد قضى ما عليه سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ من رأى منكم منكرا فليغيره بيده فإن لم يستطع فبلسانه فإن لم يستطع فبقلبه وذلك أضعف الإيمان ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 178,
			"arabicnumber": "49.02",
			"text": "حدثنا أبو كريب، محمد بن العلاء حدثنا أبو معاوية، حدثنا الأعمش، عن إسماعيل بن رجاء، عن أبيه، عن أبي سعيد الخدري، وعن قيس بن مسلم، عن طارق بن شهاب، عن أبي سعيد الخدري، في قصة مروان وحديث أبي سعيد عن النبي صلى الله عليه وسلم بمثل حديث شعبة وسفيان ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 179,
			"arabicnumber": "50.01",
			"text": "حدثني عمرو الناقد، وأبو بكر بن النضر وعبد بن حميد - واللفظ لعبد - قالوا حدثنا يعقوب بن إبراهيم بن سعد، قال حدثني أبي، عن صالح بن كيسان، عن الحارث، عن جعفر بن عبد الله بن الحكم، عن عبد الرحمن بن المسور، عن أبي رافع، عن عبد الله بن مسعود، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ ما من نبي بعثه الله في أمة قبلي إلا كان له من أمته حواريون وأصحاب يأخذون بسنته ويقتدون بأمره ثم إنها تخلف من بعدهم خلوف يقولون ما لا يفعلون ويفعلون ما لا يؤمرون فمن جاهدهم بيده فهو مؤمن ومن جاهدهم بلسانه فهو مؤمن ومن جاهدهم بقلبه فهو مؤمن وليس وراء ذلك من الإيمان حبة خردل ‏\"‏ ‏.‏ قال أبو رافع فحدثته عبد الله بن عمر فأنكره على فقدم ابن مسعود فنزل بقناة فاستتبعني إليه عبد الله بن عمر يعوده فانطلقت معه فلما جلسنا سألت ابن مسعود عن هذا الحديث فحدثنيه كما حدثته ابن عمر ‏.‏ قال صالح وقد تحدث بنحو ذلك عن أبي رافع ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 180,
			"arabicnumber": "50.02",
			"text": "وحدثنيه أبو بكر بن إسحاق بن محمد، أخبرنا ابن أبي مريم، حدثنا عبد العزيز بن محمد، قال أخبرني الحارث بن الفضيل الخطمي، عن جعفر بن عبد الله بن الحكم، عن عبد الرحمن بن المسور بن مخرمة، عن أبي رافع، مولى النبي صلى الله عليه وسلم عن عبد الله بن مسعود أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ ما كان من نبي إلا وقد كان له حواريون يهتدون بهديه ويستنون بسنته ‏\"‏ ‏.‏ مثل حديث صالح ولم يذكر قدوم ابن مسعود واجتماع ابن عمر معه ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 181,
			"arabicnumber": "51",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، ح وحدثنا ابن نمير، حدثنا أبي ح، وحدثنا أبو كريب، حدثنا ابن إدريس، كلهم عن إسماعيل بن أبي خالد، ح وحدثنا يحيى بن حبيب الحارثي، - واللفظ له - حدثنا معتمر، عن إسماعيل، قال سمعت قيسا، يروي عن أبي مسعود، قال أشار النبي صلى الله عليه وسلم بيده نحو اليمن فقال ‏ \"‏ ألا إن الإيمان ها هنا وإن القسوة وغلظ القلوب في الفدادين عند أصول أذناب الإبل حيث يطلع قرنا الشيطان في ربيعة ومضر ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 182,
			"arabicnumber": "52.01",
			"text": "حدثنا أبو الربيع الزهراني، أنبأنا حماد، حدثنا أيوب، حدثنا محمد، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ جاء أهل اليمن هم أرق أفئدة الإيمان يمان والفقه يمان والحكمة يمانية ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 183,
			"arabicnumber": "52.02",
			"text": "حدثنا محمد بن المثنى، حدثنا ابن أبي عدي، ح وحدثني عمرو الناقد، حدثنا إسحاق بن يوسف الأزرق، كلاهما عن ابن عون، عن محمد، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم بمثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 184,
			"arabicnumber": "52.03",
			"text": "حدثني عمرو الناقد، وحسن الحلواني، قالا حدثنا يعقوب، - وهو ابن إبراهيم بن سعد - حدثنا أبي، عن صالح، عن الأعرج، قال قال أبو هريرة قال رسول الله صلى الله عليه وسلم ‏ \"‏ أتاكم أهل اليمن هم أضعف قلوبا وأرق أفئدة الفقه يمان والحكمة يمانية ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 185,
			"arabicnumber": "52.04",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ رأس الكفر نحو المشرق والفخر والخيلاء في أهل الخيل والإبل الفدادين أهل الوبر والسكينة في أهل الغنم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 186,
			"arabicnumber": "52.05",
			"text": "وحدثني يحيى بن أيوب، وقتيبة، وابن، حجر عن إسماعيل بن جعفر، - قال ابن أيوب حدثنا إسماعيل، - قال أخبرني العلاء، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ الإيمان يمان والكفر قبل المشرق والسكينة في أهل الغنم والفخر والرياء في الفدادين أهل الخيل والوبر ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 187,
			"arabicnumber": "52.06",
			"text": "وحدثني حرملة بن يحيى، أخبرنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، قال أخبرني أبو سلمة بن عبد الرحمن، أن أبا هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ الفخر والخيلاء في الفدادين أهل الوبر والسكينة في أهل الغنم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 188,
			"arabicnumber": "52.07",
			"text": "وحدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا أبو اليمان، أخبرنا شعيب، عن الزهري، بهذا الإسناد مثله وزاد ‏ \"‏ الإيمان يمان والحكمة يمانية ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 189,
			"arabicnumber": "52.08",
			"text": "حدثنا عبد الله بن عبد الرحمن، أخبرنا أبو اليمان، عن شعيب، عن الزهري، حدثني سعيد بن المسيب، أن أبا هريرة، قال سمعت النبي صلى الله عليه وسلم يقول ‏ \"‏ جاء أهل اليمن هم أرق أفئدة وأضعف قلوبا الإيمان يمان والحكمة يمانية السكينة في أهل الغنم والفخر والخيلاء في الفدادين أهل الوبر قبل مطلع الشمس ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 190,
			"arabicnumber": "52.09",
			"text": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، عن الأعمش، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ أتاكم أهل اليمن هم ألين قلوبا وأرق أفئدة الإيمان يمان والحكمة يمانية رأس الكفر قبل المشرق ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 191,
			"arabicnumber": "52.10",
			"text": "وحدثنا قتيبة بن سعيد، وزهير بن حرب، قالا حدثنا جرير، عن الأعمش، بهذا الإسناد ولم يذكر ‏ \"‏ رأس الكفر قبل المشرق ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 192,
			"arabicnumber": "52.11",
			"text": "وحدثنا محمد بن المثنى، حدثنا ابن أبي عدي، ح وحدثني بشر بن خالد، حدثنا محمد، - يعني ابن جعفر - قالا حدثنا شعبة، عن الأعمش، بهذا الإسناد ‏.‏ مثل حديث جرير وزاد ‏ \"‏ والفخر والخيلاء في أصحاب الإبل والسكينة والوقار في أصحاب الشاء ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 193,
			"arabicnumber": "53",
			"text": "وحدثنا إسحاق بن إبراهيم، أخبرنا عبد الله بن الحارث المخزومي، عن ابن جريج، قال أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ غلظ القلوب والجفاء في المشرق والإيمان في أهل الحجاز ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 194,
			"arabicnumber": "54.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو معاوية، ووكيع، عن الأعمش، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا تدخلون الجنة حتى تؤمنوا ولا تؤمنوا حتى تحابوا ‏.‏ أولا أدلكم على شىء إذا فعلتموه تحاببتم أفشوا السلام بينكم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 195,
			"arabicnumber": "54.02",
			"text": "وحدثني زهير بن حرب، أنبأنا جرير، عن الأعمش، بهذا الإسناد قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ والذي نفسي بيده لا تدخلون الجنة حتى تؤمنوا ‏\"‏ ‏.‏ بمثل حديث أبي معاوية ووكيع ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 196,
			"arabicnumber": "55.01",
			"text": "حدثنا محمد بن عباد المكي، حدثنا سفيان، قال قلت لسهيل إن عمرا حدثنا عن القعقاع، عن أبيك، قال ورجوت أن يسقط، عني رجلا قال فقال سمعته من الذي سمعه منه أبي كان صديقا له بالشام ثم حدثنا سفيان عن سهيل عن عطاء بن يزيد عن تميم الداري أن النبي صلى الله عليه وسلم قال ‏\"‏ الدين النصيحة ‏\"‏ قلنا لمن قال ‏\"‏ لله ولكتابه ولرسوله ولأئمة المسلمين وعامتهم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 197,
			"arabicnumber": "55.02",
			"text": "حدثني محمد بن حاتم، حدثنا ابن مهدي، حدثنا سفيان، عن سهيل بن أبي صالح، عن عطاء بن يزيد الليثي، عن تميم الداري، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 198,
			"arabicnumber": "55.03",
			"text": "وحدثني أمية بن بسطام، حدثنا يزيد، - يعني ابن زريع - حدثنا روح، - وهو ابن القاسم - حدثنا سهيل، عن عطاء بن يزيد، سمعه وهو، يحدث أبا صالح عن تميم الداري، عن رسول الله صلى الله عليه وسلم بمثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 199,
			"arabicnumber": "56.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، وأبو أسامة عن إسماعيل بن أبي خالد، عن قيس، عن جرير، قال بايعت رسول الله صلى الله عليه وسلم على إقام الصلاة وإيتاء الزكاة والنصح لكل مسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 200,
			"arabicnumber": "56.02",
			"text": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، وابن، نمير قالوا حدثنا سفيان، عن زياد بن علاقة، سمع جرير بن عبد الله، يقول بايعت النبي صلى الله عليه وسلم على النصح لكل مسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 201,
			"arabicnumber": "56.03",
			"text": "حدثنا سريج بن يونس، ويعقوب الدورقي، قالا حدثنا هشيم، عن سيار، عن الشعبي، عن جرير، قال بايعت النبي صلى الله عليه وسلم على السمع والطاعة فلقنني ‏ \"‏ فيما استطعت ‏\"‏ ‏.‏ والنصح لكل مسلم ‏.‏ قال يعقوب في روايته قال حدثنا سيار ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 202,
			"arabicnumber": "57.01",
			"text": "حدثني حرملة بن يحيى بن عبد الله بن عمران التجيبي، أنبأنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، قال سمعت أبا سلمة بن عبد الرحمن، وسعيد بن المسيب، يقولان قال أبو هريرة إن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يزني الزاني حين يزني وهو مؤمن ولا يسرق السارق حين يسرق وهو مؤمن ولا يشرب الخمر حين يشربها وهو مؤمن ‏\"‏ ‏.‏ قال ابن شهاب فأخبرني عبد الملك بن أبي بكر بن عبد الرحمن أن أبا بكر كان يحدثهم هؤلاء عن أبي هريرة ثم يقول وكان أبو هريرة يلحق معهن ‏\"‏ ولا ينتهب نهبة ذات شرف يرفع الناس إليه فيها أبصارهم حين ينتهبها وهو مؤمن ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 203,
			"arabicnumber": "57.02",
			"text": "وحدثني عبد الملك بن شعيب بن الليث بن سعد، قال حدثني أبي، عن جدي، قال حدثني عقيل بن خالد، قال قال ابن شهاب أخبرني أبو بكر بن عبد الرحمن بن الحارث بن هشام، عن أبي هريرة، أنه قال إن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا يزني الزاني ‏\"‏ ‏.‏ واقتص الحديث بمثله يذكر مع ذكر النهبة ولم يذكر ذات شرف ‏.‏ قال ابن شهاب حدثني سعيد بن المسيب وأبو سلمة بن عبد الرحمن عن أبي هريرة عن رسول الله صلى الله عليه وسلم بمثل حديث أبي بكر هذا إلا النهبة ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 204,
			"arabicnumber": "57.03",
			"text": "وحدثني محمد بن مهران الرازي، قال أخبرني عيسى بن يونس، حدثنا الأوزاعي، عن الزهري، عن ابن المسيب، وأبي، سلمة وأبي بكر بن عبد الرحمن بن الحارث بن هشام عن أبي هريرة، عن النبي صلى الله عليه وسلم بمثل حديث عقيل عن الزهري عن أبي بكر بن عبد الرحمن عن أبي هريرة وذكر النهبة ولم يقل ذات شرف ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 205,
			"arabicnumber": "57.04",
			"text": "وحدثني حسن بن علي الحلواني، حدثنا يعقوب بن إبراهيم، حدثنا عبد العزيز بن المطلب، عن صفوان بن سليم، عن عطاء بن يسار، مولى ميمونة وحميد بن عبد الرحمن عن أبي هريرة، عن النبي صلى الله عليه وسلم ح وحدثنا محمد بن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 206,
			"arabicnumber": "57.05",
			"text": "حدثنا قتيبة بن سعيد، حدثنا عبد العزيز، - يعني الدراوردي - عن العلاء بن عبد الرحمن، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم كل هؤلاء بمثل حديث الزهري غير أن العلاء وصفوان بن سليم ليس في حديثهما ‏\"‏ يرفع الناس إليه فيها أبصارهم ‏\"‏ ‏.‏ وفي حديث همام ‏\"‏ يرفع إليه المؤمنون أعينهم فيها وهو حين ينتهبها مؤمن ‏\"‏ ‏.‏ وزاد ‏\"‏ ولا يغل أحدكم حين يغل وهو مؤمن فإياكم إياكم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 207,
			"arabicnumber": "57.06",
			"text": "حدثني محمد بن المثنى، حدثنا ابن أبي عدي، عن شعبة، عن سليمان، عن ذكوان، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏ \"‏ لا يزني الزاني حين يزني وهو مؤمن ولا يسرق حين يسرق وهو مؤمن ولا يشرب الخمر حين يشربها وهو مؤمن والتوبة معروضة بعد ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 208,
			"arabicnumber": "57.07",
			"text": "حدثني محمد بن رافع، حدثنا عبد الرزاق، أخبرنا سفيان، عن الأعمش، عن ذكوان، عن أبي هريرة، رفعه قال ‏ \"‏ لا يزني الزاني ‏\"‏ ‏.‏ ثم ذكر بمثل حديث شعبة ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 210,
			"arabicnumber": "58",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، ح وحدثنا ابن نمير، حدثنا أبي، حدثنا الأعمش، ح وحدثني زهير بن حرب، حدثنا وكيع، حدثنا سفيان، عن الأعمش، عن عبد الله بن مرة، عن مسروق، عن عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أربع من كن فيه كان منافقا خالصا ومن كانت فيه خلة منهن كانت فيه خلة من نفاق حتى يدعها إذا حدث كذب وإذا عاهد غدر وإذا وعد أخلف وإذا خاصم فجر ‏\"‏ ‏.‏ غير أن في حديث سفيان ‏\"‏ وإن كانت فيه خصلة منهن كانت فيه خصلة من النفاق ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 211,
			"arabicnumber": "59.01",
			"text": "حدثنا يحيى بن أيوب، وقتيبة بن سعيد، - واللفظ ليحيى - قالا حدثنا إسماعيل بن جعفر، قال أخبرني أبو سهيل، نافع بن مالك بن أبي عامر عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ آية المنافق ثلاث إذا حدث كذب وإذا وعد أخلف وإذا ائتمن خان ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 212,
			"arabicnumber": "59.02",
			"text": "حدثنا أبو بكر بن إسحاق، أخبرنا ابن أبي مريم، أخبرنا محمد بن جعفر، قال أخبرني العلاء بن عبد الرحمن بن يعقوب، مولى الحرقة عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من علامات المنافق ثلاثة إذا حدث كذب وإذا وعد أخلف وإذا ائتمن خان ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 213,
			"arabicnumber": "59.03",
			"text": "حدثنا عقبة بن مكرم العمي، حدثنا يحيى بن محمد بن قيس أبو زكير، قال سمعت العلاء بن عبد الرحمن، يحدث بهذا الإسناد وقال ‏ \"‏ آية المنافق ثلاث وإن صام وصلى وزعم أنه مسلم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 214,
			"arabicnumber": "59.04",
			"text": "وحدثني أبو نصر التمار، وعبد الأعلى بن حماد، قالا حدثنا حماد بن سلمة، عن داود بن أبي هند، عن سعيد بن المسيب، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم بمثل حديث يحيى بن محمد عن العلاء ذكر فيه ‏ \"‏ وإن صام وصلى وزعم أنه مسلم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 215,
			"arabicnumber": "60.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، وعبد الله بن نمير، قالا حدثنا عبيد الله بن عمر، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم قال ‏ \"‏ إذا كفر الرجل أخاه فقد باء بها أحدهما ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 216,
			"arabicnumber": "60.02",
			"text": "وحدثنا يحيى بن يحيى التميمي، ويحيى بن أيوب، وقتيبة بن سعيد، وعلي بن حجر، جميعا عن إسماعيل بن جعفر، قال يحيى بن يحيى أخبرنا إسماعيل بن جعفر، عن عبد الله بن دينار، أنه سمع ابن عمر، يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ أيما امرئ قال لأخيه يا كافر ‏.‏ فقد باء بها أحدهما إن كان كما قال وإلا رجعت عليه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 217,
			"arabicnumber": "61",
			"text": "وحدثني زهير بن حرب، حدثنا عبد الصمد بن عبد الوارث، حدثنا أبي، حدثنا حسين المعلم، عن ابن بريدة، عن يحيى بن يعمر، أن أبا الأسود، حدثه عن أبي ذر، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏ \"‏ ليس من رجل ادعى لغير أبيه وهو يعلمه إلا كفر ومن ادعى ما ليس له فليس منا وليتبوأ مقعده من النار ومن دعا رجلا بالكفر أو قال عدو الله ‏.‏ وليس كذلك إلا حار عليه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 218,
			"arabicnumber": "62",
			"text": "حدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، قال أخبرني عمرو، عن جعفر بن ربيعة، عن عراك بن مالك، أنه سمع أبا هريرة، يقول إن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا ترغبوا عن آبائكم فمن رغب عن أبيه فهو كفر ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 219,
			"arabicnumber": "63.01",
			"text": "حدثني عمرو الناقد، حدثنا هشيم بن بشير، أخبرنا خالد، عن أبي عثمان، قال لما ادعي زياد لقيت أبا بكرة فقلت له ما هذا الذي صنعتم إني سمعت سعد بن أبي وقاص يقول سمع أذناى من رسول الله صلى الله عليه وسلم وهو يقول ‏ \"‏ من ادعى أبا في الإسلام غير أبيه يعلم أنه غير أبيه فالجنة عليه حرام ‏\"‏ ‏.‏ فقال أبو بكرة وأنا سمعته من رسول الله صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 220,
			"arabicnumber": "63.02",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن زكرياء بن أبي زائدة، وأبو معاوية عن عاصم، عن أبي عثمان، عن سعد، وأبي، بكرة كلاهما يقول سمعته أذناى، ووعاه، قلبي محمدا صلى الله عليه وسلم يقول ‏ \"‏ من ادعى إلى غير أبيه وهو يعلم أنه غير أبيه فالجنة عليه حرام ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 221,
			"arabicnumber": "64.01",
			"text": "حدثنا محمد بن بكار بن الريان، وعون بن سلام، قالا حدثنا محمد بن طلحة، ح وحدثنا محمد بن المثنى، حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، ح وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، كلهم عن زبيد، عن أبي وائل، عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ سباب المسلم فسوق وقتاله كفر ‏\"‏ ‏.‏ قال زبيد فقلت لأبي وائل أنت سمعته من عبد الله يرويه عن رسول الله صلى الله عليه وسلم قال نعم ‏.‏ وليس في حديث شعبة قول زبيد لأبي وائل ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 222,
			"arabicnumber": "64.02",
			"text": "حدثنا أبو بكر بن أبي شيبة، وابن المثنى، عن محمد بن جعفر، عن شعبة، عن منصور، ح وحدثنا ابن نمير، حدثنا عفان، حدثنا شعبة، عن الأعمش، كلاهما عن أبي وائل، عن عبد الله، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 223,
			"arabicnumber": "65",
			"text": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن المثنى، وابن، بشار جميعا عن محمد بن جعفر، عن شعبة، ح وحدثنا عبيد الله بن معاذ، - واللفظ له - حدثنا أبي، حدثنا شعبة، عن علي بن مدرك، سمع أبا زرعة، يحدث عن جده، جرير قال قال لي النبي صلى الله عليه وسلم في حجة الوداع ‏\"‏ استنصت الناس ‏\"‏ ‏.‏ ثم قال ‏\"‏ لا ترجعوا بعدي كفارا يضرب بعضكم رقاب بعض ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 224,
			"arabicnumber": "66.01",
			"text": "وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن واقد بن محمد، عن أبيه، عن ابن عمر، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 225,
			"arabicnumber": "66.02",
			"text": "وحدثني أبو بكر بن أبي شيبة، وأبو بكر بن خلاد الباهلي قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن واقد بن محمد بن زيد، أنه سمع أباه، يحدث عن عبد الله بن عمر، عن النبي صلى الله عليه وسلم أنه قال في حجة الوداع ‏ \"‏ ويحكم - أو قال ويلكم - لا ترجعوا بعدي كفارا يضرب بعضكم رقاب بعض ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 226,
			"arabicnumber": "66.03",
			"text": "حدثني حرملة بن يحيى، أخبرنا عبد الله بن وهب، قال حدثني عمر بن محمد، أن أباه، حدثه عن ابن عمر، عن النبي صلى الله عليه وسلم بمثل حديث شعبة عن واقد ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 227,
			"arabicnumber": "67",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو معاوية، ح وحدثنا ابن نمير، - واللفظ له - حدثنا أبي ومحمد بن عبيد، كلهم عن الأعمش، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ اثنتان في الناس هما بهم كفر الطعن في النسب والنياحة على الميت ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 228,
			"arabicnumber": "68",
			"text": "حدثنا علي بن حجر السعدي، حدثنا إسماعيل، - يعني ابن علية - عن منصور بن عبد الرحمن، عن الشعبي، عن جرير، أنه سمعه يقول ‏ \"‏ أيما عبد أبق من مواليه فقد كفر حتى يرجع إليهم ‏\"‏ ‏.‏ قال منصور قد والله روي عن النبي صلى الله عليه وسلم ولكني أكره أن يروى عني ها هنا بالبصرة ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 229,
			"arabicnumber": "69",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، عن داود، عن الشعبي، عن جرير، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ أيما عبد أبق فقد برئت منه الذمة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 230,
			"arabicnumber": "70",
			"text": "حدثنا يحيى بن يحيى، أخبرنا جرير، عن مغيرة، عن الشعبي، قال كان جرير بن عبد الله يحدث عن النبي صلى الله عليه وسلم قال ‏ \"‏ إذا أبق العبد لم تقبل له صلاة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 231,
			"arabicnumber": "71",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن صالح بن كيسان، عن عبيد الله بن عبد الله بن عتبة، عن زيد بن خالد الجهني، قال صلى بنا رسول الله صلى الله عليه وسلم صلاة الصبح بالحديبية في إثر السماء كانت من الليل فلما انصرف أقبل على الناس فقال ‏\"‏ هل تدرون ماذا قال ربكم ‏\"‏ ‏.‏ قالوا الله ورسوله أعلم ‏.‏ قال ‏\"‏ قال أصبح من عبادي مؤمن بي وكافر فأما من قال مطرنا بفضل الله ورحمته ‏.‏ فذلك مؤمن بي وكافر بالكوكب وأما من قال مطرنا بنوء كذا وكذا ‏.‏ فذلك كافر بي مؤمن بالكوكب ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 232,
			"arabicnumber": "72.01",
			"text": "حدثني حرملة بن يحيى، وعمرو بن سواد العامري، ومحمد بن سلمة المرادي، قال المرادي حدثنا عبد الله بن وهب، عن يونس، وقال الآخران، أخبرنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، قال حدثني عبيد الله بن عبد الله بن عتبة، أن أبا هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ ألم تروا إلى ما قال ربكم قال ما أنعمت على عبادي من نعمة إلا أصبح فريق منهم بها كافرين ‏.‏ يقولون الكواكب وبالكواكب ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 233,
			"arabicnumber": "72.02",
			"text": "وحدثني محمد بن سلمة المرادي، حدثنا عبد الله بن وهب، عن عمرو بن الحارث، ح وحدثني عمرو بن سواد، أخبرنا عبد الله بن وهب، أخبرنا عمرو بن الحارث، أن أبا يونس، مولى أبي هريرة حدثه عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما أنزل الله من السماء من بركة إلا أصبح فريق من الناس بها كافرين ينزل الله الغيث فيقولون الكوكب كذا وكذا ‏\"‏ وفي حديث المرادي ‏\"‏ بكوكب كذا وكذا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 234,
			"arabicnumber": "73",
			"text": "وحدثني عباس بن عبد العظيم العنبري، حدثنا النضر بن محمد، حدثنا عكرمة، - وهو ابن عمار - حدثنا أبو زميل، قال حدثني ابن عباس، قال مطر الناس على عهد النبي صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم ‏\"‏ أصبح من الناس شاكر ومنهم كافر قالوا هذه رحمة الله ‏.‏ وقال بعضهم لقد صدق نوء كذا وكذا ‏\"‏ ‏.‏ قال فنزلت هذه الآية ‏{‏ فلا أقسم بمواقع النجوم‏}‏ حتى بلغ ‏{‏ وتجعلون رزقكم أنكم تكذبون‏{‏}",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 235,
			"arabicnumber": "74.01",
			"text": "حدثنا محمد بن المثنى، حدثنا عبد الرحمن بن مهدي، عن شعبة، عن عبد الله بن عبد الله بن جبر، قال سمعت أنسا، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ آية المنافق بغض الأنصار وآية المؤمن حب الأنصار ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 236,
			"arabicnumber": "74.02",
			"text": "حدثنا يحيى بن حبيب الحارثي، حدثنا خالد، - يعني ابن الحارث - حدثنا شعبة، عن عبد الله بن عبد الله، عن أنس، عن النبي صلى الله عليه وسلم أنه قال ‏ \"‏ حب الأنصار آية الإيمان وبغضهم آية النفاق ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 237,
			"arabicnumber": "75",
			"text": "وحدثني زهير بن حرب، قال حدثني معاذ بن معاذ، ح وحدثنا عبيد الله بن معاذ، - واللفظ له - حدثنا أبي، حدثنا شعبة، عن عدي بن ثابت، قال سمعت البراء، يحدث عن النبي صلى الله عليه وسلم أنه قال في الأنصار ‏ \"‏ لا يحبهم إلا مؤمن ولا يبغضهم إلا منافق من أحبهم أحبه الله ومن أبغضهم أبغضه الله ‏\"‏ ‏.‏ قال شعبة قلت لعدي سمعته من البراء قال إياى حدث ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 238,
			"arabicnumber": "76",
			"text": "حدثنا قتيبة بن سعيد، حدثنا يعقوب، - يعني ابن عبد الرحمن القاري - عن سهيل، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا يبغض الأنصار رجل يؤمن بالله واليوم الآخر ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 239,
			"arabicnumber": "77",
			"text": "وحدثنا عثمان بن محمد بن أبي شيبة، حدثنا جرير، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، كلاهما عن الأعمش، عن أبي صالح، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا يبغض الأنصار رجل يؤمن بالله واليوم الآخر ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 240,
			"arabicnumber": "78",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، وأبو معاوية عن الأعمش، ح وحدثنا يحيى بن يحيى، - واللفظ له - أخبرنا أبو معاوية، عن الأعمش، عن عدي بن ثابت، عن زر، قال قال علي والذي فلق الحبة وبرأ النسمة إنه لعهد النبي الأمي صلى الله عليه وسلم إلى أن لا يحبني إلا مؤمن ولا يبغضني إلا منافق ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 241,
			"arabicnumber": "79.01",
			"text": "حدثنا محمد بن رمح بن المهاجر المصري، أخبرنا الليث، عن ابن الهاد، عن عبد الله بن دينار، عن عبد الله بن عمر، عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ يا معشر النساء تصدقن وأكثرن الاستغفار فإني رأيتكن أكثر أهل النار ‏\"‏ ‏.‏ فقالت امرأة منهن جزلة وما لنا يا رسول الله أكثر أهل النار ‏.‏ قال ‏\"‏ تكثرن اللعن وتكفرن العشير وما رأيت من ناقصات عقل ودين أغلب لذي لب منكن ‏\"‏ ‏.‏ قالت يا رسول الله وما نقصان العقل والدين قال ‏\"‏ أما نقصان العقل فشهادة امرأتين تعدل شهادة رجل فهذا نقصان العقل وتمكث الليالي ما تصلي وتفطر في رمضان فهذا نقصان الدين ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 242,
			"arabicnumber": "79.02",
			"text": "وحدثنيه أبو الطاهر، أخبرنا ابن وهب، عن بكر بن مضر، عن ابن الهاد، بهذا الإسناد مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 243,
			"arabicnumber": "80.01",
			"text": "وحدثني الحسن بن علي الحلواني، وأبو بكر بن إسحاق قالا حدثنا ابن أبي مريم، أخبرنا محمد بن جعفر، قال أخبرني زيد بن أسلم، عن عياض بن عبد الله، عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم ح",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 244,
			"arabicnumber": "81.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، عن الأعمش، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا قرأ ابن آدم السجدة فسجد اعتزل الشيطان يبكي يقول يا ويله - وفي رواية أبي كريب يا ويلي - أمر ابن آدم بالسجود فسجد فله الجنة وأمرت بالسجود فأبيت فلي النار ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 245,
			"arabicnumber": "81.02",
			"text": "حدثني زهير بن حرب، حدثنا وكيع، حدثنا الأعمش، بهذا الإسناد مثله غير أنه قال ‏ \"‏ فعصيت فلي النار ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 246,
			"arabicnumber": "82.01",
			"text": "حدثنا يحيى بن يحيى التميمي، وعثمان بن أبي شيبة، كلاهما عن جرير، قال يحيى أخبرنا جرير، عن الأعمش، عن أبي سفيان، قال سمعت جابرا، يقول سمعت النبي صلى الله عليه وسلم يقول ‏ \"‏ إن بين الرجل وبين الشرك والكفر ترك الصلاة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 247,
			"arabicnumber": "82.02",
			"text": "حدثنا أبو غسان المسمعي، حدثنا الضحاك بن مخلد، عن ابن جريج، قال أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ بين الرجل وبين الشرك والكفر ترك الصلاة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 249,
			"arabicnumber": "83",
			"text": "وحدثنا منصور بن أبي مزاحم، حدثنا إبراهيم بن سعد، ح وحدثني محمد بن جعفر بن زياد، أخبرنا إبراهيم، - يعني ابن سعد - عن ابن شهاب، عن سعيد بن المسيب، عن أبي هريرة، قال سئل رسول الله صلى الله عليه وسلم أى الأعمال أفضل قال ‏\"‏ إيمان بالله ‏\"‏ ‏.‏ قال ثم ماذا قال ‏\"‏ الجهاد في سبيل الله ‏\"‏ ‏.‏ قال ثم ماذا قال ‏\"‏ حج مبرور ‏\"‏ ‏.‏ وفي رواية محمد بن جعفر قال ‏\"‏ إيمان بالله ورسوله ‏\"‏ ‏.‏ وحدثنيه محمد بن رافع، وعبد بن حميد، عن عبد الرزاق، أخبرنا معمر، عن الزهري، بهذا الإسناد مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 250,
			"arabicnumber": "84.01",
			"text": "حدثني أبو الربيع الزهراني، حدثنا حماد بن زيد، حدثنا هشام بن عروة، ح وحدثنا خلف بن هشام، - واللفظ له - حدثنا حماد بن زيد، عن هشام بن عروة، عن أبيه، عن أبي مراوح الليثي، عن أبي ذر، قال قلت يا رسول الله أى الأعمال أفضل قال ‏\"‏ الإيمان بالله والجهاد في سبيله ‏\"‏ ‏.‏ قال قلت أى الرقاب أفضل قال ‏\"‏ أنفسها عند أهلها وأكثرها ثمنا ‏\"‏ ‏.‏ قال قلت فإن لم أفعل قال ‏\"‏ تعين صانعا أو تصنع لأخرق ‏\"‏ ‏.‏ قال قلت يا رسول الله أرأيت إن ضعفت عن بعض العمل قال ‏\"‏ تكف شرك عن الناس فإنها صدقة منك على نفسك ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 251,
			"arabicnumber": "84.02",
			"text": "حدثنا محمد بن رافع، وعبد بن حميد، قال عبد أخبرنا وقال ابن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن حبيب، مولى عروة بن الزبير عن عروة بن الزبير، عن أبي مراوح، عن أبي ذر، عن النبي صلى الله عليه وسلم بنحوه غير أنه قال ‏ \"‏ فتعين الصانع أو تصنع لأخرق ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 252,
			"arabicnumber": "85.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن الشيباني، عن الوليد بن العيزار، عن سعد بن إياس أبي عمرو الشيباني، عن عبد الله بن مسعود، قال سألت رسول الله صلى الله عليه وسلم أى العمل أفضل قال ‏\"‏ الصلاة لوقتها ‏\"‏ ‏.‏ قال قلت ثم أى قال ‏\"‏ بر الوالدين ‏\"‏ ‏.‏ قال قلت ثم أى قال ‏\"‏ الجهاد في سبيل الله ‏\"‏ ‏.‏ فما تركت أستزيده إلا إرعاء عليه ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 253,
			"arabicnumber": "85.02",
			"text": "حدثنا محمد بن أبي عمر المكي، حدثنا مروان الفزاري، حدثنا أبو يعفور، عن الوليد بن العيزار، عن أبي عمرو الشيباني، عن عبد الله بن مسعود، قال قلت يا نبي الله أى الأعمال أقرب إلى الجنة قال ‏\"‏ الصلاة على مواقيتها ‏\"‏ ‏.‏ قلت وماذا يا نبي الله قال ‏\"‏ بر الوالدين ‏\"‏ ‏.‏ قلت وماذا يا نبي الله قال ‏\"‏ الجهاد في سبيل الله ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 254,
			"arabicnumber": "85.03",
			"text": "وحدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن الوليد بن العيزار، أنه سمع أبا عمرو الشيباني، قال حدثني صاحب، هذه الدار - وأشار إلى دار عبد الله - قال سألت رسول الله صلى الله عليه وسلم أى الأعمال أحب إلى الله قال ‏\"‏ الصلاة على وقتها ‏\"‏ ‏.‏ قلت ثم أى قال ‏\"‏ ثم بر الوالدين ‏\"‏ ‏.‏ قلت ثم أى قال ‏\"‏ ثم الجهاد في سبيل الله ‏\"‏ قال حدثني بهن ولو استزدته لزادني ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 255,
			"arabicnumber": "85.04",
			"text": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، بهذا الإسناد مثله ‏.‏ وزاد وأشار إلى دار عبد الله وما سماه لنا ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 256,
			"arabicnumber": "85.05",
			"text": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن الحسن بن عبيد الله، عن أبي عمرو الشيباني، عن عبد الله، عن النبي صلى الله عليه وسلم قال ‏ \"‏ أفضل الأعمال - أو العمل - الصلاة لوقتها وبر الوالدين ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 257,
			"arabicnumber": "86.01",
			"text": "حدثنا عثمان بن أبي شيبة، وإسحاق بن إبراهيم، قال إسحاق أخبرنا جرير، وقال، عثمان حدثنا جرير، عن منصور، عن أبي وائل، عن عمرو بن شرحبيل، عن عبد الله، قال سألت رسول الله صلى الله عليه وسلم أى الذنب أعظم عند الله قال ‏\"‏ أن تجعل لله ندا وهو خلقك ‏\"‏ ‏.‏ قال قلت له إن ذلك لعظيم ‏.‏ قال قلت ثم أى قال ‏\"‏ ثم أن تقتل ولدك مخافة أن يطعم معك ‏\"‏ ‏.‏ قال قلت ثم أى قال ‏\"‏ ثم أن تزاني حليلة جارك ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 258,
			"arabicnumber": "86.02",
			"text": "حدثنا عثمان بن أبي شيبة، وإسحاق بن إبراهيم، جميعا عن جرير، قال عثمان حدثنا جرير، عن الأعمش، عن أبي وائل، عن عمرو بن شرحبيل، قال قال عبد الله قال رجل يا رسول الله أى الذنب أكبر عند الله قال ‏\"‏ أن تدعو لله ندا وهو خلقك ‏\"‏ ‏.‏ قال ثم أى قال ‏\"‏ أن تقتل ولدك مخافة أن يطعم معك ‏\"‏ ‏.‏ قال ثم أى قال ‏\"‏ أن تزاني حليلة جارك ‏\"‏ فأنزل الله عز وجل تصديقها ‏{‏ والذين لا يدعون مع الله إلها آخر ولا يقتلون النفس التي حرم الله إلا بالحق ولا يزنون ومن يفعل ذلك يلق أثاما‏}‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 259,
			"arabicnumber": "87",
			"text": "حدثني عمرو بن محمد بن بكير بن محمد الناقد، حدثنا إسماعيل ابن علية، عن سعيد الجريري، حدثنا عبد الرحمن بن أبي بكرة، عن أبيه، قال كنا عند رسول الله صلى الله عليه وسلم فقال ‏ \"‏ ألا أنبئكم بأكبر الكبائر - ثلاثا - الإشراك بالله وعقوق الوالدين وشهادة الزور أو قول الزور ‏\"‏ ‏.‏ وكان رسول الله صلى الله عليه وسلم متكئا فجلس فمازال يكررها حتى قلنا ليته سكت ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 260,
			"arabicnumber": "88.01",
			"text": "وحدثني يحيى بن حبيب الحارثي، حدثنا خالد، - وهو ابن الحارث - حدثنا شعبة، أخبرنا عبيد الله بن أبي بكر، عن أنس، عن النبي صلى الله عليه وسلم في الكبائر قال ‏ \"‏ الشرك بالله وعقوق الوالدين وقتل النفس وقول الزور ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 261,
			"arabicnumber": "88.02",
			"text": "وحدثنا محمد بن الوليد بن عبد الحميد، حدثنا محمد بن جعفر، حدثنا شعبة، قال حدثني عبيد الله بن أبي بكر، قال سمعت أنس بن مالك، قال ذكر رسول الله صلى الله عليه وسلم الكبائر - أو سئل عن الكبائر - فقال ‏\"‏ الشرك بالله وقتل النفس وعقوق الوالدين ‏\"‏ ‏.‏ وقال ‏\"‏ ألا أنبئكم بأكبر الكبائر ‏\"‏ ‏.‏ قال ‏\"‏ قول الزور ‏\"‏ ‏.‏ أو قال ‏\"‏ شهادة الزور ‏\"‏ ‏.‏ قال شعبة وأكبر ظني أنه شهادة الزور ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 262,
			"arabicnumber": "89",
			"text": "حدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، قال حدثني سليمان بن بلال، عن ثور بن زيد، عن أبي الغيث، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ اجتنبوا السبع الموبقات ‏\"‏ ‏.‏ قيل يا رسول الله وما هن قال ‏\"‏ الشرك بالله والسحر وقتل النفس التي حرم الله إلا بالحق وأكل مال اليتيم وأكل الربا والتولي يوم الزحف وقذف المحصنات الغافلات المؤمنات ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 263,
			"arabicnumber": "90.01",
			"text": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن ابن الهاد، عن سعد بن إبراهيم، عن حميد بن عبد الرحمن، عن عبد الله بن عمرو بن العاص، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من الكبائر شتم الرجل والديه ‏\"‏ ‏.‏ قالوا يا رسول الله هل يشتم الرجل والديه قال ‏\"‏ نعم يسب أبا الرجل فيسب أباه ويسب أمه فيسب أمه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 264,
			"arabicnumber": "90.02",
			"text": "وحدثنا أبو بكر بن أبي شيبة، ومحمد بن المثنى، وابن، بشار جميعا عن محمد بن جعفر، عن شعبة، ح وحدثني محمد بن حاتم، حدثنا يحيى بن سعيد، حدثنا سفيان، كلاهما عن سعد بن إبراهيم، بهذا الإسناد مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 265,
			"arabicnumber": "91.01",
			"text": "وحدثنا محمد بن المثنى، ومحمد بن بشار، وإبراهيم بن دينار، جميعا عن يحيى بن حماد، - قال ابن المثنى حدثني يحيى بن حماد، - أخبرنا شعبة، عن أبان بن تغلب، عن فضيل الفقيمي، عن إبراهيم النخعي، عن علقمة، عن عبد الله بن مسعود، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يدخل الجنة من كان في قلبه مثقال ذرة من كبر ‏\"‏ ‏.‏ قال رجل إن الرجل يحب أن يكون ثوبه حسنا ونعله حسنة ‏.‏ قال ‏\"‏ إن الله جميل يحب الجمال الكبر بطر الحق وغمط الناس ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 266,
			"arabicnumber": "91.02",
			"text": "حدثنا منجاب بن الحارث التميمي، وسويد بن سعيد، كلاهما عن علي بن مسهر، - قال منجاب أخبرنا ابن مسهر، - عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا يدخل النار أحد في قلبه مثقال حبة خردل من إيمان ولا يدخل الجنة أحد في قلبه مثقال حبة خردل من كبرياء ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 267,
			"arabicnumber": "91.03",
			"text": "وحدثنا محمد بن بشار، حدثنا أبو داود، حدثنا شعبة، عن أبان بن تغلب، عن فضيل، عن إبراهيم، عن علقمة، عن عبد الله، عن النبي صلى الله عليه وسلم قال ‏ \"‏ لا يدخل الجنة من كان في قلبه مثقال ذرة من كبر ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 268,
			"arabicnumber": "92",
			"text": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي ووكيع، عن الأعمش، عن شقيق، عن عبد الله، قال وكيع قال رسول الله صلى الله عليه وسلم وقال ابن نمير سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ من مات يشرك بالله شيئا دخل النار ‏\"‏ ‏.‏ وقلت أنا ومن مات لا يشرك بالله شيئا دخل الجنة ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 269,
			"arabicnumber": "93.01",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، عن الأعمش، عن أبي سفيان، عن جابر، قال أتى النبي صلى الله عليه وسلم رجل فقال يا رسول الله ما الموجبتان فقال ‏ \"‏ من مات لا يشرك بالله شيئا دخل الجنة ومن مات يشرك بالله شيئا دخل النار ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 270,
			"arabicnumber": "93.02",
			"text": "وحدثني أبو أيوب الغيلاني، سليمان بن عبيد الله وحجاج بن الشاعر قالا حدثنا عبد الملك بن عمرو، حدثنا قرة، عن أبي الزبير، حدثنا جابر بن عبد الله، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ من لقي الله لا يشرك به شيئا دخل الجنة ومن لقيه يشرك به دخل النار ‏\"‏ ‏.‏ قال أبو أيوب قال أبو الزبير عن جابر ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 271,
			"arabicnumber": "93.03",
			"text": "وحدثني إسحاق بن منصور، أخبرنا معاذ، - وهو ابن هشام - قال حدثني أبي، عن أبي الزبير، عن جابر، أن نبي الله صلى الله عليه وسلم قال بمثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 272,
			"arabicnumber": "94.01",
			"text": "وحدثنا محمد بن المثنى، وابن، بشار قال ابن المثنى حدثنا محمد بن جعفر، حدثنا شعبة، عن واصل الأحدب، عن المعرور بن سويد، قال سمعت أبا ذر، يحدث عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ أتاني جبريل - عليه السلام - فبشرني أنه من مات من أمتك لا يشرك بالله شيئا دخل الجنة ‏\"‏ ‏.‏ قلت وإن زنى وإن سرق ‏.‏ قال ‏\"‏ وإن زنى وإن سرق ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 273,
			"arabicnumber": "94.02",
			"text": "حدثني زهير بن حرب، وأحمد بن خراش، قالا حدثنا عبد الصمد بن عبد الوارث، حدثنا أبي قال، حدثني حسين المعلم، عن ابن بريدة، أن يحيى بن يعمر، حدثه أن أبا الأسود الديلي حدثه أن أبا ذر حدثه قال أتيت النبي صلى الله عليه وسلم وهو نائم عليه ثوب أبيض ثم أتيته فإذا هو نائم ثم أتيته وقد استيقظ فجلست إليه فقال ‏\"‏ ما من عبد قال لا إله إلا الله ثم مات على ذلك إلا دخل الجنة ‏\"‏ ‏.‏ قلت وإن زنى وإن سرق قال ‏\"‏ وإن زنى وإن سرق ‏\"‏ ‏.‏ قلت وإن زنى وإن سرق قال ‏\"‏ وإن زنى وإن سرق ‏\"‏ ‏.‏ ثلاثا ثم قال في الرابعة ‏\"‏ على رغم أنف أبي ذر ‏\"‏ قال فخرج أبو ذر وهو يقول وإن رغم أنف أبي ذر ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 274,
			"arabicnumber": "95.01",
			"text": "حدثنا قتيبة بن سعيد، حدثنا ليث، ح وحدثنا محمد بن رمح، - واللفظ متقارب - أخبرنا الليث، عن ابن شهاب، عن عطاء بن يزيد الليثي، عن عبيد الله بن عدي بن الخيار، عن المقداد بن الأسود، أنه أخبره أنه، قال يا رسول الله أرأيت إن لقيت رجلا من الكفار فقاتلني فضرب إحدى يدى بالسيف فقطعها ‏.‏ ثم لاذ مني بشجرة فقال أسلمت لله ‏.‏ أفأقتله يا رسول الله بعد أن قالها قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقتله ‏\"‏ ‏.‏ قال فقلت يا رسول الله إنه قد قطع يدي ثم قال ذلك بعد أن قطعها أفأقتله قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقتله فإن قتلته فإنه بمنزلتك قبل أن تقتله وإنك بمنزلته قبل أن يقول كلمته التي قال ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 275,
			"arabicnumber": "95.02",
			"text": "حدثنا إسحاق بن إبراهيم، وعبد بن حميد، قالا أخبرنا عبد الرزاق، قال أخبرنا معمر، ح وحدثنا إسحاق بن موسى الأنصاري، حدثنا الوليد بن مسلم، عن الأوزاعي، ح وحدثنا محمد بن رافع، حدثنا عبد الرزاق، أخبرنا ابن جريج، جميعا عن الزهري، بهذا الإسناد أما الأوزاعي وابن جريج ففي حديثهما قال أسلمت لله ‏.‏ كما قال الليث في حديثه ‏.‏ وأما معمر ففي حديثه فلما أهويت لأقتله قال لا إله إلا الله ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 276,
			"arabicnumber": "95.03",
			"text": "وحدثني حرملة بن يحيى، أخبرنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، قال حدثني عطاء بن يزيد الليثي، ثم الجندعي أن عبيد، الله بن عدي بن الخيار أخبره أن المقداد بن عمرو بن الأسود الكندي - وكان حليفا لبني زهرة وكان ممن شهد بدرا مع رسول الله صلى الله عليه وسلم - أنه قال يا رسول الله أرأيت إن لقيت رجلا من الكفار ثم ذكر بمثل حديث الليث ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 277,
			"arabicnumber": "96.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، ح وحدثنا أبو كريب، وإسحاق بن إبراهيم، عن أبي معاوية، كلاهما عن الأعمش، عن أبي ظبيان، عن أسامة بن زيد، وهذا، حديث ابن أبي شيبة قال بعثنا رسول الله صلى الله عليه وسلم في سرية فصبحنا الحرقات من جهينة فأدركت رجلا فقال لا إله إلا الله ‏.‏ فطعنته فوقع في نفسي من ذلك فذكرته للنبي صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ أقال لا إله إلا الله وقتلته ‏\"‏ ‏.‏ قال قلت يا رسول الله إنما قالها خوفا من السلاح ‏.‏ قال ‏\"‏ أفلا شققت عن قلبه حتى تعلم أقالها أم لا ‏\"‏ ‏.‏ فمازال يكررها على حتى تمنيت أني أسلمت يومئذ ‏.‏ قال فقال سعد وأنا والله لا أقتل مسلما حتى يقتله ذو البطين ‏.‏ يعني أسامة قال قال رجل ألم يقل الله ‏{‏ وقاتلوهم حتى لا تكون فتنة ويكون الدين كله لله‏}‏ فقال سعد قد قاتلنا حتى لا تكون فتنة وأنت وأصحابك تريدون أن تقاتلوا حتى تكون فتنة ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 278,
			"arabicnumber": "96.02",
			"text": "حدثنا يعقوب الدورقي، حدثنا هشيم، أخبرنا حصين، حدثنا أبو ظبيان، قال سمعت أسامة بن زيد بن حارثة، يحدث قال بعثنا رسول الله صلى الله عليه وسلم إلى الحرقة من جهينة فصبحنا القوم فهزمناهم ولحقت أنا ورجل من الأنصار رجلا منهم فلما غشيناه قال لا إله إلا الله ‏.‏ فكف عنه الأنصاري وطعنته برمحي حتى قتلته ‏.‏ قال فلما قدمنا بلغ ذلك النبي صلى الله عليه وسلم فقال لي ‏\"‏ يا أسامة أقتلته بعد ما قال لا إله إلا الله ‏\"‏ ‏.‏ قال قلت يا رسول الله إنما كان متعوذا ‏.‏ قال فقال ‏\"‏ أقتلته بعد ما قال لا إله إلا الله ‏\"‏ ‏.‏ قال فمازال يكررها على حتى تمنيت أني لم أكن أسلمت قبل ذلك اليوم ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 279,
			"arabicnumber": "97",
			"text": "حدثنا أحمد بن الحسن بن خراش، حدثنا عمرو بن عاصم، حدثنا معتمر، قال سمعت أبي يحدث، أن خالدا الأثبج ابن أخي، صفوان بن محرز حدث عن صفوان بن محرز، أنه حدث أن جندب بن عبد الله البجلي بعث إلى عسعس بن سلامة زمن فتنة ابن الزبير فقال اجمع لي نفرا من إخوانك حتى أحدثهم ‏.‏ فبعث رسولا إليهم فلما اجتمعوا جاء جندب وعليه برنس أصفر فقال تحدثوا بما كنتم تحدثون به ‏.‏ حتى دار الحديث فلما دار الحديث إليه حسر البرنس عن رأسه فقال إني أتيتكم ولا أريد أن أخبركم عن نبيكم إن رسول الله صلى الله عليه وسلم بعث بعثا من المسلمين إلى قوم من المشركين وإنهم التقوا فكان رجل من المشركين إذا شاء أن يقصد إلى رجل من المسلمين قصد له فقتله وإن رجلا من المسلمين قصد غفلته قال وكنا نحدث أنه أسامة بن زيد فلما رفع عليه السيف قال لا إله إلا الله ‏.‏ فقتله فجاء البشير إلى النبي صلى الله عليه وسلم فسأله فأخبره حتى أخبره خبر الرجل كيف صنع فدعاه فسأله فقال ‏\"‏ لم قتلته ‏\"‏ ‏.‏ قال يا رسول الله أوجع في المسلمين وقتل فلانا وفلانا - وسمى له نفرا - وإني حملت عليه فلما رأى السيف قال لا إله إلا الله ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ أقتلته ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ فكيف تصنع بلا إله إلا الله إذا جاءت يوم القيامة ‏\"‏ ‏.‏ قال يا رسول الله استغفر لي ‏.‏ قال ‏\"‏ وكيف تصنع بلا إله إلا الله إذا جاءت يوم القيامة ‏\"‏ ‏.‏ قال فجعل لا يزيده على أن يقول ‏\"‏ كيف تصنع بلا إله إلا الله إذا جاءت يوم القيامة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 280,
			"arabicnumber": "98",
			"text": "حدثني زهير بن حرب، ومحمد بن المثنى، قالا حدثنا يحيى، - وهو القطان - ح وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، وابن، نمير كلهم عن عبيد الله، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم ح وحدثنا يحيى بن يحيى، - واللفظ له - قال قرأت على مالك عن نافع عن ابن عمر أن النبي صلى الله عليه وسلم قال ‏ \"‏ من حمل علينا السلاح فليس منا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 281,
			"arabicnumber": "99",
			"text": "حدثنا أبو بكر بن أبي شيبة، وابن، نمير قالا حدثنا مصعب، - وهو ابن المقدام - حدثنا عكرمة بن عمار، عن إياس بن سلمة، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏ \"‏ من سل علينا السيف فليس منا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 187
			}
		},
		{
			"hadithnumber": 282,
			"arabicnumber": "100",
			"text": "حدثنا أبو بكر بن أبي شيبة، وعبد الله بن براد الأشعري، وأبو كريب قالوا حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏ \"‏ من حمل علينا السلاح فليس منا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 188
			}
		},
		{
			"hadithnumber": 283,
			"arabicnumber": "101",
			"text": "حدثنا قتيبة بن سعيد، حدثنا يعقوب، - وهو ابن عبد الرحمن القاري ح وحدثنا أبو الأحوص، محمد بن حيان حدثنا ابن أبي حازم، كلاهما عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من حمل علينا السلاح فليس منا ومن غشنا فليس منا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 189
			}
		},
		{
			"hadithnumber": 284,
			"arabicnumber": "102",
			"text": "وحدثني يحيى بن أيوب، وقتيبة، وابن، حجر جميعا عن إسماعيل بن جعفر، - قال ابن أيوب حدثنا إسماعيل، - قال أخبرني العلاء، عن أبيه، عن أبي هريرة، ‏.‏ أن رسول الله صلى الله عليه وسلم مر على صبرة طعام فأدخل يده فيها فنالت أصابعه بللا فقال ‏\"‏ ما هذا يا صاحب الطعام ‏\"‏ ‏.‏ قال أصابته السماء يا رسول الله ‏.‏ قال ‏\"‏ أفلا جعلته فوق الطعام كى يراه الناس من غش فليس مني ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 190
			}
		},
		{
			"hadithnumber": 285,
			"arabicnumber": "103.01",
			"text": "حدثنا يحيى بن يحيى، أخبرنا أبو معاوية، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو معاوية، ووكيع، ح وحدثنا ابن نمير، حدثنا أبي جميعا، عن الأعمش، عن عبد الله بن مرة، عن مسروق، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ليس منا من ضرب الخدود أو شق الجيوب أو دعا بدعوى الجاهلية ‏\"‏ ‏.‏ هذا حديث يحيى وأما ابن نمير وأبو بكر فقالا ‏\"‏ وشق ودعا ‏\"‏ بغير ألف ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 191
			}
		},
		{
			"hadithnumber": 286,
			"arabicnumber": "103.02",
			"text": "وحدثنا عثمان بن أبي شيبة، حدثنا جرير، ح وحدثنا إسحاق بن إبراهيم، وعلي بن خشرم، قالا حدثنا عيسى بن يونس، جميعا عن الأعمش، بهذا الإسناد وقالا ‏ \"‏ وشق ودعا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 192
			}
		},
		{
			"hadithnumber": 287,
			"arabicnumber": "104.01",
			"text": "حدثنا الحكم بن موسى القنطري، حدثنا يحيى بن حمزة، عن عبد الرحمن بن يزيد بن جابر، أن القاسم بن مخيمرة، حدثه قال حدثني أبو بردة بن أبي موسى، قال وجع أبو موسى وجعا فغشي عليه ورأسه في حجر امرأة من أهله فصاحت امرأة من أهله فلم يستطع أن يرد عليها شيئا فلما أفاق قال أنا بريء مما برئ منه رسول الله صلى الله عليه وسلم فإن رسول الله صلى الله عليه وسلم برئ من الصالقة والحالقة والشاقة ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 193
			}
		},
		{
			"hadithnumber": 288,
			"arabicnumber": "104.02",
			"text": "حدثنا عبد بن حميد، وإسحاق بن منصور، قالا أخبرنا جعفر بن عون، أخبرنا أبو عميس، قال سمعت أبا صخرة، يذكر عن عبد الرحمن بن يزيد، وأبي، بردة بن أبي موسى قالا أغمي على أبي موسى وأقبلت امرأته أم عبد الله تصيح برنة ‏.‏ قالا ثم أفاق قال ألم تعلمي - وكان يحدثها - أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ أنا بريء ممن حلق وسلق وخرق ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 194
			}
		},
		{
			"hadithnumber": 289,
			"arabicnumber": "104.03",
			"text": "حدثنا عبد الله بن مطيع، حدثنا هشيم، عن حصين، عن عياض الأشعري، عن امرأة أبي موسى، عن أبي موسى، عن النبي صلى الله عليه وسلم ح وحدثنيه حجاج بن الشاعر، حدثنا عبد الصمد، قال حدثني أبي، حدثنا داود، - يعني ابن أبي هند - حدثنا عاصم، عن صفوان بن محرز، عن أبي موسى، عن النبي صلى الله عليه وسلم ح وحدثني الحسن بن علي الحلواني، حدثنا عبد الصمد، أخبرنا شعبة، عن عبد الملك بن عمير، عن ربعي بن حراش، عن أبي موسى، عن النبي صلى الله عليه وسلم بهذا الحديث ‏.‏ غير أن في حديث عياض الأشعري قال ‏\"‏ ليس منا ‏\"‏ ‏.‏ ولم يقل ‏\"‏ بريء ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 195
			}
		},
		{
			"hadithnumber": 290,
			"arabicnumber": "105.01",
			"text": "وحدثني شيبان بن فروخ، وعبد الله بن محمد بن أسماء الضبعي، قالا حدثنا مهدي، - وهو ابن ميمون - حدثنا واصل الأحدب، عن أبي وائل، عن حذيفة، أنه بلغه أن رجلا، ينم الحديث فقال حذيفة سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ لا يدخل الجنة نمام ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 196
			}
		},
		{
			"hadithnumber": 291,
			"arabicnumber": "105.02",
			"text": "حدثنا علي بن حجر السعدي، وإسحاق بن إبراهيم، قال إسحاق أخبرنا جرير، عن منصور، عن إبراهيم، عن همام بن الحارث، قال كان رجل ينقل الحديث إلى الأمير فكنا جلوسا في المسجد فقال القوم هذا ممن ينقل الحديث إلى الأمير ‏.‏ قال فجاء حتى جلس إلينا ‏.‏ فقال حذيفة سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ لا يدخل الجنة قتات ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 197
			}
		},
		{
			"hadithnumber": 292,
			"arabicnumber": "105.03",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو معاوية، ووكيع، عن الأعمش، ح وحدثنا منجاب بن الحارث التميمي، - واللفظ له - أخبرنا ابن مسهر، عن الأعمش، عن إبراهيم، عن همام بن الحارث، قال كنا جلوسا مع حذيفة في المسجد فجاء رجل حتى جلس إلينا فقيل لحذيفة إن هذا يرفع إلى السلطان أشياء ‏.‏ فقال حذيفة - إرادة أن يسمعه - سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ لا يدخل الجنة قتات ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 198
			}
		},
		{
			"hadithnumber": 293,
			"arabicnumber": "106.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن المثنى، وابن، بشار قالوا حدثنا محمد بن جعفر، عن شعبة، عن علي بن مدرك، عن أبي زرعة، عن خرشة بن الحر، عن أبي ذر، عن النبي صلى الله عليه وسلم قال ‏\"‏ ثلاثة لا يكلمهم الله يوم القيامة ولا ينظر إليهم ولا يزكيهم ولهم عذاب أليم ‏\"‏ قال فقرأها رسول الله صلى الله عليه وسلم ثلاث مرار ‏.‏ قال أبو ذر خابوا وخسروا من هم يا رسول الله قال ‏\"‏ المسبل والمنان والمنفق سلعته بالحلف الكاذب ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 199
			}
		},
		{
			"hadithnumber": 294,
			"arabicnumber": "106.02",
			"text": "وحدثني أبو بكر بن خلاد الباهلي، حدثنا يحيى، - وهو القطان - حدثنا سفيان، حدثنا سليمان الأعمش، عن سليمان بن مسهر، عن خرشة بن الحر، عن أبي ذر، عن النبي صلى الله عليه وسلم قال ‏ \"‏ ثلاثة لا يكلمهم الله يوم القيامة المنان الذي لا يعطي شيئا إلا منه والمنفق سلعته بالحلف الفاجر والمسبل إزاره ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 200
			}
		},
		{
			"hadithnumber": 295,
			"arabicnumber": "106.03",
			"text": "وحدثنيه بشر بن خالد، حدثنا محمد، - يعني ابن جعفر - عن شعبة، قال سمعت سليمان، بهذا الإسناد وقال ‏ \"‏ ثلاثة لا يكلمهم الله ولا ينظر إليهم ولا يزكيهم ولهم عذاب أليم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 201
			}
		},
		{
			"hadithnumber": 296,
			"arabicnumber": "107",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، وأبو معاوية عن الأعمش، عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ ثلاثة لا يكلمهم الله يوم القيامة ولا يزكيهم - قال أبو معاوية ولا ينظر إليهم - ولهم عذاب أليم شيخ زان وملك كذاب وعائل مستكبر ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 202
			}
		},
		{
			"hadithnumber": 297,
			"arabicnumber": "108.01",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، عن الأعمش، عن أبي صالح، عن أبي هريرة، - وهذا حديث أبي بكر - قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ ثلاث لا يكلمهم الله يوم القيامة ولا ينظر إليهم ولا يزكيهم ولهم عذاب أليم رجل على فضل ماء بالفلاة يمنعه من ابن السبيل ورجل بايع رجلا بسلعة بعد العصر فحلف له بالله لأخذها بكذا وكذا فصدقه وهو على غير ذلك ورجل بايع إماما لا يبايعه إلا لدنيا فإن أعطاه منها وفى وإن لم يعطه منها لم يف ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 203
			}
		},
		{
			"hadithnumber": 298,
			"arabicnumber": "108.02",
			"text": "وحدثني زهير بن حرب، حدثنا جرير، ح وحدثنا سعيد بن عمرو الأشعثي، أخبرنا عبثر، كلاهما عن الأعمش، بهذا الإسناد مثله غير أن في حديث جرير ‏ \"‏ ورجل ساوم رجلا بسلعة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 204
			}
		},
		{
			"hadithnumber": 299,
			"arabicnumber": "108.03",
			"text": "وحدثني عمرو الناقد، حدثنا سفيان، عن عمرو، عن أبي صالح، عن أبي هريرة، - قال أراه مرفوعا - قال ‏ \"‏ ثلاثة لا يكلمهم الله ولا ينظر إليهم ولهم عذاب أليم رجل حلف على يمين بعد صلاة العصر على مال مسلم فاقتطعه ‏\"‏ ‏.‏ وباقي حديثه نحو حديث الأعمش ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 205
			}
		},
		{
			"hadithnumber": 300,
			"arabicnumber": "109.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، وأبو سعيد الأشج قالا حدثنا وكيع، عن الأعمش، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من قتل نفسه بحديدة فحديدته في يده يتوجأ بها في بطنه في نار جهنم خالدا مخلدا فيها أبدا ومن شرب سما فقتل نفسه فهو يتحساه في نار جهنم خالدا مخلدا فيها أبدا ومن تردى من جبل فقتل نفسه فهو يتردى في نار جهنم خالدا مخلدا فيها أبدا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 206
			}
		},
		{
			"hadithnumber": 301,
			"arabicnumber": "109.02",
			"text": "وحدثني زهير بن حرب، حدثنا جرير، ح وحدثنا سعيد بن عمرو الأشعثي، حدثنا عبثر، ح وحدثني يحيى بن حبيب الحارثي، حدثنا خالد، - يعني ابن الحارث - حدثنا شعبة، كلهم بهذا الإسناد مثله ‏.‏ وفي رواية شعبة عن سليمان قال سمعت ذكوان ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 207
			}
		},
		{
			"hadithnumber": 302,
			"arabicnumber": "110.01",
			"text": "حدثنا يحيى بن يحيى، أخبرنا معاوية بن سلام بن أبي سلام الدمشقي، عن يحيى بن أبي كثير، أن أبا قلابة، أخبره أن ثابت بن الضحاك أخبره أنه، بايع رسول الله صلى الله عليه وسلم تحت الشجرة وأن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من حلف على يمين بملة غير الإسلام كاذبا فهو كما قال ومن قتل نفسه بشىء عذب به يوم القيامة وليس على رجل نذر في شىء لا يملكه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 208
			}
		},
		{
			"hadithnumber": 303,
			"arabicnumber": "110.02",
			"text": "حدثني أبو غسان المسمعي، حدثنا معاذ، - وهو ابن هشام - قال حدثني أبي، عن يحيى بن أبي كثير، قال حدثني أبو قلابة، عن ثابت بن الضحاك، عن النبي صلى الله عليه وسلم قال ‏ \"‏ ليس على رجل نذر فيما لا يملك ولعن المؤمن كقتله ومن قتل نفسه بشىء في الدنيا عذب به يوم القيامة ومن ادعى دعوى كاذبة ليتكثر بها لم يزده الله إلا قلة ومن حلف على يمين صبر فاجرة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 209
			}
		},
		{
			"hadithnumber": 304,
			"arabicnumber": "110.03",
			"text": "حدثنا إسحاق بن إبراهيم، وإسحاق بن منصور، وعبد الوارث بن عبد الصمد، كلهم عن عبد الصمد بن عبد الوارث، عن شعبة، عن أيوب، عن أبي قلابة، عن ثابت بن الضحاك الأنصاري، ح",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 210
			}
		},
		{
			"hadithnumber": 305,
			"arabicnumber": "111",
			"text": "وحدثنا محمد بن رافع، وعبد بن حميد، جميعا عن عبد الرزاق، - قال ابن رافع حدثنا عبد الرزاق، - أخبرنا معمر، عن الزهري، عن ابن المسيب، عن أبي هريرة، قال شهدنا مع رسول الله صلى الله عليه وسلم حنينا فقال لرجل ممن يدعى بالإسلام ‏\"‏ هذا من أهل النار ‏\"‏ فلما حضرنا القتال قاتل الرجل قتالا شديدا فأصابته جراحة فقيل يا رسول الله الرجل الذي قلت له آنفا ‏\"‏ إنه من أهل النار ‏\"‏ فإنه قاتل اليوم قتالا شديدا وقد مات ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إلى النار ‏\"‏ فكاد بعض المسلمين أن يرتاب فبينما هم على ذلك إذ قيل إنه لم يمت ولكن به جراحا شديدا فلما كان من الليل لم يصبر على الجراح فقتل نفسه فأخبر النبي صلى الله عليه وسلم بذلك فقال ‏\"‏ الله أكبر أشهد أني عبد الله ورسوله ‏\"‏ ‏.‏ ثم أمر بلالا فنادى في الناس ‏\"‏ إنه لا يدخل الجنة إلا ن��فس مسلمة وإن الله يؤيد هذا الدين بالرجل الفاجر ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 212
			}
		},
		{
			"hadithnumber": 306,
			"arabicnumber": "112",
			"text": "حدثنا قتيبة بن سعيد، حدثنا يعقوب، - وهو ابن عبد الرحمن القاري - حى من العرب - عن أبي حازم، عن سهل بن سعد الساعدي، أن رسول الله صلى الله عليه وسلم التقى هو والمشركون فاقتتلوا ‏.‏ فلما مال رسول الله صلى الله عليه وسلم إلى عسكره ومال الآخرون إلى عسكرهم وفي أصحاب رسول الله صلى الله عليه وسلم رجل لا يدع لهم شاذة إلا اتبعها يضربها بسيفه فقالوا ما أجزأ منا اليوم أحد كما أجزأ فلان ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما إنه من أهل النار ‏\"‏ ‏.‏ فقال رجل من القوم أنا صاحبه أبدا ‏.‏ قال فخرج معه كلما وقف وقف معه وإذا أسرع أسرع معه - قال - فجرح الرجل جرحا شديدا فاستعجل الموت فوضع نصل سيفه بالأرض وذبابه بين ثدييه ثم تحامل على سيفه فقتل نفسه فخرج الرجل إلى رسول الله صلى الله عليه وسلم فقال أشهد أنك رسول الله ‏.‏ قال ‏\"‏ وما ذاك ‏\"‏ ‏.‏ قال الرجل الذي ذكرت آنفا أنه من أهل النار فأعظم الناس ذلك فقلت أنا لكم به فخرجت في طلبه حتى جرح جرحا شديدا فاستعجل الموت فوضع نصل سيفه بالأرض وذبابه بين ثدييه ثم تحامل عليه فقتل نفسه ‏.‏ فقال رسول الله صلى الله عليه وسلم عند ذلك ‏\"‏ إن الرجل ليعمل عمل أهل الجنة فيما يبدو للناس وهو من أهل النار وإن الرجل ليعمل عمل أهل النار فيما يبدو للناس وهو من أهل الجنة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 213
			}
		},
		{
			"hadithnumber": 307,
			"arabicnumber": "113.01",
			"text": "حدثني محمد بن رافع، حدثنا الزبيري، - وهو محمد بن عبد الله بن الزبير - حدثنا شيبان، قال سمعت الحسن، يقول ‏ \"‏ إن رجلا ممن كان قبلكم خرجت به قرحة فلما آذته انتزع سهما من كنانته فنكأها فلم يرقإ الدم حتى مات ‏.‏ قال ربكم قد حرمت عليه الجنة ‏\"‏ ‏.‏ ثم مد يده إلى المسجد فقال إي والله لقد حدثني بهذا الحديث جندب عن رسول الله صلى الله عليه وسلم في هذا المسجد ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 214
			}
		},
		{
			"hadithnumber": 308,
			"arabicnumber": "113.02",
			"text": "وحدثنا محمد بن أبي بكر المقدمي، حدثنا وهب بن جرير، حدثنا أبي قال، سمعت الحسن، يقول حدثنا جندب بن عبد الله البجلي، في هذا المسجد فما نسينا وما نخشى أن يكون جندب كذب على رسول الله صلى الله عليه وسلم قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ خرج برجل فيمن كان قبلكم خراج ‏\"‏ ‏.‏ فذكر نحوه ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 215
			}
		},
		{
			"hadithnumber": 309,
			"arabicnumber": "114",
			"text": "حدثني زهير بن حرب، حدثنا هاشم بن القاسم، حدثنا عكرمة بن عمار، قال حدثني سماك الحنفي أبو زميل، قال حدثني عبد الله بن عباس، قال حدثني عمر بن الخطاب، قال لما كان يوم خيبر أقبل نفر من صحابة النبي صلى الله عليه وسلم فقالوا فلان شهيد فلان شهيد حتى مروا على رجل فقالوا فلان شهيد ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ كلا إني رأيته في النار في بردة غلها أو عباءة ‏\"‏ ‏.‏ ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ يا ابن الخطاب اذهب فناد في الناس إنه لا يدخل الجنة إلا المؤمنون ‏\"‏ ‏.‏ قال فخرجت فناديت ‏\"‏ ألا إنه لا يدخل الجنة إلا المؤمنون ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 216
			}
		},
		{
			"hadithnumber": 310,
			"arabicnumber": "115",
			"text": "حدثني أبو الطاهر، قال أخبرني ابن وهب، عن مالك بن أنس، عن ثور بن زيد الدؤلي، عن سالم أبي الغيث، مولى ابن مطيع عن أبي هريرة، ح وحدثنا قتيبة بن سعيد، - وهذا حديثه - حدثنا عبد العزيز، - يعني ابن محمد - عن ثور، عن أبي الغيث، عن أبي هريرة، قال خرجنا مع النبي صلى الله عليه وسلم إلى خيبر ففتح الله علينا فلم نغنم ذهبا ولا ورقا غنمنا المتاع والطعام والثياب ثم انطلقنا إلى الوادي ومع رسول الله صلى الله عليه وسلم عبد له وهبه له رجل من جذام يدعى رفاعة بن زيد من بني الضبيب فلما نزلنا الوادي قام عبد رسول الله صلى الله عليه وسلم يحل رحله فرمي بسهم فكان فيه حتفه فقلنا هنيئا له الشهادة يا رسول الله ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ كلا والذي نفس محمد بيده إن الشملة لتلتهب عليه نارا أخذها من الغنائم يوم خيبر لم تصبها المقاسم ‏\"‏ ‏.‏ قال ففزع الناس ‏.‏ فجاء رجل بشراك أو شراكين ‏.‏ فقال يا رسول الله أصبت يوم خيبر ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ شراك من نار أو شراكان من نار ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 217
			}
		},
		{
			"hadithnumber": 311,
			"arabicnumber": "116",
			"text": "حدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، جميعا عن سليمان، - قال أبو بكر حدثنا سليمان بن حرب، - حدثنا حماد بن زيد، عن حجاج الصواف، عن أبي الزبير، عن جابر، أن الطفيل بن عمرو الدوسي، أتى النبي صلى الله عليه وسلم فقال يا رسول الله هل لك في حصن حصين ومنعة - قال حصن كان لدوس في الجاهلية - فأبى ذلك النبي صلى الله عليه وسلم للذي ذخر الله للأنصار فلما هاجر النبي صلى الله عليه وسلم إلى المدينة هاجر إليه الطفيل بن عمرو وهاجر معه رجل من قومه فاجتووا المدينة فمرض فجزع فأخذ مشاقص له فقطع بها براجمه فشخبت يداه حتى مات فرآه الطفيل بن عمرو في منامه فرآه وهيئته حسنة ورآه مغطيا يديه فقال له ما صنع بك ربك فقال غفر لي بهجرتي إلى نبيه صلى الله عليه وسلم فقال ما لي أراك مغطيا يديك قال قيل لي لن نصلح منك ما أفسدت ‏.‏ فقصها الطفيل على رسول الله صلى الله عليه وسلم ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏ \"‏ اللهم وليديه فاغفر ‏\"‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 218
			}
		},
		{
			"hadithnumber": 312,
			"arabicnumber": "117",
			"text": "حدثنا أحمد بن عبدة الضبي، حدثنا عبد العزيز بن محمد، وأبو علقمة الفروي قالا حدثنا صفوان بن سليم، عن عبد الله بن سلمان، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن الله يبعث ريحا من اليمن ألين من الحرير فلا تدع أحدا في قلبه - قال أبو علقمة مثقال حبة وقال عبد العزيز مثقال ذرة - من إيمان إلا قبضته ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 219
			}
		},
		{
			"hadithnumber": 313,
			"arabicnumber": "118",
			"text": "حدثني يحيى بن أيوب، وقتيبة، وابن، حجر جميعا عن إسماعيل بن جعفر، - قال ابن أيوب حدثنا إسماعيل، - قال أخبرني العلاء، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ بادروا بالأعمال فتنا كقطع الليل المظلم يصبح الرجل مؤمنا ويمسي كافرا أو يمسي مؤمنا ويصبح كافرا يبيع دينه بعرض من الدنيا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 220
			}
		},
		{
			"hadithnumber": 314,
			"arabicnumber": "119.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا الحسن بن موسى، حدثنا حماد بن سلمة، عن ثابت البناني، عن أنس بن مالك، أنه قال لما نزلت هذه الآية ‏{‏ يا أيها الذين آمنوا لا ترفعوا أصواتكم فوق صوت النبي‏}‏ إلى آخر الآية جلس ثابت بن قيس في بيته وقال أنا من أهل النار ‏.‏ واحتبس عن النبي صلى الله عليه وسلم فسأل النبي صلى الله عليه وسلم سعد بن معاذ فقال ‏\"‏ يا أبا عمرو ما شأن ثابت أشتكى ‏\"‏ ‏.‏ قال سعد إنه لجاري وما علمت له بشكوى ‏.‏ قال فأتاه سعد فذكر له قول رسول الله صلى الله عليه وسلم فقال ثابت أنزلت هذه الآية ولقد علمتم أني من أرفعكم صوتا على رسول الله صلى الله عليه وسلم فأنا من أهل النار ‏.‏ فذكر ذلك سعد للنبي صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ بل هو من أهل الجنة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 221
			}
		},
		{
			"hadithnumber": 315,
			"arabicnumber": "119.02",
			"text": "وحدثنا قطن بن نسير، حدثنا جعفر بن سليمان، حدثنا ثابت، عن أنس بن مالك، قال كان ثابت بن قيس بن شماس خطيب الأنصار فلما نزلت هذه الآية ‏.‏ بنحو حديث حماد ‏.‏ وليس في حديثه ذكر سعد بن معاذ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 222
			}
		},
		{
			"hadithnumber": 316,
			"arabicnumber": "119.03",
			"text": "وحدثنيه أحمد بن سعيد بن صخر الدارمي، حدثنا حبان، حدثنا سليمان بن المغيرة، عن ثابت، عن أنس، قال لما نزلت ‏{‏ لا ترفعوا أصواتكم فوق صوت النبي‏}‏ ولم يذكر سعد بن معاذ في الحديث ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 223
			}
		},
		{
			"hadithnumber": 317,
			"arabicnumber": "119.04",
			"text": "وحدثنا هريم بن عبد الأعلى الأسدي، حدثنا المعتمر بن سليمان، قال سمعت أبي يذكر، عن ثابت، عن أنس، قال لما نزلت هذه الآية ‏.‏ واقتص الحديث ‏.‏ ولم يذكر سعد بن معاذ وزاد فكنا نراه يمشي بين أظهرنا رجل من أهل الجنة ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 224
			}
		},
		{
			"hadithnumber": 318,
			"arabicnumber": "120.01",
			"text": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن أبي وائل، عن عبد الله، قال قال أناس لرسول الله صلى الله عليه وسلم يا رسول الله أنؤاخذ بما عملنا في الجاهلية قال ‏ \"‏ أما من أحسن منكم في الإسلام فلا يؤاخذ بها ومن أساء أخذ بعمله في الجاهلية والإسلام ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 225
			}
		},
		{
			"hadithnumber": 319,
			"arabicnumber": "120.02",
			"text": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي ووكيع، ح وحدثنا أبو بكر بن أبي شيبة، - واللفظ له - حدثنا وكيع، عن الأعمش، عن أبي وائل، عن عبد الله، قال قلنا يا رسول الله أنؤاخذ بما عملنا في الجاهلية قال ‏ \"‏ من أحسن في الإسلام لم يؤاخذ بما عمل في الجاهلية ‏.‏ ومن أساء في الإسلام أخذ بالأول والآخر ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 226
			}
		},
		{
			"hadithnumber": 320,
			"arabicnumber": "120.03",
			"text": "حدثنا منجاب بن الحارث التميمي، أخبرنا علي بن مسهر، عن الأعمش، بهذا الإسناد مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 227
			}
		},
		{
			"hadithnumber": 321,
			"arabicnumber": "121",
			"text": "حدثنا محمد بن المثنى العنزي، وأبو معن الرقاشي وإسحاق بن منصور كلهم عن أبي عاصم، - واللفظ لابن المثنى - حدثنا الضحاك، - يعني أبا عاصم - قال أخبرنا حيوة بن شريح، قال حدثني يزيد بن أبي حبيب، عن ابن شماسة المهري، قال حضرنا عمرو بن العاص وهو في سياقة الموت ‏.‏ فبكى طويلا وحول وجهه إلى الجدار فجعل ابنه يقول يا أبتاه أما بشرك رسول الله صلى الله عليه وسلم بكذا أما بشرك رسول الله صلى الله عليه وسلم بكذا قال فأقبل بوجهه ‏.‏ فقال إن أفضل ما نعد شهادة أن لا إله إلا الله وأن محمدا رسول الله إني قد كنت على أطباق ثلاث لقد رأيتني وما أحد أشد بغضا لرسول الله صلى الله عليه وسلم مني ولا أحب إلى أن أكون قد استمكنت منه فقتلته فلو مت على تلك الحال لكنت من أهل النار فلما جعل الله الإسلام في قلبي أتيت النبي صلى الله عليه وسلم فقلت ابسط يمينك فلأبايعك ‏.‏ فبسط يمينه - قال - فقبضت يدي ‏.‏ قال ‏\"‏ ما لك يا عمرو ‏\"‏ ‏.‏ قال قلت أردت أن أشترط ‏.‏ قال ‏\"‏ تشترط بماذا ‏\"‏ ‏.‏ قلت أن يغفر لي ‏.‏ قال ‏\"‏ أما علمت أن الإسلام يهدم ما كان قبله وأن الهجرة تهدم ما كان قبلها وأن الحج يهدم ما كان قبله ‏\"‏ ‏.‏ وما كان أحد أحب إلى من رسول الله صلى الله عليه وسلم ولا أجل في عيني منه وما كنت أطيق أن أملأ عينى منه إجلالا له ولو سئلت أن أصفه ما أطقت لأني لم أكن أملأ عينى منه ولو مت على تلك الحال لرجوت أن أكون من أهل الجنة ثم ولينا أشياء ما أدري ما حالي فيها فإذا أنا مت فلا تصحبني نائحة ولا نار فإذا دفنتموني فشنوا على التراب شنا ثم أقيموا حول قبري قدر ما تنحر جزور ويقسم لحمها حتى أستأنس بكم وأنظر ماذا أراجع به رسل ربي ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 228
			}
		},
		{
			"hadithnumber": 322,
			"arabicnumber": "122",
			"text": "حدثني محمد بن حاتم بن ميمون، وإبراهيم بن دينار، - واللفظ لإبراهيم - قالا حدثنا حجاج، - وهو ابن محمد - عن ابن جريج، قال أخبرني يعلى بن مسلم، أنه سمع سعيد بن جبير، يحدث عن ابن عباس، أن ناسا، من أهل الشرك قتلوا فأكثروا وزنوا فأكثروا ثم أتوا محمدا صلى الله عليه وسلم فقالوا إن الذي تقول وتدعو لحسن ولو تخبرنا أن لما عملنا كفارة فنزل ‏{‏ والذين لا يدعون مع الله إلها آخر ولا يقتلون النفس التي حرم الله إلا بالحق ولا يزنون ومن يفعل ذلك يلق أثاما‏}‏ ونزل ‏{‏ يا عبادي الذين أسرفوا على أنفسهم لا تقنطوا من رحمة الله‏{‏ ‏.‏}",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 229
			}
		},
		{
			"hadithnumber": 323,
			"arabicnumber": "123.01",
			"text": "حدثني حرملة بن يحيى، أخبرنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، قال أخبرني عروة بن الزبير، أن حكيم بن حزام، أخبره أنه، قال لرسول الله صلى الله عليه وسلم أرأيت أمورا كنت أتحنث بها في الجاهلية هل لي فيها من شىء فقال له رسول الله صلى الله عليه وسلم ‏ \"‏ أسلمت على ما أسلفت من خير ‏\"‏ ‏.‏ والتحنث التعبد ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 230
			}
		},
		{
			"hadithnumber": 324,
			"arabicnumber": "123.02",
			"text": "وحدثنا حسن الحلواني، وعبد بن حميد، - قال الحلواني حدثنا وقال عبد، حدثني - يعقوب، - وهو ابن إبراهيم بن سعد - حدثنا أبي، عن صالح، عن ابن شهاب، قال أخبرني عروة بن الزبير، أن حكيم بن حزام، أخبره أنه، قال لرسول الله صلى الله عليه وسلم أى رسول الله أرأيت أمورا كنت أتحنث بها في الجاهلية من صدقة أو عتاقة أو صلة رحم أفيها أجر فقال رسول الله صلى الله عليه وسلم ‏ \"‏ أسلمت على ما أسلفت من خير ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 231
			}
		},
		{
			"hadithnumber": 325,
			"arabicnumber": "123.03",
			"text": "حدثنا إسحاق بن إبراهيم، وعبد بن حميد، قالا أخبرنا عبد الرزاق، أخبرنا معمر، عن الزهري، بهذا الإسناد ح وحدثنا إسحاق بن إبراهيم، أخبرنا أبو معاوية، حدثنا هشام بن عروة، عن أبيه، عن حكيم بن حزام، قال قلت يا رسول الله أشياء كنت أفعلها في الجاهلية - قال هشام يعني أتبرر بها - فقال رسول الله صلى الله عليه وسلم ‏ \"‏ أسلمت على ما أسلفت لك من الخير ‏\"‏ ‏.‏ قلت فوالله لا أدع شيئا صنعته في الجاهلية إلا فعلت في الإسلام مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 232
			}
		},
		{
			"hadithnumber": 326,
			"arabicnumber": "123.04",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، عن هشام بن عروة، عن أبيه، أن حكيم بن حزام، أعتق في الجاهلية مائة رقبة وحمل على مائة بعير ثم أعتق في الإسلام مائة رقبة وحمل على مائة بعير ثم أتى النبي صلى الله عليه وسلم فذكر نحو حديثهم ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 233
			}
		},
		{
			"hadithnumber": 327,
			"arabicnumber": "124.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن إدريس، وأبو معاوية ووكيع عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، قال لما نزلت ‏{‏ الذين آمنوا ولم يلبسوا إيمانهم بظلم‏}‏ شق ذلك على أصحاب رسول الله صلى الله عليه وسلم وقالوا أينا لا يظلم نفسه فقال رسول الله صلى الله عليه وسلم ‏\"‏ ليس هو كما تظنون إنما هو كما قال لقمان لابنه ‏{‏ يا بنى لا تشرك بالله إن الشرك لظلم عظيم‏{‏}",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 234
			}
		},
		{
			"hadithnumber": 328,
			"arabicnumber": "124.02",
			"text": "حدثنا إسحاق بن إبراهيم، وعلي بن خشرم، قالا أخبرنا عيسى، - وهو ابن يونس ح وحدثنا منجاب بن الحارث التميمي، أخبرنا ابن مسهر، ح وحدثنا أبو كريب، أخبرنا ابن إدريس، كلهم عن الأعمش، بهذا الإسناد قال أبو كريب قال ابن إدريس حدثنيه أولا أبي، عن أبان بن تغلب، عن الأعمش، ثم سمعته منه، ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 235
			}
		},
		{
			"hadithnumber": 329,
			"arabicnumber": "125",
			"text": "حدثني محمد بن منهال الضرير، وأمية بن بسطام العيشي، - واللفظ لأمية - قالا حدثنا يزيد بن زريع، حدثنا روح، - وهو ابن القاسم - عن العلاء، عن أبيه، عن أبي هريرة، قال لما نزلت على رسول الله صلى الله عليه وسلم ‏{‏ لله ما في السموات وما في الأرض وإن تبدوا ما في أنفسكم أو تخفوه يحاسبكم به الله فيغفر لمن يشاء ويعذب من يشاء والله على كل شىء قدير‏}‏ قال فاشتد ذلك على أصحاب رسول الله صلى الله عليه وسلم فأتوا رسول الله صلى الله عليه وسلم ثم بركوا على الركب فقالوا أى رسول الله كلفنا من الأعمال ما نطيق الصلاة والصيام والجهاد والصدقة وقد أنزلت عليك هذه الآية ولا نطيقها ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ أتريدون أن تقولوا كما قال أهل الكتابين من قبلكم سمعنا وعصينا بل قولوا سمعنا وأطعنا غفرانك ربنا وإليك المصير ‏\"‏ ‏.‏ قالوا سمعنا وأطعنا غفرانك ربنا وإليك المصير ‏.‏ فلما اقترأها القوم ذلت بها ألسنتهم فأنزل الله في إثرها ‏{‏ آمن الرسول بما أنزل إليه من ربه والمؤمنون كل آمن بالله وملائكته وكتبه ورسله لا نفرق بين أحد من رسله وقالوا سمعنا وأطعنا غفرانك ربنا وإليك المصير‏}‏ فلما فعلوا ذلك نسخها الله تعالى فأنزل الله عز وجل ‏{‏ لا يكلف الله نفسا إلا وسعها لها ما كسبت وعليها ما اكتسبت ربنا لا تؤاخذنا إن نسينا أو أخطأنا‏}‏ قال نعم ‏{‏ ربنا ولا تحمل علينا إصرا كما حملته على الذين من قبلنا‏}‏ قال نعم ‏{‏ ربنا ولا تحملنا ما لا طاقة لنا به‏}‏ قال نعم ‏{‏ واعف عنا واغفر لنا وارحمنا أنت مولانا فانصرنا على القوم الكافرين‏}‏ قال نعم ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 236
			}
		},
		{
			"hadithnumber": 330,
			"arabicnumber": "126",
			"text": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب وإسحاق بن إبراهيم - واللفظ لأبي بكر قال إسحاق أخبرنا وقال الآخران، حدثنا - وكيع، عن سفيان، عن آدم بن سليمان، مولى خالد قال سمعت سعيد بن جبير، يحدث عن ابن عباس، قال لما نزلت هذه الآية ‏{‏ وإن تبدوا ما في أنفسكم أو تخفوه يحاسبكم به الله‏}‏ قال دخل قلوبهم منها شىء لم يدخل قلوبهم من شىء فقال النبي صلى الله عليه وسلم ‏\"‏ قولوا سمعنا وأطعنا وسلمنا ‏\"‏ ‏.‏ قال فألقى الله الإيمان في قلوبهم فأنزل الله تعالى ‏{‏ لا يكلف الله نفسا إلا وسعها لها ما كسبت وعليها ما اكتسبت ربنا لا تؤاخذنا إن نسينا أو أخطأنا‏}‏ قال قد فعلت ‏{‏ ربنا ولا تحمل علينا إصرا كما حملته على الذين من قبلنا‏}‏ - قال قد فعلت ‏{‏ واغفر لنا وارحمنا أنت مولانا‏}‏ قال قد فعلت ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 237
			}
		},
		{
			"hadithnumber": 331,
			"arabicnumber": "127.01",
			"text": "حدثنا سعيد بن منصور، وقتيبة بن سعيد، ومحمد بن عبيد الغبري، - واللفظ لسعيد - قالوا حدثنا أبو عوانة، عن قتادة، عن زرارة بن أوفى، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن الله تجاوز لأمتي ما حدثت به أنفسها ما لم يتكلموا أو يعملوا به ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 238
			}
		},
		{
			"hadithnumber": 332,
			"arabicnumber": "127.02",
			"text": "حدثنا عمرو الناقد، وزهير بن حرب، قالا حدثنا إسماعيل بن إبراهيم، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، وعبدة بن سليمان، ح وحدثنا ابن المثنى، وابن، بشار قالا حدثنا ابن أبي عدي، كلهم عن سعيد بن أبي عروبة، عن قتادة، عن زرارة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن الله عز وجل تجاوز لأمتي عما حدثت به أنفسها ما لم تعمل أو تكلم به ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 239
			}
		},
		{
			"hadithnumber": 333,
			"arabicnumber": "127.03",
			"text": "وحدثني زهير بن حرب، حدثنا وكيع، حدثنا مسعر، وهشام، ح وحدثني إسحاق بن منصور، أخبرنا الحسين بن علي، عن زائدة، عن شيبان، جميعا عن قتادة، بهذا الإسناد مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 240
			}
		},
		{
			"hadithnumber": 334,
			"arabicnumber": "128.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، وإسحاق بن إبراهيم، - واللفظ لأبي بكر قال إسحاق أخبرنا سفيان، وقال الآخران، حدثنا - ابن عيينة، عن أبي الزناد، عن الأعرج، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ قال الله عز وجل إذا هم عبدي بسيئة فلا تكتبوها عليه فإن عملها فاكتبوها سيئة وإذا هم بحسنة فلم يعملها فاكتبوها حسنة فإن عملها فاكتبوها عشرا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 241
			}
		},
		{
			"hadithnumber": 335,
			"arabicnumber": "128.02",
			"text": "حدثنا يحيى بن أيوب، وقتيبة، وابن، حجر قالوا حدثنا إسماعيل، - وهو ابن جعفر - عن العلاء، عن أبيه، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏ \"‏ قال الله عز وجل إذا هم عبدي بحسنة ولم يعملها كتبتها له حسنة فإن عملها كتبتها عشر حسنات إلى سبعمائة ضعف وإذا هم بسيئة ولم يعملها لم أكتبها عليه فإن عملها كتبتها سيئة واحدة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 242
			}
		},
		{
			"hadithnumber": 336,
			"arabicnumber": "129",
			"text": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن محمد، رسول الله صلى الله عليه وسلم فذكر أحاديث منها قال قال رسول الله صلى الله عليه وسلم ‏\"‏ قال الله عز وجل إذا تحدث عبدي بأن يعمل حسنة فأنا أكتبها له حسنة ما لم يعمل فإذا عملها فأنا أكتبها بعشر أمثالها وإذا تحدث بأن يعمل سيئة فأنا أغفرها له ما لم يعملها فإذا عملها فأنا أكتبها له بمثلها ‏\"‏ ‏.‏ وقال رسول الله صلى الله عليه وسلم ‏\"‏ قالت الملائكة رب ذاك عبدك يريد أن يعمل سيئة - وهو أبصر به - فقال ارقبوه فإن عملها فاكتبوها له بمثلها ‏.‏ وإن تركها فاكتبوها له حسنة - إنما تركها من جراى ‏\"‏ ‏.‏ وقال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أحسن أحدكم إسلامه فكل حسنة يعملها تكتب بعشر أمثالها إلى سبعمائة ضعف وكل سيئة يعملها تكتب بمثلها حتى يلقى الله ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 243
			}
		},
		{
			"hadithnumber": 337,
			"arabicnumber": "130",
			"text": "وحدثنا أبو كريب، حدثنا أبو خالد الأحمر، عن هشام، عن ابن سيرين، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من هم بحسنة فلم يعملها كتبت له حسنة ومن هم بحسنة فعملها كتبت له عشرا إلى سبعمائة ضعف ومن هم بسيئة فلم يعملها لم تكتب وإن عملها كتبت ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 244
			}
		},
		{
			"hadithnumber": 338,
			"arabicnumber": "131.01",
			"text": "حدثنا شيبان بن فروخ، حدثنا عبد الوارث، عن الجعد أبي عثمان، حدثنا أبو رجاء العطاردي، عن ابن عباس، عن رسول الله صلى الله عليه وسلم فيما يروي عن ربه تبارك وتعالى قال ‏ \"‏ إن الله كتب الحسنات والسيئات ثم بين ذلك فمن هم بحسنة فلم يعملها كتبها الله عنده حسنة كاملة وإن هم بها فعملها كتبها الله عز وجل عنده عشر حسنات إلى سبعمائة ضعف إلى أضعاف كثيرة وإن هم بسيئة فلم يعملها كتبها الله عنده حسنة كاملة وإن هم بها فعملها كتبها الله سيئة واحدة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 245
			}
		},
		{
			"hadithnumber": 339,
			"arabicnumber": "131.02",
			"text": "وحدثنا يحيى بن يحيى، حدثنا جعفر بن سليمان، عن الجعد أبي عثمان، في هذا الإسناد بمعنى حديث عبد الوارث ‏.‏ وزاد ‏ \"‏ ومحاها الله ولا يهلك على الله إلا هالك ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 246
			}
		},
		{
			"hadithnumber": 340,
			"arabicnumber": "132.01",
			"text": "حدثني زهير بن حرب، حدثنا جرير، عن سهيل، عن أبيه، عن أبي هريرة، قال جاء ناس من أصحاب النبي صلى الله عليه وسلم فسألوه إنا نجد في أنفسنا ما يتعاظم أحدنا أن يتكلم به ‏.‏ قال ‏\"‏ وقد وجدتموه ‏\"‏ ‏.‏ قالوا نعم ‏.‏ قال ‏\"‏ ذاك صريح الإيمان ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 247
			}
		},
		{
			"hadithnumber": 341,
			"arabicnumber": "132.02",
			"text": "وحدثنا محمد بن بشار، حدثنا ابن أبي عدي، عن شعبة، ح وحدثني محمد بن عمرو بن جبلة بن أبي رواد، وأبو بكر بن إسحاق قالا حدثنا أبو الجواب، عن عمار بن رزيق، كلاهما عن الأعمش، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم بهذا الحديث ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 248
			}
		},
		{
			"hadithnumber": 342,
			"arabicnumber": "133",
			"text": "حدثنا يوسف بن يعقوب الصفار، حدثني علي بن عثام، عن سعير بن الخمس، عن مغيرة، عن إبراهيم، عن علقمة، عن عبد الله، قال سئل النبي صلى الله عليه وسلم عن الوسوسة قال ‏ \"‏ تلك محض الإيمان ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 249
			}
		},
		{
			"hadithnumber": 343,
			"arabicnumber": "134.01",
			"text": "حدثنا هارون بن معروف، ومحمد بن عباد، - واللفظ لهارون - قالا حدثنا سفيان، عن هشام، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا يزال الناس يتساءلون حتى يقال هذا خلق الله الخلق فمن خلق الله فمن وجد من ذلك شيئا فليقل آمنت بالله ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 250
			}
		},
		{
			"hadithnumber": 344,
			"arabicnumber": "134.02",
			"text": "وحدثنا محمود بن غيلان، حدثنا أبو النضر، حدثنا أبو سعيد المؤدب، عن هشام بن عروة، بهذا الإسناد أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يأتي الشيطان أحدكم فيقول من خلق السماء من خلق الأرض فيقول الله ‏\"‏ ‏.‏ ثم ذكر بمثله وزاد ‏\"‏ ورسله ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 251
			}
		},
		{
			"hadithnumber": 345,
			"arabicnumber": "134.03",
			"text": "حدثني زهير بن حرب، وعبد بن حميد، جميعا عن يعقوب، قال زهير حدثنا يعقوب بن إبراهيم، حدثنا ابن أخي ابن شهاب، عن عمه، قال أخبرني عروة بن الزبير، أن أبا هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ يأتي الشيطان أحدكم فيقول من خلق كذا وكذا حتى يقول له من خلق ربك فإذا بلغ ذلك فليستعذ بالله ولينته ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 252
			}
		},
		{
			"hadithnumber": 346,
			"arabicnumber": "134.04",
			"text": "حدثني عبد الملك بن شعيب بن الليث، قال حدثني أبي، عن جدي، قال حدثني عقيل بن خالد، قال قال ابن شهاب أخبرني عروة بن الزبير، أن أبا هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ يأتي العبد الشيطان فيقول من خلق كذا وكذا ‏\"‏ مثل حديث ابن أخي ابن شهاب ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 253
			}
		},
		{
			"hadithnumber": 347,
			"arabicnumber": "135.01",
			"text": "حدثني عبد الوارث بن عبد الصمد، قال حدثني أبي، عن جدي، عن أيوب، عن محمد بن سيرين، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ لا يزال الناس يسألونكم عن العلم حتى يقولوا هذا الله خلقنا فمن خلق الله ‏\"‏ ‏.‏ قال وهو آخذ بيد رجل فقال صدق الله ورسوله قد سألني اثنان وهذا الثالث ‏.‏ أو قال سألني واحد وهذا الثاني ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 254
			}
		},
		{
			"hadithnumber": 348,
			"arabicnumber": "135.02",
			"text": "وحدثنيه زهير بن حرب، ويعقوب الدورقي، قالا حدثنا إسماعيل، وهو ابن علية عن أيوب، عن محمد، قال قال أبو هريرة ‏ \"‏ لا يزال الناس ‏\"‏ ‏.‏ بمثل حديث عبد الوارث غير أنه لم يذكر النبي صلى الله عليه وسلم في الإسناد ولكن قد قال في آخر الحديث صدق الله ورسوله ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 255
			}
		},
		{
			"hadithnumber": 349,
			"arabicnumber": "135.03",
			"text": "وحدثني عبد الله بن الرومي، حدثنا النضر بن محمد، حدثنا عكرمة، - وهو ابن عمار - حدثنا يحيى، حدثنا أبو سلمة، عن أبي هريرة، قال قال لي رسول الله صلى الله عليه وسلم ‏ \"‏ لا يزالون يسألونك يا أبا هريرة حتى يقولوا هذا الله فمن خلق الله ‏\"‏ قال فبينا أنا في المسجد إذ جاءني ناس من الأعراب فقالوا يا أبا هريرة هذا الله فمن خلق الله قال فأخذ حصى بكفه فرماهم ثم قال قوموا قوموا صدق خليلي ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 256
			}
		},
		{
			"hadithnumber": 350,
			"arabicnumber": "135.04",
			"text": "حدثني محمد بن حاتم، حدثنا كثير بن هشام، حدثنا جعفر بن برقان، حدثنا يزيد بن الأصم، قال سمعت أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ ليسألنكم الناس عن كل شىء حتى يقولوا الله خلق كل شىء فمن خلقه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 257
			}
		},
		{
			"hadithnumber": 351,
			"arabicnumber": "136.01",
			"text": "حدثنا عبد الله بن عامر بن زرارة الحضرمي، حدثنا محمد بن فضيل، عن مختار بن فلفل، عن أنس بن مالك، عن رسول الله صلى الله عليه وسلم قال ‏ \"‏ قال الله عز وجل إن أمتك لا يزالون يقولون ما كذا ما كذا حتى يقولوا هذا الله خلق الخلق فمن خلق الله ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 258
			}
		},
		{
			"hadithnumber": 352,
			"arabicnumber": "136.02",
			"text": "حدثناه إسحاق بن إبراهيم، أخبرنا جرير، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، كلاهما عن المختار، عن أنس، عن النبي صلى الله عليه وسلم بهذا الحديث غير أن إسحاق لم يذكر قال ‏ \"‏ قال الله إن أمتك ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 259
			}
		},
		{
			"hadithnumber": 353,
			"arabicnumber": "137.01",
			"text": "حدثنا يحيى بن أيوب، وقتيبة بن سعيد، وعلي بن حجر، جميعا عن إسماعيل بن جعفر، - قال ابن أيوب حدثنا إسماعيل بن جعفر، - قال أخبرنا العلاء، - وهو ابن عبد الرحمن مولى الحرقة - عن معبد بن كعب السلمي، عن أخيه عبد الله بن كعب، عن أبي أمامة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من اقتطع حق امرئ مسلم بيمينه فقد أوجب الله له النار وحرم عليه الجنة ‏\"‏ ‏.‏ فقال له رجل وإن كان شيئا يسيرا يا رسول الله قال ‏\"‏ وإن قضيبا من أراك ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 260
			}
		},
		{
			"hadithnumber": 354,
			"arabicnumber": "137.02",
			"text": "وحدثناه أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، وهارون بن عبد الله، جميعا عن أبي أسامة، عن الوليد بن كثير، عن محمد بن كعب، أنه سمع أخاه عبد الله بن كعب، يحدث أن أبا أمامة الحارثي، حدثه أنه، سمع رسول الله صلى الله عليه وسلم بمثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 261
			}
		},
		{
			"hadithnumber": 355,
			"arabicnumber": "138.01",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، ح وحدثنا ابن نمير، حدثنا أبو معاوية، ووكيع، ح وحدثنا إسحاق بن إبراهيم الحنظلي، - واللفظ له - أخبرنا وكيع، حدثنا الأعمش، عن أبي وائل، عن عبد الله، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ من حلف على يمين صبر يقتطع بها مال امرئ مسلم هو فيها فاجر لقي الله وهو عليه غضبان ‏\"‏ ‏.‏ قال فدخل الأشعث بن قيس فقال ما يحدثكم أبو عبد الرحمن قالوا كذا وكذا ‏.‏ قال صدق أبو عبد الرحمن في نزلت كان بيني وبين رجل أرض باليمن فخاصمته إلى النبي صلى الله عليه وسلم فقال ‏\"‏ هل لك بينة ‏\"‏ ‏.‏ فقلت لا ‏.‏ قال ‏\"‏ فيمينه ‏\"‏ ‏.‏ قلت إذا يحلف ‏.‏ فقال رسول الله صلى الله عليه وسلم عند ذلك ‏\"‏ من حلف على يمين صبر يقتطع بها مال امرئ مسلم هو فيها فاجر لقي الله وهو عليه غضبان ‏\"‏ ‏.‏ فنزلت ‏{‏ إن الذين يشترون بعهد الله وأيمانهم ثمنا قليلا‏}‏ إلى آخر الآية ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 262
			}
		},
		{
			"hadithnumber": 356,
			"arabicnumber": "138.02",
			"text": "حدثنا إسحاق بن إبراهيم، أخبرنا جرير، عن منصور، عن أبي وائل، عن عبد الله، قال من حلف على يمين يستحق بها مالا هو فيها فاجر لقي الله وهو عليه غضبان ‏.‏ ثم ذكر نحو حديث الأعمش غير أنه قال كانت بيني وبين رجل خصومة في بئر فاختصمنا إلى رسول الله صلى الله عليه وسلم فقال ‏ \"‏ شاهداك أو يمينه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 263
			}
		},
		{
			"hadithnumber": 357,
			"arabicnumber": "138.03",
			"text": "وحدثنا ابن أبي عمر المكي، حدثنا سفيان، عن جامع بن أبي راشد، وعبد الملك بن أعين، سمعا شقيق بن سلمة، يقول سمعت ابن مسعود، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من حلف على مال امرئ مسلم بغير حقه لقي الله وهو عليه غضبان ‏\"‏ قال عبد الله ثم قرأ علينا رسول الله صلى الله عليه وسلم مصداقه من كتاب الله ‏{‏ إن الذين يشترون بعهد الله وأيمانهم ثمنا قليلا‏}‏ إلى آخر الآية ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 264
			}
		},
		{
			"hadithnumber": 358,
			"arabicnumber": "139.01",
			"text": "حدثنا قتيبة بن سعيد، وأبو بكر بن أبي شيبة وهناد بن السري وأبو عاصم الحنفي - واللفظ لقتيبة - قالوا حدثنا أبو الأحوص، عن سماك، عن علقمة بن وائل، عن أبيه، قال جاء رجل من حضرموت ورجل من كندة إلى النبي صلى الله عليه وسلم فقال الحضرمي يا رسول الله إن هذا قد غلبني على أرض لي كانت لأبي ‏.‏ فقال الكندي هي أرضي في يدي أزرعها ليس له فيها حق ‏.‏ فقال رسول الله صلى الله عليه وسلم للحضرمي ‏\"‏ ألك بينة ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فلك يمينه ‏\"‏ ‏.‏ قال يا رسول الله إن الرجل فاجر لا يبالي على ما حلف عليه وليس يتورع من شىء ‏.‏ فقال ‏\"‏ ليس لك منه إلا ذلك ‏\"‏ فانطلق ليحلف فقال رسول الله صلى الله عليه وسلم لما أدبر ‏\"‏ أما لئن حلف على ماله ليأكله ظلما ليلقين الله وهو عنه معرض ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 265
			}
		},
		{
			"hadithnumber": 359,
			"arabicnumber": "139.02",
			"text": "وحدثني زهير بن حرب، وإسحاق بن إبراهيم، جميعا عن أبي الوليد، قال زهير حدثنا هشام بن عبد الملك، حدثنا أبو عوانة، عن عبد الملك بن عمير، عن علقمة بن وائل، عن وائل بن حجر، قال كنت عند رسول الله صلى الله عليه وسلم فأتاه رجلان يختصمان في أرض فقال أحدهما إن هذا انتزى على أرضي يا رسول الله في الجاهلية - وهو امرؤ القيس بن عابس الكندي وخصمه ربيعة بن عبدان - قال ‏\"‏ بينتك ‏\"‏ ‏.‏ قال ليس لي بينة ‏.‏ قال ‏\"‏ يمينه ‏\"‏ ‏.‏ قال إذا يذهب بها ‏.‏ قال ‏\"‏ ليس لك إلا ذاك ‏\"‏ ‏.‏ قال فلما قام ليحلف قال رسول الله صلى الله عليه وسلم ‏\"‏ من اقتطع أرضا ظالما لقي الله وهو عليه غضبان ‏\"‏ ‏.‏ قال إسحاق في روايته ربيعة بن عيدان ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 266
			}
		},
		{
			"hadithnumber": 360,
			"arabicnumber": "140",
			"text": "حدثني أبو كريب، محمد بن العلاء حدثنا خالد، - يعني ابن مخلد - حدثنا محمد بن جعفر، عن العلاء بن عبد الرحمن، عن أبيه، عن أبي هريرة، قال جاء رجل إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله أرأيت إن جاء رجل يريد أخذ مالي قال ‏\"‏ فلا تعطه مالك ‏\"‏ ‏.‏ قال أرأيت إن قاتلني قال ‏\"‏ قاتله ‏\"‏ ‏.‏ قال أرأيت إن قتلني قال ‏\"‏ فأنت شهيد ‏\"‏ ‏.‏ قال أرأيت إن قتلته قال ‏\"‏ هو في النار ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 267
			}
		},
		{
			"hadithnumber": 361,
			"arabicnumber": "141.01",
			"text": "حدثني الحسن بن علي الحلواني، وإسحاق بن منصور، ومحمد بن رافع، - وألفاظهم متقاربة - قال إسحاق أخبرنا وقال الآخران، حدثنا عبد الرزاق، أخبرنا ابن جريج، قال أخبرني سليمان الأحول، أن ثابتا، مولى عمر بن عبد الرحمن أخبره أنه، لما كان بين عبد الله بن عمرو وبين عنبسة بن أبي سفيان ما كان تيسروا للقتال فركب خالد بن العاص إلى عبد الله بن عمرو فوعظه خالد فقال عبد الله بن عمرو أما علمت أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من قتل دون ماله فهو شهيد ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 268
			}
		},
		{
			"hadithnumber": 362,
			"arabicnumber": "141.02",
			"text": "وحدثنيه محمد بن حاتم، حدثنا محمد بن بكر، ح وحدثنا أحمد بن عثمان النوفلي، حدثنا أبو عاصم، كلاهما عن ابن جريج، بهذا الإسناد مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 269
			}
		},
		{
			"hadithnumber": 363,
			"arabicnumber": "142.01",
			"text": "حدثنا شيبان بن فروخ، حدثنا أبو الأشهب، عن الحسن، قال عاد عبيد الله بن زياد معقل بن يسار المزني في مرضه الذي مات فيه ‏.‏ قال معقل إني محدثك حديثا سمعته من رسول الله صلى الله عليه وسلم لو علمت أن لي حياة ما حدثتك إني سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ ما من عبد يسترعيه الله رعية يموت يوم يموت وهو غاش لرعيته إلا حرم الله عليه الجنة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 270
			}
		},
		{
			"hadithnumber": 364,
			"arabicnumber": "142.02",
			"text": "حدثنا يحيى بن يحيى، أخبرنا يزيد بن زريع، عن يونس، عن الحسن، قال دخل عبيد الله بن زياد على معقل بن يسار وهو وجع فسأله فقال إني محدثك حديثا لم أكن حدثتكه إن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا يسترعي الله عبدا رعية يموت حين يموت وهو غاش لها إلا حرم الله عليه الجنة ‏\"‏ ‏.‏ قال ألا كنت حدثتني هذا قبل اليوم قال ما حدثتك أو لم أكن لأحدثك ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 271
			}
		},
		{
			"hadithnumber": 365,
			"arabicnumber": "142.03",
			"text": "وحدثني القاسم بن زكرياء، حدثنا حسين، - يعني الجعفي - عن زائدة، عن هشام، قال قال الحسن كنا عند معقل بن يسار نعوده فجاء عبيد الله بن زياد فقال له معقل إني سأحدثك حديثا سمعته من رسول الله صلى الله عليه وسلم ثم ذكر بمعنى حديثهما ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 272
			}
		},
		{
			"hadithnumber": 366,
			"arabicnumber": "142.04",
			"text": "وحدثنا أبو غسان المسمعي، ومحمد بن المثنى، وإسحاق بن إبراهيم، قال إسحاق أخبرنا وقال الآخران، حدثنا معاذ بن هشام، قال حدثني أبي، عن قتادة، عن أبي المليح، أن عبيد الله بن زياد، عاد معقل بن يسار في مرضه فقال له معقل إني محدثك بحديث لولا أني في الموت لم أحدثك به سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ ما من أمير يلي أمر المسلمين ثم لا يجهد لهم وينصح إلا لم يدخل معهم الجنة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 273
			}
		},
		{
			"hadithnumber": 367,
			"arabicnumber": "143.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو معاوية، ووكيع، ح وحدثنا أبو كريب، حدثنا أبو معاوية، عن الأعمش، عن زيد بن وهب، عن حذيفة، قال حدثنا رسول الله صلى الله عليه وسلم حديثين قد رأيت أحدهما وأنا أنتظر الآخر حدثنا ‏\"‏ أن الأمانة نزلت في جذر قلوب الرجال ثم نزل القرآن فعلموا من القرآن وعلموا من السنة ‏\"‏ ‏.‏ ثم حدثنا عن رفع الأمانة قال ‏\"‏ ينام الرجل النومة فتقبض الأمانة من قلبه فيظل أثرها مثل الوكت ثم ينام النومة فتقبض الأمانة من قلبه فيظل أثرها مثل المجل كجمر دحرجته على رجلك فنفط فتراه منتبرا وليس فيه شىء - ثم أخذ حصى فدحرجه على رجله - فيصبح الناس يتبايعون لا يكاد أحد يؤدي الأمانة حتى يقال إن في بني فلان رجلا أمينا ‏.‏ حتى يقال للرجل ما أجلده ما أظرفه ما أعقله وما في قلبه مثقال حبة من خردل من إيمان ‏\"‏ ‏.‏ ولقد أتى على زمان وما أبالي أيكم بايعت لئن كان مسلما ليردنه على دينه ولئن كان نصرانيا أو يهوديا ليردنه على ساعيه وأما اليوم فما كنت لأبايع منكم إلا فلانا وفلانا ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 274
			}
		},
		{
			"hadithnumber": 368,
			"arabicnumber": "143.02",
			"text": "وحدثنا ابن نمير، حدثنا أبي ووكيع، ح وحدثنا إسحاق بن إبراهيم، حدثنا عيسى بن يونس، جميعا عن الأعمش، بهذا الإسناد مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 275
			}
		},
		{
			"hadithnumber": 369,
			"arabicnumber": "144.01",
			"text": "وحدثنا محمد بن عبد الله بن نمير، حدثنا أبو خالد، - يعني سليمان بن حيان - عن سعد بن طارق، عن ربعي، عن حذيفة، قال كنا عند عمر فقال أيكم سمع رسول الله صلى الله عليه وسلم يذكر الفتن فقال قوم نحن سمعناه ‏.‏ فقال لعلكم تعنون فتنة الرجل في أهله وجاره قالوا أجل ‏.‏ قال تلك تكفرها الصلاة والصيام والصدقة ولكن أيكم سمع النبي صلى الله عليه وسلم يذكر الفتن التي تموج موج البحر قال حذيفة فأسكت القوم فقلت أنا ‏.‏ قال أنت لله أبوك ‏.‏ قال حذيفة سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ تعرض الفتن على القلوب كالحصير عودا عودا فأى قلب أشربها نكت فيه نكتة سوداء وأى قلب أنكرها نكت فيه نكتة بيضاء حتى تصير على قلبين على أبيض مثل الصفا فلا تضره فتنة ما دامت السموات والأرض والآخر أسود مربادا كالكوز مجخيا لا يعرف معروفا ولا ينكر منكرا إلا ما أشرب من هواه ‏\"‏ ‏.‏ قال حذيفة وحدثته أن بينك وبينها بابا مغلقا يوشك أن يكسر ‏.‏ قال عمر أكسرا لا أبا لك فلو أنه فتح لعله كان يعاد ‏.‏ قلت لا بل يكسر ‏.‏ وحدثته أن ذلك الباب رجل يقتل أو يموت ‏.‏ حديثا ليس بالأغاليط ‏.‏ قال أبو خالد فقلت لسعد يا أبا مالك ما أسود مربادا قال شدة البياض في سواد ‏.‏ قال قلت فما الكوز مجخيا قال منكوسا ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 276
			}
		},
		{
			"hadithnumber": 370,
			"arabicnumber": "144.02",
			"text": "وحدثني ابن أبي عمر، حدثنا مروان الفزاري، حدثنا أبو مالك الأشجعي، عن ربعي، قال لما قدم حذيفة من عند عمر جلس فحدثنا فقال إن أمير المؤمنين أمس لما جلست إليه سأل أصحابه أيكم يحفظ قول رسول الله صلى الله عليه وسلم في الفتن وساق الحديث بمثل حديث أبي خالد ولم يذكر تفسير أبي مالك لقوله ‏ \"‏ مربادا مجخيا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 277
			}
		},
		{
			"hadithnumber": 371,
			"arabicnumber": "144.03",
			"text": "وحدثني محمد بن المثنى، وعمرو بن علي، وعقبة بن مكرم العمي، قالوا حدثنا محمد بن أبي عدي، عن سليمان التيمي، عن نعيم بن أبي هند، عن ربعي بن حراش، عن حذيفة، أن عمر، قال من يحدثنا أو قال أيكم يحدثنا - وفيهم حذيفة - ما قال رسول الله صلى الله عليه وسلم في الفتنة قال حذيفة أنا ‏.‏ وساق الحديث كنحو حديث أبي مالك عن ربعي وقال في الحديث قال حذيفة حدثته حديثا ليس بالأغاليط وقال يعني أنه عن رسول الله صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 278
			}
		},
		{
			"hadithnumber": 372,
			"arabicnumber": "145",
			"text": "حدثنا محمد بن عباد، وابن أبي عمر، جميعا عن مروان الفزاري، قال ابن عباد حدثنا مروان، عن يزيد، - يعني ابن كيسان - عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ بدأ الإسلام غريبا وسيعود كما بدأ غريبا فطوبى للغرباء ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 279
			}
		},
		{
			"hadithnumber": 373,
			"arabicnumber": "146",
			"text": "وحدثني محمد بن رافع، والفضل بن سهل الأعرج، قالا حدثنا شبابة بن سوار، حدثنا عاصم، - وهو ابن محمد العمري - عن أبيه، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏ \"‏ إن الإسلام بدأ غريبا وسيعود غريبا كما بدأ وهو يأرز بين المسجدين كما تأرز الحية في جحرها ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 280
			}
		},
		{
			"hadithnumber": 374,
			"arabicnumber": "147",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، وأبو أسامة عن عبيد الله بن عمر، ح وحدثنا ابن نمير، حدثنا أبي، حدثنا عبيد الله، عن خبيب بن عبد الرحمن، عن حفص بن عاصم، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إن الإيمان ليأرز إلى المدينة كما تأرز الحية إلى جحرها ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 281
			}
		},
		{
			"hadithnumber": 375,
			"arabicnumber": "148.01",
			"text": "حدثني زهير بن حرب، حدثنا عفان، حدثنا حماد، أخبرنا ثابت، عن أنس، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا تقوم الساعة حتى لا يقال في الأرض الله الله ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 282
			}
		},
		{
			"hadithnumber": 376,
			"arabicnumber": "148.02",
			"text": "حدثنا عبد بن حميد، أخبرنا عبد الرزاق، أخبرنا معمر، عن ثابت، عن أنس، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا تقوم الساعة على أحد يقول الله الله ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 283
			}
		},
		{
			"hadithnumber": 377,
			"arabicnumber": "149",
			"text": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن عبد الله بن نمير، وأبو كريب - واللفظ لأبي كريب - قالوا حدثنا أبو معاوية، عن الأعمش، عن شقيق، عن حذيفة، قال كنا مع رسول الله صلى الله عليه وسلم فقال ‏\"‏ أحصوا لي كم يلفظ الإسلام ‏\"‏ ‏.‏ قال فقلنا يا رسول الله صلى الله عليه وسلم أتخاف علينا ونحن ما بين الستمائة إلى السبعمائة قال ‏\"‏ إنكم لا تدرون لعلكم أن تبتلوا ‏\"‏ ‏.‏ قال فابتلينا حتى جعل الرجل منا لا يصلي إلا سرا ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 284
			}
		},
		{
			"hadithnumber": 378,
			"arabicnumber": "150.01",
			"text": "حدثنا ابن أبي عمر، حدثنا سفيان، عن الزهري، عن عامر بن سعد، عن أبيه، قال قسم رسول الله صلى الله عليه وسلم قسما فقلت يا رسول الله أعط فلانا فإنه مؤمن ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أو مسلم ‏\"‏ أقولها ثلاثا ‏.‏ ويرددها على ثلاثا ‏\"‏ أو مسلم ‏\"‏ ثم قال ‏\"‏ إني لأعطي الرجل وغيره أحب إلى منه مخافة أن يكبه الله في النار ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 285
			}
		},
		{
			"hadithnumber": 379,
			"arabicnumber": "150.02",
			"text": "حدثني زهير بن حرب، حدثنا يعقوب بن إبراهيم، حدثنا ابن أخي ابن شهاب، عن عمه، قال أخبرني عامر بن سعد بن أبي وقاص، عن أبيه، سعد أن رسول الله صلى الله عليه وسلم أعطى رهطا وسعد جالس فيهم قال سعد فترك رسول الله صلى الله عليه وسلم منهم من لم يعطه وهو أعجبهم إلى فقلت يا رسول الله ما لك عن فلان فوالله إني لأراه مؤمنا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أو مسلما ‏\"‏ ‏.‏ قال فسكت قليلا ثم غلبني ما أعلم منه فقلت يا رسول الله ما لك عن فلان فوالله إني لأراه مؤمنا فقال رسول الله صلى الله عليه وسلم ‏\"‏ أو مسلما ‏\"‏ ‏.‏ قال فسكت قليلا ثم غلبني ما علمت منه فقلت يا رسول الله ما لك عن فلان فوالله إني لأراه مؤمنا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أو مسلما ‏.‏ إني لأعطي الرجل وغيره أحب إلى منه خشية أن يكب في النار على وجهه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 286
			}
		},
		{
			"hadithnumber": 380,
			"arabicnumber": "150.03",
			"text": "حدثنا الحسن بن علي الحلواني، وعبد بن حميد، قالا حدثنا يعقوب، - وهو ابن إبراهيم بن سعد - حدثنا أبي، عن صالح، عن ابن شهاب، قال حدثني عامر بن سعد، عن أبيه، سعد أنه قال أعطى رسول الله صلى الله عليه وسلم رهطا وأنا جالس فيهم ‏.‏ بمثل حديث ابن أخي ابن شهاب عن عمه ‏.‏ وزاد فقمت إلى رسول الله صلى الله عليه وسلم فساررته فقلت ما لك عن فلان ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 287
			}
		},
		{
			"hadithnumber": 381,
			"arabicnumber": "150.04",
			"text": "وحدثنا الحسن الحلواني، حدثنا يعقوب، حدثنا أبي، عن صالح، عن إسماعيل بن محمد، قال سمعت محمد بن سعد، يحدث هذا فقال في حديثه فضرب رسول الله صلى الله عليه وسلم بيده بين عنقي وكتفي ثم قال ‏ \"‏ أقتالا أى سعد إني لأعطي الرجل ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 288
			}
		},
		{
			"hadithnumber": 382,
			"arabicnumber": "151.01",
			"text": "وحدثني حرملة بن يحيى، أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، عن أبي سلمة بن عبد الرحمن، وسعيد بن المسيب، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ نحن أحق بالشك من إبراهيم صلى الله عليه وسلم إذ قال ‏{‏ رب أرني كيف تحيي الموتى قال أولم تؤمن قال بلى ولكن ليطمئن قلبي‏}‏ قال ‏\"‏ ويرحم الله لوطا لقد كان يأوي إلى ركن شديد ولو لبثت في السجن طول لبث يوسف لأجبت الداعي ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 289
			}
		},
		{
			"hadithnumber": 383,
			"arabicnumber": "151.02",
			"text": "وحدثني به، إن شاء الله عبد الله بن محمد بن أسماء الضبعي حدثنا جويرية، عن مالك، عن الزهري، أن سعيد بن المسيب، وأبا، عبيد أخبراه عن أبي هريرة، عن رسول الله صلى الله عليه وسلم بمثل حديث يونس عن الزهري وفي حديث مالك ‏ \"‏ ولكن ليطمئن قلبي ‏\"‏ ‏.‏ قال ثم قرأ هذه الآية حتى جازها ‏.‏ حدثناه عبد بن حميد، قال حدثني يعقوب، - يعني ابن إبراهيم بن سعد - حدثنا أبو أويس، عن الزهري، كرواية مالك بإسناده وقال ثم قرأ هذه الآية حتى أنجزها ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 290
			}
		},
		{
			"hadithnumber": 385,
			"arabicnumber": "152",
			"text": "حدثنا قتيبة بن سعيد، حدثنا ليث، عن سعيد بن أبي سعيد، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ ما من الأنبياء من نبي إلا قد أعطي من الآيات ما مثله آمن عليه البشر وإنما كان الذي أوتيت وحيا أوحى الله إلى فأرجو أن أكون أكثرهم تابعا يوم القيامة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 291
			}
		},
		{
			"hadithnumber": 386,
			"arabicnumber": "153",
			"text": "حدثني يونس بن عبد الأعلى، أخبرنا ابن وهب، قال وأخبرني عمرو، أن أبا يونس، حدثه عن أبي هريرة، عن رسول الله صلى الله عليه وسلم أنه قال ‏ \"‏ والذي نفس محمد بيده لا يسمع بي أحد من هذه الأمة يهودي ولا نصراني ثم يموت ولم يؤمن بالذي أرسلت به إلا كان من أصحاب النار ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 292
			}
		},
		{
			"hadithnumber": 387,
			"arabicnumber": "154.01",
			"text": "حدثنا يحيى بن يحيى، أخبرنا هشيم، عن صالح بن صالح الهمداني، عن الشعبي، قال رأيت رجلا من أهل خراسان سأل الشعبي فقال يا أبا عمرو إن من قبلنا من أهل خراسان يقولون في الرجل إذا أعتق أمته ثم تزوجها فهو كالراكب بدنته ‏.‏ فقال الشعبي حدثني أبو بردة بن أبي موسى عن أبيه أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ ثلاثة يؤتون أجرهم مرتين رجل من أهل الكتاب آمن بنبيه وأدرك النبي صلى الله عليه وسلم فآمن به واتبعه وصدقه فله أجران وعبد مملوك أدى حق الله تعالى وحق سيده فله أجران ورجل كانت له أمة فغذاها فأحسن غذاءها ثم أدبها فأحسن أدبها ثم أعتقها وتزوجها فله أجران ‏\"‏ ‏.‏ ثم قال الشعبي للخراساني خذ هذا الحديث بغير شىء ‏.‏ فقد كان الرجل يرحل فيما دون هذا إلى المدينة ‏.‏ وحدثنا أبو بكر بن أبي شيبة، حدثنا عبدة بن سليمان، ح وحدثنا ابن أبي عمر، حدثنا سفيان، ح وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، كلهم عن صالح بن صالح، بهذا الإسناد نحوه ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 293
			}
		},
		{
			"hadithnumber": 389,
			"arabicnumber": "155.01",
			"text": "حدثنا قتيبة بن سعيد، حدثنا ليث، ح وحدثنا محمد بن رمح، أخبرنا الليث، عن ابن شهاب، عن ابن المسيب، أنه سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ والذي نفسي بيده ليوشكن أن ينزل فيكم ابن مريم صلى الله عليه وسلم حكما مقسطا فيكسر الصليب ويقتل الخنزير ويضع الجزية ويفيض المال حتى لا يقبله أحد ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 294
			}
		},
		{
			"hadithnumber": 390,
			"arabicnumber": "155.02",
			"text": "وحدثناه عبد الأعلى بن حماد، وأبو بكر بن أبي شيبة وزهير بن حرب قالوا حدثنا سفيان بن عيينة، ح وحدثنيه حرملة بن يحيى، أخبرنا ابن وهب، قال حدثني يونس، ح وحدثنا حسن الحلواني، وعبد بن حميد، عن يعقوب بن إبراهيم بن سعد، حدثنا أبي، عن صالح، كلهم عن الزهري، بهذا الإسناد وفي رواية ابن عيينة ‏\"‏ إماما مقسطا وحكما عدلا ‏\"‏ ‏.‏ وفي رواية يونس ‏\"‏ حكما عادلا ‏\"‏ ‏.‏ ولم يذكر ‏\"‏ إماما مقسطا ‏\"‏ ‏.‏ وفي حديث صالح ‏\"‏ حكما مقسطا ‏\"‏ كما قال الليث ‏.‏ وفي حديثه من الزيادة ‏\"‏ وحتى تكون السجدة الواحدة خيرا من الدنيا وما فيها ‏\"‏ ‏.‏ ثم يقول أبو هريرة اقرءوا إن شئتم ‏{‏ وإن من أهل الكتاب إلا ليؤمنن به قبل موته‏}‏ الآية ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 295
			}
		},
		{
			"hadithnumber": 391,
			"arabicnumber": "155.03",
			"text": "حدثنا قتيبة بن سعيد، حدثنا ليث، عن سعيد بن أبي سعيد، عن عطاء بن ميناء، عن أبي هريرة، أنه قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ والله لينزلن ابن مريم حكما عادلا فليكسرن الصليب وليقتلن الخنزير وليضعن الجزية ولتتركن القلاص فلا يسعى عليها ولتذهبن الشحناء والتباغض والتحاسد وليدعون إلى المال فلا يقبله أحد ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 296
			}
		},
		{
			"hadithnumber": 392,
			"arabicnumber": "155.04",
			"text": "حدثني حرملة بن يحيى، أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، قال أخبرني نافع، مولى أبي قتادة الأنصاري أن أبا هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ كيف أنتم إذا نزل ابن مريم فيكم وإمامكم منكم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 297
			}
		},
		{
			"hadithnumber": 393,
			"arabicnumber": "155.05",
			"text": "وحدثني محمد بن حاتم، حدثنا يعقوب بن إبراهيم، حدثنا ابن أخي ابن شهاب، عن عمه، قال أخبرني نافع، مولى أبي قتادة الأنصاري أنه سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ كيف أنتم إذا نزل ابن مريم فيكم وأمكم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 298
			}
		},
		{
			"hadithnumber": 394,
			"arabicnumber": "155.06",
			"text": "وحدثنا زهير بن حرب، حدثني الوليد بن مسلم، حدثنا ابن أبي ذئب، عن ابن شهاب، عن نافع، مولى أبي قتادة عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ كيف أنتم إذا نزل فيكم ابن مريم فأمكم منكم ‏\"‏ ‏.‏ فقلت لابن أبي ذئب إن الأوزاعي حدثنا عن الزهري عن نافع عن أبي هريرة ‏\"‏ وإمامكم منكم ‏\"‏ ‏.‏ قال ابن أبي ذئب تدري ما أمكم منكم قلت تخبرني ‏.‏ قال فأمكم بكتاب ربكم تبارك وتعالى وسنة نبيكم صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 299
			}
		},
		{
			"hadithnumber": 395,
			"arabicnumber": "156",
			"text": "حدثنا الوليد بن شجاع، وهارون بن عبد الله، وحجاج بن الشاعر، قالوا حدثنا حجاج، - وهو ابن محمد - عن ابن جريج، قال أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول سمعت النبي صلى الله عليه وسلم يقول ‏ \"‏ لا تزال طائفة من أمتي يقاتلون على الحق ظاهرين إلى يوم القيامة - قال - فينزل عيسى ابن مريم صلى الله عليه وسلم فيقول أميرهم تعال صل لنا ‏.‏ فيقول لا ‏.‏ إن بعضكم على بعض أمراء ‏.‏ تكرمة الله هذه الأمة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 300
			}
		},
		{
			"hadithnumber": 396,
			"arabicnumber": "157.01",
			"text": "حدثنا يحيى بن أيوب، وقتيبة بن سعيد، وعلي بن حجر، قالوا حدثنا إسماعيل، - يعنون ابن جعفر - عن العلاء، - وهو ابن عبد الرحمن - عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا تقوم الساعة حتى تطلع الشمس من مغربها فإذا طلعت من مغربها آمن الناس كلهم أجمعون فيومئذ لا ينفع نفسا إيمانها لم تكن آمنت من قبل أو كسبت في إيمانها خيرا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 301
			}
		},
		{
			"hadithnumber": 397,
			"arabicnumber": "157.02",
			"text": "حدثنا أبو بكر بن أبي شيبة، وابن، نمير وأبو كريب قالوا حدثنا ابن فضيل، ح وحدثني زهير بن حرب، حدثنا جرير، كلاهما عن عمارة بن القعقاع، عن أبي زرعة، عن أبي هريرة، عن النبي صلى الله عليه وسلم ح وحدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن عبد الله بن ذكوان، عن عبد الرحمن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم ح وحدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، عن أبي هريرة، عن النبي صلى الله عليه وسلم بمثل حديث العلاء عن أبيه عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 302
			}
		},
		{
			"hadithnumber": 398,
			"arabicnumber": "158",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، قالا حدثنا وكيع، ح وحدثنيه زهير بن حرب، حدثنا إسحاق بن يوسف الأزرق، جميعا عن فضيل بن غزوان، ح وحدثنا أبو كريب، محمد بن العلاء - واللفظ له - حدثنا ابن فضيل، عن أبيه، عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ ثلاث إذا خرجن لا ينفع نفسا إيمانها لم تكن آمنت من قبل أو كسبت في إيمانها خيرا طلوع الشمس من مغربها والدجال ودابة الأرض ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 303
			}
		},
		{
			"hadithnumber": 399,
			"arabicnumber": "159.01",
			"text": "حدثنا يحيى بن أيوب، وإسحاق بن إبراهيم، جميعا عن ابن علية، - قال ابن أيوب حدثنا ابن علية، - حدثنا يونس، عن إبراهيم بن يزيد التيمي، - سمعه فيما، أعلم - عن أبيه، عن أبي ذر، أن النبي صلى الله عليه وسلم قال يوما ‏\"‏ أتدرون أين تذهب هذه الشمس ‏\"‏ ‏.‏ قالوا الله ورسوله أعلم ‏.‏ قال ‏\"‏ إن هذه تجري حتى تنتهي إلى مستقرها تحت العرش فتخر ساجدة ولا تزال كذلك حتى يقال لها ارتفعي ارجعي من حيث جئت فترجع فتصبح طالعة من مطلعها ثم تجري حتى تنتهي إلى مستقرها تحت العرش فتخر ساجدة ولا تزال كذلك حتى يقال لها ارتفعي ارجعي من حيث جئت فترجع فتصبح طالعة من مطلعها ثم تجري لا يستنكر الناس منها شيئا حتى تنتهي إلى مستقرها ذاك تحت العرش فيقال لها ارتفعي أصبحي طالعة من مغربك فتصبح طالعة من مغربها ‏\"‏ ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أتدرون متى ذاكم ذاك حين لا ينفع نفسا إيمانها لم تكن آمنت من قبل أو كسبت في إيمانها خيرا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 304
			}
		},
		{
			"hadithnumber": 400,
			"arabicnumber": "159.02",
			"text": "وحدثني عبد الحميد بن بيان الواسطي، أخبرنا خالد، - يعني ابن عبد الله - عن يونس، عن إبراهيم التيمي، عن أبيه، عن أبي ذر، أن النبي صلى الله عليه وسلم قال يوما ‏ \"‏ أتدرون أين تذهب هذه الشمس ‏\"‏ بمثل معنى حديث ابن علية ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 305
			}
		},
		{
			"hadithnumber": 401,
			"arabicnumber": "159.03",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب - واللفظ لأبي كريب - قالا حدثنا أبو معاوية، حدثنا الأعمش، عن إبراهيم التيمي، عن أبيه، عن أبي ذر، قال دخلت المسجد ورسول الله صلى الله عليه وسلم جالس فلما غابت الشمس قال ‏\"‏ يا أبا ذر هل تدري أين تذهب هذه ‏\"‏ ‏.‏ قال قلت الله ورسوله أعلم ‏.‏ قال ‏\"‏ فإنها تذهب فتستأذن في السجود فيؤذن لها وكأنها قد قيل لها ارجعي من حيث جئت فتطلع من مغربها ‏\"‏ ‏.‏ قال ثم قرأ في قراءة عبد الله وذلك مستقر لها ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 306
			}
		},
		{
			"hadithnumber": 402,
			"arabicnumber": "159.04",
			"text": "حدثنا أبو سعيد الأشج، وإسحاق بن إبراهيم، - قال إسحاق أخبرنا وقال الأشج، حدثنا - وكيع، حدثنا الأعمش، عن إبراهيم التيمي، عن أبيه، عن أبي ذر، قال سألت رسول الله صلى الله عليه وسلم عن قول الله تعالى ‏{‏ والشمس تجري لمستقر لها‏}‏ قال ‏\"‏ مستقرها تحت العرش ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 307
			}
		},
		{
			"hadithnumber": 403,
			"arabicnumber": "160.01",
			"text": "حدثني أبو الطاهر، أحمد بن عمرو بن عبد الله بن عمرو بن سرح أخبرنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، قال حدثني عروة بن الزبير، أن عائشة، زوج النبي صلى الله عليه وسلم أخبرته أنها قالت كان أول ما بدئ به رسول الله صلى الله عليه وسلم من الوحى الرؤيا الصادقة في النوم فكان لا يرى رؤيا إلا جاءت مثل فلق الصبح ثم حبب إليه الخلاء فكان يخلو بغار حراء يتحنث فيه - وهو التعبد - الليالي أولات العدد قبل أن يرجع إلى أهله ويتزود لذلك ثم يرجع إلى خديجة فيتزود لمثلها حتى فجئه الحق وهو في غار حراء فجاءه الملك فقال اقرأ ‏.‏ قال ‏\"‏ ما أنا بقارئ - قال - فأخذني فغطني حتى بلغ مني الجهد ثم أرسلني فقال اقرأ ‏.‏ قال قلت م�� أنا بقارئ - قال - فأخذني فغطني الثانية حتى بلغ مني الجهد ثم أرسلني فقال اقرأ ‏.‏ فقلت ما أنا بقارئ فأخذني فغطني الثالثة حتى بلغ مني الجهد ثم أرسلني ‏.‏ فقال ‏{‏ اقرأ باسم ربك الذي خلق * خلق الإنسان من علق * اقرأ وربك الأكرم * الذي علم بالقلم * علم الإنسان ما لم يعلم‏}‏ ‏\"‏ ‏.‏ فرجع بها رسول الله صلى الله عليه وسلم ترجف بوادره حتى دخل على خديجة فقال ‏\"‏ زملوني زملوني ‏\"‏ ‏.‏ فزملوه حتى ذهب عنه الروع ثم قال لخديجة ‏\"‏ أى خديجة ما لي ‏\"‏ ‏.‏ وأخبرها الخبر قال ‏\"‏ لقد خشيت على نفسي ‏\"‏ ‏.‏ قالت له خديجة كلا أبشر فوالله لا يخزيك الله أبدا والله إنك لتصل الرحم وتصدق الحديث وتحمل الكل وتكسب المعدوم وتقري الضيف وتعين على نوائب الحق ‏.‏ فانطلقت به خديجة حتى أتت به ورقة بن نوفل بن أسد بن عبد العزى وهو ابن عم خديجة أخي أبيها وكان امرأ تنصر في الجاهلية وكان يكتب الكتاب العربي ويكتب من الإنجيل بالعربية ما شاء الله أن يكتب وكان شيخا كبيرا قد عمي ‏.‏ فقالت له خديجة أى عم اسمع من ابن أخيك ‏.‏ قال ورقة بن نوفل يا ابن أخي ماذا ترى فأخبره رسول الله صلى الله عليه وسلم خبر ما رآه فقال له ورقة هذا الناموس الذي أنزل على موسى صلى الله عليه وسلم يا ليتني فيها جذعا يا ليتني أكون حيا حين يخرجك قومك ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ أومخرجي هم ‏\"‏ ‏.‏ قال ورقة نعم لم يأت رجل قط بما جئت به إلا عودي وإن يدركني يومك أنصرك نصرا مؤزرا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 308
			}
		},
		{
			"hadithnumber": 404,
			"arabicnumber": "160.02",
			"text": "وحدثني محمد بن رافع، حدثنا عبد الرزاق، أخبرنا معمر، قال قال الزهري وأخبرني عروة، عن عائشة، أنها قالت أول ما بدئ به رسول الله صلى الله عليه وسلم من الوحى ‏.‏ وساق الحديث بمثل حديث يونس ‏.‏ غير أنه قال فوالله لا يحزنك الله أبدا ‏.‏ وقال قالت خديجة أى ابن عم اسمع من ابن أخيك ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 309
			}
		},
		{
			"hadithnumber": 405,
			"arabicnumber": "160.03",
			"text": "وحدثني عبد الملك بن شعيب بن الليث، قال حدثني أبي، عن جدي، قال حدثني عقيل بن خالد، قال ابن شهاب سمعت عروة بن الزبير، يقول قالت عائشة زوج النبي صلى الله عليه وسلم فرجع إلى خديجة يرجف فؤاده واقتص الحديث بمثل حديث يونس ومعمر ولم يذكر أول حديثهما من قوله أول ما بدئ به رسول الله صلى الله عليه وسلم من الوحى الرؤيا الصادقة ‏.‏ وتابع يونس على قوله فوالله لا يخزيك الله أبدا ‏.‏ وذكر قول خديجة أى ابن عم اسمع من ابن أخيك ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 310
			}
		},
		{
			"hadithnumber": 406,
			"arabicnumber": "161.01",
			"text": "وحدثني أبو الطاهر، أخبرنا ابن وهب، قال حدثني يونس، قال قال ابن شهاب أخبرني أبو سلمة بن عبد الرحمن، أن جابر بن عبد الله الأنصاري، - وكان من أصحاب رسول الله صلى الله عليه وسلم كان يحدث قال قال رسول الله صلى الله عليه وسلم وهو يحدث عن فترة الوحى - قال في حديثه ‏\"‏ فبينا أنا أمشي سمعت صوتا من السماء فرفعت رأسي فإذا الملك الذي جاءني بحراء جالسا على كرسي بين السماء والأرض ‏\"‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ فجئثت منه فرقا فرجعت فقلت زملوني زملوني ‏.‏ فدثروني فأنزل الله تبارك وتعالى ‏{‏ يا أيها المدثر * قم فأنذر * وربك فكبر * وثيابك فطهر * والرجز فاهجر‏}‏ وهي الأوثان قال ثم تتابع الوحى ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 311
			}
		},
		{
			"hadithnumber": 407,
			"arabicnumber": "161.02",
			"text": "وحدثني عبد الملك بن شعيب بن الليث، قال حدثني أبي، عن جدي، قال حدثني عقيل بن خالد، عن ابن شهاب، قال سمعت أبا سلمة بن عبد الرحمن، يقول أخبرني جابر بن عبد الله، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ ثم فتر الوحى عني فترة فبينا أنا أمشي ‏\"‏ ثم ذكر مثل حديث يونس غير أنه قال ‏\"‏ فجثثت منه فرقا حتى هويت إلى الأرض ‏\"‏ ‏.‏ قال وقال أبو سلمة والرجز الأوثان قال ثم حمي الوحى بعد وتتابع",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 312
			}
		},
		{
			"hadithnumber": 408,
			"arabicnumber": "161.03",
			"text": "وحدثني محمد بن رافع حدثنا عبد الرزاق أخبرنا معمر عن الزهري بهذا الإسناد نحو حديث يونس وقال فأنزل الله تبارك وتعالى ‏{‏ يا أيها المدثر‏}‏ إلى قوله ‏{‏ والرجز فاهجر‏}‏ قبل أن تفرض الصلاة - وهي الأوثان - وقال ‏ \"‏ فجثثت منه ‏\"‏ ‏.‏ كما قال عقيل",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 313
			}
		},
		{
			"hadithnumber": 409,
			"arabicnumber": "161.04",
			"text": "وحدثنا زهير بن حرب، حدثنا الوليد بن مسلم، حدثنا الأوزاعي، قال سمعت يحيى، يقول سألت أبا سلمة أى القرآن أنزل قبل قال يا أيها المدثر ‏.‏ فقلت أو اقرأ ‏.‏ فقال سألت جابر بن عبد الله أى القرآن أنزل قبل قال يا أيها المدثر ‏.‏ فقلت أو اقرأ قال جابر أحدثكم ما حدثنا رسول الله صلى الله عليه وسلم قال ‏\"‏ جاورت بحراء شهرا فلما قضيت جواري نزلت فاستبطنت بطن الوادي فنوديت فنظرت أمامي وخلفي وعن يميني وعن شمالي فلم أر أحدا ثم نوديت فنظرت فلم أر أحدا ثم نوديت فرفعت رأسي فإذا هو على العرش في الهواء - يعني جبريل عليه السلام - فأخذتني رجفة شديدة فأتيت خديجة فقلت دثروني ‏.‏ فدثروني فصبوا على ماء فأنزل الله عز وجل ‏{‏ يا أيها المدثر * قم فأنذر * وربك فكبر * وثيابك فطهر‏}‏ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 314
			}
		},
		{
			"hadithnumber": 410,
			"arabicnumber": "161.05",
			"text": "حدثنا محمد بن المثنى، حدثنا عثمان بن عمر، أخبرنا علي بن المبارك، عن يحيى بن أبي كثير، بهذا الإسناد وقال ‏ \"‏ فإذا هو جالس على عرش بين السماء والأرض ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 315
			}
		},
		{
			"hadithnumber": 411,
			"arabicnumber": "162.01",
			"text": "حدثنا شيبان بن فروخ، حدثنا حماد بن سلمة، حدثنا ثابت البناني، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أتيت بالبراق - وهو دابة أبيض طويل فوق الحمار ودون البغل يضع حافره عند منتهى طرفه - قال فركبته حتى أتيت بيت المقدس - قال - فربطته بالحلقة التي يربط به الأنبياء - قال - ثم دخلت المسجد فصليت فيه ركعتين ثم خرجت فجاءني جبريل - عليه السلام - بإناء من خمر وإناء من لبن فاخترت اللبن فقال جبريل صلى الله عليه وسلم اخترت الفطرة ‏.‏ ثم عرج بنا إلى السماء فاستفتح جبريل فقيل من أنت قال جبريل ‏.‏ قيل ومن معك قال محمد ‏.‏ قيل وقد بعث إليه قال قد بعث إليه ‏.‏ ففتح لنا فإذا أنا بآدم فرحب بي ودعا لي بخير ‏.‏ ثم عرج بنا إلى السماء الثانية فاستفتح جبريل عليه السلام ‏.‏ فقيل من أنت قال جبريل ‏.‏ قيل ومن معك قال محمد ‏.‏ قيل وقد بعث إليه قال قد بعث إليه ‏.‏ ففتح لنا فإذا أنا بابنى الخالة عيسى ابن مريم ويحيى بن زكرياء صلوات الله عليهما فرحبا ودعوا لي بخير ‏.‏ ثم عرج بي إلى السماء الثالثة فاستفتح جبريل ‏.‏ فقيل من أنت قال جبريل ‏.‏ قيل ومن معك قال محمد صلى الله عليه وسلم ‏.‏ قيل وقد بعث إليه قال قد بعث إليه ‏.‏ ففتح لنا فإذا أنا بيوسف صلى الله عليه وسلم إذا هو قد أعطي شطر الحسن فرحب ودعا لي بخير ‏.‏ ثم عرج بنا إلى السماء الرابعة فاستفتح جبريل - عليه السلام - قيل من هذا قال جبريل ‏.‏ قيل ومن معك قال محمد ‏.‏ قال وقد بعث إليه قال قد بعث إليه ‏.‏ ففتح لنا فإذا أنا بإدريس فرحب ودعا لي بخير قال الله عز وجل ‏{‏ ورفعناه مكانا عليا‏}‏ ثم عرج بنا إلى السماء الخامسة فاستفتح جبريل ‏.‏ قيل من هذا قال جبريل ‏.‏ قيل ومن معك قال محمد ‏.‏ قيل وقد بعث إليه قال قد بعث إليه ‏.‏ ففتح لنا فإذا أنا بهارون صلى الله عليه وسلم فرحب ودعا لي بخير ‏.‏ ثم عرج بنا إلى السماء السادسة فاستفتح جبريل عليه السلام ‏.‏ قيل من هذا قال جبريل ‏.‏ قيل ومن معك قال محمد ‏.‏ قيل وقد بعث إليه قال قد بعث إليه ‏.‏ ففتح لنا فإذا أنا بموسى صلى الله عليه وسلم فرحب ودعا لي بخير ‏.‏ ثم عرج بنا إلى السماء السابعة فاستفتح جبريل فقيل من هذا قال جبريل ‏.‏ قيل ومن معك قال محمد صلى الله عليه وسلم ‏.‏ قيل وقد بعث إليه قال قد بعث إليه ‏.‏ ففتح لنا فإذا أنا بإبراهيم صلى الله عليه وسلم مسندا ظهره إلى البيت المعمور وإذا هو يدخله كل يوم سبعون ألف ملك لا يعودون إليه ثم ذهب بي إلى السدرة المنتهى وإذا ورقها كآذان الفيلة وإذا ثمرها كالقلال - قال - فلما غشيها من أمر الله ما غشي تغيرت فما أحد من خلق الله يستطيع أن ينعتها من حسنها ‏.‏ فأوحى الله إلى ما أوحى ففرض على خمسين صلاة في كل يوم وليلة فنزلت إلى موسى صلى الله عليه وسلم فقال ما فرض ربك على أمتك قلت خمسين صلاة ‏.‏ قال ارجع إلى ربك فاسأله التخفيف فإن أمتك لا يطيقون ذلك فإني قد بلوت بني إسرائيل وخبرتهم ‏.‏ قال فرجعت إلى ربي فقلت يا رب خفف على أمتي ‏.‏ فحط عني خمسا فرجعت إلى موسى فقلت حط عني خمسا ‏.‏ قال إن أمتك لا يطيقون ذلك فارجع إلى ربك فاسأله التخفيف ‏.‏ - قال - فلم أزل أرجع بين ربي تبارك وتعالى وبين موسى - عليه السلام - حتى قال يا محمد إنهن خمس صلوات كل يوم وليلة لكل صلاة عشر فذلك خمسون صلاة ‏.‏ ومن هم بحسنة فلم يعملها كتبت له حسنة فإن عملها كتبت له عشرا ومن هم بسيئة فلم يعملها لم تكتب شيئا فإن عملها كتبت سيئة واحدة - قال - فنزلت حتى انتهيت إلى موسى صلى الله عليه وسلم فأخبرته فقال ارجع إلى ربك فاسأله التخفيف ‏.‏ فقال رسول الله صلى الله عليه وسلم فقلت قد رجعت إلى ربي حتى استحييت منه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 316
			}
		},
		{
			"hadithnumber": 412,
			"arabicnumber": "162.02",
			"text": "حدثني عبد الله بن هاشم العبدي، حدثنا بهز بن أسد، حدثنا سليمان بن المغيرة، حدثنا ثابت، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ أتيت فانطلقوا بي إلى زمزم فشرح عن صدري ثم غسل بماء زمزم ثم أنزلت ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 317
			}
		},
		{
			"hadithnumber": 413,
			"arabicnumber": "162.03",
			"text": "حدثنا شيبان بن فروخ، حدثنا حماد بن سلمة، حدثنا ثابت البناني، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم أتاه جبريل صلى الله عليه وسلم وهو يلعب مع الغلمان فأخذه فصرعه فشق عن قلبه فاستخرج القلب فاستخرج منه علقة فقال هذا حظ الشيطان منك ‏.‏ ثم غسله في طست من ذهب بماء زمزم ثم لأمه ثم أعاده في مكانه وجاء الغلمان يسعون إلى أمه - يعني ظئره - فقالوا إن محمدا قد قتل ‏.‏ فاستقبلوه وهو منتقع اللون ‏.‏ قال أنس وقد كنت أرى أثر ذلك المخيط في صدره ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 318
			}
		},
		{
			"hadithnumber": 414,
			"arabicnumber": "162",
			"text": "حدثنا هارون بن سعيد الأيلي، حدثنا ابن وهب، قال أخبرني سليمان، - وهو ابن بلال - قال حدثني شريك بن عبد الله بن أبي نمر، قال سمعت أنس بن مالك، يحدثنا عن ليلة، أسري برسول الله صلى الله عليه وسلم من مسجد الكعبة أنه جاءه ثلاثة نفر قبل أن يوحى إليه وهو نائم في المسجد الحرام وساق الحديث بقصته نحو حديث ثابت البناني وقدم فيه شيئا وأخر وزاد ونقص ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 319
			}
		},
		{
			"hadithnumber": 415,
			"arabicnumber": "163",
			"text": "وحدثني حرملة بن يحيى التجيبي، أخبرنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، عن أنس بن مالك، قال كان أبو ذر يحدث أن رسول الله صلى الله عليه وسلم قال ‏\"‏ فرج سقف بيتي وأنا بمكة فنزل جبريل صلى الله عليه وسلم ففرج صدري ثم غسله من ماء زمزم ثم جاء بطست من ذهب ممتلئ حكمة وإيمانا فأفرغها في صدري ثم أطبقه ثم أخذ بيدي فعرج بي إلى السماء فلما جئنا السماء الدنيا قال جبريل - عليه السلام - لخازن السماء الدنيا افتح ‏.‏ قال من هذا قال هذا جبريل ‏.‏ قال هل معك أحد قال نعم معي محمد صلى الله عليه وسلم ‏.‏ قال فأرسل إليه قال نعم ففتح - قال - فلما علونا السماء الدنيا فإذا رجل عن يمينه أسودة وعن يساره أسودة - قال - فإذا نظر قبل يمينه ضحك وإذا نظر قبل شماله بكى - قال - فقال مرحبا بالنبي الصالح والابن الصالح - قال - قلت يا جبريل من هذا قال هذا آدم صلى الله عليه وسلم وهذه الأسودة عن يمينه وعن شماله نسم بنيه فأهل اليمين أهل الجنة والأسودة التي عن شماله أهل النار فإذا نظر قبل يمينه ضحك وإذا نظر قبل شماله بكى - قال - ثم عرج بي جبريل حتى أتى السماء الثانية ‏.‏ فقال لخازنها افتح - قال - فقال له خازنها مثل ما قال خازن السماء الدنيا ففتح ‏\"‏ ‏.‏ فقال أنس بن مالك فذكر أنه وجد في السموات آدم وإدريس وعيسى وموسى وإبراهيم - صلوات الله عليهم أجمعين - ولم يثبت كيف منازلهم غير أنه ذكر أنه قد وجد آدم - عليه السلام - في السماء الدنيا وإبراهيم في السماء السادسة ‏.‏ قال ‏\"‏ فلما مر جبريل ورسول الله صلى الله عليه وسلم بإدريس - صلوات الله عليه - قال مرحبا بالنبي الصالح والأخ الصالح - قال - ثم مر فقلت من هذا فقال هذا إدريس - قال - ثم مررت بموسى - عليه السلام - فقال مرحبا بالنبي الصالح والأخ الصالح - قال - قلت من هذا قال هذا موسى - قال - ثم مررت بعيسى فقال مرحبا بالنبي الصالح والأخ الصالح ‏.‏ قلت من هذا قال عيسى ابن مريم - قال - ثم مررت بإبراهيم - عليه السلام - فقال مرحبا بالنبي الصالح والابن الصالح - قال - قلت من هذا قال هذا إبراهيم ‏\"‏ ‏.‏ قال ابن شهاب وأخبرني ابن حزم أن ابن عباس وأبا حبة الأنصاري كانا يقولان قال رسول الله صلى الله عليه وسلم ‏\"‏ ثم عرج بي حتى ظهرت لمستوى أسمع فيه صريف الأقلام ‏\"‏ ‏.‏ قال ابن حزم و أنس بن مالك قال رسول الله صلى الله عليه وسلم ‏\"‏ ففرض الله على أمتي خمسين صلاة - قال - فرجعت بذلك حتى أمر بموسى فقال موسى عليه السلام ماذا فرض ربك على أمتك - قال - قلت فرض عليهم خمسين صلاة ‏.‏ قال لي موسى عليه السلام فراجع ربك فإن أمتك لا تطيق ذلك - قال - فراجعت ربي فوضع شطرها - قال - فرجعت إلى موسى - عليه السلام - فأخبرته قال راجع ربك فإن أمتك لا تطيق ذلك - قال - فراجعت ربي فقال هي خمس وهى خمسون لا يبدل القول لدى - قال - فرجعت إلى موسى فقال راجع ربك ‏.‏ فقلت قد استحييت من ربي - قال - ثم انطلق بي جبريل حتى نأتي سدرة المنتهى فغشيها ألوان لا أدري ما هي - قال - ثم أدخلت الجنة فإذا فيها جنابذ اللؤلؤ وإذا ترابها المسك ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 320
			}
		},
		{
			"hadithnumber": 416,
			"arabicnumber": "164.01",
			"text": "حدثنا محمد بن المثنى، حدثنا ابن أبي عدي، عن سعيد، عن قتادة، عن أنس بن مالك، - لعله قال - عن مالك بن صعصعة، - رجل من قومه - قال قال نبي الله صلى الله عليه وسلم ‏\"‏ بينا أنا عند البيت بين النائم واليقظان إذ سمعت قائلا يقول أحد الثلاثة بين الرجلين ‏.‏ فأتيت فانطلق بي فأتيت بطست من ذهب فيها من ماء زمزم فشرح صدري إلى كذا وكذا ‏\"‏ ‏.‏ قال قتادة فقلت للذي معي ما يعني قال إلى أسفل بطنه ‏\"‏ فاستخرج قلبي فغسل بماء زمزم ثم أعيد مكانه ثم حشي إيمانا وحكمة ثم أتيت بدابة أبيض يقال له البراق فوق الحمار ودون البغل يقع خطوه عند أقصى طرفه فحملت عليه ثم انطلقنا حتى أتينا السماء الدنيا فاستفتح جبريل صلى الله عليه وسلم فقيل من هذا قال جبريل ‏.‏ قيل ومن معك قال محمد صلى الله عليه وسلم ‏.‏ قيل وقد بعث إليه قال نعم - قال - ففتح لنا وقال مرحبا به ولنعم المجيء جاء - قال - فأتينا على آدم صلى الله عليه وسلم ‏\"‏ ‏.‏ وساق الحديث بقصته ‏.‏ وذكر أنه لقي في السماء الثانية عيسى ويحيى - عليهما السلام - وفي الثالثة يوسف وفي الرابعة إدريس وفي الخامسة هارون - صلى الله عليهم وسلم - قال ‏\"‏ ثم انطلقنا حتى انتهينا إلى السماء السادسة فأتيت على موسى عليه السلام فسلمت عليه فقال مرحبا بالأخ الصالح والنبي الصالح ‏.‏ فلما جاوزته بكى فنودي ما يبكيك قال رب هذا غلام بعثته بعدي يدخل من أمته الجنة أكثر مما يدخل من أمتي ‏.‏ - قال - ثم انطلقنا حتى انتهينا إلى السماء السابعة فأتيت على إبراهيم ‏\"‏ ‏.‏ وقال في الحديث وحدث نبي الله صلى الله عليه وسلم أنه رأى أربعة أنهار يخرج من أصلها نهران ظاهران ونهران باطنان ‏\"‏ فقلت يا جبريل ما هذه الأنهار قال أما النهران الباطنان فنهران في الجنة وأما الظاهران فالنيل والفرات ‏.‏ ثم رفع لي البيت المعمور فقلت يا جبريل ما هذا قال هذا البيت المعمور يدخله كل يوم سبعون ألف ملك إذا خرجوا منه لم يعودوا فيه آخر ما عليهم ‏.‏ ثم أتيت بإناءين أحدهما خمر والآخر لبن فعرضا على فاخترت اللبن فقيل أصبت أصاب الله بك أمتك على الفطرة ‏.‏ ثم فرضت على كل يوم خمسون صلاة ‏\"‏ ‏.‏ ثم ذكر قصتها إلى آخر الحديث ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 321
			}
		},
		{
			"hadithnumber": 417,
			"arabicnumber": "164.02",
			"text": "حدثني محمد بن المثنى، حدثنا معاذ بن هشام، قال حدثني أبي، عن قتادة، حدثنا أنس بن مالك، عن مالك بن صعصعة، أن رسول الله صلى الله عليه وسلم قال فذكر نحوه وزاد فيه ‏ \"‏ فأتيت بطست من ذهب ممتلئ حكمة وإيمانا فشق من النحر إلى مراق البطن فغسل بماء زمزم ثم ملئ حكمة وإيمانا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 322
			}
		},
		{
			"hadithnumber": 418,
			"arabicnumber": "165.01",
			"text": "حدثني محمد بن المثنى، وابن، بشار قال ابن المثنى حدثنا محمد بن جعفر، حدثنا شعبة، عن قتادة، قال سمعت أبا العالية، يقول حدثني ابن عم، نبيكم صلى الله عليه وسلم - يعني ابن عباس - قال ذكر رسول الله صلى الله عليه وسلم حين أسري به فقال ‏\"‏ موسى آدم طوال كأنه من رجال شنوءة ‏\"‏ ‏.‏ وقال ‏\"‏ عيسى جعد مربوع ‏\"‏ ‏.‏ وذكر مالكا خازن جهنم وذكر الدجال ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 323
			}
		},
		{
			"hadithnumber": 419,
			"arabicnumber": "165.02",
			"text": "وحدثنا عبد بن حميد، أخبرنا يونس بن محمد، حدثنا شيبان بن عبد الرحمن، عن قتادة، عن أبي العالية، حدثنا ابن عم، نبيكم صلى الله عليه وسلم ابن عباس قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ مررت ليلة أسري بي على موسى بن عمران - عليه السلام - رجل آدم طوال جعد كأنه من رجال شنوءة ورأيت عيسى ابن مريم مربوع الخلق إلى الحمرة والبياض سبط الرأس ‏\"‏ ‏.‏ وأري مالكا خازن النار والدجال ‏.‏ في آيات أراهن الله إياه فلا تكن في مرية من لقائه ‏.‏ قال كان قتادة يفسرها أن نبي الله صلى الله عليه وسلم قد لقي موسى عليه السلام ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 324
			}
		},
		{
			"hadithnumber": 420,
			"arabicnumber": "166.01",
			"text": "حدثنا أحمد بن حنبل، وسريج بن يونس، قالا حدثنا هشيم، أخبرنا داود بن أبي هند، عن أبي العالية، عن ابن عباس، أن رسول الله صلى الله عليه وسلم مر بوادي الأزرق فقال ‏\"‏ أى واد هذا ‏\"‏ ‏.‏ فقالوا هذا وادي الأزرق ‏.‏ قال ‏\"‏ كأني أنظر إلى موسى - عليه السلام - هابطا من الثنية وله جؤار إلى الله بالتلبية ‏\"‏ ‏.‏ ثم أتى على ثنية هرشى ‏.‏ فقال ‏\"‏ أى ثنية هذه ‏\"‏ ‏.‏ قالوا ثنية هرشى قال ‏\"‏ كأني أنظر إلى يونس بن متى - عليه السلام - على ناقة حمراء جعدة عليه جبة من صوف خطام ناقته خلبة وهو يلبي ‏\"‏ ‏.‏ قال ابن حنبل في حديثه قال هشيم يعني ليفا ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 325
			}
		},
		{
			"hadithnumber": 421,
			"arabicnumber": "166.02",
			"text": "وحدثني محمد بن المثنى، حدثنا ابن أبي عدي، عن داود، عن أبي العالية، عن ابن عباس، قال سرنا مع رسول الله صلى الله عليه وسلم بين مكة والمدينة فمررنا بواد فقال ‏\"‏ أى واد هذا ‏\"‏ ‏.‏ فقالوا وادي الأزرق ‏.‏ فقال ‏\"‏ كأني أنظر إلى موسى صلى الله عليه وسلم فذكر من لونه وشعره شيئا لم يحفظه داود واضعا إصبعيه في أذنيه له جؤار إلى الله بالتلبية مارا بهذا الوادي ‏\"‏ ‏.‏ قال ‏\"‏ ثم سرنا حتى أتينا على ثنية فقال ‏\"‏ أى ثنية هذه ‏\"‏ ‏.‏ قالوا هرشى أو لفت ‏.‏ فقال ‏\"‏ كأني أنظر إلى يونس على ناقة حمراء عليه جبة صوف خطام ناقته ليف خلبة مارا بهذا الوادي ملبيا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 326
			}
		},
		{
			"hadithnumber": 422,
			"arabicnumber": "166.03",
			"text": "حدثني محمد بن المثنى، حدثنا ابن أبي عدي، عن ابن عون، عن مجاهد، قال كنا عند ابن عباس فذكروا الدجال فقال إنه مكتوب بين عينيه كافر ‏.‏ قال فقال ابن عباس لم أسمعه ‏.‏ قال ذاك ولكنه قال ‏ \"‏ أما إبراهيم فانظروا إلى صاحبكم وأما موسى فرجل آدم جعد على جمل أحمر مخطوم بخلبة كأني أنظر إليه إذا انحدر في الوادي يلبي ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 327
			}
		},
		{
			"hadithnumber": 423,
			"arabicnumber": "167",
			"text": "حدثنا قتيبة بن سعيد، حدثنا ليث، ح وحدثنا محمد بن رمح، أخبرنا الليث، عن أبي الزبير، عن جابر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ عرض على الأنبياء فإذا موسى ضرب من الرجال كأنه من رجال شنوءة ورأيت عيسى ابن مريم - عليه السلام - فإذا أقرب من رأيت به شبها عروة بن مسعود ورأيت إبراهيم صلوات الله عليه فإذا أقرب من رأيت به شبها صاحبكم - يعني نفسه - ورأيت جبريل - عليه السلام - فإذا أقرب من رأيت به شبها دحية ‏\"‏ ‏.‏ وفي رواية ابن رمح ‏\"‏ دحية بن خليفة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 328
			}
		},
		{
			"hadithnumber": 424,
			"arabicnumber": "168",
			"text": "وحدثني محمد بن رافع، وعبد بن حميد، - وتقاربا في اللفظ - قال ابن رافع حدثنا وقال عبد، أخبرنا عبد الرزاق، أخبرنا معمر، عن الزهري، قال أخبرني سعيد بن المسيب، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ‏\"‏ حين أسري بي لقيت موسى - عليه السلام - ‏\"‏ ‏.‏ فنعته النبي صلى الله عليه وسلم ‏\"‏ فإذا رجل - حسبته قال - مضطرب رجل الرأس كأنه من رجال شنوءة - قال - ولقيت عيسى ‏\"‏ ‏.‏ فنعته النبي صلى الله عليه وسلم ‏\"‏ فإذا ربعة أحمر كأنما خرج من ديماس ‏\"‏ ‏.‏ - يعني حماما - قال ‏\"‏ ورأيت إبراهيم - صلوات الله عليه - وأنا أشبه ولده به - قال - فأتيت بإناءين في أحدهما لبن وفي الآخر خمر فقيل لي خذ أيهما شئت ‏.‏ فأخذت اللبن فشربته ‏.‏ فقال هديت الفطرة أو أصبت الفطرة أما إنك لو أخذت الخمر غوت أمتك ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 329
			}
		},
		{
			"hadithnumber": 425,
			"arabicnumber": "169.01",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن نافع، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ أراني ليلة عند الكعبة فرأيت رجلا آدم كأحسن ما أنت راء من أدم الرجال له لمة كأحسن ما أنت راء من اللمم قد رجلها فهي تقطر ماء متكئا على رجلين - أو على عواتق رجلين - يطوف بالبيت فسألت من هذا فقيل هذا المسيح ابن مريم ‏.‏ ثم إذا أنا برجل جعد قطط أعور العين اليمنى كأنها عنبة طافية فسألت من هذا فقيل هذا المسيح الدجال ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 330
			}
		},
		{
			"hadithnumber": 426,
			"arabicnumber": "169.02",
			"text": "حدثنا محمد بن إسحاق المسيبي، حدثنا أنس، - يعني ابن عياض - عن موسى، - وهو ابن عقبة - عن نافع، قال قال عبد الله بن عمر ذكر رسول الله صلى الله عليه وسلم يوما بين ظهرانى الناس المسيح الدجال فقال ‏\"‏ إن الله تبارك وتعالى ليس بأعور ألا إن المسيح الدجال أعور عين اليمنى كأن عينه عنبة طافية ‏\"‏ ‏.‏ قال وقال رسول الله صلى الله عليه وسلم ‏\"‏ أراني الليلة في المنام عند الكعبة فإذا رجل آدم كأحسن ما ترى من أدم الرجال تضرب لمته بين منكبيه رجل الشعر يقطر رأسه ماء ‏.‏ واضعا يديه على منكبى رجلين وهو بينهما يطوف بالبيت فقلت من هذا فقالوا المسيح ابن مريم ‏.‏ ورأيت وراءه رجلا جعدا قططا أعور عين اليمنى كأشبه من رأيت من الناس بابن قطن واضعا يديه على منكبى رجلين يطوف بالبيت فقلت من هذا قالوا هذا المسيح الدجال ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 331
			}
		},
		{
			"hadithnumber": 427,
			"arabicnumber": "169.03",
			"text": "حدثنا ابن نمير، حدثنا أبي، حدثنا حنظلة، عن سالم، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ رأيت عند الكعبة رجلا آدم سبط الرأس واضعا يديه على رجلين ‏.‏ يسكب رأسه - أو يقطر رأسه - فسألت من هذا فقالوا عيسى ابن مريم أو المسيح ابن مريم - لا ندري أى ذلك قال - ورأيت وراءه رجلا أحمر جعد الرأس أعور العين اليمنى أشبه من رأيت به ابن قطن فسألت من هذا فقالوا المسيح الدجال ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 332
			}
		},
		{
			"hadithnumber": 428,
			"arabicnumber": "170",
			"text": "حدثنا قتيبة بن سعيد، حدثنا ليث، عن عقيل، عن الزهري، عن أبي سلمة بن عبد الرحمن، عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لما كذبتني قريش قمت في الحجر فجلا الله لي بيت المقدس فطفقت أخبرهم عن آياته وأنا أنظر إليه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 333
			}
		},
		{
			"hadithnumber": 429,
			"arabicnumber": "171",
			"text": "حدثني حرملة بن يحيى، حدثنا ابن وهب، قال أخبرني يونس بن يزيد، عن ابن شهاب، عن سالم بن عبد الله بن عمر بن الخطاب، عن أبيه، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ بينما أنا نائم رأيتني أطوف بالكعبة فإذا رجل آدم سبط الشعر بين رجلين ينطف رأسه ماء - أو يهراق رأسه ماء - قلت من هذا قالوا هذا ابن مريم ‏.‏ ثم ذهبت ألتفت فإذا رجل أحمر جسيم جعد الرأس أعور العين كأن عينه عنبة طافية ‏.‏ قلت من هذا قالوا الدجال ‏.‏ أقرب الناس به شبها ابن قطن ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 334
			}
		},
		{
			"hadithnumber": 430,
			"arabicnumber": "172",
			"text": "وحدثني زهير بن حرب، حدثنا حجين بن المثنى، حدثنا عبد العزيز، - وهو ابن أبي سلمة - عن عبد الله بن الفضل، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لقد رأيتني في الحجر وقريش تسألني عن مسراى فسألتني عن أشياء من بيت المقدس لم أثبتها ‏.‏ فكربت كربة ما كربت مثله قط قال فرفعه الله لي أنظر إليه ما يسألوني عن شىء إلا أنبأتهم به وقد رأيتني في جماعة من الأنبياء فإذا موسى قائم يصلي فإذا رجل ضرب جعد كأنه من رجال شنوءة وإذا عيسى ابن مريم - عليه السلام - قائم يصلي أقرب الناس به شبها عروة بن مسعود الثقفي وإذا إبراهيم - عليه السلام - قائم يصلي أشبه الناس به صاحبكم - يعني نفسه - فحانت الصلاة فأممتهم فلما فرغت من الصلاة قال قائل يا محمد هذا مالك صاحب النار فسلم عليه ‏.‏ فالتفت إليه فبدأني بالسلام ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 335
			}
		},
		{
			"hadithnumber": 431,
			"arabicnumber": "173",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، حدثنا مالك بن مغول، ح وحدثنا ابن نمير، وزهير بن حرب، جميعا عن عبد الله بن نمير، - وألفاظهم متقاربة - قال ابن نمير حدثنا أبي، حدثنا مالك بن مغول، عن الزبير بن عدي، عن طلحة، عن مرة، عن عبد الله، قال لما أسري برسول الله صلى الله عليه وسلم انتهي به إلى سدرة المنتهى وهي في السماء السادسة إليها ينتهي ما يعرج به من الأرض فيقبض منها وإليها ينتهي ما يهبط به من فوقها فيقبض منها قال ‏{‏ إذ يغشى السدرة ما يغشى‏}‏ قال فراش من ذهب ‏.‏ قال فأعطي رسول الله صلى الله عليه وسلم ثلاثا أعطي الصلوات الخمس وأعطي خواتيم سورة البقرة وغفر لمن لم يشرك بالله من أمته شيئا المقحمات ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 336
			}
		},
		{
			"hadithnumber": 432,
			"arabicnumber": "174.01",
			"text": "وحدثني أبو الربيع الزهراني، حدثنا عباد، - وهو ابن العوام - حدثنا الشيباني، قال سألت زر بن حبيش عن قول الله، عز وجل ‏{‏ فكان قاب قوسين أو أدنى‏}‏ قال أخبرني ابن مسعود أن النبي صلى الله عليه وسلم رأى جبريل له ستمائة جناح ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 337
			}
		},
		{
			"hadithnumber": 433,
			"arabicnumber": "174.02",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، عن الشيباني، عن زر، عن عبد الله، قال ‏{‏ ما كذب الفؤاد ما رأى‏}‏ قال رأى جبريل - عليه السلام - له ستمائة جناح ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 338
			}
		},
		{
			"hadithnumber": 434,
			"arabicnumber": "174.03",
			"text": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن سليمان الشيباني، سمع زر بن حبيش، عن عبد الله، قال ‏{‏ لقد رأى من آيات ربه الكبرى‏}‏ قال رأى جبريل في صورته له ستمائة جناح ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 339
			}
		},
		{
			"hadithnumber": 435,
			"arabicnumber": "175",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن عبد الملك، عن عطاء، عن أبي هريرة، ‏{‏ ولقد رآه نزلة أخرى‏}‏ قال رأى جبريل ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 340
			}
		},
		{
			"hadithnumber": 436,
			"arabicnumber": "176.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا حفص، عن عبد الملك، عن عطاء، عن ابن عباس، قال رآه بقلبه ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 341
			}
		},
		{
			"hadithnumber": 437,
			"arabicnumber": "176.02",
			"text": "حدثنا أبو بكر بن أبي شيبة، وأبو سعيد الأشج جميعا عن وكيع، - قال الأشج حدثنا وكيع، - حدثنا الأعمش، عن زياد بن الحصين أبي جهمة، عن أبي العالية، عن ابن عباس، قال ‏{‏ ما كذب الفؤاد ما رأى‏}‏ ‏{‏ ولقد رآه نزلة أخرى‏}‏ قال رآه بفؤاده مرتين ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 342
			}
		},
		{
			"hadithnumber": 438,
			"arabicnumber": "176.03",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، عن الأعمش، حدثنا أبو جهمة، بهذا الإسناد ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 343
			}
		},
		{
			"hadithnumber": 439,
			"arabicnumber": "177.01",
			"text": "حدثني زهير بن حرب، حدثنا إسماعيل بن إبراهيم، عن داود، عن الشعبي، عن مسروق، قال كنت متكئا عند عائشة فقالت يا أبا عائشة ثلاث من تكلم بواحدة منهن فقد أعظم على الله الفرية ‏.‏ قلت ما هن قالت من زعم أن محمدا صلى الله عليه وسلم رأى ربه فقد أعظم على الله الفرية ‏.‏ قال وكنت متكئا فجلست فقلت يا أم المؤمنين أنظريني ولا تعجليني ألم يقل الله عز وجل ‏{‏ ولقد رآه بالأفق المبين‏}‏ ‏{‏ ولقد رآه نزلة أخرى‏}‏ ‏.‏ فقالت أنا أول هذه الأمة سأل عن ذلك رسول الله صلى الله عليه وسلم فقال ‏\"‏ إنما هو جبريل لم أره على صورته التي خلق عليها غير هاتين المرتين رأيته منهبطا من السماء سادا عظم خلقه ما بين السماء إلى الأرض ‏\"‏ ‏.‏ فقالت أولم تسمع أن الله يقول ‏{‏ لا تدركه الأبصار وهو يدرك الأبصار وهو اللطيف الخبير‏}‏ أولم تسمع أن الله يقول ‏{‏ وما كان لبشر أن يكلمه الله إلا وحيا أو من وراء حجاب أو يرسل رسولا فيوحي بإذنه ما يشاء إنه علي حكيم‏}‏ قالت ومن زعم أن رسول الله صلى الله عليه وسلم كتم شيئا من كتاب الله فقد أعظم على الله الفرية والله يقول ‏{‏ يا أيها الرسول بلغ ما أنزل إليك من ربك وإن لم تفعل فما بلغت رسالته‏}‏ ‏.‏ قالت ومن زعم أنه يخبر بما يكون في غد فقد أعظم على الله الفرية والله يقول ‏{‏ قل لا يعلم من في السموات والأرض الغيب إلا الله‏}‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 344
			}
		},
		{
			"hadithnumber": 440,
			"arabicnumber": "177.02",
			"text": "وحدثنا محمد بن المثنى، حدثنا عبد الوهاب، حدثنا داود، بهذا الإسناد نحو حديث ابن علية وزاد قالت ولو كان محمد صلى الله عليه وسلم كاتما شيئا مما أنزل عليه لكتم هذه الآية ‏{‏ وإذ تقول للذي أنعم الله عليه وأنعمت عليه أمسك عليك زوجك واتق الله وتخفي في نفسك ما الله مبديه وتخشى الناس والله أحق أن تخشاه‏}‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 345
			}
		},
		{
			"hadithnumber": 441,
			"arabicnumber": "177.03",
			"text": "حدثنا ابن نمير، حدثنا أبي، حدثنا إسماعيل، عن الشعبي، عن مسروق، قال سألت عائشة هل رأى محمد صلى الله عليه وسلم ربه فقالت سبحان الله لقد قف شعري لما قلت ‏.‏ وساق الحديث بقصته ‏.‏ وحديث داود أتم وأطول ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 346
			}
		},
		{
			"hadithnumber": 442,
			"arabicnumber": "177.04",
			"text": "وحدثنا ابن نمير، حدثنا أبو أسامة، حدثنا زكرياء، عن ابن أشوع، عن عامر، عن مسروق، قال قلت لعائشة فأين قوله ‏{‏ ثم دنا فتدلى * فكان قاب قوسين أو أدنى * فأوحى إلى عبده ما أوحى‏}‏ قالت إنما ذاك جبريل صلى الله عليه وسلم كان يأتيه في صورة الرجال وإنه أتاه في هذه المرة في صورته التي هي صورته فسد أفق السماء ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 347
			}
		},
		{
			"hadithnumber": 443,
			"arabicnumber": "178.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن يزيد بن إبراهيم، عن قتادة، عن عبد الله بن شقيق، عن أبي ذر، قال سألت رسول الله صلى الله عليه وسلم هل رأيت ربك قال ‏ \"‏ نور أنى أراه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 348
			}
		},
		{
			"hadithnumber": 444,
			"arabicnumber": "178.02",
			"text": "حدثنا محمد بن بشار، حدثنا معاذ بن هشام، حدثنا أبي ح، وحدثني حجاج بن الشاعر، حدثنا عفان بن مسلم، حدثنا همام، كلاهما عن قتادة، عن عبد الله بن شقيق، قال قلت لأبي ذر لو رأيت رسول الله صلى الله عليه وسلم لسألته فقال عن أى شىء كنت تسأله قال كنت أسأله هل رأيت ربك قال أبو ذر قد سألت فقال ‏ \"‏ رأيت نورا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 349
			}
		},
		{
			"hadithnumber": 445,
			"arabicnumber": "179.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، حدثنا الأعمش، عن عمرو بن مرة، عن أبي عبيدة، عن أبي موسى، قال قام فينا رسول الله صلى الله عليه وسلم بخمس كلمات فقال ‏ \"‏ إن الله عز وجل لا ينام ولا ينبغي له أن ينام يخفض القسط ويرفعه يرفع إليه عمل الليل قبل عمل النهار وعمل النهار قبل عمل الليل حجابه النور - وفي رواية أبي بكر النار - لو كشفه لأحرقت سبحات وجهه ما انتهى إليه بصره من خلقه ‏\"‏ ‏.‏ - وفي رواية أبي بكر عن الأعمش ولم يقل حدثنا ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 350
			}
		},
		{
			"hadithnumber": 446,
			"arabicnumber": "179.02",
			"text": "حدثنا إسحاق بن إبراهيم، أخبرنا جرير، عن الأعمش، بهذا الإسناد قال قام فينا رسول الله صلى الله عليه وسلم بأربع كلمات ‏.‏ ثم ذكر بمثل حديث أبي معاوية ولم يذكر ‏ \"‏ من خلقه ‏\"‏ ‏.‏ وقال حجابه النور ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 351
			}
		},
		{
			"hadithnumber": 447,
			"arabicnumber": "179.03",
			"text": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، قال حدثني شعبة، عن عمرو بن مرة، عن أبي عبيدة، عن أبي موسى، قال قام فينا رسول الله صلى الله عليه وسلم بأربع ‏ \"‏ إن الله لا ينام ولا ينبغي له أن ينام يرفع القسط ويخفضه ويرفع إليه عمل النهار بالليل وعمل الليل بالنهار ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 352
			}
		},
		{
			"hadithnumber": 448,
			"arabicnumber": "180",
			"text": "حدثنا نصر بن علي الجهضمي، وأبو غسان المسمعي وإسحاق بن إبراهيم جميعا عن عبد العزيز بن عبد الصمد، - واللفظ لأبي غسان قال حدثنا أبو عبد الصمد، - حدثنا أبو عمران الجوني، عن أبي بكر بن عبد الله بن قيس، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏ \"‏ جنتان من فضة آنيتهما وما فيهما وجنتان من ذهب آنيتهما وما فيهما وما بين القوم وبين أن ينظروا إلى ربهم إلا رداء الكبرياء على وجهه في جنة عدن ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 353
			}
		},
		{
			"hadithnumber": 449,
			"arabicnumber": "181.01",
			"text": "حدثنا عبيد الله بن عمر بن ميسرة، قال حدثني عبد الرحمن بن مهدي، حدثنا حماد بن سلمة، عن ثابت البناني، عن عبد الرحمن بن أبي ليلى، عن صهيب، عن النبي صلى الله عليه وسلم قال ‏ \"‏ إذا دخل أهل الجنة الجنة - قال - يقول الله تبارك وتعالى تريدون شيئا أزيدكم فيقولون ألم تبيض وجوهنا ألم تدخلنا الجنة وتنجنا من النار - قال - فيكشف الحجاب فما أعطوا شيئا أحب إليهم من النظر إلى ربهم عز وجل ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 354
			}
		},
		{
			"hadithnumber": 450,
			"arabicnumber": "181.02",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، عن حماد بن سلمة، بهذا الإسناد وزاد ثم تلا هذه الآية ‏{‏ للذين أحسنوا الحسنى وزيادة‏}‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 355
			}
		},
		{
			"hadithnumber": 451,
			"arabicnumber": "182.01",
			"text": "حدثني زهير بن حرب، حدثنا يعقوب بن إبراهيم، حدثنا أبي، عن ابن شهاب، عن عطاء بن يزيد الليثي، أن أبا هريرة، أخبره أن ناسا قالوا لرسول الله صلى الله عليه وسلم يا رسول الله هل نرى ربنا يوم القيامة فقال رسول الله صلى الله عليه وسلم ‏\"‏ هل تضارون في رؤية القمر ليلة البدر ‏\"‏ ‏.‏ قالوا لا يا رسول الله ‏.‏ قال ‏\"‏ هل تضارون في الشمس ليس دونها سحاب ‏\"‏ ‏.‏ قالوا لا يا رسول الله ‏.‏ قال ‏\"‏ فإنكم ترونه كذلك يجمع الله الناس يوم القيامة فيقول من كان يعبد شيئا فليتبعه ‏.‏ فيتبع من كان يعبد الشمس الشمس ويتبع من كان يعبد القمر القمر ويتبع من كان يعبد الطواغيت الطواغيت وتبقى هذه الأمة فيها منافقوها فيأتيهم الله - تبارك وتعالى - في صورة غير صورته التي يعرفون فيقول أنا ربكم ‏.‏ فيقولون نعوذ بالله منك هذا مكاننا حتى يأتينا ربنا فإذا جاء ربنا عرفناه ‏.‏ فيأتيهم الله تعالى في صورته التي يعرفون فيقول أنا ربكم ‏.‏ فيقولون أنت ربنا ‏.‏ فيتبعونه ويضرب الصراط بين ظهرى جهنم فأكون أنا وأمتي أول من يجيز ولا يتكلم يومئذ إلا الرسل ودعوى الرسل يومئذ اللهم سلم سلم ‏.‏ وفي جهنم كلاليب مثل شوك السعدان هل رأيتم السعدان ‏\"‏ ‏.‏ قالوا نعم يا رسول الله ‏.‏ قال ‏\"‏ فإنها مثل شوك السعدان غير أنه لا يعلم ما قدر عظمها إلا الله تخطف الناس بأعمالهم فمنهم المؤمن بقي بعمله ومنهم المجازى حتى ينجى حتى إذا فرغ الله من القضاء بين العباد وأراد أن يخرج برحمته من أراد من أهل النار أمر الملائكة أن يخرجوا من النار من كان لا يشرك بالله شيئا ممن أراد الله تعالى أن يرحمه ممن يقول لا إله إلا الله ‏.‏ فيعرفونهم في النار يعرفونهم بأثر السجود تأكل النار من ابن آدم إلا أثر السجود حرم الله على النار أن تأكل أثر السجود ‏.‏ فيخرجون من النار وقد امتحشوا فيصب عليهم ماء الحياة فينبتون منه كما تنبت الحبة في حميل السيل ثم يفرغ الله تعالى من القضاء بين العباد ويبقى رجل مقبل بوجهه على النار وهو آخر أهل الجنة دخولا الجنة فيقول أى رب اصرف وجهي عن النار فإنه قد قشبني ريحها وأحرقني ذكاؤها فيدعو الله ما شاء الله أن يدعوه ثم يقول الله تبارك وتعالى هل عسيت إن فعلت ذلك بك أن تسأل غيره ‏.‏ فيقول لا أسألك غيره ‏.‏ ويعطي ربه من عهود ومواثيق ما شاء الله فيصرف الله وجهه عن النار فإذا أقبل على الجنة ورآها سكت ما شاء الله أن يسكت ثم يقول أى رب قدمني إلى باب الجنة ‏.‏ فيقول الله له أليس قد أعطيت عهودك ومواثيقك لا تسألني غير الذي أعطيتك ويلك يا ابن آدم ما أغدرك ‏.‏ فيقول أى رب ويدعو الله حتى يقول له فهل عسيت إن أعطيتك ذلك أن تسأل غيره ‏.‏ فيقول لا وعزتك ‏.‏ فيعطي ربه ما شاء الله من عهود ومواثيق فيقدمه إلى باب الجنة فإذا قام على باب الجنة انفهقت له الجنة فرأى ما فيها من الخير والسرور فيسكت ما شاء الله أن يسكت ثم يقول أى رب أدخلني الجنة ‏.‏ فيقول الله تبارك وتعالى له أليس قد أعطيت عهودك ومواثيقك أن لا تسأل غير ما أعطيت ويلك يا ابن آدم ما أغدرك ‏.‏ فيقول أى رب لا أكون أشقى خلقك ‏.‏ فلا يزال يدعو الله حتى يضحك الله تبارك وتعالى منه فإذا ضحك الله منه قال ادخل الجنة ‏.‏ فإذا دخلها قال الله له تمنه ‏.‏ فيسأل ربه ويتمنى حتى إن الله ليذكره من كذا وكذا حتى إذا انقطعت به الأماني قال الله تعالى ذلك لك ومثله معه ‏\"‏ ‏.‏ قال عطاء بن يزيد وأبو سعيد الخدري مع أبي هريرة لا يرد عليه من حديثه شيئا ‏.‏ حتى إذا حدث أبو هريرة أن الله قال لذلك الرجل ومثله معه ‏.‏ قال أبو سعيد وعشرة أمثاله معه يا أبا هريرة ‏.‏ قال أبو هريرة ما حفظت إلا قوله ذلك لك ومثله معه ‏.‏ قال أبو سعيد أشهد أني حفظت من رسول الله صلى الله عليه وسلم قوله ذلك لك وعشرة أمثاله ‏.‏ قال أبو هريرة وذلك الرجل آخر أهل الجنة دخولا الجنة ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 356
			}
		},
		{
			"hadithnumber": 452,
			"arabicnumber": "182.02",
			"text": "حدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال أخبرني سعيد بن المسيب، وعطاء بن يزيد الليثي، أن أبا هريرة، أخبرهما أن الناس قالوا للنبي صلى الله عليه وسلم يا رسول الله هل نرى ربنا يوم القيامة وساق الحديث بمثل معنى حديث إبراهيم بن سعد ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 357
			}
		},
		{
			"hadithnumber": 453,
			"arabicnumber": "182.03",
			"text": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم ‏.‏ فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏ \"‏ إن أدنى مقعد أحدكم من الجنة أن يقول له تمن ‏.‏ فيتمنى ويتمنى فيقول له هل تمنيت فيقول نعم ‏.‏ فيقول له فإن لك ما تمنيت ومثله معه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 358
			}
		},
		{
			"hadithnumber": 454,
			"arabicnumber": "183.01",
			"text": "وحدثني سويد بن سعيد، قال حدثني حفص بن ميسرة، عن زيد بن أسلم، عن عطاء بن يسار، عن أبي سعيد الخدري، أن ناسا، في زمن رسول الله صلى الله عليه وسلم قالوا يا رسول الله هل نرى ربنا يوم القيامة قال رسول الله صلى الله عليه وسلم ‏\"‏ نعم ‏\"‏ ‏.‏ قال ‏\"‏ هل تضارون في رؤية الشمس بالظهيرة صحوا ليس معها سحاب وهل تضارون في رؤية القمر ليلة البدر صحوا ليس فيها سحاب ‏\"‏ ‏.‏ قالوا لا يا رسول الله ‏.‏ قال ‏\"‏ ما تضارون في رؤية الله تبارك وتعالى يوم القيامة إلا كما تضارون في رؤية أحدهما إذا كان يوم القيامة أذن مؤذن ليتبع كل أمة ما كانت تعبد ‏.‏ فلا يبقى أحد كان يعبد غير الله سبحانه من الأصنام والأنصاب إلا يتساقطون في النار حتى إذا لم يبق إلا من كان يعبد الله من بر وفاجر وغبر أهل الكتاب فيدعى اليهود فيقال لهم ما كنتم تعبدون قالوا كنا نعبد عزير ابن الله ‏.‏ فيقال كذبتم ما اتخذ الله من صاحبة ولا ولد فماذا تبغون قالوا عطشنا يا ربنا فاسقنا ‏.‏ فيشار إليهم ألا تردون فيحشرون إلى النار كأنها سراب يحطم بعضها بعضا فيتساقطون في النار ‏.‏ ثم يدعى النصارى فيقال لهم ما كنتم تعبدون قالوا كنا نعبد المسيح ابن الله ‏.‏ فيقال لهم كذبتم ‏.‏ ما اتخذ الله من صاحبة ولا ولد ‏.‏ فيقال لهم ماذا تبغون فيقولون عطشنا يا ربنا فاسقنا ‏.‏ - قال - فيشار إليهم ألا تردون فيحشرون إلى جهنم كأنها سراب يحطم بعضها بعضا فيتساقطون في النار حتى إذا لم يبق إلا من كان يعبد الله تعالى من بر وفاجر أتاهم رب العالمين سبحانه وتعالى في أدنى صورة من التي رأوه فيها ‏.‏ قال فما تنتظرون تتبع كل أمة ما كانت تعبد ‏.‏ قالوا يا ربنا فارقنا الناس في الدنيا أفقر ما كنا إليهم ولم نصاحبهم ‏.‏ فيقول أنا ربكم ‏.‏ فيقولون نعوذ بالله منك لا نشرك بالله شيئا - مرتين أو ثلاثا - حتى إن بعضهم ليكاد أن ينقلب ‏.‏ فيقول هل بينكم وبينه آية فتعرفونه بها فيقولون نعم ‏.‏ فيكشف عن ساق فلا يبقى من كان يسجد لله من تلقاء نفسه إلا أذن الله له بالسجود ولا يبقى من كان يسجد اتقاء ورياء إلا جعل الله ظهره طبقة واحدة كلما أراد أن يسجد خر على قفاه ‏.‏ ثم يرفعون رءوسهم وقد تحول في صورته التي رأوه فيها أول مرة فقال أنا ربكم ‏.‏ فيقولون أنت ربنا ‏.‏ ثم يضرب الجسر على جهنم وتحل الشفاعة ويقولون اللهم سلم سلم ‏\"‏ ‏.‏ قيل يا رسول الله وما الجسر قال ‏\"‏ دحض مزلة ‏.‏ فيه خطاطيف وكلاليب وحسك تكون بنجد فيها شويكة يقال لها السعدان فيمر المؤمنون كطرف العين وكالبرق وكالريح وكالطير وكأجاويد الخيل والركاب فناج مسلم ومخدوش مرسل ومكدوس في نار جهنم ‏.‏ حتى إذا خلص المؤمنون من النار فوالذي نفسي بيده ما منكم من أحد بأشد مناشدة لله في استقصاء الحق من المؤمنين لله يوم القيامة لإخوانهم الذين في النار يقولون ربنا كانوا يصومون معنا ويصلون ويحجون ‏.‏ فيقال لهم أخرجوا من عرفتم ‏.‏ فتحرم صورهم على النار فيخرجون خلقا كثيرا قد أخذت النار إلى نصف ساقيه وإلى ركبتيه ثم يقولون ربنا ما بقي فيها أحد ممن أمرتنا به ‏.‏ فيقول ارجعوا فمن وجدتم في قلبه مثقال دينار من خير فأخرجوه ‏.‏ فيخرجون خلقا كثيرا ثم يقولون ربنا لم نذر فيها أحدا ممن أمرتنا ‏.‏ ثم يقول ارجعوا فمن وجدتم في قلبه مثقال نصف دينار من خير فأخرجوه ‏.‏ فيخرجون خلقا كثيرا ثم يقولون ربنا لم نذر فيها ممن أمرتنا أحدا ‏.‏ ثم يقول ارجعوا فمن وجدتم في قلبه مثقال ذرة من خير فأخرجوه ‏.‏ فيخرجون خلقا كثيرا ثم يقولون ربنا لم نذر فيها خيرا ‏\"‏ ‏.‏ وكان أبو سعيد الخدري يقول إن لم تصدقوني بهذا الحديث فاقرءوا إن شئتم ‏{‏ إن الله لا يظلم مثقال ذرة وإن تك حسنة يضاعفها ويؤت من لدنه أجرا عظيما‏}‏ ‏\"‏ فيقول الله عز وجل شفعت الملائكة وشفع النبيون وشفع المؤمنون ولم يبق إلا أرحم الراحمين فيقبض قبضة من النار فيخرج منها قوما لم يعملوا خيرا قط قد عادوا حمما فيلقيهم في نهر في أفواه الجنة يقال له نهر الحياة فيخرجون كما تخرج الحبة في حميل السيل ألا ترونها تكون إلى الحجر أو إلى الشجر ما يكون إلى الشمس أصيفر وأخيضر وما يكون منها إلى الظل يكون أبيض ‏\"‏ ‏.‏ فقالوا يا رسول الله كأنك كنت ترعى بالبادية قال ‏\"‏ فيخرجون كاللؤلؤ في رقابهم الخواتم يعرفهم أهل الجنة هؤلاء عتقاء الله الذين أدخلهم الله الجنة بغير عمل عملوه ولا خير قدموه ثم يقول ادخلوا الجنة فما رأيتموه فهو لكم ‏.‏ فيقولون ربنا أعطيتنا ما لم تعط أحدا من العالمين ‏.‏ فيقول لكم عندي أفضل من هذا فيقولون يا ربنا أى شىء أفضل من هذا ‏.‏ فيقول رضاى فلا أسخط عليكم بعده أبدا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 359
			}
		},
		{
			"hadithnumber": 455,
			"arabicnumber": "183.02",
			"text": "قال مسلم قرأت على عيسى بن حماد زغبة المصري هذا الحديث في الشفاعة وقلت له أحدث بهذا الحديث عنك أنك سمعت من الليث بن سعد فقال نعم ‏.‏ قلت لعيسى بن حماد أخبركم الليث بن سعد عن خالد بن يزيد عن سعيد بن أبي هلال عن زيد بن أسلم عن عطاء بن يسار عن أبي سعيد الخدري أنه قال قلنا يا رسول الله أنرى ربنا قال رسول الله صلى الله عليه وسلم ‏\"‏ هل تضارون في رؤية الشمس إذا كان يوم صحو ‏\"‏ ‏.‏ قلنا لا ‏.‏ وسقت الحديث حتى انقضى آخره وهو نحو حديث حفص بن ميسرة ‏.‏ وزاد بعد قوله بغير عمل عملوه ولا قدم قدموه ‏\"‏ فيقال لهم لكم ما رأيتم ومثله معه ‏\"‏ ‏.‏ قال أبو سعيد بلغني أن الجسر أدق من الشعرة وأحد من السيف ‏.‏ وليس في حديث الليث ‏\"‏ فيقولون ربنا أعطيتنا ما لم تعط أحدا من العالمين ‏\"‏ وما بعده فأقر به عيسى بن حماد ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 360
			}
		},
		{
			"hadithnumber": 456,
			"arabicnumber": "183.03",
			"text": "وحدثناه أبو بكر بن أبي شيبة، حدثنا جعفر بن عون، حدثنا هشام بن سعد، حدثنا زيد بن أسلم، بإسنادهما نحو حديث حفص بن ميسرة إلى آخره وقد زاد ونقص شيئا ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 361
			}
		},
		{
			"hadithnumber": 457,
			"arabicnumber": "184.01",
			"text": "وحدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، قال أخبرني مالك بن أنس، عن عمرو بن يحيى بن عمارة، قال حدثني أبي، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ يدخل الله أهل الجنة الجنة يدخل من يشاء برحمته ويدخل أهل النار النار ثم يقول انظروا من وجدتم في قلبه مثقال حبة من خردل من إيمان فأخرجوه ‏.‏ فيخرجون منها حمما قد امتحشوا ‏.‏ فيلقون في نهر الحياة أو الحيا فينبتون فيه كما تنبت الحبة إلى جانب السيل ألم تروها كيف تخرج صفراء ملتوية ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 362
			}
		},
		{
			"hadithnumber": 458,
			"arabicnumber": "184.02",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا عفان، حدثنا وهيب، ح وحدثنا حجاج بن الشاعر، حدثنا عمرو بن عون، أخبرنا خالد، كلاهما عن عمرو بن يحيى، بهذا الإسناد وقالا فيلقون في نهر يقال له الحياة ‏.‏ ولم يشكا ‏.‏ وفي حديث خالد كما تنبت الغثاءة في جانب السيل ‏.‏ وفي حديث وهيب كما تنبت الحبة في حمئة أو حميلة السيل ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 363
			}
		},
		{
			"hadithnumber": 459,
			"arabicnumber": "185.01",
			"text": "وحدثني نصر بن علي الجهضمي، حدثنا بشر، - يعني ابن المفضل - عن أبي مسلمة، عن أبي نضرة، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ أما أهل النار الذين هم أهلها فإنهم لا يموتون فيها ولا يحيون ولكن ناس أصابتهم النار بذنوبهم - أو قال بخطاياهم - فأماتهم إماتة حتى إذا كانوا فحما أذن بالشفاعة فجيء بهم ضبائر ضبائر فبثوا على أنهار الجنة ثم قيل يا أهل الجنة أفيضوا عليهم ‏.‏ فينبتون نبات الحبة تكون في حميل السيل ‏\"‏ ‏.‏ فقال رجل من القوم كأن رسول الله صلى الله عليه وسلم قد كان بالبادية ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 364
			}
		},
		{
			"hadithnumber": 460,
			"arabicnumber": "185.02",
			"text": "وحدثناه محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن أبي مسلمة، قال سمعت أبا نضرة، عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم بمثله إلى قوله ‏ \"‏ في حميل السيل ‏\"‏ ‏.‏ ولم يذكر ما بعده ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 365
			}
		},
		{
			"hadithnumber": 461,
			"arabicnumber": "186.01",
			"text": "حدثنا عثمان بن أبي شيبة، وإسحاق بن إبراهيم الحنظلي، كلاهما عن جرير، قال عثمان حدثنا جرير، عن منصور، عن إبراهيم، عن عبيدة، عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إني لأعلم آخر أهل النار خروجا منها وآخر أهل الجنة دخولا الجنة رجل يخرج من النار حبوا فيقول الله تبارك وتعالى له اذهب فادخل الجنة فيأتيها فيخيل إليه أنها ملأى فيرجع فيقول يا رب وجدتها ملأى ‏.‏ فيقول الله تبارك وتعالى له اذهب فادخل الجنة - قال - فيأتيها فيخيل إليه أنها ملأى فيرجع فيقول يا رب وجدتها ملأى فيقول الله له اذهب فادخل الجنة فإن لك مثل الدنيا وعشرة أمثالها أو إن لك عشرة أمثال الدنيا - قال - فيقول أتسخر بي - أو أتضحك بي - وأنت الملك ‏\"‏ قال لقد رأيت رسول الله صلى الله عليه وسلم ضحك حتى بدت نواجذه ‏.‏ قال فكان يقال ذاك أدنى أهل الجنة منزلة ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 366
			}
		},
		{
			"hadithnumber": 462,
			"arabicnumber": "186.02",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب - واللفظ لأبي كريب - قالا حدثنا أبو معاوية، عن الأعمش، عن إبراهيم، عن عبيدة، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إني لأعرف آخر أهل النار خروجا من النار رجل يخرج منها زحفا فيقال له انطلق فادخل الجنة - قال - فيذهب فيدخل الجنة فيجد الناس قد أخذوا المنازل فيقال له أتذكر الزمان الذي كنت فيه فيقول نعم ‏.‏ فيقال له تمن ‏.‏ فيتمنى فيقال له لك الذي تمنيت وعشرة أضعاف الدنيا - قال - فيقول أتسخر بي وأنت الملك ‏\"‏ قال فلقد رأيت رسول الله صلى الله عليه وسلم ضحك حتى بدت نواجذه ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 367
			}
		},
		{
			"hadithnumber": 463,
			"arabicnumber": "187",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا عفان بن مسلم، حدثنا حماد بن سلمة، حدثنا ثابت، عن أنس، عن ابن مسعود، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ آخر من يدخل الجنة رجل فهو يمشي مرة ويكبو مرة وتسفعه النار مرة فإذا ما جاوزها التفت إليها فقال تبارك الذي نجاني منك لقد أعطاني الله شيئا ما أعطاه أحدا من الأولين والآخرين ‏.‏ فترفع له شجرة فيقول أى رب أدنني من هذه الشجرة فلأستظل بظلها وأشرب من مائها ‏.‏ فيقول الله عز وجل يا ابن آدم لعلي إن أعطيتكها سألتني غيرها ‏.‏ فيقول لا يا رب ‏.‏ ويعاهده أن لا يسأله غيرها وربه يعذره لأنه يرى ما لا صبر له عليه فيدنيه منها فيستظل بظلها ويشرب من مائها ثم ترفع له شجرة هي أحسن من الأولى فيقول أى رب أدنني من هذه لأشرب من مائها وأستظل بظلها لا أسألك غيرها ‏.‏ فيقول يا ابن آدم ألم تعاهدني أن لا تسألني غيرها فيقول لعلي إن أدنيتك منها تسألني غيرها ‏.‏ فيعاهده أن لا يسأله غيرها وربه يعذره لأنه يرى ما لا صبر له عليه فيدنيه منها فيستظل بظلها ويشرب من مائها ‏.‏ ثم ترفع له شجرة عند باب الجنة هي أحسن من الأوليين ‏.‏ فيقول أى رب أدنني من هذه لأستظل بظلها وأشرب من مائها لا أسألك غيرها ‏.‏ فيقول يا ابن آدم ألم تعاهدني أن لا تسألني غيرها قال بلى يا رب هذه لا أسألك غيرها ‏.‏ وربه يعذره لأنه يرى ما لا صبر له عليها فيدنيه منها فإذا أدناه منها فيسمع أصوات أهل الجنة فيقول أى رب أدخلنيها ‏.‏ فيقول يا ابن آدم ما يصريني منك أيرضيك أن أعطيك الدنيا ومثلها معها قال يا رب أتستهزئ مني وأنت رب العالمين ‏\"‏ ‏.‏ فضحك ابن مسعود فقال ألا تسألوني مم أضحك فقالوا مم تضحك قال هكذا ضحك رسول الله صلى الله عليه وسلم ‏.‏ فقالوا مم تضحك يا رسول الله قال ‏\"‏ من ضحك رب العالمين حين قال أتستهزئ مني وأنت رب العالمين فيقول إني لا أستهزئ منك ولكني على ما أشاء قادر ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 368
			}
		},
		{
			"hadithnumber": 464,
			"arabicnumber": "188",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن أبي بكير، حدثنا زهير بن محمد، عن سهيل بن أبي صالح، عن النعمان بن أبي عياش، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن أدنى أهل الجنة منزلة رجل صرف الله وجهه عن النار قبل الجنة ومثل له شجرة ذات ظل فقال أى رب قدمني إلى هذه الشجرة أكون في ظلها ‏\"‏ ‏.‏ وساق الحديث بنحو حديث ابن مسعود ولم يذكر ‏\"‏ فيقول يا ابن آدم ما يصريني منك ‏\"‏ ‏.‏ إلى آخر الحديث وزاد فيه ‏\"‏ ويذكره الله سل كذا وكذا فإذا انقطعت به الأماني قال الله هو لك وعشرة أمثاله - قال - ثم يدخل بيته فتدخل عليه زوجتاه من الحور العين فتقولان الحمد لله الذي أحياك لنا وأحيانا لك - قال - فيقول ما أعطي أحد مثل ما أعطيت ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 369
			}
		},
		{
			"hadithnumber": 465,
			"arabicnumber": "189.01",
			"text": "حدثنا سعيد بن عمرو الأشعثي، حدثنا سفيان بن عيينة، عن مطرف، وابن، أبجر عن الشعبي، قال سمعت المغيرة بن شعبة، رواية إن شاء الله ح وحدثنا ابن أبي عمر، حدثنا سفيان، حدثنا مطرف بن طريف، وعبد الملك بن سعيد، سمعا الشعبي، يخبر عن المغيرة بن شعبة، قال سمعته على المنبر، يرفعه إلى رسول الله صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 370
			}
		},
		{
			"hadithnumber": 466,
			"arabicnumber": "189.02",
			"text": "قال وحدثني بشر بن الحكم، - واللفظ له - حدثنا سفيان بن عيينة، حدثنا مطرف، وابن، أبجر سمعا الشعبي، يقول سمعت المغيرة بن شعبة، يخبر به الناس على المنبر قال سفيان رفعه أحدهما - أراه ابن أبجر - قال ‏\"‏ سأل موسى ربه ما أدنى أهل الجنة منزلة قال هو رجل يجيء بعد ما أدخل أهل الجنة الجنة فيقال له ادخل الجنة ‏.‏ فيقول أى رب كيف وقد نزل الناس منازلهم وأخذوا أخذاتهم فيقال له أترضى أن يكون لك مثل ملك ملك من ملوك الدنيا فيقول رضيت رب ‏.‏ فيقول لك ذلك ومثله ومثله ومثله ومثله ‏.‏ فقال في الخامسة رضيت رب ‏.‏ فيقول هذا لك وعشرة أمثاله ولك ما اشتهت نفسك ولذت عينك ‏.‏ فيقول رضيت رب ‏.‏ قال رب فأعلاهم منزلة قال أولئك الذين أردت غرست كرامتهم بيدي وختمت عليها فلم تر عين ولم تسمع أذن ولم يخطر على قلب بشر ‏\"‏ ‏.‏ قال ومصداقه في كتاب الله عز وجل ‏{‏ فلا تعلم نفس ما أخفي لهم من قرة أعين‏}‏ الآية ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 371
			}
		},
		{
			"hadithnumber": 467,
			"arabicnumber": "190.01",
			"text": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا الأعمش، عن المعرور بن سويد، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إني لأعلم آخر أهل الجنة دخولا الجنة وآخر أهل النار خروجا منها رجل يؤتى به يوم القيامة فيقال اعرضوا عليه صغار ذنوبه وارفعوا عنه كبارها ‏.‏ فتعرض عليه صغار ذنوبه فيقال عملت يوم كذا وكذا كذا وكذا وعملت يوم كذا وكذا كذا وكذا ‏.‏ فيقول نعم ‏.‏ لا يستطيع أن ينكر وهو مشفق من كبار ذنوبه أن تعرض عليه ‏.‏ فيقال له فإن لك مكان كل سيئة حسنة ‏.‏ فيقول رب قد عملت أشياء لا أراها ها هنا ‏\"‏ ‏.‏ فلقد رأيت رسول الله صلى الله عليه وسلم ضحك حتى بدت نواجذه ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 373
			}
		},
		{
			"hadithnumber": 468,
			"arabicnumber": "190.02",
			"text": "وحدثنا ابن نمير، حدثنا أبو معاوية، ووكيع، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، ح وحدثنا أبو كريب، حدثنا أبو معاوية، كلاهما عن الأعمش، بهذا الإسناد ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 374
			}
		},
		{
			"hadithnumber": 469,
			"arabicnumber": "191.01",
			"text": "حدثني عبيد الله بن سعيد، وإسحاق بن منصور، كلاهما عن روح، قال عبيد الله حدثنا روح بن عبادة القيسي، حدثنا ابن جريج، قال أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يسأل عن الورود، فقال نجيء نحن يوم القيامة عن كذا، وكذا، انظر أى ذلك فوق الناس - قال - فتدعى الأمم بأوثانها وما كانت تعبد الأول فالأول ثم يأتينا ربنا بعد ذلك فيقول من تنظرون فيقولون ننظر ربنا ‏.‏ فيقول أنا ربكم ‏.‏ فيقولون حتى ننظر إليك ‏.‏ فيتجلى لهم يضحك - قال - فينطلق بهم ويتبعونه ويعطى كل إنسان منهم - منافق أو مؤمن - نورا ثم يتبعونه وعلى جسر جهنم كلاليب وحسك تأخذ من شاء الله ثم يطفأ نور المنافقين ثم ينجو المؤمنون فتنجو أول زمرة وجوههم كالقمر ليلة البدر سبعون ألفا لا يحاسبون ثم الذين يلونهم كأضوإ نجم في السماء ثم كذلك ثم تحل الشفاعة ويشفعون حتى يخرج من النار من قال لا إله إلا الله وكان في قلبه من الخير ما يزن شعيرة فيجعلون بفناء الجنة ويجعل أهل الجنة يرشون عليهم الماء حتى ينبتوا نبات الشىء في السيل ويذهب حراقه ثم يسأل حتى تجعل له الدنيا وعشرة أمثالها معها ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 375
			}
		},
		{
			"hadithnumber": 470,
			"arabicnumber": "191.02",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا سفيان بن عيينة، عن عمرو، سمع جابرا، يقول سمعه من النبي، صلى الله عليه وسلم بأذنه يقول ‏ \"‏ إن الله يخرج ناسا من النار فيدخلهم الجنة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 376
			}
		},
		{
			"hadithnumber": 471,
			"arabicnumber": "191.03",
			"text": "حدثنا أبو الربيع، حدثنا حماد بن زيد، قال قلت لعمرو بن دينار أسمعت جابر بن عبد الله يحدث عن رسول الله صلى الله عليه وسلم ‏ \"‏ إن الله يخرج قوما من النار بالشفاعة ‏\"‏ ‏.‏ قال نعم ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 377
			}
		},
		{
			"hadithnumber": 472,
			"arabicnumber": "191.04",
			"text": "حدثنا حجاج بن الشاعر، حدثنا أبو أحمد الزبيري، حدثنا قيس بن سليم العنبري، قال حدثني يزيد الفقير، حدثنا جابر بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن قوما يخرجون من النار يحترقون فيها إلا دارات وجوههم حتى يدخلون الجنة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 378
			}
		},
		{
			"hadithnumber": 473,
			"arabicnumber": "191.05",
			"text": "وحدثنا حجاج بن الشاعر، حدثنا الفضل بن دكين، حدثنا أبو عاصم، - يعني محمد بن أبي أيوب - قال حدثني يزيد الفقير، قال كنت قد شغفني رأى من رأى الخوارج فخرجنا في عصابة ذوي عدد نريد أن نحج ثم نخرج على الناس - قال - فمررنا على المدينة فإذا جابر بن عبد الله يحدث القوم - جالس إلى سارية - عن رسول الله صلى الله عليه وسلم قال فإذا هو قد ذكر الجهنميين - قال - فقلت له يا صاحب رسول الله ما هذا الذي تحدثون والله يقول ‏{‏ إنك من تدخل النار فقد أخزيته‏}‏ و ‏{‏ كلما أرادوا أن يخرجوا منها أعيدوا فيها‏}‏ فما هذا الذي تقولون قال فقال أتقرأ القرآن قلت نعم ‏.‏ قال فهل سمعت بمقام محمد - عليه السلام - يعني الذي يبعثه الله فيه قلت نعم ‏.‏ قال فإنه مقام محمد صلى الله عليه وسلم المحمود الذي يخرج الله به من يخرج ‏.‏ - قال - ثم نعت وضع الصراط ومر الناس عليه - قال - وأخاف أن لا أكون أحفظ ذاك - قال - غير أنه قد زعم أن قوما يخرجون من النار بعد أن يكونوا فيها - قال - يعني فيخرجون كأنهم عيدان السماسم ‏.‏ قال فيدخلون نهرا من أنهار الجنة فيغتسلون فيه فيخرجون كأنهم القراطيس ‏.‏ فرجعنا قلنا ويحكم أترون الشيخ يكذب على رسول الله صلى الله عليه وسلم فرجعنا فلا والله ما خرج منا غير رجل واحد أو كما قال أبو نعيم ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 379
			}
		},
		{
			"hadithnumber": 474,
			"arabicnumber": "192",
			"text": "حدثنا هداب بن خالد الأزدي، حدثنا حماد بن سلمة، عن أبي عمران، وثابت، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ يخرج من النار أربعة فيعرضون على الله فيلتفت أحدهم فيقول أى رب إذ أخرجتني منها فلا تعدني فيها ‏.‏ فينجيه الله منها ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 380
			}
		},
		{
			"hadithnumber": 475,
			"arabicnumber": "193.01",
			"text": "حدثنا أبو كامل، فضيل بن حسين الجحدري ومحمد بن عبيد الغبري - واللفظ لأبي كامل - قالا حدثنا أبو عوانة، عن قتادة، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يجمع الله الناس يوم القيامة فيهتمون لذلك - وقال ابن عبيد فيلهمون لذلك - فيقولون لو استشفعنا على ربنا حتى يريحنا من مكاننا هذا - قال - فيأتون آدم صلى الله عليه وسلم فيقولون أنت آدم أبو الخلق خلقك الله بيده ونفخ فيك من روحه وأمر الملائكة فسجدوا لك اشفع لنا عند ربك حتى يريحنا من مكاننا هذا ‏.‏ فيقول لست هناكم - فيذكر خطيئته التي أصاب فيستحيي ربه منها - ولكن ائتوا نوحا أول رسول بعثه الله - قال - فيأتون نوحا صلى الله عليه وسلم فيقول لست هناكم - فيذكر خطيئته التي أصاب فيستحيي ربه منها - ولكن ائتوا إبراهيم صلى الله عليه وسلم الذي اتخذه الله خليلا ‏.‏ فيأتون إبراهيم صلى الله عليه وسلم فيقول لست هناكم - ويذكر خطيئته التي أصاب فيستحيي ربه منها - ولكن ائتوا موسى صلى الله عليه وسلم الذي كلمه الله وأعطاه التوراة ‏.‏ قال فيأتون موسى - عليه السلام - فيقول لست هناكم - ويذكر خطيئته التي أصاب فيستحيي ربه منها - ولكن ائتوا عيسى روح الله وكلمته ‏.‏ فيأتون عيسى روح الله وكلمته فيقول لست هناكم ‏.‏ ولكن ائتوا محمدا صلى الله عليه وسلم عبدا قد غفر له ما تقدم من ذنبه وما تأخر ‏\"‏ ‏.‏ قال قال رسول الله صلى الله عليه وسلم ‏\"‏ فيأتوني فأستأذن على ربي فيؤذن لي فإذا أنا رأيته وقعت ساجدا فيدعني ما شاء الله فيقال يا محمد ارفع رأسك قل تسمع سل تعطه اشفع تشفع ‏.‏ فأرفع رأسي فأحمد ربي بتحميد يعلمنيه ربي ثم أشفع فيحد لي حدا فأخرجهم من النار وأدخلهم الجنة ثم أعود فأقع ساجدا فيدعني ما شاء الله أن يدعني ثم يقال ارفع رأسك يا محمد قل تسمع سل تعطه اشفع تشفع ‏.‏ فأرفع رأسي فأحمد ربي بتحميد يعلمنيه ثم أشفع فيحد لي حدا فأخرجهم من النار وأدخلهم الجنة - قال فلا أدري في الثالثة أو في الرابعة قال - فأقول يا رب ما بقي في النار إلا من حبسه القرآن أى وجب عليه الخلود ‏\"‏ ‏.‏ - قال ابن عبيد في روايته قال قتادة أى وجب عليه الخلود ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 381
			}
		},
		{
			"hadithnumber": 476,
			"arabicnumber": "193.02",
			"text": "وحدثنا محمد بن المثنى، ومحمد بن بشار، قالا حدثنا ابن أبي عدي، عن سعيد، عن قتادة، عن أنس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يجتمع المؤمنون يوم القيامة فيهتمون بذلك أو يلهمون ذلك ‏\"‏ ‏.‏ بمثل حديث أبي عوانة وقال في الحديث ‏\"‏ ثم آتيه الرابعة - أو أعود الرابعة - فأقول يا رب ما بقي إلا من حبسه القرآن ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 382
			}
		},
		{
			"hadithnumber": 477,
			"arabicnumber": "193.03",
			"text": "حدثنا محمد بن المثنى، حدثنا معاذ بن هشام، قال حدثني أبي، عن قتادة، عن أنس بن مالك، أن نبي الله صلى الله عليه وسلم قال ‏\"‏ يجمع الله المؤمنين يوم القيامة فيلهمون لذلك ‏\"‏ بمثل حديثهما وذكر في الرابعة ‏\"‏ فأقول يا رب ما بقي في النار إلا من حبسه القرآن أى وجب عليه الخلود ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 383
			}
		},
		{
			"hadithnumber": 478,
			"arabicnumber": "193.04",
			"text": "وحدثنا محمد بن منهال الضرير، حدثنا يزيد بن زريع، حدثنا سعيد بن أبي عروبة، وهشام، صاحب الدستوائي عن قتادة، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ح وحدثني أبو غسان المسمعي، ومحمد بن المثنى، قالا حدثنا معاذ، - وهو ابن هشام - قال حدثني أبي، عن قتادة، حدثنا أنس بن مالك، أن النبي صلى الله عليه وسلم قال ‏ \"‏ يخرج من النار من قال لا إله إلا الله وكان في قلبه من الخير ما يزن شعيرة ثم يخرج من النار من قال لا إله إلا الله وكان في قلبه من الخير ما يزن برة ثم يخرج من النار من قال لا إله إلا الله وكان في قلبه من الخير ما يزن ذرة ‏\"‏ ‏.‏ زاد ابن منهال في روايته قال يزيد فلقيت شعبة فحدثته بالحديث فقال شعبة حدثنا به قتادة عن أنس بن مالك عن النبي صلى الله عليه وسلم بالحديث ‏.‏ إلا أن شعبة جعل مكان الذرة ذرة قال يزيد صحف فيها أبو بسطام ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 384
			}
		},
		{
			"hadithnumber": 479,
			"arabicnumber": "193.05",
			"text": "حدثنا أبو الربيع العتكي، حدثنا حماد بن زيد، حدثنا معبد بن هلال العنزي، ح وحدثناه سعيد بن منصور، - واللفظ له - حدثنا حماد بن زيد، حدثنا معبد بن هلال العنزي، قال انطلقنا إلى أنس بن مالك وتشفعنا بثابت فانتهينا إليه وهو يصلي الضحى فاستأذن لنا ثابت فدخلنا عليه وأجلس ثابتا معه على سريره فقال له يا أبا حمزة إن إخوانك من أهل البصرة يسألونك أن تحدثهم حديث الشفاعة ‏.‏ قال حدثنا محمد صلى الله عليه وسلم قال ‏\"‏ إذا كان يوم القيامة ماج الناس بعضهم إلى بعض فيأتون آدم فيقولون له اشفع لذريتك ‏.‏ فيقول لست لها ولكن عليكم بإبراهيم - عليه السلام - فإنه خليل الله ‏.‏ فيأتون إبراهيم فيقول لست لها ولكن عليكم بموسى - عليه السلام - فإنه كليم الله ‏.‏ فيؤتى موسى فيقول لست لها ولكن عليكم بعيسى - عليه السلام - فإنه روح الله وكلمته ‏.‏ فيؤتى عيسى فيقول لست لها ولكن عليكم بمحمد صلى الله عليه وسلم فأوتى فأقول أنا لها ‏.‏ فأنطلق فأستأذن على ربي فيؤذن لي فأقوم بين يديه فأحمده بمحامد لا أقدر عليه الآن يلهمنيه الله ثم أخر له ساجدا فيقال لي يا محمد ارفع رأسك وقل يسمع لك وسل تعطه واشفع تشفع فأقول رب أمتي أمتي ‏.‏ فيقال انطلق فمن كان في قلبه مثقال حبة من برة أو شعيرة من إيمان فأخرجه منها ‏.‏ فأنطلق فأفعل ثم أرجع إلى ربي فأحمده بتلك المحامد ثم أخر له ساجدا فيقال لي يا محمد ارفع رأسك وقل يسمع لك وسل تعطه واشفع تشفع ‏.‏ فأقول أمتي أمتي ‏.‏ فيقال لي انطلق فمن كان في قلبه مثقال حبة من خردل من إيمان فأخرجه منها ‏.‏ فأنطلق فأفعل ثم أعود إلى ربي فأحمده بتلك المحامد ثم أخر له ساجدا فيقال لي يا محمد ارفع رأسك وقل يسمع لك وسل تعطه واشفع تشفع فأقول يا رب أمتي أمتي ‏.‏ فيقال لي انطلق فمن كان في قلبه أدنى أدنى أدنى من مثقال حبة من خردل من إيمان فأخرجه من النار فأنطلق فأفعل ‏\"‏ ‏.‏ هذا حديث أنس الذي أنبأنا به فخرجنا من عنده فلما كنا بظهر الجبان قلنا لو ملنا إلى الحسن فسلمنا عليه وهو مستخف في دار أبي خليفة - قال - فدخلنا عليه فسلمنا عليه فقلنا يا أبا سعيد جئنا من عند أخيك أبي حمزة فلم نسمع مثل حديث حدثناه في الشفاعة قال هيه ‏.‏ فحدثناه الحديث ‏.‏ فقال هيه ‏.‏ قلنا ما زادنا ‏.‏ قال قد حدثنا به منذ عشرين سنة وهو يومئذ جميع ولقد ترك شيئا ما أدري أنسي الشيخ أو كره أن يحدثكم فتتكلوا ‏.‏ قلنا له حدثنا ‏.‏ فضحك وقال خلق الإنسان من عجل ما ذكرت لكم هذا إلا وأنا أريد أن أحدثكموه ‏\"‏ ثم أرجع إلى ربي في الرابعة فأحمده بتلك المحامد ثم أخر له ساجدا فيقال لي يا محمد ارفع رأسك وقل يسمع لك وسل تعط واشفع تشفع ‏.‏ فأقول يا رب ائذن لي فيمن قال لا إله إلا الله ‏.‏ قال ليس ذاك لك - أو قال ليس ذاك إليك - ولكن وعزتي وكبريائي وعظمتي وجبريائي لأخرجن من قال لا إله إلا الله ‏\"‏ ‏.‏ قال فأشهد على الحسن أنه حدثنا به أنه سمع أنس بن مالك أراه قال قبل عشرين سنة وهو يومئذ جميع ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 385
			}
		},
		{
			"hadithnumber": 480,
			"arabicnumber": "194.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن عبد الله بن نمير، - واتفقا في سياق الحديث إلا ما يزيد أحدهما من الحرف بعد الحرف - قالا حدثنا محمد بن بشر حدثنا أبو حيان عن أبي زرعة عن أبي هريرة قال أتي رسول الله صلى الله عليه وسلم يوما بلحم فرفع إليه الذراع وكانت تعجبه فنهس منها نهسة فقال ‏ \"‏ أنا سيد الناس يوم القيامة وهل تدرون بم ذاك يجمع الله يوم القيامة الأولين والآخرين في صعيد واحد فيسمعهم الداعي وينفذهم البصر وتدنو الشمس فيبلغ الناس من الغم والكرب ما لا يطيقون وما لا يحتملون فيقول بعض الناس لبعض ألا ترون ما أنتم فيه ألا ترون ما قد بلغكم ألا تنظرون من يشفع لكم إلى ربكم فيقول بعض الناس لبعض ائتوا آدم ‏.‏ فيأتون آدم فيقولون يا آدم أنت أبو البشر خلقك الله بيده ونفخ فيك من روحه وأمر الملائكة فسجدوا لك اشفع لنا إلى ربك ألا ترى إلى ما نحن فيه ألا ترى إلى ما قد بلغنا فيقول آدم إن ربي غضب اليوم غضبا لم يغضب قبله مثله ولن يغضب بعده مثله وإنه نهاني عن الشجرة فعصيته نفسي نفسي اذهبوا إلى غيري اذهبوا إلى نوح ‏.‏ فيأتون نوحا فيقولون يا نوح أنت أول الرسل إلى الأرض وسماك الله عبدا شكورا اشفع لنا إلى ربك ألا ترى ما نحن فيه ألا ترى ما قد بلغنا فيقول لهم إن ربي قد غضب اليوم غضبا لم يغضب قبله مثله ولن يغضب بعده مثله وإنه قد كانت لي دعوة دعوت بها على قومي نفسي نفسي اذهبوا إلى إبراهيم صلى الله عليه وسلم ‏.‏ فيأتون إبراهيم فيقولون أنت نبي الله وخليله من أهل الأرض اشفع لنا إلى ربك ألا ترى إلى ما نحن فيه ألا ترى إلى ما قد بلغنا فيقول لهم إبراهيم إن ربي قد غضب اليوم غضبا لم يغضب قبله مثله ولا يغضب بعده مثله ‏.‏ وذكر كذباته نفسي نفسي اذهبوا إلى غيري اذهبوا إلى موسى ‏.‏ فيأتون موسى صلى الله عليه وسلم فيقولون يا موسى أنت رسول الله فضلك الله برسالاته وبتكليمه على الناس اشفع لنا إلى ربك ألا ترى إلى ما نحن فيه ألا ترى ما قد بلغنا فيقول لهم موسى صلى الله عليه وسلم إن ربي قد غضب اليوم غضبا لم يغضب قبله مثله ولن يغضب بعده مثله وإني قتلت نفسا لم أومر بقتلها نفسي نفسي اذهبوا إلى عيسى صلى الله عليه وسلم ‏.‏ فيأتون عيسى فيقولون يا عيسى أنت رسول الله وكلمت الناس في المهد وكلمة منه ألقاها إلى مريم وروح منه فاشفع لنا إلى ربك ألا ترى ما نحن فيه ألا ترى ما قد بلغنا فيقول لهم عيسى صلى الله عليه وسلم إن ربي قد غضب اليوم غضبا لم يغضب قبله مثله ولن يغضب بعده مثله - ولم يذكر له ذنبا - نفسي نفسي اذهبوا إلى غيري اذهبوا إلى محمد صلى الله عليه وسلم فيأتوني فيقولون يا محمد أنت رسول الله وخاتم الأنبياء وغفر الله لك ما تقدم من ذنبك وما تأخر اشفع لنا إلى ربك ألا ترى ما نحن فيه ألا ترى ما قد بلغنا فأنطلق فآتي تحت العرش فأقع ساجدا لربي ثم يفتح الله على ويلهمني من محامده وحسن الثناء عليه شيئا لم يفتحه لأحد قبلي ثم يقال يا محمد ارفع رأسك سل تعطه اشفع تشفع ‏.‏ فأرفع رأسي فأقول يا رب أمتي أمتي ‏.‏ فيقال يا محمد أدخل الجنة من أمتك من لا حساب عليه من الباب الأيمن من أبواب الجنة وهم شركاء الناس فيما سوى ذلك من الأبواب والذي نفس محمد بيده إن ما بين المصراعين من مصاريع الجنة لكما بين مكة وهجر أو كما بين مكة وبصرى ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 386
			}
		},
		{
			"hadithnumber": 481,
			"arabicnumber": "194.02",
			"text": "وحدثني زهير بن حرب، حدثنا جرير، عن عمارة بن القعقاع، عن أبي زرعة، عن أبي هريرة، قال وضعت بين يدى رسول الله صلى الله عليه وسلم قصعة من ثريد ولحم فتناول الذراع وكانت أحب الشاة إليه فنهس نهسة فقال ‏\"‏ أنا سيد الناس يوم القيامة ‏\"‏ ‏.‏ ثم نهس أخرى فقال ‏\"‏ أنا سيد الناس يوم القيامة ‏\"‏ ‏.‏ فلما رأى أصحابه لا يسألونه قال ‏\"‏ ألا تقولون كيفه ‏\"‏ ‏.‏ قالوا كيفه يا رسول الله قال ‏\"‏ يقوم الناس لرب العالمين ‏\"‏ ‏.‏ وساق الحديث بمعنى حديث أبي حيان عن أبي زرعة وزاد في قصة إبراهيم فقال وذكر قوله في الكوكب هذا ربي ‏.‏ وقوله لآلهتهم بل فعله كبيرهم هذا ‏.‏ وقوله إني سقيم ‏.‏ قال ‏\"‏ والذي نفس محمد بيده إن ما بين المصراعين من مصاريع الجنة إلى عضادتى الباب لكما بين مكة وهجر أو هجر ومكة ‏\"‏ ‏.‏ قال لا أدري أى ذلك قال ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 387
			}
		},
		{
			"hadithnumber": 482,
			"arabicnumber": "195",
			"text": "حدثنا محمد بن طريف بن خليفة البجلي، حدثنا محمد بن فضيل، حدثنا أبو مالك الأشجعي، عن أبي حازم، عن أبي هريرة، وأبو مالك عن ربعي، عن حذيفة، قالا قال رسول الله صلى الله عليه وسلم ‏\"‏ يجمع الله تبارك وتعالى الناس فيقوم المؤمنون حتى تزلف لهم الجنة فيأتون آدم فيقولون يا أبانا استفتح لنا الجنة ‏.‏ فيقول وهل أخرجكم من الجنة إلا خطيئة أبيكم آدم لست بصاحب ذلك اذهبوا إلى ابني إبراهيم خليل الله - قال - فيقول إبراهيم لست بصاحب ذلك إنما كنت خليلا من وراء وراء اعمدوا إلى موسى صلى الله عليه وسلم الذي كلمه الله تكليما ‏.‏ فيأتون موسى صلى الله عليه وسلم فيقول لست بصاحب ذلك اذهبوا إلى عيسى كلمة الله وروحه ‏.‏ فيقول عيسى صلى الله عليه وسلم لست بصاحب ذلك ‏.‏ فيأتون محمدا صلى الله عليه وسلم فيقوم فيؤذن له وترسل الأمانة والرحم فتقومان جنبتى الصراط يمينا وشمالا فيمر أولكم كالبرق ‏\"‏ ‏.‏ قال قلت بأبي أنت وأمي أى شىء كمر البرق قال ‏\"‏ ألم تروا إلى البرق كيف يمر ويرجع في طرفة ين ثم كمر الريح ثم كمر الطير وشد الرجال تجري بهم أعمالهم ونبيكم قائم على الصراط يقول رب سلم سلم حتى تعجز أعمال العباد حتى يجيء الرجل فلا يستطيع السير إلا زحفا - قال - وفي حافتى الصراط كلاليب معلقة مأمورة بأخذ من أمرت به فمخدوش ناج ومكدوس في النار ‏\"‏ ‏.‏ والذي نفس أبي هريرة بيده إن قعر جهنم لسبعون خريفا ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 388
			}
		},
		{
			"hadithnumber": 483,
			"arabicnumber": "196.01",
			"text": "حدثنا قتيبة بن سعيد، وإسحاق بن إبراهيم، قال قتيبة حدثنا جرير، عن المختار بن فلفل، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ أنا أول الناس يشفع في الجنة وأنا أكثر الأنبياء تبعا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 389
			}
		},
		{
			"hadithnumber": 484,
			"arabicnumber": "196.02",
			"text": "وحدثنا أبو كريب، محمد بن العلاء حدثنا معاوية بن هشام، عن سفيان، عن مختار بن فلفل، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ أنا أكثر الأنبياء تبعا يوم القيامة وأنا أول من يقرع باب الجنة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 390
			}
		},
		{
			"hadithnumber": 485,
			"arabicnumber": "196.03",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن المختار بن فلفل، قال قال أنس بن مالك قال النبي صلى الله عليه وسلم ‏ \"‏ أنا أول شفيع في الجنة لم يصدق نبي من الأنبياء ما صدقت وإن من الأنبياء نبيا ما يصدقه من أمته إلا رجل واحد ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 391
			}
		},
		{
			"hadithnumber": 486,
			"arabicnumber": "197",
			"text": "وحدثني عمرو الناقد، وزهير بن حرب، قالا حدثنا هاشم بن القاسم، حدثنا سليمان بن المغيرة، عن ثابت، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ آتي باب الجنة يوم القيامة فأستفتح فيقول الخازن من أنت فأقول محمد ‏.‏ فيقول بك أمرت لا أفتح لأحد قبلك ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 392
			}
		},
		{
			"hadithnumber": 487,
			"arabicnumber": "198.01",
			"text": "حدثني يونس بن عبد الأعلى، أخبرنا عبد الله بن وهب، قال أخبرني مالك بن أنس، عن ابن شهاب، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لكل نبي دعوة يدعوها فأريد أن أختبئ دعوتي شفاعة لأمتي يوم القيامة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 393
			}
		},
		{
			"hadithnumber": 488,
			"arabicnumber": "198.02",
			"text": "وحدثني زهير بن حرب، وعبد بن حميد، قال زهير حدثنا يعقوب بن إبراهيم، حدثنا ابن أخي ابن شهاب، عن عمه، أخبرني أبو سلمة بن عبد الرحمن، أن أبا هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لكل نبي دعوة وأردت إن شاء الله أن أختبئ دعوتي شفاعة لأمتي يوم القيامة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 394
			}
		},
		{
			"hadithnumber": 489,
			"arabicnumber": "198.03",
			"text": "حدثني زهير بن حرب، وعبد بن حميد، قال زهير حدثنا يعقوب بن إبراهيم، حدثنا ابن أخي ابن شهاب، عن عمه، حدثني عمرو بن أبي سفيان بن أسيد بن جارية الثقفي، مثل ذلك عن أبي هريرة، عن رسول الله صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 395
			}
		},
		{
			"hadithnumber": 490,
			"arabicnumber": "198.04",
			"text": "وحدثني حرملة بن يحيى، أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، أن عمرو بن أبي سفيان بن أسيد بن جارية الثقفي، أخبره أن أبا هريرة قال لكعب الأحبار إن نبي الله صلى الله عليه وسلم قال ‏ \"‏ لكل نبي دعوة يدعوها فأنا أريد إن شاء الله أن أختبئ دعوتي شفاعة لأمتي يوم القيامة ‏\"‏ ‏.‏ فقال كعب لأبي هريرة أنت سمعت هذا من رسول الله صلى الله عليه وسلم قال أبو هريرة نعم ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 396
			}
		},
		{
			"hadithnumber": 491,
			"arabicnumber": "199.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب - واللفظ لأبي كريب - قالا حدثنا أبو معاوية، عن الأعمش، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لكل نبي دعوة مستجابة فتعجل كل نبي دعوته وإني اختبأت دعوتي شفاعة لأمتي يوم القيامة فهي نائلة إن شاء الله من مات من أمتي لا يشرك بالله شيئا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 397
			}
		},
		{
			"hadithnumber": 492,
			"arabicnumber": "199.02",
			"text": "حدثنا قتيبة بن سعيد، حدثنا جرير، عن عمارة، - وهو ابن القعقاع - عن أبي زرعة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لكل نبي دعوة مستجابة يدعو بها فيستجاب له فيؤتاها وإني اختبأت دعوتي شفاعة لأمتي يوم القيامة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 398
			}
		},
		{
			"hadithnumber": 493,
			"arabicnumber": "199.03",
			"text": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن محمد، - وهو ابن زياد - قال سمعت أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ لكل نبي دعوة دعا بها في أمته فاستجيب له وإني أريد إن شاء الله أن أؤخر دعوتي شفاعة لأمتي يوم القيامة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 399
			}
		},
		{
			"hadithnumber": 494,
			"arabicnumber": "200.01",
			"text": "حدثني أبو غسان المسمعي، ومحمد بن المثنى، وابن، بشار حدثانا - واللفظ، لأبي غسان - قالوا حدثنا معاذ، - يعنون ابن هشام - قال حدثني أبي، عن قتادة، حدثنا أنس بن مالك، أن نبي الله صلى الله عليه وسلم قال ‏ \"‏ لكل نبي دعوة دعاها لأمته وإني اختبأت دعوتي شفاعة لأمتي يوم القيامة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 400
			}
		},
		{
			"hadithnumber": 495,
			"arabicnumber": "200.02",
			"text": "وحدثنيه زهير بن حرب، وابن أبي خلف، قالا حدثنا روح، حدثنا شعبة، عن قتادة، بهذا الإسناد ح",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 401
			}
		},
		{
			"hadithnumber": 496,
			"arabicnumber": "200.03",
			"text": "وحدثنا أبو كريب، حدثنا وكيع، ح وحدثنيه إبراهيم بن سعيد الجوهري، حدثنا أبو أسامة، جميعا عن مسعر، عن قتادة، بهذا الإسناد غير أن في، حديث وكيع قال قال ‏ \"‏ أعطي ‏\"‏ ‏.‏ وفي حديث أبي أسامة عن النبي صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 402
			}
		},
		{
			"hadithnumber": 497,
			"arabicnumber": "200.04",
			"text": "وحدثني محمد بن عبد الأعلى، حدثنا المعتمر، عن أبيه، عن أنس، أن نبي الله صلى الله عليه وسلم قال فذكر نحو حديث قتادة عن أنس ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 403
			}
		},
		{
			"hadithnumber": 498,
			"arabicnumber": "201",
			"text": "وحدثني محمد بن أحمد بن أبي خلف، حدثنا روح، حدثنا ابن جريج، قال أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول عن النبي صلى الله عليه وسلم ‏ \"‏ لكل نبي دعوة قد دعا بها في أمته وخبأت دعوتي شفاعة لأمتي يوم القيامة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 404
			}
		},
		{
			"hadithnumber": 499,
			"arabicnumber": "202",
			"text": "حدثني يونس بن عبد الأعلى الصدفي، أخبرنا ابن وهب، قال أخبرني عمرو بن الحارث، أن بكر بن سوادة، حدثه عن عبد الرحمن بن جبير، عن عبد الله بن عمرو بن العاص، أن النبي صلى الله عليه وسلم تلا قول الله عز وجل في إبراهيم ‏{‏ رب إنهن أضللن كثيرا من الناس فمن تبعني فإنه مني‏}‏ الآية ‏.‏ وقال عيسى عليه السلام ‏{‏ إن تعذبهم فإنهم عبادك وإن تغفر لهم فإنك أنت العزيز الحكيم‏}‏ فرفع يديه وقال ‏\"‏ اللهم أمتي أمتي ‏\"‏ ‏.‏ وبكى فقال الله عز وجل يا جبريل اذهب إلى محمد وربك أعلم فسله ما يبكيك فأتاه جبريل - عليه الصلاة والسلام - فسأله فأخبره رسول الله صلى الله عليه وسلم بما قال ‏.‏ وهو أعلم ‏.‏ فقال الله يا جبريل اذهب إلى محمد فقل إنا سنرضيك في أمتك ولا نسوءك ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 405
			}
		},
		{
			"hadithnumber": 500,
			"arabicnumber": "203",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا عفان، حدثنا حماد بن سلمة، عن ثابت، عن أنس، أن رجلا، قال يا رسول الله أين أبي قال ‏\"‏ في النار ‏\"‏ ‏.‏ فلما قفى دعاه فقال ‏\"‏ إن أبي وأباك في النار ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 406
			}
		},
		{
			"hadithnumber": 501,
			"arabicnumber": "204.01",
			"text": "حدثنا قتيبة بن سعيد، وزهير بن حرب، قالا حدثنا جرير، عن عبد الملك بن عمير، عن موسى بن طلحة، عن أبي هريرة، قال لما أنزلت هذه الآية ‏{‏ وأنذر عشيرتك الأقربين‏}‏ دعا رسول الله صلى الله عليه وسلم قريشا فاجتمعوا فعم وخص فقال ‏\"‏ يا بني كعب بن لؤى أنقذوا أنفسكم من النار يا بني مرة بن كعب أنقذوا أنفسكم من النار يا بني عبد شمس أنقذوا أنفسكم من النار يا بني عبد مناف أنقذوا أنفسكم من النار يا بني هاشم أنقذوا أنفسكم من النار يا بني عبد المطلب أنقذوا أنفسكم من النار يا فاطمة أنقذي نفسك من النار فإني لا أملك لكم من الله شيئا غير أن لكم رحما سأبلها ببلالها ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 407
			}
		},
		{
			"hadithnumber": 502,
			"arabicnumber": "204.02",
			"text": "وحدثنا عبيد الله بن عمر القواريري، حدثنا أبو عوانة، عن عبد الملك بن عمير، بهذا الإسناد وحديث جرير أتم وأشبع ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 408
			}
		},
		{
			"hadithnumber": 503,
			"arabicnumber": "205",
			"text": "حدثنا محمد بن عبد الله بن نمير، حدثنا وكيع، ويونس بن بكير، قالا حدثنا هشام بن عروة، عن أبيه، عن عائشة، قالت لما نزلت ‏{‏ وأنذر عشيرتك الأقربين‏}‏ قام رسول الله صلى الله عليه وسلم على الصفا فقال ‏\"‏ يا فاطمة بنت محمد يا صفية بنت عبد المطلب يا بني عبد المطلب لا أملك لكم من الله شيئا سلوني من مالي ما شئتم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 409
			}
		},
		{
			"hadithnumber": 504,
			"arabicnumber": "206.01",
			"text": "وحدثني حرملة بن يحيى، أخبرنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، قال أخبرني ابن المسيب، وأبو سلمة بن عبد الرحمن أن أبا هريرة، قال قال رسول الله صلى الله عليه وسلم حين أنزل عليه ‏{‏ وأنذر عشيرتك الأقربين‏}‏ ‏\"‏ يا معشر قريش اشتروا أنفسكم من الله لا أغني عنكم من الله شيئا يا بني عبد المطلب لا أغني عنكم من الله شيئا يا عباس بن عبد المطلب لا أغني عنك من الله شيئا يا صفية عمة رسول الله لا أغني عنك من الله شيئا يا فاطمة بنت رسول الله سليني بما شئت لا أغني عنك من الله شيئا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 410
			}
		},
		{
			"hadithnumber": 505,
			"arabicnumber": "206.02",
			"text": "وحدثني عمرو الناقد، حدثنا معاوية بن عمرو، حدثنا زائدة، حدثنا عبد الله بن ذكوان، عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم نحو هذا ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 411
			}
		},
		{
			"hadithnumber": 506,
			"arabicnumber": "207.01",
			"text": "حدثنا أبو كامل الجحدري، حدثنا يزيد بن زريع، حدثنا التيمي، عن أبي عثمان، عن قبيصة بن المخارق، وزهير بن عمرو، قالا لما نزلت ‏{‏ وأنذر عشيرتك الأقربين‏}‏ قال انطلق نبي الله صلى الله عليه وسلم إلى رضمة من جبل فعلا أعلاها حجرا ثم نادى ‏\"‏ يا بني عبد منافاه إني نذير إنما مثلي ومثلكم كمثل رجل رأى العدو فانطلق يربأ أهله فخشي أن يسبقوه فجعل يهتف يا صباحاه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 412
			}
		},
		{
			"hadithnumber": 507,
			"arabicnumber": "207.02",
			"text": "وحدثنا محمد بن عبد الأعلى، حدثنا المعتمر، عن أبيه، حدثنا أبو عثمان، عن زهير بن عمرو، وقبيصة بن مخارق، عن النبي صلى الله عليه وسلم بنحوه ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 413
			}
		},
		{
			"hadithnumber": 508,
			"arabicnumber": "208.01",
			"text": "وحدثنا أبو كريب، محمد بن العلاء حدثنا أبو أسامة، عن الأعمش، عن عمرو بن مرة، عن سعيد بن جبير، عن ابن عباس، قال لما نزلت هذه الآية ‏{‏ وأنذر عشيرتك الأقربين‏}‏ ورهطك منهم المخلصين ‏.‏ خرج رسول الله صلى الله عليه وسلم حتى صعد الصفا فهتف ‏\"‏ يا صباحاه ‏\"‏ ‏.‏ فقالوا من هذا الذي يهتف قالوا محمد ‏.‏ فاجتمعوا إليه فقال ‏\"‏ يا بني فلان يا بني فلان يا بني فلان يا بني عبد مناف يا بني عبد المطلب ‏\"‏ فاجتمعوا إليه فقال ‏\"‏ أرأيتكم لو أخبرتكم أن خيلا تخرج بسفح هذا الجبل أكنتم مصدقي ‏\"‏ ‏.‏ قالوا ما جربنا عليك كذبا ‏.‏ قال ‏\"‏ فإني نذير لكم بين يدى عذاب شديد ‏\"‏ ‏.‏ قال فقال أبو لهب تبا لك أما جمعتنا إلا لهذا ثم قام فنزلت هذه السورة تبت يدا أبي لهب وقد تب ‏.‏ كذا قرأ الأعمش إلى آخر السورة ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 414
			}
		},
		{
			"hadithnumber": 509,
			"arabicnumber": "208.02",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، عن الأعمش، بهذا الإسناد قال صعد رسول الله صلى الله عليه وسلم ذات يوم الصفا فقال ‏\"‏ يا صباحاه ‏\"‏ ‏.‏ بنحو حديث أبي أسامة ولم يذكر نزول الآية ‏{‏ وأنذر عشيرتك الأقربين‏}‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 415
			}
		},
		{
			"hadithnumber": 510,
			"arabicnumber": "209.01",
			"text": "وحدثنا عبيد الله بن عمر القواريري، ومحمد بن أبي بكر المقدمي، ومحمد بن عبد الملك الأموي، قالوا حدثنا أبو عوانة، عن عبد الملك بن عمير، عن عبد الله بن الحارث بن نوفل، عن العباس بن عبد المطلب، أنه قال يا رسول الله هل نفعت أبا طالب بشىء فإنه كان يحوطك ويغضب لك قال ‏ \"‏ نعم هو في ضحضاح من نار ولولا أنا لكان في الدرك الأسفل من النار ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 416
			}
		},
		{
			"hadithnumber": 511,
			"arabicnumber": "209.02",
			"text": "حدثنا ابن أبي عمر، حدثنا سفيان، عن عبد الملك بن عمير، عن عبد الله بن الحارث، قال سمعت العباس، يقول قلت يا رسول الله إن أبا طالب كان يحوطك وينصرك فهل نفعه ذلك قال ‏ \"‏ نعم وجدته في غمرات من النار فأخرجته إلى ضحضاح ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 417
			}
		},
		{
			"hadithnumber": 512,
			"arabicnumber": "209.03",
			"text": "وحدثنيه محمد بن حاتم، حدثنا يحيى بن سعيد، عن سفيان، قال حدثني عبد الملك بن عمير، قال حدثني عبد الله بن الحارث، قال أخبرني العباس بن عبد المطلب، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن سفيان، بهذا الإسناد عن النبي صلى الله عليه وسلم بنحو حديث أبي عوانة ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 418
			}
		},
		{
			"hadithnumber": 513,
			"arabicnumber": "210",
			"text": "وحدثنا قتيبة بن سعيد، حدثنا ليث، عن ابن الهاد، عن عبد الله بن خباب، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم ذكر عنده عمه أبو طالب فقال ‏ \"‏ لعله تنفعه شفاعتي يوم القيامة فيجعل في ضحضاح من نار يبلغ كعبيه يغلي منه دماغه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 419
			}
		},
		{
			"hadithnumber": 514,
			"arabicnumber": "211",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن أبي بكير، حدثنا زهير بن محمد، عن سهيل بن أبي صالح، عن النعمان بن أبي عياش، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إن أدنى أهل النار عذابا ينتعل بنعلين من نار يغلي دماغه من حرارة نعليه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 420
			}
		},
		{
			"hadithnumber": 515,
			"arabicnumber": "212",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا عفان، حدثنا حماد بن سلمة، حدثنا ثابت، عن أبي عثمان النهدي، عن ابن عباس، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ أهون أهل النار عذابا أبو طالب وهو منتعل بنعلين يغلي منهما دماغه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 421
			}
		},
		{
			"hadithnumber": 516,
			"arabicnumber": "213.01",
			"text": "وحدثنا محمد بن المثنى، وابن، بشار - واللفظ لابن المثنى - قالا حدثنا محمد بن جعفر، حدثنا شعبة، قال سمعت أبا إسحاق، يقول سمعت النعمان بن بشير، يخطب وهو يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ إن أهون أهل النار عذابا يوم القيامة لرجل توضع في أخمص قدميه جمرتان يغلي منهما دماغه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 422
			}
		},
		{
			"hadithnumber": 517,
			"arabicnumber": "213.02",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، عن الأعمش، عن أبي إسحاق، عن النعمان بن بشير، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن أهون أهل النار عذابا من له نعلان وشراكان من نار يغلي منهما دماغه كما يغلي المرجل ما يرى أن أحدا أشد منه عذابا وإنه لأهونهم عذابا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 423
			}
		},
		{
			"hadithnumber": 518,
			"arabicnumber": "214",
			"text": "حدثني أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، عن داود، عن الشعبي، عن مسروق، عن عائشة، قالت قلت يا رسول الله ابن جدعان كان في الجاهلية يصل الرحم ويطعم المسكين فهل ذاك نافعه قال ‏ \"‏ لا ينفعه إنه لم يقل يوما رب اغفر لي خطيئتي يوم الدين ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 424
			}
		},
		{
			"hadithnumber": 519,
			"arabicnumber": "215",
			"text": "حدثني أحمد بن حنبل، حدثنا محمد بن جعفر، حدثنا شعبة، عن إسماعيل بن أبي خالد، عن قيس، عن عمرو بن العاص، قال سمعت رسول الله صلى الله عليه وسلم جهارا غير سر يقول ‏ \"‏ ألا إن آل أبي - يعني فلانا - ليسوا لي بأولياء إنما وليي الله وصالح المؤمنين ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 425
			}
		},
		{
			"hadithnumber": 520,
			"arabicnumber": "216.01",
			"text": "حدثنا عبد الرحمن بن سلام بن عبيد الله الجمحي، حدثنا الربيع، - يعني ابن مسلم - عن محمد بن زياد، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ يدخل من أمتي الجنة سبعون ألفا بغير حساب ‏\"‏ ‏.‏ فقال رجل يا رسول الله ادع الله أن يجعلني منهم ‏.‏ قال ‏\"‏ اللهم اجعله منهم ‏\"‏ ‏.‏ ثم قام آخر فقال يا رسول الله ادع الله أن يجعلني منهم ‏.‏ قال ‏\"‏ سبقك بها عكاشة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 426
			}
		},
		{
			"hadithnumber": 521,
			"arabicnumber": "216.02",
			"text": "وحدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، قال سمعت محمد بن زياد، قال سمعت أبا هريرة، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏.‏ بمثل حديث الربيع ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 427
			}
		},
		{
			"hadithnumber": 522,
			"arabicnumber": "216.03",
			"text": "حدثني حرملة بن يحيى، أخبرنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، قال حدثني سعيد بن المسيب، أن أبا هريرة، حدثه قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ يدخل من أمتي زمرة هم سبعون ألفا تضيء وجوههم إضاءة القمر ليلة البدر ‏\"‏ ‏.‏ قال أبو هريرة فقام عكاشة بن محصن الأسدي يرفع نمرة عليه فقال يا رسول الله ادع الله أن يجعلني منهم ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم اجعله منهم ‏\"‏ ثم قام رجل من الأنصار فقال يا رسول الله ادع الله أن يجعلني منهم ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ سبقك بها عكاشة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 428
			}
		},
		{
			"hadithnumber": 523,
			"arabicnumber": "217",
			"text": "وحدثني حرملة بن يحيى، حدثنا عبد الله بن وهب، أخبرني حيوة، قال حدثني أبو يونس، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ يدخل الجنة من أمتي سبعون ألفا زمرة واحدة منهم على صورة القمر ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 429
			}
		},
		{
			"hadithnumber": 524,
			"arabicnumber": "218.01",
			"text": "حدثنا يحيى بن خلف الباهلي، حدثنا المعتمر، عن هشام بن حسان، عن محمد، - يعني ابن سيرين - قال حدثني عمران، قال قال نبي الله صلى الله عليه وسلم ‏\"‏ يدخل الجنة من أمتي سبعون ألفا بغير حساب ‏\"‏ ‏.‏ قالوا ومن هم يا رسول الله قال ‏\"‏ هم الذين لا يكتوون ولا يسترقون وعلى ربهم يتوكلون ‏\"‏ ‏.‏ فقام عكاشة فقال ادع الله أن يجعلني منهم ‏.‏ قال ‏\"‏ أنت منهم ‏\"‏ ‏.‏ قال فقام رجل فقال يا نبي الله ادع الله أن يجعلني منهم ‏.‏ قال ‏\"‏ سبقك بها عكاشة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 430
			}
		},
		{
			"hadithnumber": 525,
			"arabicnumber": "218.02",
			"text": "حدثني زهير بن حرب، حدثنا عبد الصمد بن عبد الوارث، حدثنا حاجب بن عمر أبو خشينة الثقفي، حدثنا الحكم بن الأعرج، عن عمران بن حصين، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يدخل الجنة من أمتي سبعون ألفا بغير حساب ‏\"‏ ‏.‏ قالوا من هم يا رسول الله قال ‏\"‏ هم الذين لا يسترقون ولا يتطيرون ولا يكتوون وعلى ربهم يتوكلون ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 431
			}
		},
		{
			"hadithnumber": 526,
			"arabicnumber": "219",
			"text": "حدثنا قتيبة بن سعيد، حدثنا عبد العزيز، - يعني ابن أبي حازم - عن أبي حازم، عن سهل بن سعد، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ ليدخلن الجنة من أمتي سبعون ألفا أو سبعمائة ألف - لا يدري أبو حازم أيهما قال - متماسكون آخذ بعضهم بعضا لا يدخل أولهم حتى يدخل آخرهم وجوههم على صورة القمر ليلة البدر ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 432
			}
		},
		{
			"hadithnumber": 527,
			"arabicnumber": "220.01",
			"text": "حدثنا سعيد بن منصور، حدثنا هشيم، أخبرنا حصين بن عبد الرحمن، قال كنت عند سعيد بن جبير فقال أيكم رأى الكوكب الذي انقض البارحة قلت أنا ‏.‏ ثم قلت أما إني لم أكن في صلاة ولكني لدغت ‏.‏ قال فماذا صنعت قلت استرقيت ‏.‏ قال فما حملك على ذلك قلت حديث حدثناه الشعبي ‏.‏ فقال وما حدثكم الشعبي قلت حدثنا عن بريدة بن حصيب الأسلمي أنه قال لا رقية إلا من عين أو حمة ‏.‏ فقال قد أحسن من انتهى إلى ما سمع ولكن حدثنا ابن عباس عن النبي صلى الله عليه وسلم قال ‏\"‏ عرضت على الأمم فرأيت النبي ومعه الرهيط والنبي ومعه الرجل والرجلان والنبي ليس معه أحد إذ رفع لي سواد عظيم فظننت أنهم أمتي فقيل لي هذا موسى صلى الله عليه وسلم وقومه ولكن انظر إلى الأفق ‏.‏ فنظرت فإذا سواد عظيم فقيل لي انظر إلى الأفق الآخر ‏.‏ فإذا سواد عظيم فقيل لي هذه أمتك ومعهم سبعون ألفا يدخلون الجنة بغير حساب ولا عذاب ‏\"‏ ‏.‏ ثم نهض فدخل منزله فخاض الناس في أولئك الذين يدخلون الجنة بغير حساب ولا عذاب فقال بعضهم فلعلهم الذين صحبوا رسول الله صلى الله عليه وسلم ‏.‏ وقال بعضهم فلعلهم الذين ولدوا في الإسلام ولم يشركوا بالله ‏.‏ وذكروا أشياء فخرج عليهم رسول الله صلى الله عليه وسلم فقال ‏\"‏ ما الذي تخوضون فيه ‏\"‏ ‏.‏ فأخبروه فقال ‏\"‏ هم الذين لا يرقون ولا يسترقون ولا يتطيرون وعلى ربهم يتوكلون ‏\"‏ ‏.‏ فقام عكاشة بن محصن فقال ادع الله أن يجعلني منهم ‏.‏ فقال ‏\"‏ أنت منهم ‏\"‏ ثم قام رجل آخر فقال ادع الله أن يجعلني منهم ‏.‏ فقال ‏\"‏ سبقك بها عكاشة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 433
			}
		},
		{
			"hadithnumber": 528,
			"arabicnumber": "220.02",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن فضيل، عن حصين، عن سعيد بن جبير، حدثنا ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ عرضت على الأمم ‏\"‏ ‏.‏ ثم ذكر باقي الحديث نحو حديث هشيم ولم يذكر أول حديثه ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 434
			}
		},
		{
			"hadithnumber": 529,
			"arabicnumber": "221.01",
			"text": "حدثنا هناد بن السري، حدثنا أبو الأحوص، عن أبي إسحاق، عن عمرو بن ميمون، عن عبد الله، قال قال لنا رسول الله صلى الله عليه وسلم ‏\"‏ أما ترضون أن تكونوا ربع أهل الجنة ‏\"‏ قال فكبرنا ‏.‏ ثم قال ‏\"‏ أما ترضون أن تكونوا ثلث أهل الجنة ‏\"‏ قال فكبرنا ‏.‏ ثم قال ‏\"‏ إني لأرجو أن تكونوا شطر أهل الجنة وسأخبركم عن ذلك ما المسلمون في الكفار إلا كشعرة بيضاء في ثور أسود أو كشعرة سوداء في ثور أبيض ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 435
			}
		},
		{
			"hadithnumber": 530,
			"arabicnumber": "221.02",
			"text": "حدثنا محمد بن المثنى، ومحمد بن بشار، - واللفظ لابن المثنى - قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن أبي إسحاق، عن عمرو بن ميمون، عن عبد الله، قال كنا مع رسول الله صلى الله عليه وسلم في قبة نحوا من أربعين رجلا فقال ‏\"‏ أترضون أن تكونوا ربع أهل الجنة قال قلنا نعم ‏.‏ فقال ‏\"‏ أترضون أن تكونوا ثلث أهل الجنة ‏\"‏ فقلنا نعم ‏.‏ فقال ‏\"‏ والذي نفسي بيده إني لأرجو أن تكونوا نصف أهل الجنة وذاك أن الجنة لا يدخلها إلا نفس مسلمة وما أنتم في أهل الشرك إلا كالشعرة البيضاء في جلد الثور الأسود أو كالشعرة السوداء في جلد الثور الأحمر ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 436
			}
		},
		{
			"hadithnumber": 531,
			"arabicnumber": "221.03",
			"text": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا مالك، - وهو ابن مغول - عن أبي إسحاق، عن عمرو بن ميمون، عن عبد الله، قال خطبنا رسول الله صلى الله عليه وسلم فأسند ظهره إلى قبة أدم فقال ‏\"‏ ألا لا يدخل الجنة إلا نفس مسلمة اللهم هل بلغت اللهم اشهد ‏.‏ أتحبون أنكم ربع أهل الجنة ‏\"‏ ‏.‏ فقلنا نعم يا رسول الله ‏.‏ فقال ‏\"‏ أتحبون أن تكونوا ثلث أهل الجنة ‏\"‏ ‏.‏ قالوا نعم يا رسول الله ‏.‏ قال ‏\"‏ إني لأرجو أن تكونوا شطر أهل الجنة ما أنتم في سواكم من الأمم إلا كالشعرة السوداء في الثور الأبيض أو كالشعرة البيضاء في الثور الأسود ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 437
			}
		},
		{
			"hadithnumber": 532,
			"arabicnumber": "222.01",
			"text": "حدثنا عثمان بن أبي شيبة العبسي، حدثنا جرير، عن الأعمش، عن أبي صالح، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يقول الله عز وجل يا آدم فيقول لبيك وسعديك والخير في يديك - قال - يقول أخرج بعث النار ‏.‏ قال وما بعث النار قال من كل ألف تسعمائة وتسعة وتسعين ‏.‏ قال فذاك حين يشيب الصغير وتضع كل ذات حمل حملها وترى الناس سكارى وما هم بسكارى ولكن عذاب الله شديد ‏\"‏ ‏.‏ قال فاشتد ذلك عليهم ‏.‏ قالوا يا رسول الله أينا ذلك الرجل فقال ‏\"‏ أبشروا فإن من يأجوج ومأجوج ألفا ومنكم رجل ‏\"‏ ‏.‏ قال ثم قال ‏\"‏ والذي نفسي بيده إني لأطمع أن تكونوا ربع أهل الجنة ‏\"‏ ‏.‏ فحمدنا الله وكبرنا ثم قال ‏\"‏ والذي نفسي بيده إني لأطمع أن تكونوا ثلث أهل الجنة ‏\"‏ ‏.‏ فحمدنا الله وكبرنا ثم قال ‏\"‏ والذي نفسي بيده إني لأطمع أن تكونوا شطر أهل الجنة إن مثلكم في الأمم كمثل الشعرة البيضاء في جلد الثور الأسود أو كالرقمة في ذراع الحمار ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 438
			}
		},
		{
			"hadithnumber": 533,
			"arabicnumber": "222.02",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، ح وحدثنا أبو كريب، حدثنا أبو معاوية، كلاهما عن الأعمش، بهذا الإسناد غير أنهما قالا ‏\"‏ ما أنتم يومئذ في الناس إلا كالشعرة البيضاء في الثور الأسود أو كالشعرة السوداء في الثور الأبيض ‏\"‏ ‏.‏ ولم يذكرا ‏\"‏ أو كالرقمة في ذراع الحمار ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 439
			}
		}
	]
}