{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"11": "The Book of Prayer - Funerals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2123,
			"arabicnumber": "916.01",
			"text": "وحدثنا أبو كامل الجحدري، فضيل بن حسين وعثمان بن أبي شيبة كلاهما عن بشر، - قال أبو كامل حدثنا بشر بن المفضل، - حدثنا عمارة بن غزية، حدثنا يحيى، بن عمارة قال سمعت أبا سعيد الخدري، يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ لقنوا موتاكم لا إله إلا الله ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2124,
			"arabicnumber": "916.02",
			"text": "وحدثناه قتيبة بن سعيد، حدثنا عبد العزيز يعني الدراوردي، ح وحدثنا أبو بكر بن أبي شيبة حدثنا خالد بن مخلد، حدثنا سليمان بن بلال، جميعا بهذا الإسناد ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2125,
			"arabicnumber": "917",
			"text": "وحدثنا أبو بكر، وعثمان، ابنا أبي شيبة ح وحدثني عمرو الناقد، قالوا جميعا حدثنا أبو خالد الأحمر، عن يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لقنوا موتاكم لا إله إلا الله ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2126,
			"arabicnumber": "918.01",
			"text": "حدثنا يحيى بن أيوب، وقتيبة، وابن، حجر جميعا عن إسماعيل بن جعفر، - قال ابن أيوب حدثنا إسماعيل، - أخبرني سعد بن سعيد، عن عمر بن كثير بن أفلح، عن ابن، سفينة عن أم سلمة، أنها قالت سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما من مسلم تصيبه مصيبة فيقول ما أمره الله إنا لله وإنا إليه راجعون اللهم أجرني في مصيبتي وأخلف لي خيرا منها ‏.‏ إلا أخلف الله له خيرا منها ‏\"‏ ‏.‏ قالت فلما مات أبو سلمة قلت أى المسلمين خير من أبي سلمة أول بيت هاجر إلى رسول الله صلى الله عليه وسلم ‏.‏ ثم إني قلتها فأخلف الله لي رسول الله صلى الله عليه وسلم ‏.‏ قالت أرسل إلى رسول الله صلى الله عليه وسلم حاطب بن أبي بلتعة يخطبني له فقلت إن لي بنتا وأنا غيور ‏.‏ فقال ‏\"‏ أما ابنتها فندعو الله أن يغنيها عنها وأدعو الله أن يذهب بالغيرة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2127,
			"arabicnumber": "918.02",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، عن سعد بن سعيد، قال أخبرني عمر بن كثير بن أفلح، قال سمعت ابن سفينة، يحدث أنه سمع أم سلمة، زوج النبي صلى الله عليه وسلم تقول سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ ما من عبد تصيبه مصيبة فيقول إنا لله وإنا إليه راجعون اللهم أجرني في مصيبتي وأخلف لي خيرا منها إلا أجره الله في مصيبته وأخلف له خيرا منها ‏\"‏ ‏.‏ قالت فلما توفي أبو سلمة قلت كما أمرني رسول الله صلى الله عليه وسلم فأخلف الله لي خيرا منه رسول الله صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2128,
			"arabicnumber": "918.03",
			"text": "وحدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا سعد بن سعيد، أخبرني عمر، - يعني ابن كثير - عن ابن سفينة، مولى أم سلمة عن أم سلمة، زوج النبي صلى الله عليه وسلم قالت سمعت رسول الله صلى الله عليه وسلم يقول بمثل حديث أبي أسامة وزاد قالت فلما توفي أبو سلمة قلت من خير من أبي سلمة صاحب رسول الله صلى الله عليه وسلم ثم عزم الله لي فقلتها ‏.‏ قالت فتزوجت رسول الله صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2129,
			"arabicnumber": "919",
			"text": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، عن الأعمش، عن شقيق، عن أم سلمة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا حضرتم المريض أو الميت فقولوا خيرا فإن الملائكة يؤمنون على ما تقولون ‏\"‏ ‏.‏ قالت فلما مات أبو سلمة أتيت النبي صلى الله عليه وسلم فقلت يا رسول الله إن أبا سلمة قد مات قال ‏\"‏ قولي اللهم اغفر لي وله وأعقبني منه عقبى حسنة ‏\"‏ ‏.‏ قالت فقلت فأعقبني الله من هو خير لي منه محمدا صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2130,
			"arabicnumber": "920.01",
			"text": "حدثني زهير بن حرب، حدثنا معاوية بن عمرو، حدثنا أبو إسحاق الفزاري، عن خالد الحذاء، عن أبي قلابة، عن قبيصة بن ذؤيب، عن أم سلمة، قالت دخل رسول الله صلى الله عليه وسلم على أبي سلمة وقد شق بصره فأغمضه ثم قال ‏\"‏ إن الروح إذا قبض تبعه البصر ‏\"‏ ‏.‏ فضج ناس من أهله فقال ‏\"‏ لا تدعوا على أنفسكم إلا بخير فإن الملائكة يؤمنون على ما تقولون ‏\"‏ ‏.‏ ثم قال ‏\"‏ اللهم اغفر لأبي سلمة وارفع درجته في المهديين واخلفه في عقبه في الغابرين واغفر لنا وله يا رب العالمين وافسح له في قبره ‏.‏ ونور له فيه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2131,
			"arabicnumber": "920.02",
			"text": "وحدثنا محمد بن موسى القطان الواسطي، حدثنا المثنى بن معاذ بن معاذ، حدثنا أبي، حدثنا عبيد الله بن الحسن، حدثنا خالد الحذاء، بهذا الإسناد نحوه غير أنه قال ‏\"‏ واخلفه في تركته ‏\"‏ ‏.‏ وقال ‏\"‏ اللهم أوسع له في قبره ‏\"‏ ‏.‏ ولم يقل ‏\"‏ افسح له ‏\"‏ ‏.‏ وزاد قال خالد الحذاء ودعوة أخرى سابعة نسيتها ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2132,
			"arabicnumber": "921.01",
			"text": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق، أخبرنا ابن جريج، عن العلاء بن، يعقوب قال أخبرني أبي أنه، سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ ألم تروا الإنسان إذا مات شخص بصره ‏\"‏ ‏.‏ قالوا بلى ‏.‏ قال ‏\"‏ فذلك حين يتبع بصره نفسه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2133,
			"arabicnumber": "921.02",
			"text": "وحدثناه قتيبة بن سعيد، حدثنا عبد العزيز، - يعني الدراوردي - عن العلاء، بهذا الإسناد ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2134,
			"arabicnumber": "922",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وابن، نمير وإسحاق بن إبراهيم كلهم عن ابن، عيينة - قال ابن نمير حدثنا سفيان، - عن ابن أبي نجيح، عن أبيه، عن عبيد بن عمير، قال قالت أم سلمة لما مات أبو سلمة قلت غريب وفي أرض غربة لأبكينه بكاء يتحدث عنه ‏.‏ فكنت قد تهيأت للبكاء عليه إذ أقبلت امرأة من الصعيد تريد أن تسعدني فاستقبلها رسول الله صلى الله عليه وسلم وقال ‏ \"‏ أتريدين أن تدخلي الشيطان بيتا أخرجه الله منه ‏\"‏ ‏.‏ مرتين فكففت عن البكاء فلم أبك ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2135,
			"arabicnumber": "923.01",
			"text": "حدثنا أبو كامل الجحدري، حدثنا حماد، - يعني ابن زيد - عن عاصم الأحول، عن أبي عثمان النهدي، عن أسامة بن زيد، قال كنا عند النبي صلى الله عليه وسلم فأرسلت إليه إحدى بناته تدعوه وتخبره أن صبيا لها - أو ابنا لها - في الموت فقال للرسول ‏\"‏ ارجع إليها فأخبرها إن لله ما أخذ وله ما أعطى وكل شىء عنده بأجل مسمى فمرها فلتصبر ولتحتسب ‏\"‏ فعاد الرسول فقال إنها قد أقسمت لتأتينها ‏.‏ قال فقام النبي صلى الله عليه وسلم وقام معه سعد بن عبادة ومعاذ بن جبل وانطلقت معهم فرفع إليه الصبي ونفسه تقعقع كأنها في شنة ففاضت عيناه فقال له سعد ما هذا يا رسول الله قال ‏\"‏ هذه رحمة جعلها الله في قلوب عباده وإنما يرحم الله من عباده الرحماء ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2136,
			"arabicnumber": "923.02",
			"text": "وحدثنا محمد بن عبد الله بن نمير، حدثنا ابن فضيل، ح وحدثنا أبو بكر بن أبي، شيبة حدثنا أبو معاوية، جميعا عن عاصم الأحول، بهذا الإسناد ‏.‏ غير أن حديث حماد أتم وأطول ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2137,
			"arabicnumber": "924",
			"text": "حدثنا يونس بن عبد الأعلى الصدفي، وعمرو بن سواد العامري، قالا أخبرنا عبد الله بن وهب، أخبرني عمرو بن الحارث، عن سعيد بن الحارث الأنصاري، عن عبد، الله بن عمر قال اشتكى سعد بن عبادة شكوى له فأتى رسول الله صلى الله عليه وسلم يعوده مع عبد الرحمن بن عوف وسعد بن أبي وقاص وعبد الله بن مسعود فلما دخل عليه وجده في غشية فقال ‏\"‏ أقد قضى ‏\"‏ ‏.‏ قالوا لا يا رسول الله ‏.‏ فبكى رسول الله صلى الله عليه وسلم فلما رأى القوم بكاء رسول الله صلى الله عليه وسلم بكوا فقال ‏\"‏ ألا تسمعون إن الله لا يعذب بدمع العين ولا بحزن القلب ولكن يعذب بهذا - وأشار إلى لسانه - أو يرحم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2138,
			"arabicnumber": "925",
			"text": "وحدثنا محمد بن المثنى العنزي، حدثنا محمد بن جهضم، حدثنا إسماعيل، - وهو ابن جعفر - عن عمارة، - يعني ابن غزية - عن سعيد بن الحارث بن المعلى، عن عبد الله بن عمر، أنه قال كنا جلوسا مع رسول الله صلى الله عليه وسلم إذ جاءه رجل من الأنصار فسلم عليه ثم أدبر الأنصاري فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا أخا الأنصار كيف أخي سعد بن عبادة ‏\"‏ ‏.‏ فقال صالح ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ من يعوده منكم ‏\"‏ ‏.‏ فقام وقمنا معه ونحن بضعة عشر ما علينا نعال ولا خفاف ولا قلانس ولا قمص نمشي في تلك السباخ حتى جئناه فاستأخر قومه من حوله حتى دنا رسول الله صلى الله عليه وسلم وأصحابه الذين معه ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2139,
			"arabicnumber": "926.01",
			"text": "حدثنا محمد بن بشار العبدي، حدثنا محمد، - يعني ابن جعفر - حدثنا شعبة، عن ثابت، قال سمعت أنس بن مالك، يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ الصبر عند الصدمة الأولى ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2140,
			"arabicnumber": "926.02",
			"text": "وحدثنا محمد بن المثنى، حدثنا عثمان بن عمر، أخبرنا شعبة، عن ثابت البناني، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم أتى على امرأة تبكي على صبي لها فقال لها ‏\"‏ اتقي الله واصبري ‏\"‏ ‏.‏ فقالت وما تبالي بمصيبتي ‏.‏ فلما ذهب قيل لها إنه رسول الله صلى الله عليه وسلم ‏.‏ فأخذها مثل الموت فأتت بابه فلم تجد على بابه بوابين فقالت يا رسول الله لم أعرفك ‏.‏ فقال ‏\"‏ إنما الصبر عند أول صدمة ‏\"‏ ‏.‏ أو قال ‏\"‏ عند أول الصدمة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2141,
			"arabicnumber": "926.03",
			"text": "وحدثناه يحيى بن حبيب الحارثي، حدثنا خالد يعني ابن الحارث، ح وحدثنا عقبة بن مكرم العمي، حدثنا عبد الملك بن عمرو، ح وحدثني أحمد بن إبراهيم الدورقي، حدثنا عبد الصمد، قالوا جميعا حدثنا شعبة، بهذا الإسناد نحو حديث عثمان بن عمر بقصته ‏.‏ وفي حديث عبد الصمد مر النبي صلى الله عليه وسلم بامرأة عند قبر ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2142,
			"arabicnumber": "927.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن عبد الله بن نمير، جميعا عن ابن بشر، - قال أبو بكر حدثنا محمد بن بشر العبدي، - عن عبيد الله بن عمر، قال حدثنا نافع، عن عبد الله، أن حفصة، بكت على عمر فقال مهلا يا بنية ألم تعلمي أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إن الميت يعذب ببكاء أهله عليه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2143,
			"arabicnumber": "927.02",
			"text": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، قال سمعت قتادة، يحدث عن سعيد بن المسيب، عن ابن عمر، عن عمر، عن النبي صلى الله عليه وسلم قال ‏ \"‏ الميت يعذب في قبره بما نيح عليه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2144,
			"arabicnumber": "927.03",
			"text": "وحدثناه محمد بن المثنى، حدثنا ابن أبي عدي، عن سعيد، عن قتادة، عن سعيد، بن المسيب عن ابن عمر، عن عمر، عن النبي صلى الله عليه وسلم قال ‏ \"‏ الميت يعذب في قبره بما نيح عليه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2145,
			"arabicnumber": "927.04",
			"text": "وحدثني علي بن حجر السعدي، حدثنا علي بن مسهر، عن الأعمش، عن أبي، صالح عن ابن عمر، قال لما طعن عمر أغمي عليه فصيح عليه فلما أفاق قال أما علمتم أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إن الميت ليعذب ببكاء الحى ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2146,
			"arabicnumber": "927.05",
			"text": "حدثني علي بن حجر، حدثنا علي بن مسهر، عن الشيباني، عن أبي بردة، عن أبيه، قال لما أصيب عمر جعل صهيب يقول واأخاه ‏.‏ فقال له عمر يا صهيب أما علمت أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إن الميت ليعذب ببكاء الحى ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2147,
			"arabicnumber": "927.06",
			"text": "وحدثني علي بن حجر، أخبرنا شعيب بن صفوان أبو يحيى، عن عبد الملك بن، عمير عن أبي بردة بن أبي موسى، عن أبي موسى، قال لما أصيب عمر أقبل صهيب من منزله حتى دخل على عمر فقام بحياله يبكي فقال عمر علام تبكي أعلى تبكي قال إي والله لعليك أبكي يا أمير المؤمنين ‏.‏ قال والله لقد علمت أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من يبكى عليه يعذب ‏\"‏ ‏.‏ قال فذكرت ذلك لموسى بن طلحة فقال كانت عائشة تقول إنما كان أولئك اليهود ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2148,
			"arabicnumber": "927.07",
			"text": "وحدثني عمرو الناقد، حدثنا عفان بن مسلم، حدثنا حماد بن سلمة، عن ثابت، عن أنس، أن عمر بن الخطاب، لما طعن عولت عليه حفصة فقال يا حفصة أما سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ المعول عليه يعذب ‏\"‏ ‏.‏ وعول عليه صهيب فقال عمر يا صهيب أما علمت ‏\"‏ أن المعول عليه يعذب ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2151,
			"arabicnumber": "929.03",
			"text": "وحدثنا عبد الرحمن بن بشر، حدثنا سفيان، قال عمرو عن ابن أبي مليكة، كنا في جنازة أم أبان بنت عثمان وساق الحديث ولم ينص رفع الحديث عن عمر عن النبي صلى الله عليه وسلم كما نصه أيوب وابن جريج وحديثهما أتم من حديث عمرو ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2152,
			"arabicnumber": "930",
			"text": "وحدثني حرملة بن يحيى، حدثنا عبد الله بن وهب، حدثني عمر بن محمد، أنحدثه عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إن الميت يعذب ببكاء الحى ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2153,
			"arabicnumber": "931",
			"text": "وحدثنا خلف بن هشام، وأبو الربيع الزهراني، جميعا عن حماد، - قال خلف حدثنا حماد بن زيد، - عن هشام بن عروة، عن أبيه، قال ذكر عند عائشة قول ابن عمر الميت يعذب ببكاء أهله عليه ‏.‏ فقالت رحم الله أبا عبد الرحمن سمع شيئا فلم يحفظه إنما مرت على رسول الله صلى الله عليه وسلم جنازة يهودي وهم يبكون عليه فقال ‏ \"‏ أنتم تبكون وإنه ليعذب ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2154,
			"arabicnumber": "932.01",
			"text": "حدثنا أبو كريب، حدثنا أبو أسامة، عن هشام، عن أبيه، قال ذكر عند عائشة أن ابن عمر، يرفع إلى النبي صلى الله عليه وسلم ‏\"‏ إن الميت يعذب في قبره ببكاء أهله عليه ‏\"‏ ‏.‏ فقالت وهل إنما قال رسول الله صلى الله عليه وسلم ‏\"‏ إنه ليعذب بخطيئته أو بذنبه وإن أهله ليبكون عليه الآن ‏\"‏ ‏.‏ وذاك مثل قوله إن رسول الله صلى الله عليه وسلم قام على القليب يوم بدر وفيه قتلى بدر من المشركين فقال لهم ما قال ‏\"‏ إنهم ليسمعون ما أقول ‏\"‏ ‏.‏ وقد وهل إنما قال ‏\"‏ إنهم ليعلمون أن ما كنت أقول لهم حق ‏\"‏ ‏.‏ ثم قرأت ‏{‏ إنك لا تسمع الموتى‏}‏ ‏{‏ وما أنت بمسمع من في القبور‏}‏ يقول حين تبوءوا مقاعدهم من النار ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2155,
			"arabicnumber": "932.02",
			"text": "وحدثناه أبو بكر بن أبي شيبة، حدثنا وكيع، حدثنا هشام بن عروة، بهذا الإسناد بمعنى حديث أبي أسامة وحديث أبي أسامة أتم ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2156,
			"arabicnumber": "932.03",
			"text": "وحدثنا قتيبة بن سعيد، عن مالك بن أنس، فيما قرئ عليه عن عبد الله بن، أبي بكر عن أبيه، عن عمرة بنت عبد الرحمن، أنها أخبرته أنها، سمعت عائشة، وذكر، لها أن عبد الله بن عمر، يقول إن الميت ليعذب ببكاء الحى ‏.‏ فقالت عائشة يغفر الله لأبي عبد الرحمن أما إنه لم يكذب ولكنه نسي أو أخطأ إنما مر رسول الله صلى الله عليه وسلم على يهودية يبكى عليها فقال ‏ \"‏ إنهم ليبكون عليها وإنها لتعذب في قبرها ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2157,
			"arabicnumber": "933.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن سعيد بن عبيد الطائي، ومحمد، بن قيس عن علي بن ربيعة، قال أول من نيح عليه بالكوفة قرظة بن كعب فقال المغيرة بن شعبة سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ من نيح عليه فإنه يعذب بما نيح عليه يوم القيامة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2158,
			"arabicnumber": "933.02",
			"text": "وحدثني علي بن حجر السعدي، حدثنا علي بن مسهر، أخبرنا محمد بن قيس، الأسدي عن علي بن ربيعة الأسدي، عن المغيرة بن شعبة، عن النبي صلى الله عليه وسلم مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2159,
			"arabicnumber": "933.03",
			"text": "وحدثناه ابن أبي عمر، حدثنا مروان، - يعني الفزاري - حدثنا سعيد بن عبيد، الطائي عن علي بن ربيعة، عن المغيرة بن شعبة، عن النبي صلى الله عليه وسلم مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2160,
			"arabicnumber": "934",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا عفان، حدثنا أبان بن يزيد، ح وحدثني إسحاق، بن منصور - واللفظ له - أخبرنا حبان بن هلال، حدثنا أبان، حدثنا يحيى، أن زيدا، حدثه أن أبا سلام حدثه أن أبا مالك الأشعري حدثه أن النبي صلى الله عليه وسلم قال ‏\"‏ أربع في أمتي من أمر الجاهلية لا يتركونهن الفخر في الأحساب والطعن في الأنساب والاستسقاء بالنجوم والنياحة ‏\"‏ ‏.‏ وقال ‏\"‏ النائحة إذا لم تتب قبل موتها تقام يوم القيامة وعليها سربال من قطران ودرع من جرب ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2161,
			"arabicnumber": "935.01",
			"text": "وحدثنا ابن المثنى، وابن أبي عمر، قال ابن المثنى حدثنا عبد الوهاب، قال سمعت يحيى بن سعيد، يقول أخبرتني عمرة، أنها سمعت عائشة، تقول لما جاء رسول الله صلى الله عليه وسلم قتل ابن حارثة وجعفر بن أبي طالب وعبد الله بن رواحة جلس رسول الله صلى الله عليه وسلم يعرف فيه الحزن قالت وأنا أنظر من صائر الباب - شق الباب - فأتاه رجل فقال يا رسول الله إن نساء جعفر وذكر بكاءهن فأمره أن يذهب فينهاهن فذهب فأتاه فذكر أنهن لم يطعنه فأمره الثانية أن يذهب فينهاهن فذهب ثم أتاه فقال والله لقد غلبننا يا رسول الله ‏.‏ قالت فزعمت أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ اذهب فاحث في أفواههن من التراب ‏\"‏ ‏.‏ قالت عائشة فقلت أرغم الله أنفك والله ما تفعل ما أمرك رسول الله صلى الله عليه وسلم وما تركت رسول الله صلى الله عليه وسلم من العناء ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2162,
			"arabicnumber": "935.02",
			"text": "وحدثناه أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، ح وحدثني أبو الطاهر، أخبرنا عبد الله بن وهب، عن معاوية بن صالح، ح وحدثني أحمد بن إبراهيم الدورقي، حدثنا عبد الصمد، حدثنا عبد العزيز، - يعني ابن مسلم - كلهم عن يحيى بن سعيد، بهذا الإسناد ‏.‏ نحوه ‏.‏ وفي حديث عبد العزيز وما تركت رسول الله صلى الله عليه وسلم من العي ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2163,
			"arabicnumber": "936.01",
			"text": "حدثني أبو الربيع الزهراني، حدثنا حماد، حدثنا أيوب، عن محمد، عن أم عطية، قالت أخذ علينا رسول الله صلى الله عليه وسلم مع البيعة ألا ننوح فما وفت منا امرأة إلا خمس أم سليم وأم العلاء وابنة أبي سبرة امرأة معاذ أو ابنة أبي سبرة وامرأة معاذ .‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2164,
			"arabicnumber": "936.02",
			"text": "حدثنا إسحاق بن إبراهيم، أخبرنا أسباط، حدثنا هشام، عن حفصة، عن أم عطية، قالت أخذ علينا رسول الله صلى الله عليه وسلم في البيعة ألا تنحن فما وفت منا غير خمس منهن أم سليم ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2165,
			"arabicnumber": "937",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، وإسحاق بن إبراهيم، جميعا عن أبي معاوية، - قال زهير حدثنا محمد بن خازم، - حدثنا عاصم، عن حفصة، عن أم، عطية قالت لما نزلت هذه الآية ‏{‏ يبايعنك على أن لا يشركن بالله شيئا‏}‏ ‏{‏ ولا يعصينك في معروف‏}‏ قالت كان منه النياحة ‏.‏ قالت فقلت يا رسول الله إلا آل فلان فإنهم كانوا أسعدوني في الجاهلية فلا بد لي من أن أسعدهم ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إلا آل فلان ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 2166,
			"arabicnumber": "938.01",
			"text": "حدثنا يحيى بن أيوب، حدثنا ابن علية، أخبرنا أيوب، عن محمد بن سيرين، قال قالت أم عطية كنا ننهى عن اتباع الجنائز ولم يعزم علينا ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 2167,
			"arabicnumber": "938.02",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، ح وحدثنا إسحاق بن إبراهيم، أخبرنا عيسى بن يونس، كلاهما عن هشام، عن حفصة، عن أم عطية، قالت نهينا عن اتباع الجنائز، ولم يعزم علينا ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 2168,
			"arabicnumber": "939.01",
			"text": "وحدثنا يحيى بن يحيى، أخبرنا يزيد بن زريع، عن أيوب، عن محمد بن سيرين، عن أم عطية، قالت دخل علينا النبي صلى الله عليه وسلم ونحن نغسل ابنته فقال ‏\"‏ اغسلنها ثلاثا أو خمسا أو أكثر من ذلك إن رأيتن ذلك بماء وسدر واجعلن في الآخرة كافورا أو شيئا من كافور فإذا فرغتن فآذنني ‏\"‏ ‏.‏ فلما فرغنا آذناه فألقى إلينا حقوه فقال ‏\"‏ أشعرنها إياه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 2169,
			"arabicnumber": "939.02",
			"text": "وحدثنا يحيى بن يحيى، أخبرنا يزيد بن زريع، عن أيوب، عن محمد بن سيرين، عن حفصة بنت سيرين، عن أم عطية، قالت مشطناها ثلاثة قرون ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 2170,
			"arabicnumber": "939.03",
			"text": "وحدثنا قتيبة بن سعيد، عن مالك بن أنس، ح وحدثنا أبو الربيع الزهراني، وقتيبة، بن سعيد قالا حدثنا حماد، ح وحدثنا يحيى بن أيوب، حدثنا ابن علية، كلهم عن أيوب، عن محمد، عن أم عطية، قالت توفيت إحدى بنات النبي صلى الله عليه وسلم ‏.‏ وفي حديث ابن علية قالت أتانا رسول الله صلى الله عليه وسلم ونحن نغسل ابنته ‏.‏ وفي حديث مالك قالت دخل علينا رسول الله صلى الله عليه وسلم حين توفيت ابنته ‏.‏ بمثل حديث يزيد بن زريع عن أيوب عن محمد عن أم عطية ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 2171,
			"arabicnumber": "939.04",
			"text": "وحدثنا قتيبة بن سعيد، حدثنا حماد، عن أيوب، عن حفصة، عن أم عطية، ‏.‏ بنحوه غير أنه قال ‏ \"‏ ثلاثا أو خمسا أو سبعا أو أكثر من ذلك إن رأيتن ذلك ‏\"‏ ‏.‏ فقالت حفصة عن أم عطية وجعلنا رأسها ثلاثة قرون ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 2172,
			"arabicnumber": "939.05",
			"text": "وحدثنا يحيى بن أيوب، حدثنا ابن علية، وأخبرنا أيوب، قال وقالت حفصة عن أم عطية، قالت اغسلنها وترا ثلاثا أو خمسا أو سبعا قال وقالت أم عطية مشطناها ثلاثة قرون ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 2173,
			"arabicnumber": "939.06",
			"text": "حدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، جميعا عن أبي معاوية، - قال عمرو حدثنا محمد بن خازم أبو معاوية، - حدثنا عاصم الأحول، عن حفصة بنت سيرين، عن أم عطية، قالت لما ماتت زينب بنت رسول الله صلى الله عليه وسلم قال لنا رسول الله صلى الله عليه وسلم ‏\"‏ اغسلنها وترا ثلاثا أو خمسا واجعلن في الخامسة كافورا أو شيئا من كافور فإذا غسلتنها فأعلمنني ‏\"‏ ‏.‏ قالت فأعلمناه ‏.‏ فأعطانا حقوه وقال ‏\"‏ أشعرنها إياه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 2174,
			"arabicnumber": "939.07",
			"text": "وحدثنا عمرو الناقد، حدثنا يزيد بن هارون، أخبرنا هشام بن حسان، عن حفصة، بنت سيرين عن أم عطية، قالت أتانا رسول الله صلى الله عليه وسلم ونحن نغسل إحدى بناته فقال ‏ \"‏ اغسلنها وترا خمسا أو أكثر من ذلك ‏\"‏ ‏.‏ بنحو حديث أيوب وعاصم وقال في الحديث قالت فضفرنا شعرها ثلاثة أثلاث قرنيها وناصيتها ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 2175,
			"arabicnumber": "939.08",
			"text": "وحدثنا يحيى بن يحيى، أخبرنا هشيم، عن خالد، عن حفصة بنت سيرين، عن أم عطية، أن رسول الله صلى الله عليه وسلم حيث أمرها أن تغسل ابنته قال لها ‏ \"‏ ابدأن بميامنها ومواضع الوضوء منها ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 2176,
			"arabicnumber": "939.09",
			"text": "حدثنا يحيى بن أيوب، وأبو بكر بن أبي شيبة وعمرو الناقد كلهم عن ابن علية، - قال أبو بكر حدثنا إسماعيل ابن علية، - عن خالد، عن حفصة، عن أم عطية، أن رسول الله صلى الله عليه وسلم قال لهن في غسل ابنته ‏ \"‏ ابدأن بميامنها ومواضع الوضوء منها ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 2177,
			"arabicnumber": "940.01",
			"text": "وحدثنا يحيى بن يحيى التميمي، وأبو بكر بن أبي شيبة ومحمد بن عبد الله بن نمير وأبو كريب - واللفظ ليحيى قال يحيى أخبرنا وقال الآخرون، حدثنا أبو معاوية، - عن الأعمش، عن شقيق، عن خباب بن الأرت، قال هاجرنا مع رسول الله صلى الله عليه وسلم في سبيل الله نبتغي وجه الله فوجب أجرنا على الله فمنا من مضى لم يأكل من أجره شيئا منهم مصعب بن عمير ‏.‏ قتل يوم أحد فلم يوجد له شىء يكفن فيه إلا نمرة فكنا إذا وضعناها على رأسه خرجت رجلاه وإذا وضعناها على رجليه خرج رأسه ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏ \"‏ ضعوها مما يلي رأسه واجعلوا على رجليه الإذخر ‏\"‏ ‏.‏ ومنا من أينعت له ثمرته فهو يهدبها ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 2178,
			"arabicnumber": "940.02",
			"text": "وحدثنا عثمان بن أبي شيبة، حدثنا جرير، ح وحدثنا إسحاق بن إبراهيم، أخبرنا عيسى بن يونس، ح وحدثنا منجاب بن الحارث التميمي، أخبرنا علي بن مسهر، ح وحدثنا إسحاق بن إبراهيم، وابن أبي عمر، جميعا عن ابن عيينة، عن الأعمش، بهذا الإسناد ‏.‏ نحوه ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 2179,
			"arabicnumber": "941.01",
			"text": "حدثنا يحيى بن يحيى، وأبو بكر بن أبي شيبة وأبو كريب - واللفظ ليحيى - قال يحيى أخبرنا وقال الآخران، حدثنا أبو معاوية، - عن هشام بن عروة، عن أبيه، عن عائشة، قالت كفن رسول الله صلى الله عليه وسلم في ثلاثة أثواب بيض سحولية من كرسف ليس فيها قميص ولا عمامة أما الحلة فإنما شبه على الناس فيها أنها اشتريت له ليكفن فيها فتركت الحلة وكفن في ثلاثة أثواب بيض سحولية فأخذها عبد الله بن أبي بكر فقال لأحبسنها حتى أكفن فيها نفسي ثم قال لو رضيها الله عز وجل لنبيه لكفنه فيها ‏.‏ فباعها وتصدق بثمنها ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 2180,
			"arabicnumber": "941.02",
			"text": "وحدثني علي بن حجر السعدي، أخبرنا علي بن مسهر، حدثنا هشام بن عروة، عن أبيه، عن عائشة، قالت أدرج رسول الله صلى الله عليه وسلم في حلة يمنية كانت لعبد الله بن أبي بكر ثم نزعت عنه وكفن في ثلاثة أثواب سحول يمانية ليس فيها عمامة ولا قميص فرفع عبد الله الحلة فقال أكفن فيها ‏.‏ ثم قال لم يكفن فيها رسول الله صلى الله عليه وسلم وأكفن فيها ‏.‏ فتصدق بها ‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 2181,
			"arabicnumber": "941.03",
			"text": "وحدثناه أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، وابن، عيينة وابن إدريس وعبدة ووكيع ح وحدثناه يحيى بن يحيى، أخبرنا عبد العزيز بن محمد، كلهم عن هشام، بهذا الإسناد وليس في حديثهم قصة عبد الله بن أبي بكر ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 2182,
			"arabicnumber": "941.04",
			"text": "وحدثني ابن أبي عمر، حدثنا عبد العزيز، عن يزيد، عن محمد بن إبراهيم، عن أبي سلمة، أنه قال سألت عائشة زوج النبي صلى الله عليه وسلم فقلت لها في كم كفن رسول الله صلى الله عليه وسلم فقالت في ثلاثة أثواب سحولية ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 2183,
			"arabicnumber": "942.01",
			"text": "وحدثنا زهير بن حرب، وحسن الحلواني، وعبد بن حميد، قال عبد أخبرني وقال، الآخران حدثنا يعقوب، - وهو ابن إبراهيم بن سعد - حدثنا أبي، عن صالح، عن ابن، شهاب أن أبا سلمة بن عبد الرحمن، أخبره أن عائشة أم المؤمنين قالت سجي رسول الله صلى الله عليه وسلم حين مات بثوب حبرة ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 2184,
			"arabicnumber": "942.02",
			"text": "وحدثناه إسحاق بن إبراهيم، وعبد بن حميد، قالا أخبرنا عبد الرزاق، قال أخبرنا معمر، ح وحدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا أبو اليمان، أخبرنا شعيب، عن الزهري، بهذا الإسناد سواء ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 2185,
			"arabicnumber": "943",
			"text": "حدثنا هارون بن عبد الله، وحجاج بن الشاعر، قالا حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يحدث أن النبي صلى الله عليه وسلم خطب يوما فذكر رجلا من أصحابه قبض فكفن في كفن غير طائل وقبر ليلا فزجر النبي صلى الله عليه وسلم أن يقبر الرجل بالليل حتى يصلى عليه إلا أن يضطر إنسان إلى ذلك وقال النبي صلى الله عليه وسلم ‏ \"‏ إذا كفن أحدكم أخاه فليحسن كفنه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 2186,
			"arabicnumber": "944.01",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، جميعا عن ابن عيينة، - قال أبو بكر حدثنا سفيان بن عيينة، - عن الزهري، عن سعيد، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ أسرعوا بالجنازة فإن تك صالحة فخير - لعله قال - تقدمونها عليه وإن تكن غير ذلك فشر تضعونه عن رقابكم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 2187,
			"arabicnumber": "944.02",
			"text": "وحدثني محمد بن رافع، وعبد بن حميد، جميعا عن عبد الرزاق، أخبرنا معمر، ح وحدثنا يحيى بن حبيب، حدثنا روح بن عبادة، حدثنا محمد بن أبي حفصة، كلاهما عن الزهري، عن سعيد، عن أبي هريرة، عن النبي صلى الله عليه وسلم غير أن في حديث معمر قال لا أعلمه إلا رفع الحديث ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 2188,
			"arabicnumber": "944.03",
			"text": "وحدثني أبو الطاهر، وحرملة بن يحيى، وهارون بن سعيد الأيلي، قال هارون حدثنا وقال الآخران، أخبرنا ابن وهب، أخبرني يونس بن يزيد، عن ابن شهاب، قال حدثني أبو أمامة بن سهل بن حنيف، عن أبي هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ أسرعوا بالجنازة فإن كانت صالحة قربتموها إلى الخير وإن كانت غير ذلك كان شرا تضعونه عن رقابكم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 2189,
			"arabicnumber": "945.01",
			"text": "وحدثني أبو الطاهر، وحرملة بن يحيى، وهارون بن سعيد الأيلي، - واللفظ لهارون وحرملة - قال هارون حدثنا وقال الآخران أخبرنا ابن وهب أخبرني يونس عن ابن شهاب قال حدثني عبد الرحمن بن هرمز الأعرج أن أبا هريرة قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من شهد الجنازة حتى يصلى عليها فله قيراط ومن شهدها حتى تدفن فله قيراطان ‏\"‏ ‏.‏ قيل وما القيراطان قال ‏\"‏ مثل الجبلين العظيمين ‏\"‏ ‏.‏ انتهى حديث أبي الطاهر وزاد الآخران قال ابن شهاب قال سالم بن عبد الله بن عمر وكان ابن عمر يصلي عليها ثم ينصرف فلما بلغه حديث أبي هريرة قال لقد ضيعنا قراريط كثيرة ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 2190,
			"arabicnumber": "945.02",
			"text": "حدثناه أبو بكر بن أبي شيبة، حدثنا عبد الأعلى، ح وحدثنا ابن رافع، وعبد، بن حميد عن عبد الرزاق، كلاهما عن معمر، عن الزهري، عن سعيد بن المسيب، عن أبي، هريرة عن النبي صلى الله عليه وسلم إلى قوله الجبلين العظيمين ‏.‏ ولم يذكرا ما بعده وفي حديث عبد الأعلى حتى يفرغ منها وفي حديث عبد الرزاق حتى توضع في اللحد",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 2191,
			"arabicnumber": "945.03",
			"text": "وحدثني عبد الملك بن شعيب بن الليث، حدثني أبي، عن جدي، قال حدثني عقيل، بن خالد عن ابن شهاب، أنه قال حدثني رجال، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏.‏ بمثل حديث معمر وقال ‏ \"‏ ومن اتبعها حتى تدفن ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 2192,
			"arabicnumber": "945.04",
			"text": "وحدثني محمد بن حاتم، حدثنا بهز، حدثنا وهيب، حدثني سهيل، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من صلى على جنازة ولم يتبعها فله قيراط فإن تبعها فله قيراطان ‏\"‏ ‏.‏ قيل وما القيراطان قال ‏\"‏ أصغرهما مثل أحد ‏\"‏ .‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 2193,
			"arabicnumber": "945.05",
			"text": "حدثني محمد بن حاتم، حدثنا يحيى بن سعيد، عن يزيد بن كيسان، حدثني أبو حازم عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من صلى على جنازة فله قيراط ومن اتبعها حتى توضع في القبر فقيراطان ‏\"‏ ‏.‏ قال قلت يا أبا هريرة وما القيراط قال ‏\"‏ مثل أحد ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 2194,
			"arabicnumber": "945.06",
			"text": "حدثنا شيبان بن فروخ، حدثنا جرير، - يعني ابن حازم - حدثنا نافع، قال قيل لابن عمر إن أبا هريرة يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ من تبع جنازة فله قيراط من الأجر ‏\"‏ ‏.‏ فقال ابن عمر أكثر علينا أبو هريرة ‏.‏ فبعث إلى عائشة فسألها فصدقت أبا هريرة فقال ابن عمر لقد فرطنا في قراريط كثيرة ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 2195,
			"arabicnumber": "945.07",
			"text": "وحدثني محمد بن عبد الله بن نمير، حدثنا عبد الله بن يزيد، حدثني حيوة، حدثني أبو صخر، عن يزيد بن عبد الله بن قسيط، أنه حدثه أن داود بن عامر بن سعد بن أبي وقاص حدثه عن أبيه، أنه كان قاعدا عند عبد الله بن عمر إذ طلع خباب صاحب المقصورة فقال يا عبد الله بن عمر ألا تسمع ما يقول أبو هريرة إنه سمع رسول الله صلى الله عليه وسلم يقول ‏ \"‏ من خرج مع جنازة من بيتها وصلى عليها ثم تبعها حتى تدفن كان له قيراطان من أجر كل قيراط مثل أحد ومن صلى عليها ثم رجع كان له من الأجر مثل أحد ‏\"‏ ‏.‏ فأرسل ابن عمر خبابا إلى عائشة يسألها عن قول أبي هريرة ثم يرجع إليه فيخبره ما قالت وأخذ ابن عمر قبضة من حصى المسجد يقلبها في يده حتى رجع إليه الرسول فقال قالت عائشة صدق أبو هريرة ‏.‏ فضرب ابن عمر بالحصى الذي كان في يده الأرض ثم قال لقد فرطنا في قراريط كثيرة ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 2196,
			"arabicnumber": "946.01",
			"text": "وحدثنا محمد بن بشار، حدثنا يحيى، - يعني ابن سعيد - حدثنا شعبة، حدثني قتادة، عن سالم بن أبي الجعد، عن معدان بن أبي طلحة اليعمري، عن ثوبان، مولى رسول الله صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من صلى على جنازة فله قيراط فإن شهد دفنها فله قيراطان القيراط مثل أحد ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 2197,
			"arabicnumber": "946.02",
			"text": "وحدثني ابن بشار، حدثنا معاذ بن هشام، حدثني أبي قال، وحدثنا ابن المثنى، حدثنا ابن أبي عدي، عن سعيد، ح وحدثني زهير بن حرب، حدثنا عفان، حدثنا أبان، كلهم عن قتادة، بهذا الإسناد ‏.‏ مثله ‏.‏ وفي حديث سعيد وهشام سئل النبي صلى الله عليه وسلم عن القيراط فقال ‏ \"‏ مثل أحد ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 2198,
			"arabicnumber": "947",
			"text": "حدثنا الحسن بن عيسى، حدثنا ابن المبارك، أخبرنا سلام بن أبي مطيع، عن أيوب، عن أبي قلابة، عن عبد الله بن يزيد، - رضيع عائشة - عن عائشة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ ما من ميت يصلي عليه أمة من المسلمين يبلغون مائة كلهم يشفعون له إلا شفعوا فيه ‏\"‏ ‏.‏ قال فحدثت به شعيب بن الحبحاب فقال حدثني به أنس بن مالك عن النبي صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 2199,
			"arabicnumber": "948",
			"text": "حدثنا هارون بن معروف، وهارون بن سعيد الأيلي، والوليد بن شجاع السكوني، قال الوليد حدثني وقال الآخران، حدثنا ابن وهب، أخبرني أبو صخر، عن شريك بن عبد، الله بن أبي نمر عن كريب، مولى ابن عباس عن عبد الله بن عباس، أنه مات ابن له بقديد أو بعسفان فقال يا كريب انظر ما اجتمع له من الناس ‏.‏ قال فخرجت فإذا ناس قد اجتمعوا له فأخبرته فقال تقول هم أربعون قال نعم ‏.‏ قال أخرجوه فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ ما من رجل مسلم يموت فيقوم على جنازته أربعون رجلا لا يشركون بالله شيئا إلا شفعهم الله فيه ‏\"‏ ‏.‏ وفي رواية ابن معروف عن شريك بن أبي نمر عن كريب عن ابن عباس ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 2200,
			"arabicnumber": "949.01",
			"text": "وحدثنا يحيى بن أيوب، وأبو بكر بن أبي شيبة وزهير بن حرب وعلي بن حجر السعدي كلهم عن ابن علية، - واللفظ ليحيى قال حدثنا ابن علية، - أخبرنا عبد العزيز، بن صهيب عن أنس بن مالك، قال مر بجنازة فأثني عليها خير فقال نبي الله صلى الله عليه وسلم ‏\"‏ وجبت وجبت وجبت ‏\"‏ ‏.‏ ومر بجنازة فأثني عليها شر فقال نبي الله صلى الله عليه وسلم ‏\"‏ وجبت وجبت وجبت ‏\"‏ ‏.‏ قال عمر فدى لك أبي وأمي مر بجنازة فأثني عليها خيرا فقلت وجبت وجبت وجبت ‏.‏ ومر بجنازة فأثني عليها شر فقلت وجبت وجبت وجبت فقال رسول الله صلى الله عليه وسلم ‏\"‏ من أثنيتم عليه خيرا وجبت له الجنة ومن أثنيتم عليه شرا وجبت له النار أنتم شهداء الله في الأرض أنتم شهداء الله في الأرض أنتم شهداء الله في الأرض ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 2201,
			"arabicnumber": "949.02",
			"text": "وحدثني أبو الربيع الزهراني، حدثنا حماد يعني ابن زيد، ح وحدثني يحيى بن، يحيى أخبرنا جعفر بن سليمان، كلاهما عن ثابت، عن أنس، قال مر على النبي صلى الله عليه وسلم بجنازة ‏.‏ فذكر بمعنى حديث عبد العزيز عن أنس غير أن حديث عبد العزيز أتم ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 2202,
			"arabicnumber": "950.01",
			"text": "وحدثنا قتيبة بن سعيد، عن مالك بن أنس، فيما قرئ عليه عن محمد بن عمرو، بن حلحلة عن معبد بن كعب بن مالك، عن أبي قتادة بن ربعي، أنه كان يحدث أن رسول الله صلى الله عليه وسلم مر عليه بجنازة فقال ‏\"‏ مستريح ومستراح منه ‏\"‏ ‏.‏ قالوا يا رسول الله ما المستريح والمستراح منه ‏.‏ فقال ‏\"‏ العبد المؤمن يستريح من نصب الدنيا والعبد الفاجر يستريح منه العباد والبلاد والشجر والدواب ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 2203,
			"arabicnumber": "950.02",
			"text": "وحدثنا محمد بن المثنى، حدثنا يحيى بن سعيد، ح وحدثنا إسحاق بن إبراهيم، أخبرنا عبد الرزاق، جميعا عن عبد الله بن سعيد بن أبي هند، عن محمد بن عمرو، عن ابن لكعب بن مالك، عن أبي قتادة، عن النبي صلى الله عليه وسلم وفي حديث يحيى بن سعيد ‏ \"‏ يستريح من أذى الدنيا ونصبها إلى رحمة الله ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 2204,
			"arabicnumber": "951.01",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن ابن شهاب، عن سعيد بن المسيب، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم نعى للناس النجاشي في اليوم الذي مات فيه فخرج بهم إلى المصلى وكبر أربع تكبيرات ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 2205,
			"arabicnumber": "951.02",
			"text": "وحدثني عبد الملك بن شعيب بن الليث، حدثني أبي، عن جدي، قال حدثني عقيل، بن خالد عن ابن شهاب، عن سعيد بن المسيب، وأبي، سلمة بن عبد الرحمن أنهما حدثاه عن أبي هريرة، أنه قال نعى لنا رسول الله صلى الله عليه وسلم النجاشي صاحب الحبشة في اليوم الذي مات فيه فقال ‏ \"‏ استغفروا لأخيكم ‏\"‏ ‏.‏ قال ابن شهاب وحدثني سعيد بن المسيب أن أبا هريرة حدثه أن رسول الله صلى الله عليه وسلم صف بهم بالمصلى فصلى فكبر عليه أربع تكبيرات ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 2206,
			"arabicnumber": "951.03",
			"text": "وحدثني عمرو الناقد، وحسن الحلواني، وعبد بن حميد، قالوا حدثنا يعقوب، - وهو ابن إبراهيم بن سعد - حدثنا أبي، عن صالح، عن ابن شهاب، كرواية عقيل بالإسنادين جميعا ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 2207,
			"arabicnumber": "952.01",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، عن سليم بن حيان، قال حدثنا سعيد بن ميناء، عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم صلى",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 2208,
			"arabicnumber": "952.02",
			"text": "وحدثني محمد بن حاتم، حدثنا يحيى بن سعيد، عن ابن جريج، عن عطاء، عن جابر بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ مات اليوم عبد لله صالح أصحمة ‏\"‏ ‏.‏ فقام فأمنا وصلى عليه ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 2209,
			"arabicnumber": "952.03",
			"text": "حدثنا محمد بن عبيد الغبري، حدثنا حماد، عن أيوب، عن أبي الزبير، عن جابر، بن عبد الله ح . وحدثنا يحيى بن أيوب، - واللفظ له - حدثنا ابن علية، حدثنا أيوب، عن أبي، الزبير عن جابر بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن أخا لكم قد مات فقوموا فصلوا عليه ‏\"‏ ‏.‏ قال فقمنا فصفنا صفين ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 2210,
			"arabicnumber": "953",
			"text": "وحدثني زهير بن حرب، وعلي بن حجر، قالا حدثنا إسماعيل، ح وحدثنا يحيى، بن أيوب حدثنا ابن علية، عن أيوب، عن أبي قلابة، عن أبي المهلب، عن عمران بن حصين، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن أخا لكم قد مات فقوموا فصلوا عليه ‏\"‏ ‏.‏ يعني النجاشي وفي رواية زهير ‏\"‏ إن أخاكم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 2211,
			"arabicnumber": "954.01",
			"text": "حدثنا حسن بن الربيع، ومحمد بن عبد الله بن نمير، قالا حدثنا عبد الله بن، إدريس عن الشيباني، عن الشعبي، أن رسول الله صلى الله عليه وسلم صلى على قبر بعد ما دفن فكبر عليه أربعا ‏.‏ قال الشيباني فقلت للشعبي من حدثك بهذا قال الثقة عبد الله بن عباس ‏.‏ هذا لفظ حديث حسن وفي رواية ابن نمير قال انتهى رسول الله صلى الله عليه وسلم إلى قبر رطب فصلى عليه وصفوا خلفه وكبر أربعا ‏.‏ قلت لعامر من حدثك قال الثقة من شهده ابن عباس ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 2212,
			"arabicnumber": "954.02",
			"text": "وحدثنا يحيى بن يحيى، أخبرنا هشيم، ح وحدثنا حسن بن الربيع، وأبو كامل قالا حدثنا عبد الواحد بن زياد، ح وحدثنا إسحاق بن إبراهيم، أخبرنا جرير، ح وحدثني محمد بن حاتم، حدثنا وكيع، حدثنا سفيان، ح وحدثنا عبيد الله بن معاذ، حدثنا أبي ح، وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، قال حدثنا شعبة، كل هؤلاء عن الشيباني، عن الشعبي، عن ابن عباس، عن النبي صلى الله عليه وسلم بمثله وليس في حديث أحد منهم أن النبي صلى الله عليه وسلم كبر عليه أربعا ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 2213,
			"arabicnumber": "954.03",
			"text": "وحدثنا إسحاق بن إبراهيم، وهارون بن عبد الله، جميعا عن وهب بن جرير، عن شعبة، عن إسماعيل بن أبي خالد، ح وحدثني أبو غسان، محمد بن عمرو الرازي حدثنا يحيى بن الضريس، حدثنا إبراهيم بن طهمان، عن أبي حصين، كلاهما عن الشعبي، عن ابن عباس، عن النبي صلى الله عليه وسلم في صلاته على القبر نحو حديث الشيباني ‏.‏ ليس في حديثهم وكبر أربعا ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 2214,
			"arabicnumber": "955",
			"text": "وحدثني إبراهيم بن محمد بن عرعرة السامي، حدثنا غندر، حدثنا شعبة، عن حبيب بن الشهيد، عن ثابت، عن أنس، أن النبي صلى الله عليه وسلم صلى على قبر ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 2215,
			"arabicnumber": "956",
			"text": "وحدثني أبو الربيع الزهراني، وأبو كامل فضيل بن حسين الجحدري - واللفظ لأبي كامل - قالا حدثنا حماد، - وهو ابن زيد عن ثابت البناني، عن أبي رافع، عن أبي، هريرة أن امرأة، سوداء كانت تقم المسجد - أو شابا - ففقدها رسول الله صلى الله عليه وسلم فسأل عنها - أو عنه - فقالوا مات ‏.‏ قال ‏\"‏ أفلا كنتم آذنتموني ‏\"‏ ‏.‏ قال فكأنهم صغروا أمرها - أو أمره - فقال ‏\"‏ دلوني على قبره ‏\"‏ ‏.‏ فدلوه فصلى عليها ثم قال ‏\"‏ إن هذه القبور مملوءة ظلمة على أهلها وإن الله عز وجل ينورها لهم بصلاتي عليهم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 2216,
			"arabicnumber": "957",
			"text": "وحدثنا أبو بكر بن أبي شيبة، ومحمد بن المثنى، وابن، بشار قالوا حدثنا محمد، بن جعفر حدثنا شعبة، - وقال أبو بكر عن شعبة، - عن عمرو بن مرة، عن عبد الرحمن، بن أبي ليلى قال كان زيد يكبر على جنائزنا أربعا وإنه كبر على جنازة خمسا فسألته فقال كان رسول الله صلى الله عليه وسلم يكبرها ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 2217,
			"arabicnumber": "958.01",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، وزهير بن حرب، وابن، نمير قالوا حدثنا سفيان، عن الزهري، عن سالم، عن أبيه، عن عامر بن ربيعة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا رأيتم الجنازة فقوموا لها حتى تخلفكم أو توضع ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 2218,
			"arabicnumber": "958.02",
			"text": "وحدثناه قتيبة بن سعيد، حدثنا ليث، ح وحدثنا محمد بن رمح، أخبرنا الليث، ح وحدثني حرملة، أخبرنا ابن وهب، أخبرني يونس، جميعا عن ابن شهاب، بهذا الإسناد ‏.‏ وفي حديث يونس أنه سمع رسول الله صلى الله عليه وسلم يقول ح وحدثنا قتيبة بن سعيد حدثنا ليث ح وحدثنا ابن رمح أخبرنا الليث عن نافع عن ابن عمر عن عامر بن ربيعة عن النبي صلى الله عليه وسلم قال ‏ \"‏ إذا رأى أحدكم الجنازة فإن لم يكن ماشيا معها فليقم حتى تخلفه أو توضع من قبل أن تخلفه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 2219,
			"arabicnumber": "958.03",
			"text": "وحدثني أبو كامل، حدثنا حماد، ح وحدثني يعقوب بن إبراهيم، حدثنا إسماعيل، جميعا عن أيوب، ح وحدثنا ابن المثنى، حدثنا يحيى بن سعيد، عن عبيد الله، ح وحدثنا ابن المثنى، حدثنا ابن أبي عدي، عن ابن عون، ح وحدثني محمد بن رافع، حدثنا عبد الرزاق، أخبرنا ابن جريج، كلهم عن نافع، بهذا الإسناد ‏.‏ نحو حديث الليث بن سعد غير أن حديث، ابن جريج قال النبي صلى الله عليه وسلم ‏ \"‏ إذا رأى أحدكم الجنازة فليقم حين يراها حتى تخلفه إذا كان غير متبعها ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 2220,
			"arabicnumber": "959.01",
			"text": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن سهيل بن أبي صالح، عن أبيه، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا اتبعتم جنازة فلا تجلسوا حتى توضع ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 2221,
			"arabicnumber": "959.02",
			"text": "وحدثني سريج بن يونس، وعلي بن حجر، قالا حدثنا إسماعيل، - وهو ابن علية - عن هشام الدستوائي، ح وحدثنا محمد بن المثنى، - واللفظ له - حدثنا معاذ بن، هشام حدثني أبي، عن يحيى بن أبي كثير، قال حدثنا أبو سلمة بن عبد الرحمن، عن أبي، سعيد الخدري أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إذا رأيتم الجنازة فقوموا فمن تبعها فلا يجلس حتى توضع ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 2222,
			"arabicnumber": "960.01",
			"text": "وحدثني سريج بن يونس، وعلي بن حجر، قالا حدثنا إسماعيل، - وهو ابن علية - عن هشام الدستوائي، عن يحيى بن أبي كثير، عن عبيد الله بن مقسم، عن جابر، بن عبد الله قال مرت جنازة فقام لها رسول الله صلى الله عليه وسلم وقمنا معه فقلنا يا رسول الله إنها يهودية ‏.‏ فقال ‏ \"‏ إن الموت فزع فإذا رأيتم الجنازة فقوموا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 2223,
			"arabicnumber": "960.02",
			"text": "وحدثني محمد بن رافع، حدثنا عبد الرزاق، أخبرنا ابن جريج، أخبرني أبو الزبير، أنه سمع جابرا، يقول قام النبي صلى الله عليه وسلم لجنازة مرت به حتى توارت ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 2224,
			"arabicnumber": "960.03",
			"text": "وحدثني محمد بن رافع، حدثنا عبد الرزاق، عن ابن جريج، قال أخبرني أبو الزبير أيضا أنه سمع جابرا، يقول قام النبي صلى الله عليه وسلم وأصحابه لجنازة يهودي حتى توارت ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 2226,
			"arabicnumber": "961.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 2227,
			"arabicnumber": "962.01",
			"text": "وحدثنا قتيبة بن سعيد، حدثنا ليث، ح وحدثنا محمد بن رمح بن المهاجر، - واللفظ له - حدثنا الليث، عن يحيى بن سعيد، عن واقد بن عمرو بن سعد بن معاذ، أنه قال رآني نافع بن جبير ونحن في جنازة قائما وقد جلس ينتظر أن توضع الجنازة فقال لي ما يقيمك فقلت أنتظر أن توضع الجنازة لما يحدث أبو سعيد الخدري ‏.‏ فقال نافع فإن مسعود بن الحكم حدثني عن علي بن أبي طالب أنه قال قام رسول الله صلى الله عليه وسلم ثم قعد ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 2228,
			"arabicnumber": "962.02",
			"text": "وحدثني محمد بن المثنى، وإسحاق بن إبراهيم، وابن أبي عمر، جميعا عن الثقفي، - قال ابن المثنى حدثنا عبد الوهاب، - قال سمعت يحيى بن سعيد، قال أخبرني واقد، بن عمرو بن سعد بن معاذ الأنصاري أن نافع بن جبير، أخبره أن مسعود بن الحكم الأنصاري أخبره أنه، سمع علي بن أبي طالب، يقول في شأن الجنائز إن رسول الله صلى الله عليه وسلم قام ثم قعد ‏.‏ وإنما حدث بذلك لأن نافع بن جبير رأى واقد بن عمرو قام حتى وضعت الجنازة ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 2229,
			"arabicnumber": "962.03",
			"text": "وحدثنا أبو كريب، حدثنا ابن أبي زائدة، عن يحيى بن سعيد، بهذا الإسناد ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 2230,
			"arabicnumber": "962.04",
			"text": "وحدثني زهير بن حرب، حدثنا عبد الرحمن بن مهدي، حدثنا شعبة، عن محمد، بن المنكدر قال سمعت مسعود بن الحكم، يحدث عن علي، قال رأينا رسول الله صلى الله عليه وسلم قام فقمنا وقعد فقعدنا ‏.‏ يعني في الجنازة ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 2231,
			"arabicnumber": "962.05",
			"text": "وحدثناه محمد بن أبي بكر المقدمي، وعبيد الله بن سعيد، قالا حدثنا يحيى، - وهو القطان - عن شعبة، بهذا الإسناد ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 2233,
			"arabicnumber": "963.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 2234,
			"arabicnumber": "963.03",
			"text": "وحدثناه إسحاق بن إبراهيم، أخبرنا عبد الرحمن بن مهدي، حدثنا معاوية بن، صالح بالإسنادين جميعا ‏.‏ نحو حديث ابن وهب ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 2235,
			"arabicnumber": "964.01",
			"text": "وحدثنا يحيى بن يحيى التميمي، أخبرنا عبد الوارث بن سعيد، عن حسين بن، ذكوان قال حدثني عبد الله بن بريدة، عن سمرة بن جندب، قال صليت خلف النبي صلى الله عليه وسلم وصلى على أم كعب ماتت وهي نفساء فقام رسول الله صلى الله عليه وسلم للصلاة عليها وسطها ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 2236,
			"arabicnumber": "964.02",
			"text": "وحدثناه أبو بكر بن أبي شيبة، حدثنا ابن المبارك، ويزيد بن هارون، ح وحدثني علي بن حجر، أخبرنا ابن المبارك، والفضل بن موسى، كلهم عن حسين، بهذا الإسناد ولم يذكروا أم كعب ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 2237,
			"arabicnumber": "964.03",
			"text": "وحدثنا محمد بن المثنى، وعقبة بن مكرم العمي، قالا حدثنا ابن أبي عدي، عن حسين، عن عبد الله بن بريدة، قال قال سمرة بن جندب لقد كنت على عهد رسول الله صلى الله عليه وسلم غلاما فكنت أحفظ عنه فما يمنعني من القول إلا أن ها هنا رجالا هم أسن مني وقد صليت وراء رسول الله صلى الله عليه وسلم على امرأة ماتت في نفاسها فقام عليها رسول الله صلى الله عليه وسلم في الصلاة وسطها ‏.‏ وفي رواية ابن المثنى قال حدثني عبد الله بن بريدة قال فقام عليها للصلاة وسطها ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 2238,
			"arabicnumber": "965.01",
			"text": "حدثنا يحيى بن يحيى، وأبو بكر بن أبي شيبة - واللفظ ليحيى - قال أبو بكر حدثنا وقال، يحيى أخبرنا وكيع، عن مالك بن مغول، عن سماك بن حرب، عن جابر بن، سمرة قال أتي النبي صلى الله عليه وسلم بفرس معرورى فركبه حين انصرف من جنازة ابن الدحداح ونحن نمشي حوله ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 2239,
			"arabicnumber": "965.02",
			"text": "وحدثنا محمد بن المثنى، ومحمد بن بشار، - واللفظ لابن المثنى - قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن سماك بن حرب، عن جابر بن سمرة، قال صلى رسول الله صلى الله عليه وسلم على ابن الدحداح ثم أتي بفرس عرى فعقله رجل فركبه فجعل يتوقص به ونحن نتبعه نسعى خلفه - قال - فقال رجل من القوم إن النبي صلى الله عليه وسلم قال ‏\"‏ كم من عذق معلق - أو مدلى - في الجنة لابن الدحداح ‏\"‏ ‏.‏ أو قال شعبة ‏\"‏ لأبي الدحداح ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 2240,
			"arabicnumber": "966",
			"text": "حدثنا يحيى بن يحيى، أخبرنا عبد الله بن جعفر المسوري، عن إسماعيل بن، محمد بن سعد عن عامر بن سعد بن أبي وقاص، أن سعد بن أبي وقاص، قال في مرضه الذي هلك فيه الحدوا لي لحدا وانصبوا على اللبن نصبا كما صنع برسول الله صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 2241,
			"arabicnumber": "967",
			"text": "حدثنا يحيى بن يحيى، أخبرنا وكيع، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا غندر، ووكيع، جميعا عن شعبة، ح وحدثنا محمد بن المثنى، - واللفظ له - قال حدثنا يحيى، بن سعيد حدثنا شعبة، حدثنا أبو جمرة، عن ابن عباس، قال جعل في قبر رسول الله صلى الله عليه وسلم قطيفة حمراء ‏.‏ قال مسلم أبو جمرة اسمه نصر بن عمران وأبو التياح اسمه يزيد بن حميد ماتا بسرخس ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 2242,
			"arabicnumber": "968",
			"text": "وحدثني أبو الطاهر، أحمد بن عمرو حدثنا ابن وهب، أخبرني عمرو بن الحارث، ح وحدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، حدثني عمرو بن الحارث، - في رواية أبي الطاهر - أن أبا علي الهمداني، حدثه - وفي، رواية هارون - أن ثمامة بن، شفى حدثه قال كنا مع فضالة بن عبيد بأرض الروم برودس فتوفي صاحب لنا فأمر فضالة بن عبيد بقبره فسوي ثم قال سمعت رسول الله صلى الله عليه وسلم يأمر بتسويتها ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 2244,
			"arabicnumber": "969.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 2245,
			"arabicnumber": "970.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، عن ابن جريج، عن أبي، الزبير عن جابر، قال نهى رسول الله صلى الله عليه وسلم أن يجصص القبر وأن يقعد عليه وأن يبنى عليه ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 2246,
			"arabicnumber": "970.02",
			"text": "وحدثني هارون بن عبد الله، حدثنا حجاج بن محمد، ح وحدثني محمد بن رافع، حدثنا عبد الرزاق، جميعا عن ابن جريج، قال أخبرني أبو الزبير، أنه سمع جابر بن عبد، الله يقول سمعت النبي صلى الله عليه وسلم بمثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 2247,
			"arabicnumber": "970.03",
			"text": "وحدثنا يحيى بن يحيى، أخبرنا إسماعيل ابن علية، عن أيوب، عن أبي الزبير، عن جابر، قال نهي عن تقصيص القبور، ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 2248,
			"arabicnumber": "971.01",
			"text": "وحدثني زهير بن حرب، حدثنا جرير، عن سهيل، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لأن يجلس أحدكم على جمرة فتحرق ثيابه فتخلص إلى جلده خير له من أن يجلس على قبر ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 2249,
			"arabicnumber": "971.02",
			"text": "وحدثناه قتيبة بن سعيد، حدثنا عبد العزيز، - يعني الدراوردي ح وحدثنيه عمرو، الناقد حدثنا أبو أحمد الزبيري، حدثنا سفيان، كلاهما عن سهيل، بهذا الإسناد ‏.‏ نحوه.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 2250,
			"arabicnumber": "972.01",
			"text": "وحدثني علي بن حجر السعدي، حدثنا الوليد بن مسلم، عن ابن جابر، عن بسر، بن عبيد الله عن واثلة، عن أبي مرثد الغنوي، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا تجلسوا على القبور ولا تصلوا إليها ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 2251,
			"arabicnumber": "972.02",
			"text": "وحدثنا حسن بن الربيع البجلي، حدثنا ابن المبارك، عن عبد الرحمن بن يزيد، عن بسر بن عبيد الله، عن أبي إدريس الخولاني، عن واثلة بن الأسقع، عن أبي مرثد الغنوي، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ لا تصلوا إلى القبور ولا تجلسوا عليها‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 2252,
			"arabicnumber": "973.01",
			"text": "وحدثني علي بن حجر السعدي، وإسحاق بن إبراهيم الحنظلي، - واللفظ لإسحاق - قال علي حدثنا وقال، إسحاق أخبرنا عبد العزيز بن محمد، عن عبد الواحد بن حمزة، عن عباد بن عبد الله بن الزبير، أن عائشة، أمرت أن يمر، بجنازة سعد بن أبي وقاص في المسجد فتصلي عليه فأنكر الناس ذلك عليها فقالت ما أسرع ما نسي الناس ما صلى رسول الله صلى الله عليه وسلم على سهيل ابن البيضاء إلا في المسجد ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 2253,
			"arabicnumber": "973.02",
			"text": "وحدثني محمد بن حاتم، حدثنا بهز، حدثنا وهيب، حدثنا موسى بن عقبة، عن عبد الواحد، عن عباد بن عبد الله بن الزبير، يحدث عن عائشة، أنها لما توفي سعد بن أبي وقاص أرسل أزواج النبي صلى الله عليه وسلم أن يمروا بجنازته في المسجد فيصلين عليه ففعلوا فوقف به على حجرهن يصلين عليه أخرج به من باب الجنائز الذي كان إلى المقاعد فبلغهن أن الناس عابوا ذلك وقالوا ما كانت الجنائز يدخل بها المسجد ‏.‏ فبلغ ذلك عائشة فقالت ما أسرع الناس إلى أن يعيبوا ما لا علم لهم به ‏.‏ عابوا علينا أن يمر بجنازة في المسجد وما صلى رسول الله صلى الله عليه وسلم على سهيل ابن بيضاء إلا في جوف المسجد ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 2254,
			"arabicnumber": "973.03",
			"text": "وحدثني هارون بن عبد الله، ومحمد بن رافع، - واللفظ لابن رافع - قالا حدثنا ابن أبي فديك، أخبرنا الضحاك، - يعني ابن عثمان - عن أبي النضر، عن أبي سلمة بن، عبد الرحمن أن عائشة، لما توفي سعد بن أبي وقاص قالت ادخلوا به المسجد حتى أصلي عليه ‏.‏ فأنكر ذلك عليها فقالت والله لقد صلى رسول الله صلى الله عليه وسلم على ابنى بيضاء في المسجد سهيل وأخيه ‏.‏ قال مسلم سهيل بن دعد وهو ابن البيضاء أمه بيضاء ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 2255,
			"arabicnumber": "974.01",
			"text": "حدثنا يحيى بن يحيى التميمي، ويحيى بن أيوب، وقتيبة بن سعيد، قال يحيى بن يحيى أخبرنا وقال الآخران، حدثنا إسماعيل بن جعفر، عن شريك، - وهو ابن أبي نمر - عن عطاء بن يسار، عن عائشة، أنها قالت كان رسول الله صلى الله عليه وسلم - كلما كان ليلتها من رسول الله صلى الله عليه وسلم - يخرج من آخر الليل إلى البقيع فيقول ‏\"‏ السلام عليكم دار قوم مؤمنين وأتاكم ما توعدون غدا مؤجلون وإنا إن شاء الله بكم لاحقون اللهم اغفر لأهل بقيع الغرقد ‏\"‏ ‏.‏ ولم يقم قتيبة قوله ‏\"‏ وأتاكم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 2256,
			"arabicnumber": "974.02",
			"text": "وحدثني هارون بن سعيد الأيلي، حدثنا عبد الله بن وهب، أخبرنا ابن جريج، عن عبد الله بن كثير بن المطلب، أنه سمع محمد بن قيس، يقول سمعت عائشة، تحدث فقالت ألا أحدثكم عن النبي صلى الله عليه وسلم وعني ‏.‏ قلنا بلى ح. وحدثني من، سمع حجاجا الأعور، - واللفظ له - قال حدثنا حجاج بن محمد، حدثنا ابن جريج، أخبرني عبد الله، - رجل من قريش - عن محمد بن قيس بن مخرمة، بن المطلب أنه قال يوما ألا أحدثكم عني وعن أمي قال فظننا أنه يريد أمه التي ولدته ‏.‏ قال قالت عائشة ألا أحدثكم عني وعن رسول الله صلى الله عليه وسلم ‏.‏ قلنا بلى ‏.‏ قال قالت لما كانت ليلتي التي كان النبي صلى الله عليه وسلم فيها عندي انقلب فوضع رداءه وخلع نعليه فوضعهما عند رجليه وبسط طرف إزاره على فراشه فاضطجع فلم يلبث إلا ريثما ظن أن قد رقدت فأخذ رداءه رويدا وانتعل رويدا وفتح الباب فخرج ثم أجافه رويدا فجعلت درعي في رأسي واختمرت وتقنعت إزاري ثم انطلقت على إثره حتى جاء البقيع فقام فأطال القيام ثم رفع يديه ثلاث مرات ثم انحرف فانحرفت فأسرع فأسرعت فهرول فهرولت فأحضر فأحضرت فسبقته فدخلت فليس إلا أن اضطجعت فدخل فقال ‏\"‏ ما لك يا عائش حشيا رابية ‏\"‏ ‏.‏ قالت قلت لا شىء ‏.‏ قال ‏\"‏ لتخبريني أو ليخبرني اللطيف الخبير ‏\"‏ ‏.‏ قالت قلت يا رسول الله بأبي أنت وأمي ‏.‏ فأخبرته قال ‏\"‏ فأنت السواد الذي رأيت أمامي ‏\"‏ ‏.‏ قلت نعم ‏.‏ فلهدني في صدري لهدة أوجعتني ثم قال ‏\"‏ أظننت أن يحيف الله عليك ورسوله ‏\"‏ ‏.‏ قالت مهما يكتم الناس يعلمه الله نعم ‏.‏ قال ‏\"‏ فإن جبريل أتاني حين رأيت فناداني فأخفاه منك فأجبته فأخفيته منك ولم يكن يدخل عليك وقد وضعت ثيابك وظننت أن قد رقدت فكرهت أن أوقظك وخشيت أن تستوحشي فقال إن ربك يأمرك أن تأتي أهل البقيع فتستغفر لهم ‏\"‏ ‏.‏ قالت قلت كيف أقول لهم يا رسول الله قال ‏\"‏ قولي السلام على أهل الديار من المؤمنين والمسلمين ويرحم الله المستقدمين منا والمستأخرين وإنا إن شاء الله بكم للاحقون ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 2257,
			"arabicnumber": "975",
			"text": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، قالا حدثنا محمد بن عبد الله، الأسدي عن سفيان، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، قال كان رسول الله صلى الله عليه وسلم يعلمهم إذا خرجوا إلى المقابر فكان قائلهم يقول - في رواية أبي بكر - السلام على أهل الديار - وفي رواية زهير - السلام عليكم أهل الديار من المؤمنين والمسلمين وإنا إن شاء الله للاحقون أسأل الله لنا ولكم العافية",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 2258,
			"arabicnumber": "976.01",
			"text": "حدثنا يحيى بن أيوب، ومحمد بن عباد، - واللفظ ليحيى - قالا حدثنا مروان، بن معاوية عن يزيد، - يعني ابن كيسان - عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ استأذنت ربي أن أستغفر لأمي فلم يأذن لي واستأذنته أن أزور قبرها فأذن لي ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 2259,
			"arabicnumber": "976.02",
			"text": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، قالا حدثنا محمد بن عبيد، عن يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، قال زار النبي صلى الله عليه وسلم قبر أمه فبكى وأبكى من حوله فقال ‏ \"‏ استأذنت ربي في أن أستغفر لها فلم يؤذن لي واستأذنته في أن أزور قبرها فأذن لي فزوروا القبور فإنها تذكر الموت ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 2260,
			"arabicnumber": "977.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن عبد الله بن نمير، ومحمد بن المثنى، - واللفظ لأبي بكر وابن نمير - قالوا حدثنا محمد بن فضيل، عن أبي سنان، - وهو ضرار بن مرة - عن محارب بن دثار، عن ابن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ نهيتكم عن زيارة القبور فزوروها ونهيتكم عن لحوم الأضاحي فوق ثلاث فأمسكوا ما بدا لكم ونهيتكم عن النبيذ إلا في سقاء فاشربوا في الأسقية كلها ولا تشربوا مسكرا ‏\"‏ ‏.‏ قال ابن نمير في روايته عن عبد الله بن بريدة عن أبيه ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 2261,
			"arabicnumber": "977.02",
			"text": "وحدثنا يحيى بن يحيى، أخبرنا أبو خيثمة، عن زبيد اليامي، عن محارب بن دثار، عن ابن بريدة، أراه عن أبيه، - الشك من أبي خيثمة - عن النبي صلى الله عليه وسلم ح . وحدثنا أبو بكر بن أبي شيبة، حدثنا قبيصة بن عقبة، عن سفيان، عن علقمة، بن مرثد عن سليمان بن بريدة، عن أبيه، عن النبي صلى الله عليه وسلم ح . وحدثنا ابن أبي عمر، ومحمد بن رافع، وعبد بن حميد، جميعا عن عبد الرزاق، عن معمر، عن عطاء الخراساني، قال حدثني عبد الله بن بريدة، عن أبيه، عن النبي صلى الله عليه وسلم كلهم بمعنى حديث أبي سنان ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 2262,
			"arabicnumber": "978",
			"text": "حدثنا عون بن سلام الكوفي، أخبرنا زهير، عن سماك، عن جابر بن سمرة، قال أتي النبي صلى الله عليه وسلم برجل قتل نفسه بمشاقص فلم يصل عليه ‏.‏",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 138
			}
		}
	]
}