{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"19": "The Book of Invoking Curses"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3743,
			"arabicnumber": "1492.01",
			"text": "وحدثنا يحيى بن يحيى، قال قرأت على مالك عن ابن شهاب، أن سهل بن سعد، الساعدي أخبره أن عويمرا العجلاني جاء إلى عاصم بن عدي الأنصاري فقال له أرأيت يا عاصم لو أن رجلا وجد مع امرأته رجلا أيقتله فتقتلونه أم كيف يفعل فسل لي عن ذلك يا عاصم رسول الله صلى الله عليه وسلم ‏.‏ فسأل عاصم رسول الله صلى الله عليه وسلم فكره رسول الله صلى الله عليه وسلم المسائل وعابها حتى كبر على عاصم ما سمع من رسول الله صلى الله عليه وسلم فلما رجع عاصم إلى أهله جاءه عويمر فقال يا عاصم ماذا قال لك رسول الله صلى الله عليه وسلم قال عاصم لعويمر لم تأتني بخير قد كره رسول الله صلى الله عليه وسلم المسألة التي سألته عنها ‏.‏ قال عويمر والله لا أنتهي حتى أسأله عنها ‏.‏ فأقبل عويمر حتى أتى رسول الله صلى الله عليه وسلم وسط الناس فقال يا رسول الله أرأيت رجلا وجد مع امرأته رجلا أيقتله فتقتلونه أم كيف يفعل فقال رسول الله صلى الله عليه وسلم ‏ \"‏ قد نزل فيك وفي صاحبتك فاذهب فأت بها ‏\"‏ ‏.‏ قال سهل فتلاعنا وأنا مع الناس عند رسول الله صلى الله عليه وسلم فلما فرغا قال عويمر كذبت عليها يا رسول الله إن أمسكتها ‏.‏ فطلقها ثلاثا قبل أن يأمره رسول الله صلى الله عليه وسلم ‏.‏ قال ابن شهاب فكانت سنة المتلاعنين ‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3744,
			"arabicnumber": "1492.02",
			"text": "وحدثني حرملة بن يحيى، أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، أخبرني سهل بن سعد الأنصاري، أن عويمرا الأنصاري، من بني العجلان أتى عاصم بن عدي ‏.‏ وساق الحديث بمثل حديث مالك وأدرج في الحديث قوله وكان فراقه إياها بعد سنة في المتلاعنين ‏.‏ وزاد فيه قال سهل فكانت حاملا فكان ابنها يدعى إلى أمه ‏.‏ ثم جرت السنة أنه يرثها وترث منه ما فرض الله لها ‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3745,
			"arabicnumber": "1492.03",
			"text": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق، أخبرنا ابن جريج، أخبرني ابن شهاب، عن المتلاعنين، وعن السنة، فيهما عن حديث، سهل بن سعد أخي بني ساعدة أن رجلا، من الأنصار جاء إلى النبي صلى الله عليه وسلم فقال يا رسول الله أرأيت رجلا وجد مع امرأته رجلا وذكر الحديث بقصته ‏.‏ وزاد فيه فتلاعنا في المسجد وأنا شاهد ‏.‏ وقال في الحديث فطلقها ثلاثا قبل أن يأمره رسول الله صلى الله عليه وسلم ‏.‏ ففارقها عند النبي صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم ‏ \"‏ ذاكم التفريق بين كل متلاعنين ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3746,
			"arabicnumber": "1493.01",
			"text": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي ح، وحدثنا أبو بكر بن أبي شيبة، - واللفظ له - حدثنا عبد الله بن نمير، حدثنا عبد الملك بن أبي سليمان، عن سعيد بن، جبير قال سئلت عن المتلاعنين، في إمرة مصعب أيفرق بينهما قال فما دريت ما أقول فمضيت إلى منزل ابن عمر بمكة فقلت للغلام استأذن لي ‏.‏ قال إنه قائل فسمع صوتي ‏.‏ قال ابن جبير قلت نعم ‏.‏ قال ادخل فوالله ما جاء بك هذه الساعة إلا حاجة فدخلت فإذا هو مفترش برذعة متوسد وسادة حشوها ليف قلت أبا عبد الرحمن المتلاعنان أيفرق بينهما قال سبحان الله نعم إن أول من سأل عن ذلك فلان بن فلان قال يا رسول الله أرأيت أن لو وجد أحدنا امرأته على فاحشة كيف يصنع إن تكلم تكلم بأمر عظيم ‏.‏ وإن سكت سكت على مثل ذلك قال فسكت النبي صلى الله عليه وسلم فلم يجبه فلما كان بعد ذلك أتاه فقال إن الذي سألتك عنه قد ابتليت به ‏.‏ فأنزل الله عز وجل هؤلاء الآيات في سورة النور ‏{‏ والذين يرمون أزواجهم‏}‏ فتلاهن عليه ووعظه وذكره وأخبره أن عذاب الدنيا أهون من عذاب الآخرة قال لا والذي بعثك بالحق ما كذبت عليها ‏.‏ ثم دعاها فوعظها وذكرها وأخبرها أن عذاب الدنيا أهون من عذاب الآخرة ‏.‏ قالت لا والذي بعثك بالحق إنه لكاذب فبدأ بالرجل فشهد أربع شهادات بالله إنه لمن الصادقين والخامسة أن لعنة الله عليه إن كان من الكاذبين ثم ثنى بالمرأة فشهدت أربع شهادات بالله إنه لمن الكاذبين والخامسة أن غضب الله عليها إن كان من الصادقين ثم فرق بينهما.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3747,
			"arabicnumber": "1493.02",
			"text": "وحدثنيه علي بن حجر السعدي، حدثنا عيسى بن يونس، حدثنا عبد الملك بن، أبي سليمان قال سمعت سعيد بن جبير، قال سئلت عن المتلاعنين، زمن مصعب بن الزبير فلم أدر ما أقول فأتيت عبد الله بن عمر فقلت أرأيت المتلاعنين أيفرق بينهما ثم ذكر بمثل حديث ابن نمير ‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 3748,
			"arabicnumber": "1493.03",
			"text": "وحدثنا يحيى بن يحيى، وأبو بكر بن أبي شيبة وزهير بن حرب - واللفظ ليحيى - قال يحيى أخبرنا وقال الآخران، حدثنا سفيان بن عيينة، عن عمرو، عن سعيد بن، جبير عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم للمتلاعنين ‏\"‏ حسابكما على الله أحدكما كاذب لا سبيل لك عليها ‏\"‏ ‏.‏ قال يا رسول الله مالي قال ‏\"‏ لا مال لك إن كنت صدقت عليها فهو بما استحللت من فرجها وإن كنت كذبت عليها فذاك أبعد لك منها ‏\"‏ ‏.‏ قال زهير في روايته حدثنا سفيان عن عمرو سمع سعيد بن جبير يقول سمعت ابن عمر يقول قال رسول الله صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3749,
			"arabicnumber": "1493.04",
			"text": "وحدثني أبو الربيع الزهراني، حدثنا حماد، عن أيوب، عن سعيد بن جبير، عن ابن عمر، قال فرق رسول الله صلى الله عليه وسلم بين أخوى بني العجلان وقال ‏ \"‏ الله يعلم أن أحدكما كاذب فهل منكما تائب ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3750,
			"arabicnumber": "1493.05",
			"text": "وحدثناه ابن أبي عمر، حدثنا سفيان، عن أيوب، سمع سعيد بن جبير، قال سألت ابن عمر عن اللعان، ‏.‏ فذكر عن النبي صلى الله عليه وسلم بمثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3751,
			"arabicnumber": "1493.06",
			"text": "وحدثنا أبو غسان المسمعي، ومحمد بن المثنى، وابن، بشار - واللفظ للمسمعي وابن المثنى - قالوا حدثنا معاذ، - وهو ابن هشام - قال حدثني أبي، عن قتادة، عن عزرة، عن سعيد بن جبير، قال لم يفرق المصعب بين المتلاعنين ‏.‏ قال سعيد فذكر ذلك لعبد الله بن عمر ‏.‏ فقال فرق نبي الله صلى الله عليه وسلم بين أخوى بني العجلان ‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3752,
			"arabicnumber": "1494.01",
			"text": "وحدثنا سعيد بن منصور، وقتيبة بن سعيد، قالا حدثنا مالك، ح وحدثنا يحيى، بن يحيى - واللفظ له - قال قلت لمالك حدثك نافع، عن ابن عمر، أن رجلا، لاعن امرأته على عهد رسول الله صلى الله عليه وسلم ففرق رسول الله صلى الله عليه وسلم بينهما وألحق الولد بأمه قال نعم ‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3753,
			"arabicnumber": "1494.02",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، ح وحدثنا ابن نمير، حدثنا أبي، قالا حدثنا عبيد الله، عن نافع، عن ابن عمر، قال لاعن رسول الله صلى الله عليه وسلم بين رجل من الأنصار وامرأته وفرق بينهما ‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3754,
			"arabicnumber": "1494.03",
			"text": "وحدثناه محمد بن المثنى، وعبيد الله بن سعيد، قالا حدثنا يحيى، - وهو القطان - عن عبيد الله، بهذا الإسناد ‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3755,
			"arabicnumber": "1495.01",
			"text": "حدثنا زهير بن حرب، وعثمان بن أبي شيبة، وإسحاق بن إبراهيم، - واللفظ لزهير - قال إسحاق أخبرنا وقال الآخران، حدثنا جرير، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، قال إنا ليلة الجمعة في المسجد إذ جاء رجل من الأنصار فقال لو أن رجلا وجد مع امرأته رجلا فتكلم جلدتموه أو قتل قتلتموه وإن سكت سكت على غيظ والله لأسألن عنه رسول الله صلى الله عليه وسلم ‏.‏ فلما كان من الغد أتى رسول الله صلى الله عليه وسلم فسأله فقال لو أن رجلا وجد مع امرأته رجلا فتكلم جلدتموه أو قتل قتلتموه أو سكت سكت على غيظ ‏.‏ فقال ‏\"‏ اللهم افتح ‏\"‏ ‏.‏ وجعل يدعو فنزلت آية اللعان ‏{‏ والذين يرمون أزواجهم ولم يكن لهم شهداء إلا أنفسهم‏}‏ هذه الآيات فابتلي به ذلك الرجل من بين الناس فجاء هو وامرأته إلى رسول الله صلى الله عليه وسلم فتلاعنا فشهد الرجل أربع شهادات بالله إنه لمن الصادقين ثم لعن الخامسة أن لعنة الله عليه إن كان من الكاذبين فذهبت لتلعن فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ مه ‏\"‏ ‏.‏ فأبت فلعنت فلما أدبرا قال ‏\"‏ لعلها أن تجيء به أسود جعدا ‏\"‏ ‏.‏ فجاءت به أسود جعدا‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3756,
			"arabicnumber": "1495.02",
			"text": "وحدثناه إسحاق بن إبراهيم، أخبرنا عيسى بن يونس، ح وحدثنا أبو بكر بن، أبي شيبة حدثنا عبدة بن سليمان، جميعا عن الأعمش، بهذا الإسناد نحوه ‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3757,
			"arabicnumber": "1496",
			"text": "وحدثنا محمد بن المثنى، حدثنا عبد الأعلى، حدثنا هشام، عن محمد، قال سألت أنس بن مالك وأنا أرى، أن عنده، منه علما ‏.‏ فقال إن هلال بن أمية قذف امرأته بشريك ابن سحماء وكان أخا البراء بن مالك لأمه وكان أول رجل لاعن في الإسلام - قال - فلاعنها فقال رسول الله صلى الله عليه وسلم ‏ \"‏ أبصروها فإن جاءت به أبيض سبطا قضيء العينين فهو لهلال بن أمية وإن جاءت به أكحل جعدا حمش الساقين فهو لشريك ابن سحماء ‏\"‏ ‏.‏ قال فأنبئت أنها جاءت به أكحل جعدا حمش الساقين ‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3758,
			"arabicnumber": "1497.01",
			"text": "وحدثنا محمد بن رمح بن المهاجر، وعيسى بن حماد المصريان، - واللفظ لابن رمح - قالا أخبرنا الليث، عن يحيى بن سعيد، عن عبد الرحمن بن القاسم، عن القاسم، بن محمد عن ابن عباس، أنه قال ذكر التلاعن عند رسول الله صلى الله عليه وسلم فقال عاصم بن عدي في ذلك قولا ثم انصرف فأتاه رجل من قومه يشكو إليه أنه وجد مع أهله رجلا ‏.‏ فقال عاصم ما ابتليت بهذا إلا لقولي فذهب به إلى رسول الله صلى الله عليه وسلم فأخبره بالذي وجد عليه امرأته وكان ذلك الرجل مصفرا قليل اللحم سبط الشعر وكان الذي ادعى عليه أنه وجد عند أهله خدلا آدم كثير اللحم فقال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم بين ‏\"‏ ‏.‏ فوضعت شبيها بالرجل الذي ذكر زوجها أنه وجده عندها فلاعن رسول الله صلى الله عليه وسلم بينهما فقال رجل لابن عباس في المجلس أهي التي قال رسول الله صلى الله عليه وسلم ‏\"‏ لو رجمت أحدا بغير بينة رجمت هذه ‏\"‏ ‏.‏ فقال ابن عباس لا تلك امرأة كانت تظهر في الإسلام السوء ‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 3759,
			"arabicnumber": "1497.02",
			"text": "وحدثنيه أحمد بن يوسف الأزدي، حدثنا إسماعيل بن أبي أويس، حدثني سليمان، - يعني ابن بلال - عن يحيى، حدثني عبد الرحمن بن القاسم، عن القاسم بن محمد، عن ابن عباس، أنه قال ذكر المتلاعنان عند رسول الله صلى الله عليه وسلم ‏.‏ بمثل حديث الليث وزاد فيه بعد قوله كثير اللحم قال جعدا قططا ‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 3760,
			"arabicnumber": "1497.03",
			"text": "وحدثنا عمرو الناقد، وابن أبي عمر، - واللفظ لعمرو - قالا حدثنا سفيان بن، عيينة عن أبي الزناد، عن القاسم بن محمد، قال قال عبد الله بن شداد وذكر المتلاعنان عند ابن عباس فقال ابن شداد أهما اللذان قال النبي صلى الله عليه وسلم ‏ \"‏ لو كنت راجما أحدا بغير بينة لرجمتها ‏\"‏ ‏.‏ فقال ابن عباس لا تلك امرأة أعلنت ‏.‏ قال ابن أبي عمر في روايته عن القاسم بن محمد قال سمعت ابن عباس ‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 3761,
			"arabicnumber": "1498.01",
			"text": "حدثنا قتيبة بن سعيد، حدثنا عبد العزيز، - يعني الدراوردي - عن سهيل، عن أبيه، عن أبي هريرة، أن سعد بن عبادة الأنصاري، قال يا رسول الله أرأيت الرجل يجد مع امرأته رجلا أيقتله قال رسول الله صلى الله عليه وسلم ‏\"‏ لا ‏\"‏ ‏.‏ قال سعد بلى والذي أكرمك بالحق ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اسمعوا إلى ما يقول سيدكم ‏\"‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 3762,
			"arabicnumber": "1498.02",
			"text": "وحدثني زهير بن حرب، حدثني إسحاق بن عيسى، حدثنا مالك، عن سهيل، عن أبيه، عن أبي هريرة، أن سعد بن عبادة، قال يا رسول الله إن وجدت مع امرأتي رجلا أأمهله حتى آتي بأربعة شهداء قال ‏ \"‏ نعم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 3763,
			"arabicnumber": "1498.03",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا خالد بن مخلد، عن سليمان بن بلال، حدثني سهيل، عن أبيه، عن أبي هريرة، قال قال سعد بن عبادة يا رسول الله لو وجدت مع أهلي رجلا لم أمسه حتى آتي بأربعة شهداء قال رسول الله صلى الله عليه وسلم ‏\"‏ نعم ‏\"‏ ‏.‏ قال كلا والذي بعثك بالحق إن كنت لأعاجله بالسيف قبل ذلك ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ اسمعوا إلى ما يقول سيدكم إنه لغيور وأنا أغير منه والله أغير مني ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 3764,
			"arabicnumber": "1499.01",
			"text": "حدثني عبيد الله بن عمر القواريري، وأبو كامل فضيل بن حسين الجحدري - واللفظ لأبي كامل - قالا حدثنا أبو عوانة، عن عبد الملك بن عمير، عن وراد، - كاتب المغيرة - عن المغيرة بن شعبة، قال قال سعد بن عبادة لو رأيت رجلا مع امرأتي لضربته بالسيف غير مصفح عنه ‏.‏ فبلغ ذلك رسول الله صلى الله عليه وسلم فقال ‏ \"‏ أتعجبون من غيرة سعد فوالله لأنا أغير منه والله أغير مني من أجل غيرة الله حرم الفواحش ما ظهر منها وما بطن ولا شخص أغير من الله ولا شخص أحب إليه العذر من الله من أجل ذلك بعث الله المرسلين مبشرين ومنذرين ولا شخص أحب إليه المدحة من الله من أجل ذلك وعد الله الجنة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 3765,
			"arabicnumber": "1499.02",
			"text": "وحدثناه أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن عبد الملك، بن عمير بهذا الإسناد مثله ‏.‏ وقال غير مصفح ‏.‏ ولم يقل عنه ‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 3766,
			"arabicnumber": "1500.01",
			"text": "وحدثناه قتيبة بن سعيد، وأبو بكر بن أبي شيبة وعمرو الناقد وزهير بن حرب - واللفظ لقتيبة - قالوا حدثنا سفيان بن عيينة، عن الزهري، عن سعيد بن المسيب، عن أبي هريرة، قال جاء رجل من بني فزارة إلى النبي صلى الله عليه وسلم فقال إن امرأتي ولدت غلاما أسود ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ هل لك من إبل ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ فما ألوانها ‏\"‏ ‏.‏ قال حمر ‏.‏ قال ‏\"‏ هل فيها من أورق ‏\"‏ ‏.‏ قال إن فيها لورقا ‏.‏ قال ‏\"‏ فأنى أتاها ذلك ‏\"‏ ‏.‏ قال عسى أن يكون نزعه عرق ‏.‏ قال ‏\"‏ وهذا عسى أن يكون نزعه عرق ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 3767,
			"arabicnumber": "1500.02",
			"text": "وحدثنا إسحاق بن إبراهيم، ومحمد بن رافع، وعبد بن حميد، قال ابن رافع حدثنا وقال الآخران، أخبرنا عبد الرزاق، أخبرنا معمر، ح وحدثنا ابن رافع، حدثنا ابن، أبي فديك أخبرنا ابن أبي ذئب، جميعا عن الزهري، بهذا الإسناد ‏.‏ نحو حديث ابن عيينة ‏.‏ غير أن في، حديث معمر فقال يا رسول الله ولدت امرأتي غلاما أسود وهو حينئذ يعرض بأن ينفيه ‏.‏ وزاد في آخر الحديث ولم يرخص له في الانتفاء منه ‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 3768,
			"arabicnumber": "1500.03",
			"text": "وحدثني أبو الطاهر، وحرملة بن يحيى، - واللفظ لحرملة - قالا أخبرنا ابن، وهب أخبرني يونس، عن ابن شهاب، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، أنصلى الله عليه وسلم فقال يا رسول الله إن امرأتي ولدت غلاما أسود وإني أنكرته ‏.‏ فقال له النبي صلى الله عليه وسلم ‏\"‏ هل لك من إبل ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ ما ألوانها ‏\"‏ ‏.‏ قال حمر ‏.‏ قال ‏\"‏ فهل فيها من أورق ‏\"‏ ‏.‏ قال نعم ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ فأنى هو ‏\"‏ ‏.‏ قال لعله يا رسول الله يكون نزعه عرق له ‏.‏ فقال له النبي صلى الله عليه وسلم ‏\"‏ وهذا لعله يكون نزعه عرق له ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 3769,
			"arabicnumber": "1500.04",
			"text": "وحدثني محمد بن رافع، حدثنا حجين، حدثنا الليث، عن عقيل، عن ابن شهاب، أنه قال بلغنا أن أبا هريرة، كان يحدث عن رسول الله صلى الله عليه وسلم بنحو حديثهم‏.‏",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 27
			}
		}
	]
}