{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"21": "The Book of Transactions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3801,
			"arabicnumber": "1511.01",
			"text": "حدثنا يحيى بن يحيى التميمي، قال قرأت على مالك عن محمد بن يحيى بن، حبان عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم نهى عن الملامسة والمنابذة ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3802,
			"arabicnumber": "1511.02",
			"text": "وحدثنا أبو كريب، وابن أبي عمر، قالا حدثنا وكيع، عن سفيان، عن أبي الزناد، عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3803,
			"arabicnumber": "1511.03",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا ابن نمير، وأبو أسامة ح وحدثنا محمد، بن عبد الله بن نمير حدثنا أبي ح، وحدثنا محمد بن المثنى، حدثنا عبد الوهاب، كلهم عن عبيد الله بن عمر، عن خبيب بن عبد الرحمن، عن حفص بن عاصم، عن أبي هريرة، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3804,
			"arabicnumber": "1511.04",
			"text": "وحدثنا قتيبة بن سعيد، حدثنا يعقوب، - يعني ابن عبد الرحمن - عن سهيل، بن أبي صالح عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏.‏ مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3805,
			"arabicnumber": "1511.05",
			"text": "وحدثني محمد بن رافع، حدثنا عبد الرزاق، أخبرنا ابن جريج، أخبرني عمرو، بن دينار عن عطاء بن ميناء، أنه سمعه يحدث، عن أبي هريرة، أنه قال نهي عن بيعتين، الملامسة والمنابذة ‏.‏ أما الملامسة فأن يلمس كل واحد منهما ثوب صاحبه بغير تأمل والمنابذة أن ينبذ كل واحد منهما ثوبه إلى الآخر ولم ينظر واحد منهما إلى ثوب صاحبه‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 3806,
			"arabicnumber": "1512.01",
			"text": "وحدثني أبو الطاهر، وحرملة بن يحيى، - واللفظ لحرملة - قالا أخبرنا ابن، وهب أخبرني يونس، عن ابن شهاب، أخبرني عامر بن سعد بن أبي وقاص، أن أبا سعيد، الخدري قال نهانا رسول الله صلى الله عليه وسلم عن بيعتين ولبستين نهى عن الملامسة والمنابذة في البيع ‏.‏ والملامسة لمس الرجل ثوب الآخر بيده بالليل أو بالنهار ولا يقلبه إلا بذلك والمنابذة أن ينبذ الرجل إلى الرجل بثوبه وينبذ الآخر إليه ثوبه ويكون ذلك بيعهما من غير نظر ولا تراض ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3807,
			"arabicnumber": "1512.02",
			"text": "وحدثنيه عمرو الناقد، حدثنا يعقوب بن إبراهيم بن سعد، حدثنا أبي، عن صالح، عن ابن شهاب، بهذا الإسناد ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3808,
			"arabicnumber": "1513",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن إدريس، ويحيى بن سعيد، وأبو أسامة عن عبيد الله، ح وحدثني زهير بن حرب، - واللفظ له - حدثنا يحيى بن سعيد، عن عبيد الله، حدثني أبو الزناد، عن الأعرج، عن أبي هريرة، قال نهى رسول الله صلى الله عليه وسلم عن بيع الحصاة وعن بيع الغرر ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3809,
			"arabicnumber": "1514.01",
			"text": "حدثنا يحيى بن يحيى، ومحمد بن رمح، قالا أخبرنا الليث، ح وحدثنا قتيبة بن، سعيد حدثنا ليث، عن نافع، عن عبد الله، عن رسول الله صلى الله عليه وسلم أنه نهى عن بيع حبل الحبلة ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3810,
			"arabicnumber": "1514.02",
			"text": "حدثني زهير بن حرب، ومحمد بن المثنى، - واللفظ لزهير - قالا حدثنا يحيى، - وهو القطان - عن عبيد الله، أخبرني نافع، عن ابن عمر، قال كان أهل الجاهلية يتبايعون لحم الجزور إلى حبل الحبلة ‏.‏ وحبل الحبلة أن تنتج الناقة ثم تحمل التي نتجت فنهاهم رسول الله صلى الله عليه وسلم عن ذلك ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3811,
			"arabicnumber": "1412.05",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا يبع بعضكم على بيع بعض ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3812,
			"arabicnumber": "1412.06",
			"text": "حدثنا زهير بن حرب، ومحمد بن المثنى، - واللفظ لزهير - قالا حدثنا يحيى، عن عبيد الله، أخبرني نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏ \"‏ لا يبع الرجل على بيع أخيه ولا يخطب على خطبة أخيه إلا أن يأذن له ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3813,
			"arabicnumber": "1515.01",
			"text": "حدثنا يحيى بن أيوب، وقتيبة بن سعيد، وابن، حجر قالوا حدثنا إسماعيل، - وهو ابن جعفر - عن العلاء، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا يسم المسلم على سوم أخيه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3814,
			"arabicnumber": "1515.02",
			"text": "وحدثنيه أحمد بن إبراهيم الدورقي، حدثني عبد الصمد، حدثنا شعبة، عن العلاء، وسهيل عن أبيهما، عن أبي هريرة، عن النبي صلى الله عليه وسلم ح. وحدثناه محمد بن المثنى، حدثنا عبد الصمد، حدثنا شعبة، عن الأعمش، عن أبي، صالح عن أبي هريرة، عن النبي صلى الله عليه وسلم ح. وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن عدي، - وهو ابن ثابت - عن أبي حازم، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم نهى أن يستام الرجل على سوم أخيه ‏.‏ وفي رواية الدورقي على سيمة أخيه ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3815,
			"arabicnumber": "1515.03",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا يتلقى الركبان لبيع ولا يبع بعضكم على بيع بعض ولا تناجشوا ولا يبع حاضر لباد ولا تصروا الإبل والغنم فمن ابتاعها بعد ذلك فهو بخير النظرين بعد أن يحلبها فإن رضيها أمسكها وإن سخطها ردها وصاعا من تمر ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3816,
			"arabicnumber": "1515.04",
			"text": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن عدي، - وهو ابن ثابت - عن أبي حازم، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم نهى عن التلقي للركبان وأن يبيع حاضر لباد وأن تسأل المرأة طلاق أختها وعن النجش والتصرية وأن يستام الرجل على سوم أخيه ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 3817,
			"arabicnumber": "1515.05",
			"text": "وحدثنيه أبو بكر بن نافع، حدثنا غندر، ح وحدثناه محمد بن المثنى، حدثنا وهب، بن جرير ح وحدثنا عبد الوارث بن عبد الصمد، حدثنا أبي قالوا، جميعا حدثنا شعبة، بهذا الإسناد ‏.‏ في حديث غندر ووهب نهي ‏.‏ وفي حديث عبد الصمد أن رسول الله صلى الله عليه وسلم نهى ‏.‏ بمثل حديث معاذ عن شعبة ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 3818,
			"arabicnumber": "1516",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم نهى عن النجش ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 3819,
			"arabicnumber": "1517.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا ابن أبي زائدة، ح وحدثنا ابن المثنى، حدثنا يحيى يعني ابن سعيد، ح وحدثنا ابن نمير، حدثنا أبي كلهم، عن عبيد الله، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم نهى أن تتلقى السلع حتى تبلغ الأسواق ‏.‏ وهذا لفظ ابن نمير ‏.‏ وقال الآخران إن النبي صلى الله عليه وسلم نهى عن التلقي ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 3820,
			"arabicnumber": "1517.02",
			"text": "وحدثني محمد بن حاتم، وإسحاق بن منصور، جميعا عن ابن مهدي، عن مالك، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم ‏.‏ بمثل حديث ابن نمير عن عبيد الله ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 3821,
			"arabicnumber": "1518",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن مبارك، عن التيمي، عن أبي، عثمان عن عبد الله، عن النبي صلى الله عليه وسلم أنه نهى عن تلقي البيوع ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 3822,
			"arabicnumber": "1519.01",
			"text": "حدثنا يحيى بن يحيى، أخبرنا هشيم، عن هشام، عن ابن سيرين، عن أبي هريرة، قال نهى رسول الله صلى الله عليه وسلم أن يتلقى الجلب ‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 3823,
			"arabicnumber": "1519.02",
			"text": "حدثنا ابن أبي عمر، حدثنا هشام بن سليمان، عن ابن جريج، أخبرني هشام، القردوسي عن ابن سيرين، قال سمعت أبا هريرة، يقول إن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا تلقوا الجلب ‏.‏ فمن تلقاه فاشترى منه فإذا أتى سيده السوق فهو بالخيار‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 3824,
			"arabicnumber": "1520",
			"text": "حدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، وزهير بن حرب، قالوا حدثنا سفيان، عن الزهري، عن سعيد بن المسيب، عن أبي هريرة، يبلغ به النبي صلى الله عليه وسلم قال ‏ \"‏ لا يبع حاضر لباد ‏\"‏ ‏.‏ وقال زهير عن النبي صلى الله عليه وسلم أنه نهى أن يبيع حاضر لباد ‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 3825,
			"arabicnumber": "1521",
			"text": "وحدثنا إسحاق بن إبراهيم، وعبد بن حميد، قالا حدثنا عبد الرزاق، أخبرنا معمر، عن ابن طاوس، عن أبيه، عن ابن عباس، قال نهى رسول الله صلى الله عليه وسلم أن تتلقى الركبان وأن يبيع حاضر لباد ‏.‏ قال فقلت لابن عباس ما قوله حاضر لباد قال لا يكن له سمسارا",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 3826,
			"arabicnumber": "1522.01",
			"text": "حدثنا يحيى بن يحيى التميمي، أخبرنا أبو خيثمة، عن أبي الزبير، عن جابر، ح. وحدثنا أحمد بن يونس، حدثنا زهير، حدثنا أبو الزبير، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يبع حاضر لباد دعوا الناس يرزق الله بعضهم من بعض‏\"‏ ‏.‏ غير أن في رواية يحيى ‏\"‏ يرزق ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 3827,
			"arabicnumber": "1522.02",
			"text": "حدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، قالا حدثنا سفيان بن عيينة، عن أبي الزبير، عن جابر، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 3828,
			"arabicnumber": "1523.01",
			"text": "وحدثنا يحيى بن يحيى، أخبرنا هشيم، عن يونس، عن ابن سيرين، عن أنس، بن مالك قال نهينا أن يبيع، حاضر لباد ‏.‏ وإن كان أخاه أو أباه ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 3829,
			"arabicnumber": "1523.02",
			"text": "حدثنا محمد بن المثنى، حدثنا ابن أبي عدي، عن ابن عون، عن محمد، عن أنس،ح ‏.‏ وحدثنا ابن المثنى، حدثنا معاذ، حدثنا ابن عون، عن محمد، قال قال أنس بن مالك نهينا عن أن يبيع حاضر لباد ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 3830,
			"arabicnumber": "1524.01",
			"text": "حدثنا عبد الله بن مسلمة بن قعنب، حدثنا داود بن قيس، عن موسى بن يسار، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من اشترى شاة مصراة فلينقلب بها فليحلبها فإن رضي حلابها أمسكها وإلا ردها ومعها صاع من تمر ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 3831,
			"arabicnumber": "1524.02",
			"text": "حدثنا قتيبة بن سعيد، حدثنا يعقوب، - يعني ابن عبد الرحمن القاري - عن سهيل، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من ابتاع شاة مصراة فهو فيها بالخيار ثلاثة أيام إن شاء أمسكها وإن شاء ردها ورد معها صاعا من تمر ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 3832,
			"arabicnumber": "1524.03",
			"text": "حدثنا محمد بن عمرو بن جبلة بن أبي رواد، حدثنا أبو عامر، - يعني العقدي - حدثنا قرة، عن محمد، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ من اشترى شاة مصراة فهو بالخيار ثلاثة أيام فإن ردها رد معها صاعا من طعام لا سمراء ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 3833,
			"arabicnumber": "1524.04",
			"text": "حدثنا ابن أبي عمر، حدثنا سفيان، عن أيوب، عن محمد، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من اشترى شاة مصراة فهو بخير النظرين إن شاء أمسكها وإن شاء ردها وصاعا من تمر لا سمراء ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 3834,
			"arabicnumber": "1524.05",
			"text": "وحدثناه ابن أبي عمر، حدثنا عبد الوهاب، عن أيوب، بهذا الإسناد غير أنه قال ‏ \"‏ من اشترى من الغنم فهو بالخيار ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 3835,
			"arabicnumber": "1524.06",
			"text": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا ما أحدكم اشترى لقحة مصراة أو شاة مصراة فهو بخير النظرين بعد أن يحلبها إما هي وإلا فليردها وصاعا من تمر ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 3837,
			"arabicnumber": "1525.01",
			"text": "حدثنا يحيى بن يحيى، حدثنا حماد بن زيد، ح وحدثنا أبو الربيع العتكي، وقتيبة، قالا حدثنا حماد، عن عمرو بن دينار، عن طاوس، عن ابن عباس، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من ابتاع طعاما فلا يبعه حتى يستوفيه ‏\"‏ ‏.‏ قال ابن عباس وأحسب كل شىء مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 3838,
			"arabicnumber": "1525.02",
			"text": "حدثنا ابن أبي عمر، وأحمد بن عبدة، قالا حدثنا سفيان، ح وحدثنا أبو بكر بن، أبي شيبة وأبو كريب قالا حدثنا وكيع، عن سفيان، - وهو الثوري - كلاهما عن عمرو، بن دينار بهذا الإسناد نحوه ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 3839,
			"arabicnumber": "1525.03",
			"text": "حدثنا إسحاق بن إبراهيم، ومحمد بن رافع، وعبد بن حميد، قال ابن رافع حدثنا وقال الآخران، أخبرنا عبد الرزاق، أخبرنا معمر، عن ابن طاوس، عن أبيه، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من ابتاع طعاما فلا يبعه حتى يقبضه ‏\"‏ ‏.‏ قال ابن عباس وأحسب كل شىء بمنزلة الطعام ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 3840,
			"arabicnumber": "1526.01",
			"text": "حدثنا عبد الله بن مسلمة القعنبي، حدثنا مالك، ح وحدثنا يحيى بن يحيى، قال قرأت على مالك عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من ابتاع طعاما فلا يبعه حتى يستوفيه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 3841,
			"arabicnumber": "1527.01",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن نافع، عن ابن عمر، قال كنا في زمان رسول الله صلى الله عليه وسلم نبتاع الطعام فيبعث علينا من يأمرنا بانتقاله من المكان الذي ابتعناه فيه إلى مكان سواه قبل أن نبيعه ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 3843,
			"arabicnumber": "1526.03",
			"text": "حدثني حرملة بن يحيى، أخبرنا عبد الله بن وهب، حدثني عمر بن محمد، عن نافع، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من اشترى طعاما فلا يبعه حتى يستوفيه ويقبضه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 3844,
			"arabicnumber": "1526.04",
			"text": "حدثنا يحيى بن يحيى، وعلي بن حجر، قال يحيى أخبرنا إسماعيل بن جعفر، وقال علي حدثنا إسماعيل، عن عبد الله بن دينار، أنه سمع ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من ابتاع طعاما فلا يبعه حتى يقبضه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 3846,
			"arabicnumber": "1527.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 3847,
			"arabicnumber": "1527.04",
			"text": "وحدثني حرملة بن يحيى، حدثنا ابن وهب، أخبرني يونس، عن ابن شهاب، أخبرني سالم بن عبد الله، أن أباه، قال قد رأيت الناس في عهد رسول الله صلى الله عليه وسلم إذا ابتاعوا الطعام جزافا يضربون في أن يبيعوه في مكانهم وذلك حتى يئووه إلى رحالهم ‏.‏ قال ابن شهاب وحدثني عبيد الله بن عبد الله بن عمر أن أباه كان يشتري الطعام جزافا فيحمله إلى أهله ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 3848,
			"arabicnumber": "1528.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، وابن، نمير وأبو كريب قالوا حدثنا زيد بن حباب، عن الضحاك بن عثمان، عن بكير بن عبد الله بن الأشج، عن سليمان بن يسار، عن أبي، هريرة أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من اشترى طعاما فلا يبعه حتى يكتاله ‏\"‏ ‏.‏ وفي رواية أبي بكر ‏\"‏ من ابتاع ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 3849,
			"arabicnumber": "1528.02",
			"text": "حدثنا إسحاق بن إبراهيم، أخبرنا عبد الله بن الحارث المخزومي، حدثنا الضحاك، بن عثمان عن بكير بن عبد الله بن الأشج، عن سليمان بن يسار، عن أبي هريرة، أنه قال لمروان أحللت بيع الربا ‏.‏ فقال مروان ما فعلت ‏.‏ فقال أبو هريرة أحللت بيع الصكاك وقد نهى رسول الله صلى الله عليه وسلم عن بيع الطعام حتى يستوفى ‏.‏ قال فخطب مروان الناس فنهى عن بيعها ‏.‏ قال سليمان فنظرت إلى حرس يأخذونها من أيدي الناس ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 3850,
			"arabicnumber": "1529",
			"text": "حدثنا إسحاق بن إبراهيم، أخبرنا روح، حدثنا ابن جريج، حدثني أبو الزبير، أنه سمع جابر بن عبد الله، يقول كان رسول الله صلى الله عليه وسلم يقول ‏ \"‏ إذا ابتعت طعاما فلا تبعه حتى تستوفيه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 3851,
			"arabicnumber": "1530.01",
			"text": "حدثني أبو الطاهر، أحمد بن عمرو بن سرح أخبرنا ابن وهب، حدثني ابن جريج، أن أبا الزبير، أخبره قال سمعت جابر بن عبد الله، يقول نهى رسول الله صلى الله عليه وسلم عن بيع الصبرة من التمر لا يعلم مكيلتها بالكيل المسمى من التمر ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 3852,
			"arabicnumber": "1530.02",
			"text": "حدثنا إسحاق بن إبراهيم، حدثنا روح بن عبادة، حدثنا ابن جريج، أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول نهى رسول الله صلى الله عليه وسلم ‏.‏ بمثله غير أنه لم يذكر من التمر ‏.‏ في آخر الحديث ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 3853,
			"arabicnumber": "1531.01",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ البيعان كل واحد منهما بالخيار على صاحبه ما لم يتفرقا إلا بيع الخيار ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 3854,
			"arabicnumber": "1531.02",
			"text": "حدثنا زهير بن حرب، ومحمد بن المثنى، قالا حدثنا يحيى، وهو القطان ح وحدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، ح وحدثنا ابن نمير، حدثنا أبي كلهم، عن عبيد، الله عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم ح. وحدثني زهير بن حرب، وعلي بن حجر، قالا حدثنا إسماعيل، ح وحدثنا أبو الربيع وأبو كامل قالا حدثنا حماد، - وهو ابن زيد - جميعا عن أيوب، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم ح. وحدثنا ابن المثنى، وابن أبي عمر، قالا حدثنا عبد الوهاب، قال سمعت يحيى، بن سعيد ح وحدثنا ابن رافع، حدثنا ابن أبي فديك، أخبرنا الضحاك، كلاهما عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم ‏.‏ نحو حديث مالك عن نافع ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 3855,
			"arabicnumber": "1531.03",
			"text": "حدثنا قتيبة بن سعيد، حدثنا ليث، ح وحدثنا محمد بن رمح، أخبرنا الليث، عن نافع، عن ابن عمر، عن رسول الله صلى الله عليه وسلم أنه قال ‏ \"‏ إذا تبايع الرجلان فكل واحد منهما بالخيار ما لم يتفرقا وكانا جميعا أو يخير أحدهما الآخر فإن خير أحدهما الآخر فتبايعا على ذلك فقد وجب البيع وإن تفرقا بعد أن تبايعا ولم يترك واحد منهما البيع فقد وجب البيع ‏\"‏ ‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 3856,
			"arabicnumber": "1531.04",
			"text": "وحدثني زهير بن حرب، وابن أبي عمر، كلاهما عن سفيان، - قال زهير حدثنا سفيان بن عيينة، - عن ابن جريج، قال أملى على نافع سمع عبد الله بن عمر، يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا تبايع المتبايعان بالبيع فكل واحد منهما بالخيار من بيعه ما لم يتفرقا أو يكون بيعهما عن خيار فإذا كان بيعهما عن خيار فقد وجب ‏\"‏ ‏.‏ زاد ابن أبي عمر في روايته قال نافع فكان إذا بايع رجلا فأراد أن لا يقيله قام فمشى هنية ثم رجع إليه ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 3857,
			"arabicnumber": "1531.05",
			"text": "حدثنا يحيى بن يحيى، و يحيى بن أيوب وقتيبة وابن حجر قال يحيى بن يحيى أخبرنا وقال الآخرون، حدثنا إسماعيل بن جعفر، عن عبد الله بن دينار، أنه سمع ابن، عمر يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ كل بيعين لا بيع بينهما حتى يتفرقا إلا بيع الخيار ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 3858,
			"arabicnumber": "1532.01",
			"text": "حدثنا محمد بن المثنى، حدثنا يحيى بن سعيد، عن شعبة، ح وحدثنا عمرو بن، علي حدثنا يحيى بن سعيد، وعبد الرحمن بن مهدي، قالا حدثنا شعبة، عن قتادة، عن أبي الخليل، عن عبد الله بن الحارث، عن حكيم بن حزام، عن النبي صلى الله عليه وسلم قال ‏ \"‏ البيعان بالخيار ما لم يتفرقا فإن صدقا وبينا بورك لهما في بيعهما وإن كذبا وكتما محقت بركة بيعهما ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 3859,
			"arabicnumber": "1532.02",
			"text": "حدثنا عمرو بن علي، حدثنا عبد الرحمن بن مهدي، حدثنا همام، عن أبي التياح، قال سمعت عبد الله بن الحارث، يحدث عن حكيم بن حزام، عن النبي صلى الله عليه وسلم ‏.‏ بمثله ‏.‏ قال مسلم بن الحجاج ولد حكيم بن حزام في جوف الكعبة وعاش مائة وعشرين سنة ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 3860,
			"arabicnumber": "1533.01",
			"text": "حدثنا يحيى بن يحيى، ويحيى بن أيوب، وقتيبة، وابن، حجر قال يحيى بن يحيى أخبرنا وقال الآخرون، حدثنا إسماعيل بن جعفر، عن عبد الله بن دينار، أنه سمع ابن، عمر يقول ذكر رجل لرسول الله صلى الله عليه وسلم أنه يخدع في البيوع فقال رسول الله صلى الله عليه وسلم ‏ \"‏ من بايعت فقل لا خلابة ‏\"‏ ‏.‏ فكان إذا بايع يقول لا خيابة‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 3861,
			"arabicnumber": "1533.02",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، حدثنا سفيان، ح وحدثنا محمد بن، المثنى حدثنا محمد بن جعفر، حدثنا شعبة، كلاهما عن عبد الله بن دينار، بهذا الإسناد مثله وليس في حديثهما فكان إذا بايع يقول لا خيابة ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 3862,
			"arabicnumber": "1534.01",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم نهى عن بيع الثمر حتى يبدو صلاحها نهى البائع والمبتاع",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 3863,
			"arabicnumber": "1534.02",
			"text": "حدثنا ابن نمير، حدثنا أبي، حدثنا عبيد الله، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 3864,
			"arabicnumber": "1535",
			"text": "وحدثني علي بن حجر السعدي، وزهير بن حرب، قالا حدثنا إسماعيل، عن أيوب، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم نهى عن بيع النخل حتى يزهو وعن السنبل حتى يبيض ويأمن العاهة نهى البائع والمشتري ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 3865,
			"arabicnumber": "1534.03",
			"text": "حدثني زهير بن حرب، حدثنا جرير، عن يحيى بن سعيد، عن نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تبتاعوا الثمر حتى يبدو صلاحه وتذهب عنه الآفة قال يبدو صلاحه حمرته وصفرته ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 3866,
			"arabicnumber": "1534.04",
			"text": "وحدثنا محمد بن المثنى، وابن أبي عمر، قالا حدثنا عبد الوهاب، عن يحيى، بهذا الإسناد حتى يبدو صلاحه لم يذكر ما بعده",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 3867,
			"arabicnumber": "1534.05",
			"text": "حدثنا ابن رافع، حدثنا ابن أبي فديك، أخبرنا الضحاك، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم بمثل حديث عبد الوهاب ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 3868,
			"arabicnumber": "1534.06",
			"text": "حدثنا سويد بن سعيد، حدثنا حفص بن ميسرة، حدثني موسى بن عقبة، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم بمثل حديث مالك وعبيد الله ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 3869,
			"arabicnumber": "1534.07",
			"text": "حدثنا يحيى بن يحيى، ويحيى بن أيوب، وقتيبة، وابن، حجر قال يحيى بن يحيى أخبرنا وقال الآخرون، حدثنا إسماعيل، - وهو ابن جعفر - عن عبد الله بن دينار، أنه سمع ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا تبيعوا الثمر حتى يبدو صلاحه ‏\"‏ ‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 3870,
			"arabicnumber": "1534.08",
			"text": "وحدثنيه زهير بن حرب، حدثنا عبد الرحمن، عن سفيان، ح وحدثنا ابن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، كلاهما عن عبد الله بن دينار، بهذا الإسناد وزاد في حديث شعبة فقيل لابن عمر ما صلاحه قال تذهب عاهته ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 3871,
			"arabicnumber": "1536.01",
			"text": "حدثنا يحيى بن يحيى، أخبرنا أبو خيثمة، عن أبي الزبير، عن جابر، ح. وحدثنا أحمد بن يونس، حدثنا زهير، حدثنا أبو الزبير، عن جابر، قال نهى - أو نهانا - رسول الله صلى الله عليه وسلم عن بيع الثمر حتى يطيب ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 3872,
			"arabicnumber": "1536.02",
			"text": "حدثنا أحمد بن عثمان النوفلي، حدثنا أبو عاصم، ح وحدثني محمد بن حاتم، - واللفظ له - حدثنا روح، قالا حدثنا زكرياء بن إسحاق، حدثنا عمرو بن دينار، أنه سمع جابر بن عبد الله، يقول نهى رسول الله صلى الله عليه وسلم عن بيع الثمر حتى يبدو صلاحه ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 3873,
			"arabicnumber": "1537",
			"text": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن عمرو بن مرة، عن أبي البختري، قال سألت ابن عباس عن بيع النخل، فقال نهى رسول الله صلى الله عليه وسلم عن بيع النخل حتى يأكل منه أو يؤكل وحتى يوزن ‏.‏ قال فقلت ما يوزن فقال رجل عنده حتى يحزر ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 3874,
			"arabicnumber": "1538.01",
			"text": "حدثني أبو كريب، محمد بن العلاء حدثنا محمد بن فضيل، عن أبيه، عن ابن أبي، نعم عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا تبتاعوا الثمار حتى يبدو صلاحها ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 3875,
			"arabicnumber": "1534.09",
			"text": "حدثنا يحيى بن يحيى، أخبرنا سفيان بن عيينة، عن الزهري، ح وحدثنا ابن، نمير وزهير بن حرب - واللفظ لهما - قالا حدثنا سفيان، حدثنا الزهري، عن سالم، عن ابن عمر، أن النبي صلى الله عليه وسلم نهى عن بيع الثمر حتى يبدو صلاحه وعن بيع الثمر بالتمر ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 3876,
			"arabicnumber": "1539.01",
			"text": "قال ابن عمر وحدثنا زيد بن ثابت، أن رسول الله صلى الله عليه وسلم رخص في بيع العرايا ‏.‏ زاد ابن نمير في روايته أن تباع ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 3877,
			"arabicnumber": "1538.02",
			"text": "وحدثني أبو الطاهر، وحرملة، - واللفظ لحرملة - قالا أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، حدثني سعيد بن المسيب، وأبو سلمة بن عبد الرحمن أن أبا هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا تبتاعوا الثمر حتى يبدو صلاحه ولا تبتاعوا الثمر بالتمر ‏\"‏ ‏.‏ قال ابن شهاب وحدثني سالم بن عبد الله بن عمر عن أبيه عن النبي صلى الله عليه وسلم مثله سواء ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 3878,
			"arabicnumber": "1539.02",
			"text": "وحدثني محمد بن رافع، حدثنا حجين بن المثنى، حدثنا الليث، عن عقيل، عن ابن شهاب، عن سعيد بن المسيب، أن رسول الله صلى الله عليه وسلم نهى عن بيع المزابنة والمحاقلة والمزابنة أن يباع ثمر النخل بالتمر والمحاقلة أن يباع الزرع بالقمح واستكراء الأرض بالقمح ‏.‏ قال وأخبرني سالم بن عبد الله عن رسول الله صلى الله عليه وسلم أنه قال ‏ \"‏ لا تبتاعوا الثمر حتى يبدو صلاحه ولا تبتاعوا الثمر بالتمر ‏\"‏ ‏.‏ وقال سالم أخبرني عبد الله، عن زيد بن ثابت، عن رسول الله صلى الله عليه وسلم أنه رخص بعد ذلك في بيع العرية بالرطب أو بالتمر ولم يرخص في غير ذلك",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 3879,
			"arabicnumber": "1539.03",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن نافع، عن ابن عمر، عن زيد، بن ثابت أن رسول الله صلى الله عليه وسلم رخص لصاحب العرية أن يبيعها بخرصها من التمر ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 3880,
			"arabicnumber": "1539.04",
			"text": "وحدثنا يحيى بن يحيى، أخبرنا سليمان بن بلال، عن يحيى بن سعيد، أخبرني نافع، أنه سمع عبد الله بن عمر، يحدث أن زيد بن ثابت، حدثه أن رسول الله صلى الله عليه وسلم رخص في العرية يأخذها أهل البيت بخرصها تمرا يأكلونها رطبا ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 3881,
			"arabicnumber": "1539.05",
			"text": "وحدثناه محمد بن المثنى، حدثنا عبد الوهاب، قال سمعت يحيى بن سعيد، يقول أخبرني نافع، بهذا الإسناد مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 3882,
			"arabicnumber": "1539.06",
			"text": "وحدثناه يحيى بن يحيى، أخبرنا هشيم، عن يحيى بن سعيد، بهذا الإسناد غير أنه قال والعرية النخلة تجعل للقوم فيبيعونها بخرصها تمرا ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 3883,
			"arabicnumber": "1539.07",
			"text": "وحدثنا محمد بن رمح بن المهاجر، حدثنا الليث، عن يحيى بن سعيد، عن نافع، عن عبد الله بن عمر، حدثني زيد بن ثابت، أن رسول الله صلى الله عليه وسلم رخص في بيع العرية بخرصها تمرا ‏.‏ قال يحيى العرية أن يشتري الرجل ثمر النخلات لطعام أهله رطبا بخرصها تمرا ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 3884,
			"arabicnumber": "1539.08",
			"text": "وحدثنا ابن نمير، حدثنا أبي، حدثنا عبيد الله، حدثني نافع، عن ابن عمر، عن زيد بن ثابت، أن رسول الله صلى الله عليه وسلم رخص في العرايا أن تباع بخرصها كيلا ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 3885,
			"arabicnumber": "1539.09",
			"text": "وحدثناه ابن المثنى، حدثنا يحيى بن سعيد، عن عبيد الله، بهذا الإسناد وقال أن تؤخذ بخرصها ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 3886,
			"arabicnumber": "1539.10",
			"text": "وحدثنا أبو الربيع، وأبو كامل قالا حدثنا حماد، ح وحدثنيه علي بن حجر، حدثنا إسماعيل، كلاهما عن أيوب، عن نافع، بهذا الإسناد أن رسول الله صلى الله عليه وسلم رخص في بيع العرايا بخرصها ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 3887,
			"arabicnumber": "1540.01",
			"text": "وحدثنا عبد الله بن مسلمة القعنبي، حدثنا سليمان، - يعني ابن بلال - عن يحيى، - وهو ابن سعيد - عن بشير بن يسار، عن بعض، أصحاب رسول الله صلى الله عليه وسلم من أهل دارهم منهم سهل بن أبي حثمة أن رسول الله صلى الله عليه وسلم نهى عن بيع الثمر بالتمر وقال ‏ \"‏ ذلك الربا تلك المزابنة ‏\"‏ ‏.‏ إلا أنه رخص في بيع العرية النخلة والنخلتين يأخذها أهل البيت بخرصها تمرا يأكلونها رطبا ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 3888,
			"arabicnumber": "1540.02",
			"text": "وحدثنا قتيبة بن سعيد، حدثنا ليث، ح وحدثنا ابن رمح، أخبرنا الليث، عن يحيى، بن سعيد عن بشير بن يسار، عن أصحاب، رسول الله صلى الله عليه وسلم أنهم قالوا رخص رسول الله صلى الله عليه وسلم في بيع العرية بخرصها تمرا ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 3889,
			"arabicnumber": "1540.03",
			"text": "وحدثنا محمد بن المثنى، وإسحاق بن إبراهيم، وابن أبي عمر، جميعا عن الثقفي، قال سمعت يحيى بن سعيد، يقول أخبرني بشير بن يسار، عن بعض، أصحاب رسول الله صلى الله عليه وسلم من أهل داره أن رسول الله صلى الله عليه وسلم نهى ‏.‏ فذكر بمثل حديث سليمان بن بلال عن يحيى غير أن إسحاق وابن المثنى جعلا مكان الربا الزبن وقال ابن أبي عمر الربا ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 3890,
			"arabicnumber": "1540.04",
			"text": "وحدثناه عمرو الناقد، وابن، نمير قالا حدثنا سفيان بن عيينة، عن يحيى بن، سعيد عن بشير بن يسار، عن سهل بن أبي حثمة، عن النبي صلى الله عليه وسلم نحو حديثهم ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 3891,
			"arabicnumber": "1540.05",
			"text": "حدثنا أبو بكر بن أبي شيبة، وحسن الحلواني، قالا حدثنا أبو أسامة، عن الوليد، بن كثير حدثني بشير بن يسار، مولى بني حارثة أن رافع بن خديج، وسهل بن أبي حثمة، حدثاه أن رسول الله صلى الله عليه وسلم نهى عن المزابنة الثمر بالتمر إلا أصحاب العرايا فإنه قد أذن لهم ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 3892,
			"arabicnumber": "1541",
			"text": "حدثنا عبد الله بن مسلمة بن قعنب، حدثنا مالك، ح وحدثنا يحيى بن يحيى، - واللفظ له - قال قلت لمالك حدثك داود بن الحصين، عن أبي سفيان، - مولى ابن أبي أحمد - عن أبي هريرة، أن رسول الله صلى الله عليه وسلم رخص في بيع العرايا بخرصها فيما دون خمسة أوسق أو في خمسة - يشك داود قال خمسة أو دون خمسة - قال نعم ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 3893,
			"arabicnumber": "1542.01",
			"text": "حدثنا يحيى بن يحيى التميمي، قال قرأت على مالك عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم نهى عن المزابنة والمزابنة بيع الثمر بالتمر كيلا وبيع الكرم بالزبيب كيلا ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 3894,
			"arabicnumber": "1542.02",
			"text": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن عبد الله بن نمير، قالا حدثنا محمد بن، بشر حدثنا عبيد الله، عن نافع، أن عبد الله، أخبره أن النبي صلى الله عليه وسلم نهى عن المزابنة بيع ثمر النخل بالتمر كيلا وبيع العنب بالزبيب كيلا وبيع الزرع بالحنطة كيلا ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 3895,
			"arabicnumber": "1542.03",
			"text": "وحدثناه أبو بكر بن أبي شيبة، حدثنا ابن أبي زائدة، عن عبيد الله، بهذا الإسناد مثله",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 3896,
			"arabicnumber": "1542.04",
			"text": "حدثني يحيى بن معين، وهارون بن عبد الله، وحسين بن عيسى، قالوا حدثنا أبو أسامة، حدثنا عبيد الله، عن نافع، عن ابن عمر، قال نهى رسول الله صلى الله عليه وسلم عن المزابنة والمزابنة بيع ثمر النخل بالتمر كيلا وبيع الزبيب بالعنب كيلا وعن كل ثمر بخرصه ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 3897,
			"arabicnumber": "1542.05",
			"text": "حدثني علي بن حجر السعدي، وزهير بن حرب، قالا حدثنا إسماعيل، - وهو ابن إبراهيم - عن أيوب، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم نهى عن المزابنة والمزابنة أن يباع ما في رءوس النخل بتمر بكيل مسمى إن زاد فلي وإن نقص فعلى ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 3898,
			"arabicnumber": "1542.06",
			"text": "وحدثناه أبو الربيع، وأبو كامل قالا حدثنا حماد، حدثنا أيوب، بهذا الإسناد نحوه ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 3899,
			"arabicnumber": "1542.07",
			"text": "حدثنا قتيبة بن سعيد، حدثنا ليث، ح وحدثني محمد بن رمح، أخبرنا الليث، عن نافع، عن عبد الله، قال نهى رسول الله صلى الله عليه وسلم عن المزابنة أن يبيع ثمر حائطه إن كانت نخلا بتمر كيلا وإن كان كرما أن يبيعه بزبيب كيلا وإن كان زرعا أن يبيعه بكيل طعام ‏.‏ نهى عن ذلك كله ‏.‏ وفي رواية قتيبة أو كان زرعا",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 3900,
			"arabicnumber": "1542.08",
			"text": "وحدثنيه أبو الطاهر، أخبرنا ابن وهب، حدثني يونس، ح وحدثناه ابن رافع، حدثنا ابن أبي فديك، أخبرني الضحاك، ح وحدثنيه سويد بن سعيد، حدثنا حفص بن ميسرة، حدثني موسى بن عقبة، كلهم عن نافع، بهذا الإسناد نحو حديثهم",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 3901,
			"arabicnumber": "1543.01",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من باع نخلا قد أبرت فثمرتها للبائع إلا أن يشترط المبتاع ‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 3902,
			"arabicnumber": "1543.02",
			"text": "حدثنا محمد بن المثنى، حدثنا يحيى بن سعيد، ح وحدثنا ابن نمير، حدثنا أبي، جميعا عن عبيد الله، ح وحدثنا أبو بكر بن أبي شيبة، - واللفظ له - حدثنا محمد بن بشر، حدثنا عبيد الله، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ أيما نخل اشتري أصولها وقد أبرت فإن ثمرها للذي أبرها إلا أن يشترط الذي اشتراها‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 3903,
			"arabicnumber": "1543.03",
			"text": "وحدثنا قتيبة بن سعيد، حدثنا ليث، ح وحدثنا ابن رمح، أخبرنا الليث، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم قال ‏ \"‏ أيما امرئ أبر نخلا ثم باع أصلها فللذي أبر ثمر النخل إلا أن يشترط المبتاع ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 3904,
			"arabicnumber": "1543.04",
			"text": "وحدثناه أبو الربيع، وأبو كامل قالا حدثنا حماد، ح وحدثنيه زهير بن حرب، حدثنا إسماعيل، كلاهما عن أيوب، عن نافع، بهذا الإسناد نحوه ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 3905,
			"arabicnumber": "1543.05",
			"text": "حدثنا يحيى بن يحيى، ومحمد بن رمح، قالا أخبرنا الليث، ح وحدثنا قتيبة بن، سعيد حدثنا ليث، عن ابن شهاب، عن سالم بن عبد الله بن عمر، عن عبد الله بن عمر، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ من ابتاع نخلا بعد أن تؤبر فثمرتها للذي باعها إلا أن يشترط المبتاع ومن ابتاع عبدا فماله للذي باعه إلا أن يشترط المبتاع ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 3906,
			"arabicnumber": "1543.06",
			"text": "وحدثناه يحيى بن يحيى، وأبو بكر بن أبي شيبة وزهير بن حرب قال يحيى أخبرنا وقال الآخران، حدثنا سفيان بن عيينة، عن الزهري، بهذا الإسناد مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 3907,
			"arabicnumber": "1543.07",
			"text": "وحدثني حرملة بن يحيى، أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، حدثني سالم بن عبد الله بن عمر، أن أباه، قال سمعت رسول الله صلى الله عليه وسلم يقول بمثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 3908,
			"arabicnumber": "1536.03",
			"text": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن عبد الله بن نمير، وزهير بن حرب، قالوا جميعا حدثنا سفيان بن عيينة، عن ابن جريج، عن عطاء، عن جابر بن عبد الله، قال نهى رسول الله صلى الله عليه وسلم عن المحاقلة والمزابنة والمخابرة وعن بيع الثمر حتى يبدو صلاحه ولا يباع إلا بالدينار والدرهم إلا العرايا ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 3909,
			"arabicnumber": "1536.04",
			"text": "وحدثنا عبد بن حميد، أخبرنا أبو عاصم، أخبرنا ابن جريج، عن عطاء، وأبي، الزبير أنهما سمعا جابر بن عبد الله، يقول نهى رسول الله صلى الله عليه وسلم فذكر بمثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 3910,
			"arabicnumber": "1536.05",
			"text": "حدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا مخلد بن يزيد الجزري، حدثنا ابن، جريج أخبرني عطاء، عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم نهى عن المخابرة والمحاقلة والمزابنة وعن بيع الثمرة حتى تطعم ولا تباع إلا بالدراهم والدنانير إلا العرايا ‏.‏ قال عطاء فسر لنا جابر قال أما المخابرة فالأرض البيضاء يدفعها الرجل إلى الرجل فينفق فيها ثم يأخذ من الثمر ‏.‏ وزعم أن المزابنة بيع الرطب في النخل بالتمر كيلا ‏.‏ والمحاقلة في الزرع على نحو ذلك يبيع الزرع القائم بالحب كيلا ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 3911,
			"arabicnumber": "1536.06",
			"text": "حدثنا إسحاق بن إبراهيم، ومحمد بن أحمد بن أبي خلف، كلاهما عن زكرياء، قال ابن أبي خلف حدثنا زكرياء بن عدي، أخبرنا عبيد الله، عن زيد بن أبي أنيسة، حدثنا أبو الوليد المكي، وهو جالس عند عطاء بن أبي رباح عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم نهى عن المحاقلة والمزابنة والمخابرة وأن تشترى النخل حتى تشقه - والإشقاه أن يحمر أو يصفر أو يؤكل منه شىء - والمحاقلة أن يباع الحقل بكيل من الطعام معلوم والمزابنة أن يباع النخل بأوساق من التمر والمخابرة الثلث والربع وأشباه ذلك ‏.‏ قال زيد قلت لعطاء بن أبي رباح أسمعت جابر بن عبد الله يذكر هذا عن رسول الله صلى الله عليه وسلم قال نعم ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 3912,
			"arabicnumber": "1536.07",
			"text": "وحدثنا عبد الله بن هاشم، حدثنا بهز، حدثنا سليم بن حيان، حدثنا سعيد بن، ميناء عن جابر بن عبد الله، قال نهى رسول الله صلى الله عليه وسلم عن المزابنة والمحاقلة والمخابرة وعن بيع الثمرة حتى تشقح ‏.‏ قال قلت لسعيد ما تشقح قال تحمار وتصفار ويؤكل منها ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 3913,
			"arabicnumber": "1536.08",
			"text": "حدثنا عبيد الله بن عمر القواريري، ومحمد بن عبيد الغبري، - واللفظ لعبيد الله - قالا حدثنا حماد بن زيد، حدثنا أيوب، عن أبي الزبير، وسعيد بن ميناء، عن جابر بن، عبد الله قال نهى رسول الله صلى الله عليه وسلم عن المحاقلة والمزابنة والمعاومة والمخابرة - قال أحدهما بيع السنين هي المعاومة - وعن الثنيا ورخص في العرايا ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 3914,
			"arabicnumber": "1536.09",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وعلي بن حجر، قالا حدثنا إسماعيل، - وهو ابن علية - عن أيوب، عن أبي الزبير، عن جابر، عن النبي صلى الله عليه وسلم ‏.‏ بمثله غير أنه لا يذكر بيع السنين هي المعاومة ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 3915,
			"arabicnumber": "1536.10",
			"text": "وحدثني إسحاق بن منصور، حدثنا عبيد الله بن عبد المجيد، حدثنا رباح بن، أبي معروف قال سمعت عطاء، عن جابر بن عبد الله، قال نهى رسول الله صلى الله عليه وسلم عن كراء الأرض وعن بيعها السنين وعن بيع الثمر حتى يطيب ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 3916,
			"arabicnumber": "1536.11",
			"text": "وحدثني أبو كامل الجحدري، حدثنا حماد، - يعني ابن زيد - عن مطر الوراق، عن عطاء، عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم نهى عن كراء الأرض ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 3917,
			"arabicnumber": "1536.12",
			"text": "وحدثنا عبد بن حميد، حدثنا محمد بن الفضل، - لقبه عارم وهو أبو النعمان السدوسي - حدثنا مهدي بن ميمون، حدثنا مطر الوراق، عن عطاء، عن جابر بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من كانت له أرض فليزرعها فإن لم يزرعها فليزرعها أخاه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 3918,
			"arabicnumber": "1536.13",
			"text": "حدثنا الحكم بن موسى، حدثنا هقل، - يعني ابن زياد - عن الأوزاعي، عن عطاء، عن جابر بن عبد الله، قال كان لرجال فضول أرضين من أصحاب رسول الله صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم ‏ \"‏ من كانت له فضل أرض فليزرعها أو ليمنحها أخاه فإن أبى فليمسك أرضه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 3919,
			"arabicnumber": "1536.14",
			"text": "وحدثني محمد بن حاتم، حدثنا معلى بن منصور الرازي، حدثنا خالد، أخبرنا الشيباني، عن بكير بن الأخنس، عن عطاء، عن جابر بن عبد الله، قال نهى رسول الله صلى الله عليه وسلم أن يؤخذ للأرض أجر أو حظ ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 3920,
			"arabicnumber": "1536.15",
			"text": "حدثنا ابن نمير، حدثنا أبي، حدثنا عبد الملك، عن عطاء، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من كانت له أرض فليزرعها فإن لم يستطع أن يزرعها وعجز عنها فليمنحها أخاه المسلم ولا يؤاجرها إياه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 3921,
			"arabicnumber": "1536.16",
			"text": "وحدثنا شيبان بن فروخ، حدثنا همام، قال سأل سليمان بن موسى عطاء فقال أحدثك جابر بن عبد الله أن النبي صلى الله عليه وسلم قال ‏ \"‏ من كانت له أرض فليزرعها أو ليزرعها أخاه ولا يكرها ‏\"‏ ‏.‏ قال نعم ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 3922,
			"arabicnumber": "1536.17",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا سفيان، عن عمرو، عن جابر، أن النبي صلى الله عليه وسلم نهى عن المخابرة ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 3923,
			"arabicnumber": "1536.18",
			"text": "وحدثني حجاج بن الشاعر، حدثنا عبيد الله بن عبد المجيد، حدثنا سليم بن، حيان حدثنا سعيد بن ميناء، قال سمعت جابر بن عبد الله، يقول إن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من كان له فضل أرض فليزرعها أو ليزرعها أخاه ولا تبيعوها ‏\"‏ ‏.‏ فقلت لسعيد ما قوله ولا تبيعوها يعني الكراء ‏.‏ قال نعم ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 3924,
			"arabicnumber": "1536.19",
			"text": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا أبو الزبير، عن جابر، قال كنا نخابر على عهد رسول الله صلى الله عليه وسلم فنصيب من القصري ومن كذا فقال رسول الله صلى الله عليه وسلم ‏ \"‏ من كانت له أرض فليزرعها أو فليحرثها أخاه وإلا فليدعها‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 3925,
			"arabicnumber": "1536.20",
			"text": "حدثني أبو الطاهر، وأحمد بن عيسى، جميعا عن ابن وهب، - قال ابن عيسى حدثنا عبد الله بن وهب، - حدثني هشام بن سعد، أن أبا الزبير المكي، حدثه قال سمعت جابر بن عبد الله، يقول كنا في زمان رسول الله صلى الله عليه وسلم نأخذ الأرض بالثلث أو الربع بالماذيانات فقام رسول الله صلى الله عليه وسلم في ذلك فقال ‏ \"‏ من كانت له أرض فليزرعها فإن لم يزرعها فليمنحها أخاه فإن لم يمنحها أخاه فليمسكها ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 3926,
			"arabicnumber": "1536.21",
			"text": "حدثنا محمد بن المثنى، حدثنا يحيى بن حماد، حدثنا أبو عوانة، عن سليمان، حدثنا أبو سفيان، عن جابر، قال سمعت النبي صلى الله عليه وسلم يقول ‏ \"‏ من كانت له أرض فليهبها أو ليعرها ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 3927,
			"arabicnumber": "1536.22",
			"text": "وحدثنيه حجاج بن الشاعر، حدثنا أبو الجواب، حدثنا عمار بن رزيق، عن الأعمش، بهذا الإسناد غير أنه قال ‏ \"‏ فليزرعها أو فليزرعها رجلا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 3928,
			"arabicnumber": "1536.23",
			"text": "وحدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني عمرو، - وهو ابن الحارث - أن بكيرا، حدثه أن عبد الله بن أبي سلمة حدثه عن النعمان بن أبي عياش، عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم نهى عن كراء الأرض ‏.‏ قال بكير وحدثني نافع، أنه سمع ابن عمر، يقول كنا نكري أرضنا ثم تركنا ذلك حين سمعنا حديث رافع بن خديج ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 3929,
			"arabicnumber": "1536.24",
			"text": "وحدثنا يحيى بن يحيى، أخبرنا أبو خيثمة، عن أبي الزبير، عن جابر، قال نهى رسول الله صلى الله عليه وسلم عن بيع الأرض البيضاء سنتين أو ثلاثا ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 3930,
			"arabicnumber": "1536.25",
			"text": "وحدثنا سعيد بن منصور، وأبو بكر بن شيبة وعمرو الناقد وزهير بن حرب قالوا حدثنا سفيان بن عيينة، عن حميد الأعرج، عن سليمان بن عتيق، عن جابر، قال نهى النبي صلى الله عليه وسلم عن بيع السنين ‏.‏ وفي رواية ابن أبي شيبة عن بيع الثمر سنين ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 3931,
			"arabicnumber": "1544",
			"text": "حدثنا حسن بن علي الحلواني، حدثنا أبو توبة، حدثنا معاوية، عن يحيى بن، أبي كثير عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من كانت له أرض فليزرعها أو ليمنحها أخاه فإن أبى فليمسك أرضه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 3932,
			"arabicnumber": "1536.26",
			"text": "وحدثنا الحسن الحلواني، حدثنا أبو توبة، حدثنا معاوية، عن يحيى بن أبي كثير، أن يزيد بن نعيم، أخبره أن جابر بن عبد الله أخبره أنه، سمع رسول الله صلى الله عليه وسلم ينهى عن المزابنة والحقول ‏.‏ فقال جابر بن عبد الله المزابنة الثمر بالتمر ‏.‏ والحقول كراء الأرض ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 3933,
			"arabicnumber": "1545",
			"text": "حدثنا قتيبة بن سعيد، حدثنا يعقوب، - يعني ابن عبد الرحمن القاري - عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، قال نهى رسول الله صلى الله عليه وسلم عن المحاقلة والمزابنة ‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 3934,
			"arabicnumber": "1546",
			"text": "وحدثني أبو الطاهر، أخبرنا ابن وهب، أخبرني مالك بن أنس، عن داود بن الحصين، أن أبا سفيان، مولى ابن أبي أحمد أخبره أنه، سمع أبا سعيد الخدري، يقول نهى رسول الله صلى الله عليه وسلم عن المزابنة والمحاقلة ‏.‏ والمزابنة اشتراء الثمر في رءوس النخل ‏.‏ والمحاقلة كراء الأرض ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 3935,
			"arabicnumber": "1547.01",
			"text": "حدثنا يحيى بن يحيى، وأبو الربيع العتكي، قال أبو الربيع حدثنا وقال، يحيى أخبرنا حماد بن زيد، عن عمرو، قال سمعت ابن عمر، يقول كنا لا نرى بالخبر بأسا حتى كان عام أول فزعم رافع أن نبي الله صلى الله عليه وسلم نهى عنه ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 3936,
			"arabicnumber": "1547.02",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا سفيان، ح وحدثني علي بن حجر، وإبراهيم، بن دينار قالا حدثنا إسماعيل، - وهو ابن علية - عن أيوب، ح وحدثنا إسحاق بن إبراهيم، أخبرنا وكيع، حدثنا سفيان، كلهم عن عمرو بن دينار، بهذا الإسناد ‏.‏ مثله وزاد في حديث ابن عيينة فتركناه من أجله ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 3937,
			"arabicnumber": "1547.03",
			"text": "وحدثني علي بن حجر، حدثنا إسماعيل، عن أيوب، عن أبي الخليل، عن مجاهد، قال قال ابن عمر لقد منعنا رافع نفع أرضنا ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 3938,
			"arabicnumber": "1547.04",
			"text": "وحدثنا يحيى بن يحيى، أخبرنا يزيد بن زريع، عن أيوب، عن نافع، أن ابن عمر، كان يكري مزارعه على عهد رسول الله صلى الله عليه وسلم وفي إمارة أبي بكر وعمر وعثمان وصدرا من خلافة معاوية حتى بلغه في آخر خلافة معاوية أن رافع بن خديج يحدث فيها بنهى عن النبي صلى الله عليه وسلم فدخل عليه وأنا معه فسأله فقال كان رسول الله صلى الله عليه وسلم ينهى عن كراء المزارع ‏.‏ فتركها ابن عمر بعد ‏.‏ وكان إذا سئل عنها بعد قال زعم رافع بن خديج أن رسول الله صلى الله عليه وسلم نهى عنها ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 3939,
			"arabicnumber": "1547.05",
			"text": "وحدثنا أبو الربيع، وأبو كامل قالا حدثنا حماد، ح وحدثني علي بن حجر، حدثنا إسماعيل، كلاهما عن أيوب، بهذا الإسناد ‏.‏ مثله وزاد في حديث ابن علية قال فتركها ابن عمر بعد ذلك فكان لا يكريها ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 3940,
			"arabicnumber": "1547.06",
			"text": "وحدثنا ابن نمير، حدثنا أبي، حدثنا عبيد الله، عن نافع، قال ذهبت مع ابن عمر إلى رافع بن خديج حتى أتاه بالبلاط فأخبره أن رسول الله صلى الله عليه وسلم نهى عن كراء المزارع ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 3941,
			"arabicnumber": "1547.07",
			"text": "وحدثني ابن أبي خلف، وحجاج بن الشاعر، قالا حدثنا زكرياء بن عدي، أخبرنا عبيد الله بن عمرو، عن زيد، عن الحكم، عن نافع، عن ابن عمر، أنه أتى رافعا فذكر هذا الحديث عن النبي صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 3942,
			"arabicnumber": "1547.08",
			"text": "حدثنا محمد بن المثنى، حدثنا حسين، - يعني ابن حسن بن يسار - حدثنا ابن، عون عن نافع، أن ابن عمر، كان يأجر الأرض - قال - فنبئ حديثا عن رافع بن خديج - قال - فانطلق بي معه إليه - قال - فذكر عن بعض عمومته ذكر فيه عن النبي صلى الله عليه وسلم أنه نهى عن كراء الأرض ‏.‏ قال فتركه ابن عمر فلم يأجره ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 3943,
			"arabicnumber": "1547.09",
			"text": "وحدثنيه محمد بن حاتم، حدثنا يزيد بن هارون، حدثنا ابن عون، بهذا الإسناد وقال فحدثه عن بعض، عمومته عن النبي صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 3944,
			"arabicnumber": "1547.10",
			"text": "وحدثني عبد الملك بن شعيب بن الليث بن سعد، حدثني أبي، عن جدي، حدثني عقيل بن خالد، عن ابن شهاب، أنه قال أخبرني سالم بن عبد الله، أن عبد الله بن عمر، كان يكري أرضيه حتى بلغه أن رافع بن خديج الأنصاري كان ينهى عن كراء الأرض فلقيه عبد الله فقال يا ابن خديج ماذا تحدث عن رسول الله صلى الله عليه وسلم في كراء الأرض قال رافع بن خديج لعبد الله سمعت عمى - وكانا قد شهدا بدرا - يحدثان أهل الدار أن رسول الله صلى الله عليه وسلم نهى عن كراء الأرض ‏.‏ قال عبد الله لقد كنت أعلم في عهد رسول الله صلى الله عليه وسلم أن الأرض تكرى ثم خشي عبد الله أن يكون رسول الله صلى الله عليه وسلم أحدث في ذلك شيئا لم يكن علمه فترك كراء الأرض ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 3945,
			"arabicnumber": "1548.01",
			"text": "وحدثني علي بن حجر السعدي، ويعقوب بن إبراهيم، قالا حدثنا إسماعيل، - وهو ابن علية - عن أيوب، عن يعلى بن حكيم، عن سليمان بن يسار، عن رافع بن خديج، قال كنا نحاقل الأرض على عهد رسول الله صلى الله عليه وسلم فنكريها بالثلث والربع والطعام المسمى فجاءنا ذات يوم رجل من عمومتي فقال نهانا رسول الله صلى الله عليه وسلم عن أمر كان لنا نافعا وطواعية الله ورسوله أنفع لنا نهانا أن نحاقل بالأرض فنكريها على الثلث والربع والطعام المسمى وأمر رب الأرض أن يزرعها أو يزرعها وكره كراءها وما سوى ذلك ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 3946,
			"arabicnumber": "1548.02",
			"text": "وحدثناه يحيى بن يحيى، أخبرنا حماد بن زيد، عن أيوب، قال كتب إلى يعلى بن حكيم قال سمعت سليمان بن يسار، يحدث عن رافع بن خديج، قال كنا نحاقل بالأرض فنكريها على الثلث والربع ‏.‏ ثم ذكر بمثل حديث ابن علية ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 3947,
			"arabicnumber": "1548.03",
			"text": "وحدثنا يحيى بن حبيب، حدثنا خالد بن الحارث، ح وحدثنا عمرو بن علي، حدثنا عبد الأعلى، ح وحدثنا إسحاق بن إبراهيم، أخبرنا عبدة، كلهم عن ابن أبي عروبة، عن يعلى بن حكيم، بهذا الإسناد ‏.‏ مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 3948,
			"arabicnumber": "1548.04",
			"text": "وحدثنيه أبو الطاهر، أخبرنا ابن وهب، أخبرني جرير بن حازم، عن يعلى بن، حكيم بهذا الإسناد عن رافع بن خديج، عن النبي صلى الله عليه وسلم ولم يقل عن بعض عمومته ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 3949,
			"arabicnumber": "1548.05",
			"text": "حدثني إسحاق بن منصور، أخبرنا أبو مسهر، حدثني يحيى بن حمزة، حدثني أبو عمرو الأوزاعي، عن أبي النجاشي، مولى رافع بن خديج عن رافع، أن ظهير بن رافع، - وهو عمه - قال أتاني ظهير فقال لقد نهى رسول الله صلى الله عليه وسلم عن أمر كان بنا رافقا ‏.‏ فقلت وما ذاك ما قال رسول الله صلى الله عليه وسلم فهو حق ‏.‏ قال سألني كيف تصنعون بمحاقلكم فقلت نؤاجرها يا رسول الله على الربيع أو الأوسق من التمر أو الشعير ‏.‏ قال ‏ \"‏ فلا تفعلوا ازرعوها أو أزرعوها أو أمسكوها ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 3950,
			"arabicnumber": "1548.06",
			"text": "حدثنا محمد بن حاتم، حدثنا عبد الرحمن بن مهدي، عن عكرمة بن عمار، عن أبي النجاشي، عن رافع، عن النبي صلى الله عليه وسلم بهذا ولم يذكر عن عمه ظهير",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 3951,
			"arabicnumber": "1547.11",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن ربيعة بن أبي عبد الرحمن، عن حنظلة بن قيس، أنه سأل رافع بن خديج عن كراء الأرض، فقال نهى رسول الله صلى الله عليه وسلم عن كراء الأرض قال فقلت أبالذهب والورق فقال أما بالذهب والورق فلا بأس به ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 3952,
			"arabicnumber": "1547.12",
			"text": "حدثنا إسحاق، أخبرنا عيسى بن يونس، حدثنا الأوزاعي، عن ربيعة بن أبي، عبد الرحمن حدثني حنظلة بن قيس الأنصاري، قال سألت رافع بن خديج عن كراء الأرض، بالذهب والورق فقال لا بأس به إنما كان الناس يؤاجرون على عهد النبي صلى الله عليه وسلم على الماذيانات وأقبال الجداول وأشياء من الزرع فيهلك هذا ويسلم هذا ويسلم هذا ويهلك هذا فلم يكن للناس كراء إلا هذا فلذلك زجر عنه ‏.‏ فأما شىء معلوم مضمون فلا بأس به ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 3953,
			"arabicnumber": "1547.13",
			"text": "حدثنا عمرو الناقد، حدثنا سفيان بن عيينة، عن يحيى بن سعيد، عن حنظلة، الزرقي أنه سمع رافع بن خديج، يقول كنا أكثر الأنصار حقلا - قال - كنا نكري الأرض على أن لنا هذه ولهم هذه فربما أخرجت هذه ولم تخرج هذه فنهانا عن ذلك وأما الورق فلم ينهنا ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 3954,
			"arabicnumber": "1547.14",
			"text": "حدثنا أبو الربيع، حدثنا حماد، ح وحدثنا ابن المثنى، حدثنا يزيد بن هارون، جميعا عن يحيى بن سعيد، بهذا الإسناد نحوه ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 3955,
			"arabicnumber": "1549.01",
			"text": "حدثنا يحيى بن يحيى، أخبرنا عبد الواحد بن زياد، ح وحدثنا أبو بكر بن أبي، شيبة حدثنا علي بن مسهر، كلاهما عن الشيباني، عن عبد الله بن السائب، قال سألت عبد الله بن معقل عن المزارعة، فقال أخبرني ثابت بن الضحاك، أن رسول الله صلى الله عليه وسلم نهى عن المزارعة ‏.‏ وفي رواية ابن أبي شيبة نهى عنها ‏.‏ وقال سألت ابن معقل ‏.‏ ولم يسم عبد الله ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 3956,
			"arabicnumber": "1549.02",
			"text": "حدثنا إسحاق بن منصور، أخبرنا يحيى بن حماد، أخبرنا أبو عوانة، عن سليمان، الشيباني عن عبد الله بن السائب، قال دخلنا على عبد الله بن معقل فسألناه عن المزارعة، فقال زعم ثابت أن رسول الله صلى الله عليه وسلم نهى عن المزارعة وأمر بالمؤاجرة وقال ‏ \"‏ لا بأس بها ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 3957,
			"arabicnumber": "1550.01",
			"text": "حدثنا يحيى بن يحيى، أخبرنا حماد بن زيد، عن عمرو، أن مجاهدا، قال لطاوس انطلق بنا إلى ابن رافع بن خديج فاسمع منه الحديث عن أبيه، عن النبي صلى الله عليه وسلم - قال - فانتهره قال إني والله لو أعلم أن رسول الله صلى الله عليه وسلم نهى عنه ما فعلته ولكن حدثني من هو أعلم به منهم - يعني ابن عباس - أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لأن يمنح الرجل أخاه أرضه خير له من أن يأخذ عليها خرجا معلوما ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 3958,
			"arabicnumber": "1550.02",
			"text": "وحدثنا ابن أبي عمر، حدثنا سفيان، عن عمرو، وابن، طاوس عن طاوس، أنه كان يخابر قال عمرو فقلت له يا أبا عبد الرحمن لو تركت هذه المخابرة فإنهم يزعمون أن النبي صلى الله عليه وسلم نهى عن المخابرة ‏.‏ فقال أى عمرو أخبرني أعلمهم بذلك يعني ابن عباس أن النبي صلى الله عليه وسلم لم ينه عنها إنما قال ‏ \"‏ يمنح أحدكم أخاه خير له من أن يأخذ عليها خرجا معلوما ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 3959,
			"arabicnumber": "1550.03",
			"text": "حدثنا ابن أبي عمر، حدثنا الثقفي، عن أيوب، ح وحدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم جميعا عن وكيع، عن سفيان، ح وحدثنا محمد بن رمح، أخبرنا الليث، عن ابن جريج، ح وحدثني علي بن حجر، حدثنا الفضل بن موسى، عن شريك، عن شعبة، كلهم عن عمرو بن دينار، عن طاوس، عن ابن عباس، عن النبي صلى الله عليه وسلم ‏.‏ نحو حديثهم ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 3960,
			"arabicnumber": "1550.04",
			"text": "وحدثني عبد بن حميد، ومحمد بن رافع، - قال عبد أخبرنا وقال ابن رافع، حدثنا عبد الرزاق، - أخبرنا معمر، عن ابن طاوس، عن أبيه، عن ابن عباس، أن النبي صلى الله عليه وسلم قال ‏ \"‏ لأن يمنح أحدكم أخاه أرضه خير له من أن يأخذ عليها كذا وكذا ‏\"‏ ‏.‏ لشىء معلوم ‏.‏ قال وقال ابن عباس هو الحقل وهو بلسان الأنصار المحاقلة",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 3961,
			"arabicnumber": "1550.05",
			"text": "وحدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا عبد الله بن جعفر الرقي، حدثنا عبيد الله بن عمرو، عن زيد بن أبي أنيسة، عن عبد الملك أبي زيد، عن طاوس، عن ابن، عباس عن النبي صلى الله عليه وسلم قال ‏ \"‏ من كانت له أرض فإنه أن يمنحها أخاه خير ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 160
			}
		}
	]
}