{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"26": "The Book of Vows"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4235,
			"arabicnumber": "1638.01",
			"text": "حدثنا يحيى بن يحيى التميمي، ومحمد بن رمح بن المهاجر، قالا أخبرنا الليث، ح وحدثنا قتيبة بن سعيد، حدثنا ليث، عن ابن شهاب، عن عبيد الله بن عبد الله، عن ابن، عباس أنه قال استفتى سعد بن عبادة رسول الله صلى الله عليه وسلم في نذر كان على أمه توفيت قبل أن تقضيه قال رسول الله صلى الله عليه وسلم ‏ \"‏ فاقضه عنها‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 4236,
			"arabicnumber": "1638.02",
			"text": "وحدثنا يحيى بن يحيى، قال قرأت على مالك ح وحدثنا أبو بكر بن أبي شيبة، وعمرو الناقد وإسحاق بن إبراهيم عن ابن عيينة، ح وحدثني حرملة بن يحيى، أخبرنا ابن وهب، أخبرني يونس، ح وحدثنا إسحاق بن إبراهيم، وعبد بن حميد، قالا أخبرنا عبد الرزاق، أخبرنا معمر، ح وحدثنا عثمان بن أبي شيبة، حدثنا عبدة بن سليمان، عن هشام بن عروة، عن بكر بن وائل، كلهم عن الزهري، ‏.‏ بإسناد الليث ومعنى حديثه ‏.‏",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 4237,
			"arabicnumber": "1639.01",
			"text": "وحدثني زهير بن حرب، وإسحاق بن إبراهيم، قال إسحاق أخبرنا وقال، زهير حدثنا جرير، عن منصور، عن عبد الله بن مرة، عن عبد الله بن عمر، قال أخذ رسول الله صلى الله عليه وسلم يوما ينهانا عن النذر ويقول ‏ \"‏ إنه لا يرد شيئا وإنما يستخرج به من الشحيح ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4238,
			"arabicnumber": "1639.02",
			"text": "حدثنا محمد بن يحيى، حدثنا يزيد بن أبي حكيم، عن سفيان، عن عبد الله بن، دينار عن ابن عمر، عن النبي صلى الله عليه وسلم أنه قال ‏ \"‏ النذر لا يقدم شيئا ولا يؤخره وإنما يستخرج به من البخيل ‏\"‏ ‏",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 4239,
			"arabicnumber": "1639.03",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا غندر، عن شعبة، ح وحدثنا محمد بن المثنى، وابن بشار - واللفظ لابن المثنى - حدثنا محمد بن جعفر، حدثنا شعبة، عن منصور، عن عبد الله بن مرة، عن ابن عمر، عن النبي صلى الله عليه وسلم أنه نهى عن النذر وقال ‏ \"‏ إنه لا يأتي بخير وإنما يستخرج به من البخيل ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 4240,
			"arabicnumber": "1639.04",
			"text": "وحدثني محمد بن رافع، حدثنا يحيى بن آدم، حدثنا مفضل، ح وحدثنا محمد، بن المثنى وابن بشار قالا حدثنا عبد الرحمن، عن سفيان، كلاهما عن منصور، بهذا الإسناد نحو حديث جرير ‏.‏",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 4241,
			"arabicnumber": "1640.01",
			"text": "وحدثنا قتيبة بن سعيد، حدثنا عبد العزيز، - يعني الدراوردي - عن العلاء، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا تنذروا فإن النذر لا يغني من القدر شيئا وإنما يستخرج به من البخيل ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 4242,
			"arabicnumber": "1640.02",
			"text": "وحدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، قال سمعت العلاء، يحدث عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم أنه نهى عن النذر وقال ‏ \"‏ إنه لا يرد من القدر وإنما يستخرج به من البخيل ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 4243,
			"arabicnumber": "1640.03",
			"text": "حدثنا يحيى بن أيوب، وقتيبة بن سعيد، وعلي بن حجر، قالوا حدثنا إسماعيل، - وهو ابن جعفر - عن عمرو، - وهو ابن أبي عمرو - عن عبد الرحمن الأعرج، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏ \"‏ إن النذر لا يقرب من ابن آدم شيئا لم يكن الله قدره له ولكن النذر يوافق القدر فيخرج بذلك من البخيل ما لم يكن البخيل يريد أن يخرج ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 4244,
			"arabicnumber": "1640.04",
			"text": "حدثنا قتيبة بن سعيد، حدثنا يعقوب، - يعني ابن عبد الرحمن القاري - وعبد العزيز - يعني الدراوردي - كلاهما عن عمرو بن أبي عمرو بهذا الإسناد مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 4245,
			"arabicnumber": "1641.01",
			"text": "وحدثني زهير بن حرب، وعلي بن حجر السعدي، - واللفظ لزهير - قالا حدثنا إسماعيل بن إبراهيم، حدثنا أيوب، عن أبي قلابة، عن أبي المهلب، عن عمران بن حصين، قال كانت ثقيف حلفاء لبني عقيل فأسرت ثقيف رجلين من أصحاب رسول الله صلى الله عليه وسلم وأسر أصحاب رسول الله صلى الله عليه وسلم رجلا من بني عقيل وأصابوا معه العضباء فأتى عليه رسول الله صلى الله عليه وسلم وهو في الوثاق قال يا محمد ‏.‏ فأتاه فقال ‏\"‏ ما شأنك ‏\"‏ ‏.‏ فقال بم أخذتني وبم أخذت سابقة الحاج فقال إعظاما لذلك ‏\"‏ أخذتك بجريرة حلفائك ثقيف ‏\"‏ ‏.‏ ثم انصرف عنه فناداه فقال يا محمد يا محمد ‏.‏ وكان رسول الله صلى الله عليه وسلم رحيما رقيقا فرجع إليه فقال ‏\"‏ ما شأنك ‏\"‏ ‏.‏ قال إني مسلم ‏.‏ قال ‏\"‏ لو قلتها وأنت تملك أمرك أفلحت كل الفلاح ‏\"‏ ‏.‏ ثم انصرف فناداه فقال يا محمد يا محمد ‏.‏ فأتاه فقال ‏\"‏ ما شأنك ‏\"‏ ‏.‏ قال إني جائع فأطعمني وظمآن فأسقني ‏.‏ قال ‏\"‏ هذه حاجتك ‏\"‏ ‏.‏ ففدي بالرجلين - قال - وأسرت امرأة من الأنصار وأصيبت العضباء فكانت المرأة في الوثاق وكان القوم يريحون نعمهم بين يدى بيوتهم فانفلتت ذات ليلة من الوثاق فأتت الإبل فجعلت إذا دنت من البعير رغا فتتركه حتى تنتهي إلى العضباء فلم ترغ قال وناقة منوقة فقعدت في عجزها ثم زجرتها فانطلقت ونذروا بها فطلبوها فأعجزتهم - قال - ونذرت لله إن نجاها الله عليها لتنحرنها فلما قدمت المدينة رآها الناس ‏.‏ فقالوا العضباء ناقة رسول الله صلى الله عليه وسلم ‏.‏ فقالت إنها نذرت إن نجاها الله عليها لتنحرنها ‏.‏ فأتوا رسول الله صلى الله عليه وسلم فذكروا ذلك له ‏.‏ فقال ‏\"‏ سبحان الله بئسما جزتها نذرت لله إن نجاها الله عليها لتنحرنها لا وفاء لنذر في معصية ولا فيما لا يملك العبد ‏\"‏ ‏.‏ وفي رواية ابن حجر ‏\"‏ لا نذر في معصية الله ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 4246,
			"arabicnumber": "1641.02",
			"text": "حدثنا أبو الربيع العتكي، حدثنا حماد يعني ابن زيد، ح وحدثنا إسحاق بن إبراهيم، وابن أبي عمر عن عبد الوهاب الثقفي، كلاهما عن أيوب، بهذا الإسناد نحوه وفي حديث حماد قال كانت العضباء لرجل من بني عقيل وكانت من سوابق الحاج وفي حديثه أيضا فأتت على ناقة ذلول مجرسة ‏.‏ وفي حديث الثقفي وهي ناقة مدربة ‏.‏",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 4247,
			"arabicnumber": "1642",
			"text": "حدثنا يحيى بن يحيى التميمي، أخبرنا يزيد بن زريع، عن حميد، عن ثابت، عن أنس، ح. وحدثنا ابن أبي عمر، - واللفظ له - حدثنا مروان بن معاوية الفزاري، حدثنا حميد، حدثني ثابت، عن أنس، أن النبي صلى الله عليه وسلم رأى شيخا يهادى بين ابنيه فقال ‏\"‏ ما بال هذا ‏\"‏ ‏.‏ قالوا نذر أن يمشي ‏.‏ قال ‏\"‏ إن الله عن تعذيب هذا نفسه لغني ‏\"‏ ‏.‏ وأمره أن يركب ‏.‏",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 4248,
			"arabicnumber": "1643.01",
			"text": "وحدثنا يحيى بن أيوب، وقتيبة، وابن، حجر قالوا حدثنا إسماعيل، - وهو ابن جعفر - عن عمرو، - وهو ابن أبي عمرو - عن عبد الرحمن الأعرج، عن أبي هريرة، أن النبي صلى الله عليه وسلم أدرك شيخا يمشي بين ابنيه يتوكأ عليهما فقال النبي صلى الله عليه وسلم ‏\"‏ ما شأن هذا ‏\"‏ ‏.‏ قال ابناه يا رسول الله كان عليه نذر ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ اركب أيها الشيخ فإن الله غني عنك وعن نذرك ‏\"‏ ‏.‏ واللفظ لقتيبة وابن حجر ‏.‏",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 4249,
			"arabicnumber": "1643.02",
			"text": "وحدثنا قتيبة بن سعيد، حدثنا عبد العزيز، - يعني الدراوردي - عن عمرو، بن أبي عمرو بهذا الإسناد مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 4250,
			"arabicnumber": "1644.01",
			"text": "وحدثنا زكرياء بن يحيى بن صالح المصري، حدثنا المفضل، - يعني ابن فضالة - حدثني عبد الله بن عياش، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر، أنه قال نذرت أختي أن تمشي، إلى بيت الله حافية فأمرتني أن أستفتي لها رسول الله صلى الله عليه وسلم فاستفتيته فقال ‏ \"‏ لتمش ولتركب ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 4253,
			"arabicnumber": "1645",
			"text": "وحدثني هارون بن سعيد الأيلي، ويونس بن عبد الأعلى، وأحمد بن عيسى، قال يونس أخبرنا وقال الآخران، حدثنا ابن وهب، أخبرني عمرو بن الحارث، عن كعب بن، علقمة عن عبد الرحمن بن شماسة، عن أبي الخير، عن عقبة بن عامر، عن رسول الله صلى الله عليه وسلم قال ‏ \"‏ كفارة النذر كفارة اليمين ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 18
			}
		}
	]
}