{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"27": "The Book of Oaths"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4254,
			"arabicnumber": "1646.01",
			"text": "وحدثني أبو الطاهر، أحمد بن عمرو بن سرح حدثنا ابن وهب، عن يونس، ح وحدثني حرملة بن يحيى، أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، عن سالم بن، عبد الله عن أبيه، قال سمعت عمر بن الخطاب، يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن الله عز وجل ينهاكم أن تحلفوا بآبائكم ‏\"‏ ‏.‏ قال عمر فوالله ما حلفت بها منذ سمعت رسول الله صلى الله عليه وسلم نهى عنها ذاكرا ولا آثرا ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 4255,
			"arabicnumber": "1646.02",
			"text": "وحدثني عبد الملك بن شعيب بن الليث، حدثني أبي، عن جدي، حدثني عقيل بن، خالد ح وحدثنا إسحاق بن إبراهيم، وعبد بن حميد، قالا حدثنا عبد الرزاق، أخبرنا معمر، كلاهما عن الزهري، بهذا الإسناد ‏.‏ مثله غير أن في حديث عقيل ما حلفت بها منذ سمعت رسول الله صلى الله عليه وسلم ينهى عنها ولا تكلمت بها ‏.‏ ولم يقل ذاكرا ولا آثرا ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 4256,
			"arabicnumber": "1646.03",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، وزهير بن حرب، قالوا حدثنا سفيان، بن عيينة عن الزهري، عن سالم، عن أبيه، قال سمع النبي صلى الله عليه وسلم عمر وهو يحلف بأبيه ‏.‏ بمثل رواية يونس ومعمر ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4257,
			"arabicnumber": "1646.04",
			"text": "وحدثنا قتيبة بن سعيد، حدثنا ليث، ح وحدثنا محمد بن رمح، - واللفظ له - أخبرنا الليث، عن نافع، عن عبد الله، عن رسول الله صلى الله عليه وسلم أنه أدرك عمر بن الخطاب في ركب وعمر يحلف بأبيه فناداهم رسول الله صلى الله عليه وسلم ‏ \"‏ ألا إن الله عز وجل ينهاكم أن تحلفوا بآبائكم فمن كان حالفا فليحلف بالله أو ليصمت ‏\"‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 4258,
			"arabicnumber": "1646.05",
			"text": "وحدثنا محمد بن عبد الله بن نمير، حدثنا أبي ح، وحدثنا محمد بن المثنى، حدثنا يحيى، - وهو القطان - عن عبيد الله، ح وحدثني بشر بن هلال، حدثنا عبد الوارث، حدثنا أيوب، ح وحدثنا أبو كريب، حدثنا أبو أسامة، عن الوليد بن كثير، ح وحدثنا ابن أبي عمر، حدثنا سفيان، عن إسماعيل بن أمية، ح وحدثنا ابن رافع، حدثنا ابن أبي فديك، أخبرنا الضحاك، وابن أبي ذئب، ح وحدثنا إسحاق بن إبراهيم، وابن، رافع عن عبد الرزاق، عن ابن جريج، أخبرني عبد الكريم، ‏.‏ كل هؤلاء عن نافع، عن ابن عمر، بمثل هذه القصة عن النبي صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 4259,
			"arabicnumber": "1646.06",
			"text": "وحدثنا يحيى بن يحيى، ويحيى بن أيوب، وقتيبة، وابن، حجر قال يحيى بن يحيى أخبرنا وقال الآخرون، حدثنا إسماعيل، - وهو ابن جعفر - عن عبد الله بن دينار، أنه سمع ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من كان حالفا فلا يحلف إلا بالله ‏\"‏ ‏.‏ وكانت قريش تحلف بآبائها فقال ‏\"‏ لا تحلفوا بآبائكم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 4260,
			"arabicnumber": "1647.01",
			"text": "حدثني أبو الطاهر، حدثنا ابن وهب، عن يونس، ح وحدثني حرملة بن يحيى، أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، أخبرني حميد بن عبد الرحمن بن عوف، أن أبا هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من حلف منكم فقال في حلفه باللات ‏.‏ فليقل لا إله إلا الله ‏.‏ ومن قال لصاحبه تعال أقامرك ‏.‏ فليتصدق ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 4261,
			"arabicnumber": "1647.02",
			"text": "وحدثني سويد بن سعيد، حدثنا الوليد بن مسلم، عن الأوزاعي، ح وحدثنا إسحاق، بن إبراهيم وعبد بن حميد قالا حدثنا عبد الرزاق، أخبرنا معمر، كلاهما عن الزهري، بهذا الإسناد وحديث معمر مثل حديث يونس غير أنه قال ‏\"‏ فليتصدق بشىء ‏\"‏ ‏.‏ وفي حديث الأوزاعي ‏\"‏ من حلف باللات والعزى ‏\"‏ ‏.‏ قال أبو الحسين مسلم هذا الحرف - يعني قوله تعال أقامرك ‏.‏ فليتصدق - لا يرويه أحد غير الزهري قال وللزهري نحو من تسعين حديثا يرويه عن النبي صلى الله عليه وسلم لا يشاركه فيه أحد بأسانيد جياد ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 4262,
			"arabicnumber": "1648",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الأعلى، عن هشام، عن الحسن، عن عبد، الرحمن بن سمرة قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا تحلفوا بالطواغي ولا بآبائكم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 4263,
			"arabicnumber": "1649.01",
			"text": "حدثنا خلف بن هشام، وقتيبة بن سعيد، ويحيى بن حبيب الحارثي، - واللفظ لخلف - قالوا حدثنا حماد بن زيد، عن غيلان بن جرير، عن أبي بردة، عن أبي موسى، الأشعري قال أتيت النبي صلى الله عليه وسلم في رهط من الأشعريين نستحمله فقال ‏\"‏ والله لا أحملكم وما عندي ما أحملكم عليه ‏\"‏ ‏.‏ قال فلبثنا ما شاء الله ثم أتي بإبل فأمر لنا بثلاث ذود غر الذرى فلما انطلقنا قلنا - أو قال بعضنا لبعض - لا يبارك الله لنا أتينا رسول الله صلى الله عليه وسلم نستحمله فحلف أن لا يحملنا ثم حملنا ‏.‏ فأتوه فأخبروه فقال ‏\"‏ ما أنا حملتكم ولكن الله حملكم وإني والله إن شاء الله لا أحلف على يمين ثم أرى خيرا منها إلا كفرت عن يميني وأتيت الذي هو خير ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 4264,
			"arabicnumber": "1649.02",
			"text": "حدثنا عبد الله بن براد الأشعري، ومحمد بن العلاء الهمداني، - وتقاربا في اللفظ - قالا حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى، قال أرسلني أصحابي إلى رسول الله صلى الله عليه وسلم أسأله لهم الحملان إذ هم معه في جيش العسرة - وهي غزوة تبوك - فقلت يا نبي الله إن أصحابي أرسلوني إليك لتحملهم ‏.‏ فقال ‏\"‏ والله لا أحملكم على شىء ‏\"‏ ‏.‏ ووافقته وهو غضبان ولا أشعر فرجعت حزينا من منع رسول الله صلى الله عليه وسلم ومن مخافة أن يكون رسول الله صلى الله عليه وسلم قد وجد في نفسه على فرجعت إلى أصحابي فأخبرتهم الذي قال رسول الله صلى الله عليه وسلم فلم ألبث إلا سويعة إذ سمعت بلالا ينادي أى عبد الله بن قيس ‏.‏ فأجبته فقال أجب رسول الله صلى الله عليه وسلم يدعوك ‏.‏ فلما أتيت رسول الله صلى الله عليه وسلم قال ‏\"‏ خذ هذين القرينين وهذين القرينين وهذين القرينين - لستة أبعرة ابتاعهن حينئذ من سعد - فانطلق بهن إلى أصحابك فقل إن الله - أو قال إن رسول الله صلى الله عليه وسلم - يحملكم على هؤلاء فاركبوهن ‏\"‏ ‏.‏ قال أبو موسى فانطلقت إلى أصحابي بهن فقلت إن رسول الله صلى الله عليه وسلم يحملكم على هؤلاء ولكن والله لا أدعكم حتى ينطلق معي بعضكم إلى من سمع مقالة رسول الله صلى الله عليه وسلم حين سألته لكم ومنعه في أول مرة ثم إعطاءه إياى بعد ذلك لا تظنوا أني حدثتكم شيئا لم يقله ‏.‏ فقالوا لي والله إنك عندنا لمصدق ولنفعلن ما أحببت ‏.‏ فانطلق أبو موسى بنفر منهم حتى أتوا الذين سمعوا قول رسول الله صلى الله عليه وسلم ومنعه إياهم ثم إعطاءهم بعد فحدثوهم بما حدثهم به أبو موسى سواء ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 4265,
			"arabicnumber": "1649.03",
			"text": "حدثني أبو الربيع العتكي، حدثنا حماد، - يعني ابن زيد - عن أيوب، عن أبي، قلابة وعن القاسم بن عاصم، عن زهدم الجرمي، - قال أيوب وأنا لحديث القاسم، أحفظ مني لحديث أبي قلابة - قال كنا عند أبي موسى فدعا بمائدته وعليها لحم دجاج فدخل رجل من بني تيم الله أحمر شبيه بالموالي فقال له هلم ‏.‏ فتلكأ فقال هلم فإني قد رأيت رسول الله صلى الله عليه وسلم يأكل منه ‏.‏ فقال الرجل إني رأيته يأكل شيئا فقذرته فحلفت أن لا أطعمه فقال هلم أحدثك عن ذلك إني أتيت رسول الله صلى الله عليه وسلم في رهط من الأشعريين نستحمله فقال ‏\"‏ والله لا أحملكم وما عندي ما أحملكم عليه ‏\"‏ ‏.‏ فلبثنا ما شاء الله فأتي رسول الله صلى الله عليه وسلم بنهب إبل فدعا بنا فأمر لنا بخمس ذود غر الذرى قال فلما انطلقنا قال بعضنا لبعض أغفلنا رسول الله صلى الله عليه وسلم يمينه لا يبارك لنا ‏.‏ فرجعنا إليه فقلنا يا رسول الله إنا أتيناك نستحملك وإنك حلفت أن لا تحملنا ثم حملتنا أفنسيت يا رسول الله قال ‏\"‏ إني والله إن شاء الله لا أحلف على يمين فأرى غيرها خيرا منها إلا أتيت الذي هو خير وتحللتها فانطلقوا فإنما حملكم الله عز وجل ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 4266,
			"arabicnumber": "1649.04",
			"text": "وحدثنا ابن أبي عمر، حدثنا عبد الوهاب الثقفي، عن أيوب، عن أبي قلابة، والقاسم، التميمي عن زهدم الجرمي، قال كان بين هذا الحى من جرم وبين الأشعريين ود وإخاء فكنا عند أبي موسى الأشعري فقرب إليه طعام فيه لحم دجاج ‏.‏ فذكر نحوه ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 4267,
			"arabicnumber": "1649.05",
			"text": "وحدثني علي بن حجر السعدي، وإسحاق بن إبراهيم، وابن، نمير عن إسماعيل، ابن علية عن أيوب، عن القاسم التميمي، عن زهدم الجرمي، ح وحدثنا ابن أبي عمر، حدثنا سفيان، عن أيوب، عن أبي قلابة، عن زهدم الجرمي، ح وحدثني أبو بكر بن إسحاق، حدثنا عفان بن مسلم، حدثنا وهيب، حدثنا أيوب، عن أبي قلابة، والقاسم، عن زهدم الجرمي، قال كنا عند أبي موسى ‏.‏ واقتصوا جميعا الحديث بمعنى حديث حماد بن زيد ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 4268,
			"arabicnumber": "1649.06",
			"text": "وحدثنا شيبان بن فروخ، حدثنا الصعق، - يعني ابن حزن - حدثنا مطر الوراق، حدثنا زهدم الجرمي، قال دخلت على أبي موسى وهو يأكل لحم دجاج وساق الحديث بنحو حديثهم وزاد فيه قال ‏ \"‏ إني والله ما نسيتها ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 4269,
			"arabicnumber": "1649.07",
			"text": "وحدثنا إسحاق بن إبراهيم، أخبرنا جرير، عن سليمان التيمي، عن ضريب بن، نقير القيسي عن زهدم، عن أبي موسى الأشعري، قال أتينا رسول الله صلى الله عليه وسلم نستحمله فقال ‏\"‏ ما عندي ما أحملكم والله ما أحملكم ‏\"‏ ‏.‏ ثم بعث إلينا رسول الله صلى الله عليه وسلم بثلاثة ذود بقع الذرى فقلنا إنا أتينا رسول الله صلى الله عليه وسلم نستحمله فحلف أن لا يحملنا فأتيناه فأخبرناه فقال ‏\"‏ إني لا أحلف على يمين أرى غيرها خيرا منها إلا أتيت الذي هو خير ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 4270,
			"arabicnumber": "1649.08",
			"text": "حدثنا محمد بن عبد الأعلى التيمي، حدثنا المعتمر، عن أبيه، حدثنا أبو السليل، عن زهدم، يحدثه عن أبي موسى، قال كنا مشاة فأتينا نبي الله صلى الله عليه وسلم نستحمله ‏.‏ بنحو حديث جرير ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 4271,
			"arabicnumber": "1650.01",
			"text": "حدثني زهير بن حرب، حدثنا مروان بن معاوية الفزاري، أخبرنا يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، قال أعتم رجل عند النبي صلى الله عليه وسلم ثم رجع إلى أهله فوجد الصبية قد ناموا فأتاه أهله بطعامه فحلف لا يأكل من أجل صبيته ثم بدا له فأكل فأتى رسول الله صلى الله عليه وسلم فذكر ذلك له فقال رسول الله صلى الله عليه وسلم ‏ \"‏ من حلف على يمين فرأى غيرها خيرا منها فليأتها وليكفر عن يمينه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 4272,
			"arabicnumber": "1650.02",
			"text": "وحدثني أبو الطاهر، حدثنا عبد الله بن وهب، أخبرني مالك، عن سهيل بن أبي، صالح عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من حلف على يمين فرأى غيرها خيرا منها فليكفر عن يمينه وليفعل ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 4273,
			"arabicnumber": "1650.03",
			"text": "وحدثني زهير بن حرب، حدثنا ابن أبي أويس، حدثني عبد العزيز بن المطلب، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من حلف على يمين فرأى غيرها خيرا منها فليأت الذي هو خير وليكفر عن يمينه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 4274,
			"arabicnumber": "1650.04",
			"text": "وحدثني القاسم بن زكرياء، حدثنا خالد بن مخلد، حدثني سليمان، - يعني ابن بلال - حدثني سهيل، في هذا الإسناد بمعنى حديث مالك ‏ \"‏ فليكفر يمينه وليفعل الذي هو خير ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 4275,
			"arabicnumber": "1651.01",
			"text": "حدثنا قتيبة بن سعيد، حدثنا جرير، عن عبد العزيز، - يعني ابن رفيع - عن تميم بن طرفة، قال جاء سائل إلى عدي بن حاتم فسأله نفقة في ثمن خادم أو في بعض ثمن خادم ‏.‏ فقال ليس عندي ما أعطيك إلا درعي ومغفري فأكتب إلى أهلي أن يعطوكها ‏.‏ قال فلم يرض فغضب عدي فقال أما والله لا أعطيك شيئا ثم إن الرجل رضي فقال أما والله لولا أني سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ من حلف على يمين ثم رأى أتقى لله منها فليأت التقوى ‏\"‏ ‏.‏ ما حنثت يميني ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 4276,
			"arabicnumber": "1651.02",
			"text": "وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن عبد العزيز بن رفيع، عن تميم بن طرفة، عن عدي بن حاتم، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من حلف على يمين فرأى غيرها خيرا منها فليأت الذي هو خير وليترك يمينه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 4277,
			"arabicnumber": "1651.03",
			"text": "حدثني محمد بن عبد الله بن نمير، ومحمد بن طريف البجلي، - واللفظ لابن طريف - قالا حدثنا محمد بن فضيل، عن الأعمش، عن عبد العزيز بن رفيع، عن تميم الطائي، عن عدي، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا حلف أحدكم على اليمين فرأى خيرا منها فليكفرها وليأت الذي هو خير ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 4278,
			"arabicnumber": "1651.04",
			"text": "وحدثنا محمد بن طريف، حدثنا محمد بن فضيل، عن الشيباني، عن عبد العزيز، بن رفيع عن تميم الطائي، عن عدي بن حاتم، أنه سمع النبي صلى الله عليه وسلم يقول ذلك ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 4279,
			"arabicnumber": "1651.05",
			"text": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن سماك بن حرب، عن تميم بن طرفة، قال سمعت عدي بن حاتم، وأتاه، رجل يسأله مائة درهم ‏.‏ فقال تسألني مائة درهم وأنا ابن حاتم والله لا أعطيك ‏.‏ ثم قال لولا أني سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ من حلف على يمين ثم رأى خيرا منها فليأت الذي هو خير ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 4280,
			"arabicnumber": "1651.06",
			"text": "حدثني محمد بن حاتم، حدثنا بهز، حدثنا شعبة، حدثنا سماك بن حرب، قال سمعت تميم بن طرفة، قال سمعت عدي بن حاتم، أن رجلا، سأله فذكر مثله وزاد ولك أربعمائة في عطائي ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 4281,
			"arabicnumber": "1652.01",
			"text": "حدثنا شيبان بن فروخ، حدثنا جرير بن حازم، حدثنا الحسن، حدثنا عبد الرحمن، بن سمرة قال قال لي رسول الله صلى الله عليه وسلم ‏ \"‏ يا عبد الرحمن بن سمرة لا تسأل الإمارة فإنك إن أعطيتها عن مسألة وكلت إليها وإن أعطيتها عن غير مسألة أعنت عليها وإذا حلفت على يمين فرأيت غيرها خيرا منها فكفر عن يمينك وائت الذي هو خير ‏\"‏ ‏.‏ قال أبو أحمد الجلودي حدثنا أبو العباس الماسرجسي، حدثنا شيبان بن فروخ، ‏.‏ بهذا الحديث ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 4282,
			"arabicnumber": "1652.02",
			"text": "حدثني علي بن حجر السعدي، حدثنا هشيم، عن يونس، ومنصور، وحميد، ح وحدثنا أبو كامل الجحدري، حدثنا حماد بن زيد، عن سماك بن عطية، ويونس بن عبيد، وهشام، بن حسان في آخرين ح وحدثنا عبيد الله بن معاذ، حدثنا المعتمر، عن أبيه، ح وحدثنا عقبة بن مكرم العمي، حدثنا سعيد بن عامر، عن سعيد، عن قتادة، كلهم عن الحسن، عن عبد الرحمن بن سمرة، عن النبي صلى الله عليه وسلم ‏.‏ بهذا الحديث وليس في حديث المعتمر عن أبيه ذكر الإمارة ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 4283,
			"arabicnumber": "1653.01",
			"text": "حدثنا يحيى بن يحيى، وعمرو الناقد، - قال يحيى أخبرنا هشيم بن بشير، عن عبد الله بن أبي صالح، وقال، عمرو حدثنا هشيم بن بشير، أخبرنا عبد الله بن أبي صالح، - عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يمينك على ما يصدقك عليه صاحبك ‏\"‏ ‏.‏ وقال عمرو ‏\"‏ يصدقك به صاحبك ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 4284,
			"arabicnumber": "1653.02",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، عن هشيم، عن عباد بن، أبي صالح عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ اليمين على نية المستحلف ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 4285,
			"arabicnumber": "1654.01",
			"text": "حدثني أبو الربيع العتكي، وأبو كامل الجحدري فضيل بن حسين - واللفظ لأبي الربيع - قالا حدثنا حماد، - وهو ابن زيد - حدثنا أيوب، عن محمد، عن أبي هريرة، قال كان لسليمان ستون امرأة فقال لأطوفن عليهن الليلة فتحمل كل واحدة منهن فتلد كل واحدة منهن غلاما فارسا يقاتل في سبيل الله فلم تحمل منهن إلا واحدة فولدت نصف إنسان فقال رسول الله صلى الله عليه وسلم ‏ \"‏ لو كان استثنى لولدت كل واحدة منهن غلاما فارسا يقاتل في سبيل الله ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 4286,
			"arabicnumber": "1654.02",
			"text": "وحدثنا محمد بن عباد، وابن أبي عمر، - واللفظ لابن أبي عمر - قالا حدثنا سفيان، عن هشام بن حجير، عن طاوس، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ قال سليمان بن داود نبي الله لأطوفن الليلة على سبعين امرأة كلهن تأتي بغلام يقاتل في سبيل الله ‏.‏ فقال له صاحبه أو الملك قل إن شاء الله ‏.‏ فلم يقل ونسي ‏.‏ فلم تأت واحدة من نسائه إلا واحدة جاءت بشق غلام ‏\"‏ ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ولو قال إن شاء الله ‏.‏ لم يحنث وكان دركا له في حاجته ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 4287,
			"arabicnumber": "1654.03",
			"text": "وحدثنا ابن أبي عمر، حدثنا سفيان، عن أبي الزناد، عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم مثله أو نحوه ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 4288,
			"arabicnumber": "1654.04",
			"text": "وحدثنا عبد بن حميد، أخبرنا عبد الرزاق بن همام، أخبرنا معمر، عن ابن طاوس، عن أبيه، عن أبي هريرة، قال قال سليمان بن داود لأطيفن الليلة على سبعين امرأة تلد كل امرأة منهن غلاما يقاتل في سبيل الله ‏.‏ فقيل له قل إن شاء الله ‏.‏ فلم يقل ‏.‏ فأطاف بهن فلم تلد منهن إلا امرأة واحدة نصف إنسان ‏.‏ قال فقال رسول الله صلى الله عليه وسلم ‏ \"‏ لو قال إن شاء الله ‏.‏ لم يحنث وكان دركا لحاجته ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 4289,
			"arabicnumber": "1654.05",
			"text": "وحدثني زهير بن حرب، حدثنا شبابة، حدثني ورقاء، عن أبي الزناد، عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ قال سليمان بن داود لأطوفن الليلة على تسعين امرأة كلها تأتي بفارس يقاتل في سبيل الله ‏.‏ فقال له صاحبه قل إن شاء الله ‏.‏ فلم يقل إن شاء الله ‏.‏ فطاف عليهن جميعا فلم تحمل منهن إلا امرأة واحدة فجاءت بشق رجل وايم الذي نفس محمد بيده لو قال إن شاء الله ‏.‏ لجاهدوا في سبيل الله فرسانا أجمعون ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 4290,
			"arabicnumber": "1654.06",
			"text": "وحدثنيه سويد بن سعيد، حدثنا حفص بن ميسرة، عن موسى بن عقبة، عن أبي، الزناد بهذا الإسناد مثله ‏.‏ غير أنه قال ‏ \"‏ كلها تحمل غلاما يجاهد في سبيل الله ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 4291,
			"arabicnumber": "1655",
			"text": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏ \"‏ والله لأن يلج أحدكم بيمينه في أهله آثم له عند الله من أن يعطي كفارته التي فرض الله ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 4292,
			"arabicnumber": "1656.01",
			"text": "حدثنا محمد بن أبي بكر المقدمي، ومحمد بن المثنى، وزهير بن حرب، - واللفظ لزهير - قالوا حدثنا يحيى، - وهو ابن سعيد القطان - عن عبيد الله، قال أخبرني نافع، عن ابن عمر، أن عمر، قال يا رسول الله إني نذرت في الجاهلية أن أعتكف ليلة في المسجد الحرام ‏.‏ قال ‏ \"‏ فأوف بنذرك ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 4293,
			"arabicnumber": "1656.02",
			"text": "وحدثنا أبو سعيد الأشج، حدثنا أبو أسامة، ح وحدثنا محمد بن المثنى، حدثنا عبد الوهاب يعني الثقفي، ح وحدثنا أبو بكر بن أبي شيبة، ومحمد بن العلاء، وإسحاق، بن إبراهيم جميعا عن حفص بن غياث، ح وحدثنا محمد بن عمرو بن جبلة بن أبي رواد، حدثنا محمد بن جعفر، حدثنا شعبة، كلهم عن عبيد الله، عن نافع، عن ابن عمر، وقال، حفص من بينهم عن عمر، بهذا الحديث أما أبو أسامة والثقفي ففي حديثهما اعتكاف ليلة ‏.‏ وأما في حديث شعبة فقال جعل عليه يوما يعتكفه ‏.‏ وليس في حديث حفص ذكر يوم ولا ليلة ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 4294,
			"arabicnumber": "1656.03",
			"text": "وحدثني أبو الطاهر، أخبرنا عبد الله بن وهب، حدثنا جرير بن حازم، أن أيوب، حدثه أن نافعا حدثه أن عبد الله بن عمر حدثه أن عمر بن الخطاب سأل رسول الله صلى الله عليه وسلم وهو بالجعرانة بعد أن رجع من الطائف فقال يا رسول الله إني نذرت في الجاهلية أن أعتكف يوما في المسجد الحرام فكيف ترى قال ‏ \"‏ اذهب فاعتكف يوما ‏\"‏ ‏.‏ قال وكان رسول الله صلى الله عليه وسلم قد أعطاه جارية من الخمس فلما أعتق رسول الله صلى الله عليه وسلم سبايا الناس سمع عمر بن الخطاب أصواتهم يقولون أعتقنا رسول الله صلى الله عليه وسلم ‏.‏ فقال ما هذا فقالوا أعتق رسول الله صلى الله عليه وسلم سبايا الناس ‏.‏ فقال عمر يا عبد الله اذهب إلى تلك الجارية فخل سبيلها ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 4295,
			"arabicnumber": "1656.04",
			"text": "وحدثنا عبد بن حميد، أخبرنا عبد الرزاق، أخبرنا معمر، عن أيوب، عن نافع، عن ابن عمر، قال لما قفل النبي صلى الله عليه وسلم من حنين سأل عمر رسول الله صلى الله عليه وسلم عن نذر كان نذره في الجاهلية اعتكاف يوم ‏.‏ ثم ذكر بمعنى حديث جرير بن حازم ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 4296,
			"arabicnumber": "1656.05",
			"text": "وحدثنا أحمد بن عبدة الضبي، حدثنا حماد بن زيد، حدثنا أيوب، عن نافع، قال ذكر عند ابن عمر عمرة رسول الله صلى الله عليه وسلم من الجعرانة فقال لم يعتمر منها - قال - وكان عمر نذر اعتكاف ليلة في الجاهلية ‏.‏ ثم ذكر نحو حديث جرير بن حازم ومعمر عن أيوب ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 4297,
			"arabicnumber": "1656.06",
			"text": "وحدثني عبد الله بن عبد الرحمن الدارمي، حدثنا حجاج بن المنهال، حدثنا حماد، عن أيوب، ح وحدثنا يحيى بن خلف، حدثنا عبد الأعلى، عن محمد بن إسحاق، كلاهما عن نافع، عن ابن عمر، ‏.‏ بهذا الحديث في النذر وفي حديثهما جميعا اعتكاف يوم ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 4298,
			"arabicnumber": "1657.01",
			"text": "حدثني أبو كامل، فضيل بن حسين الجحدري حدثنا أبو عوانة، عن فراس، عن ذكوان أبي صالح، عن زاذان أبي عمر، قال أتيت ابن عمر وقد أعتق مملوكا - قال - فأخذ من الأرض عودا أو شيئا فقال ما فيه من الأجر ما يسوى هذا إلا أني سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ من لطم مملوكه أو ضربه فكفارته أن يعتقه ‏\"‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 4299,
			"arabicnumber": "1657.02",
			"text": "وحدثنا محمد بن المثنى، وابن، بشار - واللفظ لابن المثنى - قالا حدثنا محمد، بن جعفر حدثنا شعبة، عن فراس، قال سمعت ذكوان، يحدث عن زاذان، أن ابن عمر، دعا بغلام له فرأى بظهره أثرا فقال له أوجعتك قال لا ‏.‏ قال فأنت عتيق ‏.‏ قال ثم أخذ شيئا من الأرض فقال ما لي فيه من الأجر ما يزن هذا إني سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ من ضرب غلاما له حدا لم يأته أو لطمه فإن كفارته أن يعتقه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 4300,
			"arabicnumber": "1657.03",
			"text": "وحدثناه أبو بكر بن أبي شيبة، حدثنا وكيع، ح وحدثني محمد بن المثنى، حدثنا عبد الرحمن، كلاهما عن سفيان، عن فراس، بإسناد شعبة وأبي عوانة أما حديث ابن مهدي فذكر فيه ‏\"‏ حدا لم يأته ‏\"‏ ‏.‏ وفي حديث وكيع ‏\"‏ من لطم عبده ‏\"‏ ‏.‏ ولم يذكر الحد‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 4301,
			"arabicnumber": "1658.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، ح وحدثنا ابن نمير، - واللفظ له - حدثنا أبي، حدثنا سفيان، عن سلمة بن كهيل، عن معاوية بن سويد، قال لطمت مولى لنا فهربت ثم جئت قبيل الظهر فصليت خلف أبي فدعاه ودعاني ثم قال امتثل منه ‏.‏ فعفا ثم قال كنا بني مقرن على عهد رسول الله صلى الله عليه وسلم ليس لنا إلا خادم واحدة فلطمها أحدنا فبلغ ذلك النبي صلى الله عليه وسلم فقال ‏\"‏ أعتقوها ‏\"‏ ‏.‏ قالوا ليس لهم خادم غيرها قال ‏\"‏ فليستخدموها فإذا استغنوا عنها فليخلوا سبيلها ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 4302,
			"arabicnumber": "1658.02",
			"text": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن عبد الله بن نمير، - واللفظ لأبي بكر - قالا حدثنا ابن إدريس، عن حصين، عن هلال بن يساف، قال عجل شيخ فلطم خادما له فقال له سويد بن مقرن عجز عليك إلا حر وجهها لقد رأيتني سابع سبعة من بني مقرن ما لنا خادم إلا واحدة لطمها أصغرنا فأمرنا رسول الله صلى الله عليه وسلم أن نعتقها ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 4303,
			"arabicnumber": "1658.03",
			"text": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا ابن أبي عدي، عن شعبة، عن حصين، عن هلال بن يساف، قال كنا نبيع البز في دار سويد بن مقرن أخي النعمان بن مقرن فخرجت جارية فقالت لرجل منا كلمة فلطمها فغضب سويد ‏.‏ فذكر نحو حديث ابن إدريس ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 4304,
			"arabicnumber": "1658.04",
			"text": "وحدثنا عبد الوارث بن عبد الصمد، حدثني أبي، حدثنا شعبة، قال قال لي محمد بن المنكدر ما اسمك قلت شعبة ‏.‏ فقال محمد حدثني أبو شعبة العراقي عن سويد بن مقرن أن جارية له لطمها إنسان فقال له سويد أما علمت أن الصورة محرمة فقال لقد رأيتني وإني لسابع إخوة لي مع رسول الله صلى الله عليه وسلم وما لنا خادم غير واحد فعمد أحدنا فلطمه فأمرنا رسول الله صلى الله عليه وسلم أن نعتقه ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 4305,
			"arabicnumber": "1658.05",
			"text": "وحدثناه إسحاق بن إبراهيم، ومحمد بن المثنى، عن وهب بن جرير، أخبرنا شعبة، قال قال لي محمد بن المنكدر ما اسمك فذكر بمثل حديث عبد الصمد ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 4306,
			"arabicnumber": "1659.01",
			"text": "حدثنا أبو كامل الجحدري، حدثنا عبد الواحد، - يعني ابن زياد - حدثنا الأعمش، عن إبراهيم التيمي، عن أبيه، قال قال أبو مسعود البدري كنت أضرب غلاما لي بالسوط فسمعت صوتا من خلفي ‏\"‏ اعلم أبا مسعود ‏\"‏ ‏.‏ فلم أفهم الصوت من الغضب - قال - فلما دنا مني إذا هو رسول الله صلى الله عليه وسلم فإذا هو يقول ‏\"‏ اعلم أبا مسعود اعلم أبا مسعود ‏\"‏ ‏.‏ قال فألقيت السوط من يدي فقال ‏\"‏ اعلم أبا مسعود أن الله أقدر عليك منك على هذا الغلام ‏\"‏ ‏.‏ قال فقلت لا أضرب مملوكا بعده أبدا ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 4307,
			"arabicnumber": "1659.02",
			"text": "وحدثناه إسحاق بن إبراهيم، أخبرنا جرير، ح وحدثني زهير بن حرب، حدثنا محمد بن حميد، - وهو المعمري - عن سفيان، ح وحدثني محمد بن رافع، حدثنا عبد، الرزاق أخبرنا سفيان، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا عفان، حدثنا أبو عوانة، كلهم عن الأعمش، بإسناد عبد الواحد ‏.‏ نحو حديثه ‏.‏ غير أن في حديث جرير فسقط من يدي السوط من هيبته ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 4308,
			"arabicnumber": "1659.03",
			"text": "وحدثنا أبو كريب، محمد بن العلاء حدثنا أبو معاوية، حدثنا الأعمش، عن إبراهيم، التيمي عن أبيه، عن أبي مسعود الأنصاري، قال كنت أضرب غلاما لي فسمعت من خلفي صوتا ‏\"‏ اعلم أبا مسعود لله أقدر عليك منك عليه ‏\"‏ ‏.‏ فالتفت فإذا هو رسول الله صلى الله عليه وسلم فقلت يا رسول الله هو حر لوجه الله ‏.‏ فقال ‏\"‏ أما لو لم تفعل للفحتك النار أو لمستك النار ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 4309,
			"arabicnumber": "1659.04",
			"text": "وحدثنا محمد بن المثنى، وابن، بشار - واللفظ لابن المثنى - قالا حدثنا ابن، أبي عدي عن شعبة، عن سليمان، عن إبراهيم التيمي، عن أبيه، عن أبي مسعود، أنه كان يضرب غلامه فجعل يقول أعوذ بالله - قال - فجعل يضربه فقال أعوذ برسول الله ‏.‏ فتركه فقال رسول الله صلى الله عليه وسلم ‏ \"‏ والله لله أقدر عليك منك عليه ‏\"‏ ‏.‏ قال فأعتقه ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 4310,
			"arabicnumber": "1659.05",
			"text": "وحدثنيه بشر بن خالد، أخبرنا محمد، - يعني ابن جعفر - عن شعبة، بهذا الإسناد ولم يذكر قوله أعوذ بالله أعوذ برسول الله صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 4311,
			"arabicnumber": "1660.01",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا ابن نمير، ح وحدثنا محمد بن عبد الله بن، نمير حدثنا أبي، حدثنا فضيل بن غزوان، قال سمعت عبد الرحمن بن أبي نعم، حدثني أبو هريرة، قال قال أبو القاسم صلى الله عليه وسلم ‏ \"‏ من قذف مملوكه بالزنا يقام عليه الحد يوم القيامة إلا أن يكون كما قال ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 4312,
			"arabicnumber": "1660.02",
			"text": "وحدثناه أبو كريب، حدثنا وكيع، ح وحدثني زهير بن حرب، حدثنا إسحاق بن، يوسف الأزرق كلاهما عن فضيل بن غزوان، بهذا الإسناد ‏.‏ وفي حديثهما سمعت أبا، القاسم صلى الله عليه وسلم نبي التوبة ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 4313,
			"arabicnumber": "1661.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، حدثنا الأعمش، عن المعرور بن سويد، قال مررنا بأبي ذر بالربذة وعليه برد وعلى غلامه مثله فقلنا يا أبا ذر لو جمعت بينهما كانت حلة ‏.‏ فقال إنه كان بيني وبين رجل من إخواني كلام وكانت أمه أعجمية فعيرته بأمه فشكاني إلى النبي صلى الله عليه وسلم فلقيت النبي صلى الله عليه وسلم فقال ‏\"‏ يا أبا ذر إنك امرؤ فيك جاهلية ‏\"‏ ‏.‏ قلت يا رسول الله من سب الرجال سبوا أباه وأمه ‏.‏ قال ‏\"‏ يا أبا ذر إنك امرؤ فيك جاهلية هم إخوانكم جعلهم الله تحت أيديكم فأطعموهم مما تأكلون وألبسوهم مما تلبسون ولا تكلفوهم ما يغلبهم فإن كلفتموهم فأعينوهم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 4314,
			"arabicnumber": "1661.02",
			"text": "وحدثناه أحمد بن يونس، حدثنا زهير، ح وحدثنا أبو كريب، حدثنا أبو معاوية، ح وحدثنا إسحاق بن إبراهيم، أخبرنا عيسى بن يونس، كلهم عن الأعمش، بهذا الإسناد وزاد في حديث زهير وأبي معاوية بعد قوله ‏\"‏ إنك امرؤ فيك جاهلية ‏\"‏ ‏.‏ قال قلت على حال ساعتي من الكبر قال ‏\"‏ نعم ‏\"‏ ‏.‏ وفي رواية أبي معاوية ‏\"‏ نعم على حال ساعتك من الكبر ‏\"‏ ‏.‏ وفي حديث عيسى ‏\"‏ فإن كلفه ما يغلبه فليبعه ‏\"‏ ‏.‏ وفي حديث زهير ‏\"‏ فليعنه عليه ‏\"‏ ‏.‏ وليس في حديث أبي معاوية ‏\"‏ فليبعه ‏\"‏ ‏.‏ ولا ‏\"‏ فليعنه ‏\"‏ ‏.‏ انتهى عند قوله ‏\"‏ ولا يكلفه ما يغلبه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 4315,
			"arabicnumber": "1661.03",
			"text": "حدثنا محمد بن المثنى، وابن، بشار - واللفظ لابن المثنى - قالا حدثنا محمد، بن جعفر حدثنا شعبة، عن واصل الأحدب، عن المعرور بن سويد، قال رأيت أبا ذر وعليه حلة وعلى غلامه مثلها فسألته عن ذلك قال فذكر أنه ساب رجلا على عهد رسول الله صلى الله عليه وسلم فعيره بأمه - قال - فأتى الرجل النبي صلى الله عليه وسلم فذكر ذلك له فقال النبي صلى الله عليه وسلم ‏ \"‏ إنك امرؤ فيك جاهلية إخوانكم وخولكم جعلهم الله تحت أيديكم فمن كان أخوه تحت يديه فليطعمه مما يأكل وليلبسه مما يلبس ولا تكلفوهم ما يغلبهم فإن كلفتموهم فأعينوهم عليه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 4316,
			"arabicnumber": "1662",
			"text": "وحدثني أبو الطاهر، أحمد بن عمرو بن سرح أخبرنا ابن وهب، أخبرنا عمرو، بن الحارث أن بكير بن الأشج، حدثه عن العجلان، مولى فاطمة عن أبي هريرة، عن رسول الله صلى الله عليه وسلم أنه قال ‏ \"‏ للمملوك طعامه وكسوته ولا يكلف من العمل إلا ما يطيق ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 4317,
			"arabicnumber": "1663",
			"text": "وحدثنا القعنبي، حدثنا داود بن قيس، عن موسى بن يسار، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا صنع لأحدكم خادمه طعامه ثم جاءه به وقد ولي حره ودخانه فليقعده معه فليأكل فإن كان الطعام مشفوها قليلا فليضع في يده منه أكلة أو أكلتين ‏\"‏ ‏.‏ قال داود يعني لقمة أو لقمتين ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 4318,
			"arabicnumber": "1664.01",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إن العبد إذا نصح لسيده وأحسن عبادة الله فله أجره مرتين ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 4319,
			"arabicnumber": "1664.02",
			"text": "وحدثني زهير بن حرب، ومحمد بن المثنى، قالا حدثنا يحيى، وهو القطان ح وحدثنا ابن نمير، حدثنا أبي ح، وحدثنا أبو بكر بن أبي شيبة، حدثنا ابن نمير، وأبو أسامة كلهم عن عبيد الله، ح وحدثنا هارون بن سعيد الأيلي، حدثنا ابن وهب، حدثني أسامة، جميعا عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم بمثل حديث مالك ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 4320,
			"arabicnumber": "1665.01",
			"text": "حدثني أبو الطاهر، وحرملة بن يحيى، قالا أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، قال سمعت سعيد بن المسيب، يقول قال أبو هريرة قال رسول الله صلى الله عليه وسلم ‏\"‏ للعبد المملوك المصلح أجران ‏\"‏ ‏.‏ والذي نفس أبي هريرة بيده لولا الجهاد في سبيل الله والحج وبر أمي لأحببت أن أموت وأنا مملوك ‏.‏ قال وبلغنا أن أبا هريرة لم يكن يحج حتى ماتت أمه لصحبتها ‏.‏ قال أبو الطاهر في حديثه ‏\"‏ للعبد المصلح ‏\"‏ ‏.‏ ولم يذكر المملوك ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 4321,
			"arabicnumber": "1665.02",
			"text": "وحدثنيه زهير بن حرب، حدثنا أبو صفوان الأموي، أخبرني يونس، عن ابن شهاب، بهذا الإسناد ولم يذكر بلغنا وما بعده ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 4322,
			"arabicnumber": "1666.01",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، عن الأعمش، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا أدى العبد حق الله وحق مواليه كان له أجران ‏\"‏ ‏.‏ قال فحدثتها كعبا فقال كعب ليس عليه حساب ولا على مؤمن مزهد ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 4323,
			"arabicnumber": "1666.02",
			"text": "وحدثنيه زهير بن حرب، حدثنا جرير، عن الأعمش، بهذا الإسناد ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 4324,
			"arabicnumber": "1667",
			"text": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال قال رسول الله صلى الله عليه وسلم ‏ \"‏ نعما للمملوك أن يتوفى يحسن عبادة الله وصحابة سيده نعما له ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 4325,
			"arabicnumber": "1501.03",
			"text": "حدثنا يحيى بن يحيى، قال قلت لمالك حدثك نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من أعتق شركا له في عبد فكان له مال يبلغ ثمن العبد قوم عليه قيمة العدل فأعطى شركاءه حصصهم وعتق عليه العبد وإلا فقد عتق منه ما عتق ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 4326,
			"arabicnumber": "1501.04",
			"text": "حدثنا ابن نمير، حدثنا أبي، حدثنا عبيد الله، عن نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من أعتق شركا له من مملوك فعليه عتقه كله إن كان له مال يبلغ ثمنه فإن لم يكن له مال عتق منه ما عتق ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 4327,
			"arabicnumber": "1501.05",
			"text": "وحدثنا شيبان بن فروخ، حدثنا جرير بن حازم، عن نافع، مولى عبد الله بن عمر عن عبد الله بن عمر، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من أعتق نصيبا له في عبد فكان له من المال قدر ما يبلغ قيمته قوم عليه قيمة عدل وإلا فقد عتق منه ما عتق ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 4328,
			"arabicnumber": "1501.06",
			"text": "وحدثنا قتيبة بن سعيد، ومحمد بن رمح، عن الليث بن سعد، ح وحدثنا محمد، بن المثنى حدثنا عبد الوهاب، قال سمعت يحيى بن سعيد، ح وحدثني أبو الربيع، وأبو كامل قالا حدثنا حماد، وهو ابن زيد ح وحدثني زهير بن حرب، حدثنا إسماعيل، - يعني ابن علية - كلاهما عن أيوب، ح وحدثنا إسحاق بن منصور، أخبرنا عبد الرزاق، عن ابن جريج، أخبرني إسماعيل بن أمية، ح وحدثنا محمد بن رافع، حدثنا ابن أبي فديك، عن ابن أبي ذئب، ح وحدثنا هارون بن سعيد الأيلي، أخبرنا ابن وهب، قال أخبرني أسامة، - يعني ابن زيد - كل هؤلاء عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم بهذا الحديث وليس في حديثهم ‏ \"‏ وإن لم يكن له مال فقد عتق منه ما عتق ‏\"‏ ‏.‏ إلا في حديث أيوب ويحيى بن سعيد فإنهما ذكرا هذا الحرف في الحديث وقالا لا ندري أهو شىء في الحديث أو قاله نافع من قبله وليس في رواية أحد منهم سمعت رسول الله صلى الله عليه وسلم ‏.‏ إلا في حديث الليث بن سعد ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 4329,
			"arabicnumber": "1501.07",
			"text": "وحدثنا عمرو الناقد، وابن أبي عمر، كلاهما عن ابن عيينة، قال ابن أبي عمر حدثنا سفيان بن عيينة، عن عمرو، عن سالم بن عبد الله، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من أعتق عبدا بينه وبين آخر قوم عليه في ماله قيمة عدل لا وكس ولا شطط ثم عتق عليه في ماله إن كان موسرا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 4330,
			"arabicnumber": "1501.08",
			"text": "وحدثنا عبد بن حميد، حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن سالم، عن ابن عمر، أن النبي صلى الله عليه وسلم قال ‏ \"‏ من أعتق شركا له في عبد عتق ما بقي في ماله إذا كان له مال يبلغ ثمن العبد ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 4331,
			"arabicnumber": "1502.02",
			"text": "وحدثنا محمد بن المثنى، ومحمد بن بشار، - واللفظ لابن المثنى - قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن قتادة، عن النضر بن أنس، عن بشير بن نهيك، عن أبي، هريرة عن النبي صلى الله عليه وسلم قال في المملوك بين الرجلين فيعتق أحدهما قال ‏ \"‏ يضمن ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 4332,
			"arabicnumber": "1503.04",
			"text": "وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، بهذا الإسناد قال ‏ \"‏ من أعتق شقيصا من مملوك فهو حر من ماله ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 4333,
			"arabicnumber": "1503.05",
			"text": "وحدثني عمرو الناقد، حدثنا إسماعيل بن إبراهيم، عن ابن أبي عروبة، عن قتادة، عن النضر بن أنس، عن بشير بن نهيك، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ من أعتق شقيصا له في عبد فخلاصه في ماله إن كان له مال فإن لم يكن له مال استسعي العبد غير مشقوق عليه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 4334,
			"arabicnumber": "1503.06",
			"text": "وحدثناه أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، ومحمد بن بشر، ح وحدثنا إسحاق بن إبراهيم، وعلي بن خشرم، قالا أخبرنا عيسى بن يونس، جميعا عن ابن أبي، عروبة بهذا الإسناد ‏.‏ وفي حديث عيسى ‏ \"‏ ثم يستسعى في نصيب الذي لم يعتق غير مشقوق عليه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 4335,
			"arabicnumber": "1668.01",
			"text": "حدثنا علي بن حجر السعدي، وأبو بكر بن أبي شيبة وزهير بن حرب قالوا حدثنا إسماعيل، - وهو ابن علية - عن أيوب، عن أبي قلابة، عن أبي المهلب، عن عمران، بن حصين ‏.‏ أن رجلا، أعتق ستة مملوكين له عند موته لم يكن له مال غيرهم فدعا بهم رسول الله صلى الله عليه وسلم فجزأهم أثلاثا ثم أقرع بينهم فأعتق اثنين وأرق أربعة وقال له قولا شديدا ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 4336,
			"arabicnumber": "1668.02",
			"text": "حدثنا قتيبة بن سعيد، حدثنا حماد، ح وحدثنا إسحاق بن إبراهيم، وابن أبي، عمر عن الثقفي، كلاهما عن أيوب، بهذا الإسناد ‏.‏ أما حماد فحديثه كرواية ابن علية وأما الثقفي ففي حديثه أن رجلا من الأنصار أوصى عند موته فأعتق ستة مملوكين ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 4337,
			"arabicnumber": "1668.03",
			"text": "وحدثنا محمد بن منهال الضرير، وأحمد بن عبدة، قالا حدثنا يزيد بن زريع، حدثنا هشام بن حسان، عن محمد بن سيرين، عن عمران بن حصين، عن النبي صلى الله عليه وسلم بمثل حديث ابن علية وحماد ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 4338,
			"arabicnumber": "997.03",
			"text": "حدثنا أبو الربيع، سليمان بن داود العتكي حدثنا حماد، - يعني ابن زيد - عن عمرو بن دينار، عن جابر بن عبد الله، أن رجلا، من الأنصار أعتق غلاما له عن دبر لم يكن له مال غيره فبلغ ذلك النبي صلى الله عليه وسلم فقال ‏ \"‏ من يشتريه مني ‏\"‏ ‏.‏ فاشتراه نعيم بن عبد الله بثمانمائة درهم فدفعها إليه ‏.‏ قال عمرو سمعت جابر بن عبد الله يقول عبدا قبطيا مات عام أول ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 4339,
			"arabicnumber": "997.04",
			"text": "وحدثناه أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، عن ابن عيينة، قال أبو بكر حدثنا سفيان بن عيينة، قال سمع عمرو، جابرا يقول دبر رجل من الأنصار غلاما له لم يكن له مال غيره فباعه رسول الله صلى الله عليه وسلم ‏.‏ قال جابر فاشتراه ابن النحام عبدا قبطيا مات عام أول في إمارة ابن الزبير ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 4340,
			"arabicnumber": "997.05",
			"text": "حدثنا قتيبة بن سعيد، وابن، رمح عن الليث بن سعد، عن أبي الزبير، عن جابر، عن النبي صلى الله عليه وسلم في المدبر نحو حديث حماد عن عمرو بن دينار ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 4341,
			"arabicnumber": "997.06",
			"text": "حدثنا قتيبة بن سعيد، حدثنا المغيرة، - يعني الحزامي - عن عبد المجيد بن، سهيل عن عطاء بن أبي رباح، عن جابر بن عبد الله، ح. وحدثني عبد الله بن هاشم، حدثنا يحيى، - يعني ابن سعيد - عن الحسين بن، ذكوان المعلم حدثني عطاء، عن جابر، ح. وحدثني أبو غسان المسمعي، حدثنا معاذ، حدثني أبي، عن مطر، عن عطاء بن، أبي رباح وأبي الزبير وعمرو بن دينار أن جابر بن عبد الله، حدثهم في، بيع المدبر ‏.‏ كل هؤلاء قال عن النبي صلى الله عليه وسلم بمعنى حديث حماد وابن عيينة عن عمرو عن جابر ‏.‏",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 88
			}
		}
	]
}