{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4519,
			"arabicnumber": "1730.01",
			"text": "حدثنا يحيى بن يحيى التميمي، حدثنا سليم بن أخضر، عن ابن عون، قال كتبت إلى نافع أسأله عن الدعاء، قبل القتال قال فكتب إلى إنما كان ذلك في أول الإسلام قد أغار رسول الله صلى الله عليه وسلم على بني المصطلق وهم غارون وأنعامهم تسقى على الماء فقتل مقاتلتهم وسبى سبيهم وأصاب يومئذ - قال يحيى أحسبه قال - جويرية - أو قال البتة - ابنة الحارث وحدثني هذا الحديث عبد الله بن عمر وكان في ذاك الجيش",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 4520,
			"arabicnumber": "1730.02",
			"text": "وحدثنا محمد بن المثنى، حدثنا ابن أبي عدي، عن ابن عون، بهذا الإسناد ‏.‏ مثله وقال جويرية بنت الحارث ‏.‏ ولم يشك ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 4523,
			"arabicnumber": "1731.03",
			"text": "وحدثني حجاج بن الشاعر، حدثني عبد الصمد بن عبد الوارث، حدثنا شعبة، حدثني علقمة بن مرثد، أن سليمان بن بريدة، حدثه عن أبيه، قال كان رسول الله صلى الله عليه وسلم إذا بعث أميرا أو سرية دعاه فأوصاه ‏.‏ وساق الحديث بمعنى حديث سفيان ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 4524,
			"arabicnumber": "1731.04",
			"text": "حدثنا إبراهيم، حدثنا محمد بن عبد الوهاب الفراء، عن الحسين بن الوليد، عن شعبة، بهذا ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 4525,
			"arabicnumber": "1732",
			"text": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب - واللفظ لأبي بكر - قالا حدثنا أبو أسامة عن بريد بن عبد الله، عن أبي بردة، عن أبي موسى، قال كان رسول الله صلى الله عليه وسلم إذا بعث أحدا من أصحابه في بعض أمره قال ‏ \"‏ بشروا ولا تنفروا ويسروا ولا تعسروا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 4526,
			"arabicnumber": "1733.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن شعبة، عن سعيد بن أبي بردة، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم بعثه ومعاذا إلى اليمن فقال ‏ \"‏ يسرا ولا تعسرا وبشرا ولا تنفرا وتطاوعا ولا تختلفا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 4527,
			"arabicnumber": "1733.02",
			"text": "وحدثنا محمد بن عباد، حدثنا سفيان، عن عمرو، ح وحدثنا إسحاق بن إبراهيم، وابن أبي خلف عن زكرياء بن عدي، أخبرنا عبيد الله، عن زيد بن أبي أنيسة، كلاهما عن سعيد بن أبي بردة، عن أبيه، عن جده، عن النبي صلى الله عليه وسلم ‏.‏ نحو حديث شعبة وليس في حديث زيد بن أبي أنيسة ‏ \"‏ وتطاوعا ولا تختلفا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 4528,
			"arabicnumber": "1734",
			"text": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن أبي التياح، عن أنس، ح. وحدثنا أبو بكر بن أبي شيبة، حدثنا عبيد الله بن سعيد، ح وحدثنا محمد بن، الوليد حدثنا محمد بن جعفر، كلاهما عن شعبة، عن أبي التياح، قال سمعت أنس بن مالك، يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ يسروا ولا تعسروا وسكنوا ولا تنفروا ‏\"‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 4529,
			"arabicnumber": "1735.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، وأبو أسامة ح وحدثني زهير، بن حرب وعبيد الله بن سعيد - يعني أبا قدامة السرخسي - قالا حدثنا يحيى، - وهو القطان - كلهم عن عبيد الله، ح وحدثنا محمد بن عبد الله بن نمير، - واللفظ له - حدثنا أبي، حدثنا عبيد الله، عن نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا جمع الله الأولين والآخرين يوم القيامة يرفع لكل غادر لواء فقيل هذه غدرة فلان بن فلان ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 4530,
			"arabicnumber": "1735.02",
			"text": "حدثنا أبو الربيع العتكي، حدثنا حماد، حدثنا أيوب، ح وحدثنا عبد الله بن عبد، الرحمن الدارمي حدثنا عفان، حدثنا صخر بن جويرية، كلاهما عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم بهذا الحديث ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 4531,
			"arabicnumber": "1735.03",
			"text": "وحدثنا يحيى بن أيوب، وقتيبة، وابن، حجر عن إسماعيل بن جعفر، عن عبد، الله بن دينار أنه سمع عبد الله بن عمر، يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن الغادر ينصب الله له لواء يوم القيامة فيقال ألا هذه غدرة فلان ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 4532,
			"arabicnumber": "1735.04",
			"text": "حدثني حرملة بن يحيى، أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، عن حمزة، وسالم، ابنى عبد الله أن عبد الله بن عمر، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ لكل غادر لواء يوم القيامة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 4533,
			"arabicnumber": "1736.01",
			"text": "وحدثنا محمد بن المثنى، وابن، بشار قالا حدثنا ابن أبي عدي، ح وحدثني بشر، بن خالد أخبرنا محمد، - يعني ابن جعفر - كلاهما عن شعبة، عن سليمان، عن أبي وائل، عن عبد الله، عن النبي صلى الله عليه وسلم قال ‏ \"‏ لكل غادر لواء يوم القيامة يقال هذه غدرة فلان ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 4534,
			"arabicnumber": "1736.02",
			"text": "وحدثناه إسحاق بن إبراهيم، أخبرنا النضر بن شميل، ح وحدثني عبيد الله، بن سعيد حدثنا عبد الرحمن، جميعا عن شعبة، في هذا الإسناد ‏.‏ وليس في حديث عبد الرحمن ‏ \"‏ يقال هذه غدرة فلان ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 4535,
			"arabicnumber": "1736.03",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن آدم، عن يزيد بن عبد العزيز، عن الأعمش، عن شقيق، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لكل غادر لواء يوم القيامة يعرف به يقال هذه غدرة فلان ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 4536,
			"arabicnumber": "1737",
			"text": "حدثنا محمد بن المثنى، وعبيد الله بن سعيد، قالا حدثنا عبد الرحمن بن مهدي، عن شعبة، عن ثابت، عن أنس، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لكل غادر لواء يوم القيامة يعرف به ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 4537,
			"arabicnumber": "1738.01",
			"text": "حدثنا محمد بن المثنى، وعبيد الله بن سعيد، قالا حدثنا عبد الرحمن، حدثنا شعبة، عن خليد، عن أبي نضرة، عن أبي سعيد، عن النبي صلى الله عليه وسلم قال ‏ \"‏ لكل غادر لواء عند استه يوم القيامة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 4538,
			"arabicnumber": "1738.02",
			"text": "حدثنا زهير بن حرب، حدثنا عبد الصمد بن عبد الوارث، حدثنا المستمر بن الريان، حدثنا أبو نضرة، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لكل غادر لواء يوم القيامة يرفع له بقدر غدره ألا ولا غادر أعظم غدرا من أمير عامة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 4539,
			"arabicnumber": "1739",
			"text": "وحدثنا علي بن حجر السعدي، وعمرو الناقد، وزهير بن حرب، - واللفظ لعلي وزهير - قال علي أخبرنا وقال الآخران، حدثنا سفيان، قال سمع عمرو، جابرا يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ الحرب خدعة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 4540,
			"arabicnumber": "1740",
			"text": "وحدثنا محمد بن عبد الرحمن بن سهم، أخبرنا عبد الله بن المبارك، أخبرنا معمر، عن همام بن منبه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏الحرب خدعة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 4541,
			"arabicnumber": "1741",
			"text": "حدثنا الحسن بن علي الحلواني، وعبد بن حميد، قالا حدثنا أبو عامر العقدي، عن المغيرة، - وهو ابن عبد الرحمن الحزامي - عن أبي الزناد، عن الأعرج، عن أبي، هريرة أن النبي صلى الله عليه وسلم قال ‏ \"‏ لا تمنوا لقاء العدو فإذا لقيتموهم فاصبروا‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 4542,
			"arabicnumber": "1742.01",
			"text": "وحدثني محمد بن رافع، حدثنا عبد الرزاق، أخبرنا ابن جريج، أخبرني موسى، بن عقبة عن أبي النضر، عن كتاب، رجل من أسلم من أصحاب النبي صلى الله عليه وسلم يقال له عبد الله بن أبي أوفى فكتب إلى عمر بن عبيد الله حين سار إلى الحرورية يخبره أن رسول الله صلى الله عليه وسلم كان في بعض أيامه التي لقي فيها العدو ينتظر حتى إذا مالت الشمس قام فيهم فقال ‏\"‏ يا أيها الناس لا تتمنوا لقاء العدو واسألوا الله العافية فإذا لقيتموهم فاصبروا واعلموا أن الجنة تحت ظلال السيوف ‏\"‏ ‏.‏ ثم قام النبي صلى الله عليه وسلم وقال ‏\"‏ اللهم منزل الكتاب ومجري السحاب وهازم الأحزاب اهزمهم وانصرنا عليهم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 4543,
			"arabicnumber": "1742.02",
			"text": "حدثنا سعيد بن منصور، حدثنا خالد بن عبد الله، عن إسماعيل بن أبي خالد، عن عبد الله بن أبي أوفى، قال دعا رسول الله صلى الله عليه وسلم على الأحزاب فقال ‏ \"‏ اللهم منزل الكتاب سريع الحساب اهزم الأحزاب اللهم اهزمهم وزلزلهم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 4544,
			"arabicnumber": "1742.03",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع بن الجراح، عن إسماعيل بن أبي، خالد قال سمعت ابن أبي أوفى، يقول دعا رسول الله صلى الله عليه وسلم ‏.‏ بمثل حديث خالد غير أنه قال ‏\"‏ هازم الأحزاب ‏\"‏ ‏.‏ ولم يذكر قوله ‏\"‏ اللهم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 4545,
			"arabicnumber": "1742.04",
			"text": "وحدثناه إسحاق بن إبراهيم، وابن أبي عمر، جميعا عن ابن عيينة، عن إسماعيل، بهذا الإسناد وزاد ابن أبي عمر في روايته ‏ \"‏ مجري السحاب ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 4546,
			"arabicnumber": "1743",
			"text": "وحدثني حجاج بن الشاعر، حدثنا عبد الصمد، حدثنا حماد، عن ثابت، عن أنس، أن رسول الله صلى الله عليه وسلم كان يقول يوم أحد ‏ \"‏ اللهم إنك إن تشأ لا تعبد في الأرض ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 4547,
			"arabicnumber": "1744.01",
			"text": "حدثنا يحيى بن يحيى، ومحمد بن رمح، قالا أخبرنا الليث، ح وحدثنا قتيبة بن، سعيد حدثنا ليث، عن نافع، عن عبد الله، أن امرأة، وجدت، في بعض مغازي رسول الله صلى الله عليه وسلم مقتولة فأنكر رسول الله صلى الله عليه وسلم قتل النساء والصبيان‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 4548,
			"arabicnumber": "1744.02",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، وأبو أسامة قالا حدثنا عبيد، الله بن عمر عن نافع، عن ابن عمر، قال وجدت امرأة مقتولة في بعض تلك المغازي فنهى رسول الله صلى الله عليه وسلم عن قتل النساء والصبيان ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 4549,
			"arabicnumber": "1745.01",
			"text": "وحدثنا يحيى بن يحيى، وسعيد بن منصور، وعمرو الناقد، جميعا عن ابن عيينة، قال يحيى أخبرنا سفيان بن عيينة، عن الزهري، عن عبيد الله، عن ابن عباس، عن الصعب، بن جثامة قال سئل النبي صلى الله عليه وسلم عن الذراري من المشركين يبيتون فيصيبون من نسائهم وذراريهم ‏.‏ فقال ‏ \"‏ هم منهم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 4550,
			"arabicnumber": "1745.02",
			"text": "حدثنا عبد بن حميد، أخبرنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن عبيد، الله بن عبد الله بن عتبة عن ابن عباس، عن الصعب بن جثامة، قال قلت يا رسول الله إنا نصيب في البيات من ذراري المشركين قال ‏ \"‏ هم منهم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 4551,
			"arabicnumber": "1745.03",
			"text": "وحدثني محمد بن رافع، حدثنا عبد الرزاق، أخبرنا ابن جريج، أخبرني عمرو، بن دينار أن ابن شهاب، أخبره عن عبيد الله بن عبد الله بن عتبة، عن ابن عباس، عن الصعب بن جثامة، أن النبي صلى الله عليه وسلم قيل له لو أن خيلا أغارت من الليل فأصابت من أبناء المشركين قال ‏ \"‏ هم من آبائهم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 4552,
			"arabicnumber": "1746.01",
			"text": "حدثنا يحيى بن يحيى، ومحمد بن رمح، قالا أخبرنا الليث، ح وحدثنا قتيبة بن، سعيد حدثنا ليث، عن نافع، عن عبد الله، أن رسول الله صلى الله عليه وسلم حرق نخل بني النضير وقطع وهي البويرة ‏.‏ زاد قتيبة وابن رمح في حديثهما فأنزل الله عز وجل ‏{‏ ما قطعتم من لينة أو تركتموها قائمة على أصولها فبإذن الله وليخزي الفاسقين‏}‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 4553,
			"arabicnumber": "1746.02",
			"text": "حدثنا سعيد بن منصور، وهناد بن السري، قالا حدثنا ابن المبارك، عن موسى، بن عقبة عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قطع نخل بني النضير وحرق ولها يقول حسان وهان على سراة بني لؤى حريق بالبويرة مستطير وفي ذلك نزلت ‏{‏ ما قطعتم من لينة أو تركتموها قائمة على أصولها‏}‏ الآية ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 4554,
			"arabicnumber": "1746.03",
			"text": "وحدثنا سهل بن عثمان، أخبرني عقبة بن خالد السكوني، عن عبيد الله، عن نافع، عن عبد الله بن عمر، قال حرق رسول الله صلى الله عليه وسلم نخل بني النضير‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 4555,
			"arabicnumber": "1747",
			"text": "وحدثنا أبو كريب، محمد بن العلاء حدثنا ابن المبارك، عن معمر، ح وحدثنا محمد، بن رافع - واللفظ له - حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏ \"‏ غزا نبي من الأنبياء فقال لقومه لا يتبعني رجل قد ملك بضع امرأة وهو يريد أن يبني بها ولما يبن ولا آخر قد بنى بنيانا ولما يرفع سقفها ولا آخر قد اشترى غنما أو خلفات وهو منتظر ولادها ‏.‏ قال فغزا فأدنى للقرية حين صلاة العصر أو قريبا من ذلك فقال للشمس أنت مأمورة وأنا مأمور اللهم احبسها على شيئا ‏.‏ فحبست عليه حتى فتح الله عليه - قال - فجمعوا ما غنموا فأقبلت النار لتأكله فأبت أن تطعمه فقال فيكم غلول فليبايعني من كل قبيلة رجل ‏.‏ فبايعوه فلصقت يد رجل بيده فقال فيكم الغلول فلتبايعني قبيلتك ‏.‏ فبايعته - قال - فلصقت بيد رجلين أو ثلاثة فقال فيكم الغلول أنتم غللتم - قال - فأخرجوا له مثل رأس بقرة من ذهب - قال - فوضعوه في المال وهو بالصعيد فأقبلت النار فأكلته ‏.‏ فلم تحل الغنائم لأحد من قبلنا ذلك بأن الله تبارك وتعالى رأى ضعفنا وعجزنا فطيبها لنا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 4556,
			"arabicnumber": "1748.01",
			"text": "وحدثنا قتيبة بن سعيد، حدثنا أبو عوانة، عن سماك، عن مصعب بن سعد، عن أبيه، قال أخذ أبي من الخمس سيفا فأتى به النبي صلى الله عليه وسلم فقال هب لي هذا ‏.‏ فأبى فأنزل الله عز وجل ‏{‏ يسألونك عن الأنفال قل الأنفال لله والرسول‏}‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 4557,
			"arabicnumber": "1748.02",
			"text": "حدثنا محمد بن المثنى، وابن، بشار - واللفظ لابن المثنى - قالا حدثنا محمد، بن جعفر حدثنا شعبة، عن سماك بن حرب، عن مصعب بن سعد، عن أبيه، قال نزلت في أربع آيات أصبت سيفا فأتى به النبي صلى الله عليه وسلم فقال يا رسول الله نفلنيه ‏.‏ فقال ‏\"‏ ضعه ‏\"‏ ‏.‏ ثم قام فقال له النبي صلى الله عليه وسلم ‏\"‏ ضعه من حيث أخذته ‏\"‏ ‏.‏ ثم قام فقال نفلنيه يا رسول الله ‏.‏ فقال ‏\"‏ ضعه ‏\"‏ ‏.‏ فقام فقال يا رسول الله نفلنيه أأجعل كمن لا غناء له فقال له النبي صلى الله عليه وسلم ‏\"‏ ضعه من حيث أخذته ‏\"‏ ‏.‏ قال فنزلت هذه الآية ‏{‏ يسألونك عن الأنفال قل الأنفال لله والرسول‏}‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 4558,
			"arabicnumber": "1749.01",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن نافع، عن ابن عمر، قال بعث النبي صلى الله عليه وسلم سرية وأنا فيهم قبل نجد فغنموا إبلا كثيرة فكانت سهمانهم اثنى عشر بعيرا أو أحد عشر بعيرا ونفلوا بعيرا بعيرا ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 4559,
			"arabicnumber": "1749.02",
			"text": "وحدثنا قتيبة بن سعيد، حدثنا ليث، ح وحدثنا محمد بن رمح، أخبرنا الليث، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم بعث سرية قبل نجد وفيهم ابن عمر وأن سهمانهم بلغت اثنى عشر بعيرا ونفلوا سوى ذلك بعيرا فلم يغيره رسول الله صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 4560,
			"arabicnumber": "1749.03",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، وعبد الرحيم بن سليمان، عن عبيد الله بن عمر، عن نافع، عن ابن عمر، قال بعث رسول الله صلى الله عليه وسلم سرية إلى نجد فخرجت فيها فأصبنا إبلا وغنما فبلغت سهماننا اثنى عشر بعيرا ونفلنا رسول الله صلى الله عليه وسلم بعيرا بعيرا ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 4561,
			"arabicnumber": "1749.04",
			"text": "وحدثنا زهير بن حرب، ومحمد بن المثنى، قالا حدثنا يحيى، - وهو القطان - عن عبيد الله، بهذا الإسناد ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 4562,
			"arabicnumber": "1749.05",
			"text": "وحدثناه أبو الربيع، وأبو كامل قالا حدثنا حماد، عن أيوب، ح وحدثنا ابن المثنى، حدثنا ابن أبي عدي، عن ابن عون، قال كتبت إلى نافع أسأله عن النفل، فكتب إلى أن4661 - وحدثنا ابن رافع، حدثنا عبد الرزاق، أخبرنا ابن جريج، أخبرني موسى، ح وحدثنا هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني أسامة بن زيد، كلهم عن نافع، بهذا الإسناد نحو حديثهم ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 4563,
			"arabicnumber": "1750.01",
			"text": "وحدثنا سريج بن يونس، وعمرو الناقد، - واللفظ لسريج - قالا حدثنا عبد، الله بن رجاء عن يونس، عن الزهري، عن سالم، عن أبيه، قال نفلنا رسول الله صلى الله عليه وسلم نفلا سوى نصيبنا من الخمس فأصابني شارف والشارف المسن الكبير ‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 4564,
			"arabicnumber": "1750.02",
			"text": "وحدثنا هناد بن السري، حدثنا ابن المبارك، ح وحدثني حرملة بن يحيى، أخبرنا ابن وهب، كلاهما عن يونس، عن ابن شهاب، قال بلغني عن ابن عمر، قال نفل رسول الله صلى الله عليه وسلم سرية بنحو حديث ابن رجاء ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 4565,
			"arabicnumber": "1750.03",
			"text": "وحدثنا عبد الملك بن شعيب بن الليث، حدثني أبي، عن جدي، قال حدثني عقيل، بن خالد عن ابن شهاب، عن سالم، عن عبد الله، أن رسول الله صلى الله عليه وسلم قد كان ينفل بعض من يبعث من السرايا لأنفسهم خاصة سوى قسم عامة الجيش والخمس في ذلك واجب كله ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 4566,
			"arabicnumber": "1751.01",
			"text": "حدثنا يحيى بن يحيى التميمي، أخبرنا هشيم، عن يحيى بن سعيد، عن عمر بن، كثير بن أفلح عن أبي محمد الأنصاري، وكان، جليسا لأبي قتادة قال قال أبو قتادة ‏.‏ واقتص الحديث ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 4567,
			"arabicnumber": "1751.02",
			"text": "وحدثنا قتيبة بن سعيد، حدثنا ليث، عن يحيى بن سعيد، عن عمر بن كثير، عن أبي محمد، مولى أبي قتادة أن أبا قتادة، قال ‏.‏ وساق الحديث ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 4568,
			"arabicnumber": "1751.03",
			"text": "وحدثنا أبو الطاهر، وحرملة، - واللفظ له - أخبرنا عبد الله بن وهب، قال سمعت مالك بن أنس، يقول حدثني يحيى بن سعيد، عن عمر بن كثير بن أفلح، عن أبي محمد، مولى أبي قتادة عن أبي قتادة، قال خرجنا مع رسول الله صلى الله عليه وسلم عام حنين فلما التقينا كانت للمسلمين جولة ‏.‏ قال فرأيت رجلا من المشركين قد علا رجلا من المسلمين فاستدرت إليه حتى أتيته من ورائه فضربته على حبل عاتقه وأقبل على فضمني ضمة وجدت منها ريح الموت ثم أدركه الموت فأرسلني فلحقت عمر بن الخطاب فقال ما للناس فقلت أمر الله ‏.‏ ثم إن الناس رجعوا وجلس رسول الله صلى الله عليه وسلم ‏.‏ فقال ‏\"‏ من قتل قتيلا له عليه بينة فله سلبه ‏\"‏ ‏.‏ قال فقمت فقلت من يشهد لي ثم جلست ثم قال مثل ذلك فقال فقمت فقلت من يشهد لي ثم جلست ثم قال ذلك الثالثة فقمت فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما لك يا أبا قتادة ‏\"‏ ‏.‏ فقصصت عليه القصة فقال رجل من القوم صدق يا رسول الله سلب ذلك القتيل عندي فأرضه من حقه ‏.‏ وقال أبو بكر الصديق لاها الله إذا لا يعمد إلى أسد من أسد الله يقاتل عن الله وعن رسوله فيعطيك سلبه ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ صدق فأعطه إياه ‏\"‏ ‏.‏ فأعطاني قال فبعت الدرع فابتعت به مخرفا في بني سلمة فإنه لأول مال تأثلته في الإسلام ‏.‏ وفي حديث الليث فقال أبو بكر كلا لا يعطيه أضيبع من قريش ويدع أسدا من أسد الله ‏.‏ وفي حديث الليث لأول مال تأثلته ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 4569,
			"arabicnumber": "1752",
			"text": "حدثنا يحيى بن يحيى التميمي، أخبرنا يوسف بن الماجشون، عن صالح بن إبراهيم، بن عبد الرحمن بن عوف عن أبيه، عن عبد الرحمن بن عوف، أنه قال بينا أنا واقف، في الصف يوم بدر نظرت عن يميني، وشمالي، فإذا أنا بين، غلامين من الأنصار حديثة أسنانهما تمنيت لو كنت بين أضلع منهما فغمزني أحدهما ‏.‏ فقال يا عم هل تعرف أبا جهل قال قلت نعم وما حاجتك إليه يا ابن أخي قال أخبرت أنه يسب رسول الله صلى الله عليه وسلم والذي نفسي بيده لئن رأيته لا يفارق سوادي سواده حتى يموت الأعجل منا ‏.‏ قال فتعجبت لذلك فغمزني الآخر فقال مثلها - قال - فلم أنشب أن نظرت إلى أبي جهل يزول في الناس فقلت ألا تريان هذا صاحبكما الذي تسألان عنه قال فابتدراه فضرباه بسيفيهما حتى قتلاه ثم انصرفا إلى رسول الله صلى الله عليه وسلم فأخبراه ‏.‏ فقال ‏\"‏ أيكما قتله ‏\"‏ ‏.‏ فقال كل واحد منهما أنا قتلت ‏.‏ فقال ‏\"‏ هل مسحتما سيفيكما ‏\"‏ ‏.‏ قالا لا ‏.‏ فنظر في السيفين فقال ‏\"‏ كلاكما قتله ‏\"‏ ‏.‏ وقضى بسلبه لمعاذ بن عمرو بن الجموح والرجلان معاذ بن عمرو بن الجموح ومعاذ ابن عفراء ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 4570,
			"arabicnumber": "1753.01",
			"text": "وحدثني أبو الطاهر، أحمد بن عمرو بن سرح أخبرنا عبد الله بن وهب، أخبرني معاوية بن صالح، عن عبد الرحمن بن جبير، عن أبيه، عن عوف بن مالك، قال قتل رجل من حمير رجلا من العدو فأراد سلبه فمنعه خالد بن الوليد وكان واليا عليهم فأتى رسول الله صلى الله عليه وسلم عوف بن مالك فأخبره فقال لخالد ‏\"‏ ما منعك أن تعطيه سلبه ‏\"‏ ‏.‏ قال استكثرته يا رسول الله ‏.‏ قال ‏\"‏ ادفعه إليه ‏\"‏ ‏.‏ فمر خالد بعوف فجر بردائه ثم قال هل أنجزت لك ما ذكرت لك من رسول الله صلى الله عليه وسلم فسمعه رسول الله صلى الله عليه وسلم فاستغضب فقال ‏\"‏ لا تعطه يا خالد لا تعطه يا خالد هل أنتم تاركون لي أمرائي إنما مثلكم ومثلهم كمثل رجل استرعي إبلا أو غنما فرعاها ثم تحين سقيها فأوردها حوضا فشرعت فيه فشربت صفوه وتركت كدره فصفوه لكم وكدره عليهم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 4571,
			"arabicnumber": "1753.02",
			"text": "وحدثني زهير بن حرب، حدثنا الوليد بن مسلم، حدثنا صفوان بن عمرو، عن عبد، الرحمن بن جبير بن نفير عن أبيه، عن عوف بن مالك الأشجعي، قال خرجت مع من خرج مع زيد بن حارثة في غزوة مؤتة ورافقني مددي من اليمن ‏.‏ وساق الحديث عن النبي صلى الله عليه وسلم ‏.‏ بنحوه غير أنه قال في الحديث قال عوف فقلت يا خالد أما علمت أن رسول الله صلى الله عليه وسلم قضى بالسلب للقاتل قال بلى ولكني استكثرته ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 4572,
			"arabicnumber": "1754",
			"text": "حدثنا زهير بن حرب، حدثنا عمر بن يونس الحنفي، حدثنا عكرمة بن عمار، حدثني إياس بن سلمة، حدثني أبي سلمة بن الأكوع، قال غزونا مع رسول الله صلى الله عليه وسلم هوازن فبينا نحن نتضحى مع رسول الله صلى الله عليه وسلم إذ جاء رجل على جمل أحمر فأناخه ثم انتزع طلقا من حقبه فقيد به الجمل ثم تقدم يتغدى مع القوم وجعل ينظر وفينا ضعفة ورقة في الظهر وبعضنا مشاة إذ خرج يشتد فأتى جمله فأطلق قيده ثم أناخه وقعد عليه فأثاره فاشتد به الجمل فاتبعه رجل على ناقة ورقاء ‏.‏ قال سلمة وخرجت أشتد فكنت عند ورك الناقة ‏.‏ ثم تقدمت حتى كنت عند ورك الجمل ثم تقدمت حتى أخذت بخطام الجمل فأنخته فلما وضع ركبته في الأرض اخترطت سيفي فضربت رأس الرجل فندر ثم جئت بالجمل أقوده عليه رحله وسلاحه فاستقبلني رسول الله صلى الله عليه وسلم والناس معه فقال ‏\"‏ من قتل الرجل ‏\"‏ ‏.‏ قالوا ابن الأكوع ‏.‏ قال ‏\"‏ له سلبه أجمع ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 4573,
			"arabicnumber": "1755",
			"text": "حدثنا زهير بن حرب، حدثنا عمر بن يونس، حدثنا عكرمة بن عمار، حدثني إياس بن سلمة، حدثني أبي قال، غزونا فزارة وعلينا أبو بكر أمره رسول الله صلى الله عليه وسلم علينا فلما كان بيننا وبين الماء ساعة أمرنا أبو بكر فعرسنا ثم شن الغارة فورد الماء فقتل من قتل عليه وسبى وأنظر إلى عنق من الناس فيهم الذراري فخشيت أن يسبقوني إلى الجبل فرميت بسهم بينهم وبين الجبل فلما رأوا السهم وقفوا فجئت بهم أسوقهم وفيهم امرأة من بني فزارة عليها قشع من أدم - قال القشع النطع - معها ابنة لها من أحسن العرب فسقتهم حتى أتيت بهم أبا بكر فنفلني أبو بكر ابنتها فقدمنا المدينة وما كشفت لها ثوبا فلقيني رسول الله صلى الله عليه وسلم في السوق فقال ‏\"‏ يا سلمة هب لي المرأة ‏\"‏ ‏.‏ فقلت يا رسول الله والله لقد أعجبتني وما كشفت لها ثوبا ثم لقيني رسول الله صلى الله عليه وسلم من الغد في السوق فقال لي ‏\"‏ يا سلمة هب لي المرأة لله أبوك ‏\"‏ ‏.‏ فقلت هي لك يا رسول الله فوالله ما كشفت لها ثوبا فبعث بها رسول الله صلى الله عليه وسلم إلى أهل مكة ففدى بها ناسا من المسلمين كانوا أسروا بمكة ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 4574,
			"arabicnumber": "1756",
			"text": "حدثنا أحمد بن حنبل، ومحمد بن رافع، قالا حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال قال رسول الله صلى الله عليه وسلم ‏ \"‏ أيما قرية أتيتموها وأقمتم فيها فسهمكم فيها وأيما قرية عصت الله ورسوله فإن خمسها لله ولرسوله ثم هي لكم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 4575,
			"arabicnumber": "1757.01",
			"text": "حدثنا قتيبة بن سعيد، ومحمد بن عباد، وأبو بكر بن أبي شيبة وإسحاق بن إبراهيم - واللفظ لابن أبي شيبة - قال إسحاق أخبرنا وقال الآخرون، حدثنا سفيان، عن عمرو، عن الزهري، عن مالك بن أوس، عن عمر، قال كانت أموال بني النضير مما أفاء الله على رسوله مما لم يوجف عليه المسلمون بخيل ولا ركاب فكانت للنبي صلى الله عليه وسلم خاصة فكان ينفق على أهله نفقة سنة وما بقي يجعله في الكراع والسلاح عدة في سبيل الله ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 4576,
			"arabicnumber": "1757.02",
			"text": "حدثنا يحيى بن يحيى، قال أخبرنا سفيان بن عيينة، عن معمر، عن الزهري، بهذا الإسناد ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 4577,
			"arabicnumber": "1757.03",
			"text": "وحدثني عبد الله بن محمد بن أسماء الضبعي، حدثنا جويرية، عن مالك، عن الزهري، أن مالك بن أوس، حدثه قال أرسل إلى عمر بن الخطاب فجئته حين تعالى النهار - قال - فوجدته في بيته جالسا على سرير مفضيا إلى رماله متكئا على وسادة من أدم ‏.‏ فقال لي يا مال إنه قد دف أهل أبيات من قومك وقد أمرت فيهم برضخ فخذه فاقسمه بينهم - قال - قلت لو أمرت بهذا غيري قال خذه يا مال ‏.‏ قال فجاء يرفا فقال هل لك يا أمير المؤمنين في عثمان وعبد الرحمن بن عوف والزبير وسعد فقال عمر نعم ‏.‏ فأذن لهم فدخلوا ثم جاء ‏.‏ فقال هل لك في عباس وعلي قال نعم ‏.‏ فأذن لهما فقال عباس يا أمير المؤمنين اقض بيني وبين هذا الكاذب الآثم الغادر الخائن ‏.‏ فقال القوم أجل يا أمير المؤمنين فاقض بينهم وأرحهم ‏.‏ فقال مالك بن أوس يخيل إلى أنهم قد كانوا قدموهم لذلك - فقال عمر اتئدا أنشدكم بالله الذي بإذنه تقوم السماء والأرض أتعلمون أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا نورث ما تركنا صدقة ‏\"‏ ‏.‏ قالوا نعم ‏.‏ ثم أقبل على العباس وعلي فقال أنشدكما بالله الذي بإذنه تقوم السماء والأرض أتعلمان أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا نورث ما تركناه صدقة ‏\"‏ ‏.‏ قالا نعم ‏.‏ فقال عمر إن الله جل وعز كان خص رسوله صلى الله عليه وسلم بخاصة لم يخصص بها أحدا غيره قال ‏{‏ ما أفاء الله على رسوله من أهل القرى فلله وللرسول‏}‏ ما أدري هل قرأ الآية التي قبلها أم لا ‏.‏ قال فقسم رسول الله صلى الله عليه وسلم بينكم أموال بني النضير فوالله ما استأثر عليكم ولا أخذها دونكم حتى بقي هذا المال فكان رسول الله صلى الله عليه وسلم يأخذ منه نفقة سنة ثم يجعل ما بقي أسوة المال ‏.‏ ثم قال أنشدكم بالله الذي بإذنه تقوم السماء والأرض أتعلمون ذلك قالوا نعم ‏.‏ ثم نشد عباسا وعليا بمثل ما نشد به القوم أتعلمان ذلك قالا نعم ‏.‏ قال فلما توفي رسول الله صلى الله عليه وسلم قال أبو بكر أنا ولي رسول الله صلى الله عليه وسلم فجئتما تطلب ميراثك من ابن أخيك ويطلب هذا ميراث امرأته من أبيها فقال أبو بكر قال رسول الله صلى الله عليه وسلم ‏\"‏ ما نورث ما تركنا صدقة ‏\"‏ ‏.‏ فرأيتماه كاذبا آثما غادرا خائنا والله يعلم إنه لصادق بار راشد تابع للحق ثم توفي أبو بكر وأنا ولي رسول الله صلى الله عليه وسلم وولي أبي بكر فرأيتماني كاذبا آثما غادرا خائنا والله يعلم إني لصادق بار راشد تابع للحق فوليتها ثم جئتني أنت وهذا وأنتما جميع وأمركما واحد فقلتما ادفعها إلينا فقلت إن شئتم دفعتها إليكما على أن عليكما عهد الله أن تعملا فيها بالذي كان يعمل رسول الله صلى الله عليه وسلم فأخذتماها بذلك قال أكذلك قالا نعم ‏.‏ قال ثم جئتماني لأقضي بينكما ولا والله لا أقضي بينكما بغير ذلك حتى تقوم الساعة فإن عجزتما عنها فرداها إلى ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 4578,
			"arabicnumber": "1757.04",
			"text": "حدثنا إسحاق بن إبراهيم، ومحمد بن رافع، وعبد بن حميد، - قال ابن رافع حدثنا وقال الآخران، أخبرنا عبد الرزاق، - أخبرنا معمر، عن الزهري، عن مالك بن أوس، بن الحدثان قال أرسل إلى عمر بن الخطاب فقال إنه قد حضر أهل أبيات من قومك ‏.‏ بنحو حديث مالك ‏.‏ غير أن فيه، فكان ينفق على أهله منه سنة وربما قال معمر يحبس قوت أهله منه سنة ثم يجعل ما بقي منه مجعل مال الله عز وجل ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 4579,
			"arabicnumber": "1758",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن ابن شهاب، عن عروة، عن عائشة، أنها قالت إن أزواج النبي صلى الله عليه وسلم حين توفي رسول الله صلى الله عليه وسلم أردن أن يبعثن عثمان بن عفان إلى أبي بكر فيسألنه ميراثهن من النبي صلى الله عليه وسلم قالت عائشة لهن أليس قد قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا نورث ما تركنا فهو صدقة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 4580,
			"arabicnumber": "1759.01",
			"text": "حدثني محمد بن رافع، أخبرنا حجين، حدثنا ليث، عن عقيل، عن ابن شهاب، عن عروة بن الزبير، عن عائشة، أنها أخبرته أن فاطمة بنت رسول الله صلى الله عليه وسلم أرسلت إلى أبي بكر الصديق تسأله ميراثها من رسول الله صلى الله عليه وسلم مما أفاء الله عليه بالمدينة وفدك وما بقي من خمس خيبر فقال أبو بكر إن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا نورث ما تركنا صدقة إنما يأكل آل محمد - صلى الله عليه وسلم - في هذا المال ‏\"‏ ‏.‏ وإني والله لا أغير شيئا من صدقة رسول الله صلى الله عليه وسلم عن حالها التي كانت عليها في عهد رسول الله صلى الله عليه وسلم ولأعملن فيها بما عمل به رسول الله صلى الله عليه وسلم فأبى أبو بكر أن يدفع إلى فاطمة شيئا فوجدت فاطمة على أبي بكر في ذلك - قال - فهجرته فلم تكلمه حتى توفيت وعاشت بعد رسول الله صلى الله عليه وسلم ستة أشهر فلما توفيت دفنها زوجها علي بن أبي طالب ليلا ولم يؤذن بها أبا بكر وصلى عليها علي وكان لعلي من الناس وجهة حياة فاطمة فلما توفيت استنكر علي وجوه الناس فالتمس مصالحة أبي بكر ومبايعته ولم يكن بايع تلك الأشهر فأرسل إلى أبي بكر أن ائتنا ولا يأتنا معك أحد - كراهية محضر عمر بن الخطاب - فقال عمر لأبي بكر والله لا تدخل عليهم وحدك ‏.‏ فقال أبو بكر وما عساهم أن يفعلوا بي إني والله لآتينهم ‏.‏ فدخل عليهم أبو بكر ‏.‏ فتشهد علي بن أبي طالب ثم قال إنا قد عرفنا يا أبا بكر فضيلتك وما أعطاك الله ولم ننفس عليك خيرا ساقه الله إليك ولكنك استبددت علينا بالأمر وكنا نحن نرى لنا حقا لقرابتنا من رسول الله صلى الله عليه وسلم ‏.‏ فلم يزل يكلم أبا بكر حتى فاضت عينا أبي بكر فلما تكلم أبو بكر قال والذي نفسي بيده لقرابة رسول الله صلى الله عليه وسلم أحب إلى أن أصل من قرابتي وأما الذي شجر بيني وبينكم من هذه الأموال فإني لم آل فيه عن الحق ولم أترك أمرا رأيت رسول الله صلى الله عليه وسلم يصنعه فيها إلا صنعته ‏.‏ فقال علي لأبي بكر موعدك العشية للبيعة ‏.‏ فلما صلى أبو بكر صلاة الظهر رقي على المنبر فتشهد وذكر شأن علي وتخلفه عن البيعة وعذره بالذي اعتذر إليه ثم استغفر وتشهد علي بن أبي طالب فعظم حق أبي بكر وأنه لم يحمله على الذي صنع نفاسة على أبي بكر ولا إنكارا للذي فضله الله به ولكنا كنا نرى لنا في الأمر نصيبا فاستبد علينا به فوجدنا في أنفسنا فسر بذلك المسلمون وقالوا أصبت ‏.‏ فكان المسلمون إلى علي قريبا حين راجع الأمر المعروف ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 4581,
			"arabicnumber": "1759.02",
			"text": "حدثنا إسحاق بن إبراهيم، و محمد بن رافع وعبد بن حميد قال ابن رافع حدثنا وقال الآخران، أخبرنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن عروة، عن عائشة، أنصلى الله عليه وسلم وهما حينئذ يطلبان أرضه من فدك وسهمه من خيبر ‏.‏ فقال لهما أبو بكر إني سمعت رسول الله صلى الله عليه وسلم ‏.‏ وساق الحديث بمثل معنى حديث عقيل عن الزهري غير أنه قال ثم قام علي فعظم من حق أبي بكر وذكر فضيلته وسابقته ثم مضى إلى أبي بكر فبايعه فأقبل الناس إلى علي فقالوا أصبت وأحسنت ‏.‏ فكان الناس قريبا إلى علي حين قارب الأمر المعروف ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 4582,
			"arabicnumber": "1759.03",
			"text": "وحدثنا ابن نمير، حدثنا يعقوب بن إبراهيم، حدثنا أبي ح، وحدثنا زهير بن حرب، والحسن بن علي الحلواني قالا حدثنا يعقوب، - وهو ابن إبراهيم - حدثنا أبي، عن صالح، عن ابن شهاب، أخبرني عروة بن الزبير، أن عائشة، زوج النبي صلى الله عليه وسلم أخبرته أن فاطمة بنت رسول الله صلى الله عليه وسلم سألت أبا بكر بعد وفاة رسول الله صلى الله عليه وسلم أن يقسم لها ميراثها مما ترك رسول الله صلى الله عليه وسلم مما أفاء الله عليه ‏.‏ فقال لها أبو بكر إن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا نورث ما تركنا صدقة ‏\"‏ ‏.‏ قال وعاشت بعد رسول الله صلى الله عليه وسلم ستة أشهر وكانت فاطمة تسأل أبا بكر نصيبها مما ترك رسول الله صلى الله عليه وسلم من خيبر وفدك وصدقته بالمدينة فأبى أبو بكر عليها ذلك وقال لست تاركا شيئا كان رسول الله صلى الله عليه وسلم يعمل به إلا عملت به إني أخشى إن تركت شيئا من أمره أن أزيغ فأما صدقته بالمدينة فدفعها عمر إلى علي وعباس فغلبه عليها علي وأما خيبر وفدك فأمسكهما عمر وقال هما صدقة رسول الله صلى الله عليه وسلم كانتا لحقوقه التي تعروه ونوائبه وأمرهما إلى من ولي الأمر قال فهما على ذلك إلى اليوم ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 4583,
			"arabicnumber": "1760.01",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا يقتسم ورثتي دينارا ما تركت بعد نفقة نسائي ومئونة عاملي فهو صدقة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 4584,
			"arabicnumber": "1760.02",
			"text": "حدثنا محمد بن يحيى بن أبي عمر المكي، حدثنا سفيان، عن أبي الزناد، بهذا الإسناد ‏.‏ نحوه ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 4585,
			"arabicnumber": "1761",
			"text": "وحدثني ابن أبي خلف، حدثنا زكرياء بن عدي، أخبرنا ابن المبارك، عن يونس، عن الزهري، عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ لا نورث ما تركنا صدقة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 4586,
			"arabicnumber": "1762.01",
			"text": "حدثنا يحيى بن يحيى، وأبو كامل فضيل بن حسين كلاهما عن سليم، قال يحيى أخبرنا سليم بن أخضر، عن عبيد الله بن عمر، حدثنا نافع، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم قسم في النفل للفرس سهمين وللرجل سهما ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 4587,
			"arabicnumber": "1762.02",
			"text": "حدثناه ابن نمير، حدثنا أبي، حدثنا عبيد الله، بهذا الإسناد مثله ولم يذكر في النفل ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 4588,
			"arabicnumber": "1763",
			"text": "حدثنا هناد بن السري، حدثنا ابن المبارك، عن عكرمة بن عمار، حدثني سماك، الحنفي قال سمعت ابن عباس، يقول حدثني عمر بن الخطاب، قال لما كان يوم بدر ح وحدثنا زهير بن حرب - واللفظ له - حدثنا عمر بن يونس الحنفي حدثنا عكرمة بن عمار حدثني أبو زميل - هو سماك الحنفي - حدثني عبد الله بن عباس قال حدثني عمر بن الخطاب قال لما كان يوم بدر نظر رسول الله صلى الله عليه وسلم إلى المشركين وهم ألف وأصحابه ثلاثمائة وتسعة عشر رجلا فاستقبل نبي الله صلى الله عليه وسلم القبلة ثم مد يديه فجعل يهتف بربه ‏\"‏ اللهم أنجز لي ما وعدتني اللهم آت ما وعدتني اللهم إن تهلك هذه العصابة من أهل الإسلام لا تعبد في الأرض ‏\"‏ ‏.‏ فمازال يهتف بربه مادا يديه مستقبل القبلة حتى سقط رداؤه عن منكبيه فأتاه أبو بكر فأخذ رداءه فألقاه على منكبيه ثم التزمه من ورائه ‏.‏ وقال يا نبي الله كذاك مناشدتك ربك فإنه سينجز لك ما وعدك فأنزل الله عز وجل ‏{‏ إذ تستغيثون ربكم فاستجاب لكم أني ممدكم بألف من الملائكة مردفين‏}‏ فأمده الله بالملائكة ‏.‏ قال أبو زميل فحدثني ابن عباس قال بينما رجل من المسلمين يومئذ يشتد في أثر رجل من المشركين أمامه إذ سمع ضربة بالسوط فوقه وصوت الفارس يقول أقدم حيزوم ‏.‏ فنظر إلى المشرك أمامه فخر مستلقيا فنظر إليه فإذا هو قد خطم أنفه وشق وجهه كضربة السوط فاخضر ذلك أجمع ‏.‏ فجاء الأنصاري فحدث بذلك رسول الله صلى الله عليه وسلم فقال ‏\"‏ صدقت ذلك من مدد السماء الثالثة ‏\"‏ ‏.‏ فقتلوا يومئذ سبعين وأسروا سبعين ‏.‏ قال أبو زميل قال ابن عباس فلما أسروا الأسارى قال رسول الله صلى الله عليه وسلم لأبي بكر وعمر ‏\"‏ ما ترون في هؤلاء الأسارى ‏\"‏ ‏.‏ فقال أبو بكر يا نبي الله هم بنو العم والعشيرة أرى أن تأخذ منهم فدية فتكون لنا قوة على الكفار فعسى الله أن يهديهم للإسلام ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما ترى يا ابن الخطاب ‏\"‏ ‏.‏ قلت لا والله يا رسول الله ما أرى الذي رأى أبو بكر ولكني أرى أن تمكنا فنضرب أعناقهم فتمكن عليا من عقيل فيضرب عنقه وتمكني من فلان - نسيبا لعمر - فأضرب عنقه فإن هؤلاء أئمة الكفر وصناديدها فهوي رسول الله صلى الله عليه وسلم ما قال أبو بكر ولم يهو ما قلت فلما كان من الغد جئت فإذا رسول الله صلى الله عليه وسلم وأبو بكر قاعدين يبكيان قلت يا رسول الله أخبرني من أى شىء تبكي أنت وصاحبك فإن وجدت بكاء بكيت وإن لم أجد بكاء تباكيت لبكائكما ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أبكي للذي عرض على أصحابك من أخذهم الفداء لقد عرض على عذابهم أدنى من هذه الشجرة ‏\"‏ ‏.‏ شجرة قريبة من نبي الله صلى الله عليه وسلم ‏.‏ وأنزل الله عز وجل ‏{‏ ما كان لنبي أن يكون له أسرى حتى يثخن في الأرض‏}‏ إلى قوله ‏{‏ فكلوا مما غنمتم حلالا طيبا‏}‏ فأحل الله الغنيمة لهم ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 4589,
			"arabicnumber": "1764.01",
			"text": "حدثنا قتيبة بن سعيد، حدثنا ليث، عن سعيد بن أبي سعيد، أنه سمع أبا هريرة، يقول بعث رسول الله صلى الله عليه وسلم خيلا قبل نجد فجاءت برجل من بني حنيفة يقال له ثمامة بن أثال سيد أهل اليمامة ‏.‏ فربطوه بسارية من سواري المسجد فخرج إليه رسول الله صلى الله عليه وسلم فقال ‏\"‏ ماذا عندك يا ثمامة ‏\"‏ ‏.‏ فقال عندي يا محمد خير إن تقتل تقتل ذا دم وإن تنعم تنعم على شاكر وإن كنت تريد المال فسل تعط منه ما شئت ‏.‏ فتركه رسول الله صلى الله عليه وسلم حتى كان بعد الغد فقال ‏\"‏ ما عندك يا ثمامة ‏\"‏ ‏.‏ قال ما قلت لك إن تنعم تنعم على شاكر وإن تقتل تقتل ذا دم وإن كنت تريد المال فسل تعط منه ما شئت ‏.‏ فتركه رسول الله صلى الله عليه وسلم حتى كان من الغد فقال ‏\"‏ ماذا عندك يا ثمامة ‏\"‏ ‏.‏ فقال عندي ما قلت لك إن تنعم تنعم على شاكر وإن تقتل تقتل ذا دم وإن كنت تريد المال فسل تعط منه ما شئت ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أطلقوا ثمامة ‏\"‏ ‏.‏ فانطلق إلى نخل قريب من المسجد فاغتسل ثم دخل المسجد فقال أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله ‏.‏ يا محمد والله ما كان على الأرض وجه أبغض إلى من وجهك فقد أصبح وجهك أحب الوجوه كلها إلى والله ما كان من دين أبغض إلى من دينك فأصبح دينك أحب الدين كله إلى والله ما كان من بلد أبغض إلى من بلدك فأصبح بلدك أحب البلاد كلها إلى وإن خيلك أخذتني وأنا أريد العمرة فماذا ترى فبشره رسول الله صلى الله عليه وسلم وأمره أن يعتمر فلما قدم مكة قال له قائل أصبوت فقال لا ولكني أسلمت مع رسول الله صلى الله عليه وسلم ولا والله لا يأتيكم من اليمامة حبة حنطة حتى يأذن فيها رسول الله صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 4590,
			"arabicnumber": "1764.02",
			"text": "حدثنا محمد بن المثنى، حدثنا أبو بكر الحنفي، حدثني عبد الحميد بن جعفر، حدثني سعيد بن أبي سعيد المقبري، أنه سمع أبا هريرة، يقول بعث رسول الله صلى الله عليه وسلم خيلا له نحو أرض نجد فجاءت برجل يقال له ثمامة بن أثال الحنفي سيد أهل اليمامة ‏.‏ وساق الحديث بمثل حديث الليث إلا أنه قال إن تقتلني تقتل ذا دم ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 4591,
			"arabicnumber": "1765",
			"text": "حدثنا قتيبة بن سعيد، حدثنا ليث، عن سعيد بن أبي سعيد، عن أبيه، عن أبي، هريرة أنه قال بينا نحن في المسجد إذ خرج إلينا رسول الله صلى الله عليه وسلم فقال ‏\"‏ انطلقوا إلى يهود ‏\"‏ ‏.‏ فخرجنا معه حتى جئناهم فقام رسول الله صلى الله عليه وسلم فناداهم فقال ‏\"‏ يا معشر يهود أسلموا تسلموا ‏\"‏ ‏.‏ فقالوا قد بلغت يا أبا القاسم ‏.‏ فقال لهم رسول الله صلى الله عليه وسلم ‏\"‏ ذلك أريد أسلموا تسلموا ‏\"‏ ‏.‏ فقالوا قد بلغت يا أبا القاسم ‏.‏ فقال لهم رسول الله صلى الله عليه وسلم ‏\"‏ ذلك أريد ‏\"‏ ‏.‏ فقال لهم الثالثة فقال ‏\"‏ اعلموا أنما الأرض لله ورسوله وأني أريد أن أجليكم من هذه الأرض فمن وجد منكم بماله شيئا فليبعه وإلا فاعلموا أن الأرض لله ورسوله ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 4592,
			"arabicnumber": "1766.01",
			"text": "وحدثني محمد بن رافع، وإسحاق بن منصور، قال ابن رافع حدثنا وقال، إسحاق أخبرنا عبد الرزاق، أخبرنا ابن جريج، عن موسى بن عقبة، عن نافع، عن ابن عمر، أنالله عليه وسلم فأجلى رسول الله صلى الله عليه وسلم بني النضير وأقر قريظة ومن عليهم حتى حاربت قريظة بعد ذلك فقتل رجالهم وقسم نساءهم وأولادهم وأموالهم بين المسلمين إلا أن بعضهم لحقوا برسول الله صلى الله عليه وسلم فآمنهم وأسلموا وأجلى رسول الله صلى الله عليه وسلم يهود المدينة كلهم بني قينقاع - وهم قوم عبد الله بن سلام - ويهود بني حارثة وكل يهودي كان بالمدينة ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 4593,
			"arabicnumber": "1766.02",
			"text": "وحدثني أبو الطاهر، حدثنا عبد الله بن وهب، أخبرني حفص بن ميسرة، عن موسى، بهذا الإسناد هذا الحديث وحديث ابن جريج أكثر وأتم ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 4594,
			"arabicnumber": "1767.01",
			"text": "وحدثني زهير بن حرب، حدثنا الضحاك بن مخلد، عن ابن جريج، ح وحدثني محمد بن رافع، - واللفظ له - حدثنا عبد الرزاق، أخبرنا ابن جريج، أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول أخبرني عمر بن الخطاب، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏ \"‏ لأخرجن اليهود والنصارى من جزيرة العرب حتى لا أدع إلا مسلما ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 4595,
			"arabicnumber": "1767.02",
			"text": "وحدثني زهير بن حرب، حدثنا روح بن عبادة، أخبرنا سفيان الثوري، ح وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، - وهو ابن عبيد الله - كلاهما عن أبي الزبير، بهذا الإسناد مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 4596,
			"arabicnumber": "1768.01",
			"text": "وحدثنا أبو بكر بن أبي شيبة، ومحمد بن المثنى، وابن، بشار - وألفاظهم متقاربة - قال أبو بكر حدثنا غندر، عن شعبة، وقال الآخران، حدثنا محمد بن جعفر، حدثنا شعبة، - عن سعد بن إبراهيم، قال سمعت أبا أمامة بن سهل بن حنيف، قال سمعت أبا سعيد، الخدري قال نزل أهل قريظة على حكم سعد بن معاذ فأرسل رسول الله صلى الله عليه وسلم إلى سعد فأتاه على حمار فلما دنا قريبا من المسجد قال رسول الله صلى الله عليه وسلم للأنصار ‏\"‏ قوموا إلى سيدكم - أو خيركم ‏\"‏ ‏.‏ ثم قال ‏\"‏ إن هؤلاء نزلوا على حكمك ‏\"‏ ‏.‏ قال تقتل مقاتلتهم وتسبي ذريتهم ‏.‏ قال فقال النبي صلى الله عليه وسلم ‏\"‏ قضيت بحكم الله - وربما قال - قضيت بحكم الملك ‏\"‏ ‏.‏ ولم يذكر ابن المثنى وربما قال ‏\"‏ قضيت بحكم الملك ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 4597,
			"arabicnumber": "1768.02",
			"text": "وحدثنا زهير بن حرب، حدثنا عبد الرحمن بن مهدي، عن شعبة، بهذا الإسناد وقال في حديثه فقال رسول الله صلى الله عليه وسلم ‏\"‏ لقد حكمت فيهم بحكم الله ‏\"‏ ‏.‏ وقال مرة ‏\"‏ لقد حكمت بحكم الملك ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 4598,
			"arabicnumber": "1769.01",
			"text": "وحدثنا أبو بكر بن أبي شيبة، ومحمد بن العلاء الهمداني، كلاهما عن ابن نمير، قال ابن العلاء حدثنا ابن نمير، حدثنا هشام، عن أبيه، عن عائشة، قالت أصيب سعد يوم الخندق رماه رجل من قريش يقال له ابن العرقة ‏.‏ رماه في الأكحل فضرب عليه رسول الله صلى الله عليه وسلم خيمة في المسجد يعوده من قريب فلما رجع رسول الله صلى الله عليه وسلم من الخندق وضع السلاح فاغتسل فأتاه جبريل وهو ينفض رأسه من الغبار فقال وضعت السلاح والله ما وضعناه اخرج إليهم ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏ \"‏ فأين ‏\"‏ ‏.‏ فأشار إلى بني قريظة فقاتلهم رسول الله صلى الله عليه وسلم فنزلوا على حكم رسول الله صلى الله عليه وسلم فرد رسول الله صلى الله عليه وسلم الحكم فيهم إلى سعد قال فإني أحكم فيهم أن تقتل المقاتلة وأن تسبى الذرية والنساء وتقسم أموالهم ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 4599,
			"arabicnumber": "1769.02",
			"text": "وحدثنا أبو كريب، حدثنا ابن نمير، حدثنا هشام، قال قال أبي فأخبرت أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لقد حكمت فيهم بحكم الله عز وجل ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 4600,
			"arabicnumber": "1769.03",
			"text": "حدثنا أبو كريب، حدثنا ابن نمير، عن هشام، أخبرني أبي، عن عائشة، أن سعدا، قال وتحجر كلمه للبرء فقال اللهم إنك تعلم أن ليس أحد أحب إلى أن أجاهد فيك من قوم كذبوا رسولك صلى الله عليه وسلم وأخرجوه اللهم فإن كان بقي من حرب قريش شىء فأبقني أجاهدهم فيك اللهم فإني أظن أنك قد وضعت الحرب بيننا وبينهم فإن كنت وضعت الحرب بيننا وبينهم فافجرها واجعل موتي فيها ‏.‏ فانفجرت من لبته فلم يرعهم - وفي المسجد معه خيمة من بني غفار - إلا والدم يسيل إليهم فقالوا يا أهل الخيمة ما هذا الذي يأتينا من قبلكم فإذا سعد جرحه يغذ دما فمات منها ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 4601,
			"arabicnumber": "1769.04",
			"text": "وحدثنا علي بن الحسين بن سليمان الكوفي، حدثنا عبدة، عن هشام، بهذا الإسناد نحوه غير أنه قال فانفجر من ليلته فمازال يسيل حتى مات وزاد في الحديث قال فذاك حين يقول الشاعر ألا يا سعد سعد بني معاذ فما فعلت قريظة والنضير لعمرك إن سعد بني معاذ غداة تحملوا لهو الصبور تركتم قدركم لا شىء فيها وقدر القوم حامية تفور وقد قال الكريم أبو حباب أقيموا قينقاع ولا تسيروا وقد كانوا ببلدتهم ثقالا كما ثقلت بميطان الصخور",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 4602,
			"arabicnumber": "1770",
			"text": "وحدثني عبد الله بن محمد بن أسماء الضبعي، حدثنا جويرية بن أسماء، عن نافع، عن عبد الله، قال نادى فينا رسول الله صلى الله عليه وسلم يوم انصرف عن الأحزاب ‏ \"‏ أن لا يصلين أحد الظهر إلا في بني قريظة ‏\"‏ ‏.‏ فتخوف ناس فوت الوقت فصلوا دون بني قريظة ‏.‏ وقال آخرون لا نصلي إلا حيث أمرنا رسول الله صلى الله عليه وسلم وإن فاتنا الوقت قال فما عنف واحدا من الفريقين ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 4603,
			"arabicnumber": "1771.01",
			"text": "وحدثني أبو الطاهر، وحرملة، قالا أخبرنا ابن وهب، أخبرني يونس، عن ابن، شهاب عن أنس بن مالك، قال لما قدم المهاجرون من مكة المدينة قدموا وليس بأيديهم شىء وكان الأنصار أهل الأرض والعقار فقاسمهم الأنصار على أن أعطوهم أنصاف ثمار أموالهم كل عام ويكفونهم العمل والمئونة وكانت أم أنس بن مالك وهى تدعى أم سليم - وكانت أم عبد الله بن أبي طلحة كان أخا لأنس لأمه - وكانت أعطت أم أنس رسول الله صلى الله عليه وسلم عذاقا لها فأعطاها رسول الله صلى الله عليه وسلم أم أيمن مولاته أم أسامة بن زيد ‏.‏ قال ابن شهاب فأخبرني أنس بن مالك أن رسول الله صلى الله عليه وسلم لما فرغ من قتال أهل خيبر وانصرف إلى المدينة رد المهاجرون إلى الأنصار منائحهم التي كانوا منحوهم من ثمارهم - قال - فرد رسول الله صلى الله عليه وسلم إلى أمي عذاقها وأعطى رسول الله صلى الله عليه وسلم أم أيمن مكانهن من حائطه ‏.‏ قال ابن شهاب وكان من شأن أم أيمن أم أسامة بن زيد أنها كانت وصيفة لعبد الله بن عبد المطلب وكانت من الحبشة فلما ولدت آمنة رسول الله صلى الله عليه وسلم بعد ما توفي أبوه فكانت أم أيمن تحضنه حتى كبر رسول الله صلى الله عليه وسلم فأعتقها ثم أنكحها زيد بن حارثة ثم توفيت بعد ما توفي رسول الله صلى الله عليه وسلم بخمسة أشهر ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 4604,
			"arabicnumber": "1771.02",
			"text": "حدثنا أبو بكر بن أبي شيبة، وحامد بن عمر البكراوي، ومحمد بن عبد الأعلى، القيسي كلهم عن المعتمر، - واللفظ لابن أبي شيبة - حدثنا معتمر بن سليمان التيمي، عن أبيه، عن أنس، أن رجلا، - وقال حامد وابن عبد الأعلى أن الرجل، - كان يجعل للنبي صلى الله عليه وسلم النخلات من أرضه ‏.‏ حتى فتحت عليه قريظة والنضير فجعل بعد ذلك يرد عليه ما كان أعطاه ‏.‏ قال أنس وإن أهلي أمروني أن آتي النبي صلى الله عليه وسلم فأسأله ما كان أهله أعطوه أو بعضه وكان نبي الله صلى الله عليه وسلم قد أعطاه أم أيمن فأتيت النبي صلى الله عليه وسلم فأعطانيهن فجاءت أم أيمن فجعلت الثوب في عنقي وقالت والله لا نعطيكاهن وقد أعطانيهن ‏.‏ فقال نبي الله صلى الله عليه وسلم ‏ \"‏ يا أم أيمن اتركيه ولك كذا وكذا ‏\"‏ ‏.‏ وتقول كلا والذي لا إله إلا هو ‏.‏ فجعل يقول كذا حتى أعطاها عشرة أمثاله أو قريبا من عشرة أمثاله ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 4605,
			"arabicnumber": "1772.01",
			"text": "حدثنا شيبان بن فروخ، حدثنا سليمان، - يعني ابن المغيرة - حدثنا حميد، بن هلال عن عبد الله بن مغفل، قال أصبت جرابا من شحم يوم خيبر - قال - فالتزمته فقلت لا أعطي اليوم أحدا من هذا شيئا - قال - فالتفت فإذا رسول الله صلى الله عليه وسلم متبسما ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 4606,
			"arabicnumber": "1772.02",
			"text": "حدثنا محمد بن بشار العبدي، حدثنا بهز بن أسد، حدثنا شعبة، حدثني حميد، بن هلال قال سمعت عبد الله بن مغفل، يقول رمي إلينا جراب فيه طعام وشحم يوم خيبرفوثبت لآخذه قال فالتفت فإذا رسول الله صلى الله عليه وسلم فاستحييت منه ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 4607,
			"arabicnumber": "1773.01",
			"text": "حدثنا إسحاق بن إبراهيم الحنظلي، وابن أبي عمر، ومحمد بن رافع، وعبد بن، حميد - واللفظ لابن رافع - قال ابن رافع وابن أبي عمر حدثنا وقال الآخران، أخبرنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن عبيد الله بن عبد الله بن عتبة، عن ابن عباس، أن أبا سفيان، أخبره من، فيه إلى فيه قال انطلقت في المدة التي كانت بيني وبين رسول الله صلى الله عليه وسلم قال فبينا أنا بالشأم إذ جيء بكتاب من رسول الله صلى الله عليه وسلم إلى هرقل يعني عظيم الروم - قال - وكان دحية الكلبي جاء به فدفعه إلى عظيم بصرى فدفعه عظيم بصرى إلى هرقل فقال هرقل هل ها هنا أحد من قوم هذا الرجل الذي يزعم أنه نبي قالوا نعم - قال - فدعيت في نفر من قريش فدخلنا على هرقل فأجلسنا بين يديه فقال أيكم أقرب نسبا من هذا الرجل الذي يزعم أنه نبي فقال أبو سفيان فقلت أنا ‏.‏ فأجلسوني بين يديه وأجلسوا أصحابي خلفي ثم دعا بترجمانه فقال له قل لهم إني سائل هذا عن الرجل الذي يزعم أنه نبي فإن كذبني فكذبوه ‏.‏ قال فقال أبو سفيان وايم الله لولا مخافة أن يؤثر على الكذب لكذبت ‏.‏ ثم قال لترجمانه سله كيف حسبه فيكم قال قلت هو فينا ذو حسب قال فهل كان من�� آبائه ملك قلت لا ‏.‏ قال فهل كنتم تتهمونه بالكذب قبل أن يقول ما قال قلت لا ‏.‏ قال ومن يتبعه أشراف الناس أم ضعفاؤهم قال قلت بل ضعفاؤهم ‏.‏ قال أيزيدون أم ينقصون قال قلت لا بل يزيدون ‏.‏ قال هل يرتد أحد منهم عن دينه بعد أن يدخل فيه سخطة له قال قلت لا ‏.‏ قال فهل قاتلتموه قلت نعم ‏.‏ قال فكيف كان قتالكم إياه قال قلت تكون الحرب بيننا وبينه سجالا يصيب منا ونصيب منه ‏.‏ قال فهل يغدر قلت لا ‏.‏ ونحن منه في مدة لا ندري ما هو صانع فيها ‏.‏ قال فوالله ما أمكنني من كلمة أدخل فيها شيئا غير هذه ‏.‏ قال فهل قال هذا القول أحد قبله قال قلت لا ‏.‏ قال لترجمانه قل له إني سألتك عن حسبه فزعمت أنه فيكم ذو حسب وكذلك الرسل تبعث في أحساب قومها ‏.‏ وسألتك هل كان في آبائه ملك فزعمت أن لا ‏.‏ فقلت لو كان من آبائه ملك قلت رجل يطلب ملك آبائه ‏.‏ وسألتك عن أتباعه أضعفاؤهم أم أشرافهم فقلت بل ضعفاؤهم وهم أتباع الرسل ‏.‏ وسألتك هل كنتم تتهمونه بالكذب قبل أن يقول ما قال فزعمت أن لا ‏.‏ فقد عرفت أنه لم يكن ليدع الكذب على الناس ثم يذهب فيكذب على الله ‏.‏ وسألتك هل يرتد أحد منهم عن دينه بعد أن يدخله سخطة له فزعمت أن لا ‏.‏ وكذلك الإيمان إذا خالط بشاشة القلوب ‏.‏ وسألتك هل يزيدون أو ينقصون فزعمت أنهم يزيدون وكذلك الإيمان حتى يتم ‏.‏ وسألتك هل قاتلتموه فزعمت أنكم قد قاتلتموه فتكون الحرب بينكم وبينه سجالا ينال منكم وتنالون منه ‏.‏ وكذلك الرسل تبتلى ثم تكون لهم العاقبة وسألتك هل يغدر فزعمت أنه لا يغدر ‏.‏ وكذلك الرسل لا تغدر ‏.‏ وسألتك هل قال هذا القول أحد قبله فزعمت أن لا ‏.‏ فقلت لو قال هذا القول أحد قبله قلت رجل ائتم بقول قيل قبله ‏.‏ قال ثم قال بم يأمر كم قلت يأمرنا بالصلاة والزكاة والصلة والعفاف قال إن يكن ما تقول فيه حقا فإنه نبي وقد كنت أعلم أنه خارج ولم أكن أظنه منكم ولو أني أعلم أني أخلص إليه لأحببت لقاءه ولو كنت عنده لغسلت عن قدميه وليبلغن ملكه ما تحت قدمى ‏.‏ قال ثم دعا بكتاب رسول الله صلى الله عليه وسلم فقرأه فإذا فيه ‏\"‏ بسم الله الرحمن الرحيم من محمد رسول الله إلى هرقل عظيم الروم سلام على من اتبع الهدى أما بعد فإني أدعوك بدعاية الإسلام أسلم تسلم وأسلم يؤتك الله أجرك مرتين وإن توليت فإن عليك إثم الأريسيين و ‏{‏ يا أهل الكتاب تعالوا إلى كلمة سواء بيننا وبينكم أن لا نعبد إلا الله ولا نشرك به شيئا ولا يتخذ بعضنا بعضا أربابا من دون الله فإن تولوا فقولوا اشهدوا بأنا مسلمون‏}‏ فلما فرغ من قراءة الكتاب ارتفعت الأصوات عنده وكثر اللغط وأمر بنا فأخرجنا ‏.‏ قال فقلت لأصحابي حين خرجنا لقد أمر أمر ابن أبي كبشة إنه ليخافه ملك بني الأصفر - قال - فما زلت موقنا بأمر رسول الله صلى الله عليه وسلم أنه سيظهر حتى أدخل الله على الإسلام ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 4608,
			"arabicnumber": "1773.02",
			"text": "وحدثناه حسن الحلواني، وعبد بن حميد، قالا حدثنا يعقوب، - وهو ابن إبراهيم بن سعد - حدثنا أبي، عن صالح، عن ابن شهاب، بهذا الإسناد وزاد في الحديث وكان قيصر لما كشف الله عنه جنود فارس مشى من حمص إلى إيلياء شكرا لما أبلاه الله ‏.‏ وقال في الحديث ‏\"‏ من محمد عبد الله ورسوله ‏\"‏ ‏.‏ وقال ‏\"‏ إثم اليريسيين ‏\"‏ ‏.‏ وقال ‏\"‏ بداعية الإسلام ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 4609,
			"arabicnumber": "1774.01",
			"text": "حدثني يوسف بن حماد المعني، حدثنا عبد الأعلى، عن سعيد، عن قتادة، عن أنس، أن نبي الله صلى الله عليه وسلم كتب إلى كسرى وإلى قيصر وإلى النجاشي وإلى كل جبار يدعوهم إلى الله تعالى وليس بالنجاشي الذي صلى عليه النبي صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 4610,
			"arabicnumber": "1774.02",
			"text": "وحدثناه محمد بن عبد الله الرزي، حدثنا عبد الوهاب بن عطاء، عن سعيد، عن قتادة، حدثنا أنس بن مالك، عن النبي صلى الله عليه وسلم ‏.‏ بمثله ولم يقل وليس بالنجاشي الذي صلى عليه النبي صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 4611,
			"arabicnumber": "1774.03",
			"text": "وحدثنيه نصر بن علي الجهضمي، أخبرني أبي، حدثني خالد بن قيس، عن قتادة، عن أنس، ولم يذكر وليس بالنجاشي الذي صلى عليه النبي صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 4612,
			"arabicnumber": "1775.01",
			"text": "وحدثني أبو الطاهر، أحمد بن عمرو بن سرح أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، قال حدثني كثير بن عباس بن عبد المطلب، قال قال عباس شهدت مع رسول الله صلى الله عليه وسلم يوم حنين فلزمت أنا وأبو سفيان بن الحارث بن عبد المطلب رسول الله صلى الله عليه وسلم فلم نفارقه ورسول الله صلى الله عليه وسلم على بغلة له بيضاء أهداها له فروة بن نفاثة الجذامي فلما التقى المسلمون والكفار ولى المسلمون مدبرين فطفق رسول الله صلى الله عليه وسلم يركض بغلته قبل الكفار قال عباس و أنا آخذ بلجام بغلة رسول الله صلى الله عليه وسلم أكفها إرادة أن لا تسرع وأبو سفيان آخذ بركاب رسول الله صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ أى عباس ناد أصحاب السمرة ‏\"‏ ‏.‏ فقال عباس وكان رجلا صيتا فقلت بأعلى صوتي أين أصحاب السمرة قال فوالله لكأن عطفتهم حين سمعوا صوتي عطفة البقر على أولادها ‏.‏ فقالوا يا لبيك يا لبيك - قال - فاقتتلوا والكفار والدعوة في الأنصار يقولون يا معشر الأنصار يا معشر الأنصار قال ثم قصرت الدعوة على بني الحارث بن الخزرج فقالوا يا بني الحارث بن الخزرج يا بني الحارث بن الخزرج ‏.‏ فنظر رسول الله صلى الله عليه وسلم وهو على بغلته كالمتطاول عليها إلى قتالهم فقال رسول الله صلى الله عليه وسلم ‏\"‏ هذا حين حمي الوطيس ‏\"‏ ‏.‏ قال ثم أخذ رسول الله صلى الله عليه وسلم حصيات فرمى بهن وجوه الكفار ثم قال ‏\"‏ انهزموا ورب محمد ‏\"‏ ‏.‏ قال فذهبت أنظر فإذا القتال على هيئته فيما أرى - قال - فوالله ما هو إلا أن رماهم بحصياته فما زلت أرى حدهم كليلا وأمرهم مدبرا ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 4613,
			"arabicnumber": "1775.02",
			"text": "وحدثناه إسحاق بن إبراهيم، ومحمد بن رافع، وعبد بن حميد، جميعا عن عبد، الرزاق أخبرنا معمر، عن الزهري، بهذا الإسناد ‏.‏ نحوه غير أنه قال فروة بن نعامة الجذامي ‏.‏ وقال ‏ \"‏ انهزموا ورب الكعبة انهزموا ورب الكعبة ‏\"‏ ‏.‏ وزاد في الحديث حتى هزمهم الله قال وكأني أنظر إلى النبي صلى الله عليه وسلم يركض خلفهم على بغلته ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 4614,
			"arabicnumber": "1775.03",
			"text": "وحدثناه ابن أبي عمر، حدثنا سفيان بن عيينة، عن الزهري، قال أخبرني كثير، بن العباس عن أبيه، قال كنت مع النبي صلى الله عليه وسلم يوم حنين ‏.‏ وساق الحديث ‏.‏ غير أن حديث يونس وحديث معمر أكثر منه وأتم ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 4615,
			"arabicnumber": "1776.01",
			"text": "حدثنا يحيى بن يحيى، أخبرنا أبو خيثمة، عن أبي إسحاق، قال قال رجل للبراء يا أبا عمارة أفررتم يوم حنين قال لا والله ما ولى رسول الله صلى الله عليه وسلم ولكنه خرج شبان أصحابه وأخفاؤهم حسرا ليس عليهم سلاح أو كثير سلاح فلقوا قوما رماة لا يكاد يسقط لهم سهم جمع هوازن وبني نصر فرشقوهم رشقا ما يكادون يخطئون فأقبلوا هناك إلى رسول الله صلى الله عليه وسلم ورسول الله صلى الله عليه وسلم على بغلته البيضاء وأبو سفيان بن الحارث بن عبد المطلب يقود به فنزل فاستنصر وقال ‏ \"‏ أنا النبي لا كذب أنا ابن عبد المطلب ‏\"‏ ‏.‏ ثم صفهم ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 4616,
			"arabicnumber": "1776.02",
			"text": "حدثنا أحمد بن جناب المصيصي، حدثنا عيسى بن يونس، عن زكرياء، عن أبي، إسحاق قال جاء رجل إلى البراء فقال أكنتم وليتم يوم حنين يا أبا عمارة فقال أشهد على نبي الله صلى الله عليه وسلم ما ولى ولكنه انطلق أخفاء من الناس وحسر إلى هذا الحى من هوازن وهم قوم رماة فرموهم برشق من نبل كأنها رجل من جراد فانكشفوا فأقبل القوم إلى رسول الله صلى الله عليه وسلم وأبو سفيان بن الحارث يقود به بغلته فنزل ودعا واستنصر وهو يقول ‏ \"‏ أنا النبي لا كذب أنا ابن عبد المطلب اللهم نزل نصرك ‏\"‏ ‏.‏ قال البراء كنا والله إذا احمر البأس نتقي به وإن الشجاع منا للذي يحاذي به ‏.‏ يعني النبي صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 4617,
			"arabicnumber": "1776.03",
			"text": "وحدثنا محمد بن المثنى، وابن، بشار - واللفظ لابن المثنى - قالا حدثنا محمد، بن جعفر حدثنا شعبة، عن أبي إسحاق، قال سمعت البراء، وسأله، رجل من قيس أفررتم عن رسول الله صلى الله عليه وسلم يوم حنين فقال البراء ولكن رسول الله صلى الله عليه وسلم لم يفر وكانت هوازن يومئذ رماة وإنا لما حملنا عليهم انكشفوا فأكببنا على الغنائم فاستقبلونا بالسهام ولقد رأيت رسول الله صلى الله عليه وسلم على بغلته البيضاء وإن أبا سفيان بن الحارث آخذ بلجامها وهو يقول ‏ \"‏ أنا النبي لا كذب أنا ابن عبد المطلب ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 4618,
			"arabicnumber": "1776.04",
			"text": "وحدثني زهير بن حرب، ومحمد بن المثنى، وأبو بكر بن خلاد قالوا حدثنا يحيى، بن سعيد عن سفيان، قال حدثني أبو إسحاق، عن البراء، قال قال له رجل يا أبا عمارة ‏.‏ فذكر الحديث وهو أقل من حديثهم وهؤلاء أتم حديثا ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 4619,
			"arabicnumber": "1777",
			"text": "وحدثنا زهير بن حرب، حدثنا عمر بن يونس الحنفي، حدثنا عكرمة بن عمار، حدثني إياس بن سلمة، حدثني أبي قال، غزونا مع رسول الله صلى الله عليه وسلم حنينا فلما واجهنا العدو تقدمت فأعلو ثنية فاستقبلني رجل من العدو فأرميه بسهم فتوارى عني فما دريت ما صنع ونظرت إلى القوم فإذا هم قد طلعوا من ثنية أخرى فالتقوا هم وصحابة النبي صلى الله عليه وسلم فولى صحابة النبي صلى الله عليه وسلم وأرجع منهزما وعلى بردتان متزرا بإحداهما مرتديا بالأخرى فاستطلق إزاري فجمعتهما جميعا ومررت على رسول الله صلى الله عليه وسلم منهزما وهو على بغلته الشهباء فقال رسول الله صلى الله عليه وسلم ‏\"‏ لقد رأى ابن الأكوع فزعا ‏\"‏ ‏.‏ فلما غشوا رسول الله صلى الله عليه وسلم نزل عن البغلة ثم قبض قبضة من تراب من الأرض ثم استقبل به وجوههم فقال ‏\"‏ شاهت الوجوه ‏\"‏ ‏.‏ فما خلق الله منهم إنسانا إلا ملأ عينيه ترابا بتلك القبضة فولوا مدبرين فهزمهم الله عز وجل وقسم رسول الله صلى الله عليه وسلم غنائمهم بين المسلمين ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 4620,
			"arabicnumber": "1778",
			"text": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، وابن، نمير جميعا عن سفيان، قال زهير حدثنا سفيان بن عيينة، عن عمرو، عن أبي العباس الشاعر الأعمى، عن عبد الله، بن عمرو قال حاصر رسول الله صلى الله عليه وسلم أهل الطائف فلم ينل منهم شيئا فقال ‏\"‏ إنا قافلون إن شاء الله ‏\"‏ ‏.‏ قال أصحابه نرجع ولم نفتتحه فقال لهم رسول الله صلى الله عليه وسلم ‏\"‏ اغدوا على القتال ‏\"‏ ‏.‏ فغدوا عليه فأصابهم جراح فقال لهم رسول الله صلى الله عليه وسلم ‏\"‏ إنا قافلون غدا ‏\"‏ ‏.‏ قال فأعجبهم ذلك فضحك رسول الله صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 4621,
			"arabicnumber": "1779",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا عفان، حدثنا حماد بن سلمة، عن ثابت، عن أنس، أن رسول الله صلى الله عليه وسلم شاور حين بلغه إقبال أبي سفيان قال فتكلم أبو بكر فأعرض عنه ثم تكلم عمر فأعرض عنه فقام سعد بن عبادة فقال إيانا تريد يا رسول الله والذي نفسي بيده لو أمرتنا أن نخيضها البحر لأخضناها ولو أمرتنا أن نضرب أكبادها إلى برك الغماد لفعلنا - قال - فندب رسول الله صلى الله عليه وسلم الناس فانطلقوا حتى نزلوا بدرا ووردت عليهم روايا قريش وفيهم غلام أسود لبني الحجاج فأخذوه فكان أصحاب رسول الله صلى الله عليه وسلم يسألونه عن أبي سفيان وأصحابه ‏.‏ فيقول ما لي علم بأبي سفيان ولكن هذا أبو جهل وعتبة وشيبة وأمية بن خلف ‏.‏ فإذا قال ذلك ضربوه فقال نعم أنا أخبركم هذا أبو سفيان ‏.‏ فإذا تركوه فسألوه فقال ما لي بأبي سفيان علم ولكن هذا أبو جهل وعتبة وأمية بن خلف في الناس ‏.‏ فإذا قال هذا أيضا ضربوه ورسول الله صلى الله عليه وسلم قائم يصلي فلما رأى ذلك انصرف قال ‏\"‏ والذي نفسي بيده لتضربوه إذا صدقكم وتتركوه إذا كذبكم ‏\"‏ ‏.‏ قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ هذا مصرع فلان ‏\"‏ ‏.‏ قال ويضع يده على الأرض ها هنا وها هنا قال فما ماط أحدهم عن موضع يد رسول الله صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 4622,
			"arabicnumber": "1780.01",
			"text": "حدثنا شيبان بن فروخ، حدثنا سليمان بن المغيرة، حدثنا ثابت البناني، عن عبد الله بن رباح، عن أبي هريرة، قال وفدت وفود إلى معاوية وذلك في رمضان فكان يصنع بعضنا لبعض الطعام فكان أبو هريرة مما يكثر أن يدعونا إلى رحله فقلت ألا أصنع طعاما فأدعوهم إلى رحلي فأمرت بطعام يصنع ثم لقيت أبا هريرة من العشي فقلت الدعوة عندي الليلة فقال سبقتني ‏.‏ قلت نعم ‏.‏ فدعوتهم فقال أبو هريرة ألا أعلمكم بحديث من حديثكم يا معشر الأنصار ثم ذكر فتح مكة فقال أقبل رسول الله صلى الله عليه وسلم حتى قدم مكة فبعث الزبير على إحدى المجنبتين وبعث خالدا على المجنبة الأخرى وبعث أبا عبيدة على الحسر فأخذوا بطن الوادي ورسول الله صلى الله عليه وسلم في كتيبة - قال - فنظر فرآني فقال ‏\"‏ أبو هريرة ‏\"‏ ‏.‏ قلت لبيك يا رسول الله ‏.‏ فقال ‏\"‏ لا يأتيني إلا أنصاري ‏\"‏ ‏.‏ زاد غير شيبان فقال ‏\"‏ اهتف لي بالأنصار ‏\"‏ ‏.‏ قال فأطافوا به ووبشت قريش أوباشا لها وأتباعا ‏.‏ فقالوا نقدم هؤلاء فإن كان لهم شىء كنا معهم ‏.‏ وإن أصيبوا أعطينا الذي سئلنا فقال رسول الله صلى الله عليه وسلم ‏\"‏ ترون إلى أوباش قريش وأتباعهم ‏\"‏ ‏.‏ ثم قال بيديه إحداهما على الأخرى ثم قال ‏\"‏ حتى توافوني بالصفا ‏\"‏ ‏.‏ قال فانطلقنا فما شاء أحد منا أن يقتل أحدا إلا قتله وما أحد منهم يوجه إلينا شيئا - قال - فجاء أبو سفيان فقال يا رسول الله أبيحت خضراء قريش لا قريش بعد اليوم ‏.‏ ثم قال ‏\"‏ من دخل دار أبي سفيان فهو آمن ‏\"‏ ‏.‏ فقالت الأنصار بعضهم لبعض أما الرجل فأدركته رغبة في قريته ورأفة بعشيرته ‏.‏ قال أبو هريرة وجاء الوحى وكان إذا جاء الوحى لا يخفى علينا فإذا جاء فليس أحد يرفع طرفه إلى رسول الله صلى الله عليه وسلم حتى ينقضي الوحى فلما انقضى الوحى قال رسول الله صلى الله عليه وسلم ‏\"‏ يا معشر الأنصار ‏\"‏ ‏.‏ قالوا لبيك يا رسول الله قال ‏\"‏ قلتم أما الرجل فأدركته رغبة في قريته ‏\"‏ ‏.‏ قالوا قد كان ذاك ‏.‏ قال ‏\"‏ كلا إني عبد الله ورسوله هاجرت إلى الله وإليكم والمحيا محياكم والممات مماتكم ‏\"‏ ‏.‏ فأقبلوا إليه يبكون ويقولون والله ما قلنا الذي قلنا إلا الضن بالله وبرسوله ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله ورسوله يصدقانكم ويعذرانكم ‏\"‏ ‏.‏ قال فأقبل الناس إلى دار أبي سفيان وأغلق الناس أبوابهم - قال - وأقبل رسول الله صلى الله عليه وسلم حتى أقبل إلى الحجر فاستلمه ثم طاف بالبيت - قال - فأتى على صنم إلى جنب البيت كانوا يعبدونه - قال - وفي يد رسول الله صلى الله عليه وسلم قوس وهو آخذ بسية القوس فلما أتى على الصنم جعل يطعنه في عينه ويقول ‏\"‏ جاء الحق وزهق الباطل ‏\"‏ ‏.‏ فلما فرغ من طوافه أتى الصفا فعلا عليه حتى نظر إلى البيت ورفع يديه فجعل يحمد الله ويدعو بما شاء أن يدعو ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 4623,
			"arabicnumber": "1780.02",
			"text": "وحدثنيه عبد الله بن هاشم، حدثنا بهز، حدثنا سليمان بن المغيرة، بهذا الإسناد وزاد في الحديث ثم قال بيديه إحداهما على الأخرى ‏\"‏ احصدوهم حصدا ‏\"‏ ‏.‏ وقال في الحديث قالوا قلنا ذاك يا رسول الله قال ‏\"‏ فما اسمي إذا كلا إني عبد الله ورسوله ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 4624,
			"arabicnumber": "1780.03",
			"text": "حدثني عبد الله بن عبد الرحمن الدارمي، حدثنا يحيى بن حسان، حدثنا حماد، بن سلمة أخبرنا ثابت، عن عبد الله بن رباح، قال وفدنا إلى معاوية بن أبي سفيان وفينا أبو هريرة فكان كل رجل منا يصنع طعاما يوما لأصحابه فكانت نوبتي فقلت يا أبا هريرة اليوم نوبتي ‏.‏ فجاءوا إلى المنزل ولم يدرك طعامنا فقلت يا أبا هريرة لو حدثتنا عن رسول الله صلى الله عليه وسلم حتى يدرك طعامنا فقال كنا مع رسول الله صلى الله عليه وسلم يوم الفتح فجعل خالد بن الوليد على المجنبة اليمنى وجعل الزبير على المجنبة اليسرى وجعل أبا عبيدة على البياذقة وبطن الوادي فقال ‏\"‏ يا أبا هريرة ادع لي الأنصار ‏\"‏ ‏.‏ فدعوتهم فجاءوا يهرولون فقال ‏\"‏ يا معشر الأنصار هل ترون أوباش قريش ‏\"‏ ‏.‏ قالوا نعم ‏.‏ قال ‏\"‏ انظروا إذا لقيتموهم غدا أن تحصدوهم حصدا ‏\"‏ ‏.‏ وأخفى بيده ووضع يمينه على شماله وقال ‏\"‏ موعدكم الصفا ‏\"‏ ‏.‏ قال فما أشرف يومئذ لهم أحد إلا أناموه - قال - وصعد رسول الله صلى الله عليه وسلم الصفا وجاءت الأنصار فأطافوا بالصفا فجاء أبو سفيان فقال يا رسول الله أبيدت خضراء قريش لا قريش بعد اليوم ‏.‏ قال أبو سفيان قال رسول الله صلى الله عليه وسلم ‏\"‏ من دخل دار أبي سفيان فهو آمن ومن ألقى السلاح فهو آمن ومن أغلق بابه فهو آمن ‏\"‏ ‏.‏ فقالت الأنصار أما الرجل فقد أخذته رأفة بعشيرته ورغبة في قريته ‏.‏ ونزل الوحى على رسول الله صلى الله عليه وسلم قال ‏\"‏ قلتم أما الرجل فقد أخذته رأفة بعشيرته ورغبة في قريته ‏.‏ ألا فما اسمي إذا - ثلاث مرات - أنا محمد عبد الله ورسوله هاجرت إلى الله وإليكم فالمحيا محياكم والممات مماتكم ‏\"‏ ‏.‏ قالوا والله ما قلنا إلا ضنا بالله ورسوله ‏.‏ قال ‏\"‏ فإن الله ورسوله يصدقانكم ويعذرانكم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 4625,
			"arabicnumber": "1781.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، وابن أبي عمر، - واللفظ لابن أبي شيبة - قالوا حدثنا سفيان بن عيينة، عن ابن أبي نجيح، عن مجاهد، عن أبي معمر، عن عبد الله، قال دخل النبي صلى الله عليه وسلم مكة وحول الكعبة ثلاثمائة وستون نصبا فجعل يطعنها بعود كان بيده ويقول ‏\"‏ ‏{‏ جاء الحق وزهق الباطل إن الباطل كان زهوقا‏}‏ ‏{‏ جاء الحق وما يبدئ الباطل وما يعيد‏}‏ زاد ابن أبي عمر يوم الفتح ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 4626,
			"arabicnumber": "1781.02",
			"text": "وحدثناه حسن بن علي الحلواني، وعبد بن حميد، كلاهما عن عبد الرزاق، أخبرنا الثوري، عن ابن أبي نجيح، بهذا الإسناد إلى قوله زهوقا ‏.‏ ولم يذكر الآية الأخرى وقال بدل نصبا صنما ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 4627,
			"arabicnumber": "1782.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، ووكيع، عن زكرياء، عن الشعبي، قال أخبرني عبد الله بن مطيع، عن أبيه، قال سمعت النبي صلى الله عليه وسلم يقول يوم فتح مكة ‏ \"‏ لا يقتل قرشي صبرا بعد هذا اليوم إلى يوم القيامة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 4628,
			"arabicnumber": "1782.02",
			"text": "حدثنا ابن نمير، حدثنا أبي، حدثنا زكرياء، بهذا الإسناد ‏.‏ وزاد قال ولم يكن أسلم أحد من عصاة قريش غير مطيع كان اسمه العاصي فسماه رسول الله صلى الله عليه وسلم مطيعا ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 4629,
			"arabicnumber": "1783.01",
			"text": "حدثني عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن أبي إسحاق، قال سمعت البراء بن عازب، يقول كتب علي بن أبي طالب الصلح بين النبي صلى الله عليه وسلم وبين المشركين يوم الحديبية فكتب ‏\"‏ هذا ما كاتب عليه محمد رسول الله‏\"‏ ‏.‏ فقالوا لا تكتب رسول الله فلو نعلم أنك رسول الله لم نقاتلك ‏.‏ فقال النبي صلى الله عليه وسلم لعلي ‏\"‏ امحه ‏\"‏ ‏.‏ فقال ما أنا بالذي أمحاه ‏.‏ فمحاه النبي صلى الله عليه وسلم بيده قال وكان فيما اشترطوا أن يدخلوا مكة فيقيموا بها ثلاثا ولا يدخلها بسلاح إلا جلبان السلاح ‏.‏ قلت لأبي إسحاق وما جلبان السلاح قال القراب وما فيه ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 4630,
			"arabicnumber": "1783.02",
			"text": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن أبي إسحاق، قال سمعت البراء بن عازب، يقول لما صالح رسول الله صلى الله عليه وسلم أهل الحديبية كتب علي كتابا بينهم قال فكتب ‏\"‏ محمد رسول الله ‏\"‏ ثم ذكر بنحو حديث معاذ غير أنه لم يذكر في الحديث ‏\"‏ هذا ما كاتب عليه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 4631,
			"arabicnumber": "1783.03",
			"text": "حدثنا إسحاق بن إبراهيم الحنظلي، وأحمد بن جناب المصيصي، جميعا عن عيسى بن يونس، - واللفظ لإسحاق - أخبرنا عيسى بن يونس، أخبرنا زكرياء، عن أبي إسحاق، عن البراء، قال لما أحصر النبي صلى الله عليه وسلم عند البيت صالحه أهل مكة على أن يدخلها فيقيم بها ثلاثا ولا يدخلها إلا بجلبان السلاح السيف وقرابه ‏.‏ ولا يخرج بأحد معه من أهلها ولا يمنع أحدا يمكث بها ممن كان معه ‏.‏ قال لعلي ‏\"‏ اكتب الشرط بيننا بسم الله الرحمن الرحيم هذا ما قاضى عليه محمد رسول الله ‏\"‏ ‏.‏ فقال له المشركون لو نعلم أنك رسول الله تابعناك ولكن اكتب محمد بن عبد الله ‏.‏ فأمر عليا أن يمحاها فقال علي لا والله لا أمحاها ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أرني مكانها ‏\"‏ ‏.‏ فأراه مكانها فمحاها وكتب ‏\"‏ ابن عبد الله ‏\"‏ ‏.‏ فأقام بها ثلاثة أيام فلما أن كان يوم الثالث قالوا لعلي هذا آخر يوم من شرط صاحبك فأمره فليخرج ‏.‏ فأخبره بذلك فقال ‏\"‏ نعم ‏\"‏ ‏.‏ فخرج ‏.‏ وقال ابن جناب في روايته مكان تابعناك بايعناك ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 4632,
			"arabicnumber": "1784",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا عفان، حدثنا حماد بن سلمة، عن ثابت، عن أنس، أن قريشا، صالحوا النبي صلى الله عليه وسلم فيهم سهيل بن عمرو فقال النبي صلى الله عليه وسلم لعلي ‏\"‏ اكتب بسم الله الرحمن الرحيم ‏\"‏ ‏.‏ قال سهيل أما باسم الله فما ندري ما بسم الله الرحمن الرحيم ولكن اكتب ما نعرف باسمك اللهم فقال ‏\"‏ اكتب من محمد رسول الله ‏\"‏ ‏.‏ قالوا لو علمنا أنك رسول الله لاتبعناك ولكن اكتب اسمك واسم أبيك ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ اكتب من محمد بن عبد الله ‏\"‏ ‏.‏ فاشترطوا على النبي صلى الله عليه وسلم أن من جاء منكم لم نرده عليكم ومن جاءكم منا رددتموه علينا فقالوا يا رسول الله أنكتب هذا قال ‏\"‏ نعم إنه من ذهب منا إليهم فأبعده الله ومن جاءنا منهم سيجعل الله له فرجا ومخرجا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 4633,
			"arabicnumber": "1785.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، ح وحدثنا ابن نمير، - وتقاربا في اللفظ - حدثنا أبي، حدثنا عبد العزيز بن سياه، حدثنا حبيب بن أبي ثابت، عن أبي وائل، قال قام سهل بن حنيف يوم صفين فقال أيها الناس اتهموا أنفسكم لقد كنا مع رسول الله صلى الله عليه وسلم يوم الحديبية ولو نرى قتالا لقاتلنا وذلك في الصلح الذي كان بين رسول الله صلى الله عليه وسلم وبين المشركين فجاء عمر بن الخطاب فأتى رسول الله صلى الله عليه وسلم فقال يا رسول الله ألسنا على حق وهم على باطل قال ‏\"‏ بلى ‏\"‏ ‏.‏ قال أليس قتلانا في الجنة وقتلاهم في النار قال ‏\"‏ بلى ‏\"‏ ‏.‏ قال ففيم نعطي الدنية في ديننا ونرجع ولما يحكم الله بيننا وبينهم فقال ‏\"‏ يا ابن الخطاب إني رسول الله ولن يضيعني الله أبدا ‏\"‏ ‏.‏ قال فانطلق عمر فلم يصبر متغيظا فأتى أبا بكر فقال يا أبا بكر ألسنا على حق وهم على باطل قال بلى ‏.‏ قال أليس قتلانا في الجنة وقتلاهم في النار قال بلى ‏.‏ قال فعلام نعطي الدنية في ديننا ونرجع ولما يحكم الله بيننا وبينهم فقال يا ابن الخطاب إنه رسول الله ولن يضيعه الله أبدا ‏.‏ قال فنزل القرآن على رسول الله صلى الله عليه وسلم بالفتح فأرسل إلى عمر فأقرأه إياه فقال يا رسول الله أوفتح هو قال ‏\"‏ نعم ‏\"‏ ‏.‏ فطابت نفسه ورجع ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 4634,
			"arabicnumber": "1785.02",
			"text": "وحدثنا أبو كريب، محمد بن العلاء ومحمد بن عبد الله بن نمير قالا حدثنا أبو معاوية عن الأعمش، عن شقيق، قال سمعت سهل بن حنيف، يقول بصفين أيها الناس اتهموا رأيكم والله لقد رأيتني يوم أبي جندل ولو أني أستطيع أن أرد أمر رسول الله صلى الله عليه وسلم لرددته والله ما وضعنا سيوفنا على عواتقنا إلى أمر قط إلا أسهلن بنا إلى أمر نعرفه إلا أمركم هذا ‏.‏ لم يذكر ابن نمير إلى أمر قط ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 4635,
			"arabicnumber": "1785.03",
			"text": "وحدثناه عثمان بن أبي شيبة، وإسحاق، جميعا عن جرير، ح وحدثني أبو سعيد، الأشج حدثنا وكيع، كلاهما عن الأعمش، بهذا الإسناد ‏.‏ وفي حديثهما إلى أمر يفظعنا.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 4636,
			"arabicnumber": "1785.04",
			"text": "وحدثني إبراهيم بن سعيد الجوهري، حدثنا أبو أسامة، عن مالك بن مغول، عن أبي حصين، عن أبي وائل، قال سمعت سهل بن حنيف، بصفين يقول اتهموا رأيكم على دينكم فلقد رأيتني يوم أبي جندل ولو أستطيع أن أرد أمر رسول الله صلى الله عليه وسلم - ما فتحنا منه في خصم إلا انفجر علينا منه خصم ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 4637,
			"arabicnumber": "1786.01",
			"text": "وحدثنا نصر بن علي الجهضمي، حدثنا خالد بن الحارث، حدثنا سعيد بن أبي، عروبة عن قتادة، أن أنس بن مالك، حدثهم قال لما نزلت ‏{‏ إنا فتحنا لك فتحا مبينا * ليغفر لك الله‏}‏ إلى قوله ‏{‏ فوزا عظيما‏}‏ مرجعه من الحديبية وهم يخالطهم الحزن والكآبة وقد نحر الهدى بالحديبية فقال ‏\"‏ لقد أنزلت على آية هي أحب إلى من الدنيا جميعا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 4638,
			"arabicnumber": "1786.02",
			"text": "وحدثنا عاصم بن النضر التيمي، حدثنا معتمر، قال سمعت أبي، حدثنا قتادة، قال سمعت أنس بن مالك، ح وحدثنا ابن المثنى، حدثنا أبو داود، حدثنا همام، ح وحدثنا عبد بن حميد، حدثنا يونس بن محمد، حدثنا شيبان، جميعا عن قتادة، عن أنس، نحو حديث ابن أبي عروبة ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 4639,
			"arabicnumber": "1787",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، عن الوليد بن جميع، حدثنا أبو الطفيل حدثنا حذيفة بن اليمان، قال ما منعني أن أشهد، بدرا إلا أني خرجت أنا وأبي - حسيل - قال فأخذنا كفار قريش قالوا إنكم تريدون محمدا فقلنا ما نريده ما نريد إلا المدينة ‏.‏ فأخذوا منا عهد الله وميثاقه لننصرفن إلى المدينة ولا نقاتل معه فأتينا رسول الله صلى الله عليه وسلم فأخبرناه الخبر فقال ‏ \"‏ انصرفا نفي لهم بعهدهم ونستعين الله عليهم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 4640,
			"arabicnumber": "1788",
			"text": "حدثنا زهير بن حرب، وإسحاق بن إبراهيم، جميعا عن جرير، قال زهير حدثنا جرير، عن الأعمش، عن إبراهيم التيمي، عن أبيه، قال كنا عند حذيفة فقال رجل لو أدركت رسول الله صلى الله عليه وسلم قاتلت معه وأبليت فقال حذيفة أنت كنت تفعل ذلك لقد رأيتنا مع رسول الله صلى الله عليه وسلم ليلة الأحزاب وأخذتنا ريح شديدة وقر فقال رسول الله صلى الله عليه وسلم ‏\"‏ ألا رجل يأتيني بخبر القوم جعله الله معي يوم القيامة ‏\"‏ ‏.‏ فسكتنا فلم يجبه منا أحد ثم قال ‏\"‏ ألا رجل يأتينا بخبر القوم جعله الله معي يوم القيامة ‏\"‏ ‏.‏ فسكتنا فلم يجبه منا أحد ثم قال ‏\"‏ ألا رجل يأتينا بخبر القوم جعله الله معي يوم القيامة ‏\"‏ ‏.‏ فسكتنا فلم يجبه منا أحد فقال ‏\"‏ قم يا حذيفة فأتنا بخبر القوم ‏\"‏ ‏.‏ فلم أجد بدا إذ دعاني باسمي أن أقوم قال ‏\"‏ اذهب فأتني بخبر القوم ولا تذعرهم على ‏\"‏ ‏.‏ فلما وليت من عنده جعلت كأنما أمشي في حمام حتى أتيتهم فرأيت أبا سفيان يصلي ظهره بالنار فوضعت سهما في كبد القوس فأردت أن أرميه فذكرت قول رسول الله صلى الله عليه وسلم ‏\"‏ ولا تذعرهم على ‏\"‏ ‏.‏ ولو رميته لأصبته فرجعت وأنا أمشي في مثل الحمام فلما أتيته فأخبرته بخبر القوم وفرغت قررت فألبسني رسول الله صلى الله عليه وسلم من فضل عباءة كانت عليه يصلي فيها فلم أزل نائما حتى أصبحت فلما أصبحت قال ‏\"‏ قم يا نومان ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 4641,
			"arabicnumber": "1789",
			"text": "وحدثنا هداب بن خالد الأزدي، حدثنا حماد بن سلمة، عن علي بن زيد، وثابت، البناني عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم أفرد يوم أحد في سبعة من الأنصار ورجلين من قريش فلما رهقوه قال ‏\"‏ من يردهم عنا وله الجنة أو هو رفيقي في الجنة ‏\"‏ ‏.‏ فتقدم رجل من الأنصار فقاتل حتى قتل ثم رهقوه أيضا فقال ‏\"‏ من يردهم عنا وله الجنة أو هو رفيقي في الجنة ‏\"‏ ‏.‏ فتقدم رجل من الأنصار فقاتل حتى قتل فلم يزل كذلك حتى قتل السبعة فقال رسول الله صلى الله عليه وسلم لصاحبيه ‏\"‏ ما أنصفنا أصحابنا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 4642,
			"arabicnumber": "1790.01",
			"text": "حدثنا يحيى بن يحيى التميمي، حدثنا عبد العزيز بن أبي حازم، عن أبيه، أنه سمع سهل بن سعد، يسأل عن جرح، رسول الله صلى الله عليه وسلم يوم أحد فقال جرح وجه رسول الله صلى الله عليه وسلم وكسرت رباعيته وهشمت البيضة على رأسه فكانت فاطمة بنت رسول الله صلى الله عليه وسلم تغسل الدم وكان علي بن أبي طالب يسكب عليها بالمجن فلما رأت فاطمة أن الماء لا يزيد الدم إلا كثرة أخذت قطعة حصير فأحرقته حتى صار رمادا ثم ألصقته بالجرح فاستمسك الدم ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 4643,
			"arabicnumber": "1790.02",
			"text": "حدثنا قتيبة بن سعيد، حدثنا يعقوب، - يعني ابن عبد الرحمن القاري - عن أبي حازم، أنه سمع سهل بن سعد، وهو يسأل عن جرح، رسول الله صلى الله عليه وسلم فقال أم والله إني لأعرف من كان يغسل جرح رسول الله صلى الله عليه وسلم ومن كان يسكب الماء ‏.‏ وبماذا دووي جرحه ‏.‏ ثم ذكر نحو حديث عبد العزيز غير أنه زاد وجرح وجهه وقال مكان هشمت كسرت ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 4644,
			"arabicnumber": "1790.03",
			"text": "وحدثناه أبو بكر بن أبي شيبة، وزهير بن حرب، وإسحاق بن إبراهيم، وابن، أبي عمر جميعا عن ابن عيينة، ح وحدثنا عمرو بن سواد العامري، أخبرنا عبد الله بن، وهب أخبرني عمرو بن الحارث، عن سعيد بن أبي هلال، ح وحدثني محمد بن سهل التميمي، حدثني ابن أبي مريم، حدثنا محمد، - يعني ابن مطرف - كلهم عن أبي حازم، عن سهل، بن سعد ‏.‏ بهذا الحديث عن النبي صلى الله عليه وسلم ‏.‏ في حديث ابن أبي هلال أصيب وجهه ‏.‏ وفي حديث ابن مطرف جرح وجهه ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 4645,
			"arabicnumber": "1791",
			"text": "حدثنا عبد الله بن مسلمة بن قعنب، حدثنا حماد بن سلمة، عن ثابت، عن أنس، أن رسول الله صلى الله عليه وسلم كسرت رباعيته يوم أحد وشج في رأسه فجعل يسلت الدم عنه ويقول ‏\"‏ كيف يفلح قوم شجوا نبيهم وكسروا رباعيته وهو يدعوهم إلى الله ‏\"‏ ‏.‏ فأنزل الله عز وجل ‏{‏ ليس لك من الأمر شىء‏}‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 4646,
			"arabicnumber": "1792.01",
			"text": "حدثنا محمد بن عبد الله بن نمير، حدثنا وكيع، حدثنا الأعمش، عن شقيق، عن عبد الله، قال كأني أنظر إلى رسول الله صلى الله عليه وسلم يحكي نبيا من الأنبياء ضربه قومه وهو يمسح الدم عن وجهه ويقول ‏ \"‏ رب اغفر لقومي فإنهم لا يعلمون ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 4647,
			"arabicnumber": "1792.02",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، ومحمد بن بشر، عن الأعمش، بهذا الإسناد غير أنه قال فهو ينضح الدم عن جبينه ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 4648,
			"arabicnumber": "1793",
			"text": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ اشتد غضب الله على قوم فعلوا هذا برسول الله صلى الله عليه وسلم ‏\"‏ ‏.‏ وهو حينئذ يشير إلى رباعيته وقال رسول الله صلى الله عليه وسلم ‏\"‏ اشتد غضب الله على رجل يقتله رسول الله في سبيل الله عز وجل ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 4649,
			"arabicnumber": "1794.01",
			"text": "وحدثنا عبد الله بن عمر بن محمد بن أبان الجعفي، حدثنا عبد الرحيم، - يعني ابن سليمان - عن زكرياء، عن أبي إسحاق، عن عمرو بن ميمون الأودي، عن ابن مسعود، قال بينما رسول الله صلى الله عليه وسلم يصلي عند البيت وأبو جهل وأصحاب له جلوس وقد نحرت جزور بالأمس فقال أبو جهل أيكم يقوم إلى سلا جزور بني فلان فيأخذه فيضعه في كتفى محمد إذا سجد فانبعث أشقى القوم فأخذه فلما سجد النبي صلى الله عليه وسلم وضعه بين كتفيه قال فاستضحكوا وجعل بعضهم يميل على بعض وأنا قائم أنظر ‏.‏ لو كانت لي منعة طرحته عن ظهر رسول الله صلى الله عليه وسلم والنبي صلى الله عليه وسلم ساجد ما يرفع رأسه حتى انطلق إنسان فأخبر فاطمة فجاءت وهي جويرية فطرحته عنه ‏.‏ ثم أقبلت عليهم تشتمهم فلما قضى النبي صلى الله عليه وسلم صلاته رفع صوته ثم دعا عليهم وكان إذا دعا دعا ثلاثا ‏.‏ وإذا سأل سأل ثلاثا ثم قال ‏\"‏ اللهم عليك بقريش ‏\"‏ ‏.‏ ثلاث مرات فلما سمعوا صوته ذهب عنهم الضحك وخافوا دعوته ثم قال ‏\"‏ اللهم عليك بأبي جهل بن هشام وعتبة بن ربيعة وشيبة بن ربيعة والوليد بن عقبة وأمية بن خلف وعقبة بن أبي معيط ‏\"‏ ‏.‏ وذكر السابع ولم أحفظه فوالذي بعث محمدا صلى الله عليه وسلم بالحق لقد رأيت الذين سمى صرعى يوم بدر ثم سحبوا إلى القليب قليب بدر ‏.‏ قال أبو إسحاق الوليد بن عقبة غلط في هذا الحديث ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 4650,
			"arabicnumber": "1794.02",
			"text": "حدثنا محمد بن المثنى، ومحمد بن بشار، - واللفظ لابن المثنى - قالا حدثنا محمد بن جعفر، حدثنا شعبة، قال سمعت أبا إسحاق، يحدث عن عمرو بن ميمون، عن عبد الله، قال بينما رسول الله صلى الله عليه وسلم ساجد وحوله ناس من قريش إذ جاء عقبة بن أبي معيط بسلا جزور فقذفه على ظهر رسول الله صلى الله عليه وسلم فلم يرفع رأسه فجاءت فاطمة فأخذته عن ظهره ودعت على من صنع ذلك فقال ‏ \"‏ اللهم عليك الملأ من قريش أبا جهل بن هشام وعتبة بن ربيعة وعقبة بن أبي معيط وشيبة بن ربيعة وأمية بن خلف أو أبى بن خلف ‏\"‏ ‏.‏ شعبة الشاك قال فلقد رأيتهم قتلوا يوم بدر فألقوا في بئر غير أن أمية أو أبيا تقطعت أوصاله فلم يلق في البئر ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 4651,
			"arabicnumber": "1794.03",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا جعفر بن عون، أخبرنا سفيان، عن أبي، إسحاق بهذا الإسناد نحوه وزاد وكان يستحب ثلاثا يقول ‏ \"‏ اللهم عليك بقريش اللهم عليك بقريش اللهم عليك بقريش ‏\"‏ ‏.‏ ثلاثا وذكر فيهم الوليد بن عتبة وأمية بن خلف ولم يشك ‏.‏ قال أبو إسحاق ونسيت السابع ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 4652,
			"arabicnumber": "1794.04",
			"text": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا زهير، حدثنا أبو إسحاق، عن عمرو بن ميمون، عن عبد الله، قال استقبل رسول الله صلى الله عليه وسلم البيت فدعا على ستة نفر من قريش ‏.‏ فيهم أبو جهل وأمية بن خلف وعتبة بن ربيعة وشيبة بن ربيعة وعقبة بن أبي معيط فأقسم بالله لقد رأيتهم صرعى على بدر ‏.‏ قد غيرتهم الشمس وكان يوما حارا ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 4653,
			"arabicnumber": "1795",
			"text": "وحدثني أبو الطاهر، أحمد بن عمرو بن سرح وحرملة بن يحيى وعمرو بن سواد العامري - وألفاظهم متقاربة - قالوا حدثنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، حدثني عروة بن الزبير، أن عائشة، زوج النبي صلى الله عليه وسلم حدثته أنها قالت لرسول الله صلى الله عليه وسلم يا رسول الله هل أتى عليك يوم كان أشد من يوم أحد فقال ‏\"‏ لقد لقيت من قومك وكان أشد ما لقيت منهم يوم العقبة إذ عرضت نفسي على ابن عبد ياليل بن عبد كلال فلم يجبني إلى ما أردت فانطلقت وأنا مهموم على وجهي فلم أستفق إلا بقرن الثعالب فرفعت رأسي فإذا أنا بسحابة قد أظلتني فنظرت فإذا فيها جبريل فناداني فقال إن الله عز وجل قد سمع قول قومك لك وما ردوا عليك وقد بعث إليك ملك الجبال لتأمره بما شئت فيهم قال فناداني ملك الجبال وسلم على ‏.‏ ثم قال يا محمد إن الله قد سمع قول قومك لك وأنا ملك الجبال وقد بعثني ربك إليك لتأمرني بأمرك فما شئت إن شئت أن أطبق عليهم الأخشبين ‏\"‏ ‏.‏ فقال له رسول الله صلى الله عليه وسلم ‏\"‏ بل أرجو أن يخرج الله من أصلابهم من يعبد الله وحده لا يشرك به شيئا ‏\"‏ ‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 4654,
			"arabicnumber": "1796.01",
			"text": "حدثنا يحيى بن يحيى، وقتيبة بن سعيد، كلاهما عن أبي عوانة، قال يحيى أخبرنا أبو عوانة، عن الأسود بن قيس، عن جندب بن سفيان، قال دميت إصبع رسول الله صلى الله عليه وسلم في بعض تلك المشاهد فقال ‏ \"‏ هل أنت إلا إصبع دميت وفي سبيل الله ما لقيت ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 4655,
			"arabicnumber": "1796.02",
			"text": "وحدثناه أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، جميعا عن ابن عيينة، عن الأسود بن قيس، بهذا الإسناد وقال كان رسول الله صلى الله عليه وسلم في غار فنكبت إصبعه ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 4656,
			"arabicnumber": "1797.01",
			"text": "حدثنا إسحاق بن إبراهيم، أخبرنا سفيان، عن الأسود بن قيس، أنه سمع جندبا، يقول أبطأ جبريل على رسول الله صلى الله عليه وسلم فقال المشركون قد ودع محمد فأنزل الله عز وجل ‏{‏ والضحى * والليل إذا سجى * ما ودعك ربك وما قلى‏}‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 4657,
			"arabicnumber": "1797.02",
			"text": "حدثنا إسحاق بن إبراهيم، ومحمد بن رافع، - واللفظ لابن رافع - قال إسحاق أخبرنا وقال ابن رافع، حدثنا يحيى بن آدم، حدثنا زهير، عن الأسود بن قيس، قال سمعت جندب بن سفيان، يقول اشتكى رسول الله صلى الله عليه وسلم فلم يقم ليلتين أو ثلاثا فجاءته امرأة فقالت يا محمد إني لأرجو أن يكون شيطانك قد تركك لم أره قربك منذ ليلتين أو ثلاث قال فأنزل الله عز وجل ‏{‏ والضحى * والليل إذا سجى * ما ودعك ربك وما قلى‏}‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 4658,
			"arabicnumber": "1797.03",
			"text": "وحدثنا أبو بكر بن أبي شيبة، ومحمد بن المثنى، وابن، بشار قالوا حدثنا محمد، بن جعفر عن شعبة، ح وحدثنا إسحاق بن إبراهيم، أخبرنا الملائي، حدثنا سفيان، كلاهما عن الأسود بن قيس، بهذا الإسناد نحو حديثهما ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 4659,
			"arabicnumber": "1798.01",
			"text": "حدثنا إسحاق بن إبراهيم الحنظلي، ومحمد بن رافع، وعبد بن حميد، - واللفظ لابن رافع - قال ابن رافع حدثنا وقال الآخران، أخبرنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن عروة، أن أسامة بن زيد، أخبره أن النبي صلى الله عليه وسلم ركب حمارا عليه إكاف تحته قطيفة فدكية وأردف وراءه أسامة وهو يعود سعد بن عبادة في بني الحارث بن الخزرج وذاك قبل وقعة بدر حتى مر بمجلس فيه أخلاط من المسلمين والمشركين عبدة الأوثان واليهود فيهم عبد الله بن أبى وفي المجلس عبد الله بن رواحة فلما غشيت المجلس عجاجة الدابة خمر عبد الله بن أبى أنفه بردائه ثم قال لا تغبروا علينا ‏.‏ فسلم عليهم النبي صلى الله عليه وسلم ثم وقف فنزل فدعاهم إلى الله وقرأ عليهم القرآن فقال عبد الله بن أبى أيها المرء لا أحسن من هذا إن كان ما تقول حقا فلا تؤذنا في مجالسنا وارجع إلى رحلك فمن جاءك منا فاقصص عليه ‏.‏ فقال عبد الله بن رواحة اغشنا في مجالسنا فإنا نحب ذلك ‏.‏ قال فاستب المسلمون والمشركون واليهود حتى هموا أن يتواثبوا فلم يزل النبي صلى الله عليه وسلم يخفضهم ثم ركب دابته حتى دخل على سعد بن عبادة فقال ‏ \"‏ أى سعد ألم تسمع إلى ما قال أبو حباب - يريد عبد الله بن أبى - قال كذا وكذا ‏\"‏ ‏.‏ قال اعف عنه يا رسول الله واصفح فوالله لقد أعطاك الله الذي أعطاك ولقد اصطلح أهل هذه البحيرة أن يتوجوه فيعصبوه بالعصابة فلما رد الله ذلك بالحق الذي أعطاكه شرق بذلك فذلك فعل به ما رأيت ‏.‏ فعفا عنه النبي صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 4660,
			"arabicnumber": "1798.02",
			"text": "حدثني محمد بن رافع، حدثنا حجين، - يعني ابن المثنى - حدثنا ليث، عن عقيل، عن ابن شهاب، في هذا الإسناد بمثله وزاد وذلك قبل أن يسلم عبد الله ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 4661,
			"arabicnumber": "1799",
			"text": "حدثنا محمد بن عبد الأعلى القيسي، حدثنا المعتمر، عن أبيه، عن أنس بن مالك، قال قيل للنبي صلى الله عليه وسلم لو أتيت عبد الله بن أبى قال فانطلق إليه وركب حمارا وانطلق المسلمون وهي أرض سبخة فلما أتاه النبي صلى الله عليه وسلم قال إليك عني فوالله لقد آذاني نتن حمارك ‏.‏ قال فقال رجل من الأنصار والله لحمار رسول الله صلى الله عليه وسلم أطيب ريحا منك - قال - فغضب لعبد الله رجل من قومه - قال - فغضب لكل واحد منهما أصحابه - قال - فكان بينهم ضرب بالجريد وبالأيدي وبالنعال - قال - فبلغنا أنها نزلت فيهم ‏{‏ وإن طائفتان من المؤمنين اقتتلوا فأصلحوا بينهما‏}‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 4662,
			"arabicnumber": "1800.01",
			"text": "حدثنا علي بن حجر السعدي، أخبرنا إسماعيل، - يعني ابن علية - حدثنا سليمان، التيمي حدثنا أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من ينظر لنا ما صنع أبو جهل ‏\"‏ ‏.‏ فانطلق ابن مسعود فوجده قد ضربه ابنا عفراء حتى برك - قال - فأخذ بلحيته فقال آنت أبو جهل فقال وهل فوق رجل قتلتموه - أو قال - قتله قومه قال وقال أبو مجلز قال أبو جهل فلو غير أكار قتلني ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 4663,
			"arabicnumber": "1800.02",
			"text": "حدثنا حامد بن عمر البكراوي، حدثنا معتمر، قال سمعت أبي يقول، حدثنا أنس، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من يعلم لي ما فعل أبو جهل ‏\"‏ ‏.‏ بمثل حديث ابن علية وقول أبي مجلز كما ذكره إسماعيل ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 4664,
			"arabicnumber": "1801",
			"text": "حدثنا إسحاق بن إبراهيم الحنظلي، وعبد الله بن محمد بن عبد الرحمن بن المسور، الزهري كلاهما عن ابن عيينة، - واللفظ للزهري - حدثنا سفيان، عن عمرو، سمعت جابرا، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من لكعب بن الأشرف فإنه قد آذى الله ورسوله ‏\"‏ ‏.‏ فقال محمد بن مسلمة يا رسول الله أتحب أن أقتله قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال ائذن لي فلأقل قال ‏\"‏ قل ‏\"‏ ‏.‏ فأتاه فقال له وذكر ما بينهما وقال إن هذا الرجل قد أراد صدقة وقد عنانا ‏.‏ فلما سمعه قال وأيضا والله لتملنه ‏.‏ قال إنا قد اتبعناه الآن ونكره أن ندعه حتى ننظر إلى أى شىء يصير أمره - قال - وقد أردت أن تسلفني سلفا قال فما ترهنني قال ما تريد ‏.‏ قال ترهنني نساءكم قال أنت أجمل العرب أنرهنك نساءنا قال له ترهنوني أولادكم ‏.‏ قال يسب ابن أحدنا فيقال رهن في وسقين من تمر ‏.‏ ولكن نرهنك اللأمة - يعني السلاح - قال فنعم ‏.‏ وواعده أن يأتيه بالحارث وأبي عبس بن جبر وعباد بن بشر قال فجاءوا فدعوه ليلا فنزل إليهم قال سفيان قال غير عمرو قالت له امرأته إني لأسمع صوتا كأنه صوت دم قال إنما هذا محمد بن مسلمة ورضيعه وأبو نائلة إن الكريم لو دعي إلى طعنة ليلا لأجاب ‏.‏ قال محمد إني إذا جاء فسوف أمد يدي إلى رأسه فإذا استمكنت منه فدونكم قال فلما نزل نزل وهو متوشح فقالوا نجد منك ريح الطيب قال نعم تحتي فلانة هي أعطر نساء العرب ‏.‏ قال فتأذن لي أن أشم منه قال نعم فشم ‏.‏ فتناول فشم ثم قال أتأذن لي أن أعود قال فاستمكن من رأسه ثم قال دونكم ‏.‏ قال فقتلوه ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 4665,
			"arabicnumber": "1365.07",
			"text": "وحدثني زهير بن حرب، حدثنا إسماعيل، - يعني ابن علية - عن عبد العزيز، بن صهيب عن أنس، أن رسول الله صلى الله عليه وسلم غزا خيبر قال فصلينا عندها صلاة الغداة بغلس فركب نبي الله صلى الله عليه وسلم وركب أبو طلحة وأنا رديف أبي طلحة فأجرى نبي الله صلى الله عليه وسلم في زقاق خيبر وإن ركبتي لتمس فخذ نبي الله صلى الله عليه وسلم وانحسر الإزار عن فخذ نبي الله صلى الله عليه وسلم وإني لأرى بياض فخذ نبي الله صلى الله عليه وسلم فلما دخل القرية قال ‏ \"‏ الله أكبر خربت خيبر إنا إذا نزلنا بساحة قوم فساء صباح المنذرين ‏\"‏ ‏.‏ قالها ثلاث مرار قال وقد خرج القوم إلى أعمالهم فقالوا محمد - قال عبد العزيز وقال بعض أصحابنا - والخميس قال وأصبناها عنوة ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 4666,
			"arabicnumber": "1365.08",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا عفان، حدثنا حماد بن سلمة، حدثنا ثابت، عن أنس، قال كنت ردف أبي طلحة يوم خيبر وقدمي تمس قدم رسول الله صلى الله عليه وسلم قال فأتيناهم حين بزغت الشمس وقد أخرجوا مواشيهم وخرجوا بفئوسهم ومكاتلهم ومرورهم فقالوا محمد والخميس ‏.‏ قال رسول الله صلى الله عليه وسلم ‏ \"‏ خربت خيبر إنا إذا نزلنا بساحة قوم فساء صباح المنذرين ‏\"‏ ‏.‏ قال فهزمهم الله عز وجل ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 4667,
			"arabicnumber": "1365.09",
			"text": "حدثنا إسحاق بن إبراهيم، وإسحاق بن منصور، قالا أخبرنا النضر بن شميل، أخبرنا شعبة، عن قتادة، عن أنس بن مالك، قال لما أتى رسول الله صلى الله عليه وسلم خيبر قال ‏ \"‏ إنا إذا نزلنا بساحة قوم فساء صباح المنذرين ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 4668,
			"arabicnumber": "1802.01",
			"text": "حدثنا قتيبة بن سعيد، ومحمد بن عباد، - واللفظ لابن عباد - قالا حدثنا حاتم، - وهو ابن إسماعيل - عن يزيد بن أبي عبيد، مولى سلمة بن الأكوع عن سلمة بن الأكوع، قال خرجنا مع رسول الله صلى الله عليه وسلم إلى خيبر فتسيرنا ليلا فقال رجل من القوم لعامر بن الأكوع ألا تسمعنا من هنيهاتك وكان عامر رجلا شاعرا فنزل يحدو بالقوم يقول اللهم لولا أنت ما اهتدينا ولا تصدقنا ولا صلينا فاغفر فداء لك ما اقتفينا وثبت الأقدام إن لاقينا وألقين سكينة علينا إنا إذا صيح بنا أتينا وبالصياح عولوا علينا فقال رسول الله صلى الله عليه وسلم ‏\"‏ من هذا السائق ‏\"‏ ‏.‏ قالوا عامر ‏.‏ قال ‏\"‏ يرحمه الله ‏\"‏ ‏.‏ فقال رجل من القوم وجبت يا رسول الله لولا أمتعتنا به ‏.‏ قال فأتينا خيبر فحصرناهم حتى أصابتنا مخمصة شديدة ثم قال ‏\"‏ إن الله فتحها عليكم ‏\"‏ ‏.‏ قال فلما أمسى الناس مساء اليوم الذي فتحت عليهم أوقدوا نيرانا كثيرة فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما هذه النيران على أى شىء توقدون ‏\"‏ ‏.‏ فقالوا على لحم ‏.‏ قال ‏\"‏ أى لحم ‏\"‏ ‏.‏ قالوا لحم حمر الإنسية ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أهريقوها واكسروها ‏\"‏ ‏.‏ فقال رجل أو يهريقوها ويغسلوها فقال ‏\"‏ أو ذاك ‏\"‏ ‏.‏ قال فلما تصاف القوم كان سيف عامر فيه قصر فتناول به ساق يهودي ليضربه ويرجع ذباب سيفه فأصاب ركبة عامر فمات منه قال فلما قفلوا قال سلمة وهو آخذ بيدي قال فلما رآني رسول الله صلى الله عليه وسلم ساكتا قال ‏\"‏ ما لك ‏\"‏ ‏.‏ قلت له فداك أبي وأمي زعموا أن عامرا حبط عمله قال ‏\"‏ من قاله ‏\"‏ ‏.‏ قلت فلان وفلان وأسيد بن حضير الأنصاري فقال ‏\"‏ كذب من قاله إن له لأجرين ‏\"‏ ‏.‏ وجمع بين إصبعيه ‏\"‏ إنه لجاهد مجاهد قل عربي مشى بها مثله ‏\"‏ ‏.‏ وخالف قتيبة محمدا في الحديث في حرفين وفي رواية ابن عباد وألق سكينة علينا ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 4669,
			"arabicnumber": "1802.02",
			"text": "وحدثني أبو الطاهر، أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، أخبرني عبد الرحمن، - ونسبه غير ابن وهب فقال ابن عبد الله بن كعب بن مالك - أن سلمة، بن الأكوع قال لما كان يوم خيبر قاتل أخي قتالا شديدا مع رسول الله صلى الله عليه وسلم فارتد عليه سيفه فقتله فقال أصحاب رسول الله صلى الله عليه وسلم في ذلك وشكوا فيه رجل مات في سلاحه ‏.‏ وشكوا في بعض أمره ‏.‏ قال سلمة فقفل رسول الله صلى الله عليه وسلم من خيبر فقلت يا رسول الله ائذن لي أن أرجز لك ‏.‏ فأذن له رسول الله صلى الله عليه وسلم فقال عمر بن الخطاب أعلم ما تقول قال فقلت والله لولا الله ما اهتدينا ولا تصدقنا ولا صلينا فقال رسول الله صلى الله عليه وسلم ‏\"‏ صدقت ‏\"‏ ‏.‏ وأنزلن سكينة علينا وثبت الأقدام إن لاقينا والمشركون قد بغوا علينا قال فلما قضيت رجزي قال رسول الله صلى الله عليه وسلم ‏\"‏ من قال هذا ‏\"‏ ‏.‏ قلت قاله أخي فقال رسول الله صلى الله عليه وسلم ‏\"‏ يرحمه الله ‏\"‏ ‏.‏ قال فقلت يا رسول الله إن ناسا ليهابون الصلاة عليه يقولون رجل مات بسلاحه ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ مات جاهدا مجاهدا ‏\"‏ ‏.‏ قال ابن شهاب ثم سألت ابنا لسلمة بن الأكوع فحدثني عن أبيه مثل ذلك غير أنه قال - حين قلت إن ناسا يهابون الصلاة عليه - فقال رسول الله صلى الله عليه وسلم ‏\"‏ كذبوا مات جاهدا مجاهدا فله أجره مرتين ‏\"‏ ‏.‏ وأشار بإصبعيه ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 4670,
			"arabicnumber": "1803.01",
			"text": "حدثنا محمد بن المثنى، وابن، بشار - واللفظ لابن المثنى - قالا حدثنا محمد، بن جعفر حدثنا شعبة، عن أبي إسحاق، قال سمعت البراء، قال كان رسول الله صلى الله عليه وسلم يوم الأحزاب ينقل معنا التراب ولقد وارى التراب بياض بطنه وهو يقول ‏\"‏ والله لولا أنت ما اهتدينا ولا تصدقنا ولا صلينا فأنزلن سكينة علينا إن الألى قد أبوا علينا ‏\"‏ ‏.‏ قال وربما قال ‏\"‏ إن الملا قد أبوا علينا إذا أرادوا فتنة أبينا ‏\"‏ ‏.‏ ويرفع بها صوته ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 4671,
			"arabicnumber": "1803.02",
			"text": "حدثنا محمد بن المثنى، حدثنا عبد الرحمن بن مهدي، حدثنا شعبة، عن أبي إسحاق، قال سمعت البراء، ‏.‏ فذكر مثله إلا أنه قال ‏ \"‏ إن الألى قد بغوا علينا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 4672,
			"arabicnumber": "1804",
			"text": "حدثنا عبد الله بن مسلمة القعنبي، حدثنا عبد العزيز بن أبي حازم، عن أبيه، عن سهل بن سعد، قال جاءنا رسول الله صلى الله عليه وسلم ونحن نحفر الخندق وننقل التراب على أكتافنا فقال رسول الله صلى الله عليه وسلم ‏ \"‏ اللهم لا عيش إلا عيش الآخرة فاغفر للمهاجرين والأنصار ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 4673,
			"arabicnumber": "1805.01",
			"text": "وحدثنا محمد بن المثنى، وابن، بشار - واللفظ لابن المثنى - حدثنا محمد بن، جعفر حدثنا شعبة، عن معاوية بن قرة، عن أنس بن مالك، عن النبي صلى الله عليه وسلم أنه قال ‏ \"‏ اللهم لا عيش إلا عيش الآخره فاغفر للأنصار والمهاجره ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 4674,
			"arabicnumber": "1805.02",
			"text": "حدثنا محمد بن المثنى، وابن، بشار قال ابن المثنى حدثنا محمد بن جعفر، أخبرنا شعبة، عن قتادة، حدثنا أنس بن مالك، أن رسول الله صلى الله عليه وسلم كان يقول ‏\"‏ اللهم إن العيش عيش الآخرة ‏\"‏ ‏.‏ قال شعبة أو قال ‏\"‏ اللهم لا عيش إلا‎عيش الآخره فأكرم الأنصار والمهاجره ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 4675,
			"arabicnumber": "1805.03",
			"text": "وحدثنا يحيى بن يحيى، وشيبان بن فروخ، قال يحيى أخبرنا وقال، شيبان حدثنا عبد الوارث، عن أبي التياح، حدثنا أنس بن مالك، قال كانوا يرتجزون ورسول الله صلى الله عليه وسلم معهم وهم يقولون اللهم لا خير إلا خير الآخره فانصر الأنصار والمهاجره وفي حديث شيبان بدل فانصر فاغفر ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 4676,
			"arabicnumber": "1805.04",
			"text": "حدثني محمد بن حاتم، حدثنا بهز، حدثنا حماد بن سلمة، حدثنا ثابت، عن أنس، أن أصحاب، محمد صلى الله عليه وسلم كانوا يقولون يوم الخندق نحن الذين بايعوا محمدا على الإسلام ما بقينا أبدا أو قال على الجهاد ‏.‏ شك حماد والنبي صلى الله عليه وسلم يقول ‏ \"‏ اللهم إن الخير خير الآخره فاغفر للأنصار والمهاجره ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 4677,
			"arabicnumber": "1806",
			"text": "حدثنا قتيبة بن سعيد، حدثنا حاتم، - يعني ابن إسماعيل - عن يزيد بن أبي، عبيد قال سمعت سلمة بن الأكوع، يقول خرجت قبل أن يؤذن، بالأولى وكانت لقاح رسول الله صلى الله عليه وسلم ترعى بذي قرد - قال - فلقيني غلام لعبد الرحمن بن عوف فقال أخذت لقاح رسول الله صلى الله عليه وسلم فقلت من أخذها قال غطفان قال فصرخت ثلاث صرخات يا صباحاه ‏.‏ قال فأسمعت ما بين لابتى المدينة ثم اندفعت على وجهي حتى أدركتهم بذي قرد وقد أخذوا يسقون من الماء فجعلت أرميهم بنبلي وكنت راميا وأقول أنا ابن الأكوع واليوم يوم الرضع فأرتجز حتى استنقذت اللقاح منهم واستلبت منهم ثلاثين بردة - قال - وجاء النبي صلى الله عليه وسلم والناس فقلت يا نبي الله إني قد حميت القوم الماء وهم عطاش فابعث إليهم الساعة فقال ‏ \"‏ يا ابن الأكوع ملكت فأسجح ‏\"‏ ‏.‏ - قال - ثم رجعنا ويردفني رسول الله صلى الله عليه وسلم على ناقته حتى دخلنا المدينة ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 4678,
			"arabicnumber": "1807.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا هاشم بن القاسم، ح وحدثنا إسحاق بن، إبراهيم أخبرنا أبو عامر العقدي، كلاهما عن عكرمة بن عمار، ح وحدثنا عبد الله بن، عبد الرحمن الدارمي - وهذا حديثه - أخبرنا أبو علي الحنفي، عبيد الله بن عبد المجيد حدثنا عكرمة، - وهو ابن عمار - حدثني إياس بن سلمة، حدثني أبي قال، قدمنا الحديبية مع رسول الله صلى الله عليه وسلم ونحن أربع عشرة مائة وعليها خمسون شاة لا ترويها - قال - فقعد رسول الله صلى الله عليه وسلم على جبا الركية فإما دعا وإما بسق فيها - قال - فجاشت فسقينا واستقينا ‏.‏ قال ثم إن رسول الله صلى الله عليه وسلم دعانا للبيعة في أصل الشجرة ‏.‏ قال فبايعته أول الناس ثم بايع وبايع حتى إذا كان في وسط من الناس قال ‏\"‏ بايع يا سلمة ‏\"‏ ‏.‏ قال قلت قد بايعتك يا رسول الله في أول الناس قال ‏\"‏ وأيضا ‏\"‏ ‏.‏ قال ورآني رسول الله صلى الله عليه وسلم عزلا - يعني ليس معه سلاح - قال فأعطاني رسول الله صلى الله عليه وسلم حجفة أو درقة ثم بايع حتى إذا كان في آخر الناس قال ‏\"‏ ألا تبايعني يا سلمة ‏\"‏ ‏.‏ قال قلت قد بايعتك يا رسول الله في أول الناس وفي أوسط الناس قال ‏\"‏ وأيضا ‏\"‏ ‏.‏ قال فبايعته الثالثة ثم قال لي ‏\"‏ يا سلمة أين حجفتك أو درقتك التي أعطيتك ‏\"‏ ‏.‏ قال قلت يا رسول الله لقيني عمي عامر عزلا فأعطيته إياها - قال - فضحك رسول الله صلى الله عليه وسلم وقال ‏\"‏ إنك كالذي قال الأول اللهم أبغني حبيبا هو أحب إلى من نفسي ‏\"‏ ‏.‏ ثم إن المشركين راسلونا الصلح حتى مشى بعضنا في بعض واصطلحنا ‏.‏ قال وكنت تبيعا لطلحة بن عبيد الله أسقي فرسه وأحسه وأخدمه وآكل من طعامه وتركت أهلي ومالي مهاجرا إلى الله ورسوله صلى الله عليه وسلم قال فلما اصطلحنا نحن وأهل مكة واختلط بعضنا ببعض أتيت شجرة فكسحت شوكها فاضطجعت في أصلها - قال - فأتاني أربعة من المشركين من أهل مكة فجعلوا يقعون في رسول الله صلى الله عليه وسلم فأبغضتهم فتحولت إلى شجرة أخرى وعلقوا سلاحهم واضطجعوا فبينما هم كذلك إذ نادى مناد من أسفل الوادي يا للمهاجرين قتل ابن زنيم ‏.‏ قال فاخترطت سيفي ثم شددت على أولئك الأربعة وهم رقود فأخذت سلاحهم ‏.‏ فجعلته ضغثا في يدي قال ثم قلت والذي كرم وجه محمد لا يرفع أحد منكم رأسه إلا ضربت الذي فيه عيناه ‏.‏ قال ثم جئت بهم أسوقهم إلى رسول الله صلى الله عليه وسلم - قال - وجاء عمي عامر برجل من العبلات يقال له مكرز ‏.‏ يقوده إلى رسول الله صلى الله عليه وسلم على فرس مجفف في سبعين من المشركين فنظر إليهم رسول الله صلى الله عليه وسلم فقال ‏\"‏ دعوهم يكن لهم بدء الفجور وثناه ‏\"‏ فعفا عنهم رسول الله صلى الله عليه وسلم وأنزل الله ‏{‏ وهو الذي كف أيديهم عنكم وأيديكم عنهم ببطن مكة من بعد أن أظفركم عليهم‏}‏ الآية كلها ‏.‏ قال ثم خرجنا راجعين إلى المدينة فنزلنا منزلا بيننا وبين بني لحيان جبل وهم المشركون فاستغفر رسول الله صلى الله عليه وسلم لمن رقي هذا الجبل الليلة كأنه طليعة للنبي صلى الله عليه وسلم وأصحابه - قال سلمة - فرقيت تلك الليلة مرتين أو ثلاثا ثم قدمنا المدينة فبعث رسول الله صلى الله عليه وسلم بظهره مع رباح غلام رسول الله صلى الله عليه وسلم وأنا معه وخرجت معه بفرس طلحة أنديه مع الظهر فلما أصبحنا إذا عبد الرحمن الفزاري قد أغار على ظهر رسول الله صلى الله عليه وسلم فاستاقه أجمع وقتل راعيه قال فقلت يا رباح خذ هذا الفرس فأبلغه طلحة بن عبيد الله وأخبر رسول الله صلى الله عليه وسلم أن المشركين قد أغاروا على سرحه - قال - ثم قمت على أكمة فاستقبلت المدينة فناديت ثلاثا يا صباحاه ‏.‏ ثم خرجت في آثار القوم أرميهم بالنبل وأرتجز أقول أنا ابن الأكوع واليوم يوم الرضع فألحق رجلا منهم فأصك سهما في رحله حتى خلص نصل السهم إلى كتفه - قال - قلت خذها وأنا ابن الأكوع واليوم يوم الرضع قال فوالله ما زلت أرميهم وأعقر بهم فإذا رجع إلى فارس أتيت شجرة فجلست في أصلها ثم رميته فعقرت به حتى إذا تضايق الجبل فدخلوا في تضايقه علوت الجبل فجعلت أرديهم بالحجارة - قال - فما زلت كذلك أتبعهم حتى ما خلق الله من بعير من ظهر رسول الله صلى الله عليه وسلم إلا خلفته وراء ظهري وخلوا بيني وبينه ثم اتبعتهم أرميهم حتى ألقوا أكثر من ثلاثين بردة وثلاثين رمحا يستخفون ولا يطرحون شيئا إلا جعلت عليه آراما من الحجارة يعرفها رسول الله صلى الله عليه وسلم وأصحابه حتى أتوا متضايقا من ثنية فإذا هم قد أتاهم فلان بن بدر الفزاري فجلسوا يتضحون - يعني يتغدون - وجلست على رأس قرن قال الفزاري ما هذا الذي أرى قالوا لقينا من هذا البرح والله ما فارقنا منذ غلس يرمينا حتى انتزع كل شىء في أيدينا ‏.‏ قال فليقم إليه نفر منكم أربعة ‏.‏ قال فصعد إلى منهم أربعة في الجبل - قال - فلما أمكنوني من الكلام - قال - قلت هل تعرفوني قالوا لا ومن أنت قال قلت أنا سلمة بن الأكوع والذي كرم وجه محمد صلى الله عليه وسلم لا أطلب رجلا منكم إلا أدركته ولا يطلبني رجل منكم ‏.‏ فيدركني قال أحدهم أنا أظن ‏.‏ قال فرجعوا فما برحت مكاني حتى رأيت فوارس رسول الله صلى الله عليه وسلم يتخللون الشجر - قال - فإذا أولهم الأخرم الأسدي على إثره أبو قتادة الأنصاري وعلى إثره المقداد بن الأسود الكندي - قال - فأخذت بعنان الأخرم - قال - فولوا مدبرين قلت يا أخرم احذرهم لا يقتطعوك حتى يلحق رسول الله صلى الله عليه وسلم وأصحابه ‏.‏ قال يا سلمة إن كنت تؤمن بالله واليوم الآخر وتعلم أن الجنة حق والنار حق فلا تحل بيني وبين الشهادة ‏.‏ قال فخليته فالتقى هو وعبد الرحمن - قال - فعقر بعبد الرحمن فرسه وطعنه عبد الرحمن فقتله وتحول على فرسه ولحق أبو قتادة فارس رسول الله صلى الله عليه وسلم بعبد الرحمن فطعنه فقتله فوالذي كرم وجه محمد صلى الله عليه وسلم لتبعتهم أعدو على رجلى حتى ما أرى ورائي من أصحاب محمد صلى الله عليه وسلم ولا غبارهم شيئا حتى يعدلوا قبل غروب الشمس إلى شعب فيه ماء يقال له ذو قرد ليشربوا منه وهم عطاش - قال - فنظروا إلى أعدو وراءهم فحليتهم عنه - يعني أجليتهم عنه - فما ذاقوا منه قطرة - قال - ويخرجون فيشتدون في ثنية - قال - فأعدو فألحق رجلا منهم فأصكه بسهم في نغض كتفه ‏.‏ قال قلت خذها وأنا ابن الأكوع واليوم يوم الرضع قال يا ثكلته أمه أكوعه بكرة قال قلت نعم يا عدو نفسه أكوعك بكرة - قال - وأردوا فرسين على ثنية قال فجئت بهما أسوقهما إلى رسول الله صلى الله عليه وسلم - قال - ولحقني عامر بسطيحة فيها مذقة من لبن وسطيحة فيها ماء فتوضأت وشربت ثم أتيت رسول الله صلى الله عليه وسلم وهو على الماء الذي حليتهم عنه فإذا رسول الله صلى الله عليه وسلم قد أخذ تلك الإبل وكل شىء استنقذته من المشركين وكل رمح وبردة وإذا بلال نحر ناقة من الإبل الذي استنقذت من القوم وإذا هو يشوي لرسول الله صلى الله عليه وسلم من كبدها وسنامها - قال - قلت يا رسول الله خلني فأنتخب من القوم مائة رجل فأتبع القوم فلا يبقى منهم مخبر إلا قتلته - قال - فضحك رسول الله صلى الله عليه وسلم حتى بدت نواجذه في ضوء النار فقال ‏\"‏ يا سلمة أتراك كنت فاعلا ‏\"‏ ‏.‏ قلت نعم والذي أكرمك ‏.‏ فقال ‏\"‏ إنهم الآن ليقرون في أرض غطفان ‏\"‏ ‏.‏ قال فجاء رجل من غطفان فقال نحر لهم فلان جزورا فلما كشفوا جلدها رأوا غبارا فقالوا أتاكم القوم فخرجوا هاربين ‏.‏ فلما أصبحنا قال رسول الله صلى الله عليه وسلم ‏\"‏ كان خير فرساننا اليوم أبو قتادة وخير رجالتنا سلمة ‏\"‏ ‏.‏ قال ثم أعطاني رسول الله صلى الله عليه وسلم سهمين سهم الفارس وسهم الراجل فجمعهما لي جميعا ثم أردفني رسول الله صلى الله عليه وسلم وراءه على العضباء راجعين إلى المدينة - قال - فبينما نحن نسير قال وكان رجل من الأنصار لا يسبق شدا - قال - فجعل يقول ألا مسابق إلى المدينة هل من مسابق فجعل يعيد ذلك - قال - فلما سمعت كلامه قلت أما تكرم كريما ولا تهاب شريفا قال لا إلا أن يكون رسول الله صلى الله عليه وسلم قال قلت يا رسول الله بأبي وأمي ذرني فلأسابق الرجل قال ‏\"‏ إن شئت ‏\"‏ ‏.‏ قال قلت اذهب إليك وثنيت رجلى فطفرت فعدوت - قال - فربطت عليه شرفا أو شرفين أستبقي نفسي ثم عدوت في إثره فربطت عليه شرفا أو شرفين ثم إني رفعت حتى ألحقه - قال - فأصكه بين كتفيه - قال - قلت قد سبقت والله قال أنا أظن ‏.‏ قال فسبقته إلى المدينة قال فوالله ما لبثنا إلا ثلاث ليال حتى خرجنا إلى خيبر مع رسول الله صلى الله عليه وسلم قال فجعل عمي عامر يرتجز بالقوم تالله لولا الله ما اهتدينا ولا تصدقنا ولا صلينا ونحن عن فضلك ما استغنينا فثبت الأقدام إن لاقينا وأنزلن سكينة علينا فقال رسول الله صلى الله عليه وسلم ‏\"‏ من هذا ‏\"‏ ‏.‏ قال أنا عامر ‏.‏ قال ‏\"‏ غفر لك ربك ‏\"‏ ‏.‏ قال وما استغفر رسول الله صلى الله عليه وسلم لإنسان يخصه إلا استشهد ‏.‏ قال فنادى عمر بن الخطاب وهو على جمل له يا نبي الله لولا ما متعتنا بعامر ‏.‏ قال فلما قدمنا خيبر قال خرج ملكهم مرحب يخطر بسيفه ويقول قد علمت خيبر أني مرحب شاكي السلاح بطل مجرب إذا الحروب أقبلت تلهب قال وبرز له عمي عامر فقال قد علمت خيبر أني عامر شاكي السلاح بطل مغامر قال فاختلفا ضربتين فوقع سيف مرحب في ترس عامر وذهب عامر يسفل له فرجع سيفه على نفسه فقطع أكحله فكانت فيها نفسه ‏.‏ قال سلمة فخرجت فإذا نفر من أصحاب النبي صلى الله عليه وسلم يقولون بطل عمل عامر قتل نفسه قال فأتيت النبي صلى الله عليه وسلم وأنا أبكي فقلت يا رسول الله بطل عمل عامر قال رسول الله صلى الله عليه وسلم ‏\"‏ من قال ذلك ‏\"‏ ‏.‏ قال قلت ناس من أصحابك ‏.‏ قال ‏\"‏ كذب من قال ذلك بل له أجره مرتين ‏\"‏ ‏.‏ ثم أرسلني إلى علي وهو أرمد فقال ‏\"‏ لأعطين الراية رجلا يحب الله ورسوله أو يحبه الله ورسوله ‏\"‏ ‏.‏ قال فأتيت عليا فجئت به أقوده وهو أرمد حتى أتيت به رسول الله صلى الله عليه وسلم فبسق في عينيه فبرأ وأعطاه الراية وخرج مرحب فقال قد علمت خيبر أني مرحب شاكي السلاح بطل مجرب إذا الحروب أقبلت تلهب فقال علي أنا الذي سمتني أمي حيدره كليث غابات كريه المنظره أوفيهم بالصاع كيل السندره قال فضرب رأس مرحب فقتله ثم كان الفتح على يديه ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 4679,
			"arabicnumber": "1808",
			"text": "حدثني عمرو بن محمد الناقد، حدثنا يزيد بن هارون، أخبرنا حماد بن سلمة، عن ثابت، عن أنس بن مالك، أن ثمانين، رجلا من أهل مكة هبطوا على رسول الله صلى الله عليه وسلم من جبل التنعيم متسلحين يريدون غرة النبي صلى الله عليه وسلم وأصحابه فأخذهم سلما فاستحياهم فأنزل الله عز وجل ‏{‏ وهو الذي كف أيديهم عنكم وأيديكم عنهم ببطن مكة من بعد أن أظفركم عليهم‏}‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 4682,
			"arabicnumber": "1810",
			"text": "حدثنا يحيى بن يحيى، أخبرنا جعفر بن سليمان، عن ثابت، عن أنس بن مالك، قال كان رسول الله صلى الله عليه وسلم يغزو بأم سليم ونسوة من الأنصار معه إذا غزا فيسقين الماء ويداوين الجرحى ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 4683,
			"arabicnumber": "1811",
			"text": "حدثنا عبد الله بن عبد الرحمن الدارمي، حدثنا عبد الله بن عمرو، - وهو أبو معمر المنقري - حدثنا عبد الوارث، حدثنا عبد العزيز، - وهو ابن صهيب - عن أنس، بن مالك قال لما كان يوم أحد انهزم ناس من الناس عن النبي صلى الله عليه وسلم وأبو طلحة بين يدى النبي صلى الله عليه وسلم مجوب عليه بحجفة - قال - وكان أبو طلحة رجلا راميا شديد النزع وكسر يومئذ قوسين أو ثلاثا - قال - فكان الرجل يمر معه الجعبة من النبل فيقول انثرها لأبي طلحة ‏.‏ قال ويشرف نبي الله صلى الله عليه وسلم ينظر إلى القوم فيقول أبو طلحة يا نبي الله بأبي أنت وأمي لا تشرف لا يصبك سهم من سهام القوم نحري دون نحرك قال ولقد رأيت عائشة بنت أبي بكر وأم سليم وإنهما لمشمرتان أرى خدم سوقهما تنقلان القرب على متونهما ثم تفرغانه في أفواههم ثم ترجعان فتملآنها ثم تجيئان تفرغانه في أفواه القوم ولقد وقع السيف من يدى أبي طلحة إما مرتين وإما ثلاثا من النعاس ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 4684,
			"arabicnumber": "1812.01",
			"text": "حدثنا عبد الله بن مسلمة بن قعنب، حدثنا سليمان، - يعني ابن بلال - عن جعفر بن محمد، عن أبيه، عن يزيد بن هرمز، أن نجدة، كتب إلى ابن عباس يسأله عن خمس، خلال ‏.‏ فقال ابن عباس لولا أن أكتم، علما ما كتبت إليه ‏.‏ كتب إليه نجدة أما بعد فأخبرني هل كان رسول الله صلى الله عليه وسلم يغزو بالنساء وهل كان يضرب لهن بسهم وهل كان يقتل الصبيان ومتى ينقضي يتم اليتيم وعن الخمس لمن هو فكتب إليه ابن عباس كتبت تسألني هل كان رسول الله صلى الله عليه وسلم يغزو بالنساء وقد كان يغزو بهن فيداوين الجرحى ويحذين من الغنيمة وأما بسهم فلم يضرب لهن وإن رسول الله صلى الله عليه وسلم لم يكن يقتل الصبيان فلا تقتل الصبيان وكتبت تسألني متى ينقضي يتم اليتيم فلعمري إن الرجل لتنبت لحيته وإنه لضعيف الأخذ لنفسه ضعيف العطاء منها فإذا أخذ لنفسه من صالح ما يأخذ الناس فقد ذهب عنه اليتم وكتبت تسألني عن الخمس لمن هو وإنا كنا نقول هو لنا ‏.‏ فأبى علينا قومنا ذاك ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 4685,
			"arabicnumber": "1812.02",
			"text": "حدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، كلاهما عن حاتم بن إسماعيل، عن جعفر بن محمد، عن أبيه، عن يزيد بن هرمز، أن نجدة، كتب إلى ابن عباس يسأله عن خلال، ‏.‏ بمثل حديث سليمان بن بلال غير أن في، حديث حاتم وإن رسول الله صلى الله عليه وسلم لم يكن يقتل الصبيان فلا تقتل الصبيان إلا أن تكون تعلم ما علم الخضر من الصبي الذي قتل ‏.‏ وزاد إسحاق في حديثه عن حاتم وتميز المؤمن فتقتل الكافر وتدع المؤمن ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 4686,
			"arabicnumber": "1812.03",
			"text": "وحدثنا ابن أبي عمر، حدثنا سفيان، عن إسماعيل بن أمية، عن سعيد المقبري، عن يزيد بن هرمز، قال كتب نجدة بن عامر الحروري إلى ابن عباس يسأله عن العبد، والمرأة يحضران المغنم هل يقسم لهما وعن قتل الولدان وعن اليتيم متى ينقطع عنه اليتم وعن ذوي القربى من هم فقال ليزيد اكتب إليه فلولا أن يقع في أحموقة ما كتبت إليه اكتب إنك كتبت تسألني عن المرأة والعبد يحضران المغنم هل يقسم لهما شىء وإنه ليس لهما شىء إلا أن يحذيا وكتبت تسألني عن قتل الولدان وإن رسول الله صلى الله عليه وسلم لم يقتلهم وأنت فلا تقتلهم إلا أن تعلم منهم ما علم صاحب موسى من الغلام الذي قتله وكتبت تسألني عن اليتيم متى ينقطع عنه اسم اليتم وإنه لا ينقطع عنه اسم اليتم حتى يبلغ ويؤنس منه رشد وكتبت تسألني عن ذوي القربى من هم وإنا زعمنا أنا هم فأبى ذلك علينا قومنا ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 4687,
			"arabicnumber": "1812.04",
			"text": "وحدثناه عبد الرحمن بن بشر العبدي، حدثنا سفيان، حدثنا إسماعيل بن أمية، عن سعيد بن أبي سعيد، عن يزيد بن هرمز، قال كتب نجدة إلى ابن عباس ‏.‏ وساق الحديث بمثله ‏.‏ قال أبو إسحاق حدثني عبد الرحمن بن بشر، حدثنا سفيان، بهذا الحديث بطوله",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 4688,
			"arabicnumber": "1812.05",
			"text": "حدثنا إسحاق بن إبراهيم، أخبرنا وهب بن جرير بن حازم، حدثني أبي قال، سمعت قيسا، يحدث عن يزيد بن هرمز، ح وحدثني محمد بن حاتم، - واللفظ له - قال حدثنا بهز، حدثنا جرير بن حازم، حدثني قيس بن سعد، عن يزيد بن هرمز، قال كتب نجدة بن عامر إلى ابن عباس قال فشهدت ابن عباس حين قرأ كتابه وحين كتب جوابه وقال ابن عباس والله لولا أن أرده عن نتن يقع فيه ما كتبت إليه ولا نعمة عين قال فكتب إليه إنك سألت عن سهم ذي القربى الذي ذكر الله من هم وإنا كنا نرى أن قرابة رسول الله صلى الله عليه وسلم هم نحن فأبى ذلك علينا قومنا وسألت عن اليتيم متى ينقضي يتمه وإنه إذا بلغ النكاح وأونس منه رشد ودفع إليه ماله فقد انقضى يتمه وسألت هل كان رسول الله صلى الله عليه وسلم يقتل من صبيان المشركين أحدا فإن رسول الله صلى الله عليه وسلم لم يكن يقتل منهم أحدا وأنت فلا تقتل منهم أحدا إلا أن تكون تعلم منهم ما علم الخضر من الغلام حين قتله وسألت عن المرأة والعبد هل كان لهما سهم معلوم إذا حضروا البأس فإنهم لم يكن لهم سهم معلوم إلا أن يحذيا من غنائم القوم",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 4689,
			"arabicnumber": "1812.06",
			"text": "وحدثني أبو كريب، حدثنا أبو أسامة، حدثنا زائدة، حدثنا سليمان الأعمش، عن المختار بن صيفي، عن يزيد بن هرمز، قال كتب نجدة إلى ابن عباس ‏.‏ فذكر بعض الحديث ولم يتم القصة كإتمام من ذكرنا حديثهم ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 4690,
			"arabicnumber": "1812.07",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الرحيم بن سليمان، عن هشام، عن حفصة، بنت سيرين عن أم عطية الأنصارية، قالت غزوت مع رسول الله صلى الله عليه وسلم سبع غزوات أخلفهم في رحالهم فأصنع لهم الطعام وأداوي الجرحى وأقوم على المرضى",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 4691,
			"arabicnumber": "1812.08",
			"text": "وحدثنا عمرو الناقد، حدثنا يزيد بن هارون، حدثنا هشام بن حسان، بهذا الإسناد نحوه ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 4692,
			"arabicnumber": "1254.02",
			"text": "حدثنا محمد بن المثنى، وابن، بشار - واللفظ لابن المثنى - قالا حدثنا محمد، بن جعفر حدثنا شعبة، عن أبي إسحاق، أن عبد الله بن يزيد، خرج يستسقي بالناس فصلى ركعتين ثم استسقى قال فلقيت يومئذ زيد بن أرقم - وقال - ليس بيني وبينه غير رجل أو بيني وبينه رجل - قال - فقلت له كم غزا رسول الله صلى الله عليه وسلم قال تسع عشرة فقلت كم غزوت أنت معه قال سبع عشرة غزوة - قال - فقلت فما أول غزوة غزاها قال ذات العسير أو العشير ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 4693,
			"arabicnumber": "1254.03",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن آدم، حدثنا زهير، عن أبي إسحاق، عن زيد بن أرقم، سمعه منه، أن رسول الله صلى الله عليه وسلم غزا تسع عشرة غزوة وحج بعد ما هاجر حجة لم يحج غيرها حجة الوداع ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 4694,
			"arabicnumber": "1813",
			"text": "حدثنا زهير بن حرب، حدثنا روح بن عبادة، حدثنا زكرياء، أخبرنا أبو الزبير، أنه سمع جابر بن عبد الله، يقول غزوت مع رسول الله صلى الله عليه وسلم تسع عشرة غزوة - قال جابر - لم أشهد بدرا ولا أحدا منعني أبي فلما قتل عبد الله يوم أحد لم أتخلف عن رسول الله صلى الله عليه وسلم في غزوة قط ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 4695,
			"arabicnumber": "1814.01",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، ح وحدثنا سعيد بن محمد، الجرمي حدثنا أبو تميلة، قالا جميعا حدثنا حسين بن واقد، عن عبد الله بن بريدة، عن أبيه، ‏.‏ قال غزا رسول الله صلى الله عليه وسلم تسع عشرة غزوة قاتل في ثمان منهن ‏.‏ ولم يقل أبو بكر منهن ‏.‏ وقال في حديثه حدثني عبد الله بن بريدة ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 4696,
			"arabicnumber": "1814.02",
			"text": "وحدثني أحمد بن حنبل، حدثنا معتمر بن سليمان، عن كهمس، عن ابن بريدة، عن أبيه، أنه قال غزا مع رسول الله صلى الله عليه وسلم ست عشرة غزوة ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 4697,
			"arabicnumber": "1815.01",
			"text": "حدثنا محمد بن عباد، حدثنا حاتم، - يعني ابن إسماعيل - عن يزيد، - وهو ابن أبي عبيد قال سمعت سلمة، يقول غزوت مع رسول الله صلى الله عليه وسلم سبع غزوات وخرجت فيما يبعث من البعوث تسع غزوات مرة علينا أبو بكر ومرة علينا أسامة بن زيد ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 4698,
			"arabicnumber": "1815.02",
			"text": "وحدثنا قتيبة بن سعيد، حدثنا حاتم، بهذا الإسناد ‏.‏ غير أنه قال في كلتيهما سبع غزوات ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 4699,
			"arabicnumber": "1816",
			"text": "حدثنا أبو عامر عبد الله بن براد الأشعري، ومحمد بن العلاء الهمداني، - واللفظ لأبي عامر - قالا حدثنا أبو أسامة، عن بريد بن أبي بردة، عن أبي بردة، عن أبي موسى، قال خرجنا مع رسول الله صلى الله عليه وسلم في غزاة ونحن ستة نفر بيننا بعير نعتقبه - قال - فنقبت أقدامنا فنقبت قدماى وسقطت أظفاري فكنا نلف على أرجلنا الخرق فسميت غزوة ذات الرقاع لما كنا نعصب على أرجلنا من الخرق ‏.‏ قال أبو بردة فحدث أبو موسى بهذا الحديث ثم كره ذلك ‏.‏ قال كأنه كره أن يكون شيئا من عمله أفشاه ‏.‏ قال أبو أسامة وزادني غير بريد والله يجزي به ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 4700,
			"arabicnumber": "1817",
			"text": "حدثني زهير بن حرب، حدثنا عبد الرحمن بن مهدي، عن مالك، ح وحدثنيه أبو الطاهر - واللفظ له - حدثني عبد الله بن وهب، عن مالك بن أنس، عن الفضيل بن أبي، عبد الله عن عبد الله بن نيار الأسلمي، عن عروة بن الزبير، عن عائشة، زوج النبي صلى الله عليه وسلم أنها قالت خرج رسول الله صلى الله عليه وسلم قبل بدر فلما كان بحرة الوبرة أدركه رجل قد كان يذكر منه جرأة ونجدة ففرح أصحاب رسول الله صلى الله عليه وسلم حين رأوه فلما أدركه قال لرسول الله صلى الله عليه وسلم جئت لأتبعك وأصيب معك قال له رسول الله صلى الله عليه وسلم ‏\"‏ تؤمن بالله ورسوله ‏\"‏ ‏.‏ قال لا قال ‏\"‏ فارجع فلن أستعين بمشرك ‏\"‏ ‏.‏ قالت ثم مضى حتى إذا كنا بالشجرة أدركه الرجل فقال له كما قال أول مرة فقال له النبي صلى الله عليه وسلم كما قال أول مرة قال ‏\"‏ فارجع فلن أستعين بمشرك ‏\"‏ ‏.‏ قال ثم رجع فأدركه بالبيداء فقال له كما قال أول مرة ‏\"‏ تؤمن بالله ورسوله ‏\"‏ ‏.‏ قال نعم ‏.‏ فقال له رسول الله صلى الله عليه وسلم ‏\"‏ فانطلق ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 182
			}
		}
	]
}