{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"33": "The Book on Government"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4701,
			"arabicnumber": "1818.01",
			"text": "حدثنا عبد الله بن مسلمة بن قعنب، وقتيبة بن سعيد، قالا حدثنا المغيرة، - يعنيان الحزامي ح وحدثنا زهير بن حرب، وعمرو الناقد، قالا حدثنا سفيان بن عيينة، كلاهما عن أبي الزناد، عن الأعرج، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم وفي حديث زهير يبلغ به النبي صلى الله عليه وسلم ‏.‏ وقال عمرو رواية ‏ \"‏ الناس تبع لقريش في هذا الشأن مسلمهم لمسلمهم وكافرهم لكافرهم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 4702,
			"arabicnumber": "1818.02",
			"text": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏ \"‏ الناس تبع لقريش في هذا الشأن مسلمهم تبع لمسلمهم وكافرهم تبع لكافرهم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 4703,
			"arabicnumber": "1819",
			"text": "وحدثني يحيى بن حبيب الحارثي، حدثنا روح، حدثنا ابن جريج، حدثني أبو الزبير أنه سمع جابر بن عبد الله، يقول قال النبي صلى الله عليه وسلم ‏ \"‏ الناس تبع لقريش في الخير والشر ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4704,
			"arabicnumber": "1820",
			"text": "وحدثنا أحمد بن عبد الله بن يونس، حدثنا عاصم بن محمد بن زيد، عن أبيه، قال قال عبد الله قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا يزال هذا الأمر في قريش ما بقي من الناس اثنان ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 4705,
			"arabicnumber": "1821.01",
			"text": "حدثنا قتيبة بن سعيد، حدثنا جرير، عن حصين، عن جابر بن سمرة، قال سمعت النبي صلى الله عليه وسلم يقول ح وحدثنا رفاعة بن الهيثم الواسطي، - واللفظ له - حدثنا خالد، - يعني ابن عبد الله الطحان - عن حصين، عن جابر بن سمرة، قال دخلت مع أبي على النبي صلى الله عليه وسلم فسمعته يقول ‏\"‏ إن هذا الأمر لا ينقضي حتى يمضي فيهم اثنا عشر خليفة ‏\"‏ ‏.‏ قال ثم تكلم بكلام خفي على - قال - فقلت لأبي ما قال قال ‏\"‏ كلهم من قريش ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 4706,
			"arabicnumber": "1821.02",
			"text": "حدثنا ابن أبي عمر، حدثنا سفيان، عن عبد الملك بن عمير، عن جابر بن سمرة، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا يزال أمر الناس ماضيا ما وليهم اثنا عشر رجلا ‏\"‏ ‏.‏ ثم تكلم النبي صلى الله عليه وسلم بكلمة خفيت على فسألت أبي ماذا قال رسول الله صلى الله عليه وسلم فقال ‏\"‏ كلهم من قريش ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 4707,
			"arabicnumber": "1821.03",
			"text": "وحدثنا قتيبة بن سعيد، حدثنا أبو عوانة، عن سماك بن جابر بن سمرة، عن النبي صلى الله عليه وسلم بهذا الحديث ولم يذكر ‏ \"‏ لا يزال أمر الناس ماضيا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 4708,
			"arabicnumber": "1821.04",
			"text": "حدثنا هداب بن خالد الأزدي، حدثنا حماد بن سلمة، عن سماك بن حرب، قال سمعت جابر بن سمرة، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يزال الإسلام عزيزا إلى اثنى عشر خليفة ‏\"‏ ‏.‏ ثم قال كلمة لم أفهمها فقلت لأبي ما قال فقال ‏\"‏ كلهم من قريش ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 4709,
			"arabicnumber": "1821.05",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو معاوية، عن داود، عن الشعبي، عن جابر، بن سمرة قال قال النبي صلى الله عليه وسلم ‏\"‏ لا يزال هذا الأمر عزيزا إلى اثنى عشر خليفة ‏\"‏ ‏.‏ قال ثم تكلم بشىء لم أفهمه فقلت لأبي ما قال فقال ‏\"‏ كلهم من قريش ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 4710,
			"arabicnumber": "1821.06",
			"text": "حدثنا نصر بن علي الجهضمي، حدثنا يزيد بن زريع، حدثنا ابن عون، ح وحدثنا أحمد بن عثمان النوفلي، - واللفظ له - حدثنا أزهر، حدثنا ابن عون، عن الشعبي، عن جابر بن سمرة، قال انطلقت إلى رسول الله صلى الله عليه وسلم ومعي أبي فسمعته يقول ‏\"‏ لا يزال هذا الدين عزيزا منيعا إلى اثنى عشر خليفة ‏\"‏ ‏.‏ فقال كلمة صمنيها الناس فقلت لأبي ما قال قال ‏\"‏ كلهم من قريش ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 4711,
			"arabicnumber": "1822.01",
			"text": "حدثنا قتيبة بن سعيد، وأبو بكر بن أبي شيبة قالا حدثنا حاتم، - وهو ابن إسماعيل - عن المهاجر بن مسمار، عن عامر بن سعد بن أبي وقاص، قال كتبت إلى جابر بن سمرة مع غلامي نافع أن أخبرني بشىء، سمعته من، رسول الله صلى الله عليه وسلم قال فكتب إلى سمعت رسول الله صلى الله عليه وسلم يوم جمعة عشية رجم الأسلمي يقول ‏\"‏ لا يزال الدين قائما حتى تقوم الساعة أو يكون عليكم اثنا عشر خليفة كلهم من قريش ‏\"‏ ‏.‏ وسمعته يقول ‏\"‏ عصيبة من المسلمين يفتتحون البيت الأبيض بيت كسرى أو آل كسرى ‏\"‏ ‏.‏ وسمعته يقول ‏\"‏ إن بين يدى الساعة كذابين فاحذروهم ‏\"‏ ‏.‏ وسمعته يقول ‏\"‏ إذا أعطى الله أحدكم خيرا فليبدأ بنفسه وأهل بيته ‏\"‏ ‏.‏ وسمعته يقول ‏\"‏ أنا الفرط على الحوض ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 4712,
			"arabicnumber": "1822.02",
			"text": "حدثنا محمد بن رافع، حدثنا ابن أبي فديك، حدثنا ابن أبي ذئب، عن مهاجر، بن مسمار عن عامر بن سعد، أنه أرسل إلى ابن سمرة العدوي حدثنا ما، سمعت من، رسول الله صلى الله عليه وسلم فقال سمعت رسول الله صلى الله عليه وسلم يقول ‏.‏ فذكر نحو حديث حاتم ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 4713,
			"arabicnumber": "1823.01",
			"text": "حدثنا أبو كريب، محمد بن العلاء حدثنا أبو أسامة، عن هشام بن عروة، عن أبيه، عن ابن عمر، قال حضرت أبي حين أصيب فأثنوا عليه وقالوا جزاك الله خيرا ‏.‏ فقال راغب وراهب قالوا استخلف فقال أتحمل أمركم حيا وميتا لوددت أن حظي منها الكفاف لا على ولا لي فإن أستخلف فقد استخلف من هو خير مني - يعني أبا بكر - وإن أترككم فقد ترككم من هو خير مني رسول الله صلى الله عليه وسلم ‏.‏ قال عبد الله فعرفت أنه حين ذكر رسول الله صلى الله عليه وسلم غير مستخلف ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 4714,
			"arabicnumber": "1823.02",
			"text": "حدثنا إسحاق بن إبراهيم، وابن أبي عمر، ومحمد بن رافع، وعبد بن حميد، وألفاظهم، متقاربة قال إسحاق وعبد أخبرنا وقال الآخران، حدثنا عبد الرزاق، - أخبرنا معمر، عن الزهري، أخبرني سالم، عن ابن عمر، قال دخلت على حفصة فقالت أعلمت أن أباك غير مستخلف قال قلت ما كان ليفعل ‏.‏ قالت إنه فاعل ‏.‏ قال فحلفت أني أكلمه في ذلك فسكت حتى غدوت ولم أكلمه - قال - فكنت كأنما أحمل بيميني جبلا حتى رجعت فدخلت عليه فسألني عن حال الناس وأنا أخبره - قال - ثم قلت له إني سمعت الناس يقولون مقالة فآليت أن أقولها لك زعموا أنك غير مستخلف وإنه لو كان لك راعي إبل أو راعي غنم ثم جاءك وتركها رأيت أن قد ضيع فرعاية الناس أشد قال فوافقه قولي فوضع رأسه ساعة ثم رفعه إلى فقال إن الله عز وجل يحفظ دينه وإني لئن لا أستخلف فإن رسول الله صلى الله عليه وسلم لم يستخلف وإن أستخلف فإن أبا بكر قد استخلف ‏.‏ قال فوالله ما هو إلا أن ذكر رسول الله صلى الله عليه وسلم وأبا بكر فعلمت أنه لم يكن ليعدل برسول الله صلى الله عليه وسلم أحدا وأنه غير مستخلف ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 4715,
			"arabicnumber": "1652.03",
			"text": "حدثنا شيبان بن فروخ، حدثنا جرير بن حازم، حدثنا الحسن، حدثنا عبد الرحمن، بن سمرة قال قال لي رسول الله صلى الله عليه وسلم ‏ \"‏ يا عبد الرحمن لا تسأل الإمارة فإنك إن أعطيتها عن مسألة أكلت إليها وإن أعطيتها عن غير مسألة أعنت عليها ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 4716,
			"arabicnumber": "1652.04",
			"text": "وحدثنا يحيى بن يحيى، حدثنا خالد بن عبد الله، عن يونس، ح وحدثني علي، بن حجر السعدي حدثنا هشيم، عن يونس، ومنصور، وحميد، ح وحدثنا أبو كامل الجحدري، حدثنا حماد بن زيد، عن سماك بن عطية، ويونس بن عبيد، وهشام بن حسان، كلهم عن الحسن، عن عبد الرحمن بن سمرة، عن النبي صلى الله عليه وسلم بمثل حديث جرير ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 4717,
			"arabicnumber": "1733.03",
			"text": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن العلاء، قالا حدثنا أبو أسامة، عن بريد، بن عبد الله عن أبي بردة، عن أبي موسى، قال دخلت على النبي صلى الله عليه وسلم أنا ورجلان من بني عمي فقال أحد الرجلين يا رسول الله أمرنا على بعض ما ولاك الله عز وجل ‏.‏ وقال الآخر مثل ذلك فقال ‏ \"‏ إنا والله لا نولي على هذا العمل أحدا سأله ولا أحدا حرص عليه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 4718,
			"arabicnumber": "1733.04",
			"text": "حدثنا عبيد الله بن سعيد، ومحمد بن حاتم، - واللفظ لابن حاتم - قالا حدثنا يحيى بن سعيد القطان، حدثنا قرة بن خالد، حدثنا حميد بن هلال، حدثني أبو بردة، قال قال أبو موسى أقبلت إلى النبي صلى الله عليه وسلم ومعي رجلان من الأشعريين أحدهما عن يميني والآخر عن يساري فكلاهما سأل العمل والنبي صلى الله عليه وسلم يستاك فقال ‏\"‏ ما تقول يا أبا موسى أو يا عبد الله بن قيس ‏\"‏ ‏.‏ قال فقلت والذي بعثك بالحق ما أطلعاني على ما في أنفسهما وما شعرت أنهما يطلبان العمل ‏.‏ قال وكأني أنظر إلى سواكه تحت شفته وقد قلصت فقال ‏\"‏ لن أو لا نستعمل على عملنا من أراده ولكن اذهب أنت يا أبا موسى أو يا عبد الله بن قيس ‏\"‏ ‏.‏ فبعثه على اليمن ثم أتبعه معاذ بن جبل فلما قدم عليه قال انزل وألقى له وسادة وإذا رجل عنده موثق قال ما هذا قال هذا كان يهوديا فأسلم ثم راجع دينه دين السوء فتهود قال لا أجلس حتى يقتل قضاء الله ورسوله فقال اجلس نعم ‏.‏ قال لا أجلس حتى يقتل قضاء الله ورسوله ثلاث مرات ‏.‏ فأمر به فقتل ثم تذاكرا القيام من الليل فقال أحدهما معاذ أما أنا فأنام وأقوم وأرجو في نومتي ما أرجو في قومتي ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 4719,
			"arabicnumber": "1825",
			"text": "حدثنا عبد الملك بن شعيب بن الليث، حدثني أبي شعيب بن الليث، حدثني الليث، بن سعد حدثني يزيد بن أبي حبيب، عن بكر بن عمرو، عن الحارث بن يزيد الحضرمي، عن ابن حجيرة الأكبر، عن أبي ذر، قال قلت يا رسول الله ألا تستعملني قال فضرب بيده على منكبي ثم قال ‏ \"‏ يا أبا ذر إنك ضعيف وإنها أمانة وإنها يوم القيامة خزى وندامة إلا من أخذها بحقها وأدى الذي عليه فيها ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 4720,
			"arabicnumber": "1826",
			"text": "حدثنا زهير بن حرب، وإسحاق بن إبراهيم، كلاهما عن المقرئ، قال زهير حدثنا عبد الله بن يزيد، حدثنا سعيد بن أبي أيوب، عن عبيد الله بن أبي جعفر القرشي، عن سالم، بن أبي سالم الجيشاني عن أبيه، عن أبي ذر، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ يا أبا ذر إني أراك ضعيفا وإني أحب لك ما أحب لنفسي لا تأمرن على اثنين ولا تولين مال يتيم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 4721,
			"arabicnumber": "1827",
			"text": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، وابن، نمير قالوا حدثنا سفيان، بن عيينة عن عمرو، - يعني ابن دينار - عن عمرو بن أوس، عن عبد الله بن عمرو، قال ابن نمير وأبو بكر يبلغ به النبي صلى الله عليه وسلم وفي حديث زهير قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن المقسطين عند الله على منابر من نور عن يمين الرحمن عز وجل وكلتا يديه يمين الذين يعدلون في حكمهم وأهليهم وما ولوا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 4722,
			"arabicnumber": "1828.01",
			"text": "حدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، حدثني حرملة، عن عبد الرحمن، بن شماسة قال أتيت عائشة أسألها عن شىء، فقالت ممن أنت فقلت رجل من أهل مصر ‏.‏ فقالت كيف كان صاحبكم لكم في غزاتكم هذه فقال ما نقمنا منه شيئا إن كان ليموت للرجل منا البعير فيعطيه البعير والعبد فيعطيه العبد ويحتاج إلى النفقة فيعطيه النفقة فقالت أما إنه لا يمنعني الذي فعل في محمد بن أبي بكر أخي أن أخبرك ما سمعت من رسول الله صلى الله عليه وسلم يقول في بيتي هذا ‏ \"‏ اللهم من ولي من أمر أمتي شيئا فشق عليهم فاشقق عليه ومن ولي من أمر أمتي شيئا فرفق بهم فارفق به ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 4723,
			"arabicnumber": "1828.02",
			"text": "وحدثني محمد بن حاتم، حدثنا ابن مهدي، حدثنا جرير بن حازم، عن حرملة، المصري عن عبد الرحمن بن شماسة، عن عائشة، عن النبي صلى الله عليه وسلم بمثله",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 4724,
			"arabicnumber": "1829.01",
			"text": "حدثنا قتيبة بن سعيد، حدثنا ليث، ح وحدثنا محمد بن رمح، حدثنا الليث، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم أنه قال ‏ \"‏ ألا كلكم راع وكلكم مسئول عن رعيته فالأمير الذي على الناس راع وهو مسئول عن رعيته والرجل راع على أهل بيته وهو مسئول عنهم والمرأة راعية على بيت بعلها وولده وهي مسئولة عنهم والعبد راع على مال سيده وهو مسئول عنه ألا فكلكم راع وكلكم مسئول عن رعيته ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 4727,
			"arabicnumber": "1829.04",
			"text": "وحدثنا يحيى بن يحيى، ويحيى بن أيوب، وقتيبة بن سعيد، وابن، حجر كلهم عن إسماعيل بن جعفر، عن عبد الله بن دينار، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ح. وحدثني حرملة بن يحيى، أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، عن سالم بن عبد الله، عن أبيه، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏.‏ بمعنى حديث نافع عن ابن عمر وزاد في حديث الزهري قال وحسبت أنه قد قال ‏ \"‏ الرجل راع في مال أبيه ومسئول عن رعيته ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 4728,
			"arabicnumber": "1829.05",
			"text": "وحدثني أحمد بن عبد الرحمن بن وهب، أخبرني عمي عبد الله بن وهب، أخبرني رجل، سماه وعمرو بن الحارث عن بكير، عن بسر بن سعيد، حدثه عن عبد الله بن عمر، عن النبي صلى الله عليه وسلم بهذا المعنى ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 4729,
			"arabicnumber": "142.05",
			"text": "وحدثنا شيبان بن فروخ، حدثنا أبو الأشهب، عن الحسن، قال عاد عبيد الله بن زياد معقل بن يسار المزني في مرضه الذي مات فيه فقال معقل إني محدثك حديثا سمعته من رسول الله صلى الله عليه وسلم لو علمت أن لي حياة ما حدثتك إني سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ ما من عبد يسترعيه الله رعية يموت يوم يموت وهو غاش لرعيته إلا حرم الله عليه الجنة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 4730,
			"arabicnumber": "142.06",
			"text": "وحدثناه يحيى بن يحيى، أخبرنا يزيد بن زريع، عن يونس، عن الحسن، قال دخل ابن زياد على معقل بن يسار وهو وجع ‏.‏ بمثل حديث أبي الأشهب وزاد قال ألا كنت حدثتني هذا، قبل اليوم قال ما حدثتك أو، لم أكن لأحدثك ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 4731,
			"arabicnumber": "142.07",
			"text": "وحدثنا أبو غسان المسمعي، وإسحاق بن إبراهيم، ومحمد بن المثنى، قال إسحاق أخبرنا وقال الآخران، حدثنا معاذ بن هشام، حدثني أبي، عن قتادة، عن أبي المليح، أنإني محدثك بحديث لولا أني في الموت لم أحدثك به سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ ما من أمير يلي أمر المسلمين ثم لا يجهد لهم وينصح إلا لم يدخل معهم الجنة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 4732,
			"arabicnumber": "142.08",
			"text": "وحدثنا عقبة بن مكرم العمي، حدثنا يعقوب بن إسحاق، أخبرني سوادة بن أبي، الأسود حدثني أبي أن معقل بن يسار، مرض فأتاه عبيد الله بن زياد يعوده ‏.‏ نحو حديث الحسن عن معقل، ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 4733,
			"arabicnumber": "1830",
			"text": "حدثنا شيبان بن فروخ، حدثنا جرير بن حازم، حدثنا الحسن، أن عائذ بن عمرو، - وكان من أصحاب رسول الله صلى الله عليه وسلم - دخل على عبيد الله بن زياد فقال أى بنى إني سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ إن شر الرعاء الحطمة فإياك أن تكون منهم ‏\"‏ ‏.‏ فقال له اجلس فإنما أنت من نخالة أصحاب محمد صلى الله عليه وسلم ‏.‏ فقال وهل كانت لهم نخالة إنما كانت النخالة بعدهم وفي غيرهم ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 4734,
			"arabicnumber": "1831.01",
			"text": "وحدثني زهير بن حرب، حدثنا إسماعيل بن إبراهيم، عن أبي حيان، عن أبي، زرعة عن أبي هريرة، قال قام فينا رسول الله صلى الله عليه وسلم ذات يوم فذكر الغلول فعظمه وعظم أمره ثم قال ‏ \"‏ لا ألفين أحدكم يجيء يوم القيامة على رقبته بعير له رغاء يقول يا رسول الله أغثني ‏.‏ فأقول لا أملك لك شيئا قد أبلغتك ‏.‏ لا ألفين أحدكم يجيء يوم القيامة على رقبته فرس له حمحمة فيقول يا رسول الله أغثني ‏.‏ فأقول لا أملك لك شيئا قد أبلغتك ‏.‏ لا ألفين أحدكم يجيء يوم القيامة على رقبته شاة لها ثغاء يقول يا رسول الله أغثني ‏.‏ فأقول لا أملك لك شيئا قد أبلغتك ‏.‏ لا ألفين أحدكم يجيء يوم القيامة على رقبته نفس لها صياح فيقول يا رسول الله أغثني ‏.‏ فأقول لا أملك لك شيئا قد أبلغتك ‏.‏ لا ألفين أحدكم يجيء يوم القيامة على رقبته رقاع تخفق فيقول يا رسول الله أغثني ‏.‏ فأقول لا أملك لك شيئا قد أبلغتك ‏.‏ لا ألفين أحدكم يجيء يوم القيامة على رقبته صامت فيقول يا رسول الله أغثني فأقول لا أملك لك شيئا قد أبلغتك ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 4735,
			"arabicnumber": "1831.02",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا عبد الرحيم بن سليمان، عن أبي حيان، ح وحدثني زهير بن حرب، حدثنا جرير، عن أبي حيان، وعمارة بن القعقاع، جميعا عن أبي زرعة، عن أبي هريرة، بمثل حديث إسماعيل عن أبي حيان، ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 4736,
			"arabicnumber": "1831.03",
			"text": "وحدثني أحمد بن سعيد بن صخر الدارمي، حدثنا سليمان بن حرب، حدثنا حماد، - يعني ابن زيد - عن أيوب، عن يحيى بن سعيد، عن أبي زرعة بن عمرو بن جرير، عن أبي هريرة، قال ذكر رسول الله صلى الله عليه وسلم الغلول فعظمه ‏.‏ واقتص الحديث قال حماد ثم سمعت يحيى بعد ذلك يحدثه فحدثنا بنحو ما حدثنا عنه أيوب ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 4737,
			"arabicnumber": "1831.04",
			"text": "وحدثني أحمد بن الحسن بن خراش، حدثنا أبو معمر، حدثنا عبد الوارث، حدثنا أيوب، عن يحيى بن سعيد بن حيان، عن أبي زرعة، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏.‏ بنحو حديثهم ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 4738,
			"arabicnumber": "1832.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، وابن أبي عمر، - واللفظ لأبي بكر - قالوا حدثنا سفيان بن عيينة، عن الزهري، عن عروة، عن أبي حميد الساعدي، قال استعمل رسول الله صلى الله عليه وسلم رجلا من الأسد يقال له ابن اللتبية - قال عمرو وابن أبي عمر على الصدقة - فلما قدم قال هذا لكم وهذا لي أهدي لي قال فقام رسول الله صلى الله عليه وسلم على المنبر فحمد الله وأثنى عليه وقال ‏\"‏ ما بال عامل أبعثه فيقول هذا لكم وهذا أهدي لي ‏.‏ أفلا قعد في بيت أبيه أو في بيت أمه حتى ينظر أيهدى إليه أم لا والذي نفس محمد بيده لا ينال أحد منكم منها شيئا إلا جاء به يوم القيامة يحمله على عنقه بعير له رغاء أو بقرة لها خوار أو شاة تيعر ‏\"‏ ‏.‏ ثم رفع يديه حتى رأينا عفرتى إبطيه ثم قال ‏\"‏ اللهم هل بلغت ‏\"‏ ‏.‏ مرتين ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 4739,
			"arabicnumber": "1832.02",
			"text": "حدثنا إسحاق بن إبراهيم، وعبد بن حميد، قالا أخبرنا عبد الرزاق، حدثنا معمر، عن الزهري، عن عروة، عن أبي حميد الساعدي، قال استعمل النبي صلى الله عليه وسلم ابن اللتبية - رجلا من الأزد - على الصدقة فجاء بالمال فدفعه إلى النبي صلى الله عليه وسلم فقال هذا مالكم وهذه هدية أهديت لي ‏.‏ فقال له النبي صلى الله عليه وسلم ‏ \"‏ أفلا قعدت في بيت أبيك وأمك فتنظر أيهدى إليك أم لا ‏\"‏ ‏.‏ ثم قام النبي صلى الله عليه وسلم خطيبا ‏.‏ ثم ذكر نحو حديث سفيان ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 4740,
			"arabicnumber": "1832.03",
			"text": "حدثنا أبو كريب، محمد بن العلاء حدثنا أبو أسامة، حدثنا هشام، عن أبيه، عن أبي حميد الساعدي، قال استعمل رسول الله صلى الله عليه وسلم رجلا من الأزد على صدقات بني سليم يدعى ابن الأتبية فلما جاء حاسبه قال هذا مالكم وهذا هدية ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ فهلا جلست في بيت أبيك وأمك حتى تأتيك هديتك إن كنت صادقا ‏\"‏ ‏.‏ ثم خطبنا فحمد الله وأثنى عليه ثم قال ‏\"‏ أما بعد فإني أستعمل الرجل منكم على العمل مما ولاني الله فيأتي فيقول هذا مالكم وهذا هدية أهديت لي ‏.‏ أفلا جلس في بيت أبيه وأمه حتى تأتيه هديته إن كان صادقا والله لا يأخذ أحد منكم منها شيئا بغير حقه إلا لقي الله تعالى يحمله يوم القيامة فلأعرفن أحدا منكم لقي الله يحمل بعيرا له رغاء أو بقرة لها خوار أو شاة تيعر ‏\"‏ ‏.‏ ثم رفع يديه حتى رئي بياض إبطيه ثم قال ‏\"‏ اللهم هل بلغت ‏\"‏ ‏.‏ بصر عيني وسمع أذني ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 4741,
			"arabicnumber": "1832.04",
			"text": "وحدثنا أبو كريب، حدثنا عبدة، وابن، نمير وأبو معاوية ح وحدثنا أبو بكر بن، أبي شيبة حدثنا عبد الرحيم بن سليمان، ح وحدثنا ابن أبي عمر، حدثنا سفيان، كلهم عن هشام، بهذا الإسناد ‏.‏ وفي حديث عبدة وابن نمير فلما جاء حاسبه ‏.‏ كما قال أبو أسامة ‏.‏ وفي حديث ابن نمير ‏ \"‏ تعلمن والله والذي نفسي بيده لا يأخذ أحدكم منها شيئا ‏\"‏ ‏.‏ وزاد في حديث سفيان قال بصر عيني وسمع أذناى ‏.‏ وسلوا زيد بن ثابت فإنه كان حاضرا معي ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 4742,
			"arabicnumber": "1832.05",
			"text": "وحدثناه إسحاق بن إبراهيم، أخبرنا جرير، عن الشيباني، عن عبد الله بن ذكوان، - وهو أبو الزناد - عن عروة بن الزبير، أن رسول الله صلى الله عليه وسلم استعمل رجلا على الصدقة فجاء بسواد كثير فجعل يقول هذا لكم وهذا أهدي إلى ‏.‏ فذكر نحوه قال عروة فقلت لأبي حميد الساعدي أسمعته من رسول الله صلى الله عليه وسلم فقال من فيه إلى أذني ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 4743,
			"arabicnumber": "1833.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع بن الجراح، حدثنا إسماعيل بن أبي، خالد عن قيس بن أبي حازم، عن عدي بن عميرة الكندي، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من استعملناه منكم على عمل فكتمنا مخيطا فما فوقه كان غلولا يأتي به يوم القيامة ‏\"‏ ‏.‏ قال فقام إليه رجل أسود من الأنصار كأني أنظر إليه فقال يا رسول الله اقبل عني عملك قال ‏\"‏ وما لك ‏\"‏ ‏.‏ قال سمعتك تقول كذا وكذا ‏.‏ قال ‏\"‏ وأنا أقوله الآن من استعملناه منكم على عمل فليجئ بقليله وكثيره فما أوتي منه أخذ وما نهي عنه انتهى ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 4744,
			"arabicnumber": "1833.02",
			"text": "وحدثناه محمد بن عبد الله بن نمير، حدثنا أبي ومحمد بن بشر، ح وحدثني محمد، بن رافع حدثنا أبو أسامة، قالوا حدثنا إسماعيل، بهذا الإسناد بمثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 4745,
			"arabicnumber": "1833.03",
			"text": "وحدثناه إسحاق بن إبراهيم الحنظلي، أخبرنا الفضل بن موسى، حدثنا إسماعيل، بن أبي خالد أخبرنا قيس بن أبي حازم، قال سمعت عدي بن عميرة الكندي، يقول سمعت رسول الله صلى الله عليه وسلم يقول بمثل حديثهم ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 4746,
			"arabicnumber": "1834",
			"text": "حدثني زهير بن حرب، وهارون بن عبد الله، قالا حدثنا حجاج بن محمد، قال قال ابن جريج نزل ‏{‏ يا أيها الذين آمنوا أطيعوا الله وأطيعوا الرسول وأولي الأمر منكم‏}‏ في عبد الله بن حذافة بن قيس بن عدي السهمي بعثه النبي صلى الله عليه وسلم في سرية ‏.‏ أخبرنيه يعلى بن مسلم عن سعيد بن جبير عن ابن عباس ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 4749,
			"arabicnumber": "1835.03",
			"text": "وحدثني حرملة بن يحيى، أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، أخبره قال حدثنا أبو سلمة بن عبد الرحمن، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم أنه قال ‏ \"‏ من أطاعني فقد أطاع الله ومن عصاني فقد عصى الله ومن أطاع أميري فقد أطاعني ومن عصى أميري فقد عصاني ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 4750,
			"arabicnumber": "1835.04",
			"text": "وحدثني محمد بن حاتم، حدثنا مكي بن إبراهيم، حدثنا ابن جريج، عن زياد، عن ابن شهاب، أن أبا سلمة بن عبد الرحمن، أخبره أنه، سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم بمثله سواء ‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 4751,
			"arabicnumber": "1835.05",
			"text": "وحدثني أبو كامل الجحدري، حدثنا أبو عوانة، عن يعلى بن عطاء، عن أبي علقمة، قال حدثني أبو هريرة، من فيه إلى في قال سمعت رسول الله صلى الله عليه وسلم ح. وحدثني عبيد الله بن معاذ، حدثنا أبي ح، وحدثنا محمد بن بشار، حدثنا محمد، بن جعفر قالا حدثنا شعبة، عن يعلى بن عطاء، سمع أبا علقمة، سمع أبا هريرة، عن النبي صلى الله عليه وسلم نحو حديثهم ‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 4752,
			"arabicnumber": "1835.06",
			"text": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، عن أبي هريرة، عن النبي صلى الله عليه وسلم بمثل حديثهم ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 4753,
			"arabicnumber": "1835.07",
			"text": "وحدثني أبو الطاهر، أخبرنا ابن وهب، عن حيوة، أن أبا يونس، مولى أبي هريرة حدثه قال سمعت أبا هريرة، يقول عن رسول الله صلى الله عليه وسلم بذلك وقال ‏ \"‏ من أطاع الأمير ‏\"‏ ‏.‏ ولم يقل أميري وكذلك في حديث همام عن أبي هريرة ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 4754,
			"arabicnumber": "1836",
			"text": "وحدثنا سعيد بن منصور، وقتيبة بن سعيد، كلاهما عن يعقوب، قال سعيد حدثنا يعقوب بن عبد الرحمن، عن أبي حازم، عن أبي صالح السمان، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ عليك السمع والطاعة في عسرك ويسرك ومنشطك ومكرهك وأثرة عليك ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 4755,
			"arabicnumber": "1837.01",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وعبد الله بن براد الأشعري، وأبو كريب قالوا حدثنا ابن إدريس، عن شعبة، عن أبي عمران، عن عبد الله بن الصامت، عن أبي ذر، قال إن خليلي أوصاني أن أسمع وأطيع وإن كان عبدا مجدع الأطراف ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 4756,
			"arabicnumber": "1837.02",
			"text": "وحدثنا محمد بن بشار، حدثنا محمد بن جعفر، ح وحدثنا إسحاق، أخبرنا النضر، بن شميل جميعا عن شعبة، عن أبي عمران، بهذا الإسناد وقالا في الحديث عبدا حبشيا مجدع الأطراف ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 4757,
			"arabicnumber": "1837.03",
			"text": "وحدثناه عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن أبي عمران، بهذا الإسناد كما قال ابن إدريس عبدا مجدع الأطراف ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 4758,
			"arabicnumber": "1838.01",
			"text": "حدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، عن يحيى بن حصين، قال سمعت جدتي، تحدث أنها سمعت النبي صلى الله عليه وسلم يخطب في حجة الوداع وهو يقول ‏ \"‏ ولو استعمل عليكم عبد يقودكم بكتاب الله فاسمعوا له وأطيعوا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 4759,
			"arabicnumber": "1838.02",
			"text": "وحدثناه ابن بشار، حدثنا محمد بن جعفر، وعبد الرحمن بن مهدي، عن شعبة، بهذا الإسناد وقال عبدا حبشيا ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 4760,
			"arabicnumber": "1838.03",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع بن الجراح، عن شعبة، بهذا الإسناد وقال عبدا حبشيا مجدعا ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 4761,
			"arabicnumber": "1838.04",
			"text": "وحدثنا عبد الرحمن بن بشر، حدثنا بهز، حدثنا شعبة، بهذا الإسناد ولم يذكر حبشيا مجدعا وزاد أنها سمعت رسول الله صلى الله عليه وسلم بمنى أو بعرفات ‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 4762,
			"arabicnumber": "1838.05",
			"text": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، عن زيد بن أبي، أنيسة عن يحيى بن حصين، عن جدته أم الحصين، قال سمعتها تقول، حججت مع رسول الله صلى الله عليه وسلم حجة الوداع - قالت - فقال رسول الله صلى الله عليه وسلم قولا كثيرا ثم سمعته يقول ‏ \"‏ إن أمر عليكم عبد مجدع - حسبتها قالت - أسود يقودكم بكتاب الله فاسمعوا له وأطيعوا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 4763,
			"arabicnumber": "1839.01",
			"text": "حدثنا قتيبة بن سعيد، حدثنا ليث، عن عبيد الله، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم أنه قال ‏ \"‏ على المرء المسلم السمع والطاعة فيما أحب وكره إلا أن يؤمر بمعصية فإن أمر بمعصية فلا سمع ولا طاعة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 4764,
			"arabicnumber": "1839.02",
			"text": "وحدثناه زهير بن حرب، ومحمد بن المثنى، قالا حدثنا يحيى، وهو القطان ح وحدثنا ابن نمير، حدثنا أبي كلاهما، عن عبيد الله، بهذا الإسناد مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 4765,
			"arabicnumber": "1840.01",
			"text": "حدثنا محمد بن المثنى، وابن، بشار - واللفظ لابن المثنى - قالا حدثنا محمد، بن جعفر حدثنا شعبة، عن زبيد، عن سعد بن عبيدة، عن أبي عبد الرحمن، عن علي، أنعليه وسلم بعث جيشا وأمر عليهم رجلا فأوقد نارا وقال ادخلوها ‏.‏ فأراد ناس أن يدخلوها وقال الآخرون إنا قد فررنا منها ‏.‏ فذكر ذلك لرسول الله صلى الله عليه وسلم فقال للذين أرادوا أن يدخلوها ‏\"‏ لو دخلتموها لم تزالوا فيها إلى يوم القيامة ‏\"‏ ‏.‏ وقال للآخرين قولا حسنا وقال ‏\"‏ لا طاعة في معصية الله إنما الطاعة في المعروف ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 4766,
			"arabicnumber": "1840.02",
			"text": "وحدثنا محمد بن عبد الله بن نمير، وزهير بن حرب، وأبو سعيد الأشج - وتقاربوا في اللفظ - قالوا حدثنا وكيع، حدثنا الأعمش، عن سعد بن عبيدة، عن أبي عبد الرحمن، عن علي، قال بعث رسول الله صلى الله عليه وسلم سرية واستعمل عليهم رجلا من الأنصار وأمرهم أن يسمعوا له ويطيعوا فأغضبوه في شىء فقال اجمعوا لي حطبا ‏.‏ فجمعوا له ثم قال أوقدوا نارا ‏.‏ فأوقدوا ثم قال ألم يأمركم رسول الله صلى الله عليه وسلم أن تسمعوا لي وتطيعوا قالوا بلى ‏.‏ قال فادخلوها ‏.‏ قال فنظر بعضهم إلى بعض فقالوا إنما فررنا إلى رسول الله صلى الله عليه وسلم من النار ‏.‏ فكانوا كذلك وسكن غضبه وطفئت النار فلما رجعوا ذكروا ذلك للنبي صلى الله عليه وسلم فقال ‏ \"‏ لو دخلوها ما خرجوا منها إنما الطاعة في المعروف ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 4767,
			"arabicnumber": "1840.03",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، وأبو معاوية عن الأعمش، بهذا الإسناد نحوه ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 4768,
			"arabicnumber": "1709.05",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن إدريس، عن يحيى بن سعيد، وعبيد الله بن عمر عن عبادة بن الوليد بن عبادة، عن أبيه، عن جده، قال بايعنا رسول الله صلى الله عليه وسلم على السمع والطاعة في العسر واليسر والمنشط والمكره وعلى أثرة علينا وعلى أن لا ننازع الأمر أهله وعلى أن نقول بالحق أينما كنا لا نخاف في الله لومة لائم ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 4769,
			"arabicnumber": "1709.06",
			"text": "وحدثناه ابن نمير، حدثنا عبد الله، - يعني ابن إدريس - حدثنا ابن عجلان، وعبيد الله بن عمر ويحيى بن سعيد عن عبادة بن الوليد، في هذا الإسناد مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 4770,
			"arabicnumber": "1709.07",
			"text": "وحدثنا ابن أبي عمر، حدثنا عبد العزيز، - يعني الدراوردي - عن يزيد، - وهو ابن الهاد - عن عبادة بن الوليد بن عبادة بن الصامت، عن أبيه، حدثني أبي قال، بايعنا رسول الله صلى الله عليه وسلم بمثل حديث ابن إدريس ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 4771,
			"arabicnumber": "1709.08",
			"text": "حدثنا أحمد بن عبد الرحمن بن وهب بن مسلم، حدثنا عمي عبد الله بن وهب، حدثنا عمرو بن الحارث، حدثني بكير، عن بسر بن سعيد، عن جنادة بن أبي أمية، قال دخلنا على عبادة بن الصامت وهو مريض فقلنا حدثنا أصلحك الله، بحديث ينفع الله به سمعته من، رسول الله صلى الله عليه وسلم ‏.‏ فقال دعانا رسول الله صلى الله عليه وسلم فبايعناه فكان فيما أخذ علينا أن بايعنا على السمع والطاعة في منشطنا ومكرهنا وعسرنا ويسرنا وأثرة علينا وأن لا ننازع الأمر أهله قال ‏ \"‏ إلا أن تروا كفرا بواحا عندكم من الله فيه برهان ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 4772,
			"arabicnumber": "1841",
			"text": "حدثنا إبراهيم، عن مسلم، حدثني زهير بن حرب، حدثنا شبابة، حدثني ورقاء، عن أبي الزناد، عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ إنما الإمام جنة يقاتل من ورائه ويتقى به فإن أمر بتقوى الله عز وجل وعدل كان له بذلك أجر وإن يأمر بغيره كان عليه منه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 4773,
			"arabicnumber": "1842.01",
			"text": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن فرات القزاز، عن أبي حازم، قال قاعدت أبا هريرة خمس سنين فسمعته يحدث، عن النبي صلى الله عليه وسلم قال ‏\"‏ كانت بنو إسرائيل تسوسهم الأنبياء كلما هلك نبي خلفه نبي وإنه لا نبي بعدي وستكون خلفاء فتكثر ‏\"‏ ‏.‏ قالوا فما تأمرنا قال ‏\"‏ فوا ببيعة الأول فالأول وأعطوهم حقهم فإن الله سائلهم عما استرعاهم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 4774,
			"arabicnumber": "1842.02",
			"text": "حدثنا أبو بكر بن أبي شيبة، وعبد الله بن براد الأشعري، قالا حدثنا عبد الله، بن إدريس عن الحسن بن فرات، عن أبيه، بهذا الإسناد مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 4775,
			"arabicnumber": "1843",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو الأحوص، ووكيع، ح وحدثني أبو سعيد، الأشج حدثنا وكيع، ح وحدثنا أبو كريب، وابن، نمير قالا حدثنا أبو معاوية، ح وحدثنا إسحاق بن إبراهيم، وعلي بن خشرم، قالا أخبرنا عيسى بن يونس، كلهم عن الأعمش، ح وحدثنا عثمان بن أبي شيبة، - واللفظ له - حدثنا جرير، عن الأعمش، عن زيد بن، وهب عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إنها ستكون بعدي أثرة وأمور تنكرونها ‏\"‏ ‏.‏ قالوا يا رسول الله كيف تأمر من أدرك منا ذلك قال ‏\"‏ تؤدون الحق الذي عليكم وتسألون الله الذي لكم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 4776,
			"arabicnumber": "1844.01",
			"text": "حدثنا زهير بن حرب، وإسحاق بن إبراهيم، قال إسحاق أخبرنا وقال، زهير حدثنا جرير، عن الأعمش، عن زيد بن وهب، عن عبد الرحمن بن عبد رب الكعبة، قال دخلت المسجد فإذا عبد الله بن عمرو بن العاص جالس في ظل الكعبة والناس مجتمعون عليه فأتيتهم فجلست إليه فقال كنا مع رسول الله صلى الله عليه وسلم في سفر فنزلنا منزلا فمنا من يصلح خباءه ومنا من ينتضل ومنا من هو في جشره إذ نادى منادي رسول الله صلى الله عليه وسلم الصلاة جامعة ‏.‏ فاجتمعنا إلى رسول الله صلى الله عليه وسلم فقال ‏\"‏ إنه لم يكن نبي قبلي إلا كان حقا عليه أن يدل أمته على خير ما يعلمه لهم وينذرهم شر ما يعلمه لهم وإن أمتكم هذه جعل عافيتها في أولها وسيصيب آخرها بلاء وأمور تنكرونها وتجيء فتنة فيرقق بعضها بعضا وتجيء الفتنة فيقول المؤمن هذه مهلكتي ‏.‏ ثم تنكشف وتجيء الفتنة فيقول المؤمن هذه هذه ‏.‏ فمن أحب أن يزحزح عن النار ويدخل الجنة فلتأته منيته وهو يؤمن بالله واليوم الآخر وليأت إلى الناس الذي يحب أن يؤتى إليه ومن بايع إماما فأعطاه صفقة يده وثمرة قلبه فليطعه إن استطاع فإن جاء آخر ينازعه فاضربوا عنق الآخر ‏\"‏ ‏.‏ فدنوت منه فقلت له أنشدك الله آنت سمعت هذا من رسول الله صلى الله عليه وسلم فأهوى إلى أذنيه وقلبه بيديه وقال سمعته أذناى ووعاه قلبي ‏.‏ فقلت له هذا ابن عمك معاوية يأمرنا أن نأكل أموالنا بيننا بالباطل ونقتل أنفسنا والله يقول ‏{‏ يا أيها الذين آمنوا لا تأكلوا أموالكم بينكم بالباطل إلا أن تكون تجارة عن تراض منكم ولا تقتلوا أنفسكم إن الله كان بكم رحيما‏}‏ قال فسكت ساعة ثم قال أطعه في طاعة الله واعصه في معصية الله ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 4777,
			"arabicnumber": "1844.02",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وابن، نمير وأبو سعيد الأشج قالوا حدثنا وكيع، ح وحدثنا أبو كريب، حدثنا أبو معاوية، كلاهما عن الأعمش، بهذا الإسناد نحوه ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 4778,
			"arabicnumber": "1844.03",
			"text": "وحدثني محمد بن رافع، حدثنا أبو المنذر، إسماعيل بن عمر حدثنا يونس بن، أبي إسحاق الهمداني حدثنا عبد الله بن أبي السفر، عن عامر، عن عبد الرحمن بن عبد، رب الكعبة الصائدي قال رأيت جماعة عند الكعبة ‏.‏ فذكر نحو حديث الأعمش ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 4779,
			"arabicnumber": "1845.01",
			"text": "حدثنا محمد بن المثنى، ومحمد بن بشار، قالا حدثنا محمد بن جعفر، حدثنا شعبة، قال سمعت قتادة، يحدث عن أنس بن مالك، عن أسيد بن حضير، أن رجلا، من الأنصار خلا برسول الله صلى الله عليه وسلم فقال ألا تستعملني كما استعملت فلانا فقال ‏ \"‏ إنكم ستلقون بعدي أثرة فاصبروا حتى تلقوني على الحوض ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 4782,
			"arabicnumber": "1846.01",
			"text": "حدثنا محمد بن المثنى، ومحمد بن بشار، قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن سماك بن حرب، عن علقمة بن وائل الحضرمي، عن أبيه، قال سأل سلمة بن يزيد الجعفي رسول الله صلى الله عليه وسلم فقال يا نبي الله أرأيت إن قامت علينا أمراء يسألونا حقهم ويمنعونا حقنا فما تأمرنا فأعرض عنه ثم سأله فأعرض عنه ثم سأله في الثانية أو في الثالثة فجذبه الأشعث بن قيس وقال ‏ \"‏ اسمعوا وأطيعوا فإنما عليهم ما حملوا وعليكم ما حملتم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 4783,
			"arabicnumber": "1846.02",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا شبابة، حدثنا شعبة، عن سماك، بهذا الإسناد مثله وقال فجذبه الأشعث بن قيس فقال رسول الله صلى الله عليه وسلم ‏ \"‏ اسمعوا وأطيعوا فإنما عليهم ما حملوا وعليكم ما حملتم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 4784,
			"arabicnumber": "1847.01",
			"text": "حدثني محمد بن المثنى، حدثنا الوليد بن مسلم، حدثنا عبد الرحمن بن يزيد بن، جابر حدثني بسر بن عبيد الله الحضرمي، أنه سمع أبا إدريس الخولاني، يقول سمعت حذيفة بن اليمان، يقول كان الناس يسألون رسول الله صلى الله عليه وسلم عن الخير وكنت أسأله عن الشر مخافة أن يدركني فقلت يا رسول الله إنا كنا في جاهلية وشر فجاءنا الله بهذا الخير فهل بعد هذا الخير شر قال ‏\"‏ نعم ‏\"‏ فقلت هل بعد ذلك الشر من خير قال ‏\"‏ نعم وفيه دخن ‏\"‏ ‏.‏ قلت وما دخنه قال ‏\"‏ قوم يستنون بغير سنتي ويهدون بغير هديي تعرف منهم وتنكر ‏\"‏ ‏.‏ فقلت هل بعد ذلك الخير من شر قال ‏\"‏ نعم دعاة على أبواب جهنم من أجابهم إليها قذفوه فيها ‏\"‏ ‏.‏ فقلت يا رسول الله صفهم لنا ‏.‏ قال ‏\"‏ نعم قوم من جلدتنا ويتكلمون بألسنتنا ‏\"‏ ‏.‏ قلت يا رسول الله فما ترى إن أدركني ذلك قال ‏\"‏ تلزم جماعة المسلمين وإمامهم ‏\"‏ ‏.‏ فقلت فإن لم تكن لهم جماعة ولا إمام قال ‏\"‏ فاعتزل تلك الفرق كلها ولو أن تعض على أصل شجرة حتى يدركك الموت وأنت على ذلك ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 4785,
			"arabicnumber": "1847.02",
			"text": "وحدثني محمد بن سهل بن عسكر التميمي، حدثنا يحيى بن حسان، ح وحدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا يحيى، - وهو ابن حسان - حدثنا معاوية، - يعني ابن سلام - حدثنا زيد بن سلام، عن أبي سلام، قال قال حذيفة بن اليمان قلت يا رسول الله إنا كنا بشر فجاء الله بخير فنحن فيه فهل من وراء هذا الخير شر قال نعم ‏.‏ قلت هل وراء ذلك الشر خير قال ‏\"‏ نعم ‏\"‏ ‏.‏ قلت فهل وراء ذلك الخير شر قال ‏\"‏ نعم ‏\"‏ ‏.‏ قلت كيف قال ‏\"‏ يكون بعدي أئمة لا يهتدون بهداى ولا يستنون بسنتي وسيقوم فيهم رجال قلوبهم قلوب الشياطين في جثمان إنس ‏\"‏ ‏.‏ قال قلت كيف أصنع يا رسول الله إن أدركت ذلك قال ‏\"‏ تسمع وتطيع للأمير وإن ضرب ظهرك وأخذ مالك فاسمع وأطع ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 4786,
			"arabicnumber": "1848.01",
			"text": "حدثنا شيبان بن فروخ، حدثنا جرير، - يعني ابن حازم - حدثنا غيلان بن، جرير عن أبي قيس بن رياح، عن أبي هريرة، عن النبي صلى الله عليه وسلم أنه قال ‏ \"‏ من خرج من الطاعة وفارق الجماعة فمات مات ميتة جاهلية ومن قاتل تحت راية عمية يغضب لعصبة أو يدعو إلى عصبة أو ينصر عصبة فقتل فقتلة جاهلية ومن خرج على أمتي يضرب برها وفاجرها ولا يتحاش من مؤمنها ولا يفي لذي عهد عهده فليس مني ولست منه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 4787,
			"arabicnumber": "1848.02",
			"text": "وحدثني عبيد الله بن عمر القواريري، حدثنا حماد بن زيد، حدثنا أيوب، عن غيلان، بن جرير عن زياد بن رياح القيسي، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم بنحو حديث جرير وقال ‏ \"‏ لا يتحاشى من مؤمنها ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 4788,
			"arabicnumber": "1848.03",
			"text": "وحدثني زهير بن حرب، حدثنا عبد الرحمن بن مهدي، حدثنا مهدي بن ميمون، عن غيلان بن جرير، عن زياد بن رياح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من خرج من الطاعة وفارق الجماعة ثم مات مات ميتة جاهلية ومن قتل تحت راية عمية يغضب للعصبة ويقاتل للعصبة فليس من أمتي ومن خرج من أمتي على أمتي يضرب برها وفاجرها لا يتحاش من مؤمنها ولا يفي بذي عهدها فليس مني ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 4789,
			"arabicnumber": "1848.04",
			"text": "وحدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن غيلان بن جرير، بهذا الإسناد ‏.‏ أما ابن المثنى فلم يذكر النبي صلى الله عليه وسلم في الحديث وأما ابن بشار فقال في روايته قال رسول الله صلى الله عليه وسلم بنحو حديثهم ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 4790,
			"arabicnumber": "1849.01",
			"text": "حدثنا حسن بن الربيع، حدثنا حماد بن زيد، عن الجعد أبي عثمان، عن أبي، رجاء عن ابن عباس، يرويه قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من رأى من أميره شيئا يكرهه فليصبر فإنه من فارق الجماعة شبرا فمات فميتة جاهلية ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 4791,
			"arabicnumber": "1849.02",
			"text": "وحدثنا شيبان بن فروخ، حدثنا عبد الوارث، حدثنا الجعد، حدثنا أبو رجاء، العطاردي عن ابن عباس، عن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من كره من أميره شيئا فليصبر عليه فإنه ليس أحد من الناس خرج من السلطان شبرا فمات عليه إلا مات ميتة جاهلية ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 4792,
			"arabicnumber": "1850",
			"text": "حدثنا هريم بن عبد الأعلى، حدثنا المعتمر، قال سمعت أبي يحدث، عن أبي، مجلز عن جندب بن عبد الله البجلي، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من قتل تحت راية عمية يدعو عصبية أو ينصر عصبية فقتلة جاهلية ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 4793,
			"arabicnumber": "1851.01",
			"text": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا عاصم، - وهو ابن محمد بن زيد - عن زيد بن محمد، عن نافع، قال جاء عبد الله بن عمر إلى عبد الله بن مطيع حين كان من أمر الحرة ما كان زمن يزيد بن معاوية فقال اطرحوا لأبي عبد الرحمن وسادة فقال إني لم آتك لأجلس أتيتك لأحدثك حديثا سمعت رسول الله صلى الله عليه وسلم يقوله سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ من خلع يدا من طاعة لقي الله يوم القيامة لا حجة له ومن مات وليس في عنقه بيعة مات ميتة جاهلية ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 4794,
			"arabicnumber": "1851.02",
			"text": "وحدثنا ابن نمير، حدثنا يحيى بن عبد الله بن بكير، حدثنا ليث، عن عبيد الله، بن أبي جعفر عن بكير بن عبد الله بن الأشج، عن نافع، عن ابن عمر، أنه أتى ابن مطيع ‏.‏ فذكر عن النبي صلى الله عليه وسلم نحوه ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 4795,
			"arabicnumber": "1851.03",
			"text": "حدثنا عمرو بن علي، حدثنا ابن مهدي، ح وحدثنا محمد بن عمرو بن جبلة، حدثنا بشر بن عمر، قالا جميعا حدثنا هشام بن سعد، عن زيد بن أسلم، عن أبيه، عن ابن عمر، عن النبي صلى الله عليه وسلم بمعنى حديث نافع عن ابن عمر ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 4796,
			"arabicnumber": "1852.01",
			"text": "حدثني أبو بكر بن نافع ، ومحمد بن بشار ، قال ابن نافع : حدثنا غندر ، وقال ابن بشار : حدثنا محمد بن جعفر ، حدثنا شعبة ، عن زياد بن علاقة ، قال : سمعت عرفجة ، قال : سمعت رسول الله صلى الله عليه وسلم ، يقول : \" إنه ستكون هنات وهنات ، فمن أراد أن يفرق أمر هذه الأمة وهي جميع ، فاضربوه بالسيف كائنا من كان",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 4797,
			"arabicnumber": "1852.02",
			"text": "وحدثنا أحمد بن خراش، حدثنا حبان، حدثنا أبو عوانة، ح وحدثني القاسم بن، زكرياء حدثنا عبيد الله بن موسى، عن شيبان، ح وحدثنا إسحاق بن إبراهيم، أخبرنا المصعب بن المقدام الخثعمي، حدثنا إسرائيل، ح وحدثني حجاج، حدثنا عارم بن الفضل، حدثنا حماد بن زيد، حدثنا عبد الله بن المختار، ورجل، سماه كلهم عن زياد بن علاقة، عن عرفجة، عن النبي صلى الله عليه وسلم بمثله غير أن في حديثهم جميعا ‏ \"‏ فاقتلوه ‏\"‏ ‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 4798,
			"arabicnumber": "1852.03",
			"text": "وحدثني عثمان بن أبي شيبة، حدثنا يونس بن أبي يعفور، عن أبيه، عن عرفجة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ من أتاكم وأمركم جميع على رجل واحد يريد أن يشق عصاكم أو يفرق جماعتكم فاقتلوه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 4799,
			"arabicnumber": "1853",
			"text": "وحدثني وهب بن بقية الواسطي، حدثنا خالد بن عبد الله، عن الجريري، عن أبي، نضرة عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا بويع لخليفتين فاقتلوا الآخر منهما ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 4800,
			"arabicnumber": "1854.01",
			"text": "حدثنا هداب بن خالد الأزدي، حدثنا همام بن يحيى، حدثنا قتادة، عن الحسن، عن ضبة بن محصن، عن أم سلمة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ستكون أمراء فتعرفون وتنكرون فمن عرف برئ ومن أنكر سلم ولكن من رضي وتابع ‏\"‏ ‏.‏ قالوا أفلا نقاتلهم قال ‏\"‏ لا ما صلوا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 4801,
			"arabicnumber": "1854.02",
			"text": "وحدثني أبو غسان المسمعي، ومحمد بن بشار، جميعا عن معاذ، - واللفظ لأبي غسان - حدثنا معاذ، - وهو ابن هشام الدستوائي - حدثني أبي، عن قتادة، حدثنا الحسن، عن ضبة بن محصن العنزي، عن أم سلمة، زوج النبي صلى الله عليه وسلم عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ إنه يستعمل عليكم أمراء فتعرفون وتنكرون فمن كره فقد برئ ومن أنكر فقد سلم ولكن من رضي وتابع ‏\"‏ ‏.‏ قالوا يا رسول الله ألا نقاتلهم قال ‏\"‏ لا ما صلوا ‏\"‏ ‏.‏ أى من كره بقلبه وأنكر بقلبه ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 4802,
			"arabicnumber": "1854.03",
			"text": "وحدثني أبو الربيع العتكي، حدثنا حماد، - يعني ابن زيد - حدثنا المعلى بن، زياد وهشام عن الحسن، عن ضبة بن محصن، عن أم سلمة، قالت قال رسول الله صلى الله عليه وسلم ‏.‏ بنحو ذلك غير أنه قال ‏ \"‏ فمن أنكر فقد برئ ومن كره فقد سلم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 4803,
			"arabicnumber": "1854.04",
			"text": "وحدثناه حسن بن الربيع البجلي، حدثنا ابن المبارك، عن هشام، عن الحسن، عن ضبة بن محصن، عن أم سلمة، قالت قال رسول الله صلى الله عليه وسلم ‏.‏ فذكر مثله إلا قوله ‏ \"‏ ولكن من رضي وتابع ‏\"‏ ‏.‏ لم يذكره ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 4804,
			"arabicnumber": "1855.01",
			"text": "حدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا عيسى بن يونس، حدثنا الأوزاعي، عن يزيد بن يزيد بن جابر، عن رزيق بن حيان، عن مسلم بن قرظة، عن عوف بن مالك، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ خيار أئمتكم الذين تحبونهم ويحبونكم ويصلون عليكم وتصلون عليهم وشرار أئمتكم الذين تبغضونهم ويبغضونكم وتلعنونهم ويلعنونكم ‏\"‏ ‏.‏ قيل يا رسول الله أفلا ننابذهم بالسيف فقال ‏\"‏ لا ما أقاموا فيكم الصلاة وإذا رأيتم من ولاتكم شيئا تكرهونه فاكرهوا عمله ولا تنزعوا يدا من طاعة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 4805,
			"arabicnumber": "1855.02",
			"text": "حدثنا داود بن رشيد، حدثنا الوليد، - يعني ابن مسلم - حدثنا عبد الرحمن بن، يزيد بن جابر أخبرني مولى بني فزارة، - وهو رزيق بن حيان - أنه سمع مسلم بن، قرظة ابن عم عوف بن مالك الأشجعي يقول سمعت عوف بن مالك الأشجعي، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ خيار أئمتكم الذين تحبونهم ويحبونكم وتصلون عليهم ويصلون عليكم وشرار أئمتكم الذين تبغضونهم ويبغضونكم وتلعنونهم ويلعنونكم ‏\"‏ ‏.‏ قالوا قلنا يا رسول الله أفلا ننابذهم عند ذلك قال ‏\"‏ لا ما أقاموا فيكم الصلاة لا ما أقاموا فيكم الصلاة ألا من ولي عليه وال فرآه يأتي شيئا من معصية الله فليكره ما يأتي من معصية الله ولا ينزعن يدا من طاعة ‏\"‏ ‏.‏ قال ابن جابر فقلت - يعني لرزيق - حين حدثني بهذا الحديث آلله يا أبا المقدام لحدثك بهذا أو سمعت هذا من مسلم بن قرظة يقول سمعت عوفا يقول سمعت رسول الله صلى الله عليه وسلم قال فجثا على ركبتيه واستقبل القبلة فقال إي والله الذي لا إله إلا هو لسمعته من مسلم بن قرظة يقول سمعت عوف بن مالك يقول سمعت رسول الله صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 4806,
			"arabicnumber": "1855.03",
			"text": "وحدثنا إسحاق بن موسى الأنصاري، حدثنا الوليد بن مسلم، حدثنا ابن جابر، بهذا الإسناد وقال رزيق مولى بني فزارة ‏.‏ قال مسلم ورواه معاوية بن صالح عن ربيعة بن يزيد، عن مسلم بن قرظة، عن عوف بن مالك، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 4807,
			"arabicnumber": "1856.01",
			"text": "حدثنا قتيبة بن سعيد، حدثنا ليث بن سعد، ح وحدثنا محمد بن رمح، أخبرنا الليث، عن أبي الزبير، عن جابر، قال كنا يوم الحديبية ألفا وأربعمائة فبايعناه وعمر آخذ بيده تحت الشجرة وهي سمرة ‏.‏ وقال بايعناه على ألا نفر ‏.‏ ولم نبايعه على الموت",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 4808,
			"arabicnumber": "1856.02",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا ابن عيينة، ح وحدثنا ابن نمير، حدثنا سفيان، عن أبي الزبير، عن جابر، قال لم نبايع رسول الله صلى الله عليه وسلم على الموت إنما بايعناه على أن لا نفر ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 4809,
			"arabicnumber": "1856.03",
			"text": "وحدثنا محمد بن حاتم، حدثنا حجاج، عن ابن جريج، أخبرني أبو الزبير، سمع جابرا، يسأل كم كانوا يوم الحديبية قال كنا أربع عشرة مائة فبايعناه وعمر آخذ بيده تحت الشجرة وهي سمرة فبايعناه غير جد ابن قيس الأنصاري اختبأ تحت بطن بعيره",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 4810,
			"arabicnumber": "1856.04",
			"text": "وحدثني إبراهيم بن دينار، حدثنا حجاج بن محمد الأعور، مولى سليمان بن مجالد قال قال ابن جريج وأخبرني أبو الزبير، أنه سمع جابرا، يسأل هل بايع النبي صلى الله عليه وسلم بذي الحليفة فقال لا ولكن صلى بها ولم يبايع عند شجرة إلا الشجرة التي بالحديبية ‏.‏ قال ابن جريج وأخبرني أبو الزبير أنه سمع جابر بن عبد الله يقول دعا النبي صلى الله عليه وسلم على بئر الحديبية ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 4811,
			"arabicnumber": "1856.05",
			"text": "حدثنا سعيد بن عمرو الأشعثي، وسويد بن سعيد، وإسحاق بن إبراهيم، وأحمد، بن عبدة - واللفظ لسعيد قال سعيد وإسحاق أخبرنا وقال الآخران، حدثنا سفيان، عن عمرو، عن جابر، قال كنا يوم الحديبية ألفا وأربعمائة فقال لنا النبي صلى الله عليه وسلم ‏ \"‏ أنتم اليوم خير أهل الأرض ‏\"‏ ‏.‏ وقال جابر لو كنت أبصر لأريتكم موضع الشجرة",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 4812,
			"arabicnumber": "1856.06",
			"text": "وحدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن عمرو بن مرة، عن سالم بن أبي الجعد، قال سألت جابر بن عبد الله عن أصحاب، الشجرة فقال لو كنا مائة ألف لكفانا كنا ألفا وخمسمائة ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 4813,
			"arabicnumber": "1856.07",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وابن، نمير قالا حدثنا عبد الله بن إدريس، ح وحدثنا رفاعة بن الهيثم، حدثنا خالد، - يعني الطحان - كلاهما يقول عن حصين، عن سالم بن أبي الجعد، عن جابر، قال لو كنا مائة ألف لكفانا كنا خمس عشرة مائة ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 4814,
			"arabicnumber": "1856.08",
			"text": "وحدثنا عثمان بن أبي شيبة، وإسحاق بن إبراهيم، قال إسحاق أخبرنا وقال، عثمان حدثنا جرير، عن الأعمش، حدثني سالم بن أبي الجعد، قال قلت لجابر كم كنتم يومئذ قال ألفا وأربعمائة ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 4815,
			"arabicnumber": "1857.01",
			"text": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن عمرو، - يعني ابن مرة - حدثني عبد الله بن أبي أوفى، قال كان أصحاب الشجرة ألفا وثلاثمائة وكانت أسلم ثمن المهاجرين ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 4816,
			"arabicnumber": "1857.02",
			"text": "وحدثنا ابن المثنى، حدثنا أبو داود، ح وحدثناه إسحاق بن إبراهيم، أخبرنا النضر بن شميل، جميعا عن شعبة، بهذا الإسناد مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 4817,
			"arabicnumber": "1858.01",
			"text": "وحدثنا يحيى بن يحيى، أخبرنا يزيد بن زريع، عن خالد، عن الحكم بن عبد الله، بن الأعرج عن معقل بن يسار، قال لقد رأيتني يوم الشجرة والنبي صلى الله عليه وسلم يبايع الناس وأنا رافع غصنا من أغصانها عن رأسه ونحن أربع عشرة مائة قال لم نبايعه على الموت ولكن بايعناه على أن لا نفر ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 4818,
			"arabicnumber": "1858.02",
			"text": "وحدثناه يحيى بن يحيى، أخبرنا خالد بن عبد الله، عن يونس، بهذا الإسناد",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 4821,
			"arabicnumber": "1859.03",
			"text": "وحدثني حجاج بن الشاعر، ومحمد بن رافع، قالا حدثنا شبابة، حدثنا شعبة، عن قتادة، عن سعيد بن المسيب، عن أبيه، قال لقد رأيت الشجرة ثم أتيتها بعد فلم أعرفها",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 4822,
			"arabicnumber": "1860.01",
			"text": "وحدثنا قتيبة بن سعيد، حدثنا حاتم، - يعني ابن إسماعيل - عن يزيد بن أبي، عبيد مولى سلمة بن الأكوع قال قلت لسلمة على أى شىء بايعتم رسول الله صلى الله عليه وسلم يوم الحديبية قال على الموت ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 4823,
			"arabicnumber": "1860.02",
			"text": "وحدثناه إسحاق بن إبراهيم، حدثنا حماد بن مسعدة، حدثنا يزيد، عن سلمة، بمثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 4824,
			"arabicnumber": "1861",
			"text": "وحدثنا إسحاق بن إبراهيم، أخبرنا المخزومي، حدثنا وهيب، حدثنا عمرو بن، يحيى عن عباد بن تميم، عن عبد الله بن زيد، قال أتاه آت فقال هذاك ابن حنظلة يبايع الناس فقال على ماذا قال على الموت قال لا أبايع على هذا أحدا بعد رسول الله صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 4825,
			"arabicnumber": "1862",
			"text": "حدثنا قتيبة بن سعيد، حدثنا حاتم، - يعني ابن إسماعيل - عن يزيد بن أبي، عبيد عن سلمة بن الأكوع، أنه دخل على الحجاج فقال يا ابن الأكوع ارتددت على عقبيك تعربت قال لا ولكن رسول الله صلى الله عليه وسلم أذن لي في البدو ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 4826,
			"arabicnumber": "1863.01",
			"text": "حدثنا محمد بن الصباح أبو جعفر، حدثنا إسماعيل بن زكرياء، عن عاصم الأحول، عن أبي عثمان النهدي، حدثني مجاشع بن مسعود السلمي، قال أتيت النبي صلى الله عليه وسلم أبايعه على الهجرة فقال ‏ \"‏ إن الهجرة قد مضت لأهلها ولكن على الإسلام والجهاد والخير ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 4827,
			"arabicnumber": "1863.02",
			"text": "وحدثني سويد بن سعيد، حدثنا علي بن مسهر، عن عاصم، عن أبي عثمان، قال أخبرني مجاشع بن مسعود السلمي، قال جئت بأخي أبي معبد إلى رسول الله صلى الله عليه وسلم بعد الفتح فقلت يا رسول الله بايعه على الهجرة ‏.‏ قال ‏\"‏ قد مضت الهجرة بأهلها ‏\"‏ ‏.‏ قلت فبأى شىء تبايعه قال ‏\"‏ على الإسلام والجهاد والخير ‏\"‏ ‏.‏ قال أبو عثمان فلقيت أبا معبد فأخبرته بقول مجاشع فقال صدق ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 4828,
			"arabicnumber": "1863.03",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن فضيل، عن عاصم، بهذا الإسناد قال فلقيت أخاه فقال صدق مجاشع ‏.‏ ولم يذكر أبا معبد ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 4829,
			"arabicnumber": "1353.03",
			"text": "حدثنا يحيى بن يحيى، وإسحاق بن إبراهيم، قالا أخبرنا جرير، عن منصور، عن مجاهد، عن طاوس، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم يوم الفتح فتح مكة ‏ \"‏ لا هجرة ولكن جهاد ونية وإذا استنفرتم فانفروا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 4830,
			"arabicnumber": "1353.04",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا وكيع، عن سفيان، ح وحدثنا إسحاق بن منصور، وابن، رافع عن يحيى بن آدم، حدثنا مفضل، - يعني ابن مهلهل - ح وحدثنا عبد بن حميد، أخبرنا عبيد الله بن موسى، عن إسرائيل، كلهم عن منصور، بهذا الإسناد ‏.‏ مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 4831,
			"arabicnumber": "1864",
			"text": "وحدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا عبد الله بن حبيب بن أبي، ثابت عن عبد الله بن عبد الرحمن بن أبي حسين، عن عطاء، عن عائشة، قالت سئل رسول الله صلى الله عليه وسلم عن الهجرة فقال ‏ \"‏ لا هجرة بعد الفتح ولكن جهاد ونية وإذا استنفرتم فانفروا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 4832,
			"arabicnumber": "1865.01",
			"text": "وحدثنا أبو بكر بن خلاد الباهلي، حدثنا الوليد بن مسلم، حدثنا عبد الرحمن، بن عمرو الأوزاعي حدثني ابن شهاب الزهري، حدثني عطاء بن يزيد الليثي، أنه حدثهم قال حدثني أبو سعيد الخدري، أن أعرابيا، سأل رسول الله صلى الله عليه وسلم عن الهجرة فقال ‏\"‏ ويحك إن شأن الهجرة لشديد فهل لك من إبل ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ فهل تؤتي صدقتها ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ فاعمل من وراء البحار فإن الله لن يترك من عملك شيئا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 4833,
			"arabicnumber": "1865.02",
			"text": "وحدثناه عبد الله بن عبد الرحمن الدارمي، حدثنا محمد بن يوسف، عن الأوزاعي، بهذا الإسناد ‏.‏ مثله غير أنه قال ‏\"‏ إن الله لن يترك من عملك شيئا ‏\"‏ ‏.‏ وزاد في الحديث قال ‏\"‏ فهل تحلبها يوم وردها ‏\"‏ ‏.‏ قال نعم ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 4834,
			"arabicnumber": "1866.01",
			"text": "حدثني أبو الطاهر، أحمد بن عمرو بن سرح أخبرنا ابن وهب، أخبرني يونس، بن يزيد قال قال ابن شهاب أخبرني عروة بن الزبير، أن عائشة، زوج النبي صلى الله عليه وسلم قالت كانت المؤمنات إذا هاجرن إلى رسول الله صلى الله عليه وسلم يمتحن بقول الله عز وجل ‏{‏ يا أيها النبي إذا جاءك المؤمنات يبايعنك على أن لا يشركن بالله شيئا ولا يسرقن ولا يزنين‏}‏ إلى آخر الآية ‏.‏ قالت عائشة فمن أقر بهذا من المؤمنات فقد أقر بالمحنة وكان رسول الله صلى الله عليه وسلم إذا أقررن بذلك من قولهن قال لهن رسول الله صلى الله عليه وسلم ‏\"‏ انطلقن فقد بايعتكن ‏\"‏ ‏.‏ ولا والله ما مست يد رسول الله صلى الله عليه وسلم يد امرأة قط ‏.‏ غير أنه يبايعهن بالكلام - قالت عائشة - والله ما أخذ رسول الله صلى الله عليه وسلم على النساء قط إلا بما أمره الله تعالى وما مست كف رسول الله صلى الله عليه وسلم كف امرأة قط وكان يقول لهن إذا أخذ عليهن ‏\"‏ قد بايعتكن ‏\"‏ ‏.‏ كلاما ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 4835,
			"arabicnumber": "1866.02",
			"text": "وحدثني هارون بن سعيد الأيلي، وأبو الطاهر، قال أبو الطاهر أخبرنا وقال، هارون حدثنا ابن وهب، حدثني مالك، عن ابن شهاب، عن عروة، أن عائشة، أخبرته عن بيعة النساء، قالت ما مس رسول الله صلى الله عليه وسلم بيده امرأة قط إلا أن يأخذ عليها فإذا أخذ عليها فأعطته قال ‏ \"‏ اذهبي فقد بايعتك ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 4836,
			"arabicnumber": "1867",
			"text": "حدثنا يحيى بن أيوب، وقتيبة، وابن، حجر - واللفظ لابن أيوب - قالوا حدثنا إسماعيل، - وهو ابن جعفر - أخبرني عبد الله بن دينار، أنه سمع عبد الله بن عمر، يقول كنا نبايع رسول الله صلى الله عليه وسلم على السمع والطاعة يقول لنا ‏ \"‏ فيما استطعت ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 4837,
			"arabicnumber": "1868.01",
			"text": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا عبيد الله، عن نافع، عن ابن عمر، قال عرضني رسول الله صلى الله عليه وسلم يوم أحد في القتال وأنا ابن أربع عشرة سنة فلم يجزني وعرضني يوم الخندق وأنا ابن خمس عشرة سنة فأجازني ‏.‏ قال نافع فقدمت على عمر بن عبد العزيز وهو يومئذ خليفة فحدثته هذا الحديث فقال إن هذا لحد بين الصغير والكبير ‏.‏ فكتب إلى عماله أن يفرضوا لمن كان ابن خمس عشرة سنة ومن كان دون ذلك فاجعلوه في العيال ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 4838,
			"arabicnumber": "1868.02",
			"text": "وحدثناه أبو بكر بن أبي شيبة، حدثنا عبد الله بن إدريس، وعبد الرحيم بن، سليمان ح وحدثنا محمد بن المثنى، حدثنا عبد الوهاب، - يعني الثقفي - جميعا عن عبيد، الله بهذا الإسناد غير أن في حديثهم وأنا ابن أربع عشرة سنة فاستصغرني ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 4839,
			"arabicnumber": "1869.01",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن نافع، عن عبد الله بن عمر، قال نهى رسول الله صلى الله عليه وسلم أن يسافر بالقرآن إلى أرض العدو ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 4840,
			"arabicnumber": "1869.02",
			"text": "وحدثنا قتيبة، حدثنا ليث، ح وحدثنا ابن رمح، أخبرنا الليث، عن نافع، عن عبد، الله بن عمر عن رسول الله صلى الله عليه وسلم أنه كان ينهى أن يسافر بالقرآن إلى أرض العدو مخافة أن يناله العدو ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 4841,
			"arabicnumber": "1869.03",
			"text": "وحدثنا أبو الربيع العتكي، وأبو كامل قالا حدثنا حماد، عن أيوب، عن نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا تسافروا بالقرآن فإني لا آمن أن يناله العدو ‏\"‏ ‏.‏ قال أيوب فقد ناله العدو وخاصموكم به ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 4842,
			"arabicnumber": "1869.04",
			"text": "حدثني زهير بن حرب، حدثنا إسماعيل يعني ابن علية، ح وحدثنا ابن أبي عمر، حدثنا سفيان، والثقفي، كلهم عن أيوب، ح وحدثنا ابن رافع، حدثنا ابن أبي فديك، أخبرنا الضحاك، - يعني ابن عثمان - جميعا عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم ‏.‏ في حديث ابن علية والثقفي ‏\"‏ فإني أخاف ‏\"‏ ‏.‏ وفي حديث سفيان وحديث الضحاك بن عثمان ‏\"‏ مخافة أن يناله العدو ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 4843,
			"arabicnumber": "1870.01",
			"text": "حدثنا يحيى بن يحيى التميمي، قال قرأت على مالك عن نافع، عن ابن عمر، ‏.‏ أن رسول الله صلى الله عليه وسلم سابق بالخيل التي قد أضمرت من الحفياء وكان أمدها ثنية الوداع وسابق بين الخيل التي لم تضمر من الثنية إلى مسجد بني زريق وكان ابن عمر فيمن سابق بها ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 4844,
			"arabicnumber": "1870.02",
			"text": "وحدثنا يحيى بن يحيى، ومحمد بن رمح، وقتيبة بن سعيد، عن الليث بن سعد، ح وحدثنا خلف بن هشام، وأبو الربيع، وأبو كامل قالوا حدثنا حماد، - وهو ابن زيد - عن أيوب، ح وحدثنا زهير بن حرب، حدثنا إسماعيل، عن أيوب، ح وحدثنا ابن نمير، حدثنا أبي ح، وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، ح وحدثنا محمد بن المثنى، وعبيد الله بن سعيد، قالا حدثنا يحيى، - وهو القطان - جميعا عن عبيد الله، ح وحدثني علي بن حجر، وأحمد بن عبدة، وابن أبي عمر، قالوا حدثنا سفيان، عن إسماعيل بن أمية، ح وحدثني محمد بن رافع، حدثنا عبد الرزاق، أخبرنا ابن جريج، أخبرني موسى بن عقبة، ح وحدثنا هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني أسامة، - يعني ابن زيد - كل هؤلاء عن نافع، عن ابن عمر، بمعنى حديث مالك عن نافع، ‏.‏ وزاد في حديث أيوب من رواية حماد وابن علية قال عبد الله فجئت سابقا فطفف بي الفرس المسجد ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 4845,
			"arabicnumber": "1871.01",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ الخيل في نواصيها الخير إلى يوم القيامة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 4846,
			"arabicnumber": "1871.02",
			"text": "وحدثنا قتيبة، وابن، رمح عن الليث بن سعد، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، وعبد الله بن نمير، ح وحدثنا ابن نمير، حدثنا أبي ح، وحدثنا عبيد، الله بن سعيد حدثنا يحيى، كلهم عن عبيد الله، ح وحدثنا هارون بن سعيد الأيلي، حدثنا ابن وهب، حدثني أسامة، كلهم عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم ‏.‏ بمثل حديث مالك عن نافع ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 4847,
			"arabicnumber": "1872.01",
			"text": "وحدثنا نصر بن علي الجهضمي، وصالح بن حاتم بن وردان، جميعا عن يزيد، - قال الجهضمي حدثنا يزيد بن زريع، - حدثنا يونس بن عبيد، عن عمرو بن سعيد، عن أبي زرعة بن عمرو بن جرير، عن جرير بن عبد الله، قال رأيت رسول الله صلى الله عليه وسلم يلوي ناصية فرس بإصبعه وهو يقول ‏ \"‏ الخيل معقود بنواصيها الخير إلى يوم القيامة الأجر والغنيمة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 4848,
			"arabicnumber": "1872.02",
			"text": "وحدثني زهير بن حرب، حدثنا إسماعيل بن إبراهيم، ح وحدثنا أبو بكر بن، أبي شيبة حدثنا وكيع، عن سفيان، كلاهما عن يونس، بهذا الإسناد مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 4849,
			"arabicnumber": "1873.01",
			"text": "وحدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا زكرياء، عن عامر، عن عروة البارقي، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ الخيل معقود في نواصيها الخير إلى يوم القيامة الأجر والمغنم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 4850,
			"arabicnumber": "1873.02",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا ابن فضيل، وابن، إدريس عن حصين، عن الشعبي، عن عروة البارقي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الخير معقوص بنواصي الخيل ‏\"‏ ‏.‏ قال فقيل له يا رسول الله بم ذاك قال ‏\"‏ الأجر والمغنم إلى يوم القيامة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 4851,
			"arabicnumber": "1873.03",
			"text": "وحدثناه إسحاق بن إبراهيم، أخبرنا جرير، عن حصين، بهذا الإسناد غير أنه قال عروة بن الجعد ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 4852,
			"arabicnumber": "1873.04",
			"text": "حدثنا يحيى بن يحيى، وخلف بن هشام، وأبو بكر بن أبي شيبة جميعا عن أبي، الأحوص ح وحدثنا إسحاق بن إبراهيم، وابن أبي عمر، كلاهما عن سفيان، جميعا عن شبيب بن غرقدة، عن عروة البارقي، عن النبي صلى الله عليه وسلم ‏.‏ ولم يذكر الأجر والمغنم ‏.‏ وفي حديث سفيان سمع عروة البارقي سمع النبي صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 4853,
			"arabicnumber": "1873.05",
			"text": "وحدثنا عبيد الله بن معاذ، حدثنا أبي ح، وحدثنا ابن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، كلاهما عن شعبة، عن أبي إسحاق، عن العيزار بن حريث، عن عروة، بن الجعد عن النبي صلى الله عليه وسلم بهذا ‏.‏ ولم يذكر ‏ \"‏ الأجر والمغنم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 4854,
			"arabicnumber": "1874.01",
			"text": "وحدثنا عبيد الله بن معاذ، حدثنا أبي ح، وحدثنا محمد بن المثنى، وابن، بشار قالا حدثنا يحيى بن سعيد، كلاهما عن شعبة، عن أبي التياح، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ البركة في نواصي الخيل ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 4855,
			"arabicnumber": "1874.02",
			"text": "وحدثنا يحيى بن حبيب، حدثنا خالد يعني ابن الحارث، ح وحدثني محمد بن، الوليد حدثنا محمد بن جعفر، قالا حدثنا شعبة، عن أبي التياح، سمع أنسا، يحدث عن النبي صلى الله عليه وسلم بمثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 4856,
			"arabicnumber": "1875.01",
			"text": "وحدثنا يحيى بن يحيى، وأبو بكر بن أبي شيبة وزهير بن حرب وأبو كريب قال يحيى أخبرنا وقال الآخرون، حدثنا وكيع، عن سفيان، عن سلم بن عبد الرحمن، عن أبي زرعة، عن أبي هريرة، قال كان رسول الله صلى الله عليه وسلم يكره الشكال من الخيل ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 4857,
			"arabicnumber": "1875.02",
			"text": "وحدثناه محمد بن نمير، حدثنا أبي ح، وحدثني عبد الرحمن بن بشر، حدثنا عبد، الرزاق جميعا عن سفيان، بهذا الإسناد ‏.‏ مثله وزاد في حديث عبد الرزاق والشكال أن يكون الفرس في رجله اليمنى بياض وفي يده اليسرى أو في يده اليمنى ورجله اليسرى ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 4858,
			"arabicnumber": "1875.03",
			"text": "حدثنا محمد بن بشار، حدثنا محمد يعني ابن جعفر، ح وحدثنا محمد بن المثنى، حدثني وهب بن جرير، جميعا عن شعبة، عن عبد الله بن يزيد النخعي، عن أبي زرعة، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏.‏ بمثل حديث وكيع ‏.‏ وفي رواية وهب عن عبد الله بن يزيد ‏.‏ ولم يذكر النخعي ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 4859,
			"arabicnumber": "1876.01",
			"text": "وحدثني زهير بن حرب، حدثنا جرير، عن عمارة، - وهو ابن القعقاع - عن أبي زرعة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ تضمن الله لمن خرج في سبيله لا يخرجه إلا جهادا في سبيلي وإيمانا بي وتصديقا برسلي فهو على ضامن أن أدخله الجنة أو أرجعه إلى مسكنه الذي خرج منه نائلا ما نال من أجر أو غنيمة ‏.‏ والذي نفس محمد بيده ما من كلم يكلم في سبيل الله إلا جاء يوم القيامة كهيئته حين كلم لونه لون دم وريحه مسك والذي نفس محمد بيده لولا أن يشق على المسلمين ما قعدت خلاف سرية تغزو في سبيل الله أبدا ولكن لا أجد سعة فأحملهم ولا يجدون سعة ويشق عليهم أن يتخلفوا عني والذي نفس محمد بيده لوددت أني أغزو في سبيل الله فأقتل ثم أغزو فأقتل ثم أغزو فأقتل ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 4860,
			"arabicnumber": "1876.02",
			"text": "وحدثناه أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا ابن فضيل، عن عمارة، بهذا الإسناد ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 4861,
			"arabicnumber": "1876.03",
			"text": "وحدثنا يحيى بن يحيى، أخبرنا المغيرة بن عبد الرحمن الحزامي، عن أبي الزناد، عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ تكفل الله لمن جاهد في سبيله لا يخرجه من بيته إلا جهاد في سبيله وتصديق كلمته - بأن يدخله الجنة أو يرجعه إلى مسكنه الذي خرج منه مع ما نال من أجر أو غنيمة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 4862,
			"arabicnumber": "1876.04",
			"text": "حدثنا عمرو الناقد، وزهير بن حرب، قالا حدثنا سفيان بن عيينة، عن أبي الزناد، عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ لا يكلم أحد في سبيل الله - والله أعلم بمن يكلم في سبيله - إلا جاء يوم القيامة وجرحه يثعب اللون لون دم والريح ريح مسك ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 4863,
			"arabicnumber": "1876.05",
			"text": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ كل كلم يكلمه المسلم في سبيل الله ثم تكون يوم القيامة كهيئتها إذا طعنت تفجر دما اللون لون دم والعرف عرف المسك ‏\"‏ ‏.‏ وقال رسول الله صلى الله عليه وسلم ‏\"‏ والذي نفس محمد في يده لولا أن أشق على المؤمنين ما قعدت خلف سرية تغزو في سبيل الله ولكن لا أجد سعة فأحملهم ولا يجدون سعة فيتبعوني ولا تطيب أنفسهم أن يقعدوا بعدي ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 4864,
			"arabicnumber": "1876.06",
			"text": "وحدثنا ابن أبي عمر، حدثنا سفيان، عن أبي الزناد، عن الأعرج، عن أبي هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لولا أن أشق على المؤمنين ما قعدت خلاف سرية ‏\"‏ ‏.‏ بمثل حديثهم ‏.‏ وبهذا الإسناد ‏\"‏ والذي نفسي بيده لوددت أني أقتل في سبيل الله ثم أحيى ‏\"‏ ‏.‏ بمثل حديث أبي زرعة عن أبي هريرة ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 4865,
			"arabicnumber": "1876.07",
			"text": "وحدثنا محمد بن المثنى، حدثنا عبد الوهاب يعني الثقفي، ح وحدثنا أبو بكر، بن أبي شيبة حدثنا أبو معاوية، ح وحدثنا ابن أبي عمر، حدثنا مروان بن معاوية، كلهم عن يحيى بن سعيد، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لولا أن أشق على أمتي لأحببت أن لا أتخلف خلف سرية ‏\"‏ ‏.‏ نحو حديثهم ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 4866,
			"arabicnumber": "1876.08",
			"text": "حدثني زهير بن حرب، حدثنا جرير، عن سهيل، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ تضمن الله لمن خرج في سبيله - إلى قوله - ما تخلفت خلاف سرية تغزو في سبيل الله تعالى ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 4867,
			"arabicnumber": "1877.01",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، عن شعبة، عن قتادة، وحميد، عن أنس بن مالك، عن النبي صلى الله عليه وسلم قال ‏ \"‏ ما من نفس تموت لها عند الله خير يسرها أنها ترجع إلى الدنيا ولا أن لها الدنيا وما فيها إلا الشهيد فإنه يتمنى أن يرجع فيقتل في الدنيا لما يرى من فضل الشهادة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 4868,
			"arabicnumber": "1877.02",
			"text": "وحدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن قتادة، قال سمعت أنس بن مالك، يحدث عن النبي صلى الله عليه وسلم قال ‏ \"‏ ما من أحد يدخل الجنة يحب أن يرجع إلى الدنيا وأن له ما على الأرض من شىء غير الشهيد فإنه يتمنى أن يرجع فيقتل عشر مرات لما يرى من الكرامة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 4869,
			"arabicnumber": "1878.01",
			"text": "حدثنا سعيد بن منصور، حدثنا خالد بن عبد الله الواسطي، عن سهيل بن أبي، صالح عن أبيه، عن أبي هريرة، قال قيل للنبي صلى الله عليه وسلم ما يعدل الجهاد في سبيل الله عز وجل قال ‏\"‏ لا تستطيعونه ‏\"‏ ‏.‏ قال فأعادوا عليه مرتين أو ثلاثا كل ذلك يقول ‏\"‏ لا تستطيعونه ‏\"‏ ‏.‏ وقال في الثالثة ‏\"‏ مثل المجاهد في سبيل الله كمثل الصائم القائم القانت بآيات الله لا يفتر من صيام ولا صلاة حتى يرجع المجاهد في سبيل الله تعالى ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 4870,
			"arabicnumber": "1878.02",
			"text": "حدثنا قتيبة بن سعيد، حدثنا أبو عوانة، ح وحدثني زهير بن حرب، حدثنا جرير، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو معاوية، كلهم عن سهيل، بهذا الإسناد نحوه ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 4871,
			"arabicnumber": "1879.01",
			"text": "حدثني حسن بن علي الحلواني، حدثنا أبو توبة، حدثنا معاوية بن سلام، عن زيد بن سلام، أنه سمع أبا سلام، قال حدثني النعمان بن بشير، قال كنت عند منبر رسول الله صلى الله عليه وسلم فقال رجل ما أبالي أن لا أعمل عملا بعد الإسلام إلا أن أسقي الحاج ‏.‏ وقال آخر ما أبالي أن لا أعمل عملا بعد الإسلام إلا أن أعمر المسجد الحرام ‏.‏ وقال آخر الجهاد في سبيل الله أفضل مما قلتم ‏.‏ فزجرهم عمر وقال لا ترفعوا أصواتكم عند منبر رسول الله صلى الله عليه وسلم وهو يوم الجمعة ولكن إذا صليت الجمعة دخلت فاستفتيته فيما اختلفتم فيه ‏.‏ فأنزل الله عز وجل ‏{‏ أجعلتم سقاية الحاج وعمارة المسجد الحرام كمن آمن بالله واليوم الآخر‏}‏ الآية إلى آخرها ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 4872,
			"arabicnumber": "1879.02",
			"text": "وحدثنيه عبد الله بن عبد الرحمن الدارمي، حدثنا يحيى بن حسان، حدثنا معاوية، أخبرني زيد، أنه سمع أبا سلام، قال حدثني النعمان بن بشير، قال كنت عند منبر رسول الله صلى الله عليه وسلم ‏.‏ بمثل حديث أبي توبة ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 4873,
			"arabicnumber": "1880",
			"text": "حدثنا عبد الله بن مسلمة بن قعنب، حدثنا حماد بن سلمة، عن ثابت، عن أنس، بن مالك قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لغدوة في سبيل الله أو روحة خير من الدنيا وما فيها ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 4874,
			"arabicnumber": "1881.01",
			"text": "حدثنا يحيى بن يحيى، أخبرنا عبد العزيز بن أبي حازم، عن أبيه، عن سهل، بن سعد الساعدي عن رسول الله صلى الله عليه وسلم قال ‏ \"‏ والغدوة يغدوها العبد في سبيل الله خير من الدنيا وما فيها ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 4875,
			"arabicnumber": "1881.02",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، قالا حدثنا وكيع، عن سفيان، عن أبي حازم، عن سهل بن سعد الساعدي، عن النبي صلى الله عليه وسلم قال ‏ \"‏ غدوة أو روحة في سبيل الله خير من الدنيا وما فيها ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 4876,
			"arabicnumber": "1882",
			"text": "حدثنا ابن أبي عمر، حدثنا مروان بن معاوية، عن يحيى بن سعيد، عن ذكوان، بن أبي صالح عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لولا أن رجالا من أمتي ‏\"‏ ‏.‏ وساق الحديث وقال فيه ‏\"‏ ولروحة في سبيل الله أو غدوة خير من الدنيا وما فيها ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 4877,
			"arabicnumber": "1883.01",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، وزهير بن حرب، - واللفظ لأبي بكر وإسحاق - قال إسحاق أخبرنا وقال الآخران حدثنا المقرئ عبد الله بن يزيد عن سعيد بن أبي أيوب حدثني شرحبيل بن شريك المعافري عن أبي عبد الرحمن الحبلي قال سمعت أبا أيوب يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ غدوة في سبيل الله أو روحة خير مما طلعت عليه الشمس وغربت ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 4878,
			"arabicnumber": "1883.02",
			"text": "حدثني محمد بن عبد الله بن قهزاذ، حدثنا علي بن الحسن، عن عبد الله بن المبارك، أخبرنا سعيد بن أبي أيوب، وحيوة بن شريح، قال كل واحد منهما حدثني شرحبيل بن، شريك عن أبي عبد الرحمن الحبلي، أنه سمع أبا أيوب الأنصاري، يقول قال رسول الله صلى الله عليه وسلم بمثله سواء ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 4879,
			"arabicnumber": "1884",
			"text": "حدثنا سعيد بن منصور، حدثنا عبد الله بن وهب، حدثني أبو هانئ الخولاني، عن أبي عبد الرحمن الحبلي، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يا أبا سعيد من رضي بالله ربا وبالإسلام دينا وبمحمد نبيا وجبت له الجنة ‏\"‏ ‏.‏ فعجب لها أبو سعيد فقال أعدها على يا رسول الله ففعل ثم قال ‏\"‏ وأخرى يرفع بها العبد مائة درجة في الجنة ما بين كل درجتين كما بين السماء والأرض ‏\"‏ ‏.‏ قال وما هي يا رسول الله قال ‏\"‏ الجهاد في سبيل الله الجهاد في سبيل الله ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 4880,
			"arabicnumber": "1885.01",
			"text": "حدثنا قتيبة بن سعيد، حدثنا ليث، عن سعيد بن أبي سعيد، عن عبد الله بن أبي، قتادة عن أبي قتادة، أنه سمعه يحدث، عن رسول الله صلى الله عليه وسلم أنه قام فيهم فذكر لهم ‏\"‏ أن الجهاد في سبيل الله والإيمان بالله أفضل الأعمال ‏\"‏ ‏.‏ فقام رجل فقال يا رسول الله أرأيت إن قتلت في سبيل الله تكفر عني خطاياى فقال له رسول الله صلى الله عليه وسلم ‏\"‏ نعم إن قتلت في سبيل الله وأنت صابر محتسب مقبل غير مدبر ‏\"‏ ‏.‏ ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ كيف قلت ‏\"‏ ‏.‏ قال أرأيت إن قتلت في سبيل الله أتكفر عني خطاياى فقال رسول الله صلى الله عليه وسلم ‏\"‏ نعم وأنت صابر محتسب مقبل غير مدبر إلا الدين فإن جبريل عليه السلام قال لي ذلك ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 4881,
			"arabicnumber": "1885.02",
			"text": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن المثنى، قالا حدثنا يزيد بن هارون، أخبرنا يحيى، - يعني ابن سعيد - عن سعيد بن أبي سعيد المقبري، عن عبد الله بن أبي قتادة، عن أبيه، قال جاء رجل إلى رسول الله صلى الله عليه وسلم فقال أرأيت إن قتلت في سبيل الله بمعنى حديث الليث ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 4882,
			"arabicnumber": "1885.03",
			"text": "وحدثنا سعيد بن منصور، حدثنا سفيان، عن عمرو بن دينار، عن محمد بن قيس، ح قال وحدثنا محمد بن عجلان، عن محمد بن قيس، عن عبد الله بن أبي قتادة، عن أبيه، عن النبي صلى الله عليه وسلم يزيد أحدهما على صاحبه أن رجلا أتى النبي صلى الله عليه وسلم وهو على المنبر فقال أرأيت إن ضربت بسيفي ‏.‏ بمعنى حديث المقبري ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 4883,
			"arabicnumber": "1886.01",
			"text": "حدثنا زكرياء بن يحيى بن صالح المصري، حدثنا المفضل، - يعني ابن فضالة - عن عياش، - وهو ابن عباس القتباني - عن عبد الله بن يزيد أبي عبد الرحمن الحبلي، عن عبد الله بن عمرو بن العاص، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ يغفر للشهيد كل ذنب إلا الدين ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 4884,
			"arabicnumber": "1886.02",
			"text": "وحدثني زهير بن حرب، حدثنا عبد الله بن يزيد المقرئ، حدثنا سعيد بن أبي، أيوب حدثني عياش بن عباس القتباني، عن أبي عبد الرحمن الحبلي، عن عبد الله بن، عمرو بن العاص أن النبي صلى الله عليه وسلم قال ‏ \"‏ القتل في سبيل الله يكفر كل شىء إلا الدين ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 4885,
			"arabicnumber": "1887",
			"text": "حدثنا يحيى بن يحيى، وأبو بكر بن أبي شيبة كلاهما عن أبي معاوية، ح وحدثنا إسحاق بن إبراهيم، أخبرنا جرير، وعيسى بن يونس، جميعا عن الأعمش، ح وحدثنا محمد بن عبد الله بن نمير، - واللفظ له - حدثنا أسباط، وأبو معاوية قالا حدثنا الأعمش، عن عبد الله بن مرة، عن مسروق، قال سألنا عبد الله عن هذه الآية، ‏{‏ ولا تحسبن الذين قتلوا في سبيل الله أمواتا بل أحياء عند ربهم يرزقون‏}‏ قال أما إنا قد سألنا عن ذلك فقال ‏\"‏ أرواحهم في جوف طير خضر لها قناديل معلقة بالعرش تسرح من الجنة حيث شاءت ثم تأوي إلى تلك القناديل فاطلع إليهم ربهم اطلاعة فقال هل تشتهون شيئا قالوا أى شىء نشتهي ونحن نسرح من الجنة حيث شئنا ففعل ذلك بهم ثلاث مرات فلما رأوا أنهم لن يتركوا من أن يسألوا قالوا يا رب نريد أن ترد أرواحنا في أجسادنا حتى نقتل في سبيلك مرة أخرى ‏.‏ فلما رأى أن ليس لهم حاجة تركوا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 4886,
			"arabicnumber": "1888.01",
			"text": "حدثنا منصور بن أبي مزاحم، حدثنا يحيى بن حمزة، عن محمد بن الوليد الزبيدي، عن الزهري، عن عطاء بن يزيد الليثي، عن أبي سعيد الخدري، أن رجلا، أتى النبي صلى الله عليه وسلم فقال أى الناس أفضل فقال ‏\"‏ رجل يجاهد في سبيل الله بماله ونفسه ‏\"‏ قال ثم من قال ‏\"‏ مؤمن في شعب من الشعاب يعبد الله ربه ويدع الناس من شره ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 4887,
			"arabicnumber": "1888.02",
			"text": "حدثنا عبد بن حميد، أخبرنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن عطاء، بن يزيد الليثي عن أبي سعيد، قال قال رجل أى الناس أفضل يا رسول الله قال ‏\"‏ مؤمن يجاهد بنفسه وماله في سبيل الله ‏\"‏ ‏.‏ قال ثم من قال ‏\"‏ ثم رجل معتزل في شعب من الشعاب يعبد ربه ويدع الناس من شره ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 4888,
			"arabicnumber": "1888.03",
			"text": "وحدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا محمد بن يوسف، عن الأوزاعي، عن ابن شهاب، بهذا الإسناد فقال ‏\"‏ ورجل في شعب ‏\"‏ ‏.‏ ولم يقل ‏\"‏ ثم رجل ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 4889,
			"arabicnumber": "1889.01",
			"text": "حدثنا يحيى بن يحيى التميمي، حدثنا عبد العزيز بن أبي حازم، عن أبيه، عن بعجة، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم أنه قال ‏ \"‏ من خير معاش الناس لهم رجل ممسك عنان فرسه في سبيل الله يطير على متنه كلما سمع هيعة أو فزعة طار عليه يبتغي القتل والموت مظانه أو رجل في غنيمة في رأس شعفة من هذه الشعف أو بطن واد من هذه الأودية يقيم الصلاة ويؤتي الزكاة ويعبد ربه حتى يأتيه اليقين ليس من الناس إلا في خير ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 4890,
			"arabicnumber": "1889.02",
			"text": "وحدثناه قتيبة بن سعيد، عن عبد العزيز بن أبي حازم، ويعقوب، - يعني ابن عبد الرحمن القاري - كلاهما عن أبي حازم، بهذا الإسناد ‏.‏ مثله وقال عن بعجة بن، عبد الله بن بدر وقال ‏ \"‏ في شعبة من هذه الشعاب ‏\"‏ ‏.‏ خلاف رواية يحيى ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 4891,
			"arabicnumber": "1889.03",
			"text": "وحدثناه أبو بكر بن أبي شيبة، وزهير بن حرب، و أبو كريب قالوا حدثنا وكيع، عن أسامة بن زيد، عن بعجة بن عبد الله الجهني، عن أبي هريرة، عن النبي صلى الله عليه وسلم بمعنى حديث أبي حازم عن بعجة وقال ‏ \"‏ في شعب من الشعاب ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 187
			}
		},
		{
			"hadithnumber": 4892,
			"arabicnumber": "1890.01",
			"text": "حدثنا محمد بن أبي عمر المكي، حدثنا سفيان، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يضحك الله إلى رجلين يقتل أحدهما الآخر كلاهما يدخل الجنة ‏\"‏ ‏.‏ فقالوا كيف يا رسول الله قال ‏\"‏ يقاتل هذا في سبيل الله عز وجل فيستشهد ثم يتوب الله على القاتل فيسلم فيقاتل في سبيل الله عز وجل فيستشهد ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 188
			}
		},
		{
			"hadithnumber": 4893,
			"arabicnumber": "1890.02",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، وأبو كريب قالوا حدثنا وكيع، عن سفيان، عن أبي الزناد، بهذا الإسناد مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 189
			}
		},
		{
			"hadithnumber": 4894,
			"arabicnumber": "1890.03",
			"text": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ يضحك الله لرجلين يقتل أحدهما الآخر كلاهما يدخل الجنة ‏\"‏ قالوا كيف يا رسول الله قال ‏\"‏ يقتل هذا فيلج الجنة ثم يتوب الله على الآخر فيهديه إلى الإسلام ثم يجاهد في سبيل الله فيستشهد ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 190
			}
		},
		{
			"hadithnumber": 4895,
			"arabicnumber": "1891.01",
			"text": "حدثنا يحيى بن أيوب، وقتيبة، وعلي بن حجر، قالوا حدثنا إسماعيل، - يعنون ابن جعفر - عن العلاء، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا يجتمع كافر وقاتله في النار أبدا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 191
			}
		},
		{
			"hadithnumber": 4896,
			"arabicnumber": "1891.02",
			"text": "حدثنا عبد الله بن عون الهلالي، حدثنا أبو إسحاق الفزاري، إبراهيم بن محمد عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يجتمعان في النار اجتماعا يضر أحدهما الآخر ‏\"‏ ‏.‏ قيل من هم يا رسول الله قال ‏\"‏ مؤمن قتل كافرا ثم سدد ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 192
			}
		},
		{
			"hadithnumber": 4897,
			"arabicnumber": "1892.01",
			"text": "حدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا جرير، عن الأعمش، عن أبي عمرو، الشيباني عن أبي مسعود الأنصاري، قال جاء رجل بناقة مخطومة فقال هذه في سبيل الله ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏ \"‏ لك بها يوم القيامة سبعمائة ناقة كلها مخطومة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 193
			}
		},
		{
			"hadithnumber": 4898,
			"arabicnumber": "1892.02",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، عن زائدة، ح وحدثني بشر بن، خالد حدثنا محمد، - يعني ابن جعفر - حدثنا شعبة، كلاهما عن الأعمش، بهذا الإسناد ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 194
			}
		},
		{
			"hadithnumber": 4899,
			"arabicnumber": "1893.01",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب وابن أبي عمر - واللفظ لأبي كريب - قالوا حدثنا أبو معاوية، عن الأعمش، عن أبي عمرو الشيباني، عن أبي مسعود الأنصاري، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال إني أبدع بي فاحملني فقال ‏\"‏ ما عندي ‏\"‏ ‏.‏ فقال رجل يا رسول الله أنا أدله على من يحمله فقال رسول الله صلى الله عليه وسلم ‏\"‏ من دل على خير فله مثل أجر فاعله ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 195
			}
		},
		{
			"hadithnumber": 4900,
			"arabicnumber": "1893.02",
			"text": "وحدثنا إسحاق بن إبراهيم، أخبرنا عيسى بن يونس، ح وحدثني بشر بن خالد، أخبرنا محمد بن جعفر، عن شعبة، ح وحدثني محمد بن رافع، حدثنا عبد الرزاق، أخبرنا سفيان، كلهم عن الأعمش، بهذا الإسناد ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 196
			}
		},
		{
			"hadithnumber": 4901,
			"arabicnumber": "1894",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا عفان، حدثنا حماد بن سلمة، حدثنا ثابت، عن أنس بن مالك، ح وحدثني أبو بكر بن نافع، - واللفظ له - حدثنا بهز، حدثنا حماد بن سلمة، حدثنا ثابت، عن أنس بن مالك، أن فتى، من أسلم قال يا رسول الله إني أريد الغزو وليس معي ما أتجهز قال ‏ \"‏ ائت فلانا فإنه قد كان تجهز فمرض ‏\"‏ ‏.‏ فأتاه فقال إن رسول الله صلى الله عليه وسلم يقرئك السلام ويقول أعطني الذي تجهزت به قال يا فلانة أعطيه الذي تجهزت به ولا تحبسي عنه شيئا فوالله لا تحبسي منه شيئا فيبارك لك فيه ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 197
			}
		},
		{
			"hadithnumber": 4902,
			"arabicnumber": "1895.01",
			"text": "وحدثنا سعيد بن منصور، وأبو الطاهر، قال أبو الطاهر أخبرنا ابن وهب، وقال، سعيد حدثنا عبد الله بن وهب، أخبرني عمرو بن الحارث، عن بكير بن الأشج، عن بسر، بن سعيد عن زيد بن خالد الجهني، عن رسول الله صلى الله عليه وسلم أنه قال ‏ \"‏ من جهز غازيا في سبيل الله فقد غزا ومن خلفه في أهله بخير فقد غزا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 198
			}
		},
		{
			"hadithnumber": 4903,
			"arabicnumber": "1895.02",
			"text": "حدثنا أبو الربيع الزهراني، حدثنا يزيد، - يعني ابن زريع - حدثنا حسين، المعلم حدثنا يحيى بن أبي كثير، عن أبي سلمة بن عبد الرحمن، عن بسر بن سعيد، عن زيد بن خالد الجهني، قال قال نبي الله صلى الله عليه وسلم ‏ \"‏ من جهز غازيا فقد غزا ومن خلف غازيا في أهله فقد غزا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 199
			}
		},
		{
			"hadithnumber": 4904,
			"arabicnumber": "1896.01",
			"text": "وحدثنا زهير بن حرب، حدثنا إسماعيل ابن علية، عن علي بن المبارك، حدثنا يحيى بن أبي كثير، حدثني أبو سعيد، مولى المهري عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم بعث بعثا إلى بني لحيان - من هذيل - فقال ‏ \"‏ لينبعث من كل رجلين أحدهما والأجر بينهما ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 200
			}
		},
		{
			"hadithnumber": 4907,
			"arabicnumber": "1896.04",
			"text": "وحدثنا سعيد بن منصور، حدثنا عبد الله بن وهب، أخبرني عمرو بن الحارث، عن يزيد بن أبي حبيب، عن يزيد بن أبي سعيد، مولى المهري عن أبيه، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم بعث إلى بني لحيان ‏\"‏ ليخرج من كل رجلين رجل ‏\"‏ ‏.‏ ثم قال للقاعد ‏\"‏ أيكم خلف الخارج في أهله وماله بخير كان له مثل نصف أجر الخارج ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 202
			}
		},
		{
			"hadithnumber": 4908,
			"arabicnumber": "1897.01",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن سفيان، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ حرمة نساء المجاهدين على القاعدين كحرمة أمهاتهم وما من رجل من القاعدين يخلف رجلا من المجاهدين فى أهله فيخونه فيهم إلا وقف له يوم القيامة فيأخذ من عمله ما شاء فما ظنكم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 203
			}
		},
		{
			"hadithnumber": 4909,
			"arabicnumber": "1897.02",
			"text": "وحدثني محمد بن رافع، حدثنا يحيى بن آدم، حدثنا مسعر، عن علقمة بن مرثد، عن ابن بريدة، عن أبيه، قال قال - يعني النبي صلى الله عليه وسلم ‏.‏ بمعنى حديث الثوري ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 204
			}
		},
		{
			"hadithnumber": 4910,
			"arabicnumber": "1897.03",
			"text": "وحدثناه سعيد بن منصور، حدثنا سفيان، عن قعنب، عن علقمة بن مرثد، بهذا الإسناد ‏\"‏ فقال فخذ من حسناته ما شئت ‏\"‏ ‏.‏ فالتفت إلينا رسول الله صلى الله عليه وسلم فقال ‏\"‏ فما ظنكم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 205
			}
		},
		{
			"hadithnumber": 4911,
			"arabicnumber": "1898.01",
			"text": "حدثنا محمد بن المثنى، ومحمد بن بشار، - واللفظ لابن المثنى - قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن أبي إسحاق، أنه سمع البراء، يقول في هذه الآية لا يستوي القاعدون من المؤمنين والمجاهدون في سبيل الله فأمر رسول الله صلى الله عليه وسلم زيدا فجاء بكتف يكتبها فشكا إليه ابن أم مكتوم ضرارته فنزلت ‏{‏ لا يستوي القاعدون من المؤمنين غير أولي الضرر‏}‏ قال شعبة وأخبرني سعد بن إبراهيم عن رجل عن زيد بن ثابت في هذه الآية لا يستوي القاعدون من المؤمنين بمثل حديث البراء وقال ابن بشار في روايته سعد بن إبراهيم عن أبيه عن رجل عن زيد بن ثابت ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 206
			}
		},
		{
			"hadithnumber": 4912,
			"arabicnumber": "1898.02",
			"text": "وحدثنا أبو كريب، حدثنا ابن بشر، عن مسعر، حدثني أبو إسحاق، عن البراء، قال لما نزلت ‏{‏ لا يستوي القاعدون من المؤمنين‏}‏ كلمه ابن أم مكتوم فنزلت ‏{‏ غير أولي الضرر‏}‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 207
			}
		},
		{
			"hadithnumber": 4913,
			"arabicnumber": "1899",
			"text": "حدثنا سعيد بن عمرو الأشعثي، وسويد بن سعيد، - واللفظ لسعيد - أخبرنا سفيان، عن عمرو، سمع جابرا، يقول قال رجل أين أنا يا، رسول الله إن قتلت قال ‏ \"‏ في الجنة ‏\"‏ ‏.‏ فألقى تمرات كن في يده ثم قاتل حتى قتل ‏.‏ وفي حديث سويد قال رجل للنبي صلى الله عليه وسلم يوم أحد ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 208
			}
		},
		{
			"hadithnumber": 4914,
			"arabicnumber": "1900",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، عن زكرياء، عن أبي إسحاق، عن البراء، قال جاء رجل من بني النبيت إلى النبي صلى الله عليه وسلم ح وحدثنا أحمد بن جناب المصيصي حدثنا عيسى - يعني ابن يونس - عن زكرياء عن أبي إسحاق عن البراء قال جاء رجل من بني النبيت - قبيل من الأنصار - فقال أشهد أن لا إله إلا الله وأنك عبده ورسوله ‏.‏ ثم تقدم فقاتل حتى قتل فقال النبي صلى الله عليه وسلم ‏ \"‏ عمل هذا يسيرا وأجر كثيرا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 209
			}
		},
		{
			"hadithnumber": 4915,
			"arabicnumber": "1901",
			"text": "حدثنا أبو بكر بن النضر بن أبي النضر، وهارون بن عبد الله، ومحمد بن رافع، وعبد بن حميد - وألفاظهم متقاربة - قالوا حدثنا هاشم بن القاسم، حدثنا سليمان، - وهو ابن المغيرة - عن ثابت، عن أنس بن مالك، قال بعث رسول الله صلى الله عليه وسلم بسيسة عينا ينظر ما صنعت عير أبي سفيان فجاء وما في البيت أحد غيري وغير رسول الله صلى الله عليه وسلم قال لا أدري ما استثنى بعض نسائه قال فحدثه الحديث قال فخرج رسول الله صلى الله عليه وسلم فتكلم فقال ‏\"‏ إن لنا طلبة فمن كان ظهره حاضرا فليركب معنا ‏\"‏ ‏.‏ فجعل رجال يستأذنونه في ظهرانهم في علو المدينة فقال ‏\"‏ لا إلا من كان ظهره حاضرا ‏\"‏ ‏.‏ فانطلق رسول الله صلى الله عليه وسلم وأصحابه حتى سبقوا المشركين إلى بدر وجاء المشركون فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا يقدمن أحد منكم إلى شىء حتى أكون أنا دونه ‏\"‏ ‏.‏ فدنا المشركون فقال رسول الله صلى الله عليه وسلم ‏\"‏ قوموا إلى جنة عرضها السموات والأرض ‏\"‏ ‏.‏ قال يقول عمير بن الحمام الأنصاري يا رسول الله جنة عرضها السموات والأرض قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال بخ بخ ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما يحملك على قولك بخ بخ ‏\"‏ ‏.‏ قال لا والله يا رسول الله إلا رجاءة أن أكون من أهلها ‏.‏ قال ‏\"‏ فإنك من أهلها ‏\"‏ ‏.‏ فأخرج تمرات من قرنه فجعل يأكل منهن ثم قال لئن أنا حييت حتى آكل تمراتي هذه إنها لحياة طويلة - قال - فرمى بما كان معه من التمر ‏.‏ ثم قاتلهم حتى قتل ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 210
			}
		},
		{
			"hadithnumber": 4916,
			"arabicnumber": "1902",
			"text": "حدثنا يحيى بن يحيى التميمي، وقتيبة بن سعيد، - واللفظ ليحيى - قال قتيبة حدثنا وقال، يحيى أخبرنا جعفر بن سليمان، عن أبي عمران الجوني، عن أبي بكر بن، عبد الله بن قيس عن أبيه، قال سمعت أبي وهو، بحضرة العدو يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن أبواب الجنة تحت ظلال السيوف ‏\"‏ ‏.‏ فقام رجل رث الهيئة فقال يا أبا موسى آنت سمعت رسول الله صلى الله عليه وسلم يقول هذا قال نعم ‏.‏ قال فرجع إلى أصحابه فقال أقرأ عليكم السلام ‏.‏ ثم كسر جفن سيفه فألقاه ثم مشى بسيفه إلى العدو فضرب به حتى قتل ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 211
			}
		},
		{
			"hadithnumber": 4917,
			"arabicnumber": "677.11",
			"text": "حدثنا محمد بن حاتم، حدثنا عفان، حدثنا حماد، أخبرنا ثابت، عن أنس بن مالك، قال جاء ناس إلى النبي صلى الله عليه وسلم فقالوا أن ابعث معنا رجالا يعلمونا القرآن والسنة ‏.‏ فبعث إليهم سبعين رجلا من الأنصار يقال لهم القراء فيهم خالي حرام يقرءون القرآن ويتدارسون بالليل يتعلمون وكانوا بالنهار يجيئون بالماء فيضعونه في المسجد ويحتطبون فيبيعونه ويشترون به الطعام لأهل الصفة وللفقراء فبعثهم النبي صلى الله عليه وسلم إليهم فعرضوا لهم فقتلوهم قبل أن يبلغوا المكان ‏.‏ فقالوا اللهم بلغ عنا نبينا أنا قد لقيناك فرضينا عنك ورضيت عنا - قال - وأتى رجل حراما خال أنس من خلفه فطعنه برمح حتى أنفذه ‏.‏ فقال حرام فزت ورب الكعبة فقال رسول الله صلى الله عليه وسلم لأصحابه ‏ \"‏ إن إخوانكم قد قتلوا وإنهم قالوا اللهم بلغ عنا نبينا أنا قد لقيناك فرضينا عنك ورضيت عنا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 212
			}
		},
		{
			"hadithnumber": 4918,
			"arabicnumber": "1903",
			"text": "وحدثني محمد بن حاتم، حدثنا بهز، حدثنا سليمان بن المغيرة، عن ثابت، قال قال أنس عمي الذي سميت به لم يشهد مع رسول الله صلى الله عليه وسلم بدرا - قال - فشق عليه قال أول مشهد شهده رسول الله صلى الله عليه وسلم غيبت عنه وإن أراني الله مشهدا فيما بعد مع رسول الله صلى الله عليه وسلم ليراني الله ما أصنع - قال - فهاب أن يقول غيرها - قال - فشهد مع رسول الله صلى الله عليه وسلم يوم أحد - قال - فاستقبل سعد بن معاذ فقال له أنس يا أبا عمرو أين فقال واها لريح الجنة أجده دون أحد - قال - فقاتلهم حتى قتل - قال - فوجد في جسده بضع وثمانون من بين ضربة وطعنة ورمية - قال - فقالت أخته عمتي الربيع بنت النضر فما عرفت أخي إلا ببنانه ‏.‏ ونزلت هذه الآية ‏{‏ رجال صدقوا ما عاهدوا الله عليه فمنهم من قضى نحبه ومنهم من ينتظر وما بدلوا تبديلا‏}‏ قال فكانوا يرون أنها نزلت فيه وفي أصحابه ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 213
			}
		},
		{
			"hadithnumber": 4919,
			"arabicnumber": "1904.01",
			"text": "حدثنا محمد بن المثنى، وابن، بشار - واللفظ لابن المثنى - قالا حدثنا محمد، بن جعفر حدثنا شعبة، عن عمرو بن مرة، قال سمعت أبا وائل، قال حدثنا أبو موسى، الأشعري أن رجلا، أعرابيا أتى النبي صلى الله عليه وسلم فقال يا رسول الله الرجل يقاتل للمغنم والرجل يقاتل ليذكر والرجل يقاتل ليرى مكانه فمن في سبيل الله فقال رسول الله صلى الله عليه وسلم ‏ \"‏ من قاتل لتكون كلمة الله أعلى فهو في سبيل الله ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 214
			}
		},
		{
			"hadithnumber": 4920,
			"arabicnumber": "1904.02",
			"text": "حدثنا أبو بكر بن أبي شيبة، وابن، نمير وإسحاق بن إبراهيم ومحمد بن العلاء قال إسحاق أخبرنا وقال الآخرون، حدثنا أبو معاوية، عن الأعمش، عن شقيق، عن أبي، موسى قال سئل رسول الله صلى الله عليه وسلم عن الرجل يقاتل شجاعة ويقاتل حمية ويقاتل رياء أى ذلك في سبيل الله فقال رسول الله صلى الله عليه وسلم ‏ \"‏ من قاتل لتكون كلمة الله هي العليا فهو في سبيل الله ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 215
			}
		},
		{
			"hadithnumber": 4921,
			"arabicnumber": "1904.03",
			"text": "وحدثناه إسحاق بن إبراهيم، أخبرنا عيسى بن يونس، حدثنا الأعمش، عن شقيق، عن أبي موسى، قال أتينا رسول الله صلى الله عليه وسلم فقلنا يا رسول الله الرجل يقاتل منا شجاعة ‏.‏ فذكر مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 216
			}
		},
		{
			"hadithnumber": 4922,
			"arabicnumber": "1904.04",
			"text": "وحدثنا إسحاق بن إبراهيم، أخبرنا جرير، عن منصور، عن أبي وائل، عن أبي، موسى الأشعري أن رجلا، سأل رسول الله صلى الله عليه وسلم عن القتال في سبيل الله عز وجل فقال الرجل يقاتل غضبا ويقاتل حمية قال فرفع رأسه إليه - وما رفع رأسه إليه إلا أنه كان قائما - فقال ‏ \"‏ من قاتل لتكون كلمة الله هي العليا فهو في سبيل الله ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 217
			}
		},
		{
			"hadithnumber": 4923,
			"arabicnumber": "1905.01",
			"text": "حدثنا يحيى بن حبيب الحارثي، حدثنا خالد بن الحارث، حدثنا ابن جريج، حدثني يونس بن يوسف، عن سليمان بن يسار، قال تفرق الناس عن أبي هريرة، فقال له ناتل أهل الشام أيها الشيخ حدثنا حديثا سمعته من رسول الله صلى الله عليه وسلم قال نعم سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ إن أول الناس يقضى يوم القيامة عليه رجل استشهد فأتي به فعرفه نعمه فعرفها قال فما عملت فيها قال قاتلت فيك حتى استشهدت ‏.‏ قال كذبت ولكنك قاتلت لأن يقال جريء ‏.‏ فقد قيل ‏.‏ ثم أمر به فسحب على وجهه حتى ألقي في النار ورجل تعلم العلم وعلمه وقرأ القرآن فأتي به فعرفه نعمه فعرفها قال فما عملت فيها قال تعلمت العلم وعلمته وقرأت فيك القرآن ‏.‏ قال كذبت ولكنك تعلمت العلم ليقال عالم ‏.‏ وقرأت القرآن ليقال هو قارئ ‏.‏ فقد قيل ثم أمر به فسحب على وجهه حتى ألقي في النار ‏.‏ ورجل وسع الله عليه وأعطاه من أصناف المال كله فأتي به فعرفه نعمه فعرفها قال فما عملت فيها قال ما تركت من سبيل تحب أن ينفق فيها إلا أنفقت فيها لك قال كذبت ولكنك فعلت ليقال هو جواد ‏.‏ فقد قيل ثم أمر به فسحب على وجهه ثم ألقي في النار ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 218
			}
		},
		{
			"hadithnumber": 4924,
			"arabicnumber": "1905.02",
			"text": "وحدثناه علي بن خشرم، أخبرنا الحجاج، - يعني ابن محمد - عن ابن جريج، حدثني يونس بن يوسف، عن سليمان بن يسار، قال تفرج الناس عن أبي هريرة، فقال له ناتل الشام واقتص الحديث بمثل حديث خالد بن الحارث ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 219
			}
		},
		{
			"hadithnumber": 4925,
			"arabicnumber": "1906.01",
			"text": "حدثنا عبد بن حميد، حدثنا عبد الله بن يزيد أبو عبد الرحمن، حدثنا حيوة بن، شريح عن أبي هانئ، عن أبي عبد الرحمن الحبلي، عن عبد الله بن عمرو، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ ما من غازية تغزو في سبيل الله فيصيبون الغنيمة إلا تعجلوا ثلثى أجرهم من الآخرة ويبقى لهم الثلث وإن لم يصيبوا غنيمة تم لهم أجرهم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 220
			}
		},
		{
			"hadithnumber": 4926,
			"arabicnumber": "1906.02",
			"text": "حدثني محمد بن سهل التميمي، حدثنا ابن أبي مريم، أخبرنا نافع بن يزيد، حدثني أبو هانئ، حدثني أبو عبد الرحمن الحبلي، عن عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ ما من غازية أو سرية تغزو فتغنم وتسلم إلا كانوا قد تعجلوا ثلثى أجورهم وما من غازية أو سرية تخفق وتصاب إلا تم أجورهم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 221
			}
		},
		{
			"hadithnumber": 4927,
			"arabicnumber": "1907.01",
			"text": "حدثنا عبد الله بن مسلمة بن قعنب، حدثنا مالك، عن يحيى بن سعيد، عن محمد، بن إبراهيم عن علقمة بن وقاص، عن عمر بن الخطاب، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إنما الأعمال بالنية وإنما لامرئ ما نوى فمن كانت هجرته إلى الله ورسوله فهجرته إلى الله ورسوله ومن كانت هجرته لدنيا يصيبها أو امرأة يتزوجها فهجرته إلى ما هاجر إليه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 222
			}
		},
		{
			"hadithnumber": 4928,
			"arabicnumber": "1907.02",
			"text": "حدثنا محمد بن رمح بن المهاجر، أخبرنا الليث، ح وحدثنا أبو الربيع العتكي، حدثنا حماد بن زيد، ح وحدثنا محمد بن المثنى، حدثنا عبد الوهاب يعني الثقفي، ح وحدثنا إسحاق بن إبراهيم، أخبرنا أبو خالد الأحمر، سليمان بن حيان ح وحدثنا محمد بن عبد، الله بن نمير حدثنا حفص، - يعني ابن غياث - ويزيد بن هارون ح وحدثنا محمد بن، العلاء الهمداني حدثنا ابن المبارك، ح وحدثنا ابن أبي عمر، حدثنا سفيان، كلهم عن يحيى، بن سعيد بإسناد مالك ومعنى حديثه وفي حديث سفيان سمعت عمر بن الخطاب على المنبر يخبر عن النبي صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 223
			}
		},
		{
			"hadithnumber": 4929,
			"arabicnumber": "1908",
			"text": "حدثنا شيبان بن فروخ، حدثنا حماد بن سلمة، حدثنا ثابت، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من طلب الشهادة صادقا أعطيها ولو لم تصبه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 224
			}
		},
		{
			"hadithnumber": 4930,
			"arabicnumber": "1909",
			"text": "حدثني أبو الطاهر، وحرملة بن يحيى، - واللفظ لحرملة - قال أبو الطاهر أخبرنا وقال، حرملة حدثنا عبد الله بن وهب، حدثني أبو شريح، أن سهل بن أبي أمامة بن سهل، بن حنيف حدثه عن أبيه، عن جده، أن النبي صلى الله عليه وسلم قال ‏\"‏ من سأل الله الشهادة بصدق بلغه الله منازل الشهداء وإن مات على فراشه ‏\"‏ ‏.‏ ولم يذكر أبو الطاهر في حديثه ‏\"‏ بصدق ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 225
			}
		},
		{
			"hadithnumber": 4931,
			"arabicnumber": "1910",
			"text": "حدثنا محمد بن عبد الرحمن بن سهم الأنطاكي، أخبرنا عبد الله بن المبارك، عن وهيب المكي، عن عمر بن محمد بن المنكدر، عن سمى، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من مات ولم يغز ولم يحدث به نفسه مات على شعبة من نفاق ‏\"‏ ‏.‏ قال ابن سهم قال عبد الله بن المبارك فنرى أن ذلك كان على عهد رسول الله صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 226
			}
		},
		{
			"hadithnumber": 4932,
			"arabicnumber": "1911.01",
			"text": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن الأعمش، عن أبي سفيان، عن جابر، قال كنا مع النبي صلى الله عليه وسلم في غزاة فقال ‏ \"‏ إن بالمدينة لرجالا ما سرتم مسيرا ولا قطعتم واديا إلا كانوا معكم حبسهم المرض ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 227
			}
		},
		{
			"hadithnumber": 4933,
			"arabicnumber": "1911.02",
			"text": "وحدثنا يحيى بن يحيى، أخبرنا أبو معاوية، ح وحدثنا أبو بكر بن أبي شيبة، وأبو سعيد الأشج قالا حدثنا وكيع، ح وحدثنا إسحاق بن إبراهيم، أخبرنا عيسى بن، يونس كلهم عن الأعمش، بهذا الإسناد غير أن في، حديث وكيع ‏ \"‏ إلا شركوكم في الأجر ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 228
			}
		},
		{
			"hadithnumber": 4934,
			"arabicnumber": "1912.01",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن إسحاق بن عبد الله بن أبي، طلحة عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم كان يدخل على أم حرام بنت ملحان فتطعمه وكانت أم حرام تحت عبادة بن الصامت فدخل عليها رسول الله صلى الله عليه وسلم يوما فأطعمته ثم جلست تفلي رأسه فنام رسول الله صلى الله عليه وسلم ثم استيقظ وهو يضحك قالت فقلت ما يضحكك يا رسول الله قال ‏\"‏ ناس من أمتي عرضوا على غزاة في سبيل الله يركبون ثبج هذا البحر ملوكا على الأسرة أو مثل الملوك على الأسرة ‏\"‏ ‏.‏ يشك أيهما قال قالت فقلت يا رسول الله ادع الله أن يجعلني منهم فدعا لها ثم وضع رأسه فنام ثم استيقظ وهو يضحك قالت فقلت ما يضحكك يا رسول الله قال ‏\"‏ ناس من أمتي عرضوا على غزاة في سبيل الله ‏\"‏ ‏.‏ كما قال في الأولى قالت فقلت يا رسول الله ادع الله أن يجعلني منهم قال ‏\"‏ أنت من الأولين ‏\"‏ ‏.‏ فركبت أم حرام بنت ملحان البحر في زمن معاوية فصرعت عن دابتها حين خرجت من البحر فهلكت ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 229
			}
		},
		{
			"hadithnumber": 4935,
			"arabicnumber": "1912.02",
			"text": "حدثنا خلف بن هشام، حدثنا حماد بن زيد، عن يحيى بن سعيد، عن محمد بن، يحيى بن حبان عن أنس بن مالك، عن أم حرام، وهى خالة أنس قالت أتانا النبي صلى الله عليه وسلم يوما فقال عندنا فاستيقظ وهو يضحك فقلت ما يضحكك يا رسول الله بأبي أنت وأمي قال ‏\"‏ أريت قوما من أمتي يركبون ظهر البحر كالملوك على الأسرة ‏\"‏ ‏.‏ فقلت ادع الله أن يجعلني منهم قال ‏\"‏ فإنك منهم ‏\"‏ ‏.‏ قالت ثم نام فاستيقظ أيضا وهو يضحك فسألته فقال مثل مقالته فقلت ادع الله أن يجعلني منهم ‏.‏ قال ‏\"‏ أنت من الأولين ‏\"‏ ‏.‏ قال فتزوجها عبادة بن الصامت بعد فغزا في البحر فحملها معه فلما أن جاءت قربت لها بغلة فركبتها فصرعتها فاندقت عنقها ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 230
			}
		},
		{
			"hadithnumber": 4936,
			"arabicnumber": "1912.03",
			"text": "وحدثناه محمد بن رمح بن المهاجر، ويحيى بن يحيى، قالا أخبرنا الليث، عن يحيى بن سعيد، عن ابن حبان، عن أنس بن مالك، عن خالته أم حرام بنت ملحان، أنها قالت نام رسول الله صلى الله عليه وسلم يوما قريبا مني ثم استيقظ يتبسم - قالت - فقلت يا رسول الله ما أضحكك قال ‏ \"‏ ناس من أمتي عرضوا على يركبون ظهر هذا البحر الأخضر ‏\"‏ ‏.‏ ثم ذكر نحو حديث حماد بن زيد ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 231
			}
		},
		{
			"hadithnumber": 4937,
			"arabicnumber": "1912.04",
			"text": "وحدثني يحيى بن أيوب، وقتيبة، وابن، حجر قالوا حدثنا إسماعيل، - وهو ابن جعفر - عن عبد الله بن عبد الرحمن، أنه سمع أنس بن مالك، يقول أتى رسول الله صلى الله عليه وسلم ابنة ملحان خالة أنس فوضع رأسه عندها ‏.‏ وساق الحديث بمعنى حديث إسحاق بن أبي طلحة ومحمد بن يحيى بن حبان ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 232
			}
		},
		{
			"hadithnumber": 4938,
			"arabicnumber": "1913.01",
			"text": "حدثنا عبد الله بن عبد الرحمن بن بهرام الدارمي، حدثنا أبو الوليد الطيالسي، حدثنا ليث، - يعني ابن سعد - عن أيوب بن موسى، عن مكحول، عن شرحبيل بن السمط، عن سلمان، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ رباط يوم وليلة خير من صيام شهر وقيامه وإن مات جرى عليه عمله الذي كان يعمله وأجري عليه رزقه وأمن الفتان ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 233
			}
		},
		{
			"hadithnumber": 4939,
			"arabicnumber": "1913.02",
			"text": "حدثني أبو الطاهر، أخبرنا ابن وهب، عن عبد الرحمن بن شريح، عن عبد الكريم، بن الحارث عن أبي عبيدة بن عقبة، عن شرحبيل بن السمط، عن سلمان الخير، عن رسول الله صلى الله عليه وسلم بمعنى حديث الليث عن أيوب بن موسى ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 234
			}
		},
		{
			"hadithnumber": 4940,
			"arabicnumber": "1914",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن سمى، عن أبي صالح، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ بينما رجل يمشي بطريق وجد غصن شوك على الطريق فأخره فشكر الله له فغفر له ‏\"‏ ‏.‏ وقال ‏\"‏ الشهداء خمسة المطعون والمبطون والغرق وصاحب الهدم والشهيد في سبيل الله عز وجل ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 235
			}
		},
		{
			"hadithnumber": 4941,
			"arabicnumber": "1915.01",
			"text": "وحدثني زهير بن حرب، حدثنا جرير، عن سهيل، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما تعدون الشهيد فيكم ‏\"‏ ‏.‏ قالوا يا رسول الله من قتل في سبيل الله فهو شهيد قال ‏\"‏ إن شهداء أمتي إذا لقليل ‏\"‏ ‏.‏ قالوا فمن هم يا رسول الله قال ‏\"‏ من قتل في سبيل الله فهو شهيد ومن مات في سبيل الله فهو شهيد ومن مات في الطاعون فهو شهيد ومن مات في البطن فهو شهيد ‏\"‏ ‏.‏ قال ابن مقسم أشهد على أبيك في هذا الحديث أنه قال ‏\"‏ والغريق شهيد ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 236
			}
		},
		{
			"hadithnumber": 4942,
			"arabicnumber": "1915.02",
			"text": "حدثني عبد الحميد بن بيان الواسطي، حدثنا خالد، عن سهيل، بهذا الإسناد ‏.‏ مثله غير أن في حديثه قال سهيل قال عبيد الله بن مقسم أشهد على أبيك أنه زاد في هذا الحديث ‏ \"‏ ومن غرق فهو شهيد ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 237
			}
		},
		{
			"hadithnumber": 4943,
			"arabicnumber": "1915.03",
			"text": "وحدثني محمد بن حاتم، حدثنا بهز، حدثنا وهيب، حدثنا سهيل، بهذا الإسناد وفي حديثه قال أخبرني عبيد الله بن مقسم، عن أبي صالح، وزاد، فيه ‏ \"‏ والغرق شهيد ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 238
			}
		},
		{
			"hadithnumber": 4944,
			"arabicnumber": "1916.01",
			"text": "حدثنا حامد بن عمر البكراوي، حدثنا عبد الواحد، - يعني ابن زياد - حدثنا عاصم، عن حفصة بنت سيرين، قالت قال لي أنس بن مالك بما مات يحيى بن أبي عمرة قالت قلت بالطاعون ‏.‏ قالت فقال قال رسول الله صلى الله عليه وسلم ‏ \"‏ الطاعون شهادة لكل مسلم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 239
			}
		},
		{
			"hadithnumber": 4945,
			"arabicnumber": "1916.02",
			"text": "وحدثناه الوليد بن شجاع، حدثنا علي بن مسهر، عن عاصم، في هذا الإسناد بمثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 240
			}
		},
		{
			"hadithnumber": 4946,
			"arabicnumber": "1917",
			"text": "حدثنا هارون بن معروف، أخبرنا ابن وهب، أخبرني عمرو بن الحارث، عن أبي علي، ثمامة بن شفى أنه سمع عقبة بن عامر، يقول سمعت رسول الله صلى الله عليه وسلم وهو على المنبر يقول ‏ \"‏ وأعدوا لهم ما استطعتم من قوة ألا إن القوة الرمى ألا إن القوة الرمى ألا إن القوة الرمى ‏\"‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 241
			}
		},
		{
			"hadithnumber": 4947,
			"arabicnumber": "1918.01",
			"text": "وحدثنا هارون بن معروف، حدثنا ابن وهب، أخبرني عمرو بن الحارث، عن أبي علي، عن عقبة بن عامر، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ ستفتح عليكم أرضون ويكفيكم الله فلا يعجز أحدكم أن يلهو بأسهمه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 242
			}
		},
		{
			"hadithnumber": 4948,
			"arabicnumber": "1918.02",
			"text": "وحدثناه داود بن رشيد، حدثنا الوليد، عن بكر بن مضر، عن عمرو بن الحارث، عن أبي علي الهمداني، قال سمعت عقبة بن عامر، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 243
			}
		},
		{
			"hadithnumber": 4949,
			"arabicnumber": "1919",
			"text": "حدثنا محمد بن رمح بن المهاجر، أخبرنا الليث، عن الحارث بن يعقوب، عن عبد الرحمن بن شماسة، أن فقيما اللخمي، قال لعقبة بن عامر تختلف بين هذين الغرضين وأنت كبير يشق عليك ‏.‏ قال عقبة لولا كلام سمعته من رسول الله صلى الله عليه وسلم لم أعانه ‏.‏ قال الحارث فقلت لابن شماسة وما ذاك قال إنه قال ‏ \"‏ من علم الرمى ثم تركه فليس منا أو قد عصى ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 244
			}
		},
		{
			"hadithnumber": 4950,
			"arabicnumber": "1920",
			"text": "حدثنا سعيد بن منصور، وأبو الربيع العتكي، وقتيبة بن سعيد، قالوا حدثنا حماد، - وهو ابن زيد - عن أيوب، عن أبي قلابة، عن أبي أسماء، عن ثوبان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تزال طائفة من أمتي ظاهرين على الحق لا يضرهم من خذلهم حتى يأتي أمر الله وهم كذلك ‏\"‏ ‏.‏ وليس في حديث قتيبة ‏\"‏ وهم كذلك ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 245
			}
		},
		{
			"hadithnumber": 4951,
			"arabicnumber": "1921.01",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، ح وحدثنا ابن نمير، حدثنا وكيع، وعبدة كلاهما عن إسماعيل بن أبي خالد، ح وحدثنا ابن أبي عمر، - واللفظ له - حدثنا مروان، - يعني الفزاري - عن إسماعيل، عن قيس، عن المغيرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ لن يزال قوم من أمتي ظاهرين على الناس حتى يأتيهم أمر الله وهم ظاهرون ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 246
			}
		},
		{
			"hadithnumber": 4952,
			"arabicnumber": "1921.02",
			"text": "وحدثنيه محمد بن رافع، حدثنا أبو أسامة، حدثني إسماعيل، عن قيس، قال سمعت المغيرة بن شعبة، يقول سمعت رسول الله صلى الله عليه وسلم يقول بمثل حديث مروان سواء ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 247
			}
		},
		{
			"hadithnumber": 4953,
			"arabicnumber": "1922",
			"text": "وحدثنا محمد بن المثنى، ومحمد بن بشار، قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن سماك بن حرب، عن جابر بن سمرة، عن النبي صلى الله عليه وسلم أنه قال ‏ \"‏ لن يبرح هذا الدين قائما يقاتل عليه عصابة من المسلمين حتى تقوم الساعة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 248
			}
		},
		{
			"hadithnumber": 4954,
			"arabicnumber": "1923",
			"text": "حدثني هارون بن عبد الله، وحجاج بن الشاعر، قالا حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ لا تزال طائفة من أمتي يقاتلون على الحق ظاهرين إلى يوم القيامة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 249
			}
		},
		{
			"hadithnumber": 4955,
			"arabicnumber": "1037.03",
			"text": "حدثنا منصور بن أبي مزاحم، حدثنا يحيى بن حمزة، عن عبد الرحمن بن يزيد، بن جابر أن عمير بن هانئ، حدثه قال سمعت معاوية، على المنبر يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ لا تزال طائفة من أمتي قائمة بأمر الله لا يضرهم من خذلهم أو خالفهم حتى يأتي أمر الله وهم ظاهرون على الناس ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 250
			}
		},
		{
			"hadithnumber": 4956,
			"arabicnumber": "1037.04",
			"text": "وحدثني إسحاق بن منصور، أخبرنا كثير بن هشام، حدثنا جعفر، - وهو ابن برقان - حدثنا يزيد بن الأصم، قال سمعت معاوية بن أبي سفيان، ذكر حديثا رواه عن النبي صلى الله عليه وسلم لم أسمعه روى عن النبي صلى الله عليه وسلم على منبره حديثا غيره قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من يرد الله به خيرا يفقهه في الدين ولا تزال عصابة من المسلمين يقاتلون على الحق ظاهرين على من ناوأهم إلى يوم القيامة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 251
			}
		},
		{
			"hadithnumber": 4957,
			"arabicnumber": "1924",
			"text": "حدثني أحمد بن عبد الرحمن بن وهب، حدثنا عمي عبد الله بن وهب، حدثنا عمرو بن الحارث، حدثني يزيد بن أبي حبيب، حدثني عبد الرحمن بن شماسة المهري، قال كنت عند مسلمة بن مخلد وعنده عبد الله بن عمرو بن العاص فقال عبد الله لا تقوم الساعة إلا على شرار الخلق هم شر من أهل الجاهلية لا يدعون الله بشىء إلا رده عليهم ‏.‏ فبينما هم على ذلك أقبل عقبة بن عامر فقال له مسلمة يا عقبة اسمع ما يقول عبد الله ‏.‏ فقال عقبة هو أعلم وأما أنا فسمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ لا تزال عصابة من أمتي يقاتلون على أمر الله قاهرين لعدوهم لا يضرهم من خالفهم حتى تأتيهم الساعة وهم على ذلك ‏\"‏ ‏.‏ فقال عبد الله أجل ‏.‏ ثم يبعث الله ريحا كريح المسك مسها مس الحرير فلا تترك نفسا في قلبه مثقال حبة من الإيمان إلا قبضته ثم يبقى شرار الناس عليهم تقوم الساعة ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 252
			}
		},
		{
			"hadithnumber": 4958,
			"arabicnumber": "1925",
			"text": "حدثنا يحيى بن يحيى، أخبرنا هشيم، عن داود بن أبي هند، عن أبي عثمان، عن سعد بن أبي وقاص، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا يزال أهل الغرب ظاهرين على الحق حتى تقوم الساعة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 253
			}
		},
		{
			"hadithnumber": 4959,
			"arabicnumber": "1926.01",
			"text": "حدثني زهير بن حرب، حدثنا جرير، عن سهيل، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا سافرتم في الخصب فأعطوا الإبل حظها من الأرض وإذا سافرتم في السنة فأسرعوا عليها السير وإذا عرستم بالليل فاجتنبوا الطريق فإنها مأوى الهوام بالليل ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 254
			}
		},
		{
			"hadithnumber": 4960,
			"arabicnumber": "1926.02",
			"text": "حدثنا قتيبة بن سعيد، حدثنا عبد العزيز، - يعني ابن محمد - عن سهيل، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إذا سافرتم في الخصب فأعطوا الإبل حظها من الأرض وإذا سافرتم في السنة فبادروا بها نقيها وإذا عرستم فاجتنبوا الطريق فإنها طرق الدواب ومأوى الهوام بالليل ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 255
			}
		},
		{
			"hadithnumber": 4961,
			"arabicnumber": "1927",
			"text": "حدثنا عبد الله بن مسلمة بن قعنب، وإسماعيل بن أبي أويس، وأبو مصعب الزهري ومنصور بن أبي مزاحم وقتيبة بن سعيد قالوا حدثنا مالك، ح وحدثنا يحيى، بن يحيى التميمي - واللفظ له - قال قلت لمالك حدثك سمى عن أبي صالح عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ السفر قطعة من العذاب يمنع أحدكم نومه وطعامه وشرابه فإذا قضى أحدكم نهمته من وجهه فليعجل إلى أهله ‏\"‏ ‏.‏ قال نعم ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 256
			}
		},
		{
			"hadithnumber": 4962,
			"arabicnumber": "1928.01",
			"text": "حدثني أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، عن همام، عن إسحاق، بن عبد الله بن أبي طلحة عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم كان لا يطرق أهله ليلا وكان يأتيهم غدوة أو عشية ‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 257
			}
		},
		{
			"hadithnumber": 4963,
			"arabicnumber": "1928.02",
			"text": "وحدثنيه زهير بن حرب، حدثنا عبد الصمد بن عبد الوارث، حدثنا همام، حدثنا إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، عن النبي صلى الله عليه وسلم بمثله غير أنه قال كان لا يدخل ‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 258
			}
		},
		{
			"hadithnumber": 4964,
			"arabicnumber": "715.23",
			"text": "حدثني إسماعيل بن سالم، حدثنا هشيم، أخبرنا سيار، ح وحدثنا يحيى بن يحيى، - واللفظ له - حدثنا هشيم، عن سيار، عن الشعبي، عن جابر بن عبد الله، قال كنا مع رسول الله صلى الله عليه وسلم في غزاة فلما قدمنا المدينة ذهبنا لندخل فقال ‏ \"‏ أمهلوا حتى ندخل ليلا - أى عشاء - كى تمتشط الشعثة وتستحد المغيبة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 259
			}
		},
		{
			"hadithnumber": 4965,
			"arabicnumber": "715.24",
			"text": "حدثنا محمد بن المثنى، حدثني عبد الصمد، حدثنا شعبة، عن سيار، عن عامر، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا قدم أحدكم ليلا فلا يأتين أهله طروقا حتى تستحد المغيبة وتمتشط الشعثة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 260
			}
		},
		{
			"hadithnumber": 4966,
			"arabicnumber": "715.25",
			"text": "وحدثنيه يحيى بن حبيب، حدثنا روح بن عبادة، حدثنا شعبة، حدثنا سيار، بهذا الإسناد مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 261
			}
		},
		{
			"hadithnumber": 4967,
			"arabicnumber": "715.26",
			"text": "وحدثنا محمد بن بشار، حدثنا محمد، - يعني ابن جعفر - حدثنا شعبة، عن عاصم، عن الشعبي، عن جابر بن عبد الله، قال نهى رسول الله صلى الله عليه وسلم إذا أطال الرجل الغيبة أن يأتي أهله طروقا ‏.‏",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 262
			}
		}
	]
}