{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"35": "The Book of Sacrifices"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5064,
			"arabicnumber": "1960.01",
			"text": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا الأسود بن قيس، ح وحدثناه يحيى، بن يحيى أخبرنا أبو خيثمة، عن الأسود بن قيس، حدثني جندب بن سفيان، قال شهدت الأضحى مع رسول الله صلى الله عليه وسلم فلم يعد أن صلى وفرغ من صلاته سلم فإذا هو يرى لحم أضاحي قد ذبحت قبل أن يفرغ من صلاته فقال ‏ \"‏ من كان ذبح أضحيته قبل أن يصلي - أو نصلي - فليذبح مكانها أخرى ومن كان لم يذبح فليذبح باسم الله ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 5065,
			"arabicnumber": "1960.02",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو الأحوص، سلام بن سليم عن الأسود، بن قيس عن جندب بن سفيان، قال شهدت الأضحى مع رسول الله صلى الله عليه وسلم فلما قضى صلاته بالناس نظر إلى غنم قد ذبحت فقال ‏ \"‏ من ذبح قبل الصلاة فليذبح شاة مكانها ومن لم يكن ذبح فليذبح على اسم الله ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 5066,
			"arabicnumber": "1960.03",
			"text": "وحدثناه قتيبة بن سعيد، حدثنا أبو عوانة، ح وحدثنا إسحاق بن إبراهيم، وابن، أبي عمر عن ابن عيينة، كلاهما عن الأسود بن قيس، بهذا الإسناد وقالا على اسم الله ‏.‏ كحديث أبي الأحوص ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 5067,
			"arabicnumber": "1960.04",
			"text": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن الأسود، سمع جندبا البجلي، قال شهدت رسول الله صلى الله عليه وسلم صلى يوم أضحى ثم خطب فقال ‏ \"‏ من كان ذبح قبل أن يصلي فليعد مكانها ومن لم يكن ذبح فليذبح باسم الله ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 5068,
			"arabicnumber": "1960.05",
			"text": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، بهذا الإسناد مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 5069,
			"arabicnumber": "1961.01",
			"text": "وحدثنا يحيى بن يحيى، أخبرنا خالد بن عبد الله، عن مطرف، عن عامر، عن البراء، قال ضحى خالي أبو بردة قبل الصلاة فقال رسول الله صلى الله عليه وسلم ‏\"‏ تلك شاة لحم ‏\"‏ ‏.‏ فقال يا رسول الله إن عندي جذعة من المعز فقال ‏\"‏ ضح بها ولا تصلح لغيرك ‏\"‏ ‏.‏ ثم قال ‏\"‏ من ضحى قبل الصلاة فإنما ذبح لنفسه ومن ذبح بعد الصلاة فقد تم نسكه وأصاب سنة المسلمين ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 5070,
			"arabicnumber": "1961.02",
			"text": "حدثنا يحيى بن يحيى، أخبرنا هشيم، عن داود، عن الشعبي، عن البراء بن عازب، أن خاله أبا بردة بن نيار، ذبح قبل أن يذبح النبي، صلى الله عليه وسلم فقال يا رسول الله إن هذا يوم اللحم فيه مكروه وإني عجلت نسيكتي لأطعم أهلي وجيراني وأهل داري ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أعد نسكا ‏\"‏ ‏.‏ فقال يا رسول الله إن عندي عناق لبن هي خير من شاتى لحم ‏.‏ فقال ‏\"‏ هي خير نسيكتيك ولا تجزي جذعة عن أحد بعدك ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 5071,
			"arabicnumber": "1961.03",
			"text": "حدثنا محمد بن المثنى، حدثنا ابن أبي عدي، عن داود، عن الشعبي، عن البراء، بن عازب قال خطبنا رسول الله صلى الله عليه وسلم يوم النحر فقال ‏ \"‏ لا يذبحن أحد حتى يصلي ‏\"‏ ‏.‏ قال فقال خالي يا رسول الله إن هذا يوم اللحم فيه مكروه ‏.‏ ثم ذكر بمعنى حديث هشيم ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 5072,
			"arabicnumber": "1961.04",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، ح وحدثنا ابن نمير، حدثنا أبي، حدثنا زكرياء، عن فراس، عن عامر، عن البراء، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من صلى صلاتنا ووجه قبلتنا ونسك نسكنا فلا يذبح حتى يصلي ‏\"‏ ‏.‏ فقال خالي يا رسول الله قد نسكت عن ابن لي ‏.‏ فقال ‏\"‏ ذاك شىء عجلته لأهلك ‏\"‏ ‏.‏ فقال إن عندي شاة خير من شاتين قال ‏\"‏ ضح بها فإنها خير نسيكة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 5073,
			"arabicnumber": "1961.05",
			"text": "وحدثنا محمد بن المثنى، وابن، بشار - واللفظ لابن المثنى - قالا حدثنا محمد، بن جعفر حدثنا شعبة، عن زبيد الإيامي، عن الشعبي، عن البراء بن عازب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن أول ما نبدأ به في يومنا هذا نصلي ثم نرجع فننحر فمن فعل ذلك فقد أصاب سنتنا ومن ذبح فإنما هو لحم قدمه لأهله ليس من النسك في شىء ‏\"‏ ‏.‏ وكان أبو بردة بن نيار قد ذبح فقال عندي جذعة خير من مسنة فقال ‏\"‏ اذبحها ولن تجزي عن أحد بعدك ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 5074,
			"arabicnumber": "1961.06",
			"text": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن زبيد، سمع الشعبي، عن البراء بن عازب، عن النبي صلى الله عليه وسلم مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 5075,
			"arabicnumber": "1961.07",
			"text": "وحدثنا قتيبة بن سعيد، وهناد بن السري، قالا حدثنا أبو الأحوص، ح وحدثنا عثمان بن أبي شيبة، وإسحاق بن إبراهيم، جميعا عن جرير، كلاهما عن منصور، عن الشعبي، عن البراء بن عازب، قال خطبنا رسول الله صلى الله عليه وسلم في يوم النحر بعد الصلاة ‏.‏ ثم ذكر نحو حديثهم ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 5076,
			"arabicnumber": "1961.08",
			"text": "وحدثني أحمد بن سعيد بن صخر الدارمي، حدثنا أبو النعمان، عارم بن الفضل حدثنا عبد الواحد، - يعني ابن زياد - حدثنا عاصم الأحول، عن الشعبي، حدثني البراء، بن عازب قال خطبنا رسول الله صلى الله عليه وسلم في يوم نحر فقال ‏\"‏ لا يضحين أحد حتى يصلي ‏\"‏ ‏.‏ قال رجل عندي عناق لبن هي خير من شاتى لحم قال ‏\"‏ فضح بها ولا تجزي جذعة عن أحد بعدك ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 5077,
			"arabicnumber": "1961.09",
			"text": "حدثنا محمد بن بشار، حدثنا محمد، - يعني ابن جعفر - حدثنا شعبة، عن سلمة، عن أبي جحيفة، عن البراء بن عازب، قال ذبح أبو بردة قبل الصلاة فقال النبي صلى الله عليه وسلم ‏\"‏ أبدلها ‏\"‏ ‏.‏ فقال يا رسول الله ليس عندي إلا جذعة - قال شعبة وأظنه قال - وهي خير من مسنة ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اجعلها مكانها ولن تجزي عن أحد بعدك ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 5078,
			"arabicnumber": "1961.10",
			"text": "وحدثناه ابن المثنى، حدثني وهب بن جرير، ح وحدثنا إسحاق بن إبراهيم، أخبرنا أبو عامر العقدي، حدثنا شعبة، بهذا الإسناد ‏.‏ ولم يذكر الشك في قوله هي خير من مسنة ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 5079,
			"arabicnumber": "1962.01",
			"text": "وحدثني يحيى بن أيوب، وعمرو الناقد، وزهير بن حرب، جميعا عن ابن علية، - واللفظ لعمرو - قال حدثنا إسماعيل بن إبراهيم، عن أيوب، عن محمد، عن أنس، قال قال رسول الله صلى الله عليه وسلم يوم النحر ‏ \"‏ من كان ذبح قبل الصلاة فليعد ‏\"‏ ‏.‏ فقام رجل فقال يا رسول الله هذا يوم يشتهى فيه اللحم ‏.‏ وذكر هنة من جيرانه كأن رسول الله صلى الله عليه وسلم صدقه قال وعندي جذعة هي أحب إلى من شاتى لحم أفأذبحها قال فرخص له فقال لا أدري أبلغت رخصته من سواه أم لا قال وانكفأ رسول الله صلى الله عليه وسلم إلى كبشين فذبحهما فقام الناس إلى غنيمة فتوزعوها ‏.‏ أو قال فتجزعوها ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 5080,
			"arabicnumber": "1962.02",
			"text": "حدثنا محمد بن عبيد الغبري، حدثنا حماد بن زيد، حدثنا أيوب، وهشام، عن محمد، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم صلى ثم خطب فأمر من كان ذبح قبل الصلاة أن يعيد ذبحا ثم ذكر بمثل حديث ابن علية ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 5081,
			"arabicnumber": "1962.03",
			"text": "وحدثني زياد بن يحيى الحساني، حدثنا حاتم، - يعني ابن وردان - حدثنا أيوب، عن محمد بن سيرين، عن أنس بن مالك، قال خطبنا رسول الله صلى الله عليه وسلم يوم أضحى - قال - فوجد ريح لحم فنهاهم أن يذبحوا قال ‏ \"‏ من كان ضحى فليعد ‏\"‏ ‏.‏ ثم ذكر بمثل حديثهما ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 5082,
			"arabicnumber": "1963",
			"text": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا أبو الزبير، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا تذبحوا إلا مسنة إلا أن يعسر عليكم فتذبحوا جذعة من الضأن ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 5083,
			"arabicnumber": "1964",
			"text": "وحدثني محمد بن حاتم، حدثنا محمد بن بكر، أخبرنا ابن جريج، أخبرني أبو الزبير أنه سمع جابر بن عبد الله، يقول صلى بنا النبي صلى الله عليه وسلم يوم النحر بالمدينة فتقدم رجال فنحروا وظنوا أن النبي صلى الله عليه وسلم قد نحر فأمر النبي صلى الله عليه وسلم من كان نحر قبله أن يعيد بنحر آخر ولا ينحروا حتى ينحر النبي صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 5084,
			"arabicnumber": "1965.01",
			"text": "وحدثنا قتيبة بن سعيد، حدثنا ليث، ح وحدثنا محمد بن رمح، أخبرنا الليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر، أن رسول الله صلى الله عليه وسلم أعطاه غنما يقسمها على أصحابه ضحايا فبقي عتود فذكره لرسول الله صلى الله عليه وسلم فقال ‏ \"‏ ضح به أنت ‏\"‏ ‏.‏ قال قتيبة على صحابته ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 5085,
			"arabicnumber": "1965.02",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، عن هشام الدستوائي، عن يحيى بن أبي كثير، عن بعجة الجهني، عن عقبة بن عامر الجهني، قال قسم رسول الله صلى الله عليه وسلم فينا ضحايا فأصابني جذع فقلت يا رسول الله إنه أصابني جذع ‏.‏ فقال ‏ \"‏ ضح به ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 5086,
			"arabicnumber": "1965.03",
			"text": "وحدثني عبد الله بن عبد الرحمن الدارمي، حدثنا يحيى، - يعني ابن حسان - أخبرنا معاوية، - وهو ابن سلام - حدثني يحيى بن أبي كثير، أخبرني بعجة بن عبد، الله أن عقبة بن عامر الجهني، أخبره أن رسول الله صلى الله عليه وسلم قسم ضحايا بين أصحابه ‏.‏ بمثل معناه ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 5087,
			"arabicnumber": "1966.01",
			"text": "حدثنا قتيبة بن سعيد، حدثنا أبو عوانة، عن قتادة، عن أنس، قال ضحى النبي صلى الله عليه وسلم بكبشين أملحين أقرنين ذبحهما بيده وسمى وكبر ووضع رجله على صفاحهما ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 5088,
			"arabicnumber": "1966.02",
			"text": "حدثنا يحيى بن يحيى، أخبرنا وكيع، عن شعبة، عن قتادة، عن أنس، قال ضحى رسول الله صلى الله عليه وسلم بكبشين أملحين أقرنين قال ورأيته يذبحهما بيده ورأيته واضعا قدمه على صفاحهما قال وسمى وكبر ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 5089,
			"arabicnumber": "1966.03",
			"text": "وحدثنا يحيى بن حبيب، حدثنا خالد، - يعني ابن الحارث - حدثنا شعبة، أخبرني قتادة، قال سمعت أنسا، يقول ضحى رسول الله صلى الله عليه وسلم ‏.‏ بمثله ‏.‏ قال قلت آنت سمعته من أنس قال نعم ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 5090,
			"arabicnumber": "1966.04",
			"text": "حدثنا محمد بن المثنى، حدثنا ابن أبي عدي، عن سعيد، عن قتادة، عن أنس، عن النبي صلى الله عليه وسلم بمثله غير أنه قال ويقول ‏ \"‏ باسم الله والله أكبر ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 5091,
			"arabicnumber": "1967",
			"text": "حدثنا هارون بن معروف، حدثنا عبد الله بن وهب، قال قال حيوة أخبرني أبو صخر، عن يزيد بن قسيط، عن عروة بن الزبير، عن عائشة، أن رسول الله صلى الله عليه وسلم أمر بكبش أقرن يطأ في سواد ويبرك في سواد وينظر في سواد فأتي به ليضحي به فقال لها ‏\"‏ يا عائشة هلمي المدية ‏\"‏ ‏.‏ ثم قال ‏\"‏ اشحذيها بحجر ‏\"‏ ‏.‏ ففعلت ثم أخذها وأخذ الكبش فأضجعه ثم ذبحه ثم قال ‏\"‏ باسم الله اللهم تقبل من محمد وآل محمد ومن أمة محمد ‏\"‏ ‏.‏ ثم ضحى به ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 5092,
			"arabicnumber": "1968.01",
			"text": "حدثنا محمد بن المثنى العنزي، حدثنا يحيى بن سعيد، عن سفيان، حدثني أبي، عن عباية بن رفاعة بن رافع بن خديج، عن رافع بن خديج، قلت يا رسول الله إنا لاقو العدو غدا وليست معنا مدى قال صلى الله عليه وسلم ‏\"‏ أعجل أو أرني ما أنهر الدم وذكر اسم الله فكل ليس السن والظفر وسأحدثك أما السن فعظم وأما الظفر فمدى الحبشة ‏\"‏ ‏.‏ قال وأصبنا نهب إبل وغنم فند منها بعير فرماه رجل بسهم فحبسه فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن لهذه الإبل أوابد كأوابد الوحش فإذا غلبكم منها شىء فاصنعوا به هكذا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 5093,
			"arabicnumber": "1968.02",
			"text": "وحدثنا إسحاق بن إبراهيم، أخبرنا وكيع، حدثنا سفيان بن سعيد بن مسروق، عن أبيه، عن عباية بن رفاعة بن رافع بن خديج، عن رافع بن خديج، قال كنا مع رسول الله صلى الله عليه وسلم بذي الحليفة من تهامة فأصبنا غنما وإبلا فعجل القوم فأغلوا بها القدور فأمر بها فكفئت ثم عدل عشرا من الغنم بجزور ‏.‏ وذكر باقي الحديث كنحو حديث يحيى بن سعيد ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 5094,
			"arabicnumber": "1968.03",
			"text": "وحدثنا ابن أبي عمر، حدثنا سفيان، عن إسماعيل بن مسلم، عن سعيد بن مسروق، عن عباية، عن جده، رافع ثم حدثنيه عمر بن سعيد بن مسروق، عن أبيه، عن عباية بن، رفاعة بن رافع بن خديج عن جده، قال قلنا يا رسول الله إنا لاقو العدو غدا وليس معنا مدى فنذكي بالليط وذكر الحديث بقصته وقال فند علينا بعير منها فرميناه بالنبل حتى وهصناه ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 5095,
			"arabicnumber": "1968.04",
			"text": "وحدثنيه القاسم بن زكرياء، حدثنا حسين بن علي، عن زائدة، عن سعيد بن مسروق، بهذا الإسناد الحديث إلى آخره بتمامه وقال فيه وليست معنا مدى أفنذبح بالقصب",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 5096,
			"arabicnumber": "1968.05",
			"text": "وحدثنا محمد بن الوليد بن عبد الحميد، حدثنا محمد بن جعفر، حدثنا شعبة، عن سعيد بن مسروق، عن عباية بن رفاعة بن رافع، عن رافع بن خديج، أنه قال يا رسول الله إنا لاقو العدو غدا وليس معنا مدى وساق الحديث ولم يذكر فعجل القوم فأغلوا بها القدور فأمر بها فكفئت وذكر سائر القصة ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 5097,
			"arabicnumber": "1969.01",
			"text": "حدثني عبد الجبار بن العلاء، حدثنا سفيان، حدثنا الزهري، عن أبي عبيد، قال شهدت العيد مع علي بن أبي طالب فبدأ بالصلاة قبل الخطبة وقال إن رسول الله صلى الله عليه وسلم نهانا أن نأكل من لحوم نسكنا بعد ثلاث ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 5098,
			"arabicnumber": "1969.02",
			"text": "حدثني حرملة بن يحيى، أخبرنا ابن وهب، حدثني يونس، عن ابن شهاب، حدثني أبو عبيد، مولى ابن أزهر أنه شهد العيد مع عمر بن الخطاب قال ثم صليت مع علي بن أبي طالب - قال - فصلى لنا قبل الخطبة ثم خطب الناس فقال إن رسول الله صلى الله عليه وسلم قد نهاكم أن تأكلوا لحوم نسككم فوق ثلاث ليال فلا تأكلوا ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 5099,
			"arabicnumber": "1969.03",
			"text": "وحدثني زهير بن حرب، حدثنا يعقوب بن إبراهيم، حدثنا ابن أخي ابن شهاب، ح وحدثنا حسن الحلواني، حدثنا يعقوب بن إبراهيم، حدثنا أبي، عن صالح، ح وحدثنا عبد بن حميد، أخبرنا عبد الرزاق، أخبرنا معمر، كلهم عن الزهري، بهذا الإسناد مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 5100,
			"arabicnumber": "1970.01",
			"text": "وحدثنا قتيبة بن سعيد، حدثنا ليث، ح وحدثني محمد بن رمح، أخبرنا الليث، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم أنه قال ‏ \"‏ لا يأكل أحد من لحم أضحيته فوق ثلاثة أيام ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 5101,
			"arabicnumber": "1970.02",
			"text": "وحدثني محمد بن حاتم، حدثنا يحيى بن سعيد، عن ابن جريج، ح وحدثني محمد، بن رافع حدثنا ابن أبي فديك، أخبرنا الضحاك، - يعني ابن عثمان - كلاهما عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم بمثل حديث الليث ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 5102,
			"arabicnumber": "1970.03",
			"text": "وحدثنا ابن أبي عمر، وعبد بن حميد، قال ابن أبي عمر حدثنا وقال عبد، أخبرنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن سالم، عن ابن عمر، أن رسول الله صلى الله عليه وسلم نهى أن تؤكل لحوم الأضاحي بعد ثلاث ‏.‏ قال سالم فكان ابن عمر لا يأكل لحوم الأضاحي فوق ثلاث ‏.‏ وقال ابن أبي عمر بعد ثلاث ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 5103,
			"arabicnumber": "1971",
			"text": "حدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا روح، حدثنا مالك، عن عبد الله بن، أبي بكر عن عبد الله بن واقد، قال نهى رسول الله صلى الله عليه وسلم عن أكل لحوم الضحايا بعد ثلاث ‏.‏ قال عبد الله بن أبي بكر فذكرت ذلك لعمرة فقالت صدق سمعت عائشة تقول دف أهل أبيات من أهل البادية حضرة الأضحى زمن رسول الله صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ ادخروا ثلاثا ثم تصدقوا بما بقي ‏\"‏ ‏.‏ فلما كان بعد ذلك قالوا يا رسول الله إن الناس يتخذون الأسقية من ضحاياهم ويحملون منها الودك فقال رسول الله صلى الله عليه وسلم ‏\"‏ وما ذاك ‏\"‏ ‏.‏ قالوا نهيت أن تؤكل لحوم الضحايا بعد ثلاث ‏.‏ فقال ‏\"‏ إنما نهيتكم من أجل الدافة التي دفت فكلوا وادخروا وتصدقوا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 5104,
			"arabicnumber": "1972.01",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن أبي الزبير، عن جابر، عن النبي صلى الله عليه وسلم أنه نهى عن أكل لحوم الضحايا بعد ثلاث ثم قال بعد ‏ \"‏ كلوا وتزودوا وادخروا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 5105,
			"arabicnumber": "1972.02",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، ح وحدثنا يحيى بن أيوب، حدثنا ابن علية، كلاهما عن ابن جريج، عن عطاء، عن جابر، ح وحدثني محمد بن حاتم، - واللفظ له - حدثنا يحيى بن سعيد، عن ابن جريج، حدثنا عطاء، قال سمعت جابر بن، عبد الله يقول كنا لا نأكل من لحوم بدننا فوق ثلاث منى فأرخص لنا رسول الله صلى الله عليه وسلم فقال ‏ \"‏ كلوا وتزودوا ‏\"‏ ‏.‏ قلت لعطاء قال جابر حتى جئنا المدينة قال نعم ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 5106,
			"arabicnumber": "1972.03",
			"text": "حدثنا إسحاق بن إبراهيم، أخبرنا زكرياء بن عدي، عن عبيد الله بن عمرو، عن زيد بن أبي أنيسة، عن عطاء بن أبي رباح، عن جابر بن عبد الله، قال كنا لا نمسك لحوم الأضاحي فوق ثلاث فأمرنا رسول الله صلى الله عليه وسلم أن نتزود منها ونأكل منها ‏.‏ يعني فوق ثلاث ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 5107,
			"arabicnumber": "1972.04",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا سفيان بن عيينة، عن عمرو، عن عطاء، عن جابر، قال كنا نتزودها إلى المدينة على عهد رسول الله صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 5108,
			"arabicnumber": "1973",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الأعلى، عن الجريري، عن أبي نضرة، عن أبي سعيد الخدري، ح وحدثنا محمد بن المثنى، حدثنا عبد الأعلى، حدثنا سعيد، عن قتادة، عن أبي، نضرة عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يا أهل المدينة لا تأكلوا لحوم الأضاحي فوق ثلاث ‏\"‏ ‏.‏ وقال ابن المثنى ثلاثة أيام ‏.‏ فشكوا إلى رسول الله صلى الله عليه وسلم أن لهم عيالا وحشما وخدما فقال ‏\"‏ كلوا وأطعموا واحبسوا أو ادخروا ‏\"‏ ‏.‏ قال ابن المثنى شك عبد الأعلى ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 5109,
			"arabicnumber": "1974",
			"text": "حدثنا إسحاق بن منصور، أخبرنا أبو عاصم، عن يزيد بن أبي عبيد، عن سلمة، بن الأكوع أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من ضحى منكم فلا يصبحن في بيته بعد ثالثة شيئا ‏\"‏ ‏.‏ فلما كان في العام المقبل قالوا يا رسول الله نفعل كما فعلنا عام أول فقال ‏\"‏ لا إن ذاك عام كان الناس فيه بجهد فأردت أن يفشو فيهم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 5110,
			"arabicnumber": "1975.01",
			"text": "حدثني زهير بن حرب، حدثنا معن بن عيسى، حدثنا معاوية بن صالح، عن أبي، الزاهرية عن جبير بن نفير، عن ثوبان، قال ذبح رسول الله صلى الله عليه وسلم ضحيته ثم قال ‏ \"‏ يا ثوبان أصلح لحم هذه ‏\"‏ ‏.‏ فلم أزل أطعمه منها حتى قدم المدينة ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 5111,
			"arabicnumber": "1975.02",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وابن، رافع قالا حدثنا زيد بن حباب، ح وحدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا عبد الرحمن بن مهدي، كلاهما عن معاوية بن صالح، بهذا الإسناد ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 5116,
			"arabicnumber": "1976",
			"text": "حدثنا يحيى بن يحيى التميمي، وأبو بكر بن أبي شيبة وعمرو الناقد وزهير بن حرب قال يحيى أخبرنا وقال الآخرون، حدثنا سفيان بن عيينة، عن الزهري، عن سعيد، عن أبي هريرة، عن النبي صلى الله عليه وسلم ح وحدثني محمد بن رافع، وعبد بن حميد، قال عبد أخبرنا وقال ابن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن ابن المسيب، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا فرع ولا عتيرة ‏\"‏ ‏.‏ زاد ابن رافع في روايته والفرع أول النتاج كان ينتج لهم فيذبحونه ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 5117,
			"arabicnumber": "1977.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن المثنى، قالا حدثنا محمد بن فضيل، قال أبو بكر عن أبي سنان، وقال ابن المثنى، عن ضرار بن مرة، عن محارب، عن ابن بريدة، عن أبيه، ح وحدثنا محمد بن عبد الله بن نمير، حدثنا محمد بن فضيل، حدثنا ضرار بن مرة، أبو سنان عن محارب بن دثار، عن عبد الله بن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ نهيتكم عن زيارة القبور فزوروها ونهيتكم عن لحوم الأضاحي فوق ثلاث فأمسكوا ما بدا لكم ونهيتكم عن النبيذ إلا في سقاء فاشربوا في الأسقية كلها ولا تشربوا مسكرا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 5118,
			"arabicnumber": "1977.02",
			"text": "وحدثني حجاج بن الشاعر، حدثنا الضحاك بن مخلد، عن سفيان، عن علقمة، بن مرثد عن ابن بريدة، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ كنت نهيتكم ‏\"‏ ‏.‏ فذكر بمعنى حديث أبي سنان ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 5119,
			"arabicnumber": "1977.03",
			"text": "حدثنا ابن أبي عمر المكي، حدثنا سفيان، عن عبد الرحمن بن حميد بن عبد الرحمن، بن عوف سمع سعيد بن المسيب، يحدث عن أم سلمة، أن النبي صلى الله عليه وسلم قال ‏ \"‏ إذا دخلت العشر وأراد أحدكم أن يضحي فلا يمس من شعره وبشره شيئا ‏\"‏ ‏.‏ قيل لسفيان فإن بعضهم لا يرفعه قال لكني أرفعه ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 5120,
			"arabicnumber": "1977.04",
			"text": "وحدثناه إسحاق بن إبراهيم، أخبرنا سفيان، حدثني عبد الرحمن بن حميد بن، عبد الرحمن بن عوف عن سعيد بن المسيب، عن أم سلمة، ترفعه قال ‏ \"‏ إذا دخل العشر وعنده أضحية يريد أن يضحي فلا يأخذن شعرا ولا يقلمن ظفرا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 5121,
			"arabicnumber": "1977.05",
			"text": "وحدثني حجاج بن الشاعر، حدثني يحيى بن كثير العنبري أبو غسان، حدثنا شعبة، عن مالك بن أنس، عن عمر بن مسلم، عن سعيد بن المسيب، عن أم سلمة، أن النبي صلى الله عليه وسلم قال ‏ \"‏ إذا رأيتم هلال ذي الحجة وأراد أحدكم أن يضحي فليمسك عن شعره وأظفاره ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 5122,
			"arabicnumber": "1977.08",
			"text": "حدثني الحسن بن علي الحلواني، حدثنا أبو أسامة، حدثني محمد بن عمرو، حدثنا عمرو بن مسلم بن عمار الليثي، قال كنا في الحمام قبيل الأضحى فاطلى فيه ناس فقال بعض أهل الحمام إن سعيد بن المسيب يكره هذا أو ينهى عنه فلقيت سعيد بن المسيب فذكرت ذلك له فقال يا ابن أخي هذا حديث قد نسي وترك حدثتني أم سلمة زوج النبي صلى الله عليه وسلم قالت قال رسول الله صلى الله عليه وسلم بمعنى حديث معاذ عن محمد بن عمرو ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 5123,
			"arabicnumber": "1977.09",
			"text": "وحدثني حرملة بن يحيى، وأحمد بن عبد الرحمن بن أخي ابن وهب، قالا حدثنا عبد الله بن وهب، أخبرني حيوة، أخبرني خالد بن يزيد، عن سعيد بن أبي هلال، عن عمر، بن مسلم الجندعي أن ابن المسيب، أخبره أن أم سلمة زوج النبي صلى الله عليه وسلم أخبرته ‏.‏ وذكر النبي صلى الله عليه وسلم بمعنى حديثهم ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 5124,
			"arabicnumber": "1978.01",
			"text": "حدثنا زهير بن حرب، وسريج بن يونس، كلاهما عن مروان، قال زهير حدثنا مروان بن معاوية الفزاري، حدثنا منصور بن حيان، حدثنا أبو الطفيل، عامر بن واثلة قال كنت عند علي بن أبي طالب فأتاه رجل فقال ما كان النبي صلى الله عليه وسلم يسر إليك قال فغضب وقال ما كان النبي صلى الله عليه وسلم يسر إلى شيئا يكتمه الناس غير أنه قد حدثني بكلمات أربع ‏.‏ قال فقال ما هن يا أمير المؤمنين قال قال ‏ \"‏ لعن الله من لعن والده ولعن الله من ذبح لغير الله ولعن الله من آوى محدثا ولعن الله من غير منار الأرض ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 5125,
			"arabicnumber": "1978.02",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، سليمان بن حيان عن منصور، بن حيان عن أبي الطفيل، قال قلنا لعلي بن أبي طالب أخبرنا بشىء، أسره إليك رسول الله صلى الله عليه وسلم فقال ما أسر إلى شيئا كتمه الناس ولكني سمعته يقول ‏ \"‏ لعن الله من ذبح لغير الله ولعن الله من آوى محدثا ولعن الله من لعن والديه ولعن الله من غير المنار ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 5126,
			"arabicnumber": "1978.03",
			"text": "حدثنا محمد بن المثنى، ومحمد بن بشار، - واللفظ لابن المثنى - قالا حدثنا محمد بن جعفر، حدثنا شعبة، قال سمعت القاسم بن أبي بزة، يحدث عن أبي الطفيل، قال سئل علي أخصكم رسول الله صلى الله عليه وسلم بشىء فقال ما خصنا رسول الله صلى الله عليه وسلم بشىء لم يعم به الناس كافة إلا ما كان في قراب سيفي هذا - قال - فأخرج صحيفة مكتوب فيها ‏ \"‏ لعن الله من ذبح لغير الله ولعن الله من سرق منار الأرض ولعن الله من لعن والده ولعن الله من آوى محدثا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 62
			}
		}
	]
}