{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"40": "The Book Concerning the Use of Correct Words"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5862,
			"arabicnumber": "2246.01",
			"text": "حدثني أبو الطاهر، أحمد بن عمرو بن سرح وحرملة بن يحيى قالا أخبرنا ابن وهب، حدثني يونس، عن ابن شهاب، أخبرني أبو سلمة بن عبد الرحمن، قال قال أبو هريرة سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ قال الله عز وجل يسب ابن آدم الدهر وأنا الدهر بيدي الليل والنهار ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 5863,
			"arabicnumber": "2246.02",
			"text": "وحدثناه إسحاق بن إبراهيم، وابن أبي عمر، - واللفظ لابن أبي عمر - قال إسحاق أخبرنا وقال ابن أبي عمر، حدثنا سفيان، عن الزهري، عن ابن المسيب، عن أبي، هريرة أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ قال الله عز وجل يؤذيني ابن آدم يسب الدهر وأنا الدهر أقلب الليل والنهار ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 5864,
			"arabicnumber": "2246.03",
			"text": "وحدثنا عبد بن حميد، أخبرنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن ابن، المسيب عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ قال الله عز وجل يؤذيني ابن آدم يقول يا خيبة الدهر ‏.‏ فلا يقولن أحدكم يا خيبة الدهر ‏.‏ فإني أنا الدهر أقلب ليله ونهاره فإذا شئت قبضتهما ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 5865,
			"arabicnumber": "2246.04",
			"text": "حدثنا قتيبة، حدثنا المغيرة بن عبد الرحمن، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا يقولن أحدكم يا خيبة الدهر ‏.‏ فإن الله هو الدهر ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 5866,
			"arabicnumber": "2246.05",
			"text": "وحدثني زهير بن حرب، حدثنا جرير، عن هشام، عن ابن سيرين، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ لا تسبوا الدهر فإن الله هو الدهر ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 5867,
			"arabicnumber": "2247.01",
			"text": "حدثنا حجاج بن الشاعر، حدثنا عبد الرزاق، أخبرنا معمر، عن أيوب، عن ابن، سيرين عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا يسب أحدكم الدهر فإن الله هو الدهر ولا يقولن أحدكم للعنب الكرم ‏.‏ فإن الكرم الرجل المسلم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 5868,
			"arabicnumber": "2247.02",
			"text": "حدثنا عمرو الناقد، وابن أبي عمر، قالا حدثنا سفيان، عن الزهري، عن سعيد، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ لا تقولوا كرم ‏.‏ فإن الكرم قلب المؤمن ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 5869,
			"arabicnumber": "2247.03",
			"text": "حدثنا زهير بن حرب، حدثنا جرير، عن هشام، عن ابن سيرين، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ لا تسموا العنب الكرم فإن الكرم الرجل المسلم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 5870,
			"arabicnumber": "2247.04",
			"text": "حدثنا زهير بن حرب، حدثنا علي بن حفص، حدثنا ورقاء، عن أبي الزناد، عن الأعرج، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا يقولن أحدكم الكرم ‏.‏ فإنما الكرم قلب المؤمن ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 5871,
			"arabicnumber": "2247.05",
			"text": "وحدثنا ابن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم ‏.‏ فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏ \"‏ لا يقولن أحدكم للعنب الكرم ‏.‏ إنما الكرم الرجل المسلم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 5872,
			"arabicnumber": "2248.01",
			"text": "حدثنا علي بن خشرم، أخبرنا عيسى، - يعني ابن يونس - عن شعبة، عن سماك، بن حرب عن علقمة بن وائل، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏ \"‏ لا تقولوا الكرم ‏.‏ ولكن قولوا الحبلة ‏\"‏ ‏.‏ يعني العنب ‏.‏",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 5873,
			"arabicnumber": "2248.02",
			"text": "وحدثنيه زهير بن حرب، حدثنا عثمان بن عمر، حدثنا شعبة، عن سماك، قال سمعت علقمة بن وائل، عن أبيه، أن النبي صلى الله عليه وسلم قال ‏ \"‏ لا تقولوا الكرم ‏.‏ ولكن قولوا العنب والحبلة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 5874,
			"arabicnumber": "2249.01",
			"text": "حدثنا يحيى بن أيوب، وقتيبة، وابن، حجر قالوا حدثنا إسماعيل، - وهو ابن جعفر - عن العلاء، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا يقولن أحدكم عبدي وأمتي ‏.‏ كلكم عبيد الله وكل نسائكم إماء الله ولكن ليقل غلامي وجاريتي وفتاى وفتاتي ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 5875,
			"arabicnumber": "2249.02",
			"text": "وحدثني زهير بن حرب، حدثنا جرير، عن الأعمش، عن أبي صالح، عن أبي، هريرة قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا يقولن أحدكم عبدي ‏.‏ فكلكم عبيد الله ولكن ليقل فتاى ‏.‏ ولا يقل العبد ربي ‏.‏ ولكن ليقل سيدي ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 5876,
			"arabicnumber": "2249.03",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، ح وحدثنا أبو سعيد الأشج، حدثنا وكيع، كلاهما عن الأعمش، بهذا الإسناد وفي حديثهما ‏\"‏ ولا يقل العبد لسيده مولاى ‏\"‏ ‏.‏ وزاد في حديث أبي معاوية ‏\"‏ فإن مولاكم الله عز وجل ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 5877,
			"arabicnumber": "2249.04",
			"text": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم ‏.‏ فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏ \"‏ لا يقل أحدكم اسق ربك أطعم ربك وضئ ربك ‏.‏ ولا يقل أحدكم ربي ‏.‏ وليقل سيدي مولاى ولا يقل أحدكم عبدي أمتي ‏.‏ وليقل فتاى فتاتي غلامي ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 5878,
			"arabicnumber": "2250.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا سفيان بن عيينة، ح وحدثنا أبو كريب، محمد بن العلاء حدثنا أبو أسامة، كلاهما عن هشام، عن أبيه، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يقولن أحدكم خبثت نفسي ‏.‏ ولكن ليقل لقست نفسي ‏\"‏ ‏.‏ هذا حديث أبي كريب وقال أبو بكر عن النبي صلى الله عليه وسلم ‏.‏ ولم يذكر ‏\"‏ لكن ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 5879,
			"arabicnumber": "2250.02",
			"text": "وحدثناه أبو كريب، حدثنا أبو معاوية، بهذا الإسناد ‏.‏",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 5880,
			"arabicnumber": "2251",
			"text": "وحدثني أبو الطاهر، وحرملة، قالا أخبرنا ابن وهب، أخبرني يونس، عن ابن، شهاب عن أبي أمامة بن سهل بن حنيف، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا يقل أحدكم خبثت نفسي ‏.‏ وليقل لقست نفسي ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 5881,
			"arabicnumber": "2252.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، عن شعبة، حدثني خليد بن جعفر، عن أبي نضرة، عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم قال ‏ \"‏ كانت امرأة من بني إسرائيل قصيرة تمشي مع امرأتين طويلتين فاتخذت رجلين من خشب وخاتما من ذهب مغلق مطبق ثم حشته مسكا وهو أطيب الطيب فمرت بين المرأتين فلم يعرفوها فقالت بيدها هكذا ‏\"‏ ‏.‏ ونفض شعبة يده ‏.‏",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 5882,
			"arabicnumber": "2252.02",
			"text": "حدثنا عمرو الناقد، حدثنا يزيد بن هارون، عن شعبة، عن خليد بن جعفر، والمستمر، قالا سمعنا أبا نضرة، يحدث عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم ذكر امرأة من بني إسرائيل حشت خاتمها مسكا والمسك أطيب الطيب ‏.‏",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 5883,
			"arabicnumber": "2253",
			"text": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، كلاهما عن المقرئ، قال أبو بكر حدثنا أبو عبد الرحمن المقرئ، عن سعيد بن أبي أيوب، حدثني عبيد الله بن أبي جعفر، عن عبد الرحمن الأعرج، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من عرض عليه ريحان فلا يرده فإنه خفيف المحمل طيب الريح ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 5884,
			"arabicnumber": "2254",
			"text": "حدثني هارون بن سعيد الأيلي، وأبو طاهر وأحمد بن عيسى قال أحمد حدثنا وقال الآخران، أخبرنا ابن وهب، أخبرني مخرمة، عن أبيه، عن نافع، قال كان ابن عمر إذا استجمر استجمر بالألوة غير مطراة وبكافور يطرحه مع الألوة ثم قال هكذا كان يستجمر رسول الله صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 23
			}
		}
	]
}