{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"47": "The Book of Knowledge"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6775,
			"arabicnumber": "2665",
			"text": "حدثنا عبد الله بن مسلمة بن قعنب، حدثنا يزيد بن إبراهيم التستري، عن عبد، الله بن أبي مليكة عن القاسم بن محمد، عن عائشة، قالت تلا رسول الله صلى الله عليه وسلم ‏{‏ هو الذي أنزل عليك الكتاب منه آيات محكمات هن أم الكتاب وأخر متشابهات فأما الذين في قلوبهم زيغ فيتبعون ما تشابه منه ابتغاء الفتنة وابتغاء تأويله وما يعلم تأويله إلا الله والراسخون في العلم يقولون آمنا به كل من عند ربنا وما يذكر إلا أولو الألباب‏}‏ قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا رأيتم الذين يتبعون ما تشابه منه فأولئك الذين سمى الله فاحذروهم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6776,
			"arabicnumber": "2666",
			"text": "حدثنا أبو كامل، فضيل بن حسين الجحدري حدثنا حماد بن زيد، حدثنا أبو عمران الجوني قال كتب إلى عبد الله بن رباح الأنصاري أن عبد الله بن عمرو قال هجرت إلى رسول الله صلى الله عليه وسلم يوما - قال - فسمع أصوات رجلين اختلفا في آية فخرج علينا رسول الله صلى الله عليه وسلم يعرف في وجهه الغضب فقال ‏ \"‏ إنما هلك من كان قبلكم باختلافهم في الكتاب ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6777,
			"arabicnumber": "2667.01",
			"text": "حدثنا يحيى بن يحيى، أخبرنا أبو قدامة الحارث بن عبيد، عن أبي عمران، عن جندب بن عبد الله البجلي، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ اقرءوا القرآن ما ائتلفت عليه قلوبكم فإذا اختلفتم فيه فقوموا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6778,
			"arabicnumber": "2667.02",
			"text": "حدثني إسحاق بن منصور، أخبرنا عبد الصمد، حدثنا همام، حدثنا أبو عمران، الجوني عن جندب، - يعني ابن عبد الله - أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ اقرءوا القرآن ما ائتلفت عليه قلوبكم فإذا اختلفتم فقوموا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6779,
			"arabicnumber": "2667.03",
			"text": "حدثني أحمد بن سعيد بن صخر الدارمي، حدثنا حبان، حدثنا أبان، حدثنا أبو عمران قال قال لنا جندب ونحن غلمان بالكوفة قال رسول الله صلى الله عليه وسلم ‏ \"‏ اقرءوا القرآن ‏\"‏ ‏.‏ بمثل حديثهما ‏.‏",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6780,
			"arabicnumber": "2668",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن ابن جريج، عن ابن أبي مليكة، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن أبغض الرجال إلى الله الألد الخصم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6781,
			"arabicnumber": "2669.01",
			"text": "حدثني سويد بن سعيد، حدثنا حفص بن ميسرة، حدثني زيد بن أسلم، عن عطاء، بن يسار عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لتتبعن سنن الذين من قبلكم شبرا بشبر وذراعا بذراع حتى لو دخلوا في جحر ضب لاتبعتموهم ‏\"‏ ‏.‏ قلنا يا رسول الله آليهود والنصارى قال ‏\"‏ فمن ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6782,
			"arabicnumber": "2669.02",
			"text": "وحدثنا عدة، من أصحابنا عن سعيد بن أبي مريم، أخبرنا أبو غسان، - وهو محمد بن مطرف - عن زيد بن أسلم، بهذا الإسناد نحوه ‏.‏",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6783,
			"arabicnumber": "2669.03",
			"text": "قال أبو إسحاق إبراهيم بن محمد حدثنا محمد بن يحيى، حدثنا ابن أبي مريم، حدثنا أبو غسان، حدثنا زيد بن أسلم، عن عطاء بن يسار، ‏.‏ وذكر الحديث نحوه ‏.‏",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6784,
			"arabicnumber": "2670",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، ويحيى بن سعيد، عن ابن، جريج عن سليمان بن عتيق، عن طلق بن حبيب، عن الأحنف بن قيس، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ هلك المتنطعون ‏\"‏ ‏.‏ قالها ثلاثا ‏.‏",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6785,
			"arabicnumber": "2671.01",
			"text": "حدثنا شيبان بن فروخ، حدثنا عبد الوارث، حدثنا أبو التياح، حدثني أنس بن، مالك قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من أشراط الساعة أن يرفع العلم ويثبت الجهل ويشرب الخمر ويظهر الزنا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6786,
			"arabicnumber": "2671.02",
			"text": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، سمعت قتادة، يحدث عن أنس بن مالك، قال ألا أحدثكم حديثا سمعته من، رسول الله صلى الله عليه وسلم لا يحدثكم أحد بعدي سمعه منه ‏ \"‏ إن من أشراط الساعة أن يرفع العلم ويظهر الجهل ويفشو الزنا ويشرب الخمر ويذهب الرجال وتبقى النساء حتى يكون لخمسين امرأة قيم واحد ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6787,
			"arabicnumber": "2671.03",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، ح وحدثنا أبو كريب، حدثنا عبدة، وأبو أسامة كلهم عن سعيد بن أبي عروبة، عن قتادة، عن أنس بن مالك، عن النبي صلى الله عليه وسلم ‏.‏ وفي حديث ابن بشر وعبدة لا يحدثكموه أحد بعدي سمعت رسول الله صلى الله عليه وسلم يقول فذكر بمثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6788,
			"arabicnumber": "2672.01",
			"text": "حدثنا محمد بن عبد الله بن نمير، حدثنا وكيع، وأبي، قالا حدثنا الأعمش، ح وحدثني أبو سعيد الأشج، - واللفظ له - حدثنا وكيع، حدثنا الأعمش، عن أبي وائل، قال كنت جالسا مع عبد الله وأبي موسى فقالا قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن بين يدى الساعة أياما يرفع فيها العلم وينزل فيها الجهل ويكثر فيها الهرج والهرج القتل ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6789,
			"arabicnumber": "2672.02",
			"text": "حدثنا أبو بكر بن النضر بن أبي النضر، حدثنا أبو النضر، حدثنا عبيد الله الأشجعي، عن سفيان، عن الأعمش، عن أبي وائل، عن عبد الله، وأبي، موسى الأشعري قالا قال رسول الله صلى الله عليه وسلم ح وحدثني القاسم بن زكرياء، حدثنا حسين الجعفي، عن زائدة، عن سليمان، عن شقيق، قال كنت جالسا مع عبد الله وأبي موسى وهما يتحدثان فقالا قال رسول الله صلى الله عليه وسلم بمثل حديث وكيع وابن نمير ‏.‏",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 6790,
			"arabicnumber": "2672.03",
			"text": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب وابن نمير وإسحاق الحنظلي جميعا عن أبي معاوية، عن الأعمش، عن شقيق، عن أبي موسى، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 6791,
			"arabicnumber": "2672.04",
			"text": "حدثنا إسحاق بن إبراهيم، أخبرنا جرير، عن الأعمش، عن أبي وائل، قال إني لجالس مع عبد الله وأبي موسى وهما يتحدثان فقال أبو موسى قال رسول الله صلى الله عليه وسلم بمثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 6793,
			"arabicnumber": "157.05",
			"text": "حدثني حرملة بن يحيى، أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، حدثني حميد بن عبد الرحمن بن عوف، أن أبا هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يتقارب الزمان ويقبض العلم وتظهر الفتن ويلقى الشح ويكثر الهرج ‏\"‏ ‏.‏ قالوا وما الهرج قال ‏\"‏ القتل ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 6794,
			"arabicnumber": "157.06",
			"text": "حدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا أبو اليمان، أخبرنا شعيب، عن الزهري، حدثني حميد بن عبد الرحمن الزهري، أن أبا هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ يتقارب الزمان ويقبض العلم ‏\"‏ ‏.‏ ثم ذكر مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 6795,
			"arabicnumber": "157.08",
			"text": "حدثنا يحيى بن أيوب، وقتيبة، وابن، حجر قالوا حدثنا إسماعيل، - يعنون ابن جعفر - عن العلاء، عن أبيه، عن أبي هريرة، ح وحدثنا ابن نمير، وأبو كريب وعمرو الناقد قالوا حدثنا إسحاق بن سليمان، عن حنظلة، عن سالم، عن أبي هريرة، ح وحدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، عن أبي هريرة، ح وحدثني أبو الطاهر، أخبرنا ابن وهب، عن عمرو بن الحارث، عن أبي يونس، عن أبي هريرة، كلهم قال عن النبي صلى الله عليه وسلم ‏.‏ بمثل حديث الزهري عن حميد عن أبي هريرة غير أنهم لم يذكروا ‏ \"‏ ويلقى الشح ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 6796,
			"arabicnumber": "2673.01",
			"text": "حدثنا قتيبة بن سعيد، حدثنا جرير، عن هشام بن عروة، عن أبيه، سمعت عبد، الله بن عمرو بن العاص يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ إن الله لا يقبض العلم انتزاعا ينتزعه من الناس ولكن يقبض العلم بقبض العلماء حتى إذا لم يترك عالما اتخذ الناس رءوسا جهالا فسئلوا فأفتوا بغير علم فضلوا وأضلوا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 6797,
			"arabicnumber": "2673.02",
			"text": "حدثنا أبو الربيع العتكي، حدثنا حماد يعني ابن زيد، ح وحدثنا يحيى بن يحيى، أخبرنا عباد بن عباد، وأبو معاوية ح وحدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، قالا حدثنا وكيع، ح وحدثنا أبو كريب، حدثنا ابن إدريس، وأبو أسامة وابن نمير وعبدة ح وحدثنا ابن أبي عمر، حدثنا سفيان، ح وحدثني محمد بن حاتم، حدثنا يحيى بن سعيد، ح وحدثني أبو بكر بن نافع، قال حدثنا عمر بن علي، ح وحدثنا عبد بن حميد، حدثنا يزيد بن هارون، أخبرنا شعبة بن الحجاج، كلهم عن هشام بن عروة، عن أبيه، عن عبد، الله بن عمرو عن النبي صلى الله عليه وسلم ‏.‏ بمثل حديث جرير وزاد في حديث عمر بن علي ثم لقيت عبد الله بن عمرو على رأس الحول فسألته فرد علينا الحديث كما حدث قال سمعت رسول الله صلى الله عليه وسلم يقول ‏.‏",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 6798,
			"arabicnumber": "2673.03",
			"text": "حدثنا محمد بن المثنى، حدثنا عبد الله بن حمران، عن عبد الحميد بن جعفر، أخبرني أبي جعفر، عن عمر بن الحكم، عن عبد الله بن عمرو بن العاص، عن النبي صلى الله عليه وسلم بمثل حديث هشام بن عروة ‏.‏",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 6799,
			"arabicnumber": "2673.04",
			"text": "حدثنا حرملة بن يحيى التجيبي، أخبرنا عبد الله بن وهب، حدثني أبو شريح، أن أبا الأسود، حدثه عن عروة بن الزبير، قال قالت لي عائشة يا ابن أختي بلغني أنحمل عن النبي صلى الله عليه وسلم علما كثيرا - قال - فلقيته فساءلته عن أشياء يذكرها عن رسول الله صلى الله عليه وسلم ‏.‏ قال عروة فكان فيما ذكر أن النبي صلى الله عليه وسلم قال ‏ \"‏ إن الله لا ينتزع العلم من الناس انتزاعا ولكن يقبض العلماء فيرفع العلم معهم ويبقي في الناس رءوسا جهالا يفتونهم بغير علم فيضلون ويضلون ‏\"‏ ‏.‏ قال عروة فلما حدثت عائشة بذلك أعظمت ذلك وأنكرته قالت أحدثك أنه سمع النبي صلى الله عليه وسلم يقول هذا قال عروة حتى إذا كان قابل قالت له إن ابن عمرو قد قدم فالقه ثم فاتحه حتى تسأله عن الحديث الذي ذكره لك في العلم - قال - فلقيته فساءلته فذكره لي نحو ما حدثني به في مرته الأولى ‏.‏ قال عروة فلما أخبرتها بذلك قالت ما أحسبه إلا قد صدق أراه لم يزد فيه شيئا ولم ينقص ‏.‏",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 6800,
			"arabicnumber": "1017.05",
			"text": "حدثني زهير بن حرب، حدثنا جرير بن عبد الحميد، عن الأعمش، عن موسى، بن عبد الله بن يزيد وأبي الضحى عن عبد الرحمن بن هلال العبسي، عن جرير بن عبد، الله قال جاء ناس من الأعراب إلى رسول الله صلى الله عليه وسلم عليهم الصوف فرأى سوء حالهم قد أصابتهم حاجة فحث الناس على الصدقة فأبطئوا عنه حتى رئي ذلك في وجهه - قال - ثم إن رجلا من الأنصار جاء بصرة من ورق ثم جاء آخر ثم تتابعوا حتى عرف السرور في وجهه فقال رسول الله صلى الله عليه وسلم ‏ \"‏ من سن في الإسلام سنة حسنة فعمل بها بعده كتب له مثل أجر من عمل بها ولا ينقص من أجورهم شىء ومن سن في الإسلام سنة سيئة فعمل بها بعده كتب عليه مثل وزر من عمل بها ولا ينقص من أوزارهم شىء ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 6801,
			"arabicnumber": "1017.06",
			"text": "حدثنا يحيى بن يحيى، وأبو بكر بن أبي شيبة وأبو كريب جميعا عن أبي معاوية، عن الأعمش، عن مسلم، عن عبد الرحمن بن هلال، عن جرير، قال خطب رسول الله صلى الله عليه وسلم فحث على الصدقة ‏.‏ بمعنى حديث جرير ‏.‏",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 6802,
			"arabicnumber": "1017.07",
			"text": "حدثنا محمد بن بشار، حدثنا يحيى، - يعني ابن سعيد - حدثنا محمد بن أبي، إسماعيل حدثنا عبد الرحمن بن هلال العبسي، قال قال جرير بن عبد الله قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا يسن عبد سنة صالحة يعمل بها بعده ‏\"‏ ‏.‏ ثم ذكر تمام الحديث ‏.‏",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 6803,
			"arabicnumber": "1017.08",
			"text": "حدثني عبيد الله بن عمر القواريري، وأبو كامل ومحمد بن عبد الملك الأموي قالوا حدثنا أبو عوانة، عن عبد الملك بن عمير، عن المنذر بن جرير، عن أبيه، عن النبي صلى الله عليه وسلم ح وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، ح وحدثنا عبيد الله بن معاذ، حدثنا أبي قالوا، حدثنا شعبة، عن عون، بن أبي جحيفة عن المنذر بن جرير، عن أبيه، عن النبي صلى الله عليه وسلم بهذا الحديث ‏.‏",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 6804,
			"arabicnumber": "2674",
			"text": "حدثنا يحيى بن أيوب، وقتيبة بن سعيد، وابن، حجر قالوا حدثنا إسماعيل، - يعنون ابن جعفر - عن العلاء، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من دعا إلى هدى كان له من الأجر مثل أجور من تبعه لا ينقص ذلك من أجورهم شيئا ومن دعا إلى ضلالة كان عليه من الإثم مثل آثام من تبعه لا ينقص ذلك من آثامهم شيئا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 30
			}
		}
	]
}