{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"5": "The Book of Mosques and Places of Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1161,
			"arabicnumber": "520.01",
			"text": "حدثني أبو كامل الجحدري، حدثنا عبد الواحد، حدثنا الأعمش، ح قال وحدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، عن الأعمش، عن إبراهيم التيمي، عن أبيه، عن أبي ذر، قال قلت يا رسول الله أى مسجد وضع في الأرض أول قال ‏\"‏ المسجد الحرام ‏\"‏ ‏.‏ قلت ثم أى قال ‏\"‏ المسجد الأقصى ‏\"‏ ‏.‏ قلت كم بينهما قال ‏\"‏ أربعون سنة وأينما أدركتك الصلاة فصل فهو مسجد ‏\"‏ ‏.‏ وفي حديث أبي كامل ‏\"‏ ثم حيثما أدركتك الصلاة فصله فإنه مسجد ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1162,
			"arabicnumber": "520.02",
			"text": "حدثني علي بن حجر السعدي، أخبرنا علي بن مسهر، حدثنا الأعمش، عن إبراهيم بن يزيد التيمي، قال كنت أقرأ على أبي القرآن في السدة فإذا قرأت السجدة سجد فقلت له يا أبت أتسجد في الطريق قال إني سمعت أبا ذر يقول سألت رسول الله صلى الله عليه وسلم عن أول مسجد وضع في الأرض قال ‏\"‏ المسجد الحرام ‏\"‏ ‏.‏ قلت ثم أى قال ‏\"‏ المسجد الأقصى ‏\"‏ ‏.‏ قلت كم بينهما قال ‏\"‏ أربعون عاما ثم الأرض لك مسجد فحيثما أدركتك الصلاة فصل ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1163,
			"arabicnumber": "521.01",
			"text": "حدثنا يحيى بن يحيى، أخبرنا هشيم، عن سيار، عن يزيد الفقير، عن جابر بن عبد الله الأنصاري، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ أعطيت خمسا لم يعطهن أحد قبلي كان كل نبي يبعث إلى قومه خاصة وبعثت إلى كل أحمر وأسود وأحلت لي الغنائم ولم تحل لأحد قبلي وجعلت لي الأرض طيبة طهورا ومسجدا فأيما رجل أدركته الصلاة صلى حيث كان ونصرت بالرعب بين يدى مسيرة شهر وأعطيت الشفاعة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1164,
			"arabicnumber": "521.02",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا هشيم، أخبرنا سيار، حدثنا يزيد الفقير، أخبرنا جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم قال ‏.‏ فذكر نحوه ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1165,
			"arabicnumber": "522.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن فضيل، عن أبي مالك الأشجعي، عن ربعي، عن حذيفة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ فضلنا على الناس بثلاث جعلت صفوفنا كصفوف الملائكة وجعلت لنا الأرض كلها مسجدا وجعلت تربتها لنا طهورا إذا لم نجد الماء ‏\"‏ ‏.‏ وذكر خصلة أخرى ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1166,
			"arabicnumber": "522.02",
			"text": "حدثنا أبو كريب، محمد بن العلاء أخبرنا ابن أبي زائدة، عن سعد بن طارق، حدثني ربعي بن حراش، عن حذيفة، قال قال رسول الله صلى الله عليه وسلم ‏.‏ بمثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1167,
			"arabicnumber": "523.01",
			"text": "وحدثنا يحيى بن أيوب، وقتيبة بن سعيد، وعلي بن حجر، قالوا حدثنا إسماعيل، - وهو ابن جعفر - عن العلاء، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ فضلت على الأنبياء بست أعطيت جوامع الكلم ونصرت بالرعب وأحلت لي الغنائم وجعلت لي الأرض طهورا ومسجدا وأرسلت إلى الخلق كافة وختم بي النبيون ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1168,
			"arabicnumber": "523.02",
			"text": "حدثني أبو الطاهر، وحرملة، قالا أخبرنا ابن وهب، حدثني يونس، عن ابن شهاب، عن سعيد بن المسيب، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ بعثت بجوامع الكلم ونصرت بالرعب وبينا أنا نائم أتيت بمفاتيح خزائن الأرض فوضعت في يدى ‏\"‏ ‏.‏ قال أبو هريرة فذهب رسول الله صلى الله عليه وسلم وأنتم تنتثلونها ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1169,
			"arabicnumber": "523.03",
			"text": "وحدثنا حاجب بن الوليد، حدثنا محمد بن حرب، عن الزبيدي، عن الزهري، أخبرني سعيد بن المسيب، وأبو سلمة بن عبد الرحمن أن أبا هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏.‏ مثل حديث يونس ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1170,
			"arabicnumber": "523.04",
			"text": "حدثنا محمد بن رافع، وعبد بن حميد، قالا حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن ابن المسيب، وأبي، سلمة عن أبي هريرة، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1171,
			"arabicnumber": "523.05",
			"text": "وحدثني أبو الطاهر، أخبرنا ابن وهب، عن عمرو بن الحارث، عن أبي يونس، مولى أبي هريرة أنه حدثه عن أبي هريرة، عن رسول الله صلى الله عليه وسلم أنه قال ‏ \"‏ نصرت بالرعب على العدو وأوتيت جوامع الكلم وبينما أنا نائم أتيت بمفاتيح خزائن الأرض فوضعت في يدى ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1172,
			"arabicnumber": "523.06",
			"text": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏ \"‏ نصرت بالرعب وأوتيت جوامع الكلم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1173,
			"arabicnumber": "524.01",
			"text": "حدثنا يحيى بن يحيى، وشيبان بن فروخ، كلاهما عن عبد الوارث، - قال يحيى أخبرنا عبد الوارث بن سعيد، عن أبي التياح الضبعي، حدثنا أنس بن مالك، أن رسول الله صلى الله عليه وسلم قدم المدينة فنزل في علو المدينة في حى يقال لهم بنو عمرو بن عوف ‏.‏ فأقام فيهم أربع عشرة ليلة ثم إنه أرسل إلى ملإ بني النجار فجاءوا متقلدين بسيوفهم - قال - فكأني أنظر إلى رسول الله صلى الله عليه وسلم على راحلته وأبو بكر ردفه وملأ بني النجار حوله حتى ألقى بفناء أبي أيوب - قال - فكان رسول الله صلى الله عليه وسلم يصلي حيث أدركته الصلاة ويصلي في مرابض الغنم ثم إنه أمر بالمسجد قال فأرسل إلى ملإ بني النجار فجاءوا فقال ‏ \"‏ يا بني النجار ثامنوني بحائطكم هذا ‏\"‏ ‏.‏ قالوا لا والله لا نطلب ثمنه إلا إلى الله ‏.‏ قال أنس فكان فيه ما أقول كان فيه نخل وقبور المشركين وخرب ‏.‏ فأمر رسول الله صلى الله عليه وسلم بالنخل فقطع وبقبور المشركين فنبشت وبالخرب فسويت - قال - فصفوا النخل قبلة وجعلوا عضادتيه حجارة - قال - فكانوا يرتجزون ورسول الله صلى الله عليه وسلم معهم وهم يقولون اللهم إنه لا خير إلا خير الآخره فانصر الأنصار والمهاجره",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1174,
			"arabicnumber": "524.02",
			"text": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، حدثني أبو التياح، عن أنس، أن رسول الله صلى الله عليه وسلم كان يصلي في مرابض الغنم قبل أن يبنى المسجد ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1175,
			"arabicnumber": "524.03",
			"text": "وحدثناه يحيى بن يحيى، حدثنا خالد، - يعني ابن الحارث - حدثنا شعبة، عن أبي التياح، قال سمعت أنسا، يقول كان رسول الله صلى الله عليه وسلم بمثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1176,
			"arabicnumber": "525.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو الأحوص، عن أبي إسحاق، عن البراء بن عازب، قال صليت مع النبي صلى الله عليه وسلم إلى بيت المقدس ستة عشر شهرا حتى نزلت الآية التي في البقرة ‏{‏ وحيثما كنتم فولوا وجوهكم شطره‏}‏ فنزلت بعد ما صلى النبي صلى الله عليه وسلم فانطلق رجل من القوم فمر بناس من الأنصار وهم يصلون فحدثهم فولوا وجوههم قبل البيت ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1177,
			"arabicnumber": "525.02",
			"text": "حدثنا محمد بن المثنى، وأبو بكر بن خلاد جميعا عن يحيى، - قال ابن المثنى حدثنا يحيى بن سعيد، - عن سفيان، حدثني أبو إسحاق، قال سمعت البراء، يقول صلينا مع رسول الله صلى الله عليه وسلم نحو بيت المقدس ستة عشر شهرا أو سبعة عشر شهرا ثم صرفنا نحو الكعبة ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1178,
			"arabicnumber": "526.01",
			"text": "حدثنا شيبان بن فروخ، حدثنا عبد العزيز بن مسلم، حدثنا عبد الله بن دينار، عن ابن عمر، ح وحدثنا قتيبة بن سعيد، - واللفظ له - عن مالك بن أنس، عن عبد الله بن دينار، عن ابن عمر، قال بينما الناس في صلاة الصبح بقباء إذ جاءهم آت فقال إن رسول الله صلى الله عليه وسلم قد أنزل عليه الليلة ‏.‏ وقد أمر أن يستقبل الكعبة فاستقبلوها ‏.‏ وكانت وجوههم إلى الشام فاستداروا إلى الكعبة ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1179,
			"arabicnumber": "526.02",
			"text": "حدثني سويد بن سعيد، حدثني حفص بن ميسرة، عن موسى بن عقبة، عن نافع، عن ابن عمر، وعن عبد الله بن دينار، عن ابن عمر، قال بينما الناس في صلاة الغداة إذ جاءهم رجل ‏.‏ بمثل حديث مالك ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1180,
			"arabicnumber": "527",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا عفان، حدثنا حماد بن سلمة، عن ثابت، عن أنس، أن رسول الله صلى الله عليه وسلم كان يصلي نحو بيت المقدس فنزلت ‏{‏ قد نرى تقلب وجهك في السماء فلنولينك قبلة ترضاها فول وجهك شطر المسجد الحرام‏}‏ فمر رجل من بني سلمة وهم ركوع في صلاة الفجر وقد صلوا ركعة فنادى ألا إن القبلة قد حولت ‏.‏ فمالوا كما هم نحو القبلة ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1181,
			"arabicnumber": "528.01",
			"text": "وحدثني زهير بن حرب، حدثنا يحيى بن سعيد، حدثنا هشام، أخبرني أبي، عن عائشة، أن أم حبيبة، وأم سلمة ذكرتا كنيسة رأينها بالحبشة - فيها تصاوير - لرسول الله صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم ‏ \"‏ إن أولئك إذا كان فيهم الرجل الصالح فمات بنوا على قبره مسجدا وصوروا فيه تلك الصور أولئك شرار الخلق عند الله يوم القيامة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1182,
			"arabicnumber": "528.02",
			"text": "حدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، قالا حدثنا وكيع، حدثنا هشام بن عروة، عن أبيه، عن عائشة، أنهم تذاكروا عند رسول الله صلى الله عليه وسلم في مرضه فذكرت أم سلمة وأم حبيبة كنيسة ‏.‏ ثم ذكر نحوه ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1183,
			"arabicnumber": "528.03",
			"text": "حدثنا أبو كريب، حدثنا أبو معاوية، حدثنا هشام، عن أبيه، عن عائشة، قالت ذكرن أزواج النبي صلى الله عليه وسلم كنيسة رأينها بأرض الحبشة يقال لها مارية ‏.‏ بمثل حديثهم ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1184,
			"arabicnumber": "529",
			"text": "حدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، قالا حدثنا هاشم بن القاسم، حدثنا شيبان، عن هلال بن أبي حميد، عن عروة بن الزبير، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم في مرضه الذي لم يقم منه ‏ \"‏ لعن الله اليهود والنصارى اتخذوا قبور أنبيائهم مساجد ‏\"‏ ‏.‏ قالت فلولا ذاك أبرز قبره غير أنه خشي أن يتخذ مسجدا ‏.‏ وفي رواية ابن أبي شيبة ولولا ذاك لم يذكر قالت ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1185,
			"arabicnumber": "530.01",
			"text": "حدثنا هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني يونس، ومالك، عن ابن شهاب، حدثني سعيد بن المسيب، أن أبا هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ قاتل الله اليهود اتخذوا قبور أنبيائهم مساجد ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1186,
			"arabicnumber": "530.02",
			"text": "وحدثني قتيبة بن سعيد، حدثنا الفزاري، عن عبيد الله بن الأصم، حدثنا يزيد بن الأصم، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لعن الله اليهود والنصارى اتخذوا قبور أنبيائهم مساجد ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1187,
			"arabicnumber": "531",
			"text": "وحدثني هارون بن سعيد الأيلي، وحرملة بن يحيى، قال حرملة أخبرنا وقال، هارون حدثنا ابن وهب، أخبرني يونس، عن ابن شهاب، أخبرني عبيد الله بن عبد الله، أن عائشة، وعبد الله بن عباس، قالا لما نزلت برسول الله صلى الله عليه وسلم طفق يطرح خميصة له على وجهه فإذا اغتم كشفها عن وجهه فقال وهو كذلك ‏ \"‏ لعنة الله على اليهود والنصارى اتخذوا قبور أنبيائهم مساجد ‏\"‏ ‏.‏ يحذر مثل ما صنعوا ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1188,
			"arabicnumber": "532",
			"text": "حدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، - واللفظ لأبي بكر - قال إسحاق أخبرنا وقال أبو بكر، حدثنا زكرياء بن عدي، عن عبيد الله بن عمرو، عن زيد بن أبي أنيسة، عن عمرو بن مرة، عن عبد الله بن الحارث النجراني، قال حدثني جندب، قال سمعت النبي صلى الله عليه وسلم قبل أن يموت بخمس وهو يقول ‏ \"‏ إني أبرأ إلى الله أن يكون لي منكم خليل فإن الله تعالى قد اتخذني خليلا كما اتخذ إبراهيم خليلا ولو كنت متخذا من أمتي خليلا لاتخذت أبا بكر خليلا ألا وإن من كان قبلكم كانوا يتخذون قبور أنبيائهم وصالحيهم مساجد ألا فلا تتخذوا القبور مساجد إني أنهاكم عن ذلك ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1189,
			"arabicnumber": "533.01",
			"text": "حدثني هارون بن سعيد الأيلي، وأحمد بن عيسى، قالا حدثنا ابن وهب، أخبرني عمرو، أن بكيرا، حدثه أن عاصم بن عمر بن قتادة حدثه أنه، سمع عبيد الله الخولاني، يذكر أنه سمع عثمان بن عفان، عند قول الناس فيه حين بنى مسجد الرسول صلى الله عليه وسلم ‏.‏ إنكم قد أكثرتم وإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من بنى مسجدا لله تعالى - قال بكير حسبت أنه قال - يبتغي به وجه الله - بنى الله له بيتا في الجنة ‏\"‏ ‏.‏ وقال ابن عيسى في روايته ‏\"‏ مثله في الجنة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1190,
			"arabicnumber": "533.02",
			"text": "حدثنا زهير بن حرب، ومحمد بن المثنى، - واللفظ لابن المثنى - قالا حدثنا الضحاك بن مخلد، أخبرنا عبد الحميد بن جعفر، حدثني أبي، عن محمود بن لبيد، أن عثمان بن عفان، أراد بناء المسجد فكره الناس ذلك فأحبوا أن يدعه على هيئته فقال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ من بنى مسجدا لله بنى الله له في الجنة مثله ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1191,
			"arabicnumber": "534.01",
			"text": "حدثنا محمد بن العلاء الهمداني أبو كريب، قال حدثنا أبو معاوية، عن الأعمش، عن إبراهيم، عن الأسود، وعلقمة، قالا أتينا عبد الله بن مسعود في داره فقال أصلى هؤلاء خلفكم فقلنا لا ‏.‏ قال فقوموا فصلوا ‏.‏ فلم يأمرنا بأذان ولا إقامة - قال - وذهبنا لنقوم خلفه فأخذ بأيدينا فجعل أحدنا عن يمينه والآخر عن شماله - قال - فلما ركع وضعنا أيدينا على ركبنا - قال - فضرب أيدينا وطبق بين كفيه ثم أدخلهما بين فخذيه - قال - فلما صلى قال إنه ستكون عليكم أمراء يؤخرون الصلاة عن ميقاتها ويخنقونها إلى شرق الموتى فإذا رأيتموهم قد فعلوا ذلك فصلوا الصلاة لميقاتها واجعلوا صلاتكم معهم سبحة وإذا كنتم ثلاثة فصلوا جميعا وإذا كنتم أكثر من ذلك فليؤمكم أحدكم وإذا ركع أحدكم فليفرش ذراعيه على فخذيه وليجنأ وليطبق بين كفيه فلكأني أنظر إلى اختلاف أصابع رسول الله صلى الله عليه وسلم فأراهم ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1192,
			"arabicnumber": "534.02",
			"text": "وحدثنا منجاب بن الحارث التميمي، أخبرنا ابن مسهر، ح قال وحدثنا عثمان بن أبي شيبة، حدثنا جرير، ح قال وحدثني محمد بن رافع، حدثنا يحيى بن آدم، حدثنا مفضل، كلهم عن الأعمش، عن إبراهيم، عن علقمة، والأسود، أنهما دخلا على عبد الله ‏.‏ بمعنى حديث أبي معاوية ‏.‏ وفي حديث ابن مسهر وجرير فلكأني أنظر إلى اختلاف أصابع رسول الله صلى الله عليه وسلم وهو راكع ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1193,
			"arabicnumber": "534.03",
			"text": "حدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا عبيد الله بن موسى، عن إسرائيل، عن منصور، عن إبراهيم، عن علقمة، والأسود، أنهما دخلا على عبد الله فقال أصلى من خلفكم قالا نعم ‏.‏ فقام بينهما وجعل أحدهما عن يمينه والآخر عن شماله ثم ركعنا فوضعنا أيدينا على ركبنا فضرب أيدينا ثم طبق بين يديه ثم جعلهما بين فخذيه فلما صلى قال هكذا فعل رسول الله صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1194,
			"arabicnumber": "535.01",
			"text": "حدثنا قتيبة بن سعيد، وأبو كامل الجحدري - واللفظ لقتيبة - قالا حدثنا أبو عوانة، عن أبي يعفور، عن مصعب بن سعد، قال صليت إلى جنب أبي قال وجعلت يدى بين ركبتى فقال لي أبي اضرب بكفيك على ركبتيك ‏.‏ قال ثم فعلت ذلك مرة أخرى فضرب يدى وقال إنا نهينا عن هذا وأمرنا أن نضرب بالأكف على الركب ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1195,
			"arabicnumber": "535.02",
			"text": "حدثنا خلف بن هشام، حدثنا أبو الأحوص، ح قال وحدثنا ابن أبي عمر، حدثنا سفيان، كلاهما عن أبي يعفور، بهذا الإسناد إلى قوله فنهينا عنه ‏.‏ ولم يذكرا ما بعده ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1196,
			"arabicnumber": "535.03",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن إسماعيل بن أبي خالد، عن الزبير بن عدي، عن مصعب بن سعد، قال ركعت فقلت بيدى هكذا - يعني طبق بهما ووضعهما بين فخذيه - فقال أبي قد كنا نفعل هذا ثم أمرنا بالركب ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1197,
			"arabicnumber": "535.04",
			"text": "حدثني الحكم بن موسى، حدثنا عيسى بن يونس، حدثنا إسماعيل بن أبي خالد، عن الزبير بن عدي، عن مصعب بن سعد بن أبي وقاص، قال صليت إلى جنب أبي فلما ركعت شبكت أصابعي وجعلتهما بين ركبتى فضرب يدى فلما صلى قال قد كنا نفعل هذا ثم أمرنا أن نرفع إلى الركب ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1198,
			"arabicnumber": "536",
			"text": "حدثنا إسحاق بن إبراهيم، أخبرنا محمد بن بكر، ح قال وحدثنا حسن الحلواني، حدثنا عبد الرزاق، - وتقاربا في اللفظ - قالا جميعا أخبرنا ابن جريج أخبرني أبو الزبير أنه سمع طاوسا يقول قلنا لابن عباس في الإقعاء على القدمين فقال هي السنة ‏.‏ فقلنا له إنا لنراه جفاء بالرجل ‏.‏ فقال ابن عباس بل هي سنة نبيك صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1199,
			"arabicnumber": "537.01",
			"text": "حدثنا أبو جعفر، محمد بن الصباح وأبو بكر بن أبي شيبة - وتقاربا في لفظ الحديث - قالا حدثنا إسماعيل بن إبراهيم، عن حجاج الصواف، عن يحيى بن أبي كثير، عن هلال بن أبي ميمونة، عن عطاء بن يسار، عن معاوية بن الحكم السلمي، قال بينا أنا أصلي، مع رسول الله صلى الله عليه وسلم إذ عطس رجل من القوم فقلت يرحمك الله ‏.‏ فرماني القوم بأبصارهم فقلت واثكل أمياه ما شأنكم تنظرون إلى ‏.‏ فجعلوا يضربون بأيديهم على أفخاذهم فلما رأيتهم يصمتونني لكني سكت فلما صلى رسول الله صلى الله عليه وسلم فبأبي هو وأمي ما رأيت معلما قبله ولا بعده أحسن تعليما منه فوالله ما كهرني ولا ضربني ولا شتمني قال ‏\"‏ إن هذه الصلاة لا يصلح فيها شىء من كلام الناس إنما هو التسبيح والتكبير وقراءة القرآن ‏\"‏ ‏.‏ أو كما قال رسول الله صلى الله عليه وسلم قلت يا رسول الله إني حديث عهد بجاهلية وقد جاء الله بالإسلام وإن منا رجالا يأتون الكهان ‏.‏ قال ‏\"‏ فلا تأتهم ‏\"‏ ‏.‏ قال ومنا رجال يتطيرون ‏.‏ قال ‏\"‏ ذاك شىء يجدونه في صدورهم فلا يصدنهم ‏\"‏ ‏.‏ قال ابن الصباح ‏\"‏ فلا يصدنكم ‏\"‏ ‏.‏ قال قلت ومنا رجال يخطون ‏.‏ قال ‏\"‏ كان نبي من الأنبياء يخط فمن وافق خطه فذاك ‏\"‏ ‏.‏ قال وكانت لي جارية ترعى غنما لي قبل أحد والجوانية فاطلعت ذات يوم فإذا الذيب قد ذهب بشاة من غنمها وأنا رجل من بني آدم آسف كما يأسفون لكني صككتها صكة فأتيت رسول الله صلى الله عليه وسلم فعظم ذلك على قلت يا رسول الله أفلا أعتقها قال ‏\"‏ ائتني بها ‏\"‏ ‏.‏ فأتيته بها فقال لها ‏\"‏ أين الله ‏\"‏ ‏.‏ قالت في السماء ‏.‏ قال ‏\"‏ من أنا ‏\"‏ ‏.‏ قالت أنت رسول الله ‏.‏ قال ‏\"‏ أعتقها فإنها مؤمنة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1200,
			"arabicnumber": "537.02",
			"text": "حدثنا إسحاق بن إبراهيم، أخبرنا عيسى بن يونس، حدثنا الأوزاعي، عن يحيى بن أبي كثير، بهذا الإسناد نحوه ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1201,
			"arabicnumber": "538.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، وابن، نمير وأبو سعيد الأشج - وألفاظهم متقاربة - قالوا حدثنا ابن فضيل، حدثنا الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، قال كنا نسلم على رسول الله صلى الله عليه وسلم وهو في الصلاة فيرد علينا فلما رجعنا من عند النجاشي سلمنا عليه فلم يرد علينا فقلنا يا رسول الله كنا نسلم عليك في الصلاة فترد علينا ‏.‏ فقال ‏ \"‏ إن في الصلاة شغلا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1202,
			"arabicnumber": "538.02",
			"text": "حدثني ابن نمير، حدثني إسحاق بن منصور السلولي، حدثنا هريم بن سفيان، عن الأعمش، بهذا الإسناد ‏.‏ نحوه ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1203,
			"arabicnumber": "539.01",
			"text": "حدثنا يحيى بن يحيى، أخبرنا هشيم، عن إسماعيل بن أبي خالد، عن الحارث بن شبيل، عن أبي عمرو الشيباني، عن زيد بن أرقم، قال كنا نتكلم في الصلاة يكلم الرجل صاحبه وهو إلى جنبه في الصلاة حتى نزلت ‏{‏ وقوموا لله قانتين‏}‏ فأمرنا بالسكوت ونهينا عن الكلام ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1204,
			"arabicnumber": "539.02",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، ووكيع، ح قال وحدثنا إسحاق بن إبراهيم، أخبرنا عيسى بن يونس، كلهم عن إسماعيل بن أبي خالد، بهذا الإسناد نحوه ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1205,
			"arabicnumber": "540.01",
			"text": "حدثنا قتيبة بن سعيد، حدثنا ليث، ح وحدثنا محمد بن رمح، أخبرنا الليث، عن أبي الزبير، عن جابر، أنه قال إن رسول الله صلى الله عليه وسلم بعثني لحاجة ثم أدركته وهو يسير - قال قتيبة يصلي - فسلمت عليه فأشار إلى فلما فرغ دعاني فقال ‏ \"‏ إنك سلمت آنفا وأنا أصلي ‏\"‏ ‏.‏ وهو موجه حينئذ قبل المشرق ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1206,
			"arabicnumber": "540.02",
			"text": "حدثنا أحمد بن يونس، حدثنا زهير، حدثني أبو الزبير، عن جابر، قال أرسلني رسول الله صلى الله عليه وسلم وهو منطلق إلى بني المصطلق فأتيته وهو يصلي على بعيره فكلمته فقال لي بيده هكذا - وأومأ زهير بيده - ثم كلمته فقال لي هكذا - فأومأ زهير أيضا بيده نحو الأرض - وأنا أسمعه يقرأ يومئ برأسه فلما فرغ قال ‏ \"‏ ما فعلت في الذي أرسلتك له فإنه لم يمنعني أن أكلمك إلا أني كنت أصلي ‏\"‏ ‏.‏ قال زهير وأبو الزبير جالس مستقبل الكعبة فقال بيده أبو الزبير إلى بني المصطلق فقال بيده إلى غير الكعبة ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1207,
			"arabicnumber": "540.03",
			"text": "حدثنا أبو كامل الجحدري، حدثنا حماد بن زيد، عن كثير، عن عطاء، عن جابر، قال كنا مع النبي صلى الله عليه وسلم فبعثني في حاجة فرجعت وهو يصلي على راحلته ووجهه على غير القبلة فسلمت عليه فلم يرد على فلما انصرف قال ‏ \"‏ إنه لم يمنعني أن أرد عليك إلا أني كنت أصلي ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1208,
			"arabicnumber": "540.04",
			"text": "وحدثني محمد بن حاتم، حدثنا معلى بن منصور، حدثنا عبد الوارث بن سعيد، حدثنا كثير بن شنظير، عن عطاء، عن جابر، قال بعثني رسول الله صلى الله عليه وسلم في حاجة ‏.‏ بمعنى حديث حماد ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1209,
			"arabicnumber": "541.01",
			"text": "حدثنا إسحاق بن إبراهيم، وإسحاق بن منصور، قالا أخبرنا النضر بن شميل، أخبرنا شعبة، حدثنا محمد، - وهو ابن زياد - قال سمعت أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن عفريتا من الجن جعل يفتك على البارحة ليقطع على الصلاة وإن الله أمكنني منه فذعته فلقد هممت أن أربطه إلى جنب سارية من سواري المسجد حتى تصبحوا تنظرون إليه أجمعون - أو كلكم - ثم ذكرت قول أخي سليمان رب اغفر لي وهب لي ملكا لا ينبغي لأحد من بعدي ‏.‏ فرده الله خاسئا ‏\"‏ ‏.‏ وقال ابن منصور شعبة عن محمد بن زياد ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 1210,
			"arabicnumber": "541.02",
			"text": "حدثنا محمد بن بشار، حدثنا محمد، هو ابن جعفر ح قال وحدثناه أبو بكر بن أبي شيبة، حدثنا شبابة، كلاهما عن شعبة، في هذا الإسناد وليس في حديث ابن جعفر قوله فذعته ‏.‏ وأما ابن أبي شيبة فقال في روايته فدعته ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 1211,
			"arabicnumber": "542",
			"text": "حدثنا محمد بن سلمة المرادي، حدثنا عبد الله بن وهب، عن معاوية بن صالح، يقول حدثني ربيعة بن يزيد، عن أبي إدريس الخولاني، عن أبي الدرداء، قال قام رسول الله صلى الله عليه وسلم فسمعناه يقول ‏\"‏ أعوذ بالله منك ‏\"‏ ‏.‏ ثم قال ‏\"‏ ألعنك بلعنة الله ‏\"‏ ‏.‏ ثلاثا ‏.‏ وبسط يده كأنه يتناول شيئا فلما فرغ من الصلاة قلنا يا رسول الله قد سمعناك تقول في الصلاة شيئا لم نسمعك تقوله قبل ذلك ورأيناك بسطت يدك ‏.‏ قال ‏\"‏ إن عدو الله إبليس جاء بشهاب من نار ليجعله في وجهي فقلت أعوذ بالله منك ‏.‏ ثلاث مرات ثم قلت ألعنك بلعنة الله التامة فلم يستأخر ثلاث مرات ثم أردت أخذه والله لولا دعوة أخينا سليمان لأصبح موثقا يلعب به ولدان أهل المدينة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 1212,
			"arabicnumber": "543.01",
			"text": "حدثنا عبد الله بن مسلمة بن قعنب، وقتيبة بن سعيد، قالا حدثنا مالك، عن عامر بن عبد الله بن الزبير، ح وحدثنا يحيى بن يحيى، قال قلت لمالك حدثك عامر بن عبد الله بن الزبير، عن عمرو بن سليم الزرقي، عن أبي قتادة، أن رسول الله صلى الله عليه وسلم كان يصلي وهو حامل أمامة بنت زينب بنت رسول الله صلى الله عليه وسلم ولأبي العاص بن الربيع فإذا قام حملها وإذا سجد وضعها قال يحيى قال مالك نعم ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 1213,
			"arabicnumber": "543.02",
			"text": "حدثنا محمد بن أبي عمر، حدثنا سفيان، عن عثمان بن أبي سليمان، وابن، عجلان سمعا عامر بن عبد الله بن الزبير، يحدث عن عمرو بن سليم الزرقي، عن أبي قتادة الأنصاري، قال رأيت النبي صلى الله عليه وسلم يؤم الناس وأمامة بنت أبي العاص وهى ابنة زينب بنت النبي صلى الله عليه وسلم على عاتقه فإذا ركع وضعها وإذا رفع من السجود أعادها ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 1214,
			"arabicnumber": "543.03",
			"text": "حدثني أبو الطاهر، أخبرنا ابن وهب، عن مخرمة بن بكير، ح قال وحدثنا هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني مخرمة، عن أبيه، عن عمرو بن سليم الزرقي، قال سمعت أبا قتادة الأنصاري، يقول رأيت رسول الله صلى الله عليه وسلم يصلي للناس وأمامة بنت أبي العاص على عنقه فإذا سجد وضعها ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 1215,
			"arabicnumber": "543.04",
			"text": "حدثنا قتيبة بن سعيد، حدثنا ليث، ح قال وحدثنا محمد بن المثنى، حدثنا أبو بكر الحنفي، حدثنا عبد الحميد بن جعفر، جميعا عن سعيد المقبري، عن عمرو بن سليم الزرقي، سمع أبا قتادة، يقول بينا نحن في المسجد جلوس خرج علينا رسول الله صلى الله عليه وسلم ‏.‏ بنحو حديثهم غير أنه لم يذكر أنه أم الناس في تلك الصلاة ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 1216,
			"arabicnumber": "544.01",
			"text": "حدثنا يحيى بن يحيى، وقتيبة بن سعيد، كلاهما عن عبد العزيز، قال يحيى أخبرنا عبد العزيز بن أبي حازم، عن أبيه، أن نفرا، جاءوا إلى سهل بن سعد قد تماروا في المنبر من أى عود هو فقال أما والله إني لأعرف من أى عود هو ومن عمله ورأيت رسول الله صلى الله عليه وسلم أول يوم جلس عليه - قال - فقلت له يا أبا عباس فحدثنا ‏.‏ قال أرسل رسول الله صلى الله عليه وسلم إلى امرأة قال أبو حازم إنه ليسميها يومئذ ‏\"‏ انظري غلامك النجار يعمل لي أعوادا أكلم الناس عليها ‏\"‏ ‏.‏ فعمل هذه الثلاث درجات ثم أمر بها رسول الله صلى الله عليه وسلم فوضعت هذا الموضع فهى من طرفاء الغابة ‏.‏ ولقد رأيت رسول الله صلى الله عليه وسلم قام عليه فكبر وكبر الناس وراءه وهو على المنبر ثم رفع فنزل القهقرى حتى سجد في أصل المنبر ثم عاد حتى فرغ من آخر صلاته ثم أقبل على الناس فقال ‏\"‏ يا أيها الناس إني صنعت هذا لتأتموا بي ولتعلموا صلاتي ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 1217,
			"arabicnumber": "544.02",
			"text": "حدثنا قتيبة بن سعيد، حدثنا يعقوب بن عبد الرحمن بن محمد بن عبد الله بن عبد القاري القرشي، حدثني أبو حازم، أن رجالا، أتوا سهل بن سعد ح قال وحدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، وابن أبي عمر، قالوا حدثنا سفيان بن عيينة، عن أبي حازم، قال أتوا سهل بن سعد فسألوه من أى شىء منبر النبي صلى الله عليه وسلم وساقوا الحديث نحو حديث ابن أبي حازم ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 1218,
			"arabicnumber": "545",
			"text": "وحدثني الحكم بن موسى القنطري، حدثنا عبد الله بن المبارك، ح قال وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد، وأبو أسامة جميعا عن هشام، عن محمد، عن أبي هريرة، عن النبي صلى الله عليه وسلم أنه نهى أن يصلي الرجل مختصرا ‏.‏ وفي رواية أبي بكر قال نهى رسول الله صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 1219,
			"arabicnumber": "546.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، حدثنا هشام الدستوائي، عن يحيى بن أبي كثير، عن أبي سلمة، عن معيقيب، قال ذكر النبي صلى الله عليه وسلم المسح في المسجد - يعني الحصى - قال ‏ \"‏ إن كنت لا بد فاعلا فواحدة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 1223,
			"arabicnumber": "547.01",
			"text": "حدثنا يحيى بن يحيى التميمي، قال قرأت على مالك عن نافع، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم رأى بصاقا في جدار القبلة فحكه ثم أقبل على الناس فقال ‏ \"‏ إذا كان أحدكم يصلي فلا يبصق قبل وجهه فإن الله قبل وجهه إذا صلى ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 1224,
			"arabicnumber": "547.02",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، وأبو أسامة ح وحدثنا ابن نمير، حدثنا أبي جميعا، عن عبيد الله، ح وحدثنا قتيبة، ومحمد بن رمح، عن الليث بن سعد، ح وحدثني زهير بن حرب، حدثنا إسماعيل، - يعني ابن علية - عن أيوب، ح وحدثنا ابن رافع، حدثنا ابن أبي فديك، أخبرنا الضحاك، - يعني ابن عثمان ح وحدثني هارون بن عبد الله، حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني موسى بن عقبة، كلهم عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم أنه رأى نخامة في قبلة المسجد ‏.‏ إلا الضحاك فإن في حديثه نخامة في القبلة ‏.‏ بمعنى حديث مالك ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 1225,
			"arabicnumber": "548.01",
			"text": "حدثنا يحيى بن يحيى، وأبو بكر بن أبي شيبة وعمرو الناقد جميعا عن سفيان، - قال يحيى أخبرنا سفيان بن عيينة، - عن الزهري، عن حميد بن عبد الرحمن، عن أبي سعيد الخدري، أن النبي صلى الله عليه وسلم رأى نخامة في قبلة المسجد فحكها بحصاة ثم نهى أن يبزق الرجل عن يمينه أو أمامه ولكن يبزق عن يساره أو تحت قدمه اليسرى ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 1226,
			"arabicnumber": "548.02",
			"text": "حدثني أبو الطاهر، وحرملة، قالا حدثنا ابن وهب، عن يونس، ح قال وحدثني زهير بن حرب، حدثنا يعقوب بن إبراهيم، حدثنا أبي كلاهما، عن ابن شهاب، عن حميد بن عبد الرحمن، أن أبا هريرة، وأبا، سعيد أخبراه أن رسول الله صلى الله عليه وسلم رأى نخامة ‏.‏ بمثل حديث ابن عيينة ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 1227,
			"arabicnumber": "549",
			"text": "وحدثنا قتيبة بن سعيد، عن مالك بن أنس، فيما قرئ عليه عن هشام بن عروة، عن أبيه، عن عائشة، أن النبي صلى الله عليه وسلم رأى بصاقا في جدار القبلة أو مخاطا أو نخامة فحكه ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 1228,
			"arabicnumber": "550.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، جميعا عن ابن علية، قال زهير حدثنا ابن علية، عن القاسم بن مهران، عن أبي رافع، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم رأى نخامة في قبلة المسجد فأقبل على الناس فقال ‏ \"‏ ما بال أحدكم يقوم مستقبل ربه فيتنخع أمامه أيحب أحدكم أن يستقبل فيتنخع في وجهه فإذا تنخع أحدكم فليتنخع عن يساره تحت قدمه فإن لم يجد فليقل هكذا ‏\"‏ ‏.‏ ووصف القاسم فتفل في ثوبه ثم مسح بعضه على بعض ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 1229,
			"arabicnumber": "550.02",
			"text": "وحدثنا شيبان بن فروخ، حدثنا عبد الوارث، ح قال وحدثنا يحيى بن يحيى، أخبرنا هشيم، ح قال وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، كلهم عن القاسم بن مهران، عن أبي رافع، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏.‏ نحو حديث ابن علية وزاد في حديث هشيم قال أبو هريرة كأني أنظر إلى رسول الله صلى الله عليه وسلم يرد ثوبه بعضه على بعض ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 1230,
			"arabicnumber": "551",
			"text": "حدثنا محمد بن المثنى، وابن، بشار قال ابن المثنى حدثنا محمد بن جعفر، حدثنا شعبة، قال سمعت قتادة، يحدث عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا كان أحدكم في الصلاة فإنه يناجي ربه فلا يبزقن بين يديه ولا عن يمينه ولكن عن شماله تحت قدمه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 1231,
			"arabicnumber": "552.01",
			"text": "وحدثنا يحيى بن يحيى، وقتيبة بن سعيد، قال يحيى أخبرنا وقال، قتيبة حدثنا أبو عوانة، عن قتادة، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ البزاق في المسجد خطيئة وكفارتها دفنها ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 1232,
			"arabicnumber": "552.02",
			"text": "حدثنا يحيى بن حبيب الحارثي، حدثنا خالد، - يعني ابن الحارث - حدثنا شعبة، قال سألت قتادة عن التفل، في المسجد فقال سمعت أنس بن مالك، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ التفل في المسجد خطيئة وكفارتها دفنها ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 1233,
			"arabicnumber": "553",
			"text": "حدثنا عبد الله بن محمد بن أسماء الضبعي، وشيبان بن فروخ، قالا حدثنا مهدي بن ميمون، حدثنا واصل، مولى أبي عيينة عن يحيى بن عقيل، عن يحيى بن يعمر، عن أبي الأسود الديلي، عن أبي ذر، عن النبي صلى الله عليه وسلم قال ‏ \"‏ عرضت على أعمال أمتي حسنها وسيئها فوجدت في محاسن أعمالها الأذى يماط عن الطريق ووجدت في مساوي أعمالها النخاعة تكون في المسجد لا تدفن ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 1234,
			"arabicnumber": "554.01",
			"text": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا كهمس، عن يزيد بن عبد الله بن الشخير، عن أبيه، قال صليت مع رسول الله صلى الله عليه وسلم فرأيته تنخع فدلكها بنعله ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 1235,
			"arabicnumber": "554.02",
			"text": "وحدثني يحيى بن يحيى، أخبرنا يزيد بن زريع، عن الجريري، عن أبي العلاء، يزيد بن عبد الله بن الشخير عن أبيه، أنه صلى مع النبي صلى الله عليه وسلم قال فتنخع فدلكها بنعله اليسرى ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 1236,
			"arabicnumber": "555.01",
			"text": "حدثنا يحيى بن يحيى، أخبرنا بشر بن المفضل، عن أبي مسلمة، سعيد بن يزيد قال قلت لأنس بن مالك أكان رسول الله صلى الله عليه وسلم يصلي في النعلين قال نعم ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 1237,
			"arabicnumber": "555.02",
			"text": "حدثنا أبو الربيع الزهراني، حدثنا عباد بن العوام، حدثنا سعيد بن يزيد أبو مسلمة، قال سألت أنسا ‏.‏ بمثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 1238,
			"arabicnumber": "556.01",
			"text": "حدثني عمرو الناقد، وزهير بن حرب، ح قال وحدثني أبو بكر بن أبي شيبة، - واللفظ لزهير - قالوا حدثنا سفيان بن عيينة، عن الزهري، عن عروة، عن عائشة، أن النبي صلى الله عليه وسلم صلى في خميصة لها أعلام وقال ‏ \"‏ شغلتني أعلام هذه فاذهبوا بها إلى أبي جهم وائتوني بأنبجانيه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 1239,
			"arabicnumber": "556.02",
			"text": "حدثنا حرملة بن يحيى، أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، قال أخبرني عروة بن الزبير، عن عائشة، قالت قام رسول الله صلى الله عليه وسلم يصلي في خميصة ذات أعلام فنظر إلى علمها فلما قضى صلاته قال ‏ \"‏ اذهبوا بهذه الخميصة إلى أبي جهم بن حذيفة وائتوني بأنبجانيه فإنها ألهتني آنفا في صلاتي ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 1240,
			"arabicnumber": "556.03",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن هشام، عن أبيه، عن عائشة، أن النبي صلى الله عليه وسلم كانت له خميصة لها علم فكان يتشاغل بها في الصلاة فأعطاها أبا جهم وأخذ كساء له أنبجانيا ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 1241,
			"arabicnumber": "557.01",
			"text": "أخبرني عمرو الناقد، وزهير بن حرب، وأبو بكر بن أبي شيبة قالوا حدثنا سفيان بن عيينة، عن الزهري، عن أنس بن مالك، عن النبي صلى الله عليه وسلم قال ‏ \"‏ إذا حضر العشاء وأقيمت الصلاة فابدءوا بالعشاء ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 1242,
			"arabicnumber": "557.02",
			"text": "حدثنا هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني عمرو، عن ابن شهاب، قال حدثني أنس بن مالك، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إذا قرب العشاء وحضرت الصلاة فابدءوا به قبل أن تصلوا صلاة المغرب ولا تعجلوا عن عشائكم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 1243,
			"arabicnumber": "558",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا ابن نمير، وحفص، ووكيع، عن هشام، عن أبيه، عن عائشة، عن النبي صلى الله عليه وسلم ‏.‏ بمثل حديث ابن عيينة عن الزهري عن أنس ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 1244,
			"arabicnumber": "559.01",
			"text": "حدثنا ابن نمير، حدثنا أبي ح، قال وحدثنا أبو بكر بن أبي شيبة، - واللفظ له - حدثنا أبو أسامة، قالا حدثنا عبيد الله، عن نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا وضع عشاء أحدكم وأقيمت الصلاة فابدءوا بالعشاء ولا يعجلن حتى يفرغ منه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 1245,
			"arabicnumber": "559.02",
			"text": "وحدثنا محمد بن إسحاق المسيبي، حدثني أنس، - يعني ابن عياض - عن موسى بن عقبة، ح وحدثنا هارون بن عبد الله، حدثنا حماد بن مسعدة، عن ابن جريج، ح قال وحدثنا الصلت بن مسعود، حدثنا سفيان بن موسى، عن أيوب، كلهم عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم بنحوه ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 1246,
			"arabicnumber": "560.01",
			"text": "حدثنا محمد بن عباد، حدثنا حاتم، - هو ابن إسماعيل - عن يعقوب بن مجاهد، عن ابن أبي عتيق، قال تحدثت أنا والقاسم، عند عائشة - رضى الله عنها - حديثا وكان القاسم رجلا لحانة وكان لأم ولد فقالت له عائشة ما لك لا تحدث كما يتحدث ابن أخي هذا أما إني قد علمت من أين أتيت ‏.‏ هذا أدبته أمه وأنت أدبتك أمك - قال - فغضب القاسم وأضب عليها فلما رأى مائدة عائشة قد أتي بها قام ‏.‏ قالت أين قال أصلي ‏.‏ قالت اجلس ‏.‏ قال إني أصلي ‏.‏ قالت اجلس غدر إني سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ لا صلاة بحضرة الطعام ولا وهو يدافعه الأخبثان ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 1247,
			"arabicnumber": "560.02",
			"text": "حدثنا يحيى بن أيوب، وقتيبة بن سعيد، وابن، حجر قالوا حدثنا إسماعيل، - وهو ابن جعفر - أخبرني أبو حزرة القاص، عن عبد الله بن أبي عتيق، عن عائشة، عن النبي صلى الله عليه وسلم بمثله ولم يذكر في الحديث قصة القاسم ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 1248,
			"arabicnumber": "561.01",
			"text": "حدثنا محمد بن المثنى، وزهير بن حرب، قالا حدثنا يحيى، - وهو القطان - عن عبيد الله، قال أخبرني نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال في غزوة خيبر ‏ \"‏ من أكل من هذه الشجرة - يعني الثوم - فلا يأتين المساجد ‏\"‏ ‏.‏ قال زهير في غزوة ‏.‏ ولم يذكر خيبر ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 1249,
			"arabicnumber": "561.02",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا ابن نمير، ح قال وحدثنا محمد بن عبد الله بن نمير، - واللفظ له - حدثنا أبي قال، حدثنا عبيد الله، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من أكل من هذه البقلة فلا يقربن مساجدنا حتى يذهب ريحها ‏\"‏ ‏.‏ يعني الثوم ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 1250,
			"arabicnumber": "562",
			"text": "وحدثني زهير بن حرب، حدثنا إسماعيل، - يعني ابن علية - عن عبد العزيز، - وهو ابن صهيب - قال سئل أنس عن الثوم، فقال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من أكل من هذه الشجرة فلا يقربنا ولا يصلي معنا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 1252,
			"arabicnumber": "563",
			"text": "وحدثني محمد بن رافع، وعبد بن حميد، قال عبد أخبرنا وقال ابن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن ابن المسيب، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من أكل من هذه الشجرة فلا يقربن مسجدنا ولا يؤذينا بريح الثوم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 1253,
			"arabicnumber": "564.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا كثير بن هشام، عن هشام الدستوائي، عن أبي الزبير، عن جابر، قال نهى رسول الله صلى الله عليه وسلم عن أكل البصل والكراث ‏.‏ فغلبتنا الحاجة فأكلنا منها فقال ‏ \"‏ من أكل من هذه الشجرة المنتنة فلا يقربن مسجدنا فإن الملائكة تأذى مما يتأذى منه الإنس ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 1254,
			"arabicnumber": "564.02",
			"text": "وحدثني أبو الطاهر، وحرملة، قالا أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، قال حدثني عطاء بن أبي رباح، أن جابر بن عبد الله، قال - وفي رواية حرملة وزعم أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من أكل ثوما أو بصلا فليعتزلنا أو ليعتزل مسجدنا وليقعد في بيته ‏\"‏ ‏.‏ وأنه أتي بقدر فيه خضرات من بقول فوجد لها ريحا فسأل فأخبر بما فيها من البقول فقال ‏\"‏ قربوها ‏\"‏ ‏.‏ إلى بعض أصحابه فلما رآه كره أكلها قال ‏\"‏ كل فإني أناجي من لا تناجي ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 1255,
			"arabicnumber": "564.04",
			"text": "وحدثنا إسحاق بن إبراهيم، أخبرنا محمد بن بكر، ح قال وحدثني محمد بن رافع، حدثنا عبد الرزاق، قالا جميعا أخبرنا ابن جريج، بهذا الإسناد ‏ \"‏ من أكل من هذه الشجرة - يريد الثوم - فلا يغشنا في مسجدنا ‏\"‏ ‏.‏ ولم يذكر البصل والكراث ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 1256,
			"arabicnumber": "565",
			"text": "وحدثني عمرو الناقد، حدثنا إسماعيل ابن علية، عن الجريري، عن أبي نضرة، عن أبي سعيد، قال لم نعد أن فتحت، خيبر فوقعنا أصحاب رسول الله صلى الله عليه وسلم في تلك البقلة الثوم والناس جياع فأكلنا منها أكلا شديدا ثم رحنا إلى المسجد فوجد رسول الله صلى الله عليه وسلم الريح فقال ‏\"‏ من أكل من هذه الشجرة الخبيثة شيئا فلا يقربنا في المسجد ‏\"‏ ‏.‏ فقال الناس حرمت حرمت ‏.‏ فبلغ ذاك النبي صلى الله عليه وسلم فقال ‏\"‏ أيها الناس إنه ليس بي تحريم ما أحل الله لي ولكنها شجرة أكره ريحها ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 1257,
			"arabicnumber": "566",
			"text": "حدثنا هارون بن سعيد الأيلي، وأحمد بن عيسى، قالا حدثنا ابن وهب، أخبرني عمرو، عن بكير بن الأشج، عن ابن خباب، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم مر على زراعة بصل هو وأصحابه فنزل ناس منهم فأكلوا منه ولم يأكل آخرون فرحنا إليه فدعا الذين لم يأكلوا البصل وأخر الآخرين حتى ذهب ريحها ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 1258,
			"arabicnumber": "567.01",
			"text": "حدثنا محمد بن المثنى، حدثنا يحيى بن سعيد، حدثنا هشام، حدثنا قتادة، عن سالم بن أبي الجعد، عن معدان بن أبي طلحة، أن عمر بن الخطاب، خطب يوم الجمعة فذكر نبي الله صلى الله عليه وسلم وذكر أبا بكر قال إني رأيت كأن ديكا نقرني ثلاث نقرات وإني لا أراه إلا حضور أجلي وإن أقواما يأمرونني أن أستخلف وإن الله لم يكن ليضيع دينه ولا خلافته ولا الذي بعث به نبيه صلى الله عليه وسلم فإن عجل بي أمر فالخلافة شورى بين هؤلاء الستة الذين توفي رسول الله صلى الله عليه وسلم وهو عنهم راض وإني قد علمت أن أقواما يطعنون في هذا الأمر أنا ضربتهم بيدي هذه على الإسلام فإن فعلوا ذلك فأولئك أعداء الله الكفرة الضلال ثم إني لا أدع بعدي شيئا أهم عندي من الكلالة ما راجعت رسول الله صلى الله عليه وسلم في شىء ما راجعته في الكلالة وما أغلظ لي في شىء ما أغلظ لي فيه حتى طعن بإصبعه في صدري فقال ‏ \"‏ يا عمر ألا تكفيك آية الصيف التي في آخر سورة النساء ‏\"‏ ‏.‏ وإني إن أعش أقض فيها بقضية يقضي بها من يقرأ القرآن ومن لا يقرأ القرآن ثم قال اللهم إني أشهدك على أمراء الأمصار وإني إنما بعثتهم عليهم ليعدلوا عليهم وليعلموا الناس دينهم وسنة نبيهم صلى الله عليه وسلم ويقسموا فيهم فيئهم ويرفعوا إلى ما أشكل عليهم من أمرهم ثم إنكم أيها الناس تأكلون شجرتين لا أراهما إلا خبيثتين هذا البصل والثوم لقد رأيت رسول الله صلى الله عليه وسلم إذا وجد ريحهما من الرجل في المسجد أمر به فأخرج إلى البقيع فمن أكلهما فليمتهما طبخا ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 1259,
			"arabicnumber": "567.02",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا إسماعيل ابن علية، عن سعيد بن أبي عروبة، ح قال وحدثنا زهير بن حرب، وإسحاق بن إبراهيم، كلاهما عن شبابة بن سوار، قال حدثنا شعبة، جميعا عن قتادة، في هذا الإسناد مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 1260,
			"arabicnumber": "568.01",
			"text": "حدثنا أبو الطاهر، أحمد بن عمرو حدثنا ابن وهب، عن حيوة، عن محمد بن عبد الرحمن، عن أبي عبد الله، مولى شداد بن الهاد أنه سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ من سمع رجلا ينشد ضالة في المسجد فليقل لا ردها الله عليك فإن المساجد لم تبن لهذا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 1261,
			"arabicnumber": "568.02",
			"text": "وحدثنيه زهير بن حرب، حدثنا المقرئ، حدثنا حيوة، قال سمعت أبا الأسود، يقول حدثني أبو عبد الله، مولى شداد أنه سمع أبا هريرة، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏.‏ بمثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 1262,
			"arabicnumber": "569.01",
			"text": "وحدثني حجاج بن الشاعر، حدثنا عبد الرزاق، أخبرنا الثوري، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، أن رجلا، نشد في المسجد فقال من دعا إلى الجمل الأحمر ‏.‏ فقال النبي صلى الله عليه وسلم ‏ \"‏ لا وجدت ‏.‏ إنما بنيت المساجد لما بنيت له ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 1263,
			"arabicnumber": "569.02",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن أبي سنان، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، أن النبي صلى الله عليه وسلم لما صلى قام رجل فقال من دعا إلى الجمل الأحمر فقال النبي صلى الله عليه وسلم ‏ \"‏ لا وجدت إنما بنيت المساجد لما بنيت له ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 1264,
			"arabicnumber": "569.03",
			"text": "حدثنا قتيبة بن سعيد، حدثنا جرير، عن محمد بن شيبة، عن علقمة بن مرثد، عن ابن بريدة، عن أبيه، قال جاء أعرابي بعد ما صلى النبي صلى الله عليه وسلم صلاة الفجر ‏.‏ فأدخل رأسه من باب المسجد فذكر ‏.‏ بمثل حديثهما ‏.‏ قال مسلم هو شيبة بن نعامة أبو نعامة روى عنه مسعر وهشيم وجرير وغيرهم من الكوفيين ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 1265,
			"arabicnumber": "389.06",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن ابن شهاب، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إن أحدكم إذا قام يصلي جاءه الشيطان فلبس عليه حتى لا يدري كم صلى فإذا وجد ذلك أحدكم فليسجد سجدتين وهو جالس ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 1266,
			"arabicnumber": "389.07",
			"text": "حدثني عمرو الناقد، وزهير بن حرب، قالا حدثنا سفيان، - وهو ابن عيينة - ح قال وحدثنا قتيبة بن سعيد، ومحمد بن رمح، عن الليث بن سعد، كلاهما عن الزهري، بهذا الإسناد نحوه ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 1267,
			"arabicnumber": "389.08",
			"text": "حدثنا محمد بن المثنى، حدثنا معاذ بن هشام، حدثني أبي، عن يحيى بن أبي كثير، حدثنا أبو سلمة بن عبد الرحمن، أن أبا هريرة، حدثهم أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إذا نودي بالأذان أدبر الشيطان له ضراط حتى لا يسمع الأذان فإذا قضي الأذان أقبل فإذا ثوب بها أدبر فإذا قضي التثويب أقبل يخطر بين المرء ونفسه يقول اذكر كذا اذكر كذا ‏.‏ لما لم يكن يذكر حتى يظل الرجل إن يدري كم صلى فإذا لم يدر أحدكم كم صلى فليسجد سجدتين وهو جالس ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 1268,
			"arabicnumber": "389.09",
			"text": "حدثني حرملة بن يحيى، حدثنا ابن وهب، أخبرني عمرو، عن عبد ربه بن سعيد، عن عبد الرحمن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الشيطان إذا ثوب بالصلاة ولى وله ضراط ‏\"‏ ‏.‏ فذكر نحوه وزاد ‏\"‏ فهناه ومناه وذكره من حاجاته ما لم يكن يذكر ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 1269,
			"arabicnumber": "570.01",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن ابن شهاب، عن عبد الرحمن الأعرج، عن عبد الله ابن بحينة، قال صلى لنا رسول الله صلى الله عليه وسلم ركعتين من بعض الصلوات ثم قام فلم يجلس فقام الناس معه فلما قضى صلاته ونظرنا تسليمه كبر فسجد سجدتين وهو جالس قبل التسليم ثم سلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 1270,
			"arabicnumber": "570.02",
			"text": "وحدثنا قتيبة بن سعيد، حدثنا ليث، ح قال وحدثنا ابن رمح، أخبرنا الليث، عن ابن شهاب، عن الأعرج، عن عبد الله ابن بحينة الأسدي، حليف بني عبد المطلب أن رسول الله صلى الله عليه وسلم قام في صلاة الظهر وعليه جلوس فلما أتم صلاته سجد سجدتين يكبر في كل سجدة وهو جالس قبل أن يسلم وسجدهما الناس معه مكان ما نسي من الجلوس ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 1271,
			"arabicnumber": "570.03",
			"text": "وحدثنا أبو الربيع الزهراني، حدثنا حماد، حدثنا يحيى بن سعيد، عن عبد الرحمن الأعرج، عن عبد الله بن مالك ابن بحينة الأزدي، أن رسول الله صلى الله عليه وسلم قام في الشفع الذي يريد أن يجلس في صلاته فمضى في صلاته فلما كان في آخر الصلاة سجد قبل أن يسلم ثم سلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 1272,
			"arabicnumber": "571.01",
			"text": "وحدثني محمد بن أحمد بن أبي خلف، حدثنا موسى بن داود، حدثنا سليمان بن بلال، عن زيد بن أسلم، عن عطاء بن يسار، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا شك أحدكم في صلاته فلم يدر كم صلى ثلاثا أم أربعا فليطرح الشك وليبن على ما استيقن ثم يسجد سجدتين قبل أن يسلم فإن كان صلى خمسا شفعن له صلاته وإن كان صلى إتماما لأربع كانتا ترغيما للشيطان ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 1273,
			"arabicnumber": "571.02",
			"text": "حدثني أحمد بن عبد الرحمن بن وهب، حدثني عمي عبد الله، حدثني داود بن قيس، عن زيد بن أسلم، بهذا الإسناد وفي معناه قال ‏ \"‏ يسجد سجدتين قبل السلام ‏\"‏ ‏.‏ كما قال سليمان بن بلال ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 1274,
			"arabicnumber": "572.01",
			"text": "وحدثنا عثمان، وأبو بكر ابنا أبي شيبة وإسحاق بن إبراهيم جميعا عن جرير، - قال عثمان حدثنا جرير، - عن منصور، عن إبراهيم، عن علقمة، قال قال عبد الله صلى رسول الله صلى الله عليه وسلم - قال إبراهيم زاد أو نقص - فلما سلم قيل له يا رسول الله أحدث في الصلاة شىء قال ‏\"‏ وما ذاك ‏\"‏ ‏.‏ قالوا صليت كذا وكذا - قال - فثنى رجليه واستقبل القبلة فسجد سجدتين ثم سلم ثم أقبل علينا بوجهه فقال ‏\"‏ إنه لو حدث في الصلاة شىء أنبأتكم به ولكن إنما أنا بشر أنسى كما تنسون فإذا نسيت فذكروني وإذا شك أحدكم في صلاته فليتحر الصواب فليتم عليه ثم ليسجد سجدتين ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 1275,
			"arabicnumber": "572.02",
			"text": "حدثناه أبو كريب، حدثنا ابن بشر، ح قال وحدثني محمد بن حاتم، حدثنا وكيع، كلاهما عن مسعر، عن منصور، بهذا الإسناد ‏.‏ وفي رواية ابن بشر ‏\"‏ فلينظر أحرى ذلك للصواب ‏\"‏ ‏.‏ وفي رواية وكيع ‏\"‏ فليتحر الصواب ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 1276,
			"arabicnumber": "572.03",
			"text": "وحدثناه عبد الله بن عبد الرحمن الدارمي، أخبرنا يحيى بن حسان، حدثنا وهيب بن خالد، حدثنا منصور، بهذا الإسناد وقال منصور ‏ \"‏ فلينظر أحرى ذلك للصواب ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 1277,
			"arabicnumber": "572.04",
			"text": "حدثناه إسحاق بن إبراهيم، أخبرنا عبيد بن سعيد الأموي، حدثنا سفيان، عن منصور، بهذا الإسناد وقال ‏ \"‏ فليتحر الصواب ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 1278,
			"arabicnumber": "572.05",
			"text": "حدثناه محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، عن منصور، بهذا الإسناد وقال ‏ \"‏ فليتحر أقرب ذلك إلى الصواب ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 1279,
			"arabicnumber": "572.06",
			"text": "وحدثناه يحيى بن يحيى، أخبرنا فضيل بن عياض، عن منصور، بهذا الإسناد وقال ‏ \"‏ فليتحر الذي يرى أنه الصواب ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 1280,
			"arabicnumber": "572.07",
			"text": "وحدثناه ابن أبي عمر، حدثنا عبد العزيز بن عبد الصمد، عن منصور، بإسناد هؤلاء وقال ‏ \"‏ فليتحر الصواب ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 1281,
			"arabicnumber": "572.08",
			"text": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن الحكم، عن إبراهيم، عن علقمة، عن عبد الله، أن النبي صلى الله عليه وسلم صلى الظهر خمسا فلما سلم قيل له أزيد في الصلاة قال ‏ \"‏ وما ذاك ‏\"‏ ‏.‏ قالوا صليت خمسا ‏.‏ فسجد سجدتين ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 1282,
			"arabicnumber": "572.09",
			"text": "وحدثنا ابن نمير، حدثنا ابن إدريس، عن الحسن بن عبيد الله، عن إبراهيم، عن علقمة، أنه صلى بهم خمسا ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 1283,
			"arabicnumber": "572.10",
			"text": "حدثنا عثمان بن أبي شيبة، - واللفظ له - حدثنا جرير، عن الحسن بن عبيد الله، عن إبراهيم بن سويد، قال صلى بنا علقمة الظهر خمسا فلما سلم قال القوم يا أبا شبل قد صليت خمسا ‏.‏ قال كلا ما فعلت ‏.‏ قالوا بلى - قال - وكنت في ناحية القوم وأنا غلام فقلت بلى قد صليت خمسا ‏.‏ قال لي وأنت أيضا يا أعور تقول ذاك قال قلت نعم ‏.‏ قال فانفتل فسجد سجدتين ثم سلم ثم قال قال عبد الله صلى بنا رسول الله صلى الله عليه وسلم خمسا فلما انفتل توشوش القوم بينهم فقال ‏\"‏ ما شأنكم ‏\"‏ ‏.‏ قالوا يا رسول الله هل زيد في الصلاة قال ‏\"‏ لا ‏\"‏ ‏.‏ قالوا فإنك قد صليت خمسا ‏.‏ فانفتل ثم سجد سجدتين ثم سلم ثم قال ‏\"‏ إنما أنا بشر مثلكم أنسى كما تنسون ‏\"‏ ‏.‏ وزاد ابن نمير في حديثه ‏\"‏ فإذا نسي أحدكم فليسجد سجدتين ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 1284,
			"arabicnumber": "572.11",
			"text": "وحدثناه عون بن سلام الكوفي، أخبرنا أبو بكر النهشلي، عن عبد الرحمن بن الأسود، عن أبيه، عن عبد الله، قال صلى بنا رسول الله صلى الله عليه وسلم خمسا فقلنا يا رسول الله أزيد في الصلاة قال ‏\"‏ وما ذاك ‏\"‏ ‏.‏ قالوا صليت خمسا ‏.‏ قال ‏\"‏ إنما أنا بشر مثلكم أذكر كما تذكرون وأنسى كما تنسون ‏\"‏ ‏.‏ ثم سجد سجدتى السهو ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 1285,
			"arabicnumber": "572.12",
			"text": "وحدثنا منجاب بن الحارث التميمي، أخبرنا ابن مسهر، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، قال صلى رسول الله صلى الله عليه وسلم فزاد أو نقص - قال إبراهيم والوهم مني - فقيل يا رسول الله أزيد في الصلاة شىء فقال ‏ \"‏ إنما أنا بشر مثلكم أنسى كما تنسون فإذا نسي أحدكم فليسجد سجدتين وهو جالس ‏\"‏ ‏.‏ ثم تحول رسول الله صلى الله عليه وسلم فسجد سجدتين ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 1286,
			"arabicnumber": "572.13",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، ح قال وحدثنا ابن نمير، حدثنا حفص، وأبو معاوية عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، أن النبي صلى الله عليه وسلم سجد سجدتى السهو بعد السلام والكلام ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 1287,
			"arabicnumber": "572.14",
			"text": "وحدثني القاسم بن زكرياء، حدثنا حسين بن علي الجعفي، عن زائدة، عن سليمان، عن إبراهيم، عن علقمة، عن عبد الله، قال صلينا مع رسول الله صلى الله عليه وسلم فإما زاد أو نقص - قال إبراهيم وايم الله ما جاء ذاك إلا من قبلي - قال فقلنا يا رسول الله أحدث في الصلاة شىء فقال ‏\"‏ لا ‏\"‏ ‏.‏ قال فقلنا له الذي صنع فقال ‏\"‏ إذا زاد الرجل أو نقص فليسجد سجدتين ‏\"‏ ‏.‏ قال ثم سجد سجدتين ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 1288,
			"arabicnumber": "573.01",
			"text": "حدثني عمرو الناقد، وزهير بن حرب، جميعا عن ابن عيينة، - قال عمرو حدثنا سفيان بن عيينة، - حدثنا أيوب، قال سمعت محمد بن سيرين، يقول سمعت أبا هريرة، يقول صلى بنا رسول الله صلى الله عليه وسلم إحدى صلاتى العشي إما الظهر وإما العصر فسلم في ركعتين ثم أتى جذعا في قبلة المسجد فاستند إليها مغضبا وفي القوم أبو بكر وعمر فهابا أن يتكلما وخرج سرعان الناس قصرت الصلاة فقام ذو اليدين فقال يا رسول الله أقصرت الصلاة أم نسيت فنظر النبي صلى الله عليه وسلم يمينا وشمالا فقال ‏ \"‏ ما يقول ذو اليدين ‏\"‏ ‏.‏ قالوا صدق لم تصل إلا ركعتين ‏.‏ فصلى ركعتين وسلم ثم كبر ثم سجد ثم كبر فرفع ثم كبر وسجد ثم كبر ورفع ‏.‏ قال وأخبرت عن عمران بن حصين أنه قال وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 1289,
			"arabicnumber": "573.02",
			"text": "حدثنا أبو الربيع الزهراني، حدثنا حماد، حدثنا أيوب، عن محمد، عن أبي هريرة، قال صلى بنا رسول الله صلى الله عليه وسلم إحدى صلاتى العشي ‏.‏ بمعنى حديث سفيان ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 1290,
			"arabicnumber": "573.03",
			"text": "حدثنا قتيبة بن سعيد، عن مالك بن أنس، عن داود بن الحصين، عن أبي سفيان، مولى ابن أبي أحمد أنه قال سمعت أبا هريرة، يقول صلى لنا رسول الله صلى الله عليه وسلم صلاة العصر فسلم في ركعتين فقام ذو اليدين فقال أقصرت الصلاة يا رسول الله أم نسيت فقال رسول الله صلى الله عليه وسلم ‏\"‏ كل ذلك لم يكن ‏\"‏ ‏.‏ فقال قد كان بعض ذلك يا رسول الله ‏.‏ فأقبل رسول الله صلى الله عليه وسلم على الناس فقال ‏\"‏ أصدق ذو اليدين ‏\"‏ ‏.‏ فقالوا نعم يا رسول الله ‏.‏ فأتم رسول الله صلى الله عليه وسلم ما بقي من الصلاة ثم سجد سجدتين وهو جالس بعد التسليم ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 1291,
			"arabicnumber": "573.04",
			"text": "وحدثني حجاج بن الشاعر، حدثنا هارون بن إسماعيل الخزاز، حدثنا علي، - وهو ابن المبارك - حدثنا يحيى، حدثنا أبو سلمة، حدثنا أبو هريرة، أن رسول الله صلى الله عليه وسلم صلى ركعتين من صلاة الظهر ثم سلم فأتاه رجل من بني سليم فقال يا رسول الله أقصرت الصلاة أم نسيت وساق الحديث ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 1292,
			"arabicnumber": "573.05",
			"text": "وحدثني إسحاق بن منصور، أخبرنا عبيد الله بن موسى، عن شيبان، عن يحيى، عن أبي سلمة، عن أبي هريرة، قال بينا أنا أصلي، مع النبي صلى الله عليه وسلم صلاة الظهر سلم رسول الله صلى الله عليه وسلم من الركعتين فقام رجل من بني سليم ‏.‏ واقتص الحديث ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 1293,
			"arabicnumber": "574.01",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، جميعا عن ابن علية، - قال زهير حدثنا إسماعيل بن إبراهيم، - عن خالد، عن أبي قلابة، عن أبي المهلب، عن عمران بن حصين، أن رسول الله صلى الله عليه وسلم صلى العصر فسلم في ثلاث ركعات ثم دخل منزله فقام إليه رجل يقال له الخرباق وكان في يديه طول فقال يا رسول الله ‏.‏ فذكر له صنيعه ‏.‏ وخرج غضبان يجر رداءه حتى انتهى إلى الناس فقال ‏ \"‏ أصدق هذا ‏\"‏ ‏.‏ قالوا نعم ‏.‏ فصلى ركعة ثم سلم ثم سجد سجدتين ثم سلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 1294,
			"arabicnumber": "574.02",
			"text": "وحدثنا إسحاق بن إبراهيم، أخبرنا عبد الوهاب الثقفي، حدثنا خالد، - وهو الحذاء - عن أبي قلابة، عن أبي المهلب، عن عمران بن الحصين، قال سلم رسول الله صلى الله عليه وسلم في ثلاث ركعات من العصر ثم قام فدخل الحجرة فقام رجل بسيط اليدين فقال أقصرت الصلاة يا رسول الله ‏.‏ فخرج مغضبا فصلى الركعة التي كان ترك ثم سلم ثم سجد سجدتى السهو ثم سلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 1295,
			"arabicnumber": "575.01",
			"text": "حدثني زهير بن حرب، وعبيد الله بن سعيد، ومحمد بن المثنى، كلهم عن يحيى القطان، - قال زهير حدثنا يحيى بن سعيد، - عن عبيد الله، قال أخبرني نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم كان يقرأ القرآن فيقرأ سورة فيها سجدة فيسجد ونسجد معه حتى ما يجد بعضنا موضعا لمكان جبهته ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 1296,
			"arabicnumber": "575.02",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، حدثنا عبيد الله بن عمر، عن نافع، عن ابن عمر، قال ربما قرأ رسول الله صلى الله عليه وسلم القرآن فيمر بالسجدة فيسجد بنا حتى ازدحمنا عنده حتى ما يجد أحدنا مكانا ليسجد فيه في غير صلاة ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 1297,
			"arabicnumber": "576",
			"text": "حدثنا محمد بن المثنى، ومحمد بن بشار، قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن أبي إسحاق، قال سمعت الأسود، يحدث عن عبد الله، عن النبي صلى الله عليه وسلم أنه قرأ ‏{‏ والنجم‏}‏ فسجد فيها وسجد من كان معه غير أن شيخا أخذ كفا من حصى أو تراب فرفعه إلى جبهته وقال يكفيني هذا ‏.‏ قال عبد الله لقد رأيته بعد قتل كافرا ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 1298,
			"arabicnumber": "577",
			"text": "حدثنا يحيى بن يحيى، ويحيى بن أيوب، وقتيبة بن سعيد، وابن، حجر قال يحيى بن يحيى أخبرنا وقال الآخرون، حدثنا إسماعيل، وهو ابن جعفر عن يزيد بن خصيفة، عن ابن قسيط، عن عطاء بن يسار، أنه أخبره أنه، سأل زيد بن ثابت عن القراءة، مع الإمام فقال لا قراءة مع الإمام في شىء ‏.‏ وزعم أنه قرأ على رسول الله صلى الله عليه وسلم ‏{‏ والنجم إذا هوى‏}‏ فلم يسجد ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 1299,
			"arabicnumber": "578.01",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن عبد الله بن يزيد، مولى الأسود بن سفيان عن أبي سلمة بن عبد الرحمن، أن أبا هريرة، قرأ لهم ‏{‏ إذا السماء انشقت‏}‏ فسجد فيها فلما انصرف أخبرهم أن رسول الله صلى الله عليه وسلم سجد فيها ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 1300,
			"arabicnumber": "578.02",
			"text": "وحدثني إبراهيم بن موسى، أخبرنا عيسى، عن الأوزاعي، ح قال وحدثنا محمد بن المثنى، حدثنا ابن أبي عدي، عن هشام، كلاهما عن يحيى بن أبي كثير، عن أبي سلمة، عن أبي هريرة، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 1301,
			"arabicnumber": "578.03",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، قالا حدثنا سفيان بن عيينة، عن أيوب بن موسى، عن عطاء بن ميناء، عن أبي هريرة، قال سجدنا مع النبي صلى الله عليه وسلم في ‏{‏ إذا السماء انشقت‏}‏ و ‏{‏ اقرأ باسم ربك‏}‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 1302,
			"arabicnumber": "578.04",
			"text": "وحدثنا محمد بن رمح، أخبرنا الليث، عن يزيد بن أبي حبيب، عن صفوان بن سليم، عن عبد الرحمن الأعرج، مولى بني مخزوم عن أبي هريرة، أنه قال سجد رسول الله صلى الله عليه وسلم في ‏{‏ إذا السماء انشقت‏}‏ و ‏{‏ اقرأ باسم ربك‏}‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 1303,
			"arabicnumber": "578.05",
			"text": "وحدثني حرملة بن يحيى، حدثنا ابن وهب، أخبرني عمرو بن الحارث، عن عبيد الله بن أبي جعفر، عن عبد الرحمن الأعرج، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 1304,
			"arabicnumber": "578.06",
			"text": "وحدثنا عبيد الله بن معاذ، ومحمد بن عبد الأعلى، قالا حدثنا المعتمر، عن أبيه، عن بكر، عن أبي رافع، قال صليت مع أبي هريرة صلاة العتمة فقرأ ‏{‏ إذا السماء انشقت‏}‏ فسجد فيها ‏.‏ فقلت له ما هذه السجدة فقال سجدت بها خلف أبي القاسم صلى الله عليه وسلم فلا أزال أسجد بها حتى ألقاه ‏.‏ وقال ابن عبد الأعلى فلا أزال أسجدها ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 1305,
			"arabicnumber": "578.07",
			"text": "حدثني عمرو الناقد، حدثنا عيسى بن يونس، ح قال وحدثنا أبو كامل، حدثنا يزيد، - يعني ابن زريع - ح قال وحدثنا أحمد بن عبدة، حدثنا سليم بن أخضر، كلهم عن التيمي، بهذا الإسناد ‏.‏ غير أنهم لم يقولوا خلف أبي القاسم صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 1306,
			"arabicnumber": "578.08",
			"text": "وحدثني محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن عطاء بن أبي ميمونة، عن أبي رافع، قال رأيت أبا هريرة يسجد في ‏{‏ إذا السماء انشقت‏}‏ فقلت تسجد فيها فقال نعم رأيت خليلي صلى الله عليه وسلم يسجد فيها فلا أزال أسجد فيها حتى ألقاه ‏.‏ قال شعبة قلت النبي صلى الله عليه وسلم ‏.‏ قال نعم ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 1307,
			"arabicnumber": "579.01",
			"text": "حدثنا محمد بن معمر بن ربعي القيسي، حدثنا أبو هشام المخزومي، عن عبد الواحد، - وهو ابن زياد - حدثنا عثمان بن حكيم، حدثني عامر بن عبد الله بن الزبير، عن أبيه، قال كان رسول الله صلى الله عليه وسلم إذا قعد في الصلاة جعل قدمه اليسرى بين فخذه وساقه وفرش قدمه اليمنى ووضع يده اليسرى على ركبته اليسرى ووضع يده اليمنى على فخذه اليمنى وأشار بإصبعه ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 1308,
			"arabicnumber": "579.02",
			"text": "حدثنا قتيبة، حدثنا ليث، عن ابن عجلان، ح قال وحدثنا أبو بكر بن أبي شيبة، - واللفظ له - قال حدثنا أبو خالد الأحمر، عن ابن عجلان، عن عامر بن عبد الله بن الزبير، عن أبيه، قال كان رسول الله صلى الله عليه وسلم إذا قعد يدعو وضع يده اليمنى على فخذه اليمنى ويده اليسرى على فخذه اليسرى وأشار بإصبعه السبابة ووضع إبهامه على إصبعه الوسطى ويلقم كفه اليسرى ركبته ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 1309,
			"arabicnumber": "580.01",
			"text": "وحدثني محمد بن رافع، وعبد بن حميد، قال عبد أخبرنا وقال ابن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن عبيد الله بن عمر، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم كان إذا جلس في الصلاة وضع يديه على ركبتيه ورفع إصبعه اليمنى التي تلي الإبهام فدعا بها ويده اليسرى على ركبته اليسرى باسطها عليها ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 1310,
			"arabicnumber": "580.02",
			"text": "وحدثنا عبد بن حميد، حدثنا يونس بن محمد، حدثنا حماد بن سلمة، عن أيوب، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم كان إذا قعد في التشهد وضع يده اليسرى على ركبته اليسرى ووضع يده اليمنى على ركبته اليمنى وعقد ثلاثة وخمسين وأشار بالسبابة ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 1311,
			"arabicnumber": "580.03",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن مسلم بن أبي مريم، عن علي بن عبد الرحمن المعاوي، أنه قال رآني عبد الله بن عمر وأنا أعبث بالحصى في الصلاة فلما انصرف نهاني فقال اصنع كما كان رسول الله صلى الله عليه وسلم يصنع ‏.‏ فقلت وكيف كان رسول الله صلى الله عليه وسلم يصنع قال كان إذا جلس في الصلاة وضع كفه اليمنى على فخذه اليمنى وقبض أصابعه كلها وأشار بإصبعه التي تلي الإبهام ووضع كفه اليسرى على فخذه اليسرى ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 1312,
			"arabicnumber": "580.04",
			"text": "حدثنا ابن أبي عمر، حدثنا سفيان، عن مسلم بن أبي مريم، عن علي بن عبد الرحمن المعاوي، قال صليت إلى جنب ابن عمر ‏.‏ فذكر نحو حديث مالك وزاد قال سفيان فكان يحيى بن سعيد حدثنا به عن مسلم ثم حدثنيه مسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 1313,
			"arabicnumber": "581.01",
			"text": "حدثنا زهير بن حرب، حدثنا يحيى بن سعيد، عن شعبة، عن الحكم، ومنصور، عن مجاهد، عن أبي معمر، أن أميرا، كان بمكة يسلم تسليمتين فقال عبد الله أنى علقها قال الحكم في حديثه إن رسول الله صلى الله عليه وسلم كان يفعله ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 1314,
			"arabicnumber": "581.02",
			"text": "وحدثني أحمد بن حنبل، حدثنا يحيى بن سعيد، عن شعبة، عن الحكم، عن مجاهد، عن أبي معمر، عن عبد الله، - قال شعبة - رفعه مرة - أن أميرا أو رجلا سلم تسليمتين فقال عبد الله أنى علقها",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 1315,
			"arabicnumber": "582",
			"text": "وحدثنا إسحاق بن إبراهيم، أخبرنا أبو عامر العقدي، حدثنا عبد الله بن جعفر، عن إسماعيل بن محمد، عن عامر بن سعد، عن أبيه، قال كنت أرى رسول الله صلى الله عليه وسلم يسلم عن يمينه وعن يساره حتى أرى بياض خده ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 1316,
			"arabicnumber": "583.01",
			"text": "حدثنا زهير بن حرب، حدثنا سفيان بن عيينة، عن عمرو، قال أخبرني بذا أبو معبد، - ثم أنكره بعد - عن ابن عباس، قال كنا نعرف انقضاء صلاة رسول الله صلى الله عليه وسلم بالتكبير ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 1317,
			"arabicnumber": "583.02",
			"text": "حدثنا ابن أبي عمر، حدثنا سفيان بن عيينة، عن عمرو بن دينار، عن أبي معبد، مولى ابن عباس أنه سمعه يخبر، عن ابن عباس، قال ما كنا نعرف انقضاء صلاة رسول الله صلى الله عليه وسلم إلا بالتكبير ‏.‏ قال عمرو فذكرت ذلك لأبي معبد فأنكره وقال لم أحدثك بهذا ‏.‏ قال عمرو وقد أخبرنيه قبل ذلك ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 1318,
			"arabicnumber": "583.03",
			"text": "حدثنا محمد بن حاتم، أخبرنا محمد بن بكر، أخبرنا ابن جريج، ح قال وحدثني إسحاق بن منصور، - واللفظ له - قال أخبرنا عبد الرزاق، أخبرنا ابن جريج، أخبرني عمرو بن دينار، أن أبا معبد، مولى ابن عباس أخبره أن ابن عباس أخبره أن رفع الصوت بالذكر حين ينصرف الناس من المكتوبة كان على عهد النبي صلى الله عليه وسلم ‏.‏ وأنه قال قال ابن عباس كنت أعلم إذا انصرفوا بذلك إذا سمعته ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 1319,
			"arabicnumber": "584",
			"text": "حدثنا هارون بن سعيد، وحرملة بن يحيى، قال هارون حدثنا وقال، حرملة أخبرنا ابن وهب، أخبرني يونس بن يزيد، عن ابن شهاب، قال حدثني عروة بن الزبير، أن عائشة، قالت دخل على رسول الله صلى الله عليه وسلم وعندي امرأة من اليهود وهى تقول هل شعرت أنكم تفتنون في القبور قالت فارتاع رسول الله صلى الله عليه وسلم وقال ‏\"‏ إنما تفتن يهود ‏\"‏ ‏.‏ قالت عائشة فلبثنا ليالي ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ هل شعرت أنه أوحي إلى أنكم تفتنون في القبور ‏\"‏ ‏.‏ قالت عائشة فسمعت رسول الله صلى الله عليه وسلم بعد يستعيذ من عذاب القبر ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 1320,
			"arabicnumber": "585",
			"text": "وحدثني هارون بن سعيد، وحرملة بن يحيى، وعمرو بن سواد، قال حرملة أخبرنا وقال الآخران، حدثنا ابن وهب، أخبرني يونس، عن ابن شهاب، عن حميد بن عبد الرحمن، عن أبي هريرة، قال سمعت رسول الله صلى الله عليه وسلم بعد ذلك يستعيذ من عذاب القبر ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 1321,
			"arabicnumber": "586.01",
			"text": "حدثنا زهير بن حرب، وإسحاق بن إبراهيم، كلاهما عن جرير، قال زهير حدثنا جرير، عن منصور، عن أبي وائل، عن مسروق، عن عائشة، قالت دخلت على عجوزان من عجز يهود المدينة فقالتا إن أهل القبور يعذبون في قبورهم ‏.‏ قالت فكذبتهما ولم أنعم أن أصدقهما فخرجتا ودخل على رسول الله صلى الله عليه وسلم فقلت له يا رسول الله إن عجوزين من عجز يهود المدينة دخلتا على فزعمتا أن أهل القبور يعذبون في قبورهم فقال ‏ \"‏ صدقتا إنهم يعذبون عذابا تسمعه البهائم ‏\"‏ ‏.‏ قالت فما رأيته بعد في صلاة إلا يتعوذ من عذاب القبر ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 1322,
			"arabicnumber": "586.02",
			"text": "حدثنا هناد بن السري، حدثنا أبو الأحوص، عن أشعث، عن أبيه، عن مسروق، عن عائشة، بهذا الحديث وفيه قالت وما صلى صلاة بعد ذلك إلا سمعته يتعوذ من عذاب القبر ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 1323,
			"arabicnumber": "587",
			"text": "حدثني عمرو الناقد، وزهير بن حرب، قالا حدثنا يعقوب بن إبراهيم بن سعد، قال حدثنا أبي، عن صالح، عن ابن شهاب، قال أخبرني عروة بن الزبير، أن عائشة، قالت سمعت رسول الله صلى الله عليه وسلم يستعيذ في صلاته من فتنة الدجال ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 1324,
			"arabicnumber": "588.01",
			"text": "وحدثنا نصر بن علي الجهضمي، وابن، نمير وأبو كريب وزهير بن حرب جميعا عن وكيع، - قال أبو كريب حدثنا وكيع، - حدثنا الأوزاعي، عن حسان بن عطية، عن محمد بن أبي عائشة، عن أبي هريرة، وعن يحيى بن أبي كثير، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا تشهد أحدكم فليستعذ بالله من أربع يقول اللهم إني أعوذ بك من عذاب جهنم ومن عذاب القبر ومن فتنة المحيا والممات ومن شر فتنة المسيح الدجال ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 1325,
			"arabicnumber": "589",
			"text": "حدثني أبو بكر بن إسحاق، أخبرنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال أخبرني عروة بن الزبير، أن عائشة، زوج النبي صلى الله عليه وسلم أخبرته أن النبي صلى الله عليه وسلم كان يدعو في الصلاة ‏\"‏ اللهم إني أعوذ بك من عذاب القبر وأعوذ بك من فتنة المسيح الدجال وأعوذ بك من فتنة المحيا والممات اللهم إني أعوذ بك من المأثم والمغرم ‏\"‏ ‏.‏ قالت فقال له قائل ما أكثر ما تستعيذ من المغرم يا رسول الله ‏.‏ فقال ‏\"‏ إن الرجل إذا غرم حدث فكذب ووعد فأخلف ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 1326,
			"arabicnumber": "588.02",
			"text": "وحدثني زهير بن حرب، حدثنا الوليد بن مسلم، حدثني الأوزاعي، حدثنا حسان بن عطية، حدثني محمد بن أبي عائشة، أنه سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا فرغ أحدكم من التشهد الآخر فليتعوذ بالله من أربع من عذاب جهنم ومن عذاب القبر ومن فتنة المحيا والممات ومن شر المسيح الدجال ‏\"‏ ‏.‏ وحدثنيه الحكم بن موسى، حدثنا هقل بن زياد، ح قال وحدثنا علي بن خشرم، أخبرنا عيسى، - يعني ابن يونس - جميعا عن الأوزاعي، بهذا الإسناد وقال ‏\"‏ إذا فرغ أحدكم من التشهد ‏\"‏ ‏.‏ ولم يذكر ‏\"‏ الآخر ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 1327,
			"arabicnumber": "588.03",
			"text": "حدثنا محمد بن المثنى، حدثنا ابن أبي عدي، عن هشام، عن يحيى، عن أبي سلمة، أنه سمع أبا هريرة، يقول قال نبي الله صلى الله عليه وسلم ‏ \"‏ اللهم إني أعوذ بك من عذاب القبر وعذاب النار وفتنة المحيا والممات وشر المسيح الدجال ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 1328,
			"arabicnumber": "588.04",
			"text": "وحدثنا محمد بن عباد، حدثنا سفيان، عن عمرو، عن طاوس، قال سمعت أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ عوذوا بالله من عذاب الله عوذوا بالله من عذاب القبر عوذوا بالله من فتنة المسيح الدجال عوذوا بالله من فتنة المحيا والممات ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 1329,
			"arabicnumber": "588.05",
			"text": "حدثنا محمد بن عباد، حدثنا سفيان، عن ابن طاوس، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 1330,
			"arabicnumber": "588.06",
			"text": "وحدثنا محمد بن عباد، وأبو بكر بن أبي شيبة وزهير بن حرب قالوا حدثنا سفيان، عن أبي الزناد، عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 1331,
			"arabicnumber": "588.07",
			"text": "حدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، عن بديل، عن عبد الله بن شقيق، عن أبي هريرة، عن النبي صلى الله عليه وسلم أنه كان يتعوذ من عذاب القبر وعذاب جهنم وفتنة الدجال ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 1333,
			"arabicnumber": "590",
			"text": "وحدثنا قتيبة بن سعيد، عن مالك بن أنس، - فيما قرئ عليه - عن أبي الزبير، عن طاوس، عن ابن عباس، أن رسول الله صلى الله عليه وسلم كان يعلمهم هذا الدعاء كما يعلمهم السورة من القرآن يقول ‏ \"‏ قولوا اللهم إنا نعوذ بك من عذاب جهنم وأعوذ بك من عذاب القبر وأعوذ بك من فتنة المسيح الدجال وأعوذ بك من فتنة المحيا والممات ‏\"‏ ‏.‏ قال مسلم بن الحجاج بلغني أن طاوسا قال لابنه أدعوت بها في صلاتك فقال لا ‏.‏ قال أعد صلاتك لأن طاوسا رواه عن ثلاثة أو أربعة أو كما قال ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 1334,
			"arabicnumber": "591",
			"text": "حدثنا داود بن رشيد، حدثنا الوليد، عن الأوزاعي، عن أبي عمار، - اسمه شداد بن عبد الله - عن أبي أسماء، عن ثوبان، قال كان رسول الله صلى الله عليه وسلم إذا انصرف من صلاته استغفر ثلاثا وقال ‏ \"‏ اللهم أنت السلام ومنك السلام تباركت ذا الجلال والإكرام ‏\"‏ ‏.‏ قال الوليد فقلت للأوزاعي كيف الاستغفار قال تقول أستغفر الله أستغفر الله ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 1335,
			"arabicnumber": "592.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، وابن، نمير قالا حدثنا أبو معاوية، عن عاصم، عن عبد الله بن الحارث، عن عائشة، قالت كان النبي صلى الله عليه وسلم إذا سلم لم يقعد إلا مقدار ما يقول ‏\"‏ اللهم أنت السلام ومنك السلام تباركت ذا الجلال والإكرام ‏\"‏ ‏.‏ وفي رواية ابن نمير ‏\"‏ يا ذا الجلال والإكرام ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 1336,
			"arabicnumber": "592.02",
			"text": "وحدثناه ابن نمير، حدثنا أبو خالد، - يعني الأحمر - عن عاصم، بهذا الإسناد وقال ‏ \"‏ يا ذا الجلال والإكرام ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 1337,
			"arabicnumber": "592.03",
			"text": "وحدثنا عبد الوارث بن عبد الصمد، حدثني أبي، حدثنا شعبة، عن عاصم، عن عبد الله بن الحارث، وخالد، عن عبد الله بن الحارث، كلاهما عن عائشة، أن النبي صلى الله عليه وسلم قال ‏.‏ بمثله غير أنه كان يقول ‏ \"‏ يا ذا الجلال والإكرام ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 1338,
			"arabicnumber": "593.01",
			"text": "حدثنا إسحاق بن إبراهيم، أخبرنا جرير، عن منصور، عن المسيب بن رافع، عن وراد، مولى المغيرة بن شعبة قال كتب المغيرة بن شعبة إلى معاوية أن رسول الله صلى الله عليه وسلم كان إذا فرغ من الصلاة وسلم قال ‏ \"‏ لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شىء قدير اللهم لا مانع لما أعطيت ولا معطي لما منعت ولا ينفع ذا الجد منك الجد ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 1339,
			"arabicnumber": "593.02",
			"text": "وحدثناه أبو بكر بن أبي شيبة، وأبو كريب وأحمد بن سنان قالوا حدثنا أبو معاوية، عن الأعمش، عن المسيب بن رافع، عن وراد، مولى المغيرة بن شعبة عن المغيرة، عن النبي صلى الله عليه وسلم ‏.‏ مثله قال أبو بكر وأبو كريب في روايتهما قال فأملاها على المغيرة وكتبت بها إلى معاوية ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 1340,
			"arabicnumber": "593.03",
			"text": "وحدثني محمد بن حاتم، حدثنا محمد بن بكر، أخبرنا ابن جريج، أخبرني عبدة بن أبي لبابة، أن ورادا، مولى المغيرة بن شعبة قال كتب المغيرة بن شعبة إلى معاوية - كتب ذلك الكتاب له وراد - إني سمعت رسول الله صلى الله عليه وسلم يقول حين سلم ‏.‏ بمثل حديثهما ‏.‏ إلا قوله ‏ \"‏ وهو على كل شىء قدير ‏\"‏ ‏.‏ فإنه لم يذكر ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 1341,
			"arabicnumber": "593.04",
			"text": "وحدثنا حامد بن عمر البكراوي، حدثنا بشر، - يعني ابن المفضل ح قال وحدثنا محمد بن المثنى، حدثني أزهر، جميعا عن ابن عون، عن أبي سعيد، عن وراد، كاتب المغيرة بن شعبة قال كتب معاوية إلى المغيرة ‏.‏ بمثل حديث منصور والأعمش ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 1342,
			"arabicnumber": "593.05",
			"text": "وحدثنا ابن أبي عمر المكي، حدثنا سفيان، حدثنا عبدة بن أبي لبابة، وعبد الملك بن عمير، سمعا ورادا، كاتب المغيرة بن شعبة يقول كتب معاوية إلى المغيرة اكتب إلى بشىء سمعته من رسول الله صلى الله عليه وسلم ‏.‏ قال فكتب إليه سمعت رسول الله صلى الله عليه وسلم يقول إذا قضى الصلاة ‏ \"‏ لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شىء قدير اللهم لا مانع لما أعطيت ولا معطي لما منعت ولا ينفع ذا الجد منك الجد ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 1343,
			"arabicnumber": "594.01",
			"text": "وحدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا هشام، عن أبي الزبير، قال كان ابن الزبير يقول في دبر كل صلاة حين يسلم ‏ \"‏ لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شىء قدير لا حول ولا قوة إلا بالله لا إله إلا الله ولا نعبد إلا إياه له النعمة وله الفضل وله الثناء الحسن لا إله إلا الله مخلصين له الدين ولو كره الكافرون ‏\"‏ ‏.‏ وقال كان رسول الله صلى الله عليه وسلم يهلل بهن دبر كل صلاة ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 1344,
			"arabicnumber": "594.02",
			"text": "وحدثناه أبو بكر بن أبي شيبة، حدثنا عبدة بن سليمان، عن هشام بن عروة، عن أبي الزبير، مولى لهم أن عبد الله بن الزبير، كان يهلل دبر كل صلاة ‏.‏ بمثل حديث ابن نمير وقال في آخره ثم يقول ابن الزبير كان رسول الله صلى الله عليه وسلم يهلل بهن دبر كل صلاة ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 1345,
			"arabicnumber": "594.03",
			"text": "وحدثني يعقوب بن إبراهيم الدورقي، حدثنا ابن علية، حدثنا الحجاج بن أبي عثمان، حدثني أبو الزبير، قال سمعت عبد الله بن الزبير، يخطب على هذا المنبر وهو يقول كان رسول الله صلى الله عليه وسلم يقول إذا سلم في دبر الصلاة أو الصلوات ‏.‏ فذكر بمثل حديث هشام بن عروة ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 1346,
			"arabicnumber": "594.05",
			"text": "وحدثني محمد بن سلمة المرادي، حدثنا عبد الله بن وهب، عن يحيى بن عبد الله بن سالم، عن موسى بن عقبة، أن أبا الزبير المكي، حدثه أنه، سمع عبد الله بن الزبير، وهو يقول في إثر الصلاة إذا سلم ‏.‏ بمثل حديثهما وقال في آخره وكان يذكر ذلك عن رسول الله صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 1347,
			"arabicnumber": "595.01",
			"text": "حدثنا عاصم بن النضر التيمي، حدثنا المعتمر، حدثنا عبيد الله، ح قال وحدثنا قتيبة بن سعيد، حدثنا ليث، عن ابن عجلان، كلاهما عن سمى، عن أبي صالح، عن أبي هريرة، - وهذا حديث قتيبة أن فقراء، المهاجرين أتوا رسول الله صلى الله عليه وسلم فقالوا ذهب أهل الدثور بالدرجات العلى والنعيم المقيم ‏.‏ فقال ‏\"‏ وما ذاك ‏\"‏ ‏.‏ قالوا يصلون كما نصلي ويصومون كما نصوم ويتصدقون ولا نتصدق ويعتقون ولا نعتق ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أفلا أعلمكم شيئا تدركون به من سبقكم وتسبقون به من بعدكم ولا يكون أحد أفضل منكم إلا من صنع مثل ما صنعتم ‏\"‏ ‏.‏ قالوا بلى يا رسول الله ‏.‏ قال ‏\"‏ تسبحون وتكبرون وتحمدون دبر كل صلاة ثلاثا وثلاثين مرة ‏\"‏ ‏.‏ قال أبو صالح فرجع فقراء المهاجرين إلى رسول الله صلى الله عليه وسلم فقالوا سمع إخواننا أهل الأموال بما فعلنا ففعلوا مثله ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ذلك فضل الله يؤتيه من يشاء ‏\"‏ ‏.‏ وزاد غير قتيبة في هذا الحديث عن الليث عن ابن عجلان قال سمى فحدثت بعض أهلي هذا الحديث فقال وهمت إنما قال ‏\"‏ تسبح الله ثلاثا وثلاثين وتحمد الله ثلاثا وثلاثين وتكبر الله ثلاثا وثلاثين ‏\"‏ ‏.‏ فرجعت إلى أبي صالح فقلت له ذلك فأخذ بيدي فقال الله أكبر وسبحان الله والحمد لله والله أكبر وسبحان الله والحمد لله حتى تبلغ من جميعهن ثلاثة وثلاثين ‏.‏ قال ابن عجلان فحدثت بهذا الحديث رجاء بن حيوة فحدثني بمثله عن أبي صالح عن أبي هريرة عن رسول الله صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 1348,
			"arabicnumber": "595.02",
			"text": "وحدثني أمية بن بسطام العيشي، حدثنا يزيد بن زريع، حدثنا روح، عن سهيل، عن أبيه، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم أنهم قالوا يا رسول الله ذهب أهل الدثور بالدرجات العلى والنعيم المقيم ‏.‏ بمثل حديث قتيبة عن الليث إلا أنه أدرج في حديث أبي هريرة قول أبي صالح ثم رجع فقراء المهاجرين ‏.‏ إلى آخر الحديث وزاد في الحديث يقول سهيل إحدى عشرة إحدى عشرة فجميع ذلك كله ثلاثة وثلاثون ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 1349,
			"arabicnumber": "596.01",
			"text": "وحدثنا الحسن بن عيسى، أخبرنا ابن المبارك، أخبرنا مالك بن مغول، قال سمعت الحكم بن عتيبة، يحدث عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، عن رسول الله صلى الله عليه وسلم قال ‏ \"‏ معقبات لا يخيب قائلهن - أو فاعلهن - دبر كل صلاة مكتوبة ثلاث وثلاثون تسبيحة وثلاث وثلاثون تحميدة وأربع وثلاثون تكبيرة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 1352,
			"arabicnumber": "597.01",
			"text": "حدثني عبد الحميد بن بيان الواسطي، أخبرنا خالد بن عبد الله، عن سهيل، عن أبي عبيد المذحجي، - قال مسلم أبو عبيد مولى سليمان بن عبد الملك - عن عطاء بن يزيد الليثي، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم ‏ \"‏ من سبح الله في دبر كل صلاة ثلاثا وثلاثين وحمد الله ثلاثا وثلاثين وكبر الله ثلاثا وثلاثين فتلك تسعة وتسعون وقال تمام المائة لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شىء قدير غفرت خطاياه وإن كانت مثل زبد البحر ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 188
			}
		},
		{
			"hadithnumber": 1353,
			"arabicnumber": "597.02",
			"text": "وحدثنا محمد بن الصباح، حدثنا إسماعيل بن زكرياء، عن سهيل، عن أبي عبيد، عن عطاء، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم بمثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 189
			}
		},
		{
			"hadithnumber": 1356,
			"arabicnumber": "599",
			"text": "قال مسلم وحدثت عن يحيى بن حسان، ويونس المؤدب، و غيرهما قالوا حدثنا عبد الواحد بن زياد، قال حدثني عمارة بن القعقاع، حدثنا أبو زرعة، قال سمعت أبا هريرة، يقول كان رسول الله صلى الله عليه وسلم إذا نهض من الركعة الثانية استفتح القراءة بـ ‏{‏ الحمد لله رب العالمين‏}‏ ولم يسكت ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 191
			}
		},
		{
			"hadithnumber": 1357,
			"arabicnumber": "600",
			"text": "وحدثني زهير بن حرب، حدثنا عفان، حدثنا حماد، أخبرنا قتادة، وثابت، وحميد، عن أنس، أن رجلا، جاء فدخل الصف وقد حفزه النفس فقال الحمد لله حمدا كثيرا طيبا مباركا فيه ‏.‏ فلما قضى رسول الله صلى الله عليه وسلم صلاته قال ‏\"‏ أيكم المتكلم بالكلمات ‏\"‏ ‏.‏ فأرم القوم فقال ‏\"‏ أيكم المتكلم بها فإنه لم يقل بأسا ‏\"‏ ‏.‏ فقال رجل جئت وقد حفزني النفس فقلتها ‏.‏ فقال ‏\"‏ لقد رأيت اثنى عشر ملكا يبتدرونها أيهم يرفعها ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 192
			}
		},
		{
			"hadithnumber": 1358,
			"arabicnumber": "601",
			"text": "حدثنا زهير بن حرب، حدثنا إسماعيل ابن علية، أخبرني الحجاج بن أبي عثمان، عن أبي الزبير، عن عون بن عبد الله بن عتبة، عن ابن عمر، قال بينما نحن نصلي مع رسول الله صلى الله عليه وسلم إذ قال رجل من القوم الله أكبر كبيرا والحمد لله كثيرا وسبحان الله بكرة وأصيلا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ من القائل كلمة كذا وكذا ‏\"‏ ‏.‏ قال رجل من القوم أنا يا رسول الله ‏.‏ قال ‏\"‏ عجبت لها فتحت لها أبواب السماء ‏\"‏ ‏.‏ قال ابن عمر فما تركتهن منذ سمعت رسول الله صلى الله عليه وسلم يقول ذلك ‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 193
			}
		},
		{
			"hadithnumber": 1359,
			"arabicnumber": "602.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، وزهير بن حرب، قالوا حدثنا سفيان بن عيينة، عن الزهري، عن سعيد، عن أبي هريرة، عن النبي صلى الله عليه وسلم ح قال وحدثني محمد بن جعفر بن زياد، أخبرنا إبراهيم، - يعني ابن سعد - عن الزهري، عن سعيد، وأبي، سلمة عن أبي هريرة، عن النبي صلى الله عليه وسلم ح قال وحدثني حرملة بن يحيى، - واللفظ له - أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، قال أخبرني أبو سلمة بن عبد الرحمن، أن أبا هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ إذا أقيمت الصلاة فلا تأتوها تسعون وأتوها تمشون وعليكم السكينة فما أدركتم فصلوا وما فاتكم فأتموا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 194
			}
		},
		{
			"hadithnumber": 1360,
			"arabicnumber": "602.02",
			"text": "حدثنا يحيى بن أيوب، وقتيبة بن سعيد، وابن، حجر عن إسماعيل بن جعفر، - قال ابن أيوب حدثنا إسماعيل، - أخبرني العلاء، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إذا ثوب للصلاة فلا تأتوها وأنتم تسعون وأتوها وعليكم السكينة فما أدركتم فصلوا وما فاتكم فأتموا فإن أحدكم إذا كان يعمد إلى الصلاة فهو في صلاة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 195
			}
		},
		{
			"hadithnumber": 1361,
			"arabicnumber": "602.03",
			"text": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا نودي بالصلاة فأتوها وأنتم تمشون وعليكم السكينة فما أدركتم فصلوا وما فاتكم فأتموا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 196
			}
		},
		{
			"hadithnumber": 1362,
			"arabicnumber": "602.04",
			"text": "حدثنا قتيبة بن سعيد، حدثنا الفضيل، - يعني ابن عياض - عن هشام، ح قال وحدثني زهير بن حرب، - واللفظ له - حدثنا إسماعيل بن إبراهيم، حدثنا هشام بن حسان، عن محمد بن سيرين، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا ثوب بالصلاة فلا يسع إليها أحدكم ولكن ليمش وعليه السكينة والوقار صل ما أدركت واقض ما سبقك ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 197
			}
		},
		{
			"hadithnumber": 1363,
			"arabicnumber": "603.01",
			"text": "حدثني إسحاق بن منصور، أخبرنا محمد بن المبارك الصوري، حدثنا معاوية بن سلام، عن يحيى بن أبي كثير، أخبرني عبد الله بن أبي قتادة، أن أباه، أخبره قال بينما نحن نصلي مع رسول الله صلى الله عليه وسلم فسمع جلبة ‏.‏ فقال ‏\"‏ ما شأنكم ‏\"‏ ‏.‏ قالوا استعجلنا إلى الصلاة ‏.‏ قال ‏\"‏ فلا تفعلوا إذا أتيتم الصلاة فعليكم السكينة فما أدركتم فصلوا وما سبقكم فأتموا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 198
			}
		},
		{
			"hadithnumber": 1364,
			"arabicnumber": "603.02",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا معاوية بن هشام، حدثنا شيبان، بهذا الإسناد ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 199
			}
		},
		{
			"hadithnumber": 1367,
			"arabicnumber": "605.01",
			"text": "حدثنا هارون بن معروف، وحرملة بن يحيى، قالا حدثنا ابن وهب، أخبرني يونس، عن ابن شهاب، قال أخبرني أبو سلمة بن عبد الرحمن بن عوف، سمع أبا هريرة، يقول أقيمت الصلاة فقمنا فعدلنا الصفوف قبل أن يخرج إلينا رسول الله صلى الله عليه وسلم فأتى رسول الله صلى الله عليه وسلم حتى إذا قام في مصلاه قبل أن يكبر ذكر فانصرف وقال لنا ‏ \"‏ مكانكم ‏\"‏ ‏.‏ فلم نزل قياما ننتظره حتى خرج إلينا وقد اغتسل ينطف رأسه ماء فكبر فصلى بنا ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 201
			}
		},
		{
			"hadithnumber": 1368,
			"arabicnumber": "605.02",
			"text": "وحدثني زهير بن حرب، حدثنا الوليد بن مسلم، حدثنا أبو عمرو، - يعني الأوزاعي - حدثنا الزهري، عن أبي سلمة، عن أبي هريرة، قال أقيمت الصلاة وصف الناس صفوفهم وخرج رسول الله صلى الله عليه وسلم فقام مقامه فأومأ إليهم بيده أن ‏ \"‏ مكانكم ‏\"‏ ‏.‏ فخرج وقد اغتسل ورأسه ينطف الماء فصلى بهم ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 202
			}
		},
		{
			"hadithnumber": 1369,
			"arabicnumber": "605.03",
			"text": "وحدثني إبراهيم بن موسى، أخبرنا الوليد بن مسلم، عن الأوزاعي، عن الزهري، قال حدثني أبو سلمة، عن أبي هريرة، أن الصلاة، كانت تقام لرسول الله صلى الله عليه وسلم فيأخذ الناس مصافهم قبل أن يقوم النبي صلى الله عليه وسلم مقامه ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 203
			}
		},
		{
			"hadithnumber": 1370,
			"arabicnumber": "606",
			"text": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا زهير، حدثنا سماك بن حرب، عن جابر بن سمرة، قال كان بلال يؤذن إذا دحضت فلا يقيم حتى يخرج النبي صلى الله عليه وسلم فإذا خرج أقام الصلاة حين يراه ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 204
			}
		},
		{
			"hadithnumber": 1371,
			"arabicnumber": "607.01",
			"text": "وحدثنا يحيى بن يحيى، قال قرأت على مالك عن ابن شهاب، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏ \"‏ من أدرك ركعة من الصلاة فقد أدرك الصلاة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 205
			}
		},
		{
			"hadithnumber": 1372,
			"arabicnumber": "607.02",
			"text": "وحدثني حرملة بن يحيى، أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من أدرك ركعة من الصلاة مع الإمام فقد أدرك الصلاة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 206
			}
		},
		{
			"hadithnumber": 1373,
			"arabicnumber": "607.03",
			"text": "حدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، وزهير بن حرب، قالوا حدثنا ابن عيينة، ح قال وحدثنا أبو كريب، أخبرنا ابن المبارك، عن معمر، والأوزاعي، ومالك بن أنس، ويونس، ح قال وحدثنا ابن نمير، حدثنا أبي ح، قال وحدثنا ابن المثنى، حدثنا عبد الوهاب، جميعا عن عبيد الله، كل هؤلاء عن الزهري، عن أبي سلمة، عن أبي هريرة، عن النبي صلى الله عليه وسلم بمثل حديث يحيى عن مالك وليس في حديث أحد منهم ‏\"‏ مع الإمام ‏\"‏ ‏.‏ وفي حديث عبيد الله قال ‏\"‏ فقد أدرك الصلاة كلها ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 207
			}
		},
		{
			"hadithnumber": 1374,
			"arabicnumber": "608.01",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن زيد بن أسلم، عن عطاء بن يسار، وعن بسر بن سعيد، وعن الأعرج، حدثوه عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من أدرك ركعة من الصبح قبل أن تطلع الشمس فقد أدرك الصبح ومن أدرك ركعة من العصر قبل أن تغرب الشمس فقد أدرك العصر ‏\"‏ ‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 208
			}
		},
		{
			"hadithnumber": 1375,
			"arabicnumber": "608.02",
			"text": "وحدثنا عبد بن حميد، أخبرنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن أبي سلمة، عن أبي هريرة، ‏.‏ بمثل حديث مالك عن زيد بن أسلم، ‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 209
			}
		},
		{
			"hadithnumber": 1376,
			"arabicnumber": "609",
			"text": "وحدثنا حسن بن الربيع، حدثنا عبد الله بن المبارك، عن يونس بن يزيد، عن الزهري، قال حدثنا عروة، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ح قال وحدثني أبو الطاهر، وحرملة، كلاهما عن ابن وهب، - والسياق لحرملة - قال أخبرني يونس، عن ابن شهاب، أن عروة بن الزبير، حدثه عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏ \"‏ من أدرك من العصر سجدة قبل أن تغرب الشمس أو من الصبح قبل أن تطلع فقد أدركها ‏\"‏ ‏.‏ والسجدة إنما هي الركعة ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 210
			}
		},
		{
			"hadithnumber": 1377,
			"arabicnumber": "608.03",
			"text": "وحدثنا حسن بن الربيع، حدثنا عبد الله بن المبارك، عن معمر، عن ابن طاوس، عن أبيه، عن ابن عباس، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من أدرك من العصر ركعة قبل أن تغرب الشمس فقد أدرك ومن أدرك من الفجر ركعة قبل أن تطلع الشمس فقد أدرك ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 211
			}
		},
		{
			"hadithnumber": 1378,
			"arabicnumber": "608.04",
			"text": "وحدثناه عبد الأعلى بن حماد، حدثنا معتمر، قال سمعت معمرا، بهذا الإسناد ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 212
			}
		},
		{
			"hadithnumber": 1379,
			"arabicnumber": "610.01",
			"text": "حدثنا قتيبة بن سعيد، حدثنا ليث، ح قال وحدثنا ابن رمح، أخبرنا الليث، عن ابن شهاب، أن عمر بن عبد العزيز، أخر العصر شيئا فقال له عروة أما إن جبريل قد نزل فصلى إمام رسول الله صلى الله عليه وسلم ‏.‏ فقال له عمر اعلم ما تقول يا عروة ‏.‏ فقال سمعت بشير بن أبي مسعود يقول سمعت أبا مسعود يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ نزل جبريل فأمني فصليت معه ثم صليت معه ثم صليت معه ثم صليت معه ثم صليت معه ‏\"‏ ‏.‏ يحسب بأصابعه خمس صلوات ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 213
			}
		},
		{
			"hadithnumber": 1380,
			"arabicnumber": "610.02",
			"text": "أخبرنا يحيى بن يحيى التميمي، قال قرأت على مالك عن ابن شهاب، أن عمر بن عبد العزيز، أخر الصلاة يوما فدخل عليه عروة بن الزبير فأخبره أن المغيرة بن شعبة أخر الصلاة يوما وهو بالكوفة فدخل عليه أبو مسعود الأنصاري فقال ما هذا يا مغيرة أليس قد علمت أن جبريل نزل فصلى فصلى رسول الله صلى الله عليه وسلم ثم صلى فصلى رسول الله صلى الله عليه وسلم ثم صلى فصلى رسول الله صلى الله عليه وسلم ثم صلى فصلى رسول الله صلى الله عليه وسلم ثم صلى فصلى رسول الله صلى الله عليه وسلم ثم قال ‏ \"‏ بهذا أمرت ‏\"‏ ‏.‏ فقال عمر لعروة انظر ما تحدث يا عروة أوإن جبريل عليه السلام هو أقام لرسول الله صلى الله عليه وسلم وقت الصلاة فقال عروة كذلك كان بشير بن أبي مسعود يحدث عن أبيه ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 214
			}
		},
		{
			"hadithnumber": 1381,
			"arabicnumber": "611.01",
			"text": "قال عروة ولقد حدثتني عائشة، زوج النبي صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم كان يصلي العصر والشمس في حجرتها قبل أن تظهر ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 215
			}
		},
		{
			"hadithnumber": 1382,
			"arabicnumber": "611.02",
			"text": "حدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، قال عمرو حدثنا سفيان، عن الزهري، عن عروة، عن عائشة، كان النبي صلى الله عليه وسلم يصلي العصر والشمس طالعة في حجرتي لم يفئ الفىء بعد ‏.‏ وقال أبو بكر لم يظهر الفىء بعد ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 216
			}
		},
		{
			"hadithnumber": 1383,
			"arabicnumber": "611.03",
			"text": "وحدثني حرملة بن يحيى، أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، قال أخبرني عروة بن الزبير، أن عائشة، زوج النبي صلى الله عليه وسلم أخبرته أن رسول الله صلى الله عليه وسلم كان يصلي العصر والشمس في حجرتها لم يظهر الفىء في حجرتها ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 217
			}
		},
		{
			"hadithnumber": 1384,
			"arabicnumber": "611.04",
			"text": "حدثنا أبو بكر بن أبي شيبة، وابن، نمير قالا حدثنا وكيع، عن هشام، عن أبيه، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يصلي العصر والشمس واقعة في حجرتي ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 218
			}
		},
		{
			"hadithnumber": 1385,
			"arabicnumber": "612.01",
			"text": "حدثنا أبو غسان المسمعي، ومحمد بن المثنى، قالا حدثنا معاذ، - وهو ابن هشام - حدثني أبي، عن قتادة، عن أبي أيوب، عن عبد الله بن عمرو، أن نبي الله صلى الله عليه وسلم قال ‏ \"‏ إذا صليتم الفجر فإنه وقت إلى أن يطلع قرن الشمس الأول ثم إذا صليتم الظهر فإنه وقت إلى أن يحضر العصر فإذا صليتم العصر فإنه وقت إلى أن تصفر الشمس فإذا صليتم المغرب فإنه وقت إلى أن يسقط الشفق فإذا صليتم العشاء فإنه وقت إلى نصف الليل ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 219
			}
		},
		{
			"hadithnumber": 1386,
			"arabicnumber": "612.02",
			"text": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن قتادة، عن أبي أيوب، - واسمه يحيى بن مالك الأزدي ويقال المراغي والمراغ حى من الأزد - عن عبد الله بن عمرو عن النبي صلى الله عليه وسلم قال ‏ \"‏ وقت الظهر ما لم يحضر العصر ووقت العصر ما لم تصفر الشمس ووقت المغرب ما لم يسقط ثور الشفق ووقت العشاء إلى نصف الليل ووقت الفجر ما لم تطلع الشمس ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 220
			}
		},
		{
			"hadithnumber": 1387,
			"arabicnumber": "612.03",
			"text": "حدثنا زهير بن حرب، حدثنا أبو عامر العقدي، ح قال وحدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن أبي بكير، كلاهما عن شعبة، بهذا الإسناد ‏.‏ وفي حديثهما قال شعبة رفعه مرة ولم يرفعه مرتين ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 221
			}
		},
		{
			"hadithnumber": 1388,
			"arabicnumber": "612.04",
			"text": "وحدثني أحمد بن إبراهيم الدورقي، حدثنا عبد الصمد، حدثنا همام، حدثنا قتادة، عن أبي أيوب، عن عبد الله بن عمرو، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ وقت الظهر إذا زالت الشمس وكان ظل الرجل كطوله ما لم يحضر العصر ووقت العصر ما لم تصفر الشمس ووقت صلاة المغرب ما لم يغب الشفق ووقت صلاة العشاء إلى نصف الليل الأوسط ووقت صلاة الصبح من طلوع الفجر ما لم تطلع الشمس فإذا طلعت الشمس فأمسك عن الصلاة فإنها تطلع بين قرنى شيطان ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 222
			}
		},
		{
			"hadithnumber": 1389,
			"arabicnumber": "612.05",
			"text": "وحدثني أحمد بن يوسف الأزدي، حدثنا عمر بن عبد الله بن رزين، حدثنا إبراهيم، - يعني ابن طهمان - عن الحجاج، - وهو ابن حجاج - عن قتادة، عن أبي أيوب، عن عبد الله بن عمرو بن العاص، أنه قال سئل رسول الله صلى الله عليه وسلم عن وقت الصلوات فقال ‏ \"‏ وقت صلاة الفجر ما لم يطلع قرن الشمس الأول ووقت صلاة الظهر إذا زالت الشمس عن بطن السماء ما لم يحضر العصر ووقت صلاة العصر ما لم تصفر الشمس ويسقط قرنها الأول ووقت صلاة المغرب إذا غابت الشمس ما لم يسقط الشفق ووقت صلاة العشاء إلى نصف الليل ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 223
			}
		},
		{
			"hadithnumber": 1390,
			"arabicnumber": "612.06",
			"text": "حدثنا يحيى بن يحيى التميمي، قال أخبرنا عبد الله بن يحيى بن أبي كثير، قال سمعت أبي يقول، لا يستطاع العلم براحة الجسم ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 224
			}
		},
		{
			"hadithnumber": 1391,
			"arabicnumber": "613.01",
			"text": "حدثني زهير بن حرب، وعبيد الله بن سعيد، كلاهما عن الأزرق، - قال زهير حدثنا إسحاق بن يوسف الأزرق، - حدثنا سفيان، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، عن النبي صلى الله عليه وسلم أن رجلا سأله عن وقت الصلاة فقال له ‏\"‏ صل معنا هذين ‏\"‏ ‏.‏ يعني اليومين فلما زالت الشمس أمر بلالا فأذن ثم أمره فأقام الظهر ثم أمره فأقام العصر والشمس مرتفعة بيضاء نقية ثم أمره فأقام المغرب حين غابت الشمس ثم أمره فأقام العشاء حين غاب الشفق ثم أمره فأقام الفجر حين طلع الفجر فلما أن كان اليوم الثاني أمره فأبرد بالظهر فأبرد بها فأنعم أن يبرد بها وصلى العصر والشمس مرتفعة أخرها فوق الذي كان وصلى المغرب قبل أن يغيب الشفق وصلى العشاء بعد ما ذهب ثلث الليل وصلى الفجر فأسفر بها ثم قال ‏\"‏ أين السائل عن وقت الصلاة ‏\"‏ ‏.‏ فقال الرجل أنا يا رسول الله ‏.‏ قال ‏\"‏ وقت صلاتكم بين ما رأيتم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 225
			}
		},
		{
			"hadithnumber": 1392,
			"arabicnumber": "613.02",
			"text": "وحدثني إبراهيم بن محمد بن عرعرة السامي، حدثنا حرمي بن عمارة، حدثنا شعبة، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، أن رجلا، أتى النبي صلى الله عليه وسلم فسأله عن مواقيت الصلاة فقال ‏\"‏ اشهد معنا الصلاة ‏\"‏ ‏.‏ فأمر بلالا فأذن بغلس فصلى الصبح حين طلع الفجر ثم أمره بالظهر حين زالت الشمس عن بطن السماء ثم أمره بالعصر والشمس مرتفعة ثم أمره بالمغرب حين وجبت الشمس ثم أمره بالعشاء حين وقع الشفق ثم أمره الغد فنور بالصبح ثم أمره بالظهر فأبرد ثم أمره بالعصر والشمس بيضاء نقية لم تخالطها صفرة ثم أمره بالمغرب قبل أن يقع الشفق ثم أمره بالعشاء عند ذهاب ثلث الليل أو بعضه - شك حرمي - فلما أصبح قال ‏\"‏ أين السائل ما بين ما رأيت وقت ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 226
			}
		},
		{
			"hadithnumber": 1393,
			"arabicnumber": "614.01",
			"text": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا بدر بن عثمان، حدثنا أبو بكر بن أبي موسى، عن أبيه، عن رسول الله صلى الله عليه وسلم أنه أتاه سائل يسأله عن مواقيت الصلاة فلم يرد عليه شيئا - قال - فأقام الفجر حين انشق الفجر والناس لا يكاد يعرف بعضهم بعضا ثم أمره فأقام بالظهر حين زالت الشمس والقائل يقول قد انتصف النهار وهو كان أعلم منهم ثم أمره فأقام بالعصر والشمس مرتفعة ثم أمره فأقام بالمغرب حين وقعت الشمس ثم أمره فأقام العشاء حين غاب الشفق ثم أخر الفجر من الغد حتى انصرف منها والقائل يقول قد طلعت الشمس أو كادت ثم أخر الظهر حتى كان قريبا من وقت العصر بالأمس ثم أخر العصر حتى انصرف منها والقائل يقول قد احمرت الشمس ثم أخر المغرب حتى كان عند سقوط الشفق ثم أخر العشاء حتى كان ثلث الليل الأول ثم أصبح فدعا السائل فقال ‏ \"‏ الوقت بين هذين ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 227
			}
		},
		{
			"hadithnumber": 1394,
			"arabicnumber": "614.02",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن بدر بن عثمان، عن أبي بكر بن أبي موسى، سمعه منه، عن أبيه، أن سائلا، أتى النبي صلى الله عليه وسلم فسأله عن مواقيت الصلاة ‏.‏ بمثل حديث ابن نمير غير أنه قال فصلى المغرب قبل أن يغيب الشفق في اليوم الثاني ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 228
			}
		},
		{
			"hadithnumber": 1395,
			"arabicnumber": "615.01",
			"text": "حدثنا قتيبة بن سعيد، حدثنا ليث، ح وحدثنا محمد بن رمح، أخ برنا الليث، عن ابن شهاب، عن ابن المسيب، وأبي، سلمة بن عبد الرحمن عن أبي هريرة، أنه قال إن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إذا اشتد الحر فأبردوا بالصلاة فإن شدة الحر من فيح جهنم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 229
			}
		},
		{
			"hadithnumber": 1396,
			"arabicnumber": "615.02",
			"text": "وحدثني حرملة بن يحيى، أخبرنا ابن وهب، أخبرني يونس، أن ابن شهاب، أخبره قال أخبرني أبو سلمة، وسعيد بن المسيب، أنهما سمعا أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم بمثله سواء ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 230
			}
		},
		{
			"hadithnumber": 1397,
			"arabicnumber": "615.03",
			"text": "وحدثني هارون بن سعيد الأيلي، وعمرو بن سواد، وأحمد بن عيسى، قال عمرو أخبرنا وقال الآخران، حدثنا ابن وهب، قال أخبرني عمرو، أن بكيرا، حدثه عن بسر بن سعيد، وسلمان الأغر، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا كان اليوم الحار فأبردوا بالصلاة فإن شدة الحر من فيح جهنم ‏\"‏ ‏. قال عمرو وحدثني أبو يونس عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أبردوا عن الصلاة فإن شدة الحر من فيح جهنم ‏\"‏ ‏. قال عمرو وحدثني ابن شهاب عن ابن المسيب وأبي سلمة عن أبي هريرة عن رسول الله صلى الله عليه وسلم بنحو ذلك",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 231
			}
		},
		{
			"hadithnumber": 1398,
			"arabicnumber": "615.04",
			"text": "وحدثنا قتيبة بن سعيد، حدثنا عبد العزيز، عن العلاء، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إن هذا الحر من فيح جهنم فأبردوا بالصلاة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 232
			}
		},
		{
			"hadithnumber": 1399,
			"arabicnumber": "615.05",
			"text": "حدثنا ابن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏ \"‏ أبردوا عن الحر في الصلاة فإن شدة الحر من فيح جهنم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 233
			}
		},
		{
			"hadithnumber": 1400,
			"arabicnumber": "616",
			"text": "حدثني محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، قال سمعت مهاجرا أبا الحسن، يحدث أنه سمع زيد بن وهب، يحدث عن أبي ذر، قال أذن مؤذن رسول الله صلى الله عليه وسلم بالظهر فقال النبي صلى الله عليه وسلم ‏\"‏ أبرد أبرد ‏\"‏ ‏.‏ أو قال ‏\"‏ انتظر انتظر ‏\"‏ ‏.‏ وقال ‏\"‏ إن شدة الحر من فيح جهنم فإذا اشتد الحر فأبردوا عن الصلاة ‏\"‏ ‏.‏ قال أبو ذر حتى رأينا فىء التلول ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 234
			}
		},
		{
			"hadithnumber": 1401,
			"arabicnumber": "617.01",
			"text": "وحدثني عمرو بن سواد، وحرملة بن يحيى، - واللفظ لحرملة - أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، قال حدثني أبو سلمة بن عبد الرحمن، أنه سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ اشتكت النار إلى ربها فقالت يا رب أكل بعضي بعضا ‏.‏ فأذن لها بنفسين نفس في الشتاء ونفس في الصيف فهو أشد ما تجدون من الحر وأشد ما تجدون من الزمهرير ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 235
			}
		},
		{
			"hadithnumber": 1402,
			"arabicnumber": "617.02",
			"text": "وحدثني إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك، عن عبد الله بن يزيد، مولى الأسود بن سفيان عن أبي سلمة بن عبد الرحمن، ومحمد بن عبد الرحمن بن ثوبان، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا كان الحر فأبردوا عن الصلاة فإن شدة الحر من فيح جهنم ‏\"‏ ‏.‏ وذكر ‏\"‏ أن النار اشتكت إلى ربها فأذن لها في كل عام بنفسين نفس في الشتاء ونفس في الصيف ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 236
			}
		},
		{
			"hadithnumber": 1403,
			"arabicnumber": "617.03",
			"text": "وحدثني حرملة بن يحيى، حدثنا عبد الله بن وهب، أخبرنا حيوة، قال حدثني يزيد بن عبد الله بن أسامة بن الهاد، عن محمد بن إبراهيم، عن أبي سلمة، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏ \"‏ قالت النار رب أكل بعضي بعضا فأذن لي أتنفس ‏.‏ فأذن لها بنفسين نفس في الشتاء ونفس في الصيف فما وجدتم من برد أو زمهرير فمن نفس جهنم وما وجدتم من حر أو حرور فمن نفس جهنم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 237
			}
		},
		{
			"hadithnumber": 1404,
			"arabicnumber": "618",
			"text": "حدثنا محمد بن المثنى، ومحمد بن بشار، كلاهما عن يحيى القطان، وابن، مهدي - قال ابن المثنى حدثني يحيى بن سعيد، - عن شعبة، قال حدثنا سماك بن حرب، عن جابر بن سمرة، قال ابن المثنى وحدثنا عبد الرحمن بن مهدي، عن شعبة، عن سماك، عن جابر بن سمرة، قال كان النبي صلى الله عليه وسلم يصلي الظهر إذا دحضت الشمس ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 238
			}
		},
		{
			"hadithnumber": 1405,
			"arabicnumber": "619.01",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو الأحوص، سلام بن سليم عن أبي إسحاق، عن سعيد بن وهب، عن خباب، قال شكونا إلى رسول الله صلى الله عليه وسلم الصلاة في الرمضاء فلم يشكنا ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 239
			}
		},
		{
			"hadithnumber": 1406,
			"arabicnumber": "619.02",
			"text": "وحدثنا أحمد بن يونس، وعون بن سلام، - قال عون أخبرنا وقال ابن يونس، واللفظ، له حدثنا زهير، - قال حدثنا أبو إسحاق، عن سعيد بن وهب، عن خباب، قال أتينا رسول الله صلى الله عليه وسلم فشكونا إليه حر الرمضاء فلم يشكنا ‏.‏ قال زهير قلت لأبي إسحاق أفي الظهر قال نعم ‏.‏ قلت أفي تعجيلها قال نعم ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 240
			}
		},
		{
			"hadithnumber": 1407,
			"arabicnumber": "620",
			"text": "حدثنا يحيى بن يحيى، حدثنا بشر بن المفضل، عن غالب القطان، عن بكر بن عبد الله، عن أنس بن مالك، قال كنا نصلي مع رسول الله صلى الله عليه وسلم في شدة الحر فإذا لم يستطع أحدنا أن يمكن جبهته من الأرض بسط ثوبه فسجد عليه ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 241
			}
		},
		{
			"hadithnumber": 1408,
			"arabicnumber": "621.01",
			"text": "حدثنا قتيبة بن سعيد، حدثنا ليث، ح قال وحدثنا محمد بن رمح، أخبرنا الليث، عن ابن شهاب، عن أنس بن مالك، أنه أخبره أن رسول الله صلى الله عليه وسلم كان يصلي العصر والشمس مرتفعة حية فيذهب الذاهب إلى العوالي فيأتي العوالي والشمس مرتفعة ‏.‏ ولم يذكر قتيبة فيأتي العوالي ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 242
			}
		},
		{
			"hadithnumber": 1409,
			"arabicnumber": "621.02",
			"text": "وحدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني عمرو، عن ابن شهاب، عن أنس، ‏.‏ أن رسول الله صلى الله عليه وسلم كان يصلي العصر بمثله سواء ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 243
			}
		},
		{
			"hadithnumber": 1410,
			"arabicnumber": "621.03",
			"text": "وحدثنا يحيى بن يحيى، قال قرأت على مالك عن ابن شهاب، عن أنس بن مالك، قال كنا نصلي العصر ثم يذهب الذاهب إلى قباء فيأتيهم والشمس مرتفعة ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 244
			}
		},
		{
			"hadithnumber": 1411,
			"arabicnumber": "621.04",
			"text": "وحدثنا يحيى بن يحيى، قال قرأت على مالك عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، قال كنا نصلي العصر ثم يخرج الإنسان إلى بني عمرو بن عوف فيجدهم يصلون العصر ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 245
			}
		},
		{
			"hadithnumber": 1412,
			"arabicnumber": "622",
			"text": "وحدثنا يحيى بن أيوب، ومحمد بن الصباح، وقتيبة، وابن، حجر قالوا حدثنا إسماعيل بن جعفر، عن العلاء بن عبد الرحمن، أنه دخل على أنس بن مالك في داره بالبصرة حين انصرف من الظهر وداره بجنب المسجد فلما دخلنا عليه قال أصليتم العصر فقلنا له إنما انصرفنا الساعة من الظهر ‏.‏ قال فصلوا العصر ‏.‏ فقمنا فصلينا فلما انصرفنا قال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ تلك صلاة المنافق يجلس يرقب الشمس حتى إذا كانت بين قرنى الشيطان قام فنقرها أربعا لا يذكر الله فيها إلا قليلا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 246
			}
		},
		{
			"hadithnumber": 1413,
			"arabicnumber": "623",
			"text": "وحدثنا منصور بن أبي مزاحم، حدثنا عبد الله بن المبارك، عن أبي بكر بن عثمان بن سهل بن حنيف، قال سمعت أبا أمامة بن سهل، يقول صلينا مع عمر بن عبد العزيز الظهر ثم خرجنا حتى دخلنا على أنس بن مالك فوجدناه يصلي العصر فقلت يا عم ما هذه الصلاة التي صليت قال العصر وهذه صلاة رسول الله صلى الله تعالى عليه وسلم التي كنا نصلي معه ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 247
			}
		},
		{
			"hadithnumber": 1414,
			"arabicnumber": "624",
			"text": "حدثنا عمرو بن سواد العامري، ومحمد بن سلمة المرادي، وأحمد بن عيسى، - وألفاظهم متقاربة - قال عمرو أخبرنا وقال الآخران، حدثنا ابن وهب، أخبرني عمرو بن الحارث، عن يزيد بن أبي حبيب، أن موسى بن سعد الأنصاري، حدثه عن حفص بن عبيد الله، عن أنس بن مالك، أنه قال صلى لنا رسول الله صلى الله عليه وسلم العصر فلما انصرف أتاه رجل من بني سلمة فقال يا رسول الله إنا نريد أن ننحر جزورا لنا ونحن نحب أن تحضرها ‏.‏ قال ‏ \"‏ نعم ‏\"‏ ‏.‏ فانطلق وانطلقنا معه فوجدنا الجزور لم تنحر فنحرت ثم قطعت ثم طبخ منها ثم أكلنا قبل أن تغيب الشمس ‏.‏ وقال المرادي حدثنا ابن وهب عن ابن لهيعة وعمرو بن الحارث في هذا الحديث ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 248
			}
		},
		{
			"hadithnumber": 1415,
			"arabicnumber": "625.01",
			"text": "حدثنا محمد بن مهران الرازي، حدثنا الوليد بن مسلم، حدثنا الأوزاعي، عن أبي النجاشي، قال سمعت رافع بن خديج، يقول كنا نصلي العصر مع رسول الله صلى الله عليه وسلم ثم تنحر الجزور فتقسم عشر قسم ثم تطبخ فنأكل لحما نضيجا قبل مغيب الشمس ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 249
			}
		},
		{
			"hadithnumber": 1416,
			"arabicnumber": "625.02",
			"text": "حدثنا إسحاق بن إبراهيم، أخبرنا عيسى بن يونس، وشعيب بن إسحاق الدمشقي، قالا حدثنا الأوزاعي، بهذا الإسناد غير أنه قال كنا ننحر الجزور على عهد رسول الله صلى الله عليه وسلم بعد العصر ‏.‏ ولم يقل كنا نصلي معه ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 250
			}
		},
		{
			"hadithnumber": 1417,
			"arabicnumber": "626.01",
			"text": "وحدثنا يحيى بن يحيى، قال قرأت على مالك عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ الذي تفوته صلاة العصر كأنما وتر أهله وماله ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 251
			}
		},
		{
			"hadithnumber": 1418,
			"arabicnumber": "626.02",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، قالا حدثنا سفيان، عن الزهري، عن سالم، عن أبيه، ‏.‏ قال عمرو يبلغ به ‏.‏ وقال أبو بكر رفعه ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 252
			}
		},
		{
			"hadithnumber": 1419,
			"arabicnumber": "626.03",
			"text": "وحدثني هارون بن سعيد الأيلي، - واللفظ له - قال حدثنا ابن وهب، أخبرني عمرو بن الحارث، عن ابن شهاب، عن سالم بن عبد الله، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من فاتته العصر فكأنما وتر أهله وماله ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 253
			}
		},
		{
			"hadithnumber": 1420,
			"arabicnumber": "627.01",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، عن هشام، عن محمد، عن عبيدة، عن علي، قال لما كان يوم الأحزاب قال رسول الله صلى الله عليه وسلم ‏ \"‏ ملأ الله قبورهم وبيوتهم نارا كما حبسونا وشغلونا عن الصلاة الوسطى حتى غابت الشمس ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 254
			}
		},
		{
			"hadithnumber": 1421,
			"arabicnumber": "627.02",
			"text": "وحدثنا محمد بن أبي بكر المقدمي، حدثنا يحيى بن سعيد، ح وحدثناه إسحاق بن إبراهيم، أخبرنا المعتمر بن سليمان، جميعا عن هشام، بهذا الإسناد ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 255
			}
		},
		{
			"hadithnumber": 1422,
			"arabicnumber": "627.03",
			"text": "وحدثنا محمد بن المثنى، ومحمد بن بشار، قال ابن المثنى حدثنا محمد بن جعفر، حدثنا شعبة، قال سمعت قتادة، يحدث عن أبي حسان، عن عبيدة، عن علي، قال قال رسول الله صلى الله عليه وسلم يوم الأحزاب ‏ \"‏ شغلونا عن صلاة الوسطى حتى آبت الشمس ملأ الله قبورهم نارا أو بيوتهم أو بطونهم ‏\"‏ ‏.‏ شك شعبة في البيوت والبطون ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 256
			}
		},
		{
			"hadithnumber": 1423,
			"arabicnumber": "627.04",
			"text": "وحدثنا محمد بن المثنى، حدثنا ابن أبي عدي، عن سعيد، عن قتادة، بهذا الإسناد وقال ‏ \"‏ بيوتهم وقبورهم ‏\"‏ ‏.‏ ولم يشك ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 257
			}
		},
		{
			"hadithnumber": 1424,
			"arabicnumber": "627.05",
			"text": "وحدثناه أبو بكر بن أبي شيبة، وزهير بن حرب، قالا حدثنا وكيع، عن شعبة، عن الحكم، عن يحيى بن الجزار، عن علي، ح وحدثناه عبيد الله بن معاذ، - واللفظ له - قال حدثنا أبي، حدثنا شعبة، عن الحكم، عن يحيى، سمع عليا، يقول قال رسول الله صلى الله عليه وسلم يوم الأحزاب وهو قاعد على فرضة من فرض الخندق ‏ \"‏ شغلونا عن الصلاة الوسطى حتى غربت الشمس ملأ الله قبورهم وبيوتهم - أو قال قبورهم وبطونهم - نارا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 258
			}
		},
		{
			"hadithnumber": 1425,
			"arabicnumber": "627.06",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، وأبو كريب قالوا حدثنا أبو معاوية، عن الأعمش، عن مسلم بن صبيح، عن شتير بن شكل، عن علي، قال قال رسول الله صلى الله عليه وسلم يوم الأحزاب ‏ \"‏ شغلونا عن الصلاة الوسطى صلاة العصر ملأ الله بيوتهم وقبورهم نارا ‏\"‏ ‏.‏ ثم صلاها بين العشاءين بين المغرب والعشاء ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 259
			}
		},
		{
			"hadithnumber": 1426,
			"arabicnumber": "628",
			"text": "وحدثنا عون بن سلام الكوفي، أخبرنا محمد بن طلحة اليامي، عن زبيد، عن مرة، عن عبد الله، قال حبس المشركون رسول الله صلى الله عليه وسلم عن صلاة العصر حتى احمرت الشمس أو اصفرت فقال رسول الله صلى الله عليه وسلم ‏\"‏ شغلونا عن الصلاة الوسطى صلاة العصر ملأ الله أجوافهم وقبورهم نارا ‏\"‏ ‏.‏ أو قال ‏\"‏ حشا الله أجوافهم وقبورهم نارا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 260
			}
		},
		{
			"hadithnumber": 1427,
			"arabicnumber": "629",
			"text": "وحدثنا يحيى بن يحيى التميمي، قال قرأت على مالك عن زيد بن أسلم، عن القعقاع بن حكيم، عن أبي يونس، مولى عائشة أنه قال أمرتني عائشة أن أكتب لها مصحفا وقالت إذا بلغت هذه الآية فآذني ‏{‏ حافظوا على الصلوات والصلاة الوسطى‏}‏ فلما بلغتها آذنتها فأملت على حافظوا على الصلوات والصلاة الوسطى وصلاة العصر ‏.‏ وقوموا لله قانتين ‏.‏ قالت عائشة سمعتها من رسول الله صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 261
			}
		},
		{
			"hadithnumber": 1430,
			"arabicnumber": "631.01",
			"text": "وحدثني أبو غسان المسمعي، ومحمد بن المثنى، عن معاذ بن هشام، - قال أبو غسان حدثنا معاذ بن هشام، - حدثني أبي، عن يحيى بن أبي كثير، قال حدثنا أبو سلمة بن عبد الرحمن، عن جابر بن عبد الله، أن عمر بن الخطاب، يوم الخندق جعل يسب كفار قريش وقال يا رسول الله والله ما كدت أن أصلي العصر حتى كادت أن تغرب الشمس ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏ \"‏ فوالله إن صليتها ‏\"‏ ‏.‏ فنزلنا إلى بطحان فتوضأ رسول الله صلى الله عليه وسلم وتوضأنا فصلى رسول الله صلى الله عليه وسلم العصر بعد ما غربت الشمس ثم صلى بعدها المغرب ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 263
			}
		},
		{
			"hadithnumber": 1431,
			"arabicnumber": "631.02",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، قال أبو بكر حدثنا وقال، إسحاق أخبرنا وكيع، عن علي بن المبارك، عن يحيى بن أبي كثير، في هذا الإسناد بمثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 264
			}
		},
		{
			"hadithnumber": 1432,
			"arabicnumber": "632.01",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ يتعاقبون فيكم ملائكة بالليل وملائكة بالنهار ويجتمعون في صلاة الفجر وصلاة العصر ثم يعرج الذين باتوا فيكم فيسألهم ربهم وهو أعلم بهم كيف تركتم عبادي فيقولون تركناهم وهم يصلون وأتيناهم وهم يصلون ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 265
			}
		},
		{
			"hadithnumber": 1433,
			"arabicnumber": "632.02",
			"text": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ والملائكة يتعاقبون فيكم ‏\"‏ ‏.‏ بمثل حديث أبي الزناد ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 266
			}
		},
		{
			"hadithnumber": 1434,
			"arabicnumber": "633.01",
			"text": "وحدثنا زهير بن حرب، حدثنا مروان بن معاوية الفزاري، أخبرنا إسماعيل بن أبي خالد، حدثنا قيس بن أبي حازم، قال سمعت جرير بن عبد الله، وهو يقول كنا جلوسا عند رسول الله صلى الله عليه وسلم إذ نظر إلى القمر ليلة البدر فقال ‏\"‏ أما إنكم سترون ربكم كما ترون هذا القمر لا تضامون في رؤيته فإن استطعتم أن لا تغلبوا على صلاة قبل طلوع الشمس وقبل غروبها ‏\"‏ ‏.‏ يعني العصر والفجر ثم قرأ جرير ‏{‏ وسبح بحمد ربك قبل طلوع الشمس وقبل غروبها‏}‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 267
			}
		},
		{
			"hadithnumber": 1435,
			"arabicnumber": "633.02",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، وأبو أسامة ووكيع بهذا الإسناد وقال ‏ \"‏ أما إنكم ستعرضون على ربكم فترونه كما ترون هذا القمر ‏\"‏ ‏.‏ وقال ثم قرأ ‏.‏ ولم يقل جرير ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 268
			}
		},
		{
			"hadithnumber": 1436,
			"arabicnumber": "634.01",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب وإسحاق بن إبراهيم جميعا عن وكيع، - قال أبو كريب حدثنا وكيع، - عن ابن أبي خالد، ومسعر، والبختري بن المختار، سمعوه من أبي بكر بن عمارة بن رؤيبة، عن أبيه، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ لن يلج النار أحد صلى قبل طلوع الشمس وقبل غروبها ‏\"‏ ‏.‏ يعني الفجر والعصر ‏.‏ فقال له رجل من أهل البصرة آنت سمعت هذا من رسول الله صلى الله عليه وسلم قال نعم ‏.‏ قال الرجل وأنا أشهد أني سمعته من رسول الله صلى الله عليه وسلم سمعته أذناى ووعاه قلبي ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 269
			}
		},
		{
			"hadithnumber": 1437,
			"arabicnumber": "634.02",
			"text": "وحدثني يعقوب بن إبراهيم الدورقي، حدثنا يحيى بن أبي بكير، حدثنا شيبان، عن عبد الملك بن عمير، عن ابن عمارة بن رؤيبة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا يلج النار من صلى قبل طلوع الشمس وقبل غروبها ‏\"‏ ‏.‏ وعنده رجل من أهل البصرة فقال آنت سمعت هذا من النبي صلى الله عليه وسلم قال نعم أشهد به عليه ‏.‏ قال وأنا أشهد لقد سمعت النبي صلى الله عليه وسلم يقوله بالمكان الذي سمعته منه ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 270
			}
		},
		{
			"hadithnumber": 1438,
			"arabicnumber": "635.01",
			"text": "وحدثنا هداب بن خالد الأزدي، حدثنا همام بن يحيى، حدثني أبو جمرة الضبعي، عن أبي بكر، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من صلى البردين دخل الجنة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 271
			}
		},
		{
			"hadithnumber": 1439,
			"arabicnumber": "635.02",
			"text": "حدثنا ابن أبي عمر، حدثنا بشر بن السري، ح قال وحدثنا ابن خراش، حدثنا عمرو بن عاصم، قالا جميعا حدثنا همام، بهذا الإسناد ونسبا أبا بكر فقالا ابن أبي موسى ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 272
			}
		},
		{
			"hadithnumber": 1440,
			"arabicnumber": "636",
			"text": "حدثنا قتيبة بن سعيد، حدثنا حاتم، - وهو ابن إسماعيل - عن يزيد بن أبي عبيد، عن سلمة بن الأكوع، أن رسول الله صلى الله عليه وسلم كان يصلي المغرب إذا غربت الشمس وتوارت بالحجاب ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 273
			}
		},
		{
			"hadithnumber": 1441,
			"arabicnumber": "637.01",
			"text": "وحدثنا محمد بن مهران الرازي، حدثنا الوليد بن مسلم، حدثنا الأوزاعي، حدثني أبو النجاشي، قال سمعت رافع بن خديج، يقول كنا نصلي المغرب مع رسول الله صلى الله عليه وسلم فينصرف أحدنا وإنه ليبصر مواقع نبله ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 274
			}
		},
		{
			"hadithnumber": 1442,
			"arabicnumber": "637.02",
			"text": "وحدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا شعيب بن إسحاق الدمشقي، حدثنا الأوزاعي، حدثني أبو النجاشي، حدثني رافع بن خديج، قال كنا نصلي المغرب ‏.‏ بنحوه ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 275
			}
		},
		{
			"hadithnumber": 1443,
			"arabicnumber": "638.01",
			"text": "وحدثنا عمرو بن سواد العامري، وحرملة بن يحيى، قالا أخبرنا ابن وهب، أخبرني يونس، أن ابن شهاب، أخبره قال أخبرني عروة بن الزبير، أن عائشة، زوج النبي صلى الله عليه وسلم قالت أعتم رسول الله صلى الله عليه وسلم ليلة من الليالي بصلاة العشاء وهي التي تدعى العتمة فلم يخرج رسول الله صلى الله عليه وسلم حتى قال عمر بن الخطاب نام النساء والصبيان فخرج رسول الله صلى الله عليه وسلم فقال لأهل المسجد حين خرج عليهم ‏\"‏ ما ينتظرها أحد من أهل الأرض غيركم ‏\"‏ ‏.‏ وذلك قبل أن يفشو الإسلام في الناس ‏.‏ زاد حرملة في روايته قال ابن شهاب وذكر لي أن رسول الله صلى الله عليه وسلم قال ‏\"‏ وما كان لكم أن تنزروا رسول الله صلى الله عليه وسلم على الصلاة ‏\"‏ ‏.‏ وذاك حين صاح عمر بن الخطاب ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 276
			}
		},
		{
			"hadithnumber": 1444,
			"arabicnumber": "638.02",
			"text": "وحدثني عبد الملك بن شعيب بن الليث، حدثني أبي، عن جدي، عن عقيل، عن ابن شهاب، بهذا الإسناد ‏.‏ مثله ‏.‏ ولم يذكر قول الزهري وذكر لي ‏.‏ وما بعده ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 277
			}
		},
		{
			"hadithnumber": 1445,
			"arabicnumber": "638.03",
			"text": "حدثني إسحاق بن إبراهيم، ومحمد بن حاتم، كلاهما عن محمد بن بكر، ح قال وحدثني هارون بن عبد الله، حدثنا حجاج بن محمد، ح قال وحدثني حجاج بن الشاعر، ومحمد بن رافع، قالا حدثنا عبد الرزاق، - وألفاظهم متقاربة - قالوا جميعا عن ابن جريج، قال أخبرني المغيرة بن حكيم، عن أم كلثوم بنت أبي بكر، أنها أخبرته عن عائشة، قالت أعتم النبي صلى الله عليه وسلم ذات ليلة حتى ذهب عامة الليل وحتى نام أهل المسجد ثم خرج فصلى فقال ‏\"‏ إنه لوقتها لولا أن أشق على أمتي ‏\"‏ ‏.‏ وفي حديث عبد الرزاق ‏\"‏ لولا أن يشق على أمتي ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 278
			}
		},
		{
			"hadithnumber": 1446,
			"arabicnumber": "639.01",
			"text": "وحدثني زهير بن حرب، وإسحاق بن إبراهيم، - قال إسحاق أخبرنا وقال، زهير حدثنا جرير، - عن منصور، عن الحكم، عن نافع، عن عبد الله بن عمر، قال مكثنا ذات ليلة ننتظر رسول الله صلى الله عليه وسلم - لصلاة العشاء الآخرة فخرج إلينا حين ذهب ثلث الليل أو بعده فلا ندري أشىء شغله في أهله أو غير ذلك فقال حين خرج ‏ \"‏ إنكم لتنتظرون صلاة ما ينتظرها أهل دين غيركم ولولا أن يثقل على أمتي لصليت بهم هذه الساعة ‏\"‏ ‏.‏ ثم أمر المؤذن فأقام الصلاة وصلى ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 279
			}
		},
		{
			"hadithnumber": 1447,
			"arabicnumber": "639.02",
			"text": "وحدثني محمد بن رافع، حدثنا عبد الرزاق، أخبرنا ابن جريج، أخبرني نافع، حدثنا عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم شغل عنها ليلة فأخرها حتى رقدنا في المسجد ثم استيقظنا ثم رقدنا ثم استيقظنا ثم خرج علينا رسول الله صلى الله عليه وسلم ثم قال ‏ \"‏ ليس أحد من أهل الأرض الليلة ينتظر الصلاة غيركم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 280
			}
		},
		{
			"hadithnumber": 1448,
			"arabicnumber": "640.01",
			"text": "وحدثني أبو بكر بن نافع العبدي، حدثنا بهز بن أسد العمي، حدثنا حماد بن سلمة، عن ثابت، ‏.‏ أنهم سألوا أنسا عن خاتم، رسول الله صلى الله عليه وسلم فقال أخر رسول الله صلى الله عليه وسلم العشاء ذات ليلة إلى شطر الليل أو كاد يذهب شطر الليل ثم جاء فقال ‏ \"‏ إن الناس قد صلوا وناموا وإنكم لم تزالوا في صلاة ما انتظرتم الصلاة ‏\"‏ ‏.‏ قال أنس كأني أنظر إلى وبيص خاتمه من فضة ورفع إصبعه اليسرى بالخنصر ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 281
			}
		},
		{
			"hadithnumber": 1449,
			"arabicnumber": "640.02",
			"text": "وحدثني حجاج بن الشاعر، حدثنا أبو زيد، سعيد بن الربيع حدثنا قرة بن خالد، عن قتادة، عن أنس بن مالك، قال نظرنا رسول الله صلى الله عليه وسلم ليلة حتى كان قريب من نصف الليل ثم جاء فصلى ثم أقبل علينا بوجهه فكأنما أنظر إلى وبيص خاتمه في يده من فضة ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 282
			}
		},
		{
			"hadithnumber": 1450,
			"arabicnumber": "640.03",
			"text": "وحدثني عبد الله بن الصباح العطار، حدثنا عبيد الله بن عبد المجيد الحنفي، حدثنا قرة، بهذا الإسناد ولم يذكر ثم أقبل علينا بوجهه ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 283
			}
		},
		{
			"hadithnumber": 1451,
			"arabicnumber": "641",
			"text": "وحدثنا أبو عامر الأشعري، وأبو كريب قالا حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى، قال كنت أنا وأصحابي الذين، قدموا معي في السفينة نزولا في بقيع بطحان ورسول الله صلى الله عليه وسلم بالمدينة فكان يتناوب رسول الله صلى الله عليه وسلم عند صلاة العشاء كل ليلة نفر منهم قال أبو موسى فوافقنا رسول الله صلى الله عليه وسلم أنا وأصحابي وله بعض الشغل في أمره حتى أعتم بالصلاة حتى ابهار الليل ثم خرج رسول الله صلى الله عليه وسلم فصلى بهم فلما قضى صلاته قال لمن حضره ‏\"‏ على رسلكم أعلمكم وأبشروا أن من نعمة الله عليكم أنه ليس من الناس أحد يصلي هذه الساعة غيركم ‏\"‏ ‏.‏ أو قال ‏\"‏ ما صلى هذه الساعة أحد غيركم ‏\"‏ ‏.‏ لا ندري أى الكلمتين قال قال أبو موسى فرجعنا فرحين بما سمعنا من رسول الله صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 284
			}
		},
		{
			"hadithnumber": 1452,
			"arabicnumber": "642",
			"text": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق، أخبرنا ابن جريج، قال قلت لعطاء أى حين أحب إليك أن أصلي العشاء التي يقولها الناس العتمة إماما وخلوا قال سمعت ابن عباس يقول أعتم نبي الله صلى الله عليه وسلم ذات ليلة العشاء - قال - حتى رقد ناس واستيقظوا ورقدوا واستيقظوا فقام عمر بن الخطاب فقال الصلاة ‏.‏ فقال عطاء قال ابن عباس فخرج نبي الله صلى الله عليه وسلم كأني أنظر إليه الآن يقطر رأسه ماء واضعا يده على شق رأسه قال ‏ \"‏ لولا أن يشق على أمتي لأمرتهم أن يصلوها كذلك ‏\"‏ ‏.‏ قال فاستثبت عطاء كيف وضع النبي صلى الله عليه وسلم يده على رأسه كما أنبأه ابن عباس فبدد لي عطاء بين أصابعه شيئا من تبديد ثم وضع أطراف أصابعه على قرن الرأس ثم صبها يمرها كذلك على الرأس حتى مست إبهامه طرف الأذن مما يلي الوجه ثم على الصدغ وناحية اللحية لا يقصر ولا يبطش بشىء إلا كذلك ‏.‏ قلت لعطاء كم ذكر لك أخرها النبي صلى الله عليه وسلم ليلتئذ قال لا أدري ‏.‏ قال عطاء أحب إلى أن أصليها إماما وخلوا مؤخرة كما صلاها النبي صلى الله عليه وسلم ليلتئذ فإن شق عليك ذلك خلوا أو على الناس في الجماعة وأنت إمامهم فصلها وسطا لا معجلة ولا مؤخرة ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 285
			}
		},
		{
			"hadithnumber": 1453,
			"arabicnumber": "643.01",
			"text": "حدثنا يحيى بن يحيى، وقتيبة بن سعيد، وأبو بكر بن أبي شيبة قال يحيى أخبرنا وقال الآخران، حدثنا أبو الأحوص، عن سماك، عن جابر بن سمرة، قال كان رسول الله صلى الله عليه وسلم يؤخر صلاة العشاء الآخرة ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 286
			}
		},
		{
			"hadithnumber": 1454,
			"arabicnumber": "643.02",
			"text": "وحدثنا قتيبة بن سعيد، وأبو كامل الجحدري قالا حدثنا أبو عوانة، عن سماك، عن جابر بن سمرة، قال كان رسول الله صلى الله عليه وسلم يصلي الصلوات نحوا من صلاتكم وكان يؤخر العتمة بعد صلاتكم شيئا وكان يخف الصلاة ‏.‏ وفي رواية أبي كامل يخفف ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 287
			}
		},
		{
			"hadithnumber": 1455,
			"arabicnumber": "644.01",
			"text": "وحدثني زهير بن حرب، وابن أبي عمر، قال زهير حدثنا سفيان بن عيينة، عن ابن أبي لبيد، عن أبي سلمة، عن عبد الله بن عمر، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ لا تغلبنكم الأعراب على اسم صلاتكم ألا إنها العشاء وهم يعتمون بالإبل ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 288
			}
		},
		{
			"hadithnumber": 1456,
			"arabicnumber": "644.02",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، حدثنا سفيان، عن عبد الله بن أبي لبيد، عن أبي سلمة بن عبد الرحمن، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا تغلبنكم الأعراب على اسم صلاتكم العشاء فإنها في كتاب الله العشاء وإنها تعتم بحلاب الإبل ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 289
			}
		},
		{
			"hadithnumber": 1457,
			"arabicnumber": "645.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، وزهير بن حرب، كلهم عن سفيان بن عيينة، - قال عمرو حدثنا سفيان بن عيينة، - عن الزهري، عن عروة، عن عائشة، أن نساء المؤمنات، كن يصلين الصبح مع النبي صلى الله عليه وسلم ثم يرجعن متلفعات بمروطهن لا يعرفهن أحد ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 290
			}
		},
		{
			"hadithnumber": 1458,
			"arabicnumber": "645.02",
			"text": "وحدثني حرملة بن يحيى، أخبرنا ابن وهب، أخبرني يونس، أن ابن شهاب، أخبره قال أخبرني عروة بن الزبير، أن عائشة، زوج النبي صلى الله عليه وسلم قالت لقد كان نساء من المؤمنات يشهدن الفجر مع رسول الله صلى الله عليه وسلم متلفعات بمروطهن ثم ينقلبن إلى بيوتهن وما يعرفن من تغليس رسول الله صلى الله عليه وسلم بالصلاة ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 291
			}
		},
		{
			"hadithnumber": 1459,
			"arabicnumber": "645.03",
			"text": "وحدثنا نصر بن علي الجهضمي، وإسحاق بن موسى الأنصاري، قالا حدثنا معن، عن مالك، عن يحيى بن سعيد، عن عمرة، عن عائشة، قالت إن كان رسول الله صلى الله عليه وسلم ليصلي الصبح فينصرف النساء متلفعات بمروطهن ما يعرفن من الغلس ‏.‏ وقال الأنصاري في روايته متلففات ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 292
			}
		},
		{
			"hadithnumber": 1460,
			"arabicnumber": "646.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا غندر، عن شعبة، ح قال وحدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن سعد بن إبراهيم، عن محمد بن عمرو بن الحسن بن علي، قال لما قدم الحجاج المدينة فسألنا جابر بن عبد الله فقال كان رسول الله صلى الله عليه وسلم يصلي الظهر بالهاجرة والعصر والشمس نقية والمغرب إذا وجبت والعشاء أحيانا يؤخرها وأحيانا يعجل كان إذا رآهم قد اجتمعوا عجل وإذا رآهم قد أبطئوا أخر والصبح كانوا أو - قال - كان النبي صلى الله عليه وسلم يصليها بغلس ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 293
			}
		},
		{
			"hadithnumber": 1461,
			"arabicnumber": "646.02",
			"text": "وحدثناه عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن سعد، سمع محمد بن عمرو بن الحسن بن علي، قال كان الحجاج يؤخر الصلوات فسألنا جابر بن عبد الله بمثل حديث غندر ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 294
			}
		},
		{
			"hadithnumber": 1462,
			"arabicnumber": "647.01",
			"text": "وحدثنا يحيى بن حبيب الحارثي، حدثنا خالد بن الحارث، حدثنا شعبة، أخبرني سيار بن سلامة، قال سمعت أبي يسأل أبا برزة، عن صلاة، رسول الله صلى الله عليه وسلم - قال - قلت آنت سمعته قال فقال كأنما أسمعك الساعة - قال - سمعت أبي يسأله عن صلاة رسول الله صلى الله عليه وسلم فقال كان لا يبالي بعض تأخيرها - قال يعني العشاء - إلى نصف الليل ولا يحب النوم قبلها ولا الحديث بعدها ‏.‏ قال شعبة ثم لقيته بعد فسألته فقال وكان يصلي الظهر حين تزول الشمس والعصر يذهب الرجل إلى أقصى المدينة والشمس حية - قال - والمغرب لا أدري أى حين ذكر ‏.‏ قال ثم لقيته بعد فسألته فقال وكان يصلي الصبح فينصرف الرجل فينظر إلى وجه جليسه الذي يعرف فيعرفه ‏.‏ قال وكان يقرأ فيها بالستين إلى المائة ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 295
			}
		},
		{
			"hadithnumber": 1463,
			"arabicnumber": "647.02",
			"text": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن سيار بن سلامة، قال سمعت أبا برزة، يقول كان رسول الله صلى الله عليه وسلم لا يبالي بعض تأخير صلاة العشاء إلى نصف الليل وكان لا يحب النوم قبلها ولا الحديث بعدها ‏.‏ قال شعبة ثم لقيته مرة أخرى فقال أو ثلث الليل ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 296
			}
		},
		{
			"hadithnumber": 1464,
			"arabicnumber": "647.03",
			"text": "وحدثناه أبو كريب، حدثنا سويد بن عمرو الكلبي، عن حماد بن سلمة، عن سيار بن سلامة أبي المنهال، قال سمعت أبا برزة الأسلمي، يقول كان رسول الله صلى الله عليه وسلم يؤخر العشاء إلى ثلث الليل ويكره النوم قبلها والحديث بعدها وكان يقرأ في صلاة الفجر من المائة إلى الستين وكان ينصرف حين يعرف بعضنا وجه بعض ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 297
			}
		},
		{
			"hadithnumber": 1465,
			"arabicnumber": "648.01",
			"text": "حدثنا خلف بن هشام، حدثنا حماد بن زيد، ح قال وحدثني أبو الربيع الزهراني، وأبو كامل الجحدري قالا حدثنا حماد، عن أبي عمران الجوني، عن عبد الله بن الصامت، عن أبي ذر، قال قال لي رسول الله ‏\"‏ كيف أنت إذا كانت عليك أمراء يؤخرون الصلاة عن وقتها أو يميتون الصلاة عن وقتها ‏\"‏ ‏.‏ قال قلت فما تأمرني قال ‏\"‏ صل الصلاة لوقتها فإن أدركتها معهم فصل فإنها لك نافلة ‏\"‏ ‏.‏ ولم يذكر خلف عن وقتها ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 298
			}
		},
		{
			"hadithnumber": 1466,
			"arabicnumber": "648.02",
			"text": "حدثنا يحيى بن يحيى، أخبرنا جعفر بن سليمان، عن أبي عمران الجوني، عن عبد الله بن الصامت، عن أبي ذر، قال قال لي رسول الله صلى الله عليه وسلم ‏ \"‏ يا أبا ذر إنه سيكون بعدي أمراء يميتون الصلاة فصل الصلاة لوقتها فإن صليت لوقتها كانت لك نافلة وإلا كنت قد أحرزت صلاتك ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 299
			}
		},
		{
			"hadithnumber": 1467,
			"arabicnumber": "648.03",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن إدريس، عن شعبة، عن أبي عمران، عن عبد الله بن الصامت، عن أبي ذر، قال إن خليلي أوصاني أن أسمع وأطيع وإن كان عبدا مجدع الأطراف وأن أصلي الصلاة لوقتها ‏ \"‏ فإن أدركت القوم وقد صلوا كنت قد أحرزت صلاتك وإلا كانت لك نافلة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 300
			}
		},
		{
			"hadithnumber": 1468,
			"arabicnumber": "648.04",
			"text": "وحدثني يحيى بن حبيب الحارثي، حدثنا خالد بن الحارث، حدثنا شعبة، عن بديل، قال سمعت أبا العالية، يحدث عن عبد الله بن الصامت، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم وضرب فخذي ‏\"‏ كيف أنت إذا بقيت في قوم يؤخرون الصلاة عن وقتها ‏\"‏ ‏.‏ قال قال ما تأمر قال ‏\"‏ صل الصلاة لوقتها ثم اذهب لحاجتك فإن أقيمت الصلاة وأنت في المسجد فصل ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 301
			}
		},
		{
			"hadithnumber": 1469,
			"arabicnumber": "648.05",
			"text": "وحدثني زهير بن حرب، حدثنا إسماعيل بن إبراهيم، عن أيوب، عن أبي العالية البراء، قال أخر ابن زياد الصلاة فجاءني عبد الله بن الصامت فألقيت له كرسيا فجلس عليه فذكرت له صنيع ابن زياد فعض على شفته وضرب فخذي وقال إني سألت أبا ذر كما سألتني فضرب فخذي كما ضربت فخذك وقال إني سألت رسول الله صلى الله عليه وسلم كما سألتني فضرب فخذي كما ضربت فخذك وقال ‏ \"‏ صل الصلاة لوقتها فإن أدركتك الصلاة معهم فصل ولا تقل إني قد صليت فلا أصلي ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 302
			}
		},
		{
			"hadithnumber": 1470,
			"arabicnumber": "648.06",
			"text": "وحدثنا عاصم بن النضر التيمي، حدثنا خالد بن الحارث، حدثنا شعبة، عن أبي نعامة، عن عبد الله بن الصامت، عن أبي ذر، قال قال ‏ \"‏ كيف أنتم - أو قال كيف أنت - إذا بقيت في قوم يؤخرون الصلاة عن وقتها فصل الصلاة لوقتها ثم إن أقيمت الصلاة فصل معهم فإنها زيادة خير ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 303
			}
		},
		{
			"hadithnumber": 1471,
			"arabicnumber": "648.07",
			"text": "وحدثني أبو غسان المسمعي، حدثنا معاذ، - وهو ابن هشام - حدثني أبي، عن مطر، عن أبي العالية البراء، قال قلت لعبد الله بن الصامت نصلي يوم الجمعة خلف أمراء فيؤخرون الصلاة - قال - فضرب فخذي ضربة أوجعتني وقال سألت أبا ذر عن ذلك فضرب فخذي وقال سألت رسول الله صلى الله عليه وسلم عن ذلك فقال ‏ \"‏ صلوا الصلاة لوقتها واجعلوا صلاتكم معهم نافلة ‏\"‏ ‏.‏ قال وقال عبد الله ذكر لي أن نبي الله صلى الله عليه وسلم ضرب فخذ أبي ذر ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 304
			}
		},
		{
			"hadithnumber": 1472,
			"arabicnumber": "649.01",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن ابن شهاب، عن سعيد بن المسيب، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ صلاة الجماعة أفضل من صلاة أحدكم وحده بخمسة وعشرين جزءا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 305
			}
		},
		{
			"hadithnumber": 1473,
			"arabicnumber": "649.02",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الأعلى، عن معمر، عن الزهري، عن سعيد بن المسيب، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ تفضل صلاة في الجميع على صلاة الرجل وحده خمسا وعشرين درجة ‏\"‏ ‏.‏ قال ‏\"‏ وتجتمع ملائكة الليل وملائكة النهار في صلاة الفجر ‏\"‏ ‏.‏ قال أبو هريرة اقرءوا إن شئتم ‏{‏ وقرآن الفجر إن قرآن الفجر كان مشهودا‏}‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 306
			}
		},
		{
			"hadithnumber": 1474,
			"arabicnumber": "649.03",
			"text": "وحدثني أبو بكر بن إسحاق، حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال أخبرني سعيد، وأبو سلمة أن أبا هريرة، قال سمعت النبي صلى الله عليه وسلم يقول ‏.‏ بمثل حديث عبد الأعلى عن معمر إلا أنه قال ‏ \"‏ بخمس وعشرين جزءا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 307
			}
		},
		{
			"hadithnumber": 1475,
			"arabicnumber": "649.04",
			"text": "وحدثنا عبد الله بن مسلمة بن قعنب، حدثنا أفلح، عن أبي بكر بن محمد بن عمرو بن حزم، عن سلمان الأغر، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ صلاة الجماعة تعدل خمسا وعشرين من صلاة الفذ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 308
			}
		},
		{
			"hadithnumber": 1476,
			"arabicnumber": "649.05",
			"text": "حدثني هارون بن عبد الله، ومحمد بن حاتم، قالا حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني عمر بن عطاء بن أبي الخوار، أنه بينا هو جالس مع نافع بن جبير بن مطعم إذ مر بهم أبو عبد الله ختن زيد بن زبان مولى الجهنيين فدعاه نافع فقال سمعت أبا هريرة يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ صلاة مع الإمام أفضل من خمس وعشرين صلاة يصليها وحده ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 309
			}
		},
		{
			"hadithnumber": 1477,
			"arabicnumber": "650.01",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ صلاة الجماعة أفضل من صلاة الفذ بسبع وعشرين درجة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 310
			}
		},
		{
			"hadithnumber": 1478,
			"arabicnumber": "650.02",
			"text": "وحدثني زهير بن حرب، ومحمد بن المثنى، قالا حدثنا يحيى، عن عبيد الله، قال أخبرني نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏ \"‏ صلاة الرجل في الجماعة تزيد على صلاته وحده سبعا وعشرين ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 311
			}
		},
		{
			"hadithnumber": 1479,
			"arabicnumber": "650.03",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، وابن، نمير ح قال وحدثنا ابن نمير، حدثنا أبي قالا، حدثنا عبيد الله، بهذا الإسناد ‏.‏ قال ابن نمير عن أبيه، ‏\"‏ بضعا وعشرين ‏\"‏ ‏.‏ وقال أبو بكر في روايته ‏\"‏ سبعا وعشرين درجة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 312
			}
		},
		{
			"hadithnumber": 1480,
			"arabicnumber": "650.04",
			"text": "وحدثناه ابن رافع، أخبرنا ابن أبي فديك، أخبرنا الضحاك، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏ \"‏ بضعا وعشرين ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 313
			}
		},
		{
			"hadithnumber": 1481,
			"arabicnumber": "651.01",
			"text": "وحدثني عمرو الناقد، حدثنا سفيان بن عيينة، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم فقد ناسا في بعض الصلوات فقال ‏ \"‏ لقد هممت أن آمر رجلا يصلي بالناس ثم أخالف إلى رجال يتخلفون عنها فآمر بهم فيحرقوا عليهم بحزم الحطب بيوتهم ولو علم أحدهم أنه يجد عظما سمينا لشهدها ‏\"‏ ‏.‏ يعني صلاة العشاء ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 314
			}
		},
		{
			"hadithnumber": 1482,
			"arabicnumber": "651.02",
			"text": "حدثنا ابن نمير، حدثنا أبي، حدثنا الأعمش، ح وحدثنا أبو بكر بن أبي شيبة، وأبو كريب - واللفظ لهما - قالا حدثنا أبو معاوية، عن الأعمش، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن أثقل صلاة على المنافقين صلاة العشاء وصلاة الفجر ولو يعلمون ما فيهما لأتوهما ولو حبوا ولقد هممت أن آمر بالصلاة فتقام ثم آمر رجلا فيصلي بالناس ثم أنطلق معي برجال معهم حزم من حطب إلى قوم لا يشهدون الصلاة فأحرق عليهم بيوتهم بالنار ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 315
			}
		},
		{
			"hadithnumber": 1483,
			"arabicnumber": "651.03",
			"text": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏ \"‏ لقد هممت أن آمر فتياني أن يستعدوا لي بحزم من حطب ثم آمر رجلا يصلي بالناس ثم تحرق بيوت على من فيها ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 316
			}
		},
		{
			"hadithnumber": 1484,
			"arabicnumber": "651.04",
			"text": "وحدثنا زهير بن حرب، وأبو كريب وإسحاق بن إبراهيم عن وكيع، عن جعفر بن برقان، عن يزيد بن الأصم، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏.‏ بنحوه ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 317
			}
		},
		{
			"hadithnumber": 1485,
			"arabicnumber": "652",
			"text": "وحدثنا أحمد بن عبد الله بن يونس، حدثنا زهير، حدثنا أبو إسحاق، عن أبي الأحوص، سمعه منه، عن عبد الله، أن النبي صلى الله عليه وسلم قال لقوم يتخلفون عن الجمعة ‏ \"‏ لقد هممت أن آمر رجلا يصلي بالناس ثم أحرق على رجال يتخلفون عن الجمعة بيوتهم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 318
			}
		},
		{
			"hadithnumber": 1486,
			"arabicnumber": "653",
			"text": "وحدثنا قتيبة بن سعيد، وإسحاق بن إبراهيم، وسويد بن سعيد، ويعقوب الدورقي، كلهم عن مروان الفزاري، - قال قتيبة حدثنا الفزاري، - عن عبيد الله بن الأصم، قال حدثنا يزيد بن الأصم، عن أبي هريرة، قال أتى النبي صلى الله عليه وسلم رجل أعمى فقال يا رسول الله إنه ليس لي قائد يقودني إلى المسجد ‏.‏ فسأل رسول الله صلى الله عليه وسلم أن يرخص له فيصلي في بيته فرخص له فلما ولى دعاه فقال ‏\"‏ هل تسمع النداء بالصلاة ‏\"‏ ‏.‏ فقال نعم ‏.‏ قال ‏\"‏ فأجب ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 319
			}
		},
		{
			"hadithnumber": 1487,
			"arabicnumber": "654.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر العبدي، حدثنا زكرياء بن أبي زائدة، حدثنا عبد الملك بن عمير، عن أبي الأحوص، قال قال عبد الله لقد رأيتنا وما يتخلف عن الصلاة إلا منافق قد علم نفاقه أو مريض إن كان المريض ليمشي بين رجلين حتى يأتي الصلاة - وقال - إن رسول الله صلى الله عليه وسلم علمنا سنن الهدى وإن من سنن الهدى الصلاة في المسجد الذي يؤذن فيه ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 320
			}
		},
		{
			"hadithnumber": 1488,
			"arabicnumber": "654.02",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا الفضل بن دكين، عن أبي العميس، عن علي بن الأقمر، عن أبي الأحوص، عن عبد الله، قال من سره أن يلقى الله غدا مسلما فليحافظ على هؤلاء الصلوات حيث ينادى بهن فإن الله شرع لنبيكم صلى الله عليه وسلم سنن الهدى وإنهن من سنن الهدى ولو أنكم صليتم في بيوتكم كما يصلي هذا المتخلف في بيته لتركتم سنة نبيكم ولو تركتم سنة نبيكم لضللتم وما من رجل يتطهر فيحسن الطهور ثم يعمد إلى مسجد من هذه المساجد إلا كتب الله له بكل خطوة يخطوها حسنة ويرفعه بها درجة ويحط عنه بها سيئة ولقد رأيتنا وما يتخلف عنها إلا منافق معلوم النفاق ولقد كان الرجل يؤتى به يهادى بين الرجلين حتى يقام في الصف ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 321
			}
		},
		{
			"hadithnumber": 1489,
			"arabicnumber": "655.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو الأحوص، عن إبراهيم بن المهاجر، عن أبي الشعثاء، قال كنا قعودا في المسجد مع أبي هريرة فأذن المؤذن فقام رجل من المسجد يمشي فأتبعه أبو هريرة بصره حتى خرج من المسجد فقال أبو هريرة أما هذا فقد عصى أبا القاسم صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 322
			}
		},
		{
			"hadithnumber": 1490,
			"arabicnumber": "655.02",
			"text": "وحدثنا ابن أبي عمر المكي، حدثنا سفيان، - هو ابن عيينة - عن عمر بن سعيد، عن أشعث بن أبي الشعثاء المحاربي، عن أبيه، قال سمعت أبا هريرة، ورأى، رجلا يجتاز المسجد خارجا بعد الأذان فقال أما هذا فقد عصى أبا القاسم صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 323
			}
		},
		{
			"hadithnumber": 1491,
			"arabicnumber": "656.01",
			"text": "حدثنا إسحاق بن إبراهيم، أخبرنا المغيرة بن سلمة المخزومي، حدثنا عبد الواحد، - وهو ابن زياد - حدثنا عثمان بن حكيم، حدثنا عبد الرحمن بن أبي عمرة، قال دخل عثمان بن عفان المسجد بعد صلاة المغرب فقعد وحده فقعدت إليه فقال يا ابن أخي سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ من صلى العشاء في جماعة فكأنما قام نصف الليل ومن صلى الصبح في جماعة فكأنما صلى الليل كله ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 324
			}
		},
		{
			"hadithnumber": 1492,
			"arabicnumber": "656.02",
			"text": "وحدثنيه زهير بن حرب، حدثنا محمد بن عبد الله الأسدي، ح وحدثني محمد بن رافع، قال حدثنا عبد الرزاق، جميعا عن سفيان، عن أبي سهل، عثمان بن حكيم بهذا الإسناد ‏.‏ مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 325
			}
		},
		{
			"hadithnumber": 1493,
			"arabicnumber": "657.01",
			"text": "وحدثني نصر بن علي الجهضمي، حدثنا بشر، - يعني ابن مفضل - عن خالد، عن أنس بن سيرين، قال سمعت جندب بن عبد الله، يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ من صلى الصبح فهو في ذمة الله فلا يطلبنكم الله من ذمته بشىء فيدركه فيكبه في نار جهنم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 326
			}
		},
		{
			"hadithnumber": 1494,
			"arabicnumber": "657.02",
			"text": "وحدثنيه يعقوب بن إبراهيم الدورقي، حدثنا إسماعيل، عن خالد، عن أنس بن سيرين، قال سمعت جندبا القسري، يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ من صلى صلاة الصبح فهو في ذمة الله فلا يطلبنكم الله من ذمته بشىء فإنه من يطلبه من ذمته بشىء يدركه ثم يكبه على وجهه في نار جهنم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 327
			}
		},
		{
			"hadithnumber": 1495,
			"arabicnumber": "657.03",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا ابن هارون، عن داود بن أبي هند، عن الحسن، عن جندب بن سفيان، عن النبي صلى الله عليه وسلم بهذا ولم يذكر ‏ \"‏ فيكبه في نار جهنم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 328
			}
		},
		{
			"hadithnumber": 1496,
			"arabicnumber": "33.03",
			"text": "حدثني حرملة بن يحيى التجيبي، أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، أن محمود بن الربيع الأنصاري، حدثه أن عتبان بن مالك وهو من أصحاب النبي صلى الله عليه وسلم ممن شهد بدرا من الأنصار أنه أتى رسول الله صلى الله عليه وسلم فقال يا رسول الله إني قد أنكرت بصري وأنا أصلي لقومي وإذا كانت الأمطار سال الوادي الذي بيني وبينهم ولم أستطع أن آتي مسجدهم فأصلي لهم وددت أنك يا رسول الله تأتي فتصلي في مصلى ‏.‏ فأتخذه مصلى ‏.‏ قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ سأفعل إن شاء الله ‏\"‏ ‏.‏ قال عتبان فغدا رسول الله صلى الله عليه وسلم وأبو بكر الصديق حين ارتفع النهار فاستأذن رسول الله صلى الله عليه وسلم فأذنت له فلم يجلس حتى دخل البيت ثم قال ‏\"‏ أين تحب أن أصلي من بيتك ‏\"‏ ‏.‏ قال فأشرت إلى ناحية من البيت فقام رسول الله صلى الله عليه وسلم فكبر فقمنا وراءه فصلى ركعتين ثم سلم - قال - وحبسناه على خزير صنعناه له - قال - فثاب رجال من أهل الدار حولنا حتى اجتمع في البيت رجال ذوو عدد فقال قائل منهم أين مالك بن الدخشن فقال بعضهم ذلك منافق لا يحب الله ورسوله ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقل له ذلك ألا تراه قد قال لا إله إلا الله ‏.‏ يريد بذلك وجه الله ‏\"‏ ‏.‏ قال قالوا الله ورسوله أعلم ‏.‏ قال فإنما نرى وجهه ونصيحته للمنافقين ‏.‏ قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ فإن الله قد حرم على النار من قال لا إله إلا الله ‏.‏ يبتغي بذلك وجه الله ‏\"‏ ‏.‏ قال ابن شهاب ثم سألت الحصين بن محمد الأنصاري - وهو أحد بني سالم وهو من سراتهم - عن حديث محمود بن الربيع فصدقه بذلك ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 329
			}
		},
		{
			"hadithnumber": 1497,
			"arabicnumber": "33.04",
			"text": "وحدثنا محمد بن رافع، وعبد بن حميد، كلاهما عن عبد الرزاق، قال أخبرنا معمر، عن الزهري، قال حدثني محمود بن ربيع، عن عتبان بن مالك، قال أتيت رسول الله صلى الله عليه وسلم ‏.‏ وساق الحديث بمعنى حديث يونس غير أنه قال فقال رجل أين مالك بن الدخشن أو الدخيشن وزاد في الحديث قال محمود فحدثت بهذا الحديث نفرا فيهم أبو أيوب الأنصاري فقال ما أظن رسول الله صلى الله عليه وسلم قال ما قلت - قال - فحلفت إن رجعت إلى عتبان أن أسأله - قال - فرجعت إليه فوجدته شيخا كبيرا قد ذهب بصره وهو إمام قومه فجلست إلى جنبه فسألته عن هذا الحديث فحدثنيه كما حدثنيه أول مرة ‏.‏ قال الزهري ثم نزلت بعد ذلك فرائض وأمور نرى أن الأمر انتهى إليها فمن استطاع أن لا يغتر فلا يغتر ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 330
			}
		},
		{
			"hadithnumber": 1498,
			"arabicnumber": "33.05",
			"text": "وحدثنا إسحاق بن إبراهيم، أخبرنا الوليد بن مسلم، عن الأوزاعي، قال حدثني الزهري، عن محمود بن الربيع، قال إني لأعقل مجة مجها رسول الله صلى الله عليه وسلم من دلو في دارنا ‏.‏ قال محمود فحدثني عتبان بن مالك قال قلت يا رسول الله إن بصري قد ساء ‏.‏ وساق الحديث إلى قوله فصلى بنا ركعتين وحبسنا رسول الله صلى الله عليه وسلم على جشيشة صنعناها له ‏.‏ ولم يذكر ما بعده من زيادة يونس ومعمر ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 331
			}
		},
		{
			"hadithnumber": 1499,
			"arabicnumber": "658",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، أن جدته، مليكة دعت رسول الله صلى الله عليه وسلم لطعام صنعته فأكل منه ثم قال ‏ \"‏ قوموا فأصلي لكم ‏\"‏ ‏.‏ قال أنس بن مالك فقمت إلى حصير لنا قد اسود من طول ما لبس فنضحته بماء فقام عليه رسول الله صلى الله عليه وسلم وصففت أنا واليتيم وراءه والعجوز من ورائنا فصلى لنا رسول الله صلى الله عليه وسلم ركعتين ثم انصرف ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 332
			}
		},
		{
			"hadithnumber": 1500,
			"arabicnumber": "659",
			"text": "وحدثنا شيبان بن فروخ، وأبو الربيع، كلاهما عن عبد الوارث، قال شيبان حدثنا عبد الوارث، عن أبي التياح، عن أنس بن مالك، قال كان رسول الله صلى الله عليه وسلم أحسن الناس خلقا فربما تحضر الصلاة وهو في بيتنا فيأمر بالبساط الذي تحته فيكنس ثم ينضح ثم يؤم رسول الله صلى الله عليه وسلم ونقوم خلفه فيصلي بنا وكان بساطهم من جريد النخل ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 333
			}
		},
		{
			"hadithnumber": 1501,
			"arabicnumber": "660.01",
			"text": "حدثني زهير بن حرب، حدثنا هاشم بن القاسم، حدثنا سليمان، عن ثابت، عن أنس، قال دخل النبي صلى الله عليه وسلم علينا وما هو إلا أنا وأمي وأم حرام خالتي فقال ‏\"‏ قوموا فلأصلي بكم ‏\"‏ ‏.‏ في غير وقت صلاة فصلى بنا ‏.‏ فقال رجل لثابت أين جعل أنسا منه قال جعله على يمينه ‏.‏ ثم دعا لنا أهل البيت بكل خير من خير الدنيا والآخرة فقالت أمي يا رسول الله خويدمك ادع الله له ‏.‏ قال فدعا لي بكل خير وكان في آخر ما دعا لي به أن قال ‏\"‏ اللهم أكثر ماله وولده وبارك له فيه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 334
			}
		},
		{
			"hadithnumber": 1502,
			"arabicnumber": "660.02",
			"text": "وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن عبد الله بن المختار، سمع موسى بن أنس، يحدث عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم صلى به وبأمه أو خالته ‏.‏ قال فأقامني عن يمينه وأقام المرأة خلفنا ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 335
			}
		},
		{
			"hadithnumber": 1503,
			"arabicnumber": "660.03",
			"text": "وحدثناه محمد بن المثنى، حدثنا محمد بن جعفر، ح وحدثنيه زهير بن حرب، قال حدثنا عبد الرحمن، - يعني ابن مهدي - قال حدثنا شعبة، بهذا الإسناد ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 336
			}
		},
		{
			"hadithnumber": 1504,
			"arabicnumber": "513.02",
			"text": "حدثنا يحيى بن يحيى التميمي، أخبرنا خالد بن عبد الله، ح وحدثنا أبو بكر بن أبي شيبة، قال حدثنا عباد بن العوام، كلاهما عن الشيباني، عن عبد الله بن شداد، قال حدثتني ميمونة، زوج النبي صلى الله عليه وسلم قالت كان رسول الله صلى الله عليه وسلم يصلي وأنا حذاءه وربما أصابني ثوبه إذا سجد وكان يصلي على خمرة ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 337
			}
		},
		{
			"hadithnumber": 1505,
			"arabicnumber": "661",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، ح وحدثني سويد بن سعيد، قال حدثنا علي بن مسهر، جميعا عن الأعمش، ح وحدثنا إسحاق بن إبراهيم، - واللفظ له - أخبرنا عيسى بن يونس، حدثنا الأعمش، عن أبي سفيان، عن جابر، قال حدثنا أبو سعيد الخدري، أنه دخل على رسول الله صلى الله عليه وسلم فوجده يصلي على حصير يسجد عليه ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 338
			}
		},
		{
			"hadithnumber": 1506,
			"arabicnumber": "649.06",
			"text": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب جميعا عن أبي معاوية، - قال أبو كريب حدثنا أبو معاوية، - عن الأعمش، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ صلاة الرجل في جماعة تزيد على صلاته في بيته وصلاته في سوقه بضعا وعشرين درجة وذلك أن أحدهم إذا توضأ فأحسن الوضوء ثم أتى المسجد لا ينهزه إلا الصلاة لا يريد إلا الصلاة فلم يخط خطوة إلا رفع له بها درجة وحط عنه بها خطيئة حتى يدخل المسجد فإذا دخل المسجد كان في الصلاة ما كانت الصلاة هي تحبسه والملائكة يصلون على أحدكم ما دام في مجلسه الذي صلى فيه يقولون اللهم ارحمه اللهم اغفر له اللهم تب عليه ما لم يؤذ فيه ما لم يحدث فيه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 339
			}
		},
		{
			"hadithnumber": 1507,
			"arabicnumber": "649.07",
			"text": "حدثنا سعيد بن عمرو الأشعثي، أخبرنا عبثر، ح وحدثني محمد بن بكار بن الريان، قال حدثنا إسماعيل بن زكرياء، ح وحدثنا ابن المثنى، قال حدثنا ابن أبي عدي، عن شعبة، كلهم عن الأعمش، في هذا الإسناد بمثل معناه ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 340
			}
		},
		{
			"hadithnumber": 1508,
			"arabicnumber": "649.08",
			"text": "وحدثنا ابن أبي عمر، حدثنا سفيان، عن أيوب السختياني، عن ابن سيرين، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن الملائكة تصلي على أحدكم ما دام في مجلسه تقول اللهم اغفر له اللهم ارحمه ما لم يحدث وأحدكم في صلاة ما كانت الصلاة تحبسه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 341
			}
		},
		{
			"hadithnumber": 1509,
			"arabicnumber": "649.09",
			"text": "وحدثني محمد بن حاتم، حدثنا بهز، حدثنا حماد بن سلمة، عن ثابت، عن أبي رافع، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا يزال العبد في صلاة ما كان في مصلاه ينتظر الصلاة وتقول الملائكة اللهم اغفر له اللهم ارحمه ‏.‏ حتى ينصرف أو يحدث ‏\"‏ ‏.‏ قلت ما يحدث قال يفسو أو يضرط ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 342
			}
		},
		{
			"hadithnumber": 1510,
			"arabicnumber": "649.10",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا يزال أحدكم في صلاة ما دامت الصلاة تحبسه لا يمنعه أن ينقلب إلى أهله إلا الصلاة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 343
			}
		},
		{
			"hadithnumber": 1511,
			"arabicnumber": "649.11",
			"text": "حدثني حرملة بن يحيى، أخبرنا ابن وهب، أخبرني يونس، ح وحدثني محمد بن سلمة المرادي، حدثنا عبد الله بن وهب، عن يونس، عن ابن شهاب، عن ابن هرمز، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ أحدكم ما قعد ينتظر الصلاة في صلاة ما لم يحدث تدعو له الملائكة اللهم اغفر له اللهم ارحمه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 344
			}
		},
		{
			"hadithnumber": 1512,
			"arabicnumber": "649.12",
			"text": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، عن أبي هريرة، عن النبي صلى الله عليه وسلم بنحو هذا ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 345
			}
		},
		{
			"hadithnumber": 1513,
			"arabicnumber": "662",
			"text": "حدثنا عبد الله بن براد الأشعري، وأبو كريب قالا حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن أعظم الناس أجرا في الصلاة أبعدهم إليها ممشى فأبعدهم والذي ينتظر الصلاة حتى يصليها مع الإمام أعظم أجرا من الذي يصليها ثم ينام ‏\"‏ ‏.‏ وفي رواية أبي كريب ‏\"‏ حتى يصليها مع الإمام في جماعة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 346
			}
		},
		{
			"hadithnumber": 1514,
			"arabicnumber": "663.01",
			"text": "حدثنا يحيى بن يحيى، أخبرنا عبثر، عن سليمان التيمي، عن أبي عثمان النهدي، عن أبى بن كعب، قال كان رجل لا أعلم رجلا أبعد من المسجد منه وكان لا تخطئه صلاة - قال - فقيل له أو قلت له لو اشتريت حمارا تركبه في الظلماء وفي الرمضاء ‏.‏ قال ما يسرني أن منزلي إلى جنب المسجد إني أريد أن يكتب لي ممشاى إلى المسجد ورجوعي إذا رجعت إلى أهلي ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏ \"‏ قد جمع الله لك ذلك كله ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 347
			}
		},
		{
			"hadithnumber": 1515,
			"arabicnumber": "663.02",
			"text": "وحدثنا محمد بن عبد الأعلى، حدثنا المعتمر، ح وحدثنا إسحاق بن إبراهيم، قال أخبرنا جرير، كلاهما عن التيمي، بهذا الإسناد ‏.‏ بنحوه ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 348
			}
		},
		{
			"hadithnumber": 1516,
			"arabicnumber": "663.03",
			"text": "حدثنا محمد بن أبي بكر المقدمي، حدثنا عباد بن عباد، حدثنا عاصم، عن أبي عثمان، عن أبى بن كعب، قال كان رجل من الأنصار بيته أقصى بيت في المدينة فكان لا تخطئه الصلاة مع رسول الله صلى الله عليه وسلم - قال - فتوجعنا له فقلت له يا فلان لو أنك اشتريت حمارا يقيك من الرمضاء ويقيك من هوام الأرض ‏.‏ قال أما والله ما أحب أن بيتي مطنب ببيت محمد صلى الله عليه وسلم قال فحملت به حملا حتى أتيت نبي الله صلى الله عليه وسلم فأخبرته - قال - فدعاه فقال له مثل ذلك وذكر له أنه يرجو في أثره الأجر ‏.‏ فقال له النبي صلى الله عليه وسلم ‏ \"‏ إن لك ما احتسبت ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 349
			}
		},
		{
			"hadithnumber": 1517,
			"arabicnumber": "663.04",
			"text": "وحدثنا سعيد بن عمرو الأشعثي، ومحمد بن أبي عمر، كلاهما عن ابن عيينة، ح وحدثنا سعيد بن أزهر الواسطي، قال حدثنا وكيع، حدثنا أبي كلهم، عن عاصم، بهذا الإسناد نحوه ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 350
			}
		},
		{
			"hadithnumber": 1518,
			"arabicnumber": "664",
			"text": "وحدثنا حجاج بن الشاعر، حدثنا روح بن عبادة، حدثنا زكرياء بن إسحاق، حدثنا أبو الزبير، قال سمعت جابر بن عبد الله، قال كانت ديارنا نائية عن المسجد، فأردنا أن نبيع، بيوتنا فنقترب من المسجد فنهانا رسول الله صلى الله عليه وسلم فقال ‏ \"‏ إن لكم بكل خطوة درجة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 351
			}
		},
		{
			"hadithnumber": 1519,
			"arabicnumber": "665.01",
			"text": "حدثنا محمد بن المثنى، حدثنا عبد الصمد بن عبد الوارث، قال سمعت أبي يحدث، قال حدثني الجريري، عن أبي نضرة، عن جابر بن عبد الله، قال خلت البقاع حول المسجد فأراد بنو سلمة أن ينتقلوا إلى قرب المسجد فبلغ ذلك رسول الله صلى الله عليه وسلم فقال لهم ‏\"‏ إنه بلغني أنكم تريدون أن تنتقلوا قرب المسجد ‏\"‏ ‏.‏ قالوا نعم يا رسول الله قد أردنا ذلك ‏.‏ فقال ‏\"‏ يا بني سلمة دياركم تكتب آثاركم دياركم تكتب آثاركم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 352
			}
		},
		{
			"hadithnumber": 1520,
			"arabicnumber": "665.02",
			"text": "حدثنا عاصم بن النضر التيمي، حدثنا معتمر، قال سمعت كهمسا، يحدث عن أبي نضرة، عن جابر بن عبد الله، قال أراد بنو سلمة أن يتحولوا، إلى قرب المسجد ‏.‏ - قال - والبقاع خالية فبلغ ذلك النبي صلى الله عليه وسلم فقال ‏ \"‏ يا بني سلمة دياركم تكتب آثاركم ‏\"‏ ‏.‏ فقالوا ما كان يسرنا أنا كنا تحولنا ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 353
			}
		},
		{
			"hadithnumber": 1521,
			"arabicnumber": "666",
			"text": "حدثني إسحاق بن منصور، أخبرنا زكرياء بن عدي، أخبرنا عبيد الله، - يعني ابن عمرو - عن زيد بن أبي أنيسة، عن عدي بن ثابت، عن أبي حازم الأشجعي، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من تطهر في بيته ثم مشى إلى بيت من بيوت الله ليقضي فريضة من فرائض الله كانت خطوتاه إحداهما تحط خطيئة والأخرى ترفع درجة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 354
			}
		},
		{
			"hadithnumber": 1522,
			"arabicnumber": "667",
			"text": "وحدثنا قتيبة بن سعيد، حدثنا ليث، ح وقال قتيبة حدثنا بكر، - يعني ابن مضر - كلاهما عن ابن الهاد، عن محمد بن إبراهيم، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال وفي حديث بكر أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ أرأيتم لو أن نهرا بباب أحدكم يغتسل منه كل يوم خمس مرات هل يبقى من درنه شىء ‏\"‏ ‏.‏ قالوا لا يبقى من درنه شىء ‏.‏ قال ‏\"‏ فذلك مثل الصلوات الخمس يمحو الله به��ن الخطايا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 355
			}
		},
		{
			"hadithnumber": 1523,
			"arabicnumber": "668",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، عن الأعمش، عن أبي سفيان، عن جابر، - وهو ابن عبد الله - قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ مثل الصلوات الخمس كمثل نهر جار غمر على باب أحدكم يغتسل منه كل يوم خمس مرات ‏\"‏ ‏.‏ قال قال الحسن وما يبقي ذلك من الدرن",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 356
			}
		},
		{
			"hadithnumber": 1524,
			"arabicnumber": "669",
			"text": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، قالا حدثنا يزيد بن هارون، أخبرنا محمد بن مطرف، عن زيد بن أسلم، عن عطاء بن يسار، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏ \"‏ من غدا إلى المسجد أو راح أعد الله له في الجنة نزلا كلما غدا أو راح ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 357
			}
		},
		{
			"hadithnumber": 1525,
			"arabicnumber": "670.01",
			"text": "حدثنا أحمد بن عبد الله بن يونس، حدثنا زهير، حدثنا سماك، ح وحدثنا يحيى بن يحيى، - واللفظ له - قال أخبرنا أبو خيثمة، عن سماك بن حرب، قال قلت لجابر بن سمرة أكنت تجالس رسول الله صلى الله عليه وسلم قال نعم كثيرا كان لا يقوم من مصلاه الذي يصلي فيه الصبح أو الغداة حتى تطلع الشمس فإذا طلعت الشمس قام وكانوا يتحدثون فيأخذون في أمر الجاهلية فيضحكون ويتبسم ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 358
			}
		},
		{
			"hadithnumber": 1526,
			"arabicnumber": "670.02",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن سفيان، قال أبو بكر وحدثنا محمد بن بشر، عن زكرياء، كلاهما عن سماك، عن جابر بن سمرة، أن النبي صلى الله عليه وسلم كان إذا صلى الفجر جلس في مصلاه حتى تطلع الشمس حسنا ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 359
			}
		},
		{
			"hadithnumber": 1527,
			"arabicnumber": "670.03",
			"text": "وحدثنا قتيبة، وأبو بكر بن أبي شيبة قالا حدثنا أبو الأحوص، ح قال وحدثنا ابن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، كلاهما عن سماك، بهذا الإسناد ‏.‏ ولم يقولا حسنا ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 360
			}
		},
		{
			"hadithnumber": 1528,
			"arabicnumber": "671",
			"text": "وحدثنا هارون بن معروف، وإسحاق بن موسى الأنصاري، قالا حدثنا أنس بن عياض، - حدثني ابن أبي ذباب، في رواية هارون - وفي حديث الأنصاري حدثني الحارث - عن عبد الرحمن بن مهران مولى أبي هريرة عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ أحب البلاد إلى الله مساجدها وأبغض البلاد إلى الله أسواقها ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 361
			}
		},
		{
			"hadithnumber": 1529,
			"arabicnumber": "672.01",
			"text": "حدثنا قتيبة بن سعيد، حدثنا أبو عوانة، عن قتادة، عن أبي نضرة، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا كانوا ثلاثة فليؤمهم أحدهم وأحقهم بالإمامة أقرؤهم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 362
			}
		},
		{
			"hadithnumber": 1530,
			"arabicnumber": "672.02",
			"text": "وحدثنا محمد بن بشار، حدثنا يحيى بن سعيد، حدثنا شعبة، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، عن سعيد بن أبي عروبة، ح وحدثني أبو غسان المسمعي، حدثنا معاذ، - وهو ابن هشام - حدثني أبي كلهم، عن قتادة، بهذا الإسناد مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 363
			}
		},
		{
			"hadithnumber": 1531,
			"arabicnumber": "672.03",
			"text": "وحدثنا محمد بن المثنى، حدثنا سالم بن نوح، ح وحدثنا حسن بن عيسى، حدثنا ابن المبارك، جميعا عن الجريري، عن أبي نضرة، عن أبي سعيد، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 364
			}
		},
		{
			"hadithnumber": 1532,
			"arabicnumber": "673.01",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وأبو سعيد الأشج كلاهما عن أبي خالد، - قال أبو بكر حدثنا أبو خالد الأحمر، - عن الأعمش، عن إسماعيل بن رجاء، عن أوس بن ضمعج، عن أبي مسعود الأنصاري، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ يؤم القوم أقرؤهم لكتاب الله فإن كانوا في القراءة سواء فأعلمهم بالسنة فإن كانوا في السنة سواء فأقدمهم هجرة فإن كانوا في الهجرة سواء فأقدمهم سلما ولا يؤمن الرجل الرجل في سلطانه ولا يقعد في بيته على تكرمته إلا بإذنه ‏\"‏ ‏.‏ قال الأشج في روايته مكان سلما سنا ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 365
			}
		},
		{
			"hadithnumber": 1533,
			"arabicnumber": "673.02",
			"text": "حدثنا أبو كريب، حدثنا أبو معاوية، ح وحدثنا إسحاق، أخبرنا جرير، وأبو معاوية ح وحدثنا الأشج، حدثنا ابن فضيل، ح وحدثنا ابن أبي عمر، حدثنا سفيان، كلهم عن الأعمش، بهذا الإسناد مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 366
			}
		},
		{
			"hadithnumber": 1534,
			"arabicnumber": "673.03",
			"text": "وحدثنا محمد بن المثنى، وابن، بشار قال ابن المثنى حدثنا محمد بن جعفر، عن شعبة، عن إسماعيل بن رجاء، قال سمعت أوس بن ضمعج، يقول سمعت أبا مسعود، يقول قال لنا رسول الله صلى الله عليه وسلم ‏ \"‏ يؤم القوم أقرؤهم لكتاب الله وأقدمهم قراءة فإن كانت قراءتهم سواء فليؤمهم أقدمهم هجرة فإن كانوا في الهجرة سواء فليؤمهم أكبرهم سنا ولا تؤمن الرجل في أهله ولا في سلطانه ولا تجلس على تكرمته في بيته إلا أن يأذن لك أو بإذنه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 367
			}
		},
		{
			"hadithnumber": 1535,
			"arabicnumber": "674.01",
			"text": "وحدثني زهير بن حرب، حدثنا إسماعيل بن إبراهيم، حدثنا أيوب، عن أبي قلابة، عن مالك بن الحويرث، قال أتينا رسول الله صلى الله عليه وسلم ونحن شببة متقاربون فأقمنا عنده عشرين ليلة وكان رسول الله صلى الله عليه وسلم رحيما رقيقا فظن أنا قد اشتقنا أهلنا فسألنا عن من تركنا من أهلنا فأخبرناه فقال ‏ \"‏ ارجعوا إلى أهليكم فأقيموا فيهم وعلموهم ومروهم فإذا حضرت الصلاة فليؤذن لكم أحدكم ثم ليؤمكم أكبركم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 368
			}
		},
		{
			"hadithnumber": 1536,
			"arabicnumber": "674.02",
			"text": "وحدثنا أبو الربيع الزهراني، وخلف بن هشام، قالا حدثنا حماد، عن أيوب، بهذا الإسناد ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 369
			}
		},
		{
			"hadithnumber": 1537,
			"arabicnumber": "674.03",
			"text": "وحدثناه ابن أبي عمر، حدثنا عبد الوهاب، عن أيوب، قال قال لي أبو قلابة حدثنا مالك بن الحويرث أبو سليمان، قال أتيت رسول الله صلى الله عليه وسلم في ناس ونحن شببة متقاربون ‏.‏ واقتصا جميعا الحديث بنحو حديث ابن علية ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 370
			}
		},
		{
			"hadithnumber": 1538,
			"arabicnumber": "674.04",
			"text": "وحدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا عبد الوهاب الثقفي، عن خالد الحذاء، عن أبي قلابة، عن مالك بن الحويرث، قال أتيت النبي صلى الله عليه وسلم أنا وصاحب لي فلما أردنا الإقفال من عنده قال لنا ‏ \"‏ إذا حضرت الصلاة فأذنا ثم أقيما وليؤمكما أكبركما ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 371
			}
		},
		{
			"hadithnumber": 1539,
			"arabicnumber": "674.05",
			"text": "وحدثناه أبو سعيد الأشج، حدثنا حفص، - يعني ابن غياث - حدثنا خالد الحذاء، بهذا الإسناد وزاد قال الحذاء وكانا متقاربين في القراءة ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 372
			}
		},
		{
			"hadithnumber": 1540,
			"arabicnumber": "675.01",
			"text": "حدثني أبو الطاهر، وحرملة بن يحيى، قالا أخبرنا ابن وهب، أخبرني يونس بن يزيد، عن ابن شهاب، قال أخبرني سعيد بن المسيب، وأبو سلمة بن عبد الرحمن بن عوف أنهما سمعا أبا هريرة، يقول كان رسول الله صلى الله عليه وسلم يقول حين يفرغ من صلاة الفجر من القراءة ويكبر ويرفع رأسه ‏\"‏ سمع الله لمن حمده ربنا ولك الحمد ‏\"‏ ‏.‏ ثم يقول وهو قائم ‏\"‏ اللهم أنج الوليد بن الوليد وسلمة بن هشام وعياش بن أبي ربيعة والمستضعفين من المؤمنين اللهم اشدد وطأتك على مضر واجعلها عليهم كسني يوسف اللهم العن لحيان ورعلا وذكوان وعصية عصت الله ورسوله ‏\"‏ ‏.‏ ثم بلغنا أنه ترك ذلك لما أنزل ‏{‏ ليس لك من الأمر شىء أو يتوب عليهم أو يعذبهم فإنهم ظالمون‏}‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 373
			}
		},
		{
			"hadithnumber": 1541,
			"arabicnumber": "675.02",
			"text": "وحدثناه أبو بكر بن أبي شيبة، وعمرو الناقد، قالا حدثنا ابن عيينة، عن الزهري، عن سعيد بن المسيب، عن أبي هريرة، عن النبي صلى الله عليه وسلم إلى قوله ‏ \"‏ واجعلها عليهم كسني يوسف ‏\"‏ ‏.‏ ولم يذكر ما بعده ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 374
			}
		},
		{
			"hadithnumber": 1542,
			"arabicnumber": "675.03",
			"text": "حدثنا محمد بن مهران الرازي، حدثنا الوليد بن مسلم، حدثنا الأوزاعي، عن يحيى بن أبي كثير، عن أبي سلمة، أن أبا هريرة، حدثهم أن النبي صلى الله عليه وسلم قنت بعد الركعة في صلاة شهرا إذا قال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ يقول في قنوته ‏\"‏ اللهم أنج الوليد بن الوليد اللهم نج سلمة بن هشام اللهم نج عياش بن أبي ربيعة اللهم نج المستضعفين من المؤمنين اللهم اشدد وطأتك على مضر اللهم اجعلها عليهم سنين كسني يوسف ‏\"‏ ‏.‏ قال أبو هريرة ثم رأيت رسول الله صلى الله عليه وسلم ترك الدعاء بعد فقلت أرى رسول الله صلى الله عليه وسلم قد ترك الدعاء لهم - قال - فقيل وما تراهم قد قدموا",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 375
			}
		},
		{
			"hadithnumber": 1543,
			"arabicnumber": "675.04",
			"text": "وحدثني زهير بن حرب، حدثنا حسين بن محمد، حدثنا شيبان، عن يحيى، عن أبي سلمة، أن أبا هريرة، أخبره أن رسول الله صلى الله عليه وسلم بينما هو يصلي العشاء إذ قال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ ثم قال قبل أن يسجد ‏\"‏ اللهم نج عياش بن أبي ربيعة ‏\"‏ ‏.‏ ثم ذكر بمثل حديث الأوزاعي إلى قوله ‏\"‏ كسني يوسف ‏\"‏ ‏.‏ ولم يذكر ما بعده ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 376
			}
		},
		{
			"hadithnumber": 1544,
			"arabicnumber": "676",
			"text": "حدثنا محمد بن المثنى، حدثنا معاذ بن هشام، حدثني أبي، عن يحيى بن أبي كثير، قال حدثنا أبو سلمة بن عبد الرحمن، أنه سمع أبا هريرة، يقول والله لأقربن بكم صلاة رسول الله صلى الله عليه وسلم ‏.‏ فكان أبو هريرة يقنت في الظهر والعشاء الآخرة وصلاة الصبح ويدعو للمؤمنين ويلعن الكفار ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 377
			}
		},
		{
			"hadithnumber": 1545,
			"arabicnumber": "677.01",
			"text": "وحدثنا يحيى بن يحيى، قال قرأت على مالك عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، قال دعا رسول الله صلى الله عليه وسلم على الذين قتلوا أصحاب بئر معونة ثلاثين صباحا يدعو على رعل وذكوان ولحيان وعصية عصت الله ورسوله ‏.‏ قال أنس أنزل الله عز وجل في الذين قتلوا ببئر معونة قرآنا قرأناه حتى نسخ بعد أن بلغوا قومنا أن قد لقينا ربنا فرضي عنا ورضينا عنه ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 378
			}
		},
		{
			"hadithnumber": 1546,
			"arabicnumber": "677.02",
			"text": "وحدثني عمرو الناقد، وزهير بن حرب، قالا حدثنا إسماعيل، عن أيوب، عن محمد، قال قلت لأنس هل قنت رسول الله صلى الله عليه وسلم في صلاة الصبح قال نعم بعد الركوع يسيرا ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 379
			}
		},
		{
			"hadithnumber": 1547,
			"arabicnumber": "677.03",
			"text": "وحدثني عبيد الله بن معاذ العنبري، وأبو كريب وإسحاق بن إبراهيم ومحمد بن عبد الأعلى - واللفظ لابن معاذ - حدثنا المعتمر بن سليمان، عن أبيه، عن أبي مجلز، عن أنس بن مالك، قنت رسول الله صلى الله عليه وسلم شهرا بعد الركوع في صلاة الصبح يدعو على رعل وذكوان ويقول ‏ \"‏ عصية عصت الله ورسوله ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 380
			}
		},
		{
			"hadithnumber": 1548,
			"arabicnumber": "677.04",
			"text": "وحدثني محمد بن حاتم، حدثنا بهز بن أسد، حدثنا حماد بن سلمة، أخبرنا أنس بن سيرين، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم قنت شهرا بعد الركوع في صلاة الفجر يدعو على بني عصية ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 381
			}
		},
		{
			"hadithnumber": 1549,
			"arabicnumber": "677.05",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، عن عاصم، عن أنس، قال سألته عن القنوت، قبل الركوع أو بعد الركوع فقال قبل الركوع ‏.‏ قال قلت فإن ناسا يزعمون أن رسول الله صلى الله عليه وسلم قنت بعد الركوع ‏.‏ فقال إنما قنت رسول الله صلى الله عليه وسلم شهرا يدعو على أناس قتلوا أناسا من أصحابه يقال لهم القراء ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 382
			}
		},
		{
			"hadithnumber": 1550,
			"arabicnumber": "677.06",
			"text": "حدثنا ابن أبي عمر، حدثنا سفيان، عن عاصم، قال سمعت أنسا، يقول ما رأيت رسول الله صلى الله عليه وسلم وجد على سرية ما وجد على السبعين الذين أصيبوا يوم بئر معونة كانوا يدعون القراء فمكث شهرا يدعو على قتلتهم ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 383
			}
		},
		{
			"hadithnumber": 1551,
			"arabicnumber": "677.07",
			"text": "وحدثنا أبو كريب، حدثنا حفص، وابن، فضيل ح وحدثنا ابن أبي عمر، حدثنا مروان، كلهم عن عاصم، عن أنس، عن النبي صلى الله عليه وسلم بهذا الحديث ‏.‏ يزيد بعضهم على بعض ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 384
			}
		},
		{
			"hadithnumber": 1552,
			"arabicnumber": "677.08",
			"text": "وحدثنا عمرو الناقد، حدثنا الأسود بن عامر، أخبرنا شعبة، عن قتادة، عن أنس بن مالك، أن النبي صلى الله عليه وسلم قنت شهرا يلعن رعلا وذكوان وعصية عصوا الله ورسوله ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 385
			}
		},
		{
			"hadithnumber": 1553,
			"arabicnumber": "677.09",
			"text": "وحدثنا عمرو الناقد، حدثنا الأسود بن عامر، أخبرنا شعبة، عن موسى بن أنس، عن أنس، عن النبي صلى الله عليه وسلم بنحوه ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 386
			}
		},
		{
			"hadithnumber": 1554,
			"arabicnumber": "677.10",
			"text": "حدثنا محمد بن المثنى، حدثنا عبد الرحمن، حدثنا هشام، عن قتادة، عن أنس، أن رسول الله صلى الله عليه وسلم قنت شهرا يدعو على أحياء من أحياء العرب ثم تركه ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 387
			}
		},
		{
			"hadithnumber": 1555,
			"arabicnumber": "678.01",
			"text": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن عمرو بن مرة، قال سمعت ابن أبي ليلى، قال حدثنا البراء بن عازب، أن رسول الله صلى الله عليه وسلم كان يقنت في الصبح والمغرب ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 388
			}
		},
		{
			"hadithnumber": 1556,
			"arabicnumber": "678.02",
			"text": "وحدثنا ابن نمير، حدثنا أبي، حدثنا سفيان، عن عمرو بن مرة، عن عبد الرحمن بن أبي ليلى، عن البراء، قال قنت رسول الله صلى الله عليه وسلم في الفجر والمغرب ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 389
			}
		},
		{
			"hadithnumber": 1557,
			"arabicnumber": "679.01",
			"text": "حدثني أبو الطاهر، أحمد بن عمرو بن سرح المصري قال حدثنا ابن وهب، عن الليث، عن عمران بن أبي أنس، عن حنظلة بن علي، عن خفاف بن إيماء الغفاري، قال قال رسول الله صلى الله عليه وسلم في صلاة ‏ \"‏ اللهم العن بني لحيان ورعلا وذكوان وعصية عصوا الله ورسوله غفار غفر الله لها وأسلم سالمها الله ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 390
			}
		},
		{
			"hadithnumber": 1558,
			"arabicnumber": "679.02",
			"text": "وحدثنا يحيى بن أيوب، وقتيبة، وابن، حجر قال ابن أيوب حدثنا إسماعيل، قال أخبرني محمد، - وهو ابن عمرو - عن خالد بن عبد الله بن حرملة، عن الحارث بن خفاف، أنه قال قال خفاف بن إيماء ركع رسول الله صلى الله عليه وسلم ثم رفع رأسه فقال ‏ \"‏ غفار غفر الله لها وأسلم سالمها الله وعصية عصت الله ورسوله اللهم العن بني لحيان والعن رعلا وذكوان ‏\"‏ ‏.‏ ثم وقع ساجدا ‏.‏ قال خفاف فجعلت لعنة الكفرة من أجل ذلك ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 391
			}
		},
		{
			"hadithnumber": 1559,
			"arabicnumber": "679.03",
			"text": "حدثنا يحيى بن أيوب، حدثنا إسماعيل، قال وأخبرنيه عبد الرحمن بن حرملة، عن حنظلة بن علي بن الأسقع، عن خفاف بن إيماء، ‏.‏ بمثله إلا أنه لم يقل فجعلت لعنة الكفرة من أجل ذلك ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 392
			}
		},
		{
			"hadithnumber": 1560,
			"arabicnumber": "680.01",
			"text": "حدثني حرملة بن يحيى التجيبي، أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، عن سعيد بن المسيب، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم حين قفل من غزوة خيبر سار ليله حتى إذا أدركه الكرى عرس وقال لبلال ‏\"‏ اكلأ لنا الليل ‏\"‏ ‏.‏ فصلى بلال ما قدر له ونام رسول الله صلى الله عليه وسلم وأصحابه فلما تقارب الفجر استند بلال إلى راحلته مواجه الفجر فغلبت بلالا عيناه وهو مستند إلى راحلته فلم يستيقظ رسول الله صلى الله عليه وسلم ولا بلال ولا أحد من أصحابه حتى ضربتهم الشمس فكان رسول الله صلى الله عليه وسلم أولهم استيقاظا ففزع رسول الله صلى الله عليه وسلم فقال ‏\"‏ أى بلال ‏\"‏ ‏.‏ فقال بلال أخذ بنفسي الذي أخذ - بأبي أنت وأمي يا رسول الله - بنفسك قال ‏\"‏ اقتادوا ‏\"‏ ‏.‏ فاقتادوا رواحلهم شيئا ثم توضأ رسول الله صلى الله عليه وسلم وأمر بلالا فأقام الصلاة فصلى بهم الصبح فلما قضى الصلاة قال ‏\"‏ من نسي الصلاة فليصلها إذا ذكرها فإن الله قال ‏{‏ أقم الصلاة لذكري‏}‏ ‏\"‏ ‏.‏ قال يونس وكان ابن شهاب يقرؤها للذكرى ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 393
			}
		},
		{
			"hadithnumber": 1561,
			"arabicnumber": "680.02",
			"text": "وحدثني محمد بن حاتم، ويعقوب بن إبراهيم الدورقي، كلاهما عن يحيى، - قال ابن حاتم حدثنا يحيى بن سعيد، - حدثنا يزيد بن كيسان، حدثنا أبو حازم، عن أبي هريرة، قال عرسنا مع نبي الله صلى الله عليه وسلم فلم نستيقظ حتى طلعت الشمس فقال النبي صلى الله عليه وسلم ‏ \"‏ ليأخذ كل رجل برأس راحلته فإن هذا منزل حضرنا فيه الشيطان ‏\"‏ ‏.‏ قال ففعلنا ثم دعا بالماء فتوضأ ثم سجد سجدتين - وقال يعقوب ثم صلى سجدتين - ثم أقيمت الصلاة فصلى الغداة ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 394
			}
		},
		{
			"hadithnumber": 1562,
			"arabicnumber": "681",
			"text": "وحدثنا شيبان بن فروخ، حدثنا سليمان، - يعني ابن المغيرة - حدثنا ثابت، عن عبد الله بن رباح، عن أبي قتادة، قال خطبنا رسول الله صلى الله عليه وسلم فقال ‏\"‏ إنكم تسيرون عشيتكم وليلتكم وتأتون الماء إن شاء الله غدا ‏\"‏ ‏.‏ فانطلق الناس لا يلوي أحد على أحد - قال أبو قتادة - فبينما رسول الله صلى الله عليه وسلم يسير حتى ابهار الليل وأنا إلى جنبه - قال - فنعس رسول الله صلى الله عليه وسلم فمال عن راحلته فأتيته فدعمته من غير أن أوقظه حتى اعتدل على راحلته - قال - ثم سار حتى تهور الليل مال عن راحلته - قال - فدعمته من غير أن أوقظه حتى اعتدل على راحلته - قال - ثم سار حتى إذا كان من آخر السحر مال ميلة هي أشد من الميلتين الأوليين حتى كاد ينجفل فأتيته فدعمته فرفع رأسه فقال ‏\"‏ من هذا ‏\"‏ ‏.‏ قلت أبو قتادة ‏.‏ قال ‏\"‏ متى كان هذا مسيرك مني ‏\"‏ ‏.‏ قلت ما زال هذا مسيري منذ الليلة ‏.‏ قال ‏\"‏ حفظك الله بما حفظت به نبيه ‏\"‏ ‏.‏ ثم قال ‏\"‏ هل ترانا نخفى على الناس ‏\"‏ ‏.‏ ثم قال ‏\"‏ هل ترى من أحد ‏\"‏ ‏.‏ قلت هذا راكب ‏.‏ ثم قلت هذا راكب آخر ‏.‏ حتى اجتمعنا فكنا سبعة ركب - قال - فمال رسول الله صلى الله عليه وسلم عن الطريق فوضع رأسه ثم قال ‏\"‏ احفظوا علينا صلاتنا ‏\"‏ ‏.‏ فكان أول من استيقظ رسول الله صلى الله عليه وسلم والشمس في ظهره - قال - فقمنا فزعين ثم قال ‏\"‏ اركبوا ‏\"‏ ‏.‏ فركبنا فسرنا حتى إذا ارتفعت الشمس نزل ثم دعا بميضأة كانت معي فيها شىء من ماء - قال - فتوضأ منها وضوءا دون وضوء - قال - وبقي فيها شىء من ماء ثم قال لأبي قتادة ‏\"‏ احفظ علينا ميضأتك فسيكون لها نبأ ‏\"‏ ‏.‏ ثم أذن بلال بالصلاة فصلى رسول الله صلى الله عليه وسلم ركعتين ثم صلى الغداة فصنع كما كان يصنع كل يوم - قال - وركب رسول الله صلى الله عليه وسلم وركبنا معه - قال - فجعل بعضنا يهمس إلى بعض ما كفارة ما صنعنا بتفريطنا في صلاتنا ثم قال ‏\"‏ أما لكم في أسوة ‏\"‏ ‏.‏ ثم قال ‏\"‏ أما إنه ليس في النوم تفريط إنما التفريط على من لم يصل الصلاة حتى يجيء وقت الصلاة الأخرى فمن فعل ذلك فليصلها حين ينتبه لها فإذا كان الغد فليصلها عند وقتها ‏\"‏ ‏.‏ ثم قال ‏\"‏ ما ترون الناس صنعوا ‏\"‏ ‏.‏ قال ثم قال ‏\"‏ أصبح الناس فقدوا نبيهم فقال أبو بكر وعمر رسول الله صلى الله عليه وسلم بعدكم لم يكن ليخلفكم ‏.‏ وقال الناس إن رسول الله صلى الله عليه وسلم بين أيديكم فإن يطيعوا أبا بكر وعمر يرشدوا ‏\"‏ ‏.‏ قال فانتهينا إلى الناس حين امتد النهار وحمي كل شىء وهم يقولون يا رسول الله هلكنا عطشنا ‏.‏ فقال ‏\"‏ لا هلك عليكم ‏\"‏ ‏.‏ ثم قال ‏\"‏ أطلقوا لي غمري ‏\"‏ ‏.‏ قال ودعا بالميضأة فجعل رسول الله صلى الله عليه وسلم يصب وأبو قتادة يسقيهم فلم يعد أن رأى الناس ماء في الميضأة تكابوا عليها ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أحسنوا الملأ كلكم سيروى ‏\"‏ ‏.‏ قال ففعلوا فجعل رسول الله صلى الله عليه وسلم يصب وأسقيهم حتى ما بقي غيري وغير رسول الله صلى الله عليه وسلم - قال - ثم صب رسول الله صلى الله عليه وسلم فقال لي ‏\"‏ اشرب ‏\"‏ ‏.‏ فقلت لا أشرب حتى تشرب يا رسول الله قال ‏\"‏ إن ساقي القوم آخرهم شربا ‏\"‏ ‏.‏ قال فشربت وشرب رسول الله صلى الله عليه وسلم - قال - فأتى الناس الماء جامين رواء ‏.‏ قال فقال عبد الله بن رباح إني لأحدث هذا الحديث في مسجد الجامع إذ قال عمران بن حصين انظر أيها الفتى كيف تحدث فإني أحد الركب تلك الليلة ‏.‏ قال قلت فأنت أعلم بالحديث ‏.‏ فقال ممن أنت قلت من الأنصار ‏.‏ قال حدث فأنتم أعلم بحديثكم ‏.‏ قال فحدثت القوم فقال عمران لقد شهدت تلك الليلة وما شعرت أن أحدا حفظه كما حفظته ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 395
			}
		},
		{
			"hadithnumber": 1563,
			"arabicnumber": "682.01",
			"text": "وحدثني أحمد بن سعيد بن صخر الدارمي، حدثنا عبيد الله بن عبد المجيد، حدثنا سلم بن زرير العطاردي، قال سمعت أبا رجاء العطاردي، عن عمران بن حصين، قال كنت مع نبي الله صلى الله عليه وسلم في مسير له فأدلجنا ليلتنا حتى إذا كان في وجه الصبح عرسنا فغلبتنا أعيننا حتى بزغت الشمس - قال - فكان أول من استيقظ منا أبو بكر وكنا لا نوقظ نبي الله صلى الله عليه وسلم من منامه إذا نام حتى يستيقظ ثم استيقظ عمر فقام عند نبي الله صلى الله عليه وسلم فجعل يكبر ويرفع صوته بالتكبير حتى استيقظ رسول الله صلى الله عليه وسلم فلما رفع رأسه ورأى الشمس قد بزغت قال ‏\"‏ ارتحلوا ‏\"‏ ‏.‏ فسار بنا حتى إذا ابيضت الشمس نزل فصلى بنا الغداة فاعتزل رجل من القوم لم يصل معنا فلما انصرف قال له رسول الله صلى الله عليه وسلم ‏\"‏ يا فلان ما منعك أن تصلي معنا ‏\"‏ ‏.‏ قال يا نبي الله أصابتني جنابة ‏.‏ فأمره رسول الله صلى الله عليه وسلم فتيمم بالصعيد فصلى ثم عجلني في ركب بين يديه نطلب الماء وقد عطشنا عطشا شديدا ‏.‏ فبينما نحن نسير إذا نحن بامرأة سادلة رجليها بين مزادتين فقلنا لها أين الماء قالت أيهاه أيهاه لا ماء لكم ‏.‏ قلنا فكم بين أهلك وبين الماء ‏.‏ قالت مسيرة يوم وليلة ‏.‏ قلنا انطلقي إلى رسول الله صلى الله عليه وسلم ‏.‏ قالت وما رسول الله فلم نملكها من أمرها شيئا حتى انطلقنا بها فاستقبلنا بها رسول الله صلى الله عليه وسلم فسألها فأخبرته مثل الذي أخبرتنا وأخبرته أنها موتمة لها صبيان أيتام فأمر براويتها فأنيخت فمج في العزلاوين العلياوين ثم بعث براويتها فشربنا ونحن أربعون رجلا عطاش حتى روينا وملأنا كل قربة معنا وإداوة وغسلنا صاحبنا غير أنا لم نسق بعيرا وهي تكاد تنضرج من الماء - يعني المزادتين - ثم قال ‏\"‏ هاتوا ما كان عندكم ‏\"‏ ‏.‏ فجمعنا لها من كسر وتمر وصر لها صرة فقال لها ‏\"‏ اذهبي فأطعمي هذا عيالك واعلمي أنا لم نرزأ من مائك ‏\"‏ ‏.‏ فلما أتت أهلها قالت لقد لقيت أسحر البشر أو إنه لنبي كما زعم كان من أمره ذيت وذيت ‏.‏ فهدى الله ذاك الصرم بتلك المرأة فأسلمت وأسلموا ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 396
			}
		},
		{
			"hadithnumber": 1564,
			"arabicnumber": "682.02",
			"text": "حدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا النضر بن شميل، حدثنا عوف بن أبي جميلة الأعرابي، عن أبي رجاء العطاردي، عن عمران بن الحصين، قال كنا مع رسول الله صلى الله عليه وسلم في سفر فسرينا ليلة حتى إذا كان من آخر الليل قبيل الصبح وقعنا تلك الوقعة التي لا وقعة عند المسافر أحلى منها فما أيقظنا إلا حر الشمس ‏.‏ وساق الحديث بنحو حديث سلم بن زرير وزاد ونقص ‏.‏ وقال في الحديث فلما استيقظ عمر بن الخطاب ورأى ما أصاب الناس وكان أجوف جليدا فكبر ورفع صوته بالتكبير حتى استيقظ رسول الله صلى الله عليه وسلم لشدة صوته بالتكبير فلما استيقظ رسول الله صلى الله عليه وسلم شكوا إليه الذي أصابهم فقال رسول الله صلى الله عليه وسلم ‏ \"‏ لا ضير ارتحلوا ‏\"‏ ‏.‏ واقتص الحديث ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 397
			}
		},
		{
			"hadithnumber": 1565,
			"arabicnumber": "683",
			"text": "حدثنا إسحاق بن إبراهيم، أخبرنا سليمان بن حرب، حدثنا حماد بن سلمة، عن حميد، عن بكر بن عبد الله، عن عبد الله بن رباح، عن أبي قتادة، قال كان رسول الله صلى الله عليه وسلم إذا كان في سفر فعرس بليل اضطجع على يمينه وإذا عرس قبيل الصبح نصب ذراعه ووضع رأسه على كفه ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 398
			}
		},
		{
			"hadithnumber": 1566,
			"arabicnumber": "684.01",
			"text": "حدثنا هداب بن خالد، حدثنا همام، حدثنا قتادة، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من نسي صلاة فليصلها إذا ذكرها لا كفارة لها إلا ذلك ‏\"‏ ‏.‏ قال قتادة وأقم الصلاة لذكري ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 399
			}
		},
		{
			"hadithnumber": 1567,
			"arabicnumber": "684.02",
			"text": "وحدثناه يحيى بن يحيى، وسعيد بن منصور، وقتيبة بن سعيد، جميعا عن أبي عوانة، عن قتادة، عن أنس، عن النبي صلى الله عليه وسلم ولم يذكر ‏ \"‏ لا كفارة لها إلا ذلك ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 400
			}
		},
		{
			"hadithnumber": 1568,
			"arabicnumber": "684.03",
			"text": "وحدثنا محمد بن المثنى، حدثنا عبد الأعلى، حدثنا سعيد، عن قتادة، عن أنس بن مالك، قال قال نبي الله صلى الله عليه وسلم ‏ \"‏ من نسي صلاة أو نام عنها فكفارتها أن يصليها إذا ذكرها ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 401
			}
		},
		{
			"hadithnumber": 1569,
			"arabicnumber": "684.04",
			"text": "وحدثنا نصر بن علي الجهضمي، حدثني أبي، حدثنا المثنى، عن قتادة، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا رقد أحدكم عن الصلاة أو غفل عنها فليصلها إذا ذكرها فإن الله يقول أقم الصلاة لذكري ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 402
			}
		}
	]
}