{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"53": "The Book of Paradise, its Description, its Bounties and its Inhabitants"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7130,
			"arabicnumber": "2822",
			"text": "حدثنا عبد الله بن مسلمة بن قعنب، حدثنا حماد بن سلمة، عن ثابت، وحميد، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ حفت الجنة بالمكاره وحفت النار بالشهوات ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 7131,
			"arabicnumber": "2823",
			"text": "وحدثني زهير بن حرب، حدثنا شبابة، حدثني ورقاء، عن أبي الزناد، عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 7132,
			"arabicnumber": "2824.01",
			"text": "حدثنا سعيد بن عمرو الأشعثي، وزهير بن حرب، قال زهير حدثنا وقال، سعيد أخبرنا سفيان، عن أبي الزناد، عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ قال الله عز وجل أعددت لعبادي الصالحين ما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر ‏\"‏ ‏.‏ مصداق ذلك في كتاب الله ‏{‏ فلا تعلم نفس ما أخفي لهم من قرة أعين جزاء بما كانوا يعملون‏}‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 7133,
			"arabicnumber": "2824.02",
			"text": "حدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، حدثنا مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏ \"‏ قال الله عز وجل أعددت لعبادي الصالحين ما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر ذخرا بله ما أطلعكم الله عليه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 7134,
			"arabicnumber": "2824.03",
			"text": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، ح وحدثنا ابن، نمير - واللفظ له - حدثنا أبي، حدثنا الأعمش، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يقول الله عز وجل أعددت لعبادي الصالحين ما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر ‏.‏ ذخرا بله ما أطلعكم الله عليه ‏\"‏ ‏.‏ ثم قرأ ‏{‏ فلا تعلم نفس ما أخفي لهم من قرة أعين‏}‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 7135,
			"arabicnumber": "2825",
			"text": "حدثنا هارون بن معروف، وهارون بن سعيد الأيلي، قالا حدثنا ابن وهب، حدثني أبو صخر، أن أبا حازم، حدثه قال سمعت سهل بن سعد الساعدي، يقول شهدت من رسول الله صلى الله عليه وسلم مجلسا وصف فيه الجنة حتى انتهى ثم قال صلى الله عليه وسلم في آخر حديثه ‏\"‏ فيها ما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر ‏\"‏ ‏.‏ ثم اقترأ هذه الآية ‏{‏ تتجافى جنوبهم عن المضاجع يدعون ربهم خوفا وطمعا ومما رزقناهم ينفقون * فلا تعلم نفس ما أخفي لهم من قرة أعين جزاء بما كانوا يعملون‏}‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 7136,
			"arabicnumber": "2826.01",
			"text": "حدثنا قتيبة بن سعيد، حدثنا ليث، عن سعيد بن أبي سعيد المقبري، عن أبيه، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم أنه قال ‏ \"‏ إن في الجنة لشجرة يسير الراكب في ظلها مائة سنة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 7137,
			"arabicnumber": "2826.02",
			"text": "حدثنا قتيبة بن سعيد، حدثنا المغيرة، - يعني ابن عبد الرحمن الحزامي - عن أبي الزناد، عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم بمثله وزاد ‏ \"‏ لا يقطعها ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 7139,
			"arabicnumber": "2828",
			"text": "",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 7140,
			"arabicnumber": "2829",
			"text": "حدثنا محمد بن عبد الرحمن بن سهم، حدثنا عبد الله بن المبارك، أخبرنا مالك، بن أنس ح وحدثني هارون بن سعيد الأيلي، - واللفظ له - حدثنا عبد الله بن وهب، حدثني مالك بن أنس، عن زيد بن أسلم، عن عطاء بن يسار، عن أبي سعيد الخدري، أن النبي صلى الله عليه وسلم قال ‏ \"‏ إن الله يقول لأهل الجنة يا أهل الجنة ‏.‏ فيقولون لبيك ربنا وسعديك والخير في يديك ‏.‏ فيقول هل رضيتم فيقولون وما لنا لا نرضى يا رب وقد أعطيتنا ما لم تعط أحدا من خلقك فيقول ألا أعطيكم أفضل من ذلك فيقولون يا رب وأى شىء أفضل من ذلك فيقول أحل عليكم رضواني فلا أسخط عليكم بعده أبدا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 7142,
			"arabicnumber": "2831.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 7143,
			"arabicnumber": "2831.02",
			"text": "حدثني عبد الله بن جعفر بن يحيى بن خالد، حدثنا معن، حدثنا مالك، ح وحدثني هارون بن سعيد الأيلي، - واللفظ له - حدثنا عبد الله بن وهب، أخبرني مالك بن أنس، عن صفوان بن سليم، عن عطاء بن يسار، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن أهل الجنة ليتراءون أهل الغرف من فوقهم كما تتراءون الكوكب الدري الغابر من الأفق من المشرق أو المغرب لتفاضل ما بينهم ‏\"‏ ‏.‏ قالوا يا رسول الله تلك منازل الأنبياء لا يبلغها غيرهم ‏.‏ قال ‏\"‏ بلى والذي نفسي بيده رجال آمنوا بالله وصدقوا المرسلين ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 7145,
			"arabicnumber": "2832",
			"text": "حدثنا قتيبة بن سعيد، حدثنا يعقوب، - يعني ابن عبد الرحمن - عن سهيل، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من أشد أمتي لي حبا ناس يكونون بعدي يود أحدهم لو رآني بأهله وماله ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 7146,
			"arabicnumber": "2833",
			"text": "حدثنا أبو عثمان، سعيد بن عبد الجبار البصري حدثنا حماد بن سلمة، عن ثابت، البناني عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إن في الجنة لسوقا يأتونها كل جمعة فتهب ريح الشمال فتحثو في وجوههم وثيابهم فيزدادون حسنا وجمالا فيرجعون إلى أهليهم وقد ازدادوا حسنا وجمالا فيقول لهم أهلوهم والله لقد ازددتم بعدنا حسنا وجمالا ‏.‏ فيقولون وأنتم والله لقد ازددتم بعدنا حسنا وجمالا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 7147,
			"arabicnumber": "2834.01",
			"text": "حدثني عمرو الناقد، ويعقوب بن إبراهيم الدورقي، جميعا عن ابن علية، - واللفظ ليعقوب - قالا حدثنا إسماعيل ابن علية، أخبرنا أيوب، عن محمد، قال إما تفاخروا وإما تذاكروا الرجال في الجنة أكثر أم النساء فقال أبو هريرة أولم يقل أبو القاسم صلى الله عليه وسلم ‏ \"‏ إن أول زمرة تدخل الجنة على صورة القمر ليلة البدر والتي تليها على أضوإ كوكب دري في السماء لكل امرئ منهم زوجتان اثنتان يرى مخ سوقهما من وراء اللحم وما في الجنة أعزب ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 7148,
			"arabicnumber": "2834.02",
			"text": "حدثنا ابن أبي عمر، حدثنا سفيان، عن أيوب، عن ابن سيرين، قال اختصم الرجال والنساء أيهم في الجنة أكثر فسألوا أبا هريرة فقال قال أبو القاسم صلى الله عليه وسلم بمثل حديث ابن علية ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 7149,
			"arabicnumber": "2834.03",
			"text": "وحدثنا قتيبة بن سعيد، حدثنا عبد الواحد، - يعني ابن زياد - عن عمارة بن، القعقاع حدثنا أبو زرعة، قال سمعت أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ أول من يدخل الجنة ‏\"‏ ‏.‏ ح وحدثنا قتيبة بن سعيد، وزهير بن حرب، - واللفظ لقتيبة - قالا حدثنا جرير، عن عمارة، عن أبي زرعة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن أول زمرة يدخلون الجنة على صورة القمر ليلة البدر والذين يلونهم على أشد كوكب دري في السماء إضاءة لا يبولون ولا يتغوطون ولا يمتخطون ولا يتفلون أمشاطهم الذهب ورشحهم المسك ومجامرهم الألوة وأزواجهم الحور العين أخلاقهم على خلق رجل واحد على صورة أبيهم آدم ستون ذراعا في السماء ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 7150,
			"arabicnumber": "2834.04",
			"text": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، عن الأعمش، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ أول زمرة تدخل الجنة من أمتي على صورة القمر ليلة البدر ثم الذين يلونهم على أشد نجم في السماء إضاءة ثم هم بعد ذلك منازل لا يتغوطون ولا يبولون ولا يمتخطون ولا يبزقون أمشاطهم الذهب ومجامرهم الألوة ورشحهم المسك أخلاقهم على خلق رجل واحد على طول أبيهم آدم ستون ذراعا ‏\"‏ ‏.‏ قال ابن أبي شيبة على خلق رجل ‏.‏ وقال أبو كريب على خلق رجل ‏.‏ وقال ابن أبي شيبة على صورة أبيهم ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 7151,
			"arabicnumber": "2834.05",
			"text": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏ \"‏ أول زمرة تلج الجنة صورهم على صورة القمر ليلة البدر لا يبصقون فيها ولا يمتخطون ولا يتغوطون فيها آنيتهم وأمشاطهم من الذهب والفضة ومجامرهم من الألوة ورشحهم المسك ولكل واحد منهم زوجتان يرى مخ ساقهما من وراء اللحم من الحسن لا اختلاف بينهم ولا تباغض قلوبهم قلب واحد يسبحون الله بكرة وعشيا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 7152,
			"arabicnumber": "2835.01",
			"text": "حدثنا عثمان بن أبي شيبة، وإسحاق بن إبراهيم، - واللفظ لعثمان - قال عثمان حدثنا وقال، إسحاق أخبرنا جرير، عن الأعمش، عن أبي سفيان، عن جابر، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ إن أهل الجنة يأكلون فيها ويشربون ولا يتفلون ولا يبولون ولا يتغوطون ولا يمتخطون ‏\"‏ ‏.‏ قالوا فما بال الطعام قال ‏\"‏ جشاء ورشح كرشح المسك يلهمون التسبيح والتحميد كما يلهمون النفس ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 7153,
			"arabicnumber": "2835.02",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، عن الأعمش، بهذا الإسناد إلى قوله ‏ \"‏ كرشح المسك ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 7154,
			"arabicnumber": "2835.03",
			"text": "وحدثني الحسن بن علي الحلواني، وحجاج بن الشاعر، كلاهما عن أبي عاصم، - قال حسن حدثنا أبو عاصم، - عن ابن جريج، أخبرني أبو الزبير، أنه سمع جابر بن، عبد الله يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ يأكل أهل الجنة فيها ويشربون ولا يتغوطون ولا يمتخطون ولا يبولون ولكن طعامهم ذاك جشاء كرشح المسك يلهمون التسبيح والحمد كما يلهمون النفس ‏\"‏ ‏.‏ قال وفي حديث حجاج ‏\"‏ طعامهم ذلك ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 7155,
			"arabicnumber": "2835.04",
			"text": "وحدثني سعيد بن يحيى الأموي، حدثني أبي، حدثنا ابن جريج، أخبرني أبو الزبير، عن جابر، عن النبي صلى الله عليه وسلم ‏.‏ بمثله غير أنه قال ‏ \"‏ ويلهمون التسبيح والتكبير كما يلهمون النفس ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 7156,
			"arabicnumber": "2836",
			"text": "حدثني زهير بن حرب، حدثنا عبد الرحمن بن مهدي، حدثنا حماد بن سلمة، عن ثابت، عن أبي رافع، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ من يدخل الجنة ينعم لا يبأس لا تبلى ثيابه ولا يفنى شبابه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 7157,
			"arabicnumber": "2837",
			"text": "حدثنا إسحاق بن إبراهيم، وعبد بن حميد، - واللفظ لإسحاق - قالا أخبرنا عبد الرزاق، قال قال الثوري فحدثني أبو إسحاق، أن الأغر، حدثه عن أبي سعيد الخدري، وأبي هريرة عن النبي صلى الله عليه وسلم قال ‏\"‏ ينادي مناد إن لكم أن تصحوا فلا تسقموا أبدا وإن لكم أن تحيوا فلا تموتوا أبدا وإن لكم أن تشبوا فلا تهرموا أبدا وإن لكم أن تنعموا فلا تبتئسوا أبدا ‏\"‏ ‏.‏ فذلك قوله عز وجل ‏{‏ ونودوا أن تلكم الجنة أورثتموها بما كنتم تعملون‏}‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 7158,
			"arabicnumber": "2838.01",
			"text": "حدثنا سعيد بن منصور، عن أبي قدامة، - وهو الحارث بن عبيد - عن أبي، عمران الجوني عن أبي بكر بن عبد الله بن قيس، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏ \"‏ إن للمؤمن في الجنة لخيمة من لؤلؤة واحدة مجوفة طولها ستون ميلا للمؤمن فيها أهلون يطوف عليهم المؤمن فلا يرى بعضهم بعضا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 7159,
			"arabicnumber": "2838.02",
			"text": "وحدثني أبو غسان المسمعي، حدثنا أبو عبد الصمد، حدثنا أبو عمران الجوني، عن أبي بكر بن عبد الله بن قيس، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ في الجنة خيمة من لؤلؤة مجوفة عرضها ستون ميلا في كل زاوية منها أهل ما يرون الآخرين يطوف عليهم المؤمن ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 7160,
			"arabicnumber": "2838.03",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، أخبرنا همام، عن أبي، عمران الجوني عن أبي بكر بن أبي موسى بن قيس، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏ \"‏ الخيمة درة طولها في السماء ستون ميلا في كل زاوية منها أهل للمؤمن لا يراهم الآخرون ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 7161,
			"arabicnumber": "2839",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، وعبد الله بن نمير، وعلي بن مسهر، عن عبيد الله بن عمر، ح وحدثنا محمد بن عبد الله بن نمير، حدثنا محمد بن بشر، حدثنا عبيد الله، عن خبيب بن عبد الرحمن، عن حفص بن عاصم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ سيحان وجيحان والفرات والنيل كل من أنهار الجنة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 7162,
			"arabicnumber": "2840",
			"text": "حدثنا حجاج بن الشاعر، حدثنا أبو النضر، هاشم بن القاسم الليثي حدثنا إبراهيم، - يعني ابن سعد - حدثنا أبي، عن أبي سلمة، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ يدخل الجنة أقوام أفئدتهم مثل أفئدة الطير ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 7163,
			"arabicnumber": "2841",
			"text": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، قال هذا ما حدثنا به أبو هريرة، عن رسول الله صلى الله عليه وسلم ‏.‏ فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏ \"‏ خلق الله عز وجل آدم على صورته طوله ستون ذراعا فلما خلقه قال اذهب فسلم على أولئك النفر وهم نفر من الملائكة جلوس فاستمع ما يجيبونك فإنها تحيتك وتحية ذريتك قال فذهب فقال السلام عليكم فقالوا السلام عليك ورحمة الله - قال - فزادوه ورحمة الله - قال - فكل من يدخل الجنة على صورة آدم وطوله ستون ذراعا فلم يزل الخلق ينقص بعده حتى الآن ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 7164,
			"arabicnumber": "2842",
			"text": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، عن العلاء بن خالد الكاهلي، عن شقيق، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ يؤتى بجهنم يومئذ لها سبعون ألف زمام مع كل زمام سبعون ألف ملك يجرونها ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 7165,
			"arabicnumber": "2843.01",
			"text": "حدثنا قتيبة بن سعيد، حدثنا المغيرة، - يعني ابن عبد الرحمن الحزامي - عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ ناركم هذه التي يوقد ابن آدم جزء من سبعين جزءا من حر جهنم ‏\"‏ ‏.‏ قالوا والله إن كانت لكافية يا رسول الله ‏.‏ قال ‏\"‏ فإنها فضلت عليها بتسعة وستين جزءا كلها مثل حرها ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 7166,
			"arabicnumber": "2843.02",
			"text": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، عن أبي هريرة، عن النبي صلى الله عليه وسلم بمثل حديث أبي الزناد غير أنه قال ‏ \"‏ كلهن مثل حرها ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 7167,
			"arabicnumber": "2844.01",
			"text": "حدثنا يحيى بن أيوب، حدثنا خلف بن خليفة، حدثنا يزيد بن كيسان، عن أبي، حازم عن أبي هريرة، قال كنا مع رسول الله صلى الله عليه وسلم إذ سمع وجبة فقال النبي صلى الله عليه وسلم ‏\"‏ تدرون ما هذا ‏\"‏ ‏.‏ قال قلنا الله ورسوله أعلم ‏.‏ قال ‏\"‏ هذا حجر رمي به في النار منذ سبعين خريفا فهو يهوي في النار الآن حتى انتهى إلى قعرها ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 7168,
			"arabicnumber": "2844.02",
			"text": "وحدثناه محمد بن عباد، وابن أبي عمر، قالا حدثنا مروان، عن يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، بهذا الإسناد وقال ‏ \"‏ هذا وقع في أسفلها فسمعتم وجبتها ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 7169,
			"arabicnumber": "2845.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا يونس بن محمد، حدثنا شيبان بن عبد الرحمن، قال قال قتادة سمعت أبا نضرة، يحدث عن سمرة، أنه سمع نبي الله صلى الله عليه وسلم يقول ‏ \"‏ إن منهم من تأخذه النار إلى كعبيه ومنهم من تأخذه إلى حجزته ومنهم من تأخذه إلى عنقه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 7170,
			"arabicnumber": "2845.02",
			"text": "حدثني عمرو بن زرارة، أخبرنا عبد الوهاب، - يعني ابن عطاء - عن سعيد، عن قتادة، قال سمعت أبا نضرة، يحدث عن سمرة بن جندب، أن النبي صلى الله عليه وسلم قال ‏ \"‏ منهم من تأخذه النار إلى كعبيه ومنهم من تأخذه النار إلى ركبتيه ومنهم من تأخذه النار إلى حجزته ومنهم من تأخذه النار إلى ترقوته ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 7171,
			"arabicnumber": "2845.03",
			"text": "حدثناه محمد بن المثنى، ومحمد بن بشار، قالا حدثنا روح، حدثنا سعيد، بهذا الإسناد وجعل مكان حجزته حقويه ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 7172,
			"arabicnumber": "2846.01",
			"text": "حدثنا ابن أبي عمر، حدثنا سفيان، عن أبي الزناد، عن الأعرج، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ احتجت النار والجنة فقالت هذه يدخلني الجبارون والمتكبرون ‏.‏ وقالت هذه يدخلني الضعفاء والمساكين فقال الله عز وجل لهذه أنت عذابي أعذب بك من أشاء - وربما قال أصيب بك من أشاء - وقال لهذه أنت رحمتي أرحم بك من أشاء ولكل واحدة منكما ملؤها ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 7173,
			"arabicnumber": "2846.02",
			"text": "وحدثني محمد بن رافع، حدثنا شبابة، حدثني ورقاء، عن أبي الزناد، عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ تحاجت النار والجنة فقالت النار أوثرت بالمتكبرين والمتجبرين ‏.‏ وقالت الجنة فما لي لا يدخلني إلا ضعفاء الناس وسقطهم وعجزهم ‏.‏ فقال الله للجنة أنت رحمتي أرحم بك من أشاء من عبادي ‏.‏ وقال للنار أنت عذابي أعذب بك من أشاء من عبادي ولكل واحدة منكم ملؤها فأما النار فلا تمتلئ ‏.‏ فيضع قدمه عليها فتقول قط قط ‏.‏ فهنالك تمتلئ ويزوى بعضها إلى بعض ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 7174,
			"arabicnumber": "2846.03",
			"text": "حدثنا عبد الله بن عون الهلالي، حدثنا أبو سفيان، - يعني محمد بن حميد - عن معمر، عن أيوب، عن ابن سيرين، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏ \"‏ احتجت الجنة والنار ‏\"‏ ‏.‏ واقتص الحديث بمعنى حديث أبي الزناد ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 7175,
			"arabicnumber": "2846.04",
			"text": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم ‏.‏ فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏ \"‏ تحاجت الجنة والنار فقالت النار أوثرت بالمتكبرين والمتجبرين ‏.‏ وقالت الجنة فما لي لا يدخلني إلا ضعفاء الناس وسقطهم وغرتهم قال الله للجنة إنما أنت رحمتي أرحم بك من أشاء من عبادي ‏.‏ وقال للنار إنما أنت عذابي أعذب بك من أشاء من عبادي ‏.‏ ولكل واحدة منكما ملؤها فأما النار فلا تمتلئ حتى يضع الله تبارك وتعالى رجله تقول قط قط قط ‏.‏ فهنالك تمتلئ ويزوى بعضها إلى بعض ولا يظلم الله من خلقه أحدا وأما الجنة فإن الله ينشئ لها خلقا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 7176,
			"arabicnumber": "2847",
			"text": "وحدثنا عثمان بن أبي شيبة، حدثنا جرير، عن الأعمش، عن أبي صالح، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ احتجت الجنة والنار ‏\"‏ ‏.‏ فذكر نحو حديث أبي هريرة إلى قوله ‏\"‏ ولكليكما على ملؤها ‏\"‏ ‏.‏ ولم يذكر ما بعده من الزيادة ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 7177,
			"arabicnumber": "2848.01",
			"text": "حدثنا عبد بن حميد، حدثنا يونس بن محمد، حدثنا شيبان، عن قتادة، حدثنا أنس بن مالك، أن نبي الله صلى الله عليه وسلم قال ‏ \"‏ لا تزال جهنم تقول هل من مزيد ‏.‏ حتى يضع فيها رب العزة تبارك وتعالى قدمه فتقول قط قط وعزتك ‏.‏ ويزوى بعضها إلى بعض ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 7178,
			"arabicnumber": "2848.02",
			"text": "وحدثني زهير بن حرب، حدثنا عبد الصمد بن عبد الوارث، حدثنا أبان بن يزيد، العطار حدثنا قتادة، عن أنس، عن النبي صلى الله عليه وسلم بمعنى حديث شيبان ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 7179,
			"arabicnumber": "2848.03",
			"text": "حدثنا محمد بن عبد الله الرزي، حدثنا عبد الوهاب بن عطاء، في قوله عز وجل ‏{‏ يوم نقول لجهنم هل امتلأت وتقول هل من مزيد‏}‏ فأخبرنا عن سعيد عن قتادة عن أنس بن مالك عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ لا تزال جهنم يلقى فيها وتقول هل من مزيد حتى يضع رب العزة فيها قدمه فينزوي بعضها إلى بعض وتقول قط قط بعزتك وكرمك ‏.‏ ولا يزال في الجنة فضل حتى ينشئ الله لها خلقا فيسكنهم فضل الجنة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 7180,
			"arabicnumber": "2848.04",
			"text": "حدثني زهير بن حرب، حدثنا عفان، حدثنا حماد، - يعني ابن سلمة - أخبرنا ثابت، قال سمعت أنسا، يقول عن النبي صلى الله عليه وسلم قال ‏ \"‏ يبقى من الجنة ما شاء الله أن يبقى ثم ينشئ الله تعالى لها خلقا مما يشاء ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 7181,
			"arabicnumber": "2849.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب - وتقاربا في اللفظ - قالا حدثنا أبو معاوية، عن الأعمش، عن أبي صالح، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يجاء بالموت يوم القيامة كأنه كبش أملح - زاد أبو كريب - فيوقف بين الجنة والنار - واتفقا في باقي الحديث - فيقال يا أهل الجنة هل تعرفون هذا فيشرئبون وينظرون ويقولون نعم هذا الموت - قال - ويقال يا أهل النار هل تعرفون هذا قال فيشرئبون وينظرون ويقولون نعم هذا الموت - قال - فيؤمر به فيذبح - قال - ثم يقال يا أهل الجنة خلود فلا موت ويا أهل النار خلود فلا موت ‏\"‏ ‏.‏ قال ثم قرأ رسول الله صلى الله عليه وسلم ‏{‏ وأنذرهم يوم الحسرة إذ قضي الأمر وهم في غفلة وهم لا يؤمنون‏}‏ وأشار بيده إلى الدنيا ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 7182,
			"arabicnumber": "2849.02",
			"text": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن الأعمش، عن أبي صالح، عن أبي، سعيد قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أدخل أهل الجنة الجنة وأهل النار النار قيل يا أهل الجنة ‏\"‏ ‏.‏ ثم ذكر بمعنى حديث أبي معاوية غير أنه قال ‏\"‏ فذلك قوله عز وجل ‏\"‏ ‏.‏ ولم يقل ثم قرأ رسول الله صلى الله عليه وسلم ‏.‏ ولم يذكر أيضا وأشار بيده إلى الدنيا ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 7183,
			"arabicnumber": "2850.01",
			"text": "حدثنا زهير بن حرب، والحسن بن علي الحلواني، وعبد بن حميد، قال عبد أخبرني وقال الآخران، حدثنا يعقوب، - وهو ابن إبراهيم بن سعد - حدثنا أبي، عن صالح، حدثنا نافع، أن عبد الله، قال إن رسول الله صلى الله عليه وسلم قال ‏ \"‏ يدخل الله أهل الجنة الجنة ويدخل أهل النار النار ثم يقوم مؤذن بينهم فيقول يا أهل الجنة لا موت ويا أهل النار لا موت كل خالد فيما هو فيه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 7184,
			"arabicnumber": "2850.02",
			"text": "حدثني هارون بن سعيد الأيلي، وحرملة بن يحيى، قالا حدثنا ابن وهب، حدثني عمر بن محمد بن زيد بن عبد الله بن عمر بن الخطاب، أن أباه، حدثه عن عبد الله بن، عمر أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إذا صار أهل الجنة إلى الجنة وصار أهل النار إلى النار أتي بالموت حتى يجعل بين الجنة والنار ثم يذبح ثم ينادي مناد يا أهل الجنة لا موت ويا أهل النار لا موت ‏.‏ فيزداد أهل الجنة فرحا إلى فرحهم ويزداد أهل النار حزنا إلى حزنهم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 7185,
			"arabicnumber": "2851",
			"text": "حدثني سريج بن يونس، حدثنا حميد بن عبد الرحمن، عن الحسن بن صالح، عن هارون بن سعد، عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ ضرس الكافر أو ناب الكافر مثل أحد وغلظ جلده مسيرة ثلاث ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 7186,
			"arabicnumber": "2852",
			"text": "حدثنا أبو كريب، وأحمد بن عمر الوكيعي، قالا حدثنا ابن فضيل، عن أبيه، عن أبي حازم، عن أبي هريرة، يرفعه قال ‏\"‏ ما بين منكبى الكافر في النار مسيرة ثلاثة أيام للراكب المسرع ‏\"‏ ‏.‏ ولم يذكر الوكيعي ‏\"‏ في النار ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 7187,
			"arabicnumber": "2853.01",
			"text": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، حدثني معبد بن خالد، أنه سمع حارثة بن وهب، أنه سمع النبي صلى الله عليه وسلم قال ‏\"‏ ألا أخبركم بأهل الجنة ‏\"‏ ‏.‏ قالوا بلى ‏.‏ قال صلى الله عليه وسلم ‏\"‏ كل ضعيف متضعف لو أقسم على الله لأبره ‏\"‏ ‏.‏ ثم قال ‏\"‏ ألا أخبركم بأهل النار ‏\"‏ ‏.‏ قالوا بلى ‏.‏ قال ‏\"‏ كل عتل جواظ مستكبر ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 7188,
			"arabicnumber": "2853.02",
			"text": "وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، بهذا الإسناد بمثله غير أنه قال ‏ \"‏ ألا أدلكم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 7189,
			"arabicnumber": "2853.03",
			"text": "وحدثنا محمد بن عبد الله بن نمير، حدثنا وكيع، حدثنا سفيان، عن معبد بن خالد، قال سمعت حارثة بن وهب الخزاعي، يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ ألا أخبركم بأهل الجنة كل ضعيف متضعف لو أقسم على الله لأبره ألا أخبركم بأهل النار كل جواظ زنيم متكبر ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 7190,
			"arabicnumber": "2854",
			"text": "حدثني سويد بن سعيد، حدثني حفص بن ميسرة، عن العلاء بن عبد الرحمن، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ رب أشعث مدفوع بالأبواب لو أقسم على الله لأبره ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 7191,
			"arabicnumber": "2855",
			"text": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا ابن نمير، عن هشام بن، عروة عن أبيه، عن عبد الله بن زمعة، قال خطب رسول الله صلى الله عليه وسلم فذكر الناقة وذكر الذي عقرها فقال ‏\"‏ إذ انبعث أشقاها انبعث بها رجل عزيز عارم منيع في رهطه مثل أبي زمعة ‏\"‏ ‏.‏ ثم ذكر النساء فوعظ فيهن ثم قال ‏\"‏ إلام يجلد أحدكم امرأته ‏\"‏ ‏.‏ في رواية أبي بكر ‏\"‏ جلد الأمة ‏\"‏ ‏.‏ وفي رواية أبي كريب ‏\"‏ جلد العبد ولعله يضاجعها من آخر يومه ‏\"‏ ‏.‏ ثم وعظهم في ضحكهم من الضرطة فقال ‏\"‏ إلام يضحك أحدكم مما يفعل ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 7192,
			"arabicnumber": "2856.01",
			"text": "حدثني زهير بن حرب، حدثنا جرير، عن سهيل، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ رأيت عمرو بن لحى بن قمعة بن خندف أبا بني كعب هؤلاء يجر قصبه في النار ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 7193,
			"arabicnumber": "2856.02",
			"text": "حدثني عمرو الناقد، وحسن الحلواني، وعبد بن حميد، قال عبد أخبرني وقال، الآخران حدثنا يعقوب، - وهو ابن إبراهيم بن سعد - حدثنا أبي، عن صالح، عن ابن، شهاب قال سمعت سعيد بن المسيب، يقول إن البحيرة التي يمنع درها للطواغيت فلا يحلبها أحد من الناس وأما السائبة التي كانوا يسيبونها لآلهتهم فلا يحمل عليها شىء ‏.‏ وقال ابن المسيب قال أبو هريرة قال رسول الله صلى الله عليه وسلم ‏ \"‏ رأيت عمرو بن عامر الخزاعي يجر قصبه في النار وكان أول من سيب السيوب ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 7194,
			"arabicnumber": "2128.02",
			"text": "حدثني زهير بن حرب، حدثنا جرير، عن سهيل، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ صنفان من أهل النار لم أرهما قوم معهم سياط كأذناب البقر يضربون بها الناس ونساء كاسيات عاريات مميلات مائلات رءوسهن كأسنمة البخت المائلة لا يدخلن الجنة ولا يجدن ريحها وإن ريحها لتوجد من مسيرة كذا وكذا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 7195,
			"arabicnumber": "2857.01",
			"text": "حدثنا ابن نمير، حدثنا زيد، - يعني ابن حباب - حدثنا أفلح بن سعيد، حدثنا عبد الله بن رافع، مولى أم سلمة قال سمعت أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ يوشك إن طالت بك مدة أن ترى قوما في أيديهم مثل أذناب البقر يغدون في غضب الله ويروحون في سخط الله ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 7196,
			"arabicnumber": "2857.02",
			"text": "حدثنا عبيد الله بن سعيد، وأبو بكر بن نافع وعبد بن حميد قالوا حدثنا أبو عامر العقدي حدثنا أفلح بن سعيد، حدثني عبد الله بن رافع، مولى أم سلمة قال سمعت أبا هريرة، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ إن طالت بك مدة أوشكت أن ترى قوما يغدون في سخط الله ويروحون في لعنته في أيديهم مثل أذناب البقر ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 7197,
			"arabicnumber": "2858",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن إدريس، ح وحدثنا ابن نمير، حدثنا أبي ومحمد بن بشر، ح وحدثنا يحيى بن يحيى، أخبرنا موسى بن أعين، ح وحدثني محمد بن رافع، حدثنا أبو أسامة، كلهم عن إسماعيل بن أبي خالد، ح وحدثني محمد بن، حاتم - واللفظ له - حدثنا يحيى بن سعيد، حدثنا إسماعيل، حدثنا قيس، قال سمعت مستوردا، أخا بني فهر يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ والله ما الدنيا في الآخرة إلا مثل ما يجعل أحدكم إصبعه هذه - وأشار يحيى بالسبابة - في اليم فلينظر بم يرجع ‏\"‏ ‏.‏ وفي حديثهم جميعا غير يحيى سمعت رسول الله صلى الله عليه وسلم يقول ذلك ‏.‏ وفي حديث أبي أسامة عن المستورد بن شداد أخي بني فهر وفي حديثه أيضا قال وأشار إسماعيل بالإبهام ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 7198,
			"arabicnumber": "2859.01",
			"text": "وحدثني زهير بن حرب، حدثنا يحيى بن سعيد، عن حاتم بن أبي صغيرة، حدثني ابن أبي مليكة، عن القاسم بن محمد، عن عائشة، قالت سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ يحشر الناس يوم القيامة حفاة عراة غرلا ‏\"‏ ‏.‏ قلت يا رسول الله النساء والرجال جميعا ينظر بعضهم إلى بعض قال صلى الله عليه وسلم ‏\"‏ يا عائشة الأمر أشد من أن ينظر بعضهم إلى بعض ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 7199,
			"arabicnumber": "2859.02",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وابن، نمير قالا حدثنا أبو خالد الأحمر، عن حاتم، بن أبي صغيرة بهذا الإسناد ولم يذكر في حديثه ‏ \"‏ غرلا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 7200,
			"arabicnumber": "2860.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، وإسحاق بن إبراهيم، وابن أبي، عمر قال إسحاق أخبرنا وقال الآخرون، حدثنا سفيان بن عيينة، عن عمرو، عن سعيد، بن جبير عن ابن عباس، سمع النبي صلى الله عليه وسلم يخطب وهو يقول ‏ \"‏ إنكم ملاقو الله مشاة حفاة عراة غرلا ‏\"‏ ‏.‏ ولم يذكر زهير في حديثه يخطب ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 7201,
			"arabicnumber": "2860.02",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، ح وحدثنا عبيد الله بن معاذ، حدثنا أبي كلاهما، عن شعبة، ح وحدثنا محمد بن المثنى، ومحمد بن بشار، - واللفظ لابن المثنى - قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن المغيرة بن النعمان، عن سعيد بن جبير، عن ابن عباس، قال قام فينا رسول الله صلى الله عليه وسلم خطيبا بموعظة فقال ‏\"‏ يا أيها الناس إنكم تحشرون إلى الله حفاة عراة غرلا ‏{‏ كما بدأنا أول خلق نعيده وعدا علينا إنا كنا فاعلين‏}‏ ألا وإن أول الخلائق يكسى يوم القيامة إبراهيم عليه السلام ألا وإنه سيجاء برجال من أمتي فيؤخذ بهم ذات الشمال فأقول يا رب أصحابي ‏.‏ فيقال إنك لا تدري ما أحدثوا بعدك ‏.‏ فأقول كما قال العبد الصالح ‏{‏ وكنت عليهم شهيدا ما دمت فيهم فلما توفيتني كنت أنت الرقيب عليهم وأنت على كل شىء شهيد * إن تعذبهم فإنهم عبادك وإن تغفر لهم فإنك أنت العزيز الحكيم‏}‏ قال فيقال لي إنهم لم يزالوا مرتدين على أعقابهم منذ فارقتهم ‏\"‏ ‏.‏ وفي حديث وكيع ومعاذ ‏\"‏ فيقال إنك لا تدري ما أحدثوا بعدك ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 7202,
			"arabicnumber": "2861",
			"text": "حدثني زهير بن حرب، حدثنا أحمد بن إسحاق، ح وحدثني محمد بن حاتم، حدثنا بهز، قالا جميعا حدثنا وهيب، حدثنا عبد الله بن طاوس، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ يحشر الناس على ثلاث طرائق راغبين راهبين واثنان على بعير وثلاثة على بعير وأربعة على بعير وعشرة على بعير وتحشر بقيتهم النار تبيت معهم حيث باتوا وتقيل معهم حيث قالوا وتصبح معهم حيث أصبحوا وتمسي معهم حيث أمسوا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 7203,
			"arabicnumber": "2862.01",
			"text": "حدثنا زهير بن حرب، ومحمد بن المثنى، وعبيد الله بن سعيد، قالوا حدثنا يحيى، - يعنون ابن سعيد - عن عبيد الله، أخبرني نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم ‏{‏ يوم يقوم الناس لرب العالمين‏}‏ قال ‏\"‏ يقوم أحدهم في رشحه إلى أنصاف أذنيه ‏\"‏ ‏.‏ وفي رواية ابن المثنى قال ‏\"‏ يقوم الناس ‏\"‏ ‏.‏ لم يذكر يوم ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 7204,
			"arabicnumber": "2862.02",
			"text": "حدثنا محمد بن إسحاق المسيبي، حدثنا أنس يعني ابن عياض، ح وحدثني سويد بن سعيد، حدثنا حفص بن ميسرة، كلاهما عن موسى بن عقبة، ح وحدثنا أبو بكر، بن أبي شيبة حدثنا أبو خالد الأحمر، وعيسى بن يونس، عن ابن عون، ح وحدثني عبد، الله بن جعفر بن يحيى حدثنا معن، حدثنا مالك، ح وحدثني أبو نصر التمار، حدثنا حماد، بن سلمة عن أيوب، ح وحدثنا الحلواني، وعبد بن حميد، عن يعقوب بن إبراهيم بن سعد، حدثنا أبي، عن صالح، كل هؤلاء عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم ‏.‏ بمعنى حديث عبيد الله عن نافع ‏.‏ غير أن في حديث موسى بن عقبة وصالح ‏ \"‏ حتى يغيب أحدهم في رشحه إلى أنصاف أذنيه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 7205,
			"arabicnumber": "2863",
			"text": "حدثنا قتيبة بن سعيد، حدثنا عبد العزيز، - يعني ابن محمد - عن ثور، عن أبي الغيث، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إن العرق يوم القيامة ليذهب في الأرض سبعين باعا وإنه ليبلغ إلى أفواه الناس أو إلى آذانهم ‏\"‏ ‏.‏ يشك ثور أيهما قال ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 7206,
			"arabicnumber": "2864",
			"text": "حدثنا الحكم بن موسى أبو صالح، حدثنا يحيى بن حمزة، عن عبد الرحمن بن، جابر حدثني سليم بن عامر، حدثني المقداد بن الأسود، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ تدنى الشمس يوم القيامة من الخلق حتى تكون منهم كمقدار ميل ‏\"‏ ‏.‏ قال سليم بن عامر فوالله ما أدري ما يعني بالميل أمسافة الأرض أم الميل الذي تكتحل به العين ‏.‏ قال ‏\"‏ فيكون الناس على قدر أعمالهم في العرق فمنهم من يكون إلى كعبيه ومنهم من يكون إلى ركبتيه ومنهم من يكون إلى حقويه ومنهم من يلجمه العرق إلجاما ‏\"‏ ‏.‏ قال وأشار رسول الله صلى الله عليه وسلم بيده إلى فيه ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 7207,
			"arabicnumber": "2865.01",
			"text": "حدثني أبو غسان المسمعي، ومحمد بن المثنى، ومحمد بن بشار بن عثمان، - واللفظ لأبي غسان وابن المثنى - قالا حدثنا معاذ بن هشام، حدثني أبي، عن قتادة، عن مطرف بن عبد الله بن الشخير، عن عياض بن حمار المجاشعي، أن رسول الله صلى الله عليه وسلم قال ذات يوم في خطبته ‏\"‏ ألا إن ربي أمرني أن أعلمكم ما جهلتم مما علمني يومي هذا كل مال نحلته عبدا حلال وإني خلقت عبادي حنفاء كلهم وإنهم أتتهم الشياطين فاجتالتهم عن دينهم وحرمت عليهم ما أحللت لهم وأمرتهم أن يشركوا بي ما لم أنزل به سلطانا وإن الله نظر إلى أهل الأرض فمقتهم عربهم وعجمهم إلا بقايا من أهل الكتاب وقال إنما بعثتك لأبتليك وأبتلي بك وأنزلت عليك كتابا لا يغسله الماء تقرؤه نائما ويقظان وإن الله أمرني أن أحرق قريشا فقلت رب إذا يثلغوا رأسي فيدعوه خبزة قال استخرجهم كما استخرجوك واغزهم نغزك وأنفق فسننفق عليك وابعث جيشا نبعث خمسة مثله وقاتل بمن أطاعك من عصاك ‏.‏ قال وأهل الجنة ثلاثة ذو سلطان مقسط متصدق موفق ورجل رحيم رقيق القلب لكل ذي قربى ومسلم وعفيف متعفف ذو عيال - قال - وأهل النار خمسة الضعيف الذي لا زبر له الذين هم فيكم تبعا لا يتبعون أهلا ولا مالا والخائن الذي لا يخفى له طمع وإن دق إلا خانه ورجل لا يصبح ولا يمسي إلا وهو يخادعك عن أهلك ومالك ‏\"‏ ‏.‏ وذكر البخل أو الكذب ‏\"‏ والشنظير الفحاش ‏\"‏ ‏.‏ ولم يذكر أبو غسان في حديثه ‏\"‏ وأنفق فسننفق عليك ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 7208,
			"arabicnumber": "2865.02",
			"text": "وحدثناه محمد بن المثنى العنزي، حدثنا محمد بن أبي عدي، عن سعيد، عن قتادة، بهذا الإسناد ‏.‏ ولم يذكر في حديثه ‏ \"‏ كل مال نحلته عبدا حلال ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 7209,
			"arabicnumber": "2865.03",
			"text": "حدثني عبد الرحمن بن بشر العبدي، حدثنا يحيى بن سعيد، عن هشام، - صاحب الدستوائي - حدثنا قتادة، عن مطرف، عن عياض بن حمار، أن رسول الله صلى الله عليه وسلم خطب ذات يوم ‏.‏ وساق الحديث وقال في آخره قال يحيى قال شعبة عن قتادة قال سمعت مطرفا في هذا الحديث ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 7210,
			"arabicnumber": "2865.04",
			"text": "وحدثني أبو عمار، حسين بن حريث حدثنا الفضل بن موسى، عن الحسين، عن مطر، حدثني قتادة، عن مطرف بن عبد الله بن الشخير، عن عياض بن حمار، أخي بني مجاشع قال قام فينا رسول الله صلى الله عليه وسلم ذات يوم خطيبا فقال ‏\"‏ إن الله أمرني ‏\"‏ ‏.‏ وساق الحديث بمثل حديث هشام عن قتادة وزاد فيه ‏\"‏ وإن الله أوحى إلى أن تواضعوا حتى لا يفخر أحد على أحد ولا يبغي أحد على أحد ‏\"‏ ‏.‏ وقال في حديثه ‏\"‏ وهم فيكم تبعا لا يبغون أهلا ولا مالا ‏\"‏ ‏.‏ فقلت فيكون ذلك يا أبا عبد الله قال نعم والله لقد أدركتهم في الجاهلية وإن الرجل ليرعى على الحى ما به إلا وليدتهم يطؤها ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 7211,
			"arabicnumber": "2866.01",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إن أحدكم إذا مات عرض عليه مقعده بالغداة والعشي إن كان من أهل الجنة فمن أهل الجنة وإن كان من أهل النار فمن أهل النار يقال هذا مقعدك حتى يبعثك الله إليه يوم القيامة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 7212,
			"arabicnumber": "2866.02",
			"text": "حدثنا عبد بن حميد، أخبرنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن سالم، عن ابن عمر، قال قال النبي صلى الله عليه وسلم ‏\"‏ إذا مات الرجل عرض عليه مقعده بالغداة والعشي إن كان من أهل الجنة فالجنة وإن كان من أهل النار فالنار ‏\"‏ ‏.‏ قال ‏\"‏ ثم يقال هذا مقعدك الذي تبعث إليه يوم القيامة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 7213,
			"arabicnumber": "2867",
			"text": "حدثنا يحيى بن أيوب، وأبو بكر بن أبي شيبة جميعا عن ابن علية، قال ابن أيوب حدثنا ابن علية، قال وأخبرنا سعيد الجريري، عن أبي نضرة، عن أبي سعيد الخدري، عن زيد بن ثابت، قال أبو سعيد ولم أشهده من النبي صلى الله عليه وسلم ولكن حدثنيه زيد بن ثابت قال بينما النبي صلى الله عليه وسلم في حائط لبني النجار على بغلة له ونحن معه إذ حادت به فكادت تلقيه وإذا أقبر ستة أو خمسة أو أربعة - قال كذا كان يقول الجريري - فقال ‏\"‏ من يعرف أصحاب هذه الأقبر ‏\"‏ ‏.‏ فقال رجل أنا ‏.‏ قال ‏\"‏ فمتى مات هؤلاء ‏\"‏ ‏.‏ قال ماتوا في الإشراك ‏.‏ فقال ‏\"‏ إن هذه الأمة تبتلى في قبورها فلولا أن لا تدافنوا لدعوت الله أن يسمعكم من عذاب القبر الذي أسمع منه ‏\"‏ ‏.‏ ثم أقبل علينا بوجهه فقال ‏\"‏ تعوذوا بالله من عذاب النار ‏\"‏ ‏.‏ قالوا نعوذ بالله من عذاب النار فقال ‏\"‏ تعوذوا بالله من عذاب القبر ‏\"‏ ‏.‏ قالوا نعوذ بالله من عذاب القبر ‏.‏ قال ‏\"‏ تعوذوا بالله من الفتن ما ظهر منها وما بطن ‏\"‏ ‏.‏ قالوا نعوذ بالله من الفتن ما ظهر منها وما بطن قال ‏\"‏ تعوذوا بالله من فتنة الدجال ‏\"‏ ‏.‏ قالوا نعوذ بالله من فتنة الدجال ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 7214,
			"arabicnumber": "2868",
			"text": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن قتادة، عن أنس، أن النبي صلى الله عليه وسلم قال ‏ \"‏ لولا أن لا تدافنوا لدعوت الله أن يسمعكم من عذاب القبر ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 7215,
			"arabicnumber": "2869",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، ح وحدثنا عبيد الله بن معاذ، حدثنا أبي ح، وحدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، كلهم عن شعبة، عن عون بن أبي جحيفة، ح وحدثني زهير بن حرب، ومحمد بن المثنى، وابن، بشار جميعا عن يحيى القطان، - واللفظ لزهير - حدثنا يحيى بن سعيد، حدثنا شعبة، حدثني عون، بن أبي جحيفة عن أبيه، عن البراء، عن أبي أيوب، قال خرج رسول الله صلى الله عليه وسلم بعد ما غربت الشمس فسمع صوتا فقال ‏ \"‏ يهود تعذب في قبورها ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 7216,
			"arabicnumber": "2870.01",
			"text": "حدثنا عبد بن حميد، حدثنا يونس بن محمد، حدثنا شيبان بن عبد الرحمن، عن قتادة، حدثنا أنس بن مالك، قال قال نبي الله صلى الله عليه وسلم ‏\"‏ إن العبد إذا وضع في قبره وتولى عنه أصحابه إنه ليسمع قرع نعالهم ‏\"‏ ‏.‏ قال ‏\"‏ يأتيه ملكان فيقعدانه فيقولان له ما كنت تقول في هذا الرجل ‏\"‏ ‏.‏ قال ‏\"‏ فأما المؤمن فيقول أشهد أنه عبد الله ورسوله ‏\"‏ ‏.‏ قال ‏\"‏ فيقال له انظر إلى مقعدك من النار قد أبدلك الله به مقعدا من الجنة ‏\"‏ ‏.‏ قال نبي الله صلى الله عليه وسلم ‏\"‏ فيراهما جميعا ‏\"‏ ‏.‏ قال قتادة وذكر لنا أنه يفسح له في قبره سبعون ذراعا ويملأ عليه خضرا إلى يوم يبعثون ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 7217,
			"arabicnumber": "2870.02",
			"text": "وحدثنا محمد بن منهال الضرير، حدثنا يزيد بن زريع، حدثنا سعيد بن أبي عروبة، عن قتادة، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن الميت إذا وضع في قبره إنه ليسمع خفق نعالهم إذا انصرفوا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 7218,
			"arabicnumber": "2870.03",
			"text": "حدثني عمرو بن زرارة، أخبرنا عبد الوهاب، - يعني ابن عطاء - عن سعيد، عن قتادة، عن أنس بن مالك، أن نبي الله صلى الله عليه وسلم قال ‏ \"‏ إن العبد إذا وضع في قبره وتولى عنه أصحابه ‏\"‏ ‏.‏ فذكر بمثل حديث شيبان عن قتادة ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 7219,
			"arabicnumber": "2871.01",
			"text": "حدثنا محمد بن بشار بن عثمان العبدي، حدثنا محمد بن جعفر، حدثنا شعبة، عن علقمة بن مرثد، عن سعد بن عبيدة، عن البراء بن عازب، عن النبي صلى الله عليه وسلم قال ‏\"‏ ‏{‏ يثبت الله الذين آمنوا بالقول الثابت‏}‏ قال ‏\"‏ نزلت في عذاب القبر فيقال له من ربك فيقول ربي الله ونبيي محمد صلى الله عليه وسلم ‏.‏ فذلك قوله عز وجل ‏{‏ يثبت الله الذين آمنوا بالقول الثابت في الحياة الدنيا وفي الآخرة‏}‏ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 7220,
			"arabicnumber": "2871.02",
			"text": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن المثنى، وأبو بكر بن نافع قالوا حدثنا عبد الرحمن، - يعنون ابن مهدي - عن سفيان، عن أبيه، عن خيثمة، عن البراء بن عازب، ‏{‏ يثبت الله الذين آمنوا بالقول الثابت في الحياة الدنيا وفي الآخرة‏}‏ قال نزلت في عذاب القبر ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 7221,
			"arabicnumber": "2872",
			"text": "حدثني عبيد الله بن عمر القواريري، حدثنا حماد بن زيد، حدثنا بديل، عن عبد، الله بن شقيق عن أبي هريرة، قال ‏\"‏ إذا خرجت روح المؤمن تلقاها ملكان يصعدانها ‏\"‏ ‏.‏ قال حماد فذكر من طيب ريحها وذكر المسك ‏.‏ قال ‏\"‏ ويقول أهل السماء روح طيبة جاءت من قبل الأرض صلى الله عليك وعلى جسد كنت تعمرينه ‏.‏ فينطلق به إلى ربه عز وجل ثم يقول انطلقوا به إلى آخر الأجل ‏\"‏ ‏.‏ قال ‏\"‏ وإن الكافر إذا خرجت روحه - قال حماد وذكر من نتنها وذكر لعنا - ويقول أهل السماء روح خبيثة جاءت من قبل الأرض ‏.‏ قال فيقال انطلقوا به إلى آخر الأجل ‏\"‏ ‏.‏ قال أبو هريرة فرد رسول الله صلى الله عليه وسلم ريطة كانت عليه على أنفه هكذا ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 7222,
			"arabicnumber": "2873",
			"text": "حدثني إسحاق بن عمر بن سليط الهذلي، حدثنا سليمان بن المغيرة، عن ثابت، قال قال أنس كنت مع عمر ح وحدثنا شيبان بن فروخ، - واللفظ له - حدثنا سليمان بن المغيرة، عن ثابت، عن أنس بن مالك، قال كنا مع عمر بين مكة والمدينة فتراءينا الهلال وكنت رجلا حديد البصر فرأيته وليس أحد يزعم أنه رآه غيري - قال - فجعلت أقول لعمر أما تراه فجعل لا يراه - قال - يقول عمر سأراه وأنا مستلق على فراشي ‏.‏ ثم أنشأ يحدثنا عن أهل بدر فقال إن رسول الله صلى الله عليه وسلم كان يرينا مصارع أهل بدر بالأمس يقول ‏\"‏ هذا مصرع فلان غدا إن شاء الله ‏\"‏ ‏.‏ قال فقال عمر فوالذي بعثه بالحق ما أخطئوا الحدود التي حد رسول الله صلى الله عليه وسلم - قال - فجعلوا في بئر بعضهم على بعض فانطلق رسول الله صلى الله عليه وسلم حتى انتهى إليهم فقال ‏\"‏ يا فلان بن فلان ويا فلان بن فلان هل وجدتم ما وعدكم الله ورسوله حقا فإني قد وجدت ما وعدني الله حقا ‏\"‏ ‏.‏ قال عمر يا رسول الله كيف تكلم أجسادا لا أرواح فيها قال ‏\"‏ ما أنتم بأسمع لما أقول منهم غير أنهم لا يستطيعون أن يردوا على شيئا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 7223,
			"arabicnumber": "2874",
			"text": "حدثنا هداب بن خالد، حدثنا حماد بن سلمة، عن ثابت البناني، عن أنس بن، مالك أن رسول الله صلى الله عليه وسلم ترك قتلى بدر ثلاثا ثم أتاهم فقام عليهم فناداهم فقال ‏\"‏ يا أبا جهل بن هشام يا أمية بن خلف يا عتبة بن ربيعة يا شيبة بن ربيعة أليس قد وجدتم ما وعد ربكم حقا فإني قد وجدت ما وعدني ربي حقا ‏\"‏ ‏.‏ فسمع عمر قول النبي صلى الله عليه وسلم فقال يا رسول الله كيف يسمعوا وأنى يجيبوا وقد جيفوا قال ‏\"‏ والذي نفسي بيده ما أنتم بأسمع لما أقول منهم ولكنهم لا يقدرون أن يجيبوا ‏\"‏ ‏.‏ ثم أمر بهم فسحبوا فألقوا في قليب بدر ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 7224,
			"arabicnumber": "2875",
			"text": "حدثني يوسف بن حماد المعني، حدثنا عبد الأعلى، عن سعيد، عن قتادة، عن أنس بن مالك، عن أبي طلحة، ح وحدثنيه محمد بن حاتم، حدثنا روح بن عبادة، حدثنا سعيد بن أبي عروبة، عن قتادة، قال ذكر لنا أنس بن مالك عن أبي طلحة، قال لما كان يوم بدر وظهر عليهم نبي الله صلى الله عليه وسلم أمر ببضعة وعشرين رجلا - وفي حديث روح بأربعة وعشرين رجلا - من صناديد قريش فألقوا في طوي من أطواء بدر ‏.‏ وساق الحديث بمعنى حديث ثابت عن أنس ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 7225,
			"arabicnumber": "2876.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، وعلي بن حجر، جميعا عن إسماعيل، قال أبو بكر حدثنا ابن علية، عن أيوب، عن عبد الله بن أبي مليكة، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ من حوسب يوم القيامة عذب ‏\"‏ ‏.‏ فقلت أليس قد قال الله عز وجل ‏{‏ فسوف يحاسب حسابا يسيرا‏}‏ فقال ‏\"‏ ليس ذاك الحساب إنما ذاك العرض من نوقش الحساب يوم القيامة عذب ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 7226,
			"arabicnumber": "2876.02",
			"text": "حدثني أبو الربيع العتكي، وأبو كامل قالا حدثنا حماد بن زيد، حدثنا أيوب، بهذا الإسناد نحوه ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 7227,
			"arabicnumber": "2876.03",
			"text": "وحدثني عبد الرحمن بن بشر بن الحكم العبدي، حدثنا يحيى، - يعني ابن سعيد القطان - حدثنا أبو يونس القشيري، حدثنا ابن أبي مليكة، عن القاسم، عن عائشة، عن النبي صلى الله عليه وسلم قال ‏\"‏ ليس أحد يحاسب إلا هلك ‏\"‏ ‏.‏ قلت يا رسول الله أليس الله يقول حسابا يسيرا قال ‏\"‏ ذاك العرض ولكن من نوقش الحساب هلك ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 7228,
			"arabicnumber": "2876.04",
			"text": "وحدثني عبد الرحمن بن بشر، حدثني يحيى، - وهو القطان - عن عثمان بن، الأسود عن ابن أبي مليكة، عن عائشة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ من نوقش الحساب هلك ‏\"‏ ‏.‏ ثم ذكر بمثل حديث أبي يونس ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 7229,
			"arabicnumber": "2877.01",
			"text": "حدثنا يحيى بن يحيى، أخبرنا يحيى بن زكرياء، عن الأعمش، عن أبي سفيان، عن جابر، قال سمعت النبي صلى الله عليه وسلم قبل وفاته بثلاث يقول ‏ \"‏ لا يموتن أحدكم إلا وهو يحسن بالله الظن ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 7230,
			"arabicnumber": "2877.02",
			"text": "وحدثنا عثمان بن أبي شيبة، حدثنا جرير، ح وحدثنا أبو كريب، حدثنا أبو معاوية، ح وحدثنا إسحاق بن إبراهيم، أخبرنا عيسى بن يونس، وأبو معاوية كلهم عن الأعمش، بهذا الإسناد مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 7231,
			"arabicnumber": "2877.03",
			"text": "وحدثني أبو داود، سليمان بن معبد حدثنا أبو النعمان، عارم حدثنا مهدي بن، ميمون حدثنا واصل، عن أبي الزبير، عن جابر بن عبد الله الأنصاري، قال سمعت رسول الله صلى الله عليه وسلم قبل موته بثلاثة أيام يقول ‏ \"‏ لا يموتن أحدكم إلا وهو يحسن الظن بالله عز وجل ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 7232,
			"arabicnumber": "2878.01",
			"text": "وحدثنا قتيبة بن سعيد، وعثمان بن أبي شيبة، قالا حدثنا جرير، عن الأعمش، عن أبي سفيان، عن جابر، قال سمعت النبي صلى الله عليه وسلم يقول ‏ \"‏ يبعث كل عبد على ما مات عليه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 7233,
			"arabicnumber": "2878.02",
			"text": "حدثنا أبو بكر بن نافع، حدثنا عبد الرحمن بن مهدي، عن سفيان، عن الأعمش، بهذا الإسناد ‏.‏ مثله وقال عن النبي صلى الله عليه وسلم ولم يقل سمعت ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 7234,
			"arabicnumber": "2879",
			"text": "وحدثني حرملة بن يحيى التجيبي، أخبرنا ابن وهب، أخبرني يونس، عن ابن، شهاب أخبرني حمزة بن عبد الله بن عمر، أن عبد الله بن عمر، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ إذا أراد الله بقوم عذابا أصاب العذاب من كان فيهم ثم بعثوا على أعمالهم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 103
			}
		}
	]
}