{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"55": "The Book of Zuhd and Softening of Hearts "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7417,
			"arabicnumber": "2956",
			"text": "حدثنا قتيبة بن سعيد، حدثنا عبد العزيز، - يعني الدراوردي - عن العلاء، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ الدنيا سجن المؤمن وجنة الكافر ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 7418,
			"arabicnumber": "2957.01",
			"text": "حدثنا عبد الله بن مسلمة بن قعنب، حدثنا سليمان، - يعني ابن بلال - عن جعفر، عن أبيه، عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم مر بالسوق داخلا من بعض العالية والناس كنفته فمر بجدى أسك ميت فتناوله فأخذ بأذنه ثم قال ‏\"‏ أيكم يحب أن هذا له بدرهم ‏\"‏ ‏.‏ فقالوا ما نحب أنه لنا بشىء وما نصنع به قال ‏\"‏ أتحبون أنه لكم ‏\"‏ ‏.‏ قالوا والله لو كان حيا كان عيبا فيه لأنه أسك فكيف وهو ميت فقال ‏\"‏ فوالله للدنيا أهون على الله من هذا عليكم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 7419,
			"arabicnumber": "2957.02",
			"text": "حدثني محمد بن المثنى العنزي، وإبراهيم بن محمد بن عرعرة السامي، قالا حدثنا عبد الوهاب، - يعنيان الثقفي - عن جعفر، عن أبيه، عن جابر، عن النبي صلى الله عليه وسلم ‏.‏ بمثله غير أن في حديث الثقفي فلو كان حيا كان هذا السكك به عيبا ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 7420,
			"arabicnumber": "2958.01",
			"text": "حدثنا هداب بن خالد، حدثنا همام، حدثنا قتادة، عن مطرف، عن أبيه، قال أتيت النبي صلى الله عليه وسلم وهو يقرأ ‏{‏ ألهاكم التكاثر‏}‏ قال ‏ \"‏ يقول ابن آدم مالي مالي - قال - وهل لك يا ابن آدم من مالك إلا ما أكلت فأفنيت أو لبست فأبليت أو تصدقت فأمضيت ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 7421,
			"arabicnumber": "2958.02",
			"text": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، وقالا، جميعا حدثنا ابن أبي عدي، عن سعيد، ح وحدثنا ابن المثنى، حدثنا معاذ بن هشام، حدثنا أبي كلهم، عن قتادة، عن مطرف، عن أبيه، قال انتهيت إلى النبي صلى الله عليه وسلم ‏.‏ فذكر بمثل حديث همام ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 7422,
			"arabicnumber": "2959.01",
			"text": "حدثني سويد بن سعيد، حدثنا حفص بن ميسرة، عن العلاء، عن أبيه، عن أبي، هريرة أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ يقول العبد مالي مالي إنما له من ماله ثلاث ما أكل فأفنى أو لبس فأبلى أو أعطى فاقتنى وما سوى ذلك فهو ذاهب وتاركه للناس ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 7423,
			"arabicnumber": "2959.02",
			"text": "وحدثنيه أبو بكر بن إسحاق، أخبرنا ابن أبي مريم، أخبرنا محمد بن جعفر، أخبرني العلاء بن عبد الرحمن، بهذا الإسناد مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 7424,
			"arabicnumber": "2960",
			"text": "حدثنا يحيى بن يحيى التميمي، وزهير بن حرب، كلاهما عن ابن عيينة، قال يحيى أخبرنا سفيان بن عيينة، عن عبد الله بن أبي بكر، قال سمعت أنس بن مالك، يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ يتبع الميت ثلاثة فيرجع اثنان ويبقى واحد يتبعه أهله وماله وعمله فيرجع أهله وماله ويبقى عمله ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 7425,
			"arabicnumber": "2961.01",
			"text": "حدثني حرملة بن يحيى بن عبد الله، - يعني ابن حرملة بن عمران التجيبي - أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، عن عروة بن الزبير، أن المسور بن مخرمة، أخبره أن عمرو بن عوف وهو حليف بني عامر بن لؤى وكان شهد بدرا مع رسول الله صلى الله عليه وسلم أخبره أن رسول الله صلى الله عليه وسلم بعث أبا عبيدة بن الجراح إلى البحرين يأتي بجزيتها وكان رسول الله صلى الله عليه وسلم هو صالح أهل البحرين وأمر عليهم العلاء بن الحضرمي فقدم أبو عبيدة بمال من البحرين فسمعت الأنصار بقدوم أبي عبيدة فوافوا صلاة الفجر مع رسول الله صلى الله عليه وسلم فلما صلى رسول الله صلى الله عليه وسلم انصرف فتعرضوا له فتبسم رسول الله صلى الله عليه وسلم حين رآهم ثم قال ‏\"‏ أظنكم سمعتم أن أبا عبيدة قدم بشىء من البحرين ‏\"‏ ‏.‏ فقالوا أجل يا رسول الله قال ‏\"‏ ‏\"‏ فأبشروا وأملوا ما يسركم فوالله ما الفقر أخشى عليكم ‏.‏ ولكني أخشى عليكم أن تبسط الدنيا عليكم كما بسطت على من كان قبلكم فتنافسوها كما تنافسوها وتهلككم كما أهلكتهم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 7426,
			"arabicnumber": "2961.02",
			"text": "حدثنا الحسن بن علي الحلواني، وعبد بن حميد، جميعا عن يعقوب بن إبراهيم، بن سعد حدثنا أبي، عن صالح، ح وحدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا أبو اليمان أخبرنا شعيب، كلاهما عن الزهري، بإسناد يونس ومثل حديثه غير أن في حديث صالح ‏ \"‏ وتلهيكم كما ألهتهم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 7427,
			"arabicnumber": "2962",
			"text": "حدثنا عمرو بن سواد العامري، أخبرنا عبد الله بن وهب، أخبرني عمرو بن، الحارث أن بكر بن سوادة، حدثه أن يزيد بن رباح - هو أبو فراس مولى عبد الله بن عمرو بن العاص - حدثه عن عبد الله بن عمرو بن العاص، عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ إذا فتحت عليكم فارس والروم أى قوم أنتم ‏\"‏ ‏.‏ قال عبد الرحمن بن عوف نقول كما أمرنا الله قال رسول الله صلى الله عليه وسلم ‏\"‏ أو غير ذلك تتنافسون ثم تتحاسدون ثم تتدابرون ثم تتباغضون أو نحو ذلك ثم تنطلقون في مساكين المهاجرين فتجعلون بعضهم على رقاب بعض ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 7428,
			"arabicnumber": "2963.01",
			"text": "حدثنا يحيى بن يحيى، وقتيبة بن سعيد، قال قتيبة حدثنا وقال، يحيى أخبرنا المغيرة بن عبد الرحمن الحزامي، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إذا نظر أحدكم إلى من فضل عليه في المال والخلق فلينظر إلى من هو أسفل منه ممن فضل عليه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 7429,
			"arabicnumber": "2963.02",
			"text": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، عن أبي هريرة، عن النبي صلى الله عليه وسلم بمثل حديث أبي الزناد سواء ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 7430,
			"arabicnumber": "2963.03",
			"text": "وحدثني زهير بن حرب، حدثنا جرير، ح وحدثنا أبو كريب، حدثنا أبو معاوية، ح وحدثنا أبو بكر بن أبي شيبة، - واللفظ له - حدثنا أبو معاوية، ووكيع، عن الأعمش، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ انظروا إلى من أسفل منكم ولا تنظروا إلى من هو فوقكم فهو أجدر أن لا تزدروا نعمة الله ‏\"‏ ‏.‏ قال أبو معاوية ‏\"‏ عليكم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 7431,
			"arabicnumber": "2964",
			"text": "حدثنا شيبان بن فروخ، حدثنا همام، حدثنا إسحاق بن عبد الله بن أبي طلحة، حدثني عبد الرحمن بن أبي عمرة، أن أبا هريرة، حدثه أنه، سمع النبي صلى الله عليه وسلم يقول ‏\"‏ إن ثلاثة في بني إسرائيل أبرص وأقرع وأعمى فأراد الله أن يبتليهم فبعث إليهم ملكا فأتى الأبرص فقال أى شىء أحب إليك قال لون حسن وجلد حسن ويذهب عني الذي قد قذرني الناس ‏.‏ قال فمسحه فذهب عنه قذره وأعطي لونا حسنا وجلدا حسنا قال فأى المال أحب إليك قال الإبل - أو قال البقر شك إسحاق - إلا أن الأبرص أو الأقرع قال أحدهما الإبل وقال الآخر البقر - قال فأعطي ناقة عشراء فقال بارك الله لك فيها - قال - فأتى الأقرع فقال أى شىء أحب إليك قال شعر حسن ويذهب عني هذا الذي قذرني الناس ‏.‏ قال فمسحه فذهب عنه وأعطي شعرا حسنا - قال - فأى المال أحب إليك قال البقر ‏.‏ فأعطي بقرة حاملا فقال بارك الله لك فيها - قال - فأتى الأعمى فقال أى شىء أحب إليك قال أن يرد الله إلى بصري فأبصر به الناس - قال - فمسحه فرد الله إليه بصره ‏.‏ قال فأى المال أحب إليك قال الغنم ‏.‏ فأعطي شاة والدا فأنتج هذان وولد هذا - قال - فكان لهذا واد من الإبل ولهذا واد من البقر ولهذا واد من الغنم ‏.‏ قال ثم إنه أتى الأبرص في صورته وهيئته فقال رجل مسكين قد انقطعت بي الحبال في سفري فلا بلاغ لي اليوم إلا بالله ثم بك أسألك بالذي أعطاك اللون الحسن والجلد الحسن والمال بعيرا أتبلغ عليه في سفري ‏.‏ فقال الحقوق كثيرة ‏.‏ فقال له كأني أعرفك ألم تكن أبرص يقذرك الناس فقيرا فأعطاك الله فقال إنما ورثت هذا المال كابرا عن كابر ‏.‏ فقال إن كنت كاذبا فصيرك الله إلى ما كنت ‏.‏ قال وأتى الأقرع في صورته فقال له مثل ما قال لهذا ورد عليه مثل ما رد على هذا فقال إن كنت كاذبا فصيرك الله إلى ما كنت ‏.‏ قال وأتى الأعمى في صورته وهيئته فقال رجل مسكين وابن سبيل انقطعت بي الحبال في سفري فلا بلاغ لي اليوم إلا بالله ثم بك أسألك بالذي رد عليك بصرك شاة أتبلغ بها في سفري فقال قد كنت أعمى فرد الله إلى بصري فخذ ما شئت ودع ما شئت فوالله لا أجهدك اليوم شيئا أخذته لله فقال أمسك مالك فإنما ابتليتم فقد رضي عنك وسخط على صاحبيك ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 7432,
			"arabicnumber": "2965",
			"text": "حدثنا إسحاق بن إبراهيم، وعباس بن عبد العظيم، - واللفظ لإسحاق - قال عباس حدثنا وقال، إسحاق أخبرنا - أبو بكر الحنفي، حدثنا بكير بن مسمار، حدثني عامر بن سعد، قال كان سعد بن أبي وقاص في إبله فجاءه ابنه عمر فلما رآه سعد قال أعوذ بالله من شر هذا الراكب فنزل فقال له أنزلت في إبلك وغنمك وتركت الناس يتنازعون الملك بينهم فضرب سعد في صدره فقال اسكت سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ إن الله يحب العبد التقي الغني الخفي ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 7433,
			"arabicnumber": "2966.01",
			"text": "حدثنا يحيى بن حبيب الحارثي، حدثنا المعتمر، قال سمعت إسماعيل، عن قيس، عن سعد، ح وحدثنا محمد بن عبد الله بن نمير، حدثنا أبي وابن، بشر قالا حدثنا إسماعيل، عن قيس، قال سمعت سعد بن أبي وقاص، يقول والله إني لأول رجل من العرب رمى بسهم في سبيل الله ولقد كنا نغزو مع رسول الله صلى الله عليه وسلم ما لنا طعام نأكله إلا ورق الحبلة وهذا السمر حتى إن أحدنا ليضع كما تضع الشاة ثم أصبحت بنو أسد تعزرني على الدين لقد خبت إذا وضل عملي ولم يقل ابن نمير إذا ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 7434,
			"arabicnumber": "2966.02",
			"text": "وحدثناه يحيى بن يحيى، أخبرنا وكيع، عن إسماعيل بن أبي خالد، بهذا الإسناد وقال حتى إن كان أحدنا ليضع كما تضع العنز ما يخلطه بشىء ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 7435,
			"arabicnumber": "2967.01",
			"text": "حدثنا شيبان بن فروخ، حدثنا سليمان بن المغيرة، حدثنا حميد بن هلال، عن خالد بن عمير العدوي، قال خطبنا عتبة بن غزوان فحمد الله وأثنى عليه ثم قال أما بعد فإن الدنيا قد آذنت بصرم وولت حذاء ولم يبق منها إلا صبابة كصبابة الإناء يتصابها صاحبها وإنكم منتقلون منها إلى دار لا زوال لها فانتقلوا بخير ما بحضرتكم فإنه قد ذكر لنا أن الحجر يلقى من شفة جهنم فيهوي فيها سبعين عاما لا يدرك لها قعرا ووالله لتملأن أفعجبتم ولقد ذكر لنا أن ما بين مصراعين من مصاريع الجنة مسيرة أربعين سنة وليأتين عليها يوم وهو كظيظ من الزحام ولقد رأيتني سابع سبعة مع رسول الله صلى الله عليه وسلم ما لنا طعام إلا ورق الشجر حتى قرحت أشداقنا فالتقطت بردة فشققتها بيني وبين سعد بن مالك فاتزرت بنصفها واتزر سعد بنصفها فما أصبح اليوم منا أحد إلا أصبح أميرا على مصر من الأمصار وإني أعوذ بالله أن أكون في نفسي عظيما وعند الله صغيرا وإنها لم تكن نبوة قط إلا تناسخت حتى يكون آخر عاقبتها ملكا فستخبرون وتجربون الأمراء بعدنا ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 7436,
			"arabicnumber": "2967.02",
			"text": "وحدثني إسحاق بن عمر بن سليط، حدثنا سليمان بن المغيرة، حدثنا حميد بن، هلال عن خالد بن عمير، وقد أدرك الجاهلية قال خطب عتبة بن غزوان وكان أميرا على البصرة ‏.‏ فذكر نحو حديث شيبان ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 7437,
			"arabicnumber": "2967.03",
			"text": "وحدثنا أبو كريب، محمد بن العلاء حدثنا وكيع، عن قرة بن خالد، عن حميد، بن هلال عن خالد بن عمير، قال سمعت عتبة بن غزوان، يقول لقد رأيتني سابع سبعة مع رسول الله صلى الله عليه وسلم ما طعامنا إلا ورق الحبلة حتى قرحت أشداقنا ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 7438,
			"arabicnumber": "2968",
			"text": "حدثنا محمد بن أبي عمر، حدثنا سفيان، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، قال قالوا يا رسول الله هل نرى ربنا يوم القيامة قال ‏\"‏ هل تضارون في رؤية الشمس في الظهيرة ليست في سحابة ‏\"‏ ‏.‏ قالوا لا ‏.‏ قال ‏\"‏ فهل تضارون في رؤية القمر ليلة البدر ليس في سحابة ‏\"‏ ‏.‏ قالوا لا ‏.‏ قال ‏\"‏ فوالذي نفسي بيده لا تضارون في رؤية ربكم إلا كما تضارون في رؤية أحدهما - قال - فيلقى العبد فيقول أى فل ألم أكرمك وأسودك وأزوجك وأسخر لك الخيل والإبل وأذرك ترأس وتربع فيقول بلى ‏.‏ قال فيقول أفظننت أنك ملاقي فيقول لا ‏.‏ فيقول فإني أنساك كما نسيتني ‏.‏ ثم يلقى الثاني فيقول أى فل ألم أكرمك وأسودك وأزوجك وأسخر لك الخيل والإبل وأذرك ترأس وتربع فيقول بلى أى رب ‏.‏ فيقول أفظننت أنك ملاقي فيقول لا ‏.‏ فيقول فإني أنساك كما نسيتني ‏.‏ ثم يلقى الثالث فيقول له مثل ذلك فيقول يا رب آمنت بك وبكتابك وبرسلك وصليت وصمت وتصدقت ‏.‏ ويثني بخير ما استطاع فيقول ها هنا إذا - قال - ثم يقال له الآن نبعث شاهدنا عليك ‏.‏ ويتفكر في نفسه من ذا الذي يشهد على فيختم على فيه ويقال لفخذه ولحمه وعظامه انطقي فتنطق فخذه ولحمه وعظامه بعمله وذلك ليعذر من نفسه ‏.‏ وذلك المنافق وذلك الذي يسخط الله عليه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 7439,
			"arabicnumber": "2969",
			"text": "حدثنا أبو بكر بن النضر بن أبي النضر، حدثني أبو النضر، هاشم بن القاسم حدثنا عبيد الله الأشجعي، عن سفيان الثوري، عن عبيد المكتب، عن فضيل، عن الشعبي، عن أنس بن مالك، قال كنا عند رسول الله صلى الله عليه وسلم فضحك فقال ‏\"‏ هل تدرون مم أضحك ‏\"‏ ‏.‏ قال قلنا الله ورسوله أعلم ‏.‏ قال ‏\"‏ من مخاطبة العبد ربه يقول يا رب ألم تجرني من الظلم قال يقول بلى ‏.‏ قال فيقول فإني لا أجيز على نفسي إلا شاهدا مني قال فيقول كفى بنفسك اليوم عليك شهيدا وبالكرام الكاتبين شهودا - قال - فيختم على فيه فيقال لأركانه انطقي ‏.‏ قال فتنطق بأعماله - قال - ثم يخلى بينه وبين الكلام - قال - فيقول بعدا لكن وسحقا ‏.‏ فعنكن كنت أناضل ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 7440,
			"arabicnumber": "1055.02",
			"text": "حدثني زهير بن حرب، حدثنا محمد بن فضيل، عن أبيه، عن عمارة بن القعقاع، عن أبي زرعة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ اللهم اجعل رزق آل محمد قوتا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 7441,
			"arabicnumber": "1055.03",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، وزهير بن حرب، وأبو كريب قالوا حدثنا وكيع، حدثنا الأعمش، عن عمارة بن القعقاع، عن أبي زرعة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم اجعل رزق آل محمد قوتا ‏\"‏ ‏.‏ وفي رواية عمرو ‏\"‏ اللهم ارزق ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 7442,
			"arabicnumber": "1055.04",
			"text": "وحدثناه أبو سعيد الأشج، حدثنا أبو أسامة، قال سمعت الأعمش، ذكر عن عمارة، بن القعقاع بهذا الإسناد وقال ‏ \"‏ كفافا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 7443,
			"arabicnumber": "2970.01",
			"text": "حدثنا زهير بن حرب، وإسحاق بن إبراهيم، قال إسحاق أخبرنا وقال، زهير حدثنا جرير، عن منصور، عن إبراهيم، عن الأسود، عن عائشة، قالت ما شبع آل محمد صلى الله عليه وسلم منذ قدم المدينة من طعام بر ثلاث ليال تباعا حتى قبض ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 7444,
			"arabicnumber": "2970.02",
			"text": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب وإسحاق بن إبراهيم قال إسحاق أخبرنا وقال الآخران، حدثنا أبو معاوية، عن الأعمش، عن إبراهيم، عن الأسود، عن عائشة، قالت ما شبع رسول الله صلى الله عليه وسلم ثلاثة أيام تباعا من خبز بر حتى مضى لسبيله ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 7445,
			"arabicnumber": "2970.03",
			"text": "حدثنا محمد بن المثنى، ومحمد بن بشار، قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن أبي إسحاق، قال سمعت عبد الرحمن بن يزيد، يحدث عن الأسود، عن عائشة، أنها قالت ما شبع آل محمد صلى الله عليه وسلم من خبز شعير يومين متتابعين حتى قبض رسول الله صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 7446,
			"arabicnumber": "2970.04",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن سفيان، عن عبد الرحمن بن عابس، عن أبيه، عن عائشة، قالت ما شبع آل محمد صلى الله عليه وسلم من خبز بر فوق ثلاث ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 7464,
			"arabicnumber": "2980.01",
			"text": "حدثنا يحيى بن أيوب، وقتيبة بن سعيد، وعلي بن حجر، جميعا عن إسماعيل، قال ابن أيوب حدثنا إسماعيل بن جعفر، أخبرني عبد الله بن دينار، أنه سمع عبد الله، بن عمر يقول قال رسول الله صلى الله عليه وسلم لأصحاب الحجر ‏ \"‏ لا تدخلوا على هؤلاء القوم المعذبين إلا أن تكونوا باكين فإن لم تكونوا باكين فلا تدخلوا عليهم أن يصيبكم مثل ما أصابهم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 7465,
			"arabicnumber": "2980.02",
			"text": "حدثني حرملة بن يحيى، أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، - وهو يذكر الحجر مساكن ثمود - قال سالم بن عبد الله إن عبد الله بن عمر قال مررنا مع رسول الله صلى الله عليه وسلم على الحجر فقال لنا رسول الله صلى الله عليه وسلم ‏ \"‏ لا تدخلوا مساكن الذين ظلموا أنفسهم إلا أن تكونوا باكين حذرا أن يصيبكم مثل ما أصابهم ‏\"‏ ‏.‏ ثم زجر فأسرع حتى خلفها ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 7466,
			"arabicnumber": "2981.01",
			"text": "حدثني الحكم بن موسى أبو صالح، حدثنا شعيب بن إسحاق، أخبرنا عبيد الله، عن نافع، أن عبد الله بن عمر، أخبره أن الناس نزلوا مع رسول الله صلى الله عليه وسلم على الحجر أرض ثمود فاستقوا من آبارها وعجنوا به العجين فأمرهم رسول الله صلى الله عليه وسلم أن يهريقوا ما استقوا ويعلفوا الإبل العجين وأمرهم أن يستقوا من البئر التي كانت تردها الناقة ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 7467,
			"arabicnumber": "2981.02",
			"text": "وحدثنا إسحاق بن موسى الأنصاري، حدثنا أنس بن عياض، حدثني عبيد الله، بهذا الإسناد ‏.‏ مثله غير أنه قال فاستقوا من بئارها واعتجنوا به ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 7468,
			"arabicnumber": "2982",
			"text": "حدثنا عبد الله بن مسلمة بن قعنب، حدثنا مالك، عن ثور بن زيد، عن أبي الغيث، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ الساعي على الأرملة والمسكين كالمجاهد في سبيل الله - وأحسبه قال - وكالقائم لا يفتر وكالصائم لا يفطر ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 7469,
			"arabicnumber": "2983",
			"text": "حدثني زهير بن حرب، حدثنا إسحاق بن عيسى، حدثنا مالك، عن ثور بن زيد، الديلي قال سمعت أبا الغيث، يحدث عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ كافل اليتيم له أو لغيره أنا وهو كهاتين في الجنة ‏\"‏ ‏.‏ وأشار مالك بالسبابة والوسطى ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 7470,
			"arabicnumber": "533.03",
			"text": "حدثني هارون بن سعيد الأيلي، وأحمد بن عيسى، قالا حدثنا ابن وهب، أخبرني عمرو، - وهو ابن الحارث - أن بكيرا، حدثه أن عاصم بن عمر بن قتادة حدثه أنه، سمع عبيد الله الخولاني، يذكر أنه سمع عثمان بن عفان، عند قول الناس فيه حين بنى مسجد رسول الله صلى الله عليه وسلم إنكم قد أكثرتم وإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من بنى مسجدا - قال بكير حسبت أنه قال - يبتغي به وجه الله بنى الله له مثله في الجنة ‏\"‏ ‏.‏ وفي رواية هارون ‏\"‏ بنى الله له بيتا في الجنة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 7471,
			"arabicnumber": "533.04",
			"text": "حدثنا زهير بن حرب، ومحمد بن المثنى، كلاهما عن الضحاك، - قال ابن المثنى حدثنا الضحاك بن مخلد، - أخبرنا عبد الحميد بن جعفر، حدثني أبي، عن محمود بن لبيد، أن عثمان بن عفان، أراد بناء المسجد فكره الناس ذلك وأحبوا أن يدعه على هيئته فقال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ من بنى مسجدا لله بنى الله له في الجنة مثله ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 7472,
			"arabicnumber": "533.05",
			"text": "وحدثناه إسحاق بن إبراهيم الحنظلي، حدثنا أبو بكر الحنفي، وعبد الملك بن، الصباح كلاهما عن عبد الحميد بن جعفر، بهذا الإسناد غير أن في، حديثهما ‏ \"‏ بنى الله له بيتا في الجنة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 7473,
			"arabicnumber": "2984.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، - واللفظ لأبي بكر - قالا حدثنا يزيد بن هارون، حدثنا عبد العزيز بن أبي سلمة، عن وهب بن كيسان، عن عبيد بن عمير، الليثي عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ بينا رجل بفلاة من الأرض فسمع صوتا في سحابة اسق حديقة فلان ‏.‏ فتنحى ذلك السحاب فأفرغ ماءه في حرة فإذا شرجة من تلك الشراج قد استوعبت ذلك الماء كله فتتبع الماء فإذا رجل قائم في حديقته يحول الماء بمسحاته فقال له يا عبد الله ما اسمك قال فلان ‏.‏ للاسم الذي سمع في السحابة فقال له يا عبد الله لم تسألني عن اسمي فقال إني سمعت صوتا في السحاب الذي هذا ماؤه يقول اسق حديقة فلان لاسمك فما تصنع فيها قال أما إذا قلت هذا فإني أنظر إلى ما يخرج منها فأتصدق بثلثه وآكل أنا وعيالي ثلثا وأرد فيها ثلثه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 7474,
			"arabicnumber": "2984.02",
			"text": "وحدثناه أحمد بن عبدة الضبي، أخبرنا أبو داود، حدثنا عبد العزيز بن أبي سلمة، حدثنا وهب بن كيسان، بهذا الإسناد غير أنه قال ‏ \"‏ وأجعل ثلثه في المساكين والسائلين وابن السبيل ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 7475,
			"arabicnumber": "2985",
			"text": "حدثني زهير بن حرب، حدثنا إسماعيل بن إبراهيم، أخبرنا روح بن القاسم، عن العلاء بن عبد الرحمن بن يعقوب، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ قال الله تبارك وتعالى أنا أغنى الشركاء عن الشرك من عمل عملا أشرك فيه معي غيري تركته وشركه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 7476,
			"arabicnumber": "2986",
			"text": "حدثنا عمر بن حفص بن غياث، حدثني أبي، عن إسماعيل بن سميع، عن مسلم، البطين عن سعيد بن جبير، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من سمع سمع الله به ومن راءى راءى الله به ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 7477,
			"arabicnumber": "2987.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن سفيان، عن سلمة بن كهيل، قال سمعت جندبا العلقي، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من يسمع يسمع الله به ومن يرائي يرائي الله به ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 7478,
			"arabicnumber": "2987.02",
			"text": "وحدثنا إسحاق بن إبراهيم، حدثنا الملائي، حدثنا سفيان، بهذا الإسناد وزاد ولم أسمع أحدا غيره يقول قال رسول الله صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 7479,
			"arabicnumber": "2987.03",
			"text": "حدثنا سعيد بن عمرو الأشعثي، أخبرنا سفيان، عن الوليد بن حرب، - قال سعيد أظنه قال ابن الحارث بن أبي موسى - قال سمعت سلمة بن كهيل، قال سمعت جندبا، - ولم أسمع أحدا يقول سمعت رسول الله صلى الله عليه وسلم غيره - يقول سمعت رسول الله صلى الله عليه وسلم يقول بمثل حديث الثوري ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 7480,
			"arabicnumber": "2987.04",
			"text": "وحدثناه ابن أبي عمر، حدثنا سفيان، حدثنا الصدوق الأمين الوليد بن حرب، بهذا الإسناد ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 7481,
			"arabicnumber": "2988.01",
			"text": "حدثنا قتيبة بن سعيد، حدثنا بكر، - يعني ابن مضر - عن ابن الهاد، عن محمد، بن إبراهيم عن عيسى بن طلحة، عن أبي هريرة، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏ \"‏ إن العبد ليتكلم بالكلمة ينزل بها في النار أبعد ما بين المشرق والمغرب ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 7482,
			"arabicnumber": "2988.02",
			"text": "وحدثناه محمد بن أبي عمر المكي، حدثنا عبد العزيز الدراوردي، عن يزيد بن، الهاد عن محمد بن إبراهيم، عن عيسى بن طلحة، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إن العبد ليتكلم بالكلمة ما يتبين ما فيها يهوي بها في النار أبعد ما بين المشرق والمغرب ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 7483,
			"arabicnumber": "2989.01",
			"text": "حدثنا يحيى بن يحيى، وأبو بكر بن أبي شيبة ومحمد بن عبد الله بن نمير وإسحاق بن إبراهيم وأبو كريب - واللفظ لأبي كريب - قال يحيى وإسحاق أخبرنا وقال الآخرون حدثنا أبو معاوية حدثنا الأعمش عن شقيق عن أسامة بن زيد قال قيل له ألا تدخل على عثمان فتكلمه فقال أترون أني لا أكلمه إلا أسمعكم والله لقد كلمته فيما بيني وبينه ما دون أن أفتتح أمرا لا أحب أن أكون أول من فتحه ولا أقول لأحد يكون على أميرا إنه خير الناس ‏.‏ بعد ما سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ يؤتى بالرجل يوم القيامة فيلقى في النار فتندلق أقتاب بطنه فيدور بها كما يدور الحمار بالرحى فيجتمع إليه أهل النار فيقولون يا فلان ما لك ألم تكن تأمر بالمعروف وتنهى عن المنكر فيقول بلى قد كنت آمر بالمعروف ولا آتيه وأنهى عن المنكر وآتيه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 7484,
			"arabicnumber": "2989.02",
			"text": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن الأعمش، عن أبي وائل، قال كنا عند أسامة بن زيد فقال رجل ما يمنعك أن تدخل على عثمان فتكلمه فيما يصنع وساق الحديث بمثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 7485,
			"arabicnumber": "2990",
			"text": "حدثني زهير بن حرب، ومحمد بن حاتم، وعبد بن حميد، قال عبد حدثني وقال، الآخران حدثنا يعقوب بن إبراهيم، حدثنا ابن أخي ابن شهاب، عن عمه، قال قال سالم سمعت أبا هريرة، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ كل أمتي معافاة إلا المجاهرين وإن من الإجهار أن يعمل العبد بالليل عملا ثم يصبح قد ستره ربه فيقول يا فلان قد عملت البارحة كذا وكذا وقد بات يستره ربه فيبيت يستره ربه ويصبح يكشف ستر الله عنه ‏\"‏ ‏.‏ قال زهير ‏\"‏ وإن من الهجار ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 7486,
			"arabicnumber": "2991.01",
			"text": "حدثني محمد بن عبد الله بن نمير، حدثنا حفص، - وهو ابن غياث - عن سليمان، التيمي عن أنس بن مالك، قال عطس عند النبي صلى الله عليه وسلم رجلان فشمت أحدهما ولم يشمت الآخر فقال الذي لم يشمته عطس فلان فشمته وعطست أنا فلم تشمتني ‏.‏ قال ‏ \"‏ إن هذا حمد الله وإنك لم تحمد الله ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 7487,
			"arabicnumber": "2991.02",
			"text": "وحدثنا أبو كريب، حدثنا أبو خالد، - يعني الأحمر - عن سليمان التيمي، عن أنس، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 7488,
			"arabicnumber": "2992",
			"text": "حدثني زهير بن حرب، ومحمد بن عبد الله بن نمير، - واللفظ لزهير - قالا حدثنا القاسم بن مالك، عن عاصم بن كليب، عن أبي بردة، قال دخلت على أبي موسى وهو في بيت بنت الفضل بن عباس فعطست فلم يشمتني وعطست فشمتها فرجعت إلى أمي فأخبرتها فلما جاءها قالت عطس عندك ابني فلم تشمته وعطست فشمتها ‏.‏ فقال إن ابنك عطس فلم يحمد الله فلم أشمته وعطست فحمدت الله فشمتها سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ إذا عطس أحدكم فحمد الله فشمتوه فإن لم يحمد الله فلا تشمتوه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 7489,
			"arabicnumber": "2993",
			"text": "حدثنا محمد بن عبد الله بن نمير، حدثنا وكيع، حدثنا عكرمة بن عمار، عن إياس، بن سلمة بن الأكوع عن أبيه، ح وحدثنا إسحاق بن إبراهيم، - واللفظ له - حدثنا أبو النضر، هاشم بن القاسم حدثنا عكرمة بن عمار، حدثني إياس بن سلمة بن الأكوع، أن أباه، حدثه أنه، سمع النبي صلى الله عليه وسلم وعطس رجل عنده فقال له ‏\"‏ يرحمك الله ‏\"‏ ‏.‏ ثم عطس أخرى فقال له رسول الله صلى الله عليه وسلم ‏\"‏ الرجل مزكوم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 7490,
			"arabicnumber": "2994",
			"text": "حدثنا يحيى بن أيوب، وقتيبة بن سعيد، وعلي بن حجر السعدي، قالوا حدثنا إسماعيل، - يعنون ابن جعفر - عن العلاء، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ التثاؤب من الشيطان فإذا تثاءب أحدكم فليكظم ما استطاع ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 7491,
			"arabicnumber": "2995.01",
			"text": "حدثني أبو غسان المسمعي، مالك بن عبد الواحد حدثنا بشر بن المفضل، حدثنا سهيل بن أبي صالح، قال سمعت ابنا، لأبي سعيد الخدري يحدث أبي عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا تثاوب أحدكم فليمسك بيده على فيه فإن الشيطان يدخل ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 7492,
			"arabicnumber": "2995.02",
			"text": "حدثنا قتيبة بن سعيد، حدثنا عبد العزيز، عن سهيل، عن عبد الرحمن بن أبي، سعيد عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إذا تثاوب أحدكم فليمسك بيده فإن الشيطان يدخل ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 7493,
			"arabicnumber": "2995.03",
			"text": "حدثني أبو بكر بن أبي شيبة، حدثنا وكيع، عن سفيان، عن سهيل بن أبي صالح، عن ابن أبي سعيد الخدري، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا تثاوب أحدكم في الصلاة فليكظم ما استطاع فإن الشيطان يدخل ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 7494,
			"arabicnumber": "2995.04",
			"text": "حدثناه عثمان بن أبي شيبة، حدثنا جرير، عن سهيل، عن أبيه، أو عن ابن أبي، سعيد عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم بمثل حديث بشر وعبد العزيز ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 7495,
			"arabicnumber": "2996",
			"text": "حدثنا محمد بن رافع، وعبد بن حميد، قال عبد أخبرنا وقال ابن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن عروة، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏ \"‏ خلقت الملائكة من نور وخلق الجان من مارج من نار وخلق آدم مما وصف لكم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 7496,
			"arabicnumber": "2997.01",
			"text": "حدثنا إسحاق بن إبراهيم، ومحمد بن المثنى العنزي، ومحمد بن عبد الله الرزي، جميعا عن الثقفي، - واللفظ لابن المثنى - حدثنا عبد الوهاب، حدثنا خالد، عن محمد بن، سيرين عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ فقدت أمة من بني إسرائيل لا يدرى ما فعلت ولا أراها إلا الفأر ألا ترونها إذا وضع لها ألبان الإبل لم تشربه وإذا وضع لها ألبان الشاء شربته ‏\"‏ ‏.‏ قال أبو هريرة فحدثت هذا الحديث كعبا فقال آنت سمعته من رسول الله صلى الله عليه وسلم قلت نعم ‏.‏ قال ذلك مرارا ‏.‏ قلت أأقرأ التوراة قال إسحاق في روايته ‏\"‏ لا ندري ما فعلت ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 7497,
			"arabicnumber": "2997.02",
			"text": "وحدثني أبو كريب، محمد بن العلاء حدثنا أبو أسامة، عن هشام، عن محمد، عن أبي هريرة، قال ‏ \"‏ الفأرة مسخ وآية ذلك أنه يوضع بين يديها لبن الغنم فتشربه ويوضع بين يديها لبن الإبل فلا تذوقه ‏\"‏ ‏.‏ فقال له كعب أسمعت هذا من رسول الله صلى الله عليه وسلم قال أفأنزلت على التوراة",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 7500,
			"arabicnumber": "2999",
			"text": "حدثنا هداب بن خالد الأزدي، وشيبان بن فروخ، جميعا عن سليمان بن المغيرة، - واللفظ لشيبان - حدثنا سليمان، حدثنا ثابت، عن عبد الرحمن بن أبي ليلى، عن صهيب، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ عجبا لأمر المؤمن إن أمره كله خير وليس ذاك لأحد إلا للمؤمن إن أصابته سراء شكر فكان خيرا له وإن أصابته ضراء صبر فكان خيرا له ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 7501,
			"arabicnumber": "3000.01",
			"text": "حدثنا يحيى بن يحيى، حدثنا يزيد بن زريع، عن خالد الحذاء، عن عبد الرحمن، بن أبي بكرة عن أبيه، قال مدح رجل رجلا عند النبي صلى الله عليه وسلم - قال - فقال ‏\"‏ ويحك قطعت عنق صاحبك قطعت عنق صاحبك ‏\"‏ ‏.‏ مرارا ‏\"‏ إذا كان أحدكم مادحا صاحبه لا محالة فليقل أحسب فلانا والله حسيبه ولا أزكي على الله أحدا أحسبه إن كان يعلم ذاك كذا وكذا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 7502,
			"arabicnumber": "3000.02",
			"text": "وحدثني محمد بن عمرو بن عباد بن جبلة بن أبي رواد، حدثنا محمد بن جعفر، ح وحدثني أبو بكر بن نافع، أخبرنا غندر، قال شعبة حدثنا عن خالد الحذاء، عن عبد، الرحمن بن أبي بكرة عن أبيه، عن النبي صلى الله عليه وسلم أنه ذكر عنده رجل فقال رجل يا رسول الله ما من رجل بعد رسول الله صلى الله عليه وسلم أفضل منه في كذا وكذا ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ ويحك قطعت عنق صاحبك ‏\"‏ ‏.‏ مرارا يقول ذلك ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ إن كان أحدكم مادحا أخاه لا محالة فليقل أحسب فلانا إن كان يرى أنه كذلك ولا أزكي على الله أحدا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 7503,
			"arabicnumber": "3000.03",
			"text": "وحدثنيه عمرو الناقد، حدثنا هاشم بن القاسم، ح وحدثناه أبو بكر بن أبي شيبة، حدثنا شبابة بن سوار، كلاهما عن شعبة، بهذا الإسناد ‏.‏ نحو حديث يزيد بن زريع وليس في حديثهما فقال رجل ما من رجل بعد رسول الله صلى الله عليه وسلم أفضل منه ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 7504,
			"arabicnumber": "3001",
			"text": "حدثني أبو جعفر، محمد بن الصباح حدثنا إسماعيل بن زكرياء، عن بريد بن، عبد الله بن أبي بردة عن أبي بردة، عن أبي موسى، قال سمع النبي صلى الله عليه وسلم رجلا يثني على رجل ويطريه في المدحة فقال ‏ \"‏ لقد أهلكتم أو قطعتم ظهر الرجل ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 7505,
			"arabicnumber": "3002.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن المثنى، جميعا عن ابن مهدي، - واللفظ لابن المثنى قالا حدثنا عبد الرحمن، عن سفيان، عن حبيب، عن مجاهد، عن أبي معمر، قال قام رجل يثني على أمير من الأمراء فجعل المقداد يحثي عليه التراب وقال أمرنا رسول الله صلى الله عليه وسلم أن نحثي في وجوه المداحين التراب ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 7506,
			"arabicnumber": "3002.02",
			"text": "وحدثنا محمد بن المثنى، ومحمد بن بشار، - واللفظ لابن المثنى - قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن منصور، عن إبراهيم، عن همام بن الحارث، أن رجلا، جعل يمدح عثمان فعمد المقداد فجثا على ركبتيه - وكان رجلا ضخما - فجعل يحثو في وجهه الحصباء فقال له عثمان ما شأنك فقال إن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إذا رأيتم المداحين فاحثوا في وجوههم التراب ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 7507,
			"arabicnumber": "3002.03",
			"text": "وحدثناه محمد بن المثنى، وابن، بشار قالا حدثنا عبد الرحمن، عن سفيان، عن منصور، ح وحدثنا عثمان بن أبي شيبة، حدثنا الأشجعي، عبيد الله بن عبيد الرحمن عن سفيان الثوري، عن الأعمش، ومنصور، عن إبراهيم، عن همام، عن المقداد، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 7508,
			"arabicnumber": "3003",
			"text": "حدثنا نصر بن علي الجهضمي، حدثني أبي، حدثنا صخر، - يعني ابن جويرية - عن نافع، أن عبد الله بن عمر، حدثه أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ أراني في المنام أتسوك بسواك فجذبني رجلان أحدهما أكبر من الآخر فناولت السواك الأصغر منهما فقيل لي كبر ‏.‏ فدفعته إلى الأكبر ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 7509,
			"arabicnumber": "2493.02",
			"text": "حدثنا هارون بن معروف، حدثنا به، سفيان بن عيينة عن هشام، عن أبيه، قال كان أبو هريرة يحدث ويقول اسمعي يا ربة الحجرة اسمعي يا ربة الحجرة ‏.‏ وعائشة تصلي فلما قضت صلاتها قالت لعروة ألا تسمع إلى هذا ومقالته آنفا إنما كان النبي صلى الله عليه وسلم يحدث حديثا لو عده العاد لأحصاه ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 7510,
			"arabicnumber": "3004",
			"text": "حدثنا هداب بن خالد الأزدي، حدثنا همام، عن زيد بن أسلم، عن عطاء بن يسار، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا تكتبوا عني ومن كتب عني غير القرآن فليمحه وحدثوا عني ولا حرج ومن كذب على - قال همام أحسبه قال - متعمدا فليتبوأ مقعده من النار ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 7511,
			"arabicnumber": "3005",
			"text": "حدثنا هداب بن خالد، حدثنا حماد بن سلمة، حدثنا ثابت، عن عبد الرحمن بن، أبي ليلى عن صهيب، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ كان ملك فيمن كان قبلكم وكان له ساحر فلما كبر قال للملك إني قد كبرت فابعث إلى غلاما أعلمه السحر ‏.‏ فبعث إليه غلاما يعلمه فكان في طريقه إذا سلك راهب فقعد إليه وسمع كلامه فأعجبه فكان إذا أتى الساحر مر بالراهب وقعد إليه فإذا أتى الساحر ضربه فشكا ذلك إلى الراهب فقال إذا خشيت الساحر فقل حبسني أهلي ‏.‏ وإذا خشيت أهلك فقل حبسني الساحر ‏.‏ فبينما هو كذلك إذ أتى على دابة عظيمة قد حبست الناس فقال اليوم أعلم آلساحر أفضل أم الراهب أفضل فأخذ حجرا فقال اللهم إن كان أمر الراهب أحب إليك من أمر الساحر فاقتل هذه الدابة حتى يمضي الناس ‏.‏ فرماها فقتلها ومضى الناس فأتى الراهب فأخبره فقال له الراهب أى بنى أنت اليوم أفضل مني ‏.‏ قد بلغ من أمرك ما أرى وإنك ستبتلى فإن ابتليت فلا تدل على ‏.‏ وكان الغلام يبرئ الأكمه والأبرص ويداوي الناس من سائر الأدواء فسمع جليس للملك كان قد عمي فأتاه بهدايا كثيرة فقال ما ها هنا لك أجمع إن أنت شفيتني فقال إني لا أشفي أحدا إنما يشفي الله فإن أنت آمنت بالله دعوت الله فشفاك ‏.‏ فآمن بالله فشفاه الله فأتى الملك فجلس إليه كما كان يجلس فقال له الملك من رد عليك بصرك قال ربي ‏.‏ قال ولك رب غيري قال ربي وربك الله ‏.‏ فأخذه فلم يزل يعذبه حتى دل على الغلام فجيء بالغلام فقال له الملك أى بنى قد بلغ من سحرك ما تبرئ الأكمه والأبرص وتفعل وتفعل ‏.‏ فقال إني لا أشفي أحدا إنما يشفي الله ‏.‏ فأخذه فلم يزل يعذبه حتى دل على الراهب فجيء بالراهب فقيل له ارجع عن دينك ‏.‏ فأبى فدعا بالمئشار فوضع المئشار في مفرق رأسه فشقه حتى وقع شقاه ثم جيء بجليس الملك فقيل له ارجع عن دينك ‏.‏ فأبى فوضع المئشار في مفرق رأسه فشقه به حتى وقع شقاه ثم جيء بالغلام فقيل له ارجع عن دينك ‏.‏ فأبى فدفعه إلى نفر من أصحابه فقال اذهبوا به إلى جبل كذا وكذا فاصعدوا به الجبل فإذا بلغتم ذروته فإن رجع عن دينه وإلا فاطرحوه فذهبوا به فصعدوا به الجبل فقال اللهم اكفنيهم بما شئت ‏.‏ فرجف بهم الجبل فسقطوا وجاء يمشي إلى الملك فقال له الملك ما فعل أصحابك قال كفانيهم الله ‏.‏ فدفعه إلى نفر من أصحابه فقال اذهبوا به فاحملوه في قرقور فتوسطوا به البحر فإن رجع عن دينه وإلا فاقذفوه ‏.‏ فذهبوا به فقال اللهم اكفنيهم بما شئت ‏.‏ فانكفأت بهم السفينة فغرقوا وجاء يمشي إلى الملك فقال له الملك ما فعل أصحابك قال كفانيهم الله ‏.‏ فقال للملك إنك لست بقاتلي حتى تفعل ما آمرك به ‏.‏ قال وما هو قال تجمع الناس في صعيد واحد وتصلبني على جذع ثم خذ سهما من كنانتي ثم ضع السهم في كبد القوس ثم قل باسم الله رب الغلام ‏.‏ ثم ارمني فإنك إذا فعلت ذلك قتلتني ‏.‏ فجمع الناس في صعيد واحد وصلبه على جذع ثم أخذ سهما من كنانته ثم وضع السهم في كبد القوس ثم قال باسم الله رب الغلام ‏.‏ ثم رماه فوقع السهم في صدغه فوضع يده في صدغه في موضع السهم فمات فقال الناس آمنا برب الغلام آمنا برب الغلام آمنا برب الغلام ‏.‏ فأتي الملك فقيل له أرأيت ما كنت تحذر قد والله نزل بك حذرك قد آمن الناس ‏.‏ فأمر بالأخدود في أفواه السكك فخدت وأضرم النيران وقال من لم يرجع عن دينه فأحموه فيها ‏.‏ أو قيل له اقتحم ‏.‏ ففعلوا حتى جاءت امرأة ومعها صبي لها فتقاعست أن تقع فيها فقال لها الغلام يا أمه اصبري فإنك على الحق ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 7520,
			"arabicnumber": "3014",
			"text": "",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 7521,
			"arabicnumber": "2009.03",
			"text": "حدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا زهير، حدثنا أبو إسحاق، قال سمعت البراء بن عازب، يقول جاء أبو بكر الصديق إلى أبي في منزله فاشترى منه رحلا فقال لعازب ابعث معي ابنك يحمله معي إلى منزلي فقال لي أبي احمله ‏.‏ فحملته وخرج أبي معه ينتقد ثمنه فقال له أبي يا أبا بكر حدثني كيف صنعتما ليلة سريت مع رسول الله صلى الله عليه وسلم قال نعم أسرينا ليلتنا كلها حتى قام قائم الظهيرة وخلا الطريق فلا يمر فيه أحد حتى رفعت لنا صخرة طويلة لها ظل لم تأت عليه الشمس بعد فنزلنا عندها فأتيت الصخرة فسويت بيدي مكانا ينام فيه النبي صلى الله عليه وسلم في ظلها ثم بسطت عليه فروة ثم قلت نم يا رسول الله وأنا أنفض لك ما حولك فنام وخرجت أنفض ما حوله فإذا أنا براعي غنم مقبل بغنمه إلى الصخرة يريد منها الذي أردنا فلقيته فقلت لمن أنت يا غلام فقال لرجل من أهل المدينة قلت أفي غنمك لبن قال نعم ‏.‏ قلت أفتحلب لي قال نعم ‏.‏ فأخذ شاة فقلت له انفض الضرع من الشعر والتراب والقذى - قال فرأيت البراء يضرب بيده على الأخرى ينفض - فحلب لي في قعب معه كثبة من لبن قال ومعي إداوة أرتوي فيها للنبي صلى الله عليه وسلم ليشرب منها ويتوضأ - قال - فأتيت النبي صلى الله عليه وسلم وكرهت أن أوقظه من نومه فوافقته استيقظ فصببت على اللبن من الماء حتى برد أسفله فقلت يا رسول الله اشرب من هذا اللبن - قال - فشرب حتى رضيت ثم قال ‏\"‏ ألم يأن للرحيل ‏\"‏ ‏.‏ قلت بلى ‏.‏ قال فارتحلنا بعد ما زالت الشمس واتبعنا سراقة بن مالك - قال - ونحن في جلد من الأرض فقلت يا رسول الله أتينا فقال ‏\"‏ لا تحزن إن الله معنا ‏\"‏ ‏.‏ فدعا عليه رسول الله صلى الله عليه وسلم فارتطمت فرسه إلى بطنها أرى فقال إني قد علمت أنكما قد دعوتما على فادعوا لي فالله لكما أن أرد عنكما الطلب ‏.‏ فدعا الله فنجى فرجع لا يلقى أحدا إلا قال قد كفيتكم ما ها هنا فلا يلقى أحدا إلا رده - قال - ووفى لنا ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 7522,
			"arabicnumber": "2009.04",
			"text": "وحدثنيه زهير بن حرب، حدثنا عثمان بن عمر، ح وحدثناه إسحاق بن إبراهيم، أخبرنا النضر بن شميل، كلاهما عن إسرائيل، عن أبي إسحاق، عن البراء، قال اشترى أبو بكر من أبي رحلا بثلاثة عشر درهما وساق الحديث بمعنى حديث زهير عن أبي إسحاق وقال في حديثه من رواية عثمان بن عمر فلما دنا دعا عليه رسول الله صلى الله عليه وسلم فساخ فرسه في الأرض إلى بطنه ووثب عنه وقال يا محمد قد علمت أن هذا عملك فادع الله أن يخلصني مما أنا فيه ولك على لأعمين على من ورائي وهذه كنانتي فخذ سهما منها فإنك ستمر على إبلي وغلماني بمكان كذا وكذا فخذ منها حاجتك قال ‏\"‏ لا حاجة لي في إبلك ‏\"‏ ‏.‏ فقدمنا المدينة ليلا فتنازعوا أيهم ينزل عليه رسول الله صلى الله عليه وسلم فقال ‏\"‏ أنزل على بني النجار أخوال عبد المطلب أكرمهم بذلك ‏\"‏ ‏.‏ فصعد الرجال والنساء فوق البيوت وتفرق الغلمان والخدم في الطرق ينادون يا محمد يا رسول الله يا محمد يا رسول الله ‏.‏",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 96
			}
		}
	]
}