{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"6": "The Book of Prayer - Travellers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1570,
			"arabicnumber": "685.01",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن صالح بن كيسان، عن عروة بن الزبير، عن عائشة، زوج النبي صلى الله عليه وسلم أنها قالت فرضت الصلاة ركعتين ركعتين في الحضر والسفر فأقرت صلاة السفر وزيد في صلاة الحضر ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1571,
			"arabicnumber": "685.02",
			"text": "وحدثني أبو الطاهر، وحرملة بن يحيى، قالا حدثنا ابن وهب، عن يونس، عن ابن شهاب، قال حدثني عروة بن الزبير، أن عائشة، زوج النبي صلى الله عليه وسلم قالت فرض الله الصلاة حين فرضها ركعتين ثم أتمها في الحضر فأقرت صلاة السفر على الفريضة الأولى ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1572,
			"arabicnumber": "685.03",
			"text": "وحدثني علي بن خشرم، أخبرنا ابن عيينة، عن الزهري، عن عروة، عن عائشة، أن الصلاة، أول ما فرضت ركعتين فأقرت صلاة السفر وأتمت صلاة الحضر ‏.‏ قال الزهري فقلت لعروة ما بال عائشة تتم في السفر قال إنها تأولت كما تأول عثمان ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1573,
			"arabicnumber": "686.01",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب وزهير بن حرب وإسحاق بن إبراهيم قال إسحاق أخبرنا وقال الآخرون، حدثنا عبد الله بن إدريس، عن ابن جريج، عن ابن أبي عمار، عن عبد الله بن بابيه، عن يعلى بن أمية، قال قلت لعمر بن الخطاب ‏{‏ ليس عليكم جناح أن تقصروا، من الصلاة إن خفتم أن يفتنكم الذين كفروا‏}‏ فقد أمن الناس فقال عجبت مما عجبت منه فسألت رسول الله صلى الله عليه وسلم عن ذلك ‏.‏ فقال ‏\"‏ صدقة تصدق الله بها عليكم فاقبلوا صدقته ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1574,
			"arabicnumber": "686.02",
			"text": "وحدثنا محمد بن أبي بكر المقدمي، حدثنا يحيى، عن ابن جريج، قال حدثني عبد الرحمن بن عبد الله بن أبي عمار، عن عبد الله بن بابيه، عن يعلى بن أمية، قال قلت لعمر بن الخطاب ‏.‏ بمثل حديث ابن إدريس ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1575,
			"arabicnumber": "687.01",
			"text": "حدثنا يحيى بن يحيى، وسعيد بن منصور، وأبو الربيع، وقتيبة بن سعيد، قال يحيى أخبرنا وقال الآخرون، حدثنا أبو عوانة، عن بكير بن الأخنس، عن مجاهد، عن ابن عباس، قال فرض الله الصلاة على لسان نبيكم صلى الله عليه وسلم في الحضر أربعا وفي السفر ركعتين وفي الخوف ركعة ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1576,
			"arabicnumber": "687.02",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، جميعا عن القاسم بن مالك، - قال عمرو حدثنا قاسم بن مالك المزني، - حدثنا أيوب بن عائذ الطائي، عن بكير بن الأخنس، عن مجاهد، عن ابن عباس، قال إن الله فرض الصلاة على لسان نبيكم صلى الله عليه وسلم على المسافر ركعتين وعلى المقيم أربعا وفي الخوف ركعة ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1577,
			"arabicnumber": "688.01",
			"text": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، قال سمعت قتادة، يحدث عن موسى بن سلمة الهذلي، قال سألت ابن عباس كيف أصلي إذا كنت بمكة إذا لم أصل مع الإمام ‏.‏ فقال ركعتين سنة أبي القاسم صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1578,
			"arabicnumber": "688.02",
			"text": "وحدثناه محمد بن منهال الضرير، حدثنا يزيد بن زريع، حدثنا سعيد بن أبي عروبة، ح وحدثنا محمد بن المثنى، حدثنا معاذ بن هشام، حدثنا أبي جميعا، عن قتادة، بهذا الإسناد نحوه ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1579,
			"arabicnumber": "689.01",
			"text": "وحدثنا عبد الله بن مسلمة بن قعنب، حدثنا عيسى بن حفص بن عاصم بن عمر بن الخطاب، عن أبيه، قال صحبت ابن عمر في طريق مكة - قال - فصلى لنا الظهر ركعتين ثم أقبل وأقبلنا معه حتى جاء رحله وجلس وجلسنا معه فحانت منه التفاتة نحو حيث صلى فرأى ناسا قياما فقال ما يصنع هؤلاء قلت يسبحون ‏.‏ قال لو كنت مسبحا لأتممت صلاتي يا ابن أخي إني صحبت رسول الله صلى الله عليه وسلم في السفر فلم يزد على ركعتين حتى قبضه الله وصحبت أبا بكر فلم يزد على ركعتين حتى قبضه الله وصحبت عمر فلم يزد على ركعتين حتى قبضه الله ثم صحبت عثمان فلم يزد على ركعتين حتى قبضه الله وقد قال الله ‏{‏ لقد كان لكم في رسول الله أسوة حسنة‏}‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1580,
			"arabicnumber": "689.02",
			"text": "حدثنا قتيبة بن سعيد، حدثنا يزيد، - يعني ابن زريع - عن عمر بن محمد، عن حفص بن عاصم، قال مرضت مرضا فجاء ابن عمر يعودني قال وسألته عن السبحة، في السفر فقال صحبت رسول الله صلى الله عليه وسلم في السفر فما رأيته يسبح ولو كنت مسبحا لأتممت وقد قال الله تعالى ‏{‏ لقد كان لكم في رسول الله إسوة حسنة‏}‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1581,
			"arabicnumber": "690.01",
			"text": "حدثنا خلف بن هشام، وأبو الربيع الزهراني، وقتيبة بن سعيد، قالوا حدثنا حماد، وهو ابن زيد ح وحدثني زهير بن حرب، ويعقوب بن إبراهيم، قالا حدثنا إسماعيل، كلاهما عن أيوب، عن أبي قلابة، عن أنس، أن رسول الله صلى الله عليه وسلم صلى الظهر بالمدينة أربعا وصلى العصر بذي الحليفة ركعتين ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1582,
			"arabicnumber": "690.02",
			"text": "حدثنا سعيد بن منصور، حدثنا سفيان، حدثنا محمد بن المنكدر، وإبراهيم بن ميسرة، سمعا أنس بن مالك، يقول صليت مع رسول الله صلى الله عليه وسلم الظهر بالمدينة أربعا وصليت معه العصر بذي الحليفة ركعتين ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1583,
			"arabicnumber": "691",
			"text": "وحدثناه أبو بكر بن أبي شيبة، ومحمد بن بشار، كلاهما عن غندر، - قال أبو بكر حدثنا محمد بن جعفر، غندر - عن شعبة، عن يحيى بن يزيد الهنائي، قال سألت أنس بن مالك عن قصر الصلاة، فقال كان رسول الله صلى الله عليه وسلم إذا خرج مسيرة ثلاثة أميال أو ثلاثة فراسخ - شعبة الشاك - صلى ركعتين ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1584,
			"arabicnumber": "692.01",
			"text": "حدثنا زهير بن حرب، ومحمد بن بشار، جميعا عن ابن مهدي، - قال زهير حدثنا عبد الرحمن بن مهدي، - حدثنا شعبة، عن يزيد بن خمير، عن حبيب بن عبيد، عن جبير بن نفير، قال خرجت مع شرحبيل بن السمط إلى قرية على رأس سبعة عشر أو ثمانية عشر ميلا فصلى ركعتين ‏.‏ فقلت له فقال رأيت عمر صلى بذي الحليفة ركعتين فقلت له فقال إنما أفعل كما رأيت رسول الله صلى الله عليه وسلم يفعل ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1585,
			"arabicnumber": "692.02",
			"text": "وحدثنيه محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، بهذا الإسناد ‏.‏ وقال عن ابن السمط، ولم يسم شرحبيل وقال إنه أتى أرضا يقال لها دومين من حمص على رأس ثمانية عشر ميلا ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1586,
			"arabicnumber": "693.01",
			"text": "حدثنا يحيى بن يحيى التميمي، أخبرنا هشيم، عن يحيى بن أبي إسحاق، عن أنس بن مالك، قال خرجنا مع رسول الله صلى الله عليه وسلم من المدينة إلى مكة فصلى ركعتين ركعتين حتى رجع ‏.‏ قلت كم أقام بمكة قال عشرا ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1587,
			"arabicnumber": "693.02",
			"text": "وحدثناه قتيبة، حدثنا أبو عوانة، ح وحدثناه أبو كريب، حدثنا ابن علية، جميعا عن يحيى بن أبي إسحاق، عن أنس، عن النبي صلى الله عليه وسلم بمثل حديث هشيم ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1588,
			"arabicnumber": "693.03",
			"text": "وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، قال حدثني يحيى بن أبي إسحاق، قال سمعت أنس بن مالك، يقول خرجنا من المدينة إلى الحج ‏.‏ ثم ذكر مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1589,
			"arabicnumber": "693.04",
			"text": "وحدثنا ابن نمير، حدثنا أبي ح، وحدثنا أبو كريب، حدثنا أبو أسامة، جميعا عن الثوري، عن يحيى بن أبي إسحاق، عن أنس، عن النبي صلى الله عليه وسلم بمثله ولم يذكر الحج ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1590,
			"arabicnumber": "694.01",
			"text": "وحدثني حرملة بن يحيى، حدثنا ابن وهب، أخبرني عمرو، وهو ابن الحارث عن ابن شهاب، عن سالم بن عبد الله، عن أبيه، عن رسول الله صلى الله عليه وسلم أنه صلى صلاة المسافر بمنى وغيره ركعتين وأبو بكر وعمر وعثمان ركعتين صدرا من خلافته ثم أتمها أربعا ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1591,
			"arabicnumber": "694.02",
			"text": "وحدثناه زهير بن حرب، حدثنا الوليد بن مسلم، عن الأوزاعي، ح وحدثناه إسحاق، وعبد بن حميد، قالا أخبرنا عبد الرزاق، أخبرنا معمر، جميعا عن الزهري، بهذا الإسناد قال بمنى ‏.‏ ولم يقل وغيره ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1592,
			"arabicnumber": "694.03",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، حدثنا عبيد الله، عن نافع، عن ابن عمر، قال صلى رسول الله صلى الله عليه وسلم بمنى ركعتين وأبو بكر بعده وعمر بعد أبي بكر وعثمان صدرا من خلافته ثم إن عثمان صلى بعد أربعا ‏.‏ فكان ابن عمر إذا صلى مع الإمام صلى أربعا وإذا صلاها وحده صلى ركعتين ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1593,
			"arabicnumber": "694.04",
			"text": "وحدثناه ابن المثنى، وعبيد الله بن سعيد، قالا حدثنا يحيى، وهو القطان ح وحدثناه أبو كريب، أخبرنا ابن أبي زائدة، ح وحدثناه ابن نمير، حدثنا عقبة بن خالد، كلهم عن عبيد الله، بهذا الإسناد نحوه ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1594,
			"arabicnumber": "694.05",
			"text": "وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن خبيب بن عبد الرحمن، سمع حفص بن عاصم، عن ابن عمر، قال صلى النبي صلى الله عليه وسلم بمنى صلاة المسافر وأبو بكر وعمر وعثمان ثماني سنين أو قال ست سنين ‏.‏ قال حفص وكان ابن عمر يصلي بمنى ركعتين ثم يأتي فراشه ‏.‏ فقلت أى عم لو صليت بعدها ركعتين ‏.‏ قال لو فعلت لأتممت الصلاة ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1595,
			"arabicnumber": "694.06",
			"text": "وحدثناه يحيى بن حبيب، حدثنا خالد يعني ابن الحارث، ح وحدثنا ابن المثنى، قال حدثني عبد الصمد، قالا حدثنا شعبة، بهذا الإسناد ولم يقولا في الحديث بمنى ‏.‏ ولكن قالا صلى في السفر ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1596,
			"arabicnumber": "695.01",
			"text": "حدثنا قتيبة بن سعيد، حدثنا عبد الواحد، عن الأعمش، حدثنا إبراهيم، قال سمعت عبد الرحمن بن يزيد، يقول صلى بنا عثمان بمنى أربع ركعات فقيل ذلك لعبد الله بن مسعود فاسترجع ثم قال صليت مع رسول الله صلى الله عليه وسلم بمنى ركعتين وصليت مع أبي بكر الصديق بمنى ركعتين وصليت مع عمر بن الخطاب بمنى ركعتين فليت حظي من أربع ركعات ركعتان متقبلتان ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1597,
			"arabicnumber": "695.02",
			"text": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، ح وحدثنا عثمان بن أبي شيبة، قال حدثنا جرير، ح وحدثنا إسحاق، وابن، خشرم قالا أخبرنا عيسى، كلهم عن الأعمش، بهذا الإسناد نحوه ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1598,
			"arabicnumber": "696.01",
			"text": "وحدثنا يحيى بن يحيى، وقتيبة، قال يحيى أخبرنا وقال، قتيبة حدثنا أبو الأحوص، عن أبي إسحاق، عن حارثة بن وهب، قال صليت مع رسول الله صلى الله عليه وسلم بمنى - آمن ما كان الناس وأكثره - ركعتين ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1599,
			"arabicnumber": "696.02",
			"text": "حدثنا أحمد بن عبد الله بن يونس، حدثنا زهير، حدثنا أبو إسحاق، حدثني حارثة بن وهب الخزاعي، قال صليت خلف رسول الله صلى الله عليه وسلم بمنى والناس أكثر ما كانوا فصلى ركعتين في حجة الوداع ‏.‏ قال مسلم حارثة بن وهب الخزاعي هو أخو عبيد الله بن عمر بن الخطاب لأمه ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1600,
			"arabicnumber": "697.01",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن نافع، أن ابن عمر، أذن بالصلاة في ليلة ذات برد وريح فقال ألا صلوا في الرحال ‏.‏ ثم قال كان رسول الله صلى الله عليه وسلم يأمر المؤذن إذا كانت ليلة باردة ذات مطر يقول ‏ \"‏ ألا صلوا في الرحال ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1601,
			"arabicnumber": "697.02",
			"text": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا عبيد الله، حدثني نافع، عن ابن عمر، أنه نادى بالصلاة في ليلة ذات برد وريح ومطر فقال في آخر ندائه ألا صلوا في رحالكم ألا صلوا في الرحال ‏.‏ ثم قال إن رسول الله صلى الله عليه وسلم كان يأمر المؤذن إذا كانت ليلة باردة أو ذات مطر في السفر أن يقول ألا صلوا في رحالكم ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1602,
			"arabicnumber": "697.03",
			"text": "وحدثناه أبو بكر بن أبي شيبة، حدثنا أبو أسامة، حدثنا عبيد الله، عن نافع، عن ابن عمر، أنه نادى بالصلاة بضجنان ثم ذكر بمثله وقال ألا صلوا في رحالكم ‏.‏ ولم يعد ثانية ألا صلوا في الرحال ‏.‏ من قول ابن عمر ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1603,
			"arabicnumber": "698",
			"text": "حدثنا يحيى بن يحيى، أخبرنا أبو خيثمة، عن أبي الزبير، عن جابر، ح وحدثنا أحمد بن يونس، قال حدثنا زهير، حدثنا أبو الزبير، عن جابر، قال خرجنا مع رسول الله صلى الله عليه وسلم في سفر فمطرنا فقال ‏ \"‏ ليصل من شاء منكم في رحله ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1604,
			"arabicnumber": "699.01",
			"text": "وحدثني علي بن حجر السعدي، حدثنا إسماعيل، عن عبد الحميد، صاحب الزيادي عن عبد الله بن الحارث، عن عبد الله بن عباس، أنه قال لمؤذنه في يوم مطير إذا قلت أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله فلا تقل حى على الصلاة قل صلوا في بيوتكم - قال - فكأن الناس استنكروا ذاك فقال أتعجبون من ذا قد فعل ذا من هو خير مني إن الجمعة عزمة وإني كرهت أن أحرجكم فتمشوا في الطين والدحض ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1605,
			"arabicnumber": "699.02",
			"text": "وحدثنيه أبو كامل الجحدري، حدثنا حماد، - يعني ابن زيد - عن عبد الحميد، قال سمعت عبد الله بن الحارث، قال خطبنا عبد الله بن عباس في يوم ذي ردغ ‏.‏ وساق الحديث بمعنى حديث ابن علية ولم يذكر الجمعة وقال قد فعله من هو خير مني ‏.‏ يعني النبي صلى الله عليه وسلم وقال أبو كامل حدثنا حماد، عن عاصم، عن عبد الله بن الحارث، بنحوه ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1606,
			"arabicnumber": "699.03",
			"text": "وحدثنيه أبو الربيع العتكي، - هو الزهراني - حدثنا حماد، - يعني ابن زيد - حدثنا أيوب، وعاصم الأحول، بهذا الإسناد ولم يذكر في حديثه يعني النبي صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1607,
			"arabicnumber": "699.04",
			"text": "وحدثني إسحاق بن منصور، أخبرنا ابن شميل، أخبرنا شعبة، حدثنا عبد الحميد، صاحب الزيادي قال سمعت عبد الله بن الحارث، قال أذن مؤذن ابن عباس يوم جمعة في يوم مطير ‏.‏ فذكر نحو حديث ابن علية وقال وكرهت أن تمشوا في الدحض والزلل ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1608,
			"arabicnumber": "699.05",
			"text": "وحدثناه عبد بن حميد، حدثنا سعيد بن عامر، عن شعبة، ح وحدثنا عبد بن حميد، أخبرنا عبد الرزاق، أخبرنا معمر، كلاهما عن عاصم الأحول، عن عبد الله بن الحارث، أن ابن عباس، أمر مؤذنه - في حديث معمر - في يوم جمعة في يوم مطير ‏.‏ بنحو حديثهم وذكر في حديث معمر فعله من هو خير مني ‏.‏ يعني النبي صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1609,
			"arabicnumber": "699.06",
			"text": "وحدثناه عبد بن حميد، حدثنا أحمد بن إسحاق الحضرمي، حدثنا وهيب، حدثنا أيوب، عن عبد الله بن الحارث، - قال وهيب لم يسمعه منه - قال أمر ابن عباس مؤذنه في يوم جمعة في يوم مطير ‏.‏ بنحو حديثهم ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1610,
			"arabicnumber": "700.01",
			"text": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا عبيد الله، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم كان يصلي سبحته حيثما توجهت به ناقته ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1611,
			"arabicnumber": "700.02",
			"text": "وحدثناه أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، عن عبيد الله، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم كان يصلي على راحلته حيث توجهت به ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1612,
			"arabicnumber": "700.03",
			"text": "وحدثني عبيد الله بن عمر القواريري، حدثنا يحيى بن سعيد، عن عبد الملك بن أبي سليمان، قال حدثنا سعيد بن جبير، عن ابن عمر، قال كان رسول الله صلى الله عليه وسلم يصلي وهو مقبل من مكة إلى المدينة على راحلته حيث كان وجهه - قال - وفيه نزلت ‏{‏ فأينما تولوا فثم وجه الله‏}‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1613,
			"arabicnumber": "700.04",
			"text": "وحدثناه أبو كريب، أخبرنا ابن المبارك، وابن أبي زائدة، ح وحدثنا ابن نمير، حدثنا أبي كلهم، عن عبد الملك، بهذا الإسناد نحوه ‏.‏ وفي حديث ابن مبارك وابن أبي زائدة ثم تلا ابن عمر ‏{‏ فأينما تولوا فثم وجه الله‏}‏ وقال في هذا نزلت ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1614,
			"arabicnumber": "700.05",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن عمرو بن يحيى المازني، عن سعيد بن يسار، عن ابن عمر، قال رأيت رسول الله صلى الله عليه وسلم يصلي على حمار وهو موجه إلى خيبر ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1615,
			"arabicnumber": "700.06",
			"text": "وحدثنا يحيى بن يحيى، قال قرأت على مالك عن أبي بكر بن عمر بن عبد الرحمن بن عبد الله بن عمر بن الخطاب، عن سعيد بن يسار، أنه قال كنت أسير مع ابن عمر بطريق مكة - قال سعيد - فلما خشيت الصبح نزلت فأوترت ثم أدركته فقال لي ابن عمر أين كنت فقلت له خشيت الفجر فنزلت فأوترت ‏.‏ فقال عبد الله أليس لك في رسول الله صلى الله عليه وسلم أسوة فقلت بلى والله ‏.‏ قال إن رسول الله صلى الله عليه وسلم كان يوتر على البعير ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1616,
			"arabicnumber": "700.07",
			"text": "وحدثنا يحيى بن يحيى، قال قرأت على مالك عن عبد الله بن دينار، عن ابن عمر، أنه قال كان رسول الله صلى الله عليه وسلم يصلي على راحلته حيثما توجهت به ‏.‏ قال عبد الله بن دينار كان ابن عمر يفعل ذلك ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1617,
			"arabicnumber": "700.08",
			"text": "وحدثني عيسى بن حماد المصري، أخبرنا الليث، حدثني ابن الهاد، عن عبد الله بن دينار، عن عبد الله بن عمر، أنه قال كان رسول الله صلى الله عليه وسلم يوتر على راحلته ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1618,
			"arabicnumber": "700.09",
			"text": "وحدثني حرملة بن يحيى، أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، عن سالم بن عبد الله، عن أبيه، قال كان رسول الله صلى الله عليه وسلم يسبح على الراحلة قبل أى وجه توجه ويوتر عليها غير أنه لا يصلي عليها المكتوبة ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 1619,
			"arabicnumber": "701",
			"text": "وحدثنا عمرو بن سواد، وحرملة، قالا أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، عن عبد الله بن عامر بن ربيعة، أخبره أن أباه أخبره أنه، رأى رسول الله صلى الله عليه وسلم يصلي السبحة بالليل في السفر على ظهر راحلته حيث توجهت ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 1620,
			"arabicnumber": "702",
			"text": "وحدثني محمد بن حاتم، حدثنا عفان بن مسلم، حدثنا همام، حدثنا أنس بن سيرين، قال تلقينا أنس بن مالك حين قدم الشام فتلقيناه بعين التمر فرأيته يصلي على حمار ووجهه ذلك الجانب - وأومأ همام عن يسار القبلة - فقلت له رأيتك تصلي لغير القبلة ‏.‏ قال لولا أني رأيت رسول الله صلى الله عليه وسلم يفعله لم أفعله ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 1621,
			"arabicnumber": "703.01",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن نافع، عن ابن عمر، قال كان رسول الله صلى الله عليه وسلم إذا عجل به السير جمع بين المغرب والعشاء ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 1622,
			"arabicnumber": "703.02",
			"text": "وحدثنا محمد بن المثنى، حدثنا يحيى، عن عبيد الله، قال أخبرني نافع، أن ابن عمر، كان إذا جد به السير جمع بين المغرب والعشاء بعد أن يغيب الشفق ويقول إن رسول الله صلى الله عليه وسلم كان إذا جد به السير جمع بين المغرب والعشاء ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 1623,
			"arabicnumber": "703.03",
			"text": "وحدثنا يحيى بن يحيى، وقتيبة بن سعيد، وأبو بكر بن أبي شيبة وعمرو الناقد كلهم عن ابن عيينة، - قال عمرو حدثنا سفيان، - عن الزهري، عن سالم، عن أبيه، رأيت رسول الله صلى الله عليه وسلم يجمع بين المغرب والعشاء إذا جد به السير ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 1624,
			"arabicnumber": "703.04",
			"text": "وحدثني حرملة بن يحيى، أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، قال أخبرني سالم بن عبد الله، أن أباه، قال رأيت رسول الله صلى الله عليه وسلم إذا أعجله السير في السفر يؤخر صلاة المغرب حتى يجمع بينها وبين صلاة العشاء ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 1625,
			"arabicnumber": "704.01",
			"text": "وحدثنا قتيبة بن سعيد، حدثنا المفضل، - يعني ابن فضالة - عن عقيل، عن ابن شهاب، عن أنس بن مالك، قال كان رسول الله صلى الله عليه وسلم إذا ارتحل قبل أن تزيغ الشمس أخر الظهر إلى وقت العصر ثم نزل فجمع بينهما فإن زاغت الشمس قبل أن يرتحل صلى الظهر ثم ركب ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 1626,
			"arabicnumber": "704.02",
			"text": "وحدثني عمرو الناقد، حدثنا شبابة بن سوار المدايني، حدثنا ليث بن سعد، عن عقيل بن خالد، عن الزهري، عن أنس، قال كان النبي صلى الله عليه وسلم إذا أراد أن يجمع بين الصلاتين في السفر أخر الظهر حتى يدخل أول وقت العصر ثم يجمع بينهما ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 1627,
			"arabicnumber": "704.03",
			"text": "وحدثني أبو الطاهر، وعمرو بن سواد، قالا أخبرنا ابن وهب، حدثني جابر بن إسماعيل، عن عقيل، عن ابن شهاب، عن أنس، عن النبي صلى الله عليه وسلم إذا عجل عليه السفر يؤخر الظهر إلى أول وقت العصر فيجمع بينهما ويؤخر المغرب حتى يجمع بينها وبين العشاء حين يغيب الشفق ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 1628,
			"arabicnumber": "705.01",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن أبي الزبير، عن سعيد بن جبير، عن ابن عباس، قال صلى رسول الله صلى الله عليه وسلم الظهر والعصر جميعا والمغرب والعشاء جميعا في غير خوف ولا سفر ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 1629,
			"arabicnumber": "705.02",
			"text": "وحدثنا أحمد بن يونس، وعون بن سلام، جميعا عن زهير، - قال ابن يونس حدثنا زهير، - حدثنا أبو الزبير، عن سعيد بن جبير، عن ابن عباس، قال صلى رسول الله صلى الله عليه وسلم الظهر والعصر جميعا بالمدينة في غير خوف ولا سفر ‏.‏ قال أبو الزبير فسألت سعيدا لم فعل ذلك فقال سألت ابن عباس كما سألتني فقال أراد أن لا يحرج أحدا من أمته ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 1630,
			"arabicnumber": "705.03",
			"text": "وحدثنا يحيى بن حبيب الحارثي، حدثنا خالد، - يعني ابن الحارث - حدثنا قرة، حدثنا أبو الزبير، حدثنا سعيد بن جبير، حدثنا ابن عباس، أن رسول الله صلى الله عليه وسلم جمع بين الصلاة في سفرة سافرها في غزوة تبوك فجمع بين الظهر والعصر والمغرب والعشاء ‏.‏ قال سعيد فقلت لابن عباس ما حمله على ذلك قال أراد أن لا يحرج أمته ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 1631,
			"arabicnumber": "706.01",
			"text": "حدثنا أحمد بن عبد الله بن يونس، حدثنا زهير، حدثنا أبو الزبير، عن أبي الطفيل، عامر عن معاذ، قال خرجنا مع رسول الله صلى الله عليه وسلم في غزوة تبوك فكان يصلي الظهر والعصر جميعا والمغرب والعشاء جميعا ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 1632,
			"arabicnumber": "706.02",
			"text": "حدثنا يحيى بن حبيب، حدثنا خالد، - يعني ابن الحارث - حدثنا قرة بن خالد، حدثنا أبو الزبير، حدثنا عامر بن واثلة أبو الطفيل، حدثنا معاذ بن جبل، قال جمع رسول الله صلى الله عليه وسلم في غزوة تبوك بين الظهر والعصر وبين المغرب والعشاء ‏.‏ قال فقلت ما حمله على ذلك قال فقال أراد أن لا يحرج أمته ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 1633,
			"arabicnumber": "705.04",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، ح وحدثنا أبو كريب، وأبو سعيد الأشج - واللفظ لأبي كريب - قالا حدثنا وكيع، كلاهما عن الأعمش، عن حبيب بن أبي ثابت، عن سعيد بن جبير، عن ابن عباس، قال جمع رسول الله صلى الله عليه وسلم بين الظهر والعصر والمغرب والعشاء بالمدينة في غير خوف ولا مطر ‏.‏ في حديث وكيع قال قلت لابن عباس لم فعل ذلك قال كى لا يحرج أمته ‏.‏ وفي حديث أبي معاوية قيل لابن عباس ما أراد إلى ذلك قال أراد أن لا يحرج أمته ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 1634,
			"arabicnumber": "705.05",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا سفيان بن عيينة، عن عمرو، عن جابر بن زيد، عن ابن عباس، قال صليت مع النبي صلى الله عليه وسلم ثمانيا جميعا وسبعا جميعا ‏.‏ قلت يا أبا الشعثاء أظنه أخر الظهر وعجل العصر وأخر المغرب وعجل العشاء ‏.‏ قال وأنا أظن ذاك ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 1635,
			"arabicnumber": "705.06",
			"text": "وحدثنا أبو الربيع الزهراني، حدثنا حماد بن زيد، عن عمرو بن دينار، عن جابر بن زيد، عن ابن عباس، أن رسول الله صلى الله عليه وسلم صلى بالمدينة سبعا وثمانيا الظهر والعصر والمغرب والعشاء ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 1636,
			"arabicnumber": "705.07",
			"text": "وحدثني أبو الربيع الزهراني، حدثنا حماد، عن الزبير بن الخريت، عن عبد الله بن شقيق، قال خطبنا ابن عباس يوما بعد العصر حتى غربت الشمس وبدت النجوم وجعل الناس يقولون الصلاة الصلاة - قال - فجاءه رجل من بني تميم لا يفتر ولا ينثني الصلاة الصلاة ‏.‏ فقال ابن عباس أتعلمني بالسنة لا أم لك ‏.‏ ثم قال رأيت رسول الله صلى الله عليه وسلم جمع بين الظهر والعصر والمغرب والعشاء ‏.‏ قال عبد الله بن شقيق فحاك في صدري من ذلك شىء فأتيت أبا هريرة فسألته فصدق مقالته ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 1637,
			"arabicnumber": "705.08",
			"text": "وحدثنا ابن أبي عمر، حدثنا وكيع، حدثنا عمران بن حدير، عن عبد الله بن شقيق العقيلي، قال قال رجل لابن عباس الصلاة فسكت ‏.‏ ثم قال الصلاة ‏.‏ فسكت ثم قال الصلاة فسكت ‏.‏ ثم قال لا أم لك أتعلمنا بالصلاة وكنا نجمع بين الصلاتين على عهد رسول الله صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 1638,
			"arabicnumber": "707.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو معاوية، ووكيع، عن الأعمش، عن عمارة، عن الأسود، عن عبد الله، قال لا يجعلن أحدكم للشيطان من نفسه جزءا لا يرى إلا أن حقا عليه أن لا ينصرف إلا عن يمينه أكثر ما رأيت رسول الله صلى الله عليه وسلم ينصرف عن شماله ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 1639,
			"arabicnumber": "707.02",
			"text": "حدثنا إسحاق بن إبراهيم، أخبرنا جرير، وعيسى بن يونس، ح وحدثناه علي بن خشرم، أخبرنا عيسى، جميعا عن الأعمش، بهذا الإسناد مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 1640,
			"arabicnumber": "708.01",
			"text": "وحدثنا قتيبة بن سعيد، حدثنا أبو عوانة، عن السدي، قال سألت أنسا كيف أنصرف إذا صليت عن يميني أو عن يساري قال أما أنا فأكثر ما رأيت رسول الله صلى الله عليه وسلم ينصرف عن يمينه ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 1641,
			"arabicnumber": "708.02",
			"text": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، قالا حدثنا وكيع، عن سفيان، عن السدي، عن أنس، أن النبي صلى الله عليه وسلم كان ينصرف عن يمينه ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 1642,
			"arabicnumber": "709.01",
			"text": "وحدثنا أبو كريب، أخبرنا ابن أبي زائدة، عن مسعر، عن ثابت بن عبيد، عن ابن البراء، عن البراء، قال كنا إذا صلينا خلف رسول الله صلى الله عليه وسلم أحببنا أن نكون عن يمينه يقبل علينا بوجهه - قال - فسمعته يقول ‏ \"‏ رب قني عذابك يوم تبعث - أو تجمع - عبادك ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 1643,
			"arabicnumber": "709.02",
			"text": "وحدثناه أبو كريب، وزهير بن حرب، قالا حدثنا وكيع، عن مسعر، بهذا الإسناد ولم يذكر يقبل علينا بوجهه ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 1644,
			"arabicnumber": "710.01",
			"text": "وحدثني أحمد بن حنبل، حدثنا محمد بن جعفر، حدثنا شعبة، عن ورقاء، عن عمرو بن دينار، عن عطاء بن يسار، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ إذا أقيمت الصلاة فلا صلاة إلا المكتوبة ‏\"‏ ‏.‏ وحدثنيه محمد بن حاتم وابن رافع قالا حدثنا شبابة حدثني ورقاء بهذا الإسناد ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 1645,
			"arabicnumber": "710.02",
			"text": "وحدثني يحيى بن حبيب الحارثي، حدثنا روح، حدثنا زكرياء بن إسحاق، حدثنا عمرو بن دينار، قال سمعت عطاء بن يسار، يقول عن أبي هريرة، عن النبي صلى الله عليه وسلم أنه قال ‏ \"‏ إذا أقيمت الصلاة فلا صلاة إلا المكتوبة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 1646,
			"arabicnumber": "710.03",
			"text": "وحدثناه عبد بن حميد، أخبرنا عبد الرزاق، أخبرنا زكرياء بن إسحاق، بهذا الإسناد مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 1647,
			"arabicnumber": "710.04",
			"text": "وحدثنا حسن الحلواني، حدثنا يزيد بن هارون، أخبرنا حماد بن زيد، عن أيوب، عن عمرو بن دينار، عن عطاء بن يسار، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏.‏ بمثله ‏.‏ قال حماد ثم لقيت عمرا فحدثني به ولم يرفعه ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 1649,
			"arabicnumber": "711.01",
			"text": "حدثنا عبد الله بن مسلمة القعنبي، حدثنا إبراهيم بن سعد، عن أبيه، عن حفص بن عاصم، عن عبد الله بن مالك ابن بحينة، أن رسول الله صلى الله عليه وسلم مر برجل يصلي وقد أقيمت صلاة الصبح فكلمه بشىء لا ندري ما هو فلما انصرفنا أحطنا نقول ماذا قال لك رسول الله صلى الله عليه وسلم قال قال لي ‏ \"‏ يوشك أن يصلي أحدكم الصبح أربعا ‏\"‏ ‏.‏ قال القعنبي عبد الله بن مالك ابن بحينة عن أبيه ‏.‏ قال أبو الحسين مسلم وقوله عن أبيه في هذا الحديث خطأ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 1650,
			"arabicnumber": "711.02",
			"text": "حدثنا قتيبة بن سعيد، حدثنا أبو عوانة، عن سعد بن إبراهيم، عن حفص بن عاصم، عن ابن بحينة، قال أقيمت صلاة الصبح فرأى رسول الله صلى الله عليه وسلم رجلا يصلي والمؤذن يقيم فقال ‏ \"‏ أتصلي الصبح أربعا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 1651,
			"arabicnumber": "712",
			"text": "حدثنا أبو كامل الجحدري، حدثنا حماد يعني ابن زيد، ح وحدثني حامد بن عمر البكراوي، حدثنا عبد الواحد يعني ابن زياد، ح وحدثنا ابن نمير، حدثنا أبو معاوية، كلهم عن عاصم، ح وحدثني زهير بن حرب، - واللفظ له - حدثنا مروان بن معاوية الفزاري، عن عاصم الأحول، عن عبد الله بن سرجس، قال دخل رجل المسجد ورسول الله صلى الله عليه وسلم في صلاة الغداة فصلى ركعتين في جانب المسجد ثم دخل مع رسول الله صلى الله عليه وسلم فلما سلم رسول الله صلى الله عليه وسلم قال ‏ \"‏ يا فلان بأى الصلاتين اعتددت أبصلاتك وحدك أم بصلاتك معنا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 1652,
			"arabicnumber": "713.01",
			"text": "حدثنا يحيى بن يحيى، أخبرنا سليمان بن بلال، عن ربيعة بن أبي عبد الرحمن، عن عبد الملك بن سعيد، عن أبي حميد، - أو عن أبي أسيد، - قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا دخل أحدكم المسجد فليقل اللهم افتح لي أبواب رحمتك ‏.‏ وإذا خرج فليقل اللهم إني أسألك من فضلك ‏\"‏ ‏.‏ قال مسلم سمعت يحيى بن يحيى يقول كتبت هذا الحديث من كتاب سليمان بن بلال ‏.‏ قال بلغني أن يحيى الحماني يقول وأبي أسيد ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 1653,
			"arabicnumber": "713.02",
			"text": "وحدثنا حامد بن عمر البكراوي، حدثنا بشر بن المفضل، حدثنا عمارة بن غزية، عن ربيعة بن أبي عبد الرحمن، عن عبد الملك بن سعيد بن سويد الأنصاري، عن أبي حميد، أو عن أبي أسيد، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 1654,
			"arabicnumber": "714.01",
			"text": "حدثنا عبد الله بن مسلمة بن قعنب، وقتيبة بن سعيد، قالا حدثنا مالك، ح وحدثنا يحيى بن يحيى، قال قرأت على مالك عن عامر بن عبد الله بن الزبير، عن عمرو بن سليم الزرقي، عن أبي قتادة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إذا دخل أحدكم المسجد فليركع ركعتين قبل أن يجلس ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 1655,
			"arabicnumber": "714.02",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، قال حدثني عمرو بن يحيى الأنصاري، حدثني محمد بن يحيى بن حبان، عن عمرو بن سليم بن خلدة الأنصاري، عن أبي قتادة، صاحب رسول الله صلى الله عليه وسلم قال دخلت المسجد ورسول الله صلى الله عليه وسلم جالس بين ظهرانى الناس - قال - فجلست فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما منعك أن تركع ركعتين قبل أن تجلس ‏\"‏ ‏.‏ قال فقلت يا رسول الله رأيتك جالسا والناس جلوس ‏.‏ قال ‏\"‏ فإذا دخل أحدكم المسجد فلا يجلس حتى يركع ركعتين ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 1656,
			"arabicnumber": "715.01",
			"text": "حدثنا أحمد بن جواس الحنفي أبو عاصم، حدثنا عبيد الله الأشجعي، عن سفيان، عن محارب بن دثار، عن جابر بن عبد الله، قال كان لي على النبي صلى الله عليه وسلم دين فقضاني وزادني ودخلت عليه المسجد فقال لي ‏ \"‏ صل ركعتين ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 1657,
			"arabicnumber": "715.02",
			"text": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن محارب، سمع جابر بن عبد الله، يقول اشترى مني رسول الله صلى الله عليه وسلم بعيرا فلما قدم المدينة أمرني أن آتي المسجد فأصلي ركعتين ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 1658,
			"arabicnumber": "715.03",
			"text": "وحدثني محمد بن المثنى، حدثنا عبد الوهاب، - يعني الثقفي - حدثنا عبيد الله، عن وهب بن كيسان، عن جابر بن عبد الله، قال خرجت مع رسول الله صلى الله عليه وسلم في غزاة فأبطأ بي جملي وأعيى ثم قدم رسول الله صلى الله عليه وسلم قبلي وقدمت بالغداة فجئت المسجد فوجدته على باب المسجد قال ‏\"‏ الآن حين قدمت ‏\"‏ ‏.‏ قلت نعم ‏.‏ قال ‏\"‏ فدع جملك وادخل فصل ركعتين ‏\"‏ ‏.‏ قال فدخلت فصليت ثم رجعت ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 1659,
			"arabicnumber": "716",
			"text": "حدثنا محمد بن المثنى، حدثنا الضحاك يعني أبا عاصم، ح وحدثني محمود بن غيلان، حدثنا عبد الرزاق، قالا جميعا أخبرنا ابن جريج، أخبرني ابن شهاب، أن عبد الرحمن بن عبد الله بن كعب، أخبره عن أبيه عبد الله بن كعب، وعن عمه، عبيد الله بن كعب عن كعب بن مالك، أن رسول الله صلى الله عليه وسلم كان لا يقدم من سفر إلا نهارا في الضحى فإذا قدم بدأ بالمسجد فصلى فيه ركعتين ثم جلس فيه ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 1660,
			"arabicnumber": "717.01",
			"text": "وحدثنا يحيى بن يحيى، أخبرنا يزيد بن زريع، عن سعيد الجريري، عن عبد الله بن شقيق، قال قلت لعائشة هل كان النبي صلى الله عليه وسلم يصلي الضحى قالت لا إلا أن يجيء من مغيبه ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 1661,
			"arabicnumber": "717.02",
			"text": "وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا كهمس بن الحسن القيسي، عن عبد الله بن شقيق، قال قلت لعائشة أكان النبي صلى الله عليه وسلم يصلي الضحى قالت لا إلا أن يجيء من مغيبه",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 1662,
			"arabicnumber": "718",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن ابن شهاب، عن عروة، عن عائشة، أنها قالت ما رأيت رسول الله صلى الله عليه وسلم يصلي سبحة الضحى قط ‏.‏ وإني لأسبحها وإن كان رسول الله صلى الله عليه وسلم ليدع العمل وهو يحب أن يعمل به خشية أن يعمل به الناس فيفرض عليهم ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 1663,
			"arabicnumber": "719.01",
			"text": "حدثنا شيبان بن فروخ، حدثنا عبد الوارث، حدثنا يزيد، - يعني الرشك - حدثتني معاذة، أنها سألت عائشة - رضى الله عنها - كم كان رسول الله صلى الله عليه وسلم يصلي صلاة الضحى قالت أربع ركعات ويزيد ما شاء ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 1664,
			"arabicnumber": "719.02",
			"text": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن يزيد، بهذا الإسناد ‏.‏ مثله وقال يزيد ما شاء الله ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 1665,
			"arabicnumber": "719.03",
			"text": "وحدثني يحيى بن حبيب الحارثي، حدثنا خالد بن الحارث، عن سعيد، حدثنا قتادة، أن معاذة العدوية، حدثتهم عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يصلي الضحى أربعا ويزيد ما شاء الله ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 1666,
			"arabicnumber": "719.04",
			"text": "وحدثنا إسحاق بن إبراهيم، وابن، بشار جميعا عن معاذ بن هشام، قال حدثني أبي، عن قتادة، بهذا الإسناد مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 1667,
			"arabicnumber": "336.04",
			"text": "وحدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن عمرو بن مرة، عن عبد الرحمن بن أبي ليلى، قال ما أخبرني أحد، أنه رأى النبي صلى الله عليه وسلم يصلي الضحى إلا أم هانئ فإنها حدثت أن النبي صلى الله عليه وسلم دخل بيتها يوم فتح مكة فصلى ثماني ركعات ما رأيته صلى صلاة قط أخف منها غير أنه كان يتم الركوع والسجود ‏.‏ ولم يذكر ابن بشار في حديثه قوله قط ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 1668,
			"arabicnumber": "336.05",
			"text": "وحدثني حرملة بن يحيى، ومحمد بن سلمة المرادي، قالا أخبرنا عبد الله بن وهب، أخبرني يونس، عن ابن شهاب، قال حدثني ابن عبد الله بن الحارث، أن أباه عبد الله بن الحارث بن نوفل، قال سألت وحرصت على أن أجد أحدا من الناس يخبرني أن رسول الله صلى الله عليه وسلم سبح سبحة الضحى فلم أجد أحدا يحدثني ذلك غير أن أم هانئ بنت أبي طالب أخبرتني أن رسول الله صلى الله عليه وسلم أتى بعد ما ارتفع النهار يوم الفتح فأتي بثوب فستر عليه فاغتسل ثم قام فركع ثماني ركعات لا أدري أقيامه فيها أطول أم ركوعه أم سجوده كل ذلك منه متقارب - قالت - فلم أره سبحها قبل ولا بعد ‏.‏ قال المرادي عن يونس ‏.‏ ولم يقل أخبرني ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 1669,
			"arabicnumber": "336.06",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن أبي النضر، أن أبا مرة، مولى أم هانئ بنت أبي طالب أخبره أنه، سمع أم هانئ بنت أبي طالب، تقول ذهبت إلى رسول الله صلى الله عليه وسلم عام الفتح فوجدته يغتسل وفاطمة ابنته تستره بثوب - قالت - فسلمت فقال ‏\"‏ من هذه ‏\"‏ ‏.‏ قلت أم هانئ بنت أبي طالب ‏.‏ قال ‏\"‏ مرحبا بأم هانئ ‏\"‏ ‏.‏ فلما فرغ من غسله قام فصلى ثماني ركعات ملتحفا في ثوب واحد ‏.‏ فلما انصرف قلت يا رسول الله زعم ابن أمي علي بن أبي طالب أنه قاتل رجلا أجرته فلان بن هبيرة ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ قد أجرنا من أجرت يا أم هانئ ‏\"‏ ‏.‏ قالت أم هانئ وذلك ضحى ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 1670,
			"arabicnumber": "336.07",
			"text": "وحدثني حجاج بن الشاعر، حدثنا معلى بن أسد، حدثنا وهيب بن خالد، عن جعفر بن محمد، عن أبيه، عن أبي مرة، مولى عقيل عن أم هانئ، أن رسول الله صلى الله عليه وسلم صلى في بيتها عام الفتح ثماني ركعات في ثوب واحد قد خالف بين طرفيه ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 1671,
			"arabicnumber": "720",
			"text": "حدثنا عبد الله بن محمد بن أسماء الضبعي، حدثنا مهدي، - وهو ابن ميمون - حدثنا واصل، مولى أبي عيينة عن يحيى بن عقيل، عن يحيى بن يعمر، عن أبي الأسود الدؤلي، عن أبي ذر، عن النبي صلى الله عليه وسلم أنه قال ‏ \"‏ يصبح على كل سلامى من أحدكم صدقة فكل تسبيحة صدقة وكل تحميدة صدقة وكل تهليلة صدقة وكل تكبيرة صدقة وأمر بالمعروف صدقة ونهى عن المنكر صدقة ويجزئ من ذلك ركعتان يركعهما من الضحى ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 1672,
			"arabicnumber": "721.01",
			"text": "حدثنا شيبان بن فروخ، حدثنا عبد الوارث، حدثنا أبو التياح، حدثني أبو عثمان النهدي، عن أبي هريرة، قال أوصاني خليلي صلى الله عليه وسلم بثلاث بصيام ثلاثة أيام من كل شهر وركعتى الضحى وأن أوتر قبل أن أرقد ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 1673,
			"arabicnumber": "721.02",
			"text": "وحدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن عباس الجريري، وأبي، شمر الضبعي قالا سمعنا أبا عثمان النهدي، يحدث عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏.‏ بمثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 1674,
			"arabicnumber": "721.03",
			"text": "وحدثني سليمان بن معبد، حدثنا معلى بن أسد، حدثنا عبد العزيز بن مختار، عن عبد الله الداناج، قال حدثني أبو رافع الصائغ، قال سمعت أبا هريرة، قال أوصاني خليلي أبو القاسم صلى الله عليه وسلم بثلاث ‏.‏ فذكر مثل حديث أبي عثمان عن أبي هريرة ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 1675,
			"arabicnumber": "722",
			"text": "وحدثني هارون بن عبد الله، ومحمد بن رافع، قالا حدثنا ابن أبي فديك، عن الضحاك بن عثمان، عن إبراهيم بن عبد الله بن حنين، عن أبي مرة، مولى أم هانئ عن أبي الدرداء، قال أوصاني حبيبي صلى الله عليه وسلم بثلاث لن أدعهن ما عشت بصيام ثلاثة أيام من كل شهر وصلاة الضحى وبأن لا أنام حتى أوتر ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 1676,
			"arabicnumber": "723.01",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن نافع، عن ابن عمر، أن حفصة أم المؤمنين، أخبرته أن رسول الله صلى الله عليه وسلم كان إذا سكت المؤذن من الأذان لصلاة الصبح وبدا الصبح ركع ركعتين خفيفتين قبل أن تقام الصلاة ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 1677,
			"arabicnumber": "723.02",
			"text": "وحدثنا يحيى بن يحيى، وقتيبة، وابن، رمح عن الليث بن سعد، ح وحدثني زهير بن حرب، وعبيد الله بن سعيد، قالا حدثنا يحيى، عن عبيد الله، ح وحدثني زهير بن حرب، حدثنا إسماعيل، عن أيوب، كلهم عن نافع، بهذا الإسناد كما قال مالك ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 1678,
			"arabicnumber": "723.03",
			"text": "وحدثني أحمد بن عبد الله بن الحكم، حدثنا محمد بن جعفر، حدثنا شعبة، عن زيد بن محمد، قال سمعت نافعا، يحدث عن ابن عمر، عن حفصة، قالت كان رسول الله صلى الله عليه وسلم إذا طلع الفجر لا يصلي إلا ركعتين خفيفتين ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 1679,
			"arabicnumber": "723.04",
			"text": "وحدثناه إسحاق بن إبراهيم، أخبرنا النضر، حدثنا شعبة، بهذا الإسناد مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 1680,
			"arabicnumber": "723.05",
			"text": "حدثنا محمد بن عباد، حدثنا سفيان، عن عمرو، عن الزهري، عن سالم، عن أبيه، أخبرتني حفصة، أن النبي صلى الله عليه وسلم كان إذا أضاء له الفجر صلى ركعتين ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 1681,
			"arabicnumber": "724.01",
			"text": "حدثنا عمرو الناقد، حدثنا عبدة بن سليمان، حدثنا هشام بن عروة، عن أبيه، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يصلي ركعتى الفجر إذا سمع الأذان ويخففهما ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 1682,
			"arabicnumber": "724.02",
			"text": "وحدثنيه علي بن حجر، حدثنا علي يعني ابن مسهر، ح وحدثناه أبو كريب، حدثنا أبو أسامة، ح وحدثناه أبو بكر، وأبو كريب وابن نمير عن عبد الله بن نمير، ح وحدثناه عمرو الناقد، حدثنا وكيع، كلهم عن هشام، بهذا الإسناد وفي حديث أبي أسامة إذا طلع الفجر ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 1683,
			"arabicnumber": "724.03",
			"text": "وحدثناه محمد بن المثنى، حدثنا ابن أبي عدي، عن هشام، عن يحيى، عن أبي سلمة، عن عائشة، أن نبي الله صلى الله عليه وسلم كان يصلي ركعتين بين النداء والإقامة من صلاة الصبح ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 1684,
			"arabicnumber": "724.04",
			"text": "وحدثنا محمد بن المثنى، حدثنا عبد الوهاب، قال سمعت يحيى بن سعيد، قال أخبرني محمد بن عبد الرحمن، أنه سمع عمرة، تحدث عن عائشة، أنها كانت تقول كان رسول الله صلى الله عليه وسلم يصلي ركعتى الفجر فيخفف حتى إني أقول هل قرأ فيهما بأم القرآن ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 1685,
			"arabicnumber": "724.05",
			"text": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن محمد بن عبد الرحمن الأنصاري، سمع عمرة بنت عبد الرحمن، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم إذا طلع الفجر صلى ركعتين أقول هل يقرأ فيهما بفاتحة الكتاب ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 1686,
			"arabicnumber": "724.06",
			"text": "وحدثني زهير بن حرب، حدثنا يحيى بن سعيد، عن ابن جريج، قال حدثني عطاء، عن عبيد بن عمير، عن عائشة، أن النبي صلى الله عليه وسلم لم يكن على شىء من النوافل أشد معاهدة منه على ركعتين قبل الصبح ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 1687,
			"arabicnumber": "724.07",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وابن، نمير جميعا عن حفص بن غياث، - قال ابن نمير حدثنا حفص، - عن ابن جريج، عن عطاء، عن عبيد بن عمير، عن عائشة، قالت ما رأيت رسول الله صلى الله عليه وسلم في شىء من النوافل أسرع منه إلى الركعتين قبل الفجر ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 1688,
			"arabicnumber": "725.01",
			"text": "حدثنا محمد بن عبيد الغبري، حدثنا أبو عوانة، عن قتادة، عن زرارة بن أوفى، عن سعد بن هشام، عن عائشة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ ركعتا الفجر خير من الدنيا وما فيها ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 1689,
			"arabicnumber": "725.02",
			"text": "وحدثنا يحيى بن حبيب، حدثنا معتمر، قال قال أبي حدثنا قتادة، عن زرارة، عن سعد بن هشام، عن عائشة، عن النبي صلى الله عليه وسلم أنه قال في شأن الركعتين عند طلوع الفجر ‏ \"‏ لهما أحب إلى من الدنيا جميعا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 1690,
			"arabicnumber": "726",
			"text": "حدثني محمد بن عباد، وابن أبي عمر، قالا حدثنا مروان بن معاوية، عن يزيد، - هو ابن كيسان - عن أبي حازم، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قرأ في ركعتى الفجر ‏{‏ قل يا أيها الكافرون‏}‏ و ‏{‏ قل هو الله أحد‏}‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 1691,
			"arabicnumber": "727.01",
			"text": "وحدثنا قتيبة بن سعيد، حدثنا الفزاري، - يعني مروان بن معاوية - عن عثمان بن حكيم الأنصاري، قال أخبرني سعيد بن يسار، أن ابن عباس، أخبره أن رسول الله صلى الله عليه وسلم كان يقرأ في ركعتى الفجر في الأولى منهما ‏{‏ قولوا آمنا بالله وما أنزل إلينا‏}‏ الآية التي في البقرة وفي الآخرة منهما ‏{‏ آمنا بالله واشهد بأنا مسلمون‏}‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 1692,
			"arabicnumber": "727.02",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، عن عثمان بن حكيم، عن سعيد بن يسار، عن ابن عباس، قال كان رسول الله صلى الله عليه وسلم يقرأ في ركعتى الفجر ‏{‏ قولوا آمنا بالله وما أنزل إلينا‏}‏ والتي في آل عمران ‏{‏ تعالوا إلى كلمة سواء بيننا وبينكم‏}‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 1693,
			"arabicnumber": "727.03",
			"text": "وحدثني علي بن خشرم، أخبرنا عيسى بن يونس، عن عثمان بن حكيم، في هذا الإسناد ‏.‏ بمثل حديث مروان الفزاري ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 1694,
			"arabicnumber": "728.01",
			"text": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبو خالد، - يعني سليمان بن حيان - عن داود بن أبي هند، عن النعمان بن سالم، عن عمرو بن أوس، قال حدثني عنبسة بن أبي سفيان، في مرضه الذي مات فيه بحديث يتسار إليه قال سمعت أم حبيبة تقول سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ من صلى اثنتى عشرة ركعة في يوم وليلة بني له بهن بيت في الجنة ‏\"‏ ‏.‏ قالت أم حبيبة فما تركتهن منذ سمعتهن من رسول الله صلى الله عليه وسلم ‏.‏ وقال عنبسة فما تركتهن منذ سمعتهن من أم حبيبة ‏.‏ وقال عمرو بن أوس ما تركتهن منذ سمعتهن من عنبسة ‏.‏ وقال النعمان بن سالم ما تركتهن منذ سمعتهن من عمرو بن أوس ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 1695,
			"arabicnumber": "728.02",
			"text": "حدثني أبو غسان المسمعي، حدثنا بشر بن المفضل، حدثنا داود، عن النعمان بن سالم، بهذا الإسناد ‏ \"‏ من صلى في يوم ثنتى عشرة سجدة تطوعا بني له بيت في الجنة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 1696,
			"arabicnumber": "728.03",
			"text": "وحدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن النعمان بن سالم، عن عمرو بن أوس، عن عنبسة بن أبي سفيان، عن أم حبيبة، زوج النبي صلى الله عليه وسلم أنها قالت سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ ما من عبد مسلم يصلي لله كل يوم ثنتى عشرة ركعة تطوعا غير فريضة إلا بنى الله له بيتا في الجنة أو إلا بني له بيت في الجنة ‏\"‏ ‏.‏ قالت أم حبيبة فما برحت أصليهن بعد ‏.‏ وقال عمرو ما برحت أصليهن بعد ‏.‏ وقال النعمان مثل ذلك ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 1697,
			"arabicnumber": "728.04",
			"text": "وحدثني عبد الرحمن بن بشر، وعبد الله بن هاشم العبدي، قالا حدثنا بهز، حدثنا شعبة، قال النعمان بن سالم أخبرني قال سمعت عمرو بن أوس، يحدث عن عنبسة، عن أم حبيبة، قالت قال رسول الله صلى الله عليه وسلم ‏ \"‏ ما من عبد مسلم توضأ فأسبغ الوضوء ثم صلى لله كل يوم ‏\"‏ ‏.‏ فذكر بمثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 1698,
			"arabicnumber": "729",
			"text": "وحدثني زهير بن حرب، وعبيد الله بن سعيد، قالا حدثنا يحيى، - وهو ابن سعيد - عن عبيد الله، قال أخبرني نافع، عن ابن عمر، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، حدثنا عبيد الله، عن نافع، عن ابن عمر، قال صليت مع رسول الله صلى الله عليه وسلم قبل الظهر سجدتين وبعدها سجدتين وبعد المغرب سجدتين وبعد العشاء سجدتين وبعد الجمعة سجدتين فأما المغرب والعشاء والجمعة فصليت مع النبي صلى الله عليه وسلم في بيته ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 1699,
			"arabicnumber": "730.01",
			"text": "حدثنا يحيى بن يحيى، أخبرنا هشيم، عن خالد، عن عبد الله بن شقيق، قال سألت عائشة عن صلاة، رسول الله صلى الله عليه وسلم عن تطوعه فقالت كان يصلي في بيتي قبل الظهر أربعا ثم يخرج فيصلي بالناس ثم يدخل فيصلي ركعتين وكان يصلي بالناس المغرب ثم يدخل فيصلي ركعتين ويصلي بالناس العشاء ويدخل بيتي فيصلي ركعتين وكان يصلي من الليل تسع ركعات فيهن الوتر وكان يصلي ليلا طويلا قائما وليلا طويلا قاعدا وكان إذا قرأ وهو قائم ركع وسجد وهو قائم وإذا قرأ قاعدا ركع وسجد وهو قاعد وكان إذا طلع الفجر صلى ركعتين ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 1700,
			"arabicnumber": "730.02",
			"text": "حدثنا قتيبة بن سعيد، حدثنا حماد، عن بديل، وأيوب، عن عبد الله بن شقيق، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يصلي ليلا طويلا فإذا صلى قائما ركع قائما وإذا صلى قاعدا ركع قاعدا ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 1701,
			"arabicnumber": "730.03",
			"text": "وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، عن بديل، عن عبد الله بن شقيق، قال كنت شاكيا بفارس فكنت أصلي قاعدا فسألت عن ذلك عائشة فقالت كان رسول الله صلى الله عليه وسلم يصلي ليلا طويلا قائما ‏.‏ فذكر الحديث ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 1702,
			"arabicnumber": "730.04",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا معاذ بن معاذ، عن حميد، عن عبد الله بن شقيق العقيلي، قال سألت عائشة عن صلاة، رسول الله صلى الله عليه وسلم بالليل فقالت كان يصلي ليلا طويلا قائما وليلا طويلا قاعدا وكان إذا قرأ قائما ركع قائما وإذا قرأ قاعدا ركع قاعدا ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 1703,
			"arabicnumber": "730.05",
			"text": "وحدثنا يحيى بن يحيى، أخبرنا أبو معاوية، عن هشام بن حسان، عن محمد بن سيرين، عن عبد الله بن شقيق العقيلي، قال سألنا عائشة عن صلاة، رسول الله صلى الله عليه وسلم فقالت كان رسول الله صلى الله عليه وسلم يكثر الصلاة قائما وقاعدا فإذا افتتح الصلاة قائما ركع قائما وإذا افتتح الصلاة قاعدا ركع قاعدا ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 1704,
			"arabicnumber": "731.01",
			"text": "وحدثني أبو الربيع الزهراني، أخبرنا حماد يعني ابن زيد، ح قال وحدثنا حسن بن الربيع، حدثنا مهدي بن ميمون، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، ح وحدثنا أبو كريب، حدثنا ابن نمير، جميعا عن هشام بن عروة، ح وحدثني زهير بن حرب، - واللفظ له - قال حدثنا يحيى بن سعيد، عن هشام بن عروة، قال أخبرني أبي، عن عائشة، قالت ما رأيت رسول الله صلى الله عليه وسلم يقرأ في شىء من صلاة الليل جالسا حتى إذا كبر قرأ جالسا حتى إذا بقي عليه من السورة ثلاثون أو أربعون آية قام فقرأهن ثم ركع ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 1705,
			"arabicnumber": "731.02",
			"text": "وحدثنا يحيى بن يحيى، قال قرأت على مالك عن عبد الله بن يزيد، وأبي النضر، عن أبي سلمة بن عبد الرحمن، عن عائشة، أن رسول الله صلى الله عليه وسلم كان يصلي جالسا فيقرأ وهو جالس فإذا بقي من قراءته قدر ما يكون ثلاثين أو أربعين آية قام فقرأ وهو قائم ثم ركع ثم سجد ثم يفعل في الركعة الثانية مثل ذلك ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 1706,
			"arabicnumber": "731.03",
			"text": "حدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، قال أبو بكر حدثنا إسماعيل ابن علية، عن الوليد بن أبي هشام، عن أبي بكر بن محمد، عن عمرة، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يقرأ وهو قاعد فإذا أراد أن يركع قام قدر ما يقرأ إنسان أربعين آية ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 1707,
			"arabicnumber": "731.04",
			"text": "وحدثنا ابن نمير، حدثنا محمد بن بشر، حدثنا محمد بن عمرو، حدثني محمد بن إبراهيم، عن علقمة بن وقاص، قال قلت لعائشة كيف كان يصنع رسول الله صلى الله عليه وسلم في الركعتين وهو جالس قالت كان يقرأ فيهما فإذا أراد أن يركع قام فركع ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 1708,
			"arabicnumber": "732.01",
			"text": "وحدثنا يحيى بن يحيى، أخبرنا يزيد بن زريع، عن سعيد الجريري، عن عبد الله بن شقيق، قال قلت لعائشة هل كان النبي صلى الله عليه وسلم يصلي وهو قاعد قالت نعم بعد ما حطمه الناس ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 1709,
			"arabicnumber": "732.02",
			"text": "وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا كهمس، عن عبد الله بن شقيق، قال قلت لعائشة ‏.‏ فذكر عن النبي صلى الله عليه وسلم بمثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 1710,
			"arabicnumber": "732.03",
			"text": "وحدثني محمد بن حاتم، وهارون بن عبد الله، قالا حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني عثمان بن أبي سليمان، أن أبا سلمة بن عبد الرحمن، أخبره أن عائشة أخبرته أن النبي صلى الله عليه وسلم لم يمت حتى كان كثير من صلاته وهو جالس ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 1711,
			"arabicnumber": "732.04",
			"text": "وحدثني محمد بن حاتم، وحسن الحلواني، كلاهما عن زيد، قال حسن حدثنا زيد بن الحباب، حدثني الضحاك بن عثمان، حدثني عبد الله بن عروة، عن أبيه، عن عائشة، قالت لما بدن رسول الله صلى الله عليه وسلم وثقل كان أكثر صلاته جالسا ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 1712,
			"arabicnumber": "733.01",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن ابن شهاب، عن السائب بن يزيد، عن المطلب بن أبي وداعة السهمي، عن حفصة، أنها قالت ما رأيت رسول الله صلى الله عليه وسلم صلى في سبحته قاعدا حتى كان قبل وفاته بعام فكان يصلي في سبحته قاعدا وكان يقرأ بالسورة فيرتلها حتى تكون أطول من أطول منها ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 1713,
			"arabicnumber": "733.02",
			"text": "وحدثني أبو الطاهر، وحرملة، قالا أخبرنا ابن وهب، أخبرني يونس، ح وحدثنا إسحاق بن إبراهيم، وعبد بن حميد، قالا أخبرنا عبد الرزاق، أخبرنا معمر، جميعا عن الزهري، بهذا الإسناد ‏.‏ مثله غير أنهما قالا بعام واحد أو اثنين ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 1714,
			"arabicnumber": "734",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا عبيد الله بن موسى، عن حسن بن صالح، عن سماك، قال أخبرني جابر بن سمرة، أن النبي صلى الله عليه وسلم لم يمت حتى صلى قاعدا ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 1715,
			"arabicnumber": "735.01",
			"text": "وحدثني زهير بن حرب، حدثنا جرير، عن منصور، عن هلال بن يساف، عن أبي يحيى، عن عبد الله بن عمرو، قال حدثت أن رسول الله صلى الله عليه وسلم قال ‏\"‏ صلاة الرجل قاعدا نصف الصلاة ‏\"‏ ‏.‏ قال فأتيته فوجدته يصلي جالسا فوضعت يدي على رأسه فقال ما لك يا عبد الله بن عمرو قلت حدثت يا رسول الله أنك قلت ‏\"‏ صلاة الرجل قاعدا على نصف الصلاة ‏\"‏ ‏.‏ وأنت تصلي قاعدا قال ‏\"‏ أجل ولكني لست كأحد منكم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 1716,
			"arabicnumber": "735.02",
			"text": "وحدثناه أبو بكر بن أبي شيبة، ومحمد بن المثنى، وابن، بشار جميعا عن محمد بن جعفر، عن شعبة، ح وحدثنا ابن المثنى، حدثنا يحيى بن سعيد، حدثنا سفيان، كلاهما عن منصور، بهذا الإسناد وفي رواية شعبة عن أبي يحيى الأعرج، ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 1717,
			"arabicnumber": "736.01",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن ابن شهاب، عن عروة، عن عائشة، أن رسول الله صلى الله عليه وسلم كان يصلي بالليل إحدى عشرة ركعة يوتر منها بواحدة فإذا فرغ منها اضطجع على شقه الأيمن حتى يأتيه المؤذن فيصلي ركعتين خفيفتين ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 1720,
			"arabicnumber": "737.01",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا عبد الله بن نمير، ح وحدثنا ابن نمير، حدثنا أبي، حدثنا هشام، عن أبيه، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يصلي من الليل ثلاث عشرة ركعة يوتر من ذلك بخمس لا يجلس في شىء إلا في آخرها ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 1721,
			"arabicnumber": "737.02",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا عبدة بن سليمان، ح وحدثناه أبو كريب، حدثنا وكيع، وأبو أسامة كلهم عن هشام، بهذا الإسناد ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 1722,
			"arabicnumber": "737.03",
			"text": "وحدثنا قتيبة بن سعيد، حدثنا ليث، عن يزيد بن أبي حبيب، عن عراك بن مالك، عن عروة، أن عائشة، أخبرته أن رسول الله صلى الله عليه وسلم كان يصلي ثلاث عشرة ركعة بركعتى الفجر ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 1723,
			"arabicnumber": "738.01",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن سعيد بن أبي سعيد المقبري، عن أبي سلمة بن عبد الرحمن، أنه سأل عائشة كيف كانت صلاة رسول الله صلى الله عليه وسلم في رمضان قالت ما كان رسول الله صلى الله عليه وسلم يزيد في رمضان ولا في غيره على إحدى عشرة ركعة يصلي أربعا فلا تسأل عن حسنهن وطولهن ثم يصلي أربعا فلا تسأل عن حسنهن وطولهن ثم يصلي ثلاثا فقالت عائشة فقلت يا رسول الله أتنام قبل أن توتر فقال ‏ \"‏ يا عائشة إن عينى تنامان ولا ينام قلبي ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 1724,
			"arabicnumber": "738.02",
			"text": "وحدثنا محمد بن المثنى، حدثنا ابن أبي عدي، حدثنا هشام، عن يحيى، عن أبي سلمة، قال سألت عائشة عن صلاة، رسول الله صلى الله عليه وسلم فقالت كان يصلي ثلاث عشرة ركعة يصلي ثمان ركعات ثم يوتر ثم يصلي ركعتين وهو جالس فإذا أراد أن يركع قام فركع ثم يصلي ركعتين بين النداء والإقامة من صلاة الصبح ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 1725,
			"arabicnumber": "738.03",
			"text": "وحدثني زهير بن حرب، حدثنا حسين بن محمد، حدثنا شيبان، عن يحيى، قال سمعت أبا سلمة، ح وحدثني يحيى بن بشر الحريري، حدثنا معاوية، - يعني ابن سلام - عن يحيى بن أبي كثير، قال أخبرني أبو سلمة، أنه سأل عائشة عن صلاة، رسول الله صلى الله عليه وسلم ‏.‏ بمثله غير أن في حديثهما تسع ركعات قائما يوتر منهن ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 1726,
			"arabicnumber": "738.04",
			"text": "وحدثنا عمرو الناقد، حدثنا سفيان بن عيينة، عن عبد الله بن أبي لبيد، سمع أبا سلمة، قال أتيت عائشة فقلت أى أمه أخبريني عن صلاة رسول الله صلى الله عليه وسلم ‏.‏ فقالت كانت صلاته في شهر رمضان وغيره ثلاث عشرة ركعة بالليل منها ركعتا الفجر ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 1727,
			"arabicnumber": "738.05",
			"text": "حدثنا ابن نمير، حدثنا أبي، حدثنا حنظلة، عن القاسم بن محمد، قال سمعت عائشة، تقول كانت صلاة رسول الله صلى الله عليه وسلم من الليل عشر ركعات ويوتر بسجدة ويركع ركعتى الفجر فتلك ثلاث عشرة ركعة ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 1728,
			"arabicnumber": "739",
			"text": "وحدثنا أحمد بن يونس، حدثنا زهير، حدثنا أبو إسحاق، ح وحدثنا يحيى بن يحيى، أخبرنا أبو خيثمة، عن أبي إسحاق، قال سألت الأسود بن يزيد عما حدثته عائشة، عن صلاة، رسول الله صلى الله عليه وسلم قالت كان ينام أول الليل ويحيي آخره ثم إن كانت له حاجة إلى أهله قضى حاجته ثم ينام فإذا كان عند النداء الأول - قالت - وثب - ولا والله ما قالت قام - فأفاض عليه الماء - ولا والله ما قالت اغتسل ‏.‏ وأنا أعلم ما تريد - وإن لم يكن جنبا توضأ وضوء الرجل للصلاة ثم صلى الركعتين ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 1729,
			"arabicnumber": "740",
			"text": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا يحيى بن آدم، حدثنا عمار بن رزيق، عن أبي إسحاق، عن الأسود، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يصلي من الليل حتى يكون آخر صلاته الوتر ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 1730,
			"arabicnumber": "741",
			"text": "حدثني هناد بن السري، حدثنا أبو الأحوص، عن أشعث، عن أبيه، عن مسروق، قال سألت عائشة عن عمل، رسول الله صلى الله عليه وسلم فقالت كان يحب الدائم ‏.‏ قال قلت أى حين كان يصلي فقالت كان إذا سمع الصارخ قام فصلى ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 1731,
			"arabicnumber": "742",
			"text": "حدثنا أبو كريب، أخبرنا ابن بشر، عن مسعر، عن سعد، عن أبي سلمة، عن عائشة، قالت ما ألفى رسول الله صلى الله عليه وسلم السحر الأعلى في بيتي - أو عندي - إلا نائما ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 1732,
			"arabicnumber": "743.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، ونصر بن علي، وابن أبي عمر، قال أبو بكر حدثنا سفيان بن عيينة، عن أبي النضر، عن أبي سلمة، عن عائشة، قالت كان النبي صلى الله عليه وسلم إذا صلى ركعتى الفجر فإن كنت مستيقظة حدثني وإلا اضطجع ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 1733,
			"arabicnumber": "743.02",
			"text": "وحدثنا ابن أبي عمر، حدثنا سفيان، عن زياد بن سعد، عن ابن أبي عتاب، عن أبي سلمة، عن عائشة، عن النبي صلى الله عليه وسلم مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 1734,
			"arabicnumber": "744.01",
			"text": "وحدثنا زهير بن حرب، حدثنا جرير، عن الأعمش، عن تميم بن سلمة، عن عروة بن الزبير، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يصلي من الليل فإذا أوتر قال ‏ \"‏ قومي فأوتري يا عائشة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 1735,
			"arabicnumber": "744.02",
			"text": "وحدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني سليمان بن بلال، عن ربيعة بن أبي عبد الرحمن، عن القاسم بن محمد، عن عائشة، أن رسول الله صلى الله عليه وسلم كان يصلي صلاته بالليل وهي معترضة بين يديه فإذا بقي الوتر أيقظها فأوترت ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 1736,
			"arabicnumber": "745.01",
			"text": "وحدثنا يحيى بن يحيى، أخبرنا سفيان بن عيينة، عن أبي يعفور، - واسمه واقد ولقبه وقدان - ح وحدثنا أبو بكر بن أبي شيبة، و أبو كريب قالا حدثنا أبو معاوية، عن الأعمش، كلاهما عن مسلم، عن مسروق، عن عائشة، قالت من كل الليل قد أوتر رسول الله صلى الله عليه وسلم فانتهى وتره إلى السحر ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 1737,
			"arabicnumber": "745.02",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، قالا حدثنا وكيع، عن سفيان، عن أبي حصين، عن يحيى بن وثاب، عن مسروق، عن عائشة، قالت من كل الليل قد أوتر رسول الله صلى الله عليه وسلم من أول الليل وأوسطه وآخره فانتهى وتره إلى السحر ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 1738,
			"arabicnumber": "745.03",
			"text": "حدثني علي بن حجر، حدثنا حسان، - قاضي كرمان - عن سعيد بن مسروق، عن أبي الضحى، عن مسروق، عن عائشة، قالت كل الليل قد أوتر رسول الله صلى الله عليه وسلم فانتهى وتره إلى آخر الليل ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 1739,
			"arabicnumber": "746.01",
			"text": "حدثنا محمد بن المثنى العنزي، حدثنا محمد بن أبي عدي، عن سعيد، عن قتادة، عن زرارة، أن سعد بن هشام بن عامر، أراد أن يغزو، في سبيل الله فقدم المدينة فأراد أن يبيع عقارا له بها فيجعله في السلاح والكراع ويجاهد الروم حتى يموت فلما قدم المدينة لقي أناسا من أهل المدينة فنهوه عن ذلك وأخبروه أن رهطا ستة أرادوا ذلك في حياة نبي الله صلى الله عليه وسلم فنهاهم نبي الله صلى الله عليه وسلم وقال ‏\"‏ أليس لكم في أسوة ‏\"‏ ‏.‏ فلما حدثوه بذلك راجع امرأته وقد كان طلقها وأشهد على رجعتها فأتى ابن عباس فسأله عن وتر رسول الله صلى الله عليه وسلم فقال ابن عباس ألا أدلك على أعلم أهل الأرض بوتر رسول الله صلى الله عليه وسلم قال من قال عائشة ‏.‏ فأتها فاسألها ثم ائتني فأخبرني بردها عليك فانطلقت إليها فأتيت على حكيم بن أفلح فاستلحقته إليها فقال ما أنا بقاربها لأني نهيتها أن تقول في هاتين الشيعتين شيئا فأبت فيهما إلا مضيا ‏.‏ - قال - فأقسمت عليه فجاء فانطلقنا إلى عائشة فاستأذنا عليها فأذنت لنا فدخلنا عليها ‏.‏ فقالت أحكيم فعرفته ‏.‏ فقال نعم ‏.‏ فقالت من معك قال سعد بن هشام ‏.‏ قالت من هشام قال ابن عامر فترحمت عليه وقالت خيرا - قال قتادة وكان أصيب يوم أحد ‏.‏ فقلت يا أم المؤمنين أنبئيني عن خلق رسول الله صلى الله عليه وسلم ‏.‏ قالت ألست تقرأ القرآن قلت بلى ‏.‏ قالت فإن خلق نبي الله صلى الله عليه وسلم كان القرآن ‏.‏ - قال - فهممت أن أقوم ولا أسأل أحدا عن شىء حتى أموت ثم بدا لي فقلت أنبئيني عن قيام رسول الله صلى الله عليه وسلم ‏.‏ فقالت ألست تقرأ ‏{‏ يا أيها المزمل‏}‏ قلت بلى ‏.‏ قالت فإن الله عز وجل افترض قيام الليل في أول هذه السورة فقام نبي الله صلى الله عليه وسلم وأصحابه حولا وأمسك الله خاتمتها اثنى عشر شهرا في السماء حتى أنزل الله في آخر هذه السورة التخفيف فصار قيام الليل تطوعا بعد فريضة ‏.‏ - قال - قلت يا أم المؤمنين أنبئيني عن وتر رسول الله صلى الله عليه وسلم ‏.‏ فقالت كنا نعد له سواكه وطهوره فيبعثه الله ما شاء أن يبعثه من الليل فيتسوك ويتوضأ ويصلي تسع ركعات لا يجلس فيها إلا في الثامنة فيذكر الله ويحمده ويدعوه ثم ينهض ولا يسلم ثم يقوم فيصلي التاسعة ثم يقعد فيذكر الله ويحمده ويدعوه ثم يسلم تسليما يسمعنا ثم يصلي ركعتين بعد ما يسلم وهو قاعد فتلك إحدى عشرة ركعة يا بنى فلما أسن نبي الله صلى الله عليه وسلم وأخذ اللحم أوتر بسبع وصنع في الركعتين مثل صنيعه الأول فتلك تسع يا بنى وكان نبي الله صلى الله عليه وسلم إذا صلى صلاة أحب أن يداوم عليها وكان إذا غلبه نوم أو وجع عن قيام الليل صلى من النهار ثنتى عشرة ركعة ولا أعلم نبي الله صلى الله عليه وسلم قرأ القرآن كله في ليلة ولا صلى ليلة إلى الصبح ولا صام شهرا كاملا غير رمضان ‏.‏ - قال - فانطلقت إلى ابن عباس فحدثته بحديثها فقال صدقت لو كنت أقربها أو أدخل عليها لأتيتها حتى تشافهني به ‏.‏ - قال - قلت لو علمت أنك لا تدخل عليها ما حدثتك حديثها ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 1740,
			"arabicnumber": "746.02",
			"text": "وحدثنا محمد بن المثنى، حدثنا معاذ بن هشام، حدثني أبي، عن قتادة، عن زرارة بن أوفى، عن سعد بن هشام، أنه طلق امرأته ثم انطلق إلى المدينة ليبيع عقاره ‏.‏ فذكر نحوه ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 1741,
			"arabicnumber": "746.03",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، حدثنا سعيد بن أبي عروبة، حدثنا قتادة، عن زرارة بن أوفى، عن سعد بن هشام، أنه قال انطلقت إلى عبد الله بن عباس فسألته عن الوتر ‏.‏ وساق الحديث بقصته وقال فيه قالت من هشام قلت ابن عامر ‏.‏ قالت نعم المرء كان عامر أصيب يوم أحد ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 1742,
			"arabicnumber": "746.04",
			"text": "وحدثنا إسحاق بن إبراهيم، ومحمد بن رافع، كلاهما عن عبد الرزاق، أخبرنا معمر، عن قتادة، عن زرارة بن أوفى، أن سعد بن هشام، كان جارا له فأخبره أنه، طلق امرأته ‏.‏ واقتص الحديث بمعنى حديث سعيد وفيه قالت من هشام قال ابن عامر ‏.‏ قالت نعم المرء كان أصيب مع رسول الله صلى الله عليه وسلم يوم أحد ‏.‏ وفيه فقال حكيم بن أفلح أما إني لو علمت أنك لا تدخل عليها ما أنبأتك بحديثها ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 1743,
			"arabicnumber": "746.05",
			"text": "حدثنا سعيد بن منصور، وقتيبة بن سعيد، جميعا عن أبي عوانة، قال سعيد حدثنا أبو عوانة، عن قتادة، عن زرارة بن أوفى، عن سعد بن هشام، عن عائشة، أن رسول الله صلى الله عليه وسلم كان إذا فاتته الصلاة من الليل من وجع أو غيره صلى من النهار ثنتى عشرة ركعة ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 1744,
			"arabicnumber": "746.06",
			"text": "وحدثنا علي بن خشرم، أخبرنا عيسى، - وهو ابن يونس - عن شعبة، عن قتادة، عن زرارة، عن سعد بن هشام الأنصاري، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم إذا عمل عملا أثبته وكان إذا نام من الليل أو مرض صلى من النهار ثنتى عشرة ركعة ‏.‏ قالت وما رأيت رسول الله صلى الله عليه وسلم قام ليلة حتى الصباح وما صام شهرا متتابعا إلا رمضان ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 1745,
			"arabicnumber": "747",
			"text": "حدثنا هارون بن معروف، حدثنا عبد الله بن وهب، ح وحدثني أبو الطاهر، وحرملة، قالا أخبرنا ابن وهب، عن يونس بن يزيد، عن ابن شهاب، عن السائب بن يزيد، وعبيد الله بن عبد الله، أخبراه عن عبد الرحمن بن عبد القاري، قال سمعت عمر بن الخطاب، يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ من نام عن حزبه أو عن شىء منه فقرأه فيما بين صلاة الفجر وصلاة الظهر كتب له كأنما قرأه من الليل ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 1746,
			"arabicnumber": "748.01",
			"text": "وحدثنا زهير بن حرب، وابن، نمير قالا حدثنا إسماعيل، - وهو ابن علية - عن أيوب، عن القاسم الشيباني، أن زيد بن أرقم، رأى قوما يصلون من الضحى فقال أما لقد علموا أن الصلاة في غير هذه الساعة أفضل ‏.‏ إن رسول الله صلى الله عليه وسلم قال ‏ \"‏ صلاة الأوابين حين ترمض الفصال ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 1747,
			"arabicnumber": "748.02",
			"text": "حدثنا زهير بن حرب، حدثنا يحيى بن سعيد، عن هشام بن أبي عبد الله، قال حدثنا القاسم الشيباني، عن زيد بن أرقم، قال خرج رسول الله صلى الله عليه وسلم على أهل قباء وهم يصلون فقال ‏ \"‏ صلاة الأوابين إذا رمضت الفصال ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 1748,
			"arabicnumber": "749.01",
			"text": "وحدثنا يحيى بن يحيى، قال قرأت على مالك عن نافع، وعبد الله بن دينار، عن ابن عمر، أن رجلا، سأل رسول الله صلى الله عليه وسلم عن صلاة الليل فقال رسول الله صلى الله عليه وسلم ‏ \"‏ صلاة الليل مثنى مثنى فإذا خشي أحدكم الصبح صلى ركعة واحدة توتر له ما قد صلى ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 1749,
			"arabicnumber": "749.02",
			"text": "حدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، وزهير بن حرب، قال زهير حدثنا سفيان بن عيينة، عن الزهري، عن سالم، عن أبيه، سمع النبي صلى الله عليه وسلم يقول ح وحدثنا محمد بن عباد، - واللفظ له - حدثنا سفيان، حدثنا عمرو، عن طاوس، عن ابن عمر، ح وحدثنا الزهري، عن سالم، عن أبيه، أن رجلا، سأل النبي صلى الله عليه وسلم عن صلاة الليل فقال ‏ \"‏ مثنى مثنى فإذا خشيت الصبح فأوتر بركعة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 1750,
			"arabicnumber": "749.03",
			"text": "وحدثني حرملة بن يحيى، حدثنا عبد الله بن وهب، أخبرني عمرو، أن ابن شهاب، حدثه أن سالم بن عبد الله بن عمر وحميد بن عبد الرحمن بن عوف حدثاه عن عبد الله بن عمر بن الخطاب، أنه قال قام رجل فقال يا رسول الله كيف صلاة الليل قال رسول الله صلى الله عليه وسلم ‏ \"‏ صلاة الليل مثنى مثنى فإذا خفت الصبح فأوتر بواحدة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 1751,
			"arabicnumber": "749.04",
			"text": "وحدثني أبو الربيع الزهراني، حدثنا حماد، حدثنا أيوب، وبديل، عن عبد الله بن شقيق، عن عبد الله بن عمر، أن رجلا، سأل النبي صلى الله عليه وسلم وأنا بينه وبين السائل فقال يا رسول الله كيف صلاة الليل قال ‏ \"‏ مثنى مثنى فإذا خشيت الصبح فصل ركعة واجعل آخر صلاتك وترا ‏\"‏ ‏.‏ ثم سأله رجل على رأس الحول وأنا بذلك المكان من رسول الله صلى الله عليه وسلم فلا أدري هو ذلك الرجل أو رجل آخر فقال له مثل ذلك ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 1752,
			"arabicnumber": "749.05",
			"text": "وحدثني أبو كامل، حدثنا حماد، حدثنا أيوب، وبديل، وعمران بن حدير، عن عبد الله بن شقيق، عن ابن عمر، ح وحدثنا محمد بن عبيد الغبري، حدثنا حماد، حدثنا أيوب، والزبير بن الخريت، عن عبد الله بن شقيق، عن ابن عمر، قال سأل رجل النبي صلى الله عليه وسلم ‏.‏ فذكرا بمثله وليس في حديثهما ثم سأله رجل على رأس الحول وما بعده ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 1753,
			"arabicnumber": "750",
			"text": "وحدثنا هارون بن معروف، وسريج بن يونس، وأبو كريب جميعا عن ابن أبي زائدة، - قال هارون حدثنا ابن أبي زائدة، - أخبرني عاصم الأحول، عن عبد الله بن شقيق، عن ابن عمر، أن النبي صلى الله عليه وسلم قال ‏ \"‏ بادروا الصبح بالوتر ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 1754,
			"arabicnumber": "751.01",
			"text": "وحدثنا قتيبة بن سعيد، حدثنا ليث، ح وحدثنا ابن رمح، أخبرنا الليث، عن نافع، أن ابن عمر، قال من صلى من الليل فليجعل آخر صلاته وترا فإن رسول الله صلى الله عليه وسلم كان يأمر بذلك ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 1755,
			"arabicnumber": "751.02",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، ح وحدثنا ابن نمير، حدثنا أبي ح، وحدثني زهير بن حرب، وابن المثنى، قالا حدثنا يحيى، كلهم عن عبيد الله، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏ \"‏ اجعلوا آخر صلاتكم بالليل وترا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 1756,
			"arabicnumber": "751.03",
			"text": "وحدثني هارون بن عبد الله، حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني نافع، أن ابن عمر، كان يقول من صلى من الليل فليجعل آخر صلاته وترا قبل الصبح كذلك كان رسول الله صلى الله عليه وسلم يأمرهم ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 1757,
			"arabicnumber": "752.01",
			"text": "حدثنا شيبان بن فروخ، حدثنا عبد الوارث، عن أبي التياح، قال حدثني أبو مجلز، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ الوتر ركعة من آخر الليل ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 1758,
			"arabicnumber": "752.02",
			"text": "وحدثنا محمد بن المثنى، وابن، بشار قال ابن المثنى حدثنا محمد بن جعفر، حدثنا شعبة، عن قتادة، عن أبي مجلز، قال سمعت ابن عمر، يحدث عن النبي صلى الله عليه وسلم قال ‏ \"‏ الوتر ركعة من آخر الليل ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 187
			}
		},
		{
			"hadithnumber": 1759,
			"arabicnumber": "753",
			"text": "وحدثني زهير بن حرب، حدثنا عبد الصمد، حدثنا همام، حدثنا قتادة، عن أبي مجلز، قال سألت ابن عباس عن الوتر، فقال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ركعة من آخر الليل ‏\"‏ ‏.‏ وسألت ابن عمر فقال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ركعة من آخر الليل ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 188
			}
		},
		{
			"hadithnumber": 1760,
			"arabicnumber": "749.06",
			"text": "وحدثنا أبو كريب، وهارون بن عبد الله، قالا حدثنا أبو أسامة، عن الوليد بن كثير، قال حدثني عبيد الله بن عبد الله بن عمر، أن ابن عمر، حدثهم أن رجلا نادى رسول الله صلى الله عليه وسلم وهو في المسجد فقال يا رسول الله كيف أوتر صلاة الليل فقال رسول الله صلى الله عليه وسلم ‏ \"‏ من صلى فليصل مثنى مثنى فإن أحس أن يصبح سجد سجدة فأوترت له ما صلى ‏\"‏ ‏.‏ قال أبو كريب عبيد الله بن عبد الله ‏.‏ ولم يقل ابن عمر ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 189
			}
		},
		{
			"hadithnumber": 1761,
			"arabicnumber": "749.07",
			"text": "حدثنا خلف بن هشام، وأبو كامل قالا حدثنا حماد بن زيد، عن أنس بن سيرين، قال سألت ابن عمر قلت أرأيت الركعتين قبل صلاة الغداة أأطيل فيهما القراءة قال كان رسول الله صلى الله عليه وسلم يصلي من الليل مثنى مثنى ويوتر بركعة - قال - قلت إني لست عن هذا أسألك ‏.‏ قال إنك لضخم ألا تدعني أستقرئ لك الحديث كان رسول الله صلى الله عليه وسلم يصلي من الليل مثنى مثنى ويوتر بركعة ويصلي ركعتين قبل الغداة كأن الأذان بأذنيه ‏.‏ قال خلف أرأيت الركعتين قبل الغداة ولم يذكر صلاة ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 190
			}
		},
		{
			"hadithnumber": 1762,
			"arabicnumber": "749.08",
			"text": "وحدثنا ابن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن أنس بن سيرين، قال سألت ابن عمر ‏.‏ بمثله وزاد ويوتر بركعة من آخر الليل ‏.‏ وفيه فقال به به إنك لضخم ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 191
			}
		},
		{
			"hadithnumber": 1763,
			"arabicnumber": "749.09",
			"text": "حدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، قال سمعت عقبة بن حريث، قال سمعت ابن عمر، يحدث أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ صلاة الليل مثنى مثنى فإذا رأيت أن الصبح يدركك فأوتر بواحدة ‏\"‏ ‏.‏ فقيل لابن عمر ما مثنى مثنى قال أن يسلم في كل ركعتين ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 192
			}
		},
		{
			"hadithnumber": 1764,
			"arabicnumber": "754.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الأعلى بن عبد الأعلى، عن معمر، عن يحيى بن أبي كثير، عن أبي نضرة، عن أبي سعيد، أن النبي صلى الله عليه وسلم قال ‏ \"‏ أوتروا قبل أن تصبحوا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 193
			}
		},
		{
			"hadithnumber": 1765,
			"arabicnumber": "754.02",
			"text": "وحدثني إسحاق بن منصور، أخبرني عبيد الله، عن شيبان، عن يحيى، قال أخبرني أبو نضرة العوقي، أن أبا سعيد، أخبرهم أنهم، سألوا النبي صلى الله عليه وسلم عن الوتر فقال ‏ \"‏ أوتروا قبل الصبح ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 194
			}
		},
		{
			"hadithnumber": 1766,
			"arabicnumber": "755.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا حفص، وأبو معاوية عن الأعمش، عن أبي سفيان، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من خاف أن لا يقوم من آخر الليل فليوتر أوله ومن طمع أن يقوم آخره فليوتر آخر الليل فإن صلاة آخر الليل مشهودة وذلك أفضل ‏\"‏ ‏.‏ وقال أبو معاوية محضورة ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 195
			}
		},
		{
			"hadithnumber": 1767,
			"arabicnumber": "755.02",
			"text": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، - وهو ابن عبيد الله - عن أبي الزبير، عن جابر، قال سمعت النبي صلى الله عليه وسلم يقول ‏ \"‏ أيكم خاف أن لا يقوم من آخر الليل فليوتر ثم ليرقد ومن وثق بقيام من الليل فليوتر من آخره فإن قراءة آخر الليل محضورة وذلك أفضل ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 196
			}
		},
		{
			"hadithnumber": 1768,
			"arabicnumber": "756.01",
			"text": "حدثنا عبد بن حميد، أخبرنا أبو عاصم، أخبرنا ابن جريج، أخبرني أبو الزبير، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ أفضل الصلاة طول القنوت ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 197
			}
		},
		{
			"hadithnumber": 1769,
			"arabicnumber": "756.02",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، حدثنا الأعمش، عن أبي سفيان، عن جابر، قال سئل رسول الله صلى الله عليه وسلم أى الصلاة أفضل قال ‏ \"‏ طول القنوت ‏\"‏ ‏.‏ قال أبو بكر حدثنا أبو معاوية عن الأعمش ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 198
			}
		},
		{
			"hadithnumber": 1770,
			"arabicnumber": "757.01",
			"text": "وحدثنا عثمان بن أبي شيبة، حدثنا جرير، عن الأعمش، عن أبي سفيان، عن جابر، قال سمعت النبي صلى الله عليه وسلم يقول ‏ \"‏ إن في الليل لساعة لا يوافقها رجل مسلم يسأل الله خيرا من أمر الدنيا والآخرة إلا أعطاه إياه وذلك كل ليلة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 199
			}
		},
		{
			"hadithnumber": 1771,
			"arabicnumber": "757.02",
			"text": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، عن أبي الزبير، عن جابر، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إن من الليل ساعة لا يوافقها عبد مسلم يسأل الله خيرا إلا أعطاه إياه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 200
			}
		},
		{
			"hadithnumber": 1772,
			"arabicnumber": "758.01",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن ابن شهاب، عن أبي عبد الله الأغر، وعن أبي سلمة بن عبد الرحمن، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ ينزل ربنا تبارك وتعالى كل ليلة إلى السماء الدنيا حين يبقى ثلث الليل الآخر فيقول من يدعوني فأستجيب له ومن يسألني فأعطيه ومن يستغفرني فأغفر له ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 201
			}
		},
		{
			"hadithnumber": 1773,
			"arabicnumber": "758.02",
			"text": "وحدثنا قتيبة بن سعيد، حدثنا يعقوب، - وهو ابن عبد الرحمن القاري - عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏ \"‏ ينزل الله إلى السماء الدنيا كل ليلة حين يمضي ثلث الليل الأول فيقول أنا الملك أنا الملك من ذا الذي يدعوني فأستجيب له من ذا الذي يسألني فأعطيه من ذا الذي يستغفرني فأغفر له فلا يزال كذلك حتى يضيء الفجر ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 202
			}
		},
		{
			"hadithnumber": 1774,
			"arabicnumber": "758.03",
			"text": "حدثنا إسحاق بن منصور، أخبرنا أبو المغيرة، حدثنا الأوزاعي، حدثنا يحيى، حدثنا أبو سلمة بن عبد الرحمن، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا مضى شطر الليل أو ثلثاه ينزل الله تبارك وتعالى إلى السماء الدنيا فيقول هل من سائل يعطى هل من داع يستجاب له هل من مستغفر يغفر له حتى ينفجر الصبح ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 203
			}
		},
		{
			"hadithnumber": 1775,
			"arabicnumber": "758.04",
			"text": "حدثني حجاج بن الشاعر، حدثنا محاضر أبو المورع، حدثنا سعد بن سعيد، قال أخبرني ابن مرجانة، قال سمعت أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ ينزل الله في السماء الدنيا لشطر الليل أو لثلث الليل الآخر فيقول من يدعوني فأستجيب له أو يسألني فأعطيه ‏.‏ ثم يقول من يقرض غير عديم ولا ظلوم ‏\"‏ ‏.‏ قال مسلم ابن مرجانة هو سعيد بن عبد الله ومرجانة أمه ‏.‏ حدثنا هارون بن سعيد الأيلي، حدثنا ابن وهب، قال أخبرني سليمان بن بلال، عن سعد بن سعيد، بهذا الإسناد وزاد ‏\"‏ ثم يبسط يديه تبارك وتعالى يقول من يقرض غير عدوم ولا ظلوم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 204
			}
		},
		{
			"hadithnumber": 1776,
			"arabicnumber": "758.05",
			"text": "حدثنا عثمان، وأبو بكر ابنا أبي شيبة وإسحاق بن إبراهيم الحنظلي - واللفظ لابنى أبي شيبة - قال إسحاق أخبرنا وقال الآخران، حدثنا جرير، عن منصور، عن أبي إسحاق، عن الأغر أبي مسلم، يرويه عن أبي سعيد، وأبي، هريرة قالا قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن الله يمهل حتى إذا ذهب ثلث الليل الأول نزل إلى السماء الدنيا فيقول هل من مستغفر هل من تائب هل من سائل هل من داع حتى ينفجر الفجر ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 205
			}
		},
		{
			"hadithnumber": 1777,
			"arabicnumber": "758.06",
			"text": "وحدثناه محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن أبي إسحاق، بهذا الإسناد ‏.‏ غير أن حديث، منصور أتم وأكثر ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 206
			}
		},
		{
			"hadithnumber": 1779,
			"arabicnumber": "759.01",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن ابن شهاب، عن حميد بن عبد الرحمن، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من قام رمضان إيمانا واحتسابا غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 207
			}
		},
		{
			"hadithnumber": 1780,
			"arabicnumber": "759.02",
			"text": "وحدثنا عبد بن حميد، أخبرنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن أبي سلمة، عن أبي هريرة، قال كان رسول الله صلى الله عليه وسلم يرغب في قيام رمضان من غير أن يأمرهم فيه بعزيمة فيقول ‏ \"‏ من قام رمضان إيمانا واحتسابا غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏ فتوفي رسول الله صلى الله عليه وسلم والأمر على ذلك ثم كان الأمر على ذلك في خلافة أبي بكر وصدرا من خلافة عمر على ذلك ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 208
			}
		},
		{
			"hadithnumber": 1781,
			"arabicnumber": "760.01",
			"text": "وحدثني زهير بن حرب، حدثنا معاذ بن هشام، حدثني أبي، عن يحيى بن أبي كثير، قال حدثنا أبو سلمة بن عبد الرحمن، أن أبا هريرة، حدثهم أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من صام رمضان إيمانا واحتسابا غفر له ما تقدم من ذنبه ومن قام ليلة القدر إيمانا واحتسابا غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 209
			}
		},
		{
			"hadithnumber": 1782,
			"arabicnumber": "760.02",
			"text": "حدثني محمد بن رافع، حدثنا شبابة، حدثني ورقاء، عن أبي الزناد، عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ من يقم ليلة القدر فيوافقها - أراه قال - إيمانا واحتسابا غفر له ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 210
			}
		},
		{
			"hadithnumber": 1783,
			"arabicnumber": "761.01",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن ابن شهاب، عن عروة، عن عائشة، أن رسول الله صلى الله عليه وسلم صلى في المسجد ذات ليلة فصلى بصلاته ناس ثم صلى من القابلة فكثر الناس ثم اجتمعوا من الليلة الثالثة أو الرابعة فلم يخرج إليهم رسول الله صلى الله عليه وسلم فلما أصبح قال ‏ \"‏ قد رأيت الذي صنعتم فلم يمنعني من الخروج إليكم إلا أني خشيت أن تفرض عليكم ‏\"‏ ‏.‏ قال وذلك في رمضان ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 211
			}
		},
		{
			"hadithnumber": 1784,
			"arabicnumber": "761.02",
			"text": "وحدثني حرملة بن يحيى، أخبرنا عبد الله بن وهب، أخبرني يونس بن يزيد، عن ابن شهاب، قال أخبرني عروة بن الزبير، أن عائشة، أخبرته أن رسول الله صلى الله عليه وسلم خرج من جوف الليل فصلى في المسجد فصلى رجال بصلاته فأصبح الناس يتحدثون بذلك فاجتمع أكثر منهم فخرج رسول الله صلى الله عليه وسلم في الليلة الثانية فصلوا بصلاته فأصبح الناس يذكرون ذلك فكثر أهل المسجد من الليلة الثالثة فخرج فصلوا بصلاته فلما كانت الليلة الرابعة عجز المسجد عن أهله فلم يخرج إليهم رسول الله صلى الله عليه وسلم فطفق رجال منهم يقولون الصلاة ‏.‏ فلم يخرج إليهم رسول الله صلى الله عليه وسلم حتى خرج لصلاة الفجر فلما قضى الفجر أقبل على الناس ثم تشهد فقال ‏ \"‏ أما بعد فإنه لم يخف على شأنكم الليلة ولكني خشيت أن تفرض عليكم صلاة الليل فتعجزوا عنها ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 212
			}
		},
		{
			"hadithnumber": 1785,
			"arabicnumber": "762.01",
			"text": "حدثنا محمد بن مهران الرازي، حدثنا الوليد بن مسلم، حدثنا الأوزاعي، حدثني عبدة، عن زر، قال سمعت أبى بن كعب، يقول - وقيل له إن عبد الله بن مسعود يقول من قام السنة أصاب ليلة القدر - فقال أبى والله الذي لا إله إلا هو إنها لفي رمضان - يحلف ما يستثني - ووالله إني لأعلم أى ليلة هي ‏.‏ هي الليلة التي أمرنا بها رسول الله صلى الله عليه وسلم بقيامها هي ليلة صبيحة سبع وعشرين وأمارتها أن تطلع الشمس في صبيحة يومها بيضاء لا شعاع لها ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 213
			}
		},
		{
			"hadithnumber": 1786,
			"arabicnumber": "762.02",
			"text": "حدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، قال سمعت عبدة بن أبي لبابة، يحدث عن زر بن حبيش، عن أبى بن كعب، قال أبى في ليلة القدر والله إني لأعلمها وأكثر علمي هي الليلة التي أمرنا رسول الله صلى الله عليه وسلم بقيامها هي ليلة سبع وعشرين - وإنما شك شعبة في هذا الحرف - هي الليلة التي أمرنا بها رسول الله صلى الله عليه وسلم ‏.‏ قال وحدثني بها صاحب لي عنه ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 214
			}
		},
		{
			"hadithnumber": 1787,
			"arabicnumber": "762.03",
			"text": "وحدثني عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، بهذا الإسناد ‏.‏ نحوه ولم يذكر إنما شك شعبة ‏.‏ وما بعده ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 215
			}
		},
		{
			"hadithnumber": 1788,
			"arabicnumber": "763.01",
			"text": "حدثني عبد الله بن هاشم بن حيان العبدي، حدثنا عبد الرحمن، - يعني ابن مهدي - حدثنا سفيان، عن سلمة بن كهيل، عن كريب، عن ابن عباس، قال بت ليلة عند خالتي ميمونة فقام النبي صلى الله عليه وسلم من الليل فأتى حاجته ثم غسل وجهه ويديه ثم نام ثم قام فأتى القربة فأطلق شناقها ثم توضأ وضوءا بين الوضوءين ولم يكثر وقد أبلغ ثم قام فصلى فقمت فتمطيت كراهية أن يرى أني كنت أنتبه له فتوضأت فقام فصلى فقمت عن يساره فأخذ بيدي فأدارني عن يمينه فتتامت صلاة رسول الله صلى الله عليه وسلم من الليل ثلاث عشرة ركعة ثم اضطجع فنام حتى نفخ وكان إذا نام نفخ فأتاه بلال فآذنه بالصلاة فقام فصلى ولم يتوضأ وكان في دعائه ‏ \"‏ اللهم اجعل في قلبي نورا وفي بصري نورا وفي سمعي نورا وعن يميني نورا وعن يساري نورا وفوقي نورا وتحتي نورا وأمامي نورا وخلفي نورا وعظم لي نورا ‏\"‏ ‏.‏ قال كريب وسبعا في التابوت فلقيت بعض ولد العباس فحدثني بهن فذكر عصبي ولحمي ودمي وشعري وبشري وذكر خصلتين ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 216
			}
		},
		{
			"hadithnumber": 1789,
			"arabicnumber": "763.02",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن مخرمة بن سليمان، عن كريب، مولى ابن عباس أن ابن عباس، أخبره أنه، بات ليلة عند ميمونة أم المؤمنين - وهي خالته - قال فاضطجعت في عرض الوسادة واضطجع رسول الله صلى الله عليه وسلم وأهله في طولها فنام رسول الله صلى الله عليه وسلم حتى انتصف الليل أو قبله بقليل أو بعده بقليل استيقظ رسول الله صلى الله عليه وسلم فجعل يمسح النوم عن وجهه بيده ثم قرأ العشر الآيات الخواتم من سورة آل عمران ثم قام إلى شن معلقة فتوضأ منها فأحسن وضوءه ثم قام فصلى ‏.‏ قال ابن عباس فقمت فصنعت مثل ما صنع رسول الله صلى الله عليه وسلم ثم ذهبت فقمت إلى جنبه فوضع رسول الله صلى الله عليه وسلم يده اليمنى على رأسي وأخذ بأذني اليمنى يفتلها فصلى ركعتين ثم ركعتين ثم ركعتين ثم ركعتين ثم ركعتين ثم ركعتين ثم أوتر ثم اضطجع حتى جاء المؤذن فقام فصلى ركعتين خفيفتين ثم خرج فصلى الصبح ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 217
			}
		},
		{
			"hadithnumber": 1790,
			"arabicnumber": "763.03",
			"text": "وحدثني محمد بن سلمة المرادي، حدثنا عبد الله بن وهب، عن عياض بن عبد الله الفهري، عن مخرمة بن سليمان، بهذا الإسناد وزاد ثم عمد إلى شجب من ماء فتسوك وتوضأ وأسبغ الوضوء ولم يهرق من الماء إلا قليلا ثم حركني فقمت ‏.‏ وسائر الحديث نحو حديث مالك ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 218
			}
		},
		{
			"hadithnumber": 1791,
			"arabicnumber": "763.04",
			"text": "حدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، حدثنا عمرو، عن عبد ربه بن سعيد، عن مخرمة بن سليمان، عن كريب، مولى ابن عباس عن ابن عباس، أنه قال نمت عند ميمونة زوج النبي صلى الله عليه وسلم ورسول الله صلى الله عليه وسلم عندها تلك الليلة فتوضأ رسول الله صلى الله عليه وسلم ثم قام فصلى فقمت عن يساره فأخذني فجعلني عن يمينه فصلى في تلك الليلة ثلاث عشرة ركعة ثم نام رسول الله صلى الله عليه وسلم حتى نفخ وكان إذا نام نفخ ثم أتاه المؤذن فخرج فصلى ولم يتوضأ ‏.‏ قال عمرو فحدثت به بكير بن الأشج فقال حدثني كريب بذلك ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 219
			}
		},
		{
			"hadithnumber": 1792,
			"arabicnumber": "763.05",
			"text": "وحدثنا محمد بن رافع، حدثنا ابن أبي فديك، أخبرنا الضحاك، عن مخرمة بن سليمان، عن كريب، مولى ابن عباس عن ابن عباس، قال بت ليلة عند خالتي ميمونة بنت الحارث فقلت لها إذا قام رسول الله صلى الله عليه وسلم فأيقظيني ‏.‏ فقام رسول الله صلى الله عليه وسلم فقمت إلى جنبه الأيسر فأخذ بيدي فجعلني من شقه الأيمن فجعلت إذا أغفيت يأخذ بشحمة أذني - قال - فصلى إحدى عشرة ركعة ثم احتبى حتى إني لأسمع نفسه راقدا فلما تبين له الفجر صلى ركعتين خفيفتين ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 220
			}
		},
		{
			"hadithnumber": 1793,
			"arabicnumber": "763.06",
			"text": "حدثنا ابن أبي عمر، ومحمد بن حاتم، عن ابن عيينة، - قال ابن أبي عمر حدثنا سفيان، - عن عمرو بن دينار، عن كريب، مولى ابن عباس عن ابن عباس، أنه بات عند خالته ميمونة فقام رسول الله صلى الله عليه وسلم من الليل فتوضأ من شن معلق وضوءا خفيفا - قال وصف وضوءه وجعل يخففه ويقلله - قال ابن عباس فقمت فصنعت مثل ما صنع النبي صلى الله عليه وسلم ثم جئت فقمت عن يساره فأخلفني فجعلني عن يمينه فصلى ثم اضطجع فنام حتى نفخ ثم أتاه بلال فآذنه بالصلاة فخرج فصلى الصبح ولم يتوضأ ‏.‏ قال سفيان وهذا للنبي صلى الله عليه وسلم خاصة لأنه بلغنا أن النبي صلى الله عليه وسلم تنام عيناه ولا ينام قلبه ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 221
			}
		},
		{
			"hadithnumber": 1794,
			"arabicnumber": "763.07",
			"text": "حدثنا محمد بن بشار، حدثنا محمد، - وهو ابن جعفر - حدثنا شعبة، عن سلمة، عن كريب، عن ابن عباس، قال بت في بيت خالتي ميمونة فبقيت كيف يصلي رسول الله صلى الله عليه وسلم - قال - فقام فبال ثم غسل وجهه وكفيه ثم نام ثم قام إلى القربة فأطلق شناقها ثم صب في الجفنة أو القصعة فأكبه بيده عليها ثم توضأ وضوءا حسنا بين الوضوءين ثم قام يصلي فجئت فقمت إلى جنبه فقمت عن يساره - قال - فأخذني فأقامني عن يمينه فتكاملت صلاة رسول الله صلى الله عليه وسلم ثلاث عشرة ركعة ثم نام حتى نفخ وكنا نعرفه إذا نام بنفخه ثم خرج إلى الصلاة فصلى فجعل يقول في صلاته أو في سجوده ‏ \"‏ اللهم اجعل في قلبي نورا وفي سمعي نورا وفي بصري نورا وعن يميني نورا وعن شمالي نورا وأمامي نورا وخلفي نورا وفوقي نورا وتحتي نورا واجعل لي نورا أو قال واجعلني نورا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 222
			}
		},
		{
			"hadithnumber": 1795,
			"arabicnumber": "763.08",
			"text": "وحدثني إسحاق بن منصور، حدثنا النضر بن شميل، أخبرنا شعبة، حدثنا سلمة بن كهيل، عن بكير، عن كريب، عن ابن عباس، ‏.‏ قال سلمة فلقيت كريبا فقال قال ابن عباس كنت عند خالتي ميمونة فجاء رسول الله صلى الله عليه وسلم ‏.‏ ثم ذكر بمثل حديث غندر ‏.‏ وقال ‏ \"‏ واجعلني نورا ‏\"‏ ‏.‏ ولم يشك ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 223
			}
		},
		{
			"hadithnumber": 1796,
			"arabicnumber": "763.09",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وهناد بن السري، قالا حدثنا أبو الأحوص، عن سعيد بن مسروق، عن سلمة بن كهيل، عن أبي رشدين، مولى ابن عباس عن ابن عباس، قال بت عند خالتي ميمونة ‏.‏ واقتص الحديث ولم يذكر غسل الوجه والكفين غير أنه قال ثم أتى القربة فحل شناقها فتوضأ وضوءا بين الوضوءين ثم أتى فراشه فنام ثم قام قومة أخرى فأتى القربة فحل شناقها ثم توضأ وضوءا هو الوضوء وقال ‏\"‏ أعظم لي نورا ‏\"‏ ‏.‏ ولم يذكر ‏\"‏ واجعلني نورا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 224
			}
		},
		{
			"hadithnumber": 1797,
			"arabicnumber": "763.10",
			"text": "وحدثني أبو الطاهر، حدثنا ابن وهب، عن عبد الرحمن بن سلمان الحجري، عن عقيل بن خالد، أن سلمة بن كهيل، حدثه أن كريبا حدثه أن ابن عباس بات ليلة عند رسول الله صلى الله عليه وسلم قال فقام رسول الله صلى الله عليه وسلم إلى القربة فسكب منها فتوضأ ولم يكثر من الماء ولم يقصر في الوضوء ‏.‏ وساق الحديث وفيه قال ودعا رسول الله صلى الله عليه وسلم ليلتئذ تسع عشرة كلمة ‏.‏ قال سلمة حدثنيها كريب فحفظت منها ثنتى عشرة ونسيت ما بقي قال رسول الله صلى الله عليه وسلم ‏ \"‏ اللهم اجعل لي في قلبي نورا وفي لساني نورا وفي سمعي نورا وفي بصري نورا ومن فوقي نورا ومن تحتي نورا وعن يميني نورا وعن شمالي نورا ومن بين يدى نورا ومن خلفي نورا واجعل في نفسي نورا وأعظم لي نورا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 225
			}
		},
		{
			"hadithnumber": 1798,
			"arabicnumber": "763.11",
			"text": "وحدثني أبو بكر بن إسحاق، أخبرنا ابن أبي مريم، أخبرنا محمد بن جعفر، أخبرني شريك بن أبي نمر، عن كريب، عن ابن عباس، أنه قال رقدت في بيت ميمونة ليلة كان النبي صلى الله عليه وسلم عندها لأنظر كيف صلاة النبي صلى الله عليه وسلم بالليل - قال - فتحدث النبي صلى الله عليه وسلم مع أهله ساعة ثم رقد ‏.‏ وساق الحديث وفيه ثم قام فتوضأ واستن ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 226
			}
		},
		{
			"hadithnumber": 1799,
			"arabicnumber": "763.12",
			"text": "حدثنا واصل بن عبد الأعلى، حدثنا محمد بن فضيل، عن حصين بن عبد الرحمن، عن حبيب بن أبي ثابت، عن محمد بن علي بن عبد الله بن عباس، عن أبيه، عن عبد الله بن عباس، أنه رقد عند رسول الله صلى الله عليه وسلم فاستيقظ فتسوك وتوضأ وهو يقول ‏{‏ إن في خلق السموات والأرض واختلاف الليل والنهار لآيات لأولي الألباب‏}‏ فقرأ هؤلاء الآيات حتى ختم السورة ثم قام فصلى ركعتين فأطال فيهما القيام والركوع والسجود ثم انصرف فنام حتى نفخ ثم فعل ذلك ثلاث مرات ست ركعات كل ذلك يستاك ويتوضأ ويقرأ هؤلاء الآيات ثم أوتر بثلاث فأذن المؤذن فخرج إلى الصلاة وهو يقول ‏\"‏ اللهم اجعل في قلبي نورا وفي لساني نورا واجعل في سمعي نورا واجعل في بصري نورا واجعل من خلفي نورا ومن أمامي نورا واجعل من فوقي نورا ومن تحتي نورا ‏.‏ اللهم أعطني نورا ‏\"‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 227
			}
		},
		{
			"hadithnumber": 1800,
			"arabicnumber": "763.13",
			"text": "وحدثني محمد بن حاتم، حدثنا محمد بن بكر، أخبرنا ابن جريج، أخبرني عطاء، عن ابن عباس، قال بت ذات ليلة عند خالتي ميمونة فقام النبي صلى الله عليه وسلم يصلي متطوعا من الليل فقام النبي صلى الله عليه وسلم إلى القربة فتوضأ فقام فصلى فقمت لما رأيته صنع ذلك فتوضأت من القربة ثم قمت إلى شقه الأيسر فأخذ بيدي من وراء ظهره يعدلني كذلك من وراء ظهره إلى الشق الأيمن ‏.‏ قلت أفي التطوع كان ذلك قال نعم ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 228
			}
		},
		{
			"hadithnumber": 1801,
			"arabicnumber": "763.14",
			"text": "وحدثني هارون بن عبد الله، ومحمد بن رافع، قالا حدثنا وهب بن جرير، أخبرني أبي قال، سمعت قيس بن سعد، يحدث عن عطاء، عن ابن عباس، قال بعثني العباس إلى النبي صلى الله عليه وسلم وهو في بيت خالتي ميمونة فبت معه تلك الليلة فقام يصلي من الليل فقمت عن يساره فتناولني من خلف ظهره فجعلني على يمينه ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 229
			}
		},
		{
			"hadithnumber": 1802,
			"arabicnumber": "763.15",
			"text": "وحدثنا ابن نمير، حدثنا أبي، حدثنا عبد الملك، عن عطاء، عن ابن عباس، قال بت عند خالتي ميمونة ‏.‏ نحو حديث ابن جريج وقيس بن سعد ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 230
			}
		},
		{
			"hadithnumber": 1803,
			"arabicnumber": "764",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا غندر، عن شعبة، ح وحدثنا ابن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن أبي جمرة، قال سمعت ابن عباس، يقول كان رسول الله صلى الله عليه وسلم يصلي من الليل ثلاث عشرة ركعة ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 231
			}
		},
		{
			"hadithnumber": 1804,
			"arabicnumber": "765",
			"text": "وحدثنا قتيبة بن سعيد، عن مالك بن أنس، عن عبد الله بن أبي بكر، عن أبيه، أن عبد الله بن قيس بن مخرمة، أخبره عن زيد بن خالد الجهني، أنه قال لأرمقن صلاة رسول الله صلى الله عليه وسلم الليلة فصلى ‏.‏ ركعتين خفيفتين ثم صلى ركعتين طويلتين طويلتين طويلتين ثم صلى ركعتين وهما دون اللتين قبلهما ثم صلى ركعتين وهما دون اللتين قبلهما ثم صلى ركعتين وهما دون اللتين قبلهما ثم صلى ركعتين وهما دون اللتين قبلهما ثم أوتر فذلك ثلاث عشرة ركعة ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 232
			}
		},
		{
			"hadithnumber": 1805,
			"arabicnumber": "766",
			"text": "وحدثني حجاج بن الشاعر، حدثني محمد بن جعفر المدائني أبو جعفر، حدثنا ورقاء، عن محمد بن المنكدر، عن جابر بن عبد الله، قال كنت مع رسول الله صلى الله عليه وسلم في سفر فانتهينا إلى مشرعة فقال ‏ \"‏ ألا تشرع يا جابر ‏\"‏ ‏.‏ قلت بلى - قال - فنزل رسول الله صلى الله عليه وسلم وأشرعت - قال - ثم ذهب لحاجته ووضعت له وضوءا - قال - فجاء فتوضأ ثم قام فصلى في ثوب واحد خالف بين طرفيه فقمت خلفه فأخذ بأذني فجعلني عن يمينه ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 233
			}
		},
		{
			"hadithnumber": 1806,
			"arabicnumber": "767",
			"text": "حدثنا يحيى بن يحيى، وأبو بكر بن أبي شيبة جميعا عن هشيم، - قال أبو بكر حدثنا هشيم، - أخبرنا أبو حرة، عن الحسن، عن سعد بن هشام، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم إذا قام من الليل ليصلي افتتح صلاته بركعتين خفيفتين ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 234
			}
		},
		{
			"hadithnumber": 1807,
			"arabicnumber": "768",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، عن هشام، عن محمد، عن أبي، هريرة عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا قام أحدكم من الليل فليفتتح صلاته بركعتين خفيفتين",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 235
			}
		},
		{
			"hadithnumber": 1808,
			"arabicnumber": "769.01",
			"text": "حدثنا قتيبة بن سعيد، عن مالك بن أنس، عن أبي الزبير، عن طاوس، عن ابن، عباس أن رسول الله صلى الله عليه وسلم كان يقول إذا قام إلى الصلاة من جوف الليل ‏ \"‏ اللهم لك الحمد أنت نور السموات والأرض ولك الحمد أنت قيام السموات والأرض ولك الحمد أنت رب السموات والأرض ومن فيهن أنت الحق ووعدك الحق وقولك الحق ولقاؤك حق والجنة حق والنار حق والساعة حق اللهم لك أسلمت وبك آمنت وعليك توكلت وإليك أنبت وبك خاصمت وإليك حاكمت فاغفر لي ما قدمت وأخرت وأسررت وأعلنت أنت إلهي لا إله إلا أنت ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 236
			}
		},
		{
			"hadithnumber": 1809,
			"arabicnumber": "769.02",
			"text": "حدثنا عمرو الناقد، وابن، نمير وابن أبي عمر قالوا حدثنا سفيان، ح وحدثنا محمد بن رافع، قال حدثنا عبد الرزاق، أخبرنا ابن جريج، كلاهما عن سليمان الأحول، عن طاوس، عن ابن عباس، عن النبي صلى الله عليه وسلم ‏.‏ أما حديث ابن جريج فاتفق لفظه مع حديث مالك لم يختلفا إلا في حرفين قال ابن جريج مكان قيام قيم وقال وما أسررت وأما حديث ابن عيينة ففيه بعض زيادة ويخالف مالكا وابن جريج في أحرف ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 237
			}
		},
		{
			"hadithnumber": 1810,
			"arabicnumber": "769.03",
			"text": "وحدثنا شيبان بن فروخ، حدثنا مهدي، - وهو ابن ميمون - حدثنا عمران، القصير عن قيس بن سعد، عن طاوس، عن ابن عباس، عن النبي صلى الله عليه وسلم بهذا الحديث واللفظ قريب من ألفاظهم ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 238
			}
		},
		{
			"hadithnumber": 1811,
			"arabicnumber": "770",
			"text": "حدثنا محمد بن المثنى، ومحمد بن حاتم، وعبد بن حميد، وأبو معن الرقاشي قالوا حدثنا عمر بن يونس، حدثنا عكرمة بن عمار، حدثنا يحيى بن أبي كثير، حدثني أبو سلمة، بن عبد الرحمن بن عوف قال سألت عائشة أم المؤمنين بأى شىء كان نبي الله صلى الله عليه وسلم يفتتح صلاته إذا قام من الليل قالت كان إذا قام من الليل افتتح صلاته ‏ \"‏ اللهم رب جبرائيل وميكائيل وإسرافيل فاطر السموات والأرض عالم الغيب والشهادة أنت تحكم بين عبادك فيما كانوا فيه يختلفون اهدني لما اختلف فيه من الحق بإذنك إنك تهدي من تشاء إلى صراط مستقيم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 239
			}
		},
		{
			"hadithnumber": 1812,
			"arabicnumber": "771.01",
			"text": "حدثنا محمد بن أبي بكر المقدمي، حدثنا يوسف الماجشون، حدثني أبي، عن عبد، الرحمن الأعرج عن عبيد الله بن أبي رافع، عن علي بن أبي طالب، عن رسول الله صلى الله عليه وسلم أنه كان إذا قام إلى الصلاة قال ‏\"‏ وجهت وجهي للذي فطر السموات والأرض حنيفا وما أنا من المشركين إن صلاتي ونسكي ومحياى ومماتي لله رب العالمين لا شريك له وبذلك أمرت وأنا من المسلمين اللهم أنت الملك لا إله إلا أنت ‏.‏ أنت ربي وأنا عبدك ظلمت نفسي واعترفت بذنبي فاغفر لي ذنوبي جميعا إنه لا يغفر الذنوب إلا أنت واهدني لأحسن الأخلاق لا يهدي لأحسنها إلا أنت واصرف عني سيئها لا يصرف عني سيئها إلا أنت لبيك وسعديك والخير كله في يديك والشر ليس إليك أنا بك وإليك تباركت وتعاليت أستغفرك وأتوب إليك ‏\"‏ ‏.‏ وإذا ركع قال ‏\"‏ اللهم لك ركعت وبك آمنت ولك أسلمت خشع لك سمعي وبصري ومخي وعظمي وعصبي ‏\"‏ ‏.‏ وإذا رفع قال ‏\"‏ اللهم ربنا لك الحمد ملء السموات وملء الأرض وملء ما بينهما وملء ما شئت من شىء بعد ‏\"‏ ‏.‏ وإذا سجد قال ‏\"‏ اللهم لك سجدت وبك آمنت ولك أسلمت سجد وجهي للذي خلقه وصوره وشق سمعه وبصره تبارك الله أحسن الخالقين ‏\"‏ ‏.‏ ثم يكون من آخر ما يقول بين التشهد والتسليم ‏\"‏ اللهم اغفر لي ما قدمت وما أخرت وما أسررت وما أعلنت وما أسرفت وما أنت أعلم به مني أنت المقدم وأنت المؤخر لا إله إلا أنت ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 240
			}
		},
		{
			"hadithnumber": 1813,
			"arabicnumber": "771.02",
			"text": "وحدثناه زهير بن حرب، حدثنا عبد الرحمن بن مهدي، ح وحدثنا إسحاق بن، إبراهيم أخبرنا أبو النضر، قال حدثنا عبد العزيز بن عبد الله بن أبي سلمة، عن عمه، الماجشون بن أبي سلمة عن الأعرج، بهذا الإسناد وقال كان رسول الله صلى الله عليه وسلم إذا استفتح الصلاة كبر ثم قال ‏\"‏ وجهت وجهي ‏\"‏ ‏.‏ وقال ‏\"‏ وأنا أول المسلمين ‏\"‏ ‏.‏ وقال وإذا رفع رأسه من الركوع قال ‏\"‏ سمع الله لمن حمده ربنا ولك الحمد ‏\"‏ ‏.‏ وقال ‏\"‏ وصوره فأحسن صوره ‏\"‏ ‏.‏ وقال وإذا سلم قال ‏\"‏ اللهم اغفر لي ما قدمت ‏\"‏ .‏ إلى آخر الحديث ولم يقل بين التشهد والتسليم ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 241
			}
		},
		{
			"hadithnumber": 1814,
			"arabicnumber": "772",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، وأبو معاوية ح وحدثنا زهير بن حرب، وإسحاق بن إبراهيم، جميعا عن جرير، كلهم عن الأعمش، ح وحدثنا ابن، نمير - واللفظ له - حدثنا أبي، حدثنا الأعمش، عن سعد بن عبيدة، عن المستورد بن الأحنف، عن صلة بن زفر، عن حذيفة، قال صليت مع النبي صلى الله عليه وسلم ذات ليلة فافتتح البقرة فقلت يركع عند المائة ‏.‏ ثم مضى فقلت يصلي بها في ركعة فمضى فقلت يركع بها ‏.‏ ثم افتتح النساء فقرأها ثم افتتح آل عمران فقرأها يقرأ مترسلا إذا مر بآية فيها تسبيح سبح وإذا مر بسؤال سأل وإذا مر بتعوذ تعوذ ثم ركع فجعل يقول ‏\"‏ سبحان ربي العظيم ‏\"‏ ‏.‏ فكان ركوعه نحوا من قيامه ثم قال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ ثم قام طويلا قريبا مما ركع ثم سجد فقال ‏\"‏ سبحان ربي الأعلى ‏\"‏ ‏.‏ فكان سجوده قريبا من قيامه ‏.‏ قال وفي حديث جرير من الزيادة فقال ‏\"‏ سمع الله لمن حمده ربنا لك الحمد\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 242
			}
		},
		{
			"hadithnumber": 1815,
			"arabicnumber": "773.01",
			"text": "وحدثنا عثمان بن أبي شيبة، وإسحاق بن إبراهيم، كلاهما عن جرير، - قال عثمان حدثنا جرير، - عن الأعمش، عن أبي وائل، قال قال عبد الله صليت مع رسول الله صلى الله عليه وسلم فأطال حتى هممت بأمر سوء قال قيل وما هممت به قال هممت أن أجلس وأدعه ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 243
			}
		},
		{
			"hadithnumber": 1816,
			"arabicnumber": "773.02",
			"text": "وحدثناه إسماعيل بن الخليل، وسويد بن سعيد، عن علي بن مسهر، عن الأعمش، بهذا الإسناد ‏.‏ مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 244
			}
		},
		{
			"hadithnumber": 1817,
			"arabicnumber": "774",
			"text": "حدثنا عثمان بن أبي شيبة، وإسحاق، قال عثمان حدثنا جرير، عن منصور، عن أبي وائل، عن عبد الله، قال ذكر عند رسول الله صلى الله عليه وسلم رجل نام ليلة حتى أصبح قال ‏\"‏ ذاك رجل بال الشيطان في أذنيه ‏\"‏ ‏.‏ أو قال ‏\"‏ في أذنه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 245
			}
		},
		{
			"hadithnumber": 1818,
			"arabicnumber": "775",
			"text": "وحدثنا قتيبة بن سعيد، حدثنا ليث، عن عقيل، عن الزهري، عن علي بن حسين، أن الحسين بن علي، حدثه عن علي بن أبي طالب، أن النبي صلى الله عليه وسلم طرقه وفاطمة فقال ‏\"‏ ألا تصلون ‏\"‏ ‏.‏ فقلت يا رسول الله إنما أنفسنا بيد الله فإذا شاء أن يبعثنا بعثنا ‏.‏ فانصرف رسول الله صلى الله عليه وسلم حين قلت له ذلك ثم سمعته وهو مدبر يضرب فخذه ويقول ‏\"‏ وكان الإنسان أكثر شىء جدلا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 246
			}
		},
		{
			"hadithnumber": 1819,
			"arabicnumber": "776",
			"text": "حدثنا عمرو الناقد، وزهير بن حرب، قال عمرو حدثنا سفيان بن عيينة، عن أبي الزناد، عن الأعرج، عن أبي هريرة، يبلغ به النبي صلى الله عليه وسلم ‏ \"‏ يعقد الشيطان على قافية رأس أحدكم ثلاث عقد إذا نام بكل عقدة يضرب عليك ليلا طويلا فإذا استيقظ فذكر الله انحلت عقدة وإذا توضأ انحلت عقدتان فإذا صلى انحلت العقد فأصبح نشيطا طيب النفس وإلا أصبح خبيث النفس كسلان ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 247
			}
		},
		{
			"hadithnumber": 1820,
			"arabicnumber": "777.01",
			"text": "حدثنا محمد بن المثنى، حدثنا يحيى، عن عبيد الله، قال أخبرني نافع، عن ابن، عمر عن النبي صلى الله عليه وسلم قال ‏ \"‏ اجعلوا من صلاتكم في بيوتكم ولا تتخذوها قبورا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 248
			}
		},
		{
			"hadithnumber": 1821,
			"arabicnumber": "777.02",
			"text": "وحدثنا ابن المثنى، حدثنا عبد الوهاب، أخبرنا أيوب، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏ \"‏ صلوا في بيوتكم ولا تتخذوها قبورا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 249
			}
		},
		{
			"hadithnumber": 1822,
			"arabicnumber": "778",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، عن الأعمش، عن أبي سفيان، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا قضى أحدكم الصلاة في مسجده فليجعل لبيته نصيبا من صلاته فإن الله جاعل في بيته من صلاته خيرا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 250
			}
		},
		{
			"hadithnumber": 1823,
			"arabicnumber": "779",
			"text": "حدثنا عبد الله بن براد الأشعري، ومحمد بن العلاء، قالا حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏ \"‏ مثل البيت الذي يذكر الله فيه والبيت الذي لا يذكر الله فيه مثل الحى والميت ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 251
			}
		},
		{
			"hadithnumber": 1824,
			"arabicnumber": "780",
			"text": "حدثنا قتيبة بن سعيد، حدثنا يعقوب، - وهو ابن عبد الرحمن القاري - عن سهيل، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا تجعلوا بيوتكم مقابر إن الشيطان ينفر من البيت الذي تقرأ فيه سورة البقرة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 252
			}
		},
		{
			"hadithnumber": 1825,
			"arabicnumber": "781.01",
			"text": "وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا عبد الله بن سعيد، حدثنا سالم أبو النضر، مولى عمر بن عبيد الله عن بسر بن سعيد، عن زيد بن ثابت، قال احتجر رسول الله صلى الله عليه وسلم حجيرة بخصفة أو حصير فخرج رسول الله صلى الله عليه وسلم يصلي فيها - قال - فتتبع إليه رجال وجاءوا يصلون بصلاته - قال - ثم جاءوا ليلة فحضروا وأبطأ رسول الله صلى الله عليه وسلم عنهم - قال - فلم يخرج إليهم فرفعوا أصواتهم وحصبوا الباب فخرج إليهم رسول الله صلى الله عليه وسلم مغضبا‏ فقال لهم رسول الله صلى الله عليه وسلم ‏ \"‏ ما زال بكم صنيعكم حتى ظننت أنه سيكتب عليكم فعليكم بالصلاة في بيوتكم فإن خير صلاة المرء في بيته إلا الصلاة المكتوبة ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 253
			}
		},
		{
			"hadithnumber": 1826,
			"arabicnumber": "781.02",
			"text": "وحدثني محمد بن حاتم، حدثنا بهز، حدثنا وهيب، حدثنا موسى بن عقبة، قال سمعت أبا النضر، عن بسر بن سعيد، عن زيد بن ثابت، أن النبي صلى الله عليه وسلم اتخذ حجرة في المسجد من حصير فصلى رسول الله صلى الله عليه وسلم فيها ليالي حتى اجتمع إليه ناس ‏.‏ فذكر نحوه وزاد فيه ‏ \"‏ ولو كتب عليكم ما قمتم به ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 254
			}
		},
		{
			"hadithnumber": 1827,
			"arabicnumber": "782.01",
			"text": "وحدثنا محمد بن المثنى، حدثنا عبد الوهاب، - يعني الثقفي - حدثنا عبيد الله، عن سعيد بن أبي سعيد، عن أبي سلمة، عن عائشة، أنها قالت كان لرسول الله صلى الله عليه وسلم حصير وكان يحجره من الليل فيصلي فيه فجعل الناس يصلون بصلاته ويبسطه بالنهار فثابوا ذات ليلة فقال ‏ \"‏ يا أيها الناس عليكم من الأعمال ما تطيقون فإن الله لا يمل حتى تملوا وإن أحب الأعمال إلى الله ما دووم عليه وإن قل ‏\"‏ ‏.‏ وكان آل محمد صلى الله عليه وسلم إذا عملوا عملا أثبتوه ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 255
			}
		},
		{
			"hadithnumber": 1828,
			"arabicnumber": "782.02",
			"text": "حدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، عن سعد بن إبراهيم، أنه سمع أبا سلمة، يحدث عن عائشة، أن رسول الله صلى الله عليه وسلم سئل أى العمل أحب إلى الله قال ‏ \"‏ أدومه وإن قل ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 256
			}
		},
		{
			"hadithnumber": 1829,
			"arabicnumber": "783.01",
			"text": "وحدثنا زهير بن حرب، وإسحاق بن إبراهيم، قال زهير حدثنا جرير، عن منصور، عن إبراهيم، عن علقمة، قال سألت أم المؤمنين عائشة قال قلت يا أم المؤمنين كيف كان عمل رسول الله صلى الله عليه وسلم هل كان يخص شيئا من الأيام قالت لا ‏.‏ كان عمله ديمة وأيكم يستطيع ما كان رسول الله صلى الله عليه وسلم يستطيع",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 257
			}
		},
		{
			"hadithnumber": 1830,
			"arabicnumber": "783.02",
			"text": "وحدثنا ابن نمير، حدثنا أبي، حدثنا سعد بن سعيد، أخبرني القاسم بن محمد، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏ \"‏ أحب الأعمال إلى الله تعالى أدومها وإن قل ‏\"‏ ‏.‏ قال وكانت عائشة إذا عملت العمل لزمته ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 258
			}
		},
		{
			"hadithnumber": 1831,
			"arabicnumber": "784.01",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا ابن علية، ح وحدثني زهير بن حرب، حدثنا إسماعيل، عن عبد العزيز بن صهيب، عن أنس، قال دخل رسول الله صلى الله عليه وسلم المسجد وحبل ممدود بين ساريتين فقال ‏\"‏ ما هذا ‏\"‏ ‏.‏ قالوا لزينب تصلي فإذا كسلت أو فترت أمسكت به ‏.‏ فقال ‏\"‏ حلوه ليصل أحدكم نشاطه فإذا كسل أو فتر قعد ‏\"‏ ‏.‏ وفي حديث زهير ‏\"‏ فليقعد ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 259
			}
		},
		{
			"hadithnumber": 1832,
			"arabicnumber": "784.02",
			"text": "وحدثناه شيبان بن فروخ، حدثنا عبد الوارث، عن عبد العزيز، عن أنس، عن النبي صلى الله عليه وسلم مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 260
			}
		},
		{
			"hadithnumber": 1833,
			"arabicnumber": "785.01",
			"text": "وحدثني حرملة بن يحيى، ومحمد بن سلمة المرادي، قالا حدثنا ابن وهب، عن يونس، عن ابن شهاب، قال أخبرني عروة بن الزبير، أن عائشة، زوج النبي صلى الله عليه وسلم أخبرته أن الحولاء بنت تويت بن حبيب بن أسد بن عبد العزى مرت بها وعندها رسول الله صلى الله عليه وسلم فقلت هذه الحولاء بنت تويت وزعموا أنها لا تنام الليل فقال رسول الله صلى الله عليه وسلم ‏ \"‏ لا تنام الليل خذوا من العمل ما تطيقون فوالله لا يسأم الله حتى تسأموا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 261
			}
		},
		{
			"hadithnumber": 1834,
			"arabicnumber": "785.02",
			"text": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قال حدثنا أبو أسامة، عن هشام بن، عروة ح وحدثني زهير بن حرب، - واللفظ له - حدثنا يحيى بن سعيد، عن هشام، قال أخبرني أبي، عن عائشة، قالت دخل على رسول الله صلى الله عليه وسلم وعندي امرأة فقال ‏\"‏ من هذه ‏\"‏ ‏.‏ فقلت امرأة لا تنام تصلي ‏.‏ قال ‏\"‏ عليكم من العمل ما تطيقون فوالله لا يمل الله حتى تملوا ‏\"‏ ‏.‏ وكان أحب الدين إليه ما داوم عليه صاحبه وفي حديث أبي أسامة أنها امرأة من بني أسد ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 262
			}
		},
		{
			"hadithnumber": 1835,
			"arabicnumber": "786",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، ح وحدثنا ابن نمير، حدثنا أبي ح، وحدثنا أبو كريب، حدثنا أبو أسامة، جميعا عن هشام بن عروة، ح وحدثنا قتيبة، بن سعيد - واللفظ له - عن مالك بن أنس، عن هشام بن عروة، عن أبيه، عن عائشة، أن النبي صلى الله عليه وسلم قال ‏ \"‏ إذا نعس أحدكم في الصلاة فليرقد حتى يذهب عنه النوم فإن أحدكم إذا صلى وهو ناعس لعله يذهب يستغفر فيسب نفسه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 263
			}
		},
		{
			"hadithnumber": 1836,
			"arabicnumber": "787",
			"text": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن محمد، رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا قام أحدكم من الليل فاستعجم القرآن على لسانه فلم يدر ما يقول فليضطجع ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 264
			}
		},
		{
			"hadithnumber": 1837,
			"arabicnumber": "788.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو أسامة، عن هشام، عن أبيه، عن عائشة، أن النبي صلى الله عليه وسلم سمع رجلا يقرأ من الليل فقال ‏ \"‏ يرحمه الله لقد أذكرني كذا وكذا آية كنت أسقطتها من سورة كذا وكذا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 265
			}
		},
		{
			"hadithnumber": 1838,
			"arabicnumber": "788.02",
			"text": "وحدثنا ابن نمير، حدثنا عبدة، وأبو معاوية عن هشام، عن أبيه، عن عائشة، قالت كان النبي صلى الله عليه وسلم يستمع قراءة رجل في المسجد ‏.‏ فقال ‏ \"‏ رحمه الله لقد أذكرني آية كنت أنسيتها ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 266
			}
		},
		{
			"hadithnumber": 1839,
			"arabicnumber": "789.01",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن نافع، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إنما مثل صاحب القرآن كمثل الإبل المعقلة إن عاهد عليها أمسكها وإن أطلقها ذهبت ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 267
			}
		},
		{
			"hadithnumber": 1840,
			"arabicnumber": "789.02",
			"text": "حدثنا زهير بن حرب، ومحمد بن المثنى، وعبيد الله بن سعيد، قالوا حدثنا يحيى، وهو القطان ح وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، ح وحدثنا ابن نمير، حدثنا أبي كلهم، عن عبيد الله، ح وحدثنا ابن أبي عمر، حدثنا عبد الرزاق، أخبرنا معمر، عن أيوب، ح وحدثنا قتيبة بن سعيد، حدثنا يعقوب يعني ابن عبد الرحمن، ح وحدثنا محمد بن إسحاق المسيبي حدثنا أنس، - يعني ابن عياض - جميعا عن موسى بن عقبة، كل هؤلاء عن نافع، عن ابن عمر، عن النبي ‏.‏ بمعنى حديث مالك وزاد في حديث موسى بن عقبة ‏ \"‏ وإذا قام صاحب القرآن فقرأه بالليل والنهار ذكره وإذا لم يقم به نسيه ‏\"‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 268
			}
		},
		{
			"hadithnumber": 1841,
			"arabicnumber": "790.01",
			"text": "وحدثنا زهير بن حرب، وعثمان بن أبي شيبة، وإسحاق بن إبراهيم، قال إسحاق أخبرنا وقال الآخران، حدثنا جرير، عن منصور، عن أبي وائل، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ بئسما لأحدهم يقول نسيت آية كيت وكيت بل هو نسي استذكروا القرآن فلهو أشد تفصيا من صدور الرجال من النعم بعقلها ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 269
			}
		},
		{
			"hadithnumber": 1842,
			"arabicnumber": "790.02",
			"text": "حدثنا ابن نمير، حدثنا أبي وأبو معاوية ح وحدثنا يحيى بن يحيى، - واللفظ له - قال أخبرنا أبو معاوية، عن الأعمش، عن شقيق، قال قال عبد الله تعاهدوا هذه المصاحف - وربما قال القرآن - فلهو أشد تفصيا من صدور الرجال من النعم من عقله ‏.‏ قال وقال رسول الله صلى الله عليه وسلم ‏ \"‏ لا يقل أحدكم نسيت آية كيت وكيت بل هو نسي ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 270
			}
		},
		{
			"hadithnumber": 1843,
			"arabicnumber": "790.03",
			"text": "وحدثني محمد بن حاتم، حدثنا محمد بن بكر، أخبرنا ابن جريج، حدثني عبدة، بن أبي لبابة عن شقيق بن سلمة، قال سمعت ابن مسعود، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ بئسما للرجل أن يقول نسيت سورة كيت وكيت أو نسيت آية كيت وكيت بل هو نسي ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 271
			}
		},
		{
			"hadithnumber": 1844,
			"arabicnumber": "791",
			"text": "حدثنا عبد الله بن براد الأشعري، وأبو كريب قالا حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏ \"‏ تعاهدوا هذا القرآن فوالذي نفس محمد بيده لهو أشد تفلتا من الإبل في عقلها ‏\"‏ ‏.‏ ولفظ الحديث لابن براد",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 272
			}
		},
		{
			"hadithnumber": 1845,
			"arabicnumber": "792.01",
			"text": "حدثني عمرو الناقد، وزهير بن حرب، قالا حدثنا سفيان بن عيينة، عن الزهري، عن أبي سلمة، عن أبي هريرة، يبلغ به النبي صلى الله عليه وسلم قال ‏ \"‏ ما أذن الله لشىء ما أذن لنبي يتغنى بالقرآن ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 273
			}
		},
		{
			"hadithnumber": 1846,
			"arabicnumber": "792.02",
			"text": "وحدثني حرملة بن يحيى، أخبرنا ابن وهب، أخبرني يونس، ح وحدثني يونس، بن عبد الأعلى أخبرنا ابن وهب، أخبرني عمرو، كلاهما عن ابن شهاب، بهذا الإسناد قال ‏ \"‏ كما يأذن لنبي يتغنى بالقرآن ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 274
			}
		},
		{
			"hadithnumber": 1847,
			"arabicnumber": "792.03",
			"text": "حدثني بشر بن الحكم، حدثنا عبد العزيز بن محمد، حدثنا يزيد، - وهو ابن الهاد - عن محمد بن إبراهيم، عن أبي سلمة، عن أبي هريرة، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏ \"‏ ما أذن الله لشىء ما أذن لنبي حسن الصوت يتغنى بالقرآن يجهر به ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 275
			}
		},
		{
			"hadithnumber": 1848,
			"arabicnumber": "793.01",
			"text": "وحدثني ابن أخي ابن وهب، حدثنا عمي عبد الله بن وهب، أخبرني عمر بن، مالك وحيوة بن شريح عن ابن الهاد، بهذا الإسناد ‏.‏ مثله سواء وقال إن رسول الله صلى الله عليه وسلم ‏.‏ ولم يقل سمع ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 276
			}
		},
		{
			"hadithnumber": 1849,
			"arabicnumber": "793.02",
			"text": "وحدثنا الحكم بن موسى، حدثنا هقل، عن الأوزاعي، عن يحيى بن أبي كثير، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ ما أذن الله لشىء كأذنه لنبي يتغنى بالقرآن يجهر به ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 277
			}
		},
		{
			"hadithnumber": 1850,
			"arabicnumber": "793.03",
			"text": "وحدثنا يحيى بن أيوب، وقتيبة بن سعيد، وابن، حجر قالوا حدثنا إسماعيل، - وهو ابن جعفر - عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏.‏ مثل حديث يحيى بن أبي كثير غير أن ابن أيوب قال في روايته ‏ \"‏ كإذنه",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 278
			}
		},
		{
			"hadithnumber": 1851,
			"arabicnumber": "793.04",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، ح وحدثنا ابن نمير، حدثنا أبي، حدثنا مالك، - وهو ابن مغول - عن عبد الله بن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن عبد الله بن قيس أو الأشعري أعطي مزمارا من مزامير آل داود ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 279
			}
		},
		{
			"hadithnumber": 1852,
			"arabicnumber": "793.05",
			"text": "وحدثنا داود بن رشيد، حدثنا يحيى بن سعيد، حدثنا طلحة، عن أبي بردة، عن أبي موسى، قال قال رسول الله صلى الله عليه وسلم لأبي موسى ‏ \"‏ لو رأيتني وأنا أستمع لقراءتك البارحة لقد أوتيت مزمارا من مزامير آل داود ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 280
			}
		},
		{
			"hadithnumber": 1853,
			"arabicnumber": "794.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن إدريس، ووكيع، عن شعبة، عن معاوية بن قرة، قال سمعت عبد الله بن مغفل المزني، يقول قرأ النبي صلى الله عليه وسلم عام الفتح في مسير له سورة الفتح على راحلته فرجع في قراءته ‏.‏ قال معاوية لولا أني أخاف أن يجتمع على الناس لحكيت لكم قراءته ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 281
			}
		},
		{
			"hadithnumber": 1854,
			"arabicnumber": "794.02",
			"text": "وحدثنا محمد بن المثنى، ومحمد بن بشار، قال ابن المثنى حدثنا محمد بن جعفر، حدثنا شعبة، عن معاوية بن قرة، قال سمعت عبد الله بن مغفل، قال رأيت رسول الله صلى الله عليه وسلم يوم فتح مكة على ناقته يقرأ سورة الفتح ‏.‏ قال فقرأ ابن مغفل ورجع ‏.‏ فقال معاوية لولا الناس لأخذت لكم بذلك الذي ذكره ابن مغفل عن النبي صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 282
			}
		},
		{
			"hadithnumber": 1855,
			"arabicnumber": "794.03",
			"text": "وحدثناه يحيى بن حبيب الحارثي، حدثنا خالد بن الحارث، ح وحدثنا عبيد، الله بن معاذ حدثنا أبي قالا، حدثنا شعبة، بهذا الإسناد نحوه وفي حديث خالد بن الحارث قال على راحلة يسير وهو يقرأ سورة الفتح ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 283
			}
		},
		{
			"hadithnumber": 1856,
			"arabicnumber": "795.01",
			"text": "وحدثنا يحيى بن يحيى، أخبرنا أبو خيثمة، عن أبي إسحاق، عن البراء، قال كان رجل يقرأ سورة الكهف وعنده فرس مربوط بشطنين فتغشته سحابة فجعلت تدور وتدنو وجعل فرسه ينفر منها فلما أصبح أتى النبي صلى الله عليه وسلم فذكر ذلك له فقال ‏ \"‏ تلك السكينة تنزلت للقرآن ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 284
			}
		},
		{
			"hadithnumber": 1857,
			"arabicnumber": "795.02",
			"text": "وحدثنا ابن المثنى، وابن، بشار - واللفظ لابن المثنى - قالا حدثنا محمد بن، جعفر حدثنا شعبة، عن أبي إسحاق، قال سمعت البراء، يقول قرأ رجل الكهف وفي الدار دابة فجعلت تنفر فنظر فإذا ضبابة أو سحابة قد غشيته قال فذكر ذلك للنبي صلى الله عليه وسلم فقال ‏ \"‏ اقرأ فلان فإنها السكينة تنزلت عند القرآن أو تنزلت للقرآن ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 285
			}
		},
		{
			"hadithnumber": 1858,
			"arabicnumber": "795.03",
			"text": "وحدثنا ابن المثنى، حدثنا عبد الرحمن بن مهدي، وأبو داود قالا حدثنا شعبة، عن أبي إسحاق، قال سمعت البراء، يقول ‏.‏ فذكرا نحوه غير أنهما قالا تنقز ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 286
			}
		},
		{
			"hadithnumber": 1859,
			"arabicnumber": "796",
			"text": "وحدثني حسن بن علي الحلواني، وحجاج بن الشاعر، - وتقاربا في اللفظ - قالا حدثنا يعقوب بن إبراهيم، حدثنا أبي، حدثنا يزيد بن الهاد، أن عبد الله بن خباب، حدثه أن أبا سعيد الخدري حدثه أن أسيد بن حضير بينما هو ليلة يقرأ في مربده إذ جالت فرسه فقرأ ثم جالت أخرى فقرأ ثم جالت أيضا قال أسيد فخشيت أن تطأ يحيى فقمت إليها فإذا مثل الظلة فوق رأسي فيها أمثال السرج عرجت في الجو حتى ما أراها - قال - فغدوت على رسول الله صلى الله عليه وسلم فقلت يا رسول الله بينما أنا البارحة من جوف الليل أقرأ في مربدي إذ جالت فرسي ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اقرإ ابن حضير ‏\"‏ ‏.‏ قال فقرأت ثم جالت أيضا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اقرإ ابن حضير ‏\"‏ ‏.‏ قال فقرأت ثم جالت أيضا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اقرإ ابن حضير ‏\"‏ ‏.‏ قال فانصرفت ‏.‏ وكان يحيى قريبا منها خشيت أن تطأه فرأيت مثل الظلة فيها أمثال السرج عرجت في الجو حتى ما أراها فقال رسول الله صلى الله عليه وسلم ‏\"‏ تلك الملائكة كانت تستمع لك ولو قرأت لأصبحت يراها الناس ما تستتر منهم ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 287
			}
		},
		{
			"hadithnumber": 1860,
			"arabicnumber": "797.01",
			"text": "حدثنا قتيبة بن سعيد، وأبو كامل الجحدري كلاهما عن أبي عوانة، - قال قتيبة حدثنا أبو عوانة، - عن قتادة، عن أنس، عن أبي موسى الأشعري، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ مثل المؤمن الذي يقرأ القرآن مثل الأترجة ريحها طيب وطعمها طيب ومثل المؤمن الذي لا يقرأ القرآن مثل التمرة لا ريح لها وطعمها حلو ومثل المنافق الذي يقرأ القرآن مثل الريحانة ريحها طيب وطعمها مر ومثل المنافق الذي لا يقرأ القرآن كمثل الحنظلة ليس لها ريح وطعمها مر ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 288
			}
		},
		{
			"hadithnumber": 1861,
			"arabicnumber": "797.02",
			"text": "وحدثنا هداب بن خالد، حدثنا همام، ح وحدثنا محمد بن المثنى، حدثنا يحيى، بن سعيد عن شعبة، كلاهما عن قتادة، بهذا الإسناد ‏.‏ مثله غير أن في حديث همام بدل المنافق الفاجر ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 289
			}
		},
		{
			"hadithnumber": 1862,
			"arabicnumber": "798.01",
			"text": "حدثنا قتيبة بن سعيد، ومحمد بن عبيد الغبري، جميعا عن أبي عوانة، - قال ابن عبيد حدثنا أبو عوانة، - عن قتادة، عن زرارة بن أوفى، عن سعد بن هشام، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏ \"‏ الماهر بالقرآن مع السفرة الكرام البررة والذي يقرأ القرآن ويتتعتع فيه وهو عليه شاق له أجران ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 290
			}
		},
		{
			"hadithnumber": 1863,
			"arabicnumber": "798.02",
			"text": "وحدثنا محمد بن المثنى، حدثنا ابن أبي عدي، عن سعيد، ح وحدثنا أبو بكر، بن أبي شيبة حدثنا وكيع، عن هشام الدستوائي، كلاهما عن قتادة، بهذا الإسناد ‏.‏ وقال في حديث وكيع ‏ \"‏ والذي يقرأ وهو يشتد عليه له أجران ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 291
			}
		},
		{
			"hadithnumber": 1864,
			"arabicnumber": "799.01",
			"text": "حدثنا هداب بن خالد، حدثنا همام، حدثنا قتادة، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم قال لأبى ‏\"‏ إن الله أمرني أن أقرأ عليك ‏\"‏ ‏.‏ قال آلله سماني لك قال ‏\"‏ الله سماك لي ‏\"‏ ‏.‏ قال فجعل أبى يبكي ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 292
			}
		},
		{
			"hadithnumber": 1865,
			"arabicnumber": "799.02",
			"text": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، قال سمعت قتادة، يحدث عن أنس، قال قال رسول الله صلى الله عليه وسلم لأبى بن كعب ‏\"‏ إن الله أمرني أن أقرأ عليك ‏{‏ لم يكن الذين كفروا‏}‏ ‏\"‏ ‏.‏ قال وسماني لك قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال فبكى ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 293
			}
		},
		{
			"hadithnumber": 1866,
			"arabicnumber": "799.03",
			"text": "حدثنا يحيى بن حبيب الحارثي، حدثنا خالد، - يعني ابن الحارث - حدثنا شعبة، عن قتادة، قال سمعت أنسا، يقول قال رسول الله صلى الله عليه وسلم لأبى بمثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 294
			}
		},
		{
			"hadithnumber": 1867,
			"arabicnumber": "800.01",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب جميعا عن حفص، - قال أبو بكر حدثنا حفص بن غياث، - عن الأعمش، عن إبراهيم، عن عبيدة، عن عبد الله، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ اقرأ على القرآن ‏\"‏ ‏.‏ قال فقلت يا رسول الله أقرأ عليك وعليك أنزل قال ‏\"‏ إني أشتهي أن أسمعه من غيري ‏\"‏ ‏.‏ فقرأت النساء حتى إذا بلغت ‏{‏ فكيف إذا جئنا من كل أمة بشهيد وجئنا بك على هؤلاء شهيدا‏}‏ رفعت رأسي أو غمزني رجل إلى جنبي فرفعت رأسي فرأيت دموعه تسيل ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 295
			}
		},
		{
			"hadithnumber": 1868,
			"arabicnumber": "800.02",
			"text": "حدثنا هناد بن السري، ومنجاب بن الحارث التميمي، جميعا عن علي بن مسهر، عن الأعمش، بهذا الإسناد ‏.‏ وزاد هناد في روايته قال لي رسول الله صلى الله عليه وسلم وهو على المنبر ‏ \"‏ اقرأ على ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 296
			}
		},
		{
			"hadithnumber": 1869,
			"arabicnumber": "800.03",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو أسامة، حدثني مسعر، - وقال أبو كريب عن مسعر، - عن عمرو بن مرة، عن إبراهيم، قال قال النبي صلى الله عليه وسلم لعبد الله بن مسعود ‏\"‏ اقرأ على ‏\"‏ ‏.‏ قال أقرأ عليك وعليك أنزل قال ‏\"‏ إني أحب أن أسمعه من غيري ‏\"‏ قال فقرأ عليه من أول سورة النساء إلى قوله ‏{‏ فكيف إذا جئنا من كل أمة بشهيد وجئنا بك على هؤلاء شهيدا‏}‏ فبكى ‏.‏ قال مسعر فحدثني معن عن جعفر بن عمرو بن حريث عن أبيه عن ابن مسعود قال قال النبي صلى الله عليه وسلم ‏\"‏ شهيدا عليهم ما دمت فيهم أو ما كنت فيهم ‏\"‏ ‏.‏ شك مسعر ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 297
			}
		},
		{
			"hadithnumber": 1870,
			"arabicnumber": "801.01",
			"text": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، قال كنت بحمص فقال لي بعض القوم اقرأ علينا ‏.‏ فقرأت عليهم سورة يوسف - قال - فقال رجل من القوم والله ما هكذا أنزلت ‏.‏ قال قلت ويحك والله لقد قرأتها على رسول الله صلى الله عليه وسلم فقال لي ‏ \"‏ أحسنت ‏\"‏ ‏.‏ فبينما أنا أكلمه إذ وجدت منه ريح الخمر قال فقلت أتشرب الخمر وتكذب بالكتاب لا تبرح حتى أجلدك - قال - فجلدته الحد ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 298
			}
		},
		{
			"hadithnumber": 1871,
			"arabicnumber": "801.02",
			"text": "وحدثنا إسحاق بن إبراهيم، وعلي بن خشرم، قالا أخبرنا عيسى بن يونس، ح وحدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، جميعا عن الأعمش، بهذا الإسناد ‏.‏ وليس في حديث أبي معاوية فقال لي ‏ \"‏ أحسنت ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 299
			}
		},
		{
			"hadithnumber": 1872,
			"arabicnumber": "802",
			"text": "حدثنا أبو بكر بن أبي شيبة، وأبو سعيد الأشج قالا حدثنا وكيع، عن الأعمش،عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أيحب أحدكم إذا رجع إلى أهله أن يجد فيه ثلاث خلفات عظام سمان ‏\"‏ ‏.‏ قلنا نعم ‏.‏ قال ‏\"‏ فثلاث آيات يقرأ بهن أحدكم في صلاته خير له من ثلاث خلفات عظام سمان ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 300
			}
		},
		{
			"hadithnumber": 1873,
			"arabicnumber": "803",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا الفضل بن دكين، عن موسى بن على، قال سمعت أبي يحدث، عن عقبة بن عامر، قال خرج رسول الله صلى الله عليه وسلم ونحن في الصفة فقال ‏\"‏ أيكم يحب أن يغدو كل يوم إلى بطحان أو إلى العقيق فيأتي منه بناقتين كوماوين في غير إثم ولا قطع رحم ‏\"‏ ‏.‏ فقلنا يا رسول الله نحب ذلك ‏.‏ قال ‏\"‏ أفلا يغدو أحدكم إلى المسجد فيعلم أو يقرأ آيتين من كتاب الله عز وجل خير له من ناقتين وثلاث خير له من ثلاث وأربع خير له من أربع ومن أعدادهن من الإبل ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 301
			}
		},
		{
			"hadithnumber": 1874,
			"arabicnumber": "804.01",
			"text": "حدثني الحسن بن علي الحلواني، حدثنا أبو توبة، - وهو الربيع بن نافع - حدثنا معاوية، - يعني ابن سلام - عن زيد، أنه سمع أبا سلام، يقول حدثني أبو أمامة، الباهلي قال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ اقرءوا القرآن فإنه يأتي يوم القيامة شفيعا لأصحابه اقرءوا الزهراوين البقرة وسورة آل عمران فإنهما تأتيان يوم القيامة كأنهما غمامتان أو كأنهما غيايتان أو كأنهما فرقان من طير صواف تحاجان عن أصحابهما اقرءوا سورة البقرة فإن أخذها بركة وتركها حسرة ولا تستطيعها البطلة ‏\"‏ ‏.‏ قال معاوية بلغني أن البطلة السحرة ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 302
			}
		},
		{
			"hadithnumber": 1875,
			"arabicnumber": "804.02",
			"text": "وحدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا يحيى، - يعني ابن حسان - حدثنا معاوية، بهذا الإسناد ‏.‏ مثله غير أنه قال ‏ \"‏ وكأنهما ‏\"‏ ‏.‏ في كليهما ولم يذكر قول معاوية بلغني ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 303
			}
		},
		{
			"hadithnumber": 1876,
			"arabicnumber": "805",
			"text": "حدثني إسحاق بن منصور، أخبرنا يزيد بن عبد ربه، حدثنا الوليد بن مسلم، عن محمد بن مهاجر، عن الوليد بن عبد الرحمن الجرشي، عن جبير بن نفير، قال سمعت النواس، بن سمعان الكلابي يقول سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ يؤتى بالقرآن يوم القيامة وأهله الذين كانوا يعملون به تقدمه سورة البقرة وآل عمران ‏\"‏ ‏.‏ وضرب لهما رسول الله صلى الله عليه وسلم ثلاثة أمثال ما نسيتهن بعد قال ‏\"‏ كأنهما غمامتان أو ظلتان سوداوان بينهما شرق أو كأنهما حزقان من طير صواف تحاجان عن صاحبهما",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 304
			}
		},
		{
			"hadithnumber": 1877,
			"arabicnumber": "806",
			"text": "حدثنا حسن بن الربيع، وأحمد بن جواس الحنفي، قالا حدثنا أبو الأحوص، عن عمار بن رزيق، عن عبد الله بن عيسى، عن سعيد بن جبير، عن ابن عباس، قال بينما جبريل قاعد عند النبي صلى الله عليه وسلم سمع نقيضا من فوقه فرفع رأسه فقال هذا باب من السماء فتح اليوم لم يفتح قط إلا اليوم فنزل منه ملك فقال هذا ملك نزل إلى الأرض لم ينزل قط إلا اليوم فسلم وقال أبشر بنورين أوتيتهما لم يؤتهما نبي قبلك فاتحة الكتاب وخواتيم سورة البقرة لن تقرأ بحرف منهما إلا أعطيته ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 305
			}
		},
		{
			"hadithnumber": 1878,
			"arabicnumber": "807.01",
			"text": "وحدثنا أحمد بن يونس، حدثنا زهير، حدثنا منصور، عن إبراهيم، عن عبد الرحمن، بن يزيد قال لقيت أبا مسعود عند البيت فقلت حديث بلغني عنك في الآيتين في سورة البقرة ‏.‏ فقال نعم ‏.‏ قال رسول الله صلى الله عليه وسلم ‏ \"‏ الآيتان من آخر سورة البقرة من قرأهما في ليلة كفتاه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 306
			}
		},
		{
			"hadithnumber": 1879,
			"arabicnumber": "807.02",
			"text": "وحدثناه إسحاق بن إبراهيم، أخبرنا جرير، ح وحدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، كلاهما عن منصور، بهذا الإسناد ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 307
			}
		},
		{
			"hadithnumber": 1880,
			"arabicnumber": "808.01",
			"text": "حدثنا منجاب بن الحارث التميمي، أخبرنا ابن مسهر، عن الأعمش، عن إبراهيم، عن عبد الرحمن بن يزيد، عن علقمة بن قيس، عن أبي مسعود الأنصاري، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من قرأ هاتين الآيتين من آخر سورة البقرة في ليلة كفتاه ‏\"‏ ‏.‏ قال عبد الرحمن فلقيت أبا مسعود وهو يطوف بالبيت فسألته فحدثني به عن النبي صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 308
			}
		},
		{
			"hadithnumber": 1881,
			"arabicnumber": "808.02",
			"text": "وحدثني علي بن خشرم، أخبرنا عيسى يعني ابن يونس، ح وحدثنا أبو بكر، بن أبي شيبة حدثنا عبد الله بن نمير، جميعا عن الأعمش، عن إبراهيم، عن علقمة، وعبد، الرحمن بن يزيد عن أبي مسعود، عن النبي صلى الله عليه وسلم مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 309
			}
		},
		{
			"hadithnumber": 1882,
			"arabicnumber": "808.03",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا حفص، وأبو معاوية عن الأعمش، عن إبراهيم، عن عبد الرحمن بن يزيد، عن أبي مسعود، عن النبي صلى الله عليه وسلم مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 310
			}
		},
		{
			"hadithnumber": 1883,
			"arabicnumber": "809.01",
			"text": "وحدثنا محمد بن المثنى، حدثنا معاذ بن هشام، حدثني أبي، عن قتادة، عن سالم، بن أبي الجعد الغطفاني عن معدان بن أبي طلحة اليعمري، عن أبي الدرداء، أن النبي صلى الله عليه وسلم قال ‏ \"‏ من حفظ عشر آيات من أول سورة الكهف عصم من الدجال ‏\"‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 311
			}
		},
		{
			"hadithnumber": 1884,
			"arabicnumber": "809.02",
			"text": "وحدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، ح وحدثني زهير بن حرب، حدثنا عبد الرحمن بن مهدي، حدثنا همام، جميعا عن قتادة، بهذا الإسناد قال شعبة من آخر الكهف ‏.‏ وقال همام من أول الكهف كما قال هشام",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 312
			}
		},
		{
			"hadithnumber": 1885,
			"arabicnumber": "810",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الأعلى بن عبد الأعلى، عن الجريري، عن أبي السليل، عن عبد الله بن رباح الأنصاري، عن أبى بن كعب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يا أبا المنذر أتدري أى آية من كتاب الله معك أعظم ‏\"‏ ‏.‏ قال قلت الله ورسوله أعلم ‏.‏ قال ‏\"‏ يا أبا المنذر أتدري أى آية من كتاب الله معك أعظم ‏\"‏ ‏.‏ قال قلت الله لا إله إلا هو الحى القيوم ‏.‏ قال فضرب في صدري وقال ‏\"‏ والله ليهنك العلم أبا المنذر ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 313
			}
		},
		{
			"hadithnumber": 1886,
			"arabicnumber": "811.01",
			"text": "وحدثني زهير بن حرب، ومحمد بن بشار، قال زهير حدثنا يحيى بن سعيد، عن شعبة، عن قتادة، عن سالم بن أبي الجعد، عن معدان بن أبي طلحة، عن أبي الدرداء، عن النبي صلى الله عليه وسلم قال ‏\"‏ أيعجز أحدكم أن يقرأ في ليلة ثلث القرآن ‏\" قالوا : وكيف يقرأ ثلث القرآن ؟ قال : \" قل هو الله أحد تعدل ثلث القرآن \" ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 314
			}
		},
		{
			"hadithnumber": 1887,
			"arabicnumber": "811.02",
			"text": "وحدثنا إسحاق بن إبراهيم، أخبرنا محمد بن بكر، حدثنا سعيد بن أبي عروبة، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا عفان، حدثنا أبان العطار، جميعا عن قتادة، بهذا الإسناد ‏.‏ وفي حديثهما من قول النبي صلى الله عليه وسلم قال ‏ \"‏ إن الله جزأ القرآن ثلاثة أجزاء فجعل قل هو الله أحد جزءا من أجزاء القرآن ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 315
			}
		},
		{
			"hadithnumber": 1888,
			"arabicnumber": "812.01",
			"text": "وحدثني محمد بن حاتم، ويعقوب بن إبراهيم، جميعا عن يحيى، - قال ابن حاتم حدثنا يحيى بن سعيد، - حدثنا يزيد بن كيسان، حدثنا أبو حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ احشدوا فإني سأقرأ عليكم ثلث القرآن ‏\"‏ ‏.‏ فحشد من حشد ثم خرج نبي الله صلى الله عليه وسلم فقرأ ‏{‏ قل هو الله أحد‏}‏ ثم دخل فقال بعضنا لبعض إني أرى هذا خبر جاءه من السماء فذاك الذي أدخله ‏.‏ ثم خرج نبي الله صلى الله عليه وسلم فقال ‏\"‏ إني قلت لكم سأقرأ عليكم ثلث القرآن ألا إنها تعدل ثلث القرآن ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 316
			}
		},
		{
			"hadithnumber": 1889,
			"arabicnumber": "812.02",
			"text": "وحدثنا واصل بن عبد الأعلى، حدثنا ابن فضيل، عن بشير أبي إسماعيل، عن أبي حازم، عن أبي هريرة، قال خرج إلينا رسول الله صلى الله عليه وسلم فقال ‏\"‏ أقرأ عليكم ثلث القرآن ‏\"‏ ‏.‏ فقرأ ‏{‏ قل هو الله أحد * الله الصمد‏}‏ حتى ختمها ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 317
			}
		},
		{
			"hadithnumber": 1890,
			"arabicnumber": "813",
			"text": "حدثنا أحمد بن عبد الرحمن بن وهب، حدثنا عمي عبد الله بن وهب، حدثنا عمرو بن الحارث، عن سعيد بن أبي هلال، أن أبا الرجال، محمد بن عبد الرحمن حدثه عن أمه، عمرة بنت عبد الرحمن وكانت في حجر عائشة زوج النبي صلى الله عليه وسلم عن عائشة أن رسول الله صلى الله عليه وسلم بعث رجلا على سرية وكان يقرأ لأصحابه في صلاتهم فيختم بـ ‏{‏ قل هو الله أحد‏}‏ فلما رجعوا ذكر ذلك لرسول الله صلى الله عليه وسلم فقال ‏\"‏ سلوه لأى شىء يصنع ذلك ‏\"‏ ‏.‏ فسألوه فقال لأنها صفة الرحمن فأنا أحب أن أقرأ بها ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أخبروه أن الله يحبه",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 318
			}
		},
		{
			"hadithnumber": 1891,
			"arabicnumber": "814.01",
			"text": "وحدثنا قتيبة بن سعيد، حدثنا جرير، عن بيان، عن قيس بن أبي حازم، عن عقبة بن عامر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ألم تر آيات أنزلت الليلة لم ير مثلهن قط ‏{‏ قل أعوذ برب الفلق‏}‏ و ‏{‏ قل أعوذ برب الناس‏}‏ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 319
			}
		},
		{
			"hadithnumber": 1892,
			"arabicnumber": "814.02",
			"text": "وحدثني محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا إسماعيل، عن قيس، عن عقبة بن عامر، قال قال لي رسول الله صلى الله عليه وسلم ‏ \"‏ أنزل - أو أنزلت - على آيات لم ير مثلهن قط المعوذتين ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 320
			}
		},
		{
			"hadithnumber": 1893,
			"arabicnumber": "814.03",
			"text": "وحدثناه أبو بكر بن أبي شيبة، حدثنا وكيع، ح وحدثني محمد بن رافع، حدثنا أبو أسامة، كلاهما عن إسماعيل، بهذا الإسناد مثله ‏.‏ وفي رواية أبي أسامة عن عقبة، بن عامر الجهني وكان من رفعاء أصحاب محمد صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 321
			}
		},
		{
			"hadithnumber": 1894,
			"arabicnumber": "815.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، وزهير بن حرب، كلهم عن ابن عيينة، - قال زهير حدثنا سفيان بن عيينة، - حدثنا الزهري، عن سالم، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏ \"‏ لا حسد إلا في اثنتين رجل آتاه الله القرآن فهو يقوم به آناء الليل وآناء النهار ورجل آتاه الله مالا فهو ينفقه آناء الليل وآناء النهار ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 322
			}
		},
		{
			"hadithnumber": 1895,
			"arabicnumber": "815.02",
			"text": "وحدثني حرملة بن يحيى، أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، قال أخبرني سالم بن عبد الله بن عمر، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا حسد إلا على اثنتين رجل آتاه الله هذا الكتاب فقام به آناء الليل وآناء النهار ورجل آتاه الله مالا فتصدق به آناء الليل وآناء النهار ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 323
			}
		},
		{
			"hadithnumber": 1896,
			"arabicnumber": "816",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن إسماعيل، عن قيس، قال قال عبد الله بن مسعود ح وحدثنا ابن نمير، حدثنا أبي ومحمد بن بشر، قالا حدثنا إسماعيل، عن قيس، قال سمعت عبد الله بن مسعود، يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا حسد إلا في اثنتين رجل آتاه الله مالا فسلطه على هلكته في الحق ورجل آتاه الله حكمة فهو يقضي بها ويعلمها ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 324
			}
		},
		{
			"hadithnumber": 1897,
			"arabicnumber": "817.01",
			"text": "وحدثني زهير بن حرب، حدثنا يعقوب بن إبراهيم، حدثني أبي، عن ابن شهاب، عن عامر بن واثلة، أن نافع بن عبد الحارث، لقي عمر بعسفان وكان عمر يستعمله على مكة فقال من استعملت على أهل الوادي فقال ابن أبزى ‏.‏ قال ومن ابن أبزى قال مولى من موالينا ‏.‏ قال فاستخلفت عليهم مولى قال إنه قارئ لكتاب الله عز وجل وإنه عالم بالفرائض ‏.‏ قال عمر أما إن نبيكم صلى الله عليه وسلم قد قال ‏ \"‏ إن الله يرفع بهذا الكتاب أقواما ويضع به آخرين ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 325
			}
		},
		{
			"hadithnumber": 1898,
			"arabicnumber": "817.02",
			"text": "وحدثني عبد الله بن عبد الرحمن الدارمي، وأبو بكر بن إسحاق قالا أخبرنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال حدثني عامر بن واثلة الليثي، أن نافع بن، عبد الحارث الخزاعي لقي عمر بن الخطاب بعسفان ‏.‏ بمثل حديث إبراهيم بن سعد عن الزهري، ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 326
			}
		},
		{
			"hadithnumber": 1899,
			"arabicnumber": "818.01",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن ابن شهاب، عن عروة بن الزبير، عن عبد الرحمن بن عبد القاري، قال سمعت عمر بن الخطاب، يقول سمعت هشام بن، حكيم بن حزام يقرأ سورة الفرقان على غير ما أقرؤها وكان رسول الله صلى الله عليه وسلم أقرأنيها فكدت أن أعجل عليه ثم أمهلته حتى انصرف ثم لببته بردائه فجئت به رسول الله صلى الله عليه وسلم فقلت يا رسول الله إني سمعت هذا يقرأ سورة الفرقان على غير ما أقرأتنيها ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أرسله اقرأ ‏\"‏ ‏.‏ فقرأ القراءة التي سمعته يقرأ فقال رسول الله صلى الله عليه وسلم ‏\"‏ هكذا أنزلت ‏\"‏ ‏.‏ ثم قال لي ‏\"‏ اقرأ ‏\"‏ ‏.‏ فقرأت فقال ‏\"‏ هكذا أنزلت إن هذا القرآن أنزل على سبعة أحرف فاقرءوا ما تيسر منه ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 327
			}
		},
		{
			"hadithnumber": 1900,
			"arabicnumber": "818.02",
			"text": "وحدثني حرملة بن يحيى، أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، أخبرني عروة بن الزبير، أن المسور بن مخرمة، وعبد الرحمن بن عبد القاري، أخبراه أنهما، سمعا عمر بن الخطاب، يقول سمعت هشام بن حكيم، يقرأ سورة الفرقان في حياة رسول الله صلى الله عليه وسلم ‏.‏ وساق الحديث بمثله وزاد فكدت أساوره في الصلاة فتصبرت حتى سلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 328
			}
		},
		{
			"hadithnumber": 1901,
			"arabicnumber": "818.03",
			"text": "حدثنا إسحاق بن إبراهيم، وعبد بن حميد، قالا أخبرنا عبد الرزاق، أخبرنا معمر، عن الزهري، كرواية يونس بإسناده ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 329
			}
		},
		{
			"hadithnumber": 1902,
			"arabicnumber": "819.01",
			"text": "وحدثني حرملة بن يحيى، أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، حدثني عبيد الله بن عبد الله بن عتبة، أن ابن عباس، حدثه أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ أقرأني جبريل - عليه السلام - على حرف فراجعته فلم أزل أستزيده فيزيدني حتى انتهى إلى سبعة أحرف ‏\"‏ ‏.‏ قال ابن شهاب بلغني أن تلك السبعة الأحرف إنما هي في الأمر الذي يكون واحدا لا يختلف في حلال ولا حرام ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 330
			}
		},
		{
			"hadithnumber": 1903,
			"arabicnumber": "819.02",
			"text": "وحدثناه عبد بن حميد، أخبرنا عبد الرزاق، أخبرنا معمر، عن الزهري، بهذا الإسناد",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 331
			}
		},
		{
			"hadithnumber": 1904,
			"arabicnumber": "820.01",
			"text": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا إسماعيل بن أبي خالد، عن عبد الله بن عيسى بن عبد الرحمن بن أبي ليلى، عن جده، عن أبى بن كعب، قال كنت في المسجد فدخل رجل يصلي فقرأ قراءة أنكرتها عليه ثم دخل آخر فقرأ قراءة سوى قراءة صاحبه فلما قضينا الصلاة دخلنا جميعا على رسول الله صلى الله عليه وسلم فقلت إن هذا قرأ قراءة أنكرتها عليه ودخل آخر فقرأ سوى قراءة صاحبه فأمرهما رسول الله صلى الله عليه وسلم فقرءا فحسن النبي صلى الله عليه وسلم شأنهما فسقط في نفسي من التكذيب ولا إذ كنت في الجاهلية فلما رأى رسول الله صلى الله عليه وسلم ما قد غشيني ضرب في صدري ففضت عرقا وكأنما أنظر إلى الله عز وجل فرقا فقال لي ‏\"‏ يا أبى أرسل إلى أن اقرإ القرآن على حرف فرددت إليه أن هون على أمتي ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 332
			}
		},
		{
			"hadithnumber": 1905,
			"arabicnumber": "820.02",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، حدثني إسماعيل بن أبي، خالد حدثني عبد الله بن عيسى، عن عبد الرحمن بن أبي ليلى، أخبرني أبى بن كعب، أنه كان جالسا في المسجد إذ دخل رجل فصلى فقرأ قراءة واقتص الحديث بمثل حديث ابن نمير ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 333
			}
		},
		{
			"hadithnumber": 1906,
			"arabicnumber": "821.01",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا غندر، عن شعبة، ح وحدثناه ابن المثنى، وابن بشار قال ابن المثنى حدثنا محمد بن جعفر، حدثنا شعبة، عن الحكم، عن مجاهد، عن ابن أبي ليلى، عن أبى بن كعب، أن النبي صلى الله عليه وسلم كان عند أضاة بني غفار - قال - فأتاه جبريل عليه السلام فقال إن الله يأمرك أن تقرأ أمتك القرآن على حرف ‏.‏ فقال ‏\"‏ أسأل الله معافاته ومغفرته وإن أمتي لا تطيق ذلك ‏\"‏ ‏.‏ ثم أتاه الثانية فقال إن الله يأمرك أن تقرأ أمتك القرآن على حرفين فقال ‏\"‏ أسأل الله معافاته ومغفرته وإن أمتي لا تطيق ذلك ‏\"‏ ‏.‏ ثم جاءه الثالثة فقال إن الله يأمرك أن تقرأ أمتك القرآن على ثلاثة أحرف ‏.‏ فقال ‏\"‏ أسأل الله معافاته ومغفرته وإن أمتي لا تطيق ذلك ‏\"‏ ‏.‏ ثم جاءه الرابعة فقال إن الله يأمرك أن تقرأ أمتك القرآن على سبعة أحرف فأيما حرف قرءوا عليه فقد أصابوا ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 334
			}
		},
		{
			"hadithnumber": 1907,
			"arabicnumber": "821.02",
			"text": "وحدثناه عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، بهذا الإسناد مثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 335
			}
		},
		{
			"hadithnumber": 1908,
			"arabicnumber": "822.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، وابن، نمير جميعا عن وكيع، - قال أبو بكر حدثنا وكيع، - عن الأعمش، عن أبي وائل، قال جاء رجل يقال له نهيك بن سنان إلى عبد الله فقال يا أبا عبد الرحمن كيف تقرأ هذا الحرف ألفا تجده أم ياء من ماء غير آسن أو من ماء غير ياسن قال فقال عبد الله وكل القرآن قد أحصيت غير هذا قال إني لأقرأ المفصل في ركعة ‏.‏ فقال عبد الله هذا كهذ الشعر إن أقواما يقرءون القرآن لا يجاوز تراقيهم ولكن إذا وقع في القلب فرسخ فيه نفع إن أفضل الصلاة الركوع والسجود إني لأعلم النظائر التي كان رسول الله صلى الله عليه وسلم يقرن بينهن سورتين في كل ركعة ‏.‏ ثم قام عبد الله فدخل علقمة في إثره ثم خرج فقال قد أخبرني بها ‏.‏ قال ابن نمير في روايته جاء رجل من بني بجيلة إلى عبد الله ولم يقل نهيك بن سنان ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 336
			}
		},
		{
			"hadithnumber": 1909,
			"arabicnumber": "822.02",
			"text": "وحدثنا أبو كريب، حدثنا أبو معاوية، عن الأعمش، عن أبي وائل، قال جاء رجل إلى عبد الله يقال له نهيك بن سنان ‏.‏ بمثل حديث وكيع غير أنه قال فجاء علقمة ليدخل عليه فقلنا له سله عن النظائر التي كان رسول الله صلى الله عليه وسلم يقرأ بها في ركعة فدخل عليه فسأله ثم خرج علينا فقال عشرون سورة من المفصل في تأليف عبد الله ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 337
			}
		},
		{
			"hadithnumber": 1910,
			"arabicnumber": "822.03",
			"text": "وحدثناه إسحاق بن إبراهيم، أخبرنا عيسى بن يونس، حدثنا الأعمش، في هذا الإسناد ‏.‏ بنحو حديثهما وقال إني لأعرف النظائر التي كان يقرأ بهن رسول الله صلى الله عليه وسلم اثنتين في ركعة ‏.‏ عشرين سورة في عشر ركعات ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 338
			}
		},
		{
			"hadithnumber": 1911,
			"arabicnumber": "822.04",
			"text": "حدثنا شيبان بن فروخ، حدثنا مهدي بن ميمون، حدثنا واصل الأحدب، عن أبي، وائل قال غدونا على عبد الله بن مسعود يوما بعد ما صلينا الغداة فسلمنا بالباب فأذن لنا - قال - فمكثنا بالباب هنية - قال - فخرجت الجارية فقالت ألا تدخلون فدخلنا فإذا هو جالس يسبح فقال ما منعكم أن تدخلوا وقد أذن لكم فقلنا لا إلا أنا ظننا أن بعض أهل البيت نائم ‏.‏ قال ظننتم بآل ابن أم عبد غفلة قال ثم أقبل يسبح حتى ظن أن الشمس قد طلعت فقال يا جارية انظري هل طلعت قال فنظرت فإذا هي لم تطلع فأقبل يسبح حتى إذا ظن أن الشمس قد طلعت قال يا جارية انظري هل طلعت فنظرت فإذا هي قد طلعت ‏.‏ فقال الحمد لله الذي أقالنا يومنا هذا - فقال مهدي وأحسبه قال - ولم يهلكنا بذنوبنا - قال - فقال رجل من القوم قرأت المفصل البارحة كله - قال - فقال عبد الله هذا كهذ الشعر إنا لقد سمعنا القرائن وإني لأحفظ القرائن التي كان يقرؤهن رسول الله صلى الله عليه وسلم ثمانية عشر من المفصل وسورتين من آل حم",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 339
			}
		},
		{
			"hadithnumber": 1912,
			"arabicnumber": "822.05",
			"text": "حدثنا عبد بن حميد، حدثنا حسين بن علي الجعفي، عن زائدة، عن منصور، عن شقيق، قال جاء رجل من بني بجيلة يقال له نهيك بن سنان إلى عبد الله فقال إني أقرأ المفصل في ركعة ‏.‏ فقال عبد الله هذا كهذ الشعر لقد علمت النظائر التي كان رسول الله صلى الله عليه وسلم يقرأ بهن سورتين في ركعة ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 340
			}
		},
		{
			"hadithnumber": 1913,
			"arabicnumber": "822.06",
			"text": "حدثنا محمد بن المثنى، وابن، بشار قال ابن المثنى حدثنا محمد بن جعفر، حدثنا شعبة، عن عمرو بن مرة، أنه سمع أبا وائل، يحدث أن رجلا، جاء إلى ابن مسعود فقال إني قرأت المفصل الليلة كله في ركعة ‏.‏ فقال عبد الله هذا كهذ الشعر فقال عبد الله لقد عرفت النظائر التي كان رسول الله صلى الله عليه وسلم يقرن بينهن - قال - فذكر عشرين سورة من المفصل سورتين سورتين في كل ركعة ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 341
			}
		},
		{
			"hadithnumber": 1914,
			"arabicnumber": "823.01",
			"text": "حدثنا أحمد بن عبد الله بن يونس، حدثنا زهير، حدثنا أبو إسحاق، قال رأيت رجلا سأل الأسود بن يزيد وهو يعلم القرآن في المسجد فقال كيف تقرأ هذه الآية فهل من مدكر أدالا أم ذالا قال بل دالا سمعت عبد الله بن مسعود يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ مدكر ‏\"‏ ‏.‏ دالا ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 342
			}
		},
		{
			"hadithnumber": 1915,
			"arabicnumber": "823.02",
			"text": "وحدثنا محمد بن المثنى، وابن، بشار قال ابن المثنى حدثنا محمد بن جعفر، حدثنا شعبة، عن أبي إسحاق، عن الأسود، عن عبد الله، عن النبي صلى الله عليه وسلم أنه كان يقرأ هذا الحرف ‏ \"‏ فهل من مدكر ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 343
			}
		},
		{
			"hadithnumber": 1916,
			"arabicnumber": "824.01",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب - واللفظ لأبي بكر - قالا حدثنا أبو معاوية عن الأعمش، عن إبراهيم، عن علقمة، قال قدمنا الشام فأتانا أبو الدرداء فقال أفيكم أحد يقرأ على قراءة عبد الله فقلت نعم أنا ‏.‏ قال فكيف سمعت عبد الله يقرأ هذه الآية ‏{‏ والليل إذا يغشى‏}‏ قال سمعته يقرأ ‏{‏ والليل إذا يغشى * والذكر والأنثى‏}‏ ‏.‏ قال وأنا والله هكذا سمعت رسول الله صلى الله عليه وسلم يقرؤها ولكن هؤلاء يريدون أن أقرأ وما خلق ‏.‏ فلا أتابعهم ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 344
			}
		},
		{
			"hadithnumber": 1917,
			"arabicnumber": "824.02",
			"text": "وحدثنا قتيبة بن سعيد، حدثنا جرير، عن مغيرة، عن إبراهيم، قال أتى علقمة الشام فدخل مسجدا فصلى فيه ثم قام إلى حلقة فجلس فيها - قال - فجاء رجل فعرفت فيه تحوش القوم وهيئتهم ‏.‏ قال فجلس إلى جنبي ثم قال أتحفظ كما كان عبد الله يقرأ فذكر بمثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 345
			}
		},
		{
			"hadithnumber": 1918,
			"arabicnumber": "824.03",
			"text": "حدثنا علي بن حجر السعدي، حدثنا إسماعيل بن إبراهيم، عن داود بن أبي، هند عن الشعبي، عن علقمة، قال لقيت أبا الدرداء فقال لي ممن أنت قلت من أهل العراق ‏.‏ قال من أيهم قلت من أهل الكوفة ‏.‏ قال هل تقرأ على قراءة عبد الله بن مسعود قال قلت نعم ‏.‏ قال فاقرأ ‏{‏ والليل إذا يغشى‏}‏ قال فقرأت ‏{‏ والليل إذا يغشى * والنهار إذا تجلى * والذكر والأنثى‏}‏ ‏.‏ قال فضحك ثم قال هكذا سمعت رسول الله صلى الله عليه وسلم يقرؤها ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 346
			}
		},
		{
			"hadithnumber": 1919,
			"arabicnumber": "824.04",
			"text": "وحدثنا محمد بن المثنى، حدثني عبد الأعلى، حدثنا داود، عن عامر، عن علقمة، قال أتيت الشام فلقيت أبا الدرداء فذكر بمثل حديث ابن علية ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 347
			}
		},
		{
			"hadithnumber": 1920,
			"arabicnumber": "825",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن محمد بن يحيى بن حبان، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم نهى عن الصلاة بعد العصر حتى تغرب الشمس وعن الصلاة بعد الصبح حتى تطلع الشمس ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 348
			}
		},
		{
			"hadithnumber": 1921,
			"arabicnumber": "826.01",
			"text": "وحدثنا داود بن رشيد، وإسماعيل بن سالم، جميعا عن هشيم، - قال داود حدثنا هشيم، - أخبرنا منصور، عن قتادة، قال أخبرنا أبو العالية، عن ابن عباس، قال سمعت غير، واحد، من أصحاب رسول الله صلى الله عليه وسلم منهم عمر بن الخطاب وكان أحبهم إلى أن رسول الله صلى الله عليه وسلم نهى عن الصلاة بعد الفجر حتى تطلع الشمس وبعد العصر حتى تغرب الشمس ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 349
			}
		},
		{
			"hadithnumber": 1922,
			"arabicnumber": "826.02",
			"text": "وحدثنيه زهير بن حرب، حدثنا يحيى بن سعيد، عن شعبة، ح وحدثني أبو غسان، المسمعي حدثنا عبد الأعلى، حدثنا سعيد، ح وحدثنا إسحاق بن إبراهيم، أخبرنا معاذ، بن هشام حدثني أبي كلهم، عن قتادة، بهذا الإسناد غير أن في، حديث سعيد وهشام بعد الصبح حتى تشرق الشمس ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 350
			}
		},
		{
			"hadithnumber": 1923,
			"arabicnumber": "827",
			"text": "وحدثني حرملة بن يحيى، أخبرنا ابن وهب، أخبرني يونس، أن ابن شهاب، أخبره قال أخبرني عطاء بن يزيد الليثي، أنه سمع أبا سعيد الخدري، يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا صلاة بعد صلاة العصر حتى تغرب الشمس ولا صلاة بعد صلاة الفجر حتى تطلع الشمس ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 351
			}
		},
		{
			"hadithnumber": 1924,
			"arabicnumber": "828.01",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا يتحرى أحدكم فيصلي عند طلوع الشمس ولا عند غروبها ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 352
			}
		},
		{
			"hadithnumber": 1925,
			"arabicnumber": "828.02",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، ح وحدثنا محمد بن عبد الله بن، نمير حدثنا أبي ومحمد بن بشر، قالا جميعا حدثنا هشام، عن أبيه، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا تحروا بصلاتكم طلوع الشمس ولا غروبها فإنها تطلع بقرنى شيطان ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 353
			}
		},
		{
			"hadithnumber": 1926,
			"arabicnumber": "829",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، ح وحدثنا محمد بن عبد الله بن، نمير حدثنا أبي وابن، بشر قالوا جميعا حدثنا هشام، عن أبيه، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا بدا حاجب الشمس فأخروا الصلاة حتى تبرز وإذا غاب حاجب الشمس فأخروا الصلاة حتى تغيب ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 354
			}
		},
		{
			"hadithnumber": 1927,
			"arabicnumber": "830.01",
			"text": "وحدثنا قتيبة بن سعيد، حدثنا ليث، عن خير بن نعيم الحضرمي، عن ابن هبيرة، عن أبي تميم الجيشاني، عن أبي بصرة الغفاري، قال صلى بنا رسول الله صلى الله عليه وسلم العصر بالمخمص فقال ‏ \"‏ إن هذه الصلاة عرضت على من كان قبلكم فضيعوها فمن حافظ عليها كان له أجره مرتين ولا صلاة بعدها حتى يطلع الشاهد ‏\"‏ ‏.‏ والشاهد النجم ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 355
			}
		},
		{
			"hadithnumber": 1928,
			"arabicnumber": "830.02",
			"text": "وحدثني زهير بن حرب، حدثنا يعقوب بن إبراهيم، حدثنا أبي، عن ابن إسحاق، قال حدثني يزيد بن أبي حبيب، عن خير بن نعيم الحضرمي، عن عبد الله بن هبيرة السبائي، - وكان ثقة - عن أبي تميم الجيشاني، عن أبي بصرة الغفاري، قال صلى بنا رسول الله صلى الله عليه وسلم العصر ‏.‏ بمثله ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 356
			}
		},
		{
			"hadithnumber": 1929,
			"arabicnumber": "831",
			"text": "وحدثنا يحيى بن يحيى، حدثنا عبد الله بن وهب، عن موسى بن على، عن أبيه، قال سمعت عقبة بن عامر الجهني، يقول ثلاث ساعات كان رسول الله صلى الله عليه وسلم ينهانا أن نصلي فيهن أو أن نقبر فيهن موتانا حين تطلع الشمس بازغة حتى ترتفع وحين يقوم قائم الظهيرة حتى تميل الشمس وحين تضيف الشمس للغروب حتى تغرب ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 357
			}
		},
		{
			"hadithnumber": 1930,
			"arabicnumber": "832",
			"text": "حدثني أحمد بن جعفر المعقري، حدثنا النضر بن محمد، حدثنا عكرمة بن عمار، حدثنا شداد بن عبد الله أبو عمار، ويحيى بن أبي كثير، عن أبي أمامة، - قال عكرمة ولقي شداد أبا أمامة وواثلة وصحب أنسا إلى الشام وأثنى عليه فضلا وخيرا - عن أبي أمامة قال قال عمرو بن عبسة السلمي كنت وأنا في الجاهلية أظن أن الناس على ضلالة وأنهم ليسوا على شىء وهم يعبدون الأوثان فسمعت برجل بمكة يخبر أخبارا فقعدت على راحلتي فقدمت عليه فإذا رسول الله صلى الله عليه وسلم مستخفيا جرءاء عليه قومه فتلطفت حتى دخلت عليه بمكة فقلت له ما أنت قال ‏\"‏ أنا نبي ‏\"‏ ‏.‏ فقلت وما نبي قال ‏\"‏ أرسلني الله ‏\"‏ ‏.‏ فقلت وبأى شىء أرسلك قال ‏\"‏ أرسلني بصلة الأرحام وكسر الأوثان وأن يوحد الله لا يشرك به شىء ‏\"‏ ‏.‏ قلت له فمن معك على هذا قال ‏\"‏ حر وعبد ‏\"‏ ‏.‏ قال ومعه يومئذ أبو بكر وبلال ممن آمن به ‏.‏ فقلت إني متبعك ‏.‏ قال ‏\"‏ إنك لا تستطيع ذلك يومك هذا ألا ترى حالي وحال الناس ولكن ارجع إلى أهلك فإذا سمعت بي قد ظهرت فأتني ‏\"‏ ‏.‏ قال فذهبت إلى أهلي وقدم رسول الله صلى الله عليه وسلم المدينة وكنت في أهلي فجعلت أتخبر الأخبار وأسأل الناس حين قدم المدينة حتى قدم على نفر من أهل يثرب من أهل المدينة فقلت ما فعل هذا الرجل الذي قدم المدينة فقالوا الناس إليه سراع وقد أراد قومه قتله فلم يستطيعوا ذلك ‏.‏ فقدمت المدينة فدخلت عليه فقلت يا رسول الله أتعرفني قال ‏\"‏ نعم أنت الذي لقيتني بمكة ‏\"‏ ‏.‏ قال فقلت بلى ‏.‏ فقلت يا نبي الله أخبرني عما علمك الله وأجهله ‏.‏ أخبرني عن الصلاة قال ‏\"‏ صل صلاة الصبح ثم أقصر عن الصلاة حتى تطلع الشمس حتى ترتفع فإنها تطلع حين تطلع بين قرنى شيطان وحينئذ يسجد لها الكفار ثم صل فإن الصلاة مشهودة محضورة حتى يستقل الظل بالرمح ثم أقصر عن الصلاة فإن حينئذ تسجر جهنم فإذا أقبل الفىء فصل فإن الصلاة مشهودة محضورة حتى تصلي العصر ثم أقصر عن الصلاة حتى تغرب الشمس فإنها تغرب بين قرنى شيطان وحينئذ يسجد لها الكفار ‏\"‏ ‏.‏ قال فقلت يا نبي الله فالوضوء حدثني عنه قال ‏\"‏ ما منكم رجل يقرب وضوءه فيتمضمض ويستنشق فينتثر إلا خرت خطايا وجهه وفيه وخياشيمه ثم إذا غسل وجهه كما أمره الله إلا خرت خطايا وجهه من أطراف لحيته مع الماء ثم يغسل يديه إلى المرفقين إلا خرت خطايا يديه من أنامله مع الماء ثم يمسح رأسه إلا خرت خطايا رأسه من أطراف شعره مع الماء ثم يغسل قدميه إلى الكعبين إلا خرت خطايا رجليه من أنامله مع الماء فإن هو قام فصلى فحمد الله وأثنى عليه ومجده بالذي هو له أهل وفرغ قلبه لله إلا انصرف من خطيئته كهيئته يوم ولدته أمه ‏\"‏ ‏.‏ فحدث عمرو بن عبسة بهذا الحديث أبا أمامة صاحب رسول الله صلى الله عليه وسلم فقال له أبو أمامة يا عمرو بن عبسة انظر ما تقول في مقام واحد يعطى هذا الرجل فقال عمرو يا أبا أمامة لقد كبرت سني ورق عظمي واقترب أجلي وما بي حاجة أن أكذب على الله ولا على رسول الله لو لم أسمعه من رسول الله صلى الله عليه وسلم إلا مرة أو مرتين أو ثلاثا - حتى عد سبع مرات - ما حدثت به أبدا ولكني سمعته أكثر من ذلك ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 358
			}
		},
		{
			"hadithnumber": 1931,
			"arabicnumber": "833.01",
			"text": "حدثنا محمد بن حاتم، حدثنا بهز، حدثنا وهيب، حدثنا عبد الله بن طاوس، عن أبيه، عن عائشة، أنها قالت وهم عمر إنما نهى رسول الله صلى الله عليه وسلم أن يتحرى طلوع الشمس وغروبها ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 359
			}
		},
		{
			"hadithnumber": 1932,
			"arabicnumber": "833.02",
			"text": "وحدثنا حسن الحلواني، حدثنا عبد الرزاق، أخبرنا معمر، عن ابن طاوس، عن أبيه، عن عائشة، أنها قالت لم يدع رسول الله صلى الله عليه وسلم الركعتين بعد العصر ‏.‏ قال فقالت عائشة قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا تتحروا طلوع الشمس ولا غروبها فتصلوا عند ذلك ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 360
			}
		},
		{
			"hadithnumber": 1933,
			"arabicnumber": "834",
			"text": "حدثني حرملة بن يحيى التجيبي، حدثنا عبد الله بن وهب، أخبرني عمرو، - وهو ابن الحارث - عن بكير، عن كريب، مولى ابن عباس أن عبد الله بن عباس، وعبد الرحمن، بن أزهر والمسور بن مخرمة أرسلوه إلى عائشة زوج النبي صلى الله عليه وسلم فقالوا اقرأ عليها السلام منا جميعا وسلها عن الركعتين بعد العصر وقل إنا أخبرنا أنك تصلينهما وقد بلغنا أن رسول الله صلى الله عليه وسلم نهى عنهما ‏.‏ قال ابن عباس وكنت أصرف مع عمر بن الخطاب الناس عنها ‏.‏ قال كريب فدخلت عليها وبلغتها ما أرسلوني به ‏.‏ فقالت سل أم سلمة ‏.‏ فخرجت إليهم فأخبرتهم بقولها فردوني إلى أم سلمة بمثل ما أرسلوني به إلى عائشة ‏.‏ فقالت أم سلمة سمعت رسول الله صلى الله عليه وسلم ينهى عنهما ثم رأيته يصليهما أما حين صلاهما فإنه صلى العصر ثم دخل وعندي نسوة من بني حرام من الأنصار فصلاهما فأرسلت إليه الجارية فقلت قومي بجنبه فقولي له تقول أم سلمة يا رسول الله إني أسمعك تنهى عن هاتين الركعتين وأراك تصليهما فإن أشار بيده فاستأخري عنه - قال - ففعلت الجارية فأشار بيده فاستأخرت عنه فلما انصرف قال ‏ \"‏ يا بنت أبي أمية سألت عن الركعتين بعد العصر إنه أتاني ناس من عبد القيس بالإسلام من قومهم فشغلوني عن الركعتين اللتين بعد الظهر فهما هاتان ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 361
			}
		},
		{
			"hadithnumber": 1934,
			"arabicnumber": "835.01",
			"text": "حدثنا يحيى بن أيوب، وقتيبة، وعلي بن حجر، قال ابن أيوب حدثنا إسماعيل، - وهو ابن جعفر - أخبرني محمد، - وهو ابن أبي حرملة - قال أخبرني أبو سلمة، أنه سأل عائشة عن السجدتين اللتين، كان رسول الله صلى الله عليه وسلم يصليهما بعد العصر فقالت كان يصليهما قبل العصر ثم إنه شغل عنهما أو نسيهما فصلاهما بعد العصر ثم أثبتهما وكان إذا صلى صلاة أثبتها ‏.‏ قال يحيى بن أيوب قال إسماعيل تعني داوم عليها ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 362
			}
		},
		{
			"hadithnumber": 1935,
			"arabicnumber": "835.02",
			"text": "حدثنا زهير بن حرب، حدثنا جرير، ح وحدثنا ابن نمير، حدثنا أبي جميعا، عن هشام بن عروة، عن أبيه، عن عائشة، قالت ما ترك رسول الله صلى الله عليه وسلم ركعتين بعد العصر عندي قط ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 363
			}
		},
		{
			"hadithnumber": 1936,
			"arabicnumber": "835.03",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، ح وحدثنا علي بن حجر، - واللفظ له - أخبرنا علي بن مسهر، أخبرنا أبو إسحاق الشيباني، عن عبد الرحمن، بن الأسود عن أبيه، عن عائشة، قالت صلاتان ما تركهما رسول الله صلى الله عليه وسلم في بيتي قط سرا ولا علانية ركعتين قبل الفجر وركعتين بعد العصر ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 364
			}
		},
		{
			"hadithnumber": 1937,
			"arabicnumber": "835.04",
			"text": "وحدثنا ابن المثنى، وابن، بشار قال ابن المثنى حدثنا محمد بن جعفر، حدثنا شعبة، عن أبي إسحاق، عن الأسود، ومسروق، قالا نشهد على عائشة أنها قالت ما كان يومه الذي كان يكون عندي إلا صلاهما رسول الله صلى الله عليه وسلم في بيتي ‏.‏ تعني الركعتين بعد العصر ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 365
			}
		},
		{
			"hadithnumber": 1938,
			"arabicnumber": "836",
			"text": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب جميعا عن ابن فضيل، - قال أبو بكر حدثنا محمد بن فضيل، - عن مختار بن فلفل، قال سألت أنس بن مالك عن التطوع، بعد العصر فقال كان عمر يضرب الأيدي على صلاة بعد العصر وكنا نصلي على عهد النبي صلى الله عليه وسلم ركعتين بعد غروب الشمس قبل صلاة المغرب ‏.‏ فقلت له أكان رسول الله صلى الله عليه وسلم صلاهما قال كان يرانا نصليهما ‏.‏ فلم يأمرنا ولم ينهنا",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 366
			}
		},
		{
			"hadithnumber": 1939,
			"arabicnumber": "837",
			"text": "وحدثنا شيبان بن فروخ، حدثنا عبد الوارث، عن عبد العزيز، - وهو ابن صهيب - عن أنس بن مالك، قال كنا بالمدينة فإذا أذن المؤذن لصلاة المغرب ابتدروا السواري فيركعون ركعتين ركعتين حتى إن الرجل الغريب ليدخل المسجد فيحسب أن الصلاة قد صليت من كثرة من يصليهما ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 367
			}
		},
		{
			"hadithnumber": 1940,
			"arabicnumber": "838.01",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، ووكيع، عن كهمس، قال حدثنا عبد الله بن بريدة، عن عبد الله بن مغفل المزني، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ بين كل أذانين صلاة - قالها ثلاثا قال في الثالثة - لمن شاء ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 368
			}
		},
		{
			"hadithnumber": 1941,
			"arabicnumber": "838.02",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا عبد الأعلى، عن الجريري، عن عبد الله، بن بريدة عن عبد الله بن مغفل، عن النبي صلى الله عليه وسلم ‏.‏ مثله إلا أنه قال في الرابعة ‏ \"‏ لمن شاء ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 369
			}
		},
		{
			"hadithnumber": 1942,
			"arabicnumber": "839.01",
			"text": "حدثنا عبد بن حميد، أخبرنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن سالم، عن ابن عمر، قال صلى رسول الله صلى الله عليه وسلم صلاة الخوف بإحدى الطائفتين ركعة والطائفة الأخرى مواجهة العدو ثم انصرفوا وقاموا في مقام أصحابهم مقبلين على العدو وجاء أولئك ثم صلى بهم النبي صلى الله عليه وسلم ركعة ثم سلم النبي صلى الله عليه وسلم ثم قضى هؤلاء ركعة وهؤلاء ركعة ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 370
			}
		},
		{
			"hadithnumber": 1943,
			"arabicnumber": "839.02",
			"text": "وحدثنيه أبو الربيع الزهراني، حدثنا فليح، عن الزهري، عن سالم بن عبد الله، بن عمر عن أبيه، أنه كان يحدث عن صلاة، رسول الله صلى الله عليه وسلم في الخوف ويقول صليتها مع رسول الله صلى الله عليه وسلم ‏.‏ بهذا المعنى ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 371
			}
		},
		{
			"hadithnumber": 1944,
			"arabicnumber": "839.03",
			"text": "وحدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن آدم، عن سفيان، عن موسى بن، عقبة عن نافع، عن ابن عمر، قال صلى رسول الله صلى الله عليه وسلم صلاة الخوف في بعض أيامه فقامت طائفة معه وطائفة بإزاء العدو فصلى بالذين معه ركعة ثم ذهبوا وجاء الآخرون فصلى بهم ركعة ثم قضت الطائفتان ركعة ركعة - قال - وقال ابن عمر فإذا كان خوف أكثر من ذلك فصل راكبا أو قائما تومئ إيماء ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 372
			}
		},
		{
			"hadithnumber": 1945,
			"arabicnumber": "840.01",
			"text": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا عبد الملك بن أبي سليمان، عن عطاء، عن جابر بن عبد الله، قال شهدت مع رسول الله صلى الله عليه وسلم صلاة الخوف فصفنا صفين صف خلف رسول الله صلى الله عليه وسلم والعدو بيننا وبين القبلة فكبر النبي صلى الله عليه وسلم وكبرنا جميعا ثم ركع وركعنا جميعا ثم رفع رأسه من الركوع ورفعنا جميعا ثم انحدر بالسجود والصف الذي يليه وقام الصف المؤخر في نحر العدو فلما قضى النبي صلى الله عليه وسلم السجود وقام الصف الذي يليه انحدر الصف المؤخر بالسجود وقاموا ثم تقدم الصف المؤخر وتأخر الصف المقدم ثم ركع النبي صلى الله عليه وسلم وركعنا جميعا ثم رفع رأسه من الركوع ورفعنا جميعا ثم انحدر بالسجود والصف الذي يليه الذي كان مؤخرا في الركعة الأولى وقام الصف المؤخر في نحور العدو فلما قضى النبي صلى الله عليه وسلم السجود والصف الذي يليه انحدر الصف المؤخر بالسجود فسجدوا ثم سلم النبي صلى الله عليه وسلم وسلمنا جميعا ‏.‏ قال جابر كما يصنع حرسكم هؤلاء بأمرائهم ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 373
			}
		},
		{
			"hadithnumber": 1946,
			"arabicnumber": "840.02",
			"text": "حدثنا أحمد بن عبد الله بن يونس، حدثنا زهير، حدثنا أبو الزبير، عن جابر، قال غزونا مع رسول الله صلى الله عليه وسلم قوما من جهينة فقاتلونا قتالا شديدا فلما صلينا الظهر قال المشركون لو ملنا عليهم ميلة لاقتطعناهم ‏.‏ فأخبر جبريل رسول الله صلى الله عليه وسلم ذلك فذكر ذلك لنا رسول الله صلى الله عليه وسلم - قال - وقالوا إنه ستأتيهم صلاة هي أحب إليهم من الأولاد فلما حضرت العصر - قال - صفنا صفين والمشركون بيننا وبين القبلة - قال - فكبر رسول الله صلى الله عليه وسلم وكبرنا وركع فركعنا ثم سجد وسجد معه الصف الأول فلما قاموا سجد الصف الثاني ثم تأخر الصف الأول وتقدم الصف الثاني فقاموا مقام الأول فكبر رسول الله صلى الله عليه وسلم وكبرنا وركع فركعنا ثم سجد وسجد معه الصف الأول وقام الثاني فلما سجد سجد الصف الثاني ثم جلسوا جميعا سلم عليهم رسول الله صلى الله عليه وسلم ‏.‏ قال أبو الزبير ثم خص جابر أن قال كما يصلي أمراؤكم هؤلاء ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 374
			}
		},
		{
			"hadithnumber": 1947,
			"arabicnumber": "841",
			"text": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن عبد الرحمن بن، القاسم عن أبيه، عن صالح بن خوات بن جبير، عن سهل بن أبي حثمة، أن رسول الله صلى الله عليه وسلم صلى بأصحابه في الخوف فصفهم خلفه صفين فصلى بالذين يلونه ركعة ثم قام فلم يزل قائما حتى صلى الذين خلفهم ركعة ثم تقدموا وتأخر الذين كانوا قدامهم فصلى بهم ركعة ثم قعد حتى صلى الذين تخلفوا ركعة ثم سلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 375
			}
		},
		{
			"hadithnumber": 1948,
			"arabicnumber": "842",
			"text": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن يزيد بن رومان، عن صالح، بن خوات عمن صلى مع رسول الله صلى الله عليه وسلم يوم ذات الرقاع صلاة الخوف أن طائفة صفت معه وطائفة وجاه العدو ‏.‏ فصلى بالذين معه ركعة ثم ثبت قائما وأتموا لأنفسهم ‏.‏ ثم انصرفوا فصفوا وجاه العدو وجاءت الطائفة الأخرى فصلى بهم الركعة التي بقيت ثم ثبت جالسا وأتموا لأنفسهم ثم سلم بهم ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 376
			}
		},
		{
			"hadithnumber": 1949,
			"arabicnumber": "843.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا عفان، حدثنا أبان بن يزيد، حدثنا يحيى، بن أبي كثير عن أبي سلمة، عن جابر، قال أقبلنا مع رسول الله صلى الله عليه وسلم حتى إذا كنا بذات الرقاع قال كنا إذا أتينا على شجرة ظليلة تركناها لرسول الله صلى الله عليه وسلم - قال - فجاء رجل من المشركين وسيف رسول الله صلى الله عليه وسلم معلق بشجرة فأخذ سيف نبي الله صلى الله عليه وسلم فاخترطه فقال لرسول الله صلى الله عليه وسلم أتخافني قال ‏\"‏ لا ‏\"‏ ‏.‏ قال فمن يمنعك مني قال ‏\"‏ الله يمنعني منك ‏\"‏ ‏.‏ قال فتهدده أصحاب رسول الله صلى الله عليه وسلم فأغمد السيف وعلقه - قال - فنودي بالصلاة فصلى بطائفة ركعتين ثم تأخروا وصلى بالطائفة الأخرى ركعتين قال فكانت لرسول الله صلى الله عليه وسلم أربع ركعات وللقوم ركعتان ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 377
			}
		},
		{
			"hadithnumber": 1950,
			"arabicnumber": "843.02",
			"text": "وحدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا يحيى، - يعني ابن حسان - حدثنا معاوية، - وهو ابن سلام - أخبرني يحيى، أخبرني أبو سلمة بن عبد الرحمن، أن جابرا، أخبره أنه، صلى مع رسول الله صلى الله عليه وسلم صلاة الخوف فصلى رسول الله صلى الله عليه وسلم بإحدى الطائفتين ركعتين ثم صلى بالطائفة الأخرى ركعتين فصلى رسول الله صلى الله عليه وسلم أربع ركعات وصلى بكل طائفة ركعتين ‏.‏",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 378
			}
		}
	]
}