{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"11": "Friday Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 876,
			"arabicnumber": 876,
			"text": "(لِقَوْلِ اللهِ تَعَالَى )إِذَا نُودِيَ لِلصَّلاَةِ مِنْ يَوْمِ الْجُمُعَةِ فَاسْعَوْا إِلَى ذِكْرِ اللهِ وَذَرُوا الْبَيْعَ ذَلِكُمْ خَيْرٌ لَكُمْ إِنْ كُنْتُمْ تَعْلَمُونَ( فاسعوا : فامضوا এ সম্পর্কে আল্লাহ্ তা‘আলার বাণীঃ ‘‘জুমু‘আহর দিনে যখন সালাতের জন্য আহবান করা হয়, তখন তোমরা আল্লাহর স্মরণের প্রতি ধাবিত হও এবং বন্ধ করে দাও বেচা- কেনা। এটাই তোমাদের জন্য উত্তম যদি তোমরা জানতে।’’ فاسعوا অর্থ ধাবিত হও। (সূরাহ্ আল-জুমু‘আহ ৬২/৯) ৮৭৬. আবূ হুরাইরাহ্ (রাযি.) হতে বর্ণিত। তিনি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে বলতে শুনেছেন যে, আমরা দুনিয়ায় (আগমনের দিক দিয়ে) সর্বশেষ, কিন্তু কিয়ামতের দিন আমরা মর্যাদার ব্যাপারে সবার পূর্বে। ব্যতিক্রম এই যে, আমাদের পূর্বে তাদের কিতাব প্রদান করা হয়েছে। অতঃপর তাদের সে দিন যে দিন তাদের জন্য ইবাদত ফরজ করা হয়েছিল তারা এ বিষয়ে মতভেদ করেছে। কিন্তু সে বিষয়ে আল্লাহ্ আমাদের হিদায়াত করেছেন। কাজেই এ ব্যাপারে লোকেরা আমাদের পশ্চাদ্বর্তী। ইয়াহূদীদের (সম্মানীয় দিন হচ্ছে) আগামী কাল (শনিবার) এবং নাসারাদের আগামী পরশু (রোববার)। (২৩৮; মুসলিম ৭/৫, হাঃ ৮৫৫, আহমাদ ৭৩১৪) (আধুনিক প্রকাশনীঃ ৮২৫, ইসলামিক ফাউন্ডেশনঃ ৮৩২)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 877,
			"arabicnumber": 877,
			"text": "‘আবদুল্লাহ্ ইবনু ‘উমার (রাযি.) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের মধ্যে কেউ জুমু‘আহর সালাতে আসলে সে যেন গোসল করে। (৮৯৪, ৯১৯ মুসলিম ৭/৭, হাঃ ৮৪৪, ৪৫৫৩) (আধুনিক প্রকাশনীঃ৮২৬, ইসলামিক ফাউন্ডেশনঃ ৮৩৩)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 878,
			"arabicnumber": 878,
			"text": "ইবনু ‘উমার (রাযি.) হতে বর্ণিত। ‘উমার ইবনু খাত্তাব (রাযি.) জুমু‘আহর দিন দাঁড়িয়ে খুত্বা দিচ্ছিলেন, এ সময় নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর প্রথম যুগের একজন মুহাজির সহাবা এলেন। ‘উমার (রাযি.) তাঁকে ডেকে বললেন, এখন সময় কত? তিনি বললেন, আমি ব্যস্ত ছিলাম, তাই ঘরে ফিরে আসতে পারিনি। এমন সময় আযান শুনে কেবল উযূ করে নিলাম। ‘উমার (রাযি.) বললেন, কেবল উযূই? অথচ আপনি জানেন যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম গোসলের নির্দেশ দিতেন। (৮৮২; মুসলিম ৬/৫১, হাঃ ৮৪৫, আহমাদ ৫০৮৩) (আধুনিক প্রকাশনীঃ ৮২৭, ইসলামিক ফাউন্ডেশনঃ ৮৩৪)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 879,
			"arabicnumber": 879,
			"text": "আবূ সা‘ঈদ খুদরী (রাযি.) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ জুমু‘আহর দিনে প্রত্যেক সাবালকের জন্য গোসল করা ওয়াজিব। (৮৫৮) (আধুনিক প্রকাশনীঃ ৮২৮, ইসলামিক ফাউন্ডেশনঃ ৮৩৫)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 880,
			"arabicnumber": 880,
			"text": "‘আমর ইবনু সুলাইম আনসারী হতে বর্ণিত। তিনি বলেন, আবূ সা‘ঈদ খুদরী (রাযি.) বলেন, আমি এ মর্মে সাক্ষ্য দিচ্ছি যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ জুমু‘আহর দিন প্রত্যেক বালিগের জন্য গোসল করা কর্তব্য। আর মিস্ওয়াক করবে এবং সুগন্ধি পাওয়া গেলে তা ব্যবহার করবে। ‘আমর (ইবনু সুলায়ম) (রহ.) বলেন, গোসল সম্পর্কে আমি সাক্ষ্য দিচ্ছি তা ওয়াজিব। কিন্তু মিস্ওয়াক ও সুগন্ধি ওয়াজিব কিনা তা আল্লাহ্ই ভাল জানেন। তবে হাদীসে এ রকমই আছে। আবূ ‘আবদুল্লাহ্ বুখারী (রহ.) বলেন, আবূ বাকর ইবনু মুনকাদির (রহ.) হলেন মুহাম্মাদ ইবনু মুনকাদির (রহ.)-এর ভাই। কিন্তু তিনি আবূ বাকর হিসেবেই পরিচিত নন। বুকায়র ইবনু আশাজ্জ, সা‘ঈদ ইবনু আবূ হিলাল সহ অনেকে তাঁর হতে হাদীসটি বর্ণনা করেছেন। মুহাম্মাদ ইবনু মুনকাদির (রহ.)-এর কুনিয়াত (উপনাম) ছিল আবূ বাকর ও আবূ ‘আবদুল্লাহ্। (মুসলিম ৭/১, হাঃ ৮৪৬, আহমাদ ১১২৫০) (আধুনিক প্রকাশনীঃ ৮২৯, ইসলামিক ফাউন্ডেশনঃ ৮৩৬)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 881,
			"arabicnumber": 881,
			"text": "আবূ হুরাইরাহ্ (রাযি.) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তি জুমু‘আহর দিন জানাবাত গোসলের ন্যায় গোসল করে এবং সালাতের জন্য আগমন করে সে যেন একটি উট কুরবানী করল। যে ব্যক্তি দ্বিতীয় পর্যায়ে আগমন করে সে যেন একটি গাভী কুরবানী করল। তৃতীয় পর্যায়ে যে আগমন করে সে যেন একটি শিং বিশিষ্ট দুম্বা কুরবানী করল। চতুর্থ পর্যায়ে আগমন করল সে যেন একটি মুরগী কুরবানী করল। পঞ্চম পর্যায়ে যে আগমন করল সে যেন একটি ডিম কুরবানী করল। পরে ইমাম যখন খুত্বাহ দেয়ার জন্য বের হন তখন মালাইকাহ যিকর শ্রবণের জন্য উপস্থিত হয়ে থাকে। (মুসলিম ৭/২, হাঃ ৮৫০, আহমাদ ৯৯৩৩) (আধুনিক প্রকাশনীঃ ৮৩০, ইসলামিক ফাউন্ডেশনঃ ৮৩৭)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 882,
			"arabicnumber": 882,
			"text": "আবূ হুরাইরাহ্ (রাযি.) হতে বর্ণিত। জুমু‘আহর দিন ‘উমার ইবনু খাত্তাব (রাযি.) খুত্বা দিচ্ছিলেন, এ সময় এক ব্যক্তি মসজিদে আসলে ‘উমার (রাযি.) তাঁকে জিজ্ঞেস করলেন, সালাতে সময় মত আসতে তোমরা কেন বাধাগ্রস্ত হও? তিনি বললেন, আযান শোনার সঙ্গে সঙ্গেই আমি উযূ করেছি। তখন ‘উমার (রাযি.) বললেন, তোমরা কি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে এ কথা বলতে শোননি যে, যখন তোমাদের কেউ জুমু‘আহর সালাতে রওয়ানা দেয়, তখন সে যেন গোসল করে নেয়। (৮৭৮) (আধুনিক প্রকাশনীঃ ৮৩১, ইসলামিক ফাউন্ডেশনঃ ৮৩৮)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 883,
			"arabicnumber": 883,
			"text": "সালমান ফারিসী (রাযি.) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তি জুমু‘আহর দিন গোসল করে এবং যথাসাধ্য ভালরূপে পবিত্রতা অর্জন করে ও নিজের তেল হতে ব্যবহার করে বা নিজ ঘরের সুগন্ধি ব্যবহার করে, অতঃপর বের হয় এবং দু’ জন লোকের মাঝে ফাঁক না করে, অতঃপর তার নির্ধারিত সালাত আদায় করে এবং ইমামের খুৎবা দেয়ার সময় চুপ থাকে, তা হলে তার সে জুমু‘আহ হতে আরেক জুমু‘আহ পর্যন্ত সময়ের যাবতীয় গুনাহ মাফ করে দেয়া হয়। (৯১০) (আধুনিক প্রকাশনীঃ ৮৩২ ইসলামিক ফাউন্ডেশনঃ ৮৩৯)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 884,
			"arabicnumber": 884,
			"text": "তাঊস (রহ.) হতে বর্ণিত। তিনি বলেন, আমি ইবনু ‘আব্বাস (রাযি.)-কে বললাম, সাহাবীগণ বর্ণনা করেছেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ জুমু‘আহর দিন গোসল কর এবং মাথা ধুয়ে ফেল যদিও তোমরা জুনুবী না হয়ে থাক এবং সুগন্ধি ব্যবহার কর। ইবনু ‘আব্বাস (রাযি.) বললেন, গোসল সম্পর্কে নির্দেশ ঠিকই আছে, কিন্তু সুগন্ধি সম্পর্কে আমি জানি না। (৮৮৫) (আধুনিক প্রকাশনীঃ ৮৩৩, ইসলামিক ফাউন্ডেশনঃ ৮৪০)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 885,
			"arabicnumber": 885,
			"text": "তাঊস (রহ.) হতে বর্ণিত। তিনি ইবনু ‘আব্বাস (রাযি.) হতে বর্ণনা করেন যে, তিনি যখন, জুমু‘আহর দিন গোসল সম্বন্ধে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর বাণীর উল্লেখ করেন তখন আমি ইবনু ‘আব্বাস (রাযি.)-কে জিজ্ঞেস করলাম, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন পরিবার পরিজনের সঙ্গে অবস্থান করতেন তখনও কি তিনি সুগন্ধি বা তেল ব্যবহার করতেন? তিনি বললেন, আমি তা জানি না। (৮৮৫; মুসলিম ৭/১, হাঃ ৮৪৮, আহমাদ ৩০৫৯) (আধুনিক প্রকাশনীঃ ৮৩৪, ইসলামিক ফাউন্ডেশনঃ ৮৪১)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 886,
			"arabicnumber": 886,
			"text": "‘আবদুল্লাহ্ ইবনু ‘উমার (রাযি.) হতে বর্ণিত যে, ‘উমার ইবনু খাত্তাব (রাযি.) মসজিদে নববীর দরজার নিকটে এক জোড়া রেশমী পোষাক (বিক্রি হতে) দেখে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে বললেন, হে আল্লাহর রাসূল! যদি এটি আপনি খরিদ করতেন আর জুমু‘আহর দিন এবং যখন আপনার নিকট প্রতিনিধি দল আসে তখন আপনি তা পরিধান করতেন। তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ এটা তো সে ব্যক্তিই পরিধান করে, আখিরাতে যার (মঙ্গলের) কোন অংশ নেই। অতঃপর আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট এ ধরনের কয়েক জোড়া পোষাক আসে, তখন তার এক জোড়া তিনি ‘উমার (রাযি.)-কে প্রদান করেন। ‘উমার (রাযি.) আরয করলেন, হে আল্লাহর রাসূল! আপনি আমাকে এটি পরতে দিলেন অথচ আপনি উতারিদের (রেশম) পোষাক সম্পর্কে যা বলার তা তো বলেছিলেন। তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আমি তোমাকে এটি নিজের পরার জন্য দেইনি। ‘উমার ইবনু খাত্তাব (রাযি.) তখন এটি মক্কা্য় তাঁর এক ভাইকে দিয়ে দেন, যে তখন মুশরিক ছিল। (৯৪৮,২১০৪, ২৬১২, ২৬১৯, ৩০৫৪, ৫৮৪১, ৫৯৮১, ৬০৮১ মুসলিম ৩৭/ আওয়ালুল কিতাব?, হাঃ ২০৬৮, আহমাদ ৫৮০১) (আধুনিক প্রকাশনীঃ ৮৩৫ ইসলামিক ফাউন্ডেশনঃ ৮৪২)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 887,
			"arabicnumber": 887,
			"text": "وَقَالَ أَبُو سَعِيدٍ عَنِ النَّبِيِّ صلى الله عليه وسلم يَسْتَنُّ. আবূ সা‘ঈদ খুদরী (রাযি.) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেন যে, তিনি মিস্ওয়াক করতেন। ৮৮৭. আবূ হুরাইরাহ্ (রাযি.) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমার উম্মাতের জন্য বা তিনি বলেছেন, লোকদের জন্য যদি কঠিন মনে না করতাম, তাহলে প্রত্যেক সালাতের সাথে তাদের মিস্ওয়াক করার হুকুম করতাম। (৭২৪০; মুসলিম ২/১৫, হাঃ ২৫২, আহমাদ ৭৪১৬) (আধুনিক প্রকাশনীঃ ৮৩৬, ইসলামিক ফাউন্ডেশনঃ ৮৪৩)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 888,
			"arabicnumber": 888,
			"text": "আনাস (রাযি.) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমি মিস্ওয়াক সম্পর্কে তোমাদের যথেষ্ট বলেছি। (আধুনিক প্রকাশনীঃ ৮৩৭ ইসলামিক ফাউন্ডেশনঃ ৮৪৪)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 889,
			"arabicnumber": 889,
			"text": "হুযাইফাহ (রাযি.) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন রাতে সালাতের জন্য উঠতেন তখন দাঁত মেজে মুখ পরিষ্কার করে নিতেন। (২৪৫) (আধুনিক প্রকাশনীঃ ৮৩৮, ইসলামিক ফাউন্ডেশনঃ ৮৪৫)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 890,
			"arabicnumber": 890,
			"text": "‘আয়িশাহ্ (রাযি.) হতে বর্ণিত। তিনি বলেন, ‘আবদুর রহমান ইবনু আবূ বাকর (রাযি.) একটি মিস্ওয়াক হাতে নিয়ে দাঁত ঘষতে ঘষতে প্রবেশ করলেন। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -তার দিকে তাকালেন। আমি তাঁকে বললাম, হে ‘আবদুর রহমান! মিস্ওয়াকটি আমাকে দাও। সে তা আমাকে দিল। আমি ব্যবহৃত অংশ ভেঙ্গে ফেললাম এবং তা চিবিয়ে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে দিলাম। তিনি আমার বুকে হেলান দিয়ে তা দিয়ে মিস্ওয়াক করলেন। (১৩৮৯, ৩১০০, ৩৭৭৪, ৪৪৩৮, ৪৪৪৬, ৪৪৪৯, ৪৪৫০, ৪৪৫১, ৫২১৭, ৬৫১০) (আধুনিক প্রকাশনীঃ ৮৩৯, ইসলামিক ফাউন্ডেশনঃ ৮৪৬)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 891,
			"arabicnumber": 891,
			"text": "আবূ হুরাইরাহ্ (রাযি.) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জুমু‘আহর দিন ফজরের সালাতে الم تَنْزِيلُ এবং وَهَلْ أَتَى عَلَى الْإِنْسَانِ حِينٌ مِنْ الدَّهْرِ দু’টি সূরাহ্ তিলাওয়াত করতেন। (১০৬৮; মুসলিম ৭/৬৪, হাঃ ৮৮০) (আধুনিক প্রকাশনীঃ ৮৪০, ইসলামিক ফাউন্ডেশনঃ ৮৪৭)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 892,
			"arabicnumber": 892,
			"text": "ইবনু ‘আব্বাস (রাযি.) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর মসজিদে জুমু‘আহর সালাত অনুষ্ঠিত হবার পর প্রথম জুমু‘আহর সালাত অনুষ্ঠিত হয় বাহরাইনে জুওয়াসা নামক স্থানে অবস্থিত আবদুল কায়স গোত্রের মসজিদে। (৪৩৭১) (আধুনিক প্রকাশনীঃ ৮৪১ ইসলামিক ফাউন্ডেশনঃ ৮৪৮)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 893,
			"arabicnumber": 893,
			"text": "‘উমার (রাযি.) হতে বর্ণিত যে, আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে বলতে শুনেছি, তোমরা সকলেই দায়িত্বশীল। লায়স ইবনু সা‘দ (রাযি.) আরো অতিরিক্ত বলেন, (পরবর্তী রাবী) ইউনুস (রহ.) বলেছেন, আমি একদা ইবনু শিহাব (রহ.)-এর সঙ্গে ওয়াদিউল কুরা নামক স্থানে ছিলাম। তখন রুযাইক (ইবনু হুকায়ম (রহ.) ইবনু শিহাব (রহ.)-এর নিকট লিখলেন, আপনি কী মনে করেন, আমি কি (এখানে) জুমু‘আহর সালাত আদায় করব? রুযায়ক (রহ.) তখন সেখানে তাঁর জমির কৃষি কাজের তত্ত্বাবধান করতেন। সেখানে একদল সুদানী ও অন্যান্য লোক বাস করত। রুযায়ক (রহ.) সে সময় আইলা শহরের (আমীর) ছিলেন। ইবনু শিহাব (রহ.) তাঁকে জুমু‘আহ কায়িম করার নির্দেশ দিয়ে লিখেছিলেন এবং আমি তাকে এ নির্দেশ দিতে শুনলাম। সালিম (রহ.) তার নিকট বর্ণনা করেছেন যে, ‘আবদুল্লাহ্ ইবনু ‘উমার (রাযি.) বলেন, আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে বলতে শুনেছি, তোমরা সকলেই দায়িত্বশীল এবং তোমাদের প্রত্যেককেই অধীনস্থদের (দায়িত্ব) সম্বন্ধে জিজ্ঞেস করা হবে। ইমাম* একজন দায়িত্বশীল ব্যক্তি, তাঁকে তাঁর অধীনস্থদের সম্পর্কে জিজ্ঞেস করা হবে। পুরুষ তার পরিবার বর্গের অভিভাবক, তাকে তার অধীনস্থদের সম্পর্কে জিজ্ঞেস করা হবে। নারী তার স্বামী-গৃহের কর্ত্রী, তাকে তার অধীনস্থদের সম্পর্কে জিজ্ঞেস করা হবে। খাদিম তার মনিবের ধন-সম্পদের রক্ষক, তাকেও তার মনিবের ধন-সম্পদ সম্পর্কে জিজ্ঞেস করা হবে। ইবনু ‘উমার (রাযি.) বলেন, আমার মনে হয়, রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আরো বলেছেনঃ পুত্র তার পিতার ধন-সম্পদের রক্ষক এবং এগুলো সম্পর্কে তাকে জিজ্ঞেস করা হবে। তোমরা সবাই দায়িত্বশীল এবং সবাইকে তাদের অর্পিত দায়িত্ব সম্পর্কে প্রশ্ন করা হবে। (২৪০৯, ২৫৫৪, ২৫৫৮, ২৭৫১, ৫১৮৮, ৫৬০০, ৭১৩৮) (আধুনিক প্রকাশনীঃ ৮৪২, ইসলামিক ফাউন্ডেশনঃ ৮৪৯)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 894,
			"arabicnumber": 894,
			"text": "وَقَالَ ابْنُ عُمَرَ إِنَّمَا الْغُسْلُ عَلَى مَنْ تَجِبُ عَلَيْهِ الْجُمُعَةُ. ইবনু ‘উমার (রাযি.) বলেছেন, যাদের উপর জুমু‘আহর সালাত ওয়াজিব, শুধু তাদের গোসল করা প্রয়োজন। ৮৯৪. ‘আবদুল্লাহ্ ইবনু উমার (রাযি.) হতে বর্ণিত। তিনি বলেন, আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে বলতে শুনেছি, ‘‘যে ব্যক্তি জুমু‘আহর সালাতে আসবে সে যেন গোসল করে।’’ (৮৭৭) (আধুনিক প্রকাশনীঃ ৮৪৩, ইসলামিক ফাউন্ডেশনঃ ৮৫০)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 895,
			"arabicnumber": 895,
			"text": "আবূ সা‘ঈদ খুদরী (রাযি.) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -বলেছেনঃ প্রত্যেক সাবালকের জন্য জুমু‘আহর দিন গোসল করা ওয়াজিব। (৮৫৮) (আধুনিক প্রকাশনীঃ ৮৪৪, ইসলামিক ফাউন্ডেশনঃ ৮৫১)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 897,
			"arabicnumber": 897,
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 898,
			"arabicnumber": 898,
			"text": "আবূ হুরাইরাহ্ (রাযি.) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ প্রত্যেক মুসলিমের উপর আল্লাহর হক রয়েছে যে, প্রতি সাত দিনে একবার সে যেন গোসল করে। (৮৯৭ মুসলিম ৭/২, হাঃ ৮৪৯) (আধুনিক প্রকাশনীঃ নাই, ইসলামিক ফাউন্ডেশনঃ নাই)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 899,
			"arabicnumber": 899,
			"text": "ইবনু ‘উমার (রাযি.) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেন, তোমরা মহিলাদেরকে রাতে (সালাতের জন্য) মসজিদে যাওয়ার অনুমতি দিবে। (৮৬৫ মুসলিম ৪/, হাঃ ৪৪২) (আধুনিক প্রকাশনীঃ ৮৪৬, ইসলামিক ফাউন্ডেশনঃ ৮৫৩)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 900,
			"arabicnumber": 900,
			"text": "ইবনু ‘উমার (রাযি.) হতে বর্ণিত। তিনি বলেন, ‘উমার (রাযি.)-এর স্ত্রী (আতিকাহ্ বিনত যায়দ) ফজর ও ‘ইশার সালাতের জামা‘আতে মসজিদে হাযির হতেন। তাঁকে বলা হল, আপনি কেন (সালাতের জন্য) বের হন? অথচ আপনি জানেন যে, ‘উমার (রাযি.) তা অপছন্দ করেন এবং মর্যাদা হানিকর মনে করেন। তিনি জবাব দিলেন, তা হলে কিসে বাধা দিচ্ছে যে, ‘উমার (রাযি.) স্বয়ং আমাকে নিষেধ করছেন না? বলা হল, তাঁকে বাধা দেয় আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর বাণীঃ আল্লাহর দাসীদের আল্লাহর মসজিদে যেতে বারণ করো না। (৮৬৫; মুসলিম ৪/৩০, হাঃ ৪৪২, আহমাদ ৪৬৫৫) (আধুনিক প্রকাশনীঃ ৮৪৭, ইসলামিক ফাউন্ডেশনঃ ৮৫৪)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 901,
			"arabicnumber": 901,
			"text": "ইবনু ‘আব্বাস (রাযি.) হতে বর্ণিত। তিনি তাঁর মুয়ায্যিনকে এক প্রবল বর্ষণের দিনে বললেন, যখন তুমি (আযানে) ‘আশহাদু আন্না মুহাম্মাদার রাসূলুল্লাহ বলবে, তখন ‘হাইয়া আলাস্ সালাহ্’ বলবে না, বলবে, ‘‘সাল্লু ফী বুয়ুতিকুম’’ (তোমরা নিজ নিজ বাসগৃহে সালাত আদায় কর)। তা লোকেরা অপছন্দ করল। তখন তিনি বললেনঃ আমার চেয়ে উত্তম ব্যক্তিই (রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ) তা করেছেন। জুমু‘আহ নিঃসন্দেহে জরুরী। আমি অপছন্দ করি তোমাদেরকে মাটি ও কাদার মধ্য দিয়ে যাতায়াত করার অসুবিধায় ফেলতে। (৬১৬) (আধুনিক প্রকাশনীঃ ৮৪৮, ইসলামিক ফাউন্ডেশনঃ ৮৫৫)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 902,
			"arabicnumber": 902,
			"text": "(لِقَوْلِ اللهِ جَلَّ وَعَزَّ )إِذَا نُودِيَ لِلصَّلاَةِ مِنْ يَوْمِ الْجُمُعَةِ فَاسْعَوْا إِلَى ذِكْرِ اللهِ( وَقَالَ عَطَاءٌ إِذَا كُنْتَ فِي قَرْيَةٍ جَامِعَةٍ فَنُودِيَ بِالصَّلاَةِ مِنْ يَوْمِ الْجُمُعَةِ فَحَقٌّ عَلَيْكَ أَنْ تَشْهَدَهَا سَمِعْتَ النِّدَاءَ أَوْ لَمْ تَسْمَعْهُ وَكَانَ أَنَسٌtفِي قَصْرِهِ أَحْيَانًا يُجَمِّعُ وَأَحْيَانًا لاَ يُجَمِّعُ وَهُوَ بِالزَّاوِيَةِ عَلَى فَرْسَخَيْنِ. কেননা, আল্লাহ্ তা‘আলা বলেছেনঃ জুমু‘আহর দিন যখন সালাতের জন্য ডাকা হয়, (তখন) আল্লাহর যিকরের দিকে দৌড়িয়ে যাওয়া। (সূরাহ্ আল-জুমু‘আহ ৬২/৯) ‘আত্বা (রহ.) বলেছেন, যখন তুমি কোন বড় শহরে বাস কর, জুমু‘আহর দিন সালাতের জন্য আযান দেয়া হলে, তা তুমি শুনতে পাও বা না পাও, তোমাকে অবশ্যই জামা‘আতে হাযির হতে হবে। আনাস (রাযি.) যখন (বসরা হতে) দু’ ফারসাখ্ (ছয় মাইল) দূরে অবস্থিত জাবিয়া নামক স্থানে তাঁর বাড়িতে অবস্থান করতেন, তখন কখনো জুমু‘আহ পড়তেন, কখনো পড়তেন না। ৯০২. নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর স্ত্রী ‘আয়িশাহ্ (রাযি.) হতে বর্ণিত। তিনি বলেন, লোকজন তাদের বাড়ি ও উঁচু এলাকা হতেও জুমু‘আহর সালাতের জন্য পালাক্রমে আসতেন। আর যেহেতু তারা ধুলো-বালির মধ্য দিয়ে আগমন করতেন, তাই তারা ধূলি মলিন ও ঘর্মাক্ত হয়ে যেতেন। তাঁদের দেহ হতে ঘাম বের হত। একদা তাদের একজন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট আসেন। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার নিকট ছিলেন। তিনি তাঁকে বললেনঃ যদি তোমরা এ দিনটিতে পরিষ্কার-পরিচ্ছন্ন থাকতে। (৭/১, হাঃ ৮৪৭) (আধুনিক প্রকাশনীঃ ৮৪৯, ইসলামিক ফাউন্ডেশনঃ ৮৫৬)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 903,
			"arabicnumber": 903,
			"text": "وَكَذَلِكَ يُرْوَى عَنْ عُمَرَ وَعَلِيٍّ وَالنُّعْمَانِ بْنِ بَشِيرٍ وَعَمْرِو بْنِ حُرَيْثٍ رَضِيَ اللهُ عَنْهُمْ. ‘উমার, ‘আলী, নু‘মান ইবনু বাশীর এবং ‘আমর ইবনু হুরায়স (রাযি.) হতেও অনুরূপ উল্লেখ রয়েছে। ৯০৩. ইয়াহ্ইয়া ইবনু সা‘ঈদ (রহ.) হতে বর্ণিত। তিনি ‘আমরাহ (রহ.)-কে জুমু‘আহর দিনে গোসল সম্পর্কে জিজ্ঞেস করেন। ‘আমরাহ (রহ.) বলেন, ‘আয়িশাহ্ (রাযি.) বলেছেন যে, লোকজন নিজেদের কাজকর্ম নিজেরাই করতেন। যখন তারা দুপুরের পরে জুমু‘আহর জন্য যেতেন তখন সে অবস্থায়ই চলে যেতেন। তাই তাঁদের বলা হল, যদি তোমরা গোসল করে নিতে। (২০৭১; মুসলিম ৭/১, হাঃ) (আধুনিক প্রকাশনীঃ ৮৫০, ইসলামিক ফাউন্ডেশনঃ ৮৫৭)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 904,
			"arabicnumber": 904,
			"text": "আনাস ইবনু মালিক (রাযি.) হতে বর্ণিত যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জুমু‘আহর সালাত আদায় করতেন, যখন সূর্য হেলে যেতো। (আধুনিক প্রকাশনীঃ ৮৫১, ইসলামিক ফাউন্ডেশনঃ ৮৫৮)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 905,
			"arabicnumber": 905,
			"text": "আনাস ইবনু মালিক (রাযি.) হতে বর্ণিত। তিনি বলেন, আমরা প্রথম ওয়াক্তেই জুমু‘আহর সালাতে যেতাম এবং জুমু‘আহর পরে কাইলূলা (দুপুরের বিশ্রাম) করতাম। (৯৪০) (আধুনিক প্রকাশনীঃ ৮৫২, ইসলামিক ফাউন্ডেশনঃ ৮৫৯)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 906,
			"arabicnumber": 906,
			"text": "আনাস ইবনু মালিক (রাযি.) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম প্রচন্ড শীতের সময় প্রথম ওয়াক্তেই সালাত আদায় করতেন। আর তীব্র গরমের সময় ঠান্ডা করে (বিলম্ব করে- সালাত আদায় করতেন। অর্থাৎ জুমু‘আহর সালাত। ইউনুস ইবনু বুকায়র (রহ.) আমাদের বলেছেন, আর তিনি সালাত শব্দের উল্লেখ করেছেন, জুমু‘আহ শব্দের উল্লেখ করেননি। আর বিশ্র ইবনু সাবিত (রহ.) বলেন, আমাদের নিকট আবূ খালদাহ (রহ.) বর্ণনা করেছেন যে, জুমু‘আহর ইমাম আমাদের নিয়ে সালাত আদায় করেন। অতঃপর তিনি আনাস (রাযি.)-কে বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যুহরের সালাত কিরূপে আদায় করতেন? (আধুনিক প্রকাশনীঃ ৮৫৩, ইসলামিক ফাউন্ডেশনঃ ৮৬০)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 907,
			"arabicnumber": 907,
			"text": "وَقَوْلِ اللَّهِ- جَلَّ ذِكْرُهُ- (فَاسْعَوْا إِلَى ذِكْرِ اللَّهِ) এবং আল্লাহর বাণীঃ ‘‘তোমরা আল্লাহর যিক্রের জন্য দৌড়িয়ে আস’’। وَمَنْ قَالَ السَّعْيُ الْعَمَلُ وَالذَّهَابُ لِقَوْلِهِ تَعَالَى )وَسَعَى لَهَا سَعْيَهَا( (سورة الإسراء : 19) وَقَالَ ابْنُ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا يَحْرُمُ الْبَيْعُ حِينَئِذٍ وَقَالَ عَطَاءٌ تَحْرُمُ الصِّنَاعَاتُ كُلُّهَا وَقَالَ إِبْرَاهِيمُ بْنُ سَعْدٍ عَنْ الزُّهْرِيِّ إِذَا أَذَّنَ الْمُؤَذِّنُ يَوْمَ الْجُمُعَةِ وَهُوَ مُسَافِرٌ فَعَلَيْهِ أَنْ يَشْهَدَ. যিনি বলেন, ‘সাঈ এর অর্থ কাজ করা, গমন করা। কেননা, আল্লাহর বাণীঃ وَسَعَى لَهَا سَعْيَهَا -এর অন্তর্গত সাঈ-এর অর্থ হচ্ছে কাজ করা। ইবনু ‘আব্বাস (রাযি.) বলেন, তখন (জুমু‘আহর আযানের পর) যাবতীয় ক্রয়-বিক্রয় হারাম হয়ে যায়। আত্বা (রহ.) বলেন, শিল্প-কারিগরির যাবতীয় কাজই তখন নিষিদ্ধ হয়ে যায়। ইব্রাহীম ইব্ন সা‘দ (রহ.) যুহরী (রহ.) হতে বর্ণনা করেন, জুমু‘আহর দিন যখন মুআয্যিন সফররত অবস্থায় আযান দেয় তখন তার জন্য জুমু‘আহর সালাতে উপস্থিত হওয়া উচিত। ৯০৭. আবায়া ইবনু রিফা‘আহ (রহ.) হতে বর্ণিত। তিনি বলেন, আমি জুমু‘আহর সালাতে যাবার কালে আবূ আবস্ (রাযি.)-এর সঙ্গে সাক্ষাৎ হলে তিনি বললেন, আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে বলতে শুনেছি যে, যার দু’পা আল্লাহর পথে ধূলি ধূসরিত হয়, আল্লাহ্ তার জন্য জাহান্নাম হারাম করে দেন। (২৮১১) (আধুনিক প্রকাশনীঃ ৮৫৪, ইসলামিক ফাউন্ডেশনঃ ৮৬১)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 908,
			"arabicnumber": 908,
			"text": "আবূ হুরাইরাহ্ (রাযি.) হতে বর্ণিত। তিনি বলেন, আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে বলতে শুনেছি, যখন সালাত শুরু হয়, তখন দৌড়িয়ে গিয়ে সালাতে যোগদান করবে না, বরং হেঁটে গিয়ে সালাতে যোগদান করবে। সালাতে ধীর-স্থিরভাবে যাওয়া তোমাদের জন্য অপরিহার্য। কাজেই জামা‘আতের সাথে সালাত যতটুকু পাও আদায় কর, আর যা ছুটে গেছে, পরে তা পূর্ণ করে নাও। (আধুনিক প্রকাশনীঃ ৮৫৫, ইসলামিক ফাউন্ডেশনঃ ৮৬২)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 909,
			"arabicnumber": 909,
			"text": "আবূ ক্বাতাদাহ্ (রাযি.) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেনঃ তোমরা আমাকে না দেখা পর্যন্ত সালাতে দাঁড়াবে না। তোমাদের জন্য ধীর-স্থির থাকা অত্যাবশ্যক। (৬৩৭) (আধুনিক প্রকাশনীঃ ৮৫৬, ইসলামিক ফাউন্ডেশনঃ ৮৬৩)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 910,
			"arabicnumber": 910,
			"text": "সালমান ফারিসী (রাযি.) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তি জুমু‘আহর দিন গোসল করে এবং যথাসম্ভব উত্তমরূপে পবিত্রতা অর্জন করে, অতঃপর তেল মেখে নেয় অথবা সুগন্ধি ব্যবহার করে, অতঃপর (মসজিদে) যায়, আর দু’জনের মধ্যে ফাঁক করে না এবং তার ভাগ্যে নির্ধারিত পরিমাণ সালাত আদায় করে। আর ইমাম যখন (খুৎবাহর জন্য) বের হন তখন চুপ থাকে।তার এ জুমু‘আহ এবং পরবর্তী জুমু‘আহর মধ্যবর্তী সকল গুনাহ ক্ষমা করে দেয়া হয়। (৮৮৩) (আধুনিক প্রকাশনীঃ ৮৫৭, ইসলামিক ফাউন্ডেশনঃ ৮৬৪)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 911,
			"arabicnumber": 911,
			"text": "ইবনু ‘উমার (রাযি.) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিষেধ করেছেন, যেন কেউ তার ভাইকে স্বীয় বসার স্থান হতে উঠিয়ে দিয়ে নিজে সে জায়গায় না বসে। ইবনু জুরাইজ (রহ.) বলেন, আমি নাফি‘ (রহ.)-কে জিজ্ঞেস করলাম, এ কি শুধু জুমু‘আহর ব্যাপারে? তিনি বললেন, জুমু‘আহ ও অন্যান্য (সালাতের) ব্যাপারেও। (৬২৬৯, ৬২৭০) (আধুনিক প্রকাশনীঃ ৮৫৮, ইসলামিক ফাউন্ডেশনঃ ৮৬৫)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 912,
			"arabicnumber": 912,
			"text": "সায়িব ইবনু ইয়াযীদ (রাযি.) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আবূ বাকর (রাযি.) এবং উমর (রাযি.)-এর সময় জুমু‘আহর দিন ইমাম যখন মিম্বরের উপর বসতেন, তখন প্রথম আযান দেয়া হত। পরে যখন ‘উসমান (রাযি.) খলীফাহ হলেন এবং লোকসংখ্যা বৃদ্ধি পেল, তখন তিনি ‘যাওরাহ’ হতে তৃতীয়* আযান বৃদ্ধি করেন। আবূ ‘আবদুল্লাহ্ (ইমাম বুখারী) (রহ.) বলেন, ‘যাওরাহ’ হল মাদ্বীনার অদূরে বাজারের একটি স্থান। (৯১৩, ৯১৫, ৯১৬) (আধুনিক প্রকাশনীঃ ৮৫৯, ইসলামিক ফাউন্ডেশনঃ ৮৬৬)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 913,
			"arabicnumber": 913,
			"text": "সায়িব ইবনু ইয়াযীদ (রাযি.) হতে বর্ণিত। মদিনার অধিবাসীদের সংখ্যা যখন বৃদ্ধি পেল, তখন জুমু‘আহর দিন তৃতীয় আযান যিনি বৃদ্ধি করলেন, তিনি হলেন, উসমান ইবনু ‘আফ্ফান (রাযি.)। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সময় (জুমু‘আহর জন্য) একজন ব্যতীত মুয়ায্যিন ছিল না এবং জুমু‘আহর দিন আযান দেয়া হত যখন ইমাম বসতেন অর্থাৎ মিম্বরের উপর খুৎবাহর পূর্বে। (৯১২) (আধুনিক প্রকাশনীঃ ৮৬০, ইসলামিক ফাউন্ডেশনঃ ৮৬৭)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 914,
			"arabicnumber": 914,
			"text": "মু‘আবিয়াহ ইবনু আবূ সুফ্ইয়ান (রাযি.) হতে বর্ণিত। তিনি মিম্বারে বসা অবস্থায় মুয়ায্যিন আযান দিলেন। মুয়ায্যিন বললেন, ‘‘আল্লাহু আকবার, আল্লাহু আকবার’’ মু‘আবিয়াহ (রাযি.) বললেন, ‘‘আল্লাহু আকবার, আল্লাহু আকবার।’’ মুয়ায্যিন বললেন, ‘‘আশ্হাদু আল্ লা- ইলা-হা ইল্লাল্লাহ’’ তিনি বললেন এবং আমিও (বলছি ‘‘আশ্হাদু আল্ লা- ইলা-হা ইল্লাল্লাহ)। মুয়ায্যিন বললেন, ‘‘আশ্হাদু আন্না মুহাম্মাদুর রাসূলুল্লাহ’’ তখন মু‘আবিয়াহ বললেন এবং আমিও বললাম। যখন (মুয়ায্যিন) আযান শেষ করলেন, তখন মু‘আবিয়াহ (রাযি.) বললেন, হে লোক সকল! তোমরা আমার হতে যে বাক্যগুলো শুনেছ, তা আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে মুয়ায্যিনের আযানের সময় এ মজলিসে বাক্যগুলো বলতে আমি শুনেছি। (৬১২) (আধুনিক প্রকাশনীঃ ৮৬১, ইসলামিক ফাউন্ডেশনঃ ৮৬৮)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 915,
			"arabicnumber": 915,
			"text": "সায়িব ইবনু ইয়াযীদ (রাযি.) হতে বর্ণিত। তিনি বলেন, মসজিদে মুসল্লীদের সংখ্যা বৃদ্ধি পেলে, ‘উসমান (রাযি.) জুমু‘আহর দিন দ্বিতীয় আযানের নির্দেশ দেন। অথচ (ইতোপূর্বে) জুমু‘আহর দিন ইমাম যখন (মিম্বারের উপর) বসতেন, তখন আযান দেয়া হতো। (৯১২) (আধুনিক প্রকাশনীঃ ৮৬২ ইসলামিক ফাউন্ডেশনঃ ৮৬৯)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 916,
			"arabicnumber": 916,
			"text": "সায়িব ইবনু ইয়াযীদ (রাযি.) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আবূ বাকর এবং ‘উমার (রাযি.)-এর যুগে জুমু‘আহর দিন ইমাম যখন মিম্বারের উপর বসতেন, তখন প্রথম আযান দেয়া হত। অতঃপর যখন ‘উসমান (রাযি.)-এর খিলাফাতের সময় এল এবং লোকসংখ্যা বৃদ্ধি পেল, তখন জুমু‘আহর দিন তৃতীয়* আযানের নির্দেশ দেন। ‘যাওরা’ নামক স্থান হতে এ আযান দেয়া হয়, পরে এ আযানের সিলসিলা চলতে থাকে। (৯১২) (আধুনিক প্রকাশনীঃ ৮৬৩ ইসলামিক ফাউন্ডেশনঃ ৮৭০)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 917,
			"arabicnumber": 917,
			"text": "وَقَالَ أَنَسٌ خَطَبَ النَّبِيُّ صلى الله عليه وسلم عَلَى الْمِنْبَرِ আনাস (রাযি.) বলেছেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মিম্বার হতে খুৎবাহ দিতেন। ৯১৭. আবূ হাযিম ইবনু দ্বীনার হতে বর্ণিত যে, (একদিন) কিছু লোক সাহল ইবনু সা‘দ সা‘ঈদীর নিকট আগমন করে এবং মিম্বরটি কোন্ কাঠের তৈরি ছিল, এ নিয়ে তাদের মনে প্রশ্ন জেগে ছিল। তারা এ সম্পর্কে তাঁর নিকট জিজ্ঞেস করলে তিনি বললেন, আল্লাহর শপথ! আমি সম্যকরূপে অবগত আছি যে, তা কিসের ছিল। প্রথম যেদিন তা স্থাপন করা হয় এবং প্রথম যে দিন এর উপর আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বসেন তা আমি দেখেছি। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আনসারদের অমুক মহিলার (বর্ণনাকারী বলেন, সাহল (রাযি.) তার নামও উল্লেখ করেছিলেন) নিকট লোক পাঠিয়ে বলেছিলেন, তোমার কাঠমিস্ত্রি গোলামকে আমার জন্য কিছু কাঠ দিয়ে এমন জিনিস তৈরি করার নির্দেশ দাও, যার উপর বসে আমি লোকদের সাথে কথা বলতে পারি। অতঃপর সে মহিলা তাকে আদেশ করেন এবং সে (মদিনা হতে নয় মাইল দূরবর্তী) গাবা’র ঝাউ কাঠ দ্বারা তা তৈরি করে নিয়ে আসে। মহিলাটি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট তা পাঠিয়েছেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর আদেশে এখানেই তা স্থাপন করা হয়। অতঃপর আমি দেখেছি, এর উপর আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সালাত আদায় করেছেন। এর উপর উঠে তাকবীর দিয়েছেন এবং এখানে (দাঁড়িয়ে) রুকূ‘ করেছেন। অতঃপর পিছনের দিকে নেমে এসে মিম্বারের গোড়ায় সিজদা্ করেছেন এবং (এ সিজদা্) পুনরায় করেছেন, অতঃপর সালাত শেষ করে সমবেত লোকদের দিকে ফিরে বলেছেনঃ হে লোক সকল! আমি এটা এ জন্য করেছি যে, তোমরা যেন আমার অনুসরণ করতে এবং আমার সালাত শিখে নিতে পার। (৩৭৭; মুসলিম ৫/০ হাঃ ৫৪৪৪, আহমাদ ২২১৩৪) (আধুনিক প্রকাশনীঃ ৮৬৪, ইসলামিক ফাউন্ডেশনঃ ৮৭১)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 918,
			"arabicnumber": 918,
			"text": "জাবির ইবনু ‘আবদুল্লাহ্ (রাযি.) হতে বর্ণিত। তিনি বলেন, (মসজিদে নাববীতে) এমন একটি (খেজুর গাছের) খুঁটি ছিল যার সাথে হেলান দিয়ে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দাঁড়াতেন। অতঃপর যখন তাঁর জন্য মিম্বর স্থাপন করা হল, আমরা তখন খুঁটি হতে দশ মাসের গর্ভবতী উট্নীর মত ক্রন্দন করার শব্দ শুনতে পেলাম। এমনকি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মিম্বার হতে নেমে এসে খুঁটির উপর হাত রাখলেন। (৪৪৯) (আধুনিক প্রকাশনীঃ ৮৬৫, ইসলামিক ফাউন্ডেশনঃ ৮৭২)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 919,
			"arabicnumber": 919,
			"text": "‘আবদুল্লাহ্ ইবনু ‘উমার (রাযি.) হতে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে মিম্বারের উপর হতে খুৎবাহ দিতে শুনেছি। তিনি বলেছেন, যে ব্যক্তি জুমু‘আহর সালাতে আসে সে যেন গোসল করে নেয়। (৮৭৭) (আধুনিক প্রকাশনীঃ ৮৬৬, ইসলামিক ফাউন্ডেশনঃ ৮৭৩)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 920,
			"arabicnumber": 920,
			"text": "وَقَالَ أَنَسٌ بَيْنَا النَّبِيُّ صلى الله عليه وسلم يَخْطُبُ قَائِمًا. আনাস (রাযি.) বলেছেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দাঁড়িয়ে খুতবাহ দিতেন। ৯২০. ‘আবদুল্লাহ্ ইবনু ‘উমার (রাযি.) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দাঁড়িয়ে খুৎবাহ দিতেন। অতঃপর বসতেন এবং পুনরায় দাঁড়াতেন। যেমন তোমরা এখন করে থাক। (৯২৮ মুসলিম ৭/১০, হাঃ ৮৬১, আহমাদ ৫৭৩০) (আধুনিক প্রকাশনীঃ ৮৬৭, ইসলামিক ফাউন্ডেশনঃ ৮৭৪)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 921,
			"arabicnumber": 921,
			"text": "وَاسْتَقْبَلَ ابْنُ عُمَرَ وَأَنَسٌ رَضِيَ اللهُ عَنْهُمْ الْإِمَامَ. ইবনু ‘উমার ও আনাস (রাযি.) ইমামের দিকে মুখ করতেন। ৯২১. আবূ সা‘ঈদ খুদরী (রাযি.) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একদা মিম্বারের উপর বসলেন এবং আমরা তাঁর চারদিকে (মুখ করে) বসলাম। ( ১৪৬৫, ২৮৪২, ৬৪২৭) (আধুনিক প্রকাশনীঃ ৮৬৮, ইসলামিক ফাউন্ডেশনঃ ৮৭৫)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 922,
			"arabicnumber": 922,
			"text": "رَوَاهُ عِكْرِمَةُ عَنْ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم ‘ইক্বরিমাহ (রহ.) ইবনু ‘আব্বাস (রাযি.)-এর সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেছেন। ৯২২. আসমা বিনত আবূ বাকর (রাযি.) হতে বর্ণিত। তিনি বলেন, আমি (একদিন) ‘আয়িশাহ্ (রাযি.)-এর নিকট গেলাম। লোকজন তখন সালাত আদায় করছিলেন। আমি জিজ্ঞেস করলাম, লোকদের কী হয়েছে? তখন তিনি মাথা দিয়ে আকাশের দিকে ইঙ্গিত করলেন। আমি জিজ্ঞেস করলাম, এটা কি কোন নিদর্শন? তিনি মাথা দিয়ে ইঙ্গিত করে, হ্যাঁ বললেন। (এরপর আমিও তাঁদের সঙ্গে সালাত যোগ দিলাম) অতঃপর রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সালাত এত দীর্ঘায়িত করলেন যে, আমি প্রায় অজ্ঞান হতে যাচ্ছিলাম। আমার পার্শ্বেই একটি চামড়ার মশকে পানি রাখা ছিল। আমি সেটা খুললাম এবং আমার মাথায় পানি দিতে লাগলাম। অতঃপর যখন সূর্য উজ্জ্বল হয়ে উঠলো তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সালাত সমাপ্ত করলেন এবং লোকজনের উদ্দেশ্যে খুৎবা পেশ করলেন। প্রথমে তিনি আল্লাহর যথোপযুক্ত প্রশংসা করলেন। অতঃপর বললেন, আম্মা বা‘দু। আসমা (রাযি.) বলেন, তখন কয়েকজন আনসারী মহিলা শোরগোল করছিলেন। তাই আমি চুপ করাবার উদ্দেশে তাঁদের প্রতি ঝুঁকে পড়লাম। অতঃপর ‘আয়িশাহ্ (রাযি.)-কে জিজ্ঞেস করলাম, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কী বললেন? ‘আয়িশাহ্ (রাযি.) বললেন, তিনি বলেছেন, এমন কোন জিনিস নেই যা আমাকে দেখানো হয়নি আমি এ জায়গা হতে সব কিছুই দেখেছি। এমন কি জান্নাত ও জাহান্নাম দেখলাম। আমার নিকট ওয়াহী পাঠান হয়েছে যে, তোমাদেরকে কবরে মাসীহ্ দাজ্জালের ফিতনার ন্যায় অথবা তিনি বলেছেন, সে ফেতনার কাছাকাছি ফিতনায় ফেলা হবে। (অর্থাৎ তোমাদেরকে পরীক্ষার সম্মুখীন করা হবে) তোমাদের প্রত্যেককে (কবরে) উঠানো এবং প্রশ্ন করা হবে, এ ব্যক্তি (রাসূলুল্লাহ্) সম্পর্কে তুমি কী জান? তখন মু’মিন অথবা মুকিন (নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এ দু’টোর মধ্যে কোন শব্দটি বলেছিলেন এ ব্যাপারে বর্ণনাকারী হিশামের মনে সন্দেহ রয়েছে) বলবে, তিনি হলেন, আল্লাহর রাসূল, তিনি মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম , তিনি আমাদের নিকট সুস্পষ্ট দালীল ও হিদায়াত নিয়ে এসেছিলেন। অতঃপর আমরা ঈমানএনেছি, তাঁর আহবানে সাড়া দিয়েছি, তাঁর আনুগত্য করেছি এবং তাঁকে সত্য বলে গ্রহণ করেছি। তখন তাঁকে বলা হবে, তুমি ঘুমিয়ে থাক, যেহেতু তুমি নেককার। তুমি যে তাঁর প্রতি ঈমান এনেছ তা আমরা অবশ্যই জানতাম। আর মুনাফিক বা মুরতাব (সন্দেহ পোষণকারী) (এ দু’টোর মধ্যে কোন্ শব্দটি বলেছিলেন এ সম্পর্কে বর্ণনাকারী হিশামের মনে সন্দেহ রয়েছে)-কেও প্রশ্ন করা হবে যে, এ ব্যক্তি সম্পর্কে তুমি কী জান? উত্তরে সে বলবে, আমি কিছুই জানি না। অবশ্য মানুষকে তাঁর সম্পর্কে কিছু বলতে শুনেছি, আমিও তাই বলতাম। হিশাম (রহ.) বলেন, ফাতিমা (রাযি.) আমার নিকট যা বলেছেন, তা সবটুকু আমি উত্তমরূপে স্মরণ রেখেছি। তবে তিনি ওদের প্রতি যে কঠোরতা করা হবে তাও উল্লেখ করেছেন। (৮৬) (আধুনিক প্রকাশনীঃ ৮৬৯, ইসলামিক ফাউন্ডেশনঃ অনুচ্ছেদ ৫৮৪)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 923,
			"arabicnumber": 923,
			"text": "‘আমর ইবনু তাগলিব (রাযি.) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট কিছু মাল বা কিছু সংখ্যক যুদ্ধবন্দী উপস্থিত করা হলে তিনি তা বণ্টন করে দিলেন। বণ্টনের সময় কিছু লোককে দিলেন এবং কিছু লোককে বাদ দিলেন। অতঃপর তাঁর নিকট সংবাদ পৌঁছলো যে, যাদের তিনি দেননি, তারা অসন্তুষ্ট হয়েছে। তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আল্লাহর প্রশংসা করলেন ও তাঁর মহিমা বর্ণনা করলেন, অতঃপর বললেনঃ আম্মা বা‘দ। আল্লাহর শপথ! আমি কোন লোককে দেই আর কোন লোককে দেই না। যাকে আমি দেই না, সে যাকে আমি দেই তার চেয়ে আমার নিকট অধিক প্রিয়। তবে আমি এমন লোকদের দেই যাদের অন্তরে অধৈর্য ও মালের প্রতি লিপ্সা দেখতে পাই; আর কিছু লোককে আল্লাহ্ যাদের অন্তরে অমুখাপেক্ষিতা ও কল্যাণ রেখেছেন, তাদের সে অবস্থার উপর ন্যস্ত করি। তাদের মধ্যে আমর ইবনু তাগলিব একজন। বর্ণনাকারী ‘আমর ইবনু তাগলিব (রাযি.) বলেন, আল্লাহর শপথ! আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর এ বাণীর পরিবর্তে আমি লাল উটও* পছন্দ করি না। (৩১৪৫, ৭৫৩৫) (আধুনিক প্রকাশনীঃ ৮৭০, ইসলামিক ফাউন্ডেশনঃ ৮৭৬)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 924,
			"arabicnumber": 924,
			"text": "‘আয়িশাহ্ (রাযি.) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কোন এক রাতের মধ্যভাগে বের হলেন এবং মসজিদে গিয়ে সালাত আদায় করলেন। তাঁর সঙ্গে সাহাবীগণও সালাত আদায় করলেন, সকালে তাঁরা এ নিয়ে আলোচনা করলেন। ফলে (দ্বিতীয় রাতে) এর চেয়ে অধিক সংখ্যক সহাবা একত্রিত হলেন এবং তাঁর সঙ্গে সালাত আদায় করলেন। পরের দিন সকালেও তাঁরা এ সম্পর্কে আলোচনা করলেন। ফলে তৃতীয় রাতে মসজিদে লোকসংখ্যা অত্যধিক বৃদ্ধি পেল। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বের হলেন এবং সাহাবীগণ তাঁর সঙ্গে সালাত আদায় করলেন। চতুর্থ রাতে মসজিদে মুসল্লীগণের স্থান সংকুলান হচ্ছিল না। অবশেষে তিনি ফজরের সালাতের জন্য বের হলেন এবং ফজরের সালাত শেষ করে লোকদের দিকে ফিরলেন। অতঃপর আল্লাহর হামদ ও সানা বর্ণনা করলেন। অতঃপর বললেনঃ আম্মা বা‘দ (তারপর বক্তব্য এই যে) এখানে তোমাদের উপস্থিতি আমার নিকট গোপন ছিল না, কিন্তু আমার আশংকা ছিল, তা তোমাদের জন্য ফরজ করে দেয়া হয় আর তোমরা তা আদায় করতে অপারগ হয়ে পড়। (৭২৯ মুসলিম ৬/২৫, হাঃ ৭৬১, আহমাদ ৪৫৪১৭) (আধুনিক প্রকাশনীঃ ৮৭১, ইসলামিক ফাউন্ডেশনঃ ৮৭৭)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 925,
			"arabicnumber": 925,
			"text": "আবূ হুমায়দ সা‘ঈদ (রাযি.) হতে বর্ণিত। এক সন্ধ্যায় সালাতের পর আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দাঁড়ালেন এবং শাহাদাত বাণী পাঠ করলেন। আর যথাযথভাবে আল্লাহর প্রশংসা করলেন। অতঃপর বললেন, ‘আম্মা বা‘দ’। (১৫০০, ২৫৯৭, ৬৬৩৬, ৬৯৭৯, ৭১৭৪, ৭১৯৭) (আধুনিক প্রকাশনীঃ ৮৭২, ইসলামিক ফাউন্ডেশনঃ ৮৭৮)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 926,
			"arabicnumber": 926,
			"text": "মিসওয়ার ইবনু মাখরামাহ (রাযি.) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দাঁড়ালেন। অতঃপর আমি তাঁকে তাওহীদের সাক্ষ্য বাণী পাঠান্তে বলতে শুনলাম, ‘আম্মা বা‘দ’। (৩১১০, ৩৭১৪, ৩৭২৯,৩৭৬৭, ৫২৩০, ৫২৭৮) (আধুনিক প্রকাশনীঃ ৮৭৩, ইসলামিক ফাউন্ডেশনঃ ৮৭৯)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 927,
			"arabicnumber": 927,
			"text": "ইবনু ‘আব্বাস (রাযি.) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মিম্বরের উপর আরোহণ করলেন। এ ছিল তাঁর জীবনের শেষ মাজলিস। তিনি বসেছিলেন, তাঁর দু’ কাঁধের উপর বড় চাদর জড়ানো ছিল এবং মাথায় বাঁধা ছিল কালো পট্টি। তিনি আল্লাহর গুণকীর্তন করলেন এবং তাঁর মহিমা বর্ণনা করলেন, অতঃপর বললেন, হে লোক সকল! তোমরা আমার নিকট আস। লোকজন তাঁর নিকট একত্র হলেন। অতঃপর তিনি বললেনঃ ‘আম্মা বা‘দ’। শুনে রাখ, এ আনসার গোত্র সংখ্যায় কমতে থাকবে এবং অন্য লোকেরা সংখ্যায় বাড়তে থাকবে। কাজেই যে ব্যক্তি মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর উম্মাতের কোন বিষয়ের কর্তৃত্ব লাভ করবে এবং সে এর সাহায্যে কারো ক্ষতি বা উপকার করার সুযোগ পাবে, সে যেন এই আনসারদের সৎ লোকদের ভাল কাজগুলো গ্রহণ করে এবং তাদের মন্দ কাজগুলো মাফ করে দেয়। (৩৬২৮, ৩৮০০) (আধুনিক প্রকাশনীঃ ৮৭৪, ইসলামিক ফাউন্ডেশনঃ ৮৮০)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 928,
			"arabicnumber": 928,
			"text": "‘আবদুল্লাহ্ ইবনু ‘উমার (রাযি.) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দু’ খুৎবাহ দিতেন আর দু’ খুৎবাহর মধ্যখানে বসতেন। (৯২০) (আধুনিক প্রকাশনীঃ ৮৭৫, ইসলামিক ফাউন্ডেশনঃ ৮৮১)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 929,
			"arabicnumber": 929,
			"text": "আবূ হুরাইরাহ্ (রাযি.) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, জুমু‘আহর দিন মসজিদের দরজায় মালাইকাহ অবস্থান করেন এবং ক্রমানুসারে পূর্বে আগমণকারীদের নাম লিখতে থাকেন। যে সবার পূর্বে সে আসে ঐ ব্যক্তির ন্যায় যে একটি মোটাতাজা উট কুরবানী করে। অতঃপর যে আসে সে ঐ ব্যক্তির ন্যায় যে একটি গাভী কুরবানী করে, অতঃপর মেষ কুরবানী করার ন্যায়। অতঃপর আগমনকারী ব্যক্তি মুরগী দানকারীর ন্যায়। অতঃপর আগমনকারী ব্যক্তি একটি ডিম দানকারীর ন্যায়। অতঃপর ইমাম যখন বের হন তখন মালাইকাহ তাঁদের খাতা বন্ধ করে দিয়ে মনোযোগ সহকারে খুৎবাহ শ্রবণ করতে থাকে। (৩২১১) (আধুনিক প্রকাশনীঃ ৮৭৬, ইসলামিক ফাউন্ডেশনঃ ৮৮২)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 930,
			"arabicnumber": 930,
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 931,
			"arabicnumber": 931,
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 932,
			"arabicnumber": 932,
			"text": "আনাস (রাযি.) হতে বর্ণিত। তিনি বলেন, এক জুমু‘আহর দিন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খুৎবাহ দিচ্ছিলেন। তখন এক ব্যক্তি দাঁড়িয়ে বলল, হে আল্লাহর রাসূল! (পানির অভাবে) ঘোড়া মরে যাচ্ছে, ছাগল বকরীও মরে যাচ্ছে। কাজেই আপনি দু’আ করুন, যেন আল্লাহ্ আমাদেরকে বৃষ্টি দান করেন। তখন তিনি দু’ হাত প্রসারিত করলেন এবং দু‘আ করলেন। (৯৩৩, ১০১৩, ১০১৪, ১০১৫, ১০১৬, ১০১৭, ১০১৮, ১০১৯, ১০২১, ১০২৯, ১০৩৩, ৩৫৮২, ৬০৯৩, ৬৩৪২) (আধুনিক প্রকাশনীঃ ৮৭৯, ইসলামিক ফাউন্ডেশনঃ ৮৮৫)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 933,
			"arabicnumber": 933,
			"text": "আনাস ইবনু মালিক (রাযি.) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর যুগে একবার দুর্ভিক্ষ দেখা দেয়। সে সময় কোন এক জুমু‘আহর দিন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খুৎবাহ দিচ্ছিলেন। তখন এক বেদুইন উঠে দাঁড়াল এবং আরয করল, হে আল্লাহর রাসূল! (বৃষ্টির অভাবে) সম্পদ ধ্বংস হয়ে যাচ্ছে। পরিবার পরিজনও অনাহারে রয়েছে। তাই আপনি আল্লাহর নিকট আমাদের জন্য দু‘আ করুন। তিনি দু’ হাত তুললেন। সে সময় আমরা আকাশে এক খন্ড মেঘও দেখিনি। যাঁর হাত আমার প্রাণ, তাঁর শপথ (করে বলছি)! (দু‘আ শেষে) তিনি দু’ হাত (এখনও) নামান নি, এমন সময় পাহাড়ের ন্যায় মেঘের বিরাট বিরাট খন্ড উঠে আসল। অতঃপর তিনি মিম্বার হতে নীচে নামেননি, এমন সময় দেখতে পেলাম তাঁর দাড়ির উপর ফোঁটা ফোঁটা বৃষ্টি পড়ছে। সে দিন আমাদের এখানে বৃষ্টি হল। এর পরে ক্রমাগত দু’দিন এবং পরবর্তী জুমু‘আহ পর্যন্ত প্রত্যেক দিন। (পরবর্তী জুমু‘আহর দিন) সে বেদুইন অথবা অন্য কেউ উঠে দাঁড়াল এবং আরয করল, হে আল্লাহর রাসূল! (বৃষ্টির কারণে) এখন আমাদের বাড়ি ঘর ধ্বসে পড়ছে, সম্পদ ডুবে যাচ্ছে। তাই আপনি আমাদের জন্য আল্লাহর নিকট দু‘আ করুন। তখন তিনি দু’ হাত তুললেন এবং বললেনঃ হে আল্লাহ্ আমাদের পার্শ্ববর্তী এলাকায় (বৃষ্টি দাও), আমাদের উপর নয়। (দু‘আর সময়) তিনি মেঘের এক একটি খন্ডের দিকে ইশারা করছিলেন, আর সেখানকার মেঘ কেটে যাচ্ছিল। এর ফলে চতুর্দিকে মেঘ পরিবেষ্টিত অবস্থায় ঢালের ন্যায় মদিনার আকাশ পরিষ্কার হয়ে গেলে এবং কানাত উপত্যকার পানি একমাস ধরে প্রবাহিত হতে লাগল, তখন (মদিনার) চারপাশের যে কোন অঞ্চল হতে যে কেউ এসেছে, সে এ প্রবল বৃষ্টির কথা আলোচনা করেছে। (৯৩২; মুসলিম ৯/২, হাঃ ৮৯৭, আহমাদ ১৩৬৯৪) (আধুনিক প্রকাশনীঃ ৮৮০, ইসলামিক ফাউন্ডেশনঃ ৮৮৬)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 934,
			"arabicnumber": 934,
			"text": "وَإِذَا قَالَ لِصَاحِبِهِ أَنْصِتْ فَقَدْ لَغَا وَقَالَ سَلْمَانُ عَنِ النَّبِيِّ صلى الله عليه وسلم يُنْصِتُ إِذَا تَكَلَّمَ الْإِمَامُ. যদি কেউ তার সাথীকে (মুসল্লীকে বলে) চুপ থাক, তাহলে সে একটি অনর্থক কথা বললো। সালমান ফারসী (রাযি.) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেন, যখন ইমাম কথা বলবেন, তখন চুপ থাকবে। ৯৩৪. আবূ হুরাইরাহ্ (রাযি.) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ জুমু‘আহর দিন যখন তোমার পাশের মুসল্লীকে চুপ থাক বলবে, অথচ ইমাম খুৎবাহ দিচ্ছেন, তা হলে তুমি একটি অনর্থক কথা বললে। (মুসলিম ৭/৩, হাঃ ৮৫১, আহমাদ ৭৬৯০) (আধুনিক প্রকাশনীঃ ৮৮১, ইসলামিক ফাউন্ডেশনঃ ৮৮৭)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 935,
			"arabicnumber": 935,
			"text": "আবূ হুরাইরাহ্ (রাযি.) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জুমু‘আহর দিন সম্পর্কে আলোচনা করেন এবং বলেন, এ দিনে এমন একটি মুহূর্ত রয়েছে, যে কোন মুসলিম বান্দা যদি এ সময় সালাতে দাঁড়িয়ে আল্লাহর নিকট কিছু প্রার্থনা করে, তবে তিনি তাকে অবশ্যই তা দিয়ে থাকেন এবং তিনি হাত দিয়ে ইঙ্গিত করে বুঝিয়ে দিলেন যে, সে মুহূর্তটি খুবই সংক্ষিপ্ত। (৫২৯৪, ৬৪০০; মুসলিম ৭/৪, হাঃ ৮৫২, আহমাদ ১০৩০৬) (আধুনিক প্রকাশনীঃ ৮৮২, ইসলামিক ফাউন্ডেশনঃ ৮৮৮)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 936,
			"arabicnumber": 936,
			"text": "জাবির ইবনু ‘আবদুল্লাহ্ (রাযি.) হতে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে (জুমু‘আহর) সালাত আদায় করছিলাম। এমন সময় খাদ্য দ্রব্য বহণকারী একটি উটের কাফিলা হাযির হল এবং তারা (মুসল্লীগণ) সে দিকে এত অধিক মনোযোগী হলেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সঙ্গে মাত্র বারোজন মুসল্লী অবশিষ্ট ছিলেন। তখন এ আয়াত অবতীর্ণ হলোঃ ‘‘এবং যখন তারা ব্যবসা বা খেল তামাশা দেখতে পেল তখন সে দিকে দ্রুত চলে গেল এবং আপনাকে দাঁড়ানো অবস্থায় রেখে গেল’’- (সূরাহ্ জুমু‘আহ ৬২/১১)। (২০৫৮, ২০৬৪, ৪৮৯৯; মুসলিম ৭/১১, হাঃ ৮৬৩ আহমাদ ১৪৯৮২) (আধুনিক প্রকাশনীঃ ৮৮৩, ইসলামিক ফাউন্ডেশনঃ ৮৮৯)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 937,
			"arabicnumber": 937,
			"text": "‘আবদুল্লাহ্ ইবনু ‘উমার (রাযি.) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যুহরের পূর্বে দু’ রাক‘আত ও পরে দু’ রাক‘আত, মাগরিবের পর নিজের ঘরে দু’ রাক‘আত এবং ‘ইশার পর দু‘ রাক‘আত সালাত আদায় করতেন। আর জুমু‘আহর দিন নিজের ঘরে ফিরে না যাওয়া পর্যন্ত সালাত আদায় করতেন না। (ঘরে গিয়ে) দু’ রাক‘আত সালাত আদায় করতেন।* (১১৬৫, ১১৭২, ১১৮০) (আধুনিক প্রকাশনীঃ ৮৮৪ ইসলামিক ফাউন্ডেশনঃ ৮৯০)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 938,
			"arabicnumber": 938,
			"text": "সাহল (রাযি.) হতে বর্ণিত। তিনি বলেন, আমাদের মধ্যে বসবাসকারিণী জনৈকা মহিলা একটি ছোট নহরের পাশে ক্ষেতে বীটের চাষ করতেন। জুমু‘আহর দিনে সে বীটের মূল তুলে এনে রান্নার জন্য ডেগে চড়াতেন এবং এর উপর এক মুঠো যবের আটা দিয়ে রান্না করতেন। তখন এ বীট মূলই এর গোশ্ত (গোশতের বিকল্প) হয়ে যেত। আমরা জুমু‘আহর সালাত হতে ফিরে এসে তাঁকে সালাম দিতাম। তিনি তখন খাদ্য আমাদের সামনে রাখতেন এবং আমরা তা খেতাম। আমরা সে খাদ্যের আশায় জুমু‘আর দিন উদগ্রীব থাকতাম। (৯৩৯, ৯৪১, ২৩৪৯, ৫৪০৩, ৬২৪৮, ৬২৭৯) (আধুনিক প্রকাশনীঃ ৮৮৫, ইসলামিক ফাউন্ডেশনঃ ৮৯১)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 939,
			"arabicnumber": 939,
			"text": "সাহল ইবনু সা‘দ (রাযি.) হতে এ হাদীস বর্ণিত, তিনি আরো বলেছেন, জুমু‘আহ (সালাতের) পরই আমরা কায়লূলাহ (দুপুরের শয়ন ও হাল্কা নিদ্রা) এবং দুপুরের আহার্য গ্রহণ করতাম। (৯৩৮; মুসলিম ৭/৯, হাঃ ৮৫৯) (আধুনিক প্রকাশনীঃ ৮৮৬, ইসলামিক ফাউন্ডেশনঃ ৮৯২)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 940,
			"arabicnumber": 940,
			"text": "হুমাইদ (রাযি.) হতে বর্ণিত। তিনি বলেন, আনাস (রাযি.) বলেছেনঃ আমরা সকাল সকাল জুমু‘আহ্য় যেতাম অতঃপর (সালাত শেষে) কায়লূলাহ করতাম। (৯০৫) (আধুনিক প্রকাশনীঃ ৮৮৭, ইসলামিক ফাউন্ডেশনঃ ৮৯৩)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 941,
			"arabicnumber": 941,
			"text": "সাহল (রাযি.) হতে বর্ণিত। তিনি বলেন, আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সঙ্গে জুমু‘আহর সালাত আদায় করতাম। অতঃপর দুপুরের বিশ্রাম ও হালকা নিদ্রা যেতাম। (৯৩৮) (আধুনিক প্রকাশনীঃ ৮৮৮, ইসলামিক ফাউন্ডেশনঃ ৮৯৪)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 65
			}
		}
	]
}