{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"12": "Fear Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 942,
			"arabicnumber": 942,
			"text": "وَقَوْلِ اللهِ تَعَالَى وَإِذَا ضَرَبْتُمْ فِي الْأَرْضِ فَلَيْسَ عَلَيْكُمْ جُنَاحٌ أَنْ تَقْصُرُوا مِنْ الصَّلاَةِ إِنْ خِفْتُمْ أَنْ يَفْتِنَكُمْ الَّذِينَ كَفَرُوا إِنَّ الْكَافِرِينَ كَانُوا لَكُمْ عَدُوًّا مُبِينًا وَإِذَا كُنْتَ فِيهِمْ فَأَقَمْتَ لَهُمْ الصَّلاَةَ فَلْتَقُمْ طَائِفَةٌ مِنْهُمْ مَعَكَ وَلْيَأْخُذُوا أَسْلِحَتَهُمْ فَإِذَا سَجَدُوا فَلْيَكُونُوا مِنْ وَرَائِكُمْ وَلْتَأْتِ طَائِفَةٌ أُخْرَى لَمْ يُصَلُّوا فَلْيُصَلُّوا مَعَكَ وَلْيَأْخُذُوا حِذْرَهُمْ وَأَسْلِحَتَهُمْ وَدَّ الَّذِينَ كَفَرُوا لَوْ تَغْفُلُونَ عَنْ أَسْلِحَتِكُمْ وَأَمْتِعَتِكُمْ فَيَمِيلُونَ عَلَيْكُمْ مَيْلَةً وَاحِدَةً وَلاَ جُنَاحَ عَلَيْكُمْ إِنْ كَانَ بِكُمْ أَذًى مِنْ مَطَرٍ أَوْ كُنْتُمْ مَرْضَى أَنْ تَضَعُوا أَسْلِحَتَكُمْ وَخُذُوا حِذْرَكُمْ إِنَّ اللهَ أَعَدَّ لِلْكَافِرِينَ عَذَابًا مُهِينًا মহিমান্বিত আল্লাহ্ বলেনঃ ‘‘আর যখন তোমরা পৃথিবীতে সফর করবে, তখন তোমাদের কোন গুনাহ হবে না যদি তোমরা সালাত সংক্ষিপ্ত কর, এ আশংকায় যে, কাফিররা তোমাদের জন্য ফিতনা সৃষ্টি করবে। নিশ্চয় কাফিররা হল তোমাদের প্রকাশ্য শত্রু। আর আপনি যখন তাদের মধ্যে থাকেন এবং তাদের সালাত পড়াতে চান, তখন যেন তাদের একদল আপনার সাথে দাঁড়ায় এবং তারা যেন নিজেদের অস্ত্র সাথে রাখে। তারপর যখন তারা সিজদা সম্পন্ন করবে তখন যেন তারা তোমাদের পেছনে অবস্থান নেয়, আর অন্য দল যারা সালাত আদায় করেনি তারা যেন আপনার সাথে সালাত আদায় করে নেয় এবং তারা যেন সতর্ক ও সশস্ত্র থাকে। কাফিররা চায় যেন তোমরা তোমাদের অস্ত্রশস্ত্র ও আসবাবপত্র সম্বন্ধে অসতর্ক হও যাতে তারা একযোগে তোমাদের উপর ঝাঁপিয়ে পড়তে পারে। যদি তোমরা বৃষ্টির কারণে কষ্ট পাও অথবা যদি তোমরা অসুস্থ হও, এ অবস্থায় নিজেদের অস্ত্র পরিত্যাগ করলে তোমাদের কোন গুনাহ নেই। কিন্তু তোমরা সতর্কতা অবলম্বন করবে। আল্লাহ্ কাফিরদের জন্য অবশ্যই লাঞ্ছনাদায়ক শাস্তি প্রস্তুত করে রেখেছেন।’’ (সূরাহ্ আন-নিসা ৪/১০১-১০২) ৯৪২. শু‘আয়ব (রহ.) হতে বর্ণিত। তিনি বলেন, আমি যুহরী (রহ.)-কে জিজ্ঞেস করলাম, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কি সালাত আদায় করতেন অর্থাৎ খাওফের সালাত? তিনি বললেন, আমাকে সালিম (রহ.) জানিয়েছেন যে, ‘আবদুল্লাহ্ ইবনু ‘উমার (রাযি.) বলেছেন, আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সঙ্গে নাজ্দ এলাকায় যুদ্ধ করেছিলাম। সেখানে আমরা শত্রুর মুখোমুখী কাতারবন্দী হয়ে দাঁড়ালাম। অতঃপর আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের নিয়ে সালাত আদায় করলেন। একদল তাঁর সঙ্গে সালাতে দাঁড়ালেন এবং অন্য একটি দল শত্রুর মুখোমুখী অবস্থান করলেন। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর সংগে যাঁরা ছিলেন তাঁদের নিয়ে রুকূ‘ ও দু’টি সিজদা্ করলেন। অতঃপর এ দলটি যারা সালাত আদায় করেনি, তাঁদের স্থানে চলে গেলেন এবং তাঁরা আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর পিছনে এগিয়ে এলেন, তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁদের সঙ্গে এক রুকূ‘ ও দু’ সিজদা্ করলেন এবং পরে সালাম ফিরালেন। অতঃপর তাদের প্রত্যেকে উঠে দাঁড়ালেন এবং নিজে নিজে একটি রুকূ‘ ও দু’টি সিজদা্ (সহ সালাত) শেষ করলেন। (৯৪৩, ৪১৩২, ৪১৩৩, ৪৫৩৫; মুসলিম ৬/৫৭, হাঃ ৮৩৯) (আধুনিক প্রকাশনীঃ ৮৮৯, ইসলামিক ফাউন্ডেশনঃ ৮৯৫)",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 943,
			"arabicnumber": 943,
			"text": "নাফি‘ (রহ.) সূত্রে ইবনু ‘উমার (রাযি.) হতে মুজাহিদ (রহ.)-এর বর্ণনার মতো উল্লেখ করেছেন যে, সৈন্যরা যখন পরস্পর (শত্রুমিত্র) মিলিত হয়ে যায়, ‘তখন দাঁড়িয়ে সালাত আদায় করবে। ইবনু ‘উমার (রাযি.) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে আরো বলেছেন যে, যদি সৈন্যদের অবস্থা এর চেয়ে গুরুতর হয়ে যায়, তাহলে দাঁড়ানো অবস্থায় এবং আরোহী অবস্থায় সালাত আদায় করবে। (৯৪২) (আধুনিক প্রকাশনীঃ ৮৯০, ইসলামিক ফাউন্ডেশনঃ ৮৯৬)",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 944,
			"arabicnumber": 944,
			"text": "ইবনু ‘আব্বাস (রাযি.) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সালাতে দাঁড়ালেন এবং সাহাবীগণ তাঁর পিছনে (ইক্তিদা করে) দাঁড়ালেন। তিনি তাকবীর বললেন, তারাও তাকবীর বললেন, তিনি রুকূ‘ করলেন, তারাও তাঁর সঙ্গে রুকূ‘ করলেন। অতঃপর তিনি সিজদা্ করলেন এবং তারাও তাঁর সঙ্গে সিজদা্ করলেন। অতঃপর তিনি দ্বিতীয় রাক‘আতের জন্য দাঁড়ালেন, তখন যারা তাঁর সংগে সিজদা্ করছিলেন তারা উঠে দাঁড়ালেন এবং তাদের ভাইদের পাহারা দিতে লাগলেন। তখন অপর দলটি এসে তাঁর সঙ্গে রুকূ‘ করলেন। এভাবে সকলেই সালাতে অংশগ্রহণ করলেন। অথচ একদল অপর দলকে পাহারাও দিলেন। (আধুনিক প্রকাশনীঃ ৮৯১, ইসলামিক ফাউন্ডেশনঃ ৮৯৭)",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 945,
			"arabicnumber": 945,
			"text": "وَقَالَ الْأَوْزَاعِيُّ إِنْ كَانَ تَهَيَّأَ الْفَتْحُ وَلَمْ يَقْدِرُوا عَلَى الصَّلاَةِ صَلَّوْا إِيمَاءً كُلُّ امْرِئٍ لِنَفْسِهِ فَإِنْ لَمْ يَقْدِرُوا عَلَى الإِيْمَاءِ أَخَّرُوا الصَّلاَةَ حَتَّى يَنْكَشِفَ الْقِتَالُ أَوْ يَأْمَنُوا فَيُصَلُّوا رَكْعَتَيْنِ فَإِنْ لَمْ يَقْدِرُوا صَلَّوْا رَكْعَةً وَسَجْدَتَيْنِ فَإِنْ لَمْ يَقْدِرُوا لاَ يُجْزِئُهُمْ التَّكْبِيرُ وَيُؤَخِّرُوهَا حَتَّى يَأْمَنُوا وَبِهِ قَالَ مَكْحُولٌ وَقَالَ أَنَسُ بْنُ مَالِكٍ حَضَرْتُ عِنْدَ مُنَاهَضَةِ حِصْنِ تُسْتَرَ عِنْدَ إِضَاءَةِ الْفَجْرِ وَاشْتَدَّ اشْتِعَالُ الْقِتَالِ فَلَمْ يَقْدِرُوا عَلَى الصَّلاَةِ فَلَمْ نُصَلِّ إِلاَّ بَعْدَ ارْتِفَاعِ النَّهَارِ فَصَلَّيْنَاهَا وَنَحْنُ مَعَ أَبِي مُوسَى فَفُتِحَ لَنَا وَقَالَ أَنَسُ بْنُ مَالِكٍ وَمَا يَسُرُّنِي بِتِلْكَ الصَّلاَةِ الدُّنْيَا وَمَا فِيهَا. ইমাম আওযায়ী (রহ.) বলেন, যদি অবস্থা এমন হয় যে, বিজয় আসন্ন কিন্তু শত্রুদের ভয়ে সৈন্যদের (জামা‘আতে) সালাত আদায় করা সম্ভব নয়, তাহলে সবাই একাকী ইঙ্গিতে সালাত আদায় করবে। আর যদি ইঙ্গিতে আদায় করতে না পার তবে সালাত বিলম্বিত করবে। যে পর্যন্ত না যুদ্ধ শেষ হয় বা তারা নিরাপদ হয়। অতঃপর দু’ রাক‘আত সালাত আদায় করবে। যদি (দু‘ রাকা‘আত) আদায় করতে সক্ষম না হয় তাহলে একটি রুকূ‘ ও দু’টি সিজদা্‌ (এক রাক‘আত) আদায় করবে। তাও সম্ভব না হলে শুধু তাক্‌বীর বলে সালাত শেষ করা জায়িয হবে না বরং নিরাপদ না হওয়া পর্যন্ত সালাত বিলম্ব করবে। মাকহুল ও (রহ.) এ মত পোষণ করতেন। আনাস ইব্‌নু মালিক (রাযি.) বর্ণনা করেছেন, (একটি যুদ্ধে) ভোরবেলা ভুস্‌তার দুর্গের উপর আক্রমণ চলছিলো এবং যুদ্ধ প্রচণ্ডরূপ ধারণ করে, ফলে সৈন্যদের সালাত আদায় করা অসম্ভব হয়ে পড়ে। সূর্য উঠার বেশ পরে আমরা সালাত আদায় করেছিলাম। আর আমরা তখন আবূ মূসা (রাযি.)-এর সাথে ছিলাম, পরে সে দূর্গ আমরা জয় করেছিলাম। আনাস ইব্‌নু মালিক (রাযি.) বলেন, সে সালাতের বিনিময়ে দুনিয়া ও তার সব কিছুতেও আমাকে খুশী করতে পারবে না। ৯৪৫. জাবির ইবনু ‘আবদুল্লাহ্ (রাযি.) হতে বর্ণিত। তিনি বলেন, খন্দক যুদ্ধের দিন ‘উমার (রাযি.) কুরাইশ গোত্রের কাফিরদের মন্দ বলতে বলতে আসলেন এবং বললেন, হে আল্লাহর রাসূল! সূর্য প্রায় ডুবে যাচ্ছে, অথচ ‘আসরের সালাত আদায় করতে পারিনি। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আল্লাহর কসম! আমিও তা এখনও আদায় করতে পারিনি। বর্ণনাকারী বলেন, অতঃপর তিনি মদিনার বুতহান উপত্যকায় নেমে উযূ করলেন এবং সূর্যাস্তের পর ‘আসর সালাত আদায় করলেন, অতঃপর মাগরিবের সালাত আদায় করলেন। (৫৯৬) (আধুনিক প্রকাশনীঃ ৮৯২, ইসলামিক ফাউন্ডেশনঃ ৮৯৮)",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 946,
			"arabicnumber": 946,
			"text": "وَقَالَ الْوَلِيدُ ذَكَرْتُ لِلْأَوْزَاعِيِّ صَلاَةَ شُرَحْبِيلَ بْنِ السِّمْطِ وَأَصْحَابِهِ عَلَى ظَهْرِ الدَّابَّةِ فَقَالَ كَذَلِكَ الْأَمْرُ عِنْدَنَا إِذَا تُخُوِّفَ الْفَوْتُ وَاحْتَجَّ الْوَلِيدُ بِقَوْلِ النَّبِيِّ صلى الله عليه وسلم لاَ يُصَلِّيَنَّ أَحَدٌ الْعَصْرَ إِلاَّ فِي بَنِي قُرَيْظَةَ. ওয়ালীদ (রহ.) বলেছেন, আমি ইমাম আওযা‘য়ী (রহ.)-এর নিকট শুরাহ্বীল ইব্ন সিমত (রহ.) ও তাঁর সঙ্গীগণের সওয়ার অবস্থায় তাঁদের সালাতের উল্লেখ করলাম। তখন তিনি বললেন, সালাত ফাওত হবার আশংকা থাকলে আমাদের নিকট এটাই প্রচলিত নিয়ম। এর দলীল হিসেবে ওয়ালীদ (রহ.) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নির্দেশ পেশ করেনঃ ‘‘তোমাদের কেউ যেন বানী কুরায়যায় (এলাকায়) পৌঁছার আগে আসর সালাত আদায় না করে’’। ৯৪৬. ইবনু ‘উমার (রাযি.) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আহযাব যুদ্ধ হতে ফিরার পথে আমাদেরকে বললেন, বনূ কুরাইযাহ এলাকায় পৌঁছার পূর্বে কেউ যেন ‘আসর সালাত আদায় না করে। কিন্তু অনেকের রাস্তাতেই আসরের সময় হয়ে গেল, তখন তাদের কেউ কেউ বললেন, আমরা সেখানে না পৌঁছে সালাত আদায় করব না। আবার কেউ কেউ বললেন, আমরা সালাত আদায় করে নেব, আমাদের নিষেধ করার এ উদ্দেশ্য ছিল না (বরং উদ্দেশ্য ছিল তাড়াতাড়ি যাওয়া) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট এ কথা উল্লেখ করা হলে, তিনি তাঁদের কারোর ব্যাপারে কড়াকড়ি করেননি। (৪১১৯) (আধুনিক প্রকাশনীঃ ৮৯৩, ইসলামিক ফাউন্ডেশনঃ ৮৯৯)",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 947,
			"arabicnumber": 947,
			"text": "আনাস ইবনু মালিক (রাযি.) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (একদিন) ফজরের সালাত অন্ধকার থাকতে আদায় করলেন। অতঃপর সওয়ারীতে আরোহণ করলেন এবং বললেনঃ আল্লাহু আক্বার, খায়বার ধ্বংস হোক! যখন আমরা কোন সম্প্রদায়ের এলাকায় অবতরণ করি তখন সতর্কীকৃতদের প্রভাত হয় কতই না মন্দ! তখন তারা (ইয়াহূদীরা) বের হয়ে গলির মধ্যে দৌঁড়াতে লাগল এবং বলতে লাগল, মুহাম্মাদ ও তাঁর খামীস এসে গেছে। বর্ণনাকারী বলেন, খামীস হচ্ছে সৈন্য-সামন্ত। পরে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের উপর জয়লাভ করেন। তিনি যোদ্ধাদের হত্যা করলেন এবং নারী-শিশুদের বন্দী করলেন। তখন সফীয়্যাহ প্রথম দিহ্ইয়া কালবীর এবং পরে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর অংশে পড়ল। অতঃপর তিনি তাঁকে বিয়ে করেন এবং তাঁর মুক্তিদানকে মাহররূপে গণ্য করেন। ‘আবদুল ‘আযীয (রহ.) সাবিত (রাযি.)-এর নিকট জানতে চাইলেন, তাঁকে কি মাহর দেয়া হয়েছিল? তা কি আপনি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে জিজ্ঞেস করেছিলেন? তিনি বললেন, তাঁর মুক্তিই তাঁর মাহর, আর মুচ্কি হাসলেন। (৩৭১) (আধুনিক প্রকাশনীঃ , ৮৯৪, ইসলামিক ফাউন্ডেশনঃ ৯০০)",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 6
			}
		}
	]
}