{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"15": "Invoking Allah for Rain (Istisqaa)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1005,
			"arabicnumber": 1005,
			"text": "‘আববাদ ইবনু তামীম (রহ.)-এর চাচা ‘আবদুল্লাহ্ ইবনু যায়দ (রাযি.) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বৃষ্টির জন্য দু‘আয় বের হলেন এবং তিনি স্বীয় চাদর পরিবর্তন করলেন। (১০১১, ১০১২, ১০২৩, ১০২৪, ১০২৫, ১০২৬, ১০২৭, ১০২৮, ৬৩৪৩; মুসলিম ৯/১, হাঃ ৮৯৪, আহমাদ ১৬৪৬৮) (আধুনিক প্রকাশনীঃ ৯৪৬, ইসলামিক ফাউন্ডেশনঃ ৯৫১)",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1006,
			"arabicnumber": 1006,
			"text": "আবূ হুরাইরাহ্ (রাযি.) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন শেষ রাক‘আত হতে মাথা উঠালেন, তখন বললেন, হে আল্লাহ্! আইয়্যাশ ইবনু আবূ রাবী‘আহ্কে মুক্তি দাও। হে আল্লাহ্! সালামাহ্ ইবনু হিশামকে মুক্তি দাও। হে আল্লাহ্! ওয়ালীদ ইবনু ওয়ালীদকে রক্ষা কর। হে আল্লাহ্! দুর্বল মু’মিনদেরকে মুক্তি কর। হে আল্লাহ্! মুযার গোত্রের উপর তোমার শাস্তি কঠোর করে দাও। হে আল্লাহ্! ইউসুফ (‘আ.)-এর সময়ের দুর্ভিক্ষের বছরগুলোর মত (এদের উপরে) ও কয়েক বছর দুর্ভিক্ষ দাও। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আরো বললেন, গিফার গোত্র, আল্লাহ্ তাদেরকে ক্ষমা কর। আর আসলাম গোত্র, আল্লাহ্ তাদেরকে নিরাপদে রাখ। ইবনু আবূ যিনাদ (রহ.) তাঁর পিতা হতে বলেন, এ সমস্ত দু‘আ ফজরের সালাতে ছিল। (৭৯৭) (আধুনিক প্রকাশনীঃ ৯৪৭, ইসলামিক ফাউন্ডেশনঃ ৯৫২)",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1007,
			"arabicnumber": 1007,
			"text": "‘আবদুল্লাহ্ (রাযি.) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন লোকদেরকে ইসলাম বিমুখ ভূমিকায় দেখলেন, তখন দু‘আ করলেন, হে আল্লাহ্! ইউসুফ (‘আ.)-এর সময়ের সাত বছরের (দুর্ভিক্ষের) ন্যায় তাদের উপর সাতটি বছর দুর্ভিক্ষ দাও। ফলে তাদের উপর এমন দুর্ভিক্ষ আপতিত হল যে, তা সব কিছুই ধ্বংস করে দিল। এমন কি মানুষ তখন চামড়া, মৃতদেহ এবং পচা ও গলিত জানোয়ারও খেতে লাগল। ক্ষুধার তাড়নায় অবস্থা এতদূর চরম আকার ধারণ করল যে, কেউ যখন আকাশের দিকে তাকাত তখন সে ধোঁয়া দেখতে পেত। এমতাবস্থায় আবূ সুফ্ইয়ান (ইসলাম গ্রহণের পূর্বে) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট এসে বলল, হে মুহাম্মাদ! তুমি তো আল্লাহর আদেশ মেনে চল এবং আত্মীয়তার সম্পর্ক বজায় রাখার আদেশ দান কর। কিন্তু তোমার কওমের লোকেরা তো মরে যাচ্ছে। তুমি তাদের জন্য আল্লাহর নিকট দু‘আ কর। এ প্রসঙ্গে আল্লাহ্ তা‘আলা বলেছেনঃ ‘‘তুমি সে দিনটির অপেক্ষায় থাক যখন আকাশ সুস্পষ্ট ধোঁয়ায় আচ্ছন্ন হয়ে যাবে...সেদিন আমি প্রবলভাবে তোমাদের পাকড়াও করব’’- (সূরাহ্ দুখান ৪৪/১০-১৬)। ‘আবদুল্লাহ্ (রাযি.) বলেন, সে কঠিন আঘাতের দিন ছিল বদরের যুদ্ধের দিন। ধোঁয়াও দেখা গেছে, আঘাতও এসেছে। আর মক্কার মুশ্রিকদের নিহত ও গ্রেফতার হওয়ার যে ভবিষ্যদ্বাণী করা হয়েছে, তাও সত্য হয়েছে। সত্য হয়েছে সূরাহ্ রূম-এর এ আয়াতও (রুমবাসী দশ বছরের মধ্যে পারসিকদের উপর আবার বিজয়ী হবে)। (১০২০, ৪৬৯৩, ৪৭৬৭, ৪৭৭৪, ৪৮০৯, ৪৮২০, ৪৮২১, ৪৮২২, ৪৮২৩, ৪৮৩৪, ৪৮২৫) (আধুনিক প্রকাশনীঃ ৯৪৮, ইসলামিক ফাউন্ডেশনঃ ৯৫৩)",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1009,
			"arabicnumber": 1009,
			"text": "",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1010,
			"arabicnumber": 1010,
			"text": "আনাস ইবনু মালিক (রাযি.) হতে বর্ণিত। ‘উমার ইবনু খাত্তাব (রাযি.) অনাবৃষ্টির সময় ‘আব্বাস ইবনু আবদুল মুত্তালিব (রাযি.)-এর ওয়াসীলাহ দিয়ে বৃষ্টির জন্য দু‘আ করতেন এবং বলতেন, হে আল্লাহ্! (আগে) আমরা আমাদের নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর ওয়াসীলাহ দিয়ে দু‘আ করতাম এবং আপনি বৃষ্টি দান করতেন। এখন আমরা আমাদের নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর চাচার ওয়াসীলাহ দিয়ে দু‘আ করছি, আপনি আমাদেরকে বৃষ্টি দান করুন। বর্ণনাকারী বলেন, দু‘আর সাথে সাথেই বৃষ্টি বর্ষিত হত। (৩৭১০) (আধুনিক প্রকাশনীঃ ৯৫০, ইসলামিক ফাউন্ডেশনঃ ৯৫৫)",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1011,
			"arabicnumber": 1011,
			"text": "‘আবদুল্লাহ্ ইবনু যায়িদ (রাযি.) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বৃষ্টির জন্য দু‘আ করেন এবং নিজের চাদর উল্টিয়ে দেন। (১০০৫) (আধুনিক প্রকাশনীঃ অনুচ্ছেদ পৃষ্ঠা ৪২১ ইসলামিক ফাউন্ডেশনঃ ৯৫৬)",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1012,
			"arabicnumber": 1012,
			"text": "‘আবদুল্লাহ্ ইবনু যায়দ (রাযি.) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঈদগাহে গেলেন এবং বৃষ্টির জন্য দু‘আ করলেন। অতঃপর কিব্লামুখী হয়ে নিজের চাদরখানি উল্টিয়ে নিলেন এবং দু’ রাক‘আত সালাত আদায় করলেন। ইমাম বুখারী (রহ.) বলেন, ইবনু ‘উয়াইনাহ (রহ.) বলতেন, এ হাদীসের বর্ণনাকারী ‘আবদুল্লাহ্ ইবনু যায়দ (রাযি.) হলেন আযানের ঘটনার সাথে সংশ্লিষ্ট সাহাবী। কিন্তু তা ঠিক নয়। কারণ ইনি হলেন, সেই ‘আবদুল্লাহ্ ইবনু যায়দ ইবনু ‘আসিম মাযিনী, যিনি আনসারের মাযিন গোত্রের লোক। (১০০৫) (আধুনিক প্রকাশনীঃ ৯৫১, ইসলামিক ফাউন্ডেশনঃ ৯৫৭)",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1013,
			"arabicnumber": 1013,
			"text": "بَابُ انْتِقَامِ الرَّبِّ عَزَّ وَجَلَّ مِنْ خَلْقِةِ بِالْقَحْطِ إِذَا انْتُهِكَتْ مَحَارِمُهُ ১৫/৫. অধ্যায়ঃ আল্লাহর সৃষ্টজীবের মধ্য হতে কেউ তাঁর হারামকৃত বিধানসমূহের সীমা অতিক্রম করলে মহিমাময় প্রতিপালক কর্তৃক দুর্ভিক্ষ দ্বারা শাস্তি প্রদান। ১০১৩. আনাস ইবনু মালিক (রাযি.) হতে বর্ণিত। তিনি বলেন, এক ব্যক্তি জুমু‘আহ’র দিন মিম্বরের সোজাসুজি দরওয়াজা দিয়ে (মসজিদে) প্রবেশ করল। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তখন দাঁড়িয়ে খুৎবা দিচ্ছিলেন। সে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সম্মুখে দাঁড়িয়ে বলল, হে আল্লাহর রাসূল! গবাদি পশু ধ্বংস হয়ে গেল এবং রাস্তাগুলোর চলাচল বন্ধ হয়ে গেল। সুতরাং আপনি আল্লাহর কাছে দু‘আ করুন, যেন তিনি আমাদের বৃষ্টি দেন। বর্ণনাকারী বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তখন তাঁর উভয় হাত তুলে দু‘আ করলেন, হে আল্লাহ্! বৃষ্টি দিন, হে আল্লাহ্! বৃষ্টি দিন, হে আল্লাহ্! বৃষ্টি দিন। আনাস (রাযি.) বলেন, আল্লাহর কসম! আমরা তখন আকাশে মেঘমালা, মেঘের চিহ্ন বা কিছুই দেখতে পাইনি। অথচ সাল‘আ (মদিনার একটি পাহাড়) পর্বত ও আমাদের মধ্যে কোন ঘর-বাড়ি ছিল না। আনাস (রাযি.) বলেন, হঠাৎ সাল‘আ পর্বতের পিছন হতে ঢালের মত মেঘ বেরিয়ে এল এবং তা মধ্য আকাশে পৌঁছে বিস্তৃত হয়ে পড়ল। অতঃপর বর্ষণ শুরু হল। তিনি বলেন, আল্লাহর কসম! আমরা ছয়দিন সূর্য দেখতে পাইনি। অতঃপর এক ব্যক্তি পরবর্তী জুমু‘আহ’র দিন সে দরজা দিয়ে (মসজিদে) প্রবেশ করল। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তখন দাঁড়িয়ে খুৎবাহ দিচ্ছিলেন। লোকটি দাঁড়িয়ে বলল, হে আল্লাহর রাসূল! ধন-সম্পদ ধ্বংস হয়ে গেল এবং রাস্তাঘাটও বিচ্ছিন্ন হয়ে গেল। কাজেই আপনি আল্লাহর নিকট বৃষ্টি বন্ধের জন্য দু‘আ করুন। আনাস (রাযি.) বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর উভয় হাত তুলে দু‘আ করলেন, হে আল্লাহ্! আমাদের আশেপাশে, আমাদের উপর নয়; টিলা, পাহাড়, উচ্চভূমি, মালভূমি, উপত্যকা এবং বনভূমিতে বর্ষণ করুন। আনাস (রাযি.) বলেন, এতে বৃষ্টি বন্ধ হয়ে গেল এবং আমরা (মাসজিদ হতে বেরিয়ে) রোদে চলতে লাগলাম। শরীক (রহ.) (বর্ণনাকারী) বলেন, আমি আনাস (রাযি.)-কে জিজ্ঞেস করলাম, এ লোকটি কি আগের সেই লোকটি? তিনি বললেন, আমি জানি না। (৯৩২) (আধুনিক প্রকাশনীঃ ৯৫২, ইসলামিক ফাউন্ডেশনঃ ৯৫৮)",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1014,
			"arabicnumber": 1014,
			"text": "আনাস ইবনু মালিক (রাযি.) হতে বর্ণিত। এক ব্যক্তি জুমু‘আহ’র দিন দারুল কাযা (বিচার করার স্থান)-এর দিকের দরজা দিয়ে মসজিদে প্রবেশ করল। এ সময় আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দাঁড়িয়ে খুৎবা দিচ্ছিলেন। লোকটি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর দিকে মুখ করে দাঁড়িয়ে বলল, হে আল্লাহর রাসূল! ধন-সম্পদ নষ্ট হয়ে গেল এবং রাস্তাঘাট বন্ধ হয়ে গেল। আপনি আল্লাহর নিকট দু‘আ করুন যেন তিনি আমাদের বৃষ্টি দান করেন।তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দু’ হাত তুলে দু‘আ করলেন, হে আল্লাহ্! আমাদের বৃষ্টি দান করুন। হে আল্লাহ্! আমাদের বৃষ্টি দান করুন। হে আল্লাহ্! আমাদের বৃষ্টি দান করুন। আনাস (রাযি.) বলেন, আল্লাহর কসম! আমরা তখন আকাশের দিকে তাকিয়ে দেখলাম, মেঘ নেই, মেঘের সামান্য টুকরা ও নেই। অথচ সাল‘আ পর্বত ও আমাদের মধ্যে কোন ঘরবাড়ি ছিল না। তিনি বলেন, হঠাৎ সাল‘আর ওপাশ হতে ঢালের মত মেঘ উঠে এল এবং মধ্য আকাশে এসে ছড়িয়ে পড়লো। অতঃপর প্রচুর বর্ষণ হতে লাগল। আল্লাহর কসম! আমরা ছয়দিন সূর্য দেখতে পাইনি। এর পরের জুমু‘আয় সে দরজা দিয়ে এক ব্যক্তি প্রবেশ করল। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তখন দাঁড়িয়ে খুৎবা দিচ্ছিলেন। লোকটি তাঁর সম্মুখে দাঁড়িয়ে বলল, হে আল্লাহর রাসূল! ধন-সম্পদ ধ্বংস হয়ে গেল এবং রাস্তাঘাট বিচ্ছিন্ন হয়ে গেল। কাজেই আপনি বৃষ্টি বন্ধের জন্য আল্লাহর নিকট দু‘আ করুন। আনাস (রাযি.) বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তখন দু’ হাত তুলে দু‘আ করলেন, হে আল্লাহ্! আমাদের আশে পাশে, আমাদের উপর নয়। হে আল্লাহ্! টিলা, মালভূমি, উপত্যকায় এবং বনভূমিতে বর্ষণ করুন। আনাস (রাযি.) বলেন, তখন বৃষ্টি বন্ধ হয়ে গেল এবং আমরা বেরিয়ে রোদে চলতে লাগলাম। (রাবী) শরীক (রহ.) বলেন, আমি আনাস (রাযি.)-কে জিজ্ঞেস করলাম, এ লোকটি কি আগের সেই লোক? তিনি বললেন, আমি জানি না। (৯৩২) (আধুনিক প্রকাশনীঃ ৯৫৩, ইসলামিক ফাউন্ডেশনঃ ৯৫৯)",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1015,
			"arabicnumber": 1015,
			"text": "আনাস ইবনু মালিক (রাযি.) হতে বর্ণিত তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জুমু‘আহ’র দিন খুৎবাহ দিচ্ছিলেন। এ সময় এক ব্যক্তি এসে বললেন, হে আল্লাহর রাসূল! বৃষ্টি বন্ধ হয়ে গেছে। আপনি আল্লাহর নিকট দু‘আ করুন। তিনি যেন আমাদেরকে বৃষ্টি দান করেন। তিনি তখন দু‘আ করলেন। ফলে এত অধিক বৃষ্টি হল যে, আমাদের নিজ নিজ ঘরে পৌঁছতে পারছিলাম না। এমনকি পরের জুমু‘আ পর্যন্ত বৃষ্টি হতে থাকল। আনাস (রাযি.) বলেন, তখন সে লোকটি অথবা অন্য একটি লোক দাঁড়িয়ে বলল, হে আল্লাহর রাসূল! আপনি দু‘আ করুন, আল্লাহ্ যেন আমাদের উপর হতে বৃষ্টি সরিয়ে দেন। তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ হে আল্লাহ্! আমাদের আশে পাশে, আমাদের উপর নয়। আনাস (রাযি.) বলেন, আমি তখন দেখতে পেলাম, মেঘ ডানে ও বামে পৃথক হয়ে বৃষ্টি হতে লাগল, মদিনা্বাসীর উপর বর্ষণ হচ্ছিল না। (৯৩২) (আধুনিক প্রকাশনীঃ ,৯৫৪ ইসলামিক ফাউন্ডেশনঃ ৯৬০)",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1016,
			"arabicnumber": 1016,
			"text": "আনাস ইবনু মালিক (রাযি.) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট এক ব্যক্তি এসে বলল, গৃহপালিত পশুগুলো মরে যাচ্ছে এবং রাস্তাগুলোও বন্ধ হয়ে যাচ্ছে। তখন তিনি দু‘আ করলেন। ফলে সে জুমু‘আহ হতে পরবর্তী জুমু‘আহ পর্যন্ত আমাদের উপর বৃষ্টি বর্ষিত হতে থাকল। অতঃপর সে ব্যক্তি আবার এসে বলল, (অতি বৃষ্টির ফলে) ঘরবাড়ী ধ্বংস হয়ে যাচ্ছে, রাস্তা অচল হয়ে যাচ্ছে এবং পশুগুলোও মরে যাচ্ছে। তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দাঁড়িয়ে বললেনঃ হে আল্লাহ্! টিলা, মালভূমি, উপত্যকা এবং বনভূমিতে বর্ষণ করুন। তখন মদিনা হতে মেঘ এমনভাবে কেটে গেল, যেমন কাপড় ছিঁড়ে ফাঁক হয়ে যায়। (৯৩২) (আধুনিক প্রকাশনীঃ ৯৫৫, ইসলামিক ফাউন্ডেশনঃ ৯৬১)",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1017,
			"arabicnumber": 1017,
			"text": "আনাস ইবনু মালিক (রাযি.) হতে বর্ণিত। তিনি বলেন, এক ব্যক্তি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট এসে বলল, হে আল্লাহর রাসূল! পশুগুলো মারা যাচ্ছে, এবং রাস্তাগুলো বন্ধ হয়ে যাচ্ছে। কাজেই আপনি আল্লাহর নিকট দু‘আ করুন। তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দু‘আ করলেন। ফলে সে জুমু‘আ হতে পরবর্তী জুমু‘আ পর্যন্ত তাদের উপর বৃষ্টি বর্ষিত হতে থাকল। অতঃপর এক ব্যক্তি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এসে বলল, হে আল্লাহর রাসূল! ঘরবাড়ি ধ্বসে পড়েছে, রাস্তাঘাট বিচ্ছিন্ন হয়ে যাচ্ছে এবং পশুগুলোও মরে যাচ্ছে। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তখন বললেনঃ হে আল্লাহ্! পাহাড়ের চূড়ায়, টিলায়, উপত্যকায় এবং বনভূমিতে বৃষ্টি বর্ষণ করুন। অতঃপর মাদ্বীনার আকাশ হতে মেঘ সরে গেল, যেমন কাপড় ছিঁড়ে ফাঁক হয়ে যায়। (৯৩২) (আধুনিক প্রকাশনীঃ ৯৫৬, ইসলামিক ফাউন্ডেশনঃ ৯৬২)",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1018,
			"arabicnumber": 1018,
			"text": "আনাস ইবনু মালিক (রাযি.) হতে বর্ণিত। এক ব্যক্তি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট সম্পদ বিনষ্ট হবার এবং পরিবার-পরিজনের দুঃখ-কষ্টের অভিযোগ জানান। তখন তিনি আল্লাহর নিকট বৃষ্টির জন্য দু‘আ করলেন। বর্ণনাকারী এ কথা বলেননি, তিনি (আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ) তাঁর চাদর উল্টিয়ে ছিলেন এবং এও বলেননি, তিনি কিবলামুখী হয়েছিলেন। (৯৩২) (আধুনিক প্রকাশনীঃ ৯৫৭, ইসলামিক ফাউন্ডেশনঃ ৯৬৩)",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1019,
			"arabicnumber": 1019,
			"text": "আনাস ইবনু মালিক (রাযি.) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট এক ব্যক্তি এসে বলল, হে আল্লাহর রাসূল! পশুগুলো মরে যাচ্ছে এবং রাস্তাগুলো বন্ধ হয়ে যাচ্ছে। তাই আপনি আল্লাহর নিকট (বৃষ্টির জন্য) দু‘আ করুন। তখন তিনি দু‘আ করলেন। ফলে এক জুমু‘আহ হতে পরের জুমু‘আহ পর্যন্ত আমাদের উপর বৃষ্টিপাত হতে থাকল। অতঃপর এক ব্যক্তি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট এসে বলল, হে আল্লাহর রাসূল! ঘরবাড়ি নষ্ট হয়ে যাচ্ছে এবং রাস্তাঘাট বিচ্ছিন্ন হয়ে যাচ্ছে এবং পশুগুলোও মরে যাচ্ছে। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তখন দু‘আ করলেন, হে আল্লাহ্! পাহাড়ের উপর, টিলার উপর, উপত্যকায় এবং বনভূমিতে বর্ষণ করুন। ফলে মদিনা হতে মেঘ এমনভাবে কেটে গেল যেমন কাপড় ছিড়ে ফাঁক হয়ে যায়। (৯৩২) (আধুনিক প্রকাশনীঃ ৯৫৮, ইসলামিক ফাউন্ডেশনঃ ৯৬৪)",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1020,
			"arabicnumber": 1020,
			"text": "ইবনু মাস‘ঊদ (রাযি.) হতে বর্ণিত। তিনি বলেন, কুরাইশরা যখন ইসলাম গ্রহণে দেরি করছিল, তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের বিরুদ্ধে দু‘আ করলেন। পরিণামে তাদেরকে দুর্ভিক্ষ এমনভাবে গ্রাস করল যে, তারা ধ্বংস হতে লাগল এবং মৃত দেহ ও হাড়গোড় খেতে লাগল। তখন আবূ সুফ্ইয়ান (ইসলাম গ্রহণের পূর্বে) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট এসে বলল, হে মুহাম্মাদ! তুমি তো আত্মীয়দের সাথে সদ্ব্যবহার করার নির্দেশ দিয়ে থাক। অথচ তোমার জাতি ধ্বংস হয়ে যাচ্ছে। তুমি মহান আল্লাহর নিকট দু‘আ কর। তখন তিনি তিলাওয়াত করলেন, ‘‘তুমি অপেক্ষা কর সে দিনের যে দিন আসমানে প্রকাশ্য ধোঁয়া দেখা দিবে’’- (সূরাহ্ দুখান ৪৪/১০)। অতঃপর (আল্লাহ্ যখন তাদের বিপদমুক্ত করলেন তখন) তারা আবার কুফরীর দিকে ফিরে গেল। এর পরিণতি স্বরূপ আল্লাহর এ বাণীঃ ‘‘যেদিন আমি কঠোরভাবে পাকড়াও করব’’- (সূরাহ্ দুখান ৪৪/১৬) অর্থাৎ বদরের দিন। মানসূর (রহ.) হতে (বর্ণনাকারী) আসবাত (রহ.) আরো বলেছেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দু‘আ করেন। ফলে লোকজনের উপর বৃষ্টিপাত হয় এবং অবিরাম সাতদিন পর্যন্ত বর্ষিত হতে থাকে। লোকেরা অতিবৃষ্টির বিষয়টি পেশ করল। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দু‘আ করে বলেন, হে আল্লাহ্! আমাদের আশে পাশে, আমাদের উপর নয়। অতঃপর তাঁর মাথার উপর হতে মেঘ সরে গেল। তাঁদের পার্শ্ববর্তী লোকদের উপর বর্ষিত হল। (১০০৭) (আধুনিক প্রকাশনীঃ ৯৫৯, ইসলামিক ফাউন্ডেশনঃ ৯৬৫)",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1021,
			"arabicnumber": 1021,
			"text": "আনাস ইবনু মালিক (রাযি.) হতে বর্ণিত। তিনি বলেন, জুমু‘আহর দিন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খুৎবাহ দিচ্ছিলেন। তখন লোকেরা দাঁড়িয়ে উচ্চস্বরে বলতে লাগল, হে আল্লাহর রাসূল! বৃষ্টি বন্ধ হয়ে গেছে, গাছপালা লাল হয়ে গেছে এবং পশুগুলো মারা যাচ্ছে। তাই আপনি আল্লাহর নিকট দু‘আ করুন, যেন তিনি আমাদের উপর বৃষ্টি বর্ষণ করেন। তখন তিনি বললেন, হে আল্লাহ্! আমাদের উপর বৃষ্টি বর্ষণ করুন। এভাবে দু’বার বললেন। (বর্ণনাকারী বলেন,) আল্লাহর কসম! আমরা তখন আকাশে এক খন্ড মেঘও দেখতে পাচ্ছিলাম না। হঠাৎ মেঘ দেখা দিল এবং বর্ষণ হলো। তিনি (রাসূলুল্লাহ্) মিম্বার হতে নেমে সালাত আদায় করলেন। অতঃপর যখন তিনি চলে গেলেন, তখন হতে পরবর্তী জুমু‘আহ পর্যন্ত বৃষ্টি হতে থাকে। অতঃপর যখন তিনি (দাঁড়িয়ে) জুমু‘আহর খুৎবাহ দিচ্ছিলেন, তখন লোকেরা উচ্চস্বরে তাঁর নিকট নিবেদন করল, ঘরবাড়ী বিধ্বস্ত হচ্ছে, রাস্তা বিচ্ছিন্ন হয়ে যাচ্ছে। তাই আপনি আল্লাহর নিকট দু‘আ করুন যেন আমাদের হতে তিনি বৃষ্টি বন্ধ করেন। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মৃদু হেসে বললেনঃ হে আল্লাহ্! আমাদের আশে পাশে, আমাদের উপর নয়। তখন মদিনার আকাশ মুক্ত হলো আর এর আশে পাশে বৃষ্টি হতে লাগল। মদিনা্য় তখন এক ফোঁটা বৃষ্টিও হচ্ছিল না। আমি মদিনার দিকে তাকিয়ে দেখলাম, মদিনা যেন মুকুটের ন্যায় শোভা পাচ্ছিল। (৯৩২) (আধুনিক প্রকাশনীঃ ৯৬০, ইসলামিক ফাউন্ডেশনঃ ৯৬৬)",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1022,
			"arabicnumber": 1022,
			"text": "আবূ ইসহাক (রহ.) হতে বর্ণিত। ‘আবদুল্লাহ্ ইবনু ইয়াযীদ আনসারী (রাযি.) বের হলেন এবং, বারাআ ইবনু ‘আযিব ও যায়দ ইবনু আরকাম (রাযি.) ও তাঁর সঙ্গে বের হলেন। তিনি মিম্বার ছাড়াই পায়ের উপরে দাঁড়িয়ে তাঁদের সঙ্গে নিয়ে বৃষ্টির জন্য দু‘আ করলেন। অতঃপর ইস্তিগফার করে আযান ও ইকামাত ব্যতীত সশব্দে কিরাআত পড়ে দু‘ রাক‘আত সালাত আদায় করেন। (রাবী) আবূ ইসহাক (রহ.) বলেন, ‘আবদুল্লাহ্ ইবনু ইয়াযীদ (আনসারী) (রাযি.) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে দেখেছেন। (সুতরাং তিনি সাহাবী)। (মুসলিম ১৫/৩২, হাঃ ১২৪৫) (আধুনিক প্রকাশনীঃ অনুচ্ছেদ পৃষ্ঠা ৪২৬ ও ৪২৭, ইসলামিক ফাউন্ডেশনঃ অনুচ্ছেদ ৬৫০)",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1023,
			"arabicnumber": 1023,
			"text": "‘আববাদ ইবনু তামীম হতে বর্ণিত। তাঁর চাচা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর একজন সাহাবী ছিলেন, তিনি তার নিকট বর্ণনা করেছেন যে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সাহাবীগণকে নিয়ে তাঁদের জন্য বৃষ্টির দু‘আর উদ্দেশে বের হলেন। তিনি দাঁড়ালেন এবং দাঁড়িয়েই আল্লাহর নিকট দু‘আ করলেন। অতঃপর কিবলামুখী হয়ে নিজ চাদর উল্টিয়ে দিলেন। অতঃপর তাদের উপর বৃষ্টি বর্ষিত হল। (১০০৫) (আধুনিক প্রকাশনীঃ ৯৬১, ইসলামিক ফাউন্ডেশনঃ ৯৬৭)",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1024,
			"arabicnumber": 1024,
			"text": "‘আববাদ ইবনু তামীম (রাযি.) তাঁর চাচা হতে বর্ণনা করেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বৃষ্টির দু‘আর জন্য বের হলেন, কিবলামুখী হয়ে দু‘আ করলেন এবং নিজের চাদরখানি উল্টে দিলেন। অতঃপর দু‘রাক‘আত সালাত আদায় করলেন। তিনি উভয় রাক‘আতে সশব্দে কিরাআত পাঠ করলেন। (১০০৫) (আধুনিক প্রকাশনীঃ ৯৬২, ইসলামিক ফাউন্ডেশনঃ ৯৬৮)",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1025,
			"arabicnumber": 1025,
			"text": "‘আববাদ ইবনু তামীম (রহ.) তাঁর চাচা হতে বর্ণনা করেন, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যেদিন বৃষ্টির দু‘আর উদ্দেশে বের হয়েছিলেন, আমি তা দেখেছি। বর্ণনাকারী বলেন, তিনি লোকদের দিকে তাঁর পিঠ ফিরালেন এবং কিবলামুখী হয়ে দু‘আ করলেন। অতঃপর তিনি তাঁর চাদর উল্টে দিলেন। আমাদের নিয়ে দু’রাক‘আত সালাত আদায় করলেন। তিনি উভয় রাক‘আতে সশব্দে কিরাআত পাঠ করেন। (১০০৫) (আধুনিক প্রকাশনীঃ ৯৬৩, ইসলামিক ফাউন্ডেশনঃ ৯৬৯)",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1026,
			"arabicnumber": 1026,
			"text": "‘আববাদ ইবনু তামীম (রহ.) তাঁর চাচা হতে বর্ণনা করেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বৃষ্টির জন্য দু‘আ করলেন। অতঃপর তিনি দু’রাক‘আত সালাত আদায় করলেন এবং চাদর উল্টিয়ে নিলেন। (১০০৫) (আধুনিক প্রকাশনীঃ ৯৬৪, ইসলামিক ফাউন্ডেশনঃ ৯৭০)",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1027,
			"arabicnumber": 1027,
			"text": "‘আববাদ ইবনু তামীম (রহ.) তাঁর চাচা হতে বর্ণনা করেন, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইসতিস্কার জন্য ঈদগাহর ময়দানে গমন করেন। তিনি কিব্লামুখী হলেন, অতঃপর দু‘রাক‘আত সালাত আদায় করলেন এবং তাঁর চাদর উল্টিয়ে নিলেন। সুফ্ইয়ান (রহ.) বলেন, আবূ বাকর (রাযি.) হতে মাস‘ঊদ (রাযি.) আমাদের বলেছেন, তিনি (চাদর পাল্টানোর ব্যাপারে) বলেন, ডান পাশ বাঁ পাশে দিলেন। (১০০৫) (আধুনিক প্রকাশনীঃ ৯৬৫, ইসলামিক ফাউন্ডেশনঃ ৯৭১)",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1028,
			"arabicnumber": 1028,
			"text": "‘আবদুল্লাহ্ ইবনু যায়দ আনসারী (রাযি.) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সালাতের জন্য ঈদগাহের উদ্দেশে বের হলেন। তিনি যখন দু‘আ করলেন অথবা দু‘আ করার ইচ্ছা করলেন তখন কিবলামুখী হলেন এবং তাঁর চাদর উল্টিয়ে নিলেন। ইমাম বুখারী (রহ.) বলেন, এ (হাদীসের বর্ণনাকারী) ‘আবদুল্লাহ্ ইবনু যায়দ মাযিন গোত্রীয়। পূর্বের হাদীসের বর্ণনাকারী হলেন কুফী এবং তিনি ইবনু ইয়াযীদ। (১০০৫) (আধুনিক প্রকাশনীঃ ৯৬৬, ইসলামিক ফাউন্ডেশনঃ ৯৭২)",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1029,
			"arabicnumber": 1029,
			"text": "আনাস ইবনু মালিক (রাযি.) হতে বর্ণিত। তিনি বলেন, এক বেদুঈন জুমু‘আহ’র দিন রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট উপস্থিত হয়ে বলল, হে আল্লাহর রাসূল! (অনাবৃষ্টিতে) পশুগুলো মরে যাচ্ছে, পরিবার-পরিজন মারা যাচ্ছে, মানুষ ধ্বংস হয়ে যাচ্ছে। তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দু‘আর জন্য দু’হাত উঠালেন। লোকজনও দু‘আর জন্য আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সঙ্গে হাত উঠিয়ে দু‘আ করতে লাগলেন। বর্ণনাকারী বলেন, আমরা মাসজিদ হতে বের হবার পূর্বেই বৃষ্টি আরম্ভ হয়ে গেল, এমন কি পরবর্তী জুমু‘আ পর্যন্ত আমাদের উপর বৃষ্টি হতে থাকল। তখন লোকটি আল্লাহর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট এসে বলল, হে আল্লাহর রাসূল! মুসাফির ক্লান্ত হয়ে যাচ্ছে, রাস্তাঘাট বন্ধ হয়ে গেছে। بَشِقَ -এর অর্থ ক্লান্ত হয়ে যাচ্ছে। (৯৩২) (আধুনিক প্রকাশনীঃ ৯৬৭, ইসলামিক ফাউন্ডেশনঃ ৯৭৩)",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1030,
			"arabicnumber": 1030,
			"text": "আনাস (রাযি.) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর উভয় হাত উঠিয়েছিলেন, এমন কি আমরা তাঁর বগলের শুভ্রতা দেখতে পেয়েছি। (আধুনিক প্রকাশনীঃ নাই, ইসলামিক ফাউন্ডেশনঃ ৯৭৩ শেষাংশ)",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1031,
			"arabicnumber": 1031,
			"text": "আনাস ইবনু মালিক (রাযি.) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইসতিস্কা ছাড়া অন্য কোথাও দু‘আর মধ্যে হাত উঠাতেন না। তিনি হাত এতটুকু উপরে উঠাতেন যে, তাঁর বগলের শুভ্রতা দেখা যেত। (৩৫৬৫, ৬৩৪১ মুসলিম ৯/১, হাঃ ৮৯৫) (আধুনিক প্রকাশনীঃ ৯৬৮, ইসলামিক ফাউন্ডেশনঃ ৯৭৪)",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1032,
			"arabicnumber": 1032,
			"text": "(وَقَالَ ابْنُ عَبَّاسٍ )كَصَيِّبٍ( الْمَطَرُ وَقَالَ غَيْرُهُ صَابَ وَأَصَابَ يَصُوبُ. ইবনু ‘আব্বাস (রাযি.) হতে বর্ণিত। কুরআনের আয়াত كَصَيِّبٍঅর্থ বৃষ্টি (সূরাহ আল-বাকারাহ ১৯)। অন্যরা বলেছেন كَصَيِّبٍ শব্দটি صَابَ وَأَصَابَ يَصُوبُ এর মূল ধাতু হতে উৎপন্ন। ১০৩২. ‘আয়িশাহ্ (রাযি.) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বৃষ্টি দেখলে বলতেন, হে আল্লাহ্! মুষলধারায় কল্যাণকর বৃষ্টি দাও। ক্বাসিম ইবনু ইয়াহ্ইয়া (রহ.) ‘উবাইদুল্লাহর সূত্রে তার বর্ণনায় ‘আবদুল্লাহ্ (রহ.)-এর অনুসরণ করেছেন এবং ‘উকায়ল ও আওযায়ী (রহ.) নাফি‘ (রহ.) হতে তা বর্ণনা করেছেন। (আধুনিক প্রকাশনীঃ ৯৬৯, ইসলামিক ফাউন্ডেশনঃ ৯৭৫)",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1033,
			"arabicnumber": 1033,
			"text": "আনাস ইবনু মালিক (রাযি.) হতে বর্ণিত তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর যুগে একবার লোকেরা অনাবৃষ্টিতে পতিত হল। সে সময় আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একবার মিম্বারে দাঁড়িয়ে জুমু‘আহ’র খুৎবা দিচ্ছিলেন। তখন এক বেদুঈন দাঁড়িয়ে বলল, হে আল্লাহর রাসূল! (অনাবৃষ্টিতে) ধন-সম্পদ বিনষ্ট হয়ে যাচ্ছে। পরিবার-পরিজন ক্ষুধার্ত। আপনি আল্লাহর নিকট দু‘আ করুন, তিনি যেন আমাদের বৃষ্টি দান করেন। তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর দু’ হাত তুললেন। সে সময় আকাশে একখন্ড মেঘও ছিল না। বর্ণনাকারী বলেন, হঠাৎ পাহাড়ের মত বহু মেঘ একত্রিত হল। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মিম্বার হতে নামার আগেই বৃষ্টি শুরু হলো। এমনকি আমি দেখলাম, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর দাড়ি বেয়ে বৃষ্টির পানি ঝরছে। বর্ণনাকারী আরো বলেন, সেদিন, তার পরের দিন, তার পরের দিন এবং পরবর্তী জুমু‘আহ পর্যন্ত বৃষ্টি হল। অতঃপর সে বেদুঈন বা অন্য কেউ দাঁড়িয়ে বলল, হে আল্লাহর রাসূল! ঘর-বাড়ি বিধ্বস্ত হয়ে গেল, সম্পদ ডুবে গেল, আপনি আল্লাহর নিকট আমাদের জন্য দু‘আ করুন। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তখন তাঁর দু‘হাত তুলে বললেনঃ হে আল্লাহ্! আমাদের আশে পাশে, আমাদের উপর নয়। অতঃপর তিনি হাত দিয়ে আকাশের যে দিকে ইশারা করলেন, সে দিকের মেঘ কেটে গেল। এতে সমগ্র মাদ্বীনার আকাশ মেঘ মুক্ত চালের মত হয়ে গেল এবং কানাত উপত্যকায় এক মাস ধরে বৃষ্টি প্রবাহিত হতে থাকে। বর্ণনাকারী বলেন, তখন যে এলাকা হতে লোক আসত, কেবল এ প্রবল বর্ষণের কথাই বলাবলি করত। (৯৩২) (আধুনিক প্রকাশনীঃ ৯৭০, ইসলামিক ফাউন্ডেশনঃ ৯৭৬)",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1034,
			"arabicnumber": 1034,
			"text": "আনাস ইবনু মালিক (রাযি.) হতে বর্ণিত। তিনি বলেন, যখন প্রবল গতিতে বায়ু প্রবাহিত হত তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর চেহারায় তার প্রতিক্রিয়া দেখা দিত। (ভয়ের চিহ্ন দেখা দিত)। (আধুনিক প্রকাশনীঃ ৯৭১, ইসলামিক ফাউন্ডেশনঃ ৯৭৭)",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1035,
			"arabicnumber": 1035,
			"text": "ইবনু ‘আব্বাস (রাযি.) হতে বর্ণিত নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, আমাকে পূর্বের হাওয়া দিয়ে সাহায্য করা হয়েছে। আর আদ জাতিকে পশ্চিমা হাওয়া দিয়ে ধ্বংস করা হয়েছে। (৩২০৫, ৩৩৪৩, ৩১০৫; মুসলিম ৯/৪, হাঃ ৯০০, আহমাদ ১৯৫৫, ২০১৩, ২৯৮৪) (আধুনিক প্রকাশনীঃ ৯৭২, ইসলামিক ফাউন্ডেশনঃ ৯৭৮)",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1036,
			"arabicnumber": 1036,
			"text": "আবূ হুরাইরাহ্ (রাযি.) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ক্বিয়ামাত (কিয়ামত) কায়িম হবে না, যে পর্যন্ত না ইল্ম উঠিয়ে নেয়া হবে, অধিক পরিমাণে ভূমিকম্প হবে, সময় সংকুচিত হয়ে আসবে, ফিতনা প্রকাশ পাবে এবং হারজ বৃদ্ধি পাবে। হারজ খুন-খারাবী। তোমাদের ধন-সম্পদ এত বৃদ্ধি পাবে যে, উপচে পড়বে। (৮৫) (আধুনিক প্রকাশনীঃ ৯৭৩, ইসলামিক ফাউন্ডেশনঃ ৯৭৯)",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1037,
			"arabicnumber": 1037,
			"text": "ইবনু ‘উমার (রাযি.) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, হে আল্লাহ্! আমাদের শামে (সিরিয়া) ও ইয়ামনে বরকত দান করুন। লোকেরা বলল, আমাদের নজদেও। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ হে আল্লাহ্! আমাদের শামদেশে ও ইয়ামনে বরকত দান করুন। লোকেরা তখন বলল, আমাদের নজদেও। রাবী বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তখন বললেনঃ সেখানে তো রয়েছে ভূমিকম্প ও ফিতনা-ফাসাদ আর শয়তানের শিং সেখান হতেই বের হবে (তার উত্থান ঘটবে)। (৬০৯৪) (আধুনিক প্রকাশনীঃ ৯৭৪, ইসলামিক ফাউন্ডেশনঃ ৯৮০)",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1038,
			"arabicnumber": 1038,
			"text": "قَالَ ابْنُ عَبَّاسٍ شُكْرَكُمْ. ইবনু ‘আব্বাস (রাযি.) বলেন, ‘রিযক’ দ্বারা এখানে ‘কৃতজ্ঞতা’ বুঝানো হয়েছে। ১০৩৮. যায়দ ইবনু খালিদ জুহানী (রাযি.) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রাতে বৃষ্টিপাতের পরে আমাদের নিয়ে হুদাইবিয়ায় ফজরের সালাত আদায় করেন। অতঃপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সালাম ফিরিয়ে লোকদের দিকে মুখ করে বললেনঃ তোমরা কি জান, তোমাদের রব কী বলেছেন? তাঁরা বললেন, আল্লাহ্ এবং তাঁর রাসূলই ভাল জানেন। তিনি তখন বললেন, (আল্লাহ্ বলেছেন) আমার কিছু সংখ্যক বান্দা বিশ্বাসী এবং অবিশ্বাসী হয়ে গেল। যে ব্যক্তি বলে, আল্লাহর ফযল ও রহমতে আমাদের উপর বৃষ্টি বর্ষিত হয়েছে, সে আমার প্রতি বিশ্বাসী এবং নক্ষত্রের প্রতি অবিশ্বাসী। আর যে ব্যক্তি বলে, অমুক অমুক নক্ষত্র উদয়ের ফলে (বৃষ্টি হয়েছে) সে ব্যক্তি আমার প্রতি অবিশ্বাসী এবং নক্ষত্রের প্রতি বিশ্বাসী। (৮৪৬) (আধুনিক প্রকাশনীঃ ৯৭৫, ইসলামিক ফাউন্ডেশনঃ ৯৮১)",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1039,
			"arabicnumber": 1039,
			"text": "وَقَالَ أَبُو هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم خَمْسٌ لاَ يَعْلَمُهُنَّ إِلاَّ اللَّهُ. আবূ হুরাইরাহ্ (রাযি.) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেছেন, পাঁচটি এমন বিষয় রয়েছে, যে সম্পর্কে আল্লাহ্ ছাড়া কেউ জানে না। ১০৩৯. ইবনু ‘উমার (রাযি.) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ গায়বের চাবি হল পাঁচটি, যা আল্লাহ্ ছাড়া কেউ জানে না। (১) কেউ জানে না যে, আগামীকাল কী ঘটবে। (২) কেউ জানে না যে, আগামীকাল সে কী অর্জন করবে। (৩) কেউ জানে না যে, মায়ের গর্ভে কী আছে। (৪) কেউ জানে না যে, সে কোথায় মারা যাবে। (৫) কেউ জানে না যে, কখন বৃষ্টি হবে। (৪৬২৭, ৪৬৯৭, ৪৭৭৮, ৭৩৭৯) (আধুনিক প্রকাশনীঃ ৯৭৬, ইসলামিক ফাউন্ডেশনঃ ৯৮২)",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 34
			}
		}
	]
}