{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"17": "Prostration During Recital of Qur'an"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1067,
			"arabicnumber": 1067,
			"text": "‘আবদুল্লাহ্ (রাযি.) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মক্কা্য় সূরাহ্ আন্-নাজম তিলাওয়াত করেন। অতঃপর তিনি সিজদা্ করেন এবং একজন বৃদ্ধ লোক ছাড়া তাঁর সঙ্গে সবাই সিজদা্ করেন। বৃদ্ধ লোকটি এক মুঠো কঙ্কর বা মাটি হাতে নিয়ে তার কপাল পর্যন্ত উঠিয়ে বলল, আমার জন্য এ যথেষ্ট। আমি পরবর্তীতে দেখেছি যে, সে কাফির অবস্থায় নিহত হয়েছে। (১০৭০, ৩৮৫৩, ৩৯৭২, ৪৮৬৩; মুসলিম ৫/২০/ হাঃ ৫৭৬, আহমাদ ৪২৩৫) (আধুনিক প্রকাশনীঃ ১০০১, ইসলামিক ফাউন্ডেশনঃ ১০০৬)",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1068,
			"arabicnumber": 1068,
			"text": "আবু হুরাইরাহ্ (রাযি.) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম শুক্রবার ফজরের সালাতে الم تَنْزِيلُ সূরাহ আস সিজদা এবং هَلْ أَتَى عَلَى الْإِنْسَانِ সূরাহ ইনসান তিলাওয়াত করতেন। (৮৯১) (আধুনিক প্রকাশনীঃ ১০০২, ইসলামিক ফাউন্ডেশনঃ ১০০৭)",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1069,
			"arabicnumber": 1069,
			"text": "ইবনু ‘আব্বাস (রাযি.) হতে বর্ণিত। তিনি বলেন, সূরাহ্ স-দ এর সিজদা্ অত্যাবশ্যক সিজদা্সমূহের মধ্যে গণ্য নয়। তবে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে আমি তা তিলাওয়াতের পর সিজদা্ করতে দেখেছি। (৩৪২২) (আধুনিক প্রকাশনীঃ ১০০৩, ইসলামিক ফাউন্ডেশনঃ ১০০৮)",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1070,
			"arabicnumber": 1070,
			"text": "قَالَهُ ابْنُ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا عَنِ النَّبِيِّ صلى الله عليه وسلم. ইবনু ‘আব্বাস (রাযি.) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এ বিষয়ে বর্ণনা করেছেন। ১০৭০. ‘আবদুল্লাহ্ (রাযি.) হতে বর্ণিত যে, একবার নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সূরাহ্ আন্ নাজ্ম তিলাওয়াত করেন, অতঃপর সিজদা্ করেন। তখন উপস্থিত লোকদের এমন কেউ বাকী ছিল না, যে তাঁর সঙ্গে সিজদা্ করেনি। কিন্তু এক ব্যক্তি এক মুঠো কঙ্কর বা মাটি হাতে নিয়ে মুখমন্ডল পর্যন্ত তুলে বলল, এটাই আমার জন্য যথেষ্ট। [‘আবদুল্লাহ্ (রাযি.) বলেন] পরে আমি এ ব্যক্তিকে দেখেছি যে, সে কাফির অবস্থায় নিহত হয়েছে। (১০৬৭) (আধুনিক প্রকাশনীঃ ১০০৪, ইসলামিক ফাউন্ডেশনঃ ১০০৯)",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1071,
			"arabicnumber": 1071,
			"text": "وَكَانَ ابْنُ عُمَرَ رَضِيَ اللهُ عَنْهُمَا يَسْجُدُ عَلَى غَيْرِ وُضُوءٍ. ‘আবদুল্লাহ্ ইবনু ‘উমার (রাযি.) বিনা উযূতে তিলাওয়াতের সিজদা্ করেছেন।* ১০৭১. ইবনু ‘আব্বাস (রাযি.) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সূরাহ্ ওয়ান্-নাজ্ম তিলাওয়াতের পর সিজদা্ করেন এবং তাঁর সাথে সমস্ত মুসলিম, মুশরিক, জ্বিন ও ইনসান সবাই সিজদা্ করেছিল। (৪৮৬২) (আধুনিক প্রকাশনীঃ ১০০৫, ইসলামিক ফাউন্ডেশনঃ ১০১০)",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1072,
			"arabicnumber": 1072,
			"text": "যায়দ ইবনু সাবিত (রাযি.) থেকে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট সূরাহ্ ওয়ান্ন নাজ্ম তিলাওয়াত করা হল কিন্তু তাতে তিনি সিজদা্ করেননি। (১০৭৩ মুসলিম ৫/ ২০০, হাঃ ৫৭৭, আহমাদ ২১৬৪৭, ২১৬৭৯) (আধুনিক প্রকাশনীঃ ১০০৬, ইসলামিক ফাউন্ডেশনঃ ১০১১)",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1073,
			"arabicnumber": 1073,
			"text": "যায়দ ইবনু সাবিত (রাযি.) হতে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সামনে সূরাহ্ ওয়ান্ নাজ্ম তিলাওয়াত করলাম। এতে তিনি সিজদা্ করেননি। (১০৭২) (আধুনিক প্রকাশনীঃ ১০০৭, ইসলামিক ফাউন্ডেশনঃ ১০১২)",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1074,
			"arabicnumber": 1074,
			"text": "আবূ সালামাহ হতে বর্ণিত। তিনি বলেন, একবার আবূ হুরাইরাহ্ (রাযি.)-কে দেখলাম, তিনি إِذَا السَّمَاءُ انْشَقَّتْ সূরাহ্ তিলাওয়াত করলেন এবং সিজদা্ করলেন। আমি জিজ্ঞেস করলাম, হে আবূ হুরাইরাহ্! আমি কি আপনাকে সিজদা্ করতে দেখিনি? তিনি বললেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে সিজদা্ করতে না দেখলে সিজদা্ করতাম না। (৭৬৬) (আধুনিক প্রকাশনীঃ ১০০৮, ইসলামিক ফাউন্ডেশনঃ ১০১৩)",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1075,
			"arabicnumber": 1075,
			"text": "وَقَالَ ابْنُ مَسْعُودٍ لِتَمِيمِ بْنِ حَذْلَمٍ وَهُوَ غُلَامٌ فَقَرَأَ عَلَيْهِ سَجْدَةً فَقَالَ اسْجُدْ فَإِنَّكَ إِمَامُنَا فِيهَا. তামীম ইবনু হাযলাম নামক এক বালক সিজদার আয়াত তিলাওয়াত করলে ইবনু মাস‘ঊদ (রাযি.) তাঁকে (সাজ্দাহ করতে আদেশ করে) বলেন, এ ব্যাপারে তুমিই আমাদের ইমাম। ১০৭৫. ইবনু ‘উমার (রাযি.) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একবার আমাদের সামনে এমন এক সূরাহ্ তিলাওয়াত করলেন, যাতে সিজদার আয়াত রয়েছে। তাই তিনি সিজদা্ করলেন এবং আমরাও সিজদা্ করলাম। ফলে অবস্থা এমন দাঁড়াল যে, আমাদের কেউ কেউ কপাল রাখার জায়গা পাচ্ছিলেন না। (১০৭৬, ১০৭৯; মুসলিম ৫/২০, হাঃ ৫৭৫, আহমাদ ৪৬৬৯) (আধুনিক প্রকাশনীঃ ১০০৯, ইসলামিক ফাউন্ডেশনঃ ১০১৪)",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1076,
			"arabicnumber": 1076,
			"text": "ইবনু ‘উমার (রাযি.) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সিজদার আয়াত তিলাওয়াত করতেন এবং আমরা তাঁর নিকট থাকতাম, তখন তিনি সিজদা্ করতেন এবং আমরাও তাঁর সঙ্গে সিজদা্ করতাম। এতে এত ভীড় হতো যে, আমাদের মধ্যে কেউ কেউ সিজদা্ করার জন্য কপাল রাখার জায়গা পেত না। (১০৭৫) (আধুনিক প্রকাশনীঃ ১০১০, ইসলামিক ফাউন্ডেশনঃ ১০১৫)",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1077,
			"arabicnumber": 1077,
			"text": "وَقِيلَ لِعِمْرَانَ بْنِ حُصَيْنٍ الرَّجُلُ يَسْمَعُ السَّجْدَةَ وَلَمْ يَجْلِسْ لَهَا قَالَ أَرَأَيْتَ لَوْ قَعَدَ لَهَا كَأَنَّهُ لاَ يُوجِبُهُ عَلَيْهِ وَقَالَ سَلْمَانُ مَا لِهَذَا غَدَوْنَا وَقَالَ عُثْمَانُtإِنَّمَا السَّجْدَةُ عَلَى مَنْ اسْتَمَعَهَا وَقَالَ الزُّهْرِيُّ لاَ يَسْجُدُ إِلاَّ أَنْ يَكُونَ طَاهِرًا فَإِذَا سَجَدْتَ وَأَنْتَ فِي حَضَرٍ فَاسْتَقْبِلْ الْقِبْلَةَ فَإِنْ كُنْتَ رَاكِبًا فَلاَ عَلَيْكَ حَيْثُ كَانَ وَجْهُكَ وَكَانَ السَّائِبُ بْنُ يَزِيدَ لاَ يَسْجُدُ لِسُجُودِ الْقَاصِّ. ‘ইমরান ইবনু হুসায়ন (রাযি.)-কে জিজ্ঞেস করা হয়েছিল, যে ব্যক্তি সিজদার আয়াত শুনল কিন্তু এর জন্য সে বসেনি (তার কি সিজদা্ দিতে হবে?) তিনি বললেন, তুমি কি মনে কর সে যদি তা শোনার জন্য বসতো (তা হলে কি) তাকে সিজদা্ করতে হত? [বুখারী (রহ.) বলেন] যেন তিনি তার জন্য সিজদা্ ওয়াজিব মনে করেন না। সালমান (ফারসী) (রাযি.) বলেছেন, আমরা এ জন্য (সাজ্দাহর আয়াত শোনার জন্য) আসিনি। ‘উসমান (ইবনু ‘আফ্ফান) (রাযি.) বলেছেন, যে মনোযোগসহ সিজদার আয়াত শোনে শুধু তার উপর সিজদা্ ওয়াজিব। যুহরী (রহ.) বলেছেন, পবিত্র অবস্থা ছাড়া সিজদা্ করবে না। যদি তুমি আবাসে থেকে সিজদা্ কর, তবে কিবলামুখী হবে। যদি তুমি সওয়ার অবস্থায় হও, তবে যে দিকেই তোমার মুখ হোক না কেন, তাতে তোমার কোন দোষ নেই। আর সায়িব ইবনু ইয়াযীদ (রহ.) বক্তার বক্তৃতায় সিজদার আয়াত শুনে সিজদা্ করতেন না। ১০৭৭. ‘উমার ইবনু খাত্তাব (রাযি.) হতে বর্ণিত। তিনি এক জুমু‘আহর দিন মিম্বরে দাঁড়িয়ে সুরা নাহল তিলাওয়াত করেন। এতে যখন সিজদার আয়াত এল, তখন তিনি মিম্বর হতে নেমে সিজদা্ করলেন এবং লোকেরাও সিজদা্ করল। এভাবে যখন পরবর্তী জুমু‘আহ এল, তখন তিনি সে সূরাহ্ পাঠ করেন। এতে যখন সিজদার আয়াত এল, তখন তিনি বললেন, হে লোক সকল! আমরা যখন সিজদার আয়াত তিলাওয়াত করি, তখন যে সিজদা্ করবে সে ঠিকই করবে, যে সিজদা্ করবে না তার কোন গুনাহ নেই। তার বর্ণনায় (বর্ণনাকারী বলেন) আর ‘উমার (রাযি.) সিজদা্ করেননি। নাফি‘ (রহ.) ইবনু ‘উমার (রাযি.) হতে আরো বলেছেন, আল্লাহ্ তা‘আলা সিজদা্ ফরজ করেননি, তবে আমরা ইচ্ছা করলে সিজদা্ করতে পারি। (আধুনিক প্রকাশনীঃ ১০১১, ইসলামিক ফাউন্ডেশনঃ ১০১৬)",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1078,
			"arabicnumber": 1078,
			"text": "আবূ রাফি‘ (রহ.) হতে বর্ণিত। তিনি বলেন, আমি একবার আবূ হুরাইরাহ্ (রাযি.)-এর সাথে ‘ইশার সালাত আদায় করেছিলাম। তিনি সালাতে إِذَا السَّمَاءُ انْشَقَّتْ সূরাহ্ তিলাওয়াত করে সিজদা্ করলেন। আমি জিজ্ঞেস করলাম, এ কী? তিনি বললেন, এ সূরাহ্ তিলাওয়াতের সময় আবুল কাসিম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর পিছনে আমি এ সিজদা্ করেছিলাম। তাই তাঁর সঙ্গে মিলিত না হওয়া পর্যন্ত এভাবে আমি সিজদা্ করতে থাকব। (৭৬৬) (আধুনিক প্রকাশনীঃ ১০১২, ইসলামিক ফাউন্ডেশনঃ ১০১৭)",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1079,
			"arabicnumber": 1079,
			"text": "ইবনু ‘উমার (রাযি.) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন এমন সূরাহ্ তিলাওয়াত করতেন যাতে সিজদা্ আছে, তখন তিনি সিজদা্ করতেন এবং আমরাও তাঁর সঙ্গে সিজদা্ করতাম। এমন কি (ভীড়ের কারণে) আমাদের মধ্যে কেউ কেউ কপাল রাখার জায়গা পেত না। (১০৭৫) (আধুনিক প্রকাশনীঃ ১০১৩, ইসলামিক ফাউন্ডেশনঃ ১০১৮)",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 13
			}
		}
	]
}