{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"18": "Shortening the Prayers (At-Taqseer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1080,
			"arabicnumber": 1080,
			"text": "ইবনু ‘আব্বাস (রাযি.) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একদা সফরে ঊনিশ দিন পর্যন্ত অবস্থান কালে সালাত কসর করেন। সেহেতু আমরাও ঊনিশ দিনের সফরে থাকলে কসর করি এবং এর চেয়ে অধিক হলে পূর্ণ সালাত আদায় করি। (৪২৯৮, ৪২৯৯) (আধুনিক প্রকাশনীঃ ১০১৪, ইসলামিক ফাউন্ডেশনঃ ১০১৯)",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1081,
			"arabicnumber": 1081,
			"text": "আনাস (রাযি.) হতে বর্ণিত। তিনি বলেন, আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সাথে মদিনা ফিরে আসা পর্যন্ত তিনি দু’রাক‘আত, দু’রাক‘আত সালাত আদায় করেছেন। (রাবী বলেন) আমি (আনাস (রাযি.)-কে বললাম, আপনারা (হাজ্জকালীন সময়) মক্কা্য় কয় দিন অবস্থান করেছিলেন? তিনি বললেন, সেখানে আমরা দশ দিন অবস্থান করেছিলাম। (৪২৯৭; মুসলিম ৬/১ হাঃ ৬৯৩, আহমাদ ১২৯৪৪) (আধুনিক প্রকাশনীঃ ১০১৫, ইসলামিক ফাউন্ডেশনঃ ১০২০)",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1082,
			"arabicnumber": 1082,
			"text": "‘আবদুল্লাহ্ ইবনু ‘উমার (রাযি.) হতে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আবূ বাকর এবং ‘উমার (রাযি.)-এর সঙ্গে মিনায় দু’রাক‘আত সালাত আদায় করেছি। উসমান (রাযি.)-এর সঙ্গেও তাঁর খিলাফতের প্রথম দিকে দু‘রাক‘আত আদায় করেছি। অতঃপর তিনি পূর্ণ সালাত আদায় করতে লাগলেন। (১৬৫৫; মুসলিম ৬/২, হাঃ ৬৯৪, আহমাদ ৪৫৩৩, ৬৩৬০) (আধুনিক প্রকাশনীঃ ১০১৬, ইসলামিক ফাউন্ডেশনঃ ১০২১)",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1083,
			"arabicnumber": 1083,
			"text": "হারিসাহ ইবনু ওয়াহব (রাযি.) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিরাপদ অবস্থায় আমাদেরকে নিয়ে মিনায় দু‘রাক‘আত সালাত আদায় করেন। (১৬৫৬; মুসলিম ৬/২, হাঃ ৬৯৬) (আধুনিক প্রকাশনীঃ ১০১৭, ইসলামিক ফাউন্ডেশনঃ ১০২২)",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1084,
			"arabicnumber": 1084,
			"text": "ইব্রাহীম (রহ.) হতে বর্ণিত। তিনি বলেন, আমি আবদুর রহমান ইবনু ইয়াযীদ (রহ.)-কে বলতে শুনেছি, ‘উসমান ইবনু ‘আফফান (রাযি.) আমাদেরকে নিয়ে মিনায় চার রাক‘আত সালাত আদায় করেছেন। অতঃপর এ সম্পর্কে ‘আবদুল্লাহ্ ইবনু মাস‘ঊদ (রাযি.)-কে বলা হলো, তিনি প্রথমে ‘ইন্না লিল্লাহ্’ পড়লেন। অতঃপর বললেন, আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সঙ্গে মিনায় দু‘ রাক‘আত পড়েছি এবং ‘উমার ইবনু খাত্তাব (রাযি.)-এর সঙ্গে মিনায় দু’রাক‘আত পড়েছি। কতই না ভাল হতো যদি চার রাক‘আতের পরিবর্তে দু’রাক‘আত মাকবূল সালাত হতো। (১৬৫৭; মুসলিম ৬/২, হাঃ ৬৯৫) (আধুনিক প্রকাশনীঃ ১০১৮, ইসলামিক ফাউন্ডেশনঃ ১০২৩)",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1085,
			"arabicnumber": 1085,
			"text": "ইবনু ‘আব্বাস (রাযি.) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এবং তাঁর সাহাবীগণ (যুল হিজ্জার) ৪র্থ তারিখ সকালে (মক্কা্য়) আগমন করেন এবং তাঁরা হাজ্জের জন্য তালবীয়াহ পাঠ করতে থাকেন। অতঃপর তিনি তাঁদের হাজ্জকে ‘উমরাহ্য় পরিণত করার আদেশ দেন। তবে তারা ব্যতীত যাঁদের নিকট হাদী (কুরবানীর পশু) ছিল। হাদীস বর্ণনায় ‘আতা (রহ.) জাবির ইবনু ‘আবদুল্লাহ (রাযি.)-এর অনুসরণ করেছেন। (১৫৬৪, ২৫০৫, ৩৭৩২; মুসলিম ১৫/৩১, হাঃ ১২৪০, আহমাদ ৩৫০৯) (আধুনিক প্রকাশনীঃ ১০১৯, ইসলামিক ফাউন্ডেশনঃ ১০২৪)",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1086,
			"arabicnumber": 1086,
			"text": "وَسَمَّى النَّبِيُّ صلى الله عليه وسلم يَوْمًا وَلَيْلَةً سَفَرًا وَكَانَ ابْنُ عُمَرَ وَابْنُ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمْ يَقْصُرَانِ وَيُفْطِرَانِ فِي أَرْبَعَةِ بُرُدٍ وَهِيَ سِتَّةَ عَشَرَ فَرْسَخًا. এক দিন ও এক রাতের সফরকে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সফর বলে উল্লেখ করেছেন। ইবনু ‘উমার ও ইবনু ‘আব্বাস (রাযি.) চার ‘বুর্দ’ অর্থাৎ ষোল ফারসাখ(১) দূরত্বে কসর করতেন এবং সওম পালন করতেন না। ১০৮৬. ইবনু ‘উমার (রাযি.) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন নারীই যেন মাহরামকে (২) সঙ্গে না নিয়ে তিন দিনের সফর না করে। (১০৮৭; মুসলিম ১৫/৭৪ হাঃ ১৩৩৮, আহমাদ ৪৬১৫) (আধুনিক প্রকাশনীঃ ১০২০, ইসলামিক ফাউন্ডেশনঃ ১০২৫)",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1087,
			"arabicnumber": 1087,
			"text": "‘আবদুল্লাহ্ ইবনু ‘উমার (রাযি.) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন মহিলার সাথে কোন মাহরাম পুরুষ না থাকলে, সে যেন তিন দিনের সফর না করে। আহমাদ (রহ.)....ইবনু ‘উমার (রাযি.) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে হাদীস বর্ণনায় ‘উবাইদুল্লাহ্ (রহ.)-এর অনুসরণ করেছেন। (১০৮৬) (আধুনিক প্রকাশনীঃ ১০২১, ইসলামিক ফাউন্ডেশনঃ ১০২৬)",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1088,
			"arabicnumber": 1088,
			"text": "আবূ হুরাইরাহ্ (রাযি.) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে মহিলা আল্লাহ্ এবং আখিরাতের প্রতি ঈমান রাখে, তার পক্ষে কোন মাহরাম পুরুষকে সাথে না নিয়ে একদিন ও এক রাত্রির পথ সফর করা জায়িয নয়। ইয়াহ্ইয়া ইবনু আবূ কাসীর সুহায়ল ও মালিক (রহ.)....হাদীস বর্ণনায় ইবনু আবূ যিব (রহ.)-এর অনুসরণ করেছেন। (মুসলিম ১৫/৭৪, হাঃ ১৩৩৯, আহমাদ ৮৪৯৭, ১০৪০৬) (আধুনিক প্রকাশনীঃ ১০২২, ইসলামিক ফাউন্ডেশনঃ ১০২৭)",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1089,
			"arabicnumber": 1089,
			"text": "وَخَرَجَ عَلِيُّ بْنُ أَبِي طَالِبٍ عَلَيْهِ السَّلاَم فَقَصَرَ وَهُوَ يَرَى الْبُيُوتَ فَلَمَّا رَجَعَ قِيلَ لَهُ هَذِهِ الْكُوفَةُ قَالَ لاَ حَتَّى نَدْخُلَهَا. ‘আলী (রাযি.) বের হবার পরই কসর করলেন। অথচ তিনি ঘর-বাড়ি দেখতেছিলেন, যখন তিনি ফিরলেন তখন তাঁকে বলা হল, এ তো কূফা। তিনি বললেন, না, যতক্ষণ কুফায় প্রবেশ না করি (ততক্ষণ কসর করব)। ১০৮৯. আনাস ইবনু মালিক (রাযি.) হতে বর্ণিত। তিনি বলেন, আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সঙ্গে মদিনা্য় যুহরের সালাত চার রাক‘আত আদায় করেছি এবং যুল-হুলাইফায় আসরের সালাত দু’ রাক‘আত আদায় করেছি। (১৫৪৬, ১৫৪৭, ১৫৪৮, ১৫৫১, ১৭১২, ১৭১৩, ১৭১৫, ২৯৫১, ২৯৮৬; মুসলিম ৬/১, হাঃ ৬৯০, আহমাদ ২৩৭০৩) (আধুনিক প্রকাশনীঃ ১০২৩, ইসলামিক ফাউন্ডেশনঃ ১০২৮)",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1090,
			"arabicnumber": 1090,
			"text": "‘আয়িশাহ্ (রাযি.) হতে বর্ণিত। তিনি বলেন, প্রথম অবস্থায় সালাত দু’ রাক‘আত করে ফরজ করা হয় অতঃপর সফরে সালাত সেভাবেই স্থায়ী থাকে এবং মুকীম অবস্থায় সালাত পূর্ণ (চার রাক‘আত) করা হয়েছে। যুহরী (রহ.) বলেন, আমি ‘উরওয়াহ (রহ.)-কে জিজ্ঞেস করলাম, (মিনায়) ‘আয়িশাহ্ (রাযি.) কেন সালাত পূর্ণ আদায় করতেন? তিনি বললেন, ‘উসমান (রাযি.) যে ব্যাখ্যা গ্রহণ করেছেন, ‘আয়িশাহ্ (রাযি.) তা গ্রহণ করেছেন। (৩৫০) (আধুনিক প্রকাশনীঃ ১০২৪, ইসলামিক ফাউন্ডেশনঃ ১০২৯)",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1092,
			"arabicnumber": 1092,
			"text": "",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1093,
			"arabicnumber": 1093,
			"text": "‘আমির (রাযি.) হতে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে দেখেছি, তাঁর সওয়ারী যে দিকেই ফিরেছে, তিনি সে দিকেই সালাত আদায় করেছেন। (১০৯৭, ১১০৪; মুসলিম ৬/৪, হাঃ ৭০১) (আধুনিক প্রকাশনীঃ ১০২৬, ইসলামিক ফাউন্ডেশনঃ ১০৩১)",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1094,
			"arabicnumber": 1094,
			"text": "জাবির ইবনু ‘আবদুল্লাহ্ (রাযি.) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সওয়ার অবস্থায় কিবলাহ ছাড়া অন্য দিকে মুখ করে নফল সালাত আদায় করেছেন। (৪০০) (আধুনিক প্রকাশনীঃ ১০২৭, ইসলামিক ফাউন্ডেশনঃ ১০৩২)",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1095,
			"arabicnumber": 1095,
			"text": "নাফি‘ (রহ.) হতে বর্ণিত। তিনি বলেন, ইবনু ‘উমার (রাযি.) তাঁর সওয়ারীর উপর (নফল) সালাত আদায় করতেন এবং এর উপর বিতরও আদায় করতেন। তিনি বর্ণনা করেছেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এমন করতেন। (৯৯৯) (আধুনিক প্রকাশনীঃ ১০২৮, ইসলামিক ফাউন্ডেশনঃ ১০৩৩)",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1096,
			"arabicnumber": 1096,
			"text": "‘আবদুল্লাহ্ ইবনু দ্বীনার (রহ.) হতে বর্ণিত। তিনি বলেন, ‘আবদুল্লাহ্ ইবনু ‘উমার (রাযি.) সফরে সওয়ারী যে দিকেই ফিরেছে সে দিকেই মুখ ফিরে ইঙ্গিতে সালাত আদায় করতেন এবং ‘আবদুল্লাহ্ (রাযি.) বর্ণনা করেছেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এমন করতেন। (৯৯৯) (আধুনিক প্রকাশনীঃ ১০২৯, ইসলামিক ফাউন্ডেশনঃ ১০৩৪)",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1097,
			"arabicnumber": 1097,
			"text": "‘আমির ইবনু রাবী‘আহ (রাযি.) হতে বর্ণিত। তিনি বলেন, আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে দেখেছি,তিনি সওয়ারীতে উপবিষ্ট অবস্থায় মাথা দিয়ে ইঙ্গিত করে সে দিকেই সালাত আদায় করতেন যে দিকে সওয়ারী ফিরত। কিন্তু আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফরজ সালাতে এমন করতেন না। (১০৯৩) (আধুনিক প্রকাশনীঃ ১০৩০, ইসলামিক ফাউন্ডেশনঃ ১০৩৫)",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1098,
			"arabicnumber": 1098,
			"text": "সালিম (রহ.) হতে বর্ণিত। ‘আবদুল্লাহ্ (রাযি.) সফরকালে রাতের বেলায় সওয়ারীর উপর থাকা অবস্থায় সালাত আদায় করতেন, কোন্ দিকে তাঁর মুখ রয়েছে সে দিকে লক্ষ্য করতেন না এবং ইবনু ‘উমার (রাযি.) বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সওয়ারীর উপর নফল সালাত আদায় করেছেন, সওয়ারী যে দিকে মুখ ফিরিয়েছে সে দিকেই এবং তার উপর বিতরও আদায় করেছেন। কিন্তু সওয়ারীর উপর ফরজ সালাত আদায় করতেন না। (৯৯৯) (আধুনিক প্রকাশনীঃ ১০৩১, ইসলামিক ফাউন্ডেশনঃ ১০৩৫)",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1099,
			"arabicnumber": 1099,
			"text": "জাবির ইবনু ‘আবদুল্লাহ্ (রাযি.) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সওয়ারীর উপর পূর্ব দিকে ফিরেও সালাত আদায় করেছেন। কিন্তু যখন তিনি ফরজ সালাত আদায় করার ইচ্ছা করতেন, তখন তিনি সওয়ারী হতে অবতরণ করতেন এবং কিবলামুখী হতেন। (৪০০) (আধুনিক প্রকাশনীঃ ১০৩১ শেষাংশ, ইসলামিক ফাউন্ডেশনঃ ১০৩৬)",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1100,
			"arabicnumber": 1100,
			"text": "আনাস ইবনু সীরীন (রহ.) হতে বর্ণিত। তিনি বলেন, আনাস ইবনু মালিক (রাযি.) যখন সিরিয়া হতে ফিরে আসছিলেন, তখন আমরা তাঁকে সংবর্ধনা দেয়ার জন্য এগিয়ে এসেছিলাম। আইনুত্ তামর (নামক) স্থানে আমরা তাঁর সাক্ষাৎ পেলাম। তখন আমি তাঁকে দেখলাম গাধার পিঠে (আরোহী অবস্থায়) সামনের দিকে মুখ করে সালাত আদায় করছেন। অর্থাৎ কিবলাহর বাম দিকে মুখ করে। তখন তাঁকে আমি প্রশ্ন করলাম, আপনাকে তো দেখলাম কিবলা ছাড়া অন্য দিকে মুখ করে সালাত আদায় করছেন? তিনি বললেন, যদি আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে এমন করতে না দেখতাম, তবে আমিও তা করতাম না। (মুসলিম ৬/৪, হাঃ ৭০২) (আধুনিক প্রকাশনীঃ ১০৩২, ইসলামিক ফাউন্ডেশনঃ ১০৩৭)",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1101,
			"arabicnumber": 1101,
			"text": "হাফস ইবনু ‘আসিম হতে বর্ণিত যে, ইবনু ‘উমার (রাযি.) একবার সফর করেন এবং বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সঙ্গে থেকেছি, সফরে তাঁকে নফল সালাত আদায় করতে দেখিনি এবং আল্লাহ্ তা‘আলা ইরশাদ করেছেনঃ ‘‘নিশ্চয়ই তোমাদের জন্য আল্লাহর রাসূলের মধ্যে রয়েছে উত্তম আদর্শ।’’ (সূরাহ্ আল-আহযাব ৩৩/২১১) (১১০২) (আধুনিক প্রকাশনীঃ ১০৩৩, ইসলামিক ফাউন্ডেশনঃ ১০৩৮)",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1102,
			"arabicnumber": 1102,
			"text": "হাফস ইবনু ‘আসিম (রহ.) হতে বর্ণিত। তিনি বলেন, ইবনু ‘উমার (রাযি.)-কে বলতে শুনেছি যে, আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সঙ্গে ছিলাম, তিনি সফরে দু’ রাক‘আতের অধিক আদায় করতেন না। আবূ বাকর, ‘উমার ও ‘উসমান (রাযি.)-এর এ রীতি ছিল।* (১১০১) (আধুনিক প্রকাশনীঃ ১০৩৪, ইসলামিক ফাউন্ডেশনঃ ১০৩৯)",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1103,
			"arabicnumber": 1103,
			"text": "وَرَكَعَ النَّبِيُّ صلى الله عليه وسلم رَكْعَتَيْ الْفَجْرِ فِي السَّفَرِ. সফরে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফজরের দু’ রাক‘আত (সুন্নাত) আদায় করেছেন। ১১০৩. ইবনু আবূ লায়লাহ (রহ.) হতে বর্ণিত। উম্মু হানী (রাযি.) ব্যতীত অন্য কেউ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে সালাতুয্ যুহা (পূর্বাহ্নের সালাত) আদায় করতে দেখেছেন বলে আমাদের জানাননি। তিনি [উম্মু হানী (রাযি.)] বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মক্কা বিজয়ের দিন তাঁর ঘরে গোসল করার পর আট রাক‘আত সালাত আদায় করেছেন। আমি তাঁকে এর চেয়ে সংক্ষিপ্তভাবে কোন সালাত আদায় করতে দেখিনি, তবে তিনি রুকূ’ ও সিজদা্ পূর্ণভাবে আদায় করেছিলেন। (১১৭৬, ৪২৯২; মুসলিম ৩/১৬, হাঃ ৩৩৬, আহমাদ ২৬৯৭৩) (আধুনিক প্রকাশনীঃ ১০৩৫, ইসলামিক ফাউন্ডেশনঃ ১০৪০)",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1104,
			"arabicnumber": 1104,
			"text": "‘আমির ইবনু রাবী‘আহ (রাযি.) থেকে বর্ণিত। তিনি সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে রাতের বেলা সফরে বাহনের পিঠে বাহনের গতিপথ অভিমুখী হয়ে নফল সালাত আদায় করতে দেখেছেন। (১০৯৩) (আধুনিক প্রকাশনীঃ ১০৩৬, ইসলামিক ফাউন্ডেশনঃ ১০৪০ শেষাংশ)",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1105,
			"arabicnumber": 1105,
			"text": "ইবনু ‘উমার (রাযি.) হতে বর্ণিত যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (সফরে) তাঁর বাহনের পিঠে এর গতিপথ অভিমুখী হয়ে মাথার দ্বারা ইঙ্গিত করে নফল সালাত আদায় করতেন। আর ইবনু ‘উমার (রাযি.)ও তা করতেন। (৯৯৯) (আধুনিক প্রকাশনীঃ ১০৩৭, ইসলামিক ফাউন্ডেশনঃ ১০৪১)",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1106,
			"arabicnumber": 1106,
			"text": "সালিম তার পিতা থেকে বর্ণনা করেন, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন দ্রুত সফর করতেন, তখন মাগরিব ও ‘ইশা একত্রে আদায় করতেন। (১০৯১) (আধুনিক প্রকাশনীঃ ১০৩৮, ইসলামিক ফাউন্ডেশনঃ ১০৪২)",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1107,
			"arabicnumber": 1107,
			"text": "ইবনু ‘আব্বাস (রাযি.) হতে বর্ণিত। তিনি বলেন, সফরে দ্রুত চলার সময় আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যুহর ও ‘আসরের সালাত একত্রে আদায় করতেন আর মাগরিব ‘ইশা একত্রে আদায় করতেন।* (আধুনিক প্রকাশনীঃ ১০৩৮ শেষাংশ, ইসলামিক ফাউন্ডেশনঃ ১০৪২)",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1108,
			"arabicnumber": 1108,
			"text": "আনাস ইবনু মালিক (রাযি.) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সফরকালে মাগরিব ও ‘ইশার সালাত একত্রে আদায় করতেন এবং ‘আলী ইবনু মুবারাক ও হারব (রহ.) ....আনাস (রাযি.) হতে হাদীস বর্ণনায় হুসায়ন (রহ.)-এর অনুসরণ করেছেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একত্রে আদায় করেছেন। (১১১০) (আধুনিক প্রকাশনীঃ নাই, ইসলামিক ফাউন্ডেশনঃ ১০৪২)",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1109,
			"arabicnumber": 1109,
			"text": "‘আবদুল্লাহ্ ইবনু ‘উমার (রাযি.) হতে বর্ণিত। তিনি বলেন, আমি রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে দেখেছি যখন সফরে তাঁকে দ্রুত পথ অতিক্রম করতে হত, তখন মাগরিবের সালাত এত বিলম্বিত করতেন যে মাগরিব ও ‘ইশা একত্রে আদায় করতেন। সালিম (রহ.) বলেন, ‘আবদুল্লাহ্ ইবনু ‘উমার (রাযি.)ও দ্রুত সফরকালে ঐ রকমই করতেন। তখন ইক্বামাত(ইকামত/একামত)ের পর মাগরিব তিন রাক‘আত আদায় করতেন এবং সালাম ফিরাতেন। অতঃপর অল্প সময় অপেক্ষা করেই ‘ইশা-এর ইকামাত দিয়ে তা দু‘রাক‘আত আদায় করে সালাম ফিরাতেন। এ দু’য়ের মাঝখানে কোন নফল সালাত আদায় করতেন না এবং ‘ইশার পরেও না। অতঃপর মধ্যরাতে (তাহাজ্জুদের জন্য) উঠতেন। (১০৯১) (আধুনিক প্রকাশনীঃ ১০৩৯, ইসলামিক ফাউন্ডেশনঃ ১০৪৩)",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1110,
			"arabicnumber": 1110,
			"text": "আনাস (রাযি.) হতে বর্ণিত যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সফরে এ দু’ সালাত একত্রে আদায় করতেন অর্থাৎ মাগরিব ও ‘ইশা। (১১০৮) (আধুনিক প্রকাশনীঃ ১০৪০, ইসলামিক ফাউন্ডেশনঃ ১০৪৪)",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1111,
			"arabicnumber": 1111,
			"text": "فِيهِ ابْنُ عَبَّاسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم. এ সম্পর্কে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে ‘আবদুল্লাহ্ ইবনু ‘আব্বাস (রাযি.)-এর বর্ণনা রয়েছে। ১১১১. আনাস ইবনু মালিক (রাযি.) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সূর্য ঢলে পড়ার পূর্বে সফর শুরু করলে আসরের ওয়াক্ত পর্যন্ত যুহর বিলম্বিত করতেন এবং উভয় সালাত একত্রে আদায় করতেন। আর (সফর শুরুর আগেই) সূর্য ঢলে গেলে যুহর আদায় করে নিতেন। অতঃপর সওয়ারীতে উঠতেন। (১১১২; মুসলিম ৬/৫, হাঃ ৭০৪, আহমাদ ১৩৮০১) (আধুনিক প্রকাশনীঃ ১০৪১, ইসলামিক ফাউন্ডেশনঃ ১০৪৫)",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1112,
			"arabicnumber": 1112,
			"text": "আনাস ইবনু মালিক (রাযি.) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সূর্য ঢলে পড়ার পূর্বে সফর শুরু করলে আসরের ওয়াক্ত পর্যন্ত যুহরের সালাত বিলম্বিত করতেন। অতঃপর অবতরণ করে দু’ সালাত একসাথে আদায় করতেন। আর যদি সফর শুরু করার পূর্বেই সূর্য ঢলে পড়তো তাহলে যুহরের সালাত আদায় করে নিতেন। অতঃপর সওয়ারীতে চড়তেন। (১১১১) (আধুনিক প্রকাশনীঃ ১০৪২ , ইসলামিক ফাউন্ডেশনঃ ১০৪৬)",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1113,
			"arabicnumber": 1113,
			"text": "‘আয়িশাহ্ (রাযি.) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর ঘরে সালাত আদায় করলেন, তখন তিনি অসুস্থ ছিলেন। তাই তিনি বসে বসে সালাত আদায় করছিলেন এবং এক দল সাহাবী তাঁর পিছনে দাঁড়িয়ে সালাত আদায় করতে লাগলেন। তখন তিনি বসে পড়ার জন্য তাদের প্রতি ইঙ্গিত করলেন। অতঃপর সালাত শেষ করে তিনি বললেনঃ ইমাম নির্ধারণ করা হয় তাঁকে অনুসরণ করার উদ্দেশে। কাজেই তিনি রুকূ‘ করলে তোমরা রুকূ‘ করবে এবং তিনি মাথা তুললে তোমরাও মাথা তুলবে। (৬৮৮) (আধুনিক প্রকাশনীঃ ১০৪৩, ইসলামিক ফাউন্ডেশনঃ ১০৪৭)",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1114,
			"arabicnumber": 1114,
			"text": "আনাস ইবনু মালিক (রাযি.) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঘোড়া হতে পড়ে গেলেন। এতে আঘাত লেগে তাঁর ডান পাশের চামড়া ছিলে গেল। আমরা তাঁর রোগের খোঁজ-খবর নেয়ার জন্য তাঁর নিকট গেলাম। ইতোমধ্যে সালাতের সময় হলে তিনি বসে সালাত আদায় করলেন। আমরাও বসে সালাত আদায় করলাম। পরে তিনি বললেনঃ ইমাম তো নির্ধারণ করা হয় তাকে অনুসরণ করার জন্যে। কাজেই তিনি তাকবীর বললে, তোমরাও তাকবীর বলবে, রুকূ‘ করলে তোমরাও রুকূ‘ করবে, তিনি মাথা তুললে তোমরাও মাথা তুলবে। তিনি যখন قَالَ سَمِعَ اللهُ لِمَنْ حَمِدَهُ বলে তখন তোমরা বলবে رَبَّنَا وَلَكَ الْحَمْدُ। (আধুনিক প্রকাশনীঃ ১০৪৪, ইসলামিক ফাউন্ডেশনঃ ১০৪৮)",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1115,
			"arabicnumber": 1115,
			"text": "‘ইমরান ইবনু হুসায়ন (রাযি.) হতে বর্ণিত। তিনি ছিলেন অর্শরোগী। তিনি বলেন, আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে বসে সালাত আদায় করা সম্পর্কে জিজ্ঞেস করলাম। তিনি বললেনঃ যদি কেউ দাঁড়িয়ে সালাত আদায় করে তবে তা-ই উত্তম। আর যে ব্যক্তি বসে সালাত আদায় করবে, তার জন্য দাঁড়িয়ে সালাত আদায়কারীর অর্ধেক সওয়াব আর যে শুয়ে আদায় করবে তার জন্য বসে আদায়কারীর অর্ধেক সওয়াব। (১১১৬, ১১১৭) (আধুনিক প্রকাশনীঃ ১০৪৫, ইসলামিক ফাউন্ডেশনঃ ১০৪৯)",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1116,
			"arabicnumber": 1116,
			"text": "‘ইমরান ইবনু হুসায়ন (রাযি.) হতে বর্ণিত। তিনি অর্শরোগী ছিলেন, তিনি বলেন, আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে বসে সালাত আদায়কারী ব্যক্তি সম্পর্কে প্রশ্ন করলাম। তিনি বললেনঃ যে ব্যক্তি দাঁড়িয়ে সালাত আদায় করল সে উত্তম আর যে ব্যক্তি বসে সালাত আদায় করল তার জন্য দাঁড়ান ব্যক্তির অর্ধেক সওয়াব আর যে শুয়ে সালাত আদায় করল, তার জন্য বসে সালাত আদায়কারীর অর্ধেক সওয়াব। আবূ ‘আবদুল্লাহ (রহ.) বলেন, আমার মতে এ হাদীসে نَائِمًا (ঘুমন্ত) এর দ্বারা مُضْطَجِعًا (শায়িত) অবস্থা বুঝানো হয়েছে। (১১১৫) (আধুনিক প্রকাশনীঃ ১০৪৬, ইসলামিক ফাউন্ডেশনঃ ১০৫০)",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1117,
			"arabicnumber": 1117,
			"text": "وَقَالَ عَطَاءٌ إِنْ لَمْ يَقْدِرْ أَنْ يَتَحَوَّلَ إِلَى الْقِبْلَةِ صَلَّى حَيْثُ كَانَ وَجْهُهُ. ‘আত্বা (রহ.) বলেন, কিবলার দিকে মুখ করতে অক্ষম ব্যক্তি যেদিকে সম্ভব সেদিকে মুখ করে সালাত আদায় করবে। ১১১৭. ইমরান ইবনু হুসাইন (রাযি.) হতে বর্ণিত। তিনি বলেন, আমার অর্শরোগ ছিল। তাই আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর খিদমতে সালাত সম্পর্কে প্রশ্ন করলাম, তিনি বললেনঃ দাঁড়িয়ে সালাত আদায় করবে, তা না পারলে বসে; যদি তাও না পার তাহলে শুয়ে। (১১১৫) (আধুনিক প্রকাশনীঃ ১০৪৭, ইসলামিক ফাউন্ডেশনঃ ১০৫১)",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1118,
			"arabicnumber": 1118,
			"text": "وَقَالَ الْحَسَنُ إِنْ شَاءَ الْمَرِيضُ صَلَّى رَكْعَتَيْنِ قَائِمًا وَرَكْعَتَيْنِ قَاعِدًا. হাসান (রহ.) বলেছেন, অসুস্থ ব্যক্তি ইচ্ছা করলে দু’ রাক‘আত সালাত বসে এবং দু’ রাক‘আত দাঁড়িয়ে আদায় করতে পারে। ১১১৮. উম্মুল মু’মিনীন ‘আয়িশাহ্ (রাযি.) বলেছেন যে, তিনি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে অধিক বয়সে পৌঁছার পূর্বে কখনো রাতের সালাত বসে আদায় করতে দেখেননি। (বার্ধক্যের) পরে তিনি বসে কিরাআত পাঠ করতেন। যখন তিনি রুকূ‘ করার ইচ্ছা করতেন, তখন দাঁড়িয়ে যেতেন এবং প্রায় ত্রিশ কিংবা চল্লিশ আয়াত তিলাওয়াত করে রুকূ‘ করতেন। (১১১৯, ১১৪৮, ১১৬১, ১১৬৮, ৪৮৩৭; মুসলিম ৬/১৬, হাঃ ৭৩১, আহমাদ ২৫৮৮৪) (আধুনিক প্রকাশনীঃ ১০৪৮, ইসলামিক ফাউন্ডেশনঃ ১০৫২)",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1119,
			"arabicnumber": 1119,
			"text": "উম্মুল মু’মিনীন ‘আয়িশাহ্ (রাযি.) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বসে সালাত আদায় করতেন। বসেই তিনি কিরা‘আত পাঠ করতেন। যখন তাঁর কিরা‘আতের প্রায় ত্রিশ বা চল্লিশ আয়াত বাকী থাকত, তখন তিনি দাঁড়িয়ে যেতেন এবং দাঁড়িয়ে তা তিলাওয়াত করতেন, অতঃপর রুকূ‘ করতেন; পরে সিজদা্ করতেন। দ্বিতীয় রাক‘আতেও তেমনই করতেন। সালাত শেষ করে তিনি লক্ষ্য করতেন, আমি জেগে থাকলে আমার সাথে কথা বলতেন আর ঘুমিয়ে থাকলে তিনিও শুয়ে পড়তেন। (১১১৮) (আধুনিক প্রকাশনীঃ ১০৪৯, ইসলামিক ফাউন্ডেশনঃ ১০৫৩)",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 39
			}
		}
	]
}