{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"26": "`Umrah (Minor pilgrimage)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1773,
			"arabicnumber": 1773,
			"text": "وَقَالَ ابْنُ عُمَرَ لَيْسَ أَحَدٌ إِلاَّ وَعَلَيْهِ حَجَّةٌ وَعُمْرَةٌ وَقَالَ ابْنُ عَبَّاسٍ إِنَّهَا لَقَرِينَتُهَا فِي كِتَابِ اللهِ (وَأَتِمُّوا الْحَجَّ وَالْعُمْرَةَ للهِ) ইবনু ‘উমার (রাঃ) বলেন, প্রত্যেকের জন্য হাজ্জ ও ‘উমরাহ অবশ্য পালনীয়। ইবনু ‘আব্বাস (রাঃ) বলেন, কুরআনুল কারীমে হাজ্জের সাথেই ‘উমরাহ’র উল্লেখ করা হয়েছে। আল্লাহর বাণীঃ ‘‘তোমরা আল্লাহর উদ্দেশে হাজ্জ ও ‘উমরাহ পূর্ণভাবে আদায় কর’’। (আল-বাকারাঃ ১৯৬) ১৭৭৩. আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ এক ‘উমরাহ’র পর আর এক ‘উমরাহ উভয়ের মধ্যবর্তী সময়ের (গুনাহের) জন্য কাফফারা। আর জান্নাতই হলো হাজ্জে মাবরূরের প্রতিদান। (মুসলিম ১৫/৭৯, হাঃ ১৩৪৯, আহমাদ ৯৯৫৫) (আধুনিক প্রকাশনীঃ ১৬৪৭. ইসলামিক ফাউন্ডেশনঃ ১৬৫৫)",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1774,
			"arabicnumber": 1774,
			"text": "‘ইকরিমা ইবনু খালিদ (রহ.) হতে বর্ণিত, তিনি ইবনু ‘উমার (রাঃ)-কে হাজ্জের আগে ‘উমরাহ আদায় করা সম্পর্কে জিজ্ঞেস করেন। তিনি বললেন, এতে কোন দোষ নেই। ‘ইকরিমা (রহ.) বলেন, ইবনু ‘উমার (রাঃ) বলেছেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হাজ্জের আগে ‘উমরাহ আদায় করেছেন। ইবরাহীম ইবনু সা‘দ (রহ.) ইবনু ইসহাক (রহ.) হতে বর্ণনা করেন যে, ‘ইকরিমা ইবনু খালিদ (রহ.) বলেছেন, আমি ইবনু ‘উমার (রাঃ)-কে জিজ্ঞেস করলাম। পরবর্তী অংশ। উক্ত হাদীসের অনুরূপ। (আধুনিক প্রকাশনীঃ ১৬৪৮. ইসলামিক ফাউন্ডেশনঃ ১৬৫৬)",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1776,
			"arabicnumber": 1776,
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1777,
			"arabicnumber": 1777,
			"text": "‘উরওয়াহ ইবনু যুবাইর (রহ.) হতে বর্ণিত, তিনি বলেন, আমি ‘আয়িশাহ্ (রাযি.)-এর জিজ্ঞাসা করলাম। তিনি বললেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রজব মাসে কখনো ‘উমরাহ আদায় করেননি। (১৭৭৬, মুসলিম ১৫/৩৫, হাঃ ১২৫৫) (আধুনিক প্রকাশনীঃ ১৬৫০. ইসলামিক ফাউন্ডেশনঃ ১৬৫৯)",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1778,
			"arabicnumber": 1778,
			"text": "কাতাদাহ (রহ.) হতে বর্ণিত যে, আমি আনাস (রাঃ)-কে জিজ্ঞেস করলাম, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কতবার ‘উমরাহ আদায় করেছেন? তিনি বললেন, চারবার। তন্মধ্যে হুদায়বিয়ার ‘উমরাহ যুলকা‘দা মাসে যখন মুশরিকরা তাঁকে মক্কা প্রবেশ করতে বাধা দিয়েছিল। পরবর্তী বছরের যুল-কা‘দা মাসের ‘উমরা, যখন মুশরিকদের সাথে চুক্তি সম্পাদিত হয়েছিল, জি‘রানার ‘উমরাহ, যেখানে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম গনীমতের মাল, সম্ভবতঃ হুনায়নের যুদ্ধে বণ্টন করেন। আমি বললাম, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কতবার হাজ্জ করেছেন? তিনি বললেন, একবার। (১৭৭৯, ১৭৮০, ৩০৬৬, ৪১৪৮, মুসলিম ১৫/৩৫, হাঃ ১২৫৩) (আধুনিক প্রকাশনীঃ ১৬৫১. ইসলামিক ফাউন্ডেশনঃ ১৬৬০)",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1779,
			"arabicnumber": 1779,
			"text": "কাতাদাহ (রহ.) হতে বর্ণিত যে, আমি আনাস (রাঃ)-কে জিজ্ঞেস করলাম। তিনি বললেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একবার ‘উমরাহ করেছেন যখন তাঁকে মুশরিকরা ফিরিয়ে দিয়েছিল। তার পরবর্তী বছর ছিল হুদাইবিয়ার (চুক্তি অনুযায়ী) ‘উমরাহ, (তৃতীয়) ‘উমরাহ (জি’রানা) যুল-কা‘দা মাসে আর হাজ্জের মাসে অপর একটি ‘উমরাহ করেছেন। (১৭৭৮) (আধুনিক প্রকাশনীঃ ১৬৫২. ইসলামিক ফাউন্ডেশনঃ ১৬৬১)",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1780,
			"arabicnumber": 1780,
			"text": "হাম্মাম (রহ.) হতে বর্ণনা করেন যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম চারটি ‘উমরাহ করেছেন। তন্মধ্যে হাজ্জের মাসে যে ‘উমরাহ করেছেন তা ছাড়া বাকী সব ‘উমরাহই যুল-কা‘দা মাসে করেছেন। অর্থাৎ হুদাইবিয়ার ‘উমরাহ, পরবর্তী বছরের ‘উমরাহ, জি‘রানার ‘উমরাহ, যেখানে তিনি হুনাইনের মালে গনীমত বণ্টন করেছিলেন এবং হাজ্জের মাসে আদায়কৃত ‘উমরাহ। (১৭৭৮) (আধুনিক প্রকাশনীঃ ১৬৫৩. ইসলামিক ফাউন্ডেশনঃ ১৬৬২)",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1781,
			"arabicnumber": 1781,
			"text": "আবূ ইসহাক (রহ.) হতে বর্ণিত, তিনি বলেন, আমি মাসরূক, ‘আত্বা এবং মুজাহিদ (রহ.)-কে জিজ্ঞেস করলাম, তাঁরা বললেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যুল-কা‘দা মাসে হাজ্জের আগে ‘উমরাহ করেছেন। রাবী বলেন, আমি বারা’ ইবনু ‘আযিব (রাঃ)-কে বলতে শুনেছি যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হাজ্জ করার আগে দু’বার যুল-কা‘দা মাসে ‘উমরাহ করেছেন। (১৮৪৪, ২৬৯৮, ২৬৯৯, ২৭০০, ৩১৮৪, ৪২৫১) (আধুনিক প্রকাশনীঃ ১৬৫৪. ইসলামিক ফাউন্ডেশনঃ ১৬৬৩)",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1782,
			"arabicnumber": 1782,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক আনসারী মহিলাকে বললেনঃ আমাদের সঙ্গে হাজ্জ করতে তোমার বাধা কিসের? ইবনু ‘আব্বাস (রাঃ) মহিলার নাম বলেছিলেন কিন্তু আমি ভুলে গিয়েছি। মহিলা বলল, আমাদের একটি পানি বহনকারী উট ছিল। কিন্তু তাতে অমুকের পিতা ও তার পুত্র (অর্থাৎ মহিলার স্বামী ও ছেলে) আরোহণ করে চলে গেছেন। আর আমাদের জন্য রেখে গেছেন পানি বহনকারী আরেকটি উট যার দ্বারা আমরা পানি বহন করে থাকি। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আচ্ছা, রমাযান এলে তখন ‘উমরাহ করে নিও। কেননা, রমযানের একটি ‘উমরাহ একটি হাজ্জের সমতুল্য। অথবা এরূপ কোন কথা তিনি বলেছিলেন। (১৮৬৩, মুসলিম ১৫/৩৬, হাঃ ১২৫৬, আহমাদ ২০২৫) (আধুনিক প্রকাশনীঃ ১৬৫৫. ইসলামিক ফাউন্ডেশনঃ ১৬৬৪)",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1783,
			"arabicnumber": 1783,
			"text": "‘আয়িশাহ্ (রাযি.) হতে বর্ণিত, তিনি বলেন, আমরা আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সঙ্গে রওয়ানা হলাম যখন যুলহাজ্জ আগত প্রায়। তখন তিনি আমাদের বললেনঃ তোমাদের মধ্যে যে হাজ্জের ইহরাম বাঁধতে চায়, সে যেন হাজ্জের ইহরাম বেঁধে নেয়। আর যে ‘উমরাহ’র ইহরাম বাঁধতে চায় সে যেন ‘উমরাহ’র ইহরাম বেঁধে নেয়। আমি যদি কুরবানীর জানোয়ার সঙ্গে না আনতাম তাহলে অবশ্যই আমি ‘উমরাহ’র ইহরাম বাঁধতাম। ‘আয়িশাহ্ (রাযি.) বলেন, আমাদের মধ্যে কেউ ‘উমরাহ’র ইহরাম বাঁধলেন, আবার কেউ হাজ্জের। যারা ‘উমরাহ’র ইহরাম বেঁধেছিলেন, আমি তাদের একজন। ‘আরাফার দিন এল, তখন আমি ঋতুমতী ছিলাম। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট তা জানালাম। তিনি বললেনঃ ‘উমরাহ ছেড়ে দাও এবং মাথার বেণী খুলে মাথা আঁচড়িয়ে নাও। অতঃপর হাজ্জের ইহরাম বাঁধ। যখন মুহাসসাবের রাত হল, তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার সঙ্গে (আমার ভাই) ‘আবদুর রাহমানকে তান‘ঈমে পাঠালেন এবং আমি ছেড়ে দেয়া ‘উমরাহ’র স্থলে নতুনভাবে ‘উমরাহ’র ইহরাম বাঁধলাম। (২৯৪) (আধুনিক প্রকাশনীঃ ১৬৫৬. ইসলামিক ফাউন্ডেশনঃ ১৬৬৫)",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1784,
			"arabicnumber": 1784,
			"text": "‘আবদুর রাহমান ইবনু আবূ বাকর (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে তাঁর সওয়ারীর পিঠে ‘আয়িশাহ্ (রাযি.)-এর বসিয়ে তান‘ঈম হতে ‘উমরাহ করানোর নির্দেশ দেন। রাবী সুফয়ান (রহ.) একদা বলেন, এ হাদীস আমি ‘আমরের কাছে বহুবার শুনেছি। (২৯৮৫, মুসলিম ১৫/১৭, হাঃ ১২১২) (আধুনিক প্রকাশনীঃ ১৬৫৭. ইসলামিক ফাউন্ডেশনঃ ১৬৬৬)",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1785,
			"arabicnumber": 1785,
			"text": "জাবির ইবনু ‘আবদুল্লাহ (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও তাঁর সাহাবীগণ হাজ্জের ইহরাম বেঁধেছিলেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও তালহা (রাঃ) ব্যতীত কারো সাথে কুরবানীর পশু ছিল না। আর ‘আলী (রাঃ) ইয়ামান হতে এলেন এবং তাঁর সঙ্গে কুরবানীর পশু ছিল। তিনি বলেছিলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যে বিষয়ে ইহরাম বেঁধেছেন, আমিও তার ইহরাম বাঁধলাম। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এ ইহরামকে ‘উমরায় পরিণত করতে এবং তাওয়াফ করে এরপরে মাথার চুল ছোট করে হালাল হয়ে যেতে নির্দেশ দিলেন। তবে যাদের সঙ্গে কুরবানীর জানোয়ার রয়েছে (তারা হালাল হবে না)। তাঁরা বললেন, আমরা মিনার দিকে রওয়ানা হবো এমতাবস্থায় আমাদের কেউ স্ত্রীর সাথে সহবাস করে এসেছে। এ সংবাদ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট পৌঁছলে তিনি বললেনঃ যদি আমি এ ব্যাপার পূর্বে জানতাম, যা পরে জানতে পারলাম, তাহলে কুরবানীর জানোয়ার সঙ্গে আনতাম না। আর যদি কুরবানীর পশু আমার সাথে না থাকত অবশ্যই আমি হালাল হয়ে যেতাম। আর ‘আয়িশাহ্ (রাযি.)-এর ঋতু দেখা দিল। তিনি বায়তুল্লাহর তাওয়াফ ব্যতীত হাজ্জের সব কাজই সম্পন্ন করে নিলেন। রাবী বলেন, এরপর যখন তিনি পাক হলেন এবং তাওয়াফ করলেন, তখন বললেন, হে আল্লাহর রাসূল! আপনারা তো হাজ্জ এবং ‘উমরাহ উভয়টি পালন করে ফিরছেন, আমি কি শুধু হাজ্জ করেই ফিরব? তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ‘আবদুর রাহমান ইবনু আবূ বাকর (রাঃ)-কে নির্দেশ দিলেন তাকে সঙ্গে নিয়ে তান‘ঈমে যেতে। অতঃপর যুলহাজ্জ মাসেই হাজ্জ আদায়ের পর ‘আয়িশাহ্ (রাযি.) ‘উমরাহ আদায় করলেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন জামরাতুল ‘আকাবায় কঙ্কর মারছিলেন তখন সুরাকা ইবনু মালিক ইবনু জু‘শুম (রাঃ)-এর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সঙ্গে সাক্ষাৎ হয়। তিনি বললেন, হে আল্লাহর রাসূল! এ হাজ্জের মাসে ‘উমরাহ আদায় করা কি আপনাদের জন্য খাস? আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ না, এতো চিরদিনের (সকলের) জন্য। (১৫৫৭, মুসলিম ১৫/১৭, হাঃ ১২১৬, আহমাদ ১৪২৮২) (আধুনিক প্রকাশনীঃ ১৬৫৮. ইসলামিক ফাউন্ডেশনঃ ১৬৬৭)",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1786,
			"arabicnumber": 1786,
			"text": "‘আয়িশাহ্ (রাযি.) হতে বর্ণিত। তিনি বলেন, যখন যুলহাজ্জ মাস আগত প্রায়, তখন আমরা আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সঙ্গে রওয়ানা দিলাম। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ যে ব্যক্তি ‘উমরাহ’র ইহরাম বাঁধতে চায়, সে যেন ‘উমরাহ’র ইহরাম বেঁধে নেয়। আর যে ব্যক্তি হাজ্জের ইহরাম বাঁধতে চায় সে যেন হাজ্জের ইহরাম বেঁধে নেয়। আমি যদি কুরবানীর জানোয়ার সঙ্গে না আনতাম তাহলে অবশ্যই আমি ‘উমরাহ’র ইহরাম বাঁধতাম। তাই তাঁদের কেউ ‘উমরাহ’র ইহরাম বাঁধলেন আর কেউ হাজ্জের ইহরাম বাঁধলেন। যারা ‘উমরাহ’র ইহরাম বেঁধেছিলেন, আমি তাদের মধ্যে একজন। এরপর মক্কা পৌঁছার আগেই আমার ঋতু দেখা দিল। ‘আরাফার দিবস চলে এল, আর আমি ঋতুমতী অবস্থায় ছিলাম। অতঃপর আমার এ অসুবিধার কথা আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট বললাম। তিনি বললেনঃ ‘উমরাহ ছেড়ে দাও। আর বেণী খুলে মাথা আঁচড়িয়ে নাও। অতঃপর হাজ্জের ইহরাম বেঁধে নাও। আমি তাই করলাম। মুহাস্সাবের রাতে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার সাথে আবদুর রহমানকে তান‘ঈম পাঠালেন। (রাবী বলেন) আবদুর রহমান (রাঃ) তাঁকে সাওয়ারীতে নিজের পিছনে বসিয়ে নিলেন। অতঃপর ‘আয়িশাহ্ (রাযি.) আগের ‘উমরাহ’র স্থলে নতুন ‘উমরাহ’র ইহরাম বাঁধলেন। এমনিভাবেই আল্লাহ তা‘আলা তাঁর হাজ্জ এবং ‘উমরাহ উভয়টিই পুরা করালেন। বর্ণনাকারী বলেন, এর কোন ক্ষেত্রেই (দম হিসেবে) কুরবানী বা সদাকাহ দিতে কিংবা সিয়াম পালন করতে হয়নি। (২৯৪) (আধুনিক প্রকাশনীঃ ১৬৫৯. ইসলামিক ফাউন্ডেশনঃ ১৬৬৮)",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1787,
			"arabicnumber": 1787,
			"text": "আসওয়াদ (রহ.) হতে বর্ণিত যে, ‘আয়িশাহ্ (রাযি.) বললেন, হে আল্লাহর রসুল! সাহাবীগণ ফিরছেন দু’টি নুসূক (অর্থাৎ হাজ্জ এবং ‘উমরাহ) পালন করে আর আমি ফিরছি একটি নুসূক (শুধু হাজ্জ) আদায় করে। তাঁকে বলা হল, অপেক্ষা কর। পরে যখন তুমি পবিত্র হবে তখন তান‘ঈমে গিয়ে ইহরাম বাঁধবে এরপর অমুক স্থানে আমাদের কাছে আসবে। এ ‘উমরাহ (এর সওয়াব) হবে তোমার খরচ বা কষ্ট অনুপাতে। (২৯৪) (আধুনিক প্রকাশনীঃ ১৬৬০. ইসলামিক ফাউন্ডেশনঃ ১৬৬৯)",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1788,
			"arabicnumber": 1788,
			"text": "‘আয়িশাহ্ (রাযি.) হতে বর্ণিত। তিনি বলেন, আমরা আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সঙ্গে হাজ্জের ইহরাম বেঁধে বের হলাম, হাজ্জের মাসে এবং হাজ্জের কার্যাদি পালনের উদ্দেশ্যে। যখন সারিফ নামক স্থানে অবতরণ করলাম, তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর সাহাবাগণকে বললেনঃ যার সাথে কুরবানীর জানোয়ার নেই এবং সে এই ইহরামকে ‘উমরায় পরিণত করতে চায়, সে যেন তা করে নেয় (অর্থাৎ ‘উমরাহ করে হালাল হয়)। আর যার সাথে কুরবানীর জানোয়ার আছে সে এরূপ করবে না। (অর্থাৎ হালাল হতে পারবে না)। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও তাঁর কয়েকজন সমর্থ সাহাবীর নিকট কুরবানীর জানোয়ার ছিল তাঁদের হাজ্জ ‘উমরাহ পরিণত হল না। [‘আয়িশাহ (রাযি.) বললেন] আমি কাঁদছিলাম, এমতাবস্থায় নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার নিকট এসে বললেনঃ তোমাকে কিসে কাঁদাচ্ছে? আমি বললাম, আপনি আপনার সাহাবীগণকে যা বলেছেন, আমি তা শুনেছি। আমি তো ‘উমরাহ হতে বাধাপ্রাপ্ত হয়ে গেছি। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমার কী অবস্থা? আমি বললাম, আমি তো সালাত আদায় করছি না (ঋতুমতী অবস্থায়)। তিনি বললেনঃ এতে তোমার ক্ষতি হবে না। তুমি তো আদম কন্যাদেরই একজন। তাদের অদৃষ্টে যা লেখা ছিল তোমার জন্যও তা লিখিত হয়েছে। সুতরাং তুমি তোমার হাজ্জ আদায় কর। সম্ভবতঃ আল্লাহ তা‘আলা তোমাকে ‘উমরাহও দান করবেন। ‘আয়িশাহ্ (রাযি.) বলেন, আমি এ অবস্থায়ই থেকে গেলাম এবং পরে মিনা হতে প্রত্যাবর্তন করে মুহাস্সাবে অবতরণ করলাম। অতঃপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ‘আবদুর রহমান [‘আয়িশাহ (রাযি.)-এর সহোদর ভাই] (রাঃ)-কে ডেকে বললেনঃ তুমি তোমার বোনকে হারামের বাইরে নিয়ে যাও। সেখান হতে যেন সে ‘উমরাহ’র ইহরাম বাঁধে। অতঃপর তোমরা তাওয়াফ করে নিবে। আমি তোমাদের জন্য এখানে অপেক্ষা করব। আমরা মধ্যরাতে এলাম। তিনি বললেনঃ তোমরা কি তাওয়াফ সমাধা করেছ? আমি বললাম, হাঁ। এ সময় তিনি সাহাবীগণকে রওয়ানা হওয়ার ঘোষণা দিলেন। তাই লোকজন এবং যাঁরা ফজরের পূর্বে তাওয়াফ করেছিলেন তাঁরা রওয়ানা হলেন। অতঃপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মদিনা অভিমুখে রওয়ানা হলেন। (২৯৪, মুসলিম ১৫/১৭, হাঃ ১২১১)(আধুনিক প্রকাশনীঃ ১৬৬১. ইসলামিক ফাউন্ডেশনঃ ১৬৭০)",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1789,
			"arabicnumber": 1789,
			"text": "ই‘য়ালা ইবনু উমায়্যা (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জি‘রানাতে ছিলেন। এ সময় জুববা পরিহিত এক ব্যক্তি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট এসে বললেন, আপনি ‘উমরাহতে আমাকে কী কাজ করার নির্দেশ দেন? লোকটির জুববাতে খালূক বা হল্দে রঙের দাগ ছিল। এ সময় আল্লাহ তা‘আলা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর উপর ওয়াহী নাযিল করলেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে কাপড় দিয়ে আচ্ছাদিত করে দেয়া হল। বর্ণনাকারী বলেন, আমি ‘উমার (রাঃ)-কে বললাম, আল্লাহ তাঁর নবীর প্রতি ওয়াহী নাযিল করছেন, এমতাবস্থায় আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে দেখতে চাই। ‘উমার (রাঃ) বললেন, এসো, আল্লাহ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর প্রতি ওয়াহী নাযিল করছেন, এমতাবস্থায় তুমি কি তাঁকে দেখতে আগ্রহী? আমি বললাম, হাঁ। অতঃপর ‘উমার (রাঃ) কাপড়ের একটি কোণ উঁচু করে ধরলেন। আমি তাঁর দিকে নজর করলাম। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আওয়াজ করছেন। বর্ণনাকারী বলেন, আমার মনে হয়, তিনি বলছিলেন, উটের আওয়াজের মত আওয়াজ। এ অবস্থা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে দূরীভূত হলে তিনি বললেনঃ ‘উমরাহ সম্পর্কে প্রশ্নকারী কোথায়? তিনি বললেনঃ তুমি তোমার হতে জুববাটি খুলে ফেল, খালূকের চিহ্ন ধুয়ে ফেল এবং হলদে রং পরিষ্কার করে নাও। আর তোমার হাজ্জে যা করেছ ‘উমরাহতে তুমি তা-ই করবে। (১৫৩৬) (আধুনিক প্রকাশনীঃ ১৬৬২. ইসলামিক ফাউন্ডেশনঃ ১৬৭১)",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1790,
			"arabicnumber": 1790,
			"text": "‘উরওয়াহ (রহ.) হতে বর্ণিত। তিনি বলেন, আমি বাল্যকালে একদা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সহধর্মিণী ‘আয়িশাহ্ (রাযি.)-এর বললাম, আল্লাহর বাণীঃ ‘‘সাফা ও মারওয়াহ আল্লাহর নিদর্শনসমূহের অন্যতম। সুতরাং যে কা‘বা গৃহের হাজ্জ কিংবা ‘উমরাহ সম্পন্ন করে এ দু’টির মধ্যে সা‘য়ী করতে চায়, তার কোন গুনাহ্ নেই’’- (আল-বাকারাঃ ১৫৮)। তাই সাফা-মারওয়াহর সা‘য়ী না করা আমি কারো পক্ষে অপরাধ মনে করি না। ‘আয়িশাহ্ (রাযি.) বলেন, বিষয়টি এমন নয়। কেননা, তুমি যেমন বলছ, ব্যাপারটি তেমন হলে আয়াতটি অবশ্যই এমন হতঃ ‘‘সাফা ও মারওয়াহ্ আল্লাহর নিদর্শনসমূহের অন্যতম। সুতরাং যে কা‘বা গৃহের হাজ্জ কিংবা ‘উমরাহ সম্পন্ন করে এ দু’টির মধ্যে সা‘য়ী করে, তার কোন পাপ নেই’’- (আল-বাকারাঃ ১৫৮)। অর্থাৎ এ দু’টির মাঝে তাওয়াফ করলে কোন পাপ নেই। এ আয়াত তো আনসারদের সম্পর্কে নাযিল হয়েছে। কেননা তারা মানাতের জন্য ইহরাম বাঁধত। আর মানাত কুদায়দের সামনে ছিল। তাই আনসাররা সাফা-মারওয়া তাওয়াফ করতে দ্বিধাবোধ করত। এরপর ইসলামের আবির্ভাবের পর তারা আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে এ বিষয়ে জিজ্ঞেস করলে আল্লাহ তা‘আলা নাযিল করলেনঃ ‘সাফা ও মারওয়া আল্লাহর নিদর্শনসমূহের অন্যতম। সুতরাং যে কা‘বা গৃহের হাজ্জ কিংবা ‘উমরাহ করতে চায় তার জন্য এ দু’টির মধ্যে সা‘য়ী করায় কোন গুনাহ্ নেই।’ সুফয়ান ও আবূ মু‘আবিয়াহ (রাঃ) হিশাম (রহ.) হতে অতিরিক্ত বর্ণনা করেছেন যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ সাফা-মারওয়াহর মাঝে তাওয়াফ না করলে আল্লাহ কারো হাজ্জ এবং ‘উমরাকে পূর্ণ করেন না। (১৬৯৩) (আধুনিক প্রকাশনীঃ ১৬৬৩. ইসলামিক ফাউন্ডেশনঃ ১৬৭২)",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1792,
			"arabicnumber": 1792,
			"text": "প্রশ্নকারী তাঁকে বললেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খাদীজা (রাযি.) সম্বন্ধে কী বলেছেন? তিনি বললেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ খাদীজাকে বেহেশতের মাঝে মতি দিয়ে তৈরি এমন একটি ঘরের সুসংবাদ দাও যেখানে কোন শোরগোল থাকবে না এবং কোন প্রকার কষ্ট ক্লেশও থাকবে না। (৩৮১৯) (আধুনিক প্রকাশনীঃ ১৬৬৪. ইসলামিক ফাউন্ডেশনঃ ১৬৭৩)",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1794,
			"arabicnumber": 1794,
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1795,
			"arabicnumber": 1795,
			"text": "আবূ মূসা আল-আশ‘আরী (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মক্কার বাতহায় অবতরণ করলে আমি তাঁর নিকট গেলাম। তিনি বললেনঃ তুমি কি হাজ্জ করেছ? আমি বললাম, হাঁ। তিনি বললেনঃ তুমি কিসের ইহরাম বেঁধেছিলে? আমি বললাম, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর ইহরামের মত আমিও ইহরামের তালবিয়া পাঠ করেছি। তিনি বললেনঃ ভাল করেছ। এখন বাইতুল্লাহ এবং সাফা-মারওয়ার সা‘য়ী করে হালাল হয়ে যাও। অতঃপর আমি বাইতুল্লাহ এবং সাফা-মারওয়ার সা‘য়ী করে কায়স গোত্রের এক মহিলার কাছে গেলাম। সে আমার মাথার উকুন বেছে দিল। এরপর আমি হাজ্জের ইহরাম বাঁধলাম এবং ‘উমার (রাঃ)-এর খিলাফত পর্যন্ত আমি এভাবেই ফাতাওয়া দিতে থাকি। ‘উমার (রাঃ) বললেন, যদি আমরা আল্লাহর কিতাব গ্রহণ করি সেটা তো আমাদের পূর্ণ করার নির্দেশ দেয়। আর যদি আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর বাণী গ্রহণ করি তাহলে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কুরবানীর পশু তার স্থানে পৌঁছার (যবহ করার) পূর্ব পর্যন্ত হালাল হননি। (১৫৫৯) (আধুনিক প্রকাশনীঃ ১৬৬৬. ইসলামিক ফাউন্ডেশনঃ ১৬৭৫)",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1796,
			"arabicnumber": 1796,
			"text": "আবুল আসওয়াদ (রহ.) হতে বর্ণিত। তিনি বলেন, আবূ বাকর (রাঃ)-এর কন্যা আসমা (রাযি.)-এর আযাদকৃত গোলাম ‘আবদুল্লাহ (রাঃ) তাঁর নিকট বর্ণনা করেছেন, যখনই আসমা (রাযি.) হাজ্জূন এলাকা দিয়ে গমন করতেন তখনই তাঁকে বলতে শুনেছেন صَلَّى اللهُ عَلَى رَسُولِهِ আল্লাহ তাঁর রাসূলের প্রতি রহমত নাযিল করুন, এ স্থানে আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সঙ্গে অবতরণ করেছিলাম। তখন আমাদের বোঝা ছিল খুব অল্প, যানবাহন ছিল একেবারে নগণ্য এবং সম্বল ছিল খুবই কম। আমি, আমার বোন ‘আয়িশাহ (রাযি.), যুবাইর (রাঃ) এবং অমুক অমুক ‘উমরাহ আদায় করলাম। তারপর বায়তুল্লাহর তাওয়াফ করে আমরা সকলেই হালাল হয়ে গেলাম এবং সন্ধ্যাকালে হাজ্জের ইহরাম বাঁধলাম। (১৬১৫, মুসলিম ১৫/২৯, হাঃ ১২৩৭) (আধুনিক প্রকাশনীঃ ১৬৬৭. ইসলামিক ফাউন্ডেশনঃ ১৬৭৬)",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1797,
			"arabicnumber": 1797,
			"text": "‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) হতে বর্ণিত যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখনই কোন যুদ্ধ, বা হাজ্জ অথবা ‘উমরাহ হতে প্রত্যাবর্তন করতেন তখন তিনি প্রত্যেক উঁচু ভূমিতে তিনবার ‘আল্লাহু আকবার’ বলতেন এবং পরে বলতেন : অর্থাৎ ‘‘আল্লাহ ব্যতীত প্রকৃত কোন ইলাহ নেই, তিনি এক, তাঁর কোন শরীক নেই। সর্বময় ক্ষমতা এবং সকল প্রশংসা কেবল তাঁরই। তিনি সর্ববিষয়ে সর্বশক্তিমান। আমরা প্রত্যাবর্তনকারী ও তওবা্কারী, ‘ইবাদতকারী, আমাদের প্রভুর উদ্দেশে সিজদা্কারী ও প্রশংসাকারী। আল্লাহ তাঁর ওয়াদা পূর্ণ করেছেন, স্বীয় বান্দাকে সাহায্য করেছেন এবং তিনি একাই সকল শত্রুদলকে পরাজিত করেছেন।’’ (২৯৯৫, ৩০৮৪, ৪১১৬, ৬৩৮৫) (আধুনিক প্রকাশনীঃ ১৬৬৮. ইসলামিক ফাউন্ডেশনঃ ১৬৭৭)",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1798,
			"arabicnumber": 1798,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মক্কায় এলে ‘আবদুল মুত্তালিব গোত্রীয় কয়েকজন তরুণ তাঁকে স্বাগত জানায়। তিনি একজনকে তাঁর সাওয়ারীর সামনে ও অন্যজনকে পেছনে তুলে নেন। (৫৯৬৮, ৫৯৬৬) (আধুনিক প্রকাশনীঃ ১৬৬৯. ইসলামিক ফাউন্ডেশনঃ ১৬৭৮)",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1799,
			"arabicnumber": 1799,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত যে,আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মক্কার উদ্দেশে বের হয়ে ‘মসজিদে শাজারাতে’ সালাত আদায় করতেন। আর যখন ফিরতেন, যুল-হুলাইফার বাতনুল-ওয়াদীতে সালাত আদায় করতেন এবং এখানে সকাল পর্যন্ত রাত যাপন করতেন। (৪৮৪) (আধুনিক প্রকাশনীঃ ১৬৭০. ইসলামিক ফাউন্ডেশনঃ ১৬৭৯)",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1800,
			"arabicnumber": 1800,
			"text": "আনাস (রাঃ) হতে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রাত্রে কখনো পরিবারের নিকট প্রবেশ করতেন না। তিনি প্রভাতে কিংবা বৈকালে ছাড়া পরিবারের নিকট প্রবেশ করতেন না। (মুসলিম ৩৩/৫৬, হাঃ ১৯২৮, আহমাদ ১৩১১৭) (আধুনিক প্রকাশনীঃ ১৬৭১. ইসলামিক ফাউন্ডেশনঃ ১৬৮০)",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1801,
			"arabicnumber": 1801,
			"text": "জাবির ইবনু ‘আবদুল্লাহ (রাঃ) হতে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রাতের বেলা পরিবারের কাছে প্রবেশ করতে নিষেধ করেছেন। (৪৪৩) (আধুনিক প্রকাশনীঃ ১৬৭২. ইসলামিক ফাউন্ডেশনঃ ১৬৮১)",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1802,
			"arabicnumber": 1802,
			"text": "হুমাইদ (রহ.) হতে বর্ণিত। তিনি আনাস (রাঃ)-কে বলতে শুনেছেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সফর হতে ফিরে যখন মদিনার উঁচু রাস্তাগুলো দেখতেন তখন তিনি তাঁর উটনী দ্রুতগতিতে চালাতেন আর বাহন অন্য জানোয়ার হলে তিনি তাকে তাড়া দিতেন। অপর একটি বর্ণনায় হুমাইদ আনাস (রাঃ) হতে বর্ণনা করেন, তিনি বলেন,دَرَجَاتِ (উঁচু রাস্তা)-এর পরিবর্তে جُدُرَاتِ (দেয়ালগুলো) শব্দ বলেছেন। হারিস ইবনু ‘উমাইর (রহ.) ইসমা‘ঈল (রহ.)-এর অনুরূপ বর্ণনা করেন। (১৮৮৬) (আধুনিক প্রকাশনীঃ ১৬৭৩. ইসলামিক ফাউন্ডেশনঃ ১৬৮২)",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1803,
			"arabicnumber": 1803,
			"text": "আবূ ইসহাক (রহ.) হতে বর্ণিত, তিনি বলেন, আমি বারা (রাঃ)-কে বলতে শুনেছি, এ আয়াতটি আমাদের সম্পর্কে নাযিল হয়েছিল। হাজ্জ করে এসে আনসারগণ তাদের বাড়িতে সদর দরজা দিয়ে প্রবেশ না করে পেছনের দরজা দিয়ে প্রবেশ করতেন। এক আনসার ফিরে এসে তার বাড়ির সদর দরজা দিয়ে প্রবেশ করলে তাকে এ জন্য লজ্জা দেয়া হয়। তখনই নাযিল হয়ঃ ‘‘পশ্চাৎ দিক দিয়ে তোমাদের গৃহ-প্রবেশ করাতে কোন কল্যাণ নেই। বরং কল্যাণ আছে যে তাকওয়া অবলম্বন করে। সুতরাং তোমরা (সামনের) দরজা দিয়ে গৃহে প্রবেশ কর’’- (আল-বাকারাঃ ১৮৯)। (৪৫১২, মুসলিম ৫৪/৫৪, হাঃ ৩০২৬) (আধুনিক প্রকাশনীঃ ১৬৭৪. ইসলামিক ফাউন্ডেশনঃ ১৬৮৪)",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1804,
			"arabicnumber": 1804,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেন, সফর ‘আযাবের অংশ বিশেষ। তা তোমাদের যথাসময় পানাহার ও নিদ্রায় ব্যঘাত ঘটায়। কাজেই সকলেই যেন নিজের প্রয়োজন মিটিয়ে অবিলম্বে আপন পরিজনের কাছে ফিরে যায়। (৩০০১, ৫৪২৯, মুসলিম ৩৩/৫৫, হাঃ ১৯২৭, আহমাদ ৭২২৯) (আধুনিক প্রকাশনীঃ ১৬৭৫. ইসলামিক ফাউন্ডেশনঃ ১৬৮৫)",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1805,
			"arabicnumber": 1805,
			"text": "আসলাম (রহ.) হতে বর্ণিত, তিনি বলেন, মক্কার রাস্তায় আমি ‘আবদুল্লাহ ইবনু ‘উমার (রাঃ)-এর সাথে ছিলাম। সাফিয়্যা বিনতু আবূ ‘উবায়দ (রাঃ)-এর মারাত্নক অসুস্থ হওয়ার খবর তাঁর নিকট পৌঁছল। তখন তিনি গতি বৃদ্ধি করলেন। (পশ্চিম আকাশের) লালিমা চলে যাবার পর সাওয়ারী হতে অবতরণ করে মাগরিব ও ‘ইশা একত্রে আদায় করেন। অতঃপর বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে দেখেছি, সফরে তাড়াতাড়ি চলার দরকার হলে তিনি মাগরিবকে দেরি করে মাগরিব ও ‘ইশা একত্রে আদায় করতেন। (১০৯১) (আধুনিক প্রকাশনীঃ ১৬৭৬. ইসলামিক ফাউন্ডেশনঃ ১৬৮৬)",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 30
			}
		}
	]
}