{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"29": "Virtues of Madinah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1867,
			"arabicnumber": 1867,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মদিনা এখান হতে ওখান পর্যন্ত হারাম (রূপে গণ্য)। সুতরাং তার গাছ কাটা যাবে না এবং এখানে কোন ধরনের অঘটন (বিদ‘আত, অত্যাচার ইত্যাদি) ঘটানো যাবে না। যদি কেউ এখানে কোন অঘটন ঘটায় তাহলে তার প্রতি আল্লাহ্‌র এবং ফেরেশতাদের ও সকল মানুষের লা’নত (অভিশাপ)। (৭৩০৬, মুসলিম ১৫/৮৫, হাঃ ১৩৬৬) (আধুনিক প্রকাশনীঃ ১৭৩২, ইসলামিক ফাউন্ডেশনঃ ১৭৪৩)",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1868,
			"arabicnumber": 1868,
			"text": "আনাস (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মাদ্বীনায় এসে মাসজিদ নির্মাণের আদেশ দেন। অতঃপর বলেনঃ হে বনূ নাজ্জার! আমার নিকট হতে মূল্য নিয়ে (ভূমি) বিক্রি কর। তাঁরা বললেন, আমরা এর মূল্য কেবল আল্লাহর নিকটই চাই। এরপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নির্দেশে মুশরিকদের কবর খুঁড়ে ফেলা হল, ধ্বংসাবশেষ সমতল করা হল, খেজুর গাছগুলো কেটে ফেলা হল। কেবল মসজিদের কিবলার দিকে কিছু খেজুর গাছ সারিবদ্ধভাবে রাখা হল। (২৩৪০) (আধুনিক প্রকাশনীঃ ১৭৩৩, ইসলামিক ফাউন্ডেশনঃ ১৭৪৪)",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1869,
			"arabicnumber": 1869,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মাদ্বীনার দু’ পাথুরে ভূমির মধ্যবর্তী স্থান আমার ঘোষণা মোতাবেক হারাম হিসাবে নির্ধারিত করা হয়েছে। বর্ণনাকারী বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বনূ হারিসের নিকট তাশরীফ আনেন এবং বলেনঃ হে বনূ হারিসা! আমার ধারণা ছিল যে, তোমরা হারামের বাইরে অবস্থান করছ, অতঃপর তিনি সেদিকে দৃষ্টিপাত করে বললেনঃ (না তোমরা হারামের বাইরে নও) বরং তোমরা হারামের ভিতরেই আছ। (১৮৭৩) (আধুনিক প্রকাশনীঃ ১৭৩৪, ইসলামিক ফাউন্ডেশনঃ ১৭৪৫)",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1870,
			"arabicnumber": 1870,
			"text": "‘আলী (রাঃ) হতে বর্ণিত। তিনি বলেন, আমাদের কাছে আল্লাহ্‌র কিতাব এবং নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত, এ সহীফা ছাড়া আর কিছুই নেই। তিনি আরো বলেন, ‘আয়ির নামক জায়গা হতে অমুক জায়গা পর্যন্ত মদিনা হল হারাম। যদি কেউ এতে অঘটন ঘটায় অথবা আশ্রয় দেয়, তাহলে তার উপর আল্লাহর, ফেরেশ্তা ও মানুষের অভিসম্পাত। সে ব্যক্তির কোন ফরয এবং নফল ‘ইবাদত গৃহীত হবে না। তিনি আরো বলেন, মুসলিম কর্তৃক নিরাপত্তা দানের অধিকার সকলের ক্ষেত্রে সমান। তাই যে ব্যক্তি কোন মুসলিমের দেয়া নিরাপত্তাকে লঙ্ঘন করবে, তার প্রতি আল্লাহ্‌র অভিসম্পাত এবং সকল ফেরেশতা ও মানুষের। আর কবূল করা হবে না তার কোন নফল কিংবা ফরয ‘ইবাদাত। যে ব্যক্তি তার মাওলার (চুক্তিবদ্ধ মিত্রের) অনুমতি ছাড়া অন্য সম্প্রদায়ের সাথে বন্ধুত্ব করবে, তার প্রতিও আল্লাহ্‌র এবং সব ফেরেশতা ও সকল মানুষের অভিসম্পাত। তার ফরয কিংবা নফল কোন ‘ইবাদাতই কবূল করা হবে না। আবূ ‘আবদুল্লাহ (রহ.) বলেন, ‘আদলুন’ অর্থ বিনিময়। (১১১) (আধুনিক প্রকাশনীঃ ১৭৩৫, ইসলামিক ফাউন্ডেশনঃ ১৭৪৬)",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1871,
			"arabicnumber": 1871,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আমি এমন এক জনপদে হিজরত করার জন্য আদিষ্ট হয়েছি, যে জনপদ অন্য সকল জনপদের উপর জয়ী হবে। লোকেরা তাকে ইয়াসরিব বলে থাকে। এ হল মদিনা। তা অবাঞ্ছিত লোকদেরকে এমনভাবে বহিষ্কার করে দেয়, যেমনভাবে কামারের অগ্নিচুলা লোহার মরিচা দূর করে দেয়। (মুসলিম ১৫/৮৮, হাঃ ১৩৮২, আহমাদ ৮৯৯৪) (আধুনিক প্রকাশনীঃ ১৭৩৬, ইসলামিক ফাউন্ডেশনঃ ১৭৪৭)",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1872,
			"arabicnumber": 1872,
			"text": "আবূ হুমাইদ (রাঃ) হতে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে আমরা তাবূক যুদ্ধ হতে প্রত্যাবর্তন করে মাদ্বীনার নিকটবর্তী স্থানে পৌঁছলে, তিনি বললেনঃ (মদিনা্) হল ত্বাবাহ। (১৪৮১) (আধুনিক প্রকাশনীঃ ১৭৩৭, ইসলামিক ফাউন্ডেশনঃ ১৭৪৮)",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1873,
			"arabicnumber": 1873,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলতেন, আমি যদি মাদ্বীনাতে কোন হরিণকে বেড়াতে দেখি তাহলে তাকে আমি তাড়াব না। (কেননা) আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মাদ্বীনার প্রস্তরময় পাহাড়ের দুই এলাকার মধ্যবর্তী এলাকা হল হারাম বা সম্মানিত স্থান। (১৮৬৯, মুসলিম ১৫/৮৫, হাঃ ১৩৭২, আহমাদ ৭২২২) (আধুনিক প্রকাশনীঃ ১৭৩৮, ইসলামিক ফাউন্ডেশনঃ ১৭৪৯)",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1874,
			"arabicnumber": 1874,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে বলতে শুনেছি, তোমরা উত্তম অবস্থায় মদিনাকে রেখে যাবে। আর জীবিকা অন্বেষণে বিচরণকারী অর্থাৎ পশু-পাখি ছাড়া আর কেউ একে আচ্ছন্ন করে নিতে পারবে না। সবশেষে যাদের মদিনা্তে একত্রিত করা হবে তারা হল মুযায়না গোত্রের দু’জন রাখাল। তারা তাদের বকরীগুলোকে হাঁক-ডাক দিয়ে নিয়ে যাওয়ার উদ্দেশেই মদিনাতে আসবে। এসে দেখবে মদিনা বন্য পশুতে ছেয়ে আছে। এরপর তারা সানিয়্যাতুল-বিদা নামক স্থানে পৌঁছতেই মুখ থুবড়ে পড়ে যাবে। (মুসলিম ১৫/৯১, হাঃ ১৩৮৯) (আধুনিক প্রকাশনীঃ ১৭৩৯, ইসলামিক ফাউন্ডেশনঃ ১৭৫০)",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1875,
			"arabicnumber": 1875,
			"text": "সুফইয়ান ইবনু আবূ যুহায়র (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছিঃ ইয়ামান বিজিত হবে, তখন একদল লোক নিজেদের সওয়ারী তাড়িয়ে এসে স্বীয় পরিবার-পরিজন এবং অনুগত লোকদেরকে উঠিয়ে নিয়ে যাবে। অথচ মদিনা তাদের জন্য উত্তম ছিল, যদি তারা বুঝত। সিরিয়া বিজিত হবে, তখন একদল লোক নিজেদের সওয়ারী তাড়িয়ে এসে স্বীয় পরিবার-পরিজন এবং অনুগত লোকদেরকে উঠিয়ে নিয়ে যাবে; অথচ মাদ্বীনাই ছিল তাদের জন্য মঙ্গলজনক, যদি তারা জানত। এরপর ইরাক বিজিত হবে তখন একদল লোক নিজেদের সওয়ারী তাড়িয়ে এসে স্বজন এবং অনুগতদেরকে উঠিয়ে নিয়ে যাবে; অথচ মাদ্বীনাই তাদের জন্য ছিল মঙ্গলজনক, যদি তারা জানত। (মুসলিম ১৫/৯০, হাঃ ১৩৮৮, আহমাদ ২১৯৭৬) (আধুনিক প্রকাশনীঃ ১৭৪০, ইসলামিক ফাউন্ডেশনঃ ১৭৫১)",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1876,
			"arabicnumber": 1876,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ঈমান মদিনাতে ফিরে আসবে যেমন সাপ তার গর্তে ফিরে আসে। (মুসলিম ১/৬৫, হাঃ ১৪৭, আহমাদ ৯৪৬২) (আধুনিক প্রকাশনীঃ ১৭৪১, ইসলামিক ফাউন্ডেশনঃ ১৭৫২)",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1877,
			"arabicnumber": 1877,
			"text": "সা‘দ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে বলতে শুনেছিঃ যে কেউ মাদ্বীনাবাসীর সাথে ষড়যন্ত্র বা প্রতারণা করবে, সে লবণ যেভাবে পানিতে গলে যায়, সেভাবে গলে যাবে। (মুসলিম ১৫/৮৯, হাঃ ১৩৮৭, আহমাদ ১৫৫৮) (আধুনিক প্রকাশনীঃ ১৭৪২, ইসলামিক ফাউন্ডেশনঃ ১৭৫৩)",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1878,
			"arabicnumber": 1878,
			"text": "উসামা (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মদিনার কোন একটি পাথর নির্মিত গৃহের উপর আরোহণ করে বললেনঃ আমি যা দেখি তোমরা কি তা দেখতে পাচ্ছ? (তিনি বললেন) বৃষ্টি বিন্দু পতিত হওয়ার স্থানসমূহের মত আমি তোমাদের গৃহসমূহের মাঝে ফিতনার স্থানসমূহ দেখতে পাচ্ছি। মা’মার এবং সুলাইমান বিন কাসীর উক্ত হাদীস যুহরী থেকে বর্ণনার ক্ষেত্রে সুফইয়ানকে অনুসরণ করেছেন। (২৪৬৭, ৩৫৯৭, ৭০৬০, মুসলিম ৫২/৩, হাঃ ২৮৮৫, আহমাদ ২১৮০৭) (আধুনিক প্রকাশনীঃ ১৭৪৩, ইসলামিক ফাউন্ডেশনঃ ১৭৫৪)",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1879,
			"arabicnumber": 1879,
			"text": "আবূ বাকরাহ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, মদিনাতে দাজ্জালের ত্রাস ও ভীতি প্রবেশ করতে পারবে না। ঐ সময় মদিনার সাতটি প্রবেশ পথ থাকবে। প্রত্যেক পথে দু’জন করে ফেরেশতা (মোতায়েন) থাকবে। (৭১২৫, ৭১২৬) (আধুনিক প্রকাশনীঃ ১৭৪৪, ইসলামিক ফাউন্ডেশনঃ ১৭৫৫)",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1880,
			"arabicnumber": 1880,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মদিনার প্রবেশ পথসমূহে ফেরেশ্তা পাহারায় নিয়োজিত আছে। তাই প্লেগ রোগ এবং দাজ্জাল মদিনায় প্রবেশ করতে পারবে না। (৫৭৩১, ৭১৩৩, মুসলিম ১৫/৮৭, হাঃ ১৩৭৯, আহমাদ ৭২৩৮) (আধুনিক প্রকাশনীঃ ১৭৪৫, ইসলামিক ফাউন্ডেশনঃ ১৭৫৬)",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1881,
			"arabicnumber": 1881,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মক্কা ও মদিনা ব্যতীত এমন কোন শহর নেই যেখানে দাজ্জাল পদচারণ করবে না। মক্কা এবং মদিনার প্রত্যেকটি প্রবেশ পথেই ফেরেশতাগণ সারিবদ্ধভাবে পাহারায় নিয়োজিত থাকবে। এরপর মদিনা তার অধিবাসীদেরকে নিয়ে তিনবার কেঁপে উঠবে এবং আল্লাহ তা‘আলা সমস্ত কাফির এবং মুনাফিকদেরকে বের করে দিবেন। (৭১২৪, ৭১৩৪, ৭৪৭৩, মুসলিম ৫২/২৪, হাঃ ২৯৪৩) (আধুনিক প্রকাশনীঃ ১৭৪৭, ইসলামিক ফাউন্ডেশনঃ ১৭৫৮)",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1882,
			"arabicnumber": 1882,
			"text": "আবু সা‘ঈদ খুদরী (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের সামনে দাজ্জাল সম্পর্কে এক দীর্ঘ হাদীস বর্ণনা করেছেন। বর্ণিত কথাসমূহের মাঝে তিনি এ কথাও বলেছিলেন যে, মদিনার প্রবেশ পথে অনুপ্রবেশ করা দাজ্জালের জন্য হারাম করে দেয়া হয়েছে। তাই সে মাদ্বীনার উদ্দেশে যাত্রা করে মদিনার নিকটবর্তী কোন একটি বালুকাময় জমিতে অবতরণ করবে। তখন তার নিকট এক ব্যক্তি যাবে যে উত্তম ব্যক্তি হবে বা উত্তম মানুষের একজন হবে এবং সে বলবে, আমি সাক্ষ্য দিচ্ছি, তুমিই হলে সে দাজ্জাল যার সম্পর্কে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদেরকে অবহিত করেছেন। দাজ্জাল বলবে, আমি যদি একে হত্যা করে পুনরায় জীবিত করতে পারি তাহলেও কি তোমরা আমার ব্যাপারে সন্দেহ করবে? তারা বলবে, না। এরপর দাজ্জাল লোকটিকে হত্যা করে পুনরায় জীবিত করবে। জীবিত হয়েই লোকটি বলবে, আল্লাহর শপথ! আজকের চেয়ে অধিক প্রত্যয় আমার আর কখনো ছিল না। অতঃপর দাজ্জাল বলবে, আমি তাকে হত্যা করে ফেলব। কিন্তু সে লোকটিকে হত্যা করতে আর সক্ষম হবে না। (৭১৩২, মুসলিম ৫২/২১, হাঃ ২৯৩৮, আহমাদ ১১৩১৮) (আধুনিক প্রকাশনীঃ ১৭৪৬, ইসলামিক ফাউন্ডেশনঃ ১৭৫৭)",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1883,
			"arabicnumber": 1883,
			"text": "জাবির (রাঃ) হতে বর্ণিত। তিনি বলেন, একজন বেদুঈন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট এসে ইসলামের উপর তাঁর কাছে বায়‘আত গ্রহণ করলো। পরদিন সে জ্বরাক্রান্ত অবস্থায় নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর কাছে এসে বললো, আমার (বায়‘আত) ফিরিয়ে নিন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তা প্রত্যাখ্যান করলেন। এভাবে তিনবার হল। অতঃপর বললেনঃ মদিনা কামারের হাপরের মত, যা তার আবর্জনা ও মরিচাকে দূরীভূত করে এবং খাঁটি ও নির্ভেজালকে পরিচ্ছন্ন করে। (৭২০৯, ৭২১১, ৭২১৬, ৭৩২২) (আধুনিক প্রকাশনীঃ ১৭৪৮, ইসলামিক ফাউন্ডেশনঃ ১৭৫৯)",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1884,
			"arabicnumber": 1884,
			"text": "যায়দ ইবনু সাবিত (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সঙ্গে উহুদ যুদ্ধে যাত্রা করে তাঁর কতিপয় সাথী ফিরে আসলে একদল লোক বলতে লাগল, আমরা তাদেরকে হত্যা করব, আর অন্য দলটি বলতে লাগলো, না, আমরা তাদেরকে হত্যা করব না। এ সময়ই (তোমাদের হল কী, তোমরা মুনাফিকদের ব্যাপারে দু’দল হয়ে গেলে?) (আন-নিসাঃ ৮৮) আয়াতটি নাযিল হয়। এরপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ মদিনা (বিশেষ কিছু) লোকদেরকে বহিষ্কার করে দেয়, যেমনভাবে আগুন লোহার মরিচাকে দূর করে দেয়। (৪০৫০, ৪৫৮৯, মুসলিম ৫০/৫০, হাঃ ২৭৭৬) (আধুনিক প্রকাশনীঃ ১৭৪৯, ইসলামিক ফাউন্ডেশনঃ ১৭৬০)",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1885,
			"arabicnumber": 1885,
			"text": "আনাস (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ হে আল্লাহ! মক্কাতে তুমি যে বরকত দান করেছ, মদিনাতে এর দ্বিগুণ বরকত দাও। ‘উসমান বিন ‘উমার উক্ত হাদীস ইউনুস থেকে বর্ণনার ক্ষেত্রে জারীরের অনুসরণ করেছেন। (মুসলিম ১৫/৮৫, হাঃ ১৩৬৯, আহমাদ ১২৪৫৫) (আধুনিক প্রকাশনীঃ ১৭৫০, ইসলামিক ফাউন্ডেশনঃ ১৭৬১)",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1886,
			"arabicnumber": 1886,
			"text": "আনাস (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সফর হতে ফিরে আসার পথে যখন মদিনার প্রাচীরগুলোর দিকে তাকাতেন, তখন তিনি মদিনার প্রতি ভালবাসার কারণে তাঁর উটকে দ্রুত চালাতেন আর তিনি অন্য কোন জন্তুর উপর থাকলে তাকেও দ্রুত চালিত করতেন। (১৮০২) (আধুনিক প্রকাশনীঃ ১৭৫১, ইসলামিক ফাউন্ডেশনঃ ১৭৬২)",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1887,
			"arabicnumber": 1887,
			"text": "আনাস (রাঃ) হতে বর্ণিত। তিনি বলেন, বনূ সালামাহ্ গোত্রের লোকেরা মসজিদে নববীর নিকটে চলে যাওয়ার সংকল্প করলেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মাদ্বীনাকে জনশূন্য করা অপছন্দ করলেন, তাই তিনি বললেনঃ হে বনূ সালামাহ্! মসজিদে নববীর দিকে তোমাদের হাঁটার সওয়াব কি তোমরা হিসাব কর না? এরপর তারা সেখানেই রয়ে গেলেন। (৬৫৫) (আধুনিক প্রকাশনীঃ ১৭৫২, ইসলামিক ফাউন্ডেশনঃ ১৭৬৩)",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1888,
			"arabicnumber": 1888,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমার ঘর ও মিম্বরের মধ্যবর্তী স্থানটি হল জান্নাতের বাগানের একটি বাগান, আর আমার মিম্বরটি হল আমার হাউয (কাউসার)-এর উপর অবস্থিত। (১১৯৬) (আধুনিক প্রকাশনীঃ ১৭৫৩, ইসলামিক ফাউন্ডেশনঃ ১৭৬৪)",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1889,
			"arabicnumber": 1889,
			"text": "‘আয়িশাহ্ (রাযি.) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মাদ্বীনায় শুভাগমন করলে আবূ বাকার ও বিলাল (রাঃ) জ্বরাক্রান্ত হয়ে পড়লেন। আবূ বাকার (রাঃ) জ্বরাক্রান্ত হয়ে পড়লে তিনি এ কবিতাংশটি আবৃত্তি করতেন : ‘‘প্রত্যেকেই স্বীয় পরিবারের মাঝে দিনাতিপাত করছে, অথচ মৃত্যু তার জুতার ফিতা অপেক্ষা সন্নিকটবর্তী।’’ আর বিলাল (রাঃ) জ্বর থেকে সেরে উঠলে উচ্চস্বরে এ কবিতাংশ আবৃত্তি করতেন? ‘‘হায়, আমি যদি কবিতা আবৃত্তির মাধ্যমে মক্কার প্রান্তরে একটি রাত কাটাতে পারতাম আর আমার চারদিকে থাকত ইযখির এবং জালীল ঘাস। মাজান্না ঝর্ণার পানি পানের সুযোগ কখনো হবে কি? আমার জন্য শামা এবং ত্বফীল পাহাড় প্রকাশিত হবে কি?’’ আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ) বলেনঃ হে আল্লাহ! তুমি শায়বা ইবনু রাবী‘আ, ‘উতবা ইবনু রাবী‘আ এবং উমায়্যাহ ইবনু খালফের প্রতি লা‘নত বর্ষণ কর; যেমনিভাবে তারা আমাদেরকে আমাদের মাতৃভূমি হতে বের করে মহামারীর দেশে ঠেলে দিয়েছে। এরপর আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দু‘আ করলেনঃ হে আল্লাহ! মদিনাকে আমাদের নিকট মক্কার মত বা তার চেয়েও বেশি প্রিয় করে দাও। হে আল্লাহ! আমাদের সা‘ ও মুদে বরকত দান কর এবং মাদ্বীনাকে আমাদের জন্য স্বাস্থ্যকর বানিয়ে দাও। এর জ্বরের প্রকোপকে বা মহামারীকে জুহফায় স্থানান্তরিত করে দাও। ‘আয়িশাহ্ (রাযি.) বলেন, আমরা যখন মদিনা এসেছিলাম তখন তা ছিল আল্লাহর যমীনে সর্বাপেক্ষা অধিক মহামারীর স্থান। তিনি আরো বলেন, সে সময় মাদ্বীনায় বুতহান নামক স্থানে একটি ঝর্ণা ছিল যেখান হতে বর্ণ ও বিকৃত স্বাদের পানি প্রবাহিত হত। (৯৩৯২৬, ৫৬৫৪, ৫৬৭৭, ৬৩৭২, মুসলিম ১৫/৮৬, হাঃ ১৩৭৬, আহমাদ ২৪৪১৪) (আধুনিক প্রকাশনীঃ ১৭৫৪, ইসলামিক ফাউন্ডেশনঃ ১৭৬৫)",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1890,
			"arabicnumber": 1890,
			"text": "‘উমার (রাঃ) হতে বর্ণিত। তিনি এ বলে দু‘আ করতেন, হে আল্লাহ! আমাকে তোমার রাস্তায় শাহাদাত লাভের তাওফীক দান কর এবং আমার মৃত্যু তোমার রাসূলের শহরে প্রদান কর। ইবনু যুরাই’ (রহ.)....হাফসাহ্ বিনতু ‘উমার (রাঃ) হতে বর্ণিত, তিনি বলেন, আমি ‘উমার (রাঃ)-কে অনুরূপ বর্ণনা করতে শুনেছি। হিশাম (রহ.) বলেন, যায়দ তাঁর পিতার সূত্রে হাফসাহ (রাযি.) হতে বর্ণনা করেন, তিনি বলেন, আমি ‘উমার (রাঃ)-কে (উপরোক্ত কথা) বলতে শুনেছি। আবূ ‘আবদুল্লাহ বুখারী (রহ.) বলেন, ‘রাওহ তাঁর মায়ের সূত্রে এরূপ বলেছেন।’’ (আধুনিক প্রকাশনীঃ ১৭৫৫, ইসলামিক ফাউন্ডেশনঃ ১৭৬৬)",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 24
			}
		}
	]
}