{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"3": "Knowledge"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 59,
			"arabicnumber": 59,
			"text": "(৩/১. بَاب فَضْلِ الْعِلْمِ ৩/১. ‘ইলমের ফাযীলাত। وَقَوْلِ اللهِ تَعَالَى )يَرْفَعْ اللهُ الَّذِينَ آمَنُوا مِنْكُمْ وَالَّذِينَ أُوتُوا الْعِلْمَ دَرَجَاتٍ وَاللهُ بِمَا تَعْمَلُونَ خَبِيرٌ( وَقَوْلِهِ عَزَّ وَجَلَّ وَقُلْ )رَبِّ زِدْنِي عِلْمًا( আল্লাহ তা‘আলার বাণীঃ ‘‘তোমাদের মধ্যে যারা ঈমানদার আল্লাহ তা‘আলা তাদের মর্যাদা বৃদ্ধি করে দেবেন এবং তাদেরকেও (বাড়িয়ে দিবেন) যাদেরকে ইলম দেয়া হয়েছে। আর আল্লাহ তোমাদের কার্যকলাপ সম্পর্কে পূর্ণ অবগত আছেন’’- (সূরাহ্ আল-মুজাদালাহ্ ৫৮/১১)। মহান আল্লাহর বাণীঃ ‘‘হে আমার প্রতিপালক! আমার জ্ঞান বাড়িয়ে দাও।’’ (সূরাহ্ তোয়াহা ২০/১১৪) ৫৯. আবূ হুরাইরাহ (রাযি.) হতে বর্ণিত। তিনি বলেনঃ একদা আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মজলিসে জনসম্মুখে কিছু আলোচনা করছিলেন। ইতোমধ্যে তাঁর নিকট জনৈক বেদুঈন এসে জিজ্ঞেস করল, ‘কিয়ামত কখন সংঘটিত হবে?’ আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর আলোচনায় রত থাকলেন। এতে কেউ কেউ বললেন, লোকটি যা বলেছে তিনি তা শুনেছেন কিন্তু তার কথা পছন্দ করেননি। আর কেউ কেউ বললেন বরং তিনি শুনতেই পাননি। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আলোচনা শেষে বললেনঃ ‘ক্বিয়ামাত (কিয়ামত) সম্পর্কে প্রশ্নকারী লোকটি কোথায়?’ সে বলল, ‘এই যে আমি, হে আল্লাহর রাসূল!’ তিনি বললেনঃ যখন আমানত নষ্ট করা হয় তখন কিয়ামতের প্রতীক্ষা করবে। সে বলল, কিভাবে আমানত নষ্ট করা হয়? তিনি বললেনঃ ‘যখন কোন অনুপযুক্ত ব্যক্তির উপর কোন কাজের দায়িত্ব দেয়া হয়, তখন তুমি কিয়ামতের অপেক্ষা করবে।’ (৬৪৯৬) (আধুনিক প্রকাশনীঃ ৫৭, ইসলামিক ফাউন্ডেশনঃ ৫৭)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 60,
			"arabicnumber": 60,
			"text": "‘আবদুল্লাহ্ ইবনু ‘আমর (রাযি.) হতে বর্ণিত। তিনি বলেন, কোন এক সফরে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের পিছনে পড়ে গেলেন। পরে তিনি আমাদের নিকট পৌঁছলেন, এদিকে আমরা (আসরের) সালাত আদায় করতে বিলম্ব করে ফেলেছিলাম এবং আমরা উযূ করছিলাম। আমরা আমাদের পা কোনমতে পানি দ্বারা ভিজিয়ে নিচ্ছিলাম। তিনি উচ্চৈস্বঃরে বললেনঃ পায়ের গোড়ালিগুলোর (শুকনো থাকার) জন্য জাহান্নামের ‘আযাব রয়েছে। তিনি দু’বার বা তিনবার এ কথা বললেন। (৯৬, ১৬৩; মুসলিম ২/৯ হাঃ ২৪১, আহমাদ ৬৮২৩) (আধুনিক প্রকাশনীঃ ৫৮, ইসলামিক ফাউন্ডেশনঃ ৫৮)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 61,
			"arabicnumber": 61,
			"text": "হুমাইদী (রহ.) বর্ণনা করেন যে, ইবনু ‘উয়াইনাহ (রহ.)-এর মতে একই অর্থবোধক। ইবনু মাস‘ঊদ (রাযি.) বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের নিকট হাদীস বর্ণনা করেছেন; আর তিনি সত্যবাদী এবং সত্যবাদীরূপে স্বীকৃত।’ শাকীক (রহ.) ‘আবদুল্লাহ্ (রাযি.) থেকে বর্ণনা করেন, ‘আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে এরূপ উক্তি শুনেছি’...। হুযাইফাহ (রাযি.) বলেন, ‘আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের নিকট দু’টি হাদীস বর্ণনা করেছেন।’ আবুল ‘আলিয়াহ (রহ.) ইবনু ‘আব্বাস (রাযি.) থেকে বর্ণনা করেন, ‘নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে, তিনি তাঁর রব থেকে বর্ণনা করেন’...। আনাস (রাযি.) বলেন, ‘নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে, তিনি বর্ণনা করেন তাঁর রব থেকে’....। আবূ হুরাইরাহ (রাযি.) বলেন, ‘নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে, তিনি তোমাদের মহিমাময় ও সুমহান প্রতিপালক থেকে বর্ণনা করেন’...। ৬১. ইবনু ‘উমার (রাযি.) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একদা বললেনঃ গাছগাছালির মধ্যে এমন একটি গাছ আছে যার পাতা ঝরে না। আর তা মুসলিমের উদাহরণ, তোমরা আমাকে অবগত কর ‘সেটি কী গাছ?’ তখন লোকেরা জঙ্গলের বিভিন্ন গাছ-গাছালির নাম ধারণা করতে লাগল। ‘আবদুল্লাহ (রাযি.) বলেন, ‘আমার ধারণা হল, সেটা হবে খেজুর গাছ।’ কিন্তু আমি (ছোট থাকার কারণে) তা বলতে লজ্জা পাচ্ছিলাম। অতঃপর সাহাবীগণ (রাযি.) বললেন, ‘হে আল্লাহর রাসূল! আপনি আমাদের বলে দিন সেটি কী গাছ?’ তিনি বললেনঃ ‘তা হচ্ছে খেজুর গাছ।’ (৬২, ৭২, ১৩১, ২২০৯, ৪৬৯৮, ৫৪৪৪, ৫৪৪৮, ৬১২২, ৬১৪৪; মুসলিম ৫০/১৫ হাঃ ২৮১১, আহমাদ ৬৪৭৭) (আধুনিক প্রকাশনীঃ ৫৯,ইসলামিক ফাউন্ডেশনঃ ৫৯)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 62,
			"arabicnumber": 62,
			"text": "ইবনু ‘উমার (রাযি.) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একদা বললেনঃ ‘গাছ-গাছালির মধ্যে এমন একটি গাছ রয়েছে যার পাতা ঝরে পড়ে না। আর তা মুসলিমের উদাহরণ। তোমরা আমাকে বল, সেটি কী গাছ?’ রাবী বলেন, তখন লোকেরা জঙ্গলের বিভিন্ন গাছ-গাছালির নাম ধারণা করতে লাগল। ‘আবদুল্লাহ (রাযি.) বলেন, ‘আমার ধারণা হল, সেটা হবে খেজুর গাছ।’ কিন্তু আমি (ছোট থাকার কারণে) তা বলতে লজ্জা পাচ্ছিলাম। অতঃপর সাহাবীগণ (রাযি.) বললেন, ‘হে আল্লাহর রাসূল! আপনি আমাদের বলে দিন সেটি কী গাছ?’ তিনি বললেনঃ ‘তা হচ্ছে খেজুর গাছ।’ (৬১) (আধুনিক প্রকাশনীঃ ৬০, ইসলামিক ফাউন্ডেশনঃ ৬০)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 63,
			"arabicnumber": 63,
			"text": "হাসান (বসরী), সুফইয়ান সাউরী এবং মালিক (রহ.)-এর মতে মুহাদ্দিসের সম্মুখে পাঠ করা বৈধ। কতিপয় মুহাদ্দিস উস্তাদের সামনে পাঠ করার স্বপক্ষে যিমাম ইবনু সা‘লাবা (রাযি.)-এর হাদীস বর্ণনা করেন। তিনি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে বলেছিলেন, ‘আমাদের পাঁচ ওয়াক্ত সালাত আদায় করার সম্বন্ধে আল্লাহ্ আপনাকে কী নির্দেশ দিয়েছেন?’ তিনি বললেনঃ ‘হ্যাঁ’। রাবী বলেন, এগুলো আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সম্মুখে পাঠ করা। যিমাম (রাযি.) তাঁর গোত্রের নিকট এ নির্দেশগুলো অবগত করেন এবং তাঁরা তা গ্রহণ করেন। (ইমাম) মালিক (রহ.) তাঁর মতের সমর্থনে লিখিত দলীলকে প্রমাণ হিসেবে বর্ণনা করেন, যা লোকদের সামনে পাঠ করা হলে তারা বলে, ‘অমুক আমাদের সাক্ষী বানিয়েছেন।’ শিক্ষকের সামনে পাঠ করে পাঠক বলে, ‘অমুক আমাকে পড়িয়েছেন।’ হাসান বসরী (রহ.) হতে বর্ণিত। তিনি বলেন, শিক্ষকের সামনে শিষ্যদের পাঠ করাতে কোন দ্বিধা নেই। ‘উবায়দুল্লাহ ইবনু মূসা (রহ.) সুফইয়ান (রহ.) থেকে বর্ণনা করেন যে, তিনি বলেন, যখন মুহাদ্দিসের সম্মুখে (কোন হাদীস) পাঠ করা হয় তখন হাদ্দাসানী (তিনি আমার নিকট হাদীস বর্ণনা করেছেন) বলায় কোন আপত্তি নেই। বর্ণনাকারী বলেন, আমি আবূ ‘আসিমকে মালিক ও সুফইয়ান (রহ.) হতে বর্ণনা করতে শুনেছি যে, ‘শিক্ষকের সামনে পাঠ করা এবং শিক্ষকের নিজে পাঠ করা একই পর্যায়ভুক্ত।’ (আধুনিক প্রকাশনীঃ ৬১, ইসলামিক ফাউন্ডেশনঃ ৬১) ৬৩. আনাস ইবনু মালিক (রাযি.) হতে বর্ণিত। তিনি বলেনঃ একদা আমরা মসজিদে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সাথে উপবিষ্ট ছিলাম। তখন জনৈক ব্যক্তি সওয়ার অবস্থায় প্রবেশ করল। মসজিদে (প্রাঙ্গণে) সে তার উটটি বসিয়ে (বেঁধে) দিল। অতঃপর সাহাবীদের লক্ষ্য করে বলল, ‘তোমাদের মধ্যে মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কোন্ ব্যক্তি?’ আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তখন তাদের সামনেই হেলান দিয়ে উপবিষ্ট ছিলেন। আমরা বললাম, ‘এই হেলান দিয়ে উপবিষ্ট ফর্সা ব্যক্তিটিই হলেন তিনি।’ অতঃপর লোকটি তাঁকে লক্ষ্য করে বলল, ‘হে আবদুল মুত্তালিবের পুত্র!’ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বললেনঃ ‘আমি তোমার উত্তর দিচ্ছি? লোকটি বলল, ‘আমি আপনাকে কিছু জিজ্ঞেস করব এবং সে প্রশ্ন করার ব্যাপারে কঠোর হব, এতে আপনি আমার প্রতি অসন্তুষ্ট হবেন না।’ ‘তিনি বললেন, ‘তোমার যা মনে চায় জিজ্ঞেস কর।’ সে বলল, ‘আমি আপনাকে স্বীয় প্রতিপালক এবং আপনার পূর্ববর্তীদের প্রতিপালকের শপথ দিয়ে জিজ্ঞেস করছি, আল্লাহ্ কি আপনাকে সমগ্র মানবকুলের প্রতি রাসূলরূপে প্রেরণ করেছেন?’ তিনি বললেনঃ ‘আল্লাহ্ সাক্ষী, হ্যাঁ।’ সে বলল, ‘আমি আপনাকে আল্লাহর শপথ দিয়ে বলছি, আল্লাহ্ই কি আপনাকে দিনে রাতে পাঁচ ওয়াক্ত সালাত আদায়ের আদেশ দিয়েছেন?’ তিনি বললেনঃ ‘আল্লাহ্ সাক্ষী, হ্যাঁ।’ সে বলল, ‘আমি আপনাকে আল্লাহর শপথ দিয়ে বলছি, আল্লাহ্ই কি আপনাকে বছরের এ মাসে (রমাযান) সিয়াম পালনের আদেশ দিয়েছেন?’ তিনি বললেনঃ ‘আল্লাহ্ সাক্ষী, হ্যাঁ।’ সে বলল, ‘আমি আপনাকে আল্লাহর শপথ দিয়ে বলছি, আল্লাহ্ই কি আপনাকে আদেশ দিয়েছেন, আমাদের ধনীদের থেকে এসব সদাক্বাহ (যাকাত) আদায় করে দরিদ্রদের মাঝে বন্টন করে দিতে?’ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ ‘আল্লাহ্ সাক্ষী, হ্যাঁ।’ অতঃপর লোকটি বলল, ‘আমি বিশ্বাস স্থাপন করলাম আপনি যা (যে শরী‘আত) এনেছেন তার উপর। আর আমি আমার গোত্রের রেখে আসা লোকজনের পক্ষে প্রতিনিধি, আমার নাম যিমাম ইবনু সা‘লাবা, বানী সা‘আদ ইবনু বক্র গোত্রের একজন।’ মূসা ও ‘আলী ইবনু আবদুল হামীদ (রহ.)....আনাস (রাযি.) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এরূপ বর্ণনা করেছেন। (আধুনিক প্রকাশনীঃ ৬২, ইসলামিক ফাউন্ডেশনঃ ৬২)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 64,
			"arabicnumber": 64,
			"text": "وَقَالَ أَنَسُ بْنُ مَالِكٍ نَسَخَ عُثْمَانُ بْنُ عَفَّانَ الْمَصَاحِفَ فَبَعَثَ بِهَا إِلَى الْآفَاقِ وَرَأَى عَبْدُ اللهِ بْنُ عُمَرَ وَيَحْيَى بْنُ سَعِيدٍ وَمَالِكُ بْنُ أَنَسٍ ذَلِكَ جَائِزًا وَاحْتَجَّ بَعْضُ أَهْلِ الْحِجَازِ فِي الْمُنَاوَلَةِ بِحَدِيثِ النَّبِيِّ صلى الله عليه وسلم حَيْثُ كَتَبَ لِأَمِيرِ السَّرِيَّةِ كِتَابًا وَقَالَ لاَ تَقْرَأْهُ حَتَّى تَبْلُغَ مَكَانَ كَذَا وَكَذَا فَلَمَّا بَلَغَ ذَلِكَ الْمَكَانَ قَرَأَهُ عَلَى النَّاسِ وَأَخْبَرَهُمْ بِأَمْرِ النَّبِيِّ صلى الله عليه وسلم. আনাস (রাযি.) বলেন, ‘উসমান (রাযি.) কুরআনের বহু কপি তৈরি করিয়ে বিভিন্ন দেশে প্রেরণ করেন। ‘‘আবদুল্লাহ্ ইবনু ‘উমার (রাযি.), ইয়াহইয়া ইবনু সা‘ঈদ ও মালিক (রহ.) এটাকে জায়িয মনে করেন। কোন কোন হিজাযবাসী ছাত্রকে হাদীস বর্ণনার অনুমতি প্রদানের ব্যাপারে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর এ হাদীস দিয়ে দলীল পেশ করেন যে, তিনি একটি সেনাদলের প্রধানকে একখানি পত্র দেন এবং তাঁকে বলে দেন, অমুক অমুক স্থানে না পৌঁছা পর্যন্ত এটা পড়ো না। অতঃপর তিনি যখন সে স্থানে পৌঁছলেন, তখন লোকের সামনে তা পড়ে শোনান এবং আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর ফরমান তাদেরকে জানান। ৬৪. ‘আবদুল্লাহ ইবনু ‘আব্বাস (রাযি.) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জনৈক ব্যক্তিকে তাঁর চিঠি দিয়ে পাঠালেন এবং তাকে বাহরাইনের গভর্নর-এর নিকট তা পৌঁছে দেয়ার নির্দেশ দিলেন। অতঃপর বাহরাইনের গভর্নর তা কিসরা (পারস্য সম্রাট)-এর নিকট দিলেন। পত্রটি পড়ার পর সে ছিঁড়ে টুকরো টুকরো করে ফেলল। [বর্ণনাকারী ইবনু শিহাব (রহ.) বলেন] আমার ধারণা ইবনু মুসায়্যাব (রহ.) বলেছেন, (এ ঘটনার খবর পেয়ে) আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের জন্য বদদু‘আ করেন যে, তাদেরকেও যেন সম্পূর্ণরূপে টুকরো টুকরো করে ফেলা হয়। (২৯৩৯, ৪৪২৪, ৭২৬৪) (আধুনিক প্রকাশনীঃ ৬৪, ইসলামিক ফাউন্ডেশনঃ ৬৪)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 65,
			"arabicnumber": 65,
			"text": "আনাস ইবন মালিক (রাযি.) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একখানা পত্র লিখলেন অথবা একখানা পত্র লিখতে ইচ্ছা পোষণ করলেন। তখন তাঁকে বলা হল, তারা (রোমবাসী ও অনারবরা) সীলমোহর ব্যতীত কোন পত্র পাঠ করেনা। অতঃপর তিনি রূপার একটি আংটি (মোহর) তৈরি করিয়ে নিলেন যাতে খোদিত ছিল (মুহাম্মাদুর রাসূলুল্লাহ)। আমি যেন তাঁর হাতে সে আংটির শুভ্রতা দেখতে পাচ্ছি [শু‘বা (রহ.) বলেন] আমি কাতাদাহ (রহ.) কে বললাম, কে বলেছে যে, তার নকশা (মুহাম্মাদুর রাসূলুল্লাহ) ছিল? তিনি বললেন, ‘আনাস (রাযি.)। (২৯৩৮, ৫৮৭০, ৫৮৭২, ৫৮৭৪, ৫৮৭৫, ৫৮৭৭, ৭১৬২; মুসলিম ৩৭/১২ হাঃ ২০৯২, আহমাদ ১২৯৪০) (আধুনিক প্রকাশনীঃ ৬৫, ইসলামিক ফাউন্ডেশনঃ ৬৫)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 66,
			"arabicnumber": 66,
			"text": "আবূ ওয়াক্বিদ আল-লায়সী (রাযি.) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একদা মসজিদে বসে ছিলেন; তাঁর সাথে আরও লোকজন ছিলেন। এমতাবস্থায় তিনজন লোক আসলো। তন্মধ্যে দু’জন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর দিকে এগিয়ে আসলেন এবং একজন চলে গেলেন। আবূ ওয়াকিদ (রাযি.) বলেন, তাঁরা দু’জন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট কিছুক্ষণ দাঁড়িয়ে থাকলেন। অতঃপর তাঁদের একজন মাজলিসের মধ্যে কিছুটা খালি জায়গা দেখে সেখানে বসে পড়লেন এবং অপরজন তাদের পেছনে বসলেন। আর তৃতীয় ব্যক্তি ফিরে গেল। যখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অবসর হলেন (সাহাবীদের লক্ষ্য করে) বললেনঃ আমি কি তোমাদেরকে এই তিন ব্যক্তি সম্পর্কে কিছু বলব না? তাদের একজন আল্লাহর আশ্রয় প্রার্থনা করল, আল্লাহ্ তাকে আশ্রয় দিলেন। অন্যজন লজ্জাবোধ করল, তাই আল্লাহ্ও তার ব্যাপারে লজ্জাবোধ করলেন। আর অপরজন (মাজলিসে হাযির হওয়া থেকে) মুখ ফিরিয়ে নিলেন, তাই আল্লাহ্ও তার থেকে মুখ ফিরিয়ে নিলেন। (৪৭৪; মুসলিম ৩৯/১০ হাঃ ৬১৭৬, আহমাদ ২১৯৬৬) (আধুনিক প্রকাশনীঃ ৬৬, ইসলামিক ফাউন্ডেশনঃ ৬৬)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 67,
			"arabicnumber": 67,
			"text": "আবূ বাকরাহ্ (রাযি.) হতে বর্ণিত। তিনি একদা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর কথা উল্লেখ করে বলেন, (মিনায়) তিনি তাঁর উটের উপর উপবেশন করলেন। জনৈক ব্যক্তি তাঁর উটের লাগাম ধরে রেখেছিল। তিনি বললেনঃ ‘এটা কোন্ দিন?’ আমরা চুপ করে রইলাম আর ধারণা করলাম যে, অচিরেই তিনি এ দিনটির আলাদা কোন নাম দিবেন। তিনি বললেনঃ ‘‘এটা কি কুরবানীর দিন নয়?’ আমরা বললাম, ‘জি হ্যাঁ।’ তিনি জিজ্ঞেসঃ ‘এটা কোন্ মাস?’ আমরা নীরব রইলাম আর ধারণা করলাম যে, অচিরেই তিনি এর আলাদা কোন নাম দিবেন। তিনি বললেনঃ ‘এটা কি যিলহাজ্জ মাস নয়?’ আমরা বললাম, ‘জী হ্যাঁ।’ তিনি বললেনঃ ‘তোমাদের রক্ত, তোমাদের ধন-সম্পদ, তোমাদের সম্মান তোমাদের পরস্পরের জন্য হারাম, যেমন আজকের তোমাদের এ দিন, তোমাদের এ মাস, তোমাদের এ শহর মর্যাদা সম্পন্ন। এখানে উপস্থিত ব্যক্তিরা (আমার এ বাণী) যেন অনুপস্থিত ব্যক্তির নিকট এসব কথা পৌঁছে দেয়। কারণ উপস্থিত ব্যক্তি সম্ভবত এমন এক ব্যক্তির নিকট পৌঁছাবে, যে এ বাণীকে তার চেয়ে অধিক আয়ত্তে রাখতে পারবে।’ (১০৫, ১৭৪১, ৩১৯৭, ৪৪০৬, ৪৬৬২, ৫৫৫০, ৭০৭৮, ৭৪৪৭; মুসলিম ২৮/৯ হাঃ ১৬৭৯, আহমাদ ২০৪০৮) (আধুনিক প্রকাশনীঃ ৬৭, ইসলামিক ফাউন্ডেশনঃ ৬৭)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 68,
			"arabicnumber": 68,
			"text": "৩/১০. বলা ও করার পূর্বে জ্ঞান আবশ্যক। মহা মহিমান্বিত আল্লাহ্ বলেনঃ ‘‘সুতরাং জেনে রাখ, আল্লাহ্ ব্যতীত প্রকৃত কোন উপাস্য নেই।’ (সূরাহ্ মুহাম্মাদ ৪৭/১৯)। আল্লাহ্ ‘ইলম দ্বারা আরম্ভ করেছেন। আলিমগণই নবীগণের উত্তরাধিকারী। তাঁরা জ্ঞানের উত্তরাধিকারী হয়েছেন। যে জ্ঞান অর্জন করে সে বিরাট অংশ লাভ করে। আর যে ব্যক্তি ‘ইল্ম অর্জনের জন্য পথ চলে, আল্লাহ্ তা‘আলা তার জন্য জান্নাতের পথ সুগম করে দেন। আল্লাহ্ তা‘আলা বলেনঃ ‘আল্লাহর বান্দাদের মধ্যে আলিমগণই তাঁকে ভয় করে- (সূরাহ্ ফাতির ৩৫/২৮)। আল্লাহ্ তা‘আলা আরো বলেনঃ ‘‘আলিমগণ ব্যতীত তা কেউ অনুধাবন করে না’’- (সূরাহ্ আল-‘আনকাবুত ২৯/৩৪)। অন্যত্র আল্লাহ বলেনঃ তারা বলবে, ‘আমরা যদি শুনতাম অথবা উপলব্ধি করতাম, তাহলে আমরা জাহান্নামবাসী হতাম না- (সূরাহ্ মুল্ক ৬৭/১০)। অন্যত্র তিনি বলেনঃ ‘‘বল, যারা জানে আর যারা জানে না, তারা কি সমান হতে পারে?’ (সূরাহ্ যুমার ৩৯/৯)। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আল্লাহ্ যার কল্যাণ কামনা করেন তাকে দ্বীনের ‘ইল্ম দান করেন। আর অধ্যয়নের মাধ্যমেই জ্ঞান অর্জিত হয়। আবূ যার (রাযি.) তাঁর ঘাড়ের দিকে ইঙ্গিত করে বলেন, যদি তোমরা এখানে তরবারী রাখ, অতঃপর আমি বুঝতে পারি যে, তোমরা সে তরবারী আমার উপর চালাবার পূর্বে আমি একটু কথা বলার সুযোগ পাব, তবে আমি যা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে শুনেছি, অবশ্যই তা বলে ফেলব। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর বাণীঃ উপস্থিত ব্যক্তিরা যেন অনুপস্থিত ব্যক্তির নিকট (আমার বাণী) পৌঁছে দেয়। ইবনু ‘আব্বাস (রাযি.) বলেন, ‘‘তোমরা রববানী হও।’’ (সূরাহ আলু ‘ইমরানঃ ৩/৭৯)। এখানে অর্থ প্রজ্ঞাবান, আলিম ও ফকীহগণ। আরো বলা হয় সে ব্যক্তিকে বলা হয় যিনি মানুষকে জ্ঞানের বড় বড় বিষয়ের পূর্বে ছোট ছোট বিষয় শিক্ষা দিয়ে থাকেন। ৬৮. ইবনু মাস‘ঊদ (রাযি.) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের অবস্থার প্রতি লক্ষ্য রেখে নির্দিষ্ট দিনে নাসীহাত করতেন, আমরা যাতে বিরক্ত বোধ না করি। (৭০,৬৪১১; মুসলিম ৫০/১৯ হাঃ ২৮২১, আহমাদ ৪০৬০) (আধুনিক প্রকাশনীঃ ৬৮, ইসলামিক ফাউন্ডেশনঃ ৬৮)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 69,
			"arabicnumber": 69,
			"text": "আনাস (রাযি.) থেকে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা সহজ পন্থা অবলম্বন কর, কঠিন পন্থা অবলম্বন করো না, মানুষকে সুসংবাদ দাও, বিরক্তি সৃষ্টি করো না। (৬১২৫; মুসলিম ৩২/৩ হাঃ ১৭৩৪, আহমাদ ১৩১৭৪) (আধুনিক প্রকাশনীঃ ৬৯, .ফা. ৬৯)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 70,
			"arabicnumber": 70,
			"text": "আবূ ওয়াইল (রাযি.) হতে বর্ণিত। তিনি বলেনঃ ইবনু মাস‘ঊদ (রাযি.) প্রতি বৃহস্পতিবার লোকদের নাসীহাত করতেন। তাঁকে একজন বলল, ‘হে আবূ ‘আবদুর রহমান! আমার ইচ্ছা জাগে, যেন আপনি প্রতিদিন আমাদের নাসীহাত করেন। তিনি বললেনঃ এ কাজ থেকে আমাকে যা বাধা দেয় তা হচ্ছে, আমি তোমাদেরকে ক্লান্ত করতে পছন্দ করি না। আর আমি নাসীহাত করার ব্যাপারে তোমাদের (অবস্থার) প্রতি খেয়াল রাখি, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ক্লান্তির আশংকায় আমাদের প্রতি যেমন লক্ষ্য রাখতেন। (৬৮) (আধুনিক প্রকাশনীঃ ৭০, ইসলামিক ফাউন্ডেশনঃ ৭০)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 71,
			"arabicnumber": 71,
			"text": "হুমায়দ ইবনু ‘আবদুর রহমান (রহ.) হতে বর্ণিত। তিনি বলেনঃ আমি মু‘আবিয়াহ (রাযি.)-কে খুৎবায় বলতে শুনেছি, তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে বলতে শুনেছি, আল্লাহ্ যার মঙ্গল চান, তাকে দ্বীনের ‘ইল্ম দান করেন। আমি তো বিতরণকারী মাত্র, আল্লাহ্ই (জ্ঞান) দাতা। সর্বদাই এ উম্মাত কিয়ামত পর্যন্ত আল্লাহর হুকুমের উপর কায়িম থাকবে, বিরোধিতাকারীরা তাদের কোন ক্ষতি করতে পারবে না। (৩১১৬, ৩৬৪১,৭৩১২, ৭৪৬০; মুসলিম ১২/৩৩ হাঃ ১০৩৭, আহমাদ ১৬৮৪৯, ১৬৮৭৮, ১৬৯১০) (আধুনিক প্রকাশনীঃ ৭১, ইসলামিক ফাউন্ডেশনঃ ৭১)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 72,
			"arabicnumber": 72,
			"text": "মুজাহিদ (রহ.) হতে বর্ণিত। তিনি বলেন, আমি সফরে মদিনা পর্যন্ত ইবনু ‘উমার (রাযি.)-এর সাথে ছিলাম। এ সময় তাঁকে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে একটি মাত্র হাদীস বর্ণনা করতে শুনেছি। তিনি বলেন, আমরা একদা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট ছিলাম। তখন তাঁর নিকট খেজুর গাছের (অভ্যন্তরের কোমল অংশ) মাথি আনা হল। অতঃপর তিনি বললেনঃ বৃক্ষরাজির মধ্যে এমন একটি বৃক্ষ রয়েছে, যার দৃষ্টান্ত মুসলিমের ন্যায়। তখন আমি বলতে চাইলাম যে, তা হল খেজুর বৃক্ষ, কিন্তু আমি লোকদের মাঝে বয়সে সবচাইতে ছোট ছিলাম। তাই নীরব থাকলাম। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ ‘সেটা হলো খেজুর বৃক্ষ।’ (৬১) (আধুনিক প্রকাশনীঃ ৭২, ইসলামিক ফাউন্ডেশনঃ ৭২)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 73,
			"arabicnumber": 73,
			"text": "وَقَالَ عُمَرُ تَفَقَّهُوا قَبْلَ أَنْ تُسَوَّدُوا قَالَ أَبُو عَبْد اللهِ وَبَعْدَ أَنْ تُسَوَّدُوا وَقَدْ تَعَلَّمَ أَصْحَابُ النَّبِيِّ صلى الله عليه وسلم فِي كِبَرِ سِنِّهِمْ. ‘উমার (রাযি.) বলেন, তোমরা নেতা হবার পূর্বেই জ্ঞানার্জন করে নাও। আবূ ‘‘আবদুল্লাহ্ (বুখারী) বলেন, আর নেতা বানিয়ে দেয়ার পরও, কেননা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সাহাবীগণ বৃদ্ধ বয়সেও ‘ইল্ম অর্জন করেছেন। ৭৩. ক্বায়স বিন হাযিম (রহ.) বলেন, আমি ‘আবদুল্লাহ ইবনু মাস‘ঊদ (রাযি.)-কে বলতে শুনেছি, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কেবল দু’টি বিষয়ে ইর্ষা করা বৈধ; (১) সে ব্যক্তির উপর, যাকে আল্লাহ্ সম্পদ দিয়েছেন, অতঃপর তাকে বৈধ পন্থায় অকাতরে ব্যয় করার ক্ষমতা দিয়েছেন; (২) সে ব্যক্তির উপর, যাকে আল্লাহ্ তা‘আলা প্রজ্ঞা দান করেছেন, অতঃপর সে তার মাধ্যমে বিচার ফায়সালা করে ও তা অন্যকে শিক্ষা দেয়। (১৪০৯,৭১৪১,৭৩১৬; মুসলিম ৬/৪৭ হাঃ ৮১৬, আহমাদ ৩৪৫১) (আধুনিক প্রকাশনীঃ ৭৩, ইসলামিক ফাউন্ডেশনঃ ৭৩)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 74,
			"arabicnumber": 74,
			"text": "(وَقَوْلِهِ تَعَالَى )هَلْ أَتَّبِعُكَ عَلَى أَنْ تُعَلِّمَنِي مِمَّا عُلِّمْتَ رُشْدًا( আল্লাহ্ তা‘আলার বাণীঃ ‘‘আমি কি আপনার অনুসরণ করব এ শর্তে যে, সত্য পথের যে জ্ঞান আপনাকে দেয়া হয়েছে তা থেকে আমাকে শিক্ষা দেবেন।’’ (সূরাহ্ কাহ্ফ ১৮/৬৬) ৭৪. ইবনু ‘আব্বাস (রাযি.) হতে বর্ণিত। তিনি এবং হুর ইবনু কায়স ইবনু হিসন আল-ফাযারীর মধ্যে মূসা (আ)-এর সম্পর্কে বাদানুবাদ হলো। ইবনু ‘আব্বাস (রাযি.) বললেন, তিনি ছিলেন খিযর। ঘটনাক্রমে তখন তাদের পাশ দিয়ে উবাঈ ইব্ন কা‘ব (রাযি.) যাচ্ছিলেন। ইবনু ‘আব্বাস (রাযি.) তাঁকে ডাক দিয়ে বললেনঃ আমি ও আমার এ ভাই মূসা (আ)-এর সেই সহচর সম্পর্কে বাদানুবাদ করছি যাঁর সাথে সাক্ষাত করার জন্য মূসা (আ) আল্লাহর নিকট পথের সন্ধান চেয়েছিলেন- আপনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে তাঁর সম্পর্কে কিছু বলতে শুনেছেন কি? তিনি বললেন, হ্যাঁ, আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে বলতে শুনেছি, একদা মূসা (আ) বনী ইসরাঈলের কোন এক মাজলিসে উপস্থিত ছিলেন। তখন তাঁর নিকট জনৈক ব্যক্তি এসে বলল, ‘আপনি কাউকে আপনার চেয়ে অধিক জ্ঞানী বলে মনে করেন কি?’ মূসা (আ) বললেন, ‘না।’ তখন আল্লাহ্ তা‘আলা মূসা (আ)-এর নিকট ওয়াহী প্রেরণ করলেনঃ ‘হ্যাঁ, আমার বান্দা খিযর।’ অতঃপর মূসা (আ) তাঁর সঙ্গে সাক্ষাৎ করার জন্য পথের সন্ধান চাইলেন। অতঃপর আল্লাহ্ তা‘আলা মাছকে তার জন্য নিদর্শন বানিয়ে দিলেন এবং তাঁকে বলা হল, যখন তুমি মাছটি হারিয়ে ফেলবে তখন ফিরে যাবে। কারণ, কিছুক্ষণের মধ্যেই তুমি তাঁর সাথে মিলিত হবে। তখন তিনি সমুদ্রে সে মাছের নিদর্শন অনুসরণ করতে লাগলেন। মূসা (আ)-কে তাঁর সঙ্গী যুবক (ইউশা ইবনু নূন) বললেন, (কুরআন মজীদের ভাষায়ঃ) আপনি কি লক্ষ্য করেছেন আমরা যখন পাথরের নিকট বিশ্রাম নিচ্ছিলাম তখন আমি মাছের কথা ভুলে গিয়েছিলাম? শয়তানই তার কথা আমাকে ভুলিয়ে দিয়েছিল। মূসা বললেন, আমরা তো সেটিরই সন্ধান করছিলাম। অতঃপর তারা নিজেদের পদ চিহ্ন অনুসরণ করে ফিরে চলল। (সূরাহ্ কাহ্ফ ১৮/৬৩-৬৪) তাঁরা খিযরকে পেলেন। তাদের ঘটনা সেটাই, যা আল্লাহ্ তা‘আলা তাঁর কিতাবে বিবৃত করেছেন। (২২৬৭, ২৭২৮, ৩২৭৮, ৩৪০০,৩৪০১, ৪৭২৫, ৪৭২৬, ৪৭২৭, ৬৬৭২, ৭৪৭৮) (আধুনিক প্রকাশনীঃ ৭৪, ইসলামিক ফাউন্ডেশনঃ ৭৪)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 75,
			"arabicnumber": 75,
			"text": "ইবনু ‘আব্বাস (রাযি.) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একবার আমাকে জাপটে ধরে বললেন, ‘হে আল্লাহ্! আপনি তাকে কিতাবের (কুরআন) জ্ঞান দান করুন।’ (১৪৩, ৩৭৫৬, ৭২৭০; মুসলিম ৪৪/৩০ হাঃ ২৪৭৭, আহমাদ ২৩৯৭, ২৮৮১, ৩০২৩) (আধুনিক প্রকাশনীঃ ৭৫, ইসলামিক ফাউন্ডেশনঃ ৭৫)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 76,
			"arabicnumber": 76,
			"text": "‘আবদুল্লাহ্ ইবনু ‘আব্বাস (রাযি.) হতে বর্ণিত। তিনি বলেনঃ আমি সাবালক হবার নিকটবর্তী বয়সে একদা একটি গাধীর উপর আরোহিত অবস্থায় এলাম। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তখন মিনায় সালাত আদায় করছিলেন তার সামনে কোন দেয়াল না রেখেই। তখন আমি কোন এক কাতারের সামনে দিয়ে অতিক্রম করলাম এবং গাধীটিকে বিচরণের জন্য ছেড়ে দিলাম। আমি কাতারের ভেতর ঢুকে পড়লাম কিন্তু এতে কেউ আমাকে নিষেধ করেননি। (৪৯৩, ৮৬১, ১৮৫৭, ৪৪১২; মুসলিম ৪/৪৭ হাঃ ৫০৪, আহমাদ ১৮৯১) (আধুনিক প্রকাশনীঃ ৭৬, ইসলামিক ফাউন্ডেশনঃ ৭৬)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 77,
			"arabicnumber": 77,
			"text": "মাহমূদ ইবনুর-রাবী‘ (রাযি.) হতে বর্ণিত। তিনি বলেন, আমার মনে আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একবার বালতি থেকে পানি নিয়ে আমার মুখমন্ডলের উপর কুলি করে দিয়েছিলেন, তখন আমি ছিলাম পাঁচ বছরের বালক। (১৮৯, ৮৩৯, ১১৮৫, ৬৩৫৪, ৬৪২২ দ্রষ্টব্য) (আধুনিক প্রকাশনীঃ ৭৭, ইসলামিক ফাউন্ডেশনঃ ৭৭)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 78,
			"arabicnumber": 78,
			"text": "وَرَحَلَ جَابِرُ بْنُ عَبْدِ اللهِ مَسِيرَةَ شَهْرٍ إِلَى عَبْدِ اللهِ بْنِ أُنَيْسٍ فِي حَدِيثٍ وَاحِدٍ. জাবির ইবনু ‘আবদুল্লাহ্ (রাযি.) একটি মাত্র হাদীসের জন্য ‘আব্দুল্লাহ্ ইবনু উনায়স (রাযি.)-এর নিকট এক মাসের পথ সফর করে গিয়েছিলেন। ৭৮. ইবনু ‘আব্বাস (রাযি.) হতে বর্ণিত। তিনি এবং হুর ইবনু কায়স ইবনু হিসন আল-ফাযারীর মধ্যে মূসা (আ)-এর সম্পর্কে বাদানুবাদ হলো। ইবনু ‘আব্বাস (রাযি.) বললেন, তিনি ছিলেন খিযর। ঘটনাক্রমে তখন তাদের পাশ দিয়ে উবাঈ ইব্ন কা‘ব (রাযি.) যাচ্ছিলেন। ইবনু ‘আব্বাস (রাযি.) তাঁকে ডাক দিয়ে বললেনঃ আমি ও আমার এ ভাই মূসা (আ)-এর সেই সহচর সম্পর্কে বাদানুবাদ করছি যাঁর সাথে সাক্ষাত করার জন্য মূসা (আ) আল্লাহর নিকট পথের সন্ধান চেয়েছিলেন। আপনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে তাঁর সম্পর্কে কিছু বলতে শুনেছেন কি? তিনি বললেন, হ্যাঁ, আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে বলতে শুনেছি, একদা মূসা (আ) বনী ইসরাঈলের কোন এক মাজলিসে উপস্থিত ছিলেন। তখন তাঁর নিকট জনৈক ব্যক্তি এসে বলল, ‘আপনি কাউকে আপনার চেয়ে অধিক জ্ঞানী বলে মনে করেন কি?’ মূসা (আ) বললেন, ‘না।’ তখন আল্লাহ্ তা‘আলা মূসা (আ)-এর নিকট ওয়াহী প্রেরণ করলেনঃ ‘হ্যাঁ, আমার বান্দা খিযর।’ অতঃপর মূসা (আ) তাঁর সঙ্গে সাক্ষাত করার জন্য পথের সন্ধান চাইলেন। অতঃপর আল্লাহ্ তা‘আলা মাছকে তার জন্য নিদর্শন বানিয়ে দিলেন এবং তাঁকে বলা হল, যখন তুমি মাছটি হারিয়ে ফেলবে তখন ফিরে যাবে। কারণ, কিছুক্ষণের মধ্যেই তুমি তাঁর সাথে মিলিত হবে। তখন তিনি সমুদ্রে সে মাছের নিদর্শন অনুসরণ করতে লাগলেন। মূসা (আ)-কে তাঁর সঙ্গী যুবক (ইউশা ইবনু নূন) বললেন, (কুরআন মজীদের ভাষায়ঃ) আপনি কি লক্ষ্য করেছেন আমরা যখন পাথরের নিকট বিশ্রাম নিচ্ছিলাম তখন আমি মাছের কথা ভুলে গিয়েছিলাম? শয়তানই তার কথা আমাকে ভুলিয়ে দিয়েছিল। মূসা বললেন, আমরা তো সেটিরই সন্ধান করছিলাম। অতঃপর তারা নিজেদের পদ চিহ্ন অনুসরণ করে ফিরে চলল। (সূরাহ্ কাহাফ ১৮/৬৩-৬৪) তাঁরা খিযরকে পেলেন। এ হল তাদের দু’জনের ঘটনা, যা আল্লাহ্ তা‘আলা তাঁর কিতাবে বিবৃত করেছেন। (৭৪) (আধুনিক প্রকাশনীঃ ৭৮, ইসলামিক ফাউন্ডেশনঃ ৭৮)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 79,
			"arabicnumber": 79,
			"text": "আবূ মূসা (রাযি.) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আল্লাহ্ তা‘আলা আমাকে যে হিদায়াত ও ‘ইল্ম দিয়ে পাঠিয়েছেন তার দৃষ্টান্ত হল যমীনের উপর পতিত প্রবল বর্ষণের ন্যায়। কোন কোন ভূমি থাকে উর্বর যা সে পানি শুষে নিয়ে প্রচুর পরিমাণে ঘাসপাতা এবং সবুজ তরুলতা উৎপাদন করে। আর কোন কোন ভূমি থাকে কঠিন যা পানি আটকে রাখে। পরে আল্লাহ তা‘আলা তা দিয়ে মানুষের উপকার করেন; তারা নিজেরা পান করে ও (পশুপালকে) পান করায় এবং তা দ্বারা চাষাবাদ করে। আবার কোন কোন জমি রয়েছে যা একেবারে মসৃণ ও সমতল; তা না পানি আটকে রাখে, আর না কোন ঘাসপাতা উৎপাদন করে। এই হল সে ব্যক্তির দৃষ্টান্ত যে দ্বীনের জ্ঞান অর্জন করে এবং আল্লাহ্ তা‘আলা আমাকে যা দিয়ে প্রেরণ করেছেন তাতে সে উপকৃত হয়। ফলে সে নিজে শিক্ষা করে এবং অপরকে শিখায়। আর সে ব্যক্তিরও দৃষ্টান্ত- যে সে দিকে মাথা তুলে দেখে না এবং আল্লাহর যে হিদায়াত নিয়ে আমি প্রেরিত হয়েছি, তা গ্রহণও করে না। আবূ ‘আবদুল্লাহ্ (বুখারী) (রহ.) বলেনঃ ইসহাক (রহ.) আবূ উসামাহ (রহ.) থেকে বর্ণনা করেছেনঃ তিনি قلت এর স্থলে قَيَّلَتْ (আটকিয়ে রাখে) ব্যবহার করেছেন। قاع হল এমন ভূমি যার উপর পানি জমে থাকে। আর الصَّفْصَفُ হল সমতল ভূমি। (মুসলিম ৪৩/৫ হাঃ ২২৮২, আহমাদ ১৯৫৯০) (আধুনিক প্রকাশনীঃ ৭৯, ইসলামিক ফাউন্ডেশনঃ ৭৯)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 80,
			"arabicnumber": 80,
			"text": "وَقَالَ رَبِيعَةُ لاَ يَنْبَغِي لِأَحَدٍ عِنْدَهُ شَيْءٌ مِنَ الْعِلْمِ أَنْ يُضَيِّعَ نَفْسَهُ. রাবী‘আহ (রহ.) বলেন, ‘যার নিকট সামান্য জ্ঞান আছে, তার উচিত নয় নিজেকে অপমানিত করা ৮০. আনাস (রাযি.) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন যে, কিয়ামতের কিছু ‘আলামত হলঃ ‘ইল্ম হ্রাস পাবে, অজ্ঞতা প্রসারতা লাভ করবে, মদপানের মাত্রা বৃদ্ধি পাবে এবং যেনা ব্যভিচার বিস্তার লাভ করবে। (৮১, ৫২৩১, ৫৫৭৭, ৬৮০৮; মুসলিম ৪৭/৪ হাঃ ২৬৭১, আহমাদ ১৩০৯৩, ১৪০৮০) (আধুনিক প্রকাশনীঃ ৮০, ইসলামিক ফাউন্ডেশনঃ ৮০)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 81,
			"arabicnumber": 81,
			"text": "আনাস (রাযি.) হতে বর্ণিত। তিনি বলেন, আমি কি তোমাদের এমন একটি হাদীস বর্ণনা করব যা আমার পর তোমাদের নিকট আর কেউ বর্ণনা করবে না। আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে বলতে শুনেছি যে, কিয়ামতের কিছু আলামাত হলঃ ‘ইল্ম হ্রাস পাবে, অজ্ঞতার প্রসার ঘটবে, ব্যভিচার ছড়িয়ে পড়বে, স্ত্রীলোকের সংখ্যা বৃদ্ধি পাবে এবং পুরুষের সংখ্যা কমে যাবে, এমনকি প্রতি পঞ্চাশজন স্ত্রীলোকের জন্য মাত্র একজন পুরুষ হবে পরিচালক। (৮০) (আধুনিক প্রকাশনীঃ ৮১, ইসলামিক ফাউন্ডেশনঃ ৮১)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 82,
			"arabicnumber": 82,
			"text": "ইবনু ‘উমার (রাযি.) হতে বর্ণিত। তিনি বলেন, আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে বলতে শুনেছি, একদা আমি নিদ্রাবস্থায় ছিলাম। তখন (স্বপ্নে) আমার নিকট এক পিয়ালা দুধ নিয়ে আসা হল। আমি তা পান করলাম। এমনকি আমার মনে হতে লাগল যে, সে পরিতৃপ্তি আমার নখ দিয়ে বের হয়ে যাচ্ছে। অতঃপর অবশিষ্টাংশ আমি ‘উমার ইবনুল-খাত্তাবকে দিলাম। সাহাবীগণ বললেন, হে আল্লাহর রাসূল! আপনি এ স্বপ্নের কী ব্যাখ্যা করেন? তিনি জবাবে বললেনঃ তা হল আল-‘ইলম। (৩৬৮১,৭০০৬,৭০০৭,৭০২৭,৭০৩২; মুসলিম ৪৩/২ হাঃ ২৩৯১, আহমাদ ৫৫৫৫) (আধুনিক প্রকাশনীঃ ৮২, ইসলামিক ফাউন্ডেশনঃ ৮২)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 83,
			"arabicnumber": 83,
			"text": "‘আবদুল্লাহ্ ইবনু ‘আমর ইবনু ‘আস (রাযি.) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বিদায় হাজ্জের দিবসে মিনায় লোকদের সম্মুখে (বাহনের উপর) দাঁড়ালেন। লোকেরা তাঁকে বিভিন্ন মাসআলা জিজ্ঞেস করছিল। জনৈক ব্যক্তি তাঁর নিকট এসে বলল, আমি ভুলক্রমে কুরবানীর পূর্বেই মাথা কামিয়ে ফেলেছি। তিনি বললেনঃ যবেহ কর, কোন ক্ষতি নেই। আর এক ব্যক্তি এসে বলল, আমি ভুলক্রমে কঙ্কর নিক্ষেপের পূর্বেই কুরবানী করে ফেলেছি। তিনি বললেনঃ কঙ্কর ছুঁড়ো, কোন অসুবিধে নেই। ‘আবদুল্লাহ্ ইবনু ‘আমার (রাযি.) বলেন, ‘নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সেদিন পূর্বে বা পরে করা যে কোন কাজ সম্পর্কেই জিজ্ঞাসিত হচ্ছিলেন, তিনি এ কথাই বলেছিলেনঃ কর, কোন ক্ষতি নেই।* (১২৪,১৭৩৬,১৭৩৭,১৭৩৮,৬৬৬৫; মুসলিম ১৫/৫৭ হাঃ ১৩০৬, আহমাদ ৬৪৯৯) (আধুনিক প্রকাশনীঃ ৮৩, ইসলামিক ফাউন্ডেশনঃ ৮৩)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 84,
			"arabicnumber": 84,
			"text": "ইবনু ‘আব্বাস (রাযি.) হতে বর্ণিত। হাজ্জের সময় নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জিজ্ঞাসিত হলেন। কোন একজন বললঃ আমি কঙ্কর নিক্ষেপের পূর্বেই যবেহ (কুরবানী) করে ফেলেছি। ইবনু ‘আব্বাস (রাযি.) বলেন, তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হাত দিয়ে ইঙ্গিত করে বললেনঃ কোন অসুবিধে নেই। আর এক ব্যক্তি বললঃ আমি যবেহ করার পূর্বে মাথা মুন্ডন করে ফেলেছি। তিনি হাত দিয়ে ইঙ্গিত করলেনঃ কোন ক্ষতি নেই। (১৭২১, ১৭২২, ১৭২৩, ১৭৩৪, ৬৬৬৬ দ্রষ্টব্য) (আধুনিক প্রকাশনীঃ ৮৪, ইসলামিক ফাউন্ডেশনঃ ৮৪)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 85,
			"arabicnumber": 85,
			"text": "আবূ হুরাইরাহ (রাযি.) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ (শেষ যামানায়) ‘ইল্ম উঠিয়ে নেয়া হবে, অজ্ঞতা ও ফিতনা ছড়িয়ে পড়বে এবং ‘হার্জ’ বেড়ে যাবে। জিজ্ঞেস করা হল, হে আল্লাহর রাসূল! ‘হার্জ’ কী? তিনি হাত দ্বারা ইঙ্গিত করে বললেনঃ ‘এ রকম’। যেন তিনি এর দ্বারা ‘হত্যা বুঝিয়েছিলেন। (১০৩৬, ১৪১২, ৩৬০৮, ৪৬৩৫, ৬০৩৭, ৬৫০৬, ৬৯৩৫, ৭০৬১, ৭১১৫, ৭১২১) (আধুনিক প্রকাশনীঃ ৮৫, ইসলামিক ফাউন্ডেশনঃ ৮৫)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 86,
			"arabicnumber": 86,
			"text": "আসমা (রাযি.) হতে বর্ণিত তিনি বলেন, আমি ‘আয়িশাহ (রাযি.)-র নিকট আসলাম, তিনি তখন সালাত রত ছিলেন। আমি বললাম, ‘মানুষের কী হয়েছে?’ তিনি আকাশের দিকে ইঙ্গিত করলেন (সূর্য গ্রহণ লেগেছে)। তখন সকল লোক (সালাতুল কুসূফ এর জন্য) দাঁড়িয়ে রয়েছে। ‘আয়িশাহ (রাযি.) বললেন, সুবহানাল্লাহ! আমি বললাম, এটা কি কোন নিদর্শন? তিনি মাথা দিয়ে ইঙ্গিত করলেন, ‘হ্যাঁ।’ অতঃপর আমি (সালাতে) দাঁড়িয়ে গেলাম। এমনকি (দীর্ঘতার কারণে) আমার জ্ঞান হারিয়ে ফেলার উপক্রম হল। তাই আমি মাথায় পানি ঢালতে আরম্ভ করলাম। পরে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আল্লাহর হাম্দ ও সানা পাঠ করলেন। অতঃপর বললেনঃ যা কিছু আমাকে ইতোপূর্বে দেখানো হয়নি, তা আমি আমার এ স্থানেই দেখতে পেয়েছি। এমনকি জান্নাত ও জাহান্নামও। অতঃপর আল্লাহ্ তা‘আলা আমার নিকট ওয়াহী প্রেরণ করলেন, ‘দাজ্জালের ন্যায় (কঠিন) পরীক্ষা অথবা তার কাছাকাছি বিপদ দিয়ে তোমাদেরকে কবরে পরীক্ষায় ফেলা হবে।’ ফাতিমাহ (রাযি.) বলেন, আসমা (রাযি.) (অনুরূপ) শব্দ বলেছিলেন, (কাছাকাছি) শব্দ, তা ঠিক আমার স্মরণ নেই। (কবরের মধ্যে) বলা হবে, ‘এ ব্যক্তি সম্পর্কে তুমি কী জান?’ তখন মু‘মিন ব্যক্তি বা মু’কিন (বিশ্বাসী) ব্যক্তি [ফাতিমাহ (রাযি.) বলেন] আসমা (রাযি.) এর কোন্ শব্দটি বলেছিলেন আমি জানিনা], বলবে, ‘তিনি মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম , তিনি আল্লাহর রাসূল। আমাদের নিকট মু‘জিযা ও হিদায়াত নিয়ে এসেছিলেন। আমরা তা গ্রহণ করেছিলাম এবং তাঁর ইততিবা‘ করেছিলাম। তিনি মুহাম্মাদ।’ তিনবার এরূপ বলবে। তখন তাকে বলা হবে, আরামে ঘুমিয়ে থাক, আমরা জানতে পারলাম যে, তুমি (দুনিয়ায়) তাঁর উপর বিশ্বাসী ছিলে। আর মুনাফিক অথবা মুরতাব (সন্দেহ পোষণকারী) ফাতিমাহ বলেন, আসমা কোনটি বলেছিলেন, আমি ঠিক মনে করতে পারছি না- বলবে, আমি কিছুই জানি না। মানুষকে (তাঁর সম্পর্কে) যা বলতে শুনেছি, আমিও তাই বলেছি। (১৮৪, ৯২২, ১০৫৩, ১০৫৪, ১০৬১, ১২৩৫, ১৩৭৩, ২৫১৯, ২৫২০, ৭২৮৭; মুসলিম ১০/২ হাঃ ৯০৫, আহমাদ ২৬৯৯১) (আধুনিক প্রকাশনীঃ ৮৬, ইসলামিক ফাউন্ডেশনঃ ৮৬)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 87,
			"arabicnumber": 87,
			"text": "মালিক ইবনুল হুওয়াইরিস (রাযি.) বলেন, নবী (সঃ) আমাদের বলেছিলেন, তোমরা তোমাদের গোত্রের নিকট ফিরে যাও এবং তাদেরকে শিক্ষা দাও। ৮৭. আবূ জামরাহ (রহঃ) হতে বর্ণিত। তিনি বলেন, আমি ইবনু ‘আব্বাস (রাযি.) ও লোকদের মধ্যে ভাষান্তরের কাজ করতাম। একদা ইবনু ‘আব্বাস (রাযি.) বললেন, ‘আবদুল কায়স গোত্রের প্রতিনিধি দল নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট আসলে তিনি বললেনঃ তোমরা কোন্ প্রতিনিধি দল? অথবা বললেনঃ তোমরা কোন্ গোত্রের? তারা বলল, ‘রাবী‘আহ গোত্রের। তিনি বললেনঃ ‘স্বাগতম। এ গোত্রের প্রতি অথবা এ প্রতিনিধি দলের প্রতি, এরা কোনরূপ অপদস্থ ও লাঞ্ছিত না হয়েই এসেছে। তারা বলল, ‘আমরা বহু দূর হতে আপনার নিকট এসেছি। আর আমাদের ও আপনার মধ্যে রয়েছে কাফিরদের এই ‘মুযার’ গোত্রের বাস। আমরা নিষিদ্ধ মাস ব্যতীত আপনার নিকট আসতে সক্ষম নই। সুতরাং আমাদের এমন কিছু নির্দেশ দিন, যা আমাদের পশ্চাতে যারা রয়েছে তাদের নিকট পৌঁছাতে এবং তার ওয়াসীলায় আমরা জান্নাতে প্রবেশ করতে পারি।’ তখন তিনি তাদের চারটি কাজের নির্দেশ দিলেন এবং চারটি কাজ থেকে নিষেধ করলেন। তাদের এক আল্লাহর উপর বিশ্বাস স্থাপনের আদেশ করলেন। তিনি বললেনঃ এক আল্লাহর উপর বিশ্বাস স্থাপন কীরূপে হয় জান? তারা বললঃ ‘আল্লাহ্ ও তাঁর রাসূলই ভাল জানেন।’ তিনি বললেনঃ ‘তা হল এ সাক্ষ্য দেয়া যে, আল্লাহ্ ব্যতীত প্রকৃত কোন উপাস্য নেই এবং মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আল্লাহর রাসূল, সালাত প্রতিষ্ঠা করা, যাকাত আদায় করা এবং রমাযান-এর সিয়াম পালন করা আর তোমরা গনীমাতের মাল থেকে এক-পঞ্চমাংশ দান করবে।’ আর তাদের নিষেধ করলেন শুকনো কদুর খোল, সবুজ কলস এবং আলকাতরা দ্বারা রঙ করা পাত্র ব্যবহার করতে। শু‘বা বলেন, কখনও (আবূ জামরা) খেজুর গাছ থেকে তৈরি পাত্রের কথাও বলেছেন আবার তিনি কখনও -এর স্থলে বলেছেন। রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমরা এগুলো মনোযোগ সহকারে স্মরণ রাখ এবং তোমাদের পশ্চাতে যারা রয়েছে তাদের নিকট পৌঁছে দাও। (৫৩) (আধুনিক প্রকাশনীঃ ৮৭, ইসলামিক ফাউন্ডেশনঃ ৮৭)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 88,
			"arabicnumber": 88,
			"text": "‘উকবাহ ইবনুল হারিস (রাযি.) বর্ণনা করেন, তিনি আবূ ইহাব ইবনু ‘আযীয (রাযি.)-এর কন্যাকে বিয়ে করলে তাঁর নিকট জনৈকা স্ত্রীলোক এসে বলল, আমি ‘উকবাহ (রাযি.)-কে এবং সে যাকে বিয়ে করেছে তাকে (আবূ ইহাবের কন্যাকে) দুধ পান করিয়েছি। ‘উকবাহ তাকে বললেন আমি জানি না তুমি আমাকে দুধ পান করিয়েছ, আর (ইতোপূর্বে) তুমি আমাকে একথা জানাও নি। অতঃপর তিনি মদিনা্য় আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট গেলেন এবং তাঁকে জিজ্ঞেস করলেন। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ এ কথার পর তুমি কীভাবে তার সঙ্গে সংসার করবে? অতঃপর ‘উকবাহ তাঁর স্ত্রীকে আলাদা করে দিলেন এবং সে মহিলা অন্য স্বামীর সঙ্গে বিবাহ বন্ধনে আবদ্ধ হল। (২০৫২, ২৬৪০, ২৬৫৯, ২৬৬০, ৫১০৪) (আধুনিক প্রকাশনীঃ ৮৮, ইসলামিক ফাউন্ডেশনঃ ৮৮)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 89,
			"arabicnumber": 89,
			"text": "‘উমার (রাযি.) হতে বর্ণিত। তিনি বলেনঃ আমি ও আমার এক আনসারী প্রতিবেশী বনি উমাইয়াহ ইবনু যায়দের মহল্লায় বাস করতাম। এ মহল্লাটি ছিল মদিনার উঁচু এলাকায় অবস্থিত। আমরা দু’জনে পালাক্রমে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট উপস্থিত হতাম। তিনি একদিন আসতেন আর আমি একদিন আসতাম। আমি যেদিন আসতাম, সেদিনের ওয়াহী প্রভৃতির খবর নিয়ে তাঁকে পৌঁছে দিতাম। আর তিনি যেদিন আসতেন সেদিন তিনিও তাই করতেন। অতঃপর একদা আমার আনসারী সাথী তাঁর পালার দিন আসলেন এবং (সেখান থেকে ফিরে) আমার দরজায় খুব জোরে জোরে আঘাত করতে লাগলেন। (আমার নাম নিয়ে) বলতে লাগলেন, তিনি কি এখানে আছেন? আমি ঘাবড়ে গিয়ে তাঁর দিকে গেলাম। তিনি বললেন, এক বিরাট ঘটনা ঘটে গেছে [আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর স্ত্রীগণকে তালাক দিয়েছেন]। আমি তখনি (আমার কন্যা) হাফসাহ (রাযি.)-এর নিকট গেলাম। তিনি তখন কাঁদছিলেন। আমি বললাম, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কি তোমাদের তালাক দিয়ে দিয়েছেন? তিনি বললেন, ‘আমি জানি না।’ অতঃপর আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট গেলাম এবং দাঁড়িয়ে থেকেই বললামঃ আপনি কি আপনার স্ত্রীদের তালাক দিয়েছেন? জবাবে তিনি বললেনঃ ‘না।’ আমি তখন বললাম ‘আল্লাহ আকবার’। (২৪৬৮, ৪৯১৩, ৪৯১৫, ৫১৯১, ৫২১৮, ৫৮৪৩, ৭২৫৬, ৭২৬৩) (আধুনিক প্রকাশনীঃ ৮৯, ইসলামিক ফাউন্ডেশনঃ ৮৯)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 90,
			"arabicnumber": 90,
			"text": "আবূ মাস‘ঊদ আনসারী (রাযি.) থেকে বর্ণিত, তিনি বলেন, একদা জনৈক ব্যক্তি বলল, ‘হে আল্লাহর রাসূল! আমি সালাতে (জামা‘আতে) শামিল হতে পারি না। কারণ অমুক ব্যক্তি আমাদের নিয়ে খুব দীর্ঘ সালাত আদায় করেন। [আবূ মাস‘ঊদ (রাযি.) বলেন,] আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে কোন নাসীহাতের মাজলিসে সেদিনের তুলনায় অধিক রাগান্বিত হতে দেখিনি। (রাগত স্বরে) তিনি বললেনঃ হে লোক সকল! তোমরা মানুষের মধ্যে বিরক্তির সৃষ্টি কর। অতএব যে লোকদের নিয়ে সালাত আদায় করবে সে যেন সংক্ষেপ করে। কারণ তাদের মধ্যে রোগী, দুর্বল ও কর্মব্যস্ত লোকও থাকে। (৭০২, ৭০৪, ৬১১০, ৭১৫৯) (আধুনিক প্রকাশনীঃ ৯০, ইসলামিক ফাউন্ডেশনঃ ৯০)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 91,
			"arabicnumber": 91,
			"text": "যায়দ ইবনু খালিদ আল-জুহানী (রাযি.) হতে বর্ণিত। জনৈক ব্যক্তি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে কুড়িয়ে পাওয়া জিনিস সম্পর্কে জিজ্ঞেস করলে তিনি বললেনঃ তার বাঁধনের রশি অথবা বললেন, থলে-ঝুলি ভাল করে চিনে রাখ। অতঃপর এক বছর পর্যন্ত তার ঘোষণা দিতে থাক। তারপর (মালিক পাওয়া না গেলে) তুমি তা ব্যবহার কর। অতঃপর যদি এর প্রাপক আসে তবে তাকে তা দিয়ে দেবে। সে বলল, ‘হারানো উটের ব্যাপারে কী করতে হবে?’ এ কথা শুনে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এমন রাগ করলেন যে, তাঁর গাল দু’টো লাল হয়ে গেল। অথবা বর্ণণাকারী বলেন, তাঁর মুখমন্ডল লাল হয়ে গেল। তিনি বললেনঃ ‘উট নিয়ে তোমার কী হয়েছে? তার তো আছে পানির মশক ও শক্ত পা। পানির নিকট যেতে পারে এবং গাছ খেতে পারে। কাজেই তাকে ছেড়ে দাও এমন সময়ের মধ্যে তার মালিক তাকে পেয়ে যাবে।’ সে বলল, ‘হারানো ছাগল পাওয়া গেলে?’ তিনি বললেন, ‘সেটি তোমার হবে, নাহলে তোমার ভাইয়ের, না হলে বাঘের।’ (২৩৭২, ২৪২৭, ২৪২৮, ২৪২৯, ২৪৩৬, ২৪৩৮, ৫২৯২, ৬১১২) (আধুনিক প্রকাশনীঃ ৯১, ইসলামিক ফাউন্ডেশনঃ ৯১)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 92,
			"arabicnumber": 92,
			"text": "আবূ মূসা (রাযি.) হতে বর্ণিত। তিনি বলেন, একদা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে কয়েকটি অপছন্দনীয় বিষয় সম্পর্কে জিজ্ঞেস করা হল। প্রশ্নের সংখ্যা অধিক হয়ে যাওয়ায় তখন তিনি রেগে গিয়ে লোকদেরকে বললেনঃ ‘তোমরা আমার নিকট যা ইচ্ছা প্রশ্ন কর।’ জনৈক ব্যক্তি বলল, ‘আমার পিতা কে?’ তিনি বললেনঃ ‘তোমার পিতা হুযাফাহ।’ আর এক ব্যক্তি দাঁড়িয়ে বলল, ‘হে আল্লাহর রাসূল! আমার পিতা কে?’ তিনি বললেনঃ ‘তোমার পিতা হল শায়বার দাস সালিম।’ তখন ‘উমার (রাযি.) আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর চেহারার অবস্থা দেখে বললেনঃ ‘হে আল্লাহর রাসূল! আমরা মহিমান্বিত আল্লাহর নিকট তওবা করছি।’ (৭২৯১; মুসলিম ৪৩/৩৭ হাঃ ২৩৬০) (আধুনিক প্রকাশনীঃ ৯২, ইসলামিক ফাউন্ডেশনঃ ৯২)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 93,
			"arabicnumber": 93,
			"text": "আনাস ইবনু মালিক (রাযি.) হতে বর্ণিত। একদা আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বের হলেন। তখন ‘আবদুল্লাহ্ ইবনু হুযাফাহ দাঁড়িয়ে বললেন, ‘আমার পিতা কে?’ তিনি বললেনঃ ‘তোমার পিতা হুযাফাহ।’ অতঃপর তিনি বারবার বলতে লাগলেন, ‘তোমরা আমাকে প্রশ্ন কর।’ ‘উমার (রাযি.) তখন জানু পেতে বসে বললেনঃ ‘আমরা আল্লাহকে প্রতিপালক হিসেবে, ইসলামকে দ্বীন হিসেবে এবং মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে নবী হিসেবে সন্তুষ্ট চিত্তে গ্রহণ করে নিয়েছি।’ তিনি এ কথা তিনবার বললেন। এতে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নীরব হলেন। (৫৪০, ৭৪৯, ৪৬২১, ৬৩৬২, ৬৪৬৮, ৬৪৮৬, ৭০৮৯, ৭০৯০, ৭০৯১, ৭২৯৪, ৭২৯৫; মুসলিম ৪৩/৩৭ হাঃ ২৩৫৯, আহমাদ ১২৬৫৯) (আধুনিক প্রকাশনীঃ ৯৩, ইসলামিক ফাউন্ডেশনঃ ৯৩)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 94,
			"arabicnumber": 94,
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 95,
			"arabicnumber": 95,
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 96,
			"arabicnumber": 96,
			"text": "‘আবদুল্লাহ ইবনু ‘আমর (রাযি.) হতে বর্ণিত। তিনি বলেন, কোন এক সফরে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের পিছনে পড়ে গেলেন। পরে তিনি আমাদের নিকট পৌঁছলেন, এদিকে আমরা (আসরের) সালাত আদায় করতে বিলম্ব করে ফেলেছিলাম এবং আমরা উযূ করছিলাম। আমরা আমাদের পা কোনমতে পানি দ্বারা ভিজিয়ে নিচ্ছিলাম। তিনি উচ্চস্বরে বললেনঃ পায়ের গোড়ালিগুলোর (শুকনো থাকার) জন্য জাহান্নামের ‘আযাব রয়েছে। তিনি দু’বার বা তিনবার এ কথা বললেন। (৬০) (আধুনিক প্রকাশনীঃ ৯৫, ইসলামিক ফাউন্ডেশনঃ ৯৬)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 97,
			"arabicnumber": 97,
			"text": "আবূ বুরদাহ, তিনি তাঁর পিতা হতে বর্ণনা করে তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তিন ধরনের লোকের জন্য দুটি পুণ্য রয়েছেঃ (১) আহলে কিতাব- যে ব্যক্তি তার নবীর উপর ঈমান এনেছে এবং মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর উপরও ঈমান এনেছে। (২) যে ক্রীতদাস আল্লাহর হাক আদায় করে এবং তার মালিকের হাকও (আদায় করে)। (৩) যার বাঁদী ছিল, যার সাথে সে মিলিত হত। তারপর তাকে সে সুন্দরভাবে আদব-কায়দা শিক্ষা দিয়েছে এবং ভালভাবে দ্বীনি ইল্ম শিক্ষা দিয়েছে, অতঃপর তাকে আযাদ করে বিয়ে করেছে; তার জন্য দু’টি পুণ্য রয়েছে। অতঃপর বর্ণনাকারী ‘আমির (রহ.) (তাঁর ছাত্রকে) বলেন, তোমাকে কোন কিছুর বিনিময় ব্যতীতই হাদীসটি শিক্ষা দিলাম, অথচ পূর্বে এর চেয়ে ছোট হাদীসের জন্যও লোকেরা (দূর-দূরান্ত থেকে) সওয়ার হয়ে মদিনা্য় আসত। (২৫৪৪, ২৫৪৭, ২৫৫১, ৩০১১, ৩৪৪৬, ৫০৮৩; মুসলিম ১/৭০ হাঃ ১৫৪, আহমাদ ১৯৭৩২) (আধুনিক প্রকাশনীঃ ৯৬, ইসলামিক ফাউন্ডেশনঃ ৯৭)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 98,
			"arabicnumber": 98,
			"text": "ইবনু ‘আব্বাস (রাযি.) হতে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে সাক্ষী রেখে বলছি, কিংবা পরবর্তী বর্ণনাকারী ‘আত্বা (রহ.) বলেন, আমি ইবনু ‘আব্বাসকে সাক্ষী রেখে বলছি যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (ঈদের দিন পুরুষের কাতার থেকে) বের হলেন আর তাঁর সঙ্গে ছিলেন বিলাল (রাযি.)। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ধারণা করলেন যে, দূরে থাকার জন্য তাঁর নাসীহাত মহিলাদের নিকট পৌঁছেনি। ফলে তিনি তাঁদের নাসীহাত করলেন এবং দান-খায়রাত করার উপদেশ দিলেন। তখন মহিলারা কানের দুল ও হাতের আংটি দান করতে লাগলেন। আর বিলাল (রাযি.) সেগুলো তাঁর কাপড়ের প্রান্তে গ্রহণ করতে লাগলেন। ইসমা‘ঈল (রহ.) ‘আত্বা (রহ.) সূত্রে বলেন যে, ইবনু ‘আব্বাস (রাযি.) বলেনঃ আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে সাক্ষী রেখে বলছি। (৮৬৩, ৯৬২, ৯৬৪, ৯৭৫, ৯৭৭, ৯৭৯, ৯৮৯, ১৪৩১, ১৪৪৯, ৪৮৯৫, ৫২৪৯, ৫৮৮০, ৫৮৮১, ৫৮৮৩, ৭৩২৫; মুসলিম ৮/১ হাঃ ৮৮৪, আহমাদ ৩০৬৪) (আধুনিক প্রকাশনীঃ ৯৭, ইসলামিক ফাউন্ডেশনঃ ৯৮)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 99,
			"arabicnumber": 99,
			"text": "আবূ হুরাইরাহ (রাযি.) হতে বর্ণিত। তিনি বলেনঃ একদা আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে প্রশ্ন করা হলঃ হে আল্লাহর রাসূল! কিয়ামতের দিন আপনার সুপারিশ লাভের ব্যাপারে কে সবচেয়ে অধিক সৌভাগ্যবান হবে? আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আবূ হুরাইরা! আমি মনে করেছিলাম, এ বিষয়ে তোমার পূর্বে আমাকে আর কেউ জিজ্ঞেস করবে না। কেননা আমি দেখেছি হাদীসের প্রতি তোমার বিশেষ লোভ রয়েছে। কিয়ামতের দিন আমার শাফা‘আত লাভে সবচেয়ে সৌভাগ্যবান হবে সেই ব্যক্তি যে একনিষ্ঠচিত্তে لآ إِلَهَ إِلاَّ اللهُ (আল্লাহ ব্যতীত প্রকৃত কোন ইলাহ নেই) বলে। (৬৫৭০) (আধুনিক প্রকাশনীঃ ৯৮, ইসলামিক ফাউন্ডেশনঃ ৯৯)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 100,
			"arabicnumber": 100,
			"text": "وَكَتَبَ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ إِلَى أَبِي بَكْرِ بْنِ حَزْمٍ انْظُرْ مَا كَانَ مِنْ حَدِيثِ رَسُولِ اللهِ صلى الله عليه وسلم فَاكْتُبْهُ فَإِنِّي خِفْتُ دُرُوسَ الْعِلْمِ وَذَهَابَ الْعُلَمَاءِ وَلاَ تَقْبَلْ إِلاَّ حَدِيثَ النَّبِيِّ صلى الله عليه وسلم وَلْتُفْشُوا الْعِلْمَ وَلْتَجْلِسُوا حَتَّى يُعَلَّمَ مَنْ لاَ يَعْلَمُ فَإِنَّ الْعِلْمَ لاَ يَهْلِكُ حَتَّى يَكُونَ سِرًّا حَدَّثَنَا الْعَلاَءُ بْنُ عَبْدِ الْجَبَّارِ قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُسْلِمٍ عَنْ عَبْدِ اللهِ بْنِ دِينَارٍ بِذَلِكَ يَعْنِي حَدِيثَ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ إِلَى قَوْلِهِ ذَهَابَ الْعُلَمَاءِ ‘উমার ইবনু আবদুল ‘আযীয (রহ.) আবূ বাকর ইবনু হাযম (রহ.)-এর নিকট এক চিঠিতে লিখেনঃ অনুসন্ধান কর, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর যে হাদীস পাও তা লিপিবদ্ধ করে নাও। আমি ধর্মীয় জ্ঞান লোপ পাওয়ার এবং আলিমদের বিদায় নেয়ার ভয় করছি এবং জেনে রাখ, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর হাদীস ব্যতীত অন্য কিছুই গ্রহণ করা হবে না এবং প্রত্যেকের উচিত ধর্মীয় জ্ঞানের প্রচার-প্রসার ঘটানো আর তারা যেন একসাথে বসে (ধর্মীয় জ্ঞানের চর্চা করে), যাতে যে না জানে সে শিক্ষা গ্রহণ করতে পারে। কারণ জ্ঞান গোপন না হওয়া পর্যন্ত বিলুপ্ত হবে না। ‘আলা’ ইবনু ‘আবদুল জাববার (রহ.).... ‘আবদুল্লাহ্ ইবনু দ্বীনার (রহ.)-এর সূত্রে বর্ণিত রিওয়ায়াতে ‘উমার ইবনু ‘আবদুল-‘আযীয এর উপরোক্ত হাদীসে ‘বিজ্ঞ ব্যক্তিদের বিদায় নেয়া’ পর্যন্ত বর্ণিত আছে। (আধুনিক প্রকাশনীঃ অনুচ্ছেদ পৃঃ ৮৫, ইসলামিক ফাউন্ডেশনঃ ১০০) ১০০. ‘আবদুল্লাহ ইবনু ‘আমর ইবনুল ‘আস (রাযি.) হতে বর্ণিত তিনি বলেন, আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে বলতে শুনেছি, আল্লাহ তাঁর বান্দাদের অন্তর থেকে ‘‘ইল্ম উঠিয়ে নেন না, কিন্তু দ্বীনের আলিমদের উঠিয়ে নেয়ার ভয় করি। যখন কোন আলিম অবশিষ্ট থাকবে না তখন লোকেরা মূর্খদেরকেই নেতা বানিয়ে নিবে। তাদের জিজ্ঞেস করা হলে না জানলেও ফাতাওয়া প্রদান করবে। ফলে তারা নিজেরাও পথভ্রষ্ট হবে, এবং অন্যকেও পথভ্রষ্ট করবে। ফিরাবরী বলেন, ........ জরীর হিশামের নিকট হতে অনুরূপ হাদীস বর্ণনা করেছেন। (৭৩০৭; মুসলিম ৪৭/৪, হাঃ ২৬৭৩, আহমাদ ৬৫২১) (আধুনিক প্রকাশনীঃ ৯৯, ইসলামিক ফাউন্ডেশনঃ ১০১)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 101,
			"arabicnumber": 101,
			"text": "আবূ সা‘ঈদ খুদরী (রযি.) হতে বর্ণিত। তিনি বলেনঃ নারীরা একদা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে বলল, পুরুষেরা আপনার নিকট আমাদের চেয়ে প্রাধান্য বিস্তার করে আছে। তাই আপনি নিজে আমাদের জন্য একটি দিন নির্ধারিত করে দিন। তিনি তাদের বিশেষ একটি দিনের অঙ্গীকার করলেন; সে দিন তিনি তাদের সঙ্গে সাক্ষাৎ করলেন এবং তাদের নাসীহাত করলেন ও নির্দেশ দিলেন। তিনি তাদের যা যা বলেছিলেন, তার মধ্যে একথাও ছিল যে, তোমাদের মধ্যে যে স্ত্রীলোক তিনটি সন্তান পূর্বেই পাঠাবে, তারা তার জন্য জাহান্নামের প্রতিবন্ধক হয়ে দাঁড়াবে। তখন জনৈক স্ত্রীলোক বলল, আর দু’টি পাঠালে? তিনি বললেনঃ দু’টি পাঠালেও। (১২৪৯,৭৩১০; মুসলিম ৪৫/৪৭, হাঃ ২৬৩৩, আহমাদ ১১২৯৬) (আধুনিক প্রকাশনীঃ ১০০, ইসলামিক ফাউন্ডেশনঃ ১০২)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 102,
			"arabicnumber": 102,
			"text": "আবূ সা‘ঈদ (রাযি.) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে অনুরূপ বর্ণনা করেছেন। আবদুর রহমান আল-আসবাহানী (রহ.).... আবূ হুরাইরাহ (রাযি.) হতে বর্ণিত। তিনি বলেনঃ এমন তিনজন, যারা সাবালকত্বে পৌঁছেনি। (১২৫০ দ্রষ্টব্য) (আধুনিক প্রকাশনীঃ ১০০ শেষাংশ, ইসলামিক ফাউন্ডেশনঃ ১০৩)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 103,
			"arabicnumber": 103,
			"text": "ইবনু আবূ মুলাইকাহ (রাযি.) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর স্ত্রী ‘আয়িশাহ (রাযি.) কোন কথা শুনে না বুঝলে বার বার প্রশ্ন করতেন। একদা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, ‘‘(কিয়ামতের দিন) যার কাছ থেকে হিসেব নেয়া হবে তাকে শাস্তি দেয়া হবে।’’ ‘আয়িশাহ (রাযি.) বলেনঃ আমি জিজ্ঞেস করলাম, আল্লাহ্ তা‘আলা কি ইরশাদ করেননি, فَسَوْفَ يُحَاسَبُ حِسَابًا يَسِيرًا তার হিসাব-নিকাশ সহজেই নেয়া হবে)- (সূরাহ্ ইনশিক্বাক ৮৪/৮)। তখন তিনি বললেনঃ তা কেবল হিসেব প্রকাশ করা। কিন্তু যার হিসাব পুঙ্খানুপুঙ্খরুপে নেয়া হবে সে ধ্বংসপ্রাপ্ত হবে। (৪৯৩৯, ৬৫৩৬, ৬৫৩৭; মুসলিম ৫১/১৮, হাঃ ২৮৭৬, আহমাদ ২৪২৫৫) (আধুনিক প্রকাশনীঃ ১০১, ইসলামিক ফাউন্ডেশনঃ ১০৪)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 104,
			"arabicnumber": 104,
			"text": "قَالَهُ ابْنُ عَبَّاسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم. ইবনু ‘আব্বাস (রাযি.) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে তা বর্ণনা করেন। ১০৪. আবূ শুরায়হ্ (রাযি.) হতে বর্ণিত যে, তিনি ‘আমর ইবনু সা‘ঈদ (মদিনার গভর্নর)-কে বললেন, যখন তিনি মক্কায় সেনাবাহিনী পাঠিয়েছিলেন- ‘হে আমাদের নেতা! আমাকে অনুমতি দিলে আপনাকে এমন একটি হাদীস শুনাতে পারি যেটা মক্কা বিজয়ের পরের দিন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছিলেন। আমার দু’ কান তা শ্রবণ করেছে, আমার হৃদয় তা আয়ত্ত রেখেছে, আর আমার চোখ দু’টো তা দেখেছে। তিনি আল্লাহর হাম্দ ও সানা বর্ণনা করে বললেনঃ মক্কাকে আল্লাহ্ হারাম করেছেন, কোন মানুষ তাকে হারাম করেনি। তাই যে ব্যক্তি আল্লাহ্ ও আখিরাতে বিশ্বাস রাখে তার জন্য সেখানে রক্তপাত করা, সেখানকার গাছ কাটা বৈধ নয়। কেউ যদি আল্লাহর রাসূলের (সেখানকার) লড়াইকে দলীল হিসেবে পেশ করে তবে তোমরা বলে দাও, আল্লাহ্ তা‘আলা তাঁর রাসূলকে এর অনুমতি দিয়েছিলেন; কিন্তু তোমাদেরকে তা দেননি। আমাকেও সে দিনের কিছু সময়ের জন্য অনুমতি দিয়েছিলেন। অতঃপর পূর্বের মতই আজ আবার একে তার নিষিদ্ধ হবার মর্যাদা ফিরিয়ে দেয়া হয়েছে। উপস্থিতগণ যেন অনুপস্থিতদের নিকট (এ বাণী) পৌঁছে দেয়।’ অতঃপর আবূ শুরায়হ্ (রাযি.)-কে প্রশ্ন করা হল, ‘আপনার এ হাদীস শুনে ‘আমর কী বললেন?’ [আবূ শুরায়হ্ (রাযি.) উত্তর দিলেন] তিনি বললেনঃ ‘হে আবূ শুরায়হ্! (এ বিষয়ে) আমি তোমার চেয়ে অধিক জানি। মক্কা কোন বিদ্রোহীকে, কোন খুনের পলাতক আসামীকে এবং কোন চোরকে আশ্রয় দেয় না।’ (১৮৩২,৪২৯৫; মুসলিম ১৫/৮২, হাঃ ১৩৫৪, আহমাদ ১৬৩৭৩, ২৭২৩৪) (আধুনিক প্রকাশনীঃ ১০২, ইসলামিক ফাউন্ডেশনঃ ১০৫)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 105,
			"arabicnumber": 105,
			"text": "আবূ বাকরাহ (রাযি.) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর কথা উল্লেখ করে বলেন যে, তিনি বলেছেনঃ তোমাদের জান তোমাদের মাল বর্ণনাকারী মুহাম্মাদ (রহ.) বলেন, ‘আমার মনে হয়, তিনি বলেছিলেনঃ এবং তোমাদের মান-সম্মান (অন্য মুসলিমের জন্য) এ শহরে এ দিনের মতই মর্যাদা সম্পন্ন। শোন, (আমার এ বাণী যেন) তোমাদের মধ্যে উপস্থিত ব্যক্তি অনুপস্থিত ব্যক্তির নিকট পৌঁছে দেয়। বর্ণনাকারী মুহাম্মাদ (রহ.) বলেনঃ আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সত্য বলেছেন, তা-ই হয়েছে। তারপর আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দু’ দু’বার করে বললেন, হে লোক সকল! ‘আমি কি পৌঁছে দিয়েছি?’ (৬৭) (আধুনিক প্রকাশনীঃ ১০৩, ইসলামিক ফাউন্ডেশনঃ ১০৬)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 106,
			"arabicnumber": 106,
			"text": "‘আলী (রাযি.) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা আমার উপর মিথ্যারোপ করো না। কারণ আমার উপর যে মিথ্যারোপ করবে সে জাহান্নামে যাবে। (মুসলিম মুকাদ্দামা, দ্বিতীয় অধ্যায়, হাঃ ২) (আধুনিক প্রকাশনীঃ ১০৪, ইসলামিক ফাউন্ডেশনঃ ১০৭)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 107,
			"arabicnumber": 107,
			"text": "‘আবদুল্লাহ্ ইবনু’য্-যুবায়র (রাযি.) হতে বর্ণিত। তিনি বলেনঃ আমি আমার পিতা যুবায়রকে বললামঃ আমি তো আপনাকে অমুক অমুকের মত আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর হাদীস বর্ণনা করতে শুনি না। তিনি বললেনঃ ‘জেনে রাখ, আমি তাঁর থেকে দূরে থাকিনি, কিন্তু আমি তাঁকে বলতে শুনেছি, যে আমার উপর মিথ্যারোপ করবে সে যেন জাহান্নামে তার ঠিকানা বানিয়ে নিবে (এজন্য হাদীস বর্ণনা করি না)।’ (মুসলিম মুকাদ্দামা, দ্বিতীয় অধ্যায়, হাঃ ৩) (আধুনিক প্রকাশনীঃ ১০৫, ইসলামিক ফাউন্ডেশনঃ ১০৮)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 108,
			"arabicnumber": 108,
			"text": "আনাস (রাযি.) হতে বর্ণিত। তিনি বলেনঃ এ কথাটি তোমাদের নিকট বহু হাদীস বর্ণনা করতে প্রতিবন্ধকতা হয়ে দাঁড়ায় যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ইচ্ছাকৃতভাবে আমার উপর মিথ্যারোপ করে সে যেন জাহান্নামে তার ঠিকানা বানিয়ে নেয়। (আধুনিক প্রকাশনীঃ ১০৬, ইসলামিক ফাউন্ডেশনঃ ১০৯)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 109,
			"arabicnumber": 109,
			"text": "সালামাহ ইবনু আক্ওয়া‘ (রাযি.) হতে বর্ণিত। তিনি বলেনঃ আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে বলতে শুনেছি, ‘যে ব্যক্তি আমার উপর এমন কথা আরোপ করে যা আমি বলিনি, সে যেন জাহান্নামে তার ঠিকানা বানিয়ে নেয়।’ (আধুনিক প্রকাশনীঃ ১০৭, ইসলামিক ফাউন্ডেশনঃ ১১০)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 110,
			"arabicnumber": 110,
			"text": "আবূ হুরাইরাহ (রাযি.) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ‘আমার নামে তোমরা নাম রেখ; কিন্তু আমার উপনামে (কুনিয়াতে) তোমরা নাম রেখ না। আর যে আমাকে স্বপ্নে দেখে সে ঠিক আমাকেই দেখে। কারণ শয়তান আমার আকৃতির ন্যায় আকৃতি ধারণ করতে পারে না। যে ইচ্ছা করে আমার উপর মিথ্যারোপ করে সে যেন জাহান্নামে তার আসন বানিয়ে নেয়।’ (৩৫৩৯, ৬১৮৮, ৬১৯৭, ৬৯৯৩; মুসলিম মুকাদ্দামা, দ্বিতীয় অধ্যায়, হাঃ ৪) (আধুনিক প্রকাশনীঃ ১০৮, ইসলামিক ফাউন্ডেশনঃ ১১১)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 111,
			"arabicnumber": 111,
			"text": "আবূ জুহাইফাহ (রাযি.) হতে বর্ণিত। তিনি বলেনঃ আমি ‘আলী (রাযি.)-কে বললাম, আপনাদের নিকট কি কিছু লিপিবদ্ধ আছে? তিনি বললেনঃ ‘না, শুধুমাত্র আল্লাহর কিতাব রয়েছে, আর একজন মুসলিমকে যে জ্ঞান দান করা হয় সেই বুদ্ধি ও বিবেক। এছাড়া কিছু এ সহীফাতে লিপিবদ্ধ রয়েছে।’ তিনি [আবূ জুহাইফাহ (রাযি.)] বলেন, আমি বললাম, এ সহীফাটিতে কী আছে? তিনি বললেন, ‘ক্ষতিপূরণ ও বন্দী মুক্তির বিধান, আর এ বিধানটিও যে, ‘মুসলিমকে কাফির হত্যার বিনিময়ে হত্যা করা যাবে না।’ (১৮৭০, ৩০৪৭, ৩১৭২, ৩১৭৯, ৬৭৫৫, ৬৯০৩, ৬৯১৫, ৭৩০০ দ্রষ্টব্য) (আধুনিক প্রকাশনীঃ ১০৯, ইসলামিক ফাউন্ডেশনঃ ১১২)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 112,
			"arabicnumber": 112,
			"text": "আবূ হুরাইরাহ (রাযি.) হতে বর্ণিত যে, মক্কা্ বিজয়কালে খুযা‘আহ গোত্র লায়স গোত্রের জনৈক ব্যক্তিকে হত্যা করল। এ হত্যা ছিল তাদের এক নিহত ব্যক্তির প্রতিশোধ, যাকে ইতোপূর্বে লায়স গোত্রের লোক হত্যা করেছিল। তারপর এ খবর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট পৌঁছল। তিনি তাঁর উটের উপর আরোহণ করে ভাষণ দিলেন, তিনি বলেনঃ আল্লাহ্ তা‘আলা মক্কা্ হতে ‘হত্যা’-কে কিংবা ‘হাতী’-কে রোধ করেছেন। (২৪৩৪, ৬৮৮০ দ্রষ্টব্য) ইমাম বুখারী (রহ.) বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ‘হত্যা’ বলেছেন না ‘হাতী’ বলেছেন এ ব্যাপারে বর্ণনাকারী আবূ নু‘আয়ম সন্দেহ পোষণ করেন। অন্যরা শুধু ‘হাতী’ শব্দ উল্লেখ করেছেন। অবশ্য মক্কাবাসীদের উপর আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এবং মু’মিনগণকে (যুদ্ধের মাধ্যমে) বিজয়ী করা হয়েছে। জেনে রাখ, আমার পূর্বে কারো জন্য মক্কাকে হালাল করা হয়নি এবং আমার পরেও হালাল হবে না। জেনে রাখ, তাও আমার জন্য দিনের কিছু সময়ের জন্য বৈধ করা হয়েছিল। আরো জেনে রাখ যে, আমার এই কথা বলার মুহূর্তে আবার তা অবৈধ হয়ে গেছে। সেখানকার কোন কাঁটা কিংবা গাছ কাটা যাবে না এবং সেখানে পড়ে থাকা কোন বস্তু কুড়িয়ে নেয়া যাবে না। তবে ঘোষণা দেয়ার জন্য তা নিতে পারবে। আর কেউ নিহত হলে তার আপনজনদের জন্য দু’টি ব্যবস্থার যে কোন একটি গ্রহণের এখতিয়ার আছে। হয় তার ‘রক্তপণ নিবে নয় ‘কিসাসের ফায়সালা’ গ্রহণ করবে। অতঃপর ইয়ামানবাসী জনৈক ব্যক্তি এসে বলল, হে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম! (এ কথাগুলো) আমাকে লিখে দিন। তিনি (সাহাবীদের) বললেনঃ তোমরা অমুকের পিতাকে লিখে দাও। তারপর জনৈক কুরায়শ [‘আব্বাস (রাযি.)] বললেন, ‘হে আল্লাহর রাসূল! গাছপালা কাটার নিষেধাজ্ঞা হতে ইযখির (এক প্রকার লম্বা ঘাষ) বাদ দিন। কারণ তা আমরা আমাদের গৃহে ও কবরে কাজে লাগাই।’ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, ‘ইযখির ব্যতীত, ইযখির ব্যতীত।’ (আধুনিক প্রকাশনীঃ ১১০, ইসলামিক ফাউন্ডেশনঃ ১১৩)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 113,
			"arabicnumber": 113,
			"text": "আবূ হুরাইরাহ (রাযি.) হতে বর্ণিত। তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সাহাবীগণের মধ্যে ‘আবদুল্লাহ্ ইবনু ‘আমর (রাযি.) ব্যতীত আর কারো নিকট আমার চেয়ে অধিক হাদীস নেই। কারণ তিনি লিখতেন, আর আমি লিখতাম না। মা‘মার (রহ.) হাম্মাম (রহ.) সূত্রে আবূ হুরাইরাহ (রাযি.) হতে অনুরূপ বর্ণনা করেছেন। (আধুনিক প্রকাশনীঃ ১১১, ইসলামিক ফাউন্ডেশনঃ ১১৪)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 114,
			"arabicnumber": 114,
			"text": "ইবনু ‘আব্বাস (রাযি.) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর অসুখ যখন বৃদ্ধি পেল তখন তিনি বললেনঃ ‘আমার নিকট লেখার জিনিস নিয়ে এস, আমি তোমাদের এমন কিছু লিখে দিব যাতে পরে তোমরা আর পথভ্রষ্ট হবে না।’ ‘উমার (রাযি.) বললেন, ‘নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর রোগ-যন্ত্রণা প্রবল হয়ে গেছে (এমতাবস্থায় কিছু বলতে বা লিখতে তাঁর কষ্ট হবে)। আর আমাদের নিকট তো আল্লাহর কিতাব আছে, যা আমাদের জন্য যথেষ্ট।’ এতে সাহাবীগণের মধ্যে মতানৈক্য দেখা দিল এবং শোরগোল বেড়ে গেল। তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, ‘তোমরা আমার কাছ থেকে উঠে যাও। আমার নিকট ঝগড়া-বিবাদ করা অনুচিত।’ এ পর্যন্ত বর্ণনা করে ইবনু ‘আব্বাস (রাযি.) (যেখানে বসে হাদীস বর্ণনা করছিলেন সেখান থেকে) এ কথা বলতে বলতে বেরিয়ে এলেন যে, ‘হায় বিপদ, সাংঘাতিক বিপদ! আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এবং তাঁর লেখনীর মধ্যে যা বাধ সেধেছে।’ (৩০৫৩, ৩১৬৮, ৪৪৩১, ৪৪৩২, ৫৬৬৯, ৭৩৬৬ দ্রষ্টব্য) (আধুনিক প্রকাশনীঃ ১১২, ইসলামিক ফাউন্ডেশনঃ ১১৫)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 115,
			"arabicnumber": 115,
			"text": "উম্মু সালামাহ (রাযি.) হতে বর্ণিত। তিনি বলেনঃ এক রাতে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিদ্রা হতে জেগে বলেনঃ সুবহানাল্লাহ্! এ রাতে কতই না বিপদাপদ নেমে আসছে এবং কতই না ভান্ডার উন্মুক্ত করা হচ্ছে! অন্য সব ঘরের নারীদেরকেও জানিয়ে দাও, ‘বহু মহিলা যারা দুনিয়ায় পোশাক পরিহিতা, তারা অখিরাতে হবে বিবস্ত্র।’ (১১২৬, ৩৫৯৯, ৫৮৪৪, ৬২১৮, ৭০৬৯ দ্রষ্টব্য) (আধুনিক প্রকাশনীঃ ১১৩, ইসলামিক ফাউন্ডেশনঃ ১১৬)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 116,
			"arabicnumber": 116,
			"text": "‘আবদুল্লাহ্ ইবনু ‘উমার (রাযি.) হতে বর্ণিত। তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর জীবনের শেষের দিকে আমাদের নিয়ে ‘ইশার সালাত আদায় করলেন। সালাম ফিরানোর পর তিনি দাঁড়িয়ে বললেনঃ তোমরা কি এ রাতের সম্পর্কে জান? বর্তমানে যারা পৃথিবীতে রয়েছে, একশ বছরের মাথায় তাদের কেউ আর অবশিষ্ট থাকবে না। (৫৬৪, ৬০১; মুসলিম ৪৪/৫৩, হাঃ ২৫৩৬) (আধুনিক প্রকাশনীঃ ১১৪, ইসলামিক ফাউন্ডেশনঃ ১১৭)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 117,
			"arabicnumber": 117,
			"text": "ইবনু ‘আব্বাস (রাযি.) হতে বর্ণিত। তিনি বলেন, আমি আমার খালা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর স্ত্রী মায়মূনা বিন্ত হারিস (রাযি.)-এর ঘরে এক রাতে ছিলাম। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সে (পালার) রাতে সেখানে ছিলেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ‘ইশার সালাত আদায় করে তাঁর ঘরে চলে আসলেন এবং চার রাক‘আত সালাত আদায় করে শুয়ে গেলেন। কিছুক্ষণ পর উঠে বললেনঃ বালকটি কি ঘুমিয়ে পড়েছে? বা এরূপ কোন কথা বললেন। অতঃপর (সালাতে) দাঁড়িয়ে গেলেন, আমিও তাঁর বাঁ দিকে গিয়ে দাঁড়ালাম। তিনি আমাকে তাঁর ডান দিকে সরিয়ে এনে পাঁচ রাক‘আত সালাত আদায় করলেন। পরে আরো দু’ রাক‘আত আদায় করলেন। অতঃপর শুয়ে পড়লেন। এমনকি আমি তাঁর নাক ডাকার আওয়াজ শুনতে পেলাম। অতঃপর উঠে তিনি (ফজরের) সালাতের জন্য বের হলেন। (১৩৮, ১৮৩, ৬৯৭, ৬৯৮, ৬৯৯, ৭২৬, ৮৫৯, ১১৯৮, ৪৫৬৯, ৪৫৭০, ৪৫৭১, ৪৫৭২, ৫৯১৯, ৬২১৫, ৬৩১৬, ৭৪৫২ দ্রষ্টব্য) (আধুনিক প্রকাশনীঃ ১১৫, ইসলামিক ফাউন্ডেশনঃ ১১৮)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 118,
			"arabicnumber": 118,
			"text": "আবূ হুরাইরাহ (রাযি.) হতে বর্ণিত। তিনি বলেনঃ লোকে বলে, আবূ হুরাইরাহ (রাযি.) অধিক হাদীস বর্ণনা করে। (জেনে রাখ,) কিতাবে দু’টি আয়াত যদি না থাকত, তবে আমি একটি হাদীসও পেশ করতাম না। অতঃপর তিনি তিলাওয়াত করলেনঃ ‘‘আমি সেসব স্পষ্ট নিদর্শন ও পথ-নির্দেশ অবতীর্ণ করেছি মানুষের জন্য কিতাবে তা বিস্তারিত বর্ণনার পরও যারা তা গোপন রাখে আল্লাহ্ তাদেরকে অভিশাপ দেন এবং অভিশাপকারীগণও তাদেরকে অভিশাপ দেয় কিন্তু যারা তওবা করে এবং আত্মসংশোধন করে এবং প্রকাশ করে দেয় যে, আমি তাদের (ক্ষমার) জন্য ফিরে আসি, আর আমি ক্ষমাশীল, পরম দয়ালু।’’ (সূরাহ্ আল-বাক্বারাহ ২/১৫৯-১৬০)। (প্রকৃত ঘটনা এই যে,) আমার মুহাজির ভাইয়েরা বাজারে কেনাবেচায় এবং আমার আনসার ভাইয়েরা জমা-জমির কাজে মশগুল থাকত। আর আবূ হুরাইরাহ (রাযি.) (অভুক্ত থেকে) তুষ্ট থেকে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সঙ্গে লেগে থাকত। তাই তারা যখন উপস্থিত থাকত না, তখন সে উপস্থিত থাকত এবং তারা যা আয়ত্ত করত না সে তা আয়ত্ত রাখত। (১১৯, ২০৪৭, ২৩৫০, ৩৬৪৮, ৭৩৫৪ দ্রষ্টব্য) (আধুনিক প্রকাশনীঃ ১১৬, ইসলামিক ফাউন্ডেশনঃ ১১৯)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 119,
			"arabicnumber": 119,
			"text": "আবূ হুরাইরাহ (রাযি.) হতে বর্ণিত। তিনি বলেন, আমি বললামঃ ‘হে আল্লাহর রাসূল! আমি আপনার নিকট হতে অনেক হাদীস শুনি কিন্তু ভুলে যাই।’ তিনি বললেনঃ তোমার চাদর মেলে ধর। আমি তা মেলে ধরলাম। তিনি দু’হাত খাবল করে তাতে কিছু ঢেলে দেয়ার মত করে বললেনঃ এটা তোমার বুকের সাথে লাগাও। আমি তা বুকের সাথে লাগালাম। অতঃপর আমি আর কিছুই ভুলে যাইনি। (১১৮) (আধুনিক প্রকাশনীঃ ১১৭, ইসলামিক ফাউন্ডেশনঃ ১২০) ইবরাহীম ইবনুল মুনযির (রহ.).....ইবনু আবূ ফুদায়ক (রহ.) সূত্রে একইরূপ হাদীস বর্ণনা করেন এবং তাতে বলেন যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর হাত দিয়ে সে চাদরের মধ্যে (কিছু) দিলেন। (ইসলামিক ফাউন্ডেশনঃ ১২১)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 120,
			"arabicnumber": 120,
			"text": "আবূ হুরাইরাহ (রাযি.) হতে বর্ণিত। তিনি বলেনঃ আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে দু’পাত্র ‘ইলম আয়ত্ত করে রেখেছিলাম। তার একটি পাত্র আমি বিতরণ করে দিয়েছি। আর অপরটি এমন যে, প্রকাশ করলে আমার কণ্ঠনালী কেটে দেয়া হবে। ‘আবদুল্লাহ্ (রহ.) বলেন, হাদীসে উল্লিখিত الْبُلْعُومُ শব্দের অর্থ খাদ্যনালী। (আধুনিক প্রকাশনীঃ ১১৮, ইসলামিক ফাউন্ডেশনঃ ১২২)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 121,
			"arabicnumber": 121,
			"text": "জারীর (রাযি.) থেকে বর্ণিত যে, বিদায় হাজ্জের সময় নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বললেনঃ তুমি লোকদেরকে চুপ করিয়ে দাও, তারপর তিনি বললেনঃ ‘আমার পরে তোমরা একে অপরের গর্দান কাটাকাটি করে কাফির (এর মত) হয়ে যেও না।’ (৪৪০৫, ৬৮৬৯, ৭০৮০; মুসলিম ১/২৯, হাঃ ৬৫, আহমাদ ১৯২৩৭) (আধুনিক প্রকাশনীঃ ১১৯, ইসলামিক ফাউন্ডেশনঃ ১২৩)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 122,
			"arabicnumber": 122,
			"text": "সা‘ঈদ ইবনু জুবায়র (রাযি.) হতে বর্ণিত। তিনি বলেনঃ আমি ইবনু ‘আব্বাস (রাযি.)-কে বললাম, নাওফ আল-বাকালী দাবী করে যে, মূসা (আ) [যিনি খাযির (আ)-এর সাক্ষাৎ লাভ করেছিলেন তিনি] বনী ইসরাঈলের মূসা নন বরং তিনি অন্য এক মূসা। (একথা শুনে) তিনি বললেনঃ আল্লাহর দুশমন মিথ্যা বলেছে। উবাঈ ইবনু কা’ব (রাযি.) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে আমাদের নিকট বর্ণনা করেছেন, তিনি বলেনঃ মূসা (আ) একদা বনী ইসরাঈলদের মধ্যে বক্তৃতা দিতে দাঁড়ালেন। তখন তাঁকে জিজ্ঞেস করা হয়, সবচেয়ে জ্ঞানী কে? তিনি বললেন, ‘আমি সবচেয়ে জ্ঞানী।’ মহান আল্লাহ্ তাঁকে সতর্ক করে দিলেন। কেননা তিনি ‘ইল্মকে আল্লাহর দিকে সোপর্দ করেন নি। অতঃপর আল্লাহ্ তাঁর নিকট এ ওয়াহী প্রেরণ করলেনঃ দুই সমুদ্রের সঙ্গমস্থলে আমার বান্দাদের মধ্যে এক বান্দা রয়েছে, যে তোমার চেয়ে অধিক জ্ঞানী। তিনি বলেন, ‘হে আমার প্রতিপালক! কীভাবে তার সাক্ষাৎ পাব?’ তখন তাঁকে বলা হল, থলের মধ্যে একটি মাছ নিয়ে নাও। অতঃপর যেখানে সেটি হারিয়ে ফেলবে সেখানেই তাকে পাবে। অতঃপর তিনি ইউশা ‘ইবনু নূনকে সাথে নিয়ে যাত্রা করলেন। তাঁরা থলের মধ্যে একটি মাছ নিলেন। পথিমধ্যে তাঁরা একটি বড় পাথরের নিকট এসে মাথা রেখে শুয়ে পড়লেন। তারপর মাছটি থলে হতে বেরিয়ে গেল এবং সুড়ঙ্গের মত পথ করে সমুদ্রে চলে গেল। এ ব্যাপারটি মূসা (আ) ও তাঁর খাদিম-এর জন্য ছিল আশ্চর্যের বিষয়। অতঃপর তাঁরা তাদের বাকী দিন ও রাতভর চলতে থাকলেন। পরে ভোরবেলা মূসা (আ) তাঁর খাদিমকে বললেন, ‘আমাদের নাশতা নিয়ে এস, আমরা আমাদের এ সফরে খুবই ক্লান্ত, আর মূসা (আ)-কে যে স্থানের নির্দেশ দেয়া হয়েছিল, সে স্থান অতিক্রম করার পূর্বে তিনি ক্লান্তি অনুভব করেন নি। তারপর তাঁর সাথী তাঁকে বলল, ‘আপনি কি লক্ষ্য করেছেন, আমরা যখন পাথরের পাশে বিশ্রাম নিচ্ছিলাম, তখন আমি মাছের কথা ভুলে গিয়েছিলাম?’ মূসা (আ) বললেন, ‘আমরা তো সেই স্থানটিরই খোঁজ করছিলাম।’ অতঃপর তাঁরা তাঁদের পদচিহ্ন ধরে ফিরে চললেন। তাঁরা সেই পাথরের নিকট পৌঁছে দেখতে গেলেন, এক ব্যক্তি (বর্ণনাকারী বলেন,) কাপড় মুড়ি দিয়ে আছেন। মূসা (আ) তাঁকে সালাম দিলেন। তখন খাযির বললেন, এ দেশে সালাম কোথা হতে আসল! তিনি বললেন, ‘আমি মূসা।’ খাযির প্রশ্ন করলেন, ‘বনী ইসরাঈলের মূসা (আ)?’ তিনি বললেন, ‘হ্যাঁ। তিনি আরো বললেন, ‘‘সত্য পথের যে জ্ঞান আপনাকে দান করা হয়েছে, তা থেকে শিক্ষা নেয়ার জন্য আমি কি আপনাকে অনুসরণ করতে পারি?’ খাযির বললেন, ‘‘তুমি কিছুতেই আমার সাথে ধৈর্য ধরে থাকতে পারবে না। হে মূসা (আ)! আল্লাহর ‘ইল্মের মধ্যে আমি এমন এক ‘ইল্ম নিয়ে আছি যা তিনি কেবল আমাকেই শিখিয়েছেন, যা তুমি জান না। আর তুমি এমন ‘ইল্মের অধিকারী, যা আল্লাহ তোমাকেই শিখিয়েছেন, তা আমি জানি না।’’ ‘মূসা (আ) বললেন, ‘‘আল্লাহ্ চাইলে আপনি আমাকে ধৈর্যশীল পাবেন এবং আমি আপনার আদেশ অমান্য করব না। অতঃপর তাঁরা দু’জন সমুদ্র তীর দিয়ে চলতে লাগলেন, তাঁদের কোন নৌকা ছিল না। ইতোমধ্যে তাঁদের নিকট দিয়ে একটি নৌকা যাচ্ছিল। তাঁরা নৌকাওয়ালাদের সাথে তাদের তুলে নেয়ার কথা বললেন। তারা খাযিরকে চিনতে পারল এবং ভাড়া ব্যতিরেকে তাঁদের নৌকায় তুলে নিল। তখন একটি চড়ুই পাখি এসে নৌকার এক প্রান্তে বসে একবার কি দু’বার সমুদ্রে তার ঠোঁট ডুবাল। খাযির বললেন, ‘হে মূসা (আ)! আমার এবং তোমার জ্ঞান (সব মিলেও) আল্লাহর জ্ঞানের তুলনায় চড়ুই পাখির ঠোঁটে যতটুকু পানি এসেছে তার চেয়েও কম।’ অতঃপর খাযির নৌকার তক্তাগুলোর মধ্য থেকে একটি খুলে ফেললেন। মূসা (আ) বললেন, এরা আমাদের বিনা ভাড়ায় আরোহণ করিয়েছে, আর আপনি আরোহীদের ডুবিয়ে দেয়ার জন্য নৌকাটি ছিদ্র করে দিলেন?’ খাযির বললেন, ‘‘আমি কি বলিনি যে, তুমি আমার সঙ্গে কিছুতেই ধৈর্য ধরে থাকতে পারবে না?’’ মূসা (আ) বললেন, ‘আমার ত্রুটির জন্য আমাকে অপরাধী করবেন না এবং আমার ব্যাপারে অধিক কঠোর হবেন না।’ বর্ণনাকারী বলেন, এটা মূসা (আ)-এর প্রথমবারের ভুল। অতঃপর তাঁরা দু’জন (নৌকা থেকে নেমে) চলতে লাগলেন। (পথে) একটি বালক অন্যান্য বালকের সাথে খেলা করছিল। খাযির তার মাথার উপর দিক দিয়ে ধরলেন এবং হাত দিয়ে তার মাথা ছিন্ন করে ফেললেন। মূসা (আ) বললেন, ‘আপনি হত্যার অপরাধ ছাড়াই একটি নিষ্পাপ জীবন নাশ করলেন?’ খাযির বললেন ‘‘আমি কি তোমাকে বলিনি যে, তুমি আমার সঙ্গে কখনো ধৈর্য ধরতে পারবে না?’’ ইব্ন ‘উয়ায়নাহ (রহ.) বলেন, এটা ছিল পূর্বের চেয়ে অধিক জোরালো। ‘‘তারপর আবারো চলতে লাগলেন; চলতে চলতে তারা এক গ্রামের অধিবাসীদের নিকট পৌঁছে তাদের নিকট খাদ্য চাইলেন কিন্তু তারা তাঁদের মেহমানদারী করতে অস্বীকার করল। অতঃপর সেখানে তাঁরা ধ্বসে যাওয়ার উপক্রম এমন একটি প্রাচীর দেখতে পেলেন। খাযির তাঁর হাত দিয়ে সেটি দাঁড় করে দিলেন। মূসা (আ) বললেন, ‘‘আপনি ইচ্ছে করলে এর জন্য মজুরী নিতে পারতেন। তিনি বললেন, ‘এখানেই তোমার আর আমার মধ্যে সম্পর্কের অবসান।’’(সূরাহ কাহ্ফঃ ৭৭-৭৮) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আল্লাহ তা‘আলা মূসার উপর রহম করুন। আমাদের কতই না মনোবাঞ্ছা পূর্ণ হতো যদি তিনি সবর করতেন, তাহলে আমাদের নিকট তাঁদের আরো ঘটনাবলী বর্ণনা করা হতো।* (৭৪; মুসলিম ৪৩/৪৬, হাঃ ২৩৮০, আহমাদ ২১১৬৭) (আধুনিক প্রকাশনীঃ ১২০, ইসলামিক ফাউন্ডেশনঃ ১২৪)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 123,
			"arabicnumber": 123,
			"text": "আবূ মূসা (রাযি.) হতে বর্ণিত। তিনি বলেনঃ এক ব্যক্তি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট এসে বলল, ‘হে আল্লাহর রাসূল! আল্লাহর পথে যুদ্ধ কোনটি, কেননা আমাদের কেউ লড়াই করে রাগের বশবর্তী হয়ে, আবার কেউ লড়াই করে প্রতিশোধ নেয়ার জন্য। তিনি তার দিকে মাথা তুলে তাকালেন। বর্ণনাকারী বলেন, তাঁর মাথা তোলার কারণ ছিল যে, সে ছিল দাঁড়ানো। অতঃপর তিনি বললেনঃ ‘আল্লাহর বাণী বিজয়ী করার জন্য যে যুদ্ধ করে তার লড়াই আল্লাহর পথে হয়।’ (২৮১০, ৩১২৬, ৭৪৫৮; মুসলিম ৩৩/৪২, হাঃ ১৯০৪, আহমাদ ১৯৫১০, ১৯৫৬০, ১৯৬১৩) (আধুনিক প্রকাশনীঃ ১২১, ইসলামিক ফাউন্ডেশনঃ ১২৫)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 124,
			"arabicnumber": 124,
			"text": "‘আবদুল্লাহ্ ইবনু ‘আমর (রাযি.) হতে বর্ণিত। তিনি বলেনঃ আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে দেখলাম, জামরাহর নিকট তাঁকে মাসআলা জিজ্ঞেস করা হচ্ছে। এক ব্যক্তি জিজ্ঞেস করলঃ ‘হে আল্লাহর রাসূল! আমি কংকর মারার পূর্বেই কুরবানী করে ফেলেছি।’ তিনি বললেনঃ ‘কঙ্কর মার, তাতে কোন ক্ষতি নেই।’ অন্য এক ব্যক্তি জিজ্ঞেস করলঃ ‘হে আল্লাহর রাসূল! আমি কুরবানী করার পূর্বেই মাথা কামিয়ে ফেলেছি।’ তিনি বললেনঃ ‘কুরবানী করে নাও, কোন ক্ষতি নেই।’ বস্তুত আগ পিছ করার যে কোন প্রশ্নই তাঁকে করা হচ্ছিল, তিনি বলছিলেনঃ ‘কর, কোন ক্ষতি নেই।’ (৮৩) (আধুনিক প্রকাশনীঃ ১২২, ইসলামিক ফাউন্ডেশনঃ ১২৬)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 125,
			"arabicnumber": 125,
			"text": "‘আবদুল্লাহ্ ইবনু মাস‘ঊদ (রাযি.) হতে বর্ণিত। তিনি বলেনঃ একদা আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সাথে মাদ্বীনার বসতিহীন এলাকা দিয়ে চলছিলাম। তিনি একখানি খেজুরের ডালে ভর দিয়ে একদল ইয়াহুদীর কাছ দিয়ে যাচ্ছিলেন। তখন তারা একজন অন্যজনকে বলতে লাগল, ‘তাঁকে রূহ সম্পর্কে জিজ্ঞেস কর।’ আর একজন বলল, ‘তাঁকে কোন প্রশ্ন করো না, হয়ত এমন কোন জবাব দিবেন যা তোমরা পছন্দ করোনা।’ আবার কেউ কেউ বলল, ‘তাঁকে আমরা প্রশ্ন করবই।’ অতঃপর তাদের মধ্য হতে এক ব্যক্তি দাঁড়িয়ে বলল, ‘হে আবুল কাসিম! রূহ কী?’ আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম চুপ করে রইলেন, আমি মনে মনে বললাম, তাঁর প্রতি ওয়াহী অবতীর্ণ হচ্ছে। তাই আমি দাঁড়িয়ে রইলাম। অতঃপর যখন সে অবস্থা কেটে গেল তখন তিনি বললেনঃ ‘‘তারা তোমাকে রূহ সম্পর্কে প্রশ্ন করে। বল, রূহ আমার প্রতিপালকের আদেশ ঘটিত। এবং তাদেরকে সামান্যই জ্ঞান দেয়া হয়েছে।’’ (সূরাহ্ আল-ইসরা ১৭/৮৫) আ‘মাশ (রহ.) বলেন, এভাবেই আয়াতটিকে আমাদের কিরাআতে -এর স্থলে পড়া হয়েছে। (৪৭২১, ৭২৯৭, ৭৪৫৬, ৭৪৬২; মুসলিম ৫০/৪, হাঃ ২৭৯৪, আহমাদ ৩৬৮৮) (আধুনিক প্রকাশনীঃ ১২৩, ইসলামিক ফাউন্ডেশনঃ ১২৭)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 126,
			"arabicnumber": 126,
			"text": "আসওয়াদ (রহ.) হতে বর্ণিত। তিনি বলেনঃ ইবনু যুবায়র (রাযি.) আমাকে বললেন, ‘আয়িশাহ (রাযি.) তোমাকে অনেক হাদীস গোপনে বলতেন। বল তো কা‘বা সম্পর্কে তোমাকে কী বলেছেন? আমি বললাম, তিনি আমাকে বলেছেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ‘আয়িশাহ! তোমাদের কওম যদি (ইসলাম গ্রহণে) নতুন না হত, ইব্ন যুবায়র বলেনঃ কুফর থেকে; তবে আমি কা‘বা ভেঙ্গে ফেলে তার দু’টি দরজা বানাতাম। এক দরজা দিয়ে লোক প্রবেশ করত আর এক দরজা দিয়ে বের হত। (পরবর্তীকালে মক্কার আধিপত্য পেলে) তিনি এরূপ করেছিলেন। (১৫৮৩, ১৫৮৪, ১৫৮৫, ১৫৮৬, ৩৩৬৮, ৪৪৮৪, ৭২৪৩ দ্রষ্টব্য) (আধুনিক প্রকাশনীঃ ১২৪, ইসলামিক ফাউন্ডেশনঃ ১২৮)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 127,
			"arabicnumber": 127,
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 128,
			"arabicnumber": 128,
			"text": "আনাস ইবনু মালিক (রাযি.) হতে বর্ণিত যে, একদা মু‘আয (রাযি.) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর পিছনে সওয়ারীতে ছিলেন, তখন তিনি তাকে ডাকলেন, হে মু‘আয ইবনু জাবাল! মু‘আয (রাযি.) বললেন, ‘হে আল্লাহর রাসূল আমি আপনার সার্বিক সহযোগিতা ও খিদমাতে হাযির আছি। তিনি ডাকলেন, মু‘আয! মু‘আয (রাযি.) উত্তর দিলেন, আমি হাযির হে আল্লাহর রাসূল এবং প্রস্তুত।’ তিনি আবার ডাকলেন, মু‘আয। তিনি উত্তর দিলেন, ‘আমি হাযির এবং প্রস্তুত’। এরূপ তিনবার করলেন। অতঃপর বললেনঃ যে কোন বান্দা আন্তরিকতার সাথে এ সাক্ষ্য দেবে যে, ‘আল্লাহ্ ব্যতীত প্রকৃত কোন উপাস্য নেই এবং মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আল্লাহর রাসূল’-তার জন্য আল্লাহ তা‘আলা জাহান্নাম হারাম করে দিবেন। মু‘আয (রাযি.) বললেন, ‘হে আল্লাহর রাসূল! আমি কি মানুষকে এ খবর দেব না, যাতে তারা সুসংবাদ পেতে পারে?’ তিনি বললেন, ‘তাহলে তারা এর উপরই ভরসা করবে।’ মু‘আয (রাযি.) (জীবন ভর এ হাদীসটি বর্ণনা করেননি) মৃত্যুর সময় এ হাদীসটি বর্ণনা করে গেছেন যাতে (‘ইল্ম গোপন রাখার) গুনাহ্ না হয়। (১২৯; মুসলিম ১/১০, হাঃ ৩২) (আধুনিক প্রকাশনীঃ ১২৫, ইসলামিক ফাউন্ডেশনঃ ১৩০)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 129,
			"arabicnumber": 129,
			"text": "আনাস (রাযি.) হতে বর্ণিত। তিনি বলেন, আমার নিকট বর্ণনা করা হয়েছে যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মু‘আয (রাযি.)-কে বলেছেনঃ যে ব্যক্তি আল্লাহর সঙ্গে কোনরূপ শির্ক না করে তাঁর সাথে সাক্ষাত করবে সে জান্নাতে প্রবেশ করবে। মু‘আয (রাযি.) বললেন, ‘আমি কি লোকদের সুসংবাদ দেব না?’ তিনি বললেন, ‘না, আমার আশংকা হচ্ছে যে, তারা এর উপরই ভরসা করে বসে থাকবে।’ (১২৮) (আধুনিক প্রকাশনীঃ ১২৬, ইসলামিক ফাউন্ডেশনঃ ১৩১)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 130,
			"arabicnumber": 130,
			"text": "وَقَالَ مُجَاهِدٌ لاَ يَتَعَلَّمُ الْعِلْمَ مُسْتَحْيٍ وَلاَ مُسْتَكْبِرٌ وَقَالَتْ عَائِشَةُ نِعْمَ النِّسَاءُ نِسَاءُ الأَنْصَارِ لَمْ يَمْنَعْهُنَّ الْحَيَاءُ أَنْ يَتَفَقَّهْنَ فِي الدِّينِ. মুজাহিদ (রহ.) বলেন, ‘লাজুক এবং অহঙ্কারী ব্যক্তি জ্ঞান অর্জন করতে পারে না। ‘আয়িশাহ (রাযি.) বলেন, ‘আনসারী মহিলারাই উত্তম। লজ্জা তাদেরকে ইসলামী জ্ঞান অন্বেষণ থেকে ফিরিয়ে রাখতে পারেনি। ১৩০. উম্মু সালামাহ (রাযি.) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট উম্মু সুলায়ম (রাযি.) এসে বললেনঃ হে আল্লাহর রাসূল! আল্লাহ্ হক কথা প্রকাশ করতে লজ্জাবোধ করেন না। মহিলাদের স্বপ্নদোষ হলে কি গোসল করতে হবে? নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ ‘হ্যাঁ, যখন সে বীর্য দেখতে পাবে।’ তখন উম্মু সালামাহ (লজ্জায়) তার মুখ ঢেকে নিয়ে বললেন, ‘হে আল্লাহর রাসূল! মহিলাদেরও স্বপ্নদোষ হয় কি?’ তিনি বললেন, ‘হ্যাঁ, তোমার ডান হাতে মাটি পড়ুক! (তা না হলে) তাদের সন্তান তাদের আকৃতি পায় কীভাবে? (২৮২, ৩৩২৮, ৬০৯১, ৬১২১; মুসলিম ৩/৭, হাঃ ৩১৩, আহমাদ ২৬৬৭৫) (আধুনিক প্রকাশনীঃ ১২৭, ইসলামিক ফাউন্ডেশনঃ ১৩২)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 131,
			"arabicnumber": 131,
			"text": "ইবনু্‘উমার (রাযি.) হতে বর্ণিত যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ গাছের মধ্যে এমন একটি গাছ রয়েছে যার পাতা ঝরে পড়ে না এবং তা হ’ল মুসলিমের দৃষ্টান্ত। তোমরা আমাকে বল তো সেটা কোন্ গাছ? তখন লোকজনের খেয়াল জঙ্গলের গাছপালার প্রতি গেল। আর আমার মনে হতে লাগল যে, সেটি খেজুর গাছ। ‘আবদুল্লাহ্ (রাযি.) বলেন, ‘কিন্তু আমি লজ্জাবোধ করলাম।’ সহাবায়ে কিরাম (রাযি.) বললেন, ‘হে আল্লাহর রাসূল! আপনিই আমাদের তা বলে দিন।’ আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ ‘তা হ’ল খেজুর গাছ।’ ‘আবদুল্লাহ্ (রাযি.) বলেন, ‘তারপর আমি আমার পিতাকে আমার মনে যা এসেছিল তা বললাম।’ তিনি বললেন, ‘তুমি তখন তা বলে দিলে তা আমার নিকট এরূপ এরূপ জিনিস লাভ করার চেয়ে অধিক প্রিয় হতো।’ (৬১) (আধুনিক প্রকাশনীঃ ১২৮, ইসলামিক ফাউন্ডেশনঃ ১৩৩)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 132,
			"arabicnumber": 132,
			"text": "‘আলী ইবনু আবূ তালিব (রাযি.) হতে বর্ণিত। তিনি বলেন, আমার অধিক পরিমাণে ‘মযী’ বের হত। তাই এ ব্যাপারে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে জিজ্ঞেস করার জন্য মিকদাদকে বললাম। তিনি তাঁকে জিজ্ঞেস করলেন। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ ‘এতে কেবল উযূ করতে হয়।’ (১৭৮,২৬৯; মুসলিম ৩/৪, হাঃ ৩০৩, আহমাদ ৬০৬, ১০০৯, ১০৩৫) (আধুনিক প্রকাশনীঃ ১২৯, ইসলামিক ফাউন্ডেশনঃ ১৩৪)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 133,
			"arabicnumber": 133,
			"text": "‘আবদুল্লাহ্ ইবনু ‘উমার (রাযি.) হতে বর্ণিত। এক ব্যক্তি মসজিদে দাঁড়িয়ে বলল, ‘হে আল্লাহর রাসূল! আপনি আমাদের কোন্ স্থান হতে ইহরাম বাঁধার নির্দেশ দেন?’ আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ মদিনা্বাসী ইহরাম বাঁধবে ‘যু’ল-হুলাইফাহ’ হতে, সিরিয়াবাসী ইহরাম বাঁধবে ‘জুহফা’ হতে এবং নাজদবাসী ইহরাম বাঁধবে ‘কর্ন’ হতে। ইবনু ‘উমার (রাযি.) বলেন, সাহাবীগণ বলেন যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এও বলেছেনঃ ‘এবং ইয়ামানবাসী ইহরাম বাঁধবে ‘ইয়ালামলাম’ হতে।’ ইবনু ‘উমার (রাযি.) বলেছেন, ‘এ কথাটি আমি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বুঝে নেইনি।’ (১৫২২, ১৫২৫, ১৫২৭, ১৫২৮, ৭৩৩৪) (আধুনিক প্রকাশনীঃ ১৩০, ইসলামিক ফাউন্ডেশনঃ ১৩৫)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 134,
			"arabicnumber": 134,
			"text": "ইবনু ‘উমার (রাযি.) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণনা করেন যে, এক ব্যক্তি তাঁকে জিজ্ঞেস করল, ‘মুহরিম কী কাপড় পরিধান করবে?’ তিনি বললেনঃ ‘জামা, পাগড়ী, পাজামা, টুপি এবং কুসুম বা জাফরান রঙ্গে রঞ্জিত কোন কাপড় পরিধান করবে না। জুতা না পেলে চামড়ার মোজা পরতে পারে, তবে এমনভাবে কেটে ফেলতে হবে যাতে মোজা দু’টি পায়ের গিরার নিচে থাকে। (৩৬৬, ১৫৪২, ১৮৩৮, ১৮৪২, ৫৭৯৪, ৫৮০৩, ৫৮০৫, ৫৮০৬, ৫৮৪৭, ৫৮৫২) (আধুনিক প্রকাশনীঃ ১৩১, ইসলামিক ফাউন্ডেশনঃ ১৩৬)",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 76
			}
		}
	]
}