{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"30": "Fasting"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1891,
			"arabicnumber": 1891,
			"text": "وَقَوْلِ اللهِ تَعَالَى (يَا أَيُّهَا الَّذِينَ آمَنُوا كُتِبَ عَلَيْكُمْ الصِّيَامُ كَمَا كُتِبَ عَلَى الَّذِينَ مِنْ قَبْلِكُمْ لَعَلَّكُمْ تَتَّقُونَ) মহান আল্লাহর বাণীঃ ‘‘হে মু’মিনগণ! তোমাদের জন্য সিয়াম ফরজ করা হল, যেমন ফরজ করা হয়েছিল তোমাদের পূর্ববর্তীদের উপর, যেন তোমরা মুত্তাকী হতে পার।’’ (আল-বাকারাহ্ঃ ১৮৩) ১৮৯১. তালহা ইবনু ‘উবায়দুল্লাহ (রাঃ) হতে বর্ণিত যে, এলোমেলো চুলসহ একজন গ্রাম্য আরব আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট এলেন। অতঃপর বললেন, হে আল্লাহর রাসূল! আমাকে বলুন, আল্লাহ তা‘আলা আমার উপর কত সালাত ফরজ করেছেন? তিনি বললেনঃ পাঁচ (ওয়াক্ত) সালাত; তবে তুমি যদি কিছু নফল আদায় কর তা স্বতন্ত্র কথা। এরপর তিনি বললেন, বলুন, আমার উপর কত সিয়াম আল্লাহ তা‘আলা ফরজ করেছেন। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ রমাযান মাসের সওম; তবে তুমি যদি কিছু নফল সিয়াম আদায় কর তা হল স্বতন্ত্র কথা। এরপর তিনি বললেন, বলুন, আল্লাহ আমার উপর কী পরিমাণ যাকাত ফরজ করেছেন? রাবী বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে ইসলামের বিধান জানিয়ে দিলেন। এরপর তিনি বললেন, ঐ সত্তার কসম, যিনি আপনাকে সত্য দিয়ে সম্মানিত করেছেন, আল্লাহ আমার উপর যা ফরজ করেছেন, আমি এর মাঝে কিছু বাড়াব না এবং কমাবও না। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ সে সত্য বলে থাকলে সফলতা লাভ করল কিংবা বলেছেন, সে সত্য বলে থাকলে জান্নাত লাভ করল। (৯৪৬) (আধুনিক প্রকাশনীঃ ১৭৫৬, ইসলামিক ফাউন্ডেশনঃ ১৭৬৭)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1892,
			"arabicnumber": 1892,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ‘আশূরার দিন সিয়াম পালন করেছেন এবং এ সিয়ামের জন্য আদেশও করেছেন। পরে যখন রমাযানের সিয়াম ফরজ হল তখন তা ছেড়ে দেওয়া হয়। ‘আবদুল্লাহ (রহ.) এ সিয়াম পালন করতেন না, তবে মাসের যে দিনগুলোতে সাধারণত সিয়াম পালন করতেন, তার সাথে মিল হলে করতেন। (২০০০, ৪৫০১) (আধুনিক প্রকাশনীঃ ১৭৫৭, ইসলামিক ফাউন্ডেশনঃ ১৭৬৮)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1893,
			"arabicnumber": 1893,
			"text": "‘আয়িশাহ্ (রাযি.) হতে বর্ণিত যে, জাহিলী যুগে কুরায়শগণ ‘আশূরার দিন সওম পালন করত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -ও পরে এ সওম পালনের নির্দেশ দেন। অবশেষে রমাযানের সিয়াম ফরজ হলে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ যার ইচ্ছা ‘আশূরার সিয়াম পালন করবে এবং যার ইচ্ছা সে সওম পালন করবে না। (১৫৯২, মুসলিম ১৩/১৯, হাঃ ১১২৫, আহমাদ ২৬১২৭) (আধুনিক প্রকাশনীঃ ১৭৫৮, ইসলামিক ফাউন্ডেশনঃ ১৭৬৯)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1894,
			"arabicnumber": 1894,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ সিয়াম ঢাল স্বরূপ। সুতরাং অশ্লীলতা করবে না এবং মূর্খের মত কাজ করবে না। যদি কেউ তার সাথে ঝগড়া করতে চায়, তাকে গালি দেয়, তবে সে যেন দুই বার বলে, আমি সওম পালন করছি। ঐ সত্তার শপথ, যাঁর হাতে আমার প্রাণ, অবশ্যই সওম পালনকারীর মুখের গন্ধ আল্লাহর নিকট মিসকের সুগন্ধির চাইতেও উৎকৃষ্ট, সে আমার জন্য আহার, পান ও কামাচার পরিত্যাগ করে। সিয়াম আমারই জন্য। তাই এর পুরস্কার আমি নিজেই দান করব। আর প্রত্যেক নেক কাজের বিনিময় দশ গুণ। (১৯০৪, ৫৯২৭, ৭৪৯২, ৭৫৩৮, মুসলিম ১৩/২৯, হাঃ ১১৫১, আহমাদ ৭৩০৮) (আধুনিক প্রকাশনীঃ ১৭৫৯, ইসলামিক ফাউন্ডেশনঃ ১৭৭০)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1895,
			"arabicnumber": 1895,
			"text": "হুযাইফাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, একদা ‘উমার (রাঃ) বললেন, ফিতনা সম্পর্কিত নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর হাদীসটি কার মুখস্থ আছে? হুযাইফাহ (রাঃ) বললেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে বলতে শুনেছি যে, পরিবার, ধন-সম্পদ এবং প্রতিবেশীই মানুষের জন্য ফিতনা। সালাত, সিয়াম এবং সদকা এর কাফফারা হয়ে যায়। ‘উমার (রাঃ) বললেন, এ ফিতনা সম্পর্কে আমি প্রশ্ন করছি না, আমি তো প্রশ্ন করেছি ঐ ফিতনা সম্পর্কে, যা সমুদ্রের ঢেউয়ের ন্যায় আন্দোলিত হতে থাকবে। হুযাইফাহ (রাঃ) বললেন, এ ফিতনার সামনে বন্ধ দরজা আছে। ‘উমার (রাঃ) বললেন, এ দরজা কি খুলে যাবে, না ভেঙ্গে যাবে? হুযাইফাহ (রাঃ) বললেন, ভেঙ্গে যাবে। ‘উমার (রাঃ) বললেন, তাহলে তো তা কিয়ামত পর্যন্ত বন্ধ হবে না। আমরা মাসরূক (রহ.)-কে বললাম, হুযাইফাহ (রাঃ)-কে জিজ্ঞেস করুন, ‘উমার (রাঃ) কি জানতেন, কে সেই দরজা? তিনি বললেন, হাঁ, তিনি এরূপ জানতেন যেরূপ কালকের দিনের পূর্বে আজকের রাত। (৫২৫) (আধুনিক প্রকাশনীঃ ১৭৬০, ইসলামিক ফাউন্ডেশনঃ ১৭৭১)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1896,
			"arabicnumber": 1896,
			"text": "সাহল (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ জান্নাতে রাইয়্যান নামক একটি দরজা আছে। এ দরজা দিয়ে কিয়ামতের দিন সওম পালনকারীরাই প্রবেশ করবে। তাদের ব্যতীত আর কেউ এ দরজা দিয়ে প্রবেশ করতে পারবে না। ঘোষণা দেয়া হবে, সওম পালনকারীরা কোথায়? তখন তারা দাঁড়াবে। তারা ব্যতীত আর কেউ এ দরজা দিয়ে প্রবেশ করবে না। তাদের প্রবেশের পরই দরজা বন্ধ করে দেয়া হবে। যাতে করে এ দরজাটি দিয়ে আর কেউ প্রবেশ না করে। (৩২৫৭, মুসলিম ১৩/৩, হাঃ ১১৫২) (আধুনিক প্রকাশনীঃ ১৭৬১, ইসলামিক ফাউন্ডেশনঃ ১৭ ৭২)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1897,
			"arabicnumber": 1897,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে কেউ আল্লাহর পথে জোড়া জোড়া ব্যয় করবে তাকে জান্নাতের দরজাসমূহ হতে ডাকা হবে, হে আল্লাহর বান্দা! এটাই উত্তম। অতএব যে সালাত আদায়কারী, তাকে সালাতের দরজা হতে ডাকা হবে। যে মুজাহিদ, তাকে জিহাদের দরজা হতে ডাকা হবে। যে সিয়াম পালনকারী, তাকে রাইয়্যান দরজা হতে ডাকা হবে। যে সদাকাহ দানকারী, তাকে সদাকাহর দরজা হতে ডাকা হবে। এরপর আবূ বাকর (রাঃ) বললেন, হে আল্লাহর রাসূল! আপনার জন্য আমার পিতা-মাতা কুরবান হোক, সকল দরজা হতে কাউকে ডাকার কোন প্রয়োজন নেই, তবে কি কাউকে সব দরজা হতে ডাকা হবে? আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ হাঁ। আমি আশা করি তুমি তাদের মধ্যে হবে। (২৭৪১, ৩২১৬, ৩৬৬৬, মুসলিম ১২/২৭, হাঃ ১০২৭, আহমাদ ৭৬৩৭) (আধুনিক প্রকাশনীঃ ১৭৬২, ইসলামিক ফাউন্ডেশনঃ ১৭৭৩)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1898,
			"arabicnumber": 1898,
			"text": "وَقَالَ النَّبِيُّ صلى الله عليه وسلم مَنْ صَامَ رَمَضَانَ وَقَالَ لاَ تَقَدَّمُوا رَمَضَانَ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ‘‘যে ব্যক্তি রমাযানে সওম পালন করবে’’ এবং আরো বলেছেনঃ ‘‘তোমরা রমাযানের আগে সওম পালন করবে না’’ ১৮৯৮. আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যখন রমাযান আসে তখন জান্নাতের দরজাসমূহ উন্মুক্ত করে দেয়া হয়। (১৮৯৯, ৩২৭৭, মুসলিম ১৩/১, হাঃ ১০৭৯, আহমাদ ৮৬৯২) (আধুনিক প্রকাশনীঃ ১৭৬৩, ইসলামিক ফাউন্ডেশনঃ ১৭৭৪)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1899,
			"arabicnumber": 1899,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলতেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ রমাযান আসলে আসমানের দরজাসমূহ খুলে দেয়া হয় এবং জাহান্নামের দরজাসমূহ বন্ধ করে দেয়া হয় আর শয়তানগুলোকে শিকলবন্দী করে দেয়া হয়। (১৮৯৮) (আধুনিক প্রকাশনীঃ ১৭৬৪, ইসলামিক ফাউন্ডেশনঃ ১৭৭৫)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1900,
			"arabicnumber": 1900,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে বলতে শুনেছি, যখন তোমরা তা (চাঁদ) দেখবে তখন সওম রাখবে, আবার যখন তা দেখবে তখন ইফ্তার করবে। আর যদি আকাশ মেঘলা থাকে তবে সময় হিসাব করে (ত্রিশ দিন) পূর্ণ করবে। ইয়াহইয়া ইবনু বুকায়র (রহ.) ব্যতীত অন্যরা লায়স (রহ.) হতে ‘উকায়ল এবং ইউনুস (রহ.) সূত্রে বর্ণনা করেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কথাটি বলেছেন রমাযানের চাঁদ সম্পর্কে। (১৯০৬, ১৯০৭) (আধুনিক প্রকাশনীঃ ১৭৬৫, ইসলামিক ফাউন্ডেশনঃ ১৭৭৬)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1901,
			"arabicnumber": 1901,
			"text": "وَقَالَتْ عَائِشَةُ عَنْ النَّبِيِّ يُبْعَثُونَ عَلَى نِيَّاتِهِمْ ‘আয়িশাহ (রাযি.) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেছেন, কিয়ামতের দিন নিয়ত অনুযায়ীই লোকদের উঠানো হবে। ১৯০১. আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তি লাইলাতুল ক্বদ্রে ঈমানের সাথে সাওয়াবের আশায় রাত জেগে ‘ইবাদত করে, তার পিছনের সমস্ত গোনাহ ক্ষমা করা হবে। আর যে ব্যক্তি ঈমানসহ সওয়াবের আশায় রমাযানে সিয়াম পালন করবে, তারও অতীতের সমস্ত গোনাহ মাফ করা হবে। (৩৫) (আধুনিক প্রকাশনীঃ ১৭৬৬, ইসলামিক ফাউন্ডেশনঃ ১৭৭৭)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1902,
			"arabicnumber": 1902,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ধন-সম্পদ ব্যয় করার ব্যাপারে সকলের চেয়ে দানশীল ছিলেন। রমাযানে জিবরাঈল (আঃ) যখন তাঁর সঙ্গে সাক্ষাত করতেন, তখন তিনি আরো অধিক দান করতেন। রমাযান শেষ না হওয়া পর্যন্ত প্রতি রাতেই জিবরাঈল তাঁর সঙ্গে একবার সাক্ষাত করতেন। আর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে কুরআন শোনাতেন। জিবরাঈল যখন তাঁর সঙ্গে সাক্ষাত করতেন তখন তিনি রহমতসহ প্রেরিত বায়ুর চেয়ে অধিক ধন-সম্পদ দান করতেন। (৬) (আধুনিক প্রকাশনীঃ ১৭৬৭, ইসলামিক ফাউন্ডেশনঃ ১৭৭৮)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1903,
			"arabicnumber": 1903,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তি মিথ্যা বলা ও সে অনুযায়ী আমল বর্জন করেনি, তার এ পানাহার পরিত্যাগ করায় আল্লাহর কোন প্রয়োজন নেই। (৬০৫৭) (আধুনিক প্রকাশনীঃ ১৭৬৮, ইসলামিক ফাউন্ডেশনঃ ১৭৭৯)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1904,
			"arabicnumber": 1904,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আল্লাহ তা‘আলা বলেছেন, সওম ব্যতীত আদম সন্তানের প্রতিটি কাজই তার নিজের জন্য, কিন্তু সিয়াম আমার জন্য। তাই আমি এর প্রতিদান দেব। সিয়াম ঢাল স্বরূপ। তোমাদের কেউ যেন সিয়াম পালনের দিন অশ্লীলতায় লিপ্ত না হয় এবং ঝগড়া-বিবাদ না করে। যদি কেউ তাকে গালি দেয় অথবা তার সঙ্গে ঝগড়া করে, তাহলে সে যেন বলে, আমি একজন সায়িম। যাঁর কবজায় মুহাম্মাদের প্রাণ, তাঁর শপথ! অবশ্যই সায়িমের মুখের গন্ধ আল্লাহর নিকট মিস্কের গন্ধের চাইতেও সুগন্ধি। সায়িমের জন্য রয়েছে দু’টি খুশী যা তাকে খুশী করে। যখন সে ইফতার করে, সে খুশী হয় এবং যখন সে তার রবের সাথে সাক্ষাৎ করবে, তখন সওমের বিনিময়ে আনন্দিত হবে। (১৮৯৪, মুসলিম ১৩/৩০, হাঃ ১১৫১, আহমাদ ৭৭৯৩) (আধুনিক প্রকাশনীঃ ১৭৬৯, ইসলামিক ফাউন্ডেশনঃ ১৭৮০)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1905,
			"arabicnumber": 1905,
			"text": "‘আলকামাহ (রহ.) হতে বর্ণিত। তিনি বলেন, আমি ‘আবদুল্লাহ (রাঃ)-এর সঙ্গে চলতে ছিলাম, তখন তিনি বললেন, আমরা আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সাথে ছিলাম, তিনি বললেনঃ যে ব্যক্তির সামর্থ্য আছে, সে যেন বিয়ে করে নেয়। কেননা বিয়ে চোখকে অবনত রাখে এবং লজ্জাস্থানকে সংযত করে। আর যার সামর্থ্য নেই, সে যেন সওম পালন করে। সওম তার প্রবৃত্তিকে দমন করে। আবূ ‘আবদুল্লাহ (রহ.) বলেন, الْبَاءَةَ শব্দে অর্থ বিবাহ। (৫০৬৫, ৫০৬৬) (আধুনিক প্রকাশনীঃ ১৭৭০, ইসলামিক ফাউন্ডেশনঃ ১৭৮১)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1906,
			"arabicnumber": 1906,
			"text": "وَقَالَ صِلَةُ عَنْ عَمَّارٍ مَنْ صَامَ يَوْمَ الشَّكِّ فَقَدْ عَصَى أَبَا الْقَاسِمِ সেলাহ (রহ.) ‘আম্মার (রাঃ) হতে বর্ণনা করেন, যে ব্যক্তি সন্দেহের দিনে সওম পালন করল সে আবুল কাসিম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নাফরমানী করল। ১৯০৬. ‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রমাযানের কথা আলোচনা করে বললেনঃ চাঁদ না দেখে তোমরা সওম পালন করবে না এবং চাঁদ না দেখে ইফ্তার বন্ধ করবে না। যদি মেঘাচ্ছন্ন থাকে তাহলে তার সময় (ত্রিশ দিন) পরিমাণ পূর্ণ করবে। (১৯০০) (আধুনিক প্রকাশনীঃ ১৭৭১, ইসলামিক ফাউন্ডেশনঃ ১৭৮২)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1907,
			"arabicnumber": 1907,
			"text": "‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মাস ঊনত্রিশ রাত বিশিষ্ট হয়। তাই তোমরা চাঁদ না দেখে সওম শুরু করবে না। যদি আকাশ মেঘাবৃত থাকে তাহলে তোমরা ত্রিশ দিন পূর্ণ করবে। (১৯০০, মুসলিম ১৩/২, হাঃ ১০৮০, আহমাদ ৫২৯৪) (আধুনিক প্রকাশনীঃ ১৭৭২, ইসলামিক ফাউন্ডেশনঃ ১৭৮৩)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1908,
			"arabicnumber": 1908,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (দু‘হাতের অঙ্গুলি তুলে ইঙ্গিত করে) বলেনঃ মাস এত এত দিনে হয় এবং তৃতীয় বার বৃদ্ধাঙ্গুলিটি বন্ধ করে নিলেন। (১৯১৩, ৫৩০২, মুসলিম ১৩/২, হাঃ ১০৮০, আহমাদ ৪৮১৫) (আধুনিক প্রকাশনীঃ ১৭৭৩, ইসলামিক ফাউন্ডেশনঃ ১৭৮৪)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1909,
			"arabicnumber": 1909,
			"text": "‘আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অথবা বলেন, আবুল কাসিম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা চাঁদ দেখে সিয়াম আরম্ভ করবে এবং চাঁদ দেখে ইফতার করবে। আকাশ যদি মেঘে ঢাকা থাকে তাহলে শা‘বানের গণনা ত্রিশ দিন পুরা করবে। (মুসলিম ১৩/২, হাঃ ১০৮১) (আধুনিক প্রকাশনীঃ ১৭৭৪, ইসলামিক ফাউন্ডেশনঃ ১৭৮৫)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1910,
			"arabicnumber": 1910,
			"text": "উম্মু সালামাহ (রাযি.) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক মাসের মত তাঁর স্ত্রীদের সাথে ঈলা করলেন। ঊনত্রিশ দিন অতিবাহিত হওয়ার পর সকালে বা সন্ধ্যায় তিনি তাঁদের নিকট গমন করলেন। তাঁকে জিজ্ঞেস করা হল, আপনি তো এক মাস পর্যন্ত না আসার শপথ করেছিলেন? তিনি বললেন, মাস ঊনত্রিশ দিনেও হয়ে থাকে। (৫২০২) (আধুনিক প্রকাশনীঃ ১৭৭৫, ইসলামিক ফাউন্ডেশনঃ ১৭৮৬)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1911,
			"arabicnumber": 1911,
			"text": "আনাস (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর স্ত্রীদের সাথে ঈলা করলেন। এ সময় তাঁর পা মচকে গিয়েছিল। তখন তিনি উপরের কামরায় ঊনত্রিশ রাত অবস্থান করেন। এরপর তিনি নেমে আসলে সাহাবীগণ জিজ্ঞেস করলেন, হে আল্লাহর রাসূল! আপনি তো এক মাসের জন্য ঈলা করেছিলেন। তিনি বললেনঃ মাস ঊনত্রিশ দিনেও হয়ে থাকে। (৩৭৮) (আধুনিক প্রকাশনীঃ ১৭৭৬, ইসলামিক ফাউন্ডেশনঃ ১৭৮৭)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1912,
			"arabicnumber": 1912,
			"text": "قَالَ أَبُو عَبْد اللهِ قَالَ إِسْحَاقُ وَإِنْ كَانَ نَاقِصًا فَهُوَ تَمَامٌ وَقَالَ مُحَمَّدٌ لاَ يَجْتَمِعَانِ كِلاَهُمَا نَاقِصٌ আবূ আবদুল্লাহ বলেন, ইসহাক বলেছেন, যদি কম (ঊনত্রিশ) হয় সেটাই পূর্ণ হিসেবে গণ্য। আর মুহাম্মাদ বলেন, (একই বছরে) উভয় ঈদ অপূর্ণ (ঊনত্রিশদিনের) মাস হবে না। ১৯১২. ‘আবদুর রহমান ইবনু আবূ বাকরা হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, দু’টি মাস কম হয় না। তা হল ঈদের দু’মাস- রমাযানের মাস ও যুলহাজ্জের মাস। আবূ ‘আবদুল্লাহ (রহ.) বলেছেন, আহমাদ ইবনু হাম্বল (রহ.) বলেন, রমাযান ঘাটতি হলে যুলহাজ্জ পূর্ণ হবে। আর যুলহাজ্জ ঘাটটি হলে রমাযান পূর্ণ হবে। আবুল হাসান (রহ.) বলেন, ইসহাক ইবনু রাহওয়াই (রহ.) বলেন, ফাযীলতের দিক হতে এ দু’ মাসে কোন ঘাটতি নেই, মাস ঊনত্রিশ দিনে হোক বা ত্রিশ দিনে হোক। (মুসলিম ১৩/৭, হাঃ ১০৮৯, আহমাদ ২০৫০১) (আধুনিক প্রকাশনীঃ ১৭৭৭, ইসলামিক ফাউন্ডেশনঃ ১৭৮৮)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1913,
			"arabicnumber": 1913,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আমরা উম্মী জাতি। আমরা লিখি না এবং হিসাবও করি না। মাস এরূপ অর্থাৎ কখনও ঊনত্রিশ দিনের আবার কখনো ত্রিশ দিনের হয়ে থাকে। (১৯০৮, মুসলিম ১৩/২, হাঃ ১০৮০, আহমাদ ৪৮১৫) (আধুনিক প্রকাশনীঃ ১৭৭৮, ইসলামিক ফাউন্ডেশনঃ ১৭৮৯)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1914,
			"arabicnumber": 1914,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা কেউ রমাযানের একদিন কিংবা দু’দিন আগে হতে সওম শুরু করবে না। তবে কেউ যদি এ সময় সিয়াম পালনে অভ্যস্ত থাকে তাহলে সে সেদিন সওম পালন করতে পারবে। (মুসলিম ১৩/৩, হাঃ ১০৮২, আহমাদ ১০১৮৮) (আধুনিক প্রকাশনীঃ ১৭৭৯, ইসলামিক ফাউন্ডেশনঃ ১৭৯০)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1915,
			"arabicnumber": 1915,
			"text": "(أُحِلَّ لَكُمْ لَيْلَةَ الصِّيَامِ الرَّفَثُ إِلَى نِسَائِكُمْ هُنَّ لِبَاسٌ لَكُمْ وَأَنْتُمْ لِبَاسٌ لَهُنَّ عَلِمَ اللهُ أَنَّكُمْ كُنْتُمْ تَخْتَانُونَ أَنْفُسَكُمْ فَتَابَ عَلَيْكُمْ وَعَفَا عَنْكُمْ فَالآنَ بَاشِرُوهُنَّ وَابْتَغُوا مَا كَتَبَ اللهُ لَكُمْ) ‘‘তোমাদের জন্য বৈধ করা হয়েছে সিয়ামের রাতে তোমাদের স্ত্রীদের সাথে সহবাস করা। তারা তোমাদের পোশাক এবং তোমরা তাদের পোশাক। আল্লাহ জানতেন যে, তোমরা নিজেদের সাথে প্রতারণা করছিলে। সুতরাং তিনি তোমাদেরকে ক্ষমা করলেন এবং তোমাদের অব্যাহতি দিলেন। অতএব, এখন থেকে তোমরা তাদের সাথে সহবাস করতে পার এবং আল্লাহ তোমাদের জন্য যা কিছু বিধিবদ্ধ করেছেন তা কামনা কর।’’ (আল-বাকারাহ্ঃ ১৮৭) ১৯১৫. বারা’ (রাঃ) হতে বর্ণিত। তিনি বলেন, মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সাহাবীগণের অবস্থা এই ছিল যে, যদি তাঁদের কেউ সওম পালন করতেন তাহলে ইফ্তারের সময় হলে ইফ্তার না করে নিদ্রা গেলে সে রাত্রে এবং পরের দিন সন্ধ্যা পর্যন্ত কিছুই খেতেন না। কায়স ইবনু সিরমা আনসারী (রাঃ) সওম করেছিলেন। ইফ্তারের সময় তিনি তাঁর স্ত্রীর নিকট এসে জিজ্ঞেস করলেন, তোমার কাছে কিছু খাবার আছে কি? তিনি বললেন, না, তবে আমি যাচ্ছি, দেখি আপনার জন্য কিছু খোঁজ করে আনি। তিনি দিনে কাজে নিয়োজিত থাকতেন। তাই ঘুমে তাঁর দু’চোখ বুজে গেল। এরপর তাঁর স্ত্রী এসে যখন তাঁকে দেখলেন, তখন তাঁকে বললেন, হায়, তুমি বঞ্চিত হয়ে গেলে! পরদিন দুপুর হলে তিনি অজ্ঞান হয়ে যান। এ ঘটনাটি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট উল্লেখ করা হলে কুরআনের এ আয়াত অবতীর্ণ হয়- ‘‘সিয়ামের রাতে তোমাদের স্ত্রী সম্ভোগ হালাল করা হয়েছে’’- (আল-বাকারাহ্ঃ ১৮৭)। এর হুকুম সম্বন্ধে অবহিত হয়ে সাহাবীগণ খুবই খুশি হলেন। এরপর নাযিল হলঃ ‘‘আর তোমরা পানাহার কর যতক্ষণ না কালো রেখা থেকে ভোরের সাদা রেখা পরিষ্কার দেখা যায়’’- (আল-বাকারাহ্ঃ ১৮৭)। (৪৫০৮) (আধুনিক প্রকাশনীঃ ১৭৮০, ইসলামিক ফাউন্ডেশনঃ ১৭৯১)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1916,
			"arabicnumber": 1916,
			"text": "(وَكُلُوا وَاشْرَبُوا حَتَّى يَتَبَيَّنَ لَكُمْ الْخَيْطُ الأَبْيَضُ مِنْ الْخَيْطِ الأَسْوَدِ مِنْ الْفَجْرِ ثُمَّ أَتِمُّوا الصِّيَامَ إِلَى اللَّيْلِ) فِيهِ الْبَرَاءُ عَنْ النَّبِيِّ صلى الله عليه وسلم ‘‘আর তোমরা পানাহার কর যতক্ষণ না কালো রেখা থেকে ভোরের সাদা রেখা পরিষ্কার দেখা যায়। তারপর রোযা পূর্ণ কর রাত পর্যন্ত’’- (আল-বাকারাহঃ ১৮৭)। এ বিষয়ে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বারা‘ (রাঃ) হাদীস বর্ণনা করেছেন। ১৯১৬. ‘আদী ইবনু হাতিম (রাঃ) হতে বর্ণিত। তিনি বলেন, যখন এই আয়াত নাযিল হলোঃ (حَتَّى يَتَبَيَّنَ لَكُمْ الْخَيْطُ الأَبْيَضُ مِنْ الْخَيْطِ الأَسْوَدِ) ‘‘তোমরা পানাহার কর (রাত্রির) কাল রেখা হতে (ভোরের) সাদা রেখা যতক্ষণ স্পষ্টরূপে তোমাদের নিকট প্রতিভাত না হয়’’ তখন আমি একটি কাল এবং একটি সাদা রশি নিলাম এবং উভয়টিকে আমার বালিশের নিচে রেখে দিলাম। রাতে আমি এগুলোর দিকে বারবার তাকাতে থাকি। কিন্তু আমার নিকট পার্থক্য প্রকাশিত হলো না। তাই সকালেই আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট গিয়ে এ বিষয় বললাম। তিনি বললেনঃ এতো রাতের আধার এবং দিনের আলো। (৪৫০৯, ৪৫১০, মুসলিম ১৩/৮, হাঃ ১০৯০, আহমাদ ১৯৩৯২) (আধুনিক প্রকাশনীঃ ১৭৮১, ইসলামিক ফাউন্ডেশনঃ১৭৯২)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1917,
			"arabicnumber": 1917,
			"text": "সাহল ইবনু সা‘দ (রাঃ) হতে বর্ণিত, তিনি বলেন, যখন এই আয়াত নাযিল হলঃ‘‘তোমরা পানাহার কর, যতক্ষণ কাল রেখা হতে সাদা রেখা স্পষ্টরূপে তোমাদের নিকট প্রতিভাত না হয়।’’ কিন্তু তখনো (مِنْ الْفَجْرِ) কথাটি নাযিল হয়নি। তখন সওম পালন করতে ইচ্ছুক লোকেরা নিজেদের দুই পায়ে একটি কাল এবং একটি সাদা সুতলি বেঁধে নিতেন এবং সাদা কাল এই দু’টির মধ্যে পার্থক্য না দেখা পর্যন্ত তাঁরা পানাহার করতে থাকতেন। এরপর আল্লাহ তা‘আলা-(مِنْ الْفَجْرِ) -ধ্বত্র শব্দটি নাযিল করলে সকলেই বুঝতে পারলেন যে, এ দ্বারা উদ্দেশ্য হল রাত (-এর আধার) এবং দিন (-এর আলো)। (৪৫১১, মুসলিম ১৩/৮, হাঃ ১০৯১) (আধুনিক প্রকাশনীঃ ১৭৮২, ইসলামিক ফাউন্ডেশনঃ ১৭৯৩)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1919,
			"arabicnumber": 1919,
			"text": "",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1920,
			"arabicnumber": 1920,
			"text": "সাহল ইবনু ‘সাদ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি আমার পরিবার-পরিজনের মাঝে সাহরী খেতাম। এরপর আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সাথে সালাতে অংশ গ্রহণ করার জন্য জলদি করতাম। (৫৭৭) (আধুনিক প্রকাশনীঃ ১৭৮৪, ইসলামিক ফাউন্ডেশনঃ ১৭৯৫)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1921,
			"arabicnumber": 1921,
			"text": "যায়দ ইবনু সাবিত (রাঃ) হতে বর্ণিত। তিনি বলেন, আমরা আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সঙ্গে সাহরী খাই এরপর তিনি সালাতের জন্য দাঁড়ান। বর্ণনাকারী বলেন, আমি জিজ্ঞেস করলাম, আযান ও সাহরীর মাঝে কতটুকু ব্যবধান ছিল? তিনি বললেন, পঞ্চাশ আয়াত (পাঠ করা) পরিমাণ। (৫৭৫) (আধুনিক প্রকাশনীঃ ১৭৮৫, ইসলামিক ফাউন্ডেশনঃ ১৭৯৬)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1922,
			"arabicnumber": 1922,
			"text": "لأَنَّ النَّبِيَّ صلى الله عليه وسلم وَأَصْحَابَهُ وَاصَلُوا وَلَمْ يُذْكَرْ السَّحُورُ কেননা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও তাঁর সাহাবীগণ ক্রমাগতভাবে সওম পালন করেছেন কিন্তু সেখানে সাহরীর কোন উল্লেখ নেই। ১৯২২. ‘আবদুল্লাহ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একটানা সওম পালন করতে থাকলে লোকেরাও একটানা সওম পালন করতে শুরু করে। এ কাজ তাদের জন্য কষ্টকর হয়ে দাঁড়াল। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের নিষেধ করলেন। তারা বলল, আপনি যে এক নাগাড়ে সওম পালন করছেন? তিনি বললেনঃ আমি তো তোমাদের মত নই। আমাকে খাওয়ানো হয় ও পান করানো হয়। (১৯৬২, মুসলিম ১৩/১১, হাঃ ১১০২, আহমাদ ৬১৩৩) (আধুনিক প্রকাশনীঃ১৭৮৬, ইসলামিক ফাউন্ডেশনঃ১৭৯৭)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1923,
			"arabicnumber": 1923,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা সাহরী খাও, কেননা সাহরীতে বরকত রয়েছে। (মুসলিম ১৩/৯, হাঃ ১০৯৫, আহমাদ ১১৯৫) (আধুনিক প্রকাশনীঃ১৭৮৭, ইসলামিক ফাউন্ডেশনঃ ১৭৯৮)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1924,
			"arabicnumber": 1924,
			"text": "وَقَالَتْ أُمَّ الدَّرْدَاءِ كَانَ أَبُو الدَّرْدَاءِ يَقُولُ عِنْدَكُمْ طَعَامٌ فَإِنْ قُلْنَا لاَ قَالَ فَإِنِّي صَائِمٌ يَوْمِي هَذَا وَفَعَلَهُ أَبُو طَلْحَةَ وَأَبُو هُرَيْرَةَ وَابْنُ عَبَّاسٍ وَحُذَيْفَةُ উম্মু দারদা (রাঃ) বলেন যে, আবুদ-দারদা (রাঃ) তাঁকে এসে জিজ্ঞেস করতেন, তোমাদের কাছে কিছু খাবার আছে? আমরা যদি বলতাম, নেই, তাহলে তিনি বলতেন, আমি আজ সওম পালন করব। আবূ তালহা, আবূ হুরাইরাহ্, ইবনু ‘আব্বাস এবং হুযায়ফা (রাঃ) অনুরূপ করতেন। ১৯২৪. সালমা ইবনু আকওয়া‘ (রহ.) হতে বর্ণিত যে, ‘আশূরার দিন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক ব্যক্তিকে এ বলে লোকদের মধ্যে ঘোষণা দেয়ার জন্য পাঠালেন যে, যে ব্যক্তি খেয়ে ফেলেছে সে যেন পূর্ণ করে নেয় অথবা বলেছেন, সে যেন সওম আদায় করে নেয় আর যে এখনো খায়নি সে যেন আর না খায়। (২০০৭, ৭২৬৫, মুসলিম ১৩/২১, হাঃ ১১৩৫) (আধুনিক প্রকাশনীঃ ১৭৮৮, ইসলামিক ফাউন্ডেশনঃ ১৭৯৯)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1926,
			"arabicnumber": 1926,
			"text": "",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1927,
			"arabicnumber": 1927,
			"text": "وَقَالَتْ عَائِشَةُ يَحْرُمُ عَلَيْهِ فَرْجُهَا ‘আয়িশাহ (রাযি.) বলেন, সওম পালনকারীর জন্য তার স্ত্রীর লজ্জাস্থান হারাম। ১৯২৭. ‘আয়িশাহ্ (রাযি.) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সওমের অবস্থায় চুমু খেতেন এবং গায়ে গা লাগাতেন। তবে তিনি তার প্রবৃত্তি নিয়ন্ত্রণে তোমাদের চেয়ে অধিক সক্ষম ছিলেন। وَقَالَ قَالَ ابْنُ عَبَّاسٍ (مَآرِبُ) حَاجَةٌ قَالَ طَاوُسٌ (غَيْرِ أُولِي الإِرْبَةِ) الأَحْمَقُ لاَ حَاجَةَ لَهُ فِي النِّسَاءِ ইবনু ‘আব্বাস (রাঃ) বলেন,(مَآرِبُ) মানে হাজত বা চাহিদা। তাউস (রহ.) বলেন, (غَيْرِ أُولِي الإِرْبَةِ) মানে বোধহীন, যার মেয়েদের প্রতি কোন খাহিশ নেই। (১৯২৮, মুসলিম ১৩/১১, হাঃ ১১০৬)(আধুনিক প্রকাশনীঃ ১৭৯০, ইসলামিক ফাউন্ডেশনঃ১৮০১)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1928,
			"arabicnumber": 1928,
			"text": "وَقَالَ جَابِرُ بْنُ زَيْدٍ إِنْ نَظَرَ فَأَمْنَى يُتِمُّ صَوْمَهُ জাবির ইবনু যায়দ (রহ.) বলেন, (নারীদের দিকে) তাকালে যদি বীর্যপাত ঘটে, তাহলেও সওম পূর্ণ করবে। ১৯২৮. ‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, সায়িম অবস্থায় নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর কোন কোন স্ত্রীকে চুমু খেতেন। (এ কথা বলে) ‘আয়িশাহ্ (রাযি.) হেসে দিলেন। (১৯২৭) (আধুনিক প্রকাশনীঃ ১৭৯১, ইসলামিক ফাউন্ডেশনঃ১৮০২)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1929,
			"arabicnumber": 1929,
			"text": "উম্মু সালামাহ (রাযি.) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সঙ্গে একই চাদরে আমি ছিলাম। এমন সময় আমার ঋতু শুরু হল। তখন আমি আমার হায়যের কাপড় পরিধান করলাম। তিনি বললেন : তোমার কী হলো? তোমার কি ঋতু দেখা দিয়েছে? আমি বললাম, হাঁ; অতঃপর আমি আবার তাঁর সঙ্গে চাদরের ভিতর ঢুকে পড়লাম। তিনি এবং আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একই পাত্র হতে গোসল করতেন এবং সায়িম অবস্থায় আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে চুমু দিতেন। (২৯৮) (আধুনিক প্রকাশনীঃ ১৭৯২, ইসলামিক ফাউন্ডেশনঃ ১৮০৩)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1930,
			"arabicnumber": 1930,
			"text": "وَبَلَّ ابْنُ عُمَرَ ثَوْبًا فَأَلْقَاهُ عَلَيْهِ وَهُوَ صَائِمٌ وَدَخَلَ الشَّعْبِيُّ الْحَمَّامَ وَهُوَ صَائِمٌ وَقَالَ ابْنُ عَبَّاسٍ لاَ بَأْسَ أَنْ يَتَطَعَّمَ الْقِدْرَ أَوْ الشَّيْءَ وَقَالَ الْحَسَنُ لاَ بَأْسَ بِالْمَضْمَضَةِ وَالتَّبَرُّدِ لِلصَّائِمِ وَقَالَ ابْنُ مَسْعُودٍ إِذَا كَانَ يَوْمُ صَوْمِ أَحَدِكُمْ فَلْيُصْبِحْ دَهِينًا مُتَرَجِّلاً وَقَالَ أَنَسٌ إِنَّ لِي أَبْزَنَ أَتَقَحَّمُ فِيهِ وَأَنَا صَائِمٌ وَيُذْكَرُ عَنْ النَّبِيِّ أَنَّهُ اسْتَاكَ وَهُوَ صَائِمٌ وَقَالَ ابْنُ عُمَرَ يَسْتَاكُ أَوَّلَ النَّهَارِ وَآخِرَهُ وَلاَ يَبْلَعُ رِيقَهُ وَقَالَ عَطَاءٌ إِنْ ازْدَرَدَ رِيقَهُ لاَ أَقُولُ يُفْطِرُ وَقَالَ ابْنُ سِيرِينَ لاَ بَأْسَ بِالسِّوَاكِ الرَّطْبِ قِيلَ لَهُ طَعْمٌ قَالَ وَالْمَاءُ لَهُ طَعْمٌ وَأَنْتَ تُمَضْمِضُ بِهِ وَلَمْ يَرَ أَنَسٌ وَالْحَسَنُ وَإِبْرَاهِيمُ بِالْكُحْلِ لِلصَّائِمِ بَأْسًا সওমরত অবস্থায় ইবনু ‘উমার (রাঃ) একটি কাপড় ভিজালেন এরপর তা গায়ে দেয়া হলো। সওমরত অবস্থায় শা‘বী (রহ.) গোসলখানায় প্রবেশ করেছেন। ইবনু ‘আব্বাস (রাঃ) বলেন, হাঁড়ি হতে কিছু বা অন্য কোন জিনিস চেটে স্বাদ দেখায় কোন দোষ নেই। হাসান (রহ.) বলেন, সওম পালনকারীর কুলি করা এবং ঠান্ডা লাগান দূষণীয় নয়। ইবনু মাস‘ঊদ (রাঃ) বলেন, তোমাদের কেউ সওম পালন করলে সে যেন সকালে তেল লাগায় এবং চুল আঁচড়িয়ে নেয়। আনাস (রাঃ) বলেন, আমার একটি হাউজ আছে, আমি সায়িম অবস্থায় তাতে প্রবেশ করি। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত যে, তিনি সায়িম অবস্থায় মিস্ওয়াক করতেন। ইবনু ‘উমার (রাঃ) সায়িম অবস্থায় দিনের প্রথমভাগে এবং শেষভাগে মিস্ওয়াক করতেন। ‘আত্বা (রহ.) বলেন, থুথু গিলে ফেললে সওম ভঙ্গ হয়েছে বলা যায় না। ইবনু সীরীন (রহ.) বলেন, কাঁচা মিসওয়াক ব্যবহারে কোন দোষ নেই। প্রশ্ন করা হল, কাঁচা মিসওয়াকের তো স্বাদ রয়েছে? তিনি বলেন, পানিরও তো স্বাদ আছে, অথচ এ পানি দিয়েই তুমি কুলি কর। আনাস (রাঃ), হাসান (রহ.) এবং ইব্রাহীম (রহ.) সায়িমের সুরমা ব্যবহারে কোন দোষ মনে করতেন না। ১৯৩০. ‘আয়িশাহ (রাযি.) হতে বর্ণিত। তিনি বলেন, রমাযান মাসে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর ভোর হয়ে যেত ইহ্তিলাম (স্বপ্নদোষ) ব্যতীত (জুনুবী অবস্থায়)। তখন তিনি গোসল করতেন এবং সওম পালন করতেন। (১৯২৫) (আধুনিক প্রকাশনীঃ ১৭৯৩, ইসলামিক ফাউন্ডেশনঃ ১৮০৪)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1932,
			"arabicnumber": 1932,
			"text": "",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1933,
			"arabicnumber": 1933,
			"text": "وَقَالَ عَطَاءٌ إِنْ اسْتَنْثَرَ فَدَخَلَ الْمَاءُ فِي حَلْقِهِ لاَ بَأْسَ إِنْ لَمْ يَمْلِكْ وَقَالَ الْحَسَنُ إِنْ دَخَلَ حَلْقَهُ الذُّبَاب فَلاَ شَيْءَ عَلَيْهِ وَقَالَ الْحَسَنُ وَمُجَاهِدٌ إِنْ جَامَعَ نَاسِيًا فَلاَ شَيْءَ عَلَيْهِ ‘আত্বা (রহ.) বলেন, নাকে পানি দিতে গিয়ে যদি তা কন্ঠনালীতে ঢুকে যায়, আর সে ফিরাতে সক্ষম না হয় তা হলে কোন দোষ নেই। হাসান (রহ.) বলেন, সায়িম ব্যক্তির কন্ঠনালীতে মাছি ঢুকে পড়লে তার কিছু করতে হবে না। হাসান এবং মুজাহিদ (রহ.) বলেছেন, সায়িম ব্যক্তি যদি ভুলবশতঃ স্ত্রী সহবাস করে ফেলে, তবে তার কিছু করতে হবে না। ১৯৩৩. আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ সওম পালনকারী ভুলক্রমে যদি আহার করে বা পান করে ফেলে, তাহলে সে যেন তার সওম পুরা করে নেয়। কেননা আল্লাহই তাকে পানাহার করিয়েছেন। (৬৬৬৯, মুসলিম ১৩/৩৩, হাঃ ১১৫৫, আহমাদ ৬৬৬৯) (আধুনিক প্রকাশনীঃ ১৭৯৫ ইসলামিক ফাউন্ডেশনঃ ১৮০৬)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1934,
			"arabicnumber": 1934,
			"text": "وَيُذْكَرُ عَنْ عَامِرِ بْنِ رَبِيعَةَ قَالَ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتَاكُ، وَهُوَ صَائِمٌ مَا لاَ أُحْصِي أَوْ أَعُدُّ. وَقَالَ أَبُو هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَوْلاَ أَنْ أَشُقَّ عَلَى أُمَّتِي لأَمَرْتُهُمْ بِالسِّوَاكِ عِنْدَ كُلِّ وُضُوءٍ». وَيُرْوَى نَحْوُهُ عَنْ جَابِرٍ وَزَيْدِ بْنِ خَالِدٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، وَلَمْ يَخُصَّ الصَّائِمَ مِنْ غَيْرِهِ. وَقَالَتْ عَائِشَةُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَطْهَرَةٌ لِلْفَمِ، مَرْضَاةٌ لِلرَّبِّ». وَقَالَ عَطَاءٌ وَقَتَادَةُ يَبْتَلِعُ رِيقَهُ ‘আমির ইবনু রাবী‘আহ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে সায়িম অবস্থায় অসংখ্য বার মিসওয়াক করতে দেখেছি। আবূ হুরাইরাহ্ (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেন যে, তিনি বলেছেন, আমার উম্মাতের জন্য যদি কষ্টকর মনে না করতাম তাহলে প্রতিবার উযুর সময়ই আমি তাদের মিসওয়াকের নির্দেশ দিতাম। জাবির (রাঃ) এবং যায়েদ ইবনু খালিদ (রাঃ)-এর সূত্রে নবী সল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম হতে অনুরূপ বর্ণিত হয়েছে এবং তিনি সায়িম এবং যে সায়িম নয়, তাদের মধ্যে কোন পার্থক্য করেননি। ‘আয়িশাহ্ (রাযি.) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেন যে, মিসওয়াক করায় রয়েছে মুখের পবিত্রতা ও আল্লাহর সন্তুষ্টি। ‘আত্বা (রহ.) এবং কাতাদাহ (রহ.) বলেছেন, সায়িম তার মুখের থুথু গিলে ফেলতে পারে। ১৯৩৪. হুমরান (রহ.) হতে বর্ণিত। তিনি বলেন, আমি ‘উসমান (রাঃ)-কে উযূ করতে দেখেছি। তিনি তিনবার হাতের উপর পানি ঢাললেন। এরপর কুলি করলেন, নাকে পানি দিলেন। অতঃপর তিনবার চেহারা (মুখমন্ডল) ধুলেন। এরপর ডান হাত কনুই পর্যন্ত তিনবার ধুলেন এবং বামহাত কনুই পর্যন্ত তিনবার ধুলেন। এরপর তিনি মাথা মাসাহ করলেন। অতঃপর ডান পা তিনবার ধুলেন অতঃপর বাম পা তিনবার ধুলেন। এরপর বললেন, আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে উযূ করতে দেখেছি আমার এ উযূর মতই। এরপর তিনি বলেছেন, যে ব্যক্তি আমার এ উযূর মত উযূ করে দু’রাক‘আত সালাত আদায় করবে এবং এতে মনে মনে কোন কিছুর চিন্তা-ভাবনায় লিপ্ত হবে না, তার অতীতের সকল গুনাহ ক্ষমা করে দেয়া হবে। (১৫৯) (আধুনিক প্রকাশনীঃ ১৭৯৬, ইসলামিক ফাউন্ডেশনঃ ১৮০৭)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1935,
			"arabicnumber": 1935,
			"text": "بَاب قَوْلِ النَّبِيِّ إِذَا تَوَضَّأَ فَلْيَسْتَنْشِقْ بِمَنْخِرِهِ الْمَاءَ وَلَمْ يُمَيِّزْ بَيْنَ الصَّائِمِ وَغَيْرِهِ ৩০/২৮. অধ্যায় : নবী (সাঃ)-এর বাণী : যখন উযূ করবে তখন নাকের ছিদ্র দিয়ে পানি টেনে নিবে। وَقَالَ الْحَسَنُ لاَ بَأْسَ بِالسَّعُوطِ لِلصَّائِمِ إِنْ لَمْ يَصِلْ إِلَى حَلْقِهِ وَيَكْتَحِلُ وَقَالَ عَطَاءٌ إِنْ تَمَضْمَضَ ثُمَّ أَفْرَغَ مَا فِي فِيهِ مِنْ الْمَاءِ لاَ يَضِيرُهُ إِنْ لَمْ يَزْدَرِدْ رِيقَهُ وَمَاذَا بَقِيَ فِي فِيهِ وَلاَ يَمْضَغُ الْعِلْكَ فَإِنْ ازْدَرَدَ رِيقَ الْعِلْكِ لاَ أَقُولُ إِنَّهُ يُفْطِرُ وَلَكِنْ يُنْهَى عَنْهُ فَإِنْ اسْتَنْثَرَ فَدَخَلَ الْمَاءُ حَلْقَهُ لاَ بَأْسَ لَمْ يَمْلِكْ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সায়িম এবং সায়িম নয়, তাদের মধ্যে কোন পার্থক্য করেননি। হাসান (রহ.) বলেন, সায়িমের জন্য নাকে ঔষধ ব্যবহার করায় দোষ নেই যদি তা কন্ঠনালীতে না পৌঁছে এবং সে সুরমা ব্যবহার করতে পারবে। ‘আত্বা (রহ.) বলেন, কুলি করে মুখের পানি ফেলে দেয়ার পর থুথু এবং মুখের অবশিষ্ট পানি গিলে ফেলায় কোন ক্ষতি নেই এবং সায়িম গোন্দ (আঠা) চিবাবে না। গোন্দ চিবিয়ে যদি কেউ থুথু গিলে ফেলে, তা হলে তার সওম নষ্ট হয়ে যাবে, আমি এ কথা বলছি না, তবে এরূপ করা হতে নিষেধ করা উচিত। وَيُذْكَرُ عَنْ أَبِي هُرَيْرَةَ رَفَعَهُ مَنْ أَفْطَرَ يَوْمًا مِنْ رَمَضَانَ مِنْ غَيْرِ عُذْرٍ وَلاَ مَرَضٍ لَمْ يَقْضِهِ صِيَامُ الدَّهْرِ وَإِنْ صَامَهُ وَبِهِ قَالَ ابْنُ مَسْعُودٍ وَقَالَ سَعِيدُ بْنُ الْمُسَيَّبِ وَالشَّعْبِيُّ وَابْنُ جُبَيْرٍ وَإِبْرَاهِيمُ وَقَتَادَةُ وَحَمَّادٌ يَقْضِي يَوْمًا مَكَانَهُ আবূ হুরাইরাহ্ (রাঃ) হতে একটি মারফূ‘ হাদীস বর্ণিত আছে, যে ব্যক্তি ওযর এবং রোগ ব্যতীত রমাযানের একটি সওম ভেঙ্গে ফেলল, তার সারা জীবনের সওমের দ্বারাও এ কাযা আদায় হবে না, যদিও সে সারা জীবন সওম পালন করে। ইবনু মাস‘ঊদ (রাঃ)-ও অনুরূপ কথাই বলেছেন। সা‘ঈদ ইবনু মুসায়্যাব, শা‘বী, ইবনু যুবায়র, ইব্রাহীম, কাতাদাহ এবং হাম্মাদ (রহ.) বলেছেন, তার স্থলে একদিন কাযা করবে। ১৯৩৫. ‘আয়িশাহ্ (রাযি.) হতে বর্ণিত। তিনি বলেন, এক ব্যক্তি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর কাছে এসে বলল যে, সে তো জ্বলে গেছে। তিনি বললেনঃ তোমার কি হয়েছে? লোকটি বলল, রমাযানে আমি স্ত্রী সহবাস করে ফেলেছি। এ সময় নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর কাছে (খেজুর ভর্তি) ঝুড়ি এল, যাকে ‘আরাক (১৫ সা‘ পরিমাণ) বলা হয়। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ অগ্নিদগ্ধ লোকটি কোথায়? লোকটি বলল, আমি। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ এ গুলো সদাকাহ করে দাও। (৬৮২২) (আধুনিক প্রকাশনীঃ ১৭৯৭, ইসলামিক ফাউন্ডেশনঃ ১৮০৮)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1936,
			"arabicnumber": 1936,
			"text": "فَتُصُدِّقَ عَلَيْهِ فَلْيُكَفِّرْ এবং তাকে সদাকাহ দেয়া হয়, তাহলে সে যেন তা কাফ্ফারা স্বরূপ দিয়ে দেয়। ১৯৩৬. আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমরা আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট উপবিষ্ট ছিলাম। এমন সময় এক ব্যক্তি এসে বলল, হে আল্লাহর রাসূল! আমি ধ্বংস হয়ে গেছি। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমার কী হয়েছে? সে বলল, আমি সায়িম অবস্থায় আমার স্ত্রীর সাথে মিলিত হয়েছি। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আযাদ করার মত কোন ক্রীতদাস তুমি পাবে কি? সে বলল, না। তিনি বললেনঃ তুমি কি একাধারে দু’মাস সওম পালন করতে পারবে? সে বলল, না। এরপর তিনি বললেনঃ ষাটজন মিসকীন খাওয়াতে পারবে কি? সে বলল, না। রাবী বলেন, তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেমে গেলেন, আমরাও এ অবস্থায় ছিলাম। এ সময় নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর কাছে এক ‘আরাক পেশ করা হল যাতে খেজুর ছিল। ‘আরাক হল ঝুড়ি। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ প্রশ্নকারী কোথায়? সে বলল, আমি। তিনি বললেনঃ এগুলো নিয়ে সদাকাহ করে দাও। তখন লোকটি বলল, হে আল্লাহর রাসূল! আমার চাইতেও বেশি অভাবগ্রস্তকে সদাকাহ করব? আল্লাহর শপথ, মাদ্বীনার উভয় লাবা অর্থাৎ উভয় প্রান্তের মধ্যে আমার পরিবারের চেয়ে অভাবগ্রস্ত কেউ নেই। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হেসে উঠলেন এবং তাঁর দাঁত (আনইয়াব) দেখা গেল। অতঃপর তিনি বললেনঃ এগুলো তোমার পরিবারকে খাওয়াও। (১৯৩৭, ২৬০০, ৫৩৬৮, ৬০৮৭, ৬১৬৪, ৬৭০৯, ৬৭১০, ৬৭১১, ৬৮২১, মুসলিম ১৩/১৪, হাঃ ১১১১, আহমাদ ৭২৯৪) (আধুনিক প্রকাশনীঃ ১৭৯৮, ইসলামিক ফাউন্ডেশনঃ ১৮০৯)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1937,
			"arabicnumber": 1937,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত, তিনি বলেন, এক ব্যক্তি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর কাছে এসে বলল, এই হতভাগা স্ত্রী সহবাস করেছে রমাযানে। তিনি বললেনঃ তুমি কি একটি গোলাম আযাদ করতে পারবে? লোকটি বলল, না। তিনি বললেনঃ তুমি কি ক্রমাগত দু’ মাস সিয়াম পালন করতে পারবে? লোকটি বলল, না। তিনি বললেনঃ তুমি কি ষাটজন মিসকীন খাওয়াতে পারবে? সে বলল, না। এমতাবস্থায় নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট এক ‘আরাক অর্থাৎ এক ঝুড়ি খেজুর এল। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ এগুলো তোমার তরফ হতে লোকদেরকে আহার করাও। লোকটি বলল, আমার চাইতেও অধিক অভাবগ্রস্ত কে? অথচ মাদ্বীনার উভয় লাবার অর্থাৎ হাররার মধ্যবর্তী স্থলে আমার পরিবারের চেয়ে অধিক অভাবগ্রস্ত কেউ নেই। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তা হলে তুমি স্বীয় পরিবারকেই খাওয়াও। (১৯৩৬) (আধুনিক প্রকাশনীঃ ১৭৯৯, ইসলামিক ফাউন্ডেশনঃ ১৮১০)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1938,
			"arabicnumber": 1938,
			"text": "وَقَالَ لِي يَحْيَى بْنُ صَالِحٍ حَدَّثَنَا مُعَاوِيَةُ بْنُ سَلاَّمٍ حَدَّثَنَا يَحْيَى عَنْ عُمَرَ بْنِ الْحَكَمِ بْنِ ثَوْبَانَ سَمِعَ أَبَا هُرَيْرَةَ t إِذَا قَاءَ فَلاَ يُفْطِرُ إِنَّمَا يُخْرِجُ وَلاَ يُولِجُ وَيُذْكَرُ عَنْ أَبِي هُرَيْرَةَ أَنَّهُ يُفْطِرُ وَالأَوَّلُ أَصَحُّ وَقَالَ ابْنُ عَبَّاسٍ وَعِكْرِمَةُ الصَّوْمُ مِمَّا دَخَلَ وَلَيْسَ مِمَّا خَرَجَ وَكَانَ ابْنُ عُمَرَ يَحْتَجِمُ وَهُوَ صَائِمٌ ثُمَّ تَرَكَهُ فَكَانَ يَحْتَجِمُ بِاللَّيْلِ وَاحْتَجَمَ أَبُو مُوسَى لَيْلاً وَيُذْكَرُ عَنْ سَعْدٍ وَزَيْدِ بْنِ أَرْقَمَ وَأُمِّ سَلَمَةَ احْتَجَمُوا صِيَامًا وَقَالَ بُكَيْرٌ عَنْ أُمِّ عَلْقَمَةَ كُنَّا نَحْتَجِمُ عِنْدَ عَائِشَةَ فَلاَ تَنْهَى وَيُرْوَى عَنْ الْحَسَنِ عَنْ غَيْرِ وَاحِدٍ مَرْفُوعًا فَقَالَ أَفْطَرَ الْحَاجِمُ وَالْمَحْجُومُ وَقَالَ لِي عَيَّاشٌ حَدَّثَنَا عَبْدُ الأَعْلَى حَدَّثَنَا يُونُسُ عَنْ الْحَسَنِ مِثْلَهُ قِيلَ لَهُ عَنْ النَّبِيِّ قَالَ نَعَمْ ثُمَّ قَالَ اللهُ أَعْلَمُ ইমাম বুখারী (রহ.) বলেন, ইয়াহইয়া ইবনু সালিহ (রহ.) আমাকে বলেছেন...আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত, তিনি বলেন, বমি করলে সওম ভঙ্গ হয় না। কেননা এতে কিছু বের হয়, ভিতরে প্রবেশ করে না। আবূ হুরাইরাহ্ (রাঃ) হতে এও বর্ণিত আছে যে, তিনি বলেছেন, সওম ভঙ্গ হয়ে যাবে। প্রথম উক্তিটি বেশি সহীহ। ইবনু ‘আব্বাস (রাঃ) এবং ‘ইকরিমাহ (রহ.) বলেন, কোন কিছু ভিতরে প্রবেশ করলে সওম নষ্ট হয়; কিন্তু বের হওয়ার কারণে নয়। ইবনু ‘উমার (রাঃ) সায়িম অবস্থায় শিঙ্গা লাগাতেন। অবশ্য পরবর্তী সময় তিনি দিনে শিঙ্গা লাগানো ছেড়ে দিয়ে রাতে শিঙ্গা লাগাতেন। আবূ মূসা (রাঃ) রাতে শিঙ্গা লাগিয়েছেন। সা‘ঈদ, যায়দ ইবনু আরকাম এবং উম্মু সালামাহ (রাযি.) সম্পর্কে বর্ণিত আছে যে, তাঁরা সকলেই সওম পালনকারী অবস্থায় শিঙ্গা লাগাতেন। বুকায়র (রহ.) উম্মু ‘আলকামাহ (রহ.) হতে বর্ণনা করেন যে, আমরা ‘আয়িশাহ্ (রাযি.)-এর সামনে শিঙ্গা লাগাতাম, তিনি আমাদের নিষেধ করতেন না। হাসান (রহ.) হতে একাধিক রাবী সূত্রে মরফূ‘ হাদীসে আছে যে, শিঙ্গা প্রয়োগকারী এবং গ্রহণকারী উভয়ের সওমই নষ্ট হয়ে যাবে। ইমাম বুখারী (রহ.) বলেন, ‘আইয়াশ (রহ.) হাসান (রহ.) হতে আমার নিকট অনুরূপ বর্ণনা করেছেন। তাঁকে প্রশ্ন করা হয়েছিল, এ কি নবী হতে বর্ণিত? তিনি বললেন, হাঁ। অতঃপর তিনি বললেন, আল্লাহই সবচেয়ে অধিক জানেন। ১৯৩৮. ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মুহরিম অবস্থায় শিঙ্গা লাগিয়েছেন এবং সায়িম অবস্থায়ও শিঙ্গা লাগিয়েছেন। (১৮৩৫) (আধুনিক প্রকাশনীঃ ১৮০০, ইসলামিক ফাউন্ডেশনঃ ১৮১১)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1939,
			"arabicnumber": 1939,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সায়িম অবস্থায় শিঙ্গা লাগিয়েছেন। (১৮৩৫) (আধুনিক প্রকাশনীঃ১৮০০ , ইসলামিক ফাউন্ডেশনঃ ১৮১২)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1940,
			"arabicnumber": 1940,
			"text": "সাবিত আল-বুনানী (রহ.) হতে বর্ণিত। তিনি বলেন, আনাস ইবনু মালিক (রাঃ)-কে প্রশ্ন করা হল, আপনারা কি সায়িমের শিঙ্গা লাগানো (রক্তমোক্ষম) অপছন্দ করতেন? তিনি বললেন, না। তবে দুর্বল হয়ে যাওয়ার কারণে অপছন্দ করতাম। শাবাবা (রহ.) শু‘বাহ, (রহ.) হতে عَلَى عَهْدِ النَّبِيِّ ‘নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর যুগে’ কথাটি অতিরিক্ত বর্ণনা করেছেন। (আধুনিক প্রকাশনীঃ ১৮০১, ইসলামিক ফাউন্ডেশনঃ ১৮১৩)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1941,
			"arabicnumber": 1941,
			"text": "ইবনু আবূ আওফা (রাঃ) হতে বর্ণিত। তিনি বলেন, কোন এক সফরে আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সঙ্গে ছিলাম। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক ব্যক্তিকে বললেনঃ সওয়ারী হতে নেমে আমার জন্য ছাতু গুলিয়ে আন। সে বলল, হে আল্লাহর রাসূল! সূর্য এখনো অস্ত যায়নি। তিনি বললেনঃ সওয়ারী হতে নেমে আমার জন্য ছাতু গুলিয়ে আন। সে বলল, হে আল্লাহর রাসূল! সূর্য এখনো ডুবেনি। তিনি বললেনঃ সওয়ারী হতে নামো এবং আমার জন্য ছাতু গুলিয়ে আন। অতঃপর সে সওয়ারী হতে নেমে ছাতু গুলিয়ে আনলে তিনি তা পান করলেন এবং হাতের ইঙ্গিতে বললেনঃ যখন দেখবে রাত এদিক হতে ঘনিয়ে আসছে তখন বুঝবে, সওম পালনকারী ব্যক্তির ইফতারের সময় হয়েছে। জারীর (রাঃ) এবং আবূ বাকর ইবনু ‘আইয়াশ...ইবনু আবূ ‘আওফা (রাঃ) হতে অনুরূপ হাদীস বর্ণনা করেছেন। তিনি বলেন, কোন এক সফরে আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সঙ্গে ছিলাম। (১৯৫৫, ১৯৫৬, ১৯৫৮, ৫২৯৭, মুসলিম ১৩/১০, হাঃ ১১০১, আহমাদ ২৩১) (আধুনিক প্রকাশনীঃ ১৮০২, ইসলামিক ফাউন্ডেশনঃ ১৮১৪)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1942,
			"arabicnumber": 1942,
			"text": "‘আয়িশাহ্ (রাযি.) হতে বর্ণিত। হামযাহ ইবনু ‘আমর আসলামী (রাঃ) বললেন, হে আল্লাহর রাসূল! আমি একাধারে সিয়ামব্রত পালন করছি। (১৯৪৩, মুসলিম ১৩/১৭, হাঃ ১১২১, আহমাদ ১৬০৩৭) (আধুনিক প্রকাশনীঃ ১৮০৩, ইসলামিক ফাউন্ডেশনঃ ১৮১৫)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 1943,
			"arabicnumber": 1943,
			"text": "নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর স্ত্রী ‘আয়িশাহ্ (রাযি.) হতে বর্ণিত যে, হামযাহ ইবনু ‘আমর আসলামী (রাঃ) অধিক সওম পালনে অভ্যস্ত ছিলেন। তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে বললেন, আমি সফরেও কি সওম পালন করতে পারি? তিনি বললেনঃ ইচ্ছা করলে তুমি সওম পালন করতে পার, আবার ইচ্ছা করলে নাও করতে পার। (১৯৪২) (আধুনিক প্রকাশনীঃ ১৮০৩, ইসলামিক ফাউন্ডেশনঃ ১৮১৬)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 1944,
			"arabicnumber": 1944,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সওমের অবস্থায় কোন এক রমাযানে মক্কার পথে যাত্রা করলেন। কাদীদ নামক স্থানে পৌঁছার পর তিনি সওম ভঙ্গ করে ফেললে লোকেরা সকলেই সওম ভঙ্গ করলেন। আবূ ‘আবদুল্লাহ (রহ.) বলেন, ‘উসফান ও কুদায়দ নামক দুই স্থানের মধ্যে কাদীদ একটি ঝর্ণা। (১৯৪৮, ২৯৫৩, ৪২৭৫, ৪২৭৬, ৪২৭৭, ৪২৭৮, ৪২৭৯, মুসলিম ১৩/১৫, হাঃ ১১১৩, আহমাদ ২১৮৫) (আধুনিক প্রকাশনীঃ ১৮০৪, ইসলামিক ফাউন্ডেশনঃ ১৮১৭)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 1945,
			"arabicnumber": 1945,
			"text": "আবুদ্ দারদা (রাঃ) হতে বর্ণিত। তিনি বলেন, কোন এক সফরে প্রচন্ড গরমের দিনে আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সঙ্গে যাত্রা করলাম। গরম এত প্রচন্ড ছিল যে, প্রত্যেকেই আপন আপন হাত মাথার উপর তুলে ধরেছিলেন। এ সময় নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এবং ইবনে রাওয়াহা (রাঃ) ব্যতীত আমাদের কেউই সিয়ামরত ছিলেন না। (মুসলিম ১৩/১৭, হাঃ ১১২২, আহমাদ ২৭৫৭৪) (আধুনিক প্রকাশনীঃ ১৮০৫, ইসলামিক ফাউন্ডেশনঃ ১৮১৮)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 1946,
			"arabicnumber": 1946,
			"text": "জাবির ইবনু ‘আবদুল্লাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক সফরে ছিলেন, হঠাৎ তিনি লোকের জটলা এবং ছায়ার নিচে এক ব্যক্তিকে দেখে জিজ্ঞেস করলেনঃ এর কী হয়েছে? লোকেরা বলল, সে সায়িম। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ সফরে সওম পালনে কোন সওয়াব নেই। (মুসলিম ১৫/১৩, হাঃ ১১১৫, আহমাদ ১৪৪৩৩) (আধুনিক প্রকাশনীঃ ১৮০৬,, ইসলামিক ফাউন্ডেশনঃ ১৮১৯)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 1947,
			"arabicnumber": 1947,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। তিনি বলেন, আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সঙ্গে সফরে যেতাম। সায়িম ব্যক্তি গায়ের সায়িমকে (যে সওম পালন করছে না) এবং গায়ের সায়িম ব্যক্তি সায়িমকে দোষারোপ করত না। (মুসলিম ১৩/১৫, হাঃ ১১১৮) (আধুনিক প্রকাশনীঃ ১৮০৭, ইসলামিক ফাউন্ডেশনঃ ১৮২০)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 1948,
			"arabicnumber": 1948,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মদিনা হতে মক্কা্য় রওয়ানা হলেন। তখন তিনি সওম পালন করছিলেন। ‘উসফানে পৌঁছার পর তিনি পানি আনার জন্য আদেশ করলেন। অতঃপর তিনি লোকদেরকে দেখানোর জন্য পানি হাতের উপর উঁচু করে ধরে সওম ভঙ্গ করলেন এবং এ অবস্থায় মক্কা্য় পৌঁছলেন। এ ছিল রমাযান মাসে। তাই ইবনু ‘আব্বাস (রাঃ) বলতেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সওম পালন করেছেন এবং সওম ভঙ্গ করেছেন। যার ইচ্ছা সওম পালন করতে পারে আর যার ইচ্ছা সওম ভঙ্গ করতে পারে। (১৯৪৪) (আধুনিক প্রকাশনীঃ ১৮০৮, ইসলামিক ফাউন্ডেশনঃ ১৮২১)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 1949,
			"arabicnumber": 1949,
			"text": "(وَبَيِّنَاتٍ مِنْ الْهُدَى وَالْفُرْقَانِ فَمَنْ شَهِدَ مِنْكُمْ الشَّهْرَ فَلْيَصُمْهُ وَمَنْ كَانَ مَرِيضًا أَوْ عَلَى سَفَرٍ فَعِدَّةٌ مِنْ أَيَّامٍ أُخَرَ يُرِيدُ اللهُ بِكُمْ الْيُسْرَ وَلاَ يُرِيدُ بِكُمْ الْعُسْرَ وَلِتُكْمِلُوا الْعِدَّةَ وَلِتُكَبِّرُوا اللهَ عَلَى مَا هَدَاكُمْ وَلَعَلَّكُمْ تَشْكُرُونَ) ইবনু ‘উমার (রাঃ) এবং সালামাহ ইবনু আকওয়া‘ (রাযি.) বলেন যে, উক্ত আয়াতকে রহিত করেছে এ আয়াতঃ ‘‘রমাযান মাস, এ মাসেই কুরআন অবতীর্ণ করা হয়েছে, যা মানুষের জন্য হিদায়াত, সৎপথের স্পষ্ট নিদর্শন এবং সত্যাসত্যের পার্থক্যকারী। সুতরাং তোমাদের মধ্যে যে এ মাস পাবে সে যেন এ মাসে সিয়াম পালন করে। তবে কেউ অসুস্থ হলে কিংবা সফরে থাকলে সে অন্য সময়ে সওম এর সংখ্যা পূরণ করে দিবে। আল্লাহ চান তোমাদের জন্য সহজ করতে, তিনি এমন কিছু চান না যা তোমাদের জন্য কষ্টকর। যাতে তোমরা সংখ্যা পূরণ কর এবং তোমাদের সৎপথে পরিচালিত করার দরুন আল্লাহর মহিমা বর্ণনা কর এবং যাতে তোমরা কৃতজ্ঞতা প্রকাশ করতে পার।’’ (আল-বাকারাহঃ ১৮৫) نَزَلَ رَمَضَانُ فَشَقَّ عَلَيْهِمْ فَكَانَ مَنْ أَطْعَمَ كُلَّ يَوْمٍ مِسْكِينًا تَرَكَ الصَّوْمَ مِمَّنْ يُطِيقُهُ وَرُخِّصَ لَهُمْ فِي ذَلِكَ فَنَسَخَتْهَا (وَأَنْ تَصُومُوا خَيْرٌ لَكُمْ) فَأُمِرُوا بِالصَّوْمِ ইবনু নুমাইর (রহ.) ইবনু আবূ লায়লা (রহ.) হতে বর্ণনা করেন যে, মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সাহাবীগণ আমাদের কাছে বর্ণনা করেছেন, রমাযানের হুকুম নাযিল হলে তা পালন করা তাঁদের জন্য কষ্টকর হয়ে দাঁড়ায়। তাই তাঁদের মধ্যে কেউ সওম পালনে সক্ষম হওয়া সত্ত্বেও সওম ত্যাগ করে প্রতিদিনের পরিবর্তে একজন মিসকীনকে খাওয়াতো। এ ব্যাপারে তাদের অনুমতিও দেওয়া হয়েছিল।(وَأَنْ تَصُومُوا خَيْرٌ لَكُمْ) ‘আর সওম পালন করাই তোমাদের জন্য উত্তম’, এ আয়াতটি পূর্বের হুকুমকে রহিত করে দেয় এবং সবাইকে সওম পালনের নির্দেশ দেয়া হয়। ১৯৪৯. ইবনু ‘উমার (রাঃ) হতে বর্ণিত, তিনি (فِدْيَةٌ طَعَامُ مَسَاكِينَ) আয়াতটি পড়ে বলেছেন যে, ইহা মানসূখ (রহিত)। (৪৫০৬) (আধুনিক প্রকাশনীঃ ১৮০৯, ইসলামিক ফাউন্ডেশনঃ ১৮২২)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 1950,
			"arabicnumber": 1950,
			"text": "وَقَالَ ابْنُ عَبَّاسٍ لاَ بَأْسَ أَنْ يُفَرَّقَ لِقَوْلِ اللهِ تَعَالَى (فَعِدَّةٌ مِنْ أَيَّامٍ أُخَرَ) وَقَالَ سَعِيدُ بْنُ الْمُسَيَّبِ فِي صَوْمِ الْعَشْرِ لاَ يَصْلُحُ حَتَّى يَبْدَأَ بِرَمَضَانَ وَقَالَ إِبْرَاهِيمُ إِذَا فَرَّطَ حَتَّى جَاءَ رَمَضَانُ آخَرُ يَصُومُهُمَا وَلَمْ يَرَ عَلَيْهِ طَعَامًا وَيُذْكَرُ عَنْ أَبِي هُرَيْرَةَ مُرْسَلاً وَابْنِ عَبَّاسٍ أَنَّهُ يُطْعِمُ وَلَمْ يَذْكُرْ اللهُ الإِطْعَامَ إِنَّمَا قَالَ (فَعِدَّةٌ مِنْ أَيَّامٍ أُخَرَ) ইবনু ‘আব্বাস (রাঃ) বলেন, পৃথক পৃথক রাখলে কোন ক্ষতি নেই। কেননা, আল্লাহ বলেছেন, (فَعِدَّةٌ مِنْ أَيَّامٍ أُخَرَ) ‘অন্যদিনে এর সংখ্যা পূর্ণ করবে’- (আল-বাকারাহ (২) : ১৮৪)। সা‘ঈদ ইবনু মুসায়্যাব (রহ.) বলেছেন, রমাযানের কাযা আদায় না করে যুলহাজ্জ মাসের প্রথম দশকে সওম পালন করা উচিত নয়। ইবরাহীম নাখ‘ঈ (রহ.) বলেন, অবহেলার কারণে যদি পরবর্তী রমাযান এসে যায় তাহলে উভয় রমাযানের সওম এক সাথে আদায় করবে। মিসকীন খাওয়াতে হবে বলে তিনি মনে করেন না। আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। একটি মুরসাল হাদীসে এবং ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত আছে যে, সে খাওয়াবে; অথচ আল্লাহ তা‘আলা খাওয়ানোর কথাটি উল্লেখ করেননি। বরং তিনি বলেছেন, ‘অন্যদিনে এর সংখ্যা পূর্ণ করবে’- (আল-বাকারাহ : ১৮৪)। ১৯৫০. ‘আয়িশাহ্ (রাযি.) হতে বর্ণিত। তিনি বলেন, আমার উপর রমাযানের যে কাযা হয়ে যেত তা পরবর্তী শা‘বান ব্যতীত আমি আদায় করতে পারতাম না। ইয়াহ্ইয়া (রাঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর ব্যস্ততার কারণে কিংবা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সঙ্গে ব্যস্ততার কারণে। (মুসলিম ১৩/২৬, হাঃ ১১৪৬) (আধুনিক প্রকাশনীঃ ১৮১০, ইসলামিক ফাউন্ডেশনঃ ১৮২৩)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 1951,
			"arabicnumber": 1951,
			"text": "وَقَالَ أَبُو الزِّنَادِ إِنَّ السُّنَنَ وَوُجُوهَ الْحَقِّ لَتَأْتِي كَثِيرًا عَلَى خِلاَفِ الرَّأْيِ فَمَا يَجِدُ الْمُسْلِمُونَ بُدًّا مِنْ اتِّبَاعِهَا مِنْ ذَلِكَ أَنَّ الْحَائِضَ تَقْضِي الصِّيَامَ وَلاَ تَقْضِي الصَّلاَةَ আবুয-যিনাদ (রহ.) বলেন, শরী‘আতের হুকুম-আহকাম অনেক সময় কিয়াসের বিপরীতও হয়ে থাকে। মুসলিমের জন্য এর অনুসরণ ব্যতীত কোন উপায় নেই। এর একটি উদাহরণ হল যে, ঋতুমতী মহিলা সওমের কাযা করবে কিন্তু সালাতের কাযা করবে না। ১৯৫১. আবূ সা‘ঈদ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ এ কথা কি ঠিক নয় যে, ঋতু শুরু হলে মেয়েরা সালাত আদায় করে না এবং সওমও পালন করে না। এ হল তাদের দ্বীনেরই ত্রুটি। (৩০৪) (আধুনিক প্রকাশনীঃ ১৮১১, ইসলামিক ফাউন্ডেশনঃ ১৮২৪)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 1952,
			"arabicnumber": 1952,
			"text": "وَقَالَ الْحَسَنُ إِنْ صَامَ عَنْهُ ثَلاَثُونَ رَجُلاً يَوْمًا وَاحِدًا جَازَ হাসান (রহ.) বলেন, তার পক্ষ হতে ত্রিশজন লোক একদিন সওম পালন করতে হবে। ১৯৫২. ‘আয়িশাহ্ (রাযি.) হতে বর্ণিত যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন: সওমের কাযা যিম্মায় রেখে যদি কোন ব্যক্তি মারা যায় তাহলে তার অভিভাবক তার পক্ষ হতে সওম আদায় করবে। (মুসলিম ১৩/২৭, হাঃ ১১৪৭) (আধুনিক প্রকাশনীঃ ১৮১২, ইসলামিক ফাউন্ডেশনঃ ১৮২৫) تَابَعَهُ ابْنُ وَهْبٍ عَنْ عَمْرٍو وَرَوَاهُ يَحْيَى بْنُ أَيُّوبَ عَنْ ابْنِ أَبِي جَعْفَرٍ ইবনু ওয়াহাব (রহ.) ‘আমর (রহ.) হতে উক্ত হাদীসটি অনুরূপ বর্ণনা করেছেন। ইয়াহইয়া ইবনু আইয়ুব (রহ.)...ইবনু আবূ জা‘ফর (রহ.) হতেও এ হাদীসটি বর্ণনা করেছেন।",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 1953,
			"arabicnumber": 1953,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট এক ব্যক্তি এসে বলল, হে আল্লাহর রাসূল! আমার মা এক মাসের সওম যিম্মায় রেখে মারা গেছেন, আমি কি তাঁর পক্ষ হতে এ সওম কাযা করতে পারি? তিনি বলেনঃ হাঁ, আল্লাহর ঋণ পরিশোধ করাই হল অধিক যোগ্য। সুলায়মান (রহ.) বলেন, হাকাম (রহ.) এবং সালামাহ (রহ.) বলেছেন, মুসলিম (রহ.) এ হাদীস বর্ণনা করার সময় আমরা সকলেই একসাথে উপবিষ্ট ছিলাম। তাঁরা উভয়ই বলেছেন যে, ইবনু ‘আব্বাস (রাঃ) হতে মুজাহিদ (রহ.)-কে এ হাদীস বর্ণনা করতে আমরা শুনেছি। আবূ খালিদ আহমার (রহ.)....ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত, তিনি বলেন, একজন মহিলা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে বলল, আমার বোন মারা গেছে। ইয়াহইয়া (রহ.) ও আবূ মু‘আবিয়া....ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত, জনৈকা মহিলা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে বলল, আমার মা মারা গেছেন। ‘উবায়দুল্লাহ (রহ.)....ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত, এক মহিলা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে বলল, আমার মা মারা গেছে, অথচ তার যিম্মায় মানতের সওম রয়েছে। আবূ হারীয (রহ.)....ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত, এক মহিলা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে বলল, আমার মা মারা গেছে, অথচ তার যিম্মায় পনের দিনের সওম রয়ে গেছে। (মুসলিম ১৩/২৭, হাঃ ১১৪৮, আহমাদ ৩২২৪) (আধুনিক প্রকাশনীঃ ১৮১৩-১৪, ইসলামিক ফাউন্ডেশনঃ ১৮২৬)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 1954,
			"arabicnumber": 1954,
			"text": "وَأَفْطَرَ أَبُو سَعِيدٍ الْخُدْرِيُّ حِينَ غَابَ قُرْصُ الشَّمْسِ সূর্যের গোলাকার বৃত্ত অদৃশ্য হওয়ার সাথে সাথেই আবূ সা‘ঈদ খুদরী (রাঃ) ইফতার করতেন। ১৯৫৪. ‘উমার ইবনু খাত্তাব (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যখন রাত্র সে দিক হতে ঘনিয়ে আসে ও দিন এ দিক হতে চলে যায় এবং সূর্য ডুবে যায়, তখন সায়িম ইফতার করবে। (মুসলিম ১৩/১০, হাঃ ১১০০, আহমাদ ২৩১) (আধুনিক প্রকাশনীঃ ১৮১৫, ইসলামিক ফাউন্ডেশনঃ ১৮২৭)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 1955,
			"arabicnumber": 1955,
			"text": "‘আবদুল্লাহ ইবনু আবূ আওফা (রাঃ) হতে বর্ণিত। তিনি বলেন, কোন এক সফরে আমরা আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সাথে ছিলাম। আর তিনি ছিলেন সওমের অবস্থায়। যখন সূর্য ডুবে গেল তখন তিনি দলের কাউকে বললেনঃ হে অমুক! উঠ। আমাদের জন্য ছাতু গুলে আন। সে বলল, সন্ধ্যা হলে ভাল হতো। তিনি বললেনঃ নেমে যাও এবং আমাদের জন্য ছাতু গুলে আন। সে বলল, হে আল্লাহর রাসূল! সন্ধ্যা হলে ভাল হতো। তিনি বললেনঃ নেমে যাও এবং আমাদের জন্য ছাতু গুলে আন। সে বলল, দিন তো এখনো রয়ে গেছে। তিনি বললেনঃ তুমি নামো এবং আমাদের জন্য ছাতু গুলে আন। অতঃপর সে নামল এবং তাঁদের জন্য ছাতু গুলে আনল। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তা পান করলেন, অতঃপর বললেনঃ যখন তোমরা দেখবে, রাত একদিক হতে ঘনিয়ে আসছে, তখন সওম পালনকারী ইফতার করবে। (১৯৪১) (আধুনিক প্রকাশনীঃ ১৮১৬, ইসলামিক ফাউন্ডেশনঃ ১৮২৮)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 1956,
			"arabicnumber": 1956,
			"text": "‘আবদুল্লাহ ইবনু আবূ আওফা (রাঃ) হতে বর্ণিত। তিনি বলেন, আমরা আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সঙ্গে রওয়ানা দিলাম এবং তিনি সওমরত ছিলেন। সূর্য অস্ত যেতেই তিনি বললেনঃ তুমি সওয়ারী হতে নেমে আমাদের জন্য ছাতু গুলে আন। তিনি বললেন, হে আল্লাহর রাসূল! আর একটু সন্ধ্যা হতে দিন। তিনি বললেনঃ তুমি নেমে যাও এবং আমাদের জন্য ছাতু গুলে আন। তিনি বললেন, হে আল্লাহর রাসূল! এখনো তো আপনার সামনে দিন রয়েছে। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তুমি নেমে যাও এবং আমাদের জন্য ছাতু গুলে আন। অতঃপর তিনি সওয়ারী হতে নামলেন এবং ছাতু গুলে আনলেন। এরপর আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আঙ্গুল দ্বারা পূর্বদিকে ইঙ্গিত করে বললেনঃ যখন তোমরা দেখবে যে, রাত এদিক হতে আসছে, তখনই সওম পালনকারীর ইফতারের সময় হয়ে গেল। (১৯৪১) (আধুনিক প্রকাশনীঃ ১৮১৭, ইসলামিক ফাউন্ডেশনঃ ১৮২৯)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 1957,
			"arabicnumber": 1957,
			"text": "সাহল ইবনু সা‘দ (রাঃ) হতে বর্ণিত যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ লোকেরা যতদিন শীঘ্র ইফতার করবে [1], ততদিন তারা কল্যাণের উপর থাকবে। (মুসলিম ১৩/৯, হাঃ ১০৯৮, আহমাদ ২২৮২৮) (আধুনিক প্রকাশনীঃ ১৮১৮, ইসলামিক ফাউন্ডেশনঃ ১৮৩০)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 1958,
			"arabicnumber": 1958,
			"text": "ইবনু আবূ ‘আওফা (রাঃ) হতে বর্ণিত। তিনি বলেন, এক সফরে আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সঙ্গে ছিলাম। তিনি সন্ধ্যা পর্যন্ত সওম পালন করেন। এরপর এক ব্যক্তিকে বললেনঃ সওয়ারী হতে নেমে ছাতু গুলে আন। লোকটি বলল, আপনি যদি (পূর্ণ সন্ধ্যা হওয়া পর্যন্ত) অপেক্ষা করতেন। তিনি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পুনরায় বললেনঃ নেমে আমার জন্য ছাতু গুলে আন। [তারপর আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন] যখন তুমি এদিক (পূর্বদিক) হতে রাত্রির আগমন দেখতে পাবে তখন সওম পালনকারী ইফতার করবে। (১৯৪১) (আধুনিক প্রকাশনীঃ ১৮১৯ ইসলামিক ফাউন্ডেশনঃ ১৮৩১)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 1959,
			"arabicnumber": 1959,
			"text": "আসমা বিনত আবূ বাকর (রাযি.) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর যুগে একদা মেঘাচ্ছন্ন দিনে আমরা ইফতার করলাম, এরপর সূর্য দেখা যায়। বর্ণনাকারী হিশামকে জিজ্ঞেস করা হল, তাদের কি কাযা করার নির্দেশ দেয়া হয়েছিল? হিশাম (রহ.) বললেন, কাযা ব্যতীত উপায় কী? (অপর বর্ণনাকারী) মা‘মার (রহ.) বলেন, আমি হিশামকে বলতে শুনেছি, তাঁরা কাযা করেছিলেন কি না তা আমি জানি না। (আধুনিক প্রকাশনীঃ ১৮২০,ইসলামিক ফাউন্ডেশনঃ ১৮৩২)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 1960,
			"arabicnumber": 1960,
			"text": "وَقَالَ عُمَرُ لِنَشْوَانٍ فِي رَمَضَانَ وَيْلَكَ وَصِبْيَانُنَا صِيَامٌ فَضَرَبَهُ রমাযানে দিনের বেলায় এক নেশাগ্রস্ত ব্যক্তিকে ‘উমার (রাঃ) বলেন, আমাদের বাচ্চারা পর্যন্ত সওম পালন করছে। তোমার সর্বনাশ হোক! অতঃপর ‘উমার (রাঃ) তাকে মারলেন। ১৯৬০. রুবায়্যি‘ বিনতু মু‘আব্বিয (রাযি.) হতে বর্ণিত। তিনি বলেন, ‘আশূরার সকালে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আনসারদের সকল পল্লীতে এ নির্দেশ দিলেনঃ যে ব্যক্তি সওম পালন করেনি সে যেন দিনের বাকি অংশ না খেয়ে থাকে, আর যার সওম অবস্থায় সকাল হয়েছে, সে যেন সওম পূর্ণ করে। তিনি (রুবায়্যি‘) (রাযি.) বলেন, পরবর্তীতে আমরা ঐ দিন সওম পালন করতাম এবং আমাদের শিশুদের সওম পালন করাতাম। আমরা তাদের জন্য পশমের খেলনা তৈরি করে দিতাম। তাদের কেউ খাবারের জন্য কাঁদলে তাকে ঐ খেলনা দিয়ে ভুলিয়ে রাখতাম। আর এভাবেই ইফতারের সময় হয়ে যেত। (মুসলিম ১৩/২১, হাঃ ১১৩৬) (আধুনিক প্রকাশনীঃ ১৮২১, ইসলামিক ফাউন্ডেশনঃ ১৮৩৩)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 1961,
			"arabicnumber": 1961,
			"text": "وَمَنْ قَالَ لَيْسَ فِي اللَّيْلِ صِيَامٌ لِقَوْلِهِ تَعَالَى (ثُمَّ أَتِمُّوا الصِّيَامَ إِلَى اللَّيْلِ) وَنَهَى النَّبِيُّ عَنْهُ رَحْمَةً لَهُمْ وَإِبْقَاءً عَلَيْهِمْ وَمَا يُكْرَهُ مِنْ التَّعَمُّقِ আল্লাহ তা‘আলার বাণীঃ ‘‘রাতের আগমন পর্যন্ত সিয়াম পূর্ণ কর’’- (আল-বাকারাহ : ১৮৭)। এর পরিপ্রেক্ষিতে রাতে সওম পালন করা যাবে না বলে যিনি অভিমত ব্যক্ত করেছেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উম্মতের উপর দয়াপরবশ হয়েও তাদের স্বাস্থ্য রক্ষার খাতিরে সওমে বিসাল হতে নিষেধ করেছেন এবং কোন বিষয়ে বাড়াবাড়ি করা নিন্দনীয়। ১৯৬১. আনাস (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমরা সওমে বিসাল পালন করবে না। লোকেরা বলল, আপনি যে সওমে বিসাল করেন? তিনি বললেনঃ আমি তোমাদের মত নই। আমাকে পানাহার করানো হয় (অথবা বললেন) আমি পানাহার অবস্থায় রাত অতিবাহিত করি। (৭২৪১, মুসলিম ১৩/১১, হাঃ ১১০৪) (আধুনিক প্রকাশনীঃ ১৮২২, ইসলামিক ফাউন্ডেশনঃ ১৮৩৪)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 1962,
			"arabicnumber": 1962,
			"text": "‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সওমে বেসাল হতে নিষেধ করলেন। লোকেরা বললো, আপনি যে সওমে বেসাল পালন করেন! তিনি বললেন: আমি তোমাদের মত নই, আমাকে পানাহার করানো হয়। (১৯২২) (আধুনিক প্রকাশনীঃ ১৮২৩ ইসলামিক ফাউন্ডেশনঃ ১৮৩৫)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 1963,
			"arabicnumber": 1963,
			"text": "আবূ সা‘ঈদ (রাঃ) হতে বর্ণিত। তিনি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে বলতে শুনেছেন যে, তোমরা সওমে বিসাল পালন করবে না। তোমাদের কেউ সওমে বিসাল করতে চাইলে সে যেন সাহরীর সময় পর্যন্ত করে। লোকেরা বলল, হে আল্লাহর রাসূল! আপনি যে সওমে বিসাল পালন করেন? তিনি বললেনঃ আমি তোমাদের মত নই, আমি রাত্রি যাপন করি এরূপ অবস্থায় যে, আমার জন্য একজন খাদ্য পরিবেশনকারী থাকেন যিনি আমাকে আহার করান এবং একজন পানীয় পরিবেশনকারী আমাকে পান করান। (১৯৬৭) (আধুনিক প্রকাশনীঃ ১৮২৪, ইসলামিক ফাউন্ডেশনঃ ১৮৩৬)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 1964,
			"arabicnumber": 1964,
			"text": "‘আয়িশাহ্ (রাযি.) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম লোকদের উপর দয়াপরবশ হয়ে তাদেরকে সওমে বেসাল হতে নিষেধ করলে তারা বলল, আপনি যে সওমে বেসাল করে থাকেন! তিনি বললেনঃ আমি তোমাদের মত নই, আমার প্রতিপালক আমাকে পানাহার করান। আবূ ‘আবদুল্লাহ বুখারী (রহ.) বলেন, রাবী ‘উসমান (রহ.) رَحْمَةً لَهُمْ ‘তাদের প্রতি দয়াপরবশ হয়ে’ কথাটি উল্লেখ করেননি। (মুসলিম ১৩/১১, হাঃ ১১০৫, আহমাদ ২৪৯৯৯) (আধুনিক প্রকাশনীঃ ১৮২৫ ইসলামিক ফাউন্ডেশনঃ ১৮৩৭)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 1965,
			"arabicnumber": 1965,
			"text": "رَوَاهُ أَنَسٌ عَنْ النَّبِيِّ صلى الله عليه وسلم আনাস (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এ বর্ণনা করেছেন। ১৯৬৫. আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বিরতিহীন সওম (সওমে বিসাল) পালন করতে নিষেধ করলে মুসলিমদের এক ব্যক্তি তাঁকে বলল, হে আল্লাহর রাসূল! আপনি যে বিরতিহীন (সওমে বিসাল) সওম পালন করেন? তিনি বললেনঃ তোমাদের মধ্যে আমার অনুরূপ কে আছ? আমি এমনভাবে রাত যাপন করি যে, আমার প্রতিপালক আমাকে পানাহার করান। এরপর যখন লোকেরা সওমে বিসাল করা হতে বিরত থাকল না তখন তিনি তাদেরকে নিয়ে দিনের পর দিন (লাগাতার) সওমে বিসাল করতে থাকলেন। এরপর লোকেরা যখন চাঁদ দেখতে পেল তখন তিনি বললেন : যদি চাঁদ উঠতে আরো দেরী হত তবে আমি তোমাদেরকে নিয়ে আরো বেশী দিন সওমে বিসাল করতাম। এ কথা তিনি তাদেরকে শাস্তি প্রদান স্বরূপ বলেছিলেন, যখন তারা বিরত থাকতে অস্বীকৃতি জানিয়েছিল। (১৯৬৬, ৬৮৫১, ৭২৪২, ৭২৯৯, মুসলিম ১৩/১১, হাঃ ১১০৩, আহমাদ ১৩৫৮৩) (আধুনিক প্রকাশনীঃ ১৮২৬, ইসলামিক ফাউন্ডেশনঃ ১৮৩৮)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 1966,
			"arabicnumber": 1966,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তোমরা সওমে বেসাল পালন করা হতে বিরত থাক (বাক্যটি তিনি) দু’বার বললেন। তাঁকে বলা হল, আপনি তো সওমে বেসাল করেন। তিনি বললেনঃ আমি এভাবে রাত যাপন করি যে, আমার প্রতিপালক আমাকে পানাহার করিয়ে থাকেন। তোমরা তোমাদের সাধ্যানুযায়ী আমল করার দায়িত্ব গ্রহণ করো। (১৯৬৫, মুসলিম ১৩/১১, হাঃ ১১০৩, আহমাদ ৮২৩৩) (আধুনিক প্রকাশনীঃ ১৮২৭, ইসলামিক ফাউন্ডেশনঃ ১৮৩৯)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 1967,
			"arabicnumber": 1967,
			"text": "আবূ সা‘ঈদ খুদরী (রাঃ) হতে বর্ণিত। তিনি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে বলতে শুনেছেন যে, তোমরা সওমে বিসাল করবে না। তোমাদের কেউ যদি সওমে বিসাল করতে চায়, তবে যেন সাহরীর সময় পর্যন্ত করে। সাহাবাগণ বললেন, হে আল্লাহর রাসূল! আপনি তো সওমে বিসাল পালন করেন? তিনি বললেনঃ আমি তোমাদের মত নই। আমি এভাবে রাত যাপন করি যে, আমার জন্য একজন আহারদাতা রয়েছেন যিনি আমাকে আহার করান, একজন পানীয় দানকারী আছেন যিনি আমাকে পান করান। (১৯৬৩) (আধুনিক প্রকাশনীঃ ১৮২৮, ইসলামিক ফাউন্ডেশনঃ ১৮৪০)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 1968,
			"arabicnumber": 1968,
			"text": "আবূ জুহায়ফাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সালমান (রাঃ) ও আবুদ দারদা (রাঃ)-এর মাঝে ভ্রাতৃত্ব বন্ধন করে দেন। (একদা) সালমান (রাঃ) আবূদ দারদা (রাঃ)-এর সাথে সাক্ষাৎ করতে এসে উম্মুদ দারদা (রাযি.)-কে মলিন কাপড় পরিহিত দেখতে পান। তিনি এর কারণ জিজ্ঞাসা করলে উম্মুদ দারদা (রাযি.) বললেন, আপনার ভাই আবুদ দারদার পার্থিব কোন কিছুরই প্রতি মোহ নেই। কিছুক্ষণ পরে আবূদ দারদা (রাঃ) এলেন। অতঃপর তিনি সালমান (রাঃ)-এর জন্য খাদ্য প্রস্তুত করান এবং বলেন, আপনি খেয়ে নিন, আমি সাওম পালন করছি। সালমান (রাঃ) বললেন, আপনি না খেলে আমি খাবো না। এরপর আবূদ দারদা (রাঃ) সালমান (রাঃ)-এর সঙ্গে খেলেন। রাত হলে আবূদ দারদা (রাঃ) (সালাত আদায়ে) দাঁড়াতে গেলেন। সালমান (রাঃ) বললেন, এখন ঘুমিয়ে পড়েন। আবূদ দারদা (রাঃ) ঘুমিয়ে পড়লেন। কিছুক্ষণ পরে আবূদ দারদা (রাঃ) আবার সালাতে দাঁড়াতে উদ্যত হলেন, সালমান (রাঃ) বললেন, ঘুমিয়ে পড়েন। যখন রাতের শেষ ভাগ হলো, সালমান (রাঃ) আবূদ দারদা (রাঃ)-কে বললেন, এখন উঠুন। এরপর তাঁরা দু’জনে সালাত আদায় করলেন। পরে সালমান (রাঃ) তাঁকে বললেন, আপনার প্রতিপালকের হাক্ব আপনার উপর আছে। আপনার নিজেরও হাক্ব আপনার উপর রয়েছে। আবার আপনার পরিবারেরও হাক্ব রয়েছে। প্রত্যেক হাক্বদারকে তার হাক্ব প্রদান করুন। এরপর আবূদ দারদা (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট হাজির হয়ে এ ঘটনা বর্ণনা করেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ সালমান ঠিকই বলেছে। (৬১৩৯) (আধুনিক প্রকাশনীঃ ১৮২৯, ইসলামিক ফাউন্ডেশনঃ ১৮৪১)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 1969,
			"arabicnumber": 1969,
			"text": "‘আয়িশাহ্ (রাযি.) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একাধারে (এত অধিক) সওম পালন করতেন যে, আমরা বলাবলি করতাম, তিনি আর সওম পরিত্যাগ করবেন না। (আবার কখনো এত বেশি) সওম পালন না করা অবস্থায় একাধারে কাটাতেন যে, আমরা বলাবলি করতাম, তিনি আর (নফল) সওম পালন করবেন না। আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে রমাযান ব্যতীত কোন পুরা মাসের সওম পালন করতে দেখিনি এবং শা‘বান মাসের চেয়ে কোন মাসে অধিক (নফল) সওম পালন করতে দেখিনি। (১৯৭০, ৬৪৬৫, মুসলিম ১৩/৩৩, হাঃ ১১৫৬, আহমাদ ২৫১৫৫) (আধুনিক প্রকাশনীঃ১৮৩০, ইসলামিক ফাউন্ডেশনঃ১৮৪২)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 1970,
			"arabicnumber": 1970,
			"text": "‘আয়িশাহ্ (রাযি.) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম শা‘বান মাসের চাইতে বেশি (নফল) সওম কোন মাসে পালন করতেন না। তিনি (প্রায়) পুরা শা‘বান মাসই সওম রাখতেন এবং তিনি বলতেনঃ তোমাদের মধ্যে যতটুকু সামর্থ্য আছে ততটুকু (নফল) আমল কর, কারণ তোমরা (আমল করতে করতে) পরিশ্রান্ত হয়ে না পড়া পর্যন্ত আল্লাহ তা‘আলা (সাওয়াব দান) বন্ধ করেন না। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর কাছে সর্বাপেক্ষা পছন্দনীয় সালাত ছিল তাই- যা যথাযথ নিয়মে সর্বদা আদায় করা হত, যদিও তা পরিমাণে কম হত এবং তিনি যখন কোন (নফল) সালাত আদায় করতেন পরবর্তীতে তা অব্যাহত রাখতেন। (১৯৬৯, মুসলিম ১৩/৩৩, হাঃ ১১৫৬, আহমাদ ২৪৫৯৪) (আধুনিক প্রকাশনীঃ ১৮৩১, ইসলামিক ফাউন্ডেশনঃ ১৮৪৩)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 1971,
			"arabicnumber": 1971,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রমাযান ব্যতীত কোন মাসে পুরা মাসের সওম পালন করেননি। তিনি এমনভাবে (নফল) সওম পালন করতেন যে, কেউ বলতে চাইলে বলতে পারতো, আল্লাহর কসম! তিনি আর সওম পালন পরিত্যাগ করবেন না। আবার এমনভাবে (নফল) সওম ছেড়ে দিতেন যে, কেউ বলতে চাইলে বলতে পারতো আল্লাহর কসম! তিনি আর সওম পালন করবেন না। (মুসলিম ১৩/৩৩, হাঃ ১১৫৭, আহমাদ ২১৫১) (আধুনিক প্রকাশনীঃ ১৮৩২ ইসলামিক ফাউন্ডেশনঃ১৮৪৪)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 1972,
			"arabicnumber": 1972,
			"text": "আনাস (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কোন মাসে এভাবে সওম ছেড়ে দিতেন যে, আমরা মনে করতাম, তিনি এ মাসে আর সওম পালন করবেন না। আবার কোন মাসে এভাবে সওম পালন করতেন যে, আমরা মনে করতাম তিনি এ মাসে আর সওম ছাড়বেন না। আর তুমি যদি তাঁকে রাতে সালাত আদায়রত অবস্থায় দেখতে চাইতে তবে তা দেখতে পেতে, আবার যদি তুমি তাঁকে ঘুমন্ত দেখতে চাইতে তবে তাও দেখতে পেতে। সুলায়মান (রহ.) হুমাইদ (রহ.) সূত্রে বলেন যে, তিনি আনাস (রাঃ)-কে সওম সম্পর্কে জিজ্ঞেস করেছেন। (১১৪১) (আধুনিক প্রকাশনীঃ ১৮৩৩, ইসলামিক ফাউন্ডেশনঃ ১৮৪৫)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 1973,
			"arabicnumber": 1973,
			"text": "হুমাইদ (রহ.) হতে বর্ণিত। তিনি বলেন, আমি আনাস (রাঃ)-কে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর (নফল) সওমের ব্যাপারে জিজ্ঞেস করলে তিনি বললেন, যে কোন মাসে আমি তাঁকে সওম পালনরত অবস্থায় দেখতে চেয়েছি, তাঁকে সে অবস্থায় দেখেছি, আবার তাঁকে সওম পালন না করা অবস্থায় দেখতে চাইলে তাও দেখতে পেয়েছি। রাতে যদি তাঁকে সালাত আদায়রত অবস্থায় দেখতে চেয়েছি, তা প্রত্যক্ষ করেছি। আবার ঘুমন্ত দেখতে চাইলে তাও দেখতে পেয়েছি। আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর হাত মুবারক হতে নরম কোন পশমী বা রেশমী কাপড় স্পর্শ করি নাই। আর আমি তাঁর (শরীরের) ঘ্রাণ হতে অধিক সুগন্ধযুক্ত কোন মিশক বা আম্বর পাইনি। (১১৪১) (আধুনিক প্রকাশনীঃ ১৮৩৪, ইসলামিক ফাউন্ডেশনঃ ১৮৪৬)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 1974,
			"arabicnumber": 1974,
			"text": "‘আবদুল্লাহ ইবনু ‘আমর ইবনুল ‘আস (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার কাছে এলেন। এরপর তিনি [‘আবদুল্লাহ (রাঃ)] হাদীসটি বর্ণনা করেন অর্থাৎ ‘‘তোমার উপর মেহমানের হাক্ব আছে, তোমার উপর তোমার স্ত্রীর হাক্ব আছে।’’ আমি জিজ্ঞেস করলাম, সওমে দাঊদ (‘আ) কি? তিনি বললেন, ‘‘অর্ধেক বছর’’ (-এর সওম পালন করা)। (১১৩১) (আধুনিক প্রকাশনীঃ ১৮৩৫, ইসলামিক ফাউন্ডেশনঃ ১৮৪৭)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 1975,
			"arabicnumber": 1975,
			"text": "‘আবদুল্লাহ ইবনু ‘আমর ইবনুল ‘আস (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে বললেনঃ হে ‘আবদুল্লাহ! আমি এ সংবাদ পেয়েছি যে, তুমি প্রতিদিন সওম পালন কর এবং সারা রাত সালাত আদায় করে থাক। আমি বললাম, ঠিক (শুনেছেন) হে আল্লাহর রাসূল! তিনি বললেনঃ এরূপ করবে না (বরং মাঝে মাঝে) সওম পালন কর আবার ছেড়েও দাও। (রাতে) সালাত আদায় কর আবার ঘুমাও। কেননা তোমার উপর তোমার শরীরের হাক্ব রয়েছে, তোমার চোখের হাক্ব রয়েছে, তোমার উপর তোমার স্ত্রীর হাক্ব আছে, তোমার মেহমানের হাক্ব আছে। তোমার জন্য যথেষ্ট যে, তুমি প্রত্যেক মাসে তিন দিন সওম পালন কর। কেননা নেক ‘আমলের বদলে তোমার জন্য রয়েছে দশগুণ নেকী। এভাবে সারা বছরের সওম হয়ে যায়। আমি (বললাম) আমি এর চেয়েও কঠোর ‘আমল করতে সক্ষম। তখন আমাকে আরও কঠিন ‘আমলের অনুমতি দেয়া হল। আমি বললাম, হে আল্লাহর রাসূল! আমি আরো বেশি শক্তি রাখি। তিনি বললেনঃ তবে আল্লাহর নবী দাঊদ (আঃ)-এর সওম পালন কর, এর হতে বেশি করতে যেয়ো না। আমি জিজ্ঞেস করলাম, আল্লাহর নবী দাঊদ (আঃ)-এর সওম কেমন? তিনি বললেনঃ অর্ধেক বছর। রাবী বলেন, ‘আবদুল্লাহ (রাঃ) বৃদ্ধ বয়সে বলতেন, আহা! আমি যদি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম প্রদত্ত রুখসত (সহজতর বিধান) কবূল করে নিতাম! (১১৩১, মুসলিম ১৩/৩৩৫, হাঃ ১১৫৯, আহমাদ ৬৭৭৩) (আধুনিক প্রকাশনীঃ ১৮৩৬, ইসলামিক ফাউন্ডেশনঃ১৮৪৮)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 1976,
			"arabicnumber": 1976,
			"text": "‘আবদুল্লাহ ইবনু ‘আমর (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট আমার সম্পর্কে এ কথা পৌঁছে যায় যে, আমি বলেছি, আল্লাহর কসম, আমি যতদিন বেঁচে থাকব ততদিন সওম পালন করব এবং রাতভর সালাত আদায় করব। তিনি আমাকে জিজ্ঞেস করায় আমি বললাম, আপনার উপর আমার পিতা-মাতা কুরবান হোন! আমি এ কথা বলেছি। তিনি বললেনঃ তুমি তো এরূপ করতে সক্ষম হবে না। বরং তুমি সওম পালন কর ও ছেড়েও দাও, (রাতে) সালাত আদায় কর ও নিদ্রাও যাও। তুমি মাসে তিন দিন করে সওম পালন কর, কারণ নেক কাজের ফল তার দশগুণ; এভাবেই সারা বছরের সওম পালন হয়ে যাবে। আমি বললাম, আমি এর হতে বেশি করার সামর্থ্য রাখি। তিনি বললেনঃ তাহলে একদিন সওম পালন কর এবং দু’দিন ছেড়ে দাও। আমি বললাম, আমি এর হতে বেশি করার শক্তি রাখি। তিনি বললেনঃ তাহলে একদিন সওম পালন কর আর একদিন ছেড়ে দাও। এ হল দাঊদ (আঃ)-এর সওম এবং এ হল সর্বোত্তম (সওম)। আমি বললাম, আমি এর চেয়ে বেশি করার সামর্থ্য রাখি। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ এর চেয়ে উত্তম সওম (রাখার পদ্ধতি) আর নেই। (১১৩১) (আধুনিক প্রকাশনীঃ ১৮৩৭, ইসলামিক ফাউন্ডেশনঃ ১৮৪৯)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 1977,
			"arabicnumber": 1977,
			"text": "رَوَاهُ أَبُو جُحَيْفَةَ عَنْ النَّبِيِّ صلى الله عليه وسلم আবূ জুহায়ফাহ (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এরূপ বর্ণনা করেছেন। ১৯৭৭. ‘আবদুল্লাহ ইবনু ‘আমর (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট এ সংবাদ পৌঁছে যে, আমি একটানা সওম পালন করি এবং রাতভর সালাত আদায় করি। এরপর হয়ত তিনি আমার কাছে লোক পাঠালেন অথবা আমি তাঁর সঙ্গে সাক্ষাত করলাম। তিনি বললেনঃ আমি কি এ কথা ঠিক শুনিনি যে, তুমি সওম পালন করতে থাক আর ছাড় না এবং তুমি (রাতভর) সালাত আদায় করতে থাক আর ঘুমাও না? (আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন)ঃ তুমি সওম পালন কর এবং মাঝে মাঝে তা ছেড়েও দাও। রাতে সালাত আদায় কর এবং নিদ্রাও যাও। কেননা তোমার উপর তোমার চোখের হক রয়েছে এবং তোমার নিজের শরীরের ও তোমার পরিবারের হক তোমার উপর আছে। ‘আবদুল্লাহ (রাঃ) বললেন, আমি এর চেয়ে বেশি শক্তি রাখি। তিনি [আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ] বললেনঃ তাহলে তুমি দাঊদ (আঃ)-এর সিয়াম পালন কর। রাবী বলেন, ‘আবদুল্লাহ (রাঃ) বললেন, তা কিভাবে? তিনি বললেনঃ দাঊদ (আঃ) একদিন সওম পালন করতেন, একদিন ছেড়ে দিতেন এবং তিনি (শত্রুর) সম্মুখীন হলে পলায়ন করতেন না। ‘আবদুল্লাহ (রাঃ) বললেন, হে আল্লাহর নবী! আমাকে এ শক্তি কে যোগাবে? বর্ণনাকারী ‘আত্বা (রহ.) বলেন, (এ হাদীসে) কিভাবে সব সময়ের সিয়ামের প্রসঙ্গ আসে সে কথাটুকু আমার মনে নেই (অবশ্য) এতটুকু মনে আছে যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দু’বার এ কথাটি বলেছেন, সব সময়ের সওম কোন সওম নয়। (১১৩১) (আধুনিক প্রকাশনীঃ ১৮৩৮, ইসলামিক ফাউন্ডেশনঃ ১৮৫০)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 1978,
			"arabicnumber": 1978,
			"text": "‘আবদুল্লাহ ইবনু ‘আমর (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তুমি প্রতি মাসে তিন দিন সওম পালন কর। ‘আবদুল্লাহ (রাঃ) বললেন, আমি এর চেয়ে বেশি করার শক্তি রাখি। এভাবে তিনি বৃদ্ধির আবেদন করতে লাগলেন, অবশেষে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ একদিন সওম পালন কর আর একদিন ছেড়ে দাও এবং আরো বললেনঃ প্রতি মাসে (এক খতম) কুরআন পাঠ কর। তিনি বললেন, আমি এর চেয়ে বেশি শক্তি রাখি। এভাবে বলতে লাগলেন, অবশেষে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তাহলে তিন দিনে (পাঠ কর)। (১১৩১) (আধুনিক প্রকাশনীঃ ১৮৩৯, ইসলামিক ফাউন্ডেশনঃ ১৮৫১)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 1979,
			"arabicnumber": 1979,
			"text": "‘আবদুল্লাহ ইবনু ‘আমর ইবনুল ‘আস (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে জিজ্ঞেস করলেনঃ তুমি কি সব সময় সওম পালন কর এবং রাতভর সালাত আদায় করে থাক? আমি বললাম, জী হাঁ। তিনি বললেনঃ তুমি এরূপ করলে চোখ বসে যাবে এবং শরীর দুর্বল হয়ে পড়বে। যে সারা বছর সওম পালন করে সে যেন সওম পালন করে না। মাসে তিন দিন করে সওম পালন করা সারা বছর সওম পালনের সমতুল্য। আমি বললাম, আমি এর চেয়ে বেশি করার সামর্থ্য রাখি। তিনি বললেনঃ তাহলে তুমি দাঊদী সওম পালন কর, তিনি একদিন সওম পালন করতেন আর একদিন ছেড়ে দিতেন এবং যখন শত্রুর সম্মুখীন হতেন তখন পলায়ন করতেন না। (১১৩১) (আধুনিক প্রকাশনীঃ ১৮৪০, ইসলামিক ফাউন্ডেশনঃ ১৮৫২)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 1980,
			"arabicnumber": 1980,
			"text": "‘আবদুল্লাহ ইবনু ‘আমর (রাঃ) সূত্রে বর্ণিত। তিনি বলেন যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট আমার সওমের (সওম পালনের পদ্ধতি সম্পর্কে) আলোচনা করায় তিনি আমার এখানে আগমন করেন। আমি তাঁর জন্য খেজুরের গাছের ছালে পরিপূর্ণ চামড়ার বালিশ (হেলান দিয়ে বসার জন্য) উপস্থিত করলাম। তিনি মাটিতে বসে পড়লেন। বালিশটি তাঁর ও আমার মাঝে পড়ে থাকল। তিনি বললেনঃ প্রতি মাসে তুমি তিন দিন সওম পালন করলে হয় না? ‘আবদুল্লাহ (রাঃ) বলেন, আমি বললাম, হে আল্লাহর রাসূল! (আরো করতে সক্ষম)। তিনি বললেনঃ সাত দিন। আমি বললাম, হে আল্লাহর রাসূল! (আরো করতে সক্ষম)। তিনি বললেনঃ নয় দিন। আমি বললাম, হে আল্লাহর রাসূল! (আরো করতে সক্ষম)। তিনি বললেনঃ এগারো দিন। এরপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, দাঊদ (‘আ)-এর সওমের চেয়ে উত্তম সওম আর হয় না- (তা হচ্ছে) অর্ধেক বছর, একদিন সওম পালন কর ও একদিন ছেড়ে দাও। (১১৩১) (আধুনিক প্রকাশনীঃ ১৮৪১, ইসলামিক ফাউন্ডেশনঃ ১৮৫৩)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 1981,
			"arabicnumber": 1981,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমার বন্ধু সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে তিনটি বিষয়ে নির্দেশ দিয়েছেন, প্রতি মাসে তিন দিন করে সওম পালন করা এবং দু‘রাক‘আত সালাতুয-যুহা এবং ঘুমানোর পূর্বে বিতর সালাত আদায় করা। (১১৭৮) (আধুনিক প্রকাশনীঃ ১৮৪২, ইসলামিক ফাউন্ডেশনঃ ১৮৫৪)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 1982,
			"arabicnumber": 1982,
			"text": "আনাস (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (আমার মাতা) উম্মু সুলাইম (রাযি.)-এর ঘরে আগমন করলেন। তিনি তাঁর সামনে খেজুর ও ঘি পেশ করলেন। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমাদের ঘি মশকে এবং খেজুর তার বরতনে রেখে দাও। কারণ আমি সায়িম। এরপর তিনি ঘরের এক পাশে গিয়ে নফল সালাত আদায় করলেন এবং উম্মু সুলাইম (রাযি.) ও তাঁর পরিজনের জন্য দু‘আ করলেন। উম্মু সুলাইম (রাযি.) আরয করলেন, হে আল্লাহর রাসূল! আমার একটি ছোট ছেলে আছে। তিনি বললেনঃ কে সে? উম্মু সুলাইম (রাযি.) বললেন, আপনার খাদেম আনাস। তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার জন্য দুনিয়া ও আখিরাতের যাবতীয় কল্যাণের দু‘আ করলেন। তিনি বললেনঃ হে আল্লাহ! তুমি তাকে মাল ও সন্তান-সন্ততি দান কর এবং তাকে বরকত দাও। আনাস (রাঃ) বলেন, আমি আনসারগণের মধ্যে অধিক সম্পদশালীদের একজন। এবং আমার কন্যা উমায়না আমাকে জানিয়েছে যে, হাজ্জাজ (ইবনু ইউসুফ) বসরায় আগমনের পূর্ব পর্যন্ত একশত বিশের অধিক আমার নিজের সন্তান মারা গেছে। হুমায়দ (রহ.) আনাস (রাঃ)-কে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে হাদীস বর্ণনা করতে শুনেছেন। (৬৩৩৪, ৬৩৪৪, ৬৩৭৮, ৬৩৮০) (আধুনিক প্রকাশনীঃ ১৮৪৩, ইসলামিক ফাউন্ডেশনঃ ১৮৫৫ ও ১৮৫৬)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 1983,
			"arabicnumber": 1983,
			"text": "১৯৮৩­. ‘ইমরান ইবনু হুইায়ন (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে অথবা (রাবী বলেন) অন্য এক ব্যক্তিকে জিজ্ঞেস করেন এবং ‘ইমরান (রাঃ) তা শুনছিলেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ হে অমুকের পিতা!! তুমি কি এ মাসের শেষভাগে সওম পালন করনি? (রাবী) বলেন, আমার মনে হয় (আমার ওস্তাদ) বলেছেন, অর্থাৎ রমাযান। লোকটি উত্তর দিল, হে আল্লাহর রাসূল! না। তিনি বললেনঃ যখন সওম পালন শেষ করবে তখন দু’দিন সওম পালন করে নিবে। আমার মনে হয় সালত (রহ.) রমাযান শব্দটি বর্ণনা করেননি। সাবিত (রহ.) ‘ইমরান সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে مِنْ سَرَرِ شَعْبَانَ শা‘বানের শেষভাগে বলে উল্লেখ করেছেন। আবূ ‘আবদুল্লাহ বুখারী (রহ.) বলেন, শা‘বান শব্দটি অধিকতর সহীহ। (মুসলিম ১৩/৩৬, হাঃ ১১৬১) (আধুনিক প্রকাশনীঃ ১৮৪৪, ইসলামিক ফাউন্ডেশনঃ ১৮৫৭)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 1984,
			"arabicnumber": 1984,
			"text": "মুহাম্মাদ ইবনু ‘আব্বাদ (রহ.) হতে বর্ণিত। তিনি বলেন, আমি জাবির ইবনু ‘আবদুল্লাহ (রাঃ)-কে জিজ্ঞেস করলাম যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কি জুমু‘আর দিনে (নফল) সওম পালন করতে নিষেধ করেছেন? উত্তরে তিনি বললেন, হাঁ। আবূ ‘আসিম (রহ.) ব্যতীত অন্যেরা অতিরিক্ত বর্ণনা করেছেন যে, পৃথকভাবে জুমু‘আর দিনের সওম পালন (-কে নিষেধ করেছেন)। (মুসলিম ১৩/২৩, হাঃ ১১৪৩, আহমাদ ১৪১৫৬) (আধুনিক প্রকাশনীঃ ১৮৪৫, ইসলামিক ফাউন্ডেশনঃ ১৮৫৮)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 1985,
			"arabicnumber": 1985,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে বলতে শুনেছি যে, তোমাদের কেউ যেন শুধু জুম‘আর দিনে সওম পালন না করে কিন্তু তার পূর্বে একদিন অথবা পরের দিন (যদি পালন করে তবে জুমু‘আর দিনে সওম পালন করা যায়)। (মুসলিম ১৩/২৪, হাঃ ১১৪৪, আহমাদ ১০৮০৮) (আধুনিক প্রকাশনীঃ ১৮৪৬, ইসলামিক ফাউন্ডেশনঃ ১৮৫৯)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 1986,
			"arabicnumber": 1986,
			"text": "জুয়াইরিয়া বিনতে হারিস (রাযি.) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জুমু‘আর দিনে তাঁর নিকট প্রবেশ করেন তখন তিনি (জুয়াইরিয়া) সওম পালনরত ছিলেন। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে জিজ্ঞেস করলেনঃ তুমি কি গতকাল সওম পালন করেছিলে? তিনি বললেন, না। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জিজ্ঞেস করলেনঃ তুমি কি আগামীকাল সওম পালনের ইচ্ছা রাখ? তিনি বললেন, না। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তাহলে সওম ভেঙ্গে ফেল। হাম্মাদ ইবনুল জা‘দ (রহ.) স্বীয় সূত্রে জুয়াইরিয়া (রাযি.) হতে বর্ণনা করেন যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে আদেশ দেন এবং তিনি সওম ভঙ্গ করেন। (আধুনিক প্রকাশনীঃ ১৮৪৭, ইসলামিক ফাউন্ডেশনঃ ১৮৬০)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 1987,
			"arabicnumber": 1987,
			"text": "‘আলকামা (রহ.) হতে বর্ণিত। তিনি বলেন, আমি ‘আয়িশাহ্ (রাযি.)-কে জিজ্ঞাসা করলাম যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কি কোন দিন কোন কাজের জন্য নির্দিষ্ট করে নিতেন? উত্তরে তিনি বললেন, না, বরং তাঁর ‘আমল স্থায়ী হতো এবং আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যে সব ‘আমল করার শক্তি-সামর্থ্য রাখতেন তোমাদের মধ্যে কে আছে যে সে সবের সামর্থ্য রাখে? (৬৪৬৬) (আধুনিক প্রকাশনীঃ ১৮৪৮, ইসলামিক ফাউন্ডেশনঃ ১৮৬১)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 1988,
			"arabicnumber": 1988,
			"text": "উম্মুল ফাযল বিনত হারিস (রাযি.) সূত্রে বর্ণনা করেন যে, কিছু সংখ্যক লোক ‘আরাফাতের দিনে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সওম পালন সম্পর্কে তাঁর কাছে সন্দেহ প্রকাশ করে। তাদের কেউ বলল, তিনি সওম পালন করেছেন। আর কেউ বলল, না, তিনি করেননি। এতে উম্মুল ফাযল (রাযি.) এক পেয়ালা দুধ আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট পাঠিয়ে দিলেন এবং তিনি তা পান করে নিলেন। এ সময় তিনি উটের পিঠে (‘আরাফাতে) উকূফ অবস্থায় ছিলেন। (১৬৫৮) (আধুনিক প্রকাশনীঃ ১৮৪৯, ইসলামিক ফাউন্ডেশনঃ ১৮৬২)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 1989,
			"arabicnumber": 1989,
			"text": "মায়মূনাহ (রাযি.) হতে বর্ণিত যে, কিছু সংখ্যক লোক ‘আরাফাতের দিনে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সওম পালন সম্পর্কে সন্দেহ প্রকাশ করলে তিনি স্বল্প পরিমাণ দুধ আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট পাঠিয়ে দিলে তিনি তা পান করলেন ও লোকেরা তা প্রত্যক্ষ করছিল। তখন তিনি (‘আরাফাতে) অবস্থান স্থলে ওকূফ করছিলেন। (মুসলিম ১৩/১৮, হাঃ ১১২৪) (আধুনিক প্রকাশনীঃ ১৮৫০, ইসলামিক ফাউন্ডেশনঃ ১৮৬৩)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 1990,
			"arabicnumber": 1990,
			"text": "বনূ আযহারের আযাদকৃত গোলাম আবূ ‘উবাইদ (রহ.) হতে বর্ণিত। তিনি বলেন, আমি একদা ঈদে ‘উমার ইবনুল খাত্তাব (রাঃ)-এর সাথে ছিলাম, তখন তিনি বললেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এই দুই দিনে সওম পালন করতে নিষেধ করেছেন। (ঈদুল ফিত্রের দিন) যে দিন তোমরা তোমাদের সওম ছেড়ে দাও। আরেক দিন, যেদিন তোমরা তোমাদের কুরবানীর গোশত্ খাও। আবূ ‘আবদুল্লাহ (রহ.) বলেন, ইবনু ‘উয়ায়নাহ (রহ.) বলেন, যিনি ইবনু আযহারের মাওলা বলে উল্লেখ করেছেন, তিনি ঠিক বর্ণনা করেছেন; আর যিনি ‘আবদুর রহমান ইবনু ‘আওফ (রাঃ)-এর মাওলা বলেছেন, তিনিও ঠিক বর্ণনা করেছেন। (৫৫৭১, মুসলিম ১৩/২২, হাঃ ১১৩৭, আহমাদ ২২৪) (আধুনিক প্রকাশনীঃ ১৮৫১, ইসলামিক ফাউন্ডেশনঃ ১৮৬৪)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 1992,
			"arabicnumber": 1992,
			"text": "",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 1993,
			"arabicnumber": 1993,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, দু’ (দিনের) সওম ও দু’ (প্রকারের) ক্রয়-বিক্রয় নিষেধ করা হয়েছে, ঈদুল ফিতর ও কুরবানীর (দিনের) সওম এবং মুলামাসা ও মুনাবাযা (পদ্ধতিতে ক্রয়-বিক্রয়) হতে। (৩৬৮, মুসলিম ২১/১, হাঃ ১৫১১) (আধুনিক প্রকাশনীঃ ১৮৫৩, ইসলামিক ফাউন্ডেশনঃ ১৮৬৬)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 1994,
			"arabicnumber": 1994,
			"text": "যিয়াদ ইবনু জুবাইর (রহ.) হতে বর্ণিত। তিনি বলেন, এক ব্যক্তি এসে (‘আবদুল্লাহ) ইবনু ‘উমার (রাঃ)-কে বলল যে, এক ব্যক্তি কোন এক দিনের সওম পালন করার মানৎ করেছে, আমার মনে হয় সে সোমবারের কথা বলেছিল। ঘটনাক্রমে ঐ দিন ঈদের দিন পড়ে যায়। ইবনু ‘উমার (রাঃ) বললেন, আল্লাহ তা‘আলা মানৎ পুরা করার নির্দেশ দিয়েছেন আর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এই (ঈদের) দিনে সওম পালন করতে নিষেধ করেছেন। (৬৭০৫, ৬৭০৬, মুসলিম ১৩/২২, হাঃ ১১৩৯) (আধুনিক প্রকাশনীঃ ১৮৫৪, ইসলামিক ফাউন্ডেশনঃ ১৮৬৭)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 1995,
			"arabicnumber": 1995,
			"text": "আবূ সা‘ঈদ খুদরী (রাঃ) হতে বর্ণিত। যিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সাথে বারোটি যুদ্ধে শরীক ছিলেন, তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে চারটি কথা শুনেছি, যা আমার খুব ভালো লেগেছে। তিনি বলেছেন, স্বামী অথবা মাহরাম (যার সঙ্গে বিবাহ নিষিদ্ধ) পুরুষ ব্যতীত কোন নারী যেন দুই দিনের দূরত্বের সফর না করে। ঈদুল ফিতর ও কুরবানীর দিনে সওম নেই। ফজরের সালাতের পরে সূর্যোদয় এবং ‘আসরের সালাতের পরে সূর্যাস্ত পর্যন্ত কোন সালাত নেই। মসজিদে হারাম, মসজিদে আকসা ও আমার এই মাসজিদ ছাড়া অন্য কোন মসজিদের উদ্দেশে কেউ যেন সফর না করে। (৫৮৬) (আধুনিক প্রকাশনীঃ ১৮৫৫, ইসলামিক ফাউন্ডেশনঃ ১৮৬৮)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 1996,
			"arabicnumber": 1996,
			"text": "মুহাম্মাদ ইবনুল মুসান্না (রহ.) ... হিশাম (রহ.) সূত্রে বর্ণিত যে, আমার পিতা আমার নিকট বর্ণনা করেছেন, ‘আয়িশাহ্ (রাযি.) মিনাতে (অবস্থানের) দিনগুলোতে সওম পালন করতেন। আর তাঁর পিতাও সে দিনগুলোতে সওম পালন করতেন। (আধুনিক প্রকাশনীঃ ১৮৫৬)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 1998,
			"arabicnumber": 1998,
			"text": "",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 1999,
			"arabicnumber": 1999,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, যে ব্যক্তি একই সঙ্গে হাজ্জ ও ‘উমরাহ পালনের সুযোগ লাভ করল সে ‘আরাফাত দিবস পর্যন্ত সওম পালন করবে। সে যদি কুরবানী না করতে পারে এবং সওমও পালন না করে থাকে তবে মিনার দিনগুলোতে সওম পালন করবে। (আধুনিক প্রকাশনীঃ ১৮৫৮, ইসলামিক ফাউন্ডেশনঃ ১৮৭০) ‘আয়িশাহ্ (রাযি.) হতে অনুরূপ বর্ণনা করেছেন। ইবরাহীম ইবনু সা‘দ (রাঃ) ইবনু শিহাব (রহ.) হতে অনুরূপ হাদীস বর্ণনা করেছেন। (আধুনিক প্রকাশনীঃ ১৮৫৮, ইসলামিক ফাউন্ডেশনঃ ১৮৭০ শেষাংশ)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 2000,
			"arabicnumber": 2000,
			"text": "‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ‘আশূরার দিনে কেউ ইচ্ছা করলে সওম পালন করতে পারে। (১৮৯২) (আধুনিক প্রকাশনীঃ ১৮৫৯, ইসলামিক ফাউন্ডেশনঃ ১৮৭১)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 2001,
			"arabicnumber": 2001,
			"text": "‘আয়িশাহ্ (রাযি.) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম প্রথমে ‘আশূরার দিনে সওম পালনের নির্দেশ দিয়েছিলেন, পরে যখন রমাযানের সওম ফরজ করা হলো তখন যার ইচ্ছা (‘আশূরার) সওম পালন করত আর যার ইচ্ছা করত না। (১৫৯২) (আধুনিক প্রকাশনীঃ ১৮৬০, ইসলামিক ফাউন্ডেশনঃ ১৮৭২)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 2002,
			"arabicnumber": 2002,
			"text": "‘আয়িশাহ্ (রাযি.) হতে বর্ণিত। তিনি বলেন, জাহিলিয়্যাতের যুগে কুরাইশগণ ‘আশূরার সওম পালন করত এবং আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -ও এ সওম পালন করতেন। যখন তিনি মাদ্বীনায় আগমন করেন তখনও এ সওম পালন করেন এবং তা পালনের নির্দেশ দেন। যখন রমাযানের সওম ফরজ করা হল তখন ‘আশূরার সওম ছেড়ে দেয়া হলো, যার ইচ্ছা সে পালন করবে আর যার ইচ্ছা পালন করবে না। (১৫৯২) (আধুনিক প্রকাশনীঃ ১৮৬১, ইসলামিক ফাউন্ডেশনঃ ১৮৭৩)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 2003,
			"arabicnumber": 2003,
			"text": "হুমাইদ ইবনু ‘আবদুর রাহমান (রহ.) হতে বর্ণিত। যে বছর মু‘আবিয়াহ (রাঃ) হাজ্জ করেন সে বছর ‘আশূরার দিনে (মসজিদে নাববীর) মিম্বরে তিনি (রাবী) তাঁকে বলতে শুনেছেন যে, হে মাদ্বীনাবাসিগণ! তোমাদের ‘আলিমগণ কোথায়? আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে বলতে শুনেছি যে, আজকে ‘আশূরার দিন, আল্লাহ তা‘আলা এর সওম তোমাদের উপর ফরজ করেননি বটে, তবে আমি (আজ) সওম পালন করছি। যার ইচ্ছা সে সওম পালন করুক, যার ইচ্ছা সে পালন না করুক। (মুসলিম ১৩/১৯, হাঃ ১১২৯) (আধুনিক প্রকাশনীঃ ১৮৬২, ইসলামিক ফাউন্ডেশনঃ ১৮৭৪)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 2004,
			"arabicnumber": 2004,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মাদ্বীনায় আগমন করে দেখতে পেলেন যে, ইয়াহুদীগণ ‘আশূরার দিনে সওম পালন করে। তিনি জিজ্ঞেস করলেনঃ কি ব্যাপার? (তোমরা এ দিনে সওম পালন কর কেন?) তারা বলল, এ অতি উত্তম দিন, এ দিনে আল্লাহ তা‘আলা বনী ইসরাঈলকে তাদের শত্রুর কবল হতে নাজাত দান করেন, ফলে এ দিনে মূসা (আঃ) সওম পালন করেন। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন ঃ আমি তোমাদের অপেক্ষা মূসার অধিক নিকটবর্তী, এরপর তিনি এ দিনে সওম পালন করেন এবং সওম পালনের নির্দেশ দেন। (৩৩৯৭, ৩৯৪৩, ৪৬৮০, ৪৭৩৭, মুসলিম ১৩/১৯, হাঃ ১১৩০) (আধুনিক প্রকাশনীঃ ১৮৬৩, ইসলামিক ফাউন্ডেশনঃ ১৮৭৫)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 2005,
			"arabicnumber": 2005,
			"text": "আবূ মূসা (রাঃ) হতে বর্ণিত। তিনি বলেন, ‘আশূরার দিনকে ইয়াহূদীগণ ‘ঈদ (উৎসবের দিন) মনে করত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (সাহাবীগণকে) বললেনঃ তোমরাও এ দিনের সওম পালন কর। (৩৯৪২, মুসলিম ১৩/১৯, হাঃ ১১৩১, আহমাদ ১৯৬৮৯) (আধুনিক প্রকাশনীঃ ১৮৬৪, ইসলামিক ফাউন্ডেশনঃ ১৮৭৬)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 2006,
			"arabicnumber": 2006,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে ‘আশূরার দিনের সওমের উপরে অন্য কোন দিনের সওমকে প্রাধান্য প্রদান করতে দেখিনি এবং এ মাস অর্থাৎ রমাযান মাস (এর উপর অন্য মাসের গুরুত্ব প্রদান করতেও দেখিনি)। (মুসলিম ১৩/১৯, হাঃ ১১৩২) (আধুনিক প্রকাশনীঃ ১৮৬৫, ইসলামিক ফাউন্ডেশনঃ ১৮৭৭)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 2007,
			"arabicnumber": 2007,
			"text": "সালামাহ ইবনু আকওয়া‘ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আসলাম গোত্রের এক ব্যক্তিকে লোকজনের মধ্যে এ মর্মে ঘোষণা দিতে আদেশ করলেন যে, যে ব্যক্তি খেয়েছে, সে যেন দিনের বাকি অংশে সওম পালন করে, আর যে খায়নি, সেও যেন সওম পালন করে। কেননা আজকের দিন ‘আশূরার দিন। (১৯২৪) (আধুনিক প্রকাশনীঃ ১৮৬৬, ইসলামিক ফাউন্ডেশনঃ ১৮৭৮)",
			"grades": [],
			"reference": {
				"book": 30,
				"hadith": 112
			}
		}
	]
}