{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"33": "Retiring to a Mosque for Remembrance of Allah (I'tikaf)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2025,
			"arabicnumber": 2025,
			"text": "لِقَوْلِهِ تَعَالَى (وَلاَ تُبَاشِرُوهُنَّ وَأَنْتُمْ عَاكِفُونَ فِي الْمَسَاجِدِ تِلْكَ حُدُودُ اللهِ فَلاَ تَقْرَبُوهَا كَذَلِكَ يُبَيِّنُ اللهُ آيَاتِهِ لِلنَّاسِ لَعَلَّهُمْ يَتَّقُونَ) কারণ আল্লাহ তা‘আলার বাণীঃ ‘‘আর যতক্ষণ তোমরা ই‘তিকাফ অবস্থায় মাসজিদসমূহে অবস্থান কর ততক্ষণ পর্যন্ত স্ত্রীদের সাথে মেলামেশা করো না। এগুলো আল্লাহর সীমারেখা। অতএব তোমরা এর নিকটবর্তী হয়ো না। এভাবে আল্লাহ তাঁর নিদর্শনাবলী মানব জাতির জন্যে সুস্পষ্টভাবে ব্যক্ত করেন, যাতে তারা তাকওয়া অবলম্বন করে।’’ (আল-বাকারাহঃ ১৮৭) ২০২৫. ‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রমাযানের শেষ দশকে ই‘তিকাফ করতেন। (মুসলিম ১৪/১, হাঃ ১১৭১, আহমাদ ৬১৮০) (আধুনিক প্রকাশনীঃ ১৮৮৩, ইসলামিক ফাউন্ডেশনঃ ১৮৯৫)",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2026,
			"arabicnumber": 2026,
			"text": "নবী সহধর্মিণী ‘আয়িশাহ্ (রাযি.) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রমাযানের শেষ দশক ই‘তিকাফ করতেন। তাঁর ওফাত পর্যন্ত এই নিয়মই ছিল। এরপর তাঁর সহধর্মিণীগণও (সে দিনগুলোতে) ই‘তিকাফ করতেন। (২০৩৩, ২০৩৪, ২০৪১, ২০৪৫, মুসলিম ১৪/১, হাঃ ১১৭২, আহমাদ ২৬০১১) (আধুনিক প্রকাশনীঃ ১৮৮৪, ইসলামিক ফাউন্ডেশনঃ ১৮৯৬)",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2027,
			"arabicnumber": 2027,
			"text": "আবূ সাঈদ খুদরী (রাঃ) হতে বর্ণিত যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রমাযানের মধ্যম দশকে ই‘তিকাফ করতেন। এক বছর এরূপ ই‘তিকাফ করেন, যখন একুশের রাত এল, যে রাতের সকালে তিনি তাঁর ই‘তিকাফ হতে বের হবেন, তখন তিনি বললেনঃ যারা আমার সঙ্গে ই‘তিকাফ করেছে তারা যেন শেষ দশকে ই‘তিকাফ করে। আমাকে স্বপ্নে এই রাত (লাইলাতুল কদর [ক্বদর]) দেখানো হয়েছিল, পরে আমাকে তা (সঠিক তারিখ) ভুলিয়ে দেয়া হয়েছে। অবশ্য আমি স্বপ্নে দেখতে পেয়েছি যে, ঐ রাতের সকালে আমি কাদা-পানির মাঝে সিজদা করছি। তোমরা তা শেষ দশকে তালাশ কর এবং প্রত্যেক বেজোড় রাতে তালাশ কর। পরে এই রাতে আকাশ হতে বৃষ্টি বর্ষিত হয়, মসজিদের ছাদ ছিল খেজুরের পাতার ছাউনির। ফলে মসজিদে টপটপ করে বৃষ্টি পড়তে লাগল। একুশের রাতের সকালে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর কপালে কাদা-পানির চিহ্ন আমার এ দু’চোখ দেখতে পায়। (৬৬৯) (আধুনিক প্রকাশনীঃ ১৮৮৫, ইসলামিক ফাউন্ডেশনঃ ১৮৯৭)",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2028,
			"arabicnumber": 2028,
			"text": "নবী সহধর্মিণী ‘আয়িশাহ্ (রাযি.) হতে বর্ণিত। তিনি বলেন, মসজিদে ই‘তিকাফরত অবস্থায় নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার দিকে তাঁর মাথা ঝুঁকিয়ে দিতেন আর আমি ঋতুমতী অবস্থায় তাঁর চুল আঁচড়িয়ে দিতাম। (২৯৫, মুসলিম ৩/৩, হাঃ ২৯৭, আহমাদ ২৬৩২১) (আধুনিক প্রকাশনীঃ ১৮৮৬, ইসলামিক ফাউন্ডেশনঃ ১৮৯৮)",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2029,
			"arabicnumber": 2029,
			"text": "নবী সহধর্মিণী ‘আয়িশাহ্ (রাযি.) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মসজিদে থাকাবস্থায় আমার দিকে মাথা বাড়িয়ে দিতেন আর আমি তা আঁচড়িয়ে দিতাম এবং তিনি যখন ই‘তিকাফে থাকতেন তখন (প্রাকৃতিক) প্রয়োজন ব্যতীত ঘরে প্রবেশ করতেন না। (২০৩৩, ২০৩৪, ২০৪১, ২০৪৫) (আধুনিক প্রকাশনীঃ ১৮৮৭, ইসলামিক ফাউন্ডেশনঃ ১৮৯৯)",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2031,
			"arabicnumber": 2031,
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2032,
			"arabicnumber": 2032,
			"text": "ইবনু ‘উমার (রাঃ) সূত্রে বর্ণিত যে, ‘উমার (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে জিজ্ঞেস করেন যে, আমি জাহিলিয়্যা যুগে মাসজিদুল হারামে এক রাত ই‘তিকাফ করার মানৎ করেছিলাম। তিনি (উত্তরে) বললেনঃ তোমার মানৎ পুরা কর। (২০৪৩, ৩১৪৪, ৪৩২০, ৬৬৯৭) (আধুনিক প্রকাশনীঃ ১৮৮৯, ইসলামিক ফাউন্ডেশনঃ ১৯০১)",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2033,
			"arabicnumber": 2033,
			"text": "‘আয়িশাহ্ (রাযি.) হতে বর্ণিত। তিনি বলেন, রমাযানের শেষ দশকে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ই‘তিকাফ করতেন। আমি তাঁর তাঁবু তৈরি করে দিতাম। তিনি ফজরের সালাত আদায় করে তাতে প্রবেশ করতেন। (নবী-সহধর্মিণী) হাফসাহ্ (রাযি.) তাঁবু খাটাবার জন্য ‘আয়িশাহ্ (রাযি.)-এর কাছে অনুমতি চাইলেন। তিনি তাঁকে অনুমতি দিলে হাফসাহ্ (রাযি.) তাঁবু খাটালেন। (নবী-সহধর্মিনী) যায়নাব বিনতু জাহশ (রাযি.) তা দেখে আরেকটি তাঁবু তৈরি করলেন। সকালে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁবুগুলো দেখলেন। তিনি জিজ্ঞেস করলেনঃ এগুলো কী? তাঁকে জানানো হলে তিনি বললেনঃ তোমরা কি মনে কর এগুলো দিয়ে নেকী হাসিল হবে? এ মাসে তিনি ই‘তিকাফ ত্যাগ করলেন এবং পরে শাওয়াল মাসে দশ দিন (কাযা স্বরূপ) ই‘তিকাফ করেন। (২০২৬, ২০২৯, মুসলিম ১৪/২, হাঃ ১১৭৩, আহমাদ ২৪৫৯৮) (আধুনিক প্রকাশনীঃ ১৮৯০, ইসলামিক ফাউন্ডেশনঃ ১৯০২)",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2034,
			"arabicnumber": 2034,
			"text": "‘আয়িশাহ্ (রাযি.) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ই‘তিকাফ করার ইচ্ছা করলেন। এরপর যে স্থানে ই‘তিকাফ করার ইচ্ছা করেছিলেন সেখানে এসে কয়েকটি তাঁবু দেখতে পেলেন। (তাঁবুগুলো হল নবী-সহধর্মিণী) ‘আয়িশাহ্ (রাযি.), হাফসাহ্ (রাযি.) ও যায়নাব (রাযি.)-এর তাঁবু। তখন তিনি বললেনঃ তোমরা কি এগুলো দিয়ে নেকী হাসিলের ধারণা কর? এরপর তিনি চলে গেলেন আর ই‘তিকাফ করলেন না। পরে শাওয়াল মাসে দশ দিনের ই‘তিকাফ করলেন। (২০২৬, ২০২৯) (আধুনিক প্রকাশনীঃ ১৮৯১, ইসলামিক ফাউন্ডেশনঃ ১৯০৩)",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2035,
			"arabicnumber": 2035,
			"text": "নবী-সহধর্মিণী সফীয়্যাহ (রাযি.) বর্ণনা করেন যে, একদা তিনি রমাযানের শেষ দশকে মসজিদে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর খিদমতে উপস্থিত হন। তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ই‘তিকাফরত ছিলেন। সাফিয়্যাহ তাঁর সঙ্গে কিছুক্ষণ কথাবার্তা বলেন। অতঃপর ফিরে যাবার জন্য উঠে দাঁড়ান। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে পৌঁছে দেয়ার উদ্দেশে উঠে দাঁড়ালেন। যখন তিনি (উম্মুল মু’মিনীন) উম্মু সালামাহ (রাযি.)-এর গৃহ সংলগ্ন মসজিদের দরজা পর্যন্ত পৌঁছলেন, তখন দু’জন আনসারী সেখান দিয়ে যাচ্ছিলেন। তাঁরা উভয়ে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে সালাম করলেন। তাঁদের দু’জনকে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমরা দু’জন থাম। ইনি তো (আমার স্ত্রী সাফিয়্যাহ বিনতু হুয়ায়্যী (রাযি.)। এতে তাঁরা দু’জনে ‘সুবহানাল্লাহ হে আল্লাহর রাসূল’ বলে উঠলেন এবং তাঁরা বিব্রত বোধ করলেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ শয়তান মানুষের রক্তের শিরায় চলাচল করে। আমি ভয় করলাম যে, সে তোমাদের মনে সন্দেহের সৃষ্টি করতে পারে। (২০৩৮, ২০৩৯, ৩১০১, ৩২৮১, ৬২১৯, ৭১৭১, মুসলিম ৩৯/৯, হাঃ ২১৭৫, আহমাদ ২৬৯২৭) (আধুনিক প্রকাশনীঃ ১৮৯২, ইসলামিক ফাউন্ডেশনঃ ১৯০৪)",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2036,
			"arabicnumber": 2036,
			"text": "আবূ সালামা ইবনু ‘আবদুর রাহমান (রহ.) হতে বর্ণিত। তিনি বলেন, আমি আবূ সা‘ঈদ খুদরী (রাঃ)-কে জিজ্ঞেস করলাম, আপনি কি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে লাইলাতুল কাদর প্রসঙ্গে উল্লেখ করতে শুনেছেন? তিনি বললেন, হাঁ, আমরা রমাযানের মধ্যম দশকে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সঙ্গে ই‘তিকাফ করেছিলাম। রাবী বলেন, এরপর আমরা বিশ তারিখের সকালে বের হতে চাইলাম। তিনি বিশ তারিখের সকালে আমাদেরকে সম্বোধন করে ভাষণ দিলেন। তিনি বললেন আমাকে (স্বপ্নযোগে) লাইলাতুল কদর [ক্বদর] (-এর নির্দিষ্ট তারিখ) দেখানো হয়েছিল। পরে আমাকে তা ভুলিয়ে দেয়া হয়েছে। তোমরা শেষ দশকের বেজোড় তারিখে তা খোঁজ কর। আমি দেখেছি যে, আমি পানি ও কাদার মধ্যে সিজদা করছি। অতএব যে ব্যক্তি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সঙ্গে ই‘তিকাফ করেছে সে যেন ফিরে আসে (বের হওয়া হতে বিরত থাকে)। লোকেরা মসজিদে ফিরে এল। আমরা তখন আকাশে এক খন্ড মেঘও দেখতে পাইনি। একটু পরে এক খন্ড মেঘ দেখা দিল ও বর্ষণ হল এবং সালাত শুরু হল। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কাদা-পানির মাঝে সিজদা করলেন। এমনকি আমি তাঁর কপালে ও নাকে কাদার চিহ্ন দেখতে পেলাম। (৬৬৯) (আধুনিক প্রকাশনীঃ ১৮৯৩, ইসলামিক ফাউন্ডেশনঃ ১৯০৫)",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2037,
			"arabicnumber": 2037,
			"text": "‘আয়িশাহ্ (রাযি.) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সঙ্গে তাঁর এক মুস্তাহাযা সহধর্মিণী ই‘তিকাফ করেন। তিনি লাল ও হলুদ রংয়ের স্রাব নির্গত হতে দেখতে পেতেন। অনেক সময় আমরা তাঁর নীচে একটি গামলা রেখে দিতাম আর তিনি তার উপর সালাত আদায় করতেন। (২০৯) (আধুনিক প্রকাশনীঃ ১৮৯৪, ইসলামিক ফাউন্ডেশনঃ ১৯০৬)",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2038,
			"arabicnumber": 2038,
			"text": "‘আলী ইবনু হুসাইন (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সহধর্মিণী সাফিয়্যাহ (রাযি.) বর্ণনা করেন, নবী (ই‘তিকাফ অবস্থায়) মসজিদে অবস্থান করছিলেন, ঐ সময় তাঁর নিকট তাঁর সহধর্মিণীগণ উপস্থিত ছিলেন। তাঁরা যাওয়ার জন্য রওয়ানা হন। তিনি (আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ) সাফিয়্যাহ বিনতে হুয়ায়্যীকে বললেনঃ তুমি তাড়াতাড়ি করো না। আমি তোমার সাথে যাব। তাঁর [সাফিয়্যাহ (রাযি.)]-এর ঘর ছিল উসামার বাড়িতে। এরপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে সঙ্গে করে বের হলেন। এমতাবস্থায় দু’জন আনসার ব্যক্তির সাক্ষাৎ ঘটলে তারা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে দেখতে পেয়ে (দ্রুত) আগে বেড়ে গেলেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের দু’জনকে বললেনঃ তোমরা এদিকে আস। এতো সাফিয়্যাহ বিন্তু হুয়ায়্যী। তাঁরা দু’জন বলে উঠলেন, সুবহানাল্লাহ হে আল্লাহর রাসূল! তিনি বললেনঃ শয়তান মানুষের শরীরে রক্তের মত চলাচল করে। আমি আশঙ্কা করলাম যে, সে তোমাদের মনে কিছু সন্দেহ ঢুকিয়ে দিবে। (২০৩৫) (আধুনিক প্রকাশনীঃ ১৮৯৫, ইসলামিক ফাউন্ডেশনঃ ১৯০৭)",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2039,
			"arabicnumber": 2039,
			"text": "সাফিয়্যাহ (রাযি.) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর ই‘তিকাফ অবস্থায় একদা তিনি তাঁর সঙ্গে সাক্ষাৎ করতে আসেন। তিনি যখন ফিরে যান তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর সাথে কিছু দূর হেঁটে আসেন। ঐ সময়ে এক আনসার ব্যক্তি তাঁকে দেখতে পায়। তিনি যখন তাকে দেখতে পেলেন তখন তাকে ডাক দিলেন ও বললেনঃ এসো, এ তো সাফিয়্যাহ বিনতু হুয়ায়্যী। শয়তান মানব দেহে রক্তের মত চলাচল করে থাকে। রাবী বলেন, আমি সুফইয়ান (রাঃ)-কে বললাম, তিনি রাতে এসেছিলেন? তিনি বললেন, রাতে ছাড়া আর কি? (২০৩৫) (আধুনিক প্রকাশনীঃ ১৮৯৬, ইসলামিক ফাউন্ডেশনঃ ১৯০৮)",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2040,
			"arabicnumber": 2040,
			"text": "আবূ সা‘ঈদ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমরা রমাযানের মাঝের দশকে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সঙ্গে ই‘তিকাফ করেছিলাম। বিশ তারিখের সকালে (ই‘তিকাফ শেষ করে চলে আসার উদ্দেশে) আমরা আমাদের আসবাবপত্র সরিয়ে ফেলি। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের নিকটে এসে বললেনঃ যে ব্যক্তি ই‘তিকাফ করেছে সে যেন তার ই‘তিকাফ স্থলে ফিরে যায়। কারণ আমি এই রাতে (লাইলাতুল কদর [ক্বদর]) দেখতে পেয়েছি এবং আমি আরো দেখেছি যে, আমি পানি ও কাদার মধ্যে সিজদা করছি। এরপর যখন তিনি তাঁর ই‘তিকাফের স্থানে ফিরে গেলেন ও আকাশে মেঘ দেখা দিল, তখন আমাদের উপর বৃষ্টি বর্ষিত হল। সেই সত্তার কসম! যিনি তাঁকে যথাযথই প্রেরণ করেছেন, ঐ দিনের শেষভাগে আকাশে মেঘ দেখা দিল। মাসজিদ ছিল খেজুর পাতার ছাউনির। আমি তাঁর নাকের অগ্রভাগে পানি ও কাদার চিহ্ন দেখেছিলাম। (৬৬৯) (আধুনিক প্রকাশনীঃ ১৮৯৭, ইসলামিক ফাউন্ডেশনঃ ১৯০৯)",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2041,
			"arabicnumber": 2041,
			"text": "‘আয়িশাহ্ (রাযি.) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম প্রতি রমাযানে ই‘তিকাফ করতেন। ফজরের সালাত শেষে ই‘তিকাফের নির্দিষ্ট স্থানে প্রবেশ করতেন। ‘আয়িশাহ্ (রাযি.) তাঁর কাছে ই‘তিকাফ করার অনুমতি চাইলে তিনি অনুমতি দিলেন। ‘আয়িশাহ্ (রাযি.) মসজিদে (নিজের জন্য) একটি তাঁবু করে নিলেন। হাফসাহ (রাযি.) তা শুনে (নিজের জন্য) একটি তাঁবু তৈরি করে নিলেন এবং যায়নাব (রাযি.)-ও তা শুনে (নিজের জন্য) আর একটি তাঁবু তৈরি করে নিলেন। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফজরের সালাত শেষে এসে চারটি তাঁবু দেখতে পেয়ে বললেনঃ একী? তাঁকে তাঁদের ব্যাপার জানানো হলে, তিনি বললেনঃ নেক আমলের প্রেরণা তাদেরকে এ কাজে উদ্বুদ্ধ করেনি। সব খুলে ফেলা হল। তিনি সেই রমাযানে আর ই‘তিকাফ করলেন না। পরে শাওয়াল মাসের শেষ দশকে ই‘তিকাফ করেন। (২০২৬) (আধুনিক প্রকাশনীঃ ১৮৯৮, ইসলামিক ফাউন্ডেশনঃ ১৯১০)",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2042,
			"arabicnumber": 2042,
			"text": "‘উমার ইবনু খাত্তাব (রাঃ) হতে বর্ণিত। তিনি বলেন, হে আল্লাহর রাসূল! আমি জাহিলিয়্যাতের যুগে মসজিদে হারামে এক রাত ই‘তিকাফ করার মানৎ করেছিলাম। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে বললেনঃ তোমার মানৎ পুরা কর। তিনি এক রাতের ই‘তিকাফ করলেন। (আধুনিক প্রকাশনীঃ ১৮৯৯, ইসলামিক ফাউন্ডেশনঃ ১৯১১)",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2043,
			"arabicnumber": 2043,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, ‘উমার (রাঃ) জাহিলিয়্যাতের যুগে মসজিদে হারামে ই‘তিকাফ করার মানত করেছিলেন। (বর্ণনাকারী) বলেন, আমার মনে হয় তিনি এক রাতের কথা উল্লেখ করেছিলেন। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে বললেনঃ তোমার মানৎ পুরা কর। (২০৩২) (আধুনিক প্রকাশনীঃ ১৯০০, ইসলামিক ফাউন্ডেশনঃ ১৯১২)",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2044,
			"arabicnumber": 2044,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম প্রতি রমাযানে দশ দিনের ই‘তিকাফ করতেন। যে বছর তিনি ইন্তিকাল করেন সে বছর তিনি বিশ দিনের ইতিকাফ করেছিলেন। (৪৯৯৮) (আধুনিক প্রকাশনীঃ ১৯০১, ইসলামিক ফাউন্ডেশনঃ ১৯১৩)",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2045,
			"arabicnumber": 2045,
			"text": "‘আয়িশাহ্ (রাযি.) হতে বর্ণিত যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রমাযানের শেষ দশকে ই‘তিকাফ করার ইচ্ছ প্রকাশ করলে ‘আয়িশাহ্ (রাযি.) তাঁর কাছে ই‘তিকাফ করার অনুমতি চাইলে তিনি তাঁকে অনুমতি দিলেন। এরপর হাফসাহ্ (রাযি.) ‘আয়িশাহ্ (রাযি.)-এর নিকট অনুমতি চাইলে তিনি তাঁকে অনুমতি দিলেন। তা দেখে যায়নাব বিনতু জাহশ (রাঃ) নিজের জন্য তাঁবু লাগানোর নির্দেশ দিলে তা পালন করা হল। ‘আয়িশাহ্ (রাযি.) বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফজরের সালাত আদায় করে নিজের তাঁবুতে ফিরে এসে কয়েকটি তাঁবু দেখতে পেলেন। তখন তিনি বললেনঃ এ কী ব্যাপার? লোকেরা বলল, ‘আয়িশাহ্, হাফসাহ্ ও যায়নাব (রাযি.)-এর তাঁবু। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তারা কি নেকী পেতে চায়? আমি আর ই‘তিকাফ করবো না। এরপর তিনি ফিরে আসলেন। পরে সওম শেষ করে শাওয়াল মাসের দশ দিন ই‘তিকাফ করেন। (২০২৬) (আধুনিক প্রকাশনীঃ ১৯০২, ইসলামিক ফাউন্ডেশনঃ ১৯১৪)",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2046,
			"arabicnumber": 2046,
			"text": "‘আয়িশাহ্ (রাযি.) হতে বর্ণিত। তিনি ঋতুমতী অবস্থায় নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর চুল আঁচড়িয়ে দিতেন। ঐ সময়ে তিনি মসজিদে ই‘তিকাফ অবস্থায় থাকতেন আর ‘আয়িশাহ্ (রাযি.) তাঁর হুজরায় অবস্থান করতেন। তিনি ‘আয়িশাহ্ (রাযি.)-এর দিকে তাঁর মাথা বাড়িয়ে দিতেন। (২৯৫) (আধুনিক প্রকাশনীঃ ১৯০৩, ইসলামিক ফাউন্ডেশনঃ ১৯১৫)",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 21
			}
		}
	]
}