{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"34": "Sales and Trade"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2047,
			"arabicnumber": 2047,
			"text": "(وَأَحَلَّ اللهُ الْبَيْعَ وَحَرَّمَ الرِّبَا ) وَقَوْلُهُ ( إِلاَّ أَنْ تَكُونَ تِجَارَةً حَاضِرَةً تُدِيرُونَهَا بَيْنَكُمْ ) এবং আল্লাহ তা‘আলার বাণীঃ আল্লাহ বেচা-কেনাকে বৈধ এবং সুদকে অবৈধ করেছেন- (আল-বাকারা ২৭৫)। এবং আল্লাহ তা‘আলার বাণীঃ কিন্তু তোমরা পরস্পর যে ব্যবসায় নগদ আদান-প্রদান কর.......... (আল-বাকারা ২৮২)। (فَإِذَا قُضِيَتْ الصَّلاَةُ فَانْتَشِرُوا فِي الأَرْضِ وَابْتَغُوا مِنْ فَضْلِ اللهِ وَاذْكُرُوا اللهَ كَثِيرًا لَعَلَّكُمْ تُفْلِحُونَ وَإِذَا رَأَوْا تِجَارَةً أَوْ لَهْوًا انْفَضُّوا إِلَيْهَا وَتَرَكُوكَ قَائِمًا قُلْ مَا عِنْدَ اللهِ خَيْرٌ مِنْ اللَّهْوِ وَمِنْ التِّجَارَةِ وَاللهُ خَيْرُ الرَّازِقِينَ) وَقَوْلِهِ (لاَ تَأْكُلُوا أَمْوَالَكُمْ بَيْنَكُمْ بِالْبَاطِلِ إِلاَّ أَنْ تَكُونَ تِجَارَةً عَنْ تَرَاضٍ مِنْكُمْ) ‘‘সালাত শেষ হলে তোমরা পৃথিবীতে ছড়িয়ে পড়বে এবং আল্লাহর অনুগ্রহ অনুসন্ধান করবে ও আল্লাহকে অধিক পরিমাণে স্মরণ করবে যাতে তোমরা সফলতা লাভ করতে পার। যখন তারা দেখল ব্যবসায় কৌতুক তখন তারা আপনাকে দাঁড়ানো অবস্থায় রেখে সেদিকে ছুটে গেল। বলুন, আল্লাহর নিকট যা আছে, তা ক্রীড়া-কৌতুক ও ব্যবসা অপেক্ষা উৎকৃষ্ট। আল্লাহর সর্বশ্রেষ্ঠ রিযিকদাতা।’’ (জুমু‘আহ : ১০) আর আল্লাহ তা‘আলার বাণীঃ ‘‘তোমরা পরস্পর পরস্পরের অর্থ-সম্পদ অন্যায়ভাবে গ্রাস করো না। কিন্তু তোমাদের পরস্পর সন্তুষ্টচিত্তে ব্যবসা করা বৈধ।’’ (আন্-নিসাঃ ২৯) ২০৪৭. আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, তোমরা বলে থাক, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে আবূ হুরাইরাহ্ (রাঃ) বেশি বেশি হাদীস বর্ণনা করে থাকে এবং আরো বলেন, মুহাজির ও আনসারদের কী হলো যে, তারা তো আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর হাদীস বর্ণনা করে না? আমার মুহাজির ভাইয়েরা বাজারে ক্রয়-বিক্রয়ে ব্যস্ত থাকত আর আমি কোন প্রকারে আমার পেটের চাহিদা মিটিয়ে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকটে পড়ে থাকতাম। তাঁরা যখন অনুপস্থিত থাকত আমি তখন উপস্থিত থাকতাম। তাঁরা যা ভুলে যেত আমি তা মুখস্থ করতাম। আর আমার আনসার ভাইয়েরা নিজেদের ক্ষেত-খামারের কাজে ব্যস্ত থাকতেন। আমি ছিলাম সুফ্ফার মিসকীনদের একজন মিসকীন। তাঁরা যা ভুলে যেতো, আমি তা মুখস্থ রাখতাম। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর এক বর্ণনায় বললেন, আমার এ কথা শেষ না হওয়া পর্যন্ত যে কেউ তার কাপড় বিছিয়ে দিবে এবং পরে নিজের শরীরের সাথে তার কাপড় জড়িয়ে নেবে, আমি যা বলছি সে তা স্মরণ রাখতে পারবে। [আবূ হুরাইরাহ্ (রাঃ) বলেন] আমি আমার গায়ের চাদরখানা বিছিয়ে দিলাম যতক্ষণ না আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর কথা শেষ করলেন, পরে আমি তা আমার বুকের সাথে জড়িয়ে ধরলাম। ফলে আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সে কথার কিছুই ভুলে যাইনি। (১১৮) (আধুনিক প্রকাশনীঃ ১৯০৪ , ইসলামিক ফাউন্ডেশনঃ ১৯১৯) [২০৪৭ নং হাদীস থেকে ইসলামিক ফাউন্ডেশন বাংলাদেশ চতুর্থ খন্ড মার্চ ২০০৩ সংস্করণ অবলম্বনে করা হয়েছে]",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2048,
			"arabicnumber": 2048,
			"text": "‘আবদুর রহমান ইবনু আওফ (রাঃ) সূত্রে বর্ণিত। তিনি বলেন, আমরা যখন মদ্বীনায় আসি, তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার এবং সা‘দ ইবনু রাবী‘ (রাঃ)-এর মধ্যে ভ্রাতৃত্ব বন্ধন সৃষ্টি করে দেন। পরে সা‘দ ইবনু রাবী‘ বললেন, আমি আনসারদের মধ্যে অধিক ধনাঢ্য ছিলাম। আমার অর্ধেক সম্পত্তি তোমাকে বণ্টন করে দিচ্ছি এবং আমার উভয় স্ত্রীকে দেখে যাকে তোমার পছন্দ হয়, বল আমি তাকে তোমার জন্য পরিত্যাগ করব। যখন সে (ইদ্দত পূর্ণ করবে) তখন তুমি বিবাহ করবে। আবদুর রহমান (রাঃ) বললেন, এ সবে আমার কোন প্রয়োজন নেই। বরং (আপনি বলুন) ব্যবসা-বাণিজ্য করার মতো কোন বাজার আছে কি? তিনি বললেন, কায়নুকার বাজার আছে। পরদিন ‘আবদুর রহমান (রাঃ) সে বাজারে গিয়ে পনীর ও ঘি (খরিদ করে) নিয়ে আসলেন। এরপর ক্রমাগত যাওয়া-আসা করতে থাকেন। কিছুকাল পরে ‘আবদুর রহমান (রাঃ)-এর কাপড়ে বিয়ের হলুদ রঙের চিহ্ন দেখা গেল। এরপর আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে জিজ্ঞেস করলেন, তুমি কি বিবাহ করেছ? তিনি বললেন, হ্যাঁ। তিনি জিজ্ঞেস করলেন, সে কে? তিনি বললেন, জনৈকা আনসারী মহিলা। তিনি জিজ্ঞেস করলেন, কী পরিমাণ মাহর দিয়েছ? ‘আবদুর রহমান (রাঃ) বললেন, খেজুরের এক আঁটি পরিমাণ স্বর্ণ। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে বললেন, একটি বকরী দিয়ে হলেও ওয়ালীমা কর। (৩৭৮০) (আধুনিক প্রকাশনীঃ ১৯০৫ , ইসলামিক ফাউন্ডেশনঃ ১৯২০)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2049,
			"arabicnumber": 2049,
			"text": "আনাস (রাঃ) হতে বর্ণিত। তিনি বলেন, ‘আবদুর রহমান ইবনু আওফ (রাঃ) মদ্বীনায় আগমন করলে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর ও সা‘দ ইবনু রাবী‘ আনসারীর মাঝে ভ্রাতৃত্ব বন্ধন করে দেন। সা‘দ (রাঃ) ধনী ব্যক্তি ছিলেন। তিনি ‘আবদুর রহমান (রাঃ)-কে বললেন, আমি তোমার উদ্দেশে আমার সম্পত্তি অর্ধেক অর্ধেক ভাগ করে নিতে চাই এবং তোমাকে বিবাহ করিয়ে দিতে চাই। তিনি বলেন, আল্লাহ তা‘আলা তোমার পরিবার ও সম্পদে বরকত দান করুন। আমাকে বাজার দেখিয়ে দাও। তিনি বাজার হতে মুনাফা করে নিয়ে আসলেন পনীর ও ঘি। এভাবে কিছুকাল কাটালেন। একদিন তিনি এভাবে আসলেন যে, তাঁর গায়ে বিয়ের হলুদ রংয়ের চিহ্ন লেগে আছে। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে জিজ্ঞেস করলেন, কী ব্যাপার? তিনি বললেন, হে আল্লাহর রাসূল! আমি জনৈকা আনসারী মহিলাকে বিবাহ করেছি। তিনি [নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ] জিজ্ঞেস করলেন, তুমি তাকে কী দিয়েছ? তিনি বললেন, খেজুরের এক আঁটি পরিমাণ স্বর্ণ। তিনি [নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ] বললেন, একটি বকরী দিয়ে হলেও ওয়ালীমা কর। (২২৯৩, ৩৭৮১, ২৯৩৭, ৫০৭২, ৫১৪৮, ৫১৫৩, ৫১৫৫, ৫১৬৭, ৬০৮২, ৬৩৮৬) (আধুনিক প্রকাশনীঃ ১৯০৬ , ইসলামিক ফাউন্ডেশনঃ ১৯২১)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2050,
			"arabicnumber": 2050,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, উকায, মাজিন্না ও যুল-মাজায জাহিলীয়্যাতের যুগে বাজার ছিল। ইসলামের আগমনের পরে লোকেরা ঐ সমস্ত বাজারে যেতে গুনাহ মনে করতে লাগল। ফলে অবতীর্ণ হলঃ ‘‘তোমাদের প্রভুর অনুগ্রহ তালাশে তোমাদের কোন গুনাহ নেই’’- (আল-বাকারা ১৯৮)। ইবনু ‘আব্বাস (রাঃ) (আয়াতের সঙ্গে) হাজ্জের মওসুমে কথাটুকুও পড়লেন। (১৭৭০) (আধুনিক প্রকাশনীঃ ১৯০৭ , ইসলামিক ফাউন্ডেশনঃ ১৯২২)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2051,
			"arabicnumber": 2051,
			"text": "নু‘মান ইবনু বাশীর (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, হালাল সুস্পষ্ট এবং হারামও সুস্পষ্ট, উভয়ের মাঝে বহু অস্পষ্ট বিষয় রয়েছে। যে ব্যক্তি গুনাহের সন্দেহযুক্ত কাজ পরিত্যাগ করে, সে ব্যক্তি যে বিষয়ে গুনাহ হওয়া সুস্পষ্ট, সে বিষয়ে অধিকতর পরিত্যাগকারী হবে। পক্ষান্তরে যে ব্যক্তি গুনাহের সন্দেহযুক্ত কাজ করতে দুঃসাহস করে, সে ব্যক্তির সুস্পষ্ট গুনাহের কাজে পতিত হবার যথেষ্ট আশঙ্কা রয়েছে। গুনাহসমূহ আল্লাহর সংরক্ষিত এলাকা, যে জানোয়ার সংরক্ষিত এলাকার চার পাশে চরতে থাকে, তার ঐ সংরক্ষিত এলাকায় প্রবেশ করার সম্ভাবনা রয়েছে। (৫২) (আধুনিক প্রকাশনীঃ ১৯০৮ , ইসলামিক ফাউন্ডেশনঃ ১৯২৩)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2052,
			"arabicnumber": 2052,
			"text": "وَقَالَ حَسَّانُ بْنُ أَبِي سِنَانٍ مَا رَأَيْتُ شَيْئًا أَهْوَنَ مِنْ الْوَرَعِ دَعْ مَا يَرِيبُكَ إِلَى مَا لاَ يَرِيبُكَ হাসসান ইবনু আবূ সিনান (রহ.) বলেন, আমি পরহেযগারী হতে বেশী সহজ কাজ দেখতে পাইনি। (তা হলো) যা তোমার কাছে সন্দেহযুক্ত মনে হয়, তা পরিত্যাগ করে সন্দেহমুক্ত কাজ কর। ২০৫২. উকবা ইবনু হারিস (রাঃ) হতে বর্ণিত যে, একজন কালো মেয়েলোক এসে দাবী করলো যে, সে তাদের উভয় (উকবা ও তার স্ত্রী-কে দুধপান করিয়েছে। তিনি এ কথা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট বর্ণনা করলে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর হতে মুখ ফিরিয়ে নিলেন এবং মুচকি হেসে বললেন, কিভাবে? অথচ এমনটি বলা হয়ে গেছে। তাঁর স্ত্রী ছিলেন আবূ ইহাব তামীমীর মেয়ে। (৮৮) (আধুনিক প্রকাশনীঃ ১৯০৯ , ইসলামিক ফাউন্ডেশনঃ ১৯২৪)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2053,
			"arabicnumber": 2053,
			"text": "‘আয়িশাহ (রাযি.) হতে বর্ণিত, তিনি বলেন, উতবা ইবনু আবূ ওয়াক্কাস তার ভাই সা‘দ ইবনু আবূ ওয়াক্কাস (রাঃ)-কে ওয়াসীয়াত করে যান যে, যাম‘আর বাঁদীর গর্ভস্থিত পুত্র আমার ঔরসজাত; তুমি তাকে (ভ্রাতুষ্পুত্র রূপে) তোমার অধীনে নিয়ে আসবে। ‘আয়িশাহ (রাযি.) বলেন, মক্কা বিজয়ের কালে ঐ ছেলেটিকে সা‘দ ইবনু আবূ ওয়াক্কাস (রাঃ) নিয়ে নিলেন এবং বললেন, এ আমার ভাইয়ের পুত্র। তিনি আমাকে এর সম্পর্কে ওয়াসীয়াত করে গেছেন। এদিকে যাম‘আর পুত্র ‘আব্দ দাবী করে যে, এ আমার ভাই, আমার পিতার বাঁদীর পুত্র।। তার শয্যা সঙ্গিনীর গর্ভে জন্মগ্রহণ করেছে। তারপর উভয়ে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর কাছে গেলেন। সা‘দ বললেন, হে আল্লাহর রাসূল! এ আমার ভাইয়ের পুত্র, সে এর ব্যাপারে আমাকে ওয়াসীয়াত করে গেছে এবং ‘আব্দ ইবনু যাম‘আ বললেন, আমার ভাই। আমার পিতার দাসীর পুত্র, তাঁর সঙ্গে শায়িনীর গর্ভে জন্মগ্রহণ করেছে। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, হে ‘আব্দ ইবনু যাম‘আ! এ ছেলেটি তোমার প্রাপ্য। তারপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, শয্যা যার, সন্তান তার। ব্যভিচারী যে, বঞ্চিত সে। এরপর তিনি নবী সহধর্মিনী সাওদা বিনতে যাম‘আ (রাঃ)-কে বললেন, তুমি ঐ ছেলেটি হতে পর্দা করবে। কারণ তিনি ঐ ছেলেটির মধ্যে উতবার সাদৃশ্য দেখতে পান। ফলে মৃত্যু পর্যন্ত ঐ ছেলেটি আর সাওদাহ (রাঃ)-কে দেখেনি। (২২১৮, ২৪২১, ২৫৩৩, ২৭৪৫, ৪৩০৩, ৬৭৪৯, ৬৭৬৫, ৬৮১৭, ৭১৮২, মুসলিম ১৭/১০, হাঃ ১৪৫৭, আহমাদ ২৪১৪১) (আধুনিক প্রকাশনীঃ ১৯১০ , ইসলামিক ফাউন্ডেশনঃ ১৯২৫)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2054,
			"arabicnumber": 2054,
			"text": "আদী ইবনু হাতিম (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে পার্শ্বফলা বিহীন তীর (দ্বারা শিকার) সম্পর্কে জিজ্ঞেস করলাম। তিনি বললেন, যদি তীরের ধারালো পার্শ্ব আঘাত করে, তবে সে (শিকারকৃত জানোয়ারের গোশত) খাবে, আর যদি এর ধারহীন পার্শ্বের আঘাতে মারা যায়, তবে তা খাবে না। কেননা তা প্রহারের মৃত যবহকৃত নয়। আমি বললাম, হে আল্লাহর রাসূল! আমি বিসমিল্লাহ পড়ে আমার (শিকারী) কুকুর ছেড়ে দিয়ে থাকি। পরে তার সাথে শিকারের কাছে (অনেক সময়) অন্য কুকুর দেখতে পাই যার উপর আমি বিসমিল্লাহ পড়িনি এবং আমি জানি না, উভয়ের মধ্যে কে শিকার ধরেছে। তিনি বললেন, তুমি তা খাবে না। তুমি তো তোমার কুকুরের উপর বিসমিল্লাহ পড়েছ, অন্যটির উপর পড়নি। (১৭৫, মুসলিম ২৪/১, হাঃ ১৯২৯, আহমাদ ১৯৪০৮) (আধুনিক প্রকাশনীঃ ১৯১১ , ইসলামিক ফাউন্ডেশনঃ ১৯২৬)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2055,
			"arabicnumber": 2055,
			"text": "আনাস (রাঃ) হতে বর্ণিত। তিনি বলেন, (একদা) পথ অতিক্রমকালে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পড়ে থাকা একটি খেজুর দেখে বললেন, এটা যদি সদাকার খেজুর বলে সংশয় না থাকতো, তবে আমি তা খেতাম। আবূ হুরাইরাহ্ (রাঃ) সূত্রে হাম্মাম (রহ.) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেন যে, তিনি বলেছেন, আমার বিছানায় পড়ে থাকা খেজুর আমি পাই। (২৪৩১, মুসলিম ১২/৫০, হাঃ ১০৭১, আহমাদ ১৪১১২) (আধুনিক প্রকাশনীঃ ১৯১২ , ইসলামিক ফাউন্ডেশনঃ ১৯২৭)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2056,
			"arabicnumber": 2056,
			"text": "আব্বাদ ইবনু তামীমের চাচা (‘আবদুল্লাহ ইবনু যায়দ ইবনু আসিম) (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট এক ব্যক্তি সম্পর্কে বলা হল যে, সালাত আদায়কালে তার অযূ ভঙ্গের কিছু হয়েছে বলে মনে হয়, এতে কি সে সালাত ছেড়ে দেবে? তিনি বলেন, না, যতক্ষণ না সে আওয়াজ শোনে বা দুর্গন্ধ টের পায় অর্থাৎ নিশ্চিত না হয়। (৩৭) (আধুনিক প্রকাশনীঃ ১৯১৩ , ইসলামিক ফাউন্ডেশনঃ ১৯২৮) ইবনু আবূ হাফসাহ্ (রহ.) যুহরী (রহ.) হতে বর্ণনা করেন, তুমি গন্ধ না পেলে অথবা আওয়াজ না শুনলে অযূ করবে না।",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2057,
			"arabicnumber": 2057,
			"text": "‘আয়িশাহ (রাযি.) হতে বর্ণিত যে, কিছু সংখ্যক লোক বলল, হে আল্লাহর রাসূল! বহু লোক আমাদের কাছে গোশত নিয়ে আসে আমরা জানি না, তারা বিসমিল্লাহ পড়ে যবহ করেছিল কিনা? নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তোমরা এর উপর আল্লাহর নাম লও এবং তা খাও (ওয়াসওয়াসার শিকার হয়ো না)। (৫৫০৭, ৭৩৯৮) (আধুনিক প্রকাশনীঃ ১৯১৪ , ইসলামিক ফাউন্ডেশনঃ ১৯২৯)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2058,
			"arabicnumber": 2058,
			"text": "জাবির (রাঃ) হতে বর্ণিত। তিনি বলেন, একবার আমরা (নবী)-এর সঙ্গে সালাত আদায় করছিলাম। তখন সিরিয়া হতে একটি ব্যবসায়ী কাফেলা খাদ্য নিয়ে আগমন করল। লোকজন সকলেই সে দিকে চলে গেলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সঙ্গে মাত্র বারোজন থেকে গেলেন। এ প্রসঙ্গে নাযিল হলঃ ‘‘যখন তারা দেখল ব্যবসা ও কৌতুক তখন তারা সে দিকে ছুটে গেল’’। (৯৩৬) (আধুনিক প্রকাশনীঃ ১৯১৫ , ইসলামিক ফাউন্ডেশনঃ ১৯৩০)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2059,
			"arabicnumber": 2059,
			"text": "আবূ হুরাইরাহ্ (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেন, এমন এক যুগ আসবে, যখন মানুষ পরোয়া করবে না যে, সে কোথা হতে সম্পদ উপার্জন করল, হালাল হতে না হারাম হতে। (২০৮৩) (আধুনিক প্রকাশনীঃ ১৯১৬ , ইসলামিক ফাউন্ডেশনঃ ১৯৩১)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2061,
			"arabicnumber": 2061,
			"text": "",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2062,
			"arabicnumber": 2062,
			"text": "وَقَوْلِ اللهِ تَعَالَى (فَانْتَشِرُوا فِي الأَرْضِ وَابْتَغُوا مِنْ فَضْلِ اللهِ) মহান আল্লাহর বাণীঃ ‘‘তোমরা পৃথিবীতে ছড়িয়ে পড় এবং আল্লাহর অনুগ্রহ সন্ধান কর।’’ (জুমু‘আহ : ১০) ২০৬২. ‘উবায়দুল্লাহ ইবনু ‘উমাইর (রহ.) হতে বর্ণিত যে, আবূ মূসা আল-আশ‘আরী (রাঃ) ‘উমার ইবনু খাত্তাব (রাঃ)-এর নিকট প্রবেশের অনুমতি চাইলে তাকে অনুমতি দেয়া হয়নি; সম্ভবতঃ তিনি কোন কাজে ব্যস্ত ছিলেন। তাই আবূ মূসা (রাঃ) ফিরে আসেন। পরে ‘উমার (রাঃ) পেরেশান হয়ে বললেন, আমি কি ‘আবদুল্লাহ ইবনু কায়স (আবূ মূসার নাম)-এর আওয়াজ শুনতে পাইনি? তাঁকে আসতে বল। কেউ বলল, তিনি তো ফিরে চলে গেছেন। ‘উমার (রাঃ) তাঁকে ডেকে পাঠালেন। তিনি (উপস্থিত হয়ে) বললেন, আমাদের এরূপই নির্দেশ দেয়া হয়েছে। ‘উমার (রাঃ) বললেন, তোমাকে এর উপর সাক্ষী পেশ করতে হবে। আবূ মূসা (রাঃ) ফিরে গিয়ে আনসারদের এক মজলিসে পৌঁছে তাদের এ বিষয়ে জিজ্ঞেস করলেন। তাঁরা বললেন, এ ব্যাপারে আমাদের মধ্যে সর্বকনিষ্ঠ আবূ সা‘ঈদ খুদরী (রাঃ)-ই সাক্ষ্য দেবে। তিনি আবূ সা‘ঈদ খুদরী (রাঃ)-কে নিয়ে গেলেন। ‘উমার (রাঃ) (তার কাছ হতে সে হাদীসটি শুনে) বললেন, (কি আশ্চর্য) আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নির্দেশ কি আমার কাছ হতে গোপন রয়ে গেল? (আসল ব্যাপার হল) বাজারের ক্রয়-বিক্রয় অর্থাৎ ব্যবসায়ের জন্য বের হওয়া আমাকে বেখবর রেখেছে। (২২৪৫, ৭৩৫৩) (আধুনিক প্রকাশনীঃ ১৯১৮ , ইসলামিক ফাউন্ডেশনঃ ১৯৩৩)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2063,
			"arabicnumber": 2063,
			"text": "وَقَالَ مَطَرٌ لاَ بَأْسَ بِهِ وَمَا ذَكَرَهُ اللهُ فِي الْقُرْآنِ إِلاَّ بِحَقٍّ ثُمَّ تَلاَ (وَتَرَى الْفُلْكَ مَوَاخِرَ فِيهِ وَلِتَبْتَغُوا مِنْ فَضْلِهِ) وَالْفُلْكُ السُّفُنُ الْوَاحِدُ وَالْجَمْعُ سَوَاءٌ وَقَالَ مُجَاهِدٌ تَمْخَرُ السُّفُنُ الرِّيحَ وَلاَ تَمْخَرُ الرِّيحَ مِنْ السُّفُنِ إِلاَّ الْفُلْكُ الْعِظَامُ মাত্বার (রহ.) বলেন, এতে কোন দোষ নেই এবং তা যথাযথ বলেই আল্লাহ কুরআনে এর উল্লেখ করেছেন। তারপর তিনি তিলাওয়াত করলেনঃ ‘‘এবং তোমরা এতে নৌযানকে দেখতে পাও তার বুক চিরে চলাচল করে, যা এজন্য যে, তাঁর অনুগ্রহের অনুসন্ধান করতে পার’’- (ফাতির ১২)। আয়াতে উল্লেখিত ........ ‘আল-ফুলক’ শব্দের অর্থ নৌযান। একবচন ও বহুবচনে সমভাবে ব্যবহৃত হয়। মুজাহিদ (রহ.) বলেন, নৌযান, বায়ু বিদীর্ণ করে চলে এবং নৌযানের মধ্যে বৃহৎ নৌযানই বায়ুতে বিদীর্ণ করে চলে। ২০৬৩. আবূ হুরাইরাহ্ (রাঃ) সূত্রে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত যে, তিনি বনী ইসরাঈলের এক ব্যক্তির আলোচনায় বলেন, সে নদীপথে বের হল এবং নিজের প্রয়োজন সেরে নিল। এরপর রাবী পুরা হাদীসটি বর্ণনা করেন। (১৪৯৮) (আধুনিক প্রকাশনীঃ কিতাবুল বুয়ু‘ অনুচ্ছেদ-১০ , ইসলামিক ফাউন্ডেশনঃ অনুচ্ছেদ ১২৮৬)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2064,
			"arabicnumber": 2064,
			"text": "(وَإِذَا رَأَوْا تِجَارَةً أَوْ لَهْوًا انْفَضُّوا إِلَيْهَا) وَقَوْلُهُ جَلَّ ذِكْرُهُ (رِجَالٌ لاَ تُلْهِيهِمْ تِجَارَةٌ وَلاَ بَيْعٌ عَنْ ذِكْرِ اللهِ) وَقَالَ قَتَادَةُ كَانَ الْقَوْمُ يَتَّجِرُونَ وَلَكِنَّهُمْ كَانُوا إِذَا نَابَهُمْ حَقٌّ مِنْ حُقُوقِ اللهِ لَمْ تُلْهِهِمْ تِجَارَةٌ وَلاَ بَيْعٌ عَنْ ذِكْرِ اللهِ حَتَّى يُؤَدُّوهُ إِلَى اللهِ আল্লাহর বাণী- ‘‘যখন তারা দেখল ব্যবসা ও কৌতুক তখন তারা আপনাকে দাঁড়ানো অবস্থায় রেখে সেদিকে ছুটে গেল’’- (জুমুআহ ১১)। এবং তাঁর বাণীঃ ‘‘সে সব লোক, যাদেরকে ব্যবসা-বাণিজ্য ও ক্রয়-বিক্রয় আল্লাহর যিক্র হতে গাফিল রাখে না।’’ (আন্-নূরঃ ৩৭) কাতাদাহ (রহ.) বলেন, সাহাবীগণ (রাঃ) ব্যবসা-বাণিজ্য করতেন বটে, কিন্তু যখন তাঁদের সামনে আল্লাহর কোন হক এসে উপস্থিত হতো, যতক্ষণ না তাঁরা এ হক আল্লাহর সমীপে আদায় করে দিতেন, ততক্ষণ ব্যবসা-বাণিজ্য ও ক্রয়-বিক্রয় আল্লাহর যিকির হতে গাফিল করতে পারত না। ২০৬৪. জাবির (রাঃ) হতে বর্ণিত। তিনি বলেন, আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সঙ্গে জুমু‘আর দিন সালাত আদায় করছিলাম। এমন সময় এক বাণিজ্যিক কাফেলা এসে হাযির হয়, তখন বারোজন লোক ছাড়াই সকলেই সে কাফেলার দিকে ছুটে যান। তখন এ আয়াত নাযিল হয়ঃ ‘‘যখন তারা দেখল ব্যবসা ও কৌতুক তখন তারা আপনাকে দাঁড়ানো অবস্থায় রেখে সেদিকে ছুটে গেল’’- (সূরা জুমু‘আ ১১)। (৯৩৬) (আধুনিক প্রকাশনীঃ ১৯১৯ , ইসলামিক ফাউন্ডেশনঃ ১৯৩৪)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2065,
			"arabicnumber": 2065,
			"text": "‘আয়িশাহ (রাযি.) হতে বর্ণিত। তিনি বলেন, নবী বলেছেন, যখন কোন মহিলা তার ঘরের খাদ্যসামগ্রী হতে ফাসাদের উদ্দেশ্য ব্যতীত খরচ করে তখন তার জন্য সাওয়াব রয়েছে তার খরচ করায়, তার স্বামীর জন্য সাওয়াব রয়েছে তার উপার্জনের এবং সংরক্ষণকারীর জন্যও অনুরূপ রয়েছে। তাদের কারো কারণে কারোর সাওয়াব কিছুই কমতি হবে না। (আধুনিক প্রকাশনীঃ ১৯২০ , ইসলামিক ফাউন্ডেশনঃ ১৯৩৫)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2066,
			"arabicnumber": 2066,
			"text": "আবূ হুরাইরাহ্ (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেন, যখন কোন মহিলা তার স্বামীর উপার্জন হতে তার অনুমতি ছাড়াই ব্যয় করবে, তখন তার জন্য অর্ধেক সাওয়াব রয়েছে। (৫১৯২, ৫১৯৫, ৫৩৬০) (আধুনিক প্রকাশনীঃ ১৯২১ , ইসলামিক ফাউন্ডেশনঃ ১৯৩৬)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2067,
			"arabicnumber": 2067,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি শুনেছি, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যে ব্যক্তি পছন্দ করে যে, তার জীবিকা বৃদ্ধি হোক অথবা তাঁর মৃত্যুর পরে সুনাম থাকুক, তবে সে যেন আত্মীয়ের সঙ্গে সদাচরণ করে। (৫৯৮৬, মুসলিম ৪৫/৬, হাঃ ২৫৫৭) (আধুনিক প্রকাশনীঃ ১৯২২ , ইসলামিক ফাউন্ডেশনঃ ১৯৩৭)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2068,
			"arabicnumber": 2068,
			"text": "আ’মাশ (রহ.) হতে বর্ণিত। তিনি বলেন, বাকীতে ক্রয়ের জন্য বন্ধক রাখা সম্পর্কে আমরা ইবরাহীম (রহ.)-এর কাছে আলোচনা করছিলাম। তখন তিনি বলেন, আসওয়াদ (রহ.) ‘আয়িশাহ (রাযি.) হতে আমার কাছে বর্ণনা করেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জনৈক ইয়াহূদীর নিকট হতে নির্দিষ্ট মেয়াদে মূল্য পরিশোধের শর্তে খাদ্য ক্রয় করেন এবং তার নিকট নিজের লোহার বর্ম বন্ধক রাখেন। (২০৯৬, ২২০০, ২২৫১, ২২৫২, ২৩৮৬, ২৫০৯, ২৫১৩, ২৯১৬, ১৪৬৭, মুসলিম ২২/২৩, হাঃ ১৬০৩) (আধুনিক প্রকাশনীঃ ১৯২৩, ইসলামিক ফাউন্ডেশনঃ ১৯৩৮)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2069,
			"arabicnumber": 2069,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত যে, একবার তিনি যবের আটা ও পুরোনা গন্ধযুক্ত চর্বি নিয়ে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট উপস্থিত হলেন। রাবী বলেন, আমি তাঁকে বলতে শুনেছি যে, মদিনা্য় অবস্থান কালে তাঁর বর্ম জনৈক ইয়াহূদীর নিকট বন্ধক রেখে তিনি নিজ পরিবারের জন্য তার হতে যব খরিদ করেন। [রাবী কাতাদাহ (রহ.) বলেন] আমি তাঁকে [আনাস (রহ.)-কে] বলতে শুনেছি যে, মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর পরিবারের কাছে এক সা‘ পরিমাণ গম বা এক সা‘ পরিমাণ আটাও থাকত না, অথচ সে সময় তাঁর নয়জন সহধর্মিণী ছিলেন। (২৫০৮) (আধুনিক প্রকাশনীঃ ১৯২৪ , ইসলামিক ফাউন্ডেশনঃ ১৯৩৯)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2070,
			"arabicnumber": 2070,
			"text": "‘আয়িশাহ (রাযি.) হতে বর্ণিত। তিনি বলেন, যখন আবূ বকর সিদ্দীক (রাঃ)-কে খলীফা বানানো হল, তখন তিনি বললেন, আমার জাতি জানে যে, আমার উপার্জন আমার পরিবারের ভরণ পোষণের জন্য অপর্যাপ্ত ছিল না। কিন্তু এখন আমি মুসলিম জনগণের কাজে সার্বক্ষণিক ব্যাপৃত হয়ে গেছি। অতএব আবূ বকরের পরিবার এই রাষ্ট্রীয় কোষাগার হতে খাদ্য গ্রহণ করবে এবং আবূ বকর (রাঃ) মুসলিম জনগণের সম্পদের তত্ত্বাবধান করবেন। (আধুনিক প্রকাশনীঃ ১৯২৫ , ইসলামিক ফাউন্ডেশনঃ ১৯৪০)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2071,
			"arabicnumber": 2071,
			"text": "‘আয়িশাহ (রাযি.) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সাহাবীগণ নিজেদের কাজ-কর্ম নিজেরা করতেন। ফলে তাদের শরীর হতে ঘামের গন্ধ বের হতো। সেজন্য তাদের বলা হল, যদি তোমরা গোসল করে নাও। হাম্মাম (রহ.) ......... ‘আয়িশাহ (রাযি.) হতে হাদীসটি বর্ণনা করেছেন। (৯০৩) (আধুনিক প্রকাশনীঃ ১৯২৬ , ইসলামিক ফাউন্ডেশনঃ ১৯৪১)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2072,
			"arabicnumber": 2072,
			"text": "মিকদাম (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেন, নিজ হাতে উপার্জিত খাদ্যের চেয়ে উত্তম খাদ্য কখনো কেউ খায় না। আল্লাহর নবী দাঊদ (আঃ) নিজ হাতে উপার্জন করে খেতেন। (আধুনিক প্রকাশনীঃ ১৯২৭ , ইসলামিক ফাউন্ডেশনঃ ১৯৪২)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2073,
			"arabicnumber": 2073,
			"text": "আবূ হুরাইরাহ্ (রাঃ) সূত্রে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেন যে, আল্লাহর নবী দাঊদ (আঃ) নিজের হাতের উপার্জন হতেই খেতেন। (৩৪১৭, ৩৭১৩) (আধুনিক প্রকাশনীঃ ১৯২৮, ইসলামিক ফাউন্ডেশনঃ ১৯৪৩)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2074,
			"arabicnumber": 2074,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমাদের কারো পক্ষে এক বোঝা লাকড়ী সংগ্রহ করে পিঠে বহন করে নেয়া কারো নিকট চাওয়ার চেয়ে উত্তম। কেউ দিতেও পারে, নাও দিতে পারে। (১৪৭০, মুসলিম ১২/৩৫, হাঃ ১০৪২, আহমাদ ৯৮৭৫) (আধুনিক প্রকাশনীঃ ১৯২৯ , ইসলামিক ফাউন্ডেশনঃ ১৯৪৪)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2075,
			"arabicnumber": 2075,
			"text": "যুবাইর ইবনু আওয়াম (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমাদের কারো জন্য তার রশি নিয়ে কাঠ সংগ্রহ করতে বের হওয়া মানুষের নিকট তার ভিক্ষা করার চেয়ে উত্তম। আবূ নু‘আঈম (রহ.) বলেন, মুহাম্মাদ ইবনু সওয়াব ও ইবনু নুমাইর (রহ.) হিশাম (রহ.)-এর মাধ্যমে তার পিতা হতে হাদীসটি বর্ণনা করেছেন। (১৪৭১) (আধুনিক প্রকাশনীঃ ১৯৩০ , ইসলামিক ফাউন্ডেশনঃ ১৯৪৫)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2076,
			"arabicnumber": 2076,
			"text": "জাবির ইবনু ‘আবদুল্লাহ (রাঃ) হতে বর্ণিত যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, আল্লাহ এমন ব্যক্তির প্রতি রহমত বর্ষণ করেন যে নম্রতার সাথে ক্রয়-বিক্রয় করে ও পাওনা ফিরিয়ে চায়। (আধুনিক প্রকাশনীঃ ১৯৩১ , ইসলামিক ফাউন্ডেশনঃ ১৯৪৬)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2077,
			"arabicnumber": 2077,
			"text": "হুযাইফাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমাদের পূর্ববর্তীদের মধ্যে এক ব্যক্তির রূহের সাথে ফেরেশতা সাক্ষাৎ করে জিজ্ঞেস করলেন, তুমি কি কোন নেক কাজ করেছ? লোকটি উত্তর দিল, আমি আমার কর্মচারীদের আদেশ করতাম যে, তারা যেন সচ্ছল ব্যক্তিকে অবকাশ দেয় এবং তার উপর পীড়াপীড়ি না করে। রাবী বলেন, তিনি বলেছেন, ফেরেশতারাও তাঁকে ক্ষমা করে দেন। (আধুনিক প্রকাশনীঃ ১৯৩২) আবূ মালিক (রহ.) রিব্ঈ ইবনু হিরাশ (রহ.) সূত্রে বর্ণনা করেন, আমি সচ্ছল ব্যক্তির জন্য সহজ করতাম এবং অভাবগ্রস্তকে অবকাশ দিতাম। শু‘বাহ্ (রহ.) আবদুল মালিক (রহ.) হতে অনুরূপ বর্ণনা করেন। আবূ আওয়ানাহ (রহ.) আবদুল মালিক (রহ.) সূত্রে বর্ণনা করেন, আমি সচ্ছলকে অবকাশ দিতাম এবং অভাবগ্রস্তকে মাফ করে দিতাম এবং নু‘আইম ইবনু আবূ হিন্দ (রহ.) রিব্ঈ (রহ.) সূত্রে বলেন, আমি সচ্ছল ব্যক্তি হতে গ্রহণ করতাম এবং অভাবগ্রস্তকে ক্ষমা করে দিতাম। (২৩৯১, ৩৪৫১, মুসলিম ২২/৬, হাঃ ১৫৬০, আহমাদ ২৩৪৪৪) (আধুনিক প্রকাশনীঃ শেষাংশ নেই, ইসলামিক ফাউন্ডেশনঃ ১৯৪৭)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2078,
			"arabicnumber": 2078,
			"text": "আবূ হুরাইরাহ (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেন, জনৈক ব্যবসায়ী লোকদের ঋণ দিত। কোন অভাবগ্রস্তকে দেখলে সে তার কর্মচারীদের বলত, তাকে ক্ষমা করে দাও, হয়তো আল্লাহ তা‘আলা আমাদের ক্ষমা করে দিবেন। এর ফলে আল্লাহ তা‘আলা তাকে ক্ষমা করে দেন। (৩৪৮০, মুসলিম ২২/৬, হাঃ ১৫৬২, আহমাদ ৭৫৮২) (আধুনিক প্রকাশনীঃ ১৯৩৩ , ইসলামিক ফাউন্ডেশনঃ ১৯৪৮)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2079,
			"arabicnumber": 2079,
			"text": "وَيُذْكَرُ عَنْ الْعَدَّاءِ بْنِ خَالِدٍ قَالَ كَتَبَ لِي النَّبِيُّ صلى الله عليه وسلم هَذَا مَا اشْتَرَى مُحَمَّدٌ رَسُولُ اللهِ مِنْ الْعَدَّاءِ بْنِ خَالِدٍ بَيْعَ الْمُسْلِمِ مِنْ الْمُسْلِمِ لاَ دَاءَ وَلاَ خِبْثَةَ وَلاَ غَائِلَةَ وَقَالَ قَتَادَةُ الْغَائِلَةُ الزِّنَا وَالسَّرِقَةُ وَالإبَاقُ وَقِيلَ لإِبْرَاهِيمَ إِنَّ بَعْضَ النَّخَّاسِينَ يُسَمِّي آرِيَّ خُرَاسَانَ وَسِجِسْتَانَ فَيَقُولُ جَاءَ أَمْسِ مِنْ خُرَاسَانَ جَاءَ الْيَوْمَ مِنْ سِجِسْتَانَ فَكَرِهَهُ كَرَاهِيَةً شَدِيدَةً وَقَالَ عُقْبَةُ بْنُ عَامِرٍ لاَ يَحِلُّ لِامْرِئٍ يَبِيعُ سِلْعَةً يَعْلَمُ أَنَّ بِهَا دَاءً إِلاَّ أَخْبَرَهُ ‘আদ্দা ইবনু খালিদ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে লিখে দেন যে, এটি মুহাম্মাদুর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ‘আদ্দা ইবনু খালিদ (রাঃ) হতে খরিদ করলেন। এ হলো এক মুসলিমের সঙ্গে আর এক মুসলিমের ক্রয়-বিক্রয়। এতে নেই কোন খুঁৎ, কোন অবৈধতা এবং গায়েলা। কাতাদাহ (রহ.) বলেন, গায়িলা অর্থ ব্যভিচার, চুরি ও পলায়নের অভ্যাস। ইবরাহীম নাখয়ী (রহ.)-কে বলা হল, কোন কোন দালাল খুরাসান ও সিজিস্তান এর খাসবারশি নাম উচ্চারণ করে এবং বলে, এটি কালকে এসেছে খুরাসান হতে, আর এটি আজ এসেছে সিজিস্তিন হতে। তিনি এরূপ বলাকে খুবই গর্হিত মনে করলেন। উকবা ইবনু আমির (রহ.) বলেন, কোন ব্যক্তির জন্য বৈধ নয় যে, সে কোন পণ্য বিক্রি করছে এবং এর দোষ-ত্রুটি জেনেও তা প্রকাশ করে না। ২০৭৯. হাকীম ইবনু হিযাম (রাঃ) হতে বর্ণিত যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, ক্রেতা-বিক্রেতা যতক্ষণ পরস্পর বিচ্ছিন্ন না হয়, ততক্ষণ তাদের ইখতিয়ার থাকবে (ক্রয়-বিক্রয় সম্পন্ন করা বা বাতিল করা)। যদি তারা সত্য বলে এবং অবস্থা ব্যক্ত করে তবে তাদের ক্রয়-বিক্রয়ে বরকত হবে আর যদি মিথ্যা বলে এবং দোষ গোপন করে তবে তাদের ক্রয়-বিক্রয়ের বরকত মুছে ফেলা হয়। (২০৮২, ২১০৮, ২১১০, ২১১৪, মুসলিম ২১/১০, হাঃ ১৫৩২, আহমাদ ১৫৩২৪) (আধুনিক প্রকাশনীঃ ১৯৩৪ , ইসলামিক ফাউন্ডেশনঃ ১৯৪৯)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2080,
			"arabicnumber": 2080,
			"text": "আবূ সা‘ঈদ খুদরী (রাঃ) হতে বর্ণিত। তিনি বলেন, আমাদের মিশ্রিত খেজুর দেয়া হতো, আমরা তা দু’ সা‘-এর পরিবর্তে এক সা‘ বিক্রি করতাম। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, এক সা’-এর পরিবর্তে দু’সা’ এবং এক দিরহামের পরিবর্তে দু’দিরহাম বিক্রি করবে না। (মুসলিম ৩৬/১৯, হাঃ ২০৩৬, আহমাদ ১৪৮০৭) (আধুনিক প্রকাশনীঃ ১৯৩৫, ইসলামিক ফাউন্ডেশনঃ ১৯৫০)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2081,
			"arabicnumber": 2081,
			"text": "আবূ মাস‘ঊদ (রাঃ) হতে বর্ণিত। তিনি বলেন, আবূ শু‘আইব নামক জনৈক আনসারী এসে তার কসাই গোলামকে বললেন, পাঁচ জনের উপযোগী খাবার তৈরী কর। আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -সহ পাঁচজনকে দাওয়াত করতে যাই। তাঁর চেহারায় আমি ক্ষুধার চিহ্ন দেখতে পেয়েছি। তারপর সে লোক এসে দাওয়াত দিলেন। তাদের সঙ্গে আরেকজন অতিরিক্ত এলেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, এ আমাদের সঙ্গে এসেছে, তুমি ইচ্ছা করলে একে অনুমতি দিতে পার আর তুমি যদি চাও সে ফিরে যাক, তবে সে ফিরে যাবে। সাহাবী বললেন, না, বরং আমি তাকে অনুমতি দিলাম। (২৪৫৬, ৫৪৩৪, ৫৪৬১) (আধুনিক প্রকাশনীঃ ১৯৩৬ , ইসলামিক ফাউন্ডেশনঃ ১৯৫১)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2082,
			"arabicnumber": 2082,
			"text": "হাকীম ইবনু হিযাম (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যতক্ষণ বিচ্ছিন্ন না হবে ততক্ষণ ক্রেতা-বিক্রেতার ইখতিয়ার থাকবে। যদি তারা সত্য বলে ও যথাযথ অবস্থা বর্ণনা করে তবে তাদের ক্রয়-বিক্রয়ে বরকত হবে, আর যদি পণ্যের প্রকৃত অবস্থা গোপন করে ও মিথ্যা বলে তবে ক্রয়-বিক্রয়ের বরকত চলে যাবে। (২০৭৯) (আধুনিক প্রকাশনীঃ ১৯৩৭ , ইসলামিক ফাউন্ডেশনঃ ১৯৫২)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2083,
			"arabicnumber": 2083,
			"text": "(يَا أَيُّهَا الَّذِينَ آمَنُوا لاَ تَأْكُلُوا الرِّبَا أَضْعَافًا مُضَاعَفَةً وَاتَّقُوا اللهَ لَعَلَّكُمْ تُفْلِحُونَ) ‘‘হে মু’মিনগণ! তোমরা চক্রবৃদ্ধিহারে সুদ গ্রহণ করো না এ ব্যাপারে আল্লাহকে ভয় কর তবে সফলতা অর্জন করতে পারবে।’’ (আলু ইমরানঃ ১৩০) ২০৮৩. আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, মানুষের উপর এমন এক যুগ অবশ্যই আসবে যখন মানুষ পরোয়া করবে না যে কিভাবে সে মাল অর্জন করল হালাল উপায়ে না হারাম উপায়ে। (২০৫৯) (আধুনিক প্রকাশনীঃ ১৯৩৮ , ইসলামিক ফাউন্ডেশনঃ ১৯৫৩)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2084,
			"arabicnumber": 2084,
			"text": "وَقَوْلِهِ تَعَالَى (الَّذِينَ يَأْكُلُونَ الرِّبَا لاَ يَقُومُونَ إِلاَّ كَمَا يَقُومُ الَّذِي يَتَخَبَّطُهُ الشَّيْطَانُ مِنْ الْمَسِّ ذَلِكَ بِأَنَّهُمْ قَالُوا إِنَّمَا الْبَيْعُ مِثْلُ الرِّبَا وَأَحَلَّ اللهُ الْبَيْعَ وَحَرَّمَ الرِّبَا فَمَنْ جَاءَهُ مَوْعِظَةٌ مِنْ رَبِّهِ فَانْتَهَى فَلَهُ مَا سَلَفَ وَأَمْرُهُ إِلَى اللهِ وَمَنْ عَادَ فَأُولَئِكَ أَصْحَابُ النَّارِ هُمْ فِيهَا خَالِدُونَ) এ সম্পর্কে আল্লাহ তা‘আলার বাণীঃ যারা সুদ খায় তারা সেই ব্যক্তিরই ন্যায় দাঁড়াবে, যাকে শয়তান স্পর্শ দ্বারা পাগল করে। এ জন্য যে, তারা বলে, বেচাকেনা তো সুদের মতো ....... তারা অগ্নির অধিবাসী, সেখানে তারা স্থায়ী হবে। (আল-বাকারাঃ ২৭৫) ২০৮৪. ‘আয়িশাহ (রাযি.) হতে বর্ণিত। তিনি বলেন, যখন সূরা আল-বাকারার শেষ আয়াতগুলো নাযিল হল, তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তা মসজিদে পড়ে শোনালেন। তারপর মদের ব্যবসা হারাম বলে ঘোষণা করেন। (৪৫৯) (আধুনিক প্রকাশনীঃ ১৯৩৯ , ইসলামিক ফাউন্ডেশনঃ ১৯৫৪)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2085,
			"arabicnumber": 2085,
			"text": "সামুরাহ ইবনু জুনদুব (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, আজ রাত্রে আমি স্বপ্নে দেখেছি যে, দু’ব্যক্তি আমার নিকট আগমন করে আমাকে এক পবিত্র ভূমিতে নিয়ে গেল। আমরা চলতে চলতে এক রক্তের নদীর কাছে পৌঁছলাম। নদীর মধ্যস্থলে এক ব্যক্তি দাঁড়িয়ে আছে এবং আরেক ব্যক্তি নদীর তীরে, তার সামনে পাথর পড়ে রয়েছে। নদীর মাঝখানে লোকটি যখন বের হয়ে আসতে চায় তখন তীরের লোকটি তার মুখে পাথর খন্ড নিক্ষেপ করে তাকে স্বস্থানে ফিরিয়ে দিচ্ছে। এভাবে যতবার সে বেরিয়ে আসতে চায় ততবারই তার মুখে পাথর নিক্ষেপ করছে আর সে স্বস্থানে ফিরে যাচ্ছে। আমি জিজ্ঞেস করলাম, এ কে? সে বলল, যাকে আপনি (রক্তের) নদীতে দেখেছেন, সে হল সুদখোর। (৪৪৫) (আধুনিক প্রকাশনীঃ ১৯৪০ , ইসলামিক ফাউন্ডেশনঃ ১৯৫৫)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2086,
			"arabicnumber": 2086,
			"text": "لِقَوْلِ اللهِ تَعَالَى (يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللهَ وَذَرُوا مَا بَقِيَ مِنْ الرِّبَا إِنْ كُنْتُمْ مُؤْمِنِينَ فَإِنْ لَمْ تَفْعَلُوا فَأْذَنُوا بِحَرْبٍ مِنْ اللهِ وَرَسُولِهِ وَإِنْ تُبْتُمْ فَلَكُمْ رُءُوسُ أَمْوَالِكُمْ لاَ تَظْلِمُونَ وَلاَ تُظْلَمُونَ وَإِنْ كَانَ ذُو عُسْرَةٍ فَنَظِرَةٌ إِلَى مَيْسَرَةٍ وَأَنْ تَصَدَّقُوا خَيْرٌ لَكُمْ إِنْ كُنْتُمْ تَعْلَمُونَ وَاتَّقُوا يَوْمًا تُرْجَعُونَ فِيهِ إِلَى اللهِ ثُمَّ تُوَفَّى كُلُّ نَفْسٍ مَا كَسَبَتْ وَهُمْ لاَ يُظْلَمُونَ) قَالَ ابْنُ عَبَّاسٍ هَذِهِ آخِرُ آيَةٍ نَزَلَتْ عَلَى النَّبِيِّ صلى الله عليه وسلم ‘‘হে মু’মিনগণ! তোমরা আল্লাহকে ভয় কর এবং সুদের যা বকেয়া আছে, তা ছেড়ে দাও। অতঃপর যদি তোমরা না কর তবে যুদ্ধের ঘোষণা শুনে নাও আল্লাহ এবং তার রাসূলের পক্ষ থেকে; আর যদি তোমরা তওবা কর, তবে তোমরা প্রাপ্ত হবে তোমাদের মূলধন; আর তোমরা কারো প্রতি জুলুম করতে পারবে না, আর কেউ তোমাদের প্রতি জুলুম করতে পারবে না।’’ (আল-বাকারা (২) : ২৭৮-২৮১) ইবনু ‘আব্বাস (রাঃ) বলেন, এটিই শেষ আয়াত, যা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর উপর নাযিল হয়েছে। ২০৮৬. আওন ইবনু আবূ জুহাইফা (রহ.) হতে বর্ণিত। তিনি বলেন, আমার পিতাকে দেখেছি, তিনি এক গোলাম খরিদ করেন যে শিঙ্গা লাগানোর কাজ করত। তিনি তার শিঙ্গার যন্ত্রপাতি সম্পর্কে নির্দেশ দিলেন এবং তা ভেঙ্গে ফেলা হল। আমি এ ব্যাপারে তাঁকে জিজ্ঞেস করলে তিনি বললেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কুকুরের মূল্য এবং রক্তের মূল্য গ্রহণ করতে নিষেধ করেছেন [1], আর দেহে দাগ দেয়া ও নেয়া হতে নিষেধ করেছেন। সুদ খাওয়া ও খাওয়ানো নিষেধ করেছেন আর ছবি অঙ্কণকারীর উপর লা‘নত করেছেন। (২২৩৮,৫৩৪৭, ৫৯৪৫, ৫৯৬২) (আধুনিক প্রকাশনীঃ ১৯৪ , ইসলামিক ফাউন্ডেশনঃ ) (আধুনিক প্রকাশনীঃ ১৯৪১ , ইসলামিক ফাউন্ডেশনঃ ১৯৫৬)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2087,
			"arabicnumber": 2087,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে বলতে শুনেছি, মিথ্যা কসম পণ্য চালু করে দেয় বটে, কিন্তু বরকত নিশ্চিহ্ন করে দেয়। (মুসলিম ২২/২৭, হাঃ ১৬০৬, আহমাদ ২২৬০১) (আধুনিক প্রকাশনীঃ ১৯৪২ , ইসলামিক ফাউন্ডেশনঃ ১৯৫৭)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2088,
			"arabicnumber": 2088,
			"text": "‘আবদুল্লাহ ইবনু আবূ ‘আওফা (রাঃ) হতে বর্ণিত যে, এক ব্যক্তি বাজারে পণ্য আমদানী করে আল্লাহর নামে কসম খেল যে, এর এত দাম বলা হয়েছে; কিন্তু প্রকৃতপক্ষে তা কেউ বলেনি। এতে তার উদ্দেশ্য সে যেন কোন মুসলিমকে পণ্যের ব্যাপারে ধোঁকায় ফেলতে পারে। এ প্রসঙ্গে আয়াত অবতীর্ণ হয়, ‘‘যারা আল্লাহর সঙ্গে কৃত প্রতিশ্রুতি এবং নিজেদের শপথকে তুচ্ছ মূল্যে বিক্রি করে’’- (আলে ‘ইমরান ৭৭)। (২৬৭৫, ৪৫৫১) (আধুনিক প্রকাশনীঃ ১৯৪৩ , ইসলামিক ফাউন্ডেশনঃ ১৯৫৮)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2089,
			"arabicnumber": 2089,
			"text": "وَقَالَ طَاوُسٌ عَنْ ابْنِ عَبَّاسٍ قَالَ النَّبِيُّ لاَ يُخْتَلَى خَلاَهَا وَقَالَ الْعَبَّاسُ إِلاَّ الإِذْخِرَ فَإِنَّهُ لِقَيْنِهِمْ وَبُيُوتِهِمْ فَقَالَ إِلاَّ الإِذْخِرَ তাউস (রহ.) ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, মক্কার কাঁচা ঘাস কাটা যাবে না। ‘আব্বাস (রাঃ) বললেন, কিন্তু ইযখির ঘাস ব্যতীত। কেননা তা মক্কা্বাসীদের কর্মকারদের ও তাদের ঘরের কাজে ব্যবহৃত হয়। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, আচ্ছা ইযখির ঘাস ব্যতীত। ২০৮৯. হুসাইন ইবনু ‘আলী (রাঃ) হতে বর্ণিত। তিনি বর্ণনা করেন, ‘আলী (রাঃ) বলেছেন, (বদর যুদ্ধের) গনীমতের মাল হতে আমার অংশের একটি উটনী ছিল এবং নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর খুমুস্ হতে একটি উটনী আমাকে দান করলেন। যখন আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর কন্যা ফাতিমাহ (রাঃ)-এর সঙ্গে বাসর রাত যাপনের ইচ্ছা করলাম সে সময় আমি কায়নুকা গোত্রের একজন স্বর্ণকারের সাথে এই চুক্তি করেছিলাম যে, সে আমার সঙ্গে (জঙ্গলে) যাবে এবং ইযখির ঘাস বহন করে আনবে এবং তা স্বর্ণকারদের নিকট বিক্রি করে তার মূল্য দ্বারা আমার বিবাহের ওয়ালীমার ব্যবস্থা করব। (২৩৭৫, ৩০৯১, ৪০০৩, ৫৭৯৩) (আধুনিক প্রকাশনীঃ ১৯৪৪ , ইসলামিক ফাউন্ডেশনঃ ১৯৫৯)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2090,
			"arabicnumber": 2090,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (মক্কা্ বিজয়ের দিন) বলেন, আল্লাহ তা‘আলা মক্কা্য় (রক্তপাত) হারাম করে দিয়েছেন। আমার আগেও কারো জন্য মক্কা্ হালাল করা হয়নি এবং আমার পরেও কারো জন্য হালাল করা হবে না। আমার জন্য শুধুমাত্র দিনের কিছু অংশে মক্কা্য় (রক্তপাত) হালাল হয়েছিল।[1] মক্কার কোন ঘাস কাটা যাবে না, কোন গাছ কাটা যাবে না। কোন শিকারকে তাড়ানো যাবে না। ঘোষণাকারী ব্যতীত কেউ মক্কার জমিনে পড়ে থাকা মাল উঠাতে পারবে না। ‘আব্বাস ইবনু ‘আবদুল মুত্তালিব (রাঃ) বললেন, কিন্তু ইযখির ঘাস, যা আমাদের স্বর্ণকারদের ও আমাদের ঘরের ছাদের জন্য ব্যবহৃত তা ব্যতীত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, ইযখির ঘাস ব্যতীত। রাবী ইকরাম (রহ.) বলেন, তুমি জানো শিকার তাড়ানোর অর্থ কী? তা হল, ছায়ায় অবস্থিত শিকারকে তাড়িয়ে তার স্থানে নিজে বসা। ‘আবদুল ওয়াহহাব (রহ.) সূত্রে বলেছেন, আমাদের স্বর্ণকারদের জন্য ও আমাদের কবরের জন্য। (১৩৪৯) (আধুনিক প্রকাশনীঃ ১৯৪৫ , ইসলামিক ফাউন্ডেশনঃ ১৯৬০)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 2091,
			"arabicnumber": 2091,
			"text": "খাব্বাব (রাঃ) হতে বর্ণিত। তিনি বলেন, জাহিলীয়্যাতের যুগে আমি কর্মকারের পেশায় ছিলাম। ‘আস ইবনু ওয়াইলের কাছে কিছু পাওনা ছিল আমি তার কাছে তাগাদা করতে গেলে সে বলল, যতক্ষণ তুমি মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে অস্বীকার না করবে ততক্ষণ আমি তোমাকে তোমার পাওনা দিব না। আমি বললাম, আল্লাহ তোমাকে মৃত্যু দিয়ে তারপর তোমাকে পুনরুত্থিত করা পর্যন্ত আমি তাঁকে অস্বীকার করব না। সে বলল, আমি মরে পুনরুত্থিত হওয়া পর্যন্ত আমাকে অব্যাহতি দাও। শীগ্গীরই আমাকে সম্পদ ও সন্তান দেয়া হবে, তখন আমি তোমার পাওনা পরিশোধ করব। এ প্রসঙ্গে এ আয়াত নাযিল হলঃ ‘‘তুমি কি লক্ষ্য করেছ তাকে, যে আমার আয়াতসমূহ প্রত্যাখ্যান করে এবং বলে আমাকে ধন-সম্পদ ও সন্তান-সন্ততি দেয়া হবেই’’- (মারইয়াম ৭৭-৭৮)। (২২৭৫, ২৪২৫, ৪৭৩২ হতে ৪৭৩৫, মুসলিম ৫০/৪, হাঃ ২৭৯৫, আহমাদ ২১১২৫) (আধুনিক প্রকাশনীঃ ১৯৪৬ , ইসলামিক ফাউন্ডেশনঃ ১৯৬১)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 2092,
			"arabicnumber": 2092,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। তিনি বলেন, এক দরজী খাবার তৈরী করে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে দাওয়াত করলেন। আনাস ইবনু মালিক (রাঃ) বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সামনে রুটি এবং ঝোল যাতে লাউ ও গোশতের টুকরা ছিল, পেশ করলেন। আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে দেখতে পেলাম যে, পেয়ালার কিনারা হতে তিনি লাউয়ের টুকরা খোঁজ করে নিচ্ছেন। সেদিন হতে আমি সব সময় লাউ ভালবাসতে থাকি। (৫৩৭৯, ৫৪২০, ৫৪৩৩, ৫৪৩৫, ৪৫৩৭, ৫৪৩৯, মুসলিম ৩৬/২১, হাঃ ২০৪১, আহমাদ ১২৮৬১) (আধুনিক প্রকাশনীঃ ১৯৪৭ , ইসলামিক ফাউন্ডেশনঃ ১৯৬২)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 2093,
			"arabicnumber": 2093,
			"text": "সাহল ইবনু সা‘দ (রাঃ) হতে বর্ণিত। তিনি বলেন, এক মহিলা একটি বুরদা আনলেন। [সাহল (রাঃ)] বললেন, তোমরা জান বুরদা কী? তাকে বলা হয়, হ্যাঁ, তা হল এমন চাদর, যার পাড় বুনানো। মহিলা বললেন, হে আল্লাহর রাসূল! আপনাকে পরিধান করানোর জন্য আমি এটি নিজ হাতে বুনে নিয়ে এসেছি। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তা গ্রহণ করলেন এবং তাঁর এটির প্রয়োজন ছিল। তারপর তিনি তা তহবন্দরূপে পরিধান করে আমাদের সামনে এলেন। উপস্থিত লোকজনের মধ্যে একজন বলে উঠলেন, হে আল্লাহর রাসূল! তা আমাকে পরিধান করতে দিন। তিনি বললেন, আচ্ছা। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কিছুক্ষণ মজলিসে বসে পরে ফিরে গেলেন। তারপর চাদরটি ভাঁজ করে সে লোকটির কাছে পাঠিয়ে দিলেন। লোকজন সে ব্যক্তিকে বললেন, তুমি ভাল করনি, তুমি তাঁর কাছে চাদরটি চেয়ে ফেললে, অথচ তুমি জান যে, তিনি কোন যাচ্ঞাকারীকে ফিরিয়ে দেন না। সে লোকটি বললেন, আল্লাহর কসম, আমি চাদরটি এ জন্যই চেয়েছি যে, তা যাতে আমার মৃত্যুর পর আমার কাফন হয়। রাবী সাহল (রাঃ) বলেন, সেটি তার কাফন হয়েছিল। (১২৭৭) (আধুনিক প্রকাশনীঃ ১৯৪৮ , ইসলামিক ফাউন্ডেশনঃ ১৯৬৩)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 2094,
			"arabicnumber": 2094,
			"text": "আবূ হাযিম (রহ.) হতে বর্ণিত। তিনি বলেন, কিছু লোক সাহল ইবনু সা‘দ (রাঃ)-এর কাছে এসে মিম্বরে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সম্পর্কে জিজ্ঞেস করলেন। তিনি বললেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একজন (আনসারী) মহিলা- সাহল (রাঃ) যার নাম উল্লেখ করেছিলেন- তার কাছে তিনি সংবাদ পাঠালেন যে, তোমার সূত্রধর গোলামকে বল, সে যেন আমার জন্য কাঠ দিয়ে একটি (মিম্বর) তৈরী করে দেয়। লোকদের সাথে কথা বলার সময় যার উপর আমি বসতে পারি। সে মহিলা তাকে গাবা নামক স্থানের কাঠ দিয়ে মিম্বর বানানোর নির্দেশ দিলেন। তারপর গোলামটি তা নিয়ে এল এবং সে মহিলা এটি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর কাছে পাঠিয়ে দিলেন। তাঁর নির্দেশত্রুমে তা স্থাপন করা হল, পরে তার উপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উপবেশন করলেন। (৩৭৭) (আধুনিক প্রকাশনীঃ ১৯৪৯ , ইসলামিক ফাউন্ডেশনঃ ১৯৬৪)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 2095,
			"arabicnumber": 2095,
			"text": "জাবির ইবনু ‘আবদুল্লাহ (রাঃ) হতে বর্ণিত যে, একজন আনসারী মহিলা আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট আরয করলেন, হে আল্লাহর রাসূল! আমি কি আপনার জন্য এমন একটি জিনিস বানিয়ে দিব না, যার উপর আপনি বসবেন? কেননা, আমার একজন কাঠমিস্ত্রি গোলাম আছে। তিনি বললেন, যদি তুমি তা চাও। বর্ণনাকারী বলেন, তারপর সে মহিলা তাঁর জন্য মিম্বার তৈরী করলেন। যখন জুমু‘আর দিন হলো, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সেই তৈরী মিম্বারের উপরে বসলেন। সে সময় যে খেজুর গাছের কান্ডের উপর ভর দিয়ে তিনি খুতবা দিতেন, সেটি এমনভাবে চীৎকার করে উঠল, যেন তা ফেটে পড়বে। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নেমে এসে তাকে নিজের সঙ্গে জড়িয়ে ধরলেন। তখন সেটি ফোঁপাতে লাগল, যেমন ছোট শিশুকে চুপ করানোর সময় ফোঁপায়।[1] অবশেষে তা স্থির হয়ে গেল। (রাবী বলেন) খেজুর কান্ডটি যে যিক্র-নসীহত শুনত, তা হারানোর কারণে কেঁদেছিল। (৪৪৯) (আধুনিক প্রকাশনীঃ ১৯৫০ , ইসলামিক ফাউন্ডেশনঃ ১৯৬৫)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 2096,
			"arabicnumber": 2096,
			"text": "وَقَالَ ابْنُ عُمَرَ اشْتَرَى النَّبِيُّ جَمَلاً مِنْ عُمَرَ وَاشْتَرَى ابْنُ عُمَرَ بِنَفْسِهِ وَقَالَ عَبْدُ الرَّحْمٰنِ بْنُ أَبِي بَكْرٍ جَاءَ مُشْرِكٌ بِغَنَمٍ فَاشْتَرَى النَّبِيُّ صلى الله عليه وسلم مِنْهُ شَاةً وَاشْتَرَى مِنْ جَابِرٍ بَعِيرًا ইবনু ‘উমার (রাঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ‘উমার (রাঃ)-এর নিকট হতে একটি উট খরিদ করেছিলেন। ‘আবদুর রহমান ইবনু আবূ বকর (রাঃ) বলেন, জনৈক মুশরিক তার ছাগলের পাল নিয়ে আসলে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার হতে একটি বকরী খরিদ করেন। আর তিনি জারির (রাঃ) হতে একটি উট খরিদ করেছিলেন। ২০৯৬. ‘আয়িশাহ (রাযি.) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জনৈক ইয়াহূদী হতে বাকীতে খাদ্য ক্রয় করেন এবং নিজের লৌহ বর্ম তার কাছে বন্ধক রাখেন। (২০৬৮) (আধুনিক প্রকাশনীঃ ১৯৫১ , ইসলামিক ফাউন্ডেশনঃ ১৯৬৬)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 2097,
			"arabicnumber": 2097,
			"text": "هَلْ يَكُونُ ذَلِكَ قَبْضًا قَبْلَ أَنْ يَنْزِلَ وَقَالَ ابْنُ عُمَرَ قَالَ النَّبِيُّ صلى الله عليه وسلم لِعُمَرَ بِعْنِيهِ يَعْنِي جَمَلاً صَعْبًا জন্তু বা উট খরিদ কালে বিক্রেতা যদি তার পিঠে আরোহী অবস্থায় থাকে তবে তার অবতরণের পূর্বেই কি ক্রেতার হস্তগত হয়েছে বলে গণ্য হতে পারে? ইবনু ‘উমার (রাঃ) বর্ণনা করেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ‘উমার (রাঃ)-কে বললেন, আমার কাছে তা অর্থাৎ অবাধ্য উট বিক্রয় করে দাও। ২০৯৭. জাবির ইবনু ‘আবদুল্লাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, এক যুদ্ধে আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সঙ্গে ছিলাম। আমার উটটি অত্যন্ত ধীরে চলছিল বরং চলতে অক্ষম হয়ে পড়েছিল। এমতাবস্থায় নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার কাছে এলেন এবং বললেন, জাবির? আমি বললাম, জী। তিনি জিজ্ঞেস করলেন, তোমার অবস্থা কী? আমি বললাম, আমার উট আমাকে নিয়ে অত্যন্ত ধীরে চলছে এবং অক্ষম হয়ে পড়ছে। ফলে আমি পিছনে পড়ে গেছি। তখন তিনি নেমে চাবুক দিয়ে উটটিকে আঘাত করতে লাগলেন। তারপর বললেন, এবার আরোহণ কর। আমি আরোহণ করলাম। এরপর অবশ্য আমি উটটিকে এমন পেলাম যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে অগ্রসর হওয়ায় বাধা দিতে হয়েছিল। তিনি জিজ্ঞেস করলেন, তুমি কি বিবাহ করেছ? আমি বললাম, হ্যাঁ। তিনি বললেন, কুমারী না বিবাহিতা? আমি বললাম, বিবাহিতা। তিনি বললেন, তরুণী বিবাহ করলে না কেন? তুমি তার সাথে হাসি-তামাসা এবং সে তোমার সাথে পূর্ণভাবে হাঁসি-তামাসা করত। আমি বললাম, আমার কয়েকটি বোন রয়েছে, ফলে আমি এমন এক মহিলাকে বিবাহ করতে পছন্দ করলাম, যে তাদেরকে মিল-মহববতে রাখতে, তাদের পরিচর্যা করতে এবং তাদের উপর উত্তমরূপে কর্তৃত্ব করতে সক্ষম হয়। তিনি বললেন, শোন! তুমি তো বাড়ীতে পৌঁছবে? যখন তুমি পৌঁছবে তখন তুমি বুদ্ধিমত্তার পরিচয় দেবে। তিনি বললেন, তোমার উটটি বিক্রি করবে? আমি বললাম, হ্যাঁ। তিনি তা এক উকীয়ার বিনিময়ে আমার নিকট হতে কিনে নিলেন। তারপর আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার আগে (মদ্বীনায়) পৌঁছলেন এবং আমি (পরের দিন) ভোরে পৌঁছলাম। আমি মসজিদে নাববীতে গিয়ে তাঁকে দরজার সামনে পেলাম। তিনি জিজ্ঞেস করলেন, এখন এলে? আমি বললাম, হ্যাঁ। তিনি বললেন, তোমার উটটি রাখ এবং মসজিদে প্রবেশ করে দু’রাক‘আত সালাত আদায় কর। আমি মসজিদে প্রবেশ করে সালাত আদায় করলাম। তারপর তিনি বিলাল (রাঃ)-কে উকীয়া ওজন করে আমাকে দিতে বললেন। বিলাল (রাঃ) ওজন করে দিলেন এবং আমার পক্ষে ঝুঁকিয়ে দিলেন। আমি রওয়ানা হলাম। যখন আমি পিছনে ফিরেছি তখন তিনি বললেন, জাবিরকে আমার কাছে ডাক। আমি ভাবলাম, এখন হয়তো উটটি আমাকে ফিরিয়ে দেবেন। আর আমার নিকট এর চেয়ে অপছন্দনীয় আর কিছুই ছিল না। তিনি বললেন, তোমার উটটি নিয়ে যাও এবং তার দামও তোমার। (৪৪৩, মুসলিম ৬/১১, হাঃ ৭১৫) (আধুনিক প্রকাশনীঃ ১৯৫২ , ইসলামিক ফাউন্ডেশনঃ ১৯৬৭)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 2098,
			"arabicnumber": 2098,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বললেন, উকায, মাজান্না ও যুল-মাজায জাহিলী যুগের বাজার ছিল, ইসলামের আবির্ভাবের পরে লোকেরা তথায় ব্যবসা করা গুনাহের কাজ মনে করল। এ প্রসঙ্গে আল্লাহ তা‘আলা নাযিল করলেনঃ তোমাদের উপর কোন গুনাহ নাই ....... (অর্থাৎ) হাজ্জের মওসুমে। ইবনু ‘আব্বাস (রাঃ) এরূপ পড়েছেন। (১৭৭০) (আধুনিক প্রকাশনীঃ ১৯৫৩ , ইসলামিক ফাউন্ডেশনঃ ১৯৬৮)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 2099,
			"arabicnumber": 2099,
			"text": "الْهَائِمُ الْمُخَالِفُ لِلْقَصْدِ فِي كُلِّ شَيْءٍ. হায়িম বলা হয় যে কোন ব্যাপারে মধ্যম পন্থা বর্জনকারীকে। ২০৯৯. ‘আমর (ইবনু দ্বীনার) (রহ.) বলেন, এখানে নাওওয়াস নামক এক ব্যক্তি ছিল। তার নিকট অতি পিপাসা রোগে আক্রান্ত একটি উট ছিল। ইবনু ‘উমার (রাঃ) তার শরীকের কাছ হতে সে উটটি কিনে নেন। পরে তার শরীক তার নিকট উপস্থিত হয়ে বলল, সে উটটি বিক্রি করে দিয়েছি। নাওওয়াস জিজ্ঞেস করলেন, কার কাছে বিক্রি করেছ? সে বলল, এমন আকৃতির এক বৃদ্ধের কাছে। নাওওয়াস বলে উঠলেন, আরে কি সর্বনাশ! তিনি তো আল্লাহর কসম ইবনু ‘উমার (রাঃ) ছিলেন। এরপর নাওওয়াস তাঁর নিকট এলেন এবং বললেন, আমার শরীক আপনাকে চিনতে না পেরে আপনার কাছে একটি পিপাসাক্রান্ত উট বিক্রি করেছে। তিনি বললেন, তবে উটটি নিয়ে যাও। সে যখন উটটি নিয়ে যেতে উদ্যত হলো, তখন তিনি বললেন, রেখে দাও। আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর ফায়সালায় সন্তুষ্ট যে, রোগে কোন সংক্রমণ নেই। সুফয়ান (রহ.) ‘আমর (রহ.) হতে উক্ত হাদীসটি শুনেছেন। (২৮৫৮, ৫০৯৩, ৫০৯৪, ৫৭৫৩, ৫৭৭২) (আধুনিক প্রকাশনীঃ ১৯৫৪ , ইসলামিক ফাউন্ডেশনঃ ১৯৬৯)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 2100,
			"arabicnumber": 2100,
			"text": "وَكَرِهَ عِمْرَانُ بْنُ حُصَيْنٍ بَيْعَهُ فِي الْفِتْنَةِ ইমরান ইবনু হুসাইন (রাঃ) ফিতনার সময় অস্ত্র বিক্রয়কে অপছন্দ করতেন। ২১০০. আবূ কাতাদাহ (রাঃ) হতে বর্ণিত। তিনি বললেন, আমরা আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সাথে হুনাইনের যুদ্ধে গমন করেছিলাম। তখন তিনি আমাকে একটি বর্ম দিয়েছিলেন। আমি সেটি বিক্রয় করে তার মূল্য দ্বারা বণূ সালিমা গোত্রের এলাকায় একটি বাগান ক্রয় করি। এ ছিল ইসলাম গ্রহণের পর আমার প্রথম স্থাবর সম্পত্তি অর্জন। (৩১৪২, ৩৪২১, ৩৩২, ৭১৭০) (আধুনিক প্রকাশনীঃ ১৯৫৫ , ইসলামিক ফাউন্ডেশনঃ ১৯৭০)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 2101,
			"arabicnumber": 2101,
			"text": "আবূ মূসা (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, সৎ সঙ্গী ও অসৎ সঙ্গীর উদাহরণ মিস্ক বিক্রেতা ও কর্মকারের হাপরের ন্যায়। আতর বিক্রেতাদের থেকে শূন্য হাতে ফিরে আসবে না। হয় তুমি আতর খরিদ করবে, না হয় তার সুঘ্রাণ পাবে। আর কর্মকারের হাপর হয় তোমার ঘর অথবা তোমার কাপড় পুড়িয়ে দেবে, না হয় তুমি তার দুর্গন্ধ পাবে। (৫৫৩৪) (আধুনিক প্রকাশনীঃ ১৯৫৬ , ইসলামিক ফাউন্ডেশনঃ ১৯৭১)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 2102,
			"arabicnumber": 2102,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। তিনি বলেন, আবূ তায়বা আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে শিঙ্গা লাগালেন তখন তিনি তাকে এক সা‘ পরিমাণ খেজুর দিতে আদেশ করলেন এবং তার মালিককে তার দৈনিক পারিশ্রমিকের হার কমিয়ে দেয়ার নির্দেশ দিলেন। (২২১০, ২২৭৭, ২২৮০, ২২৮১, ৫৬৯৬) (আধুনিক প্রকাশনীঃ ১৯৫৭ , ইসলামিক ফাউন্ডেশনঃ ১৯৭২)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 2103,
			"arabicnumber": 2103,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম শিঙ্গা লাগালেন এবং যে তাঁকে শিঙ্গা লাগিয়েছে, তাকে তিনি মজুরী দিলেন। যদি তা হারাম হতো তবে তিনি তা দিতেন না। (১৮৩৫) (আধুনিক প্রকাশনীঃ ১৯৫৮ , ইসলামিক ফাউন্ডেশনঃ ১৯৭৩)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 2104,
			"arabicnumber": 2104,
			"text": "‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ‘উমার (রাঃ)-এর নিকট একটি রেশমী চাদর পাঠিয়ে দেন, পরে তিনি তা তাঁর গায়ে দেখতে পেয়ে বলেন, আমি তা তোমাকে এ জন্য দেইনি যে, তুমি তা পরিধান করবে। অবশ্য তা তারাই পরিধান করে, যার (আখিরাতে) কোন অংশ নেই। আমি তো তা তোমার কাছে এজন্য পাঠিয়েছি যে, তুমি তা দিয়ে উপকৃত হবে অর্থাৎ তা বিক্রি করবে। (৮৮৬) (আধুনিক প্রকাশনীঃ ১৯৫৯ , ইসলামিক ফাউন্ডেশনঃ ১৯৭৪)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 2105,
			"arabicnumber": 2105,
			"text": "উম্মুল মু’মিনীন ‘আয়িশাহ (রাযি.) হতে বর্ণিত। তিনি বর্ণনা করেন যে, তিনি একটি ছবিওয়ালা বালিশ ক্রয় করেন। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তা দেখতে পেয়ে দরজায় দাঁড়িয়ে গেলেন, ভিতরে প্রবেশ করলেন না। আমি তাঁর চেহারায় অসন্তুষ্টি ভাব দেখতে পেলাম। তখন বললাম, হে আল্লাহর রাসূল! আমি আল্লাহ ও তাঁর রাসূলের কাছে তওবা করছি। আমি কী অপরাধ করেছি? তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, এ বালিশের কী ব্যাপার? ‘আয়িশাহ (রাযি.) বলেন, আমি বললাম, আমি এটি আপনার জন্য ক্রয় করেছি, যাতে আপনি টেক লাগিয়ে বসতে পারেন। তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, এই ছবি তৈরীকারীদের কিয়ামতের দিন শাস্তি দেয়া হবে। তাদের বলা হবে, তোমরা যা তৈরী করেছিলে, তা জীবিত কর। তিনি আরো বলেন, যে ঘরে এ সব ছবি থাকে, সে ঘরে (রহমতের) ফেরেশতাগণ প্রবেশ করেন না। (৩২২৪, ৫১৮১, ৫৯৫৭, ৫৯৬১, ৭৫৫৭, মুসলিম ৩৭/২৬, হাঃ ২১০৭, আহমাদ ২৬১৪৯) (আধুনিক প্রকাশনীঃ ১৯৫ , ইসলামিক ফাউন্ডেশনঃ ) (আধুনিক প্রকাশনীঃ ১৯৬০ , ইসলামিক ফাউন্ডেশনঃ ১৯৭৫)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 2106,
			"arabicnumber": 2106,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, হে বানূ নাজ্জার! আমাকে তোমাদের বাগানের মূল্য বল। বাগানটিতে ঘরের ভাঙা চুরা অংশ ও খেজুর গাছ ছিল। (২৩৪) (আধুনিক প্রকাশনীঃ ১৯৬১ , ইসলামিক ফাউন্ডেশনঃ ১৯৭৬)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 2107,
			"arabicnumber": 2107,
			"text": "ইবনু ‘উমার (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেন, ক্রেতা-বিক্রেতা যতক্ষণ বিচ্ছিন্ন না হবে, ততক্ষণ তাদের বেচা-কেনার ব্যাপারে উভয়ের ইখতিয়ার থাকবে। আর যদি খিয়ারের শর্তে ক্রয়-বিক্রয় হয় (তাহলে পরেও ইখতিয়ার থাকবে)। নাফি‘ (রহ.) বলেন, ইবনু ‘উমার (রাঃ) কোন পণ্য ক্রয়ের পর তা পছন্দ হলে মালিক হতে বিচ্ছিন্ন হয়ে পড়তেন। (২১০৯, ২১১১, ২১১৩, ২১১৬, মুসলিম ২১/১০, হাঃ ১৫৩১, আহমাদ ৫৪১৯) (আধুনিক প্রকাশনীঃ ১৯৬২ , ইসলামিক ফাউন্ডেশনঃ ১৯৭৭)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 2108,
			"arabicnumber": 2108,
			"text": "হাকীম ইবনু হিযাম (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেন, যতক্ষণ ক্রেতা-বিক্রেতা বিচ্ছিন্ন না হবে ততক্ষণ তাদের খিয়ারের অধিকার থাকবে। وَزَادَ أَحْمَدُ حَدَّثَنَا بَهْزٌ قَالَ قَالَ هَمَّامٌ فَذَكَرْتُ ذَلِكَ لأَبِي التَّيَّاحِ فَقَالَ كُنْتُ مَعَ أَبِي الْخَلِيلِ لَمَّا حَدَّثَهُ عَبْدُ اللهِ بْنُ الْحَارِثِ بِهَذَا الْحَدِيثِ আহমাদ (রহ.) বাহয (রহ.) সূত্রে অতিরিক্ত বর্ণনা করেন যে, হাম্মাম (রহ.) বলেন, আমি আবূ তাইয়্যাহ্ (রহ.)-কে এ হাদীস সম্পর্কে জিজ্ঞেস করেছিলাম। তিনি বললেন, তখন আমি তার সাথে ছিলাম যখন ‘আবদুল্লাহ ইবনু হারিস এই হাদীসটি আবূ খলীলকে বর্ণনা করেন। (২০৭৯) (আধুনিক প্রকাশনীঃ ১৯৬৩ , ইসলামিক ফাউন্ডেশনঃ ১৯৭৮)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 2109,
			"arabicnumber": 2109,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, বিচ্ছিন্ন না হওয়া পর্যন্ত ক্রেতা-বিক্রেতা উভয়ের খিয়ার থাকবে অথবা একপক্ষ অপর পক্ষকে বলবে, গ্রহণ করে নাও। রাবী কখনো বলেছেনঃ অথবা গ্রহণ বা প্রত্যাখ্যানের শর্তে ক্রয়-বিক্রয় হলো। (২১০৭) (আধুনিক প্রকাশনীঃ ১৯৬৪ , ইসলামিক ফাউন্ডেশনঃ ১৯৭৯)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 2110,
			"arabicnumber": 2110,
			"text": "وَبِهِ قَالَ ابْنُ عُمَرَ وَشُرَيْحٌ وَالشَّعْبِيُّ وَطَاوُسٌ وَعَطَاءٌ وَابْنُ أَبِي مُلَيْكَةَ ইবনু ‘উমার (রাঃ), শুরাইহ, শা‘বী, তাউস ও ইবনু আবূ মুলায়কা (রহ.) এ অভিমত ব্যক্ত করেছেন। ২১১০. হাকীম ইবনু হিযাম (রাঃ) সূত্রে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, ক্রেতা-বিক্রেতা (একে অপরের সাথে) বিচ্ছিন্ন না হওয়া পর্যন্ত তাদের উভয়ের ইখতিয়ার থাকবে। যদি তারা উভয়ে সত্য কথা বলে ও (পণ্যের দোষ-ত্রুটি) যথাযথ বর্ণনা করে তবে তাদের কেনা বেচায় বরকত হবে, আর যদি তারা মিথ্যা বলে ও (ত্রুটি) গোপন করে, তবে তাদের কেনা বেচার বরকত নষ্ট হয়ে যাবে। (২০৭৯) (আধুনিক প্রকাশনীঃ ১৯৬৫ , ইসলামিক ফাউন্ডেশনঃ ১৯৮০)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 2111,
			"arabicnumber": 2111,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, ক্রেতা-বিক্রেতা প্রত্যেকের একে অপরের উপর ইখতিয়ার থাকবে, যতক্ষণ তারা বিচ্ছিন্ন না হবে। তবে খিয়ারের শর্তে ক্রয়-বিক্রয়ে (বিচ্ছিন্ন হওয়ার পরও ইখতিয়ার থাকবে)। (২১০৭) (আধুনিক প্রকাশনীঃ ১৯৬৬ , ইসলামিক ফাউন্ডেশনঃ ১৯৮১)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 2112,
			"arabicnumber": 2112,
			"text": "ইবনু ‘উমার (রাঃ) সূত্রে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেন, যখন দু’ ব্যক্তি ক্রয়-বিক্রয় করে, তখন তাদের উভয়ে যতক্ষণ বিচ্ছিন্ন না হবে অথবা একে অপরকে ইখতিয়ার প্রদান না করবে, ততক্ষণ তাদের উভয়ের ইখতিয়ার থাকবে। এভাবে তারা উভয়ে যদি ক্রয়-বিক্রয় করে তবে তা সাব্যস্ত হয়ে যাবে। আর যদি তারা উভয়ে ক্রয়-বিক্রয়ের পর বিচ্ছিন্ন হয়ে যায় এবং তাদের কেউ যদি তা পরিত্যাগ না করে তবে ক্রয়-বিক্রয় সাব্যস্ত হয়ে যাবে। (২১০৭) (আধুনিক প্রকাশনীঃ ১৯৬৭ , ইসলামিক ফাউন্ডেশনঃ ১৯৮২)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 2113,
			"arabicnumber": 2113,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, ক্রেতা-বিক্রেতা উভয়ে যতক্ষণ বিচ্ছিন্ন না হবে, ততক্ষণ তাদের মাঝে কোন ক্রয়-বিক্রয় সাব্যস্ত হবে না। অবশ্য ইখতিয়ারের শর্তে ক্রয়-বিক্রয় হলে তা সাব্যস্ত হবে। (২১০৭) (আধুনিক প্রকাশনীঃ ১৯৬৮ , ইসলামিক ফাউন্ডেশনঃ ১৯৮৩)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 2114,
			"arabicnumber": 2114,
			"text": "হাকীম ইবনু হিযাম (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, ক্রেতা-বিক্রেতার ইখতিয়ার থাকবে উভয়ের বিচ্ছিন্ন না হওয়া পর্যন্ত। যদি তারা উভয়ে সত্য কথা বলে এবং (পণ্যের দোষগুণ) যথাযথ বর্ণনা করে, তবে তাদের ক্রয়-বিক্রয়ে বরকত দেয়া হবে, আর যদি তারা মিথ্যা বলে এবং গোপন করে, তবে হয়তো খুব লাভ করবে এবং কিন্তু তাদের ক্রয়-বিক্রয়ে বরকত মুছে যাবে। অপর সনদে হাম্মাম ..... ‘আবদুল্লাহ ইবনু হারিস (রহ.) হাকীম ইবনু হিযাম (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এই হাদীসটি বর্ণনা করেছেন। (২০৭৯) (আধুনিক প্রকাশনীঃ ১৯৬৯ , ইসলামিক ফাউন্ডেশনঃ ১৯৮৪)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 2115,
			"arabicnumber": 2115,
			"text": "وَقَالَ طَاوُسٌ فِيمَنْ يَشْتَرِي السِّلْعَةَ عَلَى الرِّضَا ثُمَّ بَاعَهَا وَجَبَتْ لَهُ وَالرِّبْحُ لَهُ তাউস (রহ.) বলেন, স্বেচ্ছায় পণ্য ক্রয় করে পরে তা বিক্রি করে দিলে তা সাব্যস্ত হয়ে যাবে এবং মুনাফা সেই (প্রথম ক্রেতা যে পরে বিক্রি করল) পাবে। ২১১৫. ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, আমরা এক সফরে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সাথে ছিলাম। আমি (আমার পিতা) ‘উমার (রাঃ)-এর একটি অবাধ্য জওয়ান উটের উপর সাওয়ার ছিলাম। উটটি আমার নিয়ন্ত্রণের বাইরে গিয়ে সকলের আগে আগে চলে যাচ্ছিল। ‘উমার (রাঃ) তাকে তাড়িয়ে ফিরিয়ে আনছিলেন। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ‘উমার (রাঃ)-কে বললেন, এটি আমার কাছে বিক্রি করে দাও। তিনি বললেন, হে আল্লাহর রাসূল! এটা আপনারই। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তুমি এটি আমার কাছে বিক্রি কর। তখন তিনি সেটি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর কাছে বিক্রি করে দিলেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, হে ‘আবদুল্লাহ ইবনু উমার! এটি তোমার, তুমি এটি দিয়ে যা ইচ্ছা তা কর। (২৬১০, ২৬১১) (আধুনিক প্রকাশনীঃ কিতাবুল বুয়ু‘ অনুচ্ছেদ ৪৭ , ইসলামিক ফাউন্ডেশনঃ অনুচ্ছেদ ১৩২৩)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 2116,
			"arabicnumber": 2116,
			"text": "‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, আমীরুল মু’মিনীন ‘উসমান ইবনু আফফান (রাঃ)-এর খায়বারের জমিনের বিনিময়ে আমি ওয়াদির জমিন তাঁর কাছে বিক্রি করলাম। আমরা যখন ক্রয়-বিক্রয় সম্পন্ন করলাম, তখন আমি পিছনের দিকে ফিরে তাঁর ঘর হতে এই ভয়ে বের হয়ে গেলাম যে, তিনি হয়তো আমার এ বিক্রয় রদ্দ করে দিবেন। সে সময়ে এ রীতি প্রচলিত ছিল যে, বিচ্ছিন্ন না হওয়া পর্যন্ত ক্রেতা-বিক্রেতার ইখতিয়ার থাকত। ‘আবদুল্লাহ (রাঃ) বললেন, যখন আমার ও তাঁর মাঝে ক্রয়-বিক্রয় নিশ্চিত হয়ে গেল তখন আমি চিন্তা করে দেখলাম যে, আমি এভাবে তাঁকে ঠকিয়েছি। আমি তাঁকে ছামূদ ভূখন্ডের তিন দিনের পথের দূরত্বের পরিমাণ পৌঁছিয়ে দিয়েছি আর তিনি আমাকে মদিনার তিন দিনের পথের দূরত্বের পরিমাণ পৌঁছে দিয়েছেন। (২১০৭) (আধুনিক প্রকাশনীঃ কিতাবুল বুয়ু‘ অনুচ্ছেদ ৪৭ , ইসলামিক ফাউন্ডেশনঃ অনুচ্ছেদ ১৩২৩ শেষাংশ)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 2117,
			"arabicnumber": 2117,
			"text": "আব্দুল্লাহ ইবনু ‘উমার (রাঃ) হতে বর্ণিত যে, এক সাহাবী নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট উল্লেখ করলেন যে, তাকে ক্রয়-বিক্রয়ে ধোঁকা দেয়া হয়। তখন তিনি বললেন, যখন তুমি ক্রয়-বিক্রয় করবে তখন বলে নিবে কোন প্রকার ধোঁকা নেই। (২৪০৭, ২৪১৪, ৬৯৬৪, মুসলিম ২১/১২, হাঃ ১৫৩৩, আহমাদ ৫৪০৫) (আধুনিক প্রকাশনীঃ ১৯৭০ , ইসলামিক ফাউন্ডেশনঃ ১৯৮৫)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 2118,
			"arabicnumber": 2118,
			"text": "وَقَالَ عَبْدُ الرَّحْمٰنِ بْنُ عَوْفٍ لَمَّا قَدِمْنَا الْمَدِينَةَ قُلْتُ هَلْ مِنْ سُوقٍ فِيهِ تِجَارَةٌ قَالَ سُوقُ قَيْنُقَاعَ وَقَالَ أَنَسٌ قَالَ عَبْدُ الرَّحْمٰنِ دُلُّونِي عَلَى السُّوقِ وَقَالَ عُمَرُ أَلْهَانِي الصَّفْقُ بِالأَسْوَاقِ ‘আবদুর রহমান ইবনু আউফ (রাঃ) বলেন, আমরা মদিনা্য় আগমনের পর জিজ্ঞেস করলাম, এমন কোন বাজার আছে কি, যেখানে ব্যবসা-বাণিজ্য হয়? সে বলল, কায়নুকার বাজার আছে। আনাস (রাঃ) বলেন, ‘আবদুর রহমান (রাঃ) বললেন, আমাকে বাজারের রাস্তা দেখিয়ে দাও। ‘উমার (রাঃ) বলেন, আমাকে বাজারের কেনা বেচা গাফিল করে রেখেছে। ২১১৮. ‘আয়িশাহ (রাযি.) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, (পরবর্তী যামানায়) একদল সৈন্য কা‘বা (ধ্বংসের উদ্দেশে) অভিযান চালাবে। যখন তারা বায়দা নামক স্থানে পৌঁছবে তখন তাদের আগের পিছের সকলকে জমিনে ধ্বসিয়ে দেয়া হবে। ‘আয়িশাহ (রাযি.) বলেন, আমি বললাম, হে আল্লাহর রাসূল! তাদের অগ্রবাহিনী ও পশ্চাৎবাহিনী সকলকে কিভাবে ধ্বসিয়ে দেয়া হবে, অথচ সে সেনাবাহিনীতে তাদের বাজারের (পণ্য-সামগ্রী বহনকারী) লোকও থাকবে এবং এমন লোকও থাকবে যারা তাদের দলভুক্ত নয়, তিনি বললেন, তাদের আগের পিছের সকলকে ধ্বসিয়ে দেয়া হবে। তারপরে (কিয়ামতের দিবসে) তাদের নিজেদের নিয়্যাত অনুযায়ী উত্থান করা হবে। (মুসলিম ৫২/২, হাঃ ২৮৮৩, আহমাদ ২৬৫০৬) (আধুনিক প্রকাশনীঃ ১৯৭১ , ইসলামিক ফাউন্ডেশনঃ ১৯৮৬)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 2119,
			"arabicnumber": 2119,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমাদের কারো জামা‘আতে সালাত আদায়ে নিজ ঘরের সালাতের চেয়ে বিশ গুণেরও অধিক মর্তবা রয়েছে। কারণ সে যখন উত্তমরূপে অযু করে মসজিদে আসে, সালাত আদায় ছাড়া অন্য কোন অভিপ্রায়ে আসে না, সালাত ছাড়া অন্য কিছুই তাকে উদ্বুদ্ধ করে না। এমতাবস্থায় তার প্রতি কদমে এক মর্তবা বৃদ্ধি করা হবে এবং একটি গুনাহ ক্ষমা করে দেয়া হবে। আর ফেরেশতাগণ তোমাদের সে ব্যক্তির জন্য (এ মর্মে) দু‘আ করতে থাকবেন, যতক্ষণ সে যেখানে সালাত আদায় করেছে, হে আল্লাহ! আপনি তার প্রতি অনুগ্রহ করুন, তার প্রতি রহম করুন। যতক্ষণ না সে তথায় অযু ভঙ্গ করে, যতক্ষণ না সে তথায় কাউকে কষ্ট দেয়। তিনি আরো বলেছেন, তোমাদের সে ব্যক্তি সালাতে রত গণ্য হবে, যতক্ষণ সে সালাতের অপেক্ষায় থাকে। (১৭৬) (আধুনিক প্রকাশনীঃ ১৯৭২, ইসলামিক ফাউন্ডেশনঃ ১৯৮৭)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 2120,
			"arabicnumber": 2120,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক সময় বাজারে ছিলেন। তখন এক ব্যক্তি বললেন, এই আবুল কাসিম! নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার দিকে তাকালে তিনি বললেন, আমি তো তাকে ডেকেছি। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তোমরা আমার নামে নাম রাখ কিন্তু আমার কুনিয়াতে কুনিয়াত রেখ না। [1] (২১২১, ৩৫৩৭, মুসলিম ৩৮/১, হাঃ ২১৩১, আহমাদ ১২১৩১) (আধুনিক প্রকাশনীঃ ১৯৭৩ , ইসলামিক ফাউন্ডেশনঃ ১৯৮৮)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 2121,
			"arabicnumber": 2121,
			"text": "আনাস (রাঃ) হতে বর্ণিত। তিনি বলেন, এক সাহাবী বাকী‘ নামক স্থানে আবুল কাসিম বলে (কাউকে) ডাক দিলেন। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার দিকে তাকালেন। তিনি বললেন, আমি আপনাকে উদ্দেশ্য করিনি। তখন তিনি বললেন, তোমরা আমার নামে নাম রাখ কিন্তু আমার কুনিয়াতে কারো কুনিয়াত রেখ না। (২১২০) (আধুনিক প্রকাশনীঃ ১৯৭৩(ক) , ইসলামিক ফাউন্ডেশনঃ ১৯৮৯",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 2122,
			"arabicnumber": 2122,
			"text": "আবূ হুরাইরাহ্ দাওসী (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দিনের এক অংশে বের হলেন, তিনি আমার সঙ্গে কথা বলেননি এবং আমিও তাঁর সঙ্গে কথা বলিনি। অবশেষে তিনি বানূ কায়নুকা বাজারে এলেন (সেখান হতে ফিরে এসে) ফাতিমা (রাযি.)-এর ঘরের আঙিণায় বসে পড়লেন। তারপর বললেন, এখানে খোকা [হাসান (রাঃ)] আছে কি? এখানে খোকা আছে কি? ফাতিমা (রাযি.) তাঁকে কিছুক্ষণ দেরী করালেন। আমার ধারণা হল তিনি তাঁকে পুতির মালা সোনা-রূপা ছাড়া যা বাচ্চাদের পরানো হতো, পরাচ্ছিলেন। তারপর তিনি দৌড়িয়ে এসে তাকে জড়িয়ে ধরলেন এবং চুমু খেলেন। তখন তিনি বললেন, হে আল্লাহ! তুমি তাঁকেও (হাসানকে) মহববত কর এবং তাকে যে ভালবাসবে তাকেও মহববত কর। সুফইয়ান (রহ.) বলেন, আমার কাছে ‘উবাইদুল্লাহ বর্ণনা করেছেন যে, তিনি নাফি‘ ইবনু জুবায়রকে এক রাক‘আত মিলিয়ে বিতর আদায় করতে দেখেছেন। (৫৮৮৪, মুসলিম ৪৪/৮, হাঃ ২৪২১, আহমাদ ৭৪০২) (আধুনিক প্রকাশনীঃ ১৯৭৪ , ইসলামিক ফাউন্ডেশনঃ ১৯৯০)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 2124,
			"arabicnumber": 2124,
			"text": "",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 2125,
			"arabicnumber": 2125,
			"text": "‘আতা ইবনু ইয়াসার (রহ.) হতে বর্ণিত। তিনি বলেন, আমি ‘আবদুল্লাহ ইবনু আমর ইবনু আস (রাঃ)-কে বললাম, আপনি আমাদের কাছে তাওরাতে বর্ণিত আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর গুণাবলী বর্ণনা করুন। তিনি বললেন, আচ্ছা। আল্লাহর কসম! কুরআনে বর্ণিত তাঁর কিছু গুণাবলী তাওরাতেও উল্লেখ করা হয়েছেঃ ‘‘হে নবী! আমি আপনাকে সাক্ষীরূপে, সুসংবাদদাতা ও ভয় প্রদর্শনকারীরূপে প্রেরণ করেছি’’ এবং উম্মীদের রক্ষক হিসাবেও। আপনি আমার বান্দা ও আমার রাসূল। আমি আপনার নাম মুতাওয়াক্কিল (আল্লাহর উপর ভরসাকারী) রেখেছি। তিনি বাজারে কঠোর রূঢ় ও নির্দয় স্বভাবের ছিলেন না। তিনি মন্দর প্রতিশোধ মন্দ দ্বারা নিতেন না বরং মাফ করে দিতেন, ক্ষমা করে দিতেন। আল্লাহ তা‘আলা তাঁকে ততক্ষণ মৃত্যু দিবেন না যতক্ষণ না তাঁর দ্বারা বিকৃত মিল্লাতকে ঠিক পথে আনেন অর্থাৎ যতক্ষণ না তারা (আরববাসীরা) ‘লা ইলাহা ইল্লাল্লাহ’ এর ঘোষণা দিবে। আর এ কালিমার মাধ্যমে অন্ধ-চক্ষু, বধির-কর্ণ ও আচ্ছাদিত হৃদয় খুলে যাবে। আবদুল ‘আযীয ইবনু আবূ সালামাহ (রহ.) হিলাল (রহ.) হতে হাদীস বর্ণনায় ফুলাইহ (রহ.)-এর অনুসরণ করেছেন। সা‘ঈদ (রহ.) ....... ইবনু সালাম (রহ.) হতে হাদীস বর্ণনা করেছেন। (৪৮৩৮) (আধুনিক প্রকাশনীঃ ১৯৭৭ , ইসলামিক ফাউন্ডেশনঃ ১৯৯২)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 2126,
			"arabicnumber": 2126,
			"text": "لِقَوْلِ اللهِ تَعَالَى (وَإِذَا كَالُوهُمْ أَوْ وَزَنُوهُمْ يُخْسِرُونَ) يَعْنِي كَالُوا لَهُمْ وَوَزَنُوا لَهُمْ كَقَوْلِهِ (يَسْمَعُونَكُمْ) يَسْمَعُونَ لَكُمْ وَقَالَ النَّبِيُّ اكْتَالُوا حَتَّى تَسْتَوْفُوا وَيُذْكَرُ عَنْ عُثْمَانَ t أَنَّ النَّبِيَّ قَالَ لَهُ إِذَا بِعْتَ فَكِلْ وَإِذَا ابْتَعْتَ فَاكْتَلْ আল্লাহ তা‘আলার বাণীঃ ‘‘যখন তারা লোকদের মেপে দেয় অথবা ওজন করে দেয় তখন কম দেয়’’- (মুত্বাফফিফীন (৮৩) : ৩)। এখানে (يَسْمَعُونَكُمْ) كَالُوهُمْ অর্থাৎ كَالُوا لَهُمْ এবং وَزَنُوهُمْ অর্থাৎ وَوَزَنُوا لَهُمْ যেমন বলা হয় (يَسْمَعُونَكُمْ) অর্থাৎ يَسْمَعُونَ لَكُمْ । নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, ঠিকভাবে মেপে নিবে উসমান (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে বলেছেন, যখন তুমি বিক্রি করবে তখন মেপে দিবে আর যখন ক্রয় করবে তখন মেপে নিবে। ২১২৬. ‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) হতে বর্ণিত যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যে ব্যক্তি খাদ্য ক্রয় করবে, সে তা পুরোপুরি আয়ত্তে না এনে বিক্রি করবে না। (২১২৪, মুসলিম ২১/৮, হাঃ ১৫২৬, আহমাদ ৩৯৬) (আধুনিক প্রকাশনীঃ ১৯৭৮ , ইসলামিক ফাউন্ডেশনঃ ১৯৯৩)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 2127,
			"arabicnumber": 2127,
			"text": "জাবির (রাঃ) হতে বর্ণিত। তিনি বলেন, (আমার পিতা) ‘আবদুল্লাহ ইবনু আমর ইবনু হারাম (রাঃ) ঋণী অবস্থায় মারা যান। পাওনাদারেরা যেন তাঁর কিছু ঋণ ছেড়ে দেয়, এজন্য আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর কাছে সাহায্য চাইলাম। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের কাছে কিছু ঋণ ছেড়ে দিতে বললে, তারা তা করল না। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে বললেন, যাও, তোমার প্রত্যেক ধরনের খেজুরকে আলাদা আলাদা করে রাখ, আজওয়া আলাদা এবং আযকা যায়দ আলাদা করে রাখ। পরে আমাকে খবর দিও। আমি [জাবির (রাঃ)] তা করে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে খবর দিলাম। তিনি এসে খেজুরের (স্তুপ এর) উপরে বা তার মাঝখানে বসলেন। তারপর বললেন, পাওনাদারদের মেপে দাও। আমি তাদের মেপে দিতে লাগলাম, এমনকি তাদের পাওনা পুরোপুরি দিয়ে দিলাম। আর আমার খেজুর এরূপ থেকে গেল, যেন এ হতে কিছুই কমেনি। ফিরাস (রহ.) শা‘বী (রহ.) সূত্রে জাবির (রাঃ) হতে বর্ণনা করেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের এ পর্যন্ত মেপে দিতে থাকলেন যে, তাদের ঋণ পরিশোধ করে দিলেন। হিশাম (রহ.) ওহাব (রহ.) সূত্রে জাবির (রাঃ) হতে বর্ণনা করেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছিলেন গাছ থেকে খেজুর কেটে নাও এবং পুরোপুরি আদায় করে দাও। (২৩৯৫, ২৩৯৬, ২৪০৫, ২৬০১, ২৭০৯, ২৭৮১, ৩৫৮০, ৪০৫৩, ৬২৫০) (আধুনিক প্রকাশনীঃ ১৯৭৯ , ইসলামিক ফাউন্ডেশনঃ ১৯৯৪)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 2128,
			"arabicnumber": 2128,
			"text": "মিকদাম ইবনু মা‘দীকারিব (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেন, তোমরা তোমাদের খাদ্য মেপে নিবে, তাতে তোমাদের জন্য বরকত হবে। (আধুনিক প্রকাশনীঃ ১৯৮০, ইসলামিক ফাউন্ডেশনঃ ১৯৯৫)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 2129,
			"arabicnumber": 2129,
			"text": "فِيهِ عَائِشَةُ عَنْ النَّبِيِّ صلى الله عليه وسلم এ প্রসঙ্গে ‘আয়িশাহ (রাযি.) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে হাদীস বর্ণিত রয়েছে। ২১২৯. ‘আবদুল্লাহ ইবনু যায়দ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, ইবরাহীম (আ.) মক্কা্কে হারাম ঘোষণা করেছেন ও তার জন্য দু‘আ করেছেন। আমি মদিনা্কে হারাম ঘোষণা করেছি, যেমন ইবরাহীম (আ.) মক্কা্কে হারাম ঘোষণা করেছেন এবং আমি মদিনার মুদ ও সা‘ এর জন্য দু‘আ করেছি। যেমন ইবরাহীম (আ.) মক্কার জন্য দু‘আ করেছিলেন। (মুসলিম ১৫/৮৫, হাঃ ১৩৬০, আহমাদ ১৬৪৪৬) (আধুনিক প্রকাশনীঃ ১৯৮১, ইসলামিক ফাউন্ডেশনঃ ১৯৯৬)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 2130,
			"arabicnumber": 2130,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, ইয়া আল্লাহ! আপনি তাদের মাপের পাত্রে বরকত দিন এবং তাদের সা‘ ও মুদ-এ বরকত দিন অর্থাৎ মদিনা্বাসীদের। (৬৪১৪, ৭৩৩১) (আধুনিক প্রকাশনীঃ ১৯৮২ , ইসলামিক ফাউন্ডেশনঃ ১৯৯৭)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 2131,
			"arabicnumber": 2131,
			"text": "‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, যারা অনুমানে (না মেপে) খাদ্য ক্রয় করে নিজের স্থানে পৌঁছানোর আগেই তা বিক্রি করত, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সময়ে আমি দেখেছি যে, তাদেরকে মারা হতো। (২১২৩) (আধুনিক প্রকাশনীঃ ১৯৮৩ , ইসলামিক ফাউন্ডেশনঃ ১৯৯৮)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 2132,
			"arabicnumber": 2132,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খাদ্য (ক্রয় করে) পুরোপুরি আয়ত্বে না এনে বিক্রি করতে নিষেধ করেছেন। [রাবী তাউস (রহ.) বলেন,] আমি ইবনু ‘আব্বাস (রাঃ)-কে জিজ্ঞেস করলাম, এ কিভাবে হয়ে থাকে? তিনি বললেন, এ এভাবে হয়ে থাকে যে, দিরহাম এর বিনিময়ে আদান-প্রদান হয় অথচ পণ্যদ্রব্য অনুপস্থিত থাকে। ইমাম বুখারী (রহ.) বলেন, আয়াতে বর্ণিত(مُرْجَئُونَ) অর্থ যারা আল্লাহর নির্দেশ পালনে বিলম্বিত করে। (২১৩৫, মুসলিম ২১/৮, হাঃ ১৫২৫, আহমাদ ৩৩৪৬) (আধুনিক প্রকাশনীঃ ১৯৮৪ , ইসলামিক ফাউন্ডেশনঃ ১৯৯৯)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 2133,
			"arabicnumber": 2133,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, খাদ্য ক্রয় করে কেউ যেন তা হাতে আসার পূর্বে বিক্রি না করে। (২১২৪) (আধুনিক প্রকাশনীঃ ১৯৮৫ , ইসলামিক ফাউন্ডেশনঃ ২০০০)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 2134,
			"arabicnumber": 2134,
			"text": "মালিক ইবনু আওস (রাঃ) হতে বর্ণিত। তিনি ঘোষণা দিলেন যে, কে সারফ এর বেচা-কেনা (দিরহাম এর বিনিময়ে দ্বীনার এর বেচা-কেনা) করবে? তালহা (রাঃ) বললেন, আমি করব। অবশ্য আমার পক্ষের বিনিময় প্রদানে আমার হিসাবরক্ষক গা’বা (এলাকা) হতে ফিরে আসা পর্যন্ত দেরি হবে। (বর্ণনাকারী) সুফইয়ান (রহ.) বলেন, আমি যুহরী (রহ.) হতে এটুকু মনে রেখেছি, এর হতে বেশী নয়। এরপর যুহরী (রহ.) বলেন, মালিক ইবনু আওস (রাঃ) আমাকে বলেছেন যে, তিনি ‘উমার ইবনু খাত্তাব (রাঃ)-কে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করতে শুনেছেন যে, তিনি বলেছেন, নগদ হাতে হাতে বিনিময় ছাড়া সোনার বদলে সোনা বিক্রি, গমের বদলে গম বিক্রি, খেজুরের বদলে খেজুর বিক্রি, যবের বদলে যব বিক্রি করা সুদ হিসাবে গণ্য। (২১৭০, ২৭৭৪, মুসলিম ২২/১৫, হাঃ ১৫৮৬, আহমাদ ১৬২) (আধুনিক প্রকাশনীঃ ১৯৮৬ , ইসলামিক ফাউন্ডেশনঃ ২০০১)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 2135,
			"arabicnumber": 2135,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যা নিষেধ করেছেন, তা হল অধিকারে আনার পূর্বে খাদ্য বিক্রয় করা। ইবনু ‘আব্বাস (রাঃ) বলেন, আমি মনে করি, প্রত্যেক পণ্যের ব্যাপারে অনুরূপ নির্দেশ প্রযোজ্য হবে। (২১৩২) (আধুনিক প্রকাশনীঃ ১৯৮৭ , ইসলামিক ফাউন্ডেশনঃ ২০০২)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 2136,
			"arabicnumber": 2136,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, খাদ্য ক্রয় করে পুরোপুরি মেপে না নিয়ে। রাবী ‘ইসমাঈল (রহ.) আরো বলেন, খাদ্যদ্রব্য ক্রয় করে নিজের অধিকারে না এনে কেউ যেন তা বিক্রি না করে। (২১২৪) (আধুনিক প্রকাশনীঃ ১৯৮৮ , ইসলামিক ফাউন্ডেশনঃ ২০০৩)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 2137,
			"arabicnumber": 2137,
			"text": "‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সময়ে দেখেছি যে, লোকেরা খাদ্য আনুমানিক পরিমাণের ভিত্তিতে বেচা-কেনা করত, পরে তা সেখানেই নিজেদের ঘরে তুলে নেয়ার আগেই বিক্রি করলে তাদেরকে শাস্তি দেয়া হতো। (২১২৩) (আধুনিক প্রকাশনীঃ ১৯৮৯, ইসলামিক ফাউন্ডেশনঃ ২০০৪)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 2138,
			"arabicnumber": 2138,
			"text": "وَقَالَ ابْنُ عُمَرَ مَا أَدْرَكَتْ الصَّفْقَةُ حَيًّا مَجْمُوعًا فَهُوَ مِنْ الْمُبْتَاعِ ইবনু ‘উমার (রাঃ) বলেন, যদি বিক্রয়কালে পশু জীবিত ও যথাযথ অবস্থায় থাকে (এবং পরে তার কোন ক্ষতি হয়) তবে তা ক্রেতার মাল নষ্ট হয়েছে বলে গণ্য হবে। ২১৩৮. ‘আয়িশাহ (রাযি.) হতে বর্ণিত। তিনি বলেন, এমন দিন খুব কমই গিয়েছে, যে দিন সকালে বা বিকালে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (আমার পিতা) আবূ বকর (রাঃ)-এর ঘরে আসেননি। যখন তাঁকে (আল্লাহ তা‘আলার পক্ষ হতে) মাদ্বীনার উদ্দেশে বের হওয়ার অনুমতি দেয়া হল, তখন তিনি একদিন দুপুরের সময় আগমন করায় আমরা শঙ্কিত হয়ে পড়লাম। আবূ বকর (রাঃ)-কে এ সংবাদ জানানো হলে তিনি বলে উঠলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বিশেষ কোন ঘটনার কারণেই অসময়ে আগমন করেছেন। যখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম প্রবেশ করলেন তখন তিনি আবূ বকর (রাঃ)-কে বললেন, যারা তোমার কাছে আছে তাদের সরিয়ে দাও। আবূ বকর (রাঃ) বললেন হে আল্লাহর রাসূল! এরা তো আমার দুই কন্যা ‘আয়িশাহ ও আসমা। তিনি বললেন, তুমি কি জান আমাকে তো বের হওয়ার অনুমতি দেয়া হয়েছে? আপনার সফরসঙ্গী হওয়া আমার কাম্য হে আল্লাহর রাসূল! তিনি বললেন, হ্যাঁ, তুমি আমার সফরসঙ্গী হবে। আবূ বকর (রাঃ) বললেন, হে আল্লাহর রাসূল! আমার কাছে দু’টি উটনী রয়েছে, যা আমি হিজরতের জন্য প্রস্তুত রেখেছি। এর একটি আপনি গ্রহণ করুন। তিনি বললেন, আমি মূল্যের বিনিময়ে তা গ্রহণ করলাম। (৪৭৬) (আধুনিক প্রকাশনীঃ ১৯৯০, ইসলামিক ফাউন্ডেশনঃ ২০০৫)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 2139,
			"arabicnumber": 2139,
			"text": "‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) হতে বর্ণিত যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমাদের কেউ যেন তার ভাইয়ের ক্রয়-বিক্রয়ের উপর ক্রয় না করে। (২১৬৫, ৫১৫২, মুসলিম ১৬/৫, হাঃ ১৪১২, আহমাদ ৪৭২২) (আধুনিক প্রকাশনীঃ ১৯৯১ , ইসলামিক ফাউন্ডেশনঃ ২০০৬)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 2140,
			"arabicnumber": 2140,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম গ্রামবাসীর পক্ষে শহরবাসী কর্তৃক বিক্রয় করা হতে নিষেধ করেছেন এবং তোমরা প্রতারণামূলক দালালী করবে না। কোন ব্যক্তি যেন তার ভাইয়ের ক্রয়-বিক্রয়ের উপর ক্রয়-বিক্রয় না করে। [1] কেউ যেন তার ভাইয়ের বিবাহের প্রস্তাবের উপর প্রস্তাব না দেয়। কোন মহিলা যেন তার বোনের (সতীনের) তালাকের দাবী না করে, যাতে সে তার পাত্রে যা কিছু আছে, তা নিজেই নিয়ে নেয়। (অর্থাৎ বর্তমান স্ত্রীর হক নষ্ট করে নিজে তা ভোগ করার জন্য) (২১৪৮, ২১৫০, ২১৫১, ২১৬০, ২১৬২, ২৭২৩, ২৭২৭, ৫১৪৪, ৫১৫২, ৬৬০১, মুসলিম ২১/৪, হাঃ ১৫১৫, আহমাদ ৯৫২৩) (আধুনিক প্রকাশনীঃ ১৯৯২ , ইসলামিক ফাউন্ডেশনঃ ২০০৭)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 2141,
			"arabicnumber": 2141,
			"text": "وَقَالَ عَطَاءٌ أَدْرَكْتُ النَّاسَ لاَ يَرَوْنَ بَأْسًا بِبَيْعِ الْمَغَانِمِ فِيمَنْ يَزِيدُ আতা (রহ.) বলেন, আমি লোকেদের (সাহাবায়ে কিরামকে) দেখেছি যে, তারা গনীমতের মাল অধিক মূল্য দানকারীর কাছে বিক্রি করাতে দোষ মনে করতেন না। ২১৪১. জাবির ইবনু ‘আবদুল্লাহ (রাঃ) হতে বর্ণিত যে, এক ব্যক্তি তার মৃত্যুর পরে তার গোলাম আযাদ হবে বলে ঘোষণা দিল। তারপর সে অভাবগ্রস্ত হয়ে পড়ল। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম গোলামটিকে নিয়ে নিলেন এবং বললেন, কে একে আমার নিকট হতে ক্রয় করবে? নু‘আঈম ইবনু ‘আবদুল্লাহ (রাঃ) (তাঁর কাছ হতে) সেটি এত এত মূল্যে ক্রয় করলেন। তিনি গোলামটি তার হাওয়ালা করে দিলেন। (২২৩০, ২২৩১, ২৪০৩, ২৫১৫, ২৫৩৪, ২৭১৬, ২৯৪৭, ৭১৮৬, মুসলিম ১২/১৩, হাঃ ৯৯৭, আহমাদ ১৪২৭৭) (আধুনিক প্রকাশনীঃ ১৯৯৩, ইসলামিক ফাউন্ডেশনঃ ২০০৮)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 2142,
			"arabicnumber": 2142,
			"text": "وَقَالَ ابْنُ أَبِي أَوْفَى النَّاجِشُ آكِلُ رِبًا خَائِنٌ وَهُوَ خِدَاعٌ بَاطِلٌ لاَ يَحِلُّ قَالَ النَّبِيُّ صلى الله عليه وسلم الْخَدِيعَةُ فِي النَّارِ وَمَنْ عَمِلَ عَمَلاً لَيْسَ عَلَيْهِ أَمْرُنَا فَهُوَ رَدٌّ ইবনু আবূ আওফা (রাঃ) বলেন, দালাল হলো সুদখোর, খিয়ানতকারী। আর দালালী হল প্রতারণা, যা বাতিল ও অবৈধ। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, প্রতারণার ঠিকানা জাহান্নাম। যে এরূপ ‘আমল করে যা আমাদের শরী‘আতের পরিপন্থী; তা পরিত্যাজ্য। ২১৪২. ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম প্রতারণামূলক দালালী হতে নিষেধ করেছেন। (৬৯৬৩, মুসলিম ২১/৪, হাঃ ১৫১৬) (আধুনিক প্রকাশনীঃ ১৯৯৪ , ইসলামিক ফাউন্ডেশনঃ ২০০৯)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 2143,
			"arabicnumber": 2143,
			"text": "‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) হতে বর্ণিত যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম গর্ভস্থিত বাচ্চার গর্ভের প্রসবের মেয়াদের উপর বিক্রি নিষেধ করেছেন। এ এক ধরনের বিক্রয়, যা জাহিলিয়াতের যুগে প্রচলিত ছিল। কেউ এ শর্তে উটনী ক্রয় করত যে, এই উটনীটি প্রসব করবে পরে ঐ শাবক তার গর্ভ প্রসব করার পর তার মূল্য দেয়া হবে। (২২৫৬, ৩৮৪৩, মুসলিম ২১/৩, হাঃ ১৫১৪, আহমাদ ৫৫১১) (আধুনিক প্রকাশনীঃ ১৯৯৫, ইসলামিক ফাউন্ডেশনঃ ২০১০)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 2144,
			"arabicnumber": 2144,
			"text": "وَقَالَ أَنَسٌ نَهَى عَنْهُ النَّبِيُّ صلى الله عليه وسلم আনাস (রাঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এরূপ বেচা-কেনা হতে নিষেধ করেছেন। ২১৪৪. আবূ সা‘ঈদ খুদরী (রাঃ) হতে বর্ণিত। তিনি বর্ণনা করেন যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মুনাবাযা পদ্ধতিতে ক্রয়-বিক্রয় নিষেধ করেছেন। তা হল, বিক্রয়ের উদ্দেশে ক্রেতা কাপড়টি উল্টানো পাল্টানো অথবা দেখে নেয়ার আগেই বিক্রেতা কর্তৃক তা ক্রেতার দিকে নিক্ষেপ করা। আর তিনি মুলামাসা পদ্ধতিতে ক্রয়-বিক্রয় করতেও নিষেধ করেছেন। মুলামাসা হল কাপড়টি না দেখে স্পর্শ করা (এতেই বেচা-কেনা সম্পন্ন হয়েছে বলে গণ্য হতো)। (৩৬৭) (আধুনিক প্রকাশনীঃ ১৯৯৬, ইসলামিক ফাউন্ডেশনঃ ২০১১)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 2145,
			"arabicnumber": 2145,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, দুই ধরনের পোশাক পরিধান করা হতে নিষেধ করা হয়েছে। তা হলো একটি কাপড় শরীরে জড়িয়ে তার এক পার্শ্ব কাঁধের উপর তুলে দেয়া এবং দুই ধরনের বেচা-কেনা হতে নিষেধ করা হয়েছে; স্পর্শের এবং নিক্ষেপের বেচা-কেনা। (৩৬৮) (আধুনিক প্রকাশনীঃ ১৯৯৭, ইসলামিক ফাউন্ডেশনঃ ২০১২)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 2146,
			"arabicnumber": 2146,
			"text": "وَقَالَ أَنَسٌ نَهَى عَنْهُ النَّبِيُّ صلى الله عليه وسلم আনাস (রাঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এরূপ ক্রয়-বিক্রয় নিষেধ করেছেন। ২১৪৬. আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম স্পর্শ ও নিক্ষেপের পদ্ধতিতে ক্রয়-বিক্রয় নিষেধ করেছেন। (৩৩৬৮, মুসলিম ২১/১, হাঃ ১৫১১, আহমাদ ৪৫১৬) (আধুনিক প্রকাশনীঃ ১৯৯৮, ইসলামিক ফাউন্ডেশনঃ ২০১০৩)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 2147,
			"arabicnumber": 2147,
			"text": "আবূ সাঈদ (রাঃ) হতে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দু’ ধরনের পোশাক পরিধান এবং স্পর্শ ও নিক্ষেপ এরূপ দু’ধরনের (পদ্ধতিতে) বেচা-কেনা নিষেধ করেছেন। (৩৬৭) (আধুনিক প্রকাশনীঃ ১৯৯৯, ইসলামিক ফাউন্ডেশনঃ ২০১৪)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 2148,
			"arabicnumber": 2148,
			"text": "وَكُلَّ مُحَفَّلَةٍ وَالْمُصَرَّاةُ الَّتِي صُرِّيَ لَبَنُهَا وَحُقِنَ فِيهِ وَجُمِعَ فَلَمْ يُحْلَبْ أَيَّامًا وَأَصْلُ التَّصْرِيَةِ حَبْسُ الْمَاءِ يُقَالُ مِنْهُ صَرَّيْتُ الْمَاءَ إِذَا حَبَسْتَهُ মুসাররাত সে জন্তুকে বলা হয়, যার দুধ কয়েক দিন দোহন না করে আটকিয়ে এবং জমা করে রাখা হয়। তাসরিয়ার মূল অর্থঃ পানি আটকিয়ে রাখা। এ হতে বলা হয় صَرَّيْتُ الْمَاءَ আমি পানি আটকিয়ে রেখেছি বলবে, যখন তুমি পানিকে আটকিয়ে রাখবে। ২১৪৮. আবূ হুরাইরাহ্ (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেন যে, তোমরা উটনী ও বকরীর দুধ (স্তন্যে) আটকিয়ে রেখ না। যে ব্যক্তি এরূপ পশু ক্রয় করে, সে দুধ দোহনের পরে দু’টি অধিকারের যেটি তার পক্ষে ভাল মনে করবে তাই করতে পারবে। যদি সে ইচ্ছা করে তবে ক্রীত পশুটি রেখে দিবে আর যদি ইচ্ছা করে তবে তা ফেরত দিবে এবং এর সাথে এক সা‘ পরিমাণ খেজুর দিবে। আবূ সালিহ্ মুজাহিদ, ওয়ালীদ ইবনু রাবাহ ও মূসা ইবনু ইয়াসার (রহ.) আবূ হুরাইরাহ্ (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এক সা‘ খেজুরের কথা উল্লেখ রয়েছে। কেউ কেউ ইবনু সীরীন (রহ.) সূত্রে এক সা‘ খাদ্যের কথা বলেছেন এবং ক্রেতার জন্য তিন দিনের ইখতিয়ার থাকবে। আর কেউ কেউ ইবনু সীরীন (রহ.) সূত্রে এক সা‘ খেজুরের কথা বলেছেন, তবে তিন দিনের কথা উল্লেখ করেননি। [ইমাম বুখারী (রহ.) বলেন, অধিকাংশের বর্ণনায় খেজুরের উল্লেখ রয়েছে]। (২১৪০) (আধুনিক প্রকাশনীঃ ২০০০, ইসলামিক ফাউন্ডেশনঃ ২০১৫)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 2149,
			"arabicnumber": 2149,
			"text": "‘আবদুল্লাহ ইবনু মাস‘উদ (রাঃ) হতে বর্ণিত। তিনি বলেন, যে ব্যক্তি (স্তন্যে) দুধ আটকিয়ে রাখা বকরী ক্রয় করে তা ফেরত দিতে চায়, সে যেন এর সঙ্গে এক সা‘ পরিমাণ খেজুরও দেয়। আর নবী (পণ্য ক্রয় করার জন্য) বণিক দলের সাথে (শহরে প্রবেশের পূর্বে পথিমধ্যে) সাক্ষাৎ করতে নিষেধ করেছেন। (২১৬৪, মুসলিম ২১/৫, হাঃ ১৫১৮, আহমাদ ৪০৯৬) (আধুনিক প্রকাশনীঃ ২০০১ , ইসলামিক ফাউন্ডেশনঃ ২০১৬)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 2150,
			"arabicnumber": 2150,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমরা (পণ্যবাহী) কাফেলার সাথে (শহরে প্রবেশের পূর্বে) সাক্ষাৎ করবে না তোমাদের কেউ যেন কারো ক্রয়-বিক্রয়ের উপর ক্রয়-বিক্রয় না করে। তোমরা প্রতারণামূলক দালালী করবে না। শহরবাসী তোমাদের কেউ যেন গ্রামবাসীর পক্ষে বিক্রয় না করে। তোমরা বকরীর দুধ আটকিয়ে রাখবে না। যে এরূপ বকরী ক্রয় করবে, সে দুধ দোহনের পরে এ দু’টির মধ্যে যেটি ভাল মনে করবে, তা করতে পারে। সে যদি এতে সন্তুষ্ট হয় তবে বকরী রেখে দিবে, আর যদি সে তা অপছন্দ করে তবে ফেরত দিবে এবং এক সা‘ পরিমাণ খেজুর দিবে। (২১৪০) (আধুনিক প্রকাশনীঃ ২০০২ , ইসলামিক ফাউন্ডেশনঃ ২০১৭)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 2151,
			"arabicnumber": 2151,
			"text": "মুহাম্মাদ ইবনু ‘আমর (রহ.) আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যে ব্যক্তি (স্তনে) দুধ আটকিয়ে রাখা বকরী ক্রয় করে, তবে দোহনের পরে যদি ইচ্ছা করে তবে সেটি রেখে দেবে আর যদি অপছন্দ করে তবে দুহিত দুধের বিনিময়ে এক সা‘ খেজুর দিবে। (২১৪০) (আধুনিক প্রকাশনীঃ ২০০৩, ইসলামিক ফাউন্ডেশনঃ ২০১৮)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 2152,
			"arabicnumber": 2152,
			"text": "وَقَالَ شُرَيْحٌ إِنْ شَاءَ رَدَّ مِنْ الزِّنَا (কাযী) শুরায়হ (রহ.) বলেন, ক্রেতা ইচ্ছা করলে যিনাকার হওয়ার কারণে গোলাম ফিরিয়ে দিতে পারে। ২১৫২. আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যদি বাঁদী ব্যভিচার করে এবং তার ব্যভিচার প্রমাণিত হয়, তবে তাকে বেত্রাঘাত করবে। আর তিরস্কার করবে না। তারপর যদি আবার ব্যভিচার করে তবে তাকে বিক্রি করে দিবে; যদিও পশমের রশির (ন্যায় সামান্য বস্তুর) বিনিময়েও হয়। (২১৫৩, ২২৩৩, ২২৩৪, ২৫৫৫, ৬৮৩৭, ৬৮৩৯, মুসলিম ২৯/৬, হাঃ ১৭০৩, আহমাদ ৭৩৯৯) (আধুনিক প্রকাশনীঃ ২০০৪, ইসলামিক ফাউন্ডেশনঃ ২০১৯)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 2154,
			"arabicnumber": 2154,
			"text": "",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 2155,
			"arabicnumber": 2155,
			"text": "‘আয়িশাহ (রাযি.) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার ঘরে প্রবেশ করলেন তখন আমি তাঁর নিকট (বারীরাহ্ নাম্নী দাসীর ক্রয় সংক্রান্ত ঘটনা) উল্লেখ করলাম। তিনি বললেন, তুমি ক্রয় কর এবং আযাদ করে দাও। কেননা, যে আযাদ করবে ‘ওয়ালা’ [1] (আযাদ সূত্রে উত্তরাধিকার) তারই। তারপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বিকালের দিকে (মসজিদে নাববীতে) দাঁড়িয়ে আল্লাহ তা‘আলার যথাযথ প্রশংসা বর্ণনা করেন তারপর বললেন, লোকদের কী হলো যে, তারা এরূপ শর্তারোপ করে, যা আল্লাহর কিতাবে নেই। কোন ব্যক্তি যদি এমন শর্তারোপ করে, যা আল্লাহর কিতাবে নেই, তা বাতিল, যদিও সে শত শত শর্তারোপ করে। আল্লাহর শর্তই সঠিক ও সুদৃঢ়। (৪৫৬) (আধুনিক প্রকাশনীঃ ২০০৬ , ইসলামিক ফাউন্ডেশনঃ ২০২১)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 2156,
			"arabicnumber": 2156,
			"text": "‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) হতে বর্ণিত যে, ‘আয়িশাহ (রাযি.) বারীরার দরদাম করেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সালাতের উদ্দেশে বের হয়ে যান। যখন ফিরে আসেন তখন ‘আয়িশাহ (রাযি.) তাঁকে বললেন যে, তারা (মালিক পক্ষ) ওয়ালা এর শর্ত ছাড়া বিক্রি করতে রাযী নয়। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, ওয়ালা তো তারই, যে আযাদ করে। রাবী হাম্মাম (রহ.) বলেন, আমি নাফি (রহ.)-কে জিজ্ঞেস করলাম, বারীরার স্বামী আযাদ ছিল, না দাস? তিনি বললেন, আমি কি করে জানব? (২১৬৯, ২৫৬২, ৬৭৫২, ৬৭৫৭, ৬৭৫৯) (আধুনিক প্রকাশনীঃ ২০০৭ , ইসলামিক ফাউন্ডেশনঃ ২০২২)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 2157,
			"arabicnumber": 2157,
			"text": "وَقَالَ النَّبِيُّ إِذَا اسْتَنْصَحَ أَحَدُكُمْ أَخَاهُ فَلْيَنْصَحْ لَهُ وَرَخَّصَ فِيهِ عَطَاءٌ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যখন তোমাদের কেউ তার ভাইয়ের সাহায্য কামনা করে তখন সে যেন তার উপকার করে। এ বিষয়ে আতা (রহ.) অনুমতি প্রদান করেছেন। ২১৫৭. জারীর (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর হাতে লা ইলাহা ইল্লাল্লাহু ওয়া আন্না মুহাম্মাদার রাসূলুল্লাহ- এ কথার সাক্ষ্য দেয়ার, সালাত কায়িম করার, যাকাত দেয়ার, আমীরের কথা শুনার ও মেনে চলার এবং প্রত্যেক মুসলিমের হিত কামনা করার উপর বায়‘আত করেছিলাম। (৫৭) (আধুনিক প্রকাশনীঃ ২০০৮ , ইসলামিক ফাউন্ডেশনঃ ২০২৩)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 2158,
			"arabicnumber": 2158,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমরা পণ্যবাহী কাফেলার সাথে (শহরে প্রবেশের পূর্বে সস্তায় পণ্য খরিদের উদ্দেশে) সাক্ষাৎ করবে না এবং শহরবাসী যেন গ্রামবাসীর পক্ষে বিক্রয় না করে। রাবী তাউস (রহ.) বলেন, আমি ইবনু ‘আব্বাস (রাঃ)-কে জিজ্ঞেস করলাম, শহরবাসী যেন গ্রামবাসীর পক্ষে বিক্রয় না করে, তাঁর এ কথার অর্থ কী? তিনি বললেন, তার হয়ে যেন সে প্রতারণামূলক দালালী না করে। (২১৬৩, ২২৭৪, মুসলিম ২১/৬, হাঃ ১৫২১) (আধুনিক প্রকাশনীঃ ২০০৯, ইসলামিক ফাউন্ডেশনঃ ২০২৪)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 2159,
			"arabicnumber": 2159,
			"text": "‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, গ্রামবাসীর পক্ষে শহরবাসীর বিক্রয় আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিষেধ করেছেন। ইবনু ‘আব্বাস (রাঃ)-ও অনুরূপ কথাই বলেছেন। (আধুনিক প্রকাশনীঃ ২০১০, ইসলামিক ফাউন্ডেশনঃ ২০২৫)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 2160,
			"arabicnumber": 2160,
			"text": "وَكَرِهَهُ ابْنُ سِيرِينَ وَإِبْرَاهِيمُ لِلْبَائِعِ وَالْمُشْتَرِي وَقَالَ إِبْرَاهِيمُ إِنَّ الْعَرَبَ تَقُولُ بِعْ لِي ثَوْبًا وَهِيَ تَعْنِي الشِّرَاءَ ইবনু সীরীন ও ইবরাহীম (নাখয়ী) (রহ.) ক্রেতা-বিক্রেতা উভয়ের জন্য তা নাজায়িয বলেছেন। ইবরাহীম (রহ.) বলেন, আরববাসী বলে, بِعْ لِي ثَوْبًا তারা এর অর্থ গ্রহণ করে ক্রয় করার অর্থাৎ আমাকে একটি কাপড় ক্রয় করে দাও। ২১৬০. আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, কেউ যেন তার ভাইয়ের কেনা-বেচার উপরে ক্রয় না করে। আর তোমরা প্রতারণামূলক দালালী করবে না[1] এবং শহরবাসী যেন গ্রামবাসীর পক্ষে বিক্রি না করে। (২১৪০) (আধুনিক প্রকাশনীঃ ২০১১, ইসলামিক ফাউন্ডেশনঃ ২০২৬)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 2161,
			"arabicnumber": 2161,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। তিনি বলেন, গ্রামবাসীর পক্ষে শহরবাসীর বিক্রি করা হতে আমাদেরকে নিষেধ করা হয়েছে। (আধুনিক প্রকাশনীঃ ২০১২, ইসলামিক ফাউন্ডেশনঃ ২০২৭)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 2162,
			"arabicnumber": 2162,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, শহরে প্রবেশের পূর্বে বণিক দলের সঙ্গে সাক্ষাৎ করা এবং গ্রামবাসীর পক্ষে শহরবাসীর বিক্রি করা হতে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিষেধ করেছেন। (২১৪০) (আধুনিক প্রকাশনীঃ ২০১৩, ইসলামিক ফাউন্ডেশনঃ ২০২৮)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 2163,
			"arabicnumber": 2163,
			"text": "তাউস (রহ.) হতে বর্ণিত। তিনি বলেন, আমি ইবনু ‘আব্বাস (রাঃ)-কে গ্রামবাসীর পক্ষে শহরবাসী বিক্রয় করবে না, এ উক্তির অর্থ কী, তা জিজ্ঞেস করলাম। তিনি বললেন, তার পক্ষে দালালী করবে না। (২১৫৮) (আধুনিক প্রকাশনীঃ ২০১৪, ইসলামিক ফাউন্ডেশনঃ ২০২৯)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 2164,
			"arabicnumber": 2164,
			"text": "‘আবদুল্লাহ (ইবনু মাস‘ঊদ) (রাঃ) হতে বর্ণিত। তিনি বলেন, যে ব্যক্তি স্তনে দুধ আটকিয়ে রাখা (বকরী-গাভী) উটনী ক্রয় করে (তা ফেরত দিলে) সে যেন তার সাথে এক সা‘ (খেজুরও) ফেরত দেয়। তিনি আরো বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বণিক দলের সাথে (শহরে প্রবেশের পূর্বে) সাক্ষাৎ করতে নিষেধ করেছেন। (২১৪৯) (আধুনিক প্রকাশনীঃ ২০১৫, ইসলামিক ফাউন্ডেশনঃ ২০৩০)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 2165,
			"arabicnumber": 2165,
			"text": "‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) হতে বর্ণিত যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, তোমাদের কেউ কারো ক্রয়-বিক্রয়ের উপর যেন ক্রয়-বিক্রয় না করে এবং তোমরা পণ্য ক্রয় করো না তা বাজারে হাজির না করা পর্যন্ত। (২১৩৯) (আধুনিক প্রকাশনীঃ ২০১৬, ইসলামিক ফাউন্ডেশনঃ ২০৩১)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 2166,
			"arabicnumber": 2166,
			"text": "‘আবদুল্লাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমরা বণিক দলের সঙ্গে সাক্ষাৎ করে তাদের হতে খাদ্য ক্রয় করতাম। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খাদ্যের বাজারে পৌঁছানোর পূর্বে আমাদের তা ক্রয় করতে নিষেধ করেছেন। আবূ ‘আবদুল্লাহ (বুখারী) (রহ.) বলেন, তা হল বাজারের প্রান্ত সীমা। ‘উবায়দুল্লাহ (রহ.)-এর হাদীসে এ বর্ণনা রয়েছে। (২১২৩) (আধুনিক প্রকাশনীঃ ২০১৭, ইসলামিক ফাউন্ডেশনঃ ২০৩২)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 2167,
			"arabicnumber": 2167,
			"text": "‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, লোকেরা বাজারের প্রান্ত সীমায় খাদ্য ক্রয় করে সেখানেই বিক্রি করে দিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম স্থানান্তর না করে সেখানেই বিক্রি করতে তাদের নিষেধ করেছেন। (২১২৩) (আধুনিক প্রকাশনীঃ ২০১৮, ইসলামিক ফাউন্ডেশনঃ ২০৩৩)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 2168,
			"arabicnumber": 2168,
			"text": "‘আয়িশাহ (রাযি.) হতে বর্ণিত। তিনি বলেন, বারীরাহ্ (রাযি.) আমার কাছে এসে বলল, আমি আমার মালিক পক্ষের সাথে নয় উকিয়া দেয়ার শর্তে মুকাতাবা[1] করেছি- প্রতি বছর যা হতে এক উকিয়া করে দেয়া হবে। আপনি (এ ব্যাপারে) আমাকে সাহায্য করুন। আমি বললাম, যদি তোমার মালিক পক্ষ পছন্দ করে যে, আমি তাদের একবারেই তা পরিশোধ করব এবং তোমার ওয়ালা-এর অধিকার আমার হবে, তবে আমি তা করব। তখন বারীরাহ্ (রাযি.) তার মালিকদের নিকট গেল এবং তাদের তা বলল। তারা তা অস্বীকার করল। বারীরাহ্ (রাযি.) তাদের নিকট হতে (আমার কাছে) এল। আর তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সেখানে উপস্থিত ছিলেন। সে বলল, আমি (আপনার) সে কথা তাদের কাছে পেশ করেছিলাম। কিন্তু তারা নিজেদের জন্য ওয়ালার অধিকার সংরক্ষণ ছাড়া রাযী হয়নি। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তা শুনলেন, ‘আয়িশাহ (রাযি.) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে তা সবিস্তারে জানালেন। তিনি বললেন, তুমি তাকে নিয়ে নাও এবং তাদের জন্য ওয়ালার শর্ত মেনে নাও। কেননা, ওয়ালা এর হক তারই, যে আযাদ করে। ‘আয়িশাহ (রাযি.) তাই করলেন। এরপর আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জনসমক্ষে দাঁড়িয়ে আল্লাহর হাম্দ ও সানা বর্ণনা করলেন। তারপর বললেন, লোকদের কী হলো যে, তারা এমন শর্তারোপ করে যা আল্লাহর বিধানে নেই। আল্লাহর বিধানে যে শর্তের উল্লেখ নেই, তা বাতিল বলে গণ্য হবে, শত শর্ত হলেও। আল্লাহর ফায়সালাই সঠিক, আল্লাহর শর্তই সুদৃঢ়। ওয়ালার হাক্ব তো তারই, যে মুক্ত করে। (৪৫৬) (আধুনিক প্রকাশনীঃ ২০১৯, ইসলামিক ফাউন্ডেশনঃ ২০৩৪)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 2169,
			"arabicnumber": 2169,
			"text": "‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) হতে বর্ণিত যে, উম্মুল মু’মিনীন ‘আয়িশাহ (রাযি.) একটি দাসী ক্রয় করে তাকে আযাদ করার ইচ্ছা করেন। দাসীটির মালিক পক্ষ বলল, দাসীটি এ শর্তে বিক্রি করব যে, তার ওয়ালার হক আমাদের থাকবে। তিনি এ কথা আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর কাছে উল্লেখ করলেন। তিনি বললেন, এতে তোমার বাধা হবে না। কেননা, ওয়ালা তারই, যে মুক্ত করে। (২১৫৬) (আধুনিক প্রকাশনীঃ ২০২০, ইসলামিক ফাউন্ডেশনঃ ২০৩৫)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 2170,
			"arabicnumber": 2170,
			"text": "‘উমার (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, হাতে হাতে (নগদ নগদ) ছাড়া গমের বদলে গম বিক্রি করা সুদ, নগদ নগদ ছাড়া যবের বদলে যব বিক্রয় সুদ, নগদ নগদ ব্যতীত খেজুরের বিনিময়ে খেজুর বিক্রয় সুদ। (২১৩৪) (আধুনিক প্রকাশনীঃ ২০২১, ইসলামিক ফাউন্ডেশনঃ ২০৩৬)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 2171,
			"arabicnumber": 2171,
			"text": "‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) হতে বর্ণিত যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মুযাবানা নিষেধ করেছেন। তিনি (ইবনু ‘উমার) বলেন, মুযাবানা হলো তাজা খেজুর শুকনো খেজুরের বদলে ওজন করে বিক্রি করা এবং কিসমিস তাজা আঙ্গুরের বদলে ওজন করে বিক্রি করা। (২১৭২, ২১৭৫, ২২০৫, মুসলিম ২১/১৪, হাঃ ১৫৪২, আহমাদ ৪৫২৮) (আধুনিক প্রকাশনীঃ ২০২২, ইসলামিক ফাউন্ডেশনঃ ২০৩৭)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 2173,
			"arabicnumber": 2173,
			"text": "",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 2174,
			"arabicnumber": 2174,
			"text": "মালিক ইবনু আওস (রাঃ) হতে বর্ণনা করেছেন যে, তিনি একশ’ দ্বীনারের বিনিময় সারফ এর জন্য লোক সন্ধান করছিলেন। তখন তালহা ইবনু ‘উবাইদুল্লাহ (রাঃ) আমাকে ডাক দিলেন। আমরা বিনিময় দ্রব্যের পরিমাণ নিয়ে আলোচনা করতে থাকলাম। অবশেষে তিনি আমার সঙ্গে সারফ [1] করতে রাজী হলেন এবং আমার হতে স্বর্ণ নিয়ে তার হাতে নাড়া-চাড়া করতে করতে বললেন, আমার খাযাঞ্চী গাবা (নামক স্থান) হতে আসা পর্যন্ত (আমার জিনিস পেতে) দেরী করতে হবে। ঐ সময়ে ‘উমার (রাঃ) আমাদের কথা-বার্তা শুনছিলেন। তিনি বলে উঠলেন, আল্লাহর কসম! তার জিনিস গ্রহণ না করা পর্যন্ত তুমি তার হতে বিচ্ছিন্ন হতে পারবে না। কারণ, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, নগদ নগদ না হলে স্বর্ণের বদলে স্বর্ণের বিক্রয় (সুদ) হবে। নগদ নগদ ছাড়া গমের বদলে গমের বিক্রয় সুদ হবে। নগদ নগদ ছাড়া যবের বদলে যবের বিক্রয় রিবা হবে। নগদ নগদ না হলে খেজুরের বদলে খেজুরের বিক্রয় সুদ হবে। (২১৩৪) (আধুনিক প্রকাশনীঃ ২০২৪, ইসলামিক ফাউন্ডেশনঃ ২০৩৯)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 2175,
			"arabicnumber": 2175,
			"text": "আবূ বাকর (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, সমান সমান ছাড়া তোমরা সোনার বদলে সোনা বিক্রয় করবে না। অনুরূপ রূপার বদলে রূপা সমান সমান ছাড়া (বিক্রি করবে না)। রূপার বদলে সোনা এবং সোনার বদলে রূপা যেভাবে ইচ্ছে, কেনা বেচা করতে পার। (২১৮২, মুসলিম ২২/১৬, হাঃ ১৫৯০, আহমাদ ২০৪১৭) (আধুনিক প্রকাশনীঃ ২০২৫ , ইসলামিক ফাউন্ডেশনঃ ২০৪০)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 2176,
			"arabicnumber": 2176,
			"text": "‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) হতে বর্ণিত যে, আবূ সা‘ঈদ খুদরী (রাঃ) আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে (আবূ বাকরার হাদীসের) অনুরূপ একটি হাদীস তাঁর কাছে বর্ণনা করেন। ‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) তাঁর [আবূ সাঈদ (রাঃ)-এর] সঙ্গে দেখা করে বললেন, হে আবূ সাঈদ! আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে আপনি কী হাদীস বর্ণনা করে থাকেন? আবূ সাঈদ (রাঃ) সার্ফ (মুদ্রার বিনিময়) সম্পর্কে বললেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে আমি বলতে শুনেছি যে, সোনার বদলে সোনার বিক্রয় সমান পরিমাণ হতে হবে। রূপার বদলে রূপার বিক্রয় সমান হতে হবে। (২১৭৭, ২১৭৮, মুসলিম ২২/১৪, হাঃ ১৫৮৪, আহমাদ ১১৭০০) (আধুনিক প্রকাশনীঃ ২০২৬, ইসলামিক ফাউন্ডেশনঃ ২০৪১)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 2177,
			"arabicnumber": 2177,
			"text": "আবূ সাঈদ খুদরী (রাঃ) হতে বর্ণিত যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, সমান পরিমাণ ছাড়া তোমরা সোনার বদলে সোনা বিক্রি করবে না, একটি অপরটি হতে কম-বেশী করবে না। সমান ছাড়া তোমরা রূপার বদলে রূপা বিক্রি করবে না ও একটি অপরটি হতে কম-বেশী করবে না। আর নগদ মুদ্রার বিনিময়ে বাকী মুদ্রা বিক্রি করবে না। (২১৭৬, মুসলিম ২২/১৪, হাঃ ১৫৮৪, আহমাদ ১১৪৯৪) (আধুনিক প্রকাশনীঃ ২০২৭, ইসলামিক ফাউন্ডেশনঃ ২০৪২)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 2179,
			"arabicnumber": 2179,
			"text": "",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 2181,
			"arabicnumber": 2181,
			"text": "",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 2182,
			"arabicnumber": 2182,
			"text": "আবূ বাকরা (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সমান সমান ছাড়া রূপার বদলে রূপার ক্রয়-বিক্রয় এবং সোনার বদলে সোনার ক্রয়-বিক্রয় করতে নিষেধ করেছেন এবং তিনি রূপার বিনিময়ে সোনার বিক্রয়ে এবং সোনার বিনিময়ে রূপার বিক্রয়ে আমাদের ইচ্ছা অনুযায়ী অনুমতি দিয়েছেন। (২১৭৫) (আধুনিক প্রকাশনীঃ ২০৩০, ইসলামিক ফাউন্ডেশনঃ ২০৪৫)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 2184,
			"arabicnumber": 2184,
			"text": "",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 2185,
			"arabicnumber": 2185,
			"text": "‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) হতে বর্ণিত যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মুযাবানা হতে নিষেধ করেছেন। মুযাবানার অর্থ হলো মেপে শুকনো খেজুরের বিনিময়ে তাজা খেজুর এবং মেপে কিসমিসের বিনিময়ে আঙ্গুর ক্রয় করা। (২১৭১, মুসলিম ২১/১৪, হাঃ ১৫৩৯) (আধুনিক প্রকাশনীঃ ২০৩২, ইসলামিক ফাউন্ডেশনঃ ২০৪৭)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 2186,
			"arabicnumber": 2186,
			"text": "আবূ সাঈদ খুদরী (রাঃ) হতে বর্ণিত যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মুযাবানা ও মুহাকালা বারণ করেছেন। মুযাবানার অর্থ- শুকনো খেজুরের বিনিময়ে গাছের মাথায় অবস্থিত তাজা খেজুর ক্রয় করা। (মুসলিম ২১/১৭, হাঃ ১৫৪৬, আহমাদ ১১৫৭৭) (আধুনিক প্রকাশনীঃ ২০৩৩, ইসলামিক ফাউন্ডেশনঃ ২০৪৮)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 2187,
			"arabicnumber": 2187,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মুহাকালা ও মুযাবানা নিষেধ করেছেন। (আধুনিক প্রকাশনীঃ ২০৩৪, ইসলামিক ফাউন্ডেশনঃ ২০৪৯)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 2188,
			"arabicnumber": 2188,
			"text": "যায়দ ইবনু সাবিত (রাঃ) হতে বর্ণিত যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আরিয়্যা এর মালিককে তা অনুমানে বিক্রি করার অনুমতি প্রদান করেছেন। (২১৭৩) (আধুনিক প্রকাশনীঃ ২০৩৫, ইসলামিক ফাউন্ডেশনঃ ২০৫০)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 2189,
			"arabicnumber": 2189,
			"text": "জাবির (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উপযোগী হওয়ার আগে ফল বিক্রি করতে নিষেধ করেছেন। (এবং এ-ও বলেছেন যে,) এর কিছুই দ্বীনার ও দিরহাম এর বিনিময় ব্যতীত বিক্রি করা যাবে না, তবে আরায়্যার হুকুম এর ব্যতিক্রম। (১৪৮৭, মুসলিম ২১/১৩, হাঃ ১৫৩৬, আহমাদ ১৪৩৫৬) (আধুনিক প্রকাশনীঃ ২০৩৬, ইসলামিক ফাউন্ডেশনঃ ২০৫১)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 2190,
			"arabicnumber": 2190,
			"text": "‘আবদুল্লাহ ইবনু আবদুল ওহহাব (রহ.) বলেন যে, আমি মালিকের কাছে শুনেছি, উবায়দুল্লাহ ইবনু রাবী‘ (রহ.) তাঁকে জিজ্ঞেস করলেন, আবূ সুফিয়ান (রাঃ) সূত্রে আবূ হুরাইরাহ্ (রাঃ) হতে দাঊদ (রহ.) এই হাদীস কি আপনার কাছে বর্ণনা করেছেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পাঁচ ওসাক অথবা পাঁচ ওসাকের কম পরিমাণে আরিয়্যা বিক্রয়ের অনুমতি দিয়েছেন? তিনি বললেন, হ্যাঁ। (২৩৮২, মুসলিম ২১/১৪, হাঃ ১৫৪১) (আধুনিক প্রকাশনীঃ ২০৩৭, ইসলামিক ফাউন্ডেশনঃ ২০৫২)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 2191,
			"arabicnumber": 2191,
			"text": "সাহল ইবনু আবূ হাসমা (রাঃ) হতে বর্ণিত যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম শুকনো খেজুরের বিনিময়ে তাজা খেজুর বিক্রি করতে বারণ করেছেন এবং আরিয়্যা-এর ক্ষেত্রে অনুমতি প্রদান করেছেন। তা হল তাজা ফল অনুমানে বিক্রি করা, যাতে (ক্রেতা) তাজা খেজুর খাওয়ার সুযোগ লাভ করতে পারে। রাবী সুফইয়ান (রহ.) আর একবার এভাবে বর্ণনা করেছেন, অবশ্য তিনি [আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ] আরিয়্যা এর ক্ষেত্রে অনুমতি দিয়েছেন যে, ফলের মালিক অনুমানে তাজা খেজুর বিক্রয় করে, যাতে তারা (ক্রেতাগণ) তাজা খেজুর খেতে পারে। রাবী বলেন, এ কথা পূর্বের কথা একই এবং সুফইয়ান (রহ.) বলেন, আমি তরুণ বয়সে (আমার উস্তাদ) ইয়াহইয়া [ইবনু সাইদ (রহ.)]-কে বললাম, মক্কাবাসীগণ তো বলে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আরায়্যা-এর ক্রয়-বিক্রয়ের অনুমতি দিয়েছেন। তিনি বললেন, মক্কাবাসীদের তা কিসে অবহিত করল? আমি বললাম, তারা জাবির (রাঃ) হতে বর্ণনা করে থাকেন। এতে তিনি নীরব হয়ে গেলেন। সুফইয়ান (রহ.) বলেন, আমার কথার মর্ম এই ছিল যে, জাবির (রাঃ) মদিনাবাসী। সুফইয়ান (রহ.)-কে জিজ্ঞেস করা হল, এ হাদীসে এ কথাটুকু নাই যে, উপযোগিতা প্রকাশের পূর্বে ফল বিক্রি নিষিদ্ধ করেছেন। তিনি বলেন, না। (২৩৮৪, মুসলিম ২১/১৪, হাঃ ১৫৪০, আহমাদ ১৬০৯২) (আধুনিক প্রকাশনীঃ ২০৩৮, ইসলামিক ফাউন্ডেশনঃ ২০৫৩)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 2192,
			"arabicnumber": 2192,
			"text": "وَقَالَ مَالِكٌ الْعَرِيَّةُ أَنْ يُعْرِيَ الرَّجُلُ الرَّجُلَ النَّخْلَةَ ثُمَّ يَتَأَذَّى بِدُخُولِهِ عَلَيْهِ فَرُخِّصَ لَهُ أَنْ يَشْتَرِيَهَا مِنْهُ بِتَمْرٍ وَقَالَ ابْنُ إِدْرِيسَ الْعَرِيَّةُ لاَ تَكُونُ إِلاَّ بِالْكَيْلِ مِنْ التَّمْرِ يَدًا بِيَدٍ لاَ يَكُونُ بِالْجِزَافِ وَمِمَّا يُقَوِّيهِ قَوْلُ سَهْلِ بْنِ أَبِي حَثْمَةَ بِالأوْسُقِ الْمُوَسَّقَةِ وَقَالَ ابْنُ إِسْحَاقَ فِي حَدِيثِهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ كَانَتْ الْعَرَايَا أَنْ يُعْرِيَ الرَّجُلُ فِي مَالِهِ النَّخْلَةَ وَالنَّخْلَتَيْنِ وَقَالَ يَزِيدُ عَنْ سُفْيَانَ بْنِ حُسَيْنٍ الْعَرَايَا نَخْلٌ كَانَتْ تُوهَبُ لِلْمَسَاكِينِ فَلاَ يَسْتَطِيعُونَ أَنْ يَنْتَظِرُوا بِهَا رُخِّصَ لَهُمْ أَنْ يَبِيعُوهَا بِمَا شَاءُوا مِنْ التَّمْرِ (ইমাম) মালিক (রহ.) বলেন, আরায়্যা এর অর্থ- কোন একজন কর্তৃক কাউকে খেজুর গাছ (তার ফল খাওয়ার জন্য) দান করা। পরে ঐ ব্যক্তির বাগানে প্রবেশের কারণে সে বিরক্তি বোধ করে, ফলে তাকে অনুমতি দেয়া হয় যে, সে শুকনো ফলের বিনিময়ে গাছগুলো (এর ফল) ঐ ব্যক্তির নিকট হতে ক্রয় করে নিবে। মুহাম্মাদ ইবনু ইদরীস [ইমাম শাফিঈ (রহ.)] বলেন, শুকনো খেজুর এর বিক্রি নগদ নগদ এবং মাপের মাধ্যমে হবে, অনুমান করে হবে না। (ইমাম বুখারী (রহ.) বলেন, ইমাম শাফিঈ (রহ.) এর মতের সমর্থন পাওয়া যায় সাহাল ইবনু আবূ হাসমা (রাঃ)-এর এ কথা থেকে ‘‘সুনির্দিষ্ট মাপের মাধ্যমে’’। নাফি‘ (রহ.)-এর সূত্রে ইবনু ‘উমার (রাঃ) হতে বর্ণনা করেন যে, মালিক কর্তৃক তার বাগান হতে একটি বা দুটি খেজুর গাছ দান করাকে আরাইয়া বলা হয়। সুফিয়ান ইবনু হুসাইন (রহ.) ইয়াযীদ (রহ.) হতে বর্ণনা করেন যে, আরাইয়া হলো কিছু সংখ্যক খেজুর গাছ গরীব মিসকীনদের দান করা হত, কিন্তু তারা খেজুর পাকা পর্যন্ত অপেক্ষা করতে পারত না বিধায় তাদের অনুমতি দেয়া হতো যে, তারা যে পরিমাণ খেজুরের ইচ্ছা, তা বিক্রি করে দিবে। ২১৯২. যায়দ ইবনু সাবিত (রাঃ) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আরাইয়ার ব্যাপারে অনুমতি দিয়েছেন যে, ওযনকৃত খেজুরের বিনিময়ে গাছের অনুমানকৃত খেজুর বিক্রি করা যেতে পারে। মূসা ইবনু ‘উকবা (রহ.) বলেন, আরাইয়া বলা হয়, বাগানে এসে কতগুলো নির্দিষ্ট গাছের খেজুর (শুকনা খেজুরের বদলে) ক্রয় করে নেয়া। (২১৭৩) (আধুনিক প্রকাশনীঃ ২০৩৯, ইসলামিক ফাউন্ডেশনঃ ২০৫৪)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 2193,
			"arabicnumber": 2193,
			"text": "লাইস (রহ.) ... যাইদ ইবনু সাবিত (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সময়ে লোকেরা (গাছের) ফলের বেচা-কেনা করত। আবার যখন লোকদের ফল পাড়ার এবং তাদের মূল্য দেয়ার সময় হত, তখন ক্রেতা ফলে পোকা ধরেছে, নষ্ট হয়ে গিয়েছে, শুকিয়ে গিয়েছে এসব অনিষ্টকারী আপদের কথা উল্লেখ করে ঝগড়া করত। তখন এ ব্যাপারে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকটে অনেক অভিযোগ পেশ হতে লাগল, তখন তিনি বললেন, তোমরা যদি এ ধরনের বেচা কেনা বাদ দিতে না চাও তবে ফলের উপযোগিতা প্রকাশ পাবার পর তার বেচা কেনা করবে। অনেক অভিযোগ উত্থাপিত হবার কারণে তিনি এ কথাটি পরামর্শ স্বরূপ বলেছেন। রাবী বলেন, খারিজা ইবনু যায়দ (রহ.) আমাকে বলেছেন যে, যাইদ ইবনু সাবিত (রাঃ) সুরাইয়া তারকা উদিত হবার পর ফলের হলুদ ও লালচে রঙের পূর্ণ প্রকাশ না হওয়া পর্যন্ত তাঁর বাগানের ফল বিক্রি করতেন না। আবূ ‘আবদুল্লাহ (ইমাম বুখারী (রহ.) বলেন, আলী ইবনু বাহর (রহ.) যায়দ (রাঃ) হতে এ হাদীস বর্ণনা করেছেন। (আধুনিক প্রকাশনীঃ কিতাবুল বুয়ু‘ অনুচ্ছেদ ৮৫, ইসলামিক ফাউন্ডেশনঃ অনুচ্ছেদ ১৩৬১)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 2194,
			"arabicnumber": 2194,
			"text": "‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) হতে বর্ণিত যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফলের উপযোগিতা প্রকাশ হওয়ার আগে তা বিক্রি করতে ক্রেতা ও বিক্রেতাকে নিষেধ করেছেন। (১৪৮৬, মুসলিম ২১/১৩, হাঃ ১৫৩৪, আহমাদ ৪৫২৫) (আধুনিক প্রকাশনীঃ ২০৪০, ইসলামিক ফাউন্ডেশনঃ ২০৫৫)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 2195,
			"arabicnumber": 2195,
			"text": "আনাস ইবনু মালিক (রহ.) হতে বর্ণিত যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খেজুর ফল পোখতা হওয়ার আগে বিক্রি করতে নিষেধ করেছেন। আবূ ‘আবদুল্লাহ [ইমাম বুখারী (রহ.)] বলেন, অর্থাৎ লালচে হওয়ার আগে। (১৪৮৮) (আধুনিক প্রকাশনীঃ ২০৪১, ইসলামিক ফাউন্ডেশনঃ ২০৫৬)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 2196,
			"arabicnumber": 2196,
			"text": "জাবির ইবনু ‘আবদুল্লাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফলের রং পরিবর্তন না হওয়া পর্যন্ত বিক্রি করতে নিষেধ করেছেন। রাবী বলেন, অর্থাৎ লালচে বর্ণের বা হলুদ বর্ণের না হওয়া পর্যন্ত এবং তা খাওয়ার যোগ্য না হওয়া পর্যন্ত। (১৪৮৭) (আধুনিক প্রকাশনীঃ ২০৪২, ইসলামিক ফাউন্ডেশনঃ ২০৫৭)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 2197,
			"arabicnumber": 2197,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফলের উপযোগিতা প্রকাশ হওয়ার আগে তা বিক্রি করতে নিষেধ করেছেন এবং খেজুরের রং ধরার আগে (বিক্রি করতে নিষেধ করেছেন)। জিজ্ঞেস করা হল, রং ধরার অর্থ কী? তিনি বলেন, লাল বর্ণ বা হলুদ বর্ণ ধারণ করা। আবূ ‘আবদুল্লাহ [ইমাম বুখারী (রহ.)] বলেন, আমি মু‘আল্লা ইবনু মানসূর (রহ.) হতে হাদীস লিপিবদ্ধ করেছি। কিন্তু এ হাদীস তাঁর নিকট হতে লিখিনি। (১৪৮৮) (আধুনিক প্রকাশনীঃ ২০৪৩, ইসলামিক ফাউন্ডেশনঃ ২০৫৮)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 2198,
			"arabicnumber": 2198,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রং ধারণ করার আগে ফল বিক্রি করতে নিষেধ করেছেন। জিজ্ঞেস করা হল, রং ধারণ করার অর্থ কী? তিনি বললেন, লাল বর্ণ ধারণ করা। পরে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, দেখ, যদি আল্লাহ তা‘আলা ফল ধরা বন্ধ করে দেন, তবে তোমাদের কেউ (বিক্রেতা) কিসের বদলে তার ভাইয়ের মাল (ফলের মূল্য) নিবে? (১৪৮৮, মুসলিম ২২/৩, হাঃ ১৫৫৫, আহমাদ ১২১৩৯) (আধুনিক প্রকাশনীঃ ২০৪৪, ইসলামিক ফাউন্ডেশনঃ ২০৫৯)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 2199,
			"arabicnumber": 2199,
			"text": "ইবনু শিহাব (রহ.) হতে বর্ণিত। তিনি বলেন, কোন ব্যক্তি যদি ফলের উপযুক্ততা প্রকাশের পূর্বে তা ক্রয় করে, পরে তাতে মড়ক দেখা দেয়, তবে যা নষ্ট হবে তা মালিকের উপর বর্তাবে। [যুহরী (রহ.)] বলেন, আমার নিকট সালিম ইবনু ‘আবদুল্লাহ (রহ.) ইবনু ‘উমার (রাঃ) হতে বর্ণনা করেছেন যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, উপযোগিতা প্রকাশ হওয়ার পূর্বে তোমরা ফল ক্রয় করবে না এবং শুকনো খেজুরের বিনিময়ে তাজা খেজুর বিক্রি করবে না। (১৪৮৬) (আধুনিক প্রকাশনীঃ ২০৪৪, ইসলামিক ফাউন্ডেশনঃ ২০৫৯ শেষাংশ)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 2200,
			"arabicnumber": 2200,
			"text": "আ‘মাশ (রহ.) হতে বর্ণিত। তিনি বলেন, ইবরাহীম (রহ.)-এর কাছে বন্ধক রেখে বাকীতে ক্রয় করার ব্যাপারে আলোচনা করলাম। তিনি বললেন, এতে কোন দোষ নেই। এরপর তিনি আসওয়াদ (রহ.) সূত্রে ‘আয়িশাহ (রাঃ) হতে বর্ণনা করেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নির্দিষ্ট মেয়াদে (মূল্য বাকী রেখে) জনৈক ইয়াহূদীর নিকট হতে খাদ্য ক্রয় করেন এবং তাঁর বর্ম বন্ধক রাখেন। (২০৬৮) (আধুনিক প্রকাশনীঃ ২০৪৫, ইসলামিক ফাউন্ডেশনঃ ২০৬০)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 2202,
			"arabicnumber": 2202,
			"text": "",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 2203,
			"arabicnumber": 2203,
			"text": "ইবনু ‘উমার (রাঃ)-এর আযাদকৃত গোলাম নাফি‘ (রহ.) হতে বর্ণিত যে, তাবীরকৃত খেজুর গাছ ফলের উল্লেখ ব্যতীত বিক্রি করলে যে তাবীর[1] করেছে সে ফলের মালিক হবে। তেমনি গোলাম ও জমির ফসলও মালিকেরই থাকবে। রাবী নাফি‘ (রহ.) এই তিনটিরই উল্লেখ করেছেন। (২২০৪, ২২০৬, ২৩৭৯, ২৭১৬) (আধুনিক প্রকাশনীঃ কিতাবুল বুয়ু‘ অনুচ্ছেদ ৯০, ইসলামিক ফাউন্ডেশনঃ অনুচ্ছেদ ১৩৬৬)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 2204,
			"arabicnumber": 2204,
			"text": "‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) হতে বর্ণিত যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, কেউ তাবীর করার পরে খেজুর গাছ বিক্রি করলে সে ফলের মালিক থাকবে, অবশ্য ক্রেতা যদি (ফল লাভের) শর্ত করে, তবে সে পাবে। (২২০৩, মুসলিম ২১/১৫, হাঃ ১৫৪৩, আহমাদ ৪৫০২) (আধুনিক প্রকাশনীঃ ২০৪৭, ইসলামিক ফাউন্ডেশনঃ ২০৬২)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 2205,
			"arabicnumber": 2205,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মুযাবানা নিষেধ করেছেন, আর তা হলো বাগানের ফল বিক্রয় করা। খেজুর হলে মেপে শুকনো খেজুরের বদলে, আঙ্গুর হলে মেপে কিসমিসের বদলে, আর ফসল হলে মেপে খাদ্যের বদলে বিক্রি করা। তিনি এসব বিক্রি নিষেধ করেছেন। (২১৭১) (আধুনিক প্রকাশনীঃ ২০৪৮, ইসলামিক ফাউন্ডেশনঃ ২০৬৩)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 2206,
			"arabicnumber": 2206,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যে ব্যক্তি খেজুর গাছে তাবীর করার পরে মূল গাছ বিক্রি করল, সে গাছের ফল যে তাবীর করেছে তারই থাকবে, অবশ্য ক্রেতা যদি ফলের শর্ত করে (তবে সে পাবে)। (২২০৩) (আধুনিক প্রকাশনীঃ ২০৪৯, ইসলামিক ফাউন্ডেশনঃ ২০৬৪)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 2207,
			"arabicnumber": 2207,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত, তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মুহাকালা [1], মুখাদারা [2], মুলামাসা, মুনাবাযা ও মুযাবানা নিষিদ্ধ করেছেন। (আধুনিক প্রকাশনীঃ ২০৫০, ইসলামিক ফাউন্ডেশনঃ ২০৬৫)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 2208,
			"arabicnumber": 2208,
			"text": "আনাস (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পাকার পূর্বে ফল বিক্রি নিষেধ করেছেন। (রাবী বলেন) আমরা আনাস (রাঃ)-কে জিজ্ঞেস করলাম, ফল পাকার অর্থ কী? তিনি বললেন, লালচে বা হলদে হওয়া। [আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন] বলত, আল্লাহ তা‘আলা যদি ফল নষ্ট করে দেন, তবে কিসের বদলে তোমার ভাইয়ের মাল গ্রহণ করবে? (১৪৮৮) (আধুনিক প্রকাশনীঃ ২০৫১, ইসলামিক ফাউন্ডেশনঃ ২০৬৬)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 2209,
			"arabicnumber": 2209,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর কাছে ছিলাম, তিনি সে সময়ে খেজুরের মাথি খাচ্ছিলেন। তখন তিনি বললেন, গাছের মধ্যে এমনও গাছ আছে, যা মু’মিন ব্যক্তির সদৃশ। আমি বলতে ইচ্ছা করলাম যে, তা হল খেজুর গাছ। কিন্তু আমি লক্ষ্য করলাম যে, আমি সকলের মাঝে বয়ঃকনিষ্ঠ (তাই লজ্জায় বলি নাই, কেউ উত্তর না দেয়ায়) তিনি বললেন, তা খেজুর গাছ। (৬১) (আধুনিক প্রকাশনীঃ ২০৫২, ইসলামিক ফাউন্ডেশনঃ ২০৬৭)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 2210,
			"arabicnumber": 2210,
			"text": "وَقَالَ شُرَيْحٌ لِلْغَزَّالِينَ سُنَّتُكُمْ بَيْنَكُمْ رِبْحًا وَقَالَ عَبْدُ الْوَهَّابِ عَنْ أَيُّوبَ عَنْ مُحَمَّدٍ لاَ بَأْسَ الْعَشَرَةُ بِأَحَدَ عَشَرَ وَيَأْخُذُ لِلنَّفَقَةِ رِبْحًا وَقَالَ النَّبِيُّ لِهِنْدٍ خُذِي مَا يَكْفِيكِ وَوَلَدَكِ بِالْمَعْرُوفِ وَقَالَ تَعَالَى (وَمَنْ كَانَ فَقِيرًا فَلْيَأْكُلْ بِالْمَعْرُوفِ) وَاكْتَرَى الْحَسَنُ مِنْ عَبْدِ اللهِ بْنِ مِرْدَاسٍ حِمَارًا فَقَالَ بِكَمْ قَالَ بِدَانَقَيْنِ فَرَكِبَهُ ثُمَّ جَاءَ مَرَّةً أُخْرَى فَقَالَ الْحِمَارَ الْحِمَارَ فَرَكِبَهُ وَلَمْ يُشَارِطْهُ فَبَعَثَ إِلَيْهِ بِنِصْفِ دِرْهَمٍ শুরাইহ (রহ.) তাঁতী সম্প্রদায়ের উদ্দেশে বলেন, তোমাদের মাঝে প্রচলিত নিয়ম-নীতি (তোমাদের কাজ-কারবারে) গ্রহণযোগ্য। আবদুল ওহাব (রহ.) আইয়ূব (রহ.) সূত্রে মুহাম্মাদ [ইবনু সীরীন (রহ.)] হতে বর্ণনা করেনঃ দশ টাকায় কৃত বস্তু এগার টাকায় বিক্রি করাতে কোন দোষ নেই; খরচের জন্য লাভ গ্রহণ করা যায়। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম [আবূ সুফিয়ান (রাঃ)]-এর স্ত্রী হিন্দাকে বলেছিলেন, তোমার ও তোমার সন্তানাদির জন্য যা প্রয়োজন, তা বিধিসম্মতভাবে গ্রহণ করতে পার। আল্লাহ তা‘আলা বলেনঃ ‘‘যে অভাবগ্রস্ত, সে যেন সঙ্গত পরিমাণে ভোগ করে’’- (আন-নিসা ৬)। একবার হাসান বসরী (রহ.) ‘আবদুল্লাহ ইবনু মিরদাস (রহ.) হতে গাধা ভাড়া করেন এবং জিজ্ঞেস করেন, ভাড়া কত? ইবনু মিরদাস (রহ.) বলেন, দুই দানিক। এরপর তিনি এতে আরোহণ করেন। দ্বিতীয়বার এসে তিনি বলেন, গাধাটি আন গাধাটি আন। এরপর তিনি গাধায় আরোহণ করলেন, কিন্তু কোন ভাড়া ঠিক করলেন না। পরে অর্ধ দিরহাম (৩ দানিক) পাঠিয়ে দিলেন (তিনি দয়া করে এক দানিক বেশী দিলেন)। ২২১০. আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। তিনি বলেন, আবূ তায়বা আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে শিঙ্গা লাগালেন। তিনি এক সা‘ খেজুর দিতে বললেন এবং তার উপর হতে দৈনিক আয়কর কমানোর জন্য তার মালিককে আদেশ দিলেন। (২১০২) (আধুনিক প্রকাশনীঃ ২০৫৩, ইসলামিক ফাউন্ডেশনঃ ২০৬৮)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 2211,
			"arabicnumber": 2211,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত যে, মু‘আবিয়া (রাঃ)-এর মা হিন্দা আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে বলেন, আবূ সুফিয়ান (রাঃ) একজন কৃপণ ব্যক্তি। এমতাবস্থায় আমি যদি তার মাল হতে গোপনে কিছু গ্রহণ করি, তাতে কি আমার গুনাহ হবে? তিনি বললেন, তুমি তোমার ও সন্তানদের প্রয়োজন অনুযায়ী ন্যায়ভাবে গ্রহণ করতে পার। (২৪৬০, ৩৮২৫, ৫৩৫৯, ৫৩৬৪, ৫৩৭০, ৬৬৪১, ৭১৬১, ৭১৮০) (আধুনিক প্রকাশনীঃ ২০৫৪, ইসলামিক ফাউন্ডেশনঃ ২০৬৯)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 2212,
			"arabicnumber": 2212,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, কুরআনের আয়াতঃ ‘‘যে অভাবমুক্ত সে যেন নিবৃত্ত থাকে এবং যে অভাবগ্রস্ত সে যেন সঙ্গত পরিমাণে ভোগ করে’’- (আন-নিসা ৬)। ইয়াতীমের ঐ অভিভাবক সম্পর্কে অবতীর্ণ হয়, যে তার তত্ত্বাবধান করে ও তার সম্পত্তির পরিচর্যা করে, সে যদি অভাবগ্রস্ত হয়, তবে তা হতে নিয়মমাফিক খেতে পারবে। (২৭৬৫, ৪৫৭৫, মুসলিম ৫৪ অধ্যায়ের প্রথমে হাঃ ৩০১৯) (আধুনিক প্রকাশনীঃ ২০৫৫, ইসলামিক ফাউন্ডেশনঃ ২০৭০)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 2213,
			"arabicnumber": 2213,
			"text": "জাবির (রাঃ) হতে বর্ণিত। তিনি বলেন, যে সম্পত্তির ভাগ বাঁটোয়ারা হয়নি, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাতে শুফ‘আ [1] এর অধিকার প্রদান করেছেন। যখন সীমানা নির্ধারিত হয়ে যায় এবং রাস্তা ভিন্ন করা হয়, তখন আর শুফ‘আ এর অধিকার থাকবে না। (২২১৪, ২২৫৭, ২৪৯৫, ২৪৯৬, ২৯৭৬, মুসলিম ২২/২৮, হাঃ ১৬০৮, আহমাদ ১৪৩৪৫) (আধুনিক প্রকাশনীঃ ২০৫৬, ইসলামিক ফাউন্ডেশনঃ ২০৭১)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 2214,
			"arabicnumber": 2214,
			"text": "জাবির ইবনু ‘আবদুল্লাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যে সম্পত্তির ভাগ-বাঁটোয়ারা হয়নি, তার মধ্যে শুফ‘আ লাভের ফায়সালা প্রদান করেছেন। তারপর যখন সীমানা নির্ধারিত হয়ে যায় এবং স্বতন্ত্র করা হয় তখন আর শু‘ফআ এর অধিকার থাকবে না। (ইসলামিক ফাউন্ডেশনঃ ২০৭২) মুসাদ্দাদ (রহ.) ....... আবদুল ওয়াহিদ (রহ.) হতে এটি বর্ণনা করেছেন এবং তিনি বলেছেন, যে সম্পদ ভাগ-বাঁটোয়ারা হয়নি (তাতে শু‘ফআ)। হিশাম (রহ.) মা‘মর (রহ.) হতে হাদীস বর্ণনায় মুসাদ্দাদের অনুসরণ করেছেন। আবদুর রাযযাক (রহ.) বলেছেন, যে সম্পদ ভাগ-বাঁটোয়ারা হয়নি, সে সব সম্পদেই (শুফ‘আ রয়েছে)। হাদীসটি আবদুর রহমান ইবনু ইসহাক (রহ.) যুহরী (রহ.) হতে বর্ণনা করেছেন। (২২১৩) (আধুনিক প্রকাশনীঃ ২০৫৭, ইসলামিক ফাউন্ডেশনঃ ২০৭৩)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 2215,
			"arabicnumber": 2215,
			"text": "ইবনু ‘উমার (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেন, একদা তিন ব্যক্তি হেঁটে চলছিল। এমন সময় প্রবল বৃষ্টি শুরু হলে তারা এক পাহাড়ের গুহায় প্রবেশ করে। হঠাৎ একটি পাথর গড়িয়ে তাদের গুহার মুখ বন্ধ করে দেয়। তাদের একজন আরেকজনকে বলল; তোমরা যে সব ‘আমল করেছ, তার মধ্যে উত্তম আমলের ওয়াসীলা করে আল্লাহর কাছে দু‘আ কর। তাদের একজন বলল, ইয়া আল্লাহ! আমার অতিবৃদ্ধ পিতামাতা ছিলেন, আমি (প্রত্যহ সকালে) মেষ চরাতে বের হতাম। তারপর ফিরে এসে দুধ দোহন করতাম এবং এ দুধ নিয়ে আমার পিতা-মাতার নিকট উপস্থিত হতাম ও তাঁরা তা পান করতেন। তারপরে আমি শিশুদের, পরিজনদের এবং স্ত্রীকে পান করতে দিতাম। একরাত্রে আমি আটকা পড়ে যাই। তারপর আমি যখন এলাম তখন তাঁরা দু’জনে ঘুমিয়ে পড়েছেন। সে বলল, আমি তাদের জাগানো পছন্দ করলাম না। আর তখন শিশুরা আমার পায়ের কাছে (ক্ষুধায়) চীৎকার করছিল। এ অবস্থায়ই আমার এবং পিতা-মাতার ফজর হয়ে গেল। ইয়া আল্লাহ! তুমি যদি জান তা আমি শুধুমাত্র তোমার সন্তুষ্টি লাভের আশায় করেছিলাম তা হলে তুমি আমাদের গুহার মুখ এতটুকু ফাঁক করে দাও, যাতে আমরা আকাশ দেখতে পারি। বর্ণনাকারী বলেন, তখন একটু ফাঁকা হয়ে গেল। আরেকজন বলল, ইয়া আল্লাহ! তুমি জান যে, আমি আমার এক চাচাতো বোনকে এত ভালবাসতাম, যা একজন পুরুষ নারীকে ভালবেসে থাকে। সে বলল, তুমি আমা হতে সে মনস্কামনা সিদ্ধ করতে পারবে না, যতক্ষণ আমাকে একশত দ্বীনার না দেবে। আমি চেষ্টা করে তা সংগ্রহ করি। তারপর যখন আমি তার পদদ্বয়ের মাঝে উপবেশন করি, তখন সে বলে ‘‘আল্লাহকে ভয় কর’’। বৈধ অধিকার ছাড়া মাহরকৃত বস্তুর সীল ভাঙবে না। এতে আমি তাকে ছেড়ে উঠে পড়ি। (হে আল্লাহ) তুমি যদি জান আমি তা তোমারই সন্তুষ্টি অর্জনের উদ্দেশে করেছি, তবে আমাদের হতে আরো একটু ফাঁক করে দাও। তখন তাদের হতে (গুহার মুখের) দুই-তৃতীয়াংশ ফাঁক হয়ে গেল। অপরজন বলল, হে আল্লাহ! তুমি জান যে, এক ফারাক (পরিমাণ) শস্য দানার বিনিময়ে আমি একজন মজুর রেখেছিলাম। আমি তাকে তা দিতে গেলে সে তা গ্রহণ করতে অস্বীকার করল। তারপর আমি সে এক ফারাক শস্য দানা দিয়ে চাষ করে ফসল উৎপন্ন করি এবং তা দিয়ে গরু ক্রয় করি এবং রাখাল নিযুক্ত করি। কিছুকাল পরে সে মজুর এসে বলল, হে আল্লাহর বান্দা! আমাকে আমার পাওনা দিয়ে দাও। আমি বললাম, এই গরুগুলো ও রাখাল নিয়ে যাও। সে বলল, তুমি কি আমার সাথে উপহাস করছ? আমি বললাম, আমি তোমার সাথে উপহাস করছি না বরং এসব তোমার। হে আল্লাহ! তুমি যদি জান আমি তা তোমারই সন্তুষ্টির উদ্দেশে করেছি, তবে আমাদের হতে (গুহার মুখ) উন্মুক্ত করে দাও। তখন তাদের হতে গুহার মুখ উন্মুক্ত হয়ে গেল। (২২৭২, ২৩৩৩, ২৪৬৫, ৫৯৭৪, মুসলিম ৪৮/২৭, হাঃ ২৭৪৩, আহমাদ ৫৯৮১) (আধুনিক প্রকাশনীঃ ২০৫৮, ইসলামিক ফাউন্ডেশনঃ ২০৭৪)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 2216,
			"arabicnumber": 2216,
			"text": "আবদুর রহমান ইবনু আবূ বাকর (রাঃ) হতে বর্ণিত। তিনি বলেন, আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে ছিলাম। সে সময়ে এলোমেলো লম্বা লম্বা চুল বিশিষ্ট এক মুশরিক ব্যক্তি তার বকরী হাঁকিয়ে উপস্থিত হলো। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বললেন, এটা কি বিক্রির জন্য, না দান হিসেবে, অথবা তিনি বললেন, না হেবা হিসেবে? সে বলল, বিক্রির জন্য। তখন তিনি তার নিকট হতে একটি বকরী কিনে নিলেন। (২৬১৮, ৫৩৮২) (আধুনিক প্রকাশনীঃ ২০৫৯, ইসলামিক ফাউন্ডেশনঃ ২০৭৫)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 2217,
			"arabicnumber": 2217,
			"text": "وَقَالَ النَّبِيُّ صلى الله عليه وسلم لِسَلْمَانَ كَاتِبْ وَكَانَ حُرًّا فَظَلَمُوهُ وَبَاعُوهُ وَسُبِيَ عَمَّارٌ وَصُهَيْبٌ وَبِلاَلٌ وَقَالَ اللهُ تَعَالَى ( وَاللهُ فَضَّلَ بَعْضَكُمْ عَلَى بَعْضٍ فِي الرِّزْقِ فَمَا الَّذِينَ فُضِّلُوا بِرَادِّي رِزْقِهِمْ عَلَى مَا مَلَكَتْ أَيْمَانُهُمْ فَهُمْ فِيهِ سَوَاءٌ أَفَبِنِعْمَةِ اللهِ يَجْحَدُونَ ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সালমান [ফারসী (রা.)]-কে বলেন, (তোমার মনিবের সঙ্গে) মুক্তির জন্য চুক্তি কর। সালমান (রাঃ) আসলে স্বাধীন ছিলেন, লোকেরা তাকে অন্যায়ভাবে দাস বানিয়ে বিক্রি করে দেয়। আম্মার, সুহাইব ও বিলাল (রাঃ)-কে বন্দী করে দাস বানানো হয়েছিল। আল্লাহ তা‘আলা বলেন, ‘‘আল্লাহ জীবনোপকরণে তোমাদের কাউকে কারো উপর শ্রেষ্ঠত্ব দিয়েছেন। যাদেরকে শ্রেষ্ঠত্ব দেয়া হয়েছে, তারা তাদের অধীনস্থ দাস-দাসীদেরকে নিজেদের জীবনোপকরণ হতে এমন কিছু দেয় না, যাতে ওরা এ বিষয়ে তাদের সমান হয়ে যায়, তবে কি ওরা আল্লাহর অনুগ্রহ অস্বীকার করে?’’ (আন্-নাহালঃ ৭১) ২২১৭. আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, ইবরাহীম (আঃ) সারাকে সঙ্গে নিয়ে হিজরত করলেন এবং এমন এক জনপদে প্রবেশ করলেন, যেখানে এক বাদশাহ ছিল, অথবা বললেন, এক অত্যাচারী শাসক ছিল। তাকে বলা হলো যে, ইবরাহীম (নামক এক ব্যক্তি) এক পরমা সুন্দরী নারীকে নিয়ে (আমাদের এখানে) প্রবেশ করেছে। সে তখন তাঁর নিকট লোক পাঠিয়ে জিজ্ঞেস করল, হে ইবরাহীম, তোমার সঙ্গে এ নারী কে? তিনি বললেন, আমার বোন। অতঃপর তিনি সারার নিকট ফিরে এসে বললেন, তুমি আমার কথা মিথ্যা মনে করো না। আমি তাদেরকে বলেছি যে, তুমি আমার বোন। আল্লাহর শপথ! দুনিয়াতে (এখন) তুমি আর আমি ব্যতীত আর কেউ মু’মিন নেই। সুতরাং আমি ও তুমি দ্বীনী ভাই বোন। এরপর ইবরাহীম (আঃ) (বাদশাহর নির্দেশে) সারাকে বাদশাহর নিকট পাঠিয়ে দিলেন। বাদশাহ তাঁর দিকে অগ্রসর হল। সারা উযূ করে সালাত আদায়ে দাঁড়িয়ে গেলেন এবং এ দু‘আ করলেন, হে আল্লাহ! আমিও তোমার উপর এবং তোমার রাসূলের উপর ঈমান এনেছি এবং আমার স্বামী ব্যতীত সকল হতে আমার লজ্জাস্থানের সংরক্ষণ করেছি। তুমি এই কাফিরকে আমার উপর ক্ষমতা দিও না। তখন বাদশাহ বেহুঁশ হয়ে পড়ে মাটিতে পায়ের আঘাত করতে লাগলো। তখন সারা বললেন, আয় আল্লাহ! এ যদি মারা যায় তবে লোকে বলবে, স্ত্রীলোকটি একে হত্যা করেছে। তখন সে সংজ্ঞা ফিরে পেল। এভাবে দু’বার বা তিনবারের পর বাদশাহ বলল, আল্লাহর শপথ! তোমরা তো আমার নিকট এক শয়তানকে পাঠিয়েছ। একে ইবরাহীমের নিকট ফিরিয়ে দাও এবং তার জন্য হাজেরাকে হাদিয়া স্বরূপ দান কর। সারাহ (রাযি.) ইবরাহীম (আঃ)-এর নিকট ফিরে এসে বললেন, আপনি জানেন কি, আল্লাহ তা‘আলা কাফিরকে লজ্জিত ও নিরাশ করেছেন এবং সে এক বাঁদী হাদিয়া হিসেবে দিয়েছে। (২৬৩৫, ২৩৫৭, ২৩৫৮, ৫০৮৪, ৬৯৫০) (আধুনিক প্রকাশনীঃ ২০৬০, ইসলামিক ফাউন্ডেশনঃ ২০৭৬)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 2218,
			"arabicnumber": 2218,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, সা‘দ ইবনু আবূ ওয়াক্কাস ও ‘আব্দ ইবনু যাম্‘আ উভয়ে এক বালকের ব্যাপারে বিতর্ক করেন। সা‘দ (রাঃ) বলেন, হে আল্লাহর রাসূল! এতো আমার ভাই উৎবা উবনু আবী ওয়াক্কাসের পুত্র। সে তার পুত্র হিসাবে আমাকে ওয়াসিয়্যত করে গেছে। আপনি ওর সাদৃশ্যের প্রতি লক্ষ্য করুন। ‘আব্দ ইবনু যাম‘আ বললেন, হে আল্লাহর রাসূল! এ আমার ভাই, আমার পিতার দাসীর গর্ভে জন্মগ্রহণ করে। তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার চেহারার দিকে তাকিয়ে দেখতে পেলেন যে, উত্বার সাথে তার পরিষ্কার সাদৃশ্য রয়েছে। তিনি বললেন, এ ছেলেটি তুমি পাবে, হে আব্দ ইবনু যাম‘আ! বিছানা যার, সন্তান তার। ব্যভিচারীর জন্য রয়েছে বঞ্চনা। হে সাওদাহ বিনতু যাম‘আ! তুমি এর হতে পর্দা কর। ফলে সাওদাহ (রাঃ) কখনও তাকে দেখেননি। (আধুনিক প্রকাশনীঃ ২০৬১, ইসলামিক ফাউন্ডেশনঃ ২০৭৭)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 2219,
			"arabicnumber": 2219,
			"text": "‘আবদুর রহমান ইবনু আওফ (রাঃ) হতে বর্ণিত। তিনি সুহাইব (রাঃ)-কে বলেন, আল্লাহ্‌কে ভয় কর। তুমি নিজ পিতা ছাড়া অন্যকে নিজের পিতা বলে দাবী করো না। এর উত্তরে সুহাইব (রাঃ) বলেন, আমি এতে আনন্দবোধ করব না যে, এত এত সম্পদ হোক আর আমি আমার পিতৃত্বের দাবী অন্যের প্রতি আরোপ করি, বরং (আসল ব্যাপার) আমাকে শৈশবে চুরি করে নিয়ে যাওয়া হয়েছিল। (আধুনিক প্রকাশনীঃ ২০৬২, ইসলামিক ফাউন্ডেশনঃ ২০৭৮)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 2220,
			"arabicnumber": 2220,
			"text": "হাকীম ইবনু হিযাম (রাঃ) হতে বর্ণিত। তিনি বললেন, হে আল্লাহর রাসূল! আপনি বলুন, আমি জাহিলিয়্যা যুগে দান, খায়রাত, গোলাম আযাদ ও আত্মীয়-স্বজনের সাথে সদ্ব্যবহার ইত্যাদি যে সব নেকীর কাজ করেছি, এতে কি আমি সাওয়াব পাব? হাকীম (রাঃ) বলেন, রাসূলল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, অতীতের সৎকর্মসহ তুমি ইসলাম গ্রহণ করেছ অর্থাৎ তুমি যে সব নেকী করেছ, তার সম্পূর্ণ পুণ্য অর্জন করবে। (১৪৩৬) (আধুনিক প্রকাশনীঃ ২০৬৩, ইসলামিক ফাউন্ডেশনঃ ২০৭৯)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 2221,
			"arabicnumber": 2221,
			"text": "‘আবদুল্লাহ ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, (একবার) আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক মৃত বকরীর পাশ দিয়ে যাচ্ছিলেন। তখন তিনি বললেন, তোমরা এর চামড়া কাজে লাগাও না কেন? তারা বললেন, এতো মৃত। তিনি বললেন, শুধু তার গোশত খাওয়া হারাম করা হয়েছে। (১৪৯২) (আধুনিক প্রকাশনীঃ ২০৬৪, ইসলামিক ফাউন্ডেশনঃ ২০৮০)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 2222,
			"arabicnumber": 2222,
			"text": "وَقَالَ جَابِرٌ حَرَّمَ النَّبِيُّ صلى الله عليه وسلم بَيْعَ الْخِنْزِيرِ জাবির (রাঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম শূকর বিক্রয় হারাম করেছেন। ২২২২. আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, শপথ সেই সত্তার, যাঁর হাতে আমার প্রাণ। অচিরেই তোমাদের মাঝে ন্যায় বিচারকরূপে মারইয়ামের পুত্র [ঈসা (আ.)] অবতরণ করবেন। তারপর তিনি ক্রুশ ভেঙ্গে ফেলবেন, শূকর হত্যা করবেন, জিয্য়া রহিত করবেন এবং ধন-সম্পদের এরূপ প্রাচুর্য হবে যে, কেউ তা গ্রহণ করবে না। (২৪৭৬, ৩৪৪৮, ৩৪৪৯, মুসলিম ১/৭১, হাঃ ১৫৫, আহমাদ ৭৬৮৩) (আধুনিক প্রকাশনীঃ ২০৬৫, ইসলামিক ফাউন্ডেশনঃ ২০৮১)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 2223,
			"arabicnumber": 2223,
			"text": "رَوَاهُ جَابِرٌ عَنْ النَّبِيِّ صلى الله عليه وسلم জাবির (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে তা বর্ণনা করেছেন। ২২২৩. ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, ইবনু খাত্তাব (রাঃ)-এর নিকট সংবাদ পৌঁছল যে, অমুক ব্যক্তি শরাব বিক্রি করেছে। তিনি বললেন, আল্লাহ তা‘আলা অমুকের বিনাশ করুন। সে কি জানে না যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, আল্লাহ তা‘আলা ইয়াহূদীদের সর্বনাশ করুন, তাদের জন্য চর্বি হারাম করা হয়েছিল; কিন্তু তারা তা গলিয়ে বিক্রি করে। (৩৪৬০, মুসলিম ২২/১৩, হাঃ ১৫৮২, আহমাদ ১৭০) (আধুনিক প্রকাশনীঃ ২০৬৬, ইসলামিক ফাউন্ডেশনঃ ২০৮২)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 2224,
			"arabicnumber": 2224,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, আল্লাহ তা‘আলা ইয়াহূদীদের বিনাশ করুন। তাদের জন্য চর্বি হারাম করা হয়েছে। তারা তা (গলিয়ে) বিক্রি করে তার মূল্য ভোগ করে। (মুসলিম ২২/১৩, হাঃ ১৫৮৩) (আধুনিক প্রকাশনীঃ ২০৬৭, ইসলামিক ফাউন্ডেশনঃ ২০৮৩) আবূ ‘আবদুল্লাহ (ইমাম বুখারী) (রহ.) বলেন ( قَاتَلَهُمْ اللهُ ) এর অর্থ আল্লাহ তাদের বিনাশ করুন( قُتِلَ ) অর্থ বিনাশ করা গেল ( الْخَرَّاصُونَ ) এর অর্থ মিথ্যাবাদী।",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 2225,
			"arabicnumber": 2225,
			"text": "সা‘ঈদ ইবনু আবুল হাসান (রহ.) হতে বর্ণিত। তিনি বলেন, আমি ইবনু ‘আব্বাস (রাঃ)-এর নিকট উপস্থিত ছিলাম, এমন সময়ে তাঁর কাছে এক ব্যক্তি এসে বলল, হে আবূ আববস! আমি এমন ব্যক্তি যে, আমার জীবিকা হস্তশিল্পে। আমি এসব ছবি তৈরী করি। ইবনু ‘আব্বাস (রাঃ) তাঁকে বলেন, (এ বিষয়ে) আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে আমি যা বলতে শুনেছি, তাই তোমাকে শোনাব। তাঁকে আমি বলতে শুনেছি, যে ব্যক্তি কোন ছবি তৈরী করে আল্লাহ তা‘আলা তাকে শাস্তি দিবেন, যতক্ষণ না সে তাতে প্রাণ সঞ্চার করে। আর সে তাতে কখনো প্রাণ সঞ্চার করতে পারবে না। (এ কথা শুনে) লোকটি ভীষণভাবে ভয় পেয়ে গেল এবং তার চেহারা ফ্যাকাশে হয়ে গেল। এতে ইবনু ‘আব্বাস (রাঃ) বললেন, আক্ষেপ তোমার জন্য, তুমি যদি এ কাজ না-ই ছাড়তে পার, তবে এ গাছপালা এবং যে সকল জিনিসে প্রাণ নেই, তা তৈরী করতে পার। আবূ ‘আবদুল্লাহ (ইমাম বুখারী) (রহ.) বলেন, সা‘ঈদ (রাঃ) বলেছেন, আমি নযর ইবনু আনাস (রাঃ) হতে শুনেছি তিনি বলেছেন, ইবনু ‘আব্বাস (রাঃ) হাদীস বর্ণনা করার সময় আমি তার কাছে ছিলাম। ইমাম বুখারী (রহ.) আরো বলেন, সা‘ঈদ ইবনু আবূ আরুবাহ (রহ.) একমাত্র এ হাদীসটি নযর ইবনু আনাস (রহ.) হতে শুনেছেন। (৫৯৬৩, ৭০৪২, মুসলিম ৩৭/২৬, হাঃ ২১১০, আহমাদ ২১৬২) (আধুনিক প্রকাশনীঃ ২০৬৮, ইসলামিক ফাউন্ডেশনঃ ২০৮৪)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 2226,
			"arabicnumber": 2226,
			"text": "وَقَالَ جَابِرٌ حَرَّمَ النَّبِيُّ صلى الله عليه وسلم بَيْعَ الْخَمْرِ জাবির (রাঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মদ বিক্রয় করা হারাম করেছেন। ২২২৬. ‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, যখন সূরা আল-বাকারার শেষ আয়াতগুলো নাযিল হলো, তখন নবী বের হয়ে বললেন, শরাবের ব্যবসা হারাম করা হয়েছে। (আধুনিক প্রকাশনীঃ ২০৬৯, ইসলামিক ফাউন্ডেশনঃ ২০৮৫)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 2227,
			"arabicnumber": 2227,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, আল্লাহ তা‘আলা ঘোষণা করেছেন যে, কিয়ামতের দিবসে আমি নিজে তিন ব্যক্তির বিরুদ্ধে বাদী হবো। এক ব্যক্তি, যে আমার নামে ওয়াদা করে তা ভঙ্গ করল। আরেক ব্যক্তি, যে কোন আযাদ মানুষকে বিক্রি করে তার মূল্য ভোগ করল। আর এক ব্যক্তি, যে কোন মজুর নিয়োগ করে তার হতে পুরো কাজ আদায় করে এবং তার পারিশ্রমিক দেয় না। (আধুনিক প্রকাশনীঃ ২০৭০, ইসলামিক ফাউন্ডেশনঃ ২০৮৬)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 2228,
			"arabicnumber": 2228,
			"text": "৩৪/১০৭. মাদ্বীনা হতে বহিস্কার ও উচ্ছেদকালে নিজ মালিকানাধীন ভূমি বিক্রয় করে দেয়ার জন্য ইয়াহূদীদের প্রতি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর আদেশ প্রদান। فِيهِ الْمَقْبُرِيُّ عَنْ أَبِي هُرَيْرَةَ আল মাকবূরী আবূ হুরাইরাহ্ (রাঃ) হতে এ সংক্রান্ত হাদীস বর্ণনা করেছেন। وَاشْتَرَى ابْنُ عُمَرَ رَاحِلَةً بِأَرْبَعَةِ أَبْعِرَةٍ مَضْمُونَةٍ عَلَيْهِ يُوفِيهَا صَاحِبَهَا بِالرَّبَذَةِ وَقَالَ ابْنُ عَبَّاسٍ قَدْ يَكُونُ الْبَعِيرُ خَيْرًا مِنْ الْبَعِيرَيْنِ وَاشْتَرَى رَافِعُ بْنُ خَدِيجٍ بَعِيرًا بِبَعِيرَيْنِ فَأَعْطَاهُ أَحَدَهُمَا وَقَالَ آتِيكَ بِالآ(রাঃ)خَرِ غَدًا رَهْوًا إِنْ شَاءَ اللهُ وَقَالَ ابْنُ الْمُسَيَّبِ لاَ رِبَا فِي الْحَيَوَانِ الْبَعِيرُ بِالْبَعِيرَيْنِ وَالشَّاةُ بِالشَّاتَيْنِ إِلَى أَجَلٍ وَقَالَ ابْنُ سِيرِينَ لاَ بَأْسَ بَعِيرٌ بِبَعِيرَيْنِ نَسِيئَةً ইবনু ‘উমার (রাঃ) চারটি উটের বিনিময়ে প্রাপ্য একটি আরোহণযোগ্য উট এই শর্তে ক্রয় করেন যে, মালিক তা ‘রাবাযা’ নামক স্থানে হস্তান্তর করবে। ইবনু ‘আব্বাস (রাঃ) বলেন, অনেক সময় একটি উট দু’টি উট অপেক্ষা উত্তম হয়। রাফি‘ ইবনু খাদীজ (রাঃ) দু’টি উটের বিনিময়ে একটি উট ক্রয় করে দু’টি উটের একটি (তখনই) দিলেন আর বললেন, আর একটি উট ইনশা-আল্লাহ আগামীকাল যথারীতি দিয়ে দিব। ইবনু মুসাইয়্যিব (রহ.) বলেন, জানোয়ারের মধ্যে কোন ‘রিবা’ হয় না। দু’উটের বিনিময়ে এক উট, দু’বকরীর বিনিময়ে এক বকরী বাকীতে বিক্রয় করলে সুদ হয় না। ইবনু সীরীন (রহ.) বলেন, দু’উটের বিনিময়ে এক উট এবং এক দিরহামের বিনিময়ে এক দিরহাম বাকী বিক্রি করাতে কোন দোষ নেই। ২২২৮. আনাস (রাঃ) হতে বর্ণিত। তিনি বলেন, সাফিয়্যাহ (রাযি.) বন্দীদের অন্তর্ভুক্ত ছিলেন, তিনি দিহ্য়া কালবী (রাঃ)-এর ভাগে পড়েন, এর পরে তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর অধীনে এসে যান। (৩৭১) (আধুনিক প্রকাশনীঃ ২০৭১, ইসলামিক ফাউন্ডেশনঃ ২০৮৭)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 2229,
			"arabicnumber": 2229,
			"text": "আবূ সাঈদ খুদরী (রাঃ) হতে বর্ণিত যে, একদা তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট উপবিষ্ট ছিলেন, তখন তিনি বললেন, হে আল্লাহর রাসূল! আমরা বন্দী দাসীর সাথে সঙ্গত হই। কিন্তু আমরা তাদের (বিক্রয় করে) মূল্য হাসিল করতে চাই। এমতাবস্থায় আযল- (নিরুদ্ধ সঙ্গম করা) সম্পর্কে আপনি কী বলেন? তিনি বললেন, আর তোমরা কি এরূপ করে থাক! তোমরা যদি তা (আযল) না কর তাতে তোমাদের কোন ক্ষতি নেই। কারণ আল্লাহ তা‘আলা যে সন্তান জন্ম হওয়ার ফায়সালা করে রেখেছেন, তা অবশ্যই জন্ম নিবে। (আধুনিক প্রকাশনীঃ ২০৭২, ইসলামিক ফাউন্ডেশনঃ ২০৮৮)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 2230,
			"arabicnumber": 2230,
			"text": "জাবির (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মুদাববার গোলাম বিক্রি করেছেন। (২১৪১) (আধুনিক প্রকাশনীঃ ২০৭৩, ইসলামিক ফাউন্ডেশনঃ ২০৮৯)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 2231,
			"arabicnumber": 2231,
			"text": "জাবির ইবনু ‘আবদুল্লাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মুদাববার বিক্রি করেছেন। (২১৪১) (আধুনিক প্রকাশনীঃ ২০৭৩, ইসলামিক ফাউন্ডেশনঃ ২০৯০)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 2233,
			"arabicnumber": 2233,
			"text": "",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 2234,
			"arabicnumber": 2234,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে আমি বলতে শুনেছি, তোমাদের কোন দাসী ব্যভিচার করলে এবং তার ব্যভিচার প্রমাণিত হলে তাকে ‘হদ’ স্বরূপ বেত্রাঘাত করবে এবং তাকে ভৎর্সনা করবে না। এরপর যদি সে আবার ব্যভিচার করে তাকে ‘হদ’ হিসাবে বেত্রাঘাত করবে কিন্তু তাকে ভৎর্সনা করবে না। তারপর সে যদি তৃতীয়বার ব্যভিচার করে এবং তার ব্যভিচার প্রমাণিত হয় তবে তাকে বিক্রি করে দেবে, যদিও তা চুলের রশির (তুচ্ছ মূল্যের) বিনিময়ে হয়। (২১৫২) (আধুনিক প্রকাশনীঃ ২০৭৫, ইসলামিক ফাউন্ডেশনঃ ২০৯২)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 2235,
			"arabicnumber": 2235,
			"text": "وَلَمْ يَرَ الْحَسَنُ بَأْسًا أَنْ يُقَبِّلَهَا أَوْ يُبَاشِرَهَا وَقَالَ ابْنُ عُمَرَ إِذَا وُهِبَتْ الْوَلِيدَةُ الَّتِي تُوطَأُ أَوْ بِيعَتْ أَوْ عَتَقَتْ فَلْيُسْتَبْرَأْ رَحِمُهَا بِحَيْضَةٍ وَلاَ تُسْتَبْرَأُ الْعَذْرَاءُ وَقَالَ عَطَاءٌ لاَ بَأْسَ أَنْ يُصِيبَ مِنْ جَارِيَتِهِ الْحَامِلِ مَا دُونَ الْفَرْجِ وَقَالَ اللهُ تَعَالَى ( إِلاَّ عَلَى أَزْوَاجِهِمْ أَوْ مَا مَلَكَتْ أَيْمَانُهُمْ ) হাসান (বাসরী) (রহ.) তাকে চুম্বন করা বা তার সাথে মিলামিশা করায় কোন দোষ মনে করেন না। ইবনু ‘উমার (রাঃ) বলেন, সহবাসকৃত দাসীকে দান বা বিক্রি বা আযাদ করলে এক হায়য পর্যন্ত তার জরায়ু মুক্ত কি-না দেখতে হবে। কুমারীর বেলায় ইসতিবরার প্রয়োজন নেই। আতা (রহ.) বলেন, (অপর কর্তৃক) গর্ভবতী নিজ দাসীকে যৌনাঙ্গ ব্যতীত ভোগ করতে পারবে। আল্লাহ তা‘আলার বাণী : ( إِلاَّ عَلَى أَزْوَاجِهِمْ أَوْ مَا مَلَكَتْ أَيْمَانُهُمْ ) ‘‘নিজেদের স্ত্রী অথবা অধিকারভুক্ত বাঁদী ব্যতীত, এতে তারা নিন্দনীয় হবে না .......’’। (মু’মিনূনঃ ৬) ২২৩৫. আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খায়বার গমন করেন। যখন আল্লাহ তা‘আলা তাঁর দুর্গের বিজয় দান করেন, তখন তাঁর সামনে সাফিয়্যাহ (রাযি.) বিনতে হুয়ায়্যি ইবনু আখতাব এর সৌন্দর্যের আলোচনা করা হয়। তাঁর স্বামী নিহত হয় এবং তিনি তখন ছিলেন নব-বিবাহিতা। অবশেষে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে নিজের জন্য গ্রহণ করে নেন। তিনি তাঁকে নিয়ে রওয়ানা হন। যখন আমরা সাদ্দা রাওহা নামক স্থানে উপনীত হলাম, তখন সাফিয়্যাহ (রাযি.) পবিত্র হলেন! তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর সঙ্গে মিলিত হন। তারপর চামড়ার ছোট দস্তরখানে হায়েস (খেজুরের ছাতু ও ঘি মিশ্রিত খাদ্য) তৈরী করে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, তোমরা আশেপাশের লোকদের উপস্থিত হওয়ার জন্য খবর দিয়ে দাও। এই ছিল সাফিয়্যাহ (রাযি.)-এর বিবাহে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কর্তৃক ওয়ালিমাহ। এরপর আমরা মদ্বীনার উদ্দেশে রওয়ানা হই। আনাস (রাঃ) বলেন, আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে দেখতে পেলাম যে, তাঁকে নিজের আবা’ দিয়ে ঘেরাও করে দিচ্ছেন। তারপর তিনি তাঁর উটের পাশে বসে হাঁটু সোজা করে রাখলেন, পরে সাফিয়্যাহ (রাযি.) তাঁর হাঁটুর উপর পা দিয়ে ভর করে আরোহণ করলেন। (৩৭১) (আধুনিক প্রকাশনীঃ ২০৭৬, ইসলামিক ফাউন্ডেশনঃ ২০৯৩)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 2236,
			"arabicnumber": 2236,
			"text": "জাবির ইবনু ‘আবদুল্লাহ (রাঃ) হতে বর্ণিত যে, তিনি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে মক্কা বিজয়ের বছর মক্কায় অবস্থানকালে বলতে শুনেছেনঃ আল্লাহ তা‘আলা ও তাঁর রাসূল শরাব, মৃত জন্তু, শূকর ও মূর্তি কেনা-বেচা হারাম করে দিয়েছেন। তাঁকে জিজ্ঞেস করা হলো, হে আল্লাহর রাসূল! মৃত জন্তুর চর্বি সম্পর্কে আপনি কী বলেন? তা দিয়ে তো নৌকায় প্রলেপ দেয়া হয় এবং চামড়া তৈলাক্ত করা হয় আর লোকে তা দ্বারা চেরাগ জ্বালিয়ে থাকে। তিনি বললেন, না, তাও হারাম। তারপর আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, আল্লাহ তা‘আলা ইয়াহূদীদের বিনাশ করুন। আল্লাহ যখন তাদের জন্য মৃতের চর্বি হারাম করে দেন, তখন তারা তা গলিয়ে বিক্রি করে মূল্য ভোগ করে। আবূ আসিম (রহ.) ....... আতা (রহ.) হতে বর্ণিত, তিনি বলেন, আমি জাবির (রাঃ)-কে (হাদীসটি) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করতে শুনেছি। (৪২৯৬, ৪৬৩৩, মুসলিম ২২/১৩, হাঃ ১৫৮১, আহমাদ ১৪৪৭৯) (আধুনিক প্রকাশনীঃ ২০৭৭, ইসলামিক ফাউন্ডেশনঃ ২০৯৪)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 2237,
			"arabicnumber": 2237,
			"text": "আবূ মাসঊদ আনসারী (রাঃ) হতে বর্ণিত যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কুকুরের মূল্য, ব্যভিচারের বিনিময় এবং গণকের পারিতোষিক (গ্রহণ করা) হতে নিষেধ করেছেন। (২২৮২, ২৩৪৬, ৫৭৬১, মুসলিম ২২/৯, হাঃ ১৫৬৭, আহমাদ ১৭০৬৯) (আধুনিক প্রকাশনীঃ ২০৭৮, ইসলামিক ফাউন্ডেশনঃ ২০৯৫)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 2238,
			"arabicnumber": 2238,
			"text": "‘আউন ইবনু আবূ জুহায়ফাহ হতে বর্ণিত। তিনি বলেন, আমি আমার পিতাকে দেখেছি যে, তিনি একটি শিঙ্গা লাগানেওয়ালা গোলাম কিনলেন। তিনি তার শিঙ্গা লাগানোর যন্ত্র ভেঙ্গে ফেলতে নির্দেশ দিলে তা ভেঙ্গে ফেলা হলে। আমি তাঁকে এ বিষয়ে জিজ্ঞেস করলে তিনি বললেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রক্তের মূল্য, কুকুরের মূল্য, দাসীর (ব্যভিচারের মাধ্যমে) উপার্জন করা হতে বারণ করেছেন। আর তিনি শরীরে উলকি অঙ্কনকারী ও উলকি গ্রহণকারী, সুদগ্রহীতা ও সুদ দাতার উপর এবং (জীব জানোয়ারের) ছবি অঙ্কনকারীর উপর অভিসম্পাত করেছেন। (২০৮৬) (আধুনিক প্রকাশনীঃ ২০৭৯, ইসলামিক ফাউন্ডেশনঃ ২০৯৬)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 184
			}
		}
	]
}