{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"38": "Transferance of a Debt from One Person to Another (Al-Hawaala)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2287,
			"arabicnumber": 2287,
			"text": "وَقَالَ الْحَسَنُ وَقَتَادَةُ إِذَا كَانَ يَوْمَ أَحَالَ عَلَيْهِ مَلِيًّا جَازَ وَقَالَ ابْنُ عَبَّاسٍ يَتَخَارَجُ الشَّرِيكَانِ وَأَهْلُ الْمِيرَاثِ فَيَأْخُذُ هَذَا عَيْنًا وَهَذَا دَيْنًا فَإِنْ تَوِيَ لأَحَدِهِمَا لَمْ يَرْجِعْ عَلَى صَاحِبِهِ হাসান এবং কাতাদাহ (রহ.) বলেন, যেদিন হাওয়ালা করা হল, সেদিন যদি সে মালদার হয় তাহলে হাওয়ালা জায়িয হবে। ইবনু ‘আব্বাস (রাঃ) বলেন, দু’জন অংশীদার অথবা উত্তরাধিকারী পরস্পরের মধ্যে এভাবে বণ্টন করল যে একজন নগদ সম্পদ নিল, অন্যজন সে ব্যক্তির অপরের নিকট পাওনা সম্পদ নিল। এমতাবস্থায় যদি কারো সম্পদ নষ্ট হয়ে যায়, তবে অন্যজনের নিকট আবার দাবী করা যাবে না। ২২৮৭. আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, ধনী ব্যক্তির ঋণ পরিশোধে গড়িমসি করা জুলুম। যখন তোমাদের কাউকে (তার জন্যে) কোন ধনী ব্যক্তির হাওয়ালা করা হয়, তখন সে যেন তা মেনে নেয়। (২২৮৮, ২৪০০, মুসলিম ২২/৭, হাঃ ১৫৬৪, আহমাদ ৭৫৪৪) (আধুনিক প্রকাশনীঃ ২১২৫, ইসলামিক ফাউন্ডেশনঃ ২১৪২)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2288,
			"arabicnumber": 2288,
			"text": "২২৮৮ . আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, ধনী ব্যক্তির পক্ষ হতে ঋণ পরিশোধে গড়িমসি করা জুলুম। যাকে (তার পাওনার জন্য) ধনীর হাওয়ালা করা হয়, সে যেন তা মেনে নেয়। (২২৮৭) (আধুনিক প্রকাশনীঃ ২১২৬, ইসলামিক ফাউন্ডেশনঃ ২১৪৩)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2289,
			"arabicnumber": 2289,
			"text": "সালামাহ ইবনু আকওয়া (রাঃ) হতে বর্ণিত যে, তিনি বলেন, একদিন আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট বসা ছিলাম। এমন সময় একটি জানাযা উপস্থিত করা হল। সাহাবীগণ বললেন, আপনি তার জানাযার সালাত আদায় করে দিন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তার কি কোন ঋণ আছে? তারা বলল, না। তিনি বললেন, সে কি কিছু রেখে গেছে? তারা বলল, না। তখন তিনি তার জানাযার সালাত আদায় করলেন। তারপর আরেকটি জানাযা উপস্থিত করা হল। সাহাবীগণ বললেন, হে আল্লাহর রাসূল! আপনি জানাযার সালাত আদায় করে দিন। তিনি বললেন, তার কি কোন ঋণ আছে? বলা হল, হ্যাঁ, আছে। তিনি বললেন, সে কি কিছু রেখে গেছে? তারা বললেন, তিনটি দ্বীনার। তখন তিনি তার জানাযার সালাত আদায় করলেন। তারপর তৃতীয় আরেকটি জানাযা উপস্থিত করা হল। সাহাবীগণ বললেন, আপনি তার জানাযা আদায় করুন। তিনি বলেন, সে কি কিছু রেখে গেছে। তারা বললেন, না। তিনি বললেন, তার কি কোন ঋণ আছে। তারা বললেন, তিন দ্বীনার। তিনি বললেন, তোমাদের এ লোকটির সালাত তোমরাই আদায় করে নাও। আবূ কাতাদাহ (রাঃ) বললেন, হে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম! তার জানাযার সালাত আদায় করুন, তার ঋণের জন্য আমি দায়ী। তখন তিনি তার জানাযার সালাত আদায় করলেন। (২২৯৫) (আধুনিক প্রকাশনীঃ ২১২৭, ইসলামিক ফাউন্ডেশনঃ ২১৪৪)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 3
			}
		}
	]
}