{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"41": "Agriculture"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2320,
			"arabicnumber": 2320,
			"text": "وَقَوْلِ اللهِ تَعَالَى (أَفَرَأَيْتُمْ مَا تَحْرُثُونَ أَأَنْتُمْ تَزْرَعُونَهُ أَمْ نَحْنُ الزَّارِعُونَ لَوْ نَشَاءُ لَجَعَلْنَاهُ حُطَامًا) মহান আল্লাহর বাণীঃ তোমরা যে বীজ বপন কর, সে সম্পর্কে চিন্তা করেছ কি? তোমরা কি তাকে অঙ্কুরিত কর, না আমিই অঙ্কুরিত করি? আমি ইচ্ছা করলে তাকে খড়-কুটা করে দিতে পারি।’’ (ওয়াক্বিয়াহ্ : ৬৩-৬৫) ২৩২০. আনাস ইবনে মালিক (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যে কোন মুসলিম ফলবান গাছ রোপণ করে কিংবা কোন ফসল ফলায় আর তা হতে পাখী কিংবা মানুষ বা চতুষ্পদ জন্তু খায় তবে তা তার পক্ষ হতে সদাকাহ্ বলে গণ্য হবে। মুসলিম (রহ.) ..... আনাস (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে হাদীসটি বর্ণিত হয়েছে। (৬০১২, মুসলিম ২২/২, হাঃ ১৫৫৩, আহমাদ ১২৪৯৭) (আধুনিক প্রকাশনীঃ ২১৫২, ইসলামিক ফাউন্ডেশনঃ ২১৬৯)",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2321,
			"arabicnumber": 2321,
			"text": "আবূ উমামাহ্ বাহিলী (রাঃ) হতে বর্ণিত। তিনি বলেন, লাঙ্গলের ফাল এবং কিছু কৃষি সরঞ্জাম দেখে বললেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে বলতে শুনেছি এটা যে সম্প্রদায়ের ঘরে প্রবেশ করে, আল্লাহ সেখানে অপমান প্রবেশ করান। রাবী মুহাম্মাদ [ইবনু যিয়াদ (রহ.)] বলেন, আবূ উমামাহ্ (রাঃ)-এর নাম হল সুদাই ইবনু আজলান। (আধুনিক প্রকাশনীঃ ২১৫৩, ইসলামিক ফাউন্ডেশনঃ ২১৭০)",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2322,
			"arabicnumber": 2322,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যে ব্যক্তি শস্য ক্ষেতের পাহারা কিংবা পশুর হিফাযতের উদ্দেশ্য ছাড়া অন্য কোন উদ্দেশে কুকুর পোষে, প্রতিদিন তার নেক আমল হতে এক কীরাত পরিমাণ কমতে থাকবে। ইবনু সীরীন ও আবূ সালিহ্ (রহ.) আবূ হুরাইরাহ (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেনঃ বকরী অথবা ক্ষেতের হিফাযত কিংবা শিকারের উদ্দেশ্য ছাড়া। আবূ হাযিম (রহ.) আবূ হুরাইরাহ (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেন, শিকার ও পশুর হিফাযত করার কুকুর। (৩৩২৪, মুসলিম ২২/১০, হাঃ ১৫৭৫, আহমাদ ৯৪৯৮) (আধুনিক প্রকাশনীঃ ২১৫৪, ইসলামিক ফাউন্ডেশনঃ ২১৭১)",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2323,
			"arabicnumber": 2323,
			"text": "সুফ্ইয়ান ইবনু আবূ যুহাইর (রাঃ) হতে বর্ণিত। যিনি আযদ-শানূ‘আ গোত্রের লোক, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর একজন সাহাবী ছিলেন। তিনি বলেন, আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে বলতে শুনেছি, যে ব্যক্তি এমন কুকুর পোষে যা ক্ষেত ও গবাদি পশুর হিফাযতের কাজে লাগে না, প্রতিদিন তার নেক আমল হতে এক কীরাত পরিমাণ কমতে থাকে। আমি বললাম, আপনি কি এটা আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে শুনেছেন? তিনি বললেন, হ্যাঁ, এ মসজিদের প্রতিপালকের কসম (আমি তাঁর কাছেই শুনেছি)। (৩৩২৫, মুসলিম ২২/১০, হাঃ ১৫৭৬, আহমাদ ২১৯৭২) (আধুনিক প্রকাশনীঃ ২১৫৫, ইসলামিক ফাউন্ডেশনঃ ২১৭২)",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2324,
			"arabicnumber": 2324,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, এক ব্যক্তি একটি গরুর উপর সাওয়ার ছিল, তখন গরুটি সে ব্যক্তির দিকে লক্ষ্য করে বলল, আমাকে এ কাজের জন্য সৃষ্টি করা হয়নি। আমাকে চাষাবাদ তথা ক্ষেতের কাজের জন্য সৃষ্টি করা হয়েছে। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আমি, আবূ বাকর ও ‘উমার (রাঃ) এটা বিশ্বাস করি। তিনি আরো বললেন, এক নেকড়ে বাঘ একটি বকরী ধরেছিল, রাখাল তাকে ধাওয়া করল। নেকড়ে বাঘটা তাকে বলল, সেদিন হিংস্র জন্তুর প্রাধান্য হবে, যেদিন আমি ছাড়া কেউ তার রাখাল থাকবে না, সেদিন কে তাকে রক্ষা করবে? নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আমি, আবূ বাকর ও ‘উমার (রাঃ) এটা বিশ্বাস করি। আবূ সালামাহ্ (রাঃ) বলেন, তারা দু’জন [আবূ বাকর ও উমার (রাঃ)] সেদিন মজলিসে হাযির ছিলেন না। (৩৪৭১, ৩৬৬৩, ৩৬৯০, মুসলিম ৪৪/১, হাঃ ২৩৮৮, আহমাদ ৭৩৫৫) (আধুনিক প্রকাশনীঃ ২১৫৬, ইসলামিক ফাউন্ডেশনঃ ২১৭৩)",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2325,
			"arabicnumber": 2325,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, আনসাররা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে বললেন, আমাদের এবং আমাদের ভাই (মুহাজির)-দের মধ্যে খেজুরের বাগান ভাগ করে দিন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, না। তখন তাঁরা (মুহাজিরগণকে) বললেন, আপনারা আমাদের বাগানে কাজ করুন, আমরা আপনাদেরকে ফলে অংশীদার করব। তাঁরা বললেন, আমরা শুনলাম এবং মানলাম। (২৭১৯, ৩৭৮২) (আধুনিক প্রকাশনীঃ ২১৫৭, ইসলামিক ফাউন্ডেশনঃ ২১৭৪)",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2326,
			"arabicnumber": 2326,
			"text": "وَقَالَ أَنَسٌ أَمَرَ النَّبِيُّ صلى الله عليه وسلم بِالنَّخْلِ فَقُطِعَ আনাস (রাঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খেজুর গাছ কেটে ফেলার আদেশ দেন এবং তা কেটে ফেলা হয়। ২৩২৬. ‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বনূ নাযির গোত্রের বুওয়াইরা নামক স্থানে অবস্থিত বাগানটির খেজুর গাছ জ্বালিয়ে দিয়েছেন এবং বৃক্ষ কেটে ফেলেছেন। এ সম্পর্কে হাস্সান (রাঃ) (তাঁর রচিত কবিতায়) বলেছেন, বুওয়াইরা নামক স্থানে অবস্থিত বাগানটিতে দাউ দাউ করে আগুন জ্বলছে আর বনূ লূয়াই গোত্রের সর্দাররা তা সহজে মেনে নিল। (৩০২১, ৪০৩১, ৪০৩২, ৪৮৮৪) (আধুনিক প্রকাশনীঃ ২১৫৮, ইসলামিক ফাউন্ডেশনঃ ২১৭৫)",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2327,
			"arabicnumber": 2327,
			"text": "রাফি‘ ইবনু খাদীজ (রাঃ) হতে বর্ণিত। তিনি বলেন, মদ্বীনাবাসীর মধ্যে বেশী জমিন আমাদের ছিল। আমরা ভাগে জমিন চাষ করতে দিতাম এবং সে ক্ষেতের এক নির্দিষ্ট অংশ জমির মালিকের জন্য নির্ধারিত করে দিতাম। তিনি বলেন, কখনো এ অংশের উপর দুর্যোগ আসত, অন্য অংশ নিরাপদ থাকত। আবার কখনো অন্য অংশের উপর দুর্যোগ আসত আর এ অংশ নিরাপদ থাকত। আমাদের এরূপ করতে নিষেধ করে দেয়া হয়েছিল। আর সে সময় সোনা-রূপার (বিনিময়ে জমি চাষ করার) প্রচলন ছিল না। (মুসলিম ২১/১৮, হাঃ ১৫৪৮) (আধুনিক প্রকাশনীঃ ২১৫৯, ইসলামিক ফাউন্ডেশনঃ ২১৭৬)",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2328,
			"arabicnumber": 2328,
			"text": "এবং কাইস ইবনু মুসলিম (রহ.) আবূ জা‘ফর (রাঃ) হতে বর্ণনা করেন। তিনি বলেন, মদ্বীনাতে মুহাজিরদের এমন কোন পরিবার ছিল না, যারা এক-তৃতীয়াংশ কিংবা এক-চতুর্থাংশ ফসলের শর্তে ভাগে চাষ করতেন না। ‘আলী, সা‘দ ইবনু মালিক, ‘আবদুল্লাহ ইবনু মাস‘ঊদ (রাঃ) ‘উমার ইবনু ‘আবদুল ‘আযীয, কাসিম, ‘উরওয়াহ (রহ.) এবং আবূ বকর, ‘উমার ও ‘আলী (রাঃ)-এর বংশধর এবং ইবনু সীরীন (রহ.)-ও ভাগে চাষ করেছেন। ‘আবদুর রহমান ইবনু আসওয়াদ (রাঃ) বলেন, আমি ‘আবদুর রহমান ইবনু ইয়াযীদের ক্ষেতে শরীক ছিলাম। ‘উমার (রাঃ) লোকেদের সাথে এ শর্তে জমি বর্গা দিয়েছেন যে, ‘উমার (রাঃ) বীজ দিলে তিনি ফসলের অর্ধেক পাবেন। আর যদি তারা বীজ দেয় তবে তাদের জন্য এই পরিমাণ হবে। হাসান (রহ.) বলেন, যদি ক্ষেত তাদের মধ্যে কোন একজনের হয়, আর দু’জনেই তাতে খরচ করে, তা হলে উৎপন্ন ফসল সমান হারে ভাগ করে নেয়ার মধ্যে কোন দোষ নেই। যুহরী (রহ.)-ও এ মত পোষণ করেন। হাসান (রহ.) বলেন, আধা-আধি শর্তে তুলা চাষ করতে কোন দোষ নেই। ইবরাহীম, ইবনু সীরীন, ‘আতা, হাকাম, যুহরী ও কাতাদাহ (রহ.) বলেন, তাঁতীকে এক-তৃতীয়াংশ বা এক চতুর্থাংশের শর্তে কাপড় বুনতে দেয়ায় কোন দোষ নেই। মা’মার (রহ.) বলেন, (উপার্জিত অর্থের) এক-তৃতীয়াংশ বা এক-চতুর্থাংশের শর্তে সময় নির্দিষ্ট করে গবাদি পশু ভাড়া দেয়াতে কোন দোষ নেই। ২৩২৮. ‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) বর্ণনা করেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খায়বারবাসীদেরকে উৎপাদিত ফল বা ফসলের অর্ধেক ভাগের শর্তে জমি বর্গা দিয়েছিলেন। তিনি নিজের সহধর্মিণীদেরকে একশ’ ওসক দিতেন, এর মধ্যে ৮০ ওসক খুরমা ও ২০ ওসক যব। ‘উমার (রাঃ) (তাঁর খিলাফতকালে খায়বারের) জমি বণ্টন করেন। তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সহধর্মিণীদের ইখতিয়ার দিলেন যে, তাঁরা জমি ও পানি নিবেন, না কি তাদের জন্য ওটাই চালু থাকবে, যা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর যামানায় ছিল। তখন তাদের কেউ জমি নিলেন আর কেউ ওসক নিতে রাজী হলেন। ‘আয়িশাহ (রাযি.) জমিই নিয়েছিলেন। (২২৮৫, মুসলিম ২২/১, হাঃ ১৫৫১, আহমাদ ৪৭৩২) (আধুনিক প্রকাশনীঃ ২১৬০, ইসলামিক ফাউন্ডেশনঃ ২১৭৭)",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2329,
			"arabicnumber": 2329,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উৎপাদিত ফল কিংবা ফসলের অর্ধেক শর্তে খায়বারের জমি বর্গা দিয়েছিলেন। (২২৮৫) (আধুনিক প্রকাশনীঃ ২১৬১, ইসলামিক ফাউন্ডেশনঃ ২১৭৮)",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2330,
			"arabicnumber": 2330,
			"text": "‘আমর (রহ.) হতে বর্ণিত। তিনি বলেন, আমি তাউস (রহ.)-কে বললাম, আপনি যদি বর্গাচাষ ছেড়ে দিতেন, (তাহলে খুব ভাল হত) কেননা, লোকেদের ধারণা যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তা নিষেধ করেছেন। তাউস (রহ.) বললেন, হে ‘আমর! আমি তো তাদেরকে বর্গাচাষ করতেই দিই এবং তাদের সাহায্য করি এবং তাদের মধ্যে সবচেয়ে জ্ঞানী অর্থাৎ ইবনু ‘আব্বাস (রাঃ) আমাকে বলেছেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বর্গাচাষ নিষেধ করেননি। তবে তিনি বলেছেন, তোমাদের কেউ তার ভাইকে জমি দান করুক, এটা তার জন্য তার ভাইয়ের কাছ হতে নির্দিষ্ট উপার্জন গ্রহণ করার চেয়ে উত্তম। (২৩৪২, ২৬৩৪, মুসলিম ২১/২১, হাঃ ১৫৫০, আহমাদ ২৫৪১) (আধুনিক প্রকাশনীঃ ২১৬২, ইসলামিক ফাউন্ডেশনঃ ২১৭৯)",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2331,
			"arabicnumber": 2331,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খায়বারের জমি ইয়াহূদীদেরকে এ শর্তে বর্গা দিয়েছিলেন যে, তারা তাতে পরিশ্রম করে কৃষি কাজ করবে এবং উৎপাদিত ফসলের অর্ধেক তারা পাবে। (২২৮৫) (আধুনিক প্রকাশনীঃ ২১৬৩, ইসলামিক ফাউন্ডেশনঃ ২১৮০)",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2332,
			"arabicnumber": 2332,
			"text": "রাফি‘ (রাঃ) হতে বর্ণিত। তিনি বলেন, মদ্বীনাবাসীদের মধ্যে ফসলের জমি আমাদের বেশী ছিল। আমাদের মধ্যে কেউ তার জমি ইজারা দিত এবং বলত, জমির এ অংশ আমার আর এ অংশ তোমার। কখনো এক অংশে ফসল হত আর অন্য অংশে হত না। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদেরকে এরূপ করতে নিষেধ করেছেন। (২২৮৬) (আধুনিক প্রকাশনীঃ ২১৬৪, ইসলামিক ফাউন্ডেশনঃ ২১৮১)",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2333,
			"arabicnumber": 2333,
			"text": "‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, একবার তিন জন লোক পথ চলছিল, তারা বৃষ্টিতে আক্রান্ত হল। অতঃপর তারা এক পাহাড়ের গুহায় আশ্রয় নিল। হঠাৎ পাহাড় হতে এক খন্ড পাথর পড়ে তাদের গুহার মুখ বন্ধ হয়ে গেল। তখন তারা একে অপরকে বলল, নিজেদের কৃত কিছু সৎকাজের কথা চিন্তা করে বের কর, যা আল্লাহর সন্তুষ্টির জন্য করা হয়েছে এবং তার ওয়াসীলা করে আল্লাহর নিকট দু‘আ কর। তাহলে হয়ত আল্লাহ তোমাদের উপর হতে পাথরটি সরিয়ে দিবেন। তাদের একজন বলতে লাগল, হে আল্লাহ! আমার আববা-আম্মা খুব বৃদ্ধ ছিলেন এবং আমার ছোট ছোট সন্তানও ছিল। আমি তাদের ভরণ-পোষণের জন্য পশু পালন করতাম। সন্ধ্যায় যখন আমি বাড়ি ফিরতাম তখন দুধ দোহন করতাম এবং আমার সন্তানদের আগে আমার আববা-আম্মাকে পান করাতাম। একদিন আমার ফিরতে দেরী হয় এবং সন্ধ্যা হওয়ার আগে আসতে পারলাম না। এসে দেখি তারা ঘুমিয়ে পড়েছেন। যখন আমি দুধ দোহন করলাম, যেমন প্রতিদিন দোহন করি। তারপর আমি তাঁদের শিয়রে (দুধ নিয়ে) দাঁড়িয়ে রইলাম। তাদেরকে জাগানো আমি পছন্দ করিনি এবং তাদের আগে আমার বাচ্চাদেরকে পান করানোও অসঙ্গত মনে করি। অথচ বাচ্চাগুলো দুধের জন্য আমার পায়ের কাছে পড়ে কান্নাকাটি করছিল। এভাবে ভোর হয়ে গেল। হে আল্লাহ! আপনি জানেন আমি যদি শুধু আপনার সন্তুষ্টির জন্যই এ কাজটি করে থাকি তবে আপনি আমাদের হতে পাথরটা খানিক সরিয়ে দিন, যাতে আমরা আসমানটা দেখতে পাই। তখন আল্লাহ পাথরটাকে একটু সরিয়ে দিলেন এবং তারা আসমান দেখতে পেল। দ্বিতীয় ব্যক্তি বলল, হে আল্লাহ! আমার এক চাচাতো বোন ছিল। পুরুষরা যেমন মহিলাদেরকে ভালবাসে, আমি তাকে তার চেয়ে অধিক ভালবাসতাম। একদিন আমি তার কাছে চেয়ে বসলাম (অর্থাৎ খারাপ কাজ করতে চাইলাম) কিন্তু তা সে অস্বীকার করল যে পর্যন্ত না আমি তার জন্য একশ’ দিনার নিয়ে আসি। পরে চেষ্টা করে আমি তা যোগাড় করলাম (এবং তার কাছে এলাম)। যখন আমি তার দু’পায়ের মাঝে বসলাম (অর্থাৎ সম্ভোগ করতে তৈরী হলাম) তখন সে বলল, হে আল্লাহর বান্দা! আল্লাহকে ভয় কর। অন্যায়ভাবে মাহর (পর্দা) ছিঁড়ে দিয়ো না। (অর্থাৎ আমার কুমারীর সতীত্ব নষ্ট করো না) তখন আমি দাঁড়িয়ে গেলাম। হে আল্লাহ! আপনি জানেন আমি যদি শুধু আপনার সন্তুষ্টির জন্য এ কাজটি করে থাকি, তবে আপনি আমাদের জন্য পাথরটা সরিয়ে দিন। তখন পাথরটা কিছু সরে গেল। তৃতীয় ব্যক্তি বলল, হে আল্লাহ! আমি এক ফারাক চাউলের বিনিময়ে একজন শ্রমিক নিযুক্ত করেছিলাম। যখন সে তার কাজ শেষ করল আমাকে বলল, আমার পাওনা দিয়ে দাও। আমি তাকে তার পাওনা দিতে গেলে সে তা নিল না। আমি তা দিয়ে কৃষি কাজ করতে লাগলাম এবং এর দ্বারা অনেক গরু ও তার রাখাল জমা করলাম। বেশ কিছু দিন পর সে আমার কাছে আসল এবং বলল, আল্লাহকে ভয় কর (আমার মজুরী দাও)। আমি বললাম, এই সব গরু ও রাখাল নিয়ে নাও। সে বলল, আল্লাহকে ভয় কর, আমার সাথে ঠাট্টা করো না। আমি বললাম, আমি তোমার সাথে ঠাট্টা করছি না, ওইগুলো নিয়ে নাও। তখন সে তা নিয়ে গেল। হে আল্লাহ! আপনি জানেন, যদি আমি আপনার সন্তুষ্টি লাভের জন্য এ কাজটি করে থাকি, তবে পাথরের বাকীটুকু সরিয়ে দিন। তখন আল্লাহ পাথরটাকে সরিয়ে দিলেন। আবূ ‘আবদুল্লাহ্ [বুখারী (রহ.)] বলেন, ইবনু ‘উকবা (রহ.) নাফি‘ (রহ.) ---- এর স্থলে --- বর্ণনা করেছেন। (২২১৫) (আধুনিক প্রকাশনীঃ ২১৬৫, ইসলামিক ফাউন্ডেশনঃ ২১৮২)",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2334,
			"arabicnumber": 2334,
			"text": "وَقَالَ النَّبِيُّ لِعُمَرَ تَصَدَّقْ بِأَصْلِهِ لاَ يُبَاعُ وَلَكِنْ يُنْفَقُ ثَمَرُهُ فَتَصَدَّقَ بِهِ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ‘উমার (রাঃ)-কে বললেন, তুমি মূল জমিটা এ শর্তে সদাকাহ কর যে, তা আর বিক্রি করা যাবে না। কিন্তু তার উৎপাদন ব্যয় করা হবে। তখন তিনি এভাবেই সদাকাহ করলেন। ২৩৩৪. আসলাম (রহ.) হতে বর্ণিত। তিনি বলেন, ‘উমার (রাঃ) বলেছেন, পরবর্তী যুগের মুসলিমদের বিষয়ে যদি আমরা চিন্তা না করতাম, তবে যে সব এলাকা জয় করা হত, তা আমি মুজাহিদদের মধ্যে বণ্টন করে দিতাম, যেমন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খায়বার বণ্টন করে দিয়েছিলেন। (৩১২৫, ৪২৩৫, ৪২৩৬) (আধুনিক প্রকাশনীঃ ২১৬৬, ইসলামিক ফাউন্ডেশনঃ ২১৮৩)",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2335,
			"arabicnumber": 2335,
			"text": "وَرَأَى ذَلِكَ عَلِيٌّ فِي أَرْضِ الْخَرَابِ بِالْكُوفَةِ مَوَاتٌ وَقَالَ عُمَرُ مَنْ أَحْيَا أَرْضًا مَيِّتَةً فَهِيَ لَهُ وَيُرْوَى عَنْ عَمْرِو بْنِ عَوْفٍ عَنْ النَّبِيِّ صلى الله عليه وسلم وَقَالَ فِي غَيْرِ حَقِّ مُسْلِمٍ وَلَيْسَ لِعِرْقٍ ظَالِمٍ فِيهِ حَقٌّ وَيُرْوَى فِيهِ عَنْ جَابِرٍ عَنْ النَّبِيِّ صلى الله عليه وسلم কুফার অনাবাদী জমি সম্পর্কে ‘আলী (রাঃ)-এর এ মত ছিল। (আবাদকারী তার মালিক হবে)। ‘উমার (রাঃ) বলেছেন, যে ব্যক্তি কোন অনাবাদ জমি আবাদ করবে সে তার মালিক হবে। ‘আমর ইবনু ‘আউফ (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এরূপ বর্ণিত হয়েছে এবং তিনি বলেছেন, তা হবে যে ক্ষেত্রে কোন মুসলিমের হক নাই, আর যালিম ব্যক্তির তাতে হক নাই। জাবির (রাঃ) কর্তৃক নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এ সস্পর্কিত রিওয়ায়াত বর্ণিত হয়েছে। ২৩৩৫. ‘আয়িশাহ (রাযি.) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যে ব্যক্তি এমন কোন জমি আবাদ করে, যা কারো মালিকানায় নয়, তাহলে সেই (মালিক হওয়ার) বেশী হকদার। ‘উরওয়াহ (রাঃ) বলেন, ‘উমার (রাঃ) তাঁর খিলাফতকালে এরূপ ফায়সালা দিয়েছেন। (আধুনিক প্রকাশনীঃ ২১৬৭, ইসলামিক ফাউন্ডেশনঃ ২১৮৪)",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2336,
			"arabicnumber": 2336,
			"text": "‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যুল-হুলায়ফা উপত্যকায় শেষরাতে বিশ্রাম করছিলেন। তিনি স্বপ্নে দেখলেন যে, তাঁকে বলা হলো, আপনি বরকতময় উপত্যকায় রয়েছেন। মূসা (রহ.) বলেন, সালিম আমাদের সাথে সে জায়গাতেই উট বসিয়েছিলেন যেখানে ‘আবদুল্লাহ (রাঃ) উট বসাতেন এবং সে জায়গা লক্ষ্য করতেন, যে জায়গায় আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম শেষরাতে অবতরণ করেছিলেন। সে জায়গা ছিল উপত্যকার মধ্যভাগে অবস্থিত মসজিদ হতে নীচে এবং মসজিদ ও রাস্তার মাঝখানে। (৪৮৩) (আধুনিক প্রকাশনীঃ ২১৬৮, ইসলামিক ফাউন্ডেশনঃ ২১৮৫)",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2337,
			"arabicnumber": 2337,
			"text": "‘উমার (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেন, গতরাতে আমার নিকট আমার প্রতিপালকের দূত এসেছিলেন। এ সময় তিনি আকীক উপত্যকায় অবস্থান করছিলেন। (এসে) তিনি বললেন, এই বরকতময় উপত্যকায় সালাত আদায় করুন, অর্থাৎ হাজ্জের সাথে উমরাহ্ এর ইহরাম বাঁধলাম। (১৫৩৪) (আধুনিক প্রকাশনীঃ ২১৬৯, ইসলামিক ফাউন্ডেশনঃ ২১৮৬)",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2338,
			"arabicnumber": 2338,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত যে, ‘উমার ইবনু খাত্তাব (রাঃ) ইয়াহূদী ও নাসারাদের হিজায হতে নির্বাসিত করেন। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন খায়বার জয় করেন, তখন ইয়াহূদীদের সেখান হতে বের করে দিতে চেয়েছিলেন। যখন তিনি কোন স্থান জয় করেন, তখন তা আল্লাহ, তাঁর রাসূল ও মুসলিমদের জন্য হয়ে যায়। কাজেই ইয়াহূদীদের সেখান হতে বহিষ্কার করে দিতে চাইলেন। তখন ইয়াহূদীরা আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর কাছে অনুরোধ করল, যেন তাদের সে স্থানে বহাল রাখা হয় এ শর্তে যে, তারা সেখানে চাষাবাদে দায়িত্ব পালন করবে আর ফসলের অর্ধেক তাদের থাকবে। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের বললেন, আমরা এ শর্তে তোমাদের এখানে বহাল থাকতে দিব যতদিন আমাদের ইচ্ছা। কাজেই তারা সেখানে বহাল রইল। অবশেষে ‘উমার (রাঃ) তাদেরকে তাইমা ও আরীহায় নির্বাসিত করে দেন। (২২৮৫, মুসলিম ২২/১, হাঃ ১৫৫১, আহমাদ ৬৩৭৬) (আধুনিক প্রকাশনীঃ ২১৭০, ইসলামিক ফাউন্ডেশনঃ ২১৮৭)",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2339,
			"arabicnumber": 2339,
			"text": "যুহাইর (রাঃ) হতে বর্ণিত। তিনি বলেন, একটি কাজ আমাদের উপকারী ছিল, যা করতে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের নিষেধ করলেন। আমি বললাম, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যা বলেছেন তাই সঠিক। যুহাইর (রাঃ) বললেন, আমাকে ডেকে জিজ্ঞেস করলেন, তোমরা তোমাদের ক্ষেত-খামার কিভাবে চাষাবাদ কর? আমি বললাম, আমরা নদীর তীরের ফসলের শর্তে অথবা খেজুর ও যবের নির্দিষ্ট কয়েক ওসাক প্রদানের শর্তে জমি ইজারা দিয়ে থাকি। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তোমরা এরূপ করবে না। তোমরা নিজেরা তা চাষ করবে অথবা অন্য কাউকে দিয়ে চাষ করাবে অথবা তা ফেলে রাখবে। রাফি‘ (রাঃ) বলেন, আমি শুনলাম ও মানলাম। (২৩৪৬, ৪০১২) (আধুনিক প্রকাশনীঃ ২১৭১, ইসলামিক ফাউন্ডেশনঃ ২১৮৮)",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2341,
			"arabicnumber": 2341,
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2342,
			"arabicnumber": 2342,
			"text": "‘আমর (রহ.) হতে বর্ণিত। তিনি বলেন, আমি (বর্গাচাষ সম্পর্কিত) এ হাদীসটি তাউস (রহ.)-কে জিজ্ঞেস করলাম। তিনি বললেন, (অন্যকে দিয়ে) চাষাবাদ করানো যেতে পারে। (কেননা) ইবনু ‘আব্বাস (রাঃ) বলেছেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তা (বর্গাচাষ) নিষেধ করেননি। তবে তিনি বলেছেন যে, তোমাদের নিজের ভাইকে জমি দান করে দেয়া উত্তম, তার কাছ হতে নির্দিষ্ট কিছু গ্রহণ করার চেয়ে। (২৩৩০) (আধুনিক প্রকাশনীঃ ২১৭৩, ইসলামিক ফাউন্ডেশনঃ ২১৯০)",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2344,
			"arabicnumber": 2344,
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2345,
			"arabicnumber": 2345,
			"text": "সালিম (রহ.) হতে বর্ণিত যে, ‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) বলেছেন, আমি জানতাম যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর যামানায় ক্ষেত বর্গাচাষ করতে দেয়া হত। তারপর ‘আবদুল্লাহ (রাঃ)-এর ভয় হল, হয়ত নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এ সম্পর্কে এমন কিছু নতুন নির্দেশ দিয়েছেন, যা তাঁর জানা নেই। তাই তিনি ভাগে জমি ইজারা দেয়া ত্যাগ করলেন। (২৩৪৩, মুসলিম ২১/১৭, হাঃ ১৫৪৭, আহমাদ ১৫৮১৮) (আধুনিক প্রকাশনীঃ ২১৭৫, ইসলামিক ফাউন্ডেশনঃ ২১৯২)",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2347,
			"arabicnumber": 2347,
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2348,
			"arabicnumber": 2348,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। একদিন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কথা বলছিলেন, তখন তাঁর নিকট গ্রামের একজন লোক উপবিষ্ট ছিল। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বর্ণনা করেন যে, জান্নাতবাসীদের কোন একজন তার রবের কাছে চাষাবাদের অনুমতি চাইবে। তখন আল্লাহ তা‘আলা তাকে বলবেন, তুমি কি যা চাও, তা পাচ্ছ না? সে বলবে, হ্যাঁ নিশ্চয়ই। কিন্তু আমার চাষ করার খুবই আগ্রহ। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তখন সে বীজ বুনবে এবং তা চারা হওয়া, গাছ বড় হওয়া ও ফসল কাটা সব কিছু পলকের মধ্যে হয়ে যাবে। আর তা (ফসল) পাহাড় সমান হয়ে যাবে। তখন আল্লাহ তা‘আলা বলবেন, হে আদম সন্তান! এগুলো নিয়ে নাও। কোন কিছুই তোমাকে তৃপ্তি দেয় না। তখন গ্রাম্য লোকটি বলে উঠল, আল্লাহর কসম, এই ধরনের লোক আপনি কুরায়শী বা আনসারদের মধ্যেই পাবেন। কেননা তাঁরা চাষী। আর আমরা তো চাষী নই। এ কথা শুনে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হেসে দিলেন। (৭৫১৯) (আধুনিক প্রকাশনীঃ ২১৭৭, ইসলামিক ফাউন্ডেশনঃ ২১৯৪)",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2349,
			"arabicnumber": 2349,
			"text": "সাহল ইবনু সা‘দ (রাঃ) হতে বর্ণিত। তিনি বলেন, জুমু‘আর দিন আসলে আমরা আনন্দিত হতাম এজন্য যে, আমাদের (প্রতিবেশী) এক বৃদ্ধা ছিলেন, তিনি আমাদের নালার ধারে লাগানো বীট গাছের মূল তুলে এনে তার ডেকচিতে রাখতেন এবং তার সাথে যবের দানাও মিশাতেন। (বর্ণনাকারী বলেন) আমার যতটুকু মনে পড়ে তিনি (সাহল) বলেছেন যে, তাতে কোন চর্বি বা তৈলাক্ত কিছু থাকত না। আমরা জুমু‘আর সালাতের পর বৃদ্ধার নিকট আসতাম এবং তিনি তা আমাদের সামনে পরিবেশন করতেন। এ কারণে জুমু‘আর দিন আমাদের খুব আনন্দ হত। আমরা জুমু‘আর সালাতের পরই আহার করতাম এবং কায়লুলাহ (বিশ্রাম) করতাম। (৯৩৮) (আধুনিক প্রকাশনীঃ ২১৭৮, ইসলামিক ফাউন্ডেশনঃ ২১৯৫)",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2350,
			"arabicnumber": 2350,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, লোকজন বলে যে, আবূ হুরাইরাহ বেশী হাদীস বর্ণনা করে থাকেন। প্রকৃতপক্ষে আল্লাহর কাছেই সবার প্রত্যাবর্তন। এবং তারা আরো বলে, মুহাজির ও আনসারদের কী হল যে, তারা আবূ হুরাইরাহর মতো এত হাদীস বর্ণনা করেন না। [আবূ হুরাইরাহ (রাঃ) বলেন,] আমার মুহাজির ভাইদেরকে বাজারে বেচা-কেনা এবং আনসার ভাইদেরকে তাদের ক্ষেত খামার ও বাগানের কাজ-কর্ম ব্যতিব্যস্ত রাখত। আমি ছিলাম একজন মিসকীন লোক। পেটে যা জুটে, খেয়ে না খেয়ে তাতেই তুষ্ট হয়ে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর কাছে পড়ে থাকতাম। তাই লোকেরা যখন অনুপস্থিত থাকত, আমি হাযির থাকতাম। লোকেরা যা ভুলে যেত, আমি তা স্মরণ রাখতাম। একদিন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তোমাদের যে কেউ আমার কথা শেষ হওয়া পর্যন্ত তার চাদর বিছিয়ে রাখবে এবং আমার কথা শেষ হলে চাদরখানা তার বুকের সাথে মিলাবে, তাহলে সে আমার কোন কথা কখনো ভুলবে না। আমি আমার পশমী চাদরটা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর কথা শেষ না হওয়া পর্যন্ত বিছিয়ে রাখলাম। সে চাদর ছাড়া আমার গায়ে আর কোন চাদর ছিল না। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর কথা শেষ হওয়ার পর আমি তা আমার বুকের সাথে মিলালাম। সে সত্তার কসম! যিনি তাঁকে সত্য দিয়ে প্রেরণ করেছেন, আজ পর্যন্ত তাঁর আমি একটি কথাও ভুলিনি। আল্লাহর কসম! যদি আল্লাহর কিতাবের এ দু’টি আয়াত না থাকত, তবে আমি কখনো তোমাদের নিকট হাদীস বর্ণনা করতাম না। (তা এই) : ﴿إِنَّ الَّذِينَ يَكْتُمُونَ مَا أَنْزَلْنَا مِنْ الْبَيِّنَاتِ وَالْهُدَى ........ الرَّحِيمُ﴾ ‘‘যারা আমার নাযিলকৃত নিদর্শনসমূহ গোপন করে ....... আল্লাহ অত্যন্ত দয়ালু পর্যন্ত’’- (আল-বাকারা ১৫৯-১৬০)। (১১৮) (আধুনিক প্রকাশনীঃ ২১৭৯, ইসলামিক ফাউন্ডেশনঃ ২১৯৬)",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 28
			}
		}
	]
}