{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"42": "Distribution of Water"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2351,
			"arabicnumber": 2351,
			"text": "بَاب فِي الشُّرْبِ ৪২/১. পানি পান সম্পর্কে। وَقَوْلِ اللهِ تَعَالَى ( وَجَعَلْنَا مِنْ الْمَاءِ كُلَّ شَيْءٍ حَيٍّ أَفَلاَ يُؤْمِنُونَ ) وَقَوْلِهِ جَلَّ ذِكْرُهُ ( أَفَرَأَيْتُمْ الْمَاءَ الَّذِي تَشْرَبُونَ أَأَنْتُمْ أَنْزَلْتُمُوهُ مِنْ الْمُزْنِ أَمْ نَحْنُ الْمُنْزِلُونَ لَوْ نَشَاءُ جَعَلْنَاهُ أُجَاجًا فَلَوْلاَ تَشْكُرُونَ ) ﴿الأُجَاجُ﴾ الْمُرُّ ﴿الْمُزْنُ﴾ السَّحَابُ মহান আল্লাহর বাণীঃ ‘‘আর আমি প্রাণবান সবকিছু সৃষ্টি করলাম পানি হতে, তবুও কি তারা ঈমান আনবে না?’’ (আম্বিয়া ৩০)। আল্লাহ তা‘আলা আরো ইরশাদ করেছেন, ‘‘তোমরা যে পানি পান কর, সে সম্পর্কে কি তোমরা চিন্তা করেছ? তোমরাই কি তা মেঘ হতে নামিয়ে আন, না আমি তা বর্ষণ করি? আমি ইচ্ছা করলে তা লবণাক্ত করে দিতে পারি। তবুও কেন তোমরা কৃতজ্ঞতা প্রকাশ কর না?’’ (ওয়াক্বিয়াহ ৬৮-৭০)। কিছু লোকের মতে পানি খায়রাত করা ও ওসীয়াত করা জায়িয, তা বণ্টন করা হোক বা না হোক।﴿الأُجَاجُ﴾ লবণাক্ত ﴿الْمُزْنُ﴾ মেঘ। وَمَنْ رَأَى صَدَقَةَ الْمَاءِ وَهِبَتَهُ وَوَصِيَّتَهُ جَائِزَةً مَقْسُومًا كَانَ أَوْ غَيْرَ مَقْسُومٍ وَقَالَ عُثْمَانُ قَالَ النَّبِيُّ صلى الله عليه وسلم مَنْ يَشْتَرِي بِئْرَ رُومَةَ فَيَكُونُ دَلْوُهُ فِيهَا كَدِلاَءِ الْمُسْلِمِينَ فَاشْتَرَاهَا عُثْمَانُ কতক লোক মত প্রকাশ করেন যে, পানি বণ্টিত হোক বা না হোক তা সদাকাহ, দান ও ওসীয়াত করা জায়িয। ‘উসমান (রাঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, রূমার কূপটি কে কিনবে? তারপর তাতে বালতি দ্বারা পানি তোলার অধিকার তার ততটুকু থাকবে, যতটুকু সাধারণ মুসলিমের থাকবে (অর্থাৎ কূপটি কিনে জনসাধারণের জন্য ওয়াক্ফ করে দিবে)। এ কথার পর উসমান (রাঃ) কূপটি কিনে নেন (এবং ওয়াকফ করে দেন)। ২৩৫১. সাহল ইবনু সা‘দ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট একটি পিয়ালা আনা হল। তিনি তা হতে পান করলেন। তখন তাঁর ডান দিকে ছিল একজন বয়ঃকনিষ্ঠ বালক আর বয়স্ক লোকেরা ছিলেন তাঁর বাম দিকে। তিনি বললেন, হে বালক! তুমি কি আমাকে অবশিষ্ট (পানিটুকু) বয়স্কদেরকে দেয়ার অনুমতি দিবে? সে বলল, হে আল্লাহর রাসূল! আপনার নিকট থেকে ফাযীলাত পাওয়ার ব্যাপারে আমি আমার চেয়ে অন্য কাউকে প্রাধান্য দিব না। অতঃপর তিনি তা তাকে প্রদান করলেন। (২৩৬৬, ২৪৫১, ২৬০২, ২৬০৫, ৫৬২০, মুসলিম ৩৬/১৭, হাঃ ২০৩০, আহমাদ ২২৮৮৭) (আধুনিক প্রকাশনীঃ ২১৮০, ইসলামিক ফাউন্ডেশনঃ ২১৯৭)",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2352,
			"arabicnumber": 2352,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর জন্য একটি বকরীর দুধ দোহন করা হল। তখন তিনি আনাস ইবনু মালিক (রাঃ)-এর ঘরে অবস্থান করছিলেন এবং সেই দুধের সঙ্গে আনাস ইবনু মালিকের বাড়ীর কূয়ার পানি মেশানো হল। তারপর পাত্রটি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে দেয়া হল। তিনি তা হতে পান করলেন। পাত্রটি তাঁর মুখ হতে আলাদা করার পর তিনি দেখলেন যে, তাঁর বাঁ দিকে আবূ বাকর ও ডান দিকে একজন বেদুঈন রয়েছে। পাত্রটি তিনি হয়ত বেদুঈনকে দিয়ে দেবেন এ আশঙ্কায় ‘উমার (রাঃ) বললেন, হে আল্লাহর রাসূল! আবূ বাকর (রাঃ) আপনারই পাশে, তাকে পাত্রটি দিন। তিনি বেদুঈনকে পাত্রটি দিলেন, যে তাঁর ডান পাশে ছিল। অতঃপর তিনি বললেন, ডান দিকের লোক বেশী হাক্বদার। (২৫৭১, ৫৬১২, ৫৬১৯, মুসলিম ৩৬/৭, হাঃ ২০২৯, আহমাদ ১২১২২) (আধুনিক প্রকাশনীঃ ২১৮১, ইসলামিক ফাউন্ডেশনঃ ২১৯৮)",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2353,
			"arabicnumber": 2353,
			"text": "لِقَوْلِ النَّبِيِّ صلى الله عليه وسلم لاَ يُمْنَعُ فَضْلُ الْمَاءِ কেননা, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, অতিরিক্ত পানি ব্যবহার করতে যেন কাউকে নিষেধ করা না হয়। ২৩৫৩. আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, ঘাস উৎপাদন হতে বিরত রাখার উদ্দেশে প্রয়োজনের অতিরিক্ত পানি রুখে রাখা যাবে না। (২৩৫৪, ৬৯৬২, মুসলিম ২২/৮, হাঃ ১৫৬৬, আহমাদ ৮৩২৮) (আধুনিক প্রকাশনীঃ ২১৮২, ইসলামিক ফাউন্ডেশনঃ ২১৯৯)",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2354,
			"arabicnumber": 2354,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, অতিরিক্ত ঘাসে বাধা সৃষ্টির উদ্দেশে অতিরিক্ত পানি রুখে রাখবে না। (২৩৫৩, মুসলিম ২২/৮, হাঃ ১৫৬৬) (আধুনিক প্রকাশনীঃ ২১৮৩, ইসলামিক ফাউন্ডেশনঃ ২২০০)",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2355,
			"arabicnumber": 2355,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, খনি ও কূপে কাজ করা অবস্থায় অথবা জন্তু-জানোয়ারের আঘাতে মারা গেলে ক্ষতিপূরণ দিতে হবে না এবং রিকায (খনিজ দ্রব্যে) পঞ্চমাংশ দিতে হবে। (১৪৯৯) (আধুনিক প্রকাশনীঃ ২১৮৪, ইসলামিক ফাউন্ডেশনঃ ২২০১)",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2357,
			"arabicnumber": 2357,
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2358,
			"arabicnumber": 2358,
			"text": "আবূ হুরাইরাহ (রাঃ) থেকে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, কিয়ামতের দিন তিন শ্রেণীর লোকের প্রতি আল্লাহ তা‘আলা দৃষ্টিপাত করবেন না এবং তাদের পবিত্র করবেন না। আর তাদের জন্য রয়েছে যন্ত্রণাদায়ক শাস্তি। এক ব্যক্তি- যার নিকট প্রয়োজনের অতিরিক্ত পানি আছে, অথচ সে মুসাফিরকে তা দিতে অস্বীকার করে। অন্য একজন সে ব্যক্তি, যে ইমামের হাতে একমাত্র দুনিয়ার স্বার্থে বায়‘আত হয়। যদি ইমাম তাকে কিছু দুনিয়াবী সুযোগ দেন, তাহলে সে খুশী হয়, আর যদি না দেন তবে সে অসন্তুষ্ট হয়। অন্য একজন সে ব্যক্তি, যে আসরের সালাত আদায়ের পর তার জিনিসপত্র (বিক্রয়ের উদ্দেশে) তুলে ধরে আর বলে যে, আল্লাহর কসম, যিনি ছাড়া অন্য কোন মাবূদ নেই, আমার এই দ্রব্যের মূল্য এত এত দিতে আগ্রহ করা হয়েছে। (কিন্তু আমি বিক্রি করিনি) এতে এক ব্যক্তি তাকে বিশ্বাস করে (তা ক্রয় করে নেয়)। এরপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এই আয়াতটি তিলাওয়াত করেন: (إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللهِ وَأَيْمَانِهِمْ ثَمَنًا قَلِيلاً) ‘‘যারা আল্লাহর সঙ্গে কৃত প্রতিশ্রুতি এবং নিজেদের শপথকে তুচ্ছ মূল্যে বিক্রয় করে’’- (আলে ইমরান ৭৭)। (২৩৬৯,৭২১২, ২৬৭২,৭৪৪৬, মুসলিম ৪৩/৩৬, হাঃ ২৩৫৭, আহমাদ ১৪১৯) (আধুনিক প্রকাশনীঃ ২১৮৬, ইসলামিক ফাউন্ডেশনঃ ২২০৩)",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2359,
			"arabicnumber": 2359,
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2361,
			"arabicnumber": 2361,
			"text": "‘উরওয়াহ (রহ.) হতে বর্ণিত। তিনি বলেন, যুবাইর (রাঃ) এক আনসারীর সঙ্গে ঝগড়া করলে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, হে যুবাইর! জমিতে পানি সেচের পর তা ছেড়ে দাও। এতে আনসারী বলল, সে তো আপনার ফুফাতো ভাই। এ কথা শুনে তিনি সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, হে যুবাইর! পানি বাঁধে পৌঁছা পর্যন্ত সেচ দিতে থাক। তারপর বন্ধ করে দাও। যুবাইর (রাঃ) বলেন, আমার ধারণা এ আয়াতটি এ সম্পর্কে নাযিল হয়েছেঃ ‘‘তোমার রবের কসম, তারা মু’মিন হবে না যতক্ষণ পর্যন্ত তারা তাদের নিজেদের বিবাদ-বিসম্বাদের বিচার-ভার আপনার উপর অর্পণ না করে’’- (আন-নিসা ৬৫)। (২৩৫৯) (আধুনিক প্রকাশনীঃ ২১৮৮, ইসলামিক ফাউন্ডেশনঃ ২২০৫)",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2362,
			"arabicnumber": 2362,
			"text": "‘উরওয়াহ ইবনু যুবাইর (রাঃ) হতে বর্ণিত। তিনি বলেন, একজন আনসারী হার্রার নালার পানি নিয়ে যুবাইরের সাথে ঝগড়া করল, যে পানি দিয়ে তিনি খেজুর বাগান সেচ দিতেন। এ বিষয়ে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, হে যুবাইর! সেচ দিতে থাক। তারপর নিয়ম-নীতি অনুযায়ী তিনি তাকে নির্দেশ দিলেন, তারপর তা তোমার প্রতিবেশীর জন্য ছেড়ে দাও। এতে আনসারী বলল, সে আপনার ফুফাতো ভাই তাই। এ কথায় আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর চেহারা মুবারক বিবর্ণ হয়ে গেল। তখন তিনি বললেন, সেচ দাও। পানি ক্ষেতের বাঁধ পর্যন্ত পৌঁছে গেলে বন্ধ করে দাও। যুবাইরকে তিনি তার পুরা হক দিলেন। যুবাইর (রাঃ) বলেন, আল্লাহর কসম, এ আয়াত এ সম্পর্কে নাযিল হয়ঃ ‘‘তোমার প্রতিপালকের কসম, তারা মু’মিন হবে না, যতক্ষণ পর্যন্ত তারা তাদের নিজেদের বিবাদ-বিসম্বাদের বিচার-ভার আপনার উপর অর্পণ না করে’’। বর্ণনাকারী বলেন, ইবনু শিহাবের বর্ণনা হচ্ছে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর এ কথা ‘পানি নেয়ার পর বাঁধ অবধি পৌঁছার পর তা বন্ধ রাখ’। আনসার এবং অন্যান্য লোকেরা এর পরিমাণ করে দেখেছেন যে, তা টাখনু পর্যন্ত পৌঁছে। (২৩৫৯) (আধুনিক প্রকাশনীঃ ২১৮৯, ইসলামিক ফাউন্ডেশনঃ ২২০৬)",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2363,
			"arabicnumber": 2363,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, একজন লোক রাস্তা দিয়ে চলতে চলতে তার ভীষণ পিপাসা লাগল। সে কূপে নেমে পানি পান করল। এরপর সে বের হয়ে দেখতে পেল যে, একটা কুকুর হাঁপাচ্ছে এবং পিপাসায় কাতর হয়ে মাটি চাটছে। সে ভাবল, কুকুরটারও আমার মতো পিপাসা লেগেছে। সে কূপের মধ্যে নামল এবং নিজের মোজা ভরে পানি নিয়ে মুখ দিয়ে সেটি ধরে উপরে উঠে এসে কুকুরটিকে পানি পান করাল। আল্লাহ তা‘আলা তার আমল কবূল করলেন এবং আল্লাহ তার গোনাহ মাফ করে দেন। সাহাবীগণ বললেন, হে আল্লাহর রাসূল! চতুষ্পদ জন্তুর উপকার করলেও কি আমাদের সাওয়াব হবে? তিনি বললেন, প্রত্যেক প্রাণীর উপকার করাতেই পুণ্য রয়েছে। (১৭৩, মুসলিম ৩৯/৪১, হাঃ ২২৪৪, আহমাদ ৮৮৮৩) (আধুনিক প্রকাশনীঃ ২১৯০, ইসলামিক ফাউন্ডেশনঃ ২২০৭)",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2364,
			"arabicnumber": 2364,
			"text": "আসমা বিনতু আবূ বাকর (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সূর্য গ্রহণের সালাত আদায় করলেন। তারপর বললেন, জাহান্নাম আমার নিকটবর্তী করা হলে আমি বললাম, হে রব! আমিও কি এই জাহান্নামীর সাথী হব? এমতাবস্থায় একজন মহিলা আমার নযরে পড়ল। বর্ণনাকারী বলেন, আমার ধারণা, তিনি বলেছেন, বিড়াল তাকে (মহিলা খামছাচ্ছিল। তিনি জিজ্ঞেস করলেন, এ মহিলার কী হল? ফেরেশতারা জবাব দিলেন, সে একটি বিড়াল বেঁধে রেখেছিল, যার কারণে বিড়ালটি ক্ষুধায় মারা যায়। (৭৪৫) (আধুনিক প্রকাশনীঃ ২১৯১, ইসলামিক ফাউন্ডেশনঃ ২২০৮)",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2365,
			"arabicnumber": 2365,
			"text": "‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, একজন মহিলাকে একটি বিড়ালের কারণে আযাব দেয়া হয়। সে বিড়ালটি বেঁধে রেখেছিল, অবশেষে বিড়ালটি ক্ষুধায় মারা যায়। এ কারণে মহিলা জাহান্নামে প্রবেশ করল। বর্ণনাকারী বলেন, তিনি [রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ] বলেন, আল্লাহ ভালো জানেন, বাঁধা থাকাকালীন তুমি তাকে না খেতে দিয়েছিলে, না পান করতে দিয়েছিলে এবং না তুমি তাকে ছেড়ে দিয়েছিলে, তা হলে সে জমিনের পোকা-কামড় খেয়ে বেঁচে থাকত। (৩৩১৮, ৩৪৮২, মুসলিম ৩৯/৪০, হাঃ ২২৪২) (আধুনিক প্রকাশনীঃ ২১৯২, ইসলামিক ফাউন্ডেশনঃ ২২০৯)",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2366,
			"arabicnumber": 2366,
			"text": "সাহল ইবনু সা‘দ (রহ.) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট একটি পানির পেয়ালা আনা হল। তিনি তা হতে পানি পান করলেন। তাঁর ডানদিকে একজন বালক ছিল, সে ছিল লোকদের মধ্যে সবচেয়ে কম বয়স্ক এবং বয়োজ্যেষ্ঠ লোকেরা তাঁর বাঁ দিকে ছিল। তিনি সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, হে বৎস! তুমি কি আমাকে জ্যেষ্ঠদের এটি দিতে অনুমতি দিবে? সে বলল, হে আল্লাহর রাসূল! আমি আপনার উচ্ছিষ্টের ব্যাপারে নিজের উপর কাউকে প্রাধান্য দিতে চাই না। এরপর তিনি তাকেই সেটি দিলেন। (২৩৫১) (আধুনিক প্রকাশনীঃ ২১৯৩, ইসলামিক ফাউন্ডেশনঃ ২২১০)",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2367,
			"arabicnumber": 2367,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, সেই সত্তার কসম যাঁর হাতে আমার প্রাণ, আমি নিশ্চয়ই (কিয়ামতের দিন) আমার হাউজ (কাউসার) হতে কিছু লোকদেরকে এমনভাবে তাড়াব, যেমন অপরিচিত উট হাউজ হতে তাড়ানো হয়। (মুসলিম ৪৩/৯, হাঃ ২৩০২) (আধুনিক প্রকাশনীঃ ২১৯৪, ইসলামিক ফাউন্ডেশনঃ ২২১১)",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2368,
			"arabicnumber": 2368,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, ইসমাঈল (আঃ)-এর মা হাজিরা (আ.)-এর উপর আল্লাহ রহম করুন। কেননা, যদি তিনি যামযামকে স্বাভাবিক অবস্থায় ছেড়ে দিতেন অথবা তিনি বলেছেন, যদি তা হতে অঞ্চলে পানি না নিতেন, তা হলে তা একটি প্রবাহিত ঝরণায় পরিণত হত। জুরহাম গোত্র তাঁর নিকট এসে বলল, আপনি কি আমাদেরকে আপনার নিকট অবস্থান করার অনুমতি দিবেন? তিনি (হাজিরা) বললেন, হ্যাঁ। তবে পানির উপর তোমাদের কোন অধিকার থাকবে না। তারা বলল, ঠিক আছে। (৩৩৬২, ৩৩৬৩, ৩৩৬৪, ৩৩৬৫) (আধুনিক প্রকাশনীঃ ২১৯৫, ইসলামিক ফাউন্ডেশনঃ ২২১২)",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2369,
			"arabicnumber": 2369,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তিন শ্রেণীর লোকের সাথে আল্লাহ তা‘আলা কিয়ামতের দিন কথা বলবেন না এবং তাদের প্রতি তাকাবেনও না। (এক) যে ব্যক্তি কোন মাল সামানের ব্যাপারে মিথ্যা কসম খেয়ে বলে যে, এর দাম এর চেয়ে বেশী বলেছিল কিন্তু তা সত্ত্বেও সে তা বিক্রি করেনি। (দুই) যে ব্যক্তি আসরের সালাতের পর একজন মুসলিমের মাল-সম্পত্তি আত্মসাৎ করার উদ্দেশে মিথ্যা কসম করে। (তিন) যে ব্যক্তি তার প্রয়োজনের অতিরিক্ত পানি মানুষকে দেয় না। আল্লাহ তা‘আলা বলবেন (কিয়ামতের দিন) আজ আমি আমার অনুগ্রহ হতে তোমাকে বঞ্চিত রাখব যেরূপ তুমি তোমার প্রয়োজনের অতিরিক্ত পানি হতে বঞ্চিত রেখেছিলে অথচ তা তোমার হাতের তৈরী নয়। ‘আলী (রহ.) আর সালিহ (রহ.) হতে বর্ণিত যে, তিনি হাদীসের সনদটি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পর্যন্ত পৌঁছিয়েছেন। (২৩৫৮) (আধুনিক প্রকাশনীঃ ২১৯৬, ইসলামিক ফাউন্ডেশনঃ ২২১৩)",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2370,
			"arabicnumber": 2370,
			"text": "সা‘ব ইবনু জাসসামাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, চারণভূমি সংরক্ষিত করা আল্লাহ ও তাঁর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ছাড়া আর কারো অধিকারে নেই। তিনি (রাবী) বলেন, আমাদের নিকট রিওয়ায়াত পৌঁছেছে যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নাকী‘র চারণভূমি (নিজের জন্য) সংরক্ষিত করেছিলেন, আর ‘উমার (রাঃ) সারাফ ও রাবাযার চারণভূমি সংরক্ষণ করেছিলেন। (৩০১৩) (আধুনিক প্রকাশনীঃ ২১৯৭, ইসলামিক ফাউন্ডেশনঃ ২২১৪)",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2371,
			"arabicnumber": 2371,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, ঘোড়া একজনের জন্য সাওয়াব, একজনের জন্য ঢাল এবং আরেকজনের জন্য পাপ। সাওযাব হয় তার জন্য, যে আল্লাহর রাস্তায় তা জিহাদের উদ্দেশে বেঁধে রাখে এবং সে ঘোড়ার রশি চারণভূমি বা বাগানে লম্বা করে দেয়। এমতাবস্থায় সে ঘোড়া চারণভূমি বা বাগানে তার রশির দৈর্ঘ্য পরিমাণ যতটুকু চরবে, সে ব্যক্তির জন্য সে পরিমাণ সাওয়াব হবে। যদি তার রশি ছিঁড়ে যায় এবং সে একটি কিংবা দু’টি টিলা অতিক্রম করে, তাহলে তার প্রতিটি পদচিহ্ন ও তার গোবর মালিকের জন্য সাওয়াব হিসেবে গণ্য হবে। আর যদি তা কোন নহরের পাশ দিয়ে যায় এবং মালিকের ইচ্ছা ব্যতিরেকে সে তা হতে পানি পান করে, তাহলে এ জন্য মালিক সাওয়াব পাবে। আর ঢাল স্বরূপ সে লোকের জন্য, যে পরমুখাপেক্ষিতা ও ভিক্ষাবৃত্তি থেকে অব্যাহতি পাওয়ার জন্য তাকে বেঁধে রাখে। তারপর এর পিঠে ও গর্দানে আল্লাহর নির্ধারিত হক আদায় করতে ভুল করে না। গুনাহর কারণ সে লোকের জন্য, যে তাকে অহঙ্কার ও লোক দেখাবার কিংবা মুসলিমদের প্রতি শত্রুতার উদ্দেশে বেঁধে রাখে। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে গাধা সম্পর্কে জিজ্ঞেস করা হলে তিনি বলেন, এ ব্যাপারে আমার প্রতি কোন আয়াত নাযিল হয়নি। তবে এ ব্যাপারে একটি পরিপূর্ণ ও অন্যান্য আয়াত রয়েছে। (তা হলো আল্লাহ তা‘আলার এ বাণী) ‘‘কেউ অণু পরিমাণ সৎকর্ম করলে সে তা দেখতে পাবে এবং কেউ অণু পরিমাণ অসৎকর্ম করলে সে তাও দেখতে পাবে’’- (যিলযালঃ ৭-৮)। (২৮৬০, ৩৬৪৬, ৪৯৬২, ৪৯৬৩, ৭৩৫৬) (আধুনিক প্রকাশনীঃ ২১৯৮, ইসলামিক ফাউন্ডেশনঃ ২২১৫)",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2372,
			"arabicnumber": 2372,
			"text": "যায়দ ইবনু খালিদ (রাঃ) হতে বর্ণিত। তিনি বলেন, জনৈক ব্যক্তি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট এসে পড়ে থাকা জিনিস সম্পর্কে জিজ্ঞেস করল। তিনি বললেন, থলেটি এবং তার মুখের বন্ধনটি চিনে রাখ। তারপর এক বছর পর্যন্ত তা ঘোষণা করতে থাক। যদি তার মালিক এসে যায় তো ভাল। তা না হলে সে ব্যাপারে তুমি যা ভাল মনে কর তা করবে। সে আবার জিজ্ঞেস করল, হারানো বকরি কী করব? তিনি বললেন, সেটি হয় তোমার, না হয় তোমার ভাইয়ের, না হয় নেকড়ে বাঘের। সে আবার জিজ্ঞেস করল, হারানো উট হলে কী করব? তিনি বললেন, তাতে তোমার প্রয়োজন কী? তার সঙ্গে তার মশ্ক ও খুর রয়েছে। সে জলাশয়ে উপস্থিত হবে এবং গাছপালা খাবে, শেষ পর্যন্ত তার মালিক তাকে পেয়ে যাবে। (৯১, মুসলিম ৩১ অধ্যায়ের প্রথমে, হাঃ ১৭২২, আহমাদ ১৭০৪৯) (আধুনিক প্রকাশনীঃ ২১৯৯, ইসলামিক ফাউন্ডেশনঃ ২২১৬)",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2373,
			"arabicnumber": 2373,
			"text": "যুবাইর ইবনু আওয়াম (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমাদের কেউ রশি নিয়ে খড়ির আঁটি বেঁধে তা বিক্রি করে, এতে আল্লাহ তা‘আলা তার সম্মান রক্ষা করেন, এটা তার জন্য মানুষের কাছে ভিক্ষা করার চেয়ে উত্তম! লোকজনের নিকট এমন চাওয়ার চেয়ে, যে চাওয়ায় কিছু পাওয়া যেতে পারে বা নাও পারে। (১৪৭১) (আধুনিক প্রকাশনীঃ ২২০০, ইসলামিক ফাউন্ডেশনঃ ২২১৭)",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2374,
			"arabicnumber": 2374,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, কারো নিকট সাওয়াল করা, যাতে সে তাকে কিছু দিতেও পারে, আবার নাও দিতে পারে, এর চেয়ে পিঠে বোঝা বহন করা (তা বিক্রি করা) উত্তম। (১৪৭০) (আধুনিক প্রকাশনীঃ ২২০১, ইসলামিক ফাউন্ডেশনঃ ২২১৮)",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2375,
			"arabicnumber": 2375,
			"text": "‘আলী ইবনু আবূ তালিব (রাঃ) হতে বর্ণিত। তিনি বলেন, বদরের যুদ্ধে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সঙ্গে আমি গনীমতের মাল হিসাবে একটি উট লাভ করি। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে আরো একটি উট দেন। একদিন আমি উট দু’টিকে একজন আনসারীর ঘরের দরজায় বসাই। আমার ইচ্ছা ছিল এদের উপর ইযখির (এক ধরনের ঘাস) চাপিয়ে তা বিক্রি করতে নিয়ে যাব। আমার সাথে বনূ কায়নুকার একজন স্বর্ণকার ছিল। আমি এর (ইযখির বিক্রি লব্ধ টাকা) দ্বারা ফাতিমা (রাঃ)-এর ওলীমাহ করতে সমর্থ হব। সে ঘরে হামযাহ ইবনু আবদুল মুত্তালিব (রাঃ) শরাব পান করছিলেন। আর তাঁর সাথে একজন গায়িকাও ছিল। সে বলল, হে হামযাহ! তৈরী হও, মোটা উটগুলোর উদ্দেশে। এরপর হামযাহ (রাঃ) উট দু’টোর দিকে তরবারি নিয়ে ঝাঁপিয়ে পড়েন এবং তাদের কুজ দু’টিও কেটে নিলেন এবং পেট ফেড়ে উভয়ের কলিজা বের করে নিলেন। বর্ণনাকারী বলেন, আমি ইবনু শিহাব (রহ.)-কে জিজ্ঞেস করি, কুজ কি করা হল? তিনি বলেন, সেটি কেটে নিয়ে গেলেন। ইবনু শিহাব বলেন, ‘আলী বলেছেন, এই দৃশ্য দেখলাম এবং তা আমাকে ঘাবড়িয়ে দিল। এরপর আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট আসলাম। তাঁর নিকট তখন যায়দ ইবনু হারিসাহ (রাঃ) উপস্থিত ছিলেন। আমি তাঁকে খবর বললাম। তিনি বের হলেন এবং তাঁর সঙ্গে ছিলেন যায়দ (রাঃ)। আমিও তাঁর সঙ্গে গেলাম। তিনি হামযা (রাঃ)-এর নিকট উপস্থিত হলেন এবং তার প্রতি ক্রোধ প্রকাশ করলেন। হামযাহ দৃষ্টি উঁচু করে তাঁদের দিকে তাকালেন। আর বললেন, তোমরা আমার বাপ-দাদার দাস বটে। হামযাহ (রাঃ)-এর এ অবস্থা দেখে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পিছনে সরে তাদের নিকট হতে চলে আসলেন। ঘটনাটি শরাব হারাম হওয়ার পূর্বের। (২০৮৯) (আধুনিক প্রকাশনীঃ ২২০২, ইসলামিক ফাউন্ডেশনঃ ২২১৯)",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2376,
			"arabicnumber": 2376,
			"text": "আনাস (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আনসারদেরকে বাহরাইনে কিছু জায়গীর দিতে চাইলেন। তারা বলল, আমাদের মুহাজির ভাইদেরও আমাদের মতো জায়গীর না দেয়া পর্যন্ত আমাদের জন্য জায়গীর দিবেন না। তিনি বলেন, আমার পরে শীঘ্রই তোমরা দেখবে, তোমাদের উপর অন্যদেরকে প্রাধান্য দেয়া হচ্ছে। তখন তোমরা সবর করবে, যে পর্যন্ত না তোমরা আমার সঙ্গে মিলিত হও। (২৩৮৮, ৩১৬৩, ৩৭৯৪) (আধুনিক প্রকাশনীঃ ২২০৩, ইসলামিক ফাউন্ডেশনঃ ২২২০)",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2377,
			"arabicnumber": 2377,
			"text": "আনাস (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আনসারদেরকে বাহরাইনে জায়গীর দেয়ার জন্য ডাকলেন। তারা বললেন, হে আল্লাহর রাসূল! আপনি যদি তা করেন, তা হলে আমাদের কুরাইশ ভাইদের জন্যও অনুরূপ জায়গীর লিখে দেন। কিন্তু নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট তখন তা ছিল না। তারপর তিনি বলেন, আমার পর শীঘ্রই দেখবে, তোমাদের উপর অন্যদের প্রাধান্য দেয়া হচ্ছে। তখন তোমরা সবর করবে, আমার সঙ্গে মিলিত হওয়া (মৃত্যু) পর্যন্ত। (২৩৭৬) (আধুনিক প্রকাশনীঃ কিতাবুল মুসাকাত অনুচ্ছেদ-১৬, ইসলামিক ফাউন্ডেশনঃ অনুচ্ছেদ ১৪৮০)",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2378,
			"arabicnumber": 2378,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, উটের হক্ব হচ্ছে, পানির কাছে তার দুধ দোহন করা। (১৪০২) (আধুনিক প্রকাশনীঃ ২২০৪, ইসলামিক ফাউন্ডেশনঃ ২২২১)",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2379,
			"arabicnumber": 2379,
			"text": "قَالَ النَّبِيُّ صلى الله عليه وسلم مَنْ بَاعَ نَخْلاً بَعْدَ أَنْ تُؤَبَّرَ فَثَمَرَتُهَا لِلْبَائِعِ فَلِلْبَائِعِ الْمَمَرُّ وَالسَّقْيُ حَتَّى يَرْفَعَ وَكَذَلِكَ رَبُّ الْعَرِيَّةِ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, কোন ব্যক্তি যদি খেজুর গাছের তা’বীর (স্ত্রী পুষ্পরেণু সংমিশ্রণ) করার পর তা বিক্রি করে, তাহলে তার ফল বিক্রেতার, চলার পথও পানির কূপ বিক্রেতার, যতক্ষণ ফল তুলে নেয়া না হয়। আরিয়্যার মালিকেরও এই হুকুম। ২৩৭৯. ‘আবদুল্লাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে বলতে শুনেছি, যে ব্যক্তি খেজুর গাছ তা‘বীর করার পর গাছ বিক্রয় করে, তার ফল বিক্রেতার। কিন্তু ক্রেতা শর্ত করলে তা তারই। আর যদি কেউ গোলাম বিক্রয় করে এবং তার সম্পদ থাকে তবে সে সম্পদ যে বিক্রি করল তার। কিন্তু যদি ক্রেতা শর্ত করে তাহলে তা হবে তার। মালিক (রহ.) ...... ‘উমার (রাঃ) হতে গোলাম বিক্রয়ের ব্যাপারে অনুরূপ বর্ণিত হয়েছে। (২২০৩) (আধুনিক প্রকাশনীঃ ২২০৫, ইসলামিক ফাউন্ডেশনঃ ২২২২)",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2380,
			"arabicnumber": 2380,
			"text": "যায়দ ইবনু সাবিত (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অনুমান করে শুকনো খেজুরের বিনিময়ে আরায়্যা করার অনুমতি দিয়েছেন। (২১৭৩) (আধুনিক প্রকাশনীঃ ২২০৬, ইসলামিক ফাউন্ডেশনঃ ২২২৩)",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2381,
			"arabicnumber": 2381,
			"text": "জাবির ইবনু ‘আবদুল্লাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মুখাবারা, মুহাকালা ও শুকনো খেজুরের বিনিময়ে গাছের খেজুর বিক্রি করতে এবং ফল উপযুক্ত হওয়ার আগে তা বিক্রি করতে নিষেধ করেছেন। গাছে থাকা অবস্থায় ফল দ্বীনার এবং দিরহামের বিনিময়ে ছাড়া যেন বিক্রি করা না হয়। তবে আরায়্যার অনুমতি দিয়েছেন। (১৪৮৭, মুসলিম ২১/১৬, হাঃ ১৫৩৬, আহমাদ ১৪৮৮২) (আধুনিক প্রকাশনীঃ ২২০৭, ইসলামিক ফাউন্ডেশনঃ ২২২৪)",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2382,
			"arabicnumber": 2382,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অনুমান করে শুকনো খেজুরের বিনিময়ে পাঁচ ওসাক কিংবা তার চেয়ে কম আরায়্যার বিক্রির অনুমতি দিয়েছেন। বর্ণনাকারী দাউদ এ বিষয়ে সন্দেহ করেছেন। (২১৯) (আধুনিক প্রকাশনীঃ ২২০৮, ইসলামিক ফাউন্ডেশনঃ ২২২৫)",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2383,
			"arabicnumber": 2383,
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 31
			}
		}
	]
}