{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"49": "Manumission of Slaves"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2517,
			"arabicnumber": 2517,
			"text": "وَقَوْلِهِ تَعَالَى ( فَكُّ رَقَبَةٍ أَوْ إِطْعَامٌ فِي يَوْمٍ ذِي مَسْغَبَةٍ يَتِيمًا ذَا مَقْرَبَةٍ ) আল্লাহ তা‘আলার বাণীঃ ‘‘ক্রীতদাস মুক্তি অথবা দুর্ভিক্ষের দিনে ইয়াতীম আত্মীয়কে অন্নদান।’’ (বালাদ (৯০) : ১৩) ২৫১৭. আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, কেউ কোন মুসলিম ক্রীতদাস মুক্ত করলে আল্লাহ সেই ক্রীতদাসের প্রত্যেক অঙ্গের বিনিময়ে তার এক একটি অঙ্গ (জাহান্নামের) আগুন হতে মুক্ত করবেন। সাঈদ ইবনু মারজানা (রাঃ) বলেন, এ হাদীসটি আমি আলী ইবনু হুসাইনের খিদমতে পেশ করলাম। তখন ‘আলী ইবনু হুসাইন (রাঃ) তাঁর এক ক্রীতদাসের কাছে উঠে গেলেন যার বিনিময়ে ‘আবদুল্লাহ ইবনু জা‘ফার (রাঃ) তাকে দশ হাজার দিরহাম কিংবা এক হাজার দ্বীনার দিতে চেয়েছিলেন এবং তিনি তাকে মুক্ত করে দিলেন। (৬৭১৫) (আধুনিক প্রকাশনীঃ ২৩৩৪, ইসলামিক ফাউন্ডেশনঃ ২৩৫১)",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2518,
			"arabicnumber": 2518,
			"text": "আবূ যার (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে আমি জিজ্ঞেস করলাম, কোন্ ‘আমল উত্তম? তিনি বললেন, আল্লাহর প্রতি ঈমান আনা এবং তাঁর পথে জিহাদ করা। আমি জিজ্ঞেস করলাম, কোন্ ধরনের ক্রীতদাস মুক্ত করা উত্তম? তিনি বললেন, যে ক্রীতদাসের মূল্য অধিক এবং যে ক্রীতদাস তার মনিবের কাছে অধিক আকর্ষণীয়। আমি জিজ্ঞেস করলাম, এ যদি আমি করতে না পারি? তিনি বললেন, তাহলে কাজের লোককে (তার কাজে) সাহায্য করবে কিংবা বেকারকে কাজ দিবে। আমি (আবারও) বললাম, এও যদি না পারি? তিনি বললেন, মানুষকে তোমার অনিষ্টতা হতে মুক্ত রাখবে। বস্তুতঃ এটা তোমার নিজের জন্য তোমার পক্ষ হতে সাদাকাহ। (আধুনিক প্রকাশনীঃ ২৩৩৫, ইসলামিক ফাউন্ডেশনঃ ২৩৫২)",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2519,
			"arabicnumber": 2519,
			"text": "আসমা বিনতু আবূ বাকর (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সূর্যগ্রহণের সময় ক্রীতদাস মুক্ত করার নির্দেশ দিয়েছেন। আলী (রহ.) দরাওয়ারদী (রহ.) সূত্রে হিশাম (রহ.) হাদীস বর্ণনায় মূসা ইবনু মাস‘ঊদ (রাঃ)-এর অনুসরণ করেছেন। (৮৬) (আধুনিক প্রকাশনীঃ ২৩৩৬, ইসলামিক ফাউন্ডেশনঃ ২৩৫৩)",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2520,
			"arabicnumber": 2520,
			"text": "আসমা বিনতু আবূ বাকর (রাঃ) হতে বর্ণিত। তিনি বলেন, সূর্য গ্রহণের সময় আমাদেরকে ক্রীতদাস মুক্ত করার নির্দেশ দেয়া হত। (৮৬) (আধুনিক প্রকাশনীঃ ২৩৩৭, ইসলামিক ফাউন্ডেশনঃ ২৩৫৪)",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2521,
			"arabicnumber": 2521,
			"text": "সালিমের পিতা [ইবনু ‘উমার (রাঃ)] হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যে ব্যক্তি দু’জনের মালিকানাধীন ক্রীতদাস মুক্ত করে, সে সচ্ছল হলে প্রথমে ক্রীতদাসের মূল্য নির্ধারণ করা হবে, তারপর মুক্ত করবে। (২৪৯১) (আধুনিক প্রকাশনীঃ ২৩৩৮, ইসলামিক ফাউন্ডেশনঃ ২৩৫৫)",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2522,
			"arabicnumber": 2522,
			"text": "‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) হতে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, কেউ যদি কোন ক্রীতদাস হতে নিজের অংশ মুক্ত করে আর ক্রীতদাসের মূল্য পরিমাণ অর্থ তার কাছে থাকে, তবে তার উপর দায়িত্ব হবে ক্রীতদাসের ন্যায্য মূল্য নির্ণয় করা। তারপর সে শরীকদেরকে তাদের প্রাপ্য অংশ পরিশোধ করবে এবং ক্রীতদাসটি তার পক্ষ হতে মুক্ত হয়ে যাবে, কিন্তু (সে পরিমাণ অর্থ) না থাকলে তার পক্ষ হতে ততটুকুই মুক্ত হবে যতটুকু সে মুক্ত করেছে। (২৪৯১) (আধুনিক প্রকাশনীঃ ২৩৩৯, ইসলামিক ফাউন্ডেশনঃ ২৩৫৬)",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2523,
			"arabicnumber": 2523,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, কেউ কোন (শরীকী) ক্রীতদাস হতে নিজের অংশ মুক্ত করলে ঐ ক্রীতদাসের সম্পূর্ণটা মুক্ত করা তার জন্য অপরিহার্য হয়ে পড়বে, যদি তার কাছে সেই ক্রীতদাসের মূল্য পরিমাণ অর্থ থাকে। আর যদি তার কাছে কোন অর্থ না থাকে তাহলে তার দায়িত্ব হবে আযাদকৃত (গোলামের) ন্যায্যমূল্য নির্ধারণ করা। এতে আযাদকারীর পক্ষ হতে ততটুকুই মুক্ত হবে, যতটুকু সে মুক্ত করেছে। মুসাদ্দাদ (রহ.) বিশর ইবনু মুফায্যাল (রহ.) সূত্রে ‘উবায়দুল্লাহ (রহ.) থেকে উক্ত হাদীসটি সংক্ষিপ্তভাবে বর্ণিত আছে। (২৪৯১) (আধুনিক প্রকাশনীঃ ২৩৪০, ইসলামিক ফাউন্ডেশনঃ ২৩৫৭)",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2524,
			"arabicnumber": 2524,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, কেউ কোন (শরীকী) ক্রীতদাস হতে নিজের অংশ মুক্ত করে দিলে এবং ক্রীতদাসের ন্যায্যমূল্য পরিমাণ অর্থ তার কাছে থাকলে, সেই ক্রীতদাস সম্পূর্ণ মুক্ত হয়ে যাবে। নাফি‘ (রহ.) বলেন, আর সেই পরিমাণ অর্থ না থাকলে যতটুকু সে মুক্ত করবে তারপক্ষ হতে ততটুকুই মুক্ত হবে। রাবী আইউব (রহ.) বলেন, আমি জানি না, এটা কি নাফী‘ (রহ.) নিজ হতে বলেছেন, না এটাও হাদীসের অন্তর্ভুক্ত। (আধুনিক প্রকাশনীঃ ২৩৪১, ইসলামিক ফাউন্ডেশনঃ ২৩৫৮)",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2525,
			"arabicnumber": 2525,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি শরীকী ক্রীতদাস বা বাঁদী সম্পর্কে ফাতওয়া দিতেন যে, শরীকী ক্রীতদাস শরীকদের কেউ নিজের অংশ মুক্ত করে দিলে তিনি বলতেন, সম্পূর্ণ ক্রীতদাসটাই আযাদ করা তার উপর ওয়াজিব হয়ে গেছে। যদি আযাদকারীর কাছে ক্রীতদাসের মূল্য পরিমাণ অর্থ থাকে, তাহলে সে অর্থ হতে ক্রীতদাসের ন্যায্যমূল্য নির্ণয় করা হবে এবং শরীকদেরকে তাদের প্রাপ্য অংশ পরিশোধ করা হবে, আর আযাদকৃত ক্রীতদাস পূর্ণ মুক্ত হয়ে যাবে। বক্তব্যটি ইবনু ‘উমার (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেন। (আধুনিক প্রকাশনীঃ ২৩৪২, ইসলামিক ফাউন্ডেশনঃ ২৩৫৯ প্রথমাংশ) এবং লাইস, ইবনু আবূ যি‘ব, ইবনু ইসহাক জুওয়াইরিয়া, ইয়াহ্ইয়া ইবনু সাঈদ ও ইসমাঈল ইবনু উমাইয়া (রহ.) নাফি‘ (রহ.)-এর মাধ্যমে ইবনু ‘উমার (রাঃ) সূত্রে নবী হতে হাদীসটি সংক্ষিপ্তভাবে বর্ণনা করেছেন। (২৪৯১) (আধুনিক প্রকাশনীঃ নেই, ইসলামিক ফাউন্ডেশনঃ ২৩৫৯ শেষাংশ)",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2526,
			"arabicnumber": 2526,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেছেন, ‘‘কেউ শরীকী ক্রীতদাস হতে নিজের ভাগ বা অংশ (রাবীর দ্বিধা) মুক্ত করে দিলে .......’’। (২৪৯২) (আধুনিক প্রকাশনীঃ নাই, ইসলামিক ফাউন্ডেশনঃ নেই)",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2527,
			"arabicnumber": 2527,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেছেন, কেউ শরীকী ক্রীতদাস হতে নিজের ভাগ বা অংশ (রাবীর দ্বিধা) মুক্ত করে দিলে অর্থ ব্যয়ে সেই ক্রীতদাসকে নিষ্কৃতি দেয়া তার উপর কর্তব্য, যদি তার কাছে প্রয়োজনীয় অর্থ থাকে। অন্যথায় তার ন্যায্যমূল্য নির্ধারণ করা হবে এবং তাকে অতিরিক্ত কষ্ট না দিয়ে উপার্জন করতে বলা হবে। হাজ্জাজ ইবনু হাজ্জাজ, আবান ও মূসা ইবনু খালাফ (রহ.) কাতাদাহ (রহ.)-এর অনুসরণ করেছেন। হাদীসটি শু‘বা (রহ.) সংক্ষিপ্তভাবে বর্ণনা করেছেন। (২৪৯২) (আধুনিক প্রকাশনীঃ ২৩৪৩, ইসলামিক ফাউন্ডেশনঃ ২৩৬০)",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2528,
			"arabicnumber": 2528,
			"text": "وَقَالَ النَّبِيُّ صلى الله عليه وسلم لِكُلِّ امْرِئٍ مَا نَوَى وَلاَ نِيَّةَ لِلنَّاسِي وَالْمُخْطِئِ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, প্রত্যেক ব্যক্তি তাই পাবে, যা সে নিয়্যাত করবে এবং যে ব্যক্তি অনিচ্ছায় বা ভুলবশত কিছু বলে, তার কোন নিয়্যাত থাকে না। ২৫২৮. আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, (আমার বরকতে) আল্লাহ আমার উম্মতের অন্তরে উদিত ওয়াসওয়াসা (পাপের ভাব ও চেতনা) মাফ করে দিয়েছেন। যতক্ষণ পর্যন্ত না সে তা কাজে পরিণত করে অথবা মুখে বলে। (৬৬৬৪, ৫২৬৯) (আধুনিক প্রকাশনীঃ ২৩৪৪, ইসলামিক ফাউন্ডেশনঃ ২৩৬১)",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2529,
			"arabicnumber": 2529,
			"text": "‘উমার ইবনু খাত্তাব (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, আমলসমূহ নিয়্যাতের সাথে সম্পৃক্ত। আর মানুষ তাই পাবে, যা সে নিয়্যাত করবে। কাজেই কেউ আল্লাহ ও তাঁর রাসূলের উদ্দেশে হিজরত করে থাকলে তার সে হিজরত আল্লাহ ও তাঁর রাসূলের উদ্দেশে বলেই গণ্য হবে। আর যার হিজরত হবে দুনিয়া হাসিলের উদ্দেশে অথবা কোন নারীকে বিয়ে করার মতলবে; তার হিজরত সে উদ্দেশে বলেই গণ্য হবে। (১) (আধুনিক প্রকাশনীঃ ২৩৪৫, ইসলামিক ফাউন্ডেশনঃ ২৩৬২)",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2530,
			"arabicnumber": 2530,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত যে, তিনি ইসলাম গ্রহণের ইচ্ছায় আপন ক্রীতদাসকে সাথে নিয়ে (মদ্বীনায়) আসছিলেন। পথে তারা পরস্পর বিচ্ছিন্ন হয়ে পড়লেন। পরে ক্রীতদাসটি এসে পৌঁছল। আবূ হুরাইরাহ্ (রাঃ) সে সময় নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর খিদমাতে উপবিষ্ট ছিলেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আবূ হুরাইরাহ! দেখ, তোমার ক্রীতদাস এসে গেছে। তখন তিনি বললেন, শুনুন; আমি আপনাকে সাক্ষী রেখে বলছি, সে মুক্ত। রাবী বলেন, (মদ্বীনায়) পৌঁছে তিনি বলতেন: কত দীর্ঘ আর কষ্টদায়কই না ছিল হিজরতের সে রাত, তবুও তা আমাকে দারুল কুফর হতে মুক্তি দিয়েছে। (৪৩৯৩, ২৫৩২, ২৫৩১) (আধুনিক প্রকাশনীঃ ২৩৪৬, ইসলামিক ফাউন্ডেশনঃ ২৩৬৩)",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2531,
			"arabicnumber": 2531,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবীজীর খিদমতে আগমনকালে আমি পথে পথে (কবিতা) বলতামঃ হিজরতের সে রাত কত না দীর্ঘ আর কষ্টদায়ক ছিল- তবুও তা আমাকে দারুল কুফর হতে মুক্তি দিয়েছে। তিনি বলেন, পথে আমার এক ক্রীতদাস পালিয়ে গিয়েছিল। যখন আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর খিদমতে এসে তাঁর (হাতে) বায়‘আত হলাম। আমি তাঁর খিদমাতেই ছিলাম, এ সময় ক্রীতদাসটি এসে হাযির হল। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আবূ হুরাইরাহ! এই যে, তোমার ক্রীতদাস! আমি বললাম, সে আল্লাহর ওয়াস্তে আযাদ। এই বলে তাকে মুক্ত করে দিলাম। আবূ ‘আবদুল্লাহ (বুখারী) (রহ.) বলেন, আবূ কুরাইব (রহ.) আবূ উসামাহ (রহ.) হতে বর্ণিত রিওয়ায়াতে حُرٌّ শব্দ বলেননি। (২৫৩০) (আধুনিক প্রকাশনীঃ ২৩৪৭, ইসলামিক ফাউন্ডেশনঃ ২৩৬৪)",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2532,
			"arabicnumber": 2532,
			"text": "কাইস (রহ.) হতে বর্ণিত। তিনি বলেন, আবূ হুরাইরাহ্ (রাঃ) তাঁর ক্রীতদাসকে সাথে করে ইসলামের উদ্দেশে (মদিনা) আগমনকালে পথিমধ্যে তারা একে অপরকে হারিয়ে ফেললেন এবং তিনি (আবূ হুরাইরাহ) বললেন, শুনুন! আমি আপনাকে সাক্ষী রেখে বলছি, সে আল্লাহর জন্য। (২৫৩০) (আধুনিক প্রকাশনীঃ ২৩৪৮, ইসলামিক ফাউন্ডেশনঃ ২৩৬৫)",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2533,
			"arabicnumber": 2533,
			"text": "قَالَ أَبُو هُرَيْرَةَ عَنْ النَّبِيِّ صلى الله عليه وسلم مِنْ أَشْرَاطِ السَّاعَةِ أَنْ تَلِدَ الأَمَةُ رَبَّهَا আবূ হুরাইরাহ্ (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেছেন, কিয়ামতের একটি আলামত এই যে, বাঁদী তার মুনিবকে প্রসব করবে। ২৫৩৩. ‘আয়িশাহ (রাযি.) হতে বর্ণিত। তিনি বলেন, ‘উতবাহ ইবনু আবূ ওয়াক্কাস আপন ভাই সা‘দ ইবনু আবূ ওয়াক্কাসকে ওসীয়্যাত করেছিলেন, তিনি যেন যাম‘আর দাসীর গর্ভজাত পুত্রকে গ্রহণ করেন (কারণ স্বরূপ) ‘উতবাহ বলেছিলেন, সে আমার (ঔরসজাত) পুত্র। মক্কা বিজয়কালে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন মক্কায় তাশরীফ আনলেন; তখন সা‘দ যাম‘আর দাসীর পুত্রকে নিয়ে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর খিদমতে আসলেন এবং তার সাথে আব্দ ইবনু যাম‘আকে নিয়ে আসলেন। সা‘দ বললেন, হে আল্লাহর রাসূল! এ আমার ভাই, যাম‘আর পুত্র। তার শয্যাতেই এ জন্ম নিয়েছে। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তখন যাম‘আর দাসীর পুত্রের দিকে তাকালেন। দেখলেন, উতবার সাথেই তার (আদলের) সর্বাধিক মিল। তবু রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, হে আব্দ ইবনু যাম‘আ! এ তোমারই (ভাই), কেননা এ তার (আব্দ ইবনু যাম‘আর) শয্যাতে জন্মগ্রহণ করেছে। তারপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, হে সাওদা বিনতে যাম‘আ! তুমি এ হতে পর্দা করবে। কেননা, তিনি উতবার সাথেই তার (চেহারার) মিল দেখতে পেয়েছিলেন। সাওদা ছিলেন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর স্ত্রী। (২০৫৩) (আধুনিক প্রকাশনীঃ ২৩৪৯, ইসলামিক ফাউন্ডেশনঃ ২৩৬৬)",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2534,
			"arabicnumber": 2534,
			"text": "জাবির ইবনু ‘আবদুল্লাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমাদের কোন একজন তার এক ক্রীতদাসকে মুদাববার (মনিবের মৃত্যুর পর যে ক্রীতদাস মুক্ত বলে ঘোষিত হয়) রূপে মুক্ত ঘোষণা করল। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সেই ক্রীতদাসকে ডেকে নিয়ে অন্যত্র বিক্রি করে দিলেন। জাবির (রাঃ) বলেন, ক্রীতদাসটি সে বছরই মারা গিয়েছিল। (২১৪১) (আধুনিক প্রকাশনীঃ ২৩৫০, ইসলামিক ফাউন্ডেশনঃ ২৩৬৭)",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2535,
			"arabicnumber": 2535,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ক্রীতদাসের অভিভাবকত্ব বিক্রি করতে এবং তা দান করতে নিষেধ করেছেন। (৬৭৫৬) (আধুনিক প্রকাশনীঃ ২৩৫১, ইসলামিক ফাউন্ডেশনঃ ২৩৬৮)",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2536,
			"arabicnumber": 2536,
			"text": "‘আয়িশাহ (রাযি.) হতে বর্ণিত। তিনি বলেন, বারীরাকে আমি (আযাদ করার নিয়্যতে) খরিদ করলাম, তখন তার (পূর্বতন) মালিক অভিভাবকত্বের শর্তারোপ করল। প্রসঙ্গটি আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর কাছে উত্থাপন করলাম। তিনি বললেন, তুমি তাকে মুক্ত করে দাও। অভিভাবকত্ব সেই লাভ করবে, যে অর্থ ব্যয় করবে। তখন আমি তাকে মুক্ত করে দিলাম। তারপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে ডেকে তার স্বামীর ব্যাপারে ইখতিয়ার দিলেন। বারীরা (রাঃ) বললেন, যদি সে আমাকে এত এত সম্পদও দেয় তবু আমি তার কাছে থাকব না। অবশেষে তিনি তার ইখতিয়ার প্রয়োগ করলেন। (৪৫৬) (আধুনিক প্রকাশনীঃ ২৩৫২, ইসলামিক ফাউন্ডেশনঃ ২৩৬৯)",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2537,
			"arabicnumber": 2537,
			"text": "وَقَالَ أَنَسٌ قَالَ الْعَبَّاسُ لِلنَّبِيِّ صلى الله عليه وسلم فَادَيْتُ نَفْسِي وَفَادَيْتُ عَقِيلاً وَكَانَ عَلِيٌّ لَهُ نَصِيبٌ فِي تِلْكَ الْغَنِيمَةِ الَّتِي أَصَابَ مِنْ أَخِيهِ عَقِيلٍ وَعَمِّهِ عَبَّاسٍ আনাস (রাঃ) বর্ণনা করেছেন, ‘আব্বাস (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে বলেছিলেন, আমি নিজের ও আকীলের মুক্তিপণ আদায় করছি। এদিকে আলী ইবনু আবী তালিব (রাঃ) তার ভাই আকীল ও চাচা আব্বাসের মুক্তিপণ বাবত প্রাপ্ত গনীমাতের অংশ পেয়েছিলেন। ২৫৩৭. আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। তিনি বলেন, মদ্বীনার কিছু লোক রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর কাছে অনুমতি প্রার্থনা করে বলল, আপনি অনুমতি দিলে আমরা আমাদের বোনের ছেলে ‘আব্বাসের মুক্তিপণ ছেড়ে দিব। কিন্তু তিনি বললেন, তোমরা তার (মুক্তিপণের) একটি দিরহামও ছাড়তে পার না। (৩০৪৮, ৪০১৮) (আধুনিক প্রকাশনীঃ ২৩৫৩, ইসলামিক ফাউন্ডেশনঃ ২৩৭০)",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2538,
			"arabicnumber": 2538,
			"text": "হিশাম (রহ.) হতে বর্ণিত। আমার পিতা আমাকে অবগত করলেন যে, হাকীম ইবনু হিযাম (রাঃ) জাহিলী যুগে একশ’ ক্রীতদাস মুক্ত করেছিলেন এবং আরোহণের জন্য একশ’ উট দিয়েছিলেন। যখন তিনি ইসলাম গ্রহণ করলেন, তখনও একশ’ উট বাহন হিসাবে দান করেন এবং একশ’ ক্রীতদাস মুক্ত করলেন। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে জিজ্ঞেস করলাম, হে আল্লাহর রাসূল! জাহেলী যুগে কল্যাণের উদ্দেশে যে কাজগুলো আমি করতাম, সেগুলো সম্পর্কে আমাকে অবহিত করুন। তিনি বলেন, তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তোমার পিছনের ‘আমলগুলোর কল্যাণেই তো তুমি ইসলাম কবূল করেছ। (১৪৩৬) (আধুনিক প্রকাশনীঃ ২৩৫৪, ইসলামিক ফাউন্ডেশনঃ ২৩৭১)",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2540,
			"arabicnumber": 2540,
			"text": "",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2541,
			"arabicnumber": 2541,
			"text": "ইবনু ‘আউন (রহ.) হতে বর্ণিত। তিনি বলেন, আমি নাফি‘ (রহ.)-কে পত্র লিখলাম, তিনি জওয়াবে আমাকে লিখেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বানী মুস্তালিক গোত্রের উপর অতর্কিতভাবে অভিযান পরিচালনা করেন। তাদের গবাদি পশুকে তখন পানি পান করানো হচ্ছিল। তিনি তাদের যুদ্ধক্ষমদের হত্যা এবং নাবালকদের বন্দী করেন এবং সেদিনই তিনি জুওয়ায়রিয়া (উম্মুল মু’মিনীন)-কে লাভ করেন। [নাফি‘ (রহ.) বলেন] ‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) আমাকে এ সম্পর্কিত হাদীস শুনিয়েছেন। তিনি নিজেও সে সেনাদলে ছিলেন। (আধুনিক প্রকাশনীঃ ২৩৫৬, ইসলামিক ফাউন্ডেশনঃ ২৩৭৩)",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2542,
			"arabicnumber": 2542,
			"text": "ইবনু মুহায়রিয (রহ.) হতে বর্ণিত। তিনি বলেন, আমি আবূ সাঈদ (রাঃ)-কে দেখতে পেয়ে জিজ্ঞেস করলাম। তিনি বললেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সাথে আমরা বনী মুস্তালিক যুদ্ধে কিছু আরব যুদ্ধ বন্দী আমাদের হস্তগত হল। তখন আমাদের স্ত্রীদের কথা মনে পড়ে (কেননা) দূর-নিঃসঙ্গ জীবন আমাদের জন্য পীড়াদায়ক হয়ে পড়েছিল। (সে সময়) আমরা আযল করতে চাইলাম (বাঁদী ব্যবহার করে)। এ সম্পর্কে আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে জিজ্ঞেস করলে তিনি বললেন, এরূপ না করলে তোমাদের কোন ক্ষতি হবে না। কেননা, ক্বিয়ামাত (কিয়ামত) পর্যন্ত যাদের জন্ম নির্ধারিত রয়েছে, তাদের আগমন ঘটবেই। (২২২৯) (আধুনিক প্রকাশনীঃ ২৩৫৭, ইসলামিক ফাউন্ডেশনঃ ২৩৭৪)",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2543,
			"arabicnumber": 2543,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে তিনটি কথা শোনার পর হতে বনী তামীম গোত্রকে আমি ভালবেসে আসছি। আমি তাঁকে বলতে শুনেছি, দাজ্জালের মুকাবিলায় আমার উম্মতের মধ্যে এরাই হবে অধিকতর কঠোর। আবূ হুরাইরাহ্ (রাঃ) বলেন, একবার তাদের পক্ষ হতে সদকার মাল আসল। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, এ যে আমার কাওমের সাদাকা। ‘আয়িশাহ (রাযি.)-এর হাতে তাদের এক বন্দিনী ছিল। তা দেখে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, একে মুক্ত করে দাও। কেননা, সে ইসমাঈলের বংশধর। (৪৩৬৬) (আধুনিক প্রকাশনীঃ ২৩৫৮, ইসলামিক ফাউন্ডেশনঃ ২৩৭৫)",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2544,
			"arabicnumber": 2544,
			"text": "আবূ মূসা (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, কারো যদি একটি বাঁদী থাকে আর সে তাকে প্রতিপালন করে, তার সাথে ভাল আচরণ করে এবং তাকে মুক্তি দিয়ে বিয়ে করে, তাহলে সে দ্বিগুণ সাওয়াব লাভ করবে। (৯৭) (আধুনিক প্রকাশনীঃ ২৩৫৯, ইসলামিক ফাউন্ডেশনঃ ২৩৭৬)",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2545,
			"arabicnumber": 2545,
			"text": "وَقَوْلِهِ تَعَالَى ( وَاعْبُدُوا اللهَ وَلاَ تُشْرِكُوا بِهِ شَيْئًا وَبِالْوَالِدَيْنِ إِحْسَانًا وَبِذِي الْقُرْبَى وَالْيَتَامَى وَالْمَسَاكِينِ وَالْجَارِ ذِي الْقُرْبَى وَالْجَارِ الْجُنُبِ وَالصَّاحِبِ بِالْجَنْبِ وَابْنِ السَّبِيلِ وَمَا مَلَكَتْ أَيْمَانُكُمْ إِنَّ اللهَ لاَ يُحِبُّ مَنْ كَانَ مُخْتَالاً فَخُورًا ) قَالَ أَبُو عَبْد اللهِ ( ذِي الْقُرْبَى ) الْقَرِيبُ وَالْجُنُبُ الْغَرِيبُ الْجَارُ الْجُنُبُ يَعْنِي الصَّاحِبَ فِي السَّفَرِ (এ সম্পর্কে) আল্লাহ তা‘আলার বাণীঃ ‘‘আর তোমরা আল্লাহর ইবাদাত করবে ও কোন কিছুকে তাঁর শরীক করবে না এবং পিতা-মাতা, আত্মীয়-স্বজন, ইয়াতীম, অভাবগ্রস্ত, নিকট প্রতিবেশী, দূর প্রতিবেশী, সঙ্গী-সাথী, পথচারী এবং তোমাদের অধিকারভুক্ত দাস-দাসীদের প্রতি সদ্ব্যবহার করবে। দাম্ভিক আত্মগর্বীকে আল্লাহ পছন্দ করেন না।’’ (আন-নিসা (৪) : ৩৬) ২৫৪৫. মারূর ইবনু সুওয়াইদ (রহ.) হতে বর্ণিত। তিনি বলেন, একবার আমি আবূ যার গিফারী (রাঃ)-এর দেখা পেলাম। তার গায়ে তখন এক জোড়া কাপড় আর তার ক্রীতদাসের গায়েও (অনুরূপ) এক জোড়া কাপড় ছিল। তাঁকে এর কারণ জিজ্ঞেস করলে তিনি বললেন, একবার এক ব্যক্তিকে আমি গালি দিয়েছিলাম। সে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর কাছে আমার বিরুদ্ধে অভিযোগ করল। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে বললেন, তুমি তার মার প্রতি কটাক্ষ করে তাকে লজ্জা দিলে? তারপর তিনি বললেন, তোমাদের গোলামেরা তোমাদেরই ভাই। আল্লাহ তাদেরকে তোমাদের অধীনস্থ করেছেন, কাজেই কারো ভাই যদি তার অধীনে থাকে তবে সে যা খায়, তা হতে যেন তাকে খেতে দেয় এবং সে যা পরিধান করে, তা হতে যেন পরিধান করায় এবং তাদের সাধ্যাতীত কোন কাজে বাধ্য না করে। তোমরা যদি তাদের শক্তির ঊর্ধ্বে কোন কাজ তাদের দাও তবে তাদের সহযোগিতা কর। (৩০) (আধুনিক প্রকাশনীঃ ২৩৬০, ইসলামিক ফাউন্ডেশনঃ ২৩৭৭)",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2546,
			"arabicnumber": 2546,
			"text": "ইবনু ‘উমার (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, ক্রীতদাস যদি তার মনিবের হিতাকাঙ্ক্ষী হয় এবং তার প্রতিপালকের উত্তমরূপে ইবাদত করে, তাহলে তার সাওয়াব হবে দ্বিগুণ। (২৫৫০) (আধুনিক প্রকাশনীঃ ২৩৬১, ইসলামিক ফাউন্ডেশনঃ ২৩৭৮)",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2547,
			"arabicnumber": 2547,
			"text": "আবূ মূসা আশ‘আরী (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যে লোক তার বাঁদীকে উত্তমরূপে জ্ঞান ও আদব শিক্ষা দেয় এবং তাকে মুক্ত করে ও বিয়ে করে, সে দ্বিগুণ সাওয়াব লাভ করবে। আর যে ক্রীতদাস আল্লাহর হক আদায় করে এবং মনিবের হকও আদায় করে, সেও দ্বিগুণ সাওয়াব লাভ করবে। (৯৭) (আধুনিক প্রকাশনীঃ ২৩৬২, ইসলামিক ফাউন্ডেশনঃ ২৩৭৯)",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2548,
			"arabicnumber": 2548,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, সৎ ক্রীতদাসের সাওয়াব হবে দ্বিগুণ। আবূ হুরাইরাহ্ (রাঃ) বলেন, যাঁর হাতে আমার প্রাণ, তাঁর শপথ করে বলছি, আল্লাহর পথে জিহাদ, হাজ্জ এবং আমার মায়ের সেবার মতো উত্তম কাজ যদি না থাকত, তাহলে ক্রীতদাসরূপে মৃত্যুবরণ করাই আমি পছন্দ করতাম। (আধুনিক প্রকাশনীঃ ২৩৬৩, ইসলামিক ফাউন্ডেশনঃ ২৩৮০)",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2549,
			"arabicnumber": 2549,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, কত ভাগ্যবান সে যে উত্তমরূপে আপন প্রতিপালকের ইবাদত করে এবং নিজ মনিবের হিতাকাঙ্ক্ষী হয়। (আধুনিক প্রকাশনীঃ ২৩৬৪, ইসলামিক ফাউন্ডেশনঃ ২৩৮১)",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2550,
			"arabicnumber": 2550,
			"text": "وَقَالَ اللهُ تَعَالَى ( وَالصَّالِحِينَ مِنْ عِبَادِكُمْ وَإِمَائِكُمْ ) وَقَالَ ( عَبْدًا مَمْلُوكًا ) ( وَأَلْفَيَا سَيِّدَهَا لَدَى الْبَابِ ) وَقَالَ ( مِنْ فَتَيَاتِكُمْ الْمُؤْمِنَاتِ ) وَقَالَ النَّبِيُّ قُومُوا إِلَى سَيِّدِكُمْ وَ ( اذْكُرْنِي عِنْدَ رَبِّكَ ) عِنْدَ سَيِّدِكَ وَمَنْ سَيِّدُكُمْ আল্লাহ তা‘আলার বাণীঃ ‘‘এবং তোমাদের ক্রীতদাস বাঁদীদের মধ্যে যারা সৎ .....’’ (আন-নূর ৩২)। তিনি আরো বলেনঃ ‘‘অপরের অধিকারভুক্ত এক ক্রীতদাসের .....’’ (নাহল (১৬) : ৭৫)। ‘‘তারা স্ত্রী লোকটির স্বামীকে দরজার কাছে পেল’’- (ইউসুফ (১২) : ২৫)। আল্লাহ তা‘আলা আরো বলেন, ‘‘তোমাদের ঈমানদার বাঁদীদের ......’’ (আন-নিসা (৪) : ২৫)। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, তোমরা তোমাদের নেতার জন্য দাঁড়িয়ে যাও। ‘‘এবং তোমার প্রভুর নিকট আমার কথা বলবে’’- (ইউসুফ (১২) : ৪২)। অর্থাৎ, তোমার মনিবের নিকট। ২৫৫০. ‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, ক্রীতদাস যদি স্বীয় মনিবের হিতাকাঙ্ক্ষী হয় এবং আপন প্রতিপালকের উত্তম ‘ইবাদত করে, তাহলে তার পুণ্য হবে দ্বিগুণ। (২৫৪৬) (আধুনিক প্রকাশনীঃ ২৩৬৫, ইসলামিক ফাউন্ডেশনঃ ২৩৮২)",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2551,
			"arabicnumber": 2551,
			"text": "আবূ মূসা (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যে ক্রীতদাস আপন প্রতিপালকের উত্তমরূপে ইবাদত করে এবং আপন মনিবের যে হক আছে তা আদায় করে, তার কল্যাণ কামনা করে আর তার আনুগত্য করে, সে দ্বিগুণ পুণ্য অর্জন করবে। (৯৭) (আধুনিক প্রকাশনীঃ ২৩৬৬, ইসলামিক ফাউন্ডেশনঃ ২৩৮৩)",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2552,
			"arabicnumber": 2552,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমাদের কেউ যেন এমন কথা না বলে ‘‘তোমার প্রভুকে আহার করাও’’ ‘‘তোমার প্রভুকে অযু করাও’’ ‘‘তোমার প্রভুকে পান করাও’’ আর যেন (দাস ও বাঁদীরা) এরূপ বলে, ‘‘আমার মনিব’’ ‘আমার অভিভাবক’, তোমাদের কেউ যেন এরূপ না বলে ‘‘আমার দাস, আমার দাসী’’। বরং বলবে- ‘আমার বালক’ ‘আমার বালিকা’ ‘আমার খাদিম’। (আধুনিক প্রকাশনীঃ ২৩৬৭, ইসলামিক ফাউন্ডেশনঃ ২৩৮৪)",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2553,
			"arabicnumber": 2553,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, কেউ কোন (শরীকী) ক্রীতদাস হতে নিজের অংশ মুক্ত করে দিলে এবং তার কাছে সেই ক্রীতদাসের মূল্য পরিমাণ সম্পদ থাকলে তার ন্যায্যমূল্য নির্ধারণ করা হবে এবং তার সম্পদ থেকেই সেই ক্রীতদাস সম্পূর্ণ মুক্ত হয়ে যাবে, অন্যথায় সে যতটুকু মুক্ত করেছে ততটুকুই মুক্ত হবে। (আধুনিক প্রকাশনীঃ ২৩৬৮, ইসলামিক ফাউন্ডেশনঃ ২৩৮৫)",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2554,
			"arabicnumber": 2554,
			"text": "‘আবদুল্লাহ [ইবনু ‘উমার (রাঃ)] হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমরা প্রত্যেকেই দায়িত্বশীল। কাজেই প্রত্যেকেই নিজ অধীনস্থদের বিষয়ে জিজ্ঞাসার সম্মুখীন হবে। যেমন- জনগণের শাসক তাদের দায়িত্বশীল, কাজেই সে তাদের বিষয়ে জিজ্ঞাসিত হবে। একজন পুরুষ তার পরিবার পরিজনদের দায়িত্বশীল, কাজেই সে তাদের বিষয়ে জিজ্ঞাসিত হবে। স্ত্রী স্বামীর ঘরের এবং তার সন্তানের দায়িত্বশীল, কাজেই সে তাদের বিষয়ে জিজ্ঞাসিত হবে। আর ক্রীতদাস আপন মনিবের সম্পদের রক্ষণাবেক্ষণকারী। কাজেই সে বিষয়ে জিজ্ঞাসিত হবে। শোন! তোমরা প্রত্যেকেই দায়িত্বশীল। কাজেই প্রত্যেকেই আপন অধীনস্থদের বিষয়ে জিজ্ঞাসিত হবে। (৮৯৩) (আধুনিক প্রকাশনীঃ ২৩৬৯, ইসলামিক ফাউন্ডেশনঃ ২৩৮৬)",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2555,
			"arabicnumber": 2555,
			"text": "",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2557,
			"arabicnumber": 2557,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমাদের কারো খাদিম খাবার নিয়ে হাযির হলে তাকেও নিজের সাথে বসানো উচিত। তাকে সাথে না বসালেও দু’ এক লোকমা কিংবা দু’ এক গ্রাস তাকে দেয়া উচিত। কেননা, সে এর জন্য পরিশ্রম করেছে। (৫৪৬০) (আধুনিক প্রকাশনীঃ ২৩৭১, ইসলামিক ফাউন্ডেশনঃ ২৩৮৮)",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2558,
			"arabicnumber": 2558,
			"text": "‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) হতে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমাদের প্রত্যেকে দায়িত্বশীল এবং নিজ অধীনস্থদের বিষয়ে সে জিজ্ঞাসিত হবে। ইমাম (শাসক) একজন দায়িত্বশীল। কাজেই আপন অধীনস্থদের বিষয়ে সে জিজ্ঞাসিত হবে। একজন পুরুষ তার পরিবারের দায়িত্বশীল। কাজেই সে তার অধীনস্থদের বিষয়ে জিজ্ঞাসিত হবে। স্ত্রী তার স্বামীর ঘরের দায়িত্বশীল। কাজেই সে তার অধীনস্থদের বিষয়ে জিজ্ঞাসিত হবে, আর খাদিম তার মনিবের সম্পদের রক্ষণাবেক্ষণকারী। কাজেই সে তার দায়িত্বাধীন বিষয়ে জিজ্ঞাসিত হবে। [‘আবদুল্লাহ ইবনু ‘উমার (রাঃ)] বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এদের সম্পর্কে (নিশ্চিতভাবেই) শুনেছি। তবে আমার ধারণা; নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আরো বলেছেন, আর সন্তান তার পিতার সম্পদের রক্ষণাবেক্ষণকারী। কাজেই তার দায়িত্বাধীন বিষয়ে জিজ্ঞাসিত হবে। মোটকথা তোমাদের প্রত্যেকে দায়িত্বশীল এবং প্রত্যেকেই তার অধীনস্থদের বিষয়ে জিজ্ঞাসিত হবে। (৮৯৩) আধুনিক প্রকাশনীঃ ২৩৭২, ইসলামিক ফাউন্ডেশনঃ ২৩৮৯",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2559,
			"arabicnumber": 2559,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমাদের মধ্যে কেউ যখন যুদ্ধ করবে, তখন সে যেন মুখমন্ডলে আঘাত করা হতে বিরত থাকে। (আধুনিক প্রকাশনীঃ ২৩৭৩, ইসলামিক ফাউন্ডেশনঃ ২৩৯০)",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 41
			}
		}
	]
}