{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"51": "Gifts"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2566,
			"arabicnumber": 2566,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেন, হে মুসলিম নারীগণ! কোন মহিলা প্রতিবেশিনী যেন অপর মহিলা প্রতিবেশিনীর হাদিয়া তুচ্ছ মনে না করে, এমনকি তা ছাগলের সামান্য গোশ্তযুক্ত হাড় হলেও। (৬০১৭, মুসলিম ১২/২৯ হাঃ ১০৩০, আহমাদ ৮০৭২) (আধুনিক প্রকাশনীঃ ২৩৭৯, ইসলামিক ফাউন্ডেশনঃ ২৩৯৬)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2567,
			"arabicnumber": 2567,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি একবার ‘উরওয়াহ (রাঃ)-’র উদ্দেশে বললেন, ভাগ্নে! আমরা নতুন চাঁদ দেখতাম, আবার নতুন চাঁদ দেখতাম। এভাবে দু’মাসে তিনটি নতুন চাঁদ দেখতাম। কিন্তু রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর কোন ঘরেই আগুন জ্বালানো হত না। [‘উরওয়াহ (রহ.) বলেন] আমি জিজ্ঞেস করলাম, খালা! আপনারা তাহলে বেঁচে থাকতেন কিভাবে? তিনি বললেন, দু’টি কালো জিনিস অর্থাৎ খেজুর আর পানিই শুধু আমাদের বাঁচিয়ে রাখত। কয়েক ঘর আনসার রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর প্রতিবেশী ছিল। তাঁদের কিছু দুগ্ধবতী উটনী ও বকরী ছিল। তাঁরা রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর জন্য দুধ হাদিয়া পাঠাত। তিনি আমাদের তা পান করতে দিতেন। (৬৪৫৮, ৬৪৫৯, মুসলিম ৫৩/১ হাঃ ২৯৬২) (আধুনিক প্রকাশনীঃ ২৩৮০, ইসলামিক ফাউন্ডেশনঃ ২৩৯৭)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2568,
			"arabicnumber": 2568,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেন, যদি আমাকে হালাল পশুর পায়া বা হাতা খেতে ডাকা হয়, তবু তা আমি গ্রহণ করব আর যদি আমাকে পায়া বা হাতা হাদিয়া দেয়া হয়, আমি তা গ্রহণ করব। (৫১৭৮) (আধুনিক প্রকাশনীঃ ২৩৮১, ইসলামিক ফাউন্ডেশনঃ ২৩৯৮)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2569,
			"arabicnumber": 2569,
			"text": "وَقَالَ أَبُوْ سَعِيْدٍ قَالَ النَّبِيُّ صلى الله عليه وسلم اضْرِبُوْا لِيْ مَعَكُمْ سَهْمًا আবূ সা‘ঈদ (রাঃ) বলেন, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বললেন, তোমাদের সঙ্গে আমার জন্য এক অংশ রেখ। ২৫৬৯. সাহল (রাঃ) হতে বর্ণিত যে, এক মুহাজির১ মহিলার নিকট নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) লোক পাঠালেন। তাঁর এক গোলাম ছিল কাঠ মিস্ত্রি। তিনি তাকে বললেন, তুমি তোমার গোলামকে বল, সে যেন আমাদের জন্য একটা কাঠের মিম্বার তৈরি করে। তিনি তার গোলামকে নির্দেশ দিলেন। সে গিয়ে এক রকম গাছ কেটে এনে মিম্বার তৈরী করল। কাজ শেষ হলে তিনি নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর নিকট লোক পাঠিয়ে জানালেন যে, গোলাম তার কাজ শেষ করেছে। তিনি বললেন, সেটা আমার নিকট পাঠিয়ে দাও। তখন লোকেরা তা নিয়ে এল। নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) সেটা বহন করে সেখানে রাখলেন, যেখানে তোমরা দেখতে পাচ্ছ। (৩৭৭) (আধুনিক প্রকাশনীঃ ২৩৮২, ইসলামিক ফাউন্ডেশনঃ ২৩৯৯)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2570,
			"arabicnumber": 2570,
			"text": "আবূ ক্বাতাদাহ সালামী (রাঃ) হতে বর্ণিত। তিনি বলেন, একদা আমি মক্কার পথে কোন এক মনযিলে নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর কয়েকজন সাহাবীর সঙ্গে উপবিষ্ট ছিলাম। রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) আমাদের অগ্রবর্তী কোন স্থানে অবস্থান করছিলেন। সকলেই ইহরাম অবস্থায় ছিলেন। আমি শুধু ইহরাম ব্যতীত ছিলাম। তাঁরা একটি বন্য গাধা দেখতে পেলেন। আমি তখন আমার জুতা মেরামত করছিলাম। তাঁরা আমাকে সে সম্পর্কে জানাননি। অথচ সেটি আমি যেন দেখতে পাই তাঁরা তা চাচ্ছিলেন। আমি হঠাৎ সেদিকে তাকালেন, সেটা আমার নযরে পড়ল। তখন আমি উঠে ঘোড়ার দিকে এগিয়ে গেলাম এবং জীন লাগিয়ে তাতে সাওয়ার হলাম। কিন্তু চাবুক ও বর্শা নিতে ভুলে গেলাম। তখন তাঁদের বললাম, চাবুক আর বর্শাটা আমাকে তুলে দাও। কিন্তু তাঁরা বললেন, আল্লাহর কসম! গাধা শিকার করার ব্যাপারে আমরা তোমাকে কোন সাহায্যই করব না। আমি তখন রাগ করে নেমে এলাম এবং সে দু’টি তুলে নিয়ে সাওয়ার হলাম। আর গাধাটা আক্রমণ করে আহত করলাম। তাতে সেটি মারা গেল। অতঃপর সেটাকে নিয়ে আসলাম। তারা সেই গাধার গোশত খেতে লাগলেন। পরে তাদের মনে ইহরাম অবস্থায় তা খাওয়া নিয়ে সন্দেহ দেখা দিল। আমরা যাত্রা শুরু করলাম। এক ফাঁকে আমি আমার নিকট গাধার একটি হাতা লুকিয়ে রেখেছিলাম। আমরা রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর সাক্ষাৎ পেয়ে সেই গোশত সম্পর্কে তাঁকে জিজ্ঞেস করলাম। তিনি বললেন, তোমাদের সঙ্গে সেটার গোশতের কিছু আছে কি? আমি বললাম, হ্যাঁ আছে। অতঃপর হাতাখানা তাঁকে দিলে তিনি ইহরাম অবস্থায় তার সবটুকু খেলেন। এ হাদীসটি যায়দ ইবনু আসলাম (রাঃ) ‘আতা’ ইবনু ইয়াসার (রহ.)-এর মাধ্যমে আবূ ক্বাতাদাহ (রাঃ) হতে আমার নিকট বর্ণনা করেছেন। (১৮২১) (আধুনিক প্রকাশনীঃ ২৩৮৩, ইসলামিক ফাউন্ডেশনঃ ২৪০০)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2571,
			"arabicnumber": 2571,
			"text": "وَقَالَ سَهْلٌ قَالَ لِي النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ اسْقِنِي সাহল (রাঃ) বর্ণনা করেন, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) আমাকে বললেন, আমাকে পান করাও। ২৫৭১. আনাস (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) আমাদের এই ঘরে আগমন করেন এবং কিছু পান করতে চাইলেন। আমরা আমাদের একটা বকরীর দুধ দোহন করে তাতে আমাদের এই কুয়ার পানি মিশালাম। অতঃপর তা সম্মুখে পেশ করলাম। এ সময় আবূ বাকর (রাঃ) ছিলেন তাঁর বামে, ‘উমার (রাঃ) ছিলেন তাঁর সম্মুখে, আর এক বেদুঈন ছিলেন তাঁর ডানে। তিনি যখন পান শেষ করলেন, তখন ‘উমার (রাঃ) বললেন, ইনি আবূ বাকর, কিন্তু রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বেদুঈনকে তার অবশিষ্ট পানি দান করলেন। অতঃপর বললেন, ডান দিকের ব্যক্তিদেরকেই (অগ্রাধিকার), ডান দিকের ব্যক্তিদের (অগ্রাধিকার) শোন! ডান দিক থেকেই শুরু করবে। আনাস (রাঃ) বলেন, এটাই সুন্নাত, এটাই সুন্নাত, এটাই সুন্নাত। (২৩৫২) (আধুনিক প্রকাশনীঃ ২৩৮৪, ইসলামিক ফাউন্ডেশনঃ ২৪০১)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2572,
			"arabicnumber": 2572,
			"text": "وَقَبِلَ النَّبِيُّ صلى الله عليه وسلم مِنْ أَبِيْ قَتَادَةَ عَضُدَ الصَّيْدِ. আবূ ক্বাতাদাহ (রাঃ) হতে নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) শিকারকৃত পশুর একটি বাহু গ্রহণ করেছিলেন। ২৫৭২. আনাস (রাঃ) হতে বর্ণিত। তিনি বলেন, (মক্কার অদূরে) মার্রায্ যাহারান নামক স্থানে আমরা একটি খরগোশ তাড়া করলাম। লোকেরা সেটার পিছনে ধাওয়া করে ক্লান্ত হয়ে পড়ল। অবশেষে আমি সেটাকে পেয়ে গেলাম এবং ধরে আবূ ত্বলহা (রাঃ)-এর নিকট নিয়ে গেলাম। তিনি সেটাকে যব্হ করে তার পাছা অথবা রাবী বলেন, দু’ উরু রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর খিদমতে পাঠালেন। শু‘বা (রহ.) বলেন, দু’টি উরুই এতে কোন সন্দেহ নেই। তখন নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) তা গ্রহণ করেছিলেন। রাবী বলেন, আমি শু‘বা (রহ.)-কে জিজ্ঞেস করলাম, তিনি কি তা খেয়েছিলেন? তিনি বললেন, হ্যাঁ, খেয়েছিলেন। অতঃপর তিনি বললেন, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) তা গ্রহণ করেছিলেন। (৫৪৮৯, ৫৫৩৫ মুসলিম ৩৫/৪, হাঃ ১৯৫৩) (আধুনিক প্রকাশনীঃ ২৩৮৫, ইসলামিক ফাউন্ডেশনঃ ২৪০২)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2573,
			"arabicnumber": 2573,
			"text": "সা‘আব ইবনু জাসসামাহ (রাঃ) হতে বর্ণিত। তিনি (সা‘আব ইবনু জাসসামা) রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর জন্য একটি বন্য গাধা হাদিয়া পাঠালেন। রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) তখন আবওয়া কিংবা ওয়াদ্দান নামক স্থানে ছিলেন। তিনি হাদিয়া ফেরত পাঠালেন। পরে তার বিষণ্ণ মুখ দেখে বললেন, শুন! আমরা ইহরাম অবস্থায় না থাকলে তোমার হাদিয়া ফেরত দিতাম না। (১৮২৫) (আধুনিক প্রকাশনীঃ ২৩৮৬, ইসলামিক ফাউন্ডেশনঃ ২৪০৩)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2574,
			"arabicnumber": 2574,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। লোকেরা তাদের হাদিয়া পাঠাবার ব্যাপারে ‘আয়িশাহ (রাঃ)-এর জন্য নির্ধারিত দিনের অপেক্ষা করত। এতে তারা রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর সন্তুষ্টি অর্জনের চেষ্টা করত। (২৫৮০, ২৫৮১, ৩৭৭৫, মুসলিম ৪৪/১৩, হাঃ ২৪৪১, ২৪৪২) (আধুনিক প্রকাশনীঃ ২৩৮৭, ইসলামিক ফাউন্ডেশনঃ ২৪০৪)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2575,
			"arabicnumber": 2575,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, ইবনু ‘আব্বাসের খালা উম্মু হুফায়দ (রাঃ) একদা নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর খিদমাতে পনির, ঘি ও দব্ব (অনেকটা গুইসাপের মত দেখতে) হাদিয়া পাঠালেন। কিন্তু নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) শুধু পনির ও ঘি খেলেন আর দব্ব অরুচিকর হওয়ায় বাদ দিলেন। ইবনু ‘আব্বাস (রাঃ) বলেন, রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর দস্তরখানে (দব্ব) খাওয়া হয়েছে। তা হারাম হলে রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর দস্তরখানে খাওয়া হত না। (৫৩৮৯, ৫৪০২, ৭৩৫৮, মুসলিম ৩৪/৭ হাঃ ১৯৪৭) (আধুনিক প্রকাশনীঃ ২৩৮৮, ইসলামিক ফাউন্ডেশনঃ ২৪০৫)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2576,
			"arabicnumber": 2576,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর খিদমতে কোন খাবার আনা হলে তিনি জানতে চাইতেন, এটা হাদিয়া, না সদাকাহ? যদি বলা হত সদাকাহ, তাহলে সাহাবীদের তিনি বলতেন, তোমরা খাও। কিন্তু তিনি খেতেন না। আর যদি বলা হত হাদিয়া, তাহলে তিনিও হাত বাড়াতেন এবং তাদের সঙ্গে খাওয়ায় শরীক হতেন। (মুসলিম ১২/৫৩ হাঃ ১০৭৭) (আধুনিক প্রকাশনীঃ ২৩৮৯, ইসলামিক ফাউন্ডেশনঃ ২৪০৬)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2577,
			"arabicnumber": 2577,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর খিদমতে কিছু গোশত আনা হল। তখন বলা হল যে, এট আসলে বারীরার নিকট সদাকাহরূপে এসেছিল। তখন তিনি বললেন, এটা তার জন্য সদাকাহ আর আমাদের জন্য হাদিয়া। (১৪৯৫) (আধুনিক প্রকাশনীঃ ২৩৯০, ইসলামিক ফাউন্ডেশনঃ ২৪০৭)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2578,
			"arabicnumber": 2578,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত যে, তিনি বারীরাহ (রাঃ)-কে খরিদ করার ইচ্ছা করলে তার মালিক পক্ষ ওয়ালার শর্তারোপ করল। তখন বিষয়টি নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর সামনে আলোচিত হল। নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বললেন, তুমি তাকে খরিদ করে আযাদ করে দাও। কেননা যে আযাদ করল, সেই ওয়ালা লাভ করবে। ‘আয়িশাহ (রাঃ)-এর জন্য কিছু গোশত হাদিয়া পাঠানো হল। নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-কে বলা হল যে, এ গোশত বারীরাকে সদাকাহ করা হয়েছিল। তখন নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বললেন, এটা তার জন্য সদাকাহ আর আমাদের জন্য হাদিয়া। তাকে (স্বামী বহাল রাখা বা পরিত্যাগ করার ব্যাপারে) স্বীয় ইচ্ছামাফিক সিদ্ধান্ত গ্রহণের অধিকার দেয়া হল। (রাবী) ‘আবদুর রহমান (রহ.) বলেন, তার স্বামী তখন আযাদ কিংবা গোলাম ছিল। শু‘বা (রহ.) বলেন, পরে আমি ‘আবদুর রহমান (রহ.)-কে তার স্বামী সম্পর্কে জিজ্ঞেস করলে তিনি বললেন, আমি জানি না, সে আযাদ ছিল না গোলাম ছিল। (৪৫৬) (আধুনিক প্রকাশনীঃ ২৩৯১, ইসলামিক ফাউন্ডেশনঃ ২৪০৮)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2579,
			"arabicnumber": 2579,
			"text": "উম্মু ‘আতিয়্যাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) ‘আয়িশাহ (রাঃ)-এর ঘরে এসে জিজ্ঞেস করলেন, তোমাদের নিকট খাবার কিছু আছে কি? তিনি বললেন, না; উম্মে আতিয়্যা প্রেরিত বকরির কিছু গোশ্ত ছাড়া, যা আপনি তাকে সদাকাহ হিসেবে পাঠিয়েছিলেন। তিনি বললেন, সদাকাহ তো যথাস্থানে পৌঁছে গেছে। (১৪৪৬) (আধুনিক প্রকাশনীঃ ২৩৯২, ইসলামিক ফাউন্ডেশনঃ ২৪০৯)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2580,
			"arabicnumber": 2580,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, লোকেরা তাদের হাদিয়া পাঠাবার ব্যাপারে আমার জন্য নির্ধারিত দিনের অপেক্ষা করত। উম্মু সালামাহ (রাঃ) বলেন, আমার সতীনগণ একত্রিত হলেন। ফলে উম্মু সালামাহ (রাঃ) বিষয়টি তাঁর নিকট উত্থাপন করলেন, কিন্তু তিনি ব্যাপারটি এড়িয়ে গেলেন। (২৫৭৪) (আধুনিক প্রকাশনীঃ ২৩৯৩, ইসলামিক ফাউন্ডেশনঃ ২৪১০)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2581,
			"arabicnumber": 2581,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর স্ত্রীগণ দু’দলে বিভক্ত ছিলেন। একদলে ছিলেন ‘আয়িশা, হাফসাহ, সাফিয়্যাহ ও সাওদা (রাযিয়াল্লাহু আনহুন্না), অপর দলে ছিলেন উম্মু সালামাহ (রাঃ) সহ রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর অন্যান্য স্ত্রীগণ। ‘আয়িশাহ (রাঃ)-এর প্রতি রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর বিশেষ ভালোবাসার কথা সাহাবীগণ জানতেন। তাই তাদের মধ্যে কেউ রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর নিকট কিছু হাদিয়া পাঠাতে চাইলে তা বিলম্বিত করতেন। যেদিন রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) ‘আয়িশাহ (রাঃ)-এর ঘরে অবস্থান করতেন, সেদিন হাদিয়া দাতা রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর নিকট ‘আয়িশাহ (রাঃ)-কে তাঁরা পাঠিয়ে দিতেন। উম্মু সালামাহ (রাঃ)-এর দল তা নিয়ে আলোচনা করলেন। উম্মু সালামাহ (রাঃ)-কে তাঁরা বললেন, রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর সঙ্গে আপনি আলাপ করুন। তিনি যেন লোকদের বলে দেন যে, যারা রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর নিকট হাদিয়া পাঠাতে চান, তারা যেন তাঁর নিকট পাঠিয়ে দেন, যে স্ত্রীর ঘরেই তিনি থাকুন না কেন। উম্মু সালামাহ (রাঃ) তাদের প্রস্তাব নিয়ে তাঁর সঙ্গে আলাপ করলেন। কিন্তু তিনি তাঁকে কোন জবাব দিলেন না। পরে সবাই তাকে জিজ্ঞেস করলে তিনি বললেন, তিনি আমাকে কোন জবাব দিলেন না। তখন তাঁরা তাকে বললেন, আপনি তার সঙ্গে আবার কথা বলুন। (‘আয়িশাহ) বলেন, যেদিন তিনি [রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)] তাঁর (উম্মু সালামাহ’র) ঘরে গেলেন, সেদিন তিনি আবার তাঁর নিকট কথা তুললেন। সেদিনও তিনি তাকে কিছু বললেন না। অতঃপর তারা তাকে জিজ্ঞেস করলেন, তখন তিনি বললেন, আমাকে তিনি কিছুই বলেননি। তখন তাঁরা তাঁকে বললেন, তিনি কোন জবাব না দেয়া পর্যন্ত আপনি বলতে থাকুন। তিনি [নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)] তার ঘরে গেলে আবার তিনি তাঁর নিকট সে প্রসঙ্গ তুললেন। এবার তিনি তাকে বললেন, ‘আয়িশাহ (রাঃ)-এর ব্যাপার নিয়ে আমাকে কষ্ট দিও না। মনে রেখ, ‘আয়িশাহ (রাঃ) ব্যতীত আর কোন স্ত্রীর বস্ত্র তুলে থাকা অবস্থায় আমার উপর ওয়াহী নাযিল হয়নি। [‘আয়িশাহ (রাঃ)] বলেন, এ কথা শুনে তিনি [উম্মু সালামাহ (রাঃ)] বললেন, হে আল্লাহর রাসূল! আপনাকে কষ্ট দেয়া হতে আমি আল্লাহর নিকট তওবা করছি। অতঃপর সকলে রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর কন্যা ফাতিমাহ (রাঃ)-কে এনে রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর নিকট এ কথা বলার জন্য পাঠালেন যে, আপনার স্ত্রীগণ আল্লাহর দোহাই দিয়ে আবূ বাকর (রাঃ)-এর কন্যা সম্পর্কে ইনসাফের আবেদন জানালেন। [ফাতিমা (রাঃ)] তাঁর নিকট বিষয়টি তুলে ধরলেন। তখন তিনি বললেন, প্রিয় কন্যা! আমি যা ভালবাসি তুমি কি তাই ভালবাস না? তিনি বললেন, অবশ্যই করি। অতঃপর তাদের নিকট গিয়ে তাদেরকে (আদ্যোপান্ত) অবহিত করলেন। তাঁরা তাঁকে বললেন, তুমি আবার যাও। কিন্তু এবার তিনি যেতে অস্বীকার করলেন। তখন তারা যায়নাব বিনতু জাহাশ (রাঃ)-কে পাঠালেন। তিনি তাঁর নিকট গিয়ে কঠোর ভাষা ব্যবহার করলেন এবং বললেন, আপনার স্ত্রীগণ আল্লাহর দোহাই দিয়ে ইবনু আবূ কুহাফার [আবূ বাকর (রাঃ) কন্যা সম্পর্কে ইনসাফের আবেদন জানাচ্ছেন। অতঃপর তিনি গলার স্বর উঁচু করলেন। এমনকি ‘আয়িশাহ (রাঃ)-কে জড়িয়েও কিছু বললেন। ‘আয়িশাহ (রাঃ) সেখানে বসা ছিলেন। শেষ পর্যন্ত রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) ‘আয়িশাহ (রাঃ)-এর দিকে তাকিয়ে দেখছিলেন। তিনি কিছু বলেন কিনা। রাবী ‘উরওয়াহ (রাঃ)] বলেন, ‘আয়িশাহ (রাঃ) যায়নাব (রাঃ)-এর কথার প্রস্তুতি বাদে কথা বলতে শুরু করলেন এবং তাকে চুপ করে দিলেন। ‘আয়িশাহ (রাঃ) বলেন, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) তখন ‘আয়িশাহ (রাঃ)-এর দিকে তাকিয়ে বললেন, এ হচ্ছে আবূ বাকর (রাঃ)-এর কন্যা। আবূ মারওয়ান গাস্সানী (রাঃ) হিশাম এর সূত্রে ‘উরওয়াহ (রাঃ) হতে বলেন, লোকেরা তাদের হাদিয়াসমূহ নিয়ে ‘আয়িশাহ (রাঃ)-এর জন্য নির্ধারিত দিনের অপেক্ষা করত। অন্য সনদে হিশাম (রহ.) মুহাম্মাদ ইবনু ‘আবদুর রহমান ইবনু হারিস ইবনু হিশাম (রহ.) হতে বর্ণিত। ‘আয়িশাহ (রাঃ) বলেছেন, আমি নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর নিকট ছিলাম, এমন সময় ফাতিমাহ (রাঃ) অনুমতি চাইলেন। (২৫৭৪) (আধুনিক প্রকাশনীঃ ২৩৯৪, ইসলামিক ফাউন্ডেশনঃ ২৪১১)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2582,
			"arabicnumber": 2582,
			"text": "‘আযরাহ ইবনু সাবিত আনসারী (রহ.) হতে বর্ণিত। তিনি বলেন, আমি একদা সুমামাহ ইবনু ‘আবদুল্লাহ (রহ.)-এর নিকট গেলাম, তিনি আমাকে সুগন্ধি দিলেন এবং বললেন, আনাস (রাঃ) কখনো সুগন্ধি দ্রব্য ফিরিয়ে দিতেন না। তিনি আরো বলেন, আর আনাস (রাঃ) বলেছেন, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) সুগন্ধি ফিরিয়ে দিতেন না। (৫৯২৯) (আধুনিক প্রকাশনীঃ ২৩৯৫, ইসলামিক ফাউন্ডেশনঃ ২৪১২)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2583,
			"arabicnumber": 2583,
			"text": "",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2585,
			"arabicnumber": 2585,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) হাদিয়া গ্রহণ করতেন এবং তার প্রতিদানও দিতেন। আবূ ‘আবদুল্লাহ (রহ.) বলেন, ওয়াকী ও মুহাযির (রহ.) হিশাম তার পিতা সূত্রে ‘আয়িশাহ (রাঃ) হতে উল্লেখ করেননি। (আধুনিক প্রকাশনীঃ ২৩৯৭, ইসলামিক ফাউন্ডেশনঃ ২৪১৪)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2586,
			"arabicnumber": 2586,
			"text": "وَقَالَ النَّبِيُّ صلى الله عليه وسلم اعْدِلُوْا بَيْنَ أَوْلَادِكُمْ فِي الْعَطِيَّةِ وَهَلْ لِلْوَالِدِ أَنْ يَرْجِعَ فِيْ عَطِيَّتِهِ وَمَا يَأْكُلُ مِنْ مَالِ وَلَدِهِ بِالْمَعْرُوفِ وَلَا يَتَعَدَّى وَاشْتَرَى النَّبِيُّ صلى الله عليه وسلم مِنْ عُمَرَ بَعِيْرًا ثُمَّ أَعْطَاهُ ابْنَ عُمَرَ وَقَالَ اصْنَعْ بِهِ مَا شِئْتَ নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) ইরশাদ করেছেন, সন্তানদেরকে কিছু দেয়ার ক্ষেত্রে তোমরা ইনসাফপূর্ণ আচরণ কর। কিছু দান করে পিতার পক্ষে ফেরত নেয়া বৈধ কি? পুত্রের সম্পদ হতে ন্যায়সঙ্গতভাবে পিতা খেতে পারবে, তবে সীমালঙ্ঘন করবে না। নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) একবার ‘উমার (রাঃ)-এর নিকট হতে একটি উট ক্রয় করলেন, পরে ইবনু ‘উমারকে তা দান করে বললেন, এটা যে কোন কাজে লাগাতে পার। ২৫৮৬. নু‘মান ইবনু বাশীর (রাঃ) হতে বর্ণিত যে, তার পিতা তাকে নিয়ে রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর নিকট এলেন এবং বললেন, আমি আমার এই পুত্রকে একটি গোলাম দান করেছি। তখন তিনি জিজ্ঞেস করলেন, তোমার সব পুত্রকেই কি তুমি এরূপ দান করেছ। তিনি বললেন, না; তিনি বললেন, তবে তুমি তা ফিরিয়ে নাও। (২৫৮৭, ২৬৫০, মুসলিম ২৪/৩ হাঃ ১৬২৩, আহমাদ ১৮৩৮৬) (আধুনিক প্রকাশনীঃ ২৩৯৮, ইসলামিক ফাউন্ডেশনঃ ২৪১৫)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2587,
			"arabicnumber": 2587,
			"text": "আমির (রহ.) হতে বর্ণিত। তিনি বলেন, আমি নু‘মান ইবনু বাশীর (রাঃ)-কে মিম্বরের উপর বলতে শুনেছি যে, আমার পিতা আমাকে কিছু দান করেছিলেন। তখন (আমার মাতা) আমরা বিনতে রাওয়াহা (রাঃ) বলেন, রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-কে সাক্ষী রাখা ব্যতীত সম্মত নই। তখন তিনি রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর নিকট আসলেন এবং বললেন, আমরা বিনতে রাওয়াহার গর্ভজাত আমার পুত্রকে কিছু দান করেছি। হে আল্লাহর রাসূল! আপনাকে সাক্ষী রাখার জন্য সে আমাকে বলেছে। তিনি আমাকে জিজ্ঞেস করলেন, তোমার সব ছেলেকেই কি এ রকম করেছ? তিনি বললেন, না। রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বললেন, তবে আল্লাহকে ভয় কর এবং আপন সন্তানদের মাঝে সমতা রক্ষা কর। [নু‘মান (রাঃ)] বলেন, অতঃপর তিনি ফিরে গেলেন এবং তার দান ফিরিয়ে নিলেন। (২৫৮৬) (আধুনিক প্রকাশনীঃ ২৩৯৯, ইসলামিক ফাউন্ডেশনঃ ২৪১৬)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2588,
			"arabicnumber": 2588,
			"text": "(قَالَ إِبْرَاهِيْمُ جَائِزَةٌ وَقَالَ عُمَرُ بْنُ عَبْدِ الْعَزِيْزِ لَا يَرْجِعَانِ وَاسْتَأْذَنَ النَّبِيُّ صلى الله عليه وسلم نِسَاءَهُ فِيْ أَنْ يُمَرَّضَ فِيْ بَيْتِ عَائِشَةَ وَقَالَ النَّبِيُّ صلى الله عليه وسلم الْعَائِدُ فِيْ هِبَتِهِ كَالْكَلْبِ يَعُوْدُ فِيْ قَيْئِهِ وَقَالَ الزُّهْرِيُّ فِيْمَنْ قَالَ لِامْرَأَتِهِ هَبِيْ لِيْ بَعْضَ صَدَاقِكِ أَوْ كُلَّهُ ثُمَّ لَمْ يَمْكُثْ إِلَّا يَسِيْرًا حَتَّى طَلَّقَهَا فَرَجَعَتْ فِيْهِ قَالَ يَرُدُّ إِلَيْهَا إِنْ كَانَ خَلَبَهَا وَإِنْ كَانَتْ أَعْطَتْهُ عَنْ طِيْبِ نَفْسٍ لَيْسَ فِيْ شَيْءٍ مِنْ أَمْرِهِ خَدِيْعَةٌ جَازَ قَالَ اللهُ تَعَالَى )فَإِنْ طِبْنَ لَكُمْ عَنْ شَيْءٍ مِّنْهُ نَفْسًا فَكُلُوْهُ( (النساء : ৪) ইবরাহীম (রহ.) বলেছেন, এরূপ দান বৈধ। আর ‘উমার ইবনু ‘আবদুল ‘আযীয (রহ.) বলেছেন, এ ধরনের দান করে তারা ফিরিয়ে নিতে পারবে না। নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) তাঁর স্ত্রীগণের নিকট ‘আয়িশাহ (রাঃ)-এর ঘরে সেবা-শুশ্রুষা গ্রহণের অনুমতি চেয়েছিলেন। নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেন, যে আপন দান ফেরত নেয়, সে ঐ কুকুরের মত, যে বমি করে পুনরায় খায়। ইমাম যুহরী (রহ.) বলেন, কোন লোক যদি তার স্ত্রীকে বলে, আমাকে তোমার মাহরের কিছু অংশ বা সবটুকু দান করে দাও। অথচ সে দান করার কিছু পরেই তাকে তালাক দিয়ে বসে, আর স্ত্রীও তার দান ফেরত দাবী করে তাহলে তাকে তা ফেরত দিতে হবে; যদি প্রতারণার নীয়তে এ রকম করে থাকে। আর যদি সে খুশী মনে দান করে থাকে, আর স্বামীর আচরণেও প্রতারণা না থাকে তাহলে বৈধ। আল্লাহ তা‘আলা বলেন, ‘‘পরে যদি তারা তার কিছু অংশ দান করে দেয় তবে আনন্দ ও তৃপ্তি সহকারে তা ভোগ কর।’’ (সূরা আলে ‘ইমরান ৪) ২৫৮৮. ‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) ভারী হয়ে পড়লেন এবং তাঁর কষ্ট বেড়ে গেল। তখন তিনি তাঁর স্ত্রীগণের নিকট আমার ঘরে শুশ্রুষা পাওয়ার ইচ্ছা প্রকাশ করলেন। তারা তাঁকে সম্মতি দিলেন। অতঃপর একদা দু’ ব্যক্তির উপর ভর করে বের হলেন, তখন তার উভয় পা মাটি স্পর্শ করছিল। তিনি ‘আব্বাস (রাঃ) ও আরেক ব্যক্তির মাঝে ভর দিয়ে চলছিলেন। উবায়দুল্লাহ (রহ.) বলেন, ‘আয়িশাহ (রাঃ) যা বললেন, তা আমি ইবনু ‘আব্বাস (রাঃ)-এর নিকট আরয করলাম, তিনি তখন আমাকে বললেন, ‘আয়িশাহ (রাঃ) যার নাম উল্লেখ করলেন না, তিনি কে, তা জান কি? আমি বললাম, না। তিনি বললেন, তিনি হলেন ‘আলী ইবনু আবূ তালিব (রাঃ)। (১৯৮) (আধুনিক প্রকাশনীঃ ২৪০০, ইসলামিক ফাউন্ডেশনঃ ২৪১৭)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2589,
			"arabicnumber": 2589,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেন, দান করে তা ফেরত গ্রহণকারী ঐ কুকুরের মত, যে বমি করে এরপর তার বমি খায়। (২৬২১, ২৬২২, ৬৯৭৫, মুসলিম ২৪/২ হাঃ ১৬২২, আহমাদ ২৬৪৭) (আধুনিক প্রকাশনীঃ ২৪০১, ইসলামিক ফাউন্ডেশনঃ ২৪১৮)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2590,
			"arabicnumber": 2590,
			"text": "(قَالَ اللهُ تَعَالَى )وَلَا تُؤْتُوا السُّفَهَاءَ أَمْوَالَكُمُ( (النساء : ৫) আল্লাহ তা‘আলা বলেনঃ নির্বোধদের হাতে তোমরা নিজেদের সম্পদ তুলে দিও না। (আলু ‘ইমরানঃ ৫) ২৫৯০. আসমা (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি বললাম, হে আল্লাহর রাসূল! যুবায়ের (রাঃ) আমার নিকট যে সম্পদ রাখেন, সেগুলো ছাড়া আমার নিজের কোন সম্পদ নেই। এমতাবস্থায় আমি কি সদাকাহ করব? তিনি বললেন, হ্যাঁ সদাকাহ করতে পার। লুকিয়ে রাখবে না। তাহলে তোমার ব্যাপারে লুকিয়ে রাখা হবে। (১৪৩৩, মুসলিম ১২/২৮ হাঃ ১০২৯, আহমাদ ২৬৯৮৮) (আধুনিক প্রকাশনীঃ ২৪০২, ইসলামিক ফাউন্ডেশনঃ ২৪১৯)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2591,
			"arabicnumber": 2591,
			"text": "আসমা (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেনঃ খরচ কর, আর হিসাব করতে যেওনা, তাহলে আল্লাহ তোমার বেলায় হিসাব করে দিবেন। লুকিয়ে রেখ না, নইলে আল্লাহও তোমার ব্যাপারে লুকিয়ে রাখবেন। (১৪৩৪, মুসলিম ১২/২৮ হাঃ ১০২৯, আহমাদ ২৬৯৮৮) (আধুনিক প্রকাশনীঃ ২৪০৩, ইসলামিক ফাউন্ডেশনঃ ২৪২০)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2592,
			"arabicnumber": 2592,
			"text": "মায়মূনাহ বিনতে হারিস (রাঃ) হতে বর্ণিত। নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর অনুমতি ব্যতীত তিনি আপন বাঁদীকে মুক্ত করে দিলেন। অতঃপর তার ঘরে নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর অবস্থানের দিন তিনি বললেন, হে আল্লাহর রাসূল! আপনি কি জানেন না আমি আমার বাঁদী মুক্ত করে দিয়েছি? তিনি বললেন, তুমি কি তা করেছ? মায়মূনাহ (রাঃ) বললেন, হ্যাঁ। তিনি বললেন, শুন! তুমি যদি তোমার মামাদেরকে এটা দান করতে তাহলে তোমার জন্য বেশি নেকির কাজ হত। (২৫৯৪) অন্য সনদে বাকর ইবনু মুযার (রহ.) ---- কুরায়ব (রহ.) হতে বর্ণিত যে, মায়মূনাহ (রাঃ) গোলাম মুক্ত করেছেন। (মুসলিম ১২/১৪, হাঃ ৯৯৯, আহমাদ ২৬৮৮৬) (আধুনিক প্রকাশনীঃ ২৪০৪, ইসলামিক ফাউন্ডেশনঃ ২৪২১)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2593,
			"arabicnumber": 2593,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) সফরের মনস্থ করলে স্ত্রীগণের মধ্যে কুরআর ব্যবস্থা করতেন। যার নাম আসত তিনি তাঁকে নিয়েই সফরে বের হতেন। এছাড়া প্রত্যেক স্ত্রীর জন্য একদিন এক রাত নির্দিষ্ট করে দিতেন। তবে সাওদা বিনতে যাম‘আহ (রাঃ) নিজের দিন ও রাত নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর স্ত্রী ‘আয়িশাহ (রাঃ)-কে দান করেছিলেন। এর মাধ্যমে তিনি রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর সন্তুষ্টি কামনা করতেন। (২৬৩৭, ২৬৬১, ২৬৮৮, ২৮৭৯, ৪০২৫, ৪১৪১, ৪৬৯০, ৪৭৪৯, ৪৭৫০, ৪৭৫৭, ৫২১২, ৬৬৬২, ৬৬৭৯, ৭৩৬৯, ৭৩৭০,৭৫০০, ৭৫৪৫) (আধুনিক প্রকাশনীঃ ২৪০৫, ইসলামিক ফাউন্ডেশনঃ ২৪২২)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2594,
			"arabicnumber": 2594,
			"text": "ইবনু ‘আব্বাস (রাঃ)-এর আযাদকৃত গোলাম কুরায়ব হতে বর্ণিত যে, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর স্ত্রী মায়মূনাহ (রাঃ) তার এক বাঁদীকে মুক্ত করে দিলেন। রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) তখন তাকে বললেন, তুমি যদি একে তোমার মামাদের কাউকে দিয়ে দিতে তবে তোমার অধিক পুণ্য হত। (২৫৯২)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2595,
			"arabicnumber": 2595,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি বললাম, হে আল্লাহর রাসূল! আমার দু’জন প্রতিবেশী আছে। এ দু’জনের কাকে আমি হাদিয়া দিব? তিনি ইরশাদ করলেন, এ দু’জনের মাঝে যার দরজা তোমার বেশি নিকটে। (২২৫৯) (আধুনিক প্রকাশনীঃ ২৪০৬, ইসলামিক ফাউন্ডেশনঃ ২৪২৩)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2596,
			"arabicnumber": 2596,
			"text": "وَقَالَ عُمَرُ بْنُ عَبْدِ الْعَزِيْزِ كَانَتْ الْهَدِيَّةُ فِيْ زَمَنِ رَسُوْلِ اللهِ صلى الله عليه وسلم هَدِيَّةً وَالْيَوْمَ رِشْوَةٌ. ‘উমার ইবনু ‘আব্দুল ‘আযীয (রহ.) বলেছেন, রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর যুগে হাদিয়া ছিল, কিন্তু আজকাল তা ঘুষে পরিণত হয়েছে। ২৫৯৬. ‘আবদুল্লাহ ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর জনৈক সাহাবী সা‘আব ইবনু জাস্সামা লাইসী (রাঃ)-কে বলতে শুনেছেন যে, রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-কে তিনি একটি বন্য গাধা হাদিয়া দিয়েছিলেন। সে সময় তিনি ইহরাম অবস্থায় আবওয়াহ কিংবা ওয়াদ্দান নামক স্থানে অবস্থান করছিলেন। কাজেই তিনি সেটা ফিরিয়ে দিলেন। সা‘আব (রাঃ) বলেন, যখন তিনি আমার চেহারায় হাদিয়া ফিরিয়ে দেয়ার ছাপ দেখলেন, তখন তিনি বললেন, আমরা ইহরাম অবস্থায় না থাকলে তোমার হাদিয়া ফিরিয়ে দিতাম না। (১৮২৫) (আধুনিক প্রকাশনীঃ ২৪০৭, ইসলামিক ফাউন্ডেশনঃ ২৪২৪)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2597,
			"arabicnumber": 2597,
			"text": "আবূ হুমায়দ সা‘ঈদ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) আযদ গোত্রের ইবনু উতবিয়া নামের এক লোককে সদাকাহ সংগ্রহের কাজে নিযুক্ত করেছিলেন। তিনি ফিরে এসে বললেন, এগুলো আপনাদের আর এগুলো আমাকে হাদিয়া দেয়া হয়েছে। রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বললেন, সে তার বাবার ঘরে কিংবা তার মায়ের ঘরে কেন বসে থাকল না। তখন সে দেখত পেত, তাকে কেউ হাদিয়া দেয় কি দেয় না? যাঁর হাতে আমার প্রাণ, সেই সত্তার কসম, সদাকাহর মাল হতে স্বল্প পরিমাণও যে আত্মসাৎ করবে, সে তা কাঁধে করে কিয়ামত দিবসে উপস্থিত হবে। সেটা উট হলে তার আওয়াজ করবে, আর গাভী হলে হাম্বা হাম্বা রব করবে আর বকরী হলে ভ্যাঁ ভ্যাঁ করতে থাকবে। অতঃপর রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) তাঁর দু’হাত এই পরিমাণ উঠালেন যে, আমরা তাঁর দুই বগলের শুভ্রতা দেখতে পেলাম। তিনি তিনবার বললেন, হে আল্লাহ! আমি কি পৌঁছে দিয়েছি। হে আল্লাহ! আমি কি পৌঁছে দিয়েছি? (৯২৫) (আধুনিক প্রকাশনীঃ ২৪০৮., ইসলামিক ফাউন্ডেশনঃ ২৪২৫)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2598,
			"arabicnumber": 2598,
			"text": "وَقَالَ عَبِيْدَةُ إِنْ مَاتَ وَكَانَتْ فُصِلَتْ الْهَدِيَّةُ وَالْمُهْدَى لَهُ حَيٌّ فَهِيَ لِوَرَثَتِهِ وَإِنْ لَمْ تَكُنْ فُصِلَتْ فَهِيَ لِوَرَثَةِ الَّذِيْ أَهْدَى وَقَالَ الْحَسَنُ أَيُّهُمَا مَاتَ قَبْلُ فَهِيَ لِوَرَثَةِ الْمُهْدَى لَهُ إِذَا قَبَضَهَا الرَّسُوْلُ ‘আবীদাহ (রহ.) বলেন, দানকারী ব্যক্তি হাদিয়া সামগ্রী পৃথক করে হাদিয়া প্রাপকের জীবদ্দশায় মারা গেলে তা হাদিয়া প্রাপকের ওয়ারিশদের হক হবে। (যদি প্রাপক ইতিমধ্যে মারা গিয়ে থাকে) আর আলাদা না করা হলে হাদিয়া দাতার ওয়ারিশদের হক হবে। আর হাসান (রহ.) বলেছেন, উভয়ের যে কোন একজন মারা গেলে এবং প্রাপকের নিযুক্ত লোক উক্ত হাদিয়া সামগ্রী নিজ অধিকারে নিয়ে নিলে তা প্রাপকের ওয়ারিশদের হক হবে। ২৫৯৮. জাবির (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) আমাকে বললেন, বাহরাইন হতে মাল এসে পৌঁছলে তোমাকে আমি এভাবে তিনবার দিব, কিন্তু মাল আসার পূর্বেই নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর মৃত্যু হল। পরে আবূ বাকর (রাঃ) ঘোষককে ঘোষণা করতে নির্দেশ দিলেন, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর পক্ষ হতে কারো জন্য কোন প্রতিশ্রুতি থাকলে কিংবা কারো কোন ঋণ থাকলে সে যেন আমার নিকট আসে। এ ঘোষণা শুনে আমি তাঁর নিকট গিয়ে বললাম, আমাকে নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) প্রতিশ্রুতি দিয়েছিলেন। তখন তিনি আমাকে আঁজলা ভরে তিনবার দিলেন। (২২৯৬) (আধুনিক প্রকাশনীঃ ২৪০৯, ইসলামিক ফাউন্ডেশনঃ ২৪২৬)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2599,
			"arabicnumber": 2599,
			"text": "وَقَالَ ابْنُ عُمَرَ كُنْتُ عَلَى بَكْرٍ صَعْبٍ فَاشْتَرَاهُ النَّبِيُّ صلى الله عليه وسلم وَقَالَ هُوَ لَكَ يَا عَبْدَ اللهِ ইবনু ‘উমার (রাঃ) বলেন, আমি এক বেয়াড়া উটে সাওয়ার ছিলাম। নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) সেটি ক্রয় করে বললেন, হে ‘আবদুল্লাহ! এটি তোমার। ২৫৯৯. মিসওয়ার ইবনু মাখরামাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) একবার কিছু কবা’ (পোশাক বিশেষ) বণ্টন করলেন। কিন্তু মাখরামাহকে তা হতে একটিও দিলেন না। মাখরামাহ (রাঃ) তখন (ছেলেকে) বললেন, প্রিয় বৎস! আমাকে রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর খিদমতে নিয়ে চল। [মিসওয়ার (রাঃ) বলেন] আমি তার সঙ্গে গেলাম, তখন তিনি আমাকে বললেন, যাও, ভেতরে গিয়ে তাঁকে আমার জন্য আহবান জানাও। [মিসওয়ার (রাঃ)] বলেন, অতঃপর আমি রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-কে আহবান জানালাম। তিনি বেরিয়ে এলেন। তখন তাঁর নিকট একটি কবা (জামা/আলখাল্লা) ছিল। তিনি বললেন, এটা আমি তোমার জন্য হিফাযত করে রেখে দিয়েছিলাম। মাখরামাহ (রাঃ) সেটি তাকিয়ে দেখলেন। নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বললেন, মাখরামাহ খুশী হয়ে গেছে। (২৬৫৭, ৩১২৭, ৫৮৬২, ৬১৩২, মুসলিম ১২/৪৪ হাঃ ১০৫৮, আহমাদ ১৮৯৪৯) (আধুনিক প্রকাশনীঃ ২৪১০, ইসলামিক ফাউন্ডেশনঃ ২৪২৭)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2600,
			"arabicnumber": 2600,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, এক ব্যক্তি রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর নিকট এল এবং বলল, আমি ধ্বংস হয়ে গিয়েছি। তিনি জিজ্ঞেস করলেন, তা কী? সে বলল, আমি রমাযানে দিনের বেলা স্ত্রী সম্ভোগ করেছি। তিনি জিজ্ঞেস করলেন, তুমি কি কোন গোলাম আযাদ করতে পারবে? সে বলল, না। তিনি জিজ্ঞেস করলেন, তুমি কি এক নাগাড়ে দু’মাস সিয়াম পালন করতে পারবে? সে বলল, না। তিনি জিজ্ঞেস করলেন, তাহলে তুমি কি ষাটজন মিসকীনকে খাওয়াতে পারবে? সে বলল, না। বর্ণনকারী বলেন, ইতোমধ্যে এক আনসারী এক আরক খেজুর নিয়ে আসল। আরক হল নির্দিষ্ট মাপের খেজুর মাপার পাত্র। তিনি বললেন, যাও, এটা নিয়ে গিয়ে সদাকাহ করে দাও। সে বলল, হে আল্লাহর রাসূল! আমাদের চেয়ে বেশি অভাবী এমন কাউকে সদাকাহ করে দিব? যিনি আপনাকে সত্য সহকারে প্রেরণ করেছেন, তাঁর কসম! কঙ্করময় মরুভূমির মাঝে (অর্থাৎ মদিনা্য়) আমাদের চেয়ে অভাবী কোন ঘর নেই। শেষে তিনি বললেন, যাও তা তোমার পরিবার-পরিজনদের খাওয়াও। (১৯৩৬) (আধুনিক প্রকাশনীঃ ২৪১১, ইসলামিক ফাউন্ডেশনঃ ২৪২৮)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2601,
			"arabicnumber": 2601,
			"text": "قَالَ شُعْبَةُ عَنْ الْحَكَمِ هُوَ جَائِزٌ وَوَهَبَ الحَسَنُ بْنُ عَلِيٍّ عَلَيْهِمَا السَّلَام لِرَجُلٍ دَيْنَهُ وَقَالَ النَّبِيُّ صلى الله عليه وسلم مَنْ كَانَ لَهُ عَلَيْهِ حَقٌّ فَلْيُعْطِهِ أَوْ لِيَتَحَلَّلْهُ مِنْهُ فَقَالَ جَابِرٌ قُتِلَ أَبِيْ وَعَلَيْهِ دَيْنٌ فَسَأَلَ النَّبِيُّ صلى الله عليه وسلم غُرَمَاءَهُ أَنْ يَقْبَلُوْا ثَمَرَ حَائِطِيْ وَيُحَلِّلُوْا أَبِي শু‘বা (রহ.) হাকাম (রহ.) থেকে বর্ণনা করে বলেন যে, তা বৈধ। হাসান ইবনু ‘আলী (রাঃ) তার পাওনা টাকা এক ব্যক্তিকে দান করেছিলেন। নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেন, কারো যিম্মায় কোন হক থাকলে তার দায়িত্ব সেটা পরিশোধ করে দেয়া, কিংবা হকদারের নিকট হতে মাফ করিয়ে নেয়া। জাবির (রাঃ) বলেন, আমার পিতা ঋণগ্রস্ত অবস্থায় শহীদ হলেন। তখন নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) আমার বাগানের খেজুরের বিনিময়ে আমার পিতাকে ঋণ হতে মুক্ত করতে পাওনাদারদেরকে বললেন। ২৬০১. জাবির ইবনু ‘আবদুল্লাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, উহুদ যুদ্ধে তাঁর পিতা শহীদ হলেন। পাওনাদাররা তাদের পাওনা আদায়ের ব্যাপারে শক্ত মনোভাব অবলম্বন করল। তখন আমি রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর নিকট হাযির হয়ে তাঁকে এ বিষয়ে বললাম। তখন তিনি তাদেরকে আমার বাগানের খেজুর নিয়ে আমার পিতাকে ঋণমুক্ত করতে বললেন। কিন্তু তারা অস্বীকার করল। রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) আমার বাগান তাদের দিলেন না এবং তাদের ফল কাটতেও দিলেন না। বরং তিনি বললেন, আগামীকাল ভোরে আমি তোমাদের নিকট যাব। জাবির (রাঃ) বলেন, পরদিন সকালে তিনি আমাদের নিকট আগমন করলেন এবং খেজুর বাগানে ঘুরে ঘুরে ফলের বরকতের জন্য দু‘আ করলেন। অতঃপর আমি ফল কেটে এনে তাদের ঋণ পরিশোধ করলাম। অতঃপরও সেই ফলের কিছু অংশ রয়ে গেল। পরে আমি রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর নিকট হাযির হয়ে তাঁকে সে সম্পর্কে জানালাম। তখন তিনি উপবিষ্ট ছিলেন। রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) উমরকে বললেন, শোন হে উমর! তখন তিনিও সেখানে উপবিষ্ট ছিলেন। ‘উমার (রাঃ) বললেন, আমরা কি আগে থেকেই জানি না যে, আপনি আল্লাহর রাসূল! আল্লাহর কসম! নিঃসন্দেহে আপনি আল্লাহর রাসূল। (২১২৭) (আধুনিক প্রকাশনীঃ ২৪১২, ইসলামিক ফাউন্ডেশনঃ ২৪২৯)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2602,
			"arabicnumber": 2602,
			"text": "وَقَالَتْ أَسْمَاءُ لِلْقَاسِمِ بْنِ مُحَمَّدٍ وَابْنِ أَبِيْ عَتِيْقٍ وَرِثْتُ عَنْ أُخْتِيْ عَائِشَةَ مَالًا بِالْغَابَةِ وَقَدْ أَعْطَانِيْ بِهِ مُعَاوِيَةُ مِائَةَ أَلْفٍ فَهُوَ لَكُمَا আসমা (রাঃ) কাসিম ইবনু মুহাম্মাদ এবং ইবনু আবূ ‘আতীক (রহ.)-কে বলেছেন, আমি আমার বোন ‘আয়িশাহ (রাঃ)-এর নিকট হতে উত্তরাধিকারসূত্রে গানাহ নামক স্থানে কিছু সম্পত্তি পেয়েছি। আর মু‘আবিয়াহ (রাঃ) আমাকে এর পরিবর্তে এক লাখ দিরহাম দিয়েছিলেন। এগুলো তোমাদের দু’জনের। ২৬০২. সাহল ইবনু সা‘দ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর নিকট কিছু পানীয় উপস্থিত করা হল। সেখান হতে কিছু তিনি নিজে পান করলেন। তাঁর ডান পার্শ্বে ছিল এক যুবক আর বাম পার্শ্বে ছিলেন বৃদ্ধগণ। তখন তিনি যুবককে বললেন, তুমি আমাকে অনুমতি দিলে এদেরকে আমি দিতে পারি। সে বলল, হে আল্লাহর রাসূল! আপনার (বারকাত) হতে আমার প্রাপ্য অংশের ব্যাপারে আমি অন্য কাউকে অগ্রগণ্য করতে পারি না। তখন তিনি তার হাতে পাত্রটি সজোরে রেখে দিলেন। (২৩৫১) (আধুনিক প্রকাশনীঃ ২৪১৩, ইসলামিক ফাউন্ডেশনঃ ২৪৩০)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2603,
			"arabicnumber": 2603,
			"text": "وَقَدْ وَهَبَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَأَصْحَابُهُ لِهَوَازِنَ مَا غَنِمُوْا مِنْهُمْ وَهُوَ غَيْرُ مَقْسُومٍ নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) ও তাঁর সাহাবীগণ হাওয়াযিন গোত্রের নিকট হতে যে গনীমত লাভ করেছিলেন, তা বণ্টিত না হওয়া সত্ত্বেও তাদেরকে তা দান করে দিয়েছিলেন। ২৬০৩. জাবির (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর নিকট মসজিদে উপস্থিত হলাম, তিনি আমাকে মূল্য পরিশোধ করলেন এবং আরো বেশি দিলেন। (৪৪৩) (আধুনিক প্রকাশনীঃ ২৪১৪, ইসলামিক ফাউন্ডেশনঃ ১৬২৭ অধ্যায়)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2604,
			"arabicnumber": 2604,
			"text": "জাবির ইবনু ‘আবদুল্লাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, এক সফরে আমি রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর নিকট একটা উট বিক্রয় করলাম। মদিনা্য় ফিরে এসে তিনি আমাকে বললেন, মসজিদে এস, দু’রাক‘আত সালাত আদায় কর। অতঃপর তিনি উটের দাম ওজন করে দিলেন। রাবী শু‘বা (রহ.) বলেন, আমার মনে হয় তিনি বলেছিলেন, অতঃপর তিনি আমাকে ওজন করে উটের দাম দিলেন এবং বলেন, তিনি ওজনে প্রাপ্যের অধিক দিলেন। হার্রা যুদ্ধের সময় সিরিয়াবাসীর ছিনিয়ে নেয়ার আগে পর্যন্ত আমার নিকট ঐ মালের কিছু অবশিষ্ট ছিল। (৪৪৩) (আধুনিক প্রকাশনীঃ ২৪১৫, ইসলামিক ফাউন্ডেশনঃ ২৪৩১)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2605,
			"arabicnumber": 2605,
			"text": "সাহল ইবনু সা‘দ (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর নিকট কিছু পানীয় উপস্থিত করা হল। তখন তাঁর ডানপাশে ছিল এক যুবক আর বামপাশে ছিল কয়েকজন বৃদ্ধ। তিনি যুবককে বললেন, তুমি কি আমাকে এই পানীয় এদের দেয়ার অনুমতি দিবে? যুবক বলল, না, আল্লাহর কসম! আপনার বরকত হতে আমার প্রাপ্য অংশের ক্ষেত্রে আমি কাউকে অগ্রাধিকার দিব না। তখন তিনি পান পাত্র তার হাতে সজোরে রেখে দিলেন। (২৩৫১) (আধুনিক প্রকাশনীঃ ২৪১৬, ইসলামিক ফাউন্ডেশনঃ ২৪৩২)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2606,
			"arabicnumber": 2606,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর নিকট এক ব্যক্তির কিছু ঋণ ছিল। (তাগাদা করতে এসে সে অশোভনীয় কিছু শুরু করলে) সাহাবীগণ তাকে কিছু করতে চাইলেন। তিনি তাদের বললেন, তাকে ছেড়ে দাও, পাওনাদারের কিছু বলার হক আছে। তিনি তাদের আরও বললেন, তাকে এক বছর বয়সী একটি উট খরিদ করে দাও। সাহাবীগণ বললেন, আমরা তো তার দেয়া এক বছর বয়সের উটের মতো পাচ্ছি না; বরং তার চেয়ে ভালো উট পাচ্ছি। তিনি বললেন, তবে তাই কিনে তাকে দিয়ে দাও। কেননা যে উত্তমরূপে ঋণ পরিশোধ করে, সে তোমাদের সর্বোত্তম ব্যক্তিদের মধ্যে। কিংবা তিনি বলেছেন, সে তোমাদের মধ্যে সর্বোত্তম। (২৩০৫) (আধুনিক প্রকাশনীঃ ২৪১৭, ইসলামিক ফাউন্ডেশনঃ ২৪৩৩)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2607,
			"arabicnumber": 2607,
			"text": "",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2609,
			"arabicnumber": 2609,
			"text": "وَيُذْكَرُ عَنْ ابْنِ عَبَّاسٍ أَنَّ جُلَسَاءَهُ شُرَكَاءُ وَلَمْ يَصِحَّ ইবনু ‘আব্বাস (রাঃ) হতে উল্লেখ করা হয়েছে, সঙ্গীরাও শরীক থাকবে, কিন্তু তা সহীহ নয়। ২৬০৯. আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত যে, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) নির্দিষ্ট বয়সের একটি উট ধার নিয়েছিলেন। কিছুদিন পর উটের মালিক এসে তাগাদা দিল। সাহাবীগণও তাকে কিছু বললেন। তখন নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বললেন, পাওনাদারদের কিছু বলার হক আছে। অতঃপর তিনি তাকে তার উটের চেয়ে উত্তম উট পরিশোধ করলেন এবং বললেন, ভালভাবে ঋণ পরিশোধকারী ব্যক্তিই তোমাদের মধ্যে সর্বোত্তম। (২৩০৫) (আধুনিক প্রকাশনীঃ ২৪১৯, ইসলামিক ফাউন্ডেশনঃ ২৪৩৫)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2610,
			"arabicnumber": 2610,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, এক সফরে তিনি নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর সঙ্গে ছিলেন এবং তখন ইবনু ‘উমার ‘উমার (রাঃ) একটি বেয়াড়া উটে সাওয়ার ছিলেন। উটটি বারবার নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর আগে যাচ্ছিল। আর তার পিতা ‘উমার (রাঃ) তাকে বলছিলেন, হে ‘আবদুল্লাহ! নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর আগে চলা কারো জন্য উচিত নয়। তখন নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) ‘উমার (রাঃ)-কে বললেন, এটা আমার নিকট বিক্রি কর। ‘উমার (রাঃ) বললেন, এটাতো আপনার। তখন তিনি সেটা ক্রয় করে বললেন, হে ‘আবদুল্লাহ! এটা তোমার। কাজেই এটা দিয়ে তুমি যা ইচ্ছা তাই করতে পার। (২১১৫) (আধুনিক প্রকাশনীঃ ২৪২০, ইসলামিক ফাউন্ডেশনঃ ২৪৩৬)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 2611,
			"arabicnumber": 2611,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, আমরা নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর সঙ্গে এক সফরে ছিলাম আর আমি (আমার পিতার) একটি বেয়াড়া উটের উপর সাওয়ার ছিলাম। তখন নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) উমরকে বললেন, এটা আমার নিকট বেঁচে দাও। তিনি তা বেঁচে দিলেন। অতঃপর নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) তাকে বললেন, হে ‘আবদুল্লাহ, এটা তোমার। (২১১৫) (ইসলামিক ফাউন্ডেশনঃ ১৬৩০ অধ্যায়)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 2612,
			"arabicnumber": 2612,
			"text": "‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, ‘উমার (রাঃ) মসজিদের দ্বার প্রান্তে একজোড়া রেশমী বস্ত্র দেখে বললেন, হে আল্লাহর রাসূল! এটা যদি আপনি ক্রয় করে নেন এবং তা জুমু‘আর দিনে ও প্রতিনিধি দলের সঙ্গে সাক্ষাতের সময় পরিধান করতেন। তখন তিনি বললেন, এ তো সে-ই পরিধান করে, আখিরাতে যার কোন অংশ নেই। পরে কিছু রেশমী জোড়া আসলে রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) সেখানে থেকে ‘উমার (রাঃ)-কে এক জোড়া দান করলেন। তখন ‘উমার (রাঃ) বললেন, আপনি এটা আমাকে পরিধান করতে দিলেন অথচ (আগে) রেশমী কাপড় সম্পর্কে আপনি যা বলার বলেছিলেন। রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বললেন, আমি তো এটা তোমাকে পরিধানের জন্য দেইনি। তখন ‘উমার (রাঃ) তা মক্কার তার এক মুশরিক ভাইকে দিয়ে দিলেন। (৮৮৬) (আধুনিক প্রকাশনীঃ ২৪২১, ইসলামিক ফাউন্ডেশনঃ ২৪৩৭)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 2613,
			"arabicnumber": 2613,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) একদা ফাতিমাহর ঘরে গেলেন। কিন্তু ভিতরে প্রবেশ করলেন না। ‘আলী (রাঃ) ঘরে এলে ফাতিমাহ (রাঃ) তাকে ঘটনা জানালেন। তিনি আবার নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর নিকট বিষয়টি নিবেদন করলেন। তখন তিনি বললেন, আমি তার দরজায় নকশা করা পর্দা ঝুলতে দেখেছি। দুনিয়ার চাকচিক্যের সঙ্গে আমার কী সম্পর্ক? ‘আলী (রাঃ) ফাতিমাহর নিকট এসে ঘটনা খুলে বললেন। ফাতিমাহ (রাঃ) বললেন, তিনি আমাকে এ সম্পর্কে যা ইচ্ছা নির্দেশ দিন। তখন নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বললেন, অমুক পরিবারের অমুকের নিকট এটা পাঠিয়ে দাও; তাদের প্রয়োজন আছে। (আধুনিক প্রকাশনীঃ ২৪২২, ইসলামিক ফাউন্ডেশনঃ ২৪৩৮)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 2614,
			"arabicnumber": 2614,
			"text": "আলী (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) আমাকে একজোড়া রেশমী কাপড় দিলেন। আমি তা পরিধান করলাম। তাঁর মুখমন্ডলে গোস্বার ভাব দেখতে পেয়ে আমি আমার মহিলাদের মাঝে তা ভাগ করে দিয়ে দিলাম। (৫৩৬৬, ৫৮৪০, মুসলিম ৩৭/আ্উয়ালুল কিতাব হাঃ ২০৭১, আহমাদ ১১৭১) (আধুনিক প্রকাশনীঃ ২৪২৩, ইসলামিক ফাউন্ডেশনঃ ২৪৩৯)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 2616,
			"arabicnumber": 2616,
			"text": "",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 2617,
			"arabicnumber": 2617,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। তিনি বলেন, এক ইয়াহূদী মহিলা নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর খিদমতে বিষ মিশানো বকরী নিয়ে এল। সেখান হতে কিছু অংশ তিনি খেলেন, অতঃপর মহিলাকে হাযির করা হল। তখন বলা হল, আপনি কি একে হত্যা করবেন না? তিনি বললেন, না। আনাস (রাঃ) বলেন, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর তালুতে আমি বরাবরই বিষক্রিয়ার আলামত দেখতে পেতাম। (মুসলিম ৩৯/১৭ হাঃ ২১৯০) (আধুনিক প্রকাশনীঃ ২৪২৫, ইসলামিক ফাউন্ডেশনঃ ২৪৪১)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 2618,
			"arabicnumber": 2618,
			"text": "‘আবদুর রহমান ইবনু আবূ বাকর (রাঃ) হতে বর্ণিত। তিনি বলেন, সফরে নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর সঙ্গে আমরা একশ’ ত্রিশজন ব্যক্তি ছিলাম। সে সময় নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) জিজ্ঞেস করলেন, তোমাদের কারো সঙ্গে কি খাবার আছে? দেখা গেল, এক ব্যক্তির সঙ্গে এক সা‘ কিংবা তার কমবেশী পরিমাণ খাদ্য আছে। সে আটা গোলানো হল। অতঃপর দীর্ঘ দেহী এলোমেলো চুলওয়ালা এক মুশরিক এক পাল বকরী হাঁকিয়ে নিয়ে এল। নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) জিজ্ঞেস করলেন- বিক্রি করবে, না উপহার দিবে? সে বললঃ না, বরং বিক্রি করব। নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) তার নিকট হতে একটা বকরী কিনে নিলেন। সেটাকে যব্হ করা হল। নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বকরীর কলিজা ভুনা করার আদেশ দিলেন। আল্লাহর কসম! একশ’ ত্রিশজনের প্রত্যেককে নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) সেই কলিজার কিছু কিছু করে দিলেন। উপস্থিতদের হাতে দিলেন; আর অনুপস্থিত ছিল তার জন্য তুলে রাখলেন। অতঃপর দু’টি পাত্রে তিনি গোশত ভাগ করে রাখলেন। সবাই পরিতৃপ্ত হয়ে খেল। আর উভয় পাত্রে কিছু উদ্বৃত্ত রয়ে গেল। সেগুলো আমরা উটের পিঠে উঠিয়ে নিলাম। অথবা রাবী যা বললেন। (২২১৬, মুসলিম আওয়ালুল কিতাব/৩২ হাঃ ২০৫৬, আহমাদ ১৭০৩) (আধুনিক প্রকাশনীঃ ২৪২৬, ইসলামিক ফাউন্ডেশনঃ ২৪৪২)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 2619,
			"arabicnumber": 2619,
			"text": "(وَقَوْلِ اللهِ تَعَالَى )لَا يَنْهَاكُمْ اللهُ عَنِ الَّذِيْنَ لَمْ يُقَاتِلُوْكُمْ فِي الدِّيْنِ وَلَمْ يُخْرِجُوْكُمْ مِّنْ دِيَارِكُمْ أَنْ تَبَرُّوْهُمْ وَتُقْسِطُوْا إِلَيْهِمْ إِنَّ اللهَ يُحِبُّ الْمُقْسِطِيْنَ( (الممتحنة : 8) আল্লাহ তা‘আলার ইরশাদঃ (মুশরিকদের মধ্যে) দ্বীনের ব্যাপারে যারা তোমাদের বিরুদ্ধে যুদ্ধ করেনি এবং তোমাদেরকে নিজ দেশ থেকে বের করে দেয়নি, তাদের প্রতি মহানুভবতা প্রদর্শন ও ন্যায়বিচার করতে আল্লাহ তোমাদেরকে নিষেধ করেন না। আল্লাহ তো ন্যায়পরায়ণদেরকে ভালোবাসেন। (সূরা আল-মুমতাহিনাঃ ৮) ২৬১৯. ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, ‘উমার (রাঃ) এক ব্যক্তিকে রেশমী বস্ত্র বিক্রি করতে দেখে নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-কে বললেন, এ জোড়াটি খরিদ করে নিন। জুমুআর দিনে এবং যখন আপনার নিকট কোন প্রতিনিধি দল আসে, তখন তা পরিধান করবেন। তিনি বললেন, এসব তো তারাই পরিধান করে, যাদের আখিরাতে কোন হিস্সা নেই। পরে রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর নিকট কয়েক জোড়া রেশমী কাপড় এল। সেগুলো হতে একটি জোড়া তিনি ‘উমার (রাঃ)-এর নিকট পাঠালেন। তখন ‘উমার (রাঃ) বলেন, এটা আমি কিভাবে পরিধান করব। অথচ এ সম্পর্কে আপনি যা বলার বলেছেন। এতে তিনি বললেন, এটা তোমাকে আমি পরিধান করার জন্য দেইনি। হয় এটা বিক্রয় করে দিবে, নতুবা কাউকে দিয়ে দিবে। তখন ‘উমার (রাঃ) সেটা মক্কার বাসিন্দা তাঁর এক ভাইকে ইসলাম গ্রহণের আগে হাদিয়া পাঠালেন। (৮৮৬) (আধুনিক প্রকাশনীঃ ২৪২৭, ইসলামিক ফাউন্ডেশনঃ ২৪৪৩)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 2620,
			"arabicnumber": 2620,
			"text": "আসমা বিনতে আবূ বাকর (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর যুগে আমার আম্মা মুশরিক অবস্থায় আমার নিকট এলেন। আমি রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর নিকট ফাতওয়া চেয়ে বললাম, তিনি আমার প্রতি খুবই আকৃষ্ট, এমতাবস্থায় আমি কি তার সঙ্গে সদাচরণ করব? তিনি বললেন, হ্যাঁ, তুমি তোমার মায়ের সঙ্গে সদাচরণ কর। (৩১৮৩, ৫৯৭৮, ৫৯৭৯) (মুসলিম ১২/১৪ হাঃ ১০০৩, আহমাদ ২৬৯৮১) (আধুনিক প্রকাশনীঃ ২৪২৮, ইসলামিক ফাউন্ডেশনঃ ২৪৪৪)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 2621,
			"arabicnumber": 2621,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেন, দান করার পর যে তা ফিরিয়ে নেয়, সে ঐ লোকের মত, যে বমি করে তা আবার খায়। (২৫৮৯) (আধুনিক প্রকাশনীঃ ২৪২৯, ইসলামিক ফাউন্ডেশনঃ ২৪৪৫)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 2622,
			"arabicnumber": 2622,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেন, খারাপ উপমা দেয়া আমাদের জন্য শোভনীয় নয় তবু যে দান করে তা ফিরিয়ে নেয়, সে ঐ কুকুরের মতো, যে বমি করে তা আবার খায়। (২৫৮৯) (আধুনিক প্রকাশনীঃ ২৪৩০, ইসলামিক ফাউন্ডেশনঃ ২৪৪৬)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 2623,
			"arabicnumber": 2623,
			"text": "‘উমার ইবনু খাত্তাব (রাঃ) হতে বর্ণিত। তিনি বলেন, এক লোককে আমি আমার একটি ঘোড়া আল্লাহর রাস্তায় আরোহণের জন্য দান করলাম। ঘোড়াটি যার নিকট ছিল, সে তার চরম অযত্ন করল। তাই সেটা আমি তার নিকট হতে কিনে নিতে চাইলাম। আমার ধারণা ছিল যে, সে তা কম দামে বিক্রি করবে। এ সম্পর্কে নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-কে জিজ্ঞেস করলে তিনি বললেন, এক দিরহামের বিনিময়েও যদি সে তোমাকে তা দিতে রাজী হয় তবু তুমি তা ক্রয় কর না। কেননা, সদাকাহ করার পর যে তা ফিরিয়ে নেয়, সে ঐ কুকুরের মত, যে বমি করে আবার তা খায়। (১৪৯০) (আধুনিক প্রকাশনীঃ ২৪৩১, ইসলামিক ফাউন্ডেশনঃ ২৪৪৭)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 2624,
			"arabicnumber": 2624,
			"text": "‘আবদুল্লাহ ইবনু উবায়দুল্লাহ ইবনু আবূ মুলায়কা (রহ.) হতে বর্ণিত। তিনি বলেন, ইবনু জুদ‘আনের আযাদকৃত গোলাম সুহাইবের সন্তান দু’টি ঘর ও একটি কামরা রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) সুহায়ব (রাঃ)-কে দান করেছিলেন বলে দাবী জানান। (মদিনার গভর্নর) মারওয়ান (রহ.) তখন বললেন, এ ব্যাপারে তোমাদের পক্ষে কে সাক্ষী দিবে? তারা বলল, ইবনু ‘উমার (রাঃ)। মারওয়ান (রহ.) তখন ইবনু ‘উমার (রাঃ)-কে ডেকে পাঠালেন। তিনি এ মর্মে সাক্ষ্য দিলেন যে, রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) সুহায়ব (রাঃ)-কে দু’টি ঘর ও একটি কামরা দান করেছিলেন। তাদের স্বপক্ষে ইবনু ‘উমারের সাক্ষ্য অনুযায়ী মারওয়ান ফায়সালা করলেন। (আধুনিক প্রকাশনীঃ ২৪৩২, ইসলামিক ফাউন্ডেশনঃ ২৪৪৮)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 2625,
			"arabicnumber": 2625,
			"text": "(أَعْمَرْتُهُ الدَّارَ فَهِيَ عُمْرَى جَعَلْتُهَا لَهُ )اسْتَعْمَرَكُمْ فِيْهَا( (هود : ৬১) جَعَلَكُمْ عُمَّارًا أَعْمَرْتُهُ الدَّارَ অর্থাৎ বাড়ীটি তাকে (তার জীবনকাল পর্যন্ত) দান করে দিলাম। আল্লাহর বাণীঃ তোমাদেরকে তিনি তাতে বসবাস করিয়েছেন। (সূরা হূদঃ ৬১) ২৬২৫. জাবির (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) ‘উমরাহ (বস্তু) সম্পর্কে ফায়সালা দিয়েছেন যে, যাকে দান করা হয়েছে, সে-ই সেটার মালিক হবে। (মুসলিম ২৪/৪ হাঃ ১৬২৫) (আধুনিক প্রকাশনীঃ ২৪৩৩, ইসলামিক ফাউন্ডেশনঃ ২৪৪৯)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 2626,
			"arabicnumber": 2626,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেন, ‘উমরাহ বৈধ। ‘আতা (রহ.) বলেন, জাবির (রাঃ) আমাকে নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) হতে একই রকম হাদীস শুনিয়েছেন। (মুসলিম ২৪/৪ হাঃ ১৬২৫, ১৬২৬, আহমাদ ৮৫৭৫) (আধুনিক প্রকাশনীঃ ২৪৩৪, ইসলামিক ফাউন্ডেশনঃ ২৪৫০)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 2627,
			"arabicnumber": 2627,
			"text": "ক্বাতাদাহ (রহ.) হতে বর্ণিত। তিনি বলেন, আনাস (রাঃ)-কে বলতে শুনেছি, মদিনা্য় একবার শত্রুর আক্রমণের ভয় ছড়িয়ে পড়ল। নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) তখন আবূ ত্বলহা (রাঃ)-এর নিকট হতে একটি ঘোড়া ধার নিলেন এবং তাতে সাওয়ার হলেন। ঘোড়াটির নাম ছিল মানদূব। অতঃপর তিনি ঘোড়াটিতে টহল দিয়ে ফিরে এসে বললেন, কিছুই তো দেখতে পেলাম না, তবে এই ঘোড়াটিকে আমি সমুদ্রের তরঙ্গের মতো পেয়েছি। (২৮২০, ২৮৫৭, ২৮৬২, ২৮৬৬, ২৮৬৭, ২৯০৮, ২৯৬৮, ২৯৬৯, ৩০৪০, ৬০৩৩, ৬২১২) (আধুনিক প্রকাশনীঃ ২৪৩৫, ইসলামিক ফাউন্ডেশনঃ ২৪৫১)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 2628,
			"arabicnumber": 2628,
			"text": "আয়মান (রহ.) হতে বর্ণিত। তিনি বলেন, ‘আয়িশাহ (রাঃ)-এর নিকট আমি হাযির হলাম। তাঁর গায়ে তখন পাঁচ দিরহাম মূল্যের মোটা কাপড়ের কামিজ ছিল। তিনি আমাকে বললেন, আমার এ বাঁদীটার দিকে তাকাও, ঘরের ভিতরে এটা পরতে সে অপছন্দ করে। অথচ রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর যামানায় মদিনার মেয়েদের মধ্যে আমারই শুধু একটি কামিজ ছিল। মদিনায় কোন মেয়েকে বিয়ের সাজে সাজাতে গেলেই আমার নিকট কাউকে পাঠিয়ে ঐ কামিজটি চেয়ে নিত। (আধুনিক প্রকাশনীঃ ২৪৩৬, ইসলামিক ফাউন্ডেশনঃ ২৪৫২)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 2629,
			"arabicnumber": 2629,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেন, মানীহা হিসাবে অধিক দুগ্ধবতী উটনী ও অধিক দুগ্ধবতী বকরী কতই না উত্তম, যা সকাল বিকাল পাত্র ভর্তি দুধ দেয়। (৫৬০৮, মুসলিম ১২/২২ হাঃ ১০১৯, আহমাদ ১০২০) (আধুনিক প্রকাশনীঃ ২৪৩৭, ইসলামিক ফাউন্ডেশনঃ ২৪৫৩) (ইমাম বুখারী বলেন) ‘আবদুল্লাহ ইবনু ইউসুফ ও ইসমাঈল (রহ.) হাদীসটি মালিক (রহ.) হতে বর্ণনা করেছেন, এতে তিনি বলেন, সদাকাহ হিসাবে কতই না উত্তম (দুগ্ধবতী উটনী, যা মানীহা হিসাবে দেয়া হয়)। (ইসলামিক ফাউন্ডেশনঃ ২৪৫৪)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 2630,
			"arabicnumber": 2630,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। তিনি বলেন, মক্কা হতে মদিনা্য় হিজরাতের সময় মুহাজিরদের হাকে কোন কিছু ছিল না। অন্যদিকে আনসারগণ ছিলেন জমি ও ভূসম্পত্তির অধিকারী। তাই আনসারগণ এই শর্তে মুহাজিরদের সঙ্গে ভাগাভাগি করে নিলেন যে, প্রতি বছর তারা (আনসারগণ)-এর উৎপন্ন ফল ও ফসলের একটা নির্দিষ্ট পরিমাণ তাদের (মুহাজিরগণের) দিবেন আর তারা এ কাজে শ্রম দিবে ও দায়-দায়িত্ব নিবে। আনাসের মা উম্মু সুলাইম (রাঃ) ছিলেন ‘আবদুল্লাহ ইবনু আবূ ত্বলহার মা। আনাসের মা রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-কে (ফল ভোগ করার জন্য) কয়েকটি খেজুর গাছ দিয়েছিলেন। আর নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) সেগুলো তাঁর আযাদকৃত বাঁদী ‘উসমান ইবনু যায়দের মা উম্মু আয়মানকে দান করে দিয়েছিলেন। ইবনু শিহাব (রহ.) বলেন, আনাস (রাঃ) আমাকে বলেছেন যে, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) খায়বারে ইয়াহূদীদের বিরুদ্ধে লড়াই শেষে মদিনা্য় ফিরে এলে মুহাজিরগণ আনসারদেরকে তাদের দানের সম্পত্তি ফিরিয়ে দিলেন; যেগুলো ফল ও ফসল ভোগ করার জন্য তারা মুহাজিরদের দান করেছিলেন। নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-ও তাঁর (আনাসের) মাকে তার খেজুর গাছগুলো ফিরিয়ে দিয়েছিলেন। অতঃপর রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) উম্মু আয়মানকে ঐ গাছগুলোর পরিবর্তে নিজ বাগানের কিছু অংশ দান করলেন। আহমাদ ইবনু শাবীব (রহ.) বলেন, আমার পিতা আমাদেরকে ইউনুসের সূত্রে এ হাদীসটি উল্লেখ করেছেন এবং حَائِطِهِ এর স্থলে خَالِصِهِ বলেছেন, যার অর্থ নিজ ভূমি থেকে। (৩১২৮, ৪০৩০, ৪১২০) (মুসলিম ৩২/২৪, হাঃ ১৭৭১) (আধুনিক প্রকাশনীঃ ২৪৩৮, ইসলামিক ফাউন্ডেশনঃ ২৪৫৫)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 2631,
			"arabicnumber": 2631,
			"text": "‘আবদুল্লাহ ইবনু আমর (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেন, চল্লিশটি স্বভাবের মধ্যে সর্বোৎকৃষ্ট হল দুধ পান করার জন্য কাউকে বকরী দেয়া। কোন বান্দা যদি সওয়াবের আশায় এবং পুরস্কার দানের প্রতিশ্রুতিতে বিশ্বাস রেখে উক্ত চল্লিশ স্বভাবের যে কোন একটির উপরে আমল করে তবে আল্লাহ অবশ্যই তাকে জান্নাতে প্রবেশ করাবেন। হাস্সান (রহ.) বলেন, দুধেল বকরী মানহি দেয়া ব্যতীত আর যে কয়টি স্বভাব আমরা গণনা করলাম, সেগুলো হল সালামের উত্তর দেয়া, হাঁচি দাতার হাঁচির উত্তরে ইয়ারহামুকাল্লাহ বলা, পথ হতে কষ্টদায়ক বস্তু সরানো ইত্যাদি। কিন্তু আমরা পনেরটি স্বভাবের অধিক গণনা করতে পারলাম না। (আধুনিক প্রকাশনীঃ ২৪৩৯, ইসলামিক ফাউন্ডেশনঃ ২৪৫৬)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 2632,
			"arabicnumber": 2632,
			"text": "জাবির (রাঃ) হতে বর্ণিত তিনি বলেন, আমাদের মধ্যে কিছু লোকের অতিরিক্ত ভূসম্পত্তি ছিল।। তারা পরস্পর পরামর্শ করে ঠিক করল যে, এগুলো তারা তিন ভাগের এক ভাগ, চার ভাগের এক ভাগ বা অর্ধেক হিসাবে ইজারা দিবে। এ কথা শুনে আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বললেন, কারো অতিরিক্ত জমি থাকলে হয় সে নিজেই চাষ করবে, কিংবা তার ভাইকে তা (চাষ করতে) দিবে। আর তা না করতে চাইলে তা নিজের কাছেই রেখে দিবে। (২৩৪০) (আধুনিক প্রকাশনীঃ ২৪৪০, ইসলামিক ফাউন্ডেশনঃ ২৪৫৭)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 2633,
			"arabicnumber": 2633,
			"text": "আবূ সা‘ঈদ (রাঃ) হতে বর্ণিত। তিনি বলেন, এক বেদুঈন নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর নিকট এসে হিজরাত সম্পর্কে জানতে চাইল। তিনি তাকে বললেন, থাম! হিজরাতের ব্যাপার বড় কঠিন। বরং তোমার কি উট আছে? সে বলল, হ্যাঁ আছে। তিনি বললেন, তুমি কি এর সদাকাহ আদায় করে থাক? সে বলল, হ্যাঁ। তিনি জিজ্ঞেস করলেন, তুমি দুধ পানের জন্য এগুলো মানীহা হিসাবে দিয়ে থাক? সে বলল, হ্যাঁ। আবার তিনি প্রশ্ন করলেন, আচ্ছা! পানি পান করানোর উটগুলো দোহন কর কি? সে বলল, হ্যাঁ। তখন তিনি ইরশাদ করলেন, এ যদি হয় তাহলে সাগরের ওপারে হলেও অর্থাৎ তুমি যেখানে থাক ‘আমল করতে থাক। আল্লাহ তোমার ‘আমলের প্রতিদানে কম করবেন না। (৪৫২) (আধুনিক প্রকাশনীঃ ২৪৪১, ইসলামিক ফাউন্ডেশনঃ ২৪৫৭ শেষাংশ)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 2634,
			"arabicnumber": 2634,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) একবার এক জমিতে গেলেন, যার ফসলগুলো আন্দোলিত হচ্ছিল। তিনি জানতে চাইলেন, কার জমি? লোকেরা বলল, অমুক ব্যক্তি এটি ইজারা নিয়েছে। তিনি বললেন, জমিটার নির্দিষ্ট ভাড়া গ্রহণ না করে সে যদি তাকে সাময়িকভাবে তা দিয়ে দিত তবে সেটাই হত তার জন্য উত্তম। (২৩৩০) (আধুনিক প্রকাশনীঃ ২৪৪২, ইসলামিক ফাউন্ডেশনঃ২৪৫৮)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 2635,
			"arabicnumber": 2635,
			"text": "وَقَالَ بَعْضُ النَّاسِ هَذِهِ عَارِيَّةٌ وَإِنْ قَالَ كَسَوْتُكَ هَذَا الثَّوْبَ فَهُوَ هِبَةٌ কোন কোন ফিকাহ্ বিশারদ বলেন, এটা আরিয়ত হবে। তবে কেউ যদি বলে, এ কাপড়টি তোমাকে পরিধান করতে দিলাম, তবে তা হিবা হবে। ২৬৩৫. আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর বর্ণিত গ্রন্থ হতে বলেছেন, ইবরাহীম (আঃ) সারাকে সঙ্গে নিয়ে হিজরাত করলেন। লোকেরা সারার উদ্দেশে হাজিরাকে হাদিয়া দিলেন। তিনি ফিরে এসে (ইবরাহীমকে) বললেন, আপনি কি জেনেছেন, কাফিরকে আল্লাহ পরাস্ত করেছেন এবং সেবার জন্য একটি বালিকা দান করেছেন। ইবনু সীরীন (রহ.) বলেন, আবূ হুরাইরাহ্ (রাঃ)-এর সূত্রে নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) থেকে বর্ণনা করেন, অতঃপর (সেই কাফির) সারার উদ্দেশে হাজিরাকে দান করল। (২২১৭) (আধুনিক প্রকাশনীঃ ২৪৪৩, ইসলামিক ফাউন্ডেশনঃ ২৪৫৯)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 2636,
			"arabicnumber": 2636,
			"text": "وَقَالَ بَعْضُ النَّاسِ لَهُ أَنْ يَرْجِعَ فِيْهَا আর কোন কোন ফিকাহ্ বিশারদ বলেন, দাতা তা ফিরিয়ে নিতে পারে। ২৬৩৬. ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, একদা আমি জনৈক ব্যক্তিকে আল্লাহর পথে বাহন হিসাবে একটি ঘোড়া দিলাম। পরে তা বিক্রি হতে দেখে আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-কে সে সম্পর্কে জিজ্ঞেস করলাম। তিনি বলেন, এটা ক্রয় করো না এবং সদাকাহ করা মাল ফিরিয়ে নিও না। (১৪৯০) (আধুনিক প্রকাশনীঃ ২৪৪৪, ইসলামিক ফাউন্ডেশনঃ ২৪৬০)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 68
			}
		}
	]
}