{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"53": "Peacemaking"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2690,
			"arabicnumber": 2690,
			"text": "(وَقَوْلِ اللهِ تَعَالَى )لَا خَيْرَ فِيْ كَثِيْرٍ مِّنْ نَّجْوٰهُمْ إِلَّا مَنْ أَمَرَ بِصَدَقَةٍ أَوْ مَعْرُوفٍ أَوْ إِصْلَاحٍم بَيْنَ النَّاسِ وَمَنْ يَّفْعَلْ ذٰلِكَ ابْتِغَآءَ مَرْضَاةِ اللهِ فَسَوْفَ نُؤْتِيْهِ أَجْرًا عَظِيْمًا( (النساء : 114) وَخُرُوْجِ الْإِمَامِ إِلَى الْمَوَاضِعِ لِيُصْلِحَ بَيْنَ النَّاسِ بِأَصْحَابِهِ আল্লাহ তা‘আলার বাণীঃ তাদের অধিকাংশ গোপন পরামর্শে কোন কল্যাণ নেই। তবে কল্যাণ আছে যে দান-খয়রাত, সৎকার্য ও মানুষের মধ্যে সমঝোতা স্থাপনের নির্দেশ দেয় তার পরামর্শে.....শেষ পর্যন্ত- (সূরা আন-নিসা ১১৪)। মানুষের মধ্যে আপোস করিয়ে দেয়ার উদ্দেশে সঙ্গী-সাথীদের নিয়ে ইমামের (ঘটনা) স্থানে যাওয়া। ২৬৯০. সাহল ইবনু সা‘দ (রাঃ) হতে বর্ণিত যে, আমর ইবনু ‘আউফ গোত্রের কিছু লোকের মধ্যে সামান্য বিবাদ ছিল। তাই নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) তাঁর সাহাবীগণের একটি জামা‘আত নিয়ে তাদের মধ্যে আপোস-মীমাংসা করে দেয়ার জন্য সেখানে গেলেন। এদিকে সালাতের সময় হয়ে গেল। কিন্তু নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) মসজিদে নাবাবীতে এসে পৌঁছেননি। বিলাল (রাঃ) আবু বাকর (রাঃ)-এর নিকট এসে বললেন, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) কাজে ব্যস্ত হয়ে পড়েছেন। এদিকে সালাতেরও সময় হয়ে গেছে। আপনি কি সালাতে লোকদের ইমামত করবেন?’ তিনি বললেন, ‘হ্যাঁ, তুমি যদি ইচ্ছা কর।’ অতঃপর বিলাল (রাঃ) সালাতের ইকামত বললেন, আর আবু বাকর (রাঃ) এগিয়ে গেলেন। পরে নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) এলেন এবং কাতারগুলো অতিক্রম করে প্রথম কাতারে এসে দাঁড়ালেন। (তা দেখে) লোকেরা হাততালি দিতে শুরু করল এবং তা অধিক মাত্রায় দিতে লাগল। আবূ বাকর (রাঃ) সালাত অবস্থায় কোন দিকে তাকাতেন না, কিন্তু (হাততালির কারণে) তিনি তাকিয়ে দেখতে পেলেন যে, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) তাঁর পেছনে দাঁড়িয়েছেন। নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) তাঁকে হাতের ইশারায় আগের মত সালাত আদায় করে যেতে নির্দেশ দিলেন। আবু বাকর (রাঃ) তাঁর দু’হাত উপরে তুলে আল্লাহর হামদ বর্ণনা করলেন। অতঃপর কিবলার দিকে মুখ রেখে পেছনে ফিরে এসে কাতারে সামিল হলেন। তখন নবী(সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) আগে বেড়ে লোকদের ইমামত করলেন এবং সালাত সমাপ্ত করে লোকদের দিকে ফিরে বললেন, ‘হে লোক সকল! সালাত অবস্থায় তোমাদের কিছু ঘটলে তোমরা হাত তালি দিতে শুরু কর। অথচ হাততালি দেয়া মেয়েদের কাজ। সালাত অবস্থায় কারো কিছু ঘটলে সে যেন ‘সুবহানাল্লাহ্’ ‘সুবহানাল্লাহ্’ বলে। কেননা, এটা শুনলে কেউ তার দিকে দৃষ্টিপাত না করে পারতো না।’ ‘হে আবূ বাকর! তোমাকে যখন ইশারা করলাম, তখন সালাত আদায় করাতে তোমার কিসের বাধা ছিল?’ তিনি বললেন, ‘আবূ কুহাফার পুত্রের জন্য শোভা পায় না নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর সামনে ইমামত করা। (৬৮৪) (আধুনিক প্রকাশনীঃ ২৪৯৫, ইসলামিক ফাউন্ডেশনঃ ২৫০৮১)",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2691,
			"arabicnumber": 2691,
			"text": "আনাস (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-কে বলা হলো, আপনি যদি ‘আবদুল্লাহ্ ইবনু ‘উবাইয়ের নিকট একটু যেতেন। নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) তাঁর নিকট গাধায় চড়ে গেলেন এবং মুসলিমরা তাঁর সঙ্গে হেঁটে চললো। সে পথ ছিল কংকরময়। নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) তার নিকট এসে পৌঁছলে সে বলল, ‘সরো আমার কাছ থেকে। আল্লাহর কসম, তোমার গাধার দুর্গন্ধ আমাকে কষ্ট দিচ্ছে।’ তাঁদের মধ্য হতে একজন আনসারী বললোঃ আল্লাহর কসম, আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর গাধা সুগন্ধে তোমার চেয়ে উত্তম। ‘আবদুল্লাহ্ ইবনু উবাই-এর গোত্রের জনৈক ব্যক্তি রেগে গেল এবং দু’জনে গালাগালি করল। এভাবে উভয়ের পক্ষের সঙ্গীরা রেগে উঠল এবং উভয় দলের সঙ্গে লাঠালাঠি, হাতাহাতি ও জুতা মারামারি হল। আমাদের জানান হয়েছে যে, এই ব্যাপারে এ আয়াত নাযিল হলোঃ মুমিনদের দু’দল বিবাদে লিপ্ত হলে তোমরা তাদের মধ্যে মীমাংসা করে দিবে। (সূরা আল-হুজরাত ৯) আবূ ‘আবদুল্লাহ্ (ইমাম বুখারী) (রহ.) বলেন, ‘মুসাদ্দাদ (রহ.) বসার এবং হাদীস বর্ণনার পূর্বে আমি তার নিকট হতে এ হাদীস চয়ন করেছি। (মুসলিম ৩২/৪০, হাঃ ১৭৯৯) (আধুনিক প্রকাশনীঃ ২৪৯৬, ইসলামিক ফাউন্ডেশনঃ ২৫০৯)",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2692,
			"arabicnumber": 2692,
			"text": "উম্মু কুলসুম বিনতে ‘উকবাহ (রাঃ) হতে বর্ণিত যে, তিনি আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-কে বলতে শুনেছেন, সে ব্যক্তি মিথ্যাচারী নয়, যে মানুষের মধ্যে মীমাংসা করার জন্য ভালো কথা পৌঁছে দেয় কিংবা ভালো কথা বলে। (মুসলিম ৪৫/২৭ হাঃ ২৬০৫, আহমাদ ২৭৩৪১) (আধুনিক প্রকাশনীঃ ২৪৯৭, ইসলামিক ফাউন্ডেশনঃ ২৫১০)",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2693,
			"arabicnumber": 2693,
			"text": "সাহল ইবনু সা‘দ (রাঃ) হতে বর্ণিত যে, কুবা-এর অধিবাসীদের মধ্যে লড়াই বেধে গেল। এমনকি তারা পাথর ছোঁড়াছুঁড়ি শুরু করল। এ ব্যাপারে আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-কে খবর দেয়া হলে তিনি বললেন, ‘চল যাই তাদের মধ্যে মীমাংসা করে দেই।’ (৬৮৪) (আধুনিক প্রকাশনীঃ ২৪৯৮, ইসলামিক ফাউন্ডেশনঃ ২৫১১)",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2694,
			"arabicnumber": 2694,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। আল্লাহ তা‘আলার বাণীঃ কোন স্ত্রী যদি তার স্বামীর অবজ্ঞা ও উপেক্ষার আশংকা করে- (সূরা আন-নিসা ১২৮)। এই আয়াতটি সম্পর্কে তিনি বলেন, আয়াতের লক্ষ্য হল, ‘কেউ তার স্ত্রীর মধ্যে বার্ধক্য বা অপছন্দনীয় কিছু দেখতে পেয়ে তাকে ত্যাগ করতে মনস্থ করে আর স্ত্রী বলে যে, তুমি আমাকে তোমার নিকট রাখ এবং তোমার যেটুকু ইচ্ছা আমার অংশ নির্ধারণ কর।’ ‘আয়িশাহ (রাঃ) বলেন, ‘উভয়ে রাজী হলে এতে দোষ নেই।’ (২৪৫০) (আধুনিক প্রকাশনীঃ ২৪৯৯, ইসলামিক ফাউন্ডেশনঃ ২৫১২)",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2695,
			"arabicnumber": 2695,
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2697,
			"arabicnumber": 2697,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেন, ‘কেউ আমাদের এ শরী‘আতে নাই এমন কিছুর অনুপ্রবেশ ঘটালে তা প্রত্যাখ্যাত[*]।’ ‘আবদুল্লাহ্ ইবনু জা‘ফর মাখরামী (রহ.) ও ‘আবদুল ওয়াহিদ ইবনু আবূ ‘আউন, সা‘দ ইবনু ইব্রাহীম (রহ.) হতে তা বর্ণনা করেছেন। (মুসলিম ৩০/৮ হাঃ ১৭১৮, আহমাদ ২৬০৯২) (আধুনিক প্রকাশনীঃ ২৫০১, ইসলামিক ফাউন্ডেশনঃ ২৫১৪)",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2698,
			"arabicnumber": 2698,
			"text": "বারা’ ইবনু ‘আযিব (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) হুদায়বিয়াতে (মক্কাবাসীদের সঙ্গে) সন্ধি করার সময় ‘আলী (রাঃ) উভয় পক্ষের মাঝে এক চুক্তিপত্র লিখলেন। তিনি লিখলেন, মুহাম্মাদুর রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)। মুশরিকরা বলল, ‘মুহাম্মাদুর রাসূলুল্লাহ’ লিখবে না। আপনি রাসূল হলে আপনার সঙ্গে লড়াই করতাম না?’ তখন তিনি আলীকে বললেন, ‘ওটা মুছে দাও’। ‘আলী (রাঃ) বললেন, ‘আমি তা মুছব না।’ তখন আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) নিজ হাতে তা মুছে দিলেন এবং এই শর্তে তাদের সঙ্গে সন্ধি করলেন যে, তিনি এবং তাঁর সঙ্গী-সাথীরা তিন দিনের জন্য মক্কা্য় প্রবেশ করবেন এবং জুলুববান جُلُبَّانُ السِّلَاحِ ব্যতীত অন্য কিছু নিয়ে প্রবেশ করবেন না। তারা জিজ্ঞেস করল, جُلُبَّانُ السِّلَاحِ মানে কী? তিনি বললেন, ‘জুলুববান’ মানে ভিতরে তরবারীসহ খাপ।’ (১৭৮১) (মুসলিম ৩২/৩৪ হাঃ ১৭৮৩, আহমাদ ১৮৬৫৮) (আধুনিক প্রকাশনীঃ ২৫০২, ইসলামিক ফাউন্ডেশনঃ ২৫১৫)",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2699,
			"arabicnumber": 2699,
			"text": "বারা‘ (রাঃ) হতে বর্ণিত। তিনি বলেন, যিলকাদ মাসে নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) ‘উমরাহর উদ্দেশ্যে বের হলেন। কিন্তু মক্কাবাসীরা তাঁকে মক্কা প্রবেশের জন্য ছেড়ে দিতে অস্বীকার করল। অবশেষে এই শর্তে তাদের সঙ্গে ফয়সালা করলেন যে, তিনদিন সেখানে অবস্থান করবেন। সন্ধিপত্র লিখতে গিয়ে মুসলিমরা লিখলেন, এ সন্ধিপত্র সম্পাদন করেছেন, ‘আল্লাহর রাসূল মুহাম্মাদ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)।’ তারা (মুশরিকরা) বলল, ‘আমরা তাঁর রিসালাত স্বীকার করি না। আমরা যদি জানতাম যে, আপনি আল্লাহর রাসূল তাহলে আপনাকে বাধা দিতাম না। তবে আপনি হলেন, ‘আবদুল্লাহর পুত্র মুহাম্মদ।’ তিনি বললেন, ‘আমি আল্লাহর রাসূল এবং ‘আবদুল্লাহর পুত্র মুহাম্মদ।’ অতঃপর তিনি আলীকে বললেন, আল্লাহর রাসূল শব্দটি মুছে দাও। তিনি বললেন, ‘না। আল্লাহর কসম, আমি আপনাকে কখনো মুছব না।’ আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) তখন চুক্তিপত্রটি নিলেন এবং লিখলেন, ‘এ সন্ধিপত্র মুহাম্মদ ইবনু ‘আবদুল্লাহ্ সম্পন্ন করেন- খাপবদ্ধ অস্ত্র ব্যতীত আর কিছু নিয়ে তিনি মক্কায় প্রবেশ করবেন না। মক্কাবাসীদের কেউ তাঁর সঙ্গে যেতে চাইলে তিনি বের করে নিবেন না। আর তাঁর সঙ্গীদের কেউ মক্কায় থাকতে চাইলে তাঁকে বাধা দিবেন না।’ তিনি যখন মক্কায় প্রবেশ করলেন এবং নির্ধারিত সময় অতিবাহিত হয়ে গেল, তখন তারা এসে আলীকে বলল, ‘তোমার সঙ্গীকে আমাদের এখান হতে বের হতে বল। কেননা নির্ধারিত সময় অতিবাহিত হয়ে গেছে।’ নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) রওয়ানা হলেন। তখন হামযাহর কন্যা হে চাচা, হে চাচা, বলে তাদের পেছনে পেছনে চলল। আলী (রাঃ) তাকে হাত ধরে নিয়ে এলেন এবং ফাতিমাহকে বললেন, ‘এই নাও, তোমার চাচার মেয়েকে। আমি ওকে তুলে এনেছি।’ ‘আলী, যায়দ ও জা‘ফর তাকে নেয়ার ব্যাপারে বিতর্কে প্রবৃত্ত হলেন। ‘আলী (রাঃ) বললেন, ‘আমি তার অধিক হক্দার। কারণ সে আমার চাচার মেয়ে। জা‘ফর (রাঃ) বললেন, সে আমার চাচার মেয়ে এবং তার খালা আমার স্ত্রী।’ যায়দ (রাঃ) বললেন, ‘সে আমার ভাইয়ের মেয়ে।’ অতঃপর নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) খালার পক্ষে ফয়সালা দিলেন এবং বললেন, ‘খালা মায়ের স্থান অধিকারিণী।’ আর ‘আলীকে বললেন, ‘আমি তোমার এবং তুমি আমার।’ জা‘ফরকে বললেন, ‘তুমি আকৃতি ও প্রকৃতিতে আমার সদৃশ। আর যায়দকে বললেন, ‘তুমি তো আমাদের ভাই ও আযাদকৃত গোলাম।’ (১৭৮১) (আধুনিক প্রকাশনীঃ ২৫০৩, ইসলামিক ফাউন্ডেশনঃ ২৫১৬)",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2700,
			"arabicnumber": 2700,
			"text": "فِيْهِ عَنْ أَبِيْ سُفْيَانَ وَقَالَ عَوْفُ بْنُ مَالِكٍ عَنْ النَّبِيِّ صلى الله عليه وسلم ثُمَّ تَكُوْنُ هُدْنَةٌ بَيْنَكُمْ وَبَيْنَ بَنِي الأَصْفَرِ وَفِيْهِ سَهْلُ بْنُ حُنَيْفٍ وَأَسْمَاءُ وَالْمِسْوَرُ عَنْ النَّبِيِّ صلى الله عليه وسلم এ সম্পর্কে আবূ সুফইয়ান (রাঃ) হতে হাদীস বর্ণিত হয়েছে। আওফ ইবনু মালিক (রাঃ) নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) হতে বর্ণনা করেছেন। অতঃপর তোমাদের ও পীত বর্ণের লোকদের সঙ্গে সন্ধি হবে। এ বিষয়ে সাহল ইবনু হুনায়ফ, আসমা ও মিসওয়ার (রাঃ) কর্তৃক নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) হতে হাদীস বর্ণিত হয়েছে। ২৭০০. বারা’ ইবনু ‘আযিব (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) হুদায়বিয়ার দিন মুশরিকদের সঙ্গে তিনটি বিষয়ে সন্ধি করেছিলেন। তা হলো- মুশরিকরা কেউ (মুসলিম হয়ে) তাঁর নিকট এলে তিনি তাকে তাদের নিকট ফিরিয়ে দিবেন। মুসলিমদের কেউ (মুরতাদ হয়ে) তাদের নিকট গেলে তারা তাকে ফিরিয়ে দিবে না। আর তিনি আগামী বছর মক্কা্য় প্রবেশ করবেন এবং সেখানে তিন দিন অবস্থান করবেন। কোষবদ্ধ তরবারি, ধনুক ও এ রকম কিছু ব্যতীত অন্য কিছু নিয়ে প্রবেশ করবেন না। ইতোমধ্যে আবূ জান্দাল (রাঃ) শিকল পরা অবস্থায় লাফিয়ে লাফিয়ে তাঁর নিকট এল। তাকে তিনি তাদের নিকট ফিরিয়ে দিলেন। (১৭৮১) আবু ‘আবদুল্লাহ্ [ইমাম বুখারী(রহ.)] বলেন, মুআম্মাল (রহ.) সুফইয়ান (রহ.) হতে বর্ণিত হাদীসে আবূ জান্দালের কথা উল্লেখ করেননি। তিনি ‘‘কোষবদ্ধ তরবারি ছাড়া’’ এটুকু উল্লেখ করেছেন। (ই.ফা ১৬৭৯ পরিচ্ছেদ)",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2701,
			"arabicnumber": 2701,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত। আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) ‘উমরার উদ্দেশে বহির্গত হলেন। কিন্তু কুরাইশ কাফিররা তাঁর ও বাইতুল্লাহর মাঝে বাধা হয়ে দাঁড়াল। তখন তিনি হুদায়বিয়াতে তাঁর হাদী কুরবানী করলেন, তাঁর মাথা মুড়ালেন এবং তাদের সঙ্গে সন্ধি করলেন যে, আগামী বছর তিনি ‘উমরাহ করবেন আর তরবারি ব্যতীত অন্য কোন অস্ত্র বহন করবেন না। আর তারা যতদিন চাইবে তার বেশি সেখানে থাকবেন না। পরের বছর তিনি ‘উমরাহ করলেন এবং তাদের সঙ্গে সন্ধি মুতাবেক প্রবেশ করলেন। তিনি সেখানে তিন দিন অবস্থান করলেন। তারা তাঁকে বেরিয়ে যেতে বললে, তিনি বেরিয়ে গেলেন। (৪২৫২) (আধুনিক প্রকাশনীঃ ২৫০৪, ইসলামিক ফাউন্ডেশনঃ ২৫১৭)",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2702,
			"arabicnumber": 2702,
			"text": "সাহল ইবনু আবূ হাসমা (রহ.) হতে বর্ণিত। তিনি বলেন, খায়বার সন্ধিবদ্ধ থাকাকালে ‘আবদুল্লাহ্ ইবনু সাহল ও মুহাইয়াসা ইবনু মাস‘ঊদ ইবনু যায়দ (রাঃ) খায়বার গিয়েছিলেন। (৩১৭৩, ৬১৪৩, ৬৮৯৮, ৭১৯২) (আধুনিক প্রকাশনীঃ ২৫০৫, ইসলামিক ফাউন্ডেশনঃ ২৫১৮)",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2703,
			"arabicnumber": 2703,
			"text": "আনাস (রাঃ) হতে বর্ণিত। তিনি বলেন, রুবাইয়্যি বিনতে নাযর (রাঃ) এক কিশোরীর সামনের দাঁত ভেঙ্গে ফেলেছিল। তারা ক্ষতিপূরণ চাইল আর অপরপক্ষ ক্ষমা চাইল। তারা অস্বীকার করল এবং নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর নিকট এল। তিনি কিসাসের আদেশ দিলেন। আনাস ইবনু নাযর (রাঃ) তখন বললেন, ‘হে আল্লাহর রাসূল! রুবাইয়্যি-এর দাঁত ভাঙ্গা হবে? না, যিনি আপনাকে সত্য সহ পাঠিয়েছেন তাঁর কসম তাঁর দাঁত ভাঙ্গা হবে না।’ তিনি বললেন, ‘হে আনাস, আল্লাহর বিধান হল কিসাস।’ অতঃপর বাদীপক্ষ রাযী হয় এবং ক্ষমা করে দেয়। তখন নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বললেন, আল্লাহর বান্দাদের মধ্যে এমন বান্দাও রয়েছেন যে, আল্লাহর নামে কোন কসম করলে তা পূরণ করেন। ফাযারী (রহ.) হুমায়দ (রহ.) সূত্রে আনাস (রাঃ) হতে রিওয়ায়াত করতে গিয়ে অতিরিক্ত বর্ণনা করেছেন যে, তখন লোকেরা রাযী হল এবং ক্ষতিপূরণ গ্রহণ করল। (২৮০৬, ৪৪৯৯, ৪৫০০, ৪৬১১, ৬৮৯৪) (মুসলিম ২৮/৫ হাঃ ১৬৭৫, আহমাদ ১৪০৩০) (আধুনিক প্রকাশনীঃ ২৫০৬, ইসলামিক ফাউন্ডেশনঃ ২৫১৯)",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2704,
			"arabicnumber": 2704,
			"text": "وَقَوْلُهُ جَلَّ ذِكْرُهُ: (فَأَصْلِحُوا بَيْنَهُمَا) আর আল্লাহ তা‘আলার বাণীঃ তোমরা তাদের উভয় দলের মাঝে মীমাংসা করে দাও। (সূরা আল-হুজুরাত ৯) ২৭০৪. হাসান (বাসরী) (রহ.) বলেন, আল্লাহর কসম, হাসান ইবনু ‘আলী (রাঃ) পর্বত প্রমাণ সেনাদল নিয়ে মু‘আবিয়াহ (রাঃ)-এর মুখোমুখী হলেন। আমর ইবনু ‘আস (রাঃ) বললেন, আমি এমন সেনাদল দেখতে পাচ্ছি যারা প্রতিপক্ষকে হত্যা না করে ফিরে যাবে না। মু‘আবিয়াহর (রাঃ) তখন বললেন, আল্লাহর কসম! আর (মু‘আবিয়াহ ও ‘আমর ইবনুল ‘আস) (রাঃ) উভয়ের মধ্যে মু‘আবিয়াহ (রাঃ) ছিলেন উত্তম ব্যক্তি- ‘হে ‘আমর! এরা ওদের এবং ওরা এদের হত্যা করলে, আমি কাকে দিয়ে লোকের সমস্যার সমাধান করব? তাদের নারীদেও কে তত্ত্বাবধান করবে? তাদের দুর্বল ও শিশুদের কে রক্ষণাবেক্ষণ করবে? অতঃপর তিনি কুরায়শের বানূ আবদে শাম্স্ শাখার দু’ ব্যক্তি ‘আবদুর রহমান ইবনু সামুরাহ ও ‘আবদুল্লাহ্ ইবনু আমর (রাঃ)-কে হাসান (রাঃ)-এর নিকট পাঠালেন। তিনি তাদের বললেন, ‘তোমরা উভয়ে এ ব্যক্তিটির নিকট যাও এবং তাঁর নিকট (সন্ধির) প্রস্তাব পেশ করো, তাঁর সঙ্গে আলোচনা কর ও তাঁর বক্তব্য জানতে চেষ্টা কর।’ তাঁরা তাঁর নিকট রয়ে গেলেন এবং তাঁর সঙ্গে কথা বললেন, আলাপ-আলোচনা করলেন এবং তাঁর বক্তব্য জানলেন। হাসান ইবনু ‘আলী (রাঃ) তাদের বললেন, ‘আমরা ‘আবদুল মুত্তালিবের সন্তান, এই সম্পদ (বায়তুল মালের) আমরা পেয়েছি। আর এরা রক্তপাতে লিপ্ত হয়েছে।’ তারা উভয়ে বললেন, [মুআবিয়াহ (রাঃ)] আপনার নিকট এরূপ বক্তব্য পেশ করেছেন। আর আপনার বক্তব্যও জানতে চেয়েছেন ও সন্ধি কামনা করেছেন। তিনি বললেন, ‘এ দায়িত্ব কে নিবে?’ তারা (তার জওয়াবে) বললেন, ‘আমরা এ দায়িত্ব নিচ্ছি।’ অতঃপর তিনি তাঁর সঙ্গে সন্ধি করলেন। হাসান (বসরী) (রহ.) বলেন, আমি আবূ বাকরাহ (রাঃ)-কে বলতে শুনেছিঃ ‘রাসূলুল্লাহ্ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-কে আমি মিম্বরের উপর দেখেছি, হাসান বিন ‘আলী (রাঃ) তাঁর পাশে ছিলেন। তিনি একবার লোকদের দিকে আরেকবার তাঁর দিকে তাকাচ্ছিলেন আর বলছিলেন, আমার এ সন্তান একজন নেতা। সম্ভবত তার মাধ্যমে আল্লাহ্ তা‘আলা মুসলিমদের দু’টি বড় দলের মধ্যে মীমাংসা করাবেন।’ আবূ ‘আবদুল্লাহ্ (রহ.) বলেন, ‘আলী ইবনু ‘আবদুল্লাহ্ আমাকে বলেছেন যে, এ হাদীসের মাধ্যমেই আবূ বাকরাহ (রাঃ) হতে হাসানের শোনা কথা আমাদের নিকট প্রমাণিত হয়েছে। (৩৬২৯, ৩৭৪৬, ৭১০৯) (আধুনিক প্রকাশনীঃ ২৫০৭, ইসলামিক ফাউন্ডেশনঃ ২৫২০)",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2705,
			"arabicnumber": 2705,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) একবার দরজায় ঝগড়ার আওয়াজ শুনতে পেলেন; দু’জন তাদের আওয়াজ উচ্চ করেছিল। তাদের একজন আরেকজনের নিকট ঋণের কিছু মাফ করে দেয়ার এবং সহানুভূতি দেখানোর অনুরোধ করেছিল। আর অপর ব্যক্তি বলছিল, ‘না, আল্লাহর কসম! আমি তা করব না।’ আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) তাদের দু’জনের কাছে এলেন এবং বললেন, সৎ কাজ করবে না বলে যে আল্লাহর নামে কসম করেছে, সে ব্যক্তিটি কোথায়? সে বলল, ‘হে আল্লাহর রাসূল! আমি। সে যা পছন্দ করবে তার জন্য তা-ই হবে।’ (মুসলিম ২২/৪ হাঃ ১৫৫৭) (আধুনিক প্রকাশনীঃ ২৫০৮, ইসলামিক ফাউন্ডেশনঃ ২৫২১)",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2706,
			"arabicnumber": 2706,
			"text": "কা‘ব ইবনু মালিক (রাঃ) হতে বর্ণিত যে, ‘আবদুল্লাহ্ ইবনু আবূ হাদরাদ আল-আসলামীর কাছে তার কিছু মাল পাওনা ছিল। রাবী বলেন, একবার তার সাক্ষাৎও পেলেন এবং তাকে ধরলেন, এমনকি তাদের আওয়াজ চড়ে গেল। নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) তাদের কাছ দিয়ে যাচ্ছিলেন। তখন তিনি বললেন, ওহে কা’ব, অতঃপর হাতের ইশারায় তিনি যেন জানালেন, অর্ধেক। তারপর তিনি তার পাওনা নিলেন আর অর্ধেক ছেড়ে দিলেন। (৪৫৭) (আধুনিক প্রকাশনীঃ ২৫০৯, ইসলামিক ফাউন্ডেশনঃ ২৫২২)",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2707,
			"arabicnumber": 2707,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেন, ‘মানুষের প্রতিটি হাড়ের জোড়ার জন্য তার উপর সদাকাহ রয়েছে। সূর্য উঠে এমন প্রত্যেক দিন মানুষের মধ্যে সুবিচার করাও সদাকাহ।’ (২৮৯১, ২৯৮৯) (আধুনিক প্রকাশনীঃ ২৫১০, ইসলামিক ফাউন্ডেশনঃ ২৫২৩)",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2708,
			"arabicnumber": 2708,
			"text": "যুবাইর (রাঃ) হতে বর্ণিত যে, তিনি এক আনসারীর সঙ্গে বিবাদ করেছিলেন, যিনি বাদারে শরীক ছিলেন। তিনি আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর নিকট গিয়ে প্রস্তরময় যমীনের একটি নালা সম্পর্কে অভিযোগ করলেন। তারা উভয়ে সে নালা হতে পানি সেচ করতেন। তখন আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) যুবাইরকে বললেন, ‘হে যুবাইর! তুমি প্রথমে পানি সেচবে। অতঃপর তোমার প্রতিবেশির দিকে পানি ছেড়ে দিবে।’ আনসারী তখন রেগে গেল এবং বললো, ‘হে আল্লাহর রাসূল! সে আপনার ফুফুর ছেলে হওয়ার কারণে?’ এতে আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর চেহারার রঙ বদলে গেল। অতঃপর তিনি বললেন, ‘তুমি সেচ কর, অতঃপর পানি আটকে রাখ, বাঁধ বরাবর পৌঁছা পর্যন্ত।’ আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) যুবাইর (রাঃ)-কে তার পূর্ণ হক দিলেন। এর আগে যুবাইর (রাঃ)-কে তিনি এমন নির্দেশ দিয়েছিলেন যা আনসারীর জন্য সুবিধাজনক ছিল। কিন্তু আনসারী আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-কে রাগান্বিত করলে সুস্পষ্ট নির্দেশের মাধ্যমে যুবাইর (রাঃ)-কে তিনি তার পূর্ণ হক দান করলেন। ‘উরওয়াহ (রাঃ) বলেন, যুবাইর (রাঃ) বলেছেন, ‘আল্লাহর কসম! আমার নিশ্চিত ধারণা যে (আল্লাহর বাণী)ঃ কিন্তু না, আপনার প্রতিপালকের শপথ! তারা মুমিন হবে না যতক্ষণ তারা তাদের নিজেদের বিবাদে আপনাকে বিচারক হিসাবে মান্য না করে- (সূরা আন-নিসা ৬৫) আয়াতটি সে ব্যাপারেই নাযিল হয়েছিল।’ (২৩৬০) (আধুনিক প্রকাশনীঃ ২৫১১, ইসলামিক ফাউন্ডেশনঃ ২৫২৪)",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2709,
			"arabicnumber": 2709,
			"text": "وَقَالَ ابْنُ عَبَّاسٍ لَا بَأْسَ أَنْ يَتَخَارَجَ الشَّرِيكَانِ فَيَأْخُذَ هَذَا دَيْنًا وَهَذَا عَيْنًا فَإِنْ تَوِيَ لِأَحَدِهِمَا لَمْ يَرْجِعْ عَلَى صَاحِبِهِ ইবনু ‘আব্বাস (রাঃ) বলেন, দুই অংশীদার যদি সিদ্ধান্ত নেয় যে, একজন বাকী আর একজন নগদ নিবে, তাতে কোন ক্ষতি নেই। আর কারো সম্পদ নষ্ট হলে সে তার সাথীর নিকট দাবী করতে পারবে না। ২৭০৯. জাবির ইবনু ‘আবদুল্লাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমার পিতা মারা গেলেন, আর তার কিছু ঋণ ছিল। আমি তাঁর ঋণের বিনিময়ে পাওনাদারদের খেজুর নেয়ার কথা বললাম। তাতে ঋণ পরিশোধ হবে না বলে তারা তা নিতে অস্বীকার করল। আমি তখন নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর নিকট এসে এ বিষয়ে তাঁর নিকট উল্লেখ করলাম। তিনি বললেন, খেজুর পেড়ে মাচায় রেখে আল্লাহর রাসূলকে খবর দিও। (অতঃপর) তিনি এলেন এবং তাঁর সঙ্গে আবু বাকর ও ‘উমার (রাঃ)-ও ছিলেন। তিনি তার উপর বসলেন এবং বরকতের দু‘আ করলেন। পরে বললেন, তোমার পাওনাদারদের ডাক এবং তাদের প্রাপ্য পরিশোধ করে দাও। অতঃপর আমার পিতার পাওনাদারদের কেউ এমন ছিল না যার ঋণ পরিশোধ করিনি। অতঃপরও (আমার কাছে) তের ওয়াসাক খেজুর উদ্ধৃত্ত রয়ে গেল। সাত ওয়াসক আজওয়া খেজুর আর ছয় ওয়াসক নিম্নমানের খেজুর কিংবা ছয় ওয়াসক আজওয়া ও সাত ওয়াসক নিম্নমানের খেজুর। অতঃপর আমি রাসূলুল্লাহ্ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর সঙ্গে মাগরিবের সালাত আদায় করলাম এবং তাঁকে ব্যাপারটা বললাম। তিনি হাসলেন এবং বললেন, আবূ বাকর ও ‘উমারের কাছে যাও এবং দু’জনের কাছে খবরটা দাও।’ তাঁরা বললেন, ‘আমরা আগেই জানতাম যে, যখন আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) যা করার তা যেহেতু করেছেন, তখন অবশ্য এ রকমই হবে।’ হিশাম (রহ.) ওয়াহাব (রহ.)-এর মাধ্যমে জাবির (রাঃ) হতে (বর্ণনায়) ‘আসরের সালাতের কথা উল্লেখ করেছেন। তবে তিনি আবূ বাকর (রাঃ)-এর কথা এবং আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর হাসার কথা উল্লেখ করেননি। তিনি বর্ণনা করেছেন, [জাবির (রাঃ) বলেছেন] আমার পিতা নিজের উপর ত্রিশ ওয়াসক ঋণ রেখে মারা গিয়েছেন। ইবনু ইসহাক (রহ.) ওয়াহাব (রহ.)-এর মাধ্যমে জাবির (রাঃ) হতে যুহরের সালাতের কথা বলেছেন। (২১২৭) (আধুনিক প্রকাশনীঃ ২৫১২, ইসলামিক ফাউন্ডেশনঃ ২৫২৫)",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2710,
			"arabicnumber": 2710,
			"text": "কা‘ব ইবনু মালিক (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর যমানায় একবার তিনি ইবনু আবূ হাদরাদের কাছে মসজিদে পাওনার তাগাদা করলেন। এতে উভয়ের গলার আওয়াজ চড়ে গেল। এমনকি আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) তাঁর ঘরে থেকেই আওয়াজ শুনতে পেলেন। তখন আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) হুজরার পর্দা সরিয়ে তাদের নিকট বেরিয়ে এলেন আর কা‘ব ইবনু মালিক (রাঃ)-কে ডাকলেন এবং বললেন, ওহে কা‘ব! কা‘ব (রাঃ) বললেন, আমি হাযির হে আল্লাহর রাসূল! রাবী বলেন, তিনি হাতে ইশারা করলেন, অর্ধেক কমিয়ে দাও। কা‘ব (রাঃ) বললেন, তাই করলাম। অতঃপর আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) (ইবনে আবূ হাদরাদকে) বললেন, ‘যাও, তার ঋণ পরিশোধ করে দাও।’ (৪৫৭) (আধুনিক প্রকাশনীঃ ২৫১৩, ইসলামিক ফাউন্ডেশনঃ ২৫২৬)",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 20
			}
		}
	]
}