{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"56": "Fighting for the Cause of Allah (Jihaad)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2782,
			"arabicnumber": 2782,
			"text": "(وَقَوْلِ اللهِ تَعَالَى) إِنَّ اللهَ اشْتَرٰى مِنَ الْمُؤْمِنِيْنَ أَنْفُسَهُمْ وَأَمْوٰلَهُمْ بِأَنَّ لَهُمْ الْجَنَّةَ يُقٰتِلُوْنَ فِيْ سَبِيْلِ اللهِ فَيَقْتُلُوْنَ وَيُقْتَلُوْنَ وَعْدًا عَلَيْهِ حَقًّا فِي التَّوْرٰةِ وَالْإِنْجِيْلِ وَالْقُرْاٰنِ وَمَنْ أَوْفٰى بِعَهْدِهِ مِنْ اللهِ فَاسْتَبْشِرُوْا بِبَيْعِكُمْ الَّذِيْ بٰيَعْتُمْ بِهِ ( إِلَى قَوْلِهِ وَبَشِّرِ الْمُؤْمِنِيْنَ ( قَالَ ابْنُ عَبَّاسٍ الْحُدُوْدُ الطَّاعَةُ) আল্লাহ্ তাআলার বাণীঃ নিশ্চয় আল্লাহ খরিদ করে নিয়েছেন মু’মিনদের থেকে তাদের জান ও তাদের মাল এর বিনিময়ে যে, অবশ্যই তাদের জন্য রয়েছে জান্নাত। তারা যুদ্ধ করে আল্লাহর পথে, কখনও হত্যা করে এবং কখনও নিহত হয়। তাওরাত, ইঞ্জীল ও কুরআনে এ সম্পর্কে সত্য ওয়াদা রয়েছে। আল্লাহর চাইতে নিজের ওয়াদা অধিক পালনকারী আর কে আছে? সুতরাং তোমরা আনন্দ কর তোমাদের সে সাওদার জন্য যা তোমরা তাঁর সাথে করেছ। আর তা হল বিরাট সাফল্য। তারা তাওবাকারী, ‘ইবাদাতকারী, আল্লাহর প্রশংসাকারী, রোযাদার, রুকূ‘কারী, সিজদাকারী, ভাল কাজের আদেশদাতা, মন্দ কাজে বাধা প্রদানকারী এবং আল্লাহর নির্ধারিত সীমারেখা হিফাযাতকারী; (এসব গুণে গুণান্বিত) মুমিনদেরকে আপনি খোশখবর শুনিয়ে দিন। (আত তওবা্ ১১১-১২) ইবনু ‘আব্বাস (রাঃ) বলেন, الْحُدُوْدُ অর্থ (আল্লাহর) আনুগত্য। ২৭৮২. ‘আবদুল্লাহ্ ইবনু মাস‘ঊদ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-কে জিজ্ঞেস করলাম, ‘হে আল্লাহর রাসূল! কোন্ কাজ সর্বোত্তম?’ তিনি বললেন, ‘সময় মত সালাত আদায় করা।’ আমি বললাম, ‘অতঃপর কোনটি?’ তিনি বলেন, ‘অতঃপর পিতা-মাতার সঙ্গে সদাচরণ করা।’ আমি বললাম, ‘অতঃপর কোনটি?’ তিনি বললেন, ‘আল্লাহর পথে জিহাদ।’ অতঃপর আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-কে আর কিছু জিজ্ঞেস না করে আমি চুপ রইলাম। আমি যদি আরো বলতাম, তবে তিনি আরও অধিক বলতেন। (৫২৭) (আধুনিক প্রকাশনীঃ ২৫৭৬, ইসলামিক ফাউন্ডেশনঃ ২৫৮৮)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2783,
			"arabicnumber": 2783,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেন, ‘(মক্কা) বিজয়ের পর আর হিজরত নেই। বরং রয়েছে কেবল জিহাদ ও নিয়্যাত। যখন তোমাদের জিহাদের ডাক দেয়া হয়, তখন বেরিয়ে পড়।’ (১৩৪৯) (আধুনিক প্রকাশনীঃ ২৫৭৭, ইসলামিক ফাউন্ডেশনঃ ২৫৮৯)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2784,
			"arabicnumber": 2784,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, ‘হে আল্লাহর রাসূল! আমরা জিহাদকে সর্বোত্তম আমল মনে করি, তবে কি আমরা জিহাদ করব না?’ আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেন, ‘তোমাদের জন্য উত্তম জিহাদ হচ্ছে মকবুল হজ্জ।’ (১৫২০) (আধুনিক প্রকাশনীঃ ২৫৭৮, ইসলামিক ফাউন্ডেশনঃ ২৫৯০)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2785,
			"arabicnumber": 2785,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, এক ব্যক্তি আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর নিকট এসে বলল, আমাকে এমন কাজের কথা বলে দিন, যা জিহাদের সমতুল্য হয়। তিনি বলেন, আমি তা পাচ্ছি না। (অতঃপর বললেন,) তুমি কি এতে সক্ষম হবে যে, মুজাহিদ যখন বেরিয়ে যায়, তখন থেকে তুমি মসজিদে প্রবেশ করবে এবং দাঁড়িয়ে ‘ইবাদাত করবে এবং আলস্য করবে না, আর সিয়াম পালন করতে থাকবে এবং সিয়াম ভাঙ্গবে না। ব্যক্তিটি বলল, এটা কে পারবে? আবূ হুরাইরাহ্ (রাঃ) বলেন, ‘মুজাহিদের ঘোড়া রশির দৈর্ঘ্য পর্যন্ত ঘোরাফেরা করে, এতেও তার জন্য নেকী লেখা হয়।’ (মুসলিম ৩৩/২৯ হাঃ ১৮৭৮, আহমাদ ৯৯৬৭) (আধুনিক প্রকাশনীঃ ২৫৭৯, ইসলামিক ফাউন্ডেশনঃ ২৫৯১)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2786,
			"arabicnumber": 2786,
			"text": "وَقَوْلُهُ تَعَالَى: (يَا أَيُّهَا الَّذِينَ آمَنُوا هَلْ أَدُلُّكُمْ عَلَى تِجَارَةٍ تُنْجِيكُمْ مِنْ عَذَابٍ أَلِيمٍ تُؤْمِنُونَ بِاللَّهِ وَرَسُولِهِ وَتُجَاهِدُونَ فِي سَبِيلِ اللَّهِ بِأَمْوَالِكُمْ وَأَنْفُسِكُمْ ذَلِكُمْ خَيْرٌ لَكُمْ إِنْ كُنْتُمْ تَعْلَمُونَ يَغْفِرْ لَكُمْ ذُنُوبَكُمْ وَيُدْخِلْكُمْ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الأَنْهَارُ وَمَسَاكِنَ طَيِّبَةً فِي جَنَّاتِ عَدْنٍ ذَلِكَ الْفَوْزُ الْعَظِيمُ আল্লাহ্ তাআলা বলেনঃ ‘‘ওহে যারা ঈমান এনেছ? আমি কি তোমাদেরকে এমন এক বাণিজ্যের কথা বলে দিব, যা তোমাদেরকে রক্ষা করবে এক যন্ত্রণাদায়ক শাস্তি থেকে? তা এই যে, তোমরা ঈমান আনবে আল্লাহর প্রতি ও তাঁর রাসূলের প্রতি এবং জিহাদ করবে আল্লাহর পথে তোমাদের ধন-সম্পদ ও তোমাদের জীবন দিয়ে। এটাই তোমাদের জন্য শ্রেয়, যদি তোমরা জানতে। আল্লাহ্ ক্ষমা করে দিবেন তোমাদের গুনাহসমূহ এবং দাখিল করবেন জান্নাতে, প্রবাহিত হতে থাকবে যার নিম্নদেশে নহরসমূহ এবং এমন মনোরম গৃহ যা রয়েছে অনন্তকাল বাসের জন্য। এটাই মহা সাফল্য।’’ (আস্ সফ ১০-১২) ২৭৮৬. আবূ সা‘ঈদ খুদরী (রাঃ) হতে বর্ণিত। তিনি বলেন, জিজ্ঞেস করা হলো, ‘হে আল্লাহর রাসূল! মানুষের মধ্যে কে উত্তম?’ আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেন, ‘সেই মু’মিন যে নিজ জান ও মাল দিয়ে আল্লাহর পথে জিহাদ করে।’ সাহাবীগণ বললেন, ‘অতঃপর কে?’ তিনি বললেন, ‘সেই মু’মিন আল্লাহর ভয়ে যে পাহাড়ের কোন গুহায় অবস্থান নেয় এবং স্বীয় অনিষ্ট থেকে লোকদেরকে নিরাপদ রাখে।’ (৬৪৯৪) (মুসলিম ৩৩/৩৪ হাঃ ১৮৮৮, আহমাদ ১১৮৩৮) (আধুনিক প্রকাশনীঃ ২৫৮০, ইসলামিক ফাউন্ডেশনঃ ২৫৯২)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2787,
			"arabicnumber": 2787,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-কে বলতে শুনেছি, আল্লাহর পথের মুজাহিদ, অবশ্য আল্লাহ্ই অধিক জ্ঞাত কে তাঁর পথে জিহাদ করছে, সর্বদা সিয়াম পালনকারী ও সালাত আদায়কারীর মত। আল্লাহ্ তা‘আলা তাঁর পথে জিহাদকারীর জন্য এই দায়িত্ব নিয়েছেন, যদি তাকে মৃত্যু দেন তবে তাকে জান্নাতে প্রবেশ করাবেন অথবা পুরস্কার বা গানীমতসহ নিরাপদে ফিরিয়ে আনবেন। (৩৬) (আধুনিক প্রকাশনীঃ ২৫৮১, ইসলামিক ফাউন্ডেশনঃ ২৫৯৩)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2788,
			"arabicnumber": 2788,
			"text": "",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2790,
			"arabicnumber": 2790,
			"text": "يُقَالُ هَذِهِ سَبِيْلِيْ وَهَذَا سَبِيْلِيْ قَالَ أَبُوْ عَبْد اللهِ غُزًّا وَاحِدُهَا غَازٍ هُمْ دَرَجَاتٌ لَهُمْ دَرَجَاتٌ বলা হয়ে থাকে هَذِهِ سَبِيْلِيْ স্ত্রীলিঙ্গ ও وَهَذَا سَبِيْلِيْ পুংলিঙ্গ অর্থাৎ উভয়ই ব্যবহার হয়, আবূ ‘আবদুল্লাহ্ (ইমাম বুখারী) (রহ.) বলেন غُزًّا এর এক বচন হল غَازٍ এবং هُمْ دَرَجَاتٌ এর অর্থ لَهُمْ دَرَجَاتٌ অর্থাৎ তাদের জন্য রয়েছে মর্যাদা ২৭৯০. আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেন, আল্লাহ্ ও তাঁর রাসূলের প্রতি যে ঈমান আনল, সালাত আদায় করল ও রমাযানের সিয়াম পালন করল সে আল্লাহর পথে জিহাদ করুক কিংবা স্বীয় জন্মভূমিতে বসে থাকুক, তাকে জান্নাতে প্রবেশ করিয়ে দেয়া আল্লাহর দায়িত্ব হয়ে যায়। সাহাবীগণ বললেন, হে আল্লাহর রাসূল! আমরা কি লোকদের এ সুসংবাদ পৌঁছে দিব না? তিনি বলেন, আল্লাহর পথে জিহাদকারীদের জন্য আল্লাহ্ তা‘আলা জান্নাতে একশ’টি মর্যাদার স্তর প্রস্তুত রেখেছেন। দু’টি স্তরের ব্যবধান আসমান ও যমীনের দূরত্বের মত। তোমরা আল্লাহর নিকট চাইলে ফেরদাউস চাইবে। কেননা এটাই হলো সবচেয়ে উত্তম ও সর্বোচ্চ জান্নাত। আমার মনে হয়, রাসূলুল্লাহ্ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) এও বলেছেন, এর উপরে রয়েছে আরশে রহমান। আর সেখান থেকে জান্নাতের নহরসমূহ প্রবাহিত হচ্ছে। মুহাম্মদ ইবনু ফুলাইহ্ (রহ.) তাঁর পিতার সূত্রে (নিঃসন্দেহে) বলেন, এর উপর রয়েছে আরশে রহমান। (৭৪২৩) (আধুনিক প্রকাশনীঃ ২৫৮৩, ইসলামিক ফাউন্ডেশনঃ ২৫৯৫)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2791,
			"arabicnumber": 2791,
			"text": "সামুরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেন, আমি আজ রাতে (স্বপ্নে) দেখতে পেলাম যে, দু’ব্যক্তি আমার নিকট এল এবং আমাকে নিয়ে একটি গাছে উঠলো। অতঃপর আমাকে এমন উৎকৃষ্ট একটি ঘরে প্রবেশ করিয়ে দিল এর আগে আমি কখনো এর চেয়ে সুন্দর ঘর দেখিনি। সে দু’ব্যক্তি আমাকে বলল, এই ঘরটি হচ্ছে শহীদদের ঘর। (৮৪৫) (আধুনিক প্রকাশনীঃ ২৫৮৪, ইসলামিক ফাউন্ডেশনঃ ২৫৯৬)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2792,
			"arabicnumber": 2792,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেন, আল্লাহর রাস্তায় একটি সকাল কিংবা একটি বিকাল অতিবাহিত করা দুনিয়া ও তাতে যা কিছু আছে, তার চেয়ে উত্তম। (২৭৯৬, ৬৫৬৮) (মুসলিম ৩৩/৩০ হাঃ ১৮৮০, আহমাদ ১২৩৫২) (আধুনিক প্রকাশনীঃ ২৫৮৫, ইসলামিক ফাউন্ডেশনঃ ২৫৯৭)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2793,
			"arabicnumber": 2793,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেন, জান্নাতে ধনুক পরিমাণ স্থান, তা থেকে উত্তম যার উপর সূর্যোদয় ও সূর্যাস্ত হয়। আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) আরো বলেন, আল্লাহর রাস্তায় একটি সকাল বা একটি বিকাল অতিবাহিত করা তা থেকে উত্তম যেখানে সূর্যের উদয়াস্ত হয়। (৩২৫৩) (মুসলিম ৩৩/৩০ হাঃ ১৮৮২) (আধুনিক প্রকাশনীঃ ২৫৮৬, ইসলামিক ফাউন্ডেশনঃ ২৫৯৮)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2794,
			"arabicnumber": 2794,
			"text": "সাহল ইবনু সা‘দ (রাঃ) হতে বর্ণিত। নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেন, আল্লাহর রাস্তায় একটি সকাল কিংবা একটি বিকাল অতিবাহিত করা দুনিয়া ও তার ভিতরের সকল কিছু থেকে উত্তম। (২৮৯২, ৩২৫০, ৬৪১৫) (মুসলিম ৩৩/৩০ হাঃ ১৮৮১, আহমাদ ১৫৫৬০) (আধুনিক প্রকাশনীঃ ২৫৮৭, ইসলামিক ফাউন্ডেশনঃ ২৫৯৯)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2795,
			"arabicnumber": 2795,
			"text": "يُحَارُ فِيْهَا الطَّرْفُ شَدِيْدَةُ سَوَادِ الْعَيْنِ شَدِيْدَةُ بَيَاضِ الْعَيْنِ وَزَوَّجْنَاهُمْ بِحُوْرٍ أَنْكَحْنَاهُمْ তাদের দর্শনে দৃষ্টি সুস্থির থাকে না এবং তাদের চক্ষুর কৃষ্ণাংশ অতীব কৃষ্ণ ও চক্ষুর শুভ্রাংশ অতীব শুভ্র। (এ জন্যই তাদের হুরে‘ঈন বলা হয়)। وَزَوَّجْنَاهُمْ بِحُوْرٍ অর্থাৎ أَنْكَحْنَاهُمْ‘‘জান্নাতীদের আমি হুরে’ঈনের সঙ্গে বিয়ে করিয়ে দিব।’’ ২৭৯৫. আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেন, আল্লাহর কোন বান্দা এমতাবস্থায় মারা যায় যে, আল্লাহর কাছে তার সাওয়াব রয়েছে তাকে দুনিয়ার সব কিছু দিলেও দুনিয়ায় ফিরে আসতে আগ্রহী হবে না। একমাত্র শহীদ ব্যতীত। সে শাহাদাতের ফযীলত দেখার কারণে আবার দুনিয়ায় ফিরে এসে আল্লাহর পথে শহীদ হবার প্রতি আগ্রহী হবে। (২৮১৭)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2796,
			"arabicnumber": 2796,
			"text": "হুমাইদ (রহ.) বলেন, আমি আনাস ইবনু মালিক (রাঃ)-কে আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর নিকট হতে এ কথাও বর্ণনা করতে শুনেছি যে, আল্লাহর রাস্তায় একটি সকাল অথবা একটি বিকাল অতিবাহিত করা দুনিয়া ও এর সব কিছু থেকে উত্তম। তোমাদের কারোর ধনুকের কিংবা চাবুক রাখার মত জান্নাতের জায়গাটুকু দুনিয়া ও এর সব কিছু থেকে উত্তম। জান্নাতী কোন মহিলা যদি দুনিয়াবাসীদের প্রতি উঁকি দেয় তাহলে আসমান ও যমীনের মাঝের সব কিছু আলোকিত এবং সুরভিত হয়ে যাবে। আর তার মাথার ওড়না দুনিয়া ও তার সব কিছু চেয়ে উত্তম। (২৭৯২) (আধুনিক প্রকাশনীঃ ২৫৮৮, ইসলামিক ফাউন্ডেশনঃ ২৬০০)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2797,
			"arabicnumber": 2797,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-কে আমি বলতে শুনেছি যে, সেই সত্তার কসম! যাঁর হাতে আমার প্রাণ, যদি মুমিনদের এমন একটি দল না থাকত, যারা যুদ্ধ থেকে বিরত থাকতে পছন্দ করে না এবং যাদের সকলকে সওয়ারী দিতে পারব না বলে আশংকা করতাম, তা হলে যারা আল্লাহর রাস্তায় যুদ্ধ করছে, আমি সেই ক্ষুদ্র দলটির সঙ্গী হওয়া থেকে বিরত থাকতাম না। সেই সত্তার কসম! যাঁর হাতে আমার প্রাণ, আমি পছন্দ করি আমাকে যেন আল্লাহর রাস্তায় শহীদ করা হয়। আবার জীবিত করা হয়, অতঃপর শহীদ করা হয়। আবার জীবিত করা হয়, পুনরায় শহীদ করা হয়। আবার জীবিত করা হয়, আবার শহীদ করা হয়। (৩৬) (আধুনিক প্রকাশনীঃ ২৫৮৯, ইসলামিক ফাউন্ডেশনঃ ২৬০১)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2798,
			"arabicnumber": 2798,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। তিনি বলেন, (মুতায় সৈন্য প্রেরণের পর) আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) খুত্বা দিতে গিয়ে বললেন, যায়দ (রাঃ) পতাকা ধারণ করল এবং শহীদ হল, অতঃপর জা‘ফর (রাঃ) পতাকা ধরল সেও শহীদ হল। তারপর ‘আবদুল্লাহ ইবনু রাওয়াহা (রাঃ) পতাকা ধরল এবং সেও শহীদ হল। অতঃপর খালিদ ইবনু ওয়ালিদ (রাঃ) বিনা নির্দেশেই পতাকা ধরল এবং সে বিজয় লাভ করল। তিনি আরো বলেন, তারা আমাদের মাঝে জীবিত থাকুক তা আমাদের নিকট আনন্দদায়ক নয়। আইয়ুব (রহ.) বলেন, অথবা আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেন, তারা আমাদের মাঝে জীবিত থাকুক তা তাদের নিকট মোটেই আনন্দদায়ক নয়, এ সময় আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর চোখ থেকে অশ্রু ঝরছিল। (১২৪৬) (আধুনিক প্রকাশনীঃ ২৫৯০, ইসলামিক ফাউন্ডেশনঃ ২৬০২)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2799,
			"arabicnumber": 2799,
			"text": "",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2801,
			"arabicnumber": 2801,
			"text": "আনাস (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বানূ সুলায়মের সত্তর জন লোকের একটি দলকে কুরআন শিক্ষা দেয়ার উদ্দেশ্যে বানূ ‘আমিরের নিকট পাঠান। দলটি সেখানে পৌঁছলে আমার মামা (হারাম ইবনু মিলহান) তাদেরকে বললেন, আমি সর্বাগ্রে বনূ ‘আমিরের নিকট যাব। যদি তারা আমাকে নিরাপত্তা দেয় আর আমি তাদের নিকট আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর বাণী পৌঁছাতে পারি, (তবে তো ভাল) অন্যথায় তোমরা আমার কাছেই থাকবে। অতঃপর তিনি এগিয়ে গেলেন। কাফিররা তাঁকে নিরাপত্তা দিল, কিন্তু তিনি যখন আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর বাণী শুনাতে লাগলেন, সেই সময় ‘আমির গোত্রীয়রা এক ব্যক্তিকে ইঙ্গিত করলো। আর সেই ব্যক্তি তার প্রতি তীর মারল এবং তীর শরীর ভেদ করে বের হয়ে গেল। তখন তিনি বললেন আল্লাহু আকবার, কাবার রবের কসম! আমি সফলকাম হয়েছি। অতঃপর কাফিররা তার অন্যান্য সংগীদের উপর ঝাঁপিয়ে পড়ল এবং সকলকে শহীদ করল, কিন্তু একজন খোঁড়া ব্যক্তি বেঁচে গেলেন, তিনি পাহাড়ে আরোহণ করেছিলেন। হাম্মাম (রহ.) অতিরিক্ত উল্লেখ করেন, আমার মনে হয় তার সঙ্গে অন্য একজন ছিলেন। অতঃপর জিব্রাঈল (আঃ) নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-কে খবর দিলেন যে, প্রেরিত দলটি তাদের রবের সঙ্গে মিলিত হয়েছে। তিনি (রব) তাদের প্রতি সন্তুষ্ট হয়েছেন এবং তাদের সন্তুষ্ট করেছেন। (রাবী বলেন) আমরা এই আয়াতটি পাঠ করতাম, আমাদের কাওমকে জানিয়ে দাও যে, আমরা আমাদের রবের সঙ্গে মিলিত হয়েছি। তিনি আমাদের প্রতি সন্তুষ্ট হয়েছেন এবং আমাদেরও সন্তুষ্ট করেছেন। পরে এ আয়াতটি মানসুখ হয়ে যায়। অতঃপর আল্লাহ্ ও রাসূলের প্রতি বিরুদ্ধাচরণ করার কারণে আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) ক্রমাগত চল্লিশ দিন রি‘ল, যাকওয়ান, বানূ লিহয়ান ও বানূ উসাইয়্যার বিরুদ্ধে দুআ করেন। (১০০১) (আধুনিক প্রকাশনীঃ ২৫৯২, ইসলামিক ফাউন্ডেশনঃ ২৬০৪)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2802,
			"arabicnumber": 2802,
			"text": "জুনদুব ইবনু সুফিয়ান (রাঃ) হতে বর্ণিত। কোন এক যুদ্ধে আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর একটি আঙ্গুল রক্তাক্ত হলে তিনি বলেছিলেনঃ তুমি একটি আঙ্গুল ছাড়া কিছু নও; তুমি রক্তাক্ত হয়েছ আল্লাহরই পথে। (৬১৪৬) (মুসলিম ৩২/৩৯ হাঃ ১৭৯৬, আহমাদ ১৮৮৩০) (আধুনিক প্রকাশনীঃ ২৫৯৩, ইসলামিক ফাউন্ডেশনঃ ২৬০৫)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2803,
			"arabicnumber": 2803,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেন, সেই সত্তার কসম, যাঁর হাতে আমার প্রাণ, কোন ব্যক্তি আল্লাহর পথে আহত হলে এবং আল্লাহ্ই ভাল জানেন কে তাঁর পথে আহত হবে কিয়ামতের দিন সে তাজা রক্ত বর্ণে রঞ্জিত হয়ে আসবে এবং তা থেকে মিশ্কের সুগন্ধি ছড়াবে। (২৩৭) (আধুনিক প্রকাশনীঃ ২৫৯৪, ইসলামিক ফাউন্ডেশনঃ ২৬০৬)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2804,
			"arabicnumber": 2804,
			"text": "وَالْحَرْبُ سِجَالٌ যুদ্ধ হচ্ছে বড় পানি পাত্রের মত। ২৮০৪. ‘আবদুল্লাহ্ ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। আবূ সুফ্ইয়ান ইবনু হারব (রাঃ) তাঁকে জানিয়েছেন যে, হিরাকল তাঁকে বলেছিলেন, আমি তোমাকে জিজ্ঞেস করেছি, তাঁর সঙ্গে তোমাদের যুদ্ধের ফলাফল কিরূপ ছিল? তুমি বলেছ যে, যুদ্ধ বড় পানির পাত্র এবং ধন সম্পদের মত। রাসূলগণ এভাবেই পরীক্ষিত হয়ে থাকেন। অতঃপর ভাল পরিণতি তাঁদেরই হয়। (৭) (আধুনিক প্রকাশনীঃ ২৫৯৫, ইসলামিক ফাউন্ডেশনঃ ২৬০৭)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2806,
			"arabicnumber": 2806,
			"text": "",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2807,
			"arabicnumber": 2807,
			"text": "যায়দ ইবনু সাবিত (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি কুরআনের আয়াতসমূহ একত্রিত করে একটি মুসহাফে লিপিবদ্ধ করলাম, তখন সূরা আহযাবের একটি আয়াত আমি পেলাম না যা আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-কে পড়তে শুনেছি। একমাত্র খুযাইমাহ বিন সাবিত আনসারী (রাঃ)-এর নিকট পেলাম। যার সাক্ষ্যকে আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) দু’ব্যক্তির সাক্ষ্যের সমান গণ্য করেছিলেন। সে আয়াতটি হলোঃ ‘‘মু’মিনদের মধ্য হতে কিছু সংখ্যক আল্লাহর সঙ্গে তাদের কৃত অঙ্গীকার পূর্ণ করেছে।’’ (আল-আহযাবঃ ২৩)। (৪০৪৯, ৪৬৭৯, ৪৭৮৪, ৪৯৮৬, ৪৯৮৮, ৪৯৮৯, ৭১৯১, ৭৪২৫) (আধুনিক প্রকাশনীঃ ২৫৯৭, ইসলামিক ফাউন্ডেশনঃ ২৬০৯)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2808,
			"arabicnumber": 2808,
			"text": "وَقَالَ أَبُو الدَّرْدَاءِ إِنَّمَا تُقَاتِلُوْنَ بِأَعْمَالِكُمْ وَقَوْلُهُ ( يٰٓأَيُّهَا الَّذِيْنَ اٰمَنُوْا لِمَ تَقُوْلُوْنَ مَا لَا تَفْعَلُوْنَ كَبُرَ مَقْتًا عِنْدَ اللهِ أَنْ تَقُوْلُوْا مَا لَا تَفْعَلُوْنَ إِنَّ اللهَ يُحِبُّ الَّذِيْنَ يُقٰتِلُوْنَ فِيْ سَبِيْلِهِ صَفًّا كَأَنَّهُمْ بُنْيَانٌ مَّرْصُوْصٌ) আবুদ দারদা (রাঃ) বলেন, ‘আমল অনুসারে তোমরা জিহাদ করে থাকো। আল্লাহ্ তা‘আলার বাণীঃ ওহে যারা ঈমান এনেছ! তোমরা যা কর না, তা তোমরা কেন বল? তোমরা যা করনা তোমাদের তা বলা আল্লাহর নিকট অতিশয় অসন্তোষজনক। যারা আল্লাহর পথে সংগ্রাম করে সারিবদ্ধভাবে সীসা গলানো সুদৃঢ় প্রাচীরের মত, আল্লাহ তাদেরকে ভালবাসেন। (আস্ সফ ২-৩) ২৮০৮. বারা’ (রাঃ) হতে বর্ণিত। তিনি বলেন, লৌহ বর্মে আবৃত এক ব্যক্তি আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর নিকট এসে বলল, ‘হে আল্লাহর রাসূল! আমি যুদ্ধে শরীক হবো, না ইসলাম গ্রহণ করব?’ তিনি বললেন, ‘ইসলাম গ্রহণ কর, অতঃপর যুদ্ধে যাও।’ অতঃপর সে ব্যক্তি ইসলাম গ্রহণ করে যুদ্ধে গেল এবং শাহাদাত লাভ করল। আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বললেন, ‘সে কম আমল করে অধিক পুরস্কার পেল।’ (আধুনিক প্রকাশনীঃ ২৫৯৮, ইসলামিক ফাউন্ডেশনঃ ২৫১০)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2809,
			"arabicnumber": 2809,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। উম্মু রুবায়্যি বিনতে বারা, যিনি হারিস ইবনু সুরাকার মা আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর নিকট এসে বলেন, ‘হে আল্লাহর নবী! আপনি হারিসাহ (রাঃ) সম্পর্কে আমাকে কিছু বলবেন কি? হারিসা (রাঃ) বাদারের যুদ্ধে অজ্ঞাত তীরের আঘাতে শাহাদাত লাভ করেন। সে যদি জান্নাতবাসী হয়ে থাকে তবে আমি সবর করব, তা না হলে আমি তার জন্য অবিরাম কাঁদতে থাকবো।’ আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বললেন, ‘হে হারিসার মা! জান্নাতে অসংখ্য বাগান আছে, আর তোমার ছেলে সর্বোচ্চ জান্নাতুল ফেরদাউস পেয়ে গেছে।’ (৩৯৮২, ৬৫৫০, ৬৫৬৭) (আধুনিক প্রকাশনীঃ ২৫৯৯, ইসলামিক ফাউন্ডেশনঃ ২৬১১)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2810,
			"arabicnumber": 2810,
			"text": "আবূ মূসা (রাঃ) হতে বর্ণিত। তিনি বলেন, এক ব্যক্তি নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর নিকট এসে বলল, এক ব্যক্তি গনীমতের জন্য, এক ব্যক্তি প্রসিদ্ধ হওয়ার জন্য এবং এক ব্যক্তি বীরত্ব দেখানোর জন্য জিহাদে শরীক হলো। তাদের মধ্যে কে আল্লাহর পথে জিহাদ করল? তিনি বললেন, ‘যে ব্যক্তি আল্লাহর কলিমা বুলন্দ থাকার উদ্দেশে যুদ্ধ করল, সে-ই আল্লাহর পথে জিহাদ করল।’ (১২৩) (মুসলিম ৩৩/৪২ হাঃ ১৯০৪, আহমাদ ১৯৬১৩) (আধুনিক প্রকাশনীঃ ২৬০০, ইসলামিক ফাউন্ডেশনঃ ২৬১২)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2811,
			"arabicnumber": 2811,
			"text": "مَا كَانَ لِأَهْلِ الْمَدِيْنَةِ وَمَنْ حَوْلَهُمْ مِنَ الْأَعْرَابِ أَنْ يَّتَخَلَّفُوْا عَنْ رَّسُوْلِ اللهِ وَلَا يَرْغَبُوْا بِأَنْفُسِهِمْ عَنْ نَّفْسِهِ ذٰلِكَ (بِأَنَّهُمْ لَا يُصِيْبُهُمْ ظَمَأٌ وَّلَا نَصَبٌ وَّلَا مَخْمَصَةٌ فِيْ سَبِيْلِ اللهِ وَلَا يَطَأُوْنَ مَوْطِئاً يُّغِيْظُ الْكُفَّارَ وَلَا يَنَالُوْنَ مِنْ عَدُوٍّ نَيْلًا إِلَّا كُتِبَ لَهُمْ بِهِ عَمَلٌ صَالِحٌ إِنَّ اللهَ لا يُضِيْعُ أَجْرَ الْمُحْسِنِيْنَ)) আল্লাহ্ তা‘আলার বাণীঃ মদিনা্বাসী ও তাদের পার্শ্ববর্তী মরুবাসীদের পক্ষে সমীচীন নয় আল্লাহর রাসূলের সঙ্গ ত্যাগ করে পেছনে থেকে যাওয়া, রাসূলের জীবনের চেয়ে নিজেদের জীবনকে প্রিয় মনে করা। এ কারণে যে, আল্লাহর পথে তাদের যে পিপাসা, ক্লান্তি ও ক্ষুধা ক্লিষ্ট করে এবং তাদের এমন পদক্ষেপ যা কাফিরদের ক্রোধের উদ্রেক করে, আর শত্রু পক্ষ থেকে যা কিছু তারা প্রাপ্ত হয়, তার প্রতিটির বিনিময়ে তাদের জন্য একটি নেক ‘আমল লিখিত হয়। নিশ্চয় আল্লাহ নেককারদের শ্রমফল বিনষ্ট করেন না। (আত্ তওবা ১২০) ২৮১১. ‘আবদুর রাহমান ইবনু জাবর (রাঃ) হতে বর্ণিত। আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেন, ‘আল্লাহর পথে যে বান্দার দু’পা ধূলায় মলিন হয়, তাকে জাহান্নামের আগুন স্পর্শ করবে এমন হয় না।’ (৯০৭) (আধুনিক প্রকাশনীঃ ২৬০১, ইসলামিক ফাউন্ডেশনঃ ২৬১৩)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2812,
			"arabicnumber": 2812,
			"text": "‘ইকরিমাহ (রহ.) বর্ণনা করেন যে, ইবনু ‘আব্বাস (রাঃ) তাকে ও ‘আলী ইবনু ‘আবদুল্লাহ্কে বলেছিলেন যে, তোমরা আবূ সা‘ঈদ (রাঃ)-এর নিকট যাও এবং তার কিছু বর্ণনা শোন। অতঃপর আমরা তার নিকট গেলাম। সে সময় তিনি ও তার ভাই বাগানে পানি সেচের কাজে ছিলেন। আমাদের দেখে তিনি আসলেন এবং দু’ হাঁটু বুকের সঙ্গে লাগিয়ে বসে বললেন, মসজিদে নববীর জন্য আমরা এক একটি করে ইট বহন করছিলাম। আর ‘আম্মার (রাঃ) দু’ দু’টি করে বহন করছিল। সে সময় নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) তার পাশ দিয়ে গেলেন এবং তার মাথা থেকে ধূলাবালি মুছলেন এবং বললেন, আম্মারের জন্য বড় দুঃখ হয়, বিদ্রোহী দল তাকে হত্যা করবে। সে (‘আম্মার) (রাঃ) তাদেরকে আল্লাহর দিকে ডাকবে এবং তারা আম্মারকে জাহান্নামের দিকে ডাকবে। (৪৪৭) (আধুনিক প্রকাশনীঃ ২৬০২, ইসলামিক ফাউন্ডেশনঃ ২৬১৪)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2813,
			"arabicnumber": 2813,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। খন্দকের যুদ্ধ থেকে যখন আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) ফিরে এসে অস্ত্র রাখলেন এবং গোসল করলেন, তখন জিব্রীল (আঃ) তাঁর নিকট এলেন, আর তাঁর মাথায় পট্টির মত ধুলি জমেছিল। তিনি বললেন, আপনি অস্ত্র রেখে দিয়েছেন অথচ আল্লাহর কসম, আমি এখনো অস্ত্র রাখিনি। আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বললেন, কোথায় যেতে হবে? তিনি বানূ কুরায়যার প্রতি ইশারা করে বললেন, এদিকে। ‘আয়িশাহ (রাঃ) বলেন, অতঃপর আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) তাদের দিকে বেরিয়ে পড়লেন। (৪৬৩) (আধুনিক প্রকাশনীঃ ২৬০৩, ইসলামিক ফাউন্ডেশনঃ ২৬১৫)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2814,
			"arabicnumber": 2814,
			"text": "(وَلَا تَحْسَبَنَّ الَّذِيْنَ قُتِلُوْا فِيْ سَبِيْلِ اللهِ أَمْوَاتًام بَلْ أَحْيَاءٌ عِنْدَ رَبِّهِمْ يُرْزَقُوْنَ فَرِحِيْنَ بِمَا اٰتَاهُمْ اللهُ مِنْ فَضْلِهِ وَيَسْتَبْشِرُوْنَ بِالَّذِيْنَ لَمْ يَلْحَقُوْا بِهِمْ مِنْ خَلْفِهِمْ أَلَّا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُوْنَ يَسْتَبْشِرُوْنَ بِنِعْمَةٍ مِّنَ اللهِ وَفَضْلٍ وَأَنَّ اللهَ لَا يُضِيْعُ أَجْرَ الْمُؤْمِنِيْنَ) যারা আল্লাহর পথে নিহত হয় তোমরা কখনও তাদের মৃত ধারণা কর না। বরং তারা তাদের রবের কাছে জীবিত এবং জীবিকাপ্রাপ্ত। তারা পরিতুষ্ট তাতে যা আল্লাহ তাদের দান করেছেন নিজ অনুগ্রহে এবং তারা আনন্দ প্রকাশ করছে তাদের ব্যাপারে যারা এখনও তাদের সাথে মিলিত হয়নি, তাদের পেছনে রয়ে গেছে। কারণ তাদের কোন ভয় নেই এবং তারা দুঃখিতও হবে না। তারা আনন্দ প্রকাশ করে আল্লাহর তরফ থেকে নিয়ামাত ও অনুগ্রহ লাভের জন্য। আর আল্লাহ তো মু’মিনদের শ্রমফল বিনষ্ট করেন না। (আলে ‘ইমরান ১৬৯-১৭১) ২৮১৪. আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। তিনি বলেন, যারা বীরে মাউনায় শরীক সাহাবীদেরকে শহীদ করেছিল, আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) সেই রি’ল ও যাক্ওয়ানের বিরুদ্ধে ত্রিশ দিন পর্যন্ত ফজরে দু‘আ করেছিলেন এবং উসাইয়্যাহ গোত্রের বিরুদ্ধেও যারা আল্লাহ্ ও তাঁর রাসূলের বিরুদ্ধাচরণ করেছিল। আনাস (রাঃ) বলেন, বী’রে মাউনার নিকট শহীদ সাহাবীদের সম্পর্কে কুরআনের আযাত নাযিল হয়েছিল, যা আমরা পাঠ করেছি। পরে তা মানসুখ হয়ে যায়। (আয়াতটি হলো) بَلِّغُوْا قَوْمَنَا أَنْ قَدْ لَقِيْنَا رَبَّنَا فَرَضِيَ عَنَّا وَرَضِيْنَا عَنْهُ ‘‘তোমরা আমাদের কাওমের নিকট এ খবর পৌঁছে দাও যে, আমরা আমাদের রবের সাক্ষাত লাভ করেছি। তিনি আমাদের প্রতি সন্তুষ্ট এবং আমরাও তাঁর প্রতি সন্তুষ্ট।’’ (১০০১) (আধুনিক প্রকাশনীঃ ২৬০৪, ইসলামিক ফাউন্ডেশনঃ ২৬১৬)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2815,
			"arabicnumber": 2815,
			"text": "জাবির ইবনু ‘আবদুল্লাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, উহুদের যুদ্ধের দিন কিছু সংখ্যক সাহাবী সকাল বেলায় শরাব পান করেন [১], অতঃপর যুদ্ধে তারা শাহাদাত লাভ করেন। সুফ্ইয়ান (রহ.)-কে প্রশ্ন করা হলঃ সেই দিনের শেষ প্রহরে? তিনি বললেন, এ কথাটি তাতে নেই। (৪০৪৪, ৪৬১৮) (আধুনিক প্রকাশনীঃ ২৬০৫, ইসলামিক ফাউন্ডেশনঃ ২৬১৭)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2816,
			"arabicnumber": 2816,
			"text": "জাবির ইবনু ‘আবদুল্লাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, উহুদের যুদ্ধ শেষে আমার পিতাকে (তার লাশ) নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর নিকট অঙ্গ-প্রত্যঙ্গ কাটা অবস্থায় আনা হল এবং তাঁর সামনে রাখা হল। আমি তাঁর চেহারা খুলতে চাইলাম আমার গোত্রের লোকেরা আমাকে নিষেধ করল। এমন সময় তিনি কোন বিলাপকারিণীর বিলাপ ধ্বনি শুনতে পেলেন। বলা হলো, সে ‘আমরের কন্যা বা ভগ্নি। অতঃপর নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বললেন, সে কাঁদছে কেন? অথবা বলেছিলেন, সে যেন না কাঁদে। ফেরেশতামন্ডলী তাকে ডানা দ্বারা ছায়াদান করছেন। আমি [ইমাম বুখারী (রহ.) বলেন] সাদাকা (রহ.)-কে জিজ্ঞেস করলাম, এও কি বর্ণিত আছে যে, তাকে উঠিয়ে নেয়া পর্যন্ত? তিনি বললেন, (জাবির (রাঃ) কখনো সেটাও বলেছেন। (১২৪৪) (আধুনিক প্রকাশনীঃ ২৬০৬, ইসলামিক ফাউন্ডেশনঃ ২৬১৮)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2817,
			"arabicnumber": 2817,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেন, জান্নাতে প্রবেশের পর আর কেউ দুনিয়ায় ফিরে আসার আকাঙ্ক্ষা করবে না, যদিও দুনিয়ার সকল জিনিস তাকে দেয়া হয়। একমাত্র শহীদ ব্যতীত; সে দুনিয়ায় ফিরে আসার আকাঙ্ক্ষা করবে যেন দশবার শহীদ হয়। কেননা সে শাহাদাতের মর্যাদা দেখেছে। (২৭৯৫) (মুসলিম ৩৩/২৯ হাঃ ১৮৭৭, আহমাদ ১২২৭৫) (আধুনিক প্রকাশনীঃ ২৬০৭, ইসলামিক ফাউন্ডেশনঃ ২৬১৯)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2818,
			"arabicnumber": 2818,
			"text": "وَقَالَ الْمُغِيْرَةُ بْنُ شُعْبَةَ أَخْبَرَنَا نَبِيُّنَا صلى الله عليه وسلمعَنْ رِسَالَةِ رَبِّنَا مَنْ قُتِلَ مِنَّا صَارَ إِلَى الْجَنَّةِ وَقَالَ عُمَرُ لِلنَّبِيِّ صلى الله عليه وسلم أَلَيْسَ قَتْلَانَا فِي الْجَنَّةِ وَقَتْلَاهُمْ فِي النَّارِ قَالَ بَلَى মুগীরাহ ইবনু শু‘বা (রাঃ) বলেন, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) আমাদের জানিয়েছেন, আমাদেও প্রতিপালকের পয়গাম। আমাদের মধ্যে যে শহীদ হলো সে জান্নাতে পৌঁছে গেল। ‘উমার (রাঃ) নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-কে বলেন, আমাদের শহীদগণ জান্নাতবাসী আর তাদের নিহতরা কি জাহান্নামবাসী নয়? আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেন, হ্যাঁ। ২৮১৮. ‘উমার ইবনু ‘উবায়দুল্লাহ্ (রহ.)-এর আযাদকৃত গোলাম ও তার কাতিব সালিম আবূন নাযর (রহঃ) হতে বর্ণিত। তিনি বলেন, ‘আবদুল্লাহ্ ইবনু আবূ আওফা (রাঃ) তাঁকে লিখেছিলেন যে, আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেন, তোমরা জেনে রাখ, তরবারির ছায়া-তলেই জান্নাত। উয়াইসী (রহ.) ইবনু আবূ যিনাদ (রহ.)-এর মাধ্যমে মূসা ইবনু ‘উকবাহ (রহ.) থেকে হাদীস বর্ণনার ব্যাপারে মু‘আবিয়াহ ইবনু ‘আমর (রহ.) আবূ ইসহাক (রহ.)-এর মাধ্যমে মূসা ইবনু ‘উকবাহ (রাঃ) হতে বর্ণিত হাদীসের অনুসরণ করেছেন। (২৮৩৩, ২৯৬৬, ৩০২৪, ৭২৩৭) (মুসলিম ৩২/৬ হাঃ ১৭৪২, আহমাদ ১৯১৩৬) (আধুনিক প্রকাশনীঃ ২৬০৮, ইসলামিক ফাউন্ডেশনঃ ২৬২০)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2819,
			"arabicnumber": 2819,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেন, সুলায়মান ইবনু দাউদ (আঃ) বলেছিলেন, আজ রাতে আমি একশ’ অথবা বলেছেন নিরানব্বই জন স্ত্রীর সঙ্গে সঙ্গত হব। তাদের প্রত্যেকেই একজন বীর মুজাহিদ প্রসব করবে। তার একজন সাথী বললেন, বলুন, ইনশাআল্লাহ্! কিন্তু তিনি ইনশাআল্লাহ্ বলেননি। ফলে একজন স্ত্রী ব্যতীত কেউই গর্ভবতী হলেন না। তিনিও একটি অপূর্ণাঙ্গ সন্তান প্রসব করলেন। সেই সত্তার কসম, যাঁর হাতে মুহাম্মাদ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর প্রাণ, যদি তিনি ইনশাআল্লাহ্ বলতেন, তবে সকলের সন্তান হত এবং তারা সকলেই ঘোড় সওয়ার হয়ে আল্লাহর রাস্তায় জিহাদ করত। (৩৪২৪, ৫২৪২, ৬৬৩৯, ৬৭২০, ৭৪৬৯) (আধুনিক প্রকাশনীঃ ২৬০৯, ইসলামিক ফাউন্ডেশনঃ ১৭৬৪ পরিচ্ছেদ)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2820,
			"arabicnumber": 2820,
			"text": "আনাস (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) সর্বাপেক্ষা সুশ্রী, সাহসী ও দানশীল ছিলেন। মদিনা্বাসীগণ একবার ভীত-শংকিত হয়ে পড়ল। নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) ঘোড়ায় চড়ে সবার আগে এগিয়ে গিয়ে বললেন, আমরা এটিকে সমুদ্রের মত পেয়েছি।",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2821,
			"arabicnumber": 2821,
			"text": "জুবাইর ইবনু মুত্‘ইম (রাঃ) হতে বর্ণিত। হুনাইন থেকে ফেরার পথে তিনি আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর সঙ্গে চলছিলেন। তাঁর সঙ্গে আরো অনেক সাহাবী ছিলেন। এমন সময় কিছু গ্রাম্য ব্যক্তি এসে তাঁকে জড়িয়ে ধরল এবং তাদের কিছু দেয়ার জন্য পীড়াপীড়ি শুরু করল। এমনকি তারা তাঁকে একটি গাছের নিকট নিয়ে গেল এবং তাঁর চাদর আটকে গেল। নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) সেখানে দাঁড়িয়ে গেলেন এবং বললেন, আমার চাদরটি ফিরিয়ে দাও। আমার নিকট যদি এই সব কাঁটাদার গাছের পরিমাণ বক্রী থাকত, তাহলে এর সবই তোমাদের ভাগ করে দিতাম। আর তোমরা আমাকে কৃপণ, মিথ্যুক ও কাপুরুষ দেখতে পেতে না। (৩১৪৮) (আধুনিক প্রকাশনীঃ ২৬১১, ইসলামিক ফাউন্ডেশনঃ ২৬২২)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2822,
			"arabicnumber": 2822,
			"text": "‘আমর ইবনু মায়মূন আউদী (রহ.) হতে বর্ণিত। শিক্ষক যেমন ছাত্রদের লেখা শিক্ষা দেন, সা‘দ (রাঃ) তেমনি তাঁর সন্তানদের এ বাক্যগুলো শিক্ষা দিতেন এবং বলতেন, আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) সালাতের পর এগুলো থেকে পানাহ চাইতেন, ‘হে আল্লাহ্! আমি ভীরুতা, অতি বার্ধক্য, দুনিয়ার ফিতনা ও কবরের শাস্তি থেকে আপনার নিকট পানাহ চাই।’ রাবী বলেন, আমি মুস‘আব (রাঃ)-এর নিকট হাদীসটি বর্ণনা করলে তিনি এটির সত্যতা স্বীকার করেন। (৬৩৬৫, ৬৩৭০, ৬৩৭৪, ৬৩৯০) (আধুনিক প্রকাশনীঃ ২৬১২, ইসলামিক ফাউন্ডেশনঃ ২৬২৩)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2823,
			"arabicnumber": 2823,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) এই দু‘আ করতেন, ‘হে আল্লাহ্! আমি অক্ষমতা, ভীরুতা ও বার্ধক্য থেকে আপনার নিকট পানাহ চাচ্ছি এবং জীবন ও মরণের ফিতনা থেকে এবং কবরের আযাব থেকে আপনার নিকট পানাহ চাচ্ছি।’ (৪৭০৭, ৬৩৬৭, ৬৩৭১) (মুসলিম ৪৮/১৫ হাঃ ২৭০৬, আহমাদ ১২১১৪) (আধুনিক প্রকাশনীঃ ২৬১৩, ইসলামিক ফাউন্ডেশনঃ ২৬২৪)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2824,
			"arabicnumber": 2824,
			"text": "قَالَهُ أَبُوْ عُثْمَانَ عَنْ سَعْدٍ আবূ ‘উসমান (রহ.) তা সা‘দ (রাঃ) থেকে বর্ণনা করেছেন ২৮২৪. সায়িব ইবনু ইয়াযীদ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি ত্বলহা ইবনু ‘উবায়দুল্লাহ, সা‘দ, মিকদাদ ইবনু আসওয়াদ এবং ‘আবদুর রাহমান ইবনু আওফ (রাঃ)-এর সাহচর্য লাভ করেছি। আমি তাদের কাউকে আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) থেকে হাদীস বর্ণনা করতে শুনিনি। তবে ত্বলহা (রাঃ)-কে উহুদ যুদ্ধের ঘটনাবলী বর্ণনা করতে শুনেছি। (৪০৬২) (আধুনিক প্রকাশনীঃ ২৬১৪, ইসলামিক ফাউন্ডেশনঃ ২৮২৫)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2825,
			"arabicnumber": 2825,
			"text": "আল্লাহ্ তাআলার বাণীঃ তোমরা অভিযানে বের হয়ে পড়, স্বল্প সরঞ্জামের সাথে কিংবা প্রচুর সরঞ্জামের সাথে; এবং জিহাদ কর আল্লাহর পথে নিজেদের মাল দিয়ে ও নিজেদের জান দিয়ে। এটাই তোমাদের জন্য শ্রেয়, যদি তোমরা জানতে। যদি আশু লাভের সম্ভাবনা থাকত এবং সফরও সহজ হত, তবে তারা অবশ্যই আপনার অনুগামী হত, কিন্তু তাদের কাছে যাত্রাপথ দীর্ঘ মনে হল। আর তারা এখনই আল্লাহর নামে শপথ করে বলবেঃ আমাদের সাধ্য থাকলে নিশ্চয়ই আমরা তোমাদের সাথে বের হতাম। তারা নিজেরাই নিজেদের ধ্বংস করছে। আল্লাহ জানেন যে, তারা তো মিথ্যাবাদী। (আত তওবা্ ৪১-৪২) আল্লাহ্ তাআলা আরো বলেনঃ ওহে যারা ঈমান এনেছ! তোমাদের কী হল? যখন তোমাদের আল্লাহর পথে অভিযানে বের হতে বলা হয় তখন তোমরা ভারাক্রান্ত হয়ে মাটিতে ঝুঁকে পড়। তবে কি তোমরা আখিরাতের পরিবর্তে পার্থিব জীবনে তুষ্ট হয়ে গেলে? বস্তুত আখিরাতের তুলনায় পার্থিব জীবনের ভোগের উপকরণ নিতান্ত অকিঞ্চিৎকর।। (আত তওবা্ ৩৮-৩৯) ইবনু ‘আব্বাস (রাঃ) থেকে উল্লেখ রয়েছে,অর্থ হলো- বিভিন্ন ক্ষুদ্র ক্ষুদ্র দলে বিভক্ত হয়ে তোমরা জিহাদের জন্য বেরিয়ে পড়। শব্দটির একবচন অর্থ ক্ষুদ্র দল। ২৮২৫. ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিত। নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) মক্কা বিজয়ের দিন বলেছিলেন, এই বিজয়ের পর আর হিজরাতের প্রয়োজন নেই। এখন কেবল জিহাদ ও নিয়্যাত। যখনই তোমাদের বের হবার আহবান জানানো হবে, তখনই তোমরা বেরিয়ে পড়বে। (১৩৪৯) (আধুনিক প্রকাশনীঃ ২৬১৫, ইসলামিক ফাউন্ডেশনঃ ২৬২৬)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2826,
			"arabicnumber": 2826,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেন, দু’ব্যক্তিও ক্ষেত্রে আল্লাহ্ হাসেন। যারা একে অপরকে হত্যা করে উভয়েই জান্নাতবাসী হবে। একজন তো এ কারণে জান্নাতবাসী হবে যে, সে আল্লাহর রাস্তায় জিহাদ করে শহীদ হয়েছে। অতঃপর আল্লাহ্ তা‘আলা হত্যাকারীর তওবা কবুল করেছেন। ফলে সেও আল্লাহর রাস্তায় শহীদ বলে গণ্য হয়েছে। (মুসলিম ৩৩/৩৫ হাঃ ১৮৯০, আহমাদ ৯৯৮৩) (আধুনিক প্রকাশনীঃ ২৬১৬, ইসলামিক ফাউন্ডেশনঃ ২৬২৭)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2827,
			"arabicnumber": 2827,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, খায়বার বিজয়ের পর আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর সেখানে অবস্থানকালেই আমি তাঁর নিকট গিয়ে বললাম, ‘হে আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)! আমাকেও অংশ দিন।’ তখন সা‘ঈদ ইবনু ‘আসের কোন এক পুত্র বলে উঠল, ‘হে আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)! তাকে অংশ দিবেন না।’ আবূ হুরাইরাহ্ (রাঃ) বললেন, সে তো ইবনু কাউকালের হত্যাকারী। তা শুনে সা‘ঈদ ইবনু ‘আসের পুত্র বললেন, ‘যান’ পাহাড়ের নিম্নদেশ থেকে আমাদের নিকট আগত বিড়াল মাশি জন্তুটি, তার কথায় আশ্চর্যবোধ করছি, সে আমাকে এমন একজন মুসলিমকে হত্যার দায়ে অভিযুক্ত করেছে যাকে আল্লাহ্ তা‘আলা আমার হাতে সম্মানিত করেছেন এবং যার দ্বারা আমাকে লাঞ্ছিত করেননি। ‘আব্বাস (রাঃ) বলেন, পরে তাকে অংশ দিয়েছেন কি দেননি, তা আমার জানা নেই। সুফইয়ান (রহ.) বলেন, আমাকে সা‘ঈদী (রহ.) তার দাদার মাধ্যমে আবূ হুরাইরাহ্ (রহ.) থেকে হাদীসটি বর্ণনা করেছেন। আবূ ‘আবদুল্লাহ্ (ইমাম বুখারী) (রহ.) বলেন, সা‘ঈদী হলেন, ‘আমর ইবনু ইয়াহইয়া ইবনু সা‘ঈদ ইবনু ‘আমর ইবনু সা‘ঈদ ইবনু ‘আস। (৪২৩৭, ৪২৩৮, ৪২৩৯) (আধুনিক প্রকাশনীঃ ২৬১৭, ইসলামিক ফাউন্ডেশনঃ ২৬২৮)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 2828,
			"arabicnumber": 2828,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর জীবদ্দশায় আবূ ত্বলহা (রাঃ) জিহাদের কারণে সিয়াম পালন করতেন না। কিন্তু আল্লাহর রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর ইন্তিকালের পর ‘ঈদুল ফিতর ও ‘ঈদুল আয্হা ব্যতীত তাকে কখনো সিয়াম বাদ দিতে দেখিনি। (আ.প্র. ২৬১৮, ই.ফা. ২৬২৯)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 2829,
			"arabicnumber": 2829,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেন, পাঁচ প্রকার মৃত শহীদঃ মহামারীতে মৃত, পেটের পীড়ায় মৃত, পানিতে ডুবে মৃত, ধ্বংসস্তূপে চাপা পড়ে মৃত এবং যে আল্লাহর পথে শহীদ হলো। (৬৫৩) (আধুনিক প্রকাশনীঃ ২৬১৯, ইসলামিক ফাউন্ডেশনঃ ২৬৩০)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 2830,
			"arabicnumber": 2830,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেন, মহামারীতে মৃত্যু হওয়া প্রতিটি মুসলিমের জন্য শাহাদাত। (৫৭৩২) (মুসলিম ৩৩/৫১ হাঃ ১৯১৬, আহমাদ ১২৫২১) (আধুনিক প্রকাশনীঃ ২৬২০, ইসলামিক ফাউন্ডেশনঃ ২৬৩১)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 2831,
			"arabicnumber": 2831,
			"text": "لَا يَسْتَوِي الْقٰعِدُوْنَ مِنَ الْمُؤْمِنِيْنَ غَيْرُ أُولِي الضَّرَرِ وَالْمُجٰهِدُوْنَ فِيْ سَبِيْلِ اللهِ بِأَمْوٰلِهِمْ وَأَنْفُسِهِمْ فَضَّلَ اللهُ الْمُجٰهِدِيْنَ بِأَمْوٰلِهِمْ وَأَنْفُسِهِمْ عَلَى الْقٰعِدِيْنَ دَرَجَةً ط وَكُلًّا وَّعَدَ اللهُ الْحُسْنٰى وَفَضَّلَ اللهُ الْمُجٰهِدِيْنَ عَلَى الْقَاعِدِيْنَ( إِلَى قَوْلِهِ )غَفُوْرًا رَّحِيْمًا( গৃহে উপবিষ্ট মুসলিম-যাদেরও কোন সঙ্গত ওযর নেই এবং ঐ মুসলিম যারা জান ও মাল দ্বারা আল্লাহর পথে জিহাদ করে-সমান নয়। যারা জান ও মাল দ্বারা জিহাদ করে, আল্লাহ তাদের পদমর্যাদা বাড়িয়ে দিয়েছেন গৃহে উপবিষ্টদের তুলনায় এবং প্রত্যেকের সাথেই আল্লাহ কল্যাণের ওয়াদা করেছেন। আল্লাহ মুজাহিদ্বীনকে উপবিষ্টদের উপর মহান প্রতিদানে শ্রেষ্ঠ করেছেন। এগুলো তাঁর পক্ষ থেকে পদমর্যাদা, ক্ষমা ও করুণা; আল্লাহ ক্ষমাশীল ও করুণাময়। (আন-নিসা ৯৫-৯৬) ২৮৩১. বারা‘ (রাঃ) হতে বর্ণিত। তিনি বলেন, لَا يَسْتَوِي الْقَاعِدُوْنَ مِنَ الْمُؤْمِنِيْن আয়াতটি নাযিল হলে আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) যায়দ (রাঃ)-কে ডেকে আনলেন। তিনি কোন জন্তুর একটি চওড়া হাড় নিয়ে আসেন এবং তাতে উক্ত আয়াতটি লিখে রাখেন। ইবনু উম্মু মাকতুম জিহাদে শরীক হওয়ার ব্যাপারে তাঁর অক্ষমতা প্রকাশ করলে لَا يَسْتَوِي الْقَاعِدُوْنَ مِنْ الْمُؤْمِنِيْنَ غَيْرُ أُولِي الضَّرَرِ আয়াতটি নাযিল হল। (৪৫৯৩, ৪৫৯৪, ৪৯৯০) (মুসলিম ৩৩/৪০ হাঃ ১৮৯৮, ) (আধুনিক প্রকাশনীঃ ২৬২১, ইসলামিক ফাউন্ডেশনঃ ২৬৩২)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 2832,
			"arabicnumber": 2832,
			"text": "সাহল ইবনু সা‘দ সা‘ঈদী (রাঃ) হতে বর্ণিত। তিনি বলেন যে, আমি মারওয়ান ইবনু হাকামকে মসজিদে উপবিষ্ট অবস্থায় দেখলাম। অতঃপর আমি তাঁর দিকে এগিয়ে গেলাম এবং তাঁর পাশে গিয়ে বসলাম। তিনি আমাকে বর্ণনা করেন যে, যায়দ ইবনু সাবিত (রাঃ) তাঁকে জানিয়েছেন, আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) তাঁর উপর অবতীর্ণ আয়াত, ‘‘মুসলিমদের মধ্যে যারা ঘরে বসে থাকে এবং যারা আল্লাহর পথে জিহাদ করে তারা সমান নয়’’ (আন-নিসাঃ ৯৫) যখন তাকে দিয়ে লিখেছিলেন, ঠিক সে সময় অন্ধ ইবনু উম্মু মাকতুম (রাঃ) সেখানে উপস্থিত হয়ে বললেন, ‘হে আল্লাহর রাসূল! আমি যদি জিহাদে যেতে সক্ষম হতাম, তবে অবশ্যই অংশ গ্রহণ করতাম।’ সে সময় আল্লাহ্ তা‘আলা তাঁর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর উপর ওয়াহী নাযিল করেন। তখন আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর উরু আমার উরুর উপর রাখা ছিল এবং তা আমার নিকট এতই ভারী মনে হচ্ছিল যে, আমি আমার উরু ভেঙ্গে যাবার আশংকা করছিলাম। অতঃপর ওয়াহী অবতীর্ণ হবার অবস্থা দূর হল, এ সময় غَيْرُ أُولِي الضَّرَرِ আয়াতটি আল্লাহ নাযিল করেন। (৪৫৯২) (আধুনিক প্রকাশনীঃ ২৬২২, ইসলামিক ফাউন্ডেশনঃ ২৬৩৩)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 2833,
			"arabicnumber": 2833,
			"text": "সালিম আবু নাযর (রহ.) হতে বর্ণিত। ‘আবদুল্লাহ্ ইবনু আবূ আওফা (রাঃ) লিখে পাঠালেন, আর আমি তাতে পড়লাম যে, আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেন, যখন তোমরা তাদের (শত্রুদের) মুখোমুখী হবে তখন ধৈর্য অবলম্বন করবে। (২৮১৮) (আধুনিক প্রকাশনীঃ ২৬২৩, ইসলামিক ফাউন্ডেশনঃ ২৬৩৪)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 2834,
			"arabicnumber": 2834,
			"text": "(وَقَوْلِهِ تَعَالَى )حَرِّضِ الْمُؤْمِنِيْنَ عَلَى الْقِتَالِ (65) আল্লাহ্ তাআলার বাণীঃ (জিহাদের জন্য মুমিনদের উদ্বুদ্ধ করুন) (আল-আনফালঃ ৬৫)। ২৮৩৪. আনাস (রাঃ) হতে বর্ণিত। আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) খন্দকের দিকে বের হলেন, হিম শীতল সকালে আনসার ও মুহাজিররা পরিখা খনন করছেন, আর তাদের এ কাজ করার জন্য তাদের কোন গোলাম ছিল না। যখন তিনি তাদের দেখতে পেলেন যে, তারা কষ্ট এবং ক্ষুধায় আক্রান্ত, তখন বললেন, হে আল্লাহ্! সত্যিকারে আয়েশ হচ্ছে আখেরাতের আয়েশ। তুমি আনসার ও মুহাজিরদের ক্ষমা করে দাও। এর উত্তরে তারা বলে উঠেনঃ আমরা তারাই যারা মুহাম্মাদের হাতে বায়‘আত করেছি জিহাদের, যদ্দিন আমরা বেঁচে আছি। (২৮৩৫, ২৯৬১, ৩৭৯৫, ৩৭৯৬, ৪০৯৯, ৪১০০, ৬৪১৩, ৭২০১) (মুসলিম ৩২/৪৪ হাঃ ১৮০৫, আহমাদ ১২৭৩২) (আধুনিক প্রকাশনীঃ ২৬২৪, ইসলামিক ফাউন্ডেশনঃ ২৬৩৫)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 2835,
			"arabicnumber": 2835,
			"text": "আনাস (রাঃ) হতে বর্ণিত। তিনি বলেন, আনসার ও মুহাজিরগণ মদিনার পাশে পরিখা খনন করছিলেন এবং তারা পিঠে করে মাটি বহন করছিলেন। আর তারা এই কবিতা আবৃত্তি করছিলেনঃ আমরা ইসলামের উপর মুহাম্মদের হাতে বায়‘আত নিয়েছি, ততদিন পর্যন্ত যদ্দিন আমরা বেঁচে থাকি। আর নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) তাদের উত্তরে বলেছিলেনঃ হে আল্লাহ্! আখিরাতের কল্যাণ ব্যতীত কোন কল্যাণ নেই। তাই আনসার ও মুহাজিরদের প্রতি বরকত নাযিল করুন। (২৮৩৪) (আধুনিক প্রকাশনীঃ ২৬২৫, ইসলামিক ফাউন্ডেশনঃ ২৬৩৬)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 2836,
			"arabicnumber": 2836,
			"text": "বারা’ (রাঃ) হতে বর্ণিত যে, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) মাটি উঠাচ্ছিলেন এবং বলছিলেন, যদি আপনি না হতেন তাহলে আমরা হিদায়াত লাভ করতাম না। (২৮৩৭, ৩০৩৪, ৪১০৪, ৪১০৬, ৬৬২০, ৭২৩৬) (আধুনিক প্রকাশনীঃ ২৬২৬, ইসলামিক ফাউন্ডেশনঃ ২৬৩৭)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 2837,
			"arabicnumber": 2837,
			"text": "বারা’ (রাঃ) হতে বর্ণিত। তিনি বলেন, আহযাবের দিন আমি আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-কে দেখেছি যে, তিনি মাটি বহন করছেন। আর তাঁর পেটের শুভ্রতা মাটি ঢেকে ফেলেছে। সে সময় তিনি আবৃত্তি করছিলেন, (হে আল্লাহ্)ঃ আপনি না হলে আমরা হিদায়াত পেতাম না; সদাকাহ দিতাম না এবং সালাত আদায় করতাম না। তাই আমাদের উপর শান্তি নাযিল করুন। যখন আমরা শত্রু সম্মুখীন হই তখন আমাদের পা সুদৃঢ় করুন। ওরা আমাদের বিরুদ্ধাচরণ করেছে। তারা যখনই কোন ফিতনা সৃষ্টি করতে চায় তখনই আমরা তা থেকে বিরত থাকি। (২৮৩৬) (মুসলিম ৩২/৪৪ হাঃ ১৮০৩, আহমাদ ১৮৫৩৮) (আধুনিক প্রকাশনীঃ ২৬২৭, ইসলামিক ফাউন্ডেশনঃ ২৬৩৮)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 2838,
			"arabicnumber": 2838,
			"text": "আনাস (রাঃ) হতে বর্ণিত। তিনি বলেন, আমরা তাবূকের যুদ্ধ থেকে নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর সঙ্গে প্রত্যাবর্তন করেছি। (২৮৩৯, ৪৪২৩) (আধুনিক প্রকাশনীঃ ২৬২৮, ইসলামিক ফাউন্ডেশনঃ)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 2839,
			"arabicnumber": 2839,
			"text": "আনাস (রাঃ) হতে বর্ণিত যে, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) এক যুদ্ধে ছিলেন, তখন তিনি বললেন, কিছু ব্যক্তি মদিনা্য় আমাদের পেছনে রয়েছে। আমরা কোন ঘাঁটি বা কোন উপত্যকায় চলিনি, তাদের সঙ্গে ব্যতীত। ওযরই তাদের বাধা দিয়েছে। (২৮৩৮) (আধুনিক প্রকাশনীঃ ২৬২৯, ইসলামিক ফাউন্ডেশনঃ ২৬৩৯)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 2840,
			"arabicnumber": 2840,
			"text": "আবূ সা‘ঈদ খুদরী (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-কে বলতে শুনেছি, যে ব্যক্তি আল্লাহর রাস্তায় এক দিনও সিয়াম পালন করে, আল্লাহ্ তার মুখমন্ডলকে দোযখের আগুন হতে সত্তর বছরের রাস্তা দূরে সরিয়ে নেন। (মুসলিম ১৩/৩১ হাঃ ১১৫৩, আহমাদ ১১৭৯০) (আধুনিক প্রকাশনীঃ ২৬৩০, ইসলামিক ফাউন্ডেশনঃ ২৬৪০)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 2841,
			"arabicnumber": 2841,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেন, যে ব্যক্তি আল্লাহর রাস্তায় দু’টি করে কোন জিনিস ব্যয় করবে, জান্নাতের প্রত্যেক দরজায় প্রহরী তাকে ডাক দিবে। (তারা বলবে), হে অমুক। এদিকে আস। আবূ বাকর (রাঃ) বললেন, ‘হে আল্লাহর রাসূল! তাহলে তো তার জন্য কোন ক্ষতি নেই। নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বললেন, ‘আমি আশা করি যে, তুমি তাদের অন্তর্ভুক্ত হবে।’ (১৮৯৭) (মুসলিম ১২/২৭ হাঃ ১০২৭, আহমাদ ৭৬৩৭) (আধুনিক প্রকাশনীঃ ২৬৩১, ইসলামিক ফাউন্ডেশনঃ ২৬৪১)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 2842,
			"arabicnumber": 2842,
			"text": "আবূ সা‘ঈদ খুদরী (রাঃ) হতে বর্ণিত যে, আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) মিম্বারে দাঁড়ালেন এবং বললেন, আমি আমার পর তোমাদের জন্য ভয় করি এ ব্যাপারে যে, তোমাদের জন্য দুনিয়ার কল্যাণের দরজা খুলে দেয়া হবে। অতঃপর তিনি দুনিয়ার নিয়ামতের উল্লেখ করেন। এতে তিনি প্রথমে একটির কথা বলেন, পরে দ্বিতীয়টির বর্ণনা করেন। এক ব্যক্তি দাঁড়িয়ে জিজ্ঞেস করল, ‘হে আল্লাহর রাসূল! কল্যাণও কি অকল্যাণ বয়ে আনবে?’ নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) নীরব রইলেন, আমরা বললাম, তাঁর উপর ওয়াহী নাযিল হচ্ছে। সমস্ত লোকও এমনভাবে নীরবতা অবলম্বন করল, যেন তাদের মাথার উপর পাখী বসে আছে। অতঃপর আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) মুখের ঘাম মুছে বললেন, সেই প্রশ্নকারী কোথায়? তা কী কল্যাণকর? তিনি তিনবার এ কথাটি বললেন। কল্যাণ কল্যাণই বয়ে আনে। আর এতে কোন সন্দেহ নেই যে, বসন্তকালীন উদ্ভিদ পশুকে ধ্বংস অথবা ধ্বংসের মুখে নিয়ে আসে। কিন্তু যে পশু সেই ঘাস এ পরিমাণ খায় যাতে তার ক্ষুধা মিটে, অতঃপর রোদ পোহায় এবং মলমূত্র ত্যাগ করে, অতঃপর আবার ঘাস খায়। নিশ্চয়ই এ মাল সবুজ শ্যামল সুস্বাদু। সেই মুসলিমের সম্পদই উত্তম যে ন্যায়সঙ্গতভাবে তা উপার্জন করেছে এবং আল্লাহর পথে, ইয়াতীম ও মিসকীন ও মুসাফিরের জন্য খরচ করেছে। আর যে ব্যক্তি অন্যায়ভাবে অর্জন করে তার দৃষ্টান্ত এমন ভক্ষণকারীর মত যার ক্ষুধা মিটে না এবং তা কিয়ামতের দিন তার বিরুদ্ধে সাক্ষ্য দেবে। (৯২১) (আধুনিক প্রকাশনীঃ ২৬৩২, ইসলামিক ফাউন্ডেশনঃ ২৬৪২)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 2843,
			"arabicnumber": 2843,
			"text": "যায়দ ইবনু খালিদ (রাঃ) হতে বর্ণিত। আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেন, ‘যে ব্যক্তি আল্লাহর পথে জিহাদকারীর আসবাবপত্র সরবরাহ করল সে যেন জিহাদ করল। আর যে ব্যক্তি আল্লাহর পথে কোন জিহাদকারীর পরিবার-পরিজনকে উত্তমরূপে দেখাশোনা করল, সেও যেন জিহাদ করল। (মুসলিম ৩৩/৩৮ হাঃ ১৮৯৫, আহমাদ ১৭০৩৬) (আধুনিক প্রকাশনীঃ ২৬৩৩, ইসলামিক ফাউন্ডেশনঃ ২৬৪৩)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 2844,
			"arabicnumber": 2844,
			"text": "আনাস (রাঃ) হতে বর্ণিত। নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) মদিনা্য় উম্মু সুলাইম ছাড়া কারো ঘরে যাতায়াত করতেন না তাঁর স্ত্রীদের ব্যতীত। এ ব্যাপারে আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-কে জিজ্ঞেস করা হলে তিনি বলেন, ‘উম্মু সুলাইমের ভাই আমার সঙ্গে জিহাদে শরীক হয়ে সে শহীদ হয়েছে, তাই আমি তার প্রতি সহানুভূতি জানাই। (মুসলিম ৪৪/১৯ হাঃ ২৪৫৫) (আধুনিক প্রকাশনীঃ ২৬৩৪, ইসলামিক ফাউন্ডেশনঃ ২৬৪৪)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 2845,
			"arabicnumber": 2845,
			"text": "মূসা ইবনু আনাস (রাঃ) হতে বর্ণিত। তিনি ইয়ামামার যুদ্ধ সম্পর্কে বলেন, তিনি সাবিত ইবনু কায়সের নিকট গিয়ে দেখতে পেলেন যে, তিনি তার উভয় উরু থেকে কাপড় সরিয়ে সুগন্ধি ব্যবহার করছেন। আনাস (রাঃ) জিজ্ঞেস করলেন, ‘হে চাচা! যুদ্ধে যাওয়া থেকে আপনাকে কিসে বিরত রাখল?’ তিনি বললেন, ‘ভাতিজা, এখনই যাব।’ অতঃপর তিনি সুগন্ধি মালিশ করতে লাগলেন। অতঃপর তিনি বসলেন এবং যুদ্ধ ক্ষেত্র থেকে লোকদের পালিয়ে যাওয়া নিয়ে আলোচনা করলেন। তিনি বললেন, ‘তোমরা আমাদের সম্মুখ থেকে সরে যাও। যাতে আমরা শত্রুর মুখোমুখি লড়তে পারি। আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর সঙ্গে আমরা কখনো এরূপ করিনি। কত নিকৃষ্ট তা যা তোমরা তোমাদের শত্রুদেরকে অভ্যস্ত করেছ।’ হাম্মাদ (রহ.) সাবিত (রহ.) সূত্রে আনাস (রাঃ) থেকে হাদীসটি বর্ণনা করেছেন। (আধুনিক প্রকাশনীঃ ২৬৩৫, ইসলামিক ফাউন্ডেশনঃ ২৬৪৫)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 2846,
			"arabicnumber": 2846,
			"text": "জাবির (রাঃ) হতে বর্ণিত। তিনি বলেন, খন্দকের যুদ্ধের সময় আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বললেন, ‘কে আমাকে শত্রু পক্ষের খবরাখবর এনে দিবে?’ যুবাইর (রাঃ) বললেন, ‘আমি আনব।’ তিনি আবার বললেন, ‘আমার শত্রু পক্ষের খবরাখবর কে এনে দিবে?’ যুবায়র (রাঃ) আবারও বললেন, ‘আমি আনব।’ অতঃপর নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বললেন, ‘প্রত্যেক নবীরই সাহায্যকারী থাকে আর আমার সাহায্যকারী যুবাইর।’ (২৮৪৭, ২৯৯৭, ৩৭১৯, ৪১১৩, ৭২৬১) (মুসলিম ৪৪/৬ হাঃ ২৪১৫, আহমাদ ১৪৬৩৯) (আধুনিক প্রকাশনীঃ ২৬৩৬, ইসলামিক ফাউন্ডেশনঃ ২৬৪৬)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 2847,
			"arabicnumber": 2847,
			"text": "জাবির ইবনু ‘আবদুল্লাহ্ (রাঃ) হতে বর্ণিত। নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) লোকদের ডাক দিলেন। সদাকাহ (রহ.) বলেন, আমার মনে হয়, এটি খন্দকের যুদ্ধের সময়ের ঘটনা। যুবাইর (রাঃ) তাঁর ডাকে সাড়া দিলেন। তিনি আবার লোকদের আহবান করলেন, এবারও যুবাইর (রাঃ) সাড়া দিলেন। আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) পুনরায় লোকদের ডাক দিলেন। এবারও কেবল যুবাইর (রাঃ) সাড়া দিলেন। তখন নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বললেন, ‘প্রত্যেক নবীর জন্য বিশেষ সাহায্যকারী থাকে। আমার বিশেষ সাহায্যকারী যুবাইর ইবনু আওয়াম (রাঃ)।’ (২৮৪৬) (আধুনিক প্রকাশনীঃ ২৬৩৭, ইসলামিক ফাউন্ডেশনঃ ২৬৪৭)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 2848,
			"arabicnumber": 2848,
			"text": "মালিক ইবনু হুয়ায়রিস (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর নিকট হতে ফিরে এলাম। তিনি আমাকে ও আমার একজন সঙ্গীকে বললেন, তোমরা আযান দিবে ও ইকামত দিবে এবং তোমাদের মধ্যে যে বয়সে বড় সে ইমামত করবে। (৬২৮) (আধুনিক প্রকাশনীঃ ২৬৩৮, ইসলামিক ফাউন্ডেশনঃ ২৬৪৮)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 2849,
			"arabicnumber": 2849,
			"text": "‘আবদুল্লাহ্ ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেন, ঘোড়ার কপালের কেশগুচ্ছে কল্যাণ আছে কিয়ামত অবধি। (৩৬৪৪) (মুসলিম ৩৩/২৬ হাঃ ১৮৭১, আহমাদ ৪৬১৬) (আধুনিক প্রকাশনীঃ ২৬৩৯, ইসলামিক ফাউন্ডেশনঃ ২৬৪৯)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 2850,
			"arabicnumber": 2850,
			"text": "‘উরওয়াহ ইবনু জা‘দ (রাঃ) সূত্রে নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) হতে বর্ণিত। তিনি বলেন, ঘোড়ার কপালের কেশগুচ্ছে ক্বিয়ামাত (কিয়ামত) পর্যন্ত কল্যাণ আছে। সুলাইমান (রহ.) শুবা (রহ.) সূত্রে ‘উরওয়াহ ইবনু আবুল জা‘দ (রহ.) থেকে বর্ণনা করেছেন। হাদীস বর্ণনায় সুলাইমান (রহ.)-এর অনুসরণ করেছেন মুসাদ্দাদ (রহ.).....উরওয়া ইবনু আবু জা‘দ (রহ.) হতে। (২৮৫২, ৩১১৯, ৩৬৪৩) (আধুনিক প্রকাশনীঃ ২৬৪০, ইসলামিক ফাউন্ডেশনঃ ২৬৫০)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 2851,
			"arabicnumber": 2851,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেন, ঘোড়ার কপালের কেশ দামে বরকত আছে। (৩৬৪৫) (মুসলিম ৩৩/২৬ হাঃ ১৮৭৩, আহমাদ ১২৭৫১) (আধুনিক প্রকাশনীঃ ২৬৪১, ইসলামিক ফাউন্ডেশনঃ ২৬৫১)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 2852,
			"arabicnumber": 2852,
			"text": "‘উরওয়াহ বারিকী (রাঃ) হতে বর্ণিত। নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেন, ঘোড়ার কপালের কেশ গুচ্ছে কল্যাণ রয়েছে কিয়ামত পর্যন্ত। অর্থাৎ (আখিরাতের) পুরস্কার এবং গনীমতের মাল। (২৮৫০) (মুসলিম ৩৩/২৬ হাঃ ১৮৭৩, আহমাদ ১৯৩৭২) (আধুনিক প্রকাশনীঃ ২৬৪২, ইসলামিক ফাউন্ডেশনঃ ২৬৫২)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 2853,
			"arabicnumber": 2853,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেন, যে ব্যক্তি আল্লাহর প্রতি ঈমান ও তাঁর প্রতিশ্রুতির প্রতি বিশ্বাস রেখে আল্লাহর পথে জিহাদের জন্য ঘোড়া প্রস্তুত রাখে, কিয়ামতের দিন সেই ব্যক্তির পাল্লায় ঘোড়ার খাদ্য, পানীয়, গোবর ও পেশাব ওজন করা হবে। (আধুনিক প্রকাশনীঃ ২৬৪৩, ইসলামিক ফাউন্ডেশনঃ ২৬৫৩)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 2854,
			"arabicnumber": 2854,
			"text": "আবূ ক্বাতাদাহ (রাঃ) হতে বর্ণিত যে, তিনি একদা নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর সঙ্গে বের হন। কিন্তু তিনি কয়েকজন সংগী সহ পেছনে পড়ে গেলেন। আবূ ক্বাতাদাহ (রাঃ) ব্যতীত তার সঙ্গীরা সকলেই ইহরাম অবস্থায় ছিলেন। আবূ ক্বাতাদাহ (রাঃ) দেখার পূর্বে তার সঙ্গীরা একটি বন্য গাধা দেখতে পান এবং তাকে চলে যেতে দেন; আবূ ক্বাতাদাহ (রাঃ) গাধাটি দেখা মাত্রই জারাদা নামক তার ঘোড়ার পিঠে আরোহণ করেন এবং ঘোড়ার চাবুকটি উঠিয়ে দিতে সঙ্গীদের বলেন; কিন্তু সঙ্গীরা অস্বীকার করলে তখন আবূ ক্বাতাদাহ (রাঃ) নিজেই চাবুকটি তুলে নেন এবং গাধাটি শিকার করে সঙ্গীদের নিয়ে এর গোশ্ত আহার করেন। এতে তারা লজ্জিত হন। অতঃপর তারা যখন আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর নিকট পৌঁছলেন তখন তিনি বলেন, গাধাটির কোন অংশ তোমাদের নিকট আছে কি? তারা বললেন, আমাদের সঙ্গে একটি পায়া আছে। নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) তা নিয়ে আহার করলেন। (২৮২১) (আধুনিক প্রকাশনীঃ ২৬৪৪, ইসলামিক ফাউন্ডেশনঃ ২৬৫৪)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 2855,
			"arabicnumber": 2855,
			"text": "সাহল (রাঃ) হতে বর্ণিত। তিনি বলেন, আমাদের বাগানে নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর একটি ঘোড়া থাকত, যাকে লুহাইফ বলা হত। আর কেউ কেউ বলেছেন ‘‘লুখাইফ’’। (আধুনিক প্রকাশনীঃ ২৬৪৫, ইসলামিক ফাউন্ডেশনঃ ২৬৫৫)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 2856,
			"arabicnumber": 2856,
			"text": "মু‘আয (রাঃ) হতে বর্ণিত। তিনি বলেন, উফাইর নামক একটি গাধার পিঠে আমি আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর পেছনে আরোহী ছিলাম। তিনি আমাকে বললেন, হে মু‘আয, তুমি কি জান বান্দার উপর আল্লাহর হক কী? এবং আল্লাহর উপর বান্দার হক কী? আমি বললাম, আল্লাহ্ ও তাঁর রাসূলই ভাল জানেন। তিনি বললেন, বান্দার উপর আল্লাহর হক হলো, বান্দা তাঁর ‘ইবাদাত করবে এবং তাঁর সাথে কাউকে শরীক করবে না। আর আল্লাহর উপর বান্দার হক হলো, তাঁর ‘ইবাদাতে কাউকে শরীক না করলে আল্লাহ্ তাকে শাস্তি দিবেন না। আমি বললাম, হে আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)! আমি কি লোকদের এ সুসংবাদ দিব না? তিনি বললেন, তুমি তাদের সুসংবাদটি দিও না, তাহলে লোকেরা এর উপর নির্ভরশীল হয়ে পড়বে। (৫৯৬৭, ৬২৬৭, ৬৫০০, ৭৩৭৩) (মুসলিম ১/১০ হাঃ ৩০, আহমাদ ২২০৫২) (আধুনিক প্রকাশনীঃ ২৬৪৬, ইসলামিক ফাউন্ডেশনঃ ২৬৫৬)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 2857,
			"arabicnumber": 2857,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত যে, এক সময় মদিনা্য় আতংক ছড়িয়ে পড়লে নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) আমাদের মানদূব নামক ঘোড়াটি চেয়ে নিলেন। পরে তিনি বললেন, ‘আতংকের কোন কারণ তো আমি দেখতে পেলাম না। আমি ঘোড়াটিকে সমুদ্রের মত (দ্রুতগামী) পেয়েছি।’ (২৬২৭) (আধুনিক প্রকাশনীঃ ২৬৪৭, ইসলামিক ফাউন্ডেশনঃ ২৬৫৭)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 2858,
			"arabicnumber": 2858,
			"text": "‘আবদুল্লাহ্ ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-কে বলতে শুনেছি যে, তিনটি জিনিসে অকল্যাণ আছেঃ ঘোড়ায়, নারীতে ও বাড়িতে। (২০৯৯) (আধুনিক প্রকাশনীঃ ২৬৪৮, ইসলামিক ফাউন্ডেশনঃ ২৬৫৮)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 2859,
			"arabicnumber": 2859,
			"text": "সাহল ইবনু সা‘দ সা‘ঈদী (রাঃ) হতে বর্ণিত যে, আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেন, যদি কোন কিছুতে অকল্যাণ থেকে থাকে, তবে তা আছে নারী, ঘোড়া ও বাড়িতে। (৫০৯৫) (মুসলিম ৩৯/৩৪ হাঃ ২২২৬, ) (আধুনিক প্রকাশনীঃ ২৬৪৯, ইসলামিক ফাউন্ডেশনঃ ২৬৫৯)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 2860,
			"arabicnumber": 2860,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত যে, আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেন, ঘোড়া তিন শ্রেণীর লোকের জন্য। একজনের জন্য পুরস্কার; একজনের জন্য আবরণ এবং একজনের জন্য (পাপের) বোঝা। যার জন্য পুরস্কার, সে হলো, ঐ ব্যক্তি যে আল্লাহর রাস্তায় ঘোড়া বেঁধে রাখে এবং রশি কোন চারণভূমি বা বাগানে লম্বা করে দেয়, আর ঘোড়াটি সে চারণভূমি বা বাগানে ঘাস খায়, তবে এর জন্য তার পুণ্য রয়েছে। আর ঘোড়াটি যদি রশি ছিঁড়ে এক বা দু’টি টিলা অতিক্রম করে তাহলেও তার গোবর ও পদক্ষেপ সমূহের বিনিময়ে তার জন্য পুণ্য রয়েছে। এমনকি ঐ ঘোড়া যদি কোন নহরে গিয়ে তা থেকে পানি পান করে, অথচ তার মালিক পানি পান করানোর ইচ্ছা করেনি, তবে এর ফলেও তার জন্য পুণ্য রয়েছে। আর যে ব্যক্তি অহংকার, লৌকিকতা প্রদর্শন এবং মুসলিমদের সঙ্গে শত্রুতা করার জন্য ঘোড়া বেঁধে রাখে তবে তার জন্য তা (পাপের) বোঝা। আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-কে গাধা সম্পর্কে জিজ্ঞেস করা হলে তিনি বলেন, এ সম্পর্কে আমার উপর আর কিছু অবতীর্ণ হয়নি, ব্যাপক অর্থপূর্ণ এই একটি আয়াত ব্যতীত। (আল্লাহর বাণীঃ) কেউ অণু পরিমাণ নেক কাজ করে থাকলে, সে তা দেখতে পাবে; আর কেউ অণু পরিমাণ বদ কাজ করে থাকলে, সে তাও দেখতে পাবে।। (যিলযাল ৭-৮) (২৩৭১) (মুসলিম ১২/৬ হাঃ ৯৮৭, আহমাদ ৭৫৬৬) (আধুনিক প্রকাশনীঃ ২৬৫০, ইসলামিক ফাউন্ডেশনঃ ২৬৬০)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 2861,
			"arabicnumber": 2861,
			"text": "আবুল মুতাওয়াক্কিল নাজী (রহ.) হতে বর্ণিত। তিনি বলেন, আমি জাবির ইবনু আবুদল্লাহ্ আনসারী (রাঃ)-এর নিকট গিয়ে তাকে বললাম, আপনি আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর নিকট হতে যা শুনেছেন, তা থেকে আমার নিকট কিছু বলুন। তখন জাবির (রাঃ) বলেন, আমি আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর কোন এক সফরে তার সঙ্গে ছিলাম। আবূ আকীল বললেন, সেটি কি জিহাদের সফর ছিল, না ‘উমরাহ পালনের, তা আমার জানা নেই। আমরা যখন প্রত্যাবর্তনের জন্য প্রস্তুত হচ্ছিলাম, তখন নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বললেন, তোমাদের মধ্যে যারা পরিজনদের নিকট তাড়াতাড়ি যেতে আগ্রহী, তারা তাড়াতাড়ি যাও। জাবির (রাঃ) বলেন, অতঃপর আমি একটি উটের পিঠে চড়ে বেরিয়ে পড়লাম, সেটির দেহে কোন দাগ ছিল না এবং বর্ণ ছিল লাল-কালো মিশ্রিত। লোকেরা আমার পেছনে পেছনে চলছিল। পথিমধ্যে আমার উটটি ক্লান্ত হয়ে থেমে পড়লে নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) আমাকে বললেন, হে জাবির! তুমি থাম। অতঃপর তিনি চাবুক দিয়ে উটটিকে একটি আঘাত করলেন, আর উটটি হঠাৎ দ্রুত চলতে লাগল। অতঃপর তিনি জিজ্ঞেস করলেন, তুমি কি উটটি বিক্রি করবে? আমি বললাম, হ্যাঁ। অতঃপর মদিনা্য় পৌঁছলে নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) সাহাবীদের একদল সহ মসজিদে প্রবেশ করলেন। আমি আমার উটটিকে মসজিদের বালাত-এর পার্শ্বে বেঁধে রেখে আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর নিকট এগিয়ে গেলাম এবং বললাম, এই আপনার উট। তখন তিনি বেরিয়ে এসে উটটি ঘুরে ঘুরে দেখতে লাগলেন এবং বলতে লাগলেন, হ্যাঁ, উটটিতো আমারই। অতঃপর তিনি কয়েক উকিয়া স্বর্ণসহ এই বলে পাঠালেন যে, এগুলো জাবিরকে দাও। অতঃপর তিনি আমাকে জিজ্ঞেস করলেন, তুমি কি উটের পুরা মূল্য পেয়েছ? আমি বললাম, হ্যাঁ। তিনি বললেন, মূল্য এবং উট তোমারই। (৪৪৩) (আধুনিক প্রকাশনীঃ ২৬৫১, ইসলামিক ফাউন্ডেশনঃ ২৬৬১)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 2862,
			"arabicnumber": 2862,
			"text": "وَقَالَ رَاشِدُ بْنُ سَعْدٍ كَانَ السَّلَفُ يَسْتَحِبُّوْنَ الْفُحُوْلَةَ لِأَنَّهَا أَجْرَى وَأَجْسَرُ রাশিদ ইবনু সা‘দ (রাঃ) বলেন, সাল্ফ সালেহীন তেজী ঘোড়ায় চড়তে ভালবাসতেন। কেননা সেগুলো খুব দ্রুতগামী ও খুব সাহসী। ২৮৬২. ক্বাতাদাহ (রহ.) হতে বর্ণিত। তিনি বলেন, আমি আনাস ইবনু মালিক (রাঃ)-কে বলতে শুনেছি যে, এক সময় মদিনা্তে আতংক দেখা দিলে নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) আবূ ত্বলহার মানদূব নামক ঘোড়াটি চেয়ে নিলেন এবং এর উপর আরোহণ করলেন আর বললেন, আমি কোন আতংক দেখিনি। কিন্তু ঘোড়াটি সমুদ্রের মত গতিশীল পেয়েছি। (২৬২৭) (আধুনিক প্রকাশনীঃ ২৬৫২, ইসলামিক ফাউন্ডেশনঃ ২৬৬২)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 2863,
			"arabicnumber": 2863,
			"text": "(وَقَالَ مَالِكٌ يُسْهَمُ لِلْخَيْلِ وَالْبَرَاذِيْنِ مِنْهَا لِقَوْلِهِ )وَالْخَيْلَ وَالْبِغَالَ وَالْحَمِيْرَ لِتَرْكَبُوْهَا وَلَا يُسْهَمُ لِأَكْثَرَ مِنْ فَرَسٍ ( মালিক (রহ.) বলেন, ঘোড়া ও বিশেষ করে তুর্কী ঘোড়ার গনীমাতে অংশ দেয়া হবে। আল্লাহর বাণীঃ ‘‘তিনি সৃষ্টি করেছেন ঘোড়া, খচ্চর ও গাধা তোমাদের আরোহণের জন্য ও শোভার জন্য।’’ (নাহল ৮) একাধিক ঘোড়া হলে এর কোন অংশ দেয়া হবে না। ২৮৬৩. ইবনু ‘উমার (রাঃ) হতে বর্ণিত যে, আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) গনীমাতের মাল থেকে ঘোড়ার জন্য দু’ অংশ এবং আরোহীর জন্য এক অংশ নির্ধারণ করেছিলেন। (আধুনিক প্রকাশনীঃ ২৬৫৩, ইসলামিক ফাউন্ডেশনঃ ২৬৬৩)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 2864,
			"arabicnumber": 2864,
			"text": "আবূ ইসহাক (রহ.) হতে বর্ণিত যে, এক ব্যক্তি বারা’ ইবনু ‘আযিব (রাঃ)-কে বলল, আপনারা কি হুনায়নের যুদ্ধে আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-কে ময়দানে রেখে পলায়ন করেছিলেন? বারা’ ইবনু ‘আযিব (রাঃ) বলেন, কিন্তু আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) পলায়ন করেননি। হাওয়াযিনরা ছিল সূদক্ষ তীরন্দাজ। আমরা সামনা-সামনি যুদ্ধে তাদের পরাস্ত করলে তারা পালিয়ে যেতে লাগল। তখন মুসলিমরা তাদের পিছু ধাওয়া না করে গনীমাতের মাল সংগ্রহে ব্যস্ত হল। তখন শত্রুরা তীর বর্ষণের মাধ্যমে আমাদের আক্রমণ করে বসল। তবে আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) স্থান ত্যাগ করেননি। আমি তাঁকে তাঁর সাদা খচ্চরটির উপর অটল অবস্থায় দেখেছি। আবূ সুফ্ইয়ান (রাঃ) তাঁর বাহনের লাগাম ধরে টানছেন; আর আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলছেন, ‘আমি মিথ্যা নবী নই, আমি ‘আবদুল মুত্তালিবের বংশধর।’ (২৮৭৪, ২৯৩০, ৩০৪২, ৪৩১৫, ৪৩১৬, ৪৩১৭) (আধুনিক প্রকাশনীঃ ২৬৫৪, ইসলামিক ফাউন্ডেশনঃ ২৬৬৪)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 2865,
			"arabicnumber": 2865,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত যে, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) সাওয়ার হয়ে পা-দানিতে পা রাখার পর উটটি দাঁড়িয়ে গেলে যুল-হুলাইফা মসজিদের নিকট তিনি ইহরাম বেঁধে নিতেন। (১৬৬) (আধুনিক প্রকাশনীঃ ২৬৫৫, ইসলামিক ফাউন্ডেশনঃ ২৬৬৫)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 2866,
			"arabicnumber": 2866,
			"text": "আনাস (রাঃ) হতে বর্ণিত যে, আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) গদিহীন ঘোড়ার পিঠে আরোহণ করে লোকদের সম্মুখে হাজির হলেন; তাঁর কাঁধে ছিল তলোয়ার। (২৬২৭) (আধুনিক প্রকাশনীঃ ২৬৫৬, ইসলামিক ফাউন্ডেশনঃ ২৬৬৬)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 2867,
			"arabicnumber": 2867,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত যে, একবার মদিনা্বাসীগণ আতংকিত হয়ে পড়লে নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) আবূ ত্বলহা (রাঃ)-এর ধীরগতি সম্পন্ন ঘোড়ায় চড়লেন। তিনি ফিরে এসে বললেন, আমি তোমার ঘোড়াটিকে সমুদ্রের মত গতিশীল পেয়েছি। এরপর ঘোড়াটিকে আর কখনো পেছনে ফেলা যেতো না। (২৬২৭) (আধুনিক প্রকাশনীঃ ২৬৫৬, ইসলামিক ফাউন্ডেশনঃ ২৬৬৭)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 2868,
			"arabicnumber": 2868,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) প্রশিক্ষণপ্রাপ্ত অশ্বের জন্য হাফ্য়া থেকে সানিয়্যাতুল বিদা পর্যন্ত এবং প্রশিক্ষণহীন অশ্বের জন্য সানিয়্যা থেকে বানূ যুরায়কের মাসজিদ পর্যন্ত দৌড় প্রতিযোগিতার আয়োজন করেছিলেন। ইবনু ‘উমার (রাঃ) বলেন, আমি উক্ত প্রতিযোগিতার একজন প্রতিযোগী ছিলাম। সুফ্ইয়ান (রহ.) বলেন, হাফ্য়া থেকে সানিয়্যাতুল বিদার দূরত্ব পাঁচ কিংবা ছয় মাইল এবং সানিয়্যা থেকে বানূ যুরায়কের মসজিদের দূরত্ব এক মাইল। (৪২০) (আধুনিক প্রকাশনীঃ ২৬৫৭, ইসলামিক ফাউন্ডেশনঃ ২৬৬৮)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 2869,
			"arabicnumber": 2869,
			"text": "‘আবদুল্লাহ্ (রাঃ) হতে বর্ণিত যে, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) প্রশিক্ষণহীন ঘোড়ার দৌড় প্রতিযোগিতার ব্যবস্থা করেছেন এবং এই দৌড়ের সীমানা ছিল সানিয়্যা থেকে বানু যুরায়কের মাসজিদ পর্যন্ত। ‘আবদুল্লাহ্ ইবনু ‘উমার (রাঃ) এই প্রতিযোগিতায় অংশ নিয়েছিলেন। আবূ ‘আবদুল্লাহ্ (বুখারী (রহ.) বলেন, اَمداً এর অর্থ সীমা। (৪২০) (আধুনিক প্রকাশনীঃ ২৬৫৮, ইসলামিক ফাউন্ডেশনঃ ২৬৬৯)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 2870,
			"arabicnumber": 2870,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত যে, আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) প্রশিক্ষণপ্রাপ্ত ঘোড়ার দৌড় প্রতিযোগিতা করিয়েছেন। এই প্রতিযোগিতা হাফয়া থেকে শুরু হত এবং সানিয়্যাতুল বিদায় শেষ হত। (রাবী আবূ ইসহাক (রহ.) বলেন), আমি মূসা (রাঃ)-কে বললাম, এর দূরত্ব কী পরিমাণ হবে? তিনি বললেন, ছয় বা সাত মাইল। প্রশিক্ষণহীন ঘোড়ার প্রতিযোগিতা শুরু হতো সানিয়্যাতুল বিদা থেকে এবং শেষ হতো বানূ যুরাইকের মসজিদে। আমি বললাম, এর মধ্যে দূরত্ব কত? তিনি বললেন, এক মাইল বা তার তদ্রূপ। ইবনু ‘উমার (রাঃ) এতে প্রতিযোগীদের অন্তর্ভুক্ত ছিলেন। (৪২০) (আধুনিক প্রকাশনীঃ ২৬৫৯, ইসলামিক ফাউন্ডেশনঃ ২৬৭০)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 2871,
			"arabicnumber": 2871,
			"text": "قَالَ ابْنُ عُمَرَ أَرْدَفَ النَّبِيُّ صلى الله عليه وسلم أُسَامَةَ عَلَى الْقَصْوَاءِ وَقَالَ الْمِسْوَرُ قَالَ النَّبِيُّ صلى الله عليه وسلم مَا خَلَاتْ الْقَصْوَاءُ ইবনু ‘উমার (রাঃ) বলেন, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) উসামাকে কাসওয়া নাম্নী উষ্ট্রীর পিঠে তাঁর পিছনে বসান। মিসওয়ার (রহ.) বলেন, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেন, তাঁর উষ্ট্রী কাসওয়া কখনো অবাধ্য হয়নি। ২৮৭১. আনাস (রাযি.) হতে বর্ণিত যে, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর একটি উষ্ট্রী ছিল যেটিকে আযবা বলা হত। (২৮৭২) (আধুনিক প্রকাশনীঃ ২৬৬০, ইসলামিক ফাউন্ডেশনঃ ২৬৭১)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 2872,
			"arabicnumber": 2872,
			"text": "আনাস (রাঃ) হতে বর্ণিত যে, আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর ‘আযবা নামের একটি উষ্ট্রী ছিল। কোন উষ্ট্রী তার আগে যেতে পারত না। হুমাইদ (রহ.) বলেন, কোন উষ্ট্রী তার আগে যেতে সক্ষম হতো না। একদা এক বেদুইন একটি জওয়ান উটে চড়ে আসল এবং আযবা-এর আগে চলে গেল। এতে মুসলিমদের মনে কষ্ট হল। এমনকি নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-ও তা বুঝতে পারলেন। তখন তিনি বললেন, আল্লাহর নিয়ম এই যে, ‘দুনিয়ার সব কিছুরই উত্থানের পর পতন আছে।’ (২৮৭১) (আধুনিক প্রকাশনীঃ ২৬৬১, ইসলামিক ফাউন্ডেশনঃ ২৬৭২)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 2873,
			"arabicnumber": 2873,
			"text": "باب الْـغَزْوِ عَلى الْـحَمِيْـرِ ৫৬/৬০. অধ্যায় : গর্দভের পিঠে সাওয়ার অবস্থায় যুদ্ধ। قَالَهُ أَنَسٌ وَقَالَ أَبُوْ حُمَيْدٍ أَهْدَى مَلِكُ أَيْلَةَ لِلنَّبِيِّ صلى الله عليه وسلم بَغْلَةً بَيْضَاءَ আনাস (রাঃ) তা বর্ণনা করেছেন। আবূ হুমাইদ (রহ.) বলেন, আয়লার শাসক নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-কে একটি সাদা খচ্চর হাদিয়া দিয়েছিলেন ২৮৭৩. আমর ইবনু হারিস (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) তাঁর সাদা খচ্চর, কিছু যুদ্ধ সামগ্রী ও সামান্য ভূমি ছাড়া আর কিছুই রেখে যাননি। এগুলোও তিনি সদাকাহ স্বরূপ ছেড়ে যান। (২৭৩৯) (আধুনিক প্রকাশনীঃ ২৬৬২, ইসলামিক ফাউন্ডেশনঃ ২৬৭৩)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 2874,
			"arabicnumber": 2874,
			"text": "বারা‘ (রাঃ) হতে বর্ণিত যে, কোন এক ব্যক্তি তাঁকে বললেন, হে আবূ ‘উমারাহ্! আপনারা হুনায়নের দিন পলায়ন করেছিলেন? তিনি বললেন, আল্লাহর কসম, না। নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) কখনো পলায়ন করেননি বরং অতি উৎসাহী অগ্রবর্তী কতিপয় ব্যক্তি হাওয়াযিনদের তীর নিক্ষেপের ফলে পালিয়ে ছিলেন। আর নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) তাঁর সাদা খচ্চরটির উপর উপবিষ্ট ছিলেন এবং আবূ সুফ্ইয়ান ইবনু হারিস (রাঃ) এর লাগাম ধরে দাঁড়িয়েছিলেন। তখন নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছিলেন, আমি মিথ্যা নবী নই, আমি ‘আবদুল মুত্তালিবের বংশধর।’ (২৮৬৪) (আধুনিক প্রকাশনীঃ ২৬৬৩, ইসলামিক ফাউন্ডেশনঃ ২৬৭৪)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 2875,
			"arabicnumber": 2875,
			"text": "উম্মুল মুমিনীন ‘আয়িশাহ (রাঃ) হতে বর্ণিত, তিনি বলেনঃ আমি আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর নিকট জিহাদের অনুমতি চাইলে তিনি বলেন, ‘তোমাদের জিহাদ হলো হাজ্জ।’ ‘আবদুল্লাহ ইবনু অলীদ বলেছেন, সুফ্ইয়ান (রাঃ) এ সম্পর্কে আমাদের হাদীস শুনিয়েছেন। (১৫২০) (আধুনিক প্রকাশনীঃ ২৬৬৪, ইসলামিক ফাউন্ডেশনঃ ২৬৭৫)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 2876,
			"arabicnumber": 2876,
			"text": "উম্মুল মুমিনীন ‘আয়িশাহ (রাঃ) হতে বর্ণিত যে, আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর নিকট তাঁর স্ত্রীগণ জিহাদের অনুমতি প্রার্থনা করলে তিনি বললেন, (মহিলাদের জন্য) উত্তম জিহাদ হলো হাজ্জ। (১৫২০) (আধুনিক প্রকাশনীঃ ২৬৬৫, ইসলামিক ফাউন্ডেশনঃ ২৬৭৬)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 2877,
			"arabicnumber": 2877,
			"text": "",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 2879,
			"arabicnumber": 2879,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বাইরে কোথাও যাবার ইচ্ছা করলে তিনি তাঁর স্ত্রীদের মধ্যে করআর মাধ্যমে সিদ্ধান্ত গ্রহণ করতেন এবং এতে যার নাম আসত তাঁকেই নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) সঙ্গে নিয়ে যেতেন। এক যুদ্ধে এভাবে তিনি আমাদের মধ্যে করআর মাধ্যমে সিদ্ধান্ত গ্রহণ করলেন। এতে আমার নাম আসল এবং আমি নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর সঙ্গে বের হলাম। এ ছিল পর্দার আয়াত নাযিল হবার পরবর্তী ঘটনা। (২৫৯৩) (আধুনিক প্রকাশনীঃ ২৬৬৭, ইসলামিক ফাউন্ডেশনঃ ২৬৭৮)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 2880,
			"arabicnumber": 2880,
			"text": "আনাস (রাঃ) হতে বর্ণিত। তিনি বলেন, উহুদের যুদ্ধে সাহাবীগণ নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) থেকে বিচ্ছিন্ন হয়ে পড়লেন। আমি দেখলাম, ‘আয়িশাহ বিন্তে আবূ বাকর ও উম্মু সুলাইম (রাঃ) তাঁদের আঁচল এতটুকু উঠিয়ে নিয়েছেন যে, আমি তাঁদের উভয় পায়ের গহনা দেখছিলাম। তাঁরা উভয়েই মশক পিঠে বয়ে সাহাবীগণের মুখে পানি ঢেলে দিচ্ছিলেন। আবার ফিরে গিয়ে মশ্ক ভর্তি করে নিয়ে এসে সাহাবীগণের মুখে পানি ঢেলে দিচ্ছিলেন। (২৯০২, ৩৮১১, ৪০৬৪) (আধুনিক প্রকাশনীঃ ২৬৬৮, ইসলামিক ফাউন্ডেশনঃ ২৬৭৯)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 2881,
			"arabicnumber": 2881,
			"text": "সা‘লাবাহ ইবনু আবূ মালিক হতে বর্ণিত যে, ‘উমার ইবনুল খাত্তাব (রাঃ) মদিনার কিছু সংখ্যক মহিলার মধ্যে কয়েকখানা (রেশমী) চাদর বণ্টন করেন। অতঃপর একটি ভাল চাদর রয়ে গেল। তাঁর নিকট উপস্থিত একজন তাঁকে বললেন, হে আমীরুল মুমিনীন! এ চাদরটি আপনি আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর নাতনী উম্মু কুলসুম বিন্তে ‘আলী (রাঃ) যিনি আপনার নিকট আছেন, তাকে দিয়ে দিন। ‘উমার (রাঃ) বলেন, উম্মু সালীত (রাঃ) এই চাদরটির অধিক হক্দার। উম্মু সালীত (রাঃ) আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর হাতে বায়‘আতকারিণী আনসার মহিলাদের একজন। ‘উমার (রাঃ) বলেন, কেননা, উম্মু সালীত (রাঃ) উহুদের যুদ্ধে আমাদের নিকট মশক বহন করে নিয়ে আসতেন। আবূ ‘আবদুল্লাহ্ (ইমাম বুখারী) (রহ.) বলেন, تَزْفِرُ অর্থ তিনি সেলাই করতেন। (৪০৭১) (আধুনিক প্রকাশনীঃ ২৬৬৯, ইসলামিক ফাউন্ডেশনঃ ২৬৮০)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 2882,
			"arabicnumber": 2882,
			"text": "রুবাইয়ি‘ বিনতু মআব্বিয (রাঃ) হতে বর্ণিত। তিনি বলেন, ‘আমরা (যুদ্ধের ময়দানে) নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর সঙ্গে থেকে লোকেদের পানি পান করাতাম, আহতদের পরিচর্যা করতাম এবং নিহতদের মদিনা্য় পাঠাতাম।’ (২৮৮৩, ৫৬৭৯) (আধুনিক প্রকাশনীঃ ২৬৭০, ইসলামিক ফাউন্ডেশনঃ ২৬৮১)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 2883,
			"arabicnumber": 2883,
			"text": "রুবাইয়ি‘ বিনতু মু‘আব্বিয (রাঃ) হতে বর্ণিত। তিনি বলেন, ‘আমরা নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর সঙ্গে যুদ্ধে শরীক হয়ে লোকেদের পানি পান করাতাম ও তাদের পরিচর্যা করতাম এবং আহত ও নিহত লোকদের মদিনা্য় ফেরত পাঠাতাম।’ (২৮৮২) (আধুনিক প্রকাশনীঃ ২৬৭১, ইসলামিক ফাউন্ডেশনঃ ২৬২৮)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 2884,
			"arabicnumber": 2884,
			"text": "আবূ মূসা (রাঃ) হতে বর্ণিত। তিনি বলেন, (যুদ্ধে) আবূ ‘আমিরের হাঁটুতে তীর বিদ্ধ হলো, আমি তাঁর নিকট গেলাম। আবূ ‘আমির (রাঃ) বললেন, এই তীরটি বের কর। তখন আমি তীরটি টেনে বের করলাম। ফলে তাত্থেকে পানি প্রবাহিত হতে লাগল। আমি নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর নিকট গেলাম এবং তাঁকে ঘটনাটি জানালাম। আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বললেন, ‘হে আল্লাহ্! আবূ ‘আমির ‘উবায়দকে ক্ষমা করুন।’ (৪৩২৩, ৬৩৮৩) (আধুনিক প্রকাশনীঃ ২৬৭২, ইসলামিক ফাউন্ডেশনঃ ২৬৮৩)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 2885,
			"arabicnumber": 2885,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, (এক রাতে) আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) জেগে কাটান। অতঃপর তিনি যখন মদিনা্য় এলেন এই আকাঙ্ক্ষা প্রকাশ করলেন যে, আমার সাহাবীদের মধ্যে কোন যোগ্য ব্যক্তি যদি রাতে আমার পাহারায় থাকত। এমন সময় আমরা অস্ত্রের শব্দ শুনতে পেলাম। তিনি জিজ্ঞেস করলেন, ইনি কে? ব্যক্তিটি বলল, আমি সা‘দ ইবনু আবূ ওয়াক্কাস, আপনার পাহারার জন্য এসেছি। তখন নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) ঘুমিয়ে গেলেন। (৭২৩১) (মুসলিম ৪৪/৫ হাঃ ২৪১০, আহমাদ ২৫১৪৭) (আধুনিক প্রকাশনীঃ ২৬৭৩, ইসলামিক ফাউন্ডেশনঃ ২৬৮৪)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 2886,
			"arabicnumber": 2886,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত যে, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেন, লাঞ্ছিত হোক দ্বীনার ও দিরহামের গোলাম এবং চাদর ও শালের গোলাম। তাকে দেয়া হলে সন্তুষ্ট হয়, না দেয়া হলে অসন্তুষ্ট হয়। এই হাদীসটির সনদ ইসরাঈল এবং মুহাম্মাদ ইবনু জুহাদা, আবূ হুসাইনের মাধ্যমে আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) পর্যন্ত পৌঁছাননি। (২৮৮৭, ৬৪৩৫) (ইসলামিক ফাউন্ডেশনঃ ২৬৮৫ প্রথমাংশ)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 2887,
			"arabicnumber": 2887,
			"text": "আবূ হুরাইরাহ্ (রাঃ) থেকে আমাদের অতিরিক্ত বর্ণনা করেন যে, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেন, লাঞ্ছিত হোক দ্বীনারের গোলাম, দিরহামের গোলাম এবং শালের গোলাম। তাকে দেয়া হলে সন্তুষ্ট হয়, না দেয়া হলে অসন্তুষ্ট হয়। এরা লাঞ্ছিত হোক, অপমানিত হোক। (তাদের পায়ে) কাঁটা বিদ্ধ হলে তা কেউ তুলে দিবে না। ঐ ব্যক্তির জন্য সুসংবাদ, যে ঘোড়ার লাগাম ধরে জিহাদের জন্য প্রস্তুত রয়েছে, যার মাথার চুল উস্ক খুস্ক এবং পা ধূলি মলিন। তাকে পাহারায় নিয়োজিত করলে পাহারায় থাকে আর (দলের) পেছনে পেছনে রাখলে পেছনেই থাকে। সে কারো সাক্ষাতের অনুমতি চাইলে তাকে অনুমতি দেয়া হয় না এবং কোন বিষয়ে সুপারিশ করলে তার সুপারিশ কবূল করা হয় না। وَقَالَ فَتَعْسًا كَأَنَّهُ يَقُوْلُ فَأَتْعَسَهُمْ اللهُ طُوْبَى فُعْلَى مِنْ كُلِّ شَيْءٍ طَيِّبٍ وَهِيَ يَاءٌ حُوِّلَتْ إِلَى الْوَاوِ وَهِيَ مِنْ يَطِيْبُ فَتَعْسًا বলা হয়فَأَتْعَسَهُمْ اللهُ অর্থাৎ আল্লাহ তাদের অপমানিত করুক। طُوْبَى অর্থ উত্তম। فُعْلَى... এর কাঠামোতে গঠিত। মূলত طيبى ছিল। يَاءٌ কে وَاوِ দ্বারা পরিবর্তন করা হয়েছে। (২৮৮৬) (আধুনিক প্রকাশনীঃ ২৬৭৪, ইসলামিক ফাউন্ডেশনঃ ২৬৮৫ শেষাংশ)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 2888,
			"arabicnumber": 2888,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। তিনি বলেন, এক সফরে আমি জারীর ইবনু ‘আবদুল্লাহ্ (রাঃ)-এর সঙ্গে ছিলাম। তিনি আমার খিদমাত করতেন। যদিও তিনি আনাস (রাঃ)-এর চেয়ে বয়সে বড় ছিলেন। জারীর (রাঃ) বলেন, আমি আন্সারদের এমন কিছু কাজ দেখেছি, যার কারণে তাদের কাউকে পেলেই সম্মান করি। (মুসলিম ৪৪/৪৫ হাঃ ২৫১৩) (আধুনিক প্রকাশনীঃ ২৬৭৫, ইসলামিক ফাউন্ডেশনঃ ২৬৮৬)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 2889,
			"arabicnumber": 2889,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর সঙ্গে খায়বার যুদ্ধে গিয়ে তাঁর খিদমত করছিলাম। যখন নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) সেখান থেকে ফিরলেন এবং উহুদ পর্বত তাঁর দৃষ্টিগোচর হলো, তিনি বললেন, ‘এই পর্বত আমাদের ভালবাসে এবং আমরাও তাকে ভালবাসি।’ অতঃপর তিনি হাত দ্বারা মদিনার দিকে ইঙ্গিত করে বললেন, ‘হে আল্লাহ্! ইব্রাহীম (আঃ) যেমন মক্কাকে হারাম বানিয়েছিলেন, তেমনি আমিও এ দুই কংকরময় ময়দানের মধ্যবর্তী স্থান (মদিনা্)-কে হারাম বলে ঘোষণা করছি। হে আল্লাহ্! আপনি আমাদের সা‘ ও মুদে বরকত দান করুন।’ (৩৭১) (আধুনিক প্রকাশনীঃ ২৬৭৬, ইসলামিক ফাউন্ডেশনঃ ২৬৮৭)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 2890,
			"arabicnumber": 2890,
			"text": "আনাস (রাঃ) হতে বর্ণিত। তিনি বলেন, আমরা এক সফরে আল্লাহর নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর সঙ্গে ছিলাম। আমাদের মধ্যে সেই ব্যক্তির ছায়াই ছিল সর্বাধিক যে তার চাদর দ্বারা ছায়া গ্রহণ করছিল। তাই যারা সিয়াম পালন করছিল তারা কোন কাজই করতে পারছিল না। যারা সিয়াম রত ছিল না, তারা উটের দেখাশুনা করছিল, খিদমতের দায়িত্ব পালন করছিল এবং পরিশ্রমের কাজ করছিল। তখন নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বললেন, ‘যারা সওম পালন করে নি তারাই আজ সাওয়াব নিয়ে গেল।’ (মুসলিম ১৩/১৬ হাঃ ১১১৯) (আধুনিক প্রকাশনীঃ ২৬৭৭, ইসলামিক ফাউন্ডেশনঃ ২৬৮৮)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 2891,
			"arabicnumber": 2891,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত যে, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেন, ‘শরীরের প্রতিটি জোড়ার উপর প্রতিদিন একটি করে সদাকাহ রয়েছে। কোন ব্যক্তিকে তার সাওয়ারীতে উঠার ক্ষেত্রে সাহায্য করা, অথবা তার মাল-সরঞ্জাম তুলে দেয়া সদাকাহ। উত্তম কথা বলা ও সালাতের উদ্দেশ্যে গমনের প্রতিটি পদক্ষেপ সদাকাহ এবং রাস্তা বাতলিয়ে দেয়া সদাকাহ।’ (২৭০৭) (আধুনিক প্রকাশনীঃ ২৬৭৮, ইসলামিক ফাউন্ডেশনঃ ২৬৮৯)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 2892,
			"arabicnumber": 2892,
			"text": "(وَقَوْلِ اللهِ تَعَالَى )يٰٓأَيُّهَا الَّذِيْنَ اٰمَنُوا اصْبِرُوْا وَصَابِرًا وَّرَابِطُوْا وَاتَّقُوا اللهَ لَعَلَّكُمْ تُفْلِحُوْنَ) মহান আল্লাহর বাণীঃ হে যারা ঈমান এনেছ! তোমরা ধৈর্যধারণ কর এবং ধৈর্যধারণে প্রতিযোগিতা কর আর সদা যুদ্ধের জন্য প্রস্তুত থাক। আর আল্লাহকে ভয় কর, তবেই তোমরা সফলকাম হবে। (আলে ইমরান ২০০) ২৮৯২. সাহল ইবনু সা‘দ সায়ি‘দী (রাঃ) হতে বর্ণিত যে, আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেন, ‘আল্লাহর পথে একদিন সীমান্ত প্রহরা দেয়া দুনিয়া ও এর উপর যা কিছু আছে তার চেয়ে উত্তম। জান্নাতে তোমাদের কারো চাবুক পরিমান জায়গা দুনিয়া এবং ভূপৃষ্ঠের সমস্ত কিছুর চেয়ে উত্তম। আল্লাহর পথে বান্দার একটি সকাল বা বিকাল ব্যয় করা দুনিয়া এবং ভূপৃষ্ঠের সব কিছুর চেয়ে উত্তম।’ (২৭৯৪) (আধুনিক প্রকাশনীঃ ২৬৭৯, ইসলামিক ফাউন্ডেশনঃ ২৬৯০)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 2893,
			"arabicnumber": 2893,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত যে, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) আবূ ত্বলহাকে বলেন, তোমাদের ছেলেদের মধ্য থেকে একটি ছেলে খুঁজে আন, যে আমার খেদমত করতে পারে। এমনকি তাকে আমি খায়বারেও নিয়ে যেতে পারি। অতঃপর আবূ ত্বলহা (রাঃ) আমাকে তার সাওয়ারীর পেছনে বসিয়ে নিয়ে চললেন। আমি তখন প্রায় সাবালক। আমি আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর খেদমত করতে লাগলাম। তিনি যখন অবতরণ করতেন, তখন প্রায়ই তাকে এই দু‘আ পড়তে শুনতামঃ ‘হে আল্লাহ! আমি দুশ্চিন্তা ও পেরেশানী থেকে, অক্ষমতা ও অলসতা থেকে, কৃপণতা ও ভীরুতা থেকে, ঋণভার ও লোকজনের প্রাধান্য থেকে আপনার নিকট পানাহ চাচ্ছি।’ পরে আমরা খায়বারে গিয়ে হাজির হলাম। অতঃপর যখন আল্লাহ তা‘আলা তাঁকে দুর্গের উপর বিজয়ী করলেন, তখন তাঁর নিকট সাফিয়্যা বিনতু হুয়াই ইবনু আখতাবের সৌন্দর্যের কথা উল্লেখ করা হলো, তিনি ছিলেন সদ্য বিবাহিতা; তাঁর স্বামীকে হত্যা করা হয়েছিল এবং আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) তাঁকে নিজের জন্য মনোনীত করলেন। অতঃপর তাঁকে নিয়ে রওয়ানা দিলেন। আমরা যখন সাদ্দুস্ সাহ্বা নামক স্থানে পৌঁছলাম তখন সফিয়্যাহ (রাঃ) হায়েয থেকে পবিত্র হন। আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) সেখানে তাঁর সঙ্গে বাসর যাপন করেন। অতঃপর তিনি চামড়ার ছোট দস্তরখানে ‘হায়সা’ প্রস্তুত করে আমাকে আশেপাশের লোকজনকে ডাকার নির্দেশ দিলেন। এই ছিল আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর সঙ্গে সাফিয়্যার বিয়ের ওয়ালিমা। অতঃপর আমরা মদিনার দিকে রওয়ানা দিলাম। আনাস (রাঃ) বলেন, আমি দেখতে পেলাম যে, আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) তাঁর পেছনে চাদর দিয়ে সফিয়্যাহ্কে পর্দা করছেন। উঠানামার প্রয়োজন হলে আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) তাঁর উটের কাছে হাঁটু বাড়িয়ে বসতেন, আর সাফিয়্যা (রাঃ) তাঁর উপর পা রেখে উটে আরোহণ করতেন। এভাবে আমরা মদিনার নিকটবর্তী হলাম। তখন আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) উহুদের দিকে তাকিয়ে বললেন, এটি এমন এক পর্বত যা আমাদের ভালবাসে এবং আমরাও তাকে ভালবাসি। অতঃপর মদিনার দিকে তাকিয়ে বললেন, ‘ হে আল্লাহ, এই কঙ্করময় দু’টি ময়দানের মধ্যবর্তী স্থানকে আমি ‘হারাম’ বলে ঘোষণা করছি, যেমন ইব্রাহীম (আঃ) মক্কাকে ‘হারাম’ ঘোষণা করেছিলেন। হে আল্লাহ্! আপনি তাদের মুদ এবং সা‘তে বরকত দান করুন।’ (৩৭১) (আধুনিক প্রকাশনীঃ ২৬৮০, ইসলামিক ফাউন্ডেশনঃ ২৬৯১)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 2894,
			"arabicnumber": 2894,
			"text": "",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 2896,
			"arabicnumber": 2896,
			"text": "وَقَالَ ابْنُ عَبَّاسٍ أَخْبَرَنِيْ أَبُوْ سُفْيَانَ قَالَ لِيْ قَيْصَرُ سَأَلْتُكَ أَشْرَافُ النَّاسِ اتَّبَعُوْهُ أَمْ ضُعَفَاؤُهُمْ فَزَعَمْتَ ضُعَفَاءَهُمْ وَهُمْ أَتْبَاعُ الرُّسُلِ ইবনু ‘আব্বাস (রাঃ) বলেন যে, আবূ সুফ্ইয়ান (রাঃ) আমার নিকট বর্ণনা করেছেন যে, রোম সম্রাট কায়সার আমাকে বললেন, আমি তোমাকে জিজ্ঞেস করছিলাম তাঁর অনুসরণ করছে প্রভাবশালী ব্যক্তি, না তাদের মধ্যে দুর্বলরা? তুমি বলছ যে, তাদের মধ্যকার দুর্বলরা-এরাই রাসূলদের অনুসারী হয়। ২৮৯৬. মুস‘আব ইবনু সা‘দ (রাঃ) হতে বর্ণিত। তিনি বলেন সা‘দ (রাঃ)-এর ধারণা ছিল অন্যদের চেয়ে তাঁর মর্যাদা অধিক। তখন নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বললেন, ‘তোমরা দুর্বলদের (দু‘আয়) ওয়াসীলায়ই সাহায্য প্রাপ্ত ও রিয্ক প্রাপ্ত হচ্ছ।’ (৩৫৯৪, ৩৬৪৯) (আধুনিক প্রকাশনীঃ ২৬৮২, ইসলামিক ফাউন্ডেশনঃ ২৬৯৩)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 2897,
			"arabicnumber": 2897,
			"text": "আবূ সা‘ঈদ (রাঃ) হতে বর্ণিত যে, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেন, ‘এমন এক সময় আসবে যখন একদল লোক আল্লাহর পথে জিহাদ করবে। তাদেরকে জিজ্ঞেস করা হবে, তোমাদের সঙ্গে কি নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর সাহাবীদের কেউ আছেন? বলা হবে, হ্যাঁ। অতঃপর (তাঁর বরকতে) বিজয় দান করা হবে। অতঃপর এমন এক সময় আসবে, যখন জিজ্ঞেস করা হবে, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর সাহাবীদের সহচরদের মধ্যে কেউ কি তোমাদের মধ্যে আছেন? বলা হবে, হ্যাঁ, অতঃপর তাদের বিজয় দান করা হবে। অতঃপর এক যুগ এমন আসবে যে, জিজ্ঞেস করা হবে, তোমাদের মধ্যে কি এমন কেউ আছেন, যিনি নবী(সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর সাহাবীদের সহচরদের সাহচর্য লাভ করেছে, (তাবি-তাবিঈন)? বলা হবে, হ্যাঁ। তখন তাদেরও বিজয় দান করা হবে।’ (৩৫৯৪, ৩৬৪৯) (মুসলিম ৪৪/৫২ হাঃ ২৫৩২, আহমাদ ১১০৪১) (আধুনিক প্রকাশনীঃ ২৬৮৩, ইসলামিক ফাউন্ডেশনঃ ২৬৯৪)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 2898,
			"arabicnumber": 2898,
			"text": "قَالَ أَبُوْ هُرَيْرَةَ عَنْ النَّبِيِّ صلى الله عليه وسلم اللهُ أَعْلَمُ بِمَنْ يُجَاهِدُ فِيْ سَبِيْلِهِ وَاللهُ أَعْلَمُ بِمَنْ يُكْلَمُ فِيْ سَبِيْلِهِ আবূ হুরাইরাহ্ (রাঃ) বলেন, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেন, আল্লাহর পথে কে জিহাদ করছে, তা তিনিই ভাল জানেন এবং কে তাঁর পথে আহত হয়েছে আল্লাহ্ই অধিক অবগত আছেন। ২৮৯৮. সাহল ইবনু সা‘দ সা‘ঈদী (রাঃ) হতে বর্ণিত যে, একবার আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) ও মুশ্রিকদের মধ্যে মুকাবিলা হয় এবং উভয়পক্ষ ভীষণ যুদ্ধ লিপ্ত হয়। অতঃপর আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) নিজ সৈন্যদলের নিকট ফিরে এলেন, মুশ্রিকরাও নিজ সৈন্যদলে ফিরে গেল। সেই যুদ্ধে আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর সঙ্গীদের মধ্যে এমন এক ব্যক্তি ছিল, যে কোন মুশরিককে একাকী দেখলেই তার পশ্চাতে ছুটত এবং তাকে তলোয়ার দিয়ে আক্রমণ করত। বর্ণনাকারী (সাহল ইবনু সা‘দ (রাঃ) বলেন, আজ আমাদের কেউ অমুকের মত যুদ্ধ করতে পারেনি। তা শুনে আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বললেন, সে তো জাহান্নামের অধিবাসী হবে। একজন সাহাবী বলে উঠলেন, আমি তার সঙ্গী হব। অতঃপর তিনি তার সঙ্গে বেরিয়ে পড়লেন, সে দাঁড়ালে তিনিও দাঁড়াতেন এবং সে শীঘ্র চললে তিনিও দ্রুত চলতেন। তিনি বললেন, এক সময় সে মারাত্মকভাবে আহত হলো এবং সে দ্রুত মৃত্যু কামনা করতে লাগল। এক সময় তলোয়ারের বাঁট মাটিতে রাখল এবং এর তীক্ষ্ণ দিক বুকে চেপে ধরে তার উপর ঝাঁপিয়ে পড়ে আত্মহত্যা করল। অনুসরণকারী ব্যক্তিটি আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর নিকট আসলেন এবং বললেন, আমি সাক্ষ্য দিচ্ছি যে, আপনি আল্লাহর রাসূল। আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বললেন, কী ব্যাপার? তিনি বললেন, যে ব্যক্তিটি সম্পর্কে আপনি কিছুক্ষণ আগেই বলেছিলেন যে, সে জাহান্নামী হবে, তা শুনে সাহাবীগণ বিষয়টিকে অস্বাভাবিক মনে করলেন। আমি তাদের বললাম যে, আমি ব্যক্তিটির সম্পর্কে খবর তোমাদের জানাব। অতঃপর আমি তার পিছু পিছু বের হলাম। এক সময় লোকটি মারাত্মকভাবে আহত হয় এবং সে শীঘ্র মৃত্যু কামনা করতে থাকে। অতঃপর তার তলোয়ারের বাট মাটিতে রেখে এর তীক্ষ্ণধার বুকে চেপে ধরল এবং তার উপরে ঝাঁপিয়ে পড়ে আত্মহত্যা করল। আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) তখন বললেন, ‘মানুষের বাহ্যিক বিচারে অনেক সময় কোন ব্যক্তি জান্নাতবাসীর মত ‘আমল করতে থাকে, আসলে সে জাহান্নামী হয় এবং তেমনি মানুষের বাহ্যিক বিচারে কোন ব্যক্তি জাহান্নামীর মত ‘আমল করলেও প্রকৃতপক্ষে সে জান্নাতী হয়।’ (৪২০৩, ৪২০৭, ৬৪৯৩, ৬৬০৭) (মুসলিম ১/৪৭ হাঃ ১১২, আহমাদ ২২৮৯৮) (আধুনিক প্রকাশনীঃ ২৬৮৪, ইসলামিক ফাউন্ডেশনঃ ২৬৯৫)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 2899,
			"arabicnumber": 2899,
			"text": "(وَقَوْلِ اللهِ تَعَالَى )وَأَعِدُّوْا لَهُمْ مَا اسْتَطَعْتُمْ مِّنْ قُوَّةٍ وَّمِنْ رِّبَاطِ الْخَيْلِ تُرْهِبُوْنَ بِهِ عَدُوَّ اللهِ وَعَدُوَّكُمْ( আল্লাহ্ তা‘আলার বাণীঃ ‘‘তোমরা প্রস্তুত রাখবে তাদের সাথে যুদ্ধের জন্য যা কিছু তোমাদের মধ্যে আছে অস্ত্রাদি ও অশ্ববাহিনী থেকে, এসব দিয়ে তোমরা ভীত-সন্ত্রস্ত করবে আল্লাহর শত্রুকে এবং তোমাদের শত্রুকে।’’ (আনফাল ৬০) ২৮৯৯. সালামাহ ইবনু আকওয়া‘ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) আসলাম গোত্রের একদল লোকের পাশ দিয়ে যাচ্ছিলেন। তারা তীরন্দাজি চর্চা করছিল। নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বললেন, হে বানূ ইসমাঈল! তোমরা তীর নিক্ষেপ করতে থাক। কেননা তোমাদের পূর্বপুরুষ দক্ষ তীরন্দাজ ছিলেন এবং আমি অমুক গোত্রের সঙ্গে আছি। রাবী বলেন, এ কথা শুনে দু’দলের এক দল তীর নিক্ষেপ বন্ধ করে দিল। আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বললেন, তোমাদের কী হলো যে, তোমরা তীর নিক্ষেপ করছ না? তারা জবাব দিল, আমরা কিভাবে তীর নিক্ষেপ করতে পারি, অথচ আপনি তাদের সঙ্গে আছেন? নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বললেন, তোমরা তীর নিক্ষেপ করতে থাক, আমি তোমাদের সকলের সঙ্গে আছি। (৩৩৭৩, ৩৫০৭) (আধুনিক প্রকাশনীঃ ২৬৮৫, ইসলামিক ফাউন্ডেশনঃ ২৬৯৬)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 2900,
			"arabicnumber": 2900,
			"text": "আবূ উসাইদ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বাদারের দিন বলেছেন, আমরা যখন কুরাইশদের বিপক্ষে সারিবদ্ধ হয়েছিলাম এবং কুরাইশরা আমাদের বিপক্ষে সারিবদ্ধ হয়েছিল, তখন নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) আমাদের বললেন, যখন তারা তোমাদের নিকটবর্তী হবে, তখন তোমরা তীর চালনা করবে। আবূ আব্দুল্লাহ (রহ.) বলেন, أَكْثَبُوكُمْ এর অর্থ যখন অধিক সংখ্যক সমবেত হয়। (৩৯৮৪, ৩৯৮৫) (আধুনিক প্রকাশনীঃ ২৬৮৬, ইসলামিক ফাউন্ডেশনঃ ২৬৯৭)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 2901,
			"arabicnumber": 2901,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, একবার একদল হাব্শী নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর নিকট বর্শা নিয়ে খেলা করছিলেন। এমন সময় ‘উমার (রাঃ) সেখানে এলেন এবং হাতে কাঁকর তুলে নিয়ে তাদের দিকে নিক্ষেপ করলেন। তখন আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বললেন, হে ‘উমার! তাদের করতে দাও। আলী......মা‘মার (রহ.) সূত্রে অতিরিক্ত বর্ণনা করেন, (এ ঘটনা) মসজিদে ঘটেছিল। (মুসলিম ৮/৪ হাঃ ৮৯৩, আহমাদ ৮০৮৬) (আধুনিক প্রকাশনীঃ ২৬৮৭, ইসলামিক ফাউন্ডেশনঃ ২৬৯৮)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 2902,
			"arabicnumber": 2902,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। তিনি বলেন, আবূ তাল্হা (রাঃ) নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর সঙ্গে একই ঢাল ব্যবহার করেছেন। আর আবূ ত্বলহা (রাঃ) ছিলেন একজন ভাল তীরন্দাজ। তিনি যখন তীর ছুঁড়তেন, তখন নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) মাথা উঁচু করে তীর যে স্থানে পড়ত তা নযর রাখতেন। (২৮৮০) (আধুনিক প্রকাশনীঃ ২৬৮৮, ইসলামিক ফাউন্ডেশনঃ ২৬৯৯)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 2903,
			"arabicnumber": 2903,
			"text": "সাহল ইবনু সা‘দ (রাঃ) হতে বর্ণিত। তিনি বলেন, যুদ্ধের ময়দানে যখন নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর মাথার শিরস্ত্রাণ ভেঙ্গে গেল ও তাঁর মুখমন্ডল রক্তে ভিজে গেল এবং তাঁর সামনের দাঁত ভেঙ্গে গেল, তখন ‘আলী (রাঃ) ঢালে ভরে ভরে পানি আনতেন এবং ফাতিমাহ (রাঃ) ক্ষতস্থান ধুয়ে দিচ্ছিলেন। যখন ফাতিমাহ (রাঃ) দেখলেন যে, পানির চেয়ে রক্ত পড়া আরো বৃদ্ধি পাচ্ছে, তখন একখানা চাটাই নিয়ে তা পোড়ালেন এবং তার ছাই ক্ষতস্থানে লাগিয়ে দিলেন, তাতে রক্ত বন্ধ হয়ে গেল। (২৪৩) (আধুনিক প্রকাশনীঃ ২৬৮৯, ইসলামিক ফাউন্ডেশনঃ ২৭০০)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 2904,
			"arabicnumber": 2904,
			"text": "‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, বনূ নযীরের সম্পদ আল্লাহ তা‘আলা তাঁর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-কে ‘ফায়’ হিসেবে দান করেছিলেন। এতে মুসলিমগণ অশ্ব বা সাওয়ারী চালনা করেনি। এ কারণে তা আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর জন্য নির্দিষ্ট ছিল। এ সম্পদ থেকে নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) তাঁর পরিবারকে এক বছরের খরচ দিয়ে দিতেন এবং বাকী আল্লাহর রাস্তায় জিহাদের প্রস্তুতির জন্য হাতিয়ার ও ঘোড়া ইত্যাদিতে ব্যয় করতেন। (৩০৯৪, ৪০৩৩, ৪৮৮৫, ৫৩৫৭, ৫৩৫৮, ৬৭২৮, ৭৩০৫) (মুসলিম ৩২/১৫ হাঃ ১৭৫৭) (আধুনিক প্রকাশনীঃ ২৬৯০, ইসলামিক ফাউন্ডেশনঃ ২৭০১)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 2905,
			"arabicnumber": 2905,
			"text": "‘আলী (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-কে সা‘দ (রাঃ) ব্যতীত আর কারো জন্যও তাঁর পিতা-মাতাকে উৎসর্গ করার কথা বলতে দেখিনি। আমি তাঁকে বলতে শুনেছি, ‘তুমি তীর নিক্ষেপ কর, তোমার জন্য আমার পিতা-মাতা উৎসর্গ (ফিদা) হোক।’ (৪০৫৮, ৪০৫৯, ৬১৮৪) (মুসলিম ৪৪/৫ হাঃ ২৪১১, আহমাদ ১১৪৭) (আধুনিক প্রকাশনীঃ ২৬৯১, ইসলামিক ফাউন্ডেশনঃ ২৭০২)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 2907,
			"arabicnumber": 2907,
			"text": "",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 2908,
			"arabicnumber": 2908,
			"text": "আনাস (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) সকল লোকের চেয়ে সুশ্রী ও সাহসী ছিলেন। এক রাতে মদিনার লোকেরা ভীত হয়ে শব্দের দিকে বের হলো। তখন নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) তাঁদের সামনে এলেন এমন অবস্থায় যে, তিনি শব্দের কারণ অন্বেষণ করে ফেলেছেন। তিনি আবূ ত্বলহার জিনবিহীন ঘোড়ার পিঠে সাওয়ার ছিলেন এবং তাঁর কাঁধে তরবারি ছিল। তিনি বলছিলেন, তোমরা ভীত হয়ো না। অতঃপর তিনি বললেন, আমি ঘোড়াটিকে সমুদ্রের মত গতিশীল পেয়েছি, অথবা তিনি বললেন, এটি সমুদ্র। (২৬২৭) (মুসলিম ৪৩/১১ হাঃ ২৩০৭, আহমাদ ১২৭৪৪) (আধুনিক প্রকাশনীঃ ২৬৯৩, ইসলামিক ফাউন্ডেশনঃ ২৭০৪)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 2909,
			"arabicnumber": 2909,
			"text": "আবূ উমামাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, এই সব বিজয় এমন সব লোকদের দ্বারা অর্জিত হয়েছিল, যাদের তলোয়ার স্বর্ণ বা রৌপ্য খচিত ছিল না, বরং তাদের তলোয়ার ছিল উটের গর্দানের চামড়া এবং লৌহ কারুকার্য খচিত। (আধুনিক প্রকাশনীঃ ২৬৯৪, ইসলামিক ফাউন্ডেশনঃ ২৭০৫)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 2910,
			"arabicnumber": 2910,
			"text": "জাবির ইবনু ‘আবদুল্লাহ্ (রাঃ) হতে বর্ণিত আছে যে, তিনি নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর সঙ্গে নাজদের দিকে কোন এক যুদ্ধে বের হয়েছিলেন। নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) ফিরে আসলে তিনিও তাঁর সঙ্গে ফিরে আসলেন। তারা যখন কণ্টকময় বৃক্ষরাজীতে আবৃত এক উপত্যকায় উপস্থিত হলেন তখন তাঁদের দিবা বিশ্রামের সময় এলো। আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) সেখানে অবতরণ করেন। লোকেরা ছায়ার আশ্রয়ে বিক্ষিপ্ত হয়ে পড়ল। আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) একটি বাবলা গাছের নীচে অবতরণ করলেন এবং তাতে তাঁর তরবারী ঝুলিয়ে রাখলেন। অতঃপর আমরা সকলেই ঘুমিয়ে পড়লাম। হঠাৎ এক সময় আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) আমাদের ডাকতে লাগলেন। দেখলাম তাঁর পার্শ্বে একজন গ্রাম্য আরব। তিনি বললেন, আমার নিদ্রাবস্থায় এই ব্যক্তি আমারই তরবারী আমারই উপর বের করে ধরেছে। জেগে উঠে দেখতে পেলাম যে, তার হাতে খোলা তরবারী। সে বলল, আমার থেকে তোমাকে কে রক্ষা করবে, আমি বললাম, আল্লাহ! আল্লাহ! তিনবার। তারপরও তিনি কোন প্রতিশোধ নেননি, অথচ সে সেখানে বসে আছে। (২৯১৩, ৪১৩৪, ৪১৩৫, ৪১৩৬, ৪১৩৯) (আধুনিক প্রকাশনীঃ ২৬৯৫, ইসলামিক ফাউন্ডেশনঃ ২৭০৬)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 2911,
			"arabicnumber": 2911,
			"text": "সাহল (রাঃ) হতে বর্ণিত যে, তাকে উহুদের দিনে আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর আঘাত সম্পর্কে জিজ্ঞেস করা হলো। তিনি বললেন, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর মুখমন্ডল আহত হল এবং তাঁর সামনের দু’টি দাঁত ভেঙ্গে গেল, তাঁর মাথার শিরস্ত্রান ভেঙ্গে গেল। ফাতেমাহ (আঃ) রক্ত ধুচ্ছিলেন আর ‘আলী (রাঃ) পানি ঢেলে দিচ্ছিলেন। তিনি যখন দেখতে পেলেন যে, রক্ত পড়া বাড়ছেই, তখন একটি চাটাই নিয়ে তা পুড়িয়ে ছাই করলেন এবং তা ক্ষতস্থানে লাগিয়ে দিলেন। অতঃপর রক্ত পড়া বন্ধ হল। (২৪৩) (মুসলিম ৩২/৩৭ হাঃ ১৭৯০) (আধুনিক প্রকাশনীঃ ২৬৯৬, ইসলামিক ফাউন্ডেশনঃ ২৭০৭)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 2912,
			"arabicnumber": 2912,
			"text": "‘আমর ইবনু হারিস (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) কিছুই রেখে যাননি, কেবল তাঁর অস্ত্র, একটি সাদা খচ্চর ও এক টুকরো জমি, যা সদাকাহ করে গিয়েছিলেন। (২৭৩৯) (আধুনিক প্রকাশনীঃ ২৬৯৭, ইসলামিক ফাউন্ডেশনঃ ২৭০৮)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 2913,
			"arabicnumber": 2913,
			"text": "জাবির ইবনু ‘আবদুল্লাহ্ (রাঃ) হতে বর্ণিত যে, তিনি আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর সঙ্গে একটি যুদ্ধে শরীক হয়েছিলেন। তাদের দুপুরের বিশ্রামের সময় হল এমন একটি উপত্যকায় যাতে কাঁটাদার প্রচুর বৃক্ষ ছিল। লোকেরা কাঁটাদার বৃক্ষরাজির ছায়ায় বিক্ষিপ্তভাবে ছড়িয়ে পড়ল। আর নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)একটি বৃক্ষের নীচে অবতরণ করেন এবং একটি বৃক্ষে তাঁর তরবারি ঝুলিয়ে সেখানে ঘুমিয়ে পড়েন। তিনি জেগে উঠলেন এবং হঠাৎ তাঁর পার্শ্বে দেখতে পেলেন যে, জনৈক ব্যক্তি, অথচ তিনি তার ব্যাপারে টের পাননি। তখন নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বললেন, এই ব্যক্তিটি হঠাৎ আমার তরবারীটি উঁচিয়ে বলল, কে তোমাকে আমার হাত থেকে রক্ষা করবে? আমি বললাম, আল্লাহ্! তখন সে ব্যক্তি তলোয়ারটি খাপে রেখে দিল। আর এই সে ব্যক্তি, এখনো বসা, কিন্তু তিনি তার প্রতিশোধ নেননি। (২৯১০) (আধুনিক প্রকাশনীঃ ২৬৯৮, ইসলামিক ফাউন্ডেশনঃ ২৭০৯)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 2914,
			"arabicnumber": 2914,
			"text": "وَيُذْكَرُ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صلى الله عليه وسلم جُعِلَ رِزْقِيْ تَحْتَ ظِلِّ رُمْحِيْ وَجُعِلَ الذِّلَّةُ وَالصَّغَارُ عَلَى مَنْ خَالَفَ أَمْرِي ইবনু ‘উমার (রাঃ) সূত্রে নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) থেকে উল্লেখ রয়েছে যে, তীরের ছায়ার নীচে আমার রিয্ক রাখা হয়েছে। যে ব্যক্তি আমার নির্দেশের বিরোধিতা করে, তার জন্য অপমান ও লাঞ্ছনা নির্ধারিত আছে। ২৯১৪. আবূ ক্বাতাদাহ (রাঃ) হতে বর্ণিত আছে যে, একবার তিনি আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর সঙ্গে ছিলেন। মক্কার পথে কোন এক স্থানে পৌঁছার পর আবূ ক্বাতাদাহ (রাঃ) কয়েকজন সঙ্গীসহ তাঁর পেছনে রয়ে গেলেন। সঙ্গীরা ছিলেন ইহরাম অবস্থায় আর তিনি ছিলেন ইহরাম বিহীন। এ সময় তিনি একটি বুনো গাধা দেখতে পান এবং তাঁর ঘোড়ার পিঠে আরোহণ করেন। তিনি তাঁর সঙ্গীদের তাঁর চাবুকটি উঠিয়ে দিতে বলেন; কিন্তু তারা তা দিতে অস্বীকার করলেন। আবার তিনি তাঁর বর্শাটি উঠিয়ে দিতে বলেন। তারা তাও দিতে অস্বীকার করলেন। তখন তিনি নিজেই তা উঠিয়ে নিলেন। অতঃপর গাধাটির উপর আক্রমণ চালালেন এবং তাকে হত্যা করলেন। সাথীরা কেউ কেউ এর গোশ্ত খেলেন এবং কেউ কেউ তা খেতে অস্বীকার করলেন। অতঃপর তারা আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর নিকট গিয়ে এ সম্পর্কে তাঁর নিকট জিজ্ঞেস করলেন। তিনি বললেন, এটি একটি আহারের বস্তু, যা আল্লাহ্ তা‘আলা তোমাদের আহারের জন্য দিয়েছেন। যায়িদ ইবনু আসলাম (রহ.) আবূ ক্বাতাদাহ (রাঃ) থেকে আবূ নাযর (রাঃ)-এর মতই বুনো গাধা সম্পর্কে হাদীস বর্ণনা করেছেন। এতে আছে, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) জিজ্ঞেস করলেন, তোমাদের সঙ্গে তার কিছু গোশ্ত আছে কি? (১৮২১) (আধুনিক প্রকাশনীঃ ২৬৯৯, ইসলামিক ফাউন্ডেশনঃ ২৭১০)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 2915,
			"arabicnumber": 2915,
			"text": "وَقَالَ النَّبِيُّ صلى الله عليه وسلم أَمَّا خَالِدٌ فَقَدْ احْتَبَسَ أَدْرَاعَهُ فِيْ سَبِيْلِ اللهِ নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেন, খালিদ (ইবনু ওয়ালিদ) তো তাঁর বর্মগুলো আল্লাহর পথে ওয়াকফ করে দিয়েছে। ২৯১৫. ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বাদারের দিন একটি গুম্বজওয়ালা তাঁবুতে অবস্থান কালে দু‘আ করছিলেন, হে আল্লাহ্! আমি আপনার প্রতিজ্ঞা ও ওয়াদার দোহাই দিয়ে বলছি, আপনি যদি চান, তাহলে আজকের পরে আর আপনার ইবাদাত করা হবে না।’ এ সময় আবূ বাকর (রাঃ) তাঁর হাত ধরে বললেন, হে আল্লাহর রাসূল! যথেষ্ট হয়েছে। আপনি বার বার নত হয়ে আপনার প্রতিপালকের কাছে দু‘আ করেছেন।’ সে সময় নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বর্ম আচ্ছাদিত ছিলেন। অতঃপর তিনি এই আয়াত পাঠ করতে করতে বেরিয়ে এলেনঃ শীঘ্রই দুশমনরা পরাস্ত হবে এবং পৃষ্ঠপ্রদর্শন করবে তদুপরি কিয়ামত শাস্তির নির্ধারিত কাল এবং কিয়ামত হবে অধিক কঠিন ও অধিক তিক্ত। (সূরা আল-ক্বামার ৪৫, ৪৬) ওহাইব (রহ.) বলেন, খালিদ (রহ.) বলেছেন, ‘বাদারের দিন’। (৩৯৫৩, ৪৮৭৫, ৪৮৭৭) (আধুনিক প্রকাশনীঃ ২৭০০, ইসলামিক ফাউন্ডেশনঃ ২৭১১)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 2916,
			"arabicnumber": 2916,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর মৃত্যুর সময় তাঁর বর্মটি ত্রিশ সা’ যব-এর বিনিময়ে এক ইয়াহূদীর নিকট বন্ধক ছিল। মুআল্লাহ ‘আবদুল ওয়াহিদ (রহ.) সূত্রে আ‘মাশ (রাঃ) থেকে বর্ণনা করেন, তিনি বলেছেন যে, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) তাঁর লোহার বর্ম বন্ধক রেখেছিলেন। আর ইয়ালা (রহ.) আ‘মাশ (রাঃ) থেকে বর্ণনা করেন যে, বর্মটি ছিল লোহার। (২০৬৮) (আধুনিক প্রকাশনীঃ ২৭০১, ইসলামিক ফাউন্ডেশনঃ ২৭১২)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 2917,
			"arabicnumber": 2917,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, কৃপণ ও দানশীল ব্যক্তির উদাহরণ এমন দু’ ব্যক্তির মত, যারা লৌহ বর্মে আচ্ছাদিত। বর্ম দু’টি এত আঁটসাঁট যে, তাদের উভয়ের হাত কব্জায় আবদ্ধ রয়েছে। দানশীল ব্যক্তি যখন দান করতে ইচ্ছা করে, তখন বর্মটি তার দেহের উপর প্রসারিত হয়, এমনকি তা তার পায়ের চিহ্ন মুছে ফেলে। আর কৃপণ ব্যক্তি যখন দান করতে ইচ্ছা করে তখন বর্মের কড়াগুলো পরস্পর গলে গিয়ে তার শরীরকে আঁকড়ে ধরে এবং তার উভয় হস্ত কন্ঠের সঙ্গে লেগে যায়। অতঃপর আবূ হুরাইরাহ্ (রাঃ) বলেন, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছেন, সে হাত দু’টিকে প্রসারিত করতে যথাসাধ্য চেষ্টা করে; কিন্তু প্রসারিত করতে পারে না। (১৪৪৩) (আধুনিক প্রকাশনীঃ ২৭০২, ইসলামিক ফাউন্ডেশনঃ ২৭১৩)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 2918,
			"arabicnumber": 2918,
			"text": "মুগীরাহ ইবনু শু‘বা হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একদা হাজত পূরণের জন্য গেলেন। সেখান থেকে ফিরে এলে আমি তাঁর নিকট পানি নিয়ে গেলাম। তিনি তা দিয়ে উযু করেন। তাঁর পরিধানে ছিল সিরীয় জোববা। তিনি কুলি করেন, নাকে পানি দেন ও মুখমন্ডল ধৌত করেন। অতঃপর তিনি জামার আস্তিন গুটিয়ে দু’টি হাত বের করতে চাইলেন। কিন্তু আস্তিন দু’টি ছিল খুবই আঁটসাঁট। তাই তিনি ভেতরের দিক থেকে হাত বের করে উভয় হাত ধুলেন এবং মাথা মসেহ করলেন এবং উভয় মোজার উপর মাস্হ করলেন। (১৮২) (আধুনিক প্রকাশনীঃ ২৭০৩, ইসলামিক ফাউন্ডেশনঃ ২৭১৪)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 2919,
			"arabicnumber": 2919,
			"text": "আনাস (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ‘আবদুর রাহমান ইবনু আওফ (রাঃ) ও যুবায়র (রাঃ)-কে তাদের শরীরে চুলকানি থাকায় রেশমী জামা পরিধান করতে অনুমতি দিয়েছিলেন। (২৯২০, ২৯২১, ২৯২২, ৫৮৩৯) (মুসলিম ৩৭/৩ হাঃ ২০৭৬, আহমাদ ১২৮৬৩) (আধুনিক প্রকাশনীঃ ২৭০৪, ইসলামিক ফাউন্ডেশনঃ ২৭১৫)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 2920,
			"arabicnumber": 2920,
			"text": "আনাস (রাঃ) হতে বর্ণিত যে, ‘আবদুর রহমান ও যুবায়র (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট উকুনের অভিযোগ করলে তিনি তাদেরকে রেশমী পোষাক পরার অনুমতি দেন। আনাস (রাঃ) বলেন, আমি যুদ্ধে তাদের দেহে তা দেখেছি। (২৯১৯) (আধুনিক প্রকাশনীঃ ২৭০৫, ইসলামিক ফাউন্ডেশনঃ ২৭১৬)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 2921,
			"arabicnumber": 2921,
			"text": "আনাস (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ‘আবদুর রাহমান ইবনু আওফ ও যুবায়র ইবনুল আওয়ামকে রেশমী পোষাক পরার অনুমতি দেন। (২৯১৯) (আধুনিক প্রকাশনীঃ ২৭০৬, ইসলামিক ফাউন্ডেশনঃ ২৭১৭)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 2922,
			"arabicnumber": 2922,
			"text": "আনাস (রাঃ) হতে বর্ণিত যে, শরীরে চুলকানী থাকার কারণে তাদের দু’জনকে (আবদুর রাহমান ও যুবায়রকে) রেশমী পোষাক পরার অনুমতি দিয়েছিলেন বা দেয়া হয়েছিল। (২৯১৯) (আধুনিক প্রকাশনীঃ ২৭০৭, ইসলামিক ফাউন্ডেশনঃ ২৭১৮)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 2923,
			"arabicnumber": 2923,
			"text": "‘আমর ইবনু উমায়্যাহ যামরী (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে (বকরির) হাত থেকে কেটে কেটে খেতে দেখেছি। অতঃপর তাঁকে সালাতের জন্য ডাকা হলে তিনি সালাত আদায় করলেন; কিন্তু তিনি উযু করলেন না। আবুল ইয়ামান (রহ.) শুয়াইব সূত্রে যুহরী (রহ.) থেকে অতিরিক্ত বর্ণনা করেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ছুরি রেখে দিলেন। (২০৮) (আধুনিক প্রকাশনীঃ ২৭০৮, ইসলামিক ফাউন্ডেশনঃ ২৭১৯)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 2924,
			"arabicnumber": 2924,
			"text": "‘উমাইর ইবনু আসওয়াদ আনসী হতে বর্ণিত যে, তিনি ‘উবাদাহ ইবনু সামিত (রাঃ)-এর নিকট আসলেন। তখন ‘উবাদাহ (রাঃ) হিম্স উপকূলে তাঁর একটি ঘরে অবস্থান করছিলেন এবং তার সঙ্গে ছিলেন উম্মু হারাম। ‘উমাইর (রহ.) বলেন, উম্মু হারাম (রাঃ) আমাদের নিকট বর্ণনা করেন, তিনি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছেন যে, আমার উম্মাতের মধ্যে প্রথম যে দলটি নৌ যুদ্ধে অংশ গ্রহণ করবে তারা যেন জান্নাত অবধারিত করে ফেলল। উম্মু হারাম (রাঃ) বলেন, আমি কি তাদের মধ্যে হবো? তিনি বললেন, তুমি তাদের মধ্যে হবে। উম্মু হারাম (রাঃ) বলেন, হে আল্লাহর রাসূল! অতঃপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আমার উম্মাতের প্রথম যে দলটি কায়সার-এর রাজধানী আক্রমণ করবে, তারা ক্ষমাপ্রাপ্ত। অতঃপর আমি বললাম, ‘হে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম! আমি কি তাদের মধ্যে হবো?’ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, ‘না।’ (২৭৮৯) (আধুনিক প্রকাশনীঃ ২৭০৯, ইসলামিক ফাউন্ডেশনঃ ২৭২০)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 2925,
			"arabicnumber": 2925,
			"text": "‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমরা ইয়াহূদীদের বিরুদ্ধে যুদ্ধ করবে। এমনকি তাদের কেউ যদি পাথরের আড়ালে লুকিয়ে থাকে তাহলে পাথরও বলবে, ‘হে আল্লাহর বান্দা, আমার পেছনে ইয়াহূদী আছে, তাকে হত্যা কর।’ (৩৫৯৩) (আধুনিক প্রকাশনীঃ ২৭১০, ইসলামিক ফাউন্ডেশনঃ ২৭২১)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 2926,
			"arabicnumber": 2926,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, কিয়ামত সংঘটিত হবে না যে পর্যন্ত না তোমরা ইয়াহূদীদের বিরুদ্ধে যুদ্ধ করবে। এমনকি কোন ইয়াহূদী পাথরের আড়ালে লুকিয়ে থাকলে, পাথর বলবে, ‘হে মুসলিম, আমার পেছনে ইয়াহূদী আছে, তাকে হত্যা কর।’ (মুসলিম ৫২/১৮ হাঃ ২৯২২) (আধুনিক প্রকাশনীঃ ২৭১১, ইসলামিক ফাউন্ডেশনঃ ২৭২২)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 2927,
			"arabicnumber": 2927,
			"text": "‘আমর ইবনু তাগলিব (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, কিয়ামতের আলামতসমূহের একটি এই যে, তোমরা এমন এক জাতির বিরুদ্ধে যুদ্ধ করবে, যারা পশমের জুতা পরিধান করবে। কিয়ামতের আর একটি আলামত এই যে, তোমরা এমন এক জাতির বিপক্ষে যুদ্ধ করবে, যাদের মুখমন্ডল হবে চওড়া, তাদের মুখমন্ডল যেন পিটানো চামড়ার ঢাল। (৩৫৯২) (আধুনিক প্রকাশনীঃ ২৭১২, ইসলামিক ফাউন্ডেশনঃ ২৭২৩)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 2928,
			"arabicnumber": 2928,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, ততদিন কিয়ামত সংঘটিত হবে না, যতদিন তোমরা এমন তুর্ক জাতির বিপক্ষে যুদ্ধ না করবে, যাদের চোখ ছোট, চেহারা লাল, নাক চ্যাপ্টা এবং মুখমন্ডল পেটানো চামড়ার ঢালের মত। আর ততদিন কিয়ামত সংঘটিত হবে না, যতদিন না তোমরা এমন এক জাতির বিপক্ষে যুদ্ধ করবে, যাদের জুতা হবে পশমের। (২৯২৯, ৩৫৮৭, ৩৫৯০, ৩৫৯১) (মুসলিম ৫২/১৮ হাঃ ২৯১২, আহমাদ ৭২৬৭) (আধুনিক প্রকাশনীঃ ২৭১৩, ইসলামিক ফাউন্ডেশনঃ ২৭২৪)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 2929,
			"arabicnumber": 2929,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, কিয়ামত সংঘটিত হবে না যতক্ষণ না তোমরা এমন জাতির বিপক্ষে যুদ্ধ করবে যাদের জুতা হবে পশমের। আর কিয়ামত সংঘটিত হবে না যতক্ষণ না তোমরা এমন জাতির বিপক্ষে যুদ্ধ করবে, যাদের মুখমন্ডল হবে পিটানো চামড়ার ঢালের মত। সুফ্ইয়ান (রহ.) বলেন, আ‘রাজ সূত্রে আবূ হুরাইরাহ্ (রাঃ) থেকে আবূযযিনাদ এই রেওয়ায়তে অতিরিক্ত বর্ণনা করেন; তাদের চোখ হবে ছোট, নাক হবে চ্যাপ্টা, তাদের চেহারা যেন পিটানো চামড়ার ঢাল। (২৯২৮) (আধুনিক প্রকাশনীঃ ২৭১৪, ইসলামিক ফাউন্ডেশনঃ ২৭২৫)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 2930,
			"arabicnumber": 2930,
			"text": "বারা’ (রাঃ) হতে বর্ণিত। তাকে এক ব্যক্তি জিজ্ঞেস করল, হে আবূ উমারা! হুনায়নের দিন আপনারা কি পলায়ন করেছিলেন? তিনি বললেন, না, আল্লাহর কসম, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পলায়ন করেননি। বরং তাঁর কিছু সংখ্যক নওজোয়ান সাহাবী হাতিয়ার ছাড়াই অগ্রসর হয়ে গিয়েছিলেন। তারা বানূ হাওয়াযিন ও বানূ নাসর গোত্রের সুদক্ষ তীরন্দাজদের সম্মুখীন হন। তাদের কোন তীরই লক্ষ্যভ্রষ্ট হয়নি। তারা এদের প্রতি এমনভাবে তীর বর্ষণ করল যে, তাদের কোন তীরই ব্যর্থ হয়নি। সেখান থেকে তারা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট এসে উপস্থিত হলেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তখন তাঁর সাদা খচ্চরটির পিঠে ছিলেন এবং তাঁর চাচাতো ভাই আবূ সুফ্ইয়ান ইবনু হারিস ইবনু ‘আবদুল মুত্তালিব তাঁর লাগাম ধরে ছিলেন। তখন তিনি নামেন এবং আল্লাহর সাহায্য প্রার্থনা করেন। অতঃপর তিনি বলেন, আমি নবী, এ কথা মিথ্যা নয়। আমি ‘আবদুল মুত্তালিবের পুত্র। অতঃপর তিনি সাহাবীদের সারিবদ্ধ করেন। (২৮৬৪) (মুসলিম ৩২/২৮ হাঃ ১৭৭৬, আহমাদ ১৮৪৯৫) (আধুনিক প্রকাশনীঃ ২৭১৫, ইসলামিক ফাউন্ডেশনঃ ২৭২৬)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 2931,
			"arabicnumber": 2931,
			"text": "‘আলী (রাঃ) হতে বর্ণিত। তিনি বলেন, আহযাব যুদ্ধের দিন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দু‘আ করেন, ‘আল্লাহ তাদের (মুশরিকদের) ঘর ও কবর আগুনে পূর্ণ করুন। কেননা তারা মধ্যম সালাত (তথা ‘আসরের সালাত) থেকে আমাদেরকে ব্যস্ত করে রেখেছে, এমনকি সূর্য অস্তমিত হয়ে যায়।’ (৪১১১, ৪৫৩৩, ৬৩৯৬) (মুসলিম ৫/৩৫ হাঃ ৬২৭, আহমাদ ৫৯১) (আধুনিক প্রকাশনীঃ ২৭১৬, ইসলামিক ফাউন্ডেশনঃ ২৭২৭)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 2932,
			"arabicnumber": 2932,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কুনূতে নাযিলায় এই দু‘আ করতেন, ‘হে আল্লাহ্! আপনি সালামাহ ইবনু হিশামকে নাজাত দিন। হে আল্লাহ্! ওয়ালীদ ইবনু ওয়ালীদকে নাজাত দিন। হে আল্লাহ্! আয়্যাশ ইবনু আবী রাবী‘আ-কে নাজাত দিন। হে আল্লাহ্! দুর্বল মুমিনদের নাজাত দিন। হে আল্লাহ! মুযার গোত্রকে সমূলে উৎপাটিত করুন। হে আল্লাহ! কাফিরদের উপর ইউসুফ (আঃ)-এর সময়ের দুর্ভিক্ষের মত দুর্ভিক্ষ নাযিল করুন।’ (৭৯৭) (আধুনিক প্রকাশনীঃ ২৭১৭, ইসলামিক ফাউন্ডেশনঃ ২৭২৮)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 2933,
			"arabicnumber": 2933,
			"text": "‘আবদুল্লাহ ইবনু আওফা (রাঃ) হতে বর্ণিত। তিনি বলেন, আহযাবের দিনে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এই বলে মুশরিকদের বিরুদ্ধে দু‘আ করেছিলেন যে, হে কিতাব নাযিলকারী, সত্বর হিসাব গ্রহণকারী আল্লাহ্! হে আল্লাহ্! তাদের সকল দলকে পরাজিত করুন। হে আল্লাহ্! আপনি তাদের পর্যুদস্ত ও প্রকম্পিত করুন।’ (২৯৬৫, ৩০২৫, ৪১১৫, ৬৩৯২, ৭৪৮৯) (মুসলিম ৩২/৭ হাঃ ১৭৪২, আহমাদ ১৯১২৯) (আধুনিক প্রকাশনীঃ ২৭১৮, ইসলামিক ফাউন্ডেশনঃ ২৭২৯)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 2934,
			"arabicnumber": 2934,
			"text": "‘আবদুল্লাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কা‘বার ছায়ায় সালাত আদায় করছিলেন। তখন আবূ জাহল ও কুরায়েশদের কিছু ব্যক্তি পরামর্শ করে। সেই সময় মক্কার বাইরে একটি উট যব্হ হয়েছিল। কুরায়শরা একজন পাঠিয়ে সেখান থেকে এর ভুঁড়ি নিয়ে এলো এবং তারা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর পিঠে ঢেলে দিল। অতঃপর ফাতিমাহ (রাঃ) এসে এটি তাঁর থেকে সরিয়ে দিলেন। এই সময় নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের বিরুদ্ধে দু‘আ করেন, হে আল্লাহ্! আপনি কুরায়শদের ধ্বংস করুন। হে আল্লাহ! আপনি কুরায়শদের ধ্বংস করুন। হে আল্লাহ্! আপনি কুরায়শদের ধ্বংস করুন। অর্থাৎ আবূ জাহ্ল, ইবনু হিশাম, উতবা ইবনু রবী‘আহ, শায়বা ইবনু রবীআহ’, ওয়ালীদ ইবনু উতবাহ, ‘উবাই ইবনু খাল্ফ এবং ‘উকবাহ ইবনু আবী মু‘আইত। ‘আবদুল্লাহ (রাঃ) বলেন, অতঃপর আমি তাদের সকলকে বাদারের একটি পরিত্যক্ত কূয়ায় নিহত দেখেছি। আবূ ইসহাক (রহ.) বলেন, আমি সপ্তম ব্যক্তির নাম ভুলে গিয়েছি। আবূ ‘আবদুল্লাহ (রহ.) বলেন, ইউসুফ ইবনু ‘‘ইসহাক (রহ.) আবূ ইসহাক (রহ.) সূত্রে উমাইয়া ইবনু খালফ বলেছেন। শু‘বাহ (রহ.) বলেন, উমাইয়া অথবা ‘উবাই। তবে সঠিক হলো উমাইয়াহ।। (২৪০) (আধুনিক প্রকাশনীঃ ২৭১৯, ইসলামিক ফাউন্ডেশনঃ ২৭৩০)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 2935,
			"arabicnumber": 2935,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। একদা কয়েকজন ইয়াহূদী আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট আসল এবং বলল, তোমার মরণ হোক। ‘আয়িশাহ (রাঃ) তাদের অভিশাপ দিলেন। তাতে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে জিজ্ঞেস করলেন, তোমার কী হলো? ‘আয়িশাহ (রাঃ) বললেন, তারা কী বলেছে, আপনি কি তা শুনেননি? আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আমি বলেছি, ‘তোমাদের উপর’, তা কি তুমি শোননি? (৬০২৪, ৬০৩০, ৬২৫৬, ৬৩৯৫, ৬৪০১, ৬৯২৭) (মুসলিম ৩৯/৩ হাঃ ২১৬৫, আহমাদ ২৪১৪৫) (আধুনিক প্রকাশনীঃ ২৭২০, ইসলামিক ফাউন্ডেশনঃ ২৭৩১)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 2936,
			"arabicnumber": 2936,
			"text": "‘আবদুল্লাহ ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কায়সারের নিকট চিঠি লিখেছিলেন এবং এতে বলেছিলেন, যদি তুমি মুখ ফিরিয়ে রাখ তাহলে প্রজাদের পাপের বোঝা তোমার উপরেই চাপানো হবে। (২৯৪০) (আধুনিক প্রকাশনীঃ ২৭২১, ইসলামিক ফাউন্ডেশনঃ ২৭৩২)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 2937,
			"arabicnumber": 2937,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, তুফাইল ইবনু ‘আমর দাওসী ও তাঁর সঙ্গীরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট এসে বলল, ‘হে আল্লাহর রাসূল! দাওস গোত্রের লোকেরা (ইসলাম গ্রহণে) অবাধ্যতা করেছে ও অস্বীকার করেছে। আপনি তাদের বিরুদ্ধে দু‘আ করুন।’ অতঃপর বলা হলো, দাওস গোত্র ধ্বংস হোক। তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, ‘হে আল্লাহ! আপনি দাওস গোত্রকে হিদায়াত করুন এবং তাদেরকে ইসলামে নিয়ে আসুন।’ (৪৩৯২, ৬৩৯৭) (মুসলিম ৪৪/৪৭ হাঃ ২৫২৪, আহমাদ ৭৩১৯) (আধুনিক প্রকাশনীঃ ২৭২২, ইসলামিক ফাউন্ডেশনঃ ২৭৩৩)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 2938,
			"arabicnumber": 2938,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। তিনি বলেন, যখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রোম- সম্রাটের প্রতি লেখার ইচ্ছা করেন তখন তাকে বলা হলো যে, তারা সীল মোহরকৃত পত্র ব্যতীত পাঠ করে না। অতঃপর তিনি রূপার একটি মোহর প্রস্তুত করেন। আমি এখনো যেন তাঁর হাতে এর শুভ্রতা দেখছি। তিনি তাতে অংকিত করেছিলেন, ‘‘মুহাম্মাদুর রাসূলুল্লাহ’’। (৬৫) (আধুনিক প্রকাশনীঃ ২৭২৩, ইসলামিক ফাউন্ডেশনঃ ২৭৩৪)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 2939,
			"arabicnumber": 2939,
			"text": "‘আবদুল্লাহ্ ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর পত্রসহ কিসরার নিকট দূত পাঠালেন এবং দূতকে নির্দেশ দেন যে, তা যেন বাহরাইনের শাসনকর্তার কাছে দেয়া হয়। পরে বাহরায়নের শাসনকর্তা তা কিসরার নিকট পৌঁছিয়ে দেন। কিসরা যখন তা পড়ল তা ছিঁড়ে টুকরো করে ফেলল। আমার মনে হয়, সা‘ঈদ ইবনু মুসায়্যাব (রহ.) বলেছেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের ব্যাপারে দু‘আ করেন, যেন তাদেরকে একেবারে ছিন্নভিন্ন করে দেয়া হয়। (৬৪) (আধুনিক প্রকাশনীঃ ২৭২৪, ইসলামিক ফাউন্ডেশনঃ ২৭৩৫)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 2941,
			"arabicnumber": 2941,
			"text": "",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 2942,
			"arabicnumber": 2942,
			"text": "সাহল ইবনু সা‘আদ (রহ.) হতে বর্ণিত যে, তিনি খায়বারের যুদ্ধের সময় নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছেন, আমি এমন এক ব্যক্তিকে পতাকা দিব যার হাতে বিজয় আসবে। অতঃপর কাকে পতাকা দেয়া হবে, সেজন্য সকলেই আশা করতে লাগলেন। পরদিন সকালে প্রত্যেকেই এ আশায় অপেক্ষা করতে লাগলেন যে, হয়ত তাকে পতাকা দেয়া হবে। কিন্তু নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, ‘আলী কোথায়? তাঁকে জানানো হলো যে, তিনি চক্ষুরোগে আক্রান্ত। তখন তিনি ‘আলীকে ডেকে আনতে বললেন। তাকে ডেকে আনা হল। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর মুখের লালা তাঁর উভয় চোখে লাগিয়ে দিলেন। তৎক্ষণাৎ তিনি এমনভাবে সুস্থ হয়ে গেলেন যে, তাঁর যেন কোন অসুখই ছিল না। তখন ‘আলী (রাঃ) বললেন, আমি তাদের বিরুদ্ধে ততক্ষণ লড়াই চালিয়ে যাব, যতক্ষণ না তারা আমাদের মত হয়ে যায়। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তুমি সোজা এগিয়ে যাও। তুমি তাদের প্রান্তরে উপস্থিত হলে প্রথমে তাদেরকে ইসলামের প্রতি আহবান জানাও এবং তাদের কর্তব্য সম্পর্কে তাদের অবহিত কর। আল্লাহর কসম, যদি একটি ব্যক্তিও তোমার দ্বারা হিদায়াত লাভ করে, তবে তা তোমার জন্য লাল রংয়ের উটের চেয়েও উত্তম। (৩০০৯, ৩৭০১, ৪২১০) (মুসলিম ৪৪/৪ হাঃ ২৪০৬, আহমাদ ২২৮৮৪) (আধুনিক প্রকাশনীঃ ২৭২৬, ইসলামিক ফাউন্ডেশনঃ ২৭৩৭)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 2943,
			"arabicnumber": 2943,
			"text": "আনাস (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কোন কাওমের বিরুদ্ধে যুদ্ধে গেলে সকাল না হওয়া পর্যন্ত আক্রমণ করতেন না। আযান শুনলে আক্রমণ থেকে বিরত থাকতেন। আযান না শুনলে সকাল হবার সঙ্গে সঙ্গে আক্রমণ করতেন। আমরা খায়বারে রাত্রিকালে অবতরণ করলাম। (৩৭১) (আধুনিক প্রকাশনীঃ ২৭২৭, ইসলামিক ফাউন্ডেশনঃ ২৭৩৮)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 2944,
			"arabicnumber": 2944,
			"text": "",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 2945,
			"arabicnumber": 2945,
			"text": "আনাস (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খায়বারের উদ্দেশ্যে যাত্রা করে রাতে সেখানে উপস্থিত হলেন। তিনি জিহাদের উদ্দেশে রাত্রিকালে কোন জনপদে গেলে সকাল না হওয়া পর্যন্ত তাদের উপর আক্রমণ করেন না। যখন সকাল হলো ইয়াহূদীরা কোদাল ও ঝুড়ি নিয়ে বের হল তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে দেখতে পেয়ে বলে উঠল, মুহাম্মাদ, আল্লাহর কসম! মুহাম্মাদ তাঁর পুরো সেনাবাহিনী নিয়ে উপস্থিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তখন আল্লাহু আকবার ধ্বনি উচ্চারণ করেন এবং বললেন, খায়বার ধ্বংস হল, নিশ্চয়ই আমরা যখন কোন জনপদের আঙ্গিণায় উপস্থিত হই, তখন সতর্ককৃত লোকদের সকাল কত মন্দ! (৩৭১) (আধুনিক প্রকাশনীঃ ২৭২৮, ইসলামিক ফাউন্ডেশনঃ ২৭৩৯)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 2946,
			"arabicnumber": 2946,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, আমাকে ততক্ষণ পর্যন্ত লোকদের সঙ্গে যুদ্ধ করার আদেশ দেয়া হয়েছে, যতক্ষণ না তারা ‘লা ইলাহা ইল্লাল্লাহু’ বলে আর যে ‘লা ইলাহা ইল্লাল্লাহু’ বলবে সে তার জান ও মাল আমার হাত থেকে বাঁচিয়ে নিল। অবশ্য ইসলামের কর্তব্যাদি আলাদা, আর তার হিসাব আল্লাহর উপর ন্যস্ত। (মুসলিম ১/৮ হাঃ ২১) (আধুনিক প্রকাশনীঃ ২৭২৯, ইসলামিক ফাউন্ডেশনঃ ২৭৪০)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 2947,
			"arabicnumber": 2947,
			"text": "‘আবদুল্লাহ্ ইবনু কা‘ব ইবনু মালিক (রহ.) হতে বর্ণিত। তিনি ছিলেন কা‘বের পুত্রদের মধ্যে নেতা, তিনি বলেন, আমি কা‘ব ইবনু মালিক (রাঃ) থেকে শুনেছি, যখন তিনি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে পেছনে থেকে গিয়েছিলেন। রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখনই কোথাও যুদ্ধে যাবার ইচ্ছা করতেন, তখন তিনি অন্য দিকে দৃষ্টি ফিরিয়ে দিয়ে তা গোপন রাখতেন। (২৭৫৭) (আধুনিক প্রকাশনীঃ ২৭৩০, ইসলামিক ফাউন্ডেশনঃ ২৭৪১)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 2948,
			"arabicnumber": 2948,
			"text": "কা‘ব ইবনু মালিক (রাঃ) হতে বর্ণিত। তিনি বলেন, অধিকাংশ সময় আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কোন নির্দিষ্ট জায়গায় যুদ্ধের ইচ্ছা করলে অন্য দিকে দৃষ্টি ফিরিয়ে দিয়ে তা গোপন রাখতেন কিন্তু যখন তাবুক যুদ্ধ এল, যে যুদ্ধে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রওয়ানা দিলেন, প্রচন্ড গরম এবং সম্মুখীন হলেন দীর্ঘ সফরের ও মরুময় পথের আর অধিক সংখ্যক সৈন্যের মোকাবিলায় অগ্রসর হলেন। তাই তিনি মুসলিমদের সামনে বিষয়টি প্রকাশ করলেন, যাতে তারা শত্রুর মুকাবিলার প্রয়োজনীয় প্রস্তুতি গ্রহণ করতে পারে এবং ইচ্ছার লক্ষ্য সবাইকে জানিয়ে দিলেন। (২৭৫৭)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 2949,
			"arabicnumber": 2949,
			"text": "কা‘ব ইবনু মালিক (রাঃ) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখনই কোন সফরে যাবার ইচ্ছা করতেন তখন বৃহস্পতিবারেই যাত্রা করতেন। (২৭৫৭) (আধুনিক প্রকাশনীঃ ২৭৩১, ইসলামিক ফাউন্ডেশনঃ ২৭৪২)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 2950,
			"arabicnumber": 2950,
			"text": "কা‘ব ইবনু মালিক (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাবুকের যুদ্ধে বৃহস্পতিবার বের হন আর বৃহস্পতিবার বের হওয়াই তিনি পছন্দ করতেন। (২৭৫৭) (আধুনিক প্রকাশনীঃ ২৭৩২, ইসলামিক ফাউন্ডেশনঃ ২৭৪৩)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 2951,
			"arabicnumber": 2951,
			"text": "আনাস (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মদিনা্তে যুহরের সালাত চার রাকআত আদায় করেন এবং যুল-হুলায়ফাতে পৌঁছে দু’রাকআত আসর সালাত আদায় করেন। আমি তাদের হজ্জ ও ‘উমরাহ উভয়টির তালবিয়া জোরে পাঠ করতে শুনেছি। (১০৮৯) (আধুনিক প্রকাশনীঃ ২৭৩৩, ইসলামিক ফাউন্ডেশনঃ ২৭৪৪)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 2952,
			"arabicnumber": 2952,
			"text": "وَقَالَ كُرَيْبٌ عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا انْطَلَقَ النَّبِيُّ صلى الله عليه وسلم مِنْ الْمَدِيْنَةِ لِخَمْسٍ بَقِيْنَ مِنْ ذِي الْقَعْدَةِ وَقَدِمَ مَكَّةَ لِأَرْبَعِ لَيَالٍ خَلَوْنَ مِنْ ذِي الْحِجَّةِ কুরাইব (রহ.) ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণনা করেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যুল-কা‘দার পাঁচ দিন থাকতে মদিনা্ থেকে রওয়ানা হন এবং যুল-হিজ্জার ৪ তারিখে মক্কা্য় পৌঁছেন। ২৯৫২. ‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমরা যুল-কাদার ৫ রাত থাকতে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে রওয়ানা হলাম। হজ্জ আদায় ব্যতীত আমাদের আর কোন উদ্দেশ্য ছিল না। মক্কার নিকটবর্তী হলে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের আদেশ দিলেন যাদের নিকট কুরবানীর জন্তু নেই, তারা বায়তুল্লাহর তাওয়াফ এবং সাফা মারওয়ার সা‘ঈ করার পর ইহরাম খুলে ফেলবে। ‘আয়িশাহ (রাঃ) বলেন, কুরবানীর দিন আমাদের নিকট গরুর গোশ্ত পৌঁছানো হলো। আমি জিজ্ঞেস করলাম, এগুলো কিসের? বলা হলো, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর স্ত্রীদের পক্ষ থেকে কুরবানী আদায় করেছেন। ইয়াহ্ইয়া (রহ.) বলেন, আমি হাদীসটি কাসেম ইবনু মুহাম্মদ (রহ.)-এর নিকট বর্ণনা করলে তিনি বললেন, আল্লাহর কসম বর্ণনাকারিণী এ হাদীসটি আপনার নিকট সঠিকভাবে বর্ণনা করেছেন। (২৯৪) (আধুনিক প্রকাশনীঃ ২৭৩৪, ইসলামিক ফাউন্ডেশনঃ ২৭৪৫)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 2953,
			"arabicnumber": 2953,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রমাযান মাসে সফরে বের হন এবং সিয়াম পালন করেন। যখন তিনি কাদীদ নামক স্থানে পৌঁছলেন তখন সিয়াম ছেড়ে দেন। সুফ্ইয়ান (রহ.)....ইবনু ‘আব্বাস (রাঃ) থেকে একইভাবে হাদীস বর্ণনা করেছেন। আবূ ‘আব্দুল্লাহ (রহ.) বলেন, এটা যুহরী (রহ.)-এর উক্তি এবং আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সর্বশেষ কার্যই গ্রহণযোগ্য। (১৯৪৪) (আধুনিক প্রকাশনীঃ ২৭৩৫, ইসলামিক ফাউন্ডেশনঃ ২৭৪৬)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 2954,
			"arabicnumber": 2954,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদেরকে এক অভিযানে পাঠালেন। কুরাইশদের দু‘জন লোকের নামোল্লেখ করে আমাদেরকে বললেন, তোমরা যদি অমুক ও অমুকের সাক্ষাৎ পাও তবে তাদেরকে আগুনে জ্বালিয়ে ফেলবে। আবূ হুরাইরাহ্ (রাঃ) বলেন, অতঃপর আমরা রওয়ানা করার প্রাক্কালে বিদায় গ্রহণ করার জন্য আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট উপস্থিত হলাম। তখন তিনি বললেন, ‘আমি তোমাদেরকে অমুক অমুককে আগুনে জ্বালিয়ে ফেলতে নির্দেশ দিয়েছিলাম, কিন্তু আগুনের শাস্তি দান করার অধিকার আল্লাহ তা‘আলা ব্যতীত আর কারো নেই। তাই তোমরা যদি তাদেরকে ধরে ফেলতে সক্ষম হয়, তবে তাদের উভয়কে হত্যা করবে। (৩০১৬) (আধুনিক প্রকাশনীঃ ২৭৩৬, ইসলামিক ফাউন্ডেশনঃ)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 2955,
			"arabicnumber": 2955,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, ‘পাপ কাজের আদেশ না করা পর্যন্ত ইমামের কথা শোনা ও তার আদেশ মানা অপরিহার্য। তবে পাপ কাজের আদেশ করা হলে তা শোনা ও আনুগত্য করা যাবে না।’ (৭১৪৪) (আধুনিক প্রকাশনীঃ ২৭৩৭, ইসলামিক ফাউন্ডেশনঃ ২৭৪৭)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 2957,
			"arabicnumber": 2957,
			"text": "",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 2958,
			"arabicnumber": 2958,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, ‘আমরা যখন হুদাইবিয়া সন্ধির পরবর্তী বছর প্রত্যাবর্তন করলাম, তখন আমাদের মধ্য হতে দু’জন লোকও যে বৃক্ষের নীচে আমরা বায়‘আত করেছিলাম সেটি চিহ্নিত করার ব্যাপারে একমত হতে সক্ষম হয়নি। তা ছিল আল্লাহ্ তা‘আলার পক্ষ থেকে রহমত স্বরূপ।’ বর্ণনাকারী বলেন, ‘আমি নাফি (রহ.)-কে জিজ্ঞেস করলাম যে, তাঁদের নিকট হতে কিসের বায়‘আত গ্রহণ করা হয়েছিল? তা কি মৃত্যুর উপর?’ তিনি বললেন, ‘না, বরং আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁদের নিকট হতে দৃঢ় থাকার উপর বায়‘আত গ্রহণ করেছিলেন।’ (আধুনিক প্রকাশনীঃ ২৭৩৯, ইসলামিক ফাউন্ডেশনঃ ২৭৪৯)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 2959,
			"arabicnumber": 2959,
			"text": "‘আবদুল্লাহ্ ইবনু যায়দ (রাঃ) হতে বর্ণিত। তিনি বলেন, হার্রা নামক যুদ্ধের সময়ে তাঁর নিকট এক ব্যক্তি এসে বললো, ‘ইবনু হানযালা (রাঃ) মানুষের নিকট থেকে মৃত্যুর উপর বায়‘আত গ্রহণ করছেন। তিনি বললেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর পর আমি তো কারো নিকট এমন বায়‘আত করব না। (৪১৬৭) (মুসলিম ৩৩/১৮ হাঃ ১৮৬১) (আধুনিক প্রকাশনীঃ ২৭৪০, ইসলামিক ফাউন্ডেশনঃ ২৭৫০)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 2960,
			"arabicnumber": 2960,
			"text": "সালামাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, ‘আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট বায়‘আত করলাম। অতঃপর আমি একটি বৃক্ষের ছায়ায় গেলাম। মানুষের ভীড় কমে গেলে, (তাঁর নিকট উপস্থিত হলে) আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে বললেন, ‘ইবনু আকওয়া‘! তুমি কি বায়‘আত করবে না?’ আমি বললাম, ‘হে আল্লাহর রাসূল! আমি তো বায়‘আত করেছি।’ আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, ‘আরেক বার।’ তখন আমি দ্বিতীয় বার আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট বায়‘আত করলাম। (বর্ণনাকারী) বলেন, আমি তাঁকে জিজ্ঞেস করলাম, ‘হে আবূ মুসলিম! সেদিন তোমরা কোন্ জিনিসের উপর বায়‘আত করেছিলে?’ তিনি বললেন, ‘মৃত্যুর উপর।’ (৪১৬৯, ৭২০৬, ৭২০৮) (মুসলিম ৩৩/১৮ হাঃ ১৮৬০) (আধুনিক প্রকাশনীঃ ২৭৪১, ইসলামিক ফাউন্ডেশনঃ ২৭৫১)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 2961,
			"arabicnumber": 2961,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। তিনি বলেন, আনসারগণ খন্দকে যুদ্ধের দিন আবৃত্তি করছিলেনঃ ‘‘আমরাই হচ্ছি সে সকল ব্যক্তি, যারা মুহাম্মাদের হাতে জিহাদ করার উপর বায়‘আত গ্রহণ করেছি, যতদিন আমরা বেঁচে থাকব।’’ আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর উত্তর দিয়ে বললেনঃ হে আল্লাহ্! পরকালের সুখ হচ্ছে প্রকৃত সুখ; তাই তুমি আনসার ও মুহাজিরদেরকে সম্মানিত কর। (২৮৩৪) (আধুনিক প্রকাশনীঃ ২৭৪২, ইসলামিক ফাউন্ডেশনঃ ২৭৫২)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 2963,
			"arabicnumber": 2963,
			"text": "",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 2964,
			"arabicnumber": 2964,
			"text": "‘আবদুল্লাহ্ (ইবনু মাস‘ঊদ) (রাঃ) হতে বর্ণিত। তিনি বলেন, ‘আজ আমার নিকট এক ব্যক্তি আগমন করে। সে আমাকে একটি বিষয়ে প্রশ্ন করে, যার উত্তর কী দিব, তা আমার বুঝে আসছিল না।’ লোকটি বললো, ‘বলুন তো, এক ব্যক্তি সশস্ত্র অবস্থায় সন্তুষ্টচিত্তে আমাদের আমীরের সঙ্গে যুদ্ধে বের হল। কিন্তু সেই আমীর এমন সব নির্দেশ দেন যা পালন করা সম্ভব নয়। আমি বললাম, ‘আল্লাহর কসম! আমি বুঝতে পারছি না যে, তোমাদের এ প্রশ্নের কী উত্তর দিব? হ্যাঁ, তবে এতটুকু বলতে পারি যে, আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে ছিলাম। তিনি সাধারণত আমাদেরকে কোন বিষয়ে কঠোর নির্দেশ দিতেন না। কিন্তু একবার মাত্র এরূপ নির্দেশ দিয়েছিলেন, আর আমরা তা পালন করেছিলাম। আর তোমাদের যে কেউ ততক্ষণ ভাল থাকবে, যতক্ষণ সে আল্লাহ্ তা‘আলাকে ভয় করতে থাকবে। আর যখন সে কোন বিষয়ে সন্দিহান হয়ে পড়বে, তখন সে এমন ব্যক্তির নিকট প্রশ্ন করে নিবে, যে তাকে সন্দেহ মুক্ত করে দিবে। আর সে যুগ অতি নিকটে যে, তোমরা এমন ব্যক্তি পাবে না। শপথ সেই সত্তার যিনি ব্যতীত কোন ইলাহ নেই। দুনিয়ায় যা অবশিষ্ট রয়েছে, তার উপমা এরূপ যেমন একটি পুকুরের মধ্যে পানি জমেছে। এর পরিষ্কার পানি তো পান করা হয়েছে, আর নীচের ঘোলা পানি বাকী রয়ে গেছে। (আধুনিক প্রকাশনীঃ ২৭৪৪, ইসলামিক ফাউন্ডেশনঃ ২৭৫৪)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 2966,
			"arabicnumber": 2966,
			"text": "",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 2967,
			"arabicnumber": 2967,
			"text": "(لِقَوْلِهِ )إِنَّمَا الْمُؤْمِنُوْنَ الَّذِيْنَ اٰمَنُوْا بِاللهِ وَرَسُوْلِهٰ وَإِذَا كَانُوْا مَعَهُ عَلٰى أَمْرٍ جَامِعٍ لَّمْ يَذْهَبُوْا حَتّٰى يَسْتَأْذِنُوْهُ إِنَّ الَّذِيْنَ يَسْتَأْذِنُوْنَكَ( إِلَى آخِرِ الآيَةِ আল্লাহ্ তা‘আলার বাণীঃ মু‘মিন তো তারাই যারা আল্লাহ্ ও তাঁর রাসূলের প্রতি ঈমান রাখে এবং যখন তারা কোন সমষ্টিগত কাজে রসুলের সাথে সমবেত হয় তখন তারা তাঁর অনুমতি ব্যতিরেকে চলে যায় না।। (নূর ৬২) ২৯৬৭. জাবির ইবনু ‘আবদুল্লাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে এক যুদ্ধে অংশ গ্রহণ করি। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কিছুক্ষণ পরে এসে আমার সঙ্গে মিলিত হন; আমি তখন আমার পানি-সেচের উটনীর উপর আরোহী ছিলাম। উটনী ক্লান্ত হয়ে পড়েছিল; এটি মোটেই চলতে পারছিল না। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে জিজ্ঞেস করলেন, তোমার উটের কী হয়েছে? আমি বললাম, ক্লান্ত হয়ে পড়েছে। তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উটনীর পেছন দিক থেকে গিয়ে উটনীটিকে হাঁকালেন এবং এটির জন্য দু‘আ করলেন। অতঃপর এটি সবক’টি উটের আগে আগে চলতে থাকে। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে জিজ্ঞেস করলেন, এখন তোমার উটনীটি কেমন মনে হচ্ছে? আমি বললাম, ভালই। এটি আপনার বরকত লাভ করেছে। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তুমি কি এটি আমার নিকট বিক্রয় করবে? তিনি বলেন, আমি মনে মনে লজ্জাবোধ করলাম। (কারণ) আমার নিকট এ উটটি ব্যতীত পানি বহনের অন্য কোন উটনী ছিল না। আমি বললাম, হ্যাঁ। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তাহলে আমার নিকট বিক্রয় কর। অনন্তর আমি উটনীটি তাঁর নিকট এ শর্তে বিক্রয় করলাম যে, মদিনা্য় পৌঁছা পর্যন্ত এর উপর আরোহণ করব। আমি বললাম, হে আল্লাহর রাসূল! আমি সদ্য বিবাহিত একজন পুরুষ। অতঃপর আমি তাঁর নিকট অনুমতি চাইলাম। তিনি আমাকে অনুমতি দিলেন। আমি লোকদের আগে আগে চললাম এবং মদিনা্য় পৌঁছে গেলাম। তখন আমার মামা আমার সঙ্গে সাক্ষাৎ করলেন। তিনি আমাকে উটনীর ব্যাপারে জিজ্ঞেস করলেন। আমি তাকে সে বিষয়ে অবহিত করলাম যা আমি করেছিলাম। তিনি আমাকে তিরস্কার করলেন। তিনি (রাবী) বলেন, আর যখন আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট অনুমতি চেয়েছিলাম, তখন তিনি আমাকে প্রশ্ন করছিলেন, তুমি কি কুমারী বিবাহ করেছ, না এমন মহিলাকে বিবাহ করেছ যার পূর্বে বিবাহ হয়েছিল? আমি বললাম, এমন মহিলাকে বিবাহ করেছি যার পূর্বে বিবাহ হয়েছে। তিনি বললেন, তুমি কুমারী বিবাহ করলে না কেন? তুমি তার সঙ্গে খেলা করতে এবং সেও তোমার সঙ্গে খেলা করত। আমি বললাম, হে আল্লাহর রাসূল! আমার পিতা শহীদ হয়েছেন। আমার কয়েকজন ছোট ছোট বোন রয়েছে। তাই আমি তাদের সমান বয়সের কোন মেয়ে বিবাহ করা পছন্দ করিনি; যে তাদেরকে আদব-আখলাক শিক্ষা দিতে পারবে না এবং তাদের দেখাশোনা করতে পারবে না। তাই আমি একজন পূর্ব বিবাহ হয়েছে এমন মহিলাকে বিবাহ করেছি; যাতে সে তাদের দেখাশোনা করতে পারে এবং তাদেরকে আদব-আখলাক শিক্ষা দিতে পারে। তিনি বলেন, যখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মদিনা্য় আসেন, পরদিন আমি তাঁর নিকট উটনীটি নিয়ে উপস্থিত হলাম। তিনি আমাকে এর মূল্য দিলেন এবং উটটিও ফেরত দিলেন। মুগীরাহ (রাঃ) বলেন, আমাদের বিবেচনায় এটি উত্তম। আমরা এতেকোন কোন দোষ মনে করি না। (৪৪৩) (মুসলিম ৬/১২ হাঃ ৭১৫) (আধুনিক প্রকাশনীঃ ২৭৪৬, ইসলামিক ফাউন্ডেশনঃ ২৭৫৬)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 2968,
			"arabicnumber": 2968,
			"text": "بَابُ مَنْ غَزَا وَهُوَ حَدِيْثُ عَهْدٍ بِعُرْسِهِ فِيْهِ جَابِرٌ عَنْ النَّبِيِّ صلى الله عليه وسلم ৫৬/১১৪. অধ্যায় : বিবাহের নতুন অবস্থায় যুদ্ধে অংশগ্রহণ করা। এ প্রসঙ্গে জাবির (রাঃ) কর্তৃক আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে হাদীস বর্ণিত আছে। 56/115. بَابُ مَنْ اخْتَارَ الْغَزْوَ بَعْدَ الْبِنَاءِ فِيْهِ أَبُوْ هُرَيْرَةَ عَنْ النَّبِيِّ صلى الله عليه وسلم ৫৬/১১৫. অধ্যায় : স্ত্রীর সঙ্গে প্রথম মিলনের পর নব বিবাহিতের যুদ্ধে অংশ গ্রহণ করা। এ প্রসঙ্গে আবু হুরাইরাহ্ (রাঃ) কর্তৃক নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে হাদীস বর্ণিত আছে ২৯৬৮. আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। তিনি বলেন, একবার মদিনা্য় ভীতি ছড়িয়ে পড়ল। তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আবূ ত্বলহা (রাঃ)-এর ঘোড়ায় আরোহণ করেন এবং বলেন যে, আমি তো ভয়ের কিছু দেখতে পেলাম না। তবে আমি এ ঘোড়াটিকে সমুদ্রের মত গতিশীল পেয়েছি। (২৬২৭) (আধুনিক প্রকাশনীঃ ২৭৪৭, ইসলামিক ফাউন্ডেশনঃ ২৭৫৭)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 2969,
			"arabicnumber": 2969,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। তিনি বলেন, এক সময় লোকেরা ভীত হয়ে পড়ল। তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আবূ ত্বলহা (রাঃ)-এর ধীরগতি সম্পন্ন একটি ঘোড়ার উপর চড়লেন এবং একাকী ঘোড়াটিকে হাঁকিয়ে বেরিয়ে পড়লেন। লোকেরা তখন তাঁর পিছু পিছু ঘোড়ায় চড়ে ছুটে চলল। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তোমরা ভয় করো না। এ ঘোড়াটি তো দ্রুতগামী। বর্ণনাকারী বলেন, সেদিন হতে আর কখনো সে ঘোড়াটি কারো পেছনে পড়েনি। (২৬২৭) (আধুনিক প্রকাশনীঃ ২৭৪৮, ইসলামিক ফাউন্ডেশনঃ ২৭৫৮)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 2970,
			"arabicnumber": 2970,
			"text": "بَابُ الْخُرُوْجِ فِي الْفَزَعِ وَحْدَهُ ৫৬/১১৮. অধ্যায় : ভয়-ভীতিকালে একাকী নিস্ক্রান্ত হওয়া। وَقَالَ مُجَاهِدٌ قُلْتُ لِابْنِ عُمَرَ الْغَزْوَ قَالَ إِنِّيْ أُحِبُّ أَنْ أُعِيْنَكَ بِطَائِفَةٍ مِنْ مَالِيْ قُلْتُ أَوْسَعَ اللهُ عَلَيَّ قَالَ إِنَّ غِنَاكَ لَكَ وَإِنِّيْ أُحِبُّ أَنْ يَكُوْنَ مِنْ مَالِيْ فِيْ هَذَا الْوَجْهِ وَقَالَ عُمَرُ إِنَّ نَاسًا يَأْخُذُوْنَ مِنْ هَذَا الْمَالِ لِيُجَاهِدُوْا ثُمَّ لَا يُجَاهِدُوْنَ فَمَنْ فَعَلَهُ فَنَحْنُ أَحَقُّ بِمَالِهِ حَتَّى نَأْخُذَ مِنْهُ مَا أَخَذَ وَقَالَ طَاوُسٌ وَمُجَاهِدٌ إِذَا دُفِعَ إِلَيْكَ شَيْءٌ تَخْرُجُ بِهِ فِيْ سَبِيْلِ اللهِ فَاصْنَعْ بِهِ مَا شِئْتَ وَضَعْهُ عِنْدَ أَهْلِكَ মুজাহিদ (রহ.) বলেন, আমি ইবনু ‘উমার (রাঃ)-কে বললাম, আমি জিহাদে যেতে চাই। তিনি বললেন, আমি তোমাকে কিছু অর্থ দিয়ে সাহায্য করতে চাই। আমি বললাম, আল্লাহ্ তা‘আলা আমাকে আর্থিক স্বচ্ছলতা দান করেছেন। তিনি, [ইবনু ‘উমার (রাঃ)] বললেন, তোমার স্বচ্ছলতা তোমার জন্য। আমি চাই, আমার কিছু সম্পদ এ পথে ব্যয় হোক। ‘উমার (রাঃ) বলেন, এমন কিছু ব্যক্তি রয়েছে, যারা জিহাদ করার জন্য অর্থ গ্রহণ করে, পরে জিহাদ করে না। যারা এরূপ করে, আমরা তার সম্পদে অধিক হকদার এবং আমরা তা ফেরত নিয়ে নিব, যা সে গ্রহণ করেছে। তাউস ও মুজাহিদ (রহ.) বলেছেন, যখন আল্লাহর রাহে বের হবার জন্য তোমাকে কিছু দান করা হয়, তা দিয়ে তুমি যা ইচ্ছা তা করতে পার আর তোমার পরিবার-পরিজনের কাছেও রেখে দিতে পার। ২৯৭০. ‘উমার ইবনু খাত্তাব (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি আল্লাহর রাহে একটি অশ্ব আরোহণের জন্য দান করেছিলাম। অতঃপর আমি তা বিক্রয় হতে দেখতে পাই। আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট জিজ্ঞেস করলাম, ‘আমি কি সেটা কিনে নিব?’ রাসুলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, ‘না, তুমি তা ক্রয় করো না এবং তোমার সদাকাহ ফেরত নিও না।’ (১৪৯০) (আধুনিক প্রকাশনীঃ ২৭৪৯, ইসলামিক ফাউন্ডেশনঃ ২৭৫৯)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 2971,
			"arabicnumber": 2971,
			"text": "‘আবদুল্লাহ্ ইবনু ‘উমার (রাঃ) হতে বর্ণিত। ‘উমার ইবনু খাত্তাব (রাঃ) এক অশ্বারোহীকে আল্লাহর রাহে একটি অশ্ব দান করেন। অতঃপর তিনি দেখতে পান যে, তা বিক্রয় করা হচ্ছে। তখন তিনি তা কিনে নেয়ার ইচ্ছা করলেন এবং আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট জিজ্ঞেস করলেন। তখন তিনি [রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম] বললেন, ‘তুমি ওটা কিনিও না এবং তোমার সদাকাহ ফেরত নিও না।’ (১৪৮৯) (মুসলিম ২৪/১ হাঃ ১৬২১) (আধুনিক প্রকাশনীঃ ২৭৫০, ইসলামিক ফাউন্ডেশনঃ ২৭৬০)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 2972,
			"arabicnumber": 2972,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, আমি যদি আমার উম্মাতের জন্য কষ্টকর মনে না করতাম, তবে আমি কোন সেনা অভিযান থেকে পিছিয়ে থাকতাম না। কিন্তু আমি তো (সকলের জন্য) সাওয়ারী সংগ্রহ করতে পারছি না এবং আমি এতগুলো সাওয়ারী পাচ্ছি না যার উপর আমি তাদের আরোহণ করাতে পারি। আর আমার জন্য এটা কষ্টদায়ক হবে যে, তারা আমার থেকে পেছনে পড়ে থাকবে। আমি তো এটাই কামনা করি যে, আমি আল্লাহর রাহে জিহাদ করব এবং শহীদ হয়ে যাবো, অতঃপর আমাকে আবার জীবিত করা হবে এবং আমি আবার শহীদ হবো। অতঃপর আমাকে আবার জীবিত করা হবে। (৩৬) (আধুনিক প্রকাশনীঃ ২৭৫১, ইসলামিক ফাউন্ডেশনঃ ২৭৬১)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 2973,
			"arabicnumber": 2973,
			"text": "وَقَالَ الْحَسَنُ وَابْنُ سِيْرِيْنَ يُقْسَمُ لِلأَجِيْرِ مِنْ الْمَغْنَمِ وَأَخَذَ عَطِيَّةُ بْنُ قَيْسٍ فَرَسًا عَلَى النِّصْفِ فَبَلَغَ سَهْمُ الْفَرَسِ أَرْبَعَ مِائَةِ دِيْنَارٍ فَأَخَذَ مِائَتَيْنِ وَأَعْطَى صَاحِبَهُ مِائَتَيْنِ হাসান বসরী ও ইবনু সীরীন (রহ.) বলেন, মজদুরকেও গনীমত লব্ধ সম্পদে অংশ দান করা হবে। আতিয়্যা ইবনু কায়েস (রাঃ) এক ব্যক্তি থেকে একটি অশ্ব এ শর্তে গ্রহণ করেন যে, গনীমত লব্ধ সম্পদে প্রাপ্ত অংশ অর্ধেক করে বণ্টিত হবে। তিনি অশ্বটির অংশে চারশ’ দ্বীনার পেয়েছিলেন। তখন তিনি দু’শ দ্বীনার গ্রহণ করেন এবং দু’শ দ্বীনার অশ্বের মালিককে দিয়ে দেন ২৯৭৩. ইয়া‘লা (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি তাবুক যুদ্ধে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে জিহাদে শরীক হই। আমি একটি জওয়ান উট (জিহাদে) আরোহণের জন্য (এক ব্যক্তিকে) দেই। আমার সঙ্গে এটিই ছিল আমার অধিক নির্ভরযোগ্য কাজ। আমি এক ব্যক্তিকে মজুরীর বিনিময়ে নিয়োগ করলাম। তখন সে এক ব্যক্তির সঙ্গে ঝগড়া লেগে যায়, একজন আরেকজনের হাত কামড়ে ধরলে সে তার হাত মুখ হতে সজোরে বের করে আনে। ফলে তার সামনের দাঁত উপড়ে আসে। উক্ত ব্যক্তি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট উপস্থিত হল। তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর দাঁতের কোন প্রতিশোধ গ্রহণ করেননি। আর তিনি বললেন, সে কি তার হাতটিকে তোমার মুখে রেখে দিবে, আর তুমি তাকে উটের মত কামড়াতে থাকবে। (১৮৪৮) (আধুনিক প্রকাশনীঃ ২৭৫২, ইসলামিক ফাউন্ডেশনঃ ২৭৬২)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 2974,
			"arabicnumber": 2974,
			"text": "কায়েস ইবনু সা‘দ আনসারী (রাঃ) হতে বর্ণিত। আর তিনি ছিলেন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর পতাকাবাহী, তিনি হজ্জের সংকল্প করেন, তখন তিনি মাথার চুল আঁচড়ে নিলেন। (মুসলিম ৪৪/৪ হাঃ ২৪০৭, আহমাদ ১৬৫৩৮) (আধুনিক প্রকাশনীঃ ২৭৫৩, ইসলামিক ফাউন্ডেশনঃ ২৭৬৩)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 2975,
			"arabicnumber": 2975,
			"text": "সালামাহ ইবনু আকওয়া‘ (রাঃ) হতে বর্ণিত। তিনি বলেন, খায়বার যুদ্ধে ‘আলী (রাঃ) আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে পেছনে থেকে যান, (কারণ) তাঁর চোখে অসুখ হয়েছিল। তখন তিনি বললেন, আমি কি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে পিছিয়ে থাকব? অতঃপর ‘আলী (রাঃ) বেরিয়ে পড়লেন এবং নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে এসে মিলিত হলেন। যখন সে রাত এল, যে রাত শেষে সকালে ‘আলী (রাঃ) খায়বার জয় করেছিলেন, তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আগাীমকাল আমি এমন এক ব্যক্তিকে পতাকা দিব, কিংবা (বলেন) আগামীকাল এমন এক ব্যক্তি পতাকা গ্রহণ করবে যাকে আল্লাহ্ ও তাঁর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ভালবাসেন। অথবা তিনি বলেছিলেন, যে আল্লাহ্ তাআলা ও তাঁর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে ভালবাসে। আল্লাহ্ তা‘আলা তারই হাতে খায়বার বিজয় দান করবেন। হঠাৎ আমরা দেখতে পেলাম যে, ‘আলী (রাঃ) এসে হাজির, অথচ আমরা তাঁর আগমন আশা করিনি। তারা বললেন, এই যে ‘আলী (রাঃ) চলে এসেছেন। তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে পতাকা প্রদান করলেন। আর আল্লাহ্ তা‘আলা তাঁরই হাতে বিজয় দিলেন। (৩৭০২, ৪২০৯) (আধুনিক প্রকাশনীঃ ২৭৫৪, ইসলামিক ফাউন্ডেশনঃ ২৭৬৪)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 2976,
			"arabicnumber": 2976,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি যুবাইর (রাঃ)-কে বলেছিলেন, এখানেই কি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আপনাকে পতাকা গাড়ার নির্দেশ দিয়েছিলেন? (৪২৮০) (আধুনিক প্রকাশনীঃ ২৭৫৫, ইসলামিক ফাউন্ডেশনঃ ২৭৬৫)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 2977,
			"arabicnumber": 2977,
			"text": "(وَقَوْلِهِ جَلَّ وَعَزَّ )سَنُلْقِيْ فِيْ قُلُوْبِ الَّذِيْنَ كَفَرُوا الرُّعْبَ بِمَآ أَشْرَكُوْا بِاللهِ ( قَالَهُ جَابِرٌ عَنْ النَّبِيِّ صلى الله عليه وسلم মহান আল্লাহর তা‘আলার বাণীঃ আমি কাফিরদের অন্তরে ভীতি প্রবিষ্ট করব। যেহেতু তারা আল্লাহর শরীক করেছে। (আলে ইমরান ১৫১) (এ প্রসঙ্গে) জাবির (রাঃ) আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে হাদীস উদ্ধৃত করেছেন ২৯৭৭. আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, অল্প শব্দে ব্যাপক অর্থবোধক বাক্য বলার শক্তি সহ আমাকে পাঠানো হয়েছে এবং শত্রুর মনে ভীতি সঞ্চারের মাধ্যমে আমাকে সাহায্য করা হয়েছে। একবার আমি নিদ্রায় ছিলাম, তখন পৃথিবীর ধনভান্ডার সমূহের চাবি আমার হাতে দেয়া হয়েছে। আবূ হুরাইরাহ্ (রাঃ) বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তো চলে গেছেন আর তোমরা ওগুলো বাহির করছ। (৬৯৯৮, ৭০১৩, ৭২৭৩) (মুসলিম ৫/৫ হাঃ ৫২৩, আহমাদ ৭৭৫৮) (আধুনিক প্রকাশনীঃ ২৭৫৬, ইসলামিক ফাউন্ডেশনঃ ২৭৬৬)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 2978,
			"arabicnumber": 2978,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তাঁকে আবূ সুফ্ইয়ান জানিয়েছেন, হিরাক্ল আমাকে ডেকে পাঠান। তখন তিনি ইলিয়া নামক স্থানে অবস্থান করছিলেন। অতঃপর সম্রাট আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর পত্রখানি আনতে আদেশ করেন যখন পত্র পাঠ সমাপ্ত হল, তখন বেশ হৈ চৈ ও শোরগোল পড়ে গেল। অতঃপর আমাদেরকে বাইরে নিয়ে আসা হল। যখন আমাদেরকে বের করে দেয়া হচ্ছিল তখন আমি আমার সঙ্গীদের উদ্দেশ্য করে বললাম, আবূ কাবশার পুত্রের[১] ব্যাপারটার গুরুত্ব অনেক বেড়ে গেল। রোমের বাদশাহও তাঁকে ভয় করে। (৭) (আধুনিক প্রকাশনীঃ ২৭৫৭, ইসলামিক ফাউন্ডেশনঃ ২৭৬৭)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 187
			}
		},
		{
			"hadithnumber": 2979,
			"arabicnumber": 2979,
			"text": "(وَقَوْلِ اللهِ تَعَالَى )وَتَزَوَّدُوْا فَإِنَّ خَيْرَ الزَّادِ التَّقْوٰى( আল্লাহ্ তা‘আলার বাণীঃ ‘‘তোমরা পাথেয় সাথে নিও। আর তাকওয়াই হচ্ছে শ্রেষ্ঠ পাথেয়।’’(আল-বাকারাহ ১৯৭) ২৯৭৯. আসমা (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি আবূ বাকর (রাঃ)-এর গৃহে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সফরের সরঞ্জাম গোছগাছ করে দিয়েছিলাম, যখন তিনি মদিনা্য় হিজরাত করার সংকল্প করেছিলেন। আসমা (রাঃ) বলেন, আমি তখন মালপত্র কিংবা পানির মশক বাঁধার জন্য কিছুই পাচ্ছিলাম না। তখন আবূ বাকর (রাঃ)-কে বললাম, আল্লাহর শপথ! আমি আমার কোমর-বন্ধ ছাড়া বাঁধার কিছুই পাচ্ছি না। আবূ বাকর (রাঃ) বললেন, একে দু’ভাগ কর। এক খন্ড দ্বারা মশক এবং অপর খন্ড দ্বারা মালপত্র বেঁধে দাও। আমি তাই করলাম। এজন্যই আমাকে বলা হত দু’ কোমর বন্ধের মালিক। (৩৯০৭, ৫৩৮৮) (আধুনিক প্রকাশনীঃ ২৭৫৮, ইসলামিক ফাউন্ডেশনঃ ২৭৬৮)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 188
			}
		},
		{
			"hadithnumber": 2980,
			"arabicnumber": 2980,
			"text": "জাবির ইবনু ‘আবদুল্লাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমরা আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর যুগে কুরবানীর গোশত মদিনা্ পর্যন্ত পাথেয় হিসেবে গ্রহণ করতাম। (১৭১৯) (আধুনিক প্রকাশনীঃ ২৭৫৯, ইসলামিক ফাউন্ডেশনঃ ২৭৬৯)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 189
			}
		},
		{
			"hadithnumber": 2981,
			"arabicnumber": 2981,
			"text": "সুয়াইদ ইবনু নু‘মান (রাঃ) হতে বর্ণিত। তিনি বলেন যে, খায়বার যুদ্ধে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে তিনি জিহাদে অংশ গ্রহণ করেন। তাঁরা যখন খায়বারের সন্নিকটে অবস্থিত সাহবা নামক স্থানে পৌঁছলেন, তাঁরা সেখানে ‘আসরের সালাত আদায় করলেন। অতঃপর আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খাবার নিয়ে আসতে বললেন। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট যবের ছাতু ছাড়া কিছুই নেয়া হয়নি। আমরা তা পানির সঙ্গে মিশিয়ে আহার করলাম ও পান করলাম। অতঃপর আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উঠে দাঁড়ালেন এবং কুলি করলেন, আমরাও কুলি করলাম ও সালাত আদায় করলাম। (২০৯) (আধুনিক প্রকাশনীঃ ২৭৬০, ইসলামিক ফাউন্ডেশনঃ ২৭৭০)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 190
			}
		},
		{
			"hadithnumber": 2982,
			"arabicnumber": 2982,
			"text": "সালামাহ (ইবনু আকওয়া‘) (রাঃ) হতে বর্ণিত। তিনি বলেন, এক সফরে লোকদের পাথেয় কমে যায় এবং তারা অভাবগ্রস্ত হয়ে পড়েন, তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট হাযির হয়ে তাদের উট যব্হ করার অনুমতি চাইলেন। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদেরকে অনুমতি দিলেন। সে সময় ‘উমার (রাঃ)-এর সঙ্গে তাদের সাক্ষাৎ হল। তারা তাঁকে বিষয়টি জানালো। তিনি বললেন, উট যব্হ করে অতঃপর তোমরা কিরূপে টিকে থাকবে? ‘উমার (রাঃ) রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট এসে বললেন, হে আল্লাহর রাসূল! এ সকল লোক উট যব্হ করে খেয়ে ফেলার পর কিভাবে বাঁচবে? তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, নিজ নিজ অবশিষ্ট পাথেয় নিয়ে হাজির করার জন্য তাদের মধ্যে ঘোষণা দাও। অতঃপর আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খাবারের জন্য বরকতের দু‘আ করলেন। অতঃপর তাদেরকে নিজ নিজ পাত্র নিয়ে হাজির হতে বললেন। তারা তাদের পাত্র ভরে নিতে লাগলো, অবশেষে সকলই নিয়ে নিল। তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, ‘আমি সাক্ষ্য দিচ্ছি যে, আল্লাহ্ ছাড়া প্রকৃত কোন ইলাহ নেই। আর আমি আল্লাহর রাসূল।’ (২৪৮৪) (আধুনিক প্রকাশনীঃ ২৭৬১, ইসলামিক ফাউন্ডেশনঃ ২৭৭২)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 191
			}
		},
		{
			"hadithnumber": 2983,
			"arabicnumber": 2983,
			"text": "জাবির ইবনু ‘আবদুল্লাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমরা এক জিহাদে বের হলাম এবং আমরা সংখ্যায় তিনশ’ ছিলাম। প্রত্যেকে নিজ নিজ পাথেয় নিজেদের কাঁধে বহন করছিলাম। পথে আমাদের পাথেয় নিঃশেষ হয়ে গেল। এমনকি আমরা দৈনিক একটি মাত্র খেজুর খেতে থাকলাম। এক ব্যক্তি জিজ্ঞেস করল, হে আবূ ‘আবদুল্লাহ্! একটি মাত্র খেজুর একজন লোকের কী করে যথেষ্ট হত? তিনি বললেন, যখন আমরা তাও হারালাম তখন এর হারানোটা টের পেলাম। অবশেষে আমরা সমুদ্র তীরে এসে উপস্থিত হলাম। হঠাৎ সমুদ্র একটা বিরাট মাছ কূলে নিক্ষেপ করল। আমরা সে মাছটি মজা করে আঠার দিন পর্যন্ত খেলাম। (২৪৮৩) (আধুনিক প্রকাশনীঃ ২৭৬২, ইসলামিক ফাউন্ডেশনঃ ২৭৭২)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 192
			}
		},
		{
			"hadithnumber": 2984,
			"arabicnumber": 2984,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, ‘হে আল্লাহর রাসূল! আপনার সাহাবীগণ তো হাজ্জ ও ‘উমরাহর সাওয়াব নিয়ে ফিরছেন, আর আমি তো হাজ্জের বেশি কিছুই করতে পারলাম না।’ তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে বললেন, তুমি যাও, ‘আবদুর রহমান তোমাকে তার পেছনে সাওয়ারীতে বসিয়ে নিবে। তিনি ‘আবদুর রহমানকে আদেশ করলেন, তাঁকে তানয়ীম থেকে ‘উমরাহর ইহরাম করিয়ে আনতে। আর আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মক্কা্য় উঁচুভূমিতে তাঁর ফিরে আসা পর্যন্ত অপেক্ষায় থাকলেন। (২৯৪) (আধুনিক প্রকাশনীঃ ২৭৬৩, ইসলামিক ফাউন্ডেশনঃ ২৭৭৩)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 193
			}
		},
		{
			"hadithnumber": 2985,
			"arabicnumber": 2985,
			"text": "‘আবদুর রহমান ইবনু আবূ বাকর সিদ্দীক (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম‘আয়িশাহ (রাঃ)-কে আমার পেছনে বসিয়ে তানয়ীম থেকে ‘উমরাহর ইহরাম করিয়ে আনার জন্য আমাকে নির্দেশ দিয়েছিলেন। (১৭৮৪) (আধুনিক প্রকাশনীঃ ২৭৬৪, ইসলামিক ফাউন্ডেশনঃ ২৭৭৪)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 194
			}
		},
		{
			"hadithnumber": 2986,
			"arabicnumber": 2986,
			"text": "আনাস (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি আবূ ত্বলহা (রাঃ)-এর পেছনে একই সওয়ারীতে উপবিষ্ট ছিলাম। তখন লোকেরা হজ্জ ও ‘উমরাহ পালনের জন্য লাববায়ক ধ্বনি তুলছিল। (১০৮৯) (আধুনিক প্রকাশনীঃ ২৭৬৫, ইসলামিক ফাউন্ডেশনঃ ২৭৭৫)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 195
			}
		},
		{
			"hadithnumber": 2987,
			"arabicnumber": 2987,
			"text": "উসামাহ ইবনু যায়দ (রাঃ) হতে বর্ণিত যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম গাধার পিঠে পালান চাপিয়ে তার উপর চাদর বিছিয়ে তাতে চড়লেন। আর উসামাহ (রাঃ)-কে তাঁর পেছনে বসিয়ে নিলেন। (৪৫৬৬, ৫৬৬৩, ৫৯৬৪, ৬২০৮) (মুসলিম ৩২/৪০, হাঃ ১৭৯৮) (আধুনিক প্রকাশনীঃ ২৭৬৬, ইসলামিক ফাউন্ডেশনঃ ২৭৭৬)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 196
			}
		},
		{
			"hadithnumber": 2988,
			"arabicnumber": 2988,
			"text": "‘আবদুল্লাহ্ (রাঃ) হতে বর্ণিত যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মক্কা বিজয়ের দিন আপন সাওয়ারীর পিঠে নিজের পেছনে উসামাহ ইবনু যায়দ (রাঃ)-কে বসিয়ে মক্কার উঁচু ভূমির দিক থেকে আসলেন। তাঁর সঙ্গে ছিলেন বিলাল (রাঃ) এবং চাবি রক্ষণকারী ‘উসমান ইবনু ত্বলহা। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মসজিদের পার্শ্বে উটটিকে বসালেন। অতঃপর ‘উসমান (রাঃ)-কে কা’বা গৃহের চাবি নিয়ে আসতে আদেশ করলেন। কাবা খুলে দেয়া হল এবং আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ভেতরে প্রবেশ করলেন। তাঁর সঙ্গে ছিলেন উসামাহ, বিলাল ও ‘উসমান (রাঃ)। দিনের দীর্ঘ সময় তিনি সেখানে অবস্থান করলেন। অতঃপর সেখান হতে বেরিয়ে এলেন। এ সময়ে লোকেরা প্রবেশ করার জন্য দৌঁড়িয়ে আসল। সকলের আগে ‘আবদুল্লাহ্ ইবনু ‘উমার (রাঃ) ভেতরে প্রবেশ করলেন এবং বিলাল (রাঃ)-কে দরজার পেছনে দাঁড়ানো দেখতে পেলেন। তিনি তাঁকে জিজ্ঞেস করলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কোন্ স্থানে সালাত আদায় করেছিলেন? ‘আবদুল্লাহ্ (রাঃ) বলেন, আমি তাঁকে একথা জিজ্ঞেস করতে ভুলে গিয়েছিলাম যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কত রাক‘আত সালাত আদায় করেছিলেন? (৩৯৭) (আধুনিক প্রকাশনীঃ ২৭৬৭, ইসলামিক ফাউন্ডেশনঃ ২৭৭৭)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 197
			}
		},
		{
			"hadithnumber": 2989,
			"arabicnumber": 2989,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন যে, মানুষের প্রত্যেক জোড়ার প্রতি সদাকাহ রয়েছে, প্রতি দিন যাতে সূর্য উদিত হয় দু’জন লোকের মধ্যে সুবিচার করাও সদাকাহ, কাউকে সাহায্য করে সাওয়ারীতে আরোহণ করিয়ে দেয়া বা তার উপরে তার মালপত্র তুলে দেয়াও সদাকাহ, ভাল কথাও সদাকাহ, সালাত আদায়ের উদ্দেশে পথ চলায় প্রতিটি কদমেও সদাকাহ, রাস্তা থেকে কষ্টদায়ক বস্তু অপসারণ করাও সদাকাহ। (২৭০৭) (মুসলিম ১২/১৭ হাঃ ১০০৯, আহমাদ ৮১৮৯) (আধুনিক প্রকাশনীঃ ২৭৬৮, ইসলামিক ফাউন্ডেশনঃ ২৭৭৮)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 198
			}
		},
		{
			"hadithnumber": 2990,
			"arabicnumber": 2990,
			"text": "وَكَذَلِكَ يُرْوَى عَنْ مُحَمَّدِ بْنِ بِشْرٍ عَنْ عُبَيْدِ اللهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صلى الله عليه وسلم وَتَابَعَهُ ابْنُ إِسْحَاقَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صلى الله عليه وسلم وَقَدْ سَافَرَ النَّبِيُّ صلى الله عليه وسلم وَأَصْحَابُهُ فِيْ أَرْضِ الْعَدُوِّ وَهُمْ يَعْلَمُوْنَ الْقُرْآنَ একইভাবে মুহাম্মদ ইবনু বিশর (রহ.).....ইবনু ‘উমার (রাঃ)-এর মাধ্যমে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। ‘উবায়দুল্লাহ্ (রহ.)-এর অনুসরণকারী ইবনু ইসহাকও.....ইবনু ‘উমার (রাঃ)-এর মাধ্যমে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে অনুরূপ বর্ণনা করেছেন। অবশ্য আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও তাঁর সাহাবীগণ (রাঃ) শত্রুর ভূখন্ডে সফর করেছেন এবং তাঁরা কুরআন জানতেন ২৯৯০. ‘আবদুল্লাহ্ ইবনু উমর (রাঃ) হতে বর্ণিত যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কুরআন সঙ্গে নিয়ে শত্রু-দেশে সফর করতে নিষেধ করেছেন। (আধুনিক প্রকাশনীঃ ২৭৬৯, ইসলামিক ফাউন্ডেশনঃ ২৭৭৯)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 199
			}
		},
		{
			"hadithnumber": 2991,
			"arabicnumber": 2991,
			"text": "আনাস (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অতি সকালে খায়বার প্রান্তরে প্রবেশ করেন। সে সময় ইয়াহূদীগণ কাঁধে কোদাল নিয়ে বেরিয়ে পড়েছে। তারা যখন তাঁকে দেখতে পেল, তখন বলতে লাগল, মুহাম্মদ সেনাদলসহ আগমন করেছে, মুহাম্মদ সেনাদলসহ আগমন করেছে ফলে তারা দূর্গে ঢুকে পড়ল। তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর উভয় হাত তুলে বললেন, আল্লাহু আকবার, খায়বার ধ্বংস হোক। আমরা যখন কোন সম্প্রদায়ের অঞ্চলে অবতরণ করি, তখন সাবধান করে দেয়া লোকদের সকাল মন্দ হয়। আমরা সেখানে কিছু গাধা পেলাম। অতঃপর আমরা এগুলোর (গোশ্ত) রান্না করলাম। এর মধ্যে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর ঘোষণা দানকারী ঘোষণা দিল, নিশ্চয় আল্লাহ্ তা‘আলা ও তাঁর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তোমাদেরকে গাধার গোশত হতে নিষেধ করেছেন। ডেকগুলো উল্টে দেয়া হল তার সামগ্রীসহ। ‘আলী সুফ্ইয়ান সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর দু’হাত উপরে উঠান বর্ণনায় ‘আবদুল্লাহ্ ইবনু মুহাম্মদ (রহ.)-এর অনুসরণ করেছেন। (৩৭১) (আধুনিক প্রকাশনীঃ ২৭৭০, ইসলামিক ফাউন্ডেশনঃ ২৭৮০)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 200
			}
		},
		{
			"hadithnumber": 2992,
			"arabicnumber": 2992,
			"text": "আবূ মূসা আল-আশ‘আরী (রাঃ) হতে বর্ণিত। তিনি বলেন, এক সফরে আমরা আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে ছিলাম। আমরা যখন কোন উপত্যকায় আরোহণ করতাম, তখন লা-ইলাহা ইল্লাল্লাহ এবং আল্লাহু আকবার বলতাম। আর আমাদের আওয়াজ অতি উঁচু হয়ে যেত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদেরকে বললেন, হে লোক সকল! তোমরা নিজেদের প্রতি সদয় হও। তোমরা তো বধির বা অনুপস্থিত কাউকে ডাকছ না। বরং তিনি তো তোমাদের সঙ্গেই আছেন, তিনি তো শ্রবণকারী ও নিকটবর্তী। (৪২০২, ৬৩৮৪, ৬৪০৯, ৬৬১০, ৭৩৮৬) (মুসলিম ৪৮/১৩ হাঃ ২৭০৪, আহমাদ ১৯৬১৯) (আধুনিক প্রকাশনীঃ ২৭৭১, ইসলামিক ফাউন্ডেশনঃ ২৭৮১)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 201
			}
		},
		{
			"hadithnumber": 2993,
			"arabicnumber": 2993,
			"text": "জাবির ইবনু ‘আবদুল্লাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমরা যখন কোন উঁচু স্থানে আরোহণ করতাম, তখন তাকবীর ধ্বনি উচ্চারণ করতাম আর যখন কোন উপত্যকায় অবতরণ করতাম, সে সময় সুবহানাল্লাহ্ বলতাম। (২৯৯৪) (আধুনিক প্রকাশনীঃ ২৭৭২, ইসলামিক ফাউন্ডেশনঃ ২৭৮২)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 202
			}
		},
		{
			"hadithnumber": 2994,
			"arabicnumber": 2994,
			"text": "জাবির ইবনু ‘আবদুল্লাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমরা যখন উঁচুস্থানে আরোহণ করতাম, তখন আল্লাহু আকবার ধ্বনি উচ্চারণ করতাম আর যখন নিম্ন ভূখন্ডে অবতরণ করতাম, সে সময় সুবহানাল্লাহ্ বলতাম। (২৯৯৩) (আধুনিক প্রকাশনীঃ ২৭৭৩, ইসলামিক ফাউন্ডেশনঃ ২৭৮৩)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 203
			}
		},
		{
			"hadithnumber": 2995,
			"arabicnumber": 2995,
			"text": "‘আবদুল্লাহ্ ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন হজ্জ কিংবা ‘উমরাহ থেকে ফিরতেন, বর্ণনাকারী বলেন, আমি জানি না, নাকি এরূপ বলেছেন যে, যখন জিহাদ থেকে ফিরতেন, তখন তিনি ঘাঁটি অথবা প্রস্তরময় ভূমিতে পৌঁছে তিনবার আল্লাহু আকবার বলতেন। অতঃপর এ দু‘আ পাঠ করতেন, ‘‘আল্লাহ্ ছাড়া কোন ইলাহ নেই; তিনি এক, তাঁর কোন শরীক নেই, কর্তৃত্ব তাঁরই এবং প্রশংসা তাঁরই; তিনি সকল বিষয়ে ক্ষমতাবান। আমরা সফর থেকে প্রত্যাবর্তনকারী, গুনাহ থেকে তাওবাকারী, ‘ইবাদাতকারী, সিজদাকারী, আমাদের প্রতিপালকের প্রশংসাকারী। আল্লাহ্ তা‘আলা তাঁর প্রতিশ্রুতি পূরণ করেছেন, তাঁর বান্দাহকে সাহায্য করেছেন, কাফির সৈন্যদলকে তিনি একাই পরাস্ত করেছেন।’’ সালেহ (রহ.) বলেন, আমি তাকে জিজ্ঞেস করলাম, ‘আবদুল্লাহ্ কি ইনশাআল্লাহ্ বলেননি? তিনি বললেন, না। (১৭৯৭) (আধুনিক প্রকাশনীঃ ২৭৭৪, ইসলামিক ফাউন্ডেশনঃ ২৭৮৪)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 204
			}
		},
		{
			"hadithnumber": 2996,
			"arabicnumber": 2996,
			"text": "আবূ ইসমাঈল আসসাকসাকী বলেন, আবূ বুরদাহ্-কে বলতে শুনেছি, তিনি এবং ইয়াযিদ ইবনু আবূ কাবশা (রাঃ) সফরে ছিলেন। আর ইয়াযিদ (রাঃ) মুসাফির অবস্থায় রোযা রাখতেন। আবূ বুরদাহ (রাঃ) তাঁকে বললেন, আমি আবূ মূসা (আশ‘আরী) (রাঃ)-কে একাধিকবার বলতে শুনেছি, তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যখন বান্দা পীড়িত হয় কিংবা সফরে থাকে, তখন তার জন্য তা-ই লেখা হয়, যা সে আবাসে সুস্থ অবস্থায় ‘আমল করত। (আধুনিক প্রকাশনীঃ ২৭৭৫, ইসলামিক ফাউন্ডেশনঃ ২৭৮৫)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 205
			}
		},
		{
			"hadithnumber": 2997,
			"arabicnumber": 2997,
			"text": "জাবির ইবনু ‘আবদুল্লাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খন্দকের যুদ্ধের দিন লোকদেরকে ডাক দিলেন। যুবাইর (রাঃ) সে ডাকে সাড়া দিলেন, পুনরায় তিনি লোকদেরকে ডাক দিলেন, আবারও যুবাইর (রাঃ) সে ডাকে সাড়া দিলেন। পুনরায় তিনি লোকদেরকে ডাকলেন, এবারও যুবাইর (রাঃ) সে ডাকে সাড়া দিলেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, ‘প্রত্যেক নবীর জন্য একজন বিশেষ সাহায্যকারী থাকে আর আমার বিশেষ সাহায্যকারী হচ্ছে যুবাইর।’ সুফ্ইয়ান (রহ.) বলেন, হাওয়ারী সাহায্যকারীকে বলা হয়। (২৮৪৬) (আধুনিক প্রকাশনীঃ ২৭৭৬, ইসলামিক ফাউন্ডেশনঃ ২৭৮৬)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 206
			}
		},
		{
			"hadithnumber": 2998,
			"arabicnumber": 2998,
			"text": "ইবনু ‘উমার (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেন, যদি লোকেরা একা সফরে কী ক্ষতি আছে তা জানত, যা আমি জানি, তবে কোন আরোহী রাতে একাকী সফর করত না। (আধুনিক প্রকাশনীঃ ২৭৭৭, ইসলামিক ফাউন্ডেশনঃ ২৭৮৭)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 207
			}
		},
		{
			"hadithnumber": 2999,
			"arabicnumber": 2999,
			"text": "قَالَ أَبُوْ حُمَيْدٍ قَالَ النَّبِيُّ صلى الله عليه وسلم إِنِّيْ مُتَعَجِّلٌ إِلَى الْمَدِيْنَةِ فَمَنْ أَرَادَ أَنْ يَتَعَجَّلَ مَعِيْ فَلْيُعَجِّلْ আবূ হুমাইদ (রাঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, আমি দ্রুত মদিনা্য় পৌঁছতে চাই, কাজেই যে ব্যক্তি আমার সঙ্গে জলদি যেতে চায় সে যেন জলদি চলে। ২৯৯৯. হিশাম (রহ.) হতে বর্ণিত। তিনি বলেন, আমার পিতা বর্ণনা করেছেন যে, উসামাহ ইবনু যায়দ (রাঃ)-কে জিজ্ঞেস করা হয়েছিল যে, বিদায় হজ্জে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কেমন গতিতে পথ চলেছিলেন। রাবী ইয়াহয়া (রাঃ) বলতেন, ‘উরওয়াহ (রহ.) বলেন, ‘‘আমি শুনতেছিলাম, তবে আমার বর্ণনায় তা ছুটে গেছে। উসামাহ (রহ.) বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সহজ দ্রুতগতিতে চলতেন আর যখন প্রশস্ত ফাঁকা জায়গা পেতেন, তখন দ্রুত চলতেন। নাস হচ্ছে সহজ গতির চেয়ে দ্রুততর চলা। (১৬৬৬) (আধুনিক প্রকাশনীঃ ২৭৭৮, ইসলামিক ফাউন্ডেশনঃ ২৭৮৮)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 208
			}
		},
		{
			"hadithnumber": 3000,
			"arabicnumber": 3000,
			"text": "আসলাম (রহ.) হতে বর্ণিত। তিনি বলেন, আমি মক্কার পথে ‘আবদুল্লাহ্ ইবনু ‘উমার (রাঃ)-এর সঙ্গে ছিলাম। পথে তাঁর নিকট সাফিয়্যাহ বিনতু আবূ ‘উবাইদ (রাঃ)-এর ভীষণ অসুস্থতার সংবাদ পৌঁছে। তখন তিনি দ্রতগতিতে চলতে থাকেন। এমনকি যখন সূর্যাস্তের পরে লালিমা কেটে গেল, তখন তিনি উট থেকে নেমে মাগরিব ও এশার সালাত একত্রে আদায় করেন। আর ‘আবদুল্লাহ্ ইবনু ‘উমার (রাঃ) বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে দেখেছি, যখন তাঁর দ্রুত গতিতে চলার প্রয়োজন দেখা দিত, তখন তিনি মাগরিবকে বিলম্বিত করে মাগরিব ও এশার উভয় সালাত একত্রে আদায় করতেন। (১০৯১) (আধুনিক প্রকাশনীঃ ২৭৭৯, ইসলামিক ফাউন্ডেশনঃ ২৭৮৯)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 209
			}
		},
		{
			"hadithnumber": 3001,
			"arabicnumber": 3001,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, সফর আযাবের একটি অংশ। যা তোমাদেরকে নিদ্রা, আহার ও পান থেকে বিরত রাখে। কাজেই তোমাদের প্রত্যেকেই যেন নিজের কাজ সেরে তার পরিজনের নিকট দ্রুত চলে আসে। (১৮০৪) (আধুনিক প্রকাশনীঃ ২৭৮০, ইসলামিক ফাউন্ডেশনঃ ২৭৯০)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 210
			}
		},
		{
			"hadithnumber": 3002,
			"arabicnumber": 3002,
			"text": "‘আবদুল্লাহ্ ইবনু ‘উমার (রাঃ) হতে বর্ণিত যে, ‘উমার ইবনু খাত্তাব (রাঃ) আল্লাহর রাহে আরোহণের জন্য একটি ঘোড়া দান করেন। অতঃপর তিনি সে ঘোড়াটিকে বিক্রি হতে দেখতে পান। তিনি তা কিনে নিতে ইচ্ছা করলেন এবং আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট এ বিষয়ে জিজ্ঞেস করলেন। তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তুমি ওটা কিনিও না এবং তোমার দেয়া সদাকাহ ফেরত নিও না। (১৪৮৯) (আধুনিক প্রকাশনীঃ ২৭৮১, ইসলামিক ফাউন্ডেশনঃ ২৭৯১)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 211
			}
		},
		{
			"hadithnumber": 3003,
			"arabicnumber": 3003,
			"text": "‘উমার ইবনু খাত্তাব (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি আল্লাহর রাহে একটি ঘোড়া দান করি। সে ওটা বিক্রি করতে চেয়েছিল কিংবা যার নিকট সেটা ছিল সে তাকে বিনষ্ট করার উপক্রম করেছিল। আমি ঘোড়াটি কেনার ইচ্ছা করলাম। আর আমি ধারণা করেছিলাম যে, সে তাকে সস্তায় বিক্রি করে দিবে। আমি এ বিষয়ে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট জিজ্ঞেস করলাম, তিনি বললেন, তুমি ওটা ক্রয় কর না, যদিও তা একটি মাত্র দিরহামের বিনিময়ে হয়। কেননা সদাকাহ করার পর ফেরত গ্রহণকারী এমন কুকুরের মত, যে বমি করে আবার তা ভক্ষণ করে। (১৪৯০) (আধুনিক প্রকাশনীঃ ২৭৮২, ইসলামিক ফাউন্ডেশনঃ ২৭৯২)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 212
			}
		},
		{
			"hadithnumber": 3004,
			"arabicnumber": 3004,
			"text": "‘আবদুল্লাহ্ ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, এক ব্যক্তি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট এসে জিহাদে যাবার অনুমতি প্রার্থনা করল। তখন তিনি বললেন, তোমার পিতামাতা জীবিত আছেন কি? সে বলল, হ্যাঁ। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, ‘তবে তাঁদের খিদমতের চেষ্টা কর।’ (৫৯৭২) (মুসলিম ৪৫/১ হাঃ ২৫৪৯, আহমাদ ৬৭৭৯) (আধুনিক প্রকাশনীঃ ২৭৮৩, ইসলামিক ফাউন্ডেশনঃ ২৭৯৩)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 213
			}
		},
		{
			"hadithnumber": 3005,
			"arabicnumber": 3005,
			"text": "আবূ বাশীর আল-আনসারী (রাঃ) হতে বর্ণিত। তিনি বলেন, কোন এক সফরে তিনি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে ছিলেন। (রাবী) ‘আবদুল্লাহ্ বলেন, আমার মনে হয়, তিনি (আবূ বাশীর আনসারী) বলেছেন যে, মানুষ শয্যায় ছিল। তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একজন সংবাদ বহনকারীকে পাঠালেন যে, কোন উটের গলায় যেন ধনুকের রশির মালা কিংবা মালা না ঝুলে, আর ঝুললে তা যেন কেটে ফেলা হয়।১ (মুসলিম ৩৭/২৮ হাঃ ২১১৫, আহমাদ ২১৯৪৬) (আধুনিক প্রকাশনীঃ ২৭৮৪, ইসলামিক ফাউন্ডেশনঃ ২৭৯৪)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 214
			}
		},
		{
			"hadithnumber": 3006,
			"arabicnumber": 3006,
			"text": "ইবনু ‘আব্বাস (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণিত, তিনি বলেন, কোন পুরুষ যেন অপর মহিলার সঙ্গে নিভৃতে অবস্থান না করে, কোন স্ত্রীলোক যেন কোন মাহরাম সঙ্গী ছাড়া সফর না করে। এক ব্যক্তি দাঁড়িয়ে বলল, হে আল্লাহর রাসূল! অমুক যুদ্ধের জন্য আমার নাম লেখা হয়েছে। কিন্তু আমার স্ত্রী হাজ্জযাত্রী। তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, ‘তবে যাও তোমার স্ত্রীর সঙ্গে হাজ্জ কর।’ (১৮৬২) (আধুনিক প্রকাশনীঃ ২৭৮৫, ইসলামিক ফাউন্ডেশনঃ ২৭৯৫)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 215
			}
		},
		{
			"hadithnumber": 3007,
			"arabicnumber": 3007,
			"text": "(وَقَوْلِ اللهِ تَعَالَى )لَا تَتَّخِذُوْا عَدُوِّيْ وَعَدُوَّكُمْ أَوْلِيَآءَ ( التَّجَسُّسُ التَّبَحُّثُ আর আল্লাহ্ তা‘আলার বাণীঃ তোমরা আমার শত্রু ও তোমাদের শত্রুকে বন্ধুরূপে গ্রহণ করো না। (মুমতাহিনাহ ১) التَّجَسُّسُ অর্থ হচ্ছে খোঁজ-খবর নেয়া। ৩০০৭. ‘আলী (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে এবং যুবায়র ও মিকদাদ ইবনু আসওয়াদ (রাঃ)-কে পাঠিয়ে বললেন, ‘তোমরা খাখ্ বাগানে যাও। সেখানে তোমরা এক মহিলাকে দেখতে পাবে। তার নিকট একটি পত্র আছে, তোমরা তার কাছ থেকে তা নিয়ে আসবে।’ তখন আমরা রওনা দিলাম। আমাদের ঘোড়া আমাদের নিয়ে দ্রুত বেগে চলছিল। অবশেষে আমরা উক্ত খাখ্ নামক বাগানে পৌঁছে গেলাম এবং সেখানে আমরা মহিলাটিকে দেখতে পেলাম। আমরা বললাম, ‘পত্র বাহির কর।’ সে বলল, ‘আমার নিকট তো কোন পত্র নেই।’ আমরা বললাম, ‘তুমি অবশ্যই পত্র বের করে দিবে, নচেৎ তোমার কাপড় খুলতে হবে।’ তখন সে তার চুলের খোঁপা থেকে পত্রটি বের করে দিল। আমরা তখন সে পত্রটি নিয়ে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট হাজির হলাম। দেখা গেল, তা হাতিব ইবনু বালতাআ (রাঃ)-এর পক্ষ থেকে মক্কার কয়েকজন মুশরিকের প্রতি লেখা হয়েছে। যাতে তাদেরকে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কোন পদক্ষেপ সম্পর্কে সংবাদ দেয়া হয়েছে। তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, ‘হে হাতিব! একি ব্যাপার?’ তিনি বললেন, ‘হে আল্লাহর রাসূল! আমার ব্যাপারে কোন তড়িত সিদ্ধান্ত গ্রহণ করবেন না। আসলে আমি কুরাইশ বংশোদ্ভূত নই। তবে তাদের সঙ্গে মিশে ছিলাম। আর যারা আপনার সঙ্গে মুহাজিরগণ রয়েছেন, তাদের সকলেরই মক্কাবাসীদের সঙ্গে আত্মীয়তার সম্পর্ক রয়েছে। যার কারণে তাঁদের পরিবার-পরিজন ও ধন-সম্পদ নিরাপদ। তাই আমি চেয়েছি, যেহেতু আমার বংশগতভাবে এ সম্পর্ক নেই, কাজেই আমি তাদের প্রতি এমন কিছু অনুগ্রহ দেখাই, যদ্দবারা অন্তত তারা আমার আপন জনদের রক্ষা করবে। আর আমি তা কুফরী কিংবা মুরতাদ হবার উদ্দেশ্যে করিনি এবং কুফরীর প্রতি আকৃষ্ট হবার কারণেও নয়।’ আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, ‘হাতিব তোমাদের নিকট সত্য কথা বলছে।’ তখন ‘উমার (রাঃ) বললেন, ‘হে আল্লাহর রাসূল! আমাকে অনুমতি দিন, আমি এই মুনাফিকের গর্দান উড়িয়ে দেই।’ আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, ‘সে বাদার যুদ্ধে অংশগ্রহণ করেছে। তোমার হয়ত জানা নেই, আল্লাহ্ তা‘আলা বাদার যুদ্ধে অংশ গ্রহণকারীদের ব্যাপারে অবহিত আছেন। তাই তাদের উদ্দেশ্য করে বলেছেন, তোমরা যা ইচ্ছা আমল কর। আমি তোমাদেরকে ক্ষমা করে দিয়েছি।’ সুফ্ইয়ান (রহ.) বলেন এ সনদটি খুবই উত্তম। (৩০৮১, ৩৯৮৩, ৪২৭৪, ৪৮৯০, ৬২৫৯, ৬৯৩৯) (মুসলিম ৪৪/৩৬ হাঃ ২৪৯৪, আহমাদ ৬০০) (আধুনিক প্রকাশনীঃ ২৭৮৬, ইসলামিক ফাউন্ডেশনঃ ২৭৯৬)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 216
			}
		},
		{
			"hadithnumber": 3008,
			"arabicnumber": 3008,
			"text": "জাবির ইবনু ‘আবদুল্লাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, যখন বাদার যুদ্ধের দিন কাফির বন্দীদেরকে হাযির করা হল এবং ‘আব্বাস (রাঃ)-কেও আনা হল তখন তাঁর শরীরে পোশাক ছিল না। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর শরীরের জন্য উপযোগী জামা খুঁজতে গিয়ে দেখতে পেলেন, ‘আবদুল্লাহ ইবনু উবাই এর জামা তাঁর গায়ের উপযুক্ত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সে জামাটি তাঁকেই পরিয়ে দিলেন। এ কারণেই নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিজের জামা খুলে ‘আবদুল্লাহ্ ইবনু উবাইকে (মৃত্যুর পর) পরিয়ে দিয়েছিলেন। ইবনু ‘উয়াইনাহ্ (রাঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর প্রতি ‘আবদুল্লাহ্ ইবনু ‘উবাই-এর এটি সৌজন্য ছিল, তাই তিনি তার প্রতিদান দিতে চেয়েছিলেন। (আধুনিক প্রকাশনীঃ ২৭৮৭, ইসলামিক ফাউন্ডেশনঃ ২৭৯৭)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 217
			}
		},
		{
			"hadithnumber": 3009,
			"arabicnumber": 3009,
			"text": "সাহল (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খায়বার যুদ্ধের দিন বলেন, আগামীকাল আমি এমন এক ব্যক্তির হাতে পতাকা দিব, যার হাতে আল্লাহ্ তা‘আলা বিজয় দিবেন। সে আল্লাহ্ তা‘আলা ও তাঁর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে ভালবাসে, আর আল্লাহ্ তা‘আলা ও তাঁর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লামও তাকে ভালবাসেন। লোকেরা সারা রাত কাটিয়ে দেয় যে, কাকে এ পতাকা দেয়া হয়? আর পরদিন সকালে প্রত্যেকেই সেটা পাবার আকাঙ্ক্ষা পোষণ করে। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, ‘আলী কোথায়? বলা হল, তাঁর চোখে অসুখ। তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর চোখে আপন মুখের লালা লাগিয়ে দিলেন এবং তাঁর জন্য দু‘আ করলেন। তাতে তিনি আরোগ্য লাভ করলেন। যেন তাঁর চোখে কোন অসুবিধাই ছিল না। অতঃপর আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর হাতে পতাকা দিলেন। ‘আলী (রাঃ) জিজ্ঞেস করলেন, আমি তাদের সঙ্গে ততক্ষণ যুদ্ধ চালিয়ে যাব যতক্ষণ না তারা আমাদের মত হয়ে যায়। তিনি (রাসূলুল্লাহ) বললেন, ‘তুমি স্বাভাবিকভাবে এগিয়ে গিয়ে তাদের আঙিণায় অবতরণ কর। অতঃপর তাদেরকে ইসলামের প্রতি আহবান কর এবং ইসলাম গ্রহণ করার পর তাদের জন্য যা আবশ্যকীয় তা তাদেরকে জানিয়ে দাও। আল্লাহর শপথ! আল্লাহ্ তা‘আলা যদি তোমার মাধ্যমে কোন ব্যক্তিকে হিদায়াত দান করেন, তবে তা তোমার জন্য রক্তিম বর্ণের উট পাওয়ার চেয়ে উত্তম। (২৯৪২) (আধুনিক প্রকাশনীঃ ২৭৮৮, ইসলামিক ফাউন্ডেশনঃ ২৭৯৮)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 218
			}
		},
		{
			"hadithnumber": 3010,
			"arabicnumber": 3010,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহ্ তা‘আলা সে সকল লোকের উপর সন্তুষ্ট হন, যারা শৃঙ্খলিত অবস্থায় জান্নাতে দাখিল হবে। (৪৫৫৭) (আধুনিক প্রকাশনীঃ ২৭৮৯, ইসলামিক ফাউন্ডেশনঃ ২৭৯৯)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 219
			}
		},
		{
			"hadithnumber": 3011,
			"arabicnumber": 3011,
			"text": "আবূ বুরদাহ (রহ.) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তিন প্রকার লোককে দ্বিগুণ নেকী দান করা হবে। যে ব্যক্তির একটি বাঁদী আছে, সে তাকে শিক্ষা দান করে, উত্তমরূপে শিক্ষা দান করে, আদব শিক্ষা দেয় এবং তাকে উত্তমরূপে শিষ্টাচার শিক্ষা দান করে। অতঃপর তাকে আযাদ করে দিয়ে তাকে বিবাহ করে। সে ব্যক্তির জন্য দ্বিগুণ নেকী রয়েছে। আর আহলে কিতাবদের মধ্য থেকে মু’মিন ব্যক্তি যে তার নবীর প্রতি ঈমান এনেছিল। অতঃপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর প্রতি ঈমান এনেছে। তার জন্য দ্বিগুণ নেকী রয়েছে। আর যে গোলাম আল্লাহর হক যথাযথভাবে আদায় করে এবং নিজ মনিবের দেয়া দায়িত্বও সঠিকরূপে পালন করে, (তার জন্যও দ্বিগুণ নেকী রয়েছে) শা‘বী (রহ.) এ হাদীসটি বর্ণনা করে সালেহকে উদ্দেশ্য করে বলেন, আমি তোমাকে এ হাদীসটি কোন বিনিময় ব্যতীতই শুনিয়েছি। অথচ এর চেয়ে সহজ হাদীস শোনার জন্য লোকেরা মদিনা্ পর্যন্ত সফর করতেন। (৯৭) (আধুনিক প্রকাশনীঃ ২৭৯০, ইসলামিক ফাউন্ডেশনঃ ২৮০০)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 220
			}
		},
		{
			"hadithnumber": 3012,
			"arabicnumber": 3012,
			"text": "بَيَاتًا : لَيْلاً لَنُبَيِّتَنَّهُ لَيْلاً يُبَيَّتُ : لَيْلاً পবিত্র কুরআনে উল্লেখিতبَيَاتًا এবং يُبَيَّتশব্দগুলোর দ্বারা রাতের সময় বুঝানো হয়েছে। ৩০১২. সা‘ব ইবনু জাসসামাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আবওয়া অথবা ওয়াদ্দান নামক স্থানে আমার কাছ দিয়ে অতিক্রম করেন। তখন তাঁকে জিজ্ঞেস করা হল, যে সকল মুশরিকদের সঙ্গে যুদ্ধ হচ্ছে, যদি রাত্রিকালীন আক্রমণে তাদের মহিলা ও শিশুরা নিহত হয়, তবে কী হবে? আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, তারাও তাদেরই অন্তর্ভুক্ত। আর আমি তাকে আরো বলতে শুনেছি যে, সংরক্ষিত চারণভূমি আল্লাহ্ তা‘আলা ও তাঁর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ছাড়া অন্য কারো জন্য হতে পারে না। (মুসলিম ৩২/৯ হাঃ ১৭৪৫, আহমাদ ১৬৪২৬) (আধুনিক প্রকাশনীঃ ২৭৯১, ইসলামিক ফাউন্ডেশনঃ ২৮০১)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 221
			}
		},
		{
			"hadithnumber": 3013,
			"arabicnumber": 3013,
			"text": "স‘আব হতে মুশরিকদের সন্তান সম্পর্কে বর্ণিত ‘আমর ইবনু শিহাবের সূত্রে নবী হতে বর্ণনা করেছেন। . . . . . . . স‘আব বলেন, তারা তাদেরই অন্তর্ভুক্ত। ‘আমর একথা বলেননি যে, তারা তাদের পিতামাতাদের অর্ন্তভূক্ত। (আধুনিক প্রকাশনীঃ নাই, ইসলামিক ফাউন্ডেশনঃ নাই) (২৩৭০, মুসলিম ৩২/৯ হাঃ ১৭৪৫)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 222
			}
		},
		{
			"hadithnumber": 3014,
			"arabicnumber": 3014,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর এক যুদ্ধে এক নারীকে নিহত অবস্থায় পাওয়া যায়। তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নারী ও শিশুদের হত্যায় অসন্তোষ প্রকাশ করেন। (৩০১৫) (মুসলিম ৩২/৮ হাঃ ১৭৪৪) (আধুনিক প্রকাশনীঃ ২৭৯২, ইসলামিক ফাউন্ডেশনঃ ২৮০২)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 223
			}
		},
		{
			"hadithnumber": 3015,
			"arabicnumber": 3015,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কোন এক যুদ্ধে জনৈকা মহিলাকে নিহত অবস্থায় পাওয়া যায়। তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মহিলা ও শিশুদের হত্যা করতে নিষেধ করেন। (৩০১৪) (আধুনিক প্রকাশনীঃ ২৭৯৩, ইসলামিক ফাউন্ডেশনঃ ২৮০৩)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 224
			}
		},
		{
			"hadithnumber": 3016,
			"arabicnumber": 3016,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদেরকে এক অভিযানে প্রেরণ করেন এবং বলেন, ‘তোমরা যদি অমুক ও অমুক ব্যক্তিকে পাও, তবে তাদের উভয়কে আগুনে জ্বালিয়ে ফেলবে।’ অতঃপর আমরা যখন বের হতে চাইলাম, তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, ‘আল্লাহ ছাড়া কেউ আগুন দিয়ে শাস্তি দিতে পারবে না। কাজেই তোমরা যদি তাদের উভয়কে পাও, তবে তাদেরকে হত্যা কর।’ (২৯৫৪) (আধুনিক প্রকাশনীঃ ২৭৯৪, ইসলামিক ফাউন্ডেশনঃ ২৮০৪)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 225
			}
		},
		{
			"hadithnumber": 3017,
			"arabicnumber": 3017,
			"text": "ইকরামাহ (রহ.) হতে বর্ণিত। ‘আলী (রাঃ) এক সম্প্রদায়কে আগুনে পুড়িয়ে ফেলেন। এ সংবাদ ‘আবদুল্লাহ্ ইবনু ‘আব্বাস (রাঃ)-এর নিকট পৌঁছলে তিনি বলেন, ‘যদি আমি হতাম, তবে আমি তাদেরকে জ্বালিয়ে ফেলতাম না। কেননা, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমরা আল্লাহর আযাব দ্বারা কাউকে আযাব দিবে না। বরং আমি তাদেরকে হত্যা করতাম। যেমন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যে লোক তার দ্বীন বদলে ফেলে, তাকে হত্যা করে ফেল।’ (৬৯২২) (আধুনিক প্রকাশনীঃ ২৭৯৫, ইসলামিক ফাউন্ডেশনঃ ২৮০৫)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 226
			}
		},
		{
			"hadithnumber": 3018,
			"arabicnumber": 3018,
			"text": "بَابُ فَإِمَّا مَنًّام بَعْدُ وَإِمَّا فِدَآءً ৫৬/১৫০. অধ্যায় : (বন্দী সম্পর্কে আল্লাহ্ বলেন) তারপর হয় তাদের প্রতি অনুগ্রহ কর অথবা মুক্তিপণ নিয়ে ছেড়ে দাও- যে পর্যন্ত না যুদ্ধবাজ শত্রুপক্ষ অস্ত্র সমর্পণ করে। (মুহাম্মাদ ৪) فِيْهِ حَدِيْثُ ثُمَامَةَ وَقَوْلُهُ عَزَّ وَجَلَّ )مَا كَانَ لِنَبِيٍّ أَنْ تَكُوْنَ لَهُ أَسْرٰى حَتّٰى يُثْخِنَ فِي الْأَرْضِ ( يَعْنِيْ يَغْلِبَ فِي الأَرْضِ) تُرِيْدُوْنَ عَرَضَ الدُّنْيَا ( الْآيَةَ এ প্রসঙ্গে সুমামাহ (রাঃ) বর্ণিত হাদীসটি রয়েছে আর আল্লাহ্ তা‘আলার বাণীঃ কোন নবীর পক্ষে সমীচীন নয় বন্দীদেরকে নিজের কাছে রাখা যতক্ষণ পর্যন্ত না দেশে পুরোপুরিভাবে শত্রুকে পরাভূত করা হয়। তোমরা তো পার্থিব ধন-সম্পদ কামনা কর। (আল-আনফালঃ ৬৭) 56/151. بَابُ هَلْ لِلأَسِيْرِ أَنْ يَقْتُلَ وَيَخْدَعَ الَّذِيْنَ أَسَرُوْهُ حَتَّى يَنْجُوَ مِنْ الْكَفَرَةِ ৫৬/১৫১. অধ্যায় : কোন মুসলিম বন্দী কুফরীর বন্দীদশা হতে মুক্তির জন্য বন্দীকারীকে হত্যা বা কোন কৌশল অবলম্বন করবে কি? فِيْهِ الْمِسْوَرُ عَنْ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ এ প্রসঙ্গে মিসওয়ার (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে হাদীস বর্ণিত আছে। ৩০১৮. আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত যে, ‘উক্ল নামক গোত্রের আট ব্যক্তির একটি দল নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট এল। মদিনার আবহাওয়া তারা উপযোগী মনে করেনি। তারা বলল, হে আল্লাহর রাসূল! আমাদের জন্য দুগ্ধবতী উটনীর ব্যবস্থা করুন। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তোমরা বরং সদাকাহর উটের পালের নিকট যাও। তারা সেখানে গিয়ে সেগুলোর পেশাব ও দুধ পান করে সুস্থ এবং মোটাতাজা হয়ে গেল। অতঃপর তারা উটের রাখালকে হত্যা করে উটের পাল হাঁকিয়ে নিয়ে গেল এবং মুসলিম হবার পর তারা মুরতাদ হয়ে গেল। তখন এক সংবাদ দাতা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট উপস্থিত হল। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঘোড়-সওয়ারদেরকে তাদের সন্ধানে পাঠালেন। তখন পর্যন্ত দিনের আলো প্রকাশ পায়নি ‘সে সময় তাদেরকে নিয়ে আসা হল। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের হাত পা কেটে ফেললেন। অতঃপর তাঁর নির্দেশে লৌহ শলাকা গরম করে তাদের চোখে ঢুকানো হয় এবং তাদেরকে উত্তপ্ত ভূমিতে ফেলে রাখা হয়। তারা পানি চেয়েছিল কিন্তু তাদেরকে পানি দেয়া হয়নি। অবশেষে তাদের মৃত্যু ঘটে। আবূ কিলাবা (রাঃ) বলেন, তারা হত্যা করেছে, চুরি করেছে, আল্লাহ্ তা‘আলা ও তাঁর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে যুদ্ধ করেছে এবং পৃথিবীতে ফাসাদ ছড়িয়ে দিতে চেষ্টা করেছে। (২৩৩) (আধুনিক প্রকাশনীঃ ২৭৯৬, ইসলামিক ফাউন্ডেশনঃ ২৮০৬)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 227
			}
		},
		{
			"hadithnumber": 3019,
			"arabicnumber": 3019,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি যে, কোন একজন নবীকে একটি পিপীলিকা কামড় দেয়। তিনি পিপীলিকার সমগ্র আবাসটি জ্বালিয়ে দেয়ার আদেশ করেন এবং তা জ্বালিয়ে দেয়া হয়। আল্লাহ্ তা‘আলা তাঁর প্রতি ওয়াহী অবতীর্ণ করেন, তোমাকে একটি পিপীলিকা কামড় দিয়েছে আর তুমি আল্লাহর তাসবীহকারী একটি জাতিকে জ্বালিয়ে দিয়েছ। (৩৩১৯) (মুসলিম ৩৯/৩৯ হাঃ ২২১৪, ) (আধুনিক প্রকাশনীঃ ২৭৯৭, ইসলামিক ফাউন্ডেশনঃ ২৮০৭)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 228
			}
		},
		{
			"hadithnumber": 3020,
			"arabicnumber": 3020,
			"text": "জারীর (রাঃ) হতে বর্ণিত। তিনি বলেন, আমাকে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তুমি কি আমাকে যুলখালাসার ব্যাপারে শান্তি দিবে না? খাশ‘আম গোত্রের একটি মূর্তি ঘর ছিল। যাকে ইয়ামানের কা‘বা নামে আখ্যায়িত করা হত। জারীর (রাঃ) বলেন, তখন আমি আহমাসের দেড়শ’ অশ্বারোহীকে সঙ্গে নিয়ে রওয়ানা করলাম। তারা সূদক্ষ অশ্বারোহী ছিল। জারীর (রাঃ) বলেন, আর আমি অশ্বের উপর স্থির থাকতে পারতাম না। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার বুকে এমনভাবে আঘাত করলেন যে, আমি আমার বুকে তাঁর অঙ্গুলির চিহ্ন দেখতে পেলাম এবং তিনি আমার জন্য এ দু‘আ করলেন, ‘হে আল্লাহ্! তাকে স্থির রাখুন এবং হিদায়াত প্রাপ্ত, পথ প্রদর্শনকারী করুন।’ অতঃপর জারীর (রাঃ) সেখানে যান এবং যুলখালাসা মন্দির ভেঙ্গে ফেলেন ও জ্বালিয়ে দেন। অতঃপর আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে এ খবর দেখার জন্য এক ব্যক্তিকে তাঁর নিকট প্রেরণ করেন। তখন জারীর (রাঃ)-এর দূত বলতে লাগল, কসম সে মহান আল্লাহ্ তা‘আলার! যিনি আপনাকে সত্যসহ প্রেরণ করেছেন, আমি আপনার নিকট তখনই এসেছি যখন যুলখালাসাকে আমরা ধ্বংস করে দিয়েছি। যুলখালাসার মন্দিরটি যে পাঁচড়া যুক্ত উটের মত। জারীর (রাঃ) বলেন, অতঃপর আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আহমাসের অশ্ব ও অশ্বারোহীদের জন্য পাঁচবার বরকতের দু‘আ করেন। (৩০৩৬, ৩০৭৬, ৩৮২৩, ৪৩৫৫, ৪৩৫৬, ৪৩৫৭, ৬০৮৯, ৬৩৩৩) (মুসলিম ৪৪/২৯ হাঃ ২৪৭৬) (আধুনিক প্রকাশনীঃ ২৭৯৮, ইসলামিক ফাউন্ডেশনঃ ২৮০৮)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 229
			}
		},
		{
			"hadithnumber": 3021,
			"arabicnumber": 3021,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বনী নাযীরের খেজুর বাগান জ্বালিয়ে দিয়েছিলেন। (২৩২৬) (আধুনিক প্রকাশনীঃ ২৭৯৯, ইসলামিক ফাউন্ডেশনঃ ২৮০৯)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 230
			}
		},
		{
			"hadithnumber": 3022,
			"arabicnumber": 3022,
			"text": "বারআ ইবনু ‘আযিব (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আনসারদের একটি দল আবূ রাফি‘ ইয়াহূদীকে হত্যা করার জন্য প্রেরণ করেন। তাঁদের মধ্য থেকে একজন এগিয়ে গিয়ে ইয়াহূদীদের দূর্গে প্রবেশ করল। তিনি বলেন, অতঃপর আমি তাদের পশুর আস্তাবলে প্রবেশ করলাম। অতঃপর তারা দূর্গের দরজা বন্ধ করে দিল। তারা তাদের একটি গাধা হারিয়ে ফেলেছিল এবং তার খোঁজে তারা বেরিয়ে পড়ে। আমিও তাদের সঙ্গে বেরিয়ে গেলাম। তাদেরকে আমি জানাতে চেয়েছিলাম যে, আমি তাদের সঙ্গে গাধার খোঁজ করছি। অবশেষে তারা গাধাটি পেল। তখন তারা দূর্গে প্রবেশ করে এবং আমিও প্রবেশ করলাম। রাতে তারা দুর্গের দরজা বন্ধ করে দিল। আর তারা চাবিগুলো একটি কুলুঙ্গীর মধ্যে রাখল। আমি তা দেখতে পেলাম। যখন তারা ঘুমিয়ে পড়ল, আমি চাবিগুলো নিয়ে নিলাম এবং দূর্গের দরজা খুললাম। অতঃপর আমি আবূ রাফি‘র নিকট পৌঁছলাম এবং বললাম, হে আবূ রাফে! সে আমার ডাকে সাড়া দিল। তখন আমি আওয়াজের প্রতি লক্ষ্য করে তরবারীর আঘাত হানলাম, অমনি সে চিৎকার দিয়ে উঠল। আমি বেরিয়ে এলাম। আমি আবার প্রবেশ করলাম, যেন আমি তার সাহায্যের জন্য এগিয়ে এসেছি। আর আমি আমার গলার স্বর পরিবর্তন করে বললাম, হে আবূ রাফি‘! সে বলল, তোমার কী হল, তোমার মা ধ্বংস হোক। আমি বললাম, তোমার কী অবস্থা? সে বলল, আমি জানি না, কে বা কারা আমার এখানে এসেছিল এবং আমাকে আঘাত করেছে। রাবী বলেন, অতঃপর আমি আমার তরবারী তার পেটের উপর রেখে সব শক্তি দিয়ে চেপে ধরলাম, ফলে তার হাড় পর্যন্ত ঠেকার আওয়াজ হল। অতঃপর আমি ভীত-শংকিত অবস্থায় বের হয়ে এলাম। আমি অবতরণের উদ্দেশ্যে তাদের সিঁড়ির নিকট এলাম। যখন আমি পড়ে গেলাম, তখন এতে আমার পায়ে আঘাত লাগল। আমি আমার সাথীদের সঙ্গে এসে মিলিত হলাম। আমি তাদেরকে বললাম, আমি এখান হতে ততক্ষণ পর্যন্ত যাব না, যতক্ষণ না আমি মৃত্যুর সংবাদ প্রচারকারিণীর আওয়াজ শুনতে পাই। হিজাযবাসী বণিক আবূ রাফি‘র মৃত্যুর ঘোষণা না শোনা পর্যন্ত আমি সে স্থান ত্যাগ করলাম না। তিনি বললেন, তখন আমি দাঁড়িয়ে গেলাম এবং আমার তখন কোন ব্যথাই ছিল না। অবশেষে আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট পৌঁছে তাঁকে খবর জানালাম। (৩০২৩, ৪০৩৮, ৪০৩৯, ৪০৪০) (আধুনিক প্রকাশনীঃ ২৮০০, ইসলামিক ফাউন্ডেশনঃ ২৮১০)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 231
			}
		},
		{
			"hadithnumber": 3023,
			"arabicnumber": 3023,
			"text": "বারআ ইবনু ‘আযিব (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আনসারীদের একদলকে আবূ রাফি‘ ইয়াহূদীর নিকট প্রেরণ করেন। তখন ‘আবদুল্লাহ্ ইবনু ‘আতীক (রাঃ) রাত্রিকালে তার ঘরে ঢুকে তাকে হত্যা করে যখন সে ঘুমিয়ে ছিল। (৩০২২) (আধুনিক প্রকাশনীঃ ২৮০১, ইসলামিক ফাউন্ডেশনঃ ২৮১১)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 232
			}
		},
		{
			"hadithnumber": 3025,
			"arabicnumber": 3025,
			"text": "",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 233
			}
		},
		{
			"hadithnumber": 3026,
			"arabicnumber": 3026,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, তোমরা শত্রুর মুখোমুখী হবার ব্যাপারে ইচ্ছা পোষণ করবে না। আর যখন তোমরা তাদের মুখোমুখী হবে তখন ধৈর্য অবলম্বন করবে। (মুসলিম ৩২/৬ হাঃ ১৭৪১, আহমাদ ১০৭৭৮) (ইসলামিক ফাউন্ডেশনঃ ২৮১২ শেষাংশ)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 234
			}
		},
		{
			"hadithnumber": 3028,
			"arabicnumber": 3028,
			"text": "",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 235
			}
		},
		{
			"hadithnumber": 3029,
			"arabicnumber": 3029,
			"text": "",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 236
			}
		},
		{
			"hadithnumber": 3030,
			"arabicnumber": 3030,
			"text": "জাবির ইবনু ‘আবদুল্লাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, ‘যুদ্ধ হচ্ছে কৌশল।’ (মুসলিম ৩২/৫ হাঃ ১৭৩৯, আহমাদ ১৪১৮১) (আধুনিক প্রকাশনীঃ ২৮০৫, ইসলামিক ফাউন্ডেশনঃ ২৮১৫৪)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 237
			}
		},
		{
			"hadithnumber": 3031,
			"arabicnumber": 3031,
			"text": "জাবির ইবনু ‘আবদুল্লাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একবার বললেন, ‘কে আছ যে কা‘ব ইবনু আশরাফ-এর (হত্যার) দায়িত্ব নিবে? কেননা সে আল্লাহ্ তা‘আলা ও তাঁর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে কষ্ট দিয়েছে।’ মুহাম্মাদ ইবনু মাসলামাহ (রাঃ) বললেন, ‘হ্যাঁ।’ বর্ণনাকারী বলেন, অতঃপর মুহাম্মাদ ইবনু মাসলামাহ (রাঃ) কা‘ব ইবনু আশরাফের নিকট গিয়ে বললেন, ‘এ ব্যক্তি অর্থাৎ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের কষ্টে ফেলেছে এবং আমাদের নিকট হতে সদাকাহ চাচ্ছে।’ রাবী বলেন, তখন কা‘ব বলল, ‘এখনই আর কী হয়েছে?’ তোমরা তো তার থেকে আরো পেরেশান হয়ে পড়বে।’ মুহাম্মাদ ইবনু মাসলামাহ (রাঃ) বললেন, ‘আমরা তাঁর অনুগত হয়েছি, এখন তাঁর শেষ ফল না দেখা পর্যন্ত তাঁকে সম্পূর্ণ ত্যাগ করা পছন্দ করি না।’ রাবী বলেন, মুহাম্মাদ ইবনু মাসলামাহ (রাঃ) এভাবে তার সুযোগ না পাওয়া পর্যন্ত কথা বলতে থাকেন, অতঃপর তাকে হত্যা করে ফেলেন। (২৫১০) (আধুনিক প্রকাশনীঃ ২৮০৬, ইসলামিক ফাউন্ডেশনঃ ২৮১৬)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 238
			}
		},
		{
			"hadithnumber": 3032,
			"arabicnumber": 3032,
			"text": "জাবির (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, ‘কা’ব ইবনু আশরাফকে হত্যা করার দায়িত্ব কে নিবে?’ তখন মুহাম্মাদ ইবনু মাসলামাহ (রাঃ) বললেন, ‘আপনি কি পছন্দ করেন যে, আমি তাকে হত্যা করি?’ আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, হ্যাঁ। মুহাম্মাদ ইবনু মাসলামাহ (রাঃ) বললেন, ‘তবে আমাকে অনুমতি দিন, আমি যেন তাকে কিছু বলি।’ তিনি বললেন, ‘আমি অনুমতি দিলাম।’ (২৫১০) (আধুনিক প্রকাশনীঃ ২৮০৭, ইসলামিক ফাউন্ডেশনঃ ২৮১৭)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 239
			}
		},
		{
			"hadithnumber": 3033,
			"arabicnumber": 3033,
			"text": "‘আবদুল্লাহ্ ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ‘উবাই ইবনু কা‘ব (রাঃ)-কে সঙ্গে নিয়ে ইবনু সাইয়াদের নিকট গমন করেন। তখন লোকেরা বলল, সে খেজুর বাগানে আছে। যখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর নিকট খেজুর বাগানে পৌঁছলেন, তখন তিনি নিজেকে খেজুর গাছের শাখার আড়াল করতে লাগলেন। ইবনু সাইয়াদ তখন তার চাদর জড়িয়ে গুণগুণ করছিল। তখন ইবনু সাইয়াদের মা আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে দেখে বলে উঠল, হে সাফ! (ইবনু সাইয়াদের ডাক নাম) এই যে, মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম। তখন ইবনু সাইয়াদ লাফিয়ে উঠল। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, যদি এ নারী তাকে তার নিজের অবস্থায় ছেড়ে দিত, তবে আসল ব্যাপার প্রকাশিত হয়ে পড়ত। (১৩৫৫) (আধুনিক প্রকাশনীঃ অনুচ্ছেদঃ ১৬০, ইসলামিক ফাউন্ডেশনঃ অধ্যায় : ১৯০১)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 240
			}
		},
		{
			"hadithnumber": 3034,
			"arabicnumber": 3034,
			"text": "فِيْهِ سَهْلٌ وَأَنَسٌ عَنْ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَفِيْهِ يَزِيْدُ عَنْ سَلَمَةَ এ প্রসঙ্গে সাহল ও আনাস (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে হাদীস বর্ণিত আছে, আর ইয়াযিদ (রহ.) সালামাহ (রাঃ) থেকেও বর্ণিত আছে। ৩০৩৪. বারা ইবনু ‘আযিব (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে খন্দক যুদ্ধের দিন দেখেছি, তিনি নিজে মাটি বহন করেছেন। এমনকি তাঁর সম্পূর্ণ বক্ষের কেশরাজিকে মাটি ঢেকে ফেলেছে আর তাঁর শরীরে অনেক পশম ছিল। তখন তিনি ‘আবদুল্লাহ্ ইবনু রাওয়াহা (রাঃ) রচিত কবিতা আবৃত্তি করেছিলেনঃ ওগো আল্লাহ্ তুমি না চাইলে আমরা হিদায়াত পেতাম না। আর আমরা সদাকাহ করতাম না এবং সালাত আদায় করতাম না॥ তুমি আমাদের প্রতি শান্তি অবতীর্ণ কর। এবং যুদ্ধক্ষেত্রে আমাদেরকে সুদৃঢ় রাখ শত্রুরা আমাদের উপর অত্যাচার চালিয়েছে। তারা ফিতনা সৃষ্টির ইচ্ছে করলে আমরা তা প্রত্যাখ্যান করেছি।’’ আর তিনি এ কবিতাগুলো আবৃত্তি কালে স্বর উচ্চ করেছিলেন। (২৮৩৯) (আধুনিক প্রকাশনীঃ ২৮০৮, ইসলামিক ফাউন্ডেশনঃ ২৮১৮)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 241
			}
		},
		{
			"hadithnumber": 3036,
			"arabicnumber": 3036,
			"text": "",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 242
			}
		},
		{
			"hadithnumber": 3037,
			"arabicnumber": 3037,
			"text": "সাহল ইবনু সা‘দ সা‘ঈদী (রাঃ) হতে বর্ণিত। তাঁকে লোকেরা জিজ্ঞেস করেছিল যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর যখম কিভাবে চিকিৎসা করা হয়েছিল? তখন সাহল (রাঃ) বলেন, এখন আর এ ব্যাপারে আমার চেয়ে অধিক জানা কেউ অবশিষ্ট নেই। ‘আলী (রাঃ) তাঁর ঢালে করে পানি বহন করে নিয়ে আনছিলেন, আর ফাতিমাহ (রাঃ) তাঁর মুখমন্ডল হতে রক্ত ধুয়ে দিচ্ছিলেন এবং একটি চাটাই নিয়ে পোড়ানো হয় আর তা আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর যখমের মধ্যে পুরে দেয়া হয়। (২৪৩) (আধুনিক প্রকাশনীঃ ২৮১০, ইসলামিক ফাউন্ডেশনঃ ২৮২০)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 243
			}
		},
		{
			"hadithnumber": 3038,
			"arabicnumber": 3038,
			"text": "(وَقَالَ اللهُ تَعَالَى )وَلَا تَنَازَعُوْا فَتَفْشَلُوْا وَتَذْهَبَ رِيْحُكُمْ( قَالَ قَتَادَةُ الرِّيحُ الْحَرْبُ আল্লাহ্ তা‘আলা বলেনঃ ‘‘নিজেরা পরস্পর বিবাদ করবে না; যদি কর তবে তোমরা সাহস হারা হয়ে পড়বে এবং তোমাদের প্রভাব চলে যাবে’’- (আনফাল ৪৬)। ক্বাতাদাহ বলেন, الرِّيحُ হলো যুদ্ধ। ৩০৩৮. আবূ মূসা আল-আশ‘আরী (রাঃ) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মু‘আয ও আবূ মূসা (রাঃ)-কে ইয়ামানে প্রেরণ করেন ও আদেশ দেন যে, ‘লোকদের প্রতি কোমলতা করবে, কঠোরতা করবে না, তাদের সুখবর দিবে, ঘৃণা সৃষ্টি করবে না। পরস্পর একমত হবে, মতভেদ করবে না।’ (২২৬১) (আধুনিক প্রকাশনীঃ ২৮১১, ইসলামিক ফাউন্ডেশনঃ ২৮২১)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 244
			}
		},
		{
			"hadithnumber": 3039,
			"arabicnumber": 3039,
			"text": "বারাআ ইবনু ‘আযিব (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উহুদের দিন ‘আবদুল্লাহ্ ইবনু যুবাইর (রাঃ)-কে পঞ্চাশ জন পদাতিক যোদ্ধার উপর আমীর নিয়োগ করেন এবং বলেন, তোমরা যদি দেখ যে, আমাদেরকে পাখীরা ছোঁ মেরে নিয়ে যাচ্ছে, তথাপি তোমরা আমার পক্ষ হতে সংবাদ পাওয়া ছাড়া স্বস্থান ত্যাগ করবে না। আর যদি তোমরা দেখ যে, আমরা শত্রু দলকে পরাস্ত করেছি এবং আমরা তাদেরকে পদদলিত করেছি, তখনও আমার পক্ষ হতে সংবাদ প্রেরণ করা ব্যতীত স্ব-স্থান ত্যাগ করবে না। অতঃপর মুসলিমগণ কাফিরদেরকে যুদ্ধে পরাস্ত করে দিল। বারাআ (রাঃ) বলেন, আল্লাহর শপথ! আমি মুশরিকদের নারীদেরকে দেখতে পেলাম তারা নিজ বস্ত্র উপরে উঠিয়ে পলায়ন করছে। যাতে পায়ের অলঙ্কার ও পায়ের নলা উন্মুক্ত হয়ে গিয়েছে। তখন ‘আবদুল্লাহ্ ইবনু যুবাইর (রাঃ)-এর সহযোগীরা বলতে লাগলেন, ‘লোক সকল! এখন তোমরা গনীমতের মাল সংগ্রহ কর। তোমাদের সাথীরা বিজয় লাভ করেছে। আর অপেক্ষা কেন?’ তখন ‘আবদুল্লাহ্ ইবনু যুবাইর (রাঃ) বললেন, ‘রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তোমাদেরকে যা বলেছিলেন, তা তোমরা ভুলে গিয়েছো?’ তাঁরা বললেন, ‘আল্লাহর শপথ, আমরা লোকদের সঙ্গে মিলিত হয়ে গানীমাতের মাল সংগ্রহে যোগ দিব।’ অতঃপর যখন তাঁরা স্বস্থান ত্যাগ করে নিজেদের লোকজনের নিকট পৌঁছল, তখন তাঁদের মুখ ফিরিয়ে দেয়া হয় আর তাঁরা পরাজিত হয়ে পলায়ন করতে থাকেন। এটা সে সময় যখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদেরকে পেছন থেকে ডাকছিলেন। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে বার জন লোক ব্যতীত অপর কেউই বাকী ছিল না। কাফিররা এ সুযোগে মুসলিমদের সত্তর ব্যক্তিকে শহীদ করে ফেলে। এর পূর্বে বাদার যুদ্ধে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-ও তাঁর সাথীগণ মুশরিকদের সত্তরজনকে বন্দী ও সত্তরজনকে নিহত করেন। এ সময় আবূ সুফ্ইয়ান তিনবার আওয়াজ দিল, ‘লোকদের মধ্যে কি মুহাম্মাদ জীবিত আছে?’ আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার উত্তর দিতে নিষেধ করেন। পুনরায় তিনবার আওয়াজ দিল- ‘লোকদের মধ্যে কি আবূ কুহাফার পুত্র জীবিত আছে?’ পুনরায় তিনবার আওয়াজ দিল, ‘লোকদের মধ্যে কি খাত্তাবের পুত্র জীবিত আছে?’ অতঃপর সে নিজ লোকদের নিকট গিয়ে বলল, ‘এরা সবাই নিহত হয়েছে।’ এ সময় ‘উমার (রাঃ) ধৈর্যধারণ করতে পারলেন না। তিনি বলে উঠলেন, ‘ওরে আল্লাহর শত্রু! আল্লাহর শপথ, তুই মিথ্যা বলছিস। যাঁদের তুমি নাম উচ্চারণ করছিস তাঁরা সবাই জীবিত আছেন। তোদের জন্য ভয়াবহ পরিণতি অপেক্ষা করছে।’ আবূ সুফ্ইয়ান বলল, ‘আজ বাদারের দিনের প্রতিশোধ। যুদ্ধ তো বালতির মত। তোমরা তোমাদের লোকদের মধ্যে নাক-কান কাটা দেখবে, আমি এর আদেশ দেইনি কিন্তু তা আমি পছন্দও করিনি।’ অতঃপর বলতে লাগল, ‘হে হুবাল! তোমার মাথা উঁচু হোক। হে হুবাল! তোমার মাথা উঁচু হোক।’ তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সাহাবীগণকে উদ্দেশ্য করে বললেন, ‘তোমরা এর উত্তর দিবে না?’ তাঁরা বললেন, ‘হে আল্লাহর রাসূল! আমরা কী বলব?’ তিনি বললেন, ‘তোমরা বল, আল্লাহ তা‘আলাই সবচেয়ে মর্যাদাবান, তিনিই মহা মহিমান্বিত।’ আবূ সুফ্ইয়ান বলল, আমাদের জন্য উয্যা রয়েছে, তোমাদের উয্যা নেই।’ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, ‘তোমরা কি তার উত্তর দিবে না?’ বারাআ (রাঃ) বলেন, ‘সাহাবীগণ বললেন, ‘হে আল্লাহর রাসূল! আমরা কী বলব?’ আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, ‘তোমরা বল, আল্লাহ আমাদের সহায়তাকারী বন্ধু, তোমাদের কোন সহায়তাকারী বন্ধু নেই।’ (৩৯৮৬, ম৪০৪৩, ৪০৬৭, ৪৫৭১) (আধুনিক প্রকাশনীঃ ২৮১২, ইসলামিক ফাউন্ডেশনঃ ২৮২২)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 245
			}
		},
		{
			"hadithnumber": 3040,
			"arabicnumber": 3040,
			"text": "আনাস (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সবচেয়ে সুন্দর, সবচেয়ে দানশীল ও সবচেয়ে শৌর্য-বীর্যের অধিকারী ছিলেন। আনাস (রাঃ) বলেন, একবার এমন হয়েছিল যে, মদিনা্বাসী রাতের বেলায় একটি আওয়াজ শুনে ভীত-শংকিত হয়ে গিয়েছিল। তিনি বলেন, তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আবূ ত্বলহা (রাঃ)-এর গদীবিহীন ঘোড়ায় আরোহণ করে তরবারী ঝুলিয়ে তাদের সামনে এলেন। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, ‘তোমরা ভয় করো না, তোমরা ভয় করো না।’ অতঃপর আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, ‘আমি এ ঘোড়াটিকে সমুদ্রের মত দ্রুতগামী পেয়েছি।’ (২৬২৭) (আধুনিক প্রকাশনীঃ ২৮১৩, ইসলামিক ফাউন্ডেশনঃ ২৮২৩)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 246
			}
		},
		{
			"hadithnumber": 3041,
			"arabicnumber": 3041,
			"text": "সালামাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি গাবাহ্ নামক স্থানে যাবার উদ্দেশ্যে মদিনা্ থেকে বের হলাম। যখন আমি গাবাহর উঁচুস্থানে পৌঁছলাম, সেখানে আমার সঙ্গে ‘আবদুর রাহমান ইবনু আউফ (রাঃ)-এর গোলামের সাক্ষাৎ ঘটল। আমি বললাম, আশ্চর্য! তোমার কী হয়েছে? সে বলল, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর দুগ্ধবতী উটনীগুলো ছিনতাই হয়েছে। আমি বললাম, কারা ছিনতাই করেছে? সে বলল, গাতফান ও ফাযারাহ্ গোত্রের লোকেরা। তখন আমি বিপদ, বিপদ বলে তিন বার চিৎকার দিলাম। আর মদিনার দুই কঙ্করময় ভূমির মাঝে যত লোক ছিল সবাইকে আওয়াজ শুনিয়ে দিলাম। অতঃপর আমি দ্রুত ছুটে গিয়ে ছিনতাইকারীদের পেয়ে গেলাম। তারা উটনীগুলোকে নিয়ে যাচ্ছিল। আমি তাদের প্রতি তীর নিক্ষেপ করতে থাকলাম। আর বলতে লাগলাম, আমি আকওয়া‘র পুত্র আর আজ কমিনাদের ধ্বংসের দিন। আমি তাদের থেকে উটগুলো উদ্ধার করলাম, তখনও তারা পানি পান করতে পারেনি। আর আমি সেগুলোকে হাঁকিয়ে নিয়ে আসছিলাম। এ সময়ে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে আমার দেখা হয়, তখন আমি বললাম, হে আল্লাহর রাসূল! লোকগুলো তৃষ্ণার্ত। আমি এত তাড়াতাড়ি কাজ সেরেছি যে, তারা পানি পান করার সুযোগ পায়নি। শীঘ্র তাদের পেছনে সৈন্য পাঠিয়ে দিন। তখন তিনি বললেন, ‘হে ইবনু আক্ওয়া! তুমি তাদের উপর বিজয়ী হয়েছ, এখন তাদের কথা বাদ রাখ। তারা তাদের গোত্রের নিকট পৌঁছে গেছে।’ (৪১৯৪) (আধুনিক প্রকাশনীঃ ২৮১৪, ইসলামিক ফাউন্ডেশনঃ ২৮২৪)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 247
			}
		},
		{
			"hadithnumber": 3042,
			"arabicnumber": 3042,
			"text": "وَقَالَ سَلَمَةُ خُذْهَا وَأَنَا ابْنُ الأَكْوَعِ আর সালামাহ বলেছেন, এটাও লও; আমি আকওয়া‘র পুত্র। ৩০৪২. আবূ ইসহাক (রহ.) হতে বর্ণিত। তিনি বলেন, এক ব্যক্তি বারাআ ইবনু ‘আযিব (রাঃ)-কে জিজ্ঞেস করল এবং বলল, হে আবূ উমারাহ! আপনারা কি হুনাইনের যুদ্ধে পৃষ্ঠ প্রদর্শন করেছিলেন? বারাআ (রাঃ) বললেন, [আবূ ইসহাক (রহ.) বলেন], আর আমি তা শুনছিলাম, সেদিন তো আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পালিয়ে যাননি। আবূ সুফ্ইয়ান ইবনু হারিস (রাঃ) তাঁর খচ্চরের লাগাম ধরেছিলেন। যখন মুশরিকগণ তাঁকে ঘিরে ফেলল, তখন তিনি অবতরণ করলেন এবং বলতে লাগলেন, আমি আল্লাহর নবী, এটা মিথ্যা নয়। আমি আবদুল মুত্তালিবের সন্তান। তিনি (বারা) (রাঃ) বলেন, সেদিন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অপেক্ষা দৃঢ়চেতা আর কাউকে দেখা যায়নি। (২৮৬৪) (আধুনিক প্রকাশনীঃ ২৮১৫, ইসলামিক ফাউন্ডেশনঃ ২৮২৫)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 248
			}
		},
		{
			"hadithnumber": 3043,
			"arabicnumber": 3043,
			"text": "আবূ সা‘ঈদ খুদরী (রাঃ) হতে বর্ণিত। তিনি বলেন, যখন বনী কুরায়যার ইয়াহূদীরা সা‘দ ইবনু মা‘আয (রাঃ)-এর ফায়সালা মুতাবিক দূর্গ থেকে বেরিয়ে আসে, তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে ডেকে পাঠান। আর তিনি তখন ঘটনাস্থলের কাছেই ছিলেন। তখন সা‘দ (রাঃ) একটি গাধার পিঠে আরোহণ করে আসলেন। যখন তিনি কাছে আসলেন, তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তোমরা ‘তোমাদের নেতার দিকে দন্ডায়মান হও।’ তিনি এসে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট বসলেন। তখন তাঁকে বললেন, ‘এগিয়ে যাও এরা তোমার ফায়সালায় রাজী হয়েছে। সা‘দ (রাঃ) বলেন, ‘আমি এই রায় ঘোষণা করছি যে, তাদের মধ্য হতে যারা যুদ্ধ করতে পারে তাদেরকে হত্যা করা হবে এবং নারী ও শিশুদের বন্দী করা হবে।’ আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, ‘তুমি তাদের সম্পর্কে আল্লাহ্ তা‘আলার ফয়সালার মত ফয়সালাই করেছ।’ (৩৮০৪, ৪১২১, ৬২৬২) (মুসলিম ৩২/২২ হাঃ ১৭৬৮, আহমাদ ১১১৬৮) (আধুনিক প্রকাশনীঃ ২৮১৬, ইসলামিক ফাউন্ডেশনঃ ২৮২৬)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 249
			}
		},
		{
			"hadithnumber": 3044,
			"arabicnumber": 3044,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। মক্কা জয়ের বছর আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মাথায় শিরস্ত্রাণ পরা অবস্থায় প্রবেশ করেন। যখন তিনি তা খুলে ফেললেন, এক ব্যক্তি এসে বললো, ইবনু খাতাল্ কা‘বার পর্দা ধরে আছে। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, ‘তাকে কতল কর।’ (১৮৪৬) (আধুনিক প্রকাশনীঃ ২৮১৭, ইসলামিক ফাউন্ডেশনঃ ২৮২৭)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 250
			}
		},
		{
			"hadithnumber": 3045,
			"arabicnumber": 3045,
			"text": "‘আমর ইবনু আবূ সুফ্ইয়ান (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দশ ব্যক্তিকে গোয়েন্দা হিসেবে সংবাদ সংগ্রহের জন্য পাঠালেন এবং আসিম ইবনু সাবিত আনসারীকে তাঁদের দলপতি নিয়োগ করেন। যিনি আসিম ইবনু ‘উমার ইবনু খাত্তাবের নানা ছিলেন। তাঁরা রওনা করলেন, যখন তাঁরা উসফান ও মক্কার মাঝে হাদআত নামক স্থানে পৌঁছেন, তখন হুযায়েল গোত্রের একটি প্রশাখা যাদেরকে লেহইয়ান বলা হয় তাদের নিকট তাঁদের ব্যাপারে আলোচনা করা হয়। তারা প্রায় দু’শত তীরন্দাজকে তাঁদের পিছু ধাওয়ার জন্য পাঠান। এরা তাঁদের চিহ্ন দেখে চলতে থাকে। সাহাবীগণ মদিনা্ হতে সঙ্গে নিয়ে আসা খেজুর যেখানে বসে খেয়েছিলেন, অবশেষে এরা সে স্থানের সন্ধান পেয়ে গেল, তখন এরা বলল, ইয়াসরিবের খেজুর। অতঃপর এরা তাঁদের পদচিহ্ন দেখে চলতে লাগল। যখন আসিম ও তাঁর সাথীগণ এদের দেখলেন, তখন তাঁরা একটি উঁচু স্থানে আশ্রয় গ্রহণ করলেন। আর কাফিররা তাঁদের ঘিরে ফেলল এবং তাঁদেরকে বলতে লাগল, তোমরা অবতরণ কর ও স্বেচ্ছায় বন্দীত্ব বরণ কর। আমরা তোমাদের অঙ্গীকার ও প্রতিশ্রুতি দিচ্ছি যে, তোমাদের মধ্য হতে কাউকে আমরা হত্যা করব না। তখন গোয়েন্দা দলের নেতা আসিম ইবনু সাবিত (রাঃ) বললেন, ‘আল্লাহর কসম! আমি তো আজ কাফিরদের নিরাপত্তায় অবতরণ করবো না। হে আল্লাহ! আমাদের পক্ষ থেকে আপনার নবীকে সংবাদ পৌঁছিয়ে দিন।’ অবশেষে কাফিররা তীর নিক্ষেপ করতে শুরু করল। আর তারা আসিম (রাঃ) সহ সাত জনকে শহীদ করলো। অতঃপর অবশিষ্ট তিনজন খুবাইব আনসারী, যায়দ ইবনু দাসিনা (রাঃ) ও অপর একজন তাদের দেয়া প্রতিশ্রুতি ও অঙ্গীকারের উপর নির্ভর করে তাদের নিকট অবতরণ করলেন। যখন কাফিররা তাদেরকে আয়ত্বে নিয়ে নিল, তখন তারা তাদের ধনুকের রশি খুলে ফেলে তাঁদের বেঁধে ফেললো। তখন তৃতীয় জন বলে উঠলেন, ‘গোড়াতেই বিশ্বাসঘাতকতা! আল্লাহর কসম! আমি তোমাদের সঙ্গে যাবো না, যাঁরা শহীদ হয়েছেন আমি তাঁদেরই পদাঙ্ক অনুসরণ করব।’ কাফিররা তাঁকে শহীদ করে ফেলে এবং তারা খুবাইব ও ইবনু দাসিনাকে নিয়ে চলে যায়। অবশেষে তাঁদের উভয়কে মক্কায় বিক্রয় করে ফেলে। এটা বাদার যুদ্ধের পরের কথা। তখন খুবাইবকে হারিস ইবনু ‘আমিরের পুত্রগণ ক্রয় করে নেয়। আর বাদার যুদ্ধের দিন খুবাইব (রাঃ) হারিস ইবনু ‘আমিরকে হত্যা করেছিলেন। খুবাইব (রাঃ) কিছু দিন তাদের নিকট বন্দী থাকেন। ইবনু শিহাব (রহ.) বলেন, আমাকে ‘উবায়দুল্লাহ ইবনু আয়ায্ অবহিত করেছেন, তাঁকে হারিসের কন্যা জানিয়েছে যে, যখন হারিসের পুত্রগণ খুবাইব (রাঃ)-কে শহীদ করার সর্বসম্মত সিদ্ধান্ত নিল, তখন তিনি তার কাছ থেকে ক্ষৌর কাজ সম্পন্ন করার উদ্দেশে একটা ক্ষুর ধার চাইলেন। তখন হারিসের কন্যা তাকে একখানা ক্ষুর ধার দিল। সে সময় ঘটনাক্রমে আমার এক ছেলে আমার অজ্ঞাতে খুবাইবের নিকট চলে যায় এবং আমি দেখলাম যে, আমার ছেলে খুবাইবের উরুর উপর বসে রয়েছে এবং খুবাইবের হাতে রয়েছে ক্ষুর। আমি খুব ভয় পেয়ে গেলাম। খুবাইব আমার চেহারা দেখে বুঝতে পারলেন যে, আমি ভয় পাচ্ছি। তখন তিনি বললেন, তুমি কি এ ভয় করো যে, আমি এ শিশুটিকে হত্যা করে ফেলব? কখনো আমি তা করব না। আল্লাহর কসম! আমি খুবাইবের মত উত্তম বন্দী কখনো দেখিনি। আল্লাহর শপথ! আমি একদা দেখলাম, তিনি লোহার শিকলে আবদ্ধ অবস্থায় ছড়া হতে আঙ্গুর খাচ্ছেন, যা তাঁর হাতেই ছিল। অথচ এ সময় মক্কা্য় কোন ফলই পাওয়া যাচ্ছিল না। হারিসের কন্যা বলতো, এ তো ছিল আল্লাহ তা‘আলার পক্ষ হতে প্রদত্ত জীবিকা, যা তিনি খুবাইবকে দান করেছেন। অতঃপর তারা খুবাইবকে শহীদ করার উদ্দেশে হারাম এর নিকট হতে হিল্লের দিকে নিয়ে বের হয়ে পড়ল, তখন খুবাইব (রাঃ) তাদের বললেন, আমাকে দু’রাক‘আত সালাত আদায় করতে দাও। তারা তাঁকে সে অনুমতি দিল। তিনি দু’রাকআত সালাত আদায় করে নিলেন। অতঃপর তিনি বললেন, ‘তোমরা যদি ধারণা না করতে যে, আমি মৃত্যুর ভয়ে ভীত হয়ে পড়েছি তবে আমি সালাতকে দীর্ঘ করতাম। হে আল্লাহ! তাদেরকে এক এক করে ধ্বংস করুন।’ (অতঃপর তিনি এ কবিতা দু’টি আবৃত্তি করলেন) ‘‘যখন আমি মুসলিম হিসেবে শহীদ হচ্ছি তখন আমি কোন রূপ ভয় করি না। আল্লাহর উদ্দেশ্যে আমাকে যেখানেই মাটিতে লুটিয়ে ফেলা হোক না কেন। আমার এ মৃত্যু আল্লাহ তা‘আলার জন্যই হচ্ছে। তিনি যদি ইচ্ছা করেন, তবে আমার দেহের প্রতিটি খন্ডিত জোড়াসমূহে বরকত সৃষ্টি করে দিবেন।’’ অবশেষে হারিসের পুত্র তাঁকে শহীদ করে ফেলে। বস্তুত যে মুসলিম ব্যক্তিকে বন্দী অবস্থায় শহীদ করা হয় তার জন্য দু’রাক‘আত সালাত আদায়ের এ রীতি খুবাইব (রাঃ)-ই প্রবর্তন করে গেছেন। যে দিন আসিম (রাঃ) শাহাদত বরণ করেছিলেন, সেদিন আল্লাহ তা‘আলা তাঁর দু‘আ কবুল করেছিলেন। সেদিনই আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর সাহাবীগণকে তাঁদের সংবাদ ও তাঁদের উপর যা’ যা’ আপতিত হয়েছিল সবই অবহিত করেছিলেন। আর যখন কুরাইশ কাফিরদেরকে এ সংবাদ পৌঁছানো হয় যে, আসিম (রাঃ)-কে শহীদ করা হয়েছে তখন তারা তাঁর কাছে এক লোককে পাঠায়, যাতে সে ব্যক্তি তাঁর লাশ হতে কিছু অংশ কেটে নিয়ে আসে, যেন তারা তা দেখে চিনতে পারে। কারণ, বাদার যুদ্ধের দিন আসিম (রাঃ) কুরাইশদের এক নেতৃস্থানীয় ব্যক্তিকে হত্যা করেছিলেন। আসিমের লাশের (রক্ষার জন্য) মৌমাছির ঝাঁক প্রেরিত হল যারা তাঁর দেহ আবৃত করে রেখে তাদের ষড়যন্ত্র হতে হিফাযত করল। ফলে তারা তাঁর শরীর হতে এক খন্ড গোশ্তও কেটে নিতে পারেনি। (৩৯৮৯, ৪০৮৬, ৭৪০২) (আধুনিক প্রকাশনীঃ ২৮১৮, ইসলামিক ফাউন্ডেশনঃ ২৮২৮)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 251
			}
		},
		{
			"hadithnumber": 3046,
			"arabicnumber": 3046,
			"text": "فِيْهِ عَنْ أَبِيْ مُوسَى عَنْ النَّبِيِّ صلى الله عليه وسلم এ বিষয়ে আবূ মূসা (রাঃ) কর্তৃক নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিকট হতে হাদীস বর্ণিত রয়েছে। ৩০৪৬. আবূ মূসা (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমরা বন্দী আযাদ কর, ক্ষুধার্তকে আহার্য দাও এবং রুগীর সেবা-শুশ্রূষা কর। (৫১৭৪, ৫৩৭৩, ৫৬৭৯, ৬১৬৩) (আধুনিক প্রকাশনীঃ ২৮১৯, ইসলামিক ফাউন্ডেশনঃ ২৮২৯)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 252
			}
		},
		{
			"hadithnumber": 3047,
			"arabicnumber": 3047,
			"text": "আবূ জুহাইফাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি ‘আলী (রাঃ)-কে জিজ্ঞেস করলাম, আল্লাহর কুরআনে যা কিছু আছে তা ব্যতীত আপনাদের নিকট ওয়াহীর কোন কিছু আছে কি? তিনি বললেন, না, সে আল্লাহ তা‘আলার কসম! যিনি শস্যদানাকে বিদীর্ণ করেন এবং প্রাণী সৃষ্টি করেন। আল্লাহ্ কুরআন সম্পর্কে মানুষকে যে জ্ঞান দান করেছেন এবং সহীফার মধ্যে যা রয়েছে, এ ছাড়া আমি আর কিছু জানি না। আমি বললাম, এ সহীফাটিতে কী আছে? তিনি বললেন, ‘দীয়াতের বিধান, বন্দী আযাদ করা এবং কোন মুসলিমকে যেন কোন কাফিরের পরিবর্তে হত্যা করা না হয়।’ (১১১) (আধুনিক প্রকাশনীঃ ২৮২০, ইসলামিক ফাউন্ডেশনঃ ২৮৩০)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 253
			}
		},
		{
			"hadithnumber": 3048,
			"arabicnumber": 3048,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। আনসারগণের কয়েকজন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট অনুমতি চেয়ে বললেন, হে আল্লাহর রাসূল! আপনি যদি আমাদের অনুমতি দান করেন, তবে আমরা আমাদের ভাগ্নে ‘আব্বাসের মুক্তিপণ ছেড়ে দিতে পারি। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, না, একটি দিরহামও ছাড় দিবে না। (২৫৩৭) (ইসলামিক ফাউন্ডেশনঃ ২৮৩১ প্রথমাংশ)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 254
			}
		},
		{
			"hadithnumber": 3049,
			"arabicnumber": 3049,
			"text": "আনাস (রাঃ) হতে বর্ণনা করেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট বাহরাইন হতে ধন-সম্পদ আনা হয়। তখন তাঁর নিকট ‘আব্বাস (রাঃ) এসে বললেন, হে আল্লাহর রাসূল! আমাকে কিছু দিন। আমি আমার নিজের মুক্তিপণ আদায় করেছি এবং আকীলেরও মুক্তিপণ আদায় করেছি। তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, নিন এবং তাঁর কাপড়ে দিয়ে দিলেন। (৪২১) (আধুনিক প্রকাশনীঃ ২৮২১, ইসলামিক ফাউন্ডেশনঃ ২৮৩১ শেষাংশ)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 255
			}
		},
		{
			"hadithnumber": 3050,
			"arabicnumber": 3050,
			"text": "জুবাইর (ইবনু মুতয়িম) (রাঃ) হতে বর্ণিত। আর তিনি বাদার যুদ্ধে বন্দীদের মুক্ত করার জন্য এসেছিলেন। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে মাগরিবের সালাতে সূরায়ে তূর পড়তে শুনেছি। (৭৬৫) (আধুনিক প্রকাশনীঃ ২৮২২, ইসলামিক ফাউন্ডেশনঃ ২৮৩২)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 256
			}
		},
		{
			"hadithnumber": 3051,
			"arabicnumber": 3051,
			"text": "সালামাহ ইবনু আক্ওয়া (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কোন এক সফরে মুশরিকদের জনৈক গুপ্তচর তাঁর নিকট এল এবং তাঁর সাহাবীগণের সঙ্গে বসে কথাবার্তা বলতে লাগল ও কিছুক্ষণ পরে চলে গেল। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, ‘তাকে খুঁজে আন এবং হত্যা কর।’ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার মালপত্র হত্যাকারীকে প্রদান করলেন। (মুসলিম ৩২/১৩ হাঃ ১৭৫৩, আহমাদ ১৬৫২৩) (আধুনিক প্রকাশনীঃ ২৮২৩, ইসলামিক ফাউন্ডেশনঃ ২৮৩৩)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 257
			}
		},
		{
			"hadithnumber": 3052,
			"arabicnumber": 3052,
			"text": "‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি এ অসীয়ত করেছি যে, ‘আল্লাহ তা‘আলা ও তাঁর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর পক্ষ হতে কাফিরদের সঙ্গে কৃত অঙ্গীকার যেন যথাযথভাবে পূরণ করা হয়, তাদের নিরাপত্তার প্রয়োজনে যুদ্ধ করা হয়, তাদের সামর্থ্যের বাইরে তাদের উপর যেন জিযিয়া ধার্য করা না হয়।’ (১৩৯২) (আধুনিক প্রকাশনীঃ ২৮২৪, ইসলামিক ফাউন্ডেশনঃ ২৮৩৪)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 258
			}
		},
		{
			"hadithnumber": 3053,
			"arabicnumber": 3053,
			"text": "بَابُ جَوَائِزِ الْوَفْدِ ৫৬/১৭৫. অধ্যায় : প্রতিনিধি দলকে উপঢৌকন দেয়া। ৩০৫৩. ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বললেন, বৃহস্পতিবার! হায় বৃহস্পতিবার! অতঃপর তিনি কাঁদতে শুরু করলেন, এমনকি তাঁর অশ্রুতে কঙ্করগুলো সিক্ত হয়ে গেল। আর তিনি বলতে লাগলেন, ‘বৃহস্পতিবারে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর রোগ যাতনা বেড়ে যায়। তখন তিনি বললেন, তোমরা আমার জন্য লিখার কোন জিনিস নিয়ে এসো, আমি তোমাদের জন্য কিছু লিখিয়ে দিব। যাতে অতঃপর তোমরা কখনও পথভ্রষ্ট না হও। এতে সাহাবীগণ পরস্পরে মতভেদ করেন। অথচ নবীর সম্মুখে মতভেদ সমীচীন নয়। তাদের কেউ কেউ বললেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দুনিয়া ত্যাগ করছেন?’ তিনি বললেন, ‘আচ্ছা, আমাকে আমার অবস্থায় থাকতে দাও। তোমরা আমাকে যে অবস্থার দিকে আহবান করছো তার চেয়ে আমি যে অবস্থায় আছি তা উত্তম।’ অবশেষে তিনি ইন্তিকালের সময় তিনটি বিষয়ে ওসীয়ত করেন। (১) মুশরিকদেরকে আরব উপদ্বীপ হতে বিতাড়িত কর, (২) প্রতিনিধি দলকে আমি যেরূপ উপঢৌকন দিয়েছি তোমরাও তেমন দিও (রাবী বলেন) তৃতীয় ওসীয়তটি আমি ভুলে গিয়েছি। আবূ আব্দুল্লাহ (রহ.) বলেন, ইবনু মুহাম্মদ (রহ.) ও ইয়া‘কূব (রহ.) বলেন, আমি মুগীরাহ ইবনু ‘আবদুর রহমানকে জাযীরাতুল আরব সম্পর্কে জিজ্ঞেস করলাম, তিনি বললেন, তাহলো মক্কা, মদিনা্, ইয়ামামা ও ইয়ামান। ইয়াকূব (রহ.) বলেন, ‘তিহামাহ্ আরম্ভ হল ‘আরজ থেকে।’ (১১৪) (আধুনিক প্রকাশনীঃ ২৮২৫, ইসলামিক ফাউন্ডেশনঃ ২৮৩৫)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 259
			}
		},
		{
			"hadithnumber": 3054,
			"arabicnumber": 3054,
			"text": "(আবদুল্লাহ) ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, ‘উমার (রাঃ) এক জোড়া রেশমী কাপড় বাজারে বিক্রি হতে দেখতে পেলেন। তিনি তা আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট নিয়ে এসে বললেন, হে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এ রেশমী কাপড় জোড়া আপনি ক্রয় করুন এবং ‘ঈদ ও প্রতিনিধিদল আগমন উপলক্ষে এর দ্বারা আপনি সুসজ্জিত হবেন। তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, ‘এ পোশাক তো তার (আখিরাতে) যার কোন অংশ নেই। অথবা (বলেন) এরূপ পোশাক সে-ই পরিধান করে (আখিরাতে) যার কোন অংশ নেই।’ এ অবস্থায় ‘উমার (রাঃ) কিছুদিন অবস্থান করেন, যে পরিমাণ সময় আল্লাহ তা‘আলার ইচ্ছে ছিল। অতঃপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একটি রেশমী জুববা ‘উমার (রাঃ)-এর নিকট পাঠিয়ে দেন। তিনি তা নিয়ে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট এসে আরয করলেন, হে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম! আপনি বলেছিলেন যে, এ তো তারই লেবাস (আখিরাতে) যার কোন অংশ নেই, কিংবা (রাবীর সন্দেহ) এ পোশাক তো সে-ই পরিধান করে, যার (আখিরাতে) কোন অংশ নেই। এরপরও আপনি তা আমার জন্য পাঠালেন। তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তুমি তা বিক্রয় করে ফেলবে অথবা (রাবীর সন্দেহ) বলেছেন, তুমি তা তোমার কোন কাজে লাগাবে। (৮৮৬) (আধুনিক প্রকাশনীঃ ২৮২৬, ইসলামিক ফাউন্ডেশনঃ ২৮৩৬)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 260
			}
		},
		{
			"hadithnumber": 3055,
			"arabicnumber": 3055,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, ‘উমার (রাঃ) কয়েকজন সাহাবীসহ আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে ইবনু সাইয়াদের নিকট যান। তাঁরা তাকে বানী মাগালার টিলার উপর ছেলে-পেলেদের সঙ্গে খেলাধুলা করতে দেখতে পান। আর এ সময় ইবনু সাইয়াদ বালিগ হবার নিকটবর্তী হয়েছিল। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর (আগমন) সে কিছু টের না পেতেই নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর পিঠে হাত দিয়ে মৃদু আঘাত করলেন। অতঃপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তুমি কি সাক্ষ্য দাও যে, আমি আল্লাহর প্রেরিত রাসূল? তখন ইবনু সাইয়াদ তাঁর প্রতি তাকিয়ে বলল, আমি সাক্ষ্য দিচ্ছি যে, আপনি উম্মী লোকদের রাসূল। ইবনু সাইয়াদ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলল, আপনি কি এ সাক্ষ্য দেন যে, আমি আল্লাহর রাসূল? নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বললেন, আমি আল্লাহ তা‘আলা ও তাঁর সকল রাসূলের প্রতি ঈমান এনেছি। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে প্রশ্ন করলেন, তুমি কী দেখ? ইবনু সাইয়াদ বলল, আমার নিকট সত্য খবর ও মিথ্যা খবর সবই আসে। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আসল অবস্থা তোমার কাছে সত্য মিথ্যা মিশিয়ে আছে। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আরো বললেন, আচ্ছা, আমি আমার অন্তরে তোমার জন্য কিছু কথা গোপন রেখেছি। ইবনু সাইয়াদ বলল, তা’ হচ্ছে ধোঁয়া। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আরে থাম, তুমি তোমার সীমার বাইরে যেতে পার না। ‘উমার (রাঃ) বলে উঠলেন, হে আল্লাহর রাসূল! আমাকে হুকুম দিন, আমি তার গর্দান উড়িয়ে দেই। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, যদি সে প্রকৃত দাজ্জাল হয়, তবে তুমি তাকে কাবু করতে পারবে না, যদি সে দাজ্জাল না হয়, তবে তাকে হত্যা করে তোমার কোন লাভ নেই। (১৩৫৪) (আধুনিক প্রকাশনীঃ ২৮২৭, ইসলামিক ফাউন্ডেশনঃ ২৮৩৭ প্রথমাংশ)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 261
			}
		},
		{
			"hadithnumber": 3057,
			"arabicnumber": 3057,
			"text": "",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 262
			}
		},
		{
			"hadithnumber": 3058,
			"arabicnumber": 3058,
			"text": "بَابُ قَوْلِ النَّبِيِّ صلى الله عليه وسلم لِلْيَهُوْدِ أَسْلِمُوْا تَسْلَمُوْا ৫৬/১৭৯ অধ্যায় : ইয়াহূদীদের উদ্দেশ্যে রসুলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর বাণীঃ ‘‘ইসলাম গ্রহণ কর, নিরাপত্তা লাভ কর’’। قَالَهُ الْمَقْبُرِيُّ عَنْ أَبِيْ هُرَيْرَةَ এ বাণী মাকবুরী আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণনা করেছেন। ৩০৫৮. উসামাহ ইবনু যায়দ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি বিদায় হাজ্জে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বললাম, হে আল্লাহর রাসূল! আগামীকাল আপনি মক্কায় পৌঁছে কোথায় অবতরণ করবেন? তিনি বললেন, আকীল কি আমাদের জন্য কোন ঘর বাড়ি অবশিষ্ট রেখেছে? অতঃপর বললেন, আমরা আগামীকাল খায়ফে বানূ কানানার মুহাস্সাব নামক স্থানে অবতরণ করব। যেখানে কুরায়েশ লোকেরা কুফরীর উপর শপথ করেছিল। আর তা হচ্ছে এই যে, বানূ কানানা ও কুরায়শগণ একত্রে এ শপথ করেছিল যে, তারা বানূ হাশেমের সঙ্গে কেনা-বেচা করবে না এবং তাদের নিজ বাড়িতে আশ্রয়ও দিবে না। যুহরী (রহ.) বলেন, খায়ফ হচ্ছে একটি উপত্যকা। (১৫৮৮) (আধুনিক প্রকাশনীঃ ২৮২৮, ইসলামিক ফাউন্ডেশনঃ ২৮৩৮)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 263
			}
		},
		{
			"hadithnumber": 3059,
			"arabicnumber": 3059,
			"text": "যায়দ ইবনু আসলাম কর্তৃক তাঁর পিতা হতে বর্ণিত। ‘উমার (রাঃ) হুনাইয়াহ নামক তাঁর এক আযাদকৃত গোলামকে সরকারী চারণভূমির তত্ত্বাবধানে নিযুক্ত করেন। আর তাকে আদেশ করেন, হে হুনাইয়াহ! মুসলিমদের সঙ্গে অত্যন্ত বিনয়ী থাকবে, মজলুমের বদ দু‘আ হতে বেঁচে থাকবে। কারণ, মজলুমের দু‘আ কবূল হয়। আর অল্প সংখ্যক উট ও অল্প সংখ্যক বকরীর মালিককে এতে প্রবেশ করতে দিবে। আর ‘আবদুর রহমান ইবনু ‘আউফ ও ‘উসমান ইবনু ‘আফফান (রাঃ)-এর পশুর ব্যাপারে সতর্ক থাকবে। কেননা যদি তাঁদের পশুগুলো ধ্বংস হয়ে যায়, তবে তাঁরা তাঁদের কৃষি ক্ষেত ও খেজুর বাগানের প্রতি মনোযোগ দিবেন। কিন্তু অল্প সংখ্যক উট-বকরীর মালিকদের পশু ধ্বংস হয়ে গেলে তাদের পরিবার-পরিজন নিয়ে আমার নিকট উপস্থিত হবে। আর বলবে, হে আমীরুল মুমিনীন! আপনার পিতা ধ্বংস হোক! তখন আমি কি তাদের বঞ্চিত করতে পারব? সুতরাং পানি ও ঘাস দেয়া আমার পক্ষে সহজ, স্বর্ণ-রৌপ্য দেয়ার চাইতে। আল্লাহর শপথ! এ সব লোকেরা মনে করবে, আমি তাদের প্রতি জুলুম করেছি। এটা তাদেরই শহর, জাহিলী যুগে তারা এতে যুদ্ধ করেছে, ইসলামের যুগে তারা এতেই ইসলাম গ্রহণ করেছে। সে মহান আল্লাহর শপথ! যাঁর হাতে আমার প্রাণ, যে সব ঘোড়ার উপর আমি যোদ্ধাগণকে আল্লাহর রাস্তায় আরোহণ করিয়ে থাকি যদি সেগুলো না হতো তবে আমি তাদের দেশের এক বিঘত পরিমাণ জমিও সংরক্ষণ করতাম না। (আধুনিক প্রকাশনীঃ ২৮২৯, ইসলামিক ফাউন্ডেশনঃ ২৮৩৯)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 264
			}
		},
		{
			"hadithnumber": 3060,
			"arabicnumber": 3060,
			"text": "হুযাইফাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, মানুষের মধ্যে যারা ইসলামের কালিমাহ উচ্চারণ করেছে, তাদের নাম লিখে আমাকে দাও। হুযাইফাহ (রাঃ) বলেন, তখন আমরা এক হাজার পাঁচশ’ লোকের নাম লিখে তাঁর নিকট পেশ করি।১ তখন আমরা বলতে লাগলাম, আমরা এক হাজার পাঁচশত লোক, এক্ষণে আমাদের ভয় কিসের? (রাবী) হুযাইফাহ (রাঃ) বলেন, পরবর্তীকালে আমরা দেখেছি যে, আমরা এমনভাবে ফিতনায় পড়েছি যাতে লোকেরা ভীত-শংকিত অবস্থায় একা একা সালাত আদায় করছে। (মুসলিম ১/৬৭ হাঃ ১৪৯, আহমাদ ২৩৩১৯) (আধুনিক প্রকাশনীঃ ২৮৩০, ইসলামিক ফাউন্ডেশনঃ ২৮৪০) আ‘মাশ (রহ.) হতে এ রিওয়ায়াত বর্ণনা করেছেন, তাতে উল্লেখ হয়েছে, আমরা তাদের পাঁচশ’ পেয়েছি। আবূ মু‘আবিয়াহর বর্ণনায় উল্লেখিত হয়েছে, ছয়শ’ হতে সাতশ’ এর মাঝামাঝি। (আধুনিক প্রকাশনীঃ নাই, ইসলামিক ফাউন্ডেশনঃ ২৮৪১)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 265
			}
		},
		{
			"hadithnumber": 3061,
			"arabicnumber": 3061,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, এক ব্যক্তি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট এসে বলল, হে আল্লাহর রাসূল! অমুক অমুক যুদ্ধে আমার নাম লেখা হয়েছে আর আমার স্ত্রী হাজ্জ আদায়ের সংকল্প নিয়েছে। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, ‘ফিরে যাও এবং তোমার স্ত্রীর সঙ্গে হাজ্জ কর।’ (১৮৬২) (আধুনিক প্রকাশনীঃ ২৮৩১, ইসলামিক ফাউন্ডেশনঃ ২৮৪২)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 266
			}
		},
		{
			"hadithnumber": 3062,
			"arabicnumber": 3062,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমরা আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে এক যুদ্ধে উপস্থিত ছিলাম। তখন তিনি ইসলামের দাবীদার এক ব্যক্তিকে লক্ষ্য করে বললেন, এ ব্যক্তি জাহান্নামী অথচ যখন যুদ্ধ শুরু হল, তখন সে লোকটি ভীষণ যুদ্ধ করল এবং আহত হল। তখন বলা হল, হে আল্লাহর রাসূল! যে লোকটি সম্পর্কে আপনি বলেছিলেন সে লোকটি জাহান্নামী, আজ সে ভীষণ যুদ্ধ করেছে এবং মারা গেছে। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, সে জাহান্নামে গেছে। রাবী বলেন, একথার উপর কারো কারো অন্তরে এ বিষয়ে সন্দেহ সৃষ্টির উপক্রম হয় এবং তাঁরা এ সম্পর্কিত কথাবার্তায় রয়েছেন, এ সময় খবর এল যে, লোকটি মরে যায়নি বরং মারাত্মকভাবে আহত হয়েছে। যখন রাত্রি হল, সে আঘাতের কষ্টে ধৈর্যধারণ করতে পারল না এবং আত্মহত্যা করল। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট এ সংবাদ পৌঁছানো হল, তিনি বলে উঠলেন, আল্লাহ্ আকবার! আমি সাক্ষ্য দিচ্ছি যে, আমি অবশ্যই আল্লাহ তা‘আলার বান্দা এবং তাঁর রাসুল। অতঃপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বিলাল (রাঃ)-কে আদেশ করলেন, তখন তিনি লোকদের মধ্যে ঘোষণা দিলেন যে, মুসলিম ব্যতীত কেউ বেহেশ্তে প্রবেশ করবে না। আর আল্লাহ তা‘আলা (কখনো কখনো) এই দ্বীনকে মন্দ লোকের দ্বারাও সাহায্য করেন। (৪২০৪, ৬৬০৬) (মুসলিম ১/৪৭ হাঃ ১১১, ) (আধুনিক প্রকাশনীঃ ২৮৩২, ইসলামিক ফাউন্ডেশনঃ ২৮৪৩)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 267
			}
		},
		{
			"hadithnumber": 3063,
			"arabicnumber": 3063,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খুত্বা দিতে গিয়ে বললেন, যায়িদ পতাকা ধারণ করেছেন এবং শাহাদাত লাভ করেছেন, অতঃপর জা‘ফর (রাঃ) পতাকা ধারণ করেছেন এবং শাহাদাত বরণ করেছেন। অতঃপর ‘আবদুল্লাহ ইবনু রাওয়াহা (রাঃ) পতাকা ধারণ করেছেন এবং শাহাদাত লাভ করেছেন। অতঃপর খালিদ ইবনু অলীদ (রাঃ) মনোনয়ন ব্যতীতই পতাকা ধারণ করেছেন, আল্লাহ তা‘আলা তাঁর মাধ্যমে বিজয় দান করেছেন আর বললেন, এ আমার নিকট পছন্দনীয় নয় অথবা রাবী বলেন, তাদের নিকট পছন্দনীয় নয় যে, তারা দুনিয়ায় আমার নিকট অবস্থান করতো। রাবী বলেন, আর তাঁর চক্ষুদ্বয় হতে অশ্রু প্রবাহিত হচ্ছিল। (১২৪৬) (আধুনিক প্রকাশনীঃ ২৮৩৩, ইসলামিক ফাউন্ডেশনঃ ২৮৪৪)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 268
			}
		},
		{
			"hadithnumber": 3064,
			"arabicnumber": 3064,
			"text": "আনাস (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট রি-ল, যাকওয়ান, উসাইয়াহ ও বানূ লাহ্ইয়ান গোত্রের কিছু লোক এসে বলল, আমরা ইসলাম গ্রহণ করেছি। এবং তারা তাঁর নিকট তাদের গোত্রের মুকাবেলায় সাহায্য প্রার্থনা করল। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সত্তর জন আনসার পাঠিয়ে তাদের সাহায্য করলেন। আনাস (রাঃ) বলেন, আমরা তাঁদের ক্বারী নামে আখ্যায়িত করতাম। তাঁরা দিনের বেলায় লাকড়ি সংগ্রহ করতেন, আর রাত্রিকালে সালাতে মগ্ন থাকতেন। তারা তাঁদের নিয়ে রওয়ানা হয়ে গেল। যখন তাঁরা ‘বীরে মা‘উনাহ’[১] নামক স্থানে পৌঁছল, তখন তারা বিশ্বাসঘাতকতা করল এবং তাঁদের হত্যা করে ফেলল। এ সংবাদ শোনার পর আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রিল, যাকওয়ান ও বানূ লাহ্ইয়ান গোত্রের বিরুদ্ধে দু‘আ করে এক মাস যাবৎ কুনূতে নাযিলা পাঠ করেন। ক্বাতাদাহ (রহ.) বলেন, আনাস (রাঃ) আমার নিকট বর্ণনা করেছেন যে, তাঁরা তাদের সম্পর্কে কিছুকাল যাবৎ কুরআনের এ আয়াতটি পড়তে থাকেনঃ ‘‘আমাদের সংবাদ আমাদের কাওমের নিকট পৌঁছিয়ে দাও যে, আমরা আমাদের প্রতিপালকের সাক্ষাৎ পেয়েছি। তিনি আমাদের প্রতি সন্তুষ্ট হয়েছেন আর তিনি আমাদের সন্তুষ্ট করেছেন।’ অতঃপর এ আয়াত উঠিয়ে নেয়া হয়। (১০০১) (আধুনিক প্রকাশনীঃ ২৮৩৪, ইসলামিক ফাউন্ডেশনঃ ২৮৪৫)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 269
			}
		},
		{
			"hadithnumber": 3065,
			"arabicnumber": 3065,
			"text": "আবূ ত্বলহা (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন কোন সম্প্রদায়ের উপর বিজয় লাভ করতেন, তখন তিনি তাদের বাহির অঙ্গণে তিন রাত্রি অবস্থান করতেন। মু‘আয, ‘আবদুল আ‘লা ও আবূ ত্বলহা (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে হাদীস বর্ণনায় রাওহা ইবনে ‘উবাদাহ (রহ.)-এর অনুসরণ করেছেন। (৩৯৭৬) (আধুনিক প্রকাশনীঃ ২৮৩৫, ইসলামিক ফাউন্ডেশনঃ ২৮৪৬)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 270
			}
		},
		{
			"hadithnumber": 3066,
			"arabicnumber": 3066,
			"text": "وَقَالَ رَافِعٌ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم بِذِي الْحُلَيْفَةِ فَأَصَبْنَا غَنَمًا وَإِبِلًا فَعَدَلَ عَشَرَةً مِنْ الْغَنَمِ بِبَعِيْرٍ রাফি‘ (রাঃ) বলেন, আমরা যুল-হুলাইফাহ নামক স্থানে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে ছিলাম। তখন আমরা উট ও বকরী লাভ করলাম। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দশটি বকরীকে একটি উটের সমান গণ্য করেন। ৩০৬৬. আনাস (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জিরানা নামক জায়গা হতে ‘উমরাহর জন্য ইহরাম বাঁধলেন, যেখানে তিনি হুনাইন যুদ্ধের গনীমত বণ্টন করেছিলেন। (১৭৭৮) (আধুনিক প্রকাশনীঃ ২৮৩৬, ইসলামিক ফাউন্ডেশনঃ ২৮৪৭)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 271
			}
		},
		{
			"hadithnumber": 3067,
			"arabicnumber": 3067,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন যে, তাঁর একটি ঘোড়া ছুটে গেলে শত্রু তা আটক করে। অতঃপর মুসলিমগণ তাদের উপর বিজয় লাভ করেন। তখন সে ঘোড়াটি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর যুগেই তাঁকে ফেরত দেয়া হয়। আর তাঁর একটি গোলাম পলায়ন করে রোমের কাফিরদের সঙ্গে মিলিত হয়। অতঃপর মুসলিমগণ তাদের উপর বিজয় অর্জন করেন। তখন খালিদ ইবনু ওয়ালীদ (রাঃ) রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর যামানার পর তা তাঁকে ফেরত দিয়ে দেন। (৩০৬৮, ৩০৬৯) (ইসলামিক ফাউন্ডেশনঃ ১৯২৮ পরিচ্ছেদ)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 272
			}
		},
		{
			"hadithnumber": 3068,
			"arabicnumber": 3068,
			"text": "নাফি‘ (রহ.) হতে বর্ণিত যে, ইবনু ‘উমার (রাঃ)-এর একটি গোলাম পালিয়ে গিয়ে রোমের মুশরিকদের সঙ্গে মিলিত হয়। অতঃপর খালিদ ইবনু ওয়ালীদ (রাঃ) রোম জয় করেন। তখন তিনি সে গোলামাটি ‘আবদুল্লাহ (ইবনু ‘উমার) (রাঃ)-কে ফেরত দিয়ে দেন। আর ‘আবদুল্লাহ ইবনু ‘উমার (রাঃ)-এর একটি ঘোড়া ছুটে গিয়ে রোমে পৌঁছে যায়। অতঃপর উক্ত এলাকা মুসলিমদের দখলে আসলে তারা ঘোড়াটি ইবনু ‘উমার (রাঃ)-কে ফেরত দিয়ে দেন। আবূ ‘আবদুল্লাহ (রাঃ) বলেন, عَارَ শব্দটি العير হতে উদগত। আর তা হল বন্য গাধা। عَارَ-এর অর্থ هَرَبَ অর্থাৎ পলায়ন করেছে। (৩০৬৭) (আধুনিক প্রকাশনীঃ ২৮৩৭, ইসলামিক ফাউন্ডেশনঃ ২৮৪৮)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 273
			}
		},
		{
			"hadithnumber": 3069,
			"arabicnumber": 3069,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত যে, তিনি একটি ঘোড়ার উপর আরোহী ছিলেন। যখন মুসলিমগণ রোমীয়দের সঙ্গে যুদ্ধ করছিলেন, সে সময় মুসলিমদের অধিনায়ক হিসেবে খালিদ ইবনু ওয়ালীদ (রাঃ)-কে আবূ বাকর সিদ্দীক (রাঃ) নিযুক্ত করেছিলেন। সে সময় দুশমনরা তাঁর ঘোড়াটিকে নিয়ে যায়। অতঃপর যখন দুশমনরা পরাজিত হল তখন খালিদ ইবনু ওয়ালীদ (রাঃ) তাঁর ঘোড়াটি তাঁকে ফেরত দেন। (৩০৬৭) (আধুনিক প্রকাশনীঃ ২৮৩৮, ইসলামিক ফাউন্ডেশনঃ ২৮৪৯)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 274
			}
		},
		{
			"hadithnumber": 3070,
			"arabicnumber": 3070,
			"text": "(وَقَوْلُهُ تَعَالى : )وَاخْتِلٰفِ اَلْسِنَتِكُمْ وَأَلْوٰنِكُمْ ) )وَمآ أَرْسَلْنَا مِنْ رَّسُوْلٍ إِلَّا بِلِسَانِ قَوْمِهِ( আল্লাহ তা’আলার বাণীঃ আর তোমাদের ভাষা ও বর্ণের বিভিন্নতার মধ্যে (রূম ২২) এবং তিনি আরও বলেছেনঃ আর আমি প্রত্যেক রাসূলকেই তার নিজ জাতির ভাষাভাষী করে পাঠিয়েছি। (ইব্রাহীম ৪) ৩০৭০. জাবির ইবনু ‘আবদুল্লাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, খন্দকের যুদ্ধের দিন আমি বললাম, হে আল্লাহর রাসূল! আমি আমার একটি ছাগল ছানা যব্হ করেছি এবং আমার স্ত্রী এক সা যবের আটা পাকিয়েছে। আপনি কয়েকজন সঙ্গীসহ আসুন। তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উচ্চস্বরে বলে উঠলেন, হে খন্দকের লোকেরা! জাবির তোমাদের জন্য খানার আয়োজন করেছে, তাই তোমরা চল। (৪১০১, ৪১০২) (আধুনিক প্রকাশনীঃ ২৮৩৯, ইসলামিক ফাউন্ডেশনঃ ২৮৫০)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 275
			}
		},
		{
			"hadithnumber": 3071,
			"arabicnumber": 3071,
			"text": "উম্মু খালিদ বিনতে খালিদ ইবনু সা‘ঈদ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি আমার পিতার সঙ্গে হলুদ বর্ণের জামা পরে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট আসলাম। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, সান্না-সান্না। (রাবী) ‘আবদুল্লাহ (রহ.) বলেন, হাবশী ভাষায় তা ‘সুন্দর’ অর্থ বুঝায়। উম্মু খালিদ (রাঃ) বলেন, অতঃপর আমি তাঁর মহরে নবুয়্যতের স্থান নিয়ে কৌতুক করতে লাগলাম। আমার পিতা আমাকে ধমক দিলেন। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, ‘ছোট মেয়ে তাকে করতে দাও।’ অতঃপর আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে বললেন, এ কাপড় পর আর পুরানো কর, আবার পর, পুরানো কর, আবার পর, পুরানো কর। ‘আবদুল্লাহ্ (ইবনু মুবারক) (রহ.) বলেন, উম্মু খালিদ (রাঃ) যতদিন জীবিত থাকেন, তাঁর আলোচনা চলতে থাকে। (৩৮৭৪, ৫৮২৩, ৫৮৪৫, ৫৯৯৩) (আধুনিক প্রকাশনীঃ ২৮৪০, ইসলামিক ফাউন্ডেশনঃ ২৮৫১)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 276
			}
		},
		{
			"hadithnumber": 3072,
			"arabicnumber": 3072,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত যে, হাসান ইবনু ‘আলী (রাঃ) সদাকাহর খেজুর হতে একটি খেজুর নিয়ে তা তাঁর মুখে দেন। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কাখ্-খাখ্ বললেন, তুমি কি জান না যে, আমরা সদা্কাহ খাই না। (১৪৮৫) (আধুনিক প্রকাশনীঃ ২৮৪১, ইসলামিক ফাউন্ডেশনঃ ২৮৫২)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 277
			}
		},
		{
			"hadithnumber": 3073,
			"arabicnumber": 3073,
			"text": "(وَقَوْلِ اللهِ تَعَالَى )وَمَنْ يَّغْلُلْ يَأْتِ بِمَا غَلَّ( ( آل عمران : 161) আল্লাহ তা‘আলার বাণীঃ ‘‘কেউ কোন কিছু অন্যায়ভাবে গোপন করে রাখলে সে তা কিয়ামতের দিন নিয়ে আসবে।’’ (আলে ‘ইমরান ১৬১) ৩০৭৩. আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের মাঝে দাঁড়ান এবং গানীমাতের মাল আত্মসাৎ প্রসঙ্গে আলোচনা করেন। আর তিনি তা মারাত্মক অপরাধ ও তার ভয়াবহ পরিণতির কথা উল্লেখ করেন। তিনি বললেন, আমি তোমাদের কাউকে যেন এ অবস্থায় কিয়ামতের দিন না পাই যে, তাঁর কাঁধে বকরি বয়ে বেড়াচ্ছে আর তা ভ্যাঁ ভ্যাঁ করে চিৎকার দিচ্ছে। অথবা তাঁর কাঁধে রয়েছে ঘোড়া আর তা হি হি করে আওয়াজ দিচ্ছে। ঐ ব্যক্তি আমাকে বলবে, হে আল্লাহর রাসূল! আমাকে সাহায্য করুন। আমি বলব, আমি তোমার জন্য কিছু করতে পারব না। আমি তো (দুনিয়ায়) তোমার নিকট পৌছে দিয়েছি। অথবা কেউ তার কাঁধে বয়ে বেড়াবে উট যা চিৎকার করছে, সে আমাকে বলবে, হে আল্লাহর রাসূল! একটু সাহায্য করুন। আমি বলব, আমি তোমার জন্য কিছু করতে পারব না। আমি তো তোমার নিকট পৌঁছে দিয়েছি। অথবা কেউ তার কাঁধে বয়ে বেড়াবে ধন-দৌলত এবং আমাকে বলবে, হে আল্লাহর রাসূল! আমাকে সাহায্য করুন। আমি বলব, আমি তোমার জন্য কিছু করতে পারব না। আমি তো তোমার নিকট পৌঁছে দিয়েছি। অথবা কেউ তার কাঁধে বয়ে বেড়াবে কাপড়ের টুকরাসমূহ যা দুলতে থাকবে। সে আমাকে বলবে, হে আল্লাহর রাসূল! আমাকে সাহায্য করুন। আমি বলব, আমি তোমার জন্য কিছু করতে পারব না; আমি তো তোমার নিকট পৌঁছে দিয়েছি। (১৪০২) (মুসলিম ৩৩/৬ হাঃ ১৮৩১) (আধুনিক প্রকাশনীঃ ২৮৪২, ইসলামিক ফাউন্ডেশনঃ ২৮৫৩)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 278
			}
		},
		{
			"hadithnumber": 3074,
			"arabicnumber": 3074,
			"text": "وَلَمْ يَذْكُرْ عَبْدُ اللهِ بْنُ عَمْرٍو عَنْ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ حَرَّقَ مَتَاعَهُ وَهَذَا أَصَحُّ ‘আবদুল্লাহ ইবনু ‘আমর (রাঃ) রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এ বর্ণনায় তিনি আত্মসাৎকারীর মালপত্র জ্বালিয়ে দিয়েছেন- কথাটি উল্লেখ করেননি। এটাই বিশুদ্ধ। ৩০৭৪. ‘আবদুল্লাহ ইবনু ‘আমর (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর পাহারা দেয়ার জন্য এক ব্যক্তি নিযুক্ত ছিল। তাকে কার্কারা নামে ডাকা হত। সে মারা গেল। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, সে জাহান্নামী! লোকেরা তাকে দেখতে গেল আর তারা একটি আবা পেল যা সে আত্মসাত করেছিল। আবূ ‘আবদুল্লাহ (রহ.) বলেন, ইবনু সালাম (রহ.) বলেছেন, কারকারা। (আধুনিক প্রকাশনীঃ ২৮৪৩, ইসলামিক ফাউন্ডেশনঃ ২৮৫৪)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 279
			}
		},
		{
			"hadithnumber": 3075,
			"arabicnumber": 3075,
			"text": "রাফি‘ ইবনু খাদীজ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে যুল-হুলাইফায় অবস্থান করছিলাম। লোকেরা ক্ষুধার্ত হয়েছিল। আর আমরা গানীমাত স্বরূপ কিছু উট ও বকরী লাভ করেছিলাম। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম লোকদের পেছনে সারিতে ছিলেন। লোকেরা তাড়াতাড়ি করে পাতিল চড়িয়ে দিয়েছিল। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নির্দেশ দিলেন এবং পাতিলগুলো উপুড় করে ফেলে দেয়া হল। অতঃপর তিনি দশটি বকরীকে একটি উটের সমান ধরে তা বণ্টন করে দিলেন। তার নিকট হতে একটি উট পালিয়ে গেল। লোকদের নিকট ঘোড়া কম ছিল। তাঁরা তা অনুসন্ধানে বেরিয়ে গেল এবং তারা ক্লান্ত হয়ে পড়ল। অতঃপর এক ব্যক্তি উটটির প্রতি তীর নিক্ষেপ করল, আল্লাহ তা‘আলা তার গতিরোধ করে দিলেন। তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, ‘এ সকল গৃহপালিত জন্তুর মধ্যেও কতক বন্য পশুর মত অবাধ্য হয়ে যায়। সুতরাং যা তোমাদের নিকট হতে পলায়ন করে তার সঙ্গে এরূপ আচরণ করবে।’ রাবী বলেন, আমার দাদা রাফি‘ ইবনু খাদীজ (রাঃ) বলেছেন, আমরা আশা করি কিংবা বলেছেন আশঙ্কা করি যে, আমরা আগামীকাল শত্রুর মুখোমুখী হব। আর আমাদের সঙ্গে ছুরি নেই। আমরা কি বাঁশের ধারালো চোকলা দ্বারা যব্হ করব? আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, ‘যা রক্ত প্রবাহিত করে এবং আল্লাহর নাম উচ্চারণ করা হয়েছে তা আহার কর। কিন্তু দাঁত ও নখ দিয়ে নয়। কারণ আমি বলে দিচ্ছিঃ তা এই যে, দাঁত হল হাড় আর নখ হল হাবশীদের ছুরি।’ (২৪৮৮) (আধুনিক প্রকাশনীঃ ২৮৪৪, ইসলামিক ফাউন্ডেশনঃ ২৮৫৫)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 280
			}
		},
		{
			"hadithnumber": 3076,
			"arabicnumber": 3076,
			"text": "জারীর ইবনু ‘আবদুল্লাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে বললেন, ‘তুমি কি যুলখালাসা মন্দিরটিকে ধ্বংস করে আমাকে সান্ত্বনা দিবে না?’ এ ঘরটি খাস‘আম গোত্রের একটি মন্দির ছিল। যাকে ইয়ামানের কা‘বা বলা হতো। অতঃপর আমি আহমাস গোত্রের দেড়শ’ লোক নিয়ে রওয়ানা হলাম। তাঁরা সবাই দক্ষ ঘোড় সওয়ার ছিলেন। আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে জানালাম যে, আমি ঘোড়ার উপর স্থির থাকতে পারি না। তখন তিনি আমার বুকে হাত দ্বারা আঘাত করলেন। এমন কি আমি আমার বুকে তাঁর আঙ্গুলের ছাপ দেখতে পেলাম এবং তিনি আমার জন্য দু‘আ করে বললেন, ‘হে আল্লাহ! তাকে ঘোড়ার পিঠে স্থির রাখ এবং তাকে পথপ্রদর্শক ও সুপথপ্রাপ্ত করুন।’ অবশেষে জারীর (রাঃ) তথায় গমন করলেন। ঐ মন্দিরটি ভেঙ্গে দিলেন ও জ্বালিয়ে দিলেন। অতঃপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে সুসংবাদ প্রদানের জন্য দূত পাঠালেন। জারীর (রাঃ)-এর দূত রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বললেন, যিনি আপনাকে সত্য দ্বীনসহ প্রেরণ করেছেন, সে সত্তার কসম! আমি ততক্ষণ পর্যন্ত আপনার নিকট আসিনি, যতক্ষণ না আমি তাকে জ্বালিয়ে কাল উটের মত করে ছেড়েছি। তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আহমাস গোত্রের অশ্বারোহী ও পদাতিক লোকদের জন্য পাঁচবার বরকতের দু’আ করলেন। মুসাদ্দাদ (রহ.) বলেন, হাদীসে উল্লেখিত যুলখালাস অর্থ খাস‘আম গোত্রের একটি ঘর। (৩০২০) (আধুনিক প্রকাশনীঃ ২৮৪৫, ইসলামিক ফাউন্ডেশনঃ ২৮৫৬)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 281
			}
		},
		{
			"hadithnumber": 3077,
			"arabicnumber": 3077,
			"text": "৫৬/১৯৩. بَابُ مَا يُعْطَى الْبَشِيْرُ ৫৬/১৯৩. অধ্যায় : সুসংবাদ বহনকারীকে পুরস্কৃত করা। وَأَعْطَى كَعْبُ بْنُ مَالِكٍ ثَوْبَيْنِ حِيْنَ بُشِّرَ بِالتَّوْبَةِ কা‘ব ইবনু মালিক (রাঃ)-কে যখন তওবা কবুলের সুসংবাদ দান করা হয়, তখন তিনি সংবাদদাতাকে পুরস্কার স্বরূপ দু’খানা কাপড় দান করেছিলেন। ৩০৭৭. ‘আবদুল্লাহ্ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মক্কা বিজয়ের দিন বলেছেন, ‘মক্কা বিজয়ের পর হতে (মক্কা থেকে) হিজরাতের প্রয়োজন নেই। কিন্তু জিহাদ ও নেক কাজের নিয়্যাত বাকী আছে আর যখন তোমাদের জিহাদের ডাক দেয়া হবে তখন তোমরা বেরিয়ে পড়বে।’ (১৩৪৯) (আধুনিক প্রকাশনীঃ ২৮৪৬, ইসলামিক ফাউন্ডেশনঃ ২৮৫৭)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 282
			}
		},
		{
			"hadithnumber": 3079,
			"arabicnumber": 3079,
			"text": "",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 283
			}
		},
		{
			"hadithnumber": 3080,
			"arabicnumber": 3080,
			"text": "‘আত্বা (রহ.) হতে বর্ণিত। তিনি বলেন, আমি ‘উবাইদ ইবনু ‘উমাইর (রাঃ) সহ ‘আয়িশাহ (রাঃ)-এর নিকট গেলাম। তখন তিনি সাবীর পাহাড়ের উপর অবস্থান করছিলেন। তিনি আমাদেরকে বললেন, ‘যখন হতে আল্লাহ্ তা‘আলা তাঁর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে মক্কা বিজয় দান করেছেন, তখন থেকে হিজরাত বন্ধ হয়ে গেছে। (৩৯০০, ৪৩১২) (আধুনিক প্রকাশনীঃ ২৮৪৮, ইসলামিক ফাউন্ডেশনঃ ২৮৫৯)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 284
			}
		},
		{
			"hadithnumber": 3081,
			"arabicnumber": 3081,
			"text": "আবূ ‘আবদুর রাহমান (রহ.) হতে বর্ণিত। আর তিনি ছিলেন ‘উসমান (রাঃ)-এর সমর্থক। তিনি ইবনু আতিয়্যাকে উদ্দেশ্য করে বলেন, যিনি ‘আলী (রাঃ)-এর সমর্থক ছিলেন, কোন্ বস্তু তোমাদের সাথী (আলী (রাঃ)-কে রক্তপাতে সাহস যুগিয়েছে, তা আমি জানি। আমি তাঁর নিকট শুনেছি, তিনি বলতেন, ‘রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে এবং যুবাইর (ইবনু আওয়াম) (রাঃ)-কে প্রেরণ করেছেন, আর বলেছেন, তোমরা খাক বাগানের দিকে চলে যাও, সেখানে তোমরা একজন মহিলাকে পাবে, হাতিব তাকে একটি পত্র দিয়েছে।’ আমরা সে বাগানে পৌঁছলাম এবং মহিলাটিকে বললাম, পত্রখানি দাও, সে বলল, আমাকে কোন পত্র দেয়নি। তখন আমরা বললাম, ‘হয় তুমি পত্র বের করে দাও, নচেৎ আমরা তোমাকে বিবস্ত্র করব।’ তখন সে মহিলা তার কেশের ভাঁজ থেকে পত্রখানা বের করে দিল। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হাতিবকে ডেকে পাঠান। তখন সে বলল, ‘আমার ব্যাপারে তাড়াহুড়ো করবেন না। আল্লাহর কসম! আমি কুফরী করিনি, আমার হৃদয়ে ইসলামের প্রতি অনুরাগই বর্ধিত হয়েছে। আপনার সাহাবীগণের মধ্যে কেউই এমন নেই, মক্কা্য় যার সাহায্যকারী আত্মীয়-স্বজন না আছে। যদ্দবারা আল্লাহ তা‘আলা তাঁর পরিবার-পরিজন ধন-সম্পদ রক্ষা করেছেন। আর আমার এমন কেউ নেই। তাই আমি তাদের প্রতি অনুগ্রহ করতে চেয়েছি। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে সত্যবাদী হিসেবে স্বীকার করে নিলেন। ‘উমার (রাঃ) বললেন, ‘লোকটিকে আমার হাতে ছেড়ে দিন, আমি তার গর্দান উড়িয়ে দেই, সে তো মুনাফিকী করেছে। তখন রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, ‘তুমি জান কি? অবশ্যই আল্লাহ তা‘আলা আহলে বাদার সম্পর্কে ভালভাবে জানেন এবং তাদের সম্পর্কে তিনি বলেছেন, ‘তোমরা যেমন ইচ্ছা ‘আমল কর।’ একথাই তাঁকে (আলী (রাঃ) দুঃসাহসী করেছে। (৩০০৭) (আধুনিক প্রকাশনীঃ ২৮৪৯, ইসলামিক ফাউন্ডেশনঃ ২৮৬০)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 285
			}
		},
		{
			"hadithnumber": 3082,
			"arabicnumber": 3082,
			"text": "ইবনু আবূ মুলাইকা (রহ.) হতে বর্ণিত যে, ইবনু যুবাইর (রাঃ), ইবনু জা‘ফর (রাঃ)-কে বললেন, তোমার কি মনে আছে, যখন আমি ও তুমি এবং ইবনু ‘আব্বাস (রাঃ) আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে মিলিত হয়েছিলাম? ইবনু জা‘ফর (রাঃ) বললেন, হ্যাঁ, স্মরণ আছে। রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদেরকে বাহনে তুলে নিলেন আর তোমাকে ছেড়ে আসলেন। (মুসলিম ৪৪/১১ হাঃ ২৪২৭) (আধুনিক প্রকাশনীঃ ২৮৫০, ইসলামিক ফাউন্ডেশনঃ ২৮৬১)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 286
			}
		},
		{
			"hadithnumber": 3083,
			"arabicnumber": 3083,
			"text": "সায়িব ইবনু ইয়াযীদ (রাঃ) হতে বর্ণিত। তিনি বলেন, অন্যান্য শিশুদের সাথে আমরাও আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে অভ্যর্থনা জানানোর উদ্দেশে সানিয়্যাতুল বিদা পর্যন্ত গিয়েছিলাম। (৪৪২৬, ৪৪২৭) (আধুনিক প্রকাশনীঃ ২৮৫১, ইসলামিক ফাউন্ডেশনঃ ২৮৬২)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 287
			}
		},
		{
			"hadithnumber": 3084,
			"arabicnumber": 3084,
			"text": "‘আবদুল্লাহ (রাঃ) হতে বর্ণিত, যখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জিহাদ হতে ফিরতেন, তখন তিনবার তাকবীর বলতেন। অতঃপর বলতেন, আল্লাহর ইচ্ছায় আমরা প্রত্যাবর্তনকারী, গুনাহ হতে তাওবাকারী, তাঁরই ‘ইবাদাতকারী, প্রশংসাকারী, আমাদের প্রতিপালককে সিজ্দাকারী। আল্লাহ তাআলা তাঁর অঙ্গীকার সত্য প্রমাণিত করেছেন, তাঁর বান্দাকে সাহায্য করেছেন এবং একাই শত্রু দলকে পরাভূত করেছেন। (১৭৯৭) (আধুনিক প্রকাশনীঃ ২৮৫২, ইসলামিক ফাউন্ডেশনঃ ২৮৬৩)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 288
			}
		},
		{
			"hadithnumber": 3085,
			"arabicnumber": 3085,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। তিনি বলেন, উসফান হতে প্রত্যাবর্তনের সময় আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সাথে ছিলাম, আর আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর সাওয়ারীর উপর আরোহী ছিলেন। তিনি সাফিয়্যা বিনতে হুয়াই (রাঃ)-কে তাঁর পেছনে সাওয়ারীর উপর বসিয়েছিলেন। এ সময় উট পিছলিয়ে গেল এবং তাঁরা উভয়ে ছিটকে পড়েন। এ দেখে আবূ ত্বলহা (রাঃ) দ্রুত এসে বললেন, ‘হে আল্লাহর রাসূল! আল্লাহ তা‘আলা আমাকে আপনার জন্য কুরবান করুন। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আগে মহিলার খোঁজ নাও। আবূ ত্বলহা (রাঃ) তখন একটা কাপড়ে নিজ মুখমন্ডল ঢেকে তাঁর নিকট আসলেন এবং সে কাপড়টা দিয়ে তাকে ঢেকে দিলেন। অতঃপর তাঁদের দু’জনের জন্য সাওয়ারীকে ঠিক করলেন। তাঁরা উভয়ে আরোহণ করলেন, আর আমরা সবাই আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর চারপাশে বেষ্টন করে চললাম। যখন আমরা মদিনার নিকটবর্তী হলাম, তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লামএ দু‘আ পড়লেন آيِبُوْنَ تَائِبُوْنَ عَابِدُوْنَ لِرَبِّنَا حَامِدُوْنَ আমরা প্রত্যাবর্তনকারী, আমরা তাওবাকারী, আমরা ‘ইবাদাতকারী, আমরা আমাদের প্রতিপালকের প্রশংসাকারী। আর মদিনা্য় প্রবেশ করা পর্যন্ত তিনি এ দু‘আ পড়তে থাকলেন। (৩৭১) (আধুনিক প্রকাশনীঃ ২৮৫৩, ইসলামিক ফাউন্ডেশনঃ ২৮৬৪)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 289
			}
		},
		{
			"hadithnumber": 3086,
			"arabicnumber": 3086,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত যে, তিনি ও আবূ ত্বলহা (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে চলছিলেন। আর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে সাফিয়্যাহ (রাঃ)-ও ছিলেন। তিনি তাঁকে নিজ সাওয়ারীতে তাঁর পেছনে বসিয়ে ছিলেন। পথিমধ্যে এক জায়গায় উটনীটির পা পিছলে গেল। এতে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও সাফিয়্যাহ (রাঃ) ছিটকে পড়ে গেলেন। আর আবূ ত্বলহা (রাঃ) তার উট হতে তাড়াতাড়ি নেমে রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট বললেন, ‘হে আল্লাহর নবী! আল্লাহ তা‘আলা আমাকে আপনার জন্য কুরবান করুন। আপনার কি কোন আঘাত লেগেছে?’ আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, ‘না। তবে তুমি মহিলাটির খোঁজ নাও।’ আবূ ত্বলহা (রাঃ) একখানা কাপড় দিয়ে মুখমন্ডল ঢেকে তাঁর নিকট গেলেন আর সেই কাপড় দিয়ে তাঁকে ঢেকে দিলেন। তখন সাফিয়্যাহ (রাঃ) উঠে দাঁড়ালেন। অতঃপর তিনি আবূ ত্বলহা (রাঃ) তাঁদের উভয়ের জন্য সাওয়ারীটি উত্তমরূপে বাঁধলেন। আর তাঁরা উভয়ে (তার উপর) আরোহণ করে চলতে শুরু করেন। অবশেষে যখন তাঁরা মদিনার উপকন্ঠে পৌঁছলেন অথবা বর্ণনাকারী বলেন, যখন মদিনার নিকটবর্তী হলেন, তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এ দু‘আ পড়লেন, ‘‘আমরা প্রত্যাবর্তনকারী, তাওবাকারী, ‘ইবাদাতকারী এবং আমাদের প্রতিপালকের প্রশংসাকারী।’ আর মদিনা্য় প্রবেশ করা পর্যন্ত তিনি এ দু‘আ পড়তে থাকেন। (৩৭১) (আধুনিক প্রকাশনীঃ ২৮৫৪, ইসলামিক ফাউন্ডেশনঃ ২৮৬৫)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 290
			}
		},
		{
			"hadithnumber": 3087,
			"arabicnumber": 3087,
			"text": "জাবির ইবনু ‘আবদুল্লাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, এক সফরে আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে ছিলাম। আমরা যখন মদিনা্য় উপস্থিত হলাম, তখন তিনি আমাকে বললেন, ‘মসজিদে প্রবেশ কর এবং দু’ রাক‘আত সালাত আদায় কর।’ (৪৪৩) (আধুনিক প্রকাশনীঃ ২৮৫৫, ইসলামিক ফাউন্ডেশনঃ ২৮৬৬)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 291
			}
		},
		{
			"hadithnumber": 3088,
			"arabicnumber": 3088,
			"text": "কা’ব (ইবনু মালিক) (রাঃ) হতে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন চাশতের সময় সফর হতে ফিরতেন, তখন মসজিদে প্রবেশ করে বসার পূর্বে দু’ রাক‘আত সালাত আদায় করে নিতেন। (২৭৫৭) (আধুনিক প্রকাশনীঃ ২৮৫৬, ইসলামিক ফাউন্ডেশনঃ ২৮৬৭)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 292
			}
		},
		{
			"hadithnumber": 3089,
			"arabicnumber": 3089,
			"text": "জাবির ইবনু ‘আবদুল্লাহ (রাঃ) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন মদিনা্য় ফিরতেন, তখন তিনি একটি উট অথবা একটি গাভী যব্হ করতেন। আর মু‘আয (রাঃ)....জাবির ইবনু ‘আবদুল্লাহ্ (রাঃ) হতে অতিরিক্ত বর্ণনা করেছেন যে, [জাবির (রাঃ) বলেন] আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার নিকট হতে এক উট দু’ উকিয়া ও একটি দিরহাম কিংবা দু’ দিরহাম দ্বারা কিনে নেন এবং তিনি যখন সিরার নামক স্থানে পৌঁছেন, তখন একটি গাভী যব্হ করার নির্দেশ দেন। অতঃপর তা যব্হ করা হয় এবং সকলে তার গোশ্ত আহার করে। আর যখন তিনি মদিনা্য় উপস্থিত হলেন তখন আমাকে মসজিদে প্রবেশ করে দু’ রাক‘আত সালাত আদায় করতে আদেশ করলেন এবং আমাকে উটের মূল্য পরিশোধ করে দিলেন। (৪৪৩) (আধুনিক প্রকাশনীঃ ২৮৫৭, ইসলামিক ফাউন্ডেশনঃ ২৮৬৮)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 293
			}
		},
		{
			"hadithnumber": 3090,
			"arabicnumber": 3090,
			"text": "জাবির (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি এক সফর হতে ফিরে এলাম। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে বললেন, ‘দু’ রাক‘আত সালাত আদায় করে নাও।’ সিরার হচ্ছে মদিনার সন্নিকটে একটি স্থানের নাম। (৪৪৩) (আধুনিক প্রকাশনীঃ ২৮৫৮, ইসলামিক ফাউন্ডেশনঃ ২৮৬৯)",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 294
			}
		}
	]
}