{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"59": "Beginning of Creation"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3190,
			"arabicnumber": 3190,
			"text": "(قَالَ الرَّبِيْعُ بْنُ خُثَيْمٍ وَالْحَسَنُ كُلٌّ عَلَيْهِ هَيِّنٌ هَيْنٌ وَهَيِّنٌ مِثْلُ لَيْنٍ وَلَيِّنٍ وَمَيْتٍ وَمَيِّتٍ وَضَيْقٍ وَضَيِّقِ )أَفَعَيِيْنَا( : أَفَأَعْيَا عَلَيْنَا حِيْنَ أَنْشَأَكُمْ وَأَنْشَأَ خَلْقَكُمْ )لُغُوْبٌ( (فاطر : 38) النَّصَبُ )أَطْوَارًا( (نوح : 14) طَوْرًا كَذَا وَطَوْرًا كَذَا عَدَا طَوْرَهُ أَيْ قَدْرَهُ রাবী ইবনু খুসাইম এবং হাসান বসরী (রহ.) বলেন, সব কিছুই তাঁর জন্য সহজ। আর هَيْنٌও هَيِّنٌ যার অর্থ সহজ, উচ্চারণের দিক দিয়ে যথাক্রমে لَيْنٌও لَيِّنٌ , مَيْتٌ ও مَيِّتٌ এবং ضَيْقٍ ও ضَيِّقٌ এর অনুরূপ। এর অর্থ أَفَعَيِيْنَا আমার পক্ষে কি এটা কঠিন, যখন তিনি তোমাদের পয়দা করেছেন এবং তোমাদের সৃষ্টির সূচনা করেছেন? لُغُوْبٌ ক্লান্তি। أَطْوَارًا বিভিন্ন অবস্থায় عَدَا طَوْرَهُ -সে তার মর্যাদা অতিক্রম করল। ৩১৯০. ‘ইমরান ইবনু হুসাইন (রাঃ) হতে বর্ণিত। তিনি বলেন, বানূ তামীমের একদল লোক নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট এল, তখন তিনি তাদের বললেন, হে তামীম সম্প্রদায়! সুসংবাদ গ্রহণ কর। তখন তারা বলল, আপনি তো সুসংবাদ জানিয়েছেন, এবার আমাদের দান করুন। এতে তাঁর মুখমন্ডল বিবর্ণ হয়ে গেল। এমন সময় তাঁর কাছে ইয়ামানের লোকজন এল। তখন তিনি বললেন, হে ইয়ামানবাসী! তোমরা সুসংবাদ গ্রহণ কর। কেননা তামীম সম্প্রদায়ের লোকেরা তা গ্রহণ করেনি। তারা বলল, আমরা গ্রহণ করলাম। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সৃষ্টির সূচনা এবং আরশ সম্পর্কে বর্ণনা করেন। এর মধ্যে জনৈক ব্যক্তি এসে বলল, হে ইমরান! তোমার উটনীটি পালিয়ে গেছে। হায়! আমি যদি উঠে না চলে যেতাম। [১] (৩১৯১, ৪৩৬৫, ৪৩৮৬, ৭৪১৮) (আধুনিক প্রকাশনীঃ ২৯৫০, ইসলামিক ফাউন্ডেশনঃ ২৯৬১)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3191,
			"arabicnumber": 3191,
			"text": "‘ইমরান ইবনু হুসাইন (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি আমার উটনীটি দরজার সঙ্গে বেঁধে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট উপস্থিত হলাম। তখন তাঁর নিকট তামীম সম্প্রদায়ের কিছু লোক এল। তিনি বললেন, হে তামীম সম্প্রদায়! তোমরা সুসংবাদ গ্রহণ কর। উত্তরে তারা বলল, আপনি তো আমাদের সুসংবাদ দিয়েছেন, এবার আমাদেরকে কিছু দান করুন। একথা দু’বার বলল। অতঃপর তাঁর নিকট ইয়ামানের কিছু লোক আসল। তিনি তাদের বললেন, হে ইয়ামানবাসী! তোমরা সুসংবাদ গ্রহণ কর। কারণ বানূ তামীম তা গ্রহণ করেনি। তারা বলল, হে আল্লাহর রাসূল! আমরা তা গ্রহণ করলাম। তারা আরো বলল, আমরা দ্বীন সম্পর্কে কিছু জিজ্ঞেস করার জন্য আপনার খেদমতে এসেছিলাম। তখন তিনি বললেন, একমাত্র আল্লাহই ছিলেন, আর তিনি ছাড়া আর কোন কিছুই ছিল না। তাঁর আরশ ছিল পানির উপরে। অতঃপর তিনি লাওহে মাহফুজে সব কিছু লিপিবদ্ধ করলেন এবং আকাশ ও পৃথিবী সৃষ্টি করলেন। এ সময় একজন ঘোষণাকারী ঘোষণা করল, হে ইবনু হুসাইন! আপনার উটনী পালিয়ে গেছে। তখন আমি এর খোঁজে চলে গেলাম। দেখলাম তা এত দূরে চলে গেছে যে, তার এবং আমার মধ্যে মরীচিকাময় ময়দান দূরত্ব হয়ে পড়েছে। আল্লাহর কসম! আমি তখন উটনীটিকে একেবারে ছেড়ে দেয়ার ইচ্ছা করলাম। (৩১৯০) (ইসলামিক ফাউন্ডেশনঃ ২৯৬২)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3192,
			"arabicnumber": 3192,
			"text": "তারিক ইবনু শিহাব (রহ.) হতে বর্ণিত। তিনি বলেন, আমি ‘উমার (রাঃ)-কে বলতে শুনেছি, একদা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের মধ্যে দাঁড়ালেন। অতঃপর তিনি আমাদের সৃষ্টির সূচনা সম্পর্কে জ্ঞাত করলেন। অবশেষে তিনি জান্নাতবাসী ও জাহান্নামবাসীর নিজ নিজ নির্দিষ্ট স্থানে প্রবেশ করার কথাও উল্লেখ করলেন। যে ব্যক্তি এ কথাটি স্মরণ রাখতে পেরেছে, সে স্মরণ রেখেছে আর যে ভুলে যাবার সে ভুলে গেছে। (আধুনিক প্রকাশনীঃ ২৯৫১, ইসলামিক ফাউন্ডেশনঃ ২৯৬২ শেষাংশ)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3193,
			"arabicnumber": 3193,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, মহান আল্লাহ বলেন, আদম সন্তান আমাকে গালি দেয় অথচ আমাকে গালি দেয়া তার উচিত নয়। আর সে আমাকে মিথ্যা জানে অথচ তার উচিত নয়। আমাকে গালি দেয়া হচ্ছে, তার এ উক্তি যে, আমার সন্তান আছে। আর তার মিথ্যা মনে করা হচ্ছে, তার এ উক্তি, যেভাবে আল্লাহ আমাকে প্রথমে সৃষ্টি করেছেন, সেভাবে কখনও তিনি আমাকে আবার সৃষ্টি করবেন না। (৪৯৭৪, ৪৯৭৫) (আধুনিক প্রকাশনীঃ ২৯৫২, ইসলামিক ফাউন্ডেশনঃ ২৯৬৩)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3194,
			"arabicnumber": 3194,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, আল্লাহ যখন সৃষ্টির কাজ শেষ করলেন, তখন তিনি তাঁর কিতাব লাওহে মাহ্ফুজে লিখেন, যা আরশের উপর তাঁর নিকট আছে। নিশ্চয়ই আমার রহমত আমার ক্রোধের উপর প্রবল। (৭৪০৪, ৭৪১২, ৭৪৫৩, ৭৫৫৩, ৭৫৫৪) (মুসলিম ৪৯/৪ হাঃ ২৭৫১, আহমাদ ৯৬০৩) (আধুনিক প্রকাশনীঃ ২৯৫৩, ইসলামিক ফাউন্ডেশনঃ ২৯৬৪)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 3195,
			"arabicnumber": 3195,
			"text": "(وَقَوْلِ اللهِ تَعَالَى )اللهُ الَّذِيْ خَلَقَ سَبْعَ سَمَوَاتٍ وَّمِنَ الْأَرْضِ مِثْلَهُنَّ يَتَنَزَّلُ الْأَمْرُ بَيْنَهُنَّ لِتَعْلَمُوْا أَنَّ اللهَ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ وَأَنَّ اللهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا( وَالسَّقْفِ الْمَرْفُوعِ : السَّمَاءُ. سَمْكَهَا : بِنَاءَهَا. الْحُبُكُ : اسْتِوَاؤُهَا وَحُسْنُهَا. وَأَذِنَتْ : سَمِعَتْ وَأَطَاعَتْ. وَأَلْقَتْ : أَخْرَجَتْ مَا فِيْهَا مِنْ الْمَوْتَى وَتَخَلَّتْ عَنْهُمْ. طَحَاهَا : دَحَاهَا. بِالسَّاهِرَةِ : وَجْهُ الأَرْضِ كَانَ فِيْهَا الْحَيَوَانُ نَوْمُهُمْ وَسَهَرُهُمْ. মহান আল্লাহর বাণীঃ আল্লাহ্ সেই সত্তা, যিনি সৃষ্টি করেছেন সাত আসমান এবং এর অনুরূপ যমীনও। (আত-ত্বলাক (তালাক)ঃ ১২) وَالسَّقْفِ الْمَرْفُوعِ আকাশ। سَمْكَهَا -এর ভিত্তি الْحُبُكُ তার সমতা ও সৌন্দর্য أَذِنَتْ-সে শুনল ও মান্য করল। أَلْقَتْ সে (যমীন) তার সকল মৃতকে বের করে দেবে এবং তা খালি হয়ে যাবে ওদের থেকে। طَحَاهَا তাকে সকল দিক হতে বিছিয়ে দিয়েছে। السَّاهِرَة ভূপৃষ্ঠ যা সকল প্রাণীর নিদ্রা ও জাগরণের স্থান। ৩১৯৫. আবূ সালামাহ ইবনু ‘আবদির রাহমান (রাঃ) হতে বর্ণিত। (তিনি বলেন), কয়েকজন লোকের সঙ্গে একখন্ড ভূমি নিয়ে তাঁর ঝগড়া ছিল। ‘আয়িশাহ (রাঃ)-এর নিকট এসে তা জানালেন। তিনি বললেন, হে আবূ সালামাহ! জমা-জমির গোলমাল হতে দূরে থাক। কেননা, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যে লোক এক বিঘত পরিমাণ অন্যের জমি অন্যায়ভাবে আত্মসাৎ করেছে, কিয়ামতের দিন সাত তবক যমীনের হার তার গলায় পরিয়ে দেয়া হবে। (২৪৫৩) (আধুনিক প্রকাশনীঃ ২৯৫৪, ইসলামিক ফাউন্ডেশনঃ ২৯৬৫)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3196,
			"arabicnumber": 3196,
			"text": "সালিম (রহ.)-এর পিতা হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যে লোক অন্যায়ভাবে কারো ভূমির সামান্যতম অংশও আত্মসাৎ করবে, কিয়ামতের দিন সাত তবক যমীনের নীচে তাকে ধ্বসিয়ে দেয়া হবে। (২৪৫৪) (আধুনিক প্রকাশনীঃ ২৯৫৫, ইসলামিক ফাউন্ডেশনঃ ২৯৬৬)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3197,
			"arabicnumber": 3197,
			"text": "আবূ বাকরাহ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, আল্লাহ যে দিন আসমান ও যমীন সৃষ্টি করেছেন, সে দিন হতে সময় যেভাবে আবর্তিত হচ্ছিল আজও তা সেভাবে আবর্তিত হচ্ছে। বারো মাসে এক বছর। এর মধ্যে চারটি মাস সম্মানিত। যুল-কা‘দাহ, যূল-হিজ্জাহ ও মুহাররাম। তিনটি মাস পরস্পর রয়েছে। আর একটি মাস হলো রজব-ই-মুযারা[1] যা জুমাদা ও শা‘বান মাসের মাঝে অবস্থিত। (৬৭) (আধুনিক প্রকাশনীঃ ২৯৫৬, ইসলামিক ফাউন্ডেশনঃ ২৯৬৭)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3198,
			"arabicnumber": 3198,
			"text": "সা‘ঈদ ইবনু যায়িদ ইবনে ‘আমর ইবনে নুফাইর (রাঃ) হতে বর্ণিত। ‘আরওয়া’ নামক এক মহিলা এক সাহাবীর বিরুদ্ধে মারওয়ানের নিকট তার ঐ পাওনার ব্যাপারে মামলা দায়ের করল, যা তার ধারণায় তিনি নষ্ট করেছেন। ব্যাপার শুনে সা‘ঈদ (রাঃ) বললেন, আমি কি তার সামান্য হকও নষ্ট করতে পারি? আমি তো সাক্ষ্য দিচ্ছি, আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি, যে ব্যক্তি জুলুম করে অন্যের এক বিঘত যমীনও আত্মসাৎ করে, কিয়ামতের দিন সাত তবক যমীনের শিকল তার গলায় পরিয়ে দেয়া হবে। ইবনু আবিয যিনাদ (রহ.) হিশাম (রহ.) থেকে, তিনি তাঁর পিতা হতে বর্ণনা করতে গিয়ে বলেছেন, তিনি (হিশামের পিতা ‘উরওয়াহ) (রাঃ) বলেন, সা‘ঈদ ইবনু যায়দ (রাঃ) আমাকে বলেছেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট উপস্থিত হলাম (তখন তিনি এ হাদীস বর্ণনা করেন)। (২৪৫২) (আধুনিক প্রকাশনীঃ ২৯৫৭, ইসলামিক ফাউন্ডেশনঃ ২৯৬৮)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3199,
			"arabicnumber": 3199,
			"text": "(بَابُ فِي النُّجُومِ ৫৯/৩. অধ্যায় : নক্ষত্ররাজি সম্পর্কে। وَقَالَ قَتَادَةُ )وَلَقَدْ زَيَّنَّا السَّمَآءَ الدُّنْيَا بِمَصَابِيْحَ( (الملك : 5) خَلَقَ هَذِهِ النُّجُومَ لِثَلَاثٍ جَعَلَهَا زِيْنَةً لِلسَّمَاءِ وَرُجُومًا لِّلشَّيَاطِيْنِ وَعَلَامَاتٍ يُهْتَدَى بِهَا فَمَنْ تَأَوَّلَ فِيْهَا بِغَيْرِ ذَلِكَ أَخْطَأَ وَأَضَاعَ نَصِيْبَهُ وَتَكَلَّفَ مَا لَا عِلْمَ لَهُ بِهِ وَقَالَ ابْنُ عَبَّاسٍ )هَشِيْمًا( (الكهف : 45) مُتَغَيِّرًا )وَالْأَبُّ( مَا يَأْكُلُ الأَنْعَامُ )وَالْأَنَامُ( الْخَلْقُ )بَرْزَخٌ( (المؤمنون : 100) حَاجِبٌ وَقَالَ مُجَاهِدٌ )أَلْفٰفًا( (النباء : 16) : مُلْتَفَّةً )وَالْغُلْبُ( : الْمُلْتَفَّةُ )فِرٰشًا( (البقرة : 22) : مِهَادًا كَقَوْلِهِ )وَلَكُمْ فِي الْأَرْضِ مُسْتَقَرٌّ( (البقرة : 36) )نَكِدًا( (الأعراف : 58) : قَلِيْلًا কাতাদাহ (রহ.) বলেন, (আল্লাহ তা‘আলার বাণীঃ) আর আমি তো নিকটবর্তী আসমানকে প্রদীপ মালা দিয়ে শুশোভিত করেছি (মুল্কঃ ৫) [এ সম্পর্কে ক্বাতাদাহ (রহ.) বলেন] এ সব নক্ষত্ররাজি তিনটি উদ্দেশে সৃষ্টি করা হয়েছে। (১) এদেরকে আসমানের সৌন্দর্য করেছেন (২) শয়তানদের প্রতি নিক্ষেপের জন্য (৩) এবং পথ ও দিক নির্ণয়ের আলামত হিসেবে। অতএব যে ব্যক্তি এদের সম্পর্কে এছাড়া অন্য কোন ব্যাখ্যা দেয় সে ভুল করে, নিজ প্রাপ্য হারায় এবং সে এমন বিষয়ে কষ্ট করে যে বিষয়ে তার কোন জ্ঞান নেই। আর ইবনু ‘আব্বাস (রাঃ) বলেন, -অর্থ পরিবর্তন (আল-কাহাফঃ ৪৫) আর অর্থ তৃণ যা চতুষ্পদ জন্তু ভক্ষণ করে, -অর্থ মাখলুক অর্থ প্রতিবন্ধক (মু’মিনূনঃ ১০০) আর মুজাহিদ (রহ.) বলেন, অর্থ জড়ানো (নাবাঃ ১৬) আর অর্থ ঘন ও সন্নিবেশিত বাগান। অর্থ বিছানা (বাক্বারাহঃ ২২)। যেমন মহান আল্লাহর বাণীঃ আর তোমাদের জন্য রয়েছে পৃথিবীতে অবস্থান স্থল- (বাক্বারাহঃ ৩৬)। (نَكِدًا)-অর্থ অল্প (আ’রাফঃ ৫৮)। بِحُسْبَانٍ (الرحمن : 5) উভয়েই (সূর্য ও চন্দ্র) সুনির্দিষ্ট কক্ষে বিচরণ করে।’’ (আর-রহমানঃ ৫) قَالَ مُجَاهِدٌ : كَحُسْبَانِ الرَّحَى. وَقَالَ غَيْرُهُ : بِحِسَابٍ وَمَنَازِلَ لَا يَعْدُوَانِهَا. حُسْبَانٌ : جَمَاعَةُ حِسَابٍ، مِثْلُ شِهَابٍ وَشُهْبَانٍ. ضُحَاهَا : ضَوْءُهَا. أَنْ تُدْرِكَ الْقَمَرَ : لَا يَسْتُرُ ضَوْءُ أَحَدِهِمَا ضَوْءَ الآخَرِ وَلَا يَنْبَغِيْ لَهُمَا ذَلِكَ، سَابِقُ النَّهَارِ يَتَطَالَبَانِ حَثِيْثَيْنِ نَسْلَخُ، نُخْرِجُ أَحَدَهُمَا مِنْ الآخَرِ وَنُجْرِيْ كُلَّ وَاحِدٍ مِنْهُمَا. وَاهِيَةٌ : وَهْيُهَا تَشَقُّقُهَا. أَرْجَائِهَا : مَا لَمْ يَنْشَقَّ مِنْهَا فَهُمْ عَلَى حَافَتَيْهَا كَقَوْلِكَ : عَلَى أَرْجَاءِ الْبِئْرِ. أَغْطَشَ وَ جَنَّ : أَظْلَمَ وَقَالَ الْحَسَنُ : كُوِّرَتْ تُكَوَّرُ حَتَّى يَذْهَبَ ضَوْءُهَا. وَاللَّيْلِ وَمَا وَسَقَ جَمَعَ مِنْ دَابَّةٍ. اتَّسَقَ : اسْتَوَى. بُرُوْجًا : مَنَازِلَ الشَّمْسِ وَالْقَمَرِ. الْحَرُوْرُ بِالنَّهَارِ مَعَ الشَّمْسِ. وَقَالَ ابْنُ عَبَّاسٍ : وَرُؤْبَةُ الْحَرُوْرُ بِاللَّيْلِ وَالسَّمُومُ بِالنَّهَارِ. يُقَالُ : يُوْلِجُ يُكَوِّرُ. وَلِيْجَةً : كُلُّ شَيْءٍ أَدْخَلْتَهُ فِيْ شَيْءٍ. মুজাহিদ (রহ.) বলেন, উভয়ের আবর্তন চাকার আবর্তনের অনুরূপ। আর অন্যেরা বলেন, উভয় এমন এক নির্দিষ্ট হিসাব ও স্থানের দ্বারা নিয়ন্ত্রিত যা তারা অর্থাৎ চন্দ্র-সূর্য লংঘন করতে পারে না। হল শব্দের বহুবচন, যেমন এর বহুবচন হল এর অর্থ তার জ্যোতি। চন্দ্র-সূর্যের একটির জ্যোতি অপরটির জ্যোতিকে ঢাকতে পারে না, আর তাদের পক্ষে এটা সম্ভব নয়। রাত দিনকে দ্রুত অতিক্রম করে। উভয়ে দ্রুত অতিক্রম করতে চায়।আমি উভয়ের একটিকে অপরটি হতে বের করে আনি আর তাদের প্রতিটি চালিত করা হয় এবং এর অর্থ তার বিদীর্ণ হওয়া। তার সেই অংশ যা বিদীর্ণ হয়নি আর তারা তার উভয় পার্শ্বে থাকবে। যেমন তোমার উক্তি কূপের তীরে অন্ধকারে ছেয়ে গেল। হাসান বসরী (রহ.) বলেন,অর্থ লেপটিয়ে দেয়া হবে, যাতে তার জ্যোতি নিঃশেষ হয়ে যাবে। আর বলা হয়ে থাকে এর অর্থ আর শপথ রজনীর এবং তার যে জীবজন্তু একত্রিত করল।বরাবর হল। চন্দ্র সূর্যের কক্ষ ও নির্ধারিত স্থান।-গরম বাতাস যা দিনের বেলায় সূর্যের সঙ্গে প্রবাহিত হয়। ইবনু ‘আব্বাস (রাঃ) বলেন, রাত্রি বেলার আর দিনের বেলার লু হাওয়া। বলা হয় অর্থ প্রবিষ্ট করে বা করবে অর্থ এমন প্রতিটি বস্তু যা তুমি অন্যটির মধ্যে ঢুকিয়েছ। ৩১৯৯. আবূ যার (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সূর্য অস্ত যাবার সময় আবূ যার (রাঃ)-কে বললেন, তুমি কি জান, সূর্য কোথায় যায়? আমি বললাম, আল্লাহ এবং তাঁর রাসূলই ভাল জানেন। তিনি বললেন, তা যেতে যেতে আরশের নীচে গিয়ে সাজ্দাহয় পড়ে যায়। অতঃপর সে আবার উদিত হবার অনুমতি চায় এবং তাকে অনুমতি দেয়া হয়। আর শীঘ্রই এমন সময় আসবে যে, সিজ্দা করবে কিন্তু তা কবূল করা হবে না এবং সে অনুমতি চাইবে কিন্তু তাকে অনুমতি দেয়া হবে না। তাকে বলা হবে, যে পথ দিয়ে আসলে ঐ পথেই ফিরে যাও। তখন সে পশ্চিম দিক হতে উদিত হয়— এটাই মর্ম হল মহান আল্লাহর বাণীরঃ ‘‘আর সূর্য নিজ গন্তব্যে (অথবা) কক্ষ পথে চলতে থাকে। এটা পরাক্রমশালী, সর্বজ্ঞের নিয়ন্ত্রণ।’’ (ইয়াসীন ৩৮) (৪৮০২, ৪৮০৩, ৭৪২৪, ৭৪৩৩) (আধুনিক প্রকাশনীঃ ২৯৫৮, ইসলামিক ফাউন্ডেশনঃ ২৯৬৯)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3200,
			"arabicnumber": 3200,
			"text": "আবূ হুরাইরাহ্ (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেন, কিয়ামতের দিন সূর্য ও চন্দ্র দু’টিকেই গুটিয়ে নেয়া হবে। (আধুনিক প্রকাশনীঃ ২৯৫৯, ইসলামিক ফাউন্ডেশনঃ ২৯৭০)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3201,
			"arabicnumber": 3201,
			"text": "‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, কারো মৃত্যু কিংবা জন্মের কারণে সূর্য গ্রহণ ও চন্দ্রগ্রহণ হয় না, বরং এ দু’টো আল্লাহর নিদর্শনসমূহের মধ্যে দু’টি নিদর্শন মাত্র। কাজেই তোমরা যখন তা ঘটতে দেখবে তখন সালাত আদায় করবে। (১০৪২) (আধুনিক প্রকাশনীঃ ২৯৬০, ইসলামিক ফাউন্ডেশনঃ ২৯৭১)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3202,
			"arabicnumber": 3202,
			"text": "‘আবদুল্লাহ ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, সূর্য এবং চন্দ্র আল্লাহর নিদর্শনসমূহের মধ্য হতে দু’টি নিদর্শন। কারো মৃত্যু কিংবা জন্মের কারণে সূর্যগ্রহণ ও চন্দ্রগ্রহণ হয় না। কাজেই তোমরা যখন তা ঘটতে দেখবে তখন আল্লাহর যিক্র করবে। (আধুনিক প্রকাশনীঃ ২৯৬১, ইসলামিক ফাউন্ডেশনঃ ২৯৭২)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3203,
			"arabicnumber": 3203,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত যে, যেদিন সূর্যগ্রহণ হল, সে দিন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সালাতে দাঁড়ালেন। অতঃপর তাকবীর বললেন এবং দীর্ঘ কিরাআত পাঠ করলেন। অতঃপর দীর্ঘ রুকু করলেন অতঃপর তিনি মাথা উঠালেন এবং বললেন, سَمِعَ اللهُ لِمَنْ حَمِدَهُ এবং তিনি আগের মত দাঁড়ালেন। আর দীর্ঘ কিরাআত পাঠ করলেন কিন্তু তা প্রথম কিরাআত থেকে কম ছিল। অতঃপর তিনি দীর্ঘক্ষণ রুকু‘ করলেন কিন্তু তা প্রথম রাক‘আতের চেয়ে কম ছিল। অতঃপর তিনি দীর্ঘ সাজ্দাহ করলেন। তিনি শেষ রাক‘আতেও ঐ রকমই করলেন, পরে সালাম ফিরালেন। এ সময় সূর্য উজ্জ্বল হয়ে গেছে। তখন তিনি মানুষদের উদ্দেশে খুত্বা দিলেন। তিনি সূর্য ও চন্দ্র গ্রহণ সম্পর্কে বললেন, অবশ্যই এ দু’টি আল্লাহর নিদর্শনাবলীর মধ্যে দু’টি নিদর্শন। কারো মৃত্যু ও জন্মের কারণে সূর্যগ্রহণ-চন্দ্রগ্রহণ হয় না। অতএব যখনই তোমরা তা ঘটতে দেখবে তখনই সালাতে ভয়-ভীতি নিয়ে লিপ্ত হবে। (১০৪৪) (আধুনিক প্রকাশনীঃ ২৯৬২, ইসলামিক ফাউন্ডেশনঃ ২৯৭৩)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3204,
			"arabicnumber": 3204,
			"text": "আবূ মাস‘ঊদ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, সূর্যগ্রহণ ও চন্দ্রগ্রহণ কারো মৃত্যু ও জন্মের কারণে হয় না। উভয়টি আল্লাহর নিদর্শনসমূহের মধ্যে হতে দু’টি নিদর্শন। অতএব যখন তোমরা তা ঘটতে দেখবে, তখন তোমরা সালাত আদায় করবে। (১০৪১) (আধুনিক প্রকাশনীঃ ২৯৬৩, ইসলামিক ফাউন্ডেশনঃ ২৯৭৪)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3205,
			"arabicnumber": 3205,
			"text": "(قَاصِفًا) تَقْصِفُ كُلَّ شَيْءٍ. (لَوَاقِحَ) مَلاَقِحَ مُلْقِحَةً. (إِعْصَارٌ) رِيحٌ عَاصِفٌ، تَهُبُّ مِنَ الأَرْضِ إِلَى السَّمَاءِ كَعَمُودٍ فِيهِ نَارٌ. (صِرٌّ) بَرْدٌ. (نُشُرًا) مُتَفَرِّقَةً. قَاصِفًا অর্থ যা সব কিছু ভেঙ্গে দেয়। لَوَاقِحَ و مَلَاقِحَ শব্দদ্বয় مُلْقِحَة শব্দের বহুবচন, যার অর্থ বৃষ্টি বর্ষণকারী। إِعْصَارٌ ঝঞ্ঝা বায়ু যা যমীন হতে আকাশের দিকে স্তম্ভাকারে প্রবাহিত হতে থাকে, যাতে আগুন বিরাজ করে। صِرٌّ অর্থ শীতল। نُشُرًا অর্থ বিস্তৃত। ৩২০৫. ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, পূর্বের বাতাস দ্বারা আমাকে সাহায্য করা হয়েছে, আর পশ্চিমের বাতাস দ্বারা আদ জাতিকে হালাক করা হয়েছে। (১০৩৫) (আধুনিক প্রকাশনীঃ ২৯৬৪, ইসলামিক ফাউন্ডেশনঃ ২৯৭৫)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 3206,
			"arabicnumber": 3206,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন আকাশে মেঘ দেখতেন, তখন একবার সামনে আগাতেন, আবার পেছনে সরে যেতেন। আবার কখনও ঘরে প্রবেশ করতেন, আবার বেরিয়ে যেতেন আর তাঁর মুখমন্ডল মলিন হয়ে যেত। পরে যখন আকাশ বৃষ্টি বর্ষণ করত তখন তাঁর এ অবস্থা দূর হত। ‘আয়িশাহ (রাঃ)-এর কারণ জানতে চাইলে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, আমি জানি না, এ মেঘ এমন মেঘও হতে পারে যা দেখে আদ জাতি বলেছিলঃ অতঃপর যখন তারা তাদের উপত্যকার দিকে উক্ত মেঘমালাকে এগোতে দেখল। (৪৬ঃ ২৪) (৪৮২৯) (মুসলিম ৯/৩ হাঃ ৮৯৯) (আধুনিক প্রকাশনীঃ ২৯৬৫, ইসলামিক ফাউন্ডেশনঃ ২৯৭৬)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 3207,
			"arabicnumber": 3207,
			"text": "وَقَالَ أَنَسٌ قَالَ عَبْدُ اللهِ بْنُ سَلَامٍ لِلنَّبِيِّ صلىالله عليه وسلم إِنَّ جِبْرِيْلَ عَلَيْهِ السَّلَام عَدُوُّ الْيَهُوْدِ مِنْ الْمَلَائِكَةِ وَقَالَ ابْنُ عَبَّاسٍ وَإِنَّا لَنَحْنُ الصَّآفُّوْنَ الْمَلَائِكَةُ আনাস ইবনু মালিক (রাঃ) বলেন, ‘আবদুল্লাহ ইবনু সালাম (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে বললেন, ফেরেশতাদের মধ্যে জিব্রাঈল (আঃ) ইয়াহূদীদের শত্রু। [১] আর ইবনু ‘আব্বাস (রাঃ) বলেছেন, وإنا لَنَحْنُ الصَّافُّوْنَ অর্থ আমরা তো (ফেরেশতাকুল) সারিবদ্ধভাবে দন্ডায়মান- (সাফফাতঃ ১৬৫)। (আধুনিক প্রকাশনীঃ ২৯৬৬) ৩২০৭. মালিক ইবনু সা‘সা‘আ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, আমি কা‘বা ঘরের নিকট নিদ্রা ও জাগরণ- এ দু’অবস্থার মাঝামাঝি অবস্থায় ছিলাম। অতঃপর তিনি দু’ব্যক্তির মাঝে অপর এক ব্যক্তি অর্থাৎ নিজের অবস্থা উল্লেখ করে বললেন, আমার নিকট সোনার একটি পেয়ালা নিয়ে আসা হল- যা হিকমত ও ঈমানে ভরা ছিল। অতঃপর আমার বুক হতে পেটের নীচ পর্যন্ত চিরে ফেলা হল। অতঃপর আমার পেট যমযমের পানি দিয়ে ধোয়া হল। অতঃপর তা হিকমত ও ঈমানে পূর্ণ করা হল এবং আমার নিকট সাদা রঙের চতুষ্পদ জন্তু আনা হল, যা খচ্চর হতে ছোট আর গাধা হতে বড় অর্থাৎ বোরাক। অতঃপর তাতে চড়ে আমি জিব্রাঈল (আঃ) সহ চলতে চলতে পৃথিবীর নিকটতম আসমানে গিয়ে পৌঁছলাম। জিজ্ঞেস করা হল, এ কে? উত্তরে বলা হল, জিব্রাঈল। জিজ্ঞেস করা হল, আপনার সঙ্গে আর কে? উত্তর দেয়া হল, মুহাম্মদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম। প্রশ্ন করা হল তাঁকে আনার জন্য কি পাঠানো হয়েছে? তিনি বললেন, হ্যাঁ। বলা হল, তাঁকে মারহাবা, তাঁর আগমন কতই না উত্তম। অতঃপর আমি আদম (আঃ)-এর নিকট গেলাম। তাঁকে সালাম করলাম। তিনি বললেন, পুত্র ও নবী! তোমার প্রতি মারহাবা। অতঃপর আমরা দ্বিতীয় আসমানে গেলাম। জিজ্ঞেস করা হল, এ কে? তিনি বললেন, আমি জিব্রাঈল। জিজ্ঞেস করা হল, আপনার সঙ্গে আর কে? তিনি বললেন, মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম। প্রশ্ন করা হল, তাঁকে আনার জন্য কি পাঠানো হয়েছে? তিনি বললেন, হ্যাঁ। বলা হল, তাঁকে মারহাবা আর তাঁর আগমন কতই না উত্তম। অতঃপর আমি ‘ঈসা ও ইয়াহইয়া (আঃ)-এর নিকট আসলাম। তাঁরা উভয়ে বললেন, ভাই ও নবী! আপনার প্রতি মারহাবা। অতঃপর আমরা তৃতীয় আসমানে পৌঁছলাম। জিজ্ঞেস করা হল, এ কে? উত্তরে বলা হল, আমি জিব্রাঈল। প্রশ্ন করা হল, আপনার সঙ্গে কে? বলা হল, মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম। জিজ্ঞেস করা হল, তাঁকে আনার জন্য কি পাঠানো হয়েছে? তিনি বললেন, হ্যাঁ। বলা হল, তাঁকে মারহাবা আর তাঁর আগমন কতই না উত্তম। অতঃপর আমি ইউসুফ (আঃ)-এর নিকট গেলাম। তাঁকে আমি সালাম করলাম। তিনি বললেন, ভাই ও নবী! আপনাকে মারহাবা। অতঃপর আমরা চতুর্থ আসমানে পৌঁছলাম। প্রশ্ন করা হল, এ কে? তিনি বললেন, আমি জিবরাঈল। জিজ্ঞেস করা হল, আপনার সঙ্গে কে? বলা হল, মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম। প্রশ্ন করা হল, তাঁকে আনার জন্য কি পাঠানো হয়েছে? জবাবে বলা হল, হ্যাঁ। বলা হল, তাঁকে মারহাবা আর তাঁর আগমন কতই না উত্তম। অতঃপর আমি ইদ্রীস (আঃ)-এর নিকট গেলাম। আমি তাঁকে সালাম করলাম। তিনি বললেন, ভাই ও নবী! আপনাকে মারহাবা। এরপর আমরা পঞ্চম আসমানে পৌঁছলাম। জিজ্ঞেস করা হল, এ কে? বলা হয় আমি জিব্রাঈল। প্রশ্ন হল আপনার সঙ্গে আর কে? বলা হল, মুহাম্মদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম। প্রশ্ন করা হল, তাঁকে আনার জন্য কি পাঠানো হয়েছে? বলা হল, হ্যাঁ। বললেন, তাঁকে মারহাবা আর তাঁর আগমন কতই না উত্তম। অতঃপর আমরা হারুন (আঃ)-এর নিকট গেলাম। আমি তাকে সালাম করলাম। তিনি বললেন, ভাই ও নবী! আপনাকে মারহাবা। অতঃপর আমরা ষষ্ঠ আসমানে পৌঁছলাম। জিজ্ঞেস করা হল, এ কে? বলা হল, আমি জিব্রাঈল। প্রশ্ন করা হল, আপনার সঙ্গে কে? বলা হল, মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম। বলা হল, তাঁকে আনার জন্য পাঠানো হয়েছে? তাঁকে মারহাবা আর তাঁর আগমন কতই না উত্তম। অতঃপর আমি মূসা (আঃ)-এর নিকট গেলাম। আমি তাঁকে সালাম করলাম। তিনি বললেন, ভাই ও নবী আপনাকে মারহাবা। অতঃপর আমি যখন তাঁর কাছ দিয়ে গেলাম, তখন তিনি কেঁদে ফেললেন। তাঁকে বলা হল, আপনি কাঁদছেন কেন? তিনি বললেন, হে রব! এ ব্যক্তি যে আমার পরে প্রেরিত, তাঁর উম্মাত আমার উম্মাতের চেয়ে অধিক পরিমাণে বেহেশতে যাবে। অতঃপর আমরা সপ্তম আকাশে পৌঁছলাম। প্রশ্ন করা হল, এ কে? বলা হল, আমি জিব্রাঈল। জিজ্ঞেস করা হল, আপনার সঙ্গে কে? বলা হল, মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম। বলা হল, তাঁকে আনার জন্য পাঠানো হয়েছে? তাঁকে মারহাবা। তাঁর আগমন কতই না উত্তম। অতঃপর আমি ইব্রাহীম (আঃ)-এর নিকট গেলাম। তাঁকে সালাম করলাম। তিনি বললেন, হে পুত্র ও নবী! আপনাকে মারহাবা। অতঃপর বায়তুল মা’মূরকে আমার সামনে প্রকাশ করা হল। আমি জিব্রাঈল (আঃ)-কে জিজ্ঞেস করলাম। তিনি বললেন, এটি বায়তুল মা’মূর। প্রতিদিন এখানে সত্তর হাজার ফেরেশতা সালাত আদায় করেন। এরা এখান হতে একবার বাহির হলে দ্বিতীয় বার ফিরে আসেন না। এটাই তাদের শেষ প্রবেশ। অতঃপর আমাকে ‘সিদ্রাতুল মুনতাহা’ দেখানো হল। দেখলাম, এর ফল যেন হাজারা নামক জায়গার মটকার মত। আর তার পাতা যেন হাতীর কান। তার উৎসমূলে চারটি ঝরণা প্রবাহিত। দু’টি ভিতরে আর দু’টি বাইরে। এ সম্পর্কে আমি জিব্রাঈলকে জিজ্ঞেস করলাম। তিনি বললেন, ভিতরের দু’টি জান্নাতে অবস্থিত। আর বাইরের দু’টির একটি হল- ফুরাত আর অপরটি হল (মিশরের) নীল নদ। অতঃপর আমার প্রতি পঞ্চাশ ওয়াক্ত সালাত ফরজ করা হয়। আমি তা গ্রহণ করে মূসা (আঃ)-এর নিকট ফিরে এলাম। তিনি বললেন, কি করে এলেন? আমি বললাম, আমার প্রতি পঞ্চাশ ওয়াক্ত সালাত ফরজ করা হয়েছে। তিনি বললেন, আমি আপনার চেয়ে মানুষ সম্পর্কে অধিক জ্ঞাত আছি। আমি বনী ইসরাঈলের রোগ সরানোর যথেষ্ট চেষ্টা করেছি। আপনার উম্মাত এত আদায়ে সমর্থ হবে, না। অতএব আপনার রবের নিকট ফিরে যান এবং তা কমানোর আবেদন করুন। আমি ফিরে গেলাম এবং তাঁর নিকট আবেদন করলাম। তিনি সালাত চল্লিশ ওয়াক্ত করে দিলেন। আবার তেমন ঘটল। সালাত ত্রিশ ওয়াক্ত করে দেয়া হল। আবার তেমন ঘটলে তিনি সালাত বিশ ওয়াক্ত করে দিলেন। আবার তেমন ঘটল। তিনি সালাতকে দশ ওয়াক্ত করে দিলেন। অতঃপর আমি মূসা (আঃ)-এর নিকট আসলাম। তিনি আগের মত বললেন, এবার আল্লাহ সালাতকে পাঁচ ওয়াক্ত ফরজ করে দিলেন। আমি মূসার নিকট আসলাম। তিনি বললেন, কী করে আসলেন? আমি বললাম, আল্লাহ পাঁচ ওয়াক্ত ফরজ করে দিয়েছেন। এবারও তিনি আগের মত বললেন, আমি বললাম, আমি তা মেনে নিয়েছি। তখন আওয়াজ এল, আমি আমার ফরজ জারি করে দিয়েছি। আর আমার বান্দাদের হতে হালকা করেও দিয়েছি। আমি প্রতিটি নেকির বদলে দশগুণ সওয়াব দিব। আর বায়তুল মা’মূর সম্পর্কে হাম্মাম (রহ.).........আবূ হুরাইরাহ্ (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেন। (৩৩৯৩, ৩৪৩০, ৩৮৮৭) (মুসলিম ১/৭৪ হাঃ ১৬৪, আহমাদ ১৭৮৫০) (আধুনিক প্রকাশনীঃ ২৯৬৭, ইসলামিক ফাউন্ডেশনঃ ২৯৭৭)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 3208,
			"arabicnumber": 3208,
			"text": "যায়দ ইবনু ওয়াহব (রহ.) হতে বর্ণিত। ‘আবদুল্লাহ (রাঃ) বলেন, সত্যবাদী হিসেবে গৃহীত আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের নিকট হাদীস বর্ণনা করতে গিয়ে বলেছেন, নিশ্চয় তোমাদের প্রত্যেকের সৃষ্টির উপাদান নিজ নিজ মায়ের পেটে চল্লিশ দিন পর্যন্ত বীর্যরূপে অবস্থান করে, অতঃপর তা জমাট বাঁধা রক্তে পরিণত হয়। ঐভাবে চল্লিশ দিন অবস্থান করে। অতঃপর তা গোশতপিন্ডে পরিণত হয়ে (আগের মত চল্লিশ দিন) থাকে। অতঃপর আল্লাহ একজন ফেরেশতা প্রেরণ করেন। আর তাঁকে চারটি বিষয়ে আদেশ দেয়া হয়। তাঁকে লিপিবদ্ধ করতে বলা হয়, তার ‘আমল, তার রিয্ক, তার আয়ু এবং সে কি পাপী হবে না নেককার হবে। অতঃপর তার মধ্যে আত্মা ফুঁকে দেয়া হয়। কাজেই তোমাদের কোন ব্যক্তি ‘আমল করতে করতে এমন পর্যায়ে পৌঁছে যে, তার এবং জান্নাতের মাঝে মাত্র এক হাত পার্থক্য থাকে। এমন সময় তার ‘আমলনামা তার উপর জয়ী হয়। তখন সে জাহান্নামবাসীর মত আমল করে। আর একজন ‘আমল করতে করতে এমন স্তরে পৌঁছে যে, তার এবং জাহান্নামের মাঝে মাত্র এক হাত তফাৎ থাকে, এমন সময় তার ‘আমলনামা তার উপর জয়ী হয়। ফলে সে জান্নাতবাসীর মত ‘আমল করে। (৩৩৩২, ৬৫৯৪, ৭৪৫৪) (মুসলিম ৪৭/১ হাঃ ৩৬৪৩, আহমাদ ৩৬২৪) (আধুনিক প্রকাশনীঃ ২৯৬৮, ইসলামিক ফাউন্ডেশনঃ ২৯৭৮)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 3209,
			"arabicnumber": 3209,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, আল্লাহ যখন কোন বান্দাকে ভালবাসেন তখন তিনি জিব্রাঈল (আঃ)-কে ডেকে বলেন, নিশ্চয়ই আল্লাহ অমুক বান্দাহকে ভালবাসেন, কাজেই তুমিও তাকে ভালবাস। তখন জিব্রাঈল (আঃ)-ও তাকে ভালবাসেন এবং জিব্রাঈল (আঃ) আকাশের অধিবাসীদের মধ্যে ঘোষণা করে দেন যে, আল্লাহ অমুক বান্দাহকে ভালবাসেন। কাজেই তোমরা তাকে ভালবাস। তখন আকাশের অধিবাসী তাকে ভালবাসতে থাকে। অতঃপর পৃথিবীতেও তাকে সম্মানিত করার ব্যবস্থা করে দেয়া হয়। (৬০৪০, ৭৪৮৫) (মুসলিম ৪৫/৪৮ হাঃ ২৬৩৭, আহমাদ ৯৩৬৩) (আধুনিক প্রকাশনীঃ ২৯৬৯, ইসলামিক ফাউন্ডেশনঃ ২৯৭৯)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 3210,
			"arabicnumber": 3210,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছেন যে, ফেরেশতামন্ডলী মেঘমালার আড়ালে অবতরণ করেন এবং আকাশের ফায়সালাসমূহ আলোচনা করেন। তখন শয়তানেরা তা চুরি করে শোনার চেষ্টা করে এবং তার কিছু শোনেও ফেলে। অতঃপর তারা সেটা গণকের নিকট পৌঁছে দেয় এবং তারা তার সেই শোনা কথার সঙ্গে নিজেদের আরো শত মিথ্যা মিলিয়ে বলে থাকে। (৩২৮৮, ৫৭৬২, ৬২১৩, ৭৫৬১) (আধুনিক প্রকাশনীঃ ২৯৭০, ই. ফা ২৯৮০)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 3211,
			"arabicnumber": 3211,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, ‘জুমু‘আর দিন মসজিদের প্রতিটি দরজায় ফেরেশতা এসে দাঁড়িয়ে যায় এবং যে ব্যক্তি প্রথম মসজিদে প্রবেশ করে, তার নাম লিখে নেয়। অতঃপর ক্রমান্বয়ে পরবর্তীদের নামও লিখে নেয়। ইমাম যখন বসে পড়েন তখন তারা এসব লেখা পুস্তিকা বন্ধ করে দেন এবং তাঁরা মসজিদে এসে যিক্র শুনতে থাকেন।’ (৯২৯) (আধুনিক প্রকাশনীঃ ২৯৭১, ইসলামিক ফাউন্ডেশনঃ ২৯৮১)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 3212,
			"arabicnumber": 3212,
			"text": "সা‘ঈদ ইবনু মুসাইয়্যাব (রহ.) হতে বর্ণিত। তিনি বলেন, একদা ‘উমার (রাঃ) মসজিদে নববীতে আগমন করেন, তখন হাস্সান ইবনু সাবিত (রাঃ) কবিতা আবৃত্তি করছিলেন। তখন তিনি বললেন, এখানে আপনার চেয়ে উত্তম ব্যক্তির উপস্থিতিতেও আমি কবিতা আবৃত্তি করতাম। অতঃপর তিনি আবূ হুরাইরাহ্ (রাঃ)-এর দিকে তাকালেন এবং বললেন, আমি আপনাকে আল্লাহর কসম দিয়ে জিজ্ঞেস করছি; আপনি কি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছেন যে, ‘‘তুমি আমার পক্ষ হতে জবাব দাও। হে আল্লাহ! আপনি তাকে রুহুল কুদুস [জিব্রাঈল (আঃ)] দ্বারা সাহায্য করুন।’’ তিনি উত্তরে বললেন, হ্যাঁ। (৪৫৩) (মুসলিম ৪৪/৪৩ হাঃ ২৪৮৫, আহমাদ ৬৭৪৮) (আধুনিক প্রকাশনীঃ ২৯৭২, ইসলামিক ফাউন্ডেশনঃ ২৯৮২)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 3213,
			"arabicnumber": 3213,
			"text": "বারা‘ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হাস্সান (রাঃ)-কে বলেছেন, তুমি তাদের দোষ-ত্রুটি বর্ণনা কর অথবা তাদের কুৎসার জবাব দাও। তোমার সঙ্গে জিব্রাঈল (আঃ) আছেন। (৪১২৪, ৪১২৪, ৬১৫৩) (আধুনিক প্রকাশনীঃ ২৯৭৩, ইসলামিক ফাউন্ডেশনঃ ২৯৮৩)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 3214,
			"arabicnumber": 3214,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি যেন বানূ গানমের গলিতে উপরে উঠা ধূলা স্বয়ং দেখতে পাচ্ছি। মূসা এতটুকু বাড়িয়ে বলেছেন, জিব্রীল বাহন নিয়ে পদচারণা করেন।* (আধুনিক প্রকাশনীঃ ২৯৭৪, ইসলামিক ফাউন্ডেশনঃ ২৯৮৪)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 3215,
			"arabicnumber": 3215,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। হারিস ইবনু হিশাম (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে জিজ্ঞেস করলেন, আপনার নিকট ওয়াহী কিভাবে আসে? তিনি বললেন, ‘সব ধরনের ওয়াহী নিয়ে ফেরেশতা আসেন। কখনো কখনো ঘণ্টার আওয়াজের মত শব্দ করে। যখন আমার নিকট ওয়াহী আসা শেষ হয়ে যায়, তখন তিনি যা বলেছেন আমি তা মুখস্থ করে ফেলি। আর এভাবে শব্দ করে ওয়াহী আসাটা আমার নিকট কঠিন মনে হয়। আর কখনও কখনও ফেরেশতা আমার নিকট মানুষের আকারে আসেন এবং আমার সঙ্গে কথা বলেন। তিনি যা বলেন আমি তা মুখস্থ করে নেই।’ (২) (আধুনিক প্রকাশনীঃ ২৯৭৫, ইসলামিক ফাউন্ডেশনঃ ২৯৮৬)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 3216,
			"arabicnumber": 3216,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি, যে ব্যক্তি আল্লাহর পথে কোন কিছু জোড়ায় জোড়ায় দান করবে, তাকে জান্নাতের পর্যবেক্ষকগণ আহবান করতে থাকবে, হে অমুক ব্যক্তি! এ দিকে আস! তখন আবূ বাকর (রাঃ) বললেন, এমন ব্যক্তি তো সেই যার কোন ধ্বংস নেই। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আমি আশা করি, তুমি তাদের মধ্যে একজন হবে। (১৮৯৭) (আধুনিক প্রকাশনীঃ ২৯৭৬, ইসলামিক ফাউন্ডেশনঃ ২৯৮৬)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 3217,
			"arabicnumber": 3217,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। একদা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে বললেন, হে আয়িশা! এই যে জিব্রীল (আঃ) তোমাকে সালাম দিচ্ছেন। তখন তিনি বললেন, তাঁর প্রতি সালাম, আল্লাহর রহমত এবং তাঁর বরকত বর্ষিত হোক। আপনি এমন কিছু দেখেন যা আমি দেখতে পাই না। এর দ্বারা তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বুঝিয়েছেন। (৩৭৬৮, ৬২০১, ৬২৪৯, ৬২৫৩) (মুসলিম ৪৪/১৩ হাঃ ২৪৪৭, আহমাদ ২৫৮০৪) (আধুনিক প্রকাশনীঃ ২৯৭৭, ইসলামিক ফাউন্ডেশনঃ ২৯৮৭)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 3218,
			"arabicnumber": 3218,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, একবার আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জিব্রাঈল (আঃ)-কে জিজ্ঞেস করলেন, আপনি আমার কাছে যতবার আসেন তার চেয়ে অধিক আমার সঙ্গে সাক্ষাৎ করেন না কেন? রাবী বলেন, তখন এ আয়াত অবতীর্ণ হয়ঃ ‘‘(জিবরাঈল বলল:) আমি আপনার রবের আদেশ ব্যতিরেকে আসতে পারি না। তাঁরই আয়ত্বে রয়েছে যা কিছু আমাদের সামনে আছে, যা আমাদের পশ্চাতে আছে এবং যা কিছু এর মধ্যস্থলে আছে’’- (মারইয়াম ৬৪)। (৪৭৩১, ৭৪৫৫) (আধুনিক প্রকাশনীঃ ২৯৭৮, ইসলামিক ফাউন্ডেশনঃ ২৯৮৮)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 3219,
			"arabicnumber": 3219,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, ‘জিব্রীল (আঃ) আমাকে এক আঞ্চলিক ভাষায় কুরআন পাঠ করে শুনিয়েছেন। কিন্তু আমি সব সময় তাঁর নিকট বেশি ভাষায় পাঠ শুনতে চাইতাম। শেষতক তা সাতটি আঞ্চলিক ভাষায় সমাপ্ত হয়।[১] (৪৯৯১) (মুসলিম ৬/৪৮ হাঃ ৮১৯) (আধুনিক প্রকাশনীঃ ২৯৭৯, ইসলামিক ফাউন্ডেশনঃ ২৯৮৯)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 3220,
			"arabicnumber": 3220,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম লোকেদের মধ্যে সবচেয়ে দানশীল ছিলেন আর রমাযান মাসে যখন জিব্রীল (আঃ) তাঁর সঙ্গে সাক্ষাৎ করতেন তখন তিনি আরো অধিক দানশীল হয়ে যেতেন। জিব্রীল (রাঃ) রমাযানের প্রতি রাতে তাঁর সঙ্গে সাক্ষাৎ করতেন। তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে কুরআন পাঠ করে শুনাতেন। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে যখন জিব্রাঈল (আঃ) দেখা করতেন, তখন তিনি মানুষের কল্যাণের জন্য পাঠানো বাতাসের চেয়েও বেশি দানশীল হতেন। ‘আবদুল্লাহ (রহ.) হতে বর্ণিত। মা‘মার (রহ.) এ সনদে একই রকম হাদীস বর্ণনা করেছেন আর আবূ হুরাইরাহ্ (রাঃ) এবং ফাতেমাহ (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিকট হতে فَيُدَارِسُهُ الْقُرْآنَ -এর স্থলে أَنَّ جِبْرِيْلَ كَانَ يُعَارِضُهُ الْقُرْآنَ বর্ণনা করেছেন। অর্থাৎ জিবরীল তাঁর উপর কুরআন পেশ করতেন। (৬) (মুসলিম ৪৪/১৫ হাঃ ২৪৫০, আহমাদ ২৬৪৭৫) (আধুনিক প্রকাশনীঃ ২৯৮০, ইসলামিক ফাউন্ডেশনঃ ২৯৯০)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 3221,
			"arabicnumber": 3221,
			"text": "ইবনু শিহাব (রহ.) হতে বর্ণিত। একবার ‘উমার ইবনু ‘আবদুল ‘আযীয (রহ.) ‘আসরের সালাত কিছুটা দেরিতে আদায় করলেন। তখন তাঁকে ‘উরওয়াহ (রাঃ) বললেন, একবার জিব্রীল (আঃ) আসলেন এবং আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর ইমাম হয়ে সালাত আদায় করলেন। তা শুনে ‘উমার ইবনু ‘আবদুল ‘আযীয (রহ.) বললেন, হে ‘উরওয়াহ! কি বলছ, চিন্তা কর। উত্তরে তিনি বললেন, আমি বশীর ইবনু আবূ মাস‘ঊদকে বলতে শুনেছি, তিনি বলেন, আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি, একবার জিব্রীল (আঃ) আসলেন, অতঃপর তিনি আমার ইমামতি করলেন এবং তাঁর সঙ্গে সালাত আদায় করলাম। অতঃপর আমি তাঁর সঙ্গে সালাত আদায় করলাম। অতঃপরও আমি তাঁর সঙ্গে সালাত আদায় করলাম। অতঃপরও আমি তাঁর সঙ্গে সালাত আদায় করলাম। এ সময় তিনি তাঁর আঙ্গুলে পাঁচ ওয়াক্ত সালাত গুণছিলেন। (৫২১) (আধুনিক প্রকাশনীঃ ২৯৮১, ইসলামিক ফাউন্ডেশনঃ ২৯৯১)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 3222,
			"arabicnumber": 3222,
			"text": "আবূ যার (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, একবার জিব্রাঈল (আঃ) আমাকে বললেন, আপনার উম্মাত হতে যদি এমন ব্যক্তি মারা যায় যে আল্লাহর সঙ্গে কোন কিছুকে শরীক করেনি, তাহলে সে জান্নাতে প্রবেশ করবে কিংবা তিনি বলেছেন, সে জাহান্নামে প্রবেশ করবে না। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, যদিও সে যিনা করে এবং চুরি করে। জিব্রাঈল (আঃ) বললেন, যদিও (সে যিনা করে ও চুরি করে তবুও)।* (১২৩৭) (আধুনিক প্রকাশনীঃ ২৯৮২, ইসলামিক ফাউন্ডেশনঃ ২৯৯২)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 3223,
			"arabicnumber": 3223,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, ফেরেশতামন্ডলী একদলের পেছনে আর একদল আগমন করেন। একদল ফেরেশতা রাতে আসেন আর একদল ফেরেশতা দিনে আসেন। তাঁরা ফজর ও ‘আসর সালাতে একত্রিত হয়ে থাকেন। অতঃপর যারা তোমাদের নিকট রাত্রি কাটিয়েছিলেন তারা আল্লাহর নিকট ঊর্ধ্বে চলে যান। তখন তিনি তাদেরকে মানুষের অবস্থা সম্পর্কে জিজ্ঞেস করেন। অথচ তিনি তাদের চেয়ে এ ব্যাপারে সবচেয়ে অধিক জ্ঞাত আছেন। তিনি বলেন, তোমরা আমার বান্দাদেরকে কী হালতে ছেড়ে এসেছ? উত্তরে তাঁরা বলেন, আমরা তাদেরকে সালাতরত অবস্থায় ছেড়ে এসেছি। আর আমরা তাদের নিকট সালাতরত অবস্থাতেই পৌঁছেছিলাম। (৫৫৫) (আধুনিক প্রকাশনীঃ ২৯৮৩, ইসলামিক ফাউন্ডেশনঃ ২৯৯৩)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 3224,
			"arabicnumber": 3224,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর জন্য প্রাণীর ছবিওয়ালা একটি বালিশ তৈরি করেছিরাম। যেন তা একটি ছোট গদী। অতঃপর তিনি আমার ঘরে এসে দু’ দরজার মধ্যে দাঁড়ালেন আর তাঁর চেহারা মলিন হয়ে গেল। তখন আমি বললাম, ‘হে আল্লাহর রাসূল! আমার কী অন্যায় হয়েছে? তিনি বললেন, এ বালিশটি কেন? আমি বললাম, এ বালিশটি আপনি এর উপর ঠেস দিয়ে বসতে পারেন সে জন্য তৈরি করেছি। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তুমি কি জান না যে ঘরে প্রাণীর ছবি থাকে, সেখানে ফেরেশতা প্রবেশ করেন না? আর যে ব্যক্তি প্রাণীর ছবি আঁকে তাকে কিয়ামতের দিন শাস্তি দেয়া হবে? (আল্লাহ্) বলবেন, ‘বানিয়েছ, তাকে জীবিত কর।’ (২১০৫) (আধুনিক প্রকাশনীঃ ২৯৮৪, ইসলামিক ফাউন্ডেশনঃ ২৯৯৪)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 3225,
			"arabicnumber": 3225,
			"text": "আবূ ত্বলহা (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি, যে বাড়িতে কুকুর থাকে আর প্রাণীর ছবি থাকে সেথায় ফেরেশতা প্রবেশ করে না। (৩২২৬, ৩৩২২, ৪০০২, ৫৯৪৯, ৫৯৫৮) (মুসলিম ৩৭/২৬ হাঃ ২১০৬) (আধুনিক প্রকাশনীঃ ২৯৮৫, ইসলামিক ফাউন্ডেশনঃ ২৯৯৫)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 3226,
			"arabicnumber": 3226,
			"text": "আবূ ত্বলহা (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, ‘যে বাড়িতে প্রাণীর ছবি থাকে সেখানে ফেরেশতা প্রবেশ করেন না।’ বুস্র (রহ.) বলেন, অতঃপর যায়িদ ইবনু খালিদ (রাঃ) রোগাক্রান্ত হন। আমরা তাঁর সেবার জন্য গেলাম। তখন আমরা তাঁর ঘরে একটি পর্দায় কিছু ছবি দেখতে পেলাম। তখন আমি (বুস্র) ‘উবাইদুল্লাহ খাওলানী (রহ.)-কে জিজ্ঞেস করলাম, ইনি কি আমাদের কাছে ছবি সম্পর্কীয় হাদীস বর্ণনা করেননি? তখন তিনি বললেন, তিনি বলেছেন, প্রাণীর; তবে কাপড়ের মধ্যে কিছু অংকণ করা নিষিদ্ধ নয়, তুমি কি তা শুননি? আমি বললাম, না। তিনি বললেন, হ্যাঁ, তিনি তা বর্ণনা করেছেন। (৩২২৫) (আধুনিক প্রকাশনীঃ ২৯৮৬, ইসলামিক ফাউন্ডেশনঃ ২৯৯৬)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 3227,
			"arabicnumber": 3227,
			"text": "সালিম (রহ.) তাঁর পিতার নিকট হতে বর্ণনা করেন, তিনি বলেন, জিবরীল (আঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে ওয়াদা দিয়েছিলেন। আমরা ঐ ঘরে প্রবেশ করি না, যে ঘরে ছবি এবং কুকুর থাকে। (৫৯৬০) (আধুনিক প্রকাশনীঃ ২৯৮৭, ইসলামিক ফাউন্ডেশনঃ ২৯৯৭)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 3228,
			"arabicnumber": 3228,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, (সালাতে) ইমাম যখন سَمِعَ اللهُ لِمَنْ حَمِدَهُ বলেন, তখন তোমরা বলবে اللَّهُمَّ رَبَّنَا لَكَ الْحَمْدُ (হে আল্লাহ! আমাদের প্রতিপালক। আপনার জন্য সকল প্রশংসা) কেননা যার এ উক্তি ফেরেশতাগণের উক্তির সঙ্গে মিলে যাবে, তার আগের গুনাহ মাফ করে দেয়া হবে। (৭৯৬) (আধুনিক প্রকাশনীঃ ২৯৮৮, ইসলামিক ফাউন্ডেশনঃ ২৯৯৮)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 3229,
			"arabicnumber": 3229,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, ‘তোমাদের কেউ যতক্ষণ পর্যন্ত সালাতে রত থাকবে ততক্ষণ পর্যন্ত ফেরেশতাগণ এ বলে দু‘আ করতে থাকে, হে আল্লাহ! তাকে ক্ষমা করে দিন এবং হে আল্লাহ্! তার প্রতি রহম করুন যতক্ষণ পর্যন্ত লোকটি সালাত ছেড়ে না দাঁড়ায় কিংবা তার উযু ভঙ্গ না হয়।’ (১৭৬) (আধুনিক প্রকাশনীঃ ২৯৮৯, ইসলামিক ফাউন্ডেশনঃ ২৯৯৯)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 3230,
			"arabicnumber": 3230,
			"text": "সাফওয়ান ইবনু ইয়া‘লা তাঁর পিতা হতে বর্ণনা করেন, তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে মিম্বারে উঠে এ আয়াত তিলাওয়াত করতে শুনেছি; وَنَادَوْا يَا مَالِكُ (আর তারা ডাকল, হে মালিক!) সুফ্ইয়ান (রহ.) বলেন, ‘আবদুল্লাহ ইবনু মাস‘ঊদ (রাঃ)-এর ক্বিরাআতে وَنَادَوْا يَا مَالِكُ স্থলে وَنَادَوْا يَا مَالِ রয়েছে। (৩২৬৬, ৪৮১৯) (মুসলিম ৭/১৩ হাঃ ৮৭১, আহমাদ ১৭৯৮৩) (আধুনিক প্রকাশনীঃ ২৯৯০, ইসলামিক ফাউন্ডেশনঃ ৩০০০)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 3231,
			"arabicnumber": 3231,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত যে, একবার তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে জিজেস করলেন, উহুদের দিনের চেয়ে কঠিন কোন দিন কি আপনার উপর এসেছিল? তিনি বললেন, আমি তোমার ক্বওম হতে যে বিপদের সম্মুখীন হয়েছি, তা তো হয়েছি। তাদের হতে অধিক কঠিন বিপদের সম্মুখীন হয়েছি, আকাবার দিন যখন আমি নিজেকে ইবনু ‘আবদে ইয়ালীল ইবনে ‘আবদে কলালের নিকট পেশ করেছিলাম। আমি যা চেয়েছিলাম, সে তার জবাব দেয়নি। তখন আমি এমনভাবে বিষণ্ণ চেহারা নিয়ে ফিরে এলাম যে, কারনুস সাআলিবে পৌঁছা পর্যন্ত আমার চিন্তা দূর হয়নি। তখন আমি মাথা উপরে উঠালাম। হঠাৎ দেখতে পেলাম এক টুকরো মেঘ আমাকে ছায়া দিচ্ছে। আমি সে দিকে তাকালাম। তার মধ্যে ছিলেন জিব্রাঈল (আঃ)। তিনি আমাকে ডেকে বললেন, আপনার ক্বওম আপনাকে যা বলেছে এবং তারা উত্তরে যা বলেছে তা সবই আল্লাহ শুনেছেন। তিনি আপনার নিকট পাহাড়ের ফেরেশতাকে পাঠিয়েছেন। এদের সম্পর্কে আপনার যা ইচ্ছে আপনি তাঁকে হুকুম দিতে পারেন। তখন পাহাড়ের ফেরেশতা আমাকে ডাকলেন এবং আমাকে সালাম দিলেন। অতঃপর বললেন, হে মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম! এসব ব্যাপার আপনার ইচ্ছাধীন। আপনি যদি চান, তাহলে আমি তাদের উপর আখশাবাইন১কে চাপিয়ে দিব। উত্তরে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, বরং আশা করি মহান আল্লাহ তাদের বংশ থেকে এমন সন্তান জন্ম দেবেন যারা এক আল্লাহর ‘ইবাদাত করবে আর তাঁর সঙ্গে কাউকে শরীক করবে না। (৭৩৮৯) (আধুনিক প্রকাশনীঃ ২৯৯১, ইসলামিক ফাউন্ডেশনঃ ৩০০১)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 3232,
			"arabicnumber": 3232,
			"text": "আবূ ইসহাক শায়বানী (রহ.) হতে বর্ণিত। তিনি বলেন, আমি যির ইবনু হুবাইশ (রাঃ)-কে মহান আল্লাহর এ বাণীঃ ‘‘অবশেষে তাদের মধ্যে দুই ধনুকের দূরত্ব রইল অথবা আরও কম। তখন আল্লাহ স্বীয় বান্দার প্রতি যা ওয়াহী করার ছিল, তা ওয়াহী করলেন’’- (আন্-নাজম ৯-১০)। এ সম্পর্কে জিজ্ঞেস করলাম। তিনি বললেন, ইবনু মাস‘ঊদ (রাঃ) আমাদের নিকট বর্ণনা করেছেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জিব্রাঈল (আঃ)-কে দেখেছেন। তাঁর ছয়শ’টি ডানা ছিল। (৪৮৫৬, ৪৮৫৭) (মুসলিম ১/৭৬ হাঃ ১৭৪) (আধুনিক প্রকাশনীঃ ২৯৯২, ইসলামিক ফাউন্ডেশনঃ ৩০০২)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 3233,
			"arabicnumber": 3233,
			"text": "‘আবদুল্লাহ ইবনু মাস‘ঊদ (রাঃ) হতে বর্ণিত। তিনি এ আয়াতঃ ‘‘তিনি তো স্বীয় রবের মহান নিদর্শনসমূহ দর্শন করেছেন।’’ (আন্-নাজম ১৮)-এর মর্মার্থে বলেন, তিনি (নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) সবুজ বর্ণের রফরফ* দেখেছেন, যা আকাশের দিগন্তকে আবৃত করে রেখেছিল। (৪৮৫৮) (মুসলিম ১/৭৬ হাঃ ১৭৪) (আধুনিক প্রকাশনীঃ ২৯৯৩, ইসলামিক ফাউন্ডেশনঃ ৩০০৩)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 3234,
			"arabicnumber": 3234,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, যে ব্যক্তি মনে করবে যে, মুহাম্মদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর রবকে দেখেছেন, সে ব্যক্তি মহা ভুল করবে। বরং তিনি জিব্রাঈল (আঃ)-কে তাঁর আসল আকার ও চেহারায় দেখেছেন। তিনি আকাশের দিকচক্রবাল জুড়ে অবস্থান করছিলেন। (৩২৩৫, ৪৬১২, ৪৮৫৫, ৭৩৯০, ৭৫৩১) (মুসলিম ১/৭৭ হাঃ ১৭৭) (আধুনিক প্রকাশনীঃ ২৯৯৪, ইসলামিক ফাউন্ডেশনঃ ৩০০৪)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 3235,
			"arabicnumber": 3235,
			"text": "মাসরূক (রহ.) হতে বর্ণিত। তিনি বলেন, আমি ‘আয়িশাহ (রাঃ)-কে আল্লাহর বাণীঃ ‘‘তারপর সে তার নিকটবর্তী হল এবং অতি নিকটবর্তী হল, অবশেষে তাদের মধ্যে দুই ধনুকের দূরত্ব রইল অথবা আরও কম’’ (আন্-নাজম ৮, ৯)-এর অর্থ সম্পর্কে জিজ্ঞেস করলাম। তিনি বললেন, তিনি জিব্রাঈল (আঃ) ছিলেন। তিনি সাধারণত মানুষের আকার নিয়ে তাঁর নিকট আসতেন। কিন্তু এবার তিনি নিকটে এসেছিলেন তাঁর আসল চেহারা নিয়ে। তখন তিনি আকাশের সম্পূর্ণ দিকচক্রবাল আবৃত করে ফেলেছিলেন। (৩২৩৪) (আধুনিক প্রকাশনীঃ ২৯৯৫, ইসলামিক ফাউন্ডেশনঃ ৩০০৫)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 3236,
			"arabicnumber": 3236,
			"text": "সামূরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, আজ রাতে আমি দেখেছি, দু’ব্যক্তি আমার নিকট এসেছে। তারা বলল, যে অগ্নি প্রজ্জ্বলিত করছিল সে হলো দোযখের তত্ত্বাবধায়ক মালিক আর আমি জিব্রাঈল এবং ইনি মীকাঈল। (৮৪৫) (আধুনিক প্রকাশনীঃ ২৯৯৬, ইসলামিক ফাউন্ডেশনঃ ৩০০৬)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 3237,
			"arabicnumber": 3237,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, কোন লোক যদি নিজ স্ত্রীকে নিজ বিছানায় আসতে ডাকে আর সে অস্বীকার করে এবং সে ব্যক্তি স্ত্রীর উপর দুঃখ নিয়ে রাত্রি যাপন করে, তাহলে ফেরেশ্তাগণ এমন স্ত্রীর উপর সকাল পর্যন্ত লা‘নত দিতে থাকে। শুবা, আবূ হামযাহ, ইবনু দাউদ ও আবূ মু‘আবিয়াহ (রহ.) আ‘মাশ (রহ.) হতে হাদীস বর্ণনায় আবূ আওয়ানাহ (রহ.)-এর অনুসরণ করেছেন। (৫১৯৩, ৫১৯৪) (মুসলিম ১৯ হাঃ ১৪৩৬, আহমাদ ৯৬৭৭) (আধুনিক প্রকাশনীঃ ২৯৯৭, ইসলামিক ফাউন্ডেশনঃ ৩০০৭)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 3238,
			"arabicnumber": 3238,
			"text": "জাবির ইবনু ‘আবদিল্লাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি। আমার নিকট হতে কিছু দিনের জন্য ওয়াহী বন্ধ হয়ে গেল। আমি পথ চলতে ছিলাম। এরই মধ্যে আকাশ হতে একটি আওয়াজ শুনতে পেলাম। তখন আমি আকাশের দিকে দৃষ্টি তুললাম। হঠাৎ দেখতে পেলাম, হেরা পাহাড়ের গুহায় আমার নিকট যে ফেরেশতা এসেছিলেন, তিনি আকাশ ও যমীনের মাঝখানে একটি কুরসীর উপর বসে আছেন। আমি তাতে ভীত হয়ে গেলাম, এমনকি মাটিতে পড়ে যাবার উপক্রম হলাম। অতঃপর আমি আমার পরিজনের নিকট এলাম এবং বললাম, আমাকে কম্বল দিয়ে আবৃত কর, আমাকে কম্বল দিয়ে আবৃত কর। তখন মহান আল্লাহ্ এ আয়াত অবতীর্ণ করেনঃ يَا أَيُّهَا الْمُدَّثِّرُ قُمْ فَأَنْذِرْ হে বস্ত্রাবৃত। উঠ, সতর্ক বাণী প্রচার কর.....অপবিত্রতা হতে দূরে থাক। (আল-মুদ্দাসসিরঃ ১-৫) আবূ সালামাহ (রাঃ) বলেন, অত্র আয়াতে الرِّجْزُ হল প্রতিমা। (৪) (আধুনিক প্রকাশনীঃ ২৯৯৮, ইসলামিক ফাউন্ডেশনঃ ৩০০৮)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 3239,
			"arabicnumber": 3239,
			"text": "নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর চাচাত ভাই ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, মিরাজের রাত্রে আমি মূসা (আঃ)-কে দেখেছি। তিনি গোধুম বর্ণের পুরুষ ছিলেন; দেহের গঠন ছিল লম্বা। মাথার চুল ছিল কোঁকড়ানো। যেন তিনি শানূআ গোত্রের জনৈক ব্যক্তি। আমি ‘ঈসা (আঃ)-কে দেখতে পাই। তিনি ছিলেন মধ্যম গঠনের লোক। তাঁর দেহবর্ণ ছিল সাদা লালে মিশ্রিত। তিনি ছিলেন মধ্যম দেহ বিশিষ্ট। মাথার চুল ছিল অকুঞ্চিত। জাহান্নামের তত্ত্বাবধায়ক মালিক এবং দজ্জালকেও আমি দেখেছি। আল্লাহ তা‘আলা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বিশেষ করে যে সকল নিদর্শনসমূহ দেখিয়েছেন তার মধ্যে এগুলোও ছিল। সুতরাং তাঁর সঙ্গে সাক্ষাতের বিষয়ে তুমি সন্দেহ পোষণ করবে না। আনাস এবং আবূ বাকরাহ (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেছেন, ফেরেশতামন্ডলী মদিনা্কে দাজ্জাল হতে পাহারা দিয়ে রাখবেন। (৩৩৯৬) (মুসলিম ১/৭৪ হাঃ ১৬৫, আহমাদ ৩১৮০) (আধুনিক প্রকাশনীঃ ২৯৯৯, ইসলামিক ফাউন্ডেশনঃ ৩০০৯)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 3240,
			"arabicnumber": 3240,
			"text": "قَالَ أَبُو الْعَالِيَةِ : مُطَهَّرَةٌ مِنْ الْحَيْضِ وَالْبَوْلِ وَالْبُرْصَاقِ. كُلَّمَا رُزِقُوْا أُتُوْا بِشَيْءٍ ثُمَّ أُتُوْا بِآخَرَ قَالُوْا هَذَا الَّذِيْ رُزِقْنَا مِنْ قَبْلُ (البقرة : 25) أُتِيْنَا مِنْ قَبْلُ. وَأُتُوْا بِهٰ مُتَشَابِهًا (البقرة : 25) يُشْبِهُ بَعْضُهُ بَعْضًا وَيَخْتَلِفُ فِي الطُّعُومِ. قُطُوفُهَا يَقْطِفُوْنَ كَيْفَ شَاءُوْا. دَانِيَةٌ (الحاقة : 23) قَرِيْبَةٌ. الْأَرَآئِكُ (الكهف : 31) السُّرُرُ. وَقَالَ الْحَسَنُ : النَّضْرَةُ فِي الْوُجُوْهِ. وَالسُّرُوْرُ فِي الْقَلْبِ. وَقَالَ مُجَاهِدٌ : سَلْسَبِيْلًا (الإنسان 18) حَدِيْدَةُ الْجِرْيَةِ. غَوْلٌ : وَجَعُ الْبَطْنِ.يُنْزَفُوْنَ (الصفات : 47) لَا تَذْهَبُ عُقُوْلُهُمْ. وَقَالَ ابْنُ عَبَّاسٍ : دِهَاقًا (النبأ : 34) مُمْتَلِئًا. كَوَاعِبَ نَوَاهِدَ. الرَّحِيْقُ الْخَمْرُ. التَّسْنِيْمُ يَعْلُوْ شَرَابَ أَهْلِ الْجَنَّةِ. خِتَامُهُ طِيْنُهُ مِسْكٌ. نَضّٰخَتٰنِ فَيَّاضَتَانِ يُقَالُ : مَوْضُوْنَةٌ مَنْسُوْجَةٌ. مِنْهُ وَضِيْنُ النَّاقَةِ. وَالْكُوْبُ مَا لَا أُذْنَ لَهُ وَلَا عُرْوَةَ، وَالأَبَارِيْقُ ذَوَاتُ الْآذَانِ وَالْعُرَىعُرُبًا مُثَقَّلَةً وَاحِدُهَا عَرُوْبٌ. مِثْلُ صَبُوْرٍ وَصُبُرٍ يُسَمِّيهَا أَهْلُ مَكَّةِ : الْعَرِبَةَ، وَأَهْلُ الْمَدِيْنَةِ : الْغَنِجَةَ. وَأَهْلُ الْعِرَاقِ : الشَّكِلَةَ. وَقَالَ مُجَاهِدٌ : رَوْحٌ(الواقعة :89) جَنَّةٌ وَرَخَاءٌ، وَالرَّيْحٰنُ الرِّزْقُ. وَالْمَنْضُوْدُ الْمَوْزُ، وَالْمَخْضُوْدُ الْمُوقَرُ حَمْلًا، وَيُقَالُ أَيْضًا : لَا شَوْكَ لَهُ. وَالْعُرُبُ : الْمُحَبَّبَاتُ إِلَى أَزْوَاجِهِنَّ. وَيُقَالُ : مَسْكُوْبٌ جَارٍ. وَفُرُشٍ مَّرْفُوعَةٍ بَعْضُهَا فَوْقَ بَعْضٍ. لَغْوًا بَاطِلًا، تَأْثِيْمًا كَذِبًا. أَفْنٰنٌ أَغْصَانٌ وَجَنَى الْجَنَّتَيْنِ دَانٍ : مَا يُجْتَنَى قَرِيْبٌ مُدْهَآمَّتٰنِ سَوْدَاوَانِ مِنْ الرِّيِّ. আবুল ‘আলিয়াহ (রহ.) বলেন, مُطَهَّرَةٌ মাসিক ঋতু, পেশাব ও থুথু হতে পবিত্র। كُلَّمَا رُزِقُوْا যখনই তাদের সামনে কোন এক প্রকারের খাদ্য পরিবেশন করা হবে, অতঃপরই অন্য এক প্রকারের খাদ্য পরিবেশন করা হবে। তারা (জান্নাতবাসীরা) বলবে, এগুলো তো ইতোপূর্বেই আমাদেরকে পরিবেশন করা হয়েছে। وَأُتُوْا بِهِ مُتَشَابِهًا তাদেরকে পরস্পর সদৃশ খাবার পরিবেশন করা হবে অথচ সেগুলো স্বাদে হবে বিভিন্ন। قُطُوفُهَا তারা যেভাবে ইচ্ছা ফল ফলাদি গ্রহণ করবে। دَانِيَةٌ নিকটবর্তী الأَرَائِكُ পালঙ্কসমূহ। হাসান বসরী (রহ.) বলেন, النَّضْرَةُ -চেহারার সজীবতা। আর السُّرُوْرُ মনের আনন্দ। মুজাহিদ (রহ.) বলেন, سَلْسَبِيْلًا -দ্রুত প্রবাহিত পানি। غَوْلٌ পেটের ব্যথা। يُنْزَفُوْنَ তাদের বুদ্ধি লোপ পাবে না। ইবনু ‘আব্বাস (রাঃ) বলেন, دِهَاقًا পরিপূর্ণ। كَوَاعِبَঅংকুরিত যৌবনা তরুণী। الرَّحِيْقُ পানীয়। التَّسْنِيْمُ -জান্নাতবাসীদের পানীয় যা উঁচু হতে নিঃসৃত হয়। خِتَامُهُ তার মোড়ক হবে مِسْكٌ কস্তুরী। نَضَّاخَتَانِ দুই উচ্ছবলিত (ঝর্ণা) مَوْضُوْنَةٌ সোনা ও মণি মুক্তা দিয়ে তৈরী। এ শব্দটি হতেই وَضِيْنُ النَّاقَةِ -এর উৎপত্তি অর্থাৎ উটের পিঠের গদী। وَالْكُوْبُ -হাতল বিহীন পানপাত্র وَالأَبَارِيْقُ -হাতল বিশিষ্ট পানপাত্র। عُرُبًا-সোহাগিনী। একবচনে عَرُوْبٌ - যেমন صَبُوْرٍ -এর বহুবচন صُبُرٍ মক্কাবাসী একে الْعَرِبَةَ -মদিনাবাসী الْغَنِجَةَ আর ইরাকীরা الشَّكِلَةَ বলে থাকে। মুজাহিদ (রহ.) বলেন, رَوْحٌ জান্নাত ও স্বচ্ছল জীবন। الرَّيْحَانُ জীবিকা। الْمَنْضُوْدُ কলা وَالْمَخْضُوْدُ কাঁদি ভরা, এটাও বলা হয় যার কাঁটা নেই। الْعُرُبُ স্বামীদের নিকট সোহাগিনী। مَسْكُوْبٌ প্রবাহিত। فُرُشٍ مَرْفُوعَةٍ একটির উপর আরেকটি বিছানা لَغْوًا অলীক কথা। تَأْثِيْمًا মিথ্যা। أَفْنَانٌ ডালসমূহ। وَجَنَى الْجَنَّتَيْنِ دَانٍ দুই বাগিচার ফল হবে তাদের নিকটবর্তী যা নিকট হতে গ্রহণ করবে। مُدْهَامَّتَانِ এ বাগিচা দু’টি ঘন সবুজ। ৩২৪০. ‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যখন তোমাদের কোন ব্যক্তি মারা যায় তখন সকাল-সন্ধ্যায় তার পরকালের আবাসস্থল তার নিকট পেশ করা হয়। সে যদি জান্নাতবাসী হয় তবে তাকে জান্নাতবাসীর আবাস স্থান আর যদি সে জাহান্নামবাসী হয় তবে তাকে জাহান্নামবাসীর আবাস স্থান দেখানো হয়। (১৩৭৯) (আধুনিক প্রকাশনীঃ ৩০০০, ইসলামিক ফাউন্ডেশনঃ ৩০১০)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 3241,
			"arabicnumber": 3241,
			"text": "‘ইমরান ইবনু হুসাইন (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, ‘আমি জান্নাতের অধিবাসী সম্পর্কে জ্ঞাত হয়েছি। আমি জানতে পারলাম, জান্নাতে অধিকাংশ অধিবাসী হবে দরিদ্র লোক। জাহান্নামীদের সম্পর্কে জ্ঞাত হয়েছি, আমি জানতে পারলাম, এর বেশির ভাগ অধিবাসী নারী।’ (৫১৯৮, ৬৪৪৯, ৬৫৪৬) (আধুনিক প্রকাশনীঃ ৩০০১, ইসলামিক ফাউন্ডেশনঃ ৩০১১)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 3242,
			"arabicnumber": 3242,
			"text": "আবূ হুরাইরাহ্ হতে বর্ণিত। তিনি বলেন, ‘এক সময় আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট উপবিষ্ট ছিলাম। তিনি বললেন, আমি নিদ্রিত ছিলাম। দেখলাম আমি জান্নাতে অবস্থিত। হঠাৎ দেখলাম এক নারী একটি দালানের পাশে উযু করছে। আমি জিজ্ঞেস করলাম, এ দালানটি কার? তারা উত্তরে বললেন, ‘উমারের। তখন তাঁর আত্মমর্যাদার কথা আমার স্মরণ হল। আমি পেছনের দিকে ফিরে চলে আসলাম।’ একথা শুনে ‘উমার (রাঃ) কেঁদে ফেললেন এবং বললেন, ‘হে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আপনার সম্মুখে কি আমার কোন মর্যাদাবোধ থাকতে পারে? (৩৬৮০, ৫২২৭, ৭০২৩, ৭০২৫) (মুসলিম ৪৪/২ হাঃ ৩৩৯৫, আহমাদ ৮৪৭৮) (আধুনিক প্রকাশনীঃ ৩০০২, ইসলামিক ফাউন্ডেশনঃ ৩০১২)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 3243,
			"arabicnumber": 3243,
			"text": "‘আবদুল্লাহ ইবনু কায়স আল-আশ‘আরী (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, ‘গুণসম্পন্ন মোতির তাঁবু থাকবে যার উচ্চতা ত্রিশ মাইল। এর প্রতিটি কোণে মু’মিনদের জন্য এমন স্ত্রী থাকবে যাদেরকে অন্যরা কখনো দেখেনি।’ আবূ ‘আবদুস সামাদ ও হারিস ইবনু ‘উবায়দ আবূ ‘ইমরান (রহ.) হতে ষাট মাইল বলে বর্ণনা করেছেন। (৪৮৭৯) (মুসলিম ৫১/৯ হাঃ ২৮৩৮) (আধুনিক প্রকাশনীঃ ৩০০৩, ইসলামিক ফাউন্ডেশনঃ ৩০১৩)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 3244,
			"arabicnumber": 3244,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, ‘মহান আল্লাহ বলেছেন, আমি আমার নেককার বান্দাদের জন্য এমন জিনিস তৈরি করে রেখেছি, যা কোন চক্ষু দেখেনি, কোন কান শুনেনি এবং যার সম্পর্কে কোন মানুষের মনে ধারণাও জন্মেনি। তোমরা চাইলে এ আয়াতটি পাঠ করতে পার, ‘‘কেউ জানে না, তাদের জন্য তাদের চোখ শীতলকারী কী জিনিস লুকানো আছে’’- (আসসিজদাঃ ১৩) (৪৭৭৯, ৪৭৮০, ৭৪৯৮) (মুসলিম ৫১ হাঃ ২৮২৪, আহমাদ ৯৬৫৫) (আধুনিক প্রকাশনীঃ ৩০০৪, ইসলামিক ফাউন্ডেশনঃ ৩০১৪)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 3245,
			"arabicnumber": 3245,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, ‘যে দল প্রথমে জান্নাতে প্রবেশ করবে তাদের চেহারা পূর্ণিমা রাতের চাঁদের মত উজ্জ্বল হবে। তারা সেখানে থুথু ফেলবে না, নাক ঝাড়বে না, মলমূত্র ত্যাগ করবে না। সেখানে তাদের পাত্র হবে স্বর্ণের; তাদের চিরুণী হবে স্বর্ণ ও রৌপ্যের, তাদের ধুনুচিতে থাকবে সুগন্ধি কাষ্ঠ। তাদের গায়ের ঘাম মিসকের মত সুগন্ধময় হবে। তাদের প্রত্যেকের জন্য এমন দু’জন স্ত্রী থাকবে যাদের সৌন্দর্যের কারণে গোশত ভেদ করে পায়ের নলার হাড়ের মজ্জা দেখা যাবে। তাদের মধ্যে কোন মতভেদ থাকবে না; পরস্পর হিংসা-বিদ্বেষ থাকবে না। তাদের সকলের অন্তর এক অন্তরের মত হবে। তারা সকাল-সন্ধ্যায় আল্লাহর তাসবীহ পাঠ করতে থাকবে।’ (৩২৪৬, ৩২৫৪, ৩৩২৭) (আধুনিক প্রকাশনীঃ ৩০০৫, ইসলামিক ফাউন্ডেশনঃ ৩০১৫)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 3246,
			"arabicnumber": 3246,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, ‘প্রথম যে দল জান্নাতে প্রবেশ করবে তারা পূর্ণিমার চাঁদের মত উজ্জ্বল চেহারা নিয়ে প্রবেশ করবে আর তাদের পর যারা প্রবেশ করবে তারা অতি উজ্জ্বল তারার ন্যায় আকৃতি ধারণ করবে। তাদের অন্তরগুলো এক ব্যক্তির অন্তরের মত থাকবে। তাদের মধ্যে কোন রকম মতভেদ থাকবে না আর পরস্পর হিংসা-বিদ্বেষ থাকবে না। তাদের প্রত্যেকের দু’জন করে স্ত্রী থাকবে। সৌন্দর্যের কারণে গোশ্ত ভেদ করে পায়ের নলার মজ্জা দেখা যাবে। তারা সকাল-সন্ধ্যায় আল্লাহর তাসবীহ পাঠ করবে। তারা রোগাক্রান্ত হবে না, নাক ঝাড়বে না, থুথু ফেলবে না। তাদের পাত্রসমূহ হবে স্বর্ণ ও রৌপ্যের আর চিরুনীসমূহ হবে স্বর্ণের। তাদের ধুনুচিতে থাকবে সুগন্ধি কাষ্ঠ।’ আবুল ইয়ামান (রহ.) বলেন, অর্থাৎ কাষ্ঠ। তাদের গায়ের ঘাম মিসকের মত সুগন্ধময় হবে। মুজাহিদ (রহ.) বলেন, الْإِبْكَارُ অর্থ উষাকালের প্রথম অংশ الْعَشِيُّ অর্থ সূর্য ঢলে পড়ার সময় হতে অস্ত যাওয়া পর্যন্ত সময়কাল। (৩২৪৫) (আধুনিক প্রকাশনীঃ ৩০০৬, ইসলামিক ফাউন্ডেশনঃ ৩০১৬)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 3247,
			"arabicnumber": 3247,
			"text": "সাহল ইবনু সা‘দ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, আমার উম্মাতের সত্তর হাজার লোক অথবা সাত লক্ষ লোক একই সঙ্গে জান্নাতে প্রবেশ করবে। তাদের কেউ আগে কেউ পরে এভাবে নয় আর তাদের চেহারা পূর্ণিমার চাঁদের মত উজ্জ্বল থাকবে। (৬৫৪৩, ৬৫৫৪) (মুসলিম ১/৯৪ হাঃ ২১৯) (আধুনিক প্রকাশনীঃ ৩০০৭, ইসলামিক ফাউন্ডেশনঃ ৩০১৭)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 3248,
			"arabicnumber": 3248,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে একটি রেশমী জুববা হাদিয়া দেয়া হল। অথচ তিনি রেশমী বস্ত্র পরতে নিষেধ করতেন; লোকেরা তা খুব পছন্দ করল। তখন তিনি বললেন, ঐ সত্তার কসম! যাঁর হাতে মুহাম্মাদের প্রাণ, অবশ্যই জান্নাতে সা‘দ ইবনু মুআ‘যের রুমাল এর থেকে বেশি সুন্দর হবে। (২৬১৫) (আধুনিক প্রকাশনীঃ ৩০০৮, ইসলামিক ফাউন্ডেশনঃ ৩০১৮)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 3249,
			"arabicnumber": 3249,
			"text": "বারাআ ইবনু ‘আযিব (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট একখানা রেশমী বস্ত্র আনা হল। লোকজন এর সৌন্দর্য এবং কমনীয়তার জন্য সেটা খুব পছন্দ করতে লাগল। তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, ‘অবশ্যই জান্নাতে সা‘দ ইবনু মু‘আযের রুমাল এর থেকেও বেশি উত্তম হবে।’ (৩৮০২, ৫৮৩৬, ৬৬৪০) (আধুনিক প্রকাশনীঃ ৩০০৯, ইসলামিক ফাউন্ডেশনঃ ৩০১৯)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 3250,
			"arabicnumber": 3250,
			"text": "সাহল ইবনু সা‘দ আস্সা‘য়িদী (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, ‘জান্নাতে চাবুক পরিমাণ সামান্য জায়গাও দুনিয়া এবং এর মধ্যে যা আছে তার থেকে উত্তম।’ (২৭৯৪) (আধুনিক প্রকাশনীঃ ৩০১০, ইসলামিক ফাউন্ডেশনঃ ৩০২০)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 3251,
			"arabicnumber": 3251,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, জান্নাতে এমন একটি গাছ আছে, যার ছায়ায় কোন আরোহী শত বছর পর্যন্ত চললেও তা অতিক্রম করতে পারবে না। (আধুনিক প্রকাশনীঃ ৩০১১, ইসলামিক ফাউন্ডেশনঃ ৩০২১)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 3253,
			"arabicnumber": 3253,
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 3254,
			"arabicnumber": 3254,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, প্রথম যে দল জান্নাতে প্রবেশ করবে তাদের চেহারা পূর্ণিমা রাতের চাঁদের মত উজ্জ্বল হবে আর তাদের অনুগামী দলের চেহারা আকাশের উজ্জ্বল তারকার চেয়েও অধিক সুন্দর ও উজ্জ্বল হবে। তাদের অন্তরগুলো এক ব্যক্তির অন্তরের মত হবে। তাদের মধ্যে কোন বিদ্বেষ থাকবে না, কোন হিংসা থাকবে না, তাদের প্রত্যেকের জন্য ডাগর ডাগর চোখওয়ালা দু’জন করে এমন স্ত্রী থাকবে, যাদের পদ তলের অস্থি মজ্জা ও গোশ্ত ভেদ করে দেখা যাবে। (আধুনিক প্রকাশনীঃ ৩০১৩, ইসলামিক ফাউন্ডেশনঃ ৩০২৩)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 3255,
			"arabicnumber": 3255,
			"text": "বারাআ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, যখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (এর ছেলে) ইব্রাহীম (রাঃ) ইন্তিকাল করেন, তখন তিনি বলেন, জান্নাতে এর এক ধাত্রী আছে। (১৩৮২) (আধুনিক প্রকাশনীঃ ৩০১৪, ইসলামিক ফাউন্ডেশনঃ ৩০২৪)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 3256,
			"arabicnumber": 3256,
			"text": "আবূ সা‘ঈদ খুদরী (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, অবশ্যই জান্নাতবাসীরা তাদের উপরের বালাখানার বাসিন্দাদের এমনভাবে দেখতে পাবে, যেমন তোমরা আকাশের পূর্ব অথবা পশ্চিম দিকে উজ্জ্বল দীপ্তিমান নক্ষত্র দেখতে পাও। এটা হবে তাদের মধ্যে মর্যাদার পার্থক্যের কারণে। সাহাবীগণ বললেন, ‘হে আল্লাহর রাসূল! এ তো নবীগণের জায়গা। তাদের ব্যতীত অন্যরা সেখানে পৌঁছতে পারবে না। তিনি বললেন, হ্যাঁ, সে সত্তার কসম, যাঁর হাতে আমার প্রাণ, যেসব লোক আল্লাহর প্রতি ঈমান আনবে এবং রাসূলগণকে সত্য বলে স্বীকার করবে। (৬৫৫৬) (মুসলিম ৫১/৩ হাঃ ২৮৩১, আহমাদ ২২৯৩৯) (আধুনিক প্রকাশনীঃ ৩০১৫, ইসলামিক ফাউন্ডেশনঃ ৩০২৫)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 3257,
			"arabicnumber": 3257,
			"text": "وَقَالَ النَّبِيُّ صلى الله عليه وسلم مَنْ أَنْفَقَ زَوْجَيْنِ دُعِيَ مِنْ بَابِ الْجَنَّةِ فِيْهِ عُبَادَةُ عَنْ النَّبِيِّ صلى الله عليه وسلم নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যে ব্যক্তি কোন জিনিস জোড়া জোড়া দান করবে তাকে জান্নাতের দরজা থেকে ডাকা হবে। এ কথাটি ‘উবাদাহ (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট হতে বর্ণনা করেছেন। ৩২৫৭. সাহল ইবনু সা‘দ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, ‘জান্নাতে আটটি দরজা। তার মধ্যে একটি দরজার নাম হবে রাইয়্যান। সাওম পালনকারী ছাড়া অন্য কেউ এ দরজা দিয়ে প্রবেশ করবে না।’ (১৮৯৬) (আধুনিক প্রকাশনীঃ ৩০১৬, ইসলামিক ফাউন্ডেশনঃ ৩০২৬)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 3258,
			"arabicnumber": 3258,
			"text": "غَسّٰقًا يُقَالُ غَسَقَتْ عَيْنُهُ وَيَغْسِقُ الْجُرْحُ وَكَأَنَّ الْغَسَاقَ وَالْغَسَيْقَ وَاحِدٌ غِسْلِيْنُ كُلُّ شَيْءٍ غَسَلْتَهُ فَخَرَجَ مِنْهُ شَيْءٌ فَهُوَ غِسْلِيْنُ فِعْلِيْنُ مِنْ الْغَسْلِ مِنْ الْجُرْحِ وَالدَّبَرِ وَقَالَ عِكْرِمَةُ حَصَبُ جَهَنَّمَ حَطَبُ بِالْحَبَشِيَّةِ وَقَالَ غَيْرهُ حَاصِبًا الرِّيحُ الْعَاصِفُ وَالْحَاصِبُ مَا تَرْمِيْ بِهِ الرِّيحُ وَمِنْهُ حَصَبُ جَهَنَّمَ يُرْمَى بِهِ فِيْ جَهَنَّمَ هُمْ حَصَبُهَا وَيُقَالُ حَصَبَ فِي الأَرْضِ ذَهَبَ وَالْحَصَبُ مُشْتَقٌّ مِنْ حَصْبَاءِ الْحِجَارَةِ صَدِيْدٌ قَيْحٌ وَدَمٌ خَبَتْ طَفِئَتْ تُوْرُوْنَ تَسْتَخْرِجُوْنَ أَوْرَيْتُ أَوْقَدْتُ لِلْمُقْوِيْنَ لِلْمُسَافِرِيْنَ وَالْقِيُّ الْقَفْرُ وَقَالَ ابْنُ عَبَّاسٍ صِرَاطُ الْجَحِيْمِ سَوَاءُ الْجَحِيْمِ وَوَسَطُ الْجَحِيْمِ لَشَوْبًا مِّنْ حَمِيْمٍ يُخْلَطُ طَعَامُهُمْ وَيُسَاطُ بِالْحَمِيْمِ زَفِيْرٌ وَّشَهِيْقٌ صَوْتٌ شَدِيْدٌ وَصَوْتٌ ضَعِيْفٌ وِرْدًا عِطَاشًا غَيًّا خُسْرَانًا وَقَالَ مُجَاهِدٌ يُسْجَرُوْنَ تُوقَدُ بِهِمْ النَّارُ وَنُحَاسٌ الصُّفْرُ يُصَبُّ عَلَى رُءُوسِهِمْ يُقَالُ ذُوْقُوْا بَاشِرُوْا وَجَرِّبُوْا وَلَيْسَ هَذَا مِنْ ذَوْقِ الْفَمِ مَارِجٌ خَالِصٌ مِنْ النَّارِ مَرَجَ الأَمِيْرُ رَعِيَّتَهُ إِذَا خَلَاهُمْ يَعْدُوْ بَعْضُهُمْ عَلَى بَعْضٍ مَرِيْجٍ مُلْتَبِسٍ مَرِجَ أَمْرُ النَّاسِ اخْتَلَطَ مَرَجَ الْبَحْرَيْنِ (الرحمن : 19) مَرَجْتَ دَابَّتَكَ تَرَكْتَهَا প্রবাহিত পূঁজ যেমন কেউ বলে, তার চোখ প্রবাহিত হয়েছে ও ঘা প্রবাহিত হচ্ছে। আর একই অর্থ। যে কোন বস্তুকে ধৌত করার পর তা হতে যা কিছু বের হয়, তাকে বলা হয়, এটাশব্দ হতে -এর ওযনে হয়ে থাকে। ‘ইকরিমাহ (রহ.) বলেছেন, এর অর্থ জাহান্নামের জ্বালানী। এটা হাবশীদের ভাষা। আর অন্যরা বলেছেন, অর্থ দমকা হাওয়া। আর অর্থ বায়ু যা ছুঁড়ে ফেলে। এ হতে হয়েছেযার অর্থ হচ্ছে যা কিছু জাহান্নামে ছুঁড়ে ফেলা হয় আর এরাই এর জ্বালানী। শব্দটি শব্দ হতে উৎপত্তি। যার অর্থ কংকরসমূহ। পূঁজ ও রক্ত। নিভে গেছে। তোমরা আগুন বের করছ। অর্থ আমি আগুন জ্বালিয়েছি। মুসাফিরগণের উপকারার্থে। আর তরুলতাহীন প্রান্তর। ইবনু ‘আব্বাস (রাঃ) বলেছেন, অর্থ জাহান্নামের দিক ও তার মধ্যস্থল। তাদের খাদ্য অতি গরম পানির সঙ্গে মিশানো হবে। কঠোর চিৎকার ও আর্তনাদ। পিপাসার্ত। ক্ষতিগ্রস্ত। মুজাহিদ (রহ.) বলেছেন, তাদের দ্বারা আগুন জ্বালানো হবে। আর অর্থ শীশা যা গলিয়ে তাদের মাথায় ঢেলে দেয়া হবে। বলা হয়েছে এর অর্থ স্বাদ গ্রহণ কর এবং অভিজ্ঞতা হাসিল কর। এটা কিন্তু মুখের দ্বারা সাদ গ্রহণ করা নয়। নির্ভেজাল অগ্নি। আমীর তার প্রজাকে ছেড়ে দিয়েছে, কথাটি এ সময় বলা হয় যখন সে তাদেরকে ছেড়ে দেয় আর তারা একে অন্যের প্রতি শত্রুতা করতে থাকে। মিশ্রিত। যখন মানুষের কোন বিষয় তালগোল পাকিয়ে যায়। আর অর্থ তিনি দু’টি নদী প্রবাহিত করেছেন। এ কথাটি সে সময় বলা হয়, যখন তুমি তোমার চতুষ্পদ জন্তুকে ছেড়ে দাও। ৩২৫৮. আবূ যার (রাঃ) হতে বর্ণিত। তিনি বলেন, যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এক সফরে ছিলেন, তখন তিনি বললেন, ‘ঠান্ডা হতে দাও।’ আবার বললেন, ‘টিলাগুলোর ছায়া নীচে নেমে আসা পর্যন্ত ঠান্ডা হতে দাও।’ আবার বললেন, ‘সালাত ঠান্ডা হলে পরে আদায় করবে। কেননা, গরমের তীব্রতা জাহান্নামের উত্তাপ থেকে হয়।’ (৫৩৫) (আধুনিক প্রকাশনীঃ ৩০১৭, ইসলামিক ফাউন্ডেশনঃ ৩০২৭)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 3259,
			"arabicnumber": 3259,
			"text": "৩২৫৯ আবূ সা‘ঈদ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন যে, সালাত ঠান্ডা হলে, পরে আদায় করবে। কেননা গরমের ভীষণতা জাহান্নামের উত্তাপ হতে হয়।’ (৫৩৮) (আধুনিক প্রকাশনীঃ ৩০১৮, ইসলামিক ফাউন্ডেশনঃ ৩০২৮)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 3260,
			"arabicnumber": 3260,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, ‘জাহান্নাম তার রবের নিকট অভিযোগ করে বলেছে, হে রব! আমার এক অংশ অপর অংশকে খেয়ে ফেলেছে। তখন তিনি তাকে দু’টি নিঃশ্বাস ফেলার অনুমতি প্রদান করেন। একটি নিঃশ্বাস শীতকালে আর একটি নিঃশ্বাস গ্রীষ্মকালে। কাজেই তোমরা গরমের তীব্রতা এবং শীতের তীব্রতা পেয়ে থাক।’ (৫৩৭) (আধুনিক প্রকাশনীঃ ৩০১৯, ইসলামিক ফাউন্ডেশনঃ ৩০২৯)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 3261,
			"arabicnumber": 3261,
			"text": "আবূ জামরাহ যুবা‘য়ী (রহ.) হতে বর্ণিত। তিনি বলেন, আমি মক্কা্য় ইবনু ‘আব্বাস (রাঃ)-এর নিকট বসতাম। একবার আমি জ্বরাক্রান্ত হই। তখন তিনি আমাকে বললেন, ‘তুমি তোমার গায়ের জ্বর যমযমের পানি দিয়ে ঠান্ডা কর।’ কারণ, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, এটা জাহান্নামের উত্তাপ হতেই হয়ে থাকে। কাজেই তোমরা তা পানি দিয়ে ঠান্ডা কর অথবা বলেছেন, যমযমের পানি দিয়ে ঠান্ডা কর। এ বিষয়ে বর্ণনাকারী হাম্মাম সন্দেহ পোষণ করেছেন। (আধুনিক প্রকাশনীঃ ৩০২০, ইসলামিক ফাউন্ডেশনঃ ৩০৩০)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 3262,
			"arabicnumber": 3262,
			"text": "রাফি‘ ইবনু খাদীজ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি যে, ‘জ্বরের উৎপত্তি হয় জাহান্নামের ভীষণ উত্তাপ হতে। অতএব তোমাদের গায়ের সে তাপ পানি দ্বারা ঠান্ডা কর।’ (৫৭২৬) (আধুনিক প্রকাশনীঃ ৩০২১, ইসলামিক ফাউন্ডেশনঃ ৩০৩১)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 3263,
			"arabicnumber": 3263,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, ‘জ্বর হয় জাহান্নামের উত্তাপ থেকে। কাজেই তোমরা তা পানি দিয়ে ঠান্ডা কর।’ (৫৭২৫) (মুসলিম ৩৯/২৬ হাঃ ২২১০) (আধুনিক প্রকাশনীঃ ৩০২২, ইসলামিক ফাউন্ডেশনঃ ৩০৩২)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 3264,
			"arabicnumber": 3264,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, ‘জ্বর হয় জাহান্নামের উত্তাপ থেকে, কাজেই তোমরা পানি দিয়ে তা ঠান্ডা কর।’ (৫৭২৩) (আধুনিক প্রকাশনীঃ ৩০২৩, ইসলামিক ফাউন্ডেশনঃ ৩০৩৩)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 3265,
			"arabicnumber": 3265,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমাদের আগুন জাহান্নামের আগুনের সত্তর ভাগের একভাগ মাত্র। বলা হল, ‘হে আল্লাহর রাসূল! জাহান্নামীদেরকে শাস্তি দেয়ার জন্য দুনিয়ার আগুনই তো যথেষ্ট ছিল।’ তিনি বললেন, ‘দুনিয়ার আগুনের উপর জাহান্নামের আগুনের তাপ আরো ঊনসত্তর গুণ বাড়িয়ে দেয়া হয়েছে, প্রত্যেক অংশে তার সম পরিমাণ উত্তাপ রয়েছে।’ (আধুনিক প্রকাশনীঃ ৩০২৪, ইসলামিক ফাউন্ডেশনঃ ৩০৩৪)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 3266,
			"arabicnumber": 3266,
			"text": "ইয়া‘লা (রহ.) এর পিতা হতে বর্ণিত। তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে মিম্বারে তিলাওয়াত করতে শুনেছেন, ‘‘আর তারা ডাকবে, হে মালিক।’’ (যুখরুফ : ৭৭) (৩২৩০) (আধুনিক প্রকাশনীঃ ৩০২৫, ইসলামিক ফাউন্ডেশনঃ ৩০৩৫)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 3267,
			"arabicnumber": 3267,
			"text": "আবূ ওয়াইল (রহ.) হতে বর্ণিত। তিনি বলেন, উসামাহ (রাঃ)-কে বলা হল, কত ভাল হত! যদি আপনি ঐ ব্যক্তির (উসমান (রাঃ)-এর নিকট যেতেন এবং তাঁর সঙ্গে আলোচনা করতেন। উত্তরে তিনি বললেন, আপনারা মনে করছেন যে আমি তাঁর সঙ্গে আপনাদেরকে শুনিয়ে শুনিয়ে বলব। অথচ আমি তাঁর সঙ্গে (দাঙ্গা দমনের ব্যাপারে) গোপনে আলোচনা করছি, যেন আমি একটি দ্বার খুলে না বসি। আমি দ্বার উন্মুক্তকারীর প্রথম ব্যক্তি হতে চাই না। আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট হতে কিছু শুনেছি, যার পরে আমি কোন ব্যক্তিকে যিনি আমাদের আমীর নির্বাচিত হয়েছেন এ কারণে তিনি আমাদের সবচেয়ে উত্তম ব্যক্তি এ কথা বলতে পারি না। লোকেরা তাঁকে বলল, আপনি তাঁকে কী বলতে শুনেছেন? উসামাহ (রাঃ) বললেন, আমি তাঁকে বলতে শুনেছি, কিয়ামতের দিন এক ব্যক্তিকে আনা হবে। অতঃপর তাকে জাহান্নামে নিক্ষেপ করা হবে। তখন আগুনে পুড়ে তার নাড়িভুঁড়ি বের হয়ে যাবে। এ সময় সে ঘুরতে থাকবে যেমন গাধা তার চাকা নিয়ে তার চারপাশে ঘুরতে থাকে। তখন জাহান্নামবাসীরা তার নিকট একত্রিত হয়ে তাকে বলবে, হে অমুক ব্যক্তি! তোমার এ অবস্থা কেন? তুমি না আমাদেরকে সৎ কাজের আদেশ করতে আর অন্যায় কাজ হতে নিষেধ করতে? সে বলবে, আমি তোমাদেরকে সৎ কাজে আদেশ করতাম বটে, কিন্তু আমি তা করতাম না আর আমি তোমাদেরকে অন্যায় কাজ হতে নিষেধ করতাম, অথচ আমিই তা করতাম। এ হাদীসটি গুনদার (রহ.) শুবা (রহ.) সূত্রে আ‘মাশ (রহ.) হতে বর্ণনা করেছেন। (৭০৯৮) (মুসলিম ৫৩/৭ হাঃ ২৯৮৯) (আধুনিক প্রকাশনীঃ ৩০২৬, ইসলামিক ফাউন্ডেশনঃ ৩০৩৬)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 3268,
			"arabicnumber": 3268,
			"text": "وَقَالَ مُجَاهِدٌ يُقْذَفُوْنَ يُرْمَوْنَ دُحُوْرًا مَطْرُوْدِيْنَ وَاصِبٌ دَائِمٌ وَقَالَ ابْنُ عَبَّاسٍ مَدْحُوْرًا مَطْرُوْدًا يُقَالُ مَرِيْدًا مُتَمَرِّدًا بَتَّكَهُ قَطَّعَهُ وَاسْتَفْزِزْ اسْتَخِفَّ بِخَيْلِكَ الْفُرْسَانُ وَالرَّجْلُ الرَّجَّالَةُ وَاحِدُهَا رَاجِلٌ مِثْلُ صَاحِبٍ وَصَحْبٍ وَتَاجِرٍ وَتَجْرٍ لَاحْتَنِكَنَّ لَاسْتَأْصِلَنَّ قَرِيْنٌ شَيْطَانٌ মুজাহিদ (রহ.) বলেন, يُقْذَفُوْنَ তাদের নিক্ষেপ করা হবে। دُحُوْرًا তাদের হাঁকিয়ে বের করে দেয়া হবে। وَاصِبٌ স্থায়ী। আর ইবনু ‘আব্বাস (রাঃ) বলেন, مَدْحُوْرًا হাঁকিয়ে বের করা অবস্থায়। مَرِيْدًا বিদ্রোহীরূপে। بَتَّكَهُ তাকে ছিন্ন করেছে। وَاسْتَفْزِزْ তুমি ভয় দেখাও। بِخَيْلِكَ অশ্বারোহী। وَالرَّجْلُ পদাতিকগণ। এর একবচন رَاجِلٌ যেমন صَاحِب এর বহুবচন صَحْب আর تَاجِر এর বহুবচনاتَجْرٍ لَاحْتَنِكَنَّ অবশ্যই আমি সমূলে উৎপাটন করব। قَرِيْنٌ শয়তান। ৩২৬৮. ‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে যাদু করা হয়েছিল। লায়স (রহ.) বলেন, আমার নিকট হিশাম পত্র লিখেন, তাতে লেখা ছিল যে, তিনি তাঁর পিতার সূত্রে ‘আয়িশাহ (রাঃ) হতে হাদীস শুনেছেন এবং তা ভালভাবে মুখস্থ করেছেন। ‘আয়িশাহ (রাঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে যাদু করা হয়। এমনকি যাদুর প্রভাবে তাঁর খেয়াল হতো যে, তিনি স্ত্রীগণের বিষয়ে কোন কাজ করে ফেলেছেন অথচ তিনি তা করেননি। শেষ পর্যন্ত একদা তিনি রোগ আরোগ্যের জন্য বারবার দু‘আ করলেন, অতঃপর তিনি আমাকে বললেন, তুমি কি জান আল্লাহ আমাকে জানিয়ে দিয়েছেন, যাতে আমার রোগের আরোগ্য আছে? আমার নিকট দু’জন লোক আসল। তাদের একজন মাথার নিকট বসল আর অপরজন আমার পায়ের নিকট বসল। অতঃপর একজন অন্যজনকে জিজ্ঞেস করল, এ ব্যক্তির রোগটা কী? জিজ্ঞাসিত লোকটি জবাব দিল, তাকে যাদু করা হয়েছে। প্রথম লোকটি বলল, তাকে যাদু কে করল? সে বলল, লবীদ ইবনু আ‘সাম। প্রথম ব্যক্তি বলল, কিসের দ্বারা? দ্বিতীয় ব্যক্তি বলল, তাকে যাদু করা হয়েছে, চিরুনি, সুতার তাগা এবং খেজুরের খোসায়। প্রথম ব্যক্তি জিজ্ঞেস করল, এগুলো কোথায় আছে? দ্বিতীয় ব্যক্তি জবাব দিল, যারওয়ান কূপে। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সেখানে গেলেন এবং ফিরে আসলেন, অতঃপর তিনি ‘আয়িশাহ (রাঃ)-কে বললেন, কূপের কাছের খেজুর গাছগুলো যেন এক একটা শয়তানের মাথা। তখন আমি জিজ্ঞেস করলাম, আপনি কি সেই যাদু করা জিনিসগুলো বের করতে পেরেছেন? তিনি বলেন, না। তবে আল্লাহ আমাকে আরোগ্য দিয়েছেন। আমার আশংকা হয়েছিল এসব জিনিস বের করলে মানুষের মধ্যে ফাসাদ সৃষ্টি হতে পারে। অতঃপর সেই কূপটি বন্ধ করে দেয়া হল। (৩১৭৫) (আধুনিক প্রকাশনীঃ ৩০২৭, ইসলামিক ফাউন্ডেশনঃ ৩০৩৭)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 3269,
			"arabicnumber": 3269,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, ‘তোমাদের কেউ যখন নিদ্রা যায় তখন শয়তান তার মাথার শেষভাগে তিনটি করে গিরা দিয়ে দেয়। প্রত্যেক গিরার সময় এ কথা বলে কুমন্ত্রণা দেয় যে, এখনো রাত অনেক রয়ে গেছে, কাজেই শুয়ে থাক। অতঃপর সে লোক যদি জেগে উঠে এবং আল্লাহকে স্মরণ করে তখন একটি গিরা খুলে যায়। অতঃপর যদি সে উযূ করে, তবে দ্বিতীয় গিরাও খুলে যায়। আর যদি সে সালাত আদায় করে তবে সব কয়টি গিরাই খুলে যায়। আর খুশীর সঙ্গে পবিত্র মনে তার সকাল হয়, অন্যথায় অপবিত্র মনে আলস্যের সাথে তার সকাল হয়। (১১৪২) (আধুনিক প্রকাশনীঃ ৩০২৮, ইসলামিক ফাউন্ডেশনঃ ৩০৩৮)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 3270,
			"arabicnumber": 3270,
			"text": "‘আবদুল্লাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট এমন এক লোকের ব্যাপারে উল্লেখ করা হল, যে সারা রাত এমনকি ভোর পর্যন্ত ঘুমিয়ে ছিল। তখন তিনি বললেন, সে এমন লোক যার উভয় কানে অথবা তিনি বললেন, তার কানে শয়তান পেশাব করেছে। (১১৪৪) (আধুনিক প্রকাশনীঃ ৩০২৯, ইসলামিক ফাউন্ডেশনঃ ৩০৩৯)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 3271,
			"arabicnumber": 3271,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, দেখ, তোমাদের কেউ যখন তার স্ত্রীর কাছে আসে, আর তখন বলে, বিসমিল্লাহ। হে আল্লাহ! আমাদেরকে শয়তানের প্রভাব থেকে দূরে রাখ। আর আমাদেরকে যে সন্তান দান করবে তাকেও শয়তানের প্রভাব থেকে বাঁচিয়ে রাখ। অতঃপর তাদেরকে যে সন্তান দেয়া হবে শয়তান তার কোন ক্ষতি করতে পারবে না। (১৪১) (আধুনিক প্রকাশনীঃ ৩০৩০, ইসলামিক ফাউন্ডেশনঃ ৩০৪০)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 3273,
			"arabicnumber": 3273,
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 3274,
			"arabicnumber": 3274,
			"text": "আবূ সা‘ঈদ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, সালাত আদায়ের সময় তোমাদের কারো সম্মুখ দিয়ে যখন কেউ চলাচল করবে তখন সে তাকে অবশ্যই বাধা দিবে। সে যদি অমান্য করে তবে আবারো তাকে বাধা দিবে। অতঃপরও যদি সে অমান্য করে তবে অবশ্যই তার সঙ্গে লড়াই করবে। কেননা সে শয়তান। (৫০৯) (আধুনিক প্রকাশনীঃ ৩০৩২, ইসলামিক ফাউন্ডেশনঃ ৩০৪২)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 3275,
			"arabicnumber": 3275,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে রমাযানের যাকাত (সদাকাতুল ফিত্রের) হিফাযতের দায়িত্ব প্রদান করলেন। অতঃপর আমার নিকট এক আগন্তুক আসল। সে তার দু’হাতের আঁজলা ভরে খাদ্যশস্য গ্রহণ করতে লাগল। তখন আমি তাকে ধরে ফেললাম এবং বললাম, আমি অবশ্যই তোমাকে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট নিয়ে যাব। তখন সে একটি হাদীস উল্লেখ করল এবং বলল, যখন তুমি বিছানায় শুতে যাবে, তখন আয়াতুল কুরসী পড়বে। তাহলে সর্বদা আল্লাহর পক্ষ হতে তোমার জন্য একজন হিফাযতকারী থাকবে এবং সকাল হওয়া অবধি তোমার নিকট শয়তান আসতে পারবে না। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, সে তোমাকে সত্য বলেছে, অথচ সে মিথ্যাচারী এবং শয়তান ছিল। (২৩১১) (আধুনিক প্রকাশনীঃ ৩০৩৩, ইসলামিক ফাউন্ডেশনঃ ৩০৪২ শেষাংশ)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 3276,
			"arabicnumber": 3276,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমাদের কারো নিকট শয়তান আসতে পারে এবং সে বলতে পারে, এ বস্তু কে সৃষ্টি করেছে? ঐ বস্তু কে সৃষ্টি করেছে? এরূপ প্রশ্ন করতে করতে শেষ পর্যন্ত বলে বসবে, তোমার প্রতিপালককে কে সৃষ্টি করেছে? যখন ব্যাপারটি এ স্তরে পৌঁছে যাবে তখন সে যেন অবশ্যই আল্লাহর নিকট আশ্রয় চায় এবং বিরত হয়ে যায়। (মুসলিম ১/৬০ হাঃ ১৩৪) (আধুনিক প্রকাশনীঃ ৩০৩৪, ইসলামিক ফাউন্ডেশনঃ ৩০৪৩)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 3277,
			"arabicnumber": 3277,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যখন রমাযান মাস আরম্ভ হয়, জান্নাতের দরজাগুলো খুলে দেয়া হয় এবং জাহান্নামের দরজাগুলো বন্ধ করে দেয়া হয় আর শয়তানদেরকে শিকলে বেঁধে রাখা হয়। (১৮৯৮) (আধুনিক প্রকাশনীঃ ৩০৩৫, ইসলামিক ফাউন্ডেশনঃ ৩০৪৪)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 3278,
			"arabicnumber": 3278,
			"text": "উবাই ইবনু কা‘ব (রাঃ) হতে বর্ণিত। তিনি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছেন, ‘‘মূসা তার সঙ্গীকে বললেনঃ আমাদের নাশতা আন এ সফরে আমরা অবশ্যই ক্লান্ত হয়ে পড়েছি। সঙ্গী বললঃ আপনি কি লক্ষ্য করেছেন, আমরা যখন প্রস্তর খন্ডের কাছে বিশ্রাম করছিলাম, তখন আমি মাছের কথা ভুলে গিয়েছিলাম। শয়তানই আমাকে এ কথা স্মরণ রাখতে ভুলিয়ে দিয়েছিল’’- (কাহ্ফ ৬২-৬৩)। আল্লাহ তা‘আলা মূসা (আঃ)-কে যে স্থানটি সম্পর্কে নির্দেশ দিয়েছিলেন, তিনি সে স্থানটি অতিক্রম করা পর্যন্ত কোন প্রকার ক্লান্তি অনুভব করেননি। (৭৪) (আধুনিক প্রকাশনীঃ ৩০৩৬, ইসলামিক ফাউন্ডেশনঃ ৩০৪৫)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 3279,
			"arabicnumber": 3279,
			"text": "‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে দেখেছি, তিনি পূর্ব দিকে ইঙ্গিত করে বলেছেন, সাবধান! ফিতনা এখানেই। সাবধান! ফিতনা এখানেই। যেখান থেকে শয়তানের শিং উদিত হবে। (৩১০৪) (আধুনিক প্রকাশনীঃ ৩০৩৭, ইসলামিক ফাউন্ডেশনঃ ৩০৪৬)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 3280,
			"arabicnumber": 3280,
			"text": "জাবির (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, ‘সূর্যাস্তের পরপরই যখন রাত শুরু হয় অথবা বলেছেন, যখন রাতের অন্ধকার নেমে আসে তখন তোমরা তোমাদের শিশুদেরকে ঘরে আটকে রাখবে। কারণ এ সময় শয়তানেরা ছড়িয়ে পড়ে। অতঃপর যখন রাতের কিছু অংশ অতিবাহিত হবে তখন তাদের ছেড়ে দিতে পার আর তুমি তোমার ঘরের দরজা বন্ধ করে দাও এবং আল্লাহর নাম স্মরণ কর। তোমাদের ঘরের বাতি নিভিয়ে দাও এবং আল্লাহর নাম স্মরণ কর। তোমার পানি রাখার পাত্রের মুখ ঢেকে রাখ এবং আল্লাহর নাম স্মরণ কর। তোমার বাসনপত্র ঢেকে রাখ এবং আল্লাহর নাম স্মরণ কর। সামান্য কিছু হলেও তার ওপর দিয়ে রেখে দাও।’ (৩৩০৪, ৩৩১৬, ৫৬২৩, ৫৬২৪, ৬২৯৫, ৬২৯৬) (মুসলিম ৩৬/১২ হাঃ ২০১২, আহমাদ ১৪৮৩৫) (আধুনিক প্রকাশনীঃ ৩০৩৮, ইসলামিক ফাউন্ডেশনঃ ৩০৪৭)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 3281,
			"arabicnumber": 3281,
			"text": "সাফিয়্যাহ বিনতু হুয়াই (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ই‘তিকাফ অবস্থায় ছিলেন। আমি রাতে তাঁর সঙ্গে দেখা করতে আসলাম। অতঃপর তাঁর সঙ্গে কিছু কথা বললাম। অতঃপর আমি ফিরে আসার জন্য দাঁড়ালাম। তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-ও আমাকে পৌঁছে দেয়ার জন্য আমার সঙ্গে উঠে দাঁড়ালেন। আর তাঁর বাসস্থান ছিল উসামাহ ইবনু যায়দের বাড়িতে। এ সময় দু’জন আনসারী সে স্থান দিয়ে অতিক্রম করল। তারা যখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে দেখল তখন তারা শীঘ্র চলে যেতে লাগল। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তোমরা একটু থাম। এ সাফিয়্যা বিন্তে হুয়াই। তারা বললেন, সুবহানাল্লাহ! হে আল্লাহর রাসূল! তিনি বললেন, মানুষের রক্তধারায় শয়তান প্রবাহমান থাকে। আমি শংকাবোধ করছিলাম, সে তোমাদের মনে কোন খারাপ ধারণা অথবা বললেন অন্য কিছু সৃষ্টি করে না কি। (২০৩৫) (আধুনিক প্রকাশনীঃ ৩০৩৯, ইসলামিক ফাউন্ডেশনঃ ৩০৪৮)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 3282,
			"arabicnumber": 3282,
			"text": "সুলাইমান ইবনু সুরাদ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে উপবিষ্ট ছিলাম। তখন দু’জন লোক গালাগালি করছিল। তাদের এক জনের চেহারা লাল হয়ে গিয়েছিল এবং তার রগগুলো ফুলে গিয়েছিল। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আমি এমন একটি দু’আ জানি, যদি এ লোকটি তা পড়ে তবে তার রাগ দূর হয়ে যাবে। সে যদি পড়ে আ‘ঊযুবিল্লাহি মিনাশ শায়তান’’-আমি শয়তান হতে আল্লাহর নিকট আশ্রয় চাই। তবে তার রাগ চলে যাবে। তখন তাকে বলল, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তুমি আল্লাহর নিকট শয়তান থেকে আশ্রয় চাও। সে বলল, আমি কি পাগল হয়েছি? (৬০৪৮, ৬১১৫) (মুসলিম ৪৫/৩০ হাঃ ২৬১০) (আধুনিক প্রকাশনীঃ ৩০৪০, ইসলামিক ফাউন্ডেশনঃ ৩০৪৯)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 3283,
			"arabicnumber": 3283,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমাদের কেউ যখন তার স্ত্রীর নিকট গমন করে এবং বলে, ‘‘হে আল্লাহ! আমাকে শয়তান হতে রক্ষা কর আর আমাকে এর মাধ্যমে যে সন্তান দিবে তাকেও শয়তান থেকে হিফাজত কর। তাহলে যদি তাদের কোন সন্তান জন্মায়, তবে শয়তান তার কোন ক্ষতি করতে পারবে না এবং তার উপর কোন প্রভাব ফেলতে পারবে না। আসমা (রহ.).....ইবনু ‘আব্বাস (রাঃ) নিকট হতে অনুরূপ রিওয়ায়ত বর্ণনা করেন (১৪১) (আধুনিক প্রকাশনীঃ ৩০৪১, ইসলামিক ফাউন্ডেশনঃ ৩০৫০)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 3284,
			"arabicnumber": 3284,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সালাত আদায় করলেন। অতঃপর বললেন, শয়তান আমার সামনে এসেছিল। সে আমার সালাত নষ্ট করার বহু চেষ্টা করেছিল। কিন্তু আল্লাহ আমাকে তার উপর বিজয়ী করেন। অতঃপর পূর্ণাঙ্গ হাদীসটি উল্লেখ করেন। (৪৬১) (আধুনিক প্রকাশনীঃ ৩০৪২, ইসলামিক ফাউন্ডেশনঃ ৩০৫১)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 3285,
			"arabicnumber": 3285,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যখন সালাতের জন্যে আযান দেয়া হয় তখন শয়তান সশব্দে বায়ু ছাড়তে ছাড়তে পালাতে থাকে। আযান শেষ হলে সামনে এগিয়ে আসে। আবার যখন ইকামাত দেয়া হয় তখন আবার পালাতে থাকে। ইকামাত শেষ হলে আবার সামনে আসে এবং মানুষের মনে খটকা সৃষ্টি করতে থাকে আর বলতে থাকে ওটা ওটা মনে কর। এমনকি সে ব্যক্তি আর মনে রাখতে পারে না যে, সে কি তিন রাক‘আত পড়ল না চার রাকআত পড়ল। এ রকম যদি কারো হয়ে যায়, সে মনে রাখতে পারে না তিন রাকা‘আত পড়েছে না কি চার রাকআত তখন সে যেন দু’টি সাহু সাজ্দাহ করে। (৬০৮) (আধুনিক প্রকাশনীঃ ৩০৪৩, ইসলামিক ফাউন্ডেশনঃ ৩০৫২)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 3286,
			"arabicnumber": 3286,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, প্রত্যেক আদম সন্তানের জন্মের সময় তার পার্শ্বদেশে শয়তান তার দুই আঙ্গুল দ্বারা খোঁচা মারে। ‘ঈসা ইবনু মরয়াম (আঃ)-এর ব্যতিক্রম। সে তাঁকে খোঁচা মারতে গিয়েছিল। তখন সে পর্দার ওপর খোঁচা মারে। (৩৪৩১, ৪৫৪৮) (আধুনিক প্রকাশনীঃ ৩০৪৪, ইসলামিক ফাউন্ডেশনঃ ৩০৫৩)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 3287,
			"arabicnumber": 3287,
			"text": "‘আলকামাহ (রহ.) হতে বর্ণিত। তিনি বলেন, আমি সিরিয়ায় গেলাম, লোকেরা বলল, ইনি আবূ দারদা (রাঃ)। তিনি জিজ্ঞেস করলেন, ‘তোমাদের মধ্যে কি সে ব্যক্তি আছে, যাকে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর মৌখিক দু‘আয় আল্লাহ্ শয়তান হতে রক্ষা করেছেন?’ মুগীরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, সেই ব্যক্তি যাঁকে আল্লাহ তাঁর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর মৌখিক দু‘আয় শয়তান হতে রক্ষা করেছেন, তিনি হলেন, আম্মার (রাঃ)। (৩৭৪২, ৩৭৪৩, ৩৭৬১, ৪৯৪৩, ৪৯৪৪, ৬২৭৮) (আধুনিক প্রকাশনীঃ ৩০৪৫, ইসলামিক ফাউন্ডেশনঃ ৩০৫৪)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 3288,
			"arabicnumber": 3288,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, ‘ফেরেশতামন্ডলী মেঘের মাঝে এমন সব বিষয় আলোচনা করেন, যা পৃথিবীতে ঘটবে। তখন শয়তানেরা দু’ একটি কথা শুনে ফেলে এবং তা জ্যোতিষদের কানে এমনভাবে ঢেলে দেয় যেমন বোতলে পানি ঢালা হয়। তখন তারা এ সত্য কথার সঙ্গে শত রকমের মিথ্যা বাড়িয়ে বলে।’ (৩২১০) (আধুনিক প্রকাশনীঃ ৩০৪৬, ইসলামিক ফাউন্ডেশনঃ ৩০৫৫)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 3289,
			"arabicnumber": 3289,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, হাই তোলা শয়তানের পক্ষ হতে হয়ে থাকে। কাজেই তোমাদের কারো যখন হাই আসবে তখন যথাসম্ভব তা রোধ করবে। কারণ তোমাদের কেউ হাই তোলার সময় যখন ‘হা’ বলে, তখন শয়তান হাসতে থাকে। (৬২২৩, ৬২২৬) (মুসলিম ৫৩/৯ হাঃ ২৯৯৪) (আধুনিক প্রকাশনীঃ ৩০৪৭, ইসলামিক ফাউন্ডেশনঃ ৩০৫৬)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 3290,
			"arabicnumber": 3290,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, উহুদের দিন যখন মুশরিকরা পরাজিত হলো, তখন ইব্লীস চীৎকার করে বলল, হে আল্লাহর বান্দারা! তোমরা তোমাদের পেছনের লোকদের থেকে সতর্ক হও। কাজেই সামনের লোকেরা পেছনের লোকদের ওপর ঝাঁপিয়ে পড়ল। ফলে উভয় দলের মধ্যে নতুনভাবে লড়াই শুরু হল। হুযাইফাহ (রাঃ) হঠাৎ তাঁর পিতা ইয়ামানকে দেখতে পেলেন। তখন তিনি (হুযাইফাহ) বললেন, হে আল্লাহর বান্দারা! আমার পিতা! আমার পিতা! কিন্তু আল্লাহর কসম, তারা বিরত হয়নি। শেষ পর্যন্ত তারা তাঁকে হত্যা করে ফেলল। তখন হুযায়ফা (রাঃ) বললেন, আল্লাহ তোমাদের ক্ষমা করুন। ‘উরওয়াহ (রাঃ) বলেন, আল্লাহর সঙ্গে মিলিত হওয়া পর্যন্ত হুযায়ফা (রাঃ) দু‘আ ও ইস্তিগফার করতে থাকেন। (৩৮২৪, ৭০৬৫, ৬৬৬৮, ৬৮৮৩, ৬৮৯০) (আধুনিক প্রকাশনীঃ ৩০৪৮, ইসলামিক ফাউন্ডেশনঃ ৩০৫৭)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 3291,
			"arabicnumber": 3291,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে সালাতের ভিতর মানুষের এদিক-ওদিক তাকানোর বিষয়ে জিজ্ঞেস করলাম। তিনি বললেন, তা হল শয়তানের এক ধরনের ছিনতাই, যা সে তোমাদের এক জনের সালাত হতে ছিনিয়ে নেয়। (৭৫১) (আধুনিক প্রকাশনীঃ ৩০৪৯, ইসলামিক ফাউন্ডেশনঃ ৩০৫৮)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 3292,
			"arabicnumber": 3292,
			"text": "আবূ ক্বাতাদাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, সৎ ও ভাল স্বপ্ন আল্লাহর তরফ হতে হয়ে থাকে। আর মন্দ স্বপ্ন শয়তানের তরফ হতে হয়ে থাকে। কাজেই তোমাদের কেউ যখন ভয়ানক মন্দ স্বপ্ন দেখে তখন সে যেন তার বাম দিকে থুথু ফেলে আর শয়তানের ক্ষতি হতে আল্লাহর নিকট আশ্রয় চায়। তা হলে এমন স্বপ্ন তার কোন ক্ষতি করতে পারবে না। (৫৭৪৭, ৬৯৮৪, ৬৯৯৫, ৬৯৯৬, ৭০০৫, ৭০৪৪) (আধুনিক প্রকাশনীঃ ৩০৫০, ইসলামিক ফাউন্ডেশনঃ ৩০৫৯)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 3293,
			"arabicnumber": 3293,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যে লোক একশ’বার এ দু‘আটি পড়বেঃ \"লা ইলাহা ইল্লাল্লাহ ওয়াহুদাহু লা শারীকা লাহু লাহুল মুলকু ওয়া হুল হামদু, ওয়া হুয়া আলা কুল্লি শাইয়িন কাদীর। আল্লাহ ব্যতীত প্রকৃত কোন ইলাহ নেই, তিনি একক, তাঁর কোন শরীক নেই; রাজত্ব একমাত্র তাঁরই, সমস্ত প্রশংসাও একমাত্র তাঁরই জন্য, আর তিনি সকল বিষয়ের ওপর ক্ষমতাবান। তাহলে দশটি গোলাম আযাদ করার সমান সাওয়াব তার হবে। তার জন্য একশটি সাওয়াব লেখা হবে এবং আর একশটি গুনাহ মিটিয়ে ফেলা হবে। ঐদিন সন্ধ্যা পর্যন্ত সে শয়তান হতে মাহফুজ থাকবে। কোন লোক তার চেয়ে উত্তম সাওয়াবের কাজ করতে পারবে না। তবে হ্যাঁ, ঐ ব্যক্তি সক্ষম হবে, যে এর চেয়ে ঐ দু‘আটির ‘আমল বেশি পরিমাণ করবে। (৬৪০৩) (মুসলিম ৪৮/১০ হাঃ ২৬৯১, আহমাদ ৮০১৪) (আধুনিক প্রকাশনীঃ ৩০৫১, ইসলামিক ফাউন্ডেশনঃ ৩০৬০)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 3294,
			"arabicnumber": 3294,
			"text": "সা‘দ ইবনু আবূ ওয়াক্কাস (রাঃ) হতে বর্ণিত। তিনি বলেছেন, একদা ‘উমার (রাঃ) আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট আসার অনুমতি চাইলেন। তখন তাঁর সঙ্গে কয়েকজন কুরায়শ নারী কথাবার্তা বলছিল। তারা খুব উচ্চস্বরে কথা বলছিল। অতঃপর যখন ‘উমার (রাঃ) অনুমতি চাইলেন, তারা উঠে শীঘ্র পর্দার আড়ালে চলে গেলেন। অতঃপর আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে অনুমতি প্রদান করলেন। তখন তিনি মুচকি হাসছিলেন। তখন ‘উমার (রাঃ) বললেন, ‘হে আল্লাহর রাসূল! আল্লাহ আপনাকে সর্বদা সহাস্য রাখুন।’ তিনি বললেন, আমার নিকট যে সব মহিলা ছিল তাদের ব্যাপারে আমি আশ্চর্যান্বিত হয়েছি। তারা যখনই তোমার আওয়াজ শুনল তখনই দ্রুত পর্দার আড়ালে চলে গেল। ‘উমার (রাঃ) বললেন, ‘হে আল্লাহর রাসূল! আপনাকেই তাদের বেশি ভয় করা উচিত ছিল।’ অতঃপর তিনি মহিলাদের উদ্দেশ্য করে বললেন, হে আত্মশত্রু মহিলাগণ! তোমরা আমাকে ভয় করছ অথচ আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে ভয় করছ না? তারা জবাব দিল, হ্যাঁ, কারণ তুমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর চেয়ে অধিক কর্কশ ভাষী ও কঠোর হৃদয়ের লোক। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, ‘শপথ ঐ সত্তার যাঁর হাতে আমার প্রাণ, তুমি যে পথে চল শয়তান কখনও সে পথে চলে না বরং সে তোমার পথ ছেড়ে অন্য পথে চলে।’ (৩৬৮৩, ৬০৮৫) (মুসলিম ৩৩/২ হাঃ ২৩৯৬, আহমাদ ১৫৮১) (আধুনিক প্রকাশনীঃ ৩০৫২, ইসলামিক ফাউন্ডেশনঃ ৩০৬১)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 3295,
			"arabicnumber": 3295,
			"text": "আবূ হুরাইরাহ্ (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেন, ‘তোমাদের কেউ যখন ঘুম হতে উঠল এবং উযূ করল তখন তার উচিত নাক তিনবার ঝেড়ে ফেলা। কারণ, শয়তান তার নাকের ছিদ্রে রাত কাটিয়েছে।’ (মুসলিম ২/৮ হাঃ ২৩৮) (আধুনিক প্রকাশনীঃ ৩০৫৩, ইসলামিক ফাউন্ডেশনঃ ৩০৬২)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 3296,
			"arabicnumber": 3296,
			"text": "لِقَوْلِهِ يَا مَعْشَرَ الْجِنِّ وَالْإِنْسِ أَلَمْ يَأْتِكُمْ رُسُلٌ مِّنْكُمْ يَقُصُّوْنَ عَلَيْكُمْ اٰيٰتِيْ إِلَى قَوْلِهِ عَمَّا يَعْمَلُوْنَ (الأنعام : 130) بَخْسًا نَقْصًا قَالَ مُجَاهِدٌ وَجَعَلُوْا بَيْنَه” وَبَيْنَ الْجِنَّةِ نَسَبًا ( الصفات : 158) قَالَ كُفَّارُ قُرَيْشٍ الْمَلَائِكَةُ بَنَاتُ اللهِ وَأُمَّهَاتُهُنَّ بَنَاتُ سَرَوَاتِ الْجِنِّ قَالَ اللهُ وَلَقَدْ عَلِمَتِ الْجِنَّةُ إِنَّهُمْ لَمُحْضَرُوْنَ ( الصفات : 158) سَتُحْضَرُ لِلْحِسَابِ جُنْدٌ مُّحْضَرُوْنَ (يس : 75) عِنْدَ الْحِسَابِ মহান আল্লাহর বাণীঃ হে জ্বিন ও মানবজাতি! তোমাদের কাছে কি আসেনি তোমাদের মধ্য থেকে রাসূলগণ যারা তোমাদের কাছে আমার নিদর্শনসমূহ বর্ণনা করত- (সূরা আন্‘আম ১৩০)। بَخْسًا ক্ষতি। وَجَعَلُوْا بَيْنَهُ وَبَيْنَ الْجِنَّةِ نَسَبًا তারা আল্লাহ ও জ্বিনদের মাঝে সম্পর্ক স্থাপন করেছে- (আসসাফসাফফাত ১৫৮ আয়াতের তাফসীরে)। মুজাহিদ (রহ.) বলেন, কুরাইশ কাফিররা ফেরেশতামন্ডলীকে আল্লাহর কন্যা এবং তাদের মাতাদেরকে জ্বিনের নেতাদের কন্যা বলে আখ্যায়িত করত। মহান আল্লাহ বলেনঃ জ্বিনগণ অবশ্যই জানে যে, তাদেরকে হিসাবের সময় উপস্থিত করা হবে। অচিরেই তাদেরকে হিসাবের জন্য উপস্থিত করা হবে। جُنْدٌ مُحْضَرُوْنَ তারা এমন এক সম্প্রদায় যাদেরকে হিসাবের সময় উপস্থিত করা হবে- (ইয়াসীনঃ ৭৫)। ৩২৯৬. আবূ সা‘ঈদ খুদরী (রাঃ) হতে বর্ণিত। তিনি ‘আবদুল্লাহ ইবনু ‘আবদুর রহমান (রহ.)-কে বলেছেন, ‘আমি তোমাকে দেখছি তুমি বকরির পাল ও মরুভূমি পছন্দ করছ। অতএব, তুমি যখন তোমার বকরির পাল নিয়ে মরুভূমিতে অবস্থান করবে, সালাতের সময় হলে আযান দিবে, আযানে তোমার স্বর উচ্চ করবে। কেননা মুআয্যিনের কন্ঠস্বর জ্বিন, মানুষ ও যে কোন বস্তু শুনে, তারা কিয়ামতের দিন তার পক্ষে সাক্ষ্য দিবে।’ আবূ সা‘ঈদ (রাঃ) বলেন, আমি এ হাদীসটি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট হতে শুনেছি। (৬০৯) (আধুনিক প্রকাশনীঃ ৩০৫৪, ইসলামিক ফাউন্ডেশনঃ ৩০৬৩)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 3298,
			"arabicnumber": 3298,
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 3299,
			"arabicnumber": 3299,
			"text": "‘আবদুর রাযযাক (রহ.) মা‘মার (রহ.) সূত্রে বর্ণিত হাদীসে রয়েছে, আমাকে দেখেছেন আবূ লুবাবা অথবা যায়দ ইবনু খাত্তাব (রাঃ) আর অনুসরণ করেছেন মা‘মার (রহ.)-কে ইউনুস ইবনু ইয়াইনা, ইসহাক কলবী ও যুবাইদী (রহ.) এবং সালিহ, ইবনু আবূ হাফসাহ ও ইবনু মুজাম্মি‘ (রহ.).....ইবনু ‘উমার (রাঃ) হতে বর্ণিত হাদীসে রয়েছে, ‘আমাকে দেখেছেন আবূ লুবাবা ও যায়দ ইবনু খাত্তাব (রাঃ)।’ (মুসলিম ৩৭/৩৯ হাঃ ২২৩৩) (ইসলামিক ফাউন্ডেশনঃ ৩০৬৪ শেষাংশ)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 3300,
			"arabicnumber": 3300,
			"text": "আবূ সা‘ঈদ খুদরী (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, সে সময় অতি নিকটে যখন একজন মুসলিমের সবচেয়ে উত্তম সম্পদ হবে ছাগ-পাল। তা নিয়ে সে পাহাড়ের চূড়ায় এবং বৃষ্টির এলাকায় চলে যাবে; সে ফিতনা হতে নিজের দ্বীনকে রক্ষার জন্য পলায়ন করবে। (১৯) (আধুনিক প্রকাশনীঃ ৩০৫৬, ইসলামিক ফাউন্ডেশনঃ ৩০৬৫)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 3301,
			"arabicnumber": 3301,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, ‘কুফরীর মূল পূর্বদিকে, গর্ব এবং অহংকার ঘোড়া এবং উটের মালিকদের মধ্যে এবং বেদুইনদের মধ্যে যারা তাদের উটের পাল নিয়ে ব্যস্ত থাকে, আর শান্তি বকরির পালের মালিকদের মধ্যে।’ (৩৪৯৯, ৪৩৮৮, ৪৩৮৯, ৪৩৯০) (মুসলিম ১/২১ হাঃ ৫২, আহমাদ ৯৪১৪) (আধুনিক প্রকাশনীঃ ৩০৫৭, ইসলামিক ফাউন্ডেশনঃ ৩০৬৬)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 3302,
			"arabicnumber": 3302,
			"text": "‘উকবাহ ইবনু আমর আবূ মাস‘ঊদ (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিজ হাতের দ্বারা ইয়ামানের দিকে ইশারা করে বললেন, ঈমান এদিকে। দেখ কঠোরতা এবং অন্তরের কাঠিন্য ঐ সব বেদুইনদের মধ্যে যারা তাদের উট নিয়ে ব্যস্ত থাকে যেখান থেকে শয়তানের শিং দু’টি উদয় হয় অর্থাৎ রাবীয়াহ ও মুযার গোত্রদ্বয়ের মধ্যে। (৩৪৯৮, ৪৩৮৭, ৫৩০৩) (মুসলিম ১/২১ হাঃ ৫১, আহমাদ ১৭০৬৫) (আধুনিক প্রকাশনীঃ ৩০৫৮, ইসলামিক ফাউন্ডেশনঃ ৩০৬৭)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 3303,
			"arabicnumber": 3303,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, ‘যখন তোমরা মোরগের ডাক শুনবে তখন তোমরা আল্লাহর নিকট তাঁর অনুগ্রহ প্রার্থনা করে দু‘আ কর। কেননা এ মোরগ ফিরিশতাদের দেখে আর যখন গাধার আওয়াজ শুনবে তখন শয়তান হতে আল্লাহর নিকট আশ্রয় চাইবে, কেননা এ গাধাটি শয়তান দেখেছে।’ (মুসলিম ৪৮/২০ হাঃ ২৭২৯, আহমাদ ৯৪১৪) (আধুনিক প্রকাশনীঃ ৩০৫৯, ইসলামিক ফাউন্ডেশনঃ ৩০৬৮)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 3304,
			"arabicnumber": 3304,
			"text": "জাবির ইবনু ‘আবদুল্লাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, ‘যখন রাতের আঁধার নেমে আসবে অথবা বলেছেন, যখন সন্ধ্যা হয়ে যাবে তখন তোমরা তোমাদের শিশুদেরকে আটকিয়ে রাখবে। কেননা এ সময় শয়তানেরা ছড়িয়ে পড়ে। আর যখন রাতের কিছু অংশ অতিক্রান্ত হবে তখন তাদেরকে ছেড়ে দিতে পার। তোমরা ঘরের দরজা বন্ধ করবে এবং আল্লাহর নাম স্মরণ করবে। কেননা শয়তান বন্ধ দরজা খুলতে পারে না। ইবনু জুরাইজ (রহ.) বলেন, হাদীসটি ‘আমর ইবনু দ্বীনার (রহ.)...... জাবির ইবনু ‘আবদুল্লাহ্ হতে ‘আত্বা (রহ.)-এর মতই বর্ণনা করেছেন। তবে তিনি وَاذْكُرُوْا اسْمَ اللهِ বলেননি। (৩২৮০) (আধুনিক প্রকাশনীঃ ৩০৬০, ইসলামিক ফাউন্ডেশনঃ ৩০৬৯)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 3305,
			"arabicnumber": 3305,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, বনী ইসরাঈলের একদল লোক নিখোঁজ হয়েছিল। কেউ জানে না তাদের কী হলো আর আমি তাদেরকে ইঁদুর বলেই মনে করি। কেননা তাদের সামনে যখন উটের দুধ রাখা হয়, তারা তা পান করে না, আর যখন তাদের সামনে ছাগী দুগ্ধ রাখা হয় তখন তারা তা পান করে। [আবূ হুরাইরাহ্ (রাঃ) বলেন] আমি এ হাদীসটি কা‘বের নিকট বললাম, তিনি আমাকে জিজ্ঞেস করলেন আপনি কি এটা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছেন? আমি বললাম, হ্যাঁ। অতঃপর তিনি কয়েকবার আমাকে এ কথাটি জিজ্ঞেস করলেন। তখন আমি বললাম, আমি কি তাওরাত কিতাব পড়েছি?(মুসলিম ৫৩/১১ হাঃ ২৯৯৭, আহমাদ ৭২০১) (আধুনিক প্রকাশনীঃ ৩০৬১, ইসলামিক ফাউন্ডেশনঃ ৩০৭০)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 3306,
			"arabicnumber": 3306,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম গিরগিটি বা রক্তচোষা টিকটিকিকে নিকৃষ্টতম ফাসিক বলে আখ্যায়িত করেছেন। আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে একে হত্যা করার আদেশ দিতে শুনিনি। আর সা‘দ ইবনু আবূ ওয়াক্কাস (রাঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একে হত্যা করার আদেশ দিয়েছেন। (১৮৩১) (আধুনিক প্রকাশনীঃ ৩০৬২, ইসলামিক ফাউন্ডেশনঃ ৩০৭১)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 3307,
			"arabicnumber": 3307,
			"text": "সা‘ঈদ ইবনু মুসাইয়্যাব (রহ.) হতে বর্ণিত যে, উম্মু শারীক (রহ.) তাঁকে খবর দিয়েছেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে গিরগিটি বা রক্তচোষা জাতীয় টিকটিকি হত্যা করার নির্দেশ দিয়েছেন। (৩৩৫৯) (মুসলিম ৩৯/৩৮ হাঃ ২২৩৭) (আধুনিক প্রকাশনীঃ ৩০৬৩, ইসলামিক ফাউন্ডেশনঃ ৩০৭২)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 3308,
			"arabicnumber": 3308,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, ‘পিঠে দু’টি সাদা রেখাওয়ালা সাপকে হত্যা কর। কেননা এ জাতীয় সাপ দৃষ্টিশক্তি বিনষ্ট করে আর গর্ভপাত ঘটায়।’ (৩৩০৯) (আধুনিক প্রকাশনীঃ ৩০৬৪, ইসলামিক ফাউন্ডেশনঃ ৩০৭৩)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 3309,
			"arabicnumber": 3309,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম লেজকাটা সাপকে হত্যা করার নির্দেশ দিয়েছেন, আর বলেছেন, এ ধরনের সাপ দৃষ্টিশক্তি বিনষ্ট করে এবং গর্ভপাত ঘটায়। (৩৩০৮) (আধুনিক প্রকাশনীঃ ৩০৬৫, ইসলামিক ফাউন্ডেশনঃ ৩০৭৪)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 3311,
			"arabicnumber": 3311,
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 3313,
			"arabicnumber": 3313,
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 3314,
			"arabicnumber": 3314,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, পাঁচ প্রকার প্রাণী অধিক ক্ষতিকারক। এদেরকে হারামেও (সীমানার মধ্যে) হত্যা করা যায়। এগুলো হল বিচ্ছু, ইঁদুর, চিল, কাক ও পাগলা কুকুর। (১৮২৯) (আধুনিক প্রকাশনীঃ ৩০৬৮, ইসলামিক ফাউন্ডেশনঃ ৩০৭৭)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 3315,
			"arabicnumber": 3315,
			"text": "‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, পাঁচ প্রকারের ক্ষতিকারক প্রাণী যাদেরকে কেউ ইহরাম অবস্থায়ও যদি মেরে ফেলে, তাহলে তার কোন গুনাহ নেই। এগুলো হল বিচ্ছু, ইঁদুর, পাগলা কুকুর, কাক এবং চিল। (১৮২৬) (আধুনিক প্রকাশনীঃ ৩০৬৯, ইসলামিক ফাউন্ডেশনঃ ৩০৭৮)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 3316,
			"arabicnumber": 3316,
			"text": "জাবির (রাঃ) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, ‘তোমরা পাত্রগুলো ঢেকে রেখো, পান করার পাত্রগুলো বন্ধ করে রেখো, ঘরের দরজাগুলো বন্ধ করে রেখো আর সাঁঝের বেলায় তোমাদের বাচ্চাদেরকে ঘরে আটকে রেখো। কারণ এ সময় জ্বিনেরা ছড়িয়ে পড়ে এবং কোন কিছুকে দ্রুত পাকড়াও করে। আর নিদ্রাকালে বাতিগুলো নিভিয়ে দেবে। কেননা অনেক সময় ছোট ছোট ক্ষতিকারক ইঁদুর প্রজ্জ্বলিত সলতেযুক্ত বাতি টেনে নিয়ে যায় এবং গৃহবাসীকে জ্বালিয়ে পুড়িয়ে দেয়।’ ইবনু জুরাইজ এবং হাবীব (রহ.) ‘আত্বা (রহ.) হতে ‘‘কেননা এ সময় জ্বিনেরা ছড়িয়ে পড়ে’’ এর স্থলে ‘‘শয়তানেরা ছড়িয়ে পড়ে’’ বর্ণনা করেছেন। (৩২৮০) (আধুনিক প্রকাশনীঃ ৩০৭০, ইসলামিক ফাউন্ডেশনঃ ৩০৭৯)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 3317,
			"arabicnumber": 3317,
			"text": "‘আবদুল্লাহ্ ইবনু মাস‘ঊদ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমরা আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে এক গুহায় ছিলাম। তখন ওয়াল ‘‘মুরসালাতি গারকা’’ সূরাটি অবতীর্ণ হয়। আমরা আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর মুখ হতে সূরাটি শিখে নিচ্ছিলাম। এমন সময় একটা সাপ বেরিয়ে এল তার গর্ত হতে। আমরা তাকে মারার জন্য দৌঁড়ে যাই। কিন্তু সে আমাদের আগেই গিয়ে গর্তে ঢুকে পড়ে। তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, সে তোমাদের অনিষ্ট হতে যেমন রক্ষা পেয়েছে, তোমরাও তেমন তার অনিষ্ট হতে বেঁচে গেছ। ইসরাঈল (রহ.) আ‘মাশ, ইব্রাহীম, ‘আলকামাহ (রহ.)-ও ‘আবদুল্লাহ (রাঃ) হতে এ রকমই বর্ণনা করেছেন। রাবী ‘আবদুল্লাহ (রাঃ) বলেছেন, আমরা সূরাটি তাঁর মুখ হতে বের হবার সঙ্গে সঙ্গে শিখে নিচ্ছিলাম। আবূ আওয়ানাহ মুগীরাহ (রাঃ) হতে এভাবেই বর্ণনা করেছেন। আর হাফস, আবূ মু‘আবিয়াহ ও সুলাইমান ইবনু কারম, আ‘মাশ, ইব্রাহীম, আসওয়াদ (রহ.)-ও ‘আবদুল্লাহ (রাঃ) হতে অনুরূপই বর্ণনা করেছেন। (১৮৩০) (আধুনিক প্রকাশনীঃ ৩০৭১, ইসলামিক ফাউন্ডেশনঃ ৩০৮০)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 3318,
			"arabicnumber": 3318,
			"text": "ইবনু ‘উমার (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেন, এক নারী একটি বিড়ালের কারণে জাহান্নামে গিয়েছিল, সে তাকে বেঁধে রেখেছিল। সে তাকে খাবারও দেয়নি, ছেড়েও দেয়নি, যাতে সে যমীনের পোকা মাকড় খেতে পারত। আবূ হুরাইরাহ্ (রাঃ) সূত্রেও নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে অনুরূপ হাদীস বর্ণিত আছে। (২৩৬৫) (আধুনিক প্রকাশনীঃ ৩০৭২, ইসলামিক ফাউন্ডেশনঃ ৩০৮১)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 3319,
			"arabicnumber": 3319,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, নবীগণের মধ্যে কোন এক নবী একটি গাছের নীচে অবতরণ করেন। অতঃপর তাঁকে একটি পিঁপড়ায় কামড় দেয়। তিনি তাঁর আসবাবপত্রের ব্যাপারে আদেশ দেন। এগুলো গাছের নীচ থেকে সরিয়ে ফেলা হয়। অতঃপর তিনি নির্দেশ দিলে পিঁপড়ার বাসা আগুন দিতে জ্বালিয়ে দেয়া হল। তখন আল্লাহ তাঁর প্রতি ওয়াহী নাযিল করলেন, ‘তুমি একটি মাত্র পিঁপড়াকে শাস্তি দিলে না কেন?’ (৩০১৯) (আধুনিক প্রকাশনীঃ ৩০৭৩, ইসলামিক ফাউন্ডেশনঃ ৩০৮২)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 3320,
			"arabicnumber": 3320,
			"text": "‘উবাইদ ইবনু হুনায়ন হতে বর্ণিত। তিনি বলেন, আমি আবূ হুরাইরাহ্ (রাঃ)-কে বলতে শুনেছি, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, ‘তোমাদের কারো পানীয় দ্রব্যে মাছি পড়লে সেটাকে তাতে ডুবিয়ে দেবে। অতঃপর তাকে উঠিয়ে ফেলবে। কেননা তার এক ডানায় রোগ থাকে আর অপর ডানায় থাকে রোগের প্রতিষেধক।’ (৫৭৮২) (আধুনিক প্রকাশনীঃ ৩০৭৪, ইসলামিক ফাউন্ডেশনঃ ৩০৮৩)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 3321,
			"arabicnumber": 3321,
			"text": "আবূ হুরাইরাহ্ (রাঃ) সূত্রে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেন, ‘এক ব্যভিচারিণীকে ক্ষমা করে দেয়া হয়। সে একটি কুকুরের কাছ দিয়ে যাচ্ছিল। তখন সে দেখতে পেল কুকুরটি একটি কূপের পাশে বসে হাঁপাচ্ছে। রাবী বলেন, পানির পিপাসা তাকে মুমূর্ষু করে দিয়েছিল। তখন সেই নারী তার মোজা খুলে তার উড়নার সঙ্গে বাঁধল। অতঃপর সে কূপ হতে পানি তুলল (এবং কুকুরটিকে পানি পান করালো) এ কারণে তাকে ক্ষমা করে দেয়া হল।’ (৩৪৬৭) (আধুনিক প্রকাশনীঃ ৩০৭৫, ইসলামিক ফাউন্ডেশনঃ ৩০৮৪)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 3322,
			"arabicnumber": 3322,
			"text": "আবূ ত্বলহা (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেন, ‘যে বাড়িতে কুকুর এবং প্রাণীর ছবি থাকে তাতে ফেরেশতামন্ডলী প্রবেশ করেন না।’ (২৩২৫) (আধুনিক প্রকাশনীঃ ৩০৭৬, ইসলামিক ফাউন্ডেশনঃ ৩০৮৫)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 3323,
			"arabicnumber": 3323,
			"text": "‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) হতে বর্ণিত। ‘রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কুকুর মেরে ফেলতে আদেশ করেছেন।’ (মুসলিম ২২/১০ হাঃ ১৫৭০, আহমাদ ৫৯৩২) (আধুনিক প্রকাশনীঃ ৩০৭৭, ইসলামিক ফাউন্ডেশনঃ ৩০৮৬)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 3324,
			"arabicnumber": 3324,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, ‘যে ব্যক্তি কুকুর প্রতিপালন করবে, প্রত্যেক দিন তার ‘আমলনামা হতে এক ক্বীরাত করে সাওয়াব কমতে থাকবে। তবে ক্ষেত খামার কিংবা পশুপাল পাহারা দেয়ার কাছে নিযুক্ত শিকারী কুকুর ছাড়া।’ (২৩২২) (আধুনিক প্রকাশনীঃ ৩০৭৮, ইসলামিক ফাউন্ডেশনঃ ৩০৮৭)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 3325,
			"arabicnumber": 3325,
			"text": "সায়িব ইবনু ইয়াযীদ সুফইয়ান ইবনু আবূ যুহাইর শানাভির (রাঃ)-এর নিকট হতে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছেন, যে ব্যক্তি কুকুর লালন পালন করে, যদ্দ্বারা না কৃষির উপকার হয়, না পশুপালনের, তার ‘আমল হতে প্রত্যহ এক কিরাত ‘আমল কমে যায়। সায়িব জিজ্ঞেস করেন, আপনি নিজেই কি তা আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে শুনেছেন? তিনি বললেন, এই কিবলার (কা‘বার) প্রতিপালকের শপথ!, অবশ্যই। (২৩২৩) (আধুনিক প্রকাশনীঃ ৩০৭৯, ইসলামিক ফাউন্ডেশনঃ নাই)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 131
			}
		}
	]
}