{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"60": "Prophets"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3326,
			"arabicnumber": 3326,
			"text": "بَابُ خَلْقِ آدَمَ صَلَوَاتُ اللهِ عَلَيْهِ وَذُرِّيَّتِهِ ৬০/১. অধ্যায় : আদম (আঃ) ও তাঁর সন্তানাদির সৃষ্টি। صَلْصٰلٍ طِيْنٌ خُلِطَ بِرَمْلٍ فَصَلْصَلَ كَمَا يُصَلْصِلُ الْفَخَّارُ وَيُقَالُ مُنْتِنٌ يُرِيْدُوْنَ بِهِ صَلَّ كَمَا يُقَالُ صَرَّ الْبَابُ وَصَرْصَرَ عِنْدَ الإِغْلَاقِ مِثْلُ كَبْكَبْتُهُ يَعْنِيْ كَبَبْتُهُ فَمَرَّتْ بِهِ اسْتَمَرَّ بِهَا الْحَمْلُ فَأَتَمَّتُ أَنْ لَّا تَسْجُدَ أَنْ تَسْجُدَ صَلْصَالٍ বালি মিশ্রিত শুকনো মাটি যা শব্দ করে যেমন আগুনে পোড়া মাটি শব্দ করে। আরো বলা হয় তা হল দুর্গন্ধময় মাটি। আরবরা এ দিয়ে صَلْ অর্থ নিয়ে থাকে, যেমন তারা দরজা বন্ধ করার শব্দের ক্ষেত্রে صَرَّ الْبَابُ এবং صَرْصَرَ শব্দদ্বয় ব্যবহার করে থাকে। অনুরূপ كَبْكَبْتُهُ এর অর্থ كَبَبْتُهُ নিয়ে থাকে। فَمَرَّتْ بِهِ তার গর্ভ স্থিতি লাভ করল এবং এর মেয়াদ পূর্ণ করল। أَنْ لَا تَسْجُدَ এর لَا শব্দটি অতিরিক্ত। أَنْ تَسْجُدَ অর্থ সিজদা করতে। وَإِذْ قَالَ رَبُّكَ لِلْمَلَآئِكَةِ إِنِّيْ جَاعِلٌ فِي الْأَرْضِ خَلِيْفَةً (البقرة : 30) স্মরণ করুন, যখন আপনার প্রতিপালক ফেরেশতামন্ডলীকে বললেন, আমি পৃথিবীতে খলীফা সৃষ্টি করছি- (আল-বাকারাহ ৩০)। قَالَ ابْنُ عَبَّاسٍ لَمَّا عَلَيْهَا حَافِظٌ (الطارق : 4) إِلَّا عَلَيْهَا حَافِظٌ فِيْ كَبَدٍ (البلد : 4) فِيْ شِدَّةِ خَلْقٍ وَرِيَاشًا (الأعراف : 26) الْمَالُ وَقَالَ غَيْرُهُ الرِّيَاشُ وَالرِّيْشُ وَاحِدٌ وَهُوَ مَا ظَهَرَ مِنْ اللِّبَاسِ مَا تُمْنُوْنَ (الواقعة : 58) النُّطْفَةُ فِيْ أَرْحَامِ النِّسَاءِ ইবনু ‘আব্বাস (রা.) বলেন, لَمَّا عَلَيْهَا حَافِظٌ এর অর্থ কিন্তু তার ওপর রয়েছে তত্ত্বাবধায়ক। فِيْ كَبَدٍ সৃষ্টিগত ক্লেশের মধ্যে وَرِيَاشًا এর অর্থ সম্পদ। ইবনু ‘আব্বাস (রা.) ব্যতীত অন্যরা বলেন, الرِّيَاشُ এবং الرِّيشُ উভয়ের একই অর্থ। আর তা হল পরিচ্ছদের বাহ্যিক দিক। مَا تُمْنُوْنَ স্ত্রীলোকদের জরায়ুতে পতিত বীর্য। وَقَالَ مُجَاهِدٌ إِنَّه” عَلٰى رَجْعِهِ لَقٰدِرٌ (الطارق : 4) النُّطْفَةُ فِي الْإِحْلِيْلِ كُلُّ شَيْءٍ خَلَقَهُ فَهُوَ شَفْعٌ السَّمَاءُ شَفْعٌ وَالْوَتْرُ اللهُ عَزَّ وَجَلَّ فِيْٓ أَحْسَنِ تَقْوِيْمٍ (التين : 4) فِيْ أَحْسَنِ خَلْقٍ أَسْفَلَ سَافِلِيْنَ (التين : 5) إِلَّا مَنْ آمَنَ خُسْرٍ (العصر : 2) ضَلَالٍ ثُمَّ اسْتَثْنَى إِلَّا مَنْ آمَنَ لَازِبٍ (الصفات : ) لَازِمٌ وَنُنْشِئُكُمْ (الواقعة : 61) فِيْ أَيِّ خَلْقٍ نَشَاءُ نُسَبِّحُ بِحَمْدِكَ (البقرة : 30) نُعَظِّمُكَ আর মুজাহিদ (র.) (আল্লাহর বাণী) إِنَّهُ عَلَى رَجْعِهِ لَقَادِرٌ এর অর্থ বলেছেন, পুরুষের লিঙ্গে পুনরায় ফিরিয়ে আনতে আল্লাহ সক্ষম। আল্লাহ সকল বস্তুকে জোড়া জোড়া সৃষ্টি করেছেন। আকাশেরও জোড়া আছে, কিন্তু আল্লাহ বেজোড়। فِيْ أَحْسَنِ تَقْوِيْمٍ উত্তম অবয়ববে। যারা ঈমান এনেছে তারা ব্যতীত সকলেই হীনতাগ্রস্তদের হীনতমে। خُسْرٍ পথভ্রষ্ট। অতঃপর اسْتَثْنَى করে আল্লাহ বলেন, কিন্তু যারা ঈমান এনেছে, তারা ব্যতীত। لَازِبٍ অর্থ আঠালো। نُنْشِئُكُمْ অর্থ যে কোন আকৃতিতে আমি ইচ্ছা করি তোমাদেরকে সৃষ্টি করব। نُسَبِّحُ بِحَمْدِكَ অর্থ আমরা প্রশংসার সঙ্গে আপনার মহিমা বর্ণনা করব। وَقَالَ أَبُوْ الْعَالِيَةِ فَتَلَقّٰىٓ اٰدَمُ مِنْ رَبِّهٰ كَلِمٰتٍ (البقرة : 37) فَهُوَ قَوْلُهُ رَبَّنَا ظَلَمْنَآ أَنْفُسَنَا (الأعراف : 23) فَأَزَلَّهُمَا (البقرة : 36) فَاسْتَزَلَّهُمَا يَتَسَنَّهْ (البقرة : 259) يَتَغَيَّرْ اٰسِنٌ (الأعراف : 23) مُتَغَيِّرٌ وَالْمَسْنُوْنُ الْمُتَغَيِّرُ حَمَإٍ (الحجرات : 26) جَمْعُ حَمْأَةٍ وَهُوَ الطِّينُ الْمُتَغَيِّرُ يَخْصِفَانِ أَخْذُ الْخِصَافِ مِنْ وَرَقِ الْجَنَّةِ يُؤَلِّفَانِ الْوَرَقَ وَيَخْصِفَانِ بَعْضَهُ إِلَى بَعْضٍ سَوْاٰتُهُمَا كِنَايَةٌ عَنْ فَرْجَيْهِمَا وَمَتَاعٌ إِلٰى حِيْنٍ (الأعراف :24) هَا هُنَا إِلَى يَوْمِ الْقِيَامَةِ الْحِيْنُ عِنْدَ الْعَرَبِ مِنْ سَاعَةٍ إِلَى مَا لَا يُحْصَى عَدَدُهُ وَقَبِيْلُهُ (الأعراف : 27) جِيْلُهُ الَّذِيْ هُوَ مِنْهُمْ আর আবুল ‘আলিয়াহ (রহ.) বলেন, অতঃপর আদম (আঃ) যা শিক্ষা করলেন, তা হলো তাঁর উক্তি; ‘‘হে আমাদের রব! আমরা আমাদের নফসের উপর যুলুম করেছি’’। তিনি আরো বলেন, فَأَزَلَّهُمَا শয়তান তাদের উভয়কে পদস্খলিত করল। يَتَسَنَّهْ পরিবর্তিত হবে। آسِنٌ পরিবর্তনশীল। الْمَسْنُوْنُ যা পরিবর্তিত। حَمَاءٌ শব্দটি حَمْأَةٌ শব্দের বহুবচন। যার অর্থ গলিত কাদা মাটি। يَخْصِفَانِ তারা উভয়ে (আদম ও হাওয়া) জান্নাতের পাতাগুলো জোড়া দিতে লাগলেন। (জোড়া দিয়ে নিজেদের লজ্জাস্থান আবৃত করতে শুরু করলেন।) سَوْآتُهُمَا দ্বারা তাদের উভয়ের লজ্জাস্থানের প্রতি ইশারা করা হয়েছে। আর مَتَاعٌ إِلَى حِيْنٍ এর অর্থ এখানে কিয়ামতের দিন অবধি। আর আরববাসীগণ الْحِيْنُ শব্দ দ্বারা কিছু সময় হতে অগণিত সময়কে বুঝিয়ে থাকেন। قَبِيْلُهُ এর অর্থ তার ঐ প্রজন্ম ও সমাজ যার একজন সে। ৩৩২৬. আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, আল্লাহ তা‘আলা আদম (আঃ)-কে সৃষ্টি করলেন। তাঁর দেহের দৈর্ঘ্য ছিল ষাট হাত। অতঃপর তিনি (আল্লাহ) তাঁকে (আদমকে) বললেন, যাও। ঐ ফেরেশতা দলের প্রতি সালাম কর এবং তাঁরা তোমার সালামের জওয়াব কিভাবে দেয় তা মনোযোগ দিয়ে শোন। কারণ সেটাই হবে তোমার এবং তোমার সন্তানদের সালামের রীতি। অতঃপর আদম (আঃ) (ফেরেশতাদের) বললেন, ‘‘আস্সালামু ‘আলাইকুম’’। ফেরেশতামন্ডলী তার উত্তরে ‘‘আস-সালামু ‘আলাইকা ওয়া রহমাতুল্লাহ’’ বললেন। ফেরেশতারা সালামের জওয়াবে ‘‘ওয়া রহমাতুল্লাহ’’ শব্দটি বাড়িয়ে বললেন। যারা জান্নাতে প্রবেশ করবেন তারা আদম (আঃ)-এর আকৃতি বিশিষ্ট হবেন। তবে আদম সন্তানের দেহের দৈর্ঘ্য সর্বদা কমতে কমতে বর্তমান পরিমাপে এসেছে। (৬২২৭, মুসলিম ৫১/১১ হাঃ ২৮৪১, আহমাদ ৮১৭৭) (আধুনিক প্রকাশনীঃ ৩০৮০, ইসলামিক ফাউন্ডেশনঃ ৩০৮৮)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3327,
			"arabicnumber": 3327,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, সর্বপ্রথম যে দল জান্নাতে প্রবেশ করবে তাদের মুখমন্ডল হবে পূর্ণিমার রাতের চন্দ্রের মত উজ্জ্বল। অতঃপর যে দল তাদের অনুগামী হবে তাদের মুখমন্ডল হবে আকাশের সর্বাধিক দীপ্তিমান উজ্জ্বল তারকার ন্যায়। তারা পেশাব করবে না, পায়খানা করবে না। তাদের থুথু ফেলার প্রয়োজন হবে না এবং তাদের নাক হতে শ্লেষ্মাও বের হবে না। তাদের চিরুণী হবে স্বর্ণের তৈরী। তাদের ঘাম হবে মিস্কের মত সুগন্ধযুক্ত। তাদের ধনুচি হবে সুগন্ধযুক্ত চন্দন কাষ্ঠের। বড় চক্ষু বিশিষ্টা হুরগণ হবেন তাদের স্ত্রী। তাদের সকলের দেহের গঠন হবে একই। তারা সবাই তাদের আদি পিতা আদম (আঃ)-এর আকৃতিতে হবেন। উচ্চতায় তাদের দেহের দৈর্ঘ্য হবে ষাট হাত। (৩২৪৫) (আধুনিক প্রকাশনীঃ ৩০৮১, ইসলামিক ফাউন্ডেশনঃ ৩০৮৯)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3328,
			"arabicnumber": 3328,
			"text": "উম্মু সালামাহ (রাঃ) হতে বর্ণিত যে, উম্মু সুলাইম (রাঃ) বললেন, হে আল্লাহর রাসূল! আল্লাহ সত্য প্রকাশ করতে লজ্জাবোধ করেন না। মেয়েদের স্বপ্নদোষ হলে কি তাদের উপর গোসল ফরজ হবে? তিনি বললেন, হ্যাঁ। যখন সে বীর্য দেখতে পায়। এ কথা শুনে উম্মু সালামাহ (রাঃ) হাসলেন এবং বললেন, মেয়েদের কি স্বপ্নদোষ হয়? তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তা না হলে সন্তান তার মত কিভাবে হয়। (১৩০) (আধুনিক প্রকাশনীঃ ৩০৮২, ইসলামিক ফাউন্ডেশনঃ ৩০৯০)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3329,
			"arabicnumber": 3329,
			"text": "আনাস (রাঃ) হতে বর্ণিত। তিনি বলেন, ‘আবদুল্লাহ ইবনু সালামের নিকট রাসূলুল্লাহ (সঃ)-এর মদিনায় আগমনের খবর পৌঁছল, তখন তিনি তাঁর নিকট আসলেন। অতঃপর তিনি বললেন, আমি আপনাকে এমন তিনটি বিষয়ে জিজ্ঞেস করতে চাই যার উত্তর নবী ব্যতীত আর কেউ জানে না। তিনি জিজ্ঞেস করলেন, কিয়ামতের প্রথম নিদর্শন কী? আর সর্বপ্রথম খাবার কী, যা জান্নাতবাসী খাবে? আর কী কারণে সন্তান তার পিতার মত হয়? আর কী কারণে (কোন কোন সময়) তার মামাদের মত হয়? তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, এই মাত্র জিবরাঈল (আঃ) আমাকে এ বিষয়ে অবহিত করেছেন। রাবী বলেন, তখন ‘আবদুল্লাহ (রাঃ) বললেন, সে তো ফেরেশতাগণের মধ্যে ইয়াহূদীদের শত্রু। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, কিয়ামতের প্রথম নিদর্শন হলো আগুন যা মানুষকে পূর্ব হতে পশ্চিম দিকে তাড়িয়ে নিয়ে একত্রিত করবে। আর প্রথম খাবার যা জান্নাতবাসীরা খাবেন তা হলো মাছের কলিজার অতিরিক্ত অংশ। আর সন্তান সদৃশ হবার ব্যাপার এই যে পুরুষ যখন তার স্ত্রীর সঙ্গে যৌন সঙ্গম করে তখন যদি পুরুষের বীর্য প্রথমে স্খলিত হয় তবে সন্তান তার সদৃশ হবে আর যখন স্ত্রীর বীর্য পুরুষের বীর্যের পূর্বে স্খলিত হয় তখন সন্তান তার সদৃশ হয়। তিনি বললেন, আমি সাক্ষ্য দিচ্ছি- নিঃসন্দেহে আপনি আল্লাহর রাসূল। অতঃপর তিনি বললেন, হে আল্লাহর রাসূল! ইয়াহূদীরা অপবাদ ও কুৎসা রটনাকারী সম্প্রদায়। আপনি তাদেরকে আমার সম্বন্ধে জিজ্ঞেস করার পূর্বে তারা যদি আমার ইসলাম গ্রহণের বিষয় জেনে ফেলে, তাহলে তারা আপনার কছে আমার কুৎসা রটনা করবে। অতঃপর ইয়াহূদীরা এলো এবং ‘আবদুল্লাহ (রাঃ) ঘরে প্রবেশ করলেন। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের জিজ্ঞেস করলেন, তোমাদের মধ্যে ‘আবদুল্লাহ ইবনু সালাম কেমন লোক? তারা বলল, তিনি আমাদের মধ্যে সবচেয়ে বিজ্ঞ ব্যক্তি এবং সবচেয়ে বিজ্ঞ ব্যক্তির পুত্র। তিনি আমাদের মধ্যে সর্বোত্তম ব্যক্তি এবং সর্বোত্তম ব্যক্তির পুত্র। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, যদি ‘আবদুল্লাহ ইসলাম গ্রহণ করে, এতে তোমাদের অভিমত কী হবে? তারা বলল, এর থেকে আল্লাহ তাঁকে রক্ষা করুক। এমন সময় ‘আবদুল্লাহ (রাঃ) তাদের সামনে বের হয়ে আসলেন এবং তিনি বললেন, আমি সাক্ষ্য দিচ্ছি যে, আল্লাহ ব্যতীত প্রকৃত কোন ইলাহ নেই এবং আমি আরো সাক্ষ্য দিচ্ছি যে, মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আল্লাহর রাসূল। তখন তারা বলতে লাগল, সে আমাদের মধ্যে সবচেয়ে খারাপ লোক এবং সবচেয়ে খারাপ লোকের সন্তান এবং তারা তাঁর গীবত ও কুৎসা রটনায় লেগে গেল। (৩৯১১, ৩৯৩৮, ৪৪৮০) (আধুনিক প্রকাশনীঃ ৩০৮৩, ইসলামিক ফাউন্ডেশনঃ ৩০৯১)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3330,
			"arabicnumber": 3330,
			"text": "আবূ হুরাইরাহ (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে একইভাবে বর্ণিত আছে। অর্থাৎ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, বনী ইসরাঈল যদি না হত তবে গোশত দুর্গন্ধময় হতো না। আর যদি হাওয়া (আঃ) না হতেন তাহলে কোন নারীই স্বামীর খিয়ানত করত না।* (৫১৮৪, ৫১৮৬) (মুসলিম ১৭/১৯ হাঃ ১৪৭০, আহমাদ ৮০৩৮) (আধুনিক প্রকাশনীঃ ৩০৮৪, ইসলামিক ফাউন্ডেশনঃ ৩০৯২)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 3331,
			"arabicnumber": 3331,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমরা নারীদেরকে উত্তম নাসীহাত প্রদান করবে। কেননা নারী জাতিকে পাঁজরের হাড় থেকে সৃষ্টি করা হয়েছে। আর পাঁজরের হাড়গুলোর মধ্যে উপরের হাড়টি বেশী বাঁকা। তুমি যদি তা সোজা করতে যাও, তাহলে তা ভেঙ্গে যাবে আর যদি ছেড়ে দাও, তাহলে সব সময় তা বাঁকাই থাকবে। কাজেই নারীদেরকে নাসীহাত করতে থাক। (৫১৮৪, ৫১৮৬) (আধুনিক প্রকাশনীঃ ৩০৮৫, ইসলামিক ফাউন্ডেশনঃ ৩০৯৩)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3332,
			"arabicnumber": 3332,
			"text": "‘আবদুল্লাহ (রাঃ) হতে বর্ণিত। সত্যবাদী-সত্যনিষ্ঠ হিসাবে স্বীকৃত রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমাদের প্রত্যেকের সৃষ্টির উপাদান স্বীয় মাতৃগর্ভে চল্লিশ দিন পর্যন্ত জমা রাখা হয়। অতঃপর অনুরূপভাবে (চল্লিশ দিনে) তা আলাকারূপে পরিণত হয়। অতঃপর অনুরূপভাবে (চল্লিশ দিনে) তা গোশ্তের টুকরার রূপ লাভ করে। অতঃপর আল্লাহ তার নিকট চারটি বিষয়ের নির্দেশ দিয়ে লিখে দেন। অুঃপর তার ‘ধামল, তার মৃত্যু, তার রুজী এবং সে সৎ কিংবা অসৎ তা লিখা হয়। অতঃপর তার মধ্যে রূহ ফুঁকে দেয়া হয়। এক ব্যক্তি একজন জাহান্নামীর ‘আমলের মত ‘আমল করতে থাকে এমনকি তার ও জাহান্নামের মধ্যে এক হাতের তফাৎ রয়ে যায়, এমন সময় তার ভাগ্যের লিখন এগিয়ে আসে। তখন সে জান্নাতবাসীদের ‘আমলের মত ‘আমল করে থাকে। ফলে সে জান্নাতে প্রবেশ করে। আর এক ব্যক্তি (প্রথম হতেই) জান্নাতবাসীদের ‘আমলের মত ‘আমল করতে থাকে। এমনকি শেষ পর্যন্ত তার ও জান্নাতের মাঝে মাত্র এক হাতের ব্যবধান রয়ে যায়। এমন সময় তার ভাগ্য লিখন অগ্রগামী হয়।। তখন সে জাহান্নামবাসীদের ‘আমলের অনুরূপ ‘আমল করে থাকে এবং ফলে সে জাহান্নামে প্রবিষ্ট হয়। (৩২০৮) (আধুনিক প্রকাশনীঃ ৩০৮৬, ইসলামিক ফাউন্ডেশনঃ ৩০৯৪)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3333,
			"arabicnumber": 3333,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, আল্লাহ মাতৃগর্ভে একজন ফেরেশতা নিযুক্ত করে রেখেছেন। (সন্তান জন্মের সূচনায়) সে ফেরেশতা বলেন, হে রব! এ তো বীর্য। হে রব! এ তো আলাকা। হে রব! এ তো গোশ্তের খন্ড। অতঃপর আল্লাহ যদি তাকে সৃষ্টি করতে চান তাহলে ফেরেশতা বলেন, হে রব! সন্তানটি ছেলে হবে, না মেয়ে হবে? হে রব! সে কি পাপিষ্ঠ হবে, না নেককার হবে? তার রিয্ক কী পরিমাণ হবে, তার আয়ুষ্কাল কত হবে? এভাবে তার মাতৃগর্ভে সব কিছুই লিখে দেয়া হয়। (৩১৮) (আধুনিক প্রকাশনীঃ ৩০৮৭, ইসলামিক ফাউন্ডেশনঃ ৩০৯৫)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3334,
			"arabicnumber": 3334,
			"text": "আনাস (রাঃ) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে শুনে বর্ণনা করেছেন, আল্লাহ তা‘আলা জাহান্নামবাসীদের মধ্যে সবচেয়ে সহজ আযাব ভোগকারীকে জিজ্ঞেস করবেন, যদি পৃথিবীর ধন-সম্পদ তোমার হয়ে যায়, তবে তুমি কি আযাবের বিনিময়ে তা দিয়ে দিবে? সে উত্তর দিবে, হাঁ। তখন আল্লাহ বলবেন, যখন তুমি আদম (আঃ)-এর পৃষ্ঠে ছিলে, তখন আমি তোমার নিকট এর থেকেও সহজ একটি জিনিস চেয়েছিলাম। সেটা হল, তুমি আমার সঙ্গে কাউকে শরীক করবে না। কিন্তু তুমি তা না মেনে শির্ক করতে লাগলে। (৬৫৩৮, ৬৫৫৭) (মুসলিম ৫০/১০ হাঃ ২৮০৫, আহমাদ ১২৩১৪) (আধুনিক প্রকাশনীঃ ৩০৮৮, ইসলামিক ফাউন্ডেশনঃ ৩০৯৬)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3335,
			"arabicnumber": 3335,
			"text": "‘আবদুল্লাহ (ইবনু মাস‘ঊদ) (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, কোন ব্যক্তিকে অন্যায়ভাবে হত্যা করা হলে, তার এ খুনের পাপের অংশ আদম (আঃ)-এর প্রথম ছেলের (কাবিলের) উপর বর্তায়। কারণ সেই সর্বপ্রথম হত্যার প্রচলন ঘটায়। (৬৮৬৭, ৬৩২১) (মুসলিম ২৮/৭ হাঃ ১৬৭৭, আহমাদ ৩৬৩০) (আধুনিক প্রকাশনীঃ ৩০৮৯, ইসলামিক ফাউন্ডেশনঃ ৩০৯৭)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3336,
			"arabicnumber": 3336,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি, সমস্ত রূহ সেনাবাহিনীর মত একত্রিত ছিল। সেখানে তাদের যে সমস্ত রূহের পরস্পর পরিচয় ছিল, এখানেও তাদের মধ্যে পরস্পর পরিচিতি থাকবে। আর সেখানে যাদের মধ্যে পরস্পর পরিচয় হয়নি, এখানেও তাদের মধ্যে পরস্পর মতভেদ ও মতবিরোধ থাকবে। ইয়াহইয়া ইবনু আইয়ুব (রহ.) বলেছেন, ইয়াহইয়া ইবনু সা‘ঈদ (রহ.) আমাকে এভাবে বর্ণনা করেছেন। (ইসলামিক ফাউন্ডেশনঃ ২০০১ পরিচ্ছেদ)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3337,
			"arabicnumber": 3337,
			"text": "قَالَ ابْنُ عَبَّاسٍ بَادِئَ الرَّأْيِ (هود : 27) مَا ظَهَرَ لَنَا أَقْلِعِي (هود : 44) أَمْسِكِيْ وَفَارَ التَّنُّوْرُ (هود : 40) نَبَعَ الْمَاءُ وَقَالَ عِكْرِمَةُ وَجْهُ الأَرْضِ وَقَالَ مُجَاهِدٌ الْجُوْدِيُّ (هود : 44) جَبَلٌ بِالْجَزِيْرَةِ دَأْبٌ (المؤمن : 31) مِثْلُ حَالٌ ইবনু ‘আব্বাস (রাঃ) বলেন, بَادِئَ الرَّأْيِ এর অর্থ যা আমাদের সামনে প্রকাশ পেয়েছে। أَقْلِعِيْ তুমি থেমে যাও। وَفَارَ التَّنُّوْرُ পানি সবেগে উত্থিত হল। আর ‘ইকরিমাহ (রহ.) বলেন, التَّنُّوْرُ অর্থ ভূপৃষ্ঠ। আর মুজাহিদ (রহ.) বলেন, الْجُوْدِيُّ জর্জিয়ার একটি পাহাড়। دَأْبٌ অবস্থা। قَوْلِ اللهِ تَعَالَى إِنَّآ أَرْسَلْنَا نُوْحًا إِلٰى قَوْمِهٰ أَنْ أَنْذِرْ قَوْمَكَ مِنْ قَبْلِ أَنْ يَّأْتِيَهُمْ عَذَابٌ أَلِيْمٌ (نوح : 1) إِلَى آخِرِ السُّوْرَةِ وَاتْلُ عَلَيْهِمْ نَبَأَ نُوْحٍ إِذْ قَالَ لِقَوْمِهٰ يٰقَوْمِ إِنْ كَانَ كَبُرَ عَلَيْكُمْ مَّقَامِيْ وَتَذْكِيْرِيْ بِاٰيٰتِ اللهِ إِلَى قَوْلِهِ مِنَ الْمُسْلِمِيْنَ (يونس : 71-72) মহান আল্লাহর বাণীঃ ‘‘আমি নূহকে তার জাতির নিকট প্রেরণ করেছিলাম’’(নূহঃ ১) ........... সূরার শেষ পর্যন্ত। ‘‘আর তাদেরকে শুনিয়ে দাও নূহের অবস্থা-যখন সে স্বীয় সম্প্রদায়কে বলল, হে আমার সম্প্রদায়, যদি তোমাদের মাঝে আমার অবস্থিতি এবং আল্লাহর আয়াতসমূহের মাধ্যমে নসীহাত করা ভারী বলে মনে হয়ে থাকে . . . . . . . আমি আনুগত্য অবলম্বন করি।’’ (ইউনুসঃ ৭১-৭২) ৩৩৩৭. ইবনু ‘উমার (রাঃ) হতে বর্ণিত। রাসূলূল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একদা জনসমাবেশে দাঁড়ালেন এবং আল্লাহর যথোপযুক্ত প্রশংসা করলেন, অতঃপর দাজ্জালের উল্লেখ করে বললেন, আমি তোমাদেরকে তার নিকট হতে সাবধান করছি আর প্রত্যেক নবীই নিজ নিজ সম্প্রদায়কে এ দাজ্জাল হতে সাবধান করে দিয়েছেন। নূহ (আঃ)-ও নিজ সম্প্রদায়কে দাজ্জাল হতে সাবধান করেছেন। কিন্তু আমি তোমাদেরকে তার সম্বন্ধে এমন একটা কথা বলছি, যা কোন নবী তাঁর সম্প্রদায়কে বলেননি। তা হলো তোমরা জেনে রেখ, নিশ্চয়ই দাজ্জাল এক চক্ষু বিশিষ্ট, আর আল্লাহ এক চক্ষু বিশিষ্ট নন। (৩০৫৭) (মুসলিম ২৮/৭ হাঃ ৩৯৩২, আহমাদ ৩৬৩০) (আধুনিক প্রকাশনীঃ ৩০৯০, ইসলামিক ফাউন্ডেশনঃ ৩০৯৮)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3338,
			"arabicnumber": 3338,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, আমি কি তোমাদেরকে দাজ্জাল সম্পর্কে এমন একটি কথা বলে দেব না, যা কোন নবীই তাঁর সম্প্রদায়কে বলেননি? তা হলো, নিশ্চয়ই সে হবে এক চোখওয়ালা, সে সঙ্গে করে হুবহু জান্নাত এবং জাহান্নাম নিয়ে আসবে।[১] অতএব যাকে সে বলবে যে, এটি জান্নাত প্রকৃতপক্ষে সেটি হবে জাহান্নাম। আর আমি তার সম্পর্কে তোমাদের নিকট তেমনি সাবধান করছি, যেমনি নূহ (আঃ) তার সম্প্রদায়কে সে সম্পর্কে সাবধান করেছেন। (৩০৫৭) (মুসলিম ৫২/২০ হাঃ ২৯৩৬) (আধুনিক প্রকাশনীঃ ৩০৯১, ইসলামিক ফাউন্ডেশনঃ ৩০৯৯)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3339,
			"arabicnumber": 3339,
			"text": "আবূ সা‘ঈদ (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, (কিয়ামতের দিন) নূহ এবং তাঁর উম্মাত (আল্লাহর নিকটে) হাযির হবেন। তখন আল্লাহ তাঁকে জিজ্ঞেস করবেন, তুমি কি (আমার বাণী) পৌঁছিয়েছ? তিনি বলবেন, হ্যাঁ, হে আমার রব! তখন আল্লাহ তাঁর উম্মাতকে জিজ্ঞেস করবেন, নূহ কি তোমাদের নিকট আমার বাণী পৌঁছিয়েছেন। তারা বলবে, না, আমাদের নিকট কোন নবীই আসেননি। তখন আল্লাহ নূহকে বলবেন, তোমার জন্য সাক্ষ্য দিবে কে? তিনি বলবেন, মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এবং তাঁর উম্মাত। [রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন] তখন আমরা সাক্ষ্য দিব। নিশ্চয়ই তিনি আল্লাহর বাণী পৌঁছিয়েছেন। আর এটিই হল মহান আল্লাহর বাণীঃ আর এভাবেই আমি তোমাদেরকে মধ্যমপন্থী উম্মাত করেছি, যেন তোমরা মানব জাতির উপর সাক্ষী হও- (আল-বাকারাহঃ ১৪৩)। الوسط অর্থ ন্যায়পরায়ণ। (৪৪৮৭, ৭৩৪৯) (আধুনিক প্রকাশনীঃ ৩০৯২, ইসলামিক ফাউন্ডেশনঃ ৩১০০)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3340,
			"arabicnumber": 3340,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে এক খানার দা’ওয়াতে উপস্থিত ছিলাম। তাঁর সামনে (রান্না করা) ছাগলের বাহু আনা হল, এটা তাঁর নিকট পছন্দনীয় ছিল। তিনি সেখান হতে এক খন্ড খেলেন এবং বললেন, আমি কিয়ামতের দিন সমগ্র মানব জাতির সরদার হব। তোমরা কি জান? আল্লাহ কিভাবে (কিয়ামতের দিন) একই সমতলে পূর্ববর্তী ও পরবর্তী সকল মানুষকে একত্র করবেন? যেন একজন দর্শক তাদের সবাইকে দেখতে পায় এবং একজন আহবানকারীর আহবান সবার নিকট পৌঁছায়। সূর্য তাদের অতি নিকটে এসে যাবে। তখন কোন কোন মানুষ বলবে, তোমরা কি লক্ষ্য করনি, তোমরা কী অবস্থায় আছ এবং কী পরিস্থিতির সম্মুখীন হয়েছ। তোমরা কি এমন ব্যক্তিকে খুঁজে বের করবে না, যিনি তোমাদের জন্য তোমাদের রবের নিকট সুপারিশ করবেন? তখন কিছু লোক বলবে, তোমাদের আদি পিতা আদম (আঃ) আছেন। তখন সকলে তাঁর নিকট যাবে এবং বলবে, হে আদম! আপনি সমস্ত মানব জাতির পিতা। আল্লাহ আপনাকে নিজ হাতে সৃষ্টি করেছেন এবং তার পক্ষ হতে রূহ আপনার মধ্যে ফুঁকেছেন। তিনি ফেরেশতাদেরকে (আপনার সম্মানের) নির্দেশ দিয়েছেন। সে অনুযায়ী সকলে আপনাকে সিজদাও করেছেন এবং তিনি আপনাকে জান্নাতে বসবাস করতে দিয়েছেন। আপনি কি আমাদের জন্য আপনার রবের নিকট সুপারিশ করবেন না? আপনি দেখেন না, আমরা কী অবস্থায় আছি এবং কী কষ্টের সম্মুখীন হয়েছি। তখন তিনি বলবেন, আমার রব আজ এমন রাগান্বিত হয়েছেন এর পূর্বে এমন রাগান্বিত হননি আর পরেও এমন রাগান্বিত হবেন না। আর তিনি আমাকে বৃক্ষটি হতে নিষেধ করেছিলেন। তখন আমি ভুল করেছি। এখন আমি নিজের চিন্তায়ই ব্যস্ত। তোমরা আমাকে ছাড়া অন্যের নিকট যাও। তোমরা নূহের নিকট চলে যাও। তখন তারা নূহ (আঃ)-এর নিকট আসবে এবং বলবে, হে নূহ! পৃথিবীবাসীদের নিকট আপনিই প্রথম রাসূল এবং আল্লাহ আপনার নাম রেখেছেন কৃতজ্ঞ বান্দা। আপনি কি লক্ষ্য করছেন না, আমরা কী ভয়াবহ অবস্থায় পড়ে আছি? আপনি দেখছেন না আমরা কতই না দুঃখ কষ্টের সম্মুখীন হয়ে আছি? আপনি কি আমাদের জন্য আপনার রবের নিকট সুপারিশ করবেন না? তখন তিনি বলবেন, আমার রব আজ এমন রাগান্বিত হয়ে আছেন, যা ইতোপূর্বে হন নাই এবং এমন রাগান্বিত পরেও হবেন না। এখন আমি নিজের চিন্তায়ই ব্যস্ত। তোমরা নবী [মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম]-এর নিকট চলে যাও। তখন তারা আমার নিকট আসবে আর আমি আরশের নীচে সিজদায় পড়ে যাব। তখন বলা হবে, হে মুহাম্মাদ! আপনার মাথা উঠান এবং সুপারিশ করুন। আপনার সুপারিশ গ্রহণ করা হবে আর আপনি যা চান, আপনাকে তাই দেয়া হবে। মুহাম্মাদ ইবনু ‘উবাইদ (রহ.) বলেন, হাদীসের সকল অংশ মুখস্থ করতে পারিনি। (৩৩৬১, ৪৭১২) (মুসলিম ১/৮৪ হাঃ ১৯৪ আহমাদ ৯২২৯) (আধুনিক প্রকাশনীঃ ৩০৯৩, ইসলামিক ফাউন্ডেশনঃ ৩১০১)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3341,
			"arabicnumber": 3341,
			"text": "‘আবদুল্লাহ (ইবনু মাস‘ঊদ) (রাঃ) হতে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সকল ক্বারীদের ক্বিরাআতের মত فَهَلْ مِنْ مُدَّكِرٍ তিলাওয়াত করেছেন। (৩৩৪৫, ৩৩৭৬, ৪৮৬৯, ৪৮৭০, ৪৮৭১, ৪৮৭২, ৪৮৭৩, ৪৮৭৪) (আধুনিক প্রকাশনীঃ ৩০৯৪, ইসলামিক ফাউন্ডেশনঃ ৩১০২)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 3342,
			"arabicnumber": 3342,
			"text": "بَاب ৬০/৪. অধ্যায় : وَإِنَّ إِلْيَاسَ لَمِنَ الْمُرْسَلِيْنَ إِذْ قَالَ لِقَوْمِهٰٓ أَلَا تَتَّقُوْنَ أَتَدْعُوْنَ بَعْلًا وَّتَذَرُوْنَ أَحْسَنَ الْخٰلِقِيْنَ اللهُ رَبُّكُمْ وَرَبُّ اٰبَآئِكُمْ الْأَوَّلِيْنَ فَكَذَّبُوْهُ فَإِنَّهُمْ لَمُحْضَرُوْنَ إِلَّا عِبَادَ اللهِ الْمُخْلَصِيْنَ وَتَرَكْنَا عَلَيْهِ فِي الْاٰخِرِيْنَ (الصفات : 123-129) (মহান আল্লাহর বাণীঃ) আর নিশ্চয়ই ইলিয়াসও রাসূলগণের মধ্যে একজন ছিলেন। স্মরণ কর, তিনি তাঁর সম্প্রদায়কে বলেছিলেন, তোমরা কি সাবধান হবে না? ............ আমি তা পরবর্তীদের স্মরণে রেখেছি। (আস্সাফফাতঃ ১২৩-১২৯) قَالَ ابْنُ عَبَّاسٍ يُذْكَرُ بِخَيْرٍ سَلَامٌ عَلٰى اٰلِ يَاسِيْنَ إِنَّا كَذٰلِكَ نَجْزِي الْمُحْسِنِيْنَ إِنَّه” مِنْ عِبَادِنَا الْمُؤْمِنِيْنَ (الصفات : 130) يُذْكَرُ عَنْ ابْنِ مَسْعُوْدٍ وَابْنِ عَبَّاسٍ أَنَّ إِلْيَاسَ هُوَ إِدْرِيْسُ ইবনু ‘আব্বাস (রাঃ) বলেন, (ইলয়াস আঃ-এর কথাকে) মর্যাদার সঙ্গে উল্লেখ করা হয়েছে। ইলয়াসের প্রতি সালাম। আমি সৎ-কর্মশীলদেরকে এভাবেই পুরস্কৃত করে থাকি। নিঃসন্দেহে তিনি ছিলেন আমার মু’মিন বান্দাদের অন্যতম- (আস্সাফফাত ১৩০-১৩২) وَهُوَ جَدُّ أَبِى نُوْحِ عَلَيْهِمَا السَّلَامِ وَ قَوْلُ اللهِ تَعَالى وَرَفَعْنَهُ مَكَانًا عَلِيًّا এবং তিনি নূহ (আঃ)-এর পিতার দাদা ছিলেন। মহান আল্লাহর বাণীঃ আর আমি তাঁকে (ইদরীস) উচ্চ মর্যাদায় উন্নীত করেছি। (মারইয়াম ৫৭) ৩৩৪২. আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। তিনি বলেন, আবূ যার (রাঃ) হাদীস বর্ণনা করতেন যে, রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বলেছেন, (লাইলাতুল মি’রাজে) আমার ঘরের ছাদ উন্মুক্ত করা হয়েছিল। তখন আমি মক্কায় ছিলাম। অতঃপর জিব্রাঈল (আঃ) অবতরণ করলেন এবং আমার বক্ষ বিদীর্ণ করলেন। অতঃপর তিনি যমযমের পানি দ্বারা তা ধুলেন। এরপর হিকমত ও ঈমান (জ্ঞান ও বিশ্বাস) দ্বারা পূর্ণ একখানা সোনার তশ্তরি নিয়ে আসেন এবং তা আমার বক্ষে ঢেলে দিলেন। অতঃপর আমার বক্ষকে আগের মত মিলিয়ে দিলেন। এবার তিনি আমার হাত ধরলেন এবং আমাকে আকাশের দিকে উঠিয়ে নিলেন। অতঃপর যখন দুনিয়ার নিকটবর্তী আকাশে পৌঁছলেন, তখন জিবরাঈল (আঃ) আকাশের দ্বাররক্ষীকে বললেন, দরজা খুলুন। তিনি জিজ্ঞেস করলেন, কে? জবাব দিলেন, আমি জিবরাঈল। দ্বাররক্ষী বললেন, আপনার সঙ্গে কি আর কেউ আছেন? তিনি বললেন, আমার সঙ্গে মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আছেন। দ্বাররক্ষী জিজ্ঞেস করলেন, তাঁকে কি ডাকা হয়েছে? বললেন, হ্যাঁ। অতঃপর দরজা খোলা হল। যখন আমরা আকাশের উপরে আরোহণ করলাম, হঠাৎ দেখলাম এক ব্যক্তি যার ডানে একদল লোক আর তাঁর বামেও একদল লোক। যখন তিনি তাঁর ডান দিকে তাকান তখন হাসতে থাকেন আর যখন তাঁর বাম দিকে তাকান তখন কাঁদতে থাকেন। (তিনি আমাকে দেখে) বললেন, মারাহাবা! নেক নবী ও নেক সন্তান। আমি জিজ্ঞেস করলাম, হে জিবরাঈল! ইনি কে? তিনি জবাব দিলেন, ইনি আদম (আঃ) আর তাঁর ডানের ও বামের এ লোকগুলো হলো তাঁর সন্তান। এদের মধ্যে ডানদিকের লোকগুলো জান্নাতী আর বামদিকের লোকগুলো জাহান্নামী। অতএব যখন তিনি ডানদিকে তাকান তখন হাসেন আর যখন বামদিকে তাকান তখন কাঁদেন। অতঃপর আমাকে নিয়ে জিবরাঈল (আঃ) আরো উপরে উঠলেন। এমনকি দ্বিতীয় আকাশের দ্বারে এসে গেলেন। তখন তিনি এ আকাশের দ্বাররক্ষীকে বললেন, দরজা খুলুন! দ্বাররক্ষী তাঁকে প্রথম আকাশের দ্বাররক্ষী যেরূপ বলেছিল, তেমনি বলল। অতঃপর তিনি দরজা খুলে দিলেন। আনাস (রাঃ) বলেন, অতঃপর আবূ যার (রাঃ) উল্লেখ করেছেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আকাশসমূহে ইদ্রীস, মূসা, ‘ঈসা এবং ইবরাহীম (আঃ)-এর সাক্ষাৎ পেয়েছেন। তাঁদের কার অবস্থান কোন্ আকাশে তিনি আমার নিকট তা বর্ণনা করেননি। তবে তিনি এটা উল্লেখ করেছেন যে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম] দুনিয়ার নিকটবর্তী আকাশে আদম (আঃ)-কে এবং ষষ্ঠ আকাশে ইবরাহীম (আঃ)-কে দেখতে পেয়েছেন। আনাস (রাঃ) বলেন, জিবরাঈল (আঃ) যখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সহ] ইদ্রীস (আঃ)-এর পাশ দিয়ে অতিক্রম করলেন, তখন তিনি [ইদ্রীস (আঃ)] বলেছিলেন, হে নেক নবী এবং নেক ভাই! আপনাকে মারহাবা। [নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন] আমি জিজ্ঞেস করলাম, ইনি কে? তিনি (জিবরাঈল) জবাব দিলেন, ইনি ইদ্রীস (আঃ)! অতঃপর মুসা (আঃ)-এর নিকট দিয়ে অতিক্রম করলাম। তিনি বললেন, মারহাবা! হে নেক নবী এবং নেক ভাই। তখন আমি জিজ্ঞেস করলাম, ইনি কে? তিনি [জিবরাঈল (আঃ)] বললেন, ইনি মূসা (আঃ)। অতঃপর ‘ঈসা (আঃ)-এর পাশ দিয়ে অতিক্রম করলাম। তিনি বললেন, মারহাবা! হে নেক নবী এবং নেক ভাই। তখন আমি জিজ্ঞেস করলাম, ইনি কে? তিনি [জিবরাঈল (আঃ)] বললেন, ইনি ‘ঈসা (আঃ)। অতঃপর ইবরাহীম (আঃ)-এর পাশ দিয়ে অতিক্রম করলাম। তিনি বললেন, মারহাবা। হে নেক নবী এবং নেক সন্তান! আমি জানতে চাইলাম, ইনি কে? তিনি [জিবরাঈল (আঃ)] বললেন, ইনি ইবরাহীম (আঃ)। ইবনু শিহাব (রহ.) বলেন, আমাকে ইবনু হাযম (রহ.) জানিয়েছেন যে, ইবনু ‘আব্বাস ও আবূ ইয়াহয়্যা আনসারী (রাঃ) বলতেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, অতঃপর জিবরাঈল আমাকে ঊর্ধ্বে নিয়ে গেলেন। শেষ পর্যন্ত আমি একটি সমতল স্থানে গিয়ে পৌঁছলাম। সেখান হতে কলমসমূহের খসখস শব্দ শুনছিলাম। ইবনু হাযম (রহ.) এবং আনাস ইবনু মালিক (রাঃ) বর্ণনা করেছেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তখন আল্লাহ আমার উপর পঞ্চাশ ওয়াক্ত সালাত ফরজ করেছেন। অতঃপর আমি এ নির্দেশ নিয়ে ফিরে আসলাম। যখন মূসা (আঃ)-এর পাশ দিয়ে অতিক্রম করছিলাম, তখন তিনি জিজ্ঞেস করলেন, আপনার রব আপনার উম্মাত উপর কী ফরজ করেছেন? আমি বললাম, তাদের উপর পঞ্চাশ ওয়াক্ত সালাত ফরজ করা হয়েছে। তিনি বললেন, পুনরায় আপনার রবের নিকট ফিরে যান। কেননা আপনার উম্মাতের তা পালন করার সামর্থ্য রাখে না। তখন ফিরে গেলাম এবং আমার রবের নিকট তা কমাবার জন্য আবেদন করলাম। তিনি তার অর্ধেক কমিয়ে দিলেন। আমি মূসা (আঃ)-এর নিকট ফিরে আসলাম। তিনি বললেন, আপনার রবের নিকট গিয়ে পুনরায় কমাবার আবেদন করুন এবং তিনি [নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম] পূর্বের অনুরূপ কথা আবার উল্লেখ করলেন। এবার তিনি (আল্লাহ) তার অর্ধেক কমিয়ে দিলেন। আবার আমি মূসা (আঃ)-এর নিকট আসলাম এবং তিনি পূর্বের মত বললেন। আমি তা করলাম। তখন আল্লাহ তার এক অংশ মাফ করে দিলেন। আমি পুনরায় মূসা (আঃ)-এর নিকট আসলাম এবং তাঁকে জানালাম। তখন তিনি বললেন, আপনার রবের নিকট গিয়ে আরো কমাবার আরয করুন। কেননা আপনার উম্মাতের তা পালন করার সামর্থ্য থাকবে না। আমি আবার ফিরে গেলাম এবং আমার রবের নিকট তা কমাবার আবেদন করলাম। তিনি বললেন, এ পাঁচ ওয়াক্ত সালাত বাকী রইল। আর তা সাওয়াবের ক্ষেত্রে পঞ্চাশ ওয়াক্ত সালাতের সমান হবে। আমার কথার পরিবর্তন হয় না। অতঃপর আমি মূসা (আঃ)-এর নিকট ফিরে আসলাম। তিনি এবারও বললেন, আপনার রবের নিকট গিয়ে আবেদন করুন। আমি বললাম, এবার আমার রবের সম্মুখীন হতে আমি লজ্জাবোধ করছি। এবার জিবরাঈল (আঃ) চললেন এবং অবশেষে আমাকে সাথে নিয়ে সিদ্রাতুল মুন্তাহা পর্যন্ত নিয়ে গেলেন। দেখলাম তা এমন চমৎকার রঙে পরিপূর্ণ যা বর্ণনা করার ক্ষমতা আমার নেই। অতঃপর আমাকে জান্নাতে প্রবিষ্ট করানো হল। দেখলাম এর ইট মোতির তৈরী আর এর মাটি মিসক বা কস্তুরীর মত সুগন্ধময়। (৩৪৯) (আধুনিক প্রকাশনীঃ ৩০৯৫, ইসলামিক ফাউন্ডেশনঃ ৩১০৩)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 3343,
			"arabicnumber": 3343,
			"text": "بَابُ قَوْلِ اللهِ تَعَالَى ৬০/৬ অধ্যায় : (মহান আল্লাহর বাণীঃ) وَإِلٰى عَادٍ أَخٰهُمْ هُوْدًا قَالَ يٰقَوْمِ اعْبُدُوْا اللهَ (هود : 50) وَقَوْلِهِ إِذْ أَنْذَرَ قَوْمَه” بِالْأَحْقٰفِ إِلَى قَوْلِهِ كَذٰلِكَ نَجْزِي الْقَوْمَ الْمُجْرِمِيْنَ (الأحقاف : 21) فِيْهِ عَنْ عَطَاءٍ وَسُلَيْمَانَ عَنْ عَائِشَةَ عَنْ النَّبِيِّ صلى الله عليه وسلم আর আমি আদ জাতির নিকট তাদেরই ভাই হূদকে পাঠিয়েছিলাম ....... (হূদ ৫০) এবং আল্লাহর বাণীঃ আর স্মরণ কর (হূদের কথা) যখন তিনি আহ্কাফ অঞ্চলে নিজ জাতিকে সতর্ক করেছিলেন ...... এভাবে আমি অপরাধী সম্প্রদায়কে প্রতিফল দিয়ে থাকি- (আহকাফ ২১-২৫)। এ প্রসঙ্গে ‘আত্বা ও সুলাইমান (রহ.) ‘আয়িশাহ (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট হতে হাদীস বর্ণিত আছে। وَأَمَّا عَادٌ فَأُهْلِكُوْا بِرِيْحٍ صَرْصَرٍ شَدِيْدَةٍ عَاتِيَةٍ (الحاقة : 6) قَالَ ابْنُ عُيَيْنَةَ عَتَتْ عَلَى الْخُزَّانِ سَخَّرَهَا عَلَيْهِمْ سَبْعَ لَيَالٍ وَّثَمَانِيَةَ أَيَّامٍ حُسُومًا (الحاقة : 7) مُتَتَابِعَةً فَتَرَى الْقَوْمَ فِيْهَا صَرْعٰى كَأَنَّهُمْ أَعْجَازُ نَخْلٍ خَاوِيَةٍ أُصُوْلُهَا فَهَلْ تَرٰى لَهُمْ مِنْم بَاقِيَةٍ (الحاقة : 8) بَقِيَّةٍ আর আদ জাতিকে ধ্বংস করা হয়েছে একটি প্রচন্ড ঝড়ো হাওয়ার দ্বারা। صرصرঅর্থ شديدة শক্ত। ইবনু ‘উওয়াইনাহ বলেন, প্রবাহিত করেছিলেন তিনি যা নিয়ন্ত্রণশারীর নিয়ন্ত্রণ থেকে বেরিয়ে গিয়েছিল বিধায় হীনভাবে সাত ও আট দিন পর্যন্ত তাদের ওপর চাপিয়ে রেখেছিলেন। حُسُومًا অর্থ ধারাবাহিক ভাবে। (সেখানে তুমি থাকলে) দেখতে পেতে যে, তারা সেখানে লুটিয়ে পড়ে আছে সারশূন্য বিক্ষিপ্ত খেজুর গাছের কান্ডের মত। অতঃপর তাদের কাউকে তুমি বিদ্যমান দেখতে পাও কি? (হাক্কাহ্ ৬-৮) أَعْجَازُ অর্থ শিকড়। ৩৩৪৩. ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, আমাকে ভোরের বায়ু দ্বারা সাহায্য করা হয়েছে আর আদ জাতিকে দাবুর বা পশ্চিমের বায়ু দ্বারা ধ্বংস করা হয়েছে। (১০৩৫) (ই.ফা ৩১০৪ প্রথমাংশ)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 3344,
			"arabicnumber": 3344,
			"text": "আবূ সা‘ঈদ (রাঃ) হতে বর্ণিত। ‘আলী (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট কিছু স্বর্ণের টুকরো পাঠালেন। তিনি তা চার ব্যক্তির মাঝে বণ্টন করে দিলেন। (১) আল-আকরা ইবনু হান্যালী যিনি মাজাশেয়ী গোত্রের ছিলেন। (২) উআইনা ইবনু বাদার ফাযারী। (৩) যায়দ ত্বায়ী, যিনি পওে বনী নাবহান গোত্রের ছিলেন। (৪) ‘আলকামাহ ইবনু উলাসা আমেরী, যিনি বনী কিলাব গোত্রের ছিলেন। এতে কুরাইশ ও আনসারগণ অসন্তুষ্ট হলেন এবং বলতে লাগলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নাজদবাসী নেতৃবৃন্দকে দিচ্ছেন আর আমাদেরকে দিচ্ছেন না। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আমি তো তাদেরকে আকৃষ্ট করার জন্য এমন মনোরঞ্জন করছি। তখন এক ব্যক্তি সামনে এগিয়ে আসল, যার চোখ দু’টি কোটরাগত, গন্ডদ্বয় ঝুলে পড়া; কপাল উঁটু, ঘন দাড়ি এবং মাথা মোড়ানো ছিল। সে বলল, হে মুহাম্মাদ! আল্লাহকে ভয় করুন। তখন তিনি বললেন, আমিই যদি নাফরমানী করি তাহলে আল্লাহর আনুগত্য করবে কে? আল্লাহ আমাকে পৃথিবীবাসীর উপর আমানতদার বানিয়েছেন আর তোমরা আমাকে আমানতদার মনে করছ না। তখন এক ব্যক্তি তাঁর নিকট তাকে হত্যা করার অনুমতি চাইল। [আবূ সা‘ঈদ (রাঃ) বলেন] আমি তাকে খালিদ ইবনু ওয়ালীদ (রাঃ) বলে ধারণা করছি। কিন্তু নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে নিষেধ করলেন। অতঃপর অভিযোগকারী লোকটি যখন ফিরে গেল, তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, এ ব্যক্তির বংশ হতে বা এ ব্যক্তির পরে এমন কিছু সংখ্যক লোক হবে তারা কুরআন পড়বে কিন্তু তা তাদের কণ্ঠনালী অতিক্রম করবে না। দ্বীন হতে তারা এমনভাবে বেরিয়ে পড়বে যেমনি ধনুক হতে তীর বেরিয়ে যায়। তারা ইসলামের অনুসারীদেরকে (মুসলিমদেরকে) হত্যা করবে আর মূর্তি পূজারীদেরকে হত্যা করা হতে বাদ দেবে। আমি যদি তাদের পেতাম তাহলে তাদেরকে আদ জাতির মত অবশ্যই হত্যা করতাম। (৩৬১০, ৪৩৫১, ৪৬৬৭, ৫০৫৮, ৬১৬৩, ৬৯৩১, ৬৯৩৪, ৭৪৩২) (মুসলিম ১২/৪৭ হাঃ ১০৬৪, আহমাদ ১১৬৯৫) (আধুনিক প্রকাশনীঃ ৩০৯৬, ইসলামিক ফাউন্ডেশনঃ ৩১০৪)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 3345,
			"arabicnumber": 3345,
			"text": "‘আবদুল্লাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে (আদ জাতির ঘটনা বর্ণনায়) -فَهَلْ مِنْ مُدَّكِرٍ এ আয়াতটি পড়তে শুনেছি। (৩৩৪১) (আধুনিক প্রকাশনীঃ ৩০৯৭, ইসলামিক ফাউন্ডেশনঃ ৩১০৫)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 3346,
			"arabicnumber": 3346,
			"text": "وَقَوْلِ اللهِ تَعَالَى قَالُوْا يَا ذَا الْقَرْنَيْنِ إِنَّ يَأْجُوْجَ وَمَأْجُوْجَ مُفْسِدُوْنَ فِي الأَرْضِ (الكهف : 94) قَوْلُ اللهِ تَعَالَى وَيَسْأَلُوْنَكَ عَنْ ذِي الْقَرْنَيْنِ قُلْ سَأَتْلُوْ عَلَيْكُمْ مِّنْهُ ذِكْرًا إِنَّا مَكَّنَّا لَه” فِي الأَرْضِ وَاٰتَيْنَاهُ مِنْ كُلِّ شَيْءٍ سَبَبًا فَاتَّبَعَ سَبَبًا (الكهف : 83.84) إِلَى قَوْلِهِ ائْتُوْنِيْ زُبَرَ الْحَدِيْدِ (الكهف : 96) وَاحِدُهَا زُبْرَةٌ وَهِيَ الْقِطَعُ حَتَّى إِذَا سَاوَى بَيْنَ الصَّدَفَيْنِ يُقَالُ عَنْ ابْنِ عَبَّاسٍ الْجَبَلَيْنِ وَ السُّدَّيْنِ الْجَبَلَيْنِ خَرْجًا أَجْرًا قَالَ انْفُخُوْا حَتّٰى إِذَا جَعَلَهُ نَارًا قَالَ اٰتُوْنِيْ أُفْرِغْ عَلَيْهِ قِطْرًا (الكهف : 96) أَصْبُبْ عَلَيْهِ رَصَاصًا وَيُقَالُ الْحَدِيْدُ وَيُقَالُ الصُّفْرُ وَقَالَ ابْنُ عَبَّاسٍ النُّحَاسُ فَمَا اسْطَاعُوْا أَنْ يَّظْهَرُوْهُ (الكهف : 97) يَعْلُوْهُ اسْتَطَاعَ اسْتَفْعَلَ مِنْ أَطَعْتُ لَهُ فَلِذَلِكَ فُتِحَ أَسْطَاعَ يَسْطِيْعُ وَقَالَ بَعْضُهُمْ اسْتَطَاعَ يَسْتَطِيْعُ وَمَا اسْتَطَاعُوْا لَهُ نَقْبًا (الكهف : 97) قَالَ هٰذَا رَحْمَةٌ مِّنْ رَّبِّيْ فَإِذَا جَآءَ وَعْدُ رَبِّيْ جَعَلَهُ دَكًّا (الكهف : 98) أَلْزَقَهُ بِالأَرْضِ وَنَاقَةٌ دَكَّاءُ لَا سَنَامَ لَهَا وَالدَّكْدَاكُ مِنْ الأَرْضِ مِثْلُهُ حَتَّى صَلُبَ وَتَلَبَّدَ وَكَانَ وَعْدُ رَبِّيْ حَقًّا وَتَرَكْنَا بَعْضَهُمْ يَوْمَئِذٍ يَّمُوْجُ فِيْ بَعْضٍ (الكهف : 98-99) حَتّٰىٓ إِذَا فُتِحَتْ يَأْجُوْجُ وَمَأْجُوْجُ وَهُمْ مِّنْ كُلِّ حَدَبٍ يَّنْسِلُوْنَ (الأنبياء : 96) قَالَ قَتَادَةُ حَدَبٌ أَكَمَةٌ قَالَ رَجُلٌ لِلنَّبِيِّ رَأَيْتُ السَّدَّ مِثْلَ الْبُرْدِ الْمُحَبَّرِ قَالَ رَأَيْتَهُ মহান আল্লাহর বাণীঃ নিশ্চয়ই ইয়া’জূজ মা’জূজ পৃথিবীতে ফাসাদ সৃষ্টিকারী। (কাহফঃ ৯৪) অধ্যায় : মহান আল্লাহর বাণীঃ (হে নবী) তারা আপনাকে যুল-কারনাইন সম্পর্কে জিজ্ঞেস করছে. . .। আয়াতে سَبَبًا অর্থ চলাচলের পথ ও রাস্তা। তোমরা আমার নিকট লোহার খন্ড নিয়ে আস- (কাহফ ৮৩-৯৬)। এখানে زُبَرَ শব্দটি বহুবচন। একবচনে زُبْرَةٌ অর্থ খন্ড। অবশেষে মাঝের ফাঁকা জায়গা পূর্ণ হয়ে যখন লোহার স্তূপ দু’পর্বতের সমান হল- (কাহফ ৯৬)। তখন তিনি লোকদেরকে বললেন, এখন তাতে ফুঁক দিতে থাক। এ আয়াতে الصَّدَفَيْنِ শব্দের অর্থ ইবনু ‘আব্বাস (রাঃ)-এর বর্ণনা অনুযায়ী দু’টি পর্বতকে বুঝানো হয়েছে। আর السُّدَّيْنِ এর অর্থ দু’টি পাহাড়। خَرْجًا অর্থ পারিশ্রমিক। যুল-কারনাইন বলল, তোমরা হাপরে ফুঁক দিতে থাক। যখন তা আগুনের মত গরম হল, তখন তিনি বললেন, তোমরা গলিত তামা নিয়ে আস, আমি তা এর উপর ঢেলে দেই- (কাহফ ৯৬)। -قِطْرٌ অর্থ সীসা। আবার লৌহ গলিত পদার্থকেও বলা হয় এবং তামাকেও বলা হয়। আর ইবনু ‘আব্বাস (রাঃ)-এর অর্থ তাম্রগলিত পদার্থ বলেছেন। (আল্লাহর বাণী) অতঃপর তারা (ইয়াজুজ ও মাজুজ) এ প্রাচীর অতিক্রম করতে পারল না- (কাহফ ৯৭)। অর্থাৎ তারা এর উপরে উঠতে সক্ষম হল না। اسْتَطَاعَ শব্দটি أَطَعْتُ لَهُ নিকট হতে باب استفعال আনা হয়েছে। একে أَسْطَاعَ I يَسْطِيْعُ যবরসহ পড়া হয়ে থাকে। আর কেউ কেউ একে اسْتَطَاعَ يَسْتَطِيْعُ রূপে পড়েন। (আল্লাহর বাণী) তারা তা ছিদ্রও করতে পারল না। তিনি বললেন, এটা আমার রবের অনুগ্রহ। যখন আমার রবের প্রতিশ্রুতি পূর্ণ হবে তখন তিনি এটিকে পূর্ণ বিচূর্ণ করে দিবেন- (কাহফ ৯৭-৯৮)। دَكَّاءُ অর্থ মাটির সঙ্গে মিশিয়ে দিবেন। وَنَاقَةٌ دَكَّاءُ বলে যে উটের কুঁজ নেই। الدَّكْدَاكُ مِنْ الأَرْضِ যমীনের সেই সমতল উপরিভাগকে বলা হয় যা শুকিয়ে যায় এবং উঁচু নিচু না থাকে। (আল্লাহর বাণী) আর আমার রবের প্রতিশ্রুতি সত্য, সে দিন আমি তাদেরকে ছেড়ে দিব, এ অবস্থায় যে, একদল অপর দলের উপর তরঙ্গের মত পতিত হবে- (কাহফ ৯৯)। (আল্লাহর বাণী) এমন কি যখন ইয়াজুজ ও মাজুজকে মুক্ত করা হবে এবং তারা প্রতি উচ্চ ভূমি হতে ছুটে আসবে- (আম্বিয়া ৯৬)। ক্বাতাদাহ (রহ.) বলেন, -حَدَبٌ অতি টিলা। এক সাহাবী নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বললেন, আমি প্রাচীরটিকে কারুকার্য খচিত চাদরের মত দেখেছি। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তুমি তা ঠিকই দেখেছ। ৩৩৪৬. যায়নাব বিনতে জাহাশ (রাঃ) হতে বর্ণিত। একবার নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ভীত সন্ত্রস্ত অবস্থায় তাঁর নিকট আসলেন এবং বলতে লাগলেন, লা- ইলাহা ইল্লাল্লাহ। আরবের লোকেদের জন্য সেই অনিষ্টের কারণে ধ্বংস অনিবার্য যা নিকটবর্তী হয়েছে। আজ ইয়াজুজ ও মাজুজের প্রাচীর এ পরিমাণ খুলে গেছে। এ কথা বলার সময় তিনি তাঁর বৃদ্ধাঙ্গুলিল অগ্রভাগকে তার সঙ্গের শাহাদাত আঙ্গুলির অগ্রভাগের সঙ্গে মিলিয়ে গোলাকার করে ছিদ্রের পরিমাণ দেখান। যায়নাব বিনতে জাহাশ (রাঃ) বলেন, তখন আমি বললাম, হে আল্লাহর রাসূল! আমাদের মধ্যে পুণ্যবান লোকজন থাকা সত্ত্বেও কি আমরা ধ্বংস হয়ে যাব? তিনি বললেন, হাঁ যখন পাপকাজ অতি মাত্রায় বেড়ে যাবে। (৩৫৯৮, ৭০৫৯, ৭১৩৫) (মুসলিম ৫২ হাঃ ২৮৮০, আহমাদ ২৭৪৮৬) (আধুনিক প্রকাশনীঃ ৩০৯৮, ইসলামিক ফাউন্ডেশনঃ ৩১০৬)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 3347,
			"arabicnumber": 3347,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, ইয়া’জূজ ও মা’জূজের প্রাচীরে আল্লাহ এ পরিমাণ ছিদ্র করে দিয়েছেন। এই বলে, তিনি তাঁর হাতে নব্বই সংখ্যার আকৃতির মত করে দেখালেন। (৭১৩৬) (মুসলিম ৫২/১ হাঃ ২৮৮১, আহমাদ ৮৫০৯) (আধুনিক প্রকাশনীঃ ৩০৯৯, ইসলামিক ফাউন্ডেশনঃ ৩১০৭)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 3348,
			"arabicnumber": 3348,
			"text": "আবূ সা‘ঈদ খুদরী (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, মহান আল্লাহ ডাকবেন, হে আদম (আঃ)! তখন তিনি জবাব দিবেন, আমি হাযির, আমি সৌভাগ্যবান এবং সকল কল্যাণ আপনার হতেই। তখন আল্লাহ বলবেন, জাহান্নামীদেরকে বের করে দাও। আদম (আঃ) বলবেন, জাহান্নামী কারা? আল্লাহ বলবেন, প্রতি হাজারে নয়শত নিরানব্বই জন। এ সময় ছোটরা বুড়ো হয়ে যাবে। প্রত্যেক গর্ভবতী তার গর্ভপাত করে ফেলবে। মানুষকে দেখবে নেশাগ্রস্তের মত যদিও তারা নেশাগ্রস্ত নয়। বস্তুতঃ আল্লাহর শাস্তি কঠিন- (হাজ্জঃ ২)। সাহাবীগণ বললেন, হে আল্লাহর রাসূল! আমাদের মধ্যে সেই একজন কে? তিনি বললেন, তোমরা সুসংবাদ গ্রহণ কর। কেননা তোমাদের মধ্য হতে একজন আর এক হাজারের অবশিষ্ট ইয়াজুজ-মাজুজ হবে। অতঃপর তিনি বললেন, যাঁর হাতে আমার প্রাণ, তাঁর কসম। আমি আশা করি, তোমরা সমস্ত জান্নাতবাসীর এক তৃতীয়াংশ হবে। [আবূ সা‘ঈদ (রাঃ) বলেন] আমরা এ সংবাদ শুনে আবার আল্লাহু আকবার বলে তাকবীর দিলাম। তিনি আবার বললেন, আমি আশা করি তোমরা সমস্ত জান্নাতীদের অর্ধেক হবে। এ কথা শুনে আমরা আবারও আল্লাহু আকবার বলে তাকবীর দিলাম। তিনি বললেন, তোমরা তো অন্যান্য মানুষের তুলনায় এমন, যেমন সাদা ষাঁড়ের দেহে কয়েকটি কালো পশম অথবা কালো ষাঁড়ের শরীরে কয়েকটি সাদা পশম। (৪৭৪১, ৬৫৩০, ৭৪৮৩) (আধুনিক প্রকাশনীঃ ৩১০০, ইসলামিক ফাউন্ডেশনঃ ৩১০৮)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 3349,
			"arabicnumber": 3349,
			"text": "وَقَوْلِهِ إِنَّ إِبْرَاهِيْمَ كَانَ أُمَّةً قَانِتًا لِّلّٰـهِ (النحل : 120) وَقَوْلِهِ إِنَّ إِبْرٰهِيْمَ لَاَوَّاهٌ حَلِيْمٌ (التوبة : 114) وَقَالَ أَبُوْ مَيْسَرَةَ الرَّحِيْمُ بِلِسَانِ الْحَبَشَةِ মহান আল্লাহর বাণীঃ নিশ্চয়ই ইবরাহীম ছিলেন এক উম্মাত, আল্লাহর অনুগত- (আশশুয়ারাঃ ১২০)। মহান আল্লাহর বাণীঃ নিশ্চয়ই ইবরাহীম নরম হৃদয় ও সহনশীল- (আত্-তওবাঃ ১১৪)। আর আবূ মাইসারাহ (রহ.) বলেন, হাবশী ভাষায় اواه শব্দটি رَّحِيْم অর্থে ব্যবহৃত হয়। ৩৩৪৯. ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, নিশ্চয়ই তোমাদেরকে হাশর ময়দানে খালি পা, বস্ত্রহীন এবং খাতনাবিহীন অবস্থায় উপস্থিত করা হবে। অতঃপর তিনি পবিত্র কুরআনের আয়াতটি তিলাওয়াত করলেনঃ যেভাবে আমি প্রথমে সৃষ্টির সূচনা করেছিলাম, সেভাবে পুনরায় সৃষ্টি করব। এটি আমার প্রতিশ্রুতি। এর বাস্তবায়ন আমি করবই- (আম্বিয়াঃ ১০৪)। আর কিয়ামতের দিন সবার আগে যাকে কাপড় পরানো হবে তিনি হবেন ইবরাহীম (আঃ)। আর আমার অনুসারীদের মধ্য হতে কয়েকজনকে পাকড়াও করে বাম দিকে অর্থাৎ জাহান্নামের দিকে নিয়ে যাওয়া হবে। তখন আমি বলব, এরা তো আমার অনুসারী, এরা তো আমার অনুসারী। এ সময় আল্লাহ বললেন, যখন আপনি এদের নিকট হতে বিদায় নেন, তখন তারা পূর্ব ধর্মে ফিরে যায়। কাজেই তারা আপনার সাহাবী নয়। তখন আল্লাহর নেক বান্দা [ঈসা (আঃ)] যেমন বলেছিলেন; তেমন আমি বলব, হে আল্লাহ! আমি যতদিন তাদের মাঝে ছিলাম, ততদিন আমি ছিলাম তাদের অবস্থার পর্যবেক্ষক। আপনি ক্ষমতাধর হিকমতওয়ালা-(আল-মায়িদাহ ১১৭-১১৮)। (৪৩৩৭, ৪৬২৫, ৪৬২৬, ৪৬৪০, ৬৫২৪, ৬৫২৬) (আধুনিক প্রকাশনীঃ ৩১০১, ইসলামিক ফাউন্ডেশনঃ ৩১০৯)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 3350,
			"arabicnumber": 3350,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, কিয়ামতের দিন ইবরাহীম (আঃ) তার পিতা আযরের দেখা পাবেন। আযরের মুখমন্ডলে কালি এবং ধূলাবালি থাকবে। তখন ইবরাহীম (আঃ) তাকে বললেন, আমি কি পৃথিবীতে আপনাকে বলিনি যে, আমার অবাধ্যতা করবেন না? তখন তাঁর পিতা বলবে, আজ আর তোমার অবাধ্যতা করব না। অতঃপর ইবরাহীম (আঃ) আবেদন করবেন, হে আমার রব! আপনি আমার সঙ্গে ওয়াদা করেছিলেন যে, হাশরের দিন আপনি আমাকে লজ্জিত করবেন না। আমার পিতা রহম হতে বঞ্চিত হবার চেয়ে বেশী অপমান আমার জন্য আর কী হতে পারে? তখন আল্লাহ বলবেন, আমি কাফিরদের জন্য জান্নাত হারাম করে দিয়েছি। পুনরায় বলা হবে, হে ইবরাহীম! তোমার পদতলে কী? তখন তিনি নীচের দিকে তাকাবেন। হঠাৎ দেখতে পাবেন তাঁর পিতার জায়গায় সর্বাঙ্গে রক্তমাখা একটি জানোয়ার পড়ে রয়েছে। এর চার পা বেঁধে জাহান্নামে ছুঁড়ে ফেলা হবে।* (৪৭৬৮, ৪৭৬৯) (আধুনিক প্রকাশনীঃ ৩১০২, ইসলামিক ফাউন্ডেশনঃ ৩১১০)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 3351,
			"arabicnumber": 3351,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একবার কা‘বা ঘরে প্রবেশ করলেন। সেখানে তিনি ইবরাহীম (আঃ) ও মারইয়ামের ছবি দেখতে পেলেন। তখন তিনি বললেন, তাদের কী হল? অথচ তারা তো শুনতে পেয়েছে, যে ঘরে প্রাণীর ছবি থাকবে, সে ঘরে ফেরেশতামন্ডলী প্রবেশ করেন না। এ যে ইবরাহীমের ছবি বানানো হয়েছে, (ভাগ্য নির্ধারক অবস্থায়) তিনি কেন ভাগ্য নির্ধারক তীর নিক্ষেপ করবেন! (৩৯৮) (আধুনিক প্রকাশনীঃ ৩১০৩, ইসলামিক ফাউন্ডেশনঃ ৩১১১)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 3352,
			"arabicnumber": 3352,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন কা‘বা ঘরে ছবিগুলো দেখতে পেলেন, তখন যে পর্যন্ত তাঁর নির্দেশে তা মিটিয়ে ফেলা না হলো, সে পর্যন্ত তিনি তাতে প্রবেশ করলেন না। আর তিনি দেখতে পেলেন, ইবরাহীম এবং ইসমাঈল (আঃ)-এর হাতে ভাগ্য নির্ধারণের তীর। তখন তিনি বললেন, আল্লাহ তাদের (কুরাইশদের) উপর লা‘নত করুন। আল্লাহর কসম, এরা দু’জন কক্ষনোও ভাগ্য নির্ধারক তীর নিক্ষেপ করেননি। (৩৯৮) (আধুনিক প্রকাশনীঃ ৩১০৪, ইসলামিক ফাউন্ডেশনঃ ৩১১২)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 3353,
			"arabicnumber": 3353,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, হে আল্লাহর রাসূল! মানুষের মাঝে সবচেয়ে সম্মানিত ব্যক্তি কে? তিনি বললেন, তাদের মধ্যে যে সবচেয়ে অধিক মুত্তাকী। তখন তারা বলল, আমরা তো আপনাকে এ ব্যাপারে জিজ্ঞেস করিনি। তিনি বললেন, তা হলে আল্লাহর নবী ইউসুফ, যিনি আল্লাহর নবী’র পুত্র, আল্লাহর নবী’র পৌত্র এবং আল্লাহর খলীল-এর প্রপৌত্র। তারা বলল, আমরা আপনাকে এ ব্যাপারেও জিজ্ঞেস করিনি। তিনি বললেন, তা হলে কি তোমরা আরবের মূল্যবান গোত্রসমূহ সম্বন্ধে জিজ্ঞেস করেছ? জাহিলী যুগে তাদের মধ্যে যারা সর্বোত্তম ব্যক্তি ছিলেন, ইসলামেও তাঁরা সর্বোত্তম ব্যক্তি যদি তাঁরা ইসলাম সম্পর্কিত জ্ঞানার্জন করেন। আবূ উসামাহ ও মু‘তামির (রহ.) ......... আবূ হুরাইরাহ (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। (৩৩৭৪, ৩৩৮৩, ৩৪৯০, ৪৬৮৯) (মুসলিম ৪৩/৪৪ হাঃ ২৩৭৮, আহমাদ ৯৫৭৩) (আধুনিক প্রকাশনীঃ ৩১০৫, ইসলামিক ফাউন্ডেশনঃ ৩১১৩)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 3354,
			"arabicnumber": 3354,
			"text": "সামূরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, আজ রাতে (স্বপ্নে) আমার নিকট দু’জন লোক আসলেন। অতঃপর আমরা এক দীর্ঘদেহ বিশিষ্ট লোকের নিকট আসলাম। তাঁর দেহ দীর্ঘ হবার দরুন আমি তাঁর মাথা দেখতে পাচ্ছিলাম না। আসলে তিনি হলেন ইবরাহীম (আঃ)। (৮৪৫) (আধুনিক প্রকাশনীঃ ৩১০৬, ইসলামিক ফাউন্ডেশনঃ ৩১১৪)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 3355,
			"arabicnumber": 3355,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত যে, লোকজন তাঁর সামনে দাজ্জালের কথা উল্লেখ করেছেন। তার দু’ চোখের মাঝখানে অর্থাৎ কপালে লেখা থাকবে কাফির বা কাফ, ফা, রা। ইবনু ‘আব্বাস (রাঃ) বলেন, এটা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট শুনেনি। বরং তিনি বলেছেন, যদি তোমরা ইবরাহীম (আঃ)-কে দেখতে চাও তবে তোমাদের সাথীর দিকে তাকাও। আর মূসা (আঃ) হলেন কোঁকড়ানো চুল, তামাটে রং-এর দেহ বিশিষ্ট। তিনি এমন একটি লাল উটের উপর বসে আছেন, যার নাকের দড়ি খেজুর গাছের ছাল দিয়ে তৈরী। আমি যেন তাকে দেখতে পাচ্ছি, তিনি আল্লাহু আকবার ধ্বনি দিতে দিতে উপত্যকায় নামছেন। (১৫৫৫) (আধুনিক প্রকাশনীঃ ৩১০৭, ইসলামিক ফাউন্ডেশনঃ ৩১১৫)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 3356,
			"arabicnumber": 3356,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, নবী ইবরাহীম (আঃ) সূত্রধরদের অস্ত্র দিয়ে নিজের খাত্না করেছিলেন যখন তার বয়স ছিল আশি বছর। আব্দুর রহমান ইবনু ইসহাক (রহ.) আবূ যিনাদ (রহ.) থেকে হাদীস বর্ণনায় মুগীরাহ ইবনু ‘আব্দুর রহমান (রহ.)-এর অনুসরণ করেছেন। ‘আজলান (রহ.) আবূ হুরাইরাহ (রাঃ) থেকে হাদীস বর্ণনায় আরজ (রহ.)-এর অনুসরণ করেছেন। আর মুহাম্মাদ ইবনু ‘আমর (রহ.) আবূ সালামাহ (রাঃ) হতে বর্ণনা করেছেন। (৬২৯৮) (মুসলিম ৪৩/৪১ হাঃ ২৩৭০, আহমাদ ৯৪১২) (আধুনিক প্রকাশনীঃ ৩১০৮, ইসলামিক ফাউন্ডেশনঃ ৩১১৬)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 3357,
			"arabicnumber": 3357,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, ইবরাহীম (আঃ) তিনবার ব্যতীত কখনও মিথ্যা বলেননি। (২২১৭)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 3358,
			"arabicnumber": 3358,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, ইবরাহীম (আঃ) তিনবার ছাড়া কখনও মিথ্যা বলেননি। তন্মধ্যে দু’বার ছিল আল্লাহর ব্যাপারে। তার উক্তি ‘‘আমি অসুস্থ’’- (আস্সাফফাতঃ ৮৯) এবং তাঁর অন্য এক উক্তি ‘‘বরং এ কাজ করেছে, এই তো তাদের বড়টি- (আম্বিয়াঃ ৬৩)। বর্ণনাকারী বলেন, একদা তিনি [ইবরাহীম (আঃ)] এবং সারা অত্যাচারী শাসকগণের কোন এক শাসকের এলাকায় এসে পৌঁছলেন। তখন তাকে খবর দেয়া হল যে, এ এলাকায় জনৈক ব্যক্তি এসেছে। তার সঙ্গে একজন সবচেয়ে সুন্দরী মহিলা আছে। তখন সে তাঁর নিকট লোক পাঠাল। সে তাঁকে নারীটি সম্পর্কে জিজ্ঞেস করল, এ নারীটি কে? তিনি উত্তর দিলেন, মহিলাটি আমার বোন। অতঃপর তিনি সারার নিকট আসলেন এবং বললেন, হে সারা! তুমি আর আমি ব্যতীত পৃথিবীর উপর আর কোন মু’মিন নেই। এ লোকটি আমাকে তোমার সম্পর্কে জিজ্ঞেস করেছিল। তখন আমি তাকে জানিয়েছি যে, তুমি আমার বোন। কাজেই তুমি আমাকে মিথ্যা প্রতিপন্ন করো না। অতঃপর সারাকে আনার জন্য লোক পাঠালো। তিনি যখন তার নিকট প্রবেশ করলেন এবং রাজা তাঁর দিকে হাত বাড়ালো তখনই সে পাকড়াও হল। তখন অত্যাচারী রাজা সারাকে বলল, আমার জন্য আল্লাহর নিকট দু‘আ কর, আমি তোমার কোন ক্ষতি করব না। তখন সারা আল্লাহর নিকট দু‘আ করলেন। ফলে সে মুক্তি পেয়ে গেল। অতঃপর দ্বিতীয়বার তাঁকে ধরতে চাইল। এবার সে পূর্বের মত বা তার চেয়ে কঠিনভাবে পাকড়াও হলে। এবারও সে বলল, আল্লাহর নিকট আমার জন্য দু‘আ কর। আমি তোমার কোন ক্ষতি করব না। আবারও তিনি দু‘আ করলেন, ফলে সে মুক্তি পেয়ে গেল। অতঃপর রাজা তার এক দারোয়ানকে ডাকল। সে তাকে বলল, তুমি তো আমার নিকট কোন মানুষ আননি। বরং এনেছ এক শয়তান। অতঃপর রাজা সারার খিদমতের জন্য হাযেরাকে দান করল। অতঃপর তিনি (সারা) তাঁর (ইবরাহীম) নিকট আসলেন, তিনি দাঁড়িয়ে সালাত আদায় করছিলেন। তখন তিনি হাত দ্বারা ইশারা করে সারাকে বললেন, কী ঘটেছে? তখন সারা বললেন, আল্লাহ কাফির বা ফাসিকের চক্রান্ত তারই বুকে ফিরিয়ে দিয়েছেন। আর সে হাযেরাকে খিদমতের জন্য দান করেছে। আবূ হুরাইরাহ (রাঃ) বলেন, হে আকাশের পানির ছেলেরা *! হাযেরাই তোমাদের আদি মাতা। (২২১৭) (মুসলিম ৪৩/৪১ হাঃ ২৩৭১, আহমাদ ৯০৫২) (আধুনিক প্রকাশনীঃ ৩১০৯, ইসলামিক ফাউন্ডেশনঃ ৩১১৭)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 3359,
			"arabicnumber": 3359,
			"text": "উম্মু শারীক (রাঃ) হতে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম গিরগিটি মেরে ফেলার নির্দেশ দিয়েছেন এবং তিনি বলেছেন, ওটা ইবরাহীম (আঃ) যে অগ্নিকুন্ডে নিক্ষিপ্ত হয়েছিলেন তাতে এ গিরগিটি ফুঁ দিয়েছিল। (৩৩০৭) (আধুনিক প্রকাশনীঃ ৩১১০, ইসলামিক ফাউন্ডেশনঃ ৩১১৮)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 3360,
			"arabicnumber": 3360,
			"text": "‘আবদুল্লাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, যখন এ আয়াত অবতীর্ণ হয়ঃ যারা ঈমান এনেছে এবং তারা তাদের ঈমানকে যুলুম দ্বারা কলূষিত করেনি- (আল-আন্‘আম ৮২)। তখন আমরা বললাম, হে আল্লাহর রাসূল! আমাদের মধ্যে কে এমন আছে, যে নিজের উপর জুলুম করেনি? তিনি বললেন, তোমরা যা বলছ ব্যাপারটি তা নয়। বরং তাদের ঈমানকে ‘জুলুম’ অর্থাৎ শির্ক দ্বারা কলূষিত করেনি। তোমরা কি লুকমানের কথা শুননি? তিনি তাঁর পুত্রকে বলেছিলেন, ‘‘হে বৎস! আল্লাহর সঙ্গে কোন রকম শির্ক করো না। নিশ্চয় শির্ক একটা বিরাট জুলুম।’’ (লুকমানঃ ১৩) (৩২) (আধুনিক প্রকাশনীঃ ৩১১১, ইসলামিক ফাউন্ডেশনঃ ৩১১৯)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 3361,
			"arabicnumber": 3361,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, একদিন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সামনে কিছু গোশ্ত আনা হল। তখন তিনি বললেন, নিশ্চয় আল্লাহ কিয়ামতের দিন পূর্ববর্তী ও পরবর্তী সকলকে একই সমতল ময়দানে সমবেত করবেন। তখন আহবানকারী তাদের সকলকে তার ডাক সমানভাবে শুনাতে পারবে এবং তাদের সকলের উপর সমানভাবে দর্শকের দৃষ্টি পড়বে আর সূর্য তাদের অতি নিকটবর্তী হবে। অতঃপর তিনি শাফা‘আতের হাদীস বর্ণনা করলেন যে, সকল মানুষ ইবরাহীম (আঃ)-এর নিকট আসবে এবং বলবে, পৃথিবীতে আপনি আল্লাহর নবী এবং তাঁর খলীল। অতএব আমাদের জন্য আপনি আপনার রবের নিকট সুপারিশ করুন। তখন তিনি ঘুরিয়ে পেচিয়ে বলা কথা স্মরণ করে বলবেন, নাফসী! নাফসী! তোমরা মূসার নিকট যাও। এ রকম হাদীস আনাস (রাঃ)ও নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণনা করেছেন। (৩৩৪০) (আধুনিক প্রকাশনীঃ ৩১১২, ইসলামিক ফাউন্ডেশনঃ ৩১২০)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 3363,
			"arabicnumber": 3363,
			"text": "আনসারী (রহ.) ইবনু জুরাইজ (রহ.) সূত্রে বলেন যে, কাসীর ইবনু কাসীর বলেছেন যে, আমি ও ‘উসমান ইবনু আবূ সুলাইমান (রহ.) সা‘ঈদ ইবনু জুবাইর (রহ.)-এর নিকট উপবিষ্ট ছিলাম। তিনি বললেন, ইবনু ‘আব্বাস (রাঃ) আমাকে এরূপ বলেননি বরং তিনি বলেছেন, ইবরাহীম (আঃ), ইসমাঈল (আঃ) এবং তাঁর মাকে নিয়ে আসলেন। মা তখন তাঁকে দুধ পান করাতেন এবং তাঁর সঙ্গে একটি মশক ছিল। এ অংশটি মারফুরূপে বর্ণনা করেননি। (২৩৬৮) (আধুনিক প্রকাশনীঃ ৩১১৩, ইসলামিক ফাউন্ডেশনঃ ৩১২১)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 3364,
			"arabicnumber": 3364,
			"text": "সা‘ঈদ ইবনু জুবাইর (রহ.) হতে বর্ণিত। ইবনু ‘আব্বাস (রাঃ) বলেন, নারী জাতি সর্বপ্রথম কোমরবন্দ বানানো শিখেছে ইসমাঈল (আঃ)-এর মায়ের নিকট থেকে। হাযেরা (আঃ) কোমরবন্দ লাগাতেন সারাহ (আঃ) থেকে নিজের মর্যাদা গোপন রাখার জন্য। অতঃপর ইবরাহীম (আঃ) হাযেরা (আঃ) এবং তাঁর শিশু ছেলে ইসমাঈল (আঃ)-কে সঙ্গে নিয়ে বের হলেন এ অবস্থায় যে, হাযেরা (আঃ) শিশুকে দুধ পান করাতেন। অবশেষে যেখানে কা‘বার ঘর অবস্থিত, ইবরাহীম (আঃ) তাঁদের উভয়কে সেখানে নিয়ে এসে মসজিদের উঁচু অংশে যমযম কূপের উপরে অবস্থিত একটি বিরাট গাছের নীচে তাদেরকে রাখলেন। তখন মক্কা্য় না ছিল কোন মানুষ, না ছিল কোনরূপ পানির ব্যবস্থা। পরে তিনি তাদেরকে সেখানেই রেখে গেলেন। আর এছাড়া তিনি তাদের নিকট রেখে গেলেন একটি থলের মধ্যে কিছু খেজুর আর একটি মশকে কিছু পরিমাণ পানি। অতঃপর ইবরাহীম (আঃ) ফিরে চললেন। তখন ইসমাঈল (আঃ)-এর মা পিছু পিছু আসলেন এবং বলতে লাগলেন, হে ইবরাহীম! আপনি কোথায় চলে যাচ্ছেন? আমাদেরকে এমন এক ময়দানে রেখে যাচ্ছেন, যেখানে না আছে কোন সাহায্যকারী আর না আছে কোন ব্যবস্থা। তিনি এ কথা তাকে বারবার বললেন। কিন্তু ইবরাহীম (আঃ) তাঁর দিকে তাকালেন না। তখন হাযেরা (আঃ) তাঁকে বললেন, এর আদেশ কি আপনাকে আল্লাহ দিয়েছেন? তিনি বললেন, হাঁ। হাযেরা (আঃ) বললেন, তাহলে আল্লাহ আমাদেরকে ধ্বংস করবেন না। অতঃপর তিনি ফিরে আসলেন। আর ইবরাহীম (আঃ)-ও সামনে চললেন। চলতে চলতে যখন তিনি গিরিপথের বাঁকে পৌঁছলেন, যেখানে স্ত্রী ও সন্তান তাঁকে আর দেখতে পাচ্ছে না, তখন তিনি কা‘বা ঘরের দিকে মুখ করে দাঁড়ালেন। অতঃপর তিনি দু’হাত তুলে এ দু‘আ করলেন, আর বললেন, ‘‘হে আমার প্রতিপালক! আমি আমার পরিবারের কতককে আপনার সম্মানিত ঘরের নিকট এক অনুর্বর উপত্যকায় ...... যাতে আপনার কৃতজ্ঞতা প্রকাশ করে- (ইবরাহীম ৩৭)। আর ইসমাঈলের মা ইসমাঈলকে স্বীয় স্তন্যের দুধ পান করাতেন এবং নিজে ঐ মশক থেকে পানি পান করতেন। অবশেষে মশকে যা পানি ছিল তা ফুরিয়ে গেল। তিনি নিজে তৃষ্ণার্ত হলেন এবং তাঁর শিশু পুত্রটিও তৃষ্ণায় কাতর হয়ে পড়ল। তিনি শিশুটির দিকে দেখতে লাগলেন। তৃষ্ণায় তার বুক ধড়ফড় করছে অথবা রাবী বলেন, সে মাটিতে পড়ে ছটফট করছে। শিশু পুত্রের এ করুণ অবস্থার প্রতি তাকানো অসহনীয় হয়ে পড়ায় তিনি সরে গেলেন আর তাঁর অবস্থানের নিকটবর্তী পর্বত ‘সাফা’-কে একমাত্র তাঁর নিকটতম পর্বত হিসাবে পেলেন। অতঃপর তিনি তার উপর উঠে দাঁড়ালেন এবং ময়দানের দিকে তাকালেন। এদিকে সেদিকে তাকিয়ে দেখলেন, কোথায়ও কাউকে দেখা যায় কিনা? কিন্তু তিনি কাউকে দেখতে পেলেন না। তখন ‘সাফা’ পর্বত থেকে নেমে পড়লেন। এমন কি যখন তিনি নিচু ময়দান পর্যন্ত পৌঁছলেন, তখন তিনি তাঁর কামিজের এক প্রান্ত তুলে ধরে একজন ক্লান্ত-শ্রান্ত মানুষের মত ছুটে চললেন। অবশেষে ময়দান অতিক্রম করে ‘মারওয়া’ পাহাড়ের নিকট এসে তার উপর উঠে দাঁড়ালেন। অতঃপর এদিকে সেদিকে তাকালেন, কাউকে দেখতে পান কিনা? কিন্তু কাউকেই দেখতে পেলেন না। এমনিভাবে সাতবার দৌড়াদৌড়ি করলেন। ইবনু ‘আব্বাস (রাঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, এজন্যই মানুষ এ পর্বতদ্বয়ের মধ্যে সায়ী করে থাকে। অতঃপর তিনি যখন মারওয়া পাহাড়ে উঠলেন, তখন একটি শব্দ শুনতে পেলেন এবং তিনি নিজেকেই নিজে বললেন, একটু অপেক্ষা কর। তিনি মনোযোগ দিয়ে শুনলেন। তখন তিনি বললেন, তুমি তো তোমার শব্দ শুনিয়েছ। যদি তোমার নিকট কোন সাহায্যকারী থাকে। হঠাৎ যেখানে যমযম কূপ অবস্থিত সেখানে তিনি একজন ফেরেশতা দেখতে পেলেন। সেই ফেরেশতা আপন পায়ের গোড়ালি দ্বারা আঘাত করলেন অথবা তিনি বলেছেন, আপন ডানা দ্বারা আঘাত করলেন। ফলে পানি বের হতে লাগল। তখন হাযেরা (আঃ)-এর চারপাশে নিজ হাতে বাঁধ দিয়ে এক হাউজের মত করে দিলেন এবং হাতের কোষভরে তাঁর মশকটিতে পানি ভরতে লাগলেন। তখনো পানি উপচে উঠছিল। ইবনু ‘আব্বাস (রাঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, ইসমাঈলের মাকে আল্লাহ রহম করুন। যদি তিনি বাঁধ না দিয়ে যমযমকে এভাবে ছেড়ে দিতেন কিংবা বলেছেন, যদি কোষে ভরে পানি মশকে জমা না করতেন, তাহলে যমযম একটি কূপ না হয়ে একটি প্রবহমান ঝর্ণায় পরিণত হতো। রাবী বলেন, অতঃপর হাযেরা (আঃ) পানি পান করলেন, আর শিশু পুত্রকেও দুধ পান করালেন, তখন ফেরেশতা তাঁকে বললেন, আপনি ধ্বংসের কোন আশঙ্কা করবেন না। কেননা এখানেই আল্লাহর ঘর রয়েছে। এ শিশুটি এবং তাঁর পিতা দু’জনে মিলে এখানে ঘর নির্মাণ করবে এবং আল্লাহ তাঁর আপনজনকে কখনও ধ্বংস করেন না। ঐ সময় আল্লাহর ঘরের স্থানটি যমীন থেকে টিলার মত উঁচু ছিল। বন্যা আসার ফলে তার ডানে বামে ভেঙ্গে যাচ্ছিল। অতঃপর হাযেরা (আঃ) এভাবেই দিন যাপন করছিলেন। অবশেষে জুরহুম গোত্রের একদল লোক তাদের কাছ দিয়ে অতিক্রম করছিল। অথবা রাবী বলেন, জুরহুম পরিবারের কিছু লোক কাদা নামক উঁচু ভূমির পথ ধরে এদিকে আসছিল। তারা মক্কা্য় নীচু ভূমিতে অবতরণ করল এবং তারা দেখতে পেল একঝাঁক পাখি চক্রাকারে উড়ছে। তখন তারা বলল, নিশ্চয় এ পাখিগুলো পানির উপর উড়ছে। আমরা এ ময়দানের পথ হয়ে বহুবার অতিক্রম করেছি। কিন্তু এখানে কোন পানি ছিল না। তখন তারা একজন কি দু’জন লোক সেখানে পাঠালো। তারা সেখানে গিয়েই পানি দেখতে পেল। তারা সেখান থেকে ফিরে এসে সকলকে পানির সংবাদ দিল। সংবাদ শুনে সবাই সেদিকে অগ্রসর হল। রাবী বলেন, ইসমাঈল (আঃ)-এর মা পানির নিকট ছিলেন। তারা তাঁকে বলল, আমরা আপনার নিকটবর্তী স্থানে বসবাস করতে চাই। আপনি আমাদেরকে অনুমতি দিবেন কি? তিনি জবাব দিলেন, হ্যাঁ। তবে, এ পানির উপর তোমাদের কোন অধিকার থাকবে না। তারা হ্যাঁ, বলে তাদের মত প্রকাশ করল। ইবনু ‘আব্বাস (রাঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, এ ঘটনা ইসমাঈলের মাকে একটি সুযোগ এনে দিল। আর তিনিও মানুষের সাহচর্য চেয়েছিলেন। অতঃপর তারা সেখানে বসতি স্থাপন করল এবং তাদের পরিবার-পরিজনের নিকটও সংবাদ পাঠাল। তারপর তারাও এসে তাদেরও সাথে বসবাস করতে লাগল। পরিশেষে সেখানে তাদেরও কয়েকটি পরিবারের বসতি স্থাপিত হল। আর ইসমাঈলও যৌবনে উপনীত হলেন এবং তাদের থেকে আরবী ভাষা শিখলেন। যৌবনে পৌঁছে তিনি তাদের নিকট অধিক আকর্ষণীয় ও প্রিয়পাত্র হয়ে উঠলেন। অতঃপর যখন তিনি পূর্ণ যৌবন লাভ করলেন, তখন তারা তাঁর সঙ্গে তাদেরই একটি মেয়েকে বিবাহ দিল। এরই মধ্যে ইসমাঈলের মা হাযেরা (আঃ) ইন্তিকাল করেন। ইসমাঈলের বিবাহের পর ইবরাহীম (আঃ) তাঁর পরিত্যক্ত পরিজনের অবস্থা দেখার জন্য এখানে আসলেন। কিন্তু তিনি ইসমাঈলকে পেলেন না। তিনি তাঁর স্ত্রীকে তাঁর সম্বন্ধে জিজ্ঞেস করলেন। স্ত্রী বলল, তিনি আমাদের জীবিকার খোঁজে বেরিয়ে গেছেন। অতঃপর তিনি পুত্রবধূকে তাদের জীবন যাত্রা এবং অবস্থা সম্বন্ধে জিজ্ঞেস করলেন। সে বলল, আমরা অতি দূরবস্থায়, অতি টানাটানি ও খুব কষ্টে আছি। সে ইবরাহীম (আঃ)-এর নিকট তাদের দুর্দশার অভিযোগ করল। তিনি বললেন, তোমার স্বামী বাড়ী আসলে, তাকে আমার সালাম জানিয়ে বলবে, সে যেন তার ঘরের দরজার চৌকাঠ বদলিয়ে নেয়। অতঃপর যখন ইসমাঈল বাড়ী আসলেন, তখন তিনি যেন কিছুটা আভাস পেলেন। তখন তিনি তাঁর স্ত্রীকে জিজ্ঞেস করলেন, তোমাদের নিকট কেউ কি এসেছিল? স্ত্রী বলল, হাঁ। এমন এমন আকৃতির একজন বৃদ্ধ লোক এসেছিলেন এবং আমাকে আপনার সম্বন্ধে জিজ্ঞেস করেছিলেন। আমি তাঁকে আপনার সংবাদ দিলাম। তিনি আমাকে আমাদের জীবন যাত্রা সম্পর্কে জিজ্ঞেস করলেন, আমি তাঁকে জানালাম, আমরা খুব কষ্ট ও অভাবে আছি। ইসমাঈল (আঃ) জিজ্ঞেস করলেন, তিনি কি তোমাকে কোন নাসীহাত করেছেন? স্ত্রী বলল, হাঁ। তিনি আমাকে নির্দেশ দিয়েছেন, আমি যেন আপনাকে তাঁর সালাম পৌঁছাই এবং তিনি আরো বলেছেন, আপনি যেন আপনার ঘরের দরজার চৌকাঠ বদলিয়ে ফেলেন। ইসমাঈল (আঃ) বললেন, ইনি আমার পিতা। এ কথা দ্বারা তিনি আমাকে নির্দেশ দিয়ে গেছেন, আমি যেন তোমাকে পৃথক করে দেই। অতএব তুমি তোমার আপন জনদের নিকট চলে যাও। এ কথা বলে, ইসমাঈল (আঃ) তাকে তালাক দিয়ে দিলেন এবং ঐ লোকদের থেকে অন্য একটি মেয়েকে বিবাহ করলেন। অতঃপর ইবরাহীম (আঃ) এদের থেকে দূরে রইলেন, আল্লাহ যতদিন চাইলেন। অতঃপর তিনি আবার এদের দেখতে আসলেন। কিন্তু এবারও তিনি ইসমাঈল (আঃ)-এর দেখা পেলেন না। তিনি পুত্রবধূর নিকট উপস্থিত হলেন এবং তাঁকে ইসমাঈল (আঃ) সম্পর্কে জিজ্ঞেস করলেন। সে বলল, তিনি আমাদের খাবারের খোঁজে বেরিয়ে গেছেন। ইবরাহীম (আঃ) জিজ্ঞেস করলেন, তোমরা কেমন আছ? তিনি তাদের জীবন যাপন ও অবস্থা জানতে চাইলেন। তখন সে বলল, আমরা ভাল এবং স্বচ্ছল অবস্থায় আছি। আর সে আল্লাহর প্রশংসাও করল। ইবরাহীম (আঃ) জিজ্ঞেস করলেন, তোমাদের প্রধান খাদ্য কী? সে বলল, গোশ্ত। তিনি আবার জানতে চাইলেন, তোমাদের পানীয় কী? সে বলল, পানি। ইবরাহীম (আঃ) দু‘আ করলেন, হে আল্লাহ! তাদের গোশ্ত ও পানিতে বরকত দিন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, ঐ সময় তাদের সেখানে খাদ্যশস্য উৎপাদন হতো না। যদি হতো তাহলে ইবরাহীম (আঃ) সে বিষয়েও তাদের জন্য দু‘আ করতেন। বর্ণনাকারী বলেন, মক্কা ছাড়া অন্য কোথাও কেউ শুধু গোশ্ত ও পানি দ্বারা জীবন ধারণ করতে পারে না। কেননা, শুধু গোশ্ত ও পানি জীবন যাপনের অনুকূল হতে পারে না। ইবরাহীম (আঃ) বললেন, যখন তোমার স্বামী ফিরে আসবে, তখন তাঁকে সালাম বলবে, আর তাঁকে আমার পক্ষ থেকে হুকুম করবে যে, সে যেন তার ঘরের দরজার চৌকাঠ ঠিক রাখে। অতঃপর ইসমাঈল (আঃ) যখন ফিরে আসলেন, তখন তিনি বললেন, তোমাদের নিকট কেউ এসেছিলেন কি? সে বলল, হাঁ। একজন সুন্দর চেহারার বৃদ্ধ লোক এসেছিলেন এবং সে তাঁর প্রশংসা করল, তিনি আমাকে আপনার ব্যাপারে জিজ্ঞেস করেছেন। আমি তাঁকে আপনার সংবাদ জানিয়েছি। অতঃপর তিনি আমার নিকট আমাদের জীবন যাপন সম্পর্কে জানতে চেয়েছেন। আমি তাঁকে জানিয়েছি যে, আমরা ভাল আছি। ইসমাঈল (আঃ) বললেন, তিনি কি তোমাকে আর কোন কিছুর জন্য আদেশ করেছেন? সে বলল, হাঁ। তিনি আপনার প্রতি সালাম জানিয়ে আপনাকে নির্দেশ দিয়েছেন যে, আপনি যেন আপনার ঘরের চৌকাঠ ঠিক রাখেন। ইসমাঈল (আঃ) বললেন, ইনিই আমার পিতা। আর তুমি হলে আমার ঘরের দরজার চৌকাঠ। এ কথার দ্বারা তিনি আমাকে নির্দেশ দিয়েছেন, আমি যেন তোমাকে স্ত্রী হিসাবে বহাল রাখি। অতঃপর ইবরাহীম (আঃ) এদের থেকে দূরে রইলেন, যদ্দিন আল্লাহ চাইলেন। অতঃপর তিনি আবার আসলেন। (দেখতে পেলেন) যমযম কূপের নিকটস্থ একটি বিরাট বৃক্ষের নীচে বসে ইসমাঈল (আঃ) তাঁর একটি তীর মেরামত করছেন। যখন তিনি তাঁর পিতাকে দেখতে পেলেন, তিনি দাঁড়িয়ে তাঁর দিকে এগিয়ে গেলেন। অতঃপর একজন বাপ-বেটার সঙ্গে, একজন বেটা-বাপের সঙ্গে সাক্ষাৎ হলে যেমন করে থাকে তাঁরা উভয়ে তাই করলেন। অতঃপর ইবরাহীম (আঃ) বললেন, হে ইসমাঈল! আল্লাহ আমাকে একটি কাজের নির্দেশ দিয়েছেন। ইসমাঈল (আঃ) বললেন, আপনার রব! আপনাকে যা আদেশ করেছেন, তা করুন। ইবরাহীম (&আ) বললেন, তুমি আমার সাহায্য করবে কি? ইসমাঈল (আঃ) বললেন, আমি আপনার সাহায্য করব। ইবরাহীম (আঃ) বললেন, আল্লাহ আমাকে এখানে একটি ঘর বানাতে নির্দেশ দিয়েছেন। এই বলে তিনি উঁচু টিলাটির দিকে ইশারা করলেন যে, এর চারপাশে ঘেরাও দিয়ে। তখনি তাঁরা উভয়ে কা‘বা ঘরের দেয়াল তুলতে লেগে গেলেন। ইসমাঈল (আঃ) পাথর আনতেন, আর ইবরাহীম (আঃ) নির্মাণ করতেন। পরিশেষে যখন দেয়াল উঁচু হয়ে গেল, তখন ইসমাঈল (আঃ) (মাকামে ইবরাহীম নামে খ্যাত) পাথরটি আনলেন এবং ইবরাহীম (আঃ)-এর জন্য তা যথাস্থানে রাখলেন। ইবরাহীম (আঃ) তার উপর দাঁড়িয়ে নির্মাণ কাজ করতে লাগলেন। আর ইসমাঈল (আঃ) তাঁকে পাথর যোগান দিতে থাকেন। তখন তারা উভয়ে এ দু‘আ করতে থাকলেন, হে আমাদে রব! আমাদের থেকে কবূল করুন। নিশ্চয়ই আপনি সব কিছু শুনেন ও জানেন। তাঁরা উভয়ে আবার কা‘বা ঘর তৈরী করতে থাকেন এবং কা‘বা ঘরের চারদিকে ঘুরে ঘুরে এ দু‘আ করতে থাকেন। ‘‘হে আমাদের রব! আমাদের থেকে কবূল করে নিন। নিশ্চয়ই আপনি সব কিছু শুনেন ও জানেন।’’ (আল-বাকারাহঃ ১২৭) (২৩৬৮) (আধুনিক প্রকাশনীঃ ৩১১৪, ইসলামিক ফাউন্ডেশনঃ ৩১২২)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 3365,
			"arabicnumber": 3365,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, যখন ইবরাহীম (আঃ) ও তাঁর স্ত্রী (সারার) মাঝে যা হবার হয়ে গেল, তখন ইবরাহীম (আঃ) (শিশুপুত্র) ইসমাঈল এবং তার মাকে নিয়ে বের হলেন। তাদের সঙ্গে একটি থলে ছিল, যাতে পানি ছিল। ইসমাঈল (আঃ)-এর মা মশক হতে পানি পান করতেন। ফলে শিশুর জন্য তাঁর স্তনে দুধ বাড়তে থাকে। অবশেষে ইবরাহীম (আঃ) মক্কায় পৌঁছে হাযেরাকে একটি বিরাট গাছের নীচে থাকার ব্যবস্থা করে দিলেন। অতঃপর ইবরাহীম (আঃ) আপন পরিবারের (সারার) নিকট ফিরে চললেন। তখন ইসমাঈল (আঃ)-এর মা কিছু দূর পর্যন্ত তাঁর অনুসরণ করলেন। অবশেষে যখন কাদা নামক স্থানে পৌঁছলেন, তখন তিনি পিছন হতে ডেকে বললেন, হে ইবরাহীম! আপনি আমাদেরকে কার নিকট রেখে যাচ্ছেন? ইবরাহীম (আঃ) বললেন, আল্লাহর কাছে। হাযেরা (আঃ) বললেন, আমি আল্লাহর প্রতি সন্তুষ্ট। রাবী বলেন, অতঃপর হাযেরা (আঃ) ফিরে আসলেন, তিনি মশক হতে পানি পান করতেন আর শিশুর জন্য দুধ বাড়ত। অবশেষে যখন পানি শেষ হয়ে গেল। তখন ইসমাঈল (আঃ)-এর মা বললেন, আমি যদি গিয়ে এদিকে সেদিকে তাকাতাম! তাহলে হয়ত কোন মানুষ দেখতে পেতাম। রাবী বলেন, অতঃপর ইসমাঈল (আঃ)-এর মা গেলেন এবং সাফা পাহাড়ে উঠলেন আর এদিকে ওদিকে তাকালেন এবং কাউকে দেখেন কিনা এজন্য বিশেষভাবে তাকিয়ে দেখলেন। কিন্তু কাউকেও দেখতে পেলেন না। তখন দ্রুত বেগে মারওয়া পাহাড়ে এসে গেলেন এবং এভাবে তিনি কয়েক চক্কর দিলেন। পুনরায় তিনি বললেন, যদি গিয়ে দেখতাম যে, শিশুটি কী করছে। অতঃপর তিনি গেলেন এবং দেখতে পেলেন যে, সে তার অবস্থায়ই আছে। সে যেন মরণাপন্ন হয়ে গেছে। এতে তাঁর মন স্বস্তি পাচ্ছিল না। তখন তিনি বললেন, যদি সেখানে যেতাম এবং এদিকে সেদিকে তাকিয়ে দেখতাম। সম্ভবতঃ কাউকে দেখতে পেতাম। অতঃপর তিনি গেলেন, সাফা পাহাড়ের উপর উঠলেন এবং এদিকে সেদিক দেখলেন এবং গভীরভাবে তাকিয়ে দেখলেন। কিন্তু কাউকে দেখতে পেলেন না। এমনকি তিনি সাতটি চক্কর পূর্ণ করলেন। তখন তিনি বললেন, যদি যেতাম তখন দেখতাম যে সে কী করছে। হঠাৎ তিনি একটি শব্দ শুনতে পেলেন। অতঃপর তিনি মনে মনে বললেন, যদি আপনার কোন সাহায্য করার থাকে তবে আমাকে সাহায্য করুন। হঠাৎ তিনি জিবরাঈল (আঃ)-কে দেখতে পেলেন। রাবী বলেন, তখন তিনি (জিবরাঈল) তাঁর পায়ের গোড়ালি দ্বারা এরূপ করলেন অর্থাৎ গোড়ালি দ্বারা জমিনের উপর আঘাত করলেন। রাবী বলেন, তখনই পানি বেরিয়ে আসল। এ দেখে ইসমাঈল (আঃ)-এর মা অস্থির হয়ে গেলেন এবং গর্ত খুঁড়তে লাগলেন। রাবী বলেন, এ প্রসঙ্গে আবুল কাসিম [রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম] বলেছেন, হাযেরা (আঃ) যদি একে তার অবস্থার উপর ছেড়ে দিতেন তাহলে পানি বিস্তৃত হয়ে যেত। রাবী বলেন, তখন হাযেরা (আঃ) পানি পান করতে লাগলেন এবং তাঁর সন্তানের জন্য তাঁর দুধ বাড়তে থাকে। রাবী বলেন, অতঃপর জুরহুম গোত্রের একদল লোক উপত্যকার নীচু ভূমি দিয়ে অতিক্রম করছিল। হঠাৎ তারা দেখল কিছু পাখি উড়ছে। তারা যেন তা বিশ্বাসই করতে পারছিল না আর তারা বলতে লাগল এসব পাখি তো পানি ব্যতীত কোথাও থাকতে পারে না। তখন তারা সেখানে তাদের একজন দূত পাঠাল। সে সেখানে গিয়ে দেখল, সেখানে পানি মাওজুদ আছে। তখন সে তার দলের লোকদের নিকট ফিরে আসল এবং তাদেরকে সংবাদ দিল। অতঃপর তারা হাযেরা (আঃ)-এর নিকট এসে বলল, হে ইসমাঈলের মা। আপনি কি আমাদেরকে আপনার নিকট থাকা অথবা (রাবী বলেছেন), আপনার নিকট বসবাস করার অনুমতি দিবেন? [হাযেরা (আঃ) তাদেরকে বসবাসের অনুমতি দিলেন এবং এভাবে অনেক দিন কেটে গেল]। অতঃপর তাঁর ছেলে বয়ঃপ্রাপ্ত হল। তখন তিনি (ইসমাঈল) জুরহুম গোত্রেরই একটি মেয়েকে বিয়ে করলেন। রাবী বলেন, পুনরায় ইবরাহীম (আঃ)-এর মনে জাগল তখন তিনি তাঁর স্ত্রীকে (সারাহ) বললেন, আমি আমার পরিত্যক্ত পরিজনের অবস্থা সম্পর্কে খবর নিতে চাই। রাবী বলেন, অতঃপর তিনি আসলেন এবং সালাম দিলেন। তিনি জিজ্ঞেস করলেন, ইসমাঈল কোথায়? ইসমাঈল (আঃ)-এর স্ত্রী বলল, তিনি শিকারে গিয়েছেন। ইবরাহীম (আঃ) বললেন, সে যখন আসবে তখন তুমি তাকে আমার এ নির্দেশের কথা বলবে, ‘‘তুমি তোমার ঘরের চৌকাঠখানা বদলিয়ে ফেলবে’’। ইসমাঈল (আঃ) যখন আসলেন, তখন স্ত্রী তাঁকে খবরটি জানালেন, তখন তিনি স্ত্রীকে বললেন, তুমি সেই চৌকাঠ। অতএব তুমি তোমার পিতামাতার নিকট চলে যাও। রাবী বলেন, অতঃপর ইবরাহীম (আঃ)-এর আবার মনে পড়ল। তখন তিনি তাঁর স্ত্রী (সারাহ)-কে বললেন, আমি আমার নির্বাসিত পরিবারের খবর নিতে চাই। অতঃপর তিনি সেখানে আসলেন এবং জিজ্ঞেস করলেন, ইসমাঈল কোথায়? ইসমাঈল (আঃ)-এর স্ত্রী বলল, তিনি শিকারে গিয়েছেন। পুত্রবধু তাঁকে বললেন, আপনি কি আমাদের এখানে অবস্থান করবেন না? কিছু পানাহার করবেন না? তখন ইবরাহীম (আঃ) বললেন, তোমাদের খাদ্য এবং পানীয় কি? স্ত্রী বলল, আমাদের খাদ্য হল গোশ্ত আর পানীয় হল পানি। তখন ইবরাহীম (আঃ) দু‘আ করলেন, ‘‘হে আল্লাহ! তাদের খাদ্য এবং পানীয় দ্রব্যের মধ্যে বরকত দিন’’। রাবী বলেন, আবুল কাসিম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, ইবরাহীম (আঃ)-এর দু‘আর কারণেই বরকত রয়েছে। রাবী বলেন, আবার কিছুদিন পর ইবরাহীম (আঃ)-এর মনে তাঁর নির্বাসিত পরিজনের কথা জাগল। তখন তিনি তাঁর স্ত্রী (সারাহ)-কে বললেন, আমি আমার পরিত্যক্ত পরিজনের খবর নিতে চাই। অতঃপর তিনি এলেন এবং ইসমাঈলের দেখা পেলেন, তিনি যমযম কূপের পিছনে বসে তাঁর একটি তীর মেরামত করছেন। তখন ইবরাহীম (আঃ) ডেকে বললেন, হে ইসমাঈল! তোমার রব তাঁর জন্য একখানা ঘর নির্মাণ করতে আমাকে নির্দেশ দিয়েছেন। ইসমাঈল (আঃ) বললেন, আপনার রবের নির্দেশ পালন করুন। ইবরাহীম (আঃ) বললেন, তিনি আমাকে এও নির্দেশ দিয়েছেন যে, তুমি যেন আমাকে এ বিষয়ে সহায়তা কর। ইসমাঈল (আঃ) বললেন, তাহলে আমি তা করব অথবা তিনি অনুরূপ কিছু বলেছিলেন। অতঃপর উভয়ে উঠে দাঁড়ালেন। ইবরাহীম (আঃ) ইমারত বানাতে লাগলেন আর ইসমাঈল (আঃ) তাঁকে পাথর এনে দিতে লাগলেন আর তাঁরা উভয়ে এ দু‘আ করছিলেন, হে আমাদের রব! আপনি আমাদের এ কাজ কবূল করুন। আপনি তো সব কিছু শুনেন এবং জানেন। রাবী বলেন, এরই মধ্যে প্রাচীর উঁচু হয়ে গেল আর বৃদ্ধ ইবরাহীম (আঃ) এতটা উঠতে দুর্বল হয়ে পড়লেন। তখন তিনি (মাকামে ইবরাহীমের) পাথরের উপর দাঁড়ালেন। ইসমাঈল তাঁকে পাথর এগিয়ে দিতে লাগলেন আর উভয়ে এ দু‘আ পড়তে লাগলেন, হে আমাদের রব! আপনি আমাদের এ কাজটুকু কবূল করুন। সিঃসন্দেহে আপনি সবকিছু শুনেন ও জানেন- (আল-বাকারাহঃ ১২৭)। (২৩৬৮) (আধুনিক প্রকাশনীঃ ৩১১৫, ইসলামিক ফাউন্ডেশনঃ ৩১২৩)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 3366,
			"arabicnumber": 3366,
			"text": "আবূ যার (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি বললাম, হে আল্লাহর রাসূল! পৃথিবীতে সর্বপ্রথম কোন মাসজিদ তৈরী করা হয়েছে? তিনি বললেন, মসজিদে হারাম। আমি বললাম, অতঃপর কোনটি? তিনি বললেন, মসজিদে আকসা। আমি বললাম, উভয় মসজিদের (তৈরীর) মাঝে কত ব্যবধান ছিল? তিনি বললেন, চল্লিশ বছর। অতঃপর তোমার যেখানেই সালাতের সময় হবে, সেখানেই সালাত আদায় করে নিবে। কেননা এর মধ্যে ফযীলত নিহিত রয়েছে। (৩৪২৫) (আধুনিক প্রকাশনীঃ ৩১১৬, ইসলামিক ফাউন্ডেশনঃ ৩১২৪)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 3367,
			"arabicnumber": 3367,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। ওহুদ পর্বত রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর দৃষ্টিগোচর হলো। তিনি বললেন, এ পর্বত আমাদের ভালবাসে আর আমরাও তাকে ভালবাসি। হে আল্লাহ! ইবরাহীম (আঃ) মক্কাকে হারাম ঘোষণা করেছেন আর আমি হারাম ঘোষণা করছি এর দুই প্রান্তের মধ্যবর্তী স্থানকে (মদিনাকে)। এ হাদীসটি ‘আবদুল্লাহ ইবনু যায়দ (রাঃ)-ও নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেছেন। (৩৭১) (আধুনিক প্রকাশনীঃ ৩১১৭, ইসলামিক ফাউন্ডেশনঃ ৩১২৫)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 3368,
			"arabicnumber": 3368,
			"text": "নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর স্ত্রী ‘আয়িশাহ (রাঃ) হতে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম [আয়িশা (রাঃ)-কে বলেছেন, তুমি কি জান তোমার কাউম যখন কা’বা ঘর নির্মাণ করেছে, তখন তারা ইবরাহীম (আঃ)-এর ভিত্তি হতে তা ছোট করেছে? তখন আমি বললাম, হে আল্লাহর রাসূল! আপনি কি তা ইবরাহীম (আঃ)-এর ভিত্তির উপর পুনর্নির্মাণ করবেন না? তিনি বললেন, যদি তোমার কাওম কুফরী হতে অল্পকাল আগে আগত না হতো। ‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) বললেন, যদি ‘আয়িশাহ (রাঃ) এ হাদীসটি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে শুনে থাকেন, তবে আমি মনে করি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হাতীমে কা’বার সংলগ্ন দু’টি কোণকে চুমু দেয়া একমাত্র এ কারণে পরিহার করেছেন যে, কা’বার ঘর ইবরাহীম (আঃ)-এর ভিত্তির উপর পুরাপুরি নির্মাণ করা হয়নি। রাবী ইসমাঈল (রহ.) বলেন, ইবনু আবূ বাকর হলেন, আব্দুল্লাহ ইবনু মুহাম্মাদ ইবনু আবূ বাকর। (১২৬) (আধুনিক প্রকাশনীঃ ৩১১৮, ইসলামিক ফাউন্ডেশনঃ ৩১২৬)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 3369,
			"arabicnumber": 3369,
			"text": "আবূ হুমাইদ সা‘ঈদী (রাঃ) হতে বর্ণিত। সাহাবীগণ বললেন, হে আল্লাহর রাসূল! আমরা কিভাবে আপনার উপর দরূদ পাঠ করব? তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, এভাবে পড়বে, হে আল্লাহ! (আল্লা-হুম্মা সাল্লি ‘আলা মুহাম্মাদিউওয়া ‘আযওয়াজিহি ওয়া যুররিয়্যাতিহি কামা সাল্লাইতা ‘আলা আলি ইবরাহীমা, ওয়া বারিক ‘আলা মুহাম্মাদিউওয়া ‘ আযওয়াজিহি ওয়া যুররিয়্যাতিহি কামা বা-রাক্তা ‘আলা আ-লি ইব্রাহীমা ইন্নাকা হামীদুম মাজীদ) আপনি মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর উপর, তাঁর স্ত্রীগণের উপর এবং তাঁর বংশধরদের উপর রহমত নাযিল করুন, যেরূপ আপনি রহমত নাযিল করেছেন ইবরাহীম (আঃ)-এর বংশধরদের উপর। আর আপনি মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর উপর, তাঁর স্ত্রীগণের উপর এবং তাঁর বংশধরগণের উপর এমনিভাবে বরকত নাযিল করুন যেমনি আপনি বরকত নাযিল করেছেন ইবরাহীম (আঃ)-এর বংশধরদের উপর। নিশ্চয় আপনি অতি প্রশংসিত এবং অত্যন্ত মর্যাদার অধিকারী। (৬৩৬০) (মুসলিম৩/১৭ , আহমাদ ২৩৬৬১) (আধুনিক প্রকাশনীঃ ৩১১৯, ইসলামিক ফাউন্ডেশনঃ ৩১২৭)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 3370,
			"arabicnumber": 3370,
			"text": "‘আবদুর রহমান ইবনু আবূ লাইলা (রহ.) হতে বর্ণিত। তিনি বলেন, কা‘ব ইবনু উজরা (রাঃ) আমার সঙ্গে দেখা করে বললেন, আমি কি আপনাকে এমন একটি হাদিয়া দেব না যা আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে শুনেছি? আমি বললাম, হাঁ, আপনি আমাকে সে হাদিয়া দিন। তিনি বললেন, আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে জিজ্ঞেস করলাম, হে আল্লাহর রাসূল! আপনাদের উপর অর্থাৎ আহলে বাইতের উপর কিভাবে দরূদ পাঠ করতে হবে? কেননা, আল্লাহ তো (কেবল) আমাদেরকে জানিয়ে দিয়েছেন, আমরা কিভাবে আপনার উপর সালাম করব। তিনি বললেন, তোমরা এভাবে বল, ‘‘হে আল্লাহ! আপনি মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর উপর এবং মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর বংশধরদের উপর রহমত বর্ষণ করুন, যেরূপ আপনি ইবরাহীম (আঃ) এবং তাঁর বংশধরদের উপর রহমত বর্ষণ করেছেন। নিশ্চয়ই আপনি অতি প্রশংসিত, অত্যন্ত মর্যাদার অধিকারী। হে আল্লাহ! মুহাম্মাদ এবং মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর বংশধরদের উপর তেমনি বরকত দান করুন যেমনি আপনি বরকত দান করেছেন ইবরাহীম (আঃ) এবং ইবরাহীম (আঃ)-এর বংশধরদের উপর। নিশ্চয়ই আপনি অতি প্রশংসিত, অতি মর্যাদার অধিকারী। (৪৭৯৭, ৬৩৫৭) (মুসলিম ৩/১৭ হাঃ ৪০৬, আহমাদ ১৮১৫৬) (আধুনিক প্রকাশনীঃ ৩১২০, ইসলামিক ফাউন্ডেশনঃ ৩১২৮)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 3371,
			"arabicnumber": 3371,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হাসান এবং হুসাইন (রাঃ)-এর জন্য নিম্নোক্ত দু‘আ পড়ে পানাহ চাইতেন আর বলতেন, তোমাদের পিতা ইবরাহীম (আঃ) ইসমাঈল ও ইসহাক (আঃ)-এর জন্য দু‘আ পড়ে পানাহ চাইতেন। আমি আল্লাহর পরিপূর্ণ কালিমার দ্বারা প্রত্যেক শয়তান, বিষাক্ত প্রাণী এবং প্রত্যেক কুদৃষ্টির অনিষ্ট হতে পানাহ চাচ্ছি। (আধুনিক প্রকাশনীঃ ৩১২১, ইসলামিক ফাউন্ডেশনঃ ৩১২৯)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 3372,
			"arabicnumber": 3372,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, ইবরাহীম (আঃ) তাঁর অন্তরের প্রশান্তির জন্য মৃতকে কিভাবে জীবিত করা হবে, এ সম্পর্কে আল্লাহর নিকট জিজ্ঞেস করেছিলেন, (সন্দেহবশত নয়) যদি ‘‘সন্দেহ’’ বলে অভিহিত করা হয় তবে এরূপ ‘‘সন্দেহ’’ এর ব্যাপারে আমরা ইবরাহীম (আঃ)-এর চেয়ে অধিক উপযোগী। যখন ইবরাহীম (আঃ) বলেছিলেন, হে আমার প্রতিপালক! আমাকে দেখিয়ে দিন, আপনি কিভাবে মৃতকে জীবিত করেন। আল্লাহ বললেন, তুমি কি বিশ্বাস কর না? তিনি বললেন, হাঁ। তা সত্ত্বেও যাতে আমার অন্তর প্রশান্তি লাভ করে- (আল-বাকারাহঃ ২৬০)। অতঃপর [নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম লূত (আঃ)-এর ঘটনা উল্লেখ করে বললেন।) আল্লাহ লূত (আঃ)-এর প্রতি রহম করুন। তিনি একটি সুদৃঢ় খুঁটির আশ্রয় চেয়েছিলেন আর আমি যদি কারাগারে এত দীর্ঘ সময় থাকতাম যত দীর্ঘ সময় ইউসুফ (আঃ) কারাগারে ছিলেন তবে তার (বাদশাহর) ডাকে সাড়া দিতাম।১ (৩৩৭৫, ৩৩৮৭, ৪৫৩৭, ৪৬৯৪, ৬৯৯২) (মুসলিম ১/৬৯ হাঃ ১৫১, আহমাদ ৮৩৩৬) (আধুনিক প্রকাশনীঃ ৩১২২, ইসলামিক ফাউন্ডেশনঃ ৩১৩০)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 3373,
			"arabicnumber": 3373,
			"text": "সালামাহ ইবনু আকওয়া‘ (রাঃ) হতে বর্ণিত। তিনি বলেন, একদা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আসলাম গোত্রের একদল লোকের কাছ দিয়ে অতিক্রম করছিলেন। এ সময় তারা তীরন্দাজীর প্রতিযোগিতা করছিল। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, হে বনী ইসমাঈল! তোমরা তীরন্দাজী করে দাও। কেননা তোমাদের পূর্বপুরুষ তীরন্দাজ ছিলেন। সুতরাং তোমরাও তীরন্দাজী করে যাও আর আমি অমুক গোত্রের লোকদের সঙ্গে আছি। রাবী বলেন, তাদের এক পক্ষ হাত চালনা হতে বিরত হয়ে গেল। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তোমাদের কী হল, তোমরা যে তীরন্দাজী করছ না? তখন তারা বলল, হে আল্লাহর রাসূল! আমরা কিভাবে তীর ছুঁড়তে পারি, অথচ আপনি তো তাদের সঙ্গে রয়েছেন। তখন তিনি বললেন, তোমরা তীর ছুঁড়তে থাক, আমি তোমাদের সবার সঙ্গেই আছি। (২৮৯৯) (আধুনিক প্রকাশনীঃ ৩১২৩, ইসলামিক ফাউন্ডেশনঃ ৩১৩১)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 3374,
			"arabicnumber": 3374,
			"text": "بَابُ قِصَّةِ إِسْحَاقَ بْنِ إِبْرَاهِيْمَ عَلَيْهِمَا السَّلَام ৬০/১৩ অধ্যায় : নবী ইসহাক ইবনু ইবরাহীম (আঃ)-এর ঘটনা। فِيْهِ ابْنُ عُمَرَ وَأَبُوْ هُرَيْرَةَ عَنْ النَّبِيِّ صلى الله عليه وسلم এ সম্পর্কে ইবনু ‘উমার ও আবূ হুরাইরাহ (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে হাদীস বর্ণনা করেছেন। ৩৩৭৪. আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে জিজ্ঞেস করা হল যে, লোকদের মধ্যে অধিক সম্মানিত ব্যক্তি কে? তিনি বললেন, তাদের মধ্যে যে সবচেয়ে অধিক আল্লাহ ভীরু, সে সবচেয়ে অধিক সম্মানিত। সাহাবাগণ বললেন, হে আল্লাহর নবী! আমরা আপনাকে এ সম্পর্কে জিজ্ঞেস করিনি। তিনি বললেন, তা হলে সবচেয়ে সম্মানিত ব্যক্তি হলেন আল্লাহর নবী ইউসুফ ইবনু আল্লাহর নবী (ইয়াকুব) ইবনু আল্লাহর নবী (ইসহাক) ইবনু আল্লাহর খালীল ইবরাহীম (আঃ)। তাঁরা বললেন, আমরা এ সম্পর্কেও জিজ্ঞেস করিনি। তিনি বললেন, তবে কি তোমরা আমাকে আরবদের উচ্চ বংশ সম্পর্কে জিজ্ঞেস করছ? তারা বলল, হাঁ। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, জাহিলিয়াতের যুগে তোমাদের মধ্যে যারা সবচেয়ে উত্তম ব্যক্তি ছিলেন ইসলাম গ্রহণের পরও তারাই সবচেয়ে উত্তম ব্যক্তি, যদি তাঁরা ইসলামের জ্ঞান অর্জন করে থাকেন। (৩৩৫৩) (আধুনিক প্রকাশনীঃ ৩১২৪, ইসলামিক ফাউন্ডেশনঃ ৩১৩২)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 3375,
			"arabicnumber": 3375,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, আল্লাহ লূত (আঃ)-কে মাফ করুন। তিনি একটি মজবুত খুঁটির আশ্রয় চেয়েছিলেন। (৩৩৭২) (আধুনিক প্রকাশনীঃ ৩১২৫, ইসলামিক ফাউন্ডেশনঃ ৩১৩৩)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 3376,
			"arabicnumber": 3376,
			"text": "بِرُكْنِهِ بِمَنْ مَعَهُ لِأَنَّهُمْ قُوَّتُهُ تَرْكَنُوْا تَمِيْلُوْا فَأَنْكَرَهُمْ وِ نَكِرَهُمْ وَاسْتَنْكَرَهُمْ وَاحِدٌ يُهْرَعُوْنَ يُسْرِعُوْنَ دَابِرٌ آخِرٌ صَيْحَةٌ هَلَكَةٌ لِلْمُتَوَسِّمِيْنَ لِلنَّاظِرِيْنَ لَبِسَبِيْلٍ لَبِطَرِيْقٍ أَنْكَرَهُمْ - نَكِرَهُمْ - اسْتَنْكَرَهُمْ একই অর্থে ব্যবহৃত يُهْرَعُوْنَ অর্থ দ্রুত চলল دَابِرٌ অর্থ শেষ صَيْحَةٌ অর্থ ধ্বংস لِلْمُتَوَسِّمِيْنَ অর্থ প্রত্যক্ষকারীদের জন্য لَبِسَبِيْلٍ অর্থ রাস্তার। ৩৩৭৬. ‘আবদুল্লাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম فَهَلْ مِنْ مُدَّكِرٍ পড়েছেন। (৩৩৪১) (আধুনিক প্রকাশনীঃ ৩১২৬, ইসলামিক ফাউন্ডেশনঃ ৩১৩৪)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 3377,
			"arabicnumber": 3377,
			"text": "الْحِجْرُ مَوْضِعُ ثَمُوْدَ وَأَمَّا حَرْثٌ حِجْرٌ حَرَامٌ وَكُلُّ مَمْنُوعٍ فَهُوَ حِجْرٌ مَحْجُوْرٌ وَالْحِجْرُ كُلُّ بِنَاءٍ بَنَيْتَهُ وَمَا حَجَرْتَ عَلَيْهِ مِنْ الأَرْضِ فَهُوَ حِجْرٌ وَمِنْهُ سُمِّيَ حَطِيْمُ الْبَيْتِ حِجْرًا كَأَنَّهُ مُشْتَقٌّ مِنْ مَحْطُومٍ مِثْلُ قَتِيْلٍ مِنْ مَقْتُوْلٍ وَيُقَالُ لِلْأُنْثَى مِنْ الْخَيْلِ الْحِجْرُ وَيُقَالُ لِلْعَقْلِ حِجْرٌ وَحِجًى وَأَمَّا حَجْرُ الْيَمَامَةِ فَهُوَ مَنْزِلٌ الْحِجْرُ হিজর সামূদ সম্প্রদায়ের বসবাসের স্থান। حَرْثٌ حِجْرٌ অর্থ নিষিদ্ধ ক্ষেত। প্রত্যেক নিষিদ্ধ বস্তুকে حِجْرٌ বলা হয়। আর এ অর্থেই مَحْجُوْرٌ বলা হয়ে থাকে। الْحِجْرُ তুমি যে সব ভবন নির্মাণ কর। তুমি যমীনের যে অংশ ঘেরাও করে রাখ তাও حِجْرٌ। এ কারণেই হাতীমে কা‘বাকে حِجْرٌ নামে অভিহিত করা হয়। তা যেন حَطِيْمُ শব্দটি مَحْطُوم অর্থে ব্যবহৃত যেমন قَتِيْلٍ শব্দটি مَقْتُوْل অর্থে ব্যবহৃত। ঘোটকীকেও حِجْرٌ বলা হয়। আর বুদ্ধি-বিবেকের অর্থে حِجْرٌ وَحِجًى বলা হয়। তবে حَجْرُ الْيَمَامَةِ একটি স্থানের নাম। ৩৩৭৭. ‘আবদুল্লাহ ইবনু যাম‘আহ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে শুনেছি এবং তিনি যে লোক [সালিহ (আঃ)-এর] উটনী কেটেছিলেন তার উল্লেখ করেছেন। তিনি বলেছেন, উটনীকে হত্যা করার জন্য এমন এক লোক (কিদার) তৈরী হয়েছিল যে তার গোত্রের ভিতর প্রভাবশালী ও শক্তিশালী ছিল, যেমন ছিল আবূ যাম‘আহ। (৪৯৪২, ৫২০৪, ৬০৪২) (আধুনিক প্রকাশনীঃ ৩১২৭, ইসলামিক ফাউন্ডেশনঃ ৩১৩৫)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 3378,
			"arabicnumber": 3378,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাবুকের যুদ্ধের সময় যখন হিজর নামক স্থানে অবতরণ করলেন, তখন তিনি সাহাবীগণকে নির্দেশ করলেন, তাঁরা যেন এখানের কূপের পানি পান না করে এবং মশকেও পানি না ভরে। তখন সাহাবীগণ বললেন, আমরা তো এর পানি দ্বারা রুটির আটা গুলে ফেলেছি এবং পানিও ভরে রেখেছি। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদেরকে সেই গুলানো আটা ফেলে দেয়ার এবং পানি ঢেলে দেয়ার নির্দেশ দিলেন। সাবরা ইবনু মা‘বাদ এবং আবুশ শামূস (রহ.) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খাদ্য ফেলে দেয়ার নির্দেশ দিয়েছেন আর আবূ যার (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেছেন, এর পানি দ্বারা যে আটা গুলেছে (তা ফেলে দেয়ার নির্দেশ দিয়েছেন)। (৩৩৭৯) (মুসলিম ৫৩/১ হাঃ ২৯৮১) (আধুনিক প্রকাশনীঃ ৩১২৮, ইসলামিক ফাউন্ডেশনঃ ৩১৩৬)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 3379,
			"arabicnumber": 3379,
			"text": "‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, সাহাবীগণ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে সামূদ জাতির আবাসস্থল ‘হিজর’ নামক স্থানে অবতরণ করলেন আর তখন তারা এর কূপের পানি মশকে ভরে রাখলেন এবং এ পানি দ্বারা আটা গুলে নিলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদেরকে হুকুম দিলেন, তারা ঐ কূপ হতে যে পানি ভরে রেখেছে, তা যেন ফেলে দেয় আর পানিতে গুলা আটা যেন উটগুলোকে খাওয়ায় আর তিনি তাদের আদেশ করলেন তারা যেন ঐ কূপ হতে মশক ভরে যেখান হতে [সালিহ (আঃ)]-এর উটনীটি পানি পান করত। উসামাহ (রহ.) নাফি (রহ.) হতে হাদীস বর্ণনায় ‘উবাইদুল্লাহ (রহ.)-এর অনুসরণ করেছেন। (৩৩৭৮) (আধুনিক প্রকাশনীঃ ৩১২৯, ইসলামিক ফাউন্ডেশনঃ ৩১৩৭)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 3380,
			"arabicnumber": 3380,
			"text": "‘আবদুল্লাহ (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন ‘হিজ্র’ নামক স্থান অতিক্রম করলেন, তখন তিনি বললেন, তোমরা এমন লোকদের আবাস স্থল প্রবেশ করো না যারা নিজেরাই নিজেদের উপর জুলুম করেছে। প্রবেশ করলে, ক্রন্দনরত অবস্থায়, যেন তাদের প্রতি যে বিপদ এসেছিল তোমাদের প্রতি সে রকম বিপদ না আসে। অতঃপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বাহনের উপর আরোহী অবস্থায় নিজ চাদর দিয়ে চেহারা ঢেকে নিলেন। (৪৩৩) (আধুনিক প্রকাশনীঃ ৩১৩০, ইসলামিক ফাউন্ডেশনঃ ৩১৩৮)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 3381,
			"arabicnumber": 3381,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নির্দেশ দিয়েছেন, তোমরা একমাত্র ক্রন্দনরত অবস্থায়ই এমন লোকদের আবাসস্থলে প্রবেশ করবে যারা নিজেরাই নিজেদের উপর জুলুম করেছে। তাদের উপর যে মুসিবত আপতিত হয়েছিল তোমাদের উপরও যেন সে মুসিবত না আসে। (৪৩৩) (আধুনিক প্রকাশনীঃ ৩১৩১, ইসলামিক ফাউন্ডেশনঃ ৩১৩৯)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 3382,
			"arabicnumber": 3382,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, সম্মানী ব্যক্তি- যিনি সম্মানী ব্যক্তির সন্তান, যিনি সম্মানী ব্যক্তির সন্তান, যিনি সম্মানী ব্যক্তির সন্তান। তিনি হলেন, ইউসুফ ইবনু ইয়া‘কূব ইবনু ইসহাক ইবনু ইবরাহীম (আলাইহিমুস সালাম)। (৩৩৯০, ৪৬৮৮) (আধুনিক প্রকাশনীঃ ৩১৩২, ইসলামিক ফাউন্ডেশনঃ ৩১৪০)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 3383,
			"arabicnumber": 3383,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে জিজ্ঞেস করা হয়েছিল, মানুষের মধ্যে সর্বাপেক্ষা সম্মানিত ব্যক্তি কে? তিনি উত্তর দিলেন, তাদের মধ্যে যে আল্লাহকে সবচেয়ে অধিক ভয় করে। তারা বললেন, আমরা আপনাকে এ বিষয়ে জিজ্ঞেস করিনি। তিনি বললেন, তাহলে মানুষের মধ্যে সর্বাধিক সম্মানিত ব্যক্তি হলেন, আল্লাহর নবী ইউসুফ ইবনু আল্লাহর নবী ইবনু আল্লাহর নবী ইবনু আল্লাহর খালিল (আঃ)। তাঁরা বললেন, আমরা আপনাকে এ বিষয়েও জিজ্ঞেস করিনি। তখন তিনি বললেন, তাহলে তোমরা আমার নিকট আরবের খণি অর্থাৎ গোত্রগুলোর সম্পর্কে জিজ্ঞেস করেছ? (তাহলে শুন) মানুষ খণি বিশেষ, জাহিলিয়্যাতের যুগে যারা তাদের মধ্যে সর্বোত্তম ব্যক্তি ছিল, ইসলামেও তারা সর্বোত্তম ব্যক্তি, যদি তারা ইসলামী জ্ঞান লাভ করে। (৩৩৫৩) (আধুনিক প্রকাশনীঃ ৩১৩৩, ইসলামিক ফাউন্ডেশনঃ ৩১৪১) আবূ হুরাইরাহ (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এ রকমই বর্ণনা করেছেন। (আধুনিক প্রকাশনীঃ ৩১৩৩ এর শেষাংশ, ইসলামিক ফাউন্ডেশনঃ ৩১৪২)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 3384,
			"arabicnumber": 3384,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে বলেছেন, আবূ বাকর (রাঃ)-কে বল, তিনি যেন লোকদের সালাতে ইমামতি করেন। ‘আয়িশাহ (রাঃ) বললেন, তিনি একজন কোমল হৃদয়ের লোক। যখন আপনার জায়গায় তিনি দাঁড়াবেন, তখন সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বিগলিত অন্তর হয়ে পড়বেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পুনরায় একই কথা করলেন, ‘আয়িশাহ (রাঃ) আবারও সেই উত্তর দিলেন, শু‘বাহ (রহ.) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তৃতীয় অথবা চতুর্থবার বললেন, [হে ‘আয়িশাহ]! তোমরা ইউসুফ (আঃ)-এর ঘটনার নিন্দাকারী নারীদের মত। আবূ বাকরকে বল (তিনি যেন লোকদেও সালাতে ইমামতি করেন)। (১৯৮) (আধুনিক প্রকাশনীঃ ৩১৩৪, ইসলামিক ফাউন্ডেশনঃ ৩১৪৩)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 3385,
			"arabicnumber": 3385,
			"text": "আবূ মূসা (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন রোগাক্রান্ত হয়ে পড়লেন, তখন তিনি বললেন, আবূ বাকরকে বল, তিনি যেন লোকদের সালাত আদায় করিয়ে দেন। তখন ‘আয়িশাহ (রাঃ) বললেন, আবূ বাকর (রাঃ) তো এ রকম লোক। অতঃপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অনুরূপ বললেন, তখন ‘আয়িশাহ (রাঃ) ও ঐরূপই বললেন, তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আবূ বাকরকে বল। হে আয়িশা! নিশ্চয় তোমরা ইউসুফ (আঃ)-এর ঘটনার নিন্দাকারী নারীদের মত হয়ে গেছ। অতঃপর আবূ বাকর (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর জীবদ্দশায় ইমামত করলেন। বর্ণনাকারী হুসাইন (রহ.) যায়িদা (রহ.) হতে বর্ণনা করেছেন, এখানে رَجُلٌ كَذَا এর স্থলে رَجُلٌ رَقِيْقٌ আছে অর্থাৎ তিনি একজন কোমল হৃদয়ের লোক। (৬৭৮) (আধুনিক প্রকাশনীঃ ৩১৩৫, ইসলামিক ফাউন্ডেশনঃ ৩১৪৪)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 3386,
			"arabicnumber": 3386,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দু‘আ করেছেন, হে আল্লাহ! আয়্যাশ ইবনু আবূ রবী‘আকে মুক্তি দিন। হে আল্লাহ! সালাম ইবনু হিশামকে নাজাত দিন। হে আল্লাহ! ওয়ালীদ ইবনু ওয়ালীদকে নাজাত দিন। হে আল্লাহ! দুর্বল মুমিনদেরকে মুক্তি দিন। হে আল্লাহ! মুযার গোত্রকে শক্তভাবে পাকড়াও করুন। হে আল্লাহ! এ গোত্রের উপর এমন দুর্ভিক্ষ ও অনটন নাযিল করুন যেমন দুর্ভিক্ষ ইউসুফ (আঃ)-এর যামানায় হয়েছিল। (আধুনিক প্রকাশনীঃ ৩১৩৬, ইসলামিক ফাউন্ডেশনঃ ৩১৪৫)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 3387,
			"arabicnumber": 3387,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, আল্লাহ লূত (আঃ)-এর উপর রহম করুন। তিনি একটি সুদৃঢ় খুঁটির আশ্রয় নিয়েছিলেন আর ইউসুফ (আঃ) যত দীর্ঘ সময় জেলখানায় কাটিয়েছেন, আমি যদি অত দীর্ঘ সময় কারাগারে কাটাতাম এবং পরে রাজদূত আমার নিকট আসত তবে নিশ্চয়ই আমি তার ডাকে সাড়া দিতাম। (৩৩৭২) (আধুনিক প্রকাশনীঃ ৩১৩৭, ইসলামিক ফাউন্ডেশনঃ ৩১৪৬)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 3388,
			"arabicnumber": 3388,
			"text": "মাসরূক (রহ.) হতে বর্ণিত। তিনি বলেন, আমি ‘আয়িশাহ (রাঃ)-এর মা উম্মু রুমানার নিকট আয়িশাহর বিষয়ে যে সব মিথ্যা অপবাদের কথা বলাবলি হচ্ছিল সে সম্পর্কে জিজ্ঞেস করলাম। তিনি বললেন, আমি আয়িশার সঙ্গে একত্রে উপবিষ্ট ছিলাম। এমন সময় একজন আনসারী মহিলা এ কথা বলতে বলতে আমাদের নিকট প্রবেশ করল। আল্লাহ অমুককে শাস্তি দিক। আর শাস্তি তো দিয়েছেন। এ কথা শুনে উম্মু রুমানা (রাঃ) বললেন, আমি জিজ্ঞেস করলাম এ কথা বলার কারণ কী? সে মহিলাটি বলল, ঐ লোকটিই তো কথাটির চর্চা করছে। তখন ‘আয়িশাহ (রাঃ) জিজ্ঞেস করলেন, কোন কথাটির? অতঃপর সে ‘আয়িশাহ (রাঃ)-কে বিষয়টি জানিয়ে দিল। ‘আয়িশাহ (রাঃ) জিজ্ঞেস করলেন, বিষয়টি কি আবূ বাকর (রাঃ) এবং রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-ও শুনেছেন? সে বলল, হাঁ! এতে ‘আয়িশাহ (রাঃ) বেহুশ হয়ে পড়ে গেলেন। পরে তাঁর হুশ ফিরে আসল তবে তাঁর শরীর কাঁপিয়ে জ্বর আসল। অতঃপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এসে জিজ্ঞেস করলেন, তার কী হল? আমি বললাম, তাঁর সম্পর্কে যা কিছু রটেছে তাতে সে (মনে) আঘাত পেয়েছে ফলে সে জ্বরে আক্রান্ত হয়েছে। এ সময় ‘আয়িশাহ (রাঃ) উঠে বসলেন, আর বলতে লাগলেন, আল্লাহর কসম, আমি যদি কসম খেয়ে বলি তবুও আপনারা আমাকে বিশ্বাস করবেন না আর যদি উযর পেশ করি তাও আপনারা আমার উযর শুনবেন না। অতএব এখন আমার ও আপনাদের উপমা হল ইয়াকুব (আঃ) এবং তাঁর ছেলেদের মতো। আপনারা যা বর্ণনা করেছেন সে বিষয়ে একমাত্র আল্লাহর নিকটই সাহায্য চাওয়া হল। অতঃপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফিরে চলে গেলেন এবং আল্লাহ যা নাযিল করার তা নাযিল করলেন। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এসে ‘আয়িশাহ (রাঃ)-কে এ খবর জানালেন। ‘আয়িশাহ (রাঃ) বললেন, আমি একমাত্র আল্লাহরই প্রশংসা করব অন্য কারো প্রশংসা নয়। (৪১৪৩, ৪৬৯১, ৪৭৫১) (আধুনিক প্রকাশনীঃ ৩১৩৮, ইসলামিক ফাউন্ডেশনঃ ৩১৪৭)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 3389,
			"arabicnumber": 3389,
			"text": "‘উরওয়াহ ইবনু যুবাইর (রাঃ) হতে বর্ণিত। তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সহধর্মিণী ‘আয়িশাহ (রাঃ)-কে জিজ্ঞেস করলেন আল্লাহ তা‘আলার বাণীঃ كُذِبُوْا حَتَّى إِذَا اسْتَيْأَسَ الرُّسُلُ وَظَنُّوْا أَنَّهُمْ قَدْ আয়াতাংশের মধ্যে كُذِّبُوْا হবে, না كُذِبُوْا হবে? (যাল হরফে তাশদীদ সহ পড়তে হবে না তাশদীদ ব্যতীত)? ‘আয়িশাহ (রাঃ) বলেন, (এখানে كُذِبُوْا নয়, كُذِّبُوْا হবে) কেননা, তাঁদের কাওম তাঁদেরকে মিথ্যাচারী বলেছিল। [‘উরওয়াহ (রহ.) বলেন] আমি বললাম, মহান আল্লাহর কসম, রাসূলগণের দৃঢ় প্রত্যয় ছিল যে, তাঁদের কাওম তাদেরকে মিথ্যাচারী বলেছে, আর তাতো সন্দেহের বিষয় ছিল না। (কাজেই, এখানে كُذِّبُوْ হবে কিভাবে?) তখন ‘আয়িশাহ (রাঃ) বলেন, হে ‘উরাইয়াহ! এ ব্যাপারে তাদের তো দৃঢ় বিশ্বাস ছিল। [‘উরওয়াহ (রহ.) বলেন] আমি বললাম, সম্ভবতঃ এখানে كُذِبُوْا হবে। ‘আয়িশাহ (রাঃ) বললেন, মা‘আযাল্লাহ! রাসূলগণ কখনো আল্লাহ সম্পর্কে এরূপ ধারণা করতেন না। (অর্থাৎ كُذِبُوْا হলে অর্থ দাঁড়ায়, আল্লাহ তা‘আলা রাসূলগণের সঙ্গে মিথ্যা বলেছেন। অথচ রাসূলগণ কখনো এরূপ ধারণা করতে পার না।) তবে এ আয়াত সম্পর্কে ‘আয়িশাহ (রাঃ) বলেন, তারা রাসূলগণের অনুসারী যারা আল্লাহর প্রতি ঈমান এনেছেন এবং রাসূলগণকে বিশ্বাস করেছেন। তাঁদের উপর পরীক্ষা দীর্ঘায়িত হয়। তাঁদের প্রতি সাহায্য পৌঁছতে বিলম্ব হয়। অবশেষে রাসূলগণ যখন তাঁদের কাওমের লোকদের মধ্যে যারা তাঁদেরকে মিথ্যা মনে করেছে, তাদের ঈমান আনার ব্যাপারে নিরাশ হয়ে গেলেন এবং তাঁরা এ ধারণা করতে লাগলেন যে, তাঁদের অনুসারীগণও তাঁদেরকে মিথ্যাচারী মনে করবেন, ঠিক এ সময়ই মহান আল্লাহর সাহায্য পৌঁছে গেল। استَيْأَسُوْا শব্দটি استَفْعَلُوْا এর ওজনে এসেছে। يئست منه হতে নিষ্পন্ন হয়েছে। অর্থাৎ তারা ইউসুফ (আঃ) হতে নিরাশ হয়ে গেছে। لَا تَيْأَسُوْا مِنْ رَوْحِ اللهِ এর অর্থ তোমরা আল্লাহর রহমত হতে নিরাশ হয়ো না। (৩৫২৫, ৪৬৯৫, ৪৬৯৬) (আধুনিক প্রকাশনীঃ ৩১৩৯, ইসলামিক ফাউন্ডেশনঃ ৩১৪৮)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 3390,
			"arabicnumber": 3390,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, সম্মানিত ব্যক্তি- যিনি সম্মানিত ব্যক্তির সন্তান, যিনি সম্মানিত ব্যক্তির সন্তান, যিনি সম্মানিত ব্যক্তির সন্তান, তিনি হলেন ইউসুফ ইবনু ইয়াকুব ইবনু ইসহাক ইবনু ইবরাহীম (আঃ)। (৩৩৮২) (আধুনিক প্রকাশনীঃ ৩১৪০, ইসলামিক ফাউন্ডেশনঃ ৩১৪৯)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 3391,
			"arabicnumber": 3391,
			"text": "ارْكُضْ اضْرِبْ يَرْكُضُوْنَ يَعْدُوْنَ (ارْكُضْ অর্থ আঘাত কর। يَرْكُضُوْنَ অর্থ দ্রুত বলে) ৩৩৯১. আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, একদা আইয়ুব (আঃ) নগ্ন শরীরে গোসল করছিলেন। এমন সময় তাঁর উপর স্বর্ণের এক ঝাঁক পঙ্গপাল পতিত হল। তিনি সেগুলো দু’হাতে ধরে কাপড়ে রাখতে লাগলেন। তখন তাঁর রব তাঁকে ডেকে বললেন, হে আইয়ুব! তুমি যা দেখতে পাচ্ছ, তা থেকে কি আমি তোমাকে অমুখাপেক্ষী করে দেইনি? তিনি উত্তর দিলেন, হাঁ, হে রব! কিন্তু আমি আপনার বরকত থেকে মুখাপেক্ষীহীন নই। (২৭৯) (আধুনিক প্রকাশনীঃ ৩১৪১, ইসলামিক ফাউন্ডেশনঃ ৩১৫০)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 3392,
			"arabicnumber": 3392,
			"text": "يُقَالُ لِلْوَاحِدِ وَللْاثْنَيْنِ وَالْجَمِيْعِ نَجِيٌّ وَيُقَالُ خَلَصُوْا نَجِيًّا اعْتَزَلُوْا نَجِيًّا وَالْجَمِيْعُ أَنْجِيَةٌ يَتَنَاجَوْنَ . تَلَقَّفُ : تَلَقَّمُ وَقَالَ رَجُلٌ مُّؤْمِنٌ مِّنْ اٰلِ فِرْعَوْنَ يَكْتُمُ إِيْمَنَهُ إلى قوله - مَنْ هُوَ مُسْرِفٌ كَذَّابٌ (غافر : 28) একবচন দ্বিবচন ও বহুবচনের ক্ষেত্রেও نَجِيٌّ বলা হয়। خَلَصُوْا نَجِيًّا অর্থ অন্তরঙ্গ আলাপে নির্জনতা অবলম্বন করা। এর বহুবচন أَنْجِيَةٌ ব্যবহৃত হয়। يَتَنَاجَوْنَ পরস্পর অন্তরঙ্গ আলাপ করে। تَلَقَّفُ অর্থ গ্রাস করে। (আল্লাহ তা‘আলার বাণী) ‘‘ফির‘আউন গোত্রের এক মু’মিন ব্যক্তি যে তার ঈমান গোপন রাখত .. .. . নিশ্চয়ই আল্লাহ সীমালঙ্ঘনকারী মিথ্যাবাদীকে পথ প্রদর্শন করেন না।’’ (গাফিরঃ ২৮) ৩৩৯২. ‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খাদীজাহ (রাঃ)-এর নিকট ফিরে আসলেন তাঁর হৃদয় কাঁপছিল। তখন খাদীজাহ (রাঃ) তাঁকে নিয়ে ওয়ারাকা ইবনু নাওফলের নিকট গেলেন। তিনি খৃস্টান ধর্ম অবলম্বন করেছিলেন। তিনি আরবী ভাষায় ইঞ্জিল পাঠ করতেন। ওয়ারাকা জিজ্ঞেস করলেন, আপনি কী দেখেছেন? নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে সব ঘটনা জানালেন। তখন ওয়ারাকা বললেন, এতো সেই নামুস যাঁকে আল্লাহ তা‘আলা মূসা (আঃ)-এর নিকট নাযিল করেছিলেন। আপনার সে সময় যদি আমি পাই, তবে সর্বশক্তি দিয়ে আমি আপনাকে সাহায্য করব। নামূস অর্থ গোপন তত্ত্ব ও তথ্যবাহী যাকে কেউ কোন বিষয়ে খবর দেয় আর সে তা অপর হতে গোপন রাখে। (৩) (আধুনিক প্রকাশনীঃ ৩১,৪২ ইসলামিক ফাউন্ডেশনঃ ৩১৫১)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 3393,
			"arabicnumber": 3393,
			"text": "وَهَلْ أَتٰكَ حَدِيْثُ مُوْسٰٓى إِذْ رَاٰى نَارًا إِلَى قَوْلِهِ بِالْوَادِ الْمُقَدَّسِ طُوًى আপনার নিকট কি মূসার বৃত্তান্ত পৌঁছেছে? তিনি যখন আগুন দেখলেন....‘তুমি ‘তুয়া’ নামক এক পবিত্র ময়দানে রয়েছ। (ত্ব-হা ৯-১৩) اٰنَسْتُ أَبْصَرْتُ نَارًا لَّعَلِّيْ اٰتِيْكُمْ مِّنْهَا بِقَبَسٍ الْآيَةَ قَالَ ابْنُ عَبَّاسٍ الْمُقَدَّسُ الْمُبَارَكُ طُوًى اسْمُ الْوَادِيْ سِيْرَتَهَا حَالَتَهَا وَ النُّهٰى التُّقَى بِمَلْكِنَا بِأَمْرِنَا هَوٰى شَقِيَ فَارِغًا إِلَّا مِنْ ذِكْرِ مُوْسَى رِدْءًا كَيْ يُصَدِّقَنِيْ وَيُقَالُ مُغِيْثًا أَوْ مُعِيْنًا يَبْطُشُ وَ يَبْطِشُ يَأْتَمِرُوْنَ يَتَشَاوَرُوْنَ وَالْجِذْوَةُ قِطْعَةٌ غَلِيْظَةٌ مِنْ الْخَشَبِ لَيْسَ فِيْهَا لَهَبٌ سَنَشُدُّ سَنُعِيْنُكَ كُلَّمَا عَزَّزْتَ شَيْئًا فَقَدْ جَعَلْتَ لَهُ عَضُدًا وَقَالَ غَيْرُهُ كُلَّمَا لَمْ يَنْطِقْ بِحَرْفٍ أَوْ فِيْهِ تَمْتَمَةٌ أَوْ فَأْفَأَةٌ فَهِيَ عُقْدَةٌ أَزْرِي ظَهْرِيْ فَيُسْحِتَكُمْ فَيُهْلِكَكُمْ الْمُثْلٰى تَأْنِيْثُ الأَمْثَلِ يَقُوْلُ بِدِيْنِكُمْ يُقَالُ خُذْ الْمُثْلَى خُذْ الأَمْثَلَ ثُمَّ ائْتُوْا صَفًّا (طه : 64) يُقَالُ هَلْ أَتَيْتَ الصَّفَّ الْيَوْمَ يَعْنِي الْمُصَلَّى الَّذِيْ يُصَلَّى فِيْهِ فَأَوْجَسَ أَضْمَرَ خَوْفًا فَذَهَبَتْ الْوَاوُ مِنْ خِيْفَةً لِكَسْرَةِ الْخَاءِ فِيْ جُذُوعِ النَّخْلِ عَلَى جُذُوعِ خَطْبُكَ بَالُكَ مِسَاسَ مَصْدَرُ مَاسَّهُ مِسَاسًا لَنَنْسِفَنَّهُ لَنُذْرِيَنَّهُ الضَّحَآءُ الْحَرُّ قُصِّيهِ اتَّبِعِيْ أَثَرَهُ وَقَدْ يَكُوْنُ أَنْ تَقُصَّ الْكَلَامَ نَحْنُ نَقُصُّ عَلَيْكَ عَنْ جُنُبٍ عَنْ بُعْدٍ وَعَنْ جَنَابَةٍ وَعَنْ اجْتِنَابٍ وَاحِدٌ قَالَ مُجَاهِدٌ عَلٰى قَدَرٍ مَوْعِدٌ لَا تَنِيَا مَكَانًا سُوًي : مَنْصَفُ بَيْنَهُمْ .لَا تَضْعُفَا يَبَسًا : يَابِسَا مِنْ زِيْنَةِ الْقَوْمِ الْحُلِيِّ الَّذِيْ اسْتَعَارُوْا مِنْ آلِ فِرْعَوْنَ فَقَذَفْتُهَا أَلْقَيْتَهَا أَلْقَى صَنَعَ فَنَسِيَ مُوْسٰى هُمْ يَقُوْلُوْنَهُ أَخْطَأَ الرَّبَّ أَنْ لَا يَرْجِعَ إِلَيْهِمْ قَوْلًا فِي الْعِجْلِ آنَسْتُ অর্থ আমি আগুন দেখেছি। সম্ভবতঃ আমি তোমাদের জন্য তা হতে কিছু জ্বলন্ত আগুন আনতে পারব... (ত্বোয়া-হা ১০) ইবনু ‘আব্বাস (রাঃ) বলেন, الْمُقَدَّسُ অর্থ বরকতময়। طُوًى একটি উপত্যকার নাম। سِيْرَتَهَا অর্থ তার অবস্থায়। النُّهَى অর্থ আল্লাহভীরু। بِمَلْكِنَا অর্থ আমাদের ইচ্ছামত هَوَى অর্থ ভাগ্যাহত হয়েছে। فَارِغًا অর্থ মূসার স্মরণ ব্যতীত সব কিছু থেকে শুনা হয়ে গেল। رِدْءًا অর্থ সাহায্যকারী রূপে যেন সে আমাকে সমর্থন করে। এর অর্থ আরো বলা হয় আর্তনাদে সাড়াদানকারী বা সাহায্যকারী। يَبْطُشُ ويَبْطِشُ একই অর্থ উভয় কিরাআতে। يَأْتَمِرُوْنَ অর্থ পরস্পর পরামর্শ করা। درأً অর্থ সাহায্য করা। বলা হয় اردأته على صنعته অর্থাৎ আমি তার কাজে সাহায্য করেছি। الْجِذْوَةُ কাঠের বড় টুকরার অঙ্গার যাতে কোন শিখা। سَنَشُدُّ অর্থ অচিরেই আমি তোমার সাহায্য করব। বলা হয় যখন তুমি কারো সাহায্য করবে তখন তুমি যেন তার পার্শ্বদেশ হয়ে গেলে। এবং অন্যান্যগণ বলেন যে কোন অক্ষর উচ্চারণ করতে পারেনা অথবা তার মুখ হতে তা, তা, ফা, ফা উচ্চারিত হয় তাকেই তোতলামি বলে। أَزْرِيْ অর্থ আমার পিঠ فَيُسْحِتَكُمْ অর্থ- সে তোমাদেরকে ধ্বংস করে দেবে। الْمُثْلَى শব্দটি امْثَلِ শব্দের স্ত্রী লিঙ্গ। আয়াতে উল্লিখিত بِدِيْنِكُمْ -অর্থ তোমাদের দ্বীন। বলা হয়, خُذْ الْمُثْلَى خُذْ الأَمْثَلَ অর্থ-উত্তমটি গ্রহণ করো। ثُمَّ ائْتُوْا صَفًّا অর্থাৎ তোমরা সারিবদ্ধ হয়ে এসো। বলা হয়, তুমি কি আজ ছফ্ফে উপস্থিত হয়েছিলে অর্থাৎ যেখানে নামায পড়া হয় সেখানে? فَأَوْجَسَ অর্থ- সে অন্তরে ভয় পোষণ করেছে। خِيْفَةً মূলে خَاءِ অক্ষরে যের হবার কারণে ياء-واو তে পরিবর্তিত হয়েছে। فِيْ جُذُوعِ النَّخْلِ এখানে على- فيঅর্থে ব্যবহৃত হয়েছে। خَطْبُكَ অর্থ- তোমার অবস্থা। مِسَاسَ শব্দটি مَاسَّهُ مِسَاسًا এর মাসদার। অর্থ-তোমার অবস্থা। لَنَنْسِفَنَّهُ অর্থ-আমি অবশ্যই তাকে উড়িয়ে দিব। الضَّحَاءُ অর্থ পূর্বাহ্ন, যখন সূর্যের উষ্ণতা বেড়ে যায়। قُصِّيهِ তুমি তার পিছনে পিছনে যাও। কখনো এ অর্থেও ব্যবহৃত হয় যে, তুমি তোমার কথা বলো যেমন, نَحْنُ نَقُصُّ عَلَيْكَ এর মধ্যে এ অর্থ ব্যবহৃত হয়েছে। عَنْ جُنُبٍ অর্থ-দূর থেকে। اجْتِنَابٍ -جَنَابَةٍ একই অর্থে ব্যবহৃত হয়। আর মুজাহিদ (রহ.) বলেন, عَلَى قَدَرٍ অর্থ-নির্ধারিত সময়ে। لَا تَنِيَا অর্থ দুর্বল হয়োনা। َمكَانًا سَوِيْ অর্থ-তাদের মধ্যবর্তী স্থান। يَبَسًا অর্থ-শুক্না। مِنْ زِيْنَةِ الْقَوْمِ অর্থ-যে সব অলংকার তারা ফির‘আউনের লোকদের হতে ধার নিয়েছিল। فَقَذَفْتُهَا অর্থ-আমি তা নিক্ষেপ করলাম। أَلْقَى অর্থ বানালো। فَنَسِيَ مُوْسَى অর্থ-তারা বল্তে লাগ্লো, মূসা রবের তালাশে ভুল পথে গিয়েছে। أَنْ لَا يَرْجِعَ إِلَيْهِمْ قَوْلًا অর্থ-তাদের কোন কথার প্রতি উত্তর সে দেয় না- এ আয়াতাংশ সামেরীর বাছূর সম্পর্কে অবতীর্ণ হয়েছে ৩৩৯৩. মালিক ইবনু সা‘সাআ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মিরাজ রাত্রির ঘটনা বর্ণনা করতে গিয়ে তাঁদের নিকট এও বলেন, তিনি যখন পঞ্চম আকাশে এসে পৌঁছলেন, তখন হঠাৎ সেখানে হারূন (আঃ)-এর সঙ্গে সাক্ষাৎ হল। জিবরাঈল (আঃ) বললেন, ইনি হলেন, হারূন (আঃ) তাঁকে সালাম করুন তখন আমি তাঁকে সালাম করলাম। তিনি সালামের জবাব দিয়ে বললেন, মারহাবা পুণ্যবান ভাই ও পুণ্যবান নবী। সাবিত এবং ‘আববাদ ইবনু আবূ ‘আলী (রহ.) আনাস (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে হাদীস বর্ণনায় ক্বাতাদাহ (রহ.)-এর অনুসরণ করেছেন। (৩২০৭) (আধুনিক প্রকাশনীঃ ৩১৪৩, ইসলামিক ফাউন্ডেশনঃ ৩১৫২)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 3394,
			"arabicnumber": 3394,
			"text": "بَابُ وَقَالَ رَجُلٌ مُّؤْمِنٌ مِّنْ اٰلِ فِرْعَوْنَ يَكْتُمُ إِيْمَانَهُ إِلَى قَوْلِهِ مُسْرِفٌ كَذَّابٌ (غافر : 28) ৬০/২৩. অধ্যায় : ‘‘ফির‘আউন গোত্রের এক মু’মিন ব্যক্তি যে তার ঈমান গোপন রাখত, ... ...। নিশ্চয়ই আল্লাহ সীমালঙ্ঘনকারী মিথ্যাবাদীকে পথ প্রদর্শন করেন না।’’ (গাফির/আল-মু’মিনঃ ২৮)১ وَهَلْ أَتَاكَ حَدِيْثُ مُوْسٰى (طه : 9) وَكَلَّمَ اللهُ مُوْسٰى تَكْلِيُمًا (النساء : 164) হে মুহাম্মাদ! আপনার নিকট কি মূসার বৃত্তান্ত পৌঁছেছে? (ত্বা-হা ৯) আর আল্লাহ্ মূসার সঙ্গে সাক্ষাতে কথাবার্তা বলেছেন। (আন-নিসাঃ ১৬৪) ৩৩৯৪. আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যে রাতে আমার মি‘রাজ হয়েছিল, সে রাতে আমি মূসা (আঃ)-কে দেখতে পেয়েছি। তিনি হলেন, হালকা পাতলা দেহের অধিকারী ব্যক্তি তাঁর চুল কোঁকড়ানো ছিল না। মনে হচ্ছিল তিনি যে ইয়ামান দেশীয় শানূআ গোত্রের জনৈক ব্যক্তি, আর আমি ‘ঈসা (আঃ)-কে দেখতে পেয়েছি। তিনি হলেন মধ্যম দেহবিশিষ্ট, গায়ের রং ছিল লাল। যেন তিনি এক্ষুণি গোসলখানা হতে বের হলেন। আর ইব্রাহীম (আঃ)-এর বংশধরদের মধ্যে তাঁর সঙ্গে আমার চেহারার মিল সবচেয়ে বেশি। অতঃপর আমার সম্মুখে দু’টি পেয়ালা আনা হল। তার একটিতে ছিল দুধ আর অপরটিতে ছিল শরাব। তখন জিব্রাঈল (আঃ) বললেন, এ দু’টির মধ্যে যেটি চান আপনি পান করতে পারেন। আমি দুধের পেয়ালাটি নিলাম এবং তা পান করলাম। তখন বলা হল, আপনি স্বভাব প্রকৃতিকে বেছে নিয়েছেন। দেখুন, আপনি যদি শরাব নিয়ে নিতেন, তাহলে আপনার উম্মাতগণ পথভ্রষ্ট হয়ে যেত। (৩৪৩৭, ৪৭০৯, ৫৫৭৬, ৫৬০৩) (আধুনিক প্রকাশনীঃ ৩১৪৪, ইসলামিক ফাউন্ডেশনঃ ৩১৫৩)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 3396,
			"arabicnumber": 3396,
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 3397,
			"arabicnumber": 3397,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন মদিনা্য় আগমন করেন, তখন তিনি মদিনাবাসীকে এমনভাবে পেলেন যে, তারা একদিন সওম পালন করে অর্থাৎ সে দিনটি হল ‘আশুরার দিন। তারা বলল, এটি একটি মহান দিবস। এ এমন দিন যে দিনে আল্লাহ্ মূসা (আঃ)-কে নাজাত দিয়েছেন এবং ফির‘আউনের সম্প্রদায়কে ডুবিয়ে দিয়েছেন। অতঃপর মূসা (আঃ) শুকরিয়া হিসেবে এদিন সওম পালন করেছেন। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তাদের তুলনায় আমি হলাম মূসা (আঃ)-এর অধিক নিকটবর্তী। কাজেই তিনি নিজেও এদিন সওম পালন করেছেন এবং এদিন সওম পালনের নির্দেশ দিয়েছেন। (২০০৪) (আধুনিক প্রকাশনীঃ ৩১৪৬, ইসলামিক ফাউন্ডেশনঃ ৩১৫৫)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 3398,
			"arabicnumber": 3398,
			"text": "وَوٰعَدْنَا مُوْسٰى ثَلٰثِيْنَ لَيْلَةً وَّأَتْمَمْنٰهَا بِعَشْرٍ فَتَمَّ مِيْقَاتُ رَبِّهٰٓ أَرْبَعِيْنَ لَيْلَةً ج وَقَالَ مُوْسٰى لِأَخِيْهِ هٰرُوْنَ اخْلُفْنِيْ فِيْ قَوْمِيْ وَأَصْلِحْ وَلَا تَتَّبِعْ سَبِيْلَ الْمُفْسِدِيْنَ (142) وَلَمَّا جَآءَ مُوْسٰى لِمِيْقَاتِنَا وَكَلَّمَه” رَبُّه” لا قَالَ رَبِّ أَرِنِيْٓ أَنْظُرْ إِلَيْكَ ط قَالَ لَنْ تَرٰﯨـنِىْ إِلَى قَوْلِهِ وَأَنَا أَوَّلُ الْمُؤْمِنِيْنَ (الأعراف142-143) আর আমি মূসাকে প্রতিশ্রুতি দিয়েছি ত্রিশ রাত্রির এবং সেগুলোকে পূর্ণ করেছি আরো দশ রাত দ্বারা। বস্ত্তত এভাবে চল্লিশ রাতের মেয়াদ পূর্ণ হয়ে গেছে। আর মূসা তাঁর ভাই হারূনকে বললেন, আমার সম্প্রদায়ে তুমি আমার প্রতিনিধি হিসাবে থাক। তাদের সংশোধন করতে থাক এবং ফাসাদ সৃষ্টিকারীদের পথে চলো না। অতঃপর মূসা যখন আমার প্রতিশ্রুতির সময় অনুযায়ী এসে হাযির হলেন এবং তাঁর সাথে তাঁর রবের কথা বললেন, তখন তিনি বললেন, হে আমার রব, আমাকে তোমার দর্শন দাও, যেন আমি তোমাকে দেখতে পাই.... (আয়াতের শেষ পর্যন্ত) আর আমিই প্রথম মু‘মিনদের মধ্যে প্রথম শ্রেণীর। (আ’রাফ ১৪২-৪৩) يُقَالُ دَكَّهُ زَلْزَلَهُ فَدُكَّتَا فَدُكِكْنَ جَعَلَ الْجِبَالَ كَالْوَاحِدَةِ كَمَا قَالَ اللهُ عَزَّ وَجَلَّ أَنَّ السَّمَوَاتِ وَالأَرْضَ كَانَتَا رَتْقًا (الأنبياء : 30) وَلَمْ يَقُلْ كُنَّ رَتْقًا مُلْتَصِقَتَيْنِ أُشْرِبُوْا ثَوْبٌ مُشَرَّبٌ مَصْبُوغٌ قَالَ ابْنُ عَبَّاسٍ انْبَجَسَتْ انْفَجَرَتْ وَإِذْ نَتَقْنَا الْجَبَلَ رَفَعْنَا বলা হয় دَكَّتَا অর্থ ভূকম্পন। আয়াতে উল্লেখিত فَدَكَّتَا দ্বিবচন বহুবচন অর্থে ব্যবহৃত। এখানে الْجِبَالَ শব্দটিকে এক ধরে নিয়ে وَالأَرْضَ সহ দ্বিচনরূপে دَكَّتَا বলা হয়েছে। যেমন মহান আল্লাহর বাণীঃ كَانَتَا رَتْقًا এর মধ্যে سمَوَاتِ এক ধরে দ্বিবচনে উল্লেখ করা হয়েছে। كُنَّ رَتْقًا বহুবচন বলা হয়নি। رَتْقًا অর্থাৎ পরস্পর মিলিত। أُشْرِبُوْا অর্থাৎ তাদের হৃদয়ে গোবৎস প্রীতি সিঞ্চিত হয়েছিল। বলা হয় ثَوْبٌ مُشَرَّبٌ অর্থ রঞ্জিত কাপড়। ইবনু ‘আব্বাস (রাঃ) বলেন, انْبَجَسَتْ অর্থ প্রবাহিত হয়েছিল। نَتَقْنَا الْجَبَلَ অর্থ আমি পাহাড়কে তাদের উপর উচিয়ে ছিলাম। ৩৩৯৮. আবূ সা‘ঈদ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, কিয়ামতের দিন সকল মানুষ বেহুশ হবে। অতঃপর সর্বপ্রথম আমারই হুশ আসবে। তখন আমি মূসা (আঃ)-কে দেখতে পাব যে, তিনি আরশের খুঁটিগুলোর একটি খুঁটি ধরে রয়েছেন। আমি জানি না, আমার আগেই কি তাঁর হুশ আসল, না-কি তুর পাহাড়ে বেহুশ হবার প্রতিদান তাঁকে দেয়া হল। (২৪১২) (আধুনিক প্রকাশনীঃ ৩১৪৭, ইসলামিক ফাউন্ডেশনঃ ৩১৬৫)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 3399,
			"arabicnumber": 3399,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যদি বনী ইসরাঈল না হত, তবে গোশ্ত পচে যেত না। আর যদি (মা) হাওয়া (আঃ) না হতেন, তাহলে কক্ষণও কোন নারী তার স্বামীর খেয়ানত করত না। (আধুনিক প্রকাশনীঃ ৩১৪৮, ইসলামিক ফাউন্ডেশনঃ ৩১৫৭)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 3400,
			"arabicnumber": 3400,
			"text": "بَابُ طُوفَانٍ مِنْ السَّيْلِ ৬০/২৬. অধ্যায় : বন্যার কারণে তুফান। يُقَالُ لِلْمَوْتِ الْكَثِيْرِ طُوفَانٌ الْقُمَّلُ الْحُمْنَانُ يُشْبِهُ صِغَارَ الْحَلَمِ حَقِيْقٌ حَقٌّ سُقِطَ كُلُّ مَنْ نَدِمَ فَقَدْ سُقِطَ فِيْ يَدِهِ মহামারীকেও তুফান নামে অভিহিত করা হয়। الْقُمَّلُ কীট যা ছোট ছোট উকুনের মত হয়ে থাকে। حَقِيْقٌ স্থির নিশ্চিত। سُقِطَ লজ্জিত। আর যে লজ্জিত হয়, সে অধোমুখে পতিত হয় ৩৪০০. ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি এবং হুর ইবনু কাযেস ফাযারী মূসা (আঃ)-এর সাথীর ব্যাপারে বিতর্ক করছিলেন। ইবনু ‘আব্বাস (রাঃ) বলেন, তিনি হলেন, খাযির। এমনি সময় উবাই ইবনু কা’ব (রাঃ) তাদের উভয়ের কাছ দিয়ে অতিক্রম করছিলেন, তখন ইবনু ‘আব্বাস (রাঃ) তাঁকে ডাকলেন এবং বললেন, আমি এবং আমার এ সাথী মূসা (আঃ)-এর সাথী সম্পর্কে বিতর্ক করছি, যাঁর সঙ্গে সাক্ষাতের জন্য মূসা (আঃ) পথের সন্ধান চেয়েছিলেন। আপনি কি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে তাঁর ঘটনা বর্ণনা করতে শুনেছেন? তিনি বললেন, হাঁ। আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি যে, মূসা (আঃ) বনী ইসরাঈলের এক সমাবেশে উপস্থিত ছিলেন। তখন তাঁর নিকট জনৈক ব্যক্তি আসল এবং জিজ্ঞেস করল, আপনি কি এমন কাউকে জানেন, যিনি আপনার চেয়ে অধিক জ্ঞানী? তিনি বললেন, না। তখন মূসা (আঃ)-এর প্রতি আল্লাহ্ ওয়াহী পাঠিয়ে জানিয়ে দিলেন, হাঁ, আমার বান্দা খাযির। তখন মূসা (আঃ) তাঁর সঙ্গে সাক্ষাতের জন্য পথের সন্ধান চেয়েছিলেন। তখন তাঁর জন্য একটি মাছ নিদর্শন হিসেবে ঠিক করে দেয়া হল এবং তাকে বলে দেয়া হল, যখন তুমি মাছটি হারাবে, তখন তুমি পিছনে ফিরে আসবে, তাহলেই তুমি তাঁর সাক্ষাৎ পাবে। আরপর মূসা (আঃ) নদীতে মাছের পিছে পিছে চলছিলেন, এমন সময় মূসা (আঃ)-কে তাঁর খাদিম বলে উঠল, ‘‘আপনি কি লক্ষ্য করেছেন। আমরা যখন ঐ পাথরটির নিকট অবস্থান করছিলাম, তখন আমি মাছটির কথা ভুলে গিয়েছিলাম। বস্তুতঃ তার হতে একমাত্র শয়তানই আমাকে ভুলিয়ে দিয়েছিল’’- (কাহ্ফ ৬৩)। মূসা (আঃ) বললেন, আমরা তো সে স্থানেরই খোঁজ করছিলাম। অতএব তাঁরা উভয়ে পিছনে ফিরে চললেন, এবং খাযিরের সাক্ষাৎ পেলেন- (কাহ্ফ ৬৪) তাঁদের উভয়েরই অবস্থার বর্ণনা ঠিক তাই যা আল্লাহ্ তাঁর কিতাবে বর্ণনা করেছেন। (৭৪) (আধুনিক প্রকাশনীঃ ৩১৪৯, ইসলামিক ফাউন্ডেশনঃ ৩১৫৮)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 3401,
			"arabicnumber": 3401,
			"text": "সা‘ঈদ ইবনু জুবায়র (রহ.) হতে বর্ণিত। তিনি বলেন, আমি ইবনু ‘আব্বাস (রাঃ)-কে বললাম, নাওফল বিক্কালী ধারণা করছে যে, খাযিরের সঙ্গী মূসা বনী ইসরাঈলের নবী মূসা (আঃ) নন; নিশ্চয়ই তিনি অপর কোন মূসা। তখন তিনি বললেন, আল্লাহর দুশমন মিথ্যা কথা বলেছে। উবাই ইবনু কা‘ব (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে আমাদের নিকট বর্ণনা করেছেন যে, একবার মূসা (আঃ) বনী ইসরাঈলের এক সমাবেশে ভাষণ দেয়ার জন্য দাঁড়িয়েছিলেন। তখন তাঁকে জিজ্ঞেস করা হল, কোন্ ব্যক্তি সবচেয়ে অধিক জ্ঞানী? তিনি বললেন, আমি। মূসা (আঃ)-এর এ উত্তরে আল্লাহ্ তাঁর প্রতি অসন্তুষ্টি প্রকাশ করলেন। কেননা তিনি জ্ঞানকে আল্লাহর দিকে সম্পর্কিত করেননি। আল্লাহ্ তাঁকে বললেন, বরং দুই নদীর সংযোগ স্থলে আমার একজন বান্দা আছে, সে তোমার চেয়ে অধিক জ্ঞানী। মূসা (আঃ) আরয করলেন, হে আমার রব! তাঁর নিকট পৌঁছতে কে আমাকে সাহায্য করবে? কখনও সুফ্ইয়ান এভাবে বর্ণনা করেছেন, হে আমার রব! আমি তাঁর সঙ্গে কিভাবে সাক্ষাৎ করব? আল্লাহ্ বললেন, তুমি একটি মাছ ধর এবং তা একটি থলের মধ্যে ভরে রাখ। যেখানে গিয়ে তুমি মাছটি হারিয়ে ফেলবে সেখানেই তিনি অবস্থান করছেন। অতঃপর মূসা (আঃ) একটি মাছ ধরলেন এবং থলের মধ্যে ভরে রাখলেন। অতঃপর তিনি এবং তাঁর সাথী ইউশা ইবনু নূন চলতে লাগলেন অবশেষে তাঁরা উভয়ে একটি পাথরের নিকট এসে পৌঁছে তার উপরে উভয়ে মাথা রেখে বিশ্রাম করলেন। এ সময় মূসা (আঃ) ঘুমিয়ে পড়লেন আর মাছটি নড়াচড়া করতে করতে থলে হতে বের হয়ে নদীতে চলে গেল। অতঃপর সে নদীতে সুড়ঙ্গ আকারে স্বীয় পথ করে নিল আর আল্লাহ্ মাছটির চলার পথে পানির গতি স্তব্ধ করে দিলেন। ফলে তার গমন পথটি সুড়ঙ্গের মত হয়ে গেল। এ সময় নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হাতের ইঙ্গিত করে বললেন, এভাবে সুড়ঙ্গের মত হয়েছিল। অতঃপর তাঁরা উভয়ে অবশিষ্ট রাত এবং পুরো দিন পথ চললেন। শেষে যখন পরের দিন ভোর হল তখন মূসা (আঃ) তাঁর যুবক সঙ্গীকে বললেন, আমার সকালের খাবার আন। আমি এ সফরে খুব ক্লান্তিবোধ করছি। বস্তুতঃ মূসা (আঃ) যে পর্যন্ত আল্লাহর নির্দেশিত স্থানটি অতিক্রম না করছেন সে পর্যন্ত তিনি সফরে কোন ক্লান্তিই অনুভব করেননি। তখন তাঁর সঙ্গী তাঁকে বললেন, আপনি কি লক্ষ্য করেছেন, আমরা যখন সেই পাথরটির নিকট বিশ্রাম নিয়েছিলাম মাছটি চলে যাবার কথা বলতে আমি একেবারেই ভুলে গেছি। আসলে আপনার নিকট তা উল্লেখ করতে একমাত্র শয়তানই আমাকে ভুলিয়ে দিয়েছে। মাছটি নদীতে আশ্চর্যজনকভাবে নিজের রাস্তা করে নিয়েছে। (রাবী বলেন) পথটি মাছের জন্য ছিল একটি সুড়ঙ্গের মত আর তাঁদের জন্য ছিল একটি আশ্চর্যজনক ব্যাপার। মূসা (আঃ) তাকে বললেন, ওটাইতো সেই স্থান যা আমরা খুঁজে বেড়াচ্ছি। অতঃপর উভয়ে নিজ নিজ পদচিহ্ন ধরে পিছনের দিকে ফিরে চললেন, শেষ পর্যন্ত তাঁরা দু’জনে সেই পাথরটির নিকট এসে পৌঁছলেন এবং দেখলেন সেখানে জনৈক ব্যক্তি বস্ত্রাবৃত হয়ে আছেন। মূসা (আঃ) তাঁকে সালাম করলেন। তিনি সালামের জবাব দিয়ে বললেন, এখানে সালাম কী করে এলো? তিনি বললেন, আমি মূসা। তিনি জিজ্ঞেস করলেন, আপনি কি বনী ইসরাঈলের মূসা? তিনি বললেন, হাঁ, আমি আপনার নিকট এসেছি, সরল সঠিক জ্ঞানের ঐ সব কথাগুলো শিখার জন্যে যা আপনাকে শিখানো হয়েছে। তিনি বললেন, হে মূসা! আমার আল্লাহর দেয়া কিছু জ্ঞান আছে যা আল্লাহ্ আমাকে শিক্ষা দিয়েছেন, আপনি তা জানেন। আর আপনারও আল্লাহ্ প্রদত্ত কিছু জ্ঞান আছে, যা আল্লাহ্ আপনাকে শিখিয়েছেন, আমি তা জানি না। মূসা (আঃ) বললেন, আমি কি আপনার সাথী হতে পারি? খাযির (আঃ) বললেন, আপনি আমার সঙ্গে থেকে ধৈর্য ধারণ করতে পারবেন না আর আপনি এমন বিষয়ে ধৈর্য রাখবেন কী করে, যার রহস্য আপনার জানা নেই? মূসা (আঃ) বললেন, ইন্শা আল্লাহ্ আপনি আমাকে একজন ধৈর্যশীল হিসেবে দেখতে পাবেন। আমি আপনার কোন আদেশই অমান্য করব না। অতঃপর তাঁরা দু’জনে রওয়ানা হয়ে নদীর তীর দিয়ে চলতে লাগলেন। এমন সময় একটি নৌকা তাদের পাশ দিয়ে যাচ্ছিল। তারা তাদেরকেও নৌকায় উঠিয়ে নিতে অনুরোধ করলেন। তারা খাযির (আঃ)-কে চিনে ফেললেন এবং তারা তাঁকে তাঁর সঙ্গীসহ পারিশ্রমিক ছাড়াই নৌকায় তুলে নিল। তারা দু’জন যখন নৌকায় উঠলেন, তখন একটি চড়ুই পাখি এসে নৌকাটির এক পাশে বসল এবং একবার কি দু’বার নদীর পানিতে ঠোঁট ডুবাল। খাযির (আঃ) বললেন, হে মূসা (আঃ)! আমার এবং তোমার জ্ঞানের দ্বারা আল্লাহর জ্ঞান হতে ততটুকুও কমেনি যতটুকু এ পাখিটি তার ঠোঁটের দ্বারা নদীর পানি হ্রাস করেছে। অতঃপর খাযির (আঃ) হঠাৎ একটি কুঠার নিয়ে নৌকার একটি তক্তা খুলে ফেললেন, মূসা (আঃ) অকস্মাৎ দৃষ্টি দিতেই দেখতে পেলেন তিনি কুঠার দিয়ে একটি তক্তা খুলে ফেলেছেন। তখন তাঁকে তিনি বললেন, আপনি এ কী করলেন? লোকেরা আমাদের মজুরি ছাড়া নৌকায় তুলে নিল, আর আপনি তাদের নৌকার যাত্রীদেরকে ডুবিয়ে দেয়ার জন্য নৌকাটি ফুটো করে দিলেন? এতো আপনি একটি গুরুতর কাজ করলেন। খাযির (আঃ) বললেন, আমি কি বলিনি যে, আপনি কখনও আমার সঙ্গে ধৈর্যধারণ করতে পারবেন না? মূসা (আঃ) বললেন, আমি যে বিষয়টি ভুলে গেছি, তার জন্য আমাকে দোষারোপ করবেন না। আর আমার এ ব্যবহারে আমার প্রতি কঠোর হবেন না। মূসা (আঃ)-এর পক্ষ হতে প্রথম এই কথাটি ছিল ভুলক্রমে। অতঃপর যখন তাঁরা উভয়ে নদী পার হয়ে আসলেন, তখন তাঁরা একটি বালকের পাশ দিয়ে অতিক্রম করলেন সে অন্যান্য বালকদের সঙ্গে খেলছিল। খাযির (আঃ) তার মাথা ধরলেন এবং নিজ হাতে তার ঘাড় আলাদা করে ফেললেন। এ কথাটি বুঝানোর জন্য সুফ্ইয়ান (রহ.) তাঁর হাতের আঙ্গুলগুলোর অগ্রভাগ দ্বারা এমনভাবে ইঙ্গিত করলেন যেন তিনি কোন জিনিস ছিঁড়ে নিচ্ছিলেন। এতে মূসা (আঃ) তাঁকে বললেন, আপনি একটি নিষ্পাপ বালককে বিনা অপরাধে হত্যা করলেন? নিশ্চয়ই আপনি একটি অন্যায় কাজ করলেন। খাযির (আঃ) বললেন, আমি কি আপনাকে বলিনি যে আপনি আমার সঙ্গে ধৈর্য ধরতে পারবেন না? মূসা (আঃ) বললেন, অতঃপর যদি আমি আপনাকে আর কোন বিষয়ে জিজ্ঞেস করি তাহলে আপনি আমাকে আর আপনার সাথে রাখবেন না। কেননা আপনার উযর আপত্তি চূড়ান্ত হয়েছে। অতঃপর তাঁরা চলতে লাগলেন শেষ অবধি তাঁরা এক জনপদে এসে পৌঁছলেন। তাঁরা গ্রামবাসীদের নিকট খাবার চাইলেন। কিন্তু তারা তাঁদের আতিথ্য করতে অস্বীকার করল। অতঃপর তাঁরা সেখানেই একটি দেয়াল দেখতে পেলেন যা ভেঙ্গে পড়ার উপক্রম হয়েছিল। তা একদিকে ঝুঁকে গিয়েছিল। খাযির (আঃ) তা নিজের হাতে সোজা করে দিলেন। রাবী আপন হাতে এভাবে ইঙ্গিত করলেন। আর সুফ্ইয়ান (রহ.) এমনিভাবে ইঙ্গিত করলেন যেন তিনি কোন জিনিস উপরের দিকে উঁচু করে দিচ্ছেন। ‘‘ঝুঁকে পড়েছে’’ এ কথাটি আমি সুফ্ইয়ানকে মাত্র একবার বলতে শুনেছি। মূসা (আঃ) বললেন, তারা এমন মানুষ যে, আমরা তাদের নিকট আসলাম, তারা আমাদেরকে না খাবার দিল, না আমাদের আতিথ্য করল আর আপনি এদের দেয়াল সোজা করতে গেলেন। আপনি ইচ্ছা করলে এর বদলে মজুরি গ্রহণ করতে পারতেন। খাযির (আঃ) বললেন, এখানেই আপনার ও আমার মধ্যে বিচ্ছেদ হল। তবে এখনই আমি আপনাকে জ্ঞাত করছি ওসব কথার রহস্য, যেসব বিষয়ে আপনি ধৈর্য ধরতে পারেননি। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, আমাদেরতো ইচ্ছা যে, মূসা (আঃ) ধৈর্য ধরলে আমাদের নিকট তাঁদের আরো অনেক অধিক খবর বর্ণনা করা হতো। সুফ্ইয়ান (রাঃ) বর্ণনা করেন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, আল্লাহ্ মূসা (আঃ)-এর উপর রহমত বর্ষণ করুন। তিনি যদি ধৈর্য ধরতেন, তাহলে তাদের উভয়ের ব্যাপারে আমাদের নিকট আরো অনেক ঘটনা জানানো হতো। রাবী বলেন, ইবনু ‘আব্বাস (রাঃ) এখানে পড়েছেন, তাদের সামনে একজন বাদশাহ ছিল, সে প্রতিটি নিখুঁত নৌকা জোর করে ছিনিয়ে নিত। আর সে ছেলেটি ছিল কাফির, তার পিতা-মাতা ছিলেন মুমিন। অতঃপর সুফ্ইয়ান (রহ.) আমাকে বলেছেন, আমি এ হাদীসটি তাঁর (‘আমর ইবনু দ্বীনার) হতে দু‘বার শুনেছি এবং তাঁর নিকট হতেই মুখস্থ করেছি। সুফ্ইয়ান (রহ.)-কে জিজ্ঞেস করা হলো, আপনি কি ‘আমর ইবনু দ্বীনার (রহ.) হতে শুনার পূর্বেই তা মুখস্থ করেছেন না অপর কোন লোকের নিকট শুনে তা মুখস্থ করেছেন? তিনি বললেন, আমি কার নিকট হতে তা মুখস্থ করতে পারি? আমি ব্যতীত আর কেউ কি এ হাদীস আমরের নিকট হতে বর্ণনা করেছেন? আমি তাঁর নিকট হতে শুনেছি দুইবার কি তিনবার। আর তাঁর থেকেই তা মুখস্থ করেছি। ‘আলী ইবনু খুশরম (রহ.) সুফ্ইয়ান (রহ.) সূত্রে বর্ণিত দীর্ঘ হাদীসটি বর্ণনা করেছেন। (৭৪) (আধুনিক প্রকাশনীঃ ৩১৫০, ইসলামিক ফাউন্ডেশনঃ ৩১৫৯)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 3402,
			"arabicnumber": 3402,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, খাযির (আঃ)-কে খাযির নামে আখ্যায়িত করার কারণ এই যে, একদা তিনি ঘাস-পাতা বিহীন শুকনো সাদা জায়গায় বসেছিলেন। সেখান হতে তাঁর উঠে যাবার পরই হঠাৎ ঐ জায়গাটি সবুজ হয়ে গেল। (আধুনিক প্রকাশনীঃ ৩১৫১, ইসলামিক ফাউন্ডেশনঃ ৩১৬০)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 3403,
			"arabicnumber": 3403,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, বনী ইসরাঈলকে আদেশ দেয়া হয়েছিল, ‘‘তোমরা দরজা দিয়ে অবনত মস্তকে প্রবেশ কর আর মুখে বল, ‘হিত্তাতুন’ (অর্থাৎ হে আল্লাহ! আমাদের গুনাহ ক্ষমা করে দাও।)’’ (আল-বাকারাহঃ ৫৮) কিন্তু তারা এ শব্দটি পরিবর্তন করে ফেলল এবং প্রবেশ দ্বারে যেন নতজানু হতে না হয় সে জন্য তারা নিজ নিজ নিতম্বের ওপর ভর দিয়ে শহরে প্রবেশ করল আর মুখে বলল, ‘হাববাতুন্ ফী শা‘আরাতিন’’ (অর্থাৎ হে আল্লাহ্! আমাদেরকে যবের দানা দাও।) (৪৪৭৯, ৪৬৪১) (আধুনিক প্রকাশনীঃ ৩১৫২, ইসলামিক ফাউন্ডেশনঃ ৩১৬১)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 3404,
			"arabicnumber": 3404,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, মূসা (আঃ) অত্যন্ত লজ্জাশীল ছিলেন, সব সময় শরীর ঢেকে রাখতেন। তাঁর দেহের কোন অংশ খোলা দেখা যেত না, তা থেকে তিনি লজ্জাবোধ করতেন। বনী ইসরাঈলের কিছু লোক তাঁকে খুব কষ্ট দিত। তারা বলত, তিনি যে শরীরকে এত অধিক ঢেকে রাখেন, তার একমাত্র কারণ হলো, তাঁর শরীরে কোন দোষ আছে। হয়ত শ্বেত রোগ অথবা একশিরা বা অন্য কোন রোগ আছে। আল্লাহ তা‘আলা ইচ্ছা করলেন মূসা (আঃ) সম্পর্কে তারা যে অপবাদ ছড়িয়েছে তা হতে তাঁকে মুক্ত করবেন। অতঃপর একদিন নিরালায় গিয়ে তিনি একাকী হলেন এবং তাঁর পরণের কাপড় খুলে একটি পাথরের ওপর রাখলেন, অতঃপর গোসল করলেন, গোসল সেরে যেমনই তিনি কাপড় নেয়ার জন্য সেদিকে এগিয়ে গেলেন তাঁর কাপড়সহ পাথরটি ছুটে চলল। অতঃপর মূসা (আঃ) তাঁর লাঠিটি হাতে নিয়ে পাথরটির পেছনে পেছনে ছুটলেন। তিনি বলতে লাগলেন, আমার কাপড় হে পাথর! হে পাথর! শেষে পাথরটি বনী ইসরাঈলের একটি জন সমাবেশে গিয়ে পৌঁছল। তখন তারা মূসা (আঃ)-কে বস্ত্রহীন অবস্থায় দেখল যে তিনি আল্লাহর সৃষ্টির মধ্যে সবচেয়ে সৌন্দর্যে ভরপুর এবং তারা তাঁকে যে অপবাদ দিয়েছিল সে সব দোষ হতে তিনি পুরোপুরি মুক্ত। আর পাথরটি থামল, তখন মূসা (আঃ) তাঁর কাপড় নিয়ে পরলেন এবং তাঁর হাতের লাঠি দিয়ে পাথরটিকে জোরে জোরে আঘাত করতে লাগলেন। আল্লাহর কসম! এতে পাথরটিতে তিন, চার, কিংবা পাঁচটি আঘাতের দাগ পড়ে গেল। আর এটিই হলো আল্লাহর এ বাণীর মর্মঃ ‘‘হে মুমিনগণ! তোমরা তাদের মত হয়ো না যারা মূসা (আঃ)-কে কষ্ট দিয়েছিল। অতঃপর আল্লাহ্ তাঁকে নির্দোষ প্রমাণিত করেন তা হতে যা তারা রটিয়েছিল। আর তিনি ছিলেন আল্লাহর নিকট মর্যাদার অধিকারী।’’ (আল-আহযাবঃ ৬৯) (২৭৮) (আধুনিক প্রকাশনীঃ ৩১৫৩, ইসলামিক ফাউন্ডেশনঃ ৩১৬২)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 3405,
			"arabicnumber": 3405,
			"text": "‘আবদুল্লাহ হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একদা কিছু জিনিস বণ্টন করেন। তখন এক ব্যক্তি বলল, এতো এমন ধরনের বণ্টন যা আল্লাহর সন্তুষ্টি অর্জনের জন্য করা হয়নি। অতঃপর আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট আসলাম এবং তাঁকে বিষয়টি জানালাম। তিনি খুব অসন্তুষ্ট হলেন, এমনকি তাঁর চেহারায় আমি অসন্তুষ্টির ভাব লক্ষ্য করলাম। অতঃপর তিনি বললেন, আল্লাহ্ মূসা (আঃ)-এর প্রতি রহম করুন তাঁকে এর চেয়ে অনেক বেশি কষ্ট দেয়া হয়েছিল, তবুও তিনি ধৈর্য অবলম্বন করেছিলেন। (৩১৫০) (আধুনিক প্রকাশনীঃ ৩১৫৪, ইসলামিক ফাউন্ডেশনঃ ৩১৬৩)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 3406,
			"arabicnumber": 3406,
			"text": "مُتَبَّرٌ خُسْرَانٌ وَلِيُتَبِّرُوْا يُدَمِّرُوْا مَا عَلَوْا مَا غَلَبُوْا مُتَبَّرٌ অর্থ ক্ষতিগ্রস্ত وَلِيُتَبِّرُوْا অর্থ যেন তারা ধ্বংস হয় مَا عَلَوْاঅর্থ যা অধিকারে এনেছিল। ৩৪০৬. জাবির ইবনু ‘আবদুল্লাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমরা আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে ‘কাবাস’ (পিলু) গাছের পাকা ফল বেছে বেছে নিচ্ছিলাম। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, এর মধ্যে কালোগুলো নেয়াই তোমাদের উচিত। কেননা এগুলোই অধিক সুস্বাদু। সাহাবীগণ বললেন, আপনি কি ছাগল চরিয়েছিলেন? তিনি বললেন, প্রত্যেক নবীই তা চরিয়েছেন। (৫৪৫৩) (আধুনিক প্রকাশনীঃ ৩১৫৫, ইসলামিক ফাউন্ডেশনঃ ৩১৬৪)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 3407,
			"arabicnumber": 3407,
			"text": "بَابُ وَإِذْ قَالَ مُوْسٰى لِقَوْمِهٰ إِنَّ اللهَ يَأْمُرُكُمْ أَنْ تَذْبَحُوْا بَقَرَةً (البقرة : 67) الآيَةَ ৬০/৩০. অধ্যায় : মহান আল্লাহর বাণীঃ স্মরণ কর, যখন মূসা তাঁর সম্প্রদায়কে বলেছিলঃ আল্লাহ তোমাদের একটি গরু যবেহ করতে আদেশ দিয়েছেন। (আল-বাকারাহ্ ৬৭) قَالَ أَبُوْ الْعَالِيَةِ الْعَوَانُ النَّصَفُ بَيْنَ الْبِكْرِ وَالْهَرِمَةِ فَاقِعٌ صَافٍ لَا ذَلُوْلٌ لَمْ يُذِلَّهَا الْعَمَلُ تُثِيْرُ الْأَرْضَ لَيْسَتْ بِذَلُوْلٍ تُثِيْرُ الأَرْضَ وَلَا تَعْمَلُ فِي الْحَرْثِ مُسَلَّمَةٌ مِنْ الْعُيُوْبِ لَا شِيَةَ بَيَاضٌ صَفْرَآءُ إِنْ شِئْتَ سَوْدَاءُ وَيُقَالُ صَفْرَاءُ كَقَوْلِهِ جِمَالٰتٌ صُفْرٌ فَادّٰرَأْتُمْ اخْتَلَفْتُمْ আবুল ‘আলিয়াহ (রহ.) বলেন, الْعَوَانُ বুড়ো ও বাছুর উভয়ের মাঝামাঝি, فَاقِعٌ উজ্জ্বল গাঢ়। لَا ذَلُوْلٌ অর্থ, যা কাজে ব্যবহৃত হয় নাই। تُثِيْرُ الأَرْضَ জমি চাষে অর্থাৎ গাভীটি এমন যা ভূমি কর্ষণে ও চাষের কাজে ব্যবহৃত হয়নি। مُسَلَّمَةٌ যা সকল ত্রুটি ও খুঁত হতে মুক্ত। لَا شِيَةَ কোন দাগ নেই। হলুদ ও সাদা বর্ণের। তুমি ইচ্ছা করলে কালোও বলতে পারো। আরও বলা হয় এর অর্থ হলুদ বর্ণের। যেমন মহান আল্লাহর বাণীঃ جِمَالَاتٌ صُفْرٌ পীতবর্ণের উটসমূহ। فَادَّارَأْتُمْ -তোমরা পরস্পর মত বিরোধ করছিলে ৩৪০৭. আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, মালাকুলকে মূসা (আঃ)-এর নিকট তাঁর জন্য পাঠান হয়েছিল। ফেরেশতা যখন তাঁর নিকট আসলেন, তিনি তাঁর চোখে চপেটাঘাত করলেন। তখন ফেরেশতা তাঁর রবের নিকট ফিরে গেলেন এবং বললেন, আপনি আমাকে এমন এক বান্দার নিকট পাঠিয়েছেন যে মরতে চায় না। আল্লাহ্ বললেন, তুমি তার নিকট ফিরে যাও এবং তাকে বল সে যেন তার একটি হাত একটি গরুর পিঠে রাখে, তার হাত যতগুলো পশম ঢাকবে তার প্রতিটি পশমের বদলে তাকে এক বছর করে জীবন দেয়া হবে। মূসা (আঃ) বললেন, হে রব! অতঃপর কী হবে? আল্লাহ্ বললেন, অতঃপর মৃত্যু। মূসা (আঃ) বললেন, তাহলে এখনই হোক। (রাবী) বলেন, তখন তিনি আল্লাহর নিকট আরয করলেন, তাঁকে যেন ‘আরদে মুকাদ্দাস’ হতে একটি পাথর নিক্ষেপের দূরত্বের সমান স্থানে পৌঁছে দেয়া হয়। আবূ হুরাইরাহ্ (রাঃ) বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, আমি যদি সেখানে থাকতাম তাহলে অবশ্যই আমি তোমাদেরকে পথের ধারে লাল টিলার নীচে তাঁর কবরটি দেখিয়ে দিতাম। রাবী আব্দুর রায্যাক বলেন, মা‘মার (রহ.)......আবূ হুরাইরাহ্ (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে একইভাবে বর্ণনা করেছেন। (১৩৩৯) (আধুনিক প্রকাশনীঃ ৩১৫৬, ইসলামিক ফাউন্ডেশনঃ ৩১৬৫)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 3408,
			"arabicnumber": 3408,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, একজন মুসলিম আর একজন ইয়াহূদী পরস্পরকে গালি দিল। মুসলিম ব্যক্তি বললেন, সেই সত্তার কসম! যিনি মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে তামাম জগতের উপর মনোনীত করেছেন। কসম করার সময় তিনি একথাটি বলেছেন। তখন ইয়াহূদী লোকটিও বলল, ঐ সত্তার কসম! যিনি মূসা (আঃ)-কে তামাম জগতের উপর মনোনীত করেছেন। তখন সেই মুসলিম সাহাবী সে সময় তার হাত উঠিয়ে ইয়াহূদীকে একটি চড় মারলেন। তখন সে ইয়াহূদী নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট গেল এবং ঘটনাটি জানালো যা তার ও মুসলিম সাহাবীর মধ্যে ঘটেছিল। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তোমরা আমাকে মূসা (আঃ)-এর উপর বেশি মর্যাদা দিওনা। সকল মানুষ বেহুশ হয়ে যাবে। আর আমিই সর্বপ্রথম হুশ ফিরে পাব। তখনই আমি মূসা (আঃ)-কে দেখব, তিনি আরশের একপাশ ধরে রয়েছেন। আমি জানি না, যারা বেহুশ হয়েছিল, তিনিও কি তাদের অন্তর্ভুক্ত অতঃপর আমার আগে তাঁর হুশ এসে গেছে? কিংবা তিনি তাদেরই একজন, যাঁদেরকে আল্লাহ্ বেহুঁশ হওয়া থেকে অব্যাহতি দিয়েছিলেন। (২৪১১) (আধুনিক প্রকাশনীঃ ৩১৫৭, ইসলামিক ফাউন্ডেশনঃ ৩১৬৬)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 3409,
			"arabicnumber": 3409,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, আদম (আঃ) ও মূসা (আঃ) তর্ক-বিতর্ক করছিলেন। তখন মূসা (আঃ) তাঁকে বলছিলেন, আপনি সেই আদম যে আপনার ভুল আপনাকে বেহেশত হতে বের করে দিয়েছিল। আদম (আঃ) তাঁকে বললেন, আপনি সেই মূসা যে, আপনাকে আল্লাহ্ তাঁর রিসালাত দান এবং বাক্যালাপ দ্বারা সম্মানিত করেছিলেন। অতঃপরও আপনি আমাকে এমন বিষয়ে দোষী করছেন, যা আমার সৃষ্টির আগেই আমার জন্য নির্ধারিত হয়ে গিয়েছিল। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দু’বার বলেছেন, এ বিতর্কে আদম (আঃ) মূসা (আঃ)-এর ওপর বিজয়ী হন। (৪৭৩৬, ৪৭৩৮, ৬৬১৪, ৭৫১৫) (আধুনিক প্রকাশনীঃ ৩১৫৮, ইসলামিক ফাউন্ডেশনঃ ৩১৬৭)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 3410,
			"arabicnumber": 3410,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, একদিন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের সামনে আসলেন এবং বললেন, আমার নিকট সকল নবীর উম্মাতকে পেশ করা হয়েছিল। তখন আমি একটি বিরাট দল দেখলাম, যা দৃষ্টিসীমা পর্যন্ত আবৃত করে ফেলেছিল। তখন বলা হলো, ইনি হলেন মূসা (আঃ) তাঁর কওমের মাঝে। (৫৭০৫, ৫৭৫২, ৬৪৭২, ৬৫৪১, মুসলিম ১/৯৪ হাঃ ২২০, আহমাদ ২৪৪৮) (আধুনিক প্রকাশনীঃ ৩১৫৯, ইসলামিক ফাউন্ডেশনঃ ৩১৬৮)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 3411,
			"arabicnumber": 3411,
			"text": "আবূ মূসা (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, পুরুষের মধ্যে অনেকেই পূর্ণতা অর্জন করেছেন। কিন্তু মহিলাদের মধ্যে ফির‘আউনের স্ত্রী আসিয়া এবং ইমরানের কন্যা মারইয়াম ব্যতীত আর কেউ পূর্ণতা অর্জনে সক্ষম হয়নি। তবে ‘আয়িশাহর মর্যাদা সব মহিলার উপর এমন, যেমন সারীদের (গোশতের সুরুয়ায় ভিজা রুটির) মর্যাদা সকল প্রকার খাদ্যের উপর। (৩৪৩৩, ৩৭৬৯, ৫৪১৮) (আধুনিক প্রকাশনীঃ ৩১৬০, ইসলামিক ফাউন্ডেশনঃ ৩১৬৯)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 3412,
			"arabicnumber": 3412,
			"text": "৬০/৩৩. অধ্যায় : মহান আল্লাহর বাণীঃ নিশ্চয়ই কারূন ছিল মূসা (আঃ)-এর সম্প্রদায় ভুক্ত। .... (আল-কাসাস ৭৬) অর্থ অবশ্যই কষ্টসাধ্য ছিল। ইবনু ‘আব্বাস (রাঃ) বলেন,অর্থ একদল বলবান লোকও তাঁর চাবিগুলো বহন করতে পারতো না। বলা হয় অর্থ দাম্ভিক লোকগুলো। হচেছএর মত, অর্থ তুমি দেখলেতো, আল্লাহ্ যাকে ইচ্ছা রিয্ক্ বেশি করে দেন, আর যাকে ইচ্ছা কম করে দেন....। (লুকমান ৩৭) ৬০/৩৪. অধ্যায় : মহান আল্লাহর বাণীঃ মাদইয়ানবাসীদের প্রতি তাদের ভাই শু‘আইবকে পাঠিয়েছিলাম। (আ‘রাফ ৮৫, হুদ ৪৮ ও ‘আনকাবূত ৩৬ ) অর্থাৎ মাদ্ইয়ানবাসীদের প্রতি। কেননা মাদ্ইয়ান একটি জনপদ। যেমন অর্থাৎ জনপদবাসী ও যাত্রীদল। অর্থাৎ তোমরা তার প্রতি ফিরে তাকাওনি। যখন কারোও কোনো প্রয়োজন পুরা না করবে, তখন বলা হয়- তুমি আমার প্রয়োজনকে পিছনে ফেলে রেখেছো। অথবা তুমি আমার প্রতি ফিরে তাকাওনি। অর্থ-তুমি তোমার সঙ্গে কোন বাহন অথবা বাসন রাখতে যার দ্বারা তুমি উপকৃত হবে। একই অর্থ। অর্থ জীবন যাপন। অর্থ চিন্তিত হওয়া অর্থ দুঃখিত হবো। হাসান (রহ.) বলেন, অর্থাৎ তুমি তো অবশ্যই সহিষ্ণু সদাচারী- (হুদ ৮৭)। এখানে কাফিরেরা ঠাট্টাচ্ছলে বলতো। আর মুজাহিদ (রহ.) বলেন, মূলতঃ ছিল। অর্থ-তাদের জন্য মেঘাচ্ছন্ন দিবসের আযাব। মুজাহিদ (রহ.) বলেন, অর্থ-অপরাধী অর্থ-বোঝাই নৌযান। (আল্লাহর বাণী) সুতরাং যদি তিনি আল্লাহর তাসবীহ পাঠকারী না হতেন- (আস্ সাফফাত ১৪৩)। অতঃপর আমি তাকে নিক্ষেপ করলাম এক ময়দানে এবং তিনি ছিলেন পীড়িত। আর আমি উৎপন্ন করলাম তার উপর এক লাউ গাছ- (আস্ সাফফাত ১৪৫-১৪৬)। অর্থ-যমীনের উপরিভাগ। অর্থ-কান্ডবিহীন তৃণলতা, যেমন লাউ গাছ ও তার সদৃশ। (মহান আল্লাহর বাণী) আমি তাকে রাসূল করে পাঠিয়েছিলাম এক লক্ষ বা ততোধিক লোকের প্রতি। তারা ঈমান এনেছিল, ফলে আমি তাদেরকে এক নির্দিষ্ট কাল পর্যন্ত জীবনোপভোগ করতে দিয়েছিলাম- (আস্ সাফফাত ১৪৭-৪৮)। (মহান আল্লাহর বাণী) অতএব, আপনি ধৈর্যধারণ করুন আপনার রবের নির্দেশের অপেক্ষায়। আপনি মাছওয়ালা ইউনুসের মত হবেন না, যখন তিনি চিন্তায়-বিপদে আচ্ছন্ন অবস্থায় কাতর প্রার্থনা করেছিলেন- (কলম ৪৮)। অর্থ-বিষাদাচ্ছন্ন। ৩৪১২. ‘আবদুল্লাহ্ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমাদের কেউ যেন এরূপ না বলে যে, আমি অর্থাৎ মুহাম্মদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইউনুস (আঃ) হতে উত্তম। মুসাদ্দাদ (রহ.) অতিরিক্ত বললেন, ইউনুস ইবনু মাত্তা। (৪৬০৩, ৩৮০৪) (আধুনিক প্রকাশনীঃ ৩১৬১, ইসলামিক ফাউন্ডেশনঃ ৩১৭০)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 3413,
			"arabicnumber": 3413,
			"text": "ইবনে ‘আব্বাস (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, কারো জন্য এ কথা বলা উচিত নয় যে, নিশ্চয়ই আমি (মুহাম্মদ) ইউনুস ইবনু মাত্তা হতে উত্তম। আর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে (ইউনুসকে) তাঁর পিতার দিকে সম্পর্কিত করেছেন। (৩৩৯৫) (আধুনিক প্রকাশনীঃ ৩১৬২, ইসলামিক ফাউন্ডেশনঃ ৩১৭১)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 3415,
			"arabicnumber": 3415,
			"text": "আর আমি এ কথাও বলি না যে কোন ব্যক্তি ইউনুস ইবনু মাত্তার চেয়ে বেশি মর্যাদার অধিকারী। (৩৪১৬, ৪৬০৪, ৪৬৩১, ৪৮০৫)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 3416,
			"arabicnumber": 3416,
			"text": "আবূ হুরাযরা (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, কোন বান্দার জন্যই এ কথা বলা সমীচীন নয় যে, আমি (মুহাম্মদ) ইউনুস ইবনু মাত্তার থেকে উত্তম। (৩৪১৫, মুসলিম ৪৩/৪৩ হাঃ ২৩৭৬, আহমাদ ১০০৪৮) (আধুনিক প্রকাশনীঃ ৩১৬৪, ইসলামিক ফাউন্ডেশনঃ ৩১৭৩)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 3417,
			"arabicnumber": 3417,
			"text": "بَابُ وَسْئَلْهُمْ عَنِ الْقَرْيَةِ الَّتِىْ كَانَتْ حٰضِرَةَ الْبَحْرِ إِذْ يَعْدُوْنَ فِى السَّبْتِ (الأعراف : 163) ৬০/৩৬. অধ্যায় : মহান আল্লাহর বাণীঃ আর তাদেরকে সমুদ্র তীরবর্তী জনপদবাসীদের সম্বন্ধে জিজ্ঞেস কর। যখন তারা শনিবার সীমালঙ্ঘন করতো। (আ‘রাফ ১৬৩) يَعْدُوْنَ : يَتَعَدَّوْنَ يُجَاوِزُوْنَ فِي السَّبْتِ إِذْ تَأْتِيْهِمْ حِيْتَانُهُمْ يَوْمَ سَبْتِهِمْ شُرَّعًا شَوَارِعَ وَيَوْمَ لَا يَسْبِتُوْنَ إِلَى قَوْلِهِ كُوْنُوْا قِرَدَةً خَاسِئِيْنَ (الأعراف : 166) بَئِيسٌ شَدِيْدٌ يَعدُوْنَ অর্থ সীমালঙ্ঘন করতো। সমুদ্রের মাছগুলো শনিবার উদযাপনের দিন পানির উপর ভেসে তাদের নিকট আসতো। شُرَّعًا অর্থ পানিতে ভেসে আর যেদিন তারা শনিবার উদ্যাপন করতো না.... মহান আল্লাহর বাণীঃ خَاسِئِيْنَ পর্যন্ত। بَئِيسٌ ঘৃণিত-ভীষণ অপদস্থ। الزُّبُرُ الْكُتُبُ وَاحِدُهَا زَبُوْرٌ زَبَرْتُ كَتَبْتُ وَلَقَدْ اٰتَيْنَا دَاو”دَ مِنَّا فَضْلًا يٰجِبَالُ أَوِّبِيْ مَعَه” وَالطَّيْرَ ط وَأَلَنَّا لَهُ الْحَدِيْدَ أَنْ اعْمَلْ سَابِغَاتٍ وَّقَدِّرْ فِي السَّرْدِ (اسبأ : 10-11) قَالَ مُجَاهِدٌ سَبِّحِيْ مَعَهُ وَالطَّيْرَ وَأَلَنَّا لَهُ الْحَدِيْدَ أَنْ اعْمَلْ سَابِغَاتٍ الدُّرُوعَ وَقَدِّرْ فِي السَّرْدِ الْمَسَامِيْرِ وَالْحَلَقِ وَلَا يُدِقَّ الْمِسْمَارَ فَيَتَسَلْسَلَ وَلَا يُعَظِّمْ فَيَفْصِمَ . أفرغ : لآنزل. بَسْطَةً زيادة وفضلا. وَاعْمَلُوْا صَالِحًا إِنِّيْ بِمَا تَعْمَلُوْنَ بَصِيْرٌ (اسبأ : 10-11) الزُّبُرُ কিতাবসমূহ। তার একবচনে زَبُوْرٌ আর زَبَرْتُ আমি লিখেছি। আর আমি আমার পক্ষ হতে দাউদকে বিশেষ মর্যাদা দিয়েছিলাম। হে পর্বত! তাঁর সঙ্গে মিলে আমার তাসবীহ পাঠ কর। মুজাহিদ (রহ.) বলেন, তার সঙ্গে তাসবীহ পাঠ কর। سَابِغَاتٍ লৌহবর্মসমূহ। আর এ নির্দেশ আমি পাখীকেও দিয়েছিলাম। আমি তাঁর জন্য লোহাকে নরম করে দিয়েছিলাম। তুমি লৌহবর্ম তৈরি করতে সঠিক পরিমাপের প্রতি লক্ষ্য রেখো। السَّرْدِ পেরেক ও কড়াসমূহ। পেরেক এমন ছোট করে তৈরি করো না যাতে তা ঢিলে হয়ে যায়। আর এতো বড় করোনা যাতে বর্ম ভেঙ্গে যায়। أفرغ অর্থ-অবতীর্ণ করা। بَسْطَةً অর্থ-বেশী ও সমৃদ্ধ। ‘‘আর সৎকর্ম কর, নিশ্চয়ই তোমরা যা কর আমি তা দেখি।’’ (সাবা ১০-১১) ৩৪১৭. আবূ হুরাযরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, দাউদ (আঃ)-এর জন্য কুরআন (যাবুর) তিলাওয়াত সহজ করে দেয়া হয়েছিল। তিনি তাঁর পশুযানে গদি বাঁধার আদেশ করতেন, তখন তার উপর গদি বাঁধা হতো। অতঃপর তাঁর পশুযানের ওপর গদি বাঁধার পূর্বেই তিনি যাবুর তিলাওয়াত করে শেষ করে ফেলতেন। তিনি নিজ হাতে উপার্জন করেই জীবিকা নির্বাহ করতেন। মূসা ইবনু ‘উকবাহ (রহ.).....আবূ হুরাইরাহ্ (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে হাদীসটি রিওয়ায়াত করেছেন। (২০৭৩) (আধুনিক প্রকাশনীঃ ৩১৬৫, ইসলামিক ফাউন্ডেশনঃ ৩১৭৪)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 3418,
			"arabicnumber": 3418,
			"text": "‘আবদুল্লাহ ইবনু ‘আমার (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে জানান হলো যে, আমি বলছি, আল্লাহর কসম! আমি যতদিন বেঁচে থাকব ততদিন অবশ্যই আমি অবিরত দিনে সওম পালন করবো আর রাতে ‘ইবাদাতে রত থাকবো। তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জিজ্ঞেস করলেন, তুমিই কি বলেছো, ‘আল্লাহর শপথ! আমি যতদিন বাঁচবো, ততদিন দিনে সওম পালন করবো এবং রাতে ‘ইবাদাতে মশগুল থাকবো। আমি আরয করলাম, আমিই তা বলেছি। তিনি বললেন, সেই শক্তি তোমার নেই। কাজেই সওমও পালন কর, ইফ্তারও কর। রাতে ‘ইবাদাতও কর এবং ঘুমও যাও। আর প্রতি মাসে তিন দিন সওম পালন কর। কেননা প্রতিটি নেক কাজের কমপক্ষে দশগুণ সাওয়াব পাওয়া যায় আর এটা সারা বছর সওম পালন করার সমান। তখন আমি আরয করলাম, হে আল্লাহর রাসূল! আমি এর থেকেও অধিক সওম পালন করার ক্ষমতা রাখি। তখন তিনি বললেন, তাহলে তুমি একদিন সওম পালন কর আর দু’দিন ইফ্তার কর। তখন আমি আরয করলাম, হে আল্লাহর রাসূল! আমি এ থেকেও অধিক পালন করার শক্তি রাখি। তখন তিনি বললেন, তাহলে একদিন সওম পালন কর আর একদিন বিরতি দাও। এটা দাউদ (আঃ)-এর সওম পালনের নিয়ম। আর এটাই সওম পালনের উত্তম নিয়ম। আমি আরয করলাম, হে আল্লাহর রাসূল! আমি এ থেকেও অধিক শক্তি রাখি। তিনি বললেন, এ থেকে বেশি কিছু নেই। (১১৩১) (আধুনিক প্রকাশনীঃ ৩১৬৬, ইসলামিক ফাউন্ডেশনঃ ৩১৭৫)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 3419,
			"arabicnumber": 3419,
			"text": "‘আবদুল্লাহ ইবনু ‘আমর ইবনু ‘আস (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে জিজ্ঞেস করলেন, আমি কি জ্ঞাত হইনি যে, তুমি রাত ভর ‘ইবাদাত কর এবং দিন ভর সওম পালন কর! আমি বললাম, হাঁ। তিনি বললেন, যদি তুমি এমন কর; তবে তোমার দৃষ্টিশক্তি দুর্বল হয়ে যাবে এবং দেহ ক্লান্ত হয়ে যাবে। কাজেই প্রতি মাসে তিন দিন সওম পালন কর। তাহলে তা সারা বছরের সওমের সমতুল্য হয়ে যাবে। আমি বললাম, আমি আমার মধ্যে আরো অধিক পাই। মিসআর (রাঃ) বলেন, এখানে শক্তি বুঝানো হয়েছে। তখন আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তাহলে তুমি দাউদ (আঃ)-এর নিয়মে সওম পালন কর। তিনি একদিন সওম পালন করতেন আর একদিন বিরত থাকতেন। আর শত্রুর মুখোমুখী হলে তিনি কখনও পালিয়ে যেতেন না। (১১৩১) (আধুনিক প্রকাশনীঃ ৩১৬৭, ইসলামিক ফাউন্ডেশনঃ ৩১৭৬)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 3420,
			"arabicnumber": 3420,
			"text": "قَالَ عَلِيٌّ وَهُوَ قَوْلُ عَائِشَةَ مَا أَلْفَاهُ السَّحَرُ عِنْدِيْ إِلَّا نَائِمًا ‘আলী (ইবনু মদ্বীনী) (রহ.) বলেন, এটাই ‘আয়িশাহ (রাঃ)-এর কথা যে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সর্বদা সাহরীকালে আমার নিকট নিদ্রিত থাকতেন। ৩৪২০. ‘আবদুল্লাহ ইবনু ‘আমর (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে বলেছেন, আল্লাহর নিকট অধিক পছন্দনীয় সওম হলো দাঊদ (আঃ)-এর নিয়মে সওম পালন করা। তিনি একদিন সওম পালন করতেন আর একদিন বিরত থাকতেন। আল্লাহর নিকট সবচেয়ে পছন্দনীয় সালাত হলো দাঊদ (আঃ)-এর নিয়মে সালাত আদায় করা। তিনি রাতের অর্ধাংশ ঘুমাতেন, রাতের এক তৃতীয়াংশ সালাতে দাঁড়াতেন আর বাকী ষষ্ঠাংশ আবার ঘুমাতেন। (১১৩১) (আধুনিক প্রকাশনীঃ ৩১৬৮, ইসলামিক ফাউন্ডেশনঃ ৩১৭৭)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 3421,
			"arabicnumber": 3421,
			"text": "قَالَ مُجَاهِدٌ الْفَهْمُ فِي الْقَضَاءِ وَلَا تُشْطِطْ لَا تُسْرِفْ وَاهْدِنَآ إِلٰى سَوَآءِ الصِّرَاطِ (ص : 22) إِنَّ هٰذَآ أَخِيْ لَهُ تِسْعٌ وَتِسْعُوْنَ نَعْجَةً (ص : 23) يُقَالُ لِلْمَرْأَةِ نَعْجَةٌ وَيُقَالُ لَهَا أَيْضًا شَاةٌ وَلِيْ نَعْجَةٌ وَّاحِدَةٌ فَقَالَ أَكْفِلْنِيْهَا مِثْلُ وَكَفَلَهَا زَكَرِيَّاءُ (آل عمران : 37) ضَمَّهَا وَعَزَّنِي غَلَبَنِيْ صَارَ أَعَزَّ مِنِّيْ أَعْزَزْتُهُ جَعَلْتُهُ عَزِيْزًا فِيْ الْخِطَابِ يُقَالُ الْمُحَاوَرَةُ قَالَ لَقَدْ ظَلَمَكَ بِسُؤَالِ نَعْجَتِكَ إِلٰى نِعٰجِهِ (ص : 24) وَإِنَّ كَثِيْرًا مِّنْ الْخُلَطَآءِ الشُّرَكَآءِ لَيَبْغِي إِلَى قَوْلِهِ أَنَّمَا فَتَنَّاهُ (ص : 24) قَالَ ابْنُ عَبَّاسٍ اخْتَبَرْنَاهُ وَقَرَأَ عُمَرُ فَتَّنَّاهُ بِتَشْدِيْدِ التَّاءِ فَاسْتَغْفَرَ رَبَّه” وَخَرَّ رٰكِعًا وَأَنٰبَ (ص : 24) মুজাহিদ (রহ.) বলেন, فَصْلَ الْخِطَابِ অর্থ বিচার-ফায়সালার সঠিক জ্ঞান। وَلَا تُشْطِطْ অবিচার করবে না। (আল্লাহর বাণী) আমাদের সঠিক পথ নির্দেশ করুন। এ আমার ভাই, তার আছে নিরানব্বইটি দুম্বা এবং আমার আছে মাত্র একটি দুম্বা। نَعْجَةً মহিলা এবং বকরী উভয়কে বলা হয়ে থাকে- সে বলে আমার যিম্মায় এটি দিয়ে দাও। এ বাক্য كَفَلَهَا زَكَرِيَّاءُ -এর মত অর্থাৎ যাকারিয়া তার যিম্মায় মারইয়ামকে নিয়ে নিলেন। وَعَزَّنِيْ في الْخِطَابِ এবং কথায় সে আমার প্রতি কঠোরতা প্রদর্শন করেছে। عَزَّنِيْ অর্থ আমার উপর সে প্রবল হয়েছে। আমার চেয়ে সে প্রবল। أَعْزَزْتُهُ অর্থ তাকে আমি প্রবল করে দিলাম।خِطَابِ অর্থ কথা-বাক্যালাপ। (আল্লাহর বাণী) দাঊদ বললেনঃ এ ব্যক্তি তোমার দুম্বাটিকে তার দুম্বাগুলোর সাথে সংযুক্ত করার দাবি করে তোমার প্রতি অবশ্যই জুলুম করেছে। আর অধিকাংশ শরীকেরাই একে অন্যের উপর অন্যায় আচরণ করে থাকে- (সোয়াদ ২৪)। الْخُلَطَاءِ অর্থ শরীকগণ فَتَّنَّاهُ ইবনু ‘আব্বাস (রাঃ) বলেন, এর অর্থ পরীক্ষা করলাম। ‘উমার (রাঃ) فَتَّنَّاهُ শব্দে تاء হরফে তাশদীদ দিয়ে পাঠ করেছেন। (আল্লাহর বাণী) অতএব তিনি তার রবের সমীপে ক্ষমা প্রার্থনা করলেন এবং সিজদায় লুটিয়ে পড়লেন ও তাঁর অভিমুখী হলেন। (সোয়াদ ২৪) ৩৪২১. মুজাহিদ (রহ.) হতে বর্ণিত। তিনি বলেন, আমি ইবনু ‘আব্বাস (রাঃ)-কে জিজ্ঞেস করলাম, আমরা কি সূরা ছোয়াদ পাঠ করে সাজ্দাহ করবো? তখন তিনি وَمِنْ ذُرِّيَّتِهِ دَاوُدَ وَسُلَيْمَانَ হতে فَبِهُدَاهُمُ اقْتَدِهْ পর্যন্ত আয়াত তিলাওয়াত করলেন। অতঃপর ইবনু ‘আব্বাস (রাঃ) বললেন, তোমাদের নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঐ সব মহান ব্যক্তিদের একজন, যাঁদেরকে পূর্ববর্তীদের অনুসরণ করতে নির্দেশ দেয়া হয়েছিল। (৬ঃ ৮৪-৯০) (৪৬৩২, ৪৮০৬, ৪৮০৭) (আধুনিক প্রকাশনীঃ ৩১৬৯, ইসলামিক ফাউন্ডেশনঃ ৩১৭১)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 3422,
			"arabicnumber": 3422,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, সূরা ছোয়াদের সিজ্দা একান্ত জরুরী নয়। কিন্তু আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে এ সূরায় সিজ্দা করতে দেখেছি। (১০৬৯) (আধুনিক প্রকাশনীঃ ৩১৭০, ইসলামিক ফাউন্ডেশনঃ ৩১৭৯)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 3423,
			"arabicnumber": 3423,
			"text": "وَوَهَبْنَا لِدَاو”دَ سُلَيْمَانَ نِعْمَ الْعَبْدُ إِنَّه” أَوَّابٌ (ص : 30) আর আমি দাঊদকে দান করলাম সুলাইমান। সে ছিল অতি উত্তম বান্দা। তিনি তো ছিলেন অতিশয় আল্লাহ অভিমুখী। (সোয়াদ ৩০) الرَّاجِعُ الْمُنِيْبُ وَقَوْلِهِ وَهَبْ لِيْ مُلْكًا لَا يَنْبَغِيْ لِأَحَدٍ مِّنْ بَعْدِيْ (ص : 35) وَقَوْلِهِ وَاتَّبَعُوْا مَا تَتْلُوا الشَّيَاطِيْنُ عَلٰى مُلْكِ سُلَيْمَانَ (البقرة : 102) وَلِسُلَيْمٰنَ الرِّيْحَ غُدُوُّهَا شَهْرٌوَرَوَاحُهَا شَهْرٌ (سبأ : 12) وَأَسَلْنَا لَهُ عَيْنَ الْقِطْرِ (سبأ : 12) أَذَبْنَا لَهُ عَيْنَ الْحَدِيْدِ وَمِنَ الْجِنِّ مَنْ يَّعْمَلُ بَيْنَ يَدَيْهِ إِلَى قَوْلِهِ مِنْ مَّحَارِيْبَ (سبأ : 12) قَالَ مُجَاهِدٌ بُنْيَانٌ مَا دُوْنَ الْقُصُوْرِ وَتَمَاثِيْلَ وَجِفَانٍ كَالْجَوَابِ (سبأ : 12) كَالْحِيَاضِ لِلْإِبِلِ وَقَالَ ابْنُ عَبَّاسٍ كَالْجَوْبَةِ مِنْ الأَرْضِ وَقُدُوْرٍ رَاسِيَاتٍ اعْمَلُوْا آلَ دَاوُدَ شُكْرًا وَقَلِيْلٌ مِنْ عِبَادِيَ الشَّكُوْرُ (سبأ : 12) فَلَمَّا قَضَيْنَا عَلَيْهِ الْمَوْتَ مَا دَلَّهُمْ عَلٰى مَوْتِهٰ إِلَّا دَآبَّةُ الأَرْضِ الأَرَضَةُ تَأْكُلُ مِنْسَأَتَهُ عَصَاهُ فَلَمَّا خَرَّ إِلَى قَوْلِهِ فِي الْعَذَابِ الْمُهِيْنِ (سبأ : 13-14) حُبَّ الْخَيْرِ عَنْ ذِكْرِ رَبِّي (ص : 32) فَطَفِقَ مَسْحًا بِالسُّوقِ (ص : 33) وَالأَعْنَاقِ يَمْسَحُ أَعْرَافَ الْخَيْلِ وَعَرَاقِيْبَهَا الْأَصْفَادُ الْوَثَاقُ قَالَ مُجَاهِدٌ الصَّافِنَاتُ صَفَنَ الْفَرَسُ رَفَعَ إِحْدَى رِجْلَيْهِ حَتَّى تَكُوْنَ عَلَى طَرَفِ الْحَافِرِ الْجِيَادُ السِّرَاعُ جَسَدًا شَيْطَانًا رُخَآءً طَيِّبَةً حَيْثُ أَصَابَ حَيْثُ شَاءَ فَامْنُنْ أَعْطِ بِغَيْرِ حِسَابٍ بِغَيْرِ حَرَجٍ أَوَّابٌ অর্থ গোনাহ হতে ফিরে যে আল্লাহ্ অভিমুখী হয়। মহান আল্লাহর বাণীঃ তিনি প্রার্থনা করলেনঃ হে আমার রব! আমাকে ক্ষমা করুন এবং আমাকে এমন রাজ্য দান করুন, যা আমি ছাড়া আর কারও ভাগ্যে যেন না জোটে- (সোয়াদ ৩৫)। মহান আল্লাহর বাণীঃ তারা তা অনুসরণ করল যা শয়তানরা আবৃত্তি করত সুলাইমানের রাজত্বকালে- (আল-বাকারাহ ১০২) মহান আল্লাহর বাণীঃ আমি বায়ুকে সুলায়মানের অধীন করে দিলাম যা সকালে এক মাসের পথ অতিক্রম করত এবং বিকালে এক মাসের পথ অতিক্রম করত। আর আমি তার জন্য বিগলিত তামার এক প্রস্রবণ প্রবাহিত করেছিলাম। أَسَلْنَا অর্থ বিগলিত করে দিলাম عَيْنَ الْقِطْرِ অর্থ লোহার প্রসবণ-আর কতক জ্বিন তাঁর রবের নির্দেশে তার সামনে কাজ করতো। তাদের যে কেউ আমার আদেশ অমান্য করে, তাকে জ্বলন্ত আগুনের শাস্তি আস্বাদন করাব। জ্বিনেরা সুলায়মানের ইচ্ছানুযায়ী তার জন্য প্রাসাদ তৈরি করত। মুজাহিদ (রহ.) বলেন, مَحَارِيْبَ অর্থ বড় বড় দালানের তুলনায় ছোট ইমারত-ভাস্কর্য শিল্প প্রস্তুত করতো, আর হাউজ সদৃশ বৃহদাকার রান্না করার পাত্র তৈরি করতো- যেমন উটের জন্য হাওম থাকে। ইবনু ‘আব্বাস (রাঃ) বলেন, যেমন যমীনে গর্ত থাকে। আর তৈরি বিশাল বিশাল ডেকচি যা সুদৃঢ়ভাবে স্থাপিত। হে দাউদের পরিবার! আমার কৃতজ্ঞতার সঙ্গে তোমরা কাজ কর। আর আমার বান্দাগণের মধ্যে অল্পই শুকুর গুযারী করে- (সাবা ১২-১৩)। إِلَّا دَابَّةُ الأرْضِ কেবল মাটির পোকা অর্থাৎ উই পোকা যা তার (সুলায়মানের) লাঠি খেতেছিল। مِنْسَأَتَهُ তার লাঠি। যখন সে (সুলায়মান) পড়ে গেল....লাঞ্ছনাদায়ক শাস্তিতে- (সাবা ১৪) মহান আল্লাহর বাণীঃ সম্পদের মোহে আমার রবের স্মরণ থেকে-আয়াতাংশে عن অর্থ فَطَفِقَ مَسْحًا - من অর্থ তিনি (সুলায়মান আ) ঘোড়াগুলোর গর্দানসমূহ ও তাদের হাঁটুর নলাসমূহ কাটতে লাগলেন। الأَصْفَادُ অর্থ, শৃক্মখলসমূহ। মুজাহিদ (রহ.) বলেন, الصَّافِنَاتُ অর্থ, দৌড়ের জন্য প্রস্তুত ঘোড়াসমূহ। এ অর্থ صَفَنَ الْفَرَسُ হতে গৃহীত। ঘোড়া যখন দৌড়ের জন্য প্রস্তুতি নিয়ে এক পা উঠিয়ে অন্য পায়ের খুরার উপর দাঁড়িয়ে যায়, তখন এ বাক্য বলা হয়। الْجِيَادُ অর্থ দ্রুতগামী, جَسَدًا শয়তান رُخَاءً -উত্তম حَيْثُ أَصَابَ যেখানে ইচ্ছা فَامْنُنْ দান কর بِغَيْرِ حِسَابٍ নির্দ্বিধায়। (সদ ৩১-৩৮) ৩৪২৩. আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, একটি অবাধ্য জ্বিন এক রাতে আমার সালাতে বাধা সৃষ্টির উদ্দেশ্যে আমার নিকট আসল। আল্লাহ্ আমাকে তার উপর ক্ষমতা প্রদান করলেন। আমি তাকে ধরলাম এবং মসজিদের একটি খুঁটির সঙ্গে বেঁধে রাখার ইচ্ছে করলাম, যাতে তোমরা সবাই স্বচক্ষে তাকে দেখতে পাও। তখনই আমার ভাই সুলায়মান (আঃ)-এর এ দু‘আটি আমার মনে পড়লো। হে আমার রব! আমাকে ক্ষমা করুন এবং আমাকে এমন রাজ্য দান করুন, যা আমি ছাড়া আর কারও ভাগ্যে যেন না জোটে- (সোয়াদ ৩৫)। অতঃপর আমি জ্বিনটিকে ব্যর্থ এবং লাঞ্ছিত করে ছেড়ে দিলাম। জ্বিন কিংবা মানুষের অত্যন্ত পিশাচ ব্যক্তিকে ইফ্রীত বলা হয়। ইফ্রীত ও ইফ্রীয়াতুন যিব্নীয়াতুন-এর মত এক বচন, যার বহু বচন যাবানিয়াতুন। (৪৬১) (আধুনিক প্রকাশনীঃ ৩১৭১, ইসলামিক ফাউন্ডেশনঃ ৩১৮০)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 3424,
			"arabicnumber": 3424,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, সুলায়মান ইবনু দাঊদ (আঃ) বলেছিলেন, আজ রাতে আমি আমার সত্তর জন স্ত্রীর নিকট যাব। প্রত্যেক স্ত্রী একজন করে অশ্বারোহী যোদ্ধা গর্ভধারণ করবে। এরা আল্লাহর পথে জিহাদ করবে। তখন তাঁর সাথী বললেন, ইন্শা আল্লাহ্। কিন্তু তিনি মুখে তা বললেন না। অতঃপর একজন স্ত্রী ছাড়া কেউ গর্ভধারণ করলেন না। সে যাও এক (পুত্র) সন্তান প্রসব করলেন যার এক অঙ্গ ছিল না। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তিনি যদি ‘ইন্শা আল্লাহ্’ মুখে বলতেন, তাহলে আল্লাহর পথে জিহাদ করতো। শু‘আয়ব এবং ইবনু আবূ যিনাদ (রহ.) এখানে নব্বই জন স্ত্রীর কথা উল্লেখ করেছেন আর এটাই সঠিক। (২৮১৯, মুসলিম ২৭/৫ হাঃ ১৬৫৪, আহমাদ ৭১৪) আধুনিক প্রকাশনীঃ ৩১৭২, ইসলামিক ফাউন্ডেশনঃ ৩১৮১",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 3425,
			"arabicnumber": 3425,
			"text": "আবূ যার (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি বললাম, হে আল্লাহর রাসূল! সর্বপ্রথম কোন্ মাসজিদটি নির্মাণ করা হয়েছে। তিনি বললেন, মসজিদে হারাম। আমি বললাম, অতঃপর কোনটি? তিনি বললেন, মসজিদে আকসা। আমি বললাম, এ দু’য়ের নির্মাণের মাঝখানে কত তফাৎ? তিনি বললেন, চল্লিশ (বছরের)[১] (অতঃপর তিনি বললেন,) যেখানেই তোমার সালাতের সময় হবে, সেখানেই তুমি সালাত আদায় করে নিবে। কারণ, পৃথিবীটাই তোমার জন্য মাসজিদ। (৩৩৬৬) (আধুনিক প্রকাশনীঃ ৩১৭৩, ইসলামিক ফাউন্ডেশনঃ ৩১৮২)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 3427,
			"arabicnumber": 3427,
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 3428,
			"arabicnumber": 3428,
			"text": "‘আবদুল্লাহ (ইবনু মাস‘ঊদ) (রাঃ) হতে বর্ণিত। তিনি বলেন, যখন এ আয়াত নাযিল হলঃ যারা ঈমান এনেছে এবং তাদের ঈমানকে জুলুমের দ্বারা কলুষিত করেনি- (আল-আন‘আম ৮২)। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সাহাবীগণ বললেন, আমাদের মধ্যে কোন ব্যক্তি আছে যে, নিজের ঈমানকে জুলুমের দ্বারা কলুষিত করেনি? তখন এ আয়াত নাযিল হয়ঃ আল্লাহর সঙ্গে শরীক করো না। কেননা শির্ক হচ্ছে এক মহা জুলুম- (লুকমান ১৮)। (৩২) (আধুনিক প্রকাশনীঃ ৩১৭৫, ইসলামিক ফাউন্ডেশনঃ ৩১৮৪)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 3429,
			"arabicnumber": 3429,
			"text": "‘আবদুল্লাহ (ইবনু মাস‘ঊদ) (রাঃ) হতে বর্ণিত। তিনি বলেন, যখন এ আয়াতে কারীমা নাযিল হলঃ যারা ঈমান এনেছে এবং তাদের ঈমানকে জুলুমের দ্বারা কলুষিত করেনি। তখন তা মুসলিমদের পক্ষে কঠিন হয়ে গেল। তারা আরয করলেন, হে আল্লাহর রাসূল! আমাদের মধ্যে কোন ব্যক্তি আছে যে নিজের উপর য়ুল্ম করেনি? তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, এখানে অর্থ তা নয় বরং এখানে জুলুমের অর্থ হলো শির্ক। তোমরা কি কুরআনে শুননি লুকমান তাঁর ছেলেকে নাসীহাত দেয়ার সময় কী বলেছিলেন? তিনি বলেছিলেন, ‘‘হে আমার বৎস! তুমি আল্লাহর সঙ্গে শির্ক করো না। কেননা, নিশ্চয়ই শির্ক এক মহা জুলুম। (৩২) (আধুনিক প্রকাশনীঃ ৩১৭৬, ইসলামিক ফাউন্ডেশনঃ ৩১৮৫)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 3430,
			"arabicnumber": 3430,
			"text": "بَابُ وَاضْرِبْ لَهُمْ مَثَلًا أَصْحٰبَ الْقَرْيَةِ الآية (يس : 13) الْآيَةَ فَعَزَّزْنَا ৬০/৪২. অধ্যায় : মহান আল্লাহর বাণীঃ আপনি তাদের কাছে এক জনপদের সে সময়ের ঘটনা বর্ণনা করুন, যখন তাদের কাছে কয়েকজন রাসূল এসেছিলেন। (ইয়াসীন ১৩) قَالَ مُجَاهِدٌ شَدَّدْنَا وَقَالَ ابْنُ عَبَّاسٍ طَائِرُكُمْ مَصَائِبُكُمْ মুজাহিদ(রহ.) বলেন, فَعَزَّزْنَا অর্থ আমি শক্তিশালী করলাম। আর ইবনু ‘আব্বাস (রাঃ) বলেন, طَائِرُكُمْ অর্থ তোমাদের বিপদসমূহ। ذِكْرُ رَحْمَةِ رَبِّكَ عَبْدَهচ زَكَرِيَّا إِذْ نَادٰى رَبَّهচ نِدَآءً خَفِيًّا قَالَ رَبِّ إِنِّيْ وَهَنَ الْعَظْمُ مِنِّيْ وَاشْتَعَلَ الرَّأْسُ شَيْبًا إِلَى قَوْلِهِ لَمْ نَجْعَلْ لَّهُ مِنْ قَبْلُ سَمِيًّا (مريم : ১-২) এ হল আপনার রবের অনুগ্রহের বিবরণ যা তাঁর বান্দা যাকারিয়ার প্রতি করা হয়েছে। ইতিপূর্বে আমি এ নামে কারও নামকরণ করিনি। (মারইয়াম ২-৭) قَالَ ابْنُ عَبَّاسٍ مِثْلًا يُقَالُ رَضِيًّا مَرْضِيًّا عُتِيًّا عَصِيًّا عَتَا يَعْتُو قَالَ رَبِّ أَنَّى يَكُوْنُ لِيْ غُلَامٌ وَّكَانَتِ امْرَأَتِيْ عَاقِرًا وَقَدْ بَلَغْتُ مِنَ الْكِبَرِ عِتِيًّا إِلَى قَوْلِهِ ثَلٰثَ لَيَالٍ سَوِيًّا وَيُقَالُ صَحِيْحًا فَخَرَجَ عَلٰى قَوْمِهٰ مِنَ الْمِحْرَابِ فَأَوْحٰى إِلَيْهِمْ أَنْ سَبِّحُوْا بُكْرَةً وَّعَشِيًّا (مريم : ১০-১১) فَأَوْحَى فَأَشَارَ يٰيَحْيٰى خُذِ الْكِتَابَ بِقُوَّةٍ إِلَى قَوْلِهِ وَيَوْمَ يُبْعَثُ حَيًّا حَفِيًّا لَطِيْفًا عَاقِرًا الذَّكَرُ وَالْأُنْثَى سَوَاءٌ ইবনু ‘আব্বাস (রাঃ) বলেন, سَمِيَّا অর্থ-সমতুল্য। তেমন বলা হয় رَضِيَّا অর্থ مَرْضِيَّا পছন্দনীয়। عِتِيَّا অর্থ عَصِيَّا অর্থাৎ অবাধ্য عَتَا يَعْتُوْ থেকে গৃহীত। যাকারিয়া বললেন, হে আমার প্রতিপালক! কেমন করে আমার সন্তান হবে? আমার স্ত্রী তো বন্ধ্যা? আর আমিও তো বার্ধক্যের চূড়ান্তে পৌঁছেছি। তিনি বললেন, তোমার নিদর্শন হলো তুমি সুস্থ অবস্থায় তিন দিন কারো সঙ্গে কথাবার্তা বলবে না। অতঃপর তিনি মিহরাব হতে বের হয়ে তাঁর কাউমের নিকট আসলেন, আর ইঙ্গিতে তাদেরকে সকাল-সন্ধ্যায় আল্লাহর তাসবীহ পড়তে বললেন। فَأَوْحَى অর্থ, অতঃপর তিনি ইশারা করে বললেন। (আল্লাহ্ বললেন,) হে ইয়াহ্ইয়া! এ কিতাব শক্তভাবে ধারণ কর। যে দিন তিনি জীবিত পুনরুত্থিত হবেন- (মারইয়াম ২-১৫)। حَفِيًّا لَطِيْفًا অর্থে ব্যবহৃত হয়েছে। অর্থাৎ অতিশয় অনুগ্রহশীল। عَاقِرًا (বন্ধ্যা) শব্দটি পুং ও স্ত্রী উভয় লিঙ্গেই ব্যবহৃত হয়। ৩৪৩০. মালিক ইবনু সা‘সা‘আহ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সাহাবাগণের নিকট মিরাজের রাত্রির বর্ণনায় বলেছেন, তারপর তিনি আমাকে নিয়ে উপরে চললেন, এমনকি দ্বিতীয় আকাশে এসে পৌঁছলেন এবং দরজা খুলতে বললেন, জিজ্ঞেস করা হলো কে? বললেন, আমি জিব্রাঈল। প্রশ্ন হলো। আপনার সঙ্গে কে? তিনি বললেন, মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম। জিজ্ঞেস করা হলো। তাঁকে কি ডেকে পাঠানো হয়েছে? উত্তর দিলেন হাঁ, অতঃপর আমরা যখন সেখানে পৌঁছলাম তখন সেখানে ইয়াহ্ইয়া ও ‘ঈসা (আঃ)-কে দেখলাম। তাঁরা উভয়ে খালাত ভাই ছিলেন। জিব্রাঈল বললেন, এঁরা হলেন, ইয়াহ্ইয়া এবং ‘ঈসা (আঃ)। তাদেরকে সালাম করুন। তখন আমি সালাম দিলাম। তাঁরাও সালামের জবাব দিলেন। অতঃপর তাঁরা বললেন, নেক ভাই এবং নেক নবীর প্রতি মারহাবা। (৩২০৭) (আধুনিক প্রকাশনীঃ ৩১৭৭, ইসলামিক ফাউন্ডেশনঃ ৩১৮৬)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 3431,
			"arabicnumber": 3431,
			"text": "وَاذْكُرْ فِي الْكِتَابِ مَرْيَمَ إِذِ انْتَبَذَتْ مِنْ أَهْلِهَا مَكَانًا شَرْقِيًّا (مريم : 16) إِذْ قَالَتِ الْمَلٰٓئِكَةُ يٰمَرْيَمُ إِنَّ اللهَ يُبَشِّرُكِ بِكَلِمٰةٍ (آل عمران : 45) إِنَّ اللهَ اصْطَفٰى اٰدَمَ وَنُوْحًا وَّاٰلَ إِبْرَاهِيْمَ وَاٰلَ عِمْرَانَ عَلَى الْعٰلَمِيْنَ إِلَى قَوْلِهِ يَرْزُقُ مَنْ يَّشَآءُ بِغَيْرِ حِسَابٍ (آل عمران : 33) আর স্মরণ কর, কিতাবে মারিয়ামের ঘটনা। যখন তিনি স্বীয় পরিবার-পরিজন হতে পৃথক হলেন.....। (মারইয়াম ১৬) মহান আল্লাহর বাণীঃ স্মরণ কর, যখন ফেরেশতারা বললঃ হে মারইয়াম! নিশ্চয় আল্লাহ তাঁর তরফ থেকে তোমাকে একটি কালিমার সুসংবাদ দিচ্ছেন। (আলে ইমরান ৪৫) মহান আল্লাহর বাণীঃ আল্লাহ্ আদম (আঃ), নূহ (আঃ) ও ইব্রাহীম (আঃ)-এর বংশধর এবং ইমরানের বংশধরকে পৃথিবীতে মনোনীত করেছেন.....বে-হিসাব দিয়ে থাকেন। (আলে ইমরান ৩৩-৩৭) قَالَ ابْنُ عَبَّاسٍ وَآلُ عِمْرَانَ الْمُؤْمِنُوْنَ مِنْ آلِ إِبْرَاهِيْمَ وَآلِ عِمْرَانَ وَآلِ يَاسِيْنَ وَآلِ مُحَمَّدٍ يَقُوْلُ إِنَّ أَوْلَى النَّاسِ بِإِبْرٰهِيْمَ لَلَّذِيْنَ اتَّبَعُوْهُ (آل عمران : 68) وَهُمْ الْمُؤْمِنُوْنَ وَيُقَالُ آلُ يَعْقُوْبَ أَهْلُ يَعْقُوْبَ فَإِذَا صَغَّرُوْا آلَ ثُمَّ رَدُّوْهُ إِلَى الأَصْلِ قَالُوْا أُهَيْلٌ ঈব্নু ‘আব্বাস (রাঃ) বলেছেন, আলু-ইমরান অর্থাৎ মু’মিনগণ। যেমন, আলু-ইব্রাহীম, আলূ ইয়াসীন এবং আলু মুহাম্মাদ। আল্লাহ্ তা‘আলা বলেনঃ সমস্ত মানুষের মধ্যে ইব্রাহীমের সব থেকে ঘনিষ্ঠ হলো তারা, যারা তাঁর অনুসরণ করে। আর তারা হলেন মু’মিনগণ। آلُ এর মূল হলো أَهْلُ আর أَهْلُ কে ছোট অর্থে করা হলে তা أُهَيْلٌ হয়। ৩৪৩১. আবূ হুরাইরাহ্ (রাঃ) বলেন, আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি, এমন কোন আদম সন্তান নেই, যাকে জন্মের সময় শয়তান স্পর্শ করে না। জন্মের সময় শয়তানের স্পর্শের কারণেই সে চিৎকার করে কাঁদে। তবে মারইয়াম এবং তাঁর ছেলে (ঈসা) (আঃ)-এর ব্যতিক্রম। অতঃপর আবূ হুরাইরাহ্ বলেন, ‘‘হে আল্লাহ্! নিশ্চয় আমি আপনার নিকট তাঁর এবং তাঁর বংশধরদের জন্য বিতাড়িত শয়তান হতে আশ্রয় প্রার্থনা করছি। (৩২৮৬, মুসলিম ৪৩/৪০ হাঃ ২৩৬৬, আহমাদ ৭১৮৫) (আধুনিক প্রকাশনীঃ ৩১৭৮, ইসলামিক ফাউন্ডেশনঃ ৩১৮৭)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 3432,
			"arabicnumber": 3432,
			"text": "وَإِذْ قَالَتِ يٰمَرْيَمُ إِنَّ اللهَ اصْطَفَاكِ وَطَهَّرَكِ وَاصْطَفَاكِ عَلٰى نِسَآءِ الْعٰلَمِيْنَ يٰمَرْيَمُ اقْنُتِيْ لِرَبِّكِ وَاسْجُدِيْ وَارْكَعِيْ مَعَ الرَّاكِعِيْنَ ذٰلِكَ مِنْ أَنْبَآءِ الْغَيْبِ نُوْحِيْهِ إِلَيْكَ وَمَا كُنْتَ لَدَيْهِمْ إِذْ يُلْقُوْنَ أَقْلٰمَهُمْ أَيُّهُمْ يَكْفُلُ مَرْيَمَ وَمَا كُنْتَ لَدَيْهِمْ إِذْ يَخْتَصِمُوْنَ (آل عمران : 42) يُقَالُ يَكْفُلُ يَضُمُّ كَفَلَهَا ضَمَّهَا مُخَفَّفَةً لَيْسَ مِنْ كَفَالَةِ الدُّيُونِ وَشِبْهِهَا আর যখন ফেরেশতারা বলল, হে মারইয়াম! আল্লাহ তোমাকে পছন্দ করেছেন এবং তোমাকে পবিত্র পরিচ্ছন্ন করে দিয়েছেন। আর তোমাকে বিশ্ব নারী সমাজের উর্দ্ধে মনোনীত করেছেন। হে মারইয়াম তোমার পালনকর্তার উপাসনা কর এবং রুকুকারীদেও সাথে সিজদা ও রুকু কর। এ হলো গায়েবী সংবাদ, যা আমি আপনাকে পাঠিয়ে থাকি। আর আপনি তো তাদেও কাছে ছিলেন না, যখন প্রতিযোগিতা করছিল যে, কে প্রতিপালন করবে মারইয়ামকে এবং আপনি তাদেও কাছে ছিলেন ন, যখন তারা ঝগড়া করছিলো। (আলে ইমরান ৪২-৪৪) বলা হয় يَكْفُلُ অর্থ يَضُمُّ অর্থাৎ নিজ তত্ত্বাবধানে নেয়া। كَفَّلَهَا অর্থ স্বীয় তত্ত্বাবধানে নিল। লালন-পালনের দায়িত্ব গ্রহণ করা, ঋণ-করযের দায়িত্ব গ্রহণও এ ধরনের কিছু নয়। ৩৪৩২. ‘আলী (রাঃ) বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে এ কথা বলতে শুনেছি যে, সমগ্র নারীদের মধ্যে ইমরানের কন্যা মারইয়াম হলেন সর্বোত্তম আর নারীদের সেরা হলেন খাদীজা (রাঃ)। (৩৮১৫, মুসলিম ৪৪/১২ হাঃ ২৪৩০) (আধুনিক প্রকাশনীঃ ৩১৭৯, ইসলামিক ফাউন্ডেশনঃ ৩১৮৮)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 3433,
			"arabicnumber": 3433,
			"text": "إِذْ قَالَتِ الْمَلٰٓئِكَةُ يَا مَرْيَمُ إِنَّ اللهَ يُبَشِّرُكِ بِكَلِمَةٍ مِّنْهُ اسْمُهُ الْمَسِيْحُ عِيْسَى ابْنُ مَرْيَمَ إِلَى قَوْلِهِ فَإِنَّمَا يَقُوْلُ لَه” كُنْ فَيَكُوْنُ (آل عمران : 45-47) يُبَشِّرُكِ وَ يَبْشُرُكِ وَاحِدٌ وَجِيْهًا شَرِيْفًا وَقَالَ إِبْرَاهِيْمُ المَسِيْحُ الصِّدِّيقُ وَقَالَ مُجَاهِدٌ الْكَهْلُ الْحَلِيْمُ وَالْأَكْمَهُ مَنْ يُبْصِرُ بِالنَّهَارِ وَلَا يُبْصِرُ بِاللَّيْلِ وَقَالَ غَيْرُهُ مَنْ يُوْلَدُ أَعْمَى স্মরণ কর, যখন ফেরেশতারা বললঃ হে মারইয়াম! নিশ্চয় আল্লাহ তাঁর তরফ থেকে তোমাকে একটি কালিমার সুসংবাদ দিচ্ছেন, তার নাম মাসীহ ঈসা ইবনু মারইয়াম ...হও অমনি তা হয়ে যায়।’’ (আলে ইমরান ৪৫) يُبَشِّرُكِ আর يَبْشُرُكِ উভয়ের একই অর্থ। وَجِيْهًا অর্থ সম্মানিত আর ইব্রাহীম (রহ.) বলেন, মসীহ শব্দের অর্থ সিদ্দীক। মুজাহিদ (রহ.) বলেছেন, الْكَهْلُ অর্থ الْحَلِيْمُ অর্থ, সহনশীল আর الأَكْمَهُ অর্থ হলো, রাতকানা যে দিনে দেখে আর রাতে দেখতে পায় না। অন্যেরা বলেন, যে অন্ধ হয়ে জন্মেছে (সে হলো الأَكْمَهُ)। ৩৪৩৩. আবূ মূসা আল-আশ‘আরী (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, সকল নারীর উপর ‘আয়িশাহর মর্যাদা এমন, যেমন সকল খাদ্যের উপর সারীদের মর্যাদা। পুরুষদের মধ্যে অনেকেই পূর্ণাঙ্গতা অর্জন করেছেন। কিন্তু নারীদের মধ্যে ইমরানের কন্যা মারইয়াম এবং ফির‘আউনের স্ত্রী আছিয়া ছাড়া কেউ পূর্ণাঙ্গতা অর্জন করতে পারেনি। (৩৪১১) (আধুনিক প্রকাশনীঃ ৩১৮০ প্রথমাংশ, ইসলামিক ফাউন্ডেশনঃ ৩১৮৯ প্রথমাংশ)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 3434,
			"arabicnumber": 3434,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি, কুরাইশ বংশীয়া নারীরা উটে আরোহণকারী সকল নারীদের তুলনায় উত্তম। এরা শিশু সন্তানের উপর অধিক স্নেহশীলা হয়ে থাকে আর স্বামীর সম্পদের প্রতি খুব যত্নবান হয়ে থাকে। অতঃপর আবূ হুরাইরাহ্ (রাঃ) বলেছেন, ইমরানের কন্যা মারইয়াম কখনও উটে আরোহণ করেননি। ইবনু আখী যুহরী ও ইসহাক কালবী (রহ.) যুহরী (রহ.) হতে হাদীস বর্ণনায় ইউনুস (রহ.)-এর অনুসরণ করেছেন। (৫০৮২, ৫৩৬৫, মুসলিম ৪৪/৪৯ হাঃ ২৫২৭, আহমাদ ৭৬৫৪) (আধুনিক প্রকাশনীঃ ৩১৮০ শেষাংশ, ইসলামিক ফাউন্ডেশনঃ ৩১৮৯ শেষাংশ)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 3435,
			"arabicnumber": 3435,
			"text": "يٰٓأَهْلَ الْكِتَابِ لَا تَغْلُوْا فِيْ دِيْنِكُمْ وَلَا تَقُوْلُوْا عَلَى اللهِ إِلَّا الْحَقَّ إِنَّمَا الْمَسِيْحُ عِيْسَى ابْنُ مَرْيَمَ رَسُوْلُ اللهِ وَكَلِمٰتُهُ أَلْقٰهَا إِلٰى مَرْيَمَ وَرُوْحٌ مِّنْهُ فَاٰمِنُوْا بِاللهِ وَرُسُلِهِ وَلَا تَقُوْلُوْا ثَلٰثَةٌ اِنْتَهُوْا خَيْرًا لَّكُمْ إِنَّمَا اللهُ إِلٰهٌ وَّاحِدٌ سُبْحٰنَه” أَنْ يَّكُوْنَ لَه” وَلَدٌ لَه” مَا فِي السَّمٰوٰتِ وَمَا فِي الْأَرْضِ وَكَفٰى بِاللهِ وَكِيْلًا (النساء : 171) قَالَ أَبُوْ عُبَيْدٍ كَلِمٰتُهُ كُنْ فَكَانَ وَقَالَ غَيْرُهُ وَرُوْحٌ مِنْهُ أَحْيَاهُ فَجَعَلَهُ رُوْحًا وَلَا تَقُوْلُوْا ثَلَاثَةٌ ‘‘হে আহলে কিতাব! তোমরা তোমাদের মধ্যে বাড়াবাড়ি করো না.....অভিভাবক হিসেবে।’’ (আন্-নিসা ১৭১) আবূ উবাইদাহ (রহ.) বলেন আল্লাহর كَلِمَتُهُ হচ্ছে ‘‘হও, অমনি তা হয়ে যায়। আর অন্যরা বলেন وَرُوْحٌ منه অর্থ তাকে আয়ু দান করলেন তাই তাকে وَرُوْحٌ নাম দিলেন। وَلَا تَقُوْلُوْا ثَلَاثَةٌ তোমরা তিন ইলাহ বল না। ৩৪৩৫. ‘উবাদাহ (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বর্ণিত। তিনি বলেন, যে ব্যক্তি সাক্ষ্য দিল, আল্লাহ্ ব্যতীত আর কোন ইলাহ নেই, তিনি একক, তাঁর কোন শরীক নেই আর মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর বান্দা ও রাসূল আর নিশ্চয়ই ‘ঈসা (আঃ) আল্লাহর বান্দা ও তাঁর রাসূল এবং তাঁর সেই কালিমাহ যা তিনি মারইয়ামকে পৌঁছিয়েছেন এবং তাঁর নিকট হতে একটি রূহ মাত্র, আর জান্নাত সত্য ও জাহান্নাম সত্য আল্লাহ্ তাকে জান্নাতে প্রবেশ করাবেন, তার ‘আমল যাই হোক না কেন। ওয়ালীদ (রহ.)....জুনাদাহ (রহ.) হতে বর্ণিত হাদীসে জুনাদাহ অতিরিক্ত বলেছেন যে, জান্নাতে আট দরজার যেখান দিয়েই সে চাইবে। (মুসলিম ১/১০ হাঃ ২৮, আহমাদ ২২৭৩৮) (আধুনিক প্রকাশনীঃ ৩১৮১, ইসলামিক ফাউন্ডেশনঃ ৩১৯০)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 3436,
			"arabicnumber": 3436,
			"text": "نَبَذْنَاهُ أَلْقَيْنَاهُ اعْتَزَلَتْ شَرْقِيًّا مِمَّا يَلِي الشَّرْقَ فَأَجَآءَهَا أَفْعَلْتُ مِنْ جِئْتُ وَيُقَالُ أَلْجَأَهَا اضْطَرَّهَا تَسَّاقَطْ تَسْقُطْ قَصِيًّا قَاصِيًا فَرِيًّا عَظِيْمًا قَالَ ابْنُ عَبَّاسٍ نِسْيًا لَمْ أَكُنْ شَيْئًا وَقَالَ غَيْرُهُ النِّسْيُ الْحَقِيْرُ وَقَالَ أَبُوْ وَائِلٍ عَلِمَتْ مَرْيَمُ أَنَّ التَّقِيَّ ذُوْ نُهْيَةٍ حِيْنَ قَالَتْ إِنْ كُنْتَ تَقِيًّا (مريم : 18) قَالَ وَكِيْعٌ عَنْ إِسْرَائِيْلَ عَنْ أَبِيْ إِسْحَاقَ عَنْ الْبَرَاءِ سَرِيًّا نَهَرٌ صَغِيْرٌ بِالسُّرْيَانِيَّةِ شَرْقِيًّا শব্দটি الشَّرْقَ শব্দ থেকে, যার অর্থ পূর্বদিকে। فَأَجَاءَهَا শব্দটি جِئْتُ হতে أفعَلَ এর রূপে হয়েছে। أَجَأهَا এর স্থলে الجَأهَا ও বলা হয়েছে যার অর্থ হবে তাকে অধীর করে তুললো। تَسَّاقَطْ শব্দটি تَسْقُطْ এর অর্থ দেবে। قَاصِيًا শব্দটি قَصِيًّا এর অর্থে ব্যবহৃত। فَرِيًّا অর্থ বিশাল। ইবনু ‘আব্বাস (রাঃ) বলেছেন, نِسْيًا অর্থ আমার অস্তিত্ব না থাকে। অন্যেরা বলেছেন, النِّسْيُ অর্থ তুচ্ছ, ঘৃণিত। আবূ ওয়ায়িল (রহ.) বলেছেন, মারিয়ামের উক্তি إِنْ كُنْتَ تَقِيًّا এর অর্থ যদি তুমি জ্ঞানী হও। ওকী‘ (রহ.)....বলেন, বারআ (রাঃ) হতে বর্ণিত। سَرِيًّا শব্দটির অর্থ সিরীয় ভাষায় ছোট নদী। ৩৪৩৬. আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, তিনজন শিশু ছাড়া আর কেউ দোলনায় থেকে কথা বলেনি। প্রথম জন ঈসা (আঃ), দ্বিতীয় জন বনী ইসরাঈলের এক ব্যক্তি যাকে ‘জুরাইজ’ নামে ডাকা হতো। একদা ‘ইবাদাতে রত থাকা অবস্থায় তার মা এসে তাকে ডাকল। সে ভাবল আমি কি তার ডাকে সাড়া দেব,না সালাত আদায় করতে থাকব। তার মা বলল, হে আল্লাহ্! ব্যাভিচারিণীর মুখ না দেখা পর্যন্ত তুমি তাকে মৃত্যু দিও না। জুরাইজ তার ‘ইবাদাতখানায় থাকত। একবার তার নিকট একটি নারী আসল। তার সঙ্গে কথা বলল। কিন্তু জুরাইজ তা অস্বীকার করল। অতঃপর নারীটি একজন রাখালের নিকট গেল এবং তাকে দিয়ে মনোবাসনা পূর্ণ করল। পরে সে একটি পুত্র সন্তান প্রসব করল। তাকে জিজ্ঞেস করা হলো এটি কার থেকে? স্ত্রী লোকটি বলল, জুরাইজ থেকে। লোকেরা তার নিকট আসল এবং তার ‘ইবাদাতখানা ভেঙ্গে দিল। আর তাকে নীচে নামিয়ে আনল ও তাকে গালি গালাজ করল। তখন জুরাইজ উযূ সেরে ‘ইবাদাত করল। অতঃপর নবজাত শিশুটির নিকট এসে তাকে জিজ্ঞেস করল হে শিশু! তোমার পিতা কে? সে জবাব দিল সেই রাখাল। তারা বলল, আমরা আপনার ‘ইবাদাতখানাটি সোনা দিয়ে তৈরি করে দিচ্ছি। সে বলল, না। তবে মাটি দিয়ে। (তৃতীয় জন) বনী ইসরাঈলের একজন নারী তার শিশুকে দুধ পান করাচ্ছিল। তার কাছ দিয়ে একজন সুদর্শন পুরুষ আরোহী চলে গেল। নারীটি দু‘আ করল, হে আল্লাহ্! আমার ছেলেটি তার মত বানাও। শিশুটি তখনই তার মায়ের স্তন ছেড়ে দিল এবং আরোহীটির দিকে মুখ ফিরালো। আর বলল, হে আল্লাহ্! আমাকে তার মত কর না। অতঃপর মুখ ফিরিয়ে স্তন্য পান করতে লাগল। আবূ হুরাইরাহ্ (রাঃ) বললেন, আমি যেন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে দেখতে পাচ্ছি তিনি আঙ্গুল চুষছেন। অতঃপর সেই নারীটির পার্শ্ব দিয়ে একটি দাসী চলে গেল। নারীটি বলল, হে আল্লাহ! আমার শিশুটিকে এর মত করো না। শিশুটি তারক্ষণিক তার মায়ের স্তন্য ছেড়ে দিল। আর বলল, হে আল্লাহ্! আমাকে তার মত কর। তার মা বলল, তা কেন? শিশুটি বলল, সেই আরোহীটি ছিল যালিমদের একজন। আর এ দাসীটির ব্যাপারে লোকে বলেছে তুমি চুরি করেছ, যিনা করেছ। অথচ সে কিছুই করেনি। (১২০৬, মুসলিম ৪৫/২ হাঃ ২৫৫০, আহমাদ ১০০৪৮) (আধুনিক প্রকাশনীঃ ৩১৮২, ইসলামিক ফাউন্ডেশনঃ ৩১৯১)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 3437,
			"arabicnumber": 3437,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, মিরাজের রাতে আমি মূসা (আঃ)-এর দেখা পেয়েছি। আবূ হুরাইরাহ্ (রাঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মূসা (আঃ)-এর আকৃতি বর্ণনা করেছেন। মূসা (আঃ) একজন দীর্ঘদেহধারী, মাথায় কোঁকড়ানো চুলবিশিষ্ট, যেন শানুআ গোত্রের একজন লোক। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, আমি ‘ঈসা (আঃ)-এর দেখা পেয়েছি। অতঃপর তিনি তাঁর চেহারা বর্ণনা করে বলেছেন, তিনি হলেন মাঝারি গড়নের গৌর বর্ণবিষ্টি, যেন তিনি এই মাত্র হাম্মামখানা থেকে বেরিয়ে এসেছেন। আর আমি ইব্রাহীম (আঃ)-কেও দেখেছি। তাঁর সন্তানদের মধ্যে আকৃতিতে আমিই তার অধিক সদৃশ। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, অতঃপর আমার সামনে দু’টি পেয়ালা আনা হল। একটিতে দুধ, অপরটিতে শরাব। আমাকে বলা হলো, আপনি যেটি ইচ্ছা গ্রহণ করতে পারেন। আমি দুধের বাটিটি গ্রহণ করলাম আর তা পান করলাম। তখন আমাকে বলা হলো, আপনি ফিত্রাত বা স্বভাবকেই গ্রহণ করে নিয়েছেন। দেখুন! আপনি যদি শরাব গ্রহণ করতেন, তাহলে আপনার উম্মাত পথভ্রষ্ট হয়ে যেত। (৩৩৯৪) (আধুনিক প্রকাশনীঃ ৩১৮৩, ইসলামিক ফাউন্ডেশনঃ ৩১৯২)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 3438,
			"arabicnumber": 3438,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, আমি ‘ঈসা (আঃ), মূসা (আঃ) ও ইব্রাহীম (আঃ)-কে দেখেছি। ‘ঈসা (আঃ) গৌর বর্ণ, কোঁকড়ানো চুল এবং প্রশস্ত বুকবিশিষ্ট লোক ছিলেন, মূসা (আঃ) বাদামী রঙের ছিলেন, তাঁর দেহ ছিল সুঠাম এবং মাথার চুল ছিল সোজা যেন ‘যুত’ গোত্রের একজন মানুষ। (আধুনিক প্রকাশনীঃ ৩১৮৪, ইসলামিক ফাউন্ডেশনঃ ৩১৯৩)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 3440,
			"arabicnumber": 3440,
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 3441,
			"arabicnumber": 3441,
			"text": "সালিম এর পিতা হতে বর্ণিত। তিনি বলেন, আল্লাহর শপথ! নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এ কথা বলেননি যে ‘ঈসা (আঃ) লাল বর্ণের ছিলেন। বরং বলেছেন, একদা আমি স্বপ্নে কা‘বা ঘর তাওয়াফ করছিলাম। হঠাৎ সোজা চুল ও বাদামী রঙের জনৈক ব্যক্তিকে দেখলাম। তিনি দু’জন লোকের মাঝখানে চলছেন। তাঁর মাথার পানি ঝরছে অথবা বলেছেন, তার মাথা হতে পানি বেয়ে পড়ছে। আমি বললাম, ইনি কে? তারা বললেন, ইনি মারিয়ামের পুত্র। তখন আমি এদিক ওদিক তাকালাম। হঠাৎ দেখলাম, এক লোক তার গায়ের রং লালবর্ণ, খুব মোটা, মাথার চুল কোঁকড়ানো এবং তার ডান চোখ ট্যাঁরা। তার চোখ যেন ফোলা আঙ্গুরের মত। আমি জিজ্ঞেস করলাম, এ লোকটি কে? তারা বললেন, এ হলো দাজ্জাল। মানুষের মধ্যে ইবনু কাতানের সঙ্গে তার বেশি সাদৃশ্য রয়েছে। যুহরী (রহ.) তার বর্ণনায় বলেন, ইবনু কাতান খুযাআ গোত্রের জনৈক ব্যক্তি , সে জাহিলীয়াতের যুগেই মারা গেছে। (৩৪৪০) (আধুনিক প্রকাশনীঃ ৩১৮৬, ইসলামিক ফাউন্ডেশনঃ ৩১৯৫)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 3442,
			"arabicnumber": 3442,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি, আমি মারিয়ামের পুত্র ‘ঈসার অধিক ঘনিষ্ঠ। আর নবীগণ পরস্পর বৈমাত্রিয় ভাই। আমার ও তার মাঝখানে কোন নবী নেই। (৩৪৪৩, মুসলিম ৪৩/৪০ হাঃ ২৩৬৫, আহমাদ ৮২৫৫) (আধুনিক প্রকাশনীঃ ৩১৮৭, ইসলামিক ফাউন্ডেশনঃ ৩১৯৬)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 3443,
			"arabicnumber": 3443,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, আমি দুনিয়া ও আখিরাতে ‘ঈসা ইবনু মারিয়ামের ঘনিষ্ঠতম। নবীগণ একে অন্যের বৈমাত্রিয় ভাই। তাঁদের মা ভিন্ন ভিন্ন কিন্তু দ্বীন হল এক। (৩৪৪২) (আধুনিক প্রকাশনীঃ ৩১৮৮, ইসলামিক ফাউন্ডেশনঃ ৩১৯৭) ইব্রাহীম ইবনু তাহমান (রহ.)....আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন।",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 3444,
			"arabicnumber": 3444,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, ‘ঈসা (আঃ) এক লোককে চুরি করতে দেখলেন, তখন তিনি বললেন, তুমি কি চুরি করেছ? সে বলল, কক্ষণও নয়। সেই সত্তার কসম! যিনি ছাড়া আর কোন ইলাহ নেই। তখন ‘ঈসা (আঃ) বললেন, আমি আল্লাহর উপর ঈমান এনেছি আর আমি আমার দু’চোখ অবিশ্বাস করলাম। (মুসলিম ৪৩/৪০ হাঃ ২৩৬৮, আহমাদ ৮১৬০) (আধুনিক প্রকাশনীঃ ৩১৮৯, ইসলামিক ফাউন্ডেশনঃ ৩১৯৮)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 3445,
			"arabicnumber": 3445,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি ‘উমার (রাঃ)-কে মিম্বারের ওপর দাঁড়িয়ে বলতে শুনেছেন যে, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি, তোমরা আমার প্রশংসা করতে গিয়ে বাড়াবাড়ি করো না, যেমন ‘ঈসা মারইয়াম (আঃ) সম্পর্কে খ্রিস্টানরা বাড়াবাড়ি করেছিল। আমি তাঁর বান্দা, তাই তোমরা বলবে, আল্লাহর বান্দা ও তাঁর রাসূল। (২৪৬২) (আধুনিক প্রকাশনীঃ ৩১৯০, ইসলামিক ফাউন্ডেশনঃ ৩১৯৯)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 3446,
			"arabicnumber": 3446,
			"text": "আবূ মূসা আল-আশ‘আরী (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন যদি কোন লোক তার দাসীকে শিষ্টাচার শিখায় এবং তা উত্তমভাবে শিখায় এবং তাকে দ্বীন শিখায় আর তা উত্তমভাবে শিখায় অতঃপর তাকে মুক্ত করে দেয় অতঃপর তাকে বিয়ে করে তবে সে দু’টি করে সওয়াব পাবে। আর যদি কেউ ‘ঈসা (আঃ)-এর উপর ঈমান আনে অতঃপর আমার প্রতিও ঈমান আনে, তার জন্যও দু’টি করে সওয়াব রয়েছে। আর গোলাম যদি তার রবকে ভয় করে এবং তার মনিবদের মান্য করে তার জন্যও দু’টি করে সওয়াব রয়েছে। (৯৭) (আধুনিক প্রকাশনীঃ ৩১৯১, ইসলামিক ফাউন্ডেশনঃ ৩২০০)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 3447,
			"arabicnumber": 3447,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমরা হাশরের ময়দানে নগ্নপদে, নগ্নদেহে খাতনাবিহীন অবস্থায় একত্রিত হবে। অতঃপর তিনি এ আয়াত পাঠ করলেনঃ যেভাবে আমি প্রথমবার সৃষ্টির সূচনা করেছিলাম সেভাবে পুনরায় সৃষ্টি করবো। এটা আমার অঙ্গীকার। আমি তা অবশ্যই পূর্ণ করব- (আল-আম্বিয়া ১০৪)। অতঃপর সর্বপ্রথম যাকে বস্ত্রাচ্ছাদিত করা হবে, তিনি হলেন ইব্রাহীম (আঃ)। অতঃপর আমার সাহাবীদের কিছু সংখ্যককে ডান দিকে (জান্নাতে) এবং কিছু সংখ্যককে বাম দিকে নিয়ে যাওয়া হবে। তখন আমি বলব, এরা তো আমার অনুসারী। তখন বলা হবে আপনি তাদের হতে বিদায় নেয়ার পর তারা মুরতাদ হয়ে গেছে। তখন আমি এমন কথা বলব, যা বলেছিল, নেককার বান্দা ‘ঈসা ইবনু মারইয়াম (আঃ)। তার উক্তিটি হলো এ আয়াতঃ আর আমি যতদিন তাদের মধ্যে ছিলাম ততদিন আমি তাদের উপর সাক্ষী ছিলাম। অতঃপর আপনি যখন আমাকে উঠিয়ে নিলেন তখন আপনিই তাদের সংরক্ষণকারী ছিলেন। আর আপনি তো সব কিছুর উপরই সাক্ষী। যদি আপনি তাদেরকে আযাব দেন, তবে এরা তো আপনারই বান্দা। আর যদি আপনি তাদেরকে ক্ষমা করে দেন তবে আপনি নিশ্চয়ই ক্ষমতাধর ও প্রজ্ঞাময়- (আল-মায়িদাহঃ ১১৭)। কাবীসা (রাঃ) হতে বর্ণিত। তিনি বলেন, এরা হলো ঐ সব মুরতাদ যারা আবূ বাকর (রাঃ)-এর খিলাফতকালে মুরতাদ হয়ে গিয়েছিল। তখন আবূ বাকর (রাঃ) তাদের বিরুদ্ধে যুদ্ধ করেছিলেন। (৩৩৪৯) (আধুনিক প্রকাশনীঃ ৩১৯২, ইসলামিক ফাউন্ডেশনঃ ৩২০১)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 3448,
			"arabicnumber": 3448,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, শপথ সেই সত্তার, যাঁর হাতে আমার প্রাণ, শীঘ্রই তোমাদের মধ্যে মারিয়ামের পুত্র ‘ঈসা (আঃ) শাসক ও ন্যায় বিচারক হিসেবে আগমন করবেন। তিনি ‘ক্রুশ’ ভেঙ্গে ফেলবেন, শূকর হত্যা করবেন এবং তিনি যুদ্ধের সমাপ্তি টানবেন। তখন সম্পদের ঢেউ বয়ে চলবে। এমনকি কেউ তা গ্রহণ করতে চাইবে না। তখন আল্লাহকে একটি সিজ্দা করা তামাম দুনিয়া এবং তার মধ্যকার সমস্ত সম্পদ হতে অধিক মূল্যবান বলে গণ্য হবে। অতঃপর আবূ হুরাইরাহ্ (রাঃ) বলেন, তোমরা ইচ্ছা করলে এর সমর্থনে এ আয়াতটি পড়তে পারঃ ‘‘কিতাবীদের মধ্যে প্রত্যেকে তাঁর (ঈসা (আঃ)-এর) মৃত্যুর পূর্বে তাঁকে বিশ্বাস করবেই এবং কিয়ামতের দিন তিনি তাদের বিপক্ষে সাক্ষ্য দিবেন।’’ (আন-নিসাঃ ১৫৯) (২২২২) (আধুনিক প্রকাশনীঃ ৩১৯৩, ইসলামিক ফাউন্ডেশনঃ ৩২০২)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 3449,
			"arabicnumber": 3449,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমাদের অবস্থা কেমন হবে যখন তোমাদের মধ্যে মারইয়াম পুত্র ‘ঈসা (আঃ) অবতরণ করবেন আর তোমাদের ইমাম তোমাদের মধ্য থেকেই হবে।* (২২২২, মুসলিম ১/১৭ হাঃ ১৫৫, আহমাদ ৭৬৮৪) (আধুনিক প্রকাশনীঃ ৩১৯৪, ইসলামিক ফাউন্ডেশনঃ ৩২০৩) ‘উকাইল ও আওযা‘ঈ হাদীস বর্ণনায় এর অনুসরণ করেছেন।",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 3452,
			"arabicnumber": 3452,
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 3454,
			"arabicnumber": 3454,
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 3455,
			"arabicnumber": 3455,
			"text": "আবূ হাযিম (রহ.) হতে বর্ণিত। তিনি বলেন, আমি পাঁচ বছর যাবৎ আবূ হুরাইরাহ্ (রাঃ)-এর সাহচর্যে ছিলাম। তখন আমি তাঁকে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে হাদীস বর্ণনা করতে শুনেছি যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, বনী ইসরাঈলের নবীগণ তাঁদের উম্মাতকে শাসন করতেন। যখন কোন একজন নবী মারা যেতেন, তখন অন্য একজন নবী তাঁর স্থলাভিসিক্ত হতেন। আর আমার পরে কোন নবী নেই। তবে অনেক খলীফাহ্ হবে। সহাবগণ আরয করলেন, হে আল্লাহর রাসূল! আপনি আমাদেরকে কী নির্দেশ করছেন? তিনি বললেন, তোমরা একের পর এক করে তাদের বায়‘আতের হক আদায় করবে। তোমাদের উপর তাদের যে হক রয়েছে তা আদায় করবে। আর নিশ্চয়ই আল্লাহ্ তাঁদেরকে জিজ্ঞেস করবেন ঐ সকল বিষয়ে যে সবের দায়িত্ব তাদের উপর অর্পণ করা হয়েছিল। (মুসলিম ২২/১০ হাঃ ১৮৪২) (আধুনিক প্রকাশনীঃ ৩১৯৭, ইসলামিক ফাউন্ডেশনঃ ৩২০৬)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 3456,
			"arabicnumber": 3456,
			"text": "আবূ সা‘ঈদ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমরা অবশ্যই তোমাদের পূর্ববর্তীদের পন্থা পুরোপুরি অনুসরণ করবে, প্রতি বিঘতে বিঘতে এবং প্রতি গজে গজে। এমনকি তারা যদি গো সাপের গর্তেও ঢুকে তবে তোমরাও তাতে ঢুকবে। আমরা বললাম, হে আল্লাহর রাসূল! আপনি কি ইয়াহূদী ও নাসারার কথা বলছেন? নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তবে আর কার কথা? (৭৩২০) (আধুনিক প্রকাশনীঃ ৩১৯৮, ইসলামিক ফাউন্ডেশনঃ ৩২০৭)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 3457,
			"arabicnumber": 3457,
			"text": "আনাস (রাঃ) হতে বর্ণিত। তিনি বলেন, তাঁরা আগুন জ্বালানো এবং ঘণ্টা বাজানোর কথা উল্লেখ করলেন। তখনই তাঁরা ইয়াহূদী ও নাসারার কথা উল্লেখ করলেন। অতঃপর বিলাল (রাঃ)-কে আযানের শব্দগুলো দু’ দু’ বার করে এবং ইকামাতের শব্দগুলো বেজোড় করে বলতে নির্দেশ দেয়া হল। (৬০৩) (আধুনিক প্রকাশনীঃ ৩১৯৯, ইসলামিক ফাউন্ডেশনঃ ৩২০৮)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 3458,
			"arabicnumber": 3458,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত যে, তিনি কোমরে হাত রাখাকে অপছন্দ করতেন। আর বলতেন, ইয়াহূদীরা এমন করে। শু‘বা (রহ.) আ‘মাশ (রহ.) হতে হাদীস বর্ণনায় সুফ্ইয়ান (রহ.)-এর অনুসরণ করেছেন। (আধুনিক প্রকাশনীঃ ৩২০০, ইসলামিক ফাউন্ডেশনঃ ৩২০৯)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 3459,
			"arabicnumber": 3459,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমাদেও পূর্বের যেসব উম্মাত অতীত হয়ে গেছে তাদের অনুপাতে তোমাদের অবস্থান হলো ‘আসরের সালাত এবং সূর্য অস্ত যাওয়ার মধ্যবর্তী সময়টুকুর সমান। আর তোমাদের ও ইয়াহূদী নাসারাদের দৃষ্টান্ত হলো ঐ ব্যক্তির মতো, যে কয়েকজন লোককে তার কাজে লাগালো এবং জিজ্ঞেস করল, তোমাদের মধ্যে কে আছে যে, আমার জন্য দুপুর পর্যন্ত এক কিরাতের [১] বিনিময়ে কাজ করবে? তখন ইয়াহূদীরা এক এক কিরাতের বিনিময়ে দুপুর পর্যন্ত কাজ করল। অতঃপর সে ব্যক্তি আবার বলল, তোমাদের মধ্যে এমন কে আছে যে, সে দুপুর হতে আসর সালাত পর্যন্ত এক এক কিরাতের বিনিময়ে আমার কাজটুকু করে দেবে? তখন নাসারারা এক কিরাতের বিনিময়ে দুপুর হতে আসর সালাত পর্যন্ত কাজ করল। সে ব্যক্তি আবার বলল, কে এমন আছ, যে দু’ দু’ কিরাতের বদলায় আসর সালাত হতে সূর্যাস্ত পর্যন্ত আমার কাজ করে দেবে? আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, দেখ, তোমরাই হলে সে সব লোক যারা আসর সালাত হতে সূর্যাস্ত পর্যন্ত দু’ দু’ কিরাতের বিনিময়ে কাজ করলে। দেখ, তোমাদের পারিশ্রমিক দ্বিগুণ। এতে ইয়াহূদী ও নাসারারা অসন্তুষ্ট হয়ে গেল এবং বলল, আমরা কাজ করলাম অধিক আর মজুরি পেলাম কম। আল্লাহ্ বলেন, আমি কি তোমার পাওনা হতে কিছু জুলুম বা কম করেছি? তারা উত্তরে বলল, না। তখন আল্লাহ্ বললেন, এটা হলো আমার অনুগ্রহ, আমি যাকে ইচ্ছা, তা দান করে থাকি। (৫৫৭) (আধুনিক প্রকাশনীঃ ৩২০১, ইসলামিক ফাউন্ডেশনঃ ৩২১০)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 3460,
			"arabicnumber": 3460,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, ‘উমার (রাঃ) বলেন, আল্লাহ্ অমুক লোককে ধ্বংস করুক! সে কি জানে না যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, আল্লাহ্ ইয়াহূদীদের ওপর লা‘নত করুন। তাদের জন্য চর্বি হারাম করা হয়েছিল। তখন তারা তা গলিয়ে বিক্রি করতে লাগল। জাবির ও আবূ হুরাইরাহ্ (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হাদীস বর্ণনায় ইবনু ‘আব্বাস (রাঃ)-এর অনুসরণ করেছেন। (২২২৩) (আধুনিক প্রকাশনীঃ ৩২০২, ইসলামিক ফাউন্ডেশনঃ ৩২১১)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 3461,
			"arabicnumber": 3461,
			"text": "‘আবদুল্লাহ ইবনু ‘আমর (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, আমার কথা পৌঁছিয়ে দাও, তা যদি এক আয়াতও হয়। আর বনী ইসরাঈলের ঘটনাবলী বর্ণনা কর। এতে কোন দোষ নেই। কিন্তু যে কেউ ইচ্ছে করে আমার উপর মিথ্যারোপ করল, সে যেন জাহান্নামকেই তার ঠিকানা নির্দিষ্ট করে নিল। (আধুনিক প্রকাশনীঃ ৩২০৩, ইসলামিক ফাউন্ডেশনঃ ৩২১২)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 3462,
			"arabicnumber": 3462,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, ইয়াহূদী ও নাসারারা (দাড়ি-চুলে) রং লাগায় না। অতএব তোমরা তাদের বিপরীত কাজ কর। (৫৮৯৯, মুসলিম ৩৭/২৫ হাঃ ২১০৩, আহমাদ ৭২৭৮) (আধুনিক প্রকাশনীঃ ৩২০৪, ইসলামিক ফাউন্ডেশনঃ ৩২১৩)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 3463,
			"arabicnumber": 3463,
			"text": "হাসান (বসরী) (রহ.) বলেন, জুনদুব ইবনু ‘আবদুল্লাহ (রাঃ) বসরার এক মসজিদে আমাদের নিকট হাদীস বর্ণনা করেন। সে দিন হতে আমরা না হাদীস ভুলেছি না আশংকা করেছি যে, জুনদুব (রহ.) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর প্রতি মিথ্যারোপ করেছেন। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমাদের পূর্ব যুগে জনৈক ব্যক্তি আঘাত পেয়েছিল, তাতে কাতর হয়ে পড়েছিল। অতঃপর সে একটি ছুরি হাতে নিল এবং তা দিয়ে সে তার হাতটি কেটে ফেলল। ফলে রক্ত আর বন্ধ হল না। শেষ পর্যন্ত সে মারা গেল। মহান আল্লাহ্ বললেন, আমার বান্দাটি নিজেই প্রাণ দেয়ার ব্যাপারে আমার হতে অগ্রগামী হল। কাজেই, আমি তার উপর জান্নাত হারাম করে দিলাম। (১৩৬৪) (আধুনিক প্রকাশনীঃ ৩২০৫, ইসলামিক ফাউন্ডেশনঃ ৩২১৪)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 3464,
			"arabicnumber": 3464,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছেন, বানী ইসরাইলের মধ্যে তিনজন লোক ছিল। একজন শ্বেতরোগী, একজন মাথায় টাকওয়ালা আর একজন অন্ধ। মহান আল্লাহ তাদেরকে পরীক্ষা করতে চাইলেন। কাজেই, তিনি তাদের নিকট একজন ফেরেশতা পাঠালেন। ফেরেশতা প্রথমে শ্বেত রোগীটির নিকট আসলেন এবং তাকে জিজ্ঞেস করলেন, তোমার নিকট কোন্ জিনিস অধিক প্রিয়? সে জবাব দিল, সুন্দর রং ও সুন্দর চামড়া। কেননা, মানুষ আমাকে ঘৃণা করে। ফেরেশতা তার শরীরের উপর হাত বুলিয়ে দিলেন। ফলে তার রোগ সেরে গেল। তাকে সুন্দর রং এবং সুন্দর চামড়া দান করা হল। অতঃপর ফেরেশতা তাকে জিজ্ঞেস করলেন, কোন্ ধরনের সম্পদ তোমার নিকট অধিক প্রিয়? সে জবাব দিল, ‘উট’ অথবা সে বলল, ‘গরু’। এ ব্যাপারে বর্ণনাকারীর সন্দেহ রয়েছে যে শ্বেতরোগী না টাকওয়ালা দু’জনের একজন বলেছিল ‘উট’ আর অপরজন বলেছিল ‘গরু’। অতএব তাকে একটি দশ মাসের গর্ভবতী উটনী দেয়া হল। তখন ফিরশতা বললেন, ‘‘এতে তোমার জন্য বরকত হোক।’’ বর্ণনাকারী বলেন, ফেরেশতা টাকওয়ালার নিকট গেলেন এবং বললেন, তোমার নিকট কী জিনিস পছন্দনীয়? সে বলল, সুন্দর চুল এবং আমার হতে যেন এ রোগ চলে যায়। মানুষ আমাকে ঘৃণা করে। বর্ণনাকারী বলেন, ফেরেশতা তার মাথায় হাত বুলিয়ে দিলেন এবং তৎক্ষণাৎ মাথার টাক চলে গেল। তাকে সুন্দর চুল দেয়া হল। ফেরেশতা জিজ্ঞেস করলেন, কোন্ সম্পদ তোমার নিকট অধিক প্রিয়? সে জবাব দিল, ‘গরু’। অতঃপর তাকে একটি গর্ভবতী গাভী দান করলেন। এবং ফেরেশতা দু‘আ করলেন, এতে তোমাকে বরকত দান করা হোক। অতঃপর ফেরেশতা অন্ধের নিকট আসলেন এবং তাকে জিজ্ঞেস করলেন, কোন্ জিনিস তোমার নিকট অধিক প্রিয়? সে বলল, আল্লাহ্ যেন আমার চোখের জ্যোতি ফিরিয়ে দেন, যাতে আমি মানুষকে দেখতে পারি। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তখন ফেরেশতা তার চোখের উপর হাত ফিরিয়ে দিলেন, তৎক্ষণাৎ আল্লাহ্ তার দৃষ্টিশক্তি ফিরিয়ে দিলেন। ফেরেশতা জিজ্ঞেস করলেন, কোন্ সম্পদ তোমার নিকট অধিক প্রিয়? সে জবাব দিল ‘ছাগল’। তখন তিনি তাকে একটি গর্ভবতী ছাগী দিলেন। উপরে উল্লেখিত লোকদের পশুগুলো বাচ্চা দিল। ফলে একজনের উটে ময়দান ভরে গেল, অপরজনের গরুতে মাঠ পূর্ণ হয়ে গেল এবং আর একজনের ছাগলে উপত্যকা ভরে গেল। অতঃপর ঐ ফেরেশতা তাঁর পূর্ববর্তী আকৃতি প্রকৃতি ধারণ করে শ্বেতরোগীর নিকট এসে বললেন, আমি একজন নিঃস্ব ব্যক্তি। আমার সফরের সম্বল শেষ হয়ে গেছে। আজ আমার গন্তব্য স্থানে পৌঁছার আল্লাহ্ ব্যতীত কোন উপায় নেই। আমি তোমার নিকট ঐ সত্তার নামে একটি উট চাচ্ছি, যিনি তোমাকে সুন্দর রং, কোমল চামড়া এবং সম্পদ দান করেছেন। আমি এর উপর সাওয়ার হয়ে আমার গন্তব্যে পৌঁছাব। তখন লোকটি তাকে বলল, আমার উপর বহু দায়িত্ব রয়েছে। তখন ফেরেশতা তাকে বললেন, সম্ভবত আমি তোমাকে চিনি। তুমি কি এক সময় শ্বেতরোগী ছিলে না? মানুষ তোমাকে ঘৃণা করত। তুমি কি ফকীর ছিলে না? অতঃপর আল্লাহ্ তা‘আলা তোমাকে দান করেছেন। তখন সে বলল, আমি তো এ সম্পদ আমার পূর্বপুরুষ হতে ওয়ারিশ সূত্রে পেয়েছি। ফেরেশতা বললেন, তুমি যদি মিথ্যাচারী হও, তবে আল্লাহ্ তোমাকে সেরূপ করে দিন, যেমন তুমি ছিলে। অতঃপর ফেরেশতা মাথায় টাকওয়ালার নিকট তাঁর সেই বেশভূষা ও আকৃতিতে গেলেন এবং তাকে ঠিক তেমনই বললেন, যেরূপ তিনি শ্বেত রোগীকে বলেছিলেন। এও তাকে ঠিক অনুরূপ জবাব দিল যেমন জবাব দিয়েছিল শ্বেতরোগী। তখন ফেরেশতা বললেন, যদি তুমি মিথ্যাচারী হও, তবে আল্লাহ্ তোমাকে তেমন অবস্থায় করে দিন, যেমন তুমি ছিলে। শেষে ফেরেশতা অন্ধ লোকটির নিকট তাঁর আকৃতিতে আসলেন এবং বললেন, আমি একজন নিঃস্ব লোক, মুসাফির মানুষ; আমার সফরের সকল সম্বল শেষ হয়ে গেছে। আজ বাড়ি পৌঁছার ব্যাপারে আল্লাহ্ ব্যতীত কোন গতি নেই। তাই আমি তোমার নিকট সেই সত্তার নামে একটি ছাগী প্রার্থনা করছি যিনি তোমার দৃষ্টিশক্তি ফিরিয়ে দিয়েছেন আর আমি এ ছাগীটি নিয়ে আমার এ সফরে বাড়ি পৌঁছতে পারব। সে বলল, প্রকৃতপক্ষেই আমি অন্ধ ছিলাম। আল্লাহ্ আমার দৃষ্টিশক্তি ফিরিয়ে দিয়েছেন। আমি ফকীর ছিলাম। আল্লাহ্ আমাকে সম্পদশালী করেছেন। এখন তুমি যা চাও নিয়ে যাও। আল্লাহর কসম। আল্লাহর জন্য তুমি যা কিছু নিবে, তার জন্যে আজ আমি তোমার নিকট কোন প্রশংসাই দাবী করব না। তখন ফেরেশতা বললেন, তোমার সম্পদ তুমি রেখে দাও। তোমাদের তিন জনের পরীক্ষা নেয়া হল মাত্র। আল্লাহ্ তোমার উপর সন্তুষ্ট হয়েছেন আর তোমার সাথীদ্বয়ের উপর অসন্তুষ্ট হয়েছেন। (৬৬৫৩, মুসলিম ৫৩/আওয়ালুল কিতাব হাঃ ২৯৬৪) (আধুনিক প্রকাশনীঃ ৩২০৬, ইসলামিক ফাউন্ডেশনঃ ৩২১৫)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 3465,
			"arabicnumber": 3465,
			"text": "بَابُ أَمْ حَسِبْتَ أَنَّ أَصْحٰبَ الْكَهْفِ وَالرَّقِيْمِ (الكهف : 9) ৬০/৫২. অধ্যায় : মহান আল্লাহর বাণীঃ আসহাবে কাহাফ ও রাকীম সম্পর্কে আপনার কী ধারণা? (আত্ তওবা ১৮) الْكَهْفُ الْفَتْحُ فِي الْجَبَلِ وَالرَّقِيْمُ الْكِتَابُ مَرْقُومٌ مَكْتُوْبٌ مِنْ الرَّقْمِ وَرَبَطْنَا عَلٰى قُلُوْبِهِمْ (الكهف : 14) أَلْهَمْنَاهُمْ صَبْرًا شَطَطًا إِفْرَاطًا الْوَصِيْدُ الْفِنَاءُ وَجَمْعُهُ وَصَائِدُ وَوُصُدٌ وَيُقَالُ الْوَصِيْدُ الْبَابُ مُؤْصَدَةٌ مُطْبَقَةٌ آصَدَ الْبَابَ وَأَوْصَدَ بَعَثْنٰهُمْ أَحْيَيْنَاهُمْ أَزْكٰى أَكْثَرُ رَيْعًا فَضَرَبَ اللهُ عَلٰى اٰذَانِهِمْ فَنَامُوْا رَجْمًام بِالْغَيْبِ (الكهف : 22) لَمْ يَسْتَبِنْ وَقَالَ مُجَاهِدٌ تَقْرِضُهُمْ تَتْرُكُهُمْ কিতাব مَرْقُومٌ শব্দটি الرَّقْمِ হতে উদ্ভূত, অর্থ লিপিবদ্ধ। وَرَبَطْنَا عَلَى قُلُوْبِهِمْ এর অর্থ, তাদের অন্তরে আমি (ধৈর্যের) প্রেরণা দিয়েছি। যদি আমি তার অন্তরে সহনশীলতার প্রেরণা প্রদান না করতাম। شَطَطًا অতিশয় অতিরিক্ত। الْوَصِيْدُ গুহার পাড়। এটা একবচন। এর বহুবচন وَصَائِدُ এবং وَوُصُدٌ কেউ কেউ বলেন, الْوَصِيْدُ অর্থ দরজা। مُؤْصَدَةٌ বন্ধ। এ অর্থেই ব্যবহার করা হয়। آصَدَ الْبَابَ وَأَوْصَدَ আমি তাদেরকে জীবিত করলাম। أَزْكَى পবিত্র ও সুস্বাদু খাদ্য। অতঃপর আল্লাহ্ তাদের কানে ছাপ মেরে দিলেন। তারা ঘুমিয়ে পড়লো। رَجْمًا بِالْغَيْبِ যা স্পষ্ট হলো না। আর মুজাহিদ (রহ.) বলেন। تَقْرِضُهُمْ তাদেরকে পাশ কেটে যায়। ৩৪৬৫. ইবনু ‘উমার (রাঃ) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমাদের আগের যুগের লোকদের মধ্যে তিনজন লোক ছিল। তাঁরা পথ চলছিল। হঠাৎ তাদের বৃষ্টি পেয়ে গেল। তখন তারা এক গুহায় আশ্রয় নিল। অমনি তাদের গুহার মুখ বন্ধ হয়ে গেল। তাদের একজন অন্যদেরকে বললেন, বন্ধুগণ আল্লাহর কসম! এখন সত্য ব্যতীত কিছুই তোমাদেরকে রেহাই করতে পারবে না। কাজেই, এখন তোমাদের প্রত্যেকের সেই জিনিসের উসিলায় দু’আ করা দরকার, যে সম্পর্কে জানা রয়েছে যে, এ কাজটিতে সে সত্যতা আছে। তখন তাদের একজন দু’আ করলেন- হে আল্লাহ! আপনি জানেন যে, আমার একজন মজদুর ছিল। সে এক ফারাক১ চাউলের বিনিময়ে আমার কাজ করে দিয়েছিল। পরে সে মজুরী না নিয়েই চলে গিয়েছিল। আমি তার এ মজুরী দিয়ে কিছু একটা করার ইচ্ছা করলাম এবং কৃষি কাজে লাগালাম। এতে যা উৎপাদন হল, তার বিনিময়ে আমি একটি গাভী কিনলাম। সেই মজদুর আমার নিকট এসে তার মজুরী দাবী করল। আমি তাকে বললাম, এ গাভীটির দিকে তাকাও এবং তা হাঁকিয়ে নিয়ে যাও। সে জবাব দিল, আমার আপনার নিকট মাত্র এক ‘ফারাক’ চালই পাওনা। আমি তাকে বললাম গাভিটি নিয়ে যাও। কেননা সেই এক ‘ফারাক’ দ্বারা যা উৎপাদিত হয়েছে, তারই বিনিময়ে এটি কেনা হয়েছে। তখন সে গাভীটি হাঁকিয়ে নিয়ে গেল। আপনি জানেন যে, তা আমি একমাত্র আপনার ভয়েই করেছি। তাহলে আমাদের হতে সরিয়ে দিন। তখন তাদের নিকট হতে পাথরটি কিছুটা সরে গেল। তাদের আরেকজন দু’আ করল, হে আল্লাহ্! আপনি জানেন যে, আমার মা-বাপ খুব বৃদ্ধ ছিলেন। আমি প্রতি রাতে তাঁদের জন্য আমার বকরীর দুধ নিয়ে তাঁদের নিকট যেতাম। এক রাতে তাদের নিকট যেতে আমি দেরী করে ফেললাম। অতঃপর এমন সময় গেলাম, যখন তাঁরা দু’জনে ঘুমিয়ে পড়েছেন। এদিকে আমার পরিবার পরিজন ক্ষুধার কারণে চিৎকার করছিল। আমার মাতা-পিতাকে দুধ পান না করান পর্যন্ত ক্ষুধায় কাতর আমার সন্তানদেরকে দুধ পান করাইনি। কেননা, তাদেরকে ঘুম হতে জাগানটি আমি পছন্দ করিনি। অপরদিকে তাদেরকে বাদ দিতেও ভাল লাগেনি। কারণ, এ দুধটুকু পান না করলে তাঁরা উভয়েই দুর্বল হয়ে যাবেন। তাই আমি ভোর হয়ে যাওয়া পর্যন্ত অপেক্ষা করছিলাম। আপনি জানেন যে, এ কাজ আমি করেছি, একমাত্র আপনার ভয়ে, তাই আমাদের হতে সরিয়ে দিন। অতঃপর পাথরটি তাদের হতে আরেকটু সরে গেল। এমনকি তারা আসমান দেখতে পেল। অপর ব্যক্তি দু’আ করল, হে আল্লাহ্! আপনি জানেন যে, আমার একটি চাচাত বোন ছিল। সবেচেয়ে সে আমার নিকট অধিক প্রিয় ছিল। আমি তার সঙ্গে বাসনা করছিলাম। কিন্তু সে একশ’ দ্বীনার প্রদান ছাড়া ঐ কাজে রাযী হতে চাইল না। আমি স্বর্ণ মুদ্রা অর্জনের চেষ্টা আরম্ভ করলাম এবং তা অর্জনে সমর্থও হলাম। অতঃপর কথিত মুদ্রাসহ তার নিকট উপস্থিত হয়ে তাকে তা অর্পণ করলাম। সেও তার দেহ আমার জন্য অর্পণ করলো। আমি যখন তার দুই পায়ের মাঝে বসে পড়লাম তখন সে বলল, আল্লাহকে ভয় কর, অন্যায় ও অবৈধভাবে পবিত্র ও রক্ষিত আবরুকে বিনষ্ট করো না। আমি তৎক্ষণাৎ সরে পড়লাম ও স্বর্ণমুদ্রা ছেড়ে আসলাম। হে আল্লাহ্! আপনি জানেন যে, আমি প্রকৃতই আপনার ভয়ে তা করেছিলাম। তাই আমাদের রাস্তা প্রশস্ত করে দিন। আল্লাহ্ সংকট দূরীভূত করলেন। তারা বের হয়ে আসল। (২২১৫) (আধুনিক প্রকাশনীঃ ৩২০৭, ইসলামিক ফাউন্ডেশনঃ ৩২১৬)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 3466,
			"arabicnumber": 3466,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি যে, একদা একজন মহিলা তার কোলের শিশুকে স্তন্য পান করাচ্ছিল। এমন সময় একজন ঘোড়সওয়ার তাদের নিকট দিয়ে গমন করে। মহিলাটি বলল, হে আল্লাহ্! আমার পুত্রকে এই ঘোড়সওয়ারের মত না বানিয়ে মৃত্যু দান করো না। তখন কোলের শিশুটি বলে উঠলো- হে আল্লাহ্! আমাকে ঐ ঘোড়সওয়ারের মত করো না, এই বলে পুনরায় সে স্তন্য পানে লেগে গেল। অতঃপর একজন মহিলাকে কতিপয় লোক অপমানজনকভাবে বিদ্রুপ করতে করতে টেনে নিয়ে চলছিল। ঐ মহিলাকে দেখে বাচ্চার মা বলে উঠল- হে আল্লাহ্! আমার পুত্রকে ঐ মহিলার মত করো না। বাচ্চাটি বলে উঠল, হে আল্লাহ্! আমাকে ঐ মহিলার মত কর। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, ঐ ঘোড়সওয়ার কাফির ছিল। আর ঐ মহিলাকে লক্ষ্য করে লোকজন বলছিল, তুই ব্যাভিচারিণী, সে বলছিল হাস্বি আল্লাহ্- আল্লাহ্-ই আমার জন্য যথেষ্ট। তারা বলছিল তুই চোর আর সে বলছিল আল্লাহ্-ই আমার জন্য যথেষ্ট। (১২০৬) (আধুনিক প্রকাশনীঃ ৩২০৮, ইসলামিক ফাউন্ডেশনঃ ৩২১৭)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 3467,
			"arabicnumber": 3467,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন যে, একবার একটি কুকুর এক কূপের চতুর্দিকে ঘুরছিল এবং অত্যন্ত পিপাসার কারণে সে মৃত্যুর কাছে পৌঁছেছিল। তখন বনী ইসরাঈলের ব্যাভিচারিণীদের একজন কুকুরটির অবস্থা লক্ষ্য করল, এবং তার পায়ের মোজা দিয়ে পানি সংগ্রহ করে কুকুরটিকে পান করাল। এ কাজের বিনিময়ে আল্লাহ্ তা‘আলা তাকে ক্ষমা করে দিলেন (৩৩২১, মুসলিম ৩৯/৪১ হাঃ ২২৪৫) (আধুনিক প্রকাশনীঃ ৩২০৯, ইসলামিক ফাউন্ডেশনঃ ৩২২৮)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 3468,
			"arabicnumber": 3468,
			"text": "হুমায়েদ ইবনু ‘আবদুর রাহমান (রহ.) হতে বর্ণিত। তিনি মু‘আবিয়া ইবনু আবূ সুফ্ইয়ান (রাঃ)-কে বলতে শুনেছেন যে, তার হাজ্জ পালনের বছর মিম্বরে নববীতে উপবিষ্ট অবস্থায় তাঁর দেহরক্ষীদের কাছ থেকে মহিলাদের একগুচ্ছ চুল নিজ হাতে নিয়ে তিনি বলেন যে, হে মীনাবাসী! কোথায় তোমাদের আলিম সমাজ? আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে এ রকম পরচুলা ব্যবহার হতে নিষেধ করতে শুনেছি। তিনি বলেছেন, বনী ইসরাঈল তখনই ধ্বংস হয়, যখন তাদের মহিলাগণ এ ধরনের পরচুলা ব্যবহার করতে শুরু করে। (৩৪৮৮, ৫৯৩২, ৫৯৩৮, মুসলিম ৩৭/৩৩ হাঃ ২১২৭) (আধুনিক প্রকাশনীঃ ৩২১০, ইসলামিক ফাউন্ডেশনঃ ৩২১৯)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 3469,
			"arabicnumber": 3469,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমাদের পূর্বের উম্মাতগণের মধ্যে ইল্হাম প্রাপ্ত ব্যক্তিবর্গ ছিলেন। আমার উম্মাতের মধ্যে যদি এমন কেউ থাকে, তবে সে নিশ্চয় ‘উমার ইবনুল খাত্তাব (রাঃ) হবেন। (৩৬৮৯) (আধুনিক প্রকাশনীঃ ৩২১১, ইসলামিক ফাউন্ডেশনঃ ৩২২০)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 3470,
			"arabicnumber": 3470,
			"text": "আবূ সা‘ঈদ খুদরী (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, বনী ইসরাঈলের মাঝে এমন এক ব্যক্তি ছিল যে, নিরানব্বইটি মানুষ হত্যা করেছিল। অতঃপর বের হয়ে একজন পাদরীকে জিজ্ঞেস করল, আমার তওবা কবুল হবার আশা আছে কি? পাদরী বলল, না। তখন সে পাদরীকেও হত্যা করল। অতঃপর পুনরায় সে জিজ্ঞাসাবাদ করতে লাগল। তখন এক ব্যক্তি তাকে বলল, তুমি অমুক স্থানে চলে যাও। সে রওয়ানা হল এবং পথিমধ্যে তার মৃত্যু এসে গেল। সে তার বক্ষদেশ দ্বারা সে স্থানটির দিকে ঘুরে গেল। মৃত্যুর পর রহমত ও আযাবের ফেরেশতামন্ডলী তার রূহকে নিয়ে বাদানুবাদে লিপ্ত হলেন। আল্লাহ্ সামনের ভূমিকে আদেশ করলেন, তুমি মৃত ব্যক্তির নিকটবর্তী হয়ে যাও। এবং পশ্চাতে ফেলে আসা স্থানকে (যেখানে হত্যাকান্ড ঘটেছিল) আদেশ দিলেন, তুমি দূরে সরে যাও। অতঃপর ফেরেশতাদের উভয় দলকে নির্দেশ দিলেন— তোমরা এখান থেকে উভয় দিকের দূরত্ব পরিমাপ কর। পরিমাপ করা হল, দেখা গেল যে, মৃত লোকটি সামনের দিকে এক বিঘত বেশি এগিয়ে আছে। কাজেই তাকে ক্ষমা করা হল। (মুসলিম ৪৯/৮ হাঃ ২৭৬৬, আহমাদ ১১১৫৪ ) (আধুনিক প্রকাশনীঃ ৩২১২, ইসলামিক ফাউন্ডেশনঃ ৩২২১)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 3471,
			"arabicnumber": 3471,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, একদা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফজরের সালাত শেষে লোকজনের দিকে ঘুরে বসলেন এবং বললেন, একদা এক লোক একটি গরু হাঁকিয়ে নিয়ে যাচ্ছিল। হঠাৎ সে এটির পিঠে চড়ে বসলো এবং ওকে প্রহার করতে লাগল। তখন গরুটি বলল, আমাদেরকে এজন্য সৃষ্টি করা হয়নি, আমাদেরকে চাষাবাদের জন্য সৃষ্টি করা হয়েছে। এতদশ্রবণে লোকজন বলে উঠল, সুবহানাল্লাহ্! গরুও কথা বলে? নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আমি এবং আবূ বাকর ও ‘উমার তা বিশ্বাস করি। অথচ তখন তাঁরা উভয়ে সেখানে উপস্থিত ছিলেন না। আর এক রাখাল একদিন তার ছাগল পালের মাঝে অবস্থান করছিল, এমন সময় একটি চিতা বাঘ পালে ঢুকে একটি ছাগল নিয়ে গেল। রাখাল বাঘের পিছনে ধাওয়া করে ছাগলটি উদ্ধার করে নিল। তখন বাঘটি বলল, তুমি ছাগলটি আমার থেকে কেড়ে নিলে বটে তবে ঐদিন কে ছাগলকে রক্ষা করবে যেদিন হিংস্র জন্তু ওদের আক্রমণ করবে এবং আমি ব্যতীত তাদের অন্য কোন রাখাল থাকবে না। লোকেরা বলল, সুবহানাল্লাহ! চিতা বাঘ কথা বলে! নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আমি এবং আবূ বাকর ও ‘উমার তা বিশ্বাস করি অথচ তাঁরা উভয়েই সেখানে উপস্থিত ছিলেন না। ‘আলী ইবনু ‘আবদুল্লাহ (রাঃ) হতে বর্ণিত।....আবূ হুরাইরাহ্ (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এ রকমই বর্ণনা করেছেন। (২৩২৪) (আধুনিক প্রকাশনীঃ ৩২১৩, ইসলামিক ফাউন্ডেশনঃ ৩২২২)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 3472,
			"arabicnumber": 3472,
			"text": "আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, এক লোক অপর লোক হতে একখন্ড জমি ক্রয় করেছিল। ক্রেতা খরিদকৃত জমিতে একটা স্বর্ণ ভর্তি ঘড়া পেল। ক্রেতা বিক্রেতাকে তা ফেরত নিতে অনুরোধ করে বলল, কারণ আমি জমি ক্রয় করেছি, স্বর্ণ ক্রয় করিনি। বিক্রেতা বলল, আমি জমি এবং এতে যা কিছু আছে সবই বেচে দিয়েছি। অতঃপর তারা উভয়েই অপর এক লোকের কাছে এর মীমাংসা চাইল। তিনি বললেন, তোমাদের কি ছেলে-মেয়ে আছে? একজন বলল, আমার একটি ছেলে আছে। অন্য লোকটি বলল, আমার একটি মেয়ে আছে। মীমাংসাকারী বললেন, তোমার মেয়েকে তার ছেলের সঙ্গে বিবাহ দাও আর প্রাপ্ত স্বর্ণের মধ্যে কিছু তাদের বিবাহে ব্যয় কর এবং বাকী অংশ তাদেরকে দিয়ে দাও। (২৩৬৫, মুসলিম ৩০/১১ হাঃ ১৭২১, আহমাদ ৮১৯৮) (আধুনিক প্রকাশনীঃ ৩২১৪, ইসলামিক ফাউন্ডেশনঃ ৩২২৩)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 3473,
			"arabicnumber": 3473,
			"text": "সা'দ ইবনু আবূ ওয়াক্কাস (রাঃ) উসামাহ্ ইবনু যায়দ (রাঃ)-কে জিজ্ঞেস করেন, আপনি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে প্লেগ সম্বন্ধে কী শুনেছেন? উসামাহ্ (রাঃ) বলেন, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, প্লেগ একটি আযাব। যা বনী ইসরাঈলের এক সম্প্রদায়ের উপর পতিত হয়েছিল অথবা তোমাদের পূর্বে যারা ছিল। তোমরা যখন কোন স্থানে প্লেগের ছড়াছড়ি শুনতে পাও, তখন তোমরা সেখানে যেয়ো না। আর যখন প্লেগ এমন জায়গায় দেখা দেয়, যেখানে তুমি অবস্থান করছো, তখন সে স্থান হতে পালানোর লক্ষ্যে বের হয়ো না। (মুসলিম ৩৯/৩২ হাঃ ২২১৮) (আধুনিক প্রকাশনীঃ ৩২১৫, ইসলামিক ফাউন্ডেশনঃ ৩২২৪) আবূ নযর (রহ.) বলেন, পলায়নের লক্ষ্যে এলাকা ত্যাগ করো না। তবে অন্য কারণে যেতে পার, তাতে বাধা নেই। (৫৭২৮, ৬৯৭৪)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 3474,
			"arabicnumber": 3474,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে প্লেগ সম্পর্কে জিজ্ঞেস করলে উত্তরে তিনি বললেন, তা একটি আযাব। আল্লাহ্ তা‘আলা তাঁর বান্দাদের মধ্যে যাদের প্রতি ইচ্ছা করেন তাদের উপর তা প্রেরণ করেন। আর আল্লাহ্ তা‘আলা তাঁর মুমিন বান্দাগণের উপর তা রহমত করে দিয়েছেন। কোন ব্যক্তি যখন প্লেগে আক্রান্ত জায়গায় সাওয়াবের আশায় ধৈর্য ধরে অবস্থান করে এবং তার অন্তরে দৃঢ় বিশ্বাস থাকে যে, আল্লাহ্ তাকদীরে যা লিখে রেখেছেন তাই হবে তাহলে সে একজন শহীদের সমান সওয়াব পাবে। (৫৭৩৪, ৬৬১৯) (আধুনিক প্রকাশনীঃ ৩২১৬, ইসলামিক ফাউন্ডেশনঃ ৩২২৫)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 3475,
			"arabicnumber": 3475,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। মাখযূম গোত্রের এক চোর নারীর ঘটনা কুরাইশের গণ্যমান্য ব্যক্তিবর্গকে অত্যন্ত উদ্বিগ্ন করে তুললো। এ অবস্থায় তারা বলাবলি করতে লাগল এ ব্যাপারে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে কে আলাপ করতে পারে? তারা বলল, একমাত্র রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর প্রিয়তম উসামা বিন যায়িদ (রাঃ) এ ব্যাপারে আলোচনা করার সাহস করতে পারেন। উসামা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে কথা বললেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তুমি কি আল্লাহর নির্ধারিত সীমাঙ্ঘনকারিণীর সাজা মাওকুফের সুপারিশ করছ? অতঃপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দাঁড়িয়ে খুত্বায় বললেন, তোমাদের পূর্বের জাতিসমূহকে এ কাজই ধ্বংস করেছে যে, যখন তাদের মধ্যে কোন বিশিষ্ট লোক চুরি করত, তখন তারা বিনা সাজায় তাকে ছেড়ে দিত। অন্যদিকে যখন কোন অসহায় গরীব সাধারণ লোক চুরি করত, তখন তার উপর হদ্ জারি করত। আল্লাহর কসম, যদি মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কন্যা ফাতিমাহ চুরি করত তাহলে আমি তার অবশ্যই তার হাত কেটে দিতাম। (২৬৪৮, মুসলিম ২৯/২ হাঃ ১৬৮৮) (আধুনিক প্রকাশনীঃ ৩২১৭, ইসলামিক ফাউন্ডেশনঃ ৩২২৬)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 3476,
			"arabicnumber": 3476,
			"text": "‘আবদুল্লাহ ইবনু মাসঊদ (রাঃ) হতে বর্ণিত, তিনি বলেন, আমি এক লোককে কুরআনের একটি আয়াত পড়তে শুনলাম যা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে আমার শোনা তিলাওয়াতের বিপরীত। আমি তাকে নিয়ে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকটে উপস্থিত হয়ে ঘটনাটি বললাম, তখন তাঁর চেহারায় অসন্তুষ্টি লক্ষ্য করলাম। তিনি বললেন, তোমরা দু’জনেই ভাল ও সুন্দর পড়েছ। তবে তোমরা মতবিরোধ করো না। তোমাদের আগের লোকেরা মতবিরোধের কারণেই ধ্বংসপ্রাপ্ত হয়েছে। (২৪১০) (আধুনিক প্রকাশনীঃ ৩২১৮, ইসলামিক ফাউন্ডেশনঃ ৩২২৭)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 3477,
			"arabicnumber": 3477,
			"text": "‘আবদুল্লাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি যেন এখনো নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে দেখছি যখন তিনি একজন নবী (আঃ)-এর অবস্থা বর্ণনা করছিলেন যে, তাঁর স্বজাতিরা তাঁকে প্রহার করে রক্তারক্তি করে দিয়েছে আর তিনি তাঁর চেহারা হতে রক্ত মুছে ফেলছেন এবং বলছেন, হে আল্লাহ্! আমার জাতিকে ক্ষমা করে দাও, যেহেতু তারা জানে না। (৬৯২৯ , মুসলিম ৩২/৩৭ হাঃ ১৭৯২, আহমাদ ৩৬১১) (আধুনিক প্রকাশনীঃ ৩২১৯, ইসলামিক ফাউন্ডেশনঃ ৩২২৮)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 3478,
			"arabicnumber": 3478,
			"text": "আবূ সা‘ঈদ (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেন যে, তোমাদের আগের এক লোক, আল্লাহ্ তা‘আলা তাকে প্রচুর ধন-সম্পদ দান করেছিলেন। যখন তার মৃত্যুর সময় ঘনিয়ে এল তখন সে তার ছেলেদেরকে জড় করে জিজ্ঞেস করল আমি তোমাদের কেমন পিতা ছিলাম? তারা বলল আপনি আমাদের উত্তম পিতা ছিলেন। সে বলল, আমি জীবনে কখনও কোন নেক আমল করতে পারিনি। আমি যখন মারা যাব তখন তোমরা আমার লাশকে জ্বালিয়ে ছাই করে দিও এবং প্রচন্ড ঝড়ের দিন ঐ ছাই বাতাসে উড়িয়ে দিও। সে মারা গেল। ছেলেরা ওসিয়াত অনুযায়ী কাজ করল। আল্লাহ্ তা‘আলা তার ছাই জড় করে জিজ্ঞেস করলেন, এমন ওসিয়াত করতে কে তোমাকে উদ্বুদ্ধ করল? সে বলল, হে আল্লাহ্! তোমার শাস্তির ভয়। ফলে আল্লাহর রহমত তাকে ঢেকে নিল। মু‘আয (রহ.).....আবূ সা‘ঈদ (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেন। (৬৪৮১, ৭৫০৮, মুসলিম ৪৯/৪ হাঃ ২৭৫৭, আহমাদ ১১৬৬৪) (আধুনিক প্রকাশনীঃ ৩২২০, ইসলামিক ফাউন্ডেশনঃ ৩২২৯)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 3479,
			"arabicnumber": 3479,
			"text": "হুযাইফাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি, এক লোকের যখন মৃত্যুর সময় ঘনিয়ে এল এবং সে জীবন হতে নিরাশ হয়ে গেল। তখন সে তার পরিবার পরিজনকে ওসিয়াত করল, যখন আমি মরে যাব তখন তোমরা আমার জন্য অনেক লাকড়ি জমা করে আগুন জ্বালিয়ে দিও। আগুন যখন আমার গোশত জ্বালিয়ে পুড়িয়ে হাড় পর্যন্ত পৌঁছে যাবে তখন হাড়গুলি পিষে ছাই করে নিও। অতঃপর সে ছাই গরমের দিন কিংবা প্রচন্ড বাতাসের দিনে সাগরে ভাসিয়ে দিও। আল্লাহ্ তা‘আলা তার ছাই জড় করে জিজ্ঞেস করলেন, এমন কেন করলে? সে বলল, আপনার ভয়ে। আল্লাহ্ তাকে ক্ষমা করে দিলেন। ‘উকবাহ্ (রহ.) বলেন, আর আমিও তাঁকে [হুযাইফাহ (রাঃ)]-কে বলতে শুনেছি। ‘আবদুল মালিক (রহ.) হতে বর্ণিত। তিনি বলেন, অর্থাৎ প্রচন্ড বাতাসের দিনে। (৩৪৫২) (আধুনিক প্রকাশনীঃ ৩২২১, ইসলামিক ফাউন্ডেশনঃ ৩২৩০)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 3480,
			"arabicnumber": 3480,
			"text": "আবূ হুরাইরাহ্ (রাঃ) সূত্রে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, পূর্বযুগে কোন এক লোক ছিল, যে মানুষকে ঋণ প্রদান করত। সে তার কর্মচারীকে বলে দিত, তুমি যখন কোন গরীবের নিকট টাকা আদায় করতে যাও, তখন তাকে মাফ করে দিও। হয়ত আল্লাহ্ তা‘আলা এ কারণে আমাকে ক্ষমা করে দিবেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, যখন সে আল্লাহ্ তা‘আলার সাক্ষাৎ লাভ করল, তখন আল্লাহ্ তাকে ক্ষমা করে দিলেন। (২০৭৮) (আধুনিক প্রকাশনীঃ ৩২২২, ইসলামিক ফাউন্ডেশনঃ ৩২৩১)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 3481,
			"arabicnumber": 3481,
			"text": "আবূ হুরাইরাহ্ (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেন, পূর্বযুগে এক লোক তার নিজের উপর অনেক জুলুম করেছিল। যখন তার মৃত্যুকাল ঘনিয়ে এলো, সে তার পুত্রদেরকে বলল, মৃত্যুর পর আমার দেহ হাড় গোশতসহ পুড়িয়ে ছাই করে নিও এবং প্রবল বাতাসে উড়িয়ে দিও। আল্লাহর কসম! যদি আল্লাহ্ আমাকে ধরে ফেলেন, তবে তিনি আমাকে এমন কঠিনতম শাস্তি দিবেন যা অন্য কাউকেও দেননি। যখন তার মওত হল, তার সঙ্গে সে ভাবেই করা হল। অতঃপর আল্লাহ্ যমীনকে আদেশ করলেন, তোমার মাঝে ঐ ব্যক্তির যা আছে জমা করে দাও। যমীন তা করে দিল। এ ব্যক্তি তখনই দাঁড়িয়ে গেল। আল্লাহ্ তাকে জিজ্ঞেস করলেন, কিসে তোমাকে এ কাজ করতে উদ্বুদ্ধ করল? সে বলল, হে, প্রতিপালক তোমার ভয়। অতঃপর তাকে ক্ষমা করা হলো। অন্য রাবী مَخَافَتُكَ স্থলে خَشْيَتُكَ বলেছেন। (৭৫০৬, মুসলিম ৪৯/৪ হাঃ ২৭৫৬) (আধুনিক প্রকাশনীঃ ৩২২৩, ইসলামিক ফাউন্ডেশনঃ ৩২৩২)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 3482,
			"arabicnumber": 3482,
			"text": "‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) হতে বর্ণিত। আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, এক নারীকে একটি বিড়ালের কারণে আযাব দেয়া হয়েছিল। সে বিড়ালটিকে বেঁধে রেখেছিল। সে অবস্থায় বিড়ালটি মরে যায়। মহিলাটি ঐ কারণে জাহান্নামে গেল। কেননা সে বিড়ালটিকে খানা-পিনা কিছুই করাইনি এবং ছেড়েও দেয়নি যাতে সে যমীনের পোকা-মাকড় খেয়ে বেঁচে থাকত। (আধুনিক প্রকাশনীঃ ৩২২৪, ইসলামিক ফাউন্ডেশনঃ ৩২৩৩)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 3483,
			"arabicnumber": 3483,
			"text": "আবূ মাস‘ঊদ ‘উকবাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, আম্বিয়া-এ-কিরামের উক্তিসমূহ যা মানব জাতি লাভ করেছে, তার মধ্যে একটি হল, ‘‘যদি তোমার লজ্জা না থাকে তাহলে তুমি যা ইচ্ছে তাই কর।’’ (৩৪৮৪, ৬১২০) (আধুনিক প্রকাশনীঃ ৩২২৫, ইসলামিক ফাউন্ডেশনঃ ৩২৩৪)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 3484,
			"arabicnumber": 3484,
			"text": "আবূ মাসঊদ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, প্রথম যুগের আম্বিয়া-এ-কিরামের উক্তিসমূহ যা মানব জাতি লাভ করেছে, তন্মধ্যে একটি হল, ‘‘যদি তোমার লজ্জা না থাকে, তাহলে তুমি যা ইচ্ছে তাই কর।’’ (৩৪৮৩) (আধুনিক প্রকাশনীঃ ৩২২৬, ইসলামিক ফাউন্ডেশনঃ ৩২৩৫)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 3485,
			"arabicnumber": 3485,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, এক ব্যক্তি গর্ব ও অহংকারের সাথে লুঙ্গি টাখ্নুর নীচে ঝুলিয়ে পথ চলছিল। এই অবস্থায় তাকে যমীনে ধ্বসিয়ে দেয়া হল এবং কিয়ামত পর্যন্ত সে এমনি অবস্থায় নীচের দিকেই যেতে থাকবে। ‘আবদুর রহমান ইবনু খালিদ (রহ.) ইমাম যুহরী (রহ.) হতে হাদীস বর্ণনায় ইউনুস (রহ.)-এর অনুসরণ করেছেন। (৭৫৯০) (আধুনিক প্রকাশনীঃ ৩২২৭, ইসলামিক ফাউন্ডেশনঃ ৩২৩৬)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 3487,
			"arabicnumber": 3487,
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 3488,
			"arabicnumber": 3488,
			"text": "সা‘ঈদ ইবনু মুসাইয়্যাব (রহ.) হতে বর্ণিত। তিনি বলেন যে, যখন মু‘আবিয়া ইবনু আবূ সুফ্ইয়ান (রাঃ) মদিনা্য় সর্বশেষ আগমন করেন, তখন তিনি আমাদেরকে লক্ষ্য করে খুত্বা প্রদানকালে একগুচ্ছ পরচুলা বের করে বলেন, ইয়াহূদীরা ছাড়া অন্য কেউ এর ব্যবহার করে বলে আমার ধারণা ছিল না। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এ কাজকে মিথ্যা প্রতারণা বলে আখ্যায়িত করেছেন। অর্থাৎ পরচুলা। গুন্দর (রহ.) শু‘বা (রহ.) হতে হাদীস বর্ণনায় আদম (রহ.)-এর অনুসরণ করেছেন। (৩৪৬৮) (আধুনিক প্রকাশনীঃ ৩২২৯, ইসলামিক ফাউন্ডেশনঃ ৩২৩৮)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 154
			}
		}
	]
}