{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3776,
			"arabicnumber": 3776,
			"text": "وَقَوْلُ اللهِ عَزَّ وَجَلَّ وَالَّذِيْنَ تَبَوَّؤُوْا الدَّارَ وَالإِيْمَانَ مِنْ قَبْلِهِمْ يُحِبُّوْنَ مَنْ هَاجَرَ إِلَيْهِمْ وَلَا يَجِدُوْنَ فِيْ صُدُوْرِهِمْ حَاجَةً مِمَّا أُوْتُوْا আল্লাহ তা‘আলার বাণীঃ আর যারা মুহাজিরগণের আগমনের পূর্বে হতেই এ নগরীতে (মদিনা্‌‌তে) বসবাস করেছে ও ঈমান এনেছে এবং মুহাজিরগণকে ভালবাসে আর মুহাজিরদেরকে যা দেয়া হয়েছে তার জন্য তারা অন-রে আকাঙ্ক্ষা পোষণ করে না। (আল-হাশর ৯) ৩৭৭৬. গাইলান ইবনু জারীর (রহ.) হতে বর্ণিত, তিনি বলেন, আমি আনাস (রাঃ)-কে জিজ্ঞেস করলাম, আপনাদের আনসার নামকরণ সম্পর্কে আপনার মন্তব্য কী? এ নাম কি আপনারা করেছেন, না আল্লাহ্ আপনাদের এ নামকরণ করেছেন? আনাস (রাঃ) বললেন, বরং আল্লাহ্ তা‘আলা আমাদের এ নামকরণ করেছেন। [গাইলান (রহ.) বলেন] আমরা যখন আনাস (রাঃ)-এর নিকট যেতাম, তখন তিনি আমাদেরকে আনসারদের গুণাবলী ও কার্যাবলী বর্ণনা করে শুনাতেন। তিনি আমাকে অথবা আয্দ গোত্রের এক ব্যক্তিকে লক্ষ্য করে বলতেন, তোমার গোত্র অমুক দিন অমুক কাজ করেছেন, অমুক দিন অমুক কাজ করেছেন। (৩৮৪৪) (৩৮৪৪) (আধুনিক প্রকাশনীঃ ৩৪৯৪, ইসলামিক ফাউন্ডেশনঃ ৩৫০২)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3777,
			"arabicnumber": 3777,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত, তিনি বলেন, বু‘আস যুদ্ধ এমন একটি যুদ্ধ ছিল, যা আল্লাহ তা‘আলা তাঁর মদিনা আগমনের পূর্বেই ঘটিয়েছিলেন। রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন মদিনা্য় আগমন করলেন তখন সেখানকার গণ্যমান্য ও নেতৃস্থানীয় ব্যক্তিবর্গ নানা দলে উপদলে বিভক্ত হয়ে পড়েছিল। তাদের নেতৃস্থানীয় ব্যক্তিগণ এ যুদ্ধে নিহত ও আহত হয়েছিল। তাদের ইসলাম গ্রহণকে আল্লাহ্ তা‘আলা তাঁর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর জন্য অনুকূল করে দিয়েছিলেন। (৩৮৪৬, ৩৯৩০) (আধুনিক প্রকাশনীঃ ৩৪৯৫, ইসলামিক ফাউন্ডেশনঃ ৩৫০৩)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3778,
			"arabicnumber": 3778,
			"text": "আবূ তাইয়্যাহ (রহ.) হতে বর্ণিত, তিনি বলেন, আমি আনাস (রাঃ)-কে বলতে শুনেছি, মক্কা বিজয়ের দিন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কুরাইশদেরকে মালে গনীমত দিলে কিছু সংখ্যক আনসার বলেছিলেন যে, এ বড় আশ্চর্যের বিষয় যে, তিনি কুরাইশদের মাল দিলেন অথচ আমাদের তলোয়ার হতে তাদের রক্ত এখনও ঝরছে। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট এ কথা পৌঁছলে তিনি আনসারদেরকে ডেকে বললেন, আমি তোমাদের হতে যে কথাটি শুনতে পেলাম, সে কথাটি কী? যেহেতু তাঁরা মিথ্যা কথা বলতেন না, সেহেতু তাঁরা বললেন, আপনার নিকট যা পৌঁছেছে তা সত্যই। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তোমরা কি এতে সন্তুষ্ট নও যে, লোকজন গনীমতের মাল নিয়ে তাদের ঘরে ফিরে যাবে আর তোমরা আল্লাহর রাসূলকে নিয়ে নিজ ঘরে ফিরবে। যদি আনসারগণ উপত্যকা বা গিরিপথ দিয়ে চলে তবে আমি আনসারদের উপত্যকা বা গিরিপথ দিয়েই চলব। (৩১৪৬) (আধুনিক প্রকাশনীঃ ৩৪৯৬, ইসলামিক ফাউন্ডেশনঃ ৩৫০৪)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3779,
			"arabicnumber": 3779,
			"text": "قَالَهُ عَبْدُ اللهِ بْنُ زَيْدٍ عَنْ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ‘আবদুল্লাহ ইবনু যায়দ (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে একথা বর্ণনা করেছেন। ৩৭৭৯. আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অথবা তিনি বলেছেন, আবুল কাসিম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, আনসারগণ যদি কোন উপত্যকা বা গিরিপথে চলে তবে আমি আনসারদের উপত্যকা দিয়েই চলব। যদি হিজরাত না হত, তবে আমি আনসারদেরই একজন হতাম। আবূ হুরাইরাহ (রাঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এ কথায় কোন অত্যুক্তি করেননি। আমার মাতা-পিতা তাঁর উপর কুরবান হোক তারা তাঁকে আশ্রয় দিয়েছেন, সর্বতোভাবে সাহায্য করেছেন। কিংবা এমন কিছু বলেছেন। (৭২৪৪) (আধুনিক প্রকাশনীঃ ৩৪৯৭, ইসলামিক ফাউন্ডেশনঃ ৩৫০৫)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3780,
			"arabicnumber": 3780,
			"text": "‘আবদুর রহমান ইবনু ‘আওফ (রাঃ) হতে বর্ণিত, তিনি বলেন, যখন মুহাজিরগণ মদিনা্য় আগমন করলেন, তখন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আবদুর রাহমান ইবনু ‘আউফ ও সা‘দ ইবনু রাবী‘ (রাঃ) এর মধ্যে ভ্রাতৃত্ব বন্ধন স্থাপন করে দিলেন। তখন তিনি [সা‘দ (রাঃ)] ‘আবদুর রাহমান (রাঃ) কে বললেন, আনসারদের মধ্যে আমিই সব থেকে বেশি সম্পদের অধিকারী। আপনি আমার সম্পদকে দু’ভাগ করে নিন। আমার দু’জন স্ত্রী রয়েছে, আপনার যাকে পছন্দ হয় বলুন, আমি তাকে তালাক দিয়ে দিব। ইদ্দত শেষে আপনি তাকে বিয়ে করে নিবেন। ‘আবদুর রহমান (রাঃ) বললেন, আল্লাহ আপনার পরিবারে এবং সম্পদে বরকত দান করুন। আপনাদের বাজার কোথায়? তারা তাঁকে বনূ কায়নুকার বাজার দেখিয়ে দিলেন। যখন ঘরে ফিরলেন তখন কিছু পনির ও কিছু ঘি সাথে নিয়ে ফিরলেন। এরপর প্রতিদিন সকাল বেলা বাজার যেতে লাগলেন। একদিন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে এমন অবস্থায় আসলেন যে, তাঁর শরীর ও কাপড়ে হলুদ রং এর চিহ্ন ছিল। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, ব্যাপার কী! তিনি (রাঃ) বললেন, আমি বিয়ে করেছি। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জিজ্ঞেস করলেন, তাকে কী পরিমাণ মাহর দিয়েছ? তিনি বললেন, খেজুরের এক আঁটির পরিমাণ অথবা খেজুরের এক আঁটির ওজন পরিমাণ স্বর্ণ দিয়েছি। (২০৪৮) (আধুনিক প্রকাশনীঃ ৩৪৯৮, ইসলামিক ফাউন্ডেশনঃ ৩৫০৬)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 3781,
			"arabicnumber": 3781,
			"text": "আনাস (রাঃ) হতে বর্ণিত, তিনি বলেন, ‘আবদুর রাহমান ইবনু আউফ (রাঃ) হিজরাত করে আমাদের কাছে এলে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর ও সা‘দ ইবনু রাবী‘ (রাঃ)-এর মাঝে ভ্রাতৃত্বের বন্ধন জুড়ে দিলেন। সাদ (রাঃ) ছিলেন অনেক সম্পদশালী। সা‘দ (রাঃ) বললেন, সকল আনসারগণ জানেন যে আমি তাঁদের মধ্যে অধিক সম্পদশালী। আমি শীঘ্রই আমার ও তোমার মাঝে আমার সম্পদ ভাগাভাগি করে দিব দুই ভাগে। আমার দু’জন স্ত্রী রয়েছে; তোমার যাকে পছন্দ হয় বল, আমি তাকে তালাক দিয়ে দিব। ইদ্দত শেষে তুমি তাকে বিয়ে করে নিবে। ‘আবদুর রাহমান (রাঃ) বললেন, আল্লাহ্ আপনার পরিবার পরিজনের মধ্যে বরকত দান করুন। ব্যবসা আরম্ভ করে বাজার হতে মুনাফা স্বরূপ ঘি ও পনির সাথে নিয়ে ফিরলেন। অল্প কয়েকদিন পর তিনি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট হাযির হলেন। তখন তাঁর শরীরে ও কাপড়ে হলুদ রংয়ের চিহ্ন ছিল। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জিজ্ঞেস করলেন, ব্যাপার কী? তিনি বললেন, আমি একজন আনসারী মহিলাকে বিয়ে করেছি। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তাঁকে কী পরিমাণ মাহর দিয়েছ? তিনি বললেন, খেজুরের এক আঁটির ওজন পরিমাণ স্বর্ণ দিয়েছি অথবা একটি আঁটি পরিমাণ স্বর্ণ দিয়েছি। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, একটি বকরী দিয়ে হলেও ওয়ালীমা কর। (২০৪৯) (আধুনিক প্রকাশনীঃ ৩৪৯৯, ইসলামিক ফাউন্ডেশনঃ ৩৫০৭)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3782,
			"arabicnumber": 3782,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত, তিনি বলেন, আনসারগণ বললেন, আমাদের খেজুরের বাগানগুলি আমাদের এবং তাদের (মুহাজিরদের) মাঝে বণ্টন করে দিন। তিনি (নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বললেন, না, তখন আনসারগণ বললেন, আপনারা বাগানগুলির রক্ষণাবেক্ষণে আমাদের সাহায্য করুন এবং ফসলের অংশীদার হয়ে যান। মুহাজিরগণ বললেন, আমরা শুনলাম ও মেনে নিলাম। (২৩২৫) (আধুনিক প্রকাশনীঃ ৩৫০০, ইসলামিক ফাউন্ডেশনঃ ৩৫০৮)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3783,
			"arabicnumber": 3783,
			"text": "বারা (রাঃ) হতে বর্ণিত, তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি, মু’মিন ছাড়া আনসারদেরকে কেউ ভালবাসবে না এবং মুনাফিক ছাড়া কেউ তাঁদের প্রতি ঘৃণা পোষণ করে না। যে ব্যক্তি তাঁদেরকে ভালবাসবে আল্লাহ্ তা‘আলা তাকে ভালবাসবেন আর যে ব্যক্তি তাঁদের সাথে হিংসা-বিদ্বেষ পোষণ করবে আল্লাহ্ তা‘আলা তাকে ঘৃণা করবেন। (মুসলিম ১/৩৩, হাঃ নং ৭৫, আহমাদ ১৮৬০০) (আধুনিক প্রকাশনীঃ ৩৫০১, ইসলামিক ফাউন্ডেশনঃ ৩৫০৯)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3784,
			"arabicnumber": 3784,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, আনসারদের প্রতি ভালবাসা ঈমানেরই নিদর্শন এবং তাঁদের প্রতি হিংসা-বিদ্বেষ রাখা মুনাফিকীর নিদর্শন। (১৭) (আধুনিক প্রকাশনীঃ ৩৫০২, ইসলামিক ফাউন্ডেশনঃ ৩৫১০)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3785,
			"arabicnumber": 3785,
			"text": "আনাস (রাঃ) হতে বর্ণিত, তিনি বলেন, (আনসারের) কতিপয় বালক-বালিকা ও নারীকে রাবী (বর্ণনাকারী) বলেন, আমার মনে হয় তিনি বলেছিলেন, কোন বিবাহ অনুষ্ঠান শেষে ফিরে আসতে দেখে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁদের উদ্দেশে দাঁড়িয়ে গেলেন। এরপর তিনি বললেন, আল্লাহ্ জানেন, তোমরাই আমার সবচেয়ে প্রিয়জন। কথাটি তিনি তিনবার বললেন। (৫১৮০, মুসলিম ৪৪/৪৩, হাঃ নং ২৫০৭, আহমাদ ১২৭৯৭) (আধুনিক প্রকাশনীঃ ৩৫০৩, ইসলামিক ফাউন্ডেশনঃ ৩৫১১)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3786,
			"arabicnumber": 3786,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত, তিনি বলেন, একজন আনসারী মহিলা তার শিশুসহ রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট হাযির হলেন। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার সঙ্গে কথা বললেন এবং বললেন, ঐ আল্লাহর কসম যাঁর হাতে আমার প্রাণ, লোকদের মধ্যে তোমরাই আমার সবচেয়ে প্রিয়জন। কথাটি তিনি দু’বার বললেন। (৫২৩৪, ৬৬৪৫, মুসলিম, হাঃ নং ২৫০৯, আহমাদ ১২৩০৭) (আধুনিক প্রকাশনীঃ ৩৫০৪, ইসলামিক ফাউন্ডেশনঃ ৩৫১২)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3787,
			"arabicnumber": 3787,
			"text": "যায়দ ইবনু আরকাম (রাঃ) হতে বর্ণিত, তিনি বলেন, আনসারগণ বললেন, হে আল্লাহর রাসূল! প্রত্যেক নবীরই অনুসারী ছিলেন। আমরাও আপনার অনুসারী। আপনি আমাদের উত্তরসুরীদের জন্য দু’আ করুন যেন তারা আপনার অনুসারী হয়। তিনি দু‘আ করলেন। (রাবী বলেন) আমি এই হাদীসটি ইবনু আবূ লায়লার নিকট বর্ণনা করলাম, তিনি বললেন, যায়দ ইবনু আরকাম (রাঃ) এভাবেই হাদীসটি বর্ণনা করেছেন। (৩৭৮৮) (আধুনিক প্রকাশনীঃ ৩৫০৫, ইসলামিক ফাউন্ডেশনঃ ৩৫১৩)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3788,
			"arabicnumber": 3788,
			"text": "আবূ হামযাহ (রাঃ) নামক একজন আনসারী হতে বর্ণিত, কতিপয় আনসার বললেন, প্রত্যেক জাতির মধ্যে অনুসরণকারী একটি দল থাকে। হে আল্লাহর রাসূল! আমরাও আপনার অনুসরণ করছি। আপনি আল্লাহর নিকট দু‘আ করুন যেন আমাদের উত্তরসুরিরা আমাদের অনুসারী হয়। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, হে আল্লাহ্ তাঁদের উত্তরসুরীদেরকে তাদের মত করে দাও। আমর (রহ.) বলেন, আমি হাদীসটি ‘আবদুর রাহমান ইবনু আবূ লায়লা (রাঃ)-কে বললাম। তিনি বললেন, যায়দও এইভাবে হাদীসটি বলেছেন। শু‘বা (রহ.) বলেন, আমার ধারণা, ইনি যায়দ ইবনু আরকাম (রাঃ)-ই হবেন। (৩৭৮৭) (আধুনিক প্রকাশনীঃ ৩৫০৬, ইসলামিক ফাউন্ডেশনঃ ৩৫১৪)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3789,
			"arabicnumber": 3789,
			"text": "আবূ উসায়দ (রাঃ) হতে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, সবচেয়ে উত্তম গোত্র হল বানূ নাজ্জার, তারপর বানূ আবদুল আশহাল তারপর বনূ হারিস ইবনু খাযরাজ তারপর বানূ সায়িদা এবং আনসারদের সকল গোত্রের মধ্যেই কল্যাণ রয়েছে। এ শুনে সা‘দ (রাঃ) বললেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কি অন্যদেরকে আমাদের উপর শ্রেষ্ঠত্ব দান করেছেন? তখন তাকে বলা হল, তোমাদেরকে তো অনেক গোত্রের উপর শ্রেষ্ঠত্ব দান করেছেন। আবদুল ওয়ারিস (রহ.)...আবূ উসাইদ (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এ রকমই বর্ণিত আছে। আর সা‘দ ইবনু ‘উবাদাহ (রাঃ) বলেছেন। (৩৭৯০, ৩৮০৭, ৬০৫৩, মুসলিম, ৪৪/৪৪, হাঃ নং ২৫১১, আহমাদ ৩৮০১) (আধুনিক প্রকাশনীঃ ৩৫০৭, ইসলামিক ফাউন্ডেশনঃ ৩৫১৫)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3790,
			"arabicnumber": 3790,
			"text": "আবূ উসায়দ (রাঃ) বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি, তিনি বলেছেন, আনসারদের মধ্যে বা আনসার গোত্রগুলোর মধ্যে সবচেয়ে উত্তম গোত্র হল বানূ নাজ্জার, বানূ আবদুল আশহাল, বানূ হারিস ও বানূ সা‘য়িদা। (৩৭৮৯) (আধুনিক প্রকাশনীঃ ৩৫০৮, ইসলামিক ফাউন্ডেশনঃ ৩৫১৬)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3791,
			"arabicnumber": 3791,
			"text": "আবূ হুমায়দ (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত, তিনি বলেন, আনসারদের মধ্যে সবচেয়ে উত্তম গোত্র হল বানূ নাজ্জার, তারপর বানূ আবদুল আশহাল, তারপর বানূ হারিস এরপর বানূ সা‘য়িদা। আনসারদের সকল গোত্রে রয়েছে কল্যাণ। (আবূ হুমায়দ (রহ.) বলেন,) আমরা সা‘দ ইবনু ‘উবাদাহ (রাঃ)-এর নিকট গেলাম। তখন আবূ উসায়দ (রাঃ) বললেন, আপনি কি শোনেননি যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আনসারদের পরস্পরের মধ্যে শ্রেষ্ঠত্ব বর্ণনা করতে গিয়ে আমাদেরকে সকলের শেষ পর্যায়ে স্থান দিয়েছেন? তা শুনে সা‘দ (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে সাক্ষাৎ করে বললেন, হে আল্লাহর রাসূল! আনসার গোত্রগুলোকে প্রাধান্য দেয়া হয়েছে এবং আমাদেরকে সকলের শেষ স্তরে স্থান দেয়া হয়েছে। তিনি বললেন, এটা কি তোমাদের জন্য যথেষ্ট নয় যে, তোমরাও শ্রেষ্ঠদের অন্তর্ভুক্ত হয়েছ? (১৪৮১, মুসলিম, ৪৩/৩ হাঃ নং ১৩৯২) (আধুনিক প্রকাশনীঃ ৩৫০৯, ইসলামিক ফাউন্ডেশনঃ ৩৫১৭)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 3792,
			"arabicnumber": 3792,
			"text": "قَالَهُ عَبْدُ اللهِ بْنُ زَيْدٍ عَنْ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ হাদীসটি ‘আবদুল্লাহ ইবনু যায়দ (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেছেন। ৩৭৯২. উসায়দ ইবনু হুযায়র (রাঃ) হতে বর্ণিত, একজন আনসারী বললেন, হে আল্লাহর রাসূল, আপনি কি আমাকে অমুকের ন্যায় দায়িত্বে নিয়োজিত করবেন না? তিনি সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তোমরা আমার ওফাতের পর অপরকে অগ্রাধিকার দেওয়া দেখতে পাবে, তখন তোমরা ধৈর্য ধারণ করবে অবশেষে আমার সাথে সাক্ষাৎ করবে এবং তোমাদের সাথে সাক্ষাতের স্থান হল হাউয। (৭০৫৭, মুসলিম ৩৩/১১, হাঃ নং ১৮৪৫, আহমাদ ১৯১১৬) (আধুনিক প্রকাশনীঃ ৩৫১০/৩৫১১, ইসলামিক ফাউন্ডেশনঃ ৩৫১৮)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 3793,
			"arabicnumber": 3793,
			"text": "আনাস বিন মালিক (রাঃ) হতে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আনসারদের উদ্দেশে বলেন, তোমরা অচিরেই আমার সঙ্গে সাক্ষাৎ করবে। অতএব তোমরা আমার সাথে সাক্ষাৎ হওয়া পর্যন্ত ধৈর্য ধারণ কর প্রতিশ্রুত হাউযের নিকট গমন পর্যন্ত। (৩১৪৬) (আধুনিক প্রকাশনীঃ নাই, ইসলামিক ফাউন্ডেশনঃ নাই)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 3794,
			"arabicnumber": 3794,
			"text": "ইয়াহ্ইয়া ইবনু সাঈদ (রহ.) হতে বর্ণিত তিনি যখন আনাস ইবনু মালিক (রাঃ)-এর সঙ্গে ওয়ালীদ (ইবনু ‘আবদুল মালিক)-এর নিকট সাক্ষাতের উদ্দেশে বাসরা হতে দামেস্ক সফর করতে গিয়েছিলেন, তখন তিনি আনাস (রাঃ)-কে বলতে শুনেছেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বাহরাইনের জমি তাদের জন্য বরাদ্দ করার জন্য আনসারদেরকে ডাকলে তারা বললেন, হে আল্লাহর রাসূল! আমাদের মুহাজির ভাইদের জন্য এরূপ জায়গীর বরাদ্দ না করা পর্যন্ত আমরা তা গ্রহণ করব না। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তোমরা যদি তা গ্রহণ করতে না চাও, তবে (কিয়ামতের ময়দানে) হাউযের নিকটে আমার সঙ্গে সাক্ষাৎ না হওয়া পর্যন্ত ধৈর্য অবলম্বন কর। কেননা শীঘ্রই তোমরা দেখতে পাবে, আমার পরে তোমাদের উপর অন্যদেরকে অগ্রাধিকার দেয়া হচ্ছে। (২৩৭৬) (আধুনিক প্রকাশনীঃ ৩৫১২, ইসলামিক ফাউন্ডেশনঃ ৩৫১৯)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 3795,
			"arabicnumber": 3795,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, হে আল্লাহ্! আখিরাতের জীবনই প্রকৃত জীবন। হে আল্লাহ্! আনসার ও মুহাজিরদের কল্যাণ করুন। (২৮৩৪) কাতাদাহ (রহ.) আনাস (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এ রকম বর্ণনা করেছেন। তিনি বলেছেন হে আল্লাহ্! আনসারকে মাফ করে দিন। (আধুনিক প্রকাশনীঃ ৩৫১৩, ইসলামিক ফাউন্ডেশনঃ ৩৫২০)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 3796,
			"arabicnumber": 3796,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত, তিনি বলেন, আনসারগণ খন্দক যুদ্ধের পরিখা খননের সময় বলছিলেন, আমরা হলাম ঐ সমস্ত লোক যারা মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর হাতে জিহাদের জন্য বায়‘আত করেছি যত দিন আমরা বেঁচে থাকব। এর উত্তরে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, হে আল্লাহ্! আখিরাতের জীবনই আসল জীবন। (হে আল্লাহ্) আনসার ও মুহাজিরদের সম্মান বাড়িয়ে দাও। (২৮৩৪) (আধুনিক প্রকাশনীঃ ৩৫১৪, ইসলামিক ফাউন্ডেশনঃ ৩৫২১)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 3797,
			"arabicnumber": 3797,
			"text": "সাহল (রাঃ) হতে বর্ণিত, তিনি বলেন, আমরা যখন পরিখা খনন করে আমাদের স্কন্ধে করে মাটি বহন করছিলাম, তখন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের নিকট এসে বললেন, হে আল্লাহ্! আখিরাতের জীবনই আসল জীবন। মুহাজির ও আনসারদেরকে আপনি মাফ করে দিন। (৪০৯৮, ৬৪১৪, মুসলিম ৩২/৪৪, হাঃ নং ১৮০৪, আহমাদ ২২৮৭৮) (আধুনিক প্রকাশনীঃ ৩৫১৫, ইসলামিক ফাউন্ডেশনঃ ৩৫২২)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 3798,
			"arabicnumber": 3798,
			"text": "আবূ হুরাইরাহ (রাঃ) থেকে বর্ণিত, এক লোক নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর খেদমতে এল। তিনি সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর স্ত্রীদের কাছে লোক পাঠালেন। তাঁরা জানালেন, আমাদের নিকট পানি ছাড়া কিছুই নেই। তখন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, কে আছ যে এই ব্যক্তিকে মেহমান হিসেবে নিয়ে নিজের সাথে খাওয়াতে পার? তখন এক আনসারী সাহাবী [আবূ ত্বলহা (রাঃ)] বললেন, আমি। এ বলে তিনি মেহমানকে নিয়ে গেলেন এবং স্ত্রীকে বললেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর মেহমানকে সম্মান কর। স্ত্রী বললেন, বাচ্চাদের খাবার ছাড়া আমাদের ঘরে অন্য কিছুই নেই। আনসারী বললেন, তুমি আহার প্রস্তুত কর এবং বাতি জ্বালাও এবং বাচ্চারা খাবার চাইলে তাদেরকে ঘুম পাড়িয়ে দাও। সে বাতি জ্বালাল, বাচ্চাদেরকে ঘুম পাড়াল এবং সামান্য খাবার যা তৈরি ছিল তা উপস্থিত করল। বাতি ঠিক করার বাহানা করে স্ত্রী উঠে গিয়ে বাতিটি নিভিয়ে দিলেন। তারপর তারা স্বামী-স্ত্রী দু’জনই অন্ধকারের মধ্যে আহার করার মত শব্দ করতে লাগলেন এবং মেহমানকে বুঝাতে লাগলেন যে, তারাও সঙ্গে খাচ্ছেন। তাঁরা উভয়েই সারা রাত অভুক্ত অবস্থায় কাটালেন। ভোরে যখন তিনি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট গেলেন, তখন তিনি সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আল্লাহ্ তোমাদের গত রাতের কান্ড দেখে হেসে দিয়েছেন অথবা বলেছেন খুশী হয়েছেন এবং এ আয়াত নাযিল করেছেন। ‘‘তারা অভাবগ্রস্ত সত্ত্বেও নিজেদের উপর অন্যদেরকে অগ্রগণ্য করে থাকে। আর যাদেরকে অন্তরের কৃপণতা হতে মুক্ত রাখা হয়েছে, তারাই সফলতাপ্রাপ্ত।’’ (আল-হাশর ৯) (৪৮৮৯, মুসলিম, ৩৬/৩২, হাঃ নং ২০৫৪) (আধুনিক প্রকাশনীঃ ৩৫১৬, ইসলামিক ফাউন্ডেশনঃ ৩৫২৩)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 3799,
			"arabicnumber": 3799,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন অন্তিম রোগে আক্রান্ত তখন আবূ বাকর ও ‘আব্বাস (রাঃ) আনসারদের কোন একটি মজলিসের পাশ দিয়ে যাওয়ার কালে দেখতে পেলেন যে, তারা কাঁদছেন। তাঁদের একজন জিজ্ঞেস করলেন, আপনারা কাঁদছেন কেন? তাঁরা বললেন, আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সাথে আমাদের মজলিস স্মরণ করে কাঁদছি। তারা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট এসে আনসারদের অবস্থা বললেন, রাবী (বর্ণনাকারী) বললেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম চাদরের কোণা দিয়ে মাথা বেঁধে বেরিয়ে আসলেন এবং মিম্বরে উঠে বসলেন। এ দিনের পর আর তিনি মিম্বরে আরোহণ করেননি। তারপর হামদ ও সানা পাঠ করে সমবেত সাহাবীদেরকে উদ্দেশ্য করে বললেন, আমি আনসারগণের প্রতি বিশেষভাবে লক্ষ্য রাখার জন্য তোমাদেরকে নির্দেশ দিচ্ছি; কেননা তাঁরাই আমার অতি আপন জন, তাঁরাই আমার বিশ্বস্ত লোক। তারা তাঁদের উপর অর্পিত দায়িত্ব ও কর্তব্য পরিপূর্ণভাবে পালন করেছে। তাঁদের যা প্রাপ্য তা তাঁরা এখনো পায়নি। তাঁদের নেক লোকদের নেক ‘আমলগুলো গ্রহণ করবে এবং তাঁদের ভুল-ত্রুটি মাফ করে দিবে। (৩৮০১) (আধুনিক প্রকাশনীঃ ৩৫১৭, ইসলামিক ফাউন্ডেশনঃ ৩৫২৪)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 3800,
			"arabicnumber": 3800,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একটি চাদর গায়ে জড়িয়ে, চাদরের দু-প্রান্ত দু’কাধে পেঁচিয়ে এবং মাথায় একটি কাল রঙের পাগড়ী বেঁধে বের হলেন এবং মিম্বরে উঠে বসলেন। হাম্দ ও সানার পর বললেন, হে লোক সকল, জনসংখ্যা ক্রমশঃ বাড়তে থাকবে আর আনসারগণের সংখ্যা ক্রমশঃ কমতে থাকবে! এমনকি তারা খাবারে লবণের পরিমাণের মত হয়ে যাবে। তোমাদের মধ্যে যদি কেউ এমন ক্ষমতা ও কর্তৃত্ব লাভ করে যে ইচ্ছা করলে কারো উপকার বা অপকার করতে পারে, তখন সে যেন নেক্কার আনসারদের নেক্ ‘আমলগুলো গ্রহণ করে এবং তাদের ভুল-ত্রুটি মাফ করে দেয়। (৯২৭) (আধুনিক প্রকাশনীঃ ৩৫১৮, ইসলামিক ফাউন্ডেশনঃ ৩৫২৫)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 3801,
			"arabicnumber": 3801,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, আনসারগণ আমার অতি আপনজন ও বিশ্বস্ত লোক। লোকসংখ্যা বাড়তে থাকবে আর তাদের সংখ্যা কমতে থাকবে। তাই তাদের নেক্কারদের নেক ‘আমলগুলো কবূল কর এবং তাদের ভুল-ত্রুটি মাফ করে দাও। (৩৭৯৯, মুসলিম ৪৪/৪৩, হাঃ নং ২৫১০) ) (আধুনিক প্রকাশনীঃ ৩৫১৯, ইসলামিক ফাউন্ডেশনঃ ৩৫২৬)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 3802,
			"arabicnumber": 3802,
			"text": "বারা’ (রাঃ) হতে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে এক জোড়া রেশমী কাপড় হাদীয়া দেয়া হল। সহাবায়ে কেরাম (রাঃ) তা স্পর্শ করে এর কোমলতায় অবাক হয়ে গেলেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, এর কোমলতায় তোমরা অবাক হচ্ছ? অথচ সা‘দ ইবনু মু‘আয (রাঃ)-এর (জান্নাতের) রুমাল এর চেয়ে অনেক উত্তম, অথবা বলেছেন অনেক মোলায়েম। হাদীসটি ক্বাতাদাহ্ ও যুহরী (রহ.) আনাস (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেছেন। (৩২৪৯, মুসলিম ৪৪/২৪, হাঃ নং ২৪৬৮) (আধুনিক প্রকাশনীঃ ৩৫২০, ইসলামিক ফাউন্ডেশনঃ ৩৫২৭)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 3803,
			"arabicnumber": 3803,
			"text": "জাবির (রাঃ) বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি সা‘দ ইবনু মু‘আয (রাঃ)-এর মৃত্যুতে আল্লাহ্ তা‘আলার আরশ কেঁপে উঠেছিল। আমাশ (রহ.).....নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এ রকমই বর্ণিত হয়েছে, এক ব্যক্তি জাবির (রাঃ)-কে বলল, বারা ইবনু আযিব (রাঃ) তো বলেন, জানাযার খাট নড়েছিল। তদুত্তরে জাবির (রাঃ) বললেন, সা‘দ ও বারা (রাঃ)-এর গোত্রদ্বয়ের মধ্যে কিছুটা বিরোধ ছিল, কেননা আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে ‘‘আল্লাহর আরশ্ সা‘দ ইবনু মু‘আযের (ওফাতে) কেঁপে উঠল’’ (কথাটি) বলতে শুনেছি।(আধুনিক প্রকাশনীঃ ৩৫২১, ইসলামিক ফাউন্ডেশনঃ ৩৫৩১)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 3804,
			"arabicnumber": 3804,
			"text": "আবূ সা‘ঈদ খুদরী (রাঃ) হতে বর্ণিত, কতিপয় লোক (বনী কুরায়যার ইয়াহূদীগণ) সা‘দ ইবনু মু‘আয (রাঃ)-কে সালিশ মেনে (দুর্গ থেকে) নেমে আসে। তাঁকে নিয়ে আসার জন্য লোক পাঠানো হল। তিনি গাধায় সাওয়ার হয়ে আসলেন। যখন মসজিদের নিকটে আসলেন, তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তোমাদের শ্রেষ্ঠতম ব্যক্তি অথবা (বললেন) তোমাদের সরদার আসছেন তাঁর দিকে দাঁড়াও। তারপর তিনি বললেন, হে সা‘দ! তারা তোমাকে সালিশ মেনে বেরিয়ে এসেছে। সা‘দ (রাঃ) বললেন, আমি তাদের সম্পর্কে এ ফয়সালা দিচ্ছি যে, তাদের যোদ্ধাদেরকে হত্যা করা হোক এবং শিশু ও মহিলাদেরকে বন্দী করে রাখা হোক। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তুমি আল্লাহ্ তা‘আলার ফায়সালা মোতাবেক ফায়সালা দিয়েছ অথবা (বলেছিলেন) তুমি বাদশাহর অর্থাৎ আল্লাহর ফায়সালা অনুযায়ী ফায়সালা করেছ। (৩০৪৩) (আধুনিক প্রকাশনীঃ ৩৫২২, ইসলামিক ফাউন্ডেশনঃ ৩৫২৯)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 3805,
			"arabicnumber": 3805,
			"text": "আনাস (রাঃ) হতে বর্ণিত, দু’ ব্যক্তি অন্ধকার রাতে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট হতে বের হলেন। হঠাৎ তারা তাদের সম্মুখে একটি উজ্জ্বল আলো দেখতে পেলেন। রাস্তায় তাঁরা যখন আলাদা হলেন তখন আলোটিও তাঁদের উভয়ের সাথে আলাদা আলাদা হয়ে গেল। মা’মার (রহ.) সাবিত এর মাধ্যমে আনাস (রাঃ) হতে বর্ণনা করেন যে, এদের একজন উসায়দ ইবনু হুযায়র (রাঃ) এবং অন্যজন এক আনসারী ব্যক্তি ছিলেন এবং হাম্মাদ (রহ.) সাবিত (রহ.)-এর মাধ্যমে আনাস (রাঃ) হতে বর্ণনা করেন যে, উসায়দ (ইবনু হুযায়র) ও আববাদ ইবনু বিশ্র (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট ছিলেন। (৪৬৫) (আধুনিক প্রকাশনীঃ ৩৫২৩, ইসলামিক ফাউন্ডেশনঃ ৩৫৩০)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 3806,
			"arabicnumber": 3806,
			"text": "‘আবদুল্লাহ্ ইবনু আমর (রাঃ) হতে বর্ণিত, তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি যে, কুরআন পাঠ শিখ চার জনের নিকট হতেঃ ইবনু মাসউদ, আবূ হুযাইফার আযাদকৃত গোলাম সালিম, উবাই (ইবনু কা‘ব) ও মু‘আয ইবনু জাবাল (রাঃ) থেকে। (৩৭৫৮)(আধুনিক প্রকাশনীঃ ৩৫২৪, ইসলামিক ফাউন্ডেশনঃ ৩৫৩১)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 3807,
			"arabicnumber": 3807,
			"text": "وَقَالَتْ عَائِشَةُ وَكَانَ قَبْلَ ذَلِكَ رَجُلًا صَالِحًا ‘আয়িশাহ (রাঃ) বলেন, তিনি এর পূর্বে নেক লোক ছিলেন। ৩৮০৭. আবূ উসাইদ (রাঃ) বলেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, আনসার গোত্রগুলোর মধ্যে শ্রেষ্ঠতম গোত্র হল, বানু নাজ্জার, তারপর বানু ‘আবদ-ই-আশহাল, তারপর বানু হারিস ইবনু খাযরাজ তারপর বানু সায়িদাহ। আনসারদের সব গোত্রের মধ্যেই কল্যাণ রয়েছে। তখন সা‘দ ইবনু ‘উবাদাহ (রাঃ) যিনি ছিলেন প্রথম যুগের অন্যতম মুসলিম বললেন, আমার ধারণা যে, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অন্যদেরকে আমাদের উপর প্রাধান্য দিয়েছেন, তাঁকে বলা হল, আপনাদেরকে বহু গোত্রের উপর শ্রেষ্ঠত্ব দেয়া হয়েছে। (৩৭৮৯) (আধুনিক প্রকাশনীঃ ৩৫২৫, ইসলামিক ফাউন্ডেশনঃ ৩৫৩২)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 3808,
			"arabicnumber": 3808,
			"text": "মাসরূক (রহ.) হতে বর্ণিত যে, ‘আবদুল্লাহ ইবনু আমর (রাঃ)-এর মজলিসে ‘আবদুল্লাহ ইবনু মাস‘উদ (রাঃ)-এর আলোচনা হচ্ছিল। তখন তিনি বললেন; তিনি সে ব্যক্তি যাঁকে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর বক্তব্য শুনার পর হতে আমি খুব ভালবাসি। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, কুরআন শিক্ষা কর চারজনের নিকট থেকে, ‘আবদুল্লাহ ইবনু মাস‘উদ (সর্ব প্রথম তিনি এ নামটি বললেন), সালিম- আবূ হুযাইফার আযাদকৃত গোলাম, মু‘আয ইবনু জাবাল ও উবাই ইবনু কা‘ব (রাঃ)। (৩৭৫৮) (আধুনিক প্রকাশনীঃ ৩৫২৬, ইসলামিক ফাউন্ডেশনঃ ৩৫৩৩)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 3809,
			"arabicnumber": 3809,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উবাই ইবনু কা‘ব (রাঃ)-কে বললেন, আল্লাহ ‘‘সূরা لَمْ يَكُنِ الَّذِيْنَ كَفَرُوْا مِنْ أَهْلِ الْكِتَابِ তোমাকে পড়ে শুনানোর জন্য আমাকে আদেশ করেছেন। উবাই ইবনু কা‘ব (রাঃ) জিজ্ঞেস করলেন আল্লাহ কি আমার নাম করেছেন? নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, হাঁ। তখন তিনি কেঁদে ফেললেন। (৪৯৫৯, ৪৯৬০, ৪৯৬১, মুসলিম ৬/৩৯, হাঃ নং ৭৯৯, আহমাদ ২১১৯৪ (আধুনিক প্রকাশনীঃ ৩৫২৭, ইসলামিক ফাউন্ডেশনঃ ৩৫৩৪)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 3810,
			"arabicnumber": 3810,
			"text": "আনাস (রাঃ) হতে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর যুগে (সর্বপ্রথম) যে চার ব্যক্তি সম্পূর্ণ কুরআন হিফয করেছিলেন, তাঁরা সকলেই ছিলেন আনসারী। (তাঁরা হলেন) উবাই ইবনু কা’ব (রাঃ) মু’আয ইবনু জাবাল (রাঃ) আবূ যায়দ (রাঃ) ও যায়দ ইবনু সাবিত (রাঃ)। কাতাদাহ্ (রাঃ) বলেন, আমি আনাস (রাঃ)-কে জিজ্ঞেস করলাম, আবূ যায়দ কে? তিনি বললেন, তিনি আমার চাচাদের একজন। (৩৯৯৬, ৫০০৩, ৫০০৪, মুসলিম ৪৪/২৩, হাঃ নং ২৪৬৫, আহমাদ ১৩৯৪৪) (আধুনিক প্রকাশনীঃ ৩৫২৮, ইসলামিক ফাউন্ডেশনঃ ৩৫৩৫)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 3811,
			"arabicnumber": 3811,
			"text": "আনাস (রাঃ) হতে বর্ণিত, তিনি বলেন, ওহুদ যুদ্ধের এক সময়ে সহাবাগণ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে আলাদা হয়ে পড়েছিলেন। তখন আবূ ত্বলহা (রাঃ) ঢাল হাতে নিয়ে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সামনে প্রাচীরের মত দৃঢ় হয়ে দাঁড়ালেন। আবূ ত্বলহা (রাঃ) সুদক্ষ তীরন্দাজ ছিলেন। এক নাগাড়ে তীর ছুঁড়তে থাকায় তাঁর হাতে ঐদিন দু’ বা তিনটি ধনুক ভেঙ্গে যায়। ঐ সময় তীর ভর্তি তীরাধার নিয়ে যে কেউ তাঁর নিকট দিয়ে যেতো নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকেই বলতেন, তোমরা তীরগুলি আবূ ত্বলহার জন্য রেখে দাও। এক সময় নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মাথা উঁচু করে শত্রুদের অবস্থা দেখতে চাইলে আবূ ত্বলহা (রাঃ) বললেন, হে আল্লাহর নবী! আমার মাতা পিতা আপনার জন্য কুরবান হোক, আপনি মাথা উঁচু করবেন না। হয়ত শত্রুদের নিক্ষিপ্ত তীর এসে আপনার গায়ে লাগতে পারে। আমার বক্ষ আপনাকে রক্ষার জন্য ঢাল স্বরূপ। আনাস (রাঃ) বলেন, ঐদিন আমি আবূ বাকর (রাঃ)-এর কন্যা ‘আয়িশাহ (রাঃ)-কে এবং (আমার মাতা) উম্মে সুলায়মকে দেখতে পেলাম যে, তাঁরা পরনের কাপড় এতটুকু পরিমাণ উঠিয়েছেন যে, তাঁদের পায়ের খাঁড়ু আমি দেখতে পাচ্ছিলাম। তাঁরা পানির মশক ভরে নিজেদের পিঠে বহন করে এনে আহতদের মুখে পানি ঢেলে দিচ্ছিলেন। পুনরায় ফিরে গিয়ে পানি ভরে নিয়ে আহতদেরকে পান করাচ্ছিলেন। ঐ সময় আবূ ত্বলহা (রাঃ)-এর হাত হতে (তন্দ্রাচ্ছন্ন হয়ে) তাঁর তরবারিটি দু’বার অথবা তিনবার পড়ে গিয়েছিল। (২৮৮০, মুসলিম ৩২/৪৭, হাঃ নং ১৮১১)(আধুনিক প্রকাশনীঃ ৩৫২৯, ইসলামিক ফাউন্ডেশনঃ ৩৫৩৬)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 3812,
			"arabicnumber": 3812,
			"text": "সা‘দ ইবনু আবূ ওয়াক্কাস (রাঃ) হতে বর্ণিত, তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে আবদুল্লাহ ইবনু সালাম (রাঃ) ছাড়া যমীনে বিচরণশীল কারো ব্যাপারে এ কথাটি বলতে শুনিনি যে, ‘নিশ্চয়ই তিনি জান্নাতবাসী’। সা‘দ (রাঃ) বলেন, তাঁরই ব্যাপারে সূরাহ আহকাফের এ আয়াত নাযিল হয়েছেঃ ‘‘এ ব্যাপারে বনী ইসরাঈলের মধ্য থেকেও একজন সাক্ষ্য দান করেছে। (উক্ত হাদীসের শুরুতে উল্লেখিত সানাদে ইমাম বুখারীর উস্তাজ) ‘আবদুল্লাহ বিন ইউসুফ (সন্দেহ পোষণ করে) বলেন যে, বর্ণনাকারী মালিক উল্লেখিত আয়াতটি নিজের তরফ হতে এখানে বৃদ্ধি করে বলেছেন নাকি এ হাদীসের সানাদের সাথেই সম্পৃক্ত তা জানি না। (মুসলিম ৪৪/৩৩, হাঃ নং ২৪৮৩) (আধুনিক প্রকাশনীঃ ৩৫৩০, ইসলামিক ফাউন্ডেশনঃ ৩৫৩৭)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 3813,
			"arabicnumber": 3813,
			"text": "কায়স ইবনু ‘উবাদ (রহ.) হতে বর্ণিত, তিনি বলেন, আমি মদিনার মসজিদে উপবিষ্ট ছিলাম। তখন এমন এক ব্যক্তি মসজিদে প্রবেশ করলেন যার চেহারায় বিনয় ও নম্রতার ছাপ ছিল। লোকজন বলতে লাগলেন, এই ব্যক্তি জান্নাতীগণের একজন। তিনি হালকাভাবে দু’রাকআত সালাত আদায় করে মাসজিদ হতে বেরিয়ে এলেন। আমি তাঁকে অনুসরণ করলাম এবং তাঁকে বললাম, আপনি যখন মসজিদে প্রবেশ করছিলেন তখন লোকজন বলাবলি করছিল যে, ইনি জান্নাতবাসীগণের একজন। তিনি বললেন, আল্লাহর কসম কারো জন্য এমন কথা বলা উচিত নয়, যা সে জানে না। আমি তোমাকে আসল কথা বলছি কেন তা বলা হয়। আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর যামানায় একটি স্বপ্ন দেখে তাঁর নিকট বর্ণনা করলাম। আমি দেখলাম যে, আমি যেন একটি বাগানে অবস্থান করছি; বাগানটি বেশ প্রশস্ত, সবুজ। বাগানের মধ্যে একটি লোহার স্তম্ভ যার নিম্নভাগ মাটিতে এবং উপরিভাগ আকাশ স্পর্শ করেছে; স্তম্ভের উপরে একটি শক্ত কড়া সংযুক্ত রয়েছে। আমাকে বলা হল, উপরে উঠ। আমি বললাম, এটাতো আমার সামর্থ্যের বাইরে। তখন একজন খাদিম এসে পিছন দিক হতে আমার কাপড় সহ চেপে ধরে আমাকে উঠতে সাহায্য করলেন। আমি উঠতে লাগলাম এবং উপরে গিয়ে আংটাটি ধরলাম। তখন আমাকে বলা হল, শক্তভাবে আংটাটি ধর। তারপর কড়াটি আমার হাতের মুঠায় ধরা অবস্থায় আমি জেগে গেলাম। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট স্বপ্নটি বললে, তিনি বললেন, এ বাগান হল ইসলাম, আর স্তম্ভটি হল ইসলামের খুঁটিসমূহ কড়াটি হল ‘‘উরুয়াতুল উস্কা’’ (শক্ত ও অটুট কড়া) এবং তুুমি আজীবন ইসলামের উপর কায়েম থাকবে। (রাবী বলেন) এই ব্যক্তি হলেন, ‘আবদুল্লাহ ইবনু সালাম (রাঃ)। খালীফাহ (রহ.) مِنْصَفٌ এর স্থলে وَصِيْفٌ বলেছেন। (৭০১০, ৭০১৪, মুসলিম ৪৪/৩৩, হাঃ নং ২৪৮৪) (আধুনিক প্রকাশনীঃ ৩৫৩১, ইসলামিক ফাউন্ডেশনঃ ৩৫৩৮)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 3814,
			"arabicnumber": 3814,
			"text": "আবূ বুরদাহ (রহ.) বলেন, আমি মদিনা্য় গেলাম; আবদুল্লাহ ইবনু সালামের সাথে আমার দেখা হল। তিনি আমাকে বললেন, তুমি আমাদের এখানে আসবে না? তোমাকে আমি খেজুর ও ছাতু খেতে দেব এবং একটি ঘরে থাকতে দেব। অতঃপর তিনি বললেন, তুমি এমন স্থানে (ইরাকে) বসবাস কর, যেখানে সুদের কারবার খুব ব্যাপক। যখন কোন মানুষের নিকট তোমার কোন প্রাপ্য থাকে আর সেই মানুষটি যদি তোমাকে কিছু ঘাস, খড় অথবা খড়ের ন্যায় সামান্য কিছুও হাদীয়া পেশ করে তার কাছ থেকে তা গ্রহণ করো না, যেহেতু তা সুদের অন্তর্ভুক্ত। নায্র (রাঃ), আবূ দাউদ (রহ.) ও ওয়াহাব (রহ.) শু‘বাহ্ (রহ.) হতে الْبَيْتَ শব্দটি বর্ণনা করেননি। (৭৩৪২) (আধুনিক প্রকাশনীঃ ৩৫৩২, ইসলামিক ফাউন্ডেশনঃ ৩৫৩৯)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 3815,
			"arabicnumber": 3815,
			"text": "‘‘আলী (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, মারিয়াম (আঃ) ছিলেন (পূর্বের) নারীদের মধ্যে শ্রেষ্ঠতমা নারী। আর খাদীজাহ (রাঃ) (এ উম্মাতের) নারীদের মধ্যে সর্বশ্রেষ্ঠা। (৩৪৩২) (আধুনিক প্রকাশনীঃ ৩৫৩৩, ইসলামিক ফাউন্ডেশনঃ ৩৫৪০)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 3816,
			"arabicnumber": 3816,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত, তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কোন স্ত্রীর প্রতি এতটুকু ঈর্ষা করিনি যতটুকু খাদীজাহ (রাঃ)-এর প্রতি করেছি। কেননা, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে তাঁর কথা বারবার আলোচনা করতে শুনেছি, অথচ আমাকে বিবাহ করার আগেই তিনি ইন্তিকাল করেছিলেন। খাদীজাহ (রাঃ)-কে জান্নাতে মণি-মুক্তা খচিত একটি প্রাসাদের খোশ খবর দেয়ার জন্য আল্লাহ তা‘আলা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে আদেশ করেন। কোন দিন বকরী যবহ হলে খাদীজাহ (রাঃ)-এর বান্ধবীদের নিকট তাদের প্রত্যেকের দরকার মত গোশ্ত নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উপঢৌকন হিসেবে পাঠিয়ে দিতেন। (৩৮১৭, ৩৮১৮, ৫২২৯, ৬০০৪, ৭৪৮৪, মুসলিম ৪৪/১২, হাঃ নং ২৪৩৫, আহমাদ ২৫৭১৬) (আধুনিক প্রকাশনীঃ ৩৫৩৪, ইসলামিক ফাউন্ডেশনঃ ৩৫৪১)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 3817,
			"arabicnumber": 3817,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত, তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর অন্য কোন স্ত্রীর ব্যাপারে এত ঈর্ষা পোষণ করিনি, যতটুকু খাদীজাহ (রাঃ)-এর প্রতি করেছি। যেহেতু নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর আলোচনা বেশি করতেন। তিনি (আরো) বলেন, খাদীজাহ (রাঃ)-এর (ইন্তিকালের) তিন বছর পর তিনি আমাকে বিবাহ করেন। আল্লাহ নিজে অথবা জিব্রাঈল (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে আদেশ করলেন যে, খাদীজাহ (রাঃ)-কে জান্নাতে মণিমুক্তা খচিত একটি ভবনের খোশ খবর দিন। (৩৮১৬) (আধুনিক প্রকাশনীঃ ৩৫৩৫, ইসলামিক ফাউন্ডেশনঃ ৩৫৪২)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 3818,
			"arabicnumber": 3818,
			"text": "‘আয়িশাহ্ (রাঃ) হতে বর্ণিত, তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর অন্য কোন স্ত্রীর প্রতি এতটুকু ঈর্ষা করিনি যতটুকু খাদীজাহ (রাঃ)-এর প্রতি করেছি। অথচ আমি তাঁকে দেখিনি। কিন্তু নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর কথা বেশি সময় আলোচনা করতেন। কোন কোন সময় বকরী যবহ করে গোশ্তের পরিমাণ বিবেচনায় হাড়-গোশ্তকে ছোট ছোট টুকরা করে হলেও খাদীজাহ (রাঃ)-এর বান্ধবীদের ঘরে পৌঁছে দিতেন। আমি কোন সময় ঈর্ষা ভরে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতাম, মনে হয়, খাদীজাহ (রাঃ) ছাড়া দুনিয়াতে যেন আর কোন নারী নাই। উত্তরে তিনি সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলতেন, হাঁ। তিনি এমন ছিলেন, এমন ছিলেন, তাঁর গর্ভে আমার সন্তানাদি জন্মেছিল। (৩৮১৬, মুসলিম ৪৪/১২, হাঃ নং ২৪৩৩) ) (আধুনিক প্রকাশনীঃ ৩৫৩৬, ইসলামিক ফাউন্ডেশনঃ ৩৫৪৩)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 3819,
			"arabicnumber": 3819,
			"text": "ইসমাঈল (রহ.) হতে বর্ণিত, তিনি বলেন, আমি ‘আবদুল্লাহ ইবনু আবূ আউফা (রাঃ)-কে জিজ্ঞেস করলাম, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খাদীজাহ (রাঃ)-কে জান্নাতের খোশ খবর দিয়েছিলেন কি? তিনি বললেন, হাঁ। এমন একটি ভবনের খোশ খবর দিয়েছিলেন, যে ভবনটি তৈরি করা হয়েছে এমন মোতি দ্বারা যার ভিতরদেশ ফাঁকা। আর সেখানে থাকবে না শোরগোল, কোন প্রকার ক্লেশ ও দুঃখ। (১৭৯২) (আধুনিক প্রকাশনীঃ ৩৫৩৭, ইসলামিক ফাউন্ডেশনঃ ৩৫৪৪)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 3820,
			"arabicnumber": 3820,
			"text": "",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 3821,
			"arabicnumber": 3821,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত, তিনি বলেন যে, জিব্রাঈল (আঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট হাযির হয়ে বললেন, হে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম! ঐ যে খাদীজাহ (রাঃ) একটি পাত্র হাতে নিয়ে আসছেন। ঐ পাত্রে তরকারী, অথবা খাদ্যদ্রব্য অথবা পানীয় ছিল। যখন তিনি পৌঁছে যাবেন তখন তাঁকে তাঁর প্রতিপালকের পক্ষ হতে এবং আমার পক্ষ থেকেও সালাম জানাবেন আর তাঁকে জান্নাতের এমন একটি ভবনের খোশ খবর দিবেন যার অভ্যন্তর ভাগ ফাঁকা-মোতি দ্বারা তৈরি করা হয়েছে। সেখানে থাকবে না কোন প্রকার শোরগোল; কোন প্রকার দুঃখ-ক্লেশ। (৭৪৯৭, মুসলিম ৪৪/১২, হাঃ নং ২৪৩২) (আধুনিক প্রকাশনীঃ ৩৫৩৮, ইসলামিক ফাউন্ডেশনঃ ৩৫৪৫ প্রথমাংশ)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 3822,
			"arabicnumber": 3822,
			"text": "জারীর ইবনু ‘আবদুল্লাহ (রাঃ) হতে বর্ণিত, তিনি বলেন, আমি ইসলাম গ্রহণ করার পর রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর গৃহে প্রবেশ করতে কোনদিন আমাকে বাধা প্রদান করেননি এবং যখনই আমাকে দেখেছেন, মুচকি হাসি দিয়েছেন। (৩০৩৫) (আধুনিক প্রকাশনীঃ ৩৫৪০ প্রথমাংশ, ইসলামিক ফাউন্ডেশনঃ ৩৫৪৬ প্রথমাংশ)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 3823,
			"arabicnumber": 3823,
			"text": "জারীর (রাঃ) আরো বলেন, জাহিলী যুগে যুল-খালাসা নামে একটি ঘর ছিল। যাকে কা‘বায়ে ইয়ামানী ও কা‘বায়ে শামী বলা হত। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে বললেন, তুমি কি যুল-খালাসার ব্যাপারে আমাকে শান্তি দিতে পার? জারীর (রাঃ) বলেন, আমি আহমাস গোত্রের একশ পঞ্চাশ জন ঘোড়-সওয়ার সৈন্য নিয়ে যাত্রা করলাম এবং (প্রতীমা ঘরটি) বিধ্বস্ত করে দিলাম। সেখানে যাদেরকে পেলাম হত্যা করলাম। এসে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে খবর জানালাম। তিনি আমাদের জন্য এবং আহমাস গোত্রের জন্য দু‘আ করলেন। (৩০২০) (আধুনিক প্রকাশনীঃ ৩৫৪০ শেষাংশ, ইসলামিক ফাউন্ডেশনঃ ৩৫৪৬ শেষাংশ)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 3824,
			"arabicnumber": 3824,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত, তিনি বলেন, ওহুদ যুদ্ধে মুশরিকগণ যখন শোচনীয়ভাবে পরাজিত হয়ে পড়লো, তখন ইব্লীস চীৎকার করে (মুসলিমগণকে) বলল, হে আল্লাহর বান্দাগণ! পিছনের দিকে লক্ষ্য কর। তখন অগ্রগামী দল পিছন দিকে ফিরে (শত্রুদল মনে করে) নিজদলের উপর আক্রমণ করে বসল এবং একে অন্যকে হত্যা করতে লাগল। এমন সময় হুযাইফাহ (রাঃ) পিছনের দলে তাঁর পিতাকে দেখতে পেয়ে চীৎকার করে বলতে লাগলেন, হে আল্লাহর বান্দাগণ! এই যে আমার পিতা, এই যে আমার পিতা। ‘আয়িশাহ (রাঃ) বলেন, আল্লাহর শপথ, কিন্তু তারা কেউই বিরত হয়নি। অবশেষে তাঁকে হত্যা করে ফেলল। হুযাইফাহ (রাঃ) বললেন, আল্লাহ্ তোমাদেরকে ক্ষমা করে দিন। (অধস্তন রাবী হিশাম বলেন,) আমার পিতা উরওয়াহ (রহ.) বলেন, আল্লাহর কসম, এ কথার কারণে হুযাইফাহ (রাঃ)-এর মধ্যে তাঁর জীবনের শেষ সময় পর্যন্ত কল্যাণের চিহ্ন বিদ্যমান ছিল। (৩২৯০) (আধুনিক প্রকাশনীঃ ৩৫৪১, ইসলামিক ফাউন্ডেশনঃ ৩৫৪৭)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 3825,
			"arabicnumber": 3825,
			"text": "‘আয়িশাহ (রাঃ) বলেন, উতবাহর মেয়ে হিন্দ (রাঃ) এসে বলল, হে আল্লাহর রাসূল! এক সময় আমার মনের অবস্থা পৃথিবীর বুকে কোন পরিবারের লাঞ্ছিত হতে দেখা আমার নিকট আপনার পরিবারের অপমানিত দেখার চেয়ে অধিক কাঙ্ক্ষিত ছিল না। কিন্তু এখন আমার অবস্থা এমন হয়েছে যে দুনিয়ার বুকে কোন পরিবারের সম্মানিত হতে দেখা আমার নিকট আপনার পরিবারের সম্মানিত দেখার চেয়ে বেশি প্রিয় নয়। তিনি বললেন, সেই সত্তার কসম, যাঁর হাতে আমার প্রাণ। তারপর সে বলল, হে আল্লাহর রাসূল! আবূ সুফইয়ান (রাঃ) একজন কৃপণ ব্যক্তি। যদি তার মাল আমি ছেলে-মেয়েদের জন্য ব্যয় করি তবে তাতে কি আমার কিছু হবে? তিনি বললেন, না, যদি যথাযথ ব্যয় করা হয়। (২২১১, মুসলিম ৩০/৪, হাঃ নং ১৭১৪, আহমাদ ২৪১৭২) (আধুনিক প্রকাশনীঃ ৩৫৪২, ইসলামিক ফাউন্ডেশনঃ ২১৩৩ পরিচ্ছেদ)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 3826,
			"arabicnumber": 3826,
			"text": "‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) হতে বর্ণিত যে, ওয়াহী নাযিল হওয়ার পূর্বে একবার নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মক্কার নিম্ন অঞ্চলের বালদাহ নামক জায়গায় যায়দ ইবনু ‘আমর ইবনু নুফায়লের সাথে সাক্ষাৎ করলেন। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সামনে খাদ্য পূর্ণ একটি ‘খানচা’ পেশ করা হল। তিনি তা হতে কিছু খেতে অস্বীকার করলেন। এরপর যায়দ (রাঃ) বললেন, আমিও ঐ সব জন্তুর গোশ্ত খাই না যা তোমরা তোমাদের দেব-দেবীর নামে যবাহ কর। আল্লাহর নামে যবহকৃত ছাড়া অন্যের নামে যবহ করা জন্তুর গোশ্ত আমি কিছুতেই খাই না। যায়দ ইবনু ‘আমর কুরাইশের যবহকৃত জন্তু সম্পর্কে তাদের উপর দোষারোপ করতেন এবং বলতেন; বকরীকে সৃষ্টি করলেন আল্লাহ্, তাকে বাঁচিয়ে রাখার জন্য আকাশ হতে বারি বর্ষণ করলেন। ভূমি হতে উৎপন্ন করলেন তৃণ-লতা অথচ তোমরা আল্লাহ্ তা‘আলার সমূহদান অস্বীকার করে প্রতিমার প্রতি সম্মান করে আল্লাহর নাম ছাড়া অন্যের নামে যবহ করছ। (৫৪৯৯) (আধুনিক প্রকাশনীঃ ৩৫৪৩ প্রথমাংশ, ইসলামিক ফাউন্ডেশনঃ ৩৫৪৮ প্রথমাংশ)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 3827,
			"arabicnumber": 3827,
			"text": "",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 3828,
			"arabicnumber": 3828,
			"text": "",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 3829,
			"arabicnumber": 3829,
			"text": "জাবির ইবনু ‘আবদুল্লাহ (রাঃ) হতে বর্ণিত, তিনি বলেন, যখন কা’বা গৃহ পুনর্নির্মাণ করা হচ্ছিল তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও ‘আব্বাস (রাঃ) পাথর বয়ে আনছিলেন। ‘আব্বাস (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বললেন, তোমার লুঙ্গিটি কাঁধের উপর রাখ, পাথরের ঘর্ষণ হতে তোমাকে রক্ষা করবে। (লুঙ্গি খুলতেই) তিনি অজ্ঞান হয়ে মাটিতে পড়ে গেলেন। তাঁর চোখ দু’টি আকাশের দিকে নিবিষ্ট ছিল। তাঁর চেতনা ফিরে এল, তখন তিনি বলতে লাগলেন, আমার লুঙ্গি, আমার লুঙ্গি। তৎক্ষণাৎ তাঁর লুঙ্গি পরিয়ে দেয়া হল। (৩৬৪) (আধুনিক প্রকাশনীঃ ৩৫৪৪, ইসলামিক ফাউন্ডেশনঃ ৩৫৪৯)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 3830,
			"arabicnumber": 3830,
			"text": "‘আমর ইবনু দ্বীনার ও ‘উবায়দুল্লাহ ইবনু আবূ ইয়াযীদ (রহ.) হতে বর্ণিত, তারা বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর যুগে কা‘বা ঘরের চারিপাশে কোন প্রাচীর ছিল না। লোকজন কা‘বা ঘরকে কেন্দ্র করে তার চারপাশে সালাত আদায় করত। ‘উমার (রাঃ) কা‘বার চতুষ্পার্শ্বে প্রাচীর নির্মাণ করেন। ‘উবায়দুল্লাহ (রহ.) বলেন, এ প্রাচীর ছিল নীচু, অতঃপর ‘আবদুল্লাহ ইবনু যুবায়র (রাঃ) তা নির্মাণ করেন। (আধুনিক প্রকাশনীঃ ৩৫৪৫, ইসলামিক ফাউন্ডেশনঃ ৩৫৫০)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 3831,
			"arabicnumber": 3831,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, জাহিলি যুগে আশুরার দিন কুরাইশগণ ও নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সাওম পালন করতেন। যখন হিজরাত করে মদিনা্য় আগমন করলেন, তখন তিনি নিজেও আশুরার সাওম পালন করতেন এবং অন্যকেও তা পালনের নির্দেশ দিতেন। যখন রমাযানের সাওম ফরয করা হল তখন যার ইচ্ছা (আশুরা) সওম করতেন আর যার ইচ্ছা করতেন না। (১৫৯২) (আধুনিক প্রকাশনীঃ ৩৫৪৬, ইসলামিক ফাউন্ডেশনঃ ৩৫৫১)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 3832,
			"arabicnumber": 3832,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত, তিনি বলেন, হাজ্জের মাসগুলোতে ‘উমরাহ পালন করাকে কুরাইশগণ পাপ কাজ বলে মনে করত। তারা মুহাররম মাসের নামকে পরিবর্তন করে সফর মাস নাম দিত এবং বলত, (উটের) যখম যখন শুকিয়ে যাবে এবং পায়ের চিহ্ন মুছে যাবে তখন ‘উমরাহ পালন করা হালাল হবে যারা তা পালন করতে চায়। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও তাঁর সঙ্গী সাথীগণ যিলহাজ্জ মাসের চার তারিখে হাজ্জের তালবিয়াহ পড়তে পড়তে মক্কা্য় হাযির হলেন। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর সঙ্গী-সাথীদেরকে বললেন, তোমরা ‘উমরাহ্য় পরিণত করে নেও। সাহাবীগণ জিজ্ঞেস করলেন, হে আল্লাহর রাসূল! আমাদের জন্য কোন্ কোন্ বিষয় হালাল হবে? তিনি বললেন, সকল বিষয় হালাল হয়ে যাবে। (১০৮৫) (আধুনিক প্রকাশনীঃ ৩৫৪৭, ইসলামিক ফাউন্ডেশনঃ ৩৫৫২)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 3833,
			"arabicnumber": 3833,
			"text": "সা‘ঈদ ইবনু মুসাইয়্যাব (রহ.) তাঁর পিতার মাধ্যমে দাদা হতে বর্ণনা করেন যে, জাহিলীয়্যাতের যুগে একটি বন্যা হয়েছিল। যাতে মক্কা্য় দু’টি পাহাড়ের মধ্যস্থল সম্পূর্ণ প্লাবিত হয়েছিল। সুফ্ইয়ান (রহ.) বলেন, ‘আমর ইবনু দ্বীনার বলতেন, এ হাদীসটির একটি দীর্ঘ পটভূমি আছে। (আধুনিক প্রকাশনীঃ ৩৫৪৮, ইসলামিক ফাউন্ডেশনঃ ৩৫৫৩)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 3834,
			"arabicnumber": 3834,
			"text": "কাইস ইবনু আবূ হাযিম (রাঃ) হতে বর্ণিত, তিনি বলেন, একদিন আবূ বাকর (রাঃ) আহমাস গোত্রের যায়নাব নামের এক নারীর নিকট গেলেন। তিনি গিয়ে দেখতে পেলেন, নারীটি কথাবার্তা বলছে না। তিনি (লোকজনকে) জিজ্ঞেস করলেন, নারীটির এ অবস্থা কেন, কথাবার্তা বলছে না কেন? তারা তাঁকে জানালেন, এ নারী নীরব থেকে থেকে হাজ্জ পালন করে আসছেন। আবূ বাকর (রাঃ) তাঁকে বললেন, কথা বল, কেননা এটা হালাল নয়। এটা জাহিলীয়্যাত যুগের কাজ। তখন নারীটি কথাবার্তা বলল। জিজ্ঞেস করল, আপনি কে? আবূ বাকর (রাঃ) উত্তরে বললেন, আমি একজন মুহাজির লোক। মহিলাটি জিজ্ঞেস করল, আপনি কোন গোত্রের মুহাজির? আবূ বাকর (রাঃ) বললেন, কুরাইশ গোত্রের। মহিলাটি জিজ্ঞেস করলেন, কোন কুরাইশের কোন শাখার আপনি? আবূ বাকর (রাঃ) বললেন, তুমি তো অত্যধিক উত্তম প্রশ্নকারিণী। আমি আবূ বকর। তখন মহিলাটি তাঁকে জিজ্ঞেস করল, জাহিলীয়্যা যুগের পর যে উত্তম দ্বীন ও কল্যাণময় জীবন বিধান আল্লাহ আমাদেরকে দান করেছেন সে দ্বীনের উপর আমরা কতদিন সঠিকভাবে টিকে থাকতে পারব? আবূ বাকর (রাঃ) বললেন, যতদিন তোমাদের ইমামগণ তোমাদেরকে নিয়ে দ্বীনের উপর অটল থাকবেন। মহিলা জিজ্ঞেস করল, ইমামগণ কারা? আবূ বাকর (রাঃ) বললেন, তোমাদের গোত্রে ও সমাজে এমন সম্ভ্রান্ত ও নেতৃস্থানীয় লোক কি দেখনি যারা নির্দেশ দিলে সকলেই তা মেনে চলে। নারীটি উত্তর দিল, হাঁ। আবূ বাকর (রাঃ) বললেন, এরাই হলেন জনগণের ইমাম। (আধুনিক প্রকাশনীঃ ৩৫৪৯, ইসলামিক ফাউন্ডেশনঃ ৩৫৫৪)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 3835,
			"arabicnumber": 3835,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত, তিনি বলেন, আরবের কোন এক গোত্রের এক (মুক্তিপ্রাপ্ত) কৃষ্ণকায় মহিলা ইসলাম গ্রহণ করেন। মসজিদের পাশে ছিল তার একটি ছোট ঘর। ‘আয়িশাহ (রাঃ) বলেন, সে আমাদের নিকট আসত এবং আমাদের সাথে কথাবার্তা বলত। যখন তার বাক্যালাপ শেষ হত তখন প্রায়ই বলতো, ইয়াওমূল বিশাহ (মণিমুক্তা খচিত হারের দিন) আমাদের রবের পক্ষ হতে আশ্চর্যজনক ঘটনাবলীর একটি দিন জেনে রাখুন! আমার রব আমাকে কুফর এর দেশ হতে মুক্তি দিয়েছেন। সে এ কথাটি প্রায়ই বলত। একদিন ‘আয়িশাহ (রাঃ) ঐ মহিলাকে জিজ্ঞেস করলেন, ‘ইয়ামুল বিশাহ’ কী? তখন সে বলল যে, আমার মুনিবের পরিবারের এক শিশু কন্যা ঘর হতে বের হল। তার গলায় চামড়ার (উপর মণিমুক্তা খচিত) একটি হার ছিল। হারটি (ছিড়ে) গলা হতে পড়ে গেল। তখন একটি চিল ওটা গোশ্তের টুকরা মনে করে ছোঁ মেরে নিয়ে গেল। তারা আমাকে হার চুরির সন্দেহে শাস্তি ও নির্যাতন করতে লাগল। অবশেষে তারা আমার লজ্জাস্থানে তল্লাশী চালাল। যখন তারা আমার চারপাশে ছিল এবং আমি চরম দুঃখে ছিলাম এমন সময় একটি চিল কোত্থেকে উড়ে আসল এবং আমাদের মাথার উপরে এসে হারটি ফেলে দিল। তারা হারটি তুলে নিল। তখন আমি বললাম, এটা হল সেই হার যেটা চুরির জন্য আমার উপর অপবাদ দিয়েছ, অথচ এ ব্যাপারে আমি সম্পূর্ণ নির্দোষ। (৪৩৯) (আধুনিক প্রকাশনীঃ ৩৫৫০, ইসলামিক ফাউন্ডেশনঃ ৩৫৫৫)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 3836,
			"arabicnumber": 3836,
			"text": "ইবনু ‘উমর (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত, তিনি বলেন, সাবধান! যদি তোমাদের কসম করতে হয় তাহলে আল্লাহ্ ছাড়া অন্য কারো নামে কসম কারো না। লোকজন তাদের বাপ-দাদার নামে কসম করত। তিনি বললেন, সাবধান! বাপ-দাদার নামে কসম করো না। (২৬৭৯) (আধুনিক প্রকাশনীঃ ৩৫৫১, ইসলামিক ফাউন্ডেশনঃ ৩৫৫৬)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 3837,
			"arabicnumber": 3837,
			"text": "‘আমর (রাঃ) হতে বর্ণিত যে, ‘আবদুর রাহমান ইবনু কাসিম (রাঃ) তার কাছে বলেছেন যে, কাসিম জানাযা বহন করার সময় আগে আগে চলতেন। জানাযা দেখলে তিনি দাঁড়াতেন না* এবং তিনি বর্ণনা করেছেন যে, ‘আয়িশাহ (রাঃ) বলতেন, জাহিলী যুগে মুশরিকগণ জানাযা দেখলে দাঁড়াত এবং মৃত ব্যক্তির রূহকে লক্ষ্য করে বলত, তুমি তোমার আপন জনদের সাথেই আছ যেমন তোমার জীবদ্দশায় ছিলে। এ কথাটি তারা দু’বার বলত। (আধুনিক প্রকাশনীঃ ৩৫৫২, ইসলামিক ফাউন্ডেশনঃ ৩৫৫৭)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 3838,
			"arabicnumber": 3838,
			"text": "‘আমর ইবনু মায়মূন (রহ.) হতে বর্ণিত, তিনি বলেন, ‘উমার ইবনুল খাত্তাব (রাঃ) বলেন, মুশরিকগণ সাবীর পাহাড়ের উপর সূর্যের কিরণ না পড়া পর্যন্ত মুয্দালাফা হতে রওয়ানা হত না। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সূর্য উঠার আগে রাওয়ানা হয়ে তাদের প্রথার খেলাফ করেন। (১৬৮৪) (আধুনিক প্রকাশনীঃ ৩৫৫৩, ইসলামিক ফাউন্ডেশনঃ ৩৫৫৮)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 3839,
			"arabicnumber": 3839,
			"text": "ইকরিমাহ (রহ.) বলেন, আল্লাহর বাণীঃ كَأْسًا دِهَاقًا (আন-নাবাঃ ৩৪) এর তাফসীর প্রসঙ্গে বলেন, একের পর এক শরাবে পূর্ণ পেয়ালা। (আধুনিক প্রকাশনীঃ ৩৫৫৪ প্রথমাংশ, ইসলামিক ফাউন্ডেশনঃ ৩৫৫৯ প্রথমাংশ)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 3840,
			"arabicnumber": 3840,
			"text": "ইবনু ‘আব্বাস (রাঃ) বলেন, আমার পিতা ‘আব্বাস (রাঃ)-কে ইসলামের পূর্ব যুগে বলতে শুনেছি, আমাদেরকে পাত্র ভর্তি শরাব একের পর এক পান করাও। (আধুনিক প্রকাশনীঃ ৩৫৫৪, ইসলামিক ফাউন্ডেশনঃ ৩৫৫৯ শেষাংশ)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 3841,
			"arabicnumber": 3841,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, সবচেয়ে সঠিক বাক্য যা কোন কবি বলেছেন তা হল লাবীদ এর এ পংক্তিটি- সাবধান, আল্লাহ্ ছাড়া সব জিনিসই বাতিল ও অসার। এবং কবি উমাইয়্যা ইবনু আবূ সাল্ত ইসলাম গ্রহণের কাছাকাছি পৌঁছে গিয়েছিল। (৬১৪৭, ৬৪৮৯) (আধুনিক প্রকাশনীঃ ৩৫৫৫, ইসলামিক ফাউন্ডেশনঃ ৩৫৬০)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 3842,
			"arabicnumber": 3842,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত, তিনি বলেন, আবূ বাকর (রাঃ)-এর একজন ক্রীতদাস ছিল। সে প্রতিদিন তার উপর ধার্য কর আদায় করত। আর আবূ বাকর (রাঃ) তার দেওয়া কর হতে আহার করতেন। একদিন সে কিছু খাবার জিনিস এনে দিল। তা হতে তিনি আহার করলেন। তারপর গোলাম বলল, আপনি জানেন কি ওটা কিভাবে উপার্জিত করা হয়েছে যা আপনি খেয়েছেন? তিনি বললেন, বলত কিভাবে? গোলাম উত্তরে বলল, আমি জাহিলী যুগে এক ব্যক্তির ভবিষ্যৎ গণনা করে দিয়েছিলাম। কিন্তু ভবিষ্যৎ গণনা করা আমার ভালভাবে জানা ছিল না। তথাপি প্রতারণা করে তা করেছিলাম। আমার সাথে তার দেখা হলে গণনার বিনিময়ে এ দব্যাদি সে আমাকে হাদীয়া দিল যা হতে আপনি আহার করলেন। আবূ বাকর (রাঃ) এটা শুনামাত্র মুখের ভিতর হাত ঢুকিয়ে দিলেন এবং পেটের ভিতর যা কিছু ছিল সবই বমি করে দিলেন। (আধুনিক প্রকাশনীঃ ৩৫৫৬, ইসলামিক ফাউন্ডেশনঃ ৩৫৬১)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 3843,
			"arabicnumber": 3843,
			"text": "ইবনু ‘উমর (রাঃ) হতে বর্ণিত, তিনি বলেন, ইসলামের পূর্ব যুগে মানুষ ‘হাবালুল হাবালা’ রূপে উটের গোশ্ত ক্রয়-বিক্রয় করত। রাবী বলেন, হাবালুল হাবালার অর্থ হল- তারা উট কেনা বেচা করত এই শর্তে যে, কোন নির্দিষ্ট গর্ভবতী উটনী বাচ্চা প্রসব করলে পর ঐ প্রসব করা বাচ্চা যখন গর্ভবতী হবে তখন উটের দাম পরিশোধ করা হবে। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদেরকে এরূপ কেনা বেচা করতে নিষেধ করে দিলেন। (২১৪৩) (আধুনিক প্রকাশনীঃ ৩৫৫৭, ইসলামিক ফাউন্ডেশনঃ ৩৫৬২)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 3844,
			"arabicnumber": 3844,
			"text": "গায়লান ইবনু জারীর (রহ.) হতে বর্ণিত, আমরা আনাস ইবনু মালিক (রাঃ)-এর কাছে গেলে তিনি আমাদের কাছে আনসারদের ঘটনা বর্ণনা করতেন। রাবী বলেন, আমাকে লক্ষ্য করে তিনি বলতেন, তোমার জাতি অমুক অমুক দিন অমুক অমুক কাজ করেছে, অমুক অমুক দিন অমুক অমুক কাজ করেছে। (৩৭৭৬) (আধুনিক প্রকাশনীঃ ৩৫৫৮, ইসলামিক ফাউন্ডেশনঃ ৩৫৬৩)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 3845,
			"arabicnumber": 3845,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত, তিনি বলেন, সর্বপ্রথম কাসামাহ হত্যাকারী গোত্রের লোকের (শপথ গ্রহণ) জাহিলী যুগে অনুষ্ঠিত হয় আমাদের হাশেম গোত্রে। কুরাইশের কোন একটি শাখা গোত্রের একজন লোক বনু হাশিমের একজন মানুষকে মজুর হিসাবে নিয়োগ করল। ঐ মজুর তার সাথে উটগুলির নিকট গমন করল। ঘটনাক্রমে বনু হাশিমের অপর এক ব্যক্তি তাদের নিকট দিয়ে যাচ্ছিল। তাদের নিকটবর্তী হওয়ার পর খাদ্যপূর্ণ বস্তার বাঁধন ছিড়ে গেল। তখন সে মজুর ব্যক্তিটিকে বলল, আমাকে একটি রশি দিয়ে সাহায্য কর, যেন আমার বস্তার মুখ বাঁধতে পারি এবং উটটিও যেন পালিয়ে যেতে না পারে। মজুর তাকে একটি রশি দিল। ঐ ব্যক্তি তার বস্তার মুখ বেঁধে নিল। যখন তারা অবতরণ করল তখন একটি ছাড়া সকল উট বেঁধে রাখা হল। মজুর নিয়োগকারী মজুরকে জিজ্ঞেস করল, সকল উট বাঁধা হল কিন্তু এ উটটি বাঁধা হল না কেন? মজুর উত্তরে বলল, এ উটটি বাঁধার কোন রশি নেই। তখন সে বলল, এই উটটির রশি কোথায়? রাবী বলেন, এ কথা শুনে মালিক মজুরকে লাঠি দিয়ে এমনভাবে আঘাত করল যে শেষ পর্যন্ত এ আঘাতেই তার মৃত্যু হল। আহত মজুরটি যখন মুমূর্ষু অবস্থায় মৃত্যুর প্রহর গুণছিল, তখন ইয়ামানের একজন লোক তার নিকট দিয়ে যাচ্ছিল। আহত মজুর তাকে জিজ্ঞেস করল, আপনি কি এবার হাজ্জে যাবেন? সে বলল, না, তবে অনেকবার গিয়েছি। আহত মজুরটি বলল, আপনি কি আমার সংবাদটি আপনার জীবনে যে কোন সময় পৌঁছে দিতে পারেন? ইয়ামানী লোকটি উত্তরে বলল, হাঁ তা পারব। তারপর মজুরটি বলল, আপনি যখন হজ্জ উপলক্ষে মক্কা্য় উপস্থিত হবেন তখন হে কুরাইশের লোকজন বলে ঘোষণা দিবেন। যখন তারা আপনার ডাকে সাড়া দিবে, তখন আপনি বনু হাশিম গোত্রকে ডাক দিবেন, যদি তারা আপনার ডাকে সাড়া দেয়, তবে আপনি তাদেরকে আবূ তালিব সম্পর্কে জিজ্ঞেস করবেন এবং তাকে পেলে জানিয়ে দিবেন যে, অমুক ব্যক্তি একটি রশির কারণে আমাকে হত্যা করেছে। কিছুক্ষণ পর আহত মজুরটির মৃত্যু হল। মজুর নিয়োগকারী যখন মক্কা্য় ফিরে এল তখন আবূ তালিব তার নিকট গিয়ে জিজ্ঞেস করলেন আমাদের ভাইটি কোথায়? তার কী হয়েছে? এখনও ফিরছে না কেন? সে বলল, আপনার ভাই হঠাৎ ভীষণ রোগে আক্রান্ত হয়ে শেষ পর্যন্ত মারা গেছে। আমি যথাসাধ্য সেবা শুশ্রূষা করেছি। মারা যাওয়ার পর আমি তাকে যথারীতি সমাহিত করেছি। আবূ তালিব বললেন, তুমি এরূপ করবে আমরা এ আশাই পোষণ করি। এভাবে কিছুদিন কেটে গেল। তারপর ঐ ইয়ামানী ব্যক্তি যাকে সংবাদ পৌঁছে দেয়ার জন্য মজুর ব্যক্তিটি অসিয়াত করেছিল, হজ্জব্রত পালনে মক্কায় উপস্থিত হল এবং ‘হে কুরাইশগণ’ বলে ডাক দিল। তখন তাকে বলা হল, এই যে, কুরাইশ। সে আবার বলল, হে বনু হাশিম, বলা হল; এই যে, বনু হাশিম। সে জিজ্ঞেস করল, আবূ তালিব কোথায়? লোকজন আবূ তালিবকে দেখিয়ে দিল। তখন ইয়ামানী লোকটি বলল, আপনাদের অমুক ব্যক্তি আপনার নিকট এ সংবাদটি পৌঁছে দেয়ার জন্য আমাকে অসিয়াত করেছিল যে অমুক ব্যক্তি মাত্র একটি রশির কারণে তাকে হত্যা করেছে। এ কথা শুনে আবূ তালিব মজুর নিয়োগকারী ব্যক্তির নিকট গমন করে বলল; (তুমি আমাদের ভাইকে হত্যা করেছ) কাজেই আমাদের তিনটি প্রস্তাবের যে কোন একটি তোমাকে মেনে নিতে হবে। তুমি হয়ত হত্যার বিনিময়ে একশ’ উট দিবে অথবা তোমার গোত্রের বিশ্বাসযোগ্য পঞ্চাশ জন লোক হলফ করে বলবে যে তুমি তাকে হত্যা করনি। যদি তুমি এও করতে অস্বীকার কর তবে আমরা তোমাকে হত্যার বিনিময়ে হত্যা করব। তখন হত্যাকারী ব্যক্তিটি নিজ গোত্রীয় লোকদের নিকট গমন করে ঘটনা বর্ণনা করল। ঘটনা শুনে তারা বলল, আমরা হলফ করে বলব। তখন বনু হাশিম গোত্রের এক মহিলা যার বিবাহ হত্যাকারীর গোত্রে হয়েছিল এবং তার একটি সন্তানও হয়েছিল, আবূ তালিবের নিকট এসে বলল, হে আবূ তালিব, আমি এ আশা নিয়ে এসেছি যে, আপনি পঞ্চাশ জন হলফকারী হতে আমার এ সন্তানটিকে রেহাই দিবেন এবং ঐ স্থানে তার হলফ নিবেন না যে স্থানে হলফ নেয়া হয়। আবূ তালিব তার আবদারটি মনজুর করলেন। তারপর হত্যাকারীর গোত্রের এক পুরুষ আবূ তালিবের নিকট এসে বলল, হে আবূ তালিব, আপনি একশ’ উটের পরিবর্তে পঞ্চাশ জনের হলফ নিতে চাচ্ছেন, এ হিসাব অনুযায়ী প্রতিটি হলফকারীর উপর দু’টি উট পড়ে। আমার দু’টি উট গ্রহণ করুন এবং যেখানে হলফ করার জন্য দাঁড় করানো হয় সেখানে দাঁড় করানো হতে আমাকে অব্যাহতি দেন। অপর আট চল্লিশজন এসে যথাস্থানে হলফ করল। ইবনু ‘আব্বাস (রাঃ) বলেন, আল্লাহর কসম, হলফ করার পর একটি বছর অতিবাহিত হওয়ার পূর্বেই ঐ আটচল্লিশ জনের একজনও বেঁচে ছিল না। (আধুনিক প্রকাশনীঃ ৩৫৫৯, ইসলামিক ফাউন্ডেশনঃ ৩৫৬৪)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 3846,
			"arabicnumber": 3846,
			"text": "",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 3847,
			"arabicnumber": 3847,
			"text": "",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 3848,
			"arabicnumber": 3848,
			"text": "আবুস্ সাফার (রহ.) বলেন, আমি ইবনু ‘আব্বাস (রাঃ)-কে এ কথা বলতে শুনেছি, হে লোকেরা! আমি যা বলছি তা মনোযোগ দিয়ে শোন এবং তোমরা যা বলতে চাও তাও আমাকে শুনাও এবং এমন যেন না হয় যে তোমরা এখান হতে চলে গিয়ে বলবে ইবনু ‘আব্বাস এমন বলেছেন। যে ব্যক্তি বাইতুল্লাহ শরীফের তাওয়াফ করতে ইচ্ছা করে সে যেন হিজর এর বাহির হতে তাওয়াফ করে এবং এ জায়গাকে হাতীম বলবে না কারণ, জাহিলী যুগে কোন লোক এ জায়গাটিতে তার চাবুক, জুতা, তীর ধনু ইত্যাদি নিক্ষেপ করে হলফ করত। (আধুনিক প্রকাশনীঃ ৩৫৬১, ইসলামিক ফাউন্ডেশনঃ ৩৫৬৬)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 3849,
			"arabicnumber": 3849,
			"text": "‘আমর ইবনু মাইমূন (রাঃ) হতে বর্ণিত, তিনি বলেন, আমি জাহিলীয়্যাতের যুগে দেখেছি, একটি বানরী ব্যাভিচার করার কারণে অনেকগুলো বানর একত্র হয়ে প্রস্তর নিক্ষেপে তাকে হত্যা করল। আমিও তাদের সাথে প্রস্তর নিক্ষেপ করলাম। (আধুনিক প্রকাশনীঃ ৩৫৬২, ইসলামিক ফাউন্ডেশনঃ ৩৫৬৭)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 3850,
			"arabicnumber": 3850,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত, তিনি বলেন, জাহিলী যুগের কাজের মধ্যে একটি হলঃ কারো বংশ-কুল নিয়ে খুঁটা দেয়া, কারো মৃত্যুতে বিলাপ করা। তৃতীয়টি (রাবী ‘উবাইদুল্লাহ) ভুলে গেছেন। তবে সুফিয়ান (রহ.) বলেন, তৃতীয় কাজটি হল, তারকার সাহায্যে বৃষ্টি চাওয়া। (আধুনিক প্রকাশনীঃ ৩৫৬৩, ইসলামিক ফাউন্ডেশনঃ ৩৫৬৮)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 3851,
			"arabicnumber": 3851,
			"text": "مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ عَبْدِ المُطَّلِبِ بْنِ هَاشِمِ بْنِ عَبْدِ مَنَافِ بْنِ قُصَيِّ بْنِ كِلَابِ بْنِ مُرَّةَ بْنِ كَعبِ بْنِ لؤَيِّ بْنِ غالِبِ بْنِ فِهْرِ بْنِ مَالِكِ بْنِ النَّضْرِ بْنِ كِنَانَةَ بْنِ خُزَيْمَةَ بْنِ مُدْرِكَةَ بْنِ إِلْيَاسَ بْنِ مُضَرَ بْنِ نِزَارِ بْنِ مَعَدِّ بْنِ عَدْنَانَ মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইবনু ‘আবদুল্লাহ্, ইবনু ‘আবদুল মুত্তালিব ইবনু হাশিম ইবনু আবদ মানাফ ইবনু কুসাঈ ইবনু কিলাব ইবনু মুর্রা ইবনু কা‘ব ইবনু লুআই ইবনু গালিব ইবনু ফিহর ইবনু মালিক ইবনু নাযর ইবনু কিনানাহ ইবনু খুযাইমাহ ইবনু মুদরিকাহ ইবনু ইলিয়াস ইবনু মুযার ইবনু নাযার ইবনু মা‘দ্দ ইবনু ‘আদনান। ৩৮৫১. ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর উপর যখন (ওয়াহী) নাযিল করা হয় তখন তাঁর বয়স ছিল চল্লিশ বছর। অতঃপর তিনি মক্কা্য় তের বছর অবস্থান করেন। অতঃপর তাঁকে হিজরাত করার আদেশ দেয়া হয়। তিনি হিজরাত করে মদিনা্য় চলে গেলেন এবং সেখানে দশ বছর অবস্থান করলেন, তারপর তাঁর মৃত্যু হয় সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম। (৩৯০২, ৩৯০৩, ৪৪৬৫, ৪৯৭৯) (আধুনিক প্রকাশনীঃ ৩৫৬৪, ইসলামিক ফাউন্ডেশনঃ ৩৫৬৯)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 3852,
			"arabicnumber": 3852,
			"text": "খাব্বাব (রাঃ) বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিকট হাযির হলাম। তখন তিনি তাঁর নিজের চাদরকে বালিশ বানিয়ে কা‘বা গৃহের ছায়ায় বিশ্রাম গ্রহণ করছিলেন। আমরা মুশরিকদের পক্ষ হতে কঠিন নির্যাতন ভোগ করছিলাম। তাই আমি বললাম, আপনি কি আল্লাহর কাছে দু‘আ করবেন না? তখন তিনি উঠে বসলেন এবং তাঁর চেহারা লাল হয়ে গেল। তিনি বললেন, তোমাদের পূর্বের ঈমানদারদের মধ্যে কারো কারো শরীরের হাড় পর্যন্ত তামাম গোশত ও শিরা উপশিরাগুলি লোহার চিরুণী দিয়ে আঁচড়ে বের করে ফেলা হত। কিন্তু এসব নির্যাতনও তাদেরকে দ্বীন হতে বিমুখ করতে পারত না। তাঁদের মধ্যে কারো মাথার মাঝখানে করাত রেখে তাকে দ্বিখন্ডিত করে ফেলা হত। কিন্তু এ নির্যাতনও তাঁদেরকে তাঁদের দ্বীন হতে ফিরাতে পারত না। আল্লাহর কসম, আল্লাহ্ তা‘আলা অবশ্যই দ্বীনকে পরিপূর্ণ করবেন, ফলে একজন উষ্ট্রারোহী সান‘আ হতে হাযারা মাউত পর্যন্ত একাই সফর করবে। আল্লাহ্ ছাড়া অন্য কাউকে সে ভয় করবে না। রাবী (রহ.) আরো বেশি বর্ণনা করেন- এবং তার মেষ পালের উপর নেকড়ে বাঘের আক্রমণ ছাড়া অন্য কোন ভয় সে করবে না। (৩৬১২)(আধুনিক প্রকাশনীঃ ৩৫৬৫, ইসলামিক ফাউন্ডেশনঃ ৩৫৭০)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 3853,
			"arabicnumber": 3853,
			"text": "‘আবদুল্লাহ [ইবনু মাসউদ (রাঃ)] হতে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সূরা আন-নাজ্ম তিলাওয়াত করে সিজদা করলেন। তখন এক ব্যক্তি ছাড়া সকলেই সাজ্দাহ করলেন। ঐ ব্যক্তিকে আমি দেখলাম, সে এক মুষ্ঠি কাঁকর তুলে নিয়ে তার উপর সাজ্দাহ করল এবং সে বলল, আমার জন্য এমন সাজ্দাহ করাই যথেষ্ট। [‘আবদুল্লাহ (রাঃ) বলেন] পরবর্তী সময়ে আমি তাকে কাফির অবস্থায় নিহত হতে দেখেছি। (১০৬৭) (আধুনিক প্রকাশনীঃ ৩৫৬৬, ইসলামিক ফাউন্ডেশনঃ ৩৫৭১)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 3854,
			"arabicnumber": 3854,
			"text": "আবদুল্লাহ (ইবনু মাস‘উদ) (রাঃ) হতে বর্ণিত। তিনি বলেন, একবার নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সিজদা করলেন। তাঁর আশেপাশে কয়েকজন কুরাইশ লোক বসেছিল। এমন সময় উক্বা ইবনু আবূ মুয়াইত উটের নাড়িভুঁড়ি নিয়ে উপস্থিত হল এবং নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর পিঠের উপর চাপিয়ে দিল। ফলে তিনি তাঁর মাথা উঠাতে পারলেন না। ফাতিমাহ (রাঃ) এসে তাঁর পিঠের উপর হতে তা হটিয়ে দিলেন এবং যে এ কাজটি করেছে তার জন্য বদ দু’আ করলেন। এরপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, হে আল্লাহ্! পাকড়াও কর কুরাইশ নেতৃবৃন্দকে- আবূ জাহাল ইবনু হিশাম, ‘উৎবা ইবনু রাবি‘য়াহ, শায়বাহ ইবনু রাবি‘য়াহ, উমাইয়াহ ইবনু খালফ অথবা উবাই ইবনু খালাফ। উমাইয়াহ ইবনু খালফ না উবাই ইবনু খালফ এ বিষয়ে শু‘বা রাবী সন্দেহ করেন। (ইবনু মাসউদ (রাঃ) বলেন, আমি এদের সবাইকে বাদ্র যুদ্ধে নিহত অবস্থায় দেখেছি। উমাইয়া অথবা উবাই ছাড়া তাদের সকলকে সে দিন একটি কূপে ফেলা হয়েছিল। তার জোড়গুলি এমনভাবে ছিন্নভিন্ন হয়েছিল যে তাকে কূপে ফেলা যায়নি। (২৪০) (আধুনিক প্রকাশনীঃ ৩৫৬৭, ইসলামিক ফাউন্ডেশনঃ ৩৫৭২)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 3855,
			"arabicnumber": 3855,
			"text": "সা‘ঈদ ইবনু জুবায়র (রহ.) হতে বর্ণিত, তিনি বলেন, ‘আবদুর রাহমান ইবনু আবযা (রাঃ) একদিন আমাকে আদেশ করলেন যে, ‘আবদুল্লাহ ইবনু ‘আব্বাস (রাঃ) কে এ আয়াত দু’টি সম্পর্কে জিজ্ঞেস কর, এর অর্থ কী? আয়াতটি হল এই ‘‘আল্লাহ্ যার হত্যা নিষিদ্ধ করেছেন, যথার্থ কারণ ছাড়া তাকে হত্যা করবে না।’’ (আল-ফুরকানঃ ৬৮) এবং ‘‘যে ব্যক্তি ইচ্ছাকৃতভাবে কোন মু‘মিনকে হত্যা করে।’’ (আন-নিসাঃ ৯৩) আমি ইবনু ‘আব্বাস (রাঃ) কে জিজ্ঞেস করলাম তখন তিনি বললেন, যখন সূরা আল-ফুরকানের আয়াতটি নাযিল করা হল তখন মক্কার মুশ্রিকরা বলল, আমরা তো মানুষকে হত্যা করেছি যা আল্লাহ্ হারাম করেছেন এবং আল্লাহর সাথে অন্যকে মা‘বুদ হিসেবে শরীক করেছি। আরো নানা রকম অশ্লীল কাজ কর্ম করেছি। তখন আল্লাহ্ তা‘আলা নাযিল করলেন, ‘‘কিন্তু যারা তওবা করেছে এবং ঈমান এনেছে.....’’ (আল-ফুরকানঃ ৭০) সুতরাং এ আয়াতটি তাদের জন্য প্রযোজ্য। আর সূরা নিসার যে আয়াতটি রয়েছে তা ঐ ব্যক্তি সম্পর্কে যে ইসলাম ও তার বিধি-বিধানকে জেনে বুঝে কবূল করার পর কাউকে (ইচ্ছাকৃত) হত্যা করেছে। তখন তার শাস্তি জাহান্নাম। তারপর মুজাহিদ (রহ.) কে আমি এ বিষয় জানালাম। তিনি বললেন, তবে যদি কেউ অনুশোচনা করে....। (৪৫৯০, ৪৭৬২, ৪৭৬৩, ৪৭৬৪, ৪৭৬৫, ৪৭৬৬) (আধুনিক প্রকাশনীঃ ৩৫৬৮, ইসলামিক ফাউন্ডেশনঃ ৩৫৭৩)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 3856,
			"arabicnumber": 3856,
			"text": "‘উরওয়াহ ইবনু যুবায়র (রহ.) বলেন, আমি ‘আবদুল্লাহ ইবনু ‘আমর ইবনুল ‘আস (রাঃ) এর নিকটে বললাম, মক্কার মুশ্রিক কর্তৃক নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে সর্বাপেক্ষা কঠোর আচরণের বর্ণনা দিন। তিনি বললেন, একদিন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কা‘বা শরীফের হিজর নামক স্থানে সালাত আদায় করছিলেন। তখন ‘উকবাহ ইবনু আবূ মু‘য়াইত এল এবং তার চাদর দিয়ে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কন্ঠনালি পেচিয়ে শ্বাসরুদ্ধ করে ফেলল। তখন আবূ বাকর (রাঃ) এগিয়ে এসে ‘উকবাহ্কে কাঁধে ধরে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট হতে হটিয়ে দিলেন এবং বললেন, ‘‘তোমরা এমন লোককে হত্যা করতে চাও যিনি বলেন, একমাত্র আল্লাহ্ই আমার রব।’’ (গাফিরঃ ২৮) (৩৬৭৮) (আধুনিক প্রকাশনীঃ ৩৫৬৯, ইসলামিক ফাউন্ডেশনঃ ৩৫৭৪)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 3857,
			"arabicnumber": 3857,
			"text": "আম্মার ইবনু ইয়াসির (রাঃ) বলেন, আমি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সাথে এমন অবস্থায় সাক্ষাৎ করলাম যে, তখন তাঁর সঙ্গে মুসলিম পাঁচজন কৃতদাস, দু’জন মহিলা ও আবূ বাকর (রাঃ) ব্যতীত অন্য কেউ ছিল না। (৩৬৬০) (আধুনিক প্রকাশনীঃ ৩৫৭০, ইসলামিক ফাউন্ডেশনঃ ৩৫৭৫)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 3858,
			"arabicnumber": 3858,
			"text": "সা‘দ ইবনু আবূ ওয়াক্কাস (রাঃ) বলেন, যেদিন আমি ইসলাম গ্রহণ করলাম সেদিন ছাড়া তার পূর্বে কেউ ইসলাম গ্রহণ করেনি। আর আমি সাতদিন পর্যন্ত (বয়স্কদের মধ্যে) ইসলাম গ্রহণকারী তৃতীয় জন ছিলাম। (৩৭২৬) (আধুনিক প্রকাশনীঃ ৩৫৭১, ইসলামিক ফাউন্ডেশনঃ ৩৫৭৬)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 3859,
			"arabicnumber": 3859,
			"text": "وقول الله تعالى : قُلْ أُوْحِىَ إِلَيَّ أَنَّهُ اسْتَمَعَ نَفَرٌ مِّنَ الْجِنِّ (الجن : 1) এবং আল্লাহর বাণীঃ ‘‘আপনি বলুনঃ আমার প্রতি ওয়াহী প্রেরণ করা হয়েছে যে, জ্বিনদের একটি দল মনোযোগ সহকারে কুরআন শ্রবণ করেছে।’’ (আল-জ্বিন ১) ৩৮৫৯. (মা'ন বিন) ‘আবদুর রহমান (রহ.) বলেন, আমি মাসরূক (রহ.)-কে জিজ্ঞেস করলাম, যে রাতে জ্বিনরা মনোযোগের সঙ্গে কুরআন শ্রবণ করেছিল ঐ রাতে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে তাদের উপস্থিতির খবর কে দিয়েছিল? তিনি বললেন, তোমার পিতা ‘আবদুল্লাহ [ইবনু মাসউদ (রাঃ)] আমাকে বলেছেন যে, একটি গাছ তাদের উপস্থিতির খবর দিয়েছিল। (মুসলিম ৪/৩৩, হাঃ নং ৪৫০) (আধুনিক প্রকাশনীঃ ৩৫৭২, ইসলামিক ফাউন্ডেশনঃ ৩৫৭৭)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 3860,
			"arabicnumber": 3860,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত যে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর উযু ও ইস্তিন্জার ব্যবহারের জন্য পানি ভর্তি একটি পাত্র নিয়ে পিছনে পিছনে যাচ্ছিলেন, হঠাৎ তিনি তাকিয়ে বললেন, কে? আমি বললাম, আমি আবূ হুরাইরাহ। তিনি বললেন, আমাকে কয়েকটি পাথর তালাশ করে দাও। আমি তা দিয়ে ইস্তিন্জা করব। [১] তবে, হাড় এবং গোবর আনবে না। আমি আমার কাপড়ের কিনারায় কয়েকটি পাথর এনে তাঁর কাছে রেখে দিলাম এবং আমি সেখান থেকে কিছুটা দূরে গেলাম। তিনি যখন ইস্তিন্জা হতে বেরোলেন, তখন আমি এগিয়ে তাঁকে জিজ্ঞেস করলাম, হাড় ও গোবর এর ব্যাপার কী? তিনি বললেন, এগুলো জ্বিনের খাবার। আমার কাছে নাসীবীন [২] নামের জায়গা হতে জ্বিনের একটি প্রতিনিধি দল এসেছিল। তারা ভাল জ্বিন ছিল। তারা আমার কাছে খাদ্যদ্রব্যের আবেদন জানাল। তখন আমি আল্লাহর নিকট দু‘আ করলাম যে, যখন কোন হাড্ডি বা গোবর তারা লাভ করে তখন তারা যেন তাতে খাদ্য পায়। [৩] (১৫৫) (আধুনিক প্রকাশনীঃ ৩৫৭৩, ইসলামিক ফাউন্ডেশনঃ ৩৫৭৮)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 3861,
			"arabicnumber": 3861,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর আবির্ভাবের খবর যখন আবূ যার (রাঃ) এর কাছে পৌঁছল, তখন তিনি তাঁর ভাইকে বললেন, তুমি এই উপত্যকায় গিয়ে ঐ লোক সম্পর্কে জেনে আস যে লোক নিজেকে নবী বলে দাবী করছেন ও তাঁর কাছে আসমান হতে সংবাদ আসে। তাঁর কথাবার্তা মনোযোগ দিয়ে শুন এবং ফিরে এসে আমাকে শুনাও। তাঁর ভাই রওয়ানা হয়ে ঐ লোকের কাছে পৌঁছে তাঁর কথাবার্তা শুনলেন। এরপর তিনি আবূ যারের নিকট ফিরে গিয়ে বললেন, আমি তাঁকে দেখেছি যে, তিনি উত্তম আখলাক গ্রহণ করার জন্য নির্দেশ দান করছেন এবং এমন কালাম যা পদ্য নয়। এতে আবূ যার (রাঃ) বললেন, আমি যে জন্য তোমাকে পাঠিয়েছিলাম সে বিষয়ে তুমি আমাকে সন্তোষজনক উত্তর দিতে পারলে না। আবূ যার (রাঃ) সফরের জন্য সামান্য পাথেয় সংগ্রহ করলেন এবং একটি ছোট্ট পানির মশকসহ মক্কা্য় উপস্থিত হলেন। মসজিদে হারামে প্রবেশ করে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে খোঁজ করতে লাগলেন। তিনি তাঁকে চিনতেন না। আবার কাউকে তাঁর ব্যাপারে জিজ্ঞেস করাও পছন্দ করলেন না। এ অবস্থায় রাত হয়ে গেল। তিনি শুয়ে পড়লেন। ‘আলী (রাঃ) তাঁকে দেখে বুঝলেন যে, লোকটি বিদেশী। যখন আবূ যার ‘আলী (রাঃ)-কে দেখলেন, তখন তিনি তাঁর পিছনে পিছনে গেলেন। কিন্তু সকাল পর্যন্ত একে অন্যকে কোন কিছু জিজ্ঞাসাবাদ করলেন না। আবূ যার (রাঃ) পুনরায় তাঁর পাথেয় ও মশক নিয়ে মসজিদে হারামের দিকে চলে গেলেন। এ দিনটি এমনিভাবে কেটে গেল, কিন্তু নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে দেখতে পেলেন না। সন্ধ্যা ঘনিয়ে এল। তিনি শোয়ার জায়গায় ফিরে গেলেন। তখন ‘আলী (রাঃ) তাঁর পাশ দিয়ে যাচ্ছিলেন। তিনি বললেন, এখনও কি মুসাফিরের গন্তব্য স্থানের সন্ধান হয়নি? সে এখনও এ জায়গায় অবস্থান করছে। তিনি তাঁকে সঙ্গে নিয়ে গেলেন। কেউ কাউকে কোন কিছু জিজ্ঞেস করলেন না। এ অবস্থায় তৃতীয় দিন হয়ে গেল। ‘আলী (রাঃ) পূর্বের ন্যায় তাঁর পাশ দিয়ে যেতে লাগলেন। তিনি তাঁকে সঙ্গে নিয়ে গেলেন। এরপর তিনি তাঁকে জিজ্ঞেস করলেন- তুমি কি আমাকে বলবে না কোন জিনিস এখানে আসতে তোমাকে অনুপ্রেরিত করেছে? আবূ যার (রাঃ) বললেন, তুমি যদি আমাকে সঠিক রাস্তা দেখানোর পাকা অঙ্গীকার কর তবেই আমি তোমাকে বলতে পারি। ‘আলী (রাঃ) অঙ্গীকার করলেন এবং আবূ যার (রাঃ)ও তাঁর আগমনের উদ্দেশ্য বললেন। ‘আলী (রাঃ) বললেন, তিনি সত্য, তিনি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম। যখন ভোর হয়ে যাবে তখন তুমি আমার অনুসরণ করবে। তোমার জন্য ভয়ের কারণ আছে এমন যদি কোন ব্যাপার আমি দেখতে পাই তবে আমি রাস্তার পাশে চলে যাব যেন আমি পেশাব করতে চাই। আর যদি আমি সোজা চলতে থাকি তবে তুমিও আমার অনুসরণ করতে থাকবে এবং যে ঘরে আমি প্রবেশ করি সে ঘরে তুমিও প্রবেশ করবে। আবূ যার (রাঃ) তাই করলেন। ‘আলী (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে প্রবেশ করলেন এবং তিনিও তাঁর [‘আলী (রাঃ)] সাথে প্রবেশ করলেন। তিনি (নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কথাবার্তা শুনলেন এবং ঐখানেই তিনি ইসলাম গ্রহণ করলেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তুমি তোমার স্বগোত্রে ফিরে যাও এবং আমার নির্দেশ না পৌঁছা পর্যন্ত আমার ব্যাপারে তাদেরকে অবহিত করবে। আবূ যার (রাঃ) বললেন, ঐ সত্তার কসম যাঁর হাতে আমার প্রাণ, আমি আমার ইসলাম গ্রহণকে মুশরিকদের সম্মুখে উচ্চস্বরে ঘোষণা করব। এই বলে তিনি বেরিয়ে পড়লেন ও মসজিদে হারামে গিয়ে হাজির হলেন এবং উচ্চকন্ঠে ঘোষণা করলেন, أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللهُ وَأَنَّ مُحَمَّدًا رَسُوْلُ اللهِ (তৎক্ষণাৎ) লোকেরা তাঁর উপর ঝাঁপিয়ে পড়ল এবং মারতে মারতে তাঁকে মাটিতে ফেলে দিল। এমন সময় ‘আব্বাস (রাঃ) এসে তাঁকে রক্ষা করলেন এবং বললেন, তোমাদের বিপদ অবধারিত। তোমরা কি জান না, এ লোকটি গিফার গোত্রের? আর তোমাদের ব্যবসায়ী কাফেলাগুলিকে গিফার গোত্রের নিকট দিয়েই সিরিয়া যাতায়াত করতে হয়। এ কথা বলে তিনি তাদের হাত হতে আবূ যারকে রক্ষা করলেন। পরদিন সকালে তিনি ঐরূপই বলতে লাগলেন। লোকেরা তাঁর উপর ঝাঁপিয়ে পড়ে তাঁকে ভীষণভাবে মারতে লাগল। ‘আব্বাস (রাঃ) এসে তাঁকে সামলে নিলেন। (৩৫২২) (আধুনিক প্রকাশনীঃ ৩৫৭৪, ইসলামিক ফাউন্ডেশনঃ ৩৫৭৯)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 3862,
			"arabicnumber": 3862,
			"text": "কায়স (রাঃ) বলেন, আমি সা‘ঈদ ইবনু যায়দ ইবনু ‘আমর ইবনু নুফায়ল (রাঃ)-কে কুফার মসজিদে বলতে শুনেছি যে, তিনি বলেন, আল্লাহর শপথ, ‘উমরের ইসলাম গ্রহণের আগে আমার ইসলাম গ্রহণের কারণে তাঁর হাতে আমাকে বন্দী হতে দেখেছি। তোমরা ‘উসমান (রাঃ) এর সাথে যে আচরণ করলে এ কারণে যদি ওহুদ পাহাড় বিদীর্ণ হয়ে যায় তবে তা হওয়া ঠিকই হবে। (৩৮৬২) (আধুনিক প্রকাশনীঃ ৩৫৭৫, ইসলামিক ফাউন্ডেশনঃ ৩৫৮০)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 3863,
			"arabicnumber": 3863,
			"text": "‘আবদুল্লাহ ইবনু মাসউদ (রাঃ) হতে বর্ণিত, তিনি বলেন, ‘উমার (রাঃ) যেদিন থেকে ইসলাম গ্রহণ করলেন ঐ দিন হতে আমরা সর্বদা সম্মানের আসনে অধিষ্ঠিত আছি। (৩৬৮৪) (আধুনিক প্রকাশনীঃ ৩৫৭৬, ইসলামিক ফাউন্ডেশনঃ ৩৫৮১)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 3864,
			"arabicnumber": 3864,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত, তিনি বলেন, তাঁর পিতা ‘উমার (রাঃ)একদিন নিজ গৃহে ভীত অবস্থায় অবস্থান করছিলেন। তখন আবূ ‘আমর ‘আস ইবনু ওয়াইল সাহমী তাঁর নিকট এলেন। তার গায়ে ছিল ধারিদার চাদর ও রেশমী জরির জামা। তিনি বানু সাহম গোত্রের লোক ছিলেন। জাহিলী যুগে তারা আমাদের হালীফ (বিপদ কালে সাহায্যের চুক্তি যাদের সাথে করা হয়) ছিল। ‘আস ‘উমার (রাঃ)-কে জিজ্ঞেস করলেন আপনার অবস্থা কেমন? ‘উমার (রাঃ) উত্তর দিলেন ইসলাম গ্রহণ করার কারণে তোমার গোত্রের লোকজন অচিরেই আমাকে হত্যা করবে। তা শুনে ‘আস (রাঃ) বললেন, তোমার কোন কিছু করার শক্তি ক্ষমতা তাদের নেই। তার কথা শুনে ‘উমর (রাঃ) বললেন, তোমার কথা শুনে আমি নিঃশঙ্ক হলাম। ‘আস বেরিয়ে পড়লেন এবং দেখতে পেলেন, মক্কা ভূমি লোকে ভরপুর। তিনি তাদেরকে বললেন, তোমরা কোথায় যাচ্ছ? তারা বলল, আমরা ‘উমার ইবনুল খাত্তাবের নিকট যাচ্ছি, সে নিজ ধর্ম ত্যাগ করতঃ বিধর্মী হয়ে গেছে। ‘আস বললেন তার নিকট যাওয়ার, তার কোন কিছু করার ক্ষমতা তোমাদের নেই। এতে লোকজন ফিরে গেল। (৩৮৬৫) (আধুনিক প্রকাশনীঃ ৩৫৭৭, ইসলামিক ফাউন্ডেশনঃ ৩৫৮২)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 3865,
			"arabicnumber": 3865,
			"text": "‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) বলেন, যখন ‘উমার (রাঃ) ইসলাম গ্রহণ করলেন, তখন লোকেরা তাঁর গৃহের কাছে জড় হল এবং বলতে লাগল, ‘উমার স্বধর্ম ত্যাগ করেছে। আমি তখন ছোট ছেলে। আমাদের ঘরের ছাদে দাঁড়িয়ে এ দৃশ্য দেখতেছিলাম। তখন একজন লোক এসে বলল,তার গায়ে রেশমী জুববা ছিল, ‘উমার স্বধর্ম ত্যাগ করেছে, কিন্তু এ সমাবেশ কেন? আমি তাকে আশ্রয় দিচ্ছি। ইবনু ‘উমার (রাঃ) বলেন, তখন আমি দেখলাম, লোকজন চারিদিকে ছত্রভঙ্গ হয়ে গেল। তখন আমি জিজ্ঞেস করলাম, এ লোকটি কে? লোকেরা বলল, ‘আস ইবনু ওয়াইল। (৩৮৬৪) (আধুনিক প্রকাশনীঃ ৩৫৭৮, ইসলামিক ফাউন্ডেশনঃ ৩৫৮৩)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 3866,
			"arabicnumber": 3866,
			"text": "‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) হতে বর্ণিত, তিনি বলেন, আমি যখনই ‘উমার (রাঃ)-কে কোন ব্যাপারে এ কথা বলতে শুনেছি যে, আমার মনে হয় ব্যাপারটি এমন হবে, তবে তার ধারণা মত ব্যাপারটি সংঘটিত হয়েছে। একবার ‘উমার (রাঃ) উপবিষ্ট ছিলেন, এমন সময় এক সুদর্শন লোক তার পাশ দিয়ে যাচ্ছিল। ‘উমার (রাঃ) বললেন, আমার ধারণা ভুলও হতে পারে তবে আমার মনে হয় লোকটি জাহেলী ধর্মাবলম্বী কিংবা ভবিষ্যৎ গণনাকারীও হতে পারে। লোকটিকে আমার কাছে নিয়ে এস। তাকে তাঁর কাছে ডেকে আনা হল। ‘উমার (রাঃ) তার ধারণার কথা তাকে শুনালেন। তখন সে বলল, ইতিপূর্বে আমি কোন মুসলিম ব্যক্তিকে এরূপ কথা বলতে দেখিনি। ‘উমার (রাঃ) বললেন, আমি তোমাকে কসম দিয়ে জিজ্ঞেস করছি, তুমি আমাকে তোমার বিষয়টি খুলে বল। সে বলল, জাহিলী যুগে আমি তাদের ভবিষ্যৎ গণনাকারী ছিলাম। ‘উমার (রাঃ) বললেন, জ্বিনেরা তোমাকে যে সব কথাবার্তা বলেছে, তন্মধ্যে কোন কথাটি তোমার কাছে সবচেয়ে বিস্ময়কর ছিল। সে বলল, আমি একদিন বাজারে ছিলাম। তখন একটি মহিলা জ্বিন আমার নিকট আসল। আমি তাকে ভীত-সন্ত্রস্ত দেখতে পেলাম। তখন সে বলল, তুমি কি জ্বিন জাতির অবস্থা দেখছনা, তারা কেমন দুর্বল হয়ে পড়ছে? তাদের মধ্যে হতাশার চিহ্ন দেখা যাচ্ছে। তারা ক্রমশঃ উটওয়ালাদের এবং চাদর জুববা পরিধানকারীদের অনুগত হয়ে পড়ছে। ‘উমার (রাঃ) বললেন, সে সত্য কথা বলেছে। আমি একদিন তাদের দেবতাদের কাছে ঘুমিয়ে ছিলাম। তখন এক লোক একটি গরুর বাছুর নিয়ে হাযির হল এবং সেটা যবহ করে দিল। ঐ সময় এক লোক এমন বিকট চীৎকার করে উঠল, যা আমি আর কখনও শুনিনি। সে চীৎকার করে বলছিল, হে জলীহ্! একটি সাধারণ কল্যাণময় ব্যাপার শীঘ্রই প্রকাশ লাভ করবে। তা হল- একজন শুদ্ধভাষী লোক বলবেন; لَا إِلَهَ إِلَّا اللهُ (শুনে) লোকজন ছুটাছুটি করে পলায়ন করল। আমি বললাম, এ ঘোষণার রহস্য অবশ্যই বের করব। তারপর আবার ঘোষণা দেয়া হল। হে জলীহ্! একটি সাধারণ ও কল্যাণময় ব্যাপার অতি শীঘ্র প্রকাশ পাবে। তাহল একজন বাগ্মী ব্যক্তি لَا إِلَهَ إِلَّا اللهُ এর প্রকাশ্যে ঘোষণা দিবে। তারপর আমি উঠে দাঁড়ালাম। এর কিছুদিন পরেই বলা হল যে, ইনিই নবী। (আধুনিক প্রকাশনীঃ ৩৫৭৯, ইসলামিক ফাউন্ডেশনঃ ৩৫৮৪)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 3867,
			"arabicnumber": 3867,
			"text": "কাইস (রহ.) বলেন, আমি সা‘ঈদ ইবনু যায়দ (রাঃ)-কে তাঁর গোত্রকে লক্ষ্য করে একথা বলতে শুনেছি যে, আমি দেখেছি ‘উমার (রাঃ) আমাকে এবং তার বোন ফাতিমাকে ইসলাম গ্রহণ করার কারণে বেঁধে রেখেছেন। তখন তিনি ইসলাম গ্রহণ করেননি। তোমরা ‘উসমান (রাঃ)-এর সাথে যে অসদাচরণ করেছ তার কারণে যদি ওহুদ পাহাড় বিদীর্ণ হয় তবে তা হওয়াটাই স্বাভাবিক। (৩৮৬২) (আধুনিক প্রকাশনীঃ ৩৫৮০, ইসলামিক ফাউন্ডেশনঃ ৩৫৮৫)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 3868,
			"arabicnumber": 3868,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত যে, মক্কা্বাসী রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে তাঁর নবুওয়াতের নিদর্শন দেখানোর দাবী জানাল। তিনি তাদেরকে চাঁদ দু’খন্ড করে দেখালেন। এমনকি তারা দু’খন্ডের মাঝে হেরা পাহাড়কে দেখতে পেল। (৩৬৩৭) (আধুনিক প্রকাশনীঃ ৩৫৮১, ইসলামিক ফাউন্ডেশনঃ ৩৫৮৬)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 3869,
			"arabicnumber": 3869,
			"text": "‘আবদুল্লাহ (ইবনু মাসউদ) (রাঃ) হতে বর্ণিত, তিনি বলেন, যখন চাঁদ দ্বিখন্ডিত হয় তখন আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে মিনায় ছিলাম। তিনি আমাদেরকে বললেন, তোমরা সাক্ষী থাক। তখন আমরা দেখলাম, চাঁদের একটি খন্ড হেরা পাহাড়ের দিকে চলে গেল। আবূ যুহা মাসরূকের বরাত দিয়ে ‘আবদুল্লাহ (রাঃ) হতে বর্ণনা করেন যে, চাঁদ দ্বিখন্ডিত হয় মক্কা্য়। মুহাম্মাদ বিন মুসলিম অনুরূপ হাদীস বর্ণনা করেছেন। (৩৬৩৬) (আধুনিক প্রকাশনীঃ ৩৫৮২, ইসলামিক ফাউন্ডেশনঃ ৩৫৮৭)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 3870,
			"arabicnumber": 3870,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর যুগে চাঁদ দু’ খন্ড হয়েছিল। (৩৬৩৮) (আধুনিক প্রকাশনীঃ ৩৫৮৩, ইসলামিক ফাউন্ডেশনঃ ৩৫৮৮)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 3871,
			"arabicnumber": 3871,
			"text": "আবদুল্লাহ (রাঃ) হতে বর্ণিত, তিনি বলেন, (নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর যুগে) চাঁদ দু’ খন্ড হয়েছিল। (৩৬৩৬) (আধুনিক প্রকাশনীঃ ৩৫৮৪, ইসলামিক ফাউন্ডেশনঃ ৩৫৮৯)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 3872,
			"arabicnumber": 3872,
			"text": "وَقَالَتْ عَائِشَةُ قَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أُرِيْتُ دَارَ هِجْرَتِكُمْ ذَاتَ نَخْلٍ بَيْنَ لَابَتَيْنِ فَهَاجَرَ مَنْ هَاجَرَ قِبَلَ الْمَدِيْنَةِ وَرَجَعَ عَامَّةُ مَنْ كَانَ هَاجَرَ بِأَرْضِ الْحَبَشَةِ إِلَى الْمَدِيْنَةِ فِيْهِ عَنْ أَبِيْ مُوْسَى وَأَسْمَاءَ عَنْ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ‘আয়িশাহ (রাঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমাদের হিজরা্তের স্থান আমাকে (স্বপ্নে) দেখান হয়েছে। যেখানে রয়েছে অনেক বৃক্ষ আর সে স্থানটি ছিল দুই পাহাড়ের মাঝখানে। তখন হিজরাতকারীগণ মদিনা্য় হিজরাত করলেন এবং যারা এর আগে হাবশাহ্য় হিজরাত করেছিলেন তারাও মদিনা্য় ফিরে আসলেন। এ সম্পর্কে আবূ মূসা ও আসমা (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে হাদীস বর্ণিত আছে। ৩৮৭২. ‘উবাইদুল্লাহ ইবনু ‘আদী ইবনু খিয়ার (রহ.) ‘উরওয়াহ ইবনু যুবায়রকে বলেন যে, মিসওয়ার ইবনু মাখরামাহ এবং ‘আবদুর রহমান ইবনু আসওয়াদ ইবনু ‘আবদ ইয়াগুস (রাঃ) উভয়ই তাকে বলেন, তুমি তোমার মামা ‘উসমান (রাঃ)-এর সাথে তার (বৈপিত্রেয়) ভাই ওয়ালীদ ইবনু ‘উকবাহ সম্পর্কে কোন আলাপ-আলোচনা করছ না কেন? জনগণ তার বিরুদ্ধে শক্তভাবে সমালোচনা করছে। ‘উবাইদুল্লাহ বলেন, ‘উসমান (রাঃ) যখন সালাতের জন্য মসজিদে আসছিলেন তখন আমি তাঁর সামনে গিয়ে দাঁড়ালাম এবং তাঁকে লক্ষ্য করে বললাম, আপনার সাথে আমার কথা বলার দরকার আছে এবং তা আপনার কল্যাণের জন্যই। তিনি বললেন, ওহে, আমি তোমা হতে আল্লাহর নিকট আশ্রয় প্রার্থনা করছি। আমি তখন ফিরে আসলাম এবং যখন সালাত শেষ করলাম, তখন মিসওয়ার ও ইবনু ‘আবদ ইয়াগুস (রাঃ)-এর নিকট গিয়ে বসলাম এবং ‘উসমান (রাঃ)-কে আমি যা বলেছি এবং তিনি যে উত্তর দিয়েছেন তা দু’জনকে শুনালাম। তারা বললেন, তোমার উপর যে দায়িত্ব ও কর্তব্য ছিল তা তুমি আদায় করেছ। আমি তাদের নিকট উপবিষ্টই আছি এ সময়‘উসমান (রাঃ)-এর পক্ষ হতে একজন দূত আমাকে ডেকে নেয়ার জন্য আসলেন। তারা দু’জন আমাকে বললেন, আল্লাহ্ তোমাকে পরীক্ষায় ফেলেছেন। আমি চললাম এবং ‘উসমান (রাঃ)-এর নিকট প্রবেশ করলাম। তিনি আমাকে জিজ্ঞেস করলেন, তোমার কী উপদেশ যা তুমি কিছুক্ষণ আগে বলতে চেয়েছিলে? তখন আমি কালিমা শাহাদাত পাঠ করে বললাম, আল্লাহ মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে রাসূলরূপে প্রেরণ করেছেন, তাঁর উপর কিতাব অবতীর্ণ করেছেন। আর আপনি ঐ দলেরই অন্তর্ভুক্ত যারা আল্লাহ্ ও তাঁর রাসূলের ডাকে সাড়া দিয়েছেন, আপনি তাঁর উপর ঈমান এনেছেন, এবং প্রথম দু’ হিজরতে আপনি অংশ নিয়েছেন, আপনি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গ লাভ করেছেন এবং তাঁর স্বভাব-চরিত্র চক্ষে দেখেছেন। জন সাধারণ ওয়ালিদ ইবনু ‘উকবাহ্ সম্পর্কে অনেক সমালোচনা করছে, আপনার কর্তব্য তাঁর উপর দন্ড জারি করা। ‘উসমান (রাঃ) আমাকে লক্ষ্য করে বললেন, হে ভাতিজা! তুমি কি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে পেয়েছ? আমি বললাম না, পাইনি। তবে তাঁর বিষয় আমার নিকট এমন ভাবে পৌঁছেছে যেমন ভাবে কুমারী মেয়েদের নিকট পর্দার সংবাদ পৌঁছে থাকে। ‘উবাইদুল্লাহ (রহ.) বলেন, ‘উসমান (রাঃ) কালিমা শাহাদত পাঠ করলেন এবং বললেন, নিশ্চয়ই আল্লাহ্ মুহম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে সত্যসহ প্রেরণ করেছেন, তাঁর উপর কিতাব অবতীর্ণ করেছেন। যারা আল্লাহ্ ও তাঁর রাসূলের ডাকে সাড়া দিয়েছেন তাঁদের মধ্যে আমিও ছিলাম। মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে যা সহ প্রেরণ করা হয়েছিল আমি তাঁর প্রতি ঈমান এনেছি। ইসলামের প্রথম যুগের দু’ হিজরতে অংশ গ্রহণ করেছি যেমন তুমি বলছ। আমি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গ লাভ করেছি, তাঁর হাতে বায়‘আত করেছি। আল্লাহর কসম, আমি তাঁর অবাধ্যতা করিনি। তাঁর সাথে প্রতারণা করিনি। এমতাবস্থায় তাঁর ওফাত হয়ে যায়। তারপর আল্লাহ্ তা‘আলা আবূ বাকর (রাঃ) কে খালীফাহ নিযুক্ত করলেন। আল্লাহর কসম, আমি তাঁরও নাফরমানী করিনি, তাঁর সাথে প্রতারণা করিনি। অতঃপর ‘উমার (রাঃ) খালীফাহ মনোনীত হলেন। আল্লাহর কসম, আমি তাঁরও অবাধ্য হইনি, তাঁর সাথে প্রতারণা করিনি। তিনিও মৃত্যুপ্রাপ্ত হলেন। এবং তারপর আমাকে খলীফা নিযুক্ত করা হল। আমার উপর তাদের বাধ্য থাকার যে রূপ হক ছিল তোমাদের উপর তাদের ন্যায় আমার প্রতি বাধ্য থাকার কি কোন কর্তব নেই? ‘উবাইদুল্লাহ বললেন, হাঁ। অবশ্যই হক আছে। ‘উসমান (রাঃ) বললেন, তাহলে এসব কথাবার্তা কী, তোমাদের পক্ষ হতে আমার নিকট আসছে? আর ওয়ালীদ ইবনু ‘উকবাহর ব্যাপারে তুমি যা বললে, সে ব্যাপারে আমি অতি সত্বর সঠিক পদক্ষেপ নিব ইন্শাআল্লাহ্। অতঃপর তিনি ওয়ালীদকে চল্লিশটি বেত্রাঘাত করার রায় প্রদান করলেন এবং তা বাস্তবায়িত করার জন্য ‘‘আলী (রাঃ)-কে আদেশ করলেন। সেকালে অপরাধীদেরকে শাস্তি প্রদানের দায়িত্বে ‘আলী (রাঃ) নিযুক্ত ছিলেন। ইউনুস এবং যুহরীর ভাতিজা যুহরী সূত্রে যে বর্ণনা করেন তাতে রয়েছে; ‘তোমাদের উপর আমার কি অধিকার নেই যেমন অধিকার ছিল তাদের জন্য।’ (আধুনিক প্রকাশনীঃ ৩৫৮৫, ইসলামিক ফাউন্ডেশনঃ ৩৫৯০) আবূ ‘আব্দুল্লাহ বলেন, অতঃপর ওয়ালীদকে চল্লিশটি বেত্রাঘাত করা হলো এবং ‘আলী (রাঃ)-কে নির্দেশ করা হলো তাকে বেত্রাঘাত করার। এবং তিনি তাকে বেত্রাঘাত করেছিলেন। (৩৬৯৬) আবূ ‘আব্দুল্লাহ বলেন, بَلَاءٌ مِنْ رَبِّكُمْ ‘‘তোমাদের প্রতিপালকের পক্ষ হতে শক্ত পরীক্ষা স্বরূপ।’’ (আল-বাকারাহঃ ৪৯) অন্যস্থানে الْبَلَاءُ শব্দ الاِبْتِلَاءُ ও التَّمْحِيْصُ অর্থে এসেছে। যথা بَلَوْتُهُ وَمَحَّصْتُهُ তার ভিতরের জিনিস উদ্ঘাটন করেছি। يَبْلُوْ পরীক্ষা করা অর্থে এসেছে, যথা مُبْتَلِيكُمْ ‘‘তিনি তোমাদের পরীক্ষা করবেন।’’ (আল-বাকারাহঃ ২৪৯) আর بَلَاءٌ عَظِيْمٌ অর্থাৎ বড় নি‘মাত। এখানে أَبْلَيْتُهُ আমি তাকে নি‘মাত দান করেছি।’’ এ অর্থে এসেছে। আর পূর্বের আয়াতে ابْتَلَيْتُهُ ‘‘আমি তাকে পরীক্ষা করেছি।’’ এর অর্থে এসেছে।",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 3873,
			"arabicnumber": 3873,
			"text": "‘আয়িশাহ্ (রাঃ) হতে বর্ণিত, তিনি বলেন, একদিন উম্মু হাবীবাহ ও উম্মু সালামাহ (রাঃ) তাঁর সাথে আলোচনা করলেন যে তাঁরা হাবাশায় খ্রিস্টানদের একটি গির্জা দেখে এসেছেন। সে গির্জায় নানা ধরনের চিত্র অঙ্কিত রয়েছে। তাঁরা দু’জন এসব কথা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে উল্লেখ করলেন। তখন তিনি বললেন, তাদের কোন নেক্কার লোক মারা গেলে তার কবরের উপর মাসজিদ তৈরি করত এবং এসব ছবি অঙ্কিত করে রাখত, এরাই কিয়ামতের দিনে আল্লাহ্ সর্ব নিকৃষ্ট সৃষ্টি হিসেবে গণ্য হবে। (৪২৭) (আধুনিক প্রকাশনীঃ ৩৫৮৬, ইসলামিক ফাউন্ডেশনঃ ৩৫৯১)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 3874,
			"arabicnumber": 3874,
			"text": "উম্মু খালিদ (রাঃ) হতে বর্ণিত, তিনি বলেন, আমি যখন হাবাশা হতে মদিনা্য় আসলাম তখন আমি ছোট্ট বালিকা ছিলাম। রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে একটি চাদর পরিয়ে দিলেন যাতে ডোরা কাটা ছিল। এরপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম& ঐ ডোরাগুলির উপর হাত বুলাতে লাগলেন, এবং বলতে ছিলেন সানাহ-সানাহ। হুমায়দী (রহ.) বলেন, অর্থাৎ সুন্দর সুন্দর। (৩০৭১) (আধুনিক প্রকাশনীঃ ৩৫৮৭, ইসলামিক ফাউন্ডেশনঃ ৩৫৯২)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 3875,
			"arabicnumber": 3875,
			"text": "‘আবদুল্লাহ ইবনু মাস‘উদ (রাঃ) হতে বর্ণিত, তিনি বলেন, সালাতে রত অবস্থায় নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে আমরা সালাম করতাম, তিনিও আমাদের সালামের উত্তর দিতেন। যখন আমরা নাজাশীর কাছ থেকে ফিরে এলাম, তখন সালাতে রত অবস্থায় তাঁকে সালাম করলাম, কিন্তু তিনি সালামের জবাব দিলেন না। আমরা তাঁকে জিজ্ঞেস করলাম, হে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম! আমরা আপনাকে সালাম করতাম এবং আপনিও সালামের উত্তর দিতেন। কিন্তু আজ আপনি আমাদের সালামের জবাব দিলেন না? তিনি বললেন, সালাতের মধ্যে আল্লাহর দিকে একাগ্রতা থাকে। রাবী বলেন, আমি ইবরাহীম নাখয়ীকে জিজ্ঞেস করলাম, আপনি কী করেন? তিনি বললেন, আমি মনে মনে জবাব দিয়ে দেই। (১১৯৯) (আধুনিক প্রকাশনীঃ ৩৫৮৮, ইসলামিক ফাউন্ডেশনঃ ৩৫৯৩)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 3876,
			"arabicnumber": 3876,
			"text": "আবূ মূসা (রাঃ) হতে বর্ণিত, তিনি বলেন, আমাদের কাছে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর আবির্ভাবের খবর এসে পৌঁছল। তখন আমরা ইয়ামানে ছিলাম। আমরা একটি নৌকায় আরোহণ করলাম। কিন্তু আমাদের নৌকা হাবাশায় নাজাশীর নিকট নিয়ে গেল। সেখানে জা‘ফর ইবনু আবূ তালিবের (রাঃ) সাথে সাক্ষাৎ হল। আমরা তাঁর সাথে থাকতে লাগলাম। কিছুদিন পর আমরা সেখান হতে রওয়ানা হলাম। এবং নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন খায়বার বিজয় করলেন তখন আমরা তাঁর সাথে মিলিত হলাম। আমাদেরকে দেখে তিনি বললেন, হে নৌকার আরোহীরা! তোমরা দু’টি হিজরাত লাভ করেছ। (৩১৩৬) (আধুনিক প্রকাশনীঃ ৩৫৮৯, ইসলামিক ফাউন্ডেশনঃ ৩৫৯৪)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 3877,
			"arabicnumber": 3877,
			"text": "জাবির (রাঃ) হতে বর্ণিত, তিনি বলেন, যখন নাজাশীর মৃত্যু হল তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আজ একজন সৎ ব্যক্তি মারা গেছেন। উঠো, এবং তোমাদের ভাই আসহামার জন্য জানাযার সালাত আদায় কর। (১৩১৭) (আধুনিক প্রকাশনীঃ ৩৫৯০, ইসলামিক ফাউন্ডেশনঃ ৩৫৯৫)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 3878,
			"arabicnumber": 3878,
			"text": "জাবির ইবনু ‘আবদুল্লাহ আনসারী (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নাজাশীর উপর জানাযার সালাত আদায় করেন। আমরাও তাঁর পিছনে সারিবদ্ধভাবে দাঁড়িয়ে গেলাম। আমি দ্বিতীয় বা তৃতীয় কাতারে ছিলাম। (১৩১৭) (আধুনিক প্রকাশনীঃ ৩৫৯১, ইসলামিক ফাউন্ডেশনঃ ৩৫৯৬)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 3879,
			"arabicnumber": 3879,
			"text": "জাবির ইবনু ‘আবদুল্লাহ (রাঃ) হতে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আসহামাহ নাজাশীর উপর জানাযার সালাত আদায় করেন এবং চারবার তাকবীর বলেন। (১৩১৭) (আধুনিক প্রকাশনীঃ ৩৫৯২, ইসলামিক ফাউন্ডেশনঃ ৩৫৯৭)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 3880,
			"arabicnumber": 3880,
			"text": "‘আবদুর রহমান ও ইবনুল মুসাইয়াব (রহ.) বলেন, আবূ হুরাইরাহ তাদেরকে (রাঃ) বলেছেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সহাবাদেরকে হাবাশা-এর বাদশাহ নাজাশীর মৃত্যু খবর সেদিন শুনালেন, যেদিন তিনি মারা গিয়েছিলেন এবং বলেছিলেন, তোমরা তোমাদের (দ্বীনী) ভাই এর জন্য মাগফিরাত চাও। (১২৪৫) (আধুনিক প্রকাশনীঃ ৩৫৯৩ প্রথমাংশ, ইসলামিক ফাউন্ডেশনঃ ৩৫৯৮ প্রথমাংশ)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 3881,
			"arabicnumber": 3881,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে এমনও বর্ণিত আছে যে, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সহাবাদেরকে নিয়ে মুসল্লায় সারিবদ্ধভাবে দাঁড়ালেন এবং নাজাশীর জন্য জানাযার সালাত আদায় করলেন আর তিনি চারবার তাকবীরও দিলেন। (১২৪৫) (আধুনিক প্রকাশনীঃ ৩৫৯৩ শেষাংশ, ইসলামিক ফাউন্ডেশনঃ ৩৫৯৮ শেষাংশ)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 3882,
			"arabicnumber": 3882,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হুনায়ন যুদ্ধে যাওয়ার ইচ্ছা পোষণ করলেন, তখন তিনি বললেন, আমরা আগামীকল্য খায়ফে বনী কেনানায় অবতরণ করব ‘ইনশা আল্লাহ্’ যেখানে কুরাইশরা সকলে কুফর ও শির্ক এর উপর থাকার শপথ করেছিল। (১৫৮৯) (আধুনিক প্রকাশনীঃ ৩৫৯৪, ইসলামিক ফাউন্ডেশনঃ ৩৫৯৯)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 3883,
			"arabicnumber": 3883,
			"text": "‘আব্বাস ইবনু আবদুল মুত্তালিব (রাঃ) বলেন, আমি একদিন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে জিজ্ঞেস করলাম, আপনি আপনার চাচা আবূ তালিবের কী উপকার করলেন অথচ তিনি আপনাকে দুশমনের সকল আক্রমণ ও ষড়যন্ত্র থেকে রক্ষা করেছেন। তাদের বিরুদ্ধে তিনি খুব ক্ষুব্ধ হতেন। তিনি বললেন, সে জাহান্নামে পায়ের গোড়ালি পর্যন্ত আগুনে আছে। যদি আমি না হতাম তাহলে সে জাহান্নামের একে বারে নিম্ন স্তরে থাকত। (৬২০৮, ৬৫৭২, মুসলিম ১/৯০, হাঃ নং ২০৯) (আধুনিক প্রকাশনীঃ ৩৫৯৫, ইসলামিক ফাউন্ডেশনঃ ৩৬০০)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 3884,
			"arabicnumber": 3884,
			"text": "ইবনু মুসাইয়্যাব তার পিতা মুসাইয়্যাব (রহ.) হতে বর্ণনা করেন, যখন আবূ তালিবের মুমূর্ষু অবস্থা তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার নিকট গেলেন। আবূ জাহলও তার নিকট উপবিষ্ট ছিল। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে লক্ষ্য করে বললেন, চাচাজান, لَا إِلَهَ إِلَّا اللهُ কলেমাটি একবার পড়ুন, তাহলে আমি আপনার জন্য আল্লাহর নিকট কথা বলতে পারব। তখন আবূ জাহাল ও ‘আবদুল্লাহ ইবনু আবূ উমাইয়া বলল, হে আবূ তালিব! তুমি কি ‘আবদুল মুত্তালিবের ধর্ম হতে ফিরে যাবে? এরা দু’জন তার সাথে একথাটি বারবার বলতে থাকল। সর্বশেষ আবূ তালিব তাদের সাথে যে কথাটি বলল, তাহল, আমি ‘আবদুল মুত্তালিবের মিল্লাতের উপরেই আছি। এ কথার পর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আমি আপনার জন্য ক্ষমা চাইতে থাকব যে পর্যন্ত আপনার ব্যাপারে আমাকে নিষেধ করা না হয়। এ প্রসঙ্গে এ আয়াতটি নাযিল হলঃ নবী ও মুমিনদের পক্ষে উচিত নয় যে, তারা ক্ষমা প্রার্থনা করবে মুশরিকদের জন্য যদি তারা নিকটাত্মীয়ও হয় যখন তাদের কাছে এ কথা স্পষ্ট হয়ে গেছে যে, তারা জাহান্নামী- (আত-তওবা ১১৩)। আরো নাযিল হলঃ আপনি যাকে ভালোবাসেন, ইচ্ছা করলেই তাকে হিদায়াত করতে পারবেন না- (আল-কাসাস ৫৬)। (১৩৬০) (আধুনিক প্রকাশনীঃ ৩৫৯৬, ইসলামিক ফাউন্ডেশনঃ ৩৬০১)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 3885,
			"arabicnumber": 3885,
			"text": "আবূ সাঈদ খুদরী (রাঃ) হতে বর্ণিত যে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছেন, যখন তাঁরই সামনে তাঁর চাচা আবূ তালিবের আলোচনা করা হল, তিনি বললেন, আশা করি কিয়ামতের দিনে আমার সুপারিশ তার উপকারে আসবে। অর্থাৎ আগুনের হালকা স্তরে তাকে ফেলা হবে, যা তার পায়ের গোড়ালি পর্যন্ত পৌঁছবে আর এতে তার মগয ফুটতে থাকবে। (আধুনিক প্রকাশনীঃ ৩৫৯৭, ইসলামিক ফাউন্ডেশনঃ ৩৬০২) ইয়াযিদ (রহ.)-ও এ হাদীসটি বর্ণনা করেছেন এবং আরো বলেছেন, এর তাপে মস্তিষ্কের মূল পর্যন্ত ফুটতে থাকবে। (৬৫৬৪, মুসলিম ১/৯০, হাঃ নং ২১০, আহমাদ ১১০৫৮) (আধুনিক প্রকাশনীঃ ৩৫৯৮, ইসলামিক ফাউন্ডেশনঃ ৩৬০৩)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 3886,
			"arabicnumber": 3886,
			"text": "وقول الله تعالى سُبْحَانَ الَّذِىْٓ أَسْرٰى بِعَبْدِهٰ لِيْلًا مِّنَ الْمَسْجِدِ الْحَرَامِ إِلَى الْمَسْجِدِ الْأَقْصَا (الإسراء : 1) আল্লাহ তা‘আলা বলেন- “পবিত্র ও মহিমাময় তিনি, যিনি তাঁর বান্দাকে রজনী যোগে ভ্রমণ করিয়েছেন মসজিদে হারাম হতে মসজিদে আক্‌সা পর্যন্ত-।” (আল-ইসরা/বনী ইসরাঈল- ১) ৩৮৮৬. জাবির ইবনু ‘আবদুল্লাহ (রাঃ) হতে বর্ণিত, তিনি রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছেন, যখন কুরাইশরা আমাকে অস্বীকার করল, তখন আমি কা‘বার হিজর অংশে দাঁড়ালাম। আল্লাহ্ তা‘আলা তখন আমার সামনে বায়তুল মুকাদ্দাসকে তুলে ধরলেন, যার কারণে আমি দেখে দেখে বাইতুল মুকাদ্দাসের নিদর্শনগুলো তাদের কাছে ব্যক্ত করছিলাম। (৪৭১০, মুসলিম ১/৭৫, হাঃ নং ১৭০, আহমাদ ১৫০৩৮) (আধুনিক প্রকাশনীঃ ৩৫৯৯, ইসলামিক ফাউন্ডেশনঃ ৩৬০৪)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 3887,
			"arabicnumber": 3887,
			"text": "মালিক ইবনু সা‘সা‘ (রাঃ) হতে বর্ণিত, আল্লাহর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যে রাতে তাঁকে ভ্রমণ করানো হয়েছে সে রাতের ঘটনা বর্ণনা করতে গিয়ে বলেন, এক সময় আমি কা‘বা ঘরের হাতিমের অংশে ছিলাম। কখনো কখনো রাবী (কাতাদাহ) বলেছেন, হিজরে শুয়েছিলাম। হঠাৎ একজন আগন্তুক আমার নিকট এলেন এবং আমার এস্থান হতে সে স্থানের মাঝের অংশটি চিরে ফেললেন। রাবী কাতাদাহ বলেন, আনাস (রাঃ) কখনো কাদ্দা (চিরলেন) শব্দ আবার কখনো শাক্কা (বিদীর্ণ) শব্দ বলেছেন। রাবী বলেন, আমি আমার পার্শ্বে বসা জারূদ (রহ.)-কে জিজ্ঞেস করলাম, এ দ্বারা কী বুঝিয়েছেন? তিনি বললেন, হলকূমের নিম্নদেশ হতে নাভি পর্যন্ত। কাতাদাহ (রহ.) বলেন, আমি আনাস (রাঃ)-কে এ-ও বলতে শুনেছি বুকের উপরিভাগ হতে নাভির নীচ পর্যন্ত। তারপর আগন্তুক আমার হৃদপিন্ড বের করলেন। তারপর আমার নিকট একটি সোনার পাত্র আনা হল যা ঈমানে পরিপূর্ণ ছিল। তারপর আমার হৃদপিন্ডটি ধৌত করা হল এবং ঈমান দ্বারা পরিপূর্ণ করে যথাস্থানে আবার রেখে দেয়া হল। তারপর সাদা রং এর একটি জন্তু আমার নিকট আনা হল। যা আকারে খচ্চর হতে ছোট ও গাধা হতে বড় ছিল। জারুদ তাকে বলেন, হে আবূ হামযা, এটাই কি বুরাক? আনাস (রাঃ) বললেন, হাঁ। সে একেক কদম রাখে দৃষ্টির শেষ সীমায়। আমাকে তার উপর সাওয়ার করানো হল। তারপর আমাকে নিয়ে জিবরাঈল (আঃ) চললেন। প্রথম আসমানে নিয়ে এসে দরজা খোলে দিতে বললেন, জিজ্ঞেস করা হল, ইনি কে? তিনি বললেন, জিবরাঈল। আবার জিজ্ঞেস করা হল, আপনার সঙ্গে কে? তিনি বললেন, মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম। আবার জিজ্ঞেস করা হল, তাঁকে কি ডেকে পাঠান হয়েছে? তিনি বললেন, হাঁ। তখন বলা হল, মারহাবা, উত্তম আগমনকারীর আগমন হয়েছে। তারপর আসমানের দরজা খুলে দেয়া হল। আমি যখন পৌঁছলাম, তখন সেখানে আদম (আঃ)-এর সাক্ষাৎ পেলাম। জিবরাঈল (আঃ) বললেন, ইনি আপনার আদি পিতা আদম (আঃ) তাঁকে সালাম করুন। আমি তাঁকে সালাম করলাম। তিনি সালামের জবাব দিলেন এবং বললেন, নেক্কার পুত্র ও নেক্কার নবীর প্রতি খোশ আমদেদ। তারপর উপরের দিকে চলে দ্বিতীয় আসমানে পৌঁছে দরজা খুলে দিতে বললেন, জিজ্ঞেস করা হল কে? তিনি বললেন, জিবরাঈল। জিজ্ঞেস করা হল আপনার সঙ্গে কে? তিনি বললেন, মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম। জিজ্ঞেস করা হল, তাঁকে কি ডেকে পাঠানো হয়েছে? তিনি উত্তর দিলেন, হাঁ। তারপর বলা হল- মারহাবা! উত্তম আগমনকারীর আগমন ঘটেছে। তারপর খুলে দেয়া হল। যখন সেখানে পৌঁছলাম তখন সেখানে ইয়াহ্ইয়া ও ‘ঈসা (আঃ)-এর সাক্ষাৎ পেলাম। তাঁরা দু’জন ছিলেন পরস্পরের খালাত ভাই। তিনি (জিবরাঈল) বললেন, এরা হলেন, ইয়াহ্ইয়া ও ঈসা (আঃ)। তাদের প্রতি সালাম করুন। তখন আমি সালাম করলাম। তাঁরা জবাব দিলেন, তারপর বললেন, নেক্কার ভাই ও নেক্কার নবীর প্রতি খোশ-আমদেদ। এরপর তিনি আমাকে নিয়ে তৃতীয় আসমানের দিকে চললেন, সেখানে পৌঁছে জিবরাঈল বললেন, খুলে দাও। তাঁকে বলা হল কে? তিনি উত্তর দিলেন, জিবরাঈল (আঃ)। জিজ্ঞেস করা হল আপনার সঙ্গে কে? তিনি বললেন, মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম। জিজ্ঞেস করা হল, তাঁকে কি ডেকে পাঠানো হয়েছে? তিনি বললেন, হাঁ। বলা হল, তাঁর জন্য খোশ-আমদেদ। উত্তম আগমনকারীর আগমন হয়েছে। তারপর দরজা খুলে দেয়া হল। আমি তথায় পৌঁছে ইউসুফ (আঃ)-কে দেখতে পেলাম। জিবরাঈল বললেন, ইনি ইউসুফ (আঃ) আপনি তাঁকে সালাম করুন। আমি তাঁকে সালাম করলাম, তিনিও জবাব দিলেন এবং বললেন, নেক্কার ভাই, নেক্কার নবীর প্রতি খোশ-আমদেদ। তারপর জিবরাঈল (আঃ) আমাকে নিয়ে উপর দিকে চললেন এবং চতুর্থ আসমানে পৌঁছলেন। আর দরজা খুলে দিতে বললেন। জিজ্ঞেস করা হল, আপনি কে? তিনি বললেন, জিবরাঈল। জিজ্ঞেস করা হল, আপনার সঙ্গে কে? তিনি বললেন মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম। জিজ্ঞেস করা হল, তাঁকে কি ডেকে পাঠানো হয়েছে? তিনি বললেন, হাঁ। তখন বলা হল, তাঁর প্রতি মারহাবা। উত্তম আগমনকারীর আগমন ঘটেছে। তখন খুলে দেয়া হল। আমি ইদ্রীস (আঃ)-এর কাছে পৌঁছলে জিবরাঈল বললেন, ইনি ইদ্রীস (আঃ)। তাঁকে সালাম করুন। আমি তাঁকে সালাম করলাম। তিনিও জবাব দিলেন। তারপর বললেন, নেক্কার ভাই ও নেক্কার নবীর প্রতি মারহাবা। এরপর তিনি আমাকে নিয়ে উপর দিকে গিয়ে পঞ্চম আসমানে পৌঁছে দরজা খুলতে বললেন। জিজ্ঞেস করা হল আপনি কে? তিনি বললেন, জিবরাঈল। জিজ্ঞেস করা হল, আপনার সঙ্গে কে? তিনি উত্তর দিলেন, মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম। জিজ্ঞেস করা হল। তাঁকে ডেকে পাঠানো হয়েছে? তিনি বললেন, হাঁ। বলা হল, তাঁর প্রতি মারহাবা। উত্তম আগমনকারীর আগমন হয়েছে। তথায় পৌঁছে হারূন (আঃ)-কে পেলাম। জিবরাঈল বললেন, ইনি হারূন (আঃ) তাঁকে সালাম করুন। আমি তাকে সালাম করলাম; তিনিও জবাব দিলেন, এবং বললেন, নেক্কার ভাই ও নেক্কার নবীর প্রতি মারহাবা। তারপর আমাকে নিয়ে যাত্রা করে ষষ্ঠ আকাশে পৌঁছে দরজা খুলতে বললেন। জিজ্ঞেস করা হল, আপনি কে? তিনি বললেন, জিবরাঈল। জিজ্ঞেস করা হল, আপনার সঙ্গে কে? তিনি বললেন, মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম। প্রশ্ন করা হল, তাকে কি ডেকে পাঠানো হয়েছে? তিনি বললেন, হাঁ। ফেরেশ্তা বললেন, তার প্রতি মারহাবা। উত্তম আগন্তুক এসেছেন। তথায় পৌঁছে আমি মূসা (আঃ)-কে পেলাম। জিবরাঈল (আঃ) বললেন, ইনি মূসা (আঃ)। তাঁকে সালাম করুন। আমি তাঁকে সালাম করলাম। তিনি জবাব দিলেন এবং বললেন, নেক্কার ভাই ও নেক্কার নবীর প্রতি মারহাবা। আমি যখন অগ্রসর হলাম তখন তিনি কেঁদে ফেললেন। তাঁকে জিজ্ঞেস করা হল, আপনি কিসের জন্য কাঁদছেন? তিনি বললেন, আমি এজন্য কাঁদছি যে, আমার পর একজন যুবককে নবী বানিয়ে পাঠানো হয়েছে, যাঁর উম্মত আমার উম্মত হতে অধিক সংখ্যায় জান্নাতে প্রবেশ করবে। তারপর জিবরাঈল (আঃ) আমাকে নিয়ে সপ্তম আকাশের দিকে গেলেন এবং দরজা খুলে দিতে বললেন, জিজ্ঞেস করা হল এ কে? তিনি উত্তর দিলেন, আমি জিবরাঈল। আবার জিজ্ঞেস করা হল, আপনার সাথে কে? তিনি বললেন, মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম। জিজ্ঞেস করা হল, তাকে ডেকে পাঠানো হয়েছে কি? তিনি বললেন, হাঁ। বলা হল, তাঁর প্রতি মারহাবা। উত্তম আগমনকারীর আগমন হয়েছে। আমি সেখানে পৌঁছে ইব্রাহীম (আঃ)-কে দেখতে পেলাম। জিবরাঈল (আঃ) বললেন, ইনি আপনার পিতা। তাঁকে সালাম করুন। আমি তাঁকে সালাম করলাম। তিনি সালামের জবাব দিলেন এবং বললেন, নেক্কার পুত্র ও নেক্কার নবীর প্রতি মারহাবা। তারপর আমাকে সিদ্রাতুল মুনতাহা* পর্যন্ত উঠানো হল। দেখতে পেলাম, তার ফল ‘হাজার’ অঞ্চলের মটকার ন্যায় এবং তার পাতাগুলি হাতির কানের মত। আমাকে বলা হল, এ হল সিদরাতুল মুন্তাহা। সেখানে আমি চারটি নহর দেখতে পেলাম, যাদের দু’টি ছিল অপ্রকাশ্য দু’টি ছিল প্রকাশ্য। তখন আমি জিব্রাঈল (আঃ)-কে জিজ্ঞেস করলাম, এ নহরগুলি কী? তিনি বললেন, অপ্রকাশ্য, দু’টি হল জান্নাতের দু’টি নহর। আর প্রকাশ্য দু’টি হল নীল নদী ও ফুরাত নদী। তারপর আমার সামনে ‘আল-বায়তুল মামুর’ প্রকাশ করা হল, এরপর আমার সামনে একটি শরাবের পাত্র, একটি দুধের পাত্র ও একটি মধুর পাত্র রাখা হল। আমি দুধের পাত্রটি গ্রহণ করলাম। তখন জিবরাঈল বললেন, এ-ই হচ্ছে ফিতরাত। আপনি ও আপনার উম্মতগণ এর উপর প্রতিষ্ঠিত। তারপর আমার উপর দৈনিক ৫০ ওয়াক্ত সালাত ফরয করা হল। এরপর আমি ফিরে আসলাম। মূসা (আঃ)-এর সম্মুখ দিয়ে যাওয়ার সময় তিনি আমাকে জিজ্ঞেস করলেন আল্লাহ্ তা‘আলা আপনাকে কী আদেশ করেছেন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আমাকে দৈনিক পঞ্চাশ ওয়াক্ত সালাতের আদেশ দেয়া হয়েছে। তিনি বললেন, আপনার উম্মত দৈনিক পঞ্চাশ ওয়াক্ত সালাত আদায় করতে সমর্থ হবে না। আল্লাহর কসম। আমি আপনার আগে লোকদের পরীক্ষা করেছি এবং বনী ইসরাঈলের হিদায়াতের জন্য কঠোর শ্রম দিয়েছি। তাই আপনি আপনার প্রতিপালকের নিকট ফিরে যান এবং আপনার উম্মতের (বোঝা) হালকা করার জন্য আরয করুন। আমি ফিরে গেলাম। ফলে আমার উপর হতে দশ হ্রাস করে দিলেন। আমি আবার মূসা (আঃ)-এর নিকট ফিরে এলাম। তিনি আবার আগের মত বললেন, আমি আবার ফিরে গেলাম। ফলে আল্লাহ তা‘আলা আরো দশ কমিয়ে দিলেন। ফিরার পথে মূসা (আঃ)-এর নিকট পৌঁছলে, তিনি আবার আগের কথা বললেন, আমি আবার ফিরে গেলাম। আল্লাহ তা‘আলা আরো দশ হ্রাস করলেন। আমি মূসা (আঃ)-এর নিকট ফিরে এলাম। তিনি আবার ঐ কথাই বললেন। আমি আবার ফিরে গেলাম। তখন আমাকে প্রতিদিন দশ সালাতের আদেশ দেয়া হয়। আমি ফিরে এলাম। মূসা (আঃ) ঐ কথাই আগের মত বললেন। আমি আবার ফিরে গেলাম, তখন আমাকে পাঁচ সালাতের আদেশ করা হয়। তারপর মূসা (আঃ) নিকট ফিরে এলাম। তিনি বললেন, আপনাকে কী আদেশ দেয়া হয়েছে। আমি বললাম, আমাকে দৈনিক পাঁচবার সালাত আদায়ের আদেশ দেয়া হয়েছে? মূসা (আঃ) বললেন, আপনার উম্মত দৈনিক পাঁচ সালাত আদায় করতেও সমর্থ হবে না। আপনার পূর্বে আমি লোকদের পরীক্ষা করেছি। বনী ইসরাঈলের হিদায়াতের জন্য কঠোর শ্রম দিয়েছি। আপনি আপনার রবের নিকট ফিরে যান এবং আপনার উম্মতের জন্য আরো সহজ করার আরযি করুন। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আমি আমার রবের নিকট আরজি করেছি, এতে আমি লজ্জাবোধ করছি। আর আমি এতেই সন্তুষ্ট হয়েছি এবং তা মেনে নিয়েছি। এরপর তিনি বললেন, আমি যখন অগ্রসর হলাম, তখন এক ঘোষণাকারী ঘোষণা দিলেন, আমি আমার অবশ্য প্রতিপাল্য নির্দেশ জারি করে দিলাম এবং আমার বান্দাদের উপর হালকা করে দিলাম। (৩২০৭) (আধুনিক প্রকাশনীঃ ৩৬০০, ইসলামিক ফাউন্ডেশনঃ ৩৬০৫)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 3888,
			"arabicnumber": 3888,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। আল্লাহ তা‘আলার বাণী ‘‘আর আমি যে দৃশ্য আপনাকে দেখিয়েছি তা কেবল মানুষের পরীক্ষার জন্য’’ (ইসরা/বনী ইসরাঈলঃ ২০) এর তাফসীরে বলেন, এটি হল প্রত্যক্ষভাবে চোখের দেখা যা রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে সে রাতে দেখানো হয়েছে যে রাতে তাঁকে বায়তুল মুকাদ্দাস পর্যন্ত ভ্রমণ করানো হয়েছিল ইবনু ‘আব্বাস (রাঃ) আরো বলেন, কুরআনে যে অভিশপ্ত বৃক্ষের কথা বলা হয়েছে, তা হল যাক্কুম বৃক্ষ। (৪৭১৬, ৬৬১৩) (আধুনিক প্রকাশনীঃ ৩৬০১, ইসলামিক ফাউন্ডেশনঃ ৩৬০৬)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 3889,
			"arabicnumber": 3889,
			"text": "‘আবদুল্লাহ ইবনু কা‘ব (রহ.) যিনি কা‘ব এর পথ প্রদর্শক ছিলেন যখন কা‘ব অন্ধ হয়ে গিয়েছিলেন তিনি বলেন, আমি কা‘ব ইবনু মালিক (রাঃ)-কে তাবূক যুদ্ধকালে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে তাঁর পশ্চাতে হতে যাওয়ার ঘটনাটি সবিস্তারে বর্ণনা করতে শুনেছি। ইবনু বুকায়র তাঁর বর্ণনায় এ কথাটিও বলেন যে, কা‘ব (রাঃ) বলেছেন, আমি ‘আকাবার রাতে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে উপস্থিত ছিলাম। যখন আমরা ইসলামের উপর দৃঢ় থাকার অঙ্গীকার করেছিলাম। সে রাত্রের পরিবর্তে বাদ্র যুদ্ধে উপস্থিত হওয়া আমার নিকট অধিক প্রিয় নয়, যদিও বাদ্র যুদ্ধ জনগণের মধ্যে ‘আকাবার চেয়ে বেশি আলোচিত ছিল। (২৭৫৭) (আধুনিক প্রকাশনীঃ ৩৬০২, ইসলামিক ফাউন্ডেশনঃ ৩৬০৭)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 3890,
			"arabicnumber": 3890,
			"text": "জাবির ইবনু ‘আবদুল্লাহ (রাঃ) হতে বর্ণিত, তিনি বলেন, ‘আকাবা রাতে আমার দু’জন মামা আমাকে সেখানে নিয়ে গিয়েছিলেন। ইমাম বুখারী (রহ.) বলেন, ইবনু উয়ায়না বলেন, দু’জন মামার একজন হলেন বারা‘ ইবনু মা‘রূর (রাঃ)। (৩৮৯১) (আধুনিক প্রকাশনীঃ ৩৬০৩, ইসলামিক ফাউন্ডেশনঃ ৩৬০৮)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 3891,
			"arabicnumber": 3891,
			"text": "‘আতা (রহ.) হতে বর্ণিত যে, জাবির (রাঃ) বলেন, আমি, আমার পিতা আবদুল্লাহ এবং আমার মামা ‘আকাবায় অংশগ্রহণকারীদের মধ্যে ছিলাম। (৩৮৯০) (আধুনিক প্রকাশনীঃ ৩৬০৪, ইসলামিক ফাউন্ডেশনঃ ৩৬০৯)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 3892,
			"arabicnumber": 3892,
			"text": "আবূ ইদরীস আইযুল্লাহ (রহ.) হতে বর্ণিত যে, ‘উবাদাহ ইবনু সামিত (রাঃ) যিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে বাদার যুদ্ধে এবং আকাবার রাতে উপস্থিত সাহাবীদের মধ্যে ছিলেন- তিনি আমার কাছে বর্ণনা করেছেন যে, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সাহাবীদের একটি দলকে লক্ষ্য করে বললেন, এস তোমরা আমার কাছে একথার উপর বায়‘আত* কর যে, তোমরা আল্লাহ তা‘আলার সাথে কোন কিছুকে শরীক করবে না, তোমরা চুরি করবে না, তোমরা ব্যভিচার করবে না; তোমরা তোমাদের সন্তানদেরকে হত্যা করবে না, তোমরা অপবাদ আরোপ করবে না যা তোমরা নিজে হতে বানিয়ে নাও, তোমরা নেক কাজে আমার নাফরমানী করবে না, তোমাদের মধ্যে যে ব্যক্তি এসব শর্ত পূরণ করে চলবে সে আল্লাহর তা‘আলার নিকট তার প্রতিদান অবশ্যই পাবে। আর যে এ সবের কোন কিছুতে লিপ্ত হয় এবং তাকে এ কারণে দুনিয়াতে শাস্তি দেয়া হয়, তবে এ শাস্তি তার প্রতি কাফ্ফারা হয়ে যাবে। আর যে ব্যক্তি এ সবের কোনটিতে লিপ্ত হল আর আল্লাহ তা গোপন রাখেন, তবে তার ব্যাপারটি আল্লাহ তা‘আলার ওপর ন্যস্ত। তিনি ইচ্ছা করলে শাস্তি দিবেন আর ইচ্ছা করলে ক্ষমা করবেন। ‘উবাদাহ (রাঃ) বলেন, আমিও এসব শর্তের উপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট হাতে বায়‘আত করেছি। (১৮) (আধুনিক প্রকাশনীঃ ৩৬০৫, ইসলামিক ফাউন্ডেশনঃ ৩৬১০)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 3893,
			"arabicnumber": 3893,
			"text": "‘উবাদাহ ইবনু সামিত (রাঃ) হতে বর্ণিত, তিনি বলেন, আমি ঐ মনোনীত প্রতিনিধি দলে ছিলাম, যারা রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে বায়‘আত গ্রহণ করেছিল। তিনি আরও বলেন, আমরা তাঁরকাছে বায়‘আত গ্রহণ করেছিলাম জান্নাত লাভের জন্য যদি আমরা এই কাজগুলো করি এই শর্তে যে, আমরা আল্লাহর সঙ্গেকোন কিছুকেই শরীক করব না, ব্যভিচার করব না, চুরি করব না। আল্লাহ্ যাকে হত্যা করা হারাম করেছেন, তাকে না হক হত্যা করব না, লুটতরাজ করব না এবং নাফরমানী করব না। আর যদি আমরা এর মধ্যে কোনটিতে লিপ্ত হই, তাহলে এর ফয়সালা আল্লাহ্ তা‘আলার উপর। (১৮) (আধুনিক প্রকাশনীঃ ৩৬০৬, ইসলামিক ফাউন্ডেশনঃ ৩৬১১)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 3894,
			"arabicnumber": 3894,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন আমাকে বিবাহ করেন, তখন আমার বয়স ছিল ছয় বছর। তারপর আমরা মদিনায় এলাম এবং বনু হারিস গোত্রে অবস্থান করলাম। সেখানে আমি জ্বরে আক্রান্ত হলাম। এতে আমার চুল পড়ে গেল। পরে যখন আমার মাথার সামনের চুল জমে উঠল। সে সময় আমি একদিন আমার বান্ধবীদের সাথে দোলনায় খেলা করছিলাম। তখন আমার মাতা উম্মে রূমান আমাকে উচ্চস্বরে ডাকলেন। আমি তাঁর কাছে এলাম। আমি বুঝতে পারিনি, তার উদ্দেশ্য কী? তিনি আমার হাত দরে ঘরের দরজায় এসে আমাকে দাঁড় করালেন। আর আমি হাঁফাচ্ছিলাম। শেষে আমার শ্বাস-প্রশ্বাস কিছুটা প্রশমিত হল। এরপর তিনি কিছু পানি নিলেন এবং তা দিয়ে আমার মুখমন্ডল ও মাথা মাসেহ করে দিলেন। তারপর আমাকে ঘরের ভিতর প্রবেশ করালেন। সেখানে কয়েকজন আনসারী মহিলা ছিলেন। তাঁরা বললেন, কল্যাণময়, বরকতময় এবং সৌভাগ্যমন্ডিত হোক। আমাকে তাদের কাছে দিয়ে দিলেন। তাঁরা আমার অবস্থান ঠিক করে দিলেন, তখন ছিল দ্বিপ্রহরের পূর্ব মুহূর্ত। হঠাৎ রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে দেখে আমি হকচকিয়ে গেলাম। তাঁরা আমাকে তাঁর কাছে তুলে দিল। সে সময় আমি নয় বছরের বালিকা। (৩৮৯৬, ৫১৩৩, ৫১৩৪, ৫১৫৬, ৫১৫৮, ৫১৬০, মুসলিম ১৬/৯, হাঃ নং ১৪২২) (আধুনিক প্রকাশনীঃ ৩৬০৭, ইসলামিক ফাউন্ডেশনঃ ৩৬১২)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 3895,
			"arabicnumber": 3895,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে বলেন, দু’বার তোমাকে আমায় স্বপ্নে দেখানো হয়েছে। আমি দেখলাম, তুমি একটি রেশমী কাপড়ে আবৃতা এবং আমাকে বলছে ইনি আপনার স্ত্রী, আমি তার ঘোমটা সরিয়ে দেখলাম, সে মহিলা তুমিই। তখন আমি ভাবছিলাম, যদি তা আল্লাহর পক্ষ হতে হয়ে থাকে, তবে তিনি তা বাস্তবায়িত করবেন। (৫০৭৮, ৫১২৫, ৭০১১, ৭০১২, মুসলিম ৪৪/১৩, হাঃ নং ২৪৩৮, আহমাদ ২৪১৯৭)(আধুনিক প্রকাশনীঃ ৩৬০৮, ইসলামিক ফাউন্ডেশনঃ ৩৬১৩)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 3896,
			"arabicnumber": 3896,
			"text": "হিশাম এর পিতা হতে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর মদিনার দিকে বের হওয়ার তিন বছর আগে খাদীজাহ (রাঃ)-এর মৃত্যু হয়। তারপর দু’বছর অথবা এর কাছাকাছি সময় অতিবাহিত করে তিনি ‘আয়িশাহ (রাঃ)-কে বিবাহ করেন। যখন তিনি ছিলেন ছয় বছরের বালিকা। তারপর নয় বছর বয়সে বাসর উৎযাপন করেন। (৩৮৯৪) (আধুনিক প্রকাশনীঃ ৩৬০৯, ইসলামিক ফাউন্ডেশনঃ ৩৬১৪)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 3897,
			"arabicnumber": 3897,
			"text": "وَقَالَ عَبْدُ اللهِ بْنُ زَيْدٍ وَأَبُوْ هُرَيْرَةَ رَضِيَ اللهُ عَنْهُمَا عَنْ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لَوْلَا الْهِجْرَةُ لَكُنْتُ امْرَأً مِنْ الْأَنْصَارِ وَقَالَ أَبُوْ مُوْسَى عَنْ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ رَأَيْتُ فِي الْمَنَامِ أَنِّيْ أُهَاجِرُ مِنْ مَكَّةَ إِلَى أَرْضٍ بِهَا نَخْلٌ فَذَهَبَ وَهَلِيْ إِلَى أَنَّهَا الْيَمَامَةُ أَوْ هَجَرُ فَإِذَا هِيَ الْمَدِيْنَةُ يَثْرِبُ ‘আবদুল্লাহ ইবনু যায়দ ও আবূ হুরাইরাহ (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেন, যদি হিজরাতের ফাযীলাত না হত তবে আমি আনসারদেরই একজন হতাম। আবূ মূসা (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেন, আমি স্বপ্নে দেখলাম যে, আমি মক্কা হতে হিজরাত করছি এমন জায়গায় যেখানে খেজুর বাগান আছে। আমি ভাবলাম, তা হবে ইয়ামামাহ কিংবা হাজার।* পরে দেখলাম যে, তা মদিনা-ইয়াস্রিব। ৩৮৯৭. আবূ ওয়াইল (রহ.) বলেন, আমরা পীড়িত খাববাব (রাঃ)-কে দেখতে গেলাম। তিনি আমাদেরকে বললেন, আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে হিজরাত করেছিলাম- আল্লাহর সন্তুষ্টির উদ্দেশ্যে। আল্লাহর নিকট আমাদের সওয়াব রয়েছে। তবে আমাদের মধ্যে কেউ কেউ কোন প্রতিদানের কিছু না নিয়েই চলে গেছেন। এদের মধ্যে ছিলেন মুস‘আব ইবনু ‘উমায়র (রাঃ)। তিনি ওহুদের দিন শহীদ হন। তিনি একখানা চাদর রেখে যান। আমরা যখন এটি দিয়ে তাঁর মাথা ঢেকে দিতাম তখন তাঁর পা বেরিয়ে পড়ত, আর যখন আমরা পা ঢেকে দিতাম, তখন তাঁর মাথা বেরিয়ে পড়ত। তখন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের নির্দেশ করলেন যে, আমরা যেন তাঁর মাথা ঢেকে দিই এবং তাঁর পায়ের উপর কিছু ইয্খির রেখে দিই। আর আমাদের মধ্যে এমন কেউ কেউ আছেন, যাদের ফল পরিপক্ক হয়েছে আর তারা তা পেড়ে খাচ্ছেন। (১২৭৬) (আধুনিক প্রকাশনীঃ ৩৬১০, ইসলামিক ফাউন্ডেশনঃ ৩৬১৫)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 3898,
			"arabicnumber": 3898,
			"text": "‘উমার (রাঃ) বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি যে, আমলের ফলাফল নির্ভর করে নিয়্যাতের* উপর। সুতরাং যার হিজরাত** হয় দুনিয়া লাভের জন্য কিংবা কোন স্ত্রীলোককে বিবাহ করার উদ্দেশে, তাহলে তার হিজরাত হবে যে উদ্দেশে সে হিজরাত করেছে। আর যার হিজরাত হবে আল্লাহ্ ও তাঁর রাসূলের উদ্দেশ্যে, তবে তার হিজরাত হবে আল্লাহ্ ও তাঁর রাসূলেরই জন্য। (১) (আধুনিক প্রকাশনীঃ ৩৬১১, ইসলামিক ফাউন্ডেশনঃ ৩৬১৬)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 3899,
			"arabicnumber": 3899,
			"text": "‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) বলতেন, (মক্কা) বিজয়ের পর হিজরাতের কোন প্রয়োজন নেই।",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 3900,
			"arabicnumber": 3900,
			"text": "আওযায়ী ... ‘আতা (রহ.) হতে বর্ণনা করেন, তিনি বলেন, আমি ইবায়দ ইবনু উমায়র লাইসী (রাঃ)-এর সঙ্গে ‘আয়িশাহ (রাঃ) এর সাথে সাক্ষাৎ করলাম। তারপর তাঁকে হিজরাত সম্পর্কে জিজ্ঞেস করলাম। তিনি বললেন, এখন হিজরাতের কোন প্রয়োজন নেই। অতীতে মু’মিনদের কেউ তার দ্বীনের জন্য তার প্রতি ফিতনার ভয়ে আল্লাহ্ ও তাঁর রাসূলের দিকে হিজরাত করতেন আর আজ আল্লাহ্ ইসলামকে বিজয়ী করেছেন। এখন কোন মু’মিন তার রবের ইবাদত যেখানে ইচ্ছা করতে পারে। তবে এখন আছে জিহাদ ও নিয়্যাত। (৩০৮০) (আধুনিক প্রকাশনীঃ ৩৬১২/৩৬১৩, ইসলামিক ফাউন্ডেশনঃ ৩৬১৭)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 3901,
			"arabicnumber": 3901,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত, তিনি বলেন, সা‘দ (রাঃ) দু‘আ করলেন, হে আল্লাহ্! আপনি তো জানেন, আমার নিকট আপনার রাহে এ কাওমের বিরুদ্ধে, যারা আপনার রাসূলকে অবিশ্বাস করেছে ও তাঁকে বিতাড়িত করেছে। জিহাদ করা এত প্রিয় যতটুকু অন্য কারো বিরুদ্ধে নয়। হে আল্লাহ্! আমার ধারণা আপনি আমাদের ও তাদের মধ্যকার লড়াই শেষ করে দিয়েছেন। আবন ইবনু ইয়াযীদ (রহ.)... ‘আয়িশাহ (রাঃ) হতে বর্ণিত যে, সে কাওম যারা তোমার নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে অবিশ্বাস করেছে এবং তাঁকে বের করে দিয়েছে, তারা কুরাইশ গোত্রই। (৪৬৩) (আধুনিক প্রকাশনীঃ ৩৬১৪, ইসলামিক ফাউন্ডেশনঃ ৩৬১৮)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 3902,
			"arabicnumber": 3902,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ্-কে নবুওয়াত দেয়া হয় চল্লিশ বছর বয়সে, এরপর তিনি তের বছর মক্কা্য় কাটান। এ সময় তার প্রতি ওহী নাযিল হচ্ছিল। তারপর হিজরাতের নির্দেশ পান। এবং হিজরাতের পর দশ বছর কাটান। আর তিনি তেষট্টি বছর বয়সে মারা যান। (৩৮৫১, মুসলিম ৪৩/৩২, হাঃ নং ২৩৫১, আহমাদ ২২৪২) (আধুনিক প্রকাশনীঃ ৩৬১৫, ইসলামিক ফাউন্ডেশনঃ ৩৬১৯)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 3903,
			"arabicnumber": 3903,
			"text": "ইবনু ‘আববাদ (রাঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মক্কা্য় তের বছর কাটান। তিনি তিষট্টি বছর বয়সে মারা যান। (৩৮৫১) (আধুনিক প্রকাশনীঃ ৩৬১৬, ইসলামিক ফাউন্ডেশনঃ ৩৬২০)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 3904,
			"arabicnumber": 3904,
			"text": "আবূ সাঈদ খুদরী (রাঃ) হতে বর্ণিত যে, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মিম্বরে বসলেন এবং বললেন, আল্লাহ্ তার এক বান্দাকে দুটি বিষয়ের একটি বেছে নেয়ার অধিকার দিয়েছেন। তার একটি হল হল দুনিয়ার ভোগ-বিলাস আর একটি হল আল্লাহর নিকট যা রক্ষিত রয়েছে। তখন সে বান্দা আল্লাহর কাছে যা রয়েছে তাই পছন্দ করলেন। একথা শুনে, আবূ বাকর (রাঃ) কেঁদে ফেললেন, এবং বললেন, আমাদের পিতা-মাতাকে আপনার জন্য কুরবানী করলাম। তাঁর অবস্থা দেখে আমরা বিস্মিত হলাম। লোকেরা বলতে লাগল, এ বৃদ্ধের অবস্থা দেখ রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক বান্দা সম্বন্ধে খবর দিলেন যে, তাকে আল্লাহ্ ভোগ-সম্পদ দেওয়ার এবং তার কাছে যা রয়েছে, এ দু’য়ের মধ্যে বেছে নিতে বললেন আর এই বৃদ্ধ বলছে, আপনার জন্য আমাদের মাতাপিতা উৎসর্গ করলাম। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-ই হলেন সেই ইখতিয়ার প্রাপ্ত বান্দা। আর আবূ বাকর (রাঃ)ই হলেন আমাদের মধ্যে সবচেয়ে বিজ্ঞ ব্যক্তি। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, যে ব্যক্তি তার সঙ্গ ও সম্পদ দিয়ে আমার প্রতি সবচেয়ে ইহসান করেছেন তিনি হলেন আবূ বাকর (রাঃ)। যদি আমি আমার উম্মতের কোন ব্যক্তিকে অন্তরঙ্গ হিসেবে গ্রহণ করতাম তাহলে আবূ বাকরকেই করতাম। তবে তার সঙ্গে আমার ইসলামী ভ্রাতৃত্বের সম্পর্ক রয়েছে। মসজিদের দিকে আবূ বাকর (রাঃ) এর দরজা ছাড়া অন্য কারো দরজা খোলা থাকবে না। (৪৬৬, মুসলিম ৪৪/১, হাঃ নং ২৩৮২) (আধুনিক প্রকাশনীঃ ৩৬১৭, ইসলামিক ফাউন্ডেশনঃ ৩৬২১)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 3905,
			"arabicnumber": 3905,
			"text": "",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 3906,
			"arabicnumber": 3906,
			"text": "",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 3907,
			"arabicnumber": 3907,
			"text": "আসমা (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এবং আবূ বাকর (রাঃ) যখন মদিনা্য় যাওয়ার ইচ্ছা করলেন, তখন আমি তাঁদের জন্য সফরের খাদ্যদ্রব্য প্রস্তুত করলাম। আর আমার পিতাকে বললাম, থলের মুখ বাঁধার জন্য আমার কোমরবন্দ ছাড়া অন্য কিছু পাচ্ছি না তিনি বললেন, ওটা তুমি টুকরো করে নাও। আমি তাই করলাম। এ কারণে আমার নাম হয়ে গেল, ‘যাতুন্ নিতাকাইন’ (কোমরবন্দ দু’ভাগে বিভক্তকারিণী)। (২৯৭৯) (আধুনিক প্রকাশনীঃ ৩৬১৯, ইসলামিক ফাউন্ডেশনঃ ৩৬২৩)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 3908,
			"arabicnumber": 3908,
			"text": "বারা’ (রাঃ) হতে বর্ণিত, তিনি বলেন, যখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মদিনার দিকে যাচ্ছিলেন তখন সুরাকাহ ইবনু মালিক ইবনু জ‘শুম তাঁর পেছনে ধাওয়া করল। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার জন্য বদ্দু‘আ করলেন। ফলে তার ঘোড়াটি তাকে নিয়ে মাটিতে দেবে গেল। তখন সে বলল, আপনি, আল্লাহর কাছে আমার জন্য দু’আ করুন। আমি আপনার কোন ক্ষতি করব না। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার জন্য দু’আ করলেন। বর্ণনাকারী বলেন, এক সময় রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তৃষ্ণার্ত হলেন। তখন তিনি এক রাখালের পাশ দিয়ে যাচ্ছিলেন। আবূ বাকর সিদ্দীক (রাঃ) বলেন, তখন আমি একটি বাটি নিয়ে এতে কিছু দুধ দোহন করে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে নিয়ে এলাম, তিনি এমনভাবে তা পান করলেন যে, আমি তাতে সন্তুষ্ট হয়ে গেলাম। (৫৪৬৯, মুসলিম ৩৮/৫, হাঃ নং ২১৪৬) (আধুনিক প্রকাশনীঃ ৩৬২০, ইসলামিক ফাউন্ডেশনঃ ৩৬২৪)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 3909,
			"arabicnumber": 3909,
			"text": "আসমা (রাঃ) হতে বর্ণিত, তিনি বলেন, তখন তাঁর পেটে ছিলেন আবদুল্লাহ্ ইবনু যুবায়ের, তিনি বলেন, আমি এমন সময় হিজরাত করি যখন আমি আসন্ন প্রসবা। আমি মদিনায় এসে কুবা’তে অবতরণ করি। এ কুবায়ই আমি পুত্র সন্তানটি প্রসব করি। এরপর আমি তাকে নিয়ে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে এসে তাঁর কোলে দিলাম। তিনি একটি খেজুর আনালেন এবং তা চিবিয়ে তার মুখে থুথু দিলেন। কাজেই সর্বপ্রথম যে বস্তুটি আবদুল্লাহর পেটে গেল তা হল নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর থুথু। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সামান্য চিবানো খেজুর নবজাতকের মুখের ভিতরের তালুর অংশে লাগিয়ে দিলেন। এরপর তার জন্য দু’আ করলেন এবং বরকত চাইলেন। তিনি হলেন প্রথম নবজাতক সন্তান যিনি হিজরাতের পর মুসলিম পরিবারে জন্মলাভ করেন। খালিদ ইবনু মাখলদ (রহ.) উক্ত রেওয়ায়াত বর্ণনায় যাকারিয়া ইবনু ইয়াহ্ইয়া (রহ.)-এর অনুসরণ করেছেন। এতে রয়েছে যে, আসমা (রাঃ) গর্ভবতী অবস্থায় হিজরাত করে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট আসেন। (আধুনিক প্রকাশনীঃ ৩৬২১, ইসলামিক ফাউন্ডেশনঃ ৩৬২৫)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 3910,
			"arabicnumber": 3910,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত, তিনি বলেন, (হিজরাতের পর) মুসলিম পরিবারে সর্বপ্রথম আবদুল্লাহ ইবনু যুবায়েরই জন্মলাভ করেন। তাঁরা তাকে নিয়ে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে এলেন। তিনি একটি খেজুর চিবিয়ে তার মুখে দিলেন। কাজেই প্রথম যে জিনিসটি তার পেটে গেল তা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর থুথু। (আধুনিক প্রকাশনীঃ ৩৬২২, ইসলামিক ফাউন্ডেশনঃ ৩৬২৬)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 3911,
			"arabicnumber": 3911,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত, তিনি বলেন, আল্লাহর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন মদিনা্য় এলেন তখন উষ্ট্রে পৃষ্ঠে আবূ বাকর (রাঃ) তাঁর পশ্চাতে ছিলেন। আবূ বাকর (রাঃ) ছিলেন বয়োজ্যেষ্ঠ১ ও পরিচিত। আর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ছিলেন জাওয়ান এবং অপরিচিত। তখন বর্ণনাকারী বলেন, যখন আবূ বকরের সঙ্গে কারো সাক্ষাৎ হত, সে জিজ্ঞেস করত হে আবূ বাকর (রাঃ)! তোমার সম্মুখে উপবিষ্ট ঐ ব্যক্তি কে? আবূ বাকর (রাঃ) বলতেন, তিনি আমার পথ প্রদর্শক। রাবী বলেন, প্রশ্নকারী সাধারণ পথ মনে করত এবং তিনি সত্যপথ উদ্দেশ্য করতেন। তারপর একবার আবূ বাকর (রাঃ) পিছনে চেয়ে হঠাৎ দেখতে পেলেন এক ঘোড় সওয়ার তাদের কাছেই এসে পড়েছে। তখন তিনি বললেন, হে আল্লাহর রাসূল! এই যে একজন ঘোড় সওয়ার আমাদের পিছনে প্রায় কাছে পৌঁছে গেছে। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পিছনের দিকে তাকিয়ে দু’আ করলেন, হে আল্লাহ্! আপনি ওকে পাকড়াও করুন। তৎক্ষণাৎ ঘোড়াটি তাকে নীচে ফেলে দিয়ে দাঁড়িয়ে হরেষা রব করতে লাগল। তখন ঘোড় সওয়ার বলল, হে আল্লাহর নবী! আপনার যা ইচ্ছা আমাকে আদেশ করুন। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তুমি স্বস্থানেই থেমে যাও। কেউ আমাদের দিকে আসতে চাইলে তুমি তাকে বাধা দিবে। বর্ণনাকারী বলেন, দিনের প্রথম অংশে ছিল সে নবীর বিরুদ্ধে যুদ্ধকারী আর দিনের শেষাংশে হয়ে গেল তাঁর পক্ষ হতে অস্ত্রধারী। এরপর রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মদিনার হাররার২ একপাশে অবতরণ করলেন। এরপর আনসারদের খবর দিলেন। তাঁরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে এলেন এবং উভয়কে সালাম করে বললেন, আপনারা নিরাপদ ও মান্য হিসেবে আরোহণ করুন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও আবূ বাকর (রাঃ) উটে আরোহণ করলেন আর আনসারগণ অস্ত্রে সজ্জিত হয়ে তাঁদেরকে ঘিরে চলতে লাগলেন। মদিনা্য় লোকেররা বলতে লাগল, আল্লাহর নবী এসেছেন, আল্লাহর নবী এসেছেন, লোকজন উঁচু স্থানে উঠে তাঁদের দেখতে লাগল। আর বলতে লাগল আল্লাহর নবী এসেছেন, আল্লাহর নবী এসেছেন। তিনি সম্মুখ পানে চলতে লাগলেন। শেষে আবূ আইয়ুব (রাঃ)-এর বাড়ির পার্শ্বে গিয়ে অবতরণ করলেন। আবূ আইয়ুব (রাঃ) ঐ সময় তাঁর পরিবারের লোকদের সাথে কথাবার্তা বলছিলেন। ইতোমধ্যে ‘আবদুল্লাহ ইবনু সালাম তাঁর আগমনের কথা শুনলেন তখন তিনি তাঁর নিজের বাগানে খেজুর সংগ্রহ করছিলেন। তখন তিনি শীঘ্র ফল সংগ্রহ করা হতে বিরত হলেন এবং সংগৃহীত খেজুরসহ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট হাযির হলেন এবং নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কিছু কথাবার্তা শুনে নিজ গৃহে ফিরে গেলেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আমাদের লোকদের মধ্যে কার বাড়ি এখান হতে সবচেয়ে নিকটে? আবূ আইয়ুব (রাঃ) বললেন, হে আল্লাহর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম! এই তো বাড়ী, এই যে তার দরজা। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তবে চল, আমাদের বিশ্রামের ব্যবস্থা কর। তিনি বললেন, আপনারা দু’জনেই চলুন। আল্লাহ্ বরকত দানকারী। যখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর বাড়িতে এলেন তখন আবদুল্লাহ ইবনু সালাম (রাঃ) আসলেন এবং বললেন, আমি সাক্ষ্য দিচ্ছি যে, আপনি আল্লাহর রাসূল; আপনি সত্য নিয়ে এসেছেন। হে আল্লাহর রাসূল! ইয়াহূদী সম্প্রদায় জানে যে আমি তাদের নেতা এবং আমি তাদের নেতার পুত্র। আমি তাদের মধ্যে বেশি জ্ঞানী এবং তাদের বড় জ্ঞানী সন্তান। আমি ইসলাম গ্রহণ করেছি এ কথাটি জানাজানি হওয়ার পূর্বে আপনি তাদের ডাকুন এবং আমার ব্যাপারে জিজ্ঞেস করুন, আমার সম্পর্কে তাদের ধারণা জ্ঞাত হন। কেননা তারা যদি জানতে পারে যে আমি ইসলাম গ্রহণ কেরছি, তবে আমার সম্বন্ধে তারা এমন সব অলীক কথা বলবে যা আমার মধ্যে নেই। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (ইয়াহূদী সম্প্রদায়কে) ডেকে পাঠালেন। তারা এসে তার কাছে হাযির হল। রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের বললেন, হে ইয়াহূদী সম্প্রদায়, তোমাদের উপর অভিশাপ! তোমরা সেই আল্লাহকে ভয় কর, তিনি ছাড়া মাবুদ নেই। তোমরা নিশ্চয়ই জান যে আমি সত্য রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সত্য নিয়েই তোমাদের নিকট এসেছি। সুতরাং তোমার ইসলাম গ্রহণ কর। তারা উত্তর দিল, আমরা এসব জানিনা। তারা তিনবার একথা বলল। তারপর তিনি জিজ্ঞেস করলেন, তোমাদের মধ্যে আবদুল্লাহ ইবনু সালাম (রাঃ) কেমন লোক? তারা উত্তর দিল, তিনি আমাদের নেতা এবং আমাদের নেতার সন্তান। তিনি আমাদের সর্বশ্রেষ্ঠ আলিম এবং সর্বশ্রেষ্ঠ আলিমের পুত্র। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তিনি যদি ইসলাম গ্রহণ করেন, তবে তোমাদের মতামত কী হবে? তারা বলল, আল্লাহ্ হিফাযত করুন। তিনি ইসলাম গ্রহণ করবেন তা কিছুতেই হতে পারে না। তিনি আবার বললেন, আচ্ছা বলতো, যদি তিনি ইসলাম গ্রহণ করেন তবে তোমরা কী মনে করবে? তারা আবার বলল, আল্লাহ্ হেফাজত করুন, কিছুতেই তিনি ইসলাম গ্রহণ করতে পারেন না। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আবার বললেন, আচ্ছা বলতো, তিনি যদি মুসলিম হয়েই যান তবে তোমাদের মত কী? তারা বলল, আল্লাহ্ হিফাযত করুন, তিনি মুসলিম হয়ে যাবেন তা কিছুতেই হতে পারে না। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, হে ইবনু সালাম! তুমি এদের সামনে বেরিয়ে আস। তিনি বেরিয়ে আসলেন এবং বললেন, হে ইয়াহূদী সম্প্রদায়। আল্লাহকে ভয় কর। ঐ আল্লাহর কসম, যিনি ছাড়া কোন মা’বুদ নেই। তোমরা নিশ্চয়ই জান তিনি সত্য রাসূল, হক নিয়েই এসেছেন। তখন তারা বলে উঠল, তুমি মিথ্যা বলছ। তারপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদেরকে বের করে দিলেন। (৩৩২৯) (আধুনিক প্রকাশনীঃ ৩৬২৩, ইসলামিক ফাউন্ডেশনঃ ৩৬২৭)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 3912,
			"arabicnumber": 3912,
			"text": "‘উমার ইবনু খাত্তাব (রাঃ) হতে বর্ণিত যে, তিনি প্রাথমিক পর্যায়ের মুহাজিরদের জন্য চার কিস্তিতে বাৎসরিক চার হাজার দিরহাম ধার্য করলেন এবং ইবনু ‘উমারের জন্য নির্বাচন করলেন তিনি হাজার পাঁচশ। তাঁকে বলা হল, তিনিও তো মুহাজিরদের। তাঁর জন্য চার হাজার হতে কম কেন করলেন? তিনি বললেন, সে তো তার পিতা-মাতার সাথে হিজরাত করেছে। কাজেই সে ঐ লোকের সমান হতে পারে না যে লোক একাকী হিজরাত করেছে। (আধুনিক প্রকাশনীঃ ৩৬২৪, ইসলামিক ফাউন্ডেশনঃ ৩৬২৮)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 3913,
			"arabicnumber": 3913,
			"text": "",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 3914,
			"arabicnumber": 3914,
			"text": "",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 3915,
			"arabicnumber": 3915,
			"text": "আবূ বুরদাহ ইবনু আবূ মূসা আশ‘আরী (রাঃ) হতে বর্ণিত, তিনি বলেন, আবদুল্লাহ ইবনু ‘উমার (রাঃ) আমাকে বললেন, তুমি কি জান আমার পিতা তোমার পিতাকে কী বলেছিলেন? আমি বললাম, না। তিনি বললেন, আমার পিতা তোমার পিতাকে বলেছিলেন, হে আবূ মূসা, তুমি কি এতে সন্তুষ্ট আছ যে, আমরা রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর হাতে ইসলাম গ্রহণ করেছি, তাঁর সঙ্গে হিজরাত করেছি, তাঁর সঙ্গে জিহাদ করেছি এবং তাঁর জীবদ্দশায় করা আমাদের প্রতিটি আমল যা করেছি তা আমাদের জন্য সঞ্চিত থাকুক। তাঁর মৃত্যুর পর, আমরা যে সব আমল করেছি, তা আমাদের জন্য সমান সমান হোক। তখন তোমার পিতা আবূ মূসা (রাঃ) বললেন, না কেননা, আল্লাহর কসম, আমরা রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর পর জিহাদ করেছি, সালাত আদায় করেছি, সাওম পালন করেছি এবং বহু নেক আমল করেছি। আমাদের হাতে অনেক মানুষ ইসলাম গ্রহণ করেছে। আমরা এসব কাজের সাওয়াব-এর আশা রাখি। তখন আমার পিতা [‘উমার (রাঃ)] বললেন, কিন্তু আমি ঐ সত্তার কসম, যাঁর হাতে ‘উমারের প্রাণ, এতেই সন্তুষ্ট যে, (আগের ‘আমল) আমাদের জন্য সঞ্চিত থাকুক আর তাঁর মৃত্যুর পর আমরা যে সব আমল করেছি তা হতে যেন আমরা রেহাই পাই সমান সমানভাবে। তখন আমি বললাম, আল্লাহর কসম নিশ্চয়ই তোমার পিতা আমার পিতা হতে উত্তম। (আধুনিক প্রকাশনীঃ ৩৬২৬, ইসলামিক ফাউন্ডেশনঃ ৩৬৩০)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 3916,
			"arabicnumber": 3916,
			"text": "আবূ ‘উসমান (রহ.) বলেন, আমি ইবনু ‘উমার (রাঃ)-কে বলতে শুনেছি যে, তাঁকে একথা বলা হলে, \"আপনি আপনার পিতার আগে হিজরাত করেছেন\" তিনি রাগ করতেন। ইবনু ‘উমার (রাঃ) বলেন, আমি এবং ‘উমার (রাঃ) রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট হাযির হলাম। তখন তাঁকে কায়লুলাহ অবস্থায় পেলাম। কাজেই আমরা আমাদের আবাসস্থলে ফিরে এলাম। কিছুক্ষণ পর ‘উমার (রাঃ) আমাকে পাঠালেন এবং বললেন যাও; গিয়ে দেখ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জেগেছেন কিনা? আমি এসে তাঁর কাছে হাযির হলাম এবং তাঁর কাছে বায়‘আত করলাম। তারপর ‘উমার (রাঃ) এর নিকট এসে তাঁকে খবর দিলাম যে, তিনি জেগে গেছেন। তখন আমরা তাঁর নিকট গেলাম দ্রুতবেগে। তিনি তাঁর কাছে প্রবেশ করে বায়‘আত করলেন। তারপর আমিও নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর হাতে আবার বায়‘আত করলাম। (৪১৮৬, ৪১৮৭) (আধুনিক প্রকাশনীঃ ৩৬২৮, ইসলামিক ফাউন্ডেশনঃ ৩৬৩১)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 3917,
			"arabicnumber": 3917,
			"text": "আবূ ইসহাক (রহ.) বলেন, আমি বারা (রাঃ)-কে বলতে শুনেছি, তিনি বলেন, আবূ বাকর(রাঃ) আমার পিতা আযিব (রাঃ)-এর নিকট হাওদা কিনলেন। আমি আবূ বাকরের সাথে কেনা হাওদাটি বয়ে নিয়ে চললাম। তখন আমার পিতা আযিব (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে তাঁর হিজাতের ঘটনা সম্পর্কে জিজ্ঞেস করলেন। তখন আবূ বাকর (রাঃ) বললেন, আমাদের খোঁজ করার জন্য মুশরিকরা লোক নিয়োগ করছিল। অবশেষে আমরা রাত্রিকালে বেরিয়ে পড়লাম এবং একরাত ও একদিন একটানা চলতে থাকলাম। যখন দুপুর হয়ে গেল, তখন একটি বিরাট পাথর নযরে পড়ল। আমরা সেটির কাছে এলাম, পাথরটির কিছু ছায়া পড়ছিল। আমি সেখানে গিয়ে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর জন্য আমার সঙ্গের চামড়াখানি বিছিয়ে দিলাম। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ওটার উপর শুয়ে পড়লেন। আমি এদিক-ওদিক খোঁজ নেয়ার জন্য বেরিয়ে পড়লাম। হঠাৎ এক বকরীর রাখালকে দেখতে পেলাম। সে তার বকরীগুলো নিয়ে আসছে। সেও আমাদের মত পাথরের ছায়ায় আশ্রয় নিতে চায়। আমি তাকে জিজ্ঞেস করলাম, তুমি কার গোলাম? সে বলল, আমি অমুকের। আমি তাকে জিজ্ঞেস করলাম, তোমার বকরীর পালে দুধ আছে কি? সে বলল, হাঁ। আমি বললাম, তুমি কি কিছু দোহন করে দিবে? সে বলল, হাঁ। সে তাঁর পাল হতে একটি বকরী ধরে নিয়ে এল। আমি বললাম, বকরীর স্তন দু’টি ঝেড়ে মুছে সাফ করে নাও। সে একপাত্র ভর্তি দুধ দোহন করল। আমার সাথে একটি পানির পাত্র ছিল। আমি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর জন্য কাপড় দিয়ে তার মুখ বেঁধে রেখেছিলাম। আমি তা হতে দুধের মধ্যে কিছু পানি ঢেলে দিলাম। ফলে পাত্রের তলা পর্যন্ত শীতল হয়ে গেল। আমিতা নিয়ে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে এসে বললাম, পান করুন, ইয়া রাসূলাল্লাহ্! রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এমনভাবে পান করলেন যে, আমি সন্তুষ্ট হলাম। এরপর আমরা যাত্রা করলাম এবং অনুসন্ধানকারী আমাদের পিছনে ছিল। (২৪৩৯) (আধুনিক প্রকাশনীঃ ৩৬২৯, ইসলামিক ফাউন্ডেশনঃ ৩৬৩২ প্রথমাংশ)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 3918,
			"arabicnumber": 3918,
			"text": "বারা (রাঃ) বলেন, আমি আবূ বকরের সঙ্গে তাঁর ঘরে ঢুকালাম।* তখন দেখলাম তাঁর মেয়ে ‘আয়িশাহ (রাঃ) বিছানায় শুয়ে আছেন। তাঁর জ্বর হয়েছে। তাঁর পিতা আবূ বাকর (রাঃ)-কে দেখলাম তিনি মেয়ের গালে চুমু ** খেলেন এবং জিজ্ঞেস করলেন, মা তুমি কেমন আছ? (আধুনিক প্রকাশনীঃ ৩৬২৯, ইসলামিক ফাউন্ডেশনঃ ৩৬৩২ শেষাংশ)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 3919,
			"arabicnumber": 3919,
			"text": "৩৯১৯। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর খাদিম আনাস (রাঃ) হতে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মদিনা্য় আগমন করলেন। এই সময় তাঁর সাহাবীদের মধ্যে সাদা কাল চুলওয়ালা আবূ বাকর (রাঃ) ছাড়া অন্য কেউ ছিলেন না। তিনি তাঁর চুলে মেহদী ও কতম (এক প্রকার পাতা) একত্র করে কলপ লাগিয়েছিলেন। (৩৯২০)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 3920,
			"arabicnumber": 3920,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মদিনায় এলেন, তখন তাঁর সাহাবীদের মধ্যে আবূ বাকর (রাঃ) ছিলেন সবচেয়ে বয়স্ক। তিনি মেহেদী ও কতম একত্র করে কলপ লাগিয়েছিলেন। এতে তাঁর সাদা চুল টুকটুকে লাল রং ধারণ করেছিল। (৩৯১৯) (আধুনিক প্রকাশনীঃ ৩৬৩০, ইসলামিক ফাউন্ডেশনঃ ৩৬৩৩)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 3921,
			"arabicnumber": 3921,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত, তিনি বলেন, আবূ বাকর (রাঃ) কালব গোত্রের উম্মে বাকর নাম্নী এক মহিলাকে বিয়ে করলেন। যখন আবূ বাকর (রাঃ) হিজরাত করেন, তখন তাকে তালাক দিয়ে যান। তারপর ঐ মহিলাকে তার চাচাত ভাই বিয়ে করে নিল। এই লোকটিই হল সেই কবি যে বদর যুদ্ধে নিহত কুরাইশ কাফিরদের শোকগাঁথা রচনা করেছিল। বাদ্র প্রান্তে কালীব নামক কূপে নিক্ষিপ্ত ঐ সব কাফিরগণ আজ কোথায় যাদের শিযা নামক কাঠের তৈরি খাদ্য-পাত্রে উটের কুঁজের গোশতে সুসজ্জিত থাকত। বদরের কালীব কূপে নিক্ষিপ্ত ব্যক্তিগণ আজ কোথায় যারা গায়িকা ও সম্মানিত মদ্যপানকারী নিয়ে নিমগ্ন ছিল। উম্মু বাকর শান্তির স্বাগত জানাচ্ছে। আর আমার কাওমের পর আমার জন্য শান্তি কোথায়? রাসূল আমাদের বলেছেন যে, শীঘ্রই আমাদের জীবিত করা হবে। কিন্তু চলে যাওয়া আত্মা ও মাথার খুলির জীবন ফিরবে আবার কিভাবে?’’ (আধুনিক প্রকাশনীঃ ৩৬৩১, ইসলামিক ফাউন্ডেশনঃ ৩৬৩৪)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 3922,
			"arabicnumber": 3922,
			"text": "আবূ বাকর (রাঃ) হতে বর্ণিত, তিনি বলেন, আমি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে গুহায় ছিলাম। আমি আমার মাথা উঠিয়ে উপরের দিকে তাকালাম এবং লোকের পা দেখতে পেলাম। তখন আমি বললাম, হে আল্লাহর নবী! তাদের কেউ নীচের দিকে তাকালেই আমাদের দেখে ফেলবে। তিনি বললেন, হে আবূ বাকর! চুপ থাক। আমরা দু’জন আল্লাহ্ হলেন যাদের তৃতীয়। (৩৬৫৩) (আধুনিক প্রকাশনীঃ ৩৬৩২, ইসলামিক ফাউন্ডেশনঃ ৩৬৩৫)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 3923,
			"arabicnumber": 3923,
			"text": "আবূ সাঈদ (রাঃ) হতে বর্ণিত, তিনি বলেন, একজন বেদুঈন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে এল এবং তাঁকে হিজরাত সম্পর্কে জিজ্ঞেস করল। তিনি বললেন, ওহে! হিজরাত বড় কঠিন কাজ। এরপর বললেন, তোমার কি উট আছে? সে বলল, হাঁ। তিনি বললেন, তুমি কি উটের সাদকা আদায় কর? সে বলল, হাঁ। তিনি বললেন, তুমি কি উটনীর দুধ অন্যকে পান করতে দাও। সে বলল, হাঁ। তিনি বললেন, যেদিন পানি পান করানোর উদ্দেশ্যে উটগুলি ঘাটে নিয়ে যাওয়া হয় সেদিন কি তুমি দুধ দোহন করে দান কর? সে বলল, হাঁ। তিনি বললেন, তবে তুমি সমুদ্রের অপর প্রাপ্ত থেকেই নেক ‘আমল করতে থাক। নিশ্চয়ই আল্লাহ্ তোমার ‘আমলের কিছুই ঘাটতি করবেন না।* (১৪৫২) (আধুনিক প্রকাশনীঃ ৩৬৩৩, ইসলামিক ফাউন্ডেশনঃ ৩৬৩৬)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 3924,
			"arabicnumber": 3924,
			"text": "বারা (রাঃ) হতে বর্ণিত, তিনি বলেন, সর্বাগ্রে আমাদের মধ্যে মদিনা্য় আগমন করেন মুস‘আব ইবনু উমায়ের ও ইবনু উম্মু মাকতুম (রাঃ)। অতঃপর আমাদের কাছে আসেন আম্মার ইবনু ইয়াসির ও বিলাল (রাঃ) (৩৯২৫, ৪৯৪১, ৪৯৯৫) (আধুনিক প্রকাশনীঃ ৩৬৩৪, ইসলামিক ফাউন্ডেশনঃ ৩৬৩৭)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 3925,
			"arabicnumber": 3925,
			"text": "বারা‘ ইবনু আযিব (রাঃ) হতে বর্ণিত, তিনি বলেন, সর্বাগ্রে আমাদের মধ্যে মদিনা্য় আসলেন মুস‘আব ইবনু উমায়ের এবং ইবনু উম্মু মাকতুম। তারা লোকদের কুরআন পড়াতেন। তারপর আসলেন, বিলাল, সা‘দ ও আম্মার ইবনু ইয়াসির (রাঃ) এরপর ‘উমার ইবনু খাত্তাব (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর বিশজন সাহাবীসহ মদিনায় আসলেন। তারপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আগমন করলেন। তাঁর আগমনে মদিনাবাসী যতখানি আনন্দিত হয়েছিল ততখানি আনন্দিত হতে কখনো দেখিনি। এমনকি দাসীগণও বলছিল, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম শুভাগমন করেছেন। বারা (রাঃ) বলেন, তাঁর আগমনের পূর্বেই মুফাস্সালের* কয়েকটি সূরাহসহ আমি سَبِّحْ اسْمَ رَبِّكَ الأَعْلَى সূরাহ পর্যন্ত পড়ে ফেলেছিলাম। (৩৯২৪) (আধুনিক প্রকাশনীঃ ৩৬৩৫, ইসলামিক ফাউন্ডেশনঃ ৩৬৩৮)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 3926,
			"arabicnumber": 3926,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন মদিনায় আসলেন, তখন আবূ বাকর ও বিলাল (রাঃ) ভীষণ জ্বরে আক্রান্ত হয়ে পড়লেন। আমি তাদেরকে দেখতে গেলাম এবং বললাম, আববাজান, কেমন আছেন? হে বিলাল, আপনি কেমন আছেন? ‘আয়িশাহ (রাঃ) বলেন, আবূ বাকর (রাঃ) জ্বরে পড়লেই এ পংক্তিগুলি আবৃত্তি করতেন। ‘‘প্রতিটি ব্যক্তিকে নিজ পরিবারে সুপ্রভাত বলা হয় অথচ মৃত্যু তার জুতার ফিতার চাইতেও অতি নিকটে।’’ আর বিলাল (রাঃ)-এর অবস্থা ছিল এই যখন তাঁর জ্বর ছেড়ে যেত তখন কন্ঠস্বর উঁচু করে এ কবিতাটি আবৃত্তি করতেনঃ ‘‘হায়, আমি যদি জানতাম আমি এ মক্কা উপত্যকায় আবার রাত্রি কাটাতে পারব কিনা যেখানে ইয্খির ও জলীল ঘাস আমার চারপাশের বিরাজমান থাকত। হায়, আর কি আমার ভাগ্যে জুটবে যে, আমি মাজান্নাহ নামক কূপের পানি পান করতে পারব! এবং শামাহ ও তাফিল পাহাড় কি আর আমার চোখে পড়বে!’’ ‘আয়িশাহ (রাঃ) বলেন, আমি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট গিয়ে এ সংবাদ জানালাম। তখন তিনি এ দু’আ করলেন, হে আল্লাহ্! মদিনাকে আমাদের প্রিয় করে দাও যেমন প্রিয় ছিল আমাদের মক্কা বরং তার থেকেও অধিক প্রিয় করে দাও। আমাদের জন্য মদিনাকে স্বাস্থ্যকর করে দাও। মদিনার সা ও মুদ এর মধ্যে বকরত দান কর। আর এখানকার জ্বরকে সরিয়ে জুহ্ফায় নিয়ে যাও। (১৮৮৯) (আধুনিক প্রকাশনীঃ ৩৬৩৬, ইসলামিক ফাউন্ডেশনঃ ৩৬৩৯)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 3927,
			"arabicnumber": 3927,
			"text": "‘উবাইদুল্লাহ ইবনু ‘আদী (রহ.) বলেন, আমি ‘‘উসমান (রাঃ)-এর ঘরে প্রবেশ করলাম। তিনি আমার বক্তব্য শুনার পর তাশাহ্হুদ পাঠের পর বললেন, আম্মা বা‘দু। আল্লাহ্ তা‘আলা মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে সত্যসহ প্রেরণ করেছেন। যারা আল্লাহ্ ও তাঁর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর আহবানে সাড়া দিয়েছিলেন, মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে যে সত্যসহ প্রেরণ করা হয়েছিল তৎপ্রতি ঈমান এনেছিলেন আমিও তাঁদের মধ্যে ছিলাম। উভয় হিজরাতে[১] অংশ নিয়েছি। আমি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর জামাতা হওয়ার সৌভাগ্য লাভ করেছি। আমি তাঁর হাতে বায়‘আত করেছি, আল্লাহর শপথ আমি কখনো তাঁর নাফরমানী করিনি তাঁর সাথে প্রতারণা করিনি। এই অবস্থায় তাঁর মৃত্যু হয়েছে। (৩৬৯৬) ইসহাক কালবী শু‘য়ায়বের অনুসরণ করে যুহরী সূত্রে এ রকমই বর্ণনা করেছেন। (আধুনিক প্রকাশনীঃ ৩৬৩৭, ইসলামিক ফাউন্ডেশনঃ ৩৬৪০)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 3928,
			"arabicnumber": 3928,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণনা করেন, যে বছর ‘উমার (রাঃ) শেষ হাজ্জ আদায় করেন সে বছর ‘আবদুর রহমান ইবনু ‘আউফ (রাঃ) মিনায় তাঁর পরিবারের কাছে ফিরে আসেন এবং সেখানে আমার সাথে তাঁর সাক্ষাৎ হয়। ‘আবদুর রহমান (রাঃ) বললেন, হে আমীরুল মুমিনীন, হাজ্জ মওসুমে বুদ্ধিমান ও বুদ্ধিহীন সব রকমের মানুষ জড় হয়। তাই আমার বিবেচনায় আপনি ভাষণ দান করবেন না এবং মদিনা গিয়ে ভাষণ দান করুন। মদিনা হল দারুল হিজরাত, (হিজরাতের স্থান) রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সুন্নাতের পবিত্র ভূমি। সেখানে আপনি অনেক জ্ঞানী, গুণী ও বুদ্ধিদীপ্ত লোককে একত্র পাবেন। ‘উমার (রাঃ) বললেন, মদিনায় গিয়েই প্রথমেই অবশ্যই আমার ভাষণ দিব। (২৪৬২) (আধুনিক প্রকাশনীঃ ৩৬৩৮, ইসলামিক ফাউন্ডেশনঃ ৩৬৪১)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 3929,
			"arabicnumber": 3929,
			"text": "খারিজাহ ইবনু যায়দ ইবনু সাবিত (রাঃ) বলেন, উম্মুল ‘আলা’ (রাঃ) নাম্নী এক আনসারী মহিলা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর হাতে বায়‘আত করেন। তিনি বর্ণনা করেন, যখন মুহাজিরদের বাসস্থানের ব্যাপারে আনসারদের মধ্যে লটারী হয় তখন ‘উসমান ইবনু মায‘উনের বসবাস আমাদের অংশে পড়ল। উম্মুল ‘আলা (রাঃ) বলেন, এরপর তিনি আমাদের এখানে এসে অসুস্থ হয়ে পড়েন। আমি তার সেবা শুশ্রূষা করলাম, কিন্তু শেষ পর্যন্ত তাঁর মৃত্যু হয়ে গেল। আমরা কাফনের কাপড় পরিয়ে দিলাম। তারপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের এখানে আসলেন। ঐ সময় আমি ‘উসমান (রাঃ)-কে লক্ষ্য করে বলছিলাম। হে আবূ সায়িব! তোমার উপর আল্লাহর রহমত হোক। তোমার সম্পর্কে আমি সাক্ষ্য দিচ্ছি যে, আল্লাহ্ নিশ্চয়ই তোমাকে সম্মানিত করেছেন। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে জিজ্ঞেস করলেন, তুমি কেমন করে জানলে যে, আল্লাহ্ তাকে সম্মানিত করেছেন? আমি বললাম, আমার মাতা-পিতা আপনার উপর কুরবান হোক। হে আল্লাহর রাসূল! আমি তো জানি না। তবে কাকে আল্লাহ্ সম্মানিত করবেন? নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আল্লাহর শপথ! ‘উসমানের মৃত্যু হয়ে গেছে। আল্লাহর কসম! আমি তার সম্পর্কে কল্যাণের আশা পোষণ করছি। আল্লাহর কসম, আমি আল্লাহর রাসূল হওয়া সত্ত্বেও জানিনা আল্লাহ আমার সাথে কী ব্যবহার করবেন। উম্মুল ‘আলা’ (রাঃ) বলেন, আল্লাহর শপথ, আমি এ কথা শুনার পর আর কাউকে পূত-পবিত্র বলব না। উম্মুল ‘আলা’ (রাঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর এ কথা আমাকে চিন্তিত করল। এরপর আমি স্বপ্নে দেখতে পেলাম যে, ‘‘উসমান ইবনু মায‘উন (রাঃ)-এর জন্য একটি নহর জারি রয়েছে। আমি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট গিয়ে আমার স্বপ্নটি বললে তিনি বললেন, এ হচ্ছে তার সৎ ‘আমল’’। (১২৪৩) (আধুনিক প্রকাশনীঃ ৩৬৩৯, ইসলামিক ফাউন্ডেশনঃ ৩৬৪২)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 3930,
			"arabicnumber": 3930,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত, তিনি বলেন, বু‘আস যুদ্ধ এমন একটি যুদ্ধ ছিল যা আল্লাহ্ তাঁর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর পক্ষে তাঁর হিজরাতের পূর্বেই সংঘটিত করিয়েছিলেন, যা তাদের ইসলাম গ্রহণের ব্যাপারে সহায়ক হয়েছিল। রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন মদিনায় আসলেন তখন তাদের গোত্রগুলো ইসলাম গ্রহণের ব্যাপারে নানা দলে ভাগ হয়ে গিয়েছিল এবং তাদের অনেক নেতা নিহত হয়েছিল। (৩৭৭৭) (আধুনিক প্রকাশনীঃ ৩৬৪০, ইসলামিক ফাউন্ডেশনঃ ৩৬৪৩)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 3931,
			"arabicnumber": 3931,
			"text": "‘ ‘আয়িশাহ (রাঃ) হতে বর্ণিত যে, আবূ বাকর (রাঃ) ঈদুল তিফত্র অথবা ঈদুল আযহার দিনে তাঁকে দেখতে এলেন। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ‘ ‘আয়িশাহ (রাঃ)-এর বাড়ীতে অবস্থান করছিলেন। এ সময় দু’জন অল্প বয়স্কা বালিকা এ কবিতাটি উচ্চস্বরে আবৃত্তি করছিল যা আনসারগণ বু‘আস যুদ্ধে আবৃত্তি করেছিল। তখন আবূ বাকর (রাঃ) দু‘বার বললেন, এ হল শয়তানের ঢাল। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, হে আবূ বাকর, ওদেরকে ছাড়। প্রত্যেক সম্প্রদায়েরই ‘ঈদ আছে আর আজ হল আমাদের ‘ঈদের দিন। (৯৪৯) (আধুনিক প্রকাশনীঃ ৩৬৪১, ইসলামিক ফাউন্ডেশনঃ ৩৬৪৪)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 3932,
			"arabicnumber": 3932,
			"text": "আনাস ইবনু মালিক (রাঃ) বর্ণনা করেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন মদিনা্য় আসলেন তখন মদিনার উঁচু এলাকার ‘আমর ইবনু ‘আউফ গোত্রে অবস্থান করলেন। আনাস (রাঃ) বলেন, সেখানে তিনি চৌদ্দ দিন থাকলেন। এরপর তিনি বানু নাজ্জারের নেতৃস্থানীয় লোকেদের কাছে খবর পাঠালেন। তারা সকলেই তরবারি ঝুলিয়ে হাযির হলেন। আনাস (রাঃ) বলেন, সেই দৃশ্য এখনো যেন আমি দেখতে পাচ্ছি। রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর সওয়ারীর উপর এবং আবূ বাকর (রাঃ) তাঁর পিছনে উপবিষ্ট রয়েছেন, আর বনু নাজ্জারের নেতাগণ রয়েছেন তাদের পার্শ্বে। অবশেষে আবূ আইউব (রাঃ)-এর বাড়ির চত্বরে তিনি সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর মালপত্র নামালেন। রাবী বলেন, ঐ সময় রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যেখানেই সালাতের সময় হত সেখানেই সালাত আদায় করে নিতেন। এবং তিনি কোন কোন সময় ছাগল-ভেড়ার খোঁয়াড়েও সালাত আদায় করতেন। রাবী বলেন, তারপর তিনি মাসজিদ তৈরির নির্দেশ দিলেন। তিনি বনী নাজ্জারের নেতাদের ডাকলেন এবং তারা এলে তিনি বললেন, তোমাদের এ বাগানটি আমার নিকট বিক্রি কর। তারা বলল, আল্লাহর শপথ, আমরা বিক্রি করব না। আল্লাহ শপথ-এর বিনিময় আল্লাহর নিকটই চাই। রাবী বলেন, এখানে কি ছিল, আমি তোমাদের বলছি স্থানে তখন ছিল মুশরিকদের পুরাতন কবর, বাড়ী ঘরের কিছু ভগ্নাবশেষ কয়েকটি খেজুরের গাছ। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নির্দেশে মুশরিকদের কবরগুলি মিশিয়ে দেয়া হল। ভগ্ন চিহ্ন সমতল করা হল, খেজুর গাছগুলি কেটে ফেলা হল। রাবী বলে, কাটা খেজুর গাছের কান্ডগুলি মসজিদের কেবলার দিকে এর খুঁটি হিসেবে এক লাইনে স্থাপন করা হল এবং খুঁটির ফাঁকা স্থানে রাখা হল পাথর। তখন সহাবাগণ পাথর বয়ে আনছিলেন এবং ছন্দ যুক্ত কবিতা আবৃত্তি করছিলেনঃ আর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তখন তাদের সঙ্গে ছিলেন এবং বলেছিলেন, হে আল্লাহ্! আসল কল্যাণ কেবলমাত্র আখিরাতের কল্যাণ। হে আল্লাহ্! তুমি মুহাজির ও আনসারদের সাহায্য কর। (২৩৪১) (আধুনিক প্রকাশনীঃ ৩৬৪২, ইসলামিক ফাউন্ডেশনঃ ৩৬৪৫)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 3933,
			"arabicnumber": 3933,
			"text": "‘উমার ইবনু আবদুল ‘আযীয (রহ.) হতে বর্ণিত। তিনি সাইব ইবনু উখতিননাম্র (রাঃ) কে জিজ্ঞস করলেন, আপনি মক্কা্য় অবস্থান ব্যাপারে কী শুনেছেন? তিনি বললেন, আমি ‘আলা ইবনুল হাযরামী (রাঃ)-এর কাছে শুনেছি, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, মুহাজিরদের জন্য তাওয়াফে সদর [১] আদায় করার পর তিন দিন মক্কা্য় থাকার অনুমতি আছে। [২] (মুসলিম ১৫/৮১, হাঃ নং ১৩৫২, আহমাদ ২০৫৪৮) (আধুনিক প্রকাশনীঃ ৩৬৪৩, ইসলামিক ফাউন্ডেশনঃ ৩৬৪৬)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 3934,
			"arabicnumber": 3934,
			"text": "সাহল ইবনু সা‘দ (রাঃ) বর্ণনা করেন, লোকেরা বছর গণনা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নবুয়াত প্রাপ্তির দিন হতে করেনি এবং তাঁর মৃত্যুর দিন থেকেও করেনি বরং তাঁর মদিনা্য় হিজরাত হতে বছর গণনা করা হয়েছে। (আধুনিক প্রকাশনীঃ ৩৬৪৪, ইসলামিক ফাউন্ডেশনঃ ৩৬৪৭)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 3935,
			"arabicnumber": 3935,
			"text": "‘ ‘আয়িশাহ (রাঃ) হতে বর্ণিত, তিনি বলেন, প্রথম অবস্থায় দু‘ দু‘ রাক‘আত করে সালাত ফরয করা হয়েছিল। অতঃপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন হিজরাত করলেন, ঐ সময় সালাত চার রাক‘আত করে দেয়া হয়। এবং সফর কালে আগের অবস্থা অর্থাৎ দু‘ রাক‘আত বহাল রাখা হয়। আব্দুর রাজ্জাক (রহ.) মা‘মার সূত্রে রিওয়ায়াত বর্ণনায় ইয়াযীদ ইবনু যরায়-এর অনুসরণ করেছেন। (৩৫০) (আধুনিক প্রকাশনীঃ ৩৬৪৫, ইসলামিক ফাউন্ডেশনঃ ৩৬৪৮)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 3936,
			"arabicnumber": 3936,
			"text": "সা‘দ ইবনু মালিক (রাঃ) বলেন, বিদায় হাজ্জের বছর আমি ভয়ানক রোগে আক্রান্ত হয়ে মৃত্যুর কাছাকাঠি হই তখন রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে দেখতে আসেন। তখন আমি বললাম, হে আল্লাহর রাসূল! আমার রোগ কি পর্যায় পৌছেছে তা আপনি দেখতে পাচ্ছেন। আমি একজন সম্পদশালী। আমার ওয়ারিশ হচ্ছে একটি মাত্র কন্যা। আমি আমার সম্পদের দুই-তৃতীয়াংশ আল্লাহর রাস্তায় সাদকা করে দিব? তিনি বললেন, না। আমি বললাম, তবে কি অর্ধেক? তিনি বললেন, হে সা‘দ, এক তৃতীয়াংশ দান কর। এবং এক তৃতীয়াংশই অনেক বেশি। তুমি তোমার ছেলে-মেয়েদেরকে সম্পদশালী রেখে যাও তা-ই উত্তম, এর চেয়ে তুমি তাদেরকে নিঃস্ব রেখে গেলে যে তারা অন্যের নিকট ভিক্ষে করে। আহমাদ ইবনু ইউসুফ (রহ.).....ইব্রাহীম (রহ.) হতে এ কথাগুলোও বর্ণনা করেছেন। তুমি তোমার ওয়ারিশদের সম্পদশালী রেখে যাবে আর তুমি আল্লাহর সন্তুষ্টির জন্য যা কিছু ব্যয় করবে, আল্লাহ্ তার প্রতিদান তোমাকে দেবেন। তুমি তোমার স্ত্রীর মুখে যে লোকমাটি তুলে দিবে এর প্রতিদানও আল্লাহ্ তোমাকে দেবে। আমি বললাম, হে আল্লাহর রাসূল! আমি কি আমার সাথী সঙ্গীদের হতে পশ্চাতে থাকব? তিনি বললেন, তুমি কক্ষনো পিছে পড়ে থাকবে না আর এ অবস্থায় আল্লাহর সন্তুষ্টি লাভের উদ্দেশে তুমি যে কোন নেক ‘আমল করবে তাহলে তোমার সম্মান ও মর্যাদা আরো বৃদ্ধি হবে। সম্ভবতঃ তুমি বয়স বেশি পাবে এবং এর ফলে তোমার দ্বারা অনেক মানুষ উপকৃত এবং অনেক মানুষ ক্ষতিগ্রস্ত হবে। হে আল্লাহ্! আমার সাহাবীদের হিজরাতকে অটুট রাখুন। তাদেরকে পশ্চাৎমুখী করে ফিরিয়ে নিবেন না। কিন্তু অভাবগ্রস্ত সা‘দ ইবনু খাওলাহর মক্কা্য় মৃত্যুর কারণে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার জন্য দুঃখ প্রকাশ করলেন। আহমাদ ইবনু ইউনুস (রহ.) ও মূসা (রহ.) ইব্রাহীম সূত্রে বর্ণনা করেছেন, أَنْ تَذَرَ وَرَثَتَكَ তোমার ওয়ারিশদের রেখে যাওয়া....। (৫৬) (আধুনিক প্রকাশনীঃ ৩৬৪৬, ইসলামিক ফাউন্ডেশনঃ ৩৬৪৯)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 3937,
			"arabicnumber": 3937,
			"text": "وَقَالَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ آخَى النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بَيْنِيْ وَبَيْنَ سَعْدِ بْنِ الرَّبِيْعِ لَمَّا قَدِمْنَا الْمَدِيْنَةَ وَقَالَ أَبُوْ جُحَيْفَةَ آخَى النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بَيْنَ سَلْمَانَ وَأَبِي الدَّرْدَاءِ ‘আবদুর রাহমান ইবনু ‘আউফ (রাঃ) বলেন, আমরা যখন মদিনা এলাম তখন আমার ও সা‘দ ইবনু রাবী‘র মধ্যে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ভ্রাতৃত্ব বন্ধন জুড়ে দেন এবং আবূ জুহাইফাহ (রাঃ) বলেন, সালমান ও আবূদ্ দারদা (রাঃ)-এর মধ্যে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ভ্রাতৃত্ব বন্ধন জুড়ে দিয়েছিলেন। ৩৯৩৭. আনাস (রাঃ) হতে বর্ণিত তিনি বলেন, আবদুর রহমান ইবনু ‘আউফ (রাঃ) যখন মদিনায় আসলেন, তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর ও সা‘দ ইবনু রাবী‘ আনসারী (রাঃ)-এর মধ্যে ভ্রাতৃত্ব বন্ধন জুড়ে দিলেন। সা‘দ (রাঃ) তার সম্পদ ভাগ করে অর্ধেক সম্পদ এবং দু‘জন স্ত্রীর যে কোন একজন নিয়ে যাওয়ার জন্য ‘আবদুর রহমানকে অনুরোধ করলেন। তিনি উত্তরে বললেন, আল্লাহ্ আপনার পরিবারবর্গ ও ধন-সম্পদে বরকত দান করুন। আমাকে এখানকার বাজারের রাস্তাটি দেখিয়ে দিন। তিনি মুনাফা হিসেবে কিছু ঘি ও পনির লাভ করলেন। কিছুদিন পরে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে তার দেখা হল। তিনি সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তখন তার গায়ে ও কাপড়ে হলুদ রং-এর চিহ্ন দেখতে পেয়ে বললেন, হে আবদুর রাহমান, ব্যাপার কি! তিনি বললেন, আমি একজন আনসারী মহিলাকে বিয়ে করেছি। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জিজ্ঞেস করলেন, তাকে কী পরিমাণ মোহর দিয়েছ? তিনি বললেন, তাকে খেজুর বিচির পরিমাণ সোনা দিয়েছি। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, একটি বকরি দিয়ে হলেও ওয়ালীমাহ করে নাও। (২০৪৯) (আধুনিক প্রকাশনীঃ ৩৬৪৭, ইসলামিক ফাউন্ডেশনঃ ৩৬৫০)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 3938,
			"arabicnumber": 3938,
			"text": "আনাস (রাঃ) বর্ণনা করেন, আবদুল্লাহ ইবনু সালাম (রাঃ)-এর নিকট নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর মদিনায় আসার খবর পৌঁছলে তিনি এসে তাঁকে কয়েকটি প্রশ্ন করলেন। তিনি বললেন, আমি আপনাকে তিনটি প্রশ্ন করছি। এগুলোর ঠিক উত্তর নবী ছাড়া অন্য কেউ জানে না। (১) কিয়ামতের সর্বপ্রথম ‘আলামত কী? (২) জান্নাতবাসীদের সর্বপ্রথম খাদ্য কী? (৩) কী কারণে সন্তান আকৃতিতে কখনও পিতার মত কখনো বা মায়ের মত হয়? নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, এ বিষয়গুলি সম্পর্কে এই মাত্র জিব্রাঈল (আঃ) আমাকে জানিয়ে গেলেন। আবদুল্লাহ ইবনু সালাম (রাঃ) একথা শুনে বললেন, তিনিই ফেরেশ্তাদের মধ্যে ইয়াহূদীদের দুশমন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, (১) কিয়ামত নিকটবর্তী হওয়ার সর্বপ্রথম আলামত লেলিহান অগ্নি যা মানুষকে পূর্বদিক হতে পশ্চিম দিকে ধাবিত করে নিয়ে যাবে এবং সবাইকে একত্র করবে। (২) সর্বপ্রথম খাদ্য যা জান্নাতবাসী খাবে তা হল মাছের কলিজার বাড়তি অংশ (৩) যদি নারীর আগে পুরুষের বীর্যপাত ঘটে তবে সন্তান পিতার মত হয় আর যদি পুরুষের আগে নারীর বীর্যপাত ঘটে তবে সন্তান মায়ের মত হয়। ‘আবদুল্লাহ ইবনু সালাম বললেন, আমি সাক্ষ্য দিচ্ছি যে আল্লাহ্ ছাড়া কোন মাবুদ নেই এবং নিশ্চয়ই আপনি আল্লাহর রাসূল। হে আল্লাহর রাসূল, ইয়াহূদীগণ এমন একটি জাতি যারা অন্যের কুৎসা রটনায় খুব পটু। আমার ইসলাম গ্রহণ প্রকাশ হওয়ার পূর্বে আমার অবস্থা সম্পর্কে তাদেরকে জিজ্ঞেস করুন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদেরকে ডাকলেন, তারা হাযির হল। তিনি জিজ্ঞেস করলেন, তোমাদের মাঝে ‘আবদুল্লাহ ইবনু সালাম কেমন লোক? তারা বলল, তিনি আমাদের মধ্যে সর্বোত্তম ব্যক্তি এবং সর্বোত্তম ব্যক্তির সন্তান। তিনি আমাদের সবচেয়ে মর্যাদাবান এবং সবচেয়ে মর্যাদাবান ব্যক্তির সন্তান। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আচ্ছা বলত, যদি ‘আবদুল্লাহ্ ইবনু সালাম ইসলাম কবুল করে তাহলে কেমন হবে? তোমরা তখন কি করবে? তারা বলল, আল্লাহ্ তাকে একাজ হতে রক্ষা করুন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আবার এ কথাটি বললেন, তারাও আগের মত উত্তর দিল। তখন ‘আবদুল্লাহ ইবনু সালাম বেরিয়ে আসলেন, এবং বললেন, أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللهُ وَأَنَّ مُحَمَّدًا رَسُوْلُ اللهِ তা শুনে ইয়াহূদীগণ বলতে লাগল, সে আমাদের মধ্যে খারাপ লোক এবং খারাপ লোকের সন্তান। অতঃপর তারা তাকে তুচ্ছ করার উদ্দেশে আরো অনেক কথাবার্তা বলল। ‘আবদুল্লাহ ইবনু সালাম (রাঃ) বললেন, হে আল্লাহর রাসূল! আমি এটাই আশংকা করেছিলাম। (৩৩২৯) (আধুনিক প্রকাশনীঃ ৩৬৪৮, ইসলামিক ফাউন্ডেশনঃ ৩৬৫১)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 3940,
			"arabicnumber": 3940,
			"text": "",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 3941,
			"arabicnumber": 3941,
			"text": "هَادُوْا صَارُوْا يَهُوْدًا وَأَمَّا قَوْلُهُ هُدْنَا تُبْنَا هَائِدٌ تَائِبٌ هَادُوْا অর্থ ইয়াহূদী হয়ে গেছে। هُدْنَا অর্থ আমরা তাওবা করেছি। هَائِدٌ অর্থ তাওবাকারী। ৩৯৪১. আবূ হুরাইরাহ (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেন, তিনি বলেন, যদি আমার উপর দশজন ইয়াহূদী ঈমান আনত তবে গোটা ইয়াহূদী সম্প্রদায়ই ঈমান আনত।* (মুসলিম ৫০/৩, হাঃ নং ২৭৯৩) (আধুনিক প্রকাশনীঃ ৩৬৫০, ইসলামিক ফাউন্ডেশনঃ ৩৬৫৩)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 3942,
			"arabicnumber": 3942,
			"text": "আবূ মূসা (রাঃ) হতে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন মদিনায় আসলেন, তখন ইয়াহূদী সম্প্রদায়ের কিছু লোক আশুরার দিনকে খুব সম্মান করত এবং সেদিন তারা সাওম পালন করত। এতে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, ইয়াহূদীদের চেয়ে ঐ দিন সাওম পালন করার আমরা বেশি হকদার। তারপর তিনি সবাইকে সাওম পালন করার নির্দেশ করলেন। (২০০৫) (আধুনিক প্রকাশনীঃ ৩৬৫১, ইসলামিক ফাউন্ডেশনঃ ৩৬৫৪)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 3943,
			"arabicnumber": 3943,
			"text": "ইবনু ‘আব্বাস (রাঃ) বর্ণনা করেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন মদিনা্য় আসেন তখন দেখতে পেলেন ইয়াহূদীরা ‘আশুরা দিবসে সাওম পালন করে। তাদেরকে সাওম পালনের কারণ জিজ্ঞেস করলে তারা বলল, এদিনই আল্লাহ্ তা‘আলা মূসা (আঃ) ও বনী ইসরাঈলকে ফিরাউনের উপর বিজয় দিয়েছিলেন। তাই আমরা ঐ দিনের সম্মানে সাওম পালন করি। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তোমাদের চেয়ে আমরা মূসা (আঃ)-এর বেশি নিকটবর্তী। এরপর তিনি সাওম পালনের নির্দেশ দিলেন। (২০০৪) (আধুনিক প্রকাশনীঃ ৩৬৫২, ইসলামিক ফাউন্ডেশনঃ ৩৬৫৫)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 3944,
			"arabicnumber": 3944,
			"text": "‘আবদুল্লাহ ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম চুলে সিঁথি না কেটে সোজা পিছনে দিতেন। আর মুশরিকরা তাদের চুলে সিঁথি কাটত। আহলে কিতাব সিঁথি কাটত না। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আল্লাহর নিকট হতে কোন নির্দেশ না আসা পর্যন্ত আহলে কিতাবের অনুকরণ পছন্দ করতেন। তারপর (ওয়াহী মুতাবেক) তাঁর মাথায় সিঁথি কাটলেন। (৩৫৫৮)(আধুনিক প্রকাশনীঃ ৩৬৫৩, ইসলামিক ফাউন্ডেশনঃ ৩৬৫৬)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 3945,
			"arabicnumber": 3945,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত, তিনি বলেন, এরাই তো সেই আহলে কিতাব যারা ভাগাভাগি করে ফেলেছে, কোন কোন বিষয়ের উপর ঈমান এনেছে আর কোন কোন বিষয়কে অস্বীকার করেছে। রাবী আল্লাহর এ বাণী বুঝাতে চেয়েছেন-‘‘যারা কুরআনকে খন্ড খন্ড করেছে’’ (সূরাহ আল-হিজরঃ ৯১) (৪৭০৫, ৪৭০৬) (আধুনিক প্রকাশনীঃ ৩৬৫৪, ইসলামিক ফাউন্ডেশনঃ ৩৬৫৭)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 3946,
			"arabicnumber": 3946,
			"text": "সালমান ফারসী (রাঃ) হতে বর্ণিত, তিনি দশ জনেরও অধিক মালিকের অধীনে হাত বদল হতে থাকেন। (আধুনিক প্রকাশনীঃ ৩৬৫৫, ইসলামিক ফাউন্ডেশনঃ ৩৬৫৮)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 3947,
			"arabicnumber": 3947,
			"text": "আবূ ‘‘উসমান (রহ.) বলেন, আমি সালমান (রাঃ)-কে বলতে শুনেছি; তিনি বলেন, আমি রাম হুরমুয এর বাসিন্দা। (আধুনিক প্রকাশনীঃ ৩৬৫৬, ইসলামিক ফাউন্ডেশনঃ ৩৬৫৯)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 3948,
			"arabicnumber": 3948,
			"text": "সালমান ফারসী (রাঃ) বলেন, ‘ঈসা (আ.) এবং মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর মধ্যে ছয় শত বছরের পার্থক্য ছিল। (আধুনিক প্রকাশনীঃ ৩৬৫৭, ইসলামিক ফাউন্ডেশনঃ ৩৬৬০)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 172
			}
		}
	]
}