{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"68": "Divorce"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5251,
			"arabicnumber": 5251,
			"text": "أَحْصَيْنَاه“ : حَفِظْنَاه“ وَعَدَدْنَاهُ. أَحْصَيْنَاه” অর্থাৎ حَفِظْنَاه” আমরা তার হিফাযত করেছি عَدَدْنَاهُতার হিসাব রেখেছি। وَطَلاَقُ السُّنَّةِ أَنْ يُطَلِّقَهَا طَاهِرًا مِنْ غَيْرِ جِمَاعٍ وَيُشْهِدَ شَاهِدَيْنِ. সুন্নাত তালাক হল, পবিত্রাবস্থায় সহবাস ব্যতীত স্ত্রীকে তালাক দেয়া এবং দু’জন সাক্ষী রাখা। ৫২৫১. ‘আবদুল্লাহ্ ইবন ‘উমার (রাঃ) হতে বর্ণিত যে, তিনি রাসূল এর যুগে তাঁর স্ত্রীকে হায়েয অবস্থায় তালাক দেন। ‘উমার ইবন খাত্তাব (রাঃ) এ ব্যাপারে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে জিজ্ঞেস করলেন। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তাকে নির্দেশ দাও, সে যেন তার স্ত্রীকে ফিরিয়ে আনে এবং নিজের কাছে রেখে দেয় যতক্ষণ না সে মহিলা পবিত্র হয়ে আবার ঋতুমতী হয় এবং আবার পবিত্র হয়। অতঃপর সে যদি ইচ্ছে করে, তাকে রেখে দিবে আর যদি ইচেছ করে তবে সহবাসের পূর্বে তাকে তালাক দেবে। আর এটাই তালাকের নিয়ম, যে নিয়মে আল্লাহ্ তা’আলা স্ত্রীদের তালাক দেয়ার বিধান দিয়েছেন। [৪৯০৮] আধুনিক প্রকাশনী- ৪৮৬৮, ইসলামিক ফাউন্ডেশন- ৪৭৬২[1]",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 5252,
			"arabicnumber": 5252,
			"text": "ইবন ‘উমার (রাঃ) হতে বর্ণিত যে, তিনি তাঁর স্ত্রীকে হায়িয অবস্থায় তালাক দিলেন। ‘উমার (রাঃ) বিষয়টি নবী এর কাছে ব্যক্ত করলেন। তখন তিনি বললেনঃ সে যেন তাকে ফিরিয়ে আনে। রাবী ইব্ন সীরীন) বলেন, আমি বললাম ,তালাকটি কি গণ্য করা হবে? তিনি ইবনে ‘উমার) বললেন, তাহলে কী? [৪৯০৮] ক্বাতাদাহ (রহ.) ইউনুস ইবন যুবায়র (রহ.) থেকে, তিনি ইবন ‘উমার থেকে বর্ণনা করেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তাকে হুকুম দাও সে যেন তার স্ত্রীকে ফিরিয়ে আনে। আমি (ইউনুস) বললামঃ তালাকটি কি পরিগণিত হবে? তিনি (ইবন ‘উমার) বললেনঃ তুমি কি মনে কর যদি সে অক্ষম হয় এবং আহম্মকী করে? আধুনিক প্রকাশনী- ৪৮৬৯, ইসলামিক ফাউন্ডেশন- ৪৭৬৩",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 5253,
			"arabicnumber": 5253,
			"text": "আবূ মা’মার বলেনঃ ‘আবদুল ওয়ারিস আইউব থেকে, তিনি সা‘ঈদ ইবন যুবায়র থেকে, তিনি ইবন ‘উমার (রাঃ) থেকে বর্ণনা করেন যে, তিনি বলেছেনঃ এটিকে আমার উপর এক তালাক গণ্য করা হয়েছিল। [৪৯০৮; মুসলিম ১৮/১, হাঃ ১৪৭১, আহমাদ ৫৪৯০] আধুনিক প্রকাশনী- ৪৮৬৯, ইসলামিক ফাউন্ডেশন- ৪৭৬৩",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 5254,
			"arabicnumber": 5254,
			"text": "আওযা‘ঈ (রহ.) হতে বর্ণিত, তিনি বলেন, আমি যুহরী (রহ.)-কে জিজ্ঞেস করলাম, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কোন্ সহধর্মিণী তাঁর থেকে মুক্তি প্রার্থনা করেছিল? উত্তরে তিন বললেনঃ ‘উরওয়াহ (রহ.) ‘আয়িশাহ (রাঃ) থেকে আমার নিকট বর্ণনা করেছেন যে, জাওনের কন্যাকে যখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামএর নিকট একটি ঘরে) পাঠানো হল আর তিনি তার নিকটবর্তী হলেন, তখন সে বলল, আমি আপনার থেকে আল্লাহর কাছে আশ্রয় চাচ্ছি। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তুমি তো এক মহামহিমের কাছে পানাহ চেয়েছ। তুমি তোমার পরিবারের কাছে গিয়ে মিলিত হও। আবূ ‘আবদুল্লাহ ইমাম বুখারী) (রহ.) বলেনঃ হাদীসটি হাজ্জাজ ইব্ন আবূ মানী’ও তাঁর পিতামহ থেকে, তিনি যুহরী থেকে, তিনি ’উরওয়াহ থেকে এবং তিনি ‘আয়িশাহ (রাঃ) থেকে বর্ণনা করেছেন। আধুনিক প্রকাশনী- ৪৮৭০, ইসলামিক ফাউন্ডেশন- ৪৭৬৪",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 5255,
			"arabicnumber": 5255,
			"text": "আবূ উসায়দ (রাঃ) হতে বর্ণিত। তিনি বলেনঃ আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে বের হয়ে শাওত নামক বাগানের নিকট দিয়ে চলতে চলতে দু’টি বাগান পর্যন্ত পৌছলাম এবং এ দু’টির মাঝে বসলাম। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমরা এখানে বসে থাক। তিনি (ভিতরে) প্রবেশ করলেন। তখন নু’মান ইব্ন শারাহীলের কন্যা উমাইমার খেজুর বাগানস্থিত ঘরে জাওনিয়াকে আনা হয়। আর তাঁর খিদমতের জন্য ধাত্রীও ছিল। নবী (সা.) যখন তার কাছে গিয়ে বললেন, তুমি নিজেকে আমার কাছে সমর্পণ কর। তখন সে বললঃ কোন রাজকুমারী কি কোন বাজারিয়া ব্যক্তির কাছে নিজেকে সমর্পণ করে? রাবী বলেনঃ এরপর তিনি তাঁর হাত প্রসারিত করলেন তার শরীরে রাখার জন্য, যাতে সে শান্ত হয়। সে বললঃ আমি আপনার থেকে আল্লাহর নিকট পানাহ চাই। তিনি বললেনঃ তুমি উপযুক্ত সত্তারই আশ্রয় নিয়েছ। এরপর তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) আমাদের নিকট বেরিয়ে আসলেন এবং বললেনঃ হে আবূ উসায়দ! তাকে দু’খানা কাতান কাপড় পরিয়ে দাও এবং তাকে তার পরিবারের নিকট পৌঁছিয়ে দাও। [৫২৫৭] আধুনিক প্রকাশনী- ৪৮৭১, ইসলামিক ফাউন্ডেশন- ৪৭৬৫",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 5256,
			"arabicnumber": 5256,
			"text": "",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 5257,
			"arabicnumber": 5257,
			"text": "",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 5258,
			"arabicnumber": 5258,
			"text": "আবূ গাল্লাব ইউনুস ইবন যুবায়র (রহ.) হতে বর্ণিত, তিনি বলেন, আমি ইবন ‘উমারকে বললামঃ এক ব্যক্তি তার স্ত্রীকে হায়িয অবস্থায় তালাক দিয়েছে। তিনি বললেন, তুমি ইবন ‘উমারকে চেন। ইবন ‘উমার (রাঃ) তাঁর স্ত্রীকে হায়িয অবস্থায় তালাক দিয়েছিল। তখন ‘উমার (রাঃ) নবী এর কাছে এসে বিষয়টি তাঁকে জানালেন। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে তার স্ত্রীকে ফিরিয়ে নেয়ার জন্য আদেশ দিলেন। পরে তার স্ত্রী পবিত্র হলে, সে যদি চায় তবে তাকে তালাক দেবে। আমি বললামঃ এতে কি তালাক গণনা করা হয়েছিল? তিনি বললেনঃ তুমি কি মনে কর যদি সে অক্ষম হয় এবং বোকামি করে। [৪৯০৮] আধুনিক প্রকাশনী- ৪৮৭২, ইসলামিক ফাউন্ডেশন- ৪৭৬৭",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 5259,
			"arabicnumber": 5259,
			"text": "وَقَالَ ابْنُ الزُّبَيْرِ فِي مَرِيضٍ طَلَّقَ لاَ أَر‘ى أَنْ تَرِثَ مَبْتُوتَتُه“ وَقَالَ الشَّعْبِيُّ تَرِثُه“ وَقَالَ ابْنُ شُبْرُمَةَ تَزَوَّجُ إِذَا انْقَضَتْ الْعِدَّةُ؟ قَالَ نَعَمْ قَالَ أَرَأَيْتَ إِنْ مَاتَ الزَّوْجُ الآخَرُ فَرَجَعَ عَنْ ذَلِكَ. ইবনু যুবায়র (রাঃ) বলেন, যে ব্যক্তি অসুস্থ অবস্থায় তালাক দেয় তার তিন তালাকপ্রাপ্তা স্ত্রী ওয়ারিস হবে বলে আমি মনে করি না। শা’বী (রহ.) বলেন, ওয়ারিস হবে। ইবনু শুবরুমা জিজ্ঞেস করলেনঃ ইদ্দাত শেষ হওয়ার পর সে মহিলা অন্যত্র বিবাহ করতে পারবে কি? তিনি উত্তর দিলেন, হাঁ। ইবনু শুবরুমা আবার প্রশ্ন করলেনঃ যদি দ্বিতীয় স্বামীও মৃত্যু বরণ করে তবে? অর্থাৎ আপনার মতানুযায়ী উক্ত স্ত্রীর উভয় স্বামীর ওয়ারিস হওয়া যরুরী হয়। এরপর শা’বী তাঁর ঐ কথা ফিরিয়ে নেন। ৫২৫৯. সাহল ইবনু সা‘দ সা‘ঈদী (রাঃ) হতে বর্ণিত যে, ‘উওয়াইমির’ আজলানী (রাঃ) ’আসেম ইবনু ‘আদী আনসারী (রাঃ) এর নিকট এসে বললেনঃ হে ‘আসিম! যদি কোন ব্যক্তি তার স্ত্রীকে অপর কোন পুরুষের সাথে ব্যভিচার-রত) দেখতে পায় এবং সে তাকে হত্যা করে ফেলে, তাহলে তোমরা কি তাকে হত্যাকারীকে) হত্যা করবে? আর হত্যা না করলে) তবে সে কী করবে? হে ‘আসিম! আমার পক্ষ হতে এ সম্পর্কে তুমি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে জিজ্ঞেস কর। আসিম (রাঃ) এ সম্পর্কে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে জিজ্ঞেস করলেন। রাসূলুল্লাহ্সাল্লাল্লাহু আলাইহি ওয়াসাল্লামএ ধরনের প্রশ্নাবলী নিন্দনীয় এবং দূষণীয় মনে করলেন। এমনকি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর উক্তি শ্রবণে ‘আসিম (রাঃ) ভড়কে গেলেন। এরপর ‘আসিম (রাঃ) তার নিজ বাসায় ফিরে আসলে উওয়াইমির (রাঃ) এসে বললেনঃ হে আসিম! রাসূলুল্লাহ্সাল্লাল্লাহু আলাইহি ওয়াসাল্লামতোমাকে কী জবাব দিলেন? আসিম (রাঃ) বললেনঃ তুমি কল্যাণজনক কিছু নিয়ে আমার নিকট আসনি। তোমার জিজ্ঞাসিত বিষয়কে রাসূলুল্লাহ্সাল্লাল্লাহু আলাইহি ওয়াসাল্লামনা পছন্দ করেছেন। উওয়াইমির (রাঃ) বললেনঃ আল্লাহর কসম! উত্তর না পাওয়া পর্যন্ত) এ বিষয়ে আমি তাঁকে জিজ্ঞেস করতেই থাকব। উওয়াইমির (রাঃ) এসে লোকদের মাঝে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে পেলেন এবং বললেনঃ হে আল্লাহর রাসূল! যদি কেউ তার স্ত্রীর সঙ্গে পরপুরুষকে ব্যভিচার-রত) দেখতে পায়, আর তাকে হত্যা করে ফেলে, তবে আপনারা কি তাকে হত্যা করবেন? আর যদি সে (স্বামী) হত্যা না করে, তবে সে কী করবে? তখন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তুমি ও তোমার স্ত্রীর ব্যাপারে আয়াত অবতীর্ণ হয়েছে। সুতরাং তুমি গিয়ে তাঁকে তোমার পত্নীকে) নিয়ে আস। সাহল (রাঃ) বলেন, এরপর তারা দু’জনে লি‘আন করলো। আমি সে সময় অন্যান্য) লোকের সঙ্গে রাসূলুল্লাহ্সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে ছিলাম। উভয়ের লি‘আন করা হয়ে গেলে উওয়াইমির (রাঃ) বললেন, হে আল্লাহর রাসূল্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম! এখন যদি আমি তাকে স্ত্রী হিসেবে) রাখি তবে এটা তার উপর মিথ্যারোপ করা হবে। এরপর রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে আদেশ দেয়ার পূর্বেই তিনি তার স্ত্রীকে তিন তালাক দিলেন। ইবনু শিহাব (রহ.) বলেন, এটাই লি‘আনকারীদ্বয়ের ব্যাপারে সুন্নাত হয়ে দাঁড়াল। [৪২৩] আধুনিক প্রকাশনী- ৪৮৭৩, ইসলামিক ফাউন্ডেশন- ৪৭৬৮",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 5260,
			"arabicnumber": 5260,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, রিফা‘আ কুরাযীর স্ত্রী রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট এসে বললেন, হে আল্লাহর রাসূল! রিফা‘আ আমাকে পূর্ণ সম্পর্কচ্ছেদের তালাক তিন তালাক দিয়েছে। পরে আমি ‘আবদুর রহমান ইবন যুবায়র কুরাযীকে বিয়ে করি। কিন্তু তার কাছে আছে কাপড়ের পুঁটলির মত একটি জিনিস। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ সম্ভবতঃ তুমি রিফা‘আর নিকট ফিরে যেতে ইচ্ছে করছ। কিন্তু তা তো সম্ভব নয়, যতক্ষণ না সে অর্থাৎ দ্বিতীয় স্বামী) তোমার স্বাদ গ্রহণ করে এবং তুমি তার স্বাদ গ্রহণ কর। [1][২৬৩৯] আধুনিক প্রকাশনী- ৪৮৭৪, ইসলামিক ফাউন্ডেশন- ৪৭৬৯",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 5261,
			"arabicnumber": 5261,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত যে, এক ব্যক্তি তার স্ত্রীকে তিন তালাক দিলে সে স্ত্রী অন্যত্র বিয়ে করল। পরে দ্বিতীয় স্বামীও তাকে তালাক দিল। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে জিজ্ঞেস করা হল মহিলাটি কি প্রথম স্বামীর জন্য হালাল হবে? তিনি বললেনঃ না, যতক্ষণ না সে দ্বিতীয় স্বামী তার স্বাদ গ্রহণ করবে, যেমন স্বাদ গ্রহণ করেছিল প্রথম স্বামী। [২৬৩৯] আধুনিক প্রকাশনী- ৪৮৭৫, ইসলামিক ফাউন্ডেশন- ৪৭৭০",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 5262,
			"arabicnumber": 5262,
			"text": "وَقَوْلِ اللَّهِ تَعَالَى: (قُلْ لأَزْوَاجِكَ إِنْ كُنْتُنَّ تُرِدْنَ الْحَيَاةَ الدُّنْيَا وَزِينَتَهَا فَتَعَالَيْنَ أُمَتِّعْكُنَّ وَأُسَرِّحْكُنَّ سَرَاحًا جَمِيلاً). মহান আল্লাহর বাণীঃ হে নবী! তুমি তোমার স্ত্রীদের বলে দাও- তোমরা যদি পার্থিব জীবন আর তার শোভাসৌন্দর্য কামনা কর, তাহলে এসো, তোমাদেরকে ভোগসামগ্রী দিয়ে দেই এবং উত্তম পন্থায় তোমাদেরকে বিদায় দেই।সূরাহ আহযাব ৩৩/২৮)· ৫২৬২. ‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদেরকে দুনিয়ার সুখ শান্তি বা পরকালীন সুখ শান্তি বেছে নেয়ার) ইখতিয়ার দিলে আমরা আল্লাহ ও তাঁর রাসূলকেই গ্রহণ করলাম। আর এতে আমাদের প্রতি কিছুই অর্থাৎ ত্বলাক (তালাক)) সাব্যস্ত হয়নি। [৫২৬৩; মুসলিম ১৮/৪, হাঃ ১৪৭৭] আধুনিক প্রকাশনী- ৪৮৭৭, ইসলামিক ফাউন্ডেশন- ৪৭৭২",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 5263,
			"arabicnumber": 5263,
			"text": "মাসরূক (রহ.) হতে বর্ণিত। তিনি বলেন, আমি ‘আয়িশাহ (রাঃ)-কে ইখতিয়ার সম্পর্কে জিজ্ঞেস করলাম এতে তালাক হবে কিনা)। তিনি উত্তর দিলেনঃ নবীসাল্লাল্লাহু আলাইহি ওয়াসাল্লামআমাদেরকে ইখ্তিয়ার দিয়েছিলেন। তাহলে সেটা কি তালাক ছিল? মাসরূক বলেনঃ তবে সে স্ত্রী আমাকে গ্রহণ করার পর আমি তাকে একবার ইখতিয়ার দিই বা একশ’বার দিই তাতে কিছু যায় আসে না। [৫২৬২; মুসলিম ১৮/৪, হাঃ ১৪৭৭, আহমাদ ২৫৭৬১] আধুনিক প্রকাশনী- ৪৮৭৮, ইসলামিক ফাউন্ডেশন- ৪৭৭৩",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 5264,
			"arabicnumber": 5264,
			"text": "(بَاب إِذَا قَالَ فَارَقْتُكِ أَوْ سَرَّحْتُكِ أَوِ الْخَلِيَّةُ أَوِ الْبَرِيَّةُ أَوْ مَا عُنِيَ بِهِ الطَّلاَقُ فَهُوَ عَلٰى نِيَّتِهِ. ৬৮/৬. অধ্যায়ঃ যে তার স্ত্রীকে) বলল- ‘আমি তোমাকে পৃথক করলাম’, বা ‘আমি তোমাকে বিদায় দিলাম’, বা ‘তুমি মুক্ত বা বন্ধনহীন’ অথবা এমন কোন বাক্য উচ্চারণ করল যা দ্বারা তালাক উদ্দেশ্য হয়। তবে তা তার নিয়্যাতের উপর নির্ভর করবে। وَقَوْلُ اللَّهِ عَزَّ وَجَلَّ: (وَسَرِّحُوهُنَّ سَرَاحًا جَمِيلاً) وَقَالَ: (وَأُسَرِّحْكُنَّ سَرَاحًا جَمِيلاً) وَقَالَ: (فَإِمْسَاكٌ بِمَعْرُوفٍ أَوْ تَسْرِيحٌ بِإِحْسَانٍ) وَقَالَ: (أَوْ فَارِقُوهُنَّ بِمَعْرُوفٍ) وَقَالَتْ عَائِشَةُ قَدْ عَلِمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ أَبَوَيَّ لَمْ يَكُونَا يَأْمُرَانِي بِفِرَاقِهِ. মহান আল্লাহর বাণীঃ ‘‘তাদেরকে সৌজন্যের সঙ্গে বিদায় দাও’’- সূরাহ আহযাব ৩৩/৪৯)। তিনি আরও বলেন- ‘‘আমি তোমাদেরকে সৌজন্যের সঙ্গে বিদায় দিচ্ছি’’- সূরাহ আহযাব ৩৩/২৮)। আরও বলেন- ‘‘হয়ত উত্তম পন্থায় রেখে দিবে নতুবা উত্তমরূপে ছেড়ে দিবে’’- সূরাহ আল-বাক্বারাহ ২/২২৯)। আরও বলেন, ‘‘অথবা তাদেরকে সৌজন্যের সঙ্গে বিচ্ছিন্ন করে দাও’’- সূরাহ আত্-তালাক ৬৫/২)। আর ‘আয়িশাহ (রাঃ) বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জানতেন আমার মা-বাপ আমাকে তাঁর সঙ্গে বিচ্ছেদের আদেশ দিবেন না। وَقَالَ الْحَسَنُ نِيَّتُه“ وَقَالَ أَهْلُ الْعِلْمِ إِذَا طَلَّقَ ثَلاَثًا فَقَدْ حَرُمَتْ عَلَيْهِ فَسَمَّوْه“ حَرَامًا بِالطَّلاَقِ وَالْفِرَاقِ وَلَيْسَ هٰذَا كَالَّذِي يُحَرِّمُ الطَّعَامَ لِأَنَّه“ لاَ يُقَالُ لِطَعَامِ الْحِلِّ حَرَامٌ وَيُقَالُ لِلْمُطَلَّقَةِ حَرَامٌ وَقَالَ فِي الطَّلاَقِ ثَلاَثًا لاَ تَحِلُّ لَه“ حَتّٰى تَنْكِحَ زَوْجًا غَيْرَهُ. হাসান (রহ.) বলেন, তবে তা তার নিয়্যাত অনুযায়ী হবে। ‘আলিমগণ বলেন, যদি কেউ তার স্ত্রীকে তিন তালাক দেয়, তবে সে স্ত্রী তার জন্য হারাম হয়ে যাবে। তাঁরা এটাকে হারাম নামে আখ্যায়িত করেছেন, যা তালাক বা বিচ্ছেদ দ্বারা সম্পন্ন হয়। তবে এ হারাম করাটা তেমন নয়, যেমন কেউ খাদ্যকে হারাম ঘোষণা করল; কেননা হালাল খাদ্যকে হারাম বলা যায় না। কিন্তু তালাকপ্রাপ্তাকে হারাম বলা যায়। আবার তিন তালাকপ্রাপ্তা সম্বন্ধে বলেছেন, সে স্ত্রী অন্যস্বামীর সঙ্গে বিবাহ বন্ধনে আবদ্ধ হওয়া ব্যতীত প্রথম স্বামীর জন্য বৈধ হবে না। ৫২৬৪. লায়স (রহ.) নাফি' থেকে বর্ণনা করেছেন যে, ইবনু ‘উমার (রাঃ)-কে তিন তালাক প্রদানকারী সম্বন্ধে জিজ্ঞেস করা হলে তিনি বলতেনঃ যদি তুমি একবার বা দু’বার দিতে! কেননা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে এরূপ করার নির্দেশ দিয়েছেন। তাই স্ত্রীকে তিন তালাক দিলে সে হারাম হয়ে যাবে, যতক্ষণ না সে স্ত্রী তোমাকে ছাড়া অন্য স্বামীকে বিয়ে করে। [৪৯০৮] আধুনিক প্রকাশনী- অনুচ্ছেদ, ইসলামিক ফাউন্ডেশন- অনুচ্ছেদ",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 5265,
			"arabicnumber": 5265,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, এক ব্যক্তি তার স্ত্রীকে তালাক দিলে সে স্ত্রী অন্য স্বামীকে বিবাহ করে। পরে সেও তাকে তালাক দেয়। তার লিঙ্গ ছিল কাপড়ের কিনারা সদৃশ। সুতরাং মহিলা তার থেকে নিজের মনস্কামনা পূর্ণ করতে পারল না। দ্বিতীয় স্বামী অবিলম্বে তালাক দিলে সে মহিলা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট এসে বলল, হে আল্লাহর রাসূল! আমার প্রথম স্বামী আমাকে ত্বলাক (তালাক)ব দিলে আমি অন্য স্বামীর সঙ্গে বিয়ে বন্ধনে আবদ্ধ হই। এরপর সে আমার সঙ্গে সঙ্গত হয়। কিন্তু তার সঙ্গে কাপড়ের কিনারা সদৃশ বৈ কিছুই নেই। তাই সে একবারের অধিক আমার নিকটস্থ হল না এবং আপন মনস্কামনা সিদ্ধ করতে সক্ষম হল না। এরূপ অবস্থায় আমি আমার প্রথম স্বামীর জন্য বৈধ হব কি? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তুমি ততক্ষণ পর্যন্ত তোমার প্রথম স্বামীর জন্য হালাল হবে না, যতক্ষণ না দ্বিতীয় স্বামী তোমার কিছু স্বাদ উপভোগ করে, আর তুমিও তার কিছু স্বাদ আস্বাদন কর। [২৬৩৯] আধুনিক প্রকাশনী- ৪৮৭৯, ইসলামিক ফাউন্ডেশন- ৪৭৭৪",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 5266,
			"arabicnumber": 5266,
			"text": "সা‘ঈদ ইবনু যুবায়র (রহ.) হতে বর্ণিত। তিনি ইবনু ‘আব্বাস (রাঃ)-কে বলতে শুনেছেন যে, কোন ব্যক্তি তার স্ত্রীকে হারাম বলে ঘোষণা দেয় সে ক্ষেত্রে কিছু অর্থাৎ তালাক হয় না। তিনি আরও বলেনঃ ‘‘নিশ্চয় তোমাদের জন্য রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর মধ্যে রয়েছে উত্তম আদর্শ।’’সূরাহ আল-আহযাবঃ ২১)[৪৯১১] আধুনিক প্রকাশনী- ৪৮৮০, ইসলামিক ফাউন্ডেশন- ৪৭৭৫",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 5267,
			"arabicnumber": 5267,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যাইনাব বিনত জাহাশের নিকট কিছু বেশী সময় অবস্থান) করতেন এবং সেখানে তিনি মধু পান করতেন। আমি ও হাফসাহ পরামর্শ করে ঠিক করলাম যে, আমাদের মধ্যে যার নিকটই নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম প্রবেশ করবেন, সেই যেন বলি- আমি আপনার নিকট হতে মাগাফীর-এর গন্ধ পাচ্ছি। আপনি কি মাগাফীর খেয়েছেন। এরপর তিনি তাদের একজনের নিকট প্রবেশ করলে তিনি তাঁকে সেরূপ বললেন। তিনি বললেনঃ আমি তো যাইনাব বিনত জাহাশের নিকট মধু পান করেছি। আমি পুনরায় এ কাজ করব না। এ প্রসঙ্গেই অবতীর্ণ হয় মহান আল্লাহর বাণীঃ) ‘‘হে নবী! আল্লাহ যা তোমার জন্য হালাল করেছেন তা তুমি কেন হারাম করছ?......তোমরা দু’জন যদি অনুশোচনাভরে আল্লাহর দিকে ফিরে আস তবে তা তোমাদের জন্য উত্তম)’’ সূরাহ আত-তাহরীম ৬৬ ঃ ১-৪) পর্যন্ত। এখানে ‘আয়িশাহ ও হাফসাহ-কে উদ্দেশ্য করে বলা হয়েছে। আর আল্লাহর বাণী ‘‘যখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর স্ত্রীদের একজনকে গোপনে কিছু বলেছিলেন’’- ‘বরং আমি মধু পান করেছি’-এ কথার প্রেক্ষাপটে অবতীর্ণ হয়। [৪৯১২; মুসলিম ৩/হাঃ ১৪৭৪, আহমাদ ২৫৯১০] আধুনিক প্রকাশনী- ৪৮৮১, ইসলামিক ফাউন্ডেশন- ৪৭৭৬",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 5268,
			"arabicnumber": 5268,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মধু ও হালুয়া (মিষ্টি) পছন্দ করতেন। আসর সালাত শেষে তিনি তাঁর স্ত্রীদের নিকট যেতেন। এরপর তাঁদের একজনের ঘনিষ্ঠ হতেন। একদা তিনি হাফসাহ বিন্ত উমারের নিকট গেলেন এবং অন্যান্য দিনের চেয়ে অধিক সময় কাটালেন। এতে আমি ঈর্ষা বোধ করলাম। পরে এ ব্যাপারে জিজ্ঞেস করে জানতে পারলাম যে, তাঁর হাফসাহর) গোত্রের এক মহিলা তাঁকে এক পাত্র মধু উপঢৌকন দিয়েছিল। তা থেকেই তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে কিছু পান করিয়েছেন। আমি বললামঃ আল্লাহর কসম! আমরা এজন্য একটা মতলব আঁটব। এরপর আমি সাওদাহ বিন্ত যাম‘আহ্কে বললাম, তিনি [রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম] তো এখনই তোমার কাছে আসছেন, তিনি তোমার নিকটবর্তী হলেই তুমি বলবে, আপনি কি মাগাফীর খেয়েছেন? তিনি নিশ্চয়ই তোমাকে বলবেন ‘‘না’’। তখন তুমি তাঁকে বলবে, তবে আমি কিসের গন্ধ পাচ্ছি? তিনি বলবেনঃ হাফসাহ আমাকে কিছু মধু পান করিয়েছে। তুমি তখন বলবে, এর মৌমাছি মনে হয় ‘উরফুত নামক বৃক্ষ থেকে মধু সংগ্রহ করেছে। আমিও তাই বলব। সফীয়্যাহ! তুমিও তাই বলবে। ‘আয়িশাহ (রাঃ) বলেনঃ সাওদা (রাঃ) বললেন, আল্লাহর কসম! তিনি দরজার নিকট আসতেই আমি তোমার ভয়ে তোমার আদিষ্ট কাজ পালনে প্রস্তুত হলাম। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন তাঁর নিকটবর্তী হলেন, তখন সাওদা বললেন, হে আল্লাহর রাসূল! আপনি কি মাগাফীর খেয়েছেন? তিনি বললেনঃ না। সাওদা বললেন, তবে আপনার নিকট হতে এ কিসের গন্ধ পাচ্ছি? তিনি বললেন হাফসাহ আমাকে কিছু মধু পান করিয়েছে। সাওদা বললেন, এ মধু মক্ষিকা ‘উরফুত’ নামক গাছ থেকে সংগ্রহ করেছে। এরপর তিনি ঘুরে যখন আমার নিকট এলেন, তখন আমিও ঐরকম বললাম। তিনি সফীয়্যাহর নিকট গেলে তিনিও তেমনই কথা বললেন। পরদিন যখন তিনি হাফসাহর কাছে গেলেনঃ তখন তিনি বললেন, হে আল্লাহর রাসূল! আপনাকে মধু পান করাব কি? উত্তরে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আমার এর কোন দরকার নেই। ‘আয়িশাহ (রাঃ) বর্ণনা করেন, সাওদা বললেনঃ আল্লাহর কসম! আমরা তাঁকে বিরত রেখেছি। আমি বললামঃ চুপ কর। [৪৯১২; মুসলিম ১৮/৩, হাঃ ১৪৭৪, আহমাদ ২৪৩৭০] আধুনিক প্রকাশনী- ৪৮৮২, ইসলামিক ফাউন্ডেশন- ৪৭৭৭",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 5269,
			"arabicnumber": 5269,
			"text": "بَاب لاَ طَلاَقَ قَبْلَ النِّكَاحِ. ৬৮/৯. অধ্যায়ঃ বিয়ের আগে তালাক নেই। وَقَوْلُ اللَّهِ تَعَالَى: (يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا نَكَحْتُمُ الْمُؤْمِنَاتِ ثُمَّ طَلَّقْتُمُوهُنَّ مِنْ قَبْلِ أَنْ تَمَسُّوهُنَّ فَمَا لَكُمْ عَلَيْهِنَّ مِنْ عِدَّةٍ تَعْتَدُّونَهَا فَمَتِّعُوهُنَّ وَسَرِّحُوهُنَّ سَرَاحًا جَمِيلاً) মহান আল্লাহর বাণীঃ হে মু’মিনগণ! তোমরা যখন কোন মু’মিন নারীকে বিবাহ কর, অতঃপর তাদেরকে স্পর্শ করার পূর্বেই তাদেরকে তালাক দাও, তখন তাদের জন্য তোমাদেরকে কোন ইদ্দত পালন করতে হবে না যা তোমরা অন্যক্ষেত্রের তালাকে) গণনা করে থাক। কাজেই কিছু সামগ্রী তাদেরকে দাও আর তাদেরকে বিদায় দাও উত্তম বিদায়ে। সূরাহ আহযাব ৩৩/৪৯) وَقَالَ ابْنُ عَبَّاسٍ جَعَلَ اللَّهُ الطَّلاَقَ بَعْدَ النِّكَاحِ وَيُرْوَى فِي ذَلِكَ عَنْ عَلِيٍّ وَسَعِيدِ بْنِ الْمُسَيَّبِ وَعُرْوَةَ بْنِ الزُّبَيْرِ وَأَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ وَعُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ وَأَبَانَ بْنِ عُثْمَانَ وَعَلِيِّ بْنِ حُسَيْنٍ وَشُرَيْحٍ وَسَعِيدِ بْنِ جُبَيْرٍ وَالْقَاسِمِ وَسَالِمٍ وَطَاوُسٍ وَالْحَسَنِ وَعِكْرِمَةَ وَعَطَاءٍ وَعَامِرِ بْنِ سَعْدٍ وَجَابِرِ بْنِ زَيْدٍ وَنَافِعِ بْنِ جُبَيْرٍ وَمُحَمَّدِ بْنِ كَعْبٍ وَسُلَيْمَانَ بْنِ يَسَارٍ وَمُجَاهِدٍ وَالْقَاسِمِ بْنِ عَبْدِ الرَّحْمَنِ وَعَمْرِو بْنِ هَرِمٍ وَالشَّعْبِيِّ أَنَّهَا لاَ تَطْلُقُ ইবনু ‘আব্বাস (রাঃ) বলেনঃ এ আয়াতে) আল্লাহ তা‘আলা বিয়ের পর তালাকের কথা উল্লেখ করেছেন। এ ব্যাপারে ‘আলী (রাঃ) সা‘ঈদ ইবনু মুসায়্যিব (রহ.) ‘উরওয়াহ ইবনু যুবায়র (রহ.), আবূ বাকর ইবনু ‘আবদুর রহমান, ‘উবাইদুল্লাহ ইবনু ‘আবদুল্লাহ ইবনু উত্বাহ, আবান ইবনু ‘উসমান, ‘আলী ইবনু হুসাইন, শুরায়হ, সা‘ঈদ বিনু যুবায়র, কাসিম, সালিম, তাউস, হাসান, ইকরিমা, ‘আত্বা, আমির ইবনু সা‘দ, জাবির ইবনু যায়দ, নাফি‘ ইবনু যুবায়র, মুহাম্মাদ ইবনু কা‘ব, সুলাইমান ইবনু ইয়াসার, মুজাহিদ, কাসিম ইবনু ‘আবদুর রহমান, ‘আমর ইবনু হারিম ও শা‘বী (রহ.) প্রমুখ থেকেও বর্ণিত আছে যে, বিয়ের পূর্বে তালাক বর্তায় না। 68/10. بَاب إِذَا قَالَ لِامْرَأَتِه„ وَهُوَ مُكْرَهٌ هٰذِه„ أُخْتِي فَلاَ شَيْءَ عَلَيْهِ. ৬৮/১০. অধ্যায়ঃ বিশেষ কারণে যদি কেউ স্বীয় স্ত্রীকে বোন বলে পরিচয় দেয়, তাতে কিছু হবে না। قَالَ النَّبِيُّ صَلّٰى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ إِبْرَاهِيمُ لِسَارَةَ هٰذِه„ أُخْتِي وَذ‘لِكَ فِي ذَاتِ اللهِ عَزَّ وَجَلَّ. নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ ইবরাহীম আঃ) একদা) স্বীয় সহধর্মিণী সারাহকে লক্ষ্য করে বলেছিলেন, এটি আমার বোন। আর তা ছিল দ্বীনী সম্পর্কের সূত্রে। لِقَوْلِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الأَعْمَالُ بِالنِّيَّةِ وَلِكُلِّ امْرِئٍ مَا نَوَى». وَتَلاَ الشَّعْبِيُّ: (لاَ تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا) وَمَا لاَ يَجُوزُ مَنْ إِقْرَارِ الْمُوَسْوِسِ. وَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلَّذِي أَقَرَّ عَلَى نَفْسِهِ: «أَبِكَ جُنُونٌ». وَقَالَ عَلِيٌّ بَقَرَ حَمْزَةُ خَوَاصِرَ شَارِفَيَّ، فَطَفِقَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَلُومُ حَمْزَةَ، فَإِذَا حَمْزَةُ قَدْ ثَمِلَ مُحْمَرَّةٌ عَيْنَاهُ، ثُمَّ قَالَ حَمْزَةُ هَلْ أَنْتُمْ إِلاَّ عَبِيدٌ لأَبِي فَعَرَفَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَدْ ثَمِلَ، فَخَرَجَ وَخَرَجْنَا مَعَهُ، وَقَالَ عُثْمَانُ لَيْسَ لِمَجْنُونٍ وَلاَ لِسَكْرَانَ طَلاَقٌ. وَقَالَ ابْنُ عَبَّاسٍ طَلاَقُ السَّكْرَانِ وَالْمُسْتَكْرَهِ لَيْسَ بِجَائِزٍ. وَقَالَ عُقْبَةُ بْنُ عَامِرٍ لاَ يَجُوزُ طَلاَقُ الْمُوَسْوِسِ. وَقَالَ عَطَاءٌ إِذَا بَدَا بِالطَّلاَقِ فَلَهُ شَرْطُهُ. وَقَالَ نَافِعٌ طَلَّقَ رَجُلٌ امْرَأَتَهُ الْبَتَّةَ إِنْ خَرَجَتْ، فَقَالَ ابْنُ عُمَرَ إِنْ خَرَجَتْ فَقَدْ بُتَّتْ مِنْهُ، وَإِنْ لَمْ تَخْرُجْ فَلَيْسَ بِشَيْءٍ. وَقَالَ الزُّهْرِيُّ فِيمَنْ قَالَ إِنْ لَمْ أَفْعَلْ كَذَا وَكَذَا فَامْرَأَتِي طَالِقٌ ثَلاَثًا يُسْئَلُ عَمَّا قَالَ، وَعَقَدَ عَلَيْهِ قَلْبُهُ، حِينَ حَلَفَ بِتِلْكَ الْيَمِينِ، فَإِنْ سَمَّى أَجَلاً أَرَادَهُ وَعَقَدَ عَلَيْهِ قَلْبُهُ حِينَ حَلَفَ، جُعِلَ ذَلِكَ فِي دِينِهِ وَأَمَانَتِهِ. وَقَالَ إِبْرَاهِيمُ إِنْ قَالَ لاَ حَاجَةَ لِي فِيكِ. نِيَّتُهُ، وَطَلاَقُ كُلِّ قَوْمٍ بِلِسَانِهِمْ. وَقَالَ قَتَادَةُ إِذَا قَالَ إِذَا حَمَلْتِ فَأَنْتِ طَالِقٌ. ثَلاَثًا، يَغْشَاهَا عِنْدَ كُلِّ طُهْرٍ مَرَّةً، فَإِنِ اسْتَبَانَ حَمْلُهَا فَقَدْ بَانَتْ. وَقَالَ الْحَسَنُ إِذَا قَالَ الْحَقِي بِأَهْلِكِ. نِيَّتُهُ. وَقَالَ ابْنُ عَبَّاسٍ الطَّلاَقُ عَنْ وَطَرٍ، وَالْعَتَاقُ مَا أُرِيدَ بِهِ وَجْهُ اللَّهِ. وَقَالَ الزُّهْرِيُّ إِنْ قَالَ مَا أَنْتِ بِامْرَأَتِي. نِيَّتُهُ، وَإِنْ نَوَى طَلاَقًا فَهْوَ مَا نَوَى. وَقَالَ عَلِيٌّ أَلَمْ تَعْلَمْ أَنَّ الْقَلَمَ رُفِعَ عَنْ ثَلاَثَةٍ عَنِ الْمَجْنُونِ حَتَّى يُفِيقَ، وَعَنِ الصَّبِيِّ حَتَّى يُدْرِكَ، وَعَنِ النَّائِمِ حَتَّى يَسْتَيْقِظَ. وَقَالَ عَلِيٌّ وَكُلُّ الطَّلاَقِ جَائِزٌ إِلاَّ طَلاَقَ الْمَعْتُوهِ. স্বীয় ব্যভিচারের কথা স্বীকারকারী এক ব্যক্তিকে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছিলেনঃ তুমি কি পাগল হয়েছ? ‘আলী(রাঃ) বলেন, হামযাহ (রাঃ) আমার দু’টি উটনীর পার্শ্বদেশ ফেড়ে ফেললে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হামযাকে তিরস্কার করতে থাকেন। হঠাৎ দেখা গেল নেশার ঘোরে হামযাহর চক্ষু দুটি লাল হয়ে গেছে। এরপর হামযাহ বললেন, তোমরা তো আমার বাবার গোলাম ব্যতীত নও। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বুঝতে পারলেন, তিনি নিশাগ্রস্ত হয়েছেন। তিনি সেখান থেকে বেরিয়ে এলেন আমরাও তাঁর সঙ্গে বেরিয়ে এলাম। ‘উসমান(রাঃ) বলেন, পাগল ও নেশাগ্রস্ত ব্যক্তির তালাক জায়িয নয়। ‘উকবাহ ইবনু ‘আমির (রাঃ) বলেন, ওয়াসওয়াসা সম্পন্ন সন্দেহের বাতিকগ্রস্ত) ব্যক্তির তালাক কার্যকর হয় না। ইবনু আব্বাস (রাঃ) বলেন, মাতাল ও বাধ্যকৃতের তালাক অবৈধ। ‘আত্বা (রহ.) বলেনঃ শর্ত যুক্ত করে তালাক দিলে শর্ত পূরণের পরই তালাক হবে। নাফি (রহ.) জিজ্ঞেস করলেন, ঘর থেকে বের হওয়ার শর্তে স্বীয় স্ত্রীকে জনৈক ব্যক্তি তিন তালাক দিল- এর হুকুম কী?)। ইবনু ‘উমার (রহ.) বললেনঃ যদি সে মহিলা ঘর থেকে বের হয়, তাহলে সে তিন তালাকপ্রাপ্তা হবে। আর যদি বের না হয়, তাহলে কিছুই হবে না। যুহরী (রহ.) বলেন, যে ব্যক্তি বললঃ যদি আমি এরূপ না করি, তবে আমার স্ত্রীর প্রতি তিন তালাক প্রযোজ্য হবে। তার সম্বন্ধে যুহরী (রহ.) বলেন, উক্ত ব্যক্তিকে জিজ্ঞেস করা হবে, শপথকালে তার ইচ্ছা কী ছিল? যদি সে ইচ্ছে করে মেয়াদ নির্ধারণ করে থাকে এবং শপথকালে তার এ ধরনের নিয়্যাত থাকে, তাহলে এ বিষয়কে তার দ্বীন ও আমানতের উপর ন্যস্ত করা হবে। ইবরাহীম (রহ.) বলেন, যদি সে বলে, ‘‘তোমাকে আমার কোন প্রয়োজন নেই’’; তবে তার নিয়্যাত অনুসারে কাজ হবে। আর প্রত্যেক সম্প্রদায়ের লোক তাদের নিজস্ব ভাষায় তালাক দিতে পারে। ক্বাতাদাহ (রহ.) বলেনঃ যদি কেউ বলে তুমি গর্ভবতী হলে, তোমার প্রতি তিন তালাক। তাহলে সে প্রতি তুহরে স্ত্রীর সঙ্গে একবার সহবাস করবে। যখনই গর্ভ প্রকাশিত হবে, তখনি সে স্বামী থেকে বিচ্ছিন্ন হয়ে যাবে। হাসান (রহ.) বলেন, যদি কেউ বলে, ‘‘তুমি তোমার পরিবারের কাছে চলে যাও’’, তবে তার নিয়্যাত অনুসারে ফায়সালা হবে। ইবনু ‘আব্বাস (রাঃ) বলেনঃ প্রয়োজনের তাগিদে তালাক দেয়া হয়। আর দাসমুক্তি আল্লাহর সন্তুষ্টির উদ্দেশ্য থাকলেই করা যায়। যুহরী (রহ.) বলেন, যদি কেউ বলেঃ তুমি আমার স্ত্রী নও, তবে তালাক হওয়া বা না হওয়া নিয়্যাতের উপর নির্ভর করবে। যদি সে তালাকের নিয়্যাত করে থাকে, তবে তাই হবে। ‘আলী (রাঃ) [উমার (রাঃ)-কে সম্বোধন করে] বলেনঃ আপনি কি জানেন না যে, তিন প্রকারের লোক থেকে কসম তুলে নেয়া হয়েছে। এক, পাগল ব্যক্তি, যতক্ষণ না সে জ্ঞান ফিরে পায়; দুই, শিশু যতক্ষণ না সে বয়ঃপ্রাপ্ত হয়; তিন, ঘুমন্ত ব্যক্তি, যতক্ষণ না সে জেগে উঠে। ‘আলী(রাঃ) আরও) বলেনঃ পাগল ব্যতীত সকলের তালাক কার্যকর হয়। ৫২৬৯. আবূ হুরাইরাহ (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেছেনঃ আল্লাহ আমার উম্মতের হৃদয়ে যে খেয়াল জাগ্রত হয় তা ক্ষমা করে দিয়েছেন, যতক্ষণ না সে তা কার্যে পরিণত করে বা মুখে উচ্চারণ করে। ক্বাতাদাহ (রহ.) বলেনঃ মনে মনে তালাক দিলে তাতে কিছুইতালাক হবে না। [২৫২৮] আধুনিক প্রকাশনী- ৪৮৮৩, ইসলামিক ফাউন্ডেশন- ৪৭৭৮",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 5270,
			"arabicnumber": 5270,
			"text": "জাবির (রাঃ) হতে বর্ণিত যে, আসলাম গোত্রের এক ব্যক্তি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট এলো; তখন তিনি মসজিদে ছিলেন। সে বললঃ সে ব্যভিচার করেছে। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার থেকে মুখ ফিরিয়ে নিলেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যেদিক মুখ ফিরিয়ে ছিলেন, সেদিকে এসে সে লোকটি নিজের সম্পর্কে বারবার ব্যভিচারের) সাক্ষ্য দিল। তিনি লোকটিকে ডেকে বললেন, তুমি কি পাগল হয়েছ? তুমি কি বিবাহিত? সে বলল হাঁ, তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে ঈদগাহে নিয়ে রজম করার আদেশ দিলেন। পাথরের আঘাত যখন তাকে অতিষ্ঠ করে তুলল, তখন সে পালিয়ে গেল। অবশেষে তাকে হাররা নামক স্থানে ধরা হলো এবং হত্যা করা হলো। [৫২৭২, ৬৮১৪, ৬৮১৬, ৬৮২০, ৬৮২৬, ৭১৬৮; মুসলিম ২৯/৫, হাঃ ১৬৯১, আহমাদ ১৪৪৬৯] আধুনিক প্রকাশনী- ৪৮৮৪, ইসলামিক ফাউন্ডেশন- ৪৭৭৯",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 5272,
			"arabicnumber": 5272,
			"text": "",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 5273,
			"arabicnumber": 5273,
			"text": "وَقَوْلِ اللَّهِ تَعَالَى: (وَلاَ يَحِلُّ لَكُمْ أَنْ تَأْخُذُوا مِمَّا آتَيْتُمُوهُنَّ شَيْئًا) إِلَى قَوْلِهِ: (الظَّالِمُونَ) وَأَجَازَ عُمَرُ الْخُلْعَ دُونَ السُّلْطَانِ، وَأَجَازَ عُثْمَانُ الْخُلْعَ دُونَ عِقَاصِ رَأْسِهَا. وَقَالَ طَاوُسٌ: (إِلاَّ أَنْ يَخَافَا أَنْ لاَ يُقِيمَا حُدُودَ اللَّهِ) فِيمَا افْتَرَضَ لِكُلِّ وَاحِدٍ مِنْهُمَا عَلَى صَاحِبِهِ فِي الْعِشْرَةِ وَالصُّحْبَةِ، وَلَمْ يَقُلْ قَوْلَ السُّفَهَاءِ لاَ يَحِلُّ. حَتَّى تَقُولَ لاَ أَغْتَسِلُ لَكَ مِنْ جَنَابَةٍ মহান আল্লাহর বাণীঃ ‘‘তোমাদের পক্ষে তাদেরকে দেয়া মালের কিছুই ফিরিয়ে নেয়া জায়িয হবে না, কিন্তু যদি তারা উভয়ে আশঙ্কা করে যে তারা আল্লাহর নির্ধারিত সীমারেখা রক্ষা করে চলতে পারবে না (তাহলে অন্য ব্যবস্থা)। অতঃপর যদি তোমরা উভয় পক্ষের (শালিসগণ) আশঙ্কা কর যে উভয়পক্ষ আল্লাহর আইনসমূহ ঠিক রাখতে পারবে না, তাহলে উভয়ের প্রতি কোন গুনাহ নেই যদি কোন কিছুর বিনিময়ে স্ত্রী নিজেকে মুক্ত করতে চায়। এগুলো আল্লাহর আইন, কাজেই তোমরা এগুলোকে লঙ্ঘন করো না, আর যারা আল্লাহর আইনসমূহ লঙ্ঘন করবে, তারাই যালিম।’’সূরাহ আল-বাক্বারাহ ২/২২৯) ‘উমার (রাঃ) কাযীর অনুমতি ব্যতীত খুলা’কে বৈধ বলেছেন। ‘উসমান (রাঃ) মাথার বেনী ব্যতীত অন্য সকল কিছুর পরিবর্তে খুলা’ করার অনুমতি দিয়েছেন। তাউস (রহ.) বলেন, যদি তারা উভয়ে আল্লাহর সীমা ঠিক না রাখতে পারার আশঙ্কা করে অর্থাৎ সংসার জীবনে তাদের প্রত্যেকের উপর যে দায়িত্ব আল্লাহ অর্পণ করেছেন সে ব্যাপারে। তিনি বোকাদের মাঝে এ কথা বলেননি যে, খুলা ততক্ষণ বৈধ হবে না, যতক্ষণ না মহিলা বলবে আমি জুনবী হয়ে তোমার জন্য গোসল করব না অর্থাৎ যতক্ষণ না মহিলা তাকে সহবাস থেকে বাধা দান করবে। ৫২৭৩. ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত যে, সাবিত ইবনু কায়স এর স্ত্রী নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে এসে বলল, হে আল্লাহর রাসূল! চরিত্রগত বা দ্বীনী বিষয়ে সাবিত ইবনু কায়সের উপর আমি দোষারোপ করছি না। তবে আমি ইসলামের ভিতরে থেকে কুফরী করা অর্থাৎ স্বামীর সঙ্গে অমিল) পছন্দ করছি না। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তুমি কি তার বাগানটি ফিরিয়ে দেবে? সে বললঃ হ্যাঁ। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তুমি বাগানটি গ্রহণ কর এবং মহিলাকে এক তালাক দিয়ে দাও। [৫২৭৪, ৫২৭৫, ৫২৭৬, ৫২৭৭] আধুনিক প্রকাশনী- ৪৮৮৬, ইসলামিক ফাউন্ডেশন- ৪৭৮১",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 5274,
			"arabicnumber": 5274,
			"text": "৫২৭৪ ‘আবদুল্লাহ ইবনু উবায়র বোন হতেও উক্ত হাদীসটি বর্ণিত। তাতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তুমি কি তার বাগানটি ফিরিয়ে দেবে? মহিলা বললঃ হাঁ। পরে সে বাগানটি ফেরত দিল, আর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে তালাক দেয়ার জন্য তার স্বামীকে নির্দেশ দিলেন। ইবরাহীম ইবনু তাহমান খালিদ থেকে, তিনি ইকরামাহ থেকে তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে \"তাঁকে তালাক দাও\" কথাটিও বর্ণনা করেছেন। [৫২৭৩] আধুনিক প্রকাশনী- ৪৮৮৭, ইসলামিক ফাউন্ডেশন- ৪৭৮২",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 5275,
			"arabicnumber": 5275,
			"text": "অন্য বর্ণনায় ইবনু আবূ তামীমা ইকরামাহ সূত্রে ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণনা করেন। তিনি বলেছেনঃ সাবিত ইবনু কায়স (রাঃ)-এর স্ত্রী রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট এসে বললঃ হে আল্লাহর রাসূল! সাবিতের দ্বীনদারী ও চরিত্রের ব্যাপারে আমি কোন দোষারোপ করছি না, তবে আমি তার সঙ্গে সংসার জীবন নির্বাহ করতে পারছি না। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জিজ্ঞেস করলেন, তুমি তার বাগানটি কি ফিরিয়ে দেবে? সে বললঃ হাঁ। [৫২৭৩] আধুনিক প্রকাশনী- ৪৮৮৭, ইসলামিক ফাউন্ডেশন- ৪৭৮২",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 5276,
			"arabicnumber": 5276,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, সাবিত ইবনু কায়স ইবনু শাম্মাস (রাঃ)-এর স্ত্রী নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে এসে বললঃ হে আল্লাহর রাসূল! আমি সাবিতের দ্বীন ও চরিত্রের ব্যাপারে কোন দোষ দিচ্ছি না। তবে আমি কুফরীর আশঙ্কা করছি। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে জিজ্ঞাসা করলেনঃ তুমি কি তার বাগানটি ফিরিয়ে দিতে প্রস্তুত আছ? সে বললঃ হাঁ। অতঃপর সে বাগানটি তাকে (স্বামীকে) ফিরিয়ে দিল। আর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার স্বামীকে নির্দেশ দিলেন, সে মহিলাকে পৃথক করে দিল। [৫২৭৩] আধুনিক প্রকাশনী- ৪৮৮৮, ইসলামিক ফাউন্ডেশন- ৪৭৮৩",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 5277,
			"arabicnumber": 5277,
			"text": "ইকরামাহ (রহ.) হতে বর্ণিত যে, জামীলা সাবিতের স্ত্রী এরপর উক্ত হাদীসটি উল্লেখ করেন। [৫২৭৩] আধুনিক প্রকাশনী- ৪৮৮৯, ইসলামিক ফাউন্ডেশন- ৪৭৮৪",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 5278,
			"arabicnumber": 5278,
			"text": "وَهَلْ يُشِيرُ بِالْخُلْعِ عِنْدَ الضَّرُورَةِ وَقَوْلِهِ تَعَالَى: (وَإِنْ خِفْتُمْ شِقَاقَ بَيْنِهِمَا فَابْعَثُوا حَكَمًا مِنْ أَهْلِهِ) إِلَى قَوْلِهِ: (خَبِيرًا). মহান আল্লাহর বাণীঃ ‘‘যদি তোমরা তাদের মধ্যে অনৈক্যের আশংকা কর, তবে স্বামীর আত্মীয়-স্বজন হতে একজন এবং স্ত্রীর আত্মীয়-স্বজন হতে একজন সালিস নিযুক্ত কর। যদি উভয়ে মীমাংসা করিয়ে দেয়ার ইচ্ছে করে, তবে আল্লাহ উভয়ের মধ্যে নিষ্পত্তির ব্যবস্থা করবেন, নিশ্চয় আল্লাহ সব কিছু জানেন, সকল কিছুর খবর রাখেন।’’সূরাহ আন্-নিসা ৪/৩৫) ৫২৭৮. মিসওয়ার ইবনু মাখরামাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি যে, বনু মুগীরাহর লোকেরা তাদের মেয়েকে ‘‘আলী যেন বিয়ে করেন এ অনুমতি চেয়েছিল, আমি এর অনুমতি দিতে পারি না। আধুনিক প্রকাশনী- ৪৮৯০, ইসলামিক ফাউন্ডেশন- ৪৭৮৫",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 5279,
			"arabicnumber": 5279,
			"text": "নবী সহধর্মিণী ‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, বারীরার মাধ্যমে তিনটি বিধান জানা গেছে। এক. তাকে আযাদ করা হলো, এরপর তাকে তার স্বামীর সঙ্গে থাকা বা না থাকার ইখতিয়ার দেয়া হলো। দুই. রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, আযাদকারী আযাদকৃত গোলামের পরিত্যক্ত সম্পত্তির মালিক হবে। তিন. রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঘরে প্রবেশ করলেন, দেখতে পেলেন হাঁড়িতে গোশত ফুটছে। তাঁর কাছে রুটি ও ঘরের অন্য তরকারী নিয়ে আসা হলো। তখন তিনি বললেনঃ গোশতের পাত্র দেখছি না যে যাতে গোশ্ত ছিল? লোকেরা জবাব দিল, হাঁ, কিন্তু সে গোশত বারীরাহ্কে সদাকাহ হিসাবে দেয়া হয়েছে। আর আপনি তো সদাকাহ খান না? তিনি বললেনঃ তার জন্য সদাকাহ, আর আমাদের জন্য এটা উপঢৌকন। [৪৫৬] আধুনিক প্রকাশনী- ৪৮৯১, ইসলামিক ফাউন্ডেশন- ৪৭৮৬",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 5280,
			"arabicnumber": 5280,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি তাকে অর্থাৎ বারীরার স্বামীকে ক্রীতদাস অবস্থায় দেখেছি। [৫২৮১, ৫২৮২, ৫২৮৩] আধুনিক প্রকাশনী- ৪৮৯২, ইসলামিক ফাউন্ডেশন- ৪৭৮৭",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 5281,
			"arabicnumber": 5281,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, অমুক গোত্রের গোলাম এই মুগীস অর্থাৎ বারীরার স্বামী; আমি যেন তাকে এখনও মদিনার অলিতে গলিতে কেঁদে কেঁদে বারীরার পিছে পিছে ঘুরতে দেখছি। [৫২৮০] আধুনিক প্রকাশনী- ৪৮৯৩, ইসলামিক ফাউন্ডেশন- ৪৭৮৮",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 5282,
			"arabicnumber": 5282,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেনঃ বারীরার স্বামী কালো গোলাম ছিল। তাকে মুগিস নামে ডাকা হত। সে অমুক গোত্রের গোলাম ছিল। আমি যেন এখনো দেখছি সে মদিনার অলিতে গলিতে বারীরার পিছে পিছে ঘুরছে। [৫২৮০] আধুনিক প্রকাশনী- ৪৮৯৪, ইসলামিক ফাউন্ডেশন- ৪৭৮৯",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 5283,
			"arabicnumber": 5283,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত যে, বারীরার স্বামী ক্রীতদাস ছিল। মুগীস নামে তাকে ডাকা হত। আমি যেন এখনও তাকে দেখছি সে বারীরার পিছে কেঁদে কেঁদে ঘুরছে, আর তার দাড়ি বেয়ে অশ্রু ঝরছে। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ হে ‘আব্বাস! বারীরার প্রতি মুগীসের ভালবাসা এবং মুগীসের প্রতি বারীরার অনাসক্তি দেখে তুমি কি আশ্চর্যান্বিত হওনা? এরপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ বারীরা) তুমি যদি তার কাছে আবার ফিরে যেতে! সে বললঃ হে আল্লাহর রাসূল! আপনি কি আমাকে হুকুম দিচ্ছেন? তিনি বললেনঃ আমি কেবল সুপারিশ করছি। সে বললঃ তাকে দিয়ে আমার কোন প্রয়োজন নেই। [৫২৮০] আধুনিক প্রকাশনী- ৪৮৯৫, ইসলামিক ফাউন্ডেশন- ৪৭৯০",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 5284,
			"arabicnumber": 5284,
			"text": "আসওয়াদ (রহ.) হতে বর্ণিত যে, ‘আয়িশাহ (রাঃ) বারীরাকে কিনতে চাইলেন। কিন্তু তার মালিকগণ ওলী’র অভিভাবকত্বের অধিকার) শর্ত ব্যতীত বিক্রয় করতে অসম্মতি জানাল। তিনি বিষয়টি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে জানালেন। তিনি বললেনঃ তুমি তাকে কিনে নাও এবং মুক্ত করে দাও। কেননা, ওলী’র অধিকারী হল সে, যে আযাদ করে। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট কিছু গোশ্ত আনা হল এবং বলা হল এ গোশত বারীরাহকে সদাকাহ করা হয়েছে। তিনি বললেনঃ সেটা তার জন্য সদাকাহ আর আমাদের জন্য হাদিয়া। [৪৫৬] আধুনিক প্রকাশনী- ৪৮৯৬, ইসলামিক ফাউন্ডেশন- ৪৭৯১) আদম বর্ণনা করেন, শু‘বাহ আমাদের কাছে এ হাদীসটি বর্ণনা করেছেন। তাতে আরও বলা হয়েছে, স্বামীর সঙ্গে থাকা বা না থাকার ব্যাপারে তাকে এখতিয়ার দেয়া হয়েছিল। আধুনিক প্রকাশনী- ৪৮৯৭, ইসলামিক ফাউন্ডেশন- ৪৭৯২",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 5285,
			"arabicnumber": 5285,
			"text": "(‘‘মুশরিকা নারীরা ঈমান না আনা পর্যন্ত তোমরা তাদেরকে বিবাহ করো না। মূলতঃ মু’মিন ক্রীতদাসী মুশরিকা নারী হতে উত্তম ওদেরকে তোমাদের যতই ভাল লাগুক না কেন।\"সূরাহ আল-বাক্বারাহ ২/২২১) ৫২৮৫. নাফি‘ (রহ.) হতে বর্ণিত যে, ইবনু ‘উমারকে কোন খৃষ্টান বা ইয়াহূদী নারীর বিবাহ সম্বন্ধে জিজ্ঞেস করা হলে তিনি বলেনঃ আল্লাহ তা‘আলা মু’মিনদের উপর মুশরিক নারীদের বিবাহ হারাম করে দিয়েছেন। আর এর চেয়ে ভয়ানক শির্ক কী হতে পারে যে মহিলা বলে, আমার প্রভু ঈসা (আঃ)। অথচ তিনিও আল্লাহর বান্দাগণের মধ্যে একজন বান্দাহ। আধুনিক প্রকাশনী- ৪৮৯৮, ইসলামিক ফাউন্ডেশন- ৪৭৯৩",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 5286,
			"arabicnumber": 5286,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামও মু’মিনদের ব্যাপারে মুশরিকরা দু’ দলে বিভক্ত ছিল। একদল ছিল হারবী মুশরিক, তিনি তাদের বিরুদ্ধে যুদ্ধ করতেন এবং তারাও তাঁর বিরুদ্ধে যুদ্ধ করত। অন্যদল ছিল চুক্তিবদ্ধ মুশরিক। তিনি তাদের সাথে যুদ্ধ করতেন না এবং তারাও তাঁর সাথে যুদ্ধ করত না। হারবীদের কোন মহিলা যদি হিজরাত করে (মুসলিমদের) কাছে চলে আসত, তাহলে সে ঋতুমতী হয়ে পুনরায় পবিত্র না হওয়া পর্যন্ত তার কাছে বিয়ের প্রস্তাব দেয়া হতো না। পবিত্র হওয়ার পর তার সাথে বিবাহ বৈধ হত। তবে যদি বিয়ের পূর্বেই তার স্বামী হিজরাত করত, তাহলে মহিলাকে তাঁর কাছেই ফিরিয়ে দিতে হত। আর যদি তাদের কোন দাস বা দাসী হিজরাত করত, তাহলে তারা আযাদ হয়ে যেত এবং মুহাজিরদের সমান অধিকার লাভ করত। এরপর বর্ণনাকারী (‘আত্বা) চুক্তিবদ্ধ মুশরিকদের সম্পর্কে মুজাহিদের অনুরূপ হাদীস বর্ণনা করেছেন। যদি চুক্তিবদ্ধ মুশরিকদের কোন দাস বা দাসী হিজরাত করে আসত, তাহলে তাদেরকে পুনরায় পাঠিয়ে দেয়া হতো না। তবে তাদের মূল্য ফিরিয়ে দেয়া হতো।",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 5287,
			"arabicnumber": 5287,
			"text": "‘‘আত্বা (রহ.) ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণনা করেন যে, আবূ উমাইয়্যার কন্যা করীবাহা ‘উমার ইবনু খাত্তাবের সঙ্গে বিবাহে আবদ্ধ ছিল। তিনি তাকে তালাক দিলে মু‘আবিয়াহ ইবনু আবূ সুফ্ইয়ান তাকে বিয়ে করেন। আর আবূ সুফ্ইয়ানের কন্যা উম্মুল হাকাম ইয়ায ইবনু গান্ম ফিহরীর সঙ্গে বিবাহে আবদ্ধ ছিল। তিনি তাকে তালাক দিলে ‘আবদুল্লাহ ইবনু ‘উসমান সাকাফী (রাঃ) তাকে বিয়ে করেন। (আধুনিক প্রকাশনী- ৪৮৯৯, ইসলামিক ফাউন্ডেশন- ৪৭৯৪)",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 5288,
			"arabicnumber": 5288,
			"text": "وَقَالَ عَبْدُ الْوَارِثِ عَنْ خَالِدٍ عَنْ عِكْرِمَةَ عَنِ ابْنِ عَبَّاسٍ إِذَا أَسْلَمَتِ النَّصْرَانِيَّةُ قَبْلَ زَوْجِهَا بِسَاعَةٍ حَرُمَتْ عَلَيْهِ. وَقَالَ دَاوُدُ عَنْ إِبْرَاهِيمَ الصَّائِغِ سُئِلَ عَطَاءٌ عَنِ امْرَأَةٍ مِنْ أَهْلِ الْعَهْدِ أَسْلَمَتْ ثُمَّ أَسْلَمَ زَوْجُهَا فِي الْعِدَّةِ أَهِيَ امْرَأَتُهُ قَالَ لاَ، إِلاَّ أَنْ تَشَاءَ هِيَ بِنِكَاحٍ جَدِيدٍ وَصَدَاقٍ. وَقَالَ مُجَاهِدٌ إِذَا أَسْلَمَ فِي الْعِدَّةِ يَتَزَوَّجُهَا. وَقَالَ اللَّهُ تَعَالَى: (لاَ هُنَّ حِلٌّ لَهُمْ وَلاَ هُمْ يَحِلُّونَ لَهُنَّ). وَقَالَ الْحَسَنُ وَقَتَادَةُ فِي مَجُوسِيَّيْنِ أَسْلَمَا هُمَا عَلَى نِكَاحِهِمَا، وَإِذَا سَبَقَ أَحَدُهُمَا صَاحِبَهُ وَأَبَى الآخَرُ بَانَتْ، لاَ سَبِيلَ لَهُ عَلَيْهَا. وَقَالَ ابْنُ جُرَيْجٍ قُلْتُ لِعَطَاءٍ امْرَأَةٌ مِنَ الْمُشْرِكِينَ جَاءَتْ إِلَى الْمُسْلِمِينَ أَيُعَاوَضُ زَوْجُهَا مِنْهَا، لِقَوْلِهِ تَعَالَى: (وَآتُوهُمْ مَا أَنْفَقُوا) قَالَ لاَ إِنَّمَا كَانَ ذَاكَ بَيْنَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَبَيْنَ أَهْلِ الْعَهْدِ. وَقَالَ مُجَاهِدٌ هَذَا كُلُّهُ فِي صُلْحٍ بَيْنَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَبَيْنَ قُرَيْشٍ. ‘আবদুল ওয়ারিস (রহ.) ........ ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণনা করেন যে, যদি কোন খৃষ্টান নারী তার স্বামীর পূর্বে ইসলাম গ্রহণ করে, তবে উক্ত মহিলা তার জন্য হারাম হয়ে যায়। দাউদ (রহ.) ইবরাহীম সায়েগ (রহ.) থেকে বর্ণনা করেন, ‘আত্বা (রহ.)-কে জিজ্ঞেস করা হল, চুক্তিবদ্ধ কোন হারবীর স্ত্রী যদি ইসলাম গ্রহণ করে এবং ইদ্দাতের মধ্যেই তার স্বামীও ইসলাম গ্রহণ করে, তবে কি মহিলা তার স্ত্রী থাকবে? তিনি উত্তর দিলেন, না। তবে সে মহিলা যদি নতুনভাবে বিয়ে ও মোহরে সম্মত হয়। মুজাহিদ (রহ.) বলেন, মহিলার ইদ্দাতের মধ্যে স্বামী মুসলিম হলে সে তাকে বিয়ে করে নিবে। আল্লাহ তা‘আলা বলেছেনঃ ‘‘না তারা কাফিরদের জন্য হালাল, আর না কাফিরেরা তাদের জন্য হালাল’’- সূরাহ মুমতাহিনাহ ৬০/১০)। অগ্নি উপাসক স্বামী-স্ত্রী মুসলিম হলে ক্বাতাদাহ ও হাসান তাদের সম্বন্ধে বলেন, তাদের পূর্ব বিবাহ বলবৎ থাকবে। আর যদি তাদের কেউ আগে ইসলাম গ্রহণ করে, আর অন্যজন অস্বীকৃতি জানায়, তবে মহিলা তার থেকে বিচ্ছিন্ন হয়ে যাবে। স্বামীর জন্য তাকে গ্রহণ করার কোন পথ খোলা থাকবে না। ইবনু জুরাইজ (রহ.) বলেন, আমি ‘আত্বা (রহ.)-কে জিজ্ঞেস করলামঃ মুশরিকদের কোন মহিলা যদি ইসলাম গ্রহণ করে মুসলিমদের নিকট চলে আসে, তাহলে তার স্বামী কি তাত্থেকে বিনিময় গ্রহণ করতে পারবে? আল্লাহ তা‘আলা তো বলেছেনঃ ‘‘তারা যা ব্যয় করেছে তোমরা তাদেরকে তা দিয়ে দাও।’’ তিনি উত্তর দিলেনঃ না। এ আদেশ কেবল নবীসাল্লাল্লাহু আলাইহি ওয়াসাল্লামও জিম্মীদের মধ্যে ছিল। মুশরিকদের ক্ষেত্রে এটা প্রযোজ্য নয়)। মুজাহিদ (রহ.) বলেনঃ এ সব কিছু সে সন্ধির ক্ষেত্রে প্রযোজ্য ছিল যা নবীসাল্লাল্লাহু আলাইহি ওয়াসাল্লামও কুরাইশদের মধ্যে হয়েছিল। ৫২৮৮. ‘উরওয়াহ ইবনু যুবায়র (রহ.) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সহধর্মিণী ‘আয়িশাহ (রাঃ) বলেন, ঈমানদার নারী যখন হিজরাত করে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে আসত, তখন তিনি আল্লাহরএ নির্দেশঃ- ‘‘হে মু’মিনগণ! ঈমানদার নারীরা যখন তোমাদের কাছে হিজরাত করে আসে তখন তাদেরকে পরখ করে দেখ’’ অনুসারে তাদেরকে পরখ করতেন। (তারা সত্যিই ঈমান এনেছে কি না)....... আয়াতের শেষ পর্যন্ত)।’’ সূরাহ আল-মুমতাহিনাহ ৬০ ঃ ১০) ‘আয়িশাহ (রাঃ) বলেনঃ ঈমানদার নারীদের মধ্যে যারা আয়াতে উল্লেখিত) শর্তাবলী মেনে নিত, তারা পরীক্ষায় উত্তীর্ণ হত। তাই যখনই তারা এ সম্পর্কে মুখে স্বীকারোক্তি করত তখনই রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদেরকে বলতেন যাও, আমি তোমাদের বাই’আত গ্রহণ করেছি। আল্লাহর কসম! কথার দ্বারা বাই’আত গ্রহণ ব্যতীত রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর হাত কখনো কোন নারীর হাত স্পর্শ করেনি। আল্লাহর কসম! তিনি কেবল সেসব বিষয়েই বাই‘আত গ্রহণ করতেন, যে সব বিষয়ে বাই‘আত গ্রহণ করার জন্য আল্লাহ তাঁকে নির্দেশ দিয়েছেন। বাই‘আত গ্রহণ শেষে তিনি বলতেনঃ আমি কথা দ্বারা তোমাদের বাই‘আত গ্রহণ করলাম। [২৭১৩; মুসলিম ৩৩/২১, হাঃ ১৮৬৬, আহমাদ ২৬৩৮৬] আধুনিক প্রকাশনী- ৪৯০০, ইসলামিক ফাউন্ডেশন- ৪৭৯৫) বাই‘আতের উপর একটি টিকা হবে।",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 5289,
			"arabicnumber": 5289,
			"text": "(‘‘যারা নিজেদের স্ত্রীদের নিকট না যাওয়ার জন্য শপথ গ্রহণ করে, তাদের জন্য চার মাসের অবকাশ আছে। যদি তারা উক্ত সময়ের মধ্যে ফিরে আসে, তবে নিশ্চয়ই আল্লাহ ক্ষমাশীল, পরম দয়ালু। এবং তারা যদি তালাক দেয়ার সংকল্প করে, তবে আল্লাহ সর্বশ্রোতা ও সর্বজ্ঞ।’’ সূরাহ আল-বাক্বারাহ ২/২২৬-২২৭) অর্থ‘‘ তারা যদি প্রত্যাবর্তন করে’’। ৫২৮৯. আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একবার তাঁর স্ত্রীদের ব্যাপারে ঈলা কাছে না যাওয়ার শপথ) করলেন। সে সময় তাঁর পা মচকে গিয়েছিল। তিনি তাঁর কক্ষের মাচায় ঊনত্রিশ দিন অবস্থান করেন। অতঃপর সেখান থেকে নেমে আসেন। লোকেরা বললঃ হে আল্লাহর রাসূল! আপনি তো এক মাসের শপথ করেছিলেন। তিনি বললেনঃ ঊনত্রিশ দিনেও মাস হয়। [৩৭৮] আধুনিক প্রকাশনী- ৪৯০১, ইসলামিক ফাউন্ডেশন- ৪৭৯৬",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 5290,
			"arabicnumber": 5290,
			"text": "নাফি‘ (রহ.) হতে বর্ণিত যে, ইবনু ‘উমার (রাঃ) যে ‘ঈলার কথা আল্লাহ উল্লেখ করেছেন সে সম্পর্কে বলতেন, সময়সীমা উত্তীর্ণ হওয়ার পরে প্রতেক্যেরই উচিত হয় স্ত্রীকে সততার সাথে গ্রহণ করবে, না হয় তালাক দেয়ার সিদ্ধান্ত নিবে, যেমনভাবে আল্লাহ তা‘আলা আদেশ করেছেন। আধুনিক প্রকাশনী- ৪৯০২, ইসলামিক ফাউন্ডেশন- ৪৭৯৭",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 5291,
			"arabicnumber": 5291,
			"text": "ইসমাঈল আমাকে আরও বলেছেন, মালিক (রহ.) নাফি‘ এর সূত্রে ইবনু ‘উমার (রাঃ) থেকে বর্ণনা করেছেন যে, চার মাস অতিক্রান্ত হয়ে গেলে তালাক দেয়া পর্যন্ত তাকে আটকে রাখা হবে। আর তালাক না দেয়া পর্যন্ত তালাক প্রযোজ্য হবে না। উসমান, ‘আলী , আবুদ্ দারদা, ‘আয়িশাহ (রাঃ) এবং আরও বারজন সাহাবী থেকেও অনুরূপ উল্লেখ করা হয়। (আধুনিক প্রকাশনী- ৪৯০২, ইসলামিক ফাউন্ডেশন- ৪৭৯৭)",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 5292,
			"arabicnumber": 5292,
			"text": "وَقَالَ ابْنُ الْمُسَيَّبِ إِذَا فُقِدَ فِي الصَّفِّ عِنْدَ الْقِتَالِ تَرَبَّصُ امْرَأَتُه“ سَنَةً. ইবনু মুসাইয়্যাব (রহ.) বলেন, যুদ্ধের ব্যূহ থেকে কোন ব্যক্তি নিরুদ্দেশ হলে তার স্ত্রী এক বছর অপেক্ষা করবে। وَاشْتَرَى ابْنُ مَسْعُودٍ جَارِيَةً وَالْتَمَسَ صَاحِبَهَا سَنَةً فَلَمْ يَجِدْه“ وَفُقِدَ فَأَخَذَ يُعْطِي الدِّرْهَمَ وَالدِّرْهَمَيْنِ وَقَالَ اللَّهُمَّ عَنْ فُلاَنٍ فَإِنْ أَتٰى فُلاَنٌ فَلِي وَعَلَيَّ وَقَالَ هٰكَذَا فَافْعَلُوا بِاللُّقَطَةِ وَقَالَ ابْنُ عَبَّاسٍ نَحْوَه“ وَقَالَ الزُّهْرِيُّ فِي الأَسِيرِ يُعْلَمُ مَكَانُه“ لاَ تَتَزَوَّجُ امْرَأَتُه“ وَلاَ يُقْسَمُ مَالُه“ فَإِذَا انْقَطَعَ خَبَرُه“ فَسُنَّتُه“ سُنَّةُ الْمَفْقُودِ. ইবনু মাস‘ঊদ (রাঃ) একটি দাসী ক্রয় করে এক বছর পর্যন্ত তার মালিককে খুঁজলেন মূল্য পরিশোধ করার জন্য)। তিনি তাকে পেলেন না, সে নিখোঁজ হয়ে যায়। তিনি এক দিরহাম, দু’ দিরহাম করে দান করতেন এবং বলতেনঃ হে আল্লাহ! এটা অমুকের পক্ষ থেকে দিচ্ছি। যদি মালিক এসে যায়, তবে এর সাওয়াব আমি পাব, আর তার টাকা পরিশোধ করার দায়িত্ব হবে আমার। তিনি বলেনঃ হারানো বস্ত্ত প্রাপ্তির ক্ষেত্রেও তোমরা এমন কাজ করবে। ইবনু ‘আব্বাস(রাঃ)-ও এরূপ মত ব্যক্ত করেছেন। যুহরী সেই বন্দী ব্যক্তি সম্পর্কে বলেন, যার অবস্থান সম্পর্কে জানা গেছে তার স্ত্রী বিয়ে করতে পারবে না এবং তার সম্পদও বণ্টন করা যাবে না। তবে তার সংবাদ পুরাপুরি বন্ধ হয়ে গেলে, তাঁর সম্পর্কে নিখোঁজ ব্যক্তির বিধান বলবৎ হবে। ৫২৯২. মুনবাইস-এর আযাদকৃত গোলাম ইয়াযীদ (রহঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে হারানো বকরীর ব্যাপারে জিজ্ঞেস করা হলে তিনি বললেনঃ ওটাকে ধরে নাও। কেননা, ওটা হয় তোমার জন্য, না হয় তোমার (অন্য) ভাইয়ের জন্য অথবা নেকড়ের জন্য। তাঁকে হারানো উটের ব্যাপারে জিজ্ঞেস করা হলে তিনি রেগে গেলেন এবং তাঁর উভয় গন্ডদেশ লাল হয়ে গেল। এরপর তিনি বললেনঃ ওটা নিয়ে তোমার চিন্তা কেন? তার সঙ্গে চলার (জন্য) পায়ের তলায় ক্ষুর ও পানাহারের (জন্য) পেটে মশক আছে। সে পানি পান করতে থাকবে এবং বৃক্ষ-লতা খেতে থাকবে, আর এর মধ্যে মালিক তার সন্ধান লাভ করবে। তাঁকে লুকাতা (হারানো প্রাপ্তি) সম্বন্ধে প্রশ্ন করা হলে তিনি বলেনঃ প্রাপ্ত বস্তুর থলে ও মাথার বন্ধনটা চিনে নাও এবং এক বছর পর্যন্ত এর ঘোষণা দিতে থাক। যদি এর শনাক্তকারী (মালিক) আসে, তবে ভালো কথা, নচেৎ এটাকে তোমার মালের সাথে মিলিয়ে নাও। সুফ্ইয়ান বলেনঃ আমি রাবী‘আ ইবনু আবূ ‘আবদুর রহমানের সঙ্গে দেখা করে উল্লিখিত কথাগুলো ছাড়া আর কিছুই পাইনি। আমি বললামঃ হারানো প্রাণীর ব্যাপারে মুনবাইস এর আযাদকৃত গোলাম ইয়াযীদের হাদীসটি কি যায়দ ইবনু খালিদ হতে বর্ণিত? তিনি বললেন, হাঁ। ইয়াহইয়া বলেন, রাবী‘আ বলতেনঃ হাদীসটি মুনবাইস-এর আযাদকৃত গোলাম ইয়াযীদ-এর মাধ্যমে যায়দ ইবনু খালিদ হতে বর্ণনাকৃত। সুফ্ইয়ান বললেনঃ আমি রাবী‘আর সঙ্গে দেখা করে এ সম্পর্কে আলোচনা করলাম। [৯১] আধুনিক প্রকাশনী- ৪৯০৩, ইসলামিক ফাউন্ডেশন- ৪৭৯৮",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 5293,
			"arabicnumber": 5293,
			"text": "৬৮/২৩. অধ্যায়ঃ যিহার[1]। আল্লাহ বলেছেনঃ আল্লাহ তার কথা শুনেছেন যে নারী (খাওলাহ বিনত সা‘লাবাহ) তার স্বামীর বিষয়ে তোমার সাথে বাদানুবাদ করছে আর আল্লাহর কাছে ফরিয়াদ জানাচ্ছে, আল্লাহ তোমাদের দু’জনের কথা শুনছেন.....আর যে তা করতে পারবে না, সে ষাট জন মিসকীনকে খাবার খাওয়াবে।’ ... পর্যন্ত। (সূরাহ মুজাদালাহ ৫৮/১-৪) [বুখারী (রহ.) বলেন] ইসমাঈল আমাকে বলেছেন, মালিক (রহ.) তাঁর কাছে হাদীস বর্ণনা করেছেন যে, তিনি ইবনু শিহাবকে গোলামের যিহার সম্পর্কে জিজ্ঞেস করলেন। উত্তরে তিনি বললেনঃ আযাদ ব্যক্তির মত। মালিক (রহ.) বলেনঃ গোলাম ব্যক্তি দু’মাস সওম পালন করবে। হাসান ইবনুল হুর্র বলেনঃ আযাদ নারী বা বাঁদীর সঙ্গে আযাদ পুরুষ বা গোলামের যিহার একই রকম। ইকরামাহ বলেনঃ বাঁদীর সঙ্গে যিহার করলে কিছু হবে না। যিহার তো কেবল মুক্ত নারীর ব্যাপারেই প্রযোজ্য। আরবীতে ‘‘তারা যা উক্তি করেছিল’’এর অর্থে ব্যবহৃত হয় অর্থাৎ ‘‘তারা যে সম্পর্কে উক্তি করেছিল তা থেকে .....’’ এবং এরূপই ভাল, কারণ আল্লাহ তা‘আলা অন্যায় ও ভিত্তিহীন কথার পথ দেখান না। ইবনু ‘উমার (রাঃ) বলেন, নবীসাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন আল্লাহ চোখের পানির জন্য শাস্তি দিবেন না; তবে শাস্তি দিবেন এটার জন্য এই বলে তিনি মুখের প্রতি ইশারা করলেন। কা‘ব ইবনু মালিক (রাঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার প্রতি ইশারা করে বললেনঃ অর্ধেক লও। আসমা (রাঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সূর্যগ্রহণের সালাত আদায় করেন। ‘আয়িশাহ (রাঃ) সালাত আদায় করছিলেন। এ অবস্থায় আমি তাকে জিজ্ঞেস করলাম ব্যাপার কী? তিনি তাঁর মাথা দ্বারা সূর্যের দিকে ইশারা করলেন। আমি বললামঃ কোন নিদর্শন নাকি? তিনি মাথা নেড়ে বললেনঃ জি হাঁ। আনাস (রাঃ) বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামতাঁর হাত দ্বারা আবূ বাকর (রাঃ)-এর প্রতি ইশারা করে সামনে যেতে বললেন। ইবনু ‘আব্বাস (রাঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হাত দ্বারা ইশারা করে বললেনঃ কোন দোষ নেই। আবূ ক্বাতাদাহ (রাঃ) নবীসাল্লাল্লাহু আলাইহি ওয়াসাল্লা ম মুহরিম-এর ইহরামকারী) শিকার সম্বন্ধে বললেন, তোমাদের কেউ কি তাকে মুহরিমকে) এ কাজে লিপ্ত হবার আদেশ করেছিল বা শিকারের প্রতি ইঙ্গিত করেছিল? লোকেরা বললঃ না। তিনি বললেন, তবে খাও। ৫২৯৩. ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর উটে চড়ে তাওয়াফ করলেন। তিনি যখনই ‘রুকনের’ কাছে আসতেন, তখনই এর প্রতি ইঙ্গিত করতেন এবং ‘‘আল্লাহু আকবার’’ বলতেন। যাইনাব (রাঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ‘‘ইয়াজুজ ও মাজূজ’’ এদের দরজা এভাবে খুলে গেছে; এই বলে তিনি (তাঁর আঙ্গুলকে) নব্বই এর মত করলেন। (অর্থাৎ শাহাদাত অঙ্গুলের মাথা বৃদ্ধাঙ্গুলির গোড়ায় রাখলেন।) [১৬০৭] (আধুনিক প্রকাশনী- ৪৯০৪, ইসলামিক ফাউন্ডেশন- ৪৭৯৯)",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 5294,
			"arabicnumber": 5294,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, আবুল কাসিম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ জুমু‘আহর দিনে এমন একটি মুহূর্ত আছে, যে মুহূর্তে কোন মুসলিম দাঁড়িয়ে সালাত আদায় করে আল্লাহর কাছে যে কোন কল্যাণ চায় আল্লাহ অবশ্যই তা মঞ্জুর করে থাকেন। তিনি নিজ হাত দ্বারা ইশারা করেন এবং তাঁর আঙ্গুলগুলো মধ্যমা ও কনিষ্ঠা আঙ্গুলের পেটে রাখেন। আমরা বললামঃ তিনি স্বল্পতা বুঝাতে চাচ্ছেন।",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 5295,
			"arabicnumber": 5295,
			"text": "উওয়ায়সী (রহ.) বলেনঃ ইবরাহীম ইবনু সা’দ শু’বাহ ইবনু হাজ্জাজ থেকে, তিনি হিশাম ইবনু যায়দ থেকে, তিনি আনাস ইবনু মালিক (রাঃ) থেকে বর্ণনা করেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর যুগে এক ইয়াহূদী একটি বালিকার উপর নির্যাতন করে তার অলঙ্কারাদি ছিনিয়ে নেয়। আর পাথর দ্বারা) তার মস্তক চূর্ণ করে। সে শেষ নিঃশ্বাস ত্যাগ করার পূর্ব মুহূর্তে তার পরিবারের লোকেরা তাকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে নিয়ে আসে। তখন সে চুপচাপ ছিল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক নির্দোষ ব্যক্তির নাম (ধরে) তাকে জিজ্ঞেস করলেনঃ তোমাকে কি অমুক হত্যা করেছে? সে মাথার ইশারায় বললঃ না। তিনি অন্য এক নিরপরাধ লোকের নাম ধরে বললেন, তবে কি অমুক? সে ইশারায় জানাল, না। এবার রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হত্যাকারীর নাম ধরে বললেনঃ তবে অমুক ব্যক্তি মেরেছে কি? সে মাথা হেলিয়ে বললঃ জি, হ্যাঁ। এরপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নির্দেশত্রুমে উক্ত ব্যক্তির মাথা দু’পাথরের মাঝে রেখে চূর্ণ করা হলো। [২৪১৩] (আধুনিক প্রকাশনী- ৪৯০৫, ইসলামিক ফাউন্ডেশন- ৪৮০০)",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 5296,
			"arabicnumber": 5296,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি, ফিতনা বিপর্যয়) এদিক থেকে আসবে। তিনি পূর্ব দিকে ইশারা করলেন। [৩১০৪] আধুনিক প্রকাশনী- ৪৯০৬, ইসলামিক ফাউন্ডেশন- ৪৮০১",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 5297,
			"arabicnumber": 5297,
			"text": "‘আবদুল্লাহ ইবনু আবূ আওফা (রাঃ) হতে বর্ণিত। তিনি বলেন, আমরা কোন এক সফরে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে ছিলাম। সূর্য অস্তমিত হলে তিনি এক ব্যক্তি (বিলাল)-কে বললেনঃ নেমে যাও, আমার জন্য ছাতু প্রস্তুত কর। সে বললঃ হে আল্লাহর রাসূল! যদি আপনি সন্ধ্যা নাগাদ অপেক্ষা করতেন। (তাহলে সওম পূর্ণ হত)। তিনি পুনরায় বললেনঃ নেমে গিয়ে ছাতু মাখ। সে বললঃ হে আল্লাহর রাসূল! যদি সন্ধ্যা হতে দিতেন! এখনো তে দিন রয়ে গেছে। তিনি আবার বললেনঃ যাও, গিয়ে ছাতু প্রস্তুত কর। তৃতীয়বার আদেশ দেয়ার পর সে নামল এবং তাঁর জন্য ছাতু প্রস্তুত করল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তা খেলেন। এরপর তিনি পূর্বদিকে হাত দিয়ে ইশারা করে বললেনঃ যখন তোমরা ওদিক থেকে রাত্রি নেমে আসতে দেখবে, তখন সওমকারী ইফতার করবে। [১৯৪১] (আধুনিক প্রকাশনী- ৪৯০৭, ইসলামিক ফাউন্ডেশন- ৪৮০২)",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 5298,
			"arabicnumber": 5298,
			"text": "‘আবদুল্লাহ ইবনু মাস‘ঊদ (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ বিলালের আহবান বা তার আযান যেন তোমাদের কাউকে সাহরী থেকে বিরত না রাখে। কারণ, সে আযান দেয়, যাতে তোমাদের রাত্রি জাগরণকারীরা কিছু আরাম করতে পারে। সকাল বা ফজর হয়েছে এটা বুঝানো তার উদ্দেশ্য নয়। ইয়াযীদ তার হাত দু’টি সামনে বিস্তার করে দু’দিকে ছড়িয়ে দিলেন। সুব্হে সাদিক কিভাবে উদ্ভাসিত হয় তা দেখানোর জন্য)। [৬২১] (আধুনিক প্রকাশনী- ৪৯০৮, ইসলামিক ফাউন্ডেশন- ৪৮০৩)",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 5299,
			"arabicnumber": 5299,
			"text": "লায়স (রহ.) বলেন, জা’ফর ইবনু রাবী’আ, ‘আবদুর রহমান ইবনু হুরমুয থেকে বর্ণনা করেন যে, তিনি আবূ হুরাইরাহ (রাঃ)-এর কাছে শুনেছেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ বখিল ও দাতা ব্যক্তির উদাহরণ হচ্ছে এমন দু’ব্যক্তির মত, যাদের পরিধানে বুক থেকে গলার হাড় পর্যন্ত লৌহ-নির্মিত পোশাক রয়েছে। দানকারী যখনই কিছু দান করে, তখনই তার শরীরের পোশাকটি বড় ও প্রশস্ত হতে থাকে, এমনকি এটা তার আঙ্গুল ও অন্যান্য অঙ্গগুলোকে ঢেকে ফেলে। অন্যদিকে, বখিল যখনই দান করার ইচ্ছা করে, তখনই তার পোশাকে তার কণ্ঠনালীর প্রতিটি অংশ সংকুচিত হয়ে যায়। সে প্রশস্ত করার চেষ্টা করলেও সেটা প্রশস্ত হয় না। এ কথা বলে তিনি নিজের আঙ্গুল দ্বারা কণ্ঠনালীর প্রতি ইশারা করলেন। আধুনিক প্রকাশনী- ৪৯০৮, ইসলামিক ফাউন্ডেশন- ৪৮০৩",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 5300,
			"arabicnumber": 5300,
			"text": "(মহান আল্লাহর বাণীঃ ‘‘আর যারা নিজেদের স্ত্রীদের উপর অপবাদ দেয়, কিন্তু নিজেদের ছাড়া তাদের অন্য কোন সাক্ষী না থাকে........... থেকে-‘‘যদি সে সত্যবাদী হয়’’ সূরাহ আন-নূর ২৪ঃ ৬-৯) পর্যন্ত! যদি কোন বোবা লোক লিখিতভাবে বা ইশারায় কিংবা কোন পরিচিত ইঙ্গিতের মাধ্যমে নিজ স্ত্রীকে অপবাদ দেয়, তাহলে তার হুকুম বাকশক্তি সম্পন্ন মানুষের মতই। কেননা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফরয বিষয়াবলীতে ইশারা করার অনুমতি দিয়েছেন। এটা হিজাজ ও অন্যান্য স্থানের কিছু সংখ্যক আলিমেরও মত। আল্লাহ বলেছেনঃ ‘‘সে মারইয়াম) সন্তানের প্রতি ইঙ্গিত করলো, লোকেরা বলল, দোলনার শিশুর সঙ্গে আমরা কীভাবে কথা বলব?’’ সূরাহ মারইয়ামঃ ২৯) যাহহাক বলেনঃ অর্থ ‘‘ইঙ্গিত এবং ইশারার মাধ্যমে।’’ (সূরা আলে-‘ইমরানঃ ৪১) কিছু লোক বলেছেনঃ ইশারার মাধ্যমে কোন হদ্ শর‘ঈ দন্ড) বা লি‘আন নেই, আবার তাদেরই মত হলো লিখিতভাবে কিংবা ইশারা ইঙ্গিতে তালাক দেয়া জায়িয আছে। অথচ তালাক এবং অপবাদের মধ্যে কোন ব্যবধান নেই। যদি তারা বলেঃ কথা বলা ব্যতীত তো অপবাদ দেয়া সম্ভব নয়। তবে তাকে বলা হবে তাহলে তো অনুরূপভাবে কথা বলা ব্যতীত তালাক দেয়াও না জায়িয।অন্যথায় তো তালাক দেয়া, অপবাদ দেয়া এমনিভাবে গোলাম আযাদ করা, কোনটাই ইশারার মাধ্যমে জায়িয হতে পারে না। অনুরূপভাবে বধির ব্যক্তিও লি‘আন করতে পারে। শা’বী ও ক্বাতাদাহ (রহ.) বলেনঃ যদি কেউ আঙ্গুল দ্বারা ইশারা করে তার স্ত্রীকে বলে, তুমি তালাকপ্রাপ্তা, তাহলে ইশারার দ্বারা স্ত্রী স্বামী থেকে বিচ্ছিন্ন হয়ে যাবে। ইবরাহীম বলেনঃ বোবা ব্যক্তি নিজ হাতে তালাক পত্র লিপিবদ্ধ করলে অবশ্যই তালাক হবে। হাম্মাদ বলেনঃ বোবা এবং বধির মাথার ইঙ্গিতে বললেও জায়িয হবে। ৫৩০০. আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমি তোমাদের বলব কি, আনসারদের সব চেয়ে উত্তম গোত্র কোনটি? তারা বললেনঃ হে আল্লাহর রাসূল! হাঁ বলুন। তিনি বললেনঃ তারা বনূ নাজ্জার। এরপর যারা তাদের নিকটবর্তী বনূ আবদুল আশহাল, এরপর তাদের নিকটবর্তী যারা বনূ হারিস ইবনু খাযরাজ। এরপর তাদের সন্নিকটে বনূ সা‘ঈদা। এরপর তিনি হাত দ্বারা ইশারা করলেন। হাতের আঙ্গুলগুলোকে সঙ্কুচিত করে আবার তা সম্প্রসারিত করলেন। যেমন কেউ কিছু হাতের দ্বারা নিক্ষেপ করার সময় করে থাকে। এরপর বলেনঃ আনসারদের প্রতিটি গোত্রেই কল্যাণ নিহিত আছে। (আধুনিক প্রকাশনী- ৪৯০৯, ইসলামিক ফাউন্ডেশন- ৪৮০৪)",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 5301,
			"arabicnumber": 5301,
			"text": "রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সাহাবী সাহল ইবনু সা’দ-সা‘ঈদী (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমার আগমন এবং কিয়ামতের মাঝে দূরত্ব এ আঙ্গুল থেকে এ আঙ্গুলের দূরত্বের মত। কিংবা তিনি বলেনঃ এ দু’টির দূরত্বের মত। এই বলে তিনি শাহাদাত ও মধ্যমা আঙ্গুল দু’টি মিলিত করলেন। [৪৯৩৬] (আধুনিক প্রকাশনী- ৪৯১০, ইসলামিক ফাউন্ডেশন- ৪৮০৫)",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 5302,
			"arabicnumber": 5302,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মাস এত, এত এবং এত দিনে হয়, অর্থাৎ ত্রিশ দিনে। তিনি আবার বললেনঃ মাস এত, এত ও এত দিনেও হয়। অর্থাৎ ঊনত্রিশ দিনে। তিনি বলতেনঃ কখনও ত্রিশ দিনে আবার কখনও ঊনত্রিশ দিনে মাস হয়। [১৯০৮; মুসলিম ১৩/২, হাঃ ১০৮০, আহমাদ ৪৬১১] (আধুনিক প্রকাশনী- ৪৯১১, ইসলামিক ফাউন্ডেশন- ৪৮০৬)",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 5303,
			"arabicnumber": 5303,
			"text": "আবূ মাস‘ঊদ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিজ হাত দিয়ে ইয়ামানের দিকে ইঙ্গিত করে দু’বার বললেনঃ ঈমান ওখানে। জেনে রেখ! অন্তরের কঠোরতা ও কাঠিন্য উট পালনকারীদের মধ্যে (কৃষকদের মাঝে)। যে দিকে শয়তানের দু’টি শিং উদিত হবে তাহলো (কঠোর হৃদয়) রাবী‘আ গোত্র ও মুযার গোত্র। [৩৩০২] আধুনিক প্রকাশনী- ৪৯১২, ইসলামিক ফাউন্ডেশন- ৪৮০৭",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 5304,
			"arabicnumber": 5304,
			"text": "সাহল (রাঃ) হতে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমি ও ইয়াতীমের প্রতিপালনকারী জান্নাতে এমনিভাবে নিকটে থাকবে। এই বলে তিনি শাহাদাত ও মধ্যমা আঙ্গুল দু’টি দ্বারা ইঙ্গিত করলেন এবং এ দু’টির মাঝে কিঞ্চিত ফাঁক রাখলেন। [৬০০৫] আধুনিক প্রকাশনী- ৪৯১৩, ইসলামিক ফাউন্ডেশন- ৪৮০৮",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 5305,
			"arabicnumber": 5305,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত যে, এক ব্যক্তি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে এসে বললঃ হে আল্লাহর রাসূল! আমার একটি কালো সন্তান জন্মেছে। তিনি জিজ্ঞেস করলেনঃ তোমার কিছু উট আছে কি? সে জবাব দিল হাঁ। তিনি বললেনঃ সেগুলোর রং কেমন? সে বললঃ লাল। তিনি বললেনঃ সেগুলোর মধ্যে কোনটি ছাই বর্ণের আছে কি? সে বললঃ হ্যাঁ। তিনি জিজ্ঞেস করলেনঃ তাহলে সেটিতে এমন রং কোত্থেকে এলো। লোকটি বললঃ সম্ভবত পূর্ববর্তী বংশের কারণে এমন হয়েছে। তিনি বললেনঃ তাহলে হতে পারে, তোমার এ সন্তানও বংশগত কারণে এমন হয়েছে। [৬৮৪৭, ৭৩১৪; মুসলিম ১৯/হাঃ ১৫০০, আহমাদ ৭২৬৮] (আধুনিক প্রকাশনী- ৪৯১৪, ইসলামিক ফাউন্ডেশন- ৪৮০৯)",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 5306,
			"arabicnumber": 5306,
			"text": "‘আবদুল্লাহ (রাঃ) হতে বর্ণিত যে, আনসারদের এক ব্যক্তি তার স্ত্রীকে অপবাদ দিল। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দু’জনকেই শপথ করালেন এবং তাদেরকে পৃথক করে দিলেন। [৪৭৪৮] (আধুনিক প্রকাশনী- ৪৯১৫, ইসলামিক ফাউন্ডেশন- ৪৮১০)",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 5307,
			"arabicnumber": 5307,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত যে, হিলাল ইবনু উমাইয়্যা তার স্ত্রীকে যিনার) অপবাদ দেয়। তিনি এসে সাক্ষ্য দিলেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলতে লাগলেনঃ আল্লাহ তা‘আলা অবশ্যই জানেন তোমাদের দু’জনের একজন তো মিথ্যাচারী। অতএব কে তোমাদের দু’জনের মধ্যে তওবা করতে প্রস্তুত আছ? এরপর স্ত্রী লোকটি দাঁড়াল এবং নিজের (দোষমুক্তির) সাক্ষ্য দিল। [২৬৭১] (আধুনিক প্রকাশনী- ৪৯১৫, ইসলামিক ফাউন্ডেশন- ৪৮১১)",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 5308,
			"arabicnumber": 5308,
			"text": "সাহল ইবনু সা‘দ সা‘ঈদী (রাঃ) হতে বর্ণিত যে, উওয়াইমির আজলানী (রাঃ) ‘আসিম ইবনু আদী আনসারী (রাঃ)-এর কাছে এসে বললেনঃ হে আসিম! কী বল, যদি কেউ তার স্ত্রীর সঙ্গে অপর লোককে (ব্যভিচার-রত অবস্থায়) পায়, তবে সে কি তাকে হত্যা করবে? আর এতে তোমরাও কি তাকে হত্যা করবে? (যদি সে হত্যা না করে) তাহলে কী করবে? হে আসিম! তুমি আমার এ ব্যাপারটি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে জিজ্ঞেস কর। এরপর আসিম (রাঃ) এ ব্যাপারে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে জিজ্ঞেস করলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এ ধরনের জিজ্ঞাসাবাদ অপছন্দ করলেন এবং অশোভনীয় মনে করলেন। এমন কি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে আসিম (রাঃ) যা শুনলেন, তাতে তার খুব খারাপ লাগল। আসিম (রাঃ) বাড়ি ফিরলে উওয়াইমির এসে জিজ্ঞেস করলঃ হে আসিম?! রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তোমাকে কী উত্তর দিলেন? আসিম (রাঃ) উওয়াইমিরকে বললেনঃ তুমি আমার কাছে কোন ভাল কাজ নিয়ে আসনি। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এ ধরনের জিজ্ঞাসাকে অপছন্দ করেছেন, সে সম্বন্ধে আমি তাঁকে জিজ্ঞেস করেছি। উওয়াইমির (রাঃ) বললেন, আল্লাহর শপথ! তাঁকে এ বিষয়ে জিজ্ঞেস না করে ক্ষান্ত হব না। এরপর উওয়াইমির (রাঃ) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট এসে তাঁকে লোকদের মাঝে পেলেন এবং তাঁকে জিজ্ঞেস করলেনঃ হে আল্লাহর রাসূল! কী বলেন, কেউ যদি তার স্ত্রীর সঙ্গে অন্য লোককে (ব্যভিচার-রত) দেখতে পায়, সে কি তাকে হত্যা করবে? আর আপনারাও কি তাকে হত্যার বদলে হত্যা করবেন? না হলে সে কী করবে? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমার ও তোমার স্ত্রীর সম্পর্কে আয়াত অবতীর্ণ হয়েছে, যাও তাকে নিয়ে এসো। সাহল (রাঃ) বলেন, তারা উভয়ে লি‘আন করল। যে সময় আমি লোকদের সঙ্গে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকটে ছিলাম। উভয়ে লি‘আন করা শেষ করলে উওয়াইমির বললঃ হে আল্লাহর রাসূল! যদি আমি তাকে (স্ত্রী হিসাবে) রাখি, তবে আমি তার উপর মিথ্যারোপ করেছি বলে প্রমাণিত হবে। এরপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে নির্দেশ দেয়ার আগেই তিনি স্ত্রীকে তিন তালাক দিলেন। ইবনু শিহাব (রহ.) বলেনঃ উভয়কে বিচ্ছিন্ন করে দেয়াই পরবর্তীতে লি‘আনকারীদ্বয়ের সম্পর্কিত বিধান প্রচলিত হয়ে গেল হিসাবে পরিগণিত হলো। [৪২৩] (আধুনিক প্রকাশনী- ৪৯১৭, ইসলামিক ফাউন্ডেশন- ৪৮১২)",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 5309,
			"arabicnumber": 5309,
			"text": "ইবনু জুরাইজ (রহ.) হতে বর্ণিত। তিনি বলেন, আমাকে ইবনু শিহাব (রহ.) লি‘আন ও তার হুকুম সম্বন্ধে সা’দ গোত্রের সাহল ইবনু সা‘দ (রাঃ) থেকে হাদীস বর্ণনা করেন যে, আনসারদের এক ব্যক্তি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে এসে বললঃ হে আল্লাহর রাসূল! আপনি কী বলেন, যদি কোন ব্যক্তি তার স্ত্রীর সঙ্গে অন্য লোককে দেখতে পায়, তবে কি সে তাকে হত্যা করবে? অথবা কী করবে? এরপর আল্লাহ তা‘আলা তার ব্যাপারে কুরআনে উল্লেখিত লি‘আনের বিধান অবতীর্ণ করেন। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আল্লাহ তোমার ও তোমার স্ত্রীর ব্যাপারে ফয়সালা দিয়েছেন। রাবী বলেনঃ আমি উপস্থিত থাকতেই তারা উভয়ে মসজিদে লি‘আন করল। উভয়ের লি‘আন করা শেষ হলে সে ব্যক্তি বললঃ হে আল্লাহর রাসূল! যদি আমি তাকে স্ত্রী হিসাবে রেখে দেই; তবে তার উপর মিথ্যারোপ করেছি বলে গণ্য হবে। এরপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে নির্দেশ দেয়ার আগেই সে তার স্ত্রীকে তিন তালাক দিল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সামনেই সে তার থেকে পৃথক হয়ে গেল। তিনি বললেনঃ এই সম্পর্কচ্ছেদই প্রত্যেক লি‘আনকারীদ্বয়ের জন্য বিধান। ইবনু জুরাইজ বলেন, ইবনু শিহাব (রহ.) বলেছেনঃ তাদের পর লি‘আনকারীদ্বয়ের মধ্যে বিচ্ছেদ ঘটানোর হুকুম চালু হয়। মহিলাটি ছিল গর্ভবতী। তার বাচ্চাকে মায়ের পরিচয়ে ডাকা হত। বর্ণনাকারী বলেনঃ এরপর ওয়ারিশের ব্যাপারেও হুকুম জারি হল যে, মহিলা সন্তানের ওয়ারিশ হবে এবং সন্তানও তার ওয়ারিশ হবে, যতটুকু আল্লাহ তা‘আলা নির্ধারণ করেছেন। ইবনু জুরাইজ, ইবনু শিহাবের সূত্রে সাহল ইবনু সা’দ সা‘ঈদী থেকে এ হাদীস সম্পর্কে বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যদি ঐ স্ত্রীলোকটি ওহরার (এক রকম ছোট প্রাণী)র মতো লাল ও বেঁটে সন্তান জন্ম দেয়, তবে বুঝব মহিলাই সত্য বলেছে, আর লোকটি তার উপর মিথ্যা অপবাদ দিয়েছে। আর যদি সে কালো চক্ষু বিশিষ্ট বড় নিতম্বযুক্ত সন্তান জন্ম দেয়, তবে বুঝব, লোকটি সত্যই বলেছে। উক্ত মহিলা অপসন্দনীয় আকৃতির বাচ্চা প্রসব করে। [৪২৩] আধুনিক প্রকাশনী- ৪৯১৮, ইসলামিক ফাউন্ডেশন- ৪৮১৩",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 5310,
			"arabicnumber": 5310,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে লি‘আন করার ব্যাপারটি আলোচিত হল। ‘আসিম ইবনু আদী (রাঃ) এ ব্যাপারে একটি কথা জিজ্ঞেস করে চলে গেলেন। এরপর তাঁর গোত্রের এক ব্যক্তি তার কাছে এসে অভিযোগ করল যে, সে তার স্ত্রীর সাথে অন্য এক লোককে পেয়েছে। ‘আসিম (রাঃ) বললেনঃ অযথা জিজ্ঞাসার কারণেই আমি এ ধরনের বিপদে পড়তাম। এরপর তিনি লোকটিকে নিয়ে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে গেলেন এবং অভিযোগকারীর ব্যাপারটি তাঁকে জানালেন। লোকটি ছিল হলদে শীর্ণকায় ও সোজা চুল বিশিষ্ট। আর ঐ লোকটি যাকে তার স্ত্রীর কাছে পেয়েছে বলে সে অভিযুক্ত করে সে ছিল প্রায় কালো, স্থুল দেহের অধিকারী। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ হে আল্লাহ! সমস্যাটি সমাধান করে দিন। এরপর মহিলা ঐ লোকটির আকৃতি বিশিষ্ট সন্তান জন্ম দিল, যাকে তার স্বামী তার কাছে পেয়েছে বলে উল্লেখ করেছিল। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের স্বামী-স্ত্রী উভয়কে লি‘আন করালেন। একব্যক্তি ইবনু ‘আব্বাস (রাঃ)-কে সে মজলিসেই জিজ্ঞেস করলঃ এ মহিলা সম্বন্ধেই কি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছিলেন? ‘‘আমি যদি কাউকে বিনা প্রমাণে রজম করতাম, তবে একেই রজম করতাম।’’ ইবনু ‘আব্বাস (রাঃ) বললেনঃ না, সে ছিলএক মহিলা, যে মুসলিম সমাজে প্রকাশ্যে ব্যভিচারে লিপ্ত থাকত। আবু সলিহ ও ‘আবদুল্লাহ ইবনু ইউসুফের বর্ণনায় آدَمَ خَدِلاً শব্দ এসেছে। [৫৩১৬, ৬৮৫৫, ৬৮৫৬, ৭২৩৮; মুসলিম ১৯/হাঃ ১৪৯৭, আহমাদ ৩৩৬০] (আধুনিক প্রকাশনী- ৪৯১৯, ইসলামিক ফাউন্ডেশন- ৪৮১৪)",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 5311,
			"arabicnumber": 5311,
			"text": "সা‘ঈদ ইবনু যুবায়র (রহ.) হতে বর্ণিত। তিনি বলেন, আমি ইবনু ‘উমারকে জিজ্ঞেস করলাম, এক লোক তার স্ত্রীকে অপবাদ দিল- (তার বিধান কী?) তিনি বললেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বনূ ‘আজলানের স্বামী-স্ত্রীর দু’জনকে বিচ্ছিন্ন করে দিয়েছিলেন এবং তিনি বলেছিলেনঃ আল্লাহ তা‘আলা জানেন তোমাদের একজন অবশ্যই মিথ্যাচারী। কাজেই তোমাদের কেউ তওবা করতে রাযী আছ কি? তারা দু’জনেই অস্বীকার করল। তিনি পুনরায় বললেনঃ আল্লাহ তা‘আলা অবহিত আছেন তোমাদের একজন মিথ্যাচারী, সুতরাং কেউ তওবা করতে প্রস্তুত আছ কি? তারা আবারও অস্বীকার করল। তিনি পুনরায় বললেনঃ আল্লাহ তা‘আলা অবহিত আছেন তোমাদের একজন মিথ্যাচারী সুতরাং কেউ তওবা করতে প্রস্তুত আছ কি? তারা আবারও অস্বীকার করল। এরপর তিনি তাদেরকে পৃথক করে দেন। আইয়ুব বলেনঃ আমাকে ‘আমর ইবনু দ্বীনার (রহ.) বললেন, এ হাদীসে আরও কিছু কথা আছে, তোমাকে তা বর্ণনা করতে দেখছি না কেন? তিনি বলেন, লোকটি বললঃ আমার (দেয়া) মালের কী হবে? তাকে বলা হল, তোমার মাল ফিরে পাবে না। যদি তুমি সত্যবাদী হও, (তবুও পাবে না)। (কেননা) তুমি তার সঙ্গে সহবাস করেছ। আর যদি তুমি মিথ্যাচারী হও, তবে তা পাওয়া তো বহু দূরের ব্যাপার। [৫৩১২, ৫৩৪৯, ৫৩৫০] আধুনিক প্রকাশনী- ৪৯২০, ইসলামিক ফাউন্ডেশন- ৪৮১৫",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 5312,
			"arabicnumber": 5312,
			"text": "সা‘ঈদ ইবনু যুবায়র (রহ.) হতে বর্ণিত। তিনি বলেন, আমি লি‘আনকারীদ্বয় সম্পর্কে ইবনু ‘উমারকে জিজ্ঞেস করলাম, তিনি বললেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম লি‘আনকারীদ্বয়কে লক্ষ্য করে বলেছিলেনঃ তোমাদের হিসাব নেয়ার দায়িত্ব আল্লাহরই। তোমাদের একজন অবশ্যই মিথ্যাচারী। স্ত্রীর উপর তোমার কোন অধিকার নেই। লোকটি বললঃ তবে আমার মালের কী হবে? তিনি বললেনঃ তুমি কোন মাল পাবে না। যদি তুমি সত্যবাদী হও তাহলে এর বদলে তুমি তার লজ্জাস্থানকে হালাল করে নিয়েছিলে। আর যদি তার উপর মিথ্যারোপ করে থাক, তবে তা তো বহুদূরের ব্যাপার। সুফ্ইয়ান বলেনঃ আমি এ হাদীস ‘আমর (রাঃ)-এর নিকট হতে মুখস্থ করেছি। আইয়ুব বলেন, আমি সা‘ঈদ ইবনু যুবায়র-এর কাছে শুনেছি, তিনি বলেন, আমি ইবনু ‘উমার (রাঃ)-কে জিজ্ঞেস করলামঃ এক ব্যক্তি তার স্ত্রীর সঙ্গে লি‘আন করল এখন তাদের বিধান কী? তিনি তাঁর দু’আঙ্গুল দ্বারা ইশারা করে বললেন, সুফ্ইয়ান তার তর্জনী ও মধ্যমা আঙ্গুল ফাঁক করে বললেন নবীসাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বনূ ‘আজলানের এক দম্পতির বৈবাহিক সম্পর্ক এভাবে ছিন্ন করে দেন এবং বলেনঃ আল্লাহ তা‘আলা জানেন যে, তোমাদের একজন অবশ্যই মিথ্যাচারী। সুতরাং কেউ তওবা করতে প্রস্তুত আছ কি? এভাবে তিনি তিনবার বললেন। সুফ্ইয়ান বলেনঃ আমি তোমাকে যেভাবে হাদীসটি শুনাচ্ছি এভাবেই আমি ‘আমর ও আইয়ুব (রাঃ) থেকে মুখস্থ করেছি। [৫৩১১] (আধুনিক প্রকাশনী- ৪৯২১, ইসলামিক ফাউন্ডেশন- ৪৮১৬)",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 5313,
			"arabicnumber": 5313,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত যে, জনৈক পুরুষ তার স্ত্রীকে অপবাদ দিলে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উভয়কে শপথ করান, এরপর বিচ্ছিন্ন করে দেন। [৪৭৪৮] আধুনিক প্রকাশনী- ৪৯২২, ইসলামিক ফাউন্ডেশন- ৪৮১৭",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 5314,
			"arabicnumber": 5314,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক আনসার ও তার স্ত্রীকে লি‘আন করান এবং তাদেরকে বিচ্ছিন্ন করে দেন। [৪৭৪৮] আধুনিক প্রকাশনী- ৪৯২৩, ইসলামিক ফাউন্ডেশন- ৪৮১৮",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 5315,
			"arabicnumber": 5315,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক লোক ও তার স্ত্রীকে লি‘আন করালেন এবং সন্তানের পৈতৃক সম্পর্ক ছিন্ন করে উভয়কে বিচ্ছিন্ন করে দিলেন। আর সন্তান মহিলাকে দিয়ে দিলেন। [৪৭৪৮] (আধুনিক প্রকাশনী- ৪৯২৪, ইসলামিক ফাউন্ডেশন- ৪৮১৯)",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 5316,
			"arabicnumber": 5316,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, লি‘আনকারী দম্পতিদ্বয় সম্পর্কে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সম্মুখে আলোচনা হচ্ছিল। ইতোমধ্যে আসিম ইবনু আদী (রাঃ) এ ব্যাপারে কিছু জিজ্ঞাসাবাদ করে চলে গেলেন। এরপর তার গোত্রের এক লোক তার কাছে এসে জানাল যে, সে তার স্ত্রীর সঙ্গে এক লোককে পেয়েছে। আসিম বললেন, অযথা জিজ্ঞাসাবাদের দরুনই আমি এ বিপদে পড়লাম। এরপর তিনি তাকে নিয়ে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে গেলেন এবং যে লোকটিকে সে তার স্ত্রীর সঙ্গে পেয়েছে, তার সম্পর্কে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে জানালেন। অভিযোগকারী ছিলেন হলদে শীর্ণকায় ও সোজা চুল বিশিষ্ট। আর তার স্ত্রীর কাছে পাওয়া লোকটি ছিল মোটা ধরনের স্থুলকায় ও খুব কোঁকড়ানো চুল বিশিষ্ট। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ হে আল্লাহ! আপনি সত্য প্রকাশ করে দিন। এরপর মহিলা ঐ লোকটির আকৃতির একটি সন্তান জন্ম দেয়, যাকে তার স্বামী তার সঙ্গে পেয়েছে বলে উল্লেখ করেছিলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উভয়কেই লি‘আন করালেন। এক ব্যক্তি ইবনু ‘আব্বাস (রাঃ)-কে সেই মজলিসেই জিজ্ঞেস করল, ঐ মহিলা সম্বন্ধেই কি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছিলেনঃ আমি যদি বিনা প্রমাণে কাউকে রজম করতাম তাহলে একে রজম করতাম? ইবনু ‘আব্বাস (রাঃ) বলেনঃ না, সে ছিল অন্য এক মহিলা সে মুসলিম সমাজে প্রকাশ্যে ব্যভিচারে লিপ্ত থাকত। [৫৩১০] (আধুনিক প্রকাশনী- ৪৯২৫, ইসলামিক ফাউন্ডেশন- ৪৮২০)",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 5317,
			"arabicnumber": 5317,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণনা করেন। (হাদীসটি নিম্নলিখিত হাদীসের মতই)। আধুনিক প্রকাশনী- ৪৯২৬, ইসলামিক ফাউন্ডেশন- ৪৮২১) ‘আয়িশাহ (রাঃ) হতে বর্ণিত যে, রিফা‘আহ কুরাযী এক স্ত্রীলোককে বিয়ে করে পরে তালাক দেয়। এরপর স্ত্রীলোকটি অন্য স্বামী গ্রহণ করে। পরে সে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে এসে তাঁকে জানালো যে, সে (স্বামী) তার কাছে আসে না, আর তার কাছে কাপড়ের কিনারার মত বস্ত্ত ছাড়া কিছুই নেই। তিনি বললেনঃ তা হবে না, যে পর্যন্ত তুমি তার কিছু মধু আস্বাদন না করবে, আর সেও তোমার কিঞ্চিত মধু আস্বাদন না করবে ততক্ষণ প্রথম স্বামীর কাছে যাওয়া যাবে না)। [২৬৩৯] (আধুনিক প্রকাশনী- ৪৯২৭, ইসলামিক ফাউন্ডেশন- ৪৮২২)",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 5318,
			"arabicnumber": 5318,
			"text": "كِتَاب العِدَّةِ কিতাবুল ইদ্দাত[1] 68/38.بَابُ: (وَاللاَّئِي يَئِسْنَ مِنَ الْمَحِيضِ مِنْ نِسَائِكُمْ إِنِ ارْتَبْتُمْ) ৬৮/৩৮. অধ্যায়ঃ মহান আল্লাহর বাণীঃ ‘‘তোমাদের স্ত্রীদের মধ্যে যাদের হায়িয বন্ধ হয়ে গেছে.......... যদি তোমাদের সন্দেহ দেখা দেয় তাদের ইদ্দাত তিন মাস এবং তাদেরও যাদের এখনও হায়িয আসা আরম্ভ হয়নি।’’সূরাহ আত্-ত্বলাক (তালাক)ঃ৪) قَالَ مُجَاهِدٌ إِنْ لَمْ تَعْلَمُوا يَحِضْنَ أَوْ لاَ يَحِضْنَ وَاللاَّئِي قَعَدْنَ عَنِ الْمَحِيضِ وَاللاَّئِي لَمْ يَحِضْنَ فَعِدَّتُهُنَّ ثَلاَثَةُ أَشْهُرٍ. মুজাহিদ বলেনঃ যদিও তোমরা না জান যে, তাদের হায়িয হবে কিনা। যাদের ঋতুস্রাব বন্ধ হয়ে গেছে এবং যাদের এখনো আরম্ভ হয়নি, তাদের ইদ্দাত তিন মাস। ৫৩১৮. নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সহধর্মিণী সালামাহ (রাঃ) হতে বর্ণিত যে, আসলাম গোত্রের সুবায়‘আ নামের এক স্ত্রীলোককে তার স্বামী গর্ভাবস্থায় রেখে মারা যায়। এরপর আবূ সানাবিল ইবনু বা‘কাক (রাঃ) তাকে বিয়ে করার প্রস্তাব দেয়। কিন্তু মহিলা তাকে বিয়ে করতে অস্বীকার করে। সে আবূ সানাবিল) বললঃ আল্লাহর শপথ! দু’টি মেয়াদের মধ্যে দীর্ঘতর মেয়াদ অনুসারে ইদ্দাত পালন না করা পর্যন্ত তোমার জন্য অন্যত্র বিয়ে করা জায়িয হবে না। এর প্রায় দশ দিনের মধ্যেই সে সন্তান প্রসব করে। এরপর সে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে আসলে তিনি বললেনঃ এখন তুমি বিয়ে করতে পার। [৪৯০৯] (আধুনিক প্রকাশনী- ৪৯২৮, ইসলামিক ফাউন্ডেশন- ৪৮২৩)",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 5319,
			"arabicnumber": 5319,
			"text": "‘আবদুল্লাহ (রাঃ) হতে বর্ণিত যে, তিনি ইবনু আরকামের নিকট একটি পত্র লিখলেন যে, তুমি সুবায়‘আ আস্লামীয়াকে জিজ্ঞেস কর, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে কী প্রকারের ফতোয়া দিয়েছিলেন? সে বললঃ তিনি আমাকে সন্তান প্রসব করার পর বিয়ে করার ফতোয়া দিয়েছেন। [৩৯৯১] আধুনিক প্রকাশনী- ৪৯২৯, ইসলামিক ফাউন্ডেশন- ৪৮২৪",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 5320,
			"arabicnumber": 5320,
			"text": "মিসওয়ার ইবনু মাখরামাহ (রাঃ) হতে বর্ণিত যে, সুবায়‘আ আসলামীয়া তার স্বামীর মৃত্যুর কয়েকদিন পর সন্তান প্রসব করে। এরপর সে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে এসে বিয়ে করার অনুমতি প্রার্থনা করে, তিনি তাকে অনুমতি দেন। তখন সে বিয়ে করে। আধুনিক প্রকাশনী- ৪৯৩০, ইসলামিক ফাউন্ডেশন- ৪৮২৫",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 5322,
			"arabicnumber": 5322,
			"text": "",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 5324,
			"arabicnumber": 5324,
			"text": "",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 5326,
			"arabicnumber": 5326,
			"text": "",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 5328,
			"arabicnumber": 5328,
			"text": "",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 5329,
			"arabicnumber": 5329,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, (হাজ্জ শেষে) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন রওয়ানা হওয়ার ইচ্ছা করলেন, তখন সফীয়্যাহ (রাঃ) দুঃখিত হয়ে স্বীয় তাঁবুর দরজায় দাঁড়িয়ে গেলেন। তিনি তাকে বললেনঃ বড় সমস্যায় ভুগছি, তুমি তো আমাদের আটকে রাখবে। আচ্ছা তুমি কি তাওয়াফে যিয়ারা সম্পন্ন করেছ? বললেনঃ হাঁ। তিনি বললেনঃ তা হলে এখন বেরিয়ে পড়। [২৯৪] আধুনিক প্রকাশনী- ৪৯৩৫, ইসলামিক ফাউন্ডেশন- ৪৮৩০",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 5330,
			"arabicnumber": 5330,
			"text": "وَكَيْفَ يُرَاجِعُ الْمَرْأَةَ إِذَا طَلَّقَهَا وَاحِدَةً أَوْ ثِنْتَيْنِ. এবং এক বা দু’তালাকের পর স্ত্রীকে ফিরিয়ে আনার নিয়ম সম্পর্কিত। ৫৩৩০. হাসান (রহ.) হতে বর্ণিত। তিনি বলেনঃ মা‘কাল তার বোনকে বিয়ে দিয়েছিল, অতঃপর তার স্বামী তাকে এক তালাক,দেয়। [৪৫২৯] আধুনিক প্রকাশনী- নাই, ইসলামিক ফাউন্ডেশন- ৪৮৩১",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 5331,
			"arabicnumber": 5331,
			"text": "হাসান (রহ.) হতে বর্ণিত যে, মা’কাল ইবনু ইয়াসারের বোন এক ব্যক্তির বিবাহ বন্ধনে আবদ্ধ ছিল। সে তাকে তালাক দিল। পুনরায় ফিরিয়ে আনল না, এভাবে তার ইদ্দাত শেষ হয়ে গেলে সে আবার তার কাছে বিয়ের প্রস্তাব দিল। মা‘কাল (রাঃ) এতে রাগান্বিত হলেন, তিনি বললেন, সময় মতফিরিয়ে নিল না, এখন আবার প্রস্তাব দিচ্ছে। তিনি তাদের মাঝে বিয়ের ব্যাপারে) বাধা হয়ে দাঁড়ালেন। এরপর আল্লাহ তা‘আলা এ আয়াতটি অবতীর্ণ করেনঃ তোমরা যখন স্ত্রীদেরকে তালাক দাও এবং তারা তাদের ইদ্দাত পূর্ণ করে, তখন তারা নিজেদের স্বামীদেরকে বিবাহ করতে চাইলে তোমরা প্রতিবন্ধকতা সৃষ্টি করো না ....... সূরাহ আল-বাক্বারাহ ২/২৩২)। এরপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে ডাকলেন এবং তার সম্মুখে আয়াতটি পাঠ করলেন। তিনি তার অহমিকা পরিত্যাগ করতঃ আল্লাহর আদেশের আনুগত্য করেন। [৪৫২৯] আধুনিক প্রকাশনী- ৪৯৩৬, ইসলামিক ফাউন্ডেশন- ৪৮৩২",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 5332,
			"arabicnumber": 5332,
			"text": "নাফি‘ (রহ.) হতে বর্ণিত যে, ইবনু ‘উমার (রাঃ) তাঁর স্ত্রীকে ঋতুমতী অবস্থায় এক তালাক দেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে আদেশ দিলেন, তিনি যেন তার স্ত্রীকে ফিরিয়ে আনেন এবং মহিলা পবিত্র হয়ে আবার ঋতুমতী হয়ে পরবর্তী পবিত্রা অবস্থা আসা পর্যন্ত তাকে নিজের কাছে রাখেন। পবিত্র অবস্থায় যদি তাকে তালাক দিতে চায় তবে সঙ্গমের পূর্বে তালাক দিতে হবে। এটাই ইদ্দাত, যে সময় স্ত্রীদেরকে তালাক দেয়ার জন্য আল্লাহ আদেশ দিয়েছেন। ‘আবদুল্লাহকে এ সম্পর্কে জিজ্ঞেস করা হলে তিনি তাদের বলেনঃ তুমি যদি তাকে তিন তালাক দিয়ে দাও, তবে স্ত্রীলোকটি অন্য স্বামী গ্রহণ না করা পর্যন্ত তোমার জন্য হারাম হয়ে যাবে। অন্য বর্ণনায় ইবন ‘উমার (রাঃ) বলতেন, ‘তুমি যদি এক বা দু’ তালাক দিতে’, কারণ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে এরকমই নির্দেশ দিয়েছেন। [৪৯০৮] (আধুনিক প্রকাশনী- ৪৯৩৭, ইসলামিক ফাউন্ডেশন- ৪৮৩৩)",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 5333,
			"arabicnumber": 5333,
			"text": "ইউনুস ইবনু যুবায়র (রহ.) হতে বর্ণিত। তিনি বলেন, আমি ইবনু ‘উমারকে (হায়িয অবস্থায় তালাক দেয়া সম্পর্কে) জিজ্ঞেস করলাম। তিনি বললেনঃ ইবনু ‘উমার (রাঃ) তার স্ত্রীকে হায়িয অবস্থায় তালাক দিলে, ‘উমার (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে এ সম্পর্কে জিজ্ঞেস করেন। তিনি স্ত্রীকে ফিরিয়ে নেয়ার জন্য তাকে নির্দেশ দেন। এরপর বলেনঃ ইদ্দাতের সময় আসলে সে তালাক দিতে পারে। রাবী বলেন, আমি বললাম, এ তালাক কি হিসাবে গণ্য করা হবে? ইবনু ‘উমার বললেনঃ তবে কি মনে করছ, যদি সে অক্ষম হয় বা বোকামি করে। (তাহলে দায়ী কে?) [৪৯০৮] (আধুনিক প্রকাশনী- ৪৯৩৮, ইসলামিক ফাউন্ডেশন- ৪৮৩৪)",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 5334,
			"arabicnumber": 5334,
			"text": "وَقَالَ الزُّهْرِيُّ لاَ أَر‘ى أَنْ تَقْرَبَ الصَّبِيَّةُ الْمُتَوَفّٰى عَنْهَا الطِّيبَ لِأَنَّ عَلَيْهَا الْعِدَّةَ. যুহরী (রহ.) বলেন, বিধবা কিশোরীর জন্য খোশবু ব্যবহার করা ঠিক হবে না। কারণ, তাকেও ইদ্দাত পালন করতে হবে। حَدَّثَنَا عَبْدُ اللهِ بْنُ يُوسُفَ أَخْبَرَنَا مَالِكٌ عَنْ عَبْدِ اللهِ بْنِ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ عَنْ حُمَيْدِ بْنِ نَافِعٍ عَنْ زَيْنَبَ بِنْتِ أَبِي سَلَمَةَ أَنَّهَا أَخْبَرَتْه“ هٰذِه„ الأَحَادِيثَ الثَّلاَثَةَ হুমায়দ ইবনু নাফি‘ হতে বর্ণিত হয়েছে তাকে যয়নাব বিনতু আবূ সালামাহ নিম্নোক্ত তিনটি হাদীস সম্পর্কে সংবাদ প্রদান করেনঃ ৫৩৩৪. যাইনাব বিনত আবূ সালামাহ (রাঃ) বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর স্ত্রী উম্মু হাবীবাহ’র পিতা আবূ সুফ্ইয়ান ইবনু হারব (রাঃ) মারা গেলে আমি তাঁর কাছে হাজির হলাম। উম্মু হাবীবাহ (রাঃ) যা‘ফরান ইত্যাদি মিশ্রিত হলদে রং এর খুশবু নিয়ে আসতে বললেন। তিনি এক বালিকাকে এ থেকে কিছু মাখালেন। এরপর তাঁর নিজের চেহারার উভয় দিকে কিছু মাখলেন। এরপর বললেনঃ আল্লাহর কসম! খুশবু মাখার কোন দরকার আমার নেই। তবে আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি, আল্লাহ ও পরকালে বিশ্বাসী কোন নারীর জন্য কারো মৃত্যুতে তিন দিনের বেশী শোক পালন করা হালাল হবে না। কিন্তু স্বামীর মৃত্যুতে চার মাস দশ দিন শোক পালন করবে। [১২৮০] (আধুনিক প্রকাশনী- ৪৯৩৯, ইসলামিক ফাউন্ডেশন- ৪৮৩৫)",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 5335,
			"arabicnumber": 5335,
			"text": "যাইনাব (রাঃ) বলেনঃ যাইনাব বিন্ত জাহশের ভাই মৃত্যুবরণ করলে আমি তার (যায়নাবের) নিকট গেলাম। তিনিও খুশবু আনিয়ে কিছু ব্যবহার করলেন। এরপর বললেনঃ আল্লাহর কসম! খুশবু ব্যবহার করার কোন প্রয়োজন আমার নেই। তবে আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে মিম্বরের উপর বলতে শুনেছিঃ আল্লাহ ও পরকালে বিশ্বাসী কোন নারীর জন্য কারো মৃত্যুতে তিন দিনের বেশী শোক পালন করা হালাল হবে না তবে তার স্বামীর মৃত্যুতে চার মাস দশ দিন শোক পালন করতে পারবে। [১২৮২] (আধুনিক প্রকাশনী- ৪৯৩৯, ইসলামিক ফাউন্ডেশন- ৪৮৩৫)",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 5336,
			"arabicnumber": 5336,
			"text": "যাইনাব (রাঃ) বলেনঃ আমি উম্মু সালামাহকে বলতে শুনেছি: এক নারী রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে এসে বললঃ হে আল্লাহর রাসূল! আমার মেয়ের স্বামী মারা গেছে। তার চোখে অসুখ। তার চোখে কি সুরমা লাগাতে পারবে? তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দু’ অথবা তিন বার বললেন, না। তিনি আরও বললেনঃ এতো মাত্র চার মাস দশ দিনের ব্যাপার। অথচ জাহিলী যুগে এক মহিলা এক বছরের মাথায় বিষ্ঠা নিক্ষেপ করত। [৫৩৩৮, ৫৭০৬] (আধুনিক প্রকাশনী- ৪৯৩৯, ইসলামিক ফাউন্ডেশন- ৪৮৩৫)",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 5337,
			"arabicnumber": 5337,
			"text": "(হুমায়দ বলেন, আমি যাইনাবকে জিজ্ঞেস করলাম, এক বছরের মাথায় বিষ্ঠা নিক্ষেপের অর্থ কী? তিনি বলেন, সে যুগে কোন স্ত্রীর স্বামী মারা গেলে সে অতি ক্ষুদ্র একটি প্রকোষ্ঠে প্রবেশ করতো এবং নিকৃষ্ট কাপড় পরত, কোন খুশবু ব্যবহার করতে পারত না। এভাবে এক বছর পার হলে তার কাছে চতুষ্পদ জন্তু যথা- গাধা, বকরী অথবা গাভী আনা হতো। আর সে তার গায়ে হাত বুলাতো। হাত বুলাতে বুলাতে অনেক সময় সেটা মরেও যেত। এরপর সে স্ত্রীলোকটি) বেরিয়ে আসতো। তাকে বিষ্ঠা দেয়া হতো এবং তা তাকে নিক্ষেপ করতে হতো। অতঃপর সে ইচ্ছা করলে খুশবু অথবা অন্য কিছু ব্যবহার করতে পারত। মালিক (রহ.)-কে ما تفتضبه শব্দের অর্থ জিজ্ঞেস করা হলে তিনি বলেনঃ ‘‘স্ত্রীলোকটি ঐ প্রাণীর চামড়ায় হাত বুলাতো’’। [মুসলিম ১৮/৯, হাঃ ১৪৮৬, ১৪৮৯] আধুনিক প্রকাশনী- ৪৯৩৯, ইসলামিক ফাউন্ডেশন- ৪৮৩৫",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 5338,
			"arabicnumber": 5338,
			"text": "উম্মু সালামাহ (রাঃ) হতে বর্ণিত আছে যে, এক মহিলার স্বামী মারা গেলে তার পরিবারের লোকেরা তার চোখদুটো নষ্ট হয়ে যাওয়ার ভয় করল। তারা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে এসে তার সুরমা ব্যবহারের অনুমতি প্রার্থনা করল। তিনি বললেনঃ সুরমা ব্যবহার করতে পারবে না। তোমাদের অনেকেই (জাহিলী যুগে) তার নিকৃষ্ট কাপড় বা নিকৃষ্ট ঘরে অবস্থান করত। যখন এক বছর পেরিয়ে যেত, আর কোন কুকুর সে দিকে যেত, তখন সে বিষ্ঠা নিক্ষেপ করত। কাজেই চার মাস দশ দিন পার না হওয়া পর্যন্ত সুরমা ব্যবহার করতে পারবে না। [৫৩৩৬] (আধুনিক প্রকাশনী- ৪৯৪০, ইসলামিক ফাউন্ডেশন- ৪৮৩৬)",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 5339,
			"arabicnumber": 5339,
			"text": "(বর্ণনাকারী বলেন) আমি যাইনাবকে উম্মু হাবীবাহ (রাঃ) থেকে বর্ণনা করতে শুনেছি যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আল্লাহ ও পরকালে বিশ্বাসী কোন মুসলিম নারীর জন্য কারো মৃত্যুতে তিন দিনের বেশী শোক পালন করা হালাল নয়। তবে স্বামীর মৃত্যুতে চার মাস দশ দিন শোক পালন করবে। [১২৮০; মুসলিম ১৮/৯, হাঃ ১৪৮৭, আহমাদ ২৬৮১৬] আধুনিক প্রকাশনী- ৪৯৪০, ইসলামিক ফাউন্ডেশন- ৪৮৩৬",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 5340,
			"arabicnumber": 5340,
			"text": "মুহাম্মাদ ইবনু সীরীন (রহ.) হতে বর্ণিত যে, উম্মু আতিয়্যাহ ( বলেছেন, স্বামী ব্যতীত অন্য কারো মৃত্যু হলে তিন দিনের বেশী শোক পালন করতে আমাদেরকে নিষেধ করা হয়েছে। [৩০৩] আধুনিক প্রকাশনী- ৪৯৪১, ইসলামিক ফাউন্ডেশন- ৪৮৩৭",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 5341,
			"arabicnumber": 5341,
			"text": "উম্মু আতিয়্যাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, কারো মৃত্যুতে তিন দিনের বেশী শোক পালন করা হতে আমাদেরকে নিষেধ করা হত। তবে স্বামী মারা গেলে চার মাস দশ দিন শোক পালন করতে হবে এবং আমরা যেন সুরমা খুশবু ব্যবহার না করি আর রঙিন কাপড় যেন না পরি তবে হালকা রঙের ছাড়া। আমাদের কেউ যখন হায়িয শেষে গোসল করে পবিত্র হয়, তখন (দুর্গন্ধ দূর করার জন্য) আযফার নামক স্থানের সুগন্ধি ব্যবহার করার আমাদেরকে অনুমতি দেয়া হয়েছে। তাছাড়া আমাদেরকে জানাযার অনুসরণ করতে নিষেধ করা হতো। [৩১৩] (আধুনিক প্রকাশনী- ৪৯৪২, ইসলামিক ফাউন্ডেশন- ৪৮৩৮)",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 5342,
			"arabicnumber": 5342,
			"text": "উম্মু আতিয়্যাহ ( হতে বর্ণিত। তিনি বলেন, নবীসাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আল্লাহ ও পরকালে বিশ্বাসী কোন মহিলার জন্য স্বামী ব্যতীত অন্য কারো মৃত্যুতে তিন দিনের বেশী শোক পালন করা হালাল হবে না।। সুরমা ও রঙিন কাপড়ও ব্যবহার করতে পারবে না। তবে সূতাগুলো একত্রে বেঁধে হালকা রং লাগিয়ে তা দিয়ে কাপড় বুনলে তা ব্যবহার করা যাবে। [১৩১৩] আধুনিক প্রকাশনী- ৪৯৪৩, ইসলামিক ফাউন্ডেশন- ৪৮৩৯",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 5343,
			"arabicnumber": 5343,
			"text": "উম্মু আতিয়্যাহ ( হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিষেধ করেছেন শোক পালনকারিণী যেন সুগন্ধি না মাখে। তবে হায়িয থেকে পবিত্র হলে (দুর্গন্ধ দূর করার জন্য) কাফূরের ‘কুস্ত’ ও ‘আযফার’ সুগন্ধি ব্যবহার করতে পারে। [১৩১৩] আধুনিক প্রকাশনী- ৪৯৪৩, ইসলামিক ফাউন্ডেশন- ৪৮৩৯",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 5344,
			"arabicnumber": 5344,
			"text": "মুজাহিদ (রহ.) হতে বর্ণিত। মহান আল্লাহর বাণীঃ ‘‘তোমাদের মধ্যে যারা বিবিদেরকে রেখে মারা যাবে’’ সূরাহ আল-বাক্বরাহ ২ঃ ২৪০) তিনি এ আয়াতের ব্যাখ্যায় বলেন, স্বামীর বাড়ীতে অবস্থান করে এ ইদ্দাত পালন করা মহিলার জন্য ওয়াজিব ছিল। পরে মহান আল্লাহ অবতীর্ণ করেনঃ ‘‘তোমাদের মধ্যে যারা বিবিদেরকে রেখে মারা যাবে, তারা বিবিদের জন্য অসিয়ত করবে যেন এক বৎসরকাল সুযোগ-সুবিধা পায় এবং গৃহ হতে বের করে দেয়া না হয়, তবে যদি তারা নিজেরাই বের হয়ে যায়, তবে তোমাদের প্রতি গুনাহ নেই তারা নিজেদের ব্যাপারে বৈধভাবে কিছু করলে।’’ (সূরাহ আল-বাক্বরাহ ২ঃ ২৪০)। মুজাহিদ বলেনঃ আল্লাহ তা‘আলা সাত মাস বিশ রাতকে তার জন্য পূর্ণ বছর সাব্যস্ত করেছেন। মহিলা ইচ্ছা করলে ওসিয়ত অনুসারে থাকতে পারে, আবার চাইলে চলেও যেতে পারে। এ কথাই আল্লাহ তা‘আলা বলেছেনঃ ‘‘বের না করে, তবে যদি স্বেচ্ছায় বের হয়ে যায় তবে তাতে তোমাদের কোন পাপ নেই’’ তাই মহিলার উপর ইদ্দাত পালন করা যথারীতি ওয়াজিব আছে। আবূ নাজীহ এ কথাগুলো মুজাহিদ থেকে বর্ণনা করেছেন। ‘আত্বা বলেন, ইবনু ‘আব্বাস বলেছেনঃ এ আয়াতটি স্বামীর বাড়ীতে ইদ্দাত পালন করার নির্দেশকে রহিত করে দিয়েছে। অতএব, সে যেখানে ইচ্ছা ইদ্দাত পালন করতে পারে। ‘আত্বা বলেনঃ ইচ্ছা হলে ওয়াসিয়াত অনুযায়ী সে স্বামীর পরিবারে অবস্থান করতে পারে। আবার ইচ্ছা হলে অন্যত্রও ইদ্দাত পালন করতে পারে। কেননা, মহান আল্লাহ বলেছেনঃ ‘‘তারা নিজেদের জন্য বিধিমত যা করবে, তাতে তোমাদের কোন পাপ নেই।’’ আত্বা বলেন, এরপর মিরাসের আয়াত অবতীর্ণ হলে ‘বাসস্থান দেয়ার’ হুকুমও রহিত হয়ে যায়। এখন সে যেখানে মনে চায় ইদ্দাত পালন করতে পারে, তাকে বাসস্থান দেয়া জরুরী নয়। [৪৫৩১] আধুনিক প্রকাশনী- ৪৯৪৪, ইসলামিক ফাউন্ডেশন- ৪৮৪০",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 5345,
			"arabicnumber": 5345,
			"text": "উম্মু হাবীবাহ বিনত আবূ সুফ্ইয়ান (রাঃ) হতে বর্ণিত। যখন তাঁর কাছে তার পিতার মৃত্যু সংবাদ পৌঁছল, তখন তিনি সুগন্ধি আনিয়ে তার উভয় হাতে লাগালেন এবং বললেনঃ সুগন্ধি ব্যবহারে কোন দরকার আমার নেই। কিন্তু যেহেতু আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছিঃ আল্লাহ ও পরকালে বিশ্বাসী কোন নারীর জন্য কারো মৃত্যুতে তিন দিনের অধিক শোক পালন করা হালাল হবে না। তবে স্বামীর মৃত্যুতে চার মাস দশ দিন শোক পালন করতে হবে। [১২৮০] আধুনিক প্রকাশনী- ৪৯৪৫, ইসলামিক ফাউন্ডেশন- ৪৮৪১",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 5346,
			"arabicnumber": 5346,
			"text": "হাসান (রহ.) বলেছেন, যদি কেউ অজান্তে কোন মুহাররাম (যার সাথে বিয়ে করা অবৈধ) মহিলাকে বিয়ে করে ফেলে, তবে তাদেরকে বিচ্ছিন্ন করে দিতে হবে। মহিলা নির্দিষ্ট মাহর ব্যতীত অন্য কিছু পাবে না। তিনি পরবর্তীতে বলেছেন, সে মাহরে মিসাল পাবে। ৫৩৪৬. আবূ মাস‘ঊদ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কুকুরের মূল্য, গণকের পারিশ্রমিক এবং পতিতার উপার্জন গ্রহণ করতে নিষেধ করেছেন। [২২৩৭] (আধুনিক প্রকাশনী- ৪৯৪৬, ইসলামিক ফাউন্ডেশন- ৪৮৪২)",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 5347,
			"arabicnumber": 5347,
			"text": "আওন ইবন আবূ জুহাইফাহ এর পিতা হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম লা‘নাত করেছেন উল্কি অঙ্কণকারিণী, উল্কি গ্রহণকারিণী, সুদ গ্রহিতা ও সুদ দাতাকে। তিনি কুকুরের মূল্য ও পতিতার উপার্জন ভোগ করতে নিষেধ করেছেন। চিত্রাঙ্কণকারীদেরকেও তিনি লা‘নাত করেছেন। [২০৮৬] (আধুনিক প্রকাশনী- ৪৯৪৭, ইসলামিক ফাউন্ডেশন- ৪৮৪৩)",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 5348,
			"arabicnumber": 5348,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত, দাসীর অবৈধ উপার্জন ভোগ করতে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিষেধ করেছেন। [২২৮৩] (আধুনিক প্রকাশনী- ৪৯৪৮, ইসলামিক ফাউন্ডেশন- ৪৮৪৪)",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 5349,
			"arabicnumber": 5349,
			"text": "সা‘ঈদ ইবনু যুবায়র (রহ.) হতে বর্ণিত। তিনি বলেন, আমি ইবনু ‘উমারকে জিজ্ঞেস করলামঃ যদি কেউ তার স্ত্রীকে অপবাদ দেয়? তিনি বললেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আজলান গোত্রের এক দম্পতির বৈবাহিক সম্পর্ক ছিন্ন করে দেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আল্লাহ জানেন তোমাদের দু’জনের একজন অবশ্যই মিথ্যাবাদী। সুতরাং তোমাদের কেউ কি তওবা করবে? তারা উভয়ে অস্বীকার করল। তিনি আবার বললেনঃ আল্লাহ জানেন তোমাদের একজন অবশ্যই মিথ্যাবাদী। কাজেই তোমাদের মধ্যে তওবা করতে কে প্রস্তুত? তারা কেউ রাযী হল না। এরপর তিনি তাদের মধ্য বিচ্ছেদ ঘটিয়ে দিলেন। আইয়ূব বলেনঃ আমর ইবনু দ্বীনার আমাকে বললেন, হাদীসে আরো কিছু কথা আছে, আমি তা তোমাকে বর্ণনা করতে দেখছি না। রাবী বলেন, লোকটি তখন বলল, আমার মাল প্রদত্ত মাহর) ফেরত পাব না? তিনি বললেনঃ তুমি কোন মাল পাবে না। যদি তুমি সত্যবাদী হও, তবে তো তুমি তার সাথে সহবাস করেছ। আর যদি মিথ্যাচারী হও, তাহলে মাল ফেরত পাওয়া তো বহু দূরের ব্যাপার। [৫৩১১] আধুনিক প্রকাশনী- ৪৯৪৯, ইসলামিক ফাউন্ডেশন- ৪৮৪৫",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 5350,
			"arabicnumber": 5350,
			"text": "وَلَمْ يَذْكُرِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمُلاَعَنَةِ مُتْعَةً حِينَ طَلَّقَهَا زَوْجُهَا আর লি‘আনকারিণীকে তার স্বামী ত্বলাক (তালাক)্ব দেয়ার সময় নবীসাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার জন্য মুত‘আর [তাকে উপভোগের বিনিময় হিসাবে] কিছু দিয়ে দেয়ার কথা উল্লেখ করেননি। ৫৩৫০. ইবনু ‘উমার হতে বর্ণিত আছে যে, নবীসাল্লাল্লাহু আলাইহি ওয়াসাল্লামলি‘আনকারী স্বামী-স্ত্রীকে বলেছিলেন, আল্লাহই তোমাদের হিসাব নিবেন। তোমাদের একজন মিথ্যাবাদী। তার মহিলার) উপর তোমার কোন অধিকার নেই। সে বললঃ হে আল্লাহর রাসূল! আমার মাল? তিনি বললেনঃ তোমার জন্যে কোন মাল নেই। তুমি যদি সত্যি কথা বলে থাক, তাহলে এ মাল তার লজ্জাস্থানকে হালাল করার বিনিময়ে হবে। আর যদি মিথ্যা বলে থাক, তবে এটা তুমি মোটেই চাইতে পার না, তুমি তো তার থেকে অনেক দূরে। [৫৩১১; মুসলিম ১৯/হাঃ ১৪৯৩, আহমাদ ৪৫৮৭] আধুনিক প্রকাশনী- ৪৯৫০, ইসলামিক ফাউন্ডেশন- ৪৮৪৬",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 95
			}
		}
	]
}