{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"72": "Hunting, Slaughtering"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5475,
			"arabicnumber": 5475,
			"text": "(‘‘হে মু’মিনগণ! আল্লাহ তোমাদেরকে কঠিন পরীক্ষার সম্মুখীন করবেন মুহরিম অবস্থায়) শিকারের ব্যপারে........ যন্ত্রণাদায়ক শাস্তি।’’ পর্যন্ত- (সূরাহ আল-মায়িদাহ ৫/৯৪) মহান আল্লাহর বাণীঃ ‘‘তোমাদের জন্য গৃহপালিত চতুস্পদ জন্তু হালাল করা হল- সেগুলো ছাড়া যেগুলোর বিবরণ তোমাদেরকে দেয়া হচ্ছে.......... কাজেই তাদেরকে ভয় করো না, কেবল আমাকেই ভয় কর।’’ (সূরাহ আল-মায়িদাহ ৫/১-৩) ইবনু ‘আব্বাস (রাঃ) বলেন,অঙ্গীকারসমূহ যা কিছু হালাল করা হয় বা হারাম করা হয়। শূকর। তোমাদেরকে যেন প্ররোচিত করে। শত্রুতা। শ্বাসরুদ্ধ হয়ে মারা যাওয়া প্রাণী। প্রহারে মৃত প্রাণী। উঁচু স্থান থেকে পতিত হয়ে মারা যাওয়া প্রাণী। শিং এর আঘাতে মারা যাওয়া প্রাণী। ইবনু ‘আব্বাস (রাঃ) বলেন, এর মধ্যে যে জন্তুটির তুমি লেজ বা চোখ নড়াচড়া করা অবস্থায় পাবে। সেটাকে যবহ করবে এবং আহার করবে। [1] ৫৪৭৫. আদী ইবনু হাতিম (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে তীরের ফলার আঘাতে প্রাপ্ত শিকারের ব্যাপারে জিজ্ঞেস করলাম। উত্তরে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তীরের ধারালো অংশের দ্বারা যেটি নিহত হয়েছে সেটি খাও। আর ফলকের বাঁটের আঘাতে যেটি নিহত হয়েছে সেটি ‘অকীয’ (অর্থাৎ থেতলে যাওয়া মৃতের মধ্যে গণ্য)। আমি তাঁকে কুকুরের দ্বারা প্রাপ্ত শিকার সম্পর্কেও জিজ্ঞেস করলাম। উত্তরে তিনি বললেনঃ যে শিকারকে কুকুর তোমার জন্য ধরে রাখে সেটি খাও। কেননা, কুকুরের ঘায়েল করা যবহর হুকুম রাখে। তবে তুমি যদি তোমার কুকুর বা কুকুরগুলোর সঙ্গে অন্য কুকুর পাও এবং তুমি আশঙ্কা কর যে, অন্য কুকুরটিও তোমার কুকুরের শিকার ধরেছে এবং হত্যা করেছে, তা হলে তা খেও না। কারণ, তুমি তো কেবল নিজের কুকুর ছাড়ার সময় বিসমিল্লাহ বলেছ। অন্যের কুকুরের জন্য তা বলনি। [১৭৫] (আধুনিক প্রকাশনী- ৫০৭০, ইসলামিক ফাউন্ডেশন- ৪৯৬৭)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 5476,
			"arabicnumber": 5476,
			"text": "وَقَالَ ابْنُ عُمَرَ فِي الْمَقْتُولَةِ بِالْبُنْدُقَةِ تِلْكَ الْمَوْقُوذَةُ وَكَرِهَه“ سَالِمٌ وَالْقَاسِمُ وَمُجَاهِدٌ وَإِبْرَاهِيمُ وَعَطَاءٌ وَالْحَسَنُ وَكَرِهَ الْحَسَنُ رَمْيَ الْبُنْدُقَةِ فِي الْقُر‘ى وَالأَمْصَارِ وَلاَ يَر‘ى بَأْسًا فِيمَا سِوَاهُ. বন্দুকের গুলিতে শিকার সম্বন্ধে ইবনু ‘উমার বলেছেনঃ এটি মাওকুযাহ বা থেতলে যাওয়া শিকারের অন্তর্ভুক্ত। সালিম, কাসিম, মুজাহিদ, ইবরাহীম, ‘আত্বা ও হাসান বাসরী (রহ.) একে মাকরূহ মনে করেন। হাসানের মতে গ্রাম এলাকা ও শহর এলাকায় বন্দুক দিয়ে শিকার করা মাকরূহ। তবে অন্যত্র শিকার করতে কোন দোষ নেই। ৫৪৭৬. আদী ইবনু হাতিম (রাঃ) হতে বর্ণিত। তিনি বলেনঃ আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে তীরের শিকার সম্পর্কে জিজ্ঞেস করলাম। তিনি বললেনঃ যদি তীরের ধারালো অংশ দ্বারা আঘাত করে থাক তাহলে খাও, আর যদি ফলার আঘাত লেগে থাকে এবং শিকারটি মারা যায়, তাহলে খেও না। কেননা, সেটি ওয়াকীয বা থেতলে মরার মধ্যে গণ্য। আমি বললামঃ আমি তো শিকারের জন্য কুকুর ছেড়ে দেই। তিনি উত্তর দিলেনঃ যদি তোমার কুকুরকে তুমি বিসমিল্লাহ পড়ে ছেড়ে থাক, তা হলে খাও। আমি আবার বললামঃ যদি কুকুর কিছুটা খেয়ে ফেলে? তিনি বললেনঃ তা হলে খেও না, কারণ সে তা তোমার জন্য ধরে রাখেনি বরং সে ধরেছে নিজের জন্যই। আমি বললামঃ আমি আমার কুকুরকে পাঠিয়ে দেবার জন্য যদি তার সঙ্গে অন্য কুকুরকেও দেখতে পাই, তখন? তিনি বললেনঃ তাহলে খেও না। কেননা, তুমি তো কেবল তোমার কুকুরের উপর বিসমিল্লাহ বলেছ, অন্য কুকুরের উপর বিসমিল্লাহ বলনি। [১৭৫] (আধুনিক প্রকাশনী- ৫০৭১, ইসলামিক ফাউন্ডেশন- ৪৯৬৮)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 5477,
			"arabicnumber": 5477,
			"text": "আদী ইবনু হাতিম (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে জিজ্ঞেস করলামঃ হে আল্লাহর রাসূল! আমরা প্রশিক্ষণপ্রাপ্ত কুকুরগুলোকে শিকারে পাঠিয়ে থাকি। তিনি বললেনঃ কুকুরগুলো তোমার জন্য যেটি ধরে রাখে সেটি খাও। আমি বললামঃ যদি ওরা হত্যা করে ফেলে? তিনি বললেনঃ যদি ওরা হত্যাও করে ফেলে। আমি বললামঃ আমরা তো ফলার দ্বারাও শিকার করে থাকি। তিনি বললেনঃ সেটি খাও, যেটি তীরে যখম করেছে; আর যেটি তীরের পার্শ্বের আঘাতে মারা গেছে সেটি খেও না। [১৭৫; মুসলিম ৩৪/১, হাঃ ১৯২৯, আহমাদ ১৯৩৮৯] (আধুনিক প্রকাশনী- ৫০৭২, ইসলামিক ফাউন্ডেশন- ৪৯৬৯)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 5478,
			"arabicnumber": 5478,
			"text": "وَقَالَ الْحَسَنُ وَإِبْرَاهِيمُ إِذَا ضَرَبَ صَيْدًا فَبَانَ مِنْه“ يَدٌ أَوْ رِجْلٌ لاَ تَأْكُلُ الَّذِي بَانَ وَكُلْ سَائِرَهُ. وَقَالَ إِبْرَاهِيمُ إِذَا ضَرَبْتَ عُنُقَه“ أَوْ وَسَطَه“ فَكُلْه“ وَقَالَ الأَعْمَشُ عَنْ زَيْدٍ اسْتَعْصٰى عَلٰى رَجُلٍ مِنْ آلِ عَبْدِ اللهِ حِمَارٌ فَأَمَرَهُمْ أَنْ يَضْرِبُوه“ حَيْثُ تَيَسَّرَ دَعُوا مَا سَقَطَ مِنْه“ وَكُلُوهُ. হাসান ও ইবরাহীম (রহ.) বলেছেনঃ কোন ব্যক্তি যদি শিকারকে আঘাত করে, ফলে তার হাত কিংবা পা পৃথক হয়ে যায়, তাহলে পৃথক অংশটি খাওয়া যাবে না, অবশিষ্ট অংশটি খাওয়া যাবে। ইবরাহীম (রহ.) বলেছেনঃ তুমি যদি শিকারের ঘাড়ে কিংবা মধ্যভাগে আঘাত কর, তা হলে তা খাও। যায়েদের সূত্রে আ‘মাশ (রহ.) বলেছেন যে, ‘আবদুল্লাহ ইবনু মাস‘উদের গোত্রের একটি গাধা নাগালের বাইরে চলে গিয়েছিল। তখন তিনি আদেশ দিয়েছিলেনঃ তার দেহের যে অংশেই সম্ভব হয় সেখানেই আঘাত কর। তারপর যে অংশটি ছিঁড়ে তা বাদ দিয়ে বাকীটা খাও। ৫৪৭৮. আবূ সা‘লাবা আল খুশানী (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি জিজ্ঞেস করলামঃ হে আল্লাহর নবী! আমরা আহলে কিতাব সম্প্রদায়ের এলাকায় বসবাস করি। আমরা কি তাদের থালায় খেতে পারি? তাছাড়া আমরা শিকারের অঞ্চলে থাকি। তীর ধনুকের সাহায্যে শিকার করি এবং প্রশিক্ষণপ্রাপ্ত ও প্রশিক্ষণবিহীন কুকুর দিয়ে শিকার করে থাকি। এমতাবস্থায় আমার জন্য কোনটি বৈধ হবে? উত্তরে তিনি বললেনঃ তুমি যে সকল আহলে কিতাবের কথা উল্লেখ করলে তাতে বিধান হলঃ যদি অন্য পাত্র পাও তাদের পাত্রে খাবে না। আর যদি না পাও, তাহলে তাদের পাত্রগুলো ধুয়ে নিয়ে তাতে আহার কর। আর যে প্রাণীকে তুমি তোমার তীর ধনুকের সাহায্যে শিকার করেছ এবং বিসমিল্লাহ পড়েছ সেটি খাও। আর যে প্রাণীকে তুমি তোমার প্রশিক্ষণপ্রাপ্ত কুকুরের দ্বারা শিকার করেছ এবং বিসমিল্লাহ পড়েছ, সেটি খাও। আর যে প্রাণীকে তুমি তোমার প্রশিক্ষণবিহীন কুকুর দ্বারা শিকার করেছ, সেটি যদি যবহ করতে পার তবে তা খেতে পার। [৫৪৮৮, ৫৪৯৬; মুসলিম ৩৪/১, হাঃ ১৯৩০, আহমাদ ১৭৭৬৭] (আধুনিক প্রকাশনী- ৫০৭৩, ইসলামিক ফাউন্ডেশন- ৪৯৭০)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 5479,
			"arabicnumber": 5479,
			"text": "‘আবদুল্লাহ ইবনু মুগাফফাল (রাঃ) হতে বর্ণিত যে, তিনি এক ব্যক্তিকে দেখলেন, সে ছোট ছোট পাথর নিক্ষেপ করছে। তখন তিনি তাকে বললেনঃ পাথর নিক্ষেপ করো না। কেননা, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পাথর ছুঁড়তে নিষেধ করেছেন অথবা রাবী বলেছেনঃ পাথর ছোঁড়াকে তিনি অপছন্দ করতেন এবং নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ এর দ্বারা কোন প্রাণী শিকার করা হয় না এবং কোন শত্রুকেও ঘায়েল করা হয় না। তবে এটি কারো দাঁত ভেঙ্গে ফেলতে পারে এবং চোখ ফুঁড়ে দিতে পারে। তারপর তিনি আবার তাকে পাথর ছুঁড়তে দেখলেন। তখন তিনি বললেনঃ আমি তোমাকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর হাদীস বর্ণনা করেছিলাম যে, তিনি পাথর নিক্ষেপ করতে নিষেধ করেছেন অথবা তিনি তা অপছন্দ করেছেন। তা সত্ত্বেও তুমি পাথর নিক্ষেপ করছ? আমি তোমার সঙ্গে কথাই বলব না- এতকাল এতকাল পর্যন্ত। [৪৭৪১; মুসলিম ৩৪/১০, হাঃ ১৯৫৪] (আধুনিক প্রকাশনী- ৫০৭৪, ইসলামিক ফাউন্ডেশন- ৪৯৭১)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 5480,
			"arabicnumber": 5480,
			"text": "ইবনু ‘উমার (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছেন, তিনি বলেনঃ যে ব্যক্তি এমন কুকুর পালে যেটি পশু রক্ষার জন্যও নয় কিংবা শিকারের জন্যও নয়; তার ‘আমল থেকে প্রত্যহ দু’ কীরাত পরিমাণ কমে যাবে। [৫৪৮১, ৫৪৮২] (আধুনিক প্রকাশনী- ৫০৭৫, ইসলামিক ফাউন্ডেশন- ৪৯৭২)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 5481,
			"arabicnumber": 5481,
			"text": "‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছেন, যে ব্যক্তি শিকারী কুকুর কিংবা পশু রক্ষাকারী কুকুর ছাড়া অন্য কোন কুকুর পোষে, সে ব্যক্তির সাওয়াব থেকে প্রতিদিন দু’ কীরাত পরিমাণ কমে যায়। [৫৪৮০] (আধুনিক প্রকাশনী- ৫০৭৬, ইসলামিক ফাউন্ডেশন- ৪৯৭৩)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 5482,
			"arabicnumber": 5482,
			"text": "‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তি পশু রক্ষাকারী কিংবা শিকারী কুকুর ছাড়া অন্য কুকুর পালে, তার ‘আমল থেকে প্রতিদিন দু’ কীরাত পরিমাণ সাওয়াব কমে যায়। [৫৪৮০] (আধুনিক প্রকাশনী- ৫০৭৭, ইসলামিক ফাউন্ডেশন- ৪৯৭৪)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 5483,
			"arabicnumber": 5483,
			"text": "(এবং মহান আল্লাহর বাণীঃ ‘‘লোকেরা জিজ্ঞেস করছে তাদের জন্য কী কী হালাল করা হয়েছে..........আল্লাহ হিসাব গ্রহণে ত্বরিৎগতি।’’ পর্যন্ত-সূরাহ আল-মায়িদাহ ৫/৪)। তারা যা উপার্জন করেছে। ইবনু ‘আব্বাস (রাঃ) বলেছেনঃ যদি কুকুর শিকারের কিছুটা খেয়ে ফেলে, তবে সে শিকার নষ্ট করে ফেলল। কেননা, সে তো তখন নিজের জন্য ধরেছে বলে গণ্য হবে। অথচ আল্লাহ তা‘আলা বলেছেনঃ ‘‘যেগুলোকে তোমরা শিকার শিক্ষা দিয়েছ যেভাবে আল্লাহ তোমাদেরকে শিক্ষা দিয়েছেন। কাজেই কুকুরকে প্রহার করতে হবে এবং শিক্ষা দিতে হবে, যাতে সে শিকার খাওয়া ত্যাগ করে।’’ ইবনু ‘উমার এটিকে মাকরূহ বলতেন। ‘আত্বা র) বলেছেন, কুকুর যদি রক্ত পান করে আর গোশ্ত না খায় তাহলে সেই শিকার) খেতে পারে। ৫৪৮৩. আদী ইবনু হাতিম (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে জিজ্ঞেস করলামঃ আমরা এমন সম্প্রদায়, যারা এ সকল কুকুরের দ্বারা শিকার করে থাকি। তিনি বললেনঃ তুমি যদি তোমার প্রশিক্ষণপ্রাপ্ত কুকুরগুলোকে বিসমিল্লাহ পড়ে পাঠিয়ে থাক তাহলে ওরা যেগুলো তোমাদের জন্য ধরে রাখে, তা খাও; যদিও শিকারকে কুকুর হত্যা করে ফেলে। তবে যদি কুকুর শিকারের কিছুটা খেয়ে ফেলে (তাহলে খাবে না)। কেননা, তখন আমার আশঙ্কা হয় যে, সে শিকার নিজেরই উদ্দেশে ধরেছে। আর যদি তার সঙ্গে অন্য কুকুর মিলে যায়, তাহলে খাবে না। [১৭৫] আধুনিক প্রকাশনী- ৫০৭৮, ইসলামিক ফাউন্ডেশন- ৪৯৭৫",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 5484,
			"arabicnumber": 5484,
			"text": "আদী ইবনু হাতিম (রাঃ)-এর সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেছেনঃ তুমি যদি তোমার কুকুরকে বিসমিল্লাহ পড়ে পাঠাও, এরপর কুকুর শিকার পাকড়াও করে এবং মেরে ফেলে, তবে তুমি তা খেতে পার। আর যদি কুকুর কিছুটা খেয়ে ফেলে, তাহলে খাবে না। কেননা, সে তো নিজের জন্যই ধরেছে। আর যদি এমন কুকুরদের সঙ্গে মিশে যায়, যাদের উপর বিসমিল্লাহ পড়া হয়নি এবং সেগুলো শিকার ধরে মেরে ফেলে, তা হলে তা খাবে না। কেননা, তুমি তো জান না যে, কোন কুকুরটি হত্যা করেছে? আর যদি তুমি শিকারের প্রতি তীর নিক্ষেপ করে থাক; এরপর তা একদিন বা দু’দিন পর এমন অবস্থায় হাতে পাও যে, তার গায়ে তোমার তীরের আঘাত ব্যতীত অন্য কিছু নেই, তাহলে খাও। আর যদি তা পানির মধ্যে পড়ে থাকে, তা হলে তা খাবে না। [১৭৫] (আধুনিক প্রকাশনী- ৫০৭৯, ইসলামিক ফাউন্ডেশন- ৪৯৭৬)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 5485,
			"arabicnumber": 5485,
			"text": "‘আবদুল ‘আলা দাঊদ সূত্রে আদী থেকে বর্ণনা করেন যে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে জিজ্ঞেস করেছিলেনঃ যদি কোন ব্যক্তি শিকারের প্রতি তীর নিক্ষেপ করে এবং দু’ তিন দিন পর্যন্ত সেই শিকারের খোঁজ করার পর মৃত অবস্থায় পায় এবং দেখে যে, তার গায়ে তার তীর লেগে আছে (তখন সে কী করবে?) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ ইচ্ছা করলে সে খেতে পারে। [১৭৫] (আধুনিক প্রকাশনী- ৫০৭৯, ইসলামিক ফাউন্ডেশন- ৪৯৭৬)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 5486,
			"arabicnumber": 5486,
			"text": "আদী ইবনু হাতিম (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি জিজ্ঞেস করলামঃ হে আল্লাহর রাসূল! আমি ‘বিসমিল্লাহ’ পড়ে আমার কুকুরকে পাঠিয়ে থাকি। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তুমি যদি বিসমিল্লাহ পড়ে তোমার কুকুরটিকে পাঠিয়ে থাক, এরপর সে শিকার ধরে মেরে ফেলে এবং কিছুটা খেয়ে নেয়, তা হলে তুমি খেয়ো না। কেননা, সে তো নিজের জন্যই তা ধরেছে। আমি বললামঃ আমি আমার কুকুরটিকে পাঠালাম, পরে তার সঙ্গে অন্য কুকুরও দেখতে পেলাম। আমি জানি না উভয়ের কে শিকার ধরেছে। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তুমি তা খেয়ো না। কেননা, তুমি তো তোমার কুকুরের উপরই ‘বিসমিল্লাহ’ পড়েছ, অন্যটির উপর পড়নি। আমি তাঁকে তীরের শিকার সম্পর্কে জিজ্ঞেস করলাম। তিনি বললেনঃ যদি তুমি তীরের ধার দিয়ে আঘাত করে থাক, তাহলে খাও। আর যদি পার্শ্বের দ্বারা আঘাত কর আর তাতে তা মারা যায়, তাহলে সেটি ওয়াকীয- থেতলে মারার মধ্যে গণ্য হবে। কাজেই তা খেয়ো না। [১৭৫] (আধুনিক প্রকাশনী- ৫০৮০, ইসলামিক ফাউন্ডেশন- ৪৯৭৭)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 5487,
			"arabicnumber": 5487,
			"text": "আদী ইবনু হাতিম (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে জিজ্ঞেস করে বললামঃ আমরা এমন সম্প্রদায়, যারা এ সকল কুকুরের দ্বারা শিকার করতে অভ্যস্ত। তিনি বললেনঃ তুমি যদি আল্লাহর নাম উচ্চারণ করে বিসমিল্লাহ বলে) তোমার প্রশিক্ষণপ্রাপ্ত কুকুরগুলোকে পাঠাও, তাহলে কুকুরগুলো তোমার জন্য যা ধরে রাখবে, তুমি তা খেতে পার। তবে কুকুর যদি কিছুটা খেয়ে ফেলে, তাহলে তুমি খেয়ো না। কেননা, আমার আশঙ্কা হয় যে, সে তখন নিজের জন্যই ধরেছে। আর যদি তার সঙ্গে অন্যান্য কুকুর শামিল হয়, তাহলেও খেয়ো না। [১৭৫] (আধুনিক প্রকাশনী- ৫০৮১, ইসলামিক ফাউন্ডেশন- ৪৯৭৮)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 5488,
			"arabicnumber": 5488,
			"text": "আবূ সা‘লাবা খুশানী হতে বর্ণিত। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর কাছে এসে বললামঃ হে আল্লাহর রাসূল! আমরা আহলে কিতাব সম্প্রদায়ের এলাকায়বাস করি, তাদের পাত্রে আহার করি। আর আমরা শিকারের অঞ্চলে থাকি, শিকার করি তীর ধনুক দিয়ে, প্রশিক্ষণপ্রাপ্ত কুকুর দিয়ে এবং প্রশিক্ষণপ্রাপ্ত নয় এমন কুকুর দিয়েও। অতএব আমাকে বলে দিন, এর মধ্যে আমাদের জন্য কোনটি হালাল? তিনি বললেনঃ তুমি যা উল্লেখ করেছ, তুমি আহলে কিতাব সম্প্রদায়ের এলাকায় বসবাস কর, তাদের পাত্রে খানা খাও। তবে যদি তাদের পাত্র ব্যতীত অন্য পাত্র পাও, তাহলে তাদের পাত্রে আহার করো না। আর যদি না পাও, তাহলে ঐগুলো ধুয়ে নিয়ে তাতে আহার করবে। আর তুমি উল্লেখ করেছ যে তুমি শিকারের অঞ্চলে থাক। তুমি যা তীর ধনুক দ্বারা শিকার কর, তাতে তুমি বিসমিল্লাহ পড়বে এবং তা খাবে। তোমার প্রশিক্ষণপ্রাপ্ত কুকুর দিয়ে যা শিকার কর, তাতে বিসমিল্লাহ পড়বে এং তা খাবে। আর তুমি যদি প্রশিক্ষণহীন কুকুর দ্বারা শিকার কর, সেক্ষেত্রে যদি যবহ করা যায়, তাহলে খেতে পার। [৫৪৭৮] আধুনিক প্রকাশনী- ৫০৮২, ইসলামিক ফাউন্ডেশন- ৪৯৭৯",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 5489,
			"arabicnumber": 5489,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। তিনি বলেন, আমরা মাররুয যাহরান নামক স্থানে একটি খরগোশের পেছনে ধাওয়া করলাম। লোকজন তার পেছনে ছুটল এবং তারা ব্যর্থ হয়। এরপর আমি পেছনে ছুটলাম। অবশেষে সেটি ধরে ফেললাম। তারপর আমি এটিকে আবূ ত্বলহার নিকট নিয়ে এলাম। তিনি এটির উভয় রান ও নিতম্ব নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট পাঠালেন। তিনি তা গ্রহণ করেন। (আধুনিক প্রকাশনী- ৫০৮৩, ইসলামিক ফাউন্ডেশন- ৪৯৮০)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 5490,
			"arabicnumber": 5490,
			"text": "আবূ ক্বাতাদাহ (রাঃ) হতে বর্ণিত। তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে ছিলেন। অবশেষে তিনি মক্কার কোন এক রাস্তা পর্যন্ত পৌঁছলে তিনি তাঁর কয়েকজন সঙ্গীসহ পেছনে পড়ে গেলেন। তাঁরা ছিলেন ইহরাম বাঁধা অবস্থায়। আর তিনি ছিলেন ইহরাম বিহীন। তিনি একটি বন্য গাধা দেখতে পেয়ে তার ঘোড়ার উপর উঠলেন। তারপর সাথীদেরকে অনুরোধ করলেন তাঁর হাতে তাঁর চাবুক তুলে দিতে। তাঁরা অস্বীকার করলেন। অবশেষে তিনি নিজেই সেটি তুলে নিলেন এবং গাধাটির পিছনে দ্রুত গতিতে ছুটলেন এবং সেটিকে হত্যা করলেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাহাবীদের কেউ কেউ তা খেলেন, আবার কেউ কেউ তা খেতে অস্বীকার করলেন। পরিশেষে তাঁরা যখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে পৌঁছলেন তখন তাঁরা এ বিষয়ে জিজ্ঞেস করলেন। তিনি বললেনঃ এটি তো এমন খাদ্য যা আল্লাহ তা‘আলা তোমাদের খাওয়ার জন্য দিয়েছেন। [১৮২১] (আধুনিক প্রকাশনী- ৫০৮৪, ইসলামিক ফাউন্ডেশন- ৪৯৮১)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 5491,
			"arabicnumber": 5491,
			"text": "আবূ ক্বাতাদাহ (রাঃ)-এর সূত্রে এরকমই বর্ণিত। তবে এতে আছে যে, তিনি বললেনঃ তোমাদের সঙ্গে কি তার কিছু গোশত আছে? [১৮২১] (আধুনিক প্রকাশনী- ৫০৮৫, ইসলামিক ফাউন্ডেশন- ৪৯৮২)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 5492,
			"arabicnumber": 5492,
			"text": "আবূ ক্বাতাদাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি মক্কা ও মদিনার মধ্যবর্তী সফরে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে ছিলাম। অন্যরা ছিলেন ইহরাম বাঁধা অবস্থায়। আর আমি ছিলাম ইহরাম বিহীন এবং ঘোড়ার উপর সাওয়ার। পর্বত আরোহণে আমি ছিলাম দক্ষ। এমন সময়ে আমি লোকজনকে দেখলাম যে, তারা আগ্রহ নিয়ে কি যেন দেখছে। কাজেই আমিও দেখতে লাগলাম। হঠাৎ দেখি একটি বন্য গাধা। আমি লোকজনকে জিজ্ঞেস করলামঃ এটি কী? তারা উত্তর দিলঃ আমরা জানি না। আমি বললামঃ এটি বন্য গাধা? তারা বললঃ এটি তাই তুমি যা দেখছ। আমি আমার চাবুকের কথা ভুলে গিয়েছিলাম, তাই তাদের বললামঃ আমাকে আমার চাবুকটি তুলে দাও। তারা বললঃ আমরা তোমাকে এ ব্যাপারে সাহায্য করব না। কাজেই আমি নেমে চাবুকটি তুলে নিলাম। তারপর সেটির পেছনে ছুটলাম। অবশেষে আমি সেটিকে ঘায়েল করলাম এবং তাদের কাছে নিয়ে এসে বললামঃ যাও, এটাকে তুলে নিয়ে এসো। তারা বললঃ আমরা ওটিকে স্পর্শ করব না। তখন আমি নিজেই সেটিকে তুলে তাদের কাছে নিয়ে এলাম। তাদের মধ্যে কয়েকজন তা খেতে অসম্মতি প্রকাশ করল। আর কয়েকজন তা খেল। আমি বললামঃ আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট থেকে তোমাদের জন্য এ সম্পর্কে জেনে নেব। এরপর আমি তাঁকে পেলাম এবং এ ঘটনা শুনালাম। তিনি আমাকে বললেনঃ তোমাদের সঙ্গে সেটির অবশিষ্ট কিছু আছে কি? আমি বললামঃ হাঁ। তিনি বললেনঃ খাও। কারণ, এটি তো এমন খাদ্য যা আল্লাহ তোমাদের খাওয়ার জন্য দিয়েছেন। [১৫২১] (আধুনিক প্রকাশনী- ৫০৮৬, ইসলামিক ফাউন্ডেশন- ৪৯৮৩)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 5493,
			"arabicnumber": 5493,
			"text": "وَقَالَ عُمَرُ صَيْدُهُ مَا اصْطِيدَ، وَطَعَامُهُ مَا رَمَى بِهِ، وَقَالَ أَبُو بَكْرٍ الطَّافِي حَلاَلٌ. وَقَالَ ابْنُ عَبَّاسٍ طَعَامُهُ مَيْتَتُهُ إِلاَّ مَا قَذِرْتَ مِنْهَا، وَالْجِرِّيُّ لاَ تَأْكُلُهُ الْيَهُودُ وَنَحْنُ نَأْكُلُهُ. وَقَالَ شُرَيْحٌ صَاحِبُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلُّ شَيْءٍ فِي الْبَحْرِ مَذْبُوحٌ. وَقَالَ عَطَاءٌ أَمَّا الطَّيْرُ فَأَرَى أَنْ يَذْبَحَهُ. وَقَالَ ابْنُ جُرَيْجٍ قُلْتُ لِعَطَاءٍ صَيْدُ الأَنْهَارِ وَقِلاَتِ السَّيْلِ أَصَيْدُ بَحْرٍ هُوَ قَالَ نَعَمْ، ثُمَّ تَلاَ: (هَذَا عَذْبٌ فُرَاتٌ سَائِغٌ شَرَابُهُ وَهَذَا مِلْحٌ أُجَاجٌ وَمِنْ كُلٍّ تَأْكُلُونَ لَحْمًا طَرِيًّا). وَرَكِبَ الْحَسَنُ- عَلَيْهِ السَّلاَمُ- عَلَى سَرْجٍ مِنْ جُلُودِ كِلاَبِ الْمَاءِ. وَقَالَ الشَّعْبِيُّ لَوْ أَنَّ أَهْلِي أَكَلُوا الضَّفَادِعَ لأَطْعَمْتُهُمْ. وَلَمْ يَرَ الْحَسَنُ بِالسُّلَحْفَاةِ بَأْسًا. وَقَالَ ابْنُ عَبَّاسٍ كُلْ مِنْ صَيْدِ الْبَحْرِ مَا صَادَهُ نَصْرَانِيٌّ أَوْ يَهُودِيٌّ أَوْ مَجُوسِيٌّ. وَقَالَ أَبُو الدَّرْدَاءِ فِي الْمُرِي ذَبَحَ الْخَمْرَ النِّينَانُ وَالشَّمْسُ. ‘উমার (রাঃ) বলেছেন, صَيْدُه যা শিকার করা হয়, আর طَعَامُه সমুদ্র যাকে নিক্ষেপ করে। আবূ বাকর (রাঃ) বলেছেনঃ মরে যা ভেসে উঠে তা হালাল। ইবনু ‘আব্বাস (রাঃ) বলেছেনঃ طَعَامُه সমুদ্রে প্রাপ্ত মৃত জানোয়ার খাদ্য, তবে তন্মধ্যে যেটি ঘৃণিত সেটি ব্যতীত। বাইন জাতীয় মাছ ইয়াহূদীরা খায় না, আমরা খাই। আবূ শুরায়হ (রাঃ) যিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাহাবী তিনি বলেছেনঃ সমুদ্রের সব জিনিসই যবাহকৃত বলে গণ্য। ‘আত্বা (রহ.) বলেছেনঃ সমুদ্রের) পাখি সম্পর্কে আমার মত সেটিকে যবহ করতে হবে। ইবনু জুরায়জ (রহ.) বলেন, আমি ‘আত্বা (রহ.)-কে খাল, বিল, নদী-নালা ও জলাশয়ের শিকার সম্পর্কে জিজ্ঞেস করলামঃ এগুলো কি সমুদ্রের শিকারের অন্তর্ভুক্ত? তিনি উত্তর দিলেনঃ হাঁ। তারপর তিনি এ আয়াতটি তিলাওয়াত করেনঃ ‘‘একটি সুমিষ্ট, সুস্বাদু, সুপেয়; অন্যটি লবণাক্ত, বিস্বাদ। তথাপি তোমরা সকল প্রকার পানি) থেকে তাজা গোশত আহার কর।’’ (সূরাহ ফাত্বির ৩৫/১২) হাসান ভোঁদড়ের চাড়মায় নির্মিত ঘোড়ার গদির উপর আরোহণ করেছেন। শা‘বী (রহ.) বলেছেনঃ আমার পরিবারের লোকেরা যদি ব্যাঙ খেত, তাহলে আমি তাদের তা খাওয়াতাম। হাসান (রহ.) কচ্ছপ খাওয়াকে দোষের মনে করতেন না। ইবনু ‘আব্বাস বলেনঃ সমুদ্রের সব ধরনের শিকার খেতে পার, যদিও তা কোন ইয়াহূদী কিংবা খৃস্টান কিংবা অগ্নিপূজক শিকার করে থাকে। আবুদ্ দারদা বলেনঃ মাছ ও সূর্যের তাপ শরাবকে পাক করে। ৫৪৯৩. জাবির (রাঃ) হতে বর্ণিত। তিনি বলেন, আমরা ‘জায়শুল খাবত’ অভিযানে ছিলাম। আমাদের সেনাপতিকরা হয়েছিল আবূ ‘উবাইদাহ (রাঃ)-কে। এক সময় আমরা অত্যধিক ক্ষুধার্ত হয়ে পড়লে, সমুদ্র এমন একটি মৃত মাছ তীরে নিক্ষেপ করল যে, এত বড় মাছ কখনো দেখা যায়নি। এটিকে ‘আম্বর’ বলা হয়। আমরা অর্ধমাস এটি খেলাম। আবূ ‘উবাইদাহ এর একটি হাড় তুলে ধরলেন এবং এর নীচে দিয়ে একজন অশ্বারোহী (অনায়াসে) অতিক্রম করে গেল। [২৪৮৩] (আধুনিক প্রকাশনী- ৫০৮৭, ইসলামিক ফাউন্ডেশন- ৪৯৮৪)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 5494,
			"arabicnumber": 5494,
			"text": "জাবির (রাঃ) হতে বর্ণিত। তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের তিনশ‘ সাওয়ার পাঠালেন- আমাদের সেনাপতি ছিলেন আবূ ‘উবাইদাহ। উদ্দেশ্য ছিল আমরা যেন কুরাইশদের একটি কাফেলার অপেক্ষা করি। তখন আমাদের অত্যন্ত ক্ষিধে পেল। এমন কি আমরা (গাছের পাতা) খেতে আরম্ভ করলাম। ফলে এ বাহিনীর নামকরণ করা হয় ‘‘জায়শুল খাবত’’। তখন সমুদ্র আম্বর নামক একটি মাছ পাড়ে নিক্ষেপ করে। আমরা এটি থেকে অর্ধমাস আহার করলাম। আমরা এর চর্বি তেল রূপে গায়ে মাখতাম। ফলে আমাদের শরীর সতেজ হয়ে উঠে। আবূ ‘উবাইদাহ মাছটির পাঁজরের কাঁটাগুলোর একটি খাড়া করে ধরলেন, তখন একজন অশ্বারোহী তার নীচ দিয়ে অতিক্রম করে গেল। আমাদের মধ্যে কায়স ইবনু না’দ) এক ব্যক্তি ছিলেন, খাদ্যাভাব তখন ভীষণ আকার ধারণ করেছিল। তখন তিনি তিনটি উট যবাহ করেন। তারপর আরো তিনটি যবহ করেন। এরপর আবূ ‘উবাইদাহ (রাঃ) তাঁকে নিষেধ করলেন। [২৪৮৩] (আধুনিক প্রকাশনী- ৫০৮৮, ইসলামিক ফাউন্ডেশন- ৪৯৮৫)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 5495,
			"arabicnumber": 5495,
			"text": "ইবনু আবূ আওফা (রাঃ) হতে বর্ণিত। তিনি বলেনঃ আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে সাতটি কিংবা ছয়টি যুদ্ধে অংশগ্রহণ করি। আমরা তাঁর সঙ্গে ফড়িংও খাই। সুফ্ইয়ান, আবূ আওয়ানা ও ইসরাঈল এরা আবূ ইয়াফূর ইবনু আওফার সূত্রে বর্ণনা করেছেন সাতটি যুদ্ধে। [মুসলিম ৩৪/৮, হাঃ ১৯৫২, আহমাদ ১৯১৩৪] (আধুনিক প্রকাশনী- ৫০৮৯, ইসলামিক ফাউন্ডেশন- ৪৯৮৬)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 5496,
			"arabicnumber": 5496,
			"text": "আবূ সা‘লাবা খুশানী (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এসে বললামঃ হে আল্লাহর রাসূল! আমরা আহলে কিতাবের এলাকায় বাস করি, তাদের পাত্রে খাই এবং আমরা শিকারের এলাকায় বাস করি, তীর-ধনুকের সাহায্যে শিকার করি এবং প্রশিক্ষণপ্রাপ্ত কুকুর ও প্রশিক্ষণবিহীন কুকুরের সাহায্যে শিকার করি। নবী বললেনঃ তুমি যে বললে তোমরা আহলে কিতাবের ভূখন্ডে থাক, অপারগ না হলে তাদের বাসনপত্রে খেও না, যদি কোন উপায় না পাও তাহলে সেগুলো ধুয়ে তাতে খেয়ো। আর তুমি যে বললে, তোমরা শিকারের এলাকায় বাস কর, যদি তোমার তীরের দ্বারা যা শিকার করতে চাও, সেখানে আল্লাহর নাম নাও এবং খাও। আর তুমি যা তোমার প্রশিক্ষণপ্রাপ্ত কুকুরের দ্বারা শিকার কর, সেখানে আল্লাহর নাম নাও এবং খাও। আর তুমি যা শিকার কর তোমার প্রশিক্ষণবিহীন কুকুরের দ্বারা এবং তা যবহ করতে পার তবে তা যবহ্ করে খাও। [৫৪৭৮] (আধুনিক প্রকাশনী- ৫০৯০, ইসলামিক ফাউন্ডেশন- ৪৯৮৭)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 5497,
			"arabicnumber": 5497,
			"text": "সালামাহ ইবনু আকওয়া‘ (রাঃ) হতে বর্ণিত। তিনি বলেন, খাইবার বিজয়ের দিন সন্ধ্যায় মুসলিমগণ আগুন জ্বালালেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জিজ্ঞেস করলেনঃ তোমরা কি জন্য এ সব আগুন জ্বালিয়েছ? তারা বললঃ গৃহপালিত গাধার গোশ্ত। তিনি বললেনঃ হাঁড়ির সব কিছু ফেলে দাও এবং হাঁড়িগুলো ভেঙ্গে ফেল। দলের একজন দাঁড়িয়ে বললঃ হাঁড়ির সব কিছু ফেলে দেই এবং হাঁড়িগুলো ধুয়ে নেই। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তাও করতে পার। [২৪৭৭] (আধুনিক প্রকাশনী- ৫০৯১, ইসলামিক ফাউন্ডেশন- ৪৯৮৮)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 5498,
			"arabicnumber": 5498,
			"text": "قَالَ ابْنُ عَبَّاسٍ مَنْ نَسِيَ فَلاَ بَأْسَ. وَقَالَ اللَّهُ تَعَالَى: (وَلاَ تَأْكُلُوا مِمَّا لَمْ يُذْكَرِ اسْمُ اللَّهِ عَلَيْهِ وَإِنَّهُ لَفِسْقٌ) وَالنَّاسِي لاَ يُسَمَّى فَاسِقًا، وَقَوْلُهُ: (وَإِنَّ الشَّيَاطِينَ لَيُوحُونَ إِلَى أَوْلِيَائِهِمْ لِيُجَادِلُوكُمْ وَإِنْ أَطَعْتُمُوهُمْ إِنَّكُمْ لَمُشْرِكُونَ). ইবনু ‘আব্বাস বলেছেনঃ কেউ বিসমিল্লাহ বলতে ভুলে গেলে তাতে কোন দোষ নেই। আল্লাহ তা‘আলা ইরশাদ করেনঃ ‘‘যাতে (যবহ করার সময়) আল্লাহর নাম নেয়া হয়নি তা তোমরা মোটেই খাবে না, তা হচ্ছে পাপাচার’’- সূরাহ আল-আন‘আম ৬/১২১)। আর যে ব্যক্তি বিসমিল্লাহ বলতে ভুলে যায়, তাকে ফাসিক্ব (গুনাহগার) বলা যায় না। আল্লাহ আরো ইরশাদ করেনঃ শায়ত্বনেরা তাদেরবন্ধুদেরকে তোমাদের সঙ্গে তর্ক-ঝগড়া করার জন্য প্ররোচিত করে..... (সূরাহ আল-আন‘আম ৬/১২১) শেষ পর্যন্ত)। ৫৪৯৮. রাফি‘ ইবনু খাদীজ (রাঃ) হতে বর্ণিত। তিনি বলেনঃ আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সঙ্গে ‘যুল হুলাইফা’য় ছিলাম। লোকজন ক্ষুধার্ত হয়ে যায়। তখন আমরা কিছু সংখ্যক উট ও বকরী গনীমত হিসেবে) লাভ করি। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ছিলেন সকলের পেছনে। সবাই তাড়াতাড়ি করল এবং হাঁড়ি চড়িয়ে দিল। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের কাছে এসে পৌঁছলেন। তখন তিনি হাঁড়িগুলো ঢেকে দিতে নির্দেশ দিলেন। হাঁড়িগুলো ঢেকে দেয়া হল। তারপর তিনি (প্রাপ্ত গানীমাত) বণ্টন করলেন। দশটি বকরী একটি উটের সমান গণ্য করলেন। এ সময়ে একটি উট পালিয়ে গেল। দলে অশ্বারোহীর সংখ্যা ছিল খুব কম। তারা উটটির পেছনে ছুটল কিন্তু তারা সেটি কাবু করতে অসমর্থ হল। অবশেষে একজন উটটির প্রতি তীর ছুঁড়লে আল্লাহ উটটিকে থামিয়ে দিলেন। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ এ সকল চতুষ্পদ প্রাণীর মধ্যে বন্য জন্তুর মত পালিয়ে যাবার স্বভাব আছে। কাজেই যখন কোন প্রাণী তোমাদের থেকে পালিয়ে যায়, তখন তার সঙ্গে তোমরা তেমনই ব্যবহার করবে। বর্ণনাকারী বলেন, আমার দাদা বলেছেন, আমরা আশা করছিলাম কিংবা তিনি বলেছেন, আমরা আশঙ্কা করছিলাম যে, আগামীকাল আমরা শত্রুদের সম্মুখীন হতে পারি। অথচ আমাদের নিকট কোন ছুরি নেই। তাহলে আমরা কি বাঁশের (বাখারী) দিয়ে যবহ করব? নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ যে জিনিস রক্ত প্রবাহিত করে দেয় এবং তাতে বিসমিল্লাহ বলা হয় তা খাও। তবে দাঁত ও নখ দিয়ে নয়। এ সম্পর্কে আমি তোমাদের জ্ঞাত করছি যে, দাঁত হল হাড় বিশেষ, আর নখ হল হাবশী সম্প্রদায়ের ছুরি। (আধুনিক প্রকাশনী- ৫০৯২, ইসলামিক ফাউন্ডেশন- ৪৯৮৯)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 5499,
			"arabicnumber": 5499,
			"text": "‘‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণনা করেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ‘বালদাহ’র নিম্নাঞ্চলে যায়দ ইবনু ‘আমর ইবনু নবীাইলের সঙ্গে সাক্ষাৎ করেন। এটি ছিল রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর উপর অহী অবতীর্ণ হবার পূর্বের ঘটনা। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সামনে দস্তরখান বিছানো হল। তাতে গোশত ছিল। তখন যায়দ ইবনু ‘আমর তা থেকে খেতে অস্বীকার করলেন। তারপর তিনি বললেনঃ তোমরা তোমাদের দেব-দেবীর নামে যা যবহ কর, তা থেকে আমি খাই না। আমি কেবল খাই যা আল্লাহর নামে যবহ করা হয়েছে। (আধুনিক প্রকাশনী- ৫০৯৩, ইসলামিক ফাউন্ডেশন- ৪৯৯০)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 5500,
			"arabicnumber": 5500,
			"text": "জুনদুব ইবনু সুফ্ইয়ান বাজালী (রাঃ) হতে বর্ণিত। তিনি বলেন, একবার আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে কুরবানী পালন করলাম। তখন কতক লোক সালাতের পূর্বেই তাদের কুরবানীর পশুগুলো যবহ্ করে নিয়েছিল। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সালাত থেকে ফিরে যখন দেখলেন, তখন সালাতের পূর্বেই যবহ্ করে ফেলেছে, তখন তিনি বললেনঃ যে ব্যক্তি সালাতের পূর্বে যবহ্ করেছে, সে যেন তার বদলে আরেকটি যবহ্ করে নেয়। আর যে ব্যক্তি আমাদের সালাত আদায় করা পর্যন্ত যবহ্ করেনি, সে যেন এখন আল্লাহর নাম নিয়ে যবহ্ করে। [৯৮৫] (আধুনিক প্রকাশনী- ৫০৯৪, ইসলামিক ফাউন্ডেশন- ৪৯৯১)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 5501,
			"arabicnumber": 5501,
			"text": "ইবনু কা‘ব ইবনু মালিক (রাঃ) হতে বর্ণিত। তিনি ইবনু ‘উমার (রাঃ)-কে জানিয়েছেন যে, তাঁর পিতা (কা‘ব) তাকে বলেছেনঃ তাদের একটি দাসী ‘সালা’ নামক স্থানে বক্রী চরাত। সে দেখতে পেল, পালের একটি বক্রী মারা যাচ্ছে। সে একটি পাথর ভেঙ্গে তা দিয়ে সেটি যবহ্ করল। তখন তিনি কা‘ব) পরিবারের লোকজনকে বললেনঃ আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর কাছে গিয়ে জিজ্ঞেস করে আসার পূর্বে তোমরা তা খেয়ো না। অথবা তিনি বলেছেনঃ আমি তাঁকে জিজ্ঞেস করার জন্য কাউকে পাঠিয়ে জেনে নেয়ার আগে তোমরা তা খেয়ো না। এরপর তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এলেন অথবা তিনি কাউকে তাঁর নিকট পাঠালেন তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সেটি খেতে আদেশ দিলেন। [২৩০৪] (আধুনিক প্রকাশনী- ৫০৯৫, ইসলামিক ফাউন্ডেশন- ৪৯৯২)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 5502,
			"arabicnumber": 5502,
			"text": "‘আবদুল্লাহ (রাঃ) হতে বর্ণিত। তিনি বলেছেন যে, কা‘ব ইবনু মালিকের একটি দাসী বাজারের কাছে অবস্থিত ‘সালা’ নামক ছোট পর্বতের উপর তার বক্রী চরাত। তাত্থেকে একটি বকরী মরার উপক্রম হল। সে এটিকে ধরল এবং পাথর ভেঙ্গে তা দিয়ে সেটিকে যবহ্ করে। তখন লোকজন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট ঘটনাবলী উল্লেখ করলে তিনি তাদের তা খাওয়ার অনুমতি দিলেন। [২৩০৪] (আধুনিক প্রকাশনী- ৫০৯৬, ইসলামিক ফাউন্ডেশন- ৪৯৯৩)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 5503,
			"arabicnumber": 5503,
			"text": "রাফি‘ (রাঃ) হতে বর্ণিত। তিনি বলেনঃ হে আল্লাহর রাসূল! আমাদের কাছে কোন ছুরি নেই। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উত্তর দিলেনঃ যে জিনিস রক্ত প্রবাহিত করে এবং যার উপর আল্লাহরনাম নেয়া হয়, তা খাও। তবে দাঁত ও নখ দিয়ে নয়। নখ হল হাবশীদের ছুরি আর দাঁত হল হাড়। তখন একটি উট পালিয়ে গেল। তীর নিক্ষেপ করে সেটিকে আটকানো হল। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ এ সকল উটের মধ্যে বুনো জানোয়ারের মত পালিয়ে যাবার অভ্যাস আছে। কাজেই তাত্থেকে কোনটি যদি তোমাদের আয়ত্বের বাইরে চলে যায়, তাহলে তার সঙ্গে তেমন ব্যবহার কর। [২৪৮৮] (আধুনিক প্রকাশনী- ৫০৯৭, ইসলামিক ফাউন্ডেশন- ৪৯৯৪)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 5504,
			"arabicnumber": 5504,
			"text": "কা’ব ইবনু মালিক (রাঃ) হতে বর্ণিত যে, এক নারী পাথরের সাহায্যে একটি বক্রী যবহ্ করেছিল। এ ব্যাপারে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে জিজ্ঞেস করা হলে তিনি সেটি খাওয়ার নির্দেশ দেন। লায়স (রহ.) নাফি‘ (রহ.) সূত্রে বলেনঃ তিনি এক আনসারকে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে ‘আবদুল্লাহ সম্পর্কে বলতে শুনেছেন যে, কা‘ব -এর একটি দাসী.......। পরবর্তী অংশ উক্ত হাদীসের মতই। [২৩০৪] (আধুনিক প্রকাশনী- ৫০৯৮, ইসলামিক ফাউন্ডেশন- ৪৯৯৫)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 5505,
			"arabicnumber": 5505,
			"text": "এক আনসারী থেকে তিনি মু‘আয ইবনু সা‘দ কিংবা সা‘দা ইবনু মু‘আয (রাঃ) থেকে বর্ণনা করেন যে, কা‘ব ইবনু মালিক (রাঃ)-এর একটি দাসী ‘সালা’ পর্বতে বকরী চরাত। বকরীগুলোর মধ্যে একটিকে মরার উপক্রম দেখে সে একটি পাথর দ্বারা সেটিকে যবহ্ করল। এ ব্যাপারে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে জিজ্ঞেস করা হল। তিনি বললেনঃ সেটি খাও। (আধুনিক প্রকাশনী- ৫০৯৯, ইসলামিক ফাউন্ডেশন- ৪৯৯৬)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 5506,
			"arabicnumber": 5506,
			"text": "রাফি‘ ইবনু খাদীজ (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ খাও অর্থাৎ যা রক্ত প্রবাহিত করে (তা দিয়ে যবেহ্ করে) তবে দাঁত ও নখ দিয়ে নয়। [২৪৮৮] (আধুনিক প্রকাশনী- ৫১০০, ইসলামিক ফাউন্ডেশন- ৪৯৯৭)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 5507,
			"arabicnumber": 5507,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, একদল লোক নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলল কতক লোক আমাদের নিকট গোশত নিয়ে আসে। আমরা জানি না যে, পশু যবহের সময় বিসমিল্লাহ বলা হয়েছিল কিনা। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমরাই এর উপর বিসমিল্লাহ পড় এবং তা খাও। ‘আয়িশাহ (রাঃ) বলেনঃ প্রশ্নকারী দলটি ছিল কুফর থেকে নতুন ইসলাম গ্রহণকারী। ইমাম বুখারী (রহ.) বলেনঃ দারাওয়ারদী (রহ.) ‘আলী থেকে একই রকম বর্ণনা করেছেন। আবূ খালিদ ও তুফাবী (রহ.) এরকমই বর্ণনা করেছেন। [২০৫৭] (আধুনিক প্রকাশনী- ৫১০১, ইসলামিক ফাউন্ডেশন- ৪৯৯৮)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 5508,
			"arabicnumber": 5508,
			"text": "وَقَوْلِهِ تَعَالَى: (الْيَوْمَ أُحِلَّ لَكُمُ الطَّيِّبَاتُ وَطَعَامُ الَّذِينَ أُوتُوا الْكِتَابَ حِلٌّ لَكُمْ وَطَعَامُكُمْ حِلٌّ لَهُمْ). মহান আল্লাহর ইরশাদঃ আজ তোমাদের জন্য যাবতীয় ভাল ও পবিত্র বস্তু হালাল করা হল আর যাদেরকে কিতাব দেয়া হয়েছে তাদের খাদ্য তোমাদের জন্য হালাল, আর তোমাদের খাদ্য তাদের জন্য হালাল- আল-মায়িদাহ ৫ /৫)। وَقَالَ الزُّهْرِيُّ لاَ بَأْسَ بِذَبِيحَةِ نَصَارَى الْعَرَبِ وَإِنْ سَمِعْتَه“ يُسَمِّي لِغَيْرِ اللهِ فَلاَ تَأْكُلْ وَإِنْ لَمْ تَسْمَعْه“ فَقَدْ أَحَلَّهُ اللهُ لَكَ وَعَلِمَ كُفْرَهُمْ وَيُذْكَرُ عَنْ عَلِيٍّ نَحْوُه“ وَقَالَ الْحَسَنُ وَإِبْرَاهِيمُ لاَ بَأْسَ بِذَبِيحَةِ الأَقْلَفِ وَقَالَ ابْنُ عَبَّاسٍ طَعَامُهُمْ ذَبَائِحُهُمْ. যুহরী (রহ.) বলেছেনঃ আরব অঞ্চলের খৃস্টানদের যবহকৃত পশুতে কোন দোষ নেই। তবে তুমি যদি তাকে গায়রুল্লাহর নাম পড়তে শোন, তাহলে খেয়ো না। আর যদি না শুনে থাক, তাহলে মনে রেখ যে, আল্লাহ তাদের কুফুরীকে জেনে নেয়ার পরেও অনুরূপ বর্ণিত হয়েছে। হাসান ও ইবরাহীম বলেছেনঃ খাত্নাবিহীন লোকের যবাহকৃত পশুতে কোন দোষ নেই।ইবনু ‘আব্বাস বলেছেন, ‘তাদের খাবার’ অর্থ ‘তাদের যবহ্কৃত’। ৫৫০৮. ‘আবদুল্লাহ ইবনু মুগাফফাল (রাঃ) হতে বর্ণিত। তিনি বলেন, আমরা খায়বরের একটি কিল্লা অবরোধ করে রেখেছিলাম। এমন সময়ে এক লোক চর্বি ভর্তি একটি থলে ছুঁড়ে মারল। আমি সেটি উঠিয়ে নেয়ার জন্য ছুটে গেলাম। ঘুরে তাকিয়ে দেখি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম। তাঁকে দেখে আমি লজ্জিত হলাম। [৩১৫৩] (আধুনিক প্রকাশনী- ৫১০২, ইসলামিক ফাউন্ডেশন- ৪৯৯৯)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 5509,
			"arabicnumber": 5509,
			"text": "وَأَجَازَهُ ابْنُ مَسْعُودٍ وَقَالَ ابْنُ عَبَّاسٍ مَا أَعْجَزَكَ مِنَ الْبَهَائِمِ مِمَّا فِي يَدَيْكَ فَهُوَ كَالصَّيْدِ وَفِي بَعِيرٍ تَرَد‘ى فِي بِئْرٍ مِنْ حَيْثُ قَدَرْتَ عَلَيْهِ فَذَكِّه„ وَرَأٰى ذ‘لِكَ عَلِيٌّ وَابْنُ عُمَرَ وَعَائِشَةُ. ইবনু মাস‘ঊদ (রাঃ)-ও এ ফতোয়া দিয়েছেন। ইবনু ‘আব্বাস (রাঃ) বলেছেনঃ তোমার অধীনস্থ যে জন্তু তোমাকে অপারগ করে দেয়, সে শিকারের ন্যায়। যে উট কুয়ার মধ্যে পড়ে যায় তার যে জায়গায় তোমার পক্ষে সম্ভব হয়, আঘাত যবহ্ কর। ‘আলী ইবনু ‘উমার এবং ‘আয়িশাহ (রাঃ) এরও এটাই মত। ৫৫০৯. ‘আমর ইবনু ‘আলী (রহ.) রাফি‘ ইবনু খাদীজ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি বললামঃ হে আল্লাহর রাসূল! আমরা আগামী দিন শত্রুর সম্মুখীন হব, অথচ আমাদের কাছে কোন ছুরি নেই। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তুমি ত্বরান্বিত করবে কিংবা তিনি বলেছেনঃ জলদি (যবহ্) করবে। যা রক্ত প্রবাহিত করে এবং আল্লাহর নাম নেয়া হয়, তা খাও। তবে দাঁত ও নখ দ্বারা নয়। তোমাকে বলছিঃ দাঁত হল হাড় আর নখ হল হাবশীদের ছুরি। আমরা কিছু উট ও বকরী গনীমত হিসাবে পেলাম। সেগুলো থেকে একটি উট পালিয়ে যায়। একজন সেটির উপর তীর নিক্ষেপ করলে আল্লাহ উটটি আটকিয়ে দেন। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ এ সব গৃহপালিত উটের মধ্য বন্যপশুর স্বভাব আছে। কাজেই তা থেকে কোনটি যদি তোমদের নিয়ন্ত্রণের বাইরে চলে যায়, তা হলে তার সঙ্গে এরকমই ব্যবহার করবে। [২৪৮৮] (আধুনিক প্রকাশনী- ৫১০৩, ইসলামিক ফাউন্ডেশন- ৫০০১)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 5510,
			"arabicnumber": 5510,
			"text": "وَقَالَ ابْنُ جُرَيْجٍ عَنْ عَطَاءٍ لاَ ذَبْحَ وَلاَ مَنْحَرَ إِلاَّ فِي الْمَذْبَحِ وَالْمَنْحَرِ. قُلْتُ أَيَجْزِي مَا يُذْبَحُ أَنْ أَنْحَرَهُ قَالَ نَعَمْ، ذَكَرَ اللَّهُ ذَبْحَ الْبَقَرَةِ، فَإِنْ ذَبَحْتَ شَيْئًا يُنْحَرُ جَازَ، وَالنَّحْرُ أَحَبُّ إِلَيَّ، وَالذَّبْحُ قَطْعُ الأَوْدَاجِ. قُلْتُ فَيُخَلِّفُ الأَوْدَاجَ حَتَّى يَقْطَعَ النِّخَاعَ قَالَ لاَ إِخَالُ. وَأَخْبَرَنِي نَافِعٌ أَنَّ ابْنَ عُمَرَ نَهَى عَنِ النَّخْعِ يَقُولُ يَقْطَعُ مَا دُونَ الْعَظْمِ، ثُمَّ يَدَعُ حَتَّى تَمُوتَ. وَقَوْلُ اللَّهِ تَعَالَى: (وَإِذْ قَالَ مُوسَى لِقَوْمِهِ إِنَّ اللَّهَ يَأْمُرُكُمْ أَنْ تَذْبَحُوا بَقَرَةً) وَقَالَ: (فَذَبَحُوهَا وَمَا كَادُوا يَفْعَلُونَ). وَقَالَ سَعِيدٌ عَنِ ابْنِ عَبَّاسٍ الذَّكَاةُ فِي الْحَلْقِ وَاللَّبَّةِ. وَقَالَ ابْنُ عُمَرَ وَابْنُ عَبَّاسٍ وَأَنَسٌ إِذَا قَطَعَ الرَّأْسَ فَلاَ بَأْسَ. ‘আত্বা (রহ.) এর উদ্ধৃতি দিয়ে ইবনু জুরাইজ বলেছেনঃ গলা বা সিনা ব্যতীত যবহ্ কিংবা নহর করা যায় না। [‘আত্বা (রহ.) বলেন] আমি বললামঃ যে জন্তুকে যবহ্ করা হয় সেটিকে আমি যদি নহর করি, তাহলে যথেষ্ট হবে কি? তিনি বললেনঃ হাঁ। কেননা, আল্লাহ তা‘আলা গরুকে যবহ্ করার কথা উল্লেখ করেছেন। কাজেই যে জন্তুকে নহর করা হয়, তা যদি তুমি যবহ্ কর, তবে তা জায়িয। অবশ্য আমার নিকট নহর করাই অধিক পছন্দনীয়। যবহ্ অর্থ হল রগগুলোকে কেটে দেয়া। আমি বললামঃ তাহলে কিছু রগকে অবশিষ্ট রাখতে হবে যেন হাতের ভিতরের সাদা রগ কাটা না যায়। তিনি বললেনঃ আমি তা মনে করি না। তিনি বললেনঃ নাফি‘ রহ) আমাকে জানিয়েছেন, ইবনু ‘উমার ‘নাখ’ থেকে নিষেধ করেছেন। তিনি বলেনঃ ‘নাখ’ হল হাড়ের ভিতরের সাদা রগ কেটে দেয়া এবং তারপর ছেড়ে দেয়া, যাতে জন্তুটি মারা যায়। আল্লাহ তা‘আলা ইরশাদ করেনঃ ‘‘স্মরণ কর, যখন মূসা ‘আ.) স্বীয় সম্প্রদায়কে বলেছিল, ‘আল্লাহ তোমাদেরকে একটি গরু যবহ করার আদেশ দিচ্ছেন’....... তারা তাকে যবহ করল যদিও তাদের জন্য সেটা প্রায় অসম্ভব ছিল।’’- সূরাহ আল-বাকারাহ ২/৬৭-৭১)। সা‘ঈদ (রহ.) ইবনু ‘আব্বাস থেকে বর্ণনা করেনঃ গলা ও সিনার মধ্যে যবহ্ করাকে যবহ্ বলে। ইবনু ‘উমার ইবনু ‘আব্বাস ও আনাস বলেনঃ যদি মাথা কেটে ফেলে তাতে দোষ নেই। ৫৫১০. আসমা বিনত আবূ বাকর হতে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর আমলে আমরা একটি ঘোড়া নহর করে সেটি খেয়েছি। [৫৫১১, ৫৫১২, ৫৫১৯; মুসলিম ৩৪/৬, হাঃ ১৯৪২, আহমাদ ২৬৯৮৫] (আধুনিক প্রকাশনী- ৫১০৪, ইসলামিক ফাউন্ডেশন- ৫০০১)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 5511,
			"arabicnumber": 5511,
			"text": "আসমা (রাঃ) হতে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর আমলে আমরা একটি ঘোড়া যবহ্ করেছি। তখন আমরা মদিনায় থাকতাম। পরে আমরা সেটি খেয়েছি। [৫৫১০] (আধুনিক প্রকাশনী- ৫১০৫, ইসলামিক ফাউন্ডেশন- ৫০০২)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 5512,
			"arabicnumber": 5512,
			"text": "আসমা বিনত আবূ বাকর (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর ‘আমলে আমরা একটি ঘোড়া নহর করেছি। এরপর তা খেয়েছি। ‘নহর’ কথাটির বর্ণনা এ সঙ্গে হিশামের সূত্র দিয়ে ওয়াকী‘ ও ইবনু ‘উয়াইনাহ এ রকমই বর্ণনা করেছেন। [৫৫১০; মুসলিম ৩৪/৬, হাঃ ১৯৪২, আহমাদ ২৬৯৮৫] (আধুনিক প্রকাশনী- ৫১০৬, ইসলামিক ফাউন্ডেশন- ৫০০৩)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 5513,
			"arabicnumber": 5513,
			"text": "হিশাম ইবনু যায়দ (রহঃ) হতে বর্ণিত। তিনি বলেনঃ আমি আনাস-এর সঙ্গে হাকাম ইবনু আইয়ূবের কাছে গেলাম। তখন আনাস (রাঃ) দেখলেন, কয়েকটি বালক কিংবা বর্ণনাকারী বলেছেন, কয়েকজন তরুণ একটি মুরগী বেঁধে তার দিকে তীর ছুঁড়ছে। আনাস (রাঃ) বললেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জীবজন্তুকে বেঁধে এভাবে তীর ছুঁড়তে নিষেধ করেছেন। [মুসলিম ৩৪/১২, হাঃ ১৯৫৬, আহমাদ ১২১৬২] (আধুনিক প্রকাশনী- ৫১০৭, ইসলামিক ফাউন্ডেশন- ৫০০৪)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 5514,
			"arabicnumber": 5514,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত যে, তিনি ইয়াহ্ইয়া ইবনু সাঈদের কাছে গিয়েছিলেন। এ সময় ইয়াহ্ইয়া পরিবারের একটি বালক একটি মুরগীকে বেঁধে তার দিকে তীর ছুঁড়ছিল। ইবনু ‘উমার(রাঃ) মুরগীটির দিকে এগিয়ে গিয়ে সেটি মুক্ত করে দিলেন। তারপর মুরগী ও বালকটিকে সঙ্গে নিয়ে এগিয়ে গিয়ে বললেন, হত্যার উদ্দেশে এভাবে বেঁধে পাখি মারতে তোমরা তোমাদের বালকদের বাধা দিও। কেননা, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে শুনেছিঃ তিনি হত্যার উদ্দেশে জন্তু জানোয়ার বেঁধে তীর নিক্ষেপ করতে নিষেধ করেছেন। [মুসলিম ৩৪/১২, হাঃ ১৯৫৭, ১৯৫৮] (আধুনিক প্রকাশনী- ৫১০৮, ইসলামিক ফাউন্ডেশন- ৫০০৫)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 5515,
			"arabicnumber": 5515,
			"text": "সা‘ঈদ ইবনু যুবায়র (রহ.) হতে বর্ণিত। তিনি বললেনঃ আমি ইবনু ‘উমার -এর কাছে ছিলাম। এরপর আমরা একদল তরুণ কিংবা তিনি বলেছেন, একদল মানুষের কাছ দিয়ে যাবার সময় দেখলাম, তারা একটি মুরগী বেঁধে তার দিকে তীর ছুঁড়ছে। তারা যখন ইবনু ‘উমার -কে দেখতে পেল, তখন তারা তা থেকে বিচ্ছিন্ন হয়ে গেল। ইবনু ‘উমার বললেনঃ এ কাজ কে করেছে? এ কাজ যে করে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর উপর অভিশাপ দিয়েছেন। শু‘বাহ (রহ.) থেকে সুলাইমান এ রকমই বর্ণনা করেছেন। মিনহাল ইবনু ‘উমার -এর সূত্রে বলেন, যে ব্যক্তি জীব-জন্তুর অঙ্গহানি করে তাকে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম লা‘নাত করেছেন। আধুনিক প্রকাশনী- ৫১০৯, ইসলামিক ফাউন্ডেশন- ৫০০৬",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 5516,
			"arabicnumber": 5516,
			"text": "‘আবদুল্লাহ ইবনু ইয়াযীদ (রহঃ)-এর সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত আছে যে, তিনি লুটতরাজ ও অঙ্গহানি করতে নিষেধ করেছেন। [২৪৭৪] (আধুনিক প্রকাশনী- ৫১১০, ইসলামিক ফাউন্ডেশন- ৫০০৭)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 5517,
			"arabicnumber": 5517,
			"text": "আবূ মূসা আশ’আরী (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে মুরগীর গোশত খেতে দেখেছি। (আধুনিক প্রকাশনী- ৫১১১, ইসলামিক ফাউন্ডেশন- ৫০০৮)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 5518,
			"arabicnumber": 5518,
			"text": "আবূ মা’মার (রহ.) ..... যাহদাম (রহ.) হতে বর্ণিত। তিনি বলেন, আমরা আবূ মূসা আশ‘আরী (রাঃ) এর কাছে ছিলাম। জারমের এ গোত্র ও আমাদের মাঝে ভ্রাতৃত্ব ছিল। আমাদের কাছে খাদ্য আনা হল। তাতে ছিল মোরগের গোশ্ত। দলের মধ্যে লাল রংয়ের এক ব্যক্তি বসা ছিল। সে খাবারের কাছে গেল না। আবূ মূসা আশ‘আরী তখন বললেনঃ এগিয়ে এসো, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে মোরগের গোশত খেতে দেখেছি। সে বললঃ আমি এটিকে এমন কিছু খেতে দেখেছি, যে কারণে তা খেতে আমি অপছন্দ করি। তখন আমি কসম করেছি যে, আমি তা খাব না। তিনি বললেনঃ এগিয়ে এসো, আমি তোমাকে জানাব, কিংবা তিনিবললেন, আমি তোমাদের কাছে হাদীস বর্ণনা করব। আমি আশ‘আরীদের একদলসহ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এলাম। এরপর আমি তাঁর সামনে এসে হাজির হই যখন তিনি ছিলেন ক্রোধান্বিত। তখন তিনি বণ্টন করছিলেন সদাকাহর কিছু জানোয়ার। আমরা তাঁর কাছে সাওয়ারী চাইলাম। তখন তিনি কসম করে বললেনঃ আমাদের কোন সাওয়ারী দেবেন না এবং বললেনঃ তোমাদেরকে সাওয়ারীর জন্য দিতে পারি এমন কোন পশু আমার কাছে নেই। তারপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট গনীমতের কিছু উট আনা হল। তিনি বললেনঃ আশ‘আরীগণ কোথায়? আশ‘আরীগণ কোথায়? আবূ মূসা আশ‘আরী বলেনঃ এরপর তিনি আমাদের সাদা চূড়ওয়ালা বলিষ্ঠ পাঁচটি উট দিলেন। আমরা কিছু দূরে গিয়ে অবস্থান করলাম। তখন আমি আমার সাথীদের বললামঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর কসমের কথা ভুলে গিয়েছিলেন। আল্লাহর কসম! যদি আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে তাঁর কসমের ব্যাপারে গাফিল রাখি, তাহলে আমরা কোন দিন সফলকাম হব না। তাই আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে ফিরে গেলাম। তাঁকে বললামঃ হে আল্লাহর রাসূল! আমরা আপনার নিকট সাওয়ারী চেয়েছিলাম, তখন আপনি আমাদের সাওয়ারী দেবেন না বলে শপথ করেছিলেন। আমাদের মনে হয়, আপনি আপনার শপথের কথা ভুলে গেছেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আল্লাহ নিজেই তো আমাদের সাওয়ারীর জানোয়ার দিয়েছেন। আল্লাহর কসম, আমি যখন কোন বিষয়ে শপথ করি, এরপর শপথের বিপরীত কাজ অধিক কল্যাণকর মনে করি, তখন আমি কল্যাণকর কাজটিই করি এবং কাফফারা দিয়ে হালাল হয়ে যাই। [৩১৩৩] (আধুনিক প্রকাশনী- ৫১১২, ইসলামিক ফাউন্ডেশন- ৫০০৮)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 5519,
			"arabicnumber": 5519,
			"text": "আসমা (রাঃ) হতে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর যুগে আমরা একটি ঘোড়া নহর করলাম এবং সেটি খেলাম। [৫৫১০] (আধুনিক প্রকাশনী- ৫১১৩, ইসলামিক ফাউন্ডেশন- ৫০০৯)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 5520,
			"arabicnumber": 5520,
			"text": "জাবির ইবনু ‘আবদুল্লাহ (রাঃ) হতে বর্ণিত। তিনি বলেনঃ খাইবারের দিনে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম গাধার গোশত খেতে নিষেধ করেছেন। আর ঘোড়ার গোশতের ব্যাপারে তিনি অনুমতি প্রদান করেছেন। [৪২১৯] (আধুনিক প্রকাশনী- ৫১১৪, ইসলামিক ফাউন্ডেশন- ৫০১০)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 5521,
			"arabicnumber": 5521,
			"text": "فِيهِ عَنْ سَلَمَةَ عَنْ النَّبِيِّ صلى الله عليه وسلم. এ ব্যাপারে সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে সালামাহ (রাঃ) বর্ণিত হাদীস আছে। ৫৫২১. ইবনু ‘উমার (রাঃ) হতে বর্ণিত যে, খাইবারের দিন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম গৃহপালিত গাধার গোশত খেতে নিষেধ করেছেন। [৮৫৩] (আধুনিক প্রকাশনী- ৫১১৫, ইসলামিক ফাউন্ডেশন- ৫০১১)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 5522,
			"arabicnumber": 5522,
			"text": "‘আবদুল্লাহ (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম গৃহপালিত গাধার গোশত খেতে নিষেধ করেছেন। ইবনু মুবারক, উবাইদুল্লাহ (রহ.) সূত্রে নাফি‘ থেকে এ রকমই বর্ণনা করেছেন। ‘উবাইদুল্লাহ সালিম সূত্রে আবূ উসামাহ (রহ.) এ রকমই বর্ণনা করেছেন। [৮৫৩] (আধুনিক প্রকাশনী- ৫১১৬, ইসলামিক ফাউন্ডেশন- ৫০১২)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 5523,
			"arabicnumber": 5523,
			"text": "‘আলী (রাঃ) হতে বর্ণিত। তিনি বলেন, খাইবারের বছর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মুত্‘আ (স্বল্পকালীন বিয়ে) থেকে এবং গৃহপালিত গাধার গোশত খেতে নিষেধ করেছেন। [৪২১৬] (আধুনিক প্রকাশনী- ৫১১৭, ইসলামিক ফাউন্ডেশন- ৫০১৩)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 5524,
			"arabicnumber": 5524,
			"text": "জাবির ইবনু ‘আবদুল্লাহ (রাঃ) হতে বর্ণিত। তিনি বলেনঃ খাইবারের দিন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম গাধার গোশত খেতে নিষেধ করেছেন। তবে ঘোড়ার গোশত খেতে অনুমতি প্রদান করেছেন। [৪২১৯] (আধুনিক প্রকাশনী- ৫১১৮, ইসলামিক ফাউন্ডেশন- ৫০১৪)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 5526,
			"arabicnumber": 5526,
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 5527,
			"arabicnumber": 5527,
			"text": "আবূ সা‘লাবা (রাঃ) হতে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম গৃহপালিত গাধার গোশত খাওয়া হারাম করেছেন। ইবনু শিহাব (রহ.) থেকে যুবাইদী ও উকাইল এ রকমই বর্ণনা করেছেন। যুহরীর বরাত দিয়ে মালিক, মা‘মার, মাজিশুন, ইউনুস ও ইবনু ইসহাক বলেছেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দাঁতওয়ালা যাবতীয় হিংস্র জন্তু খেতে নিষেধ করেছেন। [মুসলিম ৩৪/৫, হাঃ ১৯৩২, আহমাদ] (আধুনিক প্রকাশনী- ৫১২০, ইসলামিক ফাউন্ডেশন- ৫০১৬)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 5528,
			"arabicnumber": 5528,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এক আগন্তুক এসে বললঃ গাধাগুলো খেয়ে ফেলা হচ্ছে। তারপর আরেক আগন্তুক এসে বললঃ গাধাগুলো খেয়ে ফেলা হচ্ছে। তারপর আরেক আগন্তুক এসে বললঃ গাধাগুলোকে শেষ করা হচ্ছে। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঘোষণাকারীকে ঘোষণার আদেশ দিলেন। সে লোকজনের মধ্যে ঘোষণা দিলঃ আল্লাহ ও তাঁর রাসূল তোমাদেরকে গৃহপালিত গাধার গোশ্ত খেতে নিষেধ করেছেন। কেননা, এগুলো ঘৃণ্য। তখন ডেকচিগুলো উল্টে ফেলা হল, আর তাতে গোশ্ত টগবগ করে ফুটছিল। [৩৭১] আধুনিক প্রকাশনী- , ইসলামিক ফাউন্ডেশন- ৫০১৭",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 5529,
			"arabicnumber": 5529,
			"text": "‘আমর (রহ.) হতে বর্ণিত যে, আমি জাবির ইবনু যায়দকে জিজ্ঞেস করলামঃ লোকে ধারণা করে যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম গৃহপালিত গাধার গোশত খেতে নিষেধ করেছেন। তিনি বললেনঃ হাকাম ইবনু আমর গিফারীও বসরায় আমাদের কাছে এ কথা বলতেন। কিন্তু জ্ঞান সমৃদ্ধ ইবনু ‘আব্বাস তা অস্বীকার করেছেন। তারপর তিনি এ আয়াতটি তিলাওয়াত করেছেনঃ বল, আমার প্রতি যে ওয়াহী করা হয়েছে তাতে মানুষ যা আহার করে তার কিছুই নিষিদ্ধ পাই না।’’ (সূরাহ আল-আন‘আম ৬/১৪৫)। [১৪৫] (আধুনিক প্রকাশনী- ৫১২১, ইসলামিক ফাউন্ডেশন- ৫০১৮)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 5530,
			"arabicnumber": 5530,
			"text": "আবূ সা‘লাবা (রাঃ) হতে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দাঁতওয়ালা যাবতীয় হিংস্র জন্তু খেতে নিষেধ করেছেন। যুহরী থেকে ইউনুস, মা’মার ইবনু উয়াইনা ও মাজিশূন এ রকমই বর্ণনা করেছেন। [৫৭৮০, ৫৭৮১] (আধুনিক প্রকাশনী- ৫১২৩, ইসলামিক ফাউন্ডেশন- ৫০১৯)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 5531,
			"arabicnumber": 5531,
			"text": "‘আবদুল্লাহ ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একটি মৃত ছাগলের পাশ দিয়ে যাচ্ছিলেন। তখন তিনি বললেনঃ তোমরা এটির চামড়া থেকে কেন উপকার গ্রহণ করছ না? লোকজন উত্তর করলঃ এটি মৃত। তিনি বললেনঃ শুধু তার খাওয়াকে হারাম করা হয়েছে। [১৪৯২] (আধুনিক প্রকাশনী- ৫১২৪, ইসলামিক ফাউন্ডেশন- ৫০২০)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 5532,
			"arabicnumber": 5532,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেনঃ একবার নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একটি মৃত ছাগলের পাশ দিয়ে যাচ্ছিলেন। তখন তিনি বললেনঃ এটির মালিকদের কী হল, তারা যদি এটির চামড়া থেকে উপকার গ্রহণ করত! [১৪৯২] (আধুনিক প্রকাশনী- ৫১২৫, ইসলামিক ফাউন্ডেশন- ৫০২১)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 5533,
			"arabicnumber": 5533,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন আঘাতপ্রাপ্ত লোক যে আল্লাহর পথে আঘাত পায়, সে কিয়ামতের দিন এ অবস্থায় আসবে যে, তার ক্ষতস্থান থেকে টকটকে লাল রক্ত ঝরছে আর তার সুগন্ধি হবে কস্তুরীর সুগন্ধির ন্যায়। [২৩৭] (আধুনিক প্রকাশনী- ৫১২৬, ইসলামিক ফাউন্ডেশন- ৫০২২)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 5534,
			"arabicnumber": 5534,
			"text": "আবূ মূসা (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ সৎসঙ্গী ও অসৎ সঙ্গীর দৃষ্টান্ত হল, কস্তুরীওয়ালা ও কামারের হাপরের ন্যায়। কস্তুরীওয়ালা হয়ত তোমাকে কিছু দান করবে কিংবা তার নিকট হতে তুমি কিছু খরিদ করবে কিংবা তার নিকট হতে তুমি সুবাস পাবে। আর কামারের হাপর হয়ত তোমার কাপড় পুড়িয়ে দেবে কিংবা তুমি তার নিকট হতে পাবে দুর্গন্ধ। [২১০১; মুসলিম ৪৫/৪৫, হাঃ ২৬২৮] (আধুনিক প্রকাশনী- ৫১২৭, ইসলামিক ফাউন্ডেশন- ৫০২৩)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 5535,
			"arabicnumber": 5535,
			"text": "আনাস (রাঃ) হতে বর্ণিত। তিনি বলেনঃ আমরা ‘মাররুয্ যাহরান’-এ একটি খরগোশকে ধাওয়া করলাম। তখন লোকেরাও এর পেছনে ছুটল এবং তারা ক্লান্ত হয়ে পড়ল। এরপর আমি সেটিকে ধরে ফেললাম এবং আবূ ত্বলহার নিকট নিয়ে এলাম। তিনি এটিকে যবহ্ করলেন এবং তার পিছনের অংশ কিংবা তিনি বলেছেনঃ দু’ রান নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে পাঠিয়ে দিলেন এবং তিনি তা গ্রহণ করলেন। (আধুনিক প্রকাশনী- ৫১২৮, ইসলামিক ফাউন্ডেশন- ৫০২৪)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 5536,
			"arabicnumber": 5536,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ দব্ব আমি খাই না, আর হারামও বলি না। (আধুনিক প্রকাশনী- ৫১২৯, ইসলামিক ফাউন্ডেশন- ৫০২৫)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 5537,
			"arabicnumber": 5537,
			"text": "খালিদ ইবনু ওয়ালীদ (রাঃ) হতে বর্ণিত। তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে মাইমূনাহ (রাঃ)-এর সঙ্গে গেলেন। সেখানে ভুনা করা দব্ব পরিবেশন করা হল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সে দিকে হাত বাড়ালেন। এ সময় এক মহিলা বললঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে জানিয়ে দাও, তিনি কী জিনিস খেতে যাচ্ছেন। তখন তাঁরা বললেনঃ হে আল্লাহর রাসূল! এটি দব্ব। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম শুনে হাত তুলে নিলেন। খালিদ(রাঃ) বলেন, আমি বললামঃ হে আল্লাহর রাসূল! এটি কি হারাম। তিনি বললেনঃ না, হারাম নয়। তবে আমাদের এলাকায় এটি নেই। তাই আমি একে অপছন্দ করি। খালিদ(রাঃ) বলেনঃ এরপর আমি তা আমার দিকে এনে খেতে লাগলাম। আর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকিয়ে তাকিয়ে দেখছিলেন। [৫৩৯১; মুসলিম ৩৪/৭, হাঃ ১৯৪৩] (আধুনিক প্রকাশনী- ৫১৩০, ইসলামিক ফাউন্ডেশন- ৫০২৬)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 5538,
			"arabicnumber": 5538,
			"text": "মাইমূনাহ (রাঃ) হতে বর্ণিত। একটি ইঁদুর ঘিয়ের মধ্যে পড়ে মরে গিয়েছিল। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এ সম্পর্কে জিজ্ঞেস করা হলে তিনি বললেনঃ ইঁদুরটি এবং তার আশে-পাশের অংশ ফেলে দাও। তারপর তা খাও। সুফ্ইয়ান (রহ.)-এর কাছে জিজ্ঞেস করা হয় যে, মা’মার এ হাদীসটি যুহরী, সা‘ঈদ ইবনু মুসাইয়্যাব, আবূ হুরাইরাহ -এর সনদে বর্ণনা করেন। তিনি বললেনঃ আমি যুহরী (রহ.)-কে বলতে শুনেছি যে, তিনি ‘উবাইদুল্লাহ, ইবনু ‘আব্বাস, মাইমূনাহ  সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণনা করছেন। তিনি আরো বলেন যে, আমি যুহরী থেকে উক্ত সনদে এ হাদীসটি কয়েকবার শুনেছি। [২৩৫] (আধুনিক প্রকাশনী- ৫১৩১, ইসলামিক ফাউন্ডেশন- ৫০২৭)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 5539,
			"arabicnumber": 5539,
			"text": "যুহরী (রহ.)-থেকে জিজ্ঞেস করা হয় জমাট কিংবা তরল তেল বা ঘিয়ের মধ্যে ইঁদুর ইত্যাদি জীব পড়ে মারা গেলে তার কী নির্দেশ? তিনি বললেনঃ আমাদের কাছে উবাইদুল্লাহ ইবনু ‘আবদুল্লাহ সূত্রে হাদীস পৌঁছেছে যে, ঘিয়ের মধ্যে পড়ে একটি ইঁদুর মারা গিয়েছিল, সেটি সম্পর্কে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আদেশ দিয়েছিলেন, ইঁদুর ও এর নিকটবর্তী অংশ ফেলে দিতে, এরপর তা ফেলে দেয়া হয় এবং খাওয়া হয়। [২৩৫] (আধুনিক প্রকাশনী- ৫১৩২, ইসলামিক ফাউন্ডেশন- ৫০২৮)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 5540,
			"arabicnumber": 5540,
			"text": "মাইমূনাহ (রাঃ) হতে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে জিজ্ঞেস করা হয়েছিল এমন একটি ইঁদুর সম্পর্কে যা ঘিয়ের মধ্যে পড়েছিল। তখন তিনি বলেছিলেনঃ ওটি এবং তার আশ-পাশের অংশ ফেলে দাও, তারপর খাও। [২৩৫] (আধুনিক প্রকাশনী- ৫১৩৩, ইসলামিক ফাউন্ডেশন- ৫০২৯)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 5541,
			"arabicnumber": 5541,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত যে, তিনি জানোয়ারের মুখে চিহ্ন লাগানোকে অপছন্দ করতেন। ইবনু ‘উমার (রাঃ) আরো বলেছেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জানোয়ারের মুখে মারতে নিষেধ করেছেন। আনকাযী (রহ.) হানযালী সূত্রে কুতাইবাহ (রহ.) এরকমই বর্ণনা করেন। তিনি বলনঃ تُضْرَبُ الصُّورَةُ অর্থাৎ চেহারায় মারতে নিষেধ করেছেন। (আধুনিক প্রকাশনী- ৫১৩৪, ইসলামিক ফাউন্ডেশন- ৫০৩০)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 5542,
			"arabicnumber": 5542,
			"text": "আনাস (রাঃ) হতে বর্ণিত। তিনি বলেনঃ আমি আমার এক ভাইকে নিয়ে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট গেলাম, যেন তিনি তাকে তাহনীক করেন অর্থাৎ খেজুর বা অন্য কিছু একবার চিবিয়ে তার মুখে দিয়ে দেন। এ সময়ে তিনি তাঁর উট বাঁধার জায়গায় ছিলেন। তখন আমি তাঁকে দেখলাম তিনি একটি বক্রীর গায়ে চিহ্ন লাগাচ্ছেন। বর্ণনাকারী বলেন, আমার মনে হয় তিনি (হিশাম) বলেছেনঃ ‘বকরীর কানে চিহ্ন লাগাচ্ছেন’। [১৫০২] (আধুনিক প্রকাশনী- ৫১৩৫, ইসলামিক ফাউন্ডেশন- ৫০৩১)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 5543,
			"arabicnumber": 5543,
			"text": "لحَدِيثِ رَافِعٍ عَنْ النَّبِيِّ صلى الله عليه وسلم وَقَالَ طَاوُسٌ وَعِكْرِمَةُ فِي ذَبِيحَةِ السَّارِقِ اطْرَحُوهُ. চোরের যবাহকৃত পশুর ব্যাপারে তাউস ও ‘ইকরিমাহ (রহ.) বলেছেন, তা ফেলে দাও। ৫৫৪৩. রাফি‘ ইবনু খাদীজ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বললাম। আগামী দিন আমরা শত্রুর সম্মুখীন হব অথচ আমাদের সঙ্গে কোন ছুরি নেই। তিনি বললেনঃ সতর্ক দৃষ্টি রাখ কিংবা তিনি বলেছেন, জলদি কর। যে জিনিস রক্ত প্রবাহিত করে এবং যাতে আল্লাহর নাম নেয়া হয়, সেটি খাও। যতক্ষণ না সেটি দাঁত কিংবা নখ হয়। এ ব্যাপারে তোমাদের জানাচ্ছি, দাঁত হল হাড়, আর নখ হল হাবশীদের ছুরি। দলের দ্রুতগতি লোকেরা আগে বেড়ে গেল এবং গনীমতের মালামাল লাভ করল। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ছিলেন লোকজনের পেছনে। তারা ডেকচি চড়িয়ে দিল। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এসে তা উল্টে দেয়ার আদেশ দিলেন, তারপর সেগুলো উল্টে দেয়া হল। এরপর তিনি তাদের মধ্যে মালে গনীমত বণ্টন করলেন এবং দশটি বক্রীকে একটি উটের সমান গণ্য করলেন। দলের অগ্রভাগের নিকট হতে একটি উট ছুটে গিয়েছিল। অথচ তাদের সঙ্গে কোন অশ্বারোহী ছিল না। এ অবস্থায় এক ব্যক্তি উটটির দিকে তীর ছুঁড়লে আল্লাহ উটটিকে থামিয়ে দিলেন। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ এ সকল চতুষ্পদ জীবের মধ্যে বন্য পশুর স্বভাব আছে। কাজেই, এগুলোর কোনটি যদি এমন করে, তাহলে তার সঙ্গে এরকমই ব্যবহার করবে। [২৪৮৮] (আধুনিক প্রকাশনী- ৫১৩৬, ইসলামিক ফাউন্ডেশন- ৫০৩২)",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 5544,
			"arabicnumber": 5544,
			"text": "রাফী‘ ইবনু খাদীজ (রাঃ) হতে বর্ণিত। তিনি বলেন, এক সফরে আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে ছিলাম। তখন উটগুলোর মধ্য থেকে একটি উট পালিয়ে যায়। তিনি বলেন, তখন এক ব্যক্তি সেটির দিকে তীর ছুঁড়লে আল্লাহ সেটিকে থামিয়ে দেন। তিনি বলেন, এরপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ এ সব পশুর মধ্যে বন্য পশুর স্বভাব আছে। সুতরাং তার মধ্যে কোনটি তোমাদের উপর বেয়াড়া হয়ে উঠলে তার সঙ্গে সেরকমই ব্যবহার কর। তিনিবলেন, আমি বললামঃ হে আল্লাহর রাসূল! আমরা অনেক সময় যুদ্ধ অভিযানে বা সফরে থাকি, যবহ্ করতে ইচ্ছা করি কিন্তু ছুরি থাকে না। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আঘাত করো এমন বস্ত্ত দিয়ে যা রক্ত ঝরায় অথবা তিনি বলেছেনঃ এমন বস্ত্ত দিয়ে যা রক্ত ঝরায় এবং যার উপরে আল্লাহর নাম নেয়া হয়েছে সেটি খাও, তবে দাঁত ও নখ বাদে। কারণ দাঁত হল হাড়, আর নখ হল হাবশীদের ছুরি। আধুনিক প্রকাশনী- ৫১৩৭, ইসলামিক ফাউন্ডেশন- ৫০৩৩) 72/38. بَاب إِذَا أَكَلَ الْمُضْطَرُّ ৭২/৩৮. অধ্যায়ঃ নিরুপায় ব্যক্তির খাওয়া। لِقَوْلِ اللهِ تَعَالٰى :لِقَوْلِهِ تَعَالَى: (يَا أَيُّهَا الَّذِينَ آمَنُوا كُلُوا مِنْ طَيِّبَاتِ مَا رَزَقْنَاكُمْ وَاشْكُرُوا لِلَّهِ إِنْ كُنْتُمْ إِيَّاهُ تَعْبُدُونَ إِنَّمَا حَرَّمَ عَلَيْكُمُ الْمَيْتَةَ وَالدَّمَ وَلَحْمَ الْخِنْزِيرِ وَمَا أُهِلَّ بِهِ لِغَيْرِ اللَّهِ فَمَنِ اضْطُرَّ غَيْرَ بَاغٍ وَلاَ عَادٍ فَلاَ إِثْمَ عَلَيْهِ)، وَقَالَ: (فَمَنِ اضْطُرَّ فِي مَخْمَصَةٍ غَيْرَ مُتَجَانِفٍ لإِثْمٍ) وَقَوْلُهُ: (فَكُلُوا مِمَّا ذُكِرَ اسْمُ اللَّهِ عَلَيْهِ إِنْ كُنْتُمْ بِآيَاتِهِ مُؤْمِنِينَ وَمَا لَكُمْ أَنْ لاَ تَأْكُلُوا مِمَّا ذُكِرَ اسْمُ اللَّهِ عَلَيْهِ وَقَدْ فُصِّلَ لَكُمْ مَا حُرِّمَ عَلَيْكُمْ إِلاَّ مَا اضْطُرِرْتُمْ إِلَيْهِ وَإِنَّ كَثِيرًا لَيُضِلُّونَ بِأَهْوَائِهِمْ بِغَيْرِ عِلْمٍ إِنَّ رَبَّكَ هُوَ أَعْلَمُ بِالْمُعْتَدِينَ)، (قُلْ لاَ أَجِدُ فِيمَا أُوحِيَ إِلَيَّ مُحَرَّمًا عَلَى طَاعِمٍ يَطْعَمُهُ إِلاَّ أَنْ يَكُونَ مَيْتَةً أَوْ دَمًا مَسْفُوحًا أَوْ لَحْمَ خِنْزِيرٍ فَإِنَّهُ رِجْسٌ أَوْ فِسْقًا أُهِلَّ لِغَيْرِ اللَّهِ بِهِ فَمَنِ اضْطُرَّ غَيْرَ بَاغٍ وَلاَ عَادٍ فَإِنَّ رَبَّكَ غَفُورٌ رَحِيمٌ). وَقَالَ: (فَكُلُوا مِمَّا رَزَقَكُمُ اللَّهُ حَلاَلاً طَيِّبًا وَاشْكُرُوا نِعْمَةَ اللَّهِ إِنْ كُنْتُمْ إِيَّاهُ تَعْبُدُونَ إِنَّمَا حَرَّمَ عَلَيْكُمُ الْمَيْتَةَ وَالدَّمَ وَلَحْمَ الْخِنْزِيرِ وَمَا أُهِلَّ لِغَيْرِ اللَّهِ بِهِ فَمَنِ اضْطُرَّ غَيْرَ بَاغٍ وَلاَ عَادٍ فَإِنَّ اللَّهَ غَفُورٌ رَحِيمٌ). আল্লাহ তা‘আলার বাণীঃ হে মু’মিনগণ! আমার দেয়া পবিত্র বস্তুগুলো খেতে থাক এবং আল্লাহর উদ্দেশে শোকর করতে থাক, যদি তোমরা তাঁরই উপাসক হও-নিশ্চয় আল্লাহ তোমাদের প্রতি হারাম করেছেন মৃত-জীব, রক্ত এবং শূকরের গোশত এবং সেই দ্রব্য যার প্রতি আল্লাহ ছাড়া অন্যের নাম নেয়া হয়েছে, কিন্তু যে ব্যক্তি বাধ্য হয়ে বিদ্রোহী না হয়ে এবং সীমা অতিক্রম না করে তা গ্রহণ করবে, তার কোন গুনাহ নেই- (সূরাহ আল-বাকারাহ ২/১৭২-১৭৩)। আল্লাহ আরো বলেনঃ তবে কেউ পাপ করার প্রবণতা ব্যতীত ক্ষুধার জ্বালায় নিষিদ্ধ বস্তু খেতে) বাধ্য হলে....... (সূরাহ আল-মায়িদাহ ৫/৩)। আল্লাহ আরো বলেন ঃ কাজেই যার উপর আল্লাহর নাম নেয়া হয়েছে তা তোমরা খাও যদি তাঁর নিদর্শনাবলীতে তোমরা বিশ্বাসী হয়ে থাক- তোমাদের কী হয়েছে যে, যাতে আল্লাহর নাম নেয়া হয়েছে তা তোমরা খাবে না? তোমাদের জন্য যা হারাম করা হয়েছে তা তোমাদের জন্য বিশদভাবে বাতলে দেয়া হয়েছে, তবে যদি তোমরা নিরুপায় হও (তবে ততটুকু নিষিদ্ধ বস্তু খেতে পার যাতে প্রাণে বাঁচতে পার), কিন্তু অনেক লোকই অজ্ঞানতাবশতঃ তাদের খেয়াল খুশী দ্বারা অবশ্যই (অন্যদেরকে) পথভ্রষ্ট করে, তোমার প্রতিপালক সীমালঙ্ঘনকারীদের সম্পর্কে সবচেয়ে বেশি অবগত- (সূরাহ আল-আন‘আম ৬/১১৮-১১৯)। আল্লাহ আরো বলেনঃ বল, আমার প্রতি যে ওয়াহী করা হয়েছে তাতে মানুষ যা আহার করে তার কিছুই নিষিদ্ধ পাই না মৃত, প্রবহমান রক্ত ও শূকরের গোশত ছাড়া। কারণ তা অপবিত্র অথবা আল্লাহ ছাড়া অন্যের নামে যবহ করার ফাসিকী কাজ। কিন্তু কেউ অবাধ্য না হয়ে বা সীমালঙ্ঘন না করে নিরুপায় হলে তোমার প্রতিপালক তো বড়ই ক্ষমাশীল, পরম দয়ালু। (সূরাহ আল-আন‘আম ৬/১৪৫) আল্লাহ আরো বলেনঃ কাজেই আল্লাহ তোমাদেরকে যে সকল বৈধ পবিত্র রিযক দিয়েছেন তা তোমরা খাও আর আল্লাহর অনুগ্রহের শুকরিয়া আদায় কর যদি তোমরা প্রকৃতই তাঁর বন্দেগী করতে ইচ্ছুক হও। আল্লাহ তোমাদের জন্য হারাম করেছেন মৃত জীব, রক্ত, শূকরের গোশত আর যা যবেহ করার সময় আল্লাহ ছাড়া অন্যের নাম নেয়া হয়েছে। কিন্তু কেউ ইচ্ছাকৃতভাবে অবাধ্য না হয়ে ও সীমালঙ্ঘন না করে নিতান্ত নিরুপায় হয়ে এসব খেতে বাধ্য) হলে আল্লাহ তো বড়ই ক্ষমাশীল, বড়ই দয়ালু। সূরাহ নাহল ১৬/১১৪-১১৫",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 69
			}
		}
	]
}