{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"79": "Asking Permission"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6227,
			"arabicnumber": 6227,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আল্লাহ তা‘আলা আদম (আ.)-কে তাঁর যথাযোগ্য গঠনে সৃষ্টি করেছেন, তাঁর উচ্চতা ছিল ষাট হাত। তিনি তাঁকে সৃষ্টি করে বললেনঃ তুমি যাও। উপবিষ্ট ফেরেশতাদের এই দলকে সালাম করো এবং তুমি মনোযোগ সহকারে শোনবে তারা তোমার সালামের কী জবাব দেয়? কারণ এটাই হবে তোমার ও তোমার বংশধরের সম্ভাষণ (তাহিয়্যা)। তাই তিনি গিয়ে বললেনঃ ‘আসসালামু ‘আলাইকুম’। তাঁরা জবাবে বললেনঃ ‘আসসালামু ‘আলাইকা ওয়া রহমাতুল্লাহ’। তাঁরা বাড়িয়ে বললেনঃ ‘ওয়া রহমাতুল্লাহ’ বাক্যটি। তারপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আরও বললেনঃ যারা জান্নাতে প্রবেশ করবে তারা আদম (আঃ)-এর আকৃতি বিশিষ্ট হবে। তারপর থেকে এ পর্যন্ত মানুষের আকৃতি ক্রমশঃ কমে আসছে। [৩৩২৬] (আধুনিক প্রকাশনী- ৫৭৮৬, ইসলামিক ফাউন্ডেশন- ৫৬৮১)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6228,
			"arabicnumber": 6228,
			"text": "(সা‘ঈদ ইবনু ‘আবুল হাসান হাসান-কে বললেনঃ অনারব মহিলারা তাদের মস্তক ও বক্ষ খোলা রাখে। তিনি বললেনঃ তোমার চোখ ফিরিয়ে রেখো। আল্লাহ তা‘আলার বাণীঃ ‘‘মু’মিনদের বল তাদের দৃষ্টি অবনমিত করতে আর তাদের লজ্জাস্থান সংরক্ষণ করতে, এটাই তাদের জন্য বেশি পবিত্র, তারা যা কিছু করে সে সম্পর্কে আল্লাহ খুব ভালভাবেই অবগত।’’সূরাহ আন্-নূর ২৪/৩০) ক্বাতাদাহ বলেন, অর্থাৎ যারা তাদের জন্য হালাল নয়, তাদের থেকে। আর ঈমানদার নারীদেরকে বলে দাও তাদের দৃষ্টি অবনমিত করতে আর তাদের লজ্জাস্থান সংরক্ষণ করতে।’’ (সূরাহ আন্-নূর ২৪/৩১) আর আল্লাহর বাণীঃ ‘‘অর্থাৎ খিয়ানাতকারী চোখ।’’ সূরাহ গাফির ৪০:১৯) অর্থাৎ নিষিদ্ধ স্থানের দিকে তাকানো সম্পর্কে। আর ঋতুমতী হয়নি, এমন মেয়েদের দিকে তাকানো সম্পর্কে। ইমাম যুহরী (রহ.) বলেন, অপ্রাপ্ত বয়স্কা হলেও এসব মেয়েদের এমন কিছু অঙ্গ-প্রত্যঙ্গের দিকে তাকানো নাজায়িয, যা দেখলে লোভ জন্মিতে পারে। ‘আত্বা ইবনু রাবাহ (রহ.) ঐসব কুমারীদের দিকে তাকানোও মাকরূহ বলতেন, যাদের মক্কার বাজারে বিক্রির জন্য আনা হতো। তবে কেনার উদ্দেশে হলে তা ভিন্ন ব্যাপার। ৬২২৮. ‘আবদুল্লাহ ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, একবার কুরবানীর দিনে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফাযল ইবনু ‘আব্বাস (রাঃ)-কে আপন সওয়ারীর পিঠে নিজের পেছনে বসালেন। ফাযল একজন সুপুরুষ ছিলেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম লোকেদের মাসআলা মাসায়িল বলে দেয়ার জন্য আসলেন। এ সময় খাশ‘আম গোত্রের এক সুন্দরী নারী রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট একটা মাসআলা জিজ্ঞেস করার জন্য আসল। তখন ফাযল তার দিকে তাকাতে লাগলেন। মহিলাটির সৌন্দর্য তাঁকে আকৃষ্ট করল। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফাযল এর দিকে ফিরে দেখলেন যে, ফাযল তার দিকে তাকাচ্ছেন। তিনি নিজের হাত পেছনের দিকে নিয়ে ফাযল এর চিবুক ধরে ঐ নারীর দিকে না তাকানোর জন্য তার মুখ অন্যদিকে ঘুরিয়ে দিলেন।[1] এরপর স্ত্রীলোকটি জিজ্ঞেস করলঃ হে আল্লাহর রাসূল! আল্লাহ তা‘আলার পক্ষ থেকে তাঁর বান্দাদের উপর যে হাজ্জ ফরজ হবার বিধান দেয়া হয়েছে, আমার পিতার উপর তা এমন অবস্থায় এসেছে যে, বৃদ্ধ হবার কারণে সওয়ারীর উপর বসতে তিনি অক্ষম। যদি আমি তার পক্ষ থেকে হাজ্জ আদায় করে নেই, তবে কি তার পক্ষ থেকে তা আদায় হয়ে যাবে? তিনি বললেনঃ হাঁ। [১৫১৩] (আধুনিক প্রকাশনী- ৫৭৮৭, ইসলামিক ফাউন্ডেশন- ৫৬৮২)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6229,
			"arabicnumber": 6229,
			"text": "আবূ সা‘ঈদ খুদরী (রাঃ) হতে বর্ণিত যে, একবার নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমরা রাস্তায় বসা থেকে বিরত থাকো। তারা বললঃ হে আল্লাহর রাসূল! আমাদের রাস্তায় বসা ব্যতীত গত্যন্তর নেই, আমরা সেখানে কথাবার্তা বলি। তখন তিনি বললেন, যদি তোমাদের রাস্তায় মজলিস করা ব্যতীত উপায় না থাকে, তবে তোমরা রাস্তার হক আদায় করবে। তারা বলল, হে আল্লাহর রাসূল! রাস্তার হক কী? তিনি বললেন, তা হলো চক্ষু অবনত রাখা, কাউকে কষ্ট দেয়া থেকে বিরত থাকা। সালামের জবাব দেয়া এবং সৎকাজের নির্দেশ দেয়া আর অসৎকাজ থেকে নিষেধ করা। [২৪৬৫] (আধুনিক প্রকাশনী- ৫৭৮৮, ইসলামিক ফাউন্ডেশন- ৫৬৮৩)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6230,
			"arabicnumber": 6230,
			"text": "(আল্লাহ তা‘আলার বাণীঃ ‘‘যখন তোমাদেরকে সসম্মানে সালাম প্রদান করা হয়, তখন তোমরা তার চেয়ে উত্তমরূপে জওয়াবী সালাম দাও কিংবা কমপক্ষে) অনুরূপভাবে দাও।’’ (সূরা আন-নিসা ৪ : ৮৬) ৬২৩০. ‘আবদুল্লাহ (রাঃ) হতে বর্ণিত। তিনি বলেনঃ যখন আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে সালাত আদায় করছিলাম, তখন আমরা আল্লাহর প্রতি তাঁর বান্দাদের পক্ষ থেকে সালাম, জিবরীল (আ.)-এর প্রতি সালাম, মীকাঈল (আ.)-এর প্রতি সালাম এবং অমুকের প্রতি সালাম দিলাম। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সালাত শেষ করে, আমাদের দিকে তাঁর চেহারা ফিরিয়ে বললেনঃ আল্লাহ তা‘আলা নিজেই ‘সালাম’। অতএব যখন তোমাদের কেউ সালাতের মধ্যে বসবে, তখন বলবেঃ মুসল্লী যখন এ কথাটা বলবে, তখনই আসমান যমীনে সব নেক বান্দাদের নিকট এ সালাম পৌঁছে যাবে। তারপর বলবে তারপর সে তার পছন্দমত দু‘আ বেছে নেবে। [৮৩১] (আধুনিক প্রকাশনী- ৫৭৮৯, ইসলামিক ফাউন্ডেশন- ৫৬৮৪)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6231,
			"arabicnumber": 6231,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ বয়োকনিষ্ঠ বয়োজ্যেষ্ঠকে, পদচারী উপবিষ্টকে এবং অল্প সংখ্যক অধিক সংখ্যককে সালাম দিবে। [৬২৩২, ৬২৩৩, ৬২৩৪; মুসলিম ৩৯/১, হাঃ ২১৬০, হাঃ ১০৬২৯] (আধুনিক প্রকাশনী- ৫৭৯০, ইসলামিক ফাউন্ডেশন- ৫৬৮৫)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6232,
			"arabicnumber": 6232,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6233,
			"arabicnumber": 6233,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6234,
			"arabicnumber": 6234,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ বয়োকনিষ্ঠ বয়োজ্যেষ্ঠকে, পদচারী উপবিষ্টকে এবং অল্প সংখ্যক অধিক সংখ্যককে সালাম দিবে। [৬২৩১] (আধুনিক প্রকাশনী- অনুচ্ছেদ, ইসলামিক ফাউন্ডেশন- অনুচ্ছেদ)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6235,
			"arabicnumber": 6235,
			"text": "বারাআ ইবনু ‘আযিব (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের নির্দেশ দিয়েছেন সাতটি কাজেরঃ রোগীর খোঁজ-খবর নেয়া, জানাযার সঙ্গে যাওয়া, হাঁচি দাতার জন্য দু‘আ করা, দুর্বলকে সাহায্য করা, মাযলূমের সাহায্য করা, সালাম প্রসার করা এবং কসমকারীর কসম পূর্ণ করা। আর নিষেধ করেছেন (সাতটি কাজ থেকে) রূপার পাত্রে পানাহার, স্বর্ণের আংটি পরিধান, রেশমী যিনের উপর সাওয়ার হওয়া, মিহিন রেশমী বস্ত্র পরিধান, পাতলা রেশম বস্ত্র ব্যবহার, রেশম মিশ্রিত কাতান বস্ত্র পরিধান এবং গাঢ় রেশমী বস্ত্র পরিধান করা। [১২৩৯] (আধুনিক প্রকাশনী- ৫৭৯৩, ইসলামিক ফাউন্ডেশন- ৫৬৮৮)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6236,
			"arabicnumber": 6236,
			"text": "‘আবদুল্লাহ ইবনু ‘আমর (রাঃ) হতে বর্ণিত। এক লোক নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে জিজ্ঞেস করলঃ ইসলামের কোন কাজ উত্তম? তিনি বললেনঃ তুমি ক্ষুধার্তকে অন্ন দেবে, আর সালাম দিবে যাকে তুমি চেন আর যাকে চেন না। [১২] (আধুনিক প্রকাশনী- ৫৭৯৪, ইসলামিক ফাউন্ডেশন- ৫৬৮৯)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6237,
			"arabicnumber": 6237,
			"text": "আবূ আইউব (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন মুসলিমের পক্ষে তার কোন ভাইয়ের সাথে তিন দিনের অধিক এমনভাবে সম্পর্কচ্ছেদ করে থাকা বৈধ নয় যে, তাদের দু’জনের দেখা সাক্ষাৎ হলেও একজন এদিকে, আরেকজন অন্যদিকে চেহারা ঘুরিয়ে নেয়। তাদের মধ্যে উত্তম ঐ ব্যক্তি যে প্রথম সালাম করবে। আবূ সুফ্ইয়ান বলেন যে, এ হাদীসটি আমি যুহরী (রহ.) থেকে তিনবার শুনেছি। [৬০৭৭] (আধুনিক প্রকাশনী- , ইসলামিক ফাউন্ডেশন- ৫৬৯০)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6238,
			"arabicnumber": 6238,
			"text": "আনাস ইবনু মালিক (রাঃ) বর্ণনা করেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন মদিনায় আসলেন, তখন তাঁর (বর্ণনাকারীর) বয়স ছিল দশ বছর। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর জীবনের দশটি বছর আমি তাঁর খিদমত করি। আর পর্দার বিধান ব্যাপারে আমি সব চেয়ে অধিক অবগত ছিলাম, যখন তা অবতীর্ণ হয়। উবাই ইবনু কা‘ব (রাঃ) প্রায়ই আমাকে এ সম্পর্কে জিজ্ঞেস করতেন। যাইনাব বিনত জাহশ (রাঃ) এর সঙ্গে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর বাসরের দিনে প্রথম পর্দার আয়াত অবতীর্ণ হয়। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নতুন দুলহা হিসেবে সে দিন লোকেদের দা‘ওয়াত করেন এবং এরপর অনেকেই দা‘ওয়াত খেয়ে বেরিয়ে যান। কিন্তু কয়েকজন তাঁর কাছে রয়ে যান এবং তাদের অবস্থান দীর্ঘায়িত করেন। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উঠে দাঁড়িয়ে ঘর থেকে বেরিয়ে যান এবং আমিও তাঁর সঙ্গে যাই, যাতে তারা বের হয়ে যায়। তারপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম চলেন এবং আমিও তাঁর সঙ্গে চলি। এমনকি তিনি ‘আয়িশাহ (রাঃ) এর ঘরের দরজায় এসে পৌঁছেন। এরপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ভাবলেন যে, নিশ্চয়ই তারা বেরিয়ে গেছে। তখন তিনি ফিরে আসেন আর তাঁর সঙ্গে আমিও ফিরে আসি। তিনি যাইনাব (রাঃ) এর ঘরে প্রবেশ করে দেখেন যে, তারা তখনও বসেই আছে, চলে যায়নি। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফিরে গেলেন এবং আমিও তাঁর সঙ্গে ফিরে গেলাম। এমনকি তিনি ‘আয়িশাহ (রাঃ) এর দরজার চৌকাঠ পর্যন্ত এসে পৌঁছেন। এরপর তিনি ভাবলেন যে, এখন তারা অবশ্যই বেরিয়ে গেছে। তাই তিনি ফিরে এসে দেখেন যে, তারা বেরিয়ে গেছে। এ সময় পর্দার আয়াত অবতীর্ণ হয় এবং তিনি তাঁর ও আমার মধ্যে পর্দা টেনে দেন। [৪৭৯১] (আধুনিক প্রকাশনী- ৫৭৯৬, ইসলামিক ফাউন্ডেশন- ৫৬৯১)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6239,
			"arabicnumber": 6239,
			"text": "আনাস (রাঃ) হতে বর্ণিত। তিনি বলেন, যখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যাইনাব (রাঃ)-কে বিয়ে করলেন, তখন একদল (মেহমান) তাঁর ঘরে এসে খাওয়া-দাওয়া করলেন। এরপর তাঁরা ঘরে বসেই আলাপ-আলোচনা করতে লাগলেন। তিনি দাঁড়ালে কিছু লোক উঠে বেরিয়ে গেলেন। কিন্তু অবশিষ্ট কিছু লোক বসেই থাকলেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঘরে প্রবেশ করার জন্য ফিরে এসে দেখলেন যে, তারা বসেই আছেন। কিছুক্ষণ পরে তারা উঠে চলে গেলেন। তারপর আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে ওদের চলে যাবার খবর দিলে তিনি এসে প্রবেশ করলেন। তখন আমি ভেতরে যাওয়ার ইচ্ছে করলে তিনি আমার ও তাঁর মাঝখানে পর্দা ঝুলিয়ে দিলেন। এ সময় আল্লাহ তা‘আলা এ আয়াত অবতীর্ণ করেনঃ ‘‘হে ঈমানদারগণ! তোমরা নবীর ঘরগুলোতে প্রবেশ করো না।’’ ...... শেষ পর্যন্ত। (সূরাহ আল-আহযাবঃ ৫৩) [৪৭৯১] (আধুনিক প্রকাশনী- ৫৭৯৭, ইসলামিক ফাউন্ডেশন- ৫৬৯২)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6240,
			"arabicnumber": 6240,
			"text": "নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর স্ত্রী ‘আয়িশাহ হতে বর্ণিত যে, ‘উমার ইবনু খাত্তাব নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট প্রায়ই বলতেন যে, আপনি আপনার স্ত্রীদের পর্দা করান। কিন্তু তিনি তা করেননি। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর স্ত্রীগণ প্রাকৃতিক প্রয়োজনে রাতে মাঠের দিকে বাইরে যেতেন। একবার সাওদাহ বিন্ত যাম‘আহ বেরিয়ে গেলেন। তিনি ছিলেন দীর্ঘাঙ্গী মহিলা। ‘উমার মজলিসে উপস্থিত ছিলেন। তাই তিনি পর্দার নির্দেশ অবতীর্ণ হবার আগ্রহে বললেনঃ ওহে সাওদাহ! আমি আপনাকে চিনে ফেলেছি। তখন আল্লাহ তা‘আলা পর্দার আয়াত নাযিল করলেন। [১৪৬] আধুনিক প্রকাশনী- ৫৭৯৮, ইসলামিক ফাউন্ডেশন- ৫৬৯৩",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6241,
			"arabicnumber": 6241,
			"text": "সাহল ইবনু সা‘দ (রাঃ) হতে বর্ণিত। তিনি বলেনঃ একবার এক লোক নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কোন এক হুজরায় উঁকি দিয়ে তাকালো। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে একটা ‘মিদরা’ ছিল, যা দিয়ে তিনি তাঁর মাথা চুলকাচ্ছিলেন। তখন তিনি বললেনঃ যদি আমি জানতাম যে, তুমি উঁকি দিবে, তবে এ দিয়ে তোমার চোখ ফুঁড়ে দিতাম। তাকানোর জন্য অনুমতি গ্রহণের বিধান দেয়া হয়েছে। [৫৯২৪] (আধুনিক প্রকাশনী- ৫৭৯৯, ইসলামিক ফাউন্ডেশন- ৫৬৯৪)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 6242,
			"arabicnumber": 6242,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত যে, একবার জনৈক লোক নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর এক কক্ষে উঁকি দিল। তখন তিনি একটা তীর ফলক কিংবা তীর ফলকসমূহ নিয়ে তার দিকে দৌড়ালেন। আনাস (রাঃ) বলেনঃ তা যেন আমি এখনও দেখছি। তিনি ঐ লোকটির চোখ ফুঁড়ে দেয়ার জন্য তাকে খুঁজছিলেন। [৬৮৮৯, ৬৯০০; মুসলিম ৩৮/৯, হাঃ ২১৫৭, আহমাদ ১৩৫০৭] (আধুনিক প্রকাশনী- ৫৮৮০, ইসলামিক ফাউন্ডেশন- ৫৬৯৫)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 6243,
			"arabicnumber": 6243,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ নিশ্চয়ই আল্লাহ তা‘আলা বানী আদমের জন্য যিনার একটা অংশ নির্ধারিত রেখেছেন। সে তাতে অবশ্যই জড়িত হবে। চোখের যিনা হলো দেখা, জিহবার যিনা হলো কথা বলা, কুপ্রবৃত্তি কামনা ও খাহেশ সৃষ্টি করা এবং যৌনাঙ্গ তা সত্য অথবা মিথ্যা প্রমাণ করে।[1] [মুসলিম ৪৬/৫, হাঃ ২৬৫৭, আহমাদ ৮২২২] (আধুনিক প্রকাশনী- ৫৮০১, ইসলামিক ফাউন্ডেশন- ৫৬৯৬)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 6244,
			"arabicnumber": 6244,
			"text": "আনাস (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন সালাম করতেন, তখন তিনবার সালাম দিতেন এবং যখন কথা বলতেন তখন তিনবার তার পুনরাবৃত্তি করতেন। [৯৪] (আধুনিক প্রকাশনী- ৫৮০২, ইসলামিক ফাউন্ডেশন- ৫৬৯৭)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 6245,
			"arabicnumber": 6245,
			"text": "আবূ সা‘ঈদ খুদরী (রাঃ) হতে বর্ণিত। তিনি বলেন, একবার আমি আনসারদের এক মজলিসে উপস্থিত ছিলাম। এমন সময় হঠাৎ আবূ মূসা ভীত সন্ত্রস্ত হয়ে এসে বললেনঃ আমি তিনবার ‘উমার (রাঃ) এর নিকট অনুমতি চাইলাম, কিন্তু আমাকে অনুমতি দেয়া হলো না। তাই আমি ফিরে এলাম। ‘উমার (রাঃ) তাঁকে জিজ্ঞেস করলেনঃ তোমাকে ভেতরে প্রবেশ করতে কিসে বাধা দিল? আমি বললামঃ আমি প্রবেশের জন্য তিনবার অনুমতি চাইলাম, কিন্তু আমাকে অনুমতি দেয়া হলো না। তাই আমি ফিরে এলাম। (কারণ) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যদি তোমাদের কেউ তিনবার প্রবেশের অনুমতি চায়। কিন্তু তাতে অনুমতি দেয়া না হয় তবে সে যেন ফিরে যায়। তখন ‘উমার (রাঃ) বললেনঃ আল্লাহর কসম! তোমাকে এ কথার উপর অবশ্যই প্রমাণ প্রতিষ্ঠিত করতে হবে। তিনি সবাইকে জিজ্ঞেস করলেনঃ তোমাদের মাঝে কেউ আছে কি যিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে এ হাদীস শুনেছে? তখন উবাই ইবনু কা‘ব (রাঃ) বললেনঃ আল্লাহর কসম! আপনার কাছে প্রমাণ দিতে দলের সর্বকনিষ্ঠ ব্যক্তিই উঠে দাঁড়াবে। আর আমি দলের সর্বকনিষ্ঠ ছিলাম। সুতরাং আমি তাঁর সঙ্গে উঠে দাঁড়িয়ে বললামঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অবশ্যই এ কথা বলেছেন। [২০৬২; মুসলিম ৩৮/৭, হাঃ ২১৫৩, আহমাদ ১৯৬৩০] (আধুনিক প্রকাশনী- ৫৮০৩, ইসলামিক ফাউন্ডেশন- ৫৬৯৮) ইবনু মুবারাক বলেন, আবূ সা‘ঈদ (রাঃ) হতে ভিন্ন একটি সূত্রেও অনূরূপ একটি হাদীস বর্ণিত হয়েছে।",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 6246,
			"arabicnumber": 6246,
			"text": "قَالَ سَعِيدٌ عَنْ قَتَادَةَ عَنْ أَبِي رَافِعٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صلى الله عليه وسلم قَالَ هُوَ إِذْنُهُ. আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ এ ডাকাই তার জন্য অনুমতি। ৬২৪৬. আবূ হুরাইরাহ হতে বর্ণিত। তিনি বলেনঃ একদিন আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে তাঁর ঘরে প্রবেশ করলাম। তিনি ঘরে গিয়ে একটি পেয়ালায় দুধ পেলেন। তিনি আমাকে বললেনঃ হে আবূ হির! তুমি আহলে সুফফার নিকট গিয়ে তাদের আমার নিকট ডেকে আন। তখন আমি তাদের কাছে গিয়ে দা’ওয়াত দিয়ে এলাম। তারপর তারা এসে প্রবেশের অনুমতি চাইলে তাদের অনুমতি দেয়া হলো। তারপর তারা প্রবেশ করল। [৫৩৭৫] (আধুনিক প্রকাশনী- ৫৮০৪, ইসলামিক ফাউন্ডেশন- ৫৬৯৯)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 6247,
			"arabicnumber": 6247,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত যে, একবার তিনি একদল শিশুর পার্শ্ব দিয়ে অতিক্রম করা কালে তিনি তাদের সালাম করে বললেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-ও তা করতেন। [মুসলিম ৩৯/৫, হাঃ ২১৬৮] (আধুনিক প্রকাশনী- ৫৮০৫, ইসলামিক ফাউন্ডেশন- ৫৭০০)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 6248,
			"arabicnumber": 6248,
			"text": "সাহল ইবনু সা‘দ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমরা জুমু‘আহর দিনে খুশি হতাম। রাবী বলেন, আমি তাঁকে বললামঃ কেন? তিনি বললেনঃ আমাদের একজন বৃদ্ধা মহিলা ছিল। সে কোন লোককে ‘বুদাআ’ নামক খেজুর বাগানে পাঠিয়ে বীট চিনির শিকড় আনতো। তা একটি হাঁড়িতে দিয়ে সে তাতে কিছুটা যবের দানা দিয়ে ঘুঁটে এক রকম খাবার তৈরী করত। এরপর আমরা যখন জুমু‘আহর সালাত আদায় করে ফিরতাম, তখন আমরা ঐ মহিলাকে সালাম দিতাম। তখন সে আমাদের ঐ খাবার পরিবেশন করত। আমরা এজন্য খুশী হতাম। আমাদের নিয়ম ছিল যে, আমরা জুমু‘আহর পরেই মধ্যাহ্ন ভোজন ও মধ্যাহ্ন বিশ্রাম করতাম। [৯৩৮] (আধুনিক প্রকাশনী- ৫৮০৬, ইসলামিক ফাউন্ডেশন- ৫৭০১)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 6249,
			"arabicnumber": 6249,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, একদিন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ হে ‘আয়িশাহ! ইনি জিবরীল (‘আ.) তোমাকে সালাম দিচ্ছেন। তখন আমিও বললামঃ ওয়া আলাইহিস্ সালাম ওয়া রহমাতুল্লাহ। তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর উদ্দেশে বললেনঃ আমরা যা দেখছি না, তা আপনি দেখছেন। ইউনুস ও নু‘মান যুহরী সূত্রে বলেন এবং ‘বারাকাতুহু’-ও বলেছেন। (আধুনিক প্রকাশনী- ৫৮০৭, ইসলামিক ফাউন্ডেশন- ৫৭০২)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 6250,
			"arabicnumber": 6250,
			"text": "জাবির (রাঃ) বলেন, আমার পিতার কিছু ঋণ ছিল। এ সম্পর্কে আলোচনা করার জন্য আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এলাম এবং দরজায় আঘাত করলাম। তিনি জিজ্ঞেস করলেনঃ কে? আমি বললামঃ আমি। তখন তিনি বললেনঃ আমি আমি, যেন তিনি তা অপছন্দ করলেন। [২১২৭; মুসলিম ৩৮/৮, হাঃ ২১৫৫] (আধুনিক প্রকাশনী- ৫৮০৮, ইসলামিক ফাউন্ডেশন- ৫৭০৩)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 6251,
			"arabicnumber": 6251,
			"text": "وَقَالَتْ عَائِشَةُ وَعَلَيْهِ السَّلاَمُ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ. وَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «رَدَّ الْمَلاَئِكَةُ عَلَى آدَمَ السَّلاَمُ عَلَيْكَ وَرَحْمَةُ اللَّهِ». জিবরীল (আঃ)-এর সালামের উত্তরে ‘আয়িশাহ (রাঃ) ‘ওয়া আলাইহিস্ সালাম ওয়া রহমাতুল্লাহ ওয়া বারাকাতুহু’ বলেছেন। আর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আদম (‘আ.)-এর সালামের জবাবে ফেরেশতা বলেনঃ ‘আসসালামু ‘আলাইকা ওয়া রহমাতুল্লাহ’। ৬২৫১. আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। এক ব্যক্তি মসজিদে প্রবেশ করল। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মসজিদের একপার্শ্বে উপবিষ্ট ছিলেন। সে সালাত আদায় করে এসে তাঁকে সালাম করল। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ ওয়া আলাইকাস সালাম; তুমি ফিরে যাও এবং সালাত আদায় কর। কারণ তুমি সালাত আদায় করনি। সে ফিরে গিয়ে সালাত আদায় করে এসে আবার সালাম করল। তিনি বললেনঃ ওয়া আলাইকাস্ সালাম; তুমি ফিরে যাও এবং সালাত আদায় কর। কারণ তুমি সালাত আদায় করনি। সে ফিরে গিয়ে সালাত আদায় করে তাঁকে সালাম করল। তখন সে দ্বিতীয় বারে অথবা তার পরের বারে বললঃ হে আল্লাহর রাসূল! আপনি আমাকে সালাত শিখিয়ে দিন। তিনি বললেনঃ যখন তুমি সালাতে দাঁড়ানোর ইচ্ছে করবে, তখন প্রথমে তুমি যথানিয়মে অযূ করবে। তারপর কিব্লামুখী দাঁড়িয়ে তাকবীর বলবে। তারপর কুরআন থেকে যে অংশ তোমার পক্ষে সহজ হবে, তা তিলাওয়াত করবে। তারপর তুমি রুকূ‘ করবে ধীরস্থিরভাবে। তারপর মাথা তুলে ঠিক সোজা হয়ে দাঁড়াবে। তারপর সিজদা করবে ধীরস্থিরভাবে। তারপর আবার মাথা তুলে বসবে ধীরস্থিরভাবে। তারপর ঠিক এভাবেই তোমার সালাতের যাবতীয় কাজ সমাধা করবে। আবূ উসামাহ বলেন, এমনকি শেষে তুমি সোজা হয়ে দন্ডায়মান হবে। [৭৫৭] (আধুনিক প্রকাশনী- ৫৮০৯, ইসলামিক ফাউন্ডেশন- ৫৭০৪)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 6252,
			"arabicnumber": 6252,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তারপর উঠে বস ধীরস্থিরভাবে। [৭৫৭] (আধুনিক প্রকাশনী- ৫৮১০, ইসলামিক ফাউন্ডেশন- ৫৭০৫)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 6253,
			"arabicnumber": 6253,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। একদা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে বললেনঃ জিবরীল (আ.) তোমাকে সালাম দিয়েছেন। তখন তিনি বললেনঃ ওয়া আলাইহিস্ সালাম ওয়া রহমাতুল্লাহ। [৩২১৭] (আধুনিক প্রকাশনী- ৫৮১১, ইসলামিক ফাউন্ডেশন- ৫৭০৬)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 6254,
			"arabicnumber": 6254,
			"text": "উসামাহ ইবনু যায়দ (রাঃ) হতে বর্ণিত যে, একবার নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এমন একটি গাধার উপর সাওয়ার হলেন, যার জ্বীনের নীচে ফাদাকের তৈরী একখানি চাদর ছিল। তিনি উসামাহ ইবনু যায়দকে নিজের পেছনে বসিয়েছিলেন। তখন তিনি হারিস ইবনু খাযরাজ গোত্রের সা‘দ ইবনু উবাদাহ এর দেখাশোনার উদ্দেশে রওয়ানা হচ্ছিলেন। এটি ছিল বদর যুদ্ধের আগের ঘটনা। তিনি এমন এক মাজলিসের পাশ দিয়ে যাচ্ছিলেন, যেখানে মুসলিম, প্রতিমাপূজক, মুশরিক ও ইয়াহূদী ছিল। তাদের মধ্যে ‘আবদুল্লাহ ইবনু উবাই ইবনু সালূলও ছিল। আর এ মাজলিসে ‘আবদুল্লাহ ইবনু রাওয়াহা-ও হাজির ছিলেন। যখন সাওয়ারীর পদাঘাতে বিক্ষিপ্ত ধূলাবালি মাজলিসকে ঢেকে ফেলছিল, তখন ‘আবদুল্লাহ ইবনু উবাই তার চাদর দিয়ে তার নাক ঢাকল। তারপর বললঃ তোমরা আমাদের উপর ধূলাবালি উড়িয়ো না। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের সালাম করলেন। তারপর এখানে থামলেন ও সাওয়ারী থেকে নেমে তাদের আল্লাহর প্রতি আহবান করলেন এবং তাদের কাছে কুরআন পাঠ করলেন। তখন ‘আবদুল্লাহ ইবনু উবাই ইবনু সালূল বললঃ হে আগন্তুক! আপনার এ কথার চেয়ে সুন্দর আর কিছু নেই। তবে আপনি যা বলছেন, যদিও তা সত্য, তবুও আপনি আমাদের মাজলিসে এসব বলে আমাদের বিরক্ত করবেন না। আপনি আপনার নিজ বাসস্থানে ফিরে যান। এরপর আমাদের মধ্য হতে কোন লোক আপনার নিকট গেলে তাকে এসব কথা বলবেন। তখন ইবনু রাওয়াহা বললেন, হে আল্লাহর রাসূল! আপনি আমাদের মজলিসে আসবেন, আমরা এসব কথা পছন্দ করি। তখন মুসলিম, মুশরিক ও ইয়াহূদীদের মধ্যে পরস্পর গালাগালি শুরু হয়ে গেল। এমনকি তারা একে অন্যের উপর আক্রমণ করতে উদ্যত হল। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের নিরস্ত করতে লাগলেন। শেষে তিনি তাঁর সাওয়ারীতে উঠে রওয়ানা হলেন এবং সা‘দ ইবনু উবাদাহর কাছে পৌঁছলেন। তারপর তিনি বললেন, হে সা‘দ! আবূ হুবাব অর্থাৎ ‘আবদুল্লাহ ইবনু উবাই কী বলেছে, তা কি তুমি শুনোনি? সা‘দ (রাঃ) বললেনঃ সে এমন কথাবার্তা বলেছে। তিনি আরো বললেনঃ হে আল্লাহর রাসূল! আপনি তাকে মাফ করে দিন। আর তার কথা ছেড়ে দিন। আল্লাহর শপথ! আল্লাহ তা‘আলা আপনাকে যে সব নি‘য়ামত দান করার ছিল তা সবই দান করেছেন। অন্যদিকে এ শহরের অধিবাসীরা তো পরামর্শ করে স্থির করেছিল যে, তারা তাকে রাজমুকুট পরাবে। আর তার শিরে রাজকীয় পাগড়ী বেঁধে দিবে। কিন্তু আল্লাহ তা‘আলা আপনাকে যে দ্বীনে হক দান করেছেন, তা দিয়ে তিনি তাদের সিদ্ধান্তকে বাতিল করে দিয়েছেন। ফলে সে (দুঃখের আগুনে) জ্বলছে। এজন্যই সে আপনার সঙ্গে যে ব্যবহার করেছে, তা আপনি নিজেই দেখেছেন। তারপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে মাফ করে দিলেন। (আধুনিক প্রকাশনী- ৫৮১২, ইসলামিক ফাউন্ডেশন- ৫৭০৭)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 6255,
			"arabicnumber": 6255,
			"text": "وَقَالَ عَبْدُ اللهِ بْنُ عَمْرٍو لاَ تُسَلِّمُوا عَلٰى شَرَبَةِ الْخَمْرِ. ‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) বলেনঃ শরাবখোরদের সালাম দিবে না। ৬২৫৫. ‘আবদুল্লাহ ইবনু কা‘ব (রহঃ) বলেনঃ যখন কা‘ব ইবনু মালিক তাবূকের যুদ্ধে যোগদান না করে পিছনে রয়ে যান, আর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার সাথে সালাম কালাম করতে সকলকে নিষেধ করে দেন। (তখনকার ঘটনা) আমি কা‘ব ইবনু মালিক (রাঃ)-কে বলতে শুনেছি যে, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে আসতাম এবং তাঁকে সালাম করতাম আর মনে মনে বলতাম যে, আমার সালামের জবাবে তাঁর ঠোঁট দু’টি নড়ছে কিনা। পঞ্চাশ দিন পূর্ণ হলে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফজরের সালাতের সময় ঘোষণা দিলেন যে, আল্লাহ তা‘আলা আমাদের তওবা কবূল করেছেন। [২৭৫৭] (আধুনিক প্রকাশনী- ৫৮১৩, ইসলামিক ফাউন্ডেশন- ৫৭০৮)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 6256,
			"arabicnumber": 6256,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, একবার একদল ইয়াহূদী রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এসে বললঃ আসসামু আলাইকা। (তোমার মরণ হোক)। আমি এ কথার অর্থ বুঝে বললামঃ আলাইকুমুস্ সামু ওয়াল লানাতু। (তোমাদের উপর মৃত্যু ও লা‘নাত)। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ হে ‘আয়িশাহ! তুমি থামো। আল্লাহ সর্ব হালতে নম্রতা পছন্দ করেন। আমি বললামঃ হে আল্লাহর রাসূল! তারা যা বললোঃ তা কি আপনি শুনেননি? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ এ জন্যই আমিও বলেছি, ওয়া আলাইকুম (অর্থাৎ তোমাদের উপরও)। [২৯৩৫] (আধুনিক প্রকাশনী- ৫৮১৪, ইসলামিক ফাউন্ডেশন- ৫৭০৯)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 6257,
			"arabicnumber": 6257,
			"text": "‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ ইয়াহূদী যদি তোমাদের সালাম করে তবে তাদের কেউ অবশ্যই বলবেঃ আসসামু আলাইকা। তখন তোমরা উত্তরে বলবে ‘ওয়াআলাইকা’। [৬৯২৮; মুসলিম ৩৯/৪, হাঃ ২১৬৪, আহমাদ ৪৬৯৮] (আধুনিক প্রকাশনী- ৫৮১৫, ইসলামিক ফাউন্ডেশন- ৫৭১০)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 6258,
			"arabicnumber": 6258,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যখন কোন আহলে কিতাব তোমাদের সালাম দেয়, তখন তোমরা বলবে ওয়া আলাইকুম (তোমাদের উপরও)। [২৯৬২; মুসলিম ৩৯/৪, হাঃ ২১৬৩, আহমাদ ১১৯৪৮] (আধুনিক প্রকাশনী- ৫৮১৬, ইসলামিক ফাউন্ডেশন- ৫৭১১)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 6259,
			"arabicnumber": 6259,
			"text": "‘আলী (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে ও যুবায়র ইবনু আওয়াম এবং আবূ মারসাদ গানাভী (রাঃ)-কে অশ্ব বের করে নির্দেশ দিলেন যে, তোমরা রওয়ানা হয়ে যাও এবং ‘রওযায়ে খাখে’ গিয়ে উপস্থিত হও। সেখানে একজন মুশরিক স্ত্রীলোক পাবে। তার কাছে হাতিব ইবনু আবূ বালতার দেয়া মুশরিকদের প্রতি প্রেরিত একখানি পত্র আছে। আমরা ঠিক সেই জায়গাতেই তাকে পেয়ে গেলাম যেখানকার কথা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছিলেন। ঐ স্ত্রী লোকটি তার এক উটের উপর সওয়ার ছিল। আমরা তাকে জিজ্ঞেস করলাম যে, তোমার কাছে যে পত্রখানি আছে তা কোথায়? সে বললঃ আমার সাথে কোন পত্র নেই। তখন আমরা তার উটসহ তাকে বসালাম এবং তার সাওয়ারীর আসবাবপত্রের তল্লাশি করলাম। কিন্তু আমরা কিছুই খুঁজে পেলাম না। আমার দু’জন সাথী বললেনঃ পত্রখানা তো পাওয়া গেল না। আমি বললামঃ আমার জানা আছে যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অনর্থক কথা বলেননি। তখন তিনি স্ত্রী লোকটিকে ধমক দিয়ে বললেনঃ তোমাকে অবশ্যই চিঠিটা বের করে দিতে হবে, নইলে আমি তোমাকে উলঙ্গ করে তল্লাশি চালাব। এরপর সে যখন আমার দৃঢ়তা লক্ষ্য করল, তখন সে বাধ্য হয়ে তার কোমরে পেঁচানো চাদরে হাত দিয়ে ঐ পত্রখানা বের করে দিল। তারপর আমরা তা নিয়ে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে পৌঁছলাম। তখন তিনি হাতিব (রাঃ)-কে জিজ্ঞেস করলেনঃ হে হাতিব! তুমি কেন এমন কাজ করলে? তিনি বললেনঃ আমার মনে এমন কোন খারাপ ইচ্ছে নেই যে, আমি আল্লাহ ও তাঁর রাসূলের প্রতি ঈমান ও বিশ্বাস হারিয়ে ফেলি। আমি আমার দৃঢ় মনোভাব পরিবর্তন করিনি এবং আমি দ্বীনও বদল করিনি। এই চিঠি দ্বারা আমার নিছক উদ্দেশ্য ছিল যে, এতে মক্কাবাসীদের উপর আমার দ্বারা এমন উপকার হোক, যার ফলে আল্লাহ তা‘আলা আমার পরিবার ও সম্পদ নিরাপদে রাখবেন। আর সেখানে আপনার অন্যান্য সাহাবীদের এমন লোক আছেন যাঁদের দ্বারা আল্লাহ তা‘আলা তাদের পরিবার ও সম্পদের নিরাপত্তা দান করবেন। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ হাতিব ঠিক কথাই বলেছে। সুতরাং তোমরা তাকে ভাল ব্যতীত অন্য কিছুই বলো না। রাবী বলেনঃ ‘উমার ইবনু খাত্তাব (রাঃ) বললেন, তিনি নিশ্চয় আল্লাহ ও তাঁর রাসূল এবং মু’মিনদের সঙ্গে বিশ্বাসঘাতকতা করেছেন। অতএব আমাকে ছেড়ে দিন আমি তাঁর গর্দান উড়িয়ে দেই। রাবী বলেন, তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ হে ‘উমার! তোমার কি জানা নেই যে, নিশ্চয়ই আল্লাহ তা‘আলা বদর যুদ্ধে অংশগ্রহণকারীদের সম্পর্কে জ্ঞাত আছেন এবং ঘোষণা করেছেন যে, তোমরা যা ইচ্ছে করতে পার। নিশ্চয়ই তোমাদের জন্য জান্নাত নির্ধারিত হয়ে আছে। রাবী বলেনঃ তখন ‘উমার (রাঃ) এর দু’চোখ দিয়ে অশ্রু ঝরতে লাগলো। তিনি বললেন, আল্লাহ ও তাঁর রাসূলই সবচেয়ে ভাল জানেন। [৩০০৭] (আধুনিক প্রকাশনী- ৫৮১৭, ইসলামিক ফাউন্ডেশন- ৫৭১২)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 6260,
			"arabicnumber": 6260,
			"text": "‘আবদুল্লাহ ইবনু ‘আব্বাস (রাঃ) বর্ণনা করেন যে, আবূ সুফ্ইয়ান ইবনু হারব তাকে বলেছেনঃ হিরাক্লিয়াস আবূ সুফ্ইয়ানকে ডেকে পাঠালেন, কুরাইশদের ঐ দলসহ যারা ব্যবসার জন্য সিরিয়া গিয়েছিলেন। তাঁরা সবাই তাঁর নিকট হাজির হলেন। এরপর তিনি ঘটনার বর্ণনা করেন। শেষে বললেন যে, তারপর হিরাক্লিয়াস রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর চিঠিটি আনালেন এবং তা পাঠ করা হল। এতে ছিল ‘বিসমিল্লা-হির রহমা-নির রহীম’ আল্লাহর বান্দা ও তাঁর রাসূল মুহাম্মাদ এর পক্ষ হতে রোম সম্রাট হিরাক্লিয়াসের প্রতি السَّلاَمُ عَلٰى مَنْ اتَّبَعَ الْهُد‘ى শান্তি বর্ষিত হোক তাদের উপর যারা সৎপথ অনুসরণ করেছে। [৭] (আধুনিক প্রকাশনী- ৫৮১৮, ইসলামিক ফাউন্ডেশন- ৫৭১৩)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 6261,
			"arabicnumber": 6261,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বনী ইসরাঈলের এক ব্যক্তির কথা উল্লেখ করে বললেন যে, সে এক টুকরো কাঠ নিয়ে খোদাই করে এর ভেতর এক হাজার দ্বীনার ভর্তি করে রাখল এবং এর মালিকের প্রতি লেখা একখানা চিঠিও রেখে দিল। আর ‘উমার ইবনু আবূ সালামাহ সূত্রে আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ এক লোক এক টুকরো কাঠ খোদাই করে তার ভেতরে কিছু মাল রেখে দিল এবং এর সাথে তার প্রাপকের প্রতি একখানা পত্রও ভরে দিল, যার মধ্যে লেখা ছিল, অমুকের পক্ষ থেকে অমুকের প্রতি। [১৪৯৮] (আধুনিক প্রকাশনী- ২৫-অনুচ্ছেদ, ইসলামিক ফাউন্ডেশন- ৫৭১৪)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 6262,
			"arabicnumber": 6262,
			"text": "আবূ সা‘ঈদ (রাঃ) হতে বর্ণিত যে, কুরাইযাহ গোত্রের লোকেরা সা‘দ (রাঃ) এর ফায়সালার উপর আত্মসমর্পণ করলো। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে আনার জন্য লোক পাঠালেন। তারপর তিনি এলে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সাহাবীদের বললেনঃ তোমরা আপন সরদারের প্রতি অথবা বললেনঃ তোমাদের শ্রেষ্ঠ ব্যক্তির সম্মানার্থে উঠে দাঁড়াও। তারপর সা‘দ (রাঃ) এসে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর পার্শ্বেই উপবেশন করলেন। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে বললেনঃ এরা তোমার ফায়সালার উপর আত্মসমর্পণ করেছে। তিনি বললেনঃ তা হলে আমি ফায়সালা দিচ্ছি যে, এদের মধ্যে যারা যুদ্ধ করার যোগ্য তাদের হত্যা করা হোক। আর তাদের ছোটদের বন্দী করা হোক। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ এদের ব্যাপারে তুমি আল্লাহ তা‘আলার ফায়সালা অনুযায়ীই ফায়সালা দিয়েছ। ইমাম বুখারী (রহ.) বলেন, আমার কোন কোন সঙ্গী উস্তাদ আবুল ওয়ালীদ থেকে আবূ সাঈদের এ হাদীস عَلٰى حُكْمِكَ এর স্থলে إِلٰى حُكْمِكَ শব্দ আমার কাছে বর্ণনা করেছেন। [৪০৪৩] (আধুনিক প্রকাশনী- ৫৮১৯, ইসলামিক ফাউন্ডেশন- ৫৭১৫)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 6263,
			"arabicnumber": 6263,
			"text": "وَقَالَ ابْنُ مَسْعُودٍ عَلَّمَنِي النَّبِيُّ صلى الله عليه وسلم التَّشَهُّدَ وَكَفِّي بَيْنَ كَفَّيْهِ وَقَالَ كَعْبُ بْنُ مَالِكٍ دَخَلْتُ الْمَسْجِدَ فَإِذَا بِرَسُوْلِ اللهِ صلى الله عليه وسلمفَقَامَ إِلَيَّ طَلْحَةُ بْنُ عُبَيْدِ اللهِ يُهَرْوِلُ حَتّٰى صَافَحَنِي وَهَنَّأَنِي. ইবনু মাস‘ঊদ (রাঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন আমাকে তাশাহহুদ শিক্ষা দেন তখন আমার হাত তাঁর দু’ হাতের মাঝে ছিল। কা‘ব ইবনু মালিক(রাঃ) বলেন, একবার আমি মসজিদে ঢুকেই রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে পেয়ে গেলাম। তখন ত্বলহা ইবনু ‘উবাইদুল্লাহ(রাঃ) আমার দিকে দৌড়ে এসে আমার সঙ্গে মুসাফাহা করলেন এবং আমাকে মুবারাকবাদ জানালেন। ৬২৬৩. ক্বাতাদাহ (রহ.) হতে বর্ণিত। আমি আনাস (রাঃ)-কে জিজ্ঞেস করলামঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাহাবীগণের মধ্যে কি মুসাফাহা চালু ছিল? তিনি বললেনঃ হাঁ। (আধুনিক প্রকাশনী- ৫৮২০, ইসলামিক ফাউন্ডেশন- ৫৭১৬)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 6264,
			"arabicnumber": 6264,
			"text": "‘আবদুল্লাহ ইবনু হিশাম (রাঃ) হতে বর্ণিত যে, আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে ছিলাম। তখন তিনি ‘উমার ইবনু খাত্তাব (রাঃ) এর হস্ত ধারণকৃত অবস্থায় ছিলেন। [৩৬৯৪] (আধুনিক প্রকাশনী- ৫৮২১, ইসলামিক ফাউন্ডেশন- ৫৭১৭)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 6265,
			"arabicnumber": 6265,
			"text": "وَصَافَحَ حَمَّادُ بْنُ زَيْدٍ ابْنَ الْمُبَارَكِ بِيَدَيْهِ. হাম্মাদ ইবনু যায়দ (রহ.) ইবনু মুবারকের সঙ্গে দু’হস্তে মুসাফাহ করেছেন। ৬২৬৫. ইবনু মাস‘ঊদ (রাঃ) হতে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার হাত তাঁর উভয় হস্তের মধ্যে রেখে আমাকে এমনভাবে তাশাহহুদ শিখিয়েছেন, যেভাবে তিনি আমাকে কুরআনের সূরা শিখাতেনঃ التَّحِيَّاتُ للهِ وَالصَّلَوَاتُ وَالطَّيِّبَاتُ السَّلاَمُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللهِ وَبَرَكَاتُهُ السَّلاَمُ عَلَيْنَا وَعَلٰى عِبَادِ اللهِ الصَّالِحِينَ أَشْهَدُ أَنْ لاَ إِلٰهَ إِلاَّ اللهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُه وَرَسُوْلُه এ সময় তিনি আমাদের মাঝেই অবস্থান করছিলেন। তারপর যখন তাঁর ওফাত হয়ে গেল, তখন থেকে আমরা السَّلاَمُ عَلَيْكَ এ স্থলে السَّلاَمُ عَلَى النَّبِيِّ পড়তে লাগলাম। [৮৩১] (আধুনিক প্রকাশনী- ৫৮২২, ইসলামিক ফাউন্ডেশন- ৫৭১৮)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 6266,
			"arabicnumber": 6266,
			"text": "‘আবদুল্লাহ ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত যে, ‘আলী ইবনু আবূ তালিব (রাঃ) যখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর শেষ কালে তাঁর কাছ থেকে বেরিয়ে এলেন, লোকেরা তাঁকে জিজ্ঞেস করলোঃ হে আবুল হাসান! কিভাবে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সকাল হয়েছে? তিনি বললেনঃ আলহামদু লিল্লাহ সুস্থ অবস্থায় তাঁর সকাল হয়েছে। তখন ‘আব্বাস (রাঃ) তার হাত ধরে বললেনঃ তুমি কি তাঁর অবস্থা বুঝতে পারছ না? তুমি তিনদিন পরই লাঠির গোলাম হয়ে যাবে। আল্লাহর কসম! আমি নিঃসন্দেহে ধারণা করছি যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর এ অসুখেই শীঘ্রই ইন্তিকাল করবেন। আমি বনূ ‘আবদুল মুত্তালিবের চেহারা থেকে তাঁদের মৃত্যুর আলামত বুঝতে পারি। অতএব তুমি আমাদের রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট নিয়ে যাও। আমরা তাঁকে জিজ্ঞেস করবো যে, তাঁর অবর্তমানে খিলাফতের দায়িত্ব কাদের হাতে থাকবে? যদি আমাদের বংশেই থাকে, তবে তা আমরা জেনে রাখলাম। আর যদি অন্য কোন গোত্রের হাতে থাকবে বলে জানি, তবে আমরা তাঁর সাথে পরামর্শ করবো এবং তিনি আমাদের জন্য অসিয়ত করে যাবেন। ‘আলী (রাঃ) বললেনঃ আল্লাহর কসম! যদি আমরা এ ব্যাপারে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে জিজ্ঞেস করি আর তিনি এ ব্যাপারে আমাদের বিরত থাকার নির্দেশ দেন, তাহলে লোকজন কখনও আমাদের এ সুযোগ দেবে না। সুতরাং রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে কখনো জিজ্ঞেস করবো না। [৪৪৪৭] (আধুনিক প্রকাশনী- ৫৮২৩, ইসলামিক ফাউন্ডেশন- ৫৭১৯)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 6267,
			"arabicnumber": 6267,
			"text": "মু‘আয ইবনু জাবাল (রাঃ) বলেন, আমি একবার নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর পেছনে তাঁর সাওয়ারীর উপর উপবিষ্ট ছিলাম। তখন তিনি আমাকে ডাক দিলেনঃ ওহে মু‘আয! আমি বললাম, লাব্বাইকা ওয়া সদাইকা। তারপর তিনি এরূপ তিনবার ডাকলেন। এরপর বললেনঃ তুমি কি জানো যে, বান্দাদের উপর আল্লাহর হক কী? তিনি বললেনঃ তা’ হলো, বান্দারা তাঁর ‘‘ইবাদাত করবে আর এতে তাঁর সঙ্গে কোন কিছুকে শরীক করবে না। আবার কিছুক্ষণ চলার পর তিনি বললেনঃ ওহে মু‘আয! আমি জবাবে বললামঃ লাববাইকা ওয়া সা‘দাইকা। তখন তিনি বললেনঃ তুমি কি জানো যে, বান্দা যখন তাঁর ‘ইবাদাত করবে, তখন আল্লাহর উপর বান্দাদের হক কী হবে? তিনি বললেনঃ তা এই যে, তিনি তাদের আযাব দিবেন না। [২৮৫৬] (আধুনিক প্রকাশনী- ৫৮২৪, ইসলামিক ফাউন্ডেশন- ৫৭২০)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 6268,
			"arabicnumber": 6268,
			"text": "যায়দ ইবনু ওয়াহ্ব (রহ.) বলেন, আল্লাহর কসম! আবূ যার রাবাযাহ নামক স্থানে আমাদের কাছে বর্ণনা করেন যে, একবার আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে এশার সময় মাদ্বীনায় হাররা নামক স্থান দিয়ে পায়ে হেঁটে যাচ্ছিলাম। তখন আমরা উহুদ পাহাড়ের সম্মুখীন হলে তিনি আমাকে বললেনঃ হে আবূ যার! আমি এটা পছন্দ করি না যে, আমার নিকট উহুদ পাহাড় পরিমাণ সোনা আসুক। আর ঋণ পরিশোধের পরিমাণ ছাড়া এক দ্বীনার পরিমাণ সোনাও এক রাত অথবা তিন রাত পর্যন্ত আমার হাতে তা থেকে যাক। বরং আমি পছন্দ করি যে, আমি এগুলো আল্লাহর বান্দাদের এভাবে বিলিয়ে দেই। (কীভাবে দেবেন) তা তাঁর হাত দিয়ে তিনি দেখালেন। তারপর বললেনঃ হে আবূ যার! আমি বললামঃ লাব্বাইকা ওয়া স’দাইকা, হে আল্লাহর রাসূল! তখন তিনি বললেনঃ দুনিয়াতে যার বেশি ধন, আখিরাতে তারা হবে অনেক কম সাওয়াবের অধিকারী। তবে যারা তাদের সম্পদকে এভাবে, এভাবে বিলিয়ে দেবে। তারা হবে এর ব্যতিক্রম। তারপর তিনি আমাকে বললেনঃ আমি ফিরে না আসা পর্যন্ত, হে আবূ যার! তুমি এ স্থানেই থাকো। এখান থেকে কোথাও যেয়ো না। এরপর তিনি রওয়ানা হয়ে গেলেন, এমনকি আমার অদৃশ্যে চলে গেলেন। এমন সময় একটা শব্দ শুনলাম। এতে আমি শংকিত হয়ে পড়লাম যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কোন বিপদের সম্মুখীন হয়ে পড়লেন কিনা? তাই আমি সে দিকে এগিয়ে যেতে চাইলাম। কিন্তু সাথে সাথেই রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিষেধাজ্ঞা- যে কোথায়ও যেয়ো না- মনে পড়লো এবং আমি থেমে গেলাম। এরপর তিনি ফিরে আসলে আমি বললামঃ হে আল্লাহর রাসূল! আমি একটা আওয়ায শুনে ভীত হয়ে পড়লাম যে, আপনি সেখানে গিয়ে কোন বিপদে পড়লেন কিনা। কিন্তু আপনার কথা স্মরণ করে থেমে গেলাম। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তিনি ছিলেন জিবরীল। তিনি আমার নিকট এসে সংবাদ দিলেন যে, আমার উম্মাতের মধ্যে যে লোক আল্লাহর সঙ্গে কোন কিছুকে শরীক না করে মারা যাবে, সে জান্নাতে প্রবেশ করবে। তখন আমি বললাম, হে আল্লাহর রাসূল! যদিও সে ব্যক্তি ব্যভিচার করে? যদিও সে ব্যক্তি চুরি করে? তিনি বললেনঃ সে যদিও ব্যভিচার করে, যদিও চুরি করে থাকে তবুও। আ‘মাশ (রহ.) বলেন, আমি যায়দকে বললাম, আমার কাছে খবর পৌঁছেছে যে, এ হাদীসের রাবী হলেন আবুদ্ দারদা। তিনি বললেনঃ আমি সাক্ষ্য দিচ্ছি যে, এ হাদীসটি আবূ যারই রাবাযা নামক স্থানে আমার কাছে বর্ণনা করেছেন। আ‘মাশ (রহ.) বলেন, আবূ সালিহও আবূ দারদা সূত্রে আমার কাছে এ রকম বর্ণনা করেছেন। আর আবূ শিহাব, আ‘মাশ থেকে বর্ণনা করেন যে, তিনি বলেছেনঃ ‘তিন দিনের অতিরিক্ত’। [১২৩৭; মুসলিম ১/৪০, হাঃ ৯৪, আহমাদ ২১৪৭১] (আধুনিক প্রকাশনী- ৫৮২৬, ইসলামিক ফাউন্ডেশন- ৫৭২১)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 6269,
			"arabicnumber": 6269,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন ব্যক্তি অপর কাউকে তার বসার স্থান থেকে উঠিয়ে দিয়ে সে সেখানে বসবে না। [৯১১; মুসলিম ৩৯/১১, হাঃ ২১৭৭, আহমাদ ৬০৬৯] (আধুনিক প্রকাশনী- ৫৮২৭, ইসলামিক ফাউন্ডেশন- ৫৭২২)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 6270,
			"arabicnumber": 6270,
			"text": "(إِذَا قِيلَ لَكُمْ تَفَسَّحُوا فِي الْمَجَالِسِ فَافْسَحُوا يَفْسَحِ اللَّهُ لَكُمْ وَإِذَا قِيلَ انْشِزُوا فَانْشِزُوا) الآيَةَ ‘‘যখন বলা হয়- ‘মাজলিস প্রশস্ত করে দাও’, তখন তোমরা তা প্রশস্ত করে দিবে, আল্লাহ তোমাদেরকে প্রশস্ততা দান করবেন.....।’’ (সূরা মুজাদালাহ ৫৮/১১) ৬২৭০. ইবনু ‘উমার (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কোন লোককে তার বসার স্থান থেকে উঠিয়ে দিয়ে সেখানে অন্য লোক বসতে নিষেধ করেছেন। তবে তোমরা বসার জায়গা প্রশস্ত করে দাও এবং ব্যবস্থা করে দাও। ইবনু ‘উমার (রাঃ) কেউ তার জায়গা থেকে উঠে যাক এবং তার স্থানে অন্যজন বসুক তা পছন্দ করতেন না। [৯১১] (আধুনিক প্রকাশনী- ৫৮২৮, ইসলামিক ফাউন্ডেশন- ৫৭২৩)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 6271,
			"arabicnumber": 6271,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। তিনি বলেন, যখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যাইনাব বিন্ত জাহশ (রাঃ)-কে বিয়ে করলেন, তখন তিনি কয়েকজন লোককে দা’ওয়াত করলেন। তাঁরা খাদ্য গ্রহণের পর বসে বসে অনেক সময় পর্যন্ত আলাপ-আলোচনায় মশগুল থাকলেন। তখন তিনি নিজে চলে যাবার ভাব প্রকাশ করলেন। কিন্তু তাতেও তাঁরা উঠলেন না। তিনি এ অবস্থা দেখে নিজেই উঠে দাঁড়ালেন। যখন তিনি চলে গেলেন, তখন লোকেদের মধ্যে যারা দাঁড়াবার ইচ্ছে করলেন, তারা তাঁর সঙ্গেই উঠে চলে গেলেন। কিন্তু তাদের তিনজন থেকে গেলেন। এরপর যখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফিরে এসে ঘরে প্রবেশ করতে চাইলেন, তখন দেখলেন যে ঐ তিনজন তখনো বসে আছেন। কিছুক্ষণ পর তারাও উঠে চলে গেলে, আমি গিয়ে তাঁকে তাদের চলে যাবার সংবাদ দিলাম। এরপর তিনি এসে ঘরে ঢুকলেন। তখন আমিও প্রবেশ করতে চাইলে তিনি আমার ও তাঁর মধ্যে পর্দা টেনে দিলেন। এ সময় আল্লাহ তা‘আলা ওয়াহী অবতীর্ণ করলেনঃ ‘‘তোমরা যারা ঈমান এনেছ শোন! নবীগৃহে প্রবেশ কর না যতক্ষণ না তোমাদেরকে অনুমতি দেয়া হয়..... আল্লাহর দৃষ্টিতে এটা মহা অপরাধ।’’- (সূরাহ আল-আহযাব ৩৩/৫৩)। [৪৭৯১] (আধুনিক প্রকাশনী- ৫৮২৯, ইসলামিক ফাউন্ডেশন- ৫৭২৪)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 6272,
			"arabicnumber": 6272,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি একবার রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে কা‘বা’র আঙ্গিনায় দু’ হাঁটু খাড়া করে দু’ হাত দিয়ে তা বেড় দিয়ে এভাবে উপবিষ্ট অবস্থায় পেয়েছি। (আধুনিক প্রকাশনী- ৫৮৩০, ইসলামিক ফাউন্ডেশন- ৫৭২৫)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 6273,
			"arabicnumber": 6273,
			"text": "قَالَ خَبَّابٌ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم وَهُوَ مُتَوَسِّدٌ بُرْدَةً قُلْتُ أَلاَ تَدْعُو اللهَ فَقَعَدَ. খাব্বাব (রাঃ) বর্ণনা করেন, আমি একবার নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে আসলাম। তখন তিনি একটা চাদর দিয়ে বালিশ বানিয়ে তাতে হেলান দিচ্ছিলেন। আমি বললামঃ আপনি কি (আমার মুক্তির জন্য) আল্লাহর নিকট দু‘আ করবেন না? তখন তিনি সোজা হয়ে বসলেন। ৬২৭৩. আবূ বাকরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আমি কি তোমাদের নিকৃষ্ট কাবীরাহ গুনাহের বর্ণনা দিব না? সকলে বললেনঃ হাঁ, হে আল্লাহর রাসূল! তখন তিনি বললেনঃ তা হলো, আল্লাহর সঙ্গে অন্য কোন কিছুকে শারীক করা এবং মাতা-পিতার অবাধ্যতা। [২৬৫৩] (আধুনিক প্রকাশনী- ৫৮৩১, ইসলামিক ফাউন্ডেশন- ৫৭২৬)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 6274,
			"arabicnumber": 6274,
			"text": "মুসাদ্দাদ, বিশরের এক সূত্রে এ রকম হাদীস বর্ণনা করেছেন। তাতে অধিক বর্ণনা করেছেন যে, তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হেলান দেয়া অবস্থায় ছিলেন। এরপর তিনি সোজা হয়ে বসলেন এবং বললেনঃ হুশিয়ার হও! আর (সবচেয়ে বড় গুনাহ) মিথ্যা কথা বলা। এ কথাটা তিনি বারবার বলতে থাকলেন। এমনকি আমরা বললামঃ হায়! তিনি যদি থামতেন। [২৬৫৪] (আধুনিক প্রকাশনী- ৫৮৩২, ইসলামিক ফাউন্ডেশন- ৫৭২৬)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 6275,
			"arabicnumber": 6275,
			"text": "‘উকবাহ ইবনু হারিস (রাঃ) বলেন, একবার নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ‘আসরের সালাত আদায় পূর্বক দ্রুত গিয়ে নিজ ঘরে প্রবেশ করলেন। [৮৫১] (আধুনিক প্রকাশনী- ৫৮৩৩, ইসলামিক ফাউন্ডেশন- ৫৭২৭)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 6276,
			"arabicnumber": 6276,
			"text": "‘আয়িশাহ (রাঃ) বর্ণনা করেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (আমার) পালঙ্কের মাঝখানে দাঁড়িয়ে সালাত আদায় করতেন। তখন আমি তাঁর ও কিবলার মাঝে শুয়ে থাকতাম। যখন আমার কোন প্রয়োজন হতো, তখন আমি তাঁর দিকে মুখ করে উঠে দাঁড়ানো পছন্দ করতাম না বরং আমি শায়িত অবস্থাতেই পেছনের দিক দিয়ে কেটে পড়তাম।[৩৮২] (আধুনিক প্রকাশনী- ৫৮৩৪, ইসলামিক ফাউন্ডেশন- ৫৭২৮)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 6277,
			"arabicnumber": 6277,
			"text": "‘আবদুল্লাহ ইবনু ‘আমর (রাঃ) বর্ণনা করেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট আমার অধিক সওম পালন করার কথা উল্লেখ করা হলো। তখন তিনি আমার ঘরে আসলেন এবং আমি তাঁর উদ্দেশে খেজুরের ছালে ভরা চামড়ার একটা বালিশ পেশ করলাম। তিনি মাটিতেই বসে গেলেন। আর বালিশটা আমার ও তাঁর মাঝে থেকে গেল। তিনি আমাকে বললেনঃ প্রত্যেক মাসে তিনদিন সওম পালন করা কি তোমার জন্য যথেষ্ট নয়? আমি বললামঃ হে আল্লাহর রাসূল! তিনি বললেনঃ তা হলে পাঁচ দিন? আমি বললামঃ হে আল্লাহর রাসূল! তিনি বললেনঃ তবে সাতদিন? আমি আবার বললামঃ হে আল্লাহর রাসূল! তিনি বললেনঃ তবে নয়দিন? আমি পুনরায় বললামঃ হে আল্লাহর রাসূল! তিনি বললেনঃ তা হলে এগার দিন? আমি বললামঃ হে আল্লাহর রাসূল! তখন তিনি বললেনঃ দাউদ (আ.)-এর সওমের চেয়ে অধিক কোন নাফ্ল) সওম নেই। তিনি প্রত্যেক মাসের অর্ধেক দিন সওম পালন করতেন অর্থাৎ একদিন সওম পালন করতেন আর একদিন পালন করতেন না। [১১৩১] (আধুনিক প্রকাশনী- ৫৮৩৫, ইসলামিক ফাউন্ডেশন- ৫৭২৯)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 6278,
			"arabicnumber": 6278,
			"text": "ইব্রাহীম (রহ.) হতে বর্ণিত। তিনি বলেন, একবার ‘আলক্বামাহ (রহ.) সিরিয়ায় গমন করলেন। তখন তিনি মসজিদে গিয়ে দু’ রাক‘আত সালাত আদায় করে দু‘আ করলেনঃ হে আল্লাহ! আপনি আমাকে একজন নেক সঙ্গী দান করুন। এরপর তিনি আবুদ্ দারদা -এর পাশে গিয়ে বসে পড়লেন। তারপর তাঁকে জিজ্ঞেস করলেনঃ আপনি কোন্ শহরের লোক? তিনি জবাব দিলেনঃ আমি কূফার অধিবাসী। তিনি জিজ্ঞেস করলেনঃ আপনাদের মধ্যে কি সেই লোক নেই। যিনি ঐ ভেদ সম্পর্কে জানতেন, যা অপর কেউ জানতেন না? (রাবী বলেন) অর্থাৎ হুযাইফাহ। আবার জিজ্ঞেস করলেনঃ আপনাদের মধ্যে কি এমন লোক নেই, অথবা আছেন, যাঁকে আল্লাহ তা‘আলা তাঁর রাসূলের দু‘আর কারণে শয়তান থেকে পানাহ দিয়েছেন? (রাবী বলেন) অর্থাৎ ‘আম্মার তিনি আবার জিজ্ঞেস করলেনঃ আর আপনাদের মধ্যে কি সে লোক নেই যিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর মিস্ওয়াক ও বালিশের দায়িত্বে ছিলেন? (রাবী বলেন) অর্থাৎ ‘আবদুল্লাহ ইবনু মাস‘ঊদ (রাঃ)। আবুদ্ দারদা তাঁকে জিজ্ঞেস করেনঃ ‘আবদুল্লাহ ইবনু মাস‘ঊদ সূরায়ে (‏وَاللَّيْلِ إِذَا يَغْشَى‏)‏‏ কীভাবে পড়তেন? তিনি বললেনঃ তিনি (‘ওয়ামা খালাকায যাকারা ওয়াল উনসা’র স্থলে ‘ওয়ামা খালাকা’ অংশটুকু বাদ দিয়ে) পড়তেন (‏وَالذَّكَرِ وَالأُنْثَى‏)। তখন তিনি বললেনঃ এখানকার লোকেরা আমাকে এ সূরা সম্পর্কে সন্দেহে নিক্ষেপ করেছে। অথচ আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে এ রকমই শুনেছি। (আধুনিক প্রকাশনী- ৫৮৩৬, ইসলামিক ফাউন্ডেশন- ৫৭৩০)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 6279,
			"arabicnumber": 6279,
			"text": "সাহল ইবনু সা‘দ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমরা জুমু‘আহর সালাতের পরেই ‘কা-ইলাহ’ করতাম এবং দুপুরের খাদ্য গ্রহণ করতাম। [৯৩৮] (আধুনিক প্রকাশনী- ৫৮৩৭, ইসলামিক ফাউন্ডেশন- ৫৭৩১)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 6280,
			"arabicnumber": 6280,
			"text": "সাহল ইবনু সা‘দ (রাঃ) হতে বর্ণিত। ‘আলী (রাঃ) এর কাছে ‘আবূ তুরাব’-এর চেয়ে প্রিয় কোন নাম ছিল না। এ নামে ডাকা হলে তিনি খুবই খুশী হতেন। কারণ একবার রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফাতেমাহ (রাঃ) এর ঘরে আসলেন। তখন ‘আলী (রাঃ)-কে ঘরে পেলেন না। তিনি জিজ্ঞেস করলেনঃ তোমার চাচাতো ভাই কোথায়? তিনি বললেনঃ আমার ও তাঁর মাঝে কিছু ঘটে যাওয়ায় তিনি আমার সঙ্গে রাগ করে বেরিয়ে গেছেন। আমার কাছে কা-ইলাহ করেননি। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জনৈক লোককে বললেনঃ দেখতো সে কোথায়? সে লোকটি এসে বললঃ হে আল্লাহর রাসূল! তিনি তো মসজিদে ঘুমিয়ে আছেন। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এসে দেখতে পেলেন যে, তিনি কাত হয়ে শুয়ে আছেন, আর তাঁর চাদরখানা পার্শ্ব থেকে পড়ে গেছে। ফলে তার গায়ে মাটি লেগে গেছে। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর গায়ের মাটি ঝাড়তে লাগলেন এবং বলতে লাগলেনঃ ওঠো, আবূ তুরাব (মাটির বাপ) ওঠো, আবূ তুরাব! এ কথাটা তিনি দু’বার বললেন। [৪৪১] (আধুনিক প্রকাশনী- ৫৮৩৮, ইসলামিক ফাউন্ডেশন- ৫৭৩২)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 6281,
			"arabicnumber": 6281,
			"text": "আনাস (রাঃ) হতে বর্ণিত। তিনি বলেন, উম্মু সুলায়ম নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর জন্য চামড়ার বিছানা বিছিয়ে দিতেন এবং তিনি সেখানেই ঐ চামড়ার বিছানার উপর কায়লুলা করতেন। অতঃপর তিনি যখন ঘুম থেকে উঠতেন, তখন তিনি তাঁর শরীরের কিছুটা ঘাম ও চুল সংগ্রহ করতেন এবং তা একটা বোতলের মধ্যে জমা করতেন এবং পরে ‘সুক্ক’ নামক সুগন্ধিতে মিশাতেন। রাবী বর্ণনা করেন যে, আনাস ইবনু মালিক (রাঃ) এর মৃত্যু সন্নিকট হলে, তিনি আমাকে অসিয়ত করলেনঃ যেন ঐ সুক্ক থেকে কিছুটা তাঁর সুগন্ধির সাথে মিলানো হয়। তাই তা তাঁর সুগন্ধিতে মেশানো হয়েছিল। (আধুনিক প্রকাশনী- ৫৮৩৯, ইসলামিক ফাউন্ডেশন- ৫৭৩৩)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 6283,
			"arabicnumber": 6283,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 6284,
			"arabicnumber": 6284,
			"text": "আবূ সা‘ঈদ খুদরী (রাঃ) বর্ণনা করেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দু’ রকমের লেবাস এবং দু’ ধরনের বিক্রয় নিষেধ করেছেন। ইশতিমালে সম্মা [১] এবং এক কাপড় পরে ইহতিবা [২] করতে নিষেধ করেছেন যাতে তার লজ্জাস্থানে কাপড়ের কোন অংশ না থাকে। এবং মুলামাসা ও মুনাবাযা- বেচাকেনা থেকেও। [৩৬৭] (আধুনিক প্রকাশনী- ৫৮৪১, ইসলামিক ফাউন্ডেশন- ৫৭৩৫)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 6286,
			"arabicnumber": 6286,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 6287,
			"arabicnumber": 6287,
			"text": "‘আবদুল্লাহ ইবনু যায়দ আনসারী (রাঃ) হতে বর্ণিত। তিনি বলেনঃ আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে মসজিদে চিত হয়ে শুয়ে থাকতে দেখেছি, তখন তাঁর এক পা অন্য পায়ের উপর রাখা ছিল। [৪৭৫] (আধুনিক প্রকাশনী- ৫৮৪৩, ইসলামিক ফাউন্ডেশন- ৫৭৩৭)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 6288,
			"arabicnumber": 6288,
			"text": "وَقَوْلُهُ تَعَالَى: (يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا تَنَاجَيْتُمْ فَلاَ تَتَنَاجَوْا بِالإِثْمِ وَالْعُدْوَانِ وَمَعْصِيَةِ الرَّسُولِ وَتَنَاجَوْا بِالْبِرِّ وَالتَّقْوَى). إِلَى قَوْلِهِ: (وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ) وَقَوْلُهُ: (يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا نَاجَيْتُمُ الرَّسُولَ فَقَدِّمُوا بَيْنَ يَدَيْ نَجْوَاكُمْ صَدَقَةً ذَلِكَ خَيْرٌ لَكُمْ وَأَطْهَرُ فَإِنْ لَمْ تَجِدُوا فَإِنَّ اللَّهَ غَفُورٌ رَحِيمٌ) إِلَى قَوْلِهِ: (وَاللَّهُ خَبِيرٌ بِمَا تَعْمَلُونَ). এ প্রসঙ্গে মহান আল্লাহর বাণীঃ হে মু’মিনগণ! যখন গোপন পরামর্শ কর, সে পরামর্শ যেন পাপাচার, সীমালঙ্ঘন ... মু’মিনদের কর্তব্য আল্লাহর উপর নির্ভর করা’’- (সূরাহ আল-মুজাদালাহ ৫৮/৯-১০)। আরও আল্লাহর বাণীঃ হে মু’মিনগণ! তোমরা রাসূলের সঙ্গে চুপিচুপি কথা বলতে চাইলে তার পূর্বে সদাকাহ প্রদান করবে..... তোমরা যা কর আল্লাহ তা সম্যক অবগত- (সূরাহ আল-মুজাদালাহ ৫৮/১২-১৩)। ৬২৮৮. ‘আবদুল্লাহ (রাঃ) হতে বর্ণিত যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোথাও তিনজন থাকলে তৃতীয় জনকে বাদ দিয়ে দু’জনে মিলে চুপি চুপি কথা বলবে না। [মুসলিম পর্ব ৩৯/হাঃ ২১৮৩, আহমাদ ৪৬৮৫] (আধুনিক প্রকাশনী- ৫৮৪৪, ইসলামিক ফাউন্ডেশন- ৫৭৩৮)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 6289,
			"arabicnumber": 6289,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। তিনি বলেনঃ একবার নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার কাছে একটি বিষয় গোপনে বলেছিলেন। আমি তাঁর পরেও কাউকে তা জানাইনি। এটা সম্পর্কে উম্মু সুলায়ম আমাকে জিজ্ঞেস করেছিলেন। কিন্তু আমি তাঁকেও বলিনি। [মুসলিম ৪৪/৩২, হাঃ ২৪৮২, আহমাদ ১৩২৯২] (আধুনিক প্রকাশনী- ৫৮৪৫, ইসলামিক ফাউন্ডেশন- ৫৭৩৯)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 6290,
			"arabicnumber": 6290,
			"text": "‘আবদুল্লাহ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোথাও তোমরা তিনজনে থাকলে একজনকে বাদ দিয়ে দু’জনে কানে-কানে কথা বলবে না। এতে তার মনে দুঃখ হবে। তোমরা পরস্পর মিশে গেলে তবে তা করাতে দোষ নেই। [মুসলিম ৩৯/১৫, হাঃ ২১৮৪, আহমাদ ৪৪২৪] (আধুনিক প্রকাশনী- ৫৮৪৬, ইসলামিক ফাউন্ডেশন- ৫৭৪০)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 6291,
			"arabicnumber": 6291,
			"text": "‘আবদুল্লাহ (রাঃ) হতে বর্ণিত যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একদিন কিছু মাল লোকজনকে বণ্টন করে দিলেন। তখন একজন আনসারী মন্তব্য করলেন যে, এ বাঁটোয়ারা এমন, যার মধ্যে আল্লাহর সন্তুষ্টির প্রতি লক্ষ্য রাখা হয়নি। তখন আমি বললাম সাবধান! আল্লাহর কসম! আমি নিশ্চয়ই নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট গিয়ে এ কথাটা বলে দিব। এরপর আমি তাঁর নিকট গেলাম। কিন্তু তখন তিনি একদল সাহাবীর মধ্যে ছিলেন। তাই আমি কথাটা তাঁকে কানে-কানেই বললাম। তখন তিনি রেগে গেলেন। এমনকি তাঁর চেহারার রং লাল হয়ে গেল। কিছুক্ষণ পরে তিনি বললেনঃ মূসা (আ.)-এর উপর রহমত অবতীর্ণ হোক। তাঁকে এর চেয়ে অধিক কষ্ট দেয়া হয়েছে, কিন্তু তিনি ধৈর্য অবলম্বন করেছেন। [৩১৫০] (আধুনিক প্রকাশনী- ৫৮৪৭, ইসলামিক ফাউন্ডেশন- ৫৭৪১)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 6292,
			"arabicnumber": 6292,
			"text": "(وَإِذْ هُمْ نَجْوَى) مَصْدَرٌ مِنْ نَاجَيْتُ، فَوَصَفَهُمْ بِهَا، وَالْمَعْنَى يَتَنَاجَوْنَ. আল্লাহ তা‘আলার বাণীঃ ‘‘তারা গোপনে পরস্পর আলোচনায় বসে।’’ (সূরাহ ইসরা ১৭/৪৭) نَاجَيْتُ শব্দটির মাসদার হচ্ছে نَجْوَى। এর দ্বারাই তাদের বর্ণনা দেয়া হয়েছে। এর অর্থ হচ্ছে পরস্পর চুপিসারে কথা বলাবলি করা। ৬২৯২. আনাস ইবনু মালিক (রাঃ) বর্ণনা করেন। একবার সালাতের ইক্বামাত(ইকামত/একামত) হয়ে গেলো, তখনও একজন লোক রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে কানে-কানে কথা বলছিলেন এবং দীর্ঘক্ষণ ধরে তিনি এভাবে আলাপ করতে থাকলেন। এমনকি তাঁর সঙ্গীগণ ঘুমিয়ে পড়েছিলেন। তারপর তিনি দাঁড়িয়ে সালাত আদায় করলেন। [৬৪২] (আধুনিক প্রকাশনী- ৫৮৪৮, ইসলামিক ফাউন্ডেশন- ৫৭৪২)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 6293,
			"arabicnumber": 6293,
			"text": "সালিম (রহ.) তাঁর পিতা থেকে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণনা করেন। তিনি বলেছেনঃ যখন তোমরা ঘুমাবে তখন তোমাদের ঘরে আগুন রেখে ঘুমাবে না। [মুসলিম ৩৬/১২, হাঃ ২০১৫, আহমাদ ৪৫১৫] (আধুনিক প্রকাশনী- ৫৮৪৯, ইসলামিক ফাউন্ডেশন- ৫৭৪৩)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 6294,
			"arabicnumber": 6294,
			"text": "আবূ মূসা (রাঃ) হতে বর্ণিত। তিনি বলেন, একবার রাত্রি কালে মদিনার এক ঘরে আগুন লেগে ঘরের লোকজনসহ পুড়ে গেল। এদের অবস্থা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে অবহিত করা হল। তিনি বললেনঃ এ আগুন নিঃসন্দেহে তোমাদের চরম শত্রু। সুতরাং তোমরা যখন ঘুমাতে যাবে, তখন তা নিভিয়ে দিবে। [মুসলিম ৩৬/১২, হাঃ ১৬, আহমাদ ১৯৫৮৮] (আধুনিক প্রকাশনী- ৫৮৫০, ইসলামিক ফাউন্ডেশন- ৫৭৪৪)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 6295,
			"arabicnumber": 6295,
			"text": "জাবির ইবনু ‘আবদুল্লাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের পানাহারের পাত্রগুলো ঢেকে রাখবে। আর ঘুমাবার সময় (ঘরের) দরজাগুলো বন্ধ করবে এবং বাতিগুলো নিভিয়ে ফেলবে। কারণ প্রায়ই দুষ্ট ইঁদুরগুলো জ্বালানো বাতির ফিতাগুলো টেনে নিয়ে যায় এবং ঘরের লোকজনকে পুড়িয়ে মারে। [৩২৮০] (আধুনিক প্রকাশনী- ৫৮৫১, ইসলামিক ফাউন্ডেশন- ৫৭৪৫)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 6296,
			"arabicnumber": 6296,
			"text": "জাবির (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ রাতে যখন তোমরা ঘুমাতে যাবে, তখন বাতি নিভিয়ে দেবে, দরজা বন্ধ করবে, খাদ্য ও পানীয় দ্রব্যাদি ঢেকে রাখবে এবং মশকের মুখ বেঁধে রাখবে। হাম্মাম বলেনঃ এক টুকরা কাঠ দিয়ে হলেও। [৩২৮০] (আধুনিক প্রকাশনী- ৫৮৫২, ইসলামিক ফাউন্ডেশন- ৫৭৪৬)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 6297,
			"arabicnumber": 6297,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মানুষের স্বভাবগত বিষয় হলো পাঁচটিঃ খাত্না করা, নাভির নীচের পশম কামানো, বগলের পশম উপড়ে ফেলা, গোঁফ ছাঁটা এবং (অতিরিক্ত) নখ কাটা। [৫৮৮৯] (আধুনিক প্রকাশনী- ৫৮৫৩, ইসলামিক ফাউন্ডেশন- ৫৭৪৭)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 6298,
			"arabicnumber": 6298,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ইব্রাহীম (আঃ) আশি বছর বয়সের পর ‘কাদূম’ নামক স্থানে নিজেই নিজের খাত্না করেন। কুতাইবাহ (রহ.) আবুয যিনাদ (রহ.) হতে বর্ণিত। তিনি বলেনঃ ‘কাদ্দুম’ একটি জায়গার নাম। (আধুনিক প্রকাশনী- ৫৮৫৪, ৫৮৫৩ ইসলামিক ফাউন্ডেশন- ৫৭১৮)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 6299,
			"arabicnumber": 6299,
			"text": "তিনি [সা‘ঈদ ইবনু যুবায়র] আরও বলেনঃ তাদের নিয়ম ছিল যে, সাবালক না হওয়া পর্যন্ত তারা খাত্না করতেন না। [৬২৯৯] (আধুনিক প্রকাশনী- ৫৮৫৬, ইসলামিক ফাউন্ডেশন- ৫৭৪৯)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 6300,
			"arabicnumber": 6300,
			"text": "সা‘ঈদ ইবনু যুবায়র (রহ.) হতে বর্ণিত। তিনি বলেন, ইবনু ‘আব্বাস (রাঃ)-কে জিজ্ঞেস করা হলো যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর ওফাতের সময় আপনি বয়সে কার মত ছিলেন? তিনি বললেনঃ আমি তখন খাত্নাকৃত ছিলাম।[৬৩০০] (আধুনিক প্রকাশনী- ৫৮৫৬, ইসলামিক ফাউন্ডেশন- ৫৭৪৯)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 6301,
			"arabicnumber": 6301,
			"text": "وَمَنْ قَالَ لِصَاحِبِهِ تَعَالَ أُقَامِرْكَ. وَقَوْلُهُ تَعَالَى: (وَمِنَ النَّاسِ مَنْ يَشْتَرِي لَهْوَ الْحَدِيثِ لِيُضِلَّ عَنْ سَبِيلِ اللَّهِ). আর ঐ ব্যক্তির ব্যাপারে, যে তার বন্ধুকে বললো, চলো, আমি তোমার সাথে জুয়া খেলবো। এ প্রসঙ্গে আল্লাহর বাণীঃ ‘মানুষের মধ্যে কেউ কেউ অজ্ঞতাবশতঃ অসার বাক্য ক্রয় করে নেয়।’ (সূরাহ লুকমান ৩১/৬) ৬৩০১. আবূ হুরাইরাহ (রাঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের কেউ যদি শপথ করে এবং তার শপথে বলে লাত ও উযযার শপথ, তা হলে সে যেন لاَ إِلٰهَ إِلاَّ اللهُ বলে, আর যে তার বন্ধুকে বলেঃ এসো আমি তোমার সাথে জুয়া খেলবো সে যেন সদাকাহ করে। (আধুনিক প্রকাশনী- ৫৮৫৭, ইসলামিক ফাউন্ডেশন- ৫৭৫০)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 6302,
			"arabicnumber": 6302,
			"text": "قَالَ أَبُو هُرَيْرَةَ عَنْ النَّبِيِّ صلى الله عليه وسلم مِنْ أَشْرَاطِ السَّاعَةِ إِذَا تَطَاوَلَ رِعَاءُ الْبَهْمِ فِي الْبُنْيَانِ. আবূ হুরাইরাহ (রাঃ) বর্ণনা করেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কিয়ামতের এক নিদর্শন হলো, তখন পশুর রাখালেরা পাকা বাড়ি-ঘর নির্মাণে পারস্পরিক প্রতিযোগিতায় লিপ্ত হবে। ৬৩০২. ইবনু ‘উমার (রাঃ) বর্ণনা করেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর যুগে আমার খেয়াল হলো যে, আমি নিজ হাতে আল্লাহর কোন সৃষ্টির সাহায্য ব্যতীত এমন একটা ঘর বানিয়ে নেই, যা আমাকে বৃষ্টি থেকে রক্ষা করবে এবং আমাকে রোদ থেকে ছায়া দিবে। (আধুনিক প্রকাশনী- ৫৮৫৮, ইসলামিক ফাউন্ডেশন- ৫৭৫১)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 6303,
			"arabicnumber": 6303,
			"text": "ইবনু ‘উমার (রাঃ) বর্ণনা করেন। আল্লাহর কসম! আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর পর থেকে এ পর্যন্ত কোন ইটের উপর ইট রাখিনি। (পাকা ঘর নির্মাণ করিনি) আমি কোন খেজুরের চারা লাগাইনি। সুফ্ইয়ান (রাবী) বর্ণনা করেন, আমি এ হাদীসটি তাঁর পরিবারের এক লোকের কাছে উল্লেখ করলাম। তিনি বললেনঃ আল্লাহর কসম! তিনি তো নিশ্চয়ই পাকা ঘর বানিয়েছেন। সুফ্ইয়ান বলেন, তখন আমি বললাম, তা হলে সম্ভবতঃ এ হাদীসটি তাঁর পাকা ঘর বানানোর আগেকার হবে। (আধুনিক প্রকাশনী- ৫৮৫৯, ইসলামিক ফাউন্ডেশন- ৫৭৫২)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 75
			}
		}
	]
}