{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"84": "Expiation for Unfulfilled Oaths"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6708,
			"arabicnumber": 6708,
			"text": "وَمَا أَمَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ نَزَلَتْ (فَفِدْيَةٌ مِنْ صِيَامٍ أَوْ صَدَقَةٍ أَوْ نُسُكٍ) وَيُذْكَرُ عَنْ ابْنِ عَبَّاسٍ وَعَطَاءٍ وَعِكْرِمَةَ مَا كَانَ فِي الْقُرْآنِ أَوْ أَوْ فَصَاحِبُهُ بِالْخِيَارِ وَقَدْ خَيَّرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَعْبًا فِي الْفِدْيَةِ যখন এ আয়াত অবতীর্ণ হল, তখন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যে নির্দেশ দিয়েছিলেন তা হচ্ছেঃ ‘‘ফিদ্ইয়া-এর মধ্যে সওম, সদাকাহ অথবা কুরবানী করা।’’ (আল-বাকারাহ ২/১৯৬) ইবনু ‘আব্বাস, ‘আত্বা ও ইকরামা (রাঃ) হতে বর্ণিত আছে যে, কুরআন মাজীদে যেখানে أَوْ أَوْ (অথবা, অথবা) শব্দ আছে কুরআনের অনুসারীদের জন্য সেখানে যে কোন একটি পন্থা গ্রহণের অধিকার রয়েছে। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কা‘ব (রাঃ)-কে ফিদ্ইয়া আদায়ের ব্যাপারে যে কোন একটি পন্থা গ্রহণের স্বাধীনতা দিয়েছিলেন। ৬৭০৮. কা‘ব ইবনু উজরা (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি একবার নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট হাযির হলাম। তখন তিনি বললেনঃ কাছে এসো। তখন আমি তাঁর কাছে গেলাম। তখন তিনি বললেনঃ তোমাকে কি তোমার উকুন কষ্ট দিচ্ছে? আমি বললাম, হ্যাঁ। তিনি বললেনঃ সওম অথবা সদাকাহ অথবা কুরবানী করে ফিদ্ইয়া আদায় কর। ইবনু আউন আইউব থেকে আমার নিকট বর্ণনা করেন যে, সওম তিন দিন, কুরবানী একটি বকরী আর মিস্কীনের সংখ্যা হচ্ছে ছয়।[1] [১৮১৪] (আধুনিক প্রকাশনী- ৬২৪১, ইসলামিক ফাউন্ডেশন- ৬২৫১)",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6709,
			"arabicnumber": 6709,
			"text": "وقَوْلِهِ تَعَالَى (قَدْ فَرَضَ اللهُ لَكُمْ تَحِلَّةَ أَيْمَانِكُمْ وَاللهُ مَوْلاَكُمْ وَهُوَ الْعَلِيْمُ الْحَكِيْمُ) আল্লাহর বাণীঃ আল্লাহ তোমাদের জন্য নিজেদের কসমের বাধ্যবাধকতা থেকে নিস্কৃতি পাওয়ার ব্যবস্থা করেছেন, আল্লাহ তোমাদের মালিক-মনিব-রক্ষক, আর তিনি সর্বজ্ঞাতা, মহা প্রজ্ঞার অধিকারী- (সূরাহ আল-বাক্বারাহ ৬৬/১-২)। ৬৭০৯. আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে এক লোক এসে বলল, আমি ধ্বংস হয়ে গেছি। তিনি বললেনঃ তোমার কী হয়েছে? লোকটি বলল, রমযানে (দিনের বেলা) আমি আমার স্ত্রীর সঙ্গে যৌন সঙ্গম করেছি। তিনি বললেনঃ তুমি কি একটি গোলাম আযাদ করতে পার? লোকটি বলল, না। তিনি বললেনঃ তাহলে তুমি কি এক নাগাড়ে দু’ মাস সওম পালন করতে পার? সে বলল, না। তিনি বললেনঃ তা হলে কি তুমি ষাটজন মিস্কীনকে খানা খাওয়াতে পারবে? সে বলল, না। তিনি বললেনঃ বস। লোকটি বসল। তারপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে এক ‘আরক’ আনা হলো যাতে ছিল খেজুর। আর ‘আরক’ হল মাপ করার জন্য বড় ধরণের পাত্র। তিনি বললেনঃ এটা নিয়ে যাও এবং তা সদাকাহ করে দাও। লোকটি বলল, আমার চেয়েও অভাবীকে (তা দান করব)? তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হেসে ফেললেনঃ এমন কি তাঁর মাড়ির দাঁত পর্যন্ত দেখা গেল। তিনি বললেনঃ এটা তোমার পরিজনকেই খাওয়াও।[1] [১৯৩৬] (আধুনিক প্রকাশনী- ৬২৪২, ইসলামিক ফাউন্ডেশন- ৬২৫২)",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6710,
			"arabicnumber": 6710,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, এক লোক রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট এসে বলল, আমি ধ্বংস হয়ে গেছি। তিনি বললেনঃ সেটা কী? লোকটি বলল, রমযানে (দিনের বেলা) আমি স্ত্রী সহবাস করেছি। তিনি বললেনঃ তুমি কি একটি গোলাম আযাদ করতে পারবে? সে বলল, না। তিনি বললেনঃ তাহলে কি তুমি দু’মাস লাগাতার সওম পালন করতে পারবে? সে বলল, না। তাহলে কি তুমি ষাটজন মিস্কীনকে খাদ্য খাওয়াতে পারবে? লোকটি বলল, না। রাবী বলেন, এমন সময় এক আনসার লোক একটি ‘আরক’ নিয়ে আসল। আর আরক হচ্ছে পরিমাপ পাত্র; তার মাঝে খেজুর ছিল। তখন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ এটা নিয়ে গিয়ে সদাকাহ করে দাও। সে বলল, হে আল্লাহর রাসূল! আমার চেয়ে অভাবী লোককে কি তা দান করব? যিনি আপনাকে হকের সাথে পাঠিয়েছেন সেই সত্ত্বার কসম! মদিনার দু’উপত্যকার মাঝে আমার চেয়ে বেশি অভাবী আর কেউ নেই। এরপর রাসূলুল্লাহ্ বললেনঃ যাও, এগুলো নিয়ে তোমার পরিবারকে খাওয়াও। [১৯৩৬] (আধুনিক প্রকাশনী- ৬২৪৩, ইসলামিক ফাউন্ডেশন- ৬২৫৩)",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6711,
			"arabicnumber": 6711,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, এক ব্যক্তি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে এসে বলল, আমি ধ্বংস হয়ে গেছি। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমার কী হয়েছে? লোকটি বলল, রমযানে (দিনের বেলায়) আমি আমার স্ত্রীর সাথে সহবাস করেছি। তিনি বললেনঃ একটি গোলাম আযাদ করার মত তুমি কিছু পাবে কি? সে বলল, না। তিনি বললেনঃ তাহলে তুমি এক নাগাড়ে দু’মাস সওম পালন করতে পারবে কি? সে বলল, না। তিনি বললেনঃ তাহলে তুমি ষাটজন মিস্কীনকে খাওয়াতে পারবে কি? সে বলল, আমার কাছে কিছুই নেই। এমন সময় নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে একটি ‘আরক’ আনা হল, যাতে খেজুর ছিল। তখন তিনি বললেনঃ এটা নাও এবং গিয়ে তা সদাকাহ করে দাও। সে বলল, আমার চেয়ে বেশি অভাবীকে কি দেব? এখানকার দু’ উপত্যকার মাঝে আমাদের চেয়ে অভাবী তো কেউ নেই। তখন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ এটা নিয়ে যাও এবং তোমার পরিবারকে খাওয়াও। [১৯৩৬] (আধুনিক প্রকাশনী- ৬২৪৪, ইসলামিক ফাউন্ডেশন- ৬২৫৪)",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6712,
			"arabicnumber": 6712,
			"text": "সায়িব ইবনু ইয়াযীদ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর যুগে সা‘ ছিল তোমাদের এখনকার মুদ্দের এক মুদ্দ ও এক মুদ্দের তৃতীয়াংশ পরিমাণ। অতঃপর ‘উমার ইবনু আবদুল আযীয (রহ.)-এর যুগে তার পরিমাণ বর্দ্ধিত করা হয়েছে। [১৮৫৯] (আধুনিক প্রকাশনী- ৬২৪৫, ইসলামিক ফাউন্ডেশন- ৬২৫৫)",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6713,
			"arabicnumber": 6713,
			"text": "নাফি‘ (রহ.) হতে বর্ণিত। তিনি বলেন, ইবনু ‘উমার (রাঃ) রমযানের ফিত্রা আদায় করতেন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর মুদ্দ তথা প্রথম মুদ্দ-এর দ্বারা। আর কসমের কাফ্ফারাতেও তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর মুদ্দ ব্যবহার করতেন। আবূ কুতাইবাহ বলেন, মালিক (রাঃ) আমাদেরকে বলেছেন যে, আমাদের মুদ্দ তোমাদের মুদ্দের চেয়ে বড়। আর আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর মুদ্দেই ফাযীলাত দেখতে পাই। রাবী বলেন, আমাকে মালিক (রহ.) বলেছেনঃ তোমাদের কাছে কোন শাসক এসে যদি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর মুদ্দ থেকে তোমাদের মুদ্দকে ছোট করে দেন, তাহলে তোমরা কিসের মাধ্যমে (ওযন করে) মানুষদেরকে দিতে? আমি বললাম, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর মুদ্দ দিয়েই দিতাম। তিনি বললেন, তোমরা কি দেখছ না যে, সাম্প্রতিককালে লেনদেনের বিষয়টি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর মুদ্দের দিকে ফিরে যাচ্ছে। (আধুনিক প্রকাশনী- ৬২৪৬, ইসলামিক ফাউন্ডেশন- ৬২৫৬)",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6714,
			"arabicnumber": 6714,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দু‘আ করেছেনঃ হে আল্লাহ্! তুমি তাদের পরিমাপে সা‘-এ এবং মুদ্দে বারাকাত দান কর। [২১৩০] (আধুনিক প্রকাশনী- ৬২৪৭, ইসলামিক ফাউন্ডেশন- ৬২৫৭)",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6715,
			"arabicnumber": 6715,
			"text": "আবূ হুরাইরাহ (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেছেনঃ যে লোক একটি মুসলিম গোলাম আযাদ করবে আল্লাহ্ সে গোলামের প্রত্যেকটি অঙ্গের বিনিময়ে জাহান্নামের আগুন হতে তার প্রত্যেকটি অঙ্গকে মুক্ত করবেন। এমন কি গোলামের গুপ্তাঙ্গের বিনিময়ে তার গুপ্তাঙ্গকেও।[1] [২৮১৭] (আধুনিক প্রকাশনী- ৬২৪৮, ইসলামিক ফাউন্ডেশন- ৬২৫৮)",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6716,
			"arabicnumber": 6716,
			"text": "জাবির (রাঃ) হতে বর্ণিত যে, আনসার গোত্রের এক লোক তার গোলামকে মুদাবিবর বানালো (মনিবের মৃত্যু হলে গোলাম মুক্ত হয়ে যাবে)। ঐ গোলাম ছাড়া তার আর কোন মাল ছিল না। খবরটি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে পৌঁছল। তিনি বললেনঃ গোলামটিকে আমার নিকট হতে কে কিনে নেবে? নু‘আয়ম ইবনু নাহ্হা (রাঃ) তাকে আটশ’ দিরহামের বিনিময়ে কিনে নিল। রাবী ‘আমর (রাঃ) বলেন, আমি জাবির ইবনু ‘আবদুল্লাহ্ (রাঃ)-কে বলতে শুনেছি যে, গোলামটি ছিল কিব্তী আর (আযাদ করার) প্রথম বর্ষেই সে মারা গিয়েছিল। [২১৪১] (আধুনিক প্রকাশনী- ৬২৪৯, ইসলামিক ফাউন্ডেশন- ৬২৫৯)",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6717,
			"arabicnumber": 6717,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত যে, তিনি বারীরা নামক বাঁদীকে কিনতে চাইলে তার মালিকগণ শর্ত আরোপ করল যে এর পরিত্যক্ত সম্পদের মালিক তারাই হবে। ‘আয়িশাহ (রাঃ) বিষয়টি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে উল্লেখ করলে তিনি বললেনঃ তুমি তাকে কিনে নাও। কেননা আযাদকৃত ব্যক্তির পরিত্যক্ত সম্পদের মালিকানা ঐ ব্যক্তির জন্য যে তাকে আযাদ করে। (আধুনিক প্রকাশনী- ৬২৫০, ইসলামিক ফাউন্ডেশন- ৬২৬০)",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6718,
			"arabicnumber": 6718,
			"text": "আবূ মূসা আল-আশ‘আরী (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি একবার কতক আশ‘আরী লোকের সাথে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে একটি বাহন চাওয়ার জন্য এলাম। তিনি বললেনঃ আল্লাহর কসম! আমি তোমাদেরকে বাহন দিতে পারব না। আমার কাছে কিছু নেই যা বাহন হিসাবে তোমাদেরকে দিতে পারি। অতঃপর আল্লাহ্ যতক্ষণ চাইলেন আমরা অবস্থান করলাম। এমন সময় তাঁর কাছে কিছু উট আনা হল। তখন তিনি আমাদেরকে তিনটি উট দেয়ার নির্দেশ দিলেন। আমরা যখন রওনা দিলাম, তখন আমরা বলাবলি করলাম যে, আল্লাহ্ আমাদের বরকত দেবেন না। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে বাহন চাওয়ার জন্য যখন এলাম তখন তিনি আমাদেরকে বাহন দেবেন না বলে শপথ করলেন। তারপরেও আমাদেরকে বাহন দিলেন। আবূ মূসা বলেন, আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে আসলাম এবং বিষয়টি তাঁর কাছে উল্লেখ করলাম। তখন তিনি বললেনঃ আমি তো তোমাদেরকে বাহন দেইনি; বরং আল্লাহ্ দিয়েছেন। আল্লাহর শপথ! ইনশাআল্লাহ্ আমি যখন কোন ব্যাপারে শপথ করি আর তার উল্টোটির মাঝে কল্যাণ দেখতে পাই তখন কসমের কাফ্ফারা আদায় করি। আর যেটি কল্যাণকর সেটিই করি। [৩১৩৩] (আধুনিক প্রকাশনী- ৬২৫১ , ইসলামিক ফাউন্ডেশন- ৬২৬১)",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6719,
			"arabicnumber": 6719,
			"text": "হাম্মাদ (রহ.) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমি আমার কসমের কাফ্ফারা আদায় করি আর যেটি কল্যাণকর সেটি করি। অথবা বলেছেনঃ যেটি কল্যাণকর সেটি করি এবং আর (কসমের) কাফ্ফারা আদায় করি। [৩১৩৩] (আধুনিক প্রকাশনী- ৬২৫২, ইসলামিক ফাউন্ডেশন- ৬২৬২)",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6720,
			"arabicnumber": 6720,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, সুলায়মান (আঃ) একবার বলেছিলেন যে, অবশ্যই আজ রাতে আমি নব্বইজন স্ত্রীর সাথে মিলিত হব। তারা প্রত্যেকেই পুত্র সন্তান জন্ম দিবে যারা আল্লাহর রাস্তায় জিহাদ করবে। তখন তার সাথী (রাবী সুফ্ইয়ান সাথী দ্বারা ফেরেশতা বুঝিয়েছেন) তাকে বলল, আপনি ইনশাআল্লাহ্ বলুন। কিন্তু তিনি তা ভুলে গেলেন এবং স্ত্রীদের সঙ্গে মিলিত হলেন। কিন্তু একজন ছাড়া অন্য কোন স্ত্রীর কোন সন্তান হল না; আর সেটাও ছিল অপূর্ণাঙ্গ। আবূ হুরাইরাহ (রাঃ) এ ঘটনা প্রসঙ্গে বলেন যে, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তিনি কসমের মাঝে ইনশা আল্লাহ্ বললে তাঁর কসমও ভঙ্গ হত না, আর উদ্দেশ্যও পূর্ণ হত।[1] একবার আবূ হুরাইরাহ (রাঃ) এরূপ বর্ণনা করলেন যে, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তিনি যদি ‘ইস্তিসনা’ করতেন (অর্থাৎ ইনশা আল্লাহ্ বলতেন)। আবূ যিনাদ আ‘রাজের সূত্রে আবূ হুরাইরাহ (রাঃ) বর্ণিত হাদীসের মত বর্ণনা করেছেন। (আধুনিক প্রকাশনী- ৬২৫৩, ইসলামিক ফাউন্ডেশন- ৬২৬৩)",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6721,
			"arabicnumber": 6721,
			"text": "যাহদাম জারমী (রহঃ) হতে বর্ণিত। তিনি বলেন, আমরা একবার আবূ মূসা আশ‘আরী (রাঃ)-এর নিকট ছিলাম। আমাদের এবং জার্ম সম্প্রদায়ের মাঝে ভ্রাতৃভাব ও সুসম্পর্ক বজায় ছিল। রাবী বলেন, তার জন্য খানা হাজির করা হল, আর তাতে ছিল মুরগীর গোশত। তাদের দলের মাঝে বানী তাইমিল্লাহ্ সম্প্রদায়ের এক লোক ছিল যার গায়ের রং ছিল লাল যেন দেখতে গোলাম। রাবী বলেন, লোকটি খানার কাছেও গেল না। আবূ মূসা আশ‘আরী তাকে বললেন, কাছে এসো (খানা খাও) কেননা, আমি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে এর গোশ্ত খেতে দেখেছি। লোকটি বলল, আমি একে (মুরগীকে) কিছু খেতে দেখেছি; তাই আমি এটিকে ঘৃণা করি। আর আমি হলফ করেছি যে, আমি এটি কক্ষনো খাব না। আবূ মূসা (রাঃ) বলেন, কাছে এসো; আমি তোমাকে এ সম্পর্কে জানাচ্ছি। একবার আমরা আশ‘আরী গোত্রের একটি দলের সাথে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে বাহন চাওয়ার জন্য এলাম। তখন তিনি যাকাতের উট বণ্টন করছিলেন। আইয়্যুব বলেন, আমার মনে হয় তিনি তখন রাগান্বিত হয়ে বলেছিলেনঃ আল্লাহর কসম! আমি তোমাদেরকে বাহন দিব না। আমার কাছে কোন বাহন নেই। রাবী বলেন, তখন আমরা চলে গেলাম। এমন সময় তাঁর নিকট যুদ্ধে প্রাপ্ত কয়েকটি উট আনা হল। তিনি বললেনঃ ঐ আশ‘আরী লোকগুলো কোথায়? ঐ আশ‘আরী লোকগুলো কোথায়? তখন আমরা ফিরে এলাম এবং রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পাঁচটি মোটা তাজা সুন্দর উট আমাদেরকে দেয়ার জন্য নির্দেশ দিলেন। আমরা উটগুলো নিয়ে রওনা হলাম। তখন আমি আমার সাথীদের বললাম, আমরা রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে বাহন চাওয়ার জন্য এসেছিলাম। আর তিনি আমাদেরকে বাহন দিবেন না বলে কসম করেছিলেন। কিন্তু তারপর আমাদের কাছে লোক পাঠালেন এবং আমাদেরকে বাহন দিলেন। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর কসম ভূলে গেছেন। আল্লাহর কসম! আমরা যদি রাসূলুল্লাহ্কে সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর কসম সম্পর্কে গাফেল রাখি তাহলে তো আমরা কখনও সফলকাম হব না। চল, আমরা রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে ফিরে যাই এবং তাঁর কসমের কথা স্মরণ করিয়ে দেই। অতঃপর আমরা ফিরে গিয়ে বললাম, হে আল্লাহর রাসূল! আমরা আপনার কাছে বাহন চাওয়ার জন্য এসেছিলাম, আপনি আমাদেরকে বাহন দিবেন না বলে কসম করেছিলেন। কিন্তু পরে আবার বাহন দিলেন। এতে আমরা ধারণা করলাম বা বুঝতে পারলাম, আপনি আপনার কসমের কথা ভুলে গেছেন। তখন তিনি বললেনঃ তোমরা চলে যাও। আল্লাহ্ই তো তোমাদেরকে বাহন দিয়েছেন। আল্লাহর কসম! নিশ্চয়ই আমি যখন আল্লাহর ইচ্ছায় কোন ব্যাপারে কসম করি আর অন্যটির ভিতর কল্যাণ দেখতে পাই তখন যেটার মাঝে কল্যাণ আছে সেটা করি এবং কসমের কাফ্ফারা আদায় করে দেই। হাম্মাদ ইবনু যায়দ, আইউব, আবূ কিলাবা এবং কাসিম ইবনু আসিম কুলায়বী (রহ.) থেকে এ হাদীসে ইসমাঈল ইবনু ইব্রাহীমের অনুসরণ করেছেন। [৩১৩৩] (আধুনিক প্রকাশনী- ৬২৫৪, ইসলামিক ফাউন্ডেশন- ৬২৬৪) কুতায়বা সূত্রে যাহদাম (রাঃ) থেকে এরকমই বর্ণিত আছে। (ইসলামিক ফাউন্ডেশন- ৬২৬৫) আবূ মা‘মার সূত্রে যাহদাম (রাঃ) থেকেও এরকমই বর্ণিত আছে। (ইসলামিক ফাউন্ডেশন- ৬২৬৬)",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6722,
			"arabicnumber": 6722,
			"text": "‘আবদুর রাহমান ইবনু সামুরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তুমি নেতৃত্ব চেও না। কেননা, চাওয়া ছাড়া যদি তোমাকে তা দেয়া হয় তাহলে তোমাকে তাতে সাহায্য করা হবে। আর যদি চাওয়ার পর তা তোমাকে দেয়া হয়, তবে তা তোমার দায়িত্বেই ছেড়ে দেয়া হবে (অর্থাৎ এর ভাল মন্দের দায়িত্ব তোমারই থাকবে)। তুমি যখন কোন বিষয়ে কসম কর আর অন্যটির মাঝে কল্যাণ দেখতে পাও, তখন যেটার মাঝে কল্যাণ সেটাই কর। আর তোমার কসমের কাফ্ফারা আদায় করে দাও। [৬৬২২] আশহাল ইবনু হাতিম, ইবনু আউন থেকে এবং উস্মান ইবনু আমার-এর অনুসরণ করেছেন এবং ইউনুস, সিমাক ইবনু আতিয়্যা, সিমাক ইবনু হারব্, হুমায়দ, ক্বাতাদাহ্, মানসুর, হিশাম ও রাবী‘ উক্ত বর্ণনায় ইবনু আউন-এর অনুসরণ করেছেন। (আধুনিক প্রকাশনী- ৬২৫৫, ইসলামিক ফাউন্ডেশন- ৬২৬৭)",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 15
			}
		}
	]
}