{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"86": "Limits and Punishments set by Allah (Hudood)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6772,
			"arabicnumber": 6772,
			"text": "بَابُ مَا يُحْذَرُ مِنَ الْحُدُودِ অধ্যায়: শারীয়াতের ব্যাপারে ভীতি প্রদর্শন وَقَالَ ابْنُ عَبَّاسٍ يُنْزَعُ مِنْهُ نُورُ الإِيمَانِ فِي الزِّنَا ইবনু ‘আব্বাস (রাঃ) বলেছেন, যিনার কারণে ঈমানের জ্যোতি দূর হয়ে যায়। ৬৭৭২. আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যিনাকার যখন যিনায় লিপ্ত হয় তখন সে মু’মিন থাকে না। কেউ যখন মদপান করে তখন সে মু’মিন থাকে না। যে চুরি করে চুরি করার সময় মু’মিন থাকে না এবং কোন ছিনতাইকারী এমনভাবে ছিনতাই করে যে, মানুষ তার দিকে অসহায় হয়ে তাকিয়ে থাকে; তখন সে মু’মিন থাকে না।[2] ইবনু শিহাব (রহ.) ..... আবূ হুরাইরাহ (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে এরকমই বর্ণনা করেন। কিন্তু তাতে النُّهْبَةَ এর উল্লেখ নেই। [২৪৭৫] (আধুনিক প্রকাশনী- ৬৩০৩, ইসলামিক ফাউন্ডেশন- ৬৩১৫)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6773,
			"arabicnumber": 6773,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মদ পানের জন্য গাছের ডাল এবং জুতা দ্বারা মেরেছেন। আর আবূ বাকর (রাঃ) চল্লিশ চাবুক লাগিয়েছেন। [৬৭৭৬; মুসলিম ২৯/৮, হাঃ ১৭০৬, আহমাদ ১২৮০৫] (আধুনিক প্রকাশনী- ৬৩০৪, ইসলামিক ফাউন্ডেশন- ৬৩১৬)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6774,
			"arabicnumber": 6774,
			"text": "‘উকবাহ ইবনু হারিস (রাঃ) হতে বর্ণিত। তিনি বলেন, নু‘আয়মান অথবা (রাবীর সন্দেহ) নু‘আয়মানের পুত্রকে মদ্যপায়ী অবস্থায় আনা হল। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর ঘরে যারা ছিল তাদেরকে নির্দেশ দিলেন তাকে প্রহার করার জন্যে। রাবী বলেন, তারা তাকে প্রহার করল, যারা তাকে জুতা মেরেছিল তাদের মাঝে আমিও ছিলাম।[1] [২৩১৬] (আধুনিক প্রকাশনী- ৬৩০৫, ইসলামিক ফাউন্ডেশন- ৬৩১৭)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6775,
			"arabicnumber": 6775,
			"text": "‘উকবাহ ইবনু হারিস (রাঃ) হতে বর্ণিত। একবার নু‘আয়মান অথবা (রাবীর সন্দেহ) নু‘আয়মানের পুত্রকে নেশাগ্রস্ত অবস্থায় নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে আনা হল। তার অবস্থা দেখে তিনি দুঃখিত হলেন। তখন ঘরের ভিতরে যারা ছিল তিনি তাদেরকে হুকুম করলেন তাকে মারার জন্যে। তাই তারা তাকে গাছের ডাল এবং জুতা দিয়ে মারল। রাবী বলেন, যারা তাকে মেরেছিল, আমিও তাদের মাঝে ছিলাম। [২৩১৬] (আধুনিক প্রকাশনী- ৬৩০৬, ইসলামিক ফাউন্ডেশন- ৬৩১৮)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6776,
			"arabicnumber": 6776,
			"text": "আনাস (রাঃ) হতে বর্ণিত। তিনি বলেন, মদপানের অপরাধে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম গাছের ডাল এবং জুতা দিয়ে পিটিয়েছেন। আবূ বাকর (রাঃ) চল্লিশটি চাবুক মেরেছেন। [৬৭৭৩] (আধুনিক প্রকাশনী- ৬৩০৭, ইসলামিক ফাউন্ডেশন- ৬৩১৯)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6777,
			"arabicnumber": 6777,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে এক লোককে আনা হল, সে মদ পান করেছিল। তিনি বললেনঃ তোমরা একে প্রহার কর। আবূ হুরাইরাহ (রাঃ) বলেন, তখন আমাদের মাঝে কেউ হাত দিয়ে প্রহার করল, কেউ জুতা দিয়ে মারল, আর কেউ কাপড় দিয়ে মারল। মার-ধোর যখন থামল তখন কেউ বলে উঠল, আল্লাহ্ তোমাকে লাঞ্ছিত করুন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ এমন বলো না, শয়তানকে এর বিরুদ্ধে সাহায্য করো না। [৬৭৮১] (আধুনিক প্রকাশনী- ৬৩০৮, ইসলামিক ফাউন্ডেশন- ৬৩২০)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6778,
			"arabicnumber": 6778,
			"text": "‘আলী ইবনু আবূ তালিব (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি কাউকে শরীয়াতের দন্ড দেয়ার সময় সে তাতে মরে গেলে আমার দুঃখ হয় না। কিন্তু মদ পানকারী ছাড়া। সে মারা গেলে আমি জরিমানা দিয়ে থাকি। কেননা রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এ শাস্তির ব্যাপারে কোন সীমা নির্ধারণ করেননি। [মুসলিম ২৯/৮, হাঃ ১৭০৭] (আধুনিক প্রকাশনী- ৬৩০৯, ইসলামিক ফাউন্ডেশন- ৬৩২১)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6779,
			"arabicnumber": 6779,
			"text": "সাইব ইবনু ইয়াযীদ (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর যুগে ও আবূ বাকর (রাঃ)-এর খিলাফাত কালে এবং ‘উমার (রাঃ)-এর খিলাফাতের প্রথম দিকে আমাদের কাছে যখন কোন মদ্যপায়ীকে আনা হত তখন আমরা তাকে হাত দিয়ে, জুতা দিয়ে এবং আমাদের চাদর দিয়ে মারতাম। অতঃপর ‘উমার (রাঃ)-তাঁর খিলাফাতের শেষ সময়ে চল্লিশটি ক’রে চাবুক মেরেছেন। আর এ সব মদ্যপায়ী যখন বাড়াবাড়ি করেছে এবং পাপে লিপ্ত হয়েছে তখন আশিটি করে চাবুক লাগিয়েছেন। (আধুনিক প্রকাশনী- ৬৩১০, ইসলামিক ফাউন্ডেশন- ৬৩২২)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6780,
			"arabicnumber": 6780,
			"text": "‘উমার ইবনু খাত্তাব (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর যুগে এক লোক যার নাম ছিল ‘আবদুল্লাহ্ আর ডাকনাম ছিল হিমার। এ লোকটি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে হাসাত। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম শরাব পান করার অপরাধে তাকে বেত্রাঘাত করেছিলেন। একদিন তাকে নেশাগ্রস্ত অবস্থায় আনা হল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে চাবুক মারার আদেশ দিলেন। তাকে চাবুক মারা হল। তখন দলের মাঝ থেকে এক লোক বলল, হে আল্লাহ্! তার উপর লা‘নত বর্ষণ করুন! নেশাগ্রস্ত অবস্থায় তাকে কতবার যে আনা হল! তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তাকে লা‘নত করো না। আল্লাহর কসম! আমি জানি যে, সে আল্লাহ্ এবং তাঁর রাসূলকে ভালবাসে।[1] (আধুনিক প্রকাশনী- ৬৩১১, ইসলামিক ফাউন্ডেশন- ৬৩২৩)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6781,
			"arabicnumber": 6781,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, একবার নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট একটি নেশাগ্রস্ত লোককে আনা হল। তিনি তাকে মারার জন্য দাঁড়ালেন। তখন আমাদের কেউ তাকে হাত দিয়ে, কেউ জুতা দিয়ে আর কেউ বা কাপড় দিয়ে মারল। লোকটি চলে গেলে, এক লোক বলল, এর কী হল, আল্লাহ্ তাকে অপমানিত করলেন। তখন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আপন ভাইয়ের বিরুদ্ধে শয়তানের সাহায্যকারী হয়ো না। [৬৭৭৭] (আধুনিক প্রকাশনী- ৬৩১২, ইসলামিক ফাউন্ডেশন- ৬৩২৪)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6782,
			"arabicnumber": 6782,
			"text": "ইবনু ‘আব্বাস (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেন, ব্যভিচারী যখন ব্যভিচার করে, তখন সে মু’মিন থাকে না। এবং চোর যখন চুরি করে তখন সে মু’মিন থাকে না।[1] [৬৮০৯] (আধুনিক প্রকাশনী- ৬৩১৩, ইসলামিক ফাউন্ডেশন- ৬৩২৫)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6783,
			"arabicnumber": 6783,
			"text": "আবূ হুরাইরাহ (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেন, চোরের উপর আল্লাহর লা‘নত হোক, যখন সে একটি হেলমেট চুরি করে এবং এ জন্য তার হাত কাটা হয় এবং সে একটি রশি চুরি করে এ জন্য তার হাত কাটা হয়। আ’মাশ (রহ.) বলেন, তারা মনে করত যে, হেলমেট লোহার হতে হবে আর রশির ব্যাপারে তারা ধারণা করত তা কয়েক দিরহামের সমমূল্যের হবে। [৬৭৯৯; মুসলিম ২৯/১, হাঃ ১৬৮৭, আহমাদ ৭৪৪০] (আধুনিক প্রকাশনী- ৬৩১৪, ইসলামিক ফাউন্ডেশন- ৬৩২৬)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6784,
			"arabicnumber": 6784,
			"text": "‘উবাদাহ ইবনু সামিত (রাঃ) হতে বর্ণিত। তিনি বলেন, আমরা একবার নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট এক মজলিসে ছিলাম। তখন তিনি বললেনঃ তোমরা আমার কাছে এ বায়‘আত কর যে, আল্লাহর সঙ্গে কোন কিছু শরীক করবে না, চুরি করবে না এবং ব্যভিচার করবে না। এরপর তিনি এ আয়াত পুরো তিলাওয়াত করলেনঃ ‘‘তোমাদের মধ্যে যে ব্যক্তি (বায়‘আতের শর্তসমূহ) পুরো করে তার বিনিময় আল্লাহর কাছে। আর যে ব্যক্তি এত্থেকে কিছু ক’রে বসে আর তার জন্য শাস্তি দেয়া হয়, তবে এটা তার জন্য কাফ্ফারা হয়ে যায়। আর যদি কেউ এত্থেকে কিছু করে বসে আর আল্লাহ্ তা গোপন রাখেন তবে এটা তাঁর ইচ্ছেধীন। তিনি ইচ্ছে করলে তাকে ক্ষমা করবেন, ইচ্ছে করলে শাস্তি দিবেন।’’ [৮১] (আধুনিক প্রকাশনী- ৬৩১৫, ইসলামিক ফাউন্ডেশন- ৬৩২৭)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6785,
			"arabicnumber": 6785,
			"text": "‘আবদুল্লাহ্ ইবনু মাস‘ঊদ (রাঃ) হতে বর্ণিত যে, তিনি বলেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বিদায় হাজ্জে বললেনঃ আচ্ছা বলতো কোন্ মাসকে তোমরা সবচেয়ে সম্মানিত বলে জান? তাঁরা বললেন, আমাদের এ মাস নয় কি? তিনি আবার বললেনঃ তোমরা কোন্ শহরকে সর্বাধিক সম্মানিত বলে জান? তাঁরা বললেন, আমাদের এ শহর নয় কি? তিনি বললেনঃ বলতো! কোন্ দিনকে তোমরা সর্বাধিক সম্মানিত বলে জান? তাঁরা বললেন, আমাদের এ দিন নয় কি? তখন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আল্লাহ্ তোমাদের রক্ত, ধন-সম্পদ ও সম্মানকে শারী‘আতের হক ব্যতীত এমন পবিত্র করে দিয়েছেন, যেমন পবিত্র তোমাদের এ মাসে এ শহরের মাঝে আজকের এ দিনটি। ওহে! আমি কি পৌঁছে দিয়েছি? এ কথাটি তিনি তিনবার বললেন। প্রত্যেকবারেই তারা উত্তর দিলেন, হ্যাঁ। তিনি বললেনঃ তোমাদের জন্য আফসোস অথবা ধ্বংস! তোমরা আমার পরে একে অপরের গর্দান মেরে কাফির হয়ে পেছনের দিকে ফিরে যেও না।[1] ১৭৪২] (আধুনিক প্রকাশনী- ৬৩১৬, ইসলামিক ফাউন্ডেশন- ৬৩২৮)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6786,
			"arabicnumber": 6786,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে যখনই (আল্লাহর নিকট থেকে) দু’টো কাজের মধ্যে একটিকে বেছে নেয়ার সুযোগ দেয়া হত, তখন তিনি দু’টোর সহজটি বেছে নিতেন, যতক্ষণ না সেটা গুনাহর কাজ হত। যদি সেটা গুনাহর কাজ হত তাহলে তিনি তাত্থেকে বহু দূরে থাকতেন। আল্লাহর কসম! তিনি কখনও তাঁর ব্যক্তিগত কারণে কোন কিছুর প্রতিশোধ গ্রহণ করেননি, যতক্ষণ না আল্লাহর হারামসমূহকে ছিন্ন করা হত। সেক্ষেত্রে আল্লাহর জন্য তিনি প্রতিশোধ নিতেন।[1] [৩৫৬০] (আধুনিক প্রকাশনী- ৬৩১৭, ইসলামিক ফাউন্ডেশন- ৬৩২৯)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 6787,
			"arabicnumber": 6787,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত যে, উসামাহ (রাঃ) এক মহিলার ব্যাপারে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে সুপারিশ করলেন। তখন তিনি বললেনঃ তোমাদের আগেকার সম্প্রদায়সমূহ ধ্বংস হয়ে গেছে। কারণ তারা নিম্নশ্রেণীর লোকদের উপর শারী‘আতের শাস্তি কায়িম করত। আর শরীফ লোকদের অব্যাহতি দিত। ঐ সত্তার কসম, যাঁর হাতে আমার জান, ফাতিমাও যদি এমন কাজ করত, তাহলে অবশ্যই আমি তার হাত কেটে দিতাম।[1] [২৬৪৮] (আধুনিক প্রকাশনী- ৬৩১৮, ইসলামিক ফাউন্ডেশন- ৬৩৩০)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 6788,
			"arabicnumber": 6788,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। মাখযুমী গোত্রের এক মহিলার ব্যাপারে কুরাইশ বংশের লোকদের খুব দুশ্চিন্তায় ফেলে দিয়েছিল যে চুরি করেছিল। সহাবাগণ বললেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে কে কথা বলতে পারবে? আর রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর প্রিয় জন উসামাহ (রাঃ) ছাড়া এটা কেউ করতে পারবে না। তখন উসামাহ (রাঃ) রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে কথা বললেন। এতে তিনি বললেনঃ তুমি আল্লাহর শাস্তির বিধানের ব্যাপারে সুপারিশ করছ? এরপর তিনি দাঁড়িয়ে খুৎবাহ দিলেন এবং বললেনঃ হে মানবমন্ডলী! নিশ্চয়ই তোমাদের আগের লোকেরা গুমরাহ হয়ে গিয়েছে। কারণ, কোন সম্মানী ব্যক্তি যখন চুরি করত তখন তারা তাকে ছেড়ে দিত। আর যখন কোন দুর্বল লোক চুরি করত তখন তার উপর শরীয়াতের শাস্তি কায়েম করত। আল্লাহর কসম! মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কন্যা ফাতিমাও যদি চুরি করে তবে অবশ্যই মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর হাত কেটে দেবে।[1] [২৬৪৮] (আধুনিক প্রকাশনী- ৬৩১৯, ইসলামিক ফাউন্ডেশন- ৬৩৩১)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 6789,
			"arabicnumber": 6789,
			"text": "وَفِي كَمْ يُقْطَعُ وَقَطَعَ عَلِيٌّ مِنْ الْكَفِّ وَقَالَ قَتَادَةُ فِي امْرَأَةٍ سَرَقَتْ فَقُطِعَتْ شِمَالُهَا لَيْسَ إِلاَّ ذَلِكَ কী পরিমাণ মাল চুরি করলে হাত কাটা যাবে। ‘আলী (রাঃ) কব্জি পর্যন্ত কেটেছিলেন। আর ক্বাতাদাহ (রাঃ) এক মহিলা সম্পর্কে বলেছেন যে চুরি করেছিল, এতে তার বাম হাত কাটা হয়েছিল। এ ব্যতীত আর কোন শাস্তি দেয়া হয়নি। ৬৭৮৯. ‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ দ্বীনারের চার ভাগের এক ভাগ বা এর বেশি বা ততোধিক চুরি করলে হাত কাটা যাবে। ‘আবদুর রহমান ইবনু খালিদ (রহ.) ইবনু ‘আখী যুহরী (রহ.) ও মা‘মার (রহ.).....যুহরী (রহ.) থেকে ইবরাহীম ইবনু সা‘দ (রহ.) এর অনুসরণে বর্ণনা করেছেন। [৬৭৯০, ৬৭৯১; মুসলিম ২৯/১, হাঃ ১৬৮৪, আহমাদ ২৪৭৭৯] (আধুনিক প্রকাশনী- ৬৩২০, ইসলামিক ফাউন্ডেশন- ৬৩৩২)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 6790,
			"arabicnumber": 6790,
			"text": "‘আয়িশাহ (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেনঃ এক দ্বীনারের চার ভাগের এক ভাগ চুরি করলে হাত কাটা হবে। [৬৭৮৯] (আধুনিক প্রকাশনী- ৬৩২১, ইসলামিক ফাউন্ডেশন- ৬৩৩৩)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 6791,
			"arabicnumber": 6791,
			"text": "‘আয়িশাহ (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেছেনঃ এক দ্বীনারের চার ভাগের এক ভাগ (মূল্যের দ্রব্য) চুরি করলে হাত কাটা যাবে। [৬৭৮৯; মুসলিম ২৯/১, হাঃ ১৬৮৪, আহমাদ ২৪৭৭৯] (আধুনিক প্রকাশনী- ৬৩২২, ইসলামিক ফাউন্ডেশন- ৬৩৩৪)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 6792,
			"arabicnumber": 6792,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর যামানায় কোন চামড়া নির্মিত ঢাল বা সাধারণ ঢালের সমান মূল্যের জিনিস চুরি করা ব্যতীত হাত কাটা হত না। (আধুনিক প্রকাশনী- ৬৩২৩, ইসলামিক ফাউন্ডেশন- ৬২২২) ‘উসমান, হুমায়দ ইবনু ‘আবদুর রহমান ...... ‘আয়িশাহ (রাঃ) থেকে ঐ রকম বর্ণনা করেছেন। [মুসলিম ২৯/১, হাঃ ১৬৮৫] (আধুনিক প্রকাশনী- নাই, ইসলামিক ফাউন্ডেশন- ৬৩৩৫)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 6793,
			"arabicnumber": 6793,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, চামড়ার ঢাল বা সাধারণ ঢাল যার প্রতিটির মূল্য আছে, এর চেয়ে কম চুরি করলে [রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর যামানায়] হাত কাটা হত না। [৬৭৯৩, ৬৭৯৪] (আধুনিক প্রকাশনী- ৬৩২৪, ইসলামিক ফাউন্ডেশন- ৬৩৩৬)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 6794,
			"arabicnumber": 6794,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর যামানায় কোন চোরের হাত কাটা হত না যদি সে একটি চামড়ার ঢাল বা সাধারণ ঢালের প্রতিটির মূল্যের চেয়ে কম মূল্যের কিছু চুরি করত। [৬৭৯২; মুসলিম ২৯/১, হাঃ ১৬৮৫] (আধুনিক প্রকাশনী- ৬৩২৫, ইসলামিক ফাউন্ডেশন- ৬৩৩৭) ওয়াকী' (রহ.) ও ইবনু ইদরিস (রহ.) ‘উরওয়াহ (রহ.) থেকে মুরসাল সূত্রে বর্ণনা করেছেন। (আধুনিক প্রকাশনী- নাই, ইসলামিক ফাউন্ডেশন- ৬৩৩৮)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 6795,
			"arabicnumber": 6795,
			"text": "‘আবদুল্লাহ্ ইবনু ‘উমার (রাঃ) হতে বর্ণিত যে, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঢাল চুরির বেলায় হাত কেটেছেন, যার মূল্য ছিল তিন দিরহাম। মুহাম্মাদ ইবনু ইসহাক এবং লায়স বলেন, নাফি‘ বলেছেনঃ তার মূল্যমান। [৬৭৯২; মুসলিম ২৯/১, হাঃ ১৬৮৬, আহমাদ ৪৫০৩] (আধুনিক প্রকাশনী- ৬৩২৭, ইসলামিক ফাউন্ডেশন- ৬৩৩৮)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 6796,
			"arabicnumber": 6796,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঢাল চুরির ব্যাপারে হাত কেটেছেন, যার মূল্য ছিল তিন দিরহাম। [৬৭৯৬, ৬৭৯৮] (আধুনিক প্রকাশনী- ৬৩২৬, ইসলামিক ফাউন্ডেশন- ৬৩৩৯)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 6797,
			"arabicnumber": 6797,
			"text": "‘আবদুল্লাহ্ ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঢাল চুরির ব্যাপারে হাত কেটেছেন, যার মূল্য ছিল তিন দিরহাম। [৬৭৯৫] (আধুনিক প্রকাশনী- ৬৩২৮, ইসলামিক ফাউন্ডেশন- ৬৩৪০)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 6798,
			"arabicnumber": 6798,
			"text": "‘আবদুল্লাহ্ ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তিন দিরহাম মূল্যের ঢাল চুরির জন্য চোরের হাত কেটেছেন। মুহাম্মাদ ইবনু ইসহাক এবং লায়স বলেন, নাফি‘ বলেছেনঃ তার মূল্যমান। [৬৭৯৫; মুসলিম ২৯/১, হাঃ ১৬৮৬, আহমাদ ৪৫০৩] (আধুনিক প্রকাশনী- ৬৩২৯, ইসলামিক ফাউন্ডেশন- ৬৩৪১)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 6799,
			"arabicnumber": 6799,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, আল্লাহর লা‘নত বর্ষিত হয় চোরের উপর যে একটি ডিম চুরি করেছে তাতে তার হাত কাটা গেছে বা একটি দড়ি চুরি করেছে যার ফলে তার হাত কাটা গেছে। [৬৭৮৩] (আধুনিক প্রকাশনী- ৬৩৩০ ইসলামিক ফাউন্ডেশন- ৬৩৪২)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 6800,
			"arabicnumber": 6800,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক মহিলার হাত কেটেছেন। ‘আয়িশাহ (রাঃ) বলেন, সে মহিলাটি এরপরও আসত। আর আমি তার প্রয়োজনকে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে তুলে ধরতাম। মহিলাটি তওবা করেছিল এবং সুন্দর হয়েছিল তার তওবা। [২৬৪৮] (আধুনিক প্রকাশনী- ৬৩৩১, ইসলামিক ফাউন্ডেশন- ৬৩৪৪)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 6801,
			"arabicnumber": 6801,
			"text": "‘উবাদাহ ইবনু সামিত (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি একটি দলের সঙ্গে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে বায়‘আত করেছি। তিনি বললেনঃ আমি তোমাদের এ মর্মে বায়‘আত করছি যে, তোমরা আল্লাহর সাথে কোন কিছুকে শরীক করবে না, চুরি করবে না, তোমাদের সন্তান হত্যা করবে না, সামনে বা পিছনে কারো অপবাদ দিবে না, শারীয়াত সম্মত কাজে আমার অবাধ্যতা করবে না, তোমাদের মধ্যে যে আপন ওয়াদাগুলো মেনে চলবে তার বিনিময় আল্লাহর নিকট। আর যে এগুলো থেকে কিছু করে ফেলবে আর সে জন্য দুনিয়াতে যদি তার শাস্তি হয়ে যায়, তাহলে এটি হবে তার জন্য গুনাহর কাফ্ফারা এবং গুনাহর পবিত্রতা। আর যার (দোষ) আল্লাহ্ গোপন রেখেছেন তার ব্যাপারটি আল্লাহর উপর। (আল্লাহ্) ইচ্ছা করলে তাকে শাস্তি দিতে পারেন। আবার ইচ্ছা করলে তাকে ক্ষমাও করে দিতে পারেন। আবূ ‘আবদুল্লাহ্ [ইমাম বুখারী (রহ.)] বলেন, চোর যদি হাত কেটে দেয়ার পর তওবা করে তবে তার সাক্ষ্য গ্রহণযোগ্য হবে। তেমনি শরীয়াতের শাস্তিপ্রাপ্ত প্রত্যেকটি লোকের ব্যাপারেই এ বিধান প্রযোজ্য যখন সে তওবা করবে, তখন তার সাক্ষ্য গ্রহণীয় হবে। [১৮] (আধুনিক প্রকাশনী- ৬৩৩২, ইসলামিক ফাউন্ডেশন- ৬৩৪৫)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 6802,
			"arabicnumber": 6802,
			"text": "[كتاب الْمُحَارِبِينَ مِنْ أَهْلِ الْكُفْرِ وَالرِّدَّةِ] [কাফির ও ধর্মত্যাগী বিদ্রোহীদের বিবরণ] وَقَوْلِ اللهِ تَعَالَى (إِنَّمَا جَزَاءُ الَّذِينَ يُحَارِبُونَ اللهَ وَرَسُولَهُ وَيَسْعَوْنَ فِي الأَرْضِ فَسَادًا أَنْ يُقَتَّلُوا أَوْ يُصَلَّبُوا أَوْ تُقَطَّعَ أَيْدِيهِمْ وَأَرْجُلُهُمْ مِنْ خِلاَفٍ أَوْ يُنْفَوْا مِنْ الأَرْضٍِ) আল্লাহর বাণীঃ যারা আল্লাহ্ ও তাঁর রাসূলের বিরুদ্ধে যুদ্ধ করে তাদের শাস্তি.....। (সূরাহ আল-মায়িদাহ ৫/৩৩) ৬৮০২. আনাস (রাঃ) হতে বর্ণিত। তিনি বলেন, উক্‌ল গোত্রের একদল লোক নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট হাজির হয়ে ইসলাম গ্রহণ করল। কিন্তু মদিনার আবহাওয়া তাদের অনুকূল হল না। তাই তিনি তাদেরকে সদাকাহর উটপালের কাছে গিয়ে সেগুলোর প্রস্রাব ও দুধপান করার আদেশ করলেন। তারা তা-ই করল। ফলে তারা সুস্থ হয়ে গেল। শেষে তারা দ্বীন ত্যাগ করে উটপালের রাখালদেরকে হত্যা করে সেগুলো নিয়ে চলল। এদিকে তিনি তাদের পিছনে লোক পাঠালেন। তাদেরকে (ধরে) আনা হল। আর তাদের হাত-পা কাটলেন ও লোহার শলাকা দিয়ে তাদের চোখগুলো ফুঁড়ে দিলেন। কিন্তু তাদের ক্ষতস্থানে লোহা পুড়ে দাগ দিলেন না। শেষতক তারা মারা গেল।[1] [২৩৩] (আধুনিক প্রকাশনী- ৬৩৩৩, ইসলামিক ফাউন্ডেশন- ৬৩৪৬)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 6803,
			"arabicnumber": 6803,
			"text": "আনাস (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ‘উরাইনা গোত্রীয় লোকদের (হাত, পা) কাটলেন, অথচ তাদের ক্ষতস্থানে লোহা পুড়ে দাগ দেননি। শেষতক তারা মারা গেল। [২৩৩] (আধুনিক প্রকাশনী- ৬৩৩৪, ইসলামিক ফাউন্ডেশন- ৬৩৪৭)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 6804,
			"arabicnumber": 6804,
			"text": "আনাস (রাঃ) হতে বর্ণিত। তিনি বলেন, উক্‌ল গোত্রের একদল লোক নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট আসল। তারা সুফ্ফায় থাকত। মদিনার আবহাওয়া তাদের অনুকূলে না হওয়ার করণে তারা বলল, হে আল্লাহর রাসূল! আমাদের জন্য দুধের ব্যবস্থা করুন। তিনি বললেনঃ আমি তোমাদের জন্য এ ব্যতীত কিছু পাচ্ছি না যে, তোমরা রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর উটপালের কাছে যাবে। তারা সেগুলোর কাছে আসল। আর সেগুলোর দুধ প্রস্রাব পান করল। ফলে তারা সুস্থ ও মোটা তাজা হয়ে উঠল ও রাখালকে হত্যা করে উটগুলো হাঁকিয়ে নিয়ে চলল। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে খবর আসলে তাদের খোঁজে লোক পাঠালেন। রোদ প্রখর হবার আগেই তাদেরকে আনা হল। তখন তিনি লৌহশলাকা আনার আদেশ দিলেন। তা গরম করে তা দিয়ে তাদের চোখ ফুঁড়ে দিলেন এবং তাদের হাত-পা কেটে দেয়া হল। অথচ লোহা গরম করে দাগ লাগাননি। এরপর তাদেরকে তপ্ত মরুভূমিতে ফেলে দেয়া হল। তারা পানি পান করতে চাইল কিন্তু পান করানো হল না। অবশেষে তারা মারা গেল। আবূ ক্বিলাবাহ (রহ.) বলেন, তারা চুরি করেছিল, হত্যাও করেছিল, আর আল্লাহ্ ও তাঁর রাসূলের বিরুদ্ধে বিদ্রোহ করেছিল। [২৩৩] (আধুনিক প্রকাশনী- ৬৩৩৫, ইসলামিক ফাউন্ডেশন- ৬৩৪৮)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 6805,
			"arabicnumber": 6805,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত যে, উক্ল গোত্রের একদল (অথবা তিনি বলেন উরাইনা গোত্রের- জানামতে তিনি উক্ল গোত্রেরই বলেছেন) মদিনা্য় এলো, তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদেরকে দুধেল উটের কাছে যাবার হুকুম দিলেন। তাদেরকে আরো নির্দেশ করলেন যেন তারা সে সব উটের কাছে গিয়ে সেগুলোর দুধ ও পেশাব পান করে। তারা তা পান করল। শেষে যখন তারা সুস্থ হয়ে গেল,তখন রাখালকে হত্যা করে উটগুলো হাঁকিয়ে নিয়ে চলল। ভোরে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে এ খবর পৌঁছল। তিনি তাদের খোঁজে লোক পাঠালেন। রোদ বাড়ার আগেই তাদেরকে নিয়ে আসা হল। তাদের ব্যাপারে তিনি আদেশ করলেন,তাদের হাত-পা কাটা হল। লোহার শলাকা দিয়ে তাদের চোখগুলো ফুঁড়া হল। এরপর প্রখর রোদে ফেলে রাখা হল। তারা পানি পান করতে চাইল। কিন্তু পান করানো হল না। [২৩৩] আবূ ক্বিলাবাহ (রহ.) বলেন, ঐ লোকগুলো এমন একটি দল যারা চুরি করেছিল, হত্যাও করেছিল, ঈমান আনার পর কুফরী করেছিল আর আল্লাহ্ ও তাঁর রাসূলের বিরুদ্ধে বিদ্রোহ করেছিল। (আধুনিক প্রকাশনী- ৬৩৩৬, ইসলামিক ফাউন্ডেশন- ৬৩৪৯)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 6806,
			"arabicnumber": 6806,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ সাত রকমের লোক, যাদেরকে আল্লাহ্ কিয়ামতের দিন তাঁর ছায়ায় আশ্রয় দেবেন, যেদিন তাঁর ছায়া ছাড়া অন্য কোন ছায়া হবে না। ১. ন্যায়পরায়ণ বাদশাহ্; ২. আল্লাহর ‘ইবাদাতে লিপ্ত যুবক; ৩. এমন যে ব্যক্তি আল্লাহকে নির্জনে স্মরণ করে আর তার চোখ দু’টি অশ্রুসিক্ত হয়; ৪. এমন ব্যক্তি যার অন্তর মসজিদের সঙ্গে লেগে থাকে; ৫. এমন দু’ব্যক্তি যারা আল্লাহর উদ্দেশে পরস্পর ভালোবাসা রাখে; ৬. এমন ব্যক্তি যাকে কোন সম্ভ্রান্ত রূপসী নারী নিজের দিকে ডাকল আর সে বলল, আমি আল্লাহকে ভয় করি; ৭. এমন ব্যক্তি যে সদাকাহ করল আর এমনভাবে করল যে, তার বাম হাত জানে না যে তার ডান হাত কী করে। [৬৬০] (আধুনিক প্রকাশনী- ৬৩৩৭, ইসলামিক ফাউন্ডেশন- ৬৩৫০)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 6807,
			"arabicnumber": 6807,
			"text": "সাহল ইবনু সা‘দ সা‘ঈদী (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে কেউ আমার জন্য তার দু’পা ও দু’চোয়ালের মাঝের স্থানের দায়িত্ব নেবে, আমি তার জন্য জান্নাতের দায়িত্ব নেব।[1] [৬৪৭৪] (আধুনিক প্রকাশনী- ৬৩৩৮, ইসলামিক ফাউন্ডেশন- ৬৩৫১)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 6808,
			"arabicnumber": 6808,
			"text": "(وَلاَ يَزْنُونَ) ( وَلاَ تَقْرَبُوا الزِّنَا إِنَّهُ كَانَ فَاحِشَةً وَسَاءَ سَبِيلاً) আল্লাহর বাণীঃ আর তারা যিনা করে না- (সূরাহ আল-ফুরক্বান ২৫/৬৮) এবং তোমরা যিনার নিকটেও যেয়ো না। এটা অশ্লীল ও নিকৃষ্ট আচরণ- (সূরাহ ইসরা ১৭/৩২)। ৬৮০৮. ক্বাতাদাহ (রহ.) হতে বর্ণিত। তিনি বলেন, আমাদেরকে আনাস (রাঃ) বলেছেন যে, আমি তোমাদেরকে এমন এক হাদীস বর্ণনা করব যা আমার পরে তোমাদেরকে কেউ বর্ণনা করবে না। আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি যে, ক্বিয়ামাত (কিয়ামত) সংঘটিত হবে না অথবা তিনি বলেছেন, কিয়ামতের আগের নিদর্শনগুলোর মধ্যে হল এই যে, ইল্ম উঠিয়ে নেয়া হবে, মূর্খতার বিস্তার ঘটবে, মদ পান করা হবে, ব্যাপকভাবে যিনা হবে, পুরুষের সংখ্যা কমবে, নারীর সংখ্যা এমনভাবে বৃদ্ধি পাবে যে, পঞ্চাশ জন নারীর কর্তৃত্বে থাকবে একজন পুরুষ। [৮০] (আধুনিক প্রকাশনী- ৬৩৩৯, ইসলামিক ফাউন্ডেশন- ৬৩৫২)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 6809,
			"arabicnumber": 6809,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মু’মিন থাকা অবস্থায় কোন ব্যক্তি ব্যভিচারে লিপ্ত হয় না। মু’মিন থাকা অবস্থায় কোন চোর চুরি করে না। মু’মিন থাকা অবস্থায় কেউ মদ্য পান করে না। মু’মিন থাকা অবস্থায় কেউ হত্যা করে না। ‘ইক্বরিমাহ (রহ.) বলেন, আমি ইবনু ‘আব্বাস (রাঃ)-কে জিজ্ঞেস করলাম, তার থেকে ইমান কিভাবে ছিনিয়ে নেয়া হয়? তিনি বললেনঃ এভাবে। আর অঙ্গুলিগুলো পরস্পর জড়ালেন, এরপর অঙ্গুলিগুলো বের করলেন। যদি সে তওবা করে তবে আগের অবস্থায় এভাবে ফিরে আসে। এ ব’লে অঙ্গুলিগুলো আবার পরস্পর জড়ালেন। [৬৭৮২] (আধুনিক প্রকাশনী- ৬৩৪০, ইসলামিক ফাউন্ডেশন- ৬৩৫৩)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 6810,
			"arabicnumber": 6810,
			"text": "৬৮১০ আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যিনাকারী যিনা করার সময় মু’মিন থাকে না। চোর চুরি করার সময় মু’মিন থাকে না। মদপানকারী মদ পানের সময় মু’মিন থাকে না। তবে তারপরও তওবা উন্মুক্ত। [২৪৭৫] (আধুনিক প্রকাশনী- ৬৩৪১, ইসলামিক ফাউন্ডেশন- ৬৩৫৪)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 6811,
			"arabicnumber": 6811,
			"text": "‘আবদুল্লাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি বললাম, হে আল্লাহর রাসূল! কোন্ পাপটি সব থেকে বড়? তিনি বললেনঃ তুমি আল্লাহর কোন সমকক্ষ স্থির করবে। অথচ তিনিই তোমাকে সৃষ্টি করেছেন। আমি বললাম, তারপর কোনটি? তিনি বললেনঃ তোমার সঙ্গে আহার করবে এ ভয়ে তোমার সন্তানকে হত্যা করা। আমি বললাম, তারপর কোনটি? তিনি বললেনঃ তোমার প্রতিবেশির স্ত্রীর সাথে যিনা করা। [৪৪৭৭] ইয়াহ্ইয়া (র.)- ‘আবদুল্লাহ্ (রাঃ) আমি বললাম, হে আল্লাহর রাসূল!... এরকম বর্ণনা করেছেন। আমর (রহ.)- আবূ মায়সারা (রহ.) বলেন, ছাড় এটাকে, ছাড় এটাকে। (আধুনিক প্রকাশনী- ৬৩৪২, ইসলামিক ফাউন্ডেশন- ৬৩৫৫)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 6812,
			"arabicnumber": 6812,
			"text": "وَقَالَ الْحَسَنُ مَنْ زَنَى بِأُخْتِهِ حَدُّهُ حَدُّ الزَّانِي হাসান (রহ.) বলেন, যে নিজের বোনের সাথে যিনা করে তার উপর যিনার হদ জারি হবে। ৬৮১২. শা’বী (রহ.) হতে বর্ণিত। তিনি ‘আলী (রাঃ) থেকে বর্ণনা করেন যে, ‘আলী (রাঃ) জুম‘আর দিন এক মহিলাকে যখন পাথর মেরে হত্যা করেন তখন বলেন, আমি তাকে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সুন্নাত অনুযায়ী পাথর মেরে হত্যা করলাম। (আধুনিক প্রকাশনী- ৬৩৪৩, ইসলামিক ফাউন্ডেশন- ৬৩৬৫)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 6813,
			"arabicnumber": 6813,
			"text": "শায়বানী (রহ.) হতে বর্ণিত। তিনি বলেন, আমি ‘আবদুল্লাহ্ ইবনু আবূ আওফা (রাঃ)-কে জিজ্ঞেস করলাম, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পাথর মেরে হত্যা করেছেন কি? তিনি উত্তর দিলেন, হ্যাঁ। আমি বললাম, সূরায়ে নূর-এর আগে না পরে? তিনি বললেন, আমি জানি না। [৬৮৪০; মুসলিম ২৯/৬, হাঃ ১৭০২] (আধুনিক প্রকাশনী- ৬৩৪৪, ইসলামিক ফাউন্ডেশন- ৬৩৫৭)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 6814,
			"arabicnumber": 6814,
			"text": "জাবির ইবনু ‘আবদুল্লাহ্ আনসারী (রাঃ) হতে বর্ণিত যে, আসলাম গোত্রের এক লোক রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে এল। এসে বলল, সে যিনা করেছে এবং নিজের বিরুদ্ধে চারবার সাক্ষ্য দিল। তারপর রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার ব্যাপারে আদেশ দিলেন, তাকে পাথর মেরে হত্যা করা হলো। সে ছিল বিবাহিত।[1] [৫২৭০] (আধুনিক প্রকাশনী- ৬৩৪৫, ইসলামিক ফাউন্ডেশন- ৬৩৫৮)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 6816,
			"arabicnumber": 6816,
			"text": "",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 6817,
			"arabicnumber": 6817,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, সা‘দ ও ইবনু যাম‘আহ (রাঃ) ঝগড়া করলেন। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ হে আব্দ ইবনু যাম‘আহ! এ সন্তান তোমারই। সন্তান বিছানার মালিকের। আর হে সাওদা! তুমি তার থেকে পর্দা কর। কুতাইবাহ (রহ.) লায়স (রহ.) থেকে আমাদেরকে এ বাক্যটি অধিক বলেছেন যে, যেনাকারীর জন্য পাথর। [২০৫৩] (আধুনিক প্রকাশনী- ৬৩৪৭, ইসলামিক ফাউন্ডেশন- ৬৩৬০)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 6818,
			"arabicnumber": 6818,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ বিছানা যার সন্তান তার আর যেনাকারীর জন্য পাথর। [৬৭৫০] (আধুনিক প্রকাশনী- ৬৩৪৮, ইসলামিক ফাউন্ডেশন- ৬৩৬১)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 6819,
			"arabicnumber": 6819,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে এক ইয়াহূদী পুরুষ ও এক ইয়াহূদী নারীকে আনা হল। তারা দু’জনেই যিনা করেছে। তিনি তাদেরকে জিজ্ঞেস করলেন, এ সম্পর্কে তোমরা তোমাদের কিতাবে কী পাচ্ছ? তারা বলল, আমাদের পাদ্রীরা চেহারা কালো করার ও দু’জনকে গাধার পিঠে উল্টো বসিয়ে প্রদক্ষিণ করার নিয়ম চালু করেছেন। ‘আবদুল্লাহ্ ইবনু সালাম (রাঃ) বললেন, হে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদেরকে তাওরাত নিয়ে আসতে বলুন। এরপর তা নিয়ে আসা হল। তাদের একজন রজমের আয়াতের উপর নিজের হাত রেখে দিল এবং এর আগে-পিছে পড়তে লাগল। তখন ইবনু সালাম (রাঃ) তাকে বললেন, তোমার হাত উঠাও। দেখা গেল তার হাতের নিচে রয়েছে রজমের আয়াত। তারপর রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের দু’জনের ব্যপারে আদেশ দিলেন, উভয়কে পাথর মেরে হত্যা করা হল। ইবনু ‘উমার বলেন, তাদের উভয়কে সমতল স্থানে রজম করা হয়েছে। তখন ইয়াহূদী পুরুষটাকে দেখেছি ইয়াহূদী স্ত্রীলোকটির উপর উপুড় হয়ে পড়ে আছে। [১৩২৯; মুসলিম ৬/৬, হাঃ ১৬৯৯, আহমাদ ৪৪৯৮] (আধুনিক প্রকাশনী- ৬৩৪৯, ইসলামিক ফাউন্ডেশন- ৬৩৬২)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 6820,
			"arabicnumber": 6820,
			"text": "জাবির (রাঃ) হতে বর্ণিত। আসলামা গোত্রের এক লোক নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে এসে যিনার কথা স্বীকার করল। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর থেকে মুখ ফিরিয়ে নিলেন। এভাবে সে নিজের বিপক্ষে চারবার সাক্ষ্য দিল। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বললেনঃ তুমি কি পাগল? সে বলল, না। তিনি তার সম্পর্কে আদেশ দিলেন। তখন তাকে ঈদগাহে পাথর মেরে হত্যা করা হল। পাথর যখন তাকে অসহনীয় যন্ত্রণা দিচ্ছিল, তখন সে পালাতে লাগল। তারপর তাকে ধরা হল ও পাথর মেরে হত্যা করা হল। অবশেষে সে মারা গেল। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার সম্পর্কে ভালো মন্তব্য করলেন ও তার সালাতে জানাযা আদায় করলেন। ইউনুস ও ইবনু জুরাইজ (রহ.) যুহরী (রহ.) থেকে فَصَلَّى عَلَيْهِ বাক্যটি বলেননি। [৫২৭০] আবূ ‘আবদুল্লাহ্ বুখারী (রহ.)-কে প্রশ্ন করা হয়েছে صَلَّى عَلَيْهِ বর্ণনাটি কি বিশুদ্ধ? তিনি বললেন, এটিকে মা’মার বর্ণনা করেছেন। তাঁকে জিজ্ঞেস করা হলো এটিকে মা’মার ছাড়া আর কেউ বর্ণনা করেছে কি? তিনি বললেন, না। (আধুনিক প্রকাশনী- ৬৩৫০, ইসলামিক ফাউন্ডেশন- ৬৩৬৩)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 6821,
			"arabicnumber": 6821,
			"text": "قَالَ عَطَاءٌ لَمْ يُعَاقِبْهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ ابْنُ جُرَيْجٍ وَلَمْ يُعَاقِبْ الَّذِي جَامَعَ فِي رَمَضَانَ وَلَمْ يُعَاقِبْ عُمَرُ صَاحِبَ الظَّبْيِ وَفِيهِ عَنْ أَبِي عُثْمَانَ عَنْ أَبِي مَسْعُودٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ. ‘আত্বা (রহ.) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এমন ব্যক্তিকে শাস্তি দেননি। ইবনু জুরাইজ (রহ.) বলেন, শাস্তি দেননি ঐ লোককে যে রমযানে স্ত্রী সংগম করেছে এবং ‘উমার (রাঃ) শাস্তি দেননি হরিণ শিকারীকে। এ সম্পর্কে আবূ ‘উসমান (রহ.) ইবনু মাস‘ঊদ (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণনা আছে। ৬৮২১. আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত যে, এক লোক রমযানে আপন স্ত্রীর সাথে যৌন সংযোগ করে ফেললো। তারপর রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে ফতোয়া জানতে চাইল। তখন তিনি জিজ্ঞেস করলেন, একটি গোলাম আযাদ করার সামর্থ্য তোমার আছে কি? সে বলল, না। তিনি বললেনঃ তাহলে কি দু’মাস সিয়াম পালন করতে পারবে? সে বলল, না। তিনি বললেনঃ তাহলে ষাটজন মিসকীনকে খাদ্য খাওয়াও। [১৯৩৬] (আধুনিক প্রকাশনী- ৬৩৫১, ইসলামিক ফাউন্ডেশন- ৬৩৬৪)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 6822,
			"arabicnumber": 6822,
			"text": "লায়স (রহ.)-এর সূত্রে ‘আয়িশাহ (রাঃ) হতে বর্ণিত আছে যে, এক লোক নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে মসজিদে আসল। তখন সে বলল, আমি ধ্বংস হয়ে গেছি। তিনি বললেনঃ তা কার সঙ্গে? সে বলল, আমি রমাযানের ভিতর আমার স্ত্রীর সঙ্গে সহবাস করে ফেলেছি। তখন তিনি তাকে বললেনঃ তুমি সদাকাহ কর। সে বলল, আমার কাছে কিছুই নেই। সে বসে থাকল। এমন সময় এক লোক একটি গাধা হাঁকিয়ে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে এল। আর তার সঙ্গে ছিল খাদ্যদ্রব্য। ‘আবদুর রহমান (রহ.) বলেন, আমি জানি না, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে কী আসল? অতঃপর তিনি জিজ্ঞেস করলেনঃ ধ্বংসপ্রাপ্ত লোকটি কোথায়? সে বলল, এই তো আমি। তিনি বললেনঃ এগুলো নিয়ে সদাকাহ করে দাও। সে বলল, আমার চেয়ে অধিক অভাবী লোকদের (ভিতর সাদকা করব)? আমার পরিবারের কাছে সামান্য খাবারও নেই। তিনি বললেনঃ তাহলে তোমরাই খাও। [১৯৩৫; মুসলিম ১৩/১৪, হাঃ ১১১২](আধুনিক প্রকাশনী- ৬৩৫১, ইসলামিক ফাউন্ডেশন- ৬৩৬৪)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 6823,
			"arabicnumber": 6823,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে ছিলাম। তখন এক লোক তাঁর কাছে এসে বলল, হে আল্লাহর রাসূল! আমি শাস্তিযোগ্য অপরাধ করে ফেলেছি। তাই আমাকে শাস্তি দিন। কিন্তু তিনি তাকে অপরাধ সম্পর্কে জিজ্ঞেস করলেন না। আনাস (রাঃ) বলেন তখন সালাতের সময় এসে গেল। লোকটি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে সালাত আদায় করল। যখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সালাত আদায় করলেন, তখন লোকটি তাঁর কাছে গিয়ে দাঁড়াল এবং বলল, হে আল্লাহর রাসূল! আমি শাস্তিযোগ্য অপরাধ করে ফেলেছি। তাই আমাকে আল্লাহর কিতাব অনুযায়ী শাস্তি দিন। তিনি বললেনঃ তুমি কি আমার সাথে সালাত আদায় করনি? সে বলল, হ্যাঁ। তিনি বললেন নিশ্চয় আল্লাহ্ তোমার গুনাহ্ ক্ষমা করে দিয়েছেন। অথবা বললেনঃ তোমার শাস্তি (ক্ষমা করে দিয়েছেন)।[1] [মুসলিম ৪৯/৭, হাঃ ২৭৬৪] (আধুনিক প্রকাশনী- ৬৩৫২, ইসলামিক ফাউন্ডেশন- ৬৩৬৫)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 6824,
			"arabicnumber": 6824,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, যখন মায়িয ইবনু মালিক নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে এল তখন তাকে বললেন সম্ভবত তুমি চুম্বন করেছ অথবা ইশারা করেছ অথবা (খারাপ দৃষ্টিতে) তাকিয়েছ? সে বলল, না, হে আল্লাহর রাসূল! তিনি বললেনঃ তাহলে কি তার সঙ্গে তুমি সঙ্গম করেছ? কথাটি তিনি তাকে অস্পষ্টভাবে জিজ্ঞেস করেননি, (বরং স্পষ্টভাবে জিজ্ঞেস করেছেন)। সে বলল, হ্যাঁ। তখন তাকে রজম করার নির্দেশ দিলেন। (আধুনিক প্রকাশনী- ৬৩৫৩, ইসলামিক ফাউন্ডেশন- ৬৩৬৬)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 6825,
			"arabicnumber": 6825,
			"text": "",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 6828,
			"arabicnumber": 6828,
			"text": "",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 6829,
			"arabicnumber": 6829,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, ‘উমার (রাঃ) বলেছেন, আমার আশঙ্কা হচ্ছে যে, দীর্ঘ যুগ পার হবার পর কোন লোক এ কথা বলতে পারে যে, আমরা আল্লাহর কিতাবে পাথর মেরে হত্যার বিধান পাচ্ছি না। ফলে এমন একটি ফরজ ত্যাগ করার কারণে তারা পথভ্রষ্ট হবে যা আল্লাহ্ অবতীর্ণ করেছেন। সাবধান! যখন প্রমাণ পাওয়া যাবে অথবা গর্ভ বা স্বীকারোক্তি পাওয়া যাবে তখন যিনাকারীর জন্য পাথর মেরে হত্যার বিধান নিঃসন্দেহে অবধারিত। সুফিয়ান (রহ.) বলেন, এরকমই আমি স্মরণ রেখেছি। সাবধান! রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পাথর মেরে হত্যা করেছেন, আর আমরাও তারপরে পাথর মেরে হত্যা করেছি। [২৪৬২] (আধুনিক প্রকাশনী- ৬৩৫৬, ইসলামিক ফাউন্ডেশন- ৬৩৬৯)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 6830,
			"arabicnumber": 6830,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি মুহাজিরদের কতক লোককে পড়াতাম। তাঁদের মধ্যে ‘আবদুর রহমান ইবনু ‘আওফ (রাঃ) অন্যতম ছিলেন। একবার আমি তাঁর মিনার বাড়িতে ছিলাম। তখন তিনি ‘উমার ইবনু খাত্তাব (রাঃ)-এর সঙ্গে তাঁর সর্বশেষ হাজ্জে রয়েছেন। এমন সময় ‘আবদুর রহমান (রাঃ) আমার কাছে ফিরে এসে বললেন, যদি আপনি ঐ লোকটিকে দেখতেন, যে লোকটি আজ আমীরুল মু’মিনীন-এর কাছে এসেছিল এবং বলেছিল, হে আমীরুল মু’মিনীন! অমুক ব্যক্তির ব্যাপারে আপনার কিছু করার আছে কি যে লোকটি বলে থাকে যে, যদি ‘উমার মারা যান তাহলে অবশ্যই অমুকের হাতে বায়‘আত করব। আল্লাহর কসম! আবূ বাকরের বায়‘আত আকস্মিক ব্যাপার-ই ছিল। ফলে তা হয়ে যায়। এ কথা শুনে তিনি ভীষণভাবে রাগান্বিত হলেন। তারপর বললেন, ইনশা আল্লাহ্ সন্ধ্যায় আমি অবশ্যই লোকদের মধ্যে দাঁড়াব আর তাদেরকে ঐসব লোক থেকে সতর্ক করে দিব, যারা তাদের বিষয়াদি আত্মসাৎ করতে চায়। ‘আবদুর রহমান (রাঃ) বলেন, তখন আমি বললাম, হে আমীরুল মু’মিনীন! আপনি এমনটা করবেন না। কারণ, হাজ্জের মওসুম নিম্নস্তরের ও নির্বোধ লোকদেরকে একত্রিত করে। আর এরাই আপনার নৈকট্যের সুযোগে প্রাধান্য বিস্তার করে ফেলবে, যখন আপনি লোকদের মধ্যে দাঁড়াবেন। আমার ভয় হচ্ছে, আপনি যখন দাঁড়িয়ে কোন কথা বলবেন তখন তা সব জায়গায় তাড়াতাড়ি ছড়িয়ে পড়বে। আর তারা তা ঠিকভাবে বুঝে উঠতে পারবে না। আর সঠিক রাখতেও পারবে না। সুতরাং মদিনা পৌঁছা পর্যন্ত অপেক্ষা করুন। আর তা হল হিজরাত ও সুন্নাতের কেন্দ্রস্থল। ফলে সেখানে জ্ঞানী ও সুধীবর্গের সঙ্গে মিলিত হবেন। আর যা বলার তা দৃঢ়তার সঙ্গে বলতে পারবেন। জ্ঞানী ব্যক্তিরা আপনার কথাকে সঠিকভাবে বুঝতে পারবে ও সঠিক ব্যবহার করবে। তখন ‘উমার (রাঃ) বললেন, জেনে রেখো! আল্লাহর কসম! ইনশাআল্লাহ্ আমি মদিনা পৌঁছার পর সর্বপ্রথম এ কাজটি নিয়ে ভাষণের জন্য দাঁড়াব। ইবনু ‘আব্বাস (রাঃ) বলেন, আমরা যিলহাজ্জ মাসের শেষ দিকে মদিনা্য় ফিরলাম। যখন জুমু‘আহর দিন এল সূর্য অস্ত যাওয়ার উপক্রমের সঙ্গে সঙ্গে আমি মসজিদে গেলাম। পৌঁছে দেখি, সা‘ঈদ ইবনু যায়দ ইবনু ‘আমর ইবনু নুফাইল (রাঃ) মিম্বরের গোড়ায় বসে আছেন, আমিও তার পাশে এমনভাবে বসলাম যেন আমার হাঁটু তার হাঁটু স্পর্শ করছে। অল্পক্ষণের মধ্যে ‘উমার ইবনু খাত্তাব (রাঃ) বেরিয়ে আসলেন। আমি যখন তাঁকে সামনের দিকে আসতে দেখলাম তখন সা‘ঈদ ইবনু যায়দ ইবনু ‘আমর ইবনু নুফায়লকে বললাম, আজ সন্ধ্যায় অবশ্যই তিনি এমন কিছু কথা বলবেন যা তিনি খলীফা হওয়া থেকে আজ পর্যন্ত বলেননি। কিন্তু তিনি আমার কথাটি উড়িয়ে দিলেন এবং বললেন, আমার মনে হয় না যে, তিনি এমন কোন কথা বলবেন, যা এর আগে বলেননি। এরপর উমর (রাঃ) মিম্বরের উপরে বসলেন। যখন মুয়ায্যিনগণ আযান থেকে ফারিগ হয়ে গেলেন তখন তিনি দাঁড়ালেন। আর আল্লাহর যথোপযুক্ত প্রশংসা করলেন। তারপর বললেন, আম্মাবা‘দ! আজ আমি তোমাদেরকে এমন কথা বলতে চাই, যা আমারই বলা কর্তব্য। হয়তবা কথাটি আমার মৃত্যুর সন্নিকট সময়ে হচ্ছে। তাই যে ব্যক্তি কথাগুলো ঠিকভাবে বুঝে সংরক্ষণ করবে সে যেন কথাগুলো ঐসব স্থানে পৌঁছে দেয় যেখানে তার সওয়ারী পৌঁছবে। আর যে ব্যক্তি কথাগুলো ঠিকভাবে বুঝতে আশংকাবোধ করছে আমি তার জন্য আমার ওপর মিথ্যা আরোপ করা ঠিক মনে করছি না। নিশ্চয় আল্লাহ্ মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে সত্য সহকারে পাঠিয়েছেন। আর তাঁর উপর কিতাব অবতীর্ণ করেছেন। এবং আল্লাহর অবতীর্ণ বিষয়াদির একটি ছিল রজমের আয়াত। আমরা সে আয়াত পড়েছি, বুঝেছি, আয়ত্ত করেছি।[1] আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পাথর মেরে হত্যা করেছেন। আমরাও তাঁর পরে পাথর মেরে হত্যা করেছি। আমি আশংকা করছি যে, দীর্ঘকাল অতিবাহিত হবার পর কোন লোক এ কথা বলে ফেলতে পারে যে, আল্লাহর কসম! আমরা আল্লাহর কিতাবে পাথর মেরে হত্যার আয়াত পাচ্ছি না। ফলে তারা এমন একটি ফরজ ত্যাগের কারণে পথভ্রষ্ট হবে, যা আল্লাহ্ অবতীর্ণ করেছেন। আল্লাহর কিতাব অনুযায়ী ঐ ব্যক্তির উপর পাথর মেরে হত্যা অবধারিত, যে বিবাহিত হবার পর যিনা করবে, সে পুরুষ হোক বা নারী। যখন সুস্পষ্ট প্রমাণ পাওয়া যাবে অথবা গর্ভ বা স্বীকারোক্তি পাওয়া যাবে। তেমনি আমরা আল্লাহর কিতাবে এও পড়তাম যে, তোমরা তোমাদের বাপ-দাদা থেকে মুখ ফিরিয়ে নিও না। এটি তোমাদের জন্য কুফরী যে, তোমরা স্বীয় বাপ-দাদা থেকে বিমুখ হবে। অথবা বলেছেন, এটি তোমাদের জন্য কুফরী যে, স্বীয় বাবা-দাদা থেকে বিমুখ হবে। জেনে রেখো! রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন: তোমরা সীমা ছাড়িয়ে আমার প্রশংসা করো না, যেভাবে ঈসা ইবনু মরিয়ামের সীমা ছাড়িয়ে প্রশংসা করা হয়েছে। তোমরা বল, আল্লাহর বান্দা ও তাঁর রাসূল। এরপর আমার কাছে এ কথা পৌঁছেছে যে, তোমাদের কেউ এ কথা বলছে যে, আল্লাহর কসম! যদি ‘উমার মারা যায় তাহলে আমি অমুকের হাতে বাই‘আত করব। কেউ যেন এ কথা বলে ধোঁকায় না পড়ে যে আবূ বকর-এর বায়‘আত ছিল আকস্মিক ঘটনা। ফলে তা সংঘটিত হয়ে যায়। জেনে রেখো! তা অবশ্যই এমন ছিল। তবে আল্লাহ আকস্মিক বায়আতের ক্ষতি প্রতিহত করেছেন। সফর করে সওয়ারীগুলোর ঘাড় ভেঙ্গে যায়-- এমন স্থান পর্যন্ত মানুষের মাঝে আবূ বকরের মত কে আছে? যে কেউ মুসলিমদের পরামর্শ ছাড়া কোন লোকের হাতে বায়‘আত করবে, তার অনুসরণ করা যাবে না এবং ঐ লোকেরও না, যে তার অনুসরণ করবে। কেননা, উভয়েরই হত্যার শিকার হবার আশংকা রয়েছে। যখন আল্লাহ্ তাঁর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে ওফাত দিলেন, তখন আবূ বাকর (রাঃ) ছিলেন আমাদের মধ্যে সবচেয়ে শ্রেষ্ঠ ব্যক্তি। অবশ্য আনসারগণ আমাদের বিরোধিতা করেছেন। তারা সকলে বানী সা‘ঈদার চত্বরে মিলিত হয়েছেন। আমাদের থেকে বিমুখ হয়ে ‘আলী, যুবায়র ও তাঁদের সাথীরাও বিরোধিতা করেছেন। অপরদিকে মুহাজিরগণ আবূ বকরের কাছে সমবেত হলেন। তখন আমি আবূ বকরকে বললাম, হে আবূ বকর! আমাদেরকে নিয়ে আমাদের ঐ আনসার ভাইদের কাছে চলুন। আমরা তাদের উদ্দেশে রওনা হলাম। যখন আমরা তাদের নিকটবর্তী হলাম তখন আমাদের সঙ্গে তাদের দু’জন পুণ্যবান ব্যক্তির সাক্ষাৎ হল। তারা উভয়েই এ বিষয়ে আলোচনা করলেন, যে বিষয়ে লোকেরা ঐকমত্য করছিল। এরপর তারা বললেন, হে মুহাজির দল! আপনারা কোথায় যাচ্ছেন? তখন আমরা বললাম, আমরা আমাদের ঐ আনসার ভাইদের উদ্দেশে রওনা হয়েছি। তারা বললেন, না, আপনাদের তাদের নিকট না যাওয়াই উচিত। আপনারা আপনাদের বিষয় সমাপ্ত করে নিন। তখন আমি বললাম, আল্লাহর কসম! আমরা অবশ্যই তাদের কাছে যাব। আমরা চললাম। অবশেষে বানী সা‘ঈদার চত্বরে তাদের কাছে এলাম। আমরা দেখতে পেলাম তাদের মাঝখানে এক লোক বস্ত্রাবৃত অবস্থায় রয়েছেন। আমি জিজ্ঞেস করলাম, ঐ লোক কে? তারা জবাব দিল ইনি সা’দ ইবনু ‘উবাদাহ। আমি জিজ্ঞেস করলাম, তার কী হয়েছে? তারা বলল, তিনি জ্বরে আক্রান্ত। আমরা কিছুক্ষণ বসার পরই তাদের খতীব উঠে দাঁড়িয়ে কালিমায়ে শাহাদাত পড়লেন এবং আল্লাহর যথোপযুক্ত প্রশংসা করলেন। তারপর বললেন, আম্মাবা‘দ। আমরা আল্লাহর (দ্বীনের) সাহায্যকারী ও ইসলামের সেনাদল এবং তোমরা হে মুহাজির দল! একটি ছোট দল মাত্র, যে দলটি তোমাদের গোত্র থেকে আলাদা হয়ে আমাদের কাছে পৌঁছেছে। অথচ এরা এখন আমাদেরকে মূল থেকে সরিয়ে দিতে এবং খিলাফত থেকে বঞ্চিত করে দিতে চাচ্ছে। যখন তিনি নিশ্চুপ হলেন তখন আমি কিছু বলার ইচ্ছে করলাম। আর আমি আগে থেকেই কিছু কথা সাজিয়ে রেখেছিলাম, যা আমার কাছে ভাল লাগছিল। আমি ইচ্ছে করলাম যে, আবূ বাকর (রাঃ)-এর সামনে কথাটি পেশ করব। আমি তার ভাষণ থেকে সৃষ্ট রাগকে কিছুটা ঠান্ডা করতে চাইলাম। আমি যখন কথা বলতে চাইলাম তখন আবূ বাকর (রাঃ) বললেন, তুমি থাম। আমি তাঁকে রাগান্বিত করাটা পছন্দ করলাম না। তাই আবূ বকর (রাঃ) কথা বললেন, আর তিনি ছিলেন আমার চেয়ে সহনশীল ও গম্ভীর। আল্লাহর কসম! তিনি এমন কোন কথা বাদ দেননি যা আমি সাজিয়ে রেখেছিলাম। অথচ তিনি তারক্ষণিকভাবে ঐরকম বরং তার থেকেও উত্তম কথা বললেন। অবশেষে তিনি কথা বন্ধ করে দিলেন। এরপর আবার বললেন, তোমরা তোমাদের ব্যাপারে যেসব উত্তম কাজের কথা বলেছ আসলে তোমরা এর উপযুক্ত। তবে খিলাফাতের ব্যাপারটি কেবল এই কুরাইশ বংশের জন্য নির্দিষ্ট। তারা হচ্ছে বংশ ও আবাসভূমির দিক দিয়ে সর্বোত্তম আরব। আর আমি এ দু’জন হতে যে-কোন একজনকে তোমাদের জন্য নির্ধারিত করলাম। তোমরা যে-কোন একজনের হাতে ইচ্ছা বায়‘আত করে নাও। এরপর তিনি আমার ও আবূ ‘উবাইদাহ ইবনু জাররাহ্ (রাঃ)-এর হাত ধরলেন। তিনি আমাদের মাঝখানেই বসা ছিলেন। আমি তাঁর এ কথা ব্যতীত যত কথা বলেছেন কোনটাকে অপছন্দ করিনি। আল্লাহর কসম! আবূ বাকর যে জাতির মধ্যে বর্তমান আছেন সে জাতির উপর আমি শাসক নিযুক্ত হবার চেয়ে এটাই শ্রেয় যে, আমাকে পেশ করে আমার ঘাড় ভেঙ্গে দেয়া হবে, ফলে তা আমাকে কোন গুনাহের কাছে আর নিয়ে যেতে পারবে না। হে আল্লাহ্! হয়ত আমার আত্মা আমার মৃত্যুর সময় এমন কিছু আকাঙ্ক্ষা করতে পারে, যা এখন আমি পাচ্ছি না। তখন আনসারদের এক ব্যক্তি বলে উঠল, আমি এ জাতির অভিজ্ঞ ও বংশগত সম্ভ্রান্ত। হে কুরাইশগণ! আমাদের হতে হবে এক আমীর আর তোমাদের হতে হবে এক আমীর। এ সময় অনেক কথা ও হৈ চৈ শুরু হয়ে গেল। আমি এ মতবিরোধের দরুন শংকিত হয়ে পড়লাম। তাই আমি বললাম, হে আবূ বকর! আপনি হাত বাড়ান। তিনি হাত বাড়ালেন। আমি তাঁর হাতে বায়‘আত করলাম। মুহাজিরগণও তাঁর হাতে বায়‘আত করলেন। অতঃপর আনসারগণও তাঁর হাতে বায়‘আত করলেন। আর আমরা সা‘দ ইবনু ‘উবাদাহ (রাঃ)-এর দিকে এগোলাম। তখন তাদের এক লোক বলে উঠল, তোমরা সা’দ ইবনু উবাদাকে জানে মেরে ফেলেছ। তখন আমি বললাম, আল্লাহ্ সা‘দ ইবনু ওবাদাকে হত্যা করেছেন। ‘উমার (রাঃ) বলেন, আল্লাহর কসম! আমরা সে সময়ের জরুরী বিষয়ের মধ্যে আবূ বকরের বায়আতের চেয়ে গুরুত্বপূর্ণ কোন কিছুকে মনে করিনি। আমাদের ভয় ছিল যে, যদি বায়আতের কাজ অসম্পন্ন থাকে, আর এ জাতি থেকে আলাদা হয়ে যাই তাহলে তারা আমাদের পরে তাদের কারো হাতে বায়আত করে নিতে পারে। তারপর হয়ত আমাদেরকে নিজ ইচ্ছার বিরুদ্ধে তাদের অনুসরণ করতে হত, না হয় তাদের বিরোধিতা করতে হত, ফলে তা মারাত্মক বিপর্যয়ের কারণ হয়ে দাঁড়াত। অতএব যে ব্যক্তি মুসলিমদের পরামর্শ ছাড়া কোন ব্যক্তির হাতে বায়‘আত করবে তার অনুসরণ করা যাবে না। আর ঐ লোকেরও না, যে তার অনুসরণ করবে। কেননা, উভয়েরই নিহত হওয়ার আশংকা আছে। [২৪৬২] (আধুনিক প্রকাশনী- ৬৩৫৭, ইসলামিক ফাউন্ডেশন- ৬৩৭০)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 6832,
			"arabicnumber": 6832,
			"text": "",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 6833,
			"arabicnumber": 6833,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত যে, যে যিনা করেছে অথচ সে অবিবাহিত রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঐ ব্যক্তি সম্বন্ধে ‘হদ’ প্রয়োগসহ এক বছরের নির্বাসনের সিদ্ধান্ত দিয়েছেন। [২৩১৫] (আধুনিক প্রকাশনী- ৬৩৫৯, ইসলামিক ফাউন্ডেশন- ৬৩৭২)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 6834,
			"arabicnumber": 6834,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম লা‘নত করেছেন নারীরূপী পুরুষ ও পুরুষরূপী নারীদের উপর এবং বলেছেনঃ তাদেরকে বের করে দাও তোমাদের ঘর হতে এবং তিনি অমুক অমুককে বের করে দিয়েছেন। (আধুনিক প্রকাশনী- ৬৩৬০, ইসলামিক ফাউন্ডেশন- ৬৩৭৩)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 6836,
			"arabicnumber": 6836,
			"text": "",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 6838,
			"arabicnumber": 6838,
			"text": "",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 6839,
			"arabicnumber": 6839,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, দাসী যখন যিনা করে আর প্রমাণিত হয়ে যায়, তখন যেন তাকে বেত্রাঘাত করে এবং তিরস্কার না করে। আবার যদি যিনা করে তাহলেও যেন বেত্রাঘাত করে, তিরস্কার না করে। যদি তৃতীয়বারও যিনা করে তাহলে যেন চুলের একটি রশির বিনিময়ে হলেও তাকে বিক্রি করে দেয়। ইসমাঈল ইবনু উমাইয়াহ (রহ.) সা‘ঈদ ..... আবূ হুরাইরাহ (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে লায়স (রহ.) এর অনুসরণ করেছেন। (আধুনিক প্রকাশনী- ৬৩৬৩, ইসলামিক ফাউন্ডেশন- ৬৩৭৬)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 6840,
			"arabicnumber": 6840,
			"text": "শায়বানী (রহ.) হতে বর্ণিত। তিনি বলেন, আমি ‘আবদুল্লাহ্ ইবনু আবূ ‘আওফা (রাঃ)-কে পাথর মেরে হত্যা সম্বন্ধে জিজ্ঞেস করলাম। তখন তিনি বললেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পাথর মেরে হত্যা করেছেন। আমি বললাম, সূরায়ে নূরের (আয়াত নাযিলের) আগে না পরে? তিনি বললেন, তা আমি জানি না। [৬৮১৩] ‘আলী ইবনু মুসহির, খালিদ ইবনু ‘আবদুল্লাহ্ মুহারিবী ও আবিদা ইবনু হুমায়দ (রহ.) আশ-শায়বানী (রহ.) থেকে আবদুল ওয়াহিদ এর অনুসরণ করেছেন। (আধুনিক প্রকাশনী- ৬৩৬৪, ইসলামিক ফাউন্ডেশন- ৬৩৭৭)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 6841,
			"arabicnumber": 6841,
			"text": "‘আবদুল্লাহ্ ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, ইয়াহূদীরা রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে এসে জানাল তাদের একজন পুরুষ ও একজন নারী যিনা করেছে। তখন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদেরকে জিজ্ঞেস করলেন যে, তোমরা তাওরাতে রজম সম্পর্কে কী পাচ্ছ? তারা বলল, তাদেরকে অপমান ও বেত্রাঘাত করা হয়। ‘আবদুল্লাহ্ ইবনু সালাম (রাঃ) বললেন, তোমরা মিথ্যে বলেছ। তাওরাতে অবশ্যই রজমের কথা আছে। তারা তাওরাত নিয়ে এল এবং তা খুলল। আর তাদের একজন রজমের আয়াতের ওপর হাত রেখে দিয়ে তার অগ্র পশ্চাৎ পাঠ করল। তখন ‘আবদুল্লাহ্ ইবনু সালাম (রাঃ) বললেন, তোমার হাত উঠাও। সে হাত উঠালে দেখা গেল তাতে রজমের আয়াত ঠিকই আছে।[1] তারা বলল, ‘আবদুল্লাহ্ ইবনু সালাম সত্যই বলেছেন। হে মুহাম্মাদ! তাতে রজমের আয়াত রয়েছে। তখন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের উভয়ের ব্যাপারে আদেশ করলেন এবং তাদের উভয়কে রজম করা হল। আমি দেখলাম, পুরুষটি নারীটির ওপর উপুড় হয়ে আছে। সে তাকে পাথরের আঘাত হতে রক্ষা করছে। [১৩২৯] (আধুনিক প্রকাশনী- ৬৩৬৫, ইসলামিক ফাউন্ডেশন- ৬৩৭৮)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 6843,
			"arabicnumber": 6843,
			"text": "",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 6844,
			"arabicnumber": 6844,
			"text": "وَقَالَ أَبُو سَعِيدٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صَلَّى فَأَرَادَ أَحَدٌ أَنْ يَمُرَّ بَيْنَ يَدَيْهِ فَلْيَدْفَعْهُ فَإِنْ أَبَى فَلْيُقَاتِلْهُ وَفَعَلَهُ أَبُو سَعِيدٍ আবূ সা‘ঈদ (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণনা করেন যে, কেউ সালাত আদায় করে আর কোন ব্যক্তি তার সম্মুখ দিয়ে অতিক্রম করার ইচ্ছে করে, তাহলে সে যেন তাকে বাধা দেয়। সে যদি বাধা না মানে তাহলে যেন তার সঙ্গে লড়াই করে। আবূ সা‘ঈদ (রাঃ) এমন করেছেন। ৬৮৪৪. ‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, একবার আবূ বাকর (রাঃ) এলেন। এ সময় রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম স্বীয় মাথা আমার ঊরুর ওপর রেখে আছেন। তখন তিনি বললেন, তুমি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও লোকদেরকে আটকে রেখেছ, এদিকে তাদের পানির কোন ব্যবস্থা নেই। তিনি আমাকে তিরস্কার করলেন ও নিজ হাত দ্বারা আমার কোমরে আঘাত করতে লাগলেন। আর রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর অবস্থানই আমাকে নড়াচড়া হতে বিরত রেখেছিল। তখন আল্লাহ্ তায়াম্মুমের আয়াত অবতীর্ণ করলেন।[1] [৩৩৪] (আধুনিক প্রকাশনী- ৬৩৬৭, ইসলামিক ফাউন্ডেশন- ৬৩৮০)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 6845,
			"arabicnumber": 6845,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, একবার আবূ বাকর (রাঃ) এলেন ও আমাকে খুব জোরে ঘুষি মারলেন আর বললেন, তুমি লোকজনকে একটি হারের জন্য আটকে রেখেছ। আমি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর অবস্থানের দরুন মরার মত ছিলাম। অথচ তা আমাকে খুবই কষ্ট দিয়েছে। সামনে অনুরূপ হাদীস বর্ণনা করেছেন। لَكَزَ- وَوَكَزَ একই অর্থের। [৪৪৩] (আধুনিক প্রকাশনী- ৬৩৬৮, ইসলামিক ফাউন্ডেশন- ৬৩৮১)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 6846,
			"arabicnumber": 6846,
			"text": "মুগীরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, সা‘দ ইবনু ‘উবাদাহ (রাঃ) বলেছেন, যদি আমি আমার স্ত্রীর সঙ্গে কোন পরপুরুষকে দেখি তবে আমি তাকে তরবারীর ধারালো দিক দিয়ে আঘাত করব। তার এ উক্তি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে পৌঁছল। তখন তিনি বললেনঃ তোমরা কি সা‘দ এর আত্মমর্যাদাবোধে আশ্চর্য হচ্ছ? আমি ওর থেকে অধিক আত্মসম্মানী। আর আল্লাহ্ আমার থেকেও অধিক আত্মসম্মানের অধিকারী। [৭৪১৬] (আধুনিক প্রকাশনী- ৬৩৬৯, ইসলামিক ফাউন্ডেশন- ৬৩৮২)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 6847,
			"arabicnumber": 6847,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত যে, এক বেদুঈন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট এসে বলল, হে আল্লাহর রাসূল! আমার স্ত্রী একটি কালো ছেলে জন্ম দিয়েছে। তখন তিনি বললেনঃ তোমার কোন উট আছে কি? সে বলল, হ্যাঁ আছে। তিনি বললেনঃ সেগুলোর রং কী? সে বলল, লাল। তিনি বললেনঃ সেগুলোর মধ্যে কি ছাই রং-এর কোন উট আছে? সে বলল, হ্যাঁ আছে। তিনি বললেন, এটা কোত্থেকে হল? সে বলল, আমার ধারণা যে, কোন শিরা (বংশমূল) একে টেনে এনেছে। তিনি বললেন, তাহলে হয়ত তোমার এ পুত্রকে কোন শিরা (বংশমূল) টেনে এনেছে। [৫৩০৫] (আধুনিক প্রকাশনী- ৬৩৭০, ইসলামিক ফাউন্ডেশন- ৬৩৮৩)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 6848,
			"arabicnumber": 6848,
			"text": "আবূ বুরদা (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলতেনঃ আল্লাহর নির্দিষ্ট হদসমূহের কোন হদ ছাড়া অন্য ক্ষেত্রে দশ বেত্রাঘাতের বেশি দন্ড দেয়া যাবে না। [৬৮৪৯, ৬৮৫০; মুসলিম ২৯/৯, হাঃ ১৭০৮, আহমাদ ১৬৪৮৬] (আধুনিক প্রকাশনী- ৬৩৭১, ইসলামিক ফাউন্ডেশন- ৬৩৮৪)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 6849,
			"arabicnumber": 6849,
			"text": "‘আবদুর রহমান ইবনু জাবির (রহ.) হতে বর্ণিত। তিনি এমন একজন থেকে বর্ণনা করেছেন যিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছেন যে, আল্লাহর নির্দিষ্ট হদসমূহের কোন হদ ছাড়া অন্য ক্ষেত্রে দশ প্রহারের অধিক কোন শাস্তি নেই। [৬৮৪৮] (আধুনিক প্রকাশনী- ৬৩৭২, ইসলামিক ফাউন্ডেশন- ৬৩৮৫)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 6850,
			"arabicnumber": 6850,
			"text": "আবূ বুরদা আনসারী (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি যে, আল্লাহর নির্দিষ্ট হদসমূহের কোন হদ ছাড়া অন্য ক্ষেত্রে দশ বেত্রাঘাতের অধিক মারা যাবে না। [৬৮৪৮; মুসলিম ২৯/৯, হাঃ ১৭০৮, আহমাদ ১৬৪৮৬] (আধুনিক প্রকাশনী- ৬৩৭৩, ইসলামিক ফাউন্ডেশন- ৬৩৮৬)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 6851,
			"arabicnumber": 6851,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন যে, রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক নাগাড়ে সিয়াম পালন থেকে নিষেধ করেছেন। তখন মুসলিমদের থেকে এক ব্যক্তি বলল, হে আল্লাহর রাসূল! আপনি তো এক নাগাড়ে সিয়াম পালন করেন। এ সময় রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আমার মত তোমাদের মাঝে কে আছে? আমি তো রাত্রি যাপন করি এমন হালাতে যে, আমার রব আমাকে পানাহার করান। যখন তারা এক নাগাড়ে সিয়াম পালন থেকে বিরত থাকল না তখন তিনি একদিন তাদের সঙ্গে এক নাগাড়ে (দিনের পর দিন) সিয়াম পালন করতে থাকলেন। এরপর যখন তারা নতুন চাঁদ দেখল তখন তিনি বললেনঃ যদি তা আরো দেরি হতো তাহলে আমি তোমাদের আরো বাড়িয়ে দিতাম। কথাটি যেন শাসন হিসেবে বললেন, যখন তারা বিরত থাকল না। শু‘আয়ব, ইয়াহইয়া ইবনু সা‘ঈদ ও ইউনুস (রহ.) যুহরী (রহ.) থেকে উকায়ল (রহ.) এর অনুসরণ করেছেন। ‘আবদুর রহমান ইবনু খালিদ (রহ.)......আবূ হুরাইরাহ (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণনা করেছেন। [১৯৬৫] (আধুনিক প্রকাশনী- ৬৩৭৪, ইসলামিক ফাউন্ডেশন- ৬৩৮৭)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 6852,
			"arabicnumber": 6852,
			"text": "‘আবদুল্লাহ্ ইবনু ‘উমার (রাঃ) হতে বর্ণিত যে, তাদেরকে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর যামানায় প্রহার করা হত যখন তারা অনুমানের ভিত্তিতে খাদ্যদ্রব্য কেনা বেচা করত। তারা তা যেন তাদের জায়গায় বিক্রি না করে যে পর্যন্ত না তারা তা আপন বিক্রয়ের জায়গায় ওঠায়। [২১২৩] (আধুনিক প্রকাশনী- ৬৩৭৫, ইসলামিক ফাউন্ডেশন- ৬৩৮৮)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 6853,
			"arabicnumber": 6853,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিজের ব্যক্তিগত বিষয়ের কোন প্রতিশোধ গ্রহণ করেননি, যে পর্যন্ত না আল্লাহর অলঙ্ঘনীয় সীমা অতিক্রম করা হয়। এমন হলে তিনি আল্লাহর জন্য প্রতিশোধ গ্রহণ করতেন। [৩৫৬০] (আধুনিক প্রকাশনী- ৬৩৭৬, ইসলামিক ফাউন্ডেশন- ৬৩৮৯)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 6854,
			"arabicnumber": 6854,
			"text": "সাহল ইবনু সা‘দ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি দু’জন লি‘আনকারীর ক্ষেত্রে দেখেছি যে, তাদের উভয়ের মাঝে বিচ্ছেদ ঘটানো হয়েছে। আমি তখন পনের বছরের যুবক ছিলাম। এরপর তার স্বামী বলল, আমি যদি তাকে রেখে দেই তাহলে তার উপর আমি মিথ্যা আরোপ করেছি। বর্ণনাকারী বলেন, আমি যুহরী (রহ.) থেকে তা স্মরণ রেখেছি যে, যদি সে এমন এমন গঠনের সন্তান জন্ম দেয় তাহলে সে সত্যবাদী। আর যদি এমন এমন গঠনের সন্তান জন্ম দেয় যেন টিকটিকির মত লাল, তাহলে সে মিথ্যাচারী। আমি যুহরী (রহ.)-কে বলতে শুনেছি যে, সে সন্তানটি ঘৃণ্য আকৃতির জন্ম নেয়। [৪২৩] (আধুনিক প্রকাশনী- ৬৩৭৭, ইসলামিক ফাউন্ডেশন- ৬৩৯০)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 6855,
			"arabicnumber": 6855,
			"text": "কাসিম ইবনু মুহাম্মাদ (রহ.) হতে বর্ণিত। তিনি বলেন যে, ইবনু ‘আব্বাস (রাঃ) দু’জন লি‘আনকারীর ব্যাপারে আলোচনা করলেন। তখন ‘আবদুল্লাহ্ ইবনু সাদ্দাদ (রহ.) বললেন, এ কি সে মহিলা যার সম্বন্ধে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমি যদি কোন মহিলাকে বিনা প্রমাণে পাথর মেরে হত্যা করতাম.....? তিনি বললেন, না। ওটা ঐ নারী যে প্রকাশ্যে অন্যায় কাজ করত। [৫৩১০] (আধুনিক প্রকাশনী- ৬৩৭৮, ইসলামিক ফাউন্ডেশন- ৬৩৯১)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 6856,
			"arabicnumber": 6856,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট লি‘আনকারীদের ব্যাপারে আলোচনা করা হল। তখন আসিম ইবনু আদী (রাঃ) তার সম্পর্কে কিছু কটূক্তি করলেন। তারপর তিনি ফিরে গেলেন। তখন তার স্বগোত্রের এক ব্যক্তি তার কাছে এসে অভিযোগ করল যে, সে তার স্ত্রীর কাছে অন্য এক লোককে পেয়েছে। আসিম (রাঃ) বলেন, আমি আমার এ উক্তির দরুনই এ পরীক্ষায় পড়েছি। এরপর তিনি তাকে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে নিয়ে গেলেন। আর সে তাঁকে ঐ লোক সম্পর্কে জানাল যার সঙ্গে তার স্ত্রীকে পেয়েছে। এ লোকটি গৌর বর্ণ, হাল্কা-পাতলা, সোজা চুলবিশিষ্ট ছিল। আর যে লোক সম্পর্কে দাবি করেছে যে, সে তাকে তার স্ত্রীর কাছে পেয়েছে সে ছিল মেটে বর্ণের, মোটা গোড়ালি, মোটা গোশ্তবিশিষ্ট। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ হে আল্লাহ্! স্পষ্ট করে দিন। ফলে সে মহিলাটি ঐ লোকের মত সন্তান জন্ম দিল যার কথা তার স্বামী উল্লেখ করেছিল যে, তাকে তার স্ত্রীর সঙ্গে পেয়েছে। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উভয়ের মধ্যে লি‘আন কার্যকর করলেন। তখন এক লোক এ মজলিসেই ইবনু ‘আব্বাস (রাঃ)-কে বলল, এটা কি সেই নারী যার সম্পর্কে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যদি আমি কাউকে বিনা প্রমাণে রজম করতাম তাহলে একে রজম করতাম? তিনি বলেন, না। ওটা ঐ নারী যে ইসলামে থাকা অবস্থায় প্রকাশ্যে অন্যায় কাজ করত। [৫৩১০] (আধুনিক প্রকাশনী- ৬৩৭৯, ইসলামিক ফাউন্ডেশন- ৬৩৯২)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 6857,
			"arabicnumber": 6857,
			"text": "(وَالَّذِينَ يَرْمُونَ الْمُحْصَنَاتِ ثُمَّ لَمْ يَأْتُوا بِأَرْبَعَةِ شُهَدَاءَ فَاجْلِدُوهُمْ ثَمَانِينَ جَلْدَةً وَلاَ تَقْبَلُوا لَهُمْ شَهَادَةً أَبَدًا وَأُولَئِكَ هُمْ الْفَاسِقُونَ إِلاَّ الَّذِينَ تَابُوا مِنْ بَعْدِ ذَلِكَ وَأَصْلَحُوا فَإِنَّ اللهَ غَفُورٌ رَحِيمٌ إِنَّ الَّذِينَ يَرْمُونَ الْمُحْصَنَاتِ الْغَافِلاَتِ الْمُؤْمِنَاتِ لُعِنُوا فِي الدُّنْيَا وَالْاٰخِرَةِ وَلَهُمْ عَذَابٌ عَظِيمٌ) আর যারা সাধ্বী নারীদের প্রতি অপবাদ দেয় এবং স্বপক্ষে চারজন সাক্ষী উপস্থিত করে না, তাদেরকে আশীটি বেত্রাঘাত কর....ক্ষমাশীল দয়ালু- (সূরাহ আন্-নূর ২৪/৪-৫)। যারা সাধ্বী, সরলমনা ও বিশ্বাসী নারীর প্রতি অপবাদ আরোপ করে.....। (সূরাহ আন্-নূর ২৪/২৩) ৬৮৫৭. আবূ হুরাইরাহ (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেছেনঃ তোমরা সাতটি ধ্বংসকারী বিষয় হতে বেঁচে থাক। তারা বললেন, হে আল্লাহর রাসূল! সেগুলো কী? তিনি বললেনঃ আল্লাহর সঙ্গে শরীক করা, জাদু, যথার্থ কারণ ছাড়া কাউকে হত্যা করা যা আল্লাহ্ হারাম করেছেন, সুদ খাওয়া, ইয়াতীমের মাল খাওয়া, জিহাদের ময়দান থেকে পিঠ ফিরিয়ে নেয়া, সাধ্বী বিশ্বাসী সরলমনা নারীদের প্রতি অপবাদ দেয়া।[1] [২৭৬৬] (আধুনিক প্রকাশনী- ৬৩৮০, ইসলামিক ফাউন্ডেশন- ৬৩৯৩)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 6858,
			"arabicnumber": 6858,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি আবুল কাসিম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি, যে কেউ আপন ক্রীতদাসের প্রতি অপবাদ আরোপ করল- অথচ সে তা থেকে পবিত্র যা সে বলেছে- ক্বিয়ামাত (কিয়ামত) দিবসে তাকে কশাঘাত করা হবে। তবে যদি এমনই হয় যেমন সে বলেছে (সে ক্ষেত্রে কশাঘাত করা হবে না)। [মুসলিম ২৭/৯, হাঃ ১৬৬০, আহমাদ ৯৫৭২] (আধুনিক প্রকাশনী- ৬৩৮১, ইসলামিক ফাউন্ডেশন- ৬৩৯৪)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 6860,
			"arabicnumber": 6860,
			"text": "",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 81
			}
		}
	]
}