{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"88": "Apostates"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6918,
			"arabicnumber": 6918,
			"text": "‘আবদুল্লাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, যখন এ আয়াত অবতীর্ণ হলোঃ যারা ঈমান এনেছে এবং তাদের ঈমানকে জুলুম দ্বারা কলুষিত করেনি ..... (সূরাহ আন‘আম ৬/৮২)। তখন তা রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সহাবাদের কাছে গুরুতর মনে হলো। তারা বললেন, আমাদের মাঝে এমন কে আছে যে তার ঈমানকে জুলুম দ্বারা কলুষিত করে না। তখন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তা অবশ্যই এমনটা নয়, তোমরা কি লুকমানের কথা শ্রবণ করনি? শিরকই বিরাট জুলুম (সীমালঙ্ঘন)- (সূরাহ লুক্বমান ৩১/১৩)। [৩২] (আধুনিক প্রকাশনী- ৬৪৩৮, ইসলামিক ফাউন্ডেশন- ৬৪৫০)",
			"grades": [],
			"reference": {
				"book": 88,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6919,
			"arabicnumber": 6919,
			"text": "আবূ বাকরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ সবচেয়ে কঠিন কবীরা গুনাহ্ হচ্ছে আল্লাহর সাথে শরীক করা, পিতা-মাতার অবাধ্য হওয়া ও মিথ্যা সাক্ষ্য দেয়া। মিথ্যা সাক্ষ্য কথাটি তিনবার বললেন। অথবা বলেছেন; মিথ্যা বক্তব্য। কথাটি বারবার বলতে থাকলেন, এমন কি আমরা আকাঙ্ক্ষা করতে লাগলাম, হায় যদি তিনি নীরব হয়ে যেতেন। [২৬৫৪] (আধুনিক প্রকাশনী- নাই, ইসলামিক ফাউন্ডেশন- ৬৪৫১)",
			"grades": [],
			"reference": {
				"book": 88,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6920,
			"arabicnumber": 6920,
			"text": "‘আবদুল্লাহ্ ইবনু ‘আমর (রাঃ) হতে বর্ণিত। তিনি বলেন, এক বেদুঈন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে এসে বলল, হে আল্লাহর রাসূল! কবীরা গুনাহ্সমূহ কী? তিনি বললেন, আল্লাহর সঙ্গে শরীক করা। সে বলল, তারপর কোনটি? তিনি বললেনঃ তারপর পিতা-মাতার অবাধ্যতা। সে বলল, তারপর কোনটি? তিনি বললেনঃ তারপর মিথ্যা কসম করা। আমি জিজ্ঞেস করলাম, মিথ্যা শপথ কী? তিনি বললেনঃ যে ব্যক্তি (শপথের সাহায্যে) মুসলিমের ধন-সম্পদ হরণ করে নেয়। অথচ সে এ শপথের ক্ষেত্রে মিথ্যাচারী। [৬৬৭৫] (আধুনিক প্রকাশনী- ৬৪৪০, ইসলামিক ফাউন্ডেশন- ৬৪৫২)",
			"grades": [],
			"reference": {
				"book": 88,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6921,
			"arabicnumber": 6921,
			"text": "ইবনু মাস্‘উদ (রাঃ) হতে বর্ণিত। তিনি বলেন, এক লোক বলল, হে আল্লাহর রাসূল! আমরা কি জাহিলী যুগের কাজ কর্মের জন্য পাকড়াও হবো? তিনি বললেনঃ যে লোক ইসলামী যুগে সৎ কাজ করবে সে জাহিলী যুগের কাজ কর্মের জন্য পাকড়াও হবে না। আর যে ব্যক্তি ইসলাম কবুলের পর অসৎ কাজ করবে, সে প্রথম ও পরবর্তীর জন্য (উভয় সময়ের কৃতকর্মের জন্য) পাকড়াও হবে।[1] [মুসলিম ১/৫৩, হাঃ ১২০, আহমাদ ৩৬০৪, ৩৮৮৬] (আধুনিক প্রকাশনী- ৬৪৪১, ইসলামিক ফাউন্ডেশন- ৬৪৫৩)",
			"grades": [],
			"reference": {
				"book": 88,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6922,
			"arabicnumber": 6922,
			"text": "وَقَالَ ابْنُ عُمَرَ وَالزُّهْرِيُّ وَإِبْرَاهِيمُ تُقْتَلُ الْمُرْتَدَّةُ وَقَالَ اللهُ تَعَالَى (كَيْفَ يَهْدِي اللهُ قَوْمًا كَفَرُوا بَعْدَ إِيمَانِهِمْ وَشَهِدُوا أَنَّ الرَّسُولَ حَقٌّ وَجَآءَهُمْ الْبَيِّنَاتُ وَاللهُ لاَ يَهْدِي الْقَوْمَ الظَّالِمِينَ أُولٰئِكَ جَزَاؤُهُمْ أَنَّ عَلَيْهِمْ لَعْنَةَ اللهِ وَالْمَلآئِكَةِ وَالنَّاسِ أَجْمَعِينَ خَالِدِينَ فِيهَا لاَ يُخَفَّفُ عَنْهُمْ الْعَذَابُ وَلاَ هُمْ يُنْظَرُونَ إِلاَّ الَّذِينَ تَابُوا مِنْ بَعْدِ ذٰلِكَ وَأَصْلَحُوا فَإِنَّ اللهَ غَفُورٌ رَحِيمٌ إِنَّ الَّذِينَ كَفَرُوا بَعْدَ إِيمَانِهِمْ ثُمَّ ازْدَادُوا كُفْرًا لَنْ تُقْبَلَ تَوْبَتُهُمْ وَأُولٰئِكَ هُمْ الضَّالُّونَ) وَقَالَ (يَا أَيُّهَا الَّذِينَ اٰمَنُوا إِنْ تُطِيعُوا فَرِيقًا مِنْ الَّذِينَ أُوتُوا الْكِتَابَ يَرُدُّوكُمْ بَعْدَ إِيمَانِكُمْ كَافِرِينَ) وَقَالَ (إِنَّ الَّذِينَ اٰمَنُوا ثُمَّ كَفَرُوا ثُمَّ اٰمَنُوا ثُمَّ كَفَرُوا ثُمَّ ازْدَادُوا كُفْرًا لَمْ يَكُنْ اللهُ لِيَغْفِرَ لَهُمْ وَلاَ لِيَهْدِيَهُمْ سَبِيلاً) وَقَالَ (مَنْ يَرْتَدَّ مِنْكُمْ عَنْ دِينِهِ فَسَوْفَ يَأْتِي اللهُ بِقَوْمٍ يُحِبُّهُمْ وَيُحِبُّونَهُ أَذِلَّةٍ عَلَى الْمُؤْمِنِينَ أَعِزَّةٍ عَلَى الْكَافِرِينَ) وَقَالَ (وَلَكِنْ مَنْ شَرَحَ بِالْكُفْرِ صَدْرًا فَعَلَيْهِمْ غَضَبٌ مِنْ اللهِ وَلَهُمْ عَذَابٌ عَظِيمٌ ذَلِكَ بِأَنَّهُمْ اسْتَحَبُّوا الْحَيَاةَ الدُّنْيَا عَلَى الْاٰخِرَةِ وَأَنَّ اللهَ لاَ يَهْدِي الْقَوْمَ الْكَافِرِينَ أُولٰئِكَ الَّذِينَ طَبَعَ اللهُ عَلٰى قُلُوبِهِمْ وَسَمْعِهِمْ وَأَبْصَارِهِمْ وَأُولٰئِكَ هُمْ الْغَافِلُونَ لاَ جَرَمَ يَقُولُ حَقًّا أَنَّهُمْ فِي الْاٰخِرَةِ هُمْ الْخَاسِرُونَ إِلٰى لَغَفُورٌ رَحِيمٌ وَلاَ يَزَالُونَ يُقَاتِلُونَكُمْ حَتّٰى يَرُدُّوكُمْ عَنْ دِينِكُمْ إِنْ اسْتَطَاعُوا وَمَنْ يَرْتَدِدْ مِنْكُمْ عَنْ دِينِهِ فَيَمُتْ وَهُوَ كَافِرٌ فَأُولٰئِكَ حَبِطَتْ أَعْمَالُهُمْ فِي الدُّنْيَا وَالْاٰخِرَةِ وَأُولٰئِكَ أَصْحَابُ النَّارِ هُمْ فِيهَا خَالِدُونَ) ইবনু ‘উমার (রাঃ) যুহরী ও ইব্রাহীম (রহ.) বলেন, ধর্মত্যাগী নারীকে হত্যা করা হবে এবং তার থেকে তওবা আহবান করা হবে। আল্লাহ্ বলেনঃ ঈমান আনার পর যে সম্প্রদায় সত্য প্রত্যাখ্যান করে তাদেরকে আল্লাহ্ কিভাবে সৎ পথের নির্দেশ দেবেন.....এরাই তারা যারা পথভ্রষ্ট পর্যন্ত। (সূরাহ আলে ‘ইমরান ৩/৮৬-৯০) আল্লাহর বাণীঃ যাদেরকে কিতাব দেয়া হয়েছে তোমরা যদি তাদের দল বিশেষের আনুগত্য কর তবে তারা তোমাদেরকে ঈমানের পর আবার সত্য প্রত্যাখ্যানকারীতে পরিণত করবে- (সূরাহ আলু ‘ইমরান ৩/১০০)। আল্লাহ্ বলেন, যারা ঈমান আনে, পরে কুফরী করে এবং আবার ঈমান অনে আবার কুফরী করে, এরপর তাদের কুফরী প্রবৃত্তি বৃদ্ধি পায় আল্লাহ্ তাদেরকে কিছুতেই ক্ষমা করবেন না এবং তাদের কোন পথও দেখাবেন না- (সূরাহ আন্-নিসা ৪/১৩৭)। আল্লাহ্ বলেন, তোমাদের মধ্যে কেউ দ্বীন হতে ফিরে গেলে আল্লাহ্ এমন এক জাতি আনবেন যাদেরকে তিনি ভালবাসবেন ও যারা তাঁকে ভালবাসবে- (সূরাহ আল-মায়িদাহ ৫/৫৪)। আল্লাহ্ বলেনঃ যারা সত্য প্রত্যাখ্যানের জন্য হৃদয় খুলে রাখে তাদের উপর পতিত হয় আল্লাহর গযব এবং তাদের জন্য আছে মহাশাস্তি। তা এজন্য যে, তারা ইহ জীবনকে পর জীবনের উপর প্রাধান্য দেয়- (সূরাহ নাহল ১৬/১০৬-১০৭)। لاَ جَرَمَ অর্থ حَقًّا - অবশ্যই তোমার প্রতিপালক তাদের জন্য যারা নির্যাতিত হবার পর দেশ ত্যাগ করে পরে জিহাদ করে এবং ধৈর্য ধারণ করে তোমার প্রতিপালক এসবের পর তাদের প্রতি অবশ্যই ক্ষমাশীল, পরম দয়ালু- (সূরাহ নাহল ১৬/১১০)। আল্লাহ্ বলেনঃ তারা সর্বদা তোমাদের বিরুদ্ধে যুদ্ধ করতে থাকবে, যে পর্যন্ত তোমাদেরকে তোমাদের দ্বীন হতে ফিরিয়ে না দেয়, যদি তারা সক্ষম হয়। তোমাদের মধ্যে যে কেউ স্বীয় দ্বীন হতে ফিরে যায় ও কাফির হয়ে মারা যায়, ইহকাল ও পরকালে তাদের কর্ম নিষ্ফল হয়ে যায়। এরাই আগুনের অধিবাসী, সেখানে তারা স্থায়ী হবে- (সূরাহ আল-বাক্বারাহ ২/২১৭)। ৬৯২২. ‘ইকরিমাহ (রহ.) হতে বর্ণিত। তিনি বলেন, ‘আলী (রাঃ)-এর কাছে একদল যিনদীককে (নাস্তিক ও ধর্মত্যাগীকে) আনা হল। তিনি তাদেরকে আগুন দিয়ে জ্বালিয়ে দিলেন। এ ঘটনা ইবনু আব্বাস (রাঃ)-এর কাছে পৌঁছলে তিনি বললেন, আমি কিন্তু তাদেরকে পুড়িয়ে ফেলতাম না। কেননা, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিষেধাজ্ঞা আছে যে, তোমরা আল্লাহর শাস্তি দ্বারা শাস্তি দিও না। বরং আমি তাদেরকে হত্যা করতাম। কারণ, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নির্দেশ আছে, যে কেউ তার দ্বীন বদলে ফেলে তাকে তোমরা হত্যা কর। [৩০১৭] (আধুনিক প্রকাশনী- ৬৪৪২, ইসলামিক ফাউন্ডেশন- ৬৪৫৪)",
			"grades": [],
			"reference": {
				"book": 88,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6923,
			"arabicnumber": 6923,
			"text": "আবূ মূসা (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে এলাম। আমার সঙ্গে আশ‘আরী গোত্রের দু’জন লোক ছিল। একজন আমার ডানদিকে, অপরজন আমার বামদিকে। আর রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তখন মিস্ওয়াক করছিলেন। উভয়েই তাঁর কাছে আবদার জানাল। তখন তিনি বললেনঃ হে আবূ মূসা! অথবা বললেন, হে ‘আবদুল্লাহ্ ইবনু কায়স! রাবী বলেন, আমি বললামঃ ঐ সত্তার কসম! যিনি আপনাকে সত্য দ্বীনসহ পাঠিয়েছেন, তারা তাদের অন্তরে কী আছে তা আমাকে জানায়নি এবং তারা যে চাকরি প্রার্থনা করবে তা আমি বুঝতে পারিনি। আমি যেন তখন তাঁর ঠোঁটের নিচে মিস্ওয়াকের প্রতি লক্ষ্য করছিলাম যে তা এক কোণে সরে গেছে। তখন তিনি বললেন, আমরা আমাদের কাজে এমন কাউকে নিযুক্ত করব না বা করি না যে নিজেই তা চায়। বরং হে আবূ মূসা! অথবা বললেন, হে ‘আবদুল্লাহ্ ইবনু কায়স! তুমি ইয়ামনে যাও। এরপর তিনি তার পেছনে মু‘আয ইবনু জাবাল (রাঃ)-কে পাঠালেন। যখন তিনি সেখানে পৌঁছলেন, তখন আবূ মূসা (রাঃ) তার জন্য একটি গদি বিছালেন আর বললেন, নেমে আসুন। ঘটনাক্রমে তার কাছে একজন লোক শেকলে বাঁধা ছিল। তিনি জিজ্ঞেস করলেন, ঐ লোকটি কে? আবূ মূসা (রাঃ) বললেন, সে প্রথমে ইয়াহূদী ছিল এবং মুসলিম হয়েছিল। কিন্তু আবার সে ইয়াহূদী হয়ে গেছে। আবূ মূসা (রাঃ) বললেন, বসুন। মু‘আয (রাঃ) বললেন, না, বসব না, যতক্ষণ না তাকে হত্যা করা হবে। এটাই আল্লাহ্ ও তাঁর রাসূলের ফায়সালা। কথাটি তিনি তিনবার বললেন। এরপর তার ব্যাপারে নির্দেশ দেয়া হল এবং তাকে হত্যা করা হল। তারপর তাঁরা উভয়ই কিয়ামুল্ লায়ল (রাত্রি জাগরণ) সম্পর্কে আলোচনা করলেন। তখন একজন বললেন, আমি কিন্তু ‘ইবাদাতও করি, নিদ্রাও যাই। আর নিদ্রার অবস্থায় ঐ আশা রাখি যা ‘ইবাদাত অবস্থায় রাখি।[1] [২২৬১; মুসলিম ৩৩/৩, হাঃ ১৮২৪, আহমাদ ১৯৬৮৬] (আধুনিক প্রকাশনী- ৬৪৪৩, ইসলামিক ফাউন্ডেশন- ৬৪৫৫)",
			"grades": [],
			"reference": {
				"book": 88,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6925,
			"arabicnumber": 6925,
			"text": "",
			"grades": [],
			"reference": {
				"book": 88,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6926,
			"arabicnumber": 6926,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। তিনি বলেন, এক ইয়াহূদী রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট দিয়ে গেল। আর বলল, আস্সামু আলাইকা। তার উত্তরে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ ওয়া আলাইকা। এরপর রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সাহাবীদের বললেনঃ তোমরা কি বুঝতে পেরেছ সে কী বলেছে? সে বলেছে, ‘আস্সামু আলাইকা’ (তোমার মরণ হোক)। তারা বলল, হে আল্লাহর রাসূল! আমরা কি তাকে হত্যা করব না? তিনি বললেনঃ না। বরং যখন কোন আহলে কিতাব তোমাদেরকে সালাম করবে তখন তোমরা বলবে, ‘ওয়া আলাইকুম’ (তোমাদের উপরও)।[1] [৬২৫৮] (আধুনিক প্রকাশনী- ৬৪৪৫, ইসলামিক ফাউন্ডেশন- ৬৪৫৭)",
			"grades": [],
			"reference": {
				"book": 88,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6927,
			"arabicnumber": 6927,
			"text": "আবূ নু‘আয়ম (রহ.) ‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, একদল ইয়াহূদী নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকটে প্রবেশের অনুমতি চাইল। (প্রবেশ করার সময়) তারা বলল ‘আস্সামু আলাইকা (তোমার মৃত্যু হোক)। তখন আমি বললাম, বরং তোদের উপর মৃত্যু ও লা‘নত হোক। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ হে ‘আয়িশাহ! আল্লাহ্ কোমল। তিনি সকল কাজে কোমলতা পছন্দ করেন। আমি বললাম, আপনি কি শুনেননি তারা কী বলেছে? তিনি বললেনঃ আমিও তো বলেছি ওয়া-আলাইকুম (এবং তোমাদের উপরও)। [২৯৩৫] (আধুনিক প্রকাশনী- ৬৪৪৬, ইসলামিক ফাউন্ডেশন- ৬৪৫৮)",
			"grades": [],
			"reference": {
				"book": 88,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6928,
			"arabicnumber": 6928,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ইয়াহূদীরা যখন তোমাদের কাউকে সালাম করে তারা ‘সামু ‘আলাইকুম’ বলে। তাই তোমরা বলবে, ‘আলাইকা- তোমাদের উপর। [৬২৫৭] (আধুনিক প্রকাশনী- ৬৪৪৭, ইসলামিক ফাউন্ডেশন- ৬৪৫৯)",
			"grades": [],
			"reference": {
				"book": 88,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6929,
			"arabicnumber": 6929,
			"text": "‘আবদুল্লাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি যেন লক্ষ্য করছিলাম যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কোন এক নবীর কথা বর্ণনা করেছেন যাকে তাঁর সম্প্রদায় প্রহার করে রক্তাক্ত করে ফেলে, আর তিনি আপন চেহারা থেকে রক্ত মুছছেন ও বলছেনঃ হে রব! তুমি আমার কাওমকে ক্ষমা করে দাও। কেননা, তারা বুঝে না।[1] [৩৪৭৭] (আধুনিক প্রকাশনী- ৬৪৪৮, ইসলামিক ফাউন্ডেশন- ৬৪৬০)",
			"grades": [],
			"reference": {
				"book": 88,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6930,
			"arabicnumber": 6930,
			"text": "وَقَوْلِ اللهِ تَعَالَى (وَمَا كَانَ اللهُ لِيُضِلَّ قَوْمًا بَعْدَ إِذْ هَدَاهُمْ حَتَّى يُبَيِّنَ لَهُمْ مَا يَتَّقُونَ) وَكَانَ ابْنُ عُمَرَ يَرَاهُمْ شِرَارَ خَلْقِ اللهِ وَقَالَ إِنَّهُمْ انْطَلَقُوا إِلَى آيَاتٍ نَزَلَتْ فِي الْكُفَّارِ فَجَعَلُوهَا عَلَى الْمُؤْمِنِينَ এবং আল্লাহর বাণীঃ ‘‘আল্লাহ্ এমন নন যে, তিনি কোন সম্প্রদায়কে পথ দেখানোর পর তাদেরকে গুমরাহ করবেন-তাদেরকে কী বিষয়ে সাবধানে চলতে হবে তা সুস্পষ্টরূপে ব্যক্ত না করা পর্যন্ত।’’ (সূরাহ আত্-তওবা ৯/১১৫) ইবনু ‘উমার (রাঃ) তাদেরকে আল্লাহর সৃষ্টির সবচেয়ে নিকৃষ্ট সৃষ্টি হিসেবে বিবেচনা করতেন এবং তিনি বলেছেন, তারা এমন কিছু আয়াতকে মু’মিনদের ওপর প্রয়োগ করেছে যা কাফিরদের ব্যাপারে নাযিল হয়েছে। ৬৯৩০. সুয়ায়দ ইবনু গাফালা (রাঃ) হতে বর্ণিত। তিনি বলেন, ‘আলী (রাঃ) বলেছেন, আমি যখন তোমাদেরকে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কোন হাদীস বয়ান করি ‘আল্লাহর শপথ! তখন তাঁর উপর মিথ্যা কথা আরোপ করার চেয়ে আকাশ থেকে নিচে পড়ে যাওয়াটা আমার কাছে শ্রেয়। কিন্তু আমি যদি আমার ও তোমাদের মধ্যকার বিষয় সম্পর্কে কিছু বলি, তাহলে মনে রাখতে হবে যে, যুদ্ধ একটি কৌশল। আমি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি, শেষ যুগে এমন এক সম্প্রদায়ের আবির্ভাব ঘটবে যারা হবে অল্পবয়স্ক যুবক, নির্বোধ। তারা সৃষ্টির সবচেয়ে শ্রেষ্ঠতম কথা থেকে আবৃত্তি করবে। অথচ ঈমান তাদের গলা অতিক্রম করবে না। তারা দ্বীন থেকে এমনভাবে বের হয়ে যাবে যেমন তীর শিকার ভেদ করে বের হয়ে যায়। তাদেরকে যেখানেই তোমরা পাবে হত্যা করবে। কেননা তাদেরকে হত্যা করলে হত্যাকারীর জন্য কিয়ামতের দিনে প্রতিদান আছে। [৩৬১১] (আধুনিক প্রকাশনী- ৬৪৪৯, ইসলামিক ফাউন্ডেশন- ৬৪৬১)",
			"grades": [],
			"reference": {
				"book": 88,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6931,
			"arabicnumber": 6931,
			"text": "আবূ সালামাহ ও ‘আত্বা ইবনু ইয়াসার (রহ.) হতে বর্ণিত যে, তারা আবূ সা‘ঈদ খুদরী (রাঃ)-এর কাছে এলেন। তারা তাঁকে ‘হারূরিয়্যা’ সম্প্রদায়ের ব্যাপারে প্রশ্ন করলেন যে, আপনি কি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে এদের ব্যাপারে কিছু শুনেছেন? তিনি বললেন, হারূরিয়্যা কী তা আমি জানি না। তবে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছি এ উম্মাতের মধ্যে বের হবে। তার থেকে সম্প্রদায়ের আবির্ভাব হবে কথাটি বলেননি। যাদের সালাতের তুলনায় তোমরা তোমাদের সালাতকে তুচ্ছ ভাববে। তারা কুরআন পড়বে বটে কিন্তু তা তাদের গলা অতিক্রম করবে না। তারা দ্বীন থেকে বের হয়ে যাবে যেমন তীর শিকার ভেদ করে বের হয়ে যায়। তীর নিক্ষেপকারী তীরের প্রতি, তার অগ্রাংশের প্রতি, তীরের মুখে বেষ্টনীর প্রতি লক্ষ্য করে, তীরের ছিলার বেলায়ও সন্দেহ হয় যে তাতে কিছু রক্ত লেগে থাকল কি না।[1] [৩৩৪৪] (আধুনিক প্রকাশনী- ৬৪৫০, ইসলামিক ফাউন্ডেশন- ৬৪৬২)",
			"grades": [],
			"reference": {
				"book": 88,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6932,
			"arabicnumber": 6932,
			"text": "‘আবদুল্লাহ্ ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি হারুরিয়্যা সম্পর্কে আলোচনা করছিলেন। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তারা ইসলাম থেকে এমনিভাবে বের হয়ে যাবে যেমন তীর শিকার থেকে বের হয়ে যায়। (আধুনিক প্রকাশনী- ৬৪৫১, ইসলামিক ফাউন্ডেশন- ৬৪৬৩)",
			"grades": [],
			"reference": {
				"book": 88,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6933,
			"arabicnumber": 6933,
			"text": "আবূ সা‘ঈদ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কোন কিছু বণ্টন করছিলেন। ঘটনাক্রমে ‘আবদুল্লাহ্ ইবনু যুলখুওয়ায়সিরা তামীমী এল এবং বলল, হে আল্লাহর রাসূল! ইনসাফ করুন। তিনি বললেনঃ আফসোস তোমার জন্য! আমি যদি ইনসাফ না করি তা হলে আর কে ইন্সাফ করবে? ‘উমার ইবনু খাত্তাব (রাঃ) বললেন, আমাকে অনুমতি দিন, তার গর্দান উড়িয়ে দেই। তিনি বললেনঃ তাকে ছেড়ে দাও। তার জন্য সাথীরা আছে। যাদের সালাতের তুলনায় তোমরা তোমাদের সালাতকে তুচ্ছ মনে করবে। যাদের সিয়ামের তুলনায় তোমরা তোমাদের সিয়ামকে তুচ্ছ মনে করবে। তারা দ্বীন থেকে এমনিভাবে বেরিয়ে যাবে যেমন তীর শিকার ভেদ করে বেরিয়ে যায়। তীরের প্রতি লক্ষ্য করলে তাতে কিছু পাওয়া যায় না। তীরের মুখের বেষ্টনীর প্রতি লক্ষ্য করলেও কিছু পাওয়া যায় না। তীরের কাঠের অংশের দিকে দেখলেও তাতে কিছু পাওয়া যায় না। বরং তীর তীব্র গতিতে বেরিয়ে যাবার সময় তাতে মল ও রক্তের দাগ পর্যন্ত লাগে না। তাদের পরিচয় এই যে, তাদের একটি লোকের একটি হাত অথবা বলেছেন, একটি স্তন হবে মহিলাদের স্তনের ন্যায়। অথবা বলেছেন, অতিরিক্ত গোশতের টুকরার ন্যায়। লোকদের মধ্যে বিরোধের সময় তাদের আবির্ভাব ঘটবে। আবূ সা‘ঈদ (রাঃ) বলেন, আমি সাক্ষ্য দিচ্ছি যে, আমি তা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে শুনেছি। এও সাক্ষ্য দিচ্ছি যে, ‘আলী (রাঃ) তাদেরকে হত্যা করেছেন। আমি তখন তাঁর সঙ্গে ছিলাম। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর দেয়া বর্ণনার সংগে মিলে এমন ব্যক্তিকে আনা হয়েছিল। তিনি বলেন, ওর সম্পর্কেই অবতীর্ণ হয়েছেঃ ‘‘ওদের মধ্যে এমন লোক আছে যে সাদাকাহ সম্পর্কে তোমাকে দোষারোপ করে’’- (সূরাহ আত্-তওবা ৯/৫৮)। (আধুনিক প্রকাশনী- ৬৪৫২, ইসলামিক ফাউন্ডেশন- ৬৪৬৪)",
			"grades": [],
			"reference": {
				"book": 88,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 6934,
			"arabicnumber": 6934,
			"text": "ইউসায়র ইবনু ‘আমর (রহ.) হতে বর্ণিত। তিনি বলেন, আমি সাহল ইবনু হুনায়ফ (রাঃ)-কে জিজ্ঞেস করলাম, আপনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে খারিজীদের সম্পর্কে কিছু বলতে শুনেছেন কি? তিনি বললেন, আমি তাকে বলতে শুনেছি, আর তখন তিনি তাঁর হাত ইরাকের দিকে বাড়িয়েছিলেন যে, সেখান থেকে এমন একটি সম্প্রদায় বের হবে যারা কুরআন পড়বে সত্য, কিন্তু তা তাদের গলা অতিক্রম করবে না, তারা ইসলাম থেকে বেরিয়ে যাবে যেমন তীর শিকার ভেদ করে বেরিয়ে যায়। [৩৩৪৪; মুসলিম ১২/৪৯, হাঃ ১০৬৮] (আধুনিক প্রকাশনী- ৬৪৫৩, ইসলামিক ফাউন্ডেশন- ৬৪৬৫)",
			"grades": [],
			"reference": {
				"book": 88,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 6935,
			"arabicnumber": 6935,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ক্বিয়ামাত (কিয়ামত) সংঘটিত হবে না, যতক্ষণ না এমন দু’টি দল পরস্পর লড়াই করবে, যাদের দাবী হবে অভিন্ন।[1] [৮৫] (আধুনিক প্রকাশনী- ৬৪৫৪, ইসলামিক ফাউন্ডেশন- ৬৪৬৬)",
			"grades": [],
			"reference": {
				"book": 88,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 6936,
			"arabicnumber": 6936,
			"text": "‘উমার ইবনু খাত্তাব (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি হিশাম ইবনু হাকীম (রাঃ)-কে রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর জীবিত অবস্থায় সূরা ফুরকান পড়তে শুনেছি। আমি তার পড়ার প্রতি কর্ণপাত করলাম, (আমি লক্ষ্য করলাম) যে, তিনি এর অনেকগুলো অক্ষর এমন নিয়মে পড়ছেন, যে নিয়মে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে পড়াননি। ফলে আমি তাকে সালাতের মাঝেই আক্রমণ করতে প্রস্তুত হলাম। কিন্তু সালাম ফিরানো পর্যন্ত অপেক্ষা করলাম। সালাম ফিরানোর পর আমি তাকে তার চাদর দিয়ে অথবা বললেন আমার চাদর দিয়ে জড়িয়ে ধরলাম। আর বললাম, তোমাকে এ সূরা কে পড়িয়েছে? তিনি বললেন, রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে তা পড়িয়েছেন। আমি তাকে বললাম, তুমি মিথ্যা বলছ। আল্লাহর শপথ! রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে এ সূরা পড়িয়েছেন যা তোমাকে পড়তে শুনেছি। তারপর আমি তাকে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট টেনে নিয়ে গেলাম। আমি বললাম, হে আল্লাহর রাসূল! আমি এ লোককে সূরাহ ফুরক্বান এমন অক্ষর দিয়ে পড়তে শুনেছি যা আপনি আমাকে পড়াননি। আর আপনি তো আমাকে সূরাহ ফুরক্বান পড়িয়েছেন। তিনি বলেন, তখন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ হে উমর! তাকে ছেড়ে দাও। (আর বললেন) হে হিশাম! তুমি পড় তো। হিশাম তাঁর কাছে সেভাবেই পড়লেন, যেভাবে তাকে তা পড়তে আমি শুনেছিলাম। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ এভাবেই অবতীর্ণ করা হয়েছে। এরপর রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ হে ‘উমার! তুমিও পড়। আমি পড়লাম। তখন তিনি বললেনঃ এভাবেও অবতীর্ণ করা হয়েছে। অতঃপর বললেনঃ এ কুরআন সাত (কিরাআতে) ভাষায় অবতীর্ণ করা হয়েছে। কাজেই যে পদ্ধতিতেই সহজ হয় সে পদ্ধতিতেই তোমরা তা পাঠ কর।[1] [২৪১৯] (আধুনিক প্রকাশনী- , ইসলামিক ফাউন্ডেশন- ৬৪৬৭৪)",
			"grades": [],
			"reference": {
				"book": 88,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 6937,
			"arabicnumber": 6937,
			"text": "‘আবদুল্লাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, যখন এ আয়াত অবতীর্ণ হলঃ যারা ঈমান এনেছে এবং তাদের ঈমানকে যুল্ম দ্বারা কলুষিত করেনি- (সূরাহ আন‘আম ৬/৮২), তখন তা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সহাবাদের জন্য কঠিন মনে হল। তারা বলল, আমাদের মধ্যে এমন কে আছে যে তার ঈমানকে যুল্ম দ্বারা কলুষিত করে না? তখন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমরা যেভাবে ধারণা করছ তা তেমন নয়। বরং এটা হচ্ছে ঐরূপ যেমন লুক্মান (আঃ) তার পুত্রকে বলেছিলেনঃ ‘‘হে বৎস! আল্লাহর সঙ্গে কোন শরীক করো না। শির্ক তো বড় যুল্ম (সীমালঙ্ঘন)’’- (সূরাহ লুক্বমান ৩১/১৩)।[1] [৩২] (আধুনিক প্রকাশনী- ৬৪৫৫, ইসলামিক ফাউন্ডেশন- ৬৪৬৮)",
			"grades": [],
			"reference": {
				"book": 88,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 6938,
			"arabicnumber": 6938,
			"text": "ইতবান ইবনু মালিক (রাঃ) হতে বর্ণিত। তিনি বলেন, একবার রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সকালে আমার কাছে আসলেন। তখন এক লোক বলল, মালিক ইবনু দুখ্শুন কোথায়? আমাদের এক ব্যক্তি বলল, সে তো মুনাফিক; সে আল্লাহ্ ও তাঁর রাসূলকে ভালবাসে না। তা শুনে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমরা কি এ কথা বলনি যে, সে আল্লাহর সন্তুষ্টি চেয়ে ‘লা- ইলা-হা ইল্লাল্লাহ্’ বলে। তারা বললেন, হ্যাঁ। তিনি বললেনঃ যে কোন বান্দা কিয়ামতের দিন ঐ কথা নিয়ে উপস্থিত হবে, আল্লাহ্ তার উপর জাহান্নাম হারাম করে দেবেন। [৪২৪] (আধুনিক প্রকাশনী- ৬৪৫৬, ইসলামিক ফাউন্ডেশন- ৬৪৬৯)",
			"grades": [],
			"reference": {
				"book": 88,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 6939,
			"arabicnumber": 6939,
			"text": "একজন রাবী হতে বর্ণিত। তিনি বলেন, কোন কারণে আবূ ‘আবদুর রহমান ও হিব্বান ইবনু আতিয়্যার মাঝে ঝগড়া বাধে। আবূ ‘আবদুর রহমান হিব্বানকে বললেন, আমি অবশ্যই জানি যে, কোন্ বিষয়টি আপনার সাথীকে রক্তপাতে দুঃসাহস জুগিয়েছে। সাথী, অর্থাৎ ‘আলী (রাঃ)। সে বলল, সে কী! তোমার পিতা জীবিত না থাকুক। আবূ ‘আবদুর রহমান বলল, তা ‘আলী (রাঃ)-কে বলতে শুনেছি। হিববান বলল, সে কী? আবদুর রহমান বলল, যুবায়র, আবূ মারছাদ এবং আমাকে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পাঠালেন। আমরা সকলেই অশ্বারোহী ছিলাম। তিনি বললেনঃ তোমরা রওযায়ে হাজ পর্যন্ত যাবে। আবূ সালামাহ (রহ.) বলেন, আবূ আওয়ানা (রহ.) সেরকমই বলেছেন। সেখানে একজন মহিলা আছে, যার কাছে হাতিব ইবনু আবূ বালতা‘আ (রাঃ)-এর পক্ষ থেকে (মক্কার) মুশরিকদের কাছে পাঠানো একখানা চিঠি আছে। তোমরা তাকে আমার কাছে নিয়ে আসবে। আমরা আমাদের ঘোড়ায় চড়ে রওনা দিলাম। অবশেষে আমরা তাকে ঐ জায়গায় পেলাম যে জায়গার কথা আমাদের রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছিলেন। সে তার উটে চলছে। আবূ বালতা‘আ (রাঃ) মক্কাবাসীদের কাছে তাদের দিকে রাসূলুল্লাহর সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রওনা হওয়ার সংবাদ জানিয়ে পত্র লিখেছেন। আমরা বললাম, তোমার সঙ্গে যে পত্র আছে তা কোথায়? সে বলল, আমার সঙ্গে কোন পত্র নেই। আমরা তার উটকে বসালাম এবং তার হাওদায় খুঁজলাম। কিন্তু কিছুই পেলাম না। তখন আমার সাথী দু’জন বলল, তার সঙ্গে তো আমরা কোন পত্র দেখছি না। আমি বললাম, আমরা অবশ্যই জানি যে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মিথ্যা বলেননি। তারপর ‘আলী (রাঃ) এই ব’’ল কসম করে বললেন, ঐ সত্তার কসম! যাঁর নামে কসম করা হয়, অবশ্যই তোমাকে চিঠি বের করে দিতে হবে। নইলে তোমাকে উলঙ্গ করে ফেলব। তখন সে তার চাদর বাঁধা কোমরের প্রতি দৃষ্টি দিল এবং (সেখান থেকে) চিঠিটি বের করে দিল। তারা চিঠিটি নিয়ে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট হাজির হলেন। তখন ‘উমার (রাঃ) বললেন, হে আল্লাহর রাসূল! সে আল্লাহ্, তাঁর রাসূল ও মু’মিনদের সঙ্গে খিয়ানত করেছে। আপনি আমাকে অনুমতি দিন, আমি তার গর্দান উড়িয়ে দেই। তখন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জিজ্ঞেস করলেনঃ হে হাতিব! এ কাজে তোমাকে কিসে উদ্বুদ্ধ করেছে? তিনি বললেন, হে আল্লাহর রাসূল! আমি কেন আল্লাহ্ ও তাঁর রাসূলের প্রতি ঈমান রাখব না। আসল কথা হল, আমি চাচ্ছিলাম যে, মক্কা্বাসীর প্রতি আমার দ্বারা অনুগ্রহের কাজ হোক যার বিনিময়ে আমার পরিবারবর্গ ও মাল ধন রক্ষা পায়। আপনার সঙ্গীদের সকলেরই সেখানে নিজ গোত্রীয় এমন লোক আছে, যাদের মাধ্যমে আল্লাহ্ তার পরিবারবর্গ ও মাল ধন রক্ষার ব্যবস্থা করবেন। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ সে ঠিকই বলেছে। কাজেই তোমরা তার সম্পর্কে ভালো ব্যতীত মন্দ কোন কথা বলো না। বর্ণনাকারী বলেন, ‘উমার (রাঃ) পুনরায় বললেন, হে আল্লাহর রাসূল! সে আল্লাহ্, তাঁর রাসূল ও মু’মিনদের সঙ্গে খিয়ানত করেছে। আমাকে অনুমতি দিন, আমি তার গর্দান উড়িয়ে দেই। তিনি বললেন, সে কি বাদ্র যুদ্ধে অংশগ্রহণকারী নয়? তুমি কী করে জানবে আল্লাহ্ তাদের প্রতি লক্ষ্য করে বলেছেনঃ তোমরা যা ইচ্ছে কর, তোমাদের জন্য জান্নাত নির্ধারিত করে দিয়েছি। এ কথা শুনে ‘উমার (রাঃ)-এর দু'চোখ অশ্রুসিক্ত হয়ে গেল এবং তিনি বললেন, আল্লাহ্ ও তাঁর রাসূলই অধিক জানেন।[1] [৩০০৭] আবূ ‘আবদুল্লাহ্ [বুখারী (রহ.)] বলেন, خَاخٍ সবচেয়ে বিশুদ্ধ। তবে আবূ আওয়ানা (রহ.) অনুরূপ حَاجٍ বলেছেন, আবূ ‘আবদুল্লাহ্ [বুখারী (রহ.)] বলেছে خََاجٍ বিকৃতি। আর এটি একটি স্থান। হুশায়ম (রহ.) خَاخٍ বলেছেন। (আধুনিক প্রকাশনী- ৬৪৫৭, ইসলামিক ফাউন্ডেশন- ৬৪৭০)",
			"grades": [],
			"reference": {
				"book": 88,
				"hadith": 21
			}
		}
	]
}