{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"89": "(Statements made under) Coercion"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6940,
			"arabicnumber": 6940,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সালাতে দু‘আ করতেন। হে আল্লাহ্! আইয়াশ ইবনু আবূ রাবী‘আ, সালামাহ ইবনু হিশাম, ওয়ালীদ ইবনু ওয়ালীদকে মুক্তি দাও। হে আল্লাহ্! দুর্বল মু’মিনদেরকে মুক্তি দাও। হে আল্লাহ্! মুযার গোত্রের উপর তোমার পাঞ্জা কঠোর করে দাও এবং তাদের ওপর ইউসুফের দুর্ভিক্ষের বছরগুলোর মত বছর পাঠিয়ে দাও। [৭৯৭] (আধুনিক প্রকাশনী- ৬৪৫৮, ইসলামিক ফাউন্ডেশন- ৬৪৭১)",
			"grades": [],
			"reference": {
				"book": 89,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6941,
			"arabicnumber": 6941,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তিনটি জিনিস এমন যার মধ্যে সেগুলো পাওয়া যাবে, সে ঈমানের স্বাদ পাবে। ১. আল্লাহ্ ও তাঁর রাসূল তার কাছে আর সবকিছুর চেয়ে প্রিয় হওয়া। ২. কাউকে কেবল আল্লাহর জন্য ভালবাসা। ৩. জাহান্নামে নিক্ষিপ্ত হওয়াকে যেভাবে অপছন্দ করে, তেমনি পুনরায় কুফরীর দিকে ফিরে যাওয়াকে অপছন্দ করে। [১৬] (আধুনিক প্রকাশনী- ৬৪৫৯, ইসলামিক ফাউন্ডেশন- ৬৪৭২)",
			"grades": [],
			"reference": {
				"book": 89,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6942,
			"arabicnumber": 6942,
			"text": "কায়স (রহ.) হতে বর্ণিত। তিনি বলেন, আমি সা‘ঈদ ইবনু যায়দ (রাঃ)-কে বলতে শুনেছি যে, আমি মনে করি ‘উমার (রাঃ)-এর কঠোরতা আমাকে ইসলামের উপর সুদৃঢ় করে দিয়েছে। তোমরা ‘উসমান (রাঃ)-এর সঙ্গে যা করেছ তাতে যদি উহুদ পর্বত ফেটে যেত তা হলে ফেটে যাওয়া ন্যায়সঙ্গতই হত।[1] [৩৮৬২] (আধুনিক প্রকাশনী- ৬৪৬০, ইসলামিক ফাউন্ডেশন- ৬৪৭৩)",
			"grades": [],
			"reference": {
				"book": 89,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6943,
			"arabicnumber": 6943,
			"text": "খাব্বাব ইবনু আরাত্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমরা রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে কোন বিষয়ে অভিযোগ পেশ করলাম। তখন তিনি কা‘বা ঘরের ছায়ায় তাঁর চাদরকে বালিশ বানিয়ে বিশ্রাম নিচ্ছিলেন। আমরা বললাম, (আমাদের জন্য কি) সাহায্য চাইবেন না? আমাদের জন্য কি দু‘আ করবেন না? তিনি বললেনঃ তোমাদের আগের লোকদের মাঝে এমন ব্যক্তিও ছিল, যাকে ধরে নিয়ে তার জন্য যমীনে গর্ত করা হত। তারপর করাত এনে মাথায় আঘাত হেনে দু’ টুকরা করে ফেলা হত। লোহার শলাকা দিয়ে তার গোশত ও হাড্ডি খসানো হত। তা সত্বেও তাকে তার দ্বীন থেকে ফিরিয়ে রাখতে পারত না। আল্লাহর কসম! এ দ্বীন অবশ্যই পূর্ণতা লাভ করবে। এমন হবে যে সান‘আ থেকে হাযরামাওত পর্যন্ত ভ্রমণকারী ভ্রমণ করবে। অথচ সে আল্লাহ্ ছাড়া কাউকে ভয় করবে না এবং নিজের মেষ পালের জন্য বাঘের ভয় থাকবে, কিন্তু তোমরা তাড়াহুড়ো করছ। [৩৬১২] (আধুনিক প্রকাশনী- ৬৪৬১, ইসলামিক ফাউন্ডেশন- ৬৪৭৪)",
			"grades": [],
			"reference": {
				"book": 89,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6944,
			"arabicnumber": 6944,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, একবার আমরা মসজিদে ছিলাম। হঠাৎ রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের নিকট বেরিয়ে এসে বললেনঃ তোমরা ইয়াহূদীদের কাছে চল। আমি তাঁর সঙ্গে বের হয়ে গেলাম এবং বায়তুল-মিদ্রাস নামক শিক্ষাকেন্দ্রে গিয়ে পৌঁছলাম। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দাঁড়িয়ে তাদেরকে উদ্দেশ্য করে বললেনঃ হে ইয়াহূদী সম্প্রদায়! তোমরা মুসলিম হয়ে যাও, নিরাপদ থাকবে। তারা বলল, হে আবুল কাসিম! আপনি (আপনার দায়িত্ব) পৌঁছে দিয়েছেন। তিনি বললেনঃ এটাই আমি চাই। তারপর দ্বিতীয়বার কথাটি বললেন। তারা বলল, হে আবুল কাসিম! আপনি পৌঁছে দিয়েছেন। এরপর তিনি তৃতীয়বার তা আবার বললেন। আর বললেনঃ তোমরা জেনে রেখো যে, যমীন কেবল আল্লাহ্ ও তাঁর রাসূলের। আমি তোমাদেরকে দেশান্তর করতে মনস্থ করেছি। তাই তোমাদের যার অস্থাবর সম্পত্তি রয়েছে, তা যেন সে বিক্রি করে ফেলে। তা না হলে জেনে রেখো, যমীন কেবল আল্লাহ্ ও তাঁর রাসূলের।[1] [৩১৬৭; মুসলিম ৩২/২০, হাঃ ১৭৬৫, আহমাদ ৯৮৩৩] (আধুনিক প্রকাশনী- ৬৪৬২, ইসলামিক ফাউন্ডেশন- ৬৪৭৫)",
			"grades": [],
			"reference": {
				"book": 89,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6945,
			"arabicnumber": 6945,
			"text": "আল্লাহ্ বলেনঃ তোমরা দাসীগণকে ব্যভিচারে বাধ্য করো না ........। (সূরাহ আন্-নূর ২৪/৩৩) ৬৯৪৫. খানসা বিন্‌ত খিযাম আনসারী (রাঃ) হতে বর্ণিত যে, তাকে তার পিতা (অনুমতি ছাড়া) বিয়ে দিলেন। আর সে ছিল বিধবা। এ বিয়ে সে অপছন্দ করল। তাই সে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে এসে জানাল। ফলে তিনি তার এ বিয়ে বাতিল করে দিলেন।[1] [৫১৩৮] (আধুনিক প্রকাশনী- ৬৪৬৩, ইসলামিক ফাউন্ডেশন- ৬৪৭৬)",
			"grades": [],
			"reference": {
				"book": 89,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6946,
			"arabicnumber": 6946,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি বললাম, হে আল্লাহর রাসুল! মহিলাদের বিয়ে দেয়ার ক্ষেত্রে তাদের অনুমতি নিতে হবে কি? তিনি বললেন, হ্যাঁ। আমি বললাম, কুমারীর কাছে অনুমতি চাইলে তো লজ্জাবোধ করে; ফলে সে নীরব। তিনি বললেনঃ তার নীরবতাই তার অনুমতি। [৫১৩৭; মুসলিম ১৬/৮, হাঃ ১৪২০, আহমাদ ২৪২৪০] (আধুনিক প্রকাশনী- ৬৪৬৪, ইসলামিক ফাউন্ডেশন- ৬৪৭৭)",
			"grades": [],
			"reference": {
				"book": 89,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6947,
			"arabicnumber": 6947,
			"text": "وَقَالَ بَعْضُ النَّاسِ فَإِنْ نَذَرَ الْمُشْتَرِي فِيهِ نَذْرًا فَهُوَ جَائِزٌ بِزَعْمِهِ وَكَذَلِكَ إِنْ دَبَّرَهُ কেউ কেউ সে রকমই রায় পোষণ করেন। অন্য পক্ষে তার মতে ক্রেতা যদি এতে কিছু মানত করে তাহলে তা কার্যকর হবে। তদ্রূপ তাকে যদি মুদাব্বার বানিয়ে নেয় তাহলে তা কার্যকর হবে। ৬৯৪৭. জাবির (রাঃ) হতে বর্ণিত। এক আনসারী লোক তার এক গোলাম মুদাববার বানিয়ে দেয়। অথচ তার এছাড়া অন্য কোন মাল ছিল না। এ সংবাদ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট পৌঁছলে তিনি বললেনঃ কে আমার নিকট হতে এ গোলাম কিনে নিবে? নু‘আয়ম ইবনু নাহ্হাম (রাঃ) আটশ’ দিরহামে তাকে ক্রয় করলেন। রাবী বলেন, আমি জাবির (রাঃ)-কে বলতে শুনেছি, ঐ গোলামটি কিব্তী গোলাম ছিল এবং (ক্রয়ের) প্রথম বছরই মারা যায়। [২১৪১] (আধুনিক প্রকাশনী- ৬৪৬৫, ইসলামিক ফাউন্ডেশন- ৬৪৭৮)",
			"grades": [],
			"reference": {
				"book": 89,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6948,
			"arabicnumber": 6948,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি এ আয়াতঃ ‘‘হে মু’মিনগণ! নারীদেরকে জোরপূর্বক তোমাদের উত্তরাধিকার মনে করা তোমাদের জন্য বৈধ নয়......’’- (সূরাহ আন্-নিসা ৪/১৯)। এর ব্যাখ্যায় বলেন, তাদের নিয়ম ছিল, যখন কোন লোক মারা যেত তখন তার অভিভাবকগণই তার স্ত্রীর ব্যাপারে অধিক হক্দার বলে মনে করত। ইচ্ছা করলে তাদের মধ্যে কেউ তাকে বিয়ে করত, ইচ্ছা করলে তাকে (অন্যত্র) বিয়ে দিত, আর ইচ্ছা করলে তাকে বিয়ে দিত না। স্ত্রীর অভিভাবকদের তুলনায় নিজেদেরকে অধিক হকদার তারাই মনে করত। এ সম্পর্কেই উক্ত আয়াত অবতীর্ণ হয়। [৪৫৭৯] (আধুনিক প্রকাশনী- ৬৪৬৬, ইসলামিক ফাউন্ডেশন- ৬৪৭৯)",
			"grades": [],
			"reference": {
				"book": 89,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6949,
			"arabicnumber": 6949,
			"text": "লায়স (রহ.) ... নাফি‘ (রহ.)-এর সূত্রে বর্ণনা করেন যে, সফীয়্যাহ বিন্ত আবূ ‘উবায়দ তাকে সংবাদ দিয়েছেন যে, সরকারী মালিকানাধীন এক গোলাম গনীমতের পঞ্চমাংশে পাওয়া এক দাসীর সঙ্গে জবরদস্তি করে যিনা করে। তাতে তার কুমারীত্ব মুছে যায়। ‘উমার (রাঃ) উক্ত গোলামকে কশাঘাত করলেন ও নির্বাসন দিলেন। কিন্তু দাসীটিকে সে বাধ্য করেছিল বলে কশাঘাত করলেন না। যুহরী (রহ.) কুমারী দাসীর ব্যাপারে বলেন, যার কুমারীত্ব কোন আযাদ ব্যক্তি ছিন্ন করে ফেলল, বিচারক ঐ কুমারী দাসীর মূল্য অনুপাতে তার জন্য ঐ আযাদ ব্যক্তির নিকট হতে কুমারীত্ব মুছে ফেলার দিয়াত গ্রহণ করবেন এবং ওকে কশাঘাত করবেন। আর বিবাহিতা দাসীর ক্ষেত্রে ইমামদের সিদ্ধান্ত অনুযায়ী কোন জরিমানা নেই। কিন্তু তার উপর ‘হদ’ জারি হবে।[1] (আধুনিক প্রকাশনী- অনুচ্ছেদ, ইসলামিক ফাউন্ডেশন- অনুচ্ছেদ)",
			"grades": [],
			"reference": {
				"book": 89,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6950,
			"arabicnumber": 6950,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ইব্রাহীম (আঃ) ‘সারা’ (আঃ)-কে নিয়ে হিজরাত করে এমন এক জনপদে আসলেন, যেখানে একজন স্বৈরাচারী বাদশাহ্ ছিল। সে তাঁকে বলে পাঠাল যে, যেন তিনি ‘সারা’ কে তার নিকট পাঠিয়ে দেন। তিনি তাকে পাঠিয়ে দিলেন। সে ‘সারার’ দিকে অগ্রসর হতে লাগল। অপর দিকে ‘সারা’ ওযূ করে সালাত আদায় করতে লাগলেন। আর বললেন, হে আল্লাহ্! আমি যদি তোমার ও তোমার রাসূলের প্রতি ঈমান এনে থাকি তাহলে আমার উপর ঐ কাফিরকে ক্ষমতা দিও না। ফলে সে শ্বাসরুদ্ধ হয়ে (মাটিতে পড়ে) গোড়ালি দিয়ে ঘর্ষণ করতে লাগল। [২২১৭] (আধুনিক প্রকাশনী- ৬৪৬৭, ইসলামিক ফাউন্ডেশন- ৬৪৮০)",
			"grades": [],
			"reference": {
				"book": 89,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6951,
			"arabicnumber": 6951,
			"text": "وَكَذَلِكَ كُلُّ مُكْرَهٍ يَخَافُ فَإِنَّهُ يَذُبُّ عَنْهُ الْمَظَالِمَ وَيُقَاتِلُ دُونَهُ وَلاَ يَخْذُلُهُ فَإِنْ قَاتَلَ دُونَ الْمَظْلُومِ فَلاَ قَوَدَ عَلَيْهِ وَلاَ قِصَاصَ وَإِنْ قِيلَ لَهُ لَتَشْرَبَنَّ الْخَمْرَ أَوْ لَتَأْكُلَنَّ الْمَيْتَةَ أَوْ لَتَبِيعَنَّ عَبْدَكَ أَوْ تُقِرُّ بِدَيْنٍ أَوْ تَهَبُ هِبَةً وَتَحُلُّ عُقْدَةً أَوْ لَنَقْتُلَنَّ أَبَاكَ أَوْ أَخَاكَ فِي الإِسْلاَمِ وَمَا أَشْبَهَ ذَلِكَ وَسِعَهُ ذَلِكَ لِقَوْلِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمُسْلِمُ أَخُو الْمُسْلِمِ وَقَالَ بَعْضُ النَّاسِ لَوْ قِيلَ لَهُ لَتَشْرَبَنَّ الْخَمْرَ أَوْ لَتَأْكُلَنَّ الْمَيْتَةَ أَوْ لَنَقْتُلَنَّ ابْنَكَ أَوْ أَبَاكَ أَوْ ذَا رَحِمٍ مُحَرَّمٍ لَمْ يَسَعْهُ لِأَنَّ هَذَا لَيْسَ بِمُضْطَرٍّ ثُمَّ نَاقَضَ فَقَالَ إِنْ قِيلَ لَهُ لَنَقْتُلَنَّ أَبَاكَ أَوْ ابْنَكَ أَوْ لَتَبِيعَنَّ هَذَا الْعَبْدَ أَوْ تُقِرُّ بِدَيْنٍ أَوْ تَهَبُ يَلْزَمُهُ فِي الْقِيَاسِ وَلَكِنَّا نَسْتَحْسِنُ وَنَقُولُ الْبَيْعُ وَالْهِبَةُ وَكُلُّ عُقْدَةٍ فِي ذَلِكَ بَاطِلٌ فَرَّقُوا بَيْنَ كُلِّ ذِي رَحِمٍ مُحَرَّمٍ وَغَيْرِهِ بِغَيْرِ كِتَابٍ وَلاَ سُنَّةٍ وَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِبْرَاهِيمُ لِامْرَأَتِهِ هَذِهِ أُخْتِي وَذَلِكَ فِي اللهِ وَقَالَ النَّخَعِيُّ إِذَا كَانَ الْمُسْتَحْلِفُ ظَالِمًا فَنِيَّةُ الْحَالِفِ وَإِنْ كَانَ مَظْلُومًا فَنِيَّةُ الْمُسْتَحْلِفِ তদ্রূপ যে কোন বল প্রয়োগকৃত লোকের ব্যাপারে যখন কোন প্রকার আশঙ্কা দেখা দেয়। কেননা, এক মুসলিম অন্য মুসলিমকে জালিমের হাত থেকে রক্ষা করবে। তার জন্য লড়াই করবে, তাকে লাঞ্ছিত করবে না। যদি সে মজলুমের জন্যে লড়াই করে তাহলে তার উপর কোন ‘হদ’ বা কিসাস নেই। যদি কাউকে বলা হয় তোমাকে অবশ্যই মদ পান করতে হবে, অথবা মৃতের গোশ্ত খেতে হবে, অথবা তোমার দাসকে বিক্রি করতে হবে অথবা তোমাকে ঋণ স্বীকার করতে হবে অথবা কিছু দান করতে হবে বা তদ্রূপ যে কোন চুক্তির কথা বলা হয়, নইলে আমরা তোমার পিতাকে অথবা মুসলিম ভাইকে হত্যা করে ফেলব। তখন তার জন্য ঐসব কাজ করার অনুমতি আছে। কেননা, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ এক মুসলিম অপর মুসলিমের ভাই। কেউ কেউ বলেন, যদি বলা হয়, তোমাকে অবশ্যই মদ পান করতে হবে, অথবা মৃতের গোশ্ত খেতে হবে, অন্যথায় আমরা তোমার পুত্রকে বা তোমার পিতাকে বা তোমার কোন নিকট আত্মীয়কে হত্যা করে ফেলব, তখন তার জন্য এসব কাজ করার অনুমতি নেই। কেননা, সে নিরুপায় নয়। কেউ কেউ এর বিপরীত রায় ব্যক্ত করে বলেন, যদি তাকে বলা হয়, আমরা অবশ্যই তোমার পিতাকে বা তোমার পুত্রকে হত্যা করে ফেলব, না হয় তোমাকে ঐ গোলামটি বিª্রক করতে হবে, অথবা তোমাকে ঋণ স্বীকার করতে হবে, অথবা হেবা স্বীকার করতে হবে, তাহলে কিয়াসের দৃষ্টিতে তার জন্য তা জরুরী হয়ে যায়। তবে ইস্তিহ্সানের প্রেক্ষিতে আমরা বলি যে এ ক্ষেত্রে বিক্রি, দান বা যে কোন চুক্তি বাতিল বলে গণ্য হবে। কাজেই তারা কিতাব (কুরআন), সুন্নাহ্ ছাড়াই নিকটাত্মীয় ও আত্মীয়দের মধ্যে প্রভেদ করে নিল। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ ইবরাহীম (আঃ) তাঁর স্ত্রী সম্পর্কে বলেছেন, ইনি আমার বোন। আর তা ছিল আল্লাহর ব্যাপারে (দ্বীনের ভিত্তিতে)। নাখঈ (রহ.) বলেন, যে ব্যক্তি হলফ্ করায়, সে যদি অত্যাচারী হয় তাহলে হলফকারীর নিয়তই গ্রহণীয় হবে। আর যদি সে মজলুম হয় তাহলে তার নিয়তই গ্রহণীয় হবে। ৬৯৫১. ‘আবদুল্লাহ্ ইবনু ‘উমার (রাঃ) হতে বর্ণিত। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ এক মুসলিম অন্য মুসলিমের ভাই, না সে তার প্রতি জুলুম করবে, না তাকে অন্যের হাওলা করবে। যে কেউ তার ভাইয়ের প্রয়োজন পূরণ করবে আল্লাহ্ তার প্রয়োজন পূরণ করবেন। [২৪৪২] (আধুনিক প্রকাশনী- ৬৪৬৮, ইসলামিক ফাউন্ডেশন- ৬৪৮১)",
			"grades": [],
			"reference": {
				"book": 89,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6952,
			"arabicnumber": 6952,
			"text": "আনাস (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমার ভাইকে সাহায্য কর। সে জালিম হোক অথবা মজলুম হোক। এক লোক বলল, হে আল্লাহর রাসূল! মজলুম হলে তাকে সাহায্য করব তা তো বুঝলাম। কিন্তু জালিম হলে তাকে কিভাবে সাহায্য করব? তিনি বললেনঃ তাকে অত্যাচার থেকে বিরত রাখবে। আর এটাই হল তার সাহায্য। [২৪৪৩] (আধুনিক প্রকাশনী- ৬৪৬৯, ইসলামিক ফাউন্ডেশন- ৬৪৮২)",
			"grades": [],
			"reference": {
				"book": 89,
				"hadith": 13
			}
		}
	]
}