{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"90": "Tricks"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6953,
			"arabicnumber": 6953,
			"text": "‘উমার ইবনু খাত্তাব (রাঃ) হতে বর্ণিত। তিনি ভাষণ দিতে গিয়ে বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি হে জনতা! সকল ‘আমলই নিয়তের সঙ্গে সম্পর্কযুক্ত। যে যা নিয়ত করবে সে তা-ই পাবে। যার হিজ্রত আল্লাহ্ ও তাঁর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর জন্য হবে তার হিজরাত আল্লাহ্ ও তাঁর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর জন্যই হবে। আর যার হিজরাত দুনিয়া পাওয়ার জন্য বা কোন মহিলাকে বিয়ে করার জন্য হবে, তার হিজরাত সে জন্যই হবে যে জন্য সে হিজরাত করেছে। [১] (আধুনিক প্রকাশনী- ৬৪৭০, ইসলামিক ফাউন্ডেশন- ৬৪৮৩)",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6954,
			"arabicnumber": 6954,
			"text": "আবূ হুরাইরাহ (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেন, বায়ু বের হলে ওযূ না করা পর্যন্ত আল্লাহ্ তোমাদের কারো সালাত কবুল করবেন না। [১৩৫] (আধুনিক প্রকাশনী- ,৬৪৭১ ইসলামিক ফাউন্ডেশন- ৬৪৮৪)",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6955,
			"arabicnumber": 6955,
			"text": "আনাস (রাঃ) হতে বর্ণিত। তিনি বর্ণনা করেন যে, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কর্তৃক নির্ধারিত সদাকাহর ব্যাপারে আবূ বাকর (রাঃ) তার কাছে একটি ফরমান পাঠান। এতে লিখেন যে, সদাকাহ প্রদানের আশংকায় যেন পৃথক মালকে একত্র করা না হয় এবং একত্রিত মালকে যেন পৃথক করা না হয়।[1] [১৪৪৮] (আধুনিক প্রকাশনী- ৬৪৭২, ইসলামিক ফাউন্ডেশন- ৬৪৮৫)",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6956,
			"arabicnumber": 6956,
			"text": "ত্বলহা ইবনু ‘উবাইদুল্লাহ্ (রাঃ) হতে বর্ণিত যে, এক এলোমেলো কেশধারী বেদুঈন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে এসে বলল, হে আল্লাহর রাসূল! আল্লাহ্ আমার উপর সালাত থেকে কী ফরজ করেছেন, তা বলে দিন। তিনি বললেনঃ পাঁচ বারের সালাত, তবে তুমি কিছু নফল পড়তে পার। সে বলল, আল্লাহ আমার উপর সওম থেকে কী ফরয করেছেন তা আমাকে বলে দিন। তিনি বললেনঃ রমযান মাসের সওম। তবে তুমি কিছু নফল আদায় করতে পার। সে বলল, আল্লাহ্ আমার উপর যাকাত থেকে কী ফরজ করেছেন সে সম্পর্কে আমাকে বলে দিন। বর্ণনাকারী বলেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে ইসলামী হুকুম আহকাম সম্পর্কে জানিয়ে দিলেন। সে বলল, ঐ সত্তার কসম! যিনি আপনাকে সম্মানিত করেছেন, আমি নফল কিছু করব না। এবং আল্লাহ্ আমার উপর যা ফরজ করেছেন তা থেকে কমাবও না। তা শুনে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ যদি লোকটি এর উপর স্থির থাকে, তাহলে সফলকাম হয়েছে। যদি এ সত্যের উপর স্থির থাকে তাহলে তাকে জান্নাতে প্রবেশ করানো হবে। (আধুনিক প্রকাশনী- ৬৪৭৩, ইসলামিক ফাউন্ডেশন- ৬৪৮৬) কোন কোন মনীষী বলেন, একশ’ বিশটি উটের যাকাত হলো দু’টি হিক্কা। যদি যাকাত থেকে বাঁচার জন্য সে এগুলো স্বেচ্ছায় ধ্বংস করে ফেলে অথবা দান করে দেয় অথবা অন্য কোন বাহানা তালাশ করে যাকাত থেকে বেঁচে থাকার জন্য তাহলে তার উপর কোন কিছু ওয়াজিব হবে না। [৪৬]",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6958,
			"arabicnumber": 6958,
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6959,
			"arabicnumber": 6959,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, সা‘দ ইবনু ‘উবাদাহ আনসারী (রাঃ) রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে তাঁর মায়ের মানত সম্পর্কে জানতে চাইলেন, যে মানত তার মায়ের যিম্মায় ছিল। কিন্তু তা আদায় করার পূর্বে তার মৃত্যু হয়। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তুমি তার পক্ষ থেকে আদায় করে দাও। কোন কোন মনীষী বলেন, যখন উটের সংখ্যা বিশে পৌঁছে তখন তার যাকাত হবে চারটি ছাগল। কিন্তু যদি সে যাকাত থেকে রেহাই পাওয়ার জন্য অথবা যাকাত এড়াবার কূটচাল হিসেবে বছর পূর্ণ হবার আগে ঐগুলো দান করে দেয় অথবা বিক্রি করে ফেলে, তাহলে তার উপর কিছু ওয়াজিব হবে না। তেমনি যদি সে ঐগুলো ধ্বংস করে দেয় তারপর সে মারা যায় তাহলেও তার মালের উপর কোন যাকাত ওয়াজিব হবে না। [২৭৬১] (আধুনিক প্রকাশনী- ৬৪৭৫, ইসলামিক ফাউন্ডেশন- ৬৪৮৮)",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6960,
			"arabicnumber": 6960,
			"text": "‘আবদুল্লাহ্ (রাঃ) হতে বর্ণিত যে, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ‘শিগার’ থেকে নিষেধ করেছেন। বর্ণনাকারী বলেন, আমি নাফি‘ (রহ.)-কে জিজ্ঞেস করলাম, ‘শিগার’ কী? তিনি বললেন, কেউ এক ব্যক্তির মেয়ে বিয়ে করবে এবং সে তার মেয়ে ঐ ব্যক্তির কাছে বিনা মহরে বিয়ে দেবে। কেউ কোন লোকের বোনকে বিয়ে করবে এবং সে তার বোনকে ঐ লোকের কাছে বিনা মহরে বিয়ে দেবে। কোন কোন আলিম বলেন, যদি কেউ কূট কৌশলের সাহায্য নিয়ে শিগারের ভিত্তিতে বিয়ে করে নেয়, তাহলে বিয়ে কার্যকর হয়ে যাবে। তবে শর্তটি বাতিল হবে। আর ‘মুত্‘আ’ সম্পর্কে তিনি বলেন, বিয়ে ফাসিদ ও শর্ত বাতিল। আবার কেউ কেউ বলেন ‘মুত্‘আ’ ও ‘শিগার’ উভয়টি জায়েয হবে। আর শর্ত বাতিল হবে। (আধুনিক প্রকাশনী- ৬৪৭৬, ইসলামিক ফাউন্ডেশন- ৬৪৮৯)",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6961,
			"arabicnumber": 6961,
			"text": "মুহাম্মাদ ইবনু ‘আলী (রাঃ) হতে বর্ণিত যে, ‘আলী (রাঃ)-কে বলা হলো- ইবনে ‘আব্বাস (রাঃ) মহিলাদের মুত্‘আ বিয়েতে কোন আপত্তি মনে করেন না। তখন তিনি বললেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খায়বারের দিন মুত্‘আ ও গৃহপালিত গাধার গোশ্ত (খাওয়া) থেকে নিষেধ করেছেন। কোন কোন লোক বলেন, যদি কৌশলের মাধ্যমে মুত্আ বিয়ের চুক্তি করে নেয় তবে বিয়ে ফাসিদ বলে গণ্য হবে। আর কেউ কেউ বলেন, বিয়ে বৈধ হবে আর শর্ত বাতিল হবে। [৪২১৬] (আধুনিক প্রকাশনী- ৬৪৭৭, ইসলামিক ফাউন্ডেশন- ৬৪৯০)",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6962,
			"arabicnumber": 6962,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ প্রয়োজনের বেশি ঘাস উৎপাদনে বাধা দেয়ার জন্য প্রয়োজনের বেশি পানি সরবরাহে বাধা দেয়া যাবে না।[1] [২৩৫৩] (আধুনিক প্রকাশনী- ৬৪৭৮, ইসলামিক ফাউন্ডেশন- ৬৪৯১)",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6963,
			"arabicnumber": 6963,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক ক্রেতার উপর দিয়ে অন্য ক্রেতার দরাদরি করতে নিষেধ করেছেন। [২১৪২] (আধুনিক প্রকাশনী- ৬৪৭৯, ইসলামিক ফাউন্ডেশন- ৬৪৯২)",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6964,
			"arabicnumber": 6964,
			"text": "وَقَالَ أَيُّوبُ يُخَادِعُونَ اللهَ كَأَنَّمَا يُخَادِعُونَ آدَمِيًّا لَوْ أَتَوْا الأَمْرَ عِيَانًا كَانَ أَهْوَنَ عَلَيَّ আইউব (রহ.) বলেন, লোকেরা আল্লাহকে ধোঁকা দিতে চায়, যেন তারা মানুষকে ধোঁকা দেয়। তারা যদি প্রকাশ্যে কাজটি করত তবে তা আমার নিকট অধিক সহজ মনে হত। ৬৯৬৪. ইবনু ‘উমার (রাঃ) হতে বর্ণিত। এক লোক নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে উল্লেখ করল যে, সে কেনা-বেচার সময় প্রতারিত হয়ে যায়। তিনি বললেনঃ যখন তুমি কেনা-বেচা করবে তখন বলবে (কোন) ধোঁকাবাজি নেই। [২১১৭] (আধুনিক প্রকাশনী- ৬৪৮০, ইসলামিক ফাউন্ডেশন- ৬৪৯৩)",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6965,
			"arabicnumber": 6965,
			"text": "‘উরওয়াহ (রহ.) হতে বর্ণিত। তিনি ‘আয়িশাহ (রাঃ)-কে এ আয়াত সম্পর্কে জিজ্ঞেস করেন (وَإِنْ خِفْتُمْ أَنْ لاَ تُقْسِطُوا فِي الْيَتَامَى فَانْكِحُوا مَا طَابَ لَكُمْ مِنْ النِّسَاءِ) ‘‘যদি তোমরা আশঙ্কা কর যে, (নারী) ইয়াতীমদের প্রতি সুবিচার করতে পারবে না, তবে নারীদের মধ্য হতে নিজেদের পছন্দমত দুই-দুই, তিন-তিন ও চার-চার জনকে বিবাহ কর’’- (সূরাহ আন্-নিসা ৪/৩)। তিনি বললেন, এ আয়াত ঐ ইয়াতীম মেয়ের ব্যাপারে নাযিল হয়েছে, যে তার অভিভাবকের তত্ত্বাবধানে আছে। আর অভিভাবক তার সম্পদ ও সৌন্দর্যের প্রতি আকৃষ্ট হয়ে পড়ে এবং তার স্বগোত্রীয় মহিলাদের ক্ষেত্রে প্রচলিত মাহরের চেয়ে কম মাহর দিয়ে বিয়ে করে নেয়ার মনস্থ করে। তাই তাদেরকে এমন ইয়াতীম মেয়েদেরকে বিয়ে করা থেকে নিষেধ করা হয়েছে। তবে যদি পূর্ণ মাহর দিয়ে তাদের সঙ্গে সুবিচার করে তবে অন্য কথা। এরপর লোকেরা রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে এ ব্যাপারে জানতে চাইলে আল্লাহ্ এ আয়াত অবতীর্ণ করেনঃ ‘‘লোকেরা তোমার কাছে নারীদের সম্বন্ধে বিধান জানতে চাচ্ছে......’’ (সূরাহ আন্-নিসা ৪/১২৭)। তারপর হাদীসের (বাকি অংশ) বর্ণনা করেন। [২৪৯৪] (আধুনিক প্রকাশনী- ৬৪৮১, ইসলামিক ফাউন্ডেশন- ৬৪৯৪)",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6966,
			"arabicnumber": 6966,
			"text": "وَقَالَ بَعْضُ النَّاسِ الْجَارِيَةُ لِلْغَاصِبِ لأَ÷خْذِهِ الْقِيمَةَ وَفِي هَذَا احْتِيَالٌ لِمَنْ اشْتَهَى جَارِيَةَ رَجُلٍ لاَ يَبِيعُهَا فَغَصَبَهَا وَاعْتَلَّ بِأَنَّهَا مَاتَتْ حَتَّى يَأْخُذَ رَبُّهَا قِيمَتَهَا فَيَطِيبُ لِلْغَاصِبِ جَارِيَةَ غَيْرِهِ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمْوَالُكُمْ عَلَيْكُمْ حَرَامٌ وَلِكُلِّ غَادِرٍ لِوَاءٌ يَوْمَ الْقِيَامَةِ কোন কোন মনীষী বলেন, বাঁদীটি অপহরণকারীরই থাকবে। কারণ মালিক মূল্য গ্রহণ করে নিয়েছে। এ ক্ষেত্রে ঐ লোকের জন্য একটা কূটকৌশল অলম্বনের ব্যবস্থা করে দেয়া হলো। যে লোকের কারো দাসী পছন্দ হয়, কিন্তু মালিক তা বিক্রয় করে না, তখন সে তা অপহরণ করে বাহানা করে বলল যে, সে মরে গেছে। যাতে করে মালিক মূল্য গ্রহণ করে নেয়। আর অন্যের দাসী অপহরণকারীর জন্য হালাল হয়ে যায়। অথচ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ একে অন্যের মাল হরণ করা তোমাদের জন্য হারাম। প্রত্যেক বিশ্বাসঘাতকের জন্য কিয়ামতের দিন একটা পতাকা থাকবে। ৬৯৬৬. ইবনু ‘উমার (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেন, প্রত্যেক বিশ্বাসঘাতকের জন্য কিয়ামতের দিন একটা পতাকা থাকবে, যার দ্বারা তাকে চেনা যাবে। [৩১৮৮] (আধুনিক প্রকাশনী- ৬৪৮২, ইসলামিক ফাউন্ডেশন- ৬৪৯৫)",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6967,
			"arabicnumber": 6967,
			"text": "উম্মু সালামাহ (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেছেনঃ আমি তো একজন মানুষ। আর তোমরা আমার কাছে বিবাদ মীমাংসার জন্য এসে থাক। তোমাদের এক পক্ষ অন্য পক্ষ অপেক্ষা দলীল-প্রমাণ পেশ করার ক্ষেত্রে বেশি পারদর্শী হতে পারে। ফলে আমি আমার শোনার কারণে যদি কাউকে তার অন্য ভাইয়ের হক দিয়ে দেই, তাহলে যেন সে তা গ্রহণ না করে। কেননা, আমি তার জন্য জাহান্নামের একটা অংশই পৃথক করে দিচ্ছি।[1] [২৪৫৮] (আধুনিক প্রকাশনী- ৬৪৮৩, ইসলামিক ফাউন্ডেশন- ৬৪৯৬)",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6968,
			"arabicnumber": 6968,
			"text": "আবূ হুরাইরাহ (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত। তিনি বলেছেনঃ কুমারী নারী বিয়ে দেয়া যাবে না, যতক্ষণ পর্যন্ত না তার অনুমতি গ্রহণ করা হবে। আর বিধবা নারী বিয়ে দেয়া যাবে না, যতক্ষণ পর্যন্ত না তার মত গ্রহণ করা হবে। প্রশ্ন করা হল, হে আল্লাহর রাসূল! তার অনুমতি কেমন করে? তিনি বললেনঃ যখন সে নীরব থাকে। কোন কোন লোক বলেন, যদি কুমারীর অনুমতি নেয়া না হয় এবং তাকে বিয়ে দেয়া না হয় অতঃপর কোন লোক কূটচালের আশ্রয় নিয়ে দু’জন মিথ্যা সাক্ষী দাঁড় করায় যে, ঐ লোক উক্ত মহিলাকে তার সম্মতি নিয়ে বিয়ে করেছে এবং বিচারকও তার বিয়ে বলবৎ রাখে, অথচ স্বামী জানে যে, সাক্ষীটি মিথ্যা, তখন তার জন্য উক্ত মহিলার সঙ্গে সহবাস করতে কোন আপত্তি নেই এবং এটি সহীহ শুদ্ধ বিয়ে। [৫১৩৬] (আধুনিক প্রকাশনী- ৬৪৭৪, ইসলামিক ফাউন্ডেশন- ৬৪৯৭)",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 6969,
			"arabicnumber": 6969,
			"text": "কাসিম (রহ.) হতে বর্ণিত যে, জা‘ফর (রাঃ)-এর বংশের এক নারী আশঙ্কা করল যে, তার অভিভাবকরা তার অসম্মতিতে বিয়ে দিতে যাচ্ছে। এ জন্য সে আনসারী দু’জন মুরববী জারিয়ার দু পুত্র ‘আবদুর রহমান (রাঃ) ও মুজামমি (রাঃ)-কে এ কথা বলে পাঠাল। তারা বললেন, তোমার ভয়ের কারণ নেই। কেননা, খানসা বিনত খিযাম (রাঃ)-কে তার পিতা তার অসম্মতিতে বিয়ে দিয়েছিল। কিন্তু নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এ বিয়ে রদ করে দেন। সুফ্ইয়ান (রহ.) বলেছেন যে, আমি ‘আবদুর রহমান (রহ.)-কে তাঁর পিতা থেকে إِنَّ خَنْسَاءَ বলতে শুনেছি। [৫১৩৮] (আধুনিক প্রকাশনী- ৬৪৮৫, ইসলামিক ফাউন্ডেশন- ৬৪৯৮)",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 6970,
			"arabicnumber": 6970,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ বিধবাকে তার মতামত ব্যতীত বিয়ে দেয়া যাবে না এবং কুমারীকে তার অনুমতি ব্যতীত বিয়ে দেয়া যাবে না। তারা বললেন, তার অনুমতি কেমন হবে? তিনি বললেনঃ তার চুপচাপ থাকা। কেউ কেউ বলেন, যদি কোন লোক কোন বিধবা নারীর মতানুসারে বিয়ে হওয়ার ওপর দু’জন মিথ্যা সাক্ষীর মাধ্যমে কূটকৌশলের গ্রহণ করে আর বিচারকও তাদের এ বিয়েকে কার্যকর করে দেন অথচ স্বামী জানে যে, সে তাকে এর পূর্বে বিয়ে করেনি, তাহলে তার জন্য এ বিয়ে বৈধ ও কার্যকর হয়ে যাবে এবং তার জন্য উক্ত মহিলার সঙ্গে বিবাহিত জীবন যাপনে কোন বাধা নেই। [৫১৩৬] (আধুনিক প্রকাশনী- ৬৪৮৬, ইসলামিক ফাউন্ডেশন- ৬৪৯৯)",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 6971,
			"arabicnumber": 6971,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কুমারীর অনুমতি নিতে হবে। আমি বললাম, কুমারী তো লজ্জাবোধ করবে। তিনি বললেনঃ তার অনুমতি হলো তার নীরবতা। কেউ কেউ বলেন, যদি কোন ইয়াতীম বাঁদী অথবা কোন কুমারী কারো পছন্দ হয় কিন্তু সে অসম্মতি জানায়, তখন ঐ লোক কূটকৌশলের মাধ্যমে দু’জন মিথ্যা সাক্ষী এ মর্মে পেশ করে যে, সে তাকে বিয়ে করেছে এবং সে প্রাপ্তবয়স্কা হবার পর সম্মতি প্রদান করেছে আর বিচারকও মিথ্যা সাক্ষ্য গ্রহণ করে নেন অথচ স্বামী জানে যে তা মিথ্যা, এক্ষেত্রে তার জন্য যৌন সঙ্গম করা বৈধ হয়ে যায়।[1] [৫১৩৭] (আধুনিক প্রকাশনী- ৬৪৮৭, ইসলামিক ফাউন্ডেশন- ৬৫০০)",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 6972,
			"arabicnumber": 6972,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মিষ্টান্ন দ্রব্য ও মধু পছন্দ করতেন। এবং যখন ‘আসরের সালাত আদায় করে নিতেন তখন তিনি তাঁর স্ত্রীদের কাছে ঘুরে বেড়াতেন এবং তাঁদের কাছে উপস্থিত হতেন। একবার তিনি হাফসাহ (রাঃ)-এর ঘরে প্রবেশ করলেন এবং সাধারণভাবে যত সময় তাঁর কাছে অবস্থান করতেন তার চেয়ে বেশি সময় তাঁর কাছে অবস্থান করলেন। তাই আমি এর কারণ জিজ্ঞেস করলাম। তখন আমাকে বলা হল যে, তার স্বগোত্রীয় এক মহিলা এক কৌটা মধু হাদিয়া পাঠিয়েছে। এ থেকে তিনি আল্লাহর রাসূলকে কিছু পান করিয়েছেন। আমি মনে মনে বললাম, আল্লাহর কসম! আমরা অবশ্যই একটা কূটকৌশল গ্রহণ করব। এরপর আমি এ ব্যাপারে সাওদা (রাঃ)-এর সঙ্গে আলোচনা করলাম। আমি বললাম, যখন তিনি তোমার ঘরে আসবেন, তখন তিনি অবশ্যই তোমার নিকটে যাবেন। এ সময় তুমি তাঁকে বলবে, হে আল্লাহর রাসূল! আপনি মাগাফীর খেয়েছেন? তিনি অবশ্য না-ই বলবেন। তখন তুমি বলবে, তাহলে এ দুর্গন্ধ কিসের? আর রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামএর কাছে তাঁর থেকে দুর্গন্ধ পাওয়াটা খুবই গুরুতর মনে হত। তখন তিনি বলবেনঃ হাফসাহ আমাকে মধুর শরবত পান করিয়েছে। তখন তুমি তাঁকে বলবে, তাহলে ঐ মধুর পোকা ‘উরফুত’ গাছের রস সংগ্রহ করেছে। আর আমিও একই কথা বলব। হে সফীয়্যাহ! তুমিও তাঁকে এ কথা বলবে। যখন তিনি সাওদা (রাঃ)-এর ঘরে এলেন, তখন সাওদা (রাঃ) বললেন, কসম ঐ সত্তার, যিনি ব্যতীত আর কোন ইলাহ্ নেই। যখনই তিনি দরজার কাছে এলেন তখনই আমি তোমার ভয়ে তোমার শিখানো কথাগুলো বলতে প্রস্তুত হলাম। এরপর তিনি যখন নিকটে এলেন, তখন আমি বললাম, হে আল্লাহর রাসূল! আপনি ‘মাগফীর’ খেয়েছেন। তিনি বললেন, না। আমি বললাম, তাহলে এ দুর্গন্ধ কিসের? তিনি বললেনঃ হাফসাহ আমাকে মধুর শরবত পান করিয়েছে। আমি বললাম, তাহলে এ মধুর পোকা ‘উরফুত’ গাছের রস সংগ্রহ করেছে। ‘আয়িশাহ (রাঃ) বলেন, এরপর রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন আমার ঘরে এলেন, তখন আমিও তাঁকে তেমনি কথা বললাম। এরপর তিনি সফীয়্যাহ (রাঃ)-এর ঘরে গেলেন, সেও তাঁকে তেমনি কথা বলল। পুনরায় রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন হাফসাহ (রাঃ)-এর ঘরে প্রবেশ করলেন তখন তিনি তাঁকে বললেন, হে আল্লাহর রাসূল! আপনাকে মধু পান করতে দিব কি? তিনি বললেনঃ এর কোন প্রয়োজন নেই। ‘আয়িশাহ (রাঃ) বলেন, সাওদা (রাঃ) বললঃ সুবহানাল্লাহ্! আমরা তা হারাম করে দিলাম। ‘আয়িশাহ (রাঃ) বলেন, আমি সাওদা (রাঃ)-কে বললাম, চুপ কর।[1] [৪৯১২] (আধুনিক প্রকাশনী- ৬৪৮৮, ইসলামিক ফাউন্ডেশন- ৬৫০১)",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 6973,
			"arabicnumber": 6973,
			"text": "‘আবদুল্লাহ্ ইবনু আমির ইবনু রাবী‘আ (রহ.) হতে বর্ণিত যে, একবার ‘উমার ইবনু খাত্তাব (রাঃ) সিরিয়া অভিমুখে রওনা দিলেন। তিনি যখন ‘সারাগ’ নামক স্থানে পৌঁছলেন, তখন তাঁর কাছে এ খবর আসল যে, সিরিয়ায় প্লেগ মহামারী আকারে দেখা দিয়েছে। এ সময় আবদুর রহমান ইবনু আওফ (রাঃ) তাঁকে জানালেন যে, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যখন তোমরা কোন এলাকায় মহামারী ছড়িয়ে পড়েছে শুনতে পাবে তখন তোমরা সেখানে যেও না। আর যখন কোন এলাকায় মহামারী ছড়িয়ে পড়ে আর তোমরা সেখানে হাজির থাক, তখন সেখান থেকে পালিয়ে বের হয়ে এসো না। এ কথা শুনে ‘উমার (রাঃ) ‘সারাগ’ থেকে ফিরে গেলেন। [৫৭২৯] ইবনু শিহাব (রহ.).....সালিম ইবনু ‘আবদুল্লাহ্ (রহ.) হতে বর্ণিত, ‘উমার (রাঃ) ‘আবদুর রহমানের হাদীসের কারণে ফিরে এসেছেন। (আধুনিক প্রকাশনী- ৬৪৮৯, ইসলামিক ফাউন্ডেশন- ৬৫০২)",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 6974,
			"arabicnumber": 6974,
			"text": "উসামাহ ইবনু যায়দ (রাঃ) হতে বর্ণিত। তিনি সা‘দ (রাঃ)-কে বলেন- একদিন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মহামারী সম্পর্কে আলোচনার সময় বললেনঃ এ একটি শাস্তি, কতক জাতিকে এ দ্বারা শাস্তি দেয়া হয়েছে। তারপর এর কিছু অংশ বাকী রয়ে গেছে। তাই কখনো এ চলে যায় আবার কখনো তা ফিরে আসে। যখন কেউ কোন এলাকায় মহামারীর কথা শুনবে তখন যেন সে সেখানে না যায়। আর যে কেউ এমন এলাকায় থাকে যেখানে এর আক্রমণ ঘটেছে, তখন সে যেন সেখান থেকে পালিয়ে বের হয়ে না আসে। [৩৪৭৩] (আধুনিক প্রকাশনী- ৬৪৯০, ইসলামিক ফাউন্ডেশন- ৬৫০৩)",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 6975,
			"arabicnumber": 6975,
			"text": "وَقَالَ بَعْضُ النَّاسِ إِنْ وَهَبَ هِبَةً أَلْفَ دِرْهَمٍ أَوْ أَكْثَرَ حَتَّى مَكَثَ عِنْدَهُ سِنِينَ وَاحْتَالَ فِي ذَلِكَ ثُمَّ رَجَعَ الْوَاهِبُ فِيهَا فَلاَ زَكَاةَ عَلَى وَاحِدٍ مِنْهُمَا فَخَالَفَ الرَّسُولَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْهِبَةِ وَأَسْقَطَ الزَّكَاةَ কোন কোন মনীষী বলেন, কেউ যদি কৌশল করে এক হাজার বা ততোধিক দিরহাম হেবা করে এবং তা কয়েক বছর গ্রহীতার কাছে থেকে যায় এবং এতে সে কৌশল করে এরপর হেবাকারী যদি তা আবার ফেরত নিয়ে আসে, তাহলে তাদের দু’জনের কারো উপর যাকাত ওয়াজিব হবে না। আবূ ‘আবদুল্লাহ্ (বুখারী) বলেনঃ তাহলে সে হেবার ক্ষেত্রে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর বিরুদ্ধাচরণ করল এবং যাকাতে ফাঁকি দিল। ৬৯৭৫. ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ হেবা করে আবার তাকে ফেরত নেয়া লোকের তুলনা যেন এমন একটি কুকুর যে বমি করে তা আবার গলাধঃকরণ করে। আমরা যেন এরূপ খারাপ দৃষ্টান্ত স্থাপন না করি। [২৫৮৯] (আধুনিক প্রকাশনী- ৬৪৯১, ইসলামিক ফাউন্ডেশন- ৬৫০৪)",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 6976,
			"arabicnumber": 6976,
			"text": "জাবির ইবনু ‘আবদুল্লাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কেবল ঐ সব ভূমিতে শুফ‘আহর অধিকার সাব্যস্ত করেছেন, যেগুলো এখনো বণ্টিত হয়নি। আর যখন সীমানা নির্দিষ্ট হয়ে যায় এবং রাস্তা নির্ধারিত হয়ে যায় তখন আর শুফ‘আহ (অধিকার) থাকে না। কোন কোন লোক বলেন, প্রতিবেশী হবার কারণেও শুফ‘আহর অধিকার সাব্যস্ত হয়। কিন্তু এ সম্পর্কে যা দৃঢ়তার সঙ্গে বললেন তা আবার বাতিল করে দিলেন এবং বললেন, যদি কেউ কোন বাড়ি কেনার পর আশংকা করে যে, প্রতিবেশি শুফ‘আহর অধিকারের ভিত্তিতে নিয়ে যাবে তাই সে শত অংশের এক অংশ প্রথমে ক্রয় করে নেয়, তারপর বাকী অংশ ক্রয় করে। অথচ প্রতিবেশীর জন্য শুফ‘আহর অধিকার কেবল প্রথম অংশে ছিল। তাহলে বাড়ির বাকী অংশে প্রতিবেশীর জন্য শুফ‘আহর অধিকার থাকে না। এক্ষেত্রে সে এ কূটকৌশলের আশ্রয় নিতে পারে। [২২১৩] (আধুনিক প্রকাশনী- ৬৪৯২, ইসলামিক ফাউন্ডেশন- ৬৫০৫)",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 6977,
			"arabicnumber": 6977,
			"text": "‘আমর ইবনু শারীদ (রহ.) হতে বর্ণিত। তিনি বলেন, মিস্ওয়ার ইবনু মাখরামাহ (রাঃ) এসে তাঁর হাত আমার কাঁধে রাখলেন। তারপর আমি তাঁর সঙ্গে সা‘দ (রাঃ)-এর কাছে গেলাম। তখন আবূ রাফি‘ (রাঃ) মিস্ওয়ার (রাঃ)-কে বললেন, আপনি কি ওকে এ কথা বলবেন যে, সে আমার ঐ ঘরটি কিনে নেবে, যে ঘরটি তার বাড়িতে রয়েছে। সা‘দ (রাঃ) বললেন, আমি চারশ’ থেকে অধিক দেব না। তাও আবার কিস্তিতে কিস্তিতে দেব। আবূ রাফি‘ (রাঃ) বললেন, আমাকে নগদ পাঁচশ দেয়া হচ্ছে, অথচ আমি তাকে দিচ্ছি না। আমি যদি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে না শুনতাম যে, প্রতিবেশি তার পার্শ্ববর্তী ভূমি কেনার ব্যাপারে অধিক হকদার, তাহলে আমি তা তোমার কাছে বিক্রি করতাম না। অথবা বলেছেন, তোমাকে আমি তা দিতাম না। আমি সুফ্ইয়ান (রহ.)-কে বললাম যে, মা‘মার তো এমনটি বলেননি। তিনি বললেন, কিন্তু তিনি আমাকে এমনটি বলেছেন। কিছু সংখ্যক লোক বলেন, কেউ যদি কোন ভূমি বিক্রি করে, তাহলে কৌশলের আশ্রয় গ্রহণ করে শুফ‘আহর অধিকার রদ করে দিতে পারে। যেমন বিক্রেতা ক্রেতাকে বাড়িটি দান করে দেবে এবং তার সীমানা বর্ণনা করে ক্রেতার কাছে সোপর্দ করে দেবে। এরপর ক্রেতা বিক্রেতাকে এক হাজার দিরহাম দিয়ে দেবে। এই অবস্থায় শাফী’র জন্য তাতে শুফ‘আহর অধিকার থাকবে না। [২২৫৮] (আধুনিক প্রকাশনী- ৬৪৯৩, ইসলামিক ফাউন্ডেশন- ৬৫০৬)",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 6978,
			"arabicnumber": 6978,
			"text": "আবূ রাফি‘ (রাঃ) হতে বর্ণিত যে, সা‘দ (রাঃ) তার নিকট হতে চারশ’ মিসকাল দিয়ে একটা ঘর ক্রয় করার জন্য দর করেন। তখন তিনি বলেন, যদি আমি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে না শুনতাম যে, ‘‘প্রতিবেশী তার পার্শ্ববর্তী ভূমি কেনার ব্যাপারে অধিক হক্দার’’ তাহলে তোমাকে আমি দিতাম না। কেউ কেউ বলেন, যদি কেউ বাড়ির কোন অংশ কিনে নেয় এবং শুফ্আর অধিকার বাতিল করে দিতে চায়, তাহলে তার ছোট ছেলেকে তা দান করে দেবে। আর তখন তার ওপর কোন কসমও আসবে না। [২২৫৮] (আধুনিক প্রকাশনী- ৬৪৯৪, ইসলামিক ফাউন্ডেশন- ৬৫০৭)",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 6979,
			"arabicnumber": 6979,
			"text": "আবূ হুমায়দ সা‘ঈদী (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম লুতাবিয়্যা নামে এক লোককে বানী সুলায়ম গোত্রের যাকাত আদায়কারী নিয়োগ করলেন। যখন সে ফিরে আসল তখন তিনি তার নিকট হতে হিসাব-নিকাশ নিলেন। সে বলল, এগুলো আপনাদের মাল, আর এগুলো (আমাকে দেয়া) হাদিয়া। তখন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ যদি তুমি সত্যবাদী হয়ে থাক তাহলে তোমার মা-বাবার ঘরে বসে থাকলে না কেন? সেখানেই তোমার কাছে হাদিয়া পৌঁছে যেত। এরপর তিনি আমাদের উদ্দেশে ভাষণ দিলেন। আল্লাহর প্রশংসা ও গুণ বর্ণনা করার পর তিনি বললেনঃ আমি তোমাদের কাউকে এমন কোন কাজে নিয়োগ করি, যার তত্ত্বাবধায়ক হিসেবে আল্লাহ্ আমাকে মনোনীত করেছেন। কিন্তু সে কাজ করে এসে বলে, এ হল তোমাদের মাল আর এ হলো আমাকে দেয়া হাদিয়া। তাহলে সে কেন তার মা-বাবার ঘরেই বসে থাকল না, সেখানে এমনিতেই তার কাছে তার হাদিয়া পৌঁছে যেত? আল্লাহর কসম! তোমরা যে কেউ অন্যায় পন্থায় কোন কিছু গ্রহণ করবে, সে কিয়ামতের দিন তা বয়ে নিয়ে আল্লাহর সামনে উপস্থিত হবে। আমি তোমাদের কাউকে ভালভাবেই চিনব যে, সে আল্লাহর কাছে উপস্থিত হবে উট বহন করে; আর উট আওয়াজ দিতে থাকবে। অথবা গাভী বহন করে, আর সেটা ডাকতে থাকবে। অথবা বক্রী বহন করে, আর সেটা ডাকতে থাকবে। তারপর তিনি আপন হাত দু’টি এতদূর উত্তোলন করলেন যে তাঁর বগলের শুভ্রতা দেখা যাচ্ছিল। তিনি বললেনঃ হে আল্লাহ্! আমি কি পৌঁছে দিয়েছি? আমার দু’চোখ সে অবস্থা দেখেছে এবং আমার কান শুনেছে।[1] [৯২৫] (আধুনিক প্রকাশনী- ৬৪৯৫, ইসলামিক ফাউন্ডেশন- ৬৫০৮)",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 6980,
			"arabicnumber": 6980,
			"text": "আবূ রাফি‘ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ প্রতিবেশী তার পার্শ্ববর্তী ভূমির ব্যাপারে সবচেয়ে বেশি হকদার। কেউ কেউ বলেন, কেউ যদি কোন একটি বাড়ি বিশ হাজার দিরহামের বিনিময়ে ক্রয় করে’ ঐ বিশ হাজার দিরহাম পরিশোধ করার সময় এ কৌশল গ্রহণ করাতে কোন দোষ নেই যে, ক্রেতা বিক্রেতাকে ন’হাজার ন’শ নিরানব্বই দিরহাম ও বিশ হাজারের বাকী দিরহামের বদলে এক দ্বীনার নগদ প্রদান করবে। এখন যদি শুফ‘আহর অধিকারী শুফ‘আহর দাবি করে, তাহলে এই বাড়ি বিশ হাজার দিরহামের বিনিময়ে নিতে হবে। এ ব্যতীত তার এ বাড়ি পাওয়ার আর কোন উপায় নেই। আর যদি এ বাড়ির অন্য কোন মালিক বের হয়ে পড়ে, তাহলে ক্রেতা বিক্রেতাকে দেয়া দামই ফেরত দেবে। আর তা হলো ন’হাজার ন’শ নিরানব্বই দিরহাম ও এক দ্বীনার। কেননা, যখন বিক্রিত বস্তুর মূল মালিক বের হয়ে গেছে তখন দ্বীনারের ‘বায়এ-সারফ’ বাতিল হয়ে গেছে। আর যদি ক্রেতা বাড়িতে কোন দোষ পায়, তার কোন মালিক বের না হয়, তাহলে ক্রেতা বাড়ি ফেরত দেবে ও বিক্রেতা ক্রেতাকে বিশ হাজার দিরহাম দেবে। আবূ ‘আবদুল্লাহ্ (ইমাম বুখারী) (রহ.) বলেনঃ মূলত এরূপ করা মুসলিমদের মধ্যে ধোঁকাবাজিকে বৈধতা দেয়ার নামান্তর। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মুসলিমদের কেনা-বেচায় কোন রোগবালাই, অপবিত্রতা ও ধোঁকাবাজি নেই। [২২৫৮] (আধুনিক প্রকাশনী- ৬৪৯৬, ইসলামিক ফাউন্ডেশন- ৬৫০৯)",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 6981,
			"arabicnumber": 6981,
			"text": "‘আমর ইবনু শারীদ (রহ.) হতে বর্ণিত যে, আবূ রাফি‘ (রাঃ) একটি ঘর ক্রয় করার জন্য আ‘দ ইবনু মালিক (রাঃ)-এর সঙ্গে চারশ’ মিসকাল মূল্য ঠিক করেন। আর বলেন, যদি আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে এ কথা বলতে না শুনতাম যে, প্রতিবেশি তার পার্শ্ববর্তী ভূমির কেনার ক্ষেত্রে সবচেয়ে অধিক হক্দার, তাহলে তোমাকে আমি প্রদান করতাম না। [২২৫৮] (আধুনিক প্রকাশনী- ৬৪৯৭, ইসলামিক ফাউন্ডেশন- ৬৫১০)",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 28
			}
		}
	]
}