{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"96": "Holding Fast to the Qur'an and Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7268,
			"arabicnumber": 7268,
			"text": "ত্বারিক ইবনু শিহাব (রহ.) হতে বর্ণিত। তিনি বলেন, ইয়াহূদীদের এক লোক ‘উমার (রাঃ)-কে বলল, হে আমীরুল মু’মিনীন! আমাদের উপর যদি এ আয়াতঃ ‘‘আজ আমি তোমাদের জন্য তোমাদের দ্বীনকে পূর্ণাঙ্গ করে দিলাম, তোমাদের প্রতি আমার নি‘মাত পূর্ণ করে দিলাম এবং ইসলামকে তোমাদের দ্বীন হিসেবে কবূল করে নিলাম’’- (সূরাহ আল-মায়িদাহ ৫/৩) অবতীর্ণ হত, তাহলে সে দিনটিকে আমরা অবশ্যই ঈদের দিন হিসাবে গণ্য করতাম। ‘উমার (রাঃ) বললেন, আমি অবশ্যই জানি এ আয়াতটি কোন্ দিন অবতীর্ণ হয়েছিল। আরাফাহর দিন জুমু‘আহর দিনে এ আয়াতটি নাযিল হয়েছিল। হাদীসটি সুফ্ইয়ান (রহ.) মিসআর (রহ.) থেকে, মিস্আর কায়স থেকে কায়স (রহ.) তারিক থেকে শুনেছেন। [৪৫] (আধুনিক প্রকাশনী- ৬৭৬০, ইসলামিক ফাউন্ডেশন- ৬৭৭২)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 7269,
			"arabicnumber": 7269,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত যে, দ্বিতীয় দিনে যখন মুসলিমরা আবূ বকর (রাঃ)-এর বায়‘আত গ্রহণ করেছিল এবং তিনি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর মিম্বারের উপর উপবিষ্ট ছিলেন; ‘উমার (রাঃ)-কে আবূ বকর (রাঃ)-এর পূর্বে হামদ ও ছানা ও কালেমা শাহাদাত পাঠ করতে তিনি (আনাস) শুনেছেন। তিনি বললেন, অতঃপর আল্লাহ্ তাঁর রাসূলের জন্য তোমাদের কাছে যা ছিল তার চেয়ে তার নিকট যা আছে সেটাকেই পছন্দ করেছেন। আর এই সে কিতাব যার মাধ্যমে আল্লাহ্ তা‘আলা তোমাদের রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে হিদায়াত দিয়েছিলেন। কাজেই একে তোমরা আঁকড়ে ধর। তাহলে এর মাধ্যমে আল্লাহ্ তাঁর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে যে হিদায়াত দিয়েছিলেন তোমরাও সেই হিদায়াত পাবে। [৭২১৯] (আধুনিক প্রকাশনী- ৬৭৬১, ইসলামিক ফাউন্ডেশন- ৬৭৭৩)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 7270,
			"arabicnumber": 7270,
			"text": "ইবনু ‘আব্বাস (রহ.) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (তাঁর শরীরের সঙ্গে) আমাকে জড়িয়ে ধরলেন এবং বললেনঃ হে আল্লাহ্! তাকে কিতাবের ইলম দাও।[1] [৭৫] (আধুনিক প্রকাশনী- ৬৭৬২, ইসলামিক ফাউন্ডেশন- ৬৭৭৪)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 7271,
			"arabicnumber": 7271,
			"text": "আবূ বারযা (রাঃ) হতে বর্ণিত। তিনি বলেন, আল্লাহ্ তা‘আলা তোমাদেরকে ইসলাম দ্বারা ও মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামএর দ্বারা মুখাপেক্ষীহীন কিংবা পরিপূর্ণ করেছেন। [৭১১২] (আধুনিক প্রকাশনী- ৬৭৬৩, ইসলামিক ফাউন্ডেশন- ৬৭৭৫)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 7272,
			"arabicnumber": 7272,
			"text": "‘আবদুল্লাহ্ ইবনু দ্বীনার (রাঃ) হতে বর্ণিত যে, ‘আবদুল্লাহ্ ইবনু ‘উমার (রাঃ) ‘আবদুল মালিক ইবনু মারওয়ানের বাই‘আত করে লিখলেনঃ আল্লাহ্ ও তাঁর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সুন্নাতের ভিত্তিতে আমার সাধ্যমত (আপনার নির্দেশ) শোনা ও মানার অঙ্গীকার করছি। [৭২০৩] (আধুনিক প্রকাশনী- ৬৭৬৪, ইসলামিক ফাউন্ডেশন- ৬৭৭৬)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 7273,
			"arabicnumber": 7273,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমি ‘জাওয়ামিউল কালিম[1]’ (ব্যাপক অর্থবহ সংক্ষিপ্ত কথা) সহ প্রেরিত হয়েছি এবং আমাকে প্রভাব দিয়ে সাহায্য করা হয়েছে। একবার আমি ঘুমের অবস্থায় দেখলাম, পৃথিবীর ভান্ডারগুলোর চাবি আমাকে দেয়া হয়েছে এবং তা আমার হাতে রেখে দেয়া হয়েছে। আবূ হুরাইরাহ (রাঃ) বলেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইন্তিকাল করে গেছেন। আর তোমরা তা ব্যবহার করছ কিংবা বলেছিলেন তোমরা তা থেকে উপকার লাভ করছ কিংবা তিনি এরকমই কোন কথা বলেছিলেন। [২৯৭৭] (আধুনিক প্রকাশনী- ৬৭৬৫, ইসলামিক ফাউন্ডেশন- ৬৭৭৭)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 7274,
			"arabicnumber": 7274,
			"text": "আবূ হুরাইরাহ (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণনা করেছেন। তিনি বলেছেনঃ প্রত্যেক নবীকেই কোন-না-কোন অতুলনীয় নিদর্শন দেয়া হয়েছে যার উপর ঈমান আনা হয়েছে, কিংবা লোকেরা তাঁর উপর ঈমান এনেছে। আর আমাকে দেয়া হয়েছে ওয়াহী, যা আল্লাহ্ আমার উপর অবতীর্ণ করেছেন। সুতরাং আমি আশা করি যে, কিয়ামতের দিন আমার অনুসারীর সংখ্যা তাদের সবার চেয়ে বেশি হবে।[1] [৪৯৮১] (আধুনিক প্রকাশনী- ৬৭৬৬, ইসলামিক ফাউন্ডেশন- ৬৭৭৮)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 7275,
			"arabicnumber": 7275,
			"text": "وَقَوْلِ اللهِ تَعَالَى: (وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا) قَالَ أَيِمَّةً نَقْتَدِي بِمَنْ قَبْلَنَا وَيَقْتَدِي بِنَا مَنْ بَعْدَنَا وَقَالَ ابْنُ عَوْنٍ ثَلاَثٌ أُحِبُّهُنَّ لِنَفْسِي وَلإِ÷خْوَانِي هٰذِهِ السُّنَّةُ أَنْ يَتَعَلَّمُوهَا وَيَسْأَلُوا عَنْهَا وَالْقُرْآنُ أَنْ يَتَفَهَّمُوهُ وَيَسْأَلُوا عَنْهُ وَيَدَعُوا النَّاسَ إِلاَّ مِنْ خَيْرٍ আর আল্লাহর বাণীঃ ‘‘আমাদেরকে মুত্তাকীদের নেতা বানিয়ে দাও’’- (সূরাহ আল-ফুরক্বান ২৫/৭৪)। একজন বর্ণনাকারী বলেছেন, এরূপ ইমাম যে আমরা আমাদের পূর্ববর্তীদের অনুসরণ করব, আর আমাদের পরবর্তীরা আমাদের অনুসরণ করবে। ইবনু আউন বলেন, তিনটি বিষয় আমি আমার নিজের জন্য ও আমার ভাইদের জন্য পছন্দ করি। এই সুন্নাত, যা শিখবে এবং জানার জন্য এ বিষয়ে প্রশ্ন করবে। কুরআন যা তারা ভালভাবে বুঝতে চেষ্টা করবে এবং জানার জন্য এ বিষয়ে প্রশ্ন করবে এবং মানুষকে একমাত্র কল্যাণের দিকে আহবান জানাবে। ৭২৭৫. আবূ ওয়ায়িল (রহ.) হতে বর্ণিত। তিনি বলেন, আমি এই মসজিদে শায়বাহর (রহ.) কাছে বসেছিলাম। তিনি বললেন, তুমি যেমন বসে আছ, ‘উমার (রাঃ) তেমনি এ জাগায় বসা ছিলেন এবং তিনি বলেছিলেন, আমি ইচ্ছা করছি যে, এতে সোনা ও রুপার কোন কিছুই অবশিষ্ট রাখব না বরং সবকিছু মুসলিমদের মাঝে বণ্টন করে দেব। আমি বললাম, আপনি তা করবেন না। তিনি জিজ্ঞেস করলেন, কেন? আমি বললাম, আপনার সঙ্গীদ্বয় এমনটা করেননি। তিনি বললেন, তাঁরা দু’জন অনুসরণ করার মত লোকই ছিলেন। [১৫৯৪] (আধুনিক প্রকাশনী- ৬৭৬৭, ইসলামিক ফাউন্ডেশন- ৬৭৭৯)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 7276,
			"arabicnumber": 7276,
			"text": "হুযাইফাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের হাদীস বর্ণনা করেছেন যে, আমানাত আসমান হতে মানুষের অন্তরের অন্তঃস্তলে অবতীর্ণ হয়েছে, তারপর কুরআন অবতীর্ণ হয়েছে এবং মানুষ কুরআন পাঠ করেছে এবং সুন্নাত শিক্ষা করেছে। [৬৪৯৭] (আধুনিক প্রকাশনী- ৬৭৬৮, ইসলামিক ফাউন্ডেশন- ৬৭৮০)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 7277,
			"arabicnumber": 7277,
			"text": "‘আবদুল্লাহ্ ইবনু মাস‘ঊদ (রাঃ) হতে বর্ণিত যে, সর্বোত্তম কালাম হল আল্লাহর কিতাব, আর সর্বোত্তম পথ নির্দেশনা হল মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর পথ নির্দেশনা। আর সবচেয়ে নিকৃষ্ট বিষয় হল নতুনভাবে উদ্ভাবিত পন্থাসমূহ। ‘‘তোমাদের কাছে যার ও‘য়াদা দেয়া হচ্ছে তা ঘটবেই, তোমরা ব্যর্থ করতে পারবে না’’- (সূরাহ আন‘আম ৬/১৩৪)।[1] [৬০৯৮] (আধুনিক প্রকাশনী- ৬৭৬৯, ইসলামিক ফাউন্ডেশন- ৬৭৮১)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 7279,
			"arabicnumber": 7279,
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 7280,
			"arabicnumber": 7280,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমার সকল উম্মাতই জান্নাতে প্রবেশ করবে, কিন্তু যে অস্বীকার করবে। তারা বললেন, কে অস্বীকার করবে। তিনি বললেনঃ যারা আমার অনুসরণ করবে তারা জান্নাতে প্রবেশ করবে, আর যে আমার অবাধ্য হবে সে-ই অস্বীকার করবে।[1] (আধুনিক প্রকাশনী- ৬৭৭১, ইসলামিক ফাউন্ডেশন- ৬৭৮৩)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 7281,
			"arabicnumber": 7281,
			"text": "জাবির ইবনু ‘আবদুল্লাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, একদল ফেরেশ্তা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট আসলেন। তিনি তখন ঘুমিয়ে ছিলেন। একজন ফেরেশ্তা বললেন, তিনি (নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম] ঘুমিয়ে আছেন। অন্য একজন বললেন, চক্ষু ঘুমিয়ে বটে, কিন্তু অন্তর জেগে আছে। তখন তারা বললেন, তোমাদের এ সাথীর একটি উদাহরণ আছে। সুতরাং তাঁর উদাহরণ তোমরা বর্ণনা কর। তখন তাদের কেউ বলল- তিনি তো ঘুমন্ত, আর কেউ বলল, চক্ষু ঘুমন্ত তবে অন্তর জাগ্রত। তখন তারা বলল, তাঁর উদাহরণ হল সেই লোকের মত, যে একটি বাড়ী তৈরি করল। তারপর সেখানে খানার আয়োজন করল এবং একজন আহবানকারীকে (লোকদের ডাকতে) পাঠাল। যারা আহবানকারীর ডাকে সাড়া দিল, তারা ঘরে প্রবেশ করে খানা খাওয়ার সুযোগ পেল। আর যারা আহবানকারীর ডাকে সাড়া দিল না, তারা ঘরেও প্রবেশ করতে পারল না এবং খানাও খেতে পারল না। তখন তারা বললেন, উদাহরণটির ব্যাখ্যা করুন, যাতে তিনি বুঝতে পারেন। তখন কেউ বলল, তিনি তো ঘুমন্ত, আর কেউ বলল, চক্ষু ঘুমন্ত, তবে অন্তর জাগ্রত। তখন তারা বললেন, ঘরটি হল জান্নাত, আহবানকারী হলেন মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম। যারা মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর অনুসরণ করল, তারা আল্লাহর আনুগত্য করল। আর যারা মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর অবাধ্যতা করল, তারা আসলে আল্লাহরই অবাধ্যতা করল। মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হলেন মানুষের মাঝে পার্থক্যের মাপকাঠি। কুতাইবাহ জাবির (রাঃ) থেকে এরকম হাদীস বর্ণনা করেছেন, তবে তিনি ‘‘নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের কাছে বের হয়ে আসলেন’’ এ কথাটি বলেছেন। (আধুনিক প্রকাশনী- ৬৭৭২, ইসলামিক ফাউন্ডেশন- ৬৭৮৪)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 7282,
			"arabicnumber": 7282,
			"text": "হুযাইফাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, হে কুরআন পাঠকারী সমাজ! তোমরা (কুরআন ও সুন্নাহর উপর) সুদৃঢ় থাক। নিশ্চয়ই তোমরা অনেক পশ্চাতে পড়ে আছ। আর যদি তোমরা ডানদিকের কিংবা বামদিকের পথ অনুসরণ কর তাহলে তোমরা সঠিকপথ বহু দূরে সরে পড়বে। (আধুনিক প্রকাশনী- ৬৭৭৩, ইসলামিক ফাউন্ডেশন- ৬৭৮৫)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 7283,
			"arabicnumber": 7283,
			"text": "আবূ মূসা (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণনা করেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমার ও আমাকে আল্লাহ্ যা কিছু দিয়ে পাঠিয়েছেন তার উদাহরণ হল এমন যে, এক লোক কোন এক কাওমের নিকট এসে বলল, হে কাওম! আমি নিজের চোখে সেনাবাহিনীকে দেখে এসেছি। আমি সুস্পষ্ট সতর্ককারী। কাজেই তোমরা আত্মরক্ষার চেষ্টা কর। কাওমের কিছু লোক তার কথা মেনে নিল, সুতরাং রাতের প্রথম প্রহরে তারা সে জায়গা ছেড়ে রওনা হল এবং একটি নিরাপদ জায়গায় গিয়ে পৌঁছল। ফলে তারা রক্ষা পেল। তাদের মধ্যেকার আর একদল লোক তার কথা মিথ্যা জানল, ফলে তারা নিজেদের জায়গাতেই রয়ে গেল। সকাল বেলায় শত্রুবাহিনী তাদের উপর আক্রমণ চালাল, তাদেরকে ধ্বংস করে দিল এবং তাদেরকে উৎপাটিত করে দিল। এই হল তাদের উদাহরণ যারা আমার আনুগত্য করে এবং আমি যা নিয়ে এসেছি তার অনুসরণ করে। আর যারা আমার কথা অমান্য করে তাদের দৃষ্টান্ত হল আমি যে সত্য নিয়ে এসেছি তাকে মিথ্যা প্রতিপন্ন করে। (আধুনিক প্রকাশনী- ৬৭৭৪, ইসলামিক ফাউন্ডেশন- ৬৭৮৬)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 7285,
			"arabicnumber": 7285,
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 7286,
			"arabicnumber": 7286,
			"text": "‘আবদুল্লাহ্ ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, ‘উয়াইনাহ ইবনু হিস্ন ইবনু হুযাইফাহ ইবনু বাদ্র (রহ.) তাঁর ভাতিজা হুর ইবনু কায়স ইবনু হিস্ন-এর কাছে আসলেন। ‘উমার (রাঃ) যাদের নিজে সন্নিকটে রাখতেন, হুর ইবনু কায়স (রহ.) ছিলেন তাদেরই একজন। যুবক হোক কিঙবা বৃদ্ধ কারী (আলিম) ব্যক্তিরাই ‘উমার (রাঃ)-এর মজলিসের সদস্য ও পরামর্শদাতা ছিলেন। উয়ায়না তার ভাতিজাকে বললেন, হে ভাতিজা! তোমার কি আমীরের নিকট এতটুকু প্রভাব আছে যে আমার জন্য সাক্ষাতের অনুমতি গ্রহণ করতে পারবে? সে বলল, আমি আপনার ব্যাপারে তাঁর কাছে অনুমতি চাইব। ইবনু ‘আব্বাস (রাঃ) বলেন, তিনি (হুর) ‘উয়াইনাহর জন্য অনুমতি চাইলেন। তারপর যখন ‘উয়াইনাহ (রাঃ) ‘উমার (রাঃ)-এর নিকট গেলেন, তখন সে বলল, হে ইবনু খাত্তাব! আল্লাহর কসম! আপনি আমাদের মাল দিচ্ছেন না, আবার ইনসাফের ভিত্তিতে আমাদের মাঝে ফায়সালাও করছেন না। তখন ‘উমার (রাঃ) রেগে গেলেন, এমন কি তিনি তাকে মারতে উদ্যত হলেন। তখন হুর বললেন, হে আমীরুল মু’মিনীন। আল্লাহ্ তাঁর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলেছেনঃ ‘‘তুমি ক্ষমা অবলম্বন কর, সৎ কাজের আদেশ দাও, আর নির্বোধদের উপেক্ষা কর’’- (সূরাহ আল-আ’রাফ ৭/১৯৯)। এ লোকটি একজন মূর্খ। আল্লাহর শপথ! ‘উমার (রাঃ)-এর সামনে এ আয়াতটি পাঠ করা হলে তিনি তা এতটুকু লঙ্ঘন করলেন না। তিনি আল্লাহর কিতাবের খুবই অনুগত ছিলেন। [৪৬৪২] (আধুনিক প্রকাশনী- ৬৭৭৬, ইসলামিক ফাউন্ডেশন- ৬৭৮৮)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 7287,
			"arabicnumber": 7287,
			"text": "আসমা বিনত আবূ বকর (রাঃ) হতে বর্ণিত। তিনি বলেন, একবার সূর্যগ্রহণের সময় আমি ‘আয়িশাহ (রাঃ)-এর কাছে এলাম। লোকেরা তখন (সালাতে) দাঁড়িয়েছিল এবং তিনিও দাঁড়িয়ে সালাত পড়ছিলেন। আমি জিজ্ঞেস করলাম, লোকদের কী হল? তিনি হাত দিয়ে আকাশের দিকে ইঙ্গিত করলেন এবং বললেন, সুবহানাল্লাহ্! আমি বললাম, এটা কি কোন নিদর্শন? তখন তিনি মাথা নেড়ে হাঁ বললেন। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন সালাত পড়া শেষ করলেন, তখন তিনি আল্লাহর প্রশংসা করলেন ও ছানা পড়লেন। তারপর বললেন, আমি যা দেখিনি তার সবকিছুই আজকে আমার এ জায়গায় দেখলাম। এমন কি জান্নাত ও জাহান্নামও দেখলাম। আর আমার কাছে ওয়াহী করা হয়েছে যে, কবরে তোমাদের পরীক্ষা করা হবে, প্রায় দাজ্জালের পরীক্ষার মতই। তবে যারা মু’মিন হবে, অথবা (বলেছিলেন) মুসলিম হবে। বর্ণনাকারী বলেন, আসমা (রাঃ) ‘মু’মিন’ বলেছিলেন, না ‘মুসলিম’ বলেছিলেন তা আমার স্মরণ নেই। তারা বলবে, মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের কাছে স্পষ্ট প্রমাণ নিয়ে এসেছিলেন, আমরা তাঁর ডাকে সাড়া দিয়েছি এবং ঈমান এনেছি। তখন তাকে বলা হবে, শান্তিতে ঘুমোও, আমরা জানি তুমি দৃঢ় বিশ্বাসী ছিলে। আর যারা মুনাফিক হবে অথবা (বলেছিলেন) সন্দেহকারী হবে- বর্ণনাকারী বলেন, আসমা ‘মুনাফিক’ বলেছিলেন না ‘সন্দেহকারী’ বলেছিলেন তা আমার মনে নেই- তারা বলবে, আমি কিছুই জানি না, আমি মানুষকে কথা বলতে শুনেছি, আর তাই বলেছি। [৮৬] (আধুনিক প্রকাশনী- ৬৭৭৭, ইসলামিক ফাউন্ডেশন- ৬৭৮৯)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 7288,
			"arabicnumber": 7288,
			"text": "আবূ হুরাইরাহ (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণনা করেছেন। তিনি বলেছেনঃ তোমরা আমাকে প্রশ্ন করা থেকে বিরত থাক, যে পর্যন্ত না আমি তোমাদের কিছু না বলি। কেননা, তোমাদের আগে যারা ছিল, তারা তাদের নবীদেরকে বেশি বেশি প্রশ্ন করা ও নবীদের (নবীদের) সঙ্গে মতভেদ করার জন্যই ধ্বংস হয়েছে। তাই আমি যখন তোমাদেরকে কোন ব্যাপারে নিষেধ করি, তখন তাত্থেকে বেঁচে থাক। আর যদি কোন বিষয়ে আদেশ করি তাহলে সাধ্য অনুসারে মেনে চল। [মুসলিম ১৫/৭৩, হাঃ ১৩৩৭, আহমাদ ৯৭৮৭] (আধুনিক প্রকাশনী- ৬৭৭৮, ইসলামিক ফাউন্ডেশন- ৬৭৯০)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 7289,
			"arabicnumber": 7289,
			"text": "এবং আল্লাহর বাণীঃ তোমরা সেসব বিষয়ে প্রশ্ন করো না, যা প্রকাশিত হলে তোমরা দুঃখিত হবে। (সূরাহ আল-মায়িদাহ ৫/১০১) ৭২৮৯. আবূ ওয়াক্কাস (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মুসলিমদের সর্বাপেক্ষা বড় অপরাধী ঐ লোক যে এমন বিষয়ে প্রশ্ন করে যা আগে হারাম ছিল না, কিন্তু তার প্রশ্ন করার কারণে তা হারাম করা হয়েছে। [মুসলিম ৪৩/৩৭, হাঃ ২৩৫৮, আহমাদ ১৫৪৫] (আধুনিক প্রকাশনী- ৬৭৭৯, ইসলামিক ফাউন্ডেশন- ৬৭৯১)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 7290,
			"arabicnumber": 7290,
			"text": "যায়দ ইবনু সাবিত (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম চাটাই দিয়ে মসজিদে একটি হুজরা বানিয়েছিলেন। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার ভিতর কয়েক রাত সালাত পড়লেন। এতে লোকেরা তাঁর সঙ্গে একত্রিত হত। তারপর এক রাতে তারা তাঁর আওয়াজ শুনতে পেল না এবং তারা ভাবল, তিনি ঘুমিয়ে গেছেন। তাদের কেউ কেউ গলা খাঁকার দিতে লাগল, যাতে তিনি তাদের নিকট বেরিয়ে আসেন। তখন তিনি [নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম] বললেনঃ তোমাদের এ ক’ দিনের কর্মকান্ড আমি দেখেছি, এতে আমার আশঙ্কা হচ্ছে, তোমাদের উপর তা ফরজ করে দেয়া হতে পারে। কিন্তু যদি তোমাদের উপর ফরজ করে দেয়া হয় তাহলে তোমরা তা প্রতিষ্ঠিত করবে না। কাজেই ওহে লোকেরা! তোমরা নিজ নিজ ঘরে সালাত পড়। কারণ, মানুষের সবচেয়ে উত্তম সালাত হল যা সে তার ঘরে আদায় করে ফরয সালাত ছাড়া। [৭৩১] (আধুনিক প্রকাশনী- ৬৭৮০, ইসলামিক ফাউন্ডেশন- ৬৭৯২)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 7291,
			"arabicnumber": 7291,
			"text": "আবূ মূসা আশ‘আরী (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে কতকগুলো বিষয়ে প্রশ্ন করা হল যা তিনি অপছন্দ করলেন। লোকেরা যখন তাঁকে অধিক অধিক প্রশ্ন করতে লাগল, তিনি রাগান্বিত হলেন এবং বললেনঃ আমাকে প্রশ্ন কর। তখন এক লোক দাঁড়িয়ে জিজ্ঞেস করল, হে আল্লাহর রাসূল! আমার পিতা কে? তিনি বললেনঃ তোমার পিতা হল হুযাফা। এরপর আরেকজন দাঁড়িয়ে জিজ্ঞেস করল, হে আল্লাহর রাসূল! আমার পিতা কে? তিনি বললেনঃ তোমার পিতা শায়বাহর আযাদকৃত গোলাম সালিম। ‘উমার (রাঃ) রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর চেহারায় রাগের আলামাত দেখে বললেন, আমরা আল্লাহর কাছে তওবা করছি। (আধুনিক প্রকাশনী- ৬৭৮১, ইসলামিক ফাউন্ডেশন- ৬৭৯৩)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 7292,
			"arabicnumber": 7292,
			"text": "মুগীরাহ ইবনু শু‘বাহ (রাঃ)-এর লেখক ওয়াররাদ (রাঃ) হতে বর্ণিত। তিনি বলেন, মু‘আবিয়াহ (রাঃ) মুগীরাহ (রাঃ)-এর কাছে লিখে পাঠালেন যে, তুমি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে যা কিছু শুনেছ তা আমার কাছে লিখে পাঠাও। তিনি বলেন, তিনি তাকে লিখলেন যে, আল্লাহর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম প্রতি সালাতের পর বলতেনঃ আল্লাহ্ ব্যতীত অন্য কোন ইলাহ্ নেই। তিনি একক, তাঁর কোন শারীক নেই, সাম্রাজ্য তাঁরই, আর সকল প্রশংসা তাঁরই জন্য, তিনি সকল বিষয়ের উপর ক্ষমতাবান। হে আল্লাহ্! তুমি যা দান করবে তাকে আটকানোর কেউ নেই, আর তুমি আটকাবে তা দেয়ার মত কেউ নেই। ধন সম্পদ তোমার নিকটে সম্পদশালীদের কোন উপকার করবে না। তিনি আরো লিখেছিলেন যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তর্কে লিপ্ত হওয়া, বেশি বেশি প্রশ্ন করা ও সম্পদ বিনষ্ট করা থেকে নিষেধ করতেন। আর তিনি মায়েদের অবাধ্য হতে, কন্যা সন্তানদের জীবন্ত কবর দিতে ও প্রাপকের পাওনা দেয়া থেকে হাত গুটাতে আর নেয়ার ব্যাপারে হাত বাড়িয়ে দিতে নিষেধ করতেন। আবূ ‘আবদুল্লাহ্ [বুখারী (রহ.)] বলেন, তারা (কাফির) জাহিলীয়্যাতের যুগে স্বীয় কন্যাদেরকে হত্যা করতেন। অতঃপর আল্লাহ তা হারাম করে দেন। [৮৪৪] (আধুনিক প্রকাশনী- ৬৭৮২, ইসলামিক ফাউন্ডেশন- ৬৭৯৪)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 7293,
			"arabicnumber": 7293,
			"text": "আনাস (রাঃ) হতে বর্ণিত। তিনি বলেন, আমরা ‘উমার (রাঃ)-এর কাছে ছিলাম। তখন তিনি বললেনঃ (যাবতীয়) কৃত্রিমতা হতে আমাদেরকে নিষেধ করা হয়েছে।[1] (আধুনিক প্রকাশনী- ৬৭৮৩, ইসলামিক ফাউন্ডেশন- ৬৭৯৫)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 7294,
			"arabicnumber": 7294,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। দুপুরের পর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বেরিয়ে আসলেন এবং যুহরের সালাত পড়লেন। সালাম ফিরানোর পর তিনি মিম্বরে দাঁড়ালেন এবং ক্বিয়ামাত (কিয়ামত) সম্পর্কে আলোচনা করলেন। তিনি উল্লেখ করলেন যে, কিয়ামতের আগে অনেক বড় বড় ঘটনা ঘটবে। তারপর তিনি বললেনঃ কেউ যদি আমাকে কোন বিষয়ে জিজ্ঞেস করা পছন্দ করে, তাহলে সে তা করতে পারে। আল্লাহর শপথ! আমি এখানে অবস্থান করা পর্যন্ত তোমরা আমাকে যে বিষয়েই প্রশ্ন করবে, আমি তা তোমাদেরকে জানাব। আনাস (রাঃ) বলেন, এতে লোকেরা খুব বেশি কাঁদল। আর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বেশি বেশি বলতে থাকলেন তোমরা আমার কাছে প্রশ্ন কর। আনাস (রাঃ) বলেন, তখন এক লোক দাঁড়িয়ে বলল, হে আল্লাহর রাসূল! আমার আশ্রয়ের জায়গা কোথায়? তিনি বললেন, জাহান্নাম। তারপর ‘আবদুল্লাহ্ ইবনু হুযাফা (রাঃ) দাঁড়িয়ে বললেনঃ হে আল্লাহর রাসূল! আমার পিতা কে? তিনি বললেনঃ তোমার পিতা হুযাফা। আনাস (রাঃ) বলেন, তারপর তিনি বার বার বলতে লাগলেনঃ তোমরা আমার কাছে প্রশ্ন কর, আমার কাছে প্রশ্ন কর। এতে ‘উমার (রাঃ) হাঁটু গেড়ে বসে গেলেন এবং বললেন, আমরা আল্লাহকে রব হিসাবে মেনে ইসলামকে দ্বীন হিসাবে গ্রহণ করে এবং মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে রাসূল হিসাবে বিশ্বাস করে সন্তুষ্ট আছি। আনাস (রাঃ) বলেন, ‘উমার (রাঃ) যখন এ কথা বললেন, তখন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম চুপ করলেন। তারপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন: উত্তম! যে সত্তার হাতে আমার প্রাণ তাঁর শপথ করে বলছি, এই মুহূর্তে আমি যখন সালাতে ছিলাম তখন এ দেয়ালের প্রস্থে জান্নাত ও জাহান্নাম আমার সামনে পেশ করা হয়েছিল। আজকের মত এমন ভাল আর মন্দ আমি আর দেখিনি। [৯৩] (আধুনিক প্রকাশনী- ৬৭৮৪, ইসলামিক ফাউন্ডেশন- ৬৭৯৬)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 7295,
			"arabicnumber": 7295,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। তিনি বলেন, এক লোক জিজ্ঞেস করল, হে আল্লাহর নবী! কে আমার পিতা? তিনি বললেনঃ তোমার পিতা অমুক। তারপর এ আয়াত নাযিল হলঃ ‘‘হে মু’মিনরা! তোমরা এমন বিষয়ে প্রশ্ন কর না, যা প্রকাশিত হলে তোমরা দুঃখিত হবে.....’’ (সূরাহ আল-মায়িদাহ ৫/১০১)। [৯৩] (আধুনিক প্রকাশনী- ৬৭৮৫, ইসলামিক ফাউন্ডেশন- ৬৭৯৭)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 7296,
			"arabicnumber": 7296,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন ঃ লোকেরা একে অপরকে প্রশ্ন করতে থাকবে যে, এ আল্লাহ সব কিছুরই স্রষ্টা, তাহলে আল্লাহকে কে সৃষ্টি করল?[1] [মুসলিম ১/৬০, হাঃ ১৩৬] (আধুনিক প্রকাশনী- ৬৭৮৬, ইসলামিক ফাউন্ডেশন- ৬৭৯৮)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 7297,
			"arabicnumber": 7297,
			"text": "ইবনু মাস‘ঊদ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে মাদ্বীনাহ্য় এক শস্য ক্ষেতে ছিলাম। তিনি একটি খেজুরের ডালে ভর দিয়ে ইয়াহূদীদের একটি দলের নিকট দিয়ে যাচ্ছিলেন। তাদের কেউ বলল, তাকে রূহ্ সম্পর্কে জিজ্ঞেস কর। আর কেউ বলল তাঁকে জিজ্ঞেস করো না, এতে তোমাদেরকে এমন উত্তর শুনতে হতে পারে যা তোমরা অপছন্দ কর। অতঃপর তারা তাঁর কাছে উঠে গিয়ে বলল, হে আবুল কাসিম! আমাদেরকে রূহ্ সম্পর্কে জানান। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দাঁড়িয়ে কিছুক্ষণ তাকিয়ে রইলেন। আমি বুঝলাম, তাঁর কাছে ওয়াহী অবতীর্ণ হচ্ছে, আমি তাঁর থেকে একটু পিছে সরে দাঁড়ালাম। ওয়াহী শেষ হল। তারপর তিনি বললেনঃ ‘তারা তোমাকে রূহ্ সম্পর্কে জিজ্ঞেস করে। বল, ‘রূহ্ আমার প্রতিপালকের আদেশ......’ (সূরাহ ইসরা ১৭/৮৫)। [১২৫] (আধুনিক প্রকাশনী- ৬৭৮৭, ইসলামিক ফাউন্ডেশন- ৬৭৯৯)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 7298,
			"arabicnumber": 7298,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একটি সোনার আংটি পরতেন। তখন লোকেরাও সোনার আংটি পরতে লাগল। এরপর (একদিন) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আমি সোনার আংটি পরছিলাম- তারপর তিনি তা ছুঁড়ে ফেলে দিলেন এবং বললেনঃ আমি আর কোন দিনই তা পরিধান করব না। ফলে লোকেরাও তাদের আংটিগুলো ছুঁড়ে ফেলল। [৫৮৬৫] (আধুনিক প্রকাশনী- ৬৭৮৮, ইসলামিক ফাউন্ডেশন- ৬৮০০)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 7299,
			"arabicnumber": 7299,
			"text": "কারণ, আল্লাহ্ বলেছেনঃ ওহে কিতাবধারীগণ! তোমরা তোমাদের দ্বীনের ব্যাপারে বাড়াবাড়ি করো না, আর আল্লাহ সম্বন্ধে সত্য ছাড়া কিছু বলো না.....। (সূরাহ আন-নিসা ৪/১৭১) ৭২৯৯. আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা ইফতার না করে লাগাতার সওম রেখো না। সাহাবীরা বললেন, আপনি তো ইফতার না করে লাগাতার সওম রাখেন। তিনি বললেনঃ আমি তোমাদের মতো নই। আমি রাত কাটাই যাতে আমার রব আমাকে খাওয়ান ও পান করান। কিন্তু তাঁরা লাগাতার সওম রাখা থেকে বিরত হলো না। ফলে তাদের সঙ্গে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও দু’দিন অথবা (বর্ণনাকারী বলেছিলেন) দু’ রাত লাগাতার সওম রাখলেন। এরপর তাঁরা নতুন চাঁদ দেখতে পেলেন। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ যদি চাঁদ (আরও কয়েক দিন) দেরী করে উঠত, তাহলে আমিও (লাগাতার সওম রেখে) তোমাদের সওমের সময়কে বাড়িয়ে দিতাম, তাদেরকে দৃষ্টান্তমূলক শাস্তি দেয়ার জন্য। [১৯৬৫] (আধুনিক প্রকাশনী- ৬৭৮৯, ইসলামিক ফাউন্ডেশন- ৬৮০১)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 7300,
			"arabicnumber": 7300,
			"text": "ইবরাহীম তায়মী (রহ.) হতে বর্ণিত। তিনি বলেন, আমার পিতা বর্ণনা করেছেন যে, একবার ‘আলী (রাঃ) পাকা ইটের তৈরী একটি মিম্বরে উঠে আমাদের উদ্দেশে খুত্বা দিলেন। তাঁর সাথে একটা তলোয়ার ছিল, যার মাঝে একটি সহীফা ঝুলছিল। তিনি বললেন, আল্লাহর কসম! আমাদের কাছে আল্লাহর কিতাব এবং যা এই সহীফাতে লেখা আছে এ ব্যতীত অন্য এমন কোন কিতাব নেই যা পাঠ করা যেতে পারে। তারপর তিনি তা খুললেন। তাতে উটের বয়স সম্পর্কে লেখা ছিল এবং লেখা ছিল যে, ‘আয়র’ পর্বত থেকে অমুক স্থান পর্যন্ত মাদ্বীনাহ হারাম (পবিত্র এলাকা) বলে গণ্য হবে। যে কেউ এখানে কোন অন্যায় করবে তার উপর আল্লাহ্, ফেরেশ্তামন্ডলী ও সকল মানুষের অভিসম্পাত। আর আল্লাহ্ তার ফরজ ও নফল কোন ‘ইবাদাতই কবূল করবেন না এবং তাতে আরও ছিল যে, এখানকার সকল মুসলিমের নিরাপত্তা একই স্তরের। একজন নিম্ন স্তরের লোকও (অন্যকে) নিরাপত্তা দিতে পারবে। যদি কেউ অন্য মুসলিমের প্রদত্ত নিরাপত্তাকে লঙ্ঘন করে, তাহলে তার উপর আল্লাহর, ফেরেশ্তামন্ডলীর ও সকল মানুষের লা‘নাত। আল্লাহ্ তার ফরজ ও নফল কোন ‘ইবাদাতই গ্রহণ করবেন না। তাতে আরও ছিল, যদি কেউ তার (মুক্তি দাতা) মনিবের অনুমতি ছাড়া অন্যকে নিজের (গোলামী কালীন সময়ের) মনিব বলে উল্লেখ করে, তাহলে তার উপর আল্লাহর, ফেরেশ্তামন্ডলীর ও সকল মানুষের অভিসম্পাত। আর আল্লাহ্ তা‘আলা তার ফার্য (ফরয), নফল কোন ‘ইবাদাতই কবূল করবেন না। [১১১; মুসলিম ১৫/৮৫, হাঃ ১৩৭০, আহমাদ ১৩৭, ৬১৫] (আধুনিক প্রকাশনী- ৬৭৯০, ইসলামিক ফাউন্ডেশন- ৬৮০২)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 7301,
			"arabicnumber": 7301,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিজে একটি কাজ করলেন এবং তাতে তিনি অবকাশ দিলেন। তবে কিছু লোক এর থেকে নিবৃত্ত থাকল। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে এ খবর পৌঁছল। তিনি আল্লাহর প্রশংসা করলেন ও ছানা পাঠ করলেন, তারপর বললেনঃ লোকদের কী হল যে, তারা এমন কাজ থেকে নিবৃত্ত থাকে যা আমি করি। আল্লাহর শপথ! আমি আল্লাহ্ সম্পর্কে তাদের চেয়ে বেশি জানি এবং আমি তাদের চেয়ে আল্লাহকে অনেক বেশি ভয় করি। [৬১০১] (আধুনিক প্রকাশনী- ৬৭৯১, ইসলামিক ফাউন্ডেশন- ৬৮০৩)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 7302,
			"arabicnumber": 7302,
			"text": "ইবনু আবূ মুলাইকাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, দু’জন অতি ভাল লোক আবূ বকর (রাঃ) ও ‘উমার (রাঃ) ধ্বংসের কাছাকাছি পৌঁছে গিয়েছিলেন। বানী তামীমের প্রতিনিধি দল যখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে আসল, তখন তাদের একজন [‘উমার (রাঃ)] আকরা ইবনু হাবিস হানযালী নামে বানী মুজাশে গোত্রের ভ্রাতা এক লোকের দিকে ইঙ্গিত করলেন, অন্যজন [আবূ বকর (রাঃ)] আরেক জনের দিকে ইঙ্গিত করলেন। এতে আবূ বকর (রাঃ) ‘উমার (রাঃ)-কে বললেন, আপনার ইচ্ছা হল আমার বিরোধিতা করা। ‘উমার (রাঃ) বললেন, আমি আপনার বিরোধিতার ইচ্ছা করিনি। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সামনে তাঁদের দু’জনেরই আওয়াজ উচ্চ হয়ে যায়। ফলে অবতীর্ণ হয়: ‘‘হে মু’মিনগণ! তোমরা নবীর গলার আওয়াজের উপর তোমাদের গলার আওয়াজ উচ্চ করো না.....’’ (সূরাহ আল-হুজুরাত ৪৯/২)। ইবনু আবূ মুলাইকাহ বলেন, ইবনু যুবায়র (রাঃ) বর্ণনা করেন যে, এরপরে ‘উমার (রাঃ) যখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে কোন কথা বলতেন, তখন গোপন বিষয়ে আলাপকারীর মত চুপে চুপে বলতেন, এমন কি তা শোনা যেত না, যতক্ষণ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার থেকে আবার জিজ্ঞেস না করতেন। এ হাদীসের রাবী ইবনু যুবায়র তাঁর পিতা অর্থাৎ নানা আবূ বকর (রাঃ) থেকে উল্লেখ করেননি। [৪৩৬৭] (আধুনিক প্রকাশনী- ৬৭৯২, ইসলামিক ফাউন্ডেশন- ৬৮০৪)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 7303,
			"arabicnumber": 7303,
			"text": "উম্মুল মু’মিনীন ‘আয়িশাহ (রাঃ) হতে বর্ণিত যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর অসুখের সময় বললেনঃ তোমরা আবূ বকরকে বল, লোকদের তিনি নিয়ে যেন সালাত আদায় করে নেন। ‘আয়িশাহ (রাঃ) বলেন, আমি বললাম যে, আবূ বকর (রাঃ) যদি আপনার জায়গায় দাঁড়ান তাহলে কান্নার কারণে মানুষকে তার আওয়াজ শোনাতে পারবেন না। কাজেই আপনি ‘উমার (রাঃ)-কে আদেশ করুন, তিনি যেন লোকদের নিয়ে সালাত আদায় করেন। তিনি আবার বললেন, তোমরা আবূ বকরকে বল, তিনি যেন লোকদের নিয়ে সালাত আদায় করেন। ‘আয়িশাহ (রাঃ) বলেন, আমি হাফসাহ (রাঃ)-কে বললাম, তুমি বল যে, আবূ বকর আপনার জায়গায় দাঁড়ালে কান্নার কারণে লোকেদেরকে তার আওয়াজ শোনাতে পারবেন না। কাজেই আপনি ‘উমার (রাঃ)-কে আদেশ করুন। তিনি যেন লোকদের নিয়ে সালাত আদায় করেন। হাফসাহ (রাঃ) তাই করলেন। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন ঃ তোমরা তো ইউসুফ (আঃ)-এর মহিলাদের মত (যারা তাঁকে বিভ্রান্ত করতে চেয়েছিল)। আবূ বকরকে বল, তিনি যেন লোকদের নিয়ে সালাত আদায় করেন। হাফসাহ (রাঃ) ‘আয়িশাহ (রাঃ)-কে বললেন, আমি আপনার নিকট হতে কখনই কল্যাণ পাইনি। [১৯৮] (আধুনিক প্রকাশনী- ৬৭৯৩, ইসলামিক ফাউন্ডেশন- ৬৮০৫)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 7304,
			"arabicnumber": 7304,
			"text": "সাহল ইবনু সা‘দ সা‘ঈদী (রাঃ) হতে বর্ণিত। তিনি বলেন, উওয়ায়মির (রাঃ) আসিম ইবনু আদীর কাছে এসে বলল, আপনার কী অভিমত, যদি কেউ তার স্ত্রীর সঙ্গে অন্য কাউকে পায় এবং তাকে হত্যা করে ফেলে, তাহলে এজন্য আপনারা কি তাকে হত্যা করবেন? হে আসিম! আপনি আমার জন্য এ বিষয়টি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে জিজ্ঞেস করুন। তিনি জিজ্ঞেস করলে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এমন বিষয়ে জিজ্ঞেস করাকে অপছন্দ করলেন এবং উত্তর দিতে অস্বীকার করলেন। আসিম (রাঃ) ফিরে এসে তাকে জানাল যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বিষয়টিকে অপছন্দ মনে করেছেন। উওয়াইমির (রাঃ) বললেন, আল্লাহর কসম! অবশ্য অবশ্যই আমি নিজেই নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট যাব। তারপর তিনি আসলেন। আসিম (রাঃ) চলে যাবার পরেই আল্লাহ্ কুরআন অবতীর্ণ করেছেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বললেনঃ তোমাদের ব্যাপারে আল্লাহ কুরআনের আয়াত নাযিল করেছেন। তিনি তাদের দু’জনকেই (সে ও তার স্ত্রী) ডাকলেন। তারা উপস্থিত হল এবং ‘লি’আন’ করল। তারপর উওয়ায়মির (রাঃ) বলল, হে আল্লাহর রাসূল! যদি আমি তাকে আটকে রাখি তাহলে তো আমি তার উপর মিথ্যারোপ করেছি, এ বলে তিনি তার সঙ্গে বিবাহ ছিন্ন করলেন। অবশ্য নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বিবাহ ছিন্ন করতে বলেননি। পরে ‘লি‘আন’কারীদের মাঝে এ প্রথাই চালু হয়ে গেল। নবী (মহিলাটি সম্পর্কে) বললেনঃ একে লক্ষ্য রেখ, যদি সে খাটো ওয়াহারার (এক রকমের পোকা) মত লালচে সন্তান প্রসব করে, তাহলে আমি মনে করব উওয়াইমির মিথ্যাই বলেছে। আর যদি সে কাল চোখওয়ালা ও বড় নিতম্বধারী সন্তান প্রসব করে, তাহলে মনে করব উওয়াইমির তার ব্যাপারে সত্যই বলেছে। পরে সে অপকর্মের ফল নিয়ে হাজির হয়। (আধুনিক প্রকাশনী- ৬৭৯৪, ইসলামিক ফাউন্ডেশন- ৬৮০৬)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 7305,
			"arabicnumber": 7305,
			"text": "ইবনু শিহাব (রহ.) হতে বর্ণিত। তিনি বলেন, মালিক ইবনু আওস নাযরী (রহ.) আমাকে এ হাদীসটি বর্ণনা করেছেন। অবশ্য মুহাম্মাদ ইবনু যুবায়র ইবনু মুতঈম এ ব্যাপারে কিছু কথা বলেছিলেন। পরে আমি মালিকের নিকট যাই এবং তাকে এ ব্যাপারে জিজ্ঞেস করি। তখন তিনি বলেন, ‘উমার (রাঃ)-এর সঙ্গে দেখা করার জন্য রওনা হয়ে তাঁর কাছে হাজির হলাম। এমন সময় তাঁর দ্বাররক্ষক ইয়ারফা এসে বলল, ‘উসমান, ‘আবদুর রহমান, যুবায়র এবং সা‘দ (রাঃ) আসতে চাচ্ছেন। আপনার অনুমতি আছে কি? তিনি বললেন, হ্যাঁ। তারপর তাঁরা প্রবেশ করলেন এবং সালাম দিয়ে আসনে বসলেন। দ্বাররক্ষক (আবার) বলল, ‘আলী এবং ‘আব্বাসের ব্যাপারে আপনার অনুমতি আছে কি? তিনি তাদের দু’জনকে অনুমতি দিলেন। ‘আব্বাস (রাঃ) এসে বললেন, হে আমীরুল মু’মিনীন! আমার ও সীমালঙ্ঘনকারীর মাঝে ফায়সালা করে দিন। এবং তারা পরস্পরকে গালমন্দ করলেন। তখন দলটি বললেন ‘উসমান ও তাঁর সঙ্গীরা, হে আমীরুল মু’মিনীন! এ দু’জনের মাঝে ফায়সালা করে দিয়ে একজনকে অন্যজন হতে শান্তি দিন। ‘উমার (রাঃ) বললেন, আপনারা একটু ধৈর্য ধারণ করুন। আমি আপনাদেরকে সেই আল্লাহর কসম দিয়ে জিজ্ঞেস করছি যার হুকুমে আসমান ও যমীন নিজ স্থানে বিদ্যমান, আপনারা কি এ কথা জানেন যে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছিলেন ঃ আমাদের সম্পদ ওয়ারিশদের মাঝে বণ্টিত হয় না, আমরা যা রেখে যাই তা সদাকাহ হিসাবে গণ্য হয়? এ কথা দ্বারা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিজেকেই বুঝিয়েছিলেন। দলের সবাই বললেন, হ্যাঁ তিনি এ কথা বলেছিলেন। তারপর ‘উমার (রাঃ) ‘আলী ও ‘আব্বাস (রাঃ)-এর দিকে ফিরে বললেন, আপনাদের দু’জনকে আল্লাহর কসম দিয়ে জিজ্ঞেস করছি, আপনারা কি জানেন যে, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এ কথা বলেছিলেন? তাঁরা দু’জনেই আল্লাহর কসম দিয়ে বললেন, হ্যাঁ। ‘উমার (রাঃ) বললেন, আমি আপনাদেরকে জানিয়ে দিচ্ছি যে, আল্লাহ্ এ সম্পদের একাংশ তাঁর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম’র নির্ধারিত করে দিয়েছিলেন, অপর কারো জন্য দেয়া হয়নি। এ ব্যাপারে আল্লাহ্ বলেনঃ আল্লাহ্ ইয়াহূদীদের নিকট হতে তাঁর রাসূলকে যে ফায় দিয়েছেন তার জন্য তোমরা ঘোড়া কিংবা উটে চড়ে যুদ্ধ করনি...(৫৯ঃ ৬)। কাজেই এ সম্পদ একমাত্র রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম’র জন্যই নির্দিষ্ট ছিল। তারপর আল্লাহর কসম! তিনি আপনাদেরকে বাদ দিয়ে এককভাবে নিজের জন্য তা সঞ্চিত করে রাখেননি, কিংবা এককভাবে আপনাদেরকেও দিয়ে দেননি। বরং তিনি আপনাদের সকলকেই তাত্থেকে দিয়েছেন এবং সকলের মাঝে বণ্টন করে দিয়েছেন। অবশেষে তাত্থেকে এ পরিমাণ সম্পদ অবশিষ্ট রয়েছে। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এ সম্পদ থেকে তাঁর পরিবারের জন্য তাদের বছরের খরচ দিতেন। এরপর যা অবশিষ্ট থাকত তা আল্লাহর মাল যে পথে ব্যয় হয় সে পথে খরচের জন্য রেখে দিতেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর জীবিত অবস্থায় এমন করতেন। আল্লাহর কসম দিয়ে জিজ্ঞেস করছি! আপনারা কি এ ব্যাপারে জ্ঞাত আছেন? সকলেই বললেন, হ্যাঁ। তারপর ‘আলী (রাঃ) ও ‘আব্বাস (রাঃ)-কে লক্ষ্য করে বললেন, আল্লাহর কসম দিয়ে আপনাদের দু’জনকে জিজ্ঞেস করছি! আপনারা কি এ ব্যাপারে জ্ঞাত আছেন? তারা দু’জনেই বললেন, হ্যাঁ। এরপর আল্লাহ্ তা‘আলা তাঁর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে মৃত্যু দিলেন। তখন আবূ বকর (রাঃ) বললেন, আমি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর স্থলাভিষিক্ত। কাজেই তিনি সে সম্পদ অধিগ্রহণ করলেন এবং রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যে খাতে এ সম্পদ ব্যয় করতেন তিনিও ঠিক সেভাবেই ব্যয় করতেন। আপনারা তখন ছিলেন। তারপর ‘আলী (রাঃ) ও ‘আব্বাস (রাঃ)এর দিকে ফিরে বললেন, আপনারা দু’জন তখনও মনে করতেন যে আবূ বকর (রাঃ) এ ব্যাপারে এরূপ ছিলেন। আল্লাহ্ জানেন তিনি এ ব্যাপারে সত্যবাদী, ন্যায়পরায়ণ, সত্যনিষ্ঠ ও হক্কের অনুসারী ছিলেন। তারপর আল্লাহ্ আবূ বকর (রাঃ)-কেও মৃত্যু দিলেন। তখন আমি বললাম, এখন আমি আবূ বকর ও রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর স্থলাভিষিক্ত। সুতরাং দু’বছর আমি তা আমার তত্ত্বাবধানে রাখলাম এবং আবূ বকর (রাঃ) ও রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তা যে খাতে খরচ করতেন, আমিও তেমনি করতে লাগলাম। তারপর আপনারা দু’জন আমার কাছে এলেন। আপনাদের দু’জনের একই কথা ছিল, দাবিও ছিল একই। আপনি এসেছিলেন নিজের ভাতিজার থেকে নিজের অংশ আদায় করে নেয়ার দাবি নিয়ে, আর ইনি (‘আলী) এসেছিলেন তাঁর স্ত্রীর পৈতৃক সূত্রে প্রাপ্ত অংশ আদায় করে নেয়ার দাবি নিয়ে। আমি বললাম, যদি আপনারা চান তাহলে আমি আপনাদেরকে তা দিয়ে দিতে পারি, তবে শর্ত এই যে, আপনারা আল্লাহর নামে এই ওয়াদা ও প্রতিশ্রুতিতে আবদ্ধ হবেন যে, এ সম্পদ রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও আবূ বকর (রাঃ) যে ভাবে খরচ করতেন এবং আমি এর দায়িত্ব নেয়ার পর যেভাবে তা খরচ করেছি, আপনারাও তেমনিভাবে ব্যয় করবেন। তখন আপনারা দু’জনে বলেছিলেন, এ শর্তেই আপনি তা আমাদের হাতে দিয়ে দিন। ফলে আমি তা আপনাদের কাছে দিয়ে দিয়েছিলাম। আল্লাহর কসম দিয়ে আপনাদেরকে জিজ্ঞেস করছি! আমি কি সেই শর্তাধীনে এদের কাছে সে সম্পদ দিয়ে দেইনি? সকলেই বলল, হ্যাঁ। তখন তিনি ‘আলী (রাঃ) ও ‘আব্বাস (রাঃ)-এর দিকে তাকিয়ে বললেন, আল্লাহর কসম দিয়ে আপনাদের দু’জনকে জিজ্ঞেস করছি! আমি কি ঐ শর্তাধীনে আপনাদেরকে সে সম্পদ দিয়ে দেইনি? তাঁরা দু’জন বললেন, হ্যাঁ। তখন তিনি বললেন, আপনারা কি আমার নিকট হতে এর ভিন্ন কোন ফয়সালা পেতে চান? সে সত্তার কসম করে বলছি, যাঁর হুকুমে আকাশ ও যমীন নিজ স্থানে বিরাজমান, কিয়ামতের পূর্বে আমি এ বিষয়ে নতুন কোন ফয়সালা করব না। যদি আপনারা এর তত্ত্বাবধানে অক্ষম হন, তা হলেতা আমার নিকট সোপর্দ করুন। আপনাদের দু’জনের বদলে আমি একাই এর তত্ত্বাবধানের জন্য যথেষ্ট। [২৯০৪] (আধুনিক প্রকাশনী- ৬৭৯৫, ইসলামিক ফাউন্ডেশন- ৬৮০৭)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 7306,
			"arabicnumber": 7306,
			"text": "‘আসিম (রহ.) হতে বর্ণিত। তিনি বলেন, আমি আনাস (রাঃ)-কে জিজ্ঞেস করলাম যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কি মাদ্বীনাহ্কে হারাম (পবিত্র এলাকা) হিসাবে ঘোষণা করেছিলেন। উত্তরে তিনি বললেন, হ্যাঁ, অমুক জায়গা থেকে অমুক জায়গা পর্যন্ত। এখানকার কোন গাছ কাটা যাবে না, আর যে ব্যক্তি এখানে বিদ্আত করবে তার উপর আল্লাহ্, ফেরেশ্তা ও সকল মানুষের অভিশাপ। আসিম বলেন, আমাকে মূসা ইবনু আনাস বলেছেন, বর্ণনাকারী কিংবা বিদ্আতীকে আশ্রয় দেয় বলেছেন। [১৮৬৭] (আধুনিক প্রকাশনী- ৬৭৯৬, ইসলামিক ফাউন্ডেশন- ৬৮০৮)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 7307,
			"arabicnumber": 7307,
			"text": "(وَلاَ تَقْفُ) لاَ تَقُلْ (مَا لَيْسَ لَكَ بِهِ عِلْمٌ). আর আল্লাহর বাণীঃ যে বিষয়ে তোমার কোন জ্ঞান নেই, তার অনুসরণ করো না.....। (সূরাহ বানী ইসরা ১৭/৩৬) ৭৩০৭. ‘উরওয়াহ (রহ.) হতে বর্ণিত। তিনি বলেন, ‘আবদুল্লাহ্ ইবনু ‘আমর (রাঃ) আমাদের এ দিক দিয়ে হাজ্জে যাচ্ছিলেন। আমি শুনতে পেলাম, তিনি বলেছেন যে, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি, আল্লাহ্ তোমাদেরকে যে ইল্ম দান করেছেন, তা হঠাৎ ছিনিয়ে নেবেন না বরং উলামাগণকে তাদের ইলমসহ ক্রমশ তুলে নেয়ার মাধ্যমে তা ছিনিয়ে নেবেন। তখন কেবল মূর্খ লোকেরা অবশিষ্ট থাকবে। তাদের কাছে ফাত্ওয়া চাওয়া হবে। তারা মনগড়া ফাত্ওয়া দেবে। ফলে নিজেরাও পথভ্রষ্ট হবে, অন্যদেরকেও পথভ্রষ্ট করবে। ‘উরওয়াহ (রাঃ) বলেন, আমি এ হাদীসটি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর স্ত্রী ‘আয়িশাহ (রাঃ)-কে বললাম। তারপর ‘আবদুল্লাহ্ ইবনু আমর (রাঃ) আবার হাজ্জ করতে এলেন। তখন ‘আয়িশাহ (রাঃ) আমাকে বললেন, হে ভাগ্নে! তুমি ‘আবদুল্লাহর কাছে যাও এবং তার থেকে যে হাদীসটি তুমি আমাকে বর্ণনা করেছিলেন, তা তাঁর নিকট থেকে যাচাই করে আস। আমি তাঁর নিকট গেলাম এবং জিজ্ঞেস করলাম। তিনি আমাকে ঠিক সে রকমই বর্ণনা করলেন, যেরকম আগে বর্ণনা করেছিলেন। আমি ‘আয়িশাহ (রাঃ)-’র কাছে ফিরে এসে তাকে জানালাম। তিনি আশ্চর্য হয়ে গেলেন এবং বললেন, আল্লাহর কসম! ‘আবদুল্লাহ্ ইবনু আমর (রাঃ) মনে রেখেছে। [১০০০] (আধুনিক প্রকাশনী- ৬৭৯৭, ইসলামিক ফাউন্ডেশন- ৬৮০৯)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 7308,
			"arabicnumber": 7308,
			"text": "আমাস (রহ.) বলেন। আমি আবূ ওয়ায়িলকে জিজ্ঞেস করলাম, আপনি কি সিফফীনের যুদ্ধে যোগদান করেছিলেন? তিনি বললেন, হ্যাঁ। মূসা ইবনু ইসমা‘ঈল ..... সাহল ইবনু হুনায়ফ (রাঃ) বলেন, হে লোকেরা! দ্বীনের ব্যাপারে তোমাদের নিজস্ব মতামতকে গ্রহণযোগ্য মনে করো না। কেননা আবূ জান্দাল দিবসে (হুদাইবিয়াহর দিন) আমি ভেবেছিলাম, যদি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সিদ্ধান্তকে প্রত্যাখ্যান করতে পারতাম, তাহলে অবশ্যই আমি তা প্রত্যাখ্যান করতাম। যে কোন ভয়াবহ অবস্থার জন্য আমরা যখনই তলোয়ার কাঁধে নিয়েছি, তখনই তলোয়ার আমাদের কাঙ্ক্ষিত লক্ষ্যের পথ সহজ করে দিয়েছে। বর্তমান বিষয়টি আলাদা। রাবী বলেন, আবূ ওয়ায়িল (রাঃ) বলেছেন, আমি সিফফীনের যুদ্ধে শরীক ছিলাম; কতই না মন্দ ছিল সিফফীনের লড়াই! [৩১৮১] (আধুনিক প্রকাশনী- ৬৭৯৮, ইসলামিক ফাউন্ডেশন- ৬৮১০)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 7309,
			"arabicnumber": 7309,
			"text": "وَقَالَ ابْنُ مَسْعُودٍ سُئِلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ الرُّوحِ فَسَكَتَ حَتَّى نَزَلَتِ الآيَةُ ইবনু মাস‘ঊদ (রাঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে রূহ্ সম্পর্কে প্রশ্ন করা হলে ওয়াহী নাযিল হওয়া অবধি তিনি চুপ ছিলেন। ৭৩০৯. জাবির ইবনু ‘আবদুল্লাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি অসুস্থ ছিলাম। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও আবূ বকর (রাঃ) আমার নিকট আসলেন। তাঁরা দু’জনেই হেঁটে এসেছিলেন। তাঁরা যখন আমার কাছে আসলেন, তখন আমি বেহুঁশ ছিলাম। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উযূ করলেন এবং উযূর পানি আমার উপরে ঢেলে দিলেন। তাতে আমি জ্ঞান ফিরে পেলাম। তখন আমি বললাম, হে আল্লাহর রাসূল! বর্ণনাকারী সুফ্ইয়ান কোন কোন সময় বলতেন হে আল্লাহর রাসূল- আমার সম্পদের বিষয়ে কী সিদ্ধান্ত নেব? আমার সম্পদগুলো কী করব? (বর্ণনাকারী সাহাবী বলেন) তিনি আমাকে কোন জবাব দিলেন না, অবশেষে মীরাসের আয়াত অবতীর্ণ হল। [১৯৪] (আধুনিক প্রকাশনী- ৬৭৯৯, ইসলামিক ফাউন্ডেশন- ৬৮১১)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 7310,
			"arabicnumber": 7310,
			"text": "আবূ সা‘ঈদ (রাঃ) হতে বর্ণিত। তিনি বলেন, এক মহিলা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে এসে বলল, হে আল্লাহর রাসূল! আপনার হাদীস তো কেবল পুরুষেরা শুনতে পায়। সুতরাং আপনার পক্ষ থেকে আমাদের জন্য একটি দিন নির্দিষ্ট করে দিন, যে দিন আমরা আপনার কাছে আসব, আল্লাহ্ আপনাকে যা কিছু শিখিয়েছেন তাত্থেকে আপনি আমাদের শিখাবেন। তিনি বললেনঃ তোমরা অমুক অমুক দিন অমুক অমুক জায়গায় একত্রিত হবে। সে মোতাবেক তারা একত্রিত হলেন এবং নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের কাছে এলেন এবং আল্লাহ্ তাঁকে যা কিছু শিখিয়েছেন তা থেকে তাদের শিক্ষা দিলেন। এবং বললেনঃ তোমাদের কেউ যদি সন্তানদের থেকে তিনটি সন্তান আগে পাঠিয়ে দেয় (মৃত্যুবরণ করে) তাহলে এ সন্তানরা তার জন্য জাহান্নাম থেকে পর্দা যাবে। তাদের মাঝ থেকে একজন মহিলা জিজ্ঞেস করল, হে আল্লাহর রাসূল! যদি দু’জন হয়? বর্ণনাকারী বলেন, মহিলা কথাটি দু’ দু’বার জিজ্ঞেস করলেন। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ দু’জন হলেও, দু’জন হলেও, দু’জন হলেও। [মুসলিম ৪৫/৪৭, হাঃ ২৬৩৩, আহমাদ ১১২৯৬] (আধুনিক প্রকাশনী- ৬৮০০, ইসলামিক ফাউন্ডেশন- ৬৮১২)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 7311,
			"arabicnumber": 7311,
			"text": "মুগীরাহ ইবনু শু‘বাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ক্বিয়ামাত (কিয়ামত) আসা পর্যন্ত আমার উম্মাতের এক দল সর্বদাই বিজয়ী থাকবে। আর তাঁরা হলেন বিজয়ী। [৩৬৪০] (আধুনিক প্রকাশনী- ৬৮০১, ইসলামিক ফাউন্ডেশন- ৬৮১৩)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 7312,
			"arabicnumber": 7312,
			"text": "মু‘আবিযা ইবনু আবূ সুফয়ান (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি যে, আল্লাহ্ যার কল্যাণ চান, তাকে দ্বীনের জ্ঞান দান করেন। আমি (ইল্মের) বণ্টনকারী মাত্র; আল্লাহ্ তা দান করে থাকেন। এ উম্মাতের কার্যকলাপ ক্বিয়ামাত (কিয়ামত) অবধি কিংবা বলেছিলেন, মহান আল্লাহ্ তা‘আলার হুকুম আসা পর্যন্ত (সত্যের উপর) সুপ্রতিষ্ঠিত থাকবে। [৭১] (আধুনিক প্রকাশনী- ৬৮০২, ইসলামিক ফাউন্ডেশন- ৬৮১৪)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 7313,
			"arabicnumber": 7313,
			"text": "জাবির ইবনু ‘আবদুল্লাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, যখন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর উপর এ আয়াতঃ বল, তিনি সক্ষম তোমাদের ঊর্ধ্বদেশ থেকে শাস্তি প্রেরণ করতে.....অবতীর্ণ হল, তখন তিনি বললেনঃ (হে আল্লাহ্!) আমি আপনার কাছে (এমন আযাব থেকে) আশ্রয় প্রার্থনা করি (তারপর যখন অবতীর্ণ হল) অথবা তোমাদের পায়ের নিচে থেকে। তখনও তিনি বললেনঃ (হে আল্লাহ্!) আমি আপনার নিকট (এমন আযাব থেকে) আশ্রয় প্রার্থনা করি। এরপর যখন নাযিল হলঃ অথবা তোমাদেরকে দলে দলে ভাগ করতে এবং একদলকে অপর দলের সংঘর্ষের স্বাদ আস্বাদন করাতে তখন তিনি বললেনঃ এ দুটি অপেক্ষাকৃত নরম অথবা বলেছেনঃ অপেক্ষাকৃত সহজ।[1] [৪৬২৮] (আধুনিক প্রকাশনী- ৬৮০৩, ইসলামিক ফাউন্ডেশন- ৬৮১৫)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 7314,
			"arabicnumber": 7314,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত যে, এক বেদুঈন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট এসে বলল, আমার স্ত্রী একটি কালো সন্তান জন্ম দিয়েছে। আর আমি তাকে (আমার সন্তান হিসাবে) অস্বীকার করছি। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমার কি উট আছে? সে বলল, হ্যাঁ আছে। তিনি জিজ্ঞেস করলেন,সেগুলোর কী রঙ? সে বলল, লাল। তিনি জিজ্ঞেস করলেন, সেগুলোর মাঝে সাদা কালো মিশ্রিত রঙের কোন উট আছে কি? সে বলল, হ্যাঁ, সাদা কালো মোশানো রঙের অনেকগুলো আছে। তিনি জিজ্ঞেস করলেন এ রং কিভাবে এল বলে তুমি মনে কর? সে বলল, হে আল্লাহর রাসূল! বংশ সূত্রের প্রভাবে এমন হয়েছে। তিনি বললেনঃ সম্ভবত তোমার সন্তানও বংশ সূত্রের প্রভাবে (পূর্বপুরুষের কেউ কালো ছিল বলে) এমন হয়েছে। এবং তিনি এ সন্তানটিকে অস্বীকার করার অনুমতি লোকটিকে দিলেন না। [৫৩০৫] (আধুনিক প্রকাশনী- ৬৮০৪, ইসলামিক ফাউন্ডেশন- ৬৮১৬)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 7315,
			"arabicnumber": 7315,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত যে, এক মহিলা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট এসে বলল, আমার মা হাজ্জ করার মানৎ করেছিলেন। এরপর তিনি হাজ্জ করার আগেই মারা গেছেন। এখন আমি কি তার পক্ষ থেকে হাজ্জ করব? উত্তরে তিনি বললেন, হ্যাঁ, তার পক্ষ থেকে হাজ্জ কর। মনে কর যদি তার উপর ঋণ থাকত তাহলে কি তুমি তা আদায় করতে? সে বলল, অবশ্যই। তিনি বললেনঃ কাজেই তার উপর যে মানত আছে তা তুমি আদায় কর। আল্লাহ্ অধিক হক্দার, যে তাঁর জন্য কৃত মানত মানুষেরা পূর্ণ করবে। [১৮৫২] (আধুনিক প্রকাশনী- ৬৮০৫, ইসলামিক ফাউন্ডেশন- ৬৮১৭)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 7316,
			"arabicnumber": 7316,
			"text": "وَمَدَحَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ صَاحِبَ الْحِكْمَةِ حِينَ يَقْضِي بِهَا وَيُعَلِّمُهَا لاَ يَتَكَلَّفُ مِنْ قِبَلِهِ وَمُشَاوَرَةِ الْخُلَفَاءِ وَسُؤَالِهِمْ أَهْلَ الْعِلْمِ যারা হিকমাতের সঙ্গে বিচার করে ও হিকমাতের শিক্ষা দেন এবং মনগড়া কোন ফায়সালা করেন না, (এমন হিকমাতওয়ালা লোকের) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম প্রশংসা করেছেন। খলীফাদের সঙ্গে পরামর্শ করা এবং বিচারকদের আলেমদের নিকট জিজ্ঞেস করা। ৭৩১৬. ‘আবদুল্লাহ্ ইবনু মাস‘ঊদ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ দু’রকম লোক ব্যতীত কারো উপর হিংসা করা যাবে না। (এক) যাকে আল্লাহ্ সম্পদ দিয়েছেন এবং হকপথে খরচ করার ক্ষমতা দান করেছেন। (দুই) যাকে আল্লাহ্ হিক্মাত (দ্বীনের বিষয়ে তীক্ষ্ম বুদ্ধি) দান করেছেন, আর সে এর আলোকে বিচার করে এবং তা অন্যকে শিখায়। [৭৩] (আধুনিক প্রকাশনী- ৬৮০৬, ইসলামিক ফাউন্ডেশন- ৬৮১৮)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 7318,
			"arabicnumber": 7318,
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 7319,
			"arabicnumber": 7319,
			"text": "আবূ হুরাইরাহ (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণনা করেন যে, তিনি বলেছেনঃ ক্বিয়ামাত (কিয়ামত) ক্বায়িম হবে না যে পর্যন্ত না আমার উম্মাত পূর্বযুগের লোকেদের নীতি পদ্ধতিকে আচার-অভ্যাসকে বিঘতে বিঘতে, হাতে হাতে গ্রহণ না করবে। বলা হল, হে আল্লাহর রাসূল! পারসিক ও রোমকদের মত কি? তিনি বললেনঃ এরা ছাড়া মানুষের মধ্যে অন্য আর কারা? (আধুনিক প্রকাশনী- ৬৮০৮, ইসলামিক ফাউন্ডেশন- ৬৮২০)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 7320,
			"arabicnumber": 7320,
			"text": "আবূ সা‘ঈদ খুদরী (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণনা করেন। তিনি বলেছেনঃ অবশ্য অবশ্যই তোমরা তোমাদের আগের লোকেদের নীতি-পদ্ধতিকে বিঘতে বিঘতে, হাতে হাতে অনুকরণ করবে। এমনকি তারা যদি দবের গর্তে ঢুকে, তাহলে তোমরাও তাদের অনুকরণ করবে। আমরা বললাম, হে আল্লাহর রাসূল! এরা কি ইয়াহূদী ও নাসারা? তিনি বললেনঃ আর কারা?[1] [৩৪৫৬; মুসলিম ৪৭/৩, হাঃ ২৬৬৯, আহমাদ ১১৮০০] (আধুনিক প্রকাশনী- ৬৮০৯, ইসলামিক ফাউন্ডেশন- ৬৮২১)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 7321,
			"arabicnumber": 7321,
			"text": "‘আবদুল্লাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে কোন ব্যক্তিকেই অন্যায়ভাবে কতল করা হয়, তার পাপের ভাগ আদম (আঃ)-এর প্রথম (হত্যাকারী) পুত্রের উপরও পড়বে। রাবী সুফ্ইয়ান مِنْ دَمِهَا তার রক্তপাত করার অপরাধ তার উপরেও পড়বে উল্লেখ করেছেন। কারণ সেই প্রথমে হত্যার রীতি চালু করে।[1] [৩৩৩৫] (আধুনিক প্রকাশনী- ৬৮১০, ইসলামিক ফাউন্ডেশন- ৬৮২২)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 7322,
			"arabicnumber": 7322,
			"text": "জাবির ইবনু ‘আবদুল্লাহ্ সালাম (রাঃ) হতে বর্ণিত যে, এক বেদুঈন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট ইসলামের উপর বায়‘আত নিল। এরপর সে মাদ্বীনাহয় জ্বরে আক্রান্ত হল। বেদুঈন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট উপস্থিত হয়ে বলল, হে আল্লাহর রাসূল! আমার বায়‘আত ফিরিয়ে দিন। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অস্বীকৃতি জানালেন। আবার সে এসে বলল, আমার বায়‘আত ফিরিয়ে দিন। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অস্বীকৃতি জানালেন। এরপর সে আবার এসে বলল, আমার বায়‘আত ফিরিয়ে দিন। এবারও নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অস্বীকৃতি জানালেন, বেদুঈন বেরিয়ে গেল। তখন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ মাদ্বীনাহ হাপরের মত। সে তার মধ্যেকার ময়লাকে দূর করে দেয় এবং ভালটুকু ধরে রাখে। [১৮৮৩] (আধুনিক প্রকাশনী- ৬৮১১, ইসলামিক ফাউন্ডেশন- ৬৮২৩)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 7323,
			"arabicnumber": 7323,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি ‘আবদুর রহমান ইবনু ‘আওফ (রাঃ)-কে কুরআন পড়াতাম। ‘উমার (রাঃ) যখন তার শেষ হাজ্জ পালন করতে আসলেন, তখন ‘আবদুর রহমান (রাঃ) মিনায় আমাকে বললেন, তুমি আজ আমীরুল মু’মিনীনের কাছে থাকলে দেখতে পেতে যে, তাঁর কাছে এক লোক এসে বলল, এক লোক বলেছে, যদি আমীরুল মু’মিনীন মারা যেতেন, তাহলে আমরা অমুক লোকের হাতে বায়‘আত নিতে পারতাম। ‘উমার (রাঃ) বললেন, আজ বিকেলে অবশ্য অবশ্যই দাঁড়িয়ে আমি তাদেরকে সতর্ক করব, যারা মুসলিমদের হক ছিনিয়ে নিতে চায়। আমি বললাম, আপনি এমনটি করবেন না। কেননা, এখন হাজ্জের মৌসুম। এখন সাধারণ মানুষের সমবেত হওয়ার সময়। তারা আপনার মজলিসকে কাবু করে ফেলবে। আমার ভয় হচ্ছে যে, তারা আপনার বক্তব্য সঠিকভাবে বুঝতে পারবে না। হের-ফের করে চারদিকে রটিয়ে দেবে। বরং আপনি হিজরত ও সুন্নাতের আবাসভূমি মাদ্বীনাহয় পৌঁছা পর্যন্ত অপেক্ষা করুন। এরপর একমাত্র রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর মুহাজির ও আনসার সহাবাদের নিকট আপনার বক্তব্য তুলে ধরুন। তাঁরা আপনার বক্তব্য হেফাযত করবে এবং তার উপযুক্ত মর্যাদা দিবে। ‘উমার (রাঃ) বললেন, আল্লাহর কসম! আমি মাদ্বীনাহয় পৌঁছলে অবশ্য অবশ্যই সবচেয়ে আগে এটি করব। ইবনু ‘আব্বাস (রাঃ) বলেন, আমরা মাদ্বীনাহয় পৌঁছলাম। তখন ‘উমার (রাঃ) ভাষণ দিলেন, আল্লাহ্ মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে সত্য বাণী দিয়ে পাঠিয়েছেন, তাঁর উপর কিতাব নাযিল করেছেন। তাতে ‘রজ্ম’-এর আয়াতও রয়েছে।[1] [২৪৬২] (আধুনিক প্রকাশনী- ৬৮১২, ইসলামিক ফাউন্ডেশন- ৬৮২৪)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 7324,
			"arabicnumber": 7324,
			"text": "মুহাম্মাদ ইবনু সীরীন (রহ.) হতে বর্ণিত। তিনি বলেন, আমরা আবূ হুরাইরাহ (রাঃ)-এর নিকটে ছিলাম। তিনি লাল রঙের দু’টো কাতান পরে ছিলেন। এরপর তিনি নাক পরিষ্কার করলেন এবং বললেন, বাহঃ! বাহঃ! আবূ হুরাইরাহ আজ কাতান দিয়ে নাক পরিষ্কার করছে। অথচ আমার অবস্থা এমনও ছিল যে, আমি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর মিম্বর ও ‘আয়িশাহ (রাঃ)-এর হুজ্রার মধ্যবর্তী স্থানে বেহুঁশ হয়ে পড়ে থাকতাম। আগমনকারী আসত, তার নিজ পা আমার গর্দানে রাখত, মনে হতো আমি যেন পাগল। অথচ আমার তিলমাত্র পাগলামি ছিল না। আমার ছিল একমাত্র ক্ষুধার যন্ত্রণা। (আধুনিক প্রকাশনী- ৬৮১৩, ইসলামিক ফাউন্ডেশন- ৬৮২৫)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 7325,
			"arabicnumber": 7325,
			"text": "‘আবদুর রহমান ইবনু আবিস (রহ.) হতে বর্ণিত। ‘আবদুল্লাহ্ ইবনু ‘আব্বাস (রাঃ)-কে জিজ্ঞেস করা হয়েছিল, আপনি কি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে কোন ঈদে উপস্থিত ছিলেন? তিনি বললেন, হ্যাঁ। যদি তাঁর কাছে আমার বিশেষ একটা মর্যাদা না থাকত তবে এত অল্প বয়সে তাঁর কাছে যাওয়ার সুযোগ পেতাম না। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কাসীর ইবনু সালাতের বাড়ির নিকটের পতাকার নিকট আসলেন। এরপর ঈদের সালাত পড়লেন। তারপর খুৎবা দিলেন। রাবী আযান এবং ইকামত-এর উল্লেখ করেননি। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম লোকেদেরকে সদাকাহ প্রদানের নির্দেশ দিলেন। নারীরা তাদের কান ও গলার (অলঙ্কারের) দিকে ইশারা করলে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বিলাল (রাঃ)-কে (তাদের কাছে যাবার) হুকুম করলেন। বিলাল (রাঃ) (অলঙ্কারাদি নিয়ে) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম’র কাছে ফিরে আসলেন। [৯৮] (আধুনিক প্রকাশনী- ৬৮১৪, ইসলামিক ফাউন্ডেশন- ৬৮২৬)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 7326,
			"arabicnumber": 7326,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কুবার মসজিদে কখনো পায়ে হেঁটে আবার কখনো, সওয়ার হয়েও আসতেন। [১১৯১] (আধুনিক প্রকাশনী- ৬৮১৫, ইসলামিক ফাউন্ডেশন- ৬৮২৭)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 7328,
			"arabicnumber": 7328,
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 7329,
			"arabicnumber": 7329,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ‘আসরের সালাত পড়তেন। তারপর আমরা ‘আওয়ালী’ (মাদ্বীনাহর নিকট উঁচু টিলার স্থান) যেতাম। তখনও সূর্য উপরে থাকত। বর্ণনাকারী লায়স (রহ.) ইউনুস (রহ.) হতে আরো বর্ণনা করেছেন যে, ‘আওয়ালী’র দূরত্ব চার অথবা তিন মাইল [৫৪৮] (আধুনিক প্রকাশনী- ৬৮১৭, ইসলামিক ফাউন্ডেশন- ৬৮২৯)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 7330,
			"arabicnumber": 7330,
			"text": "সায়িব ইবনু ইয়াযীদ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর যুগের সা‘ তোমাদের এ সময়ের এক মুদ ও এক মুদের এক-তৃতীয়াংশের মাপের ছিল। অবশ্য (পরবর্তী সময়ে) তা বৃদ্ধি পেয়েছে। (হাদীসটি) কাসিম ইবনু মালিক (রহ.) যুআয়দ (রহ.) থেকে শুনেছেন। [১৮৫৯] (আধুনিক প্রকাশনী- ৬৮১৮, ইসলামিক ফাউন্ডেশন- ৬৮৩০)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 7331,
			"arabicnumber": 7331,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত যে, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এই বলে দু‘আ করেছেনঃ হে আল্লাহ্! তাদের পরিমাপে বরকত দান করুন, তাদের সা‘-এ বরকত দিন এবং তাদের মুদে- অর্থাৎ মাদ্বীনাবাসীদের। [২১৩০] (আধুনিক প্রকাশনী- ৬৮১৯, ইসলামিক ফাউন্ডেশন- ৬৮৩১)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 7332,
			"arabicnumber": 7332,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত যে, ইয়াহূদীগণ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট এক ব্যভিচারী পুরুষ এবং এক ব্যভিচারিণী নারীকে নিয়ে আসল। তখন তিনি তাদের দু’জনকে শাস্তি দেয়ার নির্দেশ দিলে মসজিদে নাবাবীর নিকট জানাযা রাখার স্থানে তাদেরকে পাথর নিক্ষেপে মারা হয়। [১৩২৯] (আধুনিক প্রকাশনী- ৬৮২০, ইসলামিক ফাউন্ডেশন- ৬৮৩২)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 7333,
			"arabicnumber": 7333,
			"text": "আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত যে, একদা উহুদ পাহাড় নজরে পড়লে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ এ পর্বত আমাদেরকে ভালবাসে আর আমরাও একে ভালবাসি। হে আল্লাহ্! ইব্রাহীম (আঃ) মক্কাকে হারাম ঘোষণা করেছেন, আর আমি এ মাদ্বীনাহর দু’টি কঙ্করময় প্রান্তের মাঝের স্থানকে হারাম ঘোষণা করছি। উহুদ সংক্রান্ত নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে এ হাদীস বর্ণনায় সাহল (রাবী) আনাস (রাঃ)-এর অনুসরণ করেছেন। (আধুনিক প্রকাশনী- ৬৮২১, ইসলামিক ফাউন্ডেশন- ৬৮৩৩)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 7334,
			"arabicnumber": 7334,
			"text": "সাহল (রাঃ) হতে বর্ণিত যে, মসজিদে নববীর কিবলার দিকের দেয়াল ও মিম্বরের মাঝে মাত্র একটা বকরী যাতায়াতের জায়গা ছিল। [৪৯৬] (আধুনিক প্রকাশনী- ৬৮২২, ইসলামিক ফাউন্ডেশন- ৬৮৩৪)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 7335,
			"arabicnumber": 7335,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমার ঘর ও আমার মিম্বরের মাঝের জায়গা জান্নাতের বাগানগুলোর একটি বাগান। আর আমার মিম্বর আমার হাওযের উপর। [১১৯৬] (আধুনিক প্রকাশনী- ৬৮২৩, ইসলামিক ফাউন্ডেশন- ৬৮৩৫)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 7336,
			"arabicnumber": 7336,
			"text": "‘আবদুল্লাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঘোড়দৌড়ের প্রতিযোগিতা করিয়েছিলেন। ক্ষিপ্র গতির জন্য প্রশিক্ষণপ্রাপ্ত ঘোড়াগুলোর প্রতিযোগিতার স্থান ছিল হাফয়া হতে সানীয়্যাতুল বিদ্যা পর্যন্ত। আর প্রশিক্ষণবিহীনগুলোর স্থান ছিল সানীয়্যাতুল বিদা হতে বানী যুরায়ক-এর মাসজিদ পর্যন্ত। ‘আবদুল্লাহ্ও প্রতিযোগীদের মধ্যে ছিলেন। [৪২০] (আধুনিক প্রকাশনী- ৬৮২৪, ইসলামিক ফাউন্ডেশন- ৬৮৩৬)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 7337,
			"arabicnumber": 7337,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি ‘উমার (রাঃ)-কে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর মিম্বরে (খুৎবাহ দিতে) শুনেছি। [৪৬১৯] (আধুনিক প্রকাশনী- ৬৮২৫, ইসলামিক ফাউন্ডেশন- র৩৭)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 7338,
			"arabicnumber": 7338,
			"text": "সায়িব ইবনু ইয়াযীদ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি ‘উসমান ইবনু ‘আফফান (রাঃ)-কে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর মিম্বারে (খুত্বাহ দিতে) শুনেছি। (আধুনিক প্রকাশনী- ৬৮২৬, ইসলামিক ফাউন্ডেশন- ৬৮৩৮)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 7339,
			"arabicnumber": 7339,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমার এবং রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর গোসলের জন্য এ পাত্রটি রাখা হত। আমরা এক সাথে এর থেকে গোসল করতাম।[1] [২৫০] (আধুনিক প্রকাশনী- ৬৮২৭, ইসলামিক ফাউন্ডেশন- ৬৮৩৯)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 7341,
			"arabicnumber": 7341,
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 7342,
			"arabicnumber": 7342,
			"text": "আবূ বুরদাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি মাদ্বীনাহ্য় আসলে ‘আবদুল্লাহ্ ইবনু সালাম (রাঃ) আমার সঙ্গে দেখা করেন। তিনি আমাকে বললেন, চলুন ঘরে যাই। আমি আপনাকে একটি পাত্রে পান করাবো, যেটিতে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পান করেছেন। আপনি ঐ সালাতের জায়গায় সালাত পড়তে পারবেন, যেখানে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সালাত পড়েছিলেন। অতঃপর আমি তার সঙ্গে গেলাম। তিনি আমাকে ছাতু গুলে খাওয়ালেন এবং খেজুর খাওয়ালেন। তারপর আমি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সালাত পড়ার স্থানে সালাত পড়লাম। [৩৮১৪] (আধুনিক প্রকাশনী- ৬৮২৯, ইসলামিক ফাউন্ডেশন- ৬৮৪১)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 7343,
			"arabicnumber": 7343,
			"text": "‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে বলেছেনঃ আকীক নামক জায়গায় থাকার সময় এক রাতে আমার রবেবর নিকট হতে একজন আগন্তুক (ফেরেশ্তা) আমার কাছে এলেন। তিনি বলেন, এই বারাকাতময় উপত্যকায় সালাত পড়ুন এবং বলুন, ‘উমরাহ ও হাজ্জের নিয়ত করছি। হারূন ইবনু ইসমাঈল (রহ.) বলেন, ‘আলী (রাঃ) আমার কাছে হাজ্জের সঙ্গে ‘উমরার নিয়ত করুন’ শব্দ বর্ণনা করেছেন। [১৫৩৪] (আধুনিক প্রকাশনী- ৬৮৩০, ইসলামিক ফাউন্ডেশন- ৬৮৪২)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 7344,
			"arabicnumber": 7344,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মীকাত নির্ধারণ করেছেন নাজদবাসীদের জন্য কারনকে, সিরিয়াবাসীদের জন্য জুহ্ফাকে এবং মাদ্বীনাবাসীদের জন্য যুল হুলায়ফাকে। ইবনু ‘উমার (রাঃ) বলেন, আমি এগুলো নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে শুনেছি। আমার কাছে খবর পৌঁছেছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ইয়ামানের লোকেদের মীকাত হচ্ছে ইয়া‘লামলাম এবং ইরাকের কথা উল্লেখ করা হল। তখন ইবনু ‘উমার (রাঃ) বললেন, সে সময় ইরাক ছিল না। (আধুনিক প্রকাশনী- ৬৮৩১, ইসলামিক ফাউন্ডেশন- ৬৮৪৩)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 7345,
			"arabicnumber": 7345,
			"text": "‘আবদুল্লাহ্ ইবনু ‘উমার (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত যে, তিনি যুলহুলায়ফাতে রাতের শেষ ভাগে অবস্থানকালে তাকে বলা হলো আপনি একটি বরকতপূর্ণ জায়গায় আছেন। [৪৮৩] (আধুনিক প্রকাশনী- ৬৮৩২, ইসলামিক ফাউন্ডেশন- ৬৮৪৪)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 7346,
			"arabicnumber": 7346,
			"text": "ইবনু ‘উমার (রাঃ) হতে বর্ণিত যে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে ফজরের সালাতের শেষে রুকু‘ থেকে মাথা উঠানোর সময় বলতে শুনেছেন, হে আমাদের প্রতিপালক! সমস্ত প্রশংসা কেবলমাত্র আপনারই জন্য। তিনি আরো বললেন, হে আল্লাহ্! আপনি অমুক অমুক লোকের উপর অভিশাপ দিন। তখন আল্লাহ্ নাযিল করলেনঃ ‘‘আল্লাহ তাদের প্রতি ক্ষমাশীল হবেন অথবা তাদেরকে শাস্তি প্রদান করবেন- এ ব্যাপারে তোমার কিছু করার নেই। কেননা তারা হচ্ছে যালিম’’- (সূরাহ আলে ‘ইমরান ৩/১২৮)। [৪০৬৯] (আধুনিক প্রকাশনী- ৬৮৩৩, ইসলামিক ফাউন্ডেশন- ৬৮৪৫)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 7347,
			"arabicnumber": 7347,
			"text": "‘আলী ইবনু আবূ তালিব (রাঃ) হতে বর্ণিত। তিনি বলেন, এক রাতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর এবং রাসূলের মেয়ে ফাতিমাহ (রাঃ)-এর নিকট আসলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদেরকে জিজ্ঞেস করলেন, তোমরা সালাত পড়েছ কি? ‘আলী (রাঃ) বলেন, আমি বললাম, হে আল্লাহর রাসূল! আমাদের জীবন তো আল্লাহর হাতে। তিনি আমাদেরকে যখন জাগাতে চান, জাগিয়ে দেন। এ কথা বলার সঙ্গে সঙ্গে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম চলে গেলেন, তার কথার জবাব দিলেন না। ‘আলী (রাঃ) বলেন, আমি শুনতে পেলাম, তিনি চলে যাচ্ছেন, আর ঊরুতে হাত মেরে মেরে বলছেনঃ মানুষ অধিকাংশ বিষয়েই বিতর্কপ্রিয়। আবূ ‘আবদুল্লাহ্ (বুখারী) (রহ.) বলেন, তোমার কাছে রাতের বেলা আগমনকারী আসে তাকে ‘তারিক’ বা রাতের অতিথি বলে। ‘তারিক’ একটি তারাকেও বলা হয়। আর ‘সাক্বিব’ অর্থ হল জ্যোতির্ময়। এজন্যই আগুন যে জ্বালায় তাকে বলা হয়, তুমি আগুন জ্বালাও।[1] [১১২৭] (আধুনিক প্রকাশনী- ৬৮৩৪, ইসলামিক ফাউন্ডেশন- ৬৮৪৬)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 7348,
			"arabicnumber": 7348,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, একবার আমরা মসজিদে নাবাবীতে ছিলাম। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মাসজিদ থেকে বের হয়ে আমাদেরকে বললেনঃ তোমরা চলো ইয়াহূদীদের সেখানে যাই। আমরা তাঁর সঙ্গে বেরোলাম। শেষে আমরা বায়তুল মিদরাসে (তাদের শিক্ষালয়ে) পৌঁছলাম। তারপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সেখানে দাঁড়িয়ে তাদেরকে উদ্দেশ্য করে বললেনঃ হে ইয়াহূদী সম্প্রদায়! তোমরা ইসলাম কবূল কর, এতে তোমরা নিরাপত্তা লাভ করবে। ইয়াহূদীরা বলল, হে আবূল কাসিম! আপনার পৌঁছানোর দায়িত্ব আপনি পালন করেছেন। অতঃপর তিনি বললেনঃ আমার ইচ্ছা তোমরা ইসলাম গ্রহণ কর এবং শান্তিতে থাক। তারাও আবার বলল, হে আবুল কাসিম! আপনার পৌঁছানোর দায়িত্ব আপনি পালন করেছেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আমি এরকমই ইচ্ছে পোষণ করি। তৃতীয়বারেও তিনি তাই বললেন। অবশেষে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ জেনে রেখো, যমীন একমাত্র আল্লাহ্ ও তাঁর রাসূলের। আমি তোমাদেরকে এই এলাকা থেকে নির্বাসিত করতে চাই। কাজেই তোমাদের যাদের মালপত্র আছে, তা যেন সে বিক্রি করে দেয়। তা নাহলে জেনে রেখো যমীন আল্লাহ্ ও তাঁর রাসূলের।[1] [৩১৬৭] (আধুনিক প্রকাশনী- ৬৮৩৫, ইসলামিক ফাউন্ডেশন- ৬৮৪৭)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 7349,
			"arabicnumber": 7349,
			"text": "নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জামা‘আতকে আঁকড়ে ধরে রাখার নির্দেশ দিয়েছেন। আর জামা‘আত আলিমগণকেই বলা হয়েছে। ৭৩৪৯. আবূ সা‘ঈদ খুদরী (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কিয়ামতের দিন নূহ্ (আঃ)-কে হাযির করে জিজ্ঞেস করা হবে, তুমি কি (দ্বীনের দা’ওয়াত) পৌঁছে দিয়েছ? তখন তিনি বলবেন, হ্যাঁ। হে আমার রব। এরপর তাঁর উম্মাতকে জিজ্ঞেস করা হবে, তোমাদের কাছে নূহ্ (দা’ওয়াত) পৌঁছিয়েছে কি? তারা সকলে বলে উঠবে, আমাদের কাছে কোন ভয় প্রদর্শনকারী আসেনি। তখন নূহ্ (আঃ)-কে বলা হবে, তোমার কোন সাক্ষী আছে কি? তিনি বলবেন, মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও তাঁর উম্মাতরাই (আমার সাক্ষী)। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তোমাদেরকে তখন নিয়ে আসা হবে এবং তোমরা (তাঁর পক্ষে) সাক্ষ্য দেবে। এরপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আল্লাহর বাণী পাঠ করলেনঃ এভাবে আল্লাহ্ তোমাদেরকে মধ্যমপন্থী উম্মাত বানিয়েছেন। ( অর্থ ভারসাম্যপূর্ণ) তাহলে তোমরা মানব জাতির জন্য সাক্ষী হতে পারবে আর রাসূল তোমাদের জন্য সাক্ষী হবেন- (সূরাহ আল-বাক্বারাহ ২/১৪৩)। জা‘ফর ইবনু ‘আওন (রহ.)....আবূ সা‘ঈদ খুদরী (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সূত্রে এরকমই বর্ণনা করেছেন। [৩৩৩৯] (আধুনিক প্রকাশনী- ৬৮৩৬, ইসলামিক ফাউন্ডেশন- ৬৮৪৮)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 7351,
			"arabicnumber": 7351,
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 7352,
			"arabicnumber": 7352,
			"text": "‘আমর ইবনু ‘আস (রাঃ) হতে বর্ণিত। তিনি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে এ কথা বলতে শুনেছেন, কোন বিচারক ইজ্তিহাদে সঠিক সিদ্ধান্তে পৌঁছলে তার জন্য আছে দু’টি পুরস্কার। আর বিচারক ইজ্তিহাদে ভুল করলে তার জন্যও রয়েছে একটি পুরস্কার।[1] রাবী বলেন, আমি হাদীসটি আবূ বকর ইবনু মুহাম্মাদ ইবনু ‘আমর ইবনু হাযিম (রহ.)-এর নিকট বর্ণনা করলে তিনি বললেন, আবূ সালামাহ ইবনু ‘আবদুর রহমান আবূ হুরাইরাহ (রাঃ) থেকে এরকম বর্ণনা করেছেন। এবং ‘আবদুল ‘আযীয ইবনু ‘আবদুল মুত্তালিব.....আবূ সালামাহ (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে এরকমই বর্ণনা করেছেন। [মুসলিম ৩০/৬, হাঃ ১৭১৬] (আধুনিক প্রকাশনী- ৬৮৩৮, ইসলামিক ফাউন্ডেশন- ৬৮৫০)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 7353,
			"arabicnumber": 7353,
			"text": "‘উবায়দ ইবনু ‘উমায়র (রহ.) হতে বর্ণিত। তিনি বলেন, আবূ মূসা (রাঃ) ‘উমার (রাঃ)-এর কাছে আসার অনুমতি চাইলেন। আবূ মূসা (রাঃ) তাঁকে যেন কোন কাজে ব্যস্ত মনে করে ফিরে যাচ্ছিলেন। ‘উমার (রাঃ) বললেন, আমি কি ‘আবদুল্লাহ্ ইবনু কায়স-এর শব্দ শুনিনি? তাকে এখানে আসার অনুমতি দাও। এরপর তাঁকে ডেকে আনা হলে ‘উমার (রাঃ) জিজ্ঞেস করলেন, কী জিনিস আপনাকে ফিরে বাধ্য করল? আবূ মূসা (রাঃ) বললেন, আমাদেরকে এরকমই করার আদেশ দেয়া হত। ‘উমার (রাঃ) বললেন, আপনার কথার পক্ষে প্রমাণ পেশ দিন, অন্যথায় আপনার সঙ্গে মোকাবেলা করব। এরপর তিনি আনসারদের এক মজলিসে চলে গেলেন। তারা বলল, আমাদের বালকরাই এর পক্ষে সাক্ষ্য দেবে। এরপর আবূ সা‘ঈদ খুদরী (রাঃ) দাঁড়িয়ে বললেন, হ্যাঁ, আমাদেরকে এরকম করারই নির্দেশ দেয়া হত। এরপর ‘উমার (রাঃ) বললেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর এ আদেশটি আমার অজানা থেকে গেল। বাজারের ব্যস্ততাই আমাকে জানা থেকে বিরত রেখেছে। [২০৬২] (আধুনিক প্রকাশনী- ৬৮৩৯, ইসলামিক ফাউন্ডেশন- ৬৮৫১)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 7354,
			"arabicnumber": 7354,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, তোমাদের ধারণা আবূ হুরাইরাহ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে অতিরিক্ত হাদীস বর্ণনা করছে। আল্লাহর কাছে একদিন আমাদেরকে হাযির হতে হবে। আমি ছিলাম একজন মিসকীন। খেয়ে না খেয়েই আমি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট পড়ে থাকতাম। বাজারের বেচাকেনা মুহাজিরদেরকে ব্যস্ত রাখত। আর আনসারগণকে ব্যস্ত রাখত তাঁদের ধন-মালের প্রতিষ্ঠা। একদিন আমি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট ছিলাম। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আমার কথা শেষ হওয়া পর্যন্ত যে ব্যক্তি তার চাদর প্রসারিত করে তারপর তা গুটিয়ে নেবে, সে আমার নিকট হতে শোনা কিছুই কোন দিন ভুলবে না। তখন আমি আমার গায়ের চাদরখানা প্রসারিত করলাম। সে সত্তার শপথ, যিনি তাঁকে হক্কের সঙ্গে পাঠিয়েছেন! অতঃপর তাঁর কাছ থেকে শোনা কোন কিছুই আমি ভুলি নি।। [১১৮; মুসলিম ৪৪/৮৫, হাঃ ২৪৯২] (আধুনিক প্রকাশনী- ৬৮৪০, ইসলামিক ফাউন্ডেশন- ৬৮৫২)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 7355,
			"arabicnumber": 7355,
			"text": "মুহাম্মাদ ইবনু মুনকাদির (রহ.) হতে বর্ণিত। তিনি বলেন, আমি জাবির ইবনু ‘আবদুল্লাহ্ (রাঃ)-কে আল্লাহর কসম খেয়ে বলতে শুনেছি যে, ইবনু সাইয়্যাদ একটা দাজ্জাল। আমি তাঁকে জিজ্ঞেস করলামঃ আল্লাহর শপথ করে বলছেন? তিনি উত্তরে বললেন, আমি ‘উমার (রাঃ)-কে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট শপথ করে এ কথা বলতে শুনেছি। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এ কথা অস্বীকার করেননি। [মুসলিম ৫২/১৯, হাঃ ২৯৬৯] (আধুনিক প্রকাশনী- ৬৮৪১, ইসলামিক ফাউন্ডেশন- ৬৮৫৩)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 7356,
			"arabicnumber": 7356,
			"text": "وَقَدْ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَمْرَ الْخَيْلِ وَغَيْرِهَا ثُمَّ سُئِلَ عَنْ الْحُمُرِ فَدَلَّهُمْ عَلَى قَوْلِهِ تَعَالَى: (فَمَنْ يَعْمَلْ مِثْقَالَ أَخْبَرَ النَّبِيُّصَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَرَّةٍ خَيْرًا يَرَهُ) وَسُئِلَ النَّبِيُّ عَنْ الضَّبِّ فَقَالَ لاَ آكُلُهُ وَلاَ أُحَرِّمُهُ وَأُكِلَ عَلَى مَائِدَةِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ الضَّبُّ فَاسْتَدَلَّ ابْنُ عَبَّاسٍ بِأَنَّهُ لَيْسَ بِحَرَامٍ নবীসাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঘোড়া ইত্যাদির হুকুম বলে দিয়েছেন। এরপর তাঁকে গাধার হুকুম সম্পর্কে জিজ্ঞেস করা হলে তিনি আল্লাহর বাণীর দিকে ইঙ্গিত করেনঃ ‘‘কেউ অণু পরিমাণ সৎ কাজ করলেও তা দেখতে পাবে‘‘- (সূরাহ যিলযাল ৯৯/৭)। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে ‘দবব’ সম্পর্কে জিজ্ঞেস করা হলে তিনি বলেনঃ আমি এটি খাই না, তবে হারামও বলি না। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর দস্তরখানে ‘দবব’ খাওয়া হয়েছে। এর দ্বারা ইবনু ‘আব্বাস (রাঃ) প্রমাণ করেছেন যে, ‘দবব’ হারাম নয়। ৭৩৫৬. আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ঘোড়া ব্যবহারের দিক দিয়ে মানুষ তিন রকমের। এক রকম লোকের জন্য ঘোড়া সাওয়ারের মাধ্যম, আর এক রকম লোকের জন্য তা পাপ থেকে বাঁচার অবলম্বন এবং আর এক রকম লোকের জন্য তা শাস্তির কারণ। তার জন্য ঘোড়া সাওয়ারের মাধ্যম, যে ঘোড়াকে আল্লাহর রাস্তায় ব্যবহারের জন্য প্রস্তুত রাখে এবং চারণভূমি বা বাগানে প্রশস্ত রশিতে বেঁধে বিচরণ করতে দেয়। এই রশি যত লম্বা এবং যত দূরত্বে ঘোড়া চরতে পারে, সে তত বেশি সওয়াব পায়। যদি ঘোড়া এ দড়ি ছিঁড়ে এক চক্কর বা দু’ চক্কর লাগায় তবে ঐ ঘোড়ার প্রতিটি পদক্ষেপ এবং মালের বিনিময়ে তাকে সওয়াব দেয়া হয়। ঘোড়া যদি কোন নদী বা নালায় গিয়ে পানি খেয়ে ফেলে অথচ মালিক পানি খাওয়ানোর নিয়ত করেনি, এগুলো খুবই নেক কাজ। এর জন্য এ লোকের সওয়াব আছে। আর যে লোক ঘোড়া পালন করে একমাত্র অমুখাপেক্ষিতা এবং স্বনির্ভরতা বজায় রাখার জন্য; এর সঙ্গে সঙ্গে ঘোড়ার ঘাড়ে ও পিঠে যে আল্লাহর হক আছে তা আদায় করতেও সে ভুলে যায় না। এ ঘোড়া তার জন্য শাস্তি থেকে পর্দা হবে। আর যে ব্যক্তি অহংকার ও বশ্যতঃ ও লোক দেখানোর জন্য ঘোড়া পোষে, তার জন্য এই ঘোড়া (পাপের) বোঝা হবে। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে গাধা সম্পর্কে জিজ্ঞেস করা হল। তখন তিনি বললেনঃ এ সম্পর্কে আমার উপর ব্যাপক অর্থবোধক একটি আয়াত ব্যতীত আল্লাহ্ অন্য কিছু অবতীর্ণ করেন নিঃ ‘‘অতএব কেউ অণু পরিমাণও সৎ কাজ করলে সে তা দেখবে, আর কেউ অণু পরিমাণও অসৎ কাজ করলে সে তা দেখবে।’’- (সূরাহ যিলযালা ৯৯/৭-৮)। [২৩৭১] (আধুনিক প্রকাশনী- ৬৮৪২, ইসলামিক ফাউন্ডেশন- ৬৮৫৪)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 7357,
			"arabicnumber": 7357,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। এক স্ত্রীলোক রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে জিজ্ঞেস করল, হায়েয থেকে গোসল কিভাবে করতে হয়? তিনি বললেনঃ তুমি সুগন্ধিযুক্ত এক টুকরা কাপড় নেবে। এবং এর দ্বারা পবিত্রতা অর্জন করবে। স্ত্রীলোকটি বলল, হে আল্লাহর রাসূল! আমি এর দ্বারা কিভাবে পবিত্রতা অর্জন করব? নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম : তুমি এর দ্বারা পবিত্রতা অর্জন করবে। মহিলা আবার বলল, এর দ্বারা কিভাবে পবিত্রতা লাভ করবে? নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তুমি এর দ্বারা পবিত্রতা লাভ করবে। ‘আয়িশাহ (রাঃ) বলেন, আমি বুঝতে পারলাম রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর দ্বারা কী বোঝাতে চাচ্ছেন? অতঃপর আমি স্ত্রীলোকটিকে আমার দিকে টেনে নিলাম এবং বিষয়টি তাকে জানিয়ে দিলাম। [৩১৪] (আধুনিক প্রকাশনী- ৬৮৪৩, ইসলামিক ফাউন্ডেশন- ৬৮৫৫)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 7358,
			"arabicnumber": 7358,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, হারিস ইবনু হাযনের মেয়ে উম্মু হুফায়দ (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর জন্য ঘি, পনির এবং কতগুলো দবব হাদিয়া পাঠালেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ওগুলো চেয়ে নিলেন এবং এগুলো তাঁর দস্তরখানে খাওয়া হল। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঘৃণার কারণে খেতে অপছন্দ করলেন। ওগুলো হারাম হলে, তাঁর দস্তরখানে তা খাওয়া হত না এবং তিনিও এগুলো খেতে অনুমতি দিতেন না। [২৫৭৫] (আধুনিক প্রকাশনী- ৬৮৪৪, ইসলামিক ফাউন্ডেশন- ৬৮৫৬)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 7359,
			"arabicnumber": 7359,
			"text": "জাবির ইবনু ‘আবদুল্লাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ যে ব্যক্তি কাঁচা রসুন কিংবা পেঁয়াজ খায়, সে যেন আমাদের থেকে কিংবা আমাদের মাসজিদ থেকে আলাদা থাকে। আর সে যেন তার ঘরে বসে থাকে। এরপর তাঁর কাছে একটি পাত্র আনা হল। বর্ণনাকারী ইবনু ওয়াহ্ব (রাঃ) বলেন, অর্থাৎ শাক-সবজির একটি বড় পাত্র। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সেই পাত্রে এক প্রকার গন্ধ পাওয়ায় সে সম্পর্কে জিজ্ঞেস করলেন। তাঁকে পাত্রের মধ্যকার শাক-সবজি সম্পর্কে জানানো হল। তিনি তা এক সাহাবীকে খেতে দিতে বললেন যিনি তাঁর সঙ্গে উপস্থিত ছিলেন। এরপর তিনি যখন দেখলেন, সে তা খেতে অপছন্দ করছে তখন তিনি বললেনঃ খাও, কারণ আমি যাঁর সঙ্গে গোপনে কথোপকথন করি, তুমি তাঁর সঙ্গে তা কর না। ইবনু ‘উফায়র (রহ.).....ইবনু ওয়াহ্ব (রহ.) থেকে -এর জায়গায় (শাক-সবজির একটি হাঁড়ি) বর্ণনা করেছেন। অন্যদিকে লায়স ও আবূ সাফওয়ান (রহ.) ইউনুস (রহ.) থেকে হাঁড়ির ঘটনা উল্লেখ করেননি। এটি কি হাদীসে বর্ণিত না যুহরী (রাঃ)-এর উক্তি তা আমার জানা নেই। [৮৫৪] (আধুনিক প্রকাশনী- ৬৮৪৫, ইসলামিক ফাউন্ডেশন- ৬৮৫৭)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 7360,
			"arabicnumber": 7360,
			"text": "জুবায়র ইবনু মুত্ঈম (রাঃ) হতে বর্ণিত। তিনি বলেন, এক স্ত্রীলোক রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট হাযির হল এবং তাঁর সঙ্গে কোন ব্যাপারে কথাবার্তা বলল। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে কোন বিষয়ে নির্দেশ দিলেন। এরপর স্ত্রীলোকটি বলল, হে আল্লাহর রাসূল। আপনাকে যদি না পাই? তিনি বললেনঃ যখন আমাকে পাবে না, তখন আসবে আবূ বকর (রাঃ)-এর কাছে। আবূ ‘আবদুল্লাহ্ [(ইমাম বুখারী (রহ.)] বলেন, বর্ণনাকারী হুমায়দী (রহ.) ইবরাহীম ইবনু সা‘দ (রহ.) থেকে আরো অতিরিক্ত বলেছেন, স্ত্রীলোকটি সম্ভবত তার কথা দ্বারা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর মৃত্যুর প্রতি ইঙ্গিত করেছেন। [৩৬৫৯] (আধুনিক প্রকাশনী- ৬৮৪৬, ইসলামিক ফাউন্ডেশন- ৬৮৫৮)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 7361,
			"arabicnumber": 7361,
			"text": "আবুল ইয়ামান (রহ.) বলেন, শু‘আয়ব (রহ.), ইমাম যুহরী (রহ.) হুমায়দ ইবনু ‘আবদুর রহমান (রহ.) সূত্রে বর্ণনা করেছেন যে, তিনি মু‘আবীয়াহ (রাঃ)-কে মাদ্বীনাহ্য় কুরায়শ বংশের কতকগুলো লোকের সঙ্গে আলাপ-আলোচনা করতে শুনেছেন। তখন কা‘ব আহবারের কথা আলোচনা হয়। মু‘আবীয়াহ (রাঃ) বললেন, যারা আগেকার কিতাব সম্পর্কে আলোচনা করেন, তাদের মধ্যে তিনি অধিক সত্যবাদী, যদিও বর্ণিত বিষয়গুলোর ভিত্তি মিথ্যের উপর রচিত। (আধুনিক প্রকাশনী- অনুচ্ছেদ, ইসলামিক ফাউন্ডেশন- অনুচ্ছেদ)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 7362,
			"arabicnumber": 7362,
			"text": "আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, আহলে কিতাব হিব্রু ভাষায় তাওরাত পড়ে মুসলিমদের কাছে তা আরবী ভাষায় ব্যাখ্যা করত। (এ সম্পর্কে) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আহলে কিতাবকে তোমরা সত্যবাদী ভেবো না এবং তাদেরকে মিথ্যাবাদীও ভেবো না। তোমরা বলে দাও, আমরা ঈমান এনেছি আল্লাহর প্রতি এবং আমাদের উপর যা নাযিল হয়েছে তার প্রতি......। [৪৪৮৫] (আধুনিক প্রকাশনী- ৬৮৪৭, ইসলামিক ফাউন্ডেশন- ৬৮৫৯)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 7363,
			"arabicnumber": 7363,
			"text": "‘উবাইদুল্লাহ্ ইবনু ‘আবদুল্লাহ্ (রাঃ) হতে বর্ণিত যে, ইবনু ‘আব্বাস (রাঃ) বলেছেন, তোমরা কিভাবে আহলে কিতাবদেরকে কোন বিষয় সম্পর্কে জিজ্ঞেস কর? অথচ তোমাদের কিতাব (আল-কুরআন) তাঁর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর উপর এখন অবতীর্ণ হয়েছে, তা তোমরা পড়ছ যা পূত-পবিত্র ও নির্ভেজাল। এ কিতাব তোমাদেরকে জানিয়ে দিচ্ছে, আহলে কিতাবরা আল্লাহর কিতাবকে পরিবর্তিত ও বিকৃত করে দিয়েছে। তারা নিজ হাতে কিতাব লিখে তা আল্লাহর কিতাব বলে ঘোষণা দিয়েছে, যাতে এর দ্বারা সামান্য সুবিধা লাভ করতে পারে। তোমাদের কাছে যে ইল্ম আছে তা কি তোমাদেরকে তাদের কাছে কোন মাসআলা জিজ্ঞেস করতে নিষেধ করছে না? আল্লাহর কসম! আমরা তো তাদের কাউকে দেখিনি কখনো তোমাদের উপর নাযিল করা কিতাব সম্পর্কে কিছু জিজ্ঞেস করতে। [২৬৮৫] (আধুনিক প্রকাশনী- ৬৮৪৮, ইসলামিক ফাউন্ডেশন- ৬৮৬০)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 7364,
			"arabicnumber": 7364,
			"text": "জুনদাব ইবনু ‘আবদুল্লাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা কুরআন তিলাওয়াত করতে থাক, যতক্ষণ এর প্রতি তোমাদের হৃদয়ের আকর্ষণ অব্যাহত থাকে। আর যখন তোমাদের মনে বিকর্ষণ দেখা দেয় তখন তাত্থেকে উঠে যাও। আবূ আব্দুল্লাহ্ (বুখারী) (রহ.) বলেন, ‘আবদুর রহমান (রহ.) সাল্লাম থেকে (হাদীসটি) শুনেছেন (সূত্রে) বর্ণিত হয়েছে। [৫০৬০] (আধুনিক প্রকাশনী- ৬৮৫১, ইসলামিক ফাউন্ডেশন- ৬৮৬৩)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 7365,
			"arabicnumber": 7365,
			"text": "জুনদাব (রাঃ) হতে বর্ণিত যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা ততক্ষণ কুরআন তিলাওয়াত করতে থাক, যে পর্যন্ত এর প্রতি তোমাদের অন্তরের আকর্ষণ থাকে। আর যখন মনে বিকর্ষণ অনুভব কর, তখন তা থেকে উঠে যাও। ইয়াযীদ ইবনু হারুন (রহ.) জুনদাব (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে এরকমই বর্ণিত হয়েছে। (আধুনিক প্রকাশনী- ৬৮৫২, ইসলামিক ফাউন্ডেশন- ৬৮৬৪)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 7366,
			"arabicnumber": 7366,
			"text": "ইবনু ‘আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, যখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর মৃত্যুর সময় নিকটবর্তী হল। রাবী বলেন, ঘরের মধ্যে অনেক লোক ছিল। তাঁদের মধ্যে ছিলেন ‘উমার ইবনু খাত্তাব (রাঃ)। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমরা এসো, আমি তোমাদের জন্য লিখে যাব যাতে তার পরে তোমরা কক্ষনো পথভ্রষ্ট হবে না। ‘উমার (রাঃ) মন্তব্য করলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খুবই কষ্টে নিপতিত। তোমাদের কাছে কুরআন আছে, আল্লাহর এই কিতাবই আমাদের জন্য যথেষ্ট। এ সময় গৃহে অবস্থানকারীদের মধ্যে মতভেদ সৃষ্টি হল এবং তারা বিতর্কে লিপ্ত হল। তাঁদের মধ্যে কেউ কেউ বলল, তাঁর কাছে যাও, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তোমাদের জন্য লিখে দেবেন যাতে তাঁর পরে তোমরা কক্ষনো পথহারা হবে না। আবার কেউ কেউ তাই বললেন যা ‘উমার (রাঃ) বলেছিলেন। যখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সামনে তাদের কথা কাটাকাটি এবং মতপার্থক্য বেড়ে গেল,তখন তিনি বললেনঃ তোমরা আমার নিকট হতে উঠে যাও। (আধুনিক প্রকাশনী- ৬৮৫৩, ইসলামিক ফাউন্ডেশন- ৬৮৬৫) বর্ণনাকারী ‘উবাইদুল্লাহ্ বলেন, ইবনু ‘আব্বাস (রাঃ) বলতেন, সমস্ত জটিলতার মূল ছিল তা-ই, যা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও তাঁর লেখার মাঝখানে বাধা সৃষ্টি করেছিল। সেটা ছিল তাদের মতবিরোধ ও কথা কাটাকাটি। (ইসলামিক ফাউন্ডেশন- ৬৮৬৫)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 7367,
			"arabicnumber": 7367,
			"text": "জাবির (রাঃ) বলেন, এ কাজ তাদের জন্য ওয়াজিব করা হয়নি। বরং তাদের জন্য (স্ত্রী ব্যবহার) হালাল করা হয়েছে। উম্মু আতীয়্যা (রাঃ) বলেছেন, আমাদেরকে (অর্থাৎ মহিলাদেরকে) জানাযার সাথে যেতে নিষেধ করা হয়েছে। এ নিষেধাজ্ঞা আমাদের উপর বাধ্যতামূলক নয়। ৭৩৬৭. আতা (রহ.) থেকে বর্ণিত। তিনি বলেন, আমি জাবির ইবন আবদুল্লাহকে এ কথা বলতে শুনেছি যে, তাঁর সাথে আরো কিছু লোক ছিল। তিনি বলেন, আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সাহাবীগণ কেবল হজ্জের নিয়তে ইহরাম বেঁধেছিলাম। এর সাথে উমরার নিয়ত ছিল না। বর্ণনাকারী আতা (রহ.) বলেন, জাবির (রাঃ) বলেছেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যিলহজ্জ মাসের চার তারিখ সকাল বেলায় (মক্কায়) আসলেন। এরপর আমরাও যখন আসলাম, তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদেরকে ইহরাম খুলে ফেলার হুকুম করলেন। তিনি বললেনঃ তোমরা ইহরাম খুলে ফেল এবং স্ত্রীদের সাথে মিলিত হও। (রাবী) আতা (রহ.) বর্ণনা করেন, জাবির (রাঃ) বলেছেন, (স্ত্রী সহবাস) তিনি তাদের উপর বাধ্যতামূলক করেননি বরং বৈধ করেছেন। এরপর তিনি জানতে পারেন যে, আমরা বলাবলি করছি আমাদের ও আরাফার দিনের মাঝে কেবল পাঁচদিন বাকি। তিনি আমাদেরকে আদেশ করেছেন যে, আমরা ইহরাম খুলে স্ত্রীদের সঙ্গে মিলিত হই। তখন আমরা আরাফায় পৌঁছব আর আমাদের পুরুষাঙ্গ থেকে মযী বের হতে থাকবে। আতা বলেন, জাবির (রাঃ) এ কথা বোঝানোর জন্য হাত দ্বারা ইশারা করেছিলেন কিংবা হাত নেড়েছিলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দাঁড়ালেন এবং বললেনঃ তোমরা জান, আমি তোমাদের মধ্যে আল্লাহকে বেশি ভয় করি, তোমাদের চেয়ে আমি বেশি সত্যবাদী ও নিষ্ঠাবান। আমার সাথে যদি কুরবানী পশু না থাকত, আমিও তোমাদের মত ইহরাম খুলে ফেলতাম। সুতরাং তোমরা ইহরাম খুলে ফেল। আমি যদি আমার কাজের পরিণাম আগে জানতাম যা পরে জেনেছি তবে আমি কুরবানীর পশু সঙ্গে আনতাম না। কাজেই আমরা ইহরাম খুলে ফেললাম। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর আদেশ শোনলাম এবং তাঁর আনুগত্য করলাম। [মুসলিম ১৫/১৭, হাঃ ১২১৬, আহমাদ ১৪২৪২] (ইসলামিক ফাউন্ডেশন- ৬৮৬১)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 7368,
			"arabicnumber": 7368,
			"text": "আবদুল্লাহ মুযানী (রাঃ) সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণিত। তিনি বলেছেনঃ মাগরিবের সালাতের আগে তোমরা সালাত আদায় করবে। তবে তৃতীয়বারে তিনি বললেনঃ লোকেরা এটাকে সুন্নাত হিসেবে গ্রহণ করুক- এটা অপছন্দ করার কারণে তিনি তৃতীয়বারে বললেন- যার ইচ্ছে সে আদায় করবে। [১১৮৩] (আধুনিক প্রকাশনী- ৬৮৫০, ইসলামিক ফাউন্ডেশন- ৬৮৬২)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 7369,
			"arabicnumber": 7369,
			"text": "وَأَنَّ الْمُشَاوَرَةَ قَبْلَ الْعَزْمِ وَالتَّبَيُّنِ لِقَوْلِهِ فَإِذَا عَزَمْتَ فَتَوَكَّلْ عَلَى اللهِ فَإِذَا عَزَمَ الرَّسُولُ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لَمْ يَكُنْ لِبَشَرٍ التَّقَدُّمُ عَلَى اللهِ وَرَسُولِهِ وَشَاوَرَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَصْحَابَهُ يَوْمَ أُحُدٍ فِي الْمُقَامِ وَالْخُرُوجِ فَرَأَوْا لَهُ الْخُرُوجَ فَلَمَّا لَبِسَ لاَمَتَهُ وَعَزَمَ قَالُوا أَقِمْ فَلَمْ يَمِلْ إِلَيْهِمْ بَعْدَ الْعَزْمِ وَقَالَ لاَ يَنْبَغِي لِنَبِيٍّ يَلْبَسُ لاَمَتَهُ فَيَضَعُهَا حَتَّى يَحْكُمَ اللهُ وَشَاوَرَ عَلِيًّا وَأُسَامَةَ فِيمَا رَمَى بِهِ أَهْلُ الإِفْكِ عَائِشَةَ فَسَمِعَ مِنْهُمَا حَتَّى نَزَلَ الْقُرْآنُ فَجَلَدَ الرَّامِينَ وَلَمْ يَلْتَفِتْ إِلَى تَنَازُعِهِمْ وَلَكِنْ حَكَمَ بِمَا أَمَرَهُ اللهُ وَكَانَتْ الأَئِمَّةُ بَعْدَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَسْتَشِيرُونَ الْأُمَنَاءَ مِنْ أَهْلِ الْعِلْمِ فِي الْأُمُورِ الْمُبَاحَةِ لِيَأْخُذُوا بِأَسْهَلِهَا فَإِذَا وَضَحَ الْكِتَابُ أَوْ السُّنَّةُ لَمْ يَتَعَدَّوْهُ إِلَى غَيْرِهِ اقْتِدَاءً بِالنَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَرَأَى أَبُو بَكْرٍ قِتَالَ مَنْ مَنَعَ الزَّكَاةَ فَقَالَ عُمَرُ كَيْفَ تُقَاتِلُ النَّاسَ وَقَدْ قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَقُولُوا لاَ إِلَهَ إِلاَّ اللهُ فَإِذَا قَالُوا لاَ إِلَهَ إِلاَّ اللهُ عَصَمُوا مِنِّي دِمَاءَهُمْ وَأَمْوَالَهُمْ إِلاَّ بِحَقِّهَا وَحِسَابُهُمْ عَلَى اللهِ فَقَالَ أَبُو بَكْرٍ وَاللهِ لأُ×قَاتِلَنَّ مَنْ فَرَّقَ بَيْنَ مَا جَمَعَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ثُمَّ تَابَعَهُ بَعْدُ عُمَرُ فَلَمْ يَلْتَفِتْ أَبُو بَكْرٍ إِلَى مَشُورَةٍ إِذْ كَانَ عِنْدَهُ حُكْمُ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي الَّذِينَ فَرَّقُوا بَيْنَ الصَّلاَةِ وَالزَّكَاةِ وَأَرَادُوا تَبْدِيلَ الدِّينِ وَأَحْكَامِهِ وَقَالَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مَنْ بَدَّلَ دِينَهُ فَاقْتُلُوهُ وَكَانَ الْقُرَّاءُ أَصْحَابَ مَشُورَةِ عُمَرَ كُهُولاً كَانُوا أَوْ شُبَّانًا وَكَانَ وَقَّافًا عِنْدَ كِتَابِ اللهِ عَزَّ وَجَلَّ এবং পরামর্শ করো তাঁদের সঙ্গে (দ্বীনী) কাজের ব্যাপারে। পরামর্শ হলো স্থির সিদ্ধান্ত গ্রহণ ও লক্ষ্য নির্ধারণের পূর্বে। যেমন, আল্লাহর বাণীঃ ‘‘অতঃপর যখন তুমি দৃঢ়সংকল্প হও, তখন আল্লাহর উপর ভরসা কর’’- (সূরাহ আলে ‘ইমরান ৩/১৫৯)। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন কোন বিষয়ে দৃঢ়সংকল্প হন, তখন আল্লাহ্ ও তাঁর রাসূলের মতের বিপক্ষে যাওয়ার কারো কোন অধিকার থাকে না। উহূদের যুদ্ধের দিনে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর সাহাবীদের সঙ্গে এ পরামর্শ করেন যে, যুদ্ধ কি মাদ্বীনাহ্য় থেকেই চালাবেন, না বাইরে গিয়ে? সহাবাগণ মাদ্বীনাহ হতে বাইরে গিয়ে যুদ্ধ করার রায় দিলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যুদ্ধের পোশাক পরলেন এবং যখন যুদ্ধের জন্য দৃঢ়সংকল্প হলেন, তখন সাহাবীগণ আবেদন জানালেন, মাদ্বীনাহ হতেই অবস্থান করুন। কিন্তু তিনি দৃঢ়সংকল্প হবার পর তাঁদের এ মতামতের প্রতি ভ্রূক্ষেপ করলেন না। তিনি মন্তব্য করলেনঃ কোন নবীর সামরিক পোশাক পরার পর আল্লাহর পক্ষ থেকে হুকুম না পাওয়া পর্যন্ত তা খুলে ফেলা উচিত নয়। তিনি ‘আলী (রাঃ) ও উসামাহ (রাঃ)-এর সঙ্গে ‘আয়িশাহর উপর যিনার মিথ্যা অপবাদ লাগানো সম্পর্কে পরামর্শ করেন। তাদের কথা তিনি শোনেন। অতঃপর কুরআনের আয়াত নাযিল হয়। মিথ্যা অপবাদকারীদেরকে তিনি বেত্রাঘাত করেন। তাঁদের পারষ্পরিক মতপার্থক্যের প্রতি লক্ষ্য না করে আল্লাহর নির্দেশনা মোতাবেক সিদ্ধান্ত নেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর পরে ইমামগণ মুবাহ্ বিষয়ে বিশ্বস্ত আলেমদের কাছে পরামর্শ চান, যেন তুলনামূলক সহজ পথ তারা গ্রহণ করতে পারেন। হাঁ, যদি কিতাব কিংবা সুন্নাহ্তে আলোচ্য ব্যাপারে কোন স্পষ্ট ব্যাখ্যা পাওয়া যেত, তখন তারা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কথারই অনুসরণ করতেন, অন্য কারো কথার প্রতি ভ্রূক্ষেপ করতেন না। (নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর অনুসরণেই) যাকাত যারা বন্ধ করেছিল, আবূ বকর (রাঃ) তাদের বিরুদ্ধে যুদ্ধ করার সিদ্ধান্ত নেন। ‘উমার (রাঃ) তখন বললেন, আপনি কিভাবে লোকদের বিরুদ্ধে যুদ্ধ করবেন, অথচ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমি ততক্ষণ তাদের বিরুদ্ধে যুদ্ধ করতে আদিষ্ট হয়েছি, যতক্ষণ না তারা বলবে ‘লা ইলাহা ইল্লাল্লাহ্’। তারা যখন ‘লা ইলাহা ইল্লাল্লাহ্’ বলবে তখন তারা আমার নিকট হতে তাদের জীবন ও সম্পদের নিরাপত্তা লাভ করবে। তবে ইসলামের হকের ব্যাপার আলাদা। আর সে ব্যাপারে তাদের হিসাব-নিকাশ আল্লাহর উপর। আবূ বকর (রাঃ) বললেন, আল্লাহর কসম! আমি তাদের বিরুদ্ধে যুদ্ধ অবশ্যই করব, যারা এমন বিষয় বিচ্ছিন্ন করে যা রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সুসংহত করেছেন। অবশেষে উমর (রাঃ) তাঁর সিদ্ধান্ত মেনে নিলেন। আবূ বকর (রাঃ) এ ব্যাপারে (কারো সঙ্গে) পরামর্শ করার প্রয়োজনীয়তা অনুভব করেননি। কেননা, যারা সালাত ও যাকাতের মধ্যে ফারাক সৃষ্টি করে এবং ইসলাম-এর নির্দেশাবলী পরিবর্তন ও বিকৃত করার চেষ্টা করে, তাদের বিরুদ্ধে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সিদ্ধান্ত তাঁর সামনে বিদ্যমান ছিল। কেননা, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তি নিজের দ্বীনকে পরিবর্তন করে তাকে হত্যা কর। ‘উমার (রাঃ)-এর পরামর্শ সভার সদস্যগণ কুরআন বিশেষজ্ঞ ছিলেন। তারা অধিক বয়স্কই হোন কিংবা যুবক। আল্লাহর কিতাব সম্পর্কে ‘উমার (রাঃ) ছিলেন খুব ওয়াকেফহাল। ৭৩৬৯. ‘আয়িশাহ (রাঃ) হতে বর্ণিত। যখন মিথ্যা অপবাদকারীরা ‘আয়িশাহর বিরুদ্ধে ভিত্তিহীন অপবাদ রটিয়েছিল। তিনি বলেন, ওয়াহী আসতে বিলম্ব হচ্ছিল, তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আলী ইবনু আবূ তালিব ও উসামাহ ইবনু যায়িদের কাছে কিছু পরামর্শ করার জন্য তাদেরকে ডাকলেন। এবং তাঁর স্ত্রী ‘আয়িশাহ (রাঃ)-কে পৃথক করে দেয়া সম্পর্কে পরামর্শ চাইলেন। উসামাহ (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর পরিবারের পবিত্রতার ব্যাপারে তাঁর যা জানা ছিল তা উল্লেখ করলেন। আর ‘আলী (রাঃ) বললেন, আল্লাহ্ আপনার জন্য তো কোন সীমাবদ্ধতা রাখেন নি। স্ত্রীলোক তিনি ছাড়া আরও অনেক আছেন। আপনি বাঁদীটির কাছে জিজ্ঞেস করুন, সে আপনাকে সত্য যা, তাই বলবে। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বারীরাকে ডাকলেন। তাঁকে জিজ্ঞেস করলেন, তুমি কি সন্দেহের কিছু দেখেছ? তিনি বললেন, আমি এছাড়া আর অধিক কিছু জানি না যে, ‘আয়িশাহ (রাঃ) হচ্ছে অল্পবয়স্কা মেয়ে। তিনি নিজের ঘরের আটা পিষে ঘুমিয়ে পড়েন, এই অবস্থায় বক্রী এসে তা খেয়ে ফেলে। এরপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মিম্বরে দাঁড়িয়ে বললেনঃ হে মুসলিমগণ! যে ব্যক্তি আমার পরিবারের অপবাদ রটিয়ে আমাকে কষ্ট দিয়েছে তার প্রতিকার করতে আমাকে সাহায্য করার মত কেউ আছ কি? আল্লাহর শপথ! আমি আমার পরিবারের ব্যাপারে ভালো ব্যতীত মন্দ কিছুই জানি না এবং তিনি ‘আয়িশাহ (রাঃ)-এর পবিত্রতার কথা উল্লেখ করলেন। [২৫৯৩] (আধুনিক প্রকাশনী- ৬৮৫৪, ইসলামিক ফাউন্ডেশন- ৬৮৬৬)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 7370,
			"arabicnumber": 7370,
			"text": "‘আয়িশাহ (রাঃ) হতে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম লোকেদের (সামনে) খুত্বাহ দিলেন। আল্লাহর প্রশংসা ও গুণগান করলেন। এরপর তিনি বললেনঃ যারা আমার স্ত্রীর অপবাদ রটিয়ে বেড়াচ্ছে, তাদের সম্পর্কে তোমরা আমাকে কী পরামর্শ দাও। আমি আমার পরিবারের কারো মধ্যে কক্ষনো খারাপ কিছু দেখি নি। ‘উরওয়াহ (রাঃ) হতে বর্ণিত। তিনি বলেন, ‘আয়িশাহকে সেই অপবাদ সম্পর্কে জানানো হলে তিনি বললেন, হে আল্লাহর রাসূল! আমাকে আমার পরিজনের (বাবা-মার) কাছে যাবার অনুমতি দিবেন কি? তখন রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অনুমতি দিলেন এবং তাঁর সঙ্গে একজন গোলামও পাঠালেন। এক আনসারী বললেন, তুমিই পবিত্র, হে আল্লাহ্! এ ধরনের কথা বলা আমাদের উচিত নয়। এটা তো এক বিরাট অপবাদ, তোমারই পবিত্রতা হে আল্লাহ্! [২৫৯৩] (আধুনিক প্রকাশনী- ৬৮৫৫, ইসলামিক ফাউন্ডেশন- ৬৮৬৭)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 97
			}
		}
	]
}