{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"33": "Chapters On Al-Fitan"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2191,
			"arabicnumber": 2191,
			"text": "Abu Sa'eed Al-Khudri said:\"One day, the Messenger of Allah(s.a.w) led us in Salat Al-Asr while it was still daytime. Then he stood to give us a Khutbah. He did not leave anything that would happen until the Hour of Judgement except that he informed us about it. Whoever remembered it remembered it, and whoever forgot it forgot it. Among what he said was: 'Indeed the world is green and sweet, and indeed Allah has left you to remain to see how you behave. So beware of the world, and beware of the women.' And among what he said was: 'The awe(status) of people should not prevent a man from saying the truth when he knows it.\"'He(one of the narrators) said: \"Abu Sa'eed wept, then he said: 'By Allah! We have seen things and we feared.\"' \"And among what he said in it, was : 'Indeed, for every treacherous person there shall be a banner erected on The Day Of Resurrection in proportion to his treachery. And there is no treachery greater than the treachery of a leader to the masses' whose banner shall be positioned at his buttocks.' And among what we remember from that day is: 'Behold! Indeed the children of Adam were created in various classes. Among them is he who was born a believer, lives as a believer, and dies a believer. Among them, is he who was born a disbeliever, lives as a disbeliever, and dies a disbeliever. Among them, is he who was born a believer, lives as a believer, and dies a disbeliever. Among them, is he who was born a disbeliever, lives as a disbeliever, and dies a believer. Behold! Among them is the slow to get angry, the quick to calm. Among them is the quick anger and the quick to calm, so this is with that. Behold! Among them is the quick get angry and the slow to calm, and indeed the best of them is the slow to get angry and the quick to calm, and the worst of them is the quick get angry and the slow to calm. Behold! Among them is he who pays back well and collects well. Among them is he who is bad with paying back and good when collecting. Among them is he who pays back well and is bad with collecting, so this is with that. Behold! Among them is he who is bad with paying back and bad with collecting. Indeed the best of them is the one who is good in paying back and good in collecting. And the worst of them is the one who is bad with paying back and bad with collecting. Behold! Anger is an ember in the heart of the son of Adam, as you see it in the redness of his eyes and the bulge of his jugular veins. So whoever senses something from that, then let him cling to the ground.\"' He said: \"So we began turning towards the sun to see if anything of it remained(meaning whether it has set or not). So the Messenger of Allah(s.a.w) said: 'Behold! The world, in relation to what has passed of it, shall not remain except as what remains of this day of yours, in relation to what has passed of it",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 33,
				"hadith": 34
			}
		}
	]
}