{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"33": "Chapters On Al-Fitan"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2246,
			"arabicnumber": 2246,
			"text": "Abu Sa'eed said:\"I was accompanied by Ibn Sa'eed- either performing Hajj or 'Umrah - the people departed, and he and I were left. When I was alone with him I trembled and felt frightened of him because of what the people were saying about him. When I halted I said to him: 'Put your belongings near that tree.'\" \"he saw a sheep, took out a cup, and went to milk, it. Then he came to me with some milk and said to me: 'Drink Abu Sa'eed!' But I loathed drinking anything from his hand because of what the people were saying about him. So I said to him: 'It is very hot today, and I would not like to drink milk.' So he said to me: 'O Abu Sa'eed, I think I should take a rope, tie it to the tree, then hang myself because of what the people are saying about me. You see those who may be unaware of some narrations, while you are not unaware of them. You people are the most knowledgeable among the people of the Ahadith of the Messenger of Allah, O people of the Ansar! Did the Messenger of Allah not say: \"He is a disbeliever\" while I am a Muslim? Did the Messenger of Allah not said: \"He is sterile, having no children\" while I have left my children behind in Al-Madinah? Did the Messenger of Allah not say: \"[He will not enter or] Makkah [and Al-Madinah] are not lawful for him\" and am I not from the inhabitants of Al-Madinah, and who is the one who accompanied you to Makkah?'\" \"By Allah, he continued talking like this until I said: 'Perhaps he has been falsely accused' then he said: 'O Abu Sa'eed! By Allah, I can inform you of some information that is true, by Allah! Verily, I know him, I know his father, [and I know] where he is at this time in the land.' So I said: 'May the rest of your day be but grief",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 33,
				"hadith": 89
			}
		}
	]
}