{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"34": "Chapters On Dreams"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2293,
			"arabicnumber": 2293,
			"text": "Abu Hurairah narrated that a man came to the Prophet (s.a.w) and said:\"I had a dream of a cloud with shade dripping butter and honey. I saw the people scooping it up with their hands, some taking much and some taking little. I saw a rope extending from the sky to the earth. Then I saw you O Messenger of Allah ! You took hold of it and went up, then a man took hold of it after you do so, then a man took hold of it after him to do so. Then a man took hold of it and it was severed, and then connected for him, and he did so (i.e. , went up).\" Abu Bakr said: \"May my father and mother be ransomed for you O Messenger of Allah! Allow me to interpret it.\" He said: \"Interpret it.\" so he said: \"As for the cloud with its shade, it is Islam. As for what the butter and honey that dropped from it, this is the Quran and its delicateness and sweetness. It means some of them gathered much of the Quran and some of them a little. As for the rope extending from the sky to the earth, it is the truth which you are upon, you clug to it and Allah exalted you. Then another man will take hold of it after you and ascend on it, then after him, another man will take hold of it and ascend on it. Then another [man] will take hold of it but it will break, then be connected so he will ascend on it. Inform me O Messenger of Allah! Am I correct or am I mistaken?\" The Prophet (s.a.w) said: \"You are correct in some of it and mistaken in some of it.\" He (i.e., Abu Bakr) said: \"I swear to you by my father and my mother O Messenger of Allah! Inform me in what I was mistaken?\" The Prophet(s.a.w) said: \"Do not swear",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 24
			}
		}
	]
}