{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"37": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara'"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2477,
			"arabicnumber": 2477,
			"text": "Abu Hurairah narrated:\"The people of As-Suffah were the guests of the people of Islam,they had nothing of people nor wealth to rely upon. And By Allah, the One Whom there is none worthy of worship besides Him – I would lay on the ground on my liver (side) due to hunger, And I would fasten a stone to my stomach out of hunger. One day I sat by the way that they (the Companions) use to come out through. Abu Bakr passed and so I asked him about an Ayah from Allah's Book, not asking him except that he might tell me to follow him (for something to eat). But he passed on without doing so. Then `Umar passed, so I asked him about an Ayah from Allah's Book, not asking him except that he might tell me to follow him. But he passed on without doing so. Then Abul-Qasim (s.a.w) passed, and he smiled when he saw me, and said: 'Abu Hurairah?' I said: 'I am here O Messenger of Allah!' He said: 'Come along.' He continued and I followed him, he entered his house, so I sought permission to enter, and he permitted me. He found a bowl of milk and said: 'Where did this milk come from?' It was said: 'It was a gift to us from so – and – so.' So the Messenger of Allah (s.a.w) said: 'O Abu Hurairah' I said: 'I am here O Messenger of Allah!' He said: 'Go to the people of As-Suffah to invite them.' - Now, they were the guests of the people of Islam, they had nothing of people nor wealth to rely upon. Whenever some charity was brought to him, he would send it to them without using any of it. And when a gift was given to him (s.a.w), he would send for them to participate and share with him in it. I became upset about that, and I said (to myself): 'What good will this bowl be among the people of As-Suffah and I am the one bringing it to them?' Then he ordered me to circulate it among them (So I wondered) what of it would reach me from it, and I hoped that I would get from it what would satisfy me. But I would certainly not neglect to obey Allah and obey His Messenger, so I went to them and invited them. When they entered upon him they sat down. He said: 'Abu Hurairah, take the bowl and give it to them.' So I gave it to a man who drank his fill, then he gave it to another one, until it ended up with the Messenger of Allah (s.a.w), and all of the people had drank their fill. The Messenger of Allah (s.a.w) took the bowl, put it on his hand,then raised his head. He smiled and said: 'Abu Hurairah, drink.' So I drank, then he said: 'Drink.' I kept drinking and he kept on saying, 'Drink.' Then I said: 'By the One Who sent you with the truth! I have no more space for it.' So he took the bowl and praised Allah, mentioned His Name and drank.'” (Sahih)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 63
			}
		}
	]
}