{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"38": "Chapters on the description of Paradise"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2549,
			"arabicnumber": 2549,
			"text": "Hasan bin 'Atiyyah narrated from Sa'eed bin Al-Musayyab, that he met Abu Hurairah, and Abu Hurairah said:\"I supplicate Allah to bring you and I together in the market of Paradise.\" So Sa'eed said: \"Is there a market in it?\" He said: \"Yes, the messenger of Allah (s.a.w) informed me that: 'When the people of Paradise enter it, they shall take their places according to the virtue of their deeds. Then permission shall be granted to them to visit their Lord, for the length of a Friday from the days of the world. He shall present for them His Throne and He shall manifest the gardens of Paradise. Then lofty seats of light shall be erected for them, and lofty saets of pearl, and lofty seats or corundum, and lofty seats of peridots, and lofty seats of gold, and lofty seats of silver. And the lowest of them- and there is none of them that is low- shall sit upon a dune of musk and camphor, and they shall not regard those upon the chairs as having a better sitting place than them.' Abu Hurairah said: \"I said: 'O Messenger of Allah, and will we see our Lord?' He (S.a.w) said: 'Yes.[He said: ] Do you doubt [concerning] seeing the sun, or the moon on a night when it is full?' We said: 'No.' He said: 'Likewise, you will not doubt concerning seeing your Lord. And they shall not remain in that meeting any man except Allah shall give him a lecture until he says to a man from among them: \"O so-and – so son of so - and – so, do you remember the day when you said such-and-such.” And He will remind him of some of his betrayals in the world, so he will say: “O my Lord, did you not forgive me?” So He will say: “Indeed! It is by the vastness of My Forgiveness that you reached this station of yours.” So while they are engaged in this they shall be covered by a cloud that shall rain upon them a perfume, the like of whose smell they have not smelled, ever. And our Lord [Blessed and Exalted is He] shall say: “Arise to what I have prepared for you of generosity, and take whatever you desire.” Then, we will come to a market which the angels will have already surrounded. [In it] shall be what no eyes have seen the like of, nor ears have heard of, nor ever has it occurred in the hearts (of men). And there shall be carried to us whatever we desire. There shall be not be anything sold or bought in this market, and, in that market, the people of Paradise shall meet one another.' He said: 'So the person of high rank shall come and meet the one below him in rank- and there is none among them that is low- so he shall be impressed by the clothes he sees on him, their discussion shall not come to an end until he shall imagine upon himself what is more beautiful than it, and that is because it is not fitting for anyone to feel regret therein. Then we will return to our places and our wives shall meet us saying: “Welcome and greetings, you have come, and you have beauty greater than what you parted us with.” So we will say: “Indeed we sat today with our Lord, the Powerful, and it is fitting that we should return with what we have returned with.'” (Da'if)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 27
			}
		}
	]
}