{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"38": "Chapters on the description of Paradise"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2557,
			"arabicnumber": 2557,
			"text": "Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:\"Allah will gather mankind on the Day of Resurrection on a single plane, then the Lord of the Worlds will come to them and say: 'Let every person follow what they used to worship.' SO to the worshipper of the cross, his cross shall be symbolized to him, and to the worshipper of images his images, and to the worshipper of fire his fire. They will follow what they used to worship, and the Muslims will remain. Then the Lord of the Worlds will come to them and say: 'Do you not follow the people?' So they will say: 'We seek refuge in Allah from you, we seek refuge in Allah from you, Allah is our Lord, and we shall remain here until we see our Lord.' And He orders them and makes them firm.'\"Thy said: \"And you will see Him, O Messenger of Allah?\" He said: \"Are you harmed in seeing the moon on the night of a full moon?\" They said: \"No, O Messenger of Allah.\" He said: \"So you will not be harmed in seeing Him at that hour. Then He will conceal Himself, then He will come, and He will make them recognize Him, then He will say: \"I am your Lord, so follow Me.\" So the Muslims will arise and the Sirat shall be placed, and they shall be placed, and they shall pass by it the like of excellent horses and camels and their statement upon it shall be, \"Grant them safety, grant them safety.\" And the people of Fire shall remain, then a party of them shall be cast down into it, and it shall be said (to the Fire): 'Have you become full?' So it shall say: Is there more? Then a party of them shall be cast down into it, and it shall be said: 'Have you become full?' So it shall say: Is there more? Until when they are all included into it, Ar-Rahman (the Most-Merciful) shall place His foot in it and its sides shall be all brought together, then He will say: 'Enough.' It will say 'Enough, enough.' So when Allah, the Exalted, has admitted the people of Paradise into Paradise and the people of Fire into Fire\"- [He said:]- \"Death shall be brought in by the collar and stood on the wall that is between the people of Paradise and the people of the Fire, then it will be said: 'O people of Paradise!' They will come near, afraid. Then it will be said: 'O people of the Fire!' They will come rejoicing, hoping for intercession. Then it will be said to the people of Paradise and the people of the Fire: 'Do you recognize this?' So they will-both of them-say: 'We recognize it. It is Death which was given charge of us,' so it will be laid down and slaughtered upon the wall [the one that is between Paradise and the Fire], then it will be said: 'O people of Paradise! Everlasting life without death!' And 'O people of the Fire! Everlasting life without death",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 35
			}
		}
	]
}