{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"2": "The Book on Salat (Prayer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 304,
			"arabicnumber": 304,
			"text": "Muhammad bin Amr bin Ata' narrated from Abu Humaid As-Saidi, :he (Muhammad) said: \"I heard him saying - while he was among ten of the Companions of the Prophet, one of whom was Abu Qatadah bin Ribi - 'I am the most knowledgeable among you of the Salat of the Allah's Messenger.' They said: 'You did not precede us in his companionship, nor were you in his company more than us.' He said: 'Even still.\" They said: 'Go ahead.' So he said: 'When Allah's Messenger stood for Salat he would stand with his back straight and raise his hands until they were at the level of his shoulder. Then he would say: (Allahu Akbar) \"Allah is Most Great\" and bow. Then he would straighten (his back) so that he would not lower his head, nor raise it, and he placed his hands on his knees. Then he said: (Sami Allahu liman hamidah) \"Allah listens to those who praise Him.\" And he raised his hands and stood up straight until all of his bones completely returned to their places. Then he went down to the ground prostrating, then he said: (Allahu Akbar) \"Allah is Most Great.\" Then he held his upper arms away from his midsection, and opened his toes on his feet (facing the Qiblah), then he bend his left foot and sat on it then straightened up until all of his bones completely returned to their placed, then he went down to prostrate. Then he said: (Allahu Akbar) \"Allah is Most Great,\" then he bent his foot and sat and straightened up until all of his bones completely returned to their places. Then he got up. Then in the second Rak'ah he did the same as that, such that when he stood from the two prostrations, he sad the Takbir and raised his hands until they were at the level of his shoulders as he did when he opened the Salat. Then he did like that until it was the Rak'ah in which his Salat was to end, when he moved his left foot over and sat on his side (in the Mutawarrik postion). Then he said the Taslim",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 156
			}
		}
	]
}