{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3087,
			"arabicnumber": 3087,
			"text": "Narrated Sulaiman bin 'Amr bin Al-Ahwas:\"My father narrated to me that he attended the Farewell Hajj with the Messenger of Allah (ﷺ). He (ﷺ) expressed his gratitude to Allah and praised Him, and reminded and exhorted, then he said: 'Which day is most sacred? Which day is most sacred? Which day is most sacred?' He said: \"So the people said: 'The day of Al-Hajj Al-Akbar O Messenger of Allah!' So he said: 'Indeed, your blood, your wealth, your honor, is as sacred for you as the sacredness of this day of yours, in this city of yours, in this month of yours. Behold! None commits a crime but against himself, none offends a father for a son, nor a son for a father. Behold! Indeed the Muslim is the brother of the Muslim, so it is not lawful for the Muslim to do anything to his brother, which is not lawful to be done to himself. Behold! All Riba from Jahiliyyah is invalid, for you is the principle of your wealth, but your are not to wrong nor be wronged - except in the case of Riba of Al-'Abbas bin 'Abdul-Muttalib - otherwise it is all invalid. Behold! All retribution regarding cases of blood during Jahiliyyah are invalid. The first case of blood retribution invalidated among those of Jahiliyyah, is the blood of Al-Harith bin 'Abdul-Muttalib who was nursed among Banu Laith and killed by Hudhail. Behold! I order you to treat women well, for they are but like captives with you, you have no sovereignty beyond this over them, unless they manifest lewdness. If they do that, then abandon their beds, and beat them with a beating that is not painful. Then if they obey you, then there is no cause for you against them beyond that. Behold! There are rights for you upon your women, and rights for your women upon you. As for your rights upon them,then they are not to allow anyone on your bedding whom you dislike, nor to permit anyone whom you dislike in your homes. Behold! Indeed their rights upon you are that you treat them well in clothing them and feeding them",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 139
			}
		}
	]
}