{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3149,
			"arabicnumber": 3149,
			"text": "Narrated Sa'eed bin Jubair:\"I said to Ibn 'Abbas: 'Nawf Al-Bikali claims that Musa, of Banu Isra'il is not the companion of Al-Khidr. He said: 'The enemy of Allah has lied. I heard Ubayy bin Ka'b saying: \"I heard the Messenger of Allah (ﷺ) say 'Musa stood to deliver a Khutbah to the children of Isra'il. He was asked: \"Who is the most knowledgeable among the people?\" He said: \"I am the most knowledgeable.\" So Allah admonished him, since he did not refer the knowledge back to Him. Allah revealed to him: \"A slave, among My slaves at the junction of the two seas, is more knowledgeable than you.\" So Musa said: \"O Lord! How can I meet him?\" He said to him: \"Carry a fish in a basket, wherever you lose the fish, then he is there.\" So he set off, and his boy set off with him - and he was Yusha' bin Nun. Musa put a fish in a basket, he and the boy set off walking, until when they reached a rock, Musa and his boy fell asleep. The fish was flopping around in the basket, falling into the sea.' He said: 'Allah held back the flow of water until it was like a tunnel, and the fish could glide. Musa and his boy were amazed. They set off the remainder of the day and the night, and Musa's companion forgot to inform him (of the escape of the fish). When Musa arose in the morning, he said to his boy: Bring us our morning meal; truly we have suffered much fatigue in this, our journey (18:62).' He said: 'He had not gotten tired until he passed the place which Allah had ordered him to go. He said: Do you remember when we betook ourselves to the rock? I indeed forgot the fish, none but Shaitan made me forget to remember it. It took its course into the sea in a strange way (18:63). Musa said: That is what we have been seeking. So they went back, retracing their tracks (18:64). He said: 'So they began retracing their tracks.'\" Sufyan (one of the narrators) said: \"People claim that there is a spring of life at that rock, no dying person has its water poured over him, but he becomes alive, and the fish came in contact with some of it, so when the water dropped on it he became alive.\" \"He [the Prophet (ﷺ)] said: 'They retraced their tracks until they arrived at the rock to see a man covered in a garment. Musa greeted him, and he replied: Is there such a greeting in your land? He said: I am Musa. He said: Musa of the children of Isra'il? He said: Yes. He said: O Musa! Indeed you have some knowledge from Allah, which Allah taught you, which I have not been taught, and I have some knowledge from Allah, which Allah taught me, which you have not been taught.' So Musa said: May I follow you so that you may teach me something of the knowledge which you have been taught? (18:66) He said: Verily, you will not be able to have patience with me! And how can you have patience about a thing which you know not? He said: If Allah wills, you will find me patient, and I will not disobey you at all (18:67-69). Al-Khadir said to him: Then if you follow me, ask me not about anything until I myself mention it to you (18:70). Musa said: Yes. So Musa and Al-Khadir set off walking along the shore of the sea. A boat was passing by them, and they spoke to them (the crew) asking them to let them get on board. They recognized Al-Khadir so they let the two of them ride without charge. Al-Khadir took one of the planks (in the boat) and removed it, so Musa said to him: These people gave us a ride free of charge, yet you sabotaged their boat so that its people will drown. Indeed you have done a dreadful thing (18:71). He said: Did I not tell you that you would not be able to have patience with me? (18:72). He said call me not to account for what I forgot, and be not hard upon me for my affair (18:73). Then they exited the boat, and while they were walking upon the shore, they saw a boy playing with two other boys. So Al-Khadir took him by his head, pulling it off with his hands, and he killed him. So Musa said to him: Have you killed an innocent person who killed no one! Verily you have done a horrendous thing (18:74). He said: Did I not tell you that you would not be able to have patience with me? (18:75) - he (the narrator) said: - \"This was more severe than the first one\" - He said: If I ask you about anything after this, you have received an excuse from me. So they both proceeded until they came to the inhabitants of a town. They asked them for food but they refused to entertain them. There they found a wall on the verge of falling down (18:76 & 77). He (the narrator) said: - meaning leaning over - 'So Al-Khadir took his hand like this, so he set it up straight (18:77) so Musa said to him: We arrived at these people, they did not treat us as guests nor feed us. If you wished, surely you could have taken wages for it! He said: \"This is the parting between you and I. I will tell you the interpretation of (those) things over which you were not able to be patient (18:77 & 78).'\" The Messenger of Allah (ﷺ) said: 'May Allah have mercy upon Musa! We wish that he would have had patience, so that we could have more knowledge about that two of them.' He said: 'So the Messenger of Allah (ﷺ) said: 'The first time Musa had forgotten.' He said: 'And a sparrow came, until it perched on the edge of a boat, and pecked at the sea. So Al-Khadir said to him: My knowledge and your knowledge do not diminish anything from the knowledge of Allah, but like what this sparrow diminishes of the sea.' Sa'eed bin Jubair said: \"and he would\" - meaning Ibn 'Abbas - \"recite: 'And there was before them a king who would take every useful boat by force (18:79).' And he would recite: 'As for the boy, he was a disbeliever (18:80)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 201
			}
		}
	]
}