{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3254,
			"arabicnumber": 3254,
			"text": "Narrated Masruq:\"A man came to 'Abdullah and said: 'A story teller has said that a smoke will appear from the earth, taking the hearing of disbelievers and manifesting as a cold for the believers.'\" He became angry, and since he was reclining, he sat up then said: 'When one of you is asked about something he knows, then let him speak accordingly' - Mansur (one of the narrators) narrated it as: \"Then let him inform of it\" - \"And when asked about what he does not know, then let him say: \"Allah knows best.\" For indeed, it is part of a man's knowledge, that when he is asked about something he does not know, he says: \"Allah knows best.\" For verily Allah, Most High said to His Prophet: Say: \"No wage do I ask of you for this, nor am I one of the pretenders (38:86).\" When the Messenger of Allah (ﷺ) saw that the Quraish were behaving stubbornly with him, he said: \"O Allah! Assist me against them with seven (years of famine) like the seven of Yusuf.\" So He punished them with drought making everything barren, until they ate skins and carcasses\" - one of them said: \"bones.\" He said: 'And it appeared that smoke was coming out of the earth. So Abu Sufyan came to him and said: \"Verily your people are being destroyed, so supplicate to Allah for them.\" He said: \"So this is about His saying: 'The Day when the sky will bring forth a visible smoke, covering the people, this is a painful torment (44:10 & 11).'\" Mansur narrated it as: \"So this is about His saying: Our Lord! Remove the torment from us, really we shall become believers (44:12).\" - \"So shall the punishment be removed from them in the Hereafter? Al-Batshah (humiliated defeat in Badr), Al-Lizam (disbeliever captives from Badr), the smoke,\" - one of them said: \"The moon\" the other said: \"The Romans have all passed",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 306
			}
		}
	]
}