{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3299,
			"arabicnumber": 3299,
			"text": "Salamah bin Sakhr Al Ansari said:“I was a man who had an issue with intercourse with a women that none other than me had. When (the month of) Ramadan entered, I pronounced Zihar upon my wife (to last) until the end of Ramadan, fearing that I might have an encounter with her during the night, and I would continue doing that until daylight came upon me, and I would not be able to stop. One night while she was serving me, something of her became exposed for me, so I rushed myself upon her. When the morning came I went to my people to inform them about what happened to me. I said: ‘Accompany me to the Messenger of Allah to inform him about my case.’ They said: ‘No by Allah! We shall not do that, we feat that something will be revealed about us in the Qur’an, or the Messenger of Allah might say something about us, the disgrace of which will remain upon us. But you do and do whatever you want.’” He said: “So I left and I went to the Messenger of Allah, and informed him of my case. He said: ‘You are the one who did that?” I said: ‘I am the one.’ He said: ‘You are the one who did that?” I said: ‘I am the one.’ He said: ‘You are the one who did that?” I said: ‘I am the one, it is before you, so give me Allah’s judgment, for I shall be patient with that.’ He said: ‘Free a slave.’” He said: “I struck the sides of my neck with me hands, and said: ‘No by the One Who sent you with the Truth! I possess nothing besides it.’ He said: ‘Then fast for two months’ I said: ‘O Messenger of Allah! Did this occur to me other than when I was fasting?’ He said: ‘Then feed sixty poor people.’ I said: ‘By the One Who sent you with the Truth! We have spent these nights of ours hungry without an evening meal.’ He said: ‘Go to the one with the charity from Banu Ruzaiq, tell him to give it to you, then feed a Wasq of it, on your behalf, to sixty poor people. Then help yourself and your dependants with the remainder of it.’” He said: “I returned to my people and said: ‘I found dejection and bad ideas with you, and I found liberalness and blessing with the Messenger of Allah. He ordered me to take your charity, so give it to me.’ So they gave it to me.”",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 351
			}
		}
	]
}