{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3340,
			"arabicnumber": 3340,
			"text": "Suhaib narrated:“When the Messenger of Allah had performed Asr, Hamasa (he began mumbling)” – and Al—Hams according to some of them, is moving the lips as if he is speaking – “It was said to him: ‘O Messenger of Allah! After you performed Asr, you were mumbling?’ He said: ‘There was a Prophet among the Prophets, he was amazed with his people, so he said: “Who can stand against these people?” Then Allah revealed to him, that they must choose between some of them suffering from wrath, and between enemies of theirs assaulting them. They chose the wrath. So death was inflicted upon them such that seventy-thousand of them died in one day.’”He said: And when he would narrated this Hadith, he would also narrated another: “There was a king among the kings, and that king had a fortune-teller (Kahin) who would see for him. The fortune teller said: ‘Search for a boy for me, he must be understanding” or he said: “clever and quick, so that I can teach him this knowledge of mine. For verily, I fear that I shall die, and this knowledge will be removed from you, and there will be no one among you who knows it.” He said: “They looked for a boy fitting his description. (After finding one) they ordered him to tend to that fortune teller, and to continue visiting him. So he began his frequent visits, and on the boy’s route, there was a monk at his hermitage.” – Ma’mar said: “I think that during that time, the people at the hermitage were Muslims.” – He said: “They boy began asking that monk questions each time he passed him, and he would not leave him until he informed him, so he said: ‘I only worship Allah.’” He said: “So the boy began spending more time with the monk and arriving late to the fortune-teller. The fortune-teller sent a message to the boy’s family saying: ‘He hardly ever attends me.’ The boy told that to the monk, so the monk said to him: ‘When the fortune-teller asks you where you’ve been, tell him: “I was with my family.” And when your family asks you where you’ve been, then tell them that you were with the fortune-teller.’” He said: “One day, the boy passed by a large group of people being held back by a beast.” Some of them said, it was a lion. He said: “So the boy took a rock and said: ‘O Allah, if what the monk says is true, then I ask you to kill it.’” [He said:] “Then he threw the rock, killing the beast. The people began asking who killed it and some of them replied: ‘It was the boy.’ They were terrified and said: ‘This boy has learned a knowledge that no one else has learned.’” He said: “A blind man heard about him so he said to him: ‘If you can return my sight, I shall give you this and that.’ He said to him: ‘I do not want this from you. However, if your sight is returned to you, would you believe in the One who gave it back to you?’ He said: ‘Yes.’” He said: “So he supplicated to Allah, and He returned his sight to him, and the blind man believed. His case was conveyed to the king, so he sent for him to be brought before him. He said: ‘I shall kill each of you in a manner different than his comrade was killed.’ He called for the monk and the man who used to be blind. He placed a saw upon the forehead of one of them and killed him. Then he killed the other one by a different means. Then he gave orders for the boy, he said: ‘Take him to this or that mountain, and throw him from its peak.’ They brought him to that mountain, and when they reached the place from where they intended to cast him off, they began tumbling off of that mountain, and all of them fell down until none of them remained except for the boy.” He said: “Then he returned and the king ordered that he be brought out to sea and cast into it. So he was brought out to sea, but Allah drowned those who were with him, and He saved him. Then the boy said to the king: ‘You will not kill me until you tie me to the trunk of a tree and shoot me, and when you shoot me, you said: “In the Name of Allah, the Lord of this boy.’” He said: “So he ordered that he be tied, then when he shot him, he said: ‘In the Name of Allah, the Lord of this boy.’ The boy placed his hand upon his temple where he was shot, then he died. The people said: “This boy had knowledge that no one else had! Verily we believe in the Lord of this boy!” He said: It was conveyed to the king “Your efforts have been thwarted by the opposition of these three, now all of these people have opposed you.” He said: “So he had ditches dug, then fire wood was filled into it and a fire was lit. Then he (the king) had all of the people gathered and he said: ‘Whoever leaves his religion, then we shall leave him. And whoever does not leave, we shall cast him into this fire.’ So he began casting them into that ditch.” He said: “Allah, Blessed is He and Most High, said about that: ‘Cursed were the People of the Ditch. Of fire fed with fuel…’ until he reached: ‘…The Almighty, Worthy of all praise!’” He said: “As for the boy, he was buried.” He said: “It has been mentioned, that he was excavated during the time of Umar bin Al-Khattab, and his finger was at his temple, just as he had placed it when he was killed.”",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 392
			}
		}
	]
}