{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"48": "Chapters on Supplication"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3421,
			"arabicnumber": 3421,
			"text": "Ali bin Abi Talib narrated that whenever the Messenger of Allah would stand for Salat, he would say:“I have directed my face towards the One who created the Heavens and the earth, as a Hanif, and I am not of the idolaters. Indeed, my Salat, my sacrifice, my living, and my dying is for Allah, the Lord of all that exists, there is no partner for Him, and with this have I been ordered, and I am among the Muslims. O Allah, You are the King, there is none worthy of worship except You. You are My Lord, and I am Your slave, I have wronged myself, and I admit to my sin, so forgive me all my sins, verily, there is none who forgives sins but You. And guide me to the best of the manners, none guides to the best of them except You, and turn the evil of them away from me, [verily,] none can turn the evil of them away from me except You. I have believed in You. Blessed are You and Exalted are You, I seek Your forgiveness and I repent to you (Wajjahtu wajhiya lilladhī faṭaras-samāwāti wal-arḍa ḥanīfan wa mā ana min al-mushrikīn, inna ṣalātī wa nusukī wa maḥyāya wa mamātī lillāhi rabbil-`ālamīn, lā sharīka lahū wa bidhālika umirtu wa ana min al-muslimīn. Allāhumma antal-maliku lā ilāha illā ant, anta rabbī, wa ana `abduka ẓalamtu nafsī wa`taraftu bidhanbī faghfirlī dhunūbī jamī`an, innahū lā yaghfir adh-dhunūba illā ant. Wahdinī li-aḥsanil-akhlāqi lā yahdī li-aḥsanihā illā ant. Waṣrif `annī sayyi’ahā [innahū] lā yaṣrifu `annī sayyi’aha illā ant. Āmantu bika tabārakta wa ta`ālaita astaghfiruka wa atūbu ilaik).” And when he would bow in Ruku`, he would say: “O Allah, to You I have bowed, and in You I believe, and to You have I submitted. My hearing, my sight, my brain, my bones and my sinew are humbled to you (Allāhumma laka raka`tu wa bika āmantu wa laka aslamtu. Khasha`a laka sam`ī wa baṣarī wa mukhkhī wa `iẓāmī, wa `aṣabī)” Then when he would raise his head, he would say: “O Allah, our Lord, to You is praise the fill of the Heavens and the earths and the fill of whatever You will of things. (Allāhumma rabbanā lakal-ḥamdu mil’as-samāwāti wal-arḍīna wa mā bainahumā, wa mil’a mā shi’ta min shay’in ba`d).” Then, when he prostrated, he would say: “O Allah, to You have I prostrated, and in You have I believed, and to You have I submitted, my face has prostrated to the One Who created it and fashioned it, and gave it its hearing and its sight. So Blessed is Allah, the Best of creators (Allāhumma laka sajadtu wa bika āmantu wa laka aslamtu, sajada wajhi lilladhī khalaqahū fa ṣuwwarahū wa shaqqa sam`ahū wa baṣarahū fatabārak Allāhu ahsanul-khāliqīn).” Then the last of what he would say between At-Tashah-hud and As-Salam would be: “O Allah, forgive me what I have done before and after, and what I have hidden and what I have done openly, and what You know more of it than I, You are the One who sends forth and the One who delays, there is none worthy of worship except You. (Allāhummaghfirlī mā qaddamtu wa mā akhkhartu wa mā asrartu wa mā a`lantu wa mā anta a`lamu bihī minnī antal-Muqaddimu wa antal-Mu’akhkhiru, lā ilāha illā ant).”",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 52
			}
		}
	]
}