{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"48": "Chapters on Supplication"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3570,
			"arabicnumber": 3570,
			"text": "Ikrimah, the freed slave of Ibn `Abbas, narrated that:Ibn `Abbas said: “We were with the Messenger of Allah (ﷺ) when `Ali bin Abi Talib came to him, and he said: ‘May my father and mother be ransomed for you! This Qur’an has suddenly left my heart, and I do not find myself capable of it.’ So the Messenger of Allah (ﷺ) said to him: ‘O Abul-Hasan! Should I not teach you words that Allah shall benefit you with, and benefit whomever you teach, and they will make whatever you have learned in your chest firm?’ He said: ‘Of course, O Messenger of Allah (ﷺ), so teach me.’ He (ﷺ) said: ‘When it is the night of (before) Friday, then if you are able to stand in the last third of the night, then verily it is a witnessed hour, and supplication is answered in it. And my brother Ya`qub (as) did say to his sons: I shall seek forgiveness for you from my Lord. He said: “Until the night of Friday comes.” So if you are not able, then stand in the middle of it, and if you are not able then stand in the first of it. And pray four Rak`ah. Recite Fatihatul-Kitab (the Opening of the Book) and Surat Ya-Sin in the first Rak`ah, and Fatihatul-Kitab and Ha-Mim Ad-Dukhan in the second Rak`ah, and Fatihatul-Kitab and Alif Lam Mim Tanzil As-Sajdah in the third Rak`ah, and Fatihatul-Kitab and Tabarak Al-Mufassal in the fourth Rak`ah. So when you have finished with the Tasha-hud, then praise Allah and mention Allah’s greatness in an excellent manner, and send Salat upon me - and be excellent in it - and upon the rest of the Prophets. And seek forgiveness for the believing men and the believing women, and for your brothers who have preceded you in faith. Then say in the end of that: “O Allah, have mercy on me by abandonment of sins forever, so long as You keep me remaining. And have mercy on me from taking upon myself what does not concern me, and provide me good sight for what will make You pleased with me. O Allah, Originator of the heavens and the earth, Possessor of glory, and generosity, and honor that is not exceeded. I ask you, O Allah, O Rahman, by Your glory and the light of Your Face, to make my heart constant in remembering Your Book as You taught me, and grant me that I recite it in the manner that will make You pleased with me. O Allah, Originator of the heavens and the earth, Possessor of glory, and generosity, and honor that is not exceeded. I ask you, O Allah, O Rahman, by Your glory and the light of Your Face, to enlighten my sight with Your Book, and make my tongue free with it, and to relieve my heart with it, and to expand my chest with it, and to wash my body with it. For indeed, none aids me upon the truth other than You, and none gives it except You, and there is no might or power except by Allah, the High, the Magnificent. (Allāhummarḥamnī bitarkil-ma`āṣī abadan mā abqaitanī, warḥamnī an atakallafa mā lā ya`nīnī, warzuqnī ḥusnan-naẓari fī mā yurḍīka `annī. Allāhumma badī`as-samāwāti wal-arḍi dhal-jalāli wal-ikrāmi wal-`izzatil-latī lā turāmu, as’aluka yā Allāhu yā Raḥmānu bi-jalālika wa nūri wajhika, an tulzima qalbī ḥifẓa kitābika kamā `allamtanī, warzuqnī an atluwahū `alan-naḥwil-ladhī yurḍīka `annī. Allāhumma badī`as-samāwāti wal arḍi dhal-jalāli wal-ikrāmi wal `izzati-llatī lā turāmu, as’aluka yā Allāhu, yā Raḥmānu bi-jalālika wa nūri wajhika, an tunawwira bi-kitābika baṣarī, wa an tuṭliqa bihī lisānī, wa an tufarrija bihī `an qalbī, wa an tashraḥa bihī ṣadrī, wa an taghsila bihī badanī, fa innahu lā yu`īnunī `alal-ḥaqqi ghairuka wa lā yu’tīhi illā anta wa lā ḥawla wa lā quwwata illā billāhil-`Aliyyil-`Aẓīm).” O Abul-Hasan! So do this three Fridays, or five, or seven, you will be answered - by the will of Allah - by the One Who sent me with the Truth, it has not failed a believer once.’” `Abdullah bin `Abbas said: “So, by Allah, `Ali did not wait but five or seven until [`Ali] came to the Messenger of Allah (ﷺ) in a gathering similar to that and said: ‘O Messenger of Allah (ﷺ), indeed I was [a man] in the time that passed, who used to not take except four Ayat or about that much, so when I would recite them to myself they would suddenly depart from me, and today I learn forty Ayat or about that much, and when I recite them to myself, then it is as if the Book of Allah is before my eyes. I used to hear a Hadith and when I would repeat it, it would suddenly depart from me, and today I hear Ahadith, and when I report them, I do not err in a single letter.’ So the Messenger of Allah (ﷺ) said at that point: ‘A believer, by the Lord of the Ka`bah, O Abul-Hasan.’”",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Mawdu"
				},
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 201
			}
		}
	]
}