{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"3": "The Book on Al-Witr"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 480,
			"arabicnumber": 480,
			"text": "Jabir bin Abdullah narrated:\"Allah's Messenger would teach us Al-Isthikhara for all of our affairs just as he would teach us a Surah of the Qur'an, saying: 'When one of you is worried about a matter, then let him perform two Rak'ah other than the obligatory (prayer), then let him say: (Allahumma inni astakhiruka bi'ilmika, wa astaqdiruka biqudratika, wa as'aluka min falikal-azim, fa innaka taqdiru wa la qadiru, wa ta'lami wa la a'lamu, wa anta allamul-ghayub. Allahumma in kunta ta'lamu anna hadhal-amra khairun li fi dini wa ma'ishati wa aqibati amri, or said: Fi ajili amri wa ajilihi fayassirhu li,thumma barik li fihi, wa in kunta ta'lamu anna hadhal-amra sharrun li fi dini wa ma'ishati wa aqibati amri, or said: Fi ajili amri wa ajilihi fasrifhu anni wasrifni anhu waqdur Lil-khaira haithu kana, thumma ardini bih.)\" 'O Allah! I consult Your knowledge, and seek ability from Your power, and I ask You from Your magnificent bounty, for indeed You have power and I do not have power, and You know while I do not know, and You know the unseen. O Allah! If you know that this matter is good for me in my religion or my livelihood, and for my life in the Hereafter - or he said: for my present and future - then make it easy for me, then bless me in it. If You know that this matter is bad for me in my religion and my livelihood and my life in the Hereafter - or he said: for my present and future - then divert it from me and divert me from it, enable me to find the good wherever it is, then make me pleased with it.\"He said: \"And he mentions his need",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 28
			}
		}
	]
}