{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"9": "The Book on Hajj"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 885,
			"arabicnumber": 885,
			"text": "Ali bin Abi Talib, may Allah be pleased with him, narrated:\"The Messenger of Allah stopped at Arafat and said: 'This is Arafah and it is a place of standing. And all of Arafat is a place for standing.' Then he departed when the sun had set and took Usamah bin Zaid as a companion rider, and he was motioning with his hand as was his custom, and the people were striking (their camels) on the right and the left to try and catch them, so he said: 'O you people! Be calmm.' Then he came to Jama and performed the two Salat there combined. When the morning came, he went to Quzah and stood there and said: 'This is Quzah, and it is a place of standing, and all of Jama is a place for standing.' Then he departed until he arrived at Wadi Muhassir. Then he stuck his she-camel and she trotted until he passed the valley. Then he stopped and took Al-Fadl as a companion rider and went to the Jamrah to stone it. Then he went to Al-Manhar and said: 'This is Al-Manhar, and all of Mina is a place for sacrifice.' A young girl from Khath'am came to ask him for a verdict, she said: 'Indeed my father is an elderly man who has lived until Allah has made Hajj obligatory, so would he be rewarded if I perform Hajj for him? He said: 'Perform Hajj for your father.'\" He said: \"And he turned the neck of Al Fadl. So Al-Abbas said: 'O Messenger of Allah! Why did you turn the neck of your cousin?' He said: 'I saw a young man and a young woman, and they were not safe from Shaitan.' A man came to him and said, 'O Messenger of Allah! I performed (Tawaf) Al-Ifadah before shaving.' He said: 'Shave, and there is no harm'\" - or: 'Clip and there is no harm'\" He said: \"Someone else came and said: 'O Messenger of Allah! I did the sacrifice before stoning.' So he said: 'Stone, and there is no harm.'\" He said: \"Then he went to the House (Ka'bah) to perform Tawaf around it, then he went to Zamzam and said: 'O tribe of Abdul-Muttalib! If it were not that the people would rush upon you then I would remove it",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 78
			}
		}
	]
}