{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"13": "The Book of Forgetfulness (In Prayer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1352,
			"arabicnumber": 1352,
			"text": "হাদিস একাডেমি নাম্বারঃ ১৩৫২, আন্তর্জাতিক নাম্বারঃ ১৩৫৩ ১৩৫২. মুহাম্মাদ ইবনু বাশশার (রহ.) ..... জুওয়াইরিয়াহ্ বিনতু হারিস (রাঃ) হতে বর্ণিত। নবী (সা.) তাঁর নিকট দিয়ে গেলেন। তখন তিনি মসজিদে দু'আ করছিলেন। পুনরায় প্রায় দ্বি-প্রহরের সময় তাঁর কাছ দিয়ে গেলেন, তখন তাঁকে বললেন, তুমি তোমার আগের ন্যায় এখনও রয়ে গেছ? তিনি বললেন, হ্যাঁ; রাসূলুল্লাহ (সা.) বললেন, আমি কি তোমাকে শিক্ষা দিব না, অর্থাৎ এমন কিছু দু'আ যেগুলো তুমি বলতে পার? “সুবহা-নাল্ল-হি ‘আদাদা খলকিহী সুবহা-নাল্ল-হি ‘আদাদা খলকিহী সুবহা-নাল্ল-হি ‘আদাদা খলকিহী, সুবহা-নাল্ল-হি রিযা- নাফসিহী সুবহা-নাল্ল-হি রিযা- নাফসিহী সুবহা-নাল্ল-হি রিযা- নাফসিহী, সুবহা-নাল্ল-হি যিনাতা ‘আরশিহী সুবহা-নাল্ল-হি যিনাতা ‘আরশিহী সুবহা-নাল্ল-হি যিনাতা ‘আশিহী, সুবহা-নাল্ল-হি মিদা-দা কালিমা-তিহী সুবহা-নাল্ল-হি মিদা-দা কালিমা-তিহী সুবহা-নাল্ল-হি মিদা-দা কালিমা-তিহী” (পবিত্রতা ও প্রশংসা আল্লাহরই তার সৃষ্টির সংখ্যানুপাতে, পবিত্রতা ও প্রশংসা আল্লাহরই তার সৃষ্টির সংখ্যানুপাতে, পবিত্রতা ও প্রশংসা আল্লাহরই তার সৃষ্টির সংখ্যানুপাতে। আল্লাহর পবিত্রতা তাঁর সন্তুষ্টি পরিমাণ, আল্লাহর পবিত্রতা তার সন্তুষ্টি পরিমাণ, আল্লাহর পবিত্রতা তার সন্তুষ্টি পরিমাণ। আল্লাহর পবিত্রতা তাঁর আরশের ওজন অনুপাতে, আল্লাহর পবিত্রতা তাঁর আরশের ওজন অনুপাতে, আল্লাহর পবিত্রতা তার আরশের ওজন অনুপাতে। আর আল্লাহর পবিত্রতা তাঁর কালিমাসমূহের কালি অনুসারে, আর আল্লাহর পবিত্রতা তার কালিমাসমূহের কালি অনুসারে, আর আল্লাহর পবিত্রতা তার কালিমাসমূহের কালি অনুসারে।)* * এ হাদীসটি মুসলিম-এর বর্ণনায় শব্দগুলো সংক্ষিপ্ত এভাবে এসেছে। তাই নিম্নোল্লেখিতভাবে পড়লেও চলবে- “সুবহা-নাল্লা-হি ওয়াবি হামদিহি আদাদা খল্‌কিহি ওয়া রিযা- নাফসিহি ওয়াযিনাতা আরশিহি ওয়ামি দা-দা কালিমা-তিহি\", সহীহ: মুসলিম ২৭২৬, বুখারী’র “আদাবুল মুফরাদ” ৬৪৭, তিরমিযী ৩৫৫৫, ইবনু মাজাহ ৩৮০৮, সহীহ ইবনু খুযায়মাহ ৭৫৩।",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 174
			}
		}
	]
}