{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"6": "The Book of the Times (of Prayer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 513,
			"arabicnumber": 513,
			"text": "হাদিস একাডেমি নাম্বারঃ ৫১৩, আন্তর্জাতিক নাম্বারঃ ৫১৪ ৫১৩. ইউসুফ ইবনু ওয়াযিহ (রহ.)…. জাবির ইবনু আবদুল্লাহ (রাঃ) হতে বর্ণিত। জিবরীল আলায়হিস সালাম নবী (সা.)-কে সালাতের ওয়াক্ত শিক্ষা দেয়ার জন্যে আসলেন। তারপর জিবরীল আলায়হিস সালাম সামনে দাঁড়ালেন এবং রাসূলুল্লাহ (সা.) তার পিছনে এবং অন্যান্য লোকেরা দাঁড়ালেন রাসূলুল্লাহ (সা.) -এর পিছনে। এরপর যুহরের সালাত আদায় করলেন যখন সূর্য ঢলে পড়ল। আবার যখন প্রত্যেক বস্তুর ছায়া তার বরাবর হলে তখন জিবরীল আলায়হিস সালাম আসলেন এবং পূর্বের মতো তিনি আগে দাঁড়ালেন, আর রাসূলুল্লাহ (সা.) ও তার পিছনে এবং অন্যান্য লোকেরা রাসূলুল্লাহ (সা.) -এর পিছনে (সারিবদ্ধ হয়ে) দাড়িয়ে গেলেন। (এভাবে) আসরের সালাত আদায় করলেন। পুনরায় সূর্যাস্তের পর জিবরীল আলায়হিস সালাম আসলেন এবং সামনে দাঁড়ালেন। রাসূলুল্লাহ (সা.) তার পিছনে এবং অন্যান্য লোকেরা রাসূলুল্লাহ (সা.) -এর পিছনে দাঁড়িয়ে মাগরিবের সালাত আদায় করলেন। আবার সূর্যাস্তের পর যখন লালিমা অদৃশ্য হয়ে গেল তখন জিবরীল আলায়হিস সালাম আসলেন এবং সামনে দাঁড়ালেন। রাসূলুল্লাহ (সা.) তার পিছনে দাঁড়ালেন এবং লোকগণ রাসূলুল্লাহ (সা.) -এর পিছনে দাঁড়িয়ে গেলেন। এভাবে ‘ইশার সালাত আদায় করলেন। আবার ভোর হওয়ার পরে জিবরীল আলায়হিস সালাম আসলেন এবং সামনে দাঁড়ালেন। রাসূলুল্লাহ (সা.) তার পিছনে ও অন্যান্য লোকেরা রাসূলুল্লাহ (সা.) -এর পিছনে দাঁড়িয়ে ফজরের সালাত আদায় করলেন। তারপর দ্বিতীয় দিন আসলেন যখন লোকের ছায়া তার সমান হলো। তখন গত দিন যেরূপ করা হয়েছিল সেরূপ করা হলো। তারপর যুহরের সালাত আদায় করলেন। পরে আবার তিনি আসলেন যখন লোকের ছায়া তার দ্বিগুণ হল তখন গত দিনের ন্যায় ‘আসরের সালাত আদায় করলেন। পুনরায় আসলেন যখন সূর্য অস্তমিত হয়ে গেল, তখন গত দিনের মতো মাগরিবের সালাত আদায় করলেন। পরে আমরা ঘুমিয়ে পড়লাম। ঘুম হতে জাগ্রত হলাম, আবার ঘুমিয়ে ঘুম হতে জাগ্রত হলাম। তারপর তিনি এসে আগের মতো ‘ইশার সালাত আদায় করলেন। পুনরায় আসলেন যখন ভোর হল এবং (আকাশে) তারকাগুলো দৃশ্যমান ছিল। তখনো পূর্বের ন্যায় ফজরের সালাত আদায় করলেন। তারপর বললেন, উভয় দিনের সালাতের মধ্যবর্তী সময় সালাতের জন্যে নির্ধারিত।",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 20
			}
		}
	]
}