{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"6": "The Book of the Times (of Prayer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 597,
			"arabicnumber": 597,
			"text": "হাদিস একাডেমি নাম্বারঃ ৫৯৭, আন্তর্জাতিক নাম্বারঃ ৫৯৮ ৫৯৭. ‘আবদাহ্ ইবনু আবদুর রহীম (রহ.) ..... কাসীর ইবনু কারাওয়ান্দা (রহ.) হতে বর্ণিত। তিনি বলেন, আমরা সফরে সালাত সম্পর্কে সালিম ইবনু আবদুল্লাহ-কে প্রশ্ন করলাম যে, আপনার পিতা আবদুল্লাহ (রাঃ) সফরে একাধিক সালাত একত্রে আদায় করেছেন কি? জবাবে বললেন, না, মুযদালিফাহ ব্যতীত অন্য কোথায়ও একত্রে সালাত আদায় করেননি। পুনরায় (সতর্ক হয়ে ঘটনার উল্লেখ করে বললেন, সফিয়্যাহ্ (রাঃ) ‘আবদুল্লাহ (রাঃ)-এর স্ত্রী ছিলেন, সফিয়্যাহ্ (রাঃ) তার কাছে খবর পাঠালেন যে, আমি দুনিয়ার জীবনের শেষ দিনে এবং আখিরাতের প্রথম দিনে উপনীত হয়েছি। সংবাদ পাওয়া মাত্রই তিনি সওয়ারীতে আরোহণ করলেন, আমিও তার সাথে ছিলাম। তিনি খুব দ্রুত বেগে চললেন। পরে যখন সালাতের সময় হলো, মুয়াযযিন বললেন, হে ‘আবদুর রহমান! সালাত আদায় করুন। তিনি সামনে অগ্রসর লাগলেন। যখন তিনি দুই সালাতের মাঝামাঝি সময়ে পৌছলেন তখন সওয়ারী হতে নেমে মুয়াজ্জিনকে বললেন, ইকামত দাও এবং যখন যুহরের সালাত শেষ করি তখন আবার সেখানে দাঁড়িয়েই ইকামত বলবে। ইক্বামাত বলা হলে যুহরের দু' রাক'আত আদায় করলেন। আবার সেখানেই ইকামত দিলে ‘আসরের দু’ রাক’আত সালাত আদায় করে বাহনে আরোহণ করলেন এবং সূর্য অস্ত যাওয়ার পূর্ব পর্যন্ত দ্রুত চললেন। আবার মুয়াযযিন বললেন, হে ‘আবদুর রহমান! সালাত আদায় করুন। তিনি বললেন, পূর্বের মতোই কাজ কর বলে সামনে অগ্রসর হতে লাগলেন। তারপর যখন আকাশে ঘন তারকারাজি দেখা গেল তখন সওয়ারী হতে নেমে ইক্বামাতের আদেশ দিলেন। বললেন, যখন সালাম ফিরাবে আবার ইকামত দিবে। তারপর মাগরিবের তিন রাকআত আদায় করলেন। আবার ইকামত হলে ‘ইশার সালাত আদায় করলেন। তারপর একদিকে সালাম ফিরিয়ে বললেন, রাসূলুল্লাহ (সা.) বলেছেন: যখন তোমাদের কারো সম্মুখে এমন কোন জটিল কাজ দেখা দেয়, যা ছুটে যাওয়ার ভয় থাকে, তখন এভাবেই সালাত আদায় করবে। সহীহ: বুখারী ১৮০৫। [দ্রঃ ৫৮৮]",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 104
			}
		}
	]
}