{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"8": "The Book of the Masjids"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 702,
			"arabicnumber": 702,
			"text": "হাদিস একাডেমি নাম্বারঃ ৭০২, আন্তর্জাতিক নাম্বারঃ ৭০৩ ৭০২. ইমরান ইবনু মূসা (রহ.) ..... আনাস ইবনু মলিক (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ (সা.) যখন মদীনায় আসলেন তখন তিনি মদীনার এক পাশে বানু আমর ইবনু আওফ নামক এক গোত্রে নামলেন। তিনি তথায় চৌদ্দ দিন অবস্থান করেন। তারপর তিনি বানু নাজ্জারের লোকেদের নিকট সংবাদ পাথালে তাদের নেতৃস্থানীয় লোকেরা তাদের গলায় তলোয়ার ঝুলিয়ে এলো। রাবী বলেন, আমি যেন এখনো রাসূলুল্লাহ (সা.)-কে তার বাহনের উপর এবং আবূ বাকর (রাঃ)-কে তাঁর বাহনের পিছনে দেখতে পাচ্ছি। আর বানূ নাজ্জারের নেতারা তার চারদিকে চলতে থাকলো। অবশেষে তিনি আবু আইয়ুব (রাঃ)-এর ঘরের সম্মুখে নামলেন। তিনি সালাতের সময় যেখানেই থাকতেন সেখানেই সালাত আদায় করতেন। তারপর তাকে মসজিদ তৈরি করার আদেশ দেয়া হলে তিনি নাজ্জার গোত্রের নেতৃস্থানীয় লোকেদের কাছে লোক পাঠালেন। তারা আগমন করলে তিনি বললেন, হে বানূ নাজ্জার-এর লোক সকল! তোমরা তোমাদের এ বাগানটি আমার কাছে বিক্রয় কর। তারা বলল, আল্লাহর কসম! আমরা এর মূল্য গ্রহণ করব না। এর মূল্য আমরা একমাত্র আল্লাহ তা'আলার কাছে চাইব। আনাস (রাঃ) বলেন, তথায় মুশরিকদের কবর, ভাঙ্গা গৃহ এবং খেজুর গাছ ছিল। রাসূলুল্লাহ (সা.) আদেশ করলে মুশরিকদের কবরের লাশ (হাড়) স্থানান্তর করা হল আর খেজুর গাছ কেটে ফেলা হল এবং ভাঙ্গা ঘরগুলো ভেঙ্গে সমান করে দেয়া হলো। সাহাবীগণ খেজুর গাছগুলো কা'বার দিকে সারিবদ্ধ করে রাখলেন এবং পাথর স্থাপন করে দরজার চৌকাঠ নির্মাণ করলেন এবং শিলা খণ্ডগুলোকে সরাতে লাগলেন। তারা কাজের উদ্দীপনার (বৃদ্ধির) জন্যে কবিতা আবৃত্তি করছিলেন। রাসূলুল্লাহ (সা.) ও তাদের সাথে ছিলেন তারা বলতে লাগলো, “হে আল্লাহ! আখিরাতের কল্যাণই প্রকৃত কল্যাণ, আপনি আনসার ও মুহাজিরদেরকে সাহায্য করুন। সহীহ: বুখারী ৪২৮, ৩৯৩২; মুসলিম ৫২৪, সহীহ আবু দাউদ ৪৭৭-৪৭৮।",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 15
			}
		}
	]
}