{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"10": "The Book of Leading the Prayer (Al-Imamah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 834,
			"arabicnumber": 834,
			"text": "হাদিস একাডেমি নাম্বারঃ ৮৩৪, আন্তর্জাতিক নাম্বারঃ ৮৩৫ ৮৩৪. আব্বাস ইবনু আবদুল আযীম আল আম্বারী (রহ.)….. উবায়দুল্লাহ ইবনু আব্দুল্লাহ (রহ.) হতে বর্ণিত। তিনি বলেন, আমি ‘আয়িশাহ্ (রাঃ) -এর নিকট গিয়ে বললাম, আপনি কি আমাকে রাসূলুল্লাহ (সা.) -এর রোগ সম্পর্কে জানাবেন না? তিনি বললেন, রাসূলুল্লাহ (সা.)-এর রোগ যখন বেড়ে গেল তখন তিনি বললেন, লোকেরা কি সালাত আদায় করেছে? আমরা বললাম, না, হে আল্লাহর রসূল! তারা আপনার প্রতিক্ষা করছে, তিনি (সা.) বললেন, আমার জন্যে পাত্রে কিছু পানি রাখ। আমরা তা রাখলে তিনি গোসল করলেন এবং মসজিদে যাওয়ার ইচ্ছা করলেন। ইত্যবসরে তিনি (সা.) সংজ্ঞাহীন হন। তারপর কিছুটা সুস্থ হয়ে বললেন, লোকেরা কি সালাত আদায় করেছে? আমরা বললাম, না, হে আল্লাহর রসূল! তারা আপনার প্রতিক্ষা করছে। তিনি (সা.) বললেন, আমার জন্যে পাত্রে কিছু পানি রাখ। আমরা যখন পানি রাখলাম তখন তিনি গোসল করলেন। তারপর দাঁড়াবার ইচ্ছা করলেন আবার তিনি সংজ্ঞাহীন হয়ে পড়েন। এরপর তৃতীয়বারও তিনি ঐরূপ বললেন। আয়িশাহ্ (রাঃ) বলেন, তখন লোকেরা মসজিদে ‘ইশার সালাতের জন্যে রাসূলুল্লাহ (সা.) -এর প্রতিক্ষা করছিলেন। তখন রাসূলুল্লাহ (সা.) আবূ বাকর (রাঃ) এর নিকট লোক পাঠিয়ে লোকেদের নিয়ে সালাত আদায় করতে বললেন। সে লোক এসে তাকে খবর দিল যে, রাসূলুল্লাহ (সা.) এ আপনাকে লোকেদের নিয়ে সালাত আদায় করতে বলেছেন। আবূ বাকর (রাঃ) ছিলেন কোমল হৃদয়ের লোক। তিনি ‘উমার (রাঃ)-কে বললেন, হে ‘উমার! লোকেদের নিয়ে সালাত আদায় করুন। তিনি বললেন, এ কাজের জন্যে আপনিই উপযুক্ত। তারপর আবূ বাকর (রাঃ) কয়দিন লোকেদের নিয়ে সালাত আদায় করলেন। এরপর রাসূলুল্লাহ (সা.) কিছুটা সুস্থতা অনুভব করলেন এবং তিনি দু’জন লোকের কাঁধে ভর করে যুহরের সালাতের জন্যে আসলেন। তাঁদের একজন ছিলেন আব্বাস (রাঃ)। যখন আবূ বাকর (রাঃ) তাকে দেখলেন তখন তিনি পিছে হটতে চাইলেন, তখন রাসূলুল্লাহ (সা.) তাঁকে ইশারায় পিছে হটতে নিষেধ করলেন এবং এ দুই ব্যক্তিকে আদেশ করলে তারা তাকে আবূ বাকর (রাঃ)-এর পাশে বসিয়ে দিলেন। তখন আবূ বাকর (রাঃ) দাড়িয়ে সালাত আদায় করলেন। আর লোকেরা আবু বাকর (রাঃ)-এর অনুসরণ করছিলেন। আর রাসূলুল্লাহ (সা.) বসে সালাত আদায় করছিলেন। বর্ণনাকারী বলেন, তারপর আমি ইবনু আব্বাস (রাঃ) -এর কাছে গিয়ে বললাম, 'আয়িশাহ্ (রাঃ) আমাকে রাসূলুল্লাহ (সা.)-এর সম্বন্ধে যা বলেছেন, তা কি আপনার কাছে বর্ণনা করব? তিনি বললেন, হ্যা। আমি তার কাছে বর্ণনা করলাম। তিনি তার কোন কিছুই অস্বীকার করলেন না। তবে তিনি বললেন, তিনি তোমার কাছে ঐ ব্যক্তির নাম বলছেন কি? যিনি ‘আব্বাস (রাঃ)-এর সঙ্গে ছিলেন? আমি বললাম, না। ইবনু আব্বাস (রাঃ) বললেন, তিনি ছিলেন ‘আলী (রাঃ)। সহীহ: বুখারী ৬৮৭, মুসলিম ৪১৮।",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 58
			}
		}
	]
}