{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"11": "Friday Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 876,
			"arabicnumber": 876,
			"text": "Ebu Hureyre (Radiyallahu Anh) Resûlullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu işitmiştîr: \"Bizler en son gelenleriz, fakat kıyamet gününde herkesin önünde bulunan ilkler olacağız. Hem de bizim dışımızdaki ümmetlere biz'den daha önce kitap verildiği halde... Aslında şu içinde bulunduğumuz Cum'a gününü Allah onlara farz kılmıştı (onlar için kutsal gün olarak belirlemişti), fakat onlar bu konuda görüş ayrılığına düştüler. Allah bizlere bu gün'ü (mübarek gün olarak) lütfetti. Dolayısıyla diğer ümmetler (kendileri için kutsal olan gün itibariyle) bize tabidirler. Şöyle ki; Yahudilerin (kutsal günü olan Cumartesi) yarındır, Hıristiyanların (kutsal günü olan Pazar ise) yarından sonraki gündür",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 877,
			"arabicnumber": 877,
			"text": "Abdullah İbn Ömer (Radiyallahu Anh) Resulullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmiştir: İçinizden kim Cum'a namazına gelirse boy abdesti alsınl. Tekrar; 894 ve 919",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 878,
			"arabicnumber": 878,
			"text": "Abdullah İbn Ömer (Radiyallahu Anh)'den nakledilen bir rivayet şöyledir: \"Ömer bir Cum'a günü ayakta hutbe îrad ederken ilk olarak hicret edenlerden bir sahabî mescid'e girmişti. Bunun üzerine Ömer ona seslenerek: Hiç vakitten haberin var mı senin?!' demişti. O sahabî: 'Bazı işlerim vardı, daha evime varmadan ezan'ın okunduğunu işittim ve hatta bu telaş içinde sadece abdest alarak mescid'e gelmek durumunda kaldım' deyince Ömer (r.a.) ona şöyle mukabelede bulundu; (Namaz'a geç kaldığın yetmiyormuş gibi) bir de sadece abdest almakla yetindin öyle mi! Halbuki Resulullah Sallallahu Aleyhi ve Sellem'in Cum'a günü boy abdesti almayı emrettiğini biliyorsun",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 879,
			"arabicnumber": 879,
			"text": "Ebu Saîd el-Hudrî (Radiyallahu Anh) Resulullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmiştir: \"Cum'a günü boy abdesti (ğusül) almak ihtilam olan (ergenlik çağına giren) herkese vaciptir",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 880,
			"arabicnumber": 880,
			"text": "Amr İbn Süleym'den nakledilmiştir: \"Şehadet ederim ki Ebu Saîd el-Hudrî (r.a.) şöyle dedi: Şehadet ederim ki Resûlullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Cum'a günü boy abdesti almak ergenlik çağına giren herkese vaciptir.. Dişleri misvaklamak ve eğer bulunabilirse güzel koku sürünmek gereklidir,\" Bu hadisin ravilerinden Amr İbn Süleym şöyle demiştir: \"Yeminle söylüyorum ki, boy abdesti almak vaciptir. Fakat dişleri misvaklamak ve güzel koku sürünmek konusunda kesin bir şey söyleyemem; vacip olup olmadığını Allah daha iyi bilir. Fakat hadîs-i şerîf böyle nakledilmiştir",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 881,
			"arabicnumber": 881,
			"text": "Ebu Hureyre (r.a.) Resulullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmiştir: Cum'a günü cünüp olduğu için boy abdesti alan ve (herkes'ten önce) namaz'a gelen kimseler sanki bir deveyi Allah yolunda tasadduk etmiş gibi sevap alırlar. Onlardan sonra gelenler bir sığırı, daha sonra gelenler boynuzlu bir koçu, ardından gelenler bir tavuğu ve en sona gelenler bir yumurtayı Allah yolunda tasadduk etmiş gibi sevap alırlar, İmam (hutbe için) çıktığında melekler okunan zikri dinlemek üzere oraya toplanırlar",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 882,
			"arabicnumber": 882,
			"text": "Ebu Hureyre'den nakledilmiştir: \"Bir Cum'a günü Ömer hutbe okurken mescid'e birisi girdi. Ömer (Radiyallahu Anh): Sizler niçin Cum'a namazına böyle geç kalırsınız? deyince adam şöyle bir cevap verdi: 'Ben ezanı duyar duymaz abdest aldım ve hemen namaz'a geldim. (Bu cevap Ömer'in pek hoşuna gitmedi) ve: \"Siz Resulullah Sallallahu Aleyhi ve Sellem'in: İçinizden birisi Cum'a namazına gelecek olursa boy abdesti alsın, diye buyurduğunu hiç duymadınız mı?\" dedi",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 883,
			"arabicnumber": 883,
			"text": "Selmân-ı Fârisî (Radiyallahu Anh) Resûlullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmiştir: \"Cum'a günü boy abdesti alıp mümkün olduğu kadar vücudunu iyice temizlemeye çalışan, ardından saçlarını yağlayan veya evinde bulunan güzel kokudan vücuduna süren ve daha sonra evinden çıkıp mescid'e gelerek safları yarmadan kendisine takdir edilen namazı kılan ve imam'ın okuduğu hutbeyi hiç sesini çıkarmadan kimseyle konuşmadan can kulağı ile dinleyen herkesin bu Cum'a ile diğer Cuma arasındaki günahları bağışlanır. Tekrar: 910",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 884,
			"arabicnumber": 884,
			"text": "Bir defasında Tavus Abdullah İbn Abbâs'a: \"Bazıları Resûlullah Sallallahu Aleyhi ve Sellem'in Cum'a günleri cünüp olmasanız bile boy abdesti alın ve başlarınızı yıkayın. Ayrıca vücudunuza güzel koku da sürün, diye buyurduğunu söylüyorlar. Bu rivayet doğru mudur?\" diye sormuş ve ondan şu cevabı almıştır: \"Boy abdesti konusunda Resûlullah Sallallahu Aleyhi ve Sellem gerçekten de böyle bu­yurmuştur, fakat güzel kokuyla ilgili olarak bir şey söylediğini bilmiyorum",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 885,
			"arabicnumber": 885,
			"text": "Tavus'tan nakledilmiştir: \"İbn Abbâs (Radiyallahu Anh) Resûlullah Sallallahu Aleyhi ve Sellem'in Cum'a günü boy abdesti alınmasıyla ilgili sözünü zikredince kendisine; 'Peki o gün eğer varsa eşine ait güzel koku veya yağı sürünmesi gerekir mi?' diye sordum. Buna şöyle cevap verdi: \"Bu konuyu bilmiyorum",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 886,
			"arabicnumber": 886,
			"text": "Abdullah İbn Ömer (Radiyallahu Anh)'den nakledilmiştir: \"Bir gün Ömer (Radiyallahu Anh) mescid'in kapısında (Utârid İbn Hâcib tarafından) satılığa çıkarılmış ipek bir elbise gördü ve Resûlullah Sallallahu Aleyhi ve Sellem'e: Ey Allah'ın Resulü keşke şu ipek elbiseyi satın alsanız ve Cum'a günleri ile heyetleri kabul ettiğiniz günlerde giyseniz!\" dedi. Bunun üzerine Resûlullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Bu elbiseyi ancak âhirette bundan hiçbir nasibi olmayan kimseler giyer.\" Daha sonraki günlerde Resûlullah Sallallahu Aleyhi ve Sellem'e ipek elbiseler getirildi ve Resûlullah Sallallahu Aleyhi ve Sellem bunlardan birini Ömer'e verdi. Hz. Ömer: \"Ey Allah'ın Resulü, Utarid'in sattığı ipek hakkında o sözü sarf etmiştiniz ama bana giymem için bu ipeği veriyorsunuz\" deyince Nebi Sallallahu Aleyhi ve Sellem şöyle bu­yurdu: \"Ben bu ipeği sana giyesin diye vermiyorum ki... Bunun üzerine Ömer, elbiseyi Mekke'de bulunan ve henüz Müslüman olmayan müşrik bir kardeşine hediye etti. Tekrar: 948, 2104, 2612, 2619, 3054, 5841, 5981 ve 6081 Diğer Tahric: Müslim libas; Ebû Dâvûd. Salat, Libas; Nesaî, iydeyn, zîne; Ahmed b. Hanbel I 46-49, II 20. 24, 39, 49 51, 68, 289, 329,337,111. 103. 114. 127., 146 V45, VI 288. dede var",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 887,
			"arabicnumber": 887,
			"text": "Ebu Hureyre (Radiyallahu Anh) Resûlullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmiştir: \"Ümmetime veya insanlara sıkıntı verme endişesi taşımasaydım onlara her namaz öncesinde dişlerini misvakla temizlemelerini emrederdim. Tekrar: 7240",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 888,
			"arabicnumber": 888,
			"text": "Enes İbn Mâlik (r.a.) Resûlullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmiştir: Misvak kullanmanız gerektiğini size o kadar çok söyledim ki",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 889,
			"arabicnumber": 889,
			"text": "Huzeyfe şöyle demiştir: \"Resûlullah Sallallahu Aleyhi ve Sellem geceleri namaza kalktığında ağzını misvak ile temizlerdi",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 890,
			"arabicnumber": 890,
			"text": "Aişe (Radiyallahu Anha)'dan rivayet edilmiştir: \"Resûl-i Ekrem Sallallahu Aleyhi ve Sellem hasta iken Abdurrahmân İbn Ebi Bekir zi­arete gelmişti, içeriye giren Abdurrahmân'in elinde dişlerini temizlediği bir misvak vardı. Resûlullah Sallallahu Aleyhi ve Sellem onun elindeki misvak'a bakakaldı. Ben bunu fark edince Abdurrahman'dan misvağı bana vermesini istedim. Abdurrahman'dan aldığım misvağı kırıp ucunu dişlerimle ezerek yumuşattıktan sonra Resûlullah Sallallahu Aleyhi ve Sellem'e verdim. Resûl-i Ekrem (Sallallahu aleyhi ve Sellem) de göğsüme yaslanmış iken dişlerini bu misvakla temizlemeye koyuldu. Tekrar: 1389, 3100, 3774, 4438, 4449, 4450, 4451, 5217 ve 6510",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 891,
			"arabicnumber": 891,
			"text": "Ebu Hureyre r.a. dediki: Resulullah (Sallallahu aleyhi ve Sellem) (Efendimiz) cum`a günü sabah namaz(ının ilk rek`at) ında آلم تنزيل (Secde) (ikinci rek`atinde de) هل أتى على الإنسان (insan suresini) okurlardı. Diğer tahric: Tirmizi kitabu’l-Cum’a",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 892,
			"arabicnumber": 892,
			"text": "İbn Abbâs (Radiyallahu anh)'dan nakledilmiştir: \"Resûlullah Sallallahu Aleyhi ve Sellem'in mescidinden sonra Cum'a namazı ilk olarak Bahreyn'in Cuvâsâ köyündeki Abdü'l-kays mescidinde kılınmıştır. Tekrar: 4371",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 893,
			"arabicnumber": 893,
			"text": "İbn Ömer (r.a.)'den nakledilmiştir: \"Resûlullah Sallallahu Aleyhi ve Sellem Hepiniz çobansınız, buyurdu.\" Leys İbn Sa'd şöyle bir ek bilgi vermiştir: \"Yûnus İbn Yezîd şöyle dedi: Rüzeyk İbnü'I-Hukeym İbn Şihâb'a - ki o sırada ben de onunla birlikte idim - bir mektup yazarak, Cum'a namazını işi dolayısıyla bulunduğu Vadi'l kura'da kıldırmasının caiz olup olmadığını sormuştu. Rüzeyk orada arazilerin ekip biçilmesi için görevlendirilmişti ve maiyetindekilerle birlikte çalışıyordu. Rüzeyk o günlerde Eyle'de (Kızıl Denizin kuzeyinde bir köy) görevli bir memurdu. İbn Şihâb cevabî mektubu yazarken ben yine oradaydım ve yazdıklarını duydum. Mektupta İbn Şihâb, Rüzeyk'e Cum'a namazını kıldırmasını emrediyordu. Hatta delil olarak şu rivayeti zikretmişti: \"Salim bana Abdullah İbn Ömer'in şöyle dediğini haber verdi: Resûlullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu işittim: Hepiniz yükümlülükleri olan birer çobansınız. Her biriniz himayeniz altında bulunan ve bakmakla yükümlü olduğunuz kişilerden ve işlerden sorumlusunuz; Devlet başkanı yönetici bir çobandır ve tebasmdan sorumludur, erkekler birer çobandır ve eşlerinden sorumlu­dur, kadınlar birer çobandır ve ailesindekilerden sorumludur, hizmetçiler efendilerinin mallarını korumakla yükümlü birer çobandır ve korumakla yükümlü oldukları mallardan sorumludur.\" Hadisin ravilerinden Salim İbn Abdullah şöyle demiştir: \"Sanırım Resûlullah Sallallahu Aleyhi ve Sellem şunları da söyledi: \"Kişi babasının malını koruyup gözetmekle yükümlüdür ve bunlardan sorumludur. Hepiniz yükümlülükleri olan birer ço­bansınız ve bakmakla yükümlü olduğunuz kişilerden ve işlerden sorumlusunuz. Tekrar: 2409, 2554, 2558, 2751, 5188, 5200 ve 7138",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 894,
			"arabicnumber": 894,
			"text": "Abdullah İbn Ömer (r.a.) dedi ki: Resûlullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu işittim: \"içinizden her kim Cum'a namazına gelirse boy abdesti alsın",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 895,
			"arabicnumber": 895,
			"text": "Ebu Saîd el-Hudrî (Radiyallahu Anh) Resûlullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmiştir: \"Cum'a günü boy abdesti (ğusül) almak ihtilam olan herkese vaciptir",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 897,
			"arabicnumber": 897,
			"text": "",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 898,
			"arabicnumber": 898,
			"text": "Ebu Hureyre (r.a.) (yukarıdaki hadisi’e ek olarak) Sonra da şöyle dedi: \"Her Müslümanın her haftada bir gün boy abdesti alması gereklidir; o gün başını ve vücudunu iyice yıkar. Tekrar: 898 vs 3487 [-898-] Ebu Hureyre'den nakledilmiştir: Resûlullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Her müslümanm her haftada bir gün boy abdesti alması Allah'ın onlar üzerindeki bir hakkıdır",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 899,
			"arabicnumber": 899,
			"text": "Abdullah Ibn Ömer (r.a.) Resûlullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmiştir: Kadınların geceleri mescidlere gelmelerine müsaade ediniz",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 900,
			"arabicnumber": 900,
			"text": "İbni Ömer (r.a.) şöyle demiştir: Ömer (r.a.)'in eşi sabah ve yatsı namazlarını cemaatle kılmak üzere mescide gelirdi. Birisi kendisine: Ömer'in hoşuna gitmediği ve kıskanç bir erkek olduğunu bildiğin halde niçin mescide gelmek üzere dışarı çıkıyorsun? diye sorduğunda ona şöyle mukabelede bulundu: \"Ömer niçin benim mescide gelmeme engel olmuyor?\" Cevap bekleyen bu soruya bizzat o adam'ın kendisi şu cevab'ı verdi: \"Onu engelleyen Resûl-i Ekrem (Sallallahu aleyhi ve Sellem)'in şu sözüdür: Allah'ın cariyelerinin (kadın kullarının) mescitlere gelmelerine engel olmayın",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 901,
			"arabicnumber": 901,
			"text": "Çok yağmurlu bir günde İbn Abbâs müezzinine şu talimatı verdi: Sen (Eşhedu enne Muhammeden Resulullah) dedikten sonra (Hayya ale's-selah) deme. Bunun yerine (Namazlarınızı evlerinizde kılın) de. Cemaatten bir kısmı bu durumu garipseyip birbirine bakışınca İbn Abâs şöyle dedi; \"Galiba bu söylediklerimi beğenmediniz. Fakat bunun aynısını - Resûlullah Sallallahu Aleyhi ve Sellem'i kasdederek- benden daha hayırlı olan bir zat yapmıştı. Şüphesiz Cuma namazının kılınması kesin bir emirdir (azimet). Fakat ben sizi sıkıntıya sokmak istemedim. Eğer namaza gelmenizi emredecek olsaydım bu çamurların içinde bata çıka yürümek zorunda kalacak­tınız",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 902,
			"arabicnumber": 902,
			"text": "Aişe (r.anha)'dan nakledilmiştir: \"Resûlullah Sallallahu Aleyhi ve Sellem zamanında insanlar gerek evlerinden gerekse Medine'ye dört mil mesafedeki veya daha uzak bölgelerdeki yerleşim birimlerinden (avali) nöbet usulüyle Cum'a namazına gelirlerdi. Bunlar namaza üstleri başları toz içinde gelirlerdi. Terledikleri için toz toprak vücutlarına iyice yapışırdı ve bedenlerinden ter kokusu yayılırdı. Bir defasında bunlardan birisi Resûl-i Ekrem Sallallahu Aleyhi ve Sellem'in yanına geldi. Ben de orada bulunuyordum. Nebi Sallallahu Aleyhi ve Sellem şahsa şöyle buyurdu: \"Bari bu gün için iyice temizlenseniz, ne kadar iyi olur",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 903,
			"arabicnumber": 903,
			"text": "Aişe (Radiyallahu Anha) şöyle demiştir: \"Asr-ı saadette insanlar kendi işlerini kendileri görürdü. Cum'a namazına da (üstlerini başlarını değiştirmeden) işlerini bırakıp aynı halde gelirlerdi Bu yüzden kendilerine: \"Keşke boy abdesti alsanız, yıkansanız\" denildi. Tekrar: 2071",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 904,
			"arabicnumber": 904,
			"text": "Enes İbn Mâlik (r.a.)'den nakledilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem Cum'a namazını güneş tepe noktasını geçip batıya doğru kayınca kıldırırdı",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 905,
			"arabicnumber": 905,
			"text": "Enes İbn Mâlik (r.a.) şöyle demiştir: \"Biz Cum'a namazını biraz erken kılar ve daha sonra kaylule (öğleden sonraki gündüz) uykusuna yatardık. Tekrar: 940",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 906,
			"arabicnumber": 906,
			"text": "Enes İbn Mâlik (r.a.), Cum'a namazını kasdederek şöyle demiştir: \"Resulullah Sallallahu Aleyhi ve Sellem hava çok soğuk olursa namaz'ı vakit girer girmez kılardı. Havanın aşırı sıcak olması durumunda ise namazı kılmak için hararetin geçip serinliğin düşmesini beklerdi.\" Yunus İbn Bükeyr dedi: Ebu Halde bize bu rivayeti mutlak olarak nakledip Cum'a namazı kaydını zikretmedi: Bişr İbn Sabit dedi: Ebu Halde bize anlattı: \"Bir defasında Cum'a İmamı bize namazı kıldırmış ve sonra Enes İbn Mâlik (r.a.)'e, Resulullah Sallallahu Aleyhi ve Sellem'in öğle namazını nasıl kıldırdığını sormuştu",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 907,
			"arabicnumber": 907,
			"text": "Ubâde İbn Rufâa'dan nakledilmiştir: \"Bir defasında ben Cum'a namazına giderken Ebu Abs arkamdan yetişti ve şunları söyledi: Ben Resulullah (Sallallahu Aleyhi ve Sellem)'in: \"Kimin ayakları Allah yolunda tozlanırsa Allah (c.c.) o kişiyi cehenneme haram kılar. buyurduğunu işittim. Tekrar: 2811",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 908,
			"arabicnumber": 908,
			"text": "Ebu Hureyre (r.a.)'den nakledilmiştir: \"Resulullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu işittim: \"Namaz için kamet getirildiğinde namaz'a aceleyle koşarak gelmeyin. Tam bir vakar ve sükunet içinde yürüyerek gelin; yetişebildiğiniz kadarını kılın, yetişemediğiniz kısmı ise daha sonra tamamlayın",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 909,
			"arabicnumber": 909,
			"text": "Ebu Katâde (r.a.), Resulullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmiştir: \"Beni görünceye kadar ayağa kalkmayın ve üzerinizde tam bir vakar ve sükunet olsun",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 910,
			"arabicnumber": 910,
			"text": "Selmân-ı Fârisî (r.a.) Resûlullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmiştir: Cum'a günü boy abdesti alıp mümkün olduğu kadar vücudunu iyice temizlemeye çalışan, ardından saçlarını yağlayan veya evinde bulunan güzel kokudan vücuduna süren ve daha sonra mescide gelerek saf olan cemaat'ten iki kişinin arasına girmeden kendisine takdir edilen namazı kılan ve imam'ın okuduğu hutbeyi hiç sesini çıkarmadan can kulağı ile dinleyen herkesin bu Cuma ile diğer Cuma arasındaki günahları bağışlanır",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 911,
			"arabicnumber": 911,
			"text": "İbn Ömer (r.a.)'in şöyle dediği nakledilmiştir: \"Resûlullah Sallallahu Aleyhi ve Sellem bir kimsenin kardeşini kaldırarak onun yerine oturmasını yasaklamıştır.\" Bu rivayeti nakledenlerden İbn Cüreyc, İbn Ömer'den nakilde bulunan Nâfi'e: \"Cuma namazında mı?\" diye sorunca ondan: \"Hem Cuma namazında hem de diğer namazlarda’’ cevabını almıştır. Tekrar: 6269 ve 6270. Diğer tahric: Tirmizi, edeb; Müslim: selam",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 912,
			"arabicnumber": 912,
			"text": "Saib İbn Yezîd (r.a.)'in şöyle dediği nakledilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem Ebu Bekir ve Ömer (r.a.) dönemlerinde Cum'a ezanı imam minbere çıkıp oturduğunda okunurdu. Fakat Osman (r.a.) halife olduğunda Medine'de İnsanlar çoğalıp nüfus arttığı için Zevrâ denen yerde üçüncü ezanın ek olarak okunmasını kararlaştırdı. Tekrar: 913, 915, 916",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 913,
			"arabicnumber": 913,
			"text": "Saib Ibn Yezîd'in şöyle dediği nakledilmiştir: \"Cum'a günü ek olarak üçüncü, ezan okunması uygulamasını başlatan Osman'dır. O dönemde Medine'de nüfus arttığı için Osman (Radiyallahu Anh) böyle bir uygulamayı başlatmak zorunda kalmıştı. Daha önceleri Resûlullah Sallallahu Aleyhi ve Sellem'in sadece bir müezzini vardı ve Cuma ezanı imam minbere çıkıp oturunca okunurdu",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 914,
			"arabicnumber": 914,
			"text": "Ebu Ümâme İbn Sehl İbn Hanîfin şöyle dediği nakledilmiştir: \"Muâviye İbn Ebu Süfyân (r.a.)'ın minberde iken okunan ezana mukabelede bulunduğunu işittim. Müezzin, Allahu Ekber, Allahu Ekber dediğinde Muâviye de, Allahu Ekber Allahu Ekber diyordu. Müezzin, Eşhedu en la ilahe İllallah, dediğinde Muâviye, ben de, diyordu. Müezzin, Eşhedu enne Muhammeden Resulullah, dediğinde Muâviye aynı şekilde, ben de, diye mukabele ediyordu. Müezzin ezanı bitirince Muâviye cemaat'e şöyle hitap etmişti: \"Ey insanlar, ben Resul-i Ekrem Sallallahu Aleyhi ve Sellem'in işte bu minberde iken ezan okunduğunda şu anda benden işitmiş olduğunuz ifadeleri aynen tekrar ettiğini kesinlikle duydum",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 915,
			"arabicnumber": 915,
			"text": "İbn Şihâb, Saib İbn Yezîd'in kendisine şu bilgiyi haber verdiğini nakletmiştir: \"Medine'de mescide gelenlerin sayısı artınca Cum'a günü ikinci ezan okunması talimatını Osman vermişti. Halbuki daha önce Cum'a ezanı imam minbere çıkıp oturunca okunurdu",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 916,
			"arabicnumber": 916,
			"text": "Saib İbn Yezîd (r.a.) şöyle demiştir: \"Cum'a günleri ezan'ın okunma vakti Nebi Sallallahu Aleyhi ve Sellem Ebu Bekir ve Ömer dönemlerinde imam'ın hutbe için minbere çıkıp oturduğu an idi. Daha sonra Osman halife olunca insanlar çoğaldığı için üçüncü ezan'ın okunması talimatını verdi. Bu ezan da Zevrâ denen yerde okunuyordu. İşte onun bu talimatı daha sonra yerleşik bir uygulama haline geldi",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 917,
			"arabicnumber": 917,
			"text": "Ebu Hazim İbn Dinar'dan nakledilmiştir: \"Resûlullah Sallallahu Aleyhi ve Sellem'in minberinin hangi ağaç'tan yapıldığı konusunda görüş ayrılığına düşen bir kesim Sehl İbn Sa'd es-Sâidî'ye gelerek minber'in neden yapıldığını sordular. Sehl onlara şu cevabı verdi: \"Allah'a yemin ederim ki, ben bu minber'in hangi ağaç'tan yapıldığını, mescid'e konduğu ilk günü ve Resul-i Ekrem Sallallahu Aleyhi ve Sellem'in üzerine oturduğu ilk günü çok iyi biliyorum. Nebi Sallallahu Aleyhi ve Sellem kölesi marangozlukla meşgul olan bir kadın'a -Sehl bu kadının kim oldu­ğunu söylemişti- haberci göndererek, 'Kölene söyle insanlara hitap ettiğim zaman üzerine oturacağım bir minber yapsın' diye emir buyurmuştu. Kadın da kendisine söylendiği gibi kölesine bu minberi yaptırdı. Köle Resûlullah Sallallahu Aleyhi ve Sellem'in istediği minberi orman'dan temin ettiği ılgın ağacından yapmış ve getirmişti. Kadın bu minberi daha sonra Resûlullah Sallallahu Aleyhi ve Sellem'e gönderdi ve minber Nebi Sallallahu Aleyhi ve Sellem'in istediği yere kondu, işte ben Resul-i Ekrem Sallallahu Aleyhi ve Sellem'in bu minber üzerinde namaz kıldığını ve yine minber'in üzerinde iken tekbir getirdiğini gördüm. Sonra minber'den inmeden rükû etmişti ve ardından geri geri çekilerek minber'den inmişti. Bu şekilde geriye çekildikten sonra minber'in ilk basamağının dibine secde etmiş ve ardından aynı uygulamayı tekrar etmişti. Resûlullah Sallallahu Aleyhi ve Sellem namaz'ı bitirince insanlara dönerek şöyle buyurdu: \"Ey insanlar, ben bu şekilde namaz kıldım ki bana uyasınız ve benim namazımın nasıl olduğunu öğrenesiniz",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 918,
			"arabicnumber": 918,
			"text": "İbn Enes, Câbir Ibn Abdullah'ın şöyle dediğini bizzat işittiğini anlatmıştır: \"Resûlullah Sallallahu Aleyhi ve Sellem'in hutbe sırasında üzerinde durduğu bir hurma kütüğü vardı. Fakat Resûl-i Ekrem Sallallahu Aleyhi ve Sellem için bir minber kurulup artık kütüğe ihtiyaç kalmayınca kütük'ten gebe develerin doğum anındaki iniltilerine benzer sesler duyduk. Nebi Sallallahu Aleyhi ve Sellem minber'den inip kütüğün üzerine elini koyunca iniltiler kesildi",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 919,
			"arabicnumber": 919,
			"text": "Salim'den gelen bilgiye göre babasının, Resûlullah Sallallahu Aleyhi ve Sellem'in üzerinde hutbe îrad ederken: \"Kim Cum'a namazına gelirse boy abdesti alsın da öyle gelsin!\" diye buyurduğunu işitmiştir",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 920,
			"arabicnumber": 920,
			"text": "İbn Ömer'in şöyle dediği nakledilmiştir: \"Sizin tıpkı bugün yaptığınız gibi Resulullah Sallallahu Aleyhi ve Sellem ayakta olduğu halde hutbe îrad ederdi. Sonra biraz oturur ve ardından geri kalkardı. Tekrar: 928. Diğer tahric: Tirmizi Cum’a; Nesaî, Cuma",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 921,
			"arabicnumber": 921,
			"text": "Ebu Saîd el-Hudrî (r.a.)'in şöyle dediği nakledilmiştir: \"Resulullah Sallallahu Aleyhi ve Sellem bir gün minber'in üzerine oturdu ve biz de onun çevresine toplanıp oturduk. Tekrar: 1465, 2842 ve 6327",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 922,
			"arabicnumber": 922,
			"text": "Esma binti Ebu Bekir şöyle demiştir: \"Bir gün Aişe'nin yanına gitmiştim. O sırada ashâb-ı kiram namaz kılıyordu. Ben, niçin bu vakitte namaz kıl­dıklarını Aişe'ye sorunca başıyla göğe işaret etti. Ben, Olağanüstü bir olay mı var, diye tekrar sorunca evet anlamında başını salladı. Resulullah Sallallahu Aleyhi ve Sellem o kadar uzun bir süre bekledi ki neredeyse bayılacaktım. Yanıbaşımda bir kırba dolusu su vardı. Kırbayı açıp serinlemek maksadıyla başıma biraz su döktüm. Resul-i Ekrem Sallallahu Aleyhi ve Sellem namaz'ı bitirdiğinde güneş iyice açılmıştı. Nebi Sallallahu Aleyhi ve Sellem daha sonra cemaat'e dönüp Allah Teâlâ'ya layık olduğu vechile hamd etti ve ardından: \"Emma ba'du (Şimdi asıl konuya gelelim)\" dedi. Ben bu sırada gürültü çıkaran ensardan bir kadın'ı susturmakla meşgul olduğum için Resulullah Sallallahu Aleyhi ve Sellem'in neler söylediğini kaçırmıştım. Bu yüzden Aişe'ye gidip Resul-i Ekrem Sallallahu Aleyhi ve Sellem ne söyledi diye sordum. Bana Resulullah Sallallahu Aleyhi ve Sellem'in. şöyle buyurduğunu söyledi: 'Daha önce bana hiç gösterilmeyen ne varsa hepsini işte şu bulunduğum yerde gördüm. Hatta cennet ve cehennemi bile. Bana, sizlerin kabirlerde Mesih-Deccal’in fitnesi (imtihan vesilesi) gibi - veya bu fitneye yakın bir fitneyle karşılaşacağınız vahyedildi. Siz kabirdeyken yanınıza gelecekler ve beni kasdederek: \"Şu zât hakkında bildiğiniz şeyler nelerdir?\" diye soracaklar. Mu'minler - hadisin ravilerinden Hişâm bunu veya yakın (kesin inanç) sahipleri ifadesiyle de nakletmiştir hemen: \"O Allah'ın Resulüdür, O Muhammed'dir. O bize apaçık delilleri (beyyinât) ve hidayeti getirdi. Biz de ona iman ettik, kendi­sine karşı çıkmadan icabet ettik. Biz ona uyduk ve kendisini tasdik ettik\" diye­cekler. Bunun üzerine onlara: \"Haydi, yaptıklarınızın karşılığını hakkıyla almak üzere huzur içinde uyuyun bakalım! Biz sizin ona iman ettiğinizi zaten biliyorduk \" denecek. Buna karşılık münafıklar hadisin ravilerinden Hişâm bunu veya şüphe eden kimseler ifadesiyle de nakletmiştir kendilerine yöneltilen bu soruya şöyle cevap vereceklerdir: \"Ne bilelim bizi Bir takım insanlar bir şeyler söylüyorlardı ve biz de aynısını söyledik İşte.\" Bu hadisin ravilerinden Hişâm İbn Urve şunları söylemiştir: \"Hadisi kendi­sinden naklettiğim Fâtıma Bİntü'l-Münzir bana bu rivayeti çok sağlam bir şekilde ezberlediğini ve bu hadiste münafıklara çok can yakıcı sert ifadelerle cevap ve-rildiğini de söylemişti",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 923,
			"arabicnumber": 923,
			"text": "Amr İbn Tağlib (r.a.)'den nakledilmiştir: \"Bir defasında Resûlullah (Sallallahu Aleyhi ve Sellem)'e Bahreyn'den bir miktar mal getirilmişti. Resûl-i Ekrem s.a.v. bu malları insanlara dağıtmış, fakat bazılarına hiçbir şey vermemişti. Daha sonra kendilerine pay vermediği kimselerin ileri geri konuştuklarından haberdar olunca onlara hitap etme ihtiyacı duydu ve Allah'a hamd ve sena ettikten sonra şöyle dedi: \"Şimdi asıl konuya gelelim, Allah'a yeminle söylüyorum ki ben bazen birilerine böyle mal veririm, fakat herhangi bir bağışta bulunmadığım ve kendisine mal vermediğim kişileri onlardan daha çok severim. İşte ben bazı insanlara çok sabırsız bir yaratılışta olduklarını ve herhangi bir lütuf olmadığında hemen feryadı bastıklarını bildiğim için böyle ikramda bulunuyorum. Buna karşılık Allah Teâlâ'nm kalplerini hayırla doldurduğu ve gönüllerinde mala karşı tutku bırakmadığı (Allah'tan başka hiç kimseye muhtaç olmama duygusu var ettiği) kimseleri bu özelliklerine ısmarlıyorum. İşte Amr İbn Tağlib bunlar arasındadır.\" Amr İbn Tağlib şöyle demiştir: \"Allah'a yemin ederim ki, Resûlullah Sallallahu Aleyhi ve Sellem'in bu sözünü kızıl deve sürülerine sahip olmaya (dünyalara) değişmem. Tekrar: 3145 ve 7535",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 924,
			"arabicnumber": 924,
			"text": "Urve İbn Zübeyr'den nakledildiğine göre Aişe (Radiyallahu Anha) şöyle demiştir: \"Resûl-i Ekrem Sallallahu Aleyhi ve Sellem bir gece yarısı mescide çıkıp namaz kılmaya başladı ve ashab'dan bir kısmı da ona uyarak namaz kıldı. Sabah olduğunda namaz kılan sahâbîler gece olup bitenleri arkadaşlarına anlattılar ve o gece daha fazla kişi mescide toplanıp Resûlullah Sallallahu Aleyhi ve Sellem ile birlikte namaz kıldı. O gecenin sabahında olup bitenleri öğrenen diğer sahâbîler de mescide gelince üçüncü gecede epey cemaat birikmiş oldu. Nebi Sallallahu Aleyhi ve Sellem yine çıkıp aynı şekilde namazını kılmaya koyuldu. Dördüncü gecede artık mescid tıklım tıklım olduğu için ashabın bir kısmı dışarıda kalmıştı. Bu yüzden Resûlullah (Sallallahu aleyhi ve Sellem) ancak sabah namazı için mescide çıkabildi. Sabah namazını bitirince cemaate döndü ve şehadet getirdikten sonra şöyle buyurdu: Esas konuya gelince, sizin bu istek ve arzunuzun bana gizli kaldığını sanmayın. Ancak ben böyle devam ederseniz bu namazın size farz kıhnabileceğinden ve ondan sonra sizin bu namazı kılmakta gevşeklik göstereceğinizden endişe ediyorum",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 925,
			"arabicnumber": 925,
			"text": "Urve, Ebû Humeyd es-Sâidî'nin kendisine şu bilgiyi haber verdiğini söylemiştir: \"Resûlullah Sallallahu Aleyhi ve Sellem Öğleden sonra bir namazın ardında ayağa kalktı ve şehadet getirip Allah Teâlâ'ya hamd ve sena ettikten sonra şöyl dedi: Emma ba'du.. (bunlardan sonra...-Esas konuya gelince-). Tekrar: 1500, 2597, 6636, 6979, 7174 ve 7197",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 926,
			"arabicnumber": 926,
			"text": "Misver İbn Mahreme şöyle demiştir: \"Resûl-i Ekrem Sallallahu Aleyhi ve Sellem ayağa kalkmıştı ve ben onun şehadet getirdikten sonra: \" Emma ba'du (bunlardan sonra...-Esas konuya gelince-). dediğini işitmiştim. Tekrar: 3110, 3714, 3729, 3767, 5230 ve 5278",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 927,
			"arabicnumber": 927,
			"text": "İbn Abbas (r.a.) şöyle demiştir: \"Nebi Sallallahu Aleyhi ve Sellem bir gün minbere çıkmıştı. Onu minberde gördüğümüz son gün de o gün olmuştu. Sır­tında omuzlarını örten bir rida (hırka) vardı ve büyükçe bir izar kuşanmıştı. Başına da boz bir sarık sarmıştı. Minberin üzerinde Allah Teâlâ'ya hamd ve sena ettikten sonra \"Ey insanlar bana iyice yaklaşın!\" dedi. Ashâb Nebi Sallallahu Aleyhi ve Sellem'e yaklaşınca onlara şu tavsiyelerde bulundu: \"emma ba’du (Esas konuya gelelim), işte ensârdan olan şu grup gün gelecek iyice azalacak ve diğerlerinin nüfusu artacak. Kim Muhammed ümmetinin herhangi bir işini üstlenir ve insanlara faydası veya zararı dokunabilecek bir konumda olursa iyi insanların güzelliklerini kabul edip taltifte (bulunsun), kötüleri de affetsin. Tekrar: 3627 ve 3800",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 928,
			"arabicnumber": 928,
			"text": "Abdullah İbn Mes'ud (Radiyallahu Anh) şöyle demiştir: \"Resûlullah Sallallahu Aleyhi ve Sellem hutbe okurdu ve bunların arasında bir süre otururdu",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 929,
			"arabicnumber": 929,
			"text": "Ebu Hureyre (Radiyallahu Anh), Resûlullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmİştir: \"Cum'a günü olduğunda melekler mescidin kapısına dizilir ve ilk olarak gelenlerden itibaren sırayla gelen cemaati yazarlar. Namaza erken gelen kimseler sanki bir deveyi Allah yolunda kurban etmiş gibi sevap alırlar. Onlardan sonra gelenler bir sığırı, daha sonra gelenler bir koçu, ardından gelenler bir tavuğu ve en sona gelenler bir yumurtayı Allah yolunda tasadduk etmiş gibi sevap alırlar. İmam (hutbe için) çıktığında melekler kayıtları tuttukları defterleri kaldınrlar ve okunan zikri dinlemeye başlarlar. Tekrar: 3211",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 930,
			"arabicnumber": 930,
			"text": "Cabir bin Abdullah r.a. dediki: Nebi Sallallahu Aleyhi ve Sellem cum`a günü hutbe îrad buyururken biri mescide geldi: (Resûlullâh sallallahu aleyhi ve sellem:) \"Filan, sen namaz kıldın mı?\" diye sordu. O da \"Hayır\" dedi. (Bunun üzerine:) \"(Öyle ise) kalk da namaz kıl\" buyurdu. Tekrar: 931 ve 1166. Diğer tahric: Nesaî, Cum’a; Tirmizi, Cuma",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 931,
			"arabicnumber": 931,
			"text": "Amr, Câbir İbn Abdullah (r.a.)'ın şöyle dediğini nakletmektedir: \"Bir Cuma günü Resûl-i Ekrem Sallallahu Aleyhi ve Sellem hutbe okurken ashaptan bîViSi mescide girdi. Nebi Sallallahu Aleyhi ve Sellem ona; \"Namaz kıldın mı?\" diye sordu. Adam kılmadığını söyleyince Resûlullah Sallallahu Aleyhi ve Sellem ona: \"Haydi kalk ve iki rekat namaz kıl\" buyurdu",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 932,
			"arabicnumber": 932,
			"text": "Enes İbn Mâlik (r.a.) şöyle dedi: \"Resûlullah Sallallahu Aleyhi ve Sellem bîr Cum'a günü hutbe okurken bir adam kalkıp şunları söyledi: \"Ey Allah'ın Resulü, at sürüleri mahvoldu, davarlar susuzluktan kırıldı; Allah'a dua et de bize yağmur göndersin\". Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem, ellerini açıp dua etti. Tekrar: 933, 1013-1019, 1021, 1029, 1030, 3582, 6093 ve 6342 باب: الاستسقاء في الخطبة يوم الجمعة. 35. Cuma Günü Hutbede İken Yağmur Duası Etmek",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 933,
			"arabicnumber": 933,
			"text": "Enes İbn Mâlik (r.a.) şöyle demiştir: Resul-i Ekrem Sallallahu Aleyhi ve Sellem zamanında insanları sıkıntıya sokan bir kıtlık baş göstermişti. İşte o günlerde Nebi Sallallahu Aleyhi ve Sellem bir Cum'a günü hutbe okurken bir bedevi ayağa kalkıp şöyle seslendi: \"Ey Allah'ın Resulü, mallar helak oldu, çoluk çocuk açlıktan perişan bir halde... Allah'a dua et de bizi bu sıkıntılardan kurtarsın.\" Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem ellerini kaldırdı. O sırada gökyüzünde tek bir bulut bile görünmüyordu. Canımı elinde bulunduran Allah'a yemin ederim ki, Resûlullah Sallallahu Aleyhi ve Sellem gökyüzünde heybetli dağlar gibi bulutlar ortaya çıkana kadar ellerini indirmedi ve kendisi de yağmur yağana kadar minberden aşağı inmedi. Hatta ben mübarek sakallarından yağmur damlalarının süzüldüğünü gördüm. Resûl-İ Ekrem Sallallahu Aleyhi ve Sellem'in bu duası hürmetine hem o gün hem de daha sonra gelen günler boyunca ta diğer Cuma'ya kadar yağmur yağdı. Sonraki Cuma'da daha önce Resûiullah Sallallahu Aleyhi ve Sellem'den dua isteyen o bedevi şöyle dedi: \"Ey Allah'ın Resulü, binalar yıkıldı, mallarımız sular altında kaldı. Bizim için Allah'a dua et!\" Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem ellerini kaldırıp şöyle dua etti: \"Allah'ım, çevremize yağdır, üzerimize değil.\" Resûlullah Sallallahu Aleyhi ve Sellem bu şekilde dua edip eliyle gökyüzündeki bulutlara işaret etti ve onun işaret buyurduğu bulutlar hemen açılıverdi; Medine adeta ışıkla aydınlatılmış, üstü açık bir alan gibi oldu. Bu yağmur dolayısıyla bir ay boyunca vadiler sel olup aktı ve civar bölgelerden gelen herkes bolca yağan yağmurun bereketler getirdiğini söyledi",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 934,
			"arabicnumber": 934,
			"text": "Ebu Hureyre (Radiyallahu Anh) Resûlullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmiştir: \"Cum'a günü imam hutbe okurken yanı başında bulunan kimselere 'Susun!' desen bile boş söz söylemiş olursun",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 935,
			"arabicnumber": 935,
			"text": "Ebu Hureyre (r.a.) Resulullah Sallallahu Aleyhi ve Sellem'in Cum'a gününü kasdederek şöyle buyurduğunu nakletmiştir: \"İşte bu günde kısacık bir an vardır ki, Müslüman bir kul o an'a rast gelecek şekilde namaz kılmaya ve dua etmeye muvaffak olur da Allah'tan bir şey dilerse Allah o'na dilediği her şeyi bahşeder.\" Resul-i Ekrem Sallallahu Aleyhi ve Sellem bu zaman'ın çok kısa olduğunu ifade etmek üzere eliyle işaret buyurmuştu. Tekrar: 5294 ve 6400",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 936,
			"arabicnumber": 936,
			"text": "Câbir İbn Abdullah (r.a.)'ın şöyle dediği nakledilmiştir: \"Biz Resûl-i Ekrem Sallallahu Aleyhi ve Sellem ile birlikte namaz kılarken gıda maddesi getiren bir kervan getirildi. Bunun üzerine cemaat (namazı terk edip) kervan'a doğru gitti. O gün geriye Resûlullah Sallallahu Aleyhi ve Sellem ile birlikte sadece on iki kişi kalmıştı. Bunun üzerine \"Onlar bir ticaret veya eğlence gördükleri zaman hemen dağılıp ona doğru giderler ve seni ayakta bırakırlar [Cuma, 11] ayeti indi",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 937,
			"arabicnumber": 937,
			"text": "Abdullah İbn Ömer (r.a.)'in şöyle dediği nakledilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem öğle namazından önce ve sonra ikişer rek'at namaz kılardı, akşam namazından sonra ise evinde iki rekat namaz kılardı. Resul-i Ekrem Sallallahu Aleyhi ve Sellem Cum'a namazından çıktıktan sonra mescidde değil evinde iki rek'at namaz kılardı. Tekrar: 1165, 1172 ve 1180 (Cuma suresi 10’a işaret)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 938,
			"arabicnumber": 938,
			"text": "Sehl bin Sa'd şöyle demiştir: \"Bizim aramızda bir kadın vardı. Küçük bir dere kenarında ziraatle meşgul olur ve pazı yetiştirirdi. Cuma günleri olduğunda pazıları ayıklar ve saplarını yapraklarından ayırarak bir tencereye atardı. Sonra üzerine bir tutam arpa atıp pişirirdi. Dilim dilim yaparak yemeğe kattığı saplar bize yemeğin eti gibi gelirdi. İşte biz Cum'a namazını kıldıktan sonra ona gider ve selam verirdik. O da hazırlamış olduğu yemeği bize ikram ederdi. Biz, keşke Cuma günü gelse de onun yemeğini yesek, diye temenni ederdik. Tekrarr: 939, 941, 2349, 5403, 6248 ve 6279",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 939,
			"arabicnumber": 939,
			"text": "Sehl (r.a.) şöyle demiştir: \"Biz Cum'a namazını kılmadıkça öğle uykusuna (kaylûle) yatmadığımız gibi yemek de yemezdik",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 940,
			"arabicnumber": 940,
			"text": "Humeyd, Enes'in şöyle dediğini işittiğini anlatır: \"Biz Cum'a namazını ilk vaktinde kılardık ve daha sonra öğle uykusuna (kaylûle) yatardık",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 941,
			"arabicnumber": 941,
			"text": "Sehl (Radiyallahu Anh) şöyle demiştir: \"Biz Resûl-i Ekrem Sallallahu Aleyhi ve Sellem ile birlikte Cum'a namazını kılardık ve daha sonra öğle uykusuna yatardık.\" CUMA BÖLÜMÜ BİTTİ. KORKU NAMAZI BÖLÜMLERİ BİR SONRAKİ (510.) SAYFA’DA",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 65
			}
		}
	]
}