{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"12": "Fear Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 942,
			"arabicnumber": 942,
			"text": "Abdullah İbn Ömer (r.a.) şöyle demiştir: \"Resulullah Sallallahu Aleyhi ve Sellem ile birlikte Necid taraflarına sefere çıkmıştık. Düşmanla karşı karşıya geldik ve sıra sıra dizilip savaş konumu aldık. Nebi Sallallahu Aleyhi ve Sellem kalktı ve bize namaz kıldırmaya başladı. Ordudan bir grup da kalkıp onunla birlikte namaz'a durdu. Başka bir grup ise düşmana karşı durdu. Resul-i Ekrem Sallallahu Aleyhi ve Sellem kendisiyle birlikte namaz'a duranlara bir rekat namaz kıldırıp iki secdeyi yaptıktan sonra bunlar kalkıp namaz kılmayan arkadaşlarının yerini aldılar ve diğerleri gelip Resulullah Sallallahu Aleyhi ve Sellem'in arkasında namaza durdular. Resul-i Ekrem Sallallahu Aleyhi ve Sellem onlara da bir rekat namaz kıldırdı ve iki secdenin ardından selâm verdi. Daha sonra herkes kalan tek rekatı kendi başına kıldı ve iki defa secde etti. Tekrar: 4132, 4133 ve 4535",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 943,
			"arabicnumber": 943,
			"text": "İbni Ömer (r.a.)'den nakledilen bir rivayet, Mücâhid'in \"Müslümanlar'a düşman ordusu savaşa tutuştuğunda namaz artık ayakta kılınır şeklindeki sözüne benzemektedir. İbn Ömer (r.a.)'in buna ek olarak Resulullah Sallallahu Aleyhi ve Sellem'den naklettiği rivayet şöyledir: Eğer düşman sayıca bundan daha fazla ise namazı ayakta ve binek üzerinde kılsınlar",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 944,
			"arabicnumber": 944,
			"text": "İbn Abbâs (r.a.)'in şöyle dediği nakledilmiştir: \"Resulullah Sallallahu Aleyhi ve Sellem kalktı ve namaz'a durdu, ordunun bir kısmı da onunla birlikte namaza başladı. Resul-i Ekrem (Sallallahu aleyhi ve Sellem) tekbir getirdi ve cemaat de tekbir aldı. Ardından Nebi (s.a.v.) rükuya gitti ve kendisiyle birlikte namaz'a duranlar da rükuya vardı. Sonra Allah'ın Resulü Sallallahu Aleyhi ve Sellem secde'ye gitti ve ashâb-ı kiram da secde etti. Resulullah s.a.v. ikinci rekat için kalktığında bu birinci grup da kalkıp gitti ve namaza başlayan İkinci gruptaki kardeşlerini korumak için nöbete geçtiler. İkinci gruptakiler de Resul-i Ekrem (Sallallahu aleyhi ve Sellem) ile birlikte rüku ve secde ettiler. O sırada ordunun hepsi namazdaydı, fakat bir grup diğer grubu korumak için kenarda bekliyordu",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 945,
			"arabicnumber": 945,
			"text": "Cabir İbn Abdullah (r.a.) şöyle demiştir: \"Hendek savaşında Ömer (bin el-Hattab r.a.)'a­nımıza gelmişti. Kureyş müşriklerine sövüp duruyordu. Resulullah Sallallahu Aleyhi ve Sellem'e de; \"Ey Allah'ın Resulü, ben hâlâ ikindi namazını kılmış değilim ve güneş de battı batacak...\" diyerek derdini söyledi. Bunun üzerine Resul-i Ekrem (Sallallahu Aleyhi ve Sellem): Allah'a yemin ederim ki, ben de hala ikindi namazını kılamadım\" buyurdu. Nebi Sallallahu Aleyhi ve Sellem sonra Buthân'a gitti ve orada abdest alıp ikindi namazını kıldı. İkindiyi kıldığında güneş batmıştı. İkindi namazından sonra da akşam namazını edâ eyledi",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 946,
			"arabicnumber": 946,
			"text": "İbn Ömer (r.a.)'in şöyle dediği nakledilmiştir: \"Resûl-i Ekrem Sallallahu Aleyhi ve Sellem Hendek savaşı bitince bize şu talimatı verdi: \"Hiç kimse Beni Kurayza'ya varmadan ikindi namazını kılmasın!\" Ordu yolda iken ikindi namazının vakti girdi. Bunun üzerine bazıları: \"Biz Beni Kurayza'ya varmadan namaz'ı kılmayacağız\" diyerek namazı kılmadı, kimisi de: \"Olur mu öyle şey, biz namazı kılacağız. Bizden namazı kılmamamız istenmedi ki...\" dediler. Bu durum Resûlullah Sallallahu Aleyhi ve Sellem'e anlatılınca hiç birisine kızıp serzenişte bulunmadı. Tekrar: 4119",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 947,
			"arabicnumber": 947,
			"text": "Enes İbn Mâlik (r.a.)'den nakledilmiştir: \"Resûlullah Sallallahu Aleyhi ve Sellem gece'den kalma son karanlık vaktinde sabah namazını kıldı. Daha sonra atına binip ...... (Allah en büyüktür, artık Hayber'in işi bitti). Biz bir düşman topluluğun yaşadığı yere girdiğimizde kendilerine apaçık uyarılar yapılan (inzâr) bu kavmin sabahı ne kötü olur sabahı aydınlık olmaz.\" diye seslendi. Hayber halkı dışarı çıkıp çifçilik aletleriyle tarlalarına giderken İslâm ordusunu görünce \"Muhammed ve ordusu geliyor\" diye bağırmaya başlamışlardı. Savaş sonunda Resûlullah Sallallahu Aleyhi ve Sellem muzaffer oldu ve savaş'a katılan erkekleri öldürüp, savaşmayan eli silah tutmayan kimseleri esir etti. Esirlerden Safiye önce Dihyetü'l-Kelbi'nin daha sonra da Resûl-i Ekrem s.a.v.'in payına düştü. Nebi s.a.v. daha sonra Safiye ile evlendi. Evlenirken onu azat etmiş ve bu azat işlemini mehir saymıştı.\" Hadisin ravilerinden Abdülaziz İbn Suhayb, Sâib el-Bünâni'ye: \"Ey Ebu Muhammed, sen Enes İbn Mâlik'e \"Resûlullah bu evlilik için Safiye'ye mehir olarak ne vermişti?\" diye sorduğunda sana: \"Mehir olarak özgürlüğünü vermişti\" diye cevap verdi, Öyle değil mi?\" diye sormuş Sâib de te­bessüm etmiştir",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 6
			}
		}
	]
}