{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"13": "The Two Festivals (Eids)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 948,
			"arabicnumber": 948,
			"text": "Abdullah İbn Ömer (Radiyallahu Anh) şöyle demiştir: Bir gün Ömer çarşıda satılmakta olan ipek bir cübbe gördü ve onu alıp Resûlullah Sallallahu Aleyhi ve Sellem'e getirerek şöyle dedi: \"Ey Allah'ın Resulü, şu ipek elbiseyi satın alın ve Cuma günleri ile heyetleri kabul ettiğiniz günlerde giyin; daha güzel bir izlenim verirsiniz!\" Bunun üzerine Resûlullah sallallâhu aleyhi ve sellem şöyle buyurdu; \"Bu elbiseyi ancak bundan hiçbir nasibi olmayan kimseler giyer.\" Ömer Allah'ın dilediği kadar bekledi. Daha sonraki günlerde Resûlullah Sallallahu Aleyhi ve Sellem ona ipek bir cübbe gönderdi. Bunun üzerine Ömer cübbeyi alarak Resûlullah'a gelip: \"Ey Allah'ın Resulü, siz ipek elbise hakkında \"Bu elbiseyi ancak bundan hiçbir nasibi olmayan kimseler giyer buyurmuştunuz fakat şimdi bana bu cüppeyi gönderdiniz!\" deyince Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu; \"Bu cübbeyi satarsın veya bununla bir ihtiyacını giderirsin.. NOT: İbn Ebi'd-Dünyâ ve Beyhakî, Abdullah İbn Ömer'e ulaşan sahih bir senedle onun bayramlarda en güzel elbiselerini giydiğini nakletmişlerdir",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 950,
			"arabicnumber": 950,
			"text": "Bir bayram günüydü. Habeşliler mızrak ve kalkanlarla halay çekip oynuyorlardı. Oyunu görmek istiyordum fakat Resulullah Sallallahu Aleyhi ve Sellem'e bu isteğimi söyleyip söylememekte tereddüt ettim. Bana; 'Oyunu görmek ister misin?' diye sorunca 'Evet' dedim. Nebi Sallallahu aleyhi ve Sellem beni tutup arkasına aldı ve ben de çenemi omuzuna dayayıp oyunu izlemeye başladım. Bu sırada yanağım onun yanağına değiyordu. Resulullah sallallâhu aleyhi ve sellem oyun oynayanları gayrete getirmek maksadıyla: 'Haydi bakalım Erfide oğulları Beni Erfide, görelim sizi!' diyordu. Bir süre sonra ben artık sıkılınca, Nebi sallallâhu aleyhi ve sellem bana: 'Bu kadar yeter mi?' diye sordu. Ben 'Evet' deyince 'İyi öyleyse, haydi git' buyurdu",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 951,
			"arabicnumber": 951,
			"text": "el-Berâ' İbn Âzib (r.a.)'den nakledildiğine göre o şöyle der: \"Resulullah Sallallahu Aleyhi ve Sellem'in bir bayram namazı hutbesinde; \"Biz işte bu günümüze ilk olarak namazla başlarız sonra dönüp kurbanlarımızı keseriz. Kim bu şekilde hareket ederse şüphesiz bizim sünnetimize uygun davranmış olur\" buyurduğunu işittim. Tekrar: 955, 965, 968, 976, 983, 5545-5557, 5560, 5563 ve 6673",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 952,
			"arabicnumber": 952,
			"text": "Hz. Aişe (r.anha) şöyle demiştir: \"Ensardan iki kız çocuğu yanımda bulunuyor ve ensâr'ın Buâs savaşları ile ilgili olarak söylediği şarkılar söylüyorlardı. Fakat bunlar şarkı söylemeyi meslek haline getirmiş şarkıcılar değildi. Bu sırada Ebu Bekir içeriye girdi ve (kızgın bir şekilde): \"Resulullah Sallallahu Aleyhi ve Sellem'in evinde şeytan işi çalgılar ha! Bu ne hal böyle!\" diye çıkıştı. O gün bir bayram günüydü ve Resulullah sallallâhu aleyhi ve sellem şöyle buyurdu: \"Ey Ebu Bekir, her toplumun bir bayram günü vardır, bu da bizim bayramımızdır",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 953,
			"arabicnumber": 953,
			"text": "Enes İbn Mâlik (r.a.)'den nakledilmiştir: \"Resûlullah Sallallahu Aleyhi ve Sellem, birkaç hurma yemeden, Ramazan bayramı namazı için namazgah’a gitmezdi.\" Murecca' ibn Recâ' yoluyla gelen rivayette de şöyle bir ilave vardır. \"Yediği hurma taneleri de hep tek sayı olurdu.\" Diğer tahric: Tirmiziî, Iydeyn; Muvatta, Iydeyn",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 954,
			"arabicnumber": 954,
			"text": "Enes ibn Mâlik (r.a.)'den nakledildiğine göre Resûlullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Kurban Bayramı namazından önce kurbanlarını kesenler yeniden kurban kessinler.\" Bunun üzerine birisi kalkıp Nebi Sallallahu Aleyhi ve Sellem'e: \"Bu gün insanların canlarının et çektiği bir gündür!\" dedi ve komşularından yoksul ve muhtaç olan kimselerin isimlerini saydı. Resûl-i Ekrem (Sallallahu aleyhi ve Sellem) de galiba onu tasdik etti. Sonra bu şahıs: \"Benim henüz bir yaşını doldurmamış ve iki tane besili koyundan daha çok sevdiğim bir keçim var, (bunu kurban edebilir miyim?)\" diye sordu ve Nebi Sallallahu Aleyhi ve Sellem ona müsaade etti. Ben Resûlullah Sallallahu Aleyhi ve Sellem'in (bir yaşını doldurmamış keçinin kurban edilmesiyle ilgili olarak) verdiği bu iznin başka şahısları kapsamına alıp almadığını bil­miyorum. Tekrar: 984, 5546, 5549, 5561",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 955,
			"arabicnumber": 955,
			"text": "el-Berâ İbn Azib (r.a.)'den nakledilmiştir: \"Resûlullah Sallallahu Aleyhi ve Sellem bir kurban Bayramı namazından sonra bize hutbe okudu ve şunları söyledi: \"Kim bizim kıldığımız namazı kılar ve bizim kestiğimiz gibi kurbanını keserse gerçekten de kurban görevini tam olarak yerine getirmiş olur. Fakat kim kurbanını namazdan önce keserse namazı kabul olur, ama kurbanı olmaz.\" Bunun üzerine el-Berâ'nın dayısı Ebu Bürde İbn Niyâr: \"Ey Allah'ın Resulü, ben bir koyun kurban ettim ve namazdan önce kestim. Ben bu günün yemee içme günü olduğunu biliyorum ve istedim ki bu gün kesilen ilk koyun benim vimde kesilen koyun olsun. Bu yüzden koyunumu kestim ve namaza gelmeden önce de biraz yedim\" diye Resulullah Sallallahu Aleyhi ve Sellem'e durumunu anlatınca Nebi Sallallahu Aleyhi ve Sellem ona: \"Öyleyse senin koyunun et koyunu olmuş\" buyurdu. Bürde: \"Ey Allah'ın Resulü bizim henüz bir yaşını doldurmamış fakat İki koyundan daha çok sevdiğim bir keçimiz var. Bu keçiyi kurban etsem görevimi yerine getirmiş olur muyum?\" diye sorunca Resûl-i Ekrem Sallallahu Aleyhi ve Sellem: \"Senin için evet, fakat senden sonra başkaları için hayır.\" buyurdu",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 956,
			"arabicnumber": 956,
			"text": "Ebu Saîd el-Hudrî (r.a.) şöyle anlatır: \"Resulullah Sallallahu Aleyhi ve Sellem Ramazan ve Kurban bayramlarında namaz için musallaya giderdi. Onun bayramlarda ilk yaptığı şey namaz'ı kılmak olurdu. Namaz bittikten sonra ayağa kalkıp insanlara döner ve onlara öğütler verir, tavsiyelerde bulunur ve bazı emirler verirdi, insanlar da saflar halinde oturup onu dinlerdi. Hatta askerî birlikler gönderecekse buradan gönderir veya vermek istediği talimatlar / emirler varsa verir ve sonra giderdi. Ben Mervân İbnü'l-Hakem'in Medine valisi olduğu günlerde onunla da bir Ramazan veya Kurban bayramı namazı için musallaya çıktım. Zaten onun zamanına kadar insanlar Resulullah (sallallahu aleyhi ve Sellem) dönemindeki bu uygulamayı devam ettirmişlerdi. Fakat namaz kılacağımız yere vardığımızda ne göreyim; bir minber... Bu minberi Kesîr İbnü's-Salt yapmıştı. Bu şaşkınlığım henüz geçmemişti ki Mervân'ın daha bayram namazını kılmadan önce minbere çıkmaya yeltendiğini gördüm. Bunun üzerine hemen elbisesinden tutup onu geri çektim. Fakat o direnip elimden kurtuldu ve çıkıp namaz kılmadan önce hutbe îrad etmeye başladı. Ben de ona: 'Vallahi, siz Resul-i Ekrem (Sallallahu aleyhi ve Sellem) zama­nındaki uygulamayı değiştirdiniz!' dedim. Bunun üzerine aramızda şöyle bir konuşma geçti. O: Ebu Saîd, senin bildiğin o uygulamanın artık bir geçerliliği kalmadı. Allah'a yemin ederim ki, benim bildiğim bu uygulama hiç bilmediğim şu uygulamanızdan çok daha hayırlıdır. Fakat halk namazdan sonra oturup bizi beklemiyor ki, dağılıp gidiyorlar. Ben de bu yüzden hutbeyi namazın önüne aldım",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 957,
			"arabicnumber": 957,
			"text": "Abdullah İbn Ömer (r.a.)'in şöyle dediği nakledilmiştir: \"Resulullah Sallallahu Aleyhi ve Sellem Kurban ve Ramazan bayramı namazlarını kıldırır ve namazdan sonra cemaate hitap ederdi. Tekrar: 963",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 961,
			"arabicnumber": 961,
			"text": "İbn Abbâs radıyallahü anhüma şöyle demiştir: Ben Rasûlüllah(sallallahü aleyhi ve sellem) ile Ebû Bekr, Omer ve Usmân (Allah onlardan râzî olsun) ile birlikte bayram namazında hâzır bulundum. Bunların hepsi de namazı hutbeden evvel kılarlardı",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 962,
			"arabicnumber": 962,
			"text": "Abdullah İbn Abbas (r.a.)'ın şöyle dediği nakledilmiştir: \"Ben Resûl-i Ekrem Sallallahu Aleyhi ve Sellem, Ebu Bekir, Ömer ve Osman (r.a.)'ın arkasında bayram namazları kıldım. Hepsi de hutbeden önce namazı kıldırıyordu",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 963,
			"arabicnumber": 963,
			"text": "Abdullah İbn Ömer (r.a.)'in şöyle dediği nakledilmiştir: \"Resûlullah Sallallahu Aleyhi ve Sellem, Ebu Bekir ve Ömer Ramazan ile Kurban bayramı namazlarını hutbe'den önce kıldırırlardı",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 964,
			"arabicnumber": 964,
			"text": "Abdullah İbn Abbas (r.a.)'ın şöyle dediği nakledilmiştir: \"Resûl-i Ekrem Sallallahu Aleyhi ve Sellem Ramazan bayramı günü iki rekat namaz kıldı. Bu İki rekatın ne öncesinde ne de sonrasında namaz kıldı. Sonra yanında Bilâl olduğu halde ha­nımların namaz kıldığı yere geldi ve onlara sadaka vermelerini emretti. Bu emri üzerine kadınlar derhal yüzüklerini ve gerdanlıklarını Bilâl'ın kucağına atmaya başladılar",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 965,
			"arabicnumber": 965,
			"text": "el-Berâ İbn Âzib (r.a.) Resûlullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmiştir: \"Bizim bu günde yapacağımız ilk şey namaz kılmak olacaktır. Sonra döner kurbanlarımızı keseriz. Kim bu şekilde hareket ederse şüphesiz bizim sünnetimize uymuş olur. Kim de namazdan önce hayvanını kesecek olursa bu ailesine ikram edeceği bir et olur. Bunu kurban bayramı için kesilmesi gerekli olan bir kurban saymak mümkün değildir.\" Bunun üzerine ensârdan Ebû Bürde İbn Niyâr kalkıp Resûlullah Sallallahu Aleyhi ve Sellem'e: \"Ey Allah'ın Resulü, ben hayvanımı kestim bile. Fakat bir yaşını doldurmadığı halde bir yaşından daha gösterişli duran bir keçim var, bunu kurban edeyim mi?\" diye sorunca Hz. Nebi sallallâhu aleyhi ve sellem şu cevabı verdi: \"Bu keçiyi önceden kestiğin hayvanın yerine kurban et. Fakat senden sonra hiç kimse için böyle bir kurban geçerli olmayacaktır",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 966,
			"arabicnumber": 966,
			"text": "Saîd İbn Cübeyr (r.a.) şöyle demiştir: \"Abdullah İbn Ömer'in ayağının yan tarafına mızrak saplandığı zaman ben de Mina'da onun yanındaydım. Ayağı üzengiye yapışıp kalmıştı. Ben inip mızrağın ucunu çıkardım. Daha sonra Haccâc onun ayağına mızrak saplandığını öğrenip ziyaretine geldi ve: \"Bu mızrağı ayağına saplayanı bir bilsek...\" deyince İbn Ömer ona şu cevabı verdi: \"Mızrağı ayağıma saplayan sensin!\" Haccâc şaşırdı ve: \"Nasıl yani!?\" dedi. Abdullah ibn Ömer ona: \"Sen silah taşınmaması gereken ve daha önce hiç taşınmayan bir günde silah taşınmasına müsaade ediyorsun ve Harem bölgesine silah sokulmasına ses çıkarmıyorsun. Halbuki daha önce Harem'e silah hiç sokulmazdı",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 967,
			"arabicnumber": 967,
			"text": "İshâk ibn Saîd ibn Amr ibn Saîd Ibnü'l-As babasının şöyle dediğini nakletmiştir: \"Haccâc, Abdullah Ibn Ömer'i ziyarete gelmişti. Ben de orada bulunuyordum, içeriye girince: \"Yaran nasıl?\" dîye sordu, o da: \"İyi\" diye cevap verdi. Haccâc: \"Seni kim yaraladı peki?\" deyince İbn Ömer Haccâc'ı kasdederek: \"Silah taşınması helal olmayan bir günde silahların taşınması emrini kim verdiy­se o yaraladı\" diye cevap verdi",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 968,
			"arabicnumber": 968,
			"text": "el-Berâ İbn Âzİb'ten nakledilmiştir: \"Resûlullah Sallallahu Aleyhi ve Sellem bir Kurban Bayramı namazından sonra bize hutbe îrad etti ve şunları söyledi: \"Bizim bu günde yapacağımız ilk şey namaz kılmak olacaktır. Sonra döner kurbanlarımızı keseriz. Kim bu şekilde hareket ederse şüphesiz bizim sünnetimize uymuş olur. Kim de namazdan önce hayvanını kesecek olursa bu ailesine ikram etmek üzere erkenden kestiği bir etlik olur. Bunu Kurban Bayramı için kesilmesi gerekli olan bir kurban saymak mümkün değildir.\" Bunun üzerine dayım Ebu Bürde İbn Niyâr kalkıp Resûlullah Sallallahu Aleyhi ve Sellem'e: \"Ey Allah'ın Resulü, ben namazı kılmadan önce hayvanımı kestim bile. Fakat bir yaşını doldurmadığı halde bir yaşından daha gösterişli duran bir keçim var, bunu kurban edeyim mi?\" diye sorunca Nebi Sallallahu Aleyhi ve Sellem şu cevabı verdi: \"Bu keçiyi Önceden kestiğin hayvanın yerine kurban et. Fakat senden sonra hiç kimse için böyle bir keçiyi kurban etmek geçerli olmayacaktır",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 969,
			"arabicnumber": 969,
			"text": "Saîd İbn Cübeyr'in İbn Abbas (Radiyallahu Anh)'dan naklettiğine göre Resuİullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Zilhicce'nin on günü içinde işte şu vakitteki amel kadar faziletli hiçbir amel yoktur.\" Sahâbîler: \"Cihad damı bu günlerdeki amellerden daha faziletli değil!?\" deyince Resul-i Ekrem Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Cihad da... Sadece canını ve malını hiç gözünü kırpmadan feda edebilecek şekilde savaşa tutuşan ve geriye hiçbir şey getiremeyen kişinin ameli bunun dışındadır",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 970,
			"arabicnumber": 970,
			"text": "Muhammed İbn Ebu Bekir es-Sakafî şöyle demiştir: \"Biz Mina'dan Arafat'a doğru giderken Enes İbn Mâlİk'e telbiyeyi sordum ve: 'Siz Resulullah (Sallallahu aleyhi ve Sellem) ile beraberken nasıl telbiye getirirdiniz?' dedim. Bana şu cevabı verdi: Telbiye getirenlere de bir şey diyen olmazdı, tekbir getirenlere de; dileyen telbiye, dileyen tekbir getirirdi ve hiçbir şekilde kendilerine müdahale edil­mezdi. Tekrar: 1659",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 971,
			"arabicnumber": 971,
			"text": "Ümmü Atiyye şöyle demiştir: \"Bize bayram gününde musallaya çıkmamız emredildi. Hatta biz bu emir dolayısıyla evin içinde kendilerine tahsis edilen özel odalarda bulunan evlenmemiş genç kızları ve hayızlı kadınları bile çıkarırdık. Onlar da erkeklerin arkasında ilerleyip onlar gibi tekbir getirir ve dua ederlerdi; bu güzel günün bereketinden ve temizliğinden istifade etmeye çalışırlardı",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 972,
			"arabicnumber": 972,
			"text": "Abdullah İbn Ömer'in şöyle dediği nakledilmiştir: \"Resul-i Ekrem Sallallahu Aleyhi ve Sellem Ramazan ve Kurban bayramı namazlarını kıldıracağı zaman önüne bir mızrak dikilirdi ve o şekilde Nebi Sallallahu Aleyhi ve Sellem namazı kıldırırdı.\" باب: حمل العنزة أو الحربة بين يدي الإمام يوم العيد. 14. Bayram Gününde İmam'ın Önünde Mızrak Taşınması",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 973,
			"arabicnumber": 973,
			"text": "Abdullah İbn Ömer (r.a.)'den nakledilmiştir: \"Resulullah (Sallallahu aleyhi ve Sellem) musallaya giderdi ve önünden mızraklarla geçenler olurdu ve musallada iken Nebi (Sallallahu aleyhi ve Sellem)'in önüne mızrak dikilirdi. Resul-i Ekrem (Sallallahu aleyhi ve Sellem) de bu mızrağa doğru namazı kıldırırdı",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 974,
			"arabicnumber": 974,
			"text": "Ümmü Atiyye'den nakledilmiştir: \"Bize evlilik çağına yaklaşan ve kendilerine ev içinde özel oda ayrılan genç kızları bayramlarda musallaya çıkarmamız emredildi.\" Eyyub buna benzer bir rivayeti Hafsa'dan nakletmiştir. Hafsa hadisinde şöyle bir ek bilgi bulunmaktadır: \"Hayızlı kadınlar musalladan uzak durur.\" باب: خروج الصبيان إلى المصلى. 16. Bayram Günlerinde Çocukların Musallaya Çıkması",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 975,
			"arabicnumber": 975,
			"text": "İbn Abbâs'ın şöyle dediği nakledilmiştir: \"Ben Resul-i Ekrem (Sallallahu aleyhi ve Sellem) ile birlikte Ramazan veya Kurban bayramı namazı için musallaya çıktım. Namazı kıldırdı ve daha sonra cemaate hutbe îrad etti. Ardından da kadınların yanına varıp onlara öğütler verdi, uyarılarda bulundu ve sadaka vermelerini emretti",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 976,
			"arabicnumber": 976,
			"text": "el-Berâ İbn Azib (r.a.)'den nakledilmiştir: \"Nebi (Sallallahu aleyhi ve Sellem) Kurban bayramı günü Bakî' mezarlığına çıktı ve iki rekat namaz kıldı. Sonra yüzünü bize dönüp şöyle buyurdu: \"Bizim bu günde yapacağımız ilk ibadet namaz kılmaktır. Namazdan sonra dönecek ve kurbanlarımızı keseceğiz. Kim bu şekilde hareket ederse şüphesiz bizim sünnetimize uygun davranmış olur. Kim de bundan önce hayvanını kese­cek olursa bunun kurban bayramı kurbanı sayılması mümkün değildir. Bu olsa olsa ailesi için erkenden kesmiş olduğu bir etliktir; kurban sayılması asla söz konusu olamaz.\" Bunun üzerine birisi kalkıp: \"Ey Allah'ın Resulü, ben hayvanımı kestim bi­le... Fakat benim henüz bir yaşını doldurmamış, ancak bir yaşından daha göste­rişli duran bir keçim var, onu keseyim mi?\" diye sorunca Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Onu kes, fakat senden sonra hiç kimsenin böyle bir . kurbanı kabul edilmeyecektir. باب: العلم الذي بالمصلى. 18. Bayram Namazları İçin Çıkılan Musallayı Belirlemek Üzere İşaret Kullanmak",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 977,
			"arabicnumber": 977,
			"text": "Abdurrahmân İbn Abis şöyle demiştir; Abdullah İbn Abbas'a: \"Sen Resûl-i Ekrem Sallallahu Aleyhi ve Sellem'in kıldırdığı bir bayram namazında bulundun mu?\" diye sordular. O da şu cevabı verdi: \"Evet bulundum. O zamanlar yaşım küçük olduğu için Resûlullah Sallallahu Aleyhi ve Sellem'e yaklaşıp olanları görebilmiştim. Aksi halde olan biteni göremeyecektim. Nebi Sallallahu Aleyhi ve Sellem Kesîr Ibnü's-Salt'ın evinin yakınındaki işarete kadar ilerledi ve orada namazı kıldırdıktan sonra cemaate hitap etti. Sonra yanına Bilâl'i de alarak hanımlara yöneldi. Onlara öğütler verdi, uyarılarda bulundu ve sadaka vermelerini emretti. Ben kadınların takılarını Bilâl'ın eteğine doldurduklarını gördüm. Sonra Nebi Sallallahu Aleyhi ve Sellem Bilâl İle birlikte eve gitti",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 978,
			"arabicnumber": 978,
			"text": "Atâ, Câbir İbn Abdullah'ın şöyle dediğini duymuştur: \"Resûlullah (Sallallahu aleyhi ve Sellem) Ramazan bayramı günü kalktı ve ilk önce namaz kıldırdı. Namazdan sonra cemaate hitap etti. Hutbesini bitirdikten sonra İnip kadınların tarafına gitti. Onlara bir takım uyarılarda bulunurken yanında elinden tuttuğu Bilal de vardı. Bilâl elbisesini açmış kadınların verdiği sadakaları topluyordu; kadınlar yanlarında bulunan takıları, iri yüzükleri Bilal'in elbisesinin eteğine atıyorlardı.\" Bu hadisin ravilerinden İbn Cüreyc, Atâ'ya: \"Bu sadakalar hür sadakası mıydı?\" diye sorduğunu ve onun: \"Hayır, bunlar kadınların o gün sırf sadaka olarak verdikleri şeylerdir\" diye cevap verdiğini söylemiştir. Ayrıca İbn Cüreyc yine Atâ'ya: \"Peki günümüzde imamların aynı şekilde kadınlara öğüt vermek ve uyarılarda bulunmak gibi bir yükümlülüğü var mıdır?\" diye bir soru daha sormuştur. Atâ ise: \"Tabiî ki, bu şekilde kadınlara öğüt vermek imamın boynunun borcudur. Niçin bu görevi şu anda yerine getirmiyorlar şaşılacak şey doğrusu...\" demiştir",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 979,
			"arabicnumber": 979,
			"text": "Hasan İbn Müslim - Tavus - İbn Abbâs senediyle nakledilen bir rivayete göre İbn Abbâs şöyle demiştir: \"Ben Resûl-i Ekrem Sallallahu Aleyhi ve Sellem, Ebu Bekir, Ömer ve Osman (r.anhum) ile birlikte Ramazan bayramı namazlarında bulundum. Hepsi de bayram namazını hutbeden önce kıldırır ve ardından hutbeye geçerdi. Resûlullah (Sallallahu aleyhi ve Sellem) hutbe için çıkmıştı. Eliyle insanlara oturun diye işaret edişi hala gözlerimin önünde capcanlı duruyor. Hutbeden sonra cemaatin arasından ilerleyerek kadınların bulunduğu yere kadar vardı. O sırada yanında Bilâl de bulunuyordu. Nebi (Sallallahu aleyhi ve Sellem) kadınların yanına ulaşınca: \"Ey Nebi, eğer mu'min kadınlar sana gelip... .bey'at etmek isterse.[Mumtehine 12] âyetini okudu ve ayeti bitirdikten sonra kadınlara: \"Siz bu âyette sayılan bey'at'a/ ve buradaki görevlerinize bağlı mısınız?\" diye sordu. Kadınlardan sadece birisi: \"Evet\" diyerek cevap verdi. - Hadisin ravilerinden Hasan İbn Müslim bu kadının kim olduğunu bilmiyordu. - Bu görüşmenin ardından Resûl-i Ekrem Sallallahu Aleyhi ve Sellem: \"Haydi sadaka verin!\" buyurdu. Bu sırada Bilal de elbisesinin eteğini açmış sadakaları topluyor ve bir taraftan da kadınlara: \"Haydi verin sadakalarınızı, anam babam size kurban olsun!\" diyordu. Onlar da yanlarındaki takıları, alyans ve iri yüzükleri Bilal'in elbisesine atıyorlardı",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 980,
			"arabicnumber": 980,
			"text": "Hafsa binti Sîrîn'den nakledilmiştir: \"Biz bayram günlerinde kızlarımızın musallaya çıkmalarına engel olurduk. İşte bizim bu şekilde hareket ettiğimiz günlerde bir kadın Kasr-ı Ben-i Halefe (Basra civarındadır) gelip yerleşti. Bir gün onu ziyarete gitmiştim. Kendisiyle konuşurken bana kız kardeşinin kocasının Nebi Sallallahu Aleyhi ve Sellem ile birlikte on iki savaşa katıldığından ve bu savaşların altısına kız kardeşinin de gittiğinden bahsetti. Bacısı bu savaşta yaptıklarını ona şöyle anlatmış: \"Biz hastaların başında durup onlara bakıyor ve yaralıların tedavisiyle meşgul oluyorduk. Bir defasında Nebi Sallallahu Aleyhi ve Sellem'e: Ey Allah'ın Resulü bizden birinin eğer üstüne giyeceği genişçe bir elbisesi yoksa musallaya çıkmaması günah olur mu, diye sordum. Bize şöyle cevap verdi: \"Arkadaşı ona elbiselerinden giydirsin. Onlar da gelip oradaki hayra ve mu'minlerin duasına şahit olsunlar.\" Hafsa şöyle demiştir: \"Ümmü Atiyye geldiğinde bunları ona aktardım ve sen bunları Resûlullah Sallallahu Aleyhi ve Sellem'den işittin mi diye sordum. Bana: \"Evet\" diye cevap verdi. Babam ona feda olsun ki - Ümmü Atiyye Resul-i Ekrem Sallallahu Aleyhi ve Sellem'in adını andığı her zaman babam ona feda olsun derdi - Resûlullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Kendilerine evin içinde özel bir oda ayrılan evlilik çağı yaklaşmış genç kızlar - ravinin farklı bir ifadesine göre evlilik çağı yaklaşmış genç kızlar ve kendilerine evin içinde özel bir oda ayrılan genç kızlar - ile hayız olan kadınlar da bayram namazı için çıksınlar. Fakat hayız olan kadınlar musalla'dan uzak dururlar. Onlar da oradaki hayra ve mu'minlerin duasına şahit olsunlar.\" Hafsa şaşkınlık içinde; \"Hayızlı kadınlar da dışarı çıkıp bu meclislere katılır mı?\" diye sorunca, Ümmü Atiyye: \"Onlar Arafat'a çıkıp, şuraya buraya gitmiyorlar mı?\" diye soruyla karşılık vermiştir.\" باب: اعتزال الحيض المصلى. 21. Hayızlı Kadınların Musalladan Uzak Durması",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 981,
			"arabicnumber": 981,
			"text": "Ümmü Atiyye'den nakledilmiştir: \"Bize bayram namazları için namazgaha çıkmamız emredildi. Biz de bunun üzerine hayız olan olmayan bütün kadınları, evlilik çağına yaklaşmış genç kızlar ile kendilerine ev içinde özel bir oda ayrılmış olan genç kızları - bu rivayet nakledenlerden İbn Avn farklı bir ifade ile şöyle demiştir; kendilerine ev içinde özel bir oda ayrılan evlilik çağına yaklaşmış genç kızları - musallaya çıkardık. Namazgaha kadar gelen kadınlar (namaz kılmazdı fakat) namazgahtan ayrı bir yerde durup müslümanların cemaat halinde olduğu ve topluca dua ettiği ortamlara şahit olurlardı",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 982,
			"arabicnumber": 982,
			"text": "Abdullah İbn Ömer Resulullah Sallallahu Aleyhi ve Sellem'in kurbanı musallada kestiğini (nahr veya zebhettiğini) nakletmiştir. Tekrar: 1710, 1711, 5551, 5552 باب: كلام الإمام والناس في خطبة العيد، وإذا سئل الإمام عن شيء وهو يخطب. 23. Bayram Hutbesi Sırasında İmam'ın Ve Cemaatin Konuşması ve imama hutbe okurken soru sorulması",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 983,
			"arabicnumber": 983,
			"text": "el-Berâ İbn Âzib (r.a.)'den nakledilmiştir: Bir kurban bayramı günü Resul.-i Ekrem (Sallallahu aleyhi ve Sellem) bize namazdan sonra hutbe okudu ve şunları söyledi: \"Kim bu günde bizim gibi namaz kılar ue bizim kestiğimiz gibi kurbanını keserse şüphesiz bizim ibadet tarzımıza uygun hareket etmiş olur. Kim de namazdan önce hayvanını kesecek olursa bu bir etlik olur.\" Bunun üzerine Ebu Bürde İbn Niyar kalkıp: \"Ey Allah'ın Resulü, Allah'a ye­min ederim ki, ben hayvanımı namaza gelmeden önce kestim bile... Ben bu günün yeme içme günü olduğunu biliyorum. Bu yüzden erken davrandım ve kestiğim hayvandan biraz yiyip aileme ve komşularıma da ikram ettim.\" Resulullah (Sallallahu aleyhi ve Sellem): \"Bu, et için kesilmiş bir koyundur\" buyurdu. Ebu Bürde tekrar söz alıp: \"Fakat ey Allah'ın Resulü benim bir keçim var. Bu keçi bana göre iki koyundan daha değerli. Bunu kurban etsem görevimi yerine getirmiş olur muyum?\" diye sorunca Nebi Sallallahu Aleyhi ve Sellem şu cevabı verdi: \"Evet olur. Ancak senden sonra hiç kimse için böyle bir kurban geçerli olmayacaktır",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 984,
			"arabicnumber": 984,
			"text": "Enes İbn Mâlik (r.a.)'in şöyle dediği nakledilmiştir: \"Nebi (Sallallahu aleyhi ve Sellem), bir Kurban Bayramı günü namazı kıldırdı ve sonra hutbe îrad etti. Hutbede, namazdan önce hayvanlarını kesmiş olanlara yeniden kurban kesmelerini emretti. Bunun üzerine ensardan birisi kalkıp: \"Ey Allah'ın Resulü, benim ihtiyaç sahibi yoksul komşularım var. Ben de onlara dağıtmak üzere namazdan önce hayvanımı kesmiştim. Bununla birlikte sahip olduğum bir keçim daha var. Bu keçi bana göre iki etli koyundan daha değerlidir. Bu keçiyi kurban edebilir miyim?\" diye sordu. Nebi Sallallahu Aleyhi ve Sellem de ona müsaade etti",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 985,
			"arabicnumber": 985,
			"text": "Cündeb (r.a.)'den nakledilmiştir: \"Resul-i Ekrem Sallallahu Aleyhi ve Sellem bir Kurban Bayramı günü namazı kıldırdı ve ardından cemaate hitap etti. Daha sonra da kurbanını kesip şöyle buyurdu: \"Kim namazdan önce hayvanını kestiyse onun yerine başka bir kurban daha kessin. Kim de henüz kesmediyse kurbanı keserken Allah'ın adını ansın. Tekrar: 5500, 5562, 6674, 7400",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 986,
			"arabicnumber": 986,
			"text": "Cabir İbn Abdullah (r.a.)'dan nakledilmiştir: \"Resûlullah Sallallahu Aleyhi ve Sellem'in, bayram gününde musalla’ya gidiş ve dönüşü farklı yollardan olurdu",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 988,
			"arabicnumber": 988,
			"text": "Aişe (r.anha)'dan nakledildiğine göre Mina günlerinden birinde Ebu Bekir onun odasına girer. Bu sırada iki kız çocuğu Aişe'nin yanında def çalıp ezgi söylemektedir. Nebi sallallahu aleyhi ve sellem ise örtüsüne bürünmüş ve uzanmıştır. Hz. Ebu Bekir bu manzarayı görünce kızar ve kızı Aişe'yi azarlamaya başlar. Bunun üzerine Resul-i Ekrem (Sallallahu aleyhi ve Sellem) yüzünü açar ve Ebu Bekir'e şöyle der: \"Ey Ebu Bekir, rahat bırak çocukları. Şu anda bayram günlerinin içindeyiz; bu günler Mina günleridir",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 989,
			"arabicnumber": 989,
			"text": "Abdullah İbn Abbas (r.a.)'dan nakledildiğine göre Resulullah Sallallahu Aleyhi ve Sellem bir Ramazan bayramı günü musallaya çıktı ve iki rekat namaz kıldırdı. Bu namazdan ne önce ne de sonra namaz kılmıştı. O sırada yanında Bilal de bulunuyordu",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 37
			}
		}
	]
}