{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"14": "Witr Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 990,
			"arabicnumber": 990,
			"grades": [],
			"reference": {
				"book": 14,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 991,
			"arabicnumber": 991,
			"grades": [],
			"reference": {
				"book": 14,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 992,
			"arabicnumber": 992,
			"grades": [],
			"reference": {
				"book": 14,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 993,
			"arabicnumber": 993,
			"text": "Bana Amr (ibn Haris) haber verdi. Ona da Abdurrahmân ibnu'l-Kaasım, kendi Bâbasından; o da Abdullah ibn Omer'den tahdîs etmiştir. Abdullah ibn Omer (radıyallahü anh) şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem) şöyle buyurdu: \"Gece (kılınacak nafile) namazı ikişer ikişerdir. Gece nafilesinden çıkmak istediğin zaman bir rek'at kıl ki, senin daha önce kılmış olduğun rek'atleri (tekleştirsin). ibn Muhammed: Biz bulûğa erdiğimiz günden beri birçok insanları hep üç rek'atle vitr kılıyorlar gördük. Bununla beraber hepsi -yani bir de, üç de, beş de, yedi de caizdir. Ben bu sayıdan hiçbirinde be's olmadığım umarım, demiştir",
			"grades": [],
			"reference": {
				"book": 14,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 994,
			"arabicnumber": 994,
			"text": "Âişe (r.anha) şöyle haber vermiştir: Rasûlüllah(sallallahü aleyhi ve sellem) on bir rek'at namaz kılardı. Namazı işte bu idi. Mü'minlerin annesi, gece namazını kasdediyor.- O bu namaz içinde öyle secde eder idi ki, hiç başını kaldırmadan her birinizin elli âyet okuyacağı kadar dururdu: Ve sonunda sabah namazından evvel iki rek'at kılar, sonra müezzin sabah namazı için kendisine gelinceye kadar sağ yanı üzerine yatardı",
			"grades": [],
			"reference": {
				"book": 14,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 995,
			"arabicnumber": 995,
			"text": "Bize Enes ibn Sîrîn tahdîs edip şöyle dedi: Ben İbn Omer'e: Sabah namazından evvelki iki rek'at hakkında ne re'y edersin (yani ne dersin)? Bunlarda kıraati uzatayım mı? dedim. İbn Omer: Peygamber (sallallahü aleyhi ve sellem) geceleyin ikişer ikişer namaz kılar ve bir rek'atla vitr yapardı. Sabah namazından evvel sanki eli kulağında ezan (yani ikaamet) okunuyormuşçasına (sür'atle) iki rek'at namaz kılardı, dedi. Hammâd: Yânı sür'atle, demiştir",
			"grades": [],
			"reference": {
				"book": 14,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 996,
			"arabicnumber": 996,
			"text": "Âişe(r.anha) şöyle demiştir: Gecenin her saatindeRasûlüllah (sallallahü aleyhi ve sellem) vitr namazı kılmıştır.(Son vakitlerindeki) vitri ise (gecike gecike) seher vaktine varıp dayanmıştı",
			"grades": [],
			"reference": {
				"book": 14,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 997,
			"arabicnumber": 997,
			"text": "Âişe(r.anha) şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem), ben O'nun döşeği üzerinde aykırı vaziyette uyuduğum hâlde (bana doğru) namazını kılar, vitri kılmak istediği sırada beni de uyandırırdı. Ben de vitr namazını kılardım",
			"grades": [],
			"reference": {
				"book": 14,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 998,
			"arabicnumber": 998,
			"text": "Bana Nâfî', Abdullah ibn Omer'den tahdîs etti. Peygamber(sallallahü aleyhi ve sellem): \"Geceleyin namazınızın sonunu vitr yapınız\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 14,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 999,
			"arabicnumber": 999,
			"text": "Saîd ibn Yesâr şöyle demiştir: Ben, Abdullah ibn Omer ile birlikte Mekke yolunda gece sefer ediyordum. Yine Saîd dedi ki: Sabah vakti yakın mı diye şübhe edince devemden indim ve vitr namazını kıldım. Sonra Abdullah ibn Omer'e yetiştim. Abdullah ibn Omer: Nerede idin? diye sordu. Ben de: Sabah olacağından endîşe ettim de inip vitr namazım kıldım, dedim. Bunun üzerine Abdullah: Allah'ın Elçisi'nde senin için güzel bir örnek yok mu? dedi. Ben: Evet, vallahi vardır, dedim. Abdullah: Muhakkak Rasûlüllah (sallallahü aleyhi ve sellem) deve üzerinde vitr namazı kılar idi, dedi",
			"grades": [],
			"reference": {
				"book": 14,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1000,
			"arabicnumber": 1000,
			"text": "İbn Omer (radıyallahü anh) şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem) sefer esnasında binek devesi üzerinde, deve yönünü hangi cihete çevirirse çevirsin namaz kılardı. Farzlardan başka gece namazını îmâ ederek edâ ederdi. Vitr namazını da binek devesi üzerinde kılardı",
			"grades": [],
			"reference": {
				"book": 14,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1001,
			"arabicnumber": 1001,
			"text": "Bize Hammâd ibn Zeyd, Eyyûb (es-Sahtıyânî)'den; o da Muhammed(ibn Sîrîn)'den tahdîs etti. O şöyle demiştir: Enes ibn Mâlik'e, Peygamber(sallallahü aleyhi ve sellem) sabah namazında kunût duasını okudu mu? diye soruldu. O da: Evet, dedi. Bunun üzerine kendisine: Rukû'dan evvel mi kunût yaptı? diye soruldu. O da: Az müddet sürmek üzere rukû'dan sonra kunût yaptı, dedi",
			"grades": [],
			"reference": {
				"book": 14,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1002,
			"arabicnumber": 1002,
			"text": "Bize Müsedded tahdîs edip şöyle dedi: Bize Abdulvâhid tahdîs edip şöyle dedi: Bize Âsim ibn Süleyman tahdîs edip şöyle dedi: Ben Enes ibn Mâlik'e kunût hakkında suâl sordum. Enes: Muhakkak kunût vardır, dedi. Ben: Kunût rukû'dan evvel mi, yahut sonra mı idi? dedim. Enes: Rukû'dan evvel idî, dedi. Âsim: Fulân kimse senden rivayet ederek bana haber verdi ki, sen rukû'dan sonra idi demişsin(buna ne dersin)? dedi. Bunun üzerine Enes: O yanlış söylemiştir. Rasûlüllah(sallallahü aleyhi ve sellem) rukû'dan sonra yalnız bir ay kunût yaptı. Bu kunûtun sebebi şu oldu zannederim: Peygamber (sallallahü aleyhi ve sellem) takriben yetmiş kişiye varan ve kendilerine Kurrâ adı verilen bir takım insanları, müşriklerden bir kavmin yanına göndermişti. O kurrâ, sayıca müşriklerden az idiler, (bunun için onların eliyle helak olmuşlardı). O müşrikler ile Rasûlüllah arasında bir ahd de vardı. Rasûlüllah bir ay o müşrikler aleyhine düâ ederek kunût yaptı. isnâdla) bize Ahmed ibn Yûnus haber verip şöyle dedi: Bize Zaide ibn Kudâme, et-Teymî, Süleyman ibn Tarhân'dan; o da Ebû Mıclez'den haber verdi. Enes: Peygamber(sallallahü aleyhi ve sellem) Rı'l ve Zekvân kabileleri aleyhine bir ay dua ederek kunût yaptı, demiştir. bize Müsedded tahdîs edip şöyle dedi: Bize İsmâîl tahdîs edip şöyle dedi: Bize Hâlid, Ebû Kılâbe'den tahdîs etti. Enes: Kunût (vaktiyle) akşam ve sabah namazlarında idi, demiştir. Vitr bâbları, 15 merfû' hadîs ihtiva etti. Bunlardan bir tanesi muallaktır. Burada ve daha öncekiler içinde mükerrer olanlar 8 tanedir. Buraya hâlis, 7 hadîstir. Bunları tahrîc etmekte Müslim Buhâri’ye muvafakat etti. Burada 3 tane de mevsûl âsâr vardır. Vallâhu a'lem (İbn Hacer)",
			"grades": [],
			"reference": {
				"book": 14,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1003,
			"arabicnumber": 1003,
			"grades": [],
			"reference": {
				"book": 14,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1004,
			"arabicnumber": 1004,
			"text": "Abdullah ibn Zeyd şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) yağmur isteme duası yapmak üzere (namazgaha) çıktı ve ridâsını tahvîl etti",
			"grades": [],
			"reference": {
				"book": 14,
				"hadith": 15
			}
		}
	]
}