{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"15": "Invoking Allah for Rain (Istisqaa)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1005,
			"arabicnumber": 1005,
			"text": "",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1006,
			"arabicnumber": 1006,
			"text": "Bize Mugîre ibnu Abdirrahmân, Ebu'z-Zinâd'dan; o da el-A'rac'dan; o da Ebû Hureyre'den tahdîs etti ki (o, şöyle demiştir): Peygamber (sallallahü aleyhi ve sellem) son rukû'dan başını kaldırdığı zaman şöyle der idi: Allah! Ayyaş ibn Rabia'yı kurtar. Yâ Allah! Selemete'bne Hişâm'ı kurtar. Yâ Allah! el-Velîd ibnu Velîd'i kurtar. Yâ Allah! (Kâfirler elinde bunalıp) zaîf ve âciz görülen diğer mü'minleri kurtar! Yâ Allah! Mudâr (kâfirleri) üstüne baskını daha da şiddetlendir. Yâ Allah! (İçinde bulundukları) bu yılları onlara Yûsuf Peygamberin yılları gibi kıtllk yılları yap!\". yine Peygamber şöyle dedi: kabilesine gelince Allah onlara mağfiret etsin. Eslem kabilesi ile de Allah musâlim olsun, yâni barışık gitsin\". Ebî'z-Zinâd, Bâbası Ebu'z-Zinâd'dan olmak üzere: Bu duanın hepsi sabah namazı içinde idi, demiştir",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1007,
			"arabicnumber": 1007,
			"text": "Mesrûk şöyle demiştir: Biz Abdullah ibn Mes'ûd'un yanında bulunuyorduk. O şöyle dedi: Peygamber(sallallahü aleyhi ve sellem) insanlarda(yani Kureyş'te İslâm'a karşı) aleyhdârlık görünce: ''Yâ Allah! (Bunlar hakkındaki dileğim) Yûsuf Peygamber'in yedi kıtlık seneleri gibi yedi senedir\" dedi. Bunun üzerine onları öyle bir kıtlık yakaladı ki, her şeyi kökünden kuruttu (bütün bitkileri yok etti). O derecede ki, her çeşit hayvan derilerini, ölü hayvan etlerini hem de kokmuşlarını yediler. Onlardan biri gökyüzüne bakınca açlıktan dolayı(gözleri ortalığı) duman görürdü. Derken Ebû Sufyân Peygamber'in yanına geldi de: Yâ Muhammed, Sen Allah'a tâatı ve hısımlara ilgiyi emredip duruyorsun. Kavmin ise helak oldu. Artık onlar için Allah'a duâ et, dedi. Yüce Allah şöyle buyurdu: hâlde semânın ap-âşikâr bir duman getireceği günü gözetle. (Öyle bir duman ki) insanları saracaktır o. Bu pek yaman bir azâb (diyecekler). Ey Rabb 'imiz, bizden bu azâbı açıp kaldır. Çünkü biz îmân edeceğiz. Onlar için düşünüp, ibret almak nerede? Kendilerine (hakikatleri) açıklayan bir Rasûl geldiği hâlde, yine O'ndan yüz çevirdiler. Bir öğretilmiş, bir mecnûn dediler. Biz bu azâbı biraz açıp kaldıracağız. Fakat siz hiç şüphe yok ki, tekrar dönecek olanlarsınız. Çok büyük bir şiddet ve savletle çarpacağımız gün, muhakkak ki biz (onlardan) intikaam alıcılarız\" (ed-Duhân: 10-16). Bedr günü olandır. Demek ki Duhân da, Batşe de, Lizâm da, Rûm âyeti de(meydana gelmiş ve) geçmiştir",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1009,
			"arabicnumber": 1009,
			"text": "",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1010,
			"arabicnumber": 1010,
			"text": "",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1011,
			"arabicnumber": 1011,
			"text": "",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1012,
			"arabicnumber": 1012,
			"text": "",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1013,
			"arabicnumber": 1013,
			"text": "Bize Şerik ibnu Abdillah ibni Ebî Nemir tahdîs etti. O da Enes ibn Mâlik'ten şöyle zikrederken işitmiştir : Bir kimse cumua günü Rasûlüllah ayakta hutbe yaparken, minberin karşısında bulunan bir kapıdan içeriye girdi veRasûlüllah'ın karşısında ayakta dikelerek: Yâ Rasûlallah, davarlar helak oldu, yollar kesildi. Binâenaleyh Allah'a duâ et de imdadımıza yetişsin, dedi. Râvî dedi ki: Bu söz üzerine Rasûlüllah hemen iki elini kaldırdı da:\"Allâhumme eskınâ; Allâhumme eskınâ; Allâhumme eskınâ (= Yâ Allah bize yağmur ver; yâ Allah bize yağmur ver; yâ Allah bize yağmur ver)\" dedi. Yine Enes şöyle dedi: Allah'a yemîn ederim ki, o sırada biz gökyüzünde ne kalın, ne ince bulut; hiç, hiçbir şey görmüyorduk. Bizimle Sel'i Dağı arasında o zaman hiçbir ev ve hiçbir konak da yoktu. Enes dedi ki: DerkenRasûlüllah'ın arka tarafından, kalkan şeklinde bir bulut parçası çıkageldi. Semânın ortasına varınca yayıldı. Sonra yağmur yağmağa başladı. Enes dedi ki: Allah'a yemînle söylüyorum, biz altı gün(yânı bir hafta) güneşin yüzünü görmedik. Sonra öbür cumua günü yine Rasûlüllah ayakta hutbe yaparken, yine o kapıdan bir kimse girdi, Peygamber'in karşısına geçti ve ayakta dikelerek: Yâ Rasûlallah, mallar helak oldu, yollar da kesilip kapandı. Allah'a duâ et de artık bu yağmuru tutsun, dedi. Enes dedi ki: Bunun üzerine Rasûlüllah iki elini kaldırdı ve: \"Yâ Allah, etrafımıza (yağsın), üzerimize değil. Yâ Allah, tepelere, dağlara, kal'alara, bayırlara, derelere, ağaçlıklara yağdır\" diye duâ etti. Enes dedi ki: Bunun üzerine hemen yağmur kesildi. Ve namazdan çıktığımızda güneşte yürür olduk. Hadîsi Enes'ten rivayet eden Şerîk ibn Abdillah dedi ki: İkinci hafta gelen adam, evvelki hafta gelen adam mıydı? diye Enes'ten sordum. Enes, bilmem, dedi",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1014,
			"arabicnumber": 1014,
			"text": "Bize İsmâîl ibn Ca'fer, Serik'ten; o da Enesibn Mâlik'ten tahdîs etti (O, şöyle demiştir): Bir kimse cumua günü Rasûlüllah ayakta hutbe yaparken Dâru'l-Kadâ tarafında vaktiyle mevcûd olan bir kapıdan içeriye girdi de, Rasûlüllah'ın karşısında ayakta durdu. Sonra: Yâ Rasûlallah, mallar helak oldu, yollar kesildi. Allah'a duâ et de bizlere yağmur ihsan etsin, dedi. Bunun üzerine Rasûlüllah iki elini kaldırdı, sonra: \"Allâhumme eğısnâ, Allâhumme eğısnâ, Allâhumme eğısnâ (= Yâ Allah bize yağmur ver, yâ Allah bize yağmur ver, yâ Allah bize yağmur ver)\" dedi. Enes dedi ki: Allah'a yemîn ile söylüyorum, o sırada biz gökyüzünde ne kalın, ne de ince bir bulut görüyorduk; bizimle Sel'ı Dağı arasında hiçbir ev ve hiçbir konak da yoktu. Enes dedi ki: Derken Rasûlüllah'ın arka tarafından kalkan şeklinde bir bulut çıktı. O bulut semânın ortasına varınca yayıldı. Sonra yağmur yağmağa başladı. Allah'a yemîn ediyorum ki, biz altı gün güneşi görmedik. Sonra (öbür) cuma günü, yine RasûlulIah ayakta hutbe yaparken, yine o kapıdan bir kimse daha girdi; Rasülullah'ın karşısına geçip dikeldi. Ve: Yâ Rasûlallah, mallar helak oldu, yollar kesilip kapandı. Allah'a duâ et de artık bu yağmurları bizden tutsun, dedi. Bunun üzerine Rasûlüllah iki elini kaldırdı, sonra: \"Yâ Allah, etrafımıza(yağsın), üzerimize değil. Yâ Allah, tepelere, bayırlara; derelerin içlerine, ağaç ve ot bitecek yerlere (yağdır)\" diye duâ etti. Enes dedi ki: Bu duâ üzerine hemen yağmur kesildi. Biz de mescidden çıkıp, güneşte yürüyorduk. ibn Abdillah dedi ki: Enes'e: İkinci hafta gelen zât, evvelki hafta gelen zât mıydı? diye sordum da, o: Bilmiyorum, dedi",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1015,
			"arabicnumber": 1015,
			"text": "Enes(radıyallahü anh) şöyle demiştir: Cumua günü Rasûlüllah (sallallahü aleyhi ve sellem) hutbe yaparken birdenbire bir adam geldi ve: Yâ Rasûlallah, yağmur kıtaldi. Allah'a duâ et de bize yağmur yağdırsın, dedi. Rasûlüllah hemen duâ etti. Derken üzerimize yağmur yağmağa başladı. Öyle ki, az daha evlerimize ulaşamayacaktık. Ondan sonraki cumuaya kadar üzerimize hep rahmet yağdı durdu. Enes dedi ki: Öbür cumua, bu adam yahut bir başkası ayağa kalktı ve: Yâ Rasûlallah, bu yağmuru bizden çevirmesi için Allah'a duâ et de, bu yağmuru üzerimizden çevirsin, dedi. Bunun üzerine Rasûlüllah:\"Yâ Allah, etrafımıza (yağdır), üzerimize değil\" dedi. Enes dedi ki: Yemîn olsun, bulutların sağa sola doğru parçalandıklarını ve etraftakiler üzerine yağmur yağarken Medîne ahâlîsinin yağmur altında olmadıklarını muhakkak görmüşümdür",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1016,
			"arabicnumber": 1016,
			"text": "Enes (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem)'e bir adam geldi de: Hayvanlar helak oldu, yollar kesilip kapandı, dedi. Akabinde Peygamber duâ etti. Artık bize o cumuadan i'tibâren öteki cumuaya kadar yağmur verildi. Sonra bir daha geldi ve: Evler yıkıldı, yollar kesildi, hayvanlar helak oldu. Allah'a duâ et de şu bulutların sağanağını tutsun, dedi. Bunun üzerine Peygamber: \"Yâ Allah, tepelere, bayırlara, derelere ve ağaç bitecek yerlere (ağaçlıklara yağdır)\" diye duâ etti. Bu duâ akabinde bulutlar, Medîne'nin üstünden kumaş dürülür gibi dürüldü",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1017,
			"arabicnumber": 1017,
			"text": "",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1018,
			"arabicnumber": 1018,
			"text": "Bize Muâfâ ibnu İmrân, el-Evzâî'den; o da İshâk ibn Abdillah'tan; o da Enes ibn Mâlik'ten şöyle tahdîs etti: Bir şahıs Peygamber'e geldi de(su kıtlığı sebebiyle) malların helakini, çoluk çocuğun meşakkatini şikâyetle arz etti. Bunun üzerine Peygamber yağmur istemek üzere Allah'a duâ etti. (Enes'in râvîsi İshâk ibn İbrâhîm yahut onunla Buhârî arasındaki diğer bir) râvî dedi ki: Enes, ne Peygamber'in dış elbisesini tahvîl ettiğini ve ne de kıbleye yöneldiğini zikretti",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1019,
			"arabicnumber": 1019,
			"text": "",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1020,
			"arabicnumber": 1020,
			"text": "Bize Mansûr ile el-A'meş, Ebu'd-Duhâ'dan; o da Mesrûk'tan tahdîs etti. Mesrûk şöyle demiştir: Ben İbn Mes'ûd'a geldim. O şöyle dedi: Kureyş kavmi İslâm'a girmekte geciktiler. Bunun üzerine Peygamber(sallallahü aleyhi ve sellem) onların aleyhine duâ etti de onları bir kıtlık yakaladı ki, o yıl helak oldular, ölü hayvan eti yediler ve kemikleri kemirdiler. Ebû Sufyân, Peygamber'in yanına geldi de: Yâ Muhammed, sen akrabayla ilgilenmeyi emrederek geldin. Senin kavmin ise helak oldular. Artık Yüce Allah'a duâ et, dedi. Rasûlüllah veya İbn Mes'ûd: \"O hâlde semânın apâşikâr bir duman getireceği günü gözetle... \"(ed-Duhân: ıo) âyetini okudu. Sonra Kureyşliler tekrar kâfirliklerine döndüler. Bu dönüşlerinin cezası da Yüce Allah'ın şu kavlidir: \"Çok büyük bir şiddet ve savletle çarpacağımız gün muhakkak ki biz intikaam alıcılarız\"(ed-Duhân: 16); bu gün, Bedr günüdür. şöyle dedi: Ve Esbât ibn Nasr, Mansûr'dan isnâdiyle şunu ziyâde etti: Rasûlüllah (sallallahü aleyhi ve sellem) duâ yaptı da onlara yağmurlar ihsan olundu. Yedi gün yedi gece adamakıllı ıslandılar. Ondan sonra halk yağmurun çokluğundan şikâyet ettiler. Bunun üzerine Rasûlüllah:\"Yâ Allah, etrafımıza yağdır; üzerimize değil\" diye duâ etti de, başının üstünden bulut sıyrıldı, etraflarındaki halk yağmurdan istifâde etmeye başladı",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1021,
			"arabicnumber": 1021,
			"text": "Enes ibn Mâlik(radıyallahü anh) şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem) bir cumua günü hutbe yapıyordu. İnsanlar ayağa kalktılar ve: Yâ Rasûlallah, yağmur kıtaldı, ağaçlar kıpkırmızı olup kurudu, hayvanlar helak oldu. Allah'a duâ et de bize yağmur yağdırsın, diye bağırdılar. Rasûlüllah iki defa Allah, bize yağmur ver; yâ Allah, bize yağmur ver!\" diye duâ etti. Allah'a yemîn ederim, o sırada biz gökyüzünde hiçbir bulut parçası görmüyorduk. Hemen bir bulut çıktı ve yağmur yağmağa başladı. Rasûlüllah minberden indi de namaz kıldırdı. Namazdan çıktığı zaman yağmur, ondan sonraki cumuaya kadar hep yağıp durdu. Öteki cumua Peygamber (sallallahü aleyhi ve sellem) kalkıp hutbe yaparken, halk yine kendisine doğru: Evler yıkıldı, yollar kesilip kapandı; Allah'a duâ et de bizden bulutları habsetsin, diye bağırdılar. Bunun üzerine Peygamber (sallallahü aleyhi ve sellem) gülümsedi, sonra da: havâleynâ velâ aleynâ(= Yâ Allah etrafımıza yağdır; üzerimize değil)\"diye duâ etti. Derken Medine'nin üstü sıyrıldı. Bulutlar Medine'nin etrafına damlarken, Medine'ye bir damla düşmüyordu. Medine'ye baktım, o tacla sarılmış bir baş gibiydi",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1022,
			"arabicnumber": 1022,
			"text": "",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1023,
			"arabicnumber": 1023,
			"text": "ez-Zuhrî şöyle demiştir: Bana Abbâd ibnu Temîm tahdîs etti ki, ona da amucası Abdullah ibn Zeyd el-Mâzinî -ki o, Peygamber'in sahâbîlerinden idi- şöyle haber vermiştir: Peygamber (sallallahü aleyhi ve sellem), kendileri için yağmur isteme duası yapmak üzere insanları(namazgaha) çıkardı. Sahrada ayağa kalktı, ayakta dikelerek Allah'a duâ etti. Sonra kıble tarafına yöneldi, üst elbisesini tahvil eyledi. Nihayet insanlara yağmur ihsan olundu",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1024,
			"arabicnumber": 1024,
			"text": "",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1025,
			"arabicnumber": 1025,
			"text": "",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1026,
			"arabicnumber": 1026,
			"text": "Bize Sufyân(ibn Uyeyne), Abdullah ibn Ebî Bekr'den; o da Abbâd ibnu Temîm'den; o da amucası Abdullah ibn Zeyd'den tahdîs etti ki, Peygamber (sallallahü aleyhi ve sellem) yağmur isteme duası yapmış ve ridâsını kalb etmiştir",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1027,
			"arabicnumber": 1027,
			"text": "Bize Sufyân(ibn Uyeyne), Abdullah ibn Ebî Bekr'den tahdîs etti. O da Abbâd ibn Temîm'den işitmiştir; o da amucası Abdullah ibn Zeyd'den. O şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem), yağmur isteme duası yapmak üzere sahra namazgâhına çıktı, orada kıbleye yöneldi, iki rek'at namaz kıldırdı ve ridâsını tahvîl etti. dedi ki: Bana el-Mes'ûdî,(mezkûr Abdullah'ın Bâbası olan) Ebû Bekr'den haber verdi. O (kalb etmeyi tefsîr ederek): Ridâsının sağ yanını sol yanı üzerine getirdi, demiştir",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1028,
			"arabicnumber": 1028,
			"text": "Abdullah ibnu Zeyd el-Ensârî (radıyallahü anh) şöyle haber vermiştir: Peygamber(sallallahü aleyhi ve sellem) namaz kıldırmak üzere sahra namazgahına çıktı. Duâ ettiği yahut duâ etmek istediği zaman kıbleye yöneldi ve ridâsını tahvîl eyledi. Abdillah el-Buhârî dedi ki: Bâb hadîsinin râvîsi olan bu Abdullah ibnu Zeyd, Mâzinî'dir.(Yağmur isteme duasında ayakta dikilerek duâ etme bâbı'nda geçen) birinci râvî ise Küfî'dir. O, Abdullah ibnu Yezîd el-Kûfî'dir",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1029,
			"arabicnumber": 1029,
			"text": "Eyyûb ibn Süleyman şöyle dedi: Bana Ebû Bekr ibn Ebî Uveys, Süleyman ibnu Bilâl'den tahdîs etti., Yahya ibnu Saîd şöyle dedi: Ben Enes ibn Mâlik'ten işittim, o şöyle dedi: Sahra ahâlîsinden A'rabî bir adam cumua günü Rasûlüllah'a geldi ve: Yâ Rasûlallah, hayvanlar helak oldu, çoluk çocuk helak oldu, insanlar da helak oldu, dedi. Rasûlüllah (sallallahü aleyhi ve sellem) iki elini kaldırıp duâ etti: İnsanlar da Rasûlüllah ile beraber ellerini kaldırıp duâ ettiler. Enes dedi ki: Henüz mescidden çıkmamıştık ki, üzerimize yağmur yağmaya başladı. Artık öteki cumua oluncaya kadar üzerimize hep yağmur yağdı durdu. O zât, Allah'ın Peygamberi'ne geldi ve: Yâ Rasûlallah, yolcular yolların kapalılığından artık usandı ve yollar geçilmez oldu, dedi",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1030,
			"arabicnumber": 1030,
			"text": "Ve Uveysî şöyle dedi: Bana Muhammed ibn Ca'fer, Yahya ibn Saîd ile Şerik'ten tahdîs etti. O ikisi de Enes'ten işitmişlerdir. Enes: Peygamber(sallallahü aleyhi ve sellem) iki elini, ben koltuk altlarının beyazını görünceye kadar kaldırdı, demiştir",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1031,
			"arabicnumber": 1031,
			"text": "Enes ibn Mâlik(radıyallahü anh) şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem) hiçbir duasında ellerini yukarıya kaldırmazdı, yalnız yağmur isteme duası müstesna. Çünkü Peygamber (bunda ellerini) koltuk altlarının beyazı görününceye kadar kaldırırdı",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1032,
			"arabicnumber": 1032,
			"text": "(Âişe -r. anha- şöyle demiştir:) Rasûlüllah(sallallahü aleyhi ve sellem) yağmuru gördüğü zaman: \"Allâhumme, sayyıben nâfi'an(Yâ Allah, bize faydalı yağmur ver)\" der idi. hadîsi Ubeydullah'tan rivayet etmesinde ona el-Kaasım ibnu Yahya(197) mutâbaat etmiştir ve bu hadîsi el-Evzâî ile Akîl de Nâ-fi'den rivayet etmişlerdir",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1033,
			"arabicnumber": 1033,
			"text": "Enes ibn Mâlik(radıyallahü anh) tahdîs edip şöyle dedi: Rasûlüllah (sallallahü aleyhi ve sellem) zamanında insanlara bir kıtlık isabet etti. Bir cumua günü Rasûlüllah minber üzerinde hutbe yaparken, A'râbî'nin biri ayağa kalktı ve: Yâ Rasûlallah, mallar helak oldu, çoluk çocuk da aç kaldı. Bizim için Allah'a duâ et de, bizleri suya kandırsın, dedi. Enes dedi ki: Rasûlüllah iki elini kaldırdı. Bu esnada gökyüzünde hiçbir bulut parçası yoktu. Enes dedi ki: Dağlar gibi bulutlar -yahut bulutlar dağlar gibi- gökyüzüne hücum etti. Sonra minberinden inmemişti, tâ ki ben yağmur tanelerinin O'nun sakalı üzerinden aşağıya doğru yuvarlandıklarını gördüm. Enes dedi ki: O günümüz, ertesi gün, daha ertesi gün ve onu ta'kîb eden gün; tâ öteki cumuaya kadar hep üzerimize yağmur yağdı durdu. Ertesi cumua yine o A'râbî, yahut ondan başka Bir kimse ayağa kalktı ve: Yâ Rasûlallah, artık binalar yıkıldı, mallar suda boğuldu. Binâenaleyh bizim için Allah'a duâ ediver, dedi. Bunun üzerine Rasülullah iki elini kaldırdı ve: \"Yâ Allah, etrafımıza (yağdır); üzerimize değil\" diye duâ etti. Enes dedi ki:(Bunu söylerken) eliyle semâdan hangi tarafa işaret ettiyse, orası açıldı ve Medîne, üstü açık bir alan gibi oldu. Kanat Vâdîsi bir ay mütemadiyen aktı. Herhangi taraftan kim geldiyse muhakkak bol bol yağmur yağdığını söyledi",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1034,
			"arabicnumber": 1034,
			"text": "Bana Humeyd et-Tavîl haber verdi ki, o, Enes (radıyallahü anh) şöyle derken işitmiştir: Şiddetli bir rüzgâr estiği zaman bundan dolayı Peygamber'in yüzünde(bir endîşe derhâl) belli olurdu",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1035,
			"arabicnumber": 1035,
			"text": "Bize Şu'be, el-Hakem'den; o da Mucâhid ibn Cebr'den; o da İbn Abbâsradıyallahü anhüma'tan tahdîs etti. Peygamber (sallallahü aleyhi ve sellem): \"Ben sabâ rüzgârı ile yardım olundum. Âd kavmi ise batı rüzgârı ile ihlâk olundular\" buyurdu",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1036,
			"arabicnumber": 1036,
			"text": "Ebû Hureyre(radıyallahü anh) şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem) şöyle buyurdu: kabz olunmadıkça, zelzeleler çoğalmadıkça, zaman yaklaşmadıkça, fitneler meydan alıp gâlib gelmedikçe, öldürmek ve ancak öldürmekten ibaret olan herc (Fitne ve kargaşalık) çoğalmadıkça, sizlerde mal pek çoğalıp sel gibi akıp taşmadıkça kıyâmet kopmaz",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1037,
			"arabicnumber": 1037,
			"text": "Bize İbnu Avn, Nâfi'den; o da İbn Omer'den olmak üzere tahdîs etti. O, şöyle demiştir: -Peygamber(sallallahü aleyhi ve sellem) : bârik lenâ fî Şâminâ ve Yemeninâ (= Yâ Allah, Şam'ımızda ve Yemen'imizde bize bereket ihsan et)\" buyurdu. Bâzı kimseler: \"Ve fî Necdinâ(= Necd'imize de)\" diye niyazda bulundular. Rasûlüllah tekrar: \"Allâhumme bârik lenâ fî Şâminâ ve Yemeninâ\"buyurdu. Onlar yine: \"Ve fî Necdinâ\" deyince:\"Zelzeleler ve fitneler işte oradadır. Şeytânın karnı (yani hizb ve ümmeti) de orada çıkacaktır\" buyurdu",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1038,
			"arabicnumber": 1038,
			"text": "Zeyd ibn Hâlid el-Cuhenî (radıyallahü anh) şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) Hudeybiye'de geceleyin yağan yağmurdan sonra, bize sabah namazını kıldırdı. Namazdan çıkınca yüzünü cemâate döndürdü de: \"Bilir misiniz Rabb'ınız ne buyurdu?\"diye sordu. Allah ve Rasûlü en bilendir, dediler. Dedi ki: \"Kullarımdan kimi bana mü'min, kimi kâfir (olarak) sabaha ulaştı. Her kim Allah 'ın fadlı ve rahmeti ile üzerimize yağmur yağdı dedi ise, işte o bana îmân etmiş; yıldıza îmân etmemiştir. Her kim de fulân ve fulân yıldızın nev'i (yani batıp doğması) ile üzerimize yağmur yağdı dedi ise, işte o da bana îmân etmemiş; yıldıza îmân etmiştir\" buyurdu",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1039,
			"arabicnumber": 1039,
			"text": "İbn Omer(radıyallahü anh) şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: \"Gaybın anahtarı beştir ki, onları Allah'tan başkası bilemez: Yarın ne olacağını hiçbir kimse bilemez. Rahimlerde olacak şeyi hiçbir kimse bilemez. Hiçbir nefs yarın (hayr ve şerr) ne kazanacağını bilemez. Keza hiçbir nefs hangi yerde öleceğini bilemez. Hiçbir kimse de yağmurun ne zaman yağacağını bilemez",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 34
			}
		}
	]
}