{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"16": "Eclipses"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1040,
			"arabicnumber": 1040,
			"text": "Ebu Bekre'nin şöyle dediği nakledilmiştir: \"Biz Resul-i Ekrem Sallallahu Aleyhi ve Sellem'in yanında iken güneş tutulması oldu. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem omuzuna attığı ridasını sürüyerek mescide girdi ve biz de onu takip ederek mescid'e gittik. Bize orada güneş geri açılana kadar iki rekat namaz kıldırdı ve şöyle buyurdu; \"Güneş ve ay hiç kimsenin ölümü dolayısıyla tutulmaz. Siz bunların tutulduğunu görürseniz tekrar açılana kadar namaz kılın ve dua edin! Tekrar: 1048, 1062, 1063, 5785",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1041,
			"arabicnumber": 1041,
			"text": "Kays, Ebu Mes'ud'dan bizzat duyduğunu ifade ederek şöyle demiştir: \"Ebu Mes'ud, Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletti: \"Güneş ve ay asla hiç kimsenin ölümü dolayısıyla tutulmaz. Bu tutulmalar Allah'ın birer ayetidir. Güneşin ve ay'ın tutulduğunu görürseniz kalkın ve namaz kılın! Tekrar: 1057, 3204",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1042,
			"arabicnumber": 1042,
			"text": "Abdullah İbn Ömer Nebi Sallallahu Aleyhi ve Sellem'den haber vererek onun şöyle buyurduğunu nakletmiştir: \"Güneş ve ay hiç kimsenin ne ölümü ne de hayatı dolayısıyla tutulur. Fakat bu tutulmalar Allah'ın birer ayetidir. Siz güneşin ve ayın tutulduğunu görürseniz namaz kılın",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1043,
			"arabicnumber": 1043,
			"text": "Muğîre Ibn Şu'be (r.a.)'in şöyle dediği nakledilmiştir: \"Resul-i Ekrem Sallallahu Aleyhi ve Sellem zamanında İbrahim'in öldüğü gün güneş tutulmuştu. Bunun üzerine insanlar: 'Güneş İbrahim öldüğü için tutuldu' demeye başladılar. Nebi Sallallahu Aleyhi ve Sellem ise onların bu sözünü duyunca şöyle buyurdu: \"Güneş ve ay hiç kimsenin ne ölümü ne de hayatı dolayısıyla tutulur. Siz güneşin ve ayın tutulduğunu görürseniz namaz kılın ve Allah'a dua edin! Tekrar: 1060, 6199",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1044,
			"arabicnumber": 1044,
			"text": "Aişe (r.anha)'nın şöyle dediği nakledilmiştir: \"Resulullah Sallallahu Aleyhi ve Sellem zamanında güneş tutulmuştu. Resul-i Ekrem Sallallahu Aleyhi ve Sellem o anda insanlara namaz kıldırdı. Kıyamda çok uzun bir süre kaldıktan sonra rükuya gitti ve yine uzunca bekledi. Sonra kıyama kalktı ve ilk rekattaki kadar olmasa da uzun bir süre kıyamda durdu. Ardından rüku'a gitti ve ilk rüku kadar olmasa da uzunca bir süre rükuda bekledi. Sonra secdeye vardı ve uzun bir müddet secdede kaldı. Namazın ikinci rekatını da tıpkı birinci rekat gibi kıldırdı. Namazı bitirdiğinde güneş açılmıştı. Resulullah Sallallahu Aleyhi ve Sellem namaz'ın ardından Allah'a hamd ve övgüde bulunarak insanlara hitap etti. Hutbe sırasında şunları söylemişti: \"Güneş ve ay Allah'ın birer ayetidir. Bunlar ne bir kimsenin ölümü ne de hayatı dolayısıyla tutulur, Eğer güneş ve ayın tutulduğunu görürseniz Allah'a dua edin, tekbirler getirin, namaz kılın ve sadaka verin.\" Hutbede şunları da söylemişti: \"Ey Muhammed ümmeti, kadın veya erkek Allah'ın bir kulunun zina etmesi karşısında Allah'ın gösterdiği gayret (kıskançlık) sizin duyduğunuz kıskançlıktan daha çoktur. Ey Muhammed ümmeti, eğer benim bildiğimi bilseydiniz az güler çok ağlardınız. Tekrar: 1046, 1047, 1050, 1056, 1057, 1064, 1066, 1212, 3203,4624, 5221, 6631",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1045,
			"arabicnumber": 1045,
			"text": "Abdullah İbn Amr (r.a.)'dan nakledilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem zamanında güneş tutulduğu vakit: \" الصلاة جامعة [Esselatu’l-camiah} Namaz toplayıcıdır,!\" diye ilan edilmişti",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1046,
			"arabicnumber": 1046,
			"text": "Mu'minlerin annesi Aişe (r.a.)'nın şöyle dediği nakledilmiştir: \"Resulullah Sallallahu Aleyhi ve Sellem hayatta iken güneş tutulmuştu. Bunun üzerine çıkıp mescide gitti ve ashab-ı kiram O'nun Sallallahu Aleyhi ve Sellem arkasında saf tuttu. Resu-lullah Sallallahu Aleyhi ve Sellem tekbir getirip namaza başladı ve uzun bir kiraattan sonra tekbir getirip rükuya gitti. Rükuda da uzun bir süre bekledikten sonra (Semi'allahu limen hamideh) deyip kalktı. Fakat secdeye varmadı. Kıyamda ilk kıraati kadar olmasa da uzun bir süre Kur'an okudu. Sonra tekbir getirip rükuya vardı. Rükuda yine uzun bir müddet bekledi; fakat bu rüku birinci rüku kadar uzun değildi. Sonra (Semi'allahu limen hamideh, Rabbena ve lekel hamd) dedi ve ardından secdeye gitti. Bir sonraki rekatı da tıpkı birinci rekat gibi kıldı. Bu şekilde dört rekatı dört secde ile tamamladı. Nebi Sallallahu Aleyhi ve Sellem namazı bitirmeden önce güneş açılmıştı. Resul-i Ekrem Sallallahu Aleyhi ve Sellem namaz bittikten sonra kalktı ve Allah'ı layık olduğu şekilde övdükten sonra şöyle buyurdu: \"Ay ve güneş Allah'ın birer ayetidir. Bunlar ne bir kimse'nin ölümü ne de hayatı yüzünden tutulurlar. Eğer ay ve güneşin tutulduğunu görürseniz derhal namaz kılmaya koşun!\" Kesîr İbn Abbas, Abdullah İbn Abbas'ın güneş tutulmasıyla İlgili olarak naklettiği rivayetin tıpkı Urve'nin Aişe (r.a.)'dan naklettiği rivayet gibi olduğunu söylemiş ve bunu nakletmiştir. Kesîr İbn Abbas şöyle demiştir: \"Ben Urve'ye 'Kardeşin Medine'de güneş tutulduğu zaman kılınan namazın tıpkı sabah namazı gibi iki rekat olduğunu söyledi ve bunun üzerine eklemede bulunmadı' dediğimde şu cevabı verdi; 'Doğrudur ama sünnete uygun davranmamış",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1047,
			"arabicnumber": 1047,
			"text": "Urve İbnü'z-Zübeyr, Aişe (r.anha)'nın şöyle dediğini nakletmiştir: \"Resul-i Ekrem Sallallahu Aleyhi ve Sellem güneş tutulduğu (hüsuf) gün kalktı ve tekbir getirip namaz'a durduktan sonra uzun bir süre Kur'an okudu. Ardından rükuya gidip rükuda da uzun bir müddet bekledi. Daha sonra başını kaldırıp (Semi'allahu limen hamideh) dedi ve daha önceki gibi yine kıyama kalktı. Bu kıyamda bir önceki kıraati kadar olmasa da yine uzunca bir süre Kur'an okudu. Sonra rükuya gitti ve rükuda birinci rekattaki kadar olmasa da uzun bir süre bekledi. Ardından secdeye gitti ve secdede uzun bir müddet bekledi. Bir sonraki on rekatı da tıpkı birinci rekat gibi kıldı. Selam verdiğinde güneş açılmıştı. Resulullah (Sallallahu aleyhi ve Sellem) namazın ardından cemaate hitap ederek güneş ve ay tutulması (küsuf) hakkında şunları söyledi: \"Ay ve güneş Allah'ın birer ayetidir. Bunlar ne bir kimsenin ölümü ne de hayatı yüzünden tutulurlar. Eğer ay ve güneşin tutulduğunu görürseniz derhal namaz kılmaya koşun",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1048,
			"arabicnumber": 1048,
			"text": "Ebu Bekre Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmiştir: \"Güneş ve ay Allah'ın birer ayetidir. Bunlar asla bir kimsenin ölümü dolayısıyla tutulmazlar. Ancak Allah Teala bu tutulmalar ile kullarına korku salar.\" Ebu Abdullah şöyle demiştir: \"Abdülvaris, Şu'be, Halid İbn Abdullah ve Hammad İbn Seleme bu rivayette geçen 'Allah Teala bu tutulmalar ile kullarına korku salar' kısmını Yunus'tan nakletmemişlerdir",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1050,
			"arabicnumber": 1050,
			"text": "",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1051,
			"arabicnumber": 1051,
			"text": "Abdullah İbn Amr'ın şöyle dediği nakledilmiştir: \"Resulullah Sallallahu Aleyhi ve Sellem zamanında güneş tutulduğu zaman \"Esselatu'l-camiah = Namaz toplayıcıdır\" diye ilan edilmişti. Resul-i Ekrem Sallallahu Aleyhi ve Sellem bu namazın bir rekatında iki defa rüku yaptı. Sonra kalktı ve bir rekat daha namaz kılıp aynı şekilde iki kez rükuya gitti. Sonra oturdu ve bu sırada güneş açıldı.\" Hadisin ravilerinden Ebu Seleme şöyle demiştir: \"Aişe (r.anha), ben bu secdeden daha uzun bir secde kesinlikle yapmadım, dedi",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1052,
			"arabicnumber": 1052,
			"text": "Abdullah İbn Abbas (r.a.)'ın şöyle dediği nakledilmiştir: \"Resulullah Sallallahu Aleyhi ve Sellem zamanında güneş tutulmuştu. Bunun üzerine Nebi Sallallahu aleyhi ve sellem namaza başladı ve kıyamda Bakara suresi okunacak kadar uzun bir süre bekledi. Sonra rükuya gidip uzun bir müddet rü-kuda bekledi. Ardından doğruldu ve ilk kıyam kadar olmasa da uzun bir süre kıyamda bekledi. Sonra yeniden rükuya gitti ve ilk rüku kadar olmasa da uzun bir süre rükuda durdu. Sonra secde edip kalktı. Bu kıyamda da ilk kıyamdaki kadar olmasa da uzun bir müddet bekledi. Ardından rükuya gitti ve İlk rüku kadar olmasa da uzun bir süre rükuda bekledi. Sonra kalktı ve ilk kıyam kadar olmasa da uzun bir süre kıyamda durdu. Ardından rükuya vardı ve ilk rüku kadar olmasa da uzun bir müddet rükuda bekleyip secdeye gitti. Namazı bitirdiğinde güneş de açılmıştı. Namaz bitince Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: Ay ve güneş Allah'ın birer ayetidir. Bunlar ne bir kimsenin ölümü ne de hayatı yüzünden tutulurlar. Eğer ay ve güneşin tutulduğunu görürseniz Allah'ı zikredin!\" Ashab-ı kiram, Nebi Sallallahu Aleyhi ve Sellem'e: \"Ey Allah'ın Resulü, namazda durduğunuz yerde sanki bir şeyi alır gibi uzandığınızı gördük. Fakat sonra geri çekildiniz\" diye sorunca Resulullah Sallallahu Aleyhi ve Sellem şöyle cevap verdi: \"Ben cenneti gördüm ve bir üzüm salkımı almaya uzandım. Eğer onu alsaydım dünya durduğu müddetçe onu yiyecektiniz. Sonra cehennemi de gördüm. Ben bu günde gördüğüm manzara kadar korkunç bir tablo daha önce hiç görmemiştim. Ben cehennemliklerin çoğunun kadın olduğunu gördüm.\" Sahabîler bunun sebebini sorunca Resulullah Sallallahu Aleyhi ve Sellem: \"İnkarları (küfr) sebebiyle\" buyurdu. Ashab: \"Onlar Allah'ı mı inkar (küfr) ediyorlar?\" diye tekrar sorunca Resul-i Ekrem Sallallahu Aleyhi ve Sellem: \"Kocalarına karşı nankörlük ediyorlar, yapılan iyiliği inkar ediyorlar. Sen onlardan birisine dünyaları bağışlasan fakat daha sonra bu kadın senin bir açığını görse hemen şöyle der; Ben senden şimdiye kadar ne hayır gördüm ki!\" diye cevap verdi",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1053,
			"arabicnumber": 1053,
			"text": "Esma binti Ebu Bekir (r.anha) şöyle demiştir: \"Güneş'in tutulduğu gün ResuIullah Sallallahu Aleyhi ve Sellem'in zevcesi Aişe'nin yanına gitmiştim. O sırada ashab-ı kiram namaz kılıyordu. Aişe'nin de onlarla birlikte namaz kıldığını görünce şaşırmıştım. Ben, cemaatin niçin bu vakitte namaz kıldığını Aişe'ye sorunca eliyle göğe işaret etti ve sübhanallah (Allah'ı her türlü noksan sıfatlardan tenzih ederim) dedi. Ben, olağanüstü bir olay mı var, diye tekrar sorunca evet anla­mında başını salladı. Ben de kalkıp namaza durdum. (Resulullah (Sallallahu aleyhi ve Sellem) o kadar uzun bir süre bekledi ki) neredeyse bayılacaktım. Yanıbaşımda bir kırba doiusu su vardı. Kırbayı açıp serinlemek maksadıyla başıma biraz su döktüm. Resul-i Ekrem (Sallallahu aleyhi ve Sellem) namazı bitirdiğinde cemaate dönüp Allah Teala'ya hamd ve senada bulunduktan sonra şöyle buyurdu: \"Daha önce bana hiç gösterilmeyen ne varsa hepsini işte şu bulunduğum yerde gördüm. Hatta cennet ve cehennemi bile... Bana, sizlerin kabirlerde Mesih-Deccal'in fitnesi gibi - veya bu fitneye yakın bir imtihanla karşılaşacağınız vahyedildi. Siz kabirdeyken yanınıza gelecekler ve beni kasdederek: \"Şu zat hakkında bildiğiniz şeyler nelerdir?\" diye soracaklar. Mu'minler - hadisin ravilerinden Hişam bunu yakin (kesin inanç) sahipleri mukin ifadesiyle de nakletmiştir- hemen: \"O, Muhammed'dir, Allah'ın Resulüdür. O bize apaçık delilleri (beyyinat) ve hidayeti getirdi. Biz ona karşı çıkmadan icabet ettik ve kendisine iman edip tabi olduk\" diyecekler. Bunun üzerine onlara: \"Haydi, yaptıklarınızın karşılığını hakkıyla almak üzere huzur icinde uyuyun bakalım! Biz sizin ona iman ettiğinizi zaten biliyorduk \" denecek, buna karşılık münafıklar -hadisin ravilerinden Hişam bunu şüphe eden imseler ifadesiyle de nakletmiştir- kendilerine yöneltilen bu soruya şöyle cevap vereceklerdir: \"Ne bilelim biz! Bir takım insanlar bir şeyler söylüyorlardı ve biz de aynısını söyledik işte",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1054,
			"arabicnumber": 1054,
			"text": "Esma (binti Ebu Bekir (r.a.)'nın şöyle dediği nakledilmiştir: \"Resulullah Sallallahu Aleyhi ve Sellem, güneş tutulduğu zaman köle azat edilmesini emretti.\" باب: صلاة الكسوف في المسجد. 12. Güneş Tutulması Namazının Mescitte Kılınması",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1056,
			"arabicnumber": 1056,
			"text": "",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1057,
			"arabicnumber": 1057,
			"text": "Ebu Mes'ud'dan nakledildiğine göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Ay ve güneş bir kimsenin ne ölümü ne de hayatı yüzünden tutulurlar. Ancak bunlar Allah’ın birer ayetidir. Eğer ay ve güneşin tutulduğunu görürseniz hemen namaz kılın",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1058,
			"arabicnumber": 1058,
			"text": "Resul-i Ekrem Sallallahu Aleyhi ve Sellem zamanında güneş tutulmuştu. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem kalkıp namaza durdu ve ashaba namaz kıldırdı. Nebi Sallallahu Aleyhi ve Sellem kıyamda uzun bir kıraatten sonra rükuya gitti ve rükuda da epey bekledi. Ardından başını kaldırıp doğruldu ve ilk kıraati kadar olmasa da Kur'an'dan uzun bir bölüm okudu. Bu kıyamın ardından yine rüku' etti ve bu rükuda ilk rüku kadar olmasa da uzunca bir süre bekledi. Sonra başını kaldırıp rükudan doğruldu ve iki defa secde etti. Sonra yine kıyama kalktı ve ikinci rekatı da tıpkı birinci rekat gibi kıldırdı. Namazdan sonra da kalkıp cemaate şöyle seslendi: \"Ay ve güneş bir kimsenin ne ölümü ne de hayatı yüzünden tutulurlar. Ancak bunlar Allah'ın kullarına gösterdiği birer ayetidir. Eğer ay ve güneşin tutulduğunu görürseniz derhal namaz kılmaya koşun",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1059,
			"arabicnumber": 1059,
			"text": "Ebu Musa (el-Eş'ari r.a.)'den nakledilmiştir: Güneş tutulmuştu. Bunu gören Nebi Sallallahu Aleyhi ve Sellem yerinden dehşet içinde kalktı. Bunun kıyamet olacağından korkuya kapılmış gibiydi. Bu dehşet içinde mescide girdi ve daha önce hiç görmediğim şekilde kıyamı, rükuu ve secdesi çok uzun olan bir namaz kıldırdı. Namazın ardından da şöyle buyurdu: \"Allah'ın gömdermiş olduğu bu ayetler / deliller asla bir kimsenin ölümü ve hayatı yüzünden meydana gelmez. Fakat Allah Teala bunlar ile kullarına korku salar. Siz bu tür olağandışı olaylar görürseniz hemen Allah'ı zikretmeye, Ona yalvarmaya ve Ondan af dilemeye (istiğfar) başlayın",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1060,
			"arabicnumber": 1060,
			"text": "Muğîre İbn Şu'be'nin şöyle dediği nakledilmiştir: \"Resul-i Ekrem Sallallahu Aleyhi ve Sellem zamanında oğlu İbrahim'in öldüğü gün güneş tutulmuştu. Bunun üzerine insanlar: Güneş İbrahim öldüğü için tutuldu, demeye başladılar. Nebi Sallallahu Aleyhi ve Sellem onların bu sözünü duyunca şöyle buyurdu: \"Güneş ve ay Allah'ın birer ayetidir. Bunlar ne bir kimsenin ölümü ne de hayatı dolayısıyla tutulur. Siz güneşin ve ayın tutulduğunu görürseniz açılıncaya kadar Allah'a dua edin ve namaz kılın!\" باب: قول الإمام في خطبة الكسوف أما بعد. 16. İmamın Güneş Tutulması Namazı Hutbesinde Emma ba'du (Asıl Konuya Gelince) Demesi",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1061,
			"arabicnumber": 1061,
			"text": "Esma binti Ebu Bekir (r.anha)'nın şöyle dediği nakledilmiştir: \"Resul-i Ekrem Sallallahu Aleyhi ve Sellem namazı bitirdiğinde güneş iyice açılmıştı. Nebi Sallallahu Aleyhi ve Sellem daha sonra cemaate dönüp hitap etmeye başladı. Hutbe öncesinde Allah Teala'ya layık olduğu veçhile hamd etti ve ardından, Emma ba'du (şimdi asıl konuya gelelim), dedi.\" باب: الصلاة في كسوف القمر. 17. Ay Tutulması Sırasında Namaz Kılmak",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1062,
			"arabicnumber": 1062,
			"text": "Ebu Bekre (r.a.)'in şöyle dediği nakledilmiştir: \"Resulullah Sallallahu Aleyhi ve Sellem zamanında güneş tutuldu ve Nebi Sallallahu Aleyhi ve Sellem İki rekat namaz kıldı",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1063,
			"arabicnumber": 1063,
			"text": "Ebu Bekre'nin şöyle dediği nakledilmiştir: \"Resul-i Ekrem Sallallahu Aleyhi ve Sellem hayatta İken güneş tutulması oldu. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem omuzuna attığı ridasını sürüyerek yanımızdan ayrıldı ve mescide girdi. Orada bulunanlar da onu takip ederek mescide gittiler. Resulullah Sallallahu Aleyhi ve Sellem iki rekat namaz kıldırdı ve bir süre sonra güneş açıldı. Namaz sonrasında şöyle buyurdu: \"Güneş ve ay Allah'ın birer ayetidir. Bunlar hiçkimsenin ölümü dolayısıyla tutulmaz. Siz bunların tutulduğunu görürseniz tekrar açılana kadar namaz kılın ve dua edin!\" Nebi Sallallahu Aleyhi ve Sellem'in, İbrahim adındaki oğlu vefat edince insanlar güneş tutulmasının bu yüzden meydana geldiğini söylemişlerdi. İşte Resulullah Sallallahu Aleyhi ve Sellem bu sözleri duyunca namaz sonunda böyle söylemişti.\" باب: الركعة الأولى في الكسوف أطول. 18. Güneş Tutulması Namazının İlk Rekatı Daha Uzun Olur",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1064,
			"arabicnumber": 1064,
			"text": "Aişe Nebi Sallallahu Aleyhi ve Sellem'in kendilerine güneş tutulması dolayısıyla dört rekat namaz kıldırdığını ve bu namazda her bir rekatın bir sonraki rekata göre daha uzun olduğunu nakletmiştir",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1066,
			"arabicnumber": 1066,
			"text": "",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 24
			}
		}
	]
}