{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"18": "Shortening the Prayers (At-Taqseer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1080,
			"arabicnumber": 1080,
			"text": "İbn Abbas (r.a.)'ın şöyle dediği nakledilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem bir yerde (gecesiyle birlikte) on dokuz gün kaldı ve bu müddet içinde na­mazları kısaltarak kıldı. Biz (gecesiyle birlikte) on dokuz günlük yolculuk yaptığımızda namazları kısaltarak kılardık. Fakat daha uzun süreli yolculuklarda tam kılardık. Tekrar: 4298, 4299",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1081,
			"arabicnumber": 1081,
			"text": "Enes (r.a.)'in şöyle dediği nakledilmiştir: \"Resul-i Ekrem Sallallahu Aleyhi ve Sellem ile birlikte Medine'den Mekke'ye gitmek üzere yola çıkmıştık. Biz Medine'ye dönene kadar Nebi Sallallahu Aleyhi ve Sellem namazları ikişer rekat halinde kılmıştı.\" Hadisin ravîlerinden Yahya İbn Ebu İshak, Enes'e: \"Mekke'de hiç kaldınız mı?\" diye sorunca Enes Ibn Malik şu cevabı vermiştir: \"Orada on gün kaldık. Tekrar: 4297",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1082,
			"arabicnumber": 1082,
			"text": "Abdullah (İbn Ömer r.a.)'dan nakledilmiştir: \"Ben Mina'daki namazları Resulullah Sallallahu Aleyhi ve Sellem, Ebu Bekir ve Ömer radıyallahu anhuma ile birlikte ikişer rekat halinde kıldım. Osman (r.a.) döneminin başlarında da onunla birlikte Mina'daki namazları böyle kıldım. Fakat Osman (r.a.) daha sonra tam olarak kılmaya başladı. Tekrar: 1655",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1083,
			"arabicnumber": 1083,
			"text": "Harise İbn Vehb'in şöyle dediği nakledilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem güven ortamının en zirvede olduğu dönemde bizlere Mina'da namazları iki rekat olarak kıldırdı. Tekrar: 1656",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1084,
			"arabicnumber": 1084,
			"text": "Abdurrahman İbn Yezîd'in şöyle dediği nakledilmiştir: \"Osman bize Mina'da dört rekat namaz kıldırdı. Bu durum Abdullah İbn Mes'ud'a arzedildi ve şikayetler iletildi. Bunun üzerine İbn Mes'ud فاسترجع [istirca etti yani inna ileyhi raciun] diyerek şaşkınlığını ve üzüntüsünü belirtti. Ardından da şöyle dedi: \"Ben Nebi Sallallahu Aleyhi ve Sellem ile birlikte Mîna'da iki rekat namaz kıldım, ardından Hz. Ebu Bekir ve Ömer (r.a.) ile de Mina'da namazı iki rekat kıldım. Dört rekat kılmaktansa kabul olunmuş iki rekatlık namaz kılmak daha çok hoşuma gider. Tekrar: 1657",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1085,
			"arabicnumber": 1085,
			"text": "Abdullah İbn Abbas (r.a.)'ın şöyle dediği nakledilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem ve ashabı Zilhicce'nin dördüncü gününün sabahında geldiler ve hac için telbiye getirdiler. Fakat Nebi Sallallahu Aleyhi ve Sellem kurbanları (hedy) bulunanlar dışındakilerin hepsinin bunu umreye çevirmesini emretti. Tekrar: 1564, 2505, 3832",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1086,
			"arabicnumber": 1086,
			"text": "İbn Ömer (r.a.)'den nakledildiğine göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Kadınlar yanlarında kendileriyle evlenmeleri haram olan bir yakınları bulunmadan üç günden fazla olan yolculuğa çıkmasın",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1087,
			"arabicnumber": 1087,
			"text": "İbn- Ömer r.a. Resulullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmiştir: \"Kadınlar yanlarında kendileriyle evlenmeleri haram olan bir yakınları bulunmadan üç günlük yolculuğa çıkmasın",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1088,
			"arabicnumber": 1088,
			"text": "Ebu Hureyre radiyallahu anh'den nakledildiğine göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Allah'a ve ahiret gününe iman eden bir kadın'ın bir gün ve bir gecelik yolculuğa yanında kendisiyle evlenmesi haram olan biri bulunmadan çıkması hela! değildir",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1089,
			"arabicnumber": 1089,
			"text": "Enes İbn Malik (r.a.)'in şöyle dediği nakledilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem ile birlikte öğle namazını Medine'de dört, Zülhuleyfe'de ise iki rekat kıldım. Tekrar: 1546-1548, 1551, 1712, 1714, 1715, 2951, 2986",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1090,
			"arabicnumber": 1090,
			"text": "Aişe'nin şöyle dediği nakledilmektedir: \"Namaz ilk farz kılındığında iki rekat idi. Yolculuk namazı aynen iki rekat kaldı, fakat mukîmin namazı ise dörde tamamlandı.\" Zührî der ki: \"Ben Urve'ye, peki Aişe niçin tam kılıyor, diye sorduğumda bana şu cevabı verdi: O da Osman'ın yorumuyla aynı yorumu yaptı",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1092,
			"arabicnumber": 1092,
			"text": "",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1093,
			"arabicnumber": 1093,
			"text": "Abdulah İbn Amir babasının şöyle dediğini nakletmiştir: \"Resul-i Ek­rem Sallallahu Aleyhi ve Sellem'in bineği üzerinde iken - binek ne tarafa yönelirse yönelsin namaz kıldığını gördüm",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1094,
			"arabicnumber": 1094,
			"text": "Cabir İbn Abdullah'tan nakledilmiştir: \"Resulullah Sallallahu Aleyhi ve Sellem kıble yönünde olmasa bile nafile namazları binek üzerinde iken kılardı",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1095,
			"arabicnumber": 1095,
			"text": "Nafi'in şöyle dediği nakledilmiştir; \"İbn Ömer (r.a.) yolculuk sırasında bineğinin üzerinde hem nafile namazları hem de vitir namazını kılar ve Nebi Sallallahu Aleyhi ve Sellem'in de böyle yaptığını söylerdi.\" باب: الإيماء على الدابة. 8. Binek Üzerinde İken İma İle Namaz Kılmak",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1096,
			"arabicnumber": 1096,
			"text": "Abdullah İbn Dinar'ın şöyle dediği nakledilmiştir: \"Abdullah İbn Ömer (r.a.) yolculuk sırasında bineği üzerinde namaz kılardı. Binek ne tarafa yönelirse yönelsin namazını ima ile eda ederdi ve Resulullah Sallallahu Aleyhi ve Sellem'in de böyle yaptığını söylerdi",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1097,
			"arabicnumber": 1097,
			"text": "Abdullah İbn Amir İbn Rebia, babası Amir İbn Rebia'nın kendisine şu olayı haber verdiğini söylemiştir: \"Ben Resul-i Ekrem Sallallahu Aleyhi ve Sellem'i bineği üzerinde nafile namaz kılarken gördüm; binek ne tarafa yönelirse yönelsin başı ile ima ediyordu. Fakat Resulullah Sallallahu Aleyhi ve Sellem farz namazları hiçbir zaman binek üzerinde kılmamıştır",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1098,
			"arabicnumber": 1098,
			"text": "İbn Şihab, Salim'in şöyle dediğini nakletmiştir: 'Abdullah İbn Ömer (r.a.) geceleri yolculuk ederken bineği üzerinde namaz kılardı ve bineğin ne tarafa yöneldiğine hiç aldırış etmezdi. Bu şekilde namaz kıldıktan sonra şöyle demişti; \"Resul-i Ekrem Sallallahu Aleyhi ve Sellem bineği üzerinde - binek ne tarafa yönelirse yönelsin - nafile namaz kılardı. Binek üzerinde vitir namazını kıldığı da oldu. Ancak farz namazları binek üzerinde kılmazdı",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1099,
			"arabicnumber": 1099,
			"text": "Cabir İbn Abdullah (r.a.)'den nakledildiğine göre Resulullah Sallallahu Aleyhi ve Sellem bineği üzerinde iken doğu tarafına yönelerek namaz kıldı. Farzı kılmak isteyince de bineğinden inip kıbleye yöneldi",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1100,
			"arabicnumber": 1100,
			"text": "Enes İbn Sirin şöyle demiştir: Enes İbn Malik (r.a.)'in Şam'dan gelmekte olduğunu öğrenince onu karşılamaya çıktık. Aynu't-Temr denen yerde onunla karşılaştık. Onun merkebi üzerinde namaz kıldığını gördüm; kıblenin sol tarafına doğru yönelmişti. Ona; \"Senin kıble dışında bir yöne dönerek namaz kıldığını gördüm!?\" diyerek şaşkınlığımı belirttiğimde şu cevabı verdi; \"Ben Nebi Sallallahu Aleyhi ve Sellem'in böyle yaptığını görmeseydim asla bu şekilde namaz kılmaya kalkışmazdım",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1101,
			"arabicnumber": 1101,
			"text": "Hafs İbn Asım anlatıyor: \"Abdullah İbn Ömer (r.a.) ile bir yolculukta beraberdim. Şunları söylemişti; Ben Nebi Sallallahu Aleyhi ve Sellem ile birlikte bulundum ve O'nun Sallallahu Aleyhi ve Sellem yolculuk sırasında nafile namaz kıldığını görmedim. Zaten Allah (O'na uymamızı emrederek) \"Şüphesiz Allah'ın Resulünde sizler için en güzel bir örnek vardır [Ahzab 21] buyurmuştur",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1102,
			"arabicnumber": 1102,
			"text": "Abdullah İbn Ömer (radiyallahu anh) şöyle der: \"Resulullah Sallallahu Aleyhi ve Sellem ile birlikte bulundum. O, yolculuk sırasında iki rekat farz namaz dışında namaz kılmazdı. Ebu Bekir, Ömer ve Osman (r.anhum) da aynı şekilde hareket ederdi",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1103,
			"arabicnumber": 1103,
			"text": "İbn Ebi Leyla şöyle demiştir: \"Ümmü Hani dışında hiç kimse Nebi Sallallahu Aleyhi ve Sellem'in kuşluk vaktinde namaz kıldığını haber vermemiştir. Ümmü Hani'nin haber verdiğine göre Resulullah Sallallahu Aleyhi ve Sellem Mekke fethedildiği gün onun evinde boy abdesti almış ve sekiz rek'at namaz kılmıştır. Ümmü Hani Nebi Sallallahu Aleyhi ve Sellem'in namazını şöyle anlatmıştır: \"Ben Resul-i Ekrem Sallallahu Aleyhi ve Sellem'in bundan daha hafif sade bir namaz kıldığını hiç görmedim. Fakat bununla birlikte rüku ve secdeleri tam olarak yapmıştı",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1104,
			"arabicnumber": 1104,
			"text": "Abdullah İbn Amir (r.a.) babasının naklettiği bir olayı anlatıyor: \"Nebi Sallallahu Aleyhi ve Sellem'in gece yolculuk sırasında bineği üzerinde iken - binek ne tarafa yönelirse yönelsin - namaz kıldığını gördüm",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1105,
			"arabicnumber": 1105,
			"text": "İbni Ömer (r.a.)'den nakledildiğine göre Resulullah Sallallahu Aleyhi ve Sellem yüzü ne tarafa yönelirse yönelsin bineği üzerinde iken başıyla ima ederek namaz kılardı. Zaten İbn Ömer de tıpkı Resulullah Sallallahu Aleyhi ve Sellem gibi hareket ederdi",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1106,
			"arabicnumber": 1106,
			"text": "Salim babasının şöyle dediğini nakletmiştir: \"Nebi Sallallahu Aleyhi ve Sellem yolculuk sıkıntılı ve hızlı olduğu zaman akşam İle yatsı namazlarını cem' ederek birlikte kılardı",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1107,
			"arabicnumber": 1107,
			"text": "Abdullah İbn Abbas'ın şöyle dediği nakledilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem yolculuk sırasında öğle ve ikindi namazlarını ayrıca akşam ve yatsı namazlarını cem' ederek birlikte kılardı",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1108,
			"arabicnumber": 1108,
			"text": "Enes İbn Malik (r.a.)'in şöyle dediği nakledilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem yolculuk sırasında akşam ve yatsı namazlarını cem' ederek birlikte kılardı",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1109,
			"arabicnumber": 1109,
			"text": "Abdullah İbn Ömer (r.a.)'in şöyle dediği nakledilmiştir: \"Resulullah Sallallahu Aleyhi ve Sellem'in bir an evvel tamamlanması gereken yolculuklar sırasında akşam namazını geciktirdiğini ve yatsı namazıyla cem' ederek birlikte kıldığını gör­düm.\" Salim şöyle demiştir: \"Abdullah İbn Ömer de bir an önce tamamlanması gereken yolculuklarda böyle yapardı: Akşam namazı için kamet getirir ve üç rekat namaz kılıp selam verirdi. Ardından çok kısa bir süre bekler ve yatsı namazı için kamet getirdikten sonra iki rekat namaz kılıp selam verirdi. O bu iki namaz arasında veya yatsıdan sonra başka bir nafile namaz kılmazdı. Ancak gece yarısı olduğunda nafile namaza başlardı",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1110,
			"arabicnumber": 1110,
			"text": "Enes İbn Malik (r.a.) Akşam ve yatsı namazlarını kasdederek: \"Nebi Sallallahu Aleyhi ve Sellem bu iki namazı cem' ederek birlikte kıldı\" demiştir",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1111,
			"arabicnumber": 1111,
			"text": "Enes İbn Malik (r.a.)'in şöyle dediği nakledilmiştir. \"Nebi Sallallahu Aleyhi ve Sellem güneş batıya doğru meyletmeden önce yolculuğa çıkmışsa öğle namazını ikindiye kadar geciktirir ve daha sonra ikisini birlikte kılardı. Güneş tepe noktasından batıya meyletmişse, önce öğle namazını kılar ve ardından yolculuğa başlardı",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1112,
			"arabicnumber": 1112,
			"text": "Enes İbn Malik (r.a.)'in şöyle dediği nakledilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem güneş batıya doğru meyletmeden önce yolculuğa çıkmışsa öğle na­mazını ikindiye kadar geciktirir ve daha sonra ikisini birlikte kılardı. Fakat yol­culuğa çıkmadan önce güneş tepe noktasından batıya doğru meyletmişse önce öğle namazını kılar ve ardından yolculuğa başlardı",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1113,
			"arabicnumber": 1113,
			"text": "Aişe (r.anha)'nın şöyle dediği nakledilmiştir; \"Resul-i Ekrem Sallallahu Aleyhi ve Sellem hasta İken evinde oturarak namaz kılmış ve ashab-ı kiram da ayakta durarak O'na uymuştu. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem onlara oturun anlamında eliyle işaret etti. Namaz bittikten sonra da şöyle buyurdu: \"İmam kendisine uyulması için vardır. O rüku ettiğinde siz de rüku edin, o doğrulduğunda siz de doğrulun",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1114,
			"arabicnumber": 1114,
			"text": "Enes İbn Malik (r.a.)'in şöyle dediği nakledilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem bir defasında bindiği attan düşüp sağ tarafını incitmişti. Biz de onu ziyarete gittik. Bu sırada namaz vakti girdi. Bu yüzden namazlardan birisini oturarak kıldırmıştı. Biz de O'nun arkasında namazlarımızı oturarak kılmıştık. Resul-i Ekrem Sallallahu Aleyhi ve Sellem Efendimiz namaz bitince şöyle buyurmuştu: \"İmam kendisine uyulması için vardır; o tekbir getirdiğinde siz de tekbir ge­tirin, o rükuya vardığında siz de rüku edin, o doğrulduğunda siz de doğrulun, (Semi'allahu limen hamideh) dediği zaman siz (Rabbena ve lekel hamd) deyin",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1115,
			"arabicnumber": 1115,
			"text": "Basur (hemeroid) hastası olan Imran İbn Husayn Nebi Sallallahu Aleyhi ve Sellem'e oturarak namaz kılmanın hükmünü sordu ve Resul-i Ekrem (Sallallahu aleyhi ve Sellem): \"Ayakta kılmak daha faziletlidir. Oturarak kılan ayakta kılan kimsenin sevabının yarısı kadar sevap alır. Yatarak kılan ise oturarak kılan kimsenin sevabının yarısı kadar sevap alır",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1116,
			"arabicnumber": 1116,
			"text": "İmran İbn Husayn basur / hemoroid hastası olduğunda şöyle demiştir: \"Nebi Sallallahu Aleyhi ve Sellem'e oturarak namaz kılmanın hükmünü sordum. Bana şöyle cevap verdi: \"Ayakta kılmak daha faziletlidir. Oturarak kılan ayakta kılan kimsenin sevabının yarısı kadar sevap alır. Uyuyarak kılan ise oturarak kılan kimsenin sevabı­nın yarısı kadar sevap alır.\" Ebu Abdullah (İmam Buharî) şöyle demiştir: \"Bana göre burada uyuyarak diye ifade edilen durum, uzanarak / yatarak namaz kılmak anlamındadır.\" باب: إذا لم يطق قاعدا صلى على جنب. 19. Oturarak Namaz Kılamayan Bir Kimse Yanı Üzerine Uzanarak Kılar -وقال عطاء: إن لم يقدر أن يتحول إلى القبلة صلى حيث كان وجهه. Ata' şöyle demiştir: \"Bîr kimse namaz kılmak İçin kıbleye dönemeyecek durumda ise yüzü ne tarafa dönük ise oraya doğru namaz kılar",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1117,
			"arabicnumber": 1117,
			"text": "İmran İbn Husayn anlatıyor: \"Basur (hemeroid) olmuştum. Nebi Sallallahu Aleyhi ve Sellem'e namazı nasıl kılacağımı sorduğumda bana şöyle cevap vermişti: \"Ayakta kıl. Ayakta kılamayacak kadar kötü durumdaysan oturarak kıl. Oturmaya da gücün yetmiyorsa yanın üzerine uzanarak kıl",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1118,
			"arabicnumber": 1118,
			"text": "Müminlerin annesi Aişe (r.anha) şöyle demiştir: \"Nebi Sallallahu Aleyhi ve Sellem'in yaşı ilerleyinceye kadar gece namazlarını oturarak kıldığını hiç gör­medim. Yaşlandığı zamanlar oturarak okur ve rükuya varmak istediğinde kalkıp otuz veya kırk ayet civarında Kur'an okuduktan sonra rükua giderdi. Tekrar: 1148, 1161, 1168 vs 4837 İZAHI 574’TE",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1119,
			"arabicnumber": 1119,
			"text": "Mu'minlerin annesi Aişe (r.anha)'nın bildirdiğine göre: Nebi Sallallahu Aleyhi ve Sellem oturarak namaz kılardı. Ayetlerin bir kısmını oturarak okuyup geriye otuz veya kırk ayetlik bir bölüm kalınca kalkar ve bunları ayakta okuyup rükuya varır, sonra da secdeye giderdi. Namazın ikinci rekatını da aynı şekilde kılardı. Namazını bitirdikten sonra bakar ve eğer ben uyanıksam benimle biraz konuşurdu. Fakat uyuyorsam O sallallahu aleyhi ve sellem da uzanırdı",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 39
			}
		}
	]
}