{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"2": "Belief"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 8,
			"arabicnumber": 8,
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 9,
			"arabicnumber": 9,
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 10,
			"arabicnumber": 10,
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 11,
			"arabicnumber": 11,
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 12,
			"arabicnumber": 12,
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 13,
			"arabicnumber": 13,
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 14,
			"arabicnumber": 14,
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 15,
			"arabicnumber": 15,
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 16,
			"arabicnumber": 16,
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 17,
			"arabicnumber": 17,
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 18,
			"arabicnumber": 18,
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 19,
			"arabicnumber": 19,
			"text": "Ebû Saîd el-Hudrî (radıyallahü anh) şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: \"Koyunun, kişinin hayırlı malı olması (devri) yaklaşır: Müslüman, dinine sâhib olmak üzere fitnelerden kaçarak koyun sürüsünü dağların başına ve yağmur mevkilerine (yani vadilerin engin yerlerine) götürür",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 20,
			"arabicnumber": 20,
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 21,
			"arabicnumber": 21,
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 22,
			"arabicnumber": 22,
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 23,
			"arabicnumber": 23,
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 24,
			"arabicnumber": 24,
			"text": "Zuheyr ibnu Râfi'in el-Ensârî ve kardeşi:",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 25,
			"arabicnumber": 25,
			"text": "Bize Şu'be, Vâkıd ibn Muhammed'den tahdîs etti: Şöyle demiştir: Ben babamdan işittim; İbn Omer'den tahdîs ediyordu (O şöyle demiştir): Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: başka hakk ilâh olmadığına ve Muhammed'in Rasûlüllah olduğuna (zahirde) şehâdet, namazı ikaame, zekâtı eda edinceye kadar insanlarla muharebe etmekliğim bana emrolundu. Onlar bu işleri yapınca -Müslümanlık hakkının gereği (olan haddler) müstesna- İslâm hakkı olmak üzere canlarını ve mallarını benim elimden kurtarırlar. (Bâtınlarından dolayı olan)hesâblarına gelince, o (hesabı görmek)Allah'a âiddir",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 26,
			"arabicnumber": 26,
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 27,
			"arabicnumber": 27,
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 28,
			"arabicnumber": 28,
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 29,
			"arabicnumber": 29,
			"text": "Ibn Abbâs(radıyallahü anh) şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem): Bana cehennem gösterildi, bir de gördüm ki cehennem ahâlîsinin çoğu kadınlardır. Onlar küfr ederler, buyurdu. üzerine: Allah'a mı küfr ederler? diye soruldu. Peygamber: Onlar kocalarına karşı küfran ederler, iyiliğe karşı küfrân ederler. Birisine bütün zaman ihsan etsen de sonra senden (hoşuna gitmeyen) bir şey görse, \"Ben senden hiçbir hayır görmedim\" der",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 30,
			"arabicnumber": 30,
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 31,
			"arabicnumber": 31,
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 32,
			"arabicnumber": 32,
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 33,
			"arabicnumber": 33,
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 34,
			"arabicnumber": 34,
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 35,
			"arabicnumber": 35,
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 36,
			"arabicnumber": 36,
			"text": "Bize Ebû Zur'a ibnu Amr ibn Cerîr tahdîs edip şöyle dedi: Ben Ebû Hureyre (radıyallahü anh)'den işittim; Peygamber(sallallahü aleyhi ve sellem) buyurdu ki: “Allah kendi yolunda cihâda çıkan kimseye: \"Onu evinden çıkaran şey yalnız bana îmân ve elçilerimi tasdik ise, nail olduğu ecir ve ganimetle (salimen yurduna) geri getireyim, yâhut cennete girdireyim\" diye tekeffül etmiştir. Ümmetime meşakkat verecek olmasaydım, hiçbir cihâd müfrezesinin arkasından geri kalmazdım. Yemîn olsun ki Allah yolunda öldürülüp diriltilmemi, ondan sonra öldürülüp diriltilmemi, ondan sonra öldürülmemi ne kadar isterdim!”",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 37,
			"arabicnumber": 37,
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 38,
			"arabicnumber": 38,
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 39,
			"arabicnumber": 39,
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 40,
			"arabicnumber": 40,
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 41,
			"arabicnumber": 41,
			"text": "İmâm Mâlik şöyle dedi: Bana Zeyd ibn Eslem haber verdi. Ona da Ata ibn Yesâr haber verdi. Ona da Ebû Saîd Hudrî haber verdi ki, kendisi Rasûlüllah(sallallahü aleyhi ve sellem)'dan şöyle derken işitmiştir: kul müslümân olur ve müslümânlığı da güzel olursa, Allah onun evvelce işlemiş olduğu her kötülüğünü örter. Ondan sonra sıra kısasa (yani mükâfat ve mücâzâta) gelir. Bir hasene, ondan yedi yüz kat büyük hasene ile; bir seyyie (yani kötülük) ise, yalnız kendi misli ile karşılanır: meğer ki Allah o seyyieyi afveder",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 42,
			"arabicnumber": 42,
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 43,
			"arabicnumber": 43,
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 44,
			"arabicnumber": 44,
			"text": "Bize Katâde, Enes(radıyallahü anh)'ten tahdîs etti. Peygamber (sallallahü aleyhi ve sellem) buyurdu ki: \"La ilahe ille'llâh deyip de kalbinde bir arpa ağırlığınca hayr (yani îmân) bulunan kimse cehennemden çıkacaktır. La ilahe ille'llâh deyip de kalbinde bir buğday ağırlığınca hayr bulunan kimse cehennemden çıkacaktır. La ilahe ille'llâh deyip de kalbinde bir zerre ağırlığınca hayr bulunan kimse cehennemden çıkacaktır.\" Abdillah Buharı şöyle dedi: Ebân: Bize Katâde tahdîs etti; bize Enes Peygamber'den tahdîs etti, dedi. Bu isnâddaki hadîste \"hayrdan\" yerine \"îmândan\" ta'bîri geldi",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 45,
			"arabicnumber": 45,
			"text": "Bize Kays ibn Müslim(120), Tarık ibn Şihâb (83-radıyallahü anh)'den haber verdi; şöyle demiştir: Yahûdîler'den bir kimse Omer ibn Hat-tâb (radıyallahü anh)'a: Ey Mü'minlerin Emîri! Sizin Kitâb'ınızda okumakta olduğunuz bir âyet var ki, biz Yahûdî topluluğuna nazil olmuş olaydı, nazil olduğu günü bayram edinirdik, dedi. Hangi âyettir o? diye sordu. Yahûdî: \"Bu gün sizin dîninizi kemâle erdirdim, üzerinizdeki nimetimi tamamladım ve size dîn olarak müslümânlıktan hoşnûd oldum...\" (Mâide: 5/3) cevâbını verdi. üzerine Omer: Biz bu âyetin indiği günü de, yeri de biliyoruz (kıymetini takdîr ediyoruz). Bu âyet Peygamber'e bir cuma günü Arafa'da kaaim iken nazil olmuştur, dedi",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 46,
			"arabicnumber": 46,
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 47,
			"arabicnumber": 47,
			"text": "Bize Ahmed ibnu Abdillah ibn Alî el-Mencûfî (252) tahdîs edip şöyle dedi: Bize Ravh (205) tahdîs edip şöyle dedi: Bize Avf ibn Ebî Cemile (146) Hasen Basrî'den ve Muhammed ibn Sîrîn (l 10)'den; onlar da Ebû Hureyre(radıyallahü anh)'den tahdîs etti(ki Ebû Hureyre şöyle demiştir); Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: kim îmânı sebebiyle ve sevabını yalnız Allah'tan umarak bir müslümân cenazesi arkasından gider ve üzerine namaz kılıp gömülmesini bitirinceye kadar beraber bulunursa, iki kîrât ecr ile döner ki, kîrâtların her biri Uhud dağı gibidir. Her kim o cenaze üzerine namaz kılar da defn olunmadan evvel dönerse, bir kîrât ecr ile dönmüş olur\". ibn Ebî Heysem el-Müezzin(220), bu hadîsi Avf el A'râbî(146)'den rivayet etmekte Ravh'a mutâbaat etti. Dedi ki: Bize Avf, Muhammed ibn Sîrîn'den; o da Ebû Hureyre'den; o da Peygamber'den olmak üzere geçen hadîs gibi tahdîs etti",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 48,
			"arabicnumber": 48,
			"text": "Zubeyd(122) dedi ki: Ben Ebû Vâil(100)'e Murcie fırkası hakkında sordum. Bunun üzerine şöyle dedi: Bana Abdullah ibn Mes'ûd (radıyallahü anh) tahdîs etti ki, Peygamber (sallallahü aleyhi ve sellem):\"Müslüman'a sövmek fısk, onunla kıtal etmek küfürdür\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 49,
			"arabicnumber": 49,
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 50,
			"arabicnumber": 50,
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 51,
			"arabicnumber": 51,
			"text": "Abdullah ibn Abbâs haber verip, şöyle dedi: Bana Ebû Sufyân haber verdi ki, Hırakl ona şöyle demiştir: \"Ben sana; onlar (yani müslümânlar) artıyor mu, yoksa eksiliyor mu diye sordum. Sen, onların artmakta olduklarını söyledin, îmân keyfıyyeti de tamâm oluncaya kadar hep böyle gider. Ben sana, içlerinde O'nun dînine girdikten sonra beğenmemezlikten dolayı dînden dönen var mıdır diye sordum. Hayır, dedin, îmân da, mûcib olduğu inşirah ve ferahlık kalblere karışıp kökleşince böyle olur; hiç kimse onu sevmemezlik ermez",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 52,
			"arabicnumber": 52,
			"text": "Âmir dedi ki: Ben Nu'mân ibn Beşîr (64-radıyallahü anh)'den şöyle derken işittim: Ben Rasûlüllah(sallallahü aleyhi ve sellem)'dan şöyle buyururken işittim: \"Halâl belli, haram da bellidir. İkisi arasında (halâl mı, haram mı belli olmayan bir takım) şübheli şeyler vardır ki, çok kimseler bunları bilmezler. Her kim şübheli şeylerden sakınırsa, ırzını da, dînini de tertemiz tutmuş olur. Her kim şübheli şeylere dalarsa, (içine girmek yasak olan) koruluk etrafında davarlarını otlatan bir çoban gibi, çok sürmez içeriye dalabilir. Haberiniz olsun, her devlet başkanının kendine mahsûs bir koruluğu olur. Gözünüzü açın; Allah'ın yeryüzündeki koruluğu da haram ettiği şeylerdir. Haberiniz olsun ki, bedenin içinde bir lokmacık et parçası vardır ki iyi olursa bütün beden iyi olur; bozuk olursa bütün beden bozulur. İşte o(et parçası)kalbdir",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 53,
			"arabicnumber": 53,
			"text": "Bize Aliyyu'bnu'l-Ca'd(230) tahdîs edip şöyle dedi: Bize Şu'be, Ebû Cemre ed-Dab'î (128)'den haber verdi. Ebû Cemre şöyle dedi: Ben İbn Abbâs'ın maiyyetinde oturuyordum; İbn Abbâs beni kendi seririnin üzerine oturtur idi. Bana: Benim yanımda ikaamet et, sana kendi malımdan bir hisse ayırayım, dedi. Bunun üzerine ben onun maiyyetinde iki ay ikaamet ettim. Sonra İbn Abbâs şöyle dedi: Abdu'l-Kays hey'eti(Bahreyn taraflarından) Peygamber'in yanına geldikleri zaman, Peygamber (sallallahü aleyhi ve sellem): Sizler kimlerdensiniz, yahut: Nerenin hey'etisiniz? diye sordu. Onlar: Biz Rabîa kabîlesindeniz, dediler. Hoş geldiniz, Allah sizleri utandırmasın, pişman etmesin, buyurdu. üzerine: Yâ Rasûlallah, biz sana yalnız haram ayda gelebiliriz. Seninle aramızda kâfir olan Mudar kabilelerinden şu topluluk vardır. O hâlde bize kestirme bir şey emret de geride kalanlarımıza haber verelim; o sebeble de cennete girelim, dediler. Peygamber'e içkileri de sordular. onlara dört şey emretti, dört şeyden de nehy etti. Onlara yalnız Allah'a îmân ile emrettikten sonra: Yalnız Allah'a îmân etmek ne demektir, bilir misiniz? diye sordu. Allah ve Rasûl'ü en iyi bilendir, dediler. Peygamber: “Allah'tan başka ilâh olmadığına ve Muhammed'in Allah'ın elçisi olduğuna şehâdet, namazı dosdoğru kılmak, zekâtı eda etmek, ramazân orucunu tutmak ve ganimetin beşte birini vermenizdir” buyurdu. onları dört şeyden, yâni hantem, dubbâ', nakîr, müzeffet (denilen kaplara hurma yahut üzüm şırası koymak)ten nehyetti. İbn Abbâs'ın müzeffet yerine mukayyar dediği de rivayet edilmiştir. ardından Rasûlüllah o hey'et ferdlerine: Bu emrettiklerimi iyice belleyiniz ve bunları arkanızda bıraktığınız kimselere haber veriniz” buyurdu",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 54,
			"arabicnumber": 54,
			"text": "Bize Mâlik, Yahya ibn Saîd'den; o da Muhammed ibn İbrahim'den, o da Alkame ibn Vakkas'tan;o da Omer(radıyallahü anh) 'den haber verdi ki, Omer şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem) şöyle buyurdu: niyete göredir. Her bir kimse için ancak niyet ettiği şey vardır. Binâenaleyh her kimin hicreti Allah'a ve Rasûl'üne yönelmişse, onun hicreti Allah'a ve Rasûl'ünedir. Artık nail olacağı bir dünyâ veya evleneceği bir kadından dolayı hicret etmiş kimse varsa, onun hicreti, hicretine sebeb olan şeyedir",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 55,
			"arabicnumber": 55,
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 56,
			"arabicnumber": 56,
			"text": "Sa'd ibn Ebî Vakkas(radıyallahü anh) oğluna şöyle haber vermiştir: (sallallahü aleyhi ve sellem) bana hitaben şöyle buyurdu: \"Şübhesiz sen, Allah rızâsını arayarak yapacağın her bir harcamadan dolayı muhakkak ecre nail olacaksın, hattâ eşinin ağzına verdiğin lokmaya kadar",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 57,
			"arabicnumber": 57,
			"text": "Bana Kays ibn Ebî Hâzım'dan, o da Cerîr ibn Abdillah (74-8)'dan tahdîs etti; o şöyle demiştir: Ben Rasûlüllah(sallallahü aleyhi ve sellem)'a namazı ikaame etmek, zekât vermek, her müslümâna nasihat edip hayırhah olmak üzere bey'at ettim",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 58,
			"arabicnumber": 58,
			"text": "Bize Ebû Avâne, Ziyâd ibn Ilâka (125)'dan tahdîs etti. Şöyle demiştir: Ben Cerîr ibn Abdillah (radıyallahü anh)'dan şöyle derken işittim: Basra vâlîsi Mugîre ibn Şu'be'nin vefat ettiği gün(50) ayağa kalktı da, Allah'a hamd ve sena ettikten sonra: Başınıza bir emîr gelinceye kadar tek ve ortaksız olan Allah'a ittikaa, vakaar ve sekinet üzere bulunmanızı tavsiye ediyorum. Zîrâ emîriniz şimdi buraya geliyor, diye nasihat etti. Müteakiben: (Vefat eden) Emîriniz için Allah'tan afv dileyiniz, çünkü o afvı severdi, dedikten sonra amma ba'du: Ben Peygamber (sallallahü aleyhi ve sellem)'e gelip: Müslüman olmak üzere sana bey'at edeceğim, dedim. ettiği şeyler arasında “her müslümâna hayırhah olmayı” da şart etti. Ben de bu şart üzerine bey'at ettim. Şu mescidin Rabb’ına yemîn ederim ki, ben sizin nasihat ediciniz, yani hayırhâhınızım, dedi. ibn Abdillah bu hutbeden sonra istiğfar ederek (minberden) indi",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 51
			}
		}
	]
}