{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"20": "Virtues of Prayer at Masjid Makkah and Madinah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1188,
			"arabicnumber": 1188,
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1189,
			"arabicnumber": 1189,
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1190,
			"arabicnumber": 1190,
			"text": "Bize Mâlik (179), Zeyd ibn Rebâh(131) ile Ubeydullah ibn Ebî Abdillah el-Agarr'dan bunların ikisi deEbû Abdillah Süleyman el-Agarr'dan o da Ebû Hureyre (radıyallahü anh)'den haber verdi. Peygamber (sallallahü aleyhi ve sellem): \"Benim şu(Medîne) Mescidimde kılınan bir namaz,(Mekke'deki) Harem Mescidi müstesna olmak üzere, başka mescid-lerde kılınan bin namazdan hayırlıdır\" buyurdu",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1192,
			"arabicnumber": 1192,
			"text": "Ben dostlarımın nasıl ziyaret ettiklerini gördüm ise, ben de o suretle ziyaret ederim. Ve ben gece veya gündüzden herhangi bir sâat içinde namaz kılan bir kimseyi, namaz kılmaktan men' etmem. Şu kadar ki, onlar(namaz için) güneşin doğuş ve batış vakitlerini seçmesinler",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1193,
			"arabicnumber": 1193,
			"text": "Bize Abdulazîz ibnu Müslim, Abdullah ibn Dinar'dan tahdîs etti. İbnu Omer (radıyallahü anh): Peygamber (sallallahü aleyhi ve sellem) her Cumartesi günü yürüyerek yahut binekli olarak Kubâ Mescidime gelirdi, demiştir. Abdullah ibn Omer bizzat kendisi de böyle yapardı",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1194,
			"arabicnumber": 1194,
			"text": "Ubeydullah şöyle demiştir: Bana Nâfi', İbn Omer'den tahdîs etti. İbn Omer(radıyallahü anh): Peygamber (sallallahü aleyhi ve sellem) Küba'ya bazen binekli, bazen de yaya gelirdi, demiştir. Numeyr şunu ziyâde etmiştir: Dedi ki: Bize Ubeydullah, Nâfi'den tahdîs etti. \"VePeygamber Kubâ Mescidi'nde iki rek'at namaz kılardı",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1195,
			"arabicnumber": 1195,
			"text": "Bize Mâlik, Abdullah ibn Ebî Bekr'den; o da Abbâd ibn Temîm'den; o da Abdullah ibn Zeyd el-Mâzinî(radıyallahü anh)'den haber verdi ki, Rasûlüllah (sallallahü aleyhi ve sellem): \"Evimle minberim arasındaki saha, cennet bahçelerinden bir bahçedir\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1196,
			"arabicnumber": 1196,
			"text": "Ubeydullah şöyle demiştir: Bana Hubeyb ibn Abdirrahmân, Hafs ibn Âsım'dan; o da Ebû Hureyre(radıyallahü anh)'den tahdîs etti ki, Peygamber (sallallahü aleyhi ve sellem): \"Benim evimle minberim arası cennet bahçelerinden bir bahçedir. Ve minberim de havzım üzerindedir\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1197,
			"arabicnumber": 1197,
			"text": "Bize Şu'be, Abdulmelik ibn Umeyr'den tahdîs etti. O şöyle demiştir: Ben, Ziyâd'ın himayesinde olan Kazaa'dan işittim, o şöyle dedi: Ben Ebû Saîd Hudrî'den işittim; o, Peygamber (sallallahü aleyhi ve sellem)'den dört şey tahdîs ediyordu ki, bu dört şey hem beni hayrete düşürdü, hem de sevindirdi. Peygamber (sallallahü aleyhi ve sellem) şöyle buyurmuştur: Eşi veya bir mahremi kendisiyle beraber bulunmayan kadın, iki günlük mesafeye sefer etmesin. Ramazân bayramının ilk günü ile Kurbân bayramının dört gününden ibaret olan Ramazân ve Kurbân bayramı günlerinde oruç tutmak yoktur. İki namazdan sonra da namaz yoktur: Biri sabah namazından sonra güneş doğup yükselinceye kadar, öbürü ikindi namazından sonra güneş batıncaya kadar. Namaz kılmak için şu üç mescidden başka hiçbir mescide sefer edilmez: Harem Mescidi, Aksa Mescidi ve benim mescidim",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 9
			}
		}
	]
}