{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"20": "Virtues of Prayer at Masjid Makkah and Madinah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1188,
			"arabicnumber": 1188,
			"text": "",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1189,
			"arabicnumber": 1189,
			"text": "Kazaa' şöyle demiştir: Ebu Said r.a.'den dört şey işittim. O şöyle dedi: \"Nebi Sallallahu Aleyhi ve Sellem'den işittim.\" Ebu Said, Nebi Sallallahu Aleyhi ve Sellem ile birlikte on iki gazaya katılmıştır. [-1189-] Ebu Hureyre r.a.'den rivayet edildiğine göre Nebi (Sallallahu aleyhi ve sellem) şöyle buyurmuştur: \"Ancak üç mescide (ziyaret maksadıyla) yolculuk yapılır: Mescid-i Haram, Mescid-i Resul (mescid-i nebevi) ve Mescid-i Aksa",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1190,
			"arabicnumber": 1190,
			"text": "Ebu Hureyre r.a.'den rivayet edildiğine göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Benim bu mescidimde kılınan bir namaz, Mescid-i Haram dışındaki başka mescitlerde kılınan bin namaz'dan daha hayırlıdır",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1192,
			"arabicnumber": 1192,
			"text": "Ben dostlarımın nasıl ziyaret ettiklerini gördüm ise, ben de o suretle ziyaret ederim. Ve ben gece veya gündüzden herhangi bir sâat içinde namaz kılan bir kimseyi, namaz kılmaktan men' etmem. Şu kadar ki, onlar(namaz için) güneşin doğuş ve batış vakitlerini seçmesinler",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1193,
			"arabicnumber": 1193,
			"text": "İbn Ömer (r.a.)'den şu rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem her cumartesi yürüyerek veya binitli olarak Kuba mescidine giderdi. Abdullah r.a. da böyle yapardı",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1194,
			"arabicnumber": 1194,
			"text": "İbn Ömer r.a.'den şu rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem Kuba'ya binitli veya yaya giderdi. İbn Nümeyr, Nafi' aracılığıyla Nebi'in burada iki rekat namaz kıldığını da rivayet etmiştir",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1195,
			"arabicnumber": 1195,
			"text": "Abdullah İbn Zeyd el-Mazini r.a.'den rivayet edildiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Evim i/e minberim arası, cennet bahçelerinden bir bahçedir",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1196,
			"arabicnumber": 1196,
			"text": "Ebu Hureyre r.a.'den rivayet edildiğine göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Evim ile minberim arası cennet bahçelerinden bir bahçedir. Minberim de havuzum üzerindedir. Tekrar: 1888, 6588, 7335",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1197,
			"arabicnumber": 1197,
			"text": "Ziyad'ın azatlısı Kazaa' şöyle demiştir: Ebu Said el-Hudrî'nin Nebi (Sallallahu aleyhi ve Sellem)'den aktardığı dört şeyi İşittim. Bunlar hoşuma gitti ve beni mutlu etti, Bu dört şey şunlardır: 1) Kadın yanında kocası veya mahremi olmaksızın iki günlük mesafeye yolculuk yapmasın. 2) İki günde, yani Ramazan ve Kurban Bayramı günlerinde oruç tutmak yoktur. 3) İki namaz'dan sonra namaz kılmak yoktur: Sabah namazından sonra güneş doğuncaya kadar, ikindi namazından sonra güneş batıncaya kadar. 4) Ancak şu üç mescid'e yolculuk yapılır: Mescid-i Haram, Mescid-i Aksa ve benim mescidim",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 9
			}
		}
	]
}