{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"21": "Actions while Praying"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1198,
			"arabicnumber": 1198,
			"text": "Bize Mâlik, Mahrame ibn Süleyman'dan; o da İbn Abbâs'ın himayesinde bulunan Kurayb'den haber verdi. Kurayb de Mahrame'ye İbn Abbâs radıyallahü anhüma'tan şöyle haber verdi: Abbâs, bir gece mü'minlerin anası olan Meymûne'nin yanında kalmış. Meymüne, İbn Abbâs'ın teyzesidir. İbn Abbâs şöyle dedi: Ben (başımı) yastığın enine koyarak uzandım. Rasûlüllah ile ehli de başlarını yastığa koyarak uzandılar. Rasülullah uyudu. Tâ gece yarıyı bulduğu, yahut biraz evvelce, yahut biraz sonraya kadar. Sonra Rasülullah uyandı. Akabinde oturdu ve eliyle yüzünden uykuyu sildi. Ondan sonra Âlu İmrân Sûresi'nin son on âyetini okudu. Sonra kalktı ve asılı duran küçük bir kırbaya uzandı. O kırbadan güzelce bir abdest aldı. Sonra dikilip namaz kılmaya koyuldu. ibn Abbâs dedi ki: Ben de kalktım ve O'nun yaptığı gibi yaptım. Sonra gittim ve O'nun(sol) yanına, namaza durdum. Rasülullah sağ elini başımın üzerine koydu ve sağ kulağımı eliyle tutup okşadı. rek'at kıldı, sonra iki rek'at, sonra iki rek'at, sonra iki rek'at, sonra iki rek'at kıldı. Ondan sonra tek(rek'atlı bir namaz) kıldı. Sonra müezzin O'na(çağırmaya) gelinceye kadar yine uzandı. Sonra kalktı ve hafif iki rek'at namaz kıldı. Sonra da evinden çıkıp sabah namazını kıldırdı",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1199,
			"arabicnumber": 1199,
			"text": "Abdullah ibn Mes'ûd(radıyallahü anh) şöyle demiştir: Biz(İslâm'ın başlangıcında) Peygamber (sallallahü aleyhi ve sellem) namazda olduğu hâlde kendisine selâm verirdik; O da bize selâmla mukaabele ederdi. Biz Habeş Meliki olan Necâşî'nin yanından döndüğümüz zaman (yine namazda iken)Peygamber'e selâm verdik, fakat bu defa Peygamber bize selâmla mukaabele etmedi. Ve: \"Şübhesiz namaz içinde (Allah ile) büyük bir meşguliyet vardır\" buyurdu",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1200,
			"arabicnumber": 1200,
			"text": "Ebû Amr şöyle demiştir: Zeyd ibn Erkam bana şöyle dedi: biz, Peygamber zamanında namaz içinde iken kelâm ederdik. Bizim herhangi birimiz (yanındaki) arkadaşına kendi hacetini söylerdi. En sonunda \"Namazlara ve orta namazı muhafazaya devam edin. Tam huşu' ve tâat ediciler olarak Allah için dîvân durun” (el-Bakara:238) âyeti indi de, bize namazda susmak emrolundu",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1201,
			"arabicnumber": 1201,
			"text": "Sehl ibn Sa'd(radıyallahü anh) şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem) Amr ibn Avf oğulları arasında sulh(yani barış) yapmak üzere(onların yurduna) çıktı. Namaz vakti de geldi. Bunun üzerine Bilâl, Ebû Bekr'e geldi ve: Peygamber alıkonuldu. İnsanlara imamlık eder misin? dedi. Ebû Bekr: Eğer isterseniz evet, dedi. Bu cevâb üzerine Bilâl namaza ikaamet etti. Ebû Bekr de öne geçip namazı kıldırmaya koyuldu. Bu esnada Peygamber safflar arasında yürüyerek, saffları yara yara geldi, nihayet birinci safa ulaşıp dikeldi. İnsanlar tasfîh yapmaya başladılar. Sehl dedi ki: Tasfîh nedir bilir misiniz? Tasfîk'tır.(yani el çırpmaktır). Bekr namazını kılarken başını çevirmezdi. Arkasındaki cemâat el çırpmayı çoğaltınca başını çevirdi. Baktı ki Peygamber saffın içinde. Peygamber hemen ona\"Yerinde dur\" diye işaret etti. Ebû Bekr iki elini yukarıya kaldırdı da Allah'a hamd etti. Sonra geri geri Peygamber'in arkasına geçti. Peygamber ileriye geçip namazı kıldırdı",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1202,
			"arabicnumber": 1202,
			"text": "Abdullah ibn Mes'ûd(radıyallahü anh) şöyle demiştir: Biz: Tahiyye namaz içindedir der, bir takım isimler söyler ve birbirimize selâm okurduk(yani fulâna selâm olsun, fulâna selâm olsun derdik). O isimlere selâm ettiğimizi Rasûlüllah(sallallahü aleyhi ve sellem) işitti de: lillâhi ve's-salâvâtu ve't-tayyibâtu. Es-Selâmu aleyke eyyuhen-nebiyyu ve rahmetu'llâhi ve berekâtuhu. Es-Selâmu aleynâ ve alâ ibâdillâhıs-sâlihîn. Eşhedu en lâ ilahe ille'llâhu ve eş-hedu enne Muhammeden abduhu ve rasûluhu” deyiniz. Çünkü sizler bu ve ibâdillâhis-sâlihîn ( = ve Allah'ın bütün iyi kullarına selâm olsun) sözünü söylediğiniz zaman, muhakkak Allah 'ın gökteki ve yerdeki her bir sâlih kuluna selâm vermiş olursunuz\" buyurdu",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1203,
			"arabicnumber": 1203,
			"text": "Bize ez-Zuhrî, Ebû Seleme'den; o da Ebû Hureyre'den tahdîs etti. Peygamber (sallallahü aleyhi ve sellem): \"Tesbîh etmek erkeklere, el çırpmak kadınlara mahsûstur\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1204,
			"arabicnumber": 1204,
			"text": "Sehl ibn Sa'd(radıyallahü anh) şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem):. \"Subhânallah demek erkeklere; el çırpmak (yahut da sağ elin içini, sol elin üstüne vurup ses çıkartmak)kadınlara mahsûstur\" buyurdu",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1205,
			"arabicnumber": 1205,
			"text": "ez-Zuhrî şöyle dedi: Bana Enes ibn Mâlik şöyle haber verdi: Müslümanlar o pazartesi günü sabah namazı içinde bulundukları sırada ve Ebû Bekr onlara sabah namazını kıldırırken, Peygamber (sallallahü aleyhi ve sellem) birdenbire onlara göründü. Âişe'nin odasının perdesini açmış hâldeydi. Peygamber, saff saff dizilmiş(namaz kılmakta) olan sahâbîlerine baktı ve tebessüm edip gülüyordu. Ebû Bekr, Rasûlüllah namaza çıkmak istiyor zannederek (saffa girmek için) yüzünü kıbleden ayırmadan, iki topuğu üzerinde geri geri çekildi. Müslümanlar Peygamber'i gördükleri zaman, O'nu görmekle aşırı derecede sevinerek namazları içinde fitneye düşmelerini(yânı namazlarını bozmalarını) düşündüler. Bu sırada Peygamber onlara eliyle\"Namazınızı tamamlayın\" diye işaret etti. Sonra içeriye girdi ve tuttuğu perdeyi salıverdi. İşte Peygamber, bu gün vefat etti",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1206,
			"arabicnumber": 1206,
			"text": "Ebû Hureyre(radıyallahü anh) şöyle dedi: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: \"Bir kadın oğluna nida edip çağırdı. Oğlu bu esnada ibâdet yerinde (namazda) bulunuyordu. Anası: Yâ Cureyc! dedi. Cureyc: Allahım! Anama icabet hakkı ile namazımı tamamlama hakkı birleşti! dedi. Anası yine: Yâ Cureyc! dedi. Cureyc: Allahım! Anam ve namazım! dedi. Anası yine: Yâ Cureyc! diye nida etti. Cureyc de yine: Allahım! Anama cevâb mı vereyim, yoksa namazı mı tamamlayayım? dedi. Bu sefer anası: Allahım! Cureyc fahişe kadınların yüzüne bakmadıkça ölmesin, diye ilendi. Cureyc'in savmıası (Manastır)’na koyun güden çoban bir kadın sığınır dururdu. (O çoban kadın başka biri ile cinsî münâsebet etmişti.) Derken bir çocuk doğurdu. Kadına: Bu çocuk kimdendir? diye soruldu. Kadın: Cureyc'dendir, savmıasından indi (bu çocuğa beni hâmile yaptı),dedi. Bu haber Cureyc'e ulaşınca: Çocuğunun bana âid olduğunu iddia etmekte olan bu kadın nerede? dedi. Sonra (kadınla çocuk getirildiğinde): Ey çocuk, senin Bâban kimdir? diye sordu. Küçük çocuk dile gelip: Koyun güden bir erkek çobandır, dedi",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1207,
			"arabicnumber": 1207,
			"text": "Bana Muaykîb(ibn Ebî Fâtıma) tahdîs etti ki, Peygamber (sallallahü aleyhi ve sellem), secde edeceği yerdeki toprağı eliyle düzelten bir kimsenin durumu hakkında: \"Bir daha böyle toprak düzleyecek olursan elinle bir defa dokun\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1208,
			"arabicnumber": 1208,
			"text": "Enes ibn Mâlik(radıyallahü anh) şöyle demiştir: Biz Peygamber (sallallahü aleyhi ve sellem) ile birlikte sıcağın şiddetinde namaz kılardık da, bâzılarımız sıcaktan yüzünü yere değdirmeye muktedir olamadığı zaman, büründüğü elbisenin bir ucunu secde yerine yayar ve üzerine secde ederdi",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1209,
			"arabicnumber": 1209,
			"text": "Âişe(r.anha) şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem) namaz kılarken ben(karşısında uyurdum da) ayaklarımı O'nun kıblesine uzatmış bulunurdum. Peygamber secdeye vardığı zaman, eliyle beni dürterdi. Ben de ayaklarımı geriye çekerdim. O secdeden kalktığı zamân, ben yine ayaklarımı uzatırdım",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1210,
			"arabicnumber": 1210,
			"text": "Bize Şu'be, Muhammed ibn Ziyâd'dan; o da Ebû Hureyre(radıyallahü anh)'den tahdîs etti ki, Peygamber (sallallahü aleyhi ve sellem) bir namaz kılmış, şöyle buyurmuştur: \"Şübhesiz şeytân namazımı bozmak için benim karşıma geldi ve bana hücum etti. Allah bana ona istediğimi yapma kuvveti verdi. Ben de onun boğazını sıktım. Ve yemin ederim ki, sabah olunca hepiniz ona bakasınız diye, onu bir direğe bağlamak istedim. Fakat Süleyman Peygamber'in(O'na selâm olsun): Rabbiğfir lî ve heb lî mulken lâ yenbağî li-ahadin min ba'dî inneke ente'l-vehhâb (Ey Rabb'im, bana mağfiret et. Bana öyle bir mülk ver ki, o benden başka hiçbir kimseye lâyık olmasın. Şüphesiz Sen bütün murâdları ihsan edensin) (Sâd: 35) demiş olduğunu hatırladım. Allah da onu köpek gibi kovdu\" ibn Şumeyl, noktalı zâl ile \"feza'attuhu \" yani onu boğdum şeklinde söyledi. Dâl ve şeddeli ayn ile \"fede'attuhu \" kelimesi ise Yüce Allah'ın: \"Yevmeyuda'ûne (O gün onlar cehennem ateşine itilip kakılırlar\" (et-Tûr: 13) kavlindendir. \"Yuda'ûne = Yudfa'ûne\" yani itilip kakılırlar ma'nâsınadır. Doğru olan \"Fedeattuhu \" şeklidir. Şu kadar var ki, Şu'be işte böyle ayn ve tâ harflerinin şeddesi ile söylemiştir",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1211,
			"arabicnumber": 1211,
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1212,
			"arabicnumber": 1212,
			"text": "Urve şöyle demiştir: Âişe (r.anha) şöyle dedi:.Güneş tutuldu. Peygamber hemen namaza kalktı ve uzun bir sûre okudu. Sonra rükû' etti; rukû'u da uzattı. Sonra başını rukû'dan kaldırdı. Sonra diğer sûreye başladı. Sonra rukû'u yerine getirince, rukû'dan başını kaldırdı. Sonra secde etti. Sonra ikinci rek'atta da bu iki kıyam ve iki rukû'u yaptı. Sonra şöyle buyurdu: \"Şübhesiz bunlar, Allah'ın âyetlerinden iki âyettir. Sizler bu tutulmayı gördüğünüz zaman, sizden açılıncaya kadar namaz kılınız, Yemîn olsun ki, ben şu kusûf namazı kıldığım yerde bana va'd olunan her şeyi görmüşümdür. Hattâ namazda benim ileriye doğru gitmeye başladığımı gördüğünüz vakit de ben cennetten bir salkım üzüm almak istediğimi görmüşümdür. Ve yine yemîn olsun ki, beni geriye çekilir gördüğünüz sırada ben cehennemi, bâzısı bâzısını kırıyor görmüşümdür. Ve ben cehennemin içinde Amr ibn Lahuyy'ı da gördüm; işte o, putlar için hayvanları sâibe yapan (yânı salıveren) kimsedir",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1213,
			"arabicnumber": 1213,
			"text": "Bize Hammâd, Eyyûb’dan; o da Nâfi'den; o da İbn Omer (radıyallahü anh) 'den tahdîs etti ki (o şöyle demiştir):Peygamber (sallallahü aleyhi ve sellem) mescidin kıblesinde bir tükürük gördü de bundan dolayı mescid ahâlîsine karşı öfkelenip üzüldü ve şöyle buyurdu: \"Şübhesiz Allah, herbirinizin yüzünün yöneldiği taraftadır. Binâenaleyh herhangi biriniz namaz içinde bulunduğu zaman sakın tükürmesin\". Râvî: Yâhud \"Balgamçıkarmasın\" buyurdu, dedi. SonraRasûlüllah indi de onu eliyle kazıdı. Ve ibn Omer: \"Herhangi biriniz tükürmek zorunda kaldığı zaman, sol tarafına tükürsün\" dedi",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1214,
			"arabicnumber": 1214,
			"text": "Bize Şu'be tahdîs edip şöyle dedi: Ben Katâde'den işittim; o da Enes (radıyallahü anh)'ten: Peygamber(sallallahü aleyhi ve sellem):“ (Mü'min) namaz içinde olduğu zaman şübhesiz o Rabb'ı ile munâcaat eder. Bunun için sakın önüne tükürmesin, sağ tarafına da tükürmesin. Fakat (zarurî durumda) sol tarafından sol ayağının altına (tükürebilir)",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1215,
			"arabicnumber": 1215,
			"text": "Sehl ibn Sa'd(radıyallahü anh) şöyle demiştir:(Bâzı) insanlar Peygamber (sallallahü aleyhi ve sellem) ile birlikte namaz kılardı. O halde ki, bunlar bellerindeki futaları, küçük olduğu için (çocuklar gibi) boyunlarına bağlamış olurlardı. Bu sebebden(cemâate gelen kadınlara):Erkekler doğrulup oturmadıkça başlarınızı secdeden kaldırmayınız, denirdi",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1216,
			"arabicnumber": 1216,
			"text": "Abdullah ibn Mes'ûd(radıyallahü anh) şöyle demiştir: Ben Peygamber (sallallahü aleyhi ve sellem) namazda iken kendisine selâm verir idim, O da bana mukaabele ederdi. (Necâşî'nin yanından) dönüp geldiğimiz zaman (yine namazda iken) kendisine selâm verdim, fakat bu sefer selâmıma mukaabele etmedi(ve namazdan sonra): \"Şübhesiz namaz içinde (Allah ile) azametli bir meşguliyet vardır\" buyurdu",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1217,
			"arabicnumber": 1217,
			"text": "Bize Ebû Ma'mer tahdîs edip şöyle dedi: Bize Abdulvâris tahdîs edip şöyle dedi: Bize Kesîr ibnu Şınzîr, Atâ ibn Ebî Rebâh'tan tahdîs etti. Câbir ibn Abdillah (radıyallahü anh) şöyle demiştir: Rasûlüllah (Musta'lık oğulları seferinde) beni kendisine âid bir ihtiyâca gönderdi. Ben gittim. Sonra o işi yerine getirerek geri döndüm ve kendisine selâm verdim. Fakat Rasûlüllah selâmımı karşılamadı. Bunun üzerine kalbimde öyle şiddetli bir hüzün meydana geldi ki, onun mâhiyetini yalnız Allah bilir. İçimden de: Belki Rasûlüllah bana darıldı, bu işini ağır yaptığıma hükmetti, dedim. Sonra kendisine tekrar selâm verdim. Yine selâmıma mukaabele etmedi. Bu defa gönlümde birinci defakinden daha şiddetli bir hüzün meydana geldi. Sonra Rasülullah'a(üçüncü defa) selâm verdim. Bu kerre(namazdan çıkınca) selâmımı karşıladı. Ve: \"Beni, senin selâmına selâm ile mukaabele etmekten, yalnız benim namaz kılmakta bulunmaklığım men' etmiştir\" buyurdu. Ve Rasûlüllah bu sırada devesi üzerinde kıbleden başka cihete yönelmiş olarak yol alıyordu",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1218,
			"arabicnumber": 1218,
			"text": "Sehl ibn Sa'd(radıyallahü anh) şöyle demiştir: Rasûlüllah'a, Kubâ'daki Amr ibn Avf oğulları arasında bir kavga meydana geldiği haberi ulaştı. Rasûlüllah, sahabelerinden bir takım insanlarla, onların arasında barış yapmak üzere hemen yola çıktı. Rasûlüllah orada alıkonuldu. Namaz vakti de geldi. Bilâl, Ebû Bekr'e geldi ve: Yâ Ebâ Bekr! Rasûlüllah alıkonuldu, namaz vakti de geldi. Sen insanlara imamlık yapar mısın? dedi. Ebû Bekr: Peki, istersen kılalım, dedi. Bunun üzerine Bilâl namaza ikaamet etti. Ebû Bekr de öne geçip insanlara namaz kıldırmak için Allâhu Ekber deyip namaza başladı. Bu sırada Rasûlüllah, safflar arasında yürüyerek, saffları yara yara geldi ve nihayet birinci safta dikildi. İnsanlar tasfîha (yani el çırpmaya) başladılar. \"Tasfîh\", tasfîk; yani el çırpmaktır, dedi. şöyle devam etti: Ebû Bekr, namazını kılarken başını çevirmezdi. Arkasındaki cemâat el çırpmayı çoğaltınca başını çevirip baktı ve Rasûlüllah'ı gördü ki, Rasûlüllah ona işaret edip, insanlara namazı kıldırmasını emretmekte! Ebû Bekr hemen elini kaldırıp (Rasûlüllah'ın kendisine olan bu emrinden dolayı) Allah'a hamd etti. Sonra Ebû Bekr geri geri çekilerek,Peygamber'in arkasına geçti ve saffta dikeldi. Rasûlüllah da öne ilerleyip insanlara namazın bakıyyesini kıldırdı. Namazı bitirince yüzünü insanlardan tarafa döndürüp, şöyle buyurdu: \"Ey insanlar! Size ne oluyordu ki, namaz içinde bir şey arız olduğu zaman el çırpmaya başladınız? El çırpmak, ancak kadınlara mahsûstur. Her kime namazı içinde iken bir şey arız olursa Suhhânallah desin\". Bu sözlerden sonra Rasûlüllah Ebû Bekr'e yöneldi ve: \"Yâ Ebâ Bekri Sana namazı kıldır diye işaret ettiğimiz zaman seni insanlara namaz kıldırmandan men' eden nedir?\" diye sordu. Ebû Bekr: \"Ebû Kuhâfe oğlu için, Rasûlüllah'ın önünde durup namaz kıldırması lâyık olmaz\" dedi",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1219,
			"arabicnumber": 1219,
			"text": "Bize Hammâd ibn Zeyd, Eyyûb'dan; o da Muhammed ibn Sîrîn'den; o da Ebû Hureyre(radıyallahü anh)'den tahdîs etmiştir. Ebû Hureyre: Namazda iken eli boş böğür üzerine koymak nehyedildi, demiştir. Hişâm ibn Hassan ile Ebû Hilâl Muhammed ibn Selîm, İbn Sîrin'den; o da Ebû Hureyre'den; o da Peygamber (sallallahü aleyhi ve sellem)'den olmak üzere söylediler",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1220,
			"arabicnumber": 1220,
			"text": "Bize Muhammed ibn Şîrîn, Ebû Hureyre (radıyallahü anh)'den tahdîs etti. Ebû Hureyre: Kişinin, elini boş böğrü üzerine koyarak namaz kılması nehyedildi, demiştir",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1221,
			"arabicnumber": 1221,
			"text": "Bana İbnu Ebî Muleyke, Ukbe ibnu'l-Hâfis (radıyallahü anh)'den haber verdi. O şöyle demiştir: Ben Peygamber ile beraber ikindi namazını kıldım. Peygamber namazdan selâm verince, sür'atle kalktı; acele acele kadınlarından birinin yanına girdi. Sonra dışarı çıktı ve sür'atle gitmesinden dolayı cemâatin yüzlerindeki hayretlerini gördü de: \"Ben namazda iken bizde biraz altın bulunduğunu hatırladım. Ve bizim yanımızda akşama ulaşmasın-yahut şöyle dedi: Bizim yanımızda gece geçirmesini istemedim de, onun taksim edilip dağıtılmasını emrettim\" buyurdu",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1222,
			"arabicnumber": 1222,
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1223,
			"arabicnumber": 1223,
			"text": "Bana ibnu EbîZi'b, Saîd el-Makburî'den haber verdi. O şöyle demiştir: Ebû Hureyre şöyle dedi: İnsanlar, Ebû Hureyre Peygamber'den çok hadîs rivayet ediyor, deyip duruyorlardı. Bir adama kavuştum da ona: Rasûlüllah (sallallahü aleyhi ve sellem) dün gece yatsı namazında ne okudu? Diye sordum. zât: : okuduğunu) bilmiyorum, dedi. Sen o namazda hâzır bulunmadın mı? dedim. Evet, bulundum, dedi. (Ebû Hureyre dedi ki:) Lâkin ben Rasûlüllah'ın o namazda şu ve şu süreleri okuduğunu bilmekteyim, dedi",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 27
			}
		}
	]
}