{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"22": "Forgetfulness in Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1224,
			"arabicnumber": 1224,
			"text": "Abdullah İbn Buhayne r.a. şöyle demiştir; \"Resulullah Sallallahu Aleyhi ve Sellem bir namazda bize iki rekat kıldırdı. Sonra oturmaksızın (üçüncü rekat'a) kalktı. Cemaat de onunla birlikte kalktılar. Namazın sonunda onun selam vermesini beklerken, O selam'dan önce tekbir getirerek oturduğu yerde iki secde yaptı, sonra selam verdi",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1225,
			"arabicnumber": 1225,
			"text": "Abdullah İbn Buhayne r.a. şöyle demiştir: \"Resulullah Sallallahu Aleyhi ve Sellem öğle namazının ikinci rekatından sonra oturmaksızın (üçüncü rekat'a) kalktı. Namazını bitirince iki secde yaptı, sonra selam verdi",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1226,
			"arabicnumber": 1226,
			"text": "Abdullah r.a. şöyle demiştir: Resûlullah Sallallahu Aleyhi ve Sellem Öğle namazını beş rekat kıldı. Kendisine: \"Namaz(ın rekatları) arttırıldı mı?\" diye sorulunca, Nebi Sallallahu Aleyhi ve Sellem: \"Ne oldu ki?\" diye sordu. Ona: \"Beş re­kat kıldınız ya Rasûlullah!\" denilince, selam verdikten sonra iki secde yaptı",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1227,
			"arabicnumber": 1227,
			"text": "Ebu Hureyre r.a. şöyle demiştir: Nebi Sallallahu Aleyhi ve Sellem bize Öğleyi -veya ikindiyi- kıldırdı. (İkinci rekatta) selam verdi. Zü'l-yedeyn O'na Sallallahu Aleyhi ve Sellem : \"Ey Allah'ın Resulü namaz kısaldı mı?\" diye sordu. Nebi Sallallahu Aleyhi ve Sellem ashabına: \"Söylediği doğru mu?\" diye sordu. Ashab: \"Evet\" deyince, Nebi Sallallahu Aleyhi ve Sellem iki rekat daha kıldırdı, sonra iki sehiv secdesi yaptı. Sa'd şöyle demiştir: Urve İbn Zübeyr'in akşam namazını İki rekat kıldığını gördüm. Selam verdi ve konuştu. Sonra (yanıldığını anlayınca) eksik kalan rekatı kılarak iki sehiv secdesi yaptı ve \"Nebi Sallallahu Aleyhi ve Sellem de böyle yaptı\" dedi. باب: من لم يتشهد في سجدتي السهو. 4. Sehiv Secdelerinde Teşehhud Okumamak -وسلم أنس والحسن ولم يتشهدا. وقال قتادة: لا يتشهد. Enes ve Hasan, Selam vermişler, teşehhüd okumamışlardır. Katade: \"Teşehhüd okunmaz\" demiştir",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1228,
			"arabicnumber": 1228,
			"text": "Ebu Hureyre r.a. Şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem (dört rekatlı bir namazda) İkinci rekat'tan sonra namaz'dan çıktı. Zü'l-yedeyn: \"Ey Allah'ın Resulü! Namaz mı kısaldı yoksa sen mi unuttun?\" deyince; Resulullah Sallallahu Aleyhi ve Sellem: \"Zü'l-yedeyn doğru mu söyledi?\" diye sordu. Cemaat \"Evet\" dedi. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem kalkarak iki rekat daha kıldı, sonra selam verdi. Ardından tekbir getirerek daha önceki secdeleri gibi yahut daha uzun secde etti, sonra başını secdeden kaldırdı",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1229,
			"arabicnumber": 1229,
			"text": "Ebu Hureyre r.a. şöyle demiştir: Nebi (Sallallahu aleyhi ve Sellem) öğleden sonra kılınan namazlardan birini iki rekat kıldırdı. Sonra selam verdi. Ardından mescid'in ön tarafındaki bir tahtanın yanında ayakta bekledi, elini onun üzerine koydu. Mesciddekiler arasında Ebu Bekir ve Ömer de vardı. Onlar Nebi Sallallahu Aleyhi ve Sellem ile (namazı İki rekat kıldırması konusunda) konuşmaktan çekindiler. Cemaat'ten acele olarak ayrılmak isteyenler \"namaz kısaldı\" diyerek mescid'den çıktılar. Resulullah (Sallallahu aleyhi ve Sellem)'ın \"Zü'l-yedeyn\" diye adlandırdığı bir sahabî Nebi (Sallallahu aleyhi ve Sellem)'e: \"Sen mi unuttun, yoksa namaz mı kısaldı?\" diye sordu. Nebi (Sallallahu aleyhi ve Sellem)’i: \"Ne ben unuttum, ne de namaz kısaldı\" dedi. Zü'l-yedeyn: \"O halde evet galiba sen unuttun\" dedi. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem iki rekat daha kıldırdı, sonra selam verdi, sonra tekbir getirdi ve namazdaki secdeleri gibi yahut daha uzun bir secde yaptı, sonra başını kaldırdı tekrar tekbir getirerek başını secdeye koydu. Diğer secdeler gibi yahut daha uzun secde yaptı sonra başını kaldırıp tekbir getirdi. Hadisi rivayet eden Muhammed şöyle demiştir: \"Öyle zannediyorum ki bu ikindi namazıydı",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1230,
			"arabicnumber": 1230,
			"text": "Abdullah İbn Buhayne el-Esedî şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem öğle namazında oturması gereken yerde (ikinci rekatta) ayağa kalktı. Namazını tamamlayınca iki secde yaptı ve selam vermeden önce otururken her bir secde için bir secde yaptı. Ona uyanlar da onunla birlikte secde ettiler. (Resulullah) bunu oturmayı unuttuğu için yaptı",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1231,
			"arabicnumber": 1231,
			"text": "Ebu Hureyre r.a. Resûlullah Sallallahu Aleyhi ve Sellem'den şunu rivayet etmiştir: \"Namaz için ezan okunduğunda şeytan ezan sesini işitmemek için sesli sesli yellenerek arkasını dönüp gider. Ezan bittiğinde geri gelir. Kamet getirildi­ğinde yine dönüp gider. Kamet bittiğinde gelir. Namaz kılan kişinin zihnini (as­lında aklında olmayan şeyleri ona hatırlatarak) 'şunu hatırla, şunu da hatırla’ diyerek meşgul eder. Öyle ki kişi kaç rekat kıldığını bilemez olur. Sizden biri kaç rekat kıldığını -üç mü dört mü kıldığını- bilemezse oturduğu yerde iki secde yapsın.\" باب: السهو في الفرض والتطوع. 7. Farz Ve Nafile Namazda Yanılmak -وسجد ابن عباس رضي الله عنهما سجدتين بعد وتره. İbn Abbas, vitir namazının sonunda iki secde yaptı",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1232,
			"arabicnumber": 1232,
			"text": "Ebu Hureyre r.a., Nebi Sallallahu Aleyhi ve Sellem'in şöyle söylediğini rivayet etmiştir: \"Siz'den biri namaz kılmak için kalktığında şeytan ona gelerek (vesvese vermek suretiyle) onun namazını karıştırır. Öyle ki kaç rekat kıldığını bilemez olur. Sîz'den biri bu durumla karşılaşırsa oturduğu zaman İki secde yapsın",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1233,
			"arabicnumber": 1233,
			"text": "(İbn Abbas r.a.'ın kölesi Kureyb'den rivayet edilmiştir): İbn Abbas, Misver İbn Mahreme ve Abdurrahman İbn Ezher r.a. (Kureyb'i) Aişe r.anha'ya göndererek şöyle dediler: \"Ona hepimizden selam söyle ve ona ikindi namazından sonra kılınan iki rekatı sor. Ona de ki: Bize senin bunu kıldığın anlatılıyor, oysa bize Nebi'in bunu yasakladığı haberi ulaşmıştı. (İbn Abbas dedi ki: \"Ben, Ömer İbn el-Hattab ile birlikte halk'tan bu iki rekat namazı kılanları döverdim).\" Kureyb dedi ki: Aişe r.anha'nın yanına gittim ve ona bana söyledikleri şeyi ilettim. Aişe: \"Bunları Ümmü Seleme'ye sor\" dedi. Ben onun yanından çıkarak beni gönderenlerin yanına geri döndüm ve Aişe'nin sözünü onlara söyledim. Onlar da beni Aişe r.anha'ya sormamı istedikleri şeyleri Ümmü Seleme r.anha'ya sormam için geri gönderdiler. Ümmü Seleme r.anha şöyle dedi: Nebi Sallallahu Aleyhi ve Sellem'in bunu yasakladığını duydum. Sonra onun ikindiyi kıldıktan sonra bu iki rekat'ı kıldığını da gördüm. Sonra yanımda ensardan Benî Haram kabilesinden kadınlar var iken Nebi s.a.v. odama girdi. Ben cariyemi onun yanına göndererek şöyle dedim: Onun yanında durarak ona şunu söyle: \"Ey Allah'ın Resulü! Ümmü Seleme sana diyor ki: Senin bu iki rekatı kılmayı yasakladığını duydum, oysa sen bunları kılıyorsun.\" Bunu söyledikten sonra eliyle işaret ederse onun gerisinde dur. (Ümmü Seleme dedi ki) Cariye bunları yaptı, Nebi s.a.v. de eliyle işaret etti. Cariye geride durdu. Nebi Sallallahu Aleyhi ve Sellem namazını bitirince şöyle dedi: \"Ey Ebû Ümeyye'nin kızı! İkindiden sonra kıldığım iki rekatı sordun. Bana Abdülkays kabilesinden bazı kimseler geldiler. Ben onlarla meşgul olduğumdan öğle namazından sonra kıldığım iki rekatı kılamadım. İşte (ikindiden sonra kıldığım) o iki rekat bu (öğle namazından sonra kılmam gerektiği halde kılamadığım) iki rekattır. Tekrar: 4370",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1234,
			"arabicnumber": 1234,
			"text": "Sehl İbn Sa'd es-Saidî r.a. şöyle rivayet etmiştir: Resulullah Sallallahu Aleyhi ve Sellem'e Kuba'da olan Ben-i Amr İbn Avf kabilesinin mensupları arasında bir anlaşmazlık çıktığı haberi ulaştı. O da ashabından birkaç kişi ile birlikte onların arasını düzeltmek için gitti. Namaz vakti geldiği halde Resulullah Sallallahu Aleyhi ve Sellem hala dönememişti. Bunun üzerine Bilal, Ebu Bekir r.a.'e gelerek: \"Ya Eba Bekr! Resulullah Sallallahu Aleyhi ve Sellem dönemedi, namaz vakti de girdi. Sen insanlara imamlık yapar mısın?\" diye sordu. Ebu Bekir: \"Evet, eğer isterseniz yaparım\" dedi. Bilal namaz için kamet getirdi, Ebu Bekir mihraba geçerek tekbir aldı. Bu arada Nebi Sallallahu Aleyhi ve Sellem geldi. Safları yara yara İlk saf'a kadar ulaştı ve orada namaza durdu. Cemaat (Ebu Bekir'i uyarmak için) ellerini çırpmaya başladı. Ebû Bekir namaz kılarken sağ'a sol'a bakmıyordu. Ashab ellerini çokça çırpmaya devam edince onlara döndü. Bir de baktı ki Resulullah Sallallahu Aleyhi ve Sellem orada! Nebi Sallallahu Aleyhi ve Sellem eliyle ona namazı kıldırmasını emretti. Ancak Ebû Bekir ellerini kaldırarak Allah'a hamdetti sonra da yavaşça geriye gelerek saf'a girdi. Resulullah Sallallahu Aleyhi ve Sellem de ön'e çıkarak namazı kıldırdı. Nebi Sallallahu Aleyhi ve Sellem namaz'ı bitirince cemaate dönerek şöyle buyurdu: \"Ey insanlar! Namazda iken bir durumla karşılaştığınızda niçin ellerinizi çırpmaya başladınız? El çırpmak kadınlara özgüdür. Namaz'da iken aykırı bir durumla karşılaşan kişi 'Sübhanallah' desin.\" Sonra Ebu Bekir'e dönerek: ‘‘£y Ebu Bekir! Ben sana işaret ettiğimde niçin namazı kıldırmaya devam etmedin?\" diye sordu. Ebu Bekir: \"Ebu Kuhafe'nin oğlunun, Resulullah'ın önünde namaz kılması yakışık almaz\" dedi",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1235,
			"arabicnumber": 1235,
			"text": "Esma' r.anha şöyle demiştir: Aişe r.anha'nın yanına girdiğimde ayakta namaz kılıyordu. İnsanlar da ayakta idi. Aişe'ye: \"İnsanlara ne oluyor\" dedim. Aİşe başı ile gökyüzüne işaret etti. Ben: \"Bu bir alamet mi?\" dedim. O da başı ile \"Evet\" anlamında işaret etti",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1236,
			"arabicnumber": 1236,
			"text": "Nebi Sallallahu Aleyhi ve Sellemin eşi Aişe r.anha şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem hasta iken evinde oturarak namaz kıldı. Bir grup sahabî de onun arkasında ayakta namaz kıldılar. Nebi Sallallahu Aleyhi ve Sellem eliyle onlara \"oturun\" anlamında işaret etti. Namaz bitince de şöyle buyurdu: \"İmam kendisine uyulsun diye imam kılınmıştır. O rüku' yaptığında siz de yapın. O başını kaldırdığında siz de kaldırın",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 14
			}
		}
	]
}