{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"23": "Funerals (Al-Janaa'iz)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1237,
			"arabicnumber": 1237,
			"text": "Ebû Zerr (radıyallahü anh) şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem): \"Bana Rabb 'im tarafından gelen (Cibril)geldi de: Ümmetimden her kim Allah 'a hiçbir şeyi ortak tanımayarak ölürse, o kimse cennete girer, diye haber verdi -veya bununla beni müjdeledi-\" buyurdu. Ben: Rasûlallah!) O adam zina ettiği ve hırsızlık yaptığı takdîrde de (yine cennete girer) mi? dedim. (Evet)zina ettiği ve hırsızlık yaptığı takdîrde de",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1238,
			"arabicnumber": 1238,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1239,
			"arabicnumber": 1239,
			"text": "el-Berâu'bnu Âzib(radıyallahü anh) şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem) bize yedi şeyi işlememizi emretti, yedi şeyden de bizi nehy eyledi: Peygamber bize cenazeler ardından gitmeyi; hastayı ziyaret etmeyi; da'vetçiye icabet eylemeyi; zulme uğramışa yardım etmeyi; yemini kabul etmeyi; selâmı karşılamayı; aksırana duâ etmeyi emreyledi. Yine Peygamber(sallallahü aleyhi ve sellem) bizi gümüş kap(kullanmak)tan; altın yüzükten; harîr, dîbâc, kassıyy, istebrak denilen ipekli kumaşları kullanmaktan da nehyetti",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1240,
			"arabicnumber": 1240,
			"text": "… Bize Amr ibn Ebî Seleme, el-Evzâî'den tahdîs etti. O şöyle demiştir: Bana İbnu Şihâb haber verip şöyle dedi: Bana Saîd ibnu Müseyyeb haber verdi ki Ebû Hureyre(radıyallahü anh) şöyle demiştir: Ben Rasûlüllah (sallallahü aleyhi ve sellem)'tan işittim; şöyle buyuruyordu: müslümân üzerindeki hakkı beştir: Selâmı karşılamak; hastayı ziyaret etmek; cenazeler ardından gitmek, da'vete icabet eylemek ve aksırana duâ eylemek\". hadîsi rivayet etmekte Amr ibn Ebî Seleme'ye, Abdurrazzâk ibn Hemmâm mutâbaat etmiş ve bize Ma'mer ibn Râşid haber verdi demiştir. Bu hadîsi, Selâme ibn Ravh, Ukayl ibn Hâlid'den rivayet etmiştir",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1242,
			"arabicnumber": 1242,
			"text": "ibn Şihâb şöyle demiştir: Bana Zeyd ibn Sâbit'in oğlu Hârice haber verdi. Ona da Ensâr'dan, Peygamber'e bey'at etmiş olan Ümmü’l-Alâ' ismindeki kadın (radıyallahü anh) şöyle haber vermiştir: Muhacirler kur'a ile(Ensâr arasında) taksim edilmişti. Bizim ailenin payına da Usmân ibn Maz'ûn düşmüştü. Biz Usmân'ı evlerimizde konuk ettik. Fakat Usmân (bir süre sonra) ölüm sebebi olan bir hastalıkla hastalandı. Vefat edince gasl edildi ve kendi elbisesi ile kefenlendi. Sonra Rasûluilah cenazeye geldi. Ben (cenazeyi tezkiye ederek): Yâ Ebâ Sâib! Allah'ın rahmeti senin üzerine olsun. Benim senin hakkındaki şehâdetim şudur: Yemîn ederim ki, Allah seni kerem ve inayetine mazhar kılmıştır, dedim. üzerine Peygamber: \"Allah’n bu ölüye kerem ve inayet ettiğini sana bildiren nedir?\" buyurdu. Yâ Rasûlallah! Bâbam sana feda olsun. Allah (buna ikram etmez de) kime ikram eder? dedim. defa da Peygamber: \"Usmân ibn Maz'ûn'a gelince, muhakkak ki, ölüm ona gelmiştir. Ve Allah 'a yemîn ederim ki, ben de bu ölü için hayr ve saadet ummaktayım. Yine Allah 'a yemin ederim ki, ben Allah 'in Rasûlü iken bana (ve size, yarm) Allah tarafından ne muamele yapılacağını bilemem\" buyurdu. Vallahi bundan sonra ben ebeden hiçbir kimseyi tezkiye etmem, demiştir",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1243,
			"arabicnumber": 1243,
			"text": "Bize el-Leys, bu hadîsin benzerini tahdîs etti. Ve Nâfi' ibnu Yezîd, Ukayl'den \"Ona ne muamele yapılacağını bilemem\" şeklinde söyledi. hadîsi rivayet etmekte ona Şuayb, Amr ibnu Dînâr ve Ma'mer mutâbaat etmişlerdir",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1244,
			"arabicnumber": 1244,
			"text": "Bize Şu'be tahdîs edip şöyle dedi: Ben Muhammed ibnu'l-Münkedir'den işittim; o şöyle dedi: Ben Câbir ibn Abdillah(radıyallahü anh)'ten işittim; o şöyle dedi: Bâbam (Uhud'da) şehîd edildiği zaman, ben ağlayarak yüzünden elbisesini açmaya başladım. Oradakiler beni ağlamaktan nehyediyorlardı. Halbuki Peygamber(sallallahü aleyhi ve sellem) beni nehyetmiyordu. Halam Fâtıma da ağlamaya başladı. Peygamber (sallallahü aleyhi ve sellem): \" (Yâ Fâtıma!)Siz ona ağlasanız da, ağlamasanız da, siz şehidi yerinden kaldırıncaya kadar melekler kanatlarıyle onu gölgelendirmekte devam ettiler'' buyurdu. hadîsi rivayet etmekte Şu'be'ye, İbn Cureyc mutâbaat etmiş ve şöyle demiştir: Bana ibnu'l-Münkedir, bunu Câbir (radıyallahü anh)'den işittiğini haber verdi",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1245,
			"arabicnumber": 1245,
			"text": "Ebû Hureyre(radıyallahü anh)'den (o, şöyle demiştir): Rasûlüllah(sallallahü aleyhi ve sellem) Necâşî'nin vefatını, Necâşî öldüğü gün bizzat haber verdi. Akabinde namaz yerine çıktı, sahâbîlerini saff yaptı ve dört tekbîr aldı",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1246,
			"arabicnumber": 1246,
			"text": "Enes ibn Mâlik(radıyallahü anh) şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem) -minber üzerinde-: \"Sancağı Zeyd ibn Harise aldı; akabinde şehîd edildi. Sonra sancağı Ca'fer ibn Ebî Tâlib aldı; o da şehîd edildi. Sonra sancağı Abdullah ibn Revâha aldı; o da şehîd edildi\" buyurdu. - (Bunu söylerken) Rasûlüllah'ın iki gözünden yaş akıyordu.- (Rasûlüllah devamla): \"Bundan sonra sancağı emirsiz olarak Hâlid ibn Velîd aldı ve ona feth ihsan olundu\" buyurdu",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1247,
			"arabicnumber": 1247,
			"text": "İbn Abbâsradıyallahü anhüma şöyle demiştir: Hastalığında kendisini Rasûlüllah'ın ziyaret etmekte olduğu bir insan vefat etti. Vefatı da geceleyin oldu da, onu geceleyin gömdüler. Sabah olunca onu Rasûlüllah'a haber verdiler. Rasûlüllah(sallallahü aleyhi ve sellem): \"Onu bana bildirmekten sizleri men'eden nedir?\" buyurdu. Sahâbîler: Gece idi; gece karanlıktı. Bunun için sana meşakkat vermek istemedik, dediler. Akabinde Rasûlüllah o zâtın kabrine geldi ve kabre karşı namaz kıldı",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1248,
			"arabicnumber": 1248,
			"text": "Enes ibn Mâlik (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) şöyle buyurmuştur: \"Henüz ergenlik çağına ulaşmadan üç çocuğu ölen insanlardan hiçbir müslümân yoktur ki, illâ Allah müslümânı, bu çocuklara ihsan ettiği geniş rahmeti ile cennete girdirmiş olmasın",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1250,
			"arabicnumber": 1250,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1251,
			"arabicnumber": 1251,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1252,
			"arabicnumber": 1252,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1253,
			"arabicnumber": 1253,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1254,
			"arabicnumber": 1254,
			"text": "Bize Abdulvahhâb es-Sakafî, Eyyûb es-Sahtıyânî'den; o da Muhammed ibn Sîrîn'den tahdîs etti. Ümmü Aüyye (radıyallahü anh) şöyle demiştir: Bizler, kızını yıkamakta olduğumuz sırada Rasûlüllah(sallallahü aleyhi ve sellem) yanımıza girdi de: \"Onu su ve sidr ile üç, yahut beş, yahut da bundan daha fazla yıkayınız. Son yıkayışta kâfur kullanınız. Yıkamayı bitirdiğinizde bana bildiriniz\" buyurdu. Biz yıkamayı bitirdiğimiz zaman kendisine haber verip bildirdik. Rasûlüllah bize hıkv denilen izârını attı da: \"Bunu kızıma iç gömleği yapın\" buyurdu. Eyyûb es-Sahtıyânî, yine geçen isnâd ile şöyle demiştir: Bu Ümmü Atıyye hadîsini bana Muhammed ibn Şîrîn'in haber verdiği gibi, ktzkardeşi Hafsa bintu Şîrîn de tahdîs etti. Fakat Hafsa'nın hadîsinde, Muhammed'in hadîsinden fazla olarak: \"Kızımı tek sayıda yıkayınız\", yine Hafsa'nm hadîsinde: \"Üç su, yahut beş su, yahut yedi su yıkayınız\"; yine Hafsa'nm hadîsindeRasûlüllah'ın: \"Onu yıkamağa sağlarından başlayınız ve abdest uzuvlarından başlayınız\" buyurduğu; yine Hafsa'nın hadîsinde: Ümmü Atıyye'nin, biz onun saçını üç bukle yaptık, dediği fıkraları vardır",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1255,
			"arabicnumber": 1255,
			"text": "Ümmü Atıyye(radıyallahü anh) şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem), kızının yıkanması hususunda: \"Bedeni sağ yanları ile ve abdest uzuvları ile yıkamaya başlayınız\" buyurdu",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1256,
			"arabicnumber": 1256,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1257,
			"arabicnumber": 1257,
			"text": "Ümmü Atıyye(radıyallahü anh) şöyle demiştir: Peygamber'in kızı vefat etti. Bunun üzerine Peygamber(sallallahü aleyhi ve sellem) bize: \"Onu üç yahut beş yahut eğer gerekli görürseniz bundan fazla sayıda yıkayınız. Yıkamayı bitirdiğinizde bana bildiriniz\" buyurdu. Biz yıkamayı bitirince Peygamber'e haber verip bildirdik. Peygamber belinden izârını çıkardı ve: \"Bu izan kızıma iç gömleği yapın\" buyurdu",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1259,
			"arabicnumber": 1259,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1260,
			"arabicnumber": 1260,
			"text": "Bize İbn Cureyc haber verdi. Eyyüb es-Sahtıyânî şöyle dedi: Yine ben Hafsa bintu Sîrîn'den işittim; o şöyle dedi: Bize Ümmü Atıyye(radıyallahü anh) tahdîs etti ki, onlar Rasûlüllah'ın kızının başını üç bukle yapmışlardır. İbn Atıyye: Biz yıkayacağımız sırada saç örgülerini çözdük. Sonra başını yıkadık, sonra da saçları üç bukle yaptık, dedi",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1261,
			"arabicnumber": 1261,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1262,
			"arabicnumber": 1262,
			"text": "Bize Sufyân(es-Sevrî), Hişâm ibn Hassân'dan; o da Ümmü'l-Huzeyl (Hafsa bintu Sîrîn)'den; o da Ümmü Atıyye (radıyallahü anh)'den tahdîs etti. Ümmü Atıyye: Biz Peygamber'in kızının saçlarını ördük, yani üç örgü yaptık, demiştir. de dedi ki: Sufyân es-Sevrî: Alın perçemini bir bukle, başın iki yan tarafının saçlarını da ayrı ayrı iki bukle yapmıştır, dedi",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1263,
			"arabicnumber": 1263,
			"text": "Ümmü Atıyye(radıyallahü anh) şöyle demiştir: Peygamber'in kızlarından biri vefat etti. Akabinde Peygamber(sallallahü aleyhi ve sellem) bize geldi de: \"Onu sidrli su ile tek sayıda yıkayın. Ya üç, ya beş, yahut eğer gerekli görürseniz bundan daha fazla tek sayıda yıkayınız. Son yıkama suyunun içine kâfur yahut kâfur nev'inden güzel kokulu birşey katınız. Yıkamayı bitirdiğinizde bana bildirin\" buyurdu. Nihayet biz yıkamayı bitirdiğimizde kendisine bildirdik. Peygamber bize hıkve’sini (yani izârmı) attı. Biz o kızın saçlarım üç örgü yaptık ve bu üç örgüyü de arka tarafına atıp salıverdik",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1264,
			"arabicnumber": 1264,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1265,
			"arabicnumber": 1265,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1266,
			"arabicnumber": 1266,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1267,
			"arabicnumber": 1267,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1268,
			"arabicnumber": 1268,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1269,
			"arabicnumber": 1269,
			"text": "Ubeydullah şöyle demiştir: Bana Nâfi', ibn Omer'den tahdîs etti (o, şöyle demiştir): Abdullah ibn Ubeyy öldüğü zaman oğlu Abdullah, Peygamber'e geldi ve: Yâ Rasûlallah! Gömleğini bana ver de Bâbamı onun içinde kefenleyeyim; namazını da Sen kıldır ve onun için mağfiret isteyiver, dedi. Peygamber(sallallahü aleyhi ve sellem), Abdullah'a kendi gömleğini verdi ve: \"Cenaze hazırlanınca bana haber ver de namazını kılayım\" buyurdu. Müteakiben Abdullah cenazenin hazırlandığını Peygamber'e bildirdi.Peygamber onun cenaze namazını kıldırmaya davrandığında Omer (radıyallahü anh)Peygamber'i çekti ve:(Yâ Rasûlallah!) Allah seni münafıklar üzerine namaz kılmaktan nehyetmedi mi? dedi. Peygamber(sallallahü aleyhi ve sellem) \"Ben iki tercih etme arasında serbestim (yani istiğfar etmekte ve etmemekte muhayyerim). Allah Taâlâ: “Onlar için istiğfar et yahut istiğfar etme. Eğer onlar için yetmiş defa istiğfar dahi etsen, yine Allah kendilerini kafiyyen mağfiret etmiyecektir (Tevbe: 80)buyurdu\" diye cevâb verdi. Ve Rasûlüllah, Abdullah ibn Ubeyy'in cenazesine namaz kıldı. Bunun üzerine: \"Onlardan ölen hiçbir kimse üzerine dua etme; (defn veya ziyaret için) kabrinin başında da dikilme. Çünkü onlar Allah’ı ve Rasûlü’nü inkâr ile kâfir oldular ve onlar fâsıklar olarak öldüler”(et-Tevbe: 84)",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1270,
			"arabicnumber": 1270,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1271,
			"arabicnumber": 1271,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1272,
			"arabicnumber": 1272,
			"text": "Âişe (r. anha): Rasûlüllah (sallallahü aleyhi ve sellem) içlerinde gömlek ve başlık bulunmayan üç tane bez içinde kefenlendirildi, demiştir",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1273,
			"arabicnumber": 1273,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1274,
			"arabicnumber": 1274,
			"text": "Bize İbrâhîm ibn Sa'd, Bâbası Sa'd ibn İbrâhîm'den; o da Bâbası İbrâhîm ibn Abdirrahmân'dan tahdîs etti. O şöyle demiştir: Bâbam Abdurrahmân ibn Avf'un önüne bir gün yemeği getirilmişti. Bunun üzerine dedi ki: Mus'ab ibn Umeyr (Uhud'da) şehîd edildi. Halbuki o benden çok hayırlı idi. Ona bir tek kaftandan başka içinde kefenleneceği birşey bulunmamıştı. Hamza da şehîd edildi -.Yâhud diğer bir adam şehîd edildi, demiştir-. O da benden hayırlı idi. Ona da bir kaftandan -yahut kaftanından- başka içinde kefenlenebileceği şey bulunamamıştı. Yemîn olsun ki ben, âhiret için kazandığımız hasenelerin bize bu dünyâ hayâtımızda peşin verilmiş olmasından endîşe etmişimdir, dedi; sonra da ağlamaya başladı",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1275,
			"arabicnumber": 1275,
			"text": "Bize Şu'be, Sa'd ibn İbrâhîm'den; o da Bâbası İbrâhîm'den haber verdi. O şöyle demiştir: Oruçlu bulunduğu bir gün Bâbam Abdurrahmân ibn Avf’ın önüne bir iftar sofrası getirilmişti. Bâbam (sofraya bakıp) şöyle dedi: Mus'ab ibn Umeyr (Uhud'da) şehîd edildi. Halbuki o benden daha hayırlı idi. Öyleyken Mus'ab bir tek bürde içinde kefenlendi.-Bununla başı örtülse ayakları açılıyor; ayakları örtülse başı açılıyordu. Râvî dedi ki: Ben Bâbam Abdurrahmân ibn Avf şunu da söyledi zannediyorum: Hamza da şehîd edildi. Halbuki o da benden daha hayırlı idi. Sonra bize dünyâ ni'metlerinden önümüze serilen bunca ni'metler yazılıp serildi -Yâhud da: Dünyâdan bize verilen bunca ni'metlere nail olduk, dedi-. Halbuki bizler, âhiret için kazandığımız hasenelerin ta'cîl edilip de, bize dünyâda verilmiş olmasından endîşe etmekteyiz, dedi; sonra üzülerek ağlamaya başladı, hattâ yemeği de terkeyledi",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1276,
			"arabicnumber": 1276,
			"text": "Bize Habbâb(radıyallahü anh) tahdîs edip şöyle dedi: Biz Allah rızâsını kasdederek Peygamber(sallallahü aleyhi ve sellem) ile hicret ettik. Artık ecrimiz (va'di gereğince) Allah'a vâcib oldu. Yoldaşlarımızdan bunun ecr ve ni'metinden hiçbirşey tatmadan âhirete gidenler vardır. Mus'ab ibn Umeyr bunlardan birisidir. Dostlarımızdan, kendilerine hicret semeresi ulaşan ve bu meyveyi devşirenler de vardır. Mus'ab, Uhud günü şehîd edilmişti de biz onu saracak bir kefen bulamamıştık. Yalnız (şehide âid) bir kaftan bulmuştuk da bu şehîdi ona sarmağa çalışmıştık. Bürdeyle başını örttüğümüzde ayaklan açığa çıkıyor; ayaklarını örttüğümüz zaman ise başı açığa çıkıyordu.(Bu yokluk karşısında) Peygamber (sallallahü aleyhi ve sellem) bize şehidin başını örtmemizi ve ayaklarının üstüne de ızhır (denilen kokulu ottan) koymamızı emreyledi",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1277,
			"arabicnumber": 1277,
			"text": "Sehl ibn Sa'd'den(o, şöyle demiştir): Bir kadın kenarlı dokunmuş bir bürdeyi Peygamber'in yanına getirdi. Sehl: Bilir misiniz, bürde nedir? diye sordu. Oradakiler: Şemledir, ihramdır, diye cevâb verdiler. Evet öyledir, dedi. Bu bürdeyi kendi elimle dokudum ve sana giydirmek için geldim, dedi. de o bürdeyi aldı ve zâten kendisinin böyle bir bürdeye ihtiyâcı vardı. AkabindePeygamber o bürdeyi örtünerek bizim yanımıza çıktı. Fulân sahâbî de bu bürdenin güzelliğini belirtti ve: Rasülallah!) Bu ne kadar güzel; bunu bana giydir, dedi. Orada bulunanlar, o zâta: Bunu söylemekle iyi etmedin. Peygamber bu bürdeyi ihtiyâcı olarak giymişti. Sonra sen Peygamber'in hiçbir isteyeni reddetmez olduğunu bildiğin hâlde bunu kendisinden istedin, dediler. da: Vallahi ben bu bürdeyi giymek için istemedim. Ben onu ancak benim kefenim olsun diye istedim, dedi. Sa'd: Hakîkaten bu bürde o zâtın kefeni oldu, demiştir",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1278,
			"arabicnumber": 1278,
			"text": "Ümmü Atıyye: Biz kadınlar cenazeler ardında gitmekten nehy olunduk. Cenazeler ardından gitmek bizim üzerimize vâcib kılınmadı, demiştir",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1279,
			"arabicnumber": 1279,
			"text": "Muhammed ibn Sîrîn şöyle demiştir: Ümmü Atıyye'nin bir oğlu ölmüştü. Vefatının üçüncü günü olunca, Ümmü Atıyye safranlı bir koku istedi. Akabinde bu kokuyu kendisine sürdü de: Biz kadınlar, kocadan başka ölüler için üç günden fazla yas tutmaktan nehyolunduk, dedi",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1280,
			"arabicnumber": 1280,
			"text": "Bana Humeyd ibnu Nâfi', Ümmü Seleme'nin kızı Zeyneb'den; o da Ebû Sufyân'ın kızı Ümmü Habîbe'den olmak üzere şöyle tahdîs etti: Ümmü Habîbe, babasının ölüm haberi gelince, (üçüncü günü içinde) bir koku istedi, bunu iki koluna sürdü ve şöyle dedi: Benim güzel koku sürünmeye hiç ihtiyâcım yoktur. Şu var ki, ben Peygamber (sallallahü aleyhi ve sellem)'den şöyle buyururken işitmişimdir:\"Allah'a ve son güne îmân eder hiçbir kadına, kocasından başka bir ölü üzerine üç günden fazla kokulanma ve süslenmeyi terketmesi halâl olmaz. Kadın ancak kocasının ölümü üzerine dört ay on gün zîneti bırakır",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1282,
			"arabicnumber": 1282,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1283,
			"arabicnumber": 1283,
			"text": "Enes ibn Mâlik (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem), bir kabir yanında ağlamakta olan bir kadının yanından geçti de, o kadına: ; \"Allah'a ıttıkaa et ve sabreyle\" buyurdu. Benden uzaklaş, sen benim musibetimle musîbetlenmedin, dedi. Peygamber'i tanımıyordu. Kadına: Bu zât Peygamber'dir, denildi. üzerine kadın Peygamber'in kapısına geldi. Kadın, Peygamber'in kapısı yanında kapıcılar (bekçiler) bulmadı.(Peygamber'in yanına girdi de:) Ben seni bilemedim, dedi. Peygamber(sallallahü aleyhi ve sellem): \"Sabr ancak musibetin birinci darbesi sırasındadır\" buyurdu",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1284,
			"arabicnumber": 1284,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1285,
			"arabicnumber": 1285,
			"text": "Enes ibn Mâlik (radıyallahü anh) şöyle demiştir: Bizler Rasûlüllah'ın bir kızının (Ümmü Kulsüm'ün) cenazesinde hazır bulunduk. Enes dedi ki: Rasûlüllah kabrin bir tarafına oturmuştu. Yine Enes dedi ki: Ben Rasûlüllah'ın iki gözünün yaş akıtmakta olduğunu gördüm. Yine Enes dedi ki: Rasûlüllah(sallallahü aleyhi ve sellem): \"İçinizde bu gece günâh işlememiş kimse var mıdır?\"diye sordu. Talha: Ben varım, dedi. Rasûlüllah: \"Haydi, kabre in!\" buyurdu. üzerine Ebû Talha o kadının kabrine indi (de yerleştirdi)",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1288,
			"arabicnumber": 1288,
			"text": "el-Mugîre (radıyallahü anh) şöyle demiştir: BenPeygamber (sallallahü aleyhi ve sellem)'den işittim, şöyle buyuruyordu: \"Benim ağzımdan yalan söylemek, başka bir kimse ağzından yalan söylemek gibi değildir. Her kim bile bile benim ağzımdan yalan uydurursa ateşteki yerine hazırlansın\". El-Mugîre dedi ki: Ben yinePeygamber'den işittim: \"Herhangi ölüye feryâd ve figânla ağlanırsa, kendisine yapılan bu feryâd ve figân sebebiyle azâblandırılır\" buyuruyordu",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1289,
			"arabicnumber": 1289,
			"text": "Âişe (r.anha) şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem), ailesi başında ağlaşmakta olan bir Yahûdî karısının (mezarı) yanından geçmişti de: \"Bunlar ölüleri üzerine ağlıyorlar. Halbuki ölü kabrinde azâb olunuyor\" buyurdu",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1290,
			"arabicnumber": 1290,
			"text": "Ebû Mûsâ (radıyallahü anh) şöyle demiştir: Omer vurulduğu zaman Suheyb: Vah kardeşim! Diyerek ağlamaya başlamıştı. Bunun üzerine Omer: Yâ Suheyb! Peygamber (sallallahü aleyhi ve sellem)'in\"Şübhesiz ölü, dirinin ağlaması ile muhakkak azâb olunur\" buyurduğunu bilmez misin? Dedi",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1291,
			"arabicnumber": 1291,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 1292,
			"arabicnumber": 1292,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 1293,
			"arabicnumber": 1293,
			"text": "Ben Câbir ibn Abdillah (radıyallahü anh)'tan işittim, şöyle dedi: günü bâbam şehîd edilip, burnu, kulakları, etrafı kesilmiş olarak getirildi ve nihayet Rasûlüllah'ın önüne konuldu. Üzeri bir bezle örtülmüş hâldeydi. Ben Bâbamın üstünden örtüsünü açmak isteyerek yanına vardım. Akrabalarım beni bundan nehyettiler. Sonra bir daha açmak üzere vardım. Yine kabîlem beni nehyettiler. Bu defa Rasülullah emir buyurdu da, örtü kaldırılıp açıldı. Bu sırada bir kadın çığlığı işitti ve: \"Bu kadın kimdir?\" diye sordu. Oradakiler: Amr'ın kızıdır, yahut Amr'ın kızkardeşidir, diye cevâb verdiler. \"Bu kadın niçin ağlıyor?\" Yâhud da: \"Ağlamasın! Çünkü o aziz şehidi melekler, cenazesi kaldırılıncaya kadar kanatlarıyla gölgelemekte devam ettiler\" buyurdu",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 1294,
			"arabicnumber": 1294,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 1295,
			"arabicnumber": 1295,
			"text": "Sa'd ibn Ebî Vakkaas(radıyallahü anh) şöyle demiştir: Veda Haccı yılında Mekke'de tutulduğum şiddetli bir hastalığımda Rasülullah bana hasta ziyareti yapıyordu. Ben: Yâ Rasûlallah! Bendeki hastalık şu şiddetli dereceye ulaşmıştır. Ben mal sahibi bir kimseyim. Bana yalnız bir tek kızdan başkası mîrâsçı olmayacak. Buna göre malımın üçte ikisini sadaka yapayım mı? diye sordum. \"Hayır, sadaka yapma\" buyurdu. Yarısını sadaka yapayım mı? dedim. , Rasûlüllah yine: \"Hayır, sadaka yapma\" dedi. Sonra Rasûlüllah şöyle buyurdu: \"Üçte bir (sadaka yap).Üçte bir de büyüktür yahut çoktur. Senin mirasçılarını zengin bırakman, muhtaç ve halka el açar halde fakır bırakmandan daha hayırlıdır. Ey Sa'd! Sen Allah rızâsını isteyerek harcayacağın her bir nafakadan muhakkak ücret alacaksın. Hattâ yemek yerken eşinin ağzına koyacağın bir lokmadan dolayı da ecre nail olacaksın\". ben: Yâ Rasûlallah!(Siz Medine'ye döneceksiniz de) ben arkadaşlarımın arkasında geriye mi bırakılacağım? Diye sordum. aleyhi ve sellem) şöyle buyurdu: geri bırakılmıyacaksın.(Şayet burada kalır da) sâlih amel işlersen, elbette onunla derecen artacak, merteben de yükselecektir. Sonra zannediyorum ki, sen uzun zaman yaşatılacaksın. Hattâ senden bir takım kavimler faydalanacak; diğer bir takımları da senden dolayı zarara uğrayacaklardır. Yâ Allah! Sahâbîlerimin hicretlerini tamamla, onları topukları üzerinde ters çevirme!\" hâli üzüntülü olan Sa'd ibn Havle'dir. Rasûlüllah(sallallahü aleyhi ve sellem) ona, Mekke'de ölmüş olmasından dolayı şefaat edip, üzülmektedir",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 1296,
			"arabicnumber": 1296,
			"text": "Bana Ebû Musa'nın oğlu Ebû Burde tahdîs edip şöyle dedi: (Bir kerre Bâbam) Ebû Mûsâ şiddetli bir hastalıkla hastalanmıştı. Bu sırada başı ailesinden bir kadının kucağında olduğu hâlde bayılmıştı. Bunun üzerine kadın ağlamağa başladı. Fakat Ebû Mûsâ, kadının bu ağlamasını men' etmeye muktedir olamamıştı. Ebû Mûsâ bu baygınlıktan açılınca şöyle dedi: Rasûlüllah'ın hoşlanmayıp uzak bulunduğu kimselerden ben de uzağımdır. Şübhesiz Rasûlüllah (sallallahü aleyhi ve sellem) musîbet zamanında sayha eden, saçını yolan ve elbisesini yırtan kadınlardan uzak bulunmuştur",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 1297,
			"arabicnumber": 1297,
			"text": "Abdullah ibn Mes'ûd'dan: Peygamber(sallallahü aleyhi ve sellem) şöyle buyurmuştur: \"Yanakları döven, yakaları yırtan ve Câhiliyyet çağırış bağır işiyle feryad eden kimseler bizden değildir",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 1298,
			"arabicnumber": 1298,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 1299,
			"arabicnumber": 1299,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 1300,
			"arabicnumber": 1300,
			"text": "Enes ibn Mâlik (radıyallahü anh) şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem) Maûne kuyusunda yetmiş kadar kurrâ şehîd edildiği zaman bir ay kunût yaptı(ve müşrikler aleyhine duâ etti). Ben Rasûlüllah'ın o zamandan daha şiddetli bir hüzünle üzüldüğünü asla görmedim",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 1301,
			"arabicnumber": 1301,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 1302,
			"arabicnumber": 1302,
			"text": "Bize Şu'be, Sabit el-Bunânî'den tahdîs etti. O şöyle demiştir: Ben Enes ibn MâIik (radıyallahü anh)'ten işittim; Peygamber (sallallahü aleyhi ve sellem): \" (Gerçek) sabr, musibetin ilk darbesi sırasında (katlanıp dayanmak)” buyurmuştur",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 1303,
			"arabicnumber": 1303,
			"text": "Bize Kurayş -ki o İbnu Hayyân'dır-,Sâbit el-Bunânî'den tahdîs etti. Enes ibn Mâlik(radıyallahü anh) şöyle demiştir: Rasûlüllah ile demirci bir san'atkâr olan Ebû Seyf in yanına girdik. Ebû Seyf, (Peygamber'in çocuğu) İbrahim'in süt Bâbası idi. Rasûlüllah, İbrahim'i aldı, onu öptü ve kokladı Bundan sonra bir kerre daha Ebû Seyf in evine gittik. Bu defa İbrâhîm can veriyordu. Rasûlüllah'ın iki gözü yaş dökmeye başladı. Bunun üzerine Abdurrahmân ibn Avf: Yâ Rasûlallah! Halk musibet zamanında sabr etmeyebilir; fakat sen de mi? diye taaccüb ifâde etti. \"Ey Avf oğlu! Bu halet, bir rahmet ve şefekattir\" buyurdu. Sonra bu gözyaşını diğer bir gözyaşı ta'kîb etti. Bu defa da Rasûlüllah (sallallahü aleyhi ve sellem): \"Şübhesiz göz ağlar, kalp de mahzun olur. Biz ise, Rabb'imizin razı olacağı sözden başka söz söylemeyiz. Yâ İbrahim! Bizler senin ayrılığınla pek mahzun ve kederliyiz\" buyurdu. hadîsi Mûsâ ibn Ismâîl, Süleyman ibnu'l-Mugîre'den; o da Sabit el-Bunânî'den; o da Enes ibn Mâlik'ten; o da Peygamber(sallallahü aleyhi ve sellem)'den olmak üzere rivayet etmiştir",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 1304,
			"arabicnumber": 1304,
			"text": "Abdullah ibn Omer (radıyallahü anh) şöyle demiştir: Sa'd ibn Ubâde bir kerre kendisine arız olan bir hastalıktan dolayı rahatsız oldu. Peygamber(sallallahü aleyhi ve sellem), Abdurrahmân ibn Avf, Sa'd ibn Ebî Vakkaas ve Abdullah ibn Mes'ûd ile birlikte Sa'd'e hasta ziyaretine geldiler. Peygamber, Sa'd'ın yanına girdiği zaman, onu ailesi halkı tarafından çepçevre kuşatılmış bir hâlde buldu. Rasûlüllah: \"Sa'd öldü mü?\" diye sordu Hayır yâ Rasûlallah, ölmedi, dediler. duygulanıp ağladı. Topluluk Peygamber'in ağladığını görünce, onlar da ağladılar. Bunun üzerine Peygamber (sallallahü aleyhi ve sellem): misiniz? Şübhesiz ki, Allah gözyaşı ile ve iç üzüntüsü ile azâp etmez. Lâkin -diline işaret ederek- işte bunun yüzünden ya azâp eder yâhûd da merhamet eyler. Ve şüphesiz ölü, ailesinin kendisine (nehyedilmiş bir ağlayışla) ağlamasından dolayı azâp olunur\" buyurdu. anh) de (Câhiliyyet âdeti üzere) ağlandığında sopa ile döver, çakıl taşları atar ve toprak saçardı",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 1305,
			"arabicnumber": 1305,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 1306,
			"arabicnumber": 1306,
			"text": "Ümmü Atıyye (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem), biz kadınlardan İslâm üzerine bey'at aldığı sırada ölüye feryâd ve çığlıkla ağlamayacağımıza dâir de söz almıştı. Beş kadından başka bizden hiçbir kadın(o zaman) ahdine vefa etmedi. Ahdini yerine getiren beş kadın: Ümmü Süleym, Ümmü'l-Alâ, Muâz'ın karısı olan Ebû Sebre kızı, ve daha iki kadındır. Yâhud Ebû Sebre kızı üe Muâz'ın karısı ve diğer bir kadın",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 1307,
			"arabicnumber": 1307,
			"text": "Bize Sufyân ibn Uyeyne tahdîs edip şöyle dedi: Bize ez-Zuhrî, Sâlim'den; o da Bâbası Abdullah ibn Omer'den; o da Âmir ibn Rabîa'dan tahdîs etti. Peygamber (sallallahü aleyhi ve sellem): \"Sizler cenaze gördüğünüzde, cenaze sizi geride bırakıncaya kadar ayağa kalkınız\" buyurmuştur. ibn Uyeyne şöyle dedi: ez-Zuhrî şöyle dedi: Bana Salim, bâbasından haber verdi. Bâbası Abdullah ibn Omer: Bize Âmir ibn Rabîa, Peygamber'den haber verdi, demiştir. el-Humeydî Ebû Bekr Abdullah el-Mekkî, Sufyân ibn Uyeyne'den yaptığı rivayetinde: “Cenaze sizi geride bırakıncaya yahut cenaze yere konuluncaya kadar ayakta durunuz\" fıkrasını ziyâde etmiştir",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 1308,
			"arabicnumber": 1308,
			"text": "Bize el-Leys ibn Sa'd, Nâfi'den; o da İbn Omer (radıyallahü anh) 'den; o da Âmir ibn Rabîa'dan tahdîs etti. Peygamber(sallallahü aleyhi ve sellem) şöyle buyurmuştur: herhangi biriniz bir cenaze gördüğünde, cenazenin beraberinde yürüyücü değilse, cenazeyi arkada bırakıncaya kadar yâhut cenaze onu geride bırakıncaya kadar yâhut cenaze o kimseyi arkada bırakmazdan evvel cenaze yere indirilinceye kadar ayağa kalksın",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 1309,
			"arabicnumber": 1309,
			"text": "Keysân şöyle demiştir: Biz bir cenazede bulunduk. Ebû Hureyre, Mervân'ın elini tuttu. Cenaze yere konulmazdan evvel ikisi oturdular. Bunun üzerine Ebû Saîd el-Hudrî gelip Mervân'ın elinden tuttu ve: Ayağa kalk! Yemin olsun şu adam (yânı Ebû Hureyre), Peygamber'in bizleri cenaze omuzlardan yere indirilmedikçe oturmadan nehyettiğini kat'î olarak bilmektedir, dedi. söz üzerine Ebû Hureyre de: Ebû Saîd doğru söyledi, dedi",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 1310,
			"arabicnumber": 1310,
			"text": "Bize Yahya ibn Ebî Kesîr, Ebû Seleme ibn Abdirrahmân'dan; o da Ebû Saîd el-Hudrî(radıyallahü anh)'den tahdîs etti. Peygamber (sallallahü aleyhi ve sellem): cenaze gördüğünüz zaman hemen ayağa kalkınız. Cenazenin ardından giden kimse ise, cenaze konuluncaya kadar oturmasın\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 1311,
			"arabicnumber": 1311,
			"text": "Câbir ibn Abdillah şöyle demiştir: Bir kerre yanımızdan bir cenaze geçmişti. Peygamber(sallallahü aleyhi ve sellem) hemen o cenaze için ayağa kalktı. Biz de ona uyarak ayağa kalktık ve: Yâ Rasûlallah! Bu bir Yahûdî cenâzesidir, dedik. \"Bir cenaze gördüğünüzde hemen ayağa kalkınız\" buyurdu",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 1313,
			"arabicnumber": 1313,
			"text": "Keysân, EbûSaîd el-Hudrî'den işitti ki, Rasûlüllah(sallallahü aleyhi ve sellem) şöyle buyurmuştur: \"Cenaze (tâbuta) konulup erkekler omuzları üzerine yüklendikleri zaman, eğer o cenaze iyi bir kişi ise: 'Beni (sevabıma) ulaştırınız' der. Eğer o cenaze iyi olmayan bir kişi ise: 'Eyvah! Bu cenaze ile nereye gidiyor sunuz?' diye feryâd eder. Cenazenin bu feryadını (gafil)insandan başka her varlık işitir. İnsan bu sayhayı işitseydi, muhakkak düşer bayılırdı",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 1314,
			"arabicnumber": 1314,
			"text": "Bize Sufyân ibn Uyeyne tahdîs edip şöyle dedi: Biz şu gelecek hadîsi ez-Zuhrî'den ezberledik; o da Saîd ibnu'l-Müseyyeb'den; o da Ebû Hureyre (radıyallahü anh)'den. Peygamber(sallallahü aleyhi ve sellem) şöyle buyurmuştur: \"Cenazeyi sür'atlice naklediniz. Eğer bu ölü iyi bir kişi ise, bu bir hayrdır. Onu (bir an evvel kabirdeki) hayr ve sevabına ulaştırmış olursunuz. Eğer bu cenaze iyi bir kişi değilse, bu da bir şerrdir. Onu omuzlarınızdan (çabuk) indirip korsunuz",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 1315,
			"arabicnumber": 1315,
			"text": "Keysân, Ebû Saîd Hudrî'den işitmiştir. O şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem) şöyle der idi:\"Cenâze tâbuta konulduğu ve erkekler onu omuzları üzerine yüklendikleri zaman, eğer o cenaze iyi bir kişi idiyse; 'Beni (sevabıma) ulaştırınız' der ve eğer o cenaze iyi olmayan bir kişi idiyse, cenaze ahâlîsine hitaben: 'Bu cenazeye yazıklar olsun! Onu nereye götürüyorlar?' diye feryâd eder. Cenazenin bu feryadını insandan başka herşey işitir. İnsan bunu işitseydi, muhakkak düşer bayılırdı",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 1316,
			"arabicnumber": 1316,
			"text": "Câbir ibn Abdillah(radıyallahü anh): Rasûlüllah (sallallahü aleyhi ve sellem) (Habeş hükümdarı olan) Necâşî üzerine cenaze namazı kıldırdı. Ben ikinci yahut üçüncü saffta bulundum, demiştir",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 1317,
			"arabicnumber": 1317,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 1318,
			"arabicnumber": 1318,
			"text": "Ebû Hureyre(radıyallahü anh) şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem) Necâşî'nin ölüm haberini sahâbîlerine ulaştırdı. Sonra (namaz kıldırmak üzere) kendisi öne geçti, sahâbîler O'nun arkasında dizi dizi sıralanıp saff oldular. Akabinde Peygamber dört tekbîr aldı",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 1319,
			"arabicnumber": 1319,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 1320,
			"arabicnumber": 1320,
			"text": "Bana Atâ ibn Ebî Rebâh haber verdi. O, Câbir ibn Abdillah(radıyallahü anh)'tan şöyle derken işitmiştir:Peygamber (sallallahü aleyhi ve sellem): \"Bu gün Habeş milletinden iyi bir adam ölmüştür, gelin de ona cenaze namazı kılın!\" buyurdu. dedi ki: Biz dizilip saff olduk. Bizler dizi dizi safflar hâlinde iken Peygamber Necâşî üzerine cenaze namazı kıldırdı. Muhammed ibn Müslim, Câbir'den söyledi. Câbir: (Peygamber Necâşî'ye cenaze namazı kıldığı zaman) ben ikinci saffta idim, demiştir",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 1321,
			"arabicnumber": 1321,
			"text": "Bize Süleyman eş-Şeybânî, Âmir eş-Şa'bî'den; o da İbn Abbâs radıyallahü anhüma'tan tahdîs etti (o, şöyle demiştir): Rasûlüllah(sallallahü aleyhi ve sellem) geceleyin içine cenaze gömülmüş olan bir kabre uğradı. Orada bulunan cenaze sâhiblerine: \"Bu cenaze ne zaman gömüldü?\" diye sordu. Onlar da: Geçen gece(yânı dünkü günün gecesinde), diye cevâb verdiler. bu ölüyü hastalığı sırasında ziyaret etmiş bulunduğundan) cenaze sâhiblerine: \"Bana niçin haber vermediniz?\" diye serzeniş etti. Onlar: Biz onu gecenin karanlığında gömdük; sizi o vakitte uyandırmak istemedik, dediler. üzerine Rasûlüllah namaza dikeldi. Biz de arkasında saff bağladık. İbn Abbâs dedi ki: Ben de bu saffların içinde bulundum.Rasûlüllah bu gömülü olan ölüye namaz kıldı",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 1322,
			"arabicnumber": 1322,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 1324,
			"arabicnumber": 1324,
			"text": "Bize Abdullah ibnu Mesleme tahdîs edip şöyle dedi: Ben İbnu Ebî Zi'b'in huzurunda okudum. O da Saîd ibn Ebî Saîd el-Makburî'den; o da Bâbası Ebû Saîd Keysân'dan. O, Ebû Hureyre'den sormuş; Ebû Hureyre de: Ben Peygamber (sallallahü aleyhi ve sellem)'den işittim, demiştir",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 1325,
			"arabicnumber": 1325,
			"text": "Ve bana Abdullah ibnu Muhammed tahdîs etti: Bize Hişâm tahdîs etti: Bize Ma'mer, ez-Zuhrî'den; o da İbnu'l-Müseyyeb'den; o da Ebû Hureyre(radıyallahü anh)'den. Peygamber (sallallahü aleyhi ve sellem) buyurdu ki... Bize Ahmed ibnu Şebîb ibn Saîd tahdîs edip şöyle dedi: Bana Bâbam Şebîb ibn Saîd tahdîs edip şöyle dedi: Bize Yûnus ibn Yezîd tahdîs etti. İbnu Şihâb dedi ki: Ve bana Abdurrahmân el-A'rac tahdîs etti ki, Ebû Hureyre (radıyallahü anh) şöyle demiştir : Rasûlüllah(sallallahü aleyhi ve sellem): \"Cenazede, cenaze namazı kılınıncaya kadar hazır bulunan kimseye bir kîrât vardır. Cenaze gömülünceye kadar hazır bulunan kimse için ise iki kîrât sevâb olur\" buyurdu. İki kîrât nedir? Denildi. Rasûlüllah: \"İki büyük dağ gibidir\" buyurdu",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 1326,
			"arabicnumber": 1326,
			"text": "İbn Abbâsradıyallahü anhüma şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) bir kabre geldi. Orada bulunanlar: Bu cenaze dünkü günün gecesinde gömüldü dediler. İbn Abbâs bu kelimeyi dufine yahut dufinet şeklinde terdîdli söylemiştir. İbn Abbâs: Biz Rasûlüllah'ın arkasında saff olduk, sonra Rasûlüllah o gömülü cenaze üzerine namaz kıldırdı, dedi",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 1328,
			"arabicnumber": 1328,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 1329,
			"arabicnumber": 1329,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 1330,
			"arabicnumber": 1330,
			"text": "Urve'den;o da Âişe (r.anha)'den tahdîs etti. Peygamber(sallallahü aleyhi ve sellem) âhirete göç ettiği hastalığında: \"Allah Yahûdîler'i ve Hrısiyanlar'ı rahmetinden uzak kılsın. Bunlar peygamberlerinin kabirlerini mescid edindiler\" buyurmuştur. Âişe: Böyle bir endîşe olmasaydı sahâbîler, Rasûlüllah'ın kabrini açık bırakırlardı. Lâkin ben onun mescid edinilmesinden korkarım, demiştir",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 1331,
			"arabicnumber": 1331,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 1332,
			"arabicnumber": 1332,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 1333,
			"arabicnumber": 1333,
			"text": "Ebû Hureyre (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem), vefat etmiş olduğu gün içinde Necâşî'nin ölümünü bildirdi. Ve sahâbîleri musallaya çıkardı, onları sıralayıp saff yaptı ve Necâşî üzerine dört defa tekbîr aldı",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 1334,
			"arabicnumber": 1334,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 1335,
			"arabicnumber": 1335,
			"text": "Bize Muhammed ibn Beşşâr tahdîs edip şöyle dedi: Bize Gunder tahdîs edip şöyle dedi. Bize Şu'be, Sa'd ibn İbrahim'den; o da Talha ibn Abdillah'tan tahdîs etti. Talha: Ben İbn Abbâs'ın arkasında cenaze namazı kıldım, demiştir. bize Muhammed ibnu Kesîr tahdîs edip şöyle dedi: Bize Sufyân es-Sevrî, Sa'd ibn İbrâhîm'den; o da Talha ibn Abdillah ibn Avf’tan haber verdi. Talha: Ben İbn Abbâs'ın arkasında cenaze üzerine namaz kıldım; bu namazda ibn Abbâs Fâtihatu'l-Kitâb'ı okudu da: Cenaze namazında Fâtihatu'l-Kitâb okumak bir sünnet olduğunu bilsinler dedi, demiştir",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 1336,
			"arabicnumber": 1336,
			"text": "Ben eş-Şa'bî'den işittim, şöyle dedi: Bana, Peygamber(sallallahü aleyhi ve sellem)'in beraberinde, kenarda kalmış bir kabre uğrayan kimse haber verdi. Peygamber onlara imâm olmuş, onlar da Peygamber'in arkasında o mezar üzerine cenaze namazı kılmışlardır. (Süleyman eş-Şeybânî dedi ki:) Ben eş-Şa'bî'ye hitaben: Yâ Ebâ Amr, bu hadîsi sana tahdîs eden(sahâbî) kimdir? Dedim. eş-Şa'bî: Abdullah ibn Ab-bâs (radıyallahü anh)'tır, dedi",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 1337,
			"arabicnumber": 1337,
			"text": "(Ebû Hureyre -radıyallahü anh- şöyle demiştir): Bir zencî adam yahut zencî kadın mescidi süpürür idi. Günün birinde vefat etti. Fakat Peygamber onun ölümünü bilmemişti. Bir gün Peygamber o zâtı andı da: \"Bu insan ne yaptı?\" diye sordu. Sahâbîler: O öldü yâ Rasûlallah, dediler. Rasûlüllah: \"Bana(vefatını) haber vermeli değil miydiniz?\" buyurdu. Sahâbîler: O şöyle şöyle oldu diye, onun kıssasını zikrettiler. Râvî dedi ki: Sahâbîler bu sözleriyle o zâtın şânını horladılar (onu küçük ve ehemmiyetsiz gördüler). Rasûlüllah: \"Haydin onun kabrini bana gösteriniz\" buyurdu. Akabinde onun kabrine vardı ve üzerine namaz kıldı",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 1338,
			"arabicnumber": 1338,
			"text": "Bize Saîd ibn Ebî Arûbe, Katâde'den; o da Enes (radıyallahü anh)'ten tahdîs etti. Peygamber (sallallahü aleyhi ve sellem) şöyle buyurmuştur: kabrine konulduğu ve sahihleri geri dönüp gittikleri zaman -ki ölü bunlar yürürken ayakkabılarının sesini muhakkak işitir- ona iki melek gelir. Bunlar ölüyü oturturlar ve ona: Şu Muhammed denilen kimse hakkında ne dersin? Diye sorarlar. mü'min kul: O'nun Allah'ın kulu ve Rasûlüllah olduğuna şehâdet ederim, der. Bunun üzerine melekler tarafından: Ey mü'min, cehennemdeki yerine bak. Allah bu azâb yerini senin için cennetten bir makaama tebdil eyledi, denilir''. (sallallahü aleyhi ve sellem): \"O mü'min, cehennem ve cennetteki makaamını birden görür\" buyurmuştur. kâfir veyâhud münafık olan ölü (meleklerin suâline): Muhammed hakkında bir şey bilmiyorum. İnsanların O'na diyegeldikleri bir sözü (işitir), ben de onlara uyup söylerdim, diye cevâp verir. iki melek tarafından o kâfir veya munâfıka: Hay sen anlamaz ve uymaz olaydın! Denilir. bu kâfir veya munâfıkın iki kulağı arasına demirden bir topuzla vurulur. O topuzu yiyince kâfir veya münafık şiddetli bir feryâd ile bağırır ki, bu feryadı ins ve cinnden başka, bu ölüye yakın olan her şey işitir",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 1339,
			"arabicnumber": 1339,
			"text": "Ebû Hureyre(radıyallahü anh) şöyle demiştir: Ölüm meleği Mûsâ Peygamber'e gönderildi. Melek Musa'ya gelince, Mûsâ, meleğe bir tokat vurdu. Melek Rabb'ına döndü ve: Sen beni ölmek istemeyen bir kula gönderdin, dedi. meleğe gözünü (yahut eski kudret ve metanetini) iade etti ve tekrar Musa'ya dön de ona: Elini bir öküzün sırtına koymasını ve elinin örttüğü her bir kıla mukaabil bir yıl ömür verileceğini söyle, dedi. bu ilâhî bahşişi duyunca: Yâ Rabbî! Bundan sonra ne olacak(ölecek miyim, yoksa daha yaşayacak mıyım)? Diye sordu. Sonra öleceksin, buyurdu. Mûsâ: Öyleyse ölüm şimdi gelsin, dedi de Allah'tan bir taş atımı mesafeye kadar kendisini Mukaddes Arz'a yaklaştırmasını(orada ölüp orada gömülmesini) diledi. Hureyre şöyle dedi: Rasûlüllah(sallallahü aleyhi ve sellem): \"Eğer ben Musa'nın gömüldüğü yerde sizinle beraber bulunsaydım, onun yol kenarında olan ve kızıl bir kum tepesinin yanında bulunan kabrini muhakkak sizlere gösterirdim\" buyurdu",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 1340,
			"arabicnumber": 1340,
			"text": "İbn Abbâs radıyallahü anhüma şöyle demiştir:Peygamber (sallallahü aleyhi ve sellem) geceleyin gömülmesinin ardından bir kimsenin mezarı üzerine cenaze namâzı kıldı. Bu namazda kendisi ve sahâbîleri ayakta durdular. Peygamber o kimse hakkında suâl sorup \"Bu kimdir?\" demişti de, oradakiler: Dünkü günün gecesinde gömülmüş olan Fulân kimsedir diye cevâp vermişlerdi. Bu cevâp akabinde hepsi birden o kabir üzerine cenaze namazı kıldılar",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 1341,
			"arabicnumber": 1341,
			"text": "Âişe(r.anha) şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem) hasta olduğu zaman kadınlarından bâzısı Habeşistan'da gördükleri bir kiliseyi konuştular. Ona Mâriye(yani Meryem Ana) Kilisesi deniyormuş.(Sonradan Peygamber'in kadınlarından olan) Ümmü Seleme ile Ümmü Habîbe (radıyallahü anh) Habeşistan arazîsine gitmişlerdi. Bu iki kadın o kilisenin güzelliğini ve içindeki suret ve timsâlleri zikrettiler. Bunun üzerine Peygamber başını yukarı kaldırdı da: \"Onlar kendilerinden iyi bir kimse çıkıp da vefat ettiği zaman, onun kabri üzerine bir mescit bina ederler, sonra o binaya bu suretleri (yani resimleri)yaparlar. İşte onlar Allah katında mahlûkatın en şerlileridirler\" buyurdu",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 1342,
			"arabicnumber": 1342,
			"text": "Bize Fulayh ibnu Süleyman tahdîs edip şöyle dedi: Bize Hilâl ibnu Alî tahdîs etti. Enes(radıyallahü anh) şöyle demiştir: Biz Rasûlüllah'in kızının cenazesinde hâzır bulunup, şuna şâhid olduk: Rasûlüllah kabrin bir tarafına oturmuş hâldeydi. İki gözünün yaş dökmekte olduğunu gördüm.Rasûlüllah: \"İçinizde bu gece günâh işlememiş bir kimse var mı?\" diye sordu. EbûTalha: Ben varım, dedi. Rasûlüllah: \"Bu kızın kabri içine in\" buyurdu. Râvî Enes dedi ki: Bu emir üzerine Ebû Talha, Rasûlüllah'ın tazmin kabrine indi ve o kızı lahdine yerleştirip gömdü. Ebû Abdillah el-Buhârî- “Li-yakterifû”( Kazanmaları için)(el-En’am 113) ma'nasınadır. Dedi",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 1343,
			"arabicnumber": 1343,
			"text": "Câbir ibn Abdillah (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) Uhud şehîdlerinden ikişer kişiyi bir örtü (yani bir kabir) içinde birleştiriyordu. Sonra: \"Bunların hangisi Kur'ân'ı daha çok öğrenmiştir?\" diye soruyordu. Bu çift şehîdlerden biri kendisine işaret edilince, onu kabirdeki lahdin içine önce koyuyordu. Ve sonra: \"Ben bu mucâhidler üzerine (yani hayâtlarını Allah yolunda feda ettiklerine) kıyâmet günü bir şahidim\" buyurdu ve bu şehîtlerin kendi kanları içinde, yıkanmadıkları ve üzerlerine namaz da kılınmadığı hâlde gömülmelerini emretti",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 1344,
			"arabicnumber": 1344,
			"text": "Ukbe ibn Âmir (radıyallahü anh)'den(o, şöyle demiştir): Peygamber (sallallahü aleyhi ve sellem) bir gün çıkıp Uhud şehîdlerine cenaze üzerine kıldığı namazı gibi namaz kıldı. Sonra Medîne'ye dönüp minbere çıktı da:\"Ben sizin için havuza ilk erişeniniz olacağım. Sizin hakk yolundaki hizmetlerinize şehâdet ediciyim. Allah'a yemin ederim ki, ben şu anda (cennetteki) havuzumu muhakkak görmekteyim. Ve emîn olunuz ki, bana arz'ın hazînelerinin anahtarları -yâhut arz'ın anahtarları- verilmiştir. Vallahi ben, benden sonra sizin müşrikliğe döneceğinizden hiç korkmam. Lâkin ben sizin ihtiras ile dünyâ hazîneleri hususunda birbirinizle nefsâniyet yarışına düşüp didişmenizden korkarım\" buyurdu",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 1345,
			"arabicnumber": 1345,
			"text": "Câbir ibn Abdillah(radıyallahü anh) şöyle haber vermiştir: Peygamber (sallallahü aleyhi ve sellem) Uhud harbi şehîdlerinden iki kişiyi bir kabirde birleştiriyordu",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 1346,
			"arabicnumber": 1346,
			"text": "Câbir(radıyallahü anh) şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem): \"Onları, yani Uhut şehîdlerini kendi kanları içinde gömünüz\" buyurdu. Halbuki Peygamber onları yıkatmamıştı da",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 1348,
			"arabicnumber": 1348,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 1349,
			"arabicnumber": 1349,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 1350,
			"arabicnumber": 1350,
			"text": "Bize Sufyân (ibn Uyeyne) tahdîs etti. Amr ibn Dînâr şöyle dedi: Ben Câbir ibn Abdillah(radıyallahü anh)'tan işittim, şöyle dedi: Rasûlüllah (sallallahü aleyhi ve sellem), Abdullah ibn Ubeyy ibn Selûl kendi çukuru içine konulduktan sonra onun çukuruna geldi; onun dışarıya çıkarılmasını emretti. O da dışarıya çıkarıldı. Rasûlüllah onun cesedini kendi iki dizi üzerine koydu da, onun cildi üzerine tükürüğünden üfledi ve ona kendi gömleğini giydirdi. Rasûlüllah'ın kendi gömleğini ona giydirmesinin sebebini Allah en bilendir. Abdullah ibn Ubeyy ibn Selûl, Peygamber'in amucası Abbâs'a bir gömlek giydirmiş idi. Sufyân ibn Uyeyne şöyle dedi: Ebû Hureyre şöyle demiştir : Rasûlüllah'ın üzerinde iki gömlek vardı. Abdullah ibn Ubeyy'in oğlu Abdullah, Rasûlüllah'a: Yâ Rasûlallah, senin cildine dokunan gömleğini bâbama giydir, dedi. ibn Uyeyne şöyle dedi: Peygamber'in kendi gömleğini Abdullah ibn Ubeyy'e giydirmesini, vaktiyle onun Abbâs'a gömlek giydirmiş olmasına bir karşılamadır zannederlerdi",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 1351,
			"arabicnumber": 1351,
			"text": "Câbir ibn Abdillah (radıyallahü anh) şöyle demiştir: Uhud harbi vakti geldiğinde Bâbam Abdullah beni geceleyin çağırdı ve: \"Ben Peygamber'in sahâbîlerinden ilk şehîd edilecekler içinde şehîd olacağımı kuvvetle zannediyorum. Ve ben kendimden sonraya Rasûlüllah'ın zâtı müstesna senden daha kıymetli bir kimseyi geride bırakmıyorum. Benim üzerimde bir borç vardır. Binâenaleyh onu öde. Kızkardeşlerine hayr vasiyet etmeyi iste dur\" dedi. Sabaha girdik. Bâbam ilk şehîdlerden oldu. Ve bir tek kabir içinde diğer bir şehîdle beraber gömüldü. Sonra gönlüm, onu başka bir kimsenin beraberinde terk etmekten hoşlanmadı. Altı ay geçtikten sonra onu mezarından çıkardım. Bir de gördüm ki o, kulağı müstesna, yenice gömülmüşcesine, mezarına koyduğum gündeki gibi duruyor",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 1352,
			"arabicnumber": 1352,
			"text": "Câbir (radıyallahü anh) şöyle demiştir: Bâbam Ahdullah ibn Amr'ın beraberinde bir adam gömülmüştü. Benim gönlüm buna razı olmadı, nihayet Bâbamı mezardan çıkardım ve onu tek başına bir kabir içine koydum",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 1353,
			"arabicnumber": 1353,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 1355,
			"arabicnumber": 1355,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 1356,
			"arabicnumber": 1356,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 1357,
			"arabicnumber": 1357,
			"text": "Ubeydullah el-Leysî şöyle dedi: Ben ibn Abbâs'tan işittim; o: Ben ve annem Lubâbe, mustad'atînden (yani Medine'ye hicret edemeyip Mekke'de kalan ve orada zaîf bırakılmak istenen müslümânlardan) idik. Ben çocuklar sınıfındaki mustad'aflardan idim, annem ise kadınlar sınıfından olan mustad'aflardan idi",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 1358,
			"arabicnumber": 1358,
			"text": "İbn Şihâb ez-Zuhrî şöyle demiştir: Her ölen çocuğa, zina eden bir kadına âid olsa bile, cenaze namazı kılınır. Çünkü o çocuk İslâm fıtratı üzere yaratılmış olup, o fıtrat üzere doğurulmuştur. Onun anasıyle Bâbası yahut anası gayrı müslim olsa bile, bilhassa Bâbası müslümân olduklarını iddia ederlerse o çocuk doğum sırasında ağlayarak doğmuş ise, ona namaz kılınır. Böyle hayât emaresi izhâr etmeyerek, yani ağlamayarak doğan çocuğa, eksik ve hamil müddeti tamam olmadan düşük bir cenîn olarak doğduğu için namaz kılınmaz. Çünkü Ebû Hureyre (radıyallahü anh) şu hadîsi tahdîs edip durmuştur: aleyhi ve sellem) şöyle buyurdu: \"Her doğan çocuk muhakkak fıtrat üzere doğar. Sonra anasıyle Bâbası onu Yahûdî yahut Nasrânî yahut Mecûsî yaparlar. Nasıl ki, kusursuz doğurulan her hayvan yavrusu, organları tam olarak doğar. Siz hiç o yavrunun burnunda, kulağında eksik, kesik birşey hisseder misiniz?\" sonra Ebû Hureyre: “O hâlde sen yüzünü bir muvahhid olarak dîne, Allah'ın o fıtratına çevir ki, O, insanları bunun üzerine yaratmıştır. Allah’ın yaratışına hiçbir şey bedel olamaz. Bu, dimdik ayakta duran bir dîndir. Fakat insanların çoğu bilmezler”(er-Rûm: 30) âyetini söyler idi.. Şihâb ez-Zuhrî şöyle demiştir: Bana Ebû Seleme ibnu Abdirrahmân haber verdi ki, Ebû Hureyre (radıyallahü anh) şöyle demiştir: Rasûluilah (sallallahü aleyhi ve sellem) şöyle buyurdu: çocuk ancak fıtrat üzere dünyâya getirilir. Bundan sonra anası Bâbası (Yâhûdî ise) onu Yahûdîyaparlar, (Nasrânî ise) onu Nasrânî yaparlar,(Mecûsî ise) onu Mecûsî yaparlar. Nitekim kusursuz doğan bir hayvan yavrusu içinde siz kulağı, dudağı, burnu, ayağı kesik olanını hiç görüyor musunuz?\" sonra Ebû Hureyre (radıyallahü anh) şu âyeti söylerdi: \"O hâlde sen yüzünü bir muvahhid olarak dîne, Allah'ın o fıtratına çevir ki, O, insanları bunun üzerine yaratmıştır. Allah 'ın yaratışına (hiçbir şey) bedel olamaz. Bu, dimdik ayakta duran bir dîndir. Fakat insanların çoğu bilmezler\" (er-Rûm: 30)",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 1359,
			"arabicnumber": 1359,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 1360,
			"arabicnumber": 1360,
			"text": "İbn Şihâb şöyle demiştir: Bana Saîd ibnu'l-Müseyyeb, kendi Bâbası Müseyyeb ibn Hazn'dan haber verdi. Müseyyeb ibn Hazn (radıyallahü anh) ona şöyle haber vermiştir: Ebû Tâlib'e ölüm alâmetleri geldiği sırada ona Rasûlüllah (sallallahü aleyhi ve sellem) geldi ve amucasmın yanında Ebû Cehl ibn Hişâm ile Abdullah ibn Ebî Umeyye'yi buldu. Rasûluilah, Ebû Tâlib'e hitaben: \"Yâ amuca! Lâ ilahe ille’llah kelimesini söyle de, bununla Allah katında sana şehâdet edeyim\" dedi. Cehl ve Abdullah ibn Ebî Umeyye: Yâ Ebâ Tâlib! Abdulmuttalib milletinden yüz mü çevireceksin? Diye men' ettiler. Rasûlüllah bu tevhîd kelimesini amucasına arz etmeye devam ediyordu. O iki kişi de mütemâdiyyen o sözlerini tekrar ediyorlardı. Nihayet Ebû Tâlib bunlara söylediği son söz olarak: O(yani ben), Abdulmuttalib milleti üzeredir, dedi ve Lâ ilahe ille’llah demekten çekindi. aleyhi ve sellem): \"İyi bil ki (ey amucam)!Allah'a yemin olsun, ben sana mağfiret dilemekten nehyolunmadığım müddetçe, senin için muhakkak Allah'tan mağfiret isteyeceğim\" dedi. Allah bu hususta şu âyeti indirdi: o çılgın ateşin yârânı oldukları muhakkak meydana çıktıktan sonra, artık onların lehine, velev hısım olsunlar, ne Peygamber ne de mü’min olanların istiğfar etmeleri doğru değildir\"(et-Tevbe: 113)",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 1361,
			"arabicnumber": 1361,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 1362,
			"arabicnumber": 1362,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 1364,
			"arabicnumber": 1364,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 1365,
			"arabicnumber": 1365,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 1366,
			"arabicnumber": 1366,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 1367,
			"arabicnumber": 1367,
			"text": "Enes (radıyallahü anh) şöyle demiştir: Peygamber'in önünden bir cenaze geçirildi. Sahâbîler bu cenazeyi hayırla övdüler. Peygamber de: \"Vâcib oldu\" buyurdu. Sonra başka bir cenaze daha geçirildi. Sahâbîler onun üzerine de şerr ile konuştular yahut râvî: Bunun gayrisini söyledi, demiştir. Peygamber yine: \"Vâcib oldu\" buyurdu. Kendisine: Yâ Rasûlallah! Şu cenaze için \"Vâcib oldu\" dedin; şu Cenâze için de yine \"Vâcib oldu\" dedin? Denildi. Rasûlüllah(sallallahü aleyhi ve sellem): \"Mü'mirilerden meydana gelen kavmin şehâdeti kabul edilmiştir. Mü'minler Allah'ın yeryüzündeki şâhidleridir\" buyurdu",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 1368,
			"arabicnumber": 1368,
			"text": "Ebu'l-Esved ed-Duelî (69) şöyle demiştir: Bir kerre Basra'dan Medine'ye gelmiştim. O sırada Medine'de bir hastalık vâki' olmuştu. Ben Omer ibnu'l-Hattâb'ın yanına oturdum. Bizim topluluğun yanından bir cenaze geçti. Bu cenazenin sahibi oradakiler tarafından hayırla anılıp övüldü. Bunun üzerine Omer: Vâcib oldu, dedi. Sonra diğer bir cenaze daha geçirildi. Yine orada bulunanlar tarafından bu cenazenin sahibi de hayırla anılıp övüldü. Omer yine: Vâcib oldu, dedi. Daha sonra üçüncü bir cenaze geçirildi. Bu sefer orada bulunanlar tarafından bu cenaze şerr ile anılıp kötülüğü söylendi. bu sefer de: Vâcib oldu, dedi. Ebu'l-Esved dedi ki: Ben: Ey Mü'minler'in Emîri! Ne vâcib oldu? Dedim. Omer: Ben, Peygamber'in söylediği gibi söyledim; Peygamber (sallallahü aleyhi ve sellem): \"Herhangi bir müslümân hakkında dört (mü'min) kişi hayr ile şehâdet ederse, Allah o müsiümân kişiyi cennete girdirir\" buyurdu. Biz: Üç kişi şehâdet ederse de böyle mi? diye sorduk. Peygamber: \"Üç kişi şehâdet ederse de böyledir\" buyurdu. Sonra: İki kişi şehâdet ederse de böyle midir? Dedik. Peygamber: \"İki kişi şehâdet ederse de böyledir\" buyurdu. Bundan sonra biz Peygamber'e bir şâhidden sormadık",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 1369,
			"arabicnumber": 1369,
			"text": "el-Berâu'bnu Âzib (radıyallahü anh)'den tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem) şöyle buyurmuştur: \"Mü 'mine gelinip de mü'min kabri içinde oturtulduğu zaman, (suâllerden)sonra mü'min: Eşhedu en lâ ilahe illellah ve eşhedu enne Muhammeden Rasûlüllah (= Şehâdet ederim ki, Allah'tan başka hiçbir tanrı yoktur. Yine şehâdet ederim ki, Muhammed muhakkak Allah'ın Rasûlü'dür) diye şehâdet eder. İşte bu şehâdet, Allah'ın şu kavlidir:Allah îmân edenlere dünyâ hayâtında da, âhirette de o sabit sözde dâima sebat ihsan eder (Allah zâlimleri şaşırtır; Allah ne dilerse yapar)\"(İbrâhîm:27). Şu'be bu geçen hadîsi tahdîs etti ve bunda şu ziyâde oldu: \"Allah îmân edenleri o sabit sözde dâima sabit kılar.., \"(İbrâhîm: 27) âyeti, kabir azâbı hakkında indi",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 1370,
			"arabicnumber": 1370,
			"text": "Salih ibn Keysân şöyle demiştir: Bana Nâfi' tahdîs etti. Ona da İbn Omer haber verip şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem) Kalîb Çukuru'nda cesedler üzerine vardı da onlara: \"Rabb'inizin sizlere va'd ettiği şeyi hakk buldunuz mu?\" diye seslendi. Bir takım ölü cesedlere mi hitâb ediyorsun? denildi. Bunun üzerine Peygamber: \"Sizler bunlardan daha fazla işitir değilsiniz. Fakat bunlar cevâb veremezler\" buyurdu",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 1371,
			"arabicnumber": 1371,
			"text": "Âişe (r.anha) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) ancak:\"Bu ölüler, kendilerine söylemekte bulunduğum sözümün hakk ve doğru olduğunu şimdi muhakkak biliyorlar\" buyurmuştur. Nitekim Yüce Allah da: \"Zîrâ şübhesiz sen ölülere duyuramazsın. (Arkalarını dönmüş kaçarlarken sağırlara da da'veti işittiremezsin)\"(en-Neml: 80) buyurdu",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 1372,
			"arabicnumber": 1372,
			"text": "Âişe (r.anha)'den: Âişe'nin yanına bir Yahûdî kadını girip, kabir azabını zikretmiş; akabinde de Âişe'ye hitaben: Allah seni kabir azabından korusun, diye duâ etmiş. Bunun üzerine Âişe, Rasûlüllah'a kabir azabını sormuş. Rasûlüllah (sallallahü aleyhi ve sellem) da: \"Evet, kabir azâbı (hakktır, vardır)\" buyurmuştur. Âişe: Ben bundan sonra Rasûlüllah'ın hiçbir namaz kılıp da kabir azabından Allah'a sığınmayı terkettiğini görmedim, demiştir. Râvî Gunder: Kabir azâbı (hakktır), cümlesini ziyâde etmiştir",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 1373,
			"arabicnumber": 1373,
			"text": "İbn Şihâb şöyle demiştir: Bana Urve ibnu'z-Zubeyr haber verdi ki, o Ebû Bekr'in kızı Esmâ'dan işitmiştir. Esma (radıyallahü anh) şöyle diyordu: Rasûlüllah(sallallahü aleyhi ve sellem) bir kerre hutbe yapmaya kalktı ve kişinin kabirde tâbi' tutulacağı imtihan fitnesini zikretti.Rasûlüllah kabir hâllerini böyle tafsîlâtıyle anlatınca müslümânlar dehşetli bir surette feryâdla ağlaştılar. Râvî Gunder: Kabir azâbı (hakktır), cümlesini ziyâde etmiştir",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 1374,
			"arabicnumber": 1374,
			"text": "Bize Saîd ibn Ebî Arûbe, Katâde'den; o da Enes'ten tahdîs etti. Enes ibn Mâlik (radıyallahü anh) onlara şöyle tahdîs etmiştir: Rasûlüllah(sallallahü aleyhi ve sellem) şöyle buyurdu: kabri içine konulduğu ve arkadaşları ile cemâati geriye dönüp gittikleri zaman -ki ölü bunların yürürken ayakkabılarının çıkardıkları seslerini bile muhakkak işitir- ona iki melek gelir. Bunlar ölüyü oturturlar ve ona: Şu Muhammed adlı kimse hakkında ne der idin? diye sorarlar. soruya muhâtab olan mü'min kul: O'nun Allah'ın kulu ve Rasûlü olduğuna şehâdet ederim, der. Bunun üzerine melekler tarafından: Cehennemdeki oturacak yerine bak. Allah bu azâb yerini senin için cennetten bir oturacak makaama tebdil etti, denilir de o mü'min kul, cehennem ve cennetteki o iki makaamını beraberce görür\". \"O mü'mine, kabri içinde bir genişlik verileceği bize zikrolundu\" dedi ve sonra yine Enes hadîsine döndü. Rasûlüllah şöyle buyurdu: ve kâfir olan kula gelince, ona da: Şu kimse hakkında ne der idin? diye sorulur. O da: Ben O 'nun hakkında birşey bilmiyorum. Ben sâdece insanların O'nun hakkında söyleyegeldikleri sözü söylerdim, diye cevâb verir. üzerine ona: Anlamadın ve uymadın(yahut: Sen hem anlamadın, hem de Kur'ân'ı tilâvet etmedin; yahut da: Anlamaz ve uymaz olaydın)denir ve ona demirden tokmaklarla öyle bir vuruş vurulur ki, derhâl şiddetli bir sayha ile bağırır. Bu bağırışı insan ve cinnlerden ibaret olan iki ağırlıktan başka bu ölüye yakın olan her şey işitir",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 1375,
			"arabicnumber": 1375,
			"text": "Bize Şu'be tahdîs edip şöyle dedi: Bana Avn ibnu Ebî Cuhayfe, Bâbası Ebû Cuhayfe'den; o da el-Berâ ibnu Âzib'den tahdîs etti ki, Ebû Eyyûb(radıyallahü anh) şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem), güneş batmış olduğu hâlde Medine'den dışarıya çıkmıştı. Bir ses işitti de: \"Yahudi kabilesi, kendi kabirleri içinde azâb olunuyor\" buyurdu. ibnu Şumeyl şöyle dedi: Bize Şu'be haber verip şöyle dedi: Bize Avn tahdîs edip şöyle dedi. Ben el-Berâ'dan işittim; o da Ebû Eyyûb (radıyallahü anh)'dan; o da Peygamber(sallallahü aleyhi ve sellem)'den",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 1376,
			"arabicnumber": 1376,
			"text": "Mûsâ ibn Ukbe şöyle demiştir: Bana Hâlid ibn Saîd ibni'l-Âsî'nin kızı Eme tahdîs etti. O da Peygamber(sallallahü aleyhi ve sellem)'den, kabir azabından Allah'a sığınırken işitmiştir",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 1377,
			"arabicnumber": 1377,
			"text": "Ebû Hureyre (radıyallahü anh) şöyle demiştir:Rasûlüllah (sallallahü aleyhi ve sellem) şöyle duâ ederdi: \"Allâhumme innî eûzu bike min azâbi-l kabri ve min azâbin-nâri ve min fitneti’l mahyâ ve'l-memâti ve min fitneti’l- Mesîhi’d-Deccâli (= Yâ Allah! Ben, kabir azabından, ateş azabınızdan, hayât ve ölüm imtihan ve şiddetlerinden ve Deccâl Mesîh fitnesinden sana sığınırım)",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 1378,
			"arabicnumber": 1378,
			"text": "İbn Abbâsradıyallahü anhüma şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem) iki kabrin üzerine uğradı da: \"Bu iki kabir muhakkak azâb olunuyorlar. Halbuki büyük bir şeyden dolayı azâb olunmuyorlar\" buyurdu. Sonra da: \"Evet, biri koğuculuk ederdi, diğeri de idrarından sakınmazdı\" buyurdu. Râvî dedi ki: Bundan sonra Rasûlüllah yaş bir deynek aldi, deyneği iki parçaya böldü. Sonra o parçalardan her birini bir kabir üzerine dikti. Sonra da: \"Bunlar kurumayıp taze kaldıkları müddetçe belki bu kabir sahiplerinden azâb hafifletilir\" buyurdu",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 1379,
			"arabicnumber": 1379,
			"text": "Bana Mâlik, Nâfi'den; o da Abdullah ibn Omer (radıyallahü anh) 'den tahdîs etti ki, Rasûlüllah(sallallahü aleyhi ve sellem) şöyle buyurmuştur: \"Sizden biriniz öldüğü zaman, ona varıp oturacağı yeri sabah akşam gösterilir. O kimse cennet ehlinden ise cennetten; cehennem ehlinden ise cehennemden olan yeri gösterilir. Ve ona: işte senin oturacağın yer burasıdır, nihayet kıyâmet günü Allah seni buraya gönderecek, denilir",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 1380,
			"arabicnumber": 1380,
			"text": "Ebû Saîd el-Hudrî'den şöyle derken işitmiştir: Rasûlüllah(sallallahü aleyhi ve sellem) şöyle buyurdu: \"Cenaze tâbuta konulup da erkekler onu omuzlan üzerine yüklendikleri zaman, o cenaze iyi bir kişi ise: Beni (sevabıma) ulaştırınız, ulaştırınız der. Şayet iyi bir kimse değilse: Yazıklar olsun! Bu cenazeyi nereye götürüyorlar? diye seslenir. Cenazenin bu sesini (gafil) insandan başka herşey (her varlık) işitir. Eğer insan bunu işitseydi, muhakkak düşer bayılırdı",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 1381,
			"arabicnumber": 1381,
			"text": "Enes ibn Mâlik(radıyallahü anh) şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: \"Günâh işleme çağına ermemiş üç çocuğu ölen hiçbir müslümân (ana Bâba)müstesna olmamak üzere, Allah muhakkak onu, bu çocuklara ihsan eylediği geniş rahmeti ile cennete girdirir",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 1382,
			"arabicnumber": 1382,
			"text": "Sabit, el-Berâ(radıyallahü anh)'dan şöyle dediğini işitmiştir: Rasûlüllah(sallallahü aleyhi ve sellem), çocuğu İbrâhîm vefat ettiği zaman: “ İbrâhîm için cennette muhakkak bir süt annesi vardır\" buyurdu",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 1383,
			"arabicnumber": 1383,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 1384,
			"arabicnumber": 1384,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 1385,
			"arabicnumber": 1385,
			"text": "Ebû Hureyre(radıyallahü anh) şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem) şöyle buyurdu: \"Her doğurulan çocuk, fıtrat üzere doğurulur. Sonra anası ile Bâbası onu Yahudi yaparlar, yahut Nasrânî yaparlar, yahut Mecusi yaparlar. Hayvan yavrusunun eksiksiz tam bir hayvan yavrusu sıfatında doğurulması gibi. Sen o hayvan yavrusu içinde kulağı, dudağı, burnu, ayağı kesik olanını hiç görür müsün?",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 1386,
			"arabicnumber": 1386,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 1387,
			"arabicnumber": 1387,
			"text": "Âişe (r.anha) şöyle demiştir: Ben Ebû Bekr'in yanına girdim. O: Peygamber'i kaç parça bez ile kefenlediniz? diye sordu. de: Gömlek ile başlık olmaksızın, üç parça beyaz Yemen'in Suhûl beldesinde dokunmuş pamuk bezi içinde, diye cevâb verdi. Ebû Bekr, Âişe'ye: Rasûlüllah hangi gün içinde vefat etmişti? diye sordu. de: Pazartesi gününde, diye cevâb verdi. Ebû Bekr: Bu gün, hangi gündür? diye sordu. Âişe: Bu gün pazartesi günüdür, dedi. Ebû Bekr: Benim vefatımın da şu saatimle bu gece arasında vâki' olmasını ümîd ediyorum, dedi. Ebû Bekr, içinde hasta bulunduğu elbisesine baktı da, onda da bir zağferan lekesi olduğunu gördü ve: Benim üstümdeki bu elbisemi yıkayınız ve buna iki parça bez daha ilâve ediniz de beni bunların içine sarınız, dedi. muhakkak ki bu elbise eskimiştir, dedim. Ebû Bekr: Şübhesiz diri, bunun yenisine ölüden daha lâyıktır. Çünkü yeni bez ancak hayâtında bir müddet bakaa gören kimse içindir, dedi. Bekr, salı gecesi akşamına kadar vefat etmedi. Ve sabaha girmeden önce, geceleyin gömüldü",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 1388,
			"arabicnumber": 1388,
			"text": "Âişe (r.anha)'den (o, şöyle demiştir): Bir kimse Peygamber'e geldi de: Annemin canı ansızın çıktı gitti. Öyle zannediyorum ki, annem söylenebilseydi tasadduk (edilmesini vasıyyet) ederdi. Şimdi ben onun adına sadaka versem, annem için bir sevâb olur mu? diye sordu. Peygamber(sallallahü aleyhi ve sellem): \"Evet (olur)\" buyurdu",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 1389,
			"arabicnumber": 1389,
			"text": "Âişe(r.anha) şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) ölüm hastalığında iken, Âişe gününün geç kaldığından şikâyet ederek: “Ben bugün kimin nevbetindeyim? Yarın kimin nevbetinde olacağım?” der(ve benim günümü özlediğinden dolayı) diğer kadınlarına özür beyân eylerdi. Benim nevbetimde olduğu zaman Allah Peygamber'in ruhunu benim göğsüm ile gerdanım arasında kabzedip aldı. Ve bedeni de benim odamın içine gömüldü",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 1390,
			"arabicnumber": 1390,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 1391,
			"arabicnumber": 1391,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 1392,
			"arabicnumber": 1392,
			"text": "(Amr ibnu Meymûn el-Evdî şöyle demiştir: Omer ibnu'l-Hattâb'ı gördüm. O, Ebû Lu'lü' tarafından hançerle vurulduğu zaman oğlu Abdullah ibn Omer'e: Mü'minlerin Anası Âişe'ye git de ona: Omer ibnu'l-Hattâb sana selâm ediyor, de. Sonra iki arkadaşımın beraberinde gömülmekliğime ondan müsâade iste, dedi. Burayı ben kendim için ayırmıştım. Fakat bu gün elbette Omer'i nefsime tercîh ederim, dedi. dönüp geldiği zaman Omer ona: Yanında ne haber var? diye sordu. Abdullah da: Ey Mü'minlerin Emîri! Âişe, arkadaşlarının yanına gömülmen için sana izin verdi, dedi. üzerine Omer: Bugün benim için o yere gömülmemden başka, bana ehemmiyetli olan hiçbir iş ve arzu yoktur. Benim ruhum alındığı zaman, cenazemi taşıyınız. Sonra Âişe'ye teslîm ediniz. Sonra: Omer ibnu'l-Hattâb sizden müsâade diler, deyin. Eğer benim orada gömülmeme müsâade ederse, beni orada gömünüz. Eğer müsâade etmezse, beni müslümânlarm kabirlerine götürüp orada gömünüz, diye vasıyyet etti. sırada Omer'in yanına bâzı kimseler gelmiş ve: Ey Mü'minlerin Emîri! Yerine bir halîfe tavsiye etsen! demişlerdi. Omer bunlara hitaben:) Ben bu halîfelik makaamına, Rasûlüllah'ın kendilerinden razı olarak vefat ettiği şu kimselerden daha lâyık hiçbir kimse bilmiyorum. Bunlar aralarında kimi halîfe seçip kabul ederlerse, benden sonra halîfe odur. Artık onun emirlerini dinleyiniz, dedi. Rasûlüllah'ın kendilerinden razı olduğu kimseler olarak şu isimleri sıraladı: Usmân, Alî, Talha, Zubeyr, Abdurrahmân ibnu Avf, Sa'd ibnu Avf, Sa'd ibnu Ebî Vakkaas. sırada Ensâr'dan genç bir kimse Omer'in yanına girdi ve: Ey Mü'minlerin Emîri! Allah'ın senin hakkındaki lutûf ve inayeti ile sevin. İslâm Dîni'ne girmekteki kıdeminden dolayı bilmekte olduğum bu kadar yüksek hizmetlerin vardır. Sonra halîfe seçildin ve adalet ettin. Sonra bütün beşerî faziletlerin ardından şehîdlik (rütbesini kazandın), diye teselli etti. üzerine Omer: Ey kardeşim oğlu! Bugün ben ondan, o da benden uzaklaşan bu halîfelik yok mu? Keşki bunun bana ne ikaabı, ne de sevabı dokunsaydı. Benden sonraki halîfeyi seçmek için ilk muhacirleri tavsiye ederim. Bu ilk muhacirlerin hakklarının tanınması, kendilerine yapılan hürmetin muhafaza edilmesi çok hayır ve büyük isabet olur. Sizlere Ensâr'a da hayırlı olmanızı tavsiye ederim. O Ensâr ki, hicretten evvel Medîne'de ikaamet etmişler, îmâna yardım ve yurd hazırlamışlardır. İşte bütün bunların iyilerinin iyilikleri kabul edilmeli, kötülerinin kötülükleri ve kusurları afvedilmeli. Size Allah'ın ve Rasûlü'nün ahd ve emânında olan bütün müslümânlarm (ve Kitâb ehli olanların) hakklarına hürmetkar olmanızı da tavsiye ederim. Bütün bunların haklan verilmeli, işleri görülmelidir. Mukaatele zarurî olursa, bunların arkalarından mukaatele edilmelidir. Ve insanlara, takatlerinin üstünde teklifler yüklememelidir",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 1393,
			"arabicnumber": 1393,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 1394,
			"arabicnumber": 1394,
			"text": "",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 148
			}
		}
	]
}