{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"25": "Hajj (Pilgrimage)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1513,
			"arabicnumber": 1513,
			"text": "Abdullah ibn Abbâs (radıyallahü anh) şöyle demiştir: el-Fadl ibnu Abbâs, Rasûlullah'ın redîfi (yani hayvan üstünde Peygamber'in arka ta­rafına binmiş kimse) idi. Has'am kabilesinden genç bir kadın Rasûlullah'a geldi. Bu sırada Fadl kadına, kadın da Fadl'a bakmaya başladı. Peygamber de Fadl'ın yüzünü(eliyle kadından) başka tara­fa çevirmeye koyuldu. Yâ Rasûlallah! Allah'ın kulları üzerinde hacc hususundaki farizası Bâbama çok yaşlı ihtiyarlığında erişti. O deve üzerinde sabit duramaz hâldedir. Binâenaleyh kendisine (vekâleten) ben hacc ede­bilir miyim? diye sordu. \"Evet, vekâleten hacc edebilirsin!\" diye cevâb verdi. Bu suâl ve cevâb, Veda Haccı sırasında vâki' oldu",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1514,
			"arabicnumber": 1514,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1515,
			"arabicnumber": 1515,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1516,
			"arabicnumber": 1516,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1517,
			"arabicnumber": 1517,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1518,
			"arabicnumber": 1518,
			"text": "Bize Eymen ibnu Nâbil tahdîs edip şöyle dedi: Bize.el- Kaasım ibnu Muhammed, Âişe (radıyallahü anha)'den tahdîs etti ki, Âişe: Yâ Rasûlallah, sizler umre yaptınız; Halbuki ben umre yapmadım, dedi. Bunun üzerine Rasûlullah: \"Yâ Abderrahmân, kızkardeşin Âişe'yi götür de ona Ten'im'den bir umre yaptır\" buyurdu. bu emir akabinde Âişe'yi dişi devesi üzerinde ar­ka tarafına bindirip taşıdı ve bu suretle Âişe umre yaptı",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1519,
			"arabicnumber": 1519,
			"text": "Ebû Hureyre (radıyallahü anh) şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem)'e amellerin hangisi en faziletlidir? diye soruldu. Peygamber: \"Allah'a ve Rasûlüne îmân etmektir\" buyurdu. Ondan sonra hangisidir? denildi. \"Allah yolunda cihâd etmektir\" buyurdu. Ondan sonra hangisidir? denildi. \"Mebrûr (yani makbul olmuş, içine günâh ve riya karışmamış) haccdır\"buyurdu",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1520,
			"arabicnumber": 1520,
			"text": "Bize Habîb ibnu Ebî Amre, Talha kızı Âişe'den; o da Mü'minlerin Annesi olan Âişe'den haber verdi. Âişe: Yâ Rasûlallah! Biz cihâdı amellerin en faziletlisi görüyoruz. Binâenaleyh biz cihâd etmeyelim mi? diye sordu. da: siz kadınlar için cihâdın en faziletlisi mebrûr haccdır\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1521,
			"arabicnumber": 1521,
			"text": "Ben Ebû Hureyre (radıyallahü anh)'den işittim, şöyle dedi: Ben Peygamber (sallallahü aleyhi ve sellem)'den işittim, şöyle fauyuruyordu: Allah rızâsı için hacc yapar da cinsî münâsebette ve onu da'vet eden hareketlerde bulun­maz ve tâat yolundan dışarı çıkmaz ise, o kimse (günâhlardan sıyrı­lıp) anasının onu doğurduğu günkü gibi tertemiz dönmüş olur",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1522,
			"arabicnumber": 1522,
			"text": "(Bana Zeyd ibnu Cubeyr tahdîs etti ki, kendisi Abdullah ibn Umer'e, konağında iken gelmiştir. îbn Umer'in de kıldan bir ça­dırı, bir de çadırın sahnında yukarı tarafında aykırı çekilmiş büyük­çe perdeli yeri vardı . Cubeyr dedi ki:) Ben İbn Umer'e: Benim nereden umre yapmaklığım caiz olur? diye sordum. İbn Umer: Rasûlullah (sallallahü aleyhi ve sellem) mîkaatları farz yani ta'yîn buyurdu. Necd ahâlîsi için Karn'ı, Medine ahâ­lîsi için Zu’l-Huleyfe'yi, Şâm ahâlîsi için de Cuhfe'yi ta'yîn buyurdu, dedi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1523,
			"arabicnumber": 1523,
			"text": "Bize Şebâbe, Verkaa'dan; o da Amr ibnu Dinar'dan; o da İkrime'den tahdîs etti ki, İbnu Abbâs (radıyallahü anh) şöyle demiştir: Yemen ahâlîsi seferde ve hacc müddetince gerekli olan azıkları hazırlamaksızın ve bizler Allah'a dayanıp güvenen kimseleriz, diyerek hacca çıkarlardı. Nihayet Mekke'ye geldiklerinde insanlardan azık isterlerdi. Bu sebeble Yüce Allah: \".\"...Bir de azıklanın. Muhakkak ki azığın en hayırlısı,takvâlı Olmaktır... \". ( Bakara: 197) âyetini indirdi . hadîsi Sufyân ibn Uyeyne, Amr ibn Dinar'dan; o da İkri­me'den; İbn Abbâs'i zikretmeksizin, mürsel olarak rivayet etmiştir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1524,
			"arabicnumber": 1524,
			"text": "İbn Abbâs (radıyallahü anh) şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem) Medine ahâlîsi için Zu’l-Huleyfe'yi, Şâm (Mısır, Mağrib) ahâlîsi için Cuhfe'-yi, Necd ahâlîsi için Karne’l-Menâzil mevkiini, Yemen ahâlîsi için Yalemlem'i (ihrama girme) mîkaadı ta'yîn etti. Bu yerler, hacc ve umre yapmak isteyen bu memleketler ahâlîleri ile diğer memleketler hal­kından yolları bu yerlere gelen kimselerin mîkaatlarıdır. Bunlardan başka bu mîkaatlarla Mekke arasındaki yerler halkı da haccı inşâ etmiş bulundukları mahallerden ihrama girerler. Hattâ Mekkeliler de Mekke'den ihrama girerler",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1525,
			"arabicnumber": 1525,
			"text": "Bize Mâlik, Nâfi'den; o da Abdullah ibn Umer (radıyallahü anh)'den haber verdi ki, Rasûlullah(sallallahü aleyhi ve sellem): \"Medine ahâlîsi Zu'l-Huleyfe'den; Şâm ahâlîsi Cuhf e'den; Necd ahâlîsi de Karn mevkiinden i'tibâren ihram ve telbiye ederler\" buyurmuştur. ibn Umer: Rasûlullah'ın \"Yemen ahâlîsi de Yalemlem mevkiinden i'tibâren ihram ve telbiye ederler\" buyurduğu bana ulaştı, demiştir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1526,
			"arabicnumber": 1526,
			"text": "İbn Abbâs (radıyallahü anh) şöyle demiştir: Rasûlullah (sallallahü aleyhi ve sellem) Medine ahâlîsi için Zu’l-Huleyfe'yi, Şâm ahâlîsi için Cuhfe'yi, Necd ahâlîsi için Karnu'l-Menâzil'i, Yemen ahâlîsi için Yalemlem'i mîkaat ta'ynı buyurdu. Bu yerler, isimleri söylenen memleketler ahâlîlerinin ve başka memleketler halkından olup da hacc ve umre yapmak isteyip, yolları bu mîkaatlara uğrayan kimselerin mîkaatlarıdırlar. Bu mîkaatların berisinde, yani Mekke tarafındaki yerlerde bulunan bulundukları me­kândır. Hattâ Mekke ahâlîsi Mekke'den ihrama girerler",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1527,
			"arabicnumber": 1527,
			"text": "Bize Sufyân ibn Uyeyne tahdîs edip dedi ki: Biz bu hadîsi ez-Zuhrî'den ezberledik; o da Sâlim'den; o da Bâbası İbnu Umer'den belledi. İbnu Umer: Peygamber (sallallahü aleyhi ve sellem) mîkaatları ta'yîn etti... diyerek hadîsi rivayet etmiştir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1528,
			"arabicnumber": 1528,
			"text": "Buhârî dedi ki: H Bize Ahmed ibn îsâ tahdîs edip şöyle dedi: Bize İbnu Vehb tahdîs edip şöyle dedi: Baha Yûnus ibn Yezîd, İbn Şihâb'dan; o da Salim ibnu Abdillah'tan; o da Bâbası Abdullah'tan haber verdi. Abdullah şöyle demiştir: Ben Rasûlullah'tan işittim, şöyle buyuruyordu: \"Medine ahâlîsinin ihram ve telbiye etme yeri Zu'l-Huleyfe'dir. Şâm ahâlîsinin ihram ve telbiye etme yeri Mehyea'dır -ki o Cuhfe'dir-, Necd ahâlîsininki Karn'dır\" . Umer şöyle dedi: Sahâbîler: Peygamber (sallallahü aleyhi ve sellem)'in \"Yemen ahâlîsinin ihram ve telbiye etme yeri Yalemlem'dir\" buyurduğunu söy­lediler; ben bu fıkrayı kendi kulağımla işitmedim",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1529,
			"arabicnumber": 1529,
			"text": "Bize Hammâd ibn Zeyd, Amr ibn Dinar'dan; o da Tâvûs'tan; o da İbn Umer (radıyallahü anh)'den tahdîs etti(ki, o şöyle demiştir): Pey­gamber(sallallahü aleyhi ve sellem) Medine ahâlîsi için Zu'I-Huleyfe'yi, Şâm ahâlîsi için Cuhfe'yi, Yemen ahâlîsi için Yalemlem'i, Necd ahâlîsi için de Karn'ı mîkaat ta'yîn etti. Bu mîkaatlar hacc ve umre yapmak isteyen bu memleketler halklarının ve diğer memleketler halkından bu memle­ketler üzerine gelen kimselerin mîkaatlarıdır. Bu mîkaat yerlerinin berisinden (yânı mîkaatlarla Mekke arasındaki yerler halkından) olan kimsenin ihrama girme yeri ise, kendi ailesinin bulunduğu çevredir. Hattâ şübhesiz Mekke ahâlîsi de Mekke'den ihram ve telbiye ederler",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1530,
			"arabicnumber": 1530,
			"text": "İbnu Abbâs (radıyallahü anh) şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem) Medîne ahâlîsi için Zu'l-Huleyfe'yi; Şâm ahâlîsi için Cuhfe'yi; Necd ahâlîsi için Karne'l-Menâzil’i; Yemen ahâlîsi için Yalemlem'i mîkaat ta'yîn buyurdu. Bu mîkaatlar, hacc ve umre yapmak isteyen bu memleket­ler ahâlîleri ile, bunlardan başka memleketlerden olup da bu memle­ketler üzerine gelecek herkesin mîkaatlarıdır. Bunlardan başka, bu mîkaatlarla Mekke arasındaki memleketler halkı da haccı inşâ ettik­leri o yerlerden (yani bulundukları yerlerden) ihram ederler. Hattâ Mekke ahâlîsi de Mekke'den ihrâmlanırlar",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1531,
			"arabicnumber": 1531,
			"text": "İbn Umer (radıyallahü anh) şöyle demiştir: Şu iki şehir, yani Basra ile Küfe şehirleri Umer zamanında feth edilip kurulunca, bu şehirler halkı Umer'e geldiler ve: Ey Mü'minlerin Emîri! Şübhesiz Rasûlullah (sallallahü aleyhi ve sellem) Necd ahâlîsi için Karn'ı mîkaat ta'yîn buyurmuştur. Halbuki burası bizim yolumuzdan sapadır. Eğer biz Karn'dan ihrama girmek istersek bu bize meşakkatli oluyor, diye şikâyet arzettiler. bunlara: Öyleyse siz, Mekke'ye giden yolunuz üzerinden size sapa olmayan Karne'l-Menâzil’in hizasında bulunan bir noktaya bakıp, ora­yı mîkaat edininiz, dedi. Iraklılar için Zâtu Irk mevkiini mîkaat ta'yîn etti",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1532,
			"arabicnumber": 1532,
			"text": "Abdullah ibn Umer (radıyallahü anh)'den(o, şöyle demiştir): Rasûlullah(sallallahü aleyhi ve sellem) Zu’l-Huleyfe'deki vâdîde devesini çökertti. Sonra inip ora­da (iki rek'at) namaz kıldı. (İbn Umer'in râvîsi ve azâdlısı şöyle dedi:) Abdullah ibn Umer de burada bu namazı kılardı",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1533,
			"arabicnumber": 1533,
			"text": "Abdullah ibnu Umer (radıyallahü anh)'den(o, şöyle demiştir): Rasûlullah(MedîneMen çıkarken Zu'I-HuIeyfe Mescidi yanındaki) Şe­cere yolunu izleyerek çıkar idi. Medine'ye de (Zu’l-Huleyfe Mescidi'nden daha aşağıda ve Medîne'ye daha yakın bulunan) Muarres yo­luyla girer idi. Ve yine Rasûlullah (sallallahü aleyhi ve sellem) Mekke'ye giderken Şecere Mescidi'nde namaz kılardı. Mekke'den dönüşünde de Vâdî'nin or­tasındaki Zu’l-Huleyfe'de namaz kılardı ve sabaha kadar burada ge­celemek âdeti idi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1534,
			"arabicnumber": 1534,
			"text": "Bize el-Evzâî tahdîs edip şöyle dedi: Bana Yahya (ibn Ebî Kesîr) tahdîs edip şöyle dedi; Bana İkrime tahdîs etti ki, o İbn Abbâs'tan şöyle derken işitmiştir: İbn Abbâs da Umer (radıyallahü anh) şöyle der­ken işitmiştir: Ben el-Akîk vadisinde Peygamber (sallallahü aleyhi ve sellem)'den işittim, şöy­le buyuruyordu: \"Bana bu gece Rabb'im tarafından bir gelici (yâni Cibrîl)geldi de: Bu mübarek vadide namaz kıl ve 'Hacc içinde umre­ye niyet ettim' de! dedi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1535,
			"arabicnumber": 1535,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1536,
			"arabicnumber": 1536,
			"text": "Bize İbnu Cureyc haber verip şöyle demiştir: Bana Atâ ibn Ebî Rebâh haber verdi. Atâ'ya da Ya'lâ'nın oğlu Safvân şöyle haber vermiştir: Ya'lâ ibn Umeyye, Umer ibn Hattâb'a: Peygamber'e vahy edilirken, Peygamber'i bana göster, demişti. Ya'lâ ibn Umeyye dedi ki: Peygamber el-Cı'râne'de bulunduğu sırada, yanında sahâbîlerinden bir topluluk da varken, yanına bir adam çıkageldi ve: Yâ Rasûlallah! Güzel koku sürünmüş olarak umre için ihra­ma giren bir kimse hakkında nasıl re'y edersin (yani ne buyurursun)? diye sordu. aleyhi ve sellem) bir müddet sustu. Akabinde kendisine vahy gel­di. Umer hemen Ya'lâ'ya işaret etti. Ya'lâ da geldi. O sırada Rasûlullah'ın üzerinde bir örtü vardı, bu örtü O'na gölgelik yapılmıştı. Ya'lâ başını bu örtünün içine soktu. Ve Rasûlullah'ı(vahyin şiddetli ağırlığından) yüzü kızarmış bir hâlde gördü. Rasülullah, uyuyan kim­senin gidip gelen nefesi gibi hırıltıyle nefes alıp veriyordu. Sonra Rasûlullah'tan bu hâl (yavaş yavaş) sıyrıldı. Akabinde: \"Umreden sormuş olan kimse nerede?\" buyurdu. Bunun üzerine yanına birisi getirildi. Rasülullah ona: \"Bedenine ve elbisene bulaşan kokuyu üç kerre yıka, üzerin­deki cübbeyi de çıkar,(bu ihramı giy de) haccında yapacağın işler gibi, umrende de yap!\" buyurdu . Cureyc dedi ki: Ben Atâ'ya, Peygamber bu adama üç defa yıkamasını emrettiği zaman, temizlemeyi, paklamayı mı kasdetmiştir? diye sordum. Atâ da bana: Evet, diye cevâb verdi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1538,
			"arabicnumber": 1538,
			"text": "Mansûr dedi ki: Ben İbn Umer'in ihram sırasında koku sürmekten çekinmesini İbrâhîm en-Nahaî'ye söyledim. O bana şöyle dedi: Sen İbn Umer'in sözüyle ne yapıyorsun! (Çünkü Rasûlullah'ın İbn Umer'inkine muhalif olan fi­ili sabit olmuştur. Şöyle ki:) Bana el-Esved tahdîs etti. Âişe (radıyallahü anhaa): Rasülullah(sallallahü aleyhi ve sellem) ihrâmlı iken, başının ayrım yerlerindeki kokunun parıldaması, sanki hâlâ gözümün önündedir, demiştir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1539,
			"arabicnumber": 1539,
			"text": "Kaasım ibn Muhammed'den: Peygamber'in zevcesi Âişe'den haber verdi. Âişe(radıyallahü anha): Ben Rasûlullah (sallallahü aleyhi ve sellem)'ı ihrama girerken, ih­ramı için, bir de ihramı çıkarıp hılle girdiği için Ka'be'yi tavaf etmesinden önce güzel koku ile kokulandırır idim, demiştir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1540,
			"arabicnumber": 1540,
			"text": "İbnu Umer (radıyallahü anh): Ben Rasûlullah (sallallahü aleyhi ve sellem)'ı, başının saçlarını (zamklı bir madde ile) toplamış olduğu hâlde, yüksek sesle telbiye eder­ken gördüm, demiştir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1541,
			"arabicnumber": 1541,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1542,
			"arabicnumber": 1542,
			"text": "Bize Mâlik, Nâfi'den; o da Abdullah ibn Umer (radıyallahü anh)'den haber verdi (o, şöyle demiştir): Bir kimse: Yâ Rasûlallah! İhrama giren kimse, elbiselerden ne giyer? diye sordu. aleyhi ve sellem) buyurdu ki: \"Gömlekler, başlıklar, şalvarlar (yani donlar),bornuslar, mestler giymez- Ancak iki edik bulamayan kimse mest giysin ve on­ları da topuklarından aşağısına kadar kessin. Siz ihrâmlılar bir de zağferân yâhud vers ile boyanmış bir kumaş giymeyiniz",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1544,
			"arabicnumber": 1544,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1545,
			"arabicnumber": 1545,
			"text": "Abdullah ibn Abbâs (radıyallahü anh) şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem) gerek kendisi, gerek sahâbîleri saçlarını taradıkları, güzel kokular sü­ründükleri, (en güzel) izâr ve ridâlarını giydikten sonra Medine'den (öğle ile ikindi arasında Veda Haccı için) yola çıktılar. Peygamber, giyilmesi âdet olan ridâlar ve izârlardan hiçbirşeyi giymekten kimse­yi men' etmedi. Yalnız(kokusu ve rengi) vücûda bulaşacak derecede zağferânlı libâsın giyilmesini nehyetmişti. Bu büyük hacc topluluğu, gündüzün Zu’l-Huleyfe'ye vardı. (Öğle namazını orada kıldı ve Zu'l-Huleyfe'de geceledi. Sabahleyin) Peygamber devesine bindi. Beydâ Dağı'na yükselince, Peygamber ve sahâbîleri tehlîl ve telbiye ettiler. Peygamber kurbanlık devesine kılâde (yani gerdanlık) takdı ve kur­banlık nişânıyle nişanladı. Bu telbiye ve kılâde işleri Zu'l’ka'de'den beş gün kala (ayın yirmi beşinde) olmuştu. Nihayet Zu’l-hicce'nin dör­düncü günü Peygamber Mekke'ye vardı. Beyt'i tavaf, Safa ile Merve arasında sa'y etti. Kurbanlık develerine nişan taktığı için de artık o hayvanlar kurbanlık bedene olduklarından dolayı, Peygamber ih­ramdan çıkmadı. Tavaf ve sa'ydan sonra Peygamber hacca telbiye edici olarak Mekke'nin yüksek tarafındaki Hacûn mevkiine konak­ladı, Ka'be'yi tavaf ettikten sonra, artık tâ Arafat'tan dönünceye kadar Ka'be'ye bir daha yaklaşmadı. Peygamber sahâbîlerine, Beyt'i tavaf etmelerini, Safa ile Merve arasında sa'y etmelerini, sonra da saçları­nı kısaltmalarını, bundan sonra da ihramdan çıkmalarını emreyledi. Peygamber'in bu emri, beraberinde kılâdelediği bir kurbanlığı bulun­mayan kimseler içindi. Böyle bir kimse ihramdan çıktığında, berabe­rinde zevcesi varsa, artık zevcesi kendisine halâldır(yani onunla cinsî münâsebeti halâldır). Güzel koku sürünmesi, (mu'tâd olan) elbisele­rini giymesi de halâldır",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1546,
			"arabicnumber": 1546,
			"text": "Enes ibn Mâlik (radıyallahü anh) şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem) Medîne'de (öğleyi) dört rek'at, Zu’l-Huleyfe'de (ikindiyi) iki rek'at kıl­dı. Sonra sabaha girinceye kadar Zu’l-Huleyfe'de geceledi. Bineğine bindiği ve devesi kendisini sırtında dümdüz yaptığı zaman, yüksek sesle telbiye etti",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1547,
			"arabicnumber": 1547,
			"text": "Bize Eyyûb, Ebû Kılâbe'den; o da Enes'ten tahdîs etti.(Enes ibn Mâlik şöyle demiştir:) Peygamber(sallallahü aleyhi ve sellem) Medine'de öğleni dört rek'at kıldı. İkindiyi de Zu’l-Huleyfe'de iki rek'at kıldı. Kılâbe: Ben Peygamber'in Zu’l-Huleyfe'de sabaha girince­ye kadar gecelediğini sanıyorum, demiştir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1548,
			"arabicnumber": 1548,
			"text": "Bize Mâlik, Nâfi'den; o da Abdullah ibn Umer (radıyallahü anh)'den, Rasûlullah'ın telbiyesinin şöyle olduğunu haber verdi: Lebbeyke Allâhumme lebbeyk Lebbeyke lâ şerike leke lebbeyk inne'l-hamde ve'n-nımete leke Vel-mulke lâ şerike leke Yâ Allah, da'vetine tekrar tekrar icabet ettim; emrini yerine getirmeye tekrar tekrar hâzırım. Tekrar tekrar icabet ettim; Senin hiç ortağın yoktur. Sana tekrar tekrar itaate hâzırım. Şübhesiz hamd, ni'met ve mülk Sana mahsûstur; Sana hiçbir ortak yoktur",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1549,
			"arabicnumber": 1549,
			"text": "Âişe (radıyallahü anha) şöyle demiştir: Ben Peygamber'in nasıl telbiye eder olduğunu elbette biliyorum: Allâhumme lebbeyk Lebbeyke lâ şerike leke lebbeyk İnne 'l-hamde ve 'n-ni 'mete leke . hadîsi el-A'meş'ten rivayet etmekte Ebû Muâviye, Sufyân es- Sevrî'ye mutâbaat etmiştir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1550,
			"arabicnumber": 1550,
			"text": "Şu'be ibnu'l-Haccâc da şöyle dedi: Bize Süleyman el-A'meş ha­ber verip şöyle dedi: Ben Hayseme'den işittim; o da Ebû Atıyye'den. O da: Ben Âişe'den işittim, demiştir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1551,
			"arabicnumber": 1551,
			"text": "Bize Eyyûb (es-Sahtıyânî), Ebû Kılâbe'den tahdîs etti ki, Enes (radıyallahü anh) şöyle demiştir: Rasûlullah\" (sallallahü aleyhi ve sellem) -Veda Haccı'na giderken öğle namazını Medine'de, biz de kendisiyle beraber olduğumuz hâl­de dört rek'at kıldı. İkindiyi de Zu’l-Huleyfe'de (kısaltarak) iki rek'at kıldı. Sonra sabaha kadar orada geceledi. Sonra (sallallahü aleyhi ve sellemabahleyin devesine) bindi. Nihayet devesi onu Beydâ yokuşu üzerine doğrult­tu. Rasûlullah, Allah'a hamdetti, tesbîh etti ve tekbîr getirdi. Sonra hacc ile umreye beraberce niyet ederek, telbiye yaptı. Beraberindeki insanlar da hacc ile umreye niyet edip, telbiye eylediler.(Ve böylece ihrama girdiler). Mekke'ye geldiğimizde Rasûlullah insanlara emretti. Onlar ihramdan çıktılar . Nihayet terviye (yani Zu’l-hicce ayının se­kizinci) günü olunca, insanlar hacc için ihrama girdiler. Râvî Enes: Peygamber kendi eliyle ayakta durdukları hâlde birçok kurbanlık de­veler kesip boğazladı. Rasûlullah Medine'de de alacalı iki koç boğaz­ladı, dedi . Ebû Abdillah el-Buhârî şöyle dedi: Bâzıları, bu Eyyûb es-Sahtıyânî'den; o da bir adamdan -ki o Ebû Kılâbe'dir veya Hammâd ibn Seleme'dir denildi- o da Enes'tendir, dediler",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1552,
			"arabicnumber": 1552,
			"text": "İbnu Umer (radıyallahü anh): Peygamber (sallallahü aleyhi ve sellem), devesi ayağa kalkıp kendisini dümdüz doğrulttuğu zaman telbiye etti, demiştir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1553,
			"arabicnumber": 1553,
			"text": "Bize Eyyûb es-Sahtiyânî, Nâfi'den tahdîs etti. Nâfi' şöy­le demiştir: İbn Umer Zu'l-Huleyfe'de sabah namazını kıldığı zaman binek devesinin hazırlanmasını emreder, deveye semeri bağlanır, sonra da devesine biner idi. Devesi onu dümdüz yükselttiği zaman, ayakta olarak kıbleye yönelir, sonra da tâ Harem'e ulaşıncaya kadar telbiye eder idi. Harem'e girdikten sonra telbiyeyi keserdi. Nihayet Zu Tu-vâ'ya geldiğinde, burada gecelerdi. Nihayet sabaha girip sabah na­mazını kılınca da (Mekke'ye giriş için) yıkanırdı. İbn Umer, Rasûlullah'ın da böyle yaptığını söyledi . Yıkanmak hakkındaki bu hadîsi Eyyûb'dan rivayet etmekte İsmâîl ibn Uleyye, Abdulvâris'e mutâbaat etmiştir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1554,
			"arabicnumber": 1554,
			"text": "Bize Fuleyh tahdîs etti ki, Nâfi' şöyle demiştir: İbnu Umer (radıyallahü anh) Mekke yönüne yola çıkmak istediği zaman, içinde güzel bir koku bulunmayan bir yağ ile yağlanır, sonra Zu’l-Huleyfe Mescidi'ne gelir, orada namaz kılar, sonra bineğine binerdi. Bineği onu ayakta olarak dümdüz doğrulttuğunda telbiye ederdi. Bundan sonra da: Ben Peygamber (sallallahü aleyhi ve sellem)'i işte böyle yapar gördüm, der idi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1555,
			"arabicnumber": 1555,
			"text": "Mucâhid ibn Cebr şöyle demiştir: Bizler ibn Abbâs'ın yanında idik. Oradakiler Deccâl'ı konuşup, Peygamber'in: \"Onun iki gözü arasında kâfir yazılmıştır\" buyurduğunu zikrettiler. Bunun üzerine İbn Abbâs: Ben Peygamber'den bunu işitmedim. Velâkin Pey­gamber: \"Musa'ya gelince; ben onu (Ezrak) vadisinin içinde aşağıya inerken telbiye eder hâlde görüyor gibiyim\" buyurdu, dedi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1556,
			"arabicnumber": 1556,
			"text": "Peygamber'in zevcesi Âişe (radıyallahü anha) şöyle demiştir: Peygamber'in beraberinde Veda Haccı için yola çıktık. Ve umre niyetiyle tel­biye ettik. Sonra Peygamber: \"Beraberinde hedy, yâni kurbanlık hayvanı bulunan, umre ile birlikte hacca niyet edip telbiye eylesin, sonra da umre ile haccdan birlikte ihramdan çıkıncaya kadar da, ih­ramdan çıkmasın!\" buyurdu. Ben hayızlı olarak Mekke'ye geldim. Beyt'i tavaf etmedim; Safa ile Merve arasında sa'y etmedim. Bu du­rumumu Peygamber'e şikâyet tarzında arzettim. Peygamber (sallallahü aleyhi ve sellem) ba­na: \"Başının saç örgülerini çöz, saçlarını tara, umreyi terk et ve yalnız hacca niyetle telbiye et!\" buyurdu. Ben de böyle yaptım. Hacc fiille­rini yerine getirip tamamladığımız zaman, Peygamber beni erkek kardeşim Abdurrahmân ibn Ebî Bekr'in beraberinde olarak, Ten'îm mevkiine gönderdi de, ben oradan umre yaptım. Peygamber: \"İşte bu, senin umrenin yeridir\" buyurdu. dedi ki: Umre niyetiyle telbiye etmiş olanlar Beyt'i tavaf ve Safa ile Merve arasını sa'y ettikten sonra ihramdan çıktılar. Sonra Minâ'dan dönmelerinin akabinde diğer bir tavaf daha yaptılar. Am­ma hacc ve umreyi cem' edenlere gelince, onlar ancak bir tavaf yap­tılar",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1557,
			"arabicnumber": 1557,
			"text": "Bize el-Mekkî ibnu İbrâhîm, İbn Cureyc'den tahdîs etti ki, o şöyle demiştir: Atâ şöyle dedi: Câbir (radıyallahü anh) şöyle dedi: Peygamber (sallallahü aleyhi ve sellem) Alî ibn Ebî Tâlib'e(Yemen'den, beraberinde kurbanlık olduğu hâlde Mekke'ye geldiği zaman) girmiş bulunduğu ihramı üzerinde kal­masını emretti. Atâ yâhud Mekkî dedi ki: Câbir bu hadîsinde Surâka'nın sözünü de zikretmişti",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1558,
			"arabicnumber": 1558,
			"text": "Bize Suleym ibnu Hayyân tahdîs edip şöyle dedi: Ben Mervân el-Asfar'dan işittim ki, Enes ibn Mâlik (radıyallahü anh) şöyle demiştir: Alî, Yemen'den(Mekke'ye) Peygamber'in yanına geldi. Peygamber, Alî'ye: \"Ne niyetle ihrama girip telbiye ettin?\" diye sordu. Alî: Pey­gamber'in ihrama girdiği gibi ihrâmlanıp telbiye ettim, dedi. Peygam­ber: \"Benim yanımda hedy (yani kurbanlık)olmayaydı (Mekke'ye varınca ziyaret tavafı ve sa'yden sonra tıraş olup) ihramdan çıkardım\" buyurdu. Muhammed ibnu Bekr İbnu Cureyc'den şunu ziyâde etti: Enes dedi ki: Peygamber(sallallahü aleyhi ve sellem), Alî'ye: \"Yâ Alî! Sen ne niyetiyle ihrama gi­rip telbiye ettin?\" diye sordu. Alî: Peygamber'in ihram ve telbiye ettiği gibi, dedi. Peygamber: \"Öyleyse sen Beyt'e kurbanlık hediye et ve şu hâlinde olduğun gibi ihrâmlı olarak kal\" buyurdu",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1559,
			"arabicnumber": 1559,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1560,
			"arabicnumber": 1560,
			"text": "Âişe (radıyallahü anha) şöyle demiştir: Biz Rasûlullah'ın beraberin­de, hacc aylarında, hacc gecelerinde ve hacc hâllerinde (Medine'den) çıktık. Nihayet(Mekke'nin hududu olan) Serif mevkiine indik. dedi ki: Rasûlullah, sahâbîlerine doğru çıktı da: \"Sizden her kimin beraberinde hedyi (kurbânı) yoksa ve haccını umreye çevirmek isterse, o (haccını feshedip)umre yapsın! Be­raberinde hedyi bulunan da haccını umreye çevirmesin\" buyurdu. dedi ki: Peygamber'in bu Öğretmesinden sonra, sahâbîlerinden umreyi alanlar da oldu, terkedenler de bulundu. Âişe dedi ki: Fakat Rasûlullah ile sahâbîlerinden bir takım kimselerin -ki bunlar kuvvet sahibi kişilerdi- kurbanlıkları beraber­lerinde idi. Bunlar(hacci feshedip) umre yapmaya muktedir değiller­di. Âişe dedi ki: Rasûlullah bu emri verdikten sonra(çadıra) benim yanıma girdi. Ben ise ağlıyordum. Rasûlullah: \"Ey kadın! Seni ne ağlatıyor ki?\" dedi Ben de: Senin sahâbîlerine söylediğin sözünü işittim. Demek ki ben umreden(tavaf ve sa'y edemiyerek) men' olundum, dedim . \"Senin hâlin nedir ki?\" dedi. Ben: Namaz kılamıyorum, dedim. Rasûlullah: \"Bu sana zarar vermez. Sen de ancak Âdem kızlarından bir kadınsın. Allah, bütün Âdem kızları üzerine yazdığı şeyi senin üzeri­ne de yazmıştır. Böyle olunca sen hacca niyetinde sabit ol. Allah sa­na umreyi de nasîb eder\" buyurdu. dedi ki: Rasûlullah'ın bu (Veda) haccında Arafat'a çıktık. Nihayet Minâ'ya geldik. Ben de artık temiz olmuştum. Sonra Minâ'dan çıktım. (Ve Mekke'ye gelip) Beyt'e ifâda tavafı yaptım. Âişe de­vam edip dedi ki: Sonra Minâ'dan sonuncu dönüşte, Rasûlullah'ın beraberinde yola çıktım. Rasûlullah Muhassab mevkiine gelip, ko­nakladı. Biz de O'nunla beraber orada konakladık. Rasûlullah, kar­deşim Abdurrahmân ibn Ebî Bekr'i çağırdı ve: \"Kızkardeşini haremden çıkar, (hıll ile harem hududunda)um­re niyetiyle ihram ve telbiye yaptır.(Tavaf ve sa'y ettikten)sonra ih­ramdan çıkınız, sonra buraya geliniz. Ben burada ikiniz benim yanıma gelinceye kadar sizleri gözlüyorum\" buyurdu. devamla şöyle dedi: Kardeşimle birlikte çıktık. Nihayet (Ten'îm'de) ihrâmlandiktan; tavaf ve sa'yi de yaptıktan sonra, seher vaktinde Rasûlullah'ın yanına geldim. Rasûlullah: \"Umreyi bitirdiniz mi?\" dedi. Ben de: Evet bitirdik, dedim. üzerine Rasûlullah, sahâbîlerine (Medîne'ye doğru) hareketi ilân etti. İnsanlar hareket ettiler. Rasûlullah da Medîne'ye yönelici olarak yürüdü . dedi ki: Hadîsteki \"Dayra\", \"Dara yadîru dayran\" fiilindendir. Bu fiilde \"Dara yadûru davran\" dahî denilir. Ve (ma'nâsı) \"Darra yadurru darran\"dır",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1561,
			"arabicnumber": 1561,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1562,
			"arabicnumber": 1562,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1563,
			"arabicnumber": 1563,
			"text": "Mervân ibnu'l-Hakem şöyle demiştir: Ben Usmân ve Alî'ye (hacc sırasında) şâhid oldum. Usmân halkı temettü' haccından ve hacc ile umreyi cem' etmekten (tenzîhen) nehyediyordu. Alî bu nehyi görünce, her ikisine birden niyet ederek Lebbeyke bi-umretin ve haccetin diye yüksek sesle telbiye edip ihrâmlandı. Ve: Ben Peygamber (sallallahü aleyhi ve sellem)'in sünnetini kimsenin sözünden dolayı terk edici değilim, dedi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 1564,
			"arabicnumber": 1564,
			"text": "Abdullah ibnu Abbâs (radıyallahü anh) şöyle demiştir: Câhiliye Arabları hacc aylarında umre etmeyi, yeryüzünde işlenen günâhların en büyüğü nev'indendir diye i'tikaad ederlerdi. Ve bunlar Muharrem ayındaki harâmlığı da safer ayına naklederlerdi de: Devenin arkasındaki yara iyi olur, ayak izleri silinir gider, safer ayı da çıkarsa artık umre yapmak işte o zaman umreciye halâl olur derlerdi. Peygamber (sallallahü aleyhi ve sellem) sahâbîleri ile beraber (zu’l-hicce'nin) dördüncü gecesi sabahında hacc niyetiyle telbiye ediciler olarak (Mekke'ye) geldiler. Peygamber sahâbîlerine, hacclarını umreye çevirmelerini ve (tavaf, sa'y, tıraşla) ihramdan çıkmalarını emreyledi. (Hacc aylarında umre yapmayı bü­yük günâh gördükleri için) hacc aylarında umre ile emredilmesi, kendilerine ağır geldi ve: Yâ Rasûlallah! Bu hangi hılldır; nasıl umredir (İhrâmın ha­ram kıldığı şeyleri bu da halâl kılar mı)? diye sordular. \" (Hacc aylarındaki) bu umrenin yerine getirilmesi de bunların hepsini halâl kılar\" buyurdu",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 1565,
			"arabicnumber": 1565,
			"text": "Ebû Mûsâ (radıyallahü anh): Ben (Yemen'den) Peygamber'in huzuruna geldim. Peygamber (sallallahü aleyhi ve sellem), ben Ebû Musa'ya (umreyi yerine getir­dikten sonra) ihramdan çıkmayı emreyledi, demiştir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 1566,
			"arabicnumber": 1566,
			"text": "Bize İsmâîl tahdîs edip şöyle dedi: Bana Mâlik tahdîs etti. H ve yine bize Abdullah ibn Yûsuf tahdîs edip şöyle dedi: Bize Mâlik, Nâfi'den; o da Ibn Umer'den tahdîs etti ki, Peygamber'in zev­cesi Hafsa (radıyallahü anh): Yâ Rasûlallah! İnsanların hâli nedir ki, umre ile ihramdan çıktılar; Halbuki sen umrenden çıkmadın? diye sormuş. (sallallahü aleyhi ve sellem): \"Ben başımın saçlarını yapışkan bir madde ile telbîd edip top­ladım, kurbânımı da (Ka'be nâmına) kılâdeledim. Artık ben kurbâ­nımı kesmedikçe ihramdan çıkamam\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 1567,
			"arabicnumber": 1567,
			"text": "Bize Ebû Cemre Nasr ibnu İmrân ed-Dubaiyyu haber verip şöyle dedi: Ben temettü haccı yapmak istedim de insanlar beni temettu'dan nehyetti. Ben de bunu İbn Abbâs'a sordum. O da bana temettü' üzerinde devam etmemi emretti. Müteakiben ben ru'yâmda, bir adamın bana: Temettü', mebrûr bir hacc ve kabul edilmiş bir umredir, demekte olduğunu gördüm. Ben bu ru'yâmı İbn Abbâs'a haber verdim. İbn Abbâs bana: Temettü', Peygamber'in sünnetidir, dedi ve tekrar bana: Yanımda otur da sana kendi malımdan bir pay ayırayım diye ilâve etti. Şu'be dedi ki: Ben Ebû Cemre'ye: İbn Abbâs'ın sana pay vermesinin sebebi nedir? diye sordum. Ebû Cemre: Görmüş olduğum o ru'yâdan dolayı, dedi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 1568,
			"arabicnumber": 1568,
			"text": "Bize Ebû Şihâb Mûsâ ibn Nâfi' tahdîs edip şöyle dedi: defasında Mekke'ye mutemetti' hacısı olarak umre niyetiyle gel­dim. Terviyeden üç gün evvel Mekke'ye girdik. Mekke ahâlîsinden bâzı insanlar bana: Şimdi senin haccın Mekkeliler'in (az meşakkatli ve az sevâb-ı) haccına dönmektedir, dediler. de hemen Atâ ibn Ebî Rebâh'ın yanına gittim ve kendisin­den fetva istiyordum. Atâ şöyle dedi: Bana Câbir ibn Abdillah (radıyallahü anh) şöyle tahdîs etti: Kendisi, Peyamber (sallallahü aleyhi ve sellem) Mekke'ye kurbanlık develer gönderdiği hacc günü, Pey­gamber ile beraber hacc etmiştir. Sahâbîler o günü mufred hacc niyetiyle ihrama girip telbiye etmişlerdi. Peygamber onlara: \"Haccınızı umreye çeviriniz: Beyt'i tavaf, Safa ileMerve ara­sını sa'y etmek ve saçlarınızı kısaltmak suretiyle ihramlarınızdan çı­kınız. Sonra ihrâmsız olarak Mekke'de ikaamet ediniz. Tâ terviye (yani Zu’l-hicce'nin sekizinci) günü olduğu zaman hacc niyetiyle ihrama girip, telbiye ediniz. Ve evvelki ihrâmlanmış olduğunuz mufred hac­cınızı (böylece) temettü' haccı yapınız\" buyurdu. Yâ Rasûlallah! Biz ilk ihrama girişimizde hacc diye isimlendirdiğimiz hâlde, o haccımızı nasıl mut'a' (yani umre) yaparız? dedi­ler. \"Siz benim emrettiğim şeyi yapınız! Eğer ben de kurbân sevk etmemiş olaydım, muhakkak size emrettiğim gibi yapardım. Lâkin şim­di kurbânım varacağı yere ulaşıncaya (yani Minâ'da kesilinceye) ka­dar, ihrâmlıya haram olan şeylerden hiçbirisi bana halâl olmaz\" buyurdu. üzerine sahâbîler de Peygamber'in emrettiği gibi yaptılar",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 1569,
			"arabicnumber": 1569,
			"text": "Saîd ibnu'l-Müseyyeb şöyle demiştir: Alî ibn Ebî Tâlib ile Usmân ibn Affân (radıyallahü anh) Usfân mevkiinde bulunurlarken, mut'a (yani temettü') hakkında ihtilâf ettiler. Alî, Usmân'a: Sen, başka değil; ancak Peygamber'in yapmış olduğu bir işten nehyetmek istiyorsun, dedi. İbnu'l-Müseyyeb dedi ki: Alî, Usmân'ın bu nehyini görünce, umre ile haccı birlikte niyetle ihram edip, telbiye etti",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 1570,
			"arabicnumber": 1570,
			"text": "Ben Mucâhid ibn Cebr'den işittim, şöyle diyordu: Bi­ze Câbir ibnu Abdillah (radıyallahü anh) tahdîs edip şöyle dedi: Bizler Rasûlullah'ın beraberinde ve Lebbeyke Allâhumme, Lebbeyke bihacc diyerek Mekke'ye geldik. Rasûlullah (sallallahü aleyhi ve sellem) bizlere, bu haccımızı umre yapma­mızı emreyledi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 1571,
			"arabicnumber": 1571,
			"text": "Katâde şöyle demiştir: Bana Mutarrıf tahdîs etti ki, İmrân ibn Husayn(radıyallahü anh) şöyle demiştir: Bizler Rasûlullah (sallallahü aleyhi ve sellem) zamanında temettü' haccı yaptık. Kur'ân da (temettü'un câizliği hakkında) in­di. Bir adam da kendi re'yi ile dilediği şeyi söyledi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 1572,
			"arabicnumber": 1572,
			"text": "Ve Ebû Kâmil Fudayl ibnu Huseyn el-Basrî (237) şöyle de­di: Bize Ebû Ma'şer tahdîs etti. Bize Usmân ibnu Gıyâs, İkrime'den tahdîs etti ki, İbn Abbâs (radıyallahü anh), hacc nıut'a'sından sorulduğunda o şöyle dedi: Veda Haccı'nda Muhacirler, Ensâr ve Peygamber'in zevceleri ihrama girip telbiye ettiler. Biz de ihrama girip telbiye ettik. Mekke yakınına geldiğimiz zaman Rasûlullah(sallallahü aleyhi ve sellem): \"Hedy kılâdeleyip beraberinde getirmiş olanlar müstesna, hacc niyetiyle yaptığınız ihram ve telbiyelerinizi umreye çeviriniz!\" buyurdu. Beyt'i tavaf, Safa ile Merve'yi sa'y edip (ihramdan çık­tık), kadınlara geldik ve âdetimiz olan dikişli elbiseleri giydik. Rasûlullah: \"Kurbanlığa kılâde ve nişan takmış olan kimselere, kurbân varacağı yere ulaşıncaya (yani Minâ'da kesilinceye) kadar ihramın ha­ram kıldığı şeylerden hiçbiri halâl olmaz\" buyurdu. bizlere zu’l-hiccenin sekizinci terviye günü öğlenin ardından hacc için ihrama girmemizi emretti. Nihayet biz Arafat'ta vak­fe, Müzdelife'de geceleme, bayram günü Minâ'da cemre atma ve tıraş gibi hacc rmenseklerini bitirip de akabinde Mekke'ye geldiğimiz, Beyt'i tavaf, Safa ile Merve arasım sa'y ettiğimiz zaman, artık bizim haccımız tamâm olmuş ve üzerimize kurbân vâcib gelmiştir. Nitekim Yü­ce Allah şöyle buyurdu: Kim hacca kadar umre ile fâidelenmek isterse kolayına ge­len bir kurbânı keser. Fakat onu bulamazsa hacc günlerinde(ihrâmlı olarak) üç, döndüğünüz vakit yedi gün olmak üzere oruç tutmak (vâcib olur ki), bunlar tam on gün eder. Bu, ailesi Mescidi Haram 'da bu­lunmayanlara âiddir. Allah'tan ittikaa edin ve bilin ki, Allah, cezası cidden çetin Olandır\"(el-Bakara: 196). \"Döndüğünüz”ta'bîri, \"Memleketlerinize döndüğünüz zaman\" demektir. Kurbân olarak bir davar kâfi gelir. Böy­le yapanlar bir yılda iki büyük İbâdeti, hacc ile umre arasını birleştirmişlerdir. Çünkü Yüce Allah kendi Kitâb'ında hacc ile um­reyi cem' etmeyi indirmiş, Peygamber'i de bunu şeriat ve kaanûn yapmış ve temettu'u Mekke ahâlîsinden başka olan insanlar için mu­bah kılmıştır. Allah: “Bu hüküm, ailesi Mescidi Harâm'da bulun­mayanlara âiddir...\"(el-Bakara: 196) buyurdu. Yüce Allah'ın Kitâbı'nda (el-Bakara: 197) zikretmiş olduğu hacc ayları ise, şevval, zu’l-ka'de ve zu’l-hicce'dir. Her kim bu aylar içinde umre ile fâidelenirse, ona bir kurbân kesmek yâhud oruç tutmak vâcib olur . cinsî münâsebet;el-Fusûkالْ, ma'siyetfer; el-Cidâl ise kav­ga etmek'tir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 1573,
			"arabicnumber": 1573,
			"text": "Bize Eyyûb (es-Sahtiyânî), Nâfi'den haber verdi. O şöyle demiştir: İbnu Umer (radıyallahü anh), Harem'in en yakın hudûd mevkiine girdiği zaman telbiyeyi keser. Sonra Zû Tuvâ'da geceyi geçirir, sonra orada sabah namazını kılar ve (Mekke'ye girmek için de) yıkanırdı. İbnu Umer, Allah Peygamberi'nin de böyle yapar idiğini söylerdi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 1574,
			"arabicnumber": 1574,
			"text": "Ubeydullah şöyle demiştir: Bana Nâfi' haber verdi ki, ibnu Umer(radıyallahü anh): Peygamber(sallallahü aleyhi ve sellem) Zû Tuvâ mevkiinde geceyi geçirip sa­baha ulaştı. Sonra (gündüzleyin) Mekke'ye girdi demiştir. Nâfi': İb­nu Umer de böyle yapardı, demiştir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 1575,
			"arabicnumber": 1575,
			"text": "Bana Mâlik,Nâfi'den tahdîs etti ki, İbn Umer (radıyallahü anh): Rasülullah (sallallahü aleyhi ve sellem), Mekke'ye Seniyyetu'l-UIyâ'dan girer ve(çıkarken de) Seniyyetu's-Suflâ'dan çıkar idi, demiştir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 1576,
			"arabicnumber": 1576,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 1577,
			"arabicnumber": 1577,
			"text": "Bize Sufyân ibnu Uyeyne, Hişâm ibn Urve'den; o da Bâbası Urve'den; o da Âişe (radıyallahü anha)'den tahdîs etti ki, Peygamber (sallallahü aleyhi ve sellem) Mek­ke'ye geldiği zaman, içeriye Mekke'nin yüksek tarafından girmiş; çı­karken de aşağı tarafından çıkmıştır",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 1578,
			"arabicnumber": 1578,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 1579,
			"arabicnumber": 1579,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 1580,
			"arabicnumber": 1580,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 1581,
			"arabicnumber": 1581,
			"text": "Urve: Peygamber (sallallahü aleyhi ve sellem) Fetih yılında Mekke'nin yüksek tarafından Kedâ'dan girdi, demiştir. Hişâm: Urve de ekseriya bu Kedâ'dan girer idi. Halbuki bu yol, kendi menziline iki yolun en yakını İdi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 1582,
			"arabicnumber": 1582,
			"text": "Ben Câbir ibn Abdillah (radıyallahü anh)'tan işittim; şöyle dedi: Kureyş tarafından Ka'be bina olunurken, Peygamber ile amucası Abbâs gidip, birlikte taşları omuzlarında taşıyorlardı. Abbâs Peygamber'e: İzârını çıkar da boynun üzerine koy, dedi. İzârını çıkarıp koyacağı sırada hemen yere düştü. Ve iki gözü semâya dikilerek; Abbâs'a: \"îzârımı bana göster\" dedi. Akabinde izârını alıp onu kendi üzerine bağ­ladı",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 1583,
			"arabicnumber": 1583,
			"text": "Muhammed ibn Ebî Bekr'in oğlu Abdullah, Abdullah ibn Umer'e, Âişe'den haber vermiştir: Peygamber'in zevcesi Âişe şöyle demiştir: Rasûlullah(sallallahü aleyhi ve sellem), ben Âişe'ye hitaben: ''Kavmin Kureyş'in Ka'be'yi bina ederlerken, İbrâhîm Pey­gamber'in koyduğu temellerden bir kısmını terkederek kısalttıkları­nı bilmez misin?\" dedi. Yâ Rasûlallah! Sen Ka'be'nin duvarlarını İbrâhîm'in temel­leri üzerine döndürmez misin? dedim. \"Kavminin zamanı kâfirlik devrine yakın olmasaydı, muhak­kak ben Ka'be 'nin duvarlarını İbrâhîm'in temelleri üzerine yapardım'' buyurdu . ibnu Umer: Vallahi Âişe bu sözü muhakkak Rasûlullah'tan işitmiştir. -Ben Rasûlullah'ın Hicr'a yakın bulunan o iki Ka'be köşesini isti'lâmı terkettiğini sanmam; ancak şu var ki, herhalde Beyt, İbrâhîm'in temelleri üzere tamâm olmamıştır, demiş (böylece Âişe'yi te'yîd etmiş)tir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 1584,
			"arabicnumber": 1584,
			"text": "Bize Eş'as, el-Esved ibn Yezîd'den tahdîs etti ki, Âişe(radıyallahü anha) şöyle demiştir: Ben Peygamber'e İsmâîl Hicri'nin duvarından sorup: Bu duvar Beyt'ten midir? dedim. Rasûlullah: \"Evet, duvar Beyt 'tendir\" buyurdu. Ben yine: Kureyş için ne mâni' vardı ki duvarı yani Hıcr'i Beyt'in içine katmadılar? dedim. (sallallahü aleyhi ve sellem): \"Kavmin olan Kureyş'in bu Hıcr'ı, Ka'be'ye girdirmeye ve Ka'­be içine katmaya büdçeleri kısa gelip yetmedi\" buyurdu. yine: Ka'be'nin kapısı neden bu kadar yüksektir? diye sordum. : \"Senin kavmin, dilediklerini Ka'be'ye girdirmeleri, diledik­lerini de girmekten men' etmeleri için böyle yaptılar. Eğer kavmin Câhiliyet devrine yakın olmasaydı, Hıcr'ın duvarını Beyt'e katmak ve Beyt'in kapısını yer seviyesine indirmek isterdim. Fakat duvarı Beyt 'e girdirmem ve Ka 'be kapısını yer seviyesine indirmemden ötü­rü, onların gönüllerinin kırılmasından endîşe ederim\" buyurdu",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 1585,
			"arabicnumber": 1585,
			"text": "Bize.Ebû Usâme, Hişâm'dan; o da Bâbası Urve'den tahdîs etti ki, Âişe (radıyallahü anha) şöyle demiştir: Rasûlullah (sallallahü aleyhi ve sellem) bana şöyle bu­yurdu: \"Eğer senin kavminin küfrden ayrılması yeni olmasaydı, ben elbette Beyt'i bozar, sonra onu İbrâhîm Peygamber'in temeli üzeri­ne bina ederdim. Şübhesiz Kureyş Beyt 'in binasını kısattmıştır ve Beyt için bir half yânı kapı yapmıştır. (Diğer zabta göre mütekellim zamîri ile: Ben ona bir half yani bir kapı yapardım)\" buyurdu. Muâviye Muhammed ibn Hazım şöyle dedi: Bize Hişâm, \"Halfen\", yani bir kapı diye tahdîs etti",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 1586,
			"arabicnumber": 1586,
			"text": "Bize Cerîr ibn Hazım tahdîs edip şöyle dedi: Bize Yezîd ibnu Rûmân, Urve'den; o da Âişe (radıyallahü anha)'den tahdîs etti ki, Peygam­ber (sallallahü aleyhi ve sellem), Âişe'ye hitaben şöyle buyurmuştur: \"Yâ Âişe! Senin kavmin Câhiliyet.devrine zamanca yakın olmayaydı, ben Beyt'in yıkılmasını emrederdim ; o da yıkılırdı. Sonra Beyt'ten dışarıda bırakılan Hıcr'ı, Beyt'e katar ve kapısını da yere yapışık yapardım. Bir de Beyt'e biri şark tarafında, öbürü de garb tarafında olmak üzere iki tane kapı koydururdum. Bu suretle de Beyt'i, İbrâhîm Peygamber'in temeline ulaştırmış olurdum\". İşte Abdullah ibn Zubeyr'i Beyt'i yıkmaya ve yeniden inşâya sevk eden sebeb, Âişe'nin haber verdiği Peygamber'in bu arzu­sudur, demiştir. ibn Hazım dedi ki: Bana Yezîd ibn Rûmân: İbn Zubeyr, Beyt'^yıktığı ve yeniden bina ettiği zaman, ben de hâzır bulundum. O, Hıcr'dan bir mıkdârını Beyt'e katmıştı. Bu sırada ben, İbrâhîm Peygamber'in deve hörgüçleri gibi olan temel taş­larını gördüm, dedi. dedi ki: ben de Yezîd'e: İbrâhîm'in bu temellerinin yeri neresidir? diye sordum. Yezîd: Şimdi onu sana göstereyim, dedi. Ben kendisiyle beraber Hıcr'e girdim. O bana: İşte şurasıdır, diye Hıcr'ın aslî hududunun bulunduğu bir yer işaret edip gösterdi. dedi ki: Ben Hıcr'den olan bu yerin altı zıra' yâhud ona yakın mikdâr olduğunu takdîr ettim",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 1587,
			"arabicnumber": 1587,
			"text": "İbn Abbâs (radıyallahü anh) şöyle demiştir: Rasûlullah (sallallahü aleyhi ve sellem) Mekke'nin fethi günü şöyle buyurdu: \"Şübhesiz bu beldeyi Allah, Harem kılmıştır. (Bu hürmetten dolayı)onun dikeni kesilmez, av hayvanı ür­kütülmez, yitik eşyası el uzatılıp alınmaz, ancak i'lân edip sahibini bulmak için muhafaza edilir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 1588,
			"arabicnumber": 1588,
			"text": "Usâme ibn Zeyd (radıyallahü anh)'den, Usâme: Yâ Rasûlallah! Yarın Mekke'de nereye ineceksin, kendi evi­ne mi? diye sormuştur. aleyhi ve sellem): \"Akîl burada evlerden yâhud yurdlardan birşey bıraktı mı?\" buyurdu. anhâvî bunu tefsir ederek dedi ki:) Akîl ve kardeşi Tâlib, Ebû Tâlib'e mîrâsçı oldular. Halbuki Ca'fer ile Alî (radıyallahü anh), Ebû Tâlib'e mirasçı olmadılar. Çünkü Ca'fer ile Alî müslümân idiler. Akîl ile Tâlib ise kâfir idiler . ibnu'l-Hattâb (radıyallahü anh): Mü'min, kâfire vâris olmaz, der idi . Şihâb da şöyle dedi: Selef âlimleri Yüce Allah'ın şu âyetindeki velayeti, mîrâs velayeti ile tefsîr ederlerdi: \"Îmân edip hicret eden­ler, Allah yolunda mallarıyle, canlarıyle cihâdda bulunanlar, (muhacirleri) barındırıp yardım edenler, işte onlar biribirlerinin (mîrâsta) velîleridirler. Îmân getirip de hicret etmeyenlere ise, hicret ede­cekleri zamana kadar, sizin onlara hiçbirşey ile velayetiniz yoktur.(Bununla beraber) eğer onlar dîn hususunda sizden yardım isterler­se, yardım etmek üstünüze borçtur. Şu kadar ki, sizinle aralarında muahede bulunan bir kavm aleyhinde değil. Allah yapacaklarınızı hakkıyle görücüdür\" (el-Enfâl: 72)",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 1589,
			"arabicnumber": 1589,
			"text": "Ebû Hureyre (radıyallahü anh) şöyle demiştir: Rasûlullah (sallallahü aleyhi ve sellem) -Minâ'dan- Mekke'ye gelmek istediğinde: \"Yarın inşâallah menzilimiz Kinâne oğulları yurdunda olacaktır ki, orada Kureyş ile Kinâne oğul­lan küfr üzerinde ahidleşmişlerdi\" buyurdu",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 1590,
			"arabicnumber": 1590,
			"text": "Bize el-Evzâî tahdîs edip şöyle dedi: Bana ez-Zuhrî, Ebû, Seleme'den tahdîs etti ki, Ebû Hureyre (radıyallahü anh) şöyle demiştir: Peygam­ber (sallallahü aleyhi ve sellem) Minâ'da iken kurbân kesme gününün üçüncüsünde şöyle bu­yurdu: \"Bizler yarın Kinâne oğulları yurduna ineceğiz ki, orada Kureyş ile Kinâne oğulları küfr üzerine yeminleşip ahidleşmişlerdi.\" ki: Peygamber bu Kinâne oğullan yurdu demekle, Muhassab mevkiini kasdetmiştir. Bu ahidleşme, Kureyş ile Kinâne oğul­ları arasında, Hâşim oğulları'yle Abdulmuttalib oğulları -yâhud Muttalib oğulları- aleyhine, Peygamber'i kendilerine teslîm edinceye (itaatli kılıncaya) kadar onlarla kız alıp vermemek, alışveriş yapma­mak üzere yazılmıştı . Selâme ibn Ravh, Ukayl ibn Hâlid ile Yahya ibn Dahhâk'tan, onlar da el-Evzâî'den olmak üzere söyledi ki, Evzâî: Bana ibn Şihâb haber verdi demiştir. Bu Selâme ile Yahya: Hâşim oğulları ve Muttalib oğulları diye söylediler. Ebû Abdillah el-Buhârî: Muttalib oğullan ta'bîri daha doğrudur, dedi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 1591,
			"arabicnumber": 1591,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 1592,
			"arabicnumber": 1592,
			"text": "Bize el-Leys, Ukayl'den; o da İbn Şihâb'dan; o da Urve'den; o da Âişe'den tahdîs etti. ve yine bana Muhammed ibn Mukaatil tahdîs edip şöyle de­di: Bana Abdullah ibn Mübarek haber verip şöyle dedi: Bize Muhammed ibn Ebî Hafsa, ez-Zuhrî'den; o da Urve'den haber verdi ki, Âişe (radıyallahü anha) şöyle demiştir: Müslümanlar, ramazân farz kılınmadan ev­vel Âşûrâ(Muharremin onuncu) günü oruç tutarlardı. Ve o günü Ka'be'ye (yeni) örtü örterlerdi. Allah ramazân orucunu farz kılınca Rasûlullah (sallallahü aleyhi ve sellem): \"Âşûrâ orucunu tutmak isteyen, onu yine tutsun; onu terketmek isteyen de onu ter ketsin\" buyurdu",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 1593,
			"arabicnumber": 1593,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 1594,
			"arabicnumber": 1594,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 1595,
			"arabicnumber": 1595,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 1596,
			"arabicnumber": 1596,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 1597,
			"arabicnumber": 1597,
			"text": "Bize Sufyân es-Sevrî, el-A'meş'ten; o da İbrâhîm ibn Yezîd en-Nahaî'den; o da Abis ibnu Rabîa'dan haber verdi ki, Umer (radıyallahü anh) -bir haccında- Haceri Esved'e yaklaşıp onu öpmüş ve akabinde: Ben çok iyi biliyorum ki, sen zarar veremez, menfaat veremez bir taş parçasısın. Eğer Peygamber'in seni öptüğünü görmeseydim, seni öpmezdim, demiştir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 1598,
			"arabicnumber": 1598,
			"text": "İbn Umer (radıyallahü anh) şöyle demiştir:(Mekke'nin fethi günü) Rasûlullah, Beyt'e girdi. Beraberinde Usâme ibn Zeyd, Bilâl ve Usmân ibn Talha da girdiler. Üzerlerine Beyt'in kapısını kapadılar. (Bir müddet sonra) kapıyı açtıklarında içeriye ilk giren ben oldum. Ve Bi­lâl'e kavuştum. Bilâl'e: Rasûlullah Beyt'in içinde namaz kıldı mı? diye sordum. Yemen tarafındaki ilk iki direk arasında kıldı, dedi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 1599,
			"arabicnumber": 1599,
			"text": "Nâfi' şöyle demiştir. îbn Umer,Ka'be'ye girmek isteyip girdiğinde, mukaabil tarafa doğru yürürdü. Kapıyı sırtı tarafında kı­larak ilerlerdi. Nihayet yüzü tarafındaki duvarla kendi arasında üç zirâ'ya yakın bir uzaklık kalınca, Bilâl'in: Rasûlullah burada namaz kıldı, diye haber verip gösterdiği yeri kasdederek, orada namaz kı­lardı. Maamâfîh hiçbir kimse için Beyt'in, istediği herhangi bir cani­binde namaz kılmakta be's yoktur",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 1600,
			"arabicnumber": 1600,
			"text": "Abdullah ibnu Ebî Evfâ (radıyallahü anh) şöyle demiştir: Rasûlullah (sallallahü aleyhi ve sellem) (kaza) umre (sallallahü aleyhi ve sellemini) yaptı. Bunda Beyt'i tavaf edip, Makaam'ın arkasında iki rek'at namaz kıldı. Yanında kendisini insanlardan per­deleyen bir kimse de bulunuyordu. O koruyucu ve gözcü olan kişiye birisi gelip: Rasûlullah bu umresinde Ka'be'ye girdi mi? diye sordu. Oda: Hayır(girmedi), diye cevâb verdi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 1601,
			"arabicnumber": 1601,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 1602,
			"arabicnumber": 1602,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 1603,
			"arabicnumber": 1603,
			"text": "İbnu Umer (radıyallahü anh): Ben Rasûlullah'ın-Vedâ Haccı'ndaMekke'ye gelişinde yapacağı her tavafın evvelinde Siyah Rüknü isti'lâm ettiğini ve yedi tavaftan üçünde remel yürüyüşü yaptığını gör­düm, demiştir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 1604,
			"arabicnumber": 1604,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 1605,
			"arabicnumber": 1605,
			"text": "Bu hadîsi rivayet etmekte Sureyh'e, el-Leys ibnu Sa'd mutâbaat edip şöyle demiştir: Bana Kesîru'bnu Ferkad, Nâfi'den; o da İbn Umer'den; o da Peygamber'den tahdîs etti",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 1606,
			"arabicnumber": 1606,
			"text": "Bana Zeyd ibnu Eşlem, Bâbası Eslem'den haber verdi ki, Umer ibnu'l-Hattâb(radıyallahü anh), Rükn yani Haceri Esved için: Dikkat! Vallahi ben senin zarar veremez, fayda veremez bir taş olduğunu pek iyi bilmekteyim. Eğer Peygamber'in seni isti'lâm ettiğini görmüş olmayaydım seni isti'lâm etmezdim, demiş ve akabinde Haceri Esved'i isti'lâm etmiştir. İsti'lâmdan sonra: Bizim bu hızlı yürüyüş ile hâlimiz nedir (yani buna neden devam ediyoruz)? Biz bu hızlı yürü­yüşle ancak müşriklere kuvvet gösterişi yapar idik. Halbuki Allah on­ları helak etmiştir, dedi. Sonra da (bu düşünceden dönerek): Bu remel, yani hızlı yürüyüş, Peygamber'in yaptığı bir şeydir; işte bunun için biz remel yürüyüşünü terketmek istemiyoruz, dedi . Yahya (el-Kattân), Ubeydullah'tan; o da Nâfi'den tahdîs etti ki, Umer (radıyallahü anh): Ben Peygamber (sallallahü aleyhi ve sellem)'in şu iki köşeyi isti'lâm ettiğini gördüğüm zamandan beri şiddette ve rahatlıkta(yani Harem'in kalabalık ve tenhâ hâlinde) Yemen tarafındaki bu iki rük­nü isti'lâm etmeyi hiç terketmedim, demiştir. Râvî Ubeydullah dedi ki: Ben Nâfi'e: İbn Umer bu iki rükn arasında yürür(diğerleri ara­sında koşar) mıydı? diye sordum. Nâfİ': İbn Umer bu iki rükün ara­sında ancak isti'lâmının daha kolay olması için yürür idi, dedi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 1607,
			"arabicnumber": 1607,
			"text": "Bana Yûnus ibn Yezîd, îbn Şihâb'dan; o da Ubeydul­lah ibn Âbdillah'tan haber verdi ki, İbn Abbâs (radıyallahü anh): Peygamber (sallallahü aleyhi ve sellem) Veda Haccı'nda bir deve üzerinde \"mihcen\" denilen deynek ile Ha­ceri Esved'i isti'lâm ederek tavaf etti, demiştir . hadîsi İbn Şihâb'dan rivayet etmekte olan Yûnus'a, Abdulazîz ed-Derâverdiyyu mutâbaat etmiştir: ed-Derâverdî, Zuhrî'nin kardeşinin oğlu Muhammed ibn Âbdillah'tan; o da amucası Muhammed ibn Müslim ez-Zuhrî'den diye rivayet etmiştir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 1608,
			"arabicnumber": 1608,
			"text": "Ve Muhammed ibn Bekr dedi ki: Bize İbn Cureyc haber verip şöyle dedi: Bana Amr ibn Dînâr haber verdi ki, Câbir ibn Zeyd: Beyt'ten olan birşeyden kim sakınır ki? (Yani: Hiçbir kimseye Beyt'in herhangi bir parçasından sakınması lâyık olmaz) demiştir . Muâviye(radıyallahü anh), dört köşeyi de isti'lâm eder idi. İbn Abbâs ona: Şübhesiz Hıcr'a yakın olan bu iki köşe isti'lâm olunmaz, dedi. Muâviye de ona: Beyt'ten hiçbirşey terkedilmiş değildir, dedi . İbn Zubeyr de bu dört köşenin hepsini isti'lâm eder idi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 1609,
			"arabicnumber": 1609,
			"text": "Abdullah ibn Umer (radıyallahü anh): Ben Peygamber (sallallahü aleyhi ve sellem)'i Beyt'ten iki Yemânî köşelerden başkasını isti'lâm eder görmedim, demiştir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 1610,
			"arabicnumber": 1610,
			"text": "Bize Zeyd ibn Eşlem haber verdi ki, Bâbası Eşlem şöyle demiştir: Ben Umer ibnu'l-Hattâb'ı gördüm, O Haceri Esved'i öp­tü de: Eğer Rasûlullah'in seni öptüğünü görmeseydim, seni Öpmezdim, dedi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 1611,
			"arabicnumber": 1611,
			"text": "Bize Hammâd ibn Zeyd tahdîs etti ki, ez-Zubeyr ibnu Arabî şöyle demiştir: Bir kimse, îbn Umer'e, Haceri Esved'in isti'lâm edilmesinin hükmünü sordu. İbn Umer de: Ben Rasûlullah'ın Ha­ceri Esved'i isti'lâm ettiğini,(yani eliyle dokunduğunu) ve onu öptüğünü gördüm, diye cevâb verdi. Zubeyr ibn Arabî dedi ki: Ben îbn Umer'e: Eğer dar yerde kıstırılıp sıkıştırılırsam ne dersin? Zor ve kuvvetle oraya varmaktan yenilmiş olursam ne dersin? diye sordum. îbn Umer (bu suâllerden hadîse aykırı re'y ve ictihâd ileri sürüldüğünü anlayıp üzülerek): Ey sorucu! Sen bu \"Eraeyte - Ne re'y edersin\" sorularını Yemen'de kıl! Ben Rasûlullah (sallallahü aleyhi ve sellem)'ı bu taşı isti'lâm ederken ve onu öperken gördüm, dedi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 1612,
			"arabicnumber": 1612,
			"text": "İbn Abbâs (radıyallahü anh) şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem) bir deve üzerinde Beyt'i tavaf etti. Haceri Esved hizasına her gelişinde(elin­deki deynekle) ona işaret etti",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 1613,
			"arabicnumber": 1613,
			"text": "Bize Hâlid el-Hazzâ, İkrime'den tahdîs etti ki, İbn Abbâs(radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) bir deve üzerinde Beyt'i tavaf etti. Bu tavafta Haceri Esved rüknüne her geldikçe, yanında bulu­nan birşey ile Haceri Esved'e işaret etti ve Allâhu Ekber diye tekbîr getirdi . hadîsi Hâlid el-Hazzâ'dan rivayet etmekte Hâlid ibn Abdillah et-Tahmân'a, İbrahim ibn Tahmân el-Herevî mutâbaat etmiştir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 1615,
			"arabicnumber": 1615,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 1616,
			"arabicnumber": 1616,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 1617,
			"arabicnumber": 1617,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 1618,
			"arabicnumber": 1618,
			"text": "Buhârî dedi ki: Bana Amr ibn Alî söyledi: Bize Ebû Âsım en-Nebîl(212) tahdîs etti : İbn Cureyc(150) şöyle dedi: Bana Atâ ibn Ebî Rebâh (114) haber verdi: îbnu Hişâm (Hacc emirliği sırasın­da) kadınların erkeklerin beraberinde tavaf etmelerini men' ettiği za­man bu Atâ, (İbrâhîm ,ibn Hişâm'a veya kardeşi Muhammed ibn Hişâm'a): Peygamber'in kadınları erkeklerin beraberinde tavaf et­miş oldukları hâlde, sen bu kadınları nasıl men' edersin? demiştir. İbn Cureyc dedi ki: Ben Atâ'ya: Kadınların, erkeklerin beraberinde yaptıkları o tavafları, hicâb âyetinin (el-Ahzâb: 35) inişinden sonra mı, yâhud evvel miydi? diye sordum. Atâ: Evet, ömrüme yeminle söylü­yorum, ben hicâb âyetinden sonra o kadınların, erkeklerin berabe­rinde tavaf ettiklerine eriştim, dedi. Cureyc dedi ki: Ben Atâ'ya: Kadınlar erkeklere nasıl karışırlar? diye sordum. Atâ: Kadınlar erkeklere karışmazlardı. Âişe (radıyallahü anha) erkeklerden ayrı bir yerde tavaf eder ve erkeklere karışmazdı. Âişe ile beraber tavaf eden (Dıkre isminde) bir kadın, Âişe'ye: Ey Mü'minlerin Anası! Haydi yürü de Haceri Esved'e el sürüp isti'lâm ede­lim, dedi. Âişe ona: Benden ayrıl, dedi ve (el sürmek suretiyle) isti'lâmdan çekindi. Âişe ve arkadaşları geceleyin tanınmaz hâlde (veya örtülü oldukları hâlde) çıkarlar ve erkeklerin beraberinde tavaf eder­lerdi. Lâkin bu kadınlar Beyt'in içine girdiklerinde, oradan çıkacak­ları zamana kadar, erkekler Beyt'ten çıkarılmış olduğu hâlde içeride ibâdetle kaaim olurlardı, dedi. Atâ: Ben(Peygamber devrinde doğmuş olup Mekke Kaadısı bulunan) Ubeyd ibn Umeyr ile birlikte, Âişe, Muzdelife'deki Sebîr Dağı'nın içinde mücavir, yânı ikaamet edici hâlde iken, Âişe'nin yanına gider idim, dedi. İbn Cureyc dedi ki: Ben Atâ'ya: Âişe'nin o günkü hicabı ne idi? diye sordum. Atâ: Âişe o gün keçeden yapıl­mış bir küçük Türk çadırı içinde idi. Çadırın bir perdesi vardı. Âişe ile bizim aramızda bundan başka birşey yoktu. Ben Âişe'nin üzerin­de gül rengi ile boyanmış bir gömlek gördüm, dedi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 1619,
			"arabicnumber": 1619,
			"text": "Peygamber'in zevcesi olan Ümmü Seleme şöyle demiştir: Ben(hacc esnasında) rahatsız olduğumu Rasûlullah'a söyle­dim. \"Halkın arka tarafından deveye binerek tavaf et!\" buyurdu. Ben de öylece tavaf ettim. O sırada Rasûlullah Beyt'in tâ yanında namaza durmuş, sabah namazı kıldırıyor, namaz içinde de Vet-Tûri ve Kita­bin Mestûrin sûresini okuyordu",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 1620,
			"arabicnumber": 1620,
			"text": "îbn Cureyc tahdîs edip şöyle demiştir: Bana Süley­man el-Ahvel haber verdi; ona da Tâvûs, İbn Abbâs (radıyallahü anh)'tan haber verdi. Peygamber (sallallahü aleyhi ve sellem) Kâ'be'yi tavaf ederken, elini diğer bir insanın eline bir kayışla yâhud bir iple yâhud bunlardan başka bir şeyle bağ­lamış bir insanın yanından geçti. Peygamber, kendi eliyle bu bağı kopardı. Bundan sonra da onun yanındaki adama: \"Bu insanı eliyle yed, götür!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 1621,
			"arabicnumber": 1621,
			"text": "Bize Ebû Âsım, îbn Cureyc'den; o da Süleyman el-Ahvel'den; o da Tâvûs'tan; o da İbn Abbâs (radıyallahü anh)'tan tahdîs etti ki, Pey­gamber (sallallahü aleyhi ve sellem) Kâ'be'de bir yular yâhud bundan başka bağlayacak bir bağ ile tavaf eder bir kimse gördü de, onun bağını kopardı",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 1622,
			"arabicnumber": 1622,
			"text": "Ebû Hureyre şöyle haber vermiştir: Ebû Bekr es-Sıddîk, Veda Haccı'ndan bir sene evvel Rasûlullah tarafından hacc emîri olarak Mekke'ye gönderildiği haccda, Ebû Bekr de Ebû Hureyre'yi, kurbân bayramının ilk günü Minâ'da büyükçe bir topluluk içinde halka şu iki maddeyi i'lân etmeye yollamıştır: \"Ey insanlar! İyi biliniz! Bu yıldan sonra hiçbir müşrik hacc yapamaz, ve çıplak kişi de Ka'be'yi tavaf edemez",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 1624,
			"arabicnumber": 1624,
			"text": "Amr ibn Dînâr dedi ki: Ben Câbir ibn Abdillah'a da aynı şeyi sordum; Câbir: Safa ile, Merve arasını dolaşıp sa'y etmedikçe erkek, kadınına yaklaşmaz, diye cevâb verdi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 1625,
			"arabicnumber": 1625,
			"text": "İbn Abbâs (radıyallahü anh) şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem) -Veda Haccı'nda Mekke'ye- geldi, Beyt'i tavaf etti, Safa ile Merve arasın­da sa'y etti ve bu tavafından sonra tâ Arafat'tan dönünceye kadar Ka'be'ye yaklaşmadı",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 1626,
			"arabicnumber": 1626,
			"text": "Bize Mâlik, Muhammed ibn Abdirrahmân'dan; o da Urve'den; o da Ebû Seleme'nin kızı Zeyneb'den tahdîs etti ki, Ümmü Seleme (radıyallahü anh): Ben Rasülullah'a rahatsızlığımı arzettim... demiş­tir. H ve yine bana Muhammed ibn Harb tahdîs edip şöyle dedi: Bi­ze Ebû Mervân Yahya ibnu Ebî Zekeriyyâ el-Gassânî, Hişâm'dan; o da Bâbası Urve'den; o da Peygamber'in zevcesi Ümmü Seleme'den tahdîs etti (O, şöyle demiştir): Rasûlullah Mekke'de iken Ümmü Seleme de(radıyallahü anhahatsızlığı sebebiyle) henüz tavaf etmemişken, Rasûlullah ve Ümmü Seleme (Harem'den veya Mekke'den) çıkmak istediklerin­de, Rasûlullah Ümmü Seleme'ye: \"Sabah namazı ikaamei edildiği zaman insanlar namaz kılarlarken, sen devenin üzerinde tavaf et!\" buyurdu. Seleme böyle yaptı ve tavaf namazı kılmadan dışarı çık­tı",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 1627,
			"arabicnumber": 1627,
			"text": "Bize Amr ibnu Dînâr tahdîs edip şöyle dedi: Ben İbn Umer (radıyallahü anh)'den işittim; şöyle diyordu: Peygamber(sallallahü aleyhi ve sellem) Mekke'ye geldi. Beyt'i yedi kerre dolaşıp tavaf etti. Müteakiben Makaam'ın arkasın­da iki rek'at namaz kıldı. Sonra da Peygamber (sallallahü aleyhi ve sellem) sa'y yapmak için Safâ'ya çıktı. Yüce Allah da zâten: \"And olsun, Allah Elçisnde sizin için güzel bir uyma numunesi vardır...\" (el-Ahzâb: 21) buyurmuş­tur",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 1628,
			"arabicnumber": 1628,
			"text": "Âişe (radıyallahü anha) şöyle demiştir: Bir takım insanlar sabah namazından sonra Beyt'i tavaf ettiler, sonra da bir vaizin huzurunda oturdular. Nihayet güneş doğduğu zaman kalkıp namaza koyuldu­lar. Bunun üzerine Âişe (radıyallahü anha): Bunlar oturdular; nihayet içinde namaz kılmak mekruh kılınan şu saatte kalkmış, namaz kılıyorlar, demiştir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 1629,
			"arabicnumber": 1629,
			"text": "Bize Mûsâ ibnu Ukbe, Nâfi'den tahdîs etti ki, Ab­dullah ibn Umer (radıyallahü anh) şöyle demiştir: Ben Peygamber (sallallahü aleyhi ve sellem)'den işittim, O, güneşin doğması sırasında ve bir de batışı sırasında namaz kılmak­tan nehyediyordu",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 1631,
			"arabicnumber": 1631,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 1632,
			"arabicnumber": 1632,
			"text": "Bize Hâlid et-Tahhân, Hâlid el-Hazzâ'dan; o da îbn Abbâs'tan tahdîs etti(o, şöyle demiştir): Rasûlullah(sallallahü aleyhi ve sellem) bir deve üze­rinde olduğu hâlde Beyt'i tavaf etti. Haceri Esved rüknüne geldikçe ona elindeki bir şeyle işaret edip, tekbîr getirdi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 1633,
			"arabicnumber": 1633,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 1634,
			"arabicnumber": 1634,
			"text": "İbn Umer (radıyallahü anh) şöyle demiştir: Abbâs ibnu Abdilmuttalib (radıyallahü anh) hacılara su (ve şerbet) dağıtmak için Minâ gecelerinde Mekke'de ikaâmet etmek üzere Rasûlullah'tan izin istedi. Rasûlullah da ona izin verdi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 1635,
			"arabicnumber": 1635,
			"text": "Bize Hâlid et-Tahhân, Hâlid el-Hazzâ'dan; o da İkrime'den; o da İbn Abbâs (radıyallahü anh)'tan tahdîs etti (o, şöyle demiştir): Rasû­lullah (sallallahü aleyhi ve sellem) Harem'deki şerbet dağıtılan sebîl yerine geldi ve şerbet istedi. Abbâs, oğluna: Ey Fadl, anana git de yanındaki (husûsî) şerbetten Rasûlul­lah'a getir! dedi. (Hayır.) Bana bu şerbetten ver!\" buyurdu. Abbâs: Yâ Rasûlallah! Halk buradaki şerbete ellerini sokuyorlar! dedi.; Rasûlullah: \"İşte halkın içtiği bu şerbetten ver!\" buyurdu. Abbâs'ın sunduğu umûmî şerbetten içti. Sonra Rasûlullah Zemzem Kuyusu'na geldi. Abbâs oğulları (burada hacılara) su içiriyorlardı ve kuyudan su çekiyorlardı. Rasûlullah: (Ey Abdulmuttalib oğulları,) çekiniz! Siz hayırlı bir iş yapı­yorsunuz, dedi. Rasûlullah: \"Halkın (sallallahü aleyhi ve sellemu çekişine uymak için)kalabalık etmesi endîşesi olmasaydı ben de devemden iner, hattâ -kuyunun ipini, eliyle omuzuna işaret ederek- şuraya kor, sizin gibi su çekerdim\" buyurdu",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 1636,
			"arabicnumber": 1636,
			"text": "Enes ibn Mâlik dedi ki: Ebû Zerr (radıyallahü anh) bu Mi'râc kıssasını şöyle tahdîs eder idi: Rasûlullah (sallallahü aleyhi ve sellem) şöyle buyurdu: \"Ben Mek­ke'de iken içinde bulunduğum evin tavanı yarıldı. Cibril aleyhi's-selâm indi. Göğsümü yardıktan sonra içini Zemzem suyu ile yıkadı. Sonra hikmet ve îmân ile dolu altın bir leğen getirip, içindekini göğsümün içine boşalttı. Sonra göğsümü kapattı. Sonra elimden tutup beni dünyâ semâsına doğru çıkardı. Cibril oranın, yâni yere en yakın semânın bekçisine \"Aç!\" dedi. Bekçi: Kimdir o? dedi. Cibril: Ben Cibril'im” de­di",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 1637,
			"arabicnumber": 1637,
			"text": "İbnu Abbâs (radıyallahü anh) şöyle tahdîs etmiş: Ben Rasûlullah'a zemzem suyundan sundum. O da ayakta olduğu hâlde içti, demiştir. el-Ahvel dedi ki: İbn Abbâs'ın âzâdlısı İkrime Allah adıy­le yemîn edip: Rasûlullah(sallallahü aleyhi ve sellem), îbn Abbâs'ın kendisine Zemzem suyundan içirdiği gün, muhakkak deve üzerinde bulunuyordu, dedi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 1638,
			"arabicnumber": 1638,
			"text": "Âişe (radıyallahü anha) şöyle demiştir: Biz Rasûlullah'ın beraberin­de Veda Haccı'na çıktık, ve umre niyetiyle ihrama girip telbiye ettik. Sonra Rasûlullah (sallallahü aleyhi ve sellem): \"Beraberinde hedy kurbânı olan, hacc ve um­re niyetiyle ihram edip, telbiye eylesin. Sonra bu ikisini bitirinceye kadar ihramdan çıkmasın\" buyurdu. Nihayet ben hayızlı olarak Mek­ke'ye geldim. Haccımızı yapıp tamamladığımızda, Rasûlullah beni Abdurrahmân'ın beraberinde Ten'îm mevkiine gönderdi. Ben ora­dan umre için ihrama girip, umremi yaptım. Rasûlullah: \"İşte bu um­re, senin yapacağın umrenin yerinedir\" buyurdu. Umre niyetiyle ihrama girip telbiye etmiş olanlar, Mekke'de tavaf ve sa'yi yaptıktan sonra ihramdan çıktılar. Sonra da Minâ'dan dönmelerinin ardından hacc için diğer bir tavaf daha yaptılar. Amma (yanlarında hedy olan­larla) hacc ile umreyi (bir ihramda) cem' etmiş olanlara gelince, bun­lar bir tavaf yaptılar . ibnu Uleyye, Eyyûb'dan; o da Nâfi'den tahdîs etti(Nâfi şöyle demiştir): İbnu Umer'in binek devesi hacc yolculuğu için evinde hazırlanmış bulunduğu sırada oğlu Abdullah ibn Abdillah yanına girdi de: Ben bu yıl insanlar arasında bir harb olacağın­dan ve bu sebeble onların seni Beyt'i ziyaretten men' edeceklerinden endîşe ediyorum. Onun için bu yıl hacca gitmesen de evinde ikaamet etsen! dedi. Bunun üzerine İbn Umer: Rasülullah (sallallahü aleyhi ve sellem) umre için yola çıktı. Kureyş kâfirleri O'nunla Beyt arasında perde oldular. Eğer be­nimle Beyt arasına mâni' olunursa, ben de Rasûlullah'm yaptığı gibi yaparım:\"And olsun Allah Elçisinde sizin için güzel bir uyma nu­munesi vardır \". (el-Ahzâb: 21) dedi. Sonra da: Ben sizi şâhid kılıyorum. Ben umremle beraber bir haccı kendime vâcib kıldım (yani kıran haccına niyet ettim), dedi. Oğlu Abdullah dedi ki: Bundan sonra baham İbn Umer (Arafat'ta vukuftan sonra Minâ'dan Mekke'ye) geldi ve hacc ile umresi için bir tek tavaf yaptı",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 1639,
			"arabicnumber": 1639,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 1640,
			"arabicnumber": 1640,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 1642,
			"arabicnumber": 1642,
			"text": "Bana annem Esma bintu Ebî Bekr haber verdi ki, kendisi ve kızkardeşi Âişe,Zubeyr, fulân ve fulân kimseler umre niyetiyle ihrama girip telbiye etmişler, bunlar Haceri Esved'i isti'lâm edip el sürdükleri, yani tavafı ve sa'yi tamamladıkları zaman ihramdan çıkmışlardır",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 1643,
			"arabicnumber": 1643,
			"text": "Urve şöyle demiştir: Ben Âişe'ye şöyle sordum: Yüce Allah'ın \"Şübhesiz Safa ile Merve Allah'ın alametlerindendir. İşte kim o Beyt'i hacc ve umre kasdıyle ziyaret ederse, bunları güzelce tavaf etmesinde üzerine bir beis yoktur. Kim gönüllü olarak (vâcib olmayan amellerden) bir hayr işlerse (mükâfatını görür). Çünkü Al­lah tâatlerin ecrini veren, hakkıyle bilendir\"(el-Bakara: 158) kavli hak­kında ne re'y edersin? Yemîn ederim ki, Safa ile Merve arasında sa'y etmemek hiç kimse üzerine bir günâh olmaz, dedim. Ey kardeşim oğlu, sen fena söz söyledin! Eğer bu âyetin ma'nâsı (hükmü) senin te'vîl ettiğin gibi (sallallahü aleyhi ve sellema'y mubah) olsaydı, âyet \"Sa­fa ile Merve arasında sa'y etmemekte günâh yoktur'' suretinde olurdu. Şu kadar ki, bu âyet Ensâr hakkında indirilmiştir. Ensâr müslümân olmalarından önce, Müşellel mevkii yanında bulunup kendisine ibâ­det edegeldikleri Tâğıye Menât putu için ihrama girip telbiye ederler­di. İşte Ensâr'dan ihrâmlanan kimseler (kendi putları karşısında dikili bulunan) Safa ile Merve putları arasında sa'y etmeyi günâh sayarlar­dı. Ensâr müslümân oldukları zaman müşkil saydıkları bu vaziyeti Rasûlullah'a şöyle sordular: Yâ Rasûlallah! Bizler Safa ile Merve arasında sa'y etmeyi günâh sayıyorduk(bu iş bize ağır geliyor), dediler. üzerine Yüce Allah \"Şübhesiz Safa ile Merve Allah 'ın alâ­metlerindendir...\" âyetini indirdi. Âişe(radıyallahü anha): Rasûlullah Safa ile Merve arasında dolaşıp sa'y etmeyi kendi fiili ile de kaanûnlaştırmıştır. Artık bu iki tepe arasında dolaşmayı, yani sa'yi terketmek kimse için caiz değildir, demiştir. dedi ki: Âişe'nin bu hadîsini Abdurrahmân'ın oğlu Ebû Bekr'e haber verdim(ve bu konudaki bilgisini sordum). O bana ce­vaben şöyle dedi: Âişe'nin Câhiliyet devrinde Safa ile Merve arasında sa'yi günâh sayan bir zümre bulunduğunu haber vermesi, şübhesiz ki bir ilim­dir. Fakat ben bunu işitmiş değilim. Ben ilim ehli olan birçok kimselerden işittim ki, onlar şöyle zikrediyorlardı: Âişe'nin haber ver­diği Menât için ihrama girmekte olan bu zümreden başka, Ensâr'­dan bir zümre daha vardı. Bunların hepsi de bil'akis Câhiliyet devrinde Safa ile Merve arasında tavaf ederlerdi. İslâm devri gelip, Yüce Al­lah \"... O kadîm Beyt'i tavaf etsinler\"(el-Hacc: 29) kavliyle Beyt'i ta­vaf etmeyi zikredip de Safa ile Merve tavafı Kur'ân'da zikredilmeyince, bunlar: Yâ Rasûlallah! Biz öteden beri Safa ile Merve arasında tavaf ederdik. Allah Beyt'i tavaf emrini indirdiği hâlde, Safa ile Merve ara­sında sa'yi zikretmedi. Biz Safa ile Merve arasında sa'y edersek, bize günâh var mıdır? diye sordular. üzerine Yüce Allah: \"Şübhesiz Safa ile Merve Allah'ın alâmetlerindendir. İşte kim o Beyt’i hacc veya umre kasdı ile ziyaret ederse, bunları güzelce tavaf etmesinde üzerine bir günâh yoktur. Kim gönlünden bir hayr işlerse (mükâfatını görür). Çünkü Allah tâatle-rin ecrini veren, hakkıyle bilendir\"(el-Bakara: 158) âyetini indirdi . Yine Abdurrahmân oğlu Ebû Bekr devam edip şöyle dedi: Ben bu el-Bakara: 158. âyetinin Ensâr ve Arablar'ın diğer bir kavminden oluşan her iki fırka hakkında, yani hem Câhiliyet dev­rinde Safa ile Merve arasında tavaf etmeyi günâh sayanlar fırkası, hem de Câhiliyette Safa ile Merve arasını tavaf edegeldikleri hâlde sonradan İslâm devrinde Allah'ın Beyt'i tavafı emredip de (el-Hacc: 29) Safa ve Merve'yi zikretmediği için Safa ile Merve arasını tavaf etme­yi günâh sayanlar fırkası hakkında indiğini işitirim. Nihayet Allah Beyt'i tavafı zikretmesinin (el-Hacc: 29) ardından, bu Safa ile Merve arasında sa'yi de (el-Bakara: 158) zikretti (yani el-Bakara: 158. âyetinin inmesi, el-Hacc: 29 âyetinin inmesinden sonra oldu)",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 1644,
			"arabicnumber": 1644,
			"text": "İbn Umer (radıyallahü anh) şöyle demiştir: Rasülullah (sallallahü aleyhi ve sellem), geliş tavafı olan ilk tavafı yaparken ilk üç dolaşmayı hızlı, dört dolaşmayı ise(âdet olan yürüyüşle) yürürdü. Safa ile Merve arasında dolaşır­ken de sel yerinin karnında (bugünkü iki yeşil sütûncuk arasında) ko­şardı. Râvî dedi ki: Ben, Nâfi'e: Abdullah ibn Umer, Yemen tarafındaki köşeye ulaştığı zaman yürür müydü? diye sordum. Nâfi': Hayır, ancak rükn üzeri kalabalık ve sıkışık olması hâlinde yü­rürdü. Çünkü İbn Umer, rüknü isti'lâm etmedikçe terketmezdi . Amr ibn Dînâr şöyle demiştir: Biz İbn Umer'e: Eğer bir kimse umre niyetiyle Beyt'i tavaf eder de Safa ile Mer­ve arasını dolaşmazsa(ihramdan çıkıp) kadınına gelebilir mi? Diye sorduk. Umer: Peygamber(sallallahü aleyhi ve sellem) -umre için- Mekke'ye geldi. Beyt'i yedi defa dolaştı, Makaam'ın arkasında iki rek'at namaz kıldı, akabinde Safa ile Merve arasını da yedi kerre dolaştı. \"And olsun, Allah Elçisinde sizin için çok güzel bir uyma örneği vardır”(el-Ahzâb: 21), dedi. dedi ki: Biz Câbir ibn Abdillah'a da aynı şeyi sorduk. Cabir de: Safa ile Merve arasında sa'y etmedikçe, kadına sakın yaklaşmasın, dedi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 1646,
			"arabicnumber": 1646,
			"text": "Bize Mekkî ibnu İbrâhîm tahdîs etti ki, İbn Cureyc şöyle demiştir: Bana Amr ibnu Dînâr haber verip şöyîe dedi: Ben İbn Umer (radıyallahü anh)'den işittim, şöyle dedi: Peygamber(sallallahü aleyhi ve sellem) Mekke'ye geldi, Beyt'i tavaf etti, sonra iki rek'at namaz kıldı, Sonra Safa ile Merve arasın­da sa'y etti. Sonra da \"And olsun, Allah Elçisinde sizin için güzel bir uyma örneği vardır\" (el-Ahzâb: 21) âyetini okudu",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 1647,
			"arabicnumber": 1647,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 1648,
			"arabicnumber": 1648,
			"text": "Bize Asım ibn Süleyman haber verip şöyle dedi: Ben Enes ibn Mâlik'e: Sizler Safa ile Merve arasında sa'y etmeyi çirkin görüyor muydunuz? diye sordum. Evet. Çünkü bu sa'yler, Allah \"Şübhesiz Safa ile Merve Allah alâmetlerindendir, İşte kim o Beyt’i hacc veya umre niyetiyle ziyaret ederse, bunları güzelce tavaf etmesinde üzerine bir günâh yok­tur... \" (el-Bakara: 158) âyetini indirinceye kadar, Câhiliyet alâmetlerin­den idi, diye cevâb verdi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 1649,
			"arabicnumber": 1649,
			"text": "el-Humeydî şunu ziyâde edip şöyle dedi: Bize Sufyân ibn Uyeyne tahdîs edip şöyle dedi: Bize Amr tahdîs edip şöyle dedi: Ben Atâ'­dan işittim, İbn Abbâs'tan yukarıki hadîsin benzerini rivayet etti",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 1650,
			"arabicnumber": 1650,
			"text": "Âişe (radıyallahü anha) şöyle demiştir: Ben Mekke'ye hayızlı olarak geldim. Ka'be'yi de, Safa ile Merve arasını da tavaf etmedim. Âişe dedi ki: Ben bu hâlimi Rasûlullah'a şikâyet ettim. Rasûlullah(sallallahü aleyhi ve sellem): \"Ha­cının yapacağı işleri sen de yap, şu kadar ki, sen ancak temiz olunca­ya kadar Beyt'i tavaf etme!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 1651,
			"arabicnumber": 1651,
			"text": "Bize Muhammed ibnu'l-Musennâ tahdîs edip şöyle dedi: Bize Abdulvahhâb tahdîs edip şöyle dedi: Müellif Buhârî dedi ki: Ve yine bana Halîfe ibn Hayyât söyledi. Bize Abdulvahhâb tahdîs edip şöyle dedi: Bize Habîbun el-Muallimu, Atâ'dan tahdîs etti ki, Câbir ibn Abdillah şöyle demiş­tir: Peygamber (sallallahü aleyhi ve sellem) ve sahâbîleri hacc için ihrama girdiklerinde, Pey­gamber ile Talha'dan, bir de Yemen'den gelen Alî'den başka sahâbîlerden hiçkimsenin beraberinde kurbanlığı yoktu. Alî, Yemen'­den kurbânı beraberinde olarak Mekke'ye geldi ve ben Peygamber'in ihrama girdiği gibi ihrâmlandım, dedi.(Biz Mekke'ye geldiğimizde) Peygamber, sahâbîlerine, ihrama girerken niyet ettikleri haccı umre­ye çevirmelerini, tavaf ve sa'y yapmalarını, sonra saçlarını kısaltma­larını ve ihramdan çıkıp halâl olmalarını; yalnız yanında kurbanlığı bulunanların ihramlarından çıkmamalarını emretti. (Haccı feshedip, um­reye çevirmeye me'mûr olan sahâbîler, bu hâle taaccüb ederek:) Bizler herbirimizin cinsiyet âletleri menî damlatır hâlde mi Minâ'ya gideceğiz? dediler. arasında söylenen bu söz Peygamber'e ulaşınca, cevaben: \"İşimden şimdi bildiğimi (yânı hacc aylarında umrenin caiz olduğunu şimdi bildiğim gibi) ihrama girerken de bilmiş olaydım, kur­bân sevketmezdim. Ve yanımda kurbânım olmasaydı, şimdi ben de sizin gibi ihramdan çıkardım\" buyurdu. Âişe hayz oldu da bütün hacc fiillerini yerine getirdi, yalnız Beyt'i tavaf etmedi. Nihayet temizlenince Beyt'i tavaf etti. Âişe: Yâ Rasûlallah, sizler bir hacc ve bir umre ile gidiyorsunuz, ben ise yalnız bir hacc ile gidiyorum, dedi. üzerine Rasûlullah, Ebû Bekr'in oğlu Abdurrahmân'a Âişe'nin beraberinde Ten'îm'e kadar çıkmasını emretti. Âişe de haccdan sonra oradan bir umre yaptı",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 1652,
			"arabicnumber": 1652,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 1653,
			"arabicnumber": 1653,
			"text": "Abdulazîz ibnu Rufey' şöyle demiştir: Ben Enes ibn Mâlik'e sordum ve: Peygamber (sallallahü aleyhi ve sellem)'den hatırladığın bir şeyi, yani zu’l-hiccenin sekizinci günü öğle ile ikindi namazlarını nerede kıldığını bana haber verir misin? dedim. Minâ'da kıldı, dedi. Ben: Minâ'dan dönüş günü ikindi namazını nerede kıldı? dedim. Enes: Muhassab'da) kıldı, dedi. Bundan sonra Enes, ben Abdulazîz'e: Sen de emirlerinin işleyeceği gibi işle, dedi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 1654,
			"arabicnumber": 1654,
			"text": "Bize Abdulazîz ibnu Rufey' tahdîs edip şöyle dedi: Enes'e kavuştum. H Buhârî dedi ki: Ve bana Ismâîl ibn Ebân tahdîs edip şöyle dedi: Bize Ebû Bekr ibn Ayyaş tahdîs etti ki, Ab­dulazîz şöyle demiştir: Ben terviye günü Minâ'ya çıktım ve Enes'e bir eşek üzerinde giderken kavuştum. Ve kendisine: Peygamber (sallallahü aleyhi ve sellem) bu gün öğle namazını nerede kıldı? dedim. Enes: Sen emirlerinin kı­lacağı yeri gözetle de, sen de orada kıl! dedi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 1655,
			"arabicnumber": 1655,
			"text": "İbn Şihâb şöyle demiştir: Bana Abdullah ibnu Umer'in oğlu Ubeydullah, Bâbasından haber verdi. O: Rasûlullah (sallallahü aleyhi ve sellem) Minâ'da (dört rek'atlı farzları) iki rek'at kıldı. Ebû Bekr ile Umer de, ve halifeliğinin başlarında Usmân da böyle kıldılar",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 1656,
			"arabicnumber": 1656,
			"text": "Harise ibn Vehb el-Huzâî (radıyallahü anh): Peygamber (sallallahü aleyhi ve sellem), biz en çok ve en ziyâde korkusuz olduğumuz hâlde bizlere Minâ'da namazı iki rek'at kıldırdı, demiştir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 1657,
			"arabicnumber": 1657,
			"text": "Abdullah ibn Mes'ûd (radıyallahü anh): Ben Peygamber’in maiyyetinde Minâ'da iki rek'at kıldım. Ebû Bekr'in maiyyetinde iki rek'­at kıldım. Umer'in maiyyetinde iki rek'at kıldım. Sonra sizin yollarınız ayrıldı. Âh nasibim o dört rek'at olacağına, keski kabul olunmuş iki rek'at olsa! demiştir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 1658,
			"arabicnumber": 1658,
			"text": "Bize Salim Ebu'n-Nadr tahdîs edip şöyle dedi: Ben Ümmü'l-Fadl'ın âzâdlısı Umeyr'den işittim; o da Ümmü’l-Fadl Lubâbe'den. Lubâbe (radıyallahü anh): Arafat'ta arefe günü Peygamber (sallallahü aleyhi ve sellem)'in orucu (yani oruçlu olup olmadığı) hususunda insanlar şübhe ettiler. Ben Peygamber'e bir (bardak) şerbet gönderdim, O da bu şerbeti içti, demiş­tir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 1659,
			"arabicnumber": 1659,
			"text": "Bize Mâlik, Muhammed ibn Ebî Bekr es-Sakafî'den haber verdi ki, o, Enes ibn Mâlik ile birlikte Minâ'dan Arafat'a doğ­ru kuşluk vaktinde giderlerken, Enes ibn Mâlik'e: Sizler bu arefe gününde Rasülullah'ın beraberinde iken nasıl yapardınız? diye sormuş. de: Bizden telbiye etmek isteyen telbiye eder, inkâra uğramazdı; tekbîr etmek isteyen tekbîr eder, o da inkâra uğramazdı, demiştir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 1660,
			"arabicnumber": 1660,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 1661,
			"arabicnumber": 1661,
			"text": "Ümmü’l-Fadl bintu'l-Hâris şöyle demiştir: Bir takım insanlar arefe günü Peygamber'in orucu hakkında ben Ümmü’l-Fadl'in yanında ihtilâf ettiler. Bâzısı Peygamber oruçludur dedi, bâzısı da oruçlu değildir dedi. Bunun üzerine ben Peygambere, kendisi Ara­fat'ta devesi üzerinde vakfe yapmakta iken bir bardak süt gönder­dim, O da bu sütü içti",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 1662,
			"arabicnumber": 1662,
			"text": "İbn Şihâb şöyle demiştir: Bana Salim şöyle haber verdi: ibn Yûsuf, Abdullah ibnu'z-Zubeyr'le harb etmek üzere Mek­ke'ye indiği 73 senesinde, Abdullah ibn Umer'e: Arefe günü vakfe yerinde nasıl yaparsınız? diye sordu. Salim, Haccâc'a: Eğer sünnete uymak istersen arefe günü namazı sıcağın şiddetli zamanında kıl, de­di. (Haccâc'ın tereddüdlü bakışı üzerine Sâlim'in Bâbası) Abdullah ibn Umer: Salim doğru söyledi, dedi. Çünkü onlar sünnette öğle ile ikindi namazlarını birleştiriyorlardı. İbn Şihâb dedi ki: Ben Sâlim'e: Rasûlullah (sallallahü aleyhi ve sellem) böyle mi yapmıştır? dedim. Salim: Sizler bu fiillerde ancak O'nun sünnetine uymaktasınız, dedi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 1663,
			"arabicnumber": 1663,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 1664,
			"arabicnumber": 1664,
			"text": "Bize Muhammed ibn Cubeyr ibn Mut'ım tahdîs etti ki, Bâbası Cubeyr ibn Mut'un (radıyallahü anh): Ben bana âid bir deveyi arıyordum.. . demiştir. H ve yine bize Müsedded tahdîs edip şöyle dedi: Bi­ze Sufyân, Amr'dan tahdîs etti ki, Amr, Muhammed ibn Cubeyr'den, o da Bâbası Cubeyr ibn Mut'ım'den şöyle dediğini işitmiştir: Ben arefe günü bir devemi kaybetmiş ve onu aramağa gitmiştim. Bu sırada Peygamber (sallallahü aleyhi ve sellem)'i Arafat'ta vakfe ederken gördüm ve: Vallâhî burada vakfe yapan bu zât hums (yani ahmesler)dendir. Fakat onun hâli nedir ki, burada yani Arafat'la vakfe yapıyor? dedim",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 1665,
			"arabicnumber": 1665,
			"text": "Bize Alî ibnu Mushir tahdîs etti ki, Hişâm ibn Urve şöyle demiştir: Urve şöyle dedi: İnsanlar Câhiliyet'te Ka'be'yi çıplaklar olarak tavaf ederlerdi, bundan ancak ahmesler müstesna idi­ler. Ahmesler ise Kureyş ile onun doğurduğu diğer kabilelerden ibaretti. Bu ahmesler diğer insanlara Allah rızâsı için âriyeten elbise­ler verip sevâb ümîd ederlerdi. Erkek erkeğe elbise verir, bu ariyet elbiseyi alan kişi de aldığı bu elbise ile tavaf yapardı. Kadın kadına elbise verir, o da elbiseli olarak tavaf ederdi. Hums ferdlerinden bi­rinin elbise vermediği kişi ise Ka'be'yi çıplak olarak tavaf ederdi. Ve keza diğer insan toplulukları, Arafat'tan ifâda yaparlardı; hums ise Muzdelife'den ifâda yaparlardı. dedi ki: Bana Bâbam Urve ibnu'z-Zubeyr, Âişe'den ha­ber verdi. Şu: \"... Sonra insanların ifâda yapıp döndüğü yerden siz de dönün... \" (el-Bakara: 199) âyeti bu ahmesler hakkında inmiştir. De­di ki: Onlar (yani ahmesler) Cem'den (yani Muzdelife'den) ifâda ya­pıyorlardı, bu âyetle Arafat'a götürüldüler (yani oraya gitmekle emr olundular)",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 1666,
			"arabicnumber": 1666,
			"text": "Urve şöyle demiştir: Ben beraberinde oturur iken Usâme'ye: Veda Haccı'nda Arafat'tan Muzdelife'ye doğru ayrıldığı zaman RasûluIIah(sallallahü aleyhi ve sellem) nasıl(hareketle) yürüyordu? diye soruldu. ibn Zeyd: Rasûlullah hızlı ile yavaş yürüyüş arasında orta bir yürüyüş yürüyordu. Fakat geniş bir meydan bulduğu zaman hızlı hareket eder­di, dedi. ibn Urve: \"Nass\", \"Anak\"tan daha hızlı bir yürüyüş­tür, dedi . Abdillah el-Buhârî: \"Fecve\", geniş, hâlîyer'dir. Bunun cem'i \"Fecevât\" ve \"Ficâ\"' gelir. \"Rakve (Küçük kayık, gönden ve sahtiyandan düzülmüş küçük su kabı)\"nin de böyle \"Rakavât\" ve \"Rikâ\"'şeklinde iki cem'i vardır. \"Ve lâte hîne menâs (- Halbuki o vakit kaçma zamanı değildir)\"(sallallahü aleyhi ve sellemâd: 3) âyetindeki\"Menâs\", bu ha­dîsteki \"Nassa\" fiilinden değildir (yani \"Nassa\" mudaaf, \"Nâse\" ise vavlı ecveftir), dedi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 1667,
			"arabicnumber": 1667,
			"text": "Usâme ibn Zeyd şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem) Arafat'tan dönüşünde iki dağ arasındaki yola doğru saptı, hacetini yeri­ne getirdi ve abdest aldı. Ben: Yâ Rasûlallah! Namaz mı kılacaksınız? dedim. Rasûlullah: \"Namaz önünde (yani Müzdelife'de kılınacak) buyurdu",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 1668,
			"arabicnumber": 1668,
			"text": "Bize Cuveyriye tahdîs etti ki, Nâfi' şöyle demiştir: Abdullah ibn Umer Müzdelife'de akşam namâzıyle yatsı namazlarını bir­leştirirdi. Şu kadar ki, onun bu namazları birleştirmesi şöyle olurdu: O da yolda Rasûlullah'ın girmiş olduğu o iki dağ arası yoluna girer, orada hacetini giderip gereği gibi temizlenir (yani istincâ ve istibrâ' yapar) sonra abdest alır, fakat namaz kılmazdı. Nihayet namazları Müzdelife'de kılardı",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 1670,
			"arabicnumber": 1670,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 1671,
			"arabicnumber": 1671,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 1672,
			"arabicnumber": 1672,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 1673,
			"arabicnumber": 1673,
			"text": "İbnu Umer (radıyallahü anh) şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem) Müzdelife'de akşam ile yatsı namazlarını birleştirdi. Bu iki namazdan herbiri bir ikaametle kılındı ve Peygamber ne bu iki namaz arasında ve ne de bunlardan herbirinin ardında sünnet namazı kılmadı",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 1674,
			"arabicnumber": 1674,
			"text": "Bana Ebû Eyyûb el-Ensârî (radıyallahü anh): Rasûlullah (sallallahü aleyhi ve sellem) Veda Haccı'nda akşam ile yatsı namazlarını Müzdelife'de birleştirdi, diye tahdîs etti",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 1675,
			"arabicnumber": 1675,
			"text": "Bize Ebû İshâk tahdîs edip şöyle dedi: Ben Abdurrahmân ibnu Yezîd'den işittim, şöyle diyordu: Abdullah ibn Mes'ûd (radıyallahü anh) hacc yaptı. Müzdelife'ye geldik. Müzdelife'ye gelişimiz yatsı ezanı vakti yâhud da buna yakın bir zamanda oldu. Abdullah bir kimseye emretti. O da ezan okudu ve ikaamet getirdi. Sonra Abdullah akşam namazım kıldı. Onun arkasından da iki rek'at (sallallahü aleyhi ve sellemünnetini) kıldı. Son­ra akşam yemeğinin getirilmesini istedi ve yemeğini yedi. Sonra, zan­nediyorum ki, bir kimseye emretti de o kimse ezan ve ikaamet okudu. Râvî Amr: Ben bu \"Zannediyorum\" şekki ancak Zuheyr'dendir bi­liyorum, demiştir. Sonra yatsı namazını iki rek'at kıldı. Fecr tulü' edince (sallallahü aleyhi ve sellemabah namazını kıldı) ve: Peygamber(sallallahü aleyhi ve sellem) bu günde bu me­kânda bu namazdan başka bu saatte namaz kılmazdı, dedi. Abdulah ibn Mes'ûd şöyle devam etti: Bu ikisi (mu'tâd olan müstehâb) vakitlerinden çevirilen iki namazdırlar. Akşam namazı insanların Müz­delife'ye gelmelerinin ardından; sabah namazı da fecr meydana çı­karken kılındı. Abdullah ibn Mes'ûd: Ben Peygamber'i böyle yapar gördüm, dedi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 1676,
			"arabicnumber": 1676,
			"text": "Salim şöyle demiştir: Abdullah ibn Umer(radıyallahü anh) kendi ailesinin zaîf kişilerini önden gönderir idi de, onlar geceleyin Müzde­life'de el-Meş'aru’l-Harâm'ın yanında vakfe yaparlar, Azız ve Celîl olan Allah'ı hatırlarına gelen zikirlerle zikrederler, duâ ederler. Son­ra imâmın Minâ'da vakfe yapmasından evvel ve Minâ'ya hareketin­den önce, Minâ'ya dönerlerdi. Artık onlardan kimi Minâ'ya sabah namazı vaktinde gelir, kimi de bundan sonra gelirdi. Minâ'ya gel­dikleri zaman Akabe cemresine taşları atarlardı. İbnu Umer: Rasû­lullah (sallallahü aleyhi ve sellem) bu zaîf kimseler hakkında böyle yapmalarına ruhsat verdi der idi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 1677,
			"arabicnumber": 1677,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 1678,
			"arabicnumber": 1678,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 1679,
			"arabicnumber": 1679,
			"text": "Bana Ubeydullah ibn Ebî Yezîd haber verdi ki, o İbn Abbâs'tan: Ben Peygamber (sallallahü aleyhi ve sellem)'in, ailesinin zaîfleri içinde Müzdelife gecesinde Minâ'ya önden gönderdiği kimselerden idim, derken işitmiştir . Cureyc şöyle demiştir: Bana Esmâ'mn himaye­sinde bulunan Abdullah ibn Keysân Ebû Bekr'in kızı Esmâ'dan şöy­le tahdîs etti: Esma (radıyallahü anh): Akşamla yatsı namazlarının cem' edildiği gece Müzdelife'ye indi ve kalkıp namaz kıldı. Bir saat namaz kıldıktan son­ra(ben Abdullah'a): Ey oğlum! Ay battı mı? diye sordu. Hayır(batmadı), diye cevâb verdim. Bunun üzerine bir saat daha namaz kıldı.,Sonra yine: Ay battı mı? diye sordu. de: Evet, battı, diye cevâb verdim. Öyle ise Minâ'ya doğru yollanınız, diye emretti. de yollandık ve.yürüdük. Nihayet cemre mevkiine gelip, Aka­be cemresine taş attı. Sonra Esma, Minâ'daki menziline döndü ve bu menzilinde sabah namazını kıldı. Ben kendisine: Ey Hanım Efendi! Ben öyle sanıyorum ki, bizler meşru' olan. vakitten önce davrandık, dedim. Ey oğlum! Rasûlullah (sallallahü aleyhi ve sellem) mahfeli kadınlar için erken cemre taşlamalarına izin verdi, dedi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 1680,
			"arabicnumber": 1680,
			"text": "Âişe (radıyallahü anha): Sevde, Müzdelife gecesinde Peygamber'den (Minâ'ya erken gitmek hususunda) izin istedi. Kendisi ağır ve yavaş hareketli bir kadın idi. Peygamber ona izin verdi, demiştir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 1681,
			"arabicnumber": 1681,
			"text": "Âişe (radıyallahü anha) şöyle demiştir: Veda Haccı'nda biz Müzdelife'ye indik. Şevde bintu Zem'a, insanların izdihamından evvel ken­disinin Minâ'ya gönderilmesi hususunda Peygamber'den izin istedi. Sevde iri yapılı, yavaş hareketli bir kadındı. Peygamber Sevde'ye izin verdi. Şevde halkın izdihamından evvel Minâ'ya gitti. Biz de sabaha kadar Peygamber'in yanında kaldık. Sonra Peygamber'in hareket et­mesiyle biz de hareket ettik. Yemîn olsun Sevde'nin Rasûlullah'tan izin istediği gibi izin istemiş olmaklığım, bana kendisiyle sevinilecek şeylerin en sevgilisi olurdu",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 1682,
			"arabicnumber": 1682,
			"text": "Abdullah ibn Mes'ûd (radıyallahü anh): Ben Peygamber (sallallahü aleyhi ve sellem)'in, Müzdelife'de birleştirdiği iki namaz müstesna, hiçbir namazı(mu'tâd) vak­tinin dışında kıldığını görmedim. Müzdelife'de akşam ile yatsı namazlarını birleştirdi. Bir de sabah namazını(mu'tâd) vaktinden önce kıldı, demiştir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 1683,
			"arabicnumber": 1683,
			"text": "Abdurrahmân ibn Yezîd şöyle demiştir: Arafat'tan Abdullah ibn Mes'ûd'un beraberinde Mekke'ye doğru yola çıktık. Sonra Müzdelife'ye geldik. Abdullah akşamla yatsı namâzlarından herbirini başlı başına birer ezan ve ikaametle kıldı. Ve bu iki namaz arasını akşam yemeği ile ayırdı. Bundan sonra îbn Mes'ûd şafak sök­tüğü sırada sabah namazını (çok erken) kıldı. Hattâ kimi insan fecr tulü' etti, kimi insan da fecr tulü' etmedi diyordu. Sonra Abdullah şöyle dedi: aleyhi ve sellem) şöyle buyurdu: \"Akşam ile yatsıdan ibaret olan bu iki namaz, şu Müzdelife mevkiinde (alışılmış) vakitlerinden tahvil edilmiştir. İnsanlar, yatsı vaktine girmedikçe Müzdelife'ye gelmeye çalışmasınlar. Sabah nama­zını da -fecrin doğuşuna işaret ederek- şu saatte kılsınlar\". sonra îbn Mes'ûd tan yeri ağanncaya kadar Müzdelife'de vakfe yaptı. Sonra: Mü'minlerin Emîri (Usmân) bu saatte Müzdelife'den hare­ket etse, Peygamber'in sünnetine isabet etmiş (yani ona uygun hareket etmiş) olur, dedi. Abdurrahmân ibn Yezîd: îbn Mes'ûd bu sözü mü evveî söyledi, yâhud Usmân'ın Müzdelife'den Minâ'ya hareketi mi evvel vâki' oldu bilmiyorum. îbn Mes'­ûd, Kurbân Bayramının ilk günü Akabe cemresini taşlayıncaya kadar telbiyeye devam etti, demiştir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 1684,
			"arabicnumber": 1684,
			"text": "Ben Amr ibnu Meymûn'dan işittim, şöyle diyordu: Umer ibn Hattâb'a şâhid oldum. O, sabah namazını Müzdelife'de kıldı. Sonra(Meş'arı Harâm'da) vakfe yaptı da şöyle dedi: Müş­rikler güneş doğmadıkça Müzdelife'den Minâ'ya hareket etmezlerdi. Ve o müşrikler: Ey Sebîr Dağı -güneşin ışıklarıyle- parla (da biz Minâ'­ya gidelim), derlerdi. Peygamber (sallallahü aleyhi ve sellem) müşriklere muhalefet etti de güneş doğmazdan evvel (alaca karanlıkta) Müzdelife'den Minâ'ya doğru ha­reket etti",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 1685,
			"arabicnumber": 1685,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 1686,
			"arabicnumber": 1686,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 1688,
			"arabicnumber": 1688,
			"text": "Bize Şu'be haber verip şöyle dedi: Bize Ebû Cemre tahdîs edip şöyle dedi: Ben İbn Abbâs'a temettu'dan (hükmünden) sordum. İbn Abbâs bana temettü' yapmaklığımı emretti. Ben yine kendisine hedyden sordum. İbn Abbâs: Temettü' haccmda erkek-dişi deve, yâhud sığır, yâhud davar kurbân etmek, yâhud da deve ve sığır kurbânında ortak olmak vardır, dedi. Ebû Cemre dedi ki: Bâzı in­sanlar temettu'u hoş görmezlerdi. Ben uyudum ve ru'yâmda şöyle gör­düm: Bir insane; \"Temettü', mebrûr bir haccdır ve kabul edilmiş bir umredir\" diye nida ediyordu. Ben uyanınca İbn Abbâs'a geldim ve bu ru'yâmı kendisine söyledim. İbn Abbâs: Allâhu Ekber, (Umre ile temettü') Ebu'l-Kaasım (sallallahü aleyhi ve sellem)'in sünnetidir, dedi . dedi ki: Âdem, Vehb ibn Cerîr ve Gunder, Şu'be'den ge­len rivayetlerinde \"Kabul edilmiş bir umredir ve mebrûr (yani makbul) bir haccdır\" demişlerdir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 1689,
			"arabicnumber": 1689,
			"text": "Ebû Hureyre (radıyallahü anh,şöyle demiştir): Rasûlullah (sallallahü aleyhi ve sellem) kurbanlık devesini sevk eden bir kimse gördü de ona: \"Deveye bin!\" buyurdu. zât: Bu kurbanlıktır (nasıl binerim)? dedi. \"Bu (kurbanlık) deveye bin!\" buyurdu. zât yine: Bu kurbanlıktır, deyince, Rasûlullah üçüncü yâhud ikinci defasında: \"Yazıklar olsun sana! Bin şu deveye!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 1690,
			"arabicnumber": 1690,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 1691,
			"arabicnumber": 1691,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 1692,
			"arabicnumber": 1692,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 1693,
			"arabicnumber": 1693,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 1694,
			"arabicnumber": 1694,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 1696,
			"arabicnumber": 1696,
			"text": "Âişe (radıyallahü anha) şöyle demiştir: Ben, Peygamberin kurban­lık develerinin gerdanlıklarını kendi elimle büktüm. Sonra Peygamber o develere bu gerdanlıkları taktı, onları alâmetledi ve hepsini Harem'e hediye etti. Ve (bundan önce) kendisine halâl kılınmış olan hiçbirşey O'na haram olmadı",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 1697,
			"arabicnumber": 1697,
			"text": "(Bana Nâfi', îbnu Umer'den haber verdi ki, mü'minlerin anası Hafsa şöyle demiştir: Ben: Yâ Rasûlullah! İnsanların hâli nedir? Onlar umre ile ihram­dan çıktılar, fakat sen ihramdan çıkmadın? dedim. aleyhi ve sellem): başımın saçlarını toplayıp yapıştırdım ve kurbânıma ger­danlık taktım. Artık ben bütün hacc fiillerini bitirip ihramdan çıkın­caya kadar, ihramdan çıkamam\" buyurdu",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 1698,
			"arabicnumber": 1698,
			"text": "Âişe (radıyallahü anha) şöyle demiştir: Rasûlullah (sallallahü aleyhi ve sellem) Medine'den (Mekke'ye kurbanlık hayvan) hediye ederdi de ben O'nun kurbanlık hayvanlarının gerdanlıklarını bükerdim. Sonra Rasûlullah, ihrâmlının çekineceği şeyler nev'inden olan hiçbir şeyden çekinmezdi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 1699,
			"arabicnumber": 1699,
			"text": "Âişe (radıyallahü anha) şöyle demiştir: Ben, Peygamber'in kurban­lık hayvanlarının gerdanlıklarını büktüm. Sonra Peygamber o hayvanlara kurbanlık alâmeti çizdi ve gerdanlıklar taktı. Yâhud da hayvanlara ben gerdanlık taktım. Sonra Peygamber bu hayvanları Ka'be’ye gönderdi. Kendisi de Medine'de bir müddet daha ikaamet etti. Bu ikaamet sırasında kendisine halâl olmuş bulunan hiçbirşey O'na haram olmadı",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 1700,
			"arabicnumber": 1700,
			"text": "Abdurrahmân kızı Amre şöyle haber vermiştir: Ebû Sufyân'ın oğlu Ziyâd , Âişe'ye bir mektûb yazdı da bu mektubun­da: Abdullah ibn Abbâs: Kim Mekke'ye kurbân gönderip Ka'be'ye hediye ederse, kurbânı kesilinceye kadar hacılara ihrâmlı iken haram olan şeyler, o kimseye de haram olur, dedi.(sallallahü aleyhi ve sellemenin re'yin nedir?) di­ye sormuştu. cevaben şöyle dedi: Bu mes'ele İbnu Abbâs'ın dediği gibi değildir.(Hicretin dokuzuncu yılında) Rasûlullah'ın kurbânlarının gerdânlık iplerini iki elimle ben büktüm. Sonra Rasûlullah o kurbanlık hayvanlara bu gerdanlıkları kendi elleriyle taktı. Sonra da bu kur­banlık' hayvanları bâbam Ebû Bekr es-Sıddîk ile Mekke'ye gönderdi. İhrâmlı hacıya haram olan şeylerden hiçbirşey Rasûlullah'a haram olmadı. Bu kurbânlar(Mekke'de) kesilinceye kadar Allah O'na bu şeyleri halâl kıldı",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 1701,
			"arabicnumber": 1701,
			"text": "Âişe (radıyallahü anha): Peygamber (sallallahü aleyhi ve sellem) bir defa -Mekke'ye- kurbanlık koyun hediye etti, demiştir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 1702,
			"arabicnumber": 1702,
			"text": "Bize İbrahim, el-Esved'den tahdîs etti ki, Âişe (radıyallahü anha): Ben Peygamber (sallallahü aleyhi ve sellem) için gerdanlıklar bükerdim de, O bu gerdanlıkla­rı koyunlara takar ve kendisi ailesi içinden halâl olarak ikaamet ederdi, demiştir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 1703,
			"arabicnumber": 1703,
			"text": "Bize Mansûr ibnu'l-Mu'temir tahdîs edip şöyle dedi: H ve yine biz Muhammed ibnu Kesîr tahdîs etti. Bize Sufyân (es-Sevrî), Mansûr'dan; o da İbrahim'den; o da el-Esved'den haber ver­di ki, Âişe (radıyallahü anha): Ben Peygamber için koyunların gerdanlıklarını bü­kerdim de, Peygamber bu koyunları(Mekke'ye) gönderir, sonra da halâl olarak(Medine'de) ikaamet eder kalırdı, demiştir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 1704,
			"arabicnumber": 1704,
			"text": "Bize Zekeriyyâ, Âmir eş-Şa'bfden; o da Mesrûk'tan tahdîs etti kî, Âişe(radıyallahü anha): Ben, Peygamber'in kurbânı için ipleri büker­dim, demiş ve bununla Peygamber ihrama girmeden evvel gerdan­lıklar bükerdim demek istemiştir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 1705,
			"arabicnumber": 1705,
			"text": "Bize İbnu Avn, el-Kaasım ibn Muhammed'den tah­dîs etti ki, mü'minlerin anası Âişe (radıyallahü anha): Ben kurbanlık hayvanların gerdanlıklarını yanımda bulunan renkli bir yünden büktüm, demiş­tir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 1706,
			"arabicnumber": 1706,
			"text": "Ebû Hureyre (radıyallahü anh) şöyle demiştir: Allah'ın Peygambe­ri (sallallahü aleyhi ve sellem) bir kurbanlık deve sevkeden bir adam gördü. Ona: \"Bu deveye bin!\" buyurdu. zât: Bu deve kurbanlık bir devedir, dedi. Peygamber: \"Bu deveye bin!\" buyurdu. Hureyre: Yemîn olsun ben o kimseyi deveye binmiş de Peygamber'le yürüyüş yarışı yapmaya çalışırken görmüşümdür. Deve­nin boynunda na'l vardı, dedi . hadîsi rivayet etmekte ona Muhammed ibnu Beşşâr mutâbaat etmiştir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 1707,
			"arabicnumber": 1707,
			"text": "Bize Usmân ibnu Umer tahdîs edip şöyle dedi: Bize Alî ibnu'l-Mubârek, Yahya ibn Ebî Kesîr'den; o da İkrime'den; o da Ebû Hureyre'den; o da Peygamber (sallallahü aleyhi ve sellem)'den olmak üzere bu hadîsi haber verdi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 1708,
			"arabicnumber": 1708,
			"text": "Bize Mûsâ ibnu Ukbe tahdîs etti ki, Nâfi' şöyle de­miştir: İbnu Umer(radıyallahü anh), İbnu'z-Zubeyr'in emirliği zamanında Harûrîler'in hacc ettiği (64. hicret) yılı hacc etmek istedi. (Oğlu tarafından) kendisine: İnsanlar arasında harb olmaktadır. Biz onların sana Ka'be (ye gitmek)den mâni' olmalarından korkuyoruz, denildi, Umer: \"And olsun muhakkak ki Allah Elçisinde sizin için çok güzel bir uyma örneği vardır\"(el-Ahzâb: 21). O takdirde ben de Rasûlullah'ın(Hudeybiye senesi) yaptığı gibi yaparım. Ben sizi şâhid tutuyorum, ben kendime umre yapmayı vâcib kıldım, dedi. Nihayet Zu’l-Huleyfe'nin önündeki Beydâ'nın yüksek yerinde olduğu zaman: olunmak sebebiyle ihramdan çıkmanın cevazında) hacc ile umrenin sânı başka başka değil, ancak birdir. Ben sizleri şâhid tutuyorum:. Ben bir umrenin beraberinde haccı birleştirdim, dedi. Ve satın aldığı kurbanlığı gerdanlıklanmış olarak Ka'be'ye he­diye olmak üzere şevketti. Nihayet Mekke'ye geldiği zaman Ka'be'yi tavaf, Safa ile Merve'yi de sa'y etti. Bunun üzerine birşey artırmadı. İhram sebebiyle haram olmuş şeylerden hiçbiri de tâ nahr gününe ka­dar halâl olmadı (yani ihramdan çıkmadı). Nahr günü tıraş olup kur­bânını kesti. Ve o gün(Arafat'ta vakfeden sonra) yaptığı ilk ifâda tavâfıyla hacc ve umre tavafını yerine getirmiş olduğu re'yinde bu­lundu. Sonra: Peygamber(sallallahü aleyhi ve sellem) de böyle yaptı, dedi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 1709,
			"arabicnumber": 1709,
			"text": "Abdurrahmân'm kızı Amre şöyle demiştir: Ben Âişe (radıyallahü anha)'den işittim, şöyle diyordu: Biz Rasûlullah'ın beraberinde zu'l-ka'de ayının çıkmasına beş gün kala (Medine'den Veda Haccı için) yola çıktık.Biz (bu aylarda umre değil) yalnız hacc edilir zannediyor­duk. Nihayet Mekke'ye yaklaştığımızda Rasûlullah (sallallahü aleyhi ve sellem), beraberinde kurbânı bulunmayan kimselere Ka'be'yi tavaf ve Safa ile Merve ara­sında sa'y ettiği zaman ihramdan çıkmalarını emr eyledi. Âişe dedi ki: Kurbân bayramının ilk günü (Minâ'da elinde) sığır eti ile yanımı­za girildi. Ben: Bu nedir? diye sordum. getiren kimse: Rasûlullah(sallallahü aleyhi ve sellem) zevceleri adına kurbân kesti, dedi. ibn Saîd el-Ensârî dedi ki: Ben bu hadîsi el-Kaasım ibn Muhammed ibn Ebî Bekr'e zikrettim. O: Amre bu hadîsi sana (hiç birşey kısaltmadan ve te'vîl ile değiştirmeden) tam bir sevk edişle sevketmiştir, dedi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 187
			}
		},
		{
			"hadithnumber": 1710,
			"arabicnumber": 1710,
			"text": "Bize Ubeydullah ibn Umer, Nâfi'den tahdîs etti ki, o, Abdullah ibn Umer (radıyallahü anh) kurbânını, kurbân kesilecek yerde keserdi, demiştir. Ubeydullah: Rasûlullah'ın kurbân kestiği yerde, demiştir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 188
			}
		},
		{
			"hadithnumber": 1711,
			"arabicnumber": 1711,
			"text": "Bize Mûsâ ibn Ukbe tahdîs etti ki, Nâfi' şöyle demiş­tir: İbnu Umer(radıyallahü anh), kurbânını Müzdelife'den gecenin sonunda, içlerinde hür ve köle kişiler bulunan hacılar topluluğunun beraberinde (Minâ'ya) gönderir, nihayet kurbân, Peygamberin kurbân kestiği yere girdirilirdi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 189
			}
		},
		{
			"hadithnumber": 1712,
			"arabicnumber": 1712,
			"text": "Bize Vuheyb, Eyyûb'dan; o da Ebû Kılâbe'den; o da Enes'ten tahdîs edip(ve inşâallah biraz sonra tamâmı gelecek olan) bu hadîsi kısaltılmış olarak zikretti. Enes (radıyallahü anh): Peygamber (sallallahü aleyhi ve sellem) yedi tane deveyi ayakta oldukları hâlde kendi eliyle nahr etti. Medine'de de iki tane alacalı ve boynuzlu koçu yine kendi eliyle kesti, demiştir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 190
			}
		},
		{
			"hadithnumber": 1713,
			"arabicnumber": 1713,
			"text": "Ziyâd ibnu Cubeyr şöyle demiştir: Ben (Minâ'da) ibn Umer'i gördüm. O, kurbanlık devesini cöktürmüş de kesmekte olan bir kimsenin yanına geldi ve o kimseye: Deveyi ayağa kaldır da ayakta ve ayağı bağlanmış olarak kes. Devenin bu suretle kesilmesi Muhammed'in sünnetidir, dedi . Şu'betu'bnu'l-Haccâc: Yûnus, bana Ziyâd haber verdi dedi, demiştir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 191
			}
		},
		{
			"hadithnumber": 1714,
			"arabicnumber": 1714,
			"text": "Enes (radıyallahü anh) şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem) -Veda Haccına çıkmadan evvel- öğle namazını Medine'de dört rek'at kıldı. İkindiyi de Zu’l-Huleyfe'de (kısaltarak) iki rek'at kıldı. Ve geceyi orada geçirdi. Sabah olunca binek devesine bindi de tehlîl ve tesbîh etme­ğe başladı. Müzdelife'deki Beydâ üzerine yükselince hacc ile umreyi beraberce telbiye etti. Mekke'ye girdiği zaman (beraberinde kurbân­ları bulunmayan sahâbîlerine) ihramdan çıkmalarım emretti. Bu haccda Peygamber (sallallahü aleyhi ve sellem) kendi eliyle ayakta oldukları hâlde yedi tane deve kesti. Medine'de de (bir kurbân bayramında) alacalı boynuzlu iki koç kurbân etti . İsmâîl, Eyyûb'dan; o da Ebû Kılâbe'den tahdîs etti ki, Enes ibn Mâlik(radıyallahü anh): Peygamber(sallallahü aleyhi ve sellem) Medîne'de öğle namazını dört rek'at kıldı, ikindiyi de Zu’l-Huleyfe'de iki rek'at kıldı, demiş­tir . yine Eyyûb'dan; o da bir'adamdan; o da Enes'ten gelen rivayette: Sonra sabaha girinceye kadar orada geceledi. Sabah namazını kıldı. Sonra da binek devesine bindi. Devesi O'nu Beydâ'ya dümdüz yükselttiği zaman umre ile hacca niyet edip telbiye etti, demiştir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 192
			}
		},
		{
			"hadithnumber": 1715,
			"arabicnumber": 1715,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 193
			}
		},
		{
			"hadithnumber": 1716,
			"arabicnumber": 1716,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 194
			}
		},
		{
			"hadithnumber": 1717,
			"arabicnumber": 1717,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 195
			}
		},
		{
			"hadithnumber": 1718,
			"arabicnumber": 1718,
			"text": "Bize Seyf ibnu Ebî Süleyman tahdîs edip şöyie dedi: Mucâhid'den işittim, şöyle diyordu: Bana İbnu Ebî Leylâ tahdîs etti. Ona da Alî(radıyallahü anh) tahdîs edip şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem) -Veda Haccı'nda- yüz deve kurbânı hediye etti. Bana onların etlerini taksîm etmemi emretti, ben de etleri taksim ettim. Sonra çullarını taksîm etmemi emretti. Ben onların çullarını da taksîm ettim. Sonra kurbânların derileriyle ilgili emri de verdi, ben derilerini de taksîm ettim",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 196
			}
		},
		{
			"hadithnumber": 1719,
			"arabicnumber": 1719,
			"text": "İbn Cureyc şöyle demiştir: Bize Atâ tahdîs etti. O, Câbir ibn Abdillah (radıyallahü anh)'tan şöyle derken işitmiştir: Biz Minâ'da kal­dığımız üç günden fazla bir zamanda, kurbân develerimizin etinden yemezdik.(Üç günden arta kalan eti sadaka yapardık.) Sonra Pey­gamber (sallallahü aleyhi ve sellem) bize ruhsat verdi de: \"Kurbân etlerinizi yiyiniz ve(kavu­rup) azık yapınız\" buyurdu. Bu müsâade üzerine biz de yedik ve azık edindik. İbn Cureyc dedi ki: Ben Atâ'ya: Câbir, Medine'ye gelince­ye kadar dedi mi? diye sordum. Atâ: Hayır (Câbir Medine'ye gelin­ceye kadar demedi), dedi . Abdurrahmân kızı Amre tahdîs edip şöyle de­di: Ben Âişe(radıyallahü anha)'den işittim, şöyle diyordu: Biz, Rasûlullah'ın beraberinde -Veda Haccı'na- zu'l-ka'deden beş gün kala(Medine'den) çıktık. Biz(bu aylarda umre değil) yalnız hacc edilir zannediyorduk. Nihayet Mekke'ye yaklaştığımız zaman Rasûlullah beraberinde kurbanı bulunmayanlara emretti. Onlar Beyt'i tavaf, (sallallahü aleyhi ve sellemafa ile Merve ara­sını sa'y) ettiklerinde, bundan sonra ihramdan çıkarlardı. Âişe dedi ki: Kurbân bayramının bifinci günü bir sığır eti ile yanımıza girildi. Bu et nedir? diye sordum. getiren kimse tarafından: Peygamber(sallallahü aleyhi ve sellem) kendi kadınları adına kurbân kesti, denildi. Yahya ibn Saîd dedi ki: Ben bu hadîsi el-Kaasım (ibn Muhammed ibn Ebî Bekr)'a zikrettim de el-Kaasım: Amre sana bu hadîsi olduğu gibi tastamam getirmiştir, dedi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 197
			}
		},
		{
			"hadithnumber": 1720,
			"arabicnumber": 1720,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 198
			}
		},
		{
			"hadithnumber": 1721,
			"arabicnumber": 1721,
			"text": "Bize Mansûr ibn Zâzân, Atâ'dan haber verdi ki, İbn Abbâs(radıyallahü anh) şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem)'e, kurbânı kesmeden önce saçını tıraş eden ve bunun benzeri (meselâ taş atmadan önce ifâda tavafı gibi) bir iş yapan kimsenin hükmü soruldu. Peygamber: \"Darlık yok, darlık yok\" buyurdu",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 199
			}
		},
		{
			"hadithnumber": 1722,
			"arabicnumber": 1722,
			"text": "Bize Ebû Bekr ibnu Ayyaş, Abdulazîz ibn Rufey'den; o da Atâ'dan haber verdi ki, İbn Abbâs (radıyallahü anh) şöyle demiştir: Bir adam Peygamber'e: Ben cemreye taş atmadan önce Ka'be'ye farz olan ziyaret tavafını yaptım, dedi. \"Hiçbir darlık yok\" buyurdu. şahıs veya diğer biri: kurbânımı kesmeden önce başımı tıraş ettim, dedi. peygamber: yok\" buyurdu. cemreye taş atmadan kurbânımı kestim, dedi. \"Darlık (ve günâh) yok\" buyurdu . Abdurrahîm ibn Süleyman er-Râzî dedi ki îbnu Hüseyni şöyle dedi: Bana Atâ, îbn Abbâs'tan; o da Peygamber'den haber verdi. Ve el-Kaasım ibnu Yahya (öl. 197) şöyle dedi: Bana İbnu Huseym, Atâ'dan; o da İbn Abbâs'tan; o da Peyamber'den tahdîs etti, dedi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 200
			}
		},
		{
			"hadithnumber": 1723,
			"arabicnumber": 1723,
			"text": "Ve Affân (ibn Müslim es-Saffâr): Ben Vuheyb'in şöyle dediğini zannediyorum: Bize Abdullah ibnu Huseym, Saîd ibn Cubeyr'den; o da İbn Abbâs'tan; o da Peygamber'den. Ve Hammâd(ibn Seleme), Kays ibn Sa'd ile Abbâd ibn Mansûr'dan; onlar da Atâ'dan; o da Câbir ibn Abdillah'tan; o da Peygamber (sallallahü aleyhi ve sellem)'den olmak üzere bu hadîsi söyledi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 201
			}
		},
		{
			"hadithnumber": 1724,
			"arabicnumber": 1724,
			"text": "Bize Hâlid el-Hazzâ, İkrime'den tahdîs etti ki, İbn Abbâs(radıyallahü anh) şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem)'e birisi tarafından soruldu. O soran zât: Ben güneşin ortadan meyli ile batması arasındaki zamana girişimin ardından cemreye taş attım, dedi. \"Darlık yoktur\" buyurdu. (O zât veya başkası:) Ben kurbânımı kesmeden önce tıraş oldum, dedi. Peygamber: \"Darlık yoktur\" buyurdu",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 202
			}
		},
		{
			"hadithnumber": 1725,
			"arabicnumber": 1725,
			"text": "Ebû Mûsâ (radıyallahü anh) şöyle demiştir: Ben(Yemen'den dön­düm de) Rasûlullah Bathâ'da iken O'nun yanma geldim. Rasûlullah bana: \"Hacca niyet ettin mi?\" dedi. Evet, niyet ettim, dedim. \"Hangi nevi' hacca niyet edip ihrama girdin?\" dedi. Peygamber'in ihrama girişi gibi bir ihrama girişle Lebbeyk diye cevâbladım. \"Güzel yaptın. Şimdi git Bey t'i tavaf et, Safa ile Merve ara­sım sa'y eyle\" buyurdu. bunları yaptıktan sonra Kays oğulları kadınlarından bir kdına geldim. Kadın başımın saçını tarayıp ayıkladı (yânı beraberim­de kurbân olmadığı için umre yapıp ihramdan çıktım). Sonra hacc niyetiyle ihrama girip telbiye ettim. Artık sonraları ben, tâ Umer'in halifeliğine kadar insanlara bununla, yani hacca kadar umre ile temettü' yapmakla fetva veriyordum. Nihayet Umer halîfe olunca bunu kendisine zikrettim. Umer: Allah'ın Kitabını alırsak, o bize (başlanmış olan umre ile haccı), tamamlamayı emrediyor (el-Bakara: 196). Allah Elçisi'nin sünnetini alırsak, şübhesiz Allah Elçisi kurbân kesileceği yere ulaşıp kesilinceye kadar, ihramdan çıkmamıştır, dedi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 203
			}
		},
		{
			"hadithnumber": 1726,
			"arabicnumber": 1726,
			"text": "Bize Mâlik, Nâfi'den; o da İbn Umer'den haber ver­di ki, Hafsa(radıyallahü anh): Yâ Rasûlallah! İnsanların hâli nedir ki, onlar umre ile ihramdan çıktılar da sen umrenden dolayı ihramdan çıkmadın? diye sordu. \"Ben başımın saçlarını toplayıp keçeleştirdim, kurbânıma da Ka'be nâmına gerdanlık taktım. Artık ben kurbânımı kesmedikçe ih­ramdan çıkamam\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 204
			}
		},
		{
			"hadithnumber": 1727,
			"arabicnumber": 1727,
			"text": "(Bize Mâlik, Nâfi'den; o da Abdullah ibn Umer'den haber verdi ki, o şöyle, demiştir: aleyhi ve sellem): Allah! Başlarını tıraş edenlere rahmet eyle!\" diye duâ etti. Yâ Rasûlallah! Saçlarını kısaltanlara da (radıyallahü anhahmet et deyiver), dediler. yine: \"Yâ Allah! Saçlarını kestirenlere merhamet eyle!\"diye duâ etti. de tekrar: Yâ Rasûlallah! Saçlarını kısaltanlara da rahmet buyursan! dediler. bu defa: \"Saçlarını kısaltanlara da merhamet eyle\" diye duâ etti . el-Leys dedi ki: Bana Nâfi' şöyle tahdîs etti: Rasûlullah bir yâhud iki kerre \"Allah saçlarını kestirenlere merhamet eylesin!\" diye duâ etmiştir. Ubeydullah da şöyle dedi: Nâfi' bana tahdîs edip: Rasûlul­lah dördüncü defa da 'Saçlarını kısaltanlara da merhamet eyle\" de­miştir, dedi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 205
			}
		},
		{
			"hadithnumber": 1728,
			"arabicnumber": 1728,
			"text": "Ebû Hureyre (radıyallahü anh) şöyle demiştir: Rasûlullah (sallallahü aleyhi ve sellem): \"Ey Allahım! Saçlarını tıraş edenlere mağfiret eyle!\" diye duâ etti. Saçlarını kısaltanlara da (diye ilâve ediver), dediler. \"Ey Allahım! Saçlarını tıraş edenlere mağfiret eyle!\" diye duâ etti. Saçlarını kısaltanlara da! dediler. bu duayı üç kerre söyledi de (dördüncüsünde): \"... Saçlarını kısaltanlara da mağfiret eyle!\" dedi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 206
			}
		},
		{
			"hadithnumber": 1729,
			"arabicnumber": 1729,
			"text": "Bize Cuveyriye ibnu Esma, Nâfi'den tahdîs etti ki, Abdullah(ibn Umer): Peygamber (sallallahü aleyhi ve sellem) ve sahâbîlerinden bir taife tı­raş olup saçlarını kestirdiler. Sahâbîlerin bâzısı da saçlarını sâdece kı­salttılar, demiştir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 207
			}
		},
		{
			"hadithnumber": 1730,
			"arabicnumber": 1730,
			"text": "Bize Ebû Âsim, İbnu Cureyc'den; o da el-Hasen ibn Müslim'den; o da Tâvûs'tan; o da İbn Abbâs'tan tahdîs etti ki, Muâviye(radıyallahü anh): Ben Rasûlullah'ın başındaki saçından bir parçasını mışkas (denilen enli ok veya bıçak) ile kesip kısalttım, demiştir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 208
			}
		},
		{
			"hadithnumber": 1731,
			"arabicnumber": 1731,
			"text": "Bize Mûsâ ibn Ukbe tahdîs etti. Bana Kureyb haber verdi ki, ibn Abbâs(radıyallahü anh) Peygamber(sallallahü aleyhi ve sellem) Mekke'ye geldiği zaman (be­raberlerinde kurbanlık sevketmemiş bulunan) sahâbîlerine Beyt'i ta­vaf ve Safa ile Merve arasında sa'y etmelerini, sonra da ihramdan çıkmalarını, saçlarım kestirmelerini yâhud da kısaltmalarını emretti, demiştir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 209
			}
		},
		{
			"hadithnumber": 1732,
			"arabicnumber": 1732,
			"text": "Bize Vuheyb, Eyyûb'dan; o da Ebû Kılâbe'den; o da Enes'ten tahdîs edip(ve inşâallah biraz sonra tamâmı gelecek olan) bu hadîsi kısaltılmış olarak zikretti. Enes (radıyallahü anh): Peygamber (sallallahü aleyhi ve sellem) yedi tane deveyi ayakta oldukları hâlde kendi eliyle nahr etti. Medine'de de iki tane alacalı ve boynuzlu koçu yine kendi eliyle kesti, demiştir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 210
			}
		},
		{
			"hadithnumber": 1733,
			"arabicnumber": 1733,
			"text": "Ziyâd ibnu Cubeyr şöyle demiştir: Ben (Minâ'da) ibn Umer'i gördüm. O, kurbanlık devesini cöktürmüş de kesmekte olan bir kimsenin yanına geldi ve o kimseye: Deveyi ayağa kaldır da ayakta ve ayağı bağlanmış olarak kes. Devenin bu suretle kesilmesi Muhammed'in sünnetidir, dedi . Şu'betu'bnu'l-Haccâc: Yûnus, bana Ziyâd haber verdi dedi, demiştir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 211
			}
		},
		{
			"hadithnumber": 1734,
			"arabicnumber": 1734,
			"text": "Enes (radıyallahü anh) şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem) -Veda Haccına çıkmadan evvel- öğle namazını Medine'de dört rek'at kıldı. İkindiyi de Zu’l-Huleyfe'de (kısaltarak) iki rek'at kıldı. Ve geceyi orada geçirdi. Sabah olunca binek devesine bindi de tehlîl ve tesbîh etme­ğe başladı. Müzdelife'deki Beydâ üzerine yükselince hacc ile umreyi beraberce telbiye etti. Mekke'ye girdiği zaman (beraberinde kurbân­ları bulunmayan sahâbîlerine) ihramdan çıkmalarım emretti. Bu haccda Peygamber (sallallahü aleyhi ve sellem) kendi eliyle ayakta oldukları hâlde yedi tane deve kesti. Medine'de de (bir kurbân bayramında) alacalı boynuzlu iki koç kurbân etti . İsmâîl, Eyyûb'dan; o da Ebû Kılâbe'den tahdîs etti ki, Enes ibn Mâlik(radıyallahü anh): Peygamber(sallallahü aleyhi ve sellem) Medîne'de öğle namazını dört rek'at kıldı, ikindiyi de Zu’l-Huleyfe'de iki rek'at kıldı, demiş­tir . yine Eyyûb'dan; o da bir'adamdan; o da Enes'ten gelen rivayette: Sonra sabaha girinceye kadar orada geceledi. Sabah namazını kıldı. Sonra da binek devesine bindi. Devesi O'nu Beydâ'ya dümdüz yükselttiği zaman umre ile hacca niyet edip telbiye etti, demiştir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 212
			}
		},
		{
			"hadithnumber": 1735,
			"arabicnumber": 1735,
			"text": "Bize Hâlid el-Hazzâ', İkrime'den tahdîs etti ki, İbn Abbâs(radıyallahü anh) şöyle demiştir: Veda Haccı'nda Minâ'da, bayramın birin­ci gününde Peygamber'e suâller soruluyordu da, Peygamber de \"Dar­lık yok\" buyuruyordu. Bir adam Peygamber'e: Ben kurbân kesmeden önce tıraş oldum, diye sordu. Peygamber: \"Kurbânını kes, günâhı yok\" buyurdu. Ve yine: Ben akşama girişimin ardından (yani öğleden sonra veya geceleyin) cemre taşladım, dedi. \"Günâh yok\" buyurdu",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 213
			}
		},
		{
			"hadithnumber": 1736,
			"arabicnumber": 1736,
			"text": "Abdullah ibn Amr'dan (o, şöyle demiştir): Rasülullah (sallallahü aleyhi ve sellem), Veda Haccı'nda (Minâ'da) durdu. İnsanlar kendisinden sormaya başladılar. Bir adam: Ben bilemedim de kurbân kesmeden önce tıraş oldum, dedi. Rasûlullah: \"Kurbânını kes, günâhı yok\" buyurdu. Diğer biri geldi ve: Ben bilemedim de cemreyi taşlamadan önce kurbânımı kestim, dedi. ona da: \"Cemreyi taşla, darlık yok\" buyurdu. gün taş atmak, kurbân kesmek, tıraş olmak, ta­vaf etmek gibi birinci günün işlerinden) öne geçirilmiş veya geriye bırakılmış hiçbirşey sorulmadı ki, cevâbında \"Yap, darlık (günâh) yok\" buyurmasın",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 214
			}
		},
		{
			"hadithnumber": 1737,
			"arabicnumber": 1737,
			"text": "Abdullah ibn Amr ibni’l-Âsî (radıyallahü anh) şöyle tahdîs etmiş­tir: Kendisi, Peygamber(sallallahü aleyhi ve sellem) nahr günü(bineği üzerinde) hutbe yaparken yanında hazır bulunmuştur. Hutbe akabinde birisi Peygamber'e doğru kalktı da: Ben şu iş, şundan evvel yapılacak sanıyordum, dedi. Sonra bir diğer kimse ayağa kalktı ve: Ben şu iş, bu işten öncedir sanıyordum. Kurbân kesmeden önce tıraş oldum; cemre taşlamadan evvel kurbân kestim, dedi. Ve bunun gibi şeyler söyledi. aleyhi ve sellem): \"Bunları yap, bu fiillerin hepsi için hiçbir darlık yoktur\" bu­yurdu. gün Peygamber'e hiçbir şeyden sorulmadı ki, cevâbında \"Yap, darlık yoktur\" buyurmasın",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 215
			}
		},
		{
			"hadithnumber": 1738,
			"arabicnumber": 1738,
			"text": "İbn Şihab şöyle demiştir: Bana İsa ibnu Talha ibn Ubeydillah tahdîs etti. O, Abdullah ibn Amr ibn Âs'tan işitmiştir. Abdullah(radıyallahü anh), Rasûlullah(sallallahü aleyhi ve sellem) dişi devesi üzerinde durdu, deyip geçen hadîsi olduğu gibi zikretmiştir . hadîsi ez-Zuhrî'den rivayet etmekte Ma'mer ibn Râşid, Sa­lih ibn Keysân'a mutâbaat etmiştir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 216
			}
		},
		{
			"hadithnumber": 1739,
			"arabicnumber": 1739,
			"text": "Bize İkrime, İbn Abbâs'tan tahdîs etti (o, şöyle demiştir): Rasûlullah (sallallahü aleyhi ve sellem) nahr günü (Minâ'da) insanlara hitabe yaptı da bu hitabede: \"Ey insanlar! Bu gün hangi gündür?\" diye sordu. İnsanlar: kıtal) haram olan gündür, dediler. Rasûlullah: \"Bu hangi beldedir?\" diye sordu. kıtal) haram olan beldedir, dediler. \"Bu ay hangi aydır?\" diye sordu. Haram aydır, dediler. \"Şübhesiz kanlarınız, mallarınız, ırzlarınız bu belde içinde, bu ayda, bu günün harâmlığı kadar biribirinize haramdır\" buyurdu ve bu sözleri birkaç defa tekrar etti. Sonra başını yukarı kaldırdı da: \"Ey Allahım, tebliğ ettim mi? ey Allahım, tebliğ ettim mi?\"dedi. İbn Abbâs bu hadîsi böyle naklettikten sonra: Nefsim yed’inde olan Allah'a yemin ederim ki, bu sözler muhakkak Rasûlullah'm ümmetine vasiyetidir. Binâenaleyh burada hâ­zır bulunan kimse hâzır bulunmayana (ve müstakbel nesillere) bunu tebliğ etsin: \"Benden sonra biribirinizin boyunlarına vurarak kâfir­lere dönmeyiniz\" dedi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 217
			}
		},
		{
			"hadithnumber": 1740,
			"arabicnumber": 1740,
			"text": "Bana Amr (ibn Dînâr) haber verip şöyle dedi: Ben Câbir ibn Zeyd'den işittim, şöyle dedi: Ben îbn Abbâs'tan işittim, şöyle dedi: Ben Peygamber (sallallahü aleyhi ve sellem)'den işittim, Arafat'ta hutbe yapıyor­du . hadîsi Amr ibn Dînâr'dan rivayet etmekte Sufyân ibn Uyeyne, Şu'betu'bnu Haccâc'a mutâbaat etti",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 218
			}
		},
		{
			"hadithnumber": 1741,
			"arabicnumber": 1741,
			"text": "Muhammed ibn Sîrîn şöyle demiştir: Bana Ebû Bekre'nin oğlu Abdurrahmân, Bâbası Ebû Bekre'den haber verdi. Ve bir de benim nefsimde bu Abdurrahmân'dan daha faziletli olan bir kimse, Humeyd ibnu Abdirrahmân bana yine Ebû Bekre'den haber verdi. Ebû Bekre (Nufey' ibnu'l-Hâris ibn Kelede -R-)'şöyle demiştir: aleyhi ve sellem) nahr günü bizlere hitâb edip: \"Bu gün hangi gündür, biliyor musunuz?\" buyurdu. Biz: Allah ve Rasûlü en iyi bilendir, dedik. sükût etti. O derecede ki, biz Peygamber onu başka bir isim­le isimlendirecek sandık. Rasûlullah: \"Nahır günü (yâni kurbân kesme günü) değil mi?” buyurdu. Bizler: Evet, kurbân kesme günüdür, dedik. \"Bu ay hangi aydır?\" diye sordu. Biz: Allah ve Rasûlü en bilendir, dedik. yine sükût etti. O derecede ki biz ona isminden başka bir isim takacak sandık. Rasûlullah: \"Zu'l-hicce ayı değil mi?\" buyurdu. Evet, zu'l-hicce ayıdır, dedik. \"Bu hangi beldedir?\" diye sordu. yine: Allah ve Rasûlü en bilendir, dedik. sustu; o derecede ki, biz ona isminden başka bir isim verecek sandık. \"Haram olan Belde değil mi?\" buyurdu. Evet, Haram Belde'dir, dedik. Bunun üzerine: \"Muhakkak ki kanlarınız, mallarınız bu beldeniz içinde, bu ayınızda, bu gününüzün harâmlığı gibi biribirinize, Rabb'inize ka­vuşacağınız güne kadar haramdır. Dikkat edin! Bunları size tebliğ et­tim mi?\" dedi. Evet, tebliğ ettin, dediler. Rasûlullah: \"Yâ Allah! Şâhid ol!\" dedi. Sonra: \"Burada hâzır bulunanlar, hâzır bulunmayanlara tebliğ etsin. Bâzan kendisine tebliğ edil­miş olan kimse, burada bulunup işiten kimseden daha iyi anlayıp belleyici olur. Benden sonra biribirinizin boyunlarına vuracak kâfir­lere dönmeyiniz!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 219
			}
		},
		{
			"hadithnumber": 1742,
			"arabicnumber": 1742,
			"text": "Abdullah ibnu Umer (radıyallahü anh) şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem) Minâ'daki hutbesinde: \"Bilir misiniz bu gün hangi gündür?\" buyurdu. Sahâbîler: Allah ve Rasûlü en bilendir, dediler. Bunun üzerine Peygamber: \"Şübhesiz bu, haram bir gündür. Yine bilir misiniz bu hangi beldedir?\" buyurdu. Allah ve Rasûlü en bilendir, dediler. Peygamber: \"Haram beldedir. Bilir misiniz bu hangi aydır?\" buyurdu. Sahâbîler: Allah ve Rasûlü en bilendir, dediler. Peygamber: \"Haram aydır\" buyurdu da şöyle devam etti: \"Şübhesiz Allah kanlarınızı, mallarınızı, ırzlarınızı bu ayınız içinde, bu beldeniz için­de, bu gününüzün harâmlığı gibi biribirinize haram kılmıştır\" . Hişâm ibnu’l-Gâzî (157) dedi ki: Bana Nâfi İbn Umer'den haber verdi. O, şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem) bu suretle yapmış ol­duğu haccında nahr gününde cemrelerin arasında durdu da: \"Bu bü­yük haccdır\" buyurdu. Bundan sonra Peygamber (sallallahü aleyhi ve sellem): \"Yâ Allah! Şâhid ol!\" demeye başladı ve insanlara veda etti. Sahâbîler: Bu hacc, veda hacadır, dediler",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 220
			}
		},
		{
			"hadithnumber": 1743,
			"arabicnumber": 1743,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 221
			}
		},
		{
			"hadithnumber": 1744,
			"arabicnumber": 1744,
			"text": "Bize İbnu Cureyc haber verip şöyle dedi: Bana Ubeydullah, Nâfi'den; o da İbn Umer'den: Peygamber (sallallahü aleyhi ve sellem) izin verdi, diye haber verdi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 222
			}
		},
		{
			"hadithnumber": 1745,
			"arabicnumber": 1745,
			"text": "Bize îsâ ibnu Yûnus, Ubeydullah'tan; o daNâfi'den; o da Ibn Umer (radıyallahü anh)'den Peygamber(sallallahü aleyhi ve sellem) -su içirme sahihlerine Minâ ge­celerinde Mekke'de geceleme hususunda- ruhsat vermiştir, diye tahdîs etmiştir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 223
			}
		},
		{
			"hadithnumber": 1746,
			"arabicnumber": 1746,
			"text": "Vebere şöyle demiştir: Ben îbnu Umer'e: Ben(teşrîk günlerindeki) cemreleri ne zaman atayım? Diye sordum. Umer: îmâmın, yânı hacc emîrinin atmağa başladığı zaman, sen de cemreleri atarsın, dedi. suâli ona tekrar ettim, îbn Umer: Biz(radıyallahü anhasûlullah zamanında) vakti gözetler dururduk da, gü­neş semânın ortasından batıya meyl ettiğinde cemreleri atardık, dedi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 224
			}
		},
		{
			"hadithnumber": 1747,
			"arabicnumber": 1747,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 225
			}
		},
		{
			"hadithnumber": 1748,
			"arabicnumber": 1748,
			"text": "Bize Şu'be, el-Hakem'den; o da İbrâhîm en-Nahaî'den; o da Abdurrahmân ibn Yezîd'den tahdîs etti ki, Abdullah ibn Mes'ûd (radıyallahü anh), Büyük Cemre'ye yani Akabe cemresine vardı­ğında Beyt'i sol tarafına, Minâ'yı da sağına alıp (cemre atılacak yere yönelerek) yedi tane çakıl taşı atmıştır. Sonra da: Kendisine el-Bakara Sûresi indirilmiş olan Peygamber (sallallahü aleyhi ve sellem) de cemreye işte böyle taş attı, demiştir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 226
			}
		},
		{
			"hadithnumber": 1749,
			"arabicnumber": 1749,
			"text": "Bize el-Hakem, İbrâhîm'den; o da Abdurrahmân ibn Yezîd'den tahdîs etti ki, bu Abdurrahmân, îbn Mes'ûd'un beraberinde hacc yapmış ve onu Beyt'i soluna, Minâ'yı sağına alıp, Büyük Cemre'ye yedi tane çakıl taşı atarken görmüştür. İbn Mes'ûd taşları böyle attıktan sonra: İşte bu taş attığım yer, üzerine el-Bakara Sûresi indirilmiş olan kimsenin durduğu yerdir, demiştir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 227
			}
		},
		{
			"hadithnumber": 1750,
			"arabicnumber": 1750,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 228
			}
		},
		{
			"hadithnumber": 1751,
			"arabicnumber": 1751,
			"text": "Bize Yûnus ibn Yezîd, ez-Zuhrî'den; o da Sâlim'den, İbn Umer'in şöyle yapar olduğunu tahdîs etti (sallallahü aleyhi ve sellemalim şöyle demiştir): İbn Umer, el-Cemretu'd-Dünyâ'ya yedi çakıl taşı atar, her çakıl atışı­nın ardından Allâhu Ekber diye tekbîr getirirdi. Bundan sonra İbn Umer ileriye geçip, vâdînin ortasındaki düzlüğe girer ve orada kıble­ye yönelip (Cemreyi arkasına alarak) uzun bir dikeliş yapar ve iki eli­ni yukarıya kaldırarak duâ eder. Bundan sonra orta cemreye taş atar. Bundan sonra İbn Umer vâdînin kuzey cihetine doğru yürür, (bura­da da birincideki gibi) vâdînin içindeki düzlüğe girer, burada da kıb­leye karşı yönelmiş olarak uzun süre dikelir, ellerini kaldırarak duâ eder, uzunca dikelirdi. Bundan sonra(ilerleyip) Akabe cemresine ge­lir, vâdînin içinden ona da yedi taş atardı, fakat onun yanında (duâ için) durmazdı. Atıştan sonra oradan döner ve: Peygamber (sallallahü aleyhi ve sellem)'i hacc menseklerini işte böyle yapar gördüm, der idi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 229
			}
		},
		{
			"hadithnumber": 1752,
			"arabicnumber": 1752,
			"text": "Abdullah'ın oğlu Salim şöyle demiştir: Abdullah ibn Umer el-Cemretu'd-Dünyâ'ya yedi tane çakıl taşı atar ve herbir çakıl taşını atmasından sonra Allâhu Ekber... diye tekbîr getirirdi. Sonra buradan ilerler, vâdînin ortasındaki düzlüğe girer, orada kıbleye yö­nelmiş olarak uzun bir dikelme yapar, iki ellerini kaldırır, duâ eder­di. Bundan sonra el-Cemretu’l-Vustâ'ya yine böyle taş atar, akabinde vâdînin kuzey tarafına doğru yürür, düzlüğe girer, yine kıbleye yö­nelmiş olarak uzun bir dikelme yapar, iki elini kaldırır, duâ ederdi. Bundan sonra Akabe cemresine gelir, vâdînin içinden onu da taşlar, fakat onun yanında vakfe yapmazdı. Ve: Ben Rasûlullah (sallallahü aleyhi ve sellem)'ı işte böyle yapar gördüm, der idi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 230
			}
		},
		{
			"hadithnumber": 1753,
			"arabicnumber": 1753,
			"text": "(Ve Muhammed şöyle dedi: Bize Usmân ibnu Umer tahdîs edip şöyle dedi: Bize Yûnus ibn Yezîd, ez-Zuhrî'den şöyle ha­ber verdi: aleyhi ve sellem) Minâ Mescidi'ne yakın olan cemreye taş attığı zaman, ona yedi çakıl taşı atar ve her bir çakılı attıkça da Allâhu Ekber.. diye tekbîr getirirdi. Sonra önüne doğru ilerler de kıbleye yönelmiş ve iki elini yukan kaldırmış olarak duâ eder ve bu duruşu uzatırdı. Sonra ikinci cemreye gelir, ona da yedi çakıl taşı atar ve her bir çakılı attıkça Allâhu Ekber diye tekbîr getirirdi. Sonra vâdî­nin sol tarafına doğru iner, orada da kıbleye dönmüş ve iki elini kal­dırmış olarak vakfe yapar, duâ ederdi. Sonra Akabe yanındaki cemreye gelir, ona da herbir taşla beraber tekbîr getirerek yedi tane çakıl taşı atar, sonra onun yanında(duâ için) durmaksızın oradan ayrılırdı. dedi ki: Ben Salim ibn Abdillah'tan işittim; o, bu hadî­si aynen Bâbası Abdullah ibn Umer'den; o da Peygamber (sallallahü aleyhi ve sellem)'den olmak üzere tahdîs ediyordu. Ve İbn Umer de böyle yapardı",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 231
			}
		},
		{
			"hadithnumber": 1754,
			"arabicnumber": 1754,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 232
			}
		},
		{
			"hadithnumber": 1755,
			"arabicnumber": 1755,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 233
			}
		},
		{
			"hadithnumber": 1756,
			"arabicnumber": 1756,
			"text": "Katâde, Enes ibn Mâlik'ten tahdîs etmiştir. Enes ibn Mâlik de Katâde'ye Peygamber'den şöyle tahdîs etmiştir: Peygam­ber(sallallahü aleyhi ve sellem) -Minâ'dan hareket edip Muhassab mevkiine geldi ve burada öğle, ikindi, akşam, yatsı namazlarını kıldı ve yine bu Muhassab'da bir mikdâr uyudu. Daha sonra bineğine binip Beyt'e doğru hareket etti ve Beyt'e (veda) tavafı yaptı",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 234
			}
		},
		{
			"hadithnumber": 1757,
			"arabicnumber": 1757,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 235
			}
		},
		{
			"hadithnumber": 1759,
			"arabicnumber": 1759,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 236
			}
		},
		{
			"hadithnumber": 1761,
			"arabicnumber": 1761,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 237
			}
		},
		{
			"hadithnumber": 1762,
			"arabicnumber": 1762,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 238
			}
		},
		{
			"hadithnumber": 1763,
			"arabicnumber": 1763,
			"text": "Bize Sufyân es-Sevrî tahdîs etti ki, Abdulazîz ibnu Rufey' şöyle demiştir: Ben Enes ibn Mâlik'e: Peygamber'den hatırladığın bir şeyi bana haber ver; zu'l-hiccenin sekizinci günü olan terviye gününde öğle namazını nerede kıldı? diye sordum. Minâ'da kıldı, diye cevâb verdi. Ben yine Enes'e: Minâ'dan memleketlere dağılma günü ikindi namazını nerede kıldı? diye sordum. Enes: Abtah(yani Muhassab)'da kıldı. Sen emirlerinin yapmakta oldukları gibi yap! dedi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 239
			}
		},
		{
			"hadithnumber": 1764,
			"arabicnumber": 1764,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 240
			}
		},
		{
			"hadithnumber": 1765,
			"arabicnumber": 1765,
			"text": "Âişe (radıyallahü anha): Muhassab bir konaklama yeridir ki, Peygamber (sallallahü aleyhi ve sellem) buraya, Medine'ye dönüş için çıkışının kolay olmasından dolayı iner, konaklardı, demiştir. Âişe, buraya inerdi sözüyle, Abtah'ı kasteder",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 241
			}
		},
		{
			"hadithnumber": 1766,
			"arabicnumber": 1766,
			"text": "Bize Amr (ibn Dînâr), Atâ'dan tahdîs etti ki, İbn Abbâs (radıyallahü anh): Muhassab menzilinde konaklamak hacc menseklerinden birşey değildir. Muhassab ancak Rasûlullah'ın (zevalden sonra istirahat için) inip konakladığı bir yerdir, demiştir",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 242
			}
		},
		{
			"hadithnumber": 1767,
			"arabicnumber": 1767,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 243
			}
		},
		{
			"hadithnumber": 1768,
			"arabicnumber": 1768,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 244
			}
		},
		{
			"hadithnumber": 1769,
			"arabicnumber": 1769,
			"text": "Amr ibnu Dînâr şöyle dedi: İbn Abbâs(radıyallahü anh) şöyle de­di: Zu’l-Mecâz ve Ukâz, Câhiliyet devrinde, insanların ticâret yerleri idi. İslâm gelince müslümânlar buralarda hacc mevsiminde alışveriş etmekten gûyâ hoşlanmamışlardı. Nihayet \" (Hacc mevsimlerinde ti­câretle) Rabbinizden rızık istemenizde sizlere bir günâh yoktur.,.\" (el-Bakara: 198) âyeti İndi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 245
			}
		},
		{
			"hadithnumber": 1770,
			"arabicnumber": 1770,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 246
			}
		},
		{
			"hadithnumber": 1772,
			"arabicnumber": 1772,
			"text": "",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 247
			}
		}
	]
}