{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"26": "`Umrah (Minor pilgrimage)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1773,
			"arabicnumber": 1773,
			"text": "Ebu Hureyre r.a., Resulullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu söyledi: \"Umre, diğer umreye kadar arasındakiler için keffarettir. Mebrur haccın tek karşılığı cennettir",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1774,
			"arabicnumber": 1774,
			"text": "İkrime İbn Halid, İbn Ömer r.a.'e hac'dan önce umre yapmanın hükmünü sordu. İbn Ömer \"Bir sakıncası yok\" dedi. İkrime, İbn Ömer r.a.'in şöyle dediğini nakletti: \"Nebi Sallallahu Aleyhi ve Sellem hac yapmadan önce umre yaptı",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1776,
			"arabicnumber": 1776,
			"text": "Bu sırada biz, Mü'minlerin anası Âişe'nin, kendi odası içinde dişlerini fırçalamasından çıkan hışırtıyı işittik.(İzin alarak yanına girdiğimizde) Urve, teyzesi sıfatıyla Âişe'ye: Yâ anne! Ey Mü'minlerin Annesi! Ebû Abdirrahmân Abdullah ibn Omer'in söylemekte olduğu sözü işitmiyor musun? Dedi. Ne söylüyor? dedi. Urve ibn Zubeyr: İbn Omer; Rasûlüllah, biri Receb’de olmak üzere, dört umre yaptı diyor, dedi. Âişe: Allah, Ebû Abdirrahmân'a rahmet etsin! Rasûlüllah'ın yaptığı umrelerin hepsine kendisi muhakkak şâhid olmuştur. Halbuki Rasûlüllah Receb ayında kat'iyyen umre yapmamıştır, dedi",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1777,
			"arabicnumber": 1777,
			"text": "Urve İbn Zübeyr şöyle dedi: Aişe r.anha'ya Resulullah'ın umresini sordum o: \"Resulullah Sallallahu Aleyhi ve Sellem Receb ayında umre yapmadı\" dedi",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1778,
			"arabicnumber": 1778,
			"text": "Katade şöyle dedi: Enes'e sordum: Nebi Sallallahu Aleyhi ve Sellem kaç kere umre yaptı? Enes şöyle dedi: Dört kere yaptı. Birisi, Zilkade ayında yaptığı ve müşriklerin kendisine engel olduğu Hudeybiye umresi, diğeri müşriklerle sulh yaptıktan sonra ertesi yılın Zilkade ayında yaptığı umre, diğeri Huneyn ganimetlerini dağıttığı Ci'rane umresi. Ben: Kaç kere hac yaptı? diye sordum. Enes: Bir kere, dedi. Tekrar: 1779, 1780, 3066, 4148 (Zikredilmeyen dördüncü umre, bir sonraki hadiste yer aldığı üzere hac ile birlikte yaptığı umredir)",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1779,
			"arabicnumber": 1779,
			"text": "",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1780,
			"arabicnumber": 1780,
			"text": "Katade şöyle dedi: Enes'e (Resulullah Sallallahu Aleyhi ve Sellem'in umrelerini) sordum. Enes şöyle dedi: Hz. Nebi: Müşriklerin kendisinin umre yapmasına engel olduğu yıl umre yapmak istedi, Ertesi sene Hudeybiye'nin kaza umresini yaptı, Bir kere Zilkade ayında umre yaptı, bir de hacc'ı ile birlikte umre yaptı. [-1780-] Hemmam şöyle dedi: Nebi (Sallallahu aleyhi ve Sellem) dört umre yaptı. Hac ile birlikte yaptığı umre dışında hepsi de Zilkade ayında idi: 1- Hudeybiye umresi, 2- Ertesi yıl yaptığı umre (kaza umresi), 3-Huneyn ganimetlerini taksim ettiği Ci'rane umresi, 4- Haccı ile birlikte yaptığı umre",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1781,
			"arabicnumber": 1781,
			"text": "Ebu İshak şöyle dedi: Mesruk, Ata ve Mücahid'e (Nebi Sallallahu Aleyhi ve Sellem'in) umrelerini sordum. şöyle dediler: Resulullah Sallallahu Aleyhi ve Sellem hac yapmadan önce Zilkade ayında umre yaptı. Ebu İshak dediki: Bera bin A'zib r.a.'e sordum şöyle cevap verdi: Resulullah Sallallahu Aleyhi ve Sellem hac yapmadan önce Zilkade ayında iki kere umre yaptı. Yani haccın farz kılındığı hükmünün gelmesinden önceki yıllarda. Tekrar: 1844, 2698, 2699, 2700, 3184, 4251",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1782,
			"arabicnumber": 1782,
			"text": "İbn Abbas r.a. şöyle dedi: Resulullah Sallallahu Aleyhi ve Sellem ensar'dan bir kadına: \"Bizimle hac yapmana engel olan şey nedir?\" diye sordu. Kadın şöyle dedi: Bizim bir devemiz vardı. Falan ve oğlu (yani kocam ve oğlum) o deveye bindiler. (Kocam) geriye su taşıdığımız şu deveyi bıraktı. Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Öyleyse Ramazan gelince Ramazanda umre yap. Çünkü Ramazan'da bir umre bir hacdır\". Tekrar: 1863",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1783,
			"arabicnumber": 1783,
			"text": "Aişe r.anha şöyle dedi: Resulullah Sallallahu Aleyhi ve Sellem ile birlikte (Zilkade ayını bitirip) zilhicce hilali ile birlikte yola çıktık. Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Sizden hac için telbiye getirecek olan yapsın. Umre için telbiye getirecek olan da umre için telbiye yapsın. Ben yanımda hedy kurbanı götürmemiş olsaydım umre için telbiye getirirdim\". İçimizden kimileri umre kimileri de hac için telbiye getirdi. Ben de umre için telbiye getirmiştim. Arefe günü yaklaştığında adet gördüm. Resulullah'a dert yandım o şöyle buyurdu: \"Umreni terk et (ihramdan çık). Saçlarını çöz ve tara. Hac için telbiye getir.\" Muhassab'ta konaklayacağımız gece Resulullah (Sallallahu aleyhi ve Sellem) kardeşim Abdurrahman ile birlikte bsni Tenim’e gönderdi. Ben de daha önceki umremin yerine umre için telbiye getirdim",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1784,
			"arabicnumber": 1784,
			"text": "Abdurrahman İbn Ebu Bekir r.a.'in söylediğine göre, Nebi Sallallahu Aleyhi ve Sellem kendisine Aîşe r.anha'yı devesinin terkisinde (Ten'im'e) götürmesini ve Ten'im'den umre yaptırmasını emretti. Süfyan bir defasında \"Amr'ın şöyle dediğini işittim\" dedikten sonra \"bunu Amr'dan ne kadar da çok işittim\" dedi. (2985 hadis)",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1785,
			"arabicnumber": 1785,
			"text": "Cabir İbn Abdullah r.a. şöyle dedi: Hz. Nebi ve onunla birlikte ashabı hac için telbiye getirdiler. Hz. Nebi ve Talha'dan başka yanında hedy kurbanı olan yoktu. Ali, yanında hedy kurbanı ile birlikte Ye-men'den geldi ve \"Resulullah Sallallahu Aleyhi ve Sellem neye niyet ettiyse ben de ona niyet ettim\" dedi. Hz. Nebi, yanında hedy kurbanı bulunanlar dışında ashabının hac yerine umre yapmalarına, Kabe'yi tavaf ettikten sonra tıraş olarak ihramdan çıkmalarına izin verdi. Bunun üzerine ashab \"erkeklik organımızdan meni akar olduğu halde Mina'ya mı gideceğiz!\" dediler. Hz. Nebi'e bu soz ulaşınca o şöyle buyurdu: \"Böyle olacağını daha önceden bilseydim yanımda hedy kurbanı getirmezdim. Yanımda hedy kurbanı olmasaydı ihramdan çıkardım\". Aişe (r.anha) adet gördüğü halde, Kabe'yi tavaf etmek dışında hac ile ilgili fiillerin tümünü yerine getirdi. Temizlenip de tavaf yaptıktan sonra: \"Ey Allah'ın Resulü! Siz hem umre hem de hac yapmış olarak dönerken ben yalnızca hac yapmış olarak mı döneceğim?\" dedi. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem (Aişe r.anha'nin kardeşi) Abdurrahman İbn Ebu Bekir'e Aişe r.anha ile birlikte Ten'im'e gitmesini emretti. Hz.Aişe, hacdan sonra Zilhicce ayında umre yaptı. Süraka İbn Cu'şum, şeytan taşladığı sırada Nebi Sallallahu Aleyhi ve Sellem ile karşılaştı ve ona \"bu yalnızca size mi özgü ey Allah'ın Resulü?\" diye sordu. Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Hayır. Sonsuza kadar (bütün insanlar) için",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1786,
			"arabicnumber": 1786,
			"text": "Aişe r.anha şöyle dedi: Resulullah Sallallahu Aleyhi ve Sellem ile birlikte (Zilkade ayını bitirip) Zilhicce hilali ile birlikte yola çıktık. Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Siz'den umre için telbiye getirecek olan yapsın. Hac için telbiye getirecek olan da umre için telbiye yapsın. Ben yanımda hedy kurbanı götürmemiş olsaydım umre için telbiye getirirdim\", İçimizden kimileri umre kimileri de hac için telbiye getirdi. Ben de umre için telbiye getirmiştim. Mekke'ye girmeden önce adet oldum, arefe gününe adetli iken ulaştım. Resulullah'a dert yandım o şöyle buyurdu: \"Umreni terk et (ihram­dan çık). Saçlarını çöz ve tara. Hac için telbiye getir.\" Ben de öyle yaptım. Muhassab'ta konaklayacağımız gece kardeşim Abdurrahman ile birlikte beni Ten'im'e gönderdi. Ben de daha önceki umremin yerine umre için telbiye getirdim. Böylece Allah Aişe r.anha'ye hem haccı hem umreyi nasip etmiş oldu. Bunların hiç birinde ne hedy, ne sadaka ne de oruç vardı",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1787,
			"arabicnumber": 1787,
			"text": "İbn Avn, Kasım b. Muhammed ve Esved'den şunu nakletmiştir: Aişe r.anha: Ey Allah'ın Resulü, herkes iki ibadeti (hac ve umreyi) yaparak Medine'ye dönüyor, ben ise yalnızca bir tanesini (haccı) yaparak döneceğim, dedi. Aişe r.anha'ya (Hz.Nebi tarafından) şöyle denildi: \"Bekle. Temizlenince Ten'im'e çık ve umre için ihrama gir. Sonra falan yerde buluşalım. Ancak senin umren’in sevabı) yapacağın harcamaya [yahut çekeceğin yorgunluğa] göredir",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1788,
			"arabicnumber": 1788,
			"text": "Aişe r.anha şöyle dedi: Hacca niyet ederek, hac aylarında ve hac yasaklarına riayet ederek yola çıktık. Serif denilen yere ulaştığımızda Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Yanında hedy kurbanı bulunmayan ve haccını umreye çevirmek isteyen kimse bunu yapsın. Yanında hedy kurbanı bulunnan bunu yapmasın\". Nebi Sallallahu Aleyhi ve Sellem'in ve ashabından kuvvetli bir kısmının yanında hedy kurbanı vardı, bunların hac ihramını umreye çevirme imkanı yoktu. Ben ağlarken Nebi Sallallahu Aleyhi ve Sellem yanıma geldi. Bana: \"Niçin ağlıyorsun?\" buyurdu. Ben: Senin ashabına söylediklerini işittim. Ben umre yapamadım, dedim. Hz.Nebi: \"Niçin yapamadın?\" diye sordu. Ben: Çünkü namaz kılamayacak durumdayım (adet gördüm), dedim. Hz. Nebi: \"Zararı yok. Sen adem'in kızlarındansın. Onlar için takdir edilenler sana da takdir edilmiştir. Sen haccını yapmaya devam et. Belki Aaah sana umreyi de nasip eder\" dedi. Mina'dan dönüp de Muhassab'ta konaklayıncaya kadar bekledim. Nebi Sallallahu Aleyhi ve Sellem (kardeşim) Abdurrahman'ı çağırarak şöyle buyurdu: \"Kızkardeşini harem bölgesinden çıkar, umre için İhrama girsin. Sonra tavafınızı bitirin. Sizi şurada bekliyorum.\" Gece yarısı onların yanına geldik. Nebi Sallallahu Aleyhi ve Sellem.: \"Bitirdiniz mi?\" diye sordu. Ben: Evet, dedim. Ashabına hareket emri verdi. İnsanlar harekete geçti. Sabah namazından önce Kabe'yi tavaf ettiler sonra da Medine'ye doğru harekete geçtiler",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1789,
			"arabicnumber": 1789,
			"text": "Safvan îbn Ya'la İbn Ümeyye babasından şunu nakletmiştir: Nebimiz Ci'rane'de iken bir adam geldi, üzerinde güzel koku (yahut kokunun sarı izi) görülen bir cübbe vardı. Adam: Umre'de ne yapmamı emredersin, diye sordu. Bunun üzerine Allah, Nebi Sallallahu Aleyhi ve Sellem'e vahiy indirdi, vahiy gelirken Nebi Sallallahu Aleyhi ve Sellem'in üzeri örtüldü. Ben, Hz.Nebi'e vahiy indirilirken onu görmek istiyordum. Bu sebeple Ömer; \"Gel. Hz.Nebi'e vahiy indirildiğinde onu görmek istiyor musun?\" dedi. Ben \"evet\" dedim. Hz. Nebi'in üzerindeki örtünün bîr bölümünü açtı. Baktığımda küçük deve yavrusunun sesi gibi ses geliyordu. Vahyin yol açtığı durum ortadan kalktığında Hz. Nebi (Sallallahu aleyhi ve Sellem): \"Umreyi soran kişi nerede? Üzerinden cübbeni çıkar. Güzel kokuyu yıka, sarı rengi gider. Hacda ne yapıyorsan umrede de onu yap'' buyurdu",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1790,
			"arabicnumber": 1790,
			"text": "Hişam İbn Urve, babasından şunu rivayet etmiştir: Ben, daha yaşım genç iken Nebi Sallallahu Aleyhi ve Sellem'in hanımı Aişe r.anha'ye sordum: Yüce Allah ayette \"Şüphe yok ki, Safa ile Merve Allah'ın koydu­ğu nişanlardandır. Her kim Beytullah'ı ziyaret eder veya umre yaparsa onları tavaf etmesinde kendisine bir günah yoktur.\" [Bakara 158] buyurduğundan bana göre bu ikisini tavaf etmeyen kişi üzerine herhangi bir şeyi gerekli görmem. Aişe r.anha şöyle dedi: Hayır, senin dediğin gibi olsaydı o ikisini tavaf etmesinde bîr günah olmazdı. Ancak bu ayet asıl Ensar hakkında indirilmiştir. Onlar Menat put'u için hac yaparlardı. Menat, Kadîd denilen yerin hizasındaydı. Onlar, Safa ile Merve arasında tavaf yapmayı günah sayıyorlardı. İslam dini gelince bunun hükmünü Resulullah Sallallahu Aleyhi ve Sellem'e sordular. Yüce Allah da Şüphe yok ki, Safa ile Merve Allah'ın koyduğu nişanlardandır. Her kim Beytullah'ı ziyaret eder veya umre yaparsa onları tavaf etmesinde kendisine bir günah yoktur.\" ayetini indirdi. Hişam'dan şu fazlalık rivayet edilmiştir: \"Allah, Safa ile Merve arasında tavaf yapmayan kişinin ne haccını ne de umresini tamam kılar",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1792,
			"arabicnumber": 1792,
			"text": "Arkadaşım, yine Abdullah'a: Bize Rasûlüllah'ın Hadîce bintu Huveylid için söylediği sözü tahdîs et dedi. ibn Ebî Evfâ da: Rasûlüllah: \"Hadîce'yi cennette inciden yapılmış bir evle müjdeleyiniz ki, onun içinde gürültü yoktur, çalışıp yorulma yoktur\" buyurdu",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1794,
			"arabicnumber": 1794,
			"text": "",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1795,
			"arabicnumber": 1795,
			"text": "Ebu Musa el-Eş'arî r.a. şöyle dedi: Nebi Sallallahu Aleyhi ve Sellem Batha'da devesini çöktürmüş iken onun yanına vardım. Bana: \"Hac yaptın mı?\" diye sordu. Ben: Evet, dedim. Nebi (Sallallahu aleyhi ve Sellem): \"Nasıl telbiye getirdin?\" diye sordu. Ben: \"Nebi'in telbiye getirdiği gibi telbiye getiriyorum\" diyerek telbiye getirdim, dedim. Nebi (Sallallahu aleyhi ve Sellem): \"İyi yapmışsın. Kabe'yi, Safa ile Merve'yi tavaf et, sonra da ihramdan çık\" buyurdu. Ben de Kabe'yi tavaf ettim, sonra Safa ile Merve arasında tavaf yaptım. Sonra Kays kabilesinden bir kadına rastladım, saçımı ayıkladı. Sonra da hac için telbiye getirdim. İnsanlara da bu yönde fetva veriyordum. Ömer r.a.'in halifeliği zamanında o bana şöyle dedi: Allah'ın kitabını esas alırsak o bize umreyi tamamlamayı söylüyor. Nebi Sallallahu Aleyhi ve Sellem'in sözünü esas alırsak o, hedy kurbanı kesim yerine ulaşmadıkça ihramdan Çıkmadı",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1796,
			"arabicnumber": 1796,
			"text": "Ebu Bekir'in kızı Esma'nın azatlısı Abdullah, Esma'nın her Cuhun'a gidişte şöyle dediğini duyardı: Allah, Muhammed Sallallahu Aleyhi ve Sellem'e merhamet etsin. Onunla birlikte burada konakladık. O zaman eşyamız hafif, devemiz ve azığımız da azdı. Ben, kardeşim Aişe, Zübeyr ve falanlar umre için ihram'a girdik. Kabe'ye ellerimizi sürdüğümüzde geceden hac için telbiye getirdik",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1797,
			"arabicnumber": 1797,
			"text": "Abdullah İbn Ömer r.a. şöyle dedi: Resulullah Sallallahu Aleyhi ve Sellem, bir gazadan, hac'dan veya umre'den dönerken, her ne zaman yüksekçe bir yere tırmansa üç kere tekbir getirdikten sonra şöyle derdi: La ilahe illalîahu vahdehu la şerike leh. Lehul mulku ve lehul hamdu ve huve ala kulli şeyin kadir, ayibune, taibune, 'abldune, sacidune, li Rabbina hamidun. Sadakallahu va'deh ve nasara abdeh ve hezeme'l-ahzab vahdeh. 'Allah'tan başka ilah yoktur, O tektir, ortağı yoktur. Mülk O'nundur, hamd O'na aittir, O'nun her şeye gücü yeter. Bizler geri dönüyoruz, tevbe ediyor, Rabbîmize kulluk ediyor, secde ediyor, Rabbimize hamd ediyoruz. Allah va'dini yerine getirdi, kuluna (Muhammed s.a.v.'e) yardım etti, (kafir) orduları hezimete uğrattı\". Tekrar: 2995, 3084, 4116, 6385",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1798,
			"arabicnumber": 1798,
			"text": "İbn Abbas r.a. şunları söyledi: Nebi Sallallahu Aleyhi ve Sellem Mekke'ye geldiğinde Abdülmuttalib oğulları'nın çocukları onu karşıladı. Nebi Sallallahu Aleyhi ve Sellem bunlardan birini önüne birini de arkasına bindirdi. Tekrar: 5965, 5966",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1799,
			"arabicnumber": 1799,
			"text": "İbn Ömer r.a. şöyle dedi: Resulullah (Sallallahu Aleyhi ve Sellem) Mekke'ye yola çıktığı zaman ağacın bulunduğu yerdeki mescidde namaz kılardı. Mekke'den geri döndüğünde de Vadî'nin ortasında Zul Huleyfe'de namaz kılar, sabah oluncaya kadar orada konaklardı",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1800,
			"arabicnumber": 1800,
			"text": "Enes r.a. şöyle dedi: Resulullah Sallallahu Aleyhi ve Sellem (yolculuktan döndüğünde) ailesinin yanına geceleyin gelmezdi. Ya sabah yahut akşamleyin gelirdi",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1801,
			"arabicnumber": 1801,
			"text": "Cabir r.a. şöyle dedi: Nebi Sallallahu Aleyhi ve Sellem (yolculuktan dönen) kişinin gece vakti ailesinin yanına gelmesini yasakladı",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1802,
			"arabicnumber": 1802,
			"text": "Enes r.a. şöyle dedi: Resulullah Sallallahu Aleyhi ve Sellem yolculuktan dönüp de Medine'nin yüksek yollarını görünce devesini hızlı sürerdi, Medine'ye bir an önce ulaşmayı istediğinden bineğini harekete geçirirdi. Tekrar: 1886",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1803,
			"arabicnumber": 1803,
			"text": "Ebu İshak şöyle dedi: Bera r.a.'in şöyle dediğini işittim: Bu ayet biz Ensar hakkında indirildi. Ensar hac yapıp da döndüğünde evlerinin kapısından girmezler, arkalarından girerlerdi. Ensar'dan bir adam hac'dan döndükten sonra eve kapısından girdi. Sanki bu fiili sebebiyle insanlar tarafından kınandı. Bunun üzerine şu ayetler indirildi: \"İyi davranış, asla evlere arkalarından gelip girmeniz değildir. Lakin iyi davranış, korunan (ve ölçülü giden) kimsenin davranışıdır. Evlere kapılarından girin, Allah'tan korkun, umulur ki kurtuluşa erersiniz\".[Bakara, 189]",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1804,
			"arabicnumber": 1804,
			"text": "Ebu Hureyre r.a. Nebi Sallallahu Aleyhi ve Sellem'den şunu nakletmiştir: \"Yolculuk azab'tan bir parçadır; siz'den birinin yemeğine, içmesine ve uyumasına engel olur. Kişi ihtiyacını görünce ailesine dönmekte acele etsin\". Tekrar: 3001, 5429",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1805,
			"arabicnumber": 1805,
			"text": "Zeyd İbn Eslem babasından şunu aktarmıştır: Mekke yolunda Abdullah İbn Ömer ile birlikte idik. Safiyye binti Ebi Ubeyd'in çok hasta olduğu haberi ona ulaştı. Bunun üzerine acele etti. Şafak kaybolduktan sonra bineğinden inerek akşam ile yatsıyı cem ederek kıldı. Sonra da şöyle söyledi: Nebi Sallallahu Aleyhi ve Sellem'in yola devam etmekte acelesi olduğunda akşam namazını ertelediğini, akşam ile yatsıyı cem ettiğini gördüm. \"Haccı ve umreyi Allah için tam yapın. Eğer ihsar edilirseniz (alıkonursanız) kolayınıza gelen kurbanı gönderin. Kurban, yerine varıncaya kadar başlarınızı tıraş etmeyin.\" [Bakara 196] Ata' şöyle dedi: îhsar (engellenme), kişiyi alıkoyan her şeyden olur",
			"grades": [],
			"reference": {
				"book": 26,
				"hadith": 30
			}
		}
	]
}