{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"27": "Pilgrims Prevented from Completing the Pilgrimage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1806,
			"arabicnumber": 1806,
			"text": "Nafi' şöyle demiştir: Abdullah İbn Ömer r.a. kargaşa döneminde Mekke'ye doğru yola çıktığında şöyle dedi: Kabe'ye ulaşmam engellenirse Resulullah Sallallahu Aleyhi ve Sellem ile birlikte yaptığımız gibi yapar, umre için telbiye getiririm. Çünkü Resulullah Sallallahu Aleyhi ve Sellem de Hudeybiye antlaşmasının imzalandığı sene umre için telbiye getirmişti",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1807,
			"arabicnumber": 1807,
			"text": "Nafi' şöyle demiştir: Haccac'ın ordusu Abdullah İbn Zübeyr'le savaşmak üzere geldiğinde Abdullah İbn Ömer'in iki oğlu Ubeydullah ve Salim,babaları ile konuşarak şöyle dediler: \"Bu yıl hac yapmamanın sana bir zararı olmaz. Biz Kabe'ye gitmene engel olunmasından korkarız\". İbn Ömer şöyle dedi: Resulullah Sallallahu Aleyhi ve Sellem ile birlikte (umre yapmak üzere Mekke'ye doğru) yola çıktık. Kureyş kafirleri Kabe'ye gitmemize engel oldular. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem hedy kurbanını kesti, saçlarını kazıttı. Şahit olun ki ben de inşallah umre yapmaya niyet ediyorum. Gideceğim; şayet Kabe'ye gitmeme engel olunmazsa tavaf yapacağım. Şayet engel olunursa, Nebi Sallallahu Aleyhi ve Sellem ile birlikte olduğumda onun yaptığı gibi yapa­rım. İbn Ömer, Zu'l-Huleyfe'de umre için telbiye getirdi. Sonra bir miktar ilerledikten sonra şöyle dedi: \"Hac ile umrenin durumu aynıdır. Sizleri şahit tutarım ki ben umre ile birlikte hac İçin de telbiye getirdim\". Bayram günü olup da kurban kesmedikçe bu ikisinin ihramından çıkmadı. İbn Ömer şöyle söylerdi: \"Kişi Mekke'ye girdiğinde bir tavaf yapmadıkça ihramdan çıkamaz",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1808,
			"arabicnumber": 1808,
			"text": "Nafi' şöyle demiştir: Abdülmuttalib oğulları'ndan bazıları İbn Ömer'e: \"Burada kalsaydın\" dediler",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1809,
			"arabicnumber": 1809,
			"text": "İbn Abbas r.a. şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem'in umre yapması engellendi. Bunun üzerine saçlarını tıraş etti, eşleri ile birlikte oldu, hedy kurbanını kesti. Ertesi yıl umre yaptı",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1810,
			"arabicnumber": 1810,
			"text": "Salim, İbn Ömer r.a.'in şöyle söylediğini belirtmiştir: Resulullah Sallallahu Aleyhi ve Sellem'in sünneti size yetmiyor mu? (Hac İçin ihrama girmiş) birinizin hac yapmasına bir engel çıkarsa Kabe'yi tavaf eder, Safa ile Merve arasında sa'y yapar, sonra her türlü ihramdan çıkar. Ertesi yıl hac yapar ve hedy kurbanı keser. Şayet hedy bulamazsa bunun yerine oruç tutar",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1811,
			"arabicnumber": 1811,
			"text": "Misver r.a. şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem saçını kazıtmadan önce kurbanını kesti ve ashabına da böyle yapmalarını emretti",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1812,
			"arabicnumber": 1812,
			"text": "Nafi'in rivayet ettiğine göre Ubeydullah ve Salim, (babaları) Abdullah İbn Ömer ile konuştular. İbn Ömer r.a. onlara şöyle dedi: Nebi Sallallahu Aleyhi ve Sellem ile birlikte umre yapmak için çıktık. Kureyş kafirleri Kabe'ye gitmemize engel oldular. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem kurbanını kesti ve başını kazıttı",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1813,
			"arabicnumber": 1813,
			"text": "Nafi'den rivayet edildiğine göre, İbn Ömer, kargaşa döneminde umre yapmak İçin Mekke'ye doğru yola çıktığında şöyle dedi: \"Kabe'ye ulaşmam engellenirse, Resulullah Sallallahu Aleyhi ve Sellem ile birlikte olduğumuz sırada o ne yaptıysa biz de onu yaparız\". Nebi Sallallahu Aleyhi ve Sellem Hudeybiye yılında umre için telbiye getirdiğinden Ibn Ömer de umre için telbiye getirdi. Sonra durumu inceledi ve \"haccın da umrenin de durumu aynıdır\" dedi, arkadaşlarına dönerek \"hac da umre de aynı durumdadır. Sizi şahit tutarım ki ben umre ile birlikte hac yapmaya niyet ettim\". Sonra her ikisi için de bir tavaf yaptı, bu tavafın yeterli olacağını düşündü. Hedy kurbanı kesti",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1814,
			"arabicnumber": 1814,
			"text": "Resulullah Sallallahu Aleyhi ve Sellem, Ka'b İbn Ucre'ye: \"Herhalde bitler sana eziyet veriyor\" dedi. Ka'b: Evet Ey Allah'ın Resulü! diye cevap verdi. Resulullah Sallallahu Aleyhi ve Sellem: \"Saçlarını kazıt. Üç gün oruç tut veya altı fakiri doyur yahut bir koyun kes\" buyurdu. Tekrar: 1815. 1816, 1817, 1818, 4159, 4190, 4191, 4517, 5665, 5703, 6808",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1815,
			"arabicnumber": 1815,
			"text": "Ka'b b. Ucre şöyle demiştir: Hudeybiye'de Resulullah Sallallahu Aleyhi ve Sellem baş ucumda durdu, başımdan bitler düşüyordu. Bana: \"Bitler sana zarar veriyor mu?\" diye sordu. Ben: \"Evet\", dedim. Resulullah Sallallahu Aleyhi ve Sellem: \"Öyleyse başını kazıt\". Ka'b şöyle dedi: \"Sizden her kim hasta olursa yahut başından bir rahatsızlığı varsa...\" ayeti benim hakkımda indirildi. Resulullah (Sallallahu aleyhi ve Sellem) şöyle buyurdu: \"Üç gün oruç tut veya bir ferak buğdayı altı fakire dağıt, yahut kolayına gelen bir kurban kes",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1816,
			"arabicnumber": 1816,
			"text": "Abdullah b. Ma'kil şöyle dedi: Ka'b İbn Ucre r.a.'in yanına oturdum. Ona fidye konusunu sordum, şöyle dedi: Bu konu ile ilgili ayet benim hakkımda indirilmekle birlikte hükmü hepiniz hakkında geçerlidir. Başımdaki bitler yüzüme doğru dökülürken Resulullah (Sallallahu aleyhi ve Sellem)'ın huzuruna götürüldüm. Bana: \"Ben bitlerin sana bu kadar eziyet edeceğini sanmazdım. Bir koyun alabilir misin?\" diye sordu. Ben \"hayır\" dedim. Resulullah Sallallahu Aleyhi ve Sellem: \"Öyleyse üç gun oruç tut veya her bir fakire yarım sa' olacak şekilde altı fakiri doyur\" buyurdu",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1817,
			"arabicnumber": 1817,
			"text": "Ka'b b. Ucre r.a.'den rivayet edildiğine göre Resulullah Sallallahu Aleyhi ve Sellem onu, başındaki bitler yüzüne düşerken gördü ve ona: \"Bitler sana eziyet ediyor mu?\" diye sordu. Ka'b: Evet, diye cevap verdi. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem Hudeybiye'de saçlarını kazıtmasını emretti. [Hadisi rivayet eden kişi dedi ki:] Sahabe, Hudeybiye'de ihramdan çıkacaklarını bilmiyorlar, Mekke'ye gireceklerini ümit ediyorlardı. Yüce Allah fidye ile ilgili ayeti indirdi. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem Ka'b'a bir farak buğdayı altı kişiye dağıtmasını veya bir koyun kurban kesmesini yahut üç gün oruç tutmasını emretti",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1818,
			"arabicnumber": 1818,
			"text": "Ka'b İbn Ucre'den rivayet edildiğine göre saçlarındaki bitler yüzüne doğru inerken Resulullah Sallallahu Aleyhi ve Sellem onu gördü",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1819,
			"arabicnumber": 1819,
			"text": "Ebu Hureyre r.a., Resulullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu söyledi: \"Kim bu evi tavaf eder de kadına yaklaşmaz ve fısk'a düşmezse anasından doğduğu gibi (günahsız bir şekilde) yurduna döner\". باب: قول الله عز وجل: {ولا فسوق ولا جدال في الحج}. /البقرة: 197/. 10- (Hac Esnasında) Günah Sayılan Davranışlara Yönelmek, Kavga Etmek Yoktur",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1820,
			"arabicnumber": 1820,
			"text": "Ebu Hureyre r.a., Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu söyledi: \"Kim bu evi (Kabe'yi) tavaf eder de kadına yaklaşmaz ve fıska düşmezse anasından doğduğu gibi yurduna döner. [Ayrıca bkz. 1521. hadis]",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 15
			}
		}
	]
}