{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"28": "Penalty of Hunting while on Pilgrimage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1821,
			"arabicnumber": 1821,
			"text": "Ebu Katade'nin oğlu Abdullah şöyle demiştir: Hudeybiye antlaşmasının yapıldığı yıl babam da gitti. Arkadaşları ihrama girdiği halde o ihrama girmedi. Nebi Sallallahu Aleyhi ve Sellem'e kendisi ile savaşmak isteyen bir ordunun bulunduğu haber verildi. Nebi Sallallahu Aleyhi ve Sellem de bunun üzerine hareket etti. (Ebu Katade dedi ki): Ben, onun ashabının yanına vardığım zaman onların gülüştüğünü gördüm. Baktım, yanımda vahşî bir eşek sürüsü var. Birine hamle yaptım, ok fırlattım, hareketsiz hale getirdim. Onlardan yardım istedim. Onlar yardım etmekten kaçındılar. Ben onu öldürdüm, etinden yedik. Düşmanın Hz. Peygamber ile aramıza gireceğinden korktuk. Hz. Peygamber'i aramaya koyuldum. Atımı bazen koşturuyor bazen yürütüyordum. Gece yarısı Benî Gıfar kabilesinden bir adama rastladım. Ona: \"Nebi Sallallahu Aleyhi ve Sellem'den nerede ayrıldın?\" diye sordum. Adam şöyle dedi: \"Ta'hin'de ayrıldım. Sukya denilen yerde öğle uykusu uyumak üzereydi\" dedi. Ben: \"Ey Allah'ın Resulü! Ashabın sana selam söylüyor. Onlar düşmanın seninle onların arasına girmesinden korktular. Onları bekle\" dedim. Daha sonra Şöyle dedim: \"Ey Allah'ın Resulü vahşî bir eşek avladım. Yanımda ondan kalan bir parça var\". Allah'ın Resulü, ihramlı olan ashabına \"yiyiniz\" buyurdu. Tekrar: 1822, 1823, 1824, 2570, 2854, 2914, 4149, 5406, 5407, 5490, 5491, 5492",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1822,
			"arabicnumber": 1822,
			"text": "Abdullah İbn Ebu Katade, babasından şunu aktardı: Hudeybiye antlaşmasının yapıldığı yıl Nebi Sallallahu Aleyhi ve Sellem ile birlikte gittik. O'nun ashabı ihrama girdikleri halde ben ihrama girmedim. Gayka denilen yere geldiğimizde, düşman birliğinin bulunduğu bize haber verildi. Onlara doğru yöneldik. Arkadaşlarım vahşi bir eşek (zebra) sürüsü gördüler. Birbiriyle gülmeye başladılar. Bunun üzerine ben de geriye bir baktım ve sürü­yü gördüm. Atımı sürünün üzerine doğru sürdüm. Okumu fırlattım ve birini vur­dum. Arkadaşlarımdan yardım istedim, yardım etmekten kaçındılar. Daha sonra onun etinden yedik. Resulullah Sallallahu Aleyhi ve Sellem'e ulaşmak için yola çıktık. Düşmanın onunla aramıza girmesinden korktuk. Bu yüzden atımı bazen hızlı koşturuyor, bazen de yürütüyordum. Gece yarısı Gıfar kabilesinden bir adamla karşılaştım. Ona: \"Sen Resulullah Sallallahu Aleyhi ve Sellem'den nerede ayrıldın?\" diye sordum. Adam: \"Ta'hin denilen yerde öğle uykusuna yattığı sırada ayrıldım\" dedi. Nihayet Resulullah Sallallahu Aleyhi ve Sellem'e ulaştım. Ona: \"Ey Allah'ın Resulü arkadaşların sana selam söylüyorlar. Onlar, düşmanın seninle aralarına girmelerinden korktular. Onları bekle\" dedim. Resulullah da bekledi. Ben: \"Ey Allah'ın Resulü biz vahşi bir eşek/zebra avladık. Yanımızda ondan bir parça da arttı\" dedim. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem ihramlı olan ashabına \"yiyiniz\" buyurdu",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1823,
			"arabicnumber": 1823,
			"text": "Ebu Katade r.a. şöyle dedi: Nebi Sallallahu Aleyhi ve Sellem ile birlikte Medine'ye üç günlük mesafede Kaha denilen yerde idik. (Diğer rivayette ise şöyle denilmektedir): Nebi Sallallahu Aleyhi ve Sellem ile birlikte Kaha'da idik. Kimimiz ihrarnlı kimimiz ihramlı değildi. Arkadaşlarımın bir şeye baktıklarını gördüm. Bîr de baktım ki bir vahşi eşek sürüsü! Arkadaşlarımdan yardım istedim. Onlar: \"Bu konuda sana hiçbir şekilde yardım edemeyiz, biz ihramlıyız\" dediler. Bunun üzerine sürüden bir eşeğe hamle yaptım, bir taşın ardından yaklaşıp avladım. Avımı alıp arkadaşlarıma getirdim. Bazıları \"yiyiniz\", bazıları da \"yemeyiniz\" dediler. Biraz ilerimizde bulunan Nebi Sallallahu Aleyhi ve Sellem'e vardım ve sordum. Nebi Sallallahu Aleyhi ve Sellem: \"Yiyiniz, helaldir\" buyurdu",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1824,
			"arabicnumber": 1824,
			"text": "Ebu Katade'nin oğlu Abdullah babasından şunu aktarmıştır: Resulullah Sallallahu Aleyhi ve Sellem hac yapmak için yola çıktı. Ashabı da onunla birlikte çıktılar. Ebu Katade'nin de içinde bulunduğu bir grup topluluktan koptular. Ebu Katade \"Resulullah'a kavuşmak için deniz sahiline doğru gidelim\" dedi. Arkadaşları da deniz sahiline doğru yöneldiler. Yola çıkınca Ebu Katade dışındakiler ihrama girdi, o girmedi. İlerlerken yolda vahşi eşekler gördüler. Ebu Katade sürüye doğru hamle yaparak birini avladı. Arkadaşları bineklerinden inerek onun etinden yediler. Sonra da \"ihramli iken av hayvanı mı yiyoruz?\" dediler. (Ebu Katade dedi ki); Eşekten geriye kalan eti yanımızda taşıdık. Resulullah Sallallahu Aleyhi ve Sellem'in yanına varınca şöyle dediler: \"Ey Allah'ın Resulü! Biz ihramlı idik, Ebu Katade ise ihramlı değildi. Vahşi bir eşek sürüsü gördük. Ebu Katade sürüye hamle yaparak birini avladı. Biz de bineklerimizden inerek onun etinden yedik. Sonra da: İhramlı iken av hayvanı mı yiyoruz? dedik. Geriye kalan eti de yanımızda getirdik\". Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: 'İçinizden herhangi biri ona (Ebu Katade'ye) saldırmasını emretti mi, yahut işarette bulundu mu?\" Oradakiler: Hayır, dediler. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem: \"Öyleyse etin geriye kalan kısmını da yiyiniz\" buyurdu",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1825,
			"arabicnumber": 1825,
			"text": "Sa'b İbn Cessame el-Leysî, Resulullah Sallallahu Aleyhi ve Sellem Ebva'da iken kendisine vahşî bir eşek/zebra hediye etti. Nebi Sallallahu Aleyhi ve Sellem bunu geri verdi. Sa'b'ın yüzündeki hoşnutsuzluğu sezince ona şöyle buyurdu: \"Biz yalnızca ihramlı olduğumuz için bunu sana geri verdik\". Tekrar: 2596, 2573",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1826,
			"arabicnumber": 1826,
			"text": "Abdullah İbn Ömer r.a. Resulullah Sallallahu Aleyhi ve Sellem'in şöyle dediğini nakleder: \"Beş tür hayvan vardır ki bunların öldürülmesinde ihramlı için bir günah söz konusu değildir\". Tekrar: 3315 [-1827-] İbn Ömer r.a. şöyle dedi: Nebi Sallallahu Aleyhi ve Sellem eşlerinden biri bana Hz. Nebi'in şöyle buyurduğunu söyledi: \"İhramlı kişi şunları öldürebilir:\" Tekrar:1828",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1827,
			"arabicnumber": 1827,
			"text": "",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1828,
			"arabicnumber": 1828,
			"text": "Abdullah İbn Ömer r.a., Hafsa r.anha'nın şöyle söylediğini belirtti: Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Şu beş hayvanın öldürülmesinde, öldürene herhangi bir günah söz konusu değildir: Karga, çaylak, fare, akrep ve kelb-i akur.\" Not: Kelb-i Akur’un ne olduğu bir sonraki sayfa’da açıklama bölümünde",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1829,
			"arabicnumber": 1829,
			"text": "Aişe r.anha'den rivayet edilmiştir: Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Beş hayvan vardır ki bunların tümü fasıktır. Bunlar harem bölgesinde de öldürülür: Karga, çaylak, akrep, fare, kelb-i akur\". Tekrar: 3314",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1830,
			"arabicnumber": 1830,
			"text": "Abdullah r.a. şöyle dedi: Biz Mina'da bir mağarada Nebi Sallallahu Aleyhi ve Sellem ile birlikteyken kendisine \"Mürselat\" suresi indirildi. Nebi Sallallahu Aleyhi ve Sellem okuyor, ben de henüz okuması dolayısıyla ağzı kurumadan onun okuduklarını ezberliyordum. Birden üzerimize bir yılan sıçradı. Nebi Sallallahu Aleyhi ve Sellem: \"Onu öldürün\" buyurdu. Biz onu öldürmek için hemen davrandık ki yılan kaçtı. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem: \"Siz onun şerrinden korunduğunuz gibi o da sizin şerrinizden korundu\" buyurdu. Tekrar: 3317, 4930, 4931, 4934",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1831,
			"arabicnumber": 1831,
			"text": "Nebi Sallallahu Aleyhi ve Sellem'in eşi Aişe r.anha \"Resulullah Sallallahu Aleyhi ve Sellem'in keler'e \"fasıkçık\" dediğini işittim ancak onun öldürülmesini emrettiğini işitmedim.\" Tekrar: 3306",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1832,
			"arabicnumber": 1832,
			"text": "Ebu Şüreyh el-Adevî, Mekke'ye (Abdullah İbn Zübeyr'e karşı savaşmak üzere) ordular gönderen Amr İbn Saîd'e şöyle dedi: Ey Emir! İzin ver de sana bir şey anlatayım. Resulullah Sallallahu Aleyhi ve Sellem Mekke'nin fethinin ertesi günü bir konuşma yaptı. Onu bu kulaklarım işitti, kalbim söylediklerini kavradı, gözlerim konuşma yaparken onu gördü. Nebi Sallallahu Aleyhi ve Sellem Allah'a hamdü senada bulunduktan sonra şöyle buyurdu: \"Mekke'yi Allah haram bölge kılmıştır, onu insanlar haram kılmamıştır. Allah'a ve ahiret gününe inanan bir kişinin orada kan akıtması helal olmaz. Mekke'nin bitkisi koparılmaz. Şayet Allah Resulü'nün orada savaş yaptığını ileri sürerek kendisine ruhsat çıkarmak isteyen birisi olursa ona şöyle deyiniz: \"Allah, yalnızca Resulüne izin verdi, size izin vermedi\". Allah bana da yalnızca gündüzün belirli bir anında izin verdi. Bugün Mekke'nin haramiığı dünkü haline geri döndü. Burada bulunanlar bulunmayanlara aktarsın.\" Ebu Şüreyh'e: \"Amr sana ne dedi?\" diye soruldu. Ebu Şüreyh dedi ki: Bana şöyle cevap verdi: \"Ben bunu senden daha iyi bilirim ey Ebu Şüreyh! Harem bölgesi bir asîye, öldürülmesi gerekli olan bir kimseye, hırsızlık yaparak cezadan kurtulmak isteyene sığınak olamaz\". Hadis’ten Çıkarılan Bazı Hükümler: 1- Bu olay, yönetici ile konuşurken, onların öğütlere daha çok kulak ver­melerini sağlamak için yumuşak bir üslup kullanmaya dair bir örnektir. 2- özellikle de itiraza konu olabilecek bir mesele ile ilgili olarak yöneticiler ile konuşmadan önce onlardan izin almak yerinde olur. İzin almadan söze başlamak ve ağır konuşmak, kişinin kendini öne çıkarması ve karşıdakinin de inat göstermesine sebep olur. 3- İlim öğretme, hükümleri açıklama ve önemli İşlerde konuşma yapmadan önce Allah'a hamdü senada bulunmak müstehabtır. Hadisten ilk anda anlaşıldığına göre Mekke halkına karşı savaş yapılması yasaktır. Oraya sığınan güvenlikte olur, kendisine ilişilmez. \"Oraya giren emin olur\", \"Görmezler mi ki biz (yaşadıkları yeri) kendilerine güvenlikli bir harem kıldık\" ayetlerinin yorumu konusunda müfessirlerin ortaya koyduğu iki görüşten biri de bu yöndedir. Hz. Nebi'in \"Allah'a ve ahiret gününe inanan...\" şeklindeki ifadeleri, emre itaatin sağlanması İçindir. Çünkü Allah'a inanan kişinin ona İtaat etmesi gerekir. Ahirete inanan kimsenin de emredilen şeyi yerine getirmesi, yasaklanan şeyden de hesap sorulma korkusuyla uzak durması gerekir. Bu hadis, Mekke'de adam öldürme ve savaş yapmanın haram olduğuna delil olarak gösterilmiştir. Harem Bölgesindeki Hangi Bitkilerin Koparılması Yasaktır? Kurtubî şunları kaydeder: Fakihler koparılması yasaklanan otları, insanların bir müdahalesi söz konusu olmaksızın Allah tarafından bitirilen bitkiler ile sınırlandırmışlardır. İnsanların müdahalesi ile yetişen bitkilerin koparılması konusunda ise farklı görüşler ileri sürülmüştür. a- Alimlerin çoğunluğu bunun caiz olduğunu söylemişlerdir. b- Şafiî, her tür bitkinin koparılmasında cezanın gerektiğini söylemiştir. İbn Kudame de bu görüşü tercih etmiştir. İnsanların müdahalesi olmaksızın yetişen bitkilerin koparılması durumunda cezanın ne olacağı konusunda farklı görüşler söz konusudur: a- Malik \"bunda ceza söz konusu değildir, kişi günahkar olur\" demiştir. b- Ata 'Allah'tan bağışlanma diler\" demiştir. c- Ebu Hanife \"kıymeti ile hedy kurbanı alınarak kesilir\" demiştir. d- Şafiî \"büyük bitki koparma durumunda sığır, daha düşüğünde koyun gerekir\" demiştir. İbnü'l-Arabî şöyle demiştir: \"Fakihler, harem bölgesinin bitkisinin koparılma­sının haram kılındığında ittifak etmişlerdir. Ancak Şafiî ağaç dallarından misvak kesilmesini caiz görmüştür\". Ebu Sevr de Şafiî'den bu görüşü nakletmiştir. Nebi Sallallahu Aleyhi ve Sellem'in \"gündüzün bir anında\" dediği süre, güneşin doğuşundan İkindi vaktine kadar olan süredir. İbn Cerîr şöyle der: Nebi Sallallahu Aleyhi ve Sellem'in \"burada bulunanlar bulunmayanlara aktarsın\" ifadesinde haber-i vahidin kabul edileceğine dair delil vardır. Çünkü bu söz, konuşmada bulunan her bir şahsın dinlediklerini aktarmasını gerektirir. Nebi Sallallahu Aleyhi ve Sellem yalnızca, tıpkı dinieyen gibi aktarımda bulunulan kimselerin de amel etmesi gerekli olduğu için, orada bulunanların aktarmasını emretmiştir. Aksi taktirde aktarma emrinin bir anlamı kalmazdı. Had cezası olarak öldürülmesi gerekli olan ve Harem bölgesine sığınan kimsenin durumu da alimler arasında görüş ayrılığına neden olmuştur. Ebu Şüreyh'in Hadisinden Çıkan Diğer Bazı Sonuçlar 1- Kişi kendisinin, güvenilir ve dinlediğini ezberinde tutabilen bir kimse olduğunu ortaya koyabilir. 2- Alim bir kimse, yönetimde bulunanların din ile ilgili işlerden herhangi birini değiştirdiğini gördüğünde onlara tepkisini gösterir, yumuşak bir şekilde öğüt verir ve tedrice riayet eder. 3- Dine aykırı bir şeye karşı tepkinin ortaya konulması sırasında durumu elle değiştirmek mümkün olmadığında, tepki dile getirilmekle yetinilir. 4- Etkili söz söylerken söz pekiştirilerek söylenir. 5- Din ile ilgili konularda tartışma yapmak caizdir. 6- Dinî hükümlerde nesh (bir hükmün, sonraki bir hükümle yürürlükten kaldırılması) caizdir. 7- İçtihada açık bir konuda, bir müctehidin ulaştığı hüküm başka bir müctehid hakkında bağlayıcı olmaz. 8- Tebliği yerine getirerek sorumluluktan kurtulmak ve istenmeyen durum­lara sabretmek gerekir. Mekke'nin savaş yoluyla fethedildiği görüşünü kabul edenler bu hadîsi delil getirmişlerdir. باب: لا ينفر صيد الحرم. 9- Harem Bölgesinin Avı Ürkütülmez",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1833,
			"arabicnumber": 1833,
			"text": "İbn Abbas r.a., Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu söyledi: \"Allah Mekke'yi haram kıldı. Benden önce hiç kimseye helal kılınmadığı gibi benden sonra hiç kimseye de helal kılınmayacaktır. Bana da yalnızca gündüzün bir bölümünde helal kılındı. Mekke'nin yaş otu koparılmaz, ağacı sökülmez, avı ürkütülmez. Etrafa duyurmak için alma dışında yere düşürülen mal alınmaz\". (Hz. Nebi bu konuşmayı yaparken amcası) Abbas: \"Ey Allah'ın Resulü! îzhir otu hariç. Onu dökümcülükte ve kabirlerimizde kullanırız\" dedi. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem \"izhir otu hariç\" buyurdu",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1834,
			"arabicnumber": 1834,
			"text": "İbn Abbas r.a. şöyle dedi: Nebi Sallallahu Aleyhi ve Sellem Mekke'yi fethettiği gün şöyle buyurdu: \"Bundan böyle (Mekke'den Medine'ye) hicret yoktur. Ancak cihad etmek ve niyet vardır. Sizden sefere çıkmanız istendiğinde sefere çıkın. Burası, Allah'ın gökleri ve yeri yarattığı zaman haram kıldığı bir beldedir. Burası, Allah'ın haram kılması sebebiyle kıyamete kadar haramdır. Benden önce hiç kimsenin burada savaş yapması helal kılınmadı. Benim için de ancak gündüzün belirli bir anında helal kılındı. Burası Allah'ın haram kılması sebebiyle kıyamete kadar haramdır. Mekke'nin dikeni koparılmaz, avı ürkütülmez, du­yurmak amacı dışında düşürülen malı alınmaz, otu koparılmaz.\" Bu sırada Abbas şöyle dedi: Ey Allah'ın Resulü izhir hariç. Bu ot, Mekke'lilerin demircileri tarafından kullanılır, ayrıca evlerde de kullanılır. Hz.Nebi: \"İzhir hariç\" buyurdu",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1835,
			"arabicnumber": 1835,
			"text": "İbn Abbas r.a. şöyle dedi: Resulullah Sallallahu Aleyhi ve Sellem ihramlı iken kan aldırdı. Tekrar: 1938, 1939, 2103, 2278, 2279, 5691, 5694, 5695, 5699, 5700, 5701",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1836,
			"arabicnumber": 1836,
			"text": "İbn Buhayne r.a. şöyle dedi: Nebi Sallallahu Aleyhi ve Sellem Lahy-i cemel denilen yerde başının ortasından hacamat yaptırdı (kan aldırdı). Tekrar: 5698",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1837,
			"arabicnumber": 1837,
			"text": "İbn Abbas r.a. şöyle söyledi: Nebi Sallallahu Aleyhi ve Sellem Meymune ile ihramlı iken evlendi. Tekrar: 4258, 4259, 5114",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1838,
			"arabicnumber": 1838,
			"text": "Abdullah b. Ömer r.a. şöyle dedi: Bir adam kalkarak şöyle dedi: Ey Allah'ın Resulü! İhramlı iken hangi elbiseyi giymemizi emredersin? Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"İhramlı kişi gömlek, şalvar, sarık, burnus giyemez. Nalinleri (sandaletleri) yoksa mestlerini giyip ayak bileğindeki çıkıntılardan alt tarafını kessin. Zaferan ve vers ile boyanmış elbise giymeyin. İhramlı kadın yüzüne peçe takmasın, ellerine eldiven giymesin.\" Ubeydullah şöyle rivayet etti: \"İhramlı kadın yüzüne peçe örtemez, ellerine eldiven giyemez",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1839,
			"arabicnumber": 1839,
			"text": "İbn Abbas r.a. şöyle dedi: Bir deve ihramlı bir adamın boynunu kırarak onu öldürdü. Adamın cenazesi Resulullah Sallallahu Aleyhi ve Sellem'e getirildi. Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Onu yıkayın, kefenleyin, başını örtmeyin, güzel koku sürmeyin. Çünkü o telbiye getirerek diriltilecektir",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1840,
			"arabicnumber": 1840,
			"text": "Abdullah İbn Abbas ve Misver İbn Mahreme r.a. Ebva'da görüş ayrılığına düştüler: Abdullah İbn Abbas \"ihramlı kişi başını yıkayabilir\" dedi. Misver \"İhramlı kişi başını yıkayamaz\" dedi. (Ravi Abdullah İbn Huneyn dedi ki): İbn Abbas beni bu konuyu sormak üzere Ebu Eyyub el-Ensarî'ye gönderdi. Onu kuyu başında iki direk arasına gerilmiş perde gerisinde yıkanırken buldum. Selam verdim. \"Kimsin?\" diye sordu. Ben: \"Abdullah İbn Huneyn'im. Beni Abdullah İbn Abbas, Resulullah'ın ihramlı iken başını nasıl yıkadığını sormak için gönderdi\" dedim. Bunun üzerine Ebu Eyyub elini perdenin üzerine bastırdı, başı göründü. Kendisine su döken birine \"dök\" dedi. Adam onun başına su döktü. Sonra Ebu Eyyub iki elini başının üzerinde öne ve arkaya hareket ettirdi. Sonra \"Nebi Sallallahu Aleyhi ve Sellem'in böyle yaptığını gördüm\" dedi",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1841,
			"arabicnumber": 1841,
			"text": "İbn Abbas r.a. şöyle demiştir: Nebi Sallallahu Aleyhi ve Sellem'in Arafatta hutbe esnasında İhramlı kimse hakkında şöyle söylediğini işittim: \"Nalin bulamayan mestlerini giysin. İzar bulamayan sirval şalvar giysin.\" (Arapların sirval dedikleri şey ayak bileklerine kadar uzanan uzun iç çamaşırdır)",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1842,
			"arabicnumber": 1842,
			"text": "Abdullah r.a. şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem'e \"ihramlı kişi hangi elbiseleri giyebilir?\" diye soruldu. Nebi Sallallahu Aleyhi ve Sellem şöyle cevap verdi: \"(İhramlı kişi) gömlek, sarık, şalvar, burnus ve zaferan ve vers sürülmüş elbise giyemez. Nalin bulamazsa mest giysin ve ayak bileğindeki kemiklerden aşağıda kalacak şekilde üst kısmını kessin",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1843,
			"arabicnumber": 1843,
			"text": "ibn Abbas r.a. şöyle demiştir: Nebi Sallallahu Aleyhi ve Sellem Arafatta bize hutbe okuyarak şöyle buyurdu: 'İzar bulamayan sirval giysin. Nalin bulamayan mestlerini giysin\". باب: لبس السلاح للمحرم. 17- İhramlının Silah Kuşanması",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1844,
			"arabicnumber": 1844,
			"text": "Bera r.a. şunları anlatmıştır: Nebi Sallallahu Aleyhi ve Sellem Zilkade ayında umre yaptı. Kureyşliler onun Mekke'ye girmesine izin vermediler. Nebi (Sallallahu aleyhi ve Sellem) Kureyşliler ile ertesi yıl Mekke'ye silahlar kınında olarak girmek şartıyla antlaşma yaptı",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1845,
			"arabicnumber": 1845,
			"text": "İbn Abbas r.a. şöyle demiştir: Nebi Sallallahu Aleyhi ve Sellem Medine'liler için Zul-Huleyfe'yi, Necd'liler için Karn'ı, Yemenliler için Yelemlem'i mîkat (ihram sınırı) olarak belirlemiştir. Bunlar hem belirtilen memleketler hem de onlar dışında hac ve umre yapmak amacıyla bu sınırlara gelenler içindir. Bu sınırın içinde bulunanlar ise her nerede bulunurlarsa oradan ihrama girerler. Hatta Mekke'Iiler Mekke'den ihrama girer",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1846,
			"arabicnumber": 1846,
			"text": "",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1847,
			"arabicnumber": 1847,
			"text": "Safvan İbn Ya'la babasından şunu rivayet etmiştir: Resulullah Sallallahu Aleyhi ve Sellem İle birlikte idik. Üzerinde sarı rengin izi bulunan bir cübbesi olan bir adam geldi. Ömer bana: \"Hz.Nebi (Sallallahu aleyhi ve Sellem)'e vahiy indirilirken onu görmeyi ister misin?\" diye sordu. Ona vahiy indirildi, sonra vahyin ağırlığı gidince şöyle buyurdu: \"Haccında yaptığını umrende de yap",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1848,
			"arabicnumber": 1848,
			"text": "Bize Atâ ibn Ebî Rebâh tahdîs edip şöyle dedi: Bana Safvân ibnu Ya'lâ tahdîs etti. Bâbası Ya'lâ ibn Umeyye şöyle demiştir: Ben Rasûlüllah'ın beraberinde idim. O'na; üzerinde bir cübbe, sarılık izi yahut benzeri bir boya izi bulunan bir kimse geldi. Omer ibnu'l-Hattâb bana: Üzerine vahy indiği zamanRasûlüllah'ı görmeyi arzu eder misin? der dururdu. Bu, sırada Rasûlüllah'a vahy indi. Sonra Rasûlüllah'tan vahy hâli sıyrıldı. Rasûlüllah(sallallahü aleyhi ve sellem), o gelen kimseye: \"Haccında yapa geldiğin işleri umrende de yap!\" buyurdu. bu arada bir adam diğer bir adamın elini ısırdı, yani eli ısırılan kişi, elini çekmekle, ısıranın dişlerinden birini kökünden söktü. Peygamber o sökülen dişi heder kıldı, yani onu diyetsiz bıraktı",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1849,
			"arabicnumber": 1849,
			"text": "Biri bir başkasının elini ısırdı. Adam elini çekti, ısıran adamın dişi kırıldı. Nebi Sallallahu Aleyhi ve Sellem diyete hükmetmedi. Tekrar: 2265, 2973, 4417, 6893",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1850,
			"arabicnumber": 1850,
			"text": "İbn Abbas r.a. şöyle demiştir: Nebi Sallallahu Aleyhi ve Sellem ile Arafatta vakfe yapan bir adam devesinden düştü, devesi onun boynunu kırarak adamı öldürdü. Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Onu su ve sidir ile yıkayın. Onu iki elbise ile (veya elbiseleri ile) defnedin. Ona hanut sürmeyin, başını da kapatmayın. Çün­kü Allah kıyamet günü onu telbiye getirirken diriltecek",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1851,
			"arabicnumber": 1851,
			"text": "İbn Abbas r.a. şöyle demiştir: Arafatta Resulullah Sallallahu Aleyhi ve Sellem ile birlikte vakfe yapan bir adam devesinden düştü, devesi onun boynunu kırarak öldürdü. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Onu su ve sidr ile yıkayın. İki elbise ile kefenleyin. Güzel koku sürmeyin, başını örtmeyin, hanut sürmeyin. Çünkü Allah onu kıyamet günü telbiye getirir şekilde diriltecektir.\" باب: سنة المحرم إذا مات. 21- Ölen İhramlı Kişiye Yapılacak Muamele",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1852,
			"arabicnumber": 1852,
			"text": "ibn Abbas r.a. şöyle dedi: Bir adam Nebi Sallallahu Aleyhi ve Sellem ile birlikteydi. Devesi onun boynunu kırdı, adam öldü. Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Onu su ve sidr ile yıkayın. İki elbise ile kefenleyin, güzel koku sürmeyin, başını örtmeyin. Çünkü kıyamet günü telbiye getirir şekilde diriltilecektir",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1853,
			"arabicnumber": 1853,
			"text": "",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1854,
			"arabicnumber": 1854,
			"text": "İbn Abbas r.a. şöyle dedi: Cüheyne kabilesinden bir kadın Nebi Sallallahu Aleyhi ve Sellem'e gelerek şöyle dedi: \"Annem haccetmeyi adadı, ancak hac yapamadan öldü. Ben onun yerine hac yapayım mı?\" Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Evet onun yerine hac yap. Annenin borcu olsaydı onu öder miydin? Allah'a olan borcunuzu da ödeyin. Allah borcu ödenmeye en layık olandır\". Tekrar: 6699, 7315",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1855,
			"arabicnumber": 1855,
			"text": "İbn Abbas, Fadl İbn Abbas'tan rivayet etmiştir: Has'am kabilesinden bir kadın veda haccı yılında Nebi Sallallahu Aleyhi ve Sellem'e gelerek: \"Ey Allah'ın Resulü! Allah'ın kullarına farz kıldığı hac ibadeti babamın yaşlılığına denk geldi. Babam binek üzerinde düzgün duramıyor. Ben onun yerine hac yapsam olur mu?\" diye sordu. Resulullah Sallallahu Aleyhi ve Sellem \"Evet\" diye cevap verdi",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1856,
			"arabicnumber": 1856,
			"text": "Abdullah İbn Abbas r.a. şöyle demiştir: Fadl, Hz.Nebi'in terkisinde bulunuyordu. Has'am kabilesinden bir kadın geldi. Fadl kadına bakıyor, kadın da ona bakıyordu. Nebi Sallallahu Aleyhi ve Sellem Fadl'ın yüzünü diğer tarafa çevirdi. Kadın: \"Allah'ın (hac) farzı babamı yaşlı iken, bineği üzerinde duramayacak bir halde iken yakaladı. Ben onun yerine hac yapabilir miyim?\" diye sordu. Nebi Sallallahu Aleyhi ve Sellem: \"Evet\" diye cevap verdi. Bu veda haccindaydı",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1857,
			"arabicnumber": 1857,
			"text": "İbn Abbas r.a. şöyle demiştir: Nebi Sallallahu Aleyhi ve Sellem yolculara ait yüklerle birlikte beni Müzdelife'den (Mekke'ye) geceleyin yolladı. [-1857-] Abdullah İbn Abbas r.a. şöyle dedi: Ergenlik çağına yaklaştığım bir sırada bir merkebe binmiş gidiyordum. O esnada Resulullah Sallallahu Aleyhi ve Sellem Mina'da namaz kıldırıyordu. İlk saftakilerin bir bölümünün önünden geçtim, sonra merkepten indim, merkep otlamaya başladı. Ben de Resulullah Sallallahu Aleyhi ve Sellem'in arkasında cemaatin safına girerek namaza başladım",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1858,
			"arabicnumber": 1858,
			"text": "Saib İbn Yezîd şöyle demiştir: Ben yedi yaşında iken bana Resulullah Sallallahu Aleyhi ve Sellem ile birlikte hac yaptırıldı",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1859,
			"arabicnumber": 1859,
			"text": "Ömer b. Abdülaziz, Saîd İbn Yezîd hakkında şöyle derdi: Ona, Resulullah'ın yükleri ile birlikte hac yaptırıldı. Tekrar: 6712, 7330",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1860,
			"arabicnumber": 1860,
			"text": "İbrahim babası aracılığıyla dedesinden şunu rivayet etmiştir: Ömer r.a. yaptığı son hacda Nebi Sallallahu Aleyhi ve Sellem'in hanımlarına hac yapmaları için izin verdi. Onlarla birlikte Osman İbn Affan ve Abdurrahman İbn Avf r.a.'ı gönderdi",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1861,
			"arabicnumber": 1861,
			"text": "Mu'minlerin annesi Aişe r.anha şöyle dedi: Resulullah Sallallahu Aleyhi ve Sellem'e dedim ki: Ey Allah'ın Resulü! Biz de sizinle savaşa ve cihad'a katılalım mı? Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Sizin için cihadın en iyisi ve güzeli hacdır, hacc-ı mebrurdur\". Aişe r.anha şöyle dedi: Bunu Resulullah Sallallahu Aleyhi ve Sellem'den işittikten sonra cihadı asla terk etmem",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1862,
			"arabicnumber": 1862,
			"text": "İbn Abbas (r.a.) şöyle dedİ: Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Kadın ancak yanında mahremi ile yolculuk yapabilir, (Yabancı) bir erkek kadın'ın yanına ancak yanında mahremi varken girebilir.\" Bir adam: \"Ey Allah'ın Resulü! Ben falanca orduya katılarak savaşa çıkmak istiyorum. Eşim ise hac yapmak istiyor\" dedi. Nebi Sallallahu Aleyhi ve Sellem adama: \"Sen de onunla birlikte git\" buyurdu. Tekrar: 3006, 3061, 5233",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1863,
			"arabicnumber": 1863,
			"text": "İbn Abbas r.a. şöyle dedi: Nebi Sallallahu Aleyhi ve Sellem hacdan dönünce ensardan Ümmü Sinan adlı kadına \"sen neden hac yapmadın, ne gibi bir engelle karşılaştın?\" diye sordu. Kadın: \"(Kocasını kastederek) Ebu fülan engel oldu. Onun iki devesi vardı. Birine binip hacca gitti. Diğerini ise bir arazimizi sulamada kullanıyoruz\". Nebi Sallallahu Aleyhi ve Sellem kadına: \"(Öyleyse Ramazan'da umreye git) Çünkü Ramazanda bir umre benimle birlikte hac yapmak yerine geçer",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1864,
			"arabicnumber": 1864,
			"text": "Nebi Sallallahu Aleyhi ve Sellem ile birlikte on iki savaşa katılan Ebu Saîd şöyle dedi: Nebi Sallallahu Aleyhi ve Sellem'den işittiğim şu dört şey çok hoşuma gider: 1- Bir kadın, yanında kocası veya mahremi bulunmaksızın iki günlük yolculuğa çıkamaz. 2- İki günde; Ramazan bayramı ve kurban bayramında oruç tutulmaz. 3- İki namazdan sonra namaz yoktur: İkindiden sonra güneş batıncaya kadar, sabahtan sonra güneş doğuncaya kadar. 4- Yalnızca üç mescide gitmek için yolculuk yapılabilir: Mescid-i haram, benim mescidim (Mescid-i nebevi) ve Mescid-i aksa",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1865,
			"arabicnumber": 1865,
			"text": "Enes r.a. şöyle dedi: Nebi Sallallahu Aleyhi ve Sellem, İki oğlu arasında onlara dayanarak yürüyen bir adam gördü ve \"bunun neyi var?\" diye sordu. \"(Kabe'ye) yürümeyi adadı\" dediler. Nebi Sallallahu Aleyhi ve Sellem \"Allah, bunun kendisine işkence etmesine muhtaç değildir.' buyurdu ve adama bineğine binmesini emretti. Tekrar: 6701",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1866,
			"arabicnumber": 1866,
			"text": "Ukbe İbn Amir (r.a.) şöyle dedi: Kız kardeşim Beytullah'a yürüyerek gitmeyi adadı ve bunu Nebi Sallallahu Aleyhi ve Sellem'e sormamı istedi. Ben de bunu sordum. Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Yürüsün ve bineğine de binsin",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 46
			}
		}
	]
}