{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"31": "Praying at Night in Ramadaan (Taraweeh)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2008,
			"arabicnumber": 2008,
			"text": "",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2009,
			"arabicnumber": 2009,
			"text": "Ebû Hureyre(radıyallahü anh) şöyle demiştir: Ben Rasûlüllah (sallallahü aleyhi ve sellem)'tan işittim, ramazân için şöyle buyuruyordu: \" (Hakk olduğuna kalbden) İnanarak ve (ahiret sevâbını) umarak ramazân ibadetini yerine getiren kimsenin geçmiş günâhları mağfiret olunur\". Bize Abdullah ibnu Yûsuf tahdîs edip şöyle dedi: Bize Mâlik, ibn Şihâb'dan; o da Humeyd ibnu Abdirrahman'dan; o da Ebû Hureyre (radıyallahü anh)'den haber verdi ki, Rasûlüllah(sallallahü aleyhi ve sellem):“ İnanarak ve sevabını Allah’tan umarak ramazanda ibadetle kaim olan kimsenin geçmiş günahları mağfiret olunur” buyurmuştur. Şihâb şöyle dedi: Ramazân gecelerindeki namaz işi bu hâl üzere iken (yani kılan yalnız başına kılarken) Rasûlüllah vefat etti. Sonra bu iş, Ebû Bekr'in halifeliği zamanında ve Omer'in halifeliğinin başında da Peygamber devrinde olduğu gibi isteyenin cemâatsız olarak yalnız başına kılması suretiyle kılınır oldu",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2010,
			"arabicnumber": 2010,
			"text": "Ve yine Mâlik, İbn Şihâb'dan; o da Urve ibnu'z-Zubeyr'den; O da Abdurrahmân ibn Abdin el-Kaarî(80)'den rivayet etti. Bu Abdurrahman şöyle demiştir: Bir ramazân gecesi Omer ibnu'l-Hattâb (radıyallahü anh)'ın beraberinde mescide çıktım. Bir de baktık ki, insanlar yalnız ve dağınık topluluklar hâlinde terâvîh namazı kılmaktalar. Kimisi kendi başına yalnızca namaz kılıyor, kimisi de namaz kılıyor ve bunun namazına bir kısım insanlar uyup namaz kılıyordu. Ben zannediyorum ki, bu dağınık olarak namaz kılan insanları bir tek okuyucu imâmın arkasında toplarsam daha faziletli olacak, dedi. Sonra buna kat'î olarak karar verdi. Ve akabinde(ertesi günü, hicretin14. senesi içinde) o insanları Ubeyy ibn Ka'b'ın (terâvîh imamlığı) arkasında topladı (Böylece terâvîh namazı cemâatle kılınmağa başlandı). Sonra diğer bir gece yine Omer'in beraberinde mescide çıktım. İnsanlar okuyucu imamlarının namazına uyup namaz kılıyorlardı. Omer bu manzarayı görünce: \"Ni'me'l-bid'atu hâzihi(Şu terâvâhin böyle cemâatle kılınması ne güzel âdet oldu)\" diye sevincini belirtti ve: \"Fakat bu namazlarını gecenin sonuna bırakıp da bu namazdan sonra uyuyanlar, şimdi namaz kılanlardan daha faziletlidirler\" sözünü de ilâve etti. Omer, terâvîhi gecenin sonunda kılmayı kasdediyor. İnsanlar ise terâvîhi gecenin evvelinde kılmakta idiler. zevcesi Âişe(r. anha): Rasûlüllah (sallallahü aleyhi ve sellem) geceleyin mesciddeki hücresinde iki yahut üç gün namaz kıldı; insanlar da O'nun namazına uyup cemâatle namaz kıldılar... İşte Rasûlüllah'ın bu şekilde cemâatle namaz kıldırması hâdisesi, ramazân içinde vâki' oldu, demiştir",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2011,
			"arabicnumber": 2011,
			"text": "",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2012,
			"arabicnumber": 2012,
			"text": "Âişe(r.anha) yeğeni Urve'ye şöyle haber vermiştir:Rasûlüllah (sallallahü aleyhi ve sellem) bir gece, gecenin ortasında çıktı da mescidde namaz kıldı. Bir takım insanlar da O'nun namazına uyup beraberinde namaz kıldılar. Sabah olunca insanlar geceleyin Peygamber'in mescidde namaz kıldırdığını konuştular. Bu haber yayılınca ertesi gece, birinci gecekilerden daha çok insan toplandı ve Peygamber'in beraberinde namaz kıldılar. Sabah olunca insanlar bunu yine aralarında konuşup yaydılar. Üçüncü gecede mescid halkı iyice çok oldu. Rasûlüllah yine çıkıp namaz kıldı; insanlar da O'nun namazına uyup namaz kıldılar. Dördüncü gece olunca mescid, toplanan insanları almaktan âciz oldu. o gece namaza çıkmadı.) Nihayet sabah namazım kıldırmak için çıktı. Sabah namazını kıldırınca yüzünü cemâate karşı yöneltti ve hutbe başlangıcı olarak şehâdet kelimelerini söyledi, sonra \"Amma ba'du\" hitâb faslı ile başladığı hutbesinde bu gece namazına çıkmamasının gerekçesini şöyle açıkladı: \"Şu muhakkak ki, sizin mescidde toplanmanız bana gizli olmamıştır. Şu kadar ki gece namazı üzerinize farz kılınır da sonra onun edasından âciz kalırsınız diye korktum\" buyurdu. Nihayet Rasûlüllah vefat etti. Ramazân namazı işi, evlerde kılınmak üzere devam edip durdu, dedi",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2013,
			"arabicnumber": 2013,
			"text": "Bize İsmâîl ibn Ebî Uveys tahdîs edip şöyle dedi: Bana İmâm Mâlik, Saîd el-Makbûrî'den; o da Ebû Seleme ibn Abdirrahmân'dan tahdîs etti ki, bu Ebû Seleme, Âişe (r.anha)'ye: Rasûlüllah'ın ramazândaki gece namazı(kemmiyet ve keyfiyetçe) nasıl idi? diye sordu. de şöyle dedi: Rasûlüllah ne ramazânda, ne de ramazânın gayrı gecelerde on bir rek'at üzerine ziyâde eder değildi. Rasûlüllah evvelâ dört rek'at kılardı. Artık o rek'atların güzelliğinden ve uzunluğundan sorma! Sonra dört rek'at daha kılardı. Bunların da güzelliğinden ve uzunluğundan sorma! Sonra üç rek'at kılardı. Ben: Yâ Rasûlallah! Vitr namazını kılmadan önce uyur musun? Diye sordum. Rasûlüllah: \"Yâ Âişe! Benim iki gözüm uyur, fakat kalbim uyumaz\" buyurdu",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 6
			}
		}
	]
}