{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"32": "Virtues of the Night of Qadr"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2014,
			"arabicnumber": 2014,
			"text": "Bize Alî ibnu Abdillah el-Medînî tahdîs edip şöyle dedi: Bize Sufyân ibn Uyeyne tahdîs edip: Bu hadîsi biz ezberledik, dedi. Alî ibnu Abdillah: Sufyân bu hadîsi ancak Zuhrî'den ezberlemiştir, dedi. O da Ebû Seleme'den; O da Ebû Hureyre(radıyallahü anh)'den; Peygamber (sallallahü aleyhi ve sellem) şöyle buyurmuştur: \"Her kim ramazân orucunu îmânı sebebiyle ve ecrini yalnız Allah'tan umarak tutarsa geçmiş günâhları mağfiret olunur. Ve yine her kim îmânından dolayı ve ecrini yalnız Allah'tan umarak Kadir gecesini ibâdetle geçirirse geçmiş günâhları mağfiret edilir\". hadîsi ez-Zuhrî'den rivayet etmekte Süleyman ibnu Kesîr el-Abdî, Sufyân ibnu Uyeyne'ye mutâbaat etmiştir",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2015,
			"arabicnumber": 2015,
			"text": "İbn Omer(radıyallahü anh) şöyle demiştir: Peygamberin sahâbîlerinden bâzı kimselere Kadir gecesi ru'yâda ramazânın son yedi gecesi içinde gösterildi. Rasûlüllah (sallallahü aleyhi ve sellem) da sahâbîlerine: \"Ben sizin ru'yâlarınızın ramazânın son yedi gecesi içinde birbirine uygun düşmüş olduğunu görüyorum. Artık kim Kadir gecesini aramaya çalışacaksa, onu ramazânın son yedi gecesi içinde arasın\" buyurdu",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2016,
			"arabicnumber": 2016,
			"text": "Ebû Seleme şöyle dedi: Ben Ebû Saîd'e sordum. O benim çok sâdık bir dostum idi. Ebû Saîd şöyle dedi: Biz Peygamber'in beraberinde ramazânın ortasındaki on gün içinde i'tikâfa girmiştik. Rasûlüllah yirminci günün sabahı (i'tikâf yerinden) çıktı da bize bir hutbe yaptı ve bunda şöyle buyurdu: Kadir gecesi (ne âid alâmetler) gösterildi. Sonra o bana unutturuldu -yahut: Ben onû unuttum.- Sizler Kadir gecesini ramazânın son on günündeki tek sayılı gecelerde arayınız. Çünkü ben(ru'yâmda) kendimi su ve balçık çamuru içinde secde ediyor gördüm. Her kim Allah Elçisi'nin beraberinde i'tikâf ediyorsa, şimdi i'tikâf yerine dönsün!\" hutbe üzerine biz i'tikâf yerimize döndük. Ve bizler gökte bir bulut parçası görmüyorduk. Derken bir bulut geldi ve (yirmi birinci gece şiddetli bir) yağmur yağdı. Hattâ mescidin tavanı (Peygamber'in secde yerine) aktı. Mescidin tavanı hurma çubuklarından idi. Sabah namazı kılındı. Ben Rasûlüllah'ı su ve çamur içinde secde ediyor gördüm. Hattâ namazdan çıktığında Rasûlüllah'ın alnında çamur izini gördüm",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2017,
			"arabicnumber": 2017,
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2018,
			"arabicnumber": 2018,
			"text": "Ebû Saîd el-Hudrî (radıyallahü anh) şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem) ramazânda, ayın ortasındaki on günde i'tikâf eder idi. Geçen yirminci gecenin akşamı olup da yirmi birinci günü karşılayacağı zaman evine dönerdi. Beraberinde i'tikâf etmiş olanlar da evlerine dönerlerdi. Rasûlüllah i'tikâf ettiği bir ramazân ayında, kendisinde evine dönmek âdetinde olduğu gece i'tikâf yerinde ikaamet etti ve insanlara bir hutbe yaptı da, bu hutbede, insanlara Allah'ın dilediği şeyleri emretti. Sonra şöyle buyurdu: şu ayın ortasındaki on günde i'tikâf ederdim. Sonra bana şu gelecek son on gün içinde i'tikâf etmekliğim fikri zahir oldu. Şimdi kim benim beraberimde i'tikâf ediyorsa i'tikâf ettiği yerde sabit olsun. Bu Kadir gecesi bana gösterilmişken sonra o bana unutturulmuştur. Artık siz onu son on içinde arayınız. Ve yine siz onu bu on içindeki her tek gecede arayınız. Ben (ru'yâda) kendimi bir su ve bir çamur içinde secde eder gördüm\". bu gece içinde gök boşandı, şiddetli yağmur yağdı. Mescidde Peygamber'in secde yerine su aktı. İşte bu yirmi birinci gecede gözüm gördü. Ben Peygamber sabah namazından döndüğünde kendisine baktım. Peygamber'in yüzü çamur ve su ile dolmuş hâldeydi",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2019,
			"arabicnumber": 2019,
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2020,
			"arabicnumber": 2020,
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2021,
			"arabicnumber": 2021,
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2022,
			"arabicnumber": 2022,
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2023,
			"arabicnumber": 2023,
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2024,
			"arabicnumber": 2024,
			"text": "Bize Muhammed ibnu'l-Musennâ tahdîs edip şöyle dedi. Bize Hâlid ibnu’l-Hâris tahdîs edip şöyle dedi: Bize Humeyd (et-Tavîl) tahdîs edip şöyle dedi: Bize Enes ibn Mâlik (radıyallahü anh) tahdîs etti ki, Ubâde ibnu's-Sâmit(radıyallahü anh) şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem) Kadir gecesini bizlere haber vermek üzere(hücresinden) çıktı. Derken müslümânlardan iki kişi kavga ettiler. Bunun akabinde Peygamber: \"Ben sizlere Kadir gecesini haber vermek üzere çıkmıştım. Fulan ile fulan kimseler birbirleriyle kavga ettiler de (Kadir gecesinin tayinine âid olan bilgi kalbimden)kaldırıldı. Belki de sizler için bu daha hayırlıdır. Artık sizler Kadir gecesini (yirmiden sonraki) dokuzuncu veya yedinci veya beşinci gecelerde arayınız\" buyurdu",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 11
			}
		}
	]
}