{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"33": "Retiring to a Mosque for Remembrance of Allah (I'tikaf)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2025,
			"arabicnumber": 2025,
			"text": "Abdullah İbn Ömer r.a. şöyle dedi: Resulullah Sallallahu Aleyhi ve Sellem Ramazan ayının son on gününde itikaf yapardı",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2026,
			"arabicnumber": 2026,
			"text": "Nebi Sallallahu Aleyhi ve Sellem'in eşi Aişe (r.anha) şöyle dedi; Resulullah Sallallahu Aleyhi ve Sellem vefat edinceye kadar Ramazanın son on gülünde itikaf yapardı. Onun vefatından sonra hanımları bu itikafa devam etmişlerdi",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2027,
			"arabicnumber": 2027,
			"text": "Ebu Said el-Hudrî r.a. şöyle dedi: Resulullah Sallallahu Aleyhi ve Sellem Ramazan ayının ortasındaki on günde itikaf yapardı. Bir yıl itikaf yaptı. Yirmi birinci gece olunca -ki her zaman bu gecenin sabahında itikafından çıkardı- şöyle buyurdu: \"Benimle birlikte itikaf yapanlar, son on günde itikaf yapmaya devam etsinler. Bana bu gece (kadir gecesi) gösterildi ancak unutturuldu. Ben (rüyamda) kadir gecesinin sabahında su ve çamur içinde secde ettiğimi gördüm. Öyleyse kadir gecesini son on günde arayın. Onu her tekli gecede arayın.\" O gece öyle şiddetli yağmur yağdı ki mescidin tavanı hurma dallarından olduğundan tavanından sular aktı. Yirmi birinci gecenin sabahında gözlerimle Resulullah'ın alnında su ve çamurun izini gördüm",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2028,
			"arabicnumber": 2028,
			"text": "Aîşe r.anha şöyle demiştir: Nebi Sallallahu Aleyhi ve Sellem mescid'de itikafta iken başını bana doğru uzatır, ben de adetli olduğum halde saçını başını tarardım. Bu hadisle ilgili açıklamalar Hayız bölümünde geçmişti.[295, 296. hadisler.] Hadisten Çıkan Bazı Sonuçlar Hadiste geçen taramaya kıyasla itikaflı kişinin temizlenmesi, güzel koku sü­rünmesi, yıkanması, traş olması, süslenmesi de caizdir. Alimlerin çoğunluğuna göre, mescitte yapılması mekruh görülen İşler dışında İtikaflı olan kişinin bunları yapması mekruh değildir. İmam Malik'ten rivayet edildiğine göre itikaf sırasında kişinin iş ve mesleğine dair bir şeyle uğraşması hatta ilim talebi ile uğraşması bile mekruhtur. Bu hadiste, kadının kendi isteği ile olmak şartıyla kocanın ona hizmet ettir­mesi vardır. Hz. Nebi'in mescitten yalnızca başını çıkarması, itikaf için mescidin şart olduğunu göstermektedir. باب: لا يدخل البيت إلا لحاجة. 3- İtikafta Olan Kişi Ancak Bir İhtiyacı İçin Evine Girebilir",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2029,
			"arabicnumber": 2029,
			"text": "Nebi Sallallahu Aleyhi ve Sellem’in eşi Aişe radiyallahu anha şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem itikafta iken mescid'de olduğu halde başını eve doğru uzatır, ben de onun saçlarını tarardım. İtikaflı olduğunda bir ihtiyaç olmadıkça eve girmezdi. Tekrar: 2033, 2034, 2041, 2045",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2031,
			"arabicnumber": 2031,
			"text": "",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2032,
			"arabicnumber": 2032,
			"text": "İbn Ömer r.a. şöyls demiştir: Ömer r.a. Nebi Sallallahu Aleyhi ve Sellem'e: \"Ben cahiliye döneminde Mescid-i Haram'da bir gece itikaf yapmayı adamıştım\" dedi. Nebi Sallallahu Aleyhi ve Sellem: \"Adağını yerine getir\" buyurdu. Tekrar: 2043, 3144, 4320, 6697",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2033,
			"arabicnumber": 2033,
			"text": "Aişe r.anha şöyle demiştir: Nebi Sallallahu Aleyhi ve Sellem Ramazanın son on gününde itikaf yapardı. Ben onun için çadır kurmuştum. O, sabah namazını kılınca çadıra girerdi. Bir gün Hafsa, Aişe'den kendisine çadır kurmak için Hz. Nebi'den izin istemesini söyledi. Aişe de izin istedi. Hafsa çadırı kurdu. Zeyneb binti Cahş bunu görünce o da başka bir çadır kurdu. Hz. Nebi sabahleyin çadırları görünce \"Bunlar ne?\" diye sordu. Kendisine durum bildirildi. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem: \"Bu çadırların kurulması ile hayır beklediğinizi mi zannediyorsunuz?\" dedi. O ay itikaf yapmaktan vaz geçti. Daha sonra Şevval'de on gün itikaf yaptı",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2034,
			"arabicnumber": 2034,
			"text": "Aişe r.anha şöyle demİŞtİr: Nebi Sallallahu Aleyhi ve Sellem itikaf yapmak istedi. İtikaf yapmak istediği yere gittiğinde bir de baktı ki burada Aişe'nin, Hafsa'nın ve Zeyneb'in çadırları var. Bunun üzerine Hz. Nebi îu çadırların hayır mı olduğunu zannediyorsunuz\" buyurdu. Sonra itikaf yapmaksızın çıktı gitti. Ancak daha sonra Şevvalde on gün itikaf yaptı",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2035,
			"arabicnumber": 2035,
			"text": "Ali bin Huseyin r.a., Nebi Sallallahu Aleyhi ve Sellem'in hanımı Safiyye'nin şunu anlattığını söyledi: Resulullah Sallallahu Aleyhi ve Sellem Ramazanın son on günü mescid'de itikafta iken onu ziyarete gittim. Onunla bir süre konuştum. Daha sonra dönmek için kalktım. Nebi Sallallahu Aleyhi ve Sellem de beni uğurlamak için kalktı. Safiye, Ümmü Seleme'nin kapısı önündeki mescidin kapısına geldiğinde ensardan iki adam Nebi Sallallahu Aleyhi ve Sellem'in yanından geçerek ona selam verdiler. Nebi Sallallahu Aleyhi ve Sellem onlara \"Bir dakika bakar mısınız. Bu yanımdan ayrılan hanım Safiyye bint-i Huyey'dir' dedi. O iki kişi: \"Sübhanallah! Ey Allah'ın Resulü (biz senin hakkında nasıl kötü düşünürüz)?\" dediler. Bu, onlara çok zor geldi. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Şeytan, Ademoğlunun vücudunda kan'ın dolaştığı gibi dolaşır. Ben sizin kalbinize bir şey (vesvese) atmasından korktum\". Tekrar: 2038, 2039, 3101, 3281, 6219, 7171",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2036,
			"arabicnumber": 2036,
			"text": "Ebu Seleme İbn Abdurrahman şöyle demiştir: Ebu Said el-Hudrî'ye şöyle sordum: Nebi Sallallahu Aleyhi ve Sellem'in kadir gecesinden bahsettiğini duydun mu? Ebu Said şöyle dedi: Evet. Resulullah Sallallahu Aleyhi ve Sellem ile birlikte Ramazanın ortasındaki on günde itikaf'a girdik. Yirminci günün sabahı itikaf'tan çıktık. Resulullah Sallallahu Aleyhi ve Sellem yirminci günün sabahı bize bir hutbe okuyarak şöyle dedi: \"Bana kadir gecesi gösterildi, sonra unutturuldu. Kadir gecesini son on gün'ün tekli gecelerinde arayınız. Ben (kadir gecesinde) su ve çamur üzerinde secde yaptığımı gördüm. Resülullah ile birlikte itikafa girmiş olanlar geri dönsünler\". Bunun üzerine insanlar mescid'e geri döndü. Gökyüzünde hiçbir bulut görnüyorduk. Derken bir anda hava bulutlandı, yağmur yağdı. Bu arada namaz için kamet getirildi. Resulullah Sallallahu Aleyhi ve Sellem çamur ve su içinde secde yaptı. öyle ki ben onun burnunun yan tarafında ve alnında çamur bulunduğunu gördüm",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2037,
			"arabicnumber": 2037,
			"text": "Aişe r.anha şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem İle birlikte hanımlarından müstehaza olan birisi itikafa girdi. O, gelen kan'ın rengini kızıllık ve sarılık görüyordu. Hatta o namaz kılarken onun alt tarafına bir leğen koyuyorduk. باب: زيارة المرأة زوجها في اعتكافه. 11- Kadının İtikafta Olan Kocasını Ziyaret Etmesi",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2038,
			"arabicnumber": 2038,
			"text": "Ali İbn Hüseyin şöyle demiştir: Nebi (Sallallahu aleyhi ve Sellem) mescid'de (itikafta) idi. Yanında hanımları vardı. Onlar yanından kalkıp gittiklerinde, Nebi Sallallahu Aleyhi ve Sellem, Safiyye binti Huyey'e \"Acele etme. Ben de seninle birlikte geleyim\" buyurdu. Safiyye'nin evi (kaldığı oda) Usame'nin evindeydi . Nebi Sallallahu Aleyhi ve Sellem onunla birlikte çıktı. Ensardan iki kişi Nebi Sallallahu Aleyhi ve Sellem'e bakıp, yanlarından geçtiler. Nebi Sallallahu Aleyhi ve Sellem onlara: \"Buraya gelin. Bu Safiyye binti Huyey'dir\" buyurdu. O ikisi: \"Sübhanallah ey Allah'ın Resulü\" dediler. Nebi Sallallahu Aleyhi ve Sellem: \"Şeytan insanda kanın dolaştığı gibi dolaşır. Ben sizin nefislerinize bir şey (vesvese) atmasından korktum\" buyurdu. باب: هل يدرأ المعتكف عن نفسه. 12- İtikafta Olan Kimse Kendisini Savunur Mu?",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2039,
			"arabicnumber": 2039,
			"text": "Ali İbn Hüseyin şunu anlatmıştır: Safiyye r.anha., itikafta olan Nebi Sallallahu Aleyhi ve Sellem’in yanına geldi. Geri döneceği zaman Hz. Nebi de onunla birlikte yürüdü. Ensardan bir adam onu gördü. Nebi Sallallahu Aleyhi ve Sellem bu adamı görünce ona: \"Buraya gel. Bu Safiyye'dir. Şeytan adem-oğlunda kanın dolaştığı gibi dolaşır\" dedi. (Ravi diyor ki); Süfyan'a sordum: Safiyye, Hz. Nebi'in yanına gece mi gelmişti? Süfyan: Başka ne zaman gelsin? Dedi",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2040,
			"arabicnumber": 2040,
			"text": "Ebu Said r.a. şöyle dedi: Resulullah Sallallahu Aleyhi ve Sellem ile birlikte Ramazanın ortasındaki on günde itikaf yaptık. Yirminci günün sabahında eşyalarımızı (mescitten) taşıdık. Resulullah Sallallahu Aleyhi ve Sellem yanımıza gelerek \"İtikafta olan, itikaf yaptığı yere geri dönsün. Bana şu gece (yani kadir gecesi) gösterildi. Ben, su ve çamur içinde secde ettiğimi gördüm\" buyurdu. Nebi (Sallallahu aleyhi ve Sellem) itikaf yaptığı yere geri döndü, Gökyüzü bir anda bulutlandı ve yağmur yağdı. Onu hak ile gönderen Allah'a yemin ederim ki gökyüzü o günün sonunda bulutlandı. Mescid'in tavanı hurma dallarından idi. Ben Nebi (Sallallahu aleyhi ve Sellem)'in burnunda ve burnunun yan taraflarında su ve çamurun izini gördüm",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2041,
			"arabicnumber": 2041,
			"text": "Aişe r.anha şöyle dedi:Resulullah Sallallahu Aleyhi ve Sellem her ramazan itikaf yapardı. Sabah namazını kılınca itikaf yapacağı yere girerdi. Aişe, itikaf yapmak için ondan izin istedi. O da izin verdi. Aişe için mescid'de bir çadır kuruldu. Hafsa bunu işitince o da bir çadır kurdu. Zeynep bunu İşitince o da bir çadır kurdu. Resulullah Sallallahu Aleyhi ve Sellem sabah namazından çıkınca dört çadır gördü ve: \"Bunlar nedir?\" diye sordu. Kendisine, hanımlarının çadır kurduğu bildirildi. Nebi Sallallahu Aleyhi ve Sellem: \"Onları böyle yapmaya yönlendiren nedir? İyilik mi? Bu çadırları sökün, görmeyeyim\" buyurdu. Bunun üzerine çadırlar söküldü. O sene Ramazan ayında İtikaf yapmadı. Şevval ayının son on gününde itikaf yaptı. باب: من لم ير عليه صوما إذا اعتكف. 15- İTİKAF YAPTIĞINDA ORUÇ TUTMAYI GEREKLİ GÖRMEYENLER",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2042,
			"arabicnumber": 2042,
			"text": "Ömer İbnül-Hattab r.a. şöyle dedi: Ey Allah'ın Resulü! Ben cahiliye döneminde Mescid-i Haramda bir gece itikaf yapmayı adamıştım. Nebi Sallallahu Aleyhi ve Sellem: \"Adağını yerine getir\" buyurdu. Bunun üzerine Ömer r.a. bir gece itikaf yaptı",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2043,
			"arabicnumber": 2043,
			"text": "İbn Ömer r.a. şöyle dedi: Ömer r.a. cahiliye döneminde Mescid-i Haramda bir gece itikaf yapmayı adadı. Resulullah Sallallahu Aleyhi ve Sellem ona: \"Adağını yerine getir\" buyurdu",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2044,
			"arabicnumber": 2044,
			"text": "Ebu Hureyre r.a. şöyle demiştir: Nebi Sallallahu Aleyhi ve Sellem her Ramazan ayında on gün itikaf yapardı. Vefat ettiği yılın Ramazan ayında ise yirmi gün itikaf yaptı. Tekrar: 4998",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2045,
			"arabicnumber": 2045,
			"text": "Aişe r.anha şöyle dedi: Resulullah Sallallahu Aleyhi ve Sellem Ramazan'ın son on gününde itikaf yapmaktan bahsetti. Bunun üzerine Aişe ondan itikaf yapmak için izin istedi, o da izin verdi. Hafsa, kendisi için izin istemesini Aişe'ye söyledi, Aişe de onun için İzin istedi. Zeyneb binti Cahş bunu görün­ce o da (itikaf için mescitte) bir çadır kurdurdu. Resulullah Sallallahu Aleyhi ve Sellem itikafta iken namaz kılınca çadırına çekilirdi. Diğer çadırları görünce \"bunlar da neyin nesi?\" diye sordu. Sahabeler: 'Aişe, Hafsa ve Zeyneb'in çadırları\" dediler. Hz. Nebi: \"Onlar bu çadırları kurmakla hayır yapmayı mı istediler? Ben itikaf yapmıyorum\" dedi ve döndü. Ramazan ayı bittikten sonra on gün Şevval'de itikaf yaptı. باب: المعتكف يدخل رأسه البيت للغسل. 19- İtikafta Olan Kişinin, Başını Yıkamak İçin Evine Uzatması",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2046,
			"arabicnumber": 2046,
			"text": "Aişe r.anha, mescid'de itikafta bulunan Resulullah Sallallahu Aleyhi ve Sellem'in saçını kendisi adetli olduğu halde taradığını söylemiştir. Aişe kendi odasında durur, Resulullah Sallallahu Aleyhi ve Sellem başını ona uzatırdı. İTİKAF BAHSİ BİTTİ. BUYU’ (ALIŞVERİŞ) BAHSİ BİR SONRAKİ SAYFA İLE BAŞLIYOR",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 21
			}
		}
	]
}