{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"34": "Sales and Trade"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2047,
			"arabicnumber": 2047,
			"text": "Bize Şuayb, ez-Zuhrî'den tahdîs etti. O şöyle demiştir: Saîd ibnu'l-Müseyyeb ve Ebû Seleme ibnu Abdirrahmân tahdîs ettiler ki, Ebû Hureyre (radıyallahü anh) şöyle demiştir: Sizler; Ebû Hureyre, Rasûlüllah'tan hadîs rivayetini çok yapıyor diyorsunuz ve yine sizler: Muhâcirler'in ve Ensâr'ın hâlleri nedir ki bunlar Rasûlüllah'tan Ebû Hureyre'nin hadîs rivayet edişi gibi hadîs rivayet etmiyorlar, diyorsunuz. Şu muhakkak ki muhacir kardeşlerimiz çarşılarda alış-veriş etmekle meşgul idiler. Ben ise karın tokluğuna karşılık Rasûlüllah'tan hiç ayrılmaz, dâima O'nunla beraber olurdum. Bunun için onların bulunmadıkları zaman ben hâzır bulunur, onlar unuttuklarında ben hafızamda tutar ezberlerdim. Ensâr'dan olan kardeşlerimi de mallarındaki çalışmaları meşgul ediyordu. Ben ise Suffa fakirlerinden olan fakır bir kişi idim. Diğer sahâbîler hadîsleri unuturlarken, ben ezberimde tutar bellerdim. Muhakkak Rasûlüllah (sallallahü aleyhi ve sellem) söylemekte bulunduğu bir hadîs hakkında: \"Ben şu makaalemi bitirinceye kadar elbisesini yayacak; sonra da elbisesini kendine doğru toplayacak her kişi elbette benim söyleyeceğim sözleri kesin olarak ezberleyecektir” buyurmuştu. Bunun için ben hemen üzerimdeki renkli bezi Rasûlüllah o makaalesini bitirinceye kadar yaydım, akabinde o bezi göğsüme doğru topladım. Artık sonra Rasûlüllah'ın bu konuşmalarından hiçbirşeyi unutmadım",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2048,
			"arabicnumber": 2048,
			"text": "Abdurrahmân ibnu Avf (radıyallahü anh) şöyle demiştir: geldiğimiz zaman Rasûlüllah (sallallahü aleyhi ve sellem) benimle Sa'd ibnu'r-Rabî' arasında kardeşlik kurmuştu. Bunun üzerine Sa'd ibnu'r-Rabî' (ben Abdurrahmân'a): Ben \"mal cihetiyle Ensâr'ın en zenginiyim. Bunun için malımın yarısını sana ayırıyorum. Ve bak! İki kadınımın hangisini seversen senin için ondan vazgeçer, onu boşarım. İddeti geçip de evlenme halâl olduğu zaman onunla evlenirsin”, dedi. dedi ki: Bu teklif üzerine Abdurrahmân, Sa'd'e: Benim bu hususta ihtiyâcım yoktur. İçinde ticâret yapılan bir çarşı var mı? dedi. Kaynukaa' kabilesinin çarşısı vardır, dedi. dedi ki: Abdurrahmân sonra Kaynukaa' çarşısına gitti. Satmak üzere keş ve yağ götürdü. Sonra çarşıya gidişleri arka arkaya devam etti. Çok geçmedi, Abdurrahmân Rasûlüllah'ı ziyarete geldi. Üstünde(zifafa girenlere mahsûs olan) sarı zağferân lekesi vardı. Rasûlüllah(sallallahü aleyhi ve sellem) ona: \"Evlendin mi?\" diye sordu. Abdurrahmân: Evet evlendim, dedi. Rasûlüllah: \"Kimle evlendin?\" dedi. da: Ensâr'dan bir kadınla evlendim, dedi. \"Ne kadar mehr verdin?\" dedi. Bir çekirdek (yani beş dirhem) ağırlığında altın yahut altından bir çekirdek verdim, dedi. üzerine Peygamber (sallallahü aleyhi ve sellem) Abdurrahmân'a: \"Bir koyun(kesmek suretiy)le olsun düğün yemeği yap!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2049,
			"arabicnumber": 2049,
			"text": "Enes ibn Mâlik (radıyallahü anh) şöyle dedi: Abdurrahmân ibn Avf Medine'ye geldi. Peygamber(sallallahü aleyhi ve sellem) Abdurrahmân ibn Avf ile Ensâr'lı Sa'd ibnu'r-Rabî arasında kardeşlik akdi kurdu. Sa'd zenginlik sahibi bir kimse olduğundan, Abdurrahmân'a hitaben: Malımı yarı yarıya seninle bölüşeyim, ve bir de seni evlendireyim, dedi. da Sa'd'e: Allah sana ehlini ve malım bereketli kılıp mübarek eylesin. (Benim bunlara ihtiyâcım yoktur.) Siz bana çarşıya delâlet ediniz, dedi. çarşıya gidip bir mikdâr keş ve yağ kazancıyla döndü ve bu kârı ev halkına getirdi. Az bir zaman yahut Allah'ın dilediği süre ikaamet ettik ki, Abdurrahmân, üzerinde (evlenenlere mahsûs olan) sarı koku bulaşığı olduğu hâlde geldi. Peygamber (sallallahü aleyhi ve sellem): \"Bu, hâlin nedir?\" dedi. Abdurrahmân: Yâ Rasûlallah, ben Ensâr'dan bir kadınla evlendim, dedi. Rasûlüllah: \"O kadına ne kadar mehr verdin?\" diye sordu. Abdurrahmân: Altından bir çekirdek yahut bir çekirdek ağırlığı (yani beş dirhem) altın, dedi. üzerine Peygamber: \"Bir koyunla olsun düğün yemeği yap\" buyurdu",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2050,
			"arabicnumber": 2050,
			"text": "İbn Abbâs radıyallahü anhüma şöyle demiştir: Ukâz, Mecenne ve Zu'l-Mecâz, Câhiliyet devrinde bir takım büyük çarşılar(yani panayırlar) idi. İslâm devri olunca müslümânlar bu panayırlarda ticâret etmeyi günâh sayıp çekindiler. Bunun üzerine: (Hacc mevsimlerinde ticâretle) Rabbinizden kazanç istemenizde üzerinize bir günâh yoktur\"(el-Bakara: 198) âyeti indi. Bu âyetin sonundaki \" Hacc mevsimlerinde\" ziyâdesini İbn Abbâs, Kur'ân'dan olmak üzere okumuştur",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2051,
			"arabicnumber": 2051,
			"text": "Nu'mân ibnu Beşîr (radıyallahü anh) şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem.A.V.) şöyle buyurdu: \"Halâl olan şeyler bellidir. Haram olanlar da bellidir. Fakat halâl ile haram arasında bir takım şübheli şeyler vardır. Her kim kendisince günâh olması sezilen bir şeyi terk ederse o, harâmlığı apaçık olan şeyi daha çok terkedici olmuştur. Her kim günâh olması şübheli olan şeye cür'et ederse, bu da harâmlığı apaçık olan şeylere dalmağa yaklaşmıştır. Ma'siyetler (haramlar) Allah'ın korumasındadır. Her kim sürüsünü korunmuş arazî etrafında otlatırsa, o koruluğa düşmesi yakın olur",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2052,
			"arabicnumber": 2052,
			"text": "Ukbetu'bnu'l-Hâris (radıyallahü anh)'ten(şöyle demiştir): Siyah bir kadın geldi de, Ukbe'yi ve Ukbe'nin evlendiği kadını emzirdiğini iddia etti. Akabinde Ukbe bu emzirilmeyi Peygamber'e zikretti. Peygamber Ukbe'den yüz çevirip tebessüm ederek: \" (Senin, evlendiğin kadınla süt kardeşi bulunduğun) söylenmiş olduğu hâlde (onunla temasın) nasıl olur?!\" buyurdu. Ukbe'nin nikâhı altında Ebû îhâb ibn Azîze't-Temîmî'nin kızı (Guneyye) vardı",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2053,
			"arabicnumber": 2053,
			"text": "Âişe (r.anha) şöyle demiştir; Utbe ibnu Ebî Vakkaas, kardeşi Sa'd ibnu Ebî Vakkaas'a vasiyet edip: Zem'a'nın cariyesinin oğlu(Abdurrahmân), benim sulbümdendir, Bu çocuğu al, demiştir. dedi ki: Mekke'nin fethi yılı olup Mekke'ye varıldığında, Sa'd ibnu Ebî Vakkaas bu çocuğu yakaladı ve: Bu, kardeşim Utbe'nin oğludur. Bunun nesebinin kendisine katılması hususunda bana vasiyet etmiştir, dedi. zerine Abd ibnu Zem'a ayaklanıp: Bu, benim kardeşimdir; Bâbamın cariyesinin oğludur, Bâbamın döşeği üstünde doğmuştur, dedi. iki taraf bu niza' ve husûmetleriniPeygamber'e sevk ettiler. Sa'd ibn Ebî Vakkaas: Yâ Rasûlallah! Bu çocuk, kardeşim Utbe'nin oğludur. Nesebinin kendisine katılması hususunda bana vasiyette bulunmuştu, dedi. ibnu Zem'a da: Bu, benim kardeşimdir; Bâbamın cariyesinin oğludur, Bâbamın döşeği üstünde doğmuştur, dedi. aleyhi ve sellem): \"Yâ Abd ibne Zem'a! Bu(Abdurrahmân),senin (kardeşin)dir\" buyurdu. da: \"Çocuk döşek sahibinindir. Zina eden erkeğe de mahrumiyet düşer\" dedi. Peygamber husûmet sebebi olan bu çocuğun sîmâca Utbe'ye benzediğini görerek eşi Şevde bintu Zem'a'ya hitaben: \"Ey Sevde! Bundan sonra sen de bu Abdurrahmân'dan perdelen\" buyurdu. bundan sonra bu Abdurrahmân, Sevde Allah’a kavuşuncaya kadar, Sevde'yi açık olarak görmemiştir",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2054,
			"arabicnumber": 2054,
			"text": "Adiyy ibn Hatim (radıyallahü anh) şöyle demiştir: Ben Peygamber’e mı'râd(avın)dan sordum. Peygamber (sallallahü aleyhi ve sellem.A.V.): \"Mı'râd sivri tarafıyla isabet ettiği zaman o avı ye. Enli tarafıyla isabet ettiği ve öldürdüğü zaman, artık o av hayvanını yeme. Çünkü okun enli tarafıyle vurulan hayvan vakizedir (sopa ile vurulmuş olup, haramdır)\" buyurdu. bu sefer: Rasûlallah! Ben av köpeğimi Bismillah diyerek salıyorum. Akabinde avın üzerinde onun beraberinde üstüne Besmele çekmediğim başka bir köpek buluyorum ve o avı bu iki köpekten hangisinin yakaladığını bilemiyorum? Dedim. \"Sen o avı yeme! Çünkü sen ancak kendi köpeğin üzerine Bismillah dedin, diğer köpek üzerine Bismillah demedin!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2055,
			"arabicnumber": 2055,
			"text": "Enes ibn Mâlik (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem.A.V.) bir kerresînde yerde düşürülmüş bir hurmaya tesadüf etti de: \"Şu hurmanın sadaka malından olmadığını bileydim, muhakkak onu yerdim\" buyurdu. Hemmâm, Ebû Hureyre'den; o da Peygamberden söyledi ki, Peygamber (sallallahü aleyhi ve sellem.A.V.): \"Bâzı defa gece ailemin yanına yatmağa geldiğimde yatağımın üstüne düşmüş bir hurma bulurum, yemek üzere ağzıma götürürüm de, sonra sadaka malı olmasından korkarak elimden bırakırım. Onun sadaka hurması olmadığını yakînen bilseydim muhakkak yerdim\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2056,
			"arabicnumber": 2056,
			"text": "Abbâd ibnu Temîm'in amucası Abdullah ibnu Zeyd el-Mâzinî şöyle demiştir: Bir kimsenin namaz kılarken gönlünde abdestinin bozulduğu hakkında bir vesvese hisseder olduğu Peygamber'e şikâyet tarzında arz olundu da: O zât namazı kesip bozar mı? Denildi.Peygamber (sallallahü aleyhi ve sellem): \"Hayır, bir ses işitmedikçe yahut bir koku duymadıkça namazı kesmez\" diye cevâb verdi. Muhammed ibn Ebî Hafsa, ez-Zuhrî'den söyledi ki, o: Abdest almak ancak koku duyduğun yahut ses işittiğin hâllerde olur, demiştir",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2057,
			"arabicnumber": 2057,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2058,
			"arabicnumber": 2058,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2059,
			"arabicnumber": 2059,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2061,
			"arabicnumber": 2061,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2062,
			"arabicnumber": 2062,
			"text": "Bize İbnu Cureyc haber verip şöyle dedi: Bana Atâ ibn Ebî Rebâh Ubeyd ibnu Umeyr'den şöyle haber verdi: Ebû Mûsâ el-Eş'ârî, Omer ibnu'l-Hattâb'ın yanına girmek için izin istedi de ona izin verilmedi. Ve Omer o sırada meşgûliyetli olsa gerekti. Bunun üzerine Ebû Mûsâ geri döndü. Omer meşguliyetten kurtulunca (Ebû Mûsâ'yı kasdederek): Ben Abdullah ibn Kays'ın sesini işitmedim mi?Ona izin veriniz de gelsin, demiş. Ebû Mûsâ gitti, denilmiş. Ebû Musa'yı çağırtıp dönüşünün sebebini sorunca, o: Biz bununla (yânı izin verilmeyen, kapıdan dönmekle) emrolunuyorduk, dedi. üzerine Omer: Rasûlüllah'ın böyle emrettiğine dâir beyyine getireceksin! Dedi. Bunun üzerine Ebû Mûsâ, Ensâr meclisine gitti de, onlardan bu emri bileni istedi. Ensâr: Bu mes'ele üzerine sana büyüklerimizin şâhidliğine ihtiyâç yok; bunu en küçüğümüz (meselâ) Ebû Saîd Hudrî (bile bilir) muhakkak şehâdet eder, dediler. Ebû Mûsâ, Ebû Saîd Hudrî'yi Omer'e götürdü (o da Peygamber'in emrini anlattı). Omer: Rasûlüllah'ın emrinden bu geri dönme mes'elesi bana kapalı mı kaldı?(Öyle ya) çarşılara, pazarlara çıkıp alışveriş etmek beni alıkoymuş, meşgûl etmiştir, dedi",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2063,
			"arabicnumber": 2063,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2064,
			"arabicnumber": 2064,
			"text": "Câbir ibn Abdillah (radıyallahü anh) şöyle demiştir: Bizler Peygamber(sallallahü aleyhi ve sellem.A.V.)'in beraberinde cum’a namazını kılmakta iken bir ticâret kervanı geldi. Oniki kişi müstesna, insanlar dağıldılar. Bunun üzerine şu âyet indi: \"Onlar bir ticâret yahut bir eğlence gördükleri zaman ona yönelip dağıldılar ve seni ayakta bıraktılar...\"(el-Cum’a:62/11)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2065,
			"arabicnumber": 2065,
			"text": "Âişe (r.anha) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem.A.V.) şöyle buyurdu: evinin yiyeceğinden, evinin geçimini bozucu olmayarak ikram ve infâk yaptığında, bu ikram ve infâkı sebebiyle kadın için bir ecr vardır. Bu malı kazanması sebebiyle kocasına,(bunu muhafaza etmesi sebebiyle) bekçisine de bir o kadar sevâb vardır. Bunların bâzısının sevabı, öbürlerinin sevabından hiçbir şey eksiltmez",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2066,
			"arabicnumber": 2066,
			"text": "Ebû Hureyre (radıyallahü anh) şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem.A.V.):\"Kadın, kocasının kazancından, kocasının emri olmaksızın infâk ettiği zaman, kocası için de yarı ücret vardır\" buyurdu",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2067,
			"arabicnumber": 2067,
			"text": "Enes ibn Mâlik (radıyallahü anh) şöyle demiştir: Beri Rasûlüllah (sallallahü aleyhi ve sellem.A.V.)'tan işittim, şöyle buyuruyordu: \"Kim rızkının kendisine genişletilmesi yahut ömrünün bakıyyesi kendisine uzatılması kendini sevindirirse, o kimse hısımlarıyle ilgilensin (yânı onlara iyiliği, ihsanı ekleyip dursun)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2068,
			"arabicnumber": 2068,
			"text": "Âişe (r. anha):Peygamber (sallallahü aleyhi ve sellem.A.V.) bir Yahudi'den, bedelini bir müddet sonra ödemek üzere zahire satın aldı ve ona demirden bir zırhı rehin bıraktı, dedi",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2069,
			"arabicnumber": 2069,
			"text": "Enes ibn Mâlik (radıyallahü anh)'ten: Enes (bir kerresinde)Peygamber'e bir arpa ekmeği ve bir mikdâr bayat yağ götürdü. Yemîn olsun o sırada Peygamber (sallallahü aleyhi ve sellem.A.V.) demirden bir zırhını Medine'de bir Yahûdî’nin yanında rehin bırakmış ve ondan ailesi için (va'de ile bir mikdâr) arpa almak üzere idi. Yine yemîn olsun bu hâlde iken, ben Peygamber'den işittim ki, O: \"Muhammed'in ev halkı yanında ne bir sâ' buğday, ne bir sâ dâne akşamladı\" buyuruyordu. Ve hakîkaten o zaman Peygamber'in yanında dokuz kadın vardı",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2070,
			"arabicnumber": 2070,
			"text": "Âişe (r.anha) şöyle demiştir: Ebû Bekr es-Sıddîk halîfe yapıldığı zaman şöyle dedi: Muhakkak ki benim kavmim, benim kazanç cihetimin kendi ailemi geçindirmekten âciz olmadığım kat'îyetle bilmiştir. Şimdi ise ben müslümânların işiyle meşgul kılındım. Onun için bundan sonra Ebû Bekr ailesi şu Beytü'l-mâl'den yiyecek ve Ebû Bekr de müslümânlarm Beytü’l-mâli hesabına kazanacaktır",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2071,
			"arabicnumber": 2071,
			"text": "Âişe (r.anha) şöyle demiştir: Rasûlüllah'ın sahâbîleri kendi işlerinin işçileri idiler (Bizzat çalışırlar, terlerler, namaza gelirlerdi). Bu sebeble vücûdlarında ağır kokular olur idi. (Rasûlüllah tarafından) kendilerine \"Keski yıkansaydınız!\" denilirdi. hadîsi Hemmâm, Hişâm'dan; o da Bâbası Urve'den; o da Âişe'den rivayet etmiştir",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2072,
			"arabicnumber": 2072,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2073,
			"arabicnumber": 2073,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2074,
			"arabicnumber": 2074,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2075,
			"arabicnumber": 2075,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2076,
			"arabicnumber": 2076,
			"text": "Câbir ibn Abdillah (radıyallahü anh)'tan: Rasûlüllah (sallallahü aleyhi ve sellem.A.V.): \"Satarken, satın alırken, alacağını taleb ve borcunu öderken cömertlik ve kolaylık gösteren kimseye Allah rahmet eylesin\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2077,
			"arabicnumber": 2077,
			"text": "Huzeyfe (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem.A.V.) şöyle buyurdu: \"Sizden evvelki milletlerden müsamahalı bir kişinin ruhunu melekler karşıladılar ve: (Dünyâda iken) hayır nev'inden bir şey işledin mi? diye sordular. kişi: Ben hizmetçilerime: (Borçlu olan)fakire mühlet veriniz ve müsamaha ediniz, diye emreder idim, dedim. üzerine melekler de ona müsamaha eylediler\" buyurdu. Ebû Mâlik, Rıb'î'den rivayetinde: \"Ben zengine karşı kolaylaştırır, fakire de mühlet verirdim' tarzında söylemiştir. hadîsi Abdulmelik'ten; o da Rıb'î'den rivayet etmekte Ebû Mâlik'e Şu'be ibnu'l-Haccâc mutâbaat etmiştir. Ebû Avâne, Abdulmelik'ten; o da Rıb'î'den rivayetinde: \"Ben (borçlu olan) zengine mühlet verir, fakirden de vazgeçerdim\" şeklinde söyledi. Nuaym ibnu Ebî Hind, Rıb'î'den rivayetinde: \"Ben zenginden kabul eder, fakirden de müsamaha ederdim\" şeklinde söylemiştir",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2078,
			"arabicnumber": 2078,
			"text": "Ebû Hureyre (radıyallahü anh)'den; Peygamber(sallallahü aleyhi ve sellem.A.V.) şöyle buyurdu: \"Bir tacir vardı. İnsanlara borç verir dururdu. Borçluyu fakir gördüğü zaman hizmetçilerine hitaben: Buna müsamaha gösteriniz; Allah 'ın da bizlere müsamaha etmesi ümtd edilir, derdi. İşte bu huyundan dolayı Allah o taciri müsamaha ve afv eylemistir",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2079,
			"arabicnumber": 2079,
			"text": "Hakîm ibn Hızâm (radıyallahü anh) şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem.A.V.) şöyle buyurdu: \"Alışveriş eden iki kişi (yani satıcı ile satın alıcı)birbirlerinden ayrılmadıkları müddetçe -yahut: Ayrılıncaya kadar, dedi- muhayyerliğe sâhiptirler. Bunlardan her biri dürüst ve doğru söyler ve (mala, semene âid hususları) birbirlerine beyân ederlerse, bu alışverişlerinde kendilerine bereket ihsan olunur. Eğer iki taraf (mal ve bedelin ayıbını) gizlerler ve yalan söylerlerse, bu alışverişlerinin bereketi giderilir",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2080,
			"arabicnumber": 2080,
			"text": "Ebû Saîd (radıyallahü anh) şöyle demiştir: Bize çeşitli nevi'lerden karışık olan hurma yığınından rızk verilirdi. Biz de onun iki sâ'ını bir sâ' hurmaya satardık. Peygamber (sallallahü aleyhi ve sellem.A.V) bize- \"İki sâ' hurmayı bir sâ'a; iki dirhemi de bir dirheme satmayınız\" buyurdu",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2081,
			"arabicnumber": 2081,
			"text": "Ebû Mes'ûd el-Ensârî (radıyallahü anh) şöyle demiştir: Ensâr'dan Ebû Şuayb diye künyelenen bir adam geldi ve kasâb olan bir kölesine: Bana beş kişiye yetecek bir yemek yap. Çünkü ben Peygamber'i beş kişinin beşincisi olarak da'vet etmek istiyorum. Zira ben Peygamber'in yüzünde açlığı tanıdım, dedi. Nihayet o zât onları da'vet etti. Da'vetli olan toplulukla beraber bir adam da geldi. Ebû Şuayb'ın evine vardığında Peygamber (sallallahü aleyhi ve sellem.A.V):\"Şu zât bize tâbi' olup gelmiştir. Ona izin vermek istersen izin ver (girsin); gen dönmesini istersen geri dönsün!\" buyurdu. Ebû Şuayb: Hayır (geri dönmeyecek), ben ona izin verdim, dedi",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2082,
			"arabicnumber": 2082,
			"text": "Hakîm ibn Hızâm (radıyallahü anh)'dan: Peygamber(sallallahü aleyhi ve sellem.A.V.) şöyle buyurdu: \"Satıcı ile satın alıcı birbirlerinden ayrılmadıkları müddetçe - yahut şöyle dedi: Ayrılıncaya kadar - muhayyerliktedirler. Bunlardan her biri doğru söyleyip (metâ'a ve bedele âid hususları) birbirine beyân ederlerse, bu alışverişlerinde kendilerine bereket ihsan olunur. Eğer ikisi de (mal ve semenin ayıbını) gizler de yalan söylerlerse, alışverişlerinin bereketi giderilir",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2083,
			"arabicnumber": 2083,
			"text": "Ebû Hureyre (radıyallahü anh)'den: Peygamber(sallallahü aleyhi ve sellem.A.V.) şöyle buyurdu: \"Muhakkak insanlara öyle bir zaman gelecek ki, o vakit kişi eline geçirdiği malı halâldan mı, yoksa haramdan mı kazandığını düşünmeyecektir",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2084,
			"arabicnumber": 2084,
			"text": "Âişe (r.anha) şöyle demiştir: el-Bakara Sûresi'nin sonundaki ribâ âyetleri indiği zaman Peygamber (sallallahü aleyhi ve sellem.A.V.) bu âyetleri mescidde sahâbîlere karşı okuyup tebliğ etti, sonra da şarâb hususunda ticâreti haram kıldı",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2085,
			"arabicnumber": 2085,
			"text": "Semure ibnu Cundeb (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem.A.V.) şöyle buyurdu: \"Ben bu gece ru'yâmda iki kişi gördüm; onlar bana geldiler, müteakiben onlar beni düz bir yere çıkardılar. Birlikte yürüdük, nihayet kandan bir nehir üzerine geldik. O nehir içinde dikelmiş bir adam vardı. Nehrin kıyısında da bir adam vardı. Önünde bir takım taşlar vardı. Nehirdeki adam yüzerek sahile doğru gelip çıkmak isteyince, sahildeki adam onun çenesine bir taş atıyor, nehirdekini eski yerine döndürüyordu. Çıkmak için sahile doğru gelmeye her teşebbüs ettikçe, sahildeki hemen onun çenesine bir taş fırlatıyor, o da eski yerine dönüyordu. Ben o iki meleğe: Bu nedir? Dedim. biri:. O nehirde gördüğün kimse ribâ yiyendir, dedi",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2086,
			"arabicnumber": 2086,
			"text": "Ebû Cuhayfe'nin oğlu Avn şöyle demiştir: Bâbam Ebû Cuhayfe'yi gördüm ki, o kan alıcı bir köle satın almıştı. Sonra Ebû Cuhayfe bu köleye emretti de, onun kan alma âletleri kırıldı. Ben Bâbamdan bu kırmayı sordum. O şöyle cevâb verdi: Peygamber (sallallahü aleyhi ve sellem.A.V.) köpek bedelinden, kan alma ücretinden nehyetti. Döğün yapıcılıktan, döğünlenmekten, ribâ yiyiciliğinden ve ribâ yediricilikten de nehyetti. Suret yapıcı musavvire de la'net eyledi",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2087,
			"arabicnumber": 2087,
			"text": "İbnu Şihâb ez-Zuhrî dedi ki: Saîd ibnu'l-Müseyyeb şöyle dedi: Ebû Hureyre(radıyallahü anh) şöyle dedi: Ben Rasûlüllah (sallallahü aleyhi ve sellem.A.V.)'den kulağımla işittim; \"Yemin, mal için sürüm ve revâc sebebi (sanılır; hakikatte)bereketin mahv sebebidir\" buyuruyordu",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2088,
			"arabicnumber": 2088,
			"text": "Abdullah ibn Ebî Evfâ (radıyallahü anh)'dan (şöyle demiştir): Bir adam çarşıda satış esnasında müslümânlardan bir kimseyi satılık mal hakkında satın almaya ikna etmek için \"Bu malın bedeline, müşterinin vermediği bir bedel verdiğini\" Allah'a yemîn ederek, malına revâc vermişti. Bu vak'a üzerine şu âyet indi: \"Hakikat Allah'a olan ahidlerine ve yeminlerine bedel az bir bahâyı satın alanlar; işte onlar için âhirette hiçbir nasîb yoktur. Allah kıyâmet günü onlarla konuşmaz, onlara bakmaz, onları temize çıkarmaz. Onlar için pek acıtıcı bir azâb vardır\" (Âlu İmrân: 77)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2089,
			"arabicnumber": 2089,
			"text": "İbn Şihâb dedi ki: Bana Hüseyin'in oğlu Alî haber verdi ki, kendisine Alî'nin oğlu Hüseyin şöyle haber vermiştir: Alî radıyallahü anh şöyle demiştir: Bedir gazasında ganîmetten payıma düşen bir devem vardı. Peygamber de ganimet malının beşte birinden bana bir deve vermiş idi. Rasûlüllah'ın kızı Fâtıma (radıyallahü anhâ) ile evlenmek istediğim zaman Kaynukaa' Yahûdîleri'nden kuyumcu bir adamla, benimle beraber gidip ızhır otu getirmek üzere va'dleştim. Getirdiğimiz ızhır otunu kuyumculara satmayı ve bunun bedeliyle evlenme ziyafetinin masrafı hususunda yardım istemeyi düşündüm",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2090,
			"arabicnumber": 2090,
			"text": "İbn Abbâs radıyallahü anhüma'tan(şöyle demiştir): Rasûlüllah (sallallahü aleyhi ve sellem.A.V.) şöyle hitâb buyurdu: \"Şübhesiz Mekke'yi Allah haram kılmıştır. Mekke benden evvel hiçbir kimse için halâl olmadı, benden sonra da hiçbir kimse için halâl olmayacaktır, O ancak, bir günün bir saatinde benim için halâl olmuştur. Mekke'nin otu koparılmaz, ağacı kesilmez, av hayvanı ürkütülmez, Mekke'nin yitiği yerden alınmaz, ancak sahibini arayıcı alabilir\". oğlu Abbâs: Kuyumcularımız ve evlerimizin tavanları için ızhır müstesna olsun, dedi. Bunun üzerine Rasûlüllah: \"Izhır müstesna\" buyurdu. Av hayvanı ürkütülmez nedir bilir misin? O, hayvanı gölgeden uzaklaştırman ve yerine konmandır, dedi. Hâlid'den: Kuyumcularımız ve kabirlerimiz için, diye söylemiştir",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 2091,
			"arabicnumber": 2091,
			"text": "Habbâb ibn Erett (radıyallahü anh) şöyle demiştir: Ben Câhiliyet devrinde bir kılıç yapıcı kimse idim. Benim Âs ibn Vâil üzerinde bir alacağım vardı. Bir gün alacağımı tahsil etmek üzere ona geldim. O bana: Sen Muhammed'e küfretmedikçe sana borcumu vermem, dedi. Ben de: Allah senin canını alıp sonra sen diriltilmedikçe ben Muhammed'e küfretmem, dedim. defa o: Öyle ise ben ölünceye, sonra diriltilinceye, (âhiretle) bana mal ve oğul, kız verilinceye kadar sen beni bırak da, sana borcumu orada vereyim, dedi. müteâkib şu âyetler indi:\" (Şu) âyetlerimizi inkâr eden ve 'Bana elbette mal ve evlâd verilecektir, diyen adamı gördün mü? O gayba mı vâkıf, yoksa Rahman olan Allah nezdinde bir ahid mi edinmiş? - Hayır, Öyle değil. Biz onun söyleyegeldiği sözü yazar, azabını da uzattıkça uzatırız. Onun söyler olduğuna biz mîrâsçı olacağız ve o bize tek başına gelecektir\" (Meryem: 77-80)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 2092,
			"arabicnumber": 2092,
			"text": "Enes ibn Mâlik (radıyallahü anh) şöyle diyordu: Bir terzi yapmış olduğu bir yemeğe Rasûlüllah'ı da'vet etti. Enes ibn Mâlik dedi ki: Ben de Rasûlüllah'ın beraberinde bu yemeğe gittim. Terzi Rasûlüllah'a bir mikdâr ekmek, bir mikdâr çorba yaklaştırdı. Çorbanın içinde kabak ve kuru et parçaları vardı. Yemek yerken Peygamber'i gördüm ki, yemek çanağının etrafından kabak araştırıyordu. Yine Enes: Artık o günden i'tibâren ben kabağı sevmekten bir an ayrılmadım, dedi",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 2093,
			"arabicnumber": 2093,
			"text": "Ebû Hazım dedi ki: Ben Sehl ibn Sa'd (radıyallahü anh)'dan işittim, şöyle dedi: Bir kadın Rasûlüllah'a bir bürde getirdi. Sehl, yanındakilere hitaben: Bürde nedir bilir misiniz? diye sordu. tarafından: Şemle'dir, ihrâm'dır, diye cevâb verildi. dedi ki: Evet, o henüz dokunmuş(yeni tezgâhtan çıkmış) ve kenarı bile kesilmemiş bir kumaştı. Kadın: Yâ Rasûlüllah! Bu bürdeyi kendi elimle dokudum, onu sana giydireceğim, dedi. Peygamber bürdeyi, ona bir ihtiyaclı olarak aldı. Sonra Peygamber bu bürdeyi izâr yapıp giymiş olduğu hâlde bizim yanımıza çıktı. Topluluktan bir kimse: Ya Rasûlallah, onu bana giydir, dedi. Rasûlüllah: Peki, diyerek mecliste oturdu. Sonra hücresine döndü ve o bürdeyi çıkarıp dürdükten sonra' istemiş olan zâta yolladı. Bunun üzerine mecliste bulunan cemâat o isteyen kimseye: Sen bu işi güzel yapmadın. Peygamber'in hiçbir isteyeni geri çevirmeyeceğini kat'î bildiğin hâlde, O'ndan bu bürdeyi istedin, diye serzeniş ettiler. O zât da: Vallahi ben onu başka sebepden değil, ancak öleceğim günde benim kefenim olması için istedim, dedi. ibn Sa'd: Hakîkaten bu bürde o zâtın kefeni oldu, demiştir",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 2094,
			"arabicnumber": 2094,
			"text": "Ebû Hazım şöyle dedi: Bir takım adamlar Sehl ibn Sa'd'e gelip ona Peygamber'in minberini soruyorlardı. Sehl(radıyallahü anh) şöyle dedi: Rasûlüllah (sallallahü aleyhi ve sellem.A.V.) fulanca kadına - Sehl o kadının ismini söylemiştir- şöyle haber gönderdi: \"Marangoz olan kölene emret de benim için insanlara hitâb ettiğim zaman üzerine oturabileceğim tahtadan bir yer yapsın” buyurdu. Bunun üzerine kadın, o kölesine emretti. Köle de Gâbe ormanlığının ılgın ağacından onu yapıyordu. Sonra bu tahtaları kadına getirdi. Kadın da bunları Rasûlüllah'a yolladı. Rasûlüllah onların kurulmasını emretti de bunlar yerine konuldu. Müteakiben de Rasûlüllah (va'z ve hutbe için) minber üzerine oturdu",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 2095,
			"arabicnumber": 2095,
			"text": "Câbir ibn Abdülah (radıyallahü anh)'tan(şöyle demiştir): Ensâr'dan bir kadın Rasûlüllah'a: Yâ Rasûlüllah! Benim marangoz bir kölem vardır; senin için üzerine oturacağın bir şey yaptırayım mı? dedi. \"İstersen yaptır\" buyurdu, dedi ki: Bunun akabinde kadın, Rasûlüllah için o minberi yaptırdı. Nihayet cumua günü olunca Peygamber( sallallahü aleyhi ve sellem.A.V.) yerine konulan o minber üzerine oturdu. Akabinde daha önce yanında hutbe yapar olduğu hurma kütüğü sayha çıkardı, hattâ kendi kendine yarılacaktı. Peygamber minberden indi, onu eliyle tuttu ve onu kucakladı. O sırada kütük susturulmakta olan çocuk gibi hafîf hafîf inliyordu. Nihayet kararlaşıp sustuktan sonra Rasûlüllah: \"O, yanında edildiğini işitmekte olduğu Zikru'llah için ağladı\" buyurdu",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 2096,
			"arabicnumber": 2096,
			"text": "Âişe (r. anha): Rasûlüllah (sallallahü aleyhi ve sellem.A.V.) bir Yahudi'den, bedeli bir zaman sonra verilmek üzere, veresiye hububat satın aldı ve o Yahûdî'ye kendi zırhını rehin bıraktı, demiştir",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 2097,
			"arabicnumber": 2097,
			"text": "Câbir ibn Abdillah (radıyallahü anh) şöyle demiştir: Ben bir gazada Peygamber'in beraberinde bulundum. (Dönüşte) devem beni geri bıraktı ve yürümekten âciz oldu. Bu sırada Peygamber yanıma geldi ve: \"Yâ Câbir\" diye seslendi. Ben: Evet benim, dedim. Rasûlüllah: \"Zorun nedir (ki geri kaldın)?\" diye sordu Devem beni geri bıraktı ve yoruldu da ben arkada kaldım, dedim. hemen (devesinden) indi ve çengelli deyneği ile devemi çekmeye koyuldu. Sonra bana: ' 'Haydi, şimdi bin!' dedi. de bindim. Bu defa da devemi gördüm ki, onu ben Rasûlüllah'ın devesini geçmekten men' ediyordum. Rasûlüllah(yol konuşması olmak üzere) bana: \"Evlendin mi?\" diye sordu. Ben de: Evet, evlendim, dedim. \"Kız mı, yoksa dul mu (aldın)?\" diye sordu. de: Dul, diye cevâb verdim. \"Senin onunla, onun da seninle oynaşacağınız bakire bir kız istemez miydin?\" dedi. de: Bakımları bana borç olan bir takım kızkardeşlerim var. Onun için bir kadınla evlenmeyi, bunun da çocukları toplamasını ve saçlarını, başlarını taramasını ve bunlar üzerinde bir mürebbiye olmasını hayırlı buldum, dedim. \"Şimdi sen(Medîne'ye) varıyorsun. Vardığında artık ailene karşı akıllı, olgun, bağlı ol. Allah'tan evlâd isteyiniz\"buyurdu. Sonra: \"Deveni satar mısın?\" diye sordu. de: Evet satarım, dedim. benden devemi bir ûkıyye (kırk dirhem)ye satın aldı. Sonra Rasûlüllah benden önce Medîne'ye gitti. Ben de kuşluk vakti vardım. Mescide geldik. Rasûlüllah'ı mescidin kapısı önünde bulduk. Rasûlüllah bana: \"Şimdi mi geldin?\" diye sordu. de: Evet, şimdi geldim, diye cevâb verdim. \"Artık deveni bırak da (mescide)gir ve iki rek'at (geliş namazı) kıl\" buyurdu. de girdim ve kıldım. Sonra Rasûlüllah, Bilâl'e bir ûkıyye(gümüş) tartıp bana vermesini emretti. Bilâl de, terâzî ağır basarak tartıp verdi. Ben arkamı çevirip eve giderken birden Rasûlüllah: \"Câbir'i bana çağır\" buyurdu. Rasûlüllah devemi beğenmedi de şimdi geri verecek sandım. Halbuki bana bu deve kadar sevimsiz birşey yoktu. Rasûlüllah: \"Deveni al, bedeli de senin olsun\" buyurdu",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 2098,
			"arabicnumber": 2098,
			"text": "İbn Abbâs radıyallahü anhüma şöyle demiştir: Ukâz, Mecenne ve Zu'l-Mecâz, Câhiliyet devrinde(meşhur) panayırlardı. İslâm devri olunca bu panayırlarda ticâret yapmayı günâh saydılar. Bunun üzerine Allah: \"Hacc mevsimlerinde ticâretle Rabbinizden rızk istemenizde üzerinize bir günâh yoktur...\" (el-Bakara: 198) âyetini indirdi. İbn Abbâs bu âyeti böyle \"Fî-mevâsimi’l-hacc (= Hacc mevsimlerinde)\" kaydı ile okudu",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 2099,
			"arabicnumber": 2099,
			"text": "Amr ibn Dînâr şöyle dedi: Şurada (yani Mekke şehrinde) Nevvâs isminde bir (deve taciri) kimse vardı. Bunun yanında hastalıklı develer de vardı. İbn Omer (radıyallahü anh) gidip, Nevvâs'ın bir ortağından bu hastalıklı deveyi satın aldı. Sonra ortağı Nevvâs'a geldi de: O hasta deveyi sattık, dedi. Nevvâs: Sen o deveyi kime sattın? Dedi. Şöyle şöyle sıfatta bir ihtiyara sattım, dedi. Vay sana yazıklar olsun! Vallahi bu ihtiyar zât İbnu Omer'dir, dedi ve hemen İbn Omer'e gitti ve: Ortağım sana kusurunu bildirmeden hastalıklı deve satmıştır, deyip vaziyeti anlattı. Omer: Öyleyse deveni sür git, dedi. deveyi alarak sürüp gitmeye davrandığı zaman, İbn Omer: Haydi, bırak şu deveyi! Artık biz Rasûlüllah'ın \"Hastalığın bizatihi sirayeti yoktur\" hükmüne razı olmuş kimseleriz, dedi",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 2100,
			"arabicnumber": 2100,
			"text": "Ebû Katâde (radıyallahü anh) şöyle demiştir: Bizler Huneyn yılında Rasûlüllah'ın beraberinde sefere çıktık. Nihayet Rasûlüllah(sallallahü aleyhi ve sellem.A.V.) ben Ebû Katâde'ye bir zırh verdi. Ben de o zırhı sattım da, onun bedeliyle Benû Seleme yurdunda küçük bir bustân satın aldım. İşte bu bustân, İslâm'da aslına sâhib olduğum ilk maldır",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 2101,
			"arabicnumber": 2101,
			"text": "Ebû Mûsâ (radıyallahü anh) şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem.A.V.) şöyle buyurdu: \"İyi arkadaş ile kötü arkadaşın meseli, misk sahibi ile demirci körüğü gibidir. Misk sahibinden sana şu iki ikiden biri yok olmaz: Ya sen ondan bir mikdâr satın alırsın, yahut onun güzel kokusunu hisseder koklarsın, Demirci körüğü ise bedenini yahut elbiseni yakar, yahut da ondan pis bir koku hissedersin",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 2102,
			"arabicnumber": 2102,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 2103,
			"arabicnumber": 2103,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 2104,
			"arabicnumber": 2104,
			"text": "Abdullah ibn Omer (radıyallahü anh) şöyle demiştir: Bir kerre Peygamber (sallallahü aleyhi ve sellem.A.V.) Omer ibnu'l-Hattâb'a ipek yahut siyerâ(denilen sarı çubuklu) bir hülle(yânı takım elbise) gönderdi. Sonra Peygamber bu elbiseyi Omer'in üzerinde gördü de: \"Ben bu elbiseyi sana giymen için göndermedim. Bu ipekli elbiseyi ancak âhirette nasibi olmayan erkek giyer. Ben ancak bunu sana satıp da faydalanasın diye gönderdim\" buyurdu",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 2105,
			"arabicnumber": 2105,
			"text": "Mü'minlerin anası Âişe (r.anha) şöyle haber vermiştir: Kendisi, üstünde bir takım resimler bulunan küçük bir yastık, bir şilte satın almıştı. Rasûlüllah(sallallahü aleyhi ve sellem.A.V.) bunu görünce kapının önünde dikeldi de içeriye girmedi. (Âişe dedi ki:) Bu sırada ben O'nun yüzündeki istemezliği sezip tanıdım. Ve: Yâ Rasûlallah! Ben Allah'a ve Rasûlü'ne tevbe ederim. Ben ne günâhı işledim ki? dedim. \"Şu yastığın hâli nedir?\" buyurdu. Ben: Ben onu Sen üzerinde oturasın ve yaslanasın diye, Senin için satın aldım, dedim. \"Bu suretlerin sahibleri kıyâmet gününde muhakkak azab edilirler. Ve bu kimselere: Sûret verdiğiniz bu mahlûkları diriltiniz, denilir\". Ve yine Rasûlüllah: \"İçinde suretler bulunan eve melekler girmez\" buyurdu",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 2106,
			"arabicnumber": 2106,
			"text": "Enes ibn Mâlik (radıyallahü anh) şöyle dedi: Peygamber(sallallahü aleyhi ve sellem.A.V.): \"Ey Neccâr oğulları, arsanızın kıymetini bana söyleyiniz!\" buyurdu. O çevrilmiş bahçenin içinde bakılmamış harâb yerler ve hurma ağaçları vardı",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 2107,
			"arabicnumber": 2107,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 2108,
			"arabicnumber": 2108,
			"text": "Bize Hemmâm, Katâde ibn Diâme'den; o da Ebu’l-Halît’den; o da Abdullah ibnu'l-Hâris'ten; o da Hakîm ibn Hızâm'dan tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem.A.V.): \"Satıcı ile satın alıcı birbirlerinden ayrılmadıkça muhayyerliktedirler\" buyurdu",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 2109,
			"arabicnumber": 2109,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 2110,
			"arabicnumber": 2110,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 2111,
			"arabicnumber": 2111,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 2112,
			"arabicnumber": 2112,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 2113,
			"arabicnumber": 2113,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 2114,
			"arabicnumber": 2114,
			"text": "Bize Hemmâm ibn Yahya tahdîs edip şöyle dedi: Bize Katâde, Ebû'l-Halîl'den; o da Abdullah ibnu'l-Hâris'ten; o da Hakîm ibn Hızâm (radıyallahü anh)'dan tahdîs etti ki, Peygamber (sallallahü aleyhi ve sellem.A.V.): \"Satıcı ve müşteri birbirlerinden ayrılmadıkları müddetçe -yahut: Ayrılıncaya kadar-muhayyerliktedirler\" buyurmuştur. Râvî Hemmâm dedi ki: Ben kendi kitabımda şöyle yazılı buldum: \"O üç kerre ihtiyar eder. Eğer satıcı ve müşteri doğru söylerler ve gerçeği beyân ederlerse, alışverişlerinde onlar için bereket ihsan olunur. Eğer yalan söylerler ve gerçeği gizlerlerse hayırsız bir kâr kazanmaları ve alışverişlerinin bereketinden mahrum kılınmaları umulur",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 2115,
			"arabicnumber": 2115,
			"text": "Ve el-Humeydî şöyle dedi: Bize Sufyân ibn Uyeyne tahdîs edip şöyle dedi: Bize Amr ibn Dînâr tahdîs etti ki, İbn Omer(radıyallahü anh) şöyle demiştir: Biz Peygamber (sallallahü aleyhi ve sellem.A.V.)'in beraberinde olarak bir seferde idik. Ben, Bâbam Omer'in genç, çetin bir devesine binmiştim. Deve bana galebe ediyor ve kaafilenin önüne geçiyordu. Omer de onu men' edip geriye çeviriyordu. Sonra devem tekrar kaafileyi geçiyor, Omer de onu men' edip çeviriyordu. Bu sırada Peygamber(sallallahü aleyhi ve sellem.A.V.) Omer'e: \"Şu hırçın deveni bana sat!\" buyurdu. O Senindir yâ Rasûlallah, dedi. tekrar: \"Şu deveyi bana sat!\" buyurdu. de o deveyi Rasûlüllah'a sattı. Peygamber hemen: \"Yâ Abdallah ibn Omer! Şimdi bu deve senindir, ona istediğini yapabilirsin!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 2116,
			"arabicnumber": 2116,
			"text": "Ebû Abdillah el-Buhârî dedi ki: Ve el-Leys ibn Sa'd şöyle dedi: Bana Abdurrahmân ibnu Hâlid, İbnu Şihâb'dan; o da Sâlim'den tahdis etti ki, Bâbası Abdullah ibn Omer (radıyallahü anh) şöyle demiştir: Ben Mü'minlerin Emîri Usmân'dan, onun Hayber'deki bir malı mukaabilinde diğer bir vâdîde bir mal (bir arazî yahut bir akar) satın aldım. Alışverişi yaptığımız zaman ben topuğum üzerinde geri döndüm ve nihayet onun evinden dışarı çıktım. Böyle çabuk dışarı çıkışım, satışı geri almak istemesi korkumdan dolayıdır. O vakit satışta sünnet olan hukûk yolu, satıcı ile müşteri birbirlerinden ayrılıncaya kadar meclis muhayyerliğinde olmaları idi. Abdullah dedi ki: Evinden çıkmamla, benim ve onun bu satış muamelesi vâcib olunca (yani kesinleşip fesih hakkı kalmayınca) ben bu satış işinde onu aldattığımı gördüm. Çünkü ben onu üç gecelik yol ile Semûd kavmi arazîsine sevk ettim, o ise beni üç gecelik yol ile Medine'ye şevketti",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 2117,
			"arabicnumber": 2117,
			"text": "Abdullah ibn Omer (radıyallahü anh) 'den(şöyle demiştir): Bir kimse Peygamber'e alışverişlerde dâima kendisinin aldatıldığını söyledi. Peygamber(sallallahü aleyhi ve sellem) ona:\"Sen birşey satın almak istediğinde (İslâm Dîni'nde) aldatmak yoktur de!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 2118,
			"arabicnumber": 2118,
			"text": "Âişe (r.anha) tahdîs edip şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem.a.v.) şöyle buyurdu: \"Bir ordu Ka'be'yi (harâb etmeye) kasdedecek. Bunlar Beydâ mevkiine geldiklerinde evvelleri ve âhirleriyle (yânı başbuğlarından son neferlerine kadar hepsi) yere batırılırlar\" buyurdu. dedi ki: Ben: Yâ Rasûlallah! Bunlar, evvelleri ve âhirleriyle nasıl yere batırılırlar; Halbuki bunların arasında(alışverişle geçinen) çarşılar halkı ve o zâlimlerden olmayan kimseler vardır, dedim. \"Bunlar evvelleri ve âhirleriyle batırılırlar. Sonra bu batırılanlar (kıyâmet gününde) kendi niyetlerine göre diriltilirler\" buyurdu",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 2119,
			"arabicnumber": 2119,
			"text": "Ebû Hureyre (radıyallahü anh) şöyle demiştir:Rasûlüllah (s.a.v.) şöyle buyurdu: \"Herhangi birinizin cemâatle namazı, (alışveriş ettiği)çarşısında ve evinde (yalnızca kıldığı) namazı üzerine yirmi küsur derece ziyâde olur. Bu ziyâdeliğin sebebi şudur: O kimse abdeste niyet edip abdestini güzel aldığı ve namazdan başka bir kasdı olmaksızın mescide gittiği zaman (tâ mescide girinceye kadar) her adım attıkça o adımdan dolayı muhakkak bir derece yükseltilir yahut o adım sebebiyle kendisinden muhakkak bir günâh indirilir. Melekler de sizin her birinize namaz kılacağı yerde abdestini bozmadan ve orada kimseye eziyet etmeden durduğu müddetçe: 'Ey Allahım! Ona salât eyle, Ey Allahım ona merhamet eyle!' diye duâ ve istiğfar ederler\". yine: Rasûlüllah (sallallahü aleyhi ve sellem.a.v.): \"Sizden herhangi biriniz, namaz kendisini habsetmekte olduğu müddetçe bir namaz(sevabı)içindedir\" buyurdu",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 2120,
			"arabicnumber": 2120,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 2121,
			"arabicnumber": 2121,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 2122,
			"arabicnumber": 2122,
			"text": "Ebû Hureyre ed-Devsî (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem.a.v.) gündüzün bir parçasında çıktı; O benimle, ben de O'nunla konuşmayarak Kaynukaa çarşısına gelinceye kadar (yürüdü). Sonra(oradan dönüp) Fâtıma'nın evinin önünde bir kenara oturdu ve (Hasan'ı yahut Hüseyin'i kasdederek): \"Küçük orada mısın, küçük orada mısın?\" diye sordu. Fâtıma çocuğu evden çıkmaktan biraz alıkoydu. Zannettim ki bu az zaman içinde annesi çocuğu ya giydirdi yahut başını yıkayıp taramıştı. Sonra çocuk koşarak geldi. Peygamber (sallallahü aleyhi ve sellem.a.v.) çocuğu kucaklayıp sarmaştı ve onu öptü de: \"Ey Allahım, sen bu çocuğu sev; onu seveni de sev!\" diye dua etti. ibn Uyeyne(geçen isnâdla) şöyle dedi: Ubeydullah ibn Ebî Yezîd şöyle dedi: Bana haber verdi ki, O, Nâfi' ibn Cubeyr'in bir rek'atle vitir kıldığını görmüştür",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 2124,
			"arabicnumber": 2124,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 2125,
			"arabicnumber": 2125,
			"text": "Atâ ibnu Yesâr şöyle dedi: Ben, Abdullah ibnu Amr ibni'l-Âs (radıyallahü anh)'a kavuştum da ona: Sen bana Rasûlüllah(sallallahü aleyhi ve sellem.a.v.)'ın Tevrat'ta yazılı olan sıfatından haber ver, dedim. ibn Amr te'kîdli olarak şöyle cevâb verdi: Evet, vallahi Rasûlüllah Kur'ân'daki sıfatlarının bâzısıyle muhakkak Tevrat'ta vasıflandırılmıştır(ki şöyledir): \"EyPeygamber, biz seni hakîkaten bir şâhid, bir müjdeci, bir korkutucu ve ümmîlere (âcizlere) bir koruyucu olarak gönderdik. Sen elbette benim kulum ve rasûlümsün. Ben sana \"Mütevvekkil\" adını verdim. Bu peygamber kötü huylu, katı kalbli, çarşılarda çağırgan değildir. O kötülüğe kötülükle mukaabele etmez, fakat o kötülüğü afv ile mağfiret ile karşılar. Allah eğrilmiş, sapmış olan milleti bupeygamber ile onları tâ lailahe illellah demeleri suretiyle doğrultmadıkça, o peygamberin ruhunu asla kabzetmeyecektir. Allah birçok kör gözleri, birçok sağır kulakları, birçok kapalı kalbleri bu tevhîd kelimesiyle açacaktır\". Abdulazîz ibn Ebî Seleme, bu hadîsi seneddeki Hilâl ibn Alî'den rivayet etmekte diğer râvî Fulayh'a mutâbaat etmiştir. ibn Ebî Hilâl, hadîsin senedindeki Hilâl'den; o da Atâ ibn Yesâr'dan; o da sahâbî olan Abdullah ibn Selâm'dan olmak üzere söyledi: gılâf içinde olan her şeydir: Kılıç gılâf içinde olduğu zaman \"Seyfun ağlefu ( = Kılıflı kılıç)\"; yay gılâf içinde olduğu zaman \"Kavsun ğalfau( = Kılıflı yay)\"; erkek sünnetli olmadığı zaman \"Raculun ağlefu (- Kabuklu adam)\" denilir. Bu tefsîri Ebû Abdillah el-Buhârî söyledi. ölçünüz ki, sizin için bereketlendirilsin!\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 2126,
			"arabicnumber": 2126,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 2127,
			"arabicnumber": 2127,
			"text": "Câbir ibn Abdillah (radıyallahü anh) şöyle demiştir: (Bâbam) Abdullah ibn Amr ibn Haram, üzerinde (ödenecek) bir borç olduğu hâlde Uhud harbinde vefat etti. Ben onun alacaklılarının bu borçtan bir mikdârını bırakmaları hususunda Peygamber'den yardım istedim. Peygamber onlardan böyle bir sulh istedi, fakat alacaklılar (Yahûdî olduklarından) birşey bırakmadılar. Bunun üzerine Peygamber (sallallahü aleyhi ve sellem.a.v.) bana: \" (Ey Câbir, sen bahçene) git, hurmanı toplayıp sınıf sınıf ayır: Acve cinsini bir boy, Azku Zeyd cinsini de bir boy yap. Sonra bana haber gönder!\" buyurdu. bu işleri yaptım, sonra Peygamber'e haber gönderdim. Peygamber geldi ve hurma yığınının üst tarafına yahut ortasına oturdu. Sonra (orada bekleşen alacaklılara işaret ederek): \"Haydi şu alacaklı kavmin için ölç!\" buyurdu. de o alacaklılara, hakları olan mikdârı tamamen verinceye kadar ölçtüm; hurmam geri kaldı; sanki ondan hiçbirşey eksilmemiş gibiydi. Firâs ibn Yahya, Şa'bî'den söyledi ki, o şöyle demiştir: Bana Câbir, Peygamber'den tahdîs etti de: Ben alacaklılar için ölçmeye devam ettim, nihayet borcu ödedim, dedi. Hişâm ibn Urve, Vehb ibn Keysân'dan olmak üzere söyledi ki, Câbir şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem.a.v.): \"Hurma salkımlarını alacaklı için kes, sonra da onun hakkını öde!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 2128,
			"arabicnumber": 2128,
			"text": "el-Mıkdâm ibnu Ma'dîkerib (radıyallahü anh)'den:Peygamber (sallallahü aleyhi ve sellem.a.v.):",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 2129,
			"arabicnumber": 2129,
			"text": "Abdullah ibn Zeyd (radıyallahü anh)'den: Peygamber(sallallahü aleyhi ve sellem.a.v.) şöyle buyurmuştur: \"Şübhesiz İbrahim Peygamber Mekke'yi harem kıldı ve Mekke için (bereketle) dua etti. İbrâhîm Peygamberin Mekke'yi harem kılışı gibi, ben de Medine'yi harem (yani ihtiram edilecek yer) kıldım ve Medine için müdd’ü ve sâ'ı hakkında, İbrahim aleyhi's-selâmın Mekke için yaptığı dua gibi, dua ettim",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 2130,
			"arabicnumber": 2130,
			"text": "Enes ibn Mâlik (radıyallahü anh)'ten: Rasûlüllah(sallallahü aleyhi ve sellem.a.v.) Medîneliler'i kasdederek: Allahım, bunlara kilelerinde bereket ihsan eyle, sâ'la’rında ve müdd’lerinde bereket ihsan eyle!\" diye duâ eylemiştir. \"'Ben onu bedeliyle aldım\" buyurdu",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 2131,
			"arabicnumber": 2131,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 2132,
			"arabicnumber": 2132,
			"text": "İbn Abbâs radıyallahü anhüma: Rasûlüllah(sallallahü aleyhi ve sellem.a.v.), kişiyi satın aldığı yiyecek maddesini tamamen teslim alıncaya kadar başka bir müşteriye satmaktan nehyetti, demiştir. Ben (Tâvûs ibn Keysân), İbn Abbâs'a: Böyle bir satıştan nehyin sebebi nedir? Diye sordum, ibn Abbâs: Müşterinin satın aldığı herhangi bir gıda maddesini kabz ve nakletmeden başkasına satması, parayı para ile satmak demektir. Halbuki ortada satın alınmış olan malın edası geri bırakılmıştır, dedi",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 2133,
			"arabicnumber": 2133,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 2134,
			"arabicnumber": 2134,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 2135,
			"arabicnumber": 2135,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 2136,
			"arabicnumber": 2136,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 2137,
			"arabicnumber": 2137,
			"text": "İbn Şihâb şöyle dedi: Bana İbnu Omer'in oğlu Salim haber verdi ki, İbn Omer (radıyallahü anh) şöyle demiştir: Yemîn olsun ben Rasûlüllah(sallallahü aleyhi ve sellem.a.v.) zamanında ölçüsüz, tartısız olarak götürü pazarlıkla yiyecek maddesi satın alan(ve kabz etmeden başkasına satmak isteyen ihtikâra) insanlar gördüm ki, bunlar o malları yükleyip kendi menzillerine nakledinceye kadar, onları bulundukları yerlerinde satmamaları için -veya: onları bulundukları yerlerinde satmalarının kerahetinden dolayı- döğülürlerdi",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 2138,
			"arabicnumber": 2138,
			"text": "Âişe (r.anha) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem.a.v.)'in üzerine hiçbir gün geçmezdi ki, o günün iki tarafının, yani sabah ve akşam vakitlerinin birinde Peygamber muhakkak Ebû Bekr'in evine gelirdi. Nihayet Peygamber'e Medine'ye gitmek üzere yola çıkmak hususunda Allah tarafından izin verilince, bize gelmesi hususunda mu'tâd olmayan öğle vaktinde ansızın geldi. Ebû Bekr'e O'nun gelişi haber verildi. Ebû Bekr: Meydana gelmiş mühim bir iş olmadıkça Peygamber bu saatte bize gelmezdi, dedi. Ebû Bekr'in yanına girince ona: \"Yanında kim varsa dışarı çıkar!\" buyurdu. Bekr: Bu ikisi benim iki kızımdır yâ Rasûlüllah, dedi. Bekr bu sözüyle ben Âişe'yi ve Esmâ'yı kasdediyordu. Peygamber: \"Şu mühim işi hissettin mi; Bana Medine'ye çıkmak hususunda izin verildi\" buyurdu. Bekr: Yâ Rasûlallah! Çıkışta senin sohbetinde ve maiyyetinde bulunmak isterim. Sohbetini isterim, dedi ve şöyle ilâve etti: Yâ Rasûlallah! Yanımda iki binek devesi vardır. Ben bunları Medine'ye hicret çıkışı için hazırladım. Binâenaleyh Sen bunların birini al! Dedi. aleyhi ve sellem):",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 2139,
			"arabicnumber": 2139,
			"text": "ibn Omer (radıyallahü anh) 'den: Rasûlulah (sallallahü aleyhi ve sellem.a.v.): \"Sizden biriniz (beşer) kardeşinin alışverişi aleyhine alışveriş etmez\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 2140,
			"arabicnumber": 2140,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 2141,
			"arabicnumber": 2141,
			"text": "Câbir ibn Abdillah (radıyallahü anh)'tan (şöyle demiştir):(Azre oğulları'ndan Ebû Mezkûr adında sahâbî) bir kimse, kendine âid olan bir köleyi müdebber olarak (yani ölümümden sonra sen hürsün diyerek) âzâd etmişti. Sonra Ebû Mezkûr(fakır düşüp, bu kölenin bedeline) muhtâc oldu.Peygamber(sallallahü aleyhi ve sellem.a.v.) de köleyi aldı da: \"Bunu benden kim satın almak ister?\" dedi (yani müzayedeye arzetti). neticesinde) Nuaym ibnu Abdillah o köleyi şöyle şöyle dirhemle satın aldı. Rasûlüllah da kölenin bu bedelini Ebû Mezkûr'a verdi",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 2142,
			"arabicnumber": 2142,
			"text": "İbn Omer (radıyallahü anh): Peygamber (sallallahü aleyhi ve sellem.a.v.) necş yapmaktan(yani satıcı ile müşteri arasına girip, kendisini alıcı gibi göstererek müşteriyi kandırıp fiatı yükseltmeye çalışmaktan) nehyetti, demiştir",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 2143,
			"arabicnumber": 2143,
			"text": "Abdullah ibn Omer (radıyallahü anh) 'den (şöyle demiştir):Rasûlüllah (sallallahü aleyhi ve sellem.a.v.) habelu'l-habele satışından(yânı gebe devenin dişi doğacak yavrusunun gebeliğini satmaktan) nehiy buyurdu. Bu, Câhiliyet halkının kendi aralarında yapageldikleri (böyle akıbeti mechûl) bir satış idi. Adam, meselâ bir deveyi (veya herhangi bir malı) gebe bir devenin doğurmasına, sonra bu doğan dişi yavru da(gebe olup) karnındaki cenini doğurmasına ta'lîkan mal alıp satardı",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 2144,
			"arabicnumber": 2144,
			"text": "Ebû Saîd Hudrî (radıyallahü anh): Rasûlüllah (sallallahü aleyhi ve sellem.a.v.) munâbeze’den (yani karşılıklı atışma suretiyle yapılan satıştan) nehyetti, diye haber verdi ve: Munâbeze, kişinin satacağı kumaşını, almak isteyenin o kumaşı alt üst etmesine ve ona bakmasına, düşünmesine fırsat vermeden önce alıcıya doğru atmasıdır (yani atması suretiyle yapılan bir satıştır) dedi. Ve yine Ebû Saîd: Peygamber, mülâmeseden (yani el dokundurmak suretiyle yapılan satıştan) de nehyetti. Mülâmese, alıcının kumaşa bakmayıp, sâdece elle dokunması suretiyle yapılan satıştır, dedi",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 2145,
			"arabicnumber": 2145,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 2146,
			"arabicnumber": 2146,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 2147,
			"arabicnumber": 2147,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 2148,
			"arabicnumber": 2148,
			"text": "Ebû Hureyre (radıyallahü anh) şöyle dedi: Peygamber(sallallahü aleyhi ve sellem.a.v.): \"Deve ve koyunları (sütlerini memeleri içinde yığmak suretiyle) bol sütlü göstermeye çalışmayınız. Her kim sütü memesinde habsedilmiş bir hayvanı, bu habsedişten sonra satın alırsa, onu sağması sırasında iki re'y arasında muhayyerdir: Dilerse o hayvanı kendi mülkiyetinde tutar, isterse onu bir sâ' hurma ile birlikte sahibine geri verir\" buyurdu. Ebû Salih'ten, Mucâhid'den, Velîd ibn Rebâh'tan, Mûsâ ibn Yesâr'dan; onlar da Ebû Hureyre'den olmak üzere zikrolunuyor ki, Peygamber (sallallahü aleyhi ve sellem.a.v.) \"Bir sâ' hurma ile birlikte\" demiştir. Sîrîn'den; o da Ebû Hureyre'den olmak üzere rivayet eden râvîlerin bâzısı da: \"Herhangi bir yiyecek maddesinden bir sâ' ile geri verir. Ve kendisi üç gün muhayyerdir\" buyurdu, demişlerdir. İbn Sîrîn'den; o da Ebû Hureyre'den merfû' olarak rivayet edenlerin bâzısı da: Üç günü zikretmeyerek sâdece \"Bir sâ' hurma\"y\\ zikretmiştir. Hurma rivayetleri daha çoktur",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 2149,
			"arabicnumber": 2149,
			"text": "Abdullah ibn Mes'ûd (radıyallahü anh): Kim sütü memesinde biriktirilmiş bir davar satın almış ise (isterse) o davarı geri versin ve onunla beraber (sût bedeli olarak) bir sâ' da birşey versin, demiştir. Ve yine yukarıki senedle gelen bir rivayette İbn Mes'ûd: Peygamber (sallallahü aleyhi ve sellem.a.v.) mal satıcılarının yolda karşılanmasını nehyetti, demiştir",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 2150,
			"arabicnumber": 2150,
			"text": "Ebû Hureyre (radıyallahü anh)'den:Rasûlüllah(sallallahü aleyhi ve sellem.a.v.) şöyle buyurmuştur: \"Mal getirmekte olan binicileri, pazar hâricinde karşılamayınız. Bâzınız, diğer bâzınızın alışverişi üzerine alışverişe kalkışmasın. Sizler müşteri kandırıp kızıştırmayınız. Hiçbir şehirli, bedevinin nâmına onun malını satmaz. Koyunları bol sütlü göstermeye çalışmayınız. Her kim sütü memesinde biriktirilmiş bir hayvan satın alırsa, o, bu hayvanı sağdıktan sonra iki görüş muhayyerliğindedir: Bu haliyle razı olursa, onu mülkiyetinde tutar; razı olmazsa, o hayvanı bir sâ' hurma ile birlikte geri verir",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 2151,
			"arabicnumber": 2151,
			"text": "Ebû Hureyre (radıyallahü anh) şöyle diyordu: Rasûlüllah (sallallahü aleyhi ve sellem.a.v.) şöyle buyurdu: \"Her kim sütü sağılmayıp göğsünde biriktirilmiş bir koyunu satın alır, akabinde onu sağarsa(yani hîleyi öğrenirse, bu müşteri muhayyerdir): Eğer ona bu haliyle razı olursa koyunu mülkiyetinde alıkoyar; eğer öfkelenir, razı olmazsa (koyunu geri verir).Ve koyunu sağması mukabilinde de bir sâ' hurma (vergisi) vardır",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 2152,
			"arabicnumber": 2152,
			"text": "Ebû Hureyre (radıyallahü anh) şöyle diyordu: Peygamber (sallallahü aleyhi ve sellem.a.v.) şöyle buyurdu: \"Bir câriye zina ettiği ve zinası da(beyyine, gebelik veya ikrar ile)tebeyyün ettiği zaman, efendisi onu kamçılasın, fakat onu (bu cezadan sonra)sözle ayıplamasın. Sonra yine zina ederse efendisi onu yine kamçı ile dövsün, fakat ayıbını yüzüne vurup sözle onurunu incitmesin. Sonra bu câriye üçüncü bir zina daha ederse, efendisi onu (ayıbını beyân ederek)kıldan yapılmış bir ip pahası ile de olsa, satsın",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 2154,
			"arabicnumber": 2154,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 2155,
			"arabicnumber": 2155,
			"text": "Urvetu'bnu'z-Zubeyr şöyle dedi: Âişe (r.anha) şöyle dedi: Rasûlüllah(sallallahü aleyhi ve sellem) yanıma girdi. Ben ona Berîre'yi satın alma kıssasını zikrettim. Rasûlüllah: \"Sen Berîre'yi onlardan satın al ve hürriyete kavuştur. Şüphesiz velâ (denilip mîrâs hakkı sabit olan hükmî hısımlık) köleyi hürriyete kavuşturana âiddir\" buyurdu. Bundan sonra Peygamber gündüzün sonuna doğru bir vakitte ayağa kalktı. Allah'a hamd ve lâyık olduğu sıfatlarla övdükten sonra, şöyle hitâb buyurdu: takım insanların hâli nedir ki, onlar Allah 'ın Kitabı 'nda bulunmayan bir takım şartlar ileri sürüyorlar. Kim Allah'ın Kitabı 'nda bulunmayan bir şartı şart koşarsa, o böyle yüz tane şart koşmuş olsa da öyle şart bâtıldır. Allah'ın şartı en haklı ve en güvenilendir",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 2156,
			"arabicnumber": 2156,
			"text": "Bize Hemmâm ibn Yahya tahdîs edip şöyle dedi: Ben Nâfi'den işittim; Abdullah ibn Omer'den tahdîs ediyordu (İbn Omer şöyle demiştir): Berîre'nin sâhibleriyle pazarlığa girişti. Bu esnada Peygamber namaza çıktı. Namazdan gelince Âişe: Onlar Berîre'yi ancak velâ hakkının kendilerinin olması şartıyle satıyorlar, dedi. Peygamber:\"Velâ, ancak hürriyete kavuşturanındır\" buyurdu. Hemmâm dedi ki: Ben Nâfi'e: Berîre'nin kocası hürr mü yahut köle mi idi? diye sordum. Nâfi': Bunu bana ne bildirir? Dedi",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 2157,
			"arabicnumber": 2157,
			"text": "Kays ibn Ebî Hazım şöyle demiştir: Ben Cerîr ibn Abdillah (radıyallahü anh)'tan işittim, şöyle diyordu: Ben Rasûlüllah'la; Allah’tan başka ilah olmadığına ve Muhammed (s.a.v.)’in Allah’ın Rasülü olduğuna şehadet etmek, namaz kılmak, zekât vermek,(Allah ve Peygamber emirlerini) işitip itaat eylemek ve her müslümâna nasihat etmek üzere bey'at ettim",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 2158,
			"arabicnumber": 2158,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 2159,
			"arabicnumber": 2159,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 2160,
			"arabicnumber": 2160,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 2161,
			"arabicnumber": 2161,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 2162,
			"arabicnumber": 2162,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 2163,
			"arabicnumber": 2163,
			"text": "Tâvûs ibn Keysân: Ben ibn Abbâs'a: Peygamber'in \"Hiçbir şehirli, bir köylü hesabına asla satış yapmasın\" sözünün ma'nâsı nedir? dedim. Hiçbir şehirli, köylü için bir simsar(yânı ücretli bir aracı) olmasın, demektir, dedi",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 2164,
			"arabicnumber": 2164,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 2165,
			"arabicnumber": 2165,
			"text": "Abdullah ibn Mes'ûd (radıyallahü anh): Her kim sütü memesinde biriktirilmiş bir hayvan satın almışsa (o haliyle beğenmediği takdirde), o hayvanın beraberinde bir sâ' da süt ücreti geri versin demiş ve: Peygamber (sallallahü aleyhi ve sellem.a.v.), satıcıları karşılamaktan da nehyetti hadîsini ilâve etmiştir",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 2166,
			"arabicnumber": 2166,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 2167,
			"arabicnumber": 2167,
			"text": "Abdullah ibn Omer (radıyallahü anh) 'den: Rasûlüllah(sallallahü aleyhi ve sellem.a.v.): \"Bir metâ'ı bâzınızın alım satım etmesi üzerine diğer bâzınız bunu alım satım edemez. Siz (binici kaafilelerinin pazara getirdiği) satılık eşyayı da, o mallar pazara getirilip indirilinceye kadar (yolda) karşılamayınız\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 2168,
			"arabicnumber": 2168,
			"text": "Ubeydullah ibn Omer şöyle demiştir: BanaNâfi', Abdullah ibn Omer'den tahdîs etti. O şöyle demiştir: Sahâbîler çarşının üst tarafında yiyecek maddesi satın alırlar ve bu malları satın aldıkları yerde satarlardı. Rasûlüllah(sallallahü aleyhi ve sellem.a.v.) onları, bu malları yükleyip pazara nakledinceye kadar aldıkları yerde satmaktan nehyetti",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 2169,
			"arabicnumber": 2169,
			"text": "Âişe (r.anha) şöyle demiştir: Berîre bana geldi ve: Ben sâhiblerimle dokuz ûkıyye(yani 360 dirhem), her senede bir ûkıyye(yani 40 dirhem ödemek) üzere hürriyetimi onlardan satın alma akdine giriştim. Bunun için bana yardım et! Dedi. de Berîre'ye: Eğer sâhiblerin bu bedeli onlar için hazır etmemi ve sen hürriyete kavuştuktan sonra hükmî hısımlığının bana âid olmasını isterlerse, bu bedeli ben bir defada öderim, dedi. üzerine Berîre sahiblerine gitti ve onlara benim teklîfimi söylemiş. Fakat onlar buna yanaşmamışlar. Berîre onların yanından dönüp geldiğinde Rasûlüllah Âişe'nin yanında oturuyordu. Berîre Senin sözlerini onlara arzettim, kabul etmediler. Bu akid için hükmî hısımlığın kendilerine âid olmasını şart kılıyorlar, dedi. Berîre'nin bu sözlerini işitti. Ben Âişe de mes'eleyi Peygamber'e haber verdim. Bu haber verme üzerine Peygamber(sallallahü aleyhi ve sellem.a.v.) \"Berîre'yi onlardan al, istedikleri hükmî hısımlığı da onlar lehine şart kıl. Hükmî hısımlık (hukûkan)ancak hürriyete kavuşturana âiddir\" buyurdu. Âişe de Berîre'yi bu suretle satın aldı (hürriyete kavuşturdu). Sonra Rasûlüllah insanlar içinde ayağa kalktı. Allah'a hamd ve sena etti. Sonra \"Amma ba'du “Sözün bundan sonrasına gelince şudur\" diyerek, şöyle hitabe yaptı: \"Bir takım adamlara ne oluyor ki, onlar Allah'ın Kitabı'nda bulunmayan şartlar ileri sürüyorlar, Allah'ın Kitâbı'nda bulunmayan herhangi bir şart, yüz kerre şart kılınmış olsa da muhakkak surette bâtıldır, Allah'ın hükmü uyulmaya en haklı, Allah'ın öğrettiği şart da en sağlam ve en güvenilecek şarttır. Hükmî hısımlık ancak hürriyete kavuşturan kimseye âiddir",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 2170,
			"arabicnumber": 2170,
			"text": "Mâlik ibn Evs, Omer ibnu'l-Hattâb(radıyallahü anh) dan işitti ki, Peygamber (sallallahü aleyhi ve sellem.a.v.) şöyle buyurmuştur: \"Buğdayı buğdayla satmak ribâdır, ancak (iki taraf birbirine) ha al, ha ver diye peşin olması hâli müstesnadır. Arpayı arpa ile satmak ribâdır, ancak ha al, ha ver diye peşin olması müstesnadır. Hurmayı hurmayla satmak ribâdır, ancak ha al, ha ver diye peşin olması hâli müstesnadır",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 2171,
			"arabicnumber": 2171,
			"text": "İbn Omer (radıyallahü anh) şöyle dedi: Rasûlüllah(sallallahü aleyhi ve sellem.a.v.) muzâbene satışından nehyetti: Eğer bahçesi hurmalık ise, bahçesinin yaş hurma mahsûlünü kuru hurma ile ölçekleyerek satmaktan nehyetti. Eğer bahçe üzümlük ise, oranın yaş üzümünü ölçekle takdir edip, o kadar kuru üzüm mukaabilinde satmaktan nehyetti. Yâhud ekilmiş tarla olursa, onun biçilmemiş ekinini de belli bir ölçek mikdârına mukaabil satmaktan nehyetti. İşte Rasûlüllah bu satışların hepsinden nehyetti",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 2173,
			"arabicnumber": 2173,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 2174,
			"arabicnumber": 2174,
			"text": "Mâlik ibn Evs haber verip, yüz dinarını dirhemlerle değiştirmek istediğini söylemiş ve şöyle devam etmiştir: Talha ibn Ubeydillah beni çağırdı. Birbirimizle bu para değiştirme işini görüşüp kararlaştırdık. Hattâ benden altınları istedi. O benden altınları aldı da elinin içinde onları alt üst çevirmeye başladı. Sonra: Dirhemler(gümüş paralar) yanımda değildir, hazinecim olan zât Gâbe ormanından gelince sana veririm, dedi. bu konuşmayı işitti de hemen bana şunları söyledi: Vallahi sen gümüşleri Talha'dan alıncaya kadar ondan ayrılmayacaksın. (Çünkü) Rasûlüllah (sallallahü aleyhi ve sellem.a.v.) şöyle buyurdu: \"Altını altın ile değiştirmek ribâdır, ancak ha al, ha ver diye peşin alıp vermek müstesnadır. Buğdayı buğdayla değiştirmek de ribâdır, ancak ha al, ha ver diye peşin olmak müstesnadır. Arpayı arpa ile satıp değiştirmek de ribâdır, ancak ha al, ha ver diye peşin olmak müstesnadır",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 2175,
			"arabicnumber": 2175,
			"text": "Ebû Bekre (radıyallahü anh) şöyle dedi: Rasûlüllah (sallallahü aleyhi ve sellem.a.v.) şöyle buyurdu: altınla satmayınız, ancak ikisi müsavi mikdârda olarak satınız. Gümüşü de gümüşle satmayın, ancak ikisi müsavi olarak satın. Altını gümüş ile gümüşü de altın ile (fazlalıklı veya müsâvî) nasıl isterseniz(peşin olarak) öyle satınız",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 2176,
			"arabicnumber": 2176,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 2177,
			"arabicnumber": 2177,
			"text": "Ebû Saîd el-Hudrî (radıyallahü anh) şöyle demiştir: Rasülullah (sallallahü aleyhi ve sellem.a.v.) şöyle buyurdu: \"Altım altınla satmayınız, ancak bunlardan bâzısını bâzısı üzerine artırmayarak misli misline (yani müsâvî surette) satınız. Gümüşü de gümüşle satmayınız, ancak bunlardan bâzısını bâzısı üzerine artırmaksızın misli misline (müsâvî surette) satınız. Bunlardan gâib (yani müddetlendirilmiş)olanı da hâzır ve peşin olanla satmayınız”",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 2179,
			"arabicnumber": 2179,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 2181,
			"arabicnumber": 2181,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 2182,
			"arabicnumber": 2182,
			"text": "Ebû Bekre (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem.a.v.) gümüşü gümüş ile ve altını altın ile satmaktan nehyetti, ancak değiştirilecek olan bu aynı cins mikdârların birbirine müsâvî olması hâli müstesnadır. Peygamber bizlere altını gümüş ile nasıl istersek; gümüşü de altın ile nasıl istersek (yani müsâvî veya fazlalıklı olarak) satın almamızı emir buyurdu",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 2184,
			"arabicnumber": 2184,
			"text": "İmâm Mâlik, Nâfî'den; o da Abdullah ibn Omer(radıyallahü anh) 'den, Rasûlüllah (sallallahü aleyhi ve sellem.a.v.)'ın muzâbene satışından nehy buyurduğunu ve (İbn Omer'in:) Muzâbene, yaş hurmayı ölçekle (tahmîn ederek) kuru hurma ile satın almak, yaş üzümü de kuru üzümle (yine böyle tahminî) ölçekle satmaktır, dediğini haber vermiştir",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 2185,
			"arabicnumber": 2185,
			"text": "Ebû Saîd el-Hudrî (radıyallahü anh)'den (şöyle demiştir):Rasûlüllah (sallallahü aleyhi ve sellem.a.v.) muzâbene’den de, mühâkale’den de nehyetti. Muzâbene, ağaçların başlarındaki yaş meyveyi (tahmîn ederek) kuru hurma ile satın almaktır",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 2186,
			"arabicnumber": 2186,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 2187,
			"arabicnumber": 2187,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 2188,
			"arabicnumber": 2188,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 2189,
			"arabicnumber": 2189,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 2190,
			"arabicnumber": 2190,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 2191,
			"arabicnumber": 2191,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 2192,
			"arabicnumber": 2192,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 2193,
			"arabicnumber": 2193,
			"text": "Ve îmâm Leys ibn Sa'd, Ebu'z-Zinâd Zekvân'dan söyledi ki, Urve ibnu'z-Zubeyr, Harise oğulları'ndan olan Sehl ibnu Ebî Haşmete el-Ensârî'den tahdîs eder idi. O da Zeyd ibn Sâbit'ten tahdîs etmiştir. Zeyd ibn Sabit (radıyallahü anh) şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem.a.v.) zamanında bâzı insanlar henüz olgunlaşmamış yaş hurmaları (ağaç üstünde tahmin ederek) alırlar, satarlardı. Bu insanlar mahsûlü kesip de hakları ödeşmeleri zamânı gelince, müşteri: Mahsûle duman dokundu;. Her hangi bir hastalık isabet etti; korukları bozup dökülmelerine sebeb olan bir hastalık geldi; meyvelere bir takım âfât ve ayıplar arız oldu diyerek, bu hastalıklar sebebiyle da'vâya ve husûmete girişirlerdi. Rasûlüllah'ın huzurunda bu konudaki da'vâ ve husûmetler çoğalınca, Rasûlüllah (sallallahü aleyhi ve sellem.a.v.): \"Mademki siz erişilmemiş mahsûlün alışverişini bırakmayarak davâlaşmaya düşüyorsunuz. Bir daha hurma meyvesini ağaç üstünde salâhı meydana çıkıncaya kadar alıp satmayınız\" buyurdu. ibn Sabit devamla: Rasûlüllah'ın bu nehyi, meşveret mâhiyetinde idi. Bununla halk arasında bu nevi' alın satım yüzünden meydana gelen husûmetin çokluğuna işaret ediyordu, demiştir. râvîlerinden Ebu'z-Zinâd: Zeyd ibn Sâbit'in oğlu Hârice (ki Yedi Fakîh'ten biridir), bana: Bâbam Zeyd ibn Sabit, Süreyya yıldızı doğuncaya ve böylece mahsûlün sarısı kırmızısından seçilinceye kadar kendi arazîsinin meyvelerini satmazdı, diye haber verdi, demiştir. Abdillah el-Buhârî dedi ki: Bu hadîsi Alî ibnu Bahr (234) rivayet edip, sened şöyle dedi: Bize Hakkâm tahdîs edip şöyle dedi: Bize Anbese, Zekeriyyâ'dan; o da Ebu'z-Zinâd'dan; o da Urve'den; o da Sehî ibn Ebî Haşmete el-Ensârî'den; o da Zeyd ibn Sâbit'ten",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 2194,
			"arabicnumber": 2194,
			"text": "Bize İmâm Mâlik, Nâfi'den; o da Abdullah ibn Omer (radıyallahü anh) ’den haber verdi ki, Rasûlüllah (sallallahü aleyhi ve sellem.a.v.) yaş meyveleri salâhları meydana çıkıncaya kadar satmaktan nehyetmiş, bundan satıcıyı da, satın alıcıyı da nehyeylemiştir",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 2195,
			"arabicnumber": 2195,
			"text": "Enes (radıyallahü anh)'ten(şöyle demiştir): Rasûlüllah (sallallahü aleyhi ve sellem.a.v.), meyvesi alacalanıncaya(kızarıncaya) kadar hurma ağacının meyvelerinin satılmasını nehyetti. Abdillah el-Buhârî: Hadîsteki \"Hattâ tezhuve\" lâfzıyle \"Alacalanıncaya (kızarıncaya) kadar\" demek istiyor, dedi",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 2196,
			"arabicnumber": 2196,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 2197,
			"arabicnumber": 2197,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 2198,
			"arabicnumber": 2198,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 2199,
			"arabicnumber": 2199,
			"text": "Bize İmâm Mâlik, Nâfi'den; o da İbn Omer'den; o da Zeyd ibn Sâbit (radıyallahü anh)'den, Rasûlüllah (sallallahü aleyhi ve sellem.a.v.)'ın, ariyye sahibine ariyyesini(yani ayırdığı ağaçlar üzerindeki yaş hurmayı) ne kadar kuru hurma getireceğini tahmîn ve takdir etmek suretiyle satmasına ruhsat verdiğini, tahdîs etmiştir",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 2200,
			"arabicnumber": 2200,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 2202,
			"arabicnumber": 2202,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 2203,
			"arabicnumber": 2203,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 2204,
			"arabicnumber": 2204,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 2205,
			"arabicnumber": 2205,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 2206,
			"arabicnumber": 2206,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 2207,
			"arabicnumber": 2207,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 2208,
			"arabicnumber": 2208,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 2209,
			"arabicnumber": 2209,
			"text": "Abdullah ibn Omer (radıyallahü anh) şöyle demiştir: Ben Peygamber'in yanında bulunuyordum, kendisi hurma ağacı göbeği yemekte idi. \"Ağaç cinsinden bir ağaç nev'i vardır ki, o mü'min kimse gibidir?\" buyurdu. Ben, o hurma ağacıdır diye söylemek istedim. Bir de baktım ki, ben oradaki insanların en genciyim. (Büyüklere saygı olarak sükût edip söylemedim.) Rasûlüllah(sallallahü aleyhi ve sellem.a.v.): \"O, hurma ağacıdır\" buyurdu",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 2210,
			"arabicnumber": 2210,
			"text": "Enes ibn Mâlik (radıyallahü anh) şöyle demiştir: Ebû Taybete, Rasûlüllah'ı kan alma tedavisi yaptı da, Rasûlüllah, Ebû Taybete'ye bir sâ' (1040 dirhem) hurma verilmesini emretti. Bundan başka Ebû Taybete'nin efendisi(Hârise oğulları)ne de Ebû Taybete'nin(ödemeye mükellef olduğu) vergisinden hafifletmelerini emir buyurdu",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 2211,
			"arabicnumber": 2211,
			"text": "Âişe (r.anha) şöyle demiştir: Muâviye'nin anası Hind, Rasûlüllah'a: Kocam Ebû Sufyân cimri, hırslı bir adamdır. Onun malından gizlice almamda bana bir günâh var mıdır? Diye sordu. aleyhi ve sellem.a.v.): \"Örfe göre sen kendine ve oğullarına yetecek mikdâr al!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 2212,
			"arabicnumber": 2212,
			"text": "Urvetu'bnu'z-Zubeyr, Âişe (r.anha) şöyle derken işitmiştir: \"(Velîlerden) kim zengin ise (yetimin malından) kaçınsın. Kim de fakır ise, o hâlde örfe göre yesin... \"(en-Nisâ: 5) âyeti, yetimin işlerini yapan ve malını ıslâh eden yetîm velîsi hakkında indirildi. Yetîm velîsi fakir olursa yetîm malından ma'rûf ölçüde yer (faydalanır)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 2213,
			"arabicnumber": 2213,
			"text": "Câbir (radıyallahü anh): Rasûlüllah(sallallahü aleyhi ve sellem.a.v.) şuf'ayı taksîm olunmamış her malda kıldı. Sınırlar konulduğu ve yollar ta'yîn edilip geçirildiği zaman şuf'a yoktur",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 2214,
			"arabicnumber": 2214,
			"text": "Câbir (radıyallahü anh), Peygamber(sallallahü aleyhi ve sellem.a.v.) taksîm edilmemiş her malda şuf'a ile hükmetti. Sınırlar konulduğu ve yollar ta'yîn edildiği zaman şuf'a yoktur, demiştir",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 2215,
			"arabicnumber": 2215,
			"text": "Bize İbnu Cureyc haber verip şöyle dedi: Bana Mûsâ ibnu Ukbe, Nâfi'den; o da İbnOmer (radıyallahü anh) 'den haber verdi ki, Peygamber(sallallahü aleyhi ve sellem.a.v.) şöyle buyurmuştur: kişi sefere çıktılar. Yürürlerken yağmura tutuldular ve dağda bir mağaraya girdiler. Bunlar orada iken bir taş düşüp mağaranın kapısını üzerlerine kapadı. Bunlar birbirlerine: Hayâtınızda işlediğiniz en hayırlı işi söyleyerek Allah'a dua ediniz (belki Allah kapıyı açar), dediler. birisi: Yâ Allah! Bilirsin ki, benim yaşlı ihtiyar annemle bâbam vardı. Ben her gün koyunlarımla mer'aya çıkar, onları otlatır, sonra gelip sağardım. Sütü evvelâ ana bâbama getirirdim de onlar içerlerdi. Sonra sırasıyle çocuklara, akrabalara ve kadınıma içirirdim. Yalnız gecelerden bir gece bir mânia sebebiyle geç kalmıştım. Geldiğimde ana Bâbamı uyumuşlar buldum. Onları uyandırmak istemedim. Ayakucumda da çocuklar mütemadiyen ağlıyorlardı (Fakat ben onlardan evvel çocuklara içirmeyi doğru bulmuyordum). İşte o gece onlar uyuyarak, ben başlarında bekleyerek sabahladık. Yâ Allah, sen pekiyi bilirsin ki ben ana Bâbam üzerinde yalnız senin rızânı kazanmak için bu işi yaptım. Bunun için şu kapıyı bize bir parça aralar da oradan gökyüzünü görelim! Diye duâ etti. üzerine taş onlardan birazcık açıldı. Bunlardan bir diğeri şöyle dedi: Yâ Allah! Sen yakînen bilirsin ki, ben amucamın kızlarından birini, bir erkeğin kadınları sevmesinin en hararetlisiyle severdim. Ben ona sevgi açıkladıkça, o bana: Sen bu kıza yüz dînâr vermedikçe bu kızdan birşeye nail olamazsın, derdi. Ben bu parayı kazanmak için çalıştım, nihayet parayı biriktirip amucam kızına getirdim. Emele nail olmak için hiçbir mâni' kalmayıp, onun iki ayağı arasına oturduğumda kız bana: Allah'tan kork! Yaratıcı kudretin koyduğu mührü bozma; o bekâret mührü yalnız hakk yoluyla nikâhla açılır, dedi. Ben bu söz akabinde kalktım ve kızı bıraktım. Ey Rabb'im, sen pekiyi bilirsin ki, ben kızdan bu çekilmemi senin rızânı kazanmak için yaptım. Binâenaleyh bizden bu kayayı aç! Dedi. onlardan üçte iki mikdârında açıldı. kişi de şöyle dedi: Yâ Allah! Muhakkak sen bilmektesin ki, ben bir ölçek darı ile bir işçi tutmuştum. Ben ona iş sonunda ücretini verdim, fakat o bu ücretini almaktan çekindi (bırakıp gitti).Ben mevsiminde bu darıyı ektim. Nihayet mahsûlü ile bir sığır, bir de çoban satın aldım. Bir müddet sonra bu işçi geldi ve bana: Ey Allah'ın kulu, haydi benim hakkımı bana ver, dedi. Ben de ona: Şu sığırlara ve çobanına git; çünkü onların hepsi senindir (onları al), dedim. O zât: Benimle alay mı ediyorsun! Dedi. Ben: Hayır, seninle alay etmiyorum. Bunlar hakîkaten senindir, dedim. (Gitti, bunları alıp götürdü.) Yâ Allah! Sen şübhesiz biliyorsun ki, ben bu malı o işçiye senin rızânı kazanmak için verdim. Bizden bu kayayı aç! Diye duâ etti. mağaranın kapısı onlara açıldı (Bu üç kişi de mağaradan çıktılar)",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 2216,
			"arabicnumber": 2216,
			"text": "Ebû Bekr'in oğlu Abdurrahmân(radıyallahü anh) şöyle demiştir: bir seferde Peygamberin maiyyetinde idik... Sonra başının saçları çok uzamış, uzun boylu bir müşrik kişi, bir koyun sürüsü ile onları severek geldi. Peygamber(sallallahü aleyhi ve sellem.a.v.) o müşrike: \"Koyunları satıyor musun? Yoksa atıyye yahut hediye olarak mı getirdin?\" diye sordu. çoban: Hayır, atıyye yahut hediye değildir; fakat satılıktır, diye ceverdi. Peygamber o müşrikten bir koyun satın aldı",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 2217,
			"arabicnumber": 2217,
			"text": "Ebû Hureyre (radıyallahü anh) şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem.a.v.) şöyle buyurdu: Peygamber, Sâre ile sefere gitti de, onunla bir şehre girdi. Orada meliklerden bir melik yahut cebbarlardan bir cebbar hükümdar vardı. Bu zalim hükümdara: İbrâhîm kadınların en güzelinden olan bir kadınla bu şehre girdi, denildi. Yâ îbrâhîm, beraberindeki kadın kimdir? Diye haber gönderdi. (Dînde)kardeşimdir, diye cevâb verdi. Sonra İbrâhîm dönüp, Sâre'nin yanına geldi ve: Sakın benim sözümü yalan çıkarma. Ben onlara, senin benim kızkardeşim olduğunu haber verdim. Allah'a yemîn ederim ki, yeryüzünde (bizim inandığımız esâslara) benden ve senden başka îmân eden hiçbir kişi yoktur, dedi. akabinde İbrahim, Sâre'yi hükümdara gönderdi. Sâre varınca, melik Sâre'ye doğru kalktı. Sâre de hemen abdest aldı ve namaza durdu. (Namazı müteâkib:) Allahım, ben Sana ve Senin Rasûlü'ne îmân ettimse ve ben fercîmi zevcimden başkasına karşı ebedî muhafaza eyledimse, şu kâfiri benim üzerime musallat etme! Diye duâ etti. nefesi derhal boğuldu; horlamağa, hattâ ayağı ile yere vurup deprenmeğe başladı.\" râvîsi el-A'rac şöyle dedi: Ebû Seleme ibnu Abdirrahmân, Ebû Hureyre'nin şöyle dediğini söyledi: Allahım, eğer bu herîf ölürse, bunu bu kadın öldürdü denilir, dedi. üzerine o zâlim, sarasından salıverildi. Sonra hükümdar, Sâre'ye (ikinci defa taarruza) kalkıştı. O da derhâl kalkıp abdest alarak namaza durdu. Ve: Allahım, ben Sana ve Senin Rasûlü'ne îmân ettimse ve nâmûsumu zevcim müstesna olmak üzere herkese karşı iyice korudumsa, şu kâfiri benim üzerime musallat etme! Diye duâ ediyordu. Adamın derhâl nefesi tıkandı, horlamaya, hattâ ayağı ile yere vurup deprenmeye başladı.\" şöyle dedi: Ebû Seleme şöyle dedi: Ebû Hureyre şöyle dedi: Allahım, eğer bu adam Ölürse, bunu bu kadın öldürdü denilir, dedi. üzerine adam sarasından ikinci defa, yahut üçüncü defada da salıverildi. Bunun üzerine o melik kendi adamlarına: Vallahi siz bana (insan değil), muhakkak bir şeytân göndermişsiniz. Siz bu kadını İbrâhîm 'e geri gönderiniz. Hâcer'i de Sâre'ye hediye veriniz! Dedi. Müteakiben Sâre, îbrâhîm Peygamberi dönüp geldi. Ve ona (vak'ayı anlatıp): Anladın mı, Allah kâfiri zelîl etti ve bir cariyeyi de bana hizmetçi verdi, dedi",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 2218,
			"arabicnumber": 2218,
			"text": "Âişe (r.anha) şöyle demiştir: Sa'd ibnu Ebî Vakkas ile Abd ibnu Zem'a bir oğlan çocuğu hakkında da'vâlaştılar. Sa'd: Yâ Rasûlallah! Bu çocuk erkek kardeşim Utbe'nin oğludur. O, bu çocuğun kendi oğlu olduğunu bana ahid verdi. Çocuğun Utbe'ye benzeyişine bak, dedi. ibnu Zem'a da: Yâ Rasûlallah, bu çocuk benim kardeşimdir. Bâbamın döşeği üzerinde, Bâbamın cariyesinden doğmuştur, dedi. aleyhi ve sellem.a.v.) çocuğun sîmâsındaki benzeyişe baktı ve çocuğun Utbe'ye açık bir surette benzeyişini gördü. Akabinde: Abd, bu çocuk senin(kardeşin)dir. Çocuk döşeğindir; zina ediciye de mahrumiyet vardır. Yâ Sevde binte Zem 'a, sen de (nedb ve ihtiyat olarak) bundan sonra bu çocuktan (yânı Abdurrahmân'dan) perdelen\" buyurdu. Şevde, bu Abdurrahmân'a hiç bakmadı",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 2219,
			"arabicnumber": 2219,
			"text": "Abdurrahmân ibn Avf (radıyallahü anh) Suheyb er-Rûmî'ye hitaben: Allah'tan kork, kendi Bâbandan başkasına neseb iddia etme! Dedi. de ona: Benim şöyle şöyle şeylerim olması ve benim Bâbamdan başkasına neseb iddia etmekliğim beni sevindirmez. Lâkin ben(Bâbamı ve soyumu bilen) küçük bir çocuk iken(Romalılar tarafından) çalındım, dedi",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 2220,
			"arabicnumber": 2220,
			"text": "Hakîm ibn Hızâm (radıyallahü anh) haber verip şöyle demiştir: Yâ Rasûlallah! Bir takım işlere ne dersin? Ben Câhiliyet devrinde sadaka, köleyi hürriyete kavuşturmak, hısımlarla ilgilenmek nev'inden bir takım işlerle ibâdet etmeğe çalışırdım. O işlerde benim lehime bir ücret ve sevâb var mıdır? Diye sordum. aleyhi ve sellem.a.v.): \"Sen mazide kazanmış olduğun hayırlarınla -yahut: Hayırların üzerine yükselerek- müslümân oldun!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 2221,
			"arabicnumber": 2221,
			"text": "Abdullah İbn Abbâs radıyallahü anhüma şöyle haber vermiştir: Rasûlüllah (sallallahü aleyhi ve sellem.a.v.) ölmüş bir koyunun yanından geçti de: \"Bunun derisiyle faydalansaydınız ya!\" buyurdu. Sahâbîler: Bu koyun kendiliğinden ölmüştür, dediler. Rasûlüllah: \"Ölü hayvanın ancak etini yemek haram oldu\" buyurdu",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 2222,
			"arabicnumber": 2222,
			"text": "Ebû Hureyre (radıyallahü anh) şöyle diyordu: Rasûlüllah (sallallahü aleyhi ve sellem.a.v.) şöyle buyurdu: elinde olan Allah'a yemîn ederim ki, muhakkak Meryem'in oğlu Îsâ'nın sizin içinize âdil bir hakem olarak inmesi, Hrıstiyanlar'in o haçını kırması, domuzu öldürmesi, cizye vergisini indirmesi, malın hiçbir kişinin kabul etmiyeceği kadar çoğalıp taşması vâki' olacaktır",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 2223,
			"arabicnumber": 2223,
			"text": "İbn Abbâs radıyallahü anhüma şöyle diyordu: Omer ibn Hattâb'a fulan kimsenin şarâb sattığı haberi ulaştı. Bunun üzerine Omer (radıyallahü anh): Allah o fulan kimseyi öldürsün! O, Rasûlüllah(sallallahü aleyhi ve sellem.a.v.)'ın \"Allah Yahûdîler'in canlarını alsın; onlara iç yağları haram kılındı da onlar bu yağları erittiler ve sattılar\" buyurduğunu bilmedi mi? dedi",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 2224,
			"arabicnumber": 2224,
			"text": "Ebû Hureyre (radıyallahü anh)'den (şöyle demiştir):Rasûlüllah (sallallahü aleyhi ve sellem.a.v.) şöyle buyurdu: \"Allah Yahûdîler'e la'net etsin. Onlara iç yağlar haram kılındı da onlar bu yağları sattılar ve bedellerini yediler\". Abdillah el-Buhârî dedi ki: \"Kaatelehumullâhu\", \"Allah onlara la'net etsin\" demektir. Çünkü \"Katıle'l-harrâsûn\", \"Kahrolsun o koyu yalancılar\"(ez-zâriyât: ıo) ma'nâsınadır",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 2225,
			"arabicnumber": 2225,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 2226,
			"arabicnumber": 2226,
			"text": "Âişe (r. anha): el-Bakara Sûresi'nin son âyetleri -ki ribâ âyetlerinden sûrenin sonuna kadar devam eden 275-286. âyetler- indiği zaman, Peygamber (sallallahü aleyhi ve sellem.a.v.) mescide çıktı da: \"Şarâb hususunda ticâret yapmak haram kılındı\" buyurdu",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 2227,
			"arabicnumber": 2227,
			"text": "Ebû Hureyre (radıyallahü anh)’den (şöyle demiştir):Peygamber (sallallahü aleyhi ve sellem.a.v.) şöyle dedi: şöyle buyurdu; Üç sınıf insan vardır ki, kıyâmet gününde ben onların hasmıyımdır: Biri şu kimse ki, benim adıma yemin edip (ahd eder de)sonra ahdini bozar. İkincisi hürr bir insanı köle diye satar da onun parasını yer. Üçüncüsü şu kimse ki, bir işçiyi ücretle tutar, onu çalıştırıp işi tam yaptırır da, onun ücretini vermez",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 2228,
			"arabicnumber": 2228,
			"text": "Enes ibn Mâlik (radıyallahü anh)'Şöyle demiştir:Hayber esirleri içinde Safiyye bintu Huyey ibn Ahtab vardı. Dıhye el-Kelbî'nin mülkiyetine geçti. Sonra Peygamber'e geçti, demiştir",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 2229,
			"arabicnumber": 2229,
			"text": "ez-Zuhrî şöyle dedi: Bana Abdullah ibnu Muhayrîz haber verdi. Ona da Ebû Saîd el-Hudrî haber vermiştir: Ebû Saîd, Peygamber'in yanında otururken: Yâ Rasûlallah! Biz bir takım kadın esirlere nail oluyoruz(ve onlara cinsî yaklaşma yapıyoruz). Fakat biz bu esîr kadınları satıp paralara sâhib olmayı istiyoruz. Bunun için azletmek hususunda nasıl düşünüyorsun? Dedi. aleyhi ve sellem.a.v.): ''Sizler hakîkaten bunu yapıyor musunuz? Azli yapmamanız üzerinize vâcib değildir. Çünkü şu muhakkak ki, Allah'ın dünyâya çıkmasını yazmış olduğu herbir hayât sahibi insan, mutlak meydana çıkacaktır\" buyurdu",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 2230,
			"arabicnumber": 2230,
			"text": "Câbir ibn Abdillah (radıyallahü anh), Peygamber(sallallahü aleyhi ve sellem.a.v.) hürriyete kavuşturulması efendisinin ölümüne bağlanmış olan müdebber köleyi sattı, demiştir",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 2231,
			"arabicnumber": 2231,
			"text": "Amr ibnu Dînâr, Câbir ibn Abdillah'tan; Rasûlüllah (sallallahü aleyhi ve sellem.a.v.) hürriyeti efendisinin ölümüne bağlanmış olan müdebber köleyi sattı, derken işitmiştir",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 2233,
			"arabicnumber": 2233,
			"text": "Ebû Hureyre (radıyallahü anh) şöyle dedi: Ben Peygamber (sallallahü aleyhi ve sellem.a.v.)'den işittim, şöyle buyuruyordu: \"Sizden biriniz dişi kölesi zina ettiği, akabinde de zinası (beyyine, gebelik veya ikrar ile) meydana çıktığında, efendisi onu (hürrenin cezasının yarısı olan) hadd cezası olmak üzere, deynekle kamçılasın. Ve onu deyneklemeden sonra zinayı başına kakmasın. Sonra üçüncü defa zina eder ve zinası delille meydana çıkarsa, artık efendisi onu kıldan bir ip karşılığında bile olsa satsın",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 2234,
			"arabicnumber": 2234,
			"text": "Enes ibn Mâlik (radıyallahü anh) şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem.a.v.) Hayber'e geldi. Nihayet Allah O'na (Kamus denilen) kal'ayi açtığı zaman kendisine Huyey ibn Ahtâb'ın kızı Safiyye'nin güzelliği zikr olundu. Safiyye yeni evlenmiş bir gelin iken, Safiyye'nin kocası öldürülmüş idi. Rasûlüllah ganimetten payı olarak Safiyye'yi kendisi için seçip aldı ve Safiyye ile yola çıktı. Nihayet bizler Medine yakınında Seddu'r-Ravhâ denilen yere ulaştık. Safiyye işte orada hayzından temizlenip halâl oldu ve Peygamber, Safiyye ile evlendi. Sonra Peygamber tabaklanmış ve yere yayılan küçük bir deri üzerinde hurma, yağ ve keş karışığı\"hays\",denilen bir yemek yapıp hazırlattı. Sonra Rasülullah(nikâhı şöhretlendirmek için) ben Enes'e: \"Etrafındaki insanlara bildirip i'lân et\" buyurdu. İşte bu hurma, yağ ve yoğurt kurusu karışığı, Rasûlüllah'ın Safiyye üzerine yaptığı düğün aşı oldu. Sonra Medine'ye doğru yola çıktık. dedi ki: Ben Rasûlüllah'ı gördüm ki, bir abayı binek devesinin hörgücü üzerine, kendi arka tarafına Safiyye için doluyor, sonra devesinin yanına oturuyor, akabinde dizini koyuyor, bu sırada Safiyye de kendi ayağını Peygamber'in dizi üzerine koyarak deveye biniyordu",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 2235,
			"arabicnumber": 2235,
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 2236,
			"arabicnumber": 2236,
			"text": "Bize Leys ibn Sa'd, Yezîd ibn Ebî Habîb'den; o da Atâ ibn Ebî Rebâh'tan; o da Câbir ibn Abdillah (radıyallahü anh)'tan tahdîs etti. Câbir, Rasülullah(sallallahü aleyhi ve sellem.a.v.), Mekke’nin Fethi senesinde Mekke'de iken, şöyle buyururken işitmiştir: \"Şübhesiz Allah ve Rasûlü şarâbın, meytenin, domuzun, sanemlerin satışım haram kıldı\" buyurdu.Rasûlüllah'a: Yâ Rasûlallah! Murdar ölen hayvanın iç yağları hakkında ne dersiniz? Murdar ölen hayvanların iç yağları ile gemiler cilalanır, deriler yağlanır, onunla insanlar (mum yapıp) ışıklanır? Diye soruldu. \"Hayır, murdar yağı satmayınız. Bu satış haramdır\"buyurdu. Bundan sonra Rasülullah \"Bu satış haramdır\" sözünü söylediği zaman: \"Allah Yahudiler'e la'net etsin! Allah murdar ölen hayvanın iç yağlarını haram kıldığı zaman onlar bu yağı eritip güzelleştirdiler, sonra onu sattılar da parasını yediler\" buyurdu Âsim şöyle dedi: Bize Abdulhamîd tahdîs edip şöyle dedi: Bize Yezîd ibn Ebî Habîb tahdîs edip şöyle dedi: Bana Atâ ibn Ebî Rebâh, Câbir'in bu hadîsini yazıp Mekke'den gönderdiği mektubunda: Ben Câbir'den işittim; o da Peygamber'den, dedi",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 2237,
			"arabicnumber": 2237,
			"text": "Ebû Mes'ûd el-Ensârî (radıyallahü anh): Rasûlüllah(sallallahü aleyhi ve sellem) köpek parasından, zina kazancından ve kâhinlik ücretinden nehyetti, demiştir",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 2238,
			"arabicnumber": 2238,
			"text": "Ebû Cuhayfe'nin oğlu Avn haber verip şöyle demiştir: Ben Bâbam Ebû Cuhayfe'nin kan alma tedavisi yapan bir köle satın aldığını gördüm. (Ebû Cuhayfe emretti de bunun âletleri kırıldı.) Ben Bâbama bu kan alma âletlerinin kırılma sebebini sordum. Bâbam: Rasûlüllah(sallallahü aleyhi ve sellem.a.v.) kan alma bedelinden, köpek bedelinden, kadın kölenin (haram olan) kazancından nehyetti. Ve yine Rasûlüllah döğme yaptırana, ribâ yiyiciye, ribâ kazancı yedincisine la'net etti; suret yapan musavvir kişiye de la'net etti, dedi",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 184
			}
		}
	]
}