{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"37": "Hiring"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2260,
			"arabicnumber": 2260,
			"text": "Ebu Musa el-Eş'ari şöyle demiştir: Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Kendisine emredilenleri gönül hoşnutluğu içinde yerine getiren güvenilir hazinedar, tasadduk eden iki kişiden biridir",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2261,
			"arabicnumber": 2261,
			"text": "Ebu Musa el-Eş'ari şöyle demiştir: Yanımda Eş'ariIerden iki adamla birlikte Resulullah Sallallahu Aleyhi ve Sellem'in yanına vardım ve \"Bu iki kişi iş istiyorlar\" dedim. Bunun üzerine Efendimiz Sallallahu Aleyhi ve Sellem, \"Biz, işimizde, işe talib olanları istihdam etmeyiz\" buyurdu. Tekrar: 3038, 4341, 4343, 4344, 6124, 6923, 7149, 7156, 7157, 7172",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2262,
			"arabicnumber": 2262,
			"text": "Ebu Hureyre r.a.'in naklettiğine göre Resul-i Ekrem (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: \"Allah'ın göndermiş olduğu bütün Nebiler koyun gütmüştür.\" Sahabller, \"Siz de mi?\" diye sorunca, Nebi Sallallahu Aleyhi ve Sellem, \"Evet, ben, bir miktar kirat karşılığında Mekkelilerin (koyunlarını) güderdim\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2263,
			"arabicnumber": 2263,
			"text": "Aişe r.anha şöyle anlatır: Nebi Sallallahu Aleyhi ve Sellem ve Ebu Bekir r.a., Ben-i Dil kabilesinden, sonra da Beni Abd İbn Adıy'den yol rehberliği konusunda uzman bir kimseyi ücretle tuttular. Bu kişi, el-As İbn Vail kabilesi içinde, elini kan içine sokarak kablle yemini etmiş olup Kureyşlilerin dinine mensup kafir bir kişi idi. Resulullah Sallallahu Aleyhi ve Sellem ve Ebu Bekir ona güvendiler ve bineklerini ona verdiler. Üç gün sonra Sevr mağarasında buluşmak üzere vaadleştiler. Üçüncü gecenin sonunda sabahleyin bineklerini onlara getirdi. Hz. Nebi ve Ebu Bekir, Amir İbn Fuheyre ve rehberle birlikte yola koyuldular. Rehber onları Mekke altlarına kadar, es-Sahil denilen yere getirdi",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2264,
			"arabicnumber": 2264,
			"text": "Aişe r.anha şöyle demiştir: Nebi Sallallahu Aleyhi ve Sellem ve Ebu Bekir r.a., Ben-i Dili kabilesinden yol rehberliği konusunda uzman bir kimseyi ücretle tuttular. Bu kişi, Kureyş dini üzere kafir biri idi. Resulullah Sallallahu Aleyhi ve Sellem ve Ebu Bekir bineklerini ona verdiler. Üç gece sonra Sevr mağarasında buluşmak üzere vaadleştiler. Üçüncü gecenin sonunda sabahleyin . bineklerini onlara getirdi. باب: الأجير في الغزو. 5. SAVAŞTA ÜCRETLİ BİR KİMSE İSTİHDAM ETMEK",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2266,
			"arabicnumber": 2266,
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2267,
			"arabicnumber": 2267,
			"text": "Ubeyy İbn Ka'b, Resulullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmiştir: \"Yine gittiler. Nihayet bir köy halkına varınca onlardan yemek istediler. Ancak onlar kendilerini misafir etmekten kaçındılar. Derken orada yıkılmak üzere olan bir duvar buldular, tutup onu doğrulttu. Musa, \"İsteseydin bunun karşılığında mutlaka bir ücret alırdın\" dedi. \"[Kehf, 77] Said şöyle dedi: \"Elleri ile şöyle kaldırdı ve duvar düzeldi\" demiştir. Ya'la, \"Said'in, \"Eliyle duvarı meshetti, duvar hemen doğruldu\" dediğini zannediyorum\" demiştir. \"İsteseydin bunun karşılığında mutlaka bir ücret alırdın.\"[Kehf, 77] Said bu ayetin, \"yiyeceğimizi sağlamak için bir ücret\" anlamında olduğunu söylemiştir",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2268,
			"arabicnumber": 2268,
			"text": "İbn Ömer r.a.'in naklettiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Siz ile Ehl-i Kitap olan diğer iki kavim (Yahudi ve Hıristiyanlar), \"Bir çok işçi ile iş akdi yapan kimse\" örneğine benzemektedir: İş sahibi, \"Sabahtan gün ortasına kadar bir kirat karşılığında kim çalışır?\" dedi. Yahudiler bu kadar bir müddet çalıştı. İş sahibi, \"Kim gün ortasından ikindi namazına kadar bir kirat karşılığında çalışır?\" dedi. Hıristiyanlar bu kadar bir müddet çalıştı. Daha sonra, \"Kim ikindiden güneş batana kadar iki kirat karşılığında çalışır?\" dedi. Bu şartlarda çalışanlar ise sizlersiniz. Bu duruma Yahudi ve Hıristiyanlar kızarak, \"Neden biz daha çok çalışıp daha az ücret alıyoruz\" diye sordular. Allah onlara: \"Sizin hakkınızı eksik mi verdim?\" buyurdu. \"Hayır\" dediler. Bunun üzerine Allah (C.C.), \"Bu benim lütfumdur, dilediğime veririm\" buyurdu",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2269,
			"arabicnumber": 2269,
			"text": "İbn Ömer r.a.'in naklettiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Siz ile Ehli Kitap olan diğer iki kavim, \"Birçok işçi ile iş akdi yapan kimse\" örneğine benzemektesiniz: İş sahibi, \"Kim birer kirat karşılığında yarım gün çalışır?\" dedi. Yahudiler ve Hıristiyanlar birer kirat karşılığında çalıştı. Siz ise, ikindi'den güneş batana kadar iki kirat karşılığında çalışanlarsınız. Bu duruma Yahudi ve Hıristiyanlar kızarak, \"Neden biz daha çok çalışıp daha az ücret alıyoruz\" diye sordular. Allah onlara: \"Sizin hakkınıza zulmettim mi?\" buyurdu. \"Hayır\" dediler. Bunun üzerine Allah (C.C.), \"Bu benim lütfumdur, dilediğime veririm\" buyurdu. باب: إثم من منع أجر الأجير. 10. İŞÇİNİN ÜCRETİNİ VERMEYEN KİMSENİN KAZANACAĞI GÜNAH",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2270,
			"arabicnumber": 2270,
			"text": "Ebu Hureyre'nin rivayet ettiğine göre Nebiimiz Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Allah (C.C.) buyurdu ki: Şu üç kimsenin kıyamet günü davacısı ben olacağım: (Birincisi) Benim adıma yemin edip de aldatan (sözünü yerine getirmeyen); (ikincisi) hür bir kimseyi satıp parasını yiyen; (üçüncüsü) bir işçi tutup ondan istifade edip de ücretini vermeyen kimsedir",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2271,
			"arabicnumber": 2271,
			"text": "Ebu Musa el-Eş'ari r.a.'in rivayet ettiğine göre Resul-i Ekrem Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Müslümanların, Yahudilerin ve Hıristiyanların durumu, bir topluluk ile, sabahtan geceye kadar bir gün, belirli bir ücret karşılığında çalışması için iş akdi yapan kimse örneğine benzer. Bu kimseler, yarım gün çalıştıktan sonra şöyle derler: \"Bize vereceğini söylemiş olduğun ücrete ihtiyacımız yok, istemiyoruz. Çalıştıklarımız boşa gitsin.\" İş veren, onlara, \"Böyle yapmayın. Geri kalan işinizi de yapın ve ücretinizi tam olarak alın\" der. Onlar, buna yanaşmaz ve çekip giderler. Daha sonra iş veren başka bir grupla iş akdi yapar. İş veren onlara, \"Günün geri kalanı siz tamamlayın, size, onlara vereceğim ücreti vereceğim\" der. Onlar da, çalışmaya koyulurlar. İkindi namazı vakti gelince, \"Bizim senin için çalıştıklarımız boşa gitti (batıl oldu). Bize takdir ettiğin ücret de senin olsun\" derler. İş veren onlara, \"Geri kalan işinizi de tamamlayın. Günün sadece (geçen bölümüne göre) çok az bir kısmı kaldı\" der. Onlar bundan kaçınırlar. İş veren başka bir grupla, günün geri kalan kısmında çalışmaları için iş akdi yapar. Onlar da çalışır. Daha önceki iki grubun ücretini tam olarak alır giderler. İşte bu, Müslümanlar ile (hidayet) nurundan kabul gören şeylere bir örnektir",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2272,
			"arabicnumber": 2272,
			"text": "İbn Ömer r.a.'in naklettiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Sizden önceki kavimlerden üç kişi yolculuğa çıkmış gidiyorlarken barınmak için bir mağaraya sığındılar. O anda dağdan bir kaya yuvarlanıp düştü ve mağaranın ağzını tıkadı. İçlerinden biri, \"Bu kayadan, ancak yaptığınız en faziletli ameller ile Allah'a dua etmeniz halinde kurtulabilirsiniz\" dedi. Birincisi, 'Ey Allah'ım' Benim yaşlı annem - babam vardı. Onların akşam sütünü içirmeden önce ne aileme ne de mallarıma bakardım. Bir işle uğraşırken bir gece biraz geç kalmıştım. Süt'ü sağıp götürdüm fakat eve vardığımda annem - babam uyumuşlardı. Annem - babamdan önce ne aileme ne de mallarıma öncelik vermeyi hoş karşılamazdım. Süt bardağı elimde olduğu halde güneş doğana kadar onların uyanmasını bekledim. En sonunda uyandılar ve sütlerini içtiler. \"Allah'ım' Eğer bunu senin rızan için yaptıysam, içinde bulunduğumuz haldeki kayadan bize bir çıkış yolu ver\" diye dua etti. Kapı biraz açıldı. Fakat çıkamadılar. İkincisi, \"Allah'ım! Benim, herkesten çok sevdiğim bir amca kızım vardı. Onu arzuladım fakat o benden kaçındı. Aradan yıllar geçmişti. Bir gün bana geldi, ben de ona, kendisini bana teslim etmesi şartıyla 120 dinar verdim. O da bu şartımı yerine getirdi. Tam üzerine çıktığım sırada bana, \"Hak yol oları (nikah bağı) bulunmadan kızlığımı bozarsan sana hakkımı helal etmem\" dedi. Ben de bırakıp gittim. Oysa insanlar içinde en sevdiğim kişi o kızdı. Verdiğim altınları da ona bağışladım. \"Allah'ım! Eğer bunu senin rızan için yaptıysam, içinde bulunduğumuz haldeki kayadan bize bir çıkış yolu ver\" diye dua etti. Kapı biraz daha açıldı. Fakat çıkamadılar. Üçüncüsü, \"AI/ah'ım' Ben bir grup işçi tutup ücretlerini vermiştim. Fakat bir işçi, ücretini almadan çekip gitti. Ben de onun ücretini kendi malımdan ayrı tutup çalıştırdım, bu ücretten elde edilen karlar çok mala dönüştü, adamın çok malı oldu. Bir süre sonra çıktı geldi ve bana \"Ey Allah'ın kulu! bana ücretimi ver dedi. Ben de şu gördüğün develer, sığırlar, koyunlar ve köleler hepsi senindir, deyince adam bana: \"Benimle alay etme\" dedi. Ben de, \"Hayır, alay etmiyorum\" dedim. Bunun üzerine adam malların hepsini alıp hiçbir şey bırakmadan sürüp gitti. \"Allah'ım! Eğer bunu senin rızan için yaptıysam, içinde bulunduğumuz haldeki kayadan bize bir çıkış yolu ver\" diye dua etti. Bunun üzerine kaya parçalandı ve yürüyerek çıkıp gittiler.\" باب: من آجر نفسه ليحمل على ظهره، ثم تصدق به، وأجرة الحمال. 13. SIRTINDA ODUN TAŞIMAK iÇiN ÇALIŞAN SONRA BUNU SADAKA OLARAK VEREN KiMSE VE HAMMALIN KAZANACAĞI SEVAP",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2273,
			"arabicnumber": 2273,
			"text": "Şakik'ın naklettiğine göre Ebu Mes'ud el-Ensari şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem bize, sadaka vermemizi emrettiği zaman bizden biri pazara gider ve hammallık yapar ve karşılığında bir müdd (buğday) kazanırdı. Böyle yapanlardan bazılarının bugün yüz binlerle ifade edilebilecek servetleri vardır. Ebu Vail (Şakık), \"Bu son sözü, Ebu Mes'ud'un kendisi için kullandığını düşünüyorum\" demiştir",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2274,
			"arabicnumber": 2274,
			"text": "İbn Abbas r.a. şöyle demiştir: \"Resulullah Sallallahu Aleyhi ve Sellem, satıcıların, henüz pazara gelmeden karşılanıp mallarının alınmasını yasakladı. Şehirli, köylü adına onun malını satamaz.\" Ravi Tavus dedi ki: \"Şehirli, köylü adına onun malını satamaz\" ne demektir? İbn Abbas r.a. \"Onun için komisyoncu (simsar) olamaz\" diye cevap verdi",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2275,
			"arabicnumber": 2275,
			"text": "Habbab r.a. şöyle anlatır: Ben demirci idim. As İbn Vail'e bir iş yapmıştım. Alacaklarım onda epey birikti. Tahsil etmek için ona gittim. Bana, \"Hayır, vallahi, Muhammed'i inkar etmedikçe sana ödeme yapmam\" dedi. Ben de, \"Sen ölüp sonra tekrar diriltilinceye kadar onu inkar etmem\" dedim. O, \"Ben öldükten sonra diriltilecek miyim?\" dedi. Ben de, \"evet\" dedim. O, \"Benim orada birçok mal ve çocuğum olacak. Orada öderim\" dedi. Bunun üzerine Yüce Allah (C.C.), \"Resulüm! Ayetlerimizi inkar eden ve \"Muhakkak surette bana mal ve evlat verilecek\" diyen adamı gördün mü?\" [Meryem, 77] ayetini indirdi",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2276,
			"arabicnumber": 2276,
			"text": "Ebu Said r.a. şöyle anlatır: Resulullah'ın sahabılerinden bir grup bir sefere katılmışlar ve bir kabilenin yakınında konaklamışlardı. Onlardan, kendilerini misafir etmelerini istediler. Fakat bu arap kabilesi buna yanaşmadı. Bu arada kabilenin reisini bir akrep soktu. Onun için çareler araştırmaya başladılar. Derken (hiçbir çare kalmayınca) sahabılere gelip, \"Ey ahali! Reisimizi akrep soktu. Her şeyi denedik ama hiçbir fayda vermedi. Sizin bu konuda yapacak bir şeyiniz var mı?\" diye sordu. Bir sahabi, \"Evet, vallahi ben rukye yapabilirim (okuyarak tedavi edebilirim). Fakat bizi misafir etmenizi istedik, siz kabul etmediniz. Bundan dolayı ancak belirli bir ücret karşılığında bunu yapabilirim\" dedi. Daha sonra bir sürü koyun karşılığında tedavi yapmak üzere anlaştılar. Reisin yanına gittiler. Önce akrebin soktuğu yerin üzerine hafifçe tükürdü, sonra fatiha suresini sonuna kadar okudu. Reis, birden üzerindeki büyük bir yükten kurtulmuş gibi hafifledi ve yürümeye başladı. Onda hastalıktan bir eser kalmayınca: \"Üzerinde anlaşmış olduğunuz ücreti bu adama verin\" dedi. Daha sonra sahabilerden bazıları, \"koyunları paylaştırın\" dedi. Tedaviyi yapan kimse, \"Hayır, Nebi Sallallahu Aleyhi ve Sellem'e varalım, durumu anlatalım, bakalım ne emreder, o zamana kadar paylaştırmayın\" dedi. Olayı Resulullah Sallallahu Aleyhi ve Sellem'e anlatınca, Efendimiz Sallallahu Aleyhi ve Sellem: \"Fatiha'nın tedavi için kullanıldığını sen nereden bildin? İsabet etmişsiniz. Koyunları aranızda paylaşın. Bana da bir pay ayırın\" buyurdu ve gülümsedi. Tekrar: 5007, 5736, 5749",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2277,
			"arabicnumber": 2277,
			"text": "Enes İbn Malik şöyle demiştir: Ebu Taybe Resulullah Sallallahu Aleyhi ve Sellem'e hacamat yaptı. Nebi Sallallahu Aleyhi ve Sellem o'na bir sa' veya iki sa' yiyecek (buğday) verilmesini emretti. Ayrıca efendileri ile, onun ödemesi gereken vergiyi hafifletmesi için konuştu",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2278,
			"arabicnumber": 2278,
			"text": "İbn Abbas r.a. şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem hacamat yaptırdı ve ücretini verdi",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2279,
			"arabicnumber": 2279,
			"text": "İbn Abbas r.a. şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem hacamat yaptırdı ve hacamat yapan kimseye ücretini verdi. Eğer bunu hoş karşılamamış (kerahet) olsaydı vermezdi",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2280,
			"arabicnumber": 2280,
			"text": "Amr İbn Amir şöyle demiştir: Enes'i şöyle söylerken işittim: Resulullah Sallallahu Aleyhi ve Sellem tedavi amacıyla kan aldırırdı. 0, Hiç bir kimseye ücretini vermemek suretiyle haksızlık etmemiştir",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2281,
			"arabicnumber": 2281,
			"text": "Enes r.a. şöyle anlatır: Resulullah Sallallahu Aleyhi ve Sellem hacamatçı bir köle çağırdı ve hacamat yaptırdl. Ona, bir sa' veya iki sa' ya da bir müdd veya iki müdd ödenmesini emretti. Efendisi ile onun hakkında konuştu. Ödeyeceği vergi biraz hafifletildi",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2282,
			"arabicnumber": 2282,
			"text": "Ebu Mes'ud r.a. şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem köpek bedelini, zina parasını ve kahine verilen ücreti yasakladı",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2283,
			"arabicnumber": 2283,
			"text": "Ebu Hureyre r.a. şöyle demiştir: Nebi Sallallahu Aleyhi ve Sellem cariyelerin kazancını yasaklamıştır. Tekrar: 5348",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2284,
			"arabicnumber": 2284,
			"text": "Nafi' r.a.'in naklettiğine göre İbn Ömer r.a.şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem, hayvanı çektirme karşılığında ücret almayı yasaklamıştır",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2286,
			"arabicnumber": 2286,
			"text": "",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 25
			}
		}
	]
}