{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"38": "Transferance of a Debt from One Person to Another (Al-Hawaala)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2287,
			"arabicnumber": 2287,
			"text": "Ebu Hureyre r.a.'in naklettiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Ödeme gücü bulunan kimsenin borcunu geciktirmesi zulümdür. Sizden biri, ödeme gücü bulunan bir kimseye havale edilirse kabul etsin. \" Tekrar: 2288. 2400",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2288,
			"arabicnumber": 2288,
			"text": "Ebu Hureyre r.a.'in nakletliğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Ödeme gücü bulunan kimsenin borcunu geciktirmesi zulümdür. Sizden biri, ödeme gücü bulunan bir kimseye havale edilirse kabul etsin",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2289,
			"arabicnumber": 2289,
			"text": "Seleme İbnü'l-Ekva' r.a. şöyle anlatır: Resulullah Sallallahu Aleyhi ve Sellem'in yanında oturuyorduk. Bu sırada bir cenaze getirildi. Hz. Nebi'e, \"Bu kişinin namazını kıldır\" dediler. Resulullah Sallallahu Aleyhi ve Sellem, \"Borcu var mı?\" diye sordu. \"Hayır\" dediler. \"Geride bir mal bıraktı mı?\" diye sordu. \"Hayır\" dediler. Bunun üzerine namazını kıldırdı. Daha sonra bir cenaze daha getirdiler ve \"Ey Allah'ın Resulül Bu kişinin namazını kıldır\" dediler. Resulullah Sallallahu Aleyhi ve Sellem, \"Borcu var mı?\" diye sordu. \"Evet\" dediler. \"Geride bir mal bıraktı mı?\" diye sordu. \"Üç dinar bıraktı\" dediler. Bunun üzerine onun namazını kıldırdı. Bir süre sonra üçüncü bir cenaze getirdiler. Hz. Nebi'e, \"Bu kişinin namazını kıldır\" dediler. \"Geride bir mal bıraktı mı?\" diye sordu. \"Hayır\" dediler. \"Borcu var mı?\" diye sordu. \"Üç dinar borcu var\" dediler. Bunun üzerine, \"Arkadaşınızın namazını kılın\" buyurdu. Ebu Katade, \"Ey Allah'ın Resulü' Namazını siz kıldırın, borcunu ben üstleniyorum\" dedi. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem onun namazını kıldırdı. Tekrar: 2295",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 3
			}
		}
	]
}