{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"4": "Ablutions (Wudu')"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 135,
			"arabicnumber": 135,
			"text": "Bize Ma'mer, Hemmâm ibn Münebbih'ten haber verdi ki, o Ebû Hureyre (radıyallahü anh)'den şöyle derken işitmiştir: Rasûlüllah (sallallahü aleyhi ve sellem):\"Kendisinde hades meydana gelen kimsenin namazı, o kimse abdest almadıkça kabul olunmaz\" buyurdu. Hadramevt ahâlîsinden bir kimse: \"Yâ Ebâ Hureyre, hades nedir?\" diye sordu. Ebû Hureyre: \"Sessiz veya sesli yel\" cevâbını verdi",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 136,
			"arabicnumber": 136,
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 137,
			"arabicnumber": 137,
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 138,
			"arabicnumber": 138,
			"text": "Bize Sufyan(ibn Uyeyne), Amr ibn Dinar'dan tahdîs etti. şöyle dedi: Bana Kurayb(98), İbn Abbâs radıyallahü anhüma'tan haber verdi (ki şöyle demiştir): Peygamber(sallallahü aleyhi ve sellem) bir gece uyudu, hattâ horladı. Ondan sonra (abdest almaksızın) namaz kıldı. Bu sözü ibn Abbâs'ın: Uzanıp horladı, ondan sonra kalkıp namaz kıldı, tarzında söylediği rivayet olunuyor. ibn Abdillah el-Medînî şöyle dedi:) Sonra bu hadîsi Sufyan, bize birçok defalar kâh uzun, kâh kısa olarak Amr'dan, o da Kurayb'dan, o da İbn Abbâs'tan olmak üzere tahdîs etti. İbn Abbâs şöyle demiştir: Bir gece teyzem Meymûne'nin yanında kaldım. Gecenin bir kısmı olunca Peygamber (sallallahü aleyhi ve sellem) kalktı ve asılı duran küçük bir tulumdan hafif bir abdest aldı. -Amr bu abdestin pek hafif ve pek az su ile olduğunu söylüyordu- Ve kalkıp namaza durdu. Ben de onun aldığı gibi abdest aldıktan sonra gelip sol tarafında namaza durdum. -Sufyan belki yine solu ma'nâsına olan \"Şimâlihi\" demiştir.- Peygamber benim yerimi değiştirdi; beni sağ tarafına geçirdi. Sonra Allah'ın dilediği kadar namaz kıldı. Ondan sonra uzanıp uyudu; hattâ horladı. Sonra munâdî (yani müezzin) Ona gelip namaz vaktinin girdiğini haber verdi. Bunun akabinde müezzin kalkıp Peygamber'in maiyyetinde namaza çıktı. Peygamber(tekrar) abdest almadığı hâlde namazı kıldırdı.(Sufyan ibn Uyeyne şöyle dedi:) Biz Amr ibn Dînâr'a: İnsanlar, Rasûlüllah'ın uyur, amma kalbi uyumaz derler; (ne dersiniz)? diye sorduk. Amr: Ben Ubeyd ibn Umeyr'den işittim: Peygamberlerin ru'yâları vahiydir, diyordu. Ubeyd bu sözden sonra da\"Ben seni rüyâmda boğazlıyorum görüyorum...\" (Saffât: 37/102) âyetini okudu, dedi",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 139,
			"arabicnumber": 139,
			"text": "Kurayb'dan, o da Usâme ibn Zeyd (radıyallahü anh)'den tahdîs etti. Usâme'den işitti ki şöyle diyordu: Rasûlüllah(sallallahü aleyhi ve sellem) Arafat'tan geriye hareket etti. Dağ yoluna girince inip su dökdü. Ondan sonra abdest aldı, fakat abdesti hafif aldı. Ben: Namazı kılacak mısın yâ Rasûlallah? diye sordum. \"Namaz ileride (kılınacak)\" buyurdu. Yine bineğine bindi. Muzdelife'ye varınca indi ve abdest aldı. Bu sefer abdest almayı tam ve kâmil yaptı. Sonra namaz ikaamet edildi de akşam namazını kıldırdı. Ondan sonra herkes devesini kendi durağında çökertti. Sonra yatsı namazı ikaame edildi. Yine namazı kıldırdı ve iki namaz arasında hiçbir namaz kılmadı",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 140,
			"arabicnumber": 140,
			"text": "Bize Süleyman ibn Bilâl, Zeyd ibn Eslem'den; o da Ata ibn Yesâr'dan; o da İbn Abbâs'tan haber verdi, İbn Abbâs radıyallahü anhüma abdest aldı da yüzünü yıkadı. Şöyle ki, bir avuç su alıp ağzını çalkaladı ve burnuna su çekti. Sonra bir avuç su alıp onunla şöylece, yani sağ avucunu diğer avucu ile birleştirip yüzünü yıkadı. Yine bir avuç su alıp sağ elini (yani kolunu) yıkadı. Yine bir avuç su alıp sol elini yıkadı. Sonra başını mesh etti. Sonra bir avuç su aldı ve sağ ayağını yıkayıncaya kadar onu azar azar üzerine döktü. Sonra diğer bir avuç daha su aldı ve onunla ayağını, yani sol ayağını (yine öylece) yıkadı. Ondan sonra: Rasûlüllah(sallallahü aleyhi ve sellem)'ı, gördüm işte böyle abdest alıyordu, dedi",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 141,
			"arabicnumber": 141,
			"text": "Bize Cerîr, Mansûr'dan; o da Salim ibn Ebi'l-Ca'd (l00)'dan; o da Kurayb'dan; o da İbn Abbâs radıyallahü anhüma'dan tahdîs etti. İbn Abbâs, bunu Peygamber'e ulaştırıyordu. Peygamber(sallallahü aleyhi ve sellem) şöyle buyurmuştur: biriniz eşine (cinsî münâsebet için)geldiği zaman Bismillah, Allâhumme cennibnâ'ş-şeytâne ve cennibi'ş-şeytâne mâ razaktenâ (Allah'ın ismiyle, yâ Allah, bizleri şeytândan uzaklaştır ve şeytânı da bize ihsan ettiğin çocuktan uzak kıl) der de, onların arasında bir çocuk takdir olunursa, şeytan o çocuğa zarar veremez",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 142,
			"arabicnumber": 142,
			"text": "Bize Âdem(ibn Ebî İyâs) tahdîs edip şöyle dedi: Bize Şu'be, Abdu'l-Azîz ibn Suheyb'den tahdîs etti. Abdu'l-Azîz şöyle dedi: Ben Enes(radıyallahü anh)'ten işittim, şöyle diyordu: Peygamber (sallallahü aleyhi ve sellem) halâya girdiği zaman \"Allâhumme innî eûzu bike mine'l-hubusi ve'l-habâisi (=Ey Allahım, ben hubusten ve habâisten sana sığınırım)\" der idi. dedi ki): Muhammed ibn Ar'are, bu hadîsi Şu'be'den rivayet etmekte Âdem ibn Ebî İyâs'a mutâbaat etti. Ve Gunder, Şu'be'den: \"Halâya geldiği zaman\" dedi. Musa ibn İsmâîl ise, Hammâd ibn Seleme'(167)'den: \"Halâya girdiği zaman\" dedi. Saîd ibn Zeyd de şöyle dedi: Bize Abdu'l-Azîz ibn Suheyb tahdîs etti: \"Halâya girmek istediği zaman",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 143,
			"arabicnumber": 143,
			"text": "Bize Verkaa (199), Ubeydullah ibn Ebî Yezîd'den; o da İbn Abbâs radıyallahü anhüma'tan tahdîs etti ki, o şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem) halâya girdi. Kendisi için(yıkanıp abdest alacak) su koydum. \"Bunu kim koydu?\" diye sordu. Kendisine haber verildi. Bunun üzerine: \"Allâhumme fakkıhhu fi'd-dîn ( = Yâ Allah onu dînde ince anlayışlı kıl)\" diye dua etti",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 144,
			"arabicnumber": 144,
			"text": "Ebû Eyyûb el-Ensârî şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem) şöyle buyurdu: hacetini yerine getirmeğe gittiği zaman Kıble'yi karşısına almasın,(Medine'nin) şarkına yahut garbına doğru dönünüz",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 145,
			"arabicnumber": 145,
			"text": "Abdullah ibn Omer(radıyallahü anh) şöyle der idi: Bir takım insanlar, büyük hacetini yerine getirmek için oturduğun zaman Kıble'ye karşı da, Beytu'l-Makdis'e karşı da yönelme, diyorlar. Abdullah ibn Omer şöyle dedi: Yemîn olsun ki, ben bir gün bizim evin damı üstüne çıkmıştım. Bu esnada Rasûlüllah (sallallahü aleyhi ve sellem)'ın büyük hacetini yerine getirmek için Beytu'l-Makdis'e karşı iki kerpiç üzerine oturduğunu (gözümle) gördüm. İbn Omer Vâsi' ibn Hıbbân'a: Belki sen kıynakları üzerinde namaz kılan kimselerdensin? dedi. (Vâsi' dedi ki:) Bunun üzerine: Vallahi ben bilmiyorum, dedim. İmâm Mâlik: Abdullah ibn Omer yerden yükselmeyerek namaz kılan, kendisi (kıynaklarıyle) yere bitişik olduğu hâlde secde eden kimseyi kasdediyor, dedi",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 146,
			"arabicnumber": 146,
			"text": "Bana Ukayl, İbn Şihâb'dan; o da Urve'den; o da Âişe (r.anha)'den tahdîs etti (ki o şöyle demiştir): Peygamber'in zevceleri geceleyin haceti defe çıktıklarında (Medine'nin kenarında olan) Menâsı'a kadar giderlerdi. O(Menâsı' denilen yer) açık bir yerdir. Omer, Peygamber'e: Kadınlarını perde arkasına koy (yani evden çıkmalarını men' et), der idi de, Rasûlüllah(sallallahü aleyhi ve sellem) onun dediğini yapmıyordu. Nihayet Peygamber'in zevcesi Sevde bintu Zem'a gecelerden bir gece yatsı namazı vaktinde dışarıya çıktı. Sevde uzun boylu bir kadın idi. Ömer, hicâb emrinin indirilmesine çok arzu duyduğu için, ona: Yâ Sevde, bilmiş ol ki, biz seni muhakkak tanıdık, diye bağırdı. Bundan sonra Allah \"Hicâb Âyeti\"ni indirdi",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 147,
			"arabicnumber": 147,
			"text": "Bize Ebû Usâme, Hişâm ibn Urve'den; o da Babası Urve'den; o da Âişe (r.anha)'den tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem) kadınlara: \"Hacetiniz hususunda dışarıya çıkmanıza izin verildi\" buyurdu. Hişâm: Haceti yerine getirmek için dışarıya çıkmayı kasdediyor, dedi",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 148,
			"arabicnumber": 148,
			"text": "Abdullah ibn Omer(radıyallahü anh) şöyle demiştir: Bir ihtiyâcım sebebiyle (kızkardeşim) Hafsa'nın evinin damının üstüne çıkmıştım. Bu esnada Rasûlüllah (sallallahü aleyhi ve sellem)'ı gördüm, arkasını Kıble'ye, önünü de Şam'a döndürerek hacetini def ediyordu",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 149,
			"arabicnumber": 149,
			"text": "Abdullah ibn Omer(radıyallahü anh) haber verip şöyle demiştir: Bir gün evimizin damının üzerine çıktım, bu esnada Rasûlüllah (sallallahü aleyhi ve sellem)'ı Beytu'l-Makdis tarafına yönelerek iki kerpiç üzerine oturmuş (hacetini def eder) hâlde gördüm",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 150,
			"arabicnumber": 150,
			"text": "Bize Şu'be, Ebû Muâz'dan - ki ismi Ata ibnu Ebî Meymûne'dir - tahdîs etti. O şöyle demiştir: Ben Enes ibn Mâlik (radıyallahü anh)'ten işittim, şöyle diyordu: Rasûlüllah(sallallahü aleyhi ve sellem) hacetini defe çıktığı zaman bir çocukla beraber, yanımızda bir su kabı olduğu hâlde(hizmet etmek için) gelirdim.(Râvî dedi ki:) Enes bu su ile, Rasûlüllah'ın istincâ edip temizlendiğini anlatmak istiyor",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 151,
			"arabicnumber": 151,
			"text": "Bize Şu'be(ibn Haccâc), Ebû Muâz'dan tahdîs etti. Ata ibnu Ebî Meymûne'dir ki, şöyle demiştir: Ben Enes (radıyallahü anh)'ten işittim, o şöyle diyordu: Rasûlüllah(sallallahü aleyhi ve sellem) hacetini def için dışarıya çıktığı zaman ben, bizden bir çocukla beraber yanımızda bir su kabı olduğu hâlde onun arkasından giderdim",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 152,
			"arabicnumber": 152,
			"text": "Bize Şu'be, Ata ibn Ebî Meymûne'den tahdîs etti. O Enes ibn Mâlik (radıyallahü anh)'ten şöyle derken işitmiştir: Rasûlüllah (sallallahü aleyhi ve sellem) helâya girerdi de ben bir çocukla beraber bir su kabı ve bir harbe taşırdım. Rasûlüllah su ile istincâ edip temizlenirdi. hadîsi Şu'be'den rivayet etmekte Muhammed ibn Ca'fer'e Nadr (ibn Şumeyl-204) ile Şâzân (ibn Âmir-208) mutâbaat etmişlerdir. \"El-Anaze\" aşağı tarafında demir bulunan deynektir",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 153,
			"arabicnumber": 153,
			"text": "Ebû Katâde(radıyallahü anh) şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: biriniz bir şey içerken kabın içine nefesini bırakmasın, üflemesin. Helâya gittiğinde cinsiyet organına sağ eliyle dokunmasın, sağ eliyle de temizlenip silinmesin",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 154,
			"arabicnumber": 154,
			"text": "Ebû Katâde(radıyallahü anh) tahdîs etti ki, Peygamber (sallallahü aleyhi ve sellem) şöyle buyurmuştur: idrarını yaparken sakın zekerini sağ eliyle tutmasın, sağ eliyle temizlenmesin ve su kabının içine nefesini bırakmasın",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 155,
			"arabicnumber": 155,
			"text": "Ebû Hureyre(radıyallahü anh) şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem) hacetini def için çıktığında ardından gittim. Yürürken arkasına dönüp bakmazdı, kendisine yaklaştım. \"Silinip temizlenmem için bana taşlar ara\" buyurdu, yahut buna benzer bir söz söyledi. \"Fakat bana kemik ve fışkı getirme\" dedi. Ona eteğimin kenarı içinde birkaç taş getirip yanına koydum ve yanından savuştum. Hacetini yerine getirdiği zaman onlarla silindi",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 156,
			"arabicnumber": 156,
			"text": "Bize Sufyân es-Sevrî, Zeyd ibn Eslem'den; o da Ata ibn Yesâr'dan; o da İbn Abbâsradıyallahü anhüma'tan tahdîs etti.O şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) -bir defa- organlarını birer defa yıkayarak abdest aldı",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 157,
			"arabicnumber": 157,
			"text": "Bize Fuleyh ibnu Süleyman, Abdullah ibnu Ebî Bekr ibn Amr ibn Hazm (l35)'dan; o da Abbâd ibn Temîm'den; o da Abdullah ibn Zeyd (radıyallahü anh)'den -ki Ezan rüyasının sahibidir- tahdîs elli(O şöyle demiştir): Peygamber (sallallahü aleyhi ve sellem) -bir defa- uzuvlarını ikişer kerre yıkayarak abdest aldı",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 158,
			"arabicnumber": 158,
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 159,
			"arabicnumber": 159,
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 160,
			"arabicnumber": 160,
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 161,
			"arabicnumber": 161,
			"text": "Bize Yûnus(ibn Yezîd), Zuhrî'den haber verip şöyle dedi: Bana Ebû İdrîs (80) haber verdi ki, kendisi Ebû Hureyre (radıyallahü anh)'den işitmiştir. Peygamber (sallallahü aleyhi ve sellem): \"Her kim abdest alırsa burnunu ayıklasın; her kim taş ile silinirse taşın sayısını tek yapsın\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 162,
			"arabicnumber": 162,
			"text": "İsâ ibn Talha'dan; o da Ebû Hureyre (radıyallahü anh)'den tahdîs etti ki, Peygamber (sallallahü aleyhi ve sellem): \"Sizin biriniz uykusundan uyanıp da abdest aldığında burnundaki nesneyi nefesiyle üç defa dışarı çıkarsın. Çünkü şeytân, uyuyanın genzinde geceler\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 163,
			"arabicnumber": 163,
			"text": "Abdullah ibn Amr(radıyallahü anh) şöyle demiştir: Yaptığınız yolculukların birinde Peygamber(sallallahü aleyhi ve sellem) geride kalmıştı da sonradan bize yetişmişti. O sırada ikindi namazı vakti girmişti. Biz de abdest alıyorduk. Ayaklarımızı meshedercesine az su ile yıkamaya başladık. Peygamber bu hâli görünce en yüksek sesiyle iki yahud uç kerre \"Ateşte yanacak ökçelere yazık!\" diye nida etti",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 164,
			"arabicnumber": 164,
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 165,
			"arabicnumber": 165,
			"text": "Bize Muhammed ibn Ziyâd tahdîs edip şöyle dedi: Ben Ebû Hureyre (radıyallahü anh)'den işittim; o yanımızdan geçmekteydi, insanlar da temizlik için hazırlanmış bir su kabından abdest alıyorlardı; şöyle dedi: Abdest almayı tam ve kâmil yapınız. Çünkü Ebu'l-Kaasım (sallallahü aleyhi ve sellem): \"Ateşte yanacak ökçelere yazık!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 166,
			"arabicnumber": 166,
			"text": "Bize Mâlik, Saîd el-Makburî'den; o da Ubeyd ibn Cureyc'den haber verdi. Ubeyd ibn Cureyc, Abdullah ibn Omer'e: Yâ Ebâ Abdarrahmân! Arkadaşlarının yaptığını hiç görmediğim dört şeyi, seni yapıyor görüyorum, dedi. Omer; Nedir onlar, ey Cureyc'in oğlu? dedi. İbn Cureyc: Seni görüyorum ki, Ka'be'nin rükünlerinden Hâceri Esved rüknü ile Yemânî rüknünden başkasına el sürmüyorsun. Ve yine görüyorum, tabaklanmış deriden ayakkabılar giyiyorsun. Yine seni görüyorum, sarı boya ile boyuyorsun. Yine seni görüyorum, Mekke'de bulunduğun zaman insanlar (Zu'l-hicce) hilâlini görür görmez yüksek sesle telbiye okumaya başladıkları hâlde sen, terviye günü(yani Arefe'den evvelki gün) girmedikçe telbiyeye başlamıyorsun, dedi. ibn Omer şöyle cevâb verdi: Beyt'in rükünlerine gelince: Ben Rasûlüllahın Haceri Esved ile Yemânî rüknünden başkasına el sürüp meshettiğini görmedim. Tabaklanmış deriden ayakkabılara gelince: Ben Rasûlüllah'ın üzeri kılsız deriden ma'mûl ayakkabılar giyip, ayağı içinde iken abdest aldığını gördüm. Onun için ben onları giymeyi severim. Sarı boyaya gelince: Rasûlüllah'ın sarı boya ile boyadığını gördüm. Ben de onun için o boya ile boyamayı severim. Telbiyeye gelince: Rasûlüllah'ın hayvanı hareket için ayağa kalkıp doğrulmadıkça telbiye ettiğini görmedim",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 167,
			"arabicnumber": 167,
			"text": "Bize Hâlid(el-Hazzâ), Hafsa bintu Sîrîn'den; o da Ümmü Atıyye (radıyallahü anh)'den tahdîs etti. O şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) ona ve beraberindeki kadınlara, kızını yıkama hakkında: \"Onu yıkamağa sağ taraflarıyla ve abdest uzuvlarıyla başlayınız\" buyurmuştur. şöyle demiştir: - Peygamber (sallallahü aleyhi ve sellem)'in ayakkabı giymesinde, taranmasında, temizlenip abdest almasında ve bütün hâllerinde sağdan başlamak O'nun hoşuna giderdi",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 168,
			"arabicnumber": 168,
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 169,
			"arabicnumber": 169,
			"text": "Bize Mâlik, İshâk ibn Abdillah ibn Ebî Talha'dan; o da Enes ibn Mâlik (radıyallahü anh)'ten haber verdi ki, o şöyle demiştir: Ben Rasûlüllah(sallallahü aleyhi ve sellem)'ı şöyle gördüm: İkindi namazı yaklaşmıştı. İnsanlar abdest alacak su aradılar, fakat bulamadılar. Rasûlüllah'a(bir kab içinde) abdest alacak su getirildi. Rasûlüllah, elini su kabının içine koydu. Ve insanlara ondan abdest almalarını emretti. Enes der ki: İşte o zaman ben Peygamber'in parmakları altından, hiç kimse hâriç kalmamak üzere hepsi abdest alıncaya kadar su kaynadığını gördüm",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 170,
			"arabicnumber": 170,
			"text": "İbn Şîrîn şöyle demiştir: Ben Abîde(72)'ye: Yanımızda Peygamber (sallallahü aleyhi ve sellem)'in saçından bir mikdâr vardır, biz onu Enes tarafından yahut Enes'in ailesi tarafından elde etmiştik, dedim. Bunun üzerine Abîde: Yanımda, Peygamber'den bir tek saç telinin bulunması muhakkak bana dünyâdan ve dünyâdaki şeylerden daha sevimlidir, dedi. Abbâd (ibnu'l-Avvâm (185), İbnu Avn'dan; o da ibnu Sîrîn'den; o da Enes (radıyallahü anh)'ten tahdîs etti (O şöyle demiştir): Rasûlüllah (sallallahü aleyhi ve sellem-Vedâ Haccı'nda) başını tıraş ettiği zaman saçından en evvel alan Ebû Talha idi",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 171,
			"arabicnumber": 171,
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 172,
			"arabicnumber": 172,
			"text": "Ebû Hureyre(radıyallahü anh) şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: \"Birinizin kabından köpek (ağzını sokup bir şey) içtiği zaman o kabı yedi kerre yıkasın",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 173,
			"arabicnumber": 173,
			"text": "Bize Abdurrahmân ibn Abdillah ibn Dînâr tahdîs edip şöyle dedi: Ben Babam (Abdullah ibn Dînâr)'dan işittim; o da Ebû Salih'ten; o da ebû Hureyre(radıyallahü anh)'den ki, Peygamber (sallallahü aleyhi ve sellem) şöyle buyurmuştur: adam, susuzluktan dolayı nemli toprağı yemekte olan bir köpek gördü. Bu zât hemen kendi ayakkabısını çıkarıp onunla köpek için su avuçlamağa başladı. Nihayet köpeği suya kandırdı. Bundan dolayı Allah o kula sena edip, onu cennete girdirdi\". Ahmed ibn Şebîb (200) şöyle dedi: Bana Babam(Şebîb), Yûnus'tan; o da İbn Şihâb'dan tahdîs etti. O şöyle demiştir: Bana Hamza ibnu Abdillah, Babası Abdullah ibn Omer'den tahdîs etti. O şöyle demiştir; Rasûlüllah(sallallahü aleyhi ve sellem) zamanında köpekler(işer ve), mescidin içinde gider gelirdi de bundan dolayı (mescidi yıkamak için) hiç su serpmezlerdi",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 174,
			"arabicnumber": 174,
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 175,
			"arabicnumber": 175,
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 176,
			"arabicnumber": 176,
			"text": "Ebû Hureyre (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) şöyle buyurdu: \"Bir kul, namazı bekleyerek abdestini bozmadan mescidde bulunduğu müddetçe hep namazdadır\".(Ebû Hureyre bu hadîsi söyleyince) yabancı bir adam: Hades (yani abdesti bozan) nedir yâ Ebâ Hureyre? diye sordu. Ebû Hureyre de, sesli yellenmeyi kasdederek, sestir, dedi",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 177,
			"arabicnumber": 177,
			"text": "Bize İbn Uyeyne, Zuhrî'den; o da Abbâd ibn Temîm'den; o da amucası (Abdullah ibn Zeyd)ndan tahdîs etti.Peygamber (sallallahü aleyhi ve sellem): \"Namaz kılan kimse bir ses işitinceye yahut bir koku hissedinceye kadar (namazdan) ayrılmasın\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 178,
			"arabicnumber": 178,
			"text": "Muhammed ibnu'l-Hanefiyye şöyle demiştir: Alî ibn Ebî Tâlib (radıyallahü anh) şöyle dedi: Ben mezîsi çok bir kimse idim. Bunu Rasûlüllah'a sormaya utandım da Mıkdâd ibn Esved'e sormasını emrettim. O da sordu. Rasûlüllah: ''Abdest almak îcâb eder\" buyurdu. Bu hadîsi Şu'be(ibn Haccâc) de A'meş'ten rivayet etti",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 179,
			"arabicnumber": 179,
			"text": "Atâ ibn Yesâr haber vermiştir. Ona da Zeyd ibn Hâlid, Usmân ibn Affân'a şöyle sorduğunu haber vermiştir: Osmân'a: Bir kimse cinsî münâsebet yapar da menisi gelmezse ne (yapmalıdır) dersin? dedim. Osmân: Namaz için abdest aldığı gibi abdest alır, bacakları arasını yıkar, dedi. Osmân: Ben bunu Rasûlüllah(sallallahü aleyhi ve sellem)'tan işittim, diye de ilâve etti. Zeyd: Ben bu mes'eleyi Alî, Zubeyr, Talha ve Ubeyy ibn Ka'b'dan da sordum. Bunların hepsi de o cinsî münâsebet yapan kimşeye böyle emrettiler, dedi",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 180,
			"arabicnumber": 180,
			"text": "Bize İshâk -ki o İbnu Mansûr'dur- tahdîs edip şöyle dedi: Bize Nadr haber verip şöyle dedi: Bize Şu'be, Hakem(ibn Uteybe)'den; o da Zekvân Ebû Salih'ten; o da Ebû Saîd Hudrî (radıyallahü anh)'den haber verdi (o şöyle demiştir): Rasûlüllah (sallallahü aleyhi ve sellem) Ensâr'dan bir adama haber gönderip istedi. O zât, başı su damlaya damlaya geldi. Peygamber: \"Galiba seni aceleye getirdik\" buyurdu. O zât: Evet, dedi. Bunun üzerine Rasûîullah: \"Şayet işin aceleye getirilir yahut menî getirememeğe ma'rûz bırakılırsan, sana yalnız abdest almak lâzım olur\" buyurdu. Bunu rivayet etmekte Nadr ibn Şumeyl'e Vehb ibn Cerîr mutâbaat edip: Bize Şu'be tahdîs etti dedi: Ebû Abdillah Buhârî şöyle dedi: Gunder ve Yahya (ibn Saîd el-Kattân bu hadîsi) Şu'-be'den (bu isnâd ve metin ile rivayetlerinde) abdest almak sözünü söylemediler (de sâdece üzerine lâzımdır ma'nâsına fealeyke dediler)",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 181,
			"arabicnumber": 181,
			"text": "Usâme ibn Zeyd(radıyallahü anh)'den (o şöyle demiştir): Rasûlüllah(sallallahü aleyhi ve sellem) Arafat'tan hareket ettiği zaman dağ arasındaki yola yöneldi ve hacetini yerine getirdi. Usâmetu'bnu Zeyd dedi ki: Müteakiben ben Rasûlüllah'ın üzerine su dökmeğe, o da abdest almağa başladı. Ben: Yâ Rasûlallah, namaz mı kılacaksın? dedim. \"Namaz\" kılınacak yer önünde(yâni ileride)buyurdu",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 182,
			"arabicnumber": 182,
			"text": "Urve, Mugîretu'bnu Şu'be'den tahdîs ediyordu. Mugîre, bir seferde Rasûlüllah'ın maiyyetinde bulunmuş. Rasûlüllah bir hacetini yerine getirmek için gitmiş. Müteakiben abdest alırken suyunu Mugîre dökmeğe başlamış. İşte bu abdestte Peygamber, yüzünü ve ellerini yıkamış, başına ve mestleri üzerine mesh etmiştir",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 183,
			"arabicnumber": 183,
			"text": "Abdullah İbn Abbâsradıyallahü anhüma şöyle haber vermiştir: Kendisi bir gece Peygamber'in zevcesi Meymûne'nin yanında kalmıştır. Bu Meymûne, İbn Abbâs'ın teyzesidir. İbn Abbâs dedi ki: Ben yastığın enine yattım, Rasûlüllah ile ehli de yastığın uzunluğuna başlarını koyarak uzandılar. Rasûlüllah (sallallahü aleyhi ve sellem) uyudu. Nihayet gece yarıyı bulduğunda yahut biraz evvelce yahut biraz sonraca uyandı. Oturup eliyle yüzünden uykuyu silmeğe başladı. Ondan sonra Âl-i İmrân sûresinin son on âyetlerini okudu. Sonra kalkıp asılı duran küçük bir kırbaya uzandı. Ondan güzel bir abdest aldı. Sonra namaza durdu. İbn Abbâs dedi ki: Ben de kalktım ve O'nun yaptığı gibi yaptım. Sonra gittim ve yanı başına durdum. Sağ elini başımın üzerine koydu ve sağ kulağımı tutup büktü. Sonra iki rek'at, yine iki rek'at, yine iki rek'at, yine iki rek'at, yine iki rek'at, yine iki rek'at kılıp, ondan sonra tek rek'at kıldı. Sonra müezzin gelinceye kadar yine yattı. Sonra kalktı ve hafîf iki rek'at daha kıldı. Sonra çıkıp sabah namazını kıldırdı",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 184,
			"arabicnumber": 184,
			"text": "Esma(radıyallahü anh) şöyle demiştir: Güneş tutulduğu zaman Peygamber'in zevcesi Âişe'ye geldim. Bir de baktım ki, insanlar hep dikilmiş namaz kılıyorlar. Baktım Âişe de kalkmış namaz kılmakta. İnsanlara ne oluyor? dedim. Âişe eliyle göğe doğru işaret edip Subhânallah dedi. Ben: Bu bir alâmet mi? diye sordum. Âişe başıyle evet diye işaret etti. Bunun üzerine ben de kalkıp namaza durdum. Nihayet (kıyamın uzunluğundan) üzerime baygınlık geldi. Başımın üstüne su dökmeğe başladım. Rasûlüllah (sallallahü aleyhi ve sellem) namazdan ayrılınca Allah'a hamd ve sena ettikten sonra şöyle buyurdu: \"Cennet ve cehenneme kadar (evvelce) görmemiş olduğum hiçbir şey kalmadı ki, bu makaamımda onu görmüş olmayayım. Ve yemîn olsun bana vahyolundu ki, sizler kabirlerde Deccâl imtihanına benzer yahut ona yakın bir imtihana çekileceksiniz -Râvî: Esmâ'nın bu, benzer yahut yakın tâ'bîrlerinden hangisini söylediğini bilemiyorum, dedi- Birinize gelinecek de: Bu adam(yani Muhammed) hakkındaki ilmin redir? Denilecek. Mü'min yahut yakîn sahibi olan kimse -Râvî: Esma, bu iki sözün hangisini söyledi bilmiyorum, dedi- 'O Allah'ın elçisi Muhammed'dir, bize beyyinelerle hidâyet getirdi. Biz de icabet ettik ve O'na uyduk' diyecektir. Bunun üzerine ona: Sen iyi hâlde yat uyu. Biz kat’i olarak bildik ki sen O'na iyice inanmışsın, denilecektir. Münafık yahut kalbinde şüphesi olan kimseye gelince -Râvî: Esma bunların hangisini söyledi bilmiyorum, dedi- o: Ben bilmiyorum. İnsanlardan işittim, bir şey söylüyorlardı, onu ben de söyledim, diyecektir",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 185,
			"arabicnumber": 185,
			"text": "Bize Mâlik, Amr ibn Yahya el-Mâzinî'den; o da Babasından şöyle haber verdi ki: Bir adam Abdullah ibn Zeyd'e -ki bu Amr ibn Yahya'nın dedesidir-: RasûIullah (sallallahü aleyhi ve sellem)'ın nasıl abdest aldığını bana gösterebilir misin? diye sormuş. Abdullah ibn Zeyd de: Evet, demiş. Bunun üzerine su istemiştir. Râvî dedi ki: Ellerine su döktükten sonra iki kerre yıkadı. Sonra üç defa ağzını çalkalayıp, burnunu temizledi. Sonra yüzünü üç defa yıkadı. Sonra ellerini dirseklere kadar ikişer defa yıkadı. Sonra iki eliyle bütün başını meshedip her iki elini ileri geri götürdü. Ve başının ön tarafından başlayıp ellerini arkasına götürdü. Oradan da başladığı yere getirdi. Ondan sonra ayaklarını yıkadı",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 186,
			"arabicnumber": 186,
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 187,
			"arabicnumber": 187,
			"text": "Bize Hakem(ibn Uteybe) tahdîs edip şöyle dedi: Ben Ebû Cuhayfe (74)'den işittim, şöyle diyordu: (sallallahü aleyhi ve sellem-bir seferde) Öğlenin sıcak zamanında yanımıza çıktı. Kendisine abdest alacak su getirildi, abdest aldı. İnsanlar abdest suyunun artanını alıp (teberrüken) vücûdlarına sürmeğe başladılar. Peygamber, önünde bir harbe olduğu hâlde öğleyi ve ikindiyi ikişer rek'at kıldırdı",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 188,
			"arabicnumber": 188,
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 189,
			"arabicnumber": 189,
			"text": "İbn Şihâb şöyle demiştir: Bana Mahmûd ibnu'r-Rabî' haber verdi -ki o çocuk iken kendi kuyularından Rasülullah'ın onun yüzüne su püskürmüş olduğu kimsedir. Ve Urve(ibn Zubeyr), Mısver'den ve gayrisinden(yânı Mervân ibn Hakem'den) söyledi; Misver ve Mervân'dan her biri arkadaşının hadîsini tahdîs ediyordu- şöyle dedi: Peygamber (sallallahü aleyhi ve sellem) abdest aldığı zaman sahâbîler onun abdest suyu üzerinde döğüşmeye yaklaşıyorlardı",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 190,
			"arabicnumber": 190,
			"text": "Ca'd şöyle demiştir: Ben Sâib ibn Yezîd (91)'den işittim, şöyle diyordu: Teyzem beni Peygamber(sallallahü aleyhi ve sellem)'in yanına götürdü de: Yâ Rasûlallah! Benim kız kardeşimin bu oğlu ayağından rahatsızdır, dedi. Rasûlüllah başımı eliyle sıvazladı ve bana bereket duası etti. Sonra abdest aldı. Ben onun abdest suyundan içtim. Sonra sırtının arkasında dikeldim ve iki omuzu arasında gerdek çadırının büyük düğmeleri -yahut keklik yumurtası- gibi Peygamberlik mührünü gördüm",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 191,
			"arabicnumber": 191,
			"text": "Bize Amr ibn Yahya, Babası Yahya ibn Umâre'den; o da Abdullah ibn Zeyd'den tahdîs etti. Abdullah ibn Zeyd kabdan eline su döküp ellerini yıkadı. Sonra bir avuç sudan ağzını yıkadı yahut çalkaladı ve burnuna su verdi. Böyle ağız ve burun yıkamayı üç defa yaptı. Akabinde üç defa yüzünü yıkadı. Ondan sonra dirseklere kadar ikişer defa ellerini yıkadı, başının önünü ve arkasını (bir defa) meshetti, topuklarına kadar ayaklarını yıkadı. Bundan sonra Rasûlüllah (sallallahü aleyhi ve sellem)'ın abdest alışı işte böyledir, dedi",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 192,
			"arabicnumber": 192,
			"text": "Bize Amr ibn Yahya, Babasından tahdîs etti. Babası şöyle demiştir: Ben Amr ibn Ebî Hasen'e şâhid oldum, o Abdullah ibn Zeyd'e Peygamber'in abdest alışını sordu. Bunun üzerine Abdullah ibn Zeyd bir kab su istedi ve onlar için abdest aldı. Şöyle ki: Kabı elinin üzerine meylettirip, ellerini üç defa yıkadı. Sonra elini kabın içine sokup (su alarak) üç avuç ile üç defa ağzını çalkaladı, burnuna su verip çıkardı. Sonra elini kabın içine sokup (su alarak) üç kerre yüzünü yıkadı. Sonra yine elini kabın içine sokup dirseklere kadar ikişer defa ellerini yıkadı. Sonra elini yine kabın içine sokup başını meshedip ellerini ileri geri götürdü. Sonra elini yine kabın içine sokup ayaklarını yıkadı. keza bize Mûsâ (ibn Ismâîl) tahdîs edip şöyle dedi: Bize Vuheyb tahdîs etti... (isnadın bundan sonrası tamamen geçen isnâd gibidir. Bu hadîsin metninde başı mesh cümlesi şöyledir): Sonra başını bir kerre meshetti, dedi",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 193,
			"arabicnumber": 193,
			"text": "Abdullah ibn Omer (radıyallahü anh) şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem) zamanında(hicâb âyeti inmeden) erkeklerle kadınlar birlikte -bir kab içinden- abdest alırlardı",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 194,
			"arabicnumber": 194,
			"text": "Muhammed ibnu'l-Munkedir şöyle demiştir: Ben Câbir’den işittim, şöyle diyordu: Rasûlüllah (sallallahü aleyhi ve sellem) bana hasta ziyaretine geldi.Ben ise kendimi bilmeyecek kadar hasta idim. Rasûlüllah abdest aldı ve abdest suyundan üzerime döktü. Ben kendime geldim ve: Yâ Rasûlallah! Mîrâsım kime kalacak? Benim mîrâsçılarım ancak Kelâle (yânı usûl ve furû'dan olmayan kimseler)dir, dedim. Bunun üzerine mîrâs payları âyeti nazil oldu",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 195,
			"arabicnumber": 195,
			"text": "Bize Humeyd (143), Enes(radıyallahü anh)'ten tahdîs etti. O şöyle demiştir: Bir defa namaz vakti geldi. Evi yakın olanlar kalkıp ailesinin yanına(abdest almağa) gittiler. Bir topluluk da kaldı.Rasûlüllah'a içinde su bulunan taştan yapılmış bir tekne getirildi. Tekne ise içinde avucunu açamayacak kadar küçük idi. Orada kalanların hepsi o tekneden abdest aldılar. (Râvî dedi ki:) Biz Enes'e: Siz kaç kişi idiniz? diye sorduk. Enes: Seksen ve daha ziyâde idik, dedi",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 196,
			"arabicnumber": 196,
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 197,
			"arabicnumber": 197,
			"text": "Abdullah ibn Zeyd (radıyallahü anh) şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem) geldi. Biz onun için bakırdan bir tas içinde su çıkardık. Abdest aldı. Şöyle ki yüzünü üç defa, ellerini de ikişer defa yıkadı. Başını meshedip, başının önünü ve arkasını sıvazladı. Ayaklarını da yıkadı",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 198,
			"arabicnumber": 198,
			"text": "Âişe (r.anha) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem)-'in hastalığı- ağırlaştı da ağrısı şiddetlendiği zaman, benim evimde bakılmak hususunda zevcelerinden izin istedi. Onlar kendisine izin verdiler. Müteakiben Peygamber iki adam arasında, Abbâs ile başka bir zât arasında olduğu hâlde, ayakları yerde sürünerek çıktı. Âişe'den rivayet eden Abdullah şöyle dedi: Ben Âişe'nin sözünü Abdullah ibn Abbâs'a haber verdiğimde o: Diğer adam kimdir biliyor musun? dedi. Ben: Hayır(bilmiyorum), dedim. Abdullah; O Alî'dir, dedi. Âişe tahdîs eder idi ki, Peygamber O'nun evine girip de ağrısı şiddetlendikten sonra: \"Üzerime bağları çözülmedik yedi kırba su dökün, belki hafiflerim de insanlara tavsiyede bulunabilirim\" dedi. Bunun üzerine kendisi Peygamber'in zevcesi Hafsa'ya âid olan bir leğen içine oturtuldu. Sonra o kırbaların suyunu üzerine dökmeğe başladık. Nihayet O da: \"Artık yaptınız!\"diye işaret etmeğe başladı. Ondan sonra insanların yanına çıktı",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 199,
			"arabicnumber": 199,
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 200,
			"arabicnumber": 200,
			"text": "Bize Hammâd, Sâbit'ten; o da Enes'ten tahdîs etti ki(şöyle demiştir): Peygamber (sallallahü aleyhi ve sellem) bir kab su istedi. Kendisine içinde biraz su bulunan ağzı geniş dibi dar bir kab getirildi. Parmaklarını içine koydu. Enes dedi ki: Artık ben onun parmakları arasından suyun kaynayışına bakmağa başladım. Enes dedi ki: O sudan abdest alanları yetmiş ile seksen arasında tahmîn ettim",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 201,
			"arabicnumber": 201,
			"text": "Bize Mıs'ar(155) tahdîs edip şöyle dedi: Bana İbnu Cubeyr tahdîs edip şöyle dedi: Ben Enes (radıyallahü anh)'ten işittim, şöyle diyordu: Peygamber(sallallahü aleyhi ve sellem) bir sâ' ve nihayet beş müdd (mıkdârı su) ile vücûdunu yıkar yahut yıkanır, bir müdd ile de abdest alırdı",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 202,
			"arabicnumber": 202,
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 203,
			"arabicnumber": 203,
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 204,
			"arabicnumber": 204,
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 205,
			"arabicnumber": 205,
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 206,
			"arabicnumber": 206,
			"text": "Mugîre (radıyallahü anh) şöyle demiştir: Ben bir seferde Peygamber(sallallahü aleyhi ve sellem)'in maiyyetinde idim. (Abdest alacağı sırada) mestlerini çıkarmak için davrandım. Peygamber bana: \"Onları bırak, çünkü ben ayaklarımı abdestli oldukları hâlde mestler içine soktum\" buyurdu ve(mestleri) üzerlerine meshetti",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 207,
			"arabicnumber": 207,
			"text": "Bize Mâlik, Zeyd ibn Eslem'den; o da Atâ ibn Yesâr'dan; o da Abdullah ibn Abbâs'tan haber verdi (o şöyle demiştir): Rasûlüllah(sallallahü aleyhi ve sellem) koyun küreği yedi, sonra abdest almadan namaz kıldırdı",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 208,
			"arabicnumber": 208,
			"text": "İbn Şihâb şöyle demiştir. Bana Ca'fer ibn Amr ibn Umeyye haber verdi. Ona da Babası (Amr ibn Umeyye) haber vermiştir ki, o Rasûlüllah(sallallahü aleyhi ve sellem)'ı pişmiş koyun küreğinden et kesip yerken görmüş. O sırada Rasûlüllah namaza çağırılmış. Bunun üzerine bıçağı bırakıp abdest almadan namaz kıldırmıştır",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 209,
			"arabicnumber": 209,
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 210,
			"arabicnumber": 210,
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 211,
			"arabicnumber": 211,
			"text": "Bize Leys, Ukayrden; o da İbn Şihâb'dan; o da Ubeydullah ibn Abdillah ibn Utbe'den; o da İbn Abbâs'tan tahdîs etti. (O şöyle demiştir): Rasûlüllah (sallallahü aleyhi ve sellem) süt içti de ağzını çalkaladı ve: \"Bu, yağlıdır\" buyurdu. Bu hadîsi ibn Şihâb'dan rivayet etmekte Yûnus ibn Yezîd ile Salih ibn Keysân ayrı ayrı Ukayl'e mutâbaat etmişlerdir",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 212,
			"arabicnumber": 212,
			"text": "(Âişe-radıyallahü anha-şöyle demiştir): Rasûlüllah(sallallahü aleyhi ve sellem) şöyle buyurdu: namaz kılarken uyukladığı zaman uykusu gidinceye kadar yatsın. Çünkü uyuklayarak namaz kılarsa bilemez de istiğfar edecek iken belki de o kendine söver",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 213,
			"arabicnumber": 213,
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 214,
			"arabicnumber": 214,
			"text": "Bize Sufyân (es-Sevrî), Amr ibn Âmir'den tahdîs etti. O, ben Enes'ten işittim demiştir. H Buhârî dedi ki: Ve bize Müsedded tahdîs edip şöyle dedi: Bize Yahya (ibn Saîd el-Kattân), Sufyân es-Sevrî'den tahdîs etti. Sufyân şöyle demiştir: Bana Amr ibnu Âmir, Enes'ten tahdîs etti. Enes şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem) her namaz vaktinde abdest alır idi.(Râvî Amr ibn Amir dedi ki:) Ben Enes'e: Ya sizler nasıl yapar idiniz? dedim. Enes: Her birimize abdestini bozmadığı müddetçe (bir vakitten ziyâde namaz için) bir abdest kâfi gelirdi, dedi",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 215,
			"arabicnumber": 215,
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 216,
			"arabicnumber": 216,
			"text": "Bize Cerîr, Mansûr'dan; o da Mucâhid'den; o da İbn Abbâs'tan tahdîs etti. O şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem) Medine yahut Mekke bağçelerinden bir bağçenin yanından geçti. Derken kabirlerinde azab olunan iki insanın sesini işitti. Peygamber: \"Bunlar azab olunuyorlar, hem de azab olunmaları büyük bir şeyi için değildir\" buyurduktan sonra, şöyle devam etti: \"Evet, onların biri idrarından sakınmazdı, diğeri de koğuculuk ederdi\". Ondan sonra yaprakları soyulmuş bir hurma dalı istedi. Dalı iki parça yaptı. Her birinin kabri üzerine bir parça koydu. Yâ Rasûlallah! Bunu niçin yaptın? denildi. \"Bunlar kurumadıkları müddetçe -yahut: kuruyuncaya kadar- onlardan azab hafifletilir\" buyurdu",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 217,
			"arabicnumber": 217,
			"text": "Bana Atâ ibn Ebî Meymûne, Enes ibn Mâlik'ten tahdîs etti. O şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) hacetini yerine getirmek için dışarıya çıktığı zaman ben kendisine su götürürdüm. O da bu su ile kendini yıkardı",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 218,
			"arabicnumber": 218,
			"text": "Bize el-A'meş, Mucâhid'den; o da Tâvûs'tan; o da İbn Abbâs'tan tahdîs etti. O şöyle demiştir:Peygamber (sallallahü aleyhi ve sellem) iki kabrin yanına uğradı da: \"Bunlar azab olunuyorlar. Azab olunmaları da büyük bir şey için değildir. Bunların biri idrardan sakınmaz idi. Diğeri ise lâf taşır, koğuculuk ederdi\" buyurdu. Ondan sonra yaprakları soyulmuş yaş bir hurma dalı aldı da onu iki parça etti. Sonra her bir kabre bir parça dikti. Yâ Rasûllallah! Bunu niçin yaptın? diye sordular: \"Bu çubuklar yaş kaldıkları müddetçe belki onlardan azapları hafifletilir\" buyurdu. ibnu'l-Müsennâ şöyle dedi: Ve bize Vekî' tahdîs edip şöyle dedi: Bize A'meş tahdîs edip şöyle dedi: Ben Mucâhid'den bunun benzerini işittim, o idrarından sakınıyordu",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 219,
			"arabicnumber": 219,
			"text": "Bize İshâk, Enes ibn Mâlik'ten haber verdi ki, o şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem) mescidde bevletmekte olan bir bedevîyi gördü de: \"Onu bırakın\" buyurdu. Nihayet bevletmesinden ayrıldığı zaman bir mikdâr su istedi de o suyu idrarın üzerine döktü",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 220,
			"arabicnumber": 220,
			"text": "Zuhrî şöyle demiştir: Bana Ubeydullah ibnu Abdillah ibn Utbe ibn Mes'ûd haber verdi ki, Ebû Hureyre şöyle demiştir: Bedevinin biri dikilip mescidin içinde bevletti. Oradaki insanlar bedevîye doğru bağırıştılar. Peygamber (sallallahü aleyhi ve sellem) onlara \"Onu serbest bırakın... Sonra idrarının üzerine dolu bir kova yahut büyük bir kova su dökünüz. Çünkü sizler ancak kolaylaştırıcılar olarak gönderildiniz, güçlük yapıcılar olarak gönderilmediniz\" buyurdu",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 221,
			"arabicnumber": 221,
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 222,
			"arabicnumber": 222,
			"text": "Mü'minlerin annesi Âişe (r.anha) şöyle demiştir: Rasûlüllah'a küçük bir çocuk getirildi. Çocuk O'nun elbisesinin üzerine bevletti. Rasûlüllah hemen su istedi de onu idrarın üzerine döktü",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 223,
			"arabicnumber": 223,
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 224,
			"arabicnumber": 224,
			"text": "Huzeyfe (radıyallahü anh-36) şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem) -bir kerre Ensârdan- bir kavmin süprüntülüğüne vardı da ayakta dikilerek bevletti. Sonra su istedi. Ben de O'na bir mikdâr su götürdüm, kendisi onunla abdest aldı",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 225,
			"arabicnumber": 225,
			"text": "Huzeyfe (radıyallahü anh) şöyle demiştir: Ben kendimi bildim ki, Peygamber ile beraberce yürüyorduk. Derken Peygamber bir kavmin bir duvar arkasındaki süprüntülüğüne geldi ve herhangi birimizin dikelmesi gibi dikilip bevletti. Ben de ondan uzaklaştım. Kendisi bana işaret etti. Ben de yanına vardım ve bevletmesini bitirinceye kadar topuğunun yanında -yani arkasında- dikeldim",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 226,
			"arabicnumber": 226,
			"text": "Ebû Vâil şöyle demiştir: Ebû Mûsâ el-Eş'ârî idrar serpintileri dokunmasın diye pek ziyâde şiddet gösterir ve İsrail oğullarından birinin elbisesine idrar değerse onu mıkrâz ile kesdiğini söylerdi. Huzeyfe -bunu işitince-: Ah keşke Ebû Mûsâ böyle şiddetli davranmaktan ve böyle söylemekten kendini tutsaydı! Rasûlüllah (sallallahü aleyhi ve sellem) bir kavmin süprüntülüğüne geldi de ayakta dikelerek bevletti... demiştir",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 227,
			"arabicnumber": 227,
			"text": "Bana Fâtıma, Esmâ'dan tahdîs etti. O şöyle demiştir: Bir \"kadın Peygamber (sallallahü aleyhi ve sellem)'e geldi de: Birimiz elbise üzerinde hayız görürse nasıl yapsın buyurursun? diye sordu. Rasûlüllah: \"Elbisesini eliyle ovalar, sonra su ile oğuşturup sıkar, sonra üzerine azar azar su döker, ondan sonra onunla namaz kılar\" buyurdu",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 228,
			"arabicnumber": 228,
			"text": "Bize Hişâm ibn Urve, Babasından; o da Âişe (r.anha)'den tahdîs etti. O şöyle demiştir: Ebû Hubeyş kızı Fâtıma, Peygamber'in yanına geldi ve: Yâ Rasûlallah! Ben devamlı kanamaya ma'rûz kılınan bir kadınım, temiz olamıyorum. Namazı terk mi edeyim? diye sordu.Rasûlüllah(sallallahü aleyhi ve sellem): \"Hayır, bu hayız değildir; bir damar (dan gelen kan)dır. Senin asıl hayzın (başlama zamanı) geldiği vakit namazı bırak. Hayzın (kesilme zamanı) gelince kendinden kanı yıka (yani yıkan),sonra namaz kıl\" buyurdu. dedi ki: Ve Babam (Urvetu'bnu'z-Zubeyr) şöyle dedi: “Ondan sonra yine o vakit gelinceye kadar her bir namaz için abdest al\" buyurdu",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 229,
			"arabicnumber": 229,
			"text": "Bize Amr ibnu Meymûn ibn Mihrân, Süleyman ibn Yesâr'dan; o da Âişe'den, Âişe'nin Peygamber'in elbisesinden meniyi yıkar olduğunu, yıkamadan sonra da o elbisede ıslaklık izini yahut birçok ıslaklık izlerini gördüğünü tahdîs etti",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 230,
			"arabicnumber": 230,
			"text": "Âişe(r.anha) şöyle demiştir: Ben, Peygamber'in elbisesinden cenabet izini yıkardım da O, elbisesinde yer yer su ıslakları olduğu hâlde namaza çıkardı",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 231,
			"arabicnumber": 231,
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 232,
			"arabicnumber": 232,
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 233,
			"arabicnumber": 233,
			"text": "Bize Hammâd ibn Zeyd, Eyyûb'dan: o da Ebû Kılâbe'den; o da Enes (radıyallahü anh)'ten tahdîs etti. O şöyle demiştir: Ukl veya Ureyne kabîlelerinden bir takım insanlar (Medine'ye) geldiler. Mîde hastalığından dolayı Medine'de ikaamet etmek istemediler. Peygamber (sallallahü aleyhi ve sellem) onlara sütlü develerin bulunduğu yere gitmelerini, develerin sidiklerinden ve sütlerinden içmelerini emretti. Onlar gittiler. Sağlamlaştıkları zaman Peygamber'in çobanını öldürdüler ve develeri sürüp götürdüler. Bu haber gündüzün evvelinde geldi. Peygamber arkalarından bir müfreze gönderdi. Gündüz yükselince adamlar getirildiler. Rasûlüllah(kısas olarak) ellerinin, ayaklarının kesilmesini emretti. Bu canilerin gözleri de oyulup Harre'ye atıldılar. Onlar su istiyorlardı, (ölünceye kadar) kendilerine su verilmedi. Kılâbe: İşte bunlar hırsızlık yapmışlar, insan öldürmüşler, imana girmelerinin ardından kâfir olmuşlar, bu cürümleri işlemekle beraber Allah'a ve Rasûlü'ne de muhârib olmuşlardır, dedi",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 234,
			"arabicnumber": 234,
			"text": "Enes (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem), mescidin bina olunmasından evvel koyun ağıllarında namaz kıldırır idi",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 235,
			"arabicnumber": 235,
			"text": "Bana Mâlik, İbn Şihâb'dan; o da Ubeydullah ibn Abdillah'tan; o da İbn Abbâs'tan; o da Meymûne'den tahdîs etti (O şöyle demiştir): Rasûlüllah'a (donmuş) yağın içine düşmüş fareden soruldu. Rasûlüllah (sallallahü aleyhi ve sellem): \"Fareyi ve etrafındaki yağları atınız; işte bunların topunu atınız da yağınızı yiyiniz\" buyurdu",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 236,
			"arabicnumber": 236,
			"text": "Bize Ma'n(ibn İsâ-198) tahdîs edip şöyle dedi: Bize Mâlik, İbn Şihâb'dan; o da Ubeydullah ibn Abdillah ibn Utbe ibn Mes'ûd'dan; o da İbn Abbâs'tan; o da Meymûne'den tahdîs etti (O şöyle demiştir): Peygamber(sallallahü aleyhi ve sellem)'e, bir yağ içine düşmüş olan fareden soruldu. \"O fareyi ve farenin etrafındaki yağları alınız da, bu alınanların hepsini atınız\" buyurdu. (Aliyyu'bnu'l-Medînî yukarıki isnâdla dedi ki:) Ma'n şöyle dedi: İmâm Mâlik bize... İbn Abbâs'tan, o da Meymûne'den... diyerek sayamayacağım kadar hadîs söyledi",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 237,
			"arabicnumber": 237,
			"text": "Bize Ma'mer(ibn Râşid), Hemmâm ibn Münebbih'ten; o da Ebû Hureyre'den haber verdi ki, Peygamber(sallallahü aleyhi ve sellem) şöyle buyurmuştur:\"Müslümânın Allah yolunda alacağı her yara, kıyâmet gününde yeni açıldığı andaki hey'eti üzere kan fışkırıyor gibi olur: Rengi kan rengidir, fakat kokusu misk kokusudur",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 238,
			"arabicnumber": 238,
			"text": "Bize Ebu'z-Zinâd haber verdi ki, ona da Abdurrahmân ibn Hurmuz el-A'rac tahdîs etmiştir. O da Ebû Hureyre'den işitmiştir. O da Rasûlüllah (sallallahü aleyhi ve sellem)' tan şöyle buyururken işitmiştir: sonra gelenleriz. (Kıyâmet gününde) öne geçecek olanlarız",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 239,
			"arabicnumber": 239,
			"text": "Bu, geçen hadîsin isnadıyla: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: biriniz, akmayan durgun suya bevletmesin. Sonra ondan (su alıp) yıkanır",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 240,
			"arabicnumber": 240,
			"text": "Bize Abdan tahdîs edip şöyle dedi: Bana Babam (Usmân ibn Cebele), Şu'be'den; o da Ebû İshâk'tan; o da Amr ibn Meymûne (75)'den; o da Abdullah ibn Mes'ûd'dan haber verdi. O şöyle demiştir; Rasûlüllah (sallallahü aleyhi ve sellem) secde ettiği sırada... H Buhârî dedi ki: Ve keza bana Ahmed ibn Usmân (260) tahdîs edip şöyle dedi: Bize Şurayh ibn Mesleme (222) tahdîs edip şöyle dedi: Bize İbrâhîm ibn Yûsuf (198), babasından; o da Ebû İshâk'tan tahdîs etti. O şöyle dedi: Bana Amr ibn Meymûn tahdîs etti. Ona da Abdullah ibn Mes'ûd şöyle tahdîs etmiştir: aleyhi ve sellem), Beyt'in yanında namaz kılıyordu. Ebû Cehl ile bâzı arkadaşları da oturuyorlardı. Derken onların biri diğerine: Fulan oğullarının (yeni kesilen) devesinin döl eşini hanginiz getirir de, secdeye vardığında onu Muhammed'in sırtına koyar? dedi. O topluluğun en şakî olanı seğirtip onu getirdi. Bekledi,Peygamber (sallallahü aleyhi ve sellem) secdeye varınca sırtının üzerine iki omuzu arasına koydu. Ben ise hiçbir işe yaramayarak bakıyordum. Keşki benim için men edici kuvvetler olaydı! İbn Mes'ûd dedi ki: Onlar gülmeğe ve birbirine isnâd etmeğe başladılar. Rasûlüllah ise secdeden başını kaldırmıyordu. Nihayet Fâtıma yanına geldi ve onu sırtından attı. Rasûlüllah başını kaldırdı.(Namazı bitirdikten) sonra üç defa: \"Yâ Allah! Kureyş'i sana havale ederim\" dedi. Rasûlüllah onlara beddua edince, bu onlara ağır geldi. İbn Mes'ûd der ki: Çünkü onlar bu şehirde duanın kabul edilecek olduğuna kaail idiler. Ondan sonra Rasûlüllah isim sayarak: \"Yâ Allah Ebû Cehl'i sana havale ederim; Utbe ibn Rabîa'yı, Şeybe ibn Rabîa'yı, Velîd ibn Utbe'yi, Umeyye ibn Halef'i, Ükbe ibn Ebî Muayt'ı sana havale ederim\" dedi. Yedinciyi de saydı, fakat biz onu zabt edemedik. İbn Mes'ûd der ki: Nefsim elinde bulunan Allah'a yemîn ederim ki, Rasûlüllah'ın saydığı isimlerin sahihlerini Kalîb'de, yânı Bedir çukurunda yere serilmiş gördüm",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 241,
			"arabicnumber": 241,
			"text": "Bize Sufyân (es-Sevrî), Humeyd'den; o da Enes'ten tahdîs etti. Enes (radıyallahü anh): Peygamber(sallallahü aleyhi ve sellem) elbisesinin içine tükürdü... demiştir. (Buhârî dedi ki:) Bu hadîsi İbnu Ebî Meryem (224), uzun uzadıya zikredip şöyle dedi: Bize Yahya ibn Eyyûb (168) haber verip şöyle dedi: Bana Humeyd tahdîs edip: Ben (bu hadîsin benzerini) Peygamberden olmak üzere Enes'ten işittim, dedi",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 242,
			"arabicnumber": 242,
			"text": "Bize Zuhrî, Ebû Seleme'den; o da Âişe'den tahdîs etti ki,Peygamber (sallallahü aleyhi ve sellem): veren her içki haramdır\"buyurmuştur",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 243,
			"arabicnumber": 243,
			"text": "Bize Sufyân ibn Uyeyne, Ebû Hâzım(135)'dan haber verdi. O da Sehl ibn Sa'd es-Sâidî (91)'den işitmiştir(şöyle ki): Benimle Sehl'in arasında hiçbir kimse yok iken (yani birbirimize o kadar yakın bulunurken) insanlar Sehl'e: Peygamber(sallallahü aleyhi ve sellem)'in yarası ne ile tedâvî edildi? diye sordu. Buna cevaben Sehl şöyle dedi: Bunu benden ziyâde bilen kalmadı. Alî, kalkanı ile su getiriyor, Fâtıma da Peygamber'in yüzündeki kanı yıkıyordu. Ve(sonra) bir hasır parçası alınıp yakıldı ve yarası onunla dolduruldu",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 244,
			"arabicnumber": 244,
			"text": "Ebû Mûsâ (radıyallahü anh) şöyle demiştir: Ben Peygamber(sallallahü aleyhi ve sellem)'in yanına vardım, O'nun, elindeki misvakla dişlerini sürtüp temizlediğini ve ağzında misvak olduğu hâlde öğürür gibi ‘u u' dediğini gördüm",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 245,
			"arabicnumber": 245,
			"text": "Bize Cerîr (ibn Abdilhamîd), Mansûr'dan; o da Ebû Vâil'den; o da Huzeyfe'den tahdîs etti. O: Peygamber (sallallahü aleyhi ve sellem) geceleyin kalkınca misvak ile ağzını sürtüp ovalardı, demiştir",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 246,
			"arabicnumber": 246,
			"text": "Ve bize Affân(ibn Müslim-220) şöyle dedi: Bize Sahr ibn Cuveyriye, Nâfi'den; o da İbn Omer'den tahdîs etti ki, Peygamber (sallallahü aleyhi ve sellem) şöyle buyurmuştur: \"Ru'yâda kendimi bir misvak ile dişlerimi ovalıyorum gördüm. Yanıma, birisi diğerinden daha yaşlı olan iki kimse geldi. Ben misvakı onların küçük olanına uzattım. Bana: Büyüğüne ver, denildi. Ben de misvakı büyüğüne verdim\". Abdillah el-Buhârî der ki: Bu metni, Nuaym ibn Hammâd, Abdullah ibn Mübârek'ten; o da Usâme ibn Zeyd el-Leysî'den; o da Nâfi'den; o da ibn Omer'den olmak üzere kısa olarak rivayet etmiştir",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 247,
			"arabicnumber": 247,
			"text": "Berâ ibn Âzib(radıyallahü anh) şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem) bana şöyle buyurdu: yere vardığın zaman namaz için abdest alışın gibi abdest al, sonra sağ tarafın üzerine yat. Sonra: eslemtu vechî ileyke ve fevvadtu emri ileyke. Ve el-ce'tu zahrî ileyke rağbeten ve rahbeten ileyke. La melcee velâ mencâ minke illâ ileyke. âmentu bi-kitâbike'llezî enzelte ve nebiyyike’llezî erselte. Yâ Allah, kendimi sana teslim ettim. İşimi Sana bıraktım. Arkamı Sana dayadım. Çünkü ümîdim de ancak Sen'dendir. Sen’den sığınacak yer yine Sen’sin, Sen'den kurtulacak yer de yine Sen'sin. Allah, indirdiğin Kitabına ve gönderdiğin Peygamberine îmân ettim! De. Şayet o gece ölecek olursan fıtrat (yani İslâm Dîni) üzere ölürsün. Sen bu sözleri, söyleyeceğin sözlerin sonuncusu yap\". der ki: Ben bu sözleri Peygamber'in huzurunda tekrar ettim. \"Allâhumme âmentu bi-kitâbikellezî enzelte\"ye varınca \"Ve Rasûlike'llezî erselte\" dedim. Rasûlüllah:\"Hayır (Ve Rasûlike... deme, fakat) 'Ve nebiyyike'llezî erselte'\" buyurdu",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 113
			}
		}
	]
}