{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"42": "Distribution of Water"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2351,
			"arabicnumber": 2351,
			"text": "Sehl İbn Sa'd r.a. şöyle anlatır: Resulullah Sallallahu Aleyhi ve Sellem'e bir bardak (su veya süt) getirilmiş ve Efendimiz Sallallahu Aleyhi ve Sellem ondan bir miktar içmişti. Hz. Nebi sağında bir genç, solunda ise ihtiyarlar bulunuyordu. Resul-i Ekrem Sallallahu Aleyhi ve Sellem genc'e, \"Ey genç! İzin verirsen bunu yaşlılara ikram edeyim\" buyurdu. Genç de, \"Ey Allah'ın Resulü! Senin artığını içme şerefi konusunda hiçbir kimseyi kendime tercih edemem\" dedi. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem bardağı o gence verdi. Tekrar: 2366. 2451, 2602, 2605, 5620",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2352,
			"arabicnumber": 2352,
			"text": "Zühri'nin naklettiğine göre Enes İbn Malik şöyle anlatmıştır: Resulullah Sallallahu Aleyhi ve Sellem için bir ağıl (otlakta beslenmeyen) koyunun sütü sağılmıştı. Bu sırada Efendimiz Sallallahu Aleyhi ve Sellem Enes İbn Malik r.a.'ın evinde idi. Enes'in evinde, sütün içine bir miktar kuyu suyu karıştırıldı. Daha sonra bir bardak içinde Resulullah Sallallahu Aleyhi ve Sellem'e ikram etti. O (Sallallahu aleyhi ve Sellem) süt’ten bir miktar içti. Bardağı ağzından ayırdığı zaman solunda Ebu Bekir, sağında ise bir bedevi vardı. Bu sırada Ömer, Resulullah'ın, bardağı bedeviye vermesinden endişe ederek hemen, \"Ey Allah'ın Resulü! Bardağı, yanınızda bulunan Ebu Bekir'e veriniz\" dedi. Resulullah Sallallahu Aleyhi ve Sellem ise, sağ tarafında bulunan bedeviye vererek, \"Öncelik sağ taraftadır\" buyurdu. Tekrarı: 2571, 5612, 5619",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2353,
			"arabicnumber": 2353,
			"text": "Ebu Hureyre r.a.'in rivayet ettiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Meradaki herkesin yararına açık olan otların büyümesine engel olacak şekilde ihtiyaçtan fazla olan su'dan istifade edilmesi engellenemez. \" Tekrar: 2353, 6962",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2354,
			"arabicnumber": 2354,
			"text": "Ebu Hureyre r.a.'in rivayet ettiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"İhtiyaç fazlası su'dan yararlanılmasına engel olmayın. Çünkü aksi halde ihtiyaç fazlası atlardan istifade edilmesine engel olmuş olursunuz",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2355,
			"arabicnumber": 2355,
			"text": "Ebu Hureyre r.a'den rivayet edildiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Madenierin, kuyuların ve hayvanların verdiği zararlar tazmin edilmez. Rikazın beşte birini (humus) vermek gerekir",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2357,
			"arabicnumber": 2357,
			"text": "",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2358,
			"arabicnumber": 2358,
			"text": "Ebu Hureyre r.a.'in naklettiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Kıyamet günü Allah (c.c) şu üç grup insanın yüzüne bakmaz, onları temize çıkarmaz. Onlar için acıklı bir azap vardır: Bunlardan birincisi, yolculukta iken ihtiyacından fazla suyu bulunduğu halde onu diğer yolculardan sakınan kimsedir. İkincisi, devlet başkanına (halife) dünyalık için bey'at edip, dünyalık bir şey verdiği zaman ondan razı olan, vermediği zaman da ona buğzeden kimsedir. Üçüncüsü ise, ikindiden sonra malını pazara çıkarıp da 'Kendisinden başka ilah bulunmayan Allah'a yemin olsun ki bu mala şu kadar fiyat verildi\" diyerek insanların onu kabul ettiği (ve alış veriş yaptığı) kimsedir. Nebi Sallallahu Aleyhi ve Sellem daha sonra şu ayeti okumuştur:",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2359,
			"arabicnumber": 2359,
			"text": "Urve'nin naklettiğine göre Abdullah İbnü'z-Zübeyr r.a. şöyle anlatır: Ensarlı bir kimse, Harre denilen yerdeki hurmalıkları sulama hakkı ile ilgili olarak Zübeyr ile çekişti. Ensarlı, \"Suyu bırak da (benim bahçeme) gelsin\" dedi. Zübeyr de bunu yapmadı. Daha sonra davayı Resulullah Sallallahu Aleyhi ve Sellem'e götürdüler. Efendimiz Sallallahu Aleyhi ve Sellem Zübeyr'e, \"Ey Zübeyr sen sula, daha sonra da suyu komşuna bırak\" buyurdu. Ensarlı öfkelenerek, ''O senin halanın oğlu olduğu için mi (sulama hakkını ona verdin)?\" diye sordu. Bunun üzerine Hz. Nebi'in yüzünün rengi değişti ve \"Ey Zübeyr! Sen sula. Su ağaçların köküne ulaşıncaya kadar da bırakma\" buyurdu. Zübeyr şöyle demiştir: \"Vallahi, ben şu ayetin [Nisa, 65] bu konu hakkında nazil olduğu kanaatindeyim\": \"Hayır, Rabbine andolsun ki aralarında çıkan anlaşmazlık hususunda seni hakem kılıp sonra da verdiğin hükmü, içlerinde hiçbir sıkıntı duymaksızın (onu) tam anlamıyla kabullenmedikçe iman etmiş olmazlar. \" Tekrar: 2361, 2362, 2708, 4585",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2361,
			"arabicnumber": 2361,
			"text": "Urve şöyle nakletmiştir: Zübeyr ensarlı bir sahabi ile (sulama hakkı) konusunda çekiştiği zaman Nebi Sallallahu Aleyhi ve Sellem, \"Ey Zübeyr sen sula, daha sonra bırak\" buyurdu. Ensarlı öfkelenerek, \"O senin halanın oğlu olduğu için mi (sulama hakkını ona verdin)?'' diye sordu. Bunun üzerine Hz. Nebi: \"Ey Zübeyr! Sen sula. Su ağaçların köküne ulaşıncaya kadar da bırakma. Daha sonra bırak\" buyurdu. Zübeyr şöyle demiştir: \"Vallahi, ben şu ayetin [Nisa, 65] bu konu hakkında nazil olduğu kanaatindeyim\": \"Hayır, Rabbine andolsun ki aralarında çıkan anlaşmazlık hususunda seni hakem kılıp sonra da verdiğin hükümden içlerinde hiçbir sıkıntı duymaksızın (onu) tam anlamıyla kabullenmedikçe iman etmiş olmazIar\" Tekrar: 2361, 2362, 2708, 4585",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2362,
			"arabicnumber": 2362,
			"text": "Urve İbn Zübeyr şöyle nakletmiştir: Zübeyr r.a. ensarlı bir sahabi ile (sulama hakkı) konusunda çekiştiği zaman Nebi Sallallahu Aleyhi ve Sellem, \"Ey Zübeyr sen sula, daha sonra bırak\" buyurdu ve ona, örfe uygun hareket etmesini emretti. Ensarlı sahabi, \"O senin halanın oğlu olduğu için mi (sulama hakkını ona verdin)?\" diye sordu. Bunun üzerine Hz. Nebi: \"Ey Zübeyr' Sen sula. Su ağaçların köküne ulaşıncaya kadar da bırakma. Daha sonra bırak\" buyurarak onun hakkını aldı. Zübeyr şöyle demiştir: \"Vallahi, ben şu ayetin [Nisa, 65] bu konu hakkında nazil olduğu kanaatindeyim\": \"Hayır, Rabbine andolsun ki aralarında çıkan anlaşmazlık hususunda seni hakem kılıp sonra da verdiğin hükümden içlerinde hiçbir sıkıntı duymaksızın (onu) tam anlamıyla kabullenmedikçe iman etmiş olmazlar.\" İbn Şihab bana şöyle dedi: Bunun üzerine ensarlılar ve diğer kimseler, Nebi Sallallahu Aleyhi ve Sellem'in, \"Sen sula. Su ağaçların köküne ulaşıncaya kadar da bırakma\" sözündeki sulama ölçüsünün ne olduğunu anlamak için araziyi incelediler. Su ayak topuklarına kadar ulaşmıştı",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2363,
			"arabicnumber": 2363,
			"text": "Ebu Hureyre r.a.'in rivayet ettiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Bir kimse yolculuk yapıyordu. Birden çok susadı ve bir kuyuya inerek su içti. Kuyudan çıktığı zaman bir de ne görsün?' Susuzluğundan dolayı soluyan ve toprağı yalayan bir köpek. Adam, 'Anlaşılan benim başıma gelen bu köpeğin başına da gelmiş, susamış' dedi ve hemen (kuyuya inip) ayakkabısını suyla doldurdu. Ayakkabıyı ağzına aldı ve o şekilde yukarı çıktı, köpeğe su verdi. Allah da onu, bu yaptığından dolayı ödüllendirdi ve bağışladı.\" Sahabiler, \"Ey Allah'ın Resulü' Hayvanlara yaptığımız iyiliklerden (onlara su vermek gibi) dolayı bize ecir var mı?\" diye sordu. Efendimiz Sallallahu Aleyhi ve Sellem, \"Canlı ciğeri bulunan her şeyden dolayı ecir vardır\" buyurdu",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2364,
			"arabicnumber": 2364,
			"text": "Esma binti Ebu Bekir r.anha şöyle anlatır: Resulullah Sallallahu Aleyhi ve Sellem güneş tutulması namazını (küsuf) kıldıktan sonra, \"Bana cehennem yaklaştlrlldı. Hatta 'Ey Rabbim! Ben de cehennemliklerle birlikte mi olacağım?' diye sordum. Bir de gördüm ki orada bir kadın var. (Zannederim, Resulullah \"kedi onun yüzünü tırmalıyordu\" demişti.) Bu kadın neden bu haldedir dedim. Bana, 'Kadın o kediyi hapsetmiş ve kedi bu yüzden açlıktan dolayı ölmüştü' dediler",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2365,
			"arabicnumber": 2365,
			"text": "Abdullah İbn Ömer r.a.'in naklettiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Bir kediyi açlıktan ölünceyekadar hapseden kadına bu yüzden azap edilmiş ve cehenneme girmiştir. -Allah en iyisini bilir.- (Cehennem meleği ona), Sen o kediye yiyecek vermedin, su vermedin üstelik bırakıvermedin bile. Bıraksaydın yeryüzünde bulduğu şeylerden yerdi.\" Tekrar: 3318, 3482",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2366,
			"arabicnumber": 2366,
			"text": "Sehl bin Sa'd r.a. şöyle anlatır: Resulullah Sallallahu Aleyhi ve Sellem'e bir bardak (su veya süt) getirilmiş ve Efendimiz Sallallahu Aleyhi ve Sellem ondan bir miktar içmiştL Hz. Nebi'in sağında bir genç, solunda ise ihtiyarlar bulunuyordu. Genç, topluluktaki en küçük kimse idi. Resul-i Ekrem sallallahu aleyhi ve selle m gence, \"Ey genç' İzin verirsen bunu yaşlılara ikram edeyim\" buyurdu. Genç de, \"Ey Allah'ın Resulü Senin artığını içme şerefi konusunda hiçbir kimseyi kendime tercih edemem\" dedi. Bunun üzerine Hz. Nebi Sallallahu Aleyhi ve Sellem bardağı o gence verdi",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2367,
			"arabicnumber": 2367,
			"text": "Ebu Hureyre r.a.'in naklettiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Nefsim elinde olan (Allah)'a yemin olsun ki, ben (kıyamet günü), tıpkı yabancı develerin havuz başında kovulduğu gibi bazı kimseleri havuzumdan kovacağım",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2368,
			"arabicnumber": 2368,
			"text": "İbn Abbas r.a.'ın naklettiğine göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Allah İsmail'in annesine (Hacer) merhamet etsin. Eğer zemzemi kendi haline bıraksaydı zemzem bir akarsu olacaktı. Cürhümlüler Mekke'ye gelmişler ve Hacer'den, \"Burada konaklamamıza izin verir misin?\" demişlerdi. Hacer, \"Evet, fakat suda mülkiyet hakkınız yoktur\" diye cevap verdi. Bunun üzerine Cürhümlüler \"evet\" diyerek bu şartı kabul etmişlerdir. \" Tekrar: 3362, 3363, 3364, 3365",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2369,
			"arabicnumber": 2369,
			"text": "Ebu Hureyre r.a. Resulullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu rivayet eder: \"Üç grup insan var ki Allah (c.c) (kıyamet günü) bunlarla konuşmaz ve yüzlerine bakmaz: (Birincisi), müşteriye, malına, onun verdiği bedelden daha fazlasını bir başkasının verdiğine dair yalan yere yemin eden kimsedir. (İkincisi), ikindiden sonra (pazara çıkıp) başkalarının malını haksızca almak amacıyla yalan yere yemin eden kimsedir. (Üçüncüsü), ihtiyacından fazla olan suyu başkalarına vermeyen kimsedir. Allah bu kimseye (kıyamet günü) şöyle der: 'Bugün ben de senden lutuf ve ihsanımı esirgiyorum. Çünkü sen kendi ellerinle imal etmediğin (ihtiyacından fazla olan) suyu başkalarından esirgemiştin'’",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2370,
			"arabicnumber": 2370,
			"text": "İbn Abbas r.a.'ın naklettiğine göre es-Salb İbn Cesame r.a. şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Bütün koruluklar Allah'a ve Resulüne aittir.\" Buhari, \"Bize, Hz. Nebi'in, en-Naki' bölgesini, Hz. Ömer'in de, eş-Şeref ve Rebeze bölgesini koruluk haline getirdiği bilgisi ulaşmıştır\" demiştir. Tekrar: 3013",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2371,
			"arabicnumber": 2371,
			"text": "Ebu Hureyre r.a.'in rivayet ettiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"At; bir kimse için sevap; bir kimse için (fakirliğe karşı) bir örtü; bir kimse için de günahtır: Sevap olması, atını Allah yolunda tahsis eden kimse içindir. Atını, otlağı bol geniş bir araziye veya geniş bir bahçeye uzun bir iple bağlamıştır. At otlardan veya bahçeden yedikçe bunlar sahibi için birer hasene (sevap) olur. Hele bir de ipini koparıp da bir veya iki yüksek tepede koştursa, yaptığı izler ve gübreleri sahibi için sevap olur. Bir nehre varıp da su içse, sahibi onu sulamayı istememiş olsa bile bu da onun için bir sevap olur. İşte bu sebeple, at o kimse için sevap (kaynağı) olur. Örtü olması; atını, insanlara muhtaç olmadan onurlu bir şekilde yaşamak arzusu içinde (kazanç) amacıyla kullanan kimse içindir. Bu kimse sahip olduğu otlarla ilgili olarak Allah hakkını (zekat) ve haddinden fazla yük taşıtmamayı gözettiği için at onun için, (fakirliğe karşı) bir örtü niteliğindedir. Günah olması, atını, insanlara karşı övünme, gösteriş ve müslümanlara karşı düşmanlık amacıyla kullanan kimse hakkındadır. Bu at onun için günah kaynağıdır. \" Nebi Sallallahu Aleyhi ve Sellem'e, eşeklerin durumu sorulduğu zaman Efendimiz sallallahu aleyhi vesellem, \"Bana bu konuda, sorunuzu da kapsayan şu veciz ayetlerden [Zilzal, 7-8] başka bir şey indirilmedi: 'Kim zerre kadar bir hayır işlerse onun karşılığını görecektir. Kim de zerre kadar şer işlerse onun karşılığını görecektir' şeklinde cevap vermiştir. Tekrar: 2860, 3646, 4962, 4963, 7356",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2372,
			"arabicnumber": 2372,
			"text": "Zeyd İbn Halid el-Cüheni r.a. şöyle anlatır: Bir adam Nebi Sallallahu Aleyhi ve Sellem'e gelerek \"lukata\" (buluntu mal) hakkında soru sordu. Resulullah Sallallahu Aleyhi ve Sellem ona, \"Buluntu malın kılıfını ve kapağını iyi öğren. Sonra da bir mal bulduğunu bir yıl boyunca insanlara ilan et. Sahibi gelirse ver, aksi halde sana kalmış.\" Adam, \"buluntu davarlar\" hakkında ne buyurursunuz\" diye sordu. Nebi Sallallahu Aleyhi ve Sellem, \"O, ya senindir, ya kardeşinindir, ya da kurtlarındır\" buyurdu. Adam, \"buluntu develer\" hakkında ne buyurursunuz\" diye sordu. Efendimiz Sallallahu Aleyhi ve Sellem, \"Ona karışma. Onun hörgücünde suyu, ayağın da ayakkabısı var. Sahibi onu buluncaya kadar suyunu içer, ağaçlardan yer\" buyurmuştur. BİLGİ: Bu konuda geniş açıklama, Cihad Bölümü, 48. konu, 2860. hadiste yapılacaktır. باب: بيع الحطب والكلأ. 13. ODUN VE OT SATMAK",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2373,
			"arabicnumber": 2373,
			"text": "Zübeyr İbn Avvam r.a.'ın rivayet ettiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Sizden birinin, bir urgan alıp bir bağ odun toplayıp satması, böylece Allah'ın onun alnını ak bir şekilde yaşatması, istediği şey verilsin ya da verilmesin, insanlardan dilenmesinden daha hayırlıdır",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2374,
			"arabicnumber": 2374,
			"text": "Ebu Hureyre r.a.'in rivayet ettiğine göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Sizden birinin,sırtında bir bağ odun taşıması, insanlardan dilenmesinden daha hayırlıdır. İstediği şeyi ister versinler, isterse vermesinler durum böyledir",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2375,
			"arabicnumber": 2375,
			"text": "Ali İbn Ebu Talib r.a. şöyle anlatır: Bedir savaşının ganimetleri dağıtıldığı sırada bana yaşlı bir deve düşmüştü. Resulullah Sallallahu Aleyhi ve Sellem bana, yaşlı bir deve daha verdi. Birgün bu iki deveyi, ensarlı bir kimsenin kapısının önünde çöktürmüştüm. Satmak amacıyla deve ile izhir otu taşımak istiyordum. Yanımda da Beni Kaynuka'lılardan bir sarraf vardı. Elde edeceğim kazançla Fatima'nın düğün yemeğine yardım etmek istiyordum. Hamza İbn Abdülmuttalib r.a. de bu evde, yanında bir şarkıcı kadın ile beraber (içki) içiyordu. Bu sırada kadın, \"Ey Hamza! Şu semiz develere bak\" şeklinde başlayan şiiri okudu. Bunun üzerine Hamza fırladı ve kılıcı ile devenin hörgüçlerini kopardı, belini yardı, ciğerlerinden bir parça aldı. İbn Şihab'a, \"Hörgüçlerini de mi?\" diye sordum. \"Evet, hörgüçlerini de\" diye cevap verdi. Daha sonra gitti. Beni şaşkınlık içinde bırakan bu manzarayı izledikten sonra Nebi Sallallahu Aleyhi ve Sellem'e gittim. Yanında Zeyd İbn Harise r.a. vardı. Olanları anlattım. Resulullah Sallallahu Aleyhi ve Sellem, Zeyd r.a. ile birlikte çıktı. Ben de onlara katıldım. Hamza r.a.'ın yanına girdi ve ona kızdı. Hamza r.a. gözünü kaldırdı ve: \"Siz benim dedelerimin köleleri değil misiniz?\" dedi. Bunun üzerine Resul-i Ekrem geri çekilerek döndü ve oradan çıktı. Bu olay, henüz şarap haram kılınmadan önce gerçekleşti",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2376,
			"arabicnumber": 2376,
			"text": "Yahya İbn Said, \"Enes'i şöyle söylerken işittim\" demiştir: Resulullah Sallallahu Aleyhi ve Sellem Bahreyn'in bir kısmını ensarlılara tahsis (ikta') etmek istedi. Bunun üzerine ensarlı müslümanlar, \"Bize verdiğin gibi muhacir kardeşlerimize de vermen şartıyla (kabul ederiz)\" dediler. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem, \"Ben aranızdan ayrıldıktan sonra, insanların ene’ye (bencillik’e) düştüğünü göreceksiniz. Bu durumda bana kavuşana kadar sabredin\" buyurmuştur. Tekrar: 2377, 3163, 3793",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2377,
			"arabicnumber": 2377,
			"text": "Enes r.a. şöyle anlatır: Resulullah Sallallahu Aleyhi ve Sellem, Bahreyn'i ikta' olarak vermek üzere ensarlıları çağırmıştl. Ensarlılar, \"Ey Allah'ın Resulü! Eğer böyle yapacak isen, Kureyşli kardeşlerimiz için de bir benzerini yaz (onlara da ver)\" dediler. Fakat Hz. Nebi'de bu kadar arazi yoktu. Bunun üzerine \"Ben aranızdan ayrıldıktan sonra, insanların Ene’ye (bencillik’e) düştüğünü göreceksiniz. Bu durumda bana kavuşana kadar sabredin\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2378,
			"arabicnumber": 2378,
			"text": "Ebu Hureyre r.a.'in rivayet ettiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Deve üzerindeki haklardan biri de su başlarında sağılmasıdır",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2379,
			"arabicnumber": 2379,
			"text": "Salim İbn Abdullah'ın naklettiğine göre babası şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem'i şöyle buyururken işittim: \"Bir kimse, hurmaları aşıladıktan sonra ağaçlarını satarsa, müşteri ayrıca kendisine ait olmasını şart koşmadıkça, meyveleri satıcıya ait olur. Bir kimse köle sattığı zaman, müşteri şart koşmadıkça köleye ait olan mallar da satıcıya ait olur",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2380,
			"arabicnumber": 2380,
			"text": "İbn Ömer'in, Zeyd İbn Sabit'ten naklettiğine göre, Resulullah Sallallahu Aleyhi ve Sellem, ariyyelerin, ne kadar meyve vereceğini tahmin suretiyle satılmasına izin vermiştir",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2381,
			"arabicnumber": 2381,
			"text": "Cabir İbn Abdullah r.a. şöyle demiştir: Nebi Sallallahu Aleyhi ve Sellem, muhabera, muhakale, müzabene yoluyla satışı ve kızarıp tatlanmadan önce meyvelerin satımını yasaklamıştır. Bunların, ancak dinar ya da dirhem karşılığında satılmasını emretmiştir. Fakat bu hükümden sadece ariyye satışı müstesnadır",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2382,
			"arabicnumber": 2382,
			"text": "Ebu Hureyre r.a. şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem, beş veskten aşağı olmak şartıyla, tahmin yöntemiyle ariyye satışı yapılmasına izin vermiştir. Ravi Davud, ifadenin, \"beş veskte\" şeklinde olabileceği konusunda şek (şüphe) etmiştir",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2383,
			"arabicnumber": 2383,
			"text": "Rafi' İbn Hadlc ve Sehl İbn Ebi Hasme r.a. şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem, müzabene satışını ve meyvenin kuru hurma karşılığında satılmasını yasaklamıştır. Ancak ariyye uygulamasında bulunanlara bu konuda izin vermiştir",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 31
			}
		}
	]
}