{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"43": "Loans, Payment of Loans, Freezing of Property, Bankruptcy"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2385,
			"arabicnumber": 2385,
			"text": "Cabir İbn Abdullah r.a. şöyle anlatır: Resulullah ile birlikte bulunduğum bir gazvede idim. Efendimiz Sallallahu Aleyhi ve Sellem bana, \"Deveni satmaya ne dersin?\" buyurdu. Ben de, \"Evet\" diyerek ona sattım. Medine'ye vardığı zaman deveyi ona götürdüm, o da bana bedelini verdi",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2386,
			"arabicnumber": 2386,
			"text": "Aişe r.anha şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem bir yahudiden vadeli olarak bir miktar yiyecek maddesi satın almış, demir zırhını ona rehin olarak vermiştir",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2387,
			"arabicnumber": 2387,
			"text": "Ebu Hureyre r.a.'in rivayet ettiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"İnsanlann malını ödeme niyetiyle alan kimseye Allah (borcunu) ödettirir. Telef etmek (ödememek) niyetiyle alan kimsenin malını ise telef ettirir",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2388,
			"arabicnumber": 2388,
			"text": "Ebu Zer' r.a. şöyle anlatır: Resulullah Sallallahu Aleyhi ve Sellem ile birlikte bulunuyordum. Uhud dağını görünce, \"Uhud dağının benim için altına dönüşmesini; o altınlan üç günden daha fazla bekletmek istemem. Fakat borç ödemek için kenarda tutacağım bir dinar hariç. Malı çok olanların sevabı azdır. Malını infak edenler bundan müstesnadır. Fakat böyleleri de pek azdır.\" Bu arada Efendimiz Sallallahu Aleyhi ve Sellem bana, \"Ben gelene kadar olduğun yerde dur\" dedi. Geri geldiği zaman \"Ey Allah'ın Resulül Duyduğum (ses) neydi?\" diye sordum. Bana, \"Sen de işittin mi?\" diye sordu. Ben de, \"evet\" dedim. Bana şöyle dedi: \"Cebrai! bana geldi ve 'Ümmetinden Allah'a hiçbir şeyi ortak koşmadan ölen kimse cennete girecek' dedi. Ben de \"şunları şunları (büyük günahları) yapanlar da mı?\" diye sordum. Nebi Sallallahu Aleyhi ve Sellem, \"evet\" dedi",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2389,
			"arabicnumber": 2389,
			"text": "Ebu Hureyre r.a.'in rivayet ettiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Uhud dağı kadar altınım olsa, üç günden daha fazla bir süre o altınların yanımda kalması beni sevindirmezdi. Sadece borç ödemek üzere tuttuklarım hariç.\" Bu hadisi, Salih ve Ukayl, Zühri'den rivayet etmiştir",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2390,
			"arabicnumber": 2390,
			"text": "Ebu Hureyre r.a. şöyle anlatır: Bir adam, Nebi Sallallahu Aleyhi ve Sellem'den alacağını talep etti ve biraz sert ve kaba davrandı. Sahabiler, o adamı (durdurmak) için yöneldiler. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem, \"Onu bırakın, hak sahibinin konuşmaya hakkı vardır. Bir deve satın alın da verin ona\" buyurdu. Sahabiler, \"Sadece onun verdiğinden daha değerli olan (yaşı daha büyük) deve bulabildik\" dediler. Efendimiz (Sallallahu aleyhi ve Sellem), \"Onu satın alın ve verin, çünkü sizin en hayırlınız borcu en güzel şekilde ödeyeninizdir\" buyurdu. Hadisten Çıkarılan Sonuçlar Hak sahibinin, hakkını isterken meşru edeb sınırları içinde davranması gerekir. Vadesi gelmiş ise alacağı istemek caizdir. Bu hadiste, Hz. Nebi'in sahip olduğu güzel ahlakı, yumuşak huyluluğu, tevazuyu ve insafını görmekteyiz. Borçlu kimseye, alacaklıya karşı kaba davranması uygun düşmez. Devlet başkanı, kendisine karşı edebe aykırı davranışta bulunanlara tazir cezası vermelidir. Ancak hak sahiplerini bağışlaması gerekir. Deve borç (karz) alınabilir. Bu hükme bütün hayvanlar dahildir. Alimlerin çoğu bu görüştedir. Sevri'ye ve Hanefilere göre hayvanlar karz olarak alınamaz. Bu konudaki delil, hayvan karşılığında hayvanın vadeli olarak satımını yasaklayan hadistir. Bu hadisi, İbn Abbas \"merm\" olarak rivayet etmiştir. İbn Hibban, Darekutnı ve başka bazı alimler de nakletmiştir. Hadiste geçen raviler güvenilirdir. Genelolarak, delil getirmeye elverişli bir hadis olduğu söylenebilir. Karz akdinde şart koşulmadığı sürece, borcu, alınandan daha iyisi ile ödemek caizdir. Eğer şart koşulursa bunun haram olacağında ittifak bulunmaktadır. Alimlerin çoğunluğu bu görüştedir. Malikiler durumu biraz ayrıntılı bir şekilde ele alarak şöyle demişlerdir: Eğer aded olarak fazla ödenirse bu yasaktır. Fakat nitelik olarak daha iyisi ile ödenirse caizdir. İyilik, Allah'a itaat vb. mubah konular için borçlanmak ayıplanacak bir durum değildir. Devlet başkanı, zekat mallarından ödemek üzere, ihtiyaç sahiplerinin ihtiyacını karşılamak amacıyla devlet hazinesi adına borçlanabilir. Şafiiler, zekatın, farz olma zamanından önce ödenebileceğine bu hadisi delil olarak getirmişlerdir. İbn Abdilberr bu şekilde nakletmiştir. Fakat bana bu görüşün dayanağı pek açık gelmedi. Fakat Resulullah'ın Sallallahu Aleyhi ve Sellem borç alması şu şekilde yorumlanabilir: Hz. Nebi, sadaka verilmesi gereken kimseler için borç almıştı. Sadaka malları gelince aldığı borcu, sahiplerine geri verdi. باب: حسن التقاضي. 5. ALACAĞIN GÜZEL BİR ŞEKİLDE İSTENMESİ",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2391,
			"arabicnumber": 2391,
			"text": "Huzeyfe r.a. Resulullah Sallallahu Aleyhi ve Sellem'i şöyle buyururken işittiğini söylemiştir: \"Bir adam ölmüştü. Ona, '(Dünyada iken) ne yapardın?' diye soruldu. Adam, 'Ben ticaretle meşgul idim. Ödeme gücü yeten kimselere kolaylık sağlar, ödeme gücü bulunmayan kimselerin de borcunu hafifletirdim , dedi. O kimse bu yüzden bağışlanmıştır. \" Ebu Mes'ud, bu hadisi, Hz. Nebi'den işittiğini söylemiştir",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2392,
			"arabicnumber": 2392,
			"text": "Ebu Hureyre r.a. şöyle anlatır: Bir adam gelerek Hz. Nebi'den olan deve alacağını talep etti. ResuluIlah Sallallahu Aleyhi ve Sellem, \"Onun alacağını verin\" buyurdu. Sahabiler, \"Ancak daha büyük yaşta bir deve bulabildik\" dediler. Adam, \"Sen bana alacağım ı fazlasıyla ver, Allah da sana fazlasıyla versin\" dedi. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem, \"Onu bu adama verin. Çünkü insanların en hayırlı olanlarından biri de (borcunu) en güzel şekildeödeyenlerdir\" buyurdu",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2393,
			"arabicnumber": 2393,
			"text": "Ebu Hureyre r.a. şöyle anlatır: Bir kimsenin, Resulullah Sallallahu Aleyhi ve Sellem'den, belirli bir yaşta bir deve alacağı vardı. Onu almak üzere geldi. Nebi (Sallallahu aleyhi ve Sellem), \"Bunu ona verin\" buyurdu. Sahabiler aynı yaşta bir deve bulmaya çalıştılar. Ancak buldukları develerin tamamı borç olan deveden daha büyük yaşta idi. Nebiimiz (Sallallahu aleyhi ve Sellem), \"Bunu (daha büyük yaştaki deveyi) o kimseye verin\" buyurdu. Adam, \"Sen bana alacağımı fazlasıyla verdin, Allah da sana fazlasıyla versin\" dedi. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem, \"Sizin en haylrlınız (borcunu) en güzel şekilde ödeyeninizdir\" buyurdu",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2394,
			"arabicnumber": 2394,
			"text": "Cabir İbn Abdullah r.a. şöyle anlatır: Resulullah Sallallahu Aleyhi ve Sellem mescidde iken onun yanına gittim. Ravi Mis'ar, kendisine nakleden kimsemin, 'kuşluk vaktiydi' dediğini zannediyorum' diye belirtmiştir.- Nebi Sallallahu Aleyhi ve Sellem bana, \"İki rekat namaz kıl\" buyurdu. Benim ondan bir miktar alacağım vardı. Bana. bunu ödedi. Biraz da fazla verdi. باب: إذا قضى دون حقه أو حلله فهو جائز. 8. (ALACAKLıNIN RIZASI İLE) BORCUN EKSİK ÖDENMESİ VE ALACAKLININ ALACAĞINI HELAL ETMESİ CAİZDİR",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2395,
			"arabicnumber": 2395,
			"text": "Cabir bin Abdullah (r.a.) şöyle anlatır: Babam Abdullah, Uhud savaşında şehit edildi. O sırada borcu bulunuyordu. Alacaklılar alacaklarını tahsil edebilmek için çok sıkıştırdılar. Ben de Resulullah Sallallahu Aleyhi ve Sellem'e gidip durumu anlattım. Nebi Sallallahu Aleyhi ve Sellem onlardan, alacaklarına karşılık bahçemde yetişmekte olan hurma meyvelerini kabul etmelerini ve babamdaki haklarını helal etmelerini istedi. Ancak bunu kabul etmediler. Resulullah da hurmalarımı vermedi. Bana, \"Sana uğrayacağım\" dedi. Ertesi sabah bize geldi. Hurmalığı bir dolaştı daha sonra bereketli olması için dua etti. Hemen hurmaları topladım ve borcu ödedim. Hatta bir miktar hurma da bize kaldı",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2396,
			"arabicnumber": 2396,
			"text": "Vehb İbn Keysan'ın, Cabir bin Abdullah (r.a.)'dan naklettiğine göre; Cabir'in babası, üzerinde bir yahudiye karşı otuz vesk borç bulunduğu halde vefat etmişti. Cabir ondan bir süre beklemesini istedi. Adam beklemeyi kabul etmedi. Bunun üzerine Cabir, aracılık yapması için Nebi Sallallahu Aleyhi ve Sellem ile konuştu. Resulullah Sallallahu Aleyhi ve Sellem geldi ve yahudi ile alacağına karşılık Cabir'e ait hurmalıktaki hurmaları alması için konuştu. Adam yine kabul etmedi. Daha sonra Resul-i Ekrem, hurmalığa girdi ve bir süre yürüdü. Daha sonra Cabir'e, \"Hurmaları topla ve borcu öde\" buyurdu. Resulullah Sallallahu Aleyhi ve Sellem döndükten sonra Cabir hurmaları topladı ve otuz vesk olan borcu ödedi. On yedi vesk de artmıştı. Cabir olanları anlatmak üzere Nebiimize geldiği zaman ikindi namazını kılıyordu. Namazı bitirince artan hurmaları Efendimiz'e anlattı. Nebi (s.a.v.) ona, \"Bu olayı git Ömer'e haber ver\" buyurdu. Cabir gitti ve durumu Ömer'e anlattı. Ömer ona, \"Bildim ki, Resulullah Sallallahu Aleyhi ve Sellem orada yürüdüğü sırada hurmalığın bereketlenmiş\" dedi",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2397,
			"arabicnumber": 2397,
			"text": "Urve'nin naklettiğine göre Aişe r.anha şöyle anlatır: Resulullah Sallallahu Aleyhi ve Sellem namazda, \"Allah'ıml Günahtan ve borçluluktan sana sığınırım\" diye dua ederdi. Bir kimse Nebi Sallallahu Aleyhi ve Sellem'e, \"Ey Allah'ın Resulü' Borçluluktan dolayı Allah'a ne kadar çok sığınıyorsunuz böyle?\" diye sordu. Efendimiz Sallallahu Aleyhi ve Sellem ona, \"Bir kimse borca girdiği zaman konuşunca yalan konuşur, söz verir sözünü tutmaz\" diyerek cevap vermiştir",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2398,
			"arabicnumber": 2398,
			"text": "Ebu Hureyre r.a. Nebi'in Sallallahu Aleyhi ve Sellem şöyle buyurduğunu rivayet etmiştir: \"Kim geride mal bırakarak ölürse o mal mirasçılarınındır. Kim de {bakıma muhtaç} aile bırakarak ölürse onlara bakmak da bize {devlete} aittir",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2399,
			"arabicnumber": 2399,
			"text": "Ebu Hureyre r.a.'in rivayet ettiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Ben, bütün mu'minlere dünya ve ahirette daha yakınım. İsterseniz şu ayeti okuyun. 'Nebi, mu'minlere kendilerinden daha yakındır. Hanımları da mu'minlerin anneleridir.' [Ahzaab 6] Bundan dolayı hangi mümin ölür de geride mal bırakırsa ona kim olursa olsun, asabesi mirasçı olur. Kim de borç ya da bakıma muhtaç bir aile bırakarak ölürse bana gelin. Çünkü onun velfsi benim",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2400,
			"arabicnumber": 2400,
			"text": "Vehb İbn Münebbih'in kardeşi Hemmam İbn Münebbih Ebu Hureyre r.a.'in şöyle dediğini işitmiştir. \"Resulullah Sallallahu Aleyhi ve Sellem, 'Ödeme gücü bulunan kimsenin borcunu geciktirmesi zulümdür' buyurdu",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2401,
			"arabicnumber": 2401,
			"text": "Ebu. Hureyre şöyle anlatır: Birgün Nebi Sallallahu Aleyhi ve Sellem'e bir adam, alacağını talep etmek üzere geldi. Bu sırada biraz sert davrandı. Sahabiler adamı uyarmak için yönelince Nebiimiz Sallallahu Aleyhi ve Sellem, \"Onu bırakın, hak sahibinin, hakkını dile getirme hakkı vardır\" buyurdu",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2402,
			"arabicnumber": 2402,
			"text": "Ebu Hureyre r.a., \"Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu veya Resulullah Sallallahu Aleyhi ve Sellem'den şöyle işittim\" demiştir: \"Malını iflas eden kişide aynen bulan kimse, diğer alacaklılardan önceliklidir",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2403,
			"arabicnumber": 2403,
			"text": "Cabir İbn Abdullah r.a. şöyle nakleder: Bir kimse kölesini müdebber kılmıştı. (Daha sonra bu kimse fakir düşmüştü.) Bunun üzerine Nebi (sallallahu aleyhi ve sellem), \"Bu köleyi kim benden satın alır?\" buyurdu. Ardından Nuaym köleyi satın aldı. Resulullah bedelini teslim alıp adama geri verdi",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2404,
			"arabicnumber": 2404,
			"text": "Ebu Hureyre r.a. şöyle demiştir: \"Resulullah Sallallahu Aleyhi ve Sellem, İsrailoğullarından bir kimsenin, yine İsrailoğullarından başka bir kimseden borç istediğini, onun da, bir vade belirleyerek borç verdiğini anlatmıştır.\" باب: الشفاعة في وضع الدين. 18. BORCUN İNDİRİLMESİ İÇİN ARACILIK",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2406,
			"arabicnumber": 2406,
			"text": "Allah bozgunculuğu sevmez. \" [Bakara, 205] - \"Allah bozguncuların işini düzeltmez. \"[Yunus, 81] - \"Dediler ki Ey Şuayb! Babalarımızın taptığı (putları) yahut mallarımız hususunda dilediğimizi yapmayı terketmemizi sana namazın mı emrediyor?\"[Hud, 87] - \"Sefihlere mallarınızı vermeyin.\"[Nisa, 5]",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2407,
			"arabicnumber": 2407,
			"text": "İbn Ömer r.a. şöyle nakleder: Bir kimse Resulullah'a gelip, \"Ben alım satımda aldatılıyorum\" dedi. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem ona, \"Alış veriş yaptığın zaman' 'Aldatma yok' de\" buyurdu. Bu kimse artık alış verişte hep böyle söylerdi",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2408,
			"arabicnumber": 2408,
			"text": "Muğire İbn Şu'be r.a.'in naklettiğine göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Allah size, analara karşı gelmeyi, kız çocuklarını diri diri öldürmeyi, borcunuzu ödememeyi, hakkınız olmayan şeyi almayı haram kıldı. Dedi kodu etmeyi, çok soru sormayı ve malı zayi etmeyi de kerih gördü",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2409,
			"arabicnumber": 2409,
			"text": "Abdullah İbn Ömer r.a. Resulullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu işitmiştir: \"Her biriniz çobansınız ve gözetiminiz altında bulunanlardan sorumlusunuz. Devlet başkanı bir çoban olup, halkından sorumludur. Kişi ailesi bakımından bir çoban olup, ailesinden sorumludur. Kadın da kocasının evinde çobandır ve kendisine tabi olan kimselerden sorumludur. Hizmetçi de efendisinin malının çobanıdır ve ondan sorumludur.\" Ben bunları Resulullah Sallallahu Aleyhi ve Sellem'den işittim. Zannediyorum bir de şöyle buyurdu: \"Kişi babasının malının çobanıdır ve bundan sorumludur. Hepiniz çobansınız ve hepiniz yönetiminiz altında bulunanlardan sorumlusunuz.\" BORÇ BÖLÜMLERİ BİTTİ. KİTABU’L-HUSUMAT BİR SONRAKİ SAYFADA BAŞLIYOR",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 24
			}
		}
	]
}