{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"45": "Lost Things Picked up by Someone (Luqatah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2426,
			"arabicnumber": 2426,
			"text": "Bize Şu'be tahdîs etti. H ve bana Muhammed ibn Beşşâr tahdîs edip şöyle dedi: Bize Ğunder tahdîs edip şöyle dedi: Bize Şu'be, Seleme'den tahdîs etti. O söyle demiştir: Ben Suveyd ibn Gafele'den işittim, o şöyle dedi: Ben Ubeyy ibn Ka'b (radıyallahü anh)'a kavuştum da o şöyle dedi: Ben bir kese (bulup) aldım; içinde yüz dînâr vardı. Akabinde Peygamber (sallallahü aleyhi ve sellem)'e geldim (ve söyledim). \"Onu bir sene bildirip ilân et\" buyurdu. Ben de bu keseyi bir sene ilân ettim. Fakat onu tanıyan kimseye tesadüf etmedim. Sonra Peygamber'e geldim. Peygamber: \"Bir sene (daha) bildir\" buyurdu. Onu bir sene daha ilân ettim. Fakat sahibini bulamadım. Sonra üçüncü defa Peygamber'e geldim. Bu sefer Peygamber: \"Bu paranın kesesini, sayısını ve kesenin ağız bağını iyi koru. Sahibi gelir (de bunları doğru haber verir) ise keseyi ona ver, gelmezse onunla yararlan\" buyurdu. Ben de onunla faydalandım. Hadîsin râvîsi Şu'be dedi ki: Ben bir zaman sonra Seleme ibn Kuheyl'e Mekke'de kavuştum. Seleme bana: Suveyd ibn Gafele, Ubeyy'in bulduğu bu paranın üç yıl mı, yahut bir yıl mı iilân edildiğini söylediğini iyi bilmiyorum, dedi",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2427,
			"arabicnumber": 2427,
			"text": "Zeyd ibnu Hâlid el-Cuhenî(radıyallahü anh) şöyle demiştir; bir bedevî Peygamber'e geldi ve O'na bulup da kaldırdığı buluntu bir şeyin hükmünü sordu. Peygamber (sallallahü aleyhi ve sellem): \"Onu bir sene i'lân et, sonra bunun çıkınını ve ağız bağını saklayıp koru. Bu müddet içinde birisi gelir de o buluntuyu ve onun sıfatlarını sana haber verirse (onu kendisine ver); kimse gelmez ise kendin onunla nafakalan\" buyurdu. Sorucu kişi: Yâ Rasûlallah! Yitik koyunun hükmü nedir? Dedi. Rasûlüllah: \"O, ya senin, ya mü'min kardeşinin, yahut da kurdundur (yani bu yitik koyunu sen alır, i'lân eder de sahibini bulamazsan sana aittir; sen almaz da mü'min kardeşin alırsa, o, onu alıp koruyan o mültekıtındır; o da almazsa artık koyun kurdundur)\" buyurdu.Bu defa da o kimse: Yitik devenin hükmü nedir? Diye sordu. defa Peygamber'in yüzünün rengi değişti ve: \"Kayıp deveden sana ne var? O hayvanın tabanı ve su tulumu berâberindedir. (Sahibi buluncaya kadar) kendisi suya gelir ve ağaç yer\" buyurdu",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2428,
			"arabicnumber": 2428,
			"text": "Bize Süleyman ibn Bilâl, Yahya ibn Saîd'den; o da el- Munbaıs'ın himayesinde bulunan Yezîd'den tahdîs etti. Yezîd, Zeyd ibn Hâlid (radıyallahü anh)'den şöyle derken işitmiştir: Peygamber(sallallahü aleyhi ve sellem)'e buluntu şeyin hükmü soruldu. Zeyd ibn Hâlid kesin olarak söyledi ki: Peygamber sorucuya: \"Sen onun çıkınını ve ağız bağını iyice tanı. Sonra onu bir sene bildir, i'lân et\" buyurdu.el-Munbaıs'ın âzâdlısı Yezîd şöyle diyordu: Eğer(buluntu) i'tirâf edilmezse, onu bulup almış olan kimse onunla nafakalanır ve buluntu onun yanında bir emânet olmuştur.(Süleyman ibn Bilâl dedi ki:) Yahya ibn Saîd şöyle dedi: İşte bu \"Onun yanında bir emânet olmuştur\" sözü, Rasûlüllah'ın hadîsi içinde mi, yoksa Yezîd'in kendi tarafından söylediği bir şey mi olduğunu bilmediğim şeydir. Sonra o sorucu: (Yâ Rasûlallah!) Koyun yitiği hakkında nasıl görürsün? dedi. Peygamber: \"Onu tut, al. Çünkü o ancak senin yahut mü'min kardeşinin yahut da kurdundur\" buyurdu. el-Munbaıs'ın âzâdlısı Yezîd: O, yani koyun yitiği de i'lân edilir, dedi.Sonra sorucu tekrar Peygamber'e: Deve yitiği hakkında nasıl re'y edersin? dedi. Zeyd ibn Hâlid dedi ki: Bunun üzerine Peygamber: \"Onu serbest bırak! Çünkü onun ayakkabısı ve su tulumu berâberindedir. Sahibi subaşında onu buluncaya kadar o kendisi subaşına gelir ve ağaçları yer (yani yaradılışı kuvvetlidir, korumaya ihtiyâcı yoktur)\" buyurdu",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2429,
			"arabicnumber": 2429,
			"text": "",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2430,
			"arabicnumber": 2430,
			"text": "",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2431,
			"arabicnumber": 2431,
			"text": "Ve el-Leys ibn Sa'd şöyle dedi: Bana Ca'fer ibnu Rabîa, Abdurrahmân ibn Hürmüz'den; o da Ebû Hureyre'den tahdîs etti ki, Rasûlüllah (sallallahü aleyhi ve sellem), İsrâîl oğulları'ndan bir adam zikretti. O adam İsrâîl oğullarının birinden ödünç olarak bin dînâr vermesini istedi... hadîsini sevketti. Ona ödünç veren kimse deniz kenarına çıktı da malını getirmiş bir gemi görmek umuduyla bakıyordu. Sahilde bir ağaç parçasıyla karşılaştı. Onu ailesinin evde yakması için aldı. Evde onu parçalayınca içinde paraları ve mektûb sahîfesini buldu",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2432,
			"arabicnumber": 2432,
			"text": "",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2433,
			"arabicnumber": 2433,
			"text": "",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2434,
			"arabicnumber": 2434,
			"text": "Ebû Hureyre (radıyallahü anh) tahdîs edip dedi ki: Azîz ve Celîl olan Allah, Rasûlü'ne Mekke fethini müyesser kılınca, Rasûlüllah (sallallahü aleyhi ve sellem) insanlar içinde ayağa kalktı, Allah'a hamd ve sena etti, sonra şöyle buyurdu: \"Muhakkak ki Allah fili Mekke'ye girmekten men' etmiştir. Rasûlünü ve mü'minleri de (bir defa olarak)Mekke ahâlîsine musallat etmiştir. Mekke benden evvel hiçbir kimse için asla halâl olmuyordu. O yalnız bir gündüzün bir saatinde benim için halâl kılınmıştır. Benden sonra da hiçbir kimse için ebediyyen halâl olmayacaktır. Mekke'nin av hayvanları ürkütülmez, dikeni (bile) koparılmaz. Yitiğini kimse (elini uzatıp)alamaz. Meğerki sahibini arayıp bulmak isteyen olsun. Her kimin bir kimsesi öldürülürse o, iki şeyden hangisi kendi hakkında daha hayırlı ise onu isteyebilir (yani iki şey arasında muhayyerdir): Ya kendisine diyet verilir yahut öldüren kimse kısâsen öldürülür\". Yâ Rasûlallah! Izhırdan başka. Zîrâ bizler onu kabirlerimizde ve evlerimiz (in inşâsın)da kullanıyoruz, dedi. Bunun üzerine Rasûlüllah: \"Izhırdan başka'' buyurdu. Bunun akabinde Yemenli bir zât olan Ebû Şâh ayağa kalktı ve: Bunları benim için yazınız yâ Rasûlallah! Dedi. Rasûlüllah da: \"Bunları Ebû Şâh için yazınız\" buyurdu. Râvî Velîd dedi ki: Ben Evzâî'ye: \"Benim için yazınız yâ Rasûlallah!\" sözü nedir? dedim. Rasûlüllah'tan işitmiş olduğu şu hutbenin yazılmasını istedi, dedi",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2435,
			"arabicnumber": 2435,
			"text": "ibn Omer (radıyallahü anh) 'den: Rasûlüllah(sallallahü aleyhi ve sellem) şöyle buyurmuştur: kimse diğer birinin hayvanının sütünü onun izni olmaksızın sağmasın. Sizden biriniz yiyecek ve içeceklerinin saklandığı mahzenine gelinmesini, dolabının kırılmasını ve oradaki yiyeceklerinin naklolunmasını ister mi? Hayvanlarının memeleri de insanlar için onların yiyeceklerini muhafaza ederler. Onun için hiçbir kimse diğerinin hayvanının sütünü, onun izni olmak müstesna, asla sağmasın",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2436,
			"arabicnumber": 2436,
			"text": "Zeyd ibn Hâlid el-Cuhenî(radıyallahü anh)'den (şöyle demiştir): Bir adam; bulduğu bir yitiğin hükmünü Rasûlüllah'a sordu. Rasûlüllah (sallallahü aleyhi ve sellem): \"Onu bir sene i'lân et. Sonra onun ağız bağını ve çıkınını iyice tanı. Sonra onunla nafakalan. Eğer sahibi gelirse, onu sahibine eda et\" buyurdu. (Ebû Zerr ve Ebu'l Vakt'te: O adam): Yâ Rasûlallah! Koyun yitiğinin hükmü nedir? dediler. Rasûlüllah: \"Onu tut. Çünkü o ya senin, ya mü'min kardeşinin, yahut da kurdundur (yani bu yitik koyunu sen alır, i'lân eder de sahibini bulamazsan, sana âiddir. Sen almaz da mü'min kardeşin alırsa onundur; o da almazsa artık koyun kurdundur)\" buyurdu. O adam: Yâ Rasûlallah! Yitik devenin hükmü nedir? diye sordu. Zeyd ibn Hâlid dedi ki: Rasûlüllah öfkelendi; Hattâ iki yanağı yahut yüzü kızardı. Sonra: \"Ondan sana ne? Sâhibi ona kavuşuncaya kadar o hayvanın ayakkabısı ve su tulumu berâberindedir\"buyurdu",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2437,
			"arabicnumber": 2437,
			"text": "Bize Şu'be, Selemetu'bnu Kuheyl’den tahdîs etti. O şöyle demiştir: Ben Suveyd ibn Gafele'den işittim, o şöyle dedi: Ben Selmân ibn Rabîa ve Zeyd ibn Sûhân ile beraber bir gazvede bulundum. Derken bir kamçı buldum. Bunlardan biri bana: O kamçıyı at, dedi. Ben: Hayır, atmam, lâkin eğer sahibini bulursam (bunu ona veririm); sahibini bulamazsam onunla faydalanırım, dedim. döndüğümüzde hac yaptık. Akabinde ben Medîne'ye uğradım. Ubeyy ibn Ka'b'a düşürülmüş kamçıyı almanın hükmünü sordum. Ubeyy şöyle dedi: Ben Peygamber (sallallahü aleyhi ve sellem) zamanında içinde yüz dînâr olan bir kese buldum. Onu Peygamber'e getirdim. Peygamber: \"Bunu bir sene (insanların toplantı yerlerinde)bildir, i'lân et\" buyurdu. Ben de bir yıl onu i'lân ettim. Sonra Peygamber'e geldim. Peygamber yine: \"Onu bir yıl i'lân et\" buyurdu. Ben onu bir yıl daha i'lân ettim, sonra Peygamber'e geldim. Peygamber yine: \"Onu bir yıl i'lân et\" buyurdu. Ben onu bir yıl i'lân ettim, sonra dördüncü defaPeygamber'e geldim. Peygamber: \"Dinarların sayısını, ağız bağını, kabını iyi tanı. Eğer sahibi gelir(se sayısını, çıkınını, ağız bağını haber verirce) - keseyi ona ver - gelmezse onunla yararlan\" buyurdu",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2438,
			"arabicnumber": 2438,
			"text": "Zeyd ibn Hâlid (radıyallahü anh)'den (o, şöyle demiştir): Bir çöl bedevisi Peygamber'e gelip, bulunmuş yitik eşyanın hükmünü sordu. Peygamber(sallallahü aleyhi ve sellem): \"Bunu bir sene i'lân et. Eğer bunun çıkınını ve ağız bağını sana haber veren bir kimse gelirse (bunu ona ver).Kimse gelmezse bununla sen nafakalan\" buyurdu. Bedevi, Peygamber'e deve yitiğinin hükmünü sordu. Bunun üzerine Peygamber'in yüzü değişti ve: \"Ondan sana ne? Su tulumu ve ayakkabıları berâberindedir. Kendisi suya gelir ve ağaçları yer. Sahibi onu buluncaya kadar, onu kendi başına bırak!\" buyurdu. bu sefer Peygamber'e koyun yitiğini sordu. Peygamber: \"O senin yahut mü'min kardeşinin yahut da kurdundur (yani bu yitik koyunu sen alır, i'lân eder de sahibini bulamazsan, sana âiddir. Sen almaz da mü'min kardeşin alırsa, o bulup alanındır; o da almazsa artık koyun kurdundur)\" buyurdu",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2439,
			"arabicnumber": 2439,
			"text": "el-Berâ', Ebû Bekr'den; Ebû Bekr (K) şöyle demiştir: Ben (oranın etrafını araştırıp gözetlemek için) gittim. Derken koyunlarını (bulunduğumuz kayaya doğru) sürmekte olan bir koyun çobanı ile karşılaştım. Ona: Sen kimin çobanısın? dedim. da Kureyş'ten ismini belirttiği bir adamın çobanı olduğunu söyledi. Ben de onu tanıdım. Bu sefer ben ona: Senin koyunlarında sütlüsü var mı? dedim. Evet vardır, dedi. Peki benim için süt sağar mısın? dedim. Evet sağarım, dedi. ona emrettim de koyunlarından birini tuttu. Sonra ona koyunun memesi üzerindeki tozları silkelemesini emrettim. Sonra da ellerini silkeleyip temizlemesini emrettim. Avuçlarından birini diğerine vurup şöylece temizlediğini söyledi. Akabinde benim için bir içimlik mikdâr süt sağdı. Ben Rasûlüllah için deriden bir kab yapmıştım, ağzında bir bez vardı. Sütün üzerine biraz su döktüm, hattâ kabın aşağısı biraz soğudu. Nihayet Peygamberin yanına geldim ve: İç yâ Rasûlallah, dedim. içti, ben de bundan hoşnut oldum",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 15
			}
		}
	]
}