{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"46": "Oppressions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2440,
			"arabicnumber": 2440,
			"text": "Ebu Said el-Hudri r.a.'den rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"İnananlar cehennemden kurtulunca cennetle cehennem arasındaki bir köprüde bekletilirler ve dünyada iken birbirine yapmış oldukları haksızlıkları ödeşirler. İyice temizlenip birbirinin hakkından arındırılınca cennete girmelerine izin verilir. Muhammed'in canı elinde olan Allah'a yemin ederim ki sizin cennette kalacağınız yer dünyadaki konumunuzun en iyi göstergesidir. \" Tekrar: 6535",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2441,
			"arabicnumber": 2441,
			"text": "Safvan İbn Muhriz el-Mazını'den nakledilmiştir: Abdullah İbn Ömer r.a.'in elinden tutmuş, birlikte yürüyordum. Karşımıza biri çıktı ve ''Allah Resulü hiç ikiniz arasında bir şey söyledi mi? (sana hiç sır verdi mi?)’’ diye sordu. İbn Ömer: ''Allah Resulü Sallallahu Aleyhi ve Sellem'i şöyle buyururken işittim: ''Allah, mu'min kulunu kendine yaklaştırır, onu koruması altına alıp örter ve ''Şu günahını biliyor musun? Şu günahını biliyor musun?'' der. O da ''Rabbim! Evet biliyorum\" der. Allah ona teker teker bütün günahlarını itiraf ettirip o, mahvolduğunu düşünmeye başlayınca, ''Dünyada iken senin bu günahlarını örttüm. Bu gün de seni bağışlıyorum\" der. Sonra ona yaptığı iyiliklerin yazılı olduğu defter verilir. Kafir ve münafıklar hakkında ise şahitler \"Bunlar Rableri adına yalan söyleyenlerdir\" derler. İyi biliniz ki Allah'ın la'neti zalimler üzerinedir. ' Tekrar: 4685, 6070, 7514 Not: Tevhıd Bölümü'nde bu hadis’in açıklaması ile ilgili olarak etraflıca bilgi verilecek;(7514. hadis’te) ayrıca Rikak Bölümü'nde de bu konuya işaret edilecektir. İNŞAALLAH",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2442,
			"arabicnumber": 2442,
			"text": "İbn Şihab, Salim'den, o da Abdullah İbn Ömer r.a.'den nakletmiştir: Allah Resulü Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Müslüman Müslüman'ın kardeşidir; ona haksızlık etmez ve onu ölüme terketmez. Her kim kardeşinin bir ihtiyacını görürse Allah da onun ihtiyacını görür. Her kim bir Müslüman'ın bir sıkıntısını giderirse Allah da kıyamet gününde onun sıkıntılarından bir sıkıntısını giderir. Her kim bir Müslümanın ayıbını örterse Allah da kıyamet gününde onun ayıbını örter. \" Tekrar: 6951 Diğer tahric: Tirmizî, Hudud; Ebu Dâvud, Edeb",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2443,
			"arabicnumber": 2443,
			"text": "Enes İbn Malik r.a.'den nakledilmiştir: Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"İster haksızlığa uğrasın, ister haksızlık etsin, din kardeşine yardım et\" Tekrar: 2444, 6952",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2444,
			"arabicnumber": 2444,
			"text": "Enes r.a.'den rivayet edilmiştir: Allah Resulü Sallallahu Aleyhi ve Sellem şöyle buyurdular: \"İster haksızlığa uğrasın, ister haksızlık etsin, din kardeşinize yardım ediniz\" \"Ey Allah'ın Resulü! Haklı olana yardım etmeyi anlıyoruz da haksız olana nasıl yardım edelim!\" diye sordular. Nebi Sallallahu Aleyhi ve Sellem de \"Ellerini tutarsınız\" buyurdu. Diğer tahric: Ebu Davud, Melahim; Tirmizi Fiten",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2445,
			"arabicnumber": 2445,
			"text": "Bera İbn Azib r.a.'den nakledilmiştir: \"Allah Resulü Sallallahu Aleyhi ve Sellem bize yedi şeyi emretti; yedi şeyden yasakladı. \"Bera, Hz. Nebi'in emrettikleri arasında \"hasta ziyaretini, cenaze uğurlamayı, aksırana dua etmeyi, verilen selamı almayı, haksızlığa uğrayan kişiye yardım etmeyi, seslenene cevap vermeyi ve yemini tutmayı\" saydı",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2446,
			"arabicnumber": 2446,
			"text": "Ebu Musa r.a.'den nakledilmiştir: Nebi Sallallahu Aleyhi ve Sellem parmaklarını kenetleyerek \"Mu'minler bir binanın tuğlaları gibidir, birbirine destek olurlar\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2447,
			"arabicnumber": 2447,
			"text": "Abdullah İbn Ömer r.a.'den rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: ''Zulüm, kıyamet gününde kat kat karanlık olacaktır",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2448,
			"arabicnumber": 2448,
			"text": "İbn Abbas r.a.'den rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem Muaz'ı Yemen'e gönderdi ve ona \"Mazlumun (haksızlığa uğrayanın) bedduasından sakın. Çünkü onun duası ile Allah arasında perde yoktur\" buyurdu. Not: Zekat bölümünün sonunda bu konu ayrıntılı olarak ele alınmıştır. O AÇIKLAMA İÇİN BURAYA TIKLAYABİLİRSİNİZ",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2449,
			"arabicnumber": 2449,
			"text": "Said el-Makburi kanalıyla Ebu Hureyre r.a.'den rivayet edilmiştir: Allah Resulü Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Biriniz, namus veya herhangi bir konuda kardeşine haksızlık yaptıysa altının ve gümüşün fayda etmeyeceği gün gelmeden önce ondan helallik dilesin. O gün geldiğinde iyiliği varsa yaptığı haksızlık kadar iyilik ondan alınır. İyiliği yoksa haksızlık ettiği kardeşinin kötülüklerinden alınıp ona yüklenir. \" Tekrar: 6534",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2450,
			"arabicnumber": 2450,
			"text": "Aişe r.anha'dan nakledilmiştir: Hz. Aişe, \"Eğer bir kadın kocasının geçimsizliğinden veya kendisinden yüz çevirmesinden endişe ederse aralarında bir sulh yapmalarında onlara bir günah yoktur\" (Nisa 128) ayetinin iniş sebebi hakkında şöyle demiştir: Evli bir erkek eşiyle aynı evde oturuyordu. Ancak onunla çokça cinsel ilişkiye girmiyor ve ondan ayrılmak istiyordu. Bunun üzerine eşi \"Sana kendimle ilgili bütün haklarımı helal ediyorum\" demişti. Bunun üzerine bu ayet indi. Tekrar: 2694, 4601, 5206",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2451,
			"arabicnumber": 2451,
			"text": "Sa'd es-Saidı'den rivayet edilmiştir: Allah Resulü Sallallahu Aleyhi ve Sellem'e bir su getirildi. O da sudan içti. Sağında (suyu getiren) delikanlı; solunda ise yaşlılar vardı. Hz. Nebi delikanlıya: \"Bunlara da su vermeme izin verir misin?\" buyurdu. Delikanlı \"Hayır, Allah'a yemin olsun ki, senden gelecek nasibimi kimseye değişmem\" dedi. Bunun üzerine Allah Resulü Sallallahu Aleyhi ve Sellem suyu çocuğun eline bıraktı. Not: Başlıkta geçen \"izin verdiğinde\" ifadesi \"hakkını başkasının almasına izin verdiğinde\" anlamındadır. Bu konu Müsakat bölümünde (2366. hadiste) ele alınmıştır",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2452,
			"arabicnumber": 2452,
			"text": "Said İbn Yezıd r.a.'den rivayet edilmiştir: Allah Resulü Sallallahu Aleyhi ve Sellem'i şöyle buyururken işittim: \"Her kim bir arsaya haksız yere el koyarsa boynuna o tarlanın yedi katı takılır. \" Tekrar: 3198",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2453,
			"arabicnumber": 2453,
			"text": "Muhammed b. İbrahim'den rivayet edildiğine göre, Ebu Seleme ona, kendisinin bazı insanlarla arsa yüzünden sorunlarının olduğunu, bunu Hz. Aişe r.anha'ya anlatınca onun şöyle dediğini haber vermiştir: \"Ey Ebu Seleme, o arsadan uzak dur. Çünkü Nebi Sallallahu Aleyhi ve Sellem, \"Her kim, bir karış dahi olsa (gasben başkasının) arazisinin sınırlarına haksız olduğu halde girerse, yedi kat yerin dibine kadar boynuna dolandırılarak cezalandırılır\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2454,
			"arabicnumber": 2454,
			"text": "Salim kanalıyla babasından r.a. rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem: \"Her kim haksız yere bir tarlaya el koyarsa kıyamet günü yedi kat yerin altına geçirilir\" buyurmuştur. Firebri şöyle der: Ebu Ca'fer İbn Ebu Hatim Ebu Abdullah'ın şöyle dediğini nakletmiştir: \"Bu hadis Horasan'da İbnü'l-Mübarek'in hadis defterlerinde mevcut değildir. Onlara Basra'da yazdırılmıştır.\" Tekrar: 3196",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2455,
			"arabicnumber": 2455,
			"text": "Cebele'den rivayet edilmiştir: Bazı Iraklılarla birlikte Medine'deydik. Kıtlık oldu. Abdullah İbn Zübeyr bize kuru hurma veriyordu. Abdullah İbn Ömer de yoldan geçerken bize uğruyor ve \"Allah Resulü, kişinin yanındakilerden izin istemeden, hurmaları ikişer ikişer yemeyi yasaklamıştır\" diyordu. Tekrar: 2489, 2490, 5446",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2456,
			"arabicnumber": 2456,
			"text": "Ebu Mes'ud r.a.'dan rivayet edilmiştir: Ensardan Ebu Şuayb adında birinin aşçılık yapan bir kölesi vardı. Ebu Şuayb ona \"Bize beş kişilik bir yemek pişir. Belki beşinci kişi olarak Nebi (Sallallahu aleyhi ve Sellem)'i çağırabilirim\" dedi. -Hz. Nebi'in yüzünde açlık belirtileri görmüştü.- Onu yemeğe davet etti. Onlarla birlikte davet edilmemiş biri daha geldi. Nebi Sallallahu Aleyhi ve Sellem: \"Bu adam, bizim peşimize düşüp geldi. Ona da izin veriyor musun?\" buyurdu. O da \"elbette\" dedi",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2457,
			"arabicnumber": 2457,
			"text": "Aişe r.anha'dan nakledilmiştir: Nebi Sallallahu Aleyhi ve Sellem: \"Allah'ın en sevmediği kişi düşmanlıkta aşırı gidendir\" buyurmuştur. Tekrar: 4523, 7188",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2458,
			"arabicnumber": 2458,
			"text": "Urve bin Zübeyr Ümmü Seleme'nin kızı Zeyneb binti Ümmü Seleme'den o, annesi olan Nebi (s.a.v.)'in eşi Ümmü Seleme r.anha validemizden şöyle nakletmiştir: Nebi Sallallahu Aleyhi ve Sellem odasının kapısında bir çekişme gördü. Onların yanına çıktı ve: \"Hiç kuşkusuz ben de bir insanım. Anlaşamayanlar bana gelir. Sizden kimileri konuşmayı daha iyi becerebilir. Ben de onun doğru söylediğini sanırım ve onun lehine karar veririm. Bir Müslümanın hakkını sizden her kime vermişsem o hak ateşten bir parçadır. Artık ister onu alsın, ister bıraksın .\" buyurdu. Tekrar: 2680, 6967, 7169, 7185 Not: Bu hadis hakkında ayrıntılı açıklama Ahkam bölümünde (7181. hadiste) gelecektir, İNŞAALLAH باب: إذا خاصم فجر. 17. \"ÇEKİŞTİĞİNDE KÖTÜ SÖZ SÖYLER",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2459,
			"arabicnumber": 2459,
			"text": "Abdullah İbn Amr r.a.'dan rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Dört özellik var ki, bu özellikler her kimde bulunursa münafık olur. Bu özelliklerden birisinin bulunduğu kişide ise münafıklık alametlerinden biri bulunur, ta ki bunu terk edinceye kadar: Konuştuğunda yalan söyler; vaad ettiğinde vaadine uymaz; biriyle sözleştiğinde sözleşmeyi bozar ve çekiştiğinde kötü söz söyler.\" Not: Bu hadis ile ilgili açıklama İman bölümünde geçmiştir.(34. hadis)",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2460,
			"arabicnumber": 2460,
			"text": "Urve'den rivayet edilmiştir: Aişe r.anha şöyle demiştir: Hind binti Utbe İbn Rebıa geldi ve \"Ey Allah'ın Resulül Ebu Süfyan çok cimri bir adam. Onun (haberi olmadan) malından çocuklarımıza yedirmemin bir zararı var mıdır?\" diye sordu. Nebi Sallallahu Aleyhi ve Sellem de \"Onlara örf’ün gerektirdiği kadar yedirmenin bir zararı yoktur\" buyurdu",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2461,
			"arabicnumber": 2461,
			"text": "Ukbe İbn Amir r.a.'den nakledilmiştir: Nebi Sallallahu Aleyhi ve Sellem'e \"Siz bazen bizi bir yerlere görevli olarak gönderiyorsunuz ve biz de bir kabileye konaklıyoruz. Ama bizi ağırlamıyorlar. Bu konuda ne buyurursunuz?\" dedik. \"Bir kabileye konakladığınız zaman sizi misafir ederlerse onların ikramlarını kabul ediniz. Yok eğer böyle yapmazlarsa o zaman misafirin hakkı ne ise onu alınız\" buyurdu. Tekrar: 6137",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2462,
			"arabicnumber": 2462,
			"text": "Ubeydullah İbn Abdullah İbn Utbe'den rivayet edilmiştir: Abdullah İbn Abbas r.a. ona Ömer r.a. hakkında şunu anlatmıştır: Allah, Resulü Sallallahu Aleyhi ve Sellem'i vefat ettirince ensar Saide oğullarının gölgeliğinde toplandı. Ben Ebu Bekir'e: \"Haydi, biz de gidelim\" dedim ve biz de Saide oğullarının gölgeliğine, onların yanına geldik. Tekrar: 3445, 4021, 6829, 6830, 7323",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2463,
			"arabicnumber": 2463,
			"text": "Ebu Hureyre r.a.'den rivayet edilmiştir: Allah Resulü Sallallahu Aleyhi ve Sellem \"Komşu, komşusunun duvarına bir tahta koymasına engel olmasın\" buyurmuştur. Sonra Ebu Hureyre şöyle demiştir: \"Niye sizin bundan yüz çevirdiğinizi görüyorum. Allah'a yemin ederim ki ben bu tahtayı sizin omuzlarınız arasına koyacağım\" demiştir. Tekrar: 5627, 5628 Diğer tahric: Tirmizi Ahkan; İbn Mâce, Ahkâm",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2464,
			"arabicnumber": 2464,
			"text": "Enes r.a.'den rivayet edilmiştir: Ebu Talha'nın evinde sakilik yapıyordum. O gün onların şarabı, hurma koruğu şarabıydı. Allah Resulü'nün emri üzerine tellal: \"İyi biliniz ki şarap haram kılındı\" diye seslendi. Ebu Talha (bana): \"Çık ve bu şarabı dök\" dedi. Ben de çıkıp döktüm. O gün, Medine sokaklarında şarap selleri aktı. İçimizden bazı kimseler: \"İyi ama kimilerimiz karınlarında şarap dolu iken öldürüldü\" dediler. Bunun üzerine Allah: \"İman eden ve iyi iş yapanlara ... tattıklarından dolayı günah yoktur\"[Maide 93] ayetini indirdi. Tekrar: 4617,4620,5580,5572,5583,5584,5600,5622, 7253",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2465,
			"arabicnumber": 2465,
			"text": "Ebu Said el-Hudri r.a.'den rivayet edilmiştir: Nebi (Sallallahu Aleyhi ve Sellem): \"Yollarda oturmaktan uzak durunuz\" buyurdu. Bunun üzerine \"Bizim yolda oturmaktan başka çaremiz yoktur. Orada buluşur, sohbet ederiz\" dediler. Buna karşılık Nebi (Sallallahu aleyhi ve Sellem): \"O zaman oturma yerlerine geldiğinizde yolun hakkını verin\" buyurdu. \"Yolun hakkı nedir?\" diye sordular. \"Gözü yere indirmek, insanlara sıkıntı vermemek, selam almak ve iyiliği emredip kötülüğü yasaklamaktır\" buyurdu. Tekrar: 6229",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2466,
			"arabicnumber": 2466,
			"text": "Ebu Hureyre r.a.'den rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Bir adam yolda yürüyordu. Çok susamıştı. Bir kuyu buldu. İnip su içti. Kuyudan çıktığında susuzluktan soluyan ve bundan dolayı toprak yiyen bir köpek gördü. Adam: \"Bu köpek aynı benim gibi susamış\" dedi ve kuyuya inip ayakkabısına su doldurdu ve köpeğe su verdi. Allah onun bu yaptığına çok memnun oldu ve onu bağışladı.\" Sahabe: \"Ey Allah'ın Resulü! Biz hayvanlara yaptığımız iyiliklerden dolayı da sevap alıyor muyuz?\" diye sordu. O da (Sallallahu Aleyhi ve Sellem): \"Canı olan her varlığa iyiliğin sevabı vardır\" buyurdu. باب: إماطة الأذى. 24. İNSANLARA SIKINTI VEREN ŞEYLERİ YOL'DAN KALDIRMAK",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2467,
			"arabicnumber": 2467,
			"text": "Usame İbn Zeyd den r.a. rivayet edilmiştir: Hz. Nebi kafasını kaldırdı ve Medine'nin evlerinden yüksek bir eve baktı. Sonra: \"Benim gördüğümü siz de görüyor musunuz? Ben sizin evleriniz arasında yağmurun düştüğü yerler gibi fitnenin yağdığı yerler görüyorum\" buyurdu",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2468,
			"arabicnumber": 2468,
			"text": "Abdullah İbn Abbas r.a.'den rivayet edilmiştir: Allah'ın, haklarında \"Çünkü kalpleriniz sapmıştı\" [Tahrim 4] buyurduğu Hz. Nebi'in iki hanımının hangileri olduğunu Ömer'e sormayı eskiden beri çok arzuluyordum. Onunla birlikte hacca gittim. Yolda bir yöne saptı, ben de ibriği alıp onun tarafına saptım. İhtiyaç giderdi ve geldi. Suyunu döktüm ve abdest aldı. \"Ey mu'minlerim emiri! Allah'ın, haklarında \"Çünkü kalpleriniz sapmıştı\" buyurduğu Hz. Nebi'in iki hanımı hangileriydi?\" diye sordum. \"Abbas'ın oğlu! Sana şaşıyorum. Aişe ve Hafsa'ydı dedi. Sonra Ömer olayı anlatmaya başladı: Ben, ensardan bir komşum la birlikte Ümeyye İbn Zeyd oğullarının mahallesinde oturuyordum. Orası Medine'nin yüksek bir yerindeydi. Nöbetleşe Hz. Nebi'in yanına gidiyorduk. Bir gün o, bir gün ben gidiyordum. Ben indiğimde o gün Hz. Nebi'in buyurduğu emirleri vb. olayları haber veriyordum. O da indiğinde öyle yapıyordu. Biz Kureyşliler kadınlara sözü geçen bir topluluktuk. Medine'ye geldiğimizde onların kadınlarının onlara sözünün geçtiğini gördük. Bizim kadınlarımız da zamanla Medine kadınlarının bu özelliğini almaya başladılar. Bir ara ben hanıma kızdım; bana karşılık verdi. Bu yaptığını yadırgadığımı belli ettim. \"Sana karşılık vermemi niye yadırgıyorsun? Hz. Nebi'in hanımları da ona karşılık veriyorlar. Hatta onlardan biri var ki, bugün Hz. Nebi'in geceye kadar yanına uğramayacak\" dedi. Bu söylediği beni ürküttü ve \"Onlardan hangisi bunu yapacaksa o kendine çok yazık eder\" dedim. Sonra elbisemi giyinip Hafsa'nın yanına giderek: \"İçinizden biri bugün geceye kadar Hz. Nebi'in yanına gitmeyecek mi?\" dedim. O da \"evet\" diye cevap verdi. \"O kendine yazık etmiş, ziyan etmiş. Resulü'nü kızdırdığı için Allah'ın ona kızacağından ve helak olacağından güvencesi var mı? Allah Resulü'ne çok üsteleme ve o sana kızdığında sözüne karşılık verme. Onu yatağında yalnız bırakma ve istediğin şeyi benden iste. Ortağının (yani Aişe'nin) Hz. Nebi'in en çok sevdiği ve onun en gözde hanımı olması sakın ha seni kıskançlıktan dolayı yanlışlığa sürüklemesin\" dedim. Gassan kabilesinin bizimle savaşmak için hazırlık yaptığını konuşuyorduk. Komşum kendi sırası gelince aşağıya indi ve yatsı vakti döndü. Sert bir şekilde kapımı çaldı ve \"kimse yok mu?\" dedi. Telaşla hemen yanına çıktım. \"Çok büyük bir hadise oldu\" dedi. \"Ne oldu? Gassan kabilesi mi geldi?\" dedim. \"Yok\" dedi \"çok daha önemli bir şey. Allah Resulü, hanımlarını boşadı.\" \"Hafsa kendine yazık etti, kötü oldu\" dedim. Bunun olmasını zaten bekliyordum. Hemen üzerimi giyindim ve gidip Nebi (Sallallahu aleyhi ve Sellem) ile birlikte sabah namazını kıldım. Hz. Nebi küçük odasına girip yalnız kaldı. Hafsa yanıma geldi, ağlıyordu. \"Niye ağlıyorsun? Seni uyarmamış mıydım Allah Resulü sizi boşadı mı?\" dedim. \"Bilmiyorum. O şimdi odasında\" dedi. Çıkıp minbere geldim. Minberin çevresinde bir grup insan vardı. Ağlıyorlardı. Onlarla kısa bir süre oturdum. Sonra içimdeki duygu baskın geldi ve Hz. Nebi'in bulunduğu odaya geldim. Hz. Nebi'in siyah! kölesine \"Ömer'in içeri girmesi için izin iste\" dedim. Içeri girdi, Hz. Nebi'le konuştu. Sonra çıkıp \"Senin geldiğini söyledim, ama sustu\" dedi. Ben de oradan ayrıldım ve minberin yanındaki grupla birlikte oturdum. Sonra duygularım yine ağır bastı ve O'nun odasına gittim. Köle yine aynı şeyi söyledi. Ben de minberin yanındaki grupla birlikte oturdum. Sonra yine duygularım ağır bastı ve gelip \"Ömer için izin iste\" dedim. Yine aynı şeyi söyledi. Tam dönmüş ayrılıyordum ki köle arkamdan çağırdı:\"Allah Resulü içeri girmen için izin verdi.\" Yanına girdim. Bir hasır üzerine uzanmış yatıyordu. Altında döşek yoktu. Hasırın yüzeyinin izi vücuduna çıkmıştı. Başında içi hurma yaprağı ile doldurulmuş deri bir yastık vardı. Selam verdim. Sonra oturmadan \"Hanımlarını boşadın mı?\" dedim. Başını bana doğru kaldırdı ve \"hayır\" dedi. Sonra yine oturmadan Hz. Nebi'e (onun kendini nasıl hissettiğini anlayabilmek için) latife yollu \"Ey Allah'ın Resulü! Hatırlar mısın biz Kureyşliler kadınlara sözümüzü geçirirdik. Hanımlarının sözünün geçtiği bir topluluğa gelince (onların sözü geçer oldu)\" dedim. Bu sözüm üzerine Hz. Nebi Sallallahu Aleyhi ve Sellem güıümsedi. Sonra şöyle devam ettim \"Haberin olsun ki ben Hafsa'nın yanına gittim ve ona \"Senin ortağının (Aişe'nin) Hz. Nebi'in en sevdiği ve onun en gözde hanımı olması sakın ha seni kıskançlıktan dolayı yanlışlığa sürüklemesin\" dedim.\" Hz. Nebi bir daha gülümsedi. Onun gülümsediğini görünce oturdum. Sonra odasına şöyle bir göz attım. Allah'a yemin ederim ki odasında üç tane deri’den başka bir şey görmedim. 'Allah'a dua etsen de ümmetinin rızkını artırsa. İranlılar ve Rumlar Allah'a ibadet etmedi~ri halde onların rızkı artırılmış, dünyanın hepsi onlara verilmiş\" dedim. Yaslanmıştı. \"Hattab'ın oğlu! Bir şüphen mi var yoksa? Onlar, nasipleri kendilerine dünya hayatında peşin verilenlerdir\" buyurdu. \"Ey Allah'ın Resulü! Allah'tan benim bağışlanmamı dilesen\" dedim. Hz. Nebi Hafsa'nın Aişe'ye haber verdiği o sözünden dolayı odasına çekilmişti. Hanımlarına kızdığı için \"Bir ay onların yanına girmeyeceğim\" demişti. Bunun üzerine Allah onu azarladı. Aradan 29 gün geçince Aişe'nin yanına girdi, ilk ondan başlamıştı. Aişe ona \"Sen bizim yanımıza bir ay girmemek için yemin etmiştin. Biz tam 29 gün geçirdik. Ben günleri teker teker sayıyorum\" dedi. Hz. Nebi \"Ay yirmi dokuz gündür\" dedi. O ay yirmi dokuz gün çekiyordu. Aişe şöyle demiştir: \"Bu olay üzerine tahyır ayeti (Hz. Nebi'in hanımlarını muhayyer bırakan ayet) indi. Hz. Nebi ilk benden başlamıştı. Bana \"Sana bir şey hatırlatacağım. Ana babana danışmadan acele karar vermen gerekmiyor\" buyurdu. Aişe \"Ben biliyorum ki annem babam bana senden ayrılmamı buyuracak değiller\" dedi. Sonra Hz. Nebi Sallallahu Aleyhi ve Sellem \"Allah (c.c.) \"Ey Nebi! Eşlerine söyle: Eğer dünya dirliğini, süsünü (refahını) istiyorsanız, gelin size boşanma bedellerinizi vereyim de, sizi güzellikle salıvereyim. Eğer Allah'!, Nebi'ini ve ahiret yurdunu diliyorsanız, bilin ki, Allah, içinizden güzel davrananlar için büyük bir mükafat hazırlamıştır\" [el-Ahzab 28,29] buyuruyor\" dedi. Ben \"Ben bu konuda mı anne babama danışacağım. Elbette ki ben Allah'ı, Resulü'nü ve ahiret yurdunu tercih ediyorum\" dedim. Sonra Hz. Nebi diğer hanımlarını muhayyer bıraktı. Onlar da aynen Hz. Aişe'nin söylediğini söylediler",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2469,
			"arabicnumber": 2469,
			"text": "Enes r.a.'den rivayet edilmiştir: Allah Resulü Sallallahu Aleyhi ve Sellem hanımlarına bir ay yaklaşmamak için lla yemini etmiş ve ayağını onların evinden çekmişti. Bir çardakta oturmuştu. Ömer geldi ve \"Hanımlarını boşadın mı?\" diye sordu. \"Hayır ama onlara bir ay yaklaşmamak için yemin ettim\" buyurdu. Yirmi dokuz gün orada kaldı. Sonra indi ve hanımlarının yanına girdi",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2470,
			"arabicnumber": 2470,
			"text": "Ebu'l-Mütevekkil en-Naci rivayet etmiştir: Cabir İbn Abdullah r.a.'ın yanına gittim. Şöyle anlattı: Nebi Sallallahu Aleyhi ve Sellem mescide girdi. Ben de devemi mescidin döşeme taşlarına bağlayarak onunla birlikte mescide girdim ve \"Bu senin devendir\" dedim. Dışarı çıktı, deveye yaklaşıp çevresinde şöyle bir döndükten sonra: \"Deve de, para da senindir\" buyurdu. Not: Bu hadis Şurut bölümünde ayrıntılı olarak ele alınacaktır.(2718. hadis) باب: الوقوف والبول عند سباطة قوم. 27. ÇÖPLÜKTE DURMAK VE ORAYA İDRARINI BIRAKMAK",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2471,
			"arabicnumber": 2471,
			"text": "Huzeyfe r.a.'den şöyle rivayet edilmiştir: Allah Resulü Sallallahu Aleyhi ve Sellem'i gördüm. Çöplüğe gitti ve ayakta bevletti. Not: Bu hadis, Taharet bölümünde ayrıntılı olarak ele alınmıştır.(224. hadiste) باب: من أخذ الغصن، وما يؤذي الناس في الطريق فرمى به. 28. YOLDAKİ DALI VEYA İNSANLARA SIKINTI VEREN BİR ŞEY'İ ALIP ATAN KİŞİ",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2472,
			"arabicnumber": 2472,
			"text": "Ebu Hureyre r.a.'den nakledilmiştir: Allah Resulü Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Bir adam yolda yürürken bir diken dalı bulmuştu. Onu aldı ve Allah onun bu davranışına memnun olup onu bağışladı",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2473,
			"arabicnumber": 2473,
			"text": "İkrime'den rivayet edilmiştir: Ebu Hureyre'nin şöyle dediğini işittim: \"Hz. Nebi Sallallahu Aleyhi ve Sellem bir grup, yol genişliğinde anlaşmazlığa düştüklerinde yolun genişliğinin yedi arşın olmasına hükmetti",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2474,
			"arabicnumber": 2474,
			"text": "Adi İbn Sabit'ten rivayet edilmiştir: Abdullah İbn Yezıd el-Ensari'nin şöyle dediğini işittim: -Abdullah İbn Yezid, Adi'nin anne tarafından dedesiydi- Nebi Sallallahu Aleyhi ve Sellem yağmalamayı ve musle (organ kesme)yi yasaklamıştır. Tekrar: 5516",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2475,
			"arabicnumber": 2475,
			"text": "Ebu Hureyre r.a.'den rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Kişi zina ettiği sırada mu'min olarak zina etmez; içki içtiği sırada mu'min olarak içmez; hırsızlık ettiği sırada mu'min olarak hırsızlık etmez; insanların kendisine baka baka yağma yaptığı sırada mu'min olarak yağma yapmaz.\" Said'den ve Ebu Seleme’den Ebu Hureyre r.a. kanalıyla Hz. Nebi'in aynen böyle buyurduğu nakledilmiştir. Ancak o rivayette \"yağma\" maddesi yoktur. Firebri şöyle demiştir: Ebu Cafer'in hattıyla şunu gördüm: Ebu Abdullah şöyle demiştir: \"Bunun tefsiri, kişi bunları yaptığı sırada imanının ondan çekilip alınmasıdır. \" Tekrar: 5578, 6772, 6810",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2476,
			"arabicnumber": 2476,
			"text": "Ebu Hureyre r.a.'den rivayet edilmiştir. Allah Resulü Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Meryem'in oğlu aranıza adaleti sağlayan bir hakem olarak indirilip haç'ı kırıncaya, domuzu öldürünceye, cizyeyi kaldırıncaya ve mal, hiç kimse kabul etmeyecek derecede çoğalıncaya dek kıyamet kopmaz",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2477,
			"arabicnumber": 2477,
			"text": "Seleme İbn Ekva r.a.'dan rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem Hayber savaşında yakılmış ateşler gördü. \"Bu ateşlerde ne pişiriliyor\" buyurdu. \"Evcil eşekler pişiriliyor\" dediler. Nebi Sallallahu Aleyhi ve Sellem: \"Kapları kırın ve içindekini dökün\" buyurdu. \"İçindekini döküp kapları yıkasak olmaz mı?\" dediler. Nebi Sallallahu Aleyhi ve Sellem: \"Yıkayabilirsiniz\" buyurdu. Tekrar: 4196, 5497, 6148, 6331, 6891",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2478,
			"arabicnumber": 2478,
			"text": "Abdullah İbn Mes'ud r.a.'den rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem Mekke'ye girdiğinde Kabe'nin etrafında tam 360 put vardı.Elindeki bir sopayla putları devirip devirip yıktı. Yıktığı sırada da: \"Hak geldi, batıl yıkılıp gitti\" [İsra 81] ayetini okuyordu",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2479,
			"arabicnumber": 2479,
			"text": "Aişe r.anha'dan rivayet edilmiştir: Aişe, odasındaki bir raf'a resimli bir perde takmıştı. Hz. Nebi onu yırttı. Bunun üzerine Aişe onun kumaşından iki minder yaptı. O minderler odada dururdu ve Hz. Nebi üzerinde otururdu. Tekrar: 5954, 5955, 6109",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2480,
			"arabicnumber": 2480,
			"text": "Abdullah İbn Amr r.a.'den rivayet edilmiştir: Allah Resulü Sallallahu Aleyhi ve Sellem'i şöyle buyururken işittim: \"Her kim malı uğruna savaşırsa şehit olur.\" Diğer tahric: Tirmizî, Diyat; Müslim, Müsakât",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2481,
			"arabicnumber": 2481,
			"text": "Enes r.a.'den nakledilmiştir: Nebi Sallallahu Aleyhi ve Sellem hanımlarından birinin yanında bulunuyordu. mu'minlerin annelerinden biri, onun bulunduğu odaya içinde yemek olan bir tencere gönderdi. Hz. Nebi'in odasında bulunduğu hanımı, tencereye eliyle vurarak kırdı. Nebi Sallallahu Aleyhi ve Sellem hemen tencereyi birleştirdi, dökülen yemeği içine koydu ve: \"yeyin\" buyurdu. Yemeği bitirinceye kadar, yemek getiren kişiyi ve kırık tencereyi yanında bekletti. Sonra yemeği getiren kişiye sağlam bir tencere verdi ve kırılanı göndermedi. Tekrar: 5225",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2482,
			"arabicnumber": 2482,
			"text": "Ebu Hureyre r.a.'den rivayet edildiğine göre Allah Resulü Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"İsrail oğullarında Cüreyc adında bir adam vardı. Namaz kılarken annesi onu çağırdı. (Namazını bozup) ona cevap vermek istemeyerek \"anneme cevap mı vereyim, yoksa namaz mı kılayım\" dedi. Sonra annesi gelerek: \"Allahım' Fahişelerin yüzünü göstermeden onun canını alma\" diye beddua etti. Bir ara Cüreyc manastırında ibadet ediyordu. Kadının biri \"Cüreyc'in başına bir fitne açayım\" dedi. Onun karşısına dikilip ona laf attı. Cüreyc hiç oralı olmadı. Bunun üzerine kadın bir çobanın yanına giderek onunla ilişkiye girdi. Bir erkek çocuğu doğurdu ve \"Bu Cüreyc'in çocuğu\" dedi. Bunun üzerine kavmi, gidip Cüreyc'in manastırını yıktılar, onu aşağı indirdiler ve kötü sözler söylediler. Bunun üzerine Cüreyc gidip abdest aldı, namaz kıldı, sonra gelip çocuğa \"Küçük! Senin baban kim\" diye sordu. Çocuk ''falanca çobandır\" dedi. Bunun üzerine kavmi, \"sana altından bir manastır yapalım\" dediler. \"Hayır, balçıktan yapın yeter\" dedi",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 43
			}
		}
	]
}