{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"49": "Manumission of Slaves"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2517,
			"arabicnumber": 2517,
			"text": "Bana Alî ibn Hüseyn Zeyne'l-Âbidîn'in dostu olan Saîd ibnu Mercâne tahdîs edip şöyle dedi: Alî ibn Hüseyin dedi ki, Ebû Hureyre (radıyallahü anh) bana şunu söyledi: Peygamber (sallallahü aleyhi ve sellem) şöyle buyurdu: \"Her kim bir müslümân kişiyi kölelikten âzâd ederse (hürriyetine kavuşturursa) Allah, o âzâd edilenin her uzvuna mukaabil âzâd eden adamın uzuvlarını ateşten âzâd eder\". senedle) Saîd ibn Mercâne şöyle dedi: Ben bir kerre Ebû Hureyre'nin bu hadîsini dostum Alî ibn Hüseyin (Zeyne'l-Âbidîn)'e götürdüm.Alî ibn Hüseyin hemen kendisine âid olan bir köleyi kastedip, onu hürriyete kavuşturdu. Halbuki vaktiyle Abdullah ibn Ca'fer ibn Ebî Tâlib, Alî ibn Hüseyin'e bu köle mukaabilinde on bin dirhem yahut bin dînâr vermişti",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2518,
			"arabicnumber": 2518,
			"text": "Ebû Zerr (radıyallahü anh) şöyle dedi: Ben Peygamber (sallallahü aleyhi ve sellem)'e: Hangi amel daha faziletlidir? Diye sordum. Peygamber: \"Allah'a îmân etmek ve Allah yolunda cihâd eylemek\" buyurdu. Esîr veya kölelerin hangisi(ni âzâd etmek) daha faziletlidir? diye sordum. \"Bahâca en yüksek ve sahibleri yanında en iyi olandır\" buyurdu. Köle âzâd edemez isem? diye sordum. Peygamber: \"Fakir veya ailesinden ayrı olana yardım edersin, yahud da beceriksiz, iş bilmez kimseye iş yapıverirsin\" buyurdu. Ben: Eğer bu yardımı da yapamaz isem? dedim. Peygamber: \"Şerr(in)den insanları serbest bırakırsın! Şübhesiz bu da kendi nefsine sadaka yapmakta olduğun bir sadakadır\" buyurdu",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2519,
			"arabicnumber": 2519,
			"text": "Esma bintu Ebî Bekr (radıyallahü anh): Peygamber(sallallahü aleyhi ve sellem) güneş tutulması hâdisesinde köleleri hürriyete kavuşturmayı emretti, demiştir. Bu hadîsi ed-Derâverdî'den; o da Hişâm'dan senediyle rivayet etmekte Alî ibnu’l-Medînî, Mûsâ ibn Mes'ûd'a mutâbaat etmiştir",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2520,
			"arabicnumber": 2520,
			"text": "Buradaki senedle yine Esma bintu Ebî Bekr(radıyallahü anh): Bizler ay tutulması sırasında(da) köle âzâd etmekle emrolunurduk, demiştir",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2521,
			"arabicnumber": 2521,
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2522,
			"arabicnumber": 2522,
			"text": "İbn Omer (radıyallahü anh) 'den: Peygamber (sallallahü aleyhi ve sellem): \"Her kim bir köledeki kendine âid olan payı âzâd ederse, şayet onun kölenin bedeli kadar malı varsa, kölenin tamâmını hürriyete kavuşturması onun üzerine vâcib olur; Âdil bir kıymetle bedeli ta'yîn olunur, ortaklarına kendi hisseleri verilir ve âzâd edilenin yolu boşaltılır\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2523,
			"arabicnumber": 2523,
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2524,
			"arabicnumber": 2524,
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2525,
			"arabicnumber": 2525,
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2526,
			"arabicnumber": 2526,
			"text": "Abdullah ibn Omer (radıyallahü anh) 'den (o, şöyle demiştir):Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Her kim bir köledeki hissesini bağışlayıp âzâd eder ve kölenin, geri kalan değerine ulaşacak derecede bir malı bulunursa, o pay için köleye âdilce bir kıymet konulur da o payını âzâd eden, diğer ortakların hisselerini verir ve onun hesabına köle hürriyetine kavuşup âzâd olur. Şayet hissesini ilk âzâd edenin diğer ortakların hisselerini ödeyecek malı bulunmazsa, köleden âzâdladığı hissesi âzâd olmuştur",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2527,
			"arabicnumber": 2527,
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2528,
			"arabicnumber": 2528,
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2529,
			"arabicnumber": 2529,
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2530,
			"arabicnumber": 2530,
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2531,
			"arabicnumber": 2531,
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2532,
			"arabicnumber": 2532,
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2533,
			"arabicnumber": 2533,
			"text": "Câbir ibn Abdillah (radıyallahü anh) şöyle demiştir: Biz Ensâr cemâatinden bir adam, kendisine âid olan bir köleyi \"Ben öldükten sonra hürsün\" deyip, müdebber olarak âzâd etmişti. (Sonra bu zât fakir düştü ve bu kölenin bedeline muhtâc oldu.) Peygamber (sallallahü aleyhi ve sellem) o köleyi çağırdı, akabinde o köleyi Nuaym ibn Abdillah satın aldı. (Peygamber parayı o muhtâc sahâbîye verdi.) Bu köle birinci yılda öldü, demiştir",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2534,
			"arabicnumber": 2534,
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2535,
			"arabicnumber": 2535,
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2536,
			"arabicnumber": 2536,
			"text": "Âişe (r.anha) şöyle demiştir: Ben Berîre'yi satın aldım. Eski sâhibleri onun velâsının kendilerine âid olması şartını ileri sürdüler. Ben bunu Peygamber'e zikrettim. Peygamber (sallallahü aleyhi ve sellem): \"Sen Berîre'yi satın alıp âzâd eyle! Çünkü velâ, basılıp damgalanmış gümüş parayı verene âiddir\" buyurdu. de Berîre'yi âzâd ettim. Akabinde Peygamber, Berîre'yi çağırdı da onu(henüz köle bulunan kocası Mugîs'ten) muhayyer kıldı. Berîre bu muhayyer kılınması üzerine: Eğer kocam bana şöyle şöyle verse bile, ben onun yanında sabit olmazdım, dedi de, kendi nefsini tercih etti",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2537,
			"arabicnumber": 2537,
			"text": "Enes (radıyallahü anh) şöyle tahdîs etmiştir: Ensâr'dan bir takım kimseler Rasûlüllah'tan izin istediler ve: Bize izin ver de kız kardeşimizin oğlu Abbâs lehine, kendini esirlikten kurtaracak olan fidyesini ona terk edelim, dediler. Rasûlüllah (sallallahü aleyhi ve sellem): \"Onun fidyesinden bir tek dirhemi de terk etmeyeceksiniz\" buyurdu",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2538,
			"arabicnumber": 2538,
			"text": "Hişâm şöyle dedi: Bana Bâbam Urvetu'bnu'z - Zubeyr şöyle haber verdi: Hakîm ibn Hızâm (radıyallahü anh) Câhiliyet zamanında yüz tane köle âzâdlamış ve yüz tane(kurbanlık) deve sevk etmişti. Müslüman olunca da(hacc mevsiminde) yüz tane kurbanlık deve sevk etmiş ve yüz tane köle âzâd eylemiştir. Hakîm söyledi ki: Ben Rasûlüllah'a sorup şöyle dedim: Yâ Rasûlallah! Birtakım şeyler hakkında re'yini bana söyler misin? Ben Câhiliyet devrinde(sadaka, köle âzâd etme gibi) birtakım işler yapıyor ve bunlarla taabbüd ediyordum, yânı bunlarla insanlara hayır ve iyilik yapmayı, Allah'a da yakınlık kazanmayı istiyordum (Bunlarda benim için bir ecir ve sevâb var mıdır? Dedim). dedi ki: Rasûlüllah (sallallahü aleyhi ve sellem): \"Sen, senin lehine geçmiş olan hayırlar üzerine müslümân \"oldun\" buyurdu",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2540,
			"arabicnumber": 2540,
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2541,
			"arabicnumber": 2541,
			"text": "Bize İbnu Avn haber verip şöyle dedi: Ben Nâfi'e mektûb yazdım. O da bana şunu yazdı: Peygamber (sallallahü aleyhi ve sellem) -Medine'yi basmak isteyen- Mustalık oğulları üzerine gece baskını yaptı. Onlar gafil bulunuyorlardı. Yaylım hayvanları da subaşında sulanıyordu. Peygamber onların kıtale girişenlerini öldürdü, zürriyetlerini esir etti. Peygamber o gün Cuveyriye'ye de nail oldu. Nâfi' (mektubunda): Bu hadîsi bana Abdullah ibn Omer tahdîs etmiştir; kendisi bu orduda idi, dedi",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2542,
			"arabicnumber": 2542,
			"text": "Abdullah ibnu Muhayrîz şöyle dedi: Ben Ebû Saîd Hudri (radıyallahü anh)'yi gördüm de kendisine azli (yâni cinsî yaklaşmada meniyi dışarıya akıtmanın dînî hükmünü) sordum. O da şöyle dedi: Biz Rasûlüllah'ın maiyyetinde Mustalık oğulları gazasına çıktık. Sonunda bizlere Arab esirlerinden birer esîr düştü. Bu sırada kadınlara çok iştihâ ve arzu hissetmiştik; bekârlık bizlere şiddetli olmuştu. (Çocuk olup da satışa mâni' olmasın diye) cinsî yaklaşmada azl yapmak istiyorduk. Ve azlin hükmünü Rasülullah'tan sorduk. Rasûlüllah (sallallahü aleyhi ve sellem): \"Azli yapmamanız sizin üzerinize bir be's değildir. Kıyâmet gününe kadar (İlâhî ilimde) var olacağı mukadder olan her insan, muhakkak var olacaktır\" buyurdu",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2543,
			"arabicnumber": 2543,
			"text": "Burada iki senedle gelen hadîste Ebû Hureyre (radıyallahü anh) şöyle demiştir: Benû Temîm kabilesi hakkında Rasûlüllah'tan şu üç sözü söylerken işittiğim zamandan beri, Benû Temîm kabilesini sevmekte devam ediyorum: Rasülullah: \"Temîmîler ümmetimin Deccâl'a karşı en şiddetli olan bir sınıfıdır\" buyuruyordu. Benû Temîm'in zekât malları gelmişti. Bunun üzerine Rasülullah (sallallahü aleyhi ve sellem): \"Bu mallar kavmimizin sadakalarıdır\" buyurdu. Âişe’nin yanında Benû Temîm kabîlesinden esir bir kadın vardı. Rasülullah, Âişe'ye: \"Bu esîr kadını âzâd et! Çünkü o İsmâîl neslindendir\" buyurdu",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2544,
			"arabicnumber": 2544,
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2545,
			"arabicnumber": 2545,
			"text": "Bize Vâsıl el-Ahdeb tahdîs edip şöyle dedi: Ben el- Ma'rûr ibn Suveyd'den işittim; şöyle dedi: Ben Ebû Zerr el-Gıfârî(radıyallahü anh)'yi -Rebeze'de- kendi üzerinde bir hülle, kölesinin üzerinde de bir hülle olduğu hâlde gördüm. Biz Ebû Zerr'e, kölesine de kendi elbisesinden giydirmesini sorduk. Ebû Zerr şöyle dedi: Ben(bir kerre) bir adamla sövüştüm(onu anasından dolayı ayıpladım).O da beni Peygamber'e şikâyet etti. Bunun üzerine Peygamber(sallallahü aleyhi ve sellem) bana: \"Sen onu anasından dolayı ayıpladın mı?\" buyurdu ve sonra şunları söyledi: \"Şübhesiz sizin kardeşleriniz, sizin hizmetçilerinizdir, Allah onları sizin ellerinizin altına (yani mülk ve kudretinizin altına) koymuştur. Her kimin eli altında kardeşi bulunursa, ona yediğinden yedirsin, giydiğinden giydirsin. Ve onlara güçleri yetmeyecek (zahmetli) işler yüklemeyiniz. Şayet onlara zahmet verecek işler yüklerseniz, onlara yardım ediniz",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2546,
			"arabicnumber": 2546,
			"text": "İbn Omer (radıyallahü anh)'den (şöyle demiştir): Rasûlüllah (sallallahü aleyhi ve sellem): \"Köle efendisine doğru ve iyi iş yaptığı ve Rabb'inin ibâdetini de güzel yerine getirdiği zaman, bu köle için iki ecir vardır\" buyurdu",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2547,
			"arabicnumber": 2547,
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2548,
			"arabicnumber": 2548,
			"text": "ez-Zuhrî şöyle demiştir: Ben Saîd ibnu'l-Müseyyeb'den işittim; şöyle diyordu: Ebû Hureyre (radıyallahü anh) şöyle dedi: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: \"Salih olan memlûk kul için iki ecir vardır\". (Ebû Hureyre şöyle dedi): \"Nefsim elinde olan Allah'a yemîn ederim ki, eğer Allah yolunda cihâd etmek, hacc yapmak ve anama itaat ve iyilik etmek olmasaydı, muhakkak köle olduğum hâlde ölmemi arzu ederdim",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2549,
			"arabicnumber": 2549,
			"text": "Ebû Hureyre (radıyallahü anh) şöyle dedi: Peygamber (sallallahü aleyhi ve sellem): \"Rabb'inin ibâdetini güzel yapmakta ve efendisi için de iyilik ve doğrulukla iş yapmakta olan her birinize ne mutlu\" buyurdu",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2550,
			"arabicnumber": 2550,
			"text": "Abdullah ibn Omer (radıyallahü anh)'den: Peygamber (sallallahü aleyhi ve sellem) şöyle buyurdu: \"Kul efendisine iyilik ve doğrulukla hizmet eder ve Rabb'inin ibâdetini de güzel yaptığı zaman onun ecri iki kat olur",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2551,
			"arabicnumber": 2551,
			"text": "Ebû Mûsâ (radıyallahü anh)'dan: Peygamber (sallallahü aleyhi ve sellem) şöyle buyurmuştur: \"Rabb'inin ibâdetini güzel yapmakta ve üzerinde hak, nasihat, tâat vazifesi bulunan efendisine de bu vazifelerini tam yerine getirtmekte bulunan kölenin de iki ecri vardır",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2552,
			"arabicnumber": 2552,
			"text": "Bize Ma'mer (ibn Râşid), Hemmâm ibn Münebbih'ten haber verdi ki, o, Ebû Hureyre (radıyallahü anh)'yiPeygamber'den hadîs söylerken işitmiştir. Peygamber(sallallahü aleyhi ve sellem) şöyle buyurmuştur: \"Sizin herhangi biriniz (kölesine): Rabb'ini doyur, Rabb'ine abdest aldır, Rabb 'ine su içir! Diye hitâb etmesin. Köle de: Efendim, velî ni'metim! desin. Yine sizin herhangi biriniz (kölesine): Kulum, cariyem! Demesin. Fakat: Yiğidim, kızım, oğlum! Diye hitâb etsin",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2553,
			"arabicnumber": 2553,
			"text": "İbn Omer (radıyallahü anh) şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem) şöyle buyurdu: \"Her kim köleden olan payını âzâd eder ve kendisinin kölenin kıymetine ulaşacak derecede malı da varsa, kölenin âdil suretle kıymeti ta'yîn olunur da köle onun malından hürriyete kavuşturulur. Şayet âzâd edenin malı yoksa köleden âzâd ettiği hissesini âzâd etmiş olur”",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2554,
			"arabicnumber": 2554,
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2555,
			"arabicnumber": 2555,
			"text": "ez-Zuhrî şöyle dedi: Bana Ubeydullah tahdîs edip şöyle dedi: Ben Ebû Hureyre'den ve Zeyd ibn Hâlid (radıyallahü anh)'den işittim.Peygamber (sallallahü aleyhi ve sellem) şöyle buyurmuştur: \"Bir câriye zina ettiği zaman onu kamçılayın. Sonra yine zina ettiğinde onu yine kamçılayın. Sonra yine zina ettiğinde ona yine kamçılama cezası uygulayın. Üçüncüde yahut dördüncüde o cariyeyi kıldan örülmüş bir ip bahasıyla de olsa satınız",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2557,
			"arabicnumber": 2557,
			"text": "Ebû Hureyre (radıyallahü anh), Peygamber(sallallahü aleyhi ve sellem)'in şu hadîsini söylemiştir: \"Sizden birinize, hizmetçisi yemeğini getirdiği zaman eğer hizmetçiyi beraberinde oturtmazsa, efendi hizmetçisine bir yahut iki lokma veya bir yahut iki çiğnem sunsun. Çünkü o yemeğin yapılıp hazırlanması işini bu hizmetçi üzerine almıştır",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2558,
			"arabicnumber": 2558,
			"text": "Abdullah ibn Omer (radıyallahü anh), Rasûlüllah(sallallahü aleyhi ve sellem) şöyle buyururken işitmiştir: \"Her birerleriniz birer çobandır ve elinin altındakilerin lâyıkıyla korunmasından sorumludur. Devlet başkanı da bir çobandır ve idaresi altındakilerden sorumludur. Erkek de ailesi içinde bir çobandır; o da idaresinde olanlardan sorumludur. Kadın da kocasının evinde bir çobandır; o da idaresi altındakilerin iyi korunmasından sorumludur. Hizmetçi de efendisinin malında bir çobandır; o da elinin altındaki emânetlerden sorumludur\". Omer dedi ki; Ben bunları Peygamber'den işittim. Bir de Peygamber'in şöyle buyurduğunu zannediyorum: \"İnsan babasına âid malda da bir çobandır ve elinin altındakilerden sorumludur. Böylece her birerleriniz çoban ve her birerleriniz güttüklerinden sorumludur",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2559,
			"arabicnumber": 2559,
			"text": "Burada ayrı ayrı iki senedle Ebû Hureyre'den getirilen bu hadîste Peygamber(sallallahü aleyhi ve sellem):\"Sizden biriniz (îcâb-ı hâlinde)dövdüğü zaman yüze vurmaktan sakınsın\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 41
			}
		}
	]
}