{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"52": "Witnesses"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2637,
			"arabicnumber": 2637,
			"text": "Ubeydullah'tan rivayet edilmiştir: (Bu hadis, ifk hadisesi ile ilgilidir ve sözleri birbirini doğrulamaktadır.) Aişe'ye iftira atanlar söyleyeceklerini söyledikten sonra vahiy gecikince Nebi Sallallahu Aleyhi ve Sellem Hz. Ali'yi ve Usame'yi yanına çağırdı ve Hz. Aişe'den ayrılma konusunda onlara danıştı. Usame: \"Evliliğini devam ettir. Biz onun hakkında hayırdan başka bir şey bilmiyoruz\" dedi. Berire: \"Ben onun hakkında açıklayacağım hiçbir şey bilmiyorum. Tek kusuru vardır. O da genç kız olmasından dolayı evinin hamurunu yoğururken uyuklayıverir, tavuk da gelir onu yerdi\" dedi. Bunun üzerine Allah Resulü Sallallahu Aleyhi ve Sellem: \"Aile fertlerim hakkında bana sıkıntı veren bir kişiyi (cezalandırmam) konusunda beni kim mazur görür! Öyle bir kişiden söz ediyorlar ki (bu işi yaptı diye öyle birini suçluyorlar ki) onun hakkında hayırdan başka hiçbir şey bilmiyorum\" buyurdu",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2638,
			"arabicnumber": 2638,
			"text": "Zühri'den rivayet edilmiştir: Salim şöyle dedi: Abdullah b. Ömer'i şöyle derken dinlemiştim: Allah Resulü ve Ubey b. Ka'b, İbn Sayyad'ın hurmalığına doğru gittiler. Allah Resulü, hurmalığa girince hurma kütüklerinin arkasına saklandı. İbn Sayyad, kendisini görmeden ondan bazı şeyler duymak istiyordu. İbn Sayyad ise kadife örtülü döşeğine uzanmış, mırıldanıyordu. İbn Sayyad'ın annesi Hz. Nebi'in hurma kütükleri arkasında saklandığını gördü ve İbn Sayyad'a \"Safii Muhammed burada\" dedi. Bunun üzerine İbn Sayyad, mırıldanmayı kesti. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem \"Annesi onu kendi haline bıraksaydı (bazı gizli şeyleri) açıklayacaktı\" buyurdu",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2639,
			"arabicnumber": 2639,
			"text": "Aişe r.anha'dan rivayet edilmiştir: Kureyza kabilesinden Rifaa'nın hanımı, Nebi Sallallahu Aleyhi ve Sellem'e gelerek: \"Rifaa ile evliydim. Beni boşadı, ayrılığımı da kesinleştirdi (yani. Ben de Abdurrahman b. Zübeyr'le evlendim. Ama onun elbisenin eteği gibi bir şeyi var\" dedi. Nebi Sallallahu Aleyhi ve Sellem \"Rifaa'ya dönmek mi istiyorsun? Hayır, sen onun balcağızını, o da senin balcağızını tatmadıkça bu olamaz\" buyurdu. Bu esnada Ebu Bekir Hz. Nebi'in yanında oturuyordu. Halid b. Said de içeri girmek için kapı da müsaade bekliyordu, (onun bu sözüne kulak misafiri olunca) \"Ebu Bekir! Bu kadının Hz. Nebi'in huzurunda alenen söylediği şu sözü duymuyor musun?\" dedi. Tekrar 5260, 5261, 5317, 5792, 5825, 6084",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2640,
			"arabicnumber": 2640,
			"text": "Ukbe b. el-Haris'ten rivayet edilmiştir: Ukbe, Ebu İhab b. Aziz'in kızıyla evlenmişti. Bir kadın kendisine gelerek: \"Ben Ukbe'yi ve evleneceği kızı emzirmiştim\" dedi. Ukbe, \"Ben, senin beni emzirdiğini bilmiyorum, bunu bana önceden haber de vermemiştin\" dedi. Sonra Ebu İhab ailesine haber göndererek bunu sordurdu. Onlar da: \"Kızımızı onun emzirdiğine dair hiçbir şey bilmiyoruz\" dediler. Bunun üzerine Medine'ye Rasulullah'ın yanına giderek ona (ne yapması gerektiğini) sordu. Nebi Sallallahu Aleyhi ve Sellem: \"Böyle bir şey söylenmişken evliliğiniz nasıl devam edebilir!\" buyurdu. Bunun üzerine Ukbe, ondan ayrıldı ve kız, başka biriyle evlendi",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2641,
			"arabicnumber": 2641,
			"text": "Ubeydullah b. Utbe'den rivayet edilmiştir: Ömer İbnü'l-Hattab'ı şöyle derken işittim: İnsanlar Allah Resulü Sallallahu Aleyhi ve Sellem döneminde vahiy ile değerlendiriliyoriardı. Artık vahiy kesilmiştir. Şimdi ise biz sizi görebildiğimiz davranışlarınıza göre değerlendiririz. Bize iyi davranışlar sergileyen kişiye güveniriz ve onu kendimize yaklaştırırız. Yalnızken yaptıklarında ise bizim herhangi bir sorumluluğumuz yoktur. Onu yalnızken yaptıklarından hesaba çekecek olan Allah'tır. Kim de bize kötü davranışlar sergilerse içinin güzel (kalbinin temiz) olduğunu söylese bile ona güvenmeyiz ve onu tasdik etmeyiz",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2642,
			"arabicnumber": 2642,
			"text": "Enes r.a.'den rivayet edilmiştir: Hz. Nebi'in yanında iken bir cenazeye rastlandı. İnsanlar öleni hayırla yad ettiler. Nebi Sallallahu Aleyhi ve Sellem: \"Vacip oldu\" buyurdu. Sonra başka bir cenazeye rastlandı. İnsanlar onun kötülüklerini andılar. Nebi Sallallahu Aleyhi ve Sellem yine: \"Vacip oldu\" buyurdu. Bunun üzerine \"Ey Allah'ın Resulü! Her ikisi için de \"vacip oldu\" buyurdun\" dediler. Nebi Sallallahu Aleyhi ve Sellem: \"Topluluğun şahitliği {makbuldür}. İnananlar, Allah'ın yeryüzündeki şahitleridir\" buyurdu",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2643,
			"arabicnumber": 2643,
			"text": "Ebu'l-Esved'den rivayet edilmiştir: Medine'ye geldim. Orada bulaşıcı bir hastalık başlamıştı ve çok sayıda insan ölüyordu. Ömer'in yanına oturdum. Bir cenaze geçti. İnsanlar onu hayırla yad ettiler. Ömer: \"Vacip oldu\" dedi. Sonra bir cenaze daha geçti. İnsanlar onu da hayırla yad ettiler. Ömer yine: \"Vacip oldu\" dedi. Sonra üçüncü cenaze geçti. İnsanlar onu kötülükleriyle andılar. Ömer yine \"Vacip oldu\" dedi. Bunun üzerine ben \"mu'minlerin emiri! Vacip olan nedir?\" diye sordum. \"Hz. Nebi'in buyurduğu gibi söyledim\" dedi. Hz. Nebi Sallallahu Aleyhi ve Sellem: \"Bir müslümana dört kişi hayırla şahitlik ederse Allah onu Cennet'e koyar\" buyurmuştu. Biz \"ya üç kişi?\" diye sorduk. \"Üç kişi de .. \" buyurdu. Biz \"Peki ya iki kişi?\" diye sorduk. Hz. Nebi Sallallahu Aleyhi ve Sellem \"İki kişi de ... \" buyurdu. Sonra biz bir kişinin şahitliğini sormadık",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2644,
			"arabicnumber": 2644,
			"text": "Aişe r.anha'dan rivayet edilmiştir: Eflah benim yanıma girmek için müsaade istedi. Ben müsaade vermedim. Bunun üzerine Eflah: \"Benden mi saklanıyorsun? Ben senin amcanım\" dedi. \"Bu nasılolur!\" dedim. \"Kardeşimin hanım ı seni kardeşimin sütüyle emzirmişti\" dedi. Allah Resulü Sallallahu Aleyhi ve Sellem'e bunun doğru olup olmadığını sordum. O da: \"Eflah doğru söylüyor, ona müsaade ver\" buyurdu. Tekrar 4796, 5103, 5111, 5229, 6156",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2645,
			"arabicnumber": 2645,
			"text": "Abdullah b. Abbas'tan rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem Hamza'nın kızı hakkında: \"O, bana helal değildir, Nesepten haram olan süt emmeden de haram olur. O, benim süt kardeşimin kızıdır\" buyurdu. Tekrar 5100",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2646,
			"arabicnumber": 2646,
			"text": "Amra binti Abdurrahman'dan rivayet edilmiştir: Hz. Nebi'in hanımı Aişe r.anha ona şöyle haber vermiştir: Hz, Nebi (Sallallahu aleyhi ve Sellem)'in yanındaydım. Hafsa'nın odasında (içeri girmek için) müsaade isteyen bir erkeğin sesini duydum: \"Ey Allah'ın Resulü! Sanırım bu seslenen, -Hafsa'nın süt amcası- falancadır. Ey Allah'ın Resulü' Bu adam senin evine girmek için müsaade istiyor\" dedim. Allah Resulü: \"Sanırım bu, -Hafsa'nın süt amcası- falancadır\" buyurdu. Bunun üzerine ben -kendi süt amcasından söz ederek- \"Falanca hayatta olsaydı benim yanıma girebilirdi\" dedim. Bunun üzerine Allah Resulü Sallallahu Aleyhi ve Sellem: \"Evet, Doğumdan haram olan süt emmeden de haram olur\" buyurdu. Tekrar 3105, 5099",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2647,
			"arabicnumber": 2647,
			"text": "Mesruk'tan rivayet edilmiştir: Aişe r.anha şöyle demiştir: Yanımda bir erkek oturuyorken Nebi Sallallahu Aleyhi ve Sellem yanıma girdi. Nebi Sallallahu Aleyhi ve Sellem: \"Aişe! Bu kimdir?\" dedi. \"Süt kardeşimdir\" dedim. Bunun üzerine \"Aişe! Kardeşlerinizin kimler olduğu konusunda iyi düşünün. Çünkü (haramlığı gerektiren) süt emme, açlıktan olandır\" buyurdu. Tekrar 5102",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2648,
			"arabicnumber": 2648,
			"text": "İbn Şihab'dan rivayet edilmiştir: Urve b. Zübeyr bana şöyle anlattı: Mekke'nin fethi sırasında bir kadın hırsızlık etmişti. Allah Resulü'ne getirildi. Nebi Sallallahu Aleyhi ve Sellem'in emri üzerine kadının eli kesildi. Aişe r.anha şöyle demiştir: \"O kadın güzel bir tövbe etti ve evlendi. Elinin kesilmesinden sonra bir ihtiyacı olduğunda Nebi Sallallahu Aleyhi ve Sellem’e gelir ve ihtiyacını ona arzederdi.\" Tekrar: 3475, 3732, 3733, 4304, 6787, 6800",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2649,
			"arabicnumber": 2649,
			"text": "Zeyd b. Halid el-Cüheni şöyle demiştir: Ben Nebi sallallahu aleyhi ve sellem'den işittim, Zina eden muhsan olmayan (evli olmayan ve öncedende evlenmemiş) kimseler hakkında yüz sopa vurmayı ve bir yıl sürgüne göndermeyi emrediyordu. Tekrar: 6831",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2650,
			"arabicnumber": 2650,
			"text": "Nu'man b. Beşır r.a.'den rivayet edilmiştir: Annem babamdan malının bir kısmını bana bağışlamasını istemişti. Bir süre sonra babam bunu uygun görerek malının bir kısmını bana bağışladı. Annem \"Hz. Nebi'i buna şahit tutmadıkça razı olmam\" dedi. Bunun üzerine babam -ben küçükken- elimden tuttu ve birlikte Nebi Sallallahu Aleyhi ve Sellem'e gittik. Babam Rasulullah'a: \"Bunun annesi Bintu Revaha benden malımın bir kısmını buna bağışlamamı istedi\" dedi. Nebi Sallallahu Aleyhi ve Sellem: \"Başka çocuğun var mı?\" diye sordu. Babam \"evet\" dedi. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem: \"Beni zulme şahit tutma\" buyurdu. Ebu Hureyz, Şa'bi kanalıyla \"Ben zulme şahit olmam\" şeklinde bir başka ibare ile nakletmiştir",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2651,
			"arabicnumber": 2651,
			"text": "İmran b. Husayn r.a.'dan rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"En hayırlı nesil benim zamanımda yaşayan nesildir; sonra onların ardından gelenler; sonra da onların ardından gelenlerdir.\" İmran diyor ki: \"Nebi (Sallallahu aleyhi ve Sellem) iki mi, yoksa üç nesil mi saydı hatırlamıyorum.\" Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Sizden sonra öyle bir topluluk gelecek ki hıyanet edecekler ve onlara güvenilmeyecek; şahitlik yapacaklar ama şahitlik yapmaları istenmeyecek, adak adayacaklar ama yerine getirmeyecekler ve onlarda aşırı kiloluluk (şişmanlık, obezlik hastalığı) baş gösterecektir. \" Tekrar: 3651, 6429, 6695",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2652,
			"arabicnumber": 2652,
			"text": "Abdullah r.a.'dan rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"En hayırlı nesil benim zamanımda yaşayan nesildir; sonra onların ardından gelenler; sonra da onların ardından gelenlerdir. Sonra öyle bir topluluk gelecek ki şahitlikleri yeminlerini; yeminleri şahitliklerini geçecek.\" İbrahim (en-Nahai) şöyle demiştir: \"(Biz küçükken) şahitlik ediyoruz ve söz veriyoruz diye (büyüklerimiz) bizi döverdi",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2653,
			"arabicnumber": 2653,
			"text": "Enes r.a.'den rivayet edilmiştir: Nebi'e Sallallahu Aleyhi ve Sellem büyük günahlar soruldu. şöyle buyurdu: \"Allah'a şirk koşmak, anne-babaya karşı gelmek, insan öldürmek ve yalan yere şahitlik etmektir.\" Tekrar: 5977, 6871",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2654,
			"arabicnumber": 2654,
			"text": "Abdurrahman b. Ebi Bekre, babasından rivayet etmiştir: Nebi Sallallahu Aleyhi ve Sellem, \"Size büyük günahların en büyüklerini söyleyeyim mi?\" buyurdu ve bu sözünü üç kez tekrarladı. \"Elbette, Ey Allah'ın Resulü!\" dediler. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem: \"Allah'a şirk koşmak, anne babaya karşı gelmek, -yaslanıyordu, sonra doğrulup oturdu ve şöyle devam etti- ve yalan yere şahiflik etmek\" buyurdu. Bu sözünü de o kadar tekrarladı ki biz \"artık sussa\" diyecek olduk. Tekrar: 5976, 6273, 6274, 6919 Diğer tahric: Tirmizi Tefsirul Kur’an; Müslim, Eyman:",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2655,
			"arabicnumber": 2655,
			"text": "Aişe r.anha'dan rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem mescidde Kur'an okuyan birini duydu ve: \"Allah ona merhamet etsin. Bana falanca sureden düşürdüğüm (unuttuğum) şu ayetleri hatırlattı\" buyurdu. Abbad b. Abdullah, Aişe'nin şu sözünü de eklemiştir: \"Rasulullah benim evimde teheccüd namazı kıldı, o sırada mescitten bir ses işitti. Bana dönüp: Aişe! Bu Abbad'ın sesi mi?\" buyurdu. \"evet\" dedim. \"Allahım! Abbad'a merhamet eyle\" dedi. Tekrar: 5037, 5038, 5042, 6335",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2656,
			"arabicnumber": 2656,
			"text": "Abdullah b. Ömer'den rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Bilal ezanı geceden okur. Siz İbn Ümmü Mektum'un ezanını duyuncaya kadar yiyip içmeye devam edin.\" İbn Ümmü Mektum, görme engelliydi. İnsanlar ona \"sabah vakti girdi\" deyinceye kadar ezan okumazdı",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2657,
			"arabicnumber": 2657,
			"text": "Misver b. Mahreme'den rivayet edilmiştir: Nebi'e Sallallahu Aleyhi ve Sellem birkaç elbise getirilmişti. Babam Mahreme bana \"Kalk gidelim; belki Allah Resulü bize de bu elbiselerden verir\" dedi. Babam Hz. Nebi'in kapısında ayakta durdu ve bir şeyler söyledi. Nebi Sallallahu Aleyhi ve Sellem onun sesini tanıdı ve elinde bir takım elbise ile birlikte dışarı çıktı. Elbisenin güzelliklerini ona gösteriyordu, bir yandan da: \"Bunu senin için sakladım; bunu senin için sakladım\" diyordu",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2658,
			"arabicnumber": 2658,
			"text": "Ebu Said el-Hudri r.a.'den rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem \"Kadının şahitliği, erkeğin şahitliğinin yarısı kadar değil midir?\" diye sordu. Kadınlar \"Evet, öyledir\" dediler. Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem) \"İşte bu, onların akıllarının eksikliğindendir\" buyurdu",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2659,
			"arabicnumber": 2659,
			"text": "İbn Cüreyc'ten rivayet edilmiştir: İbn Ebı Müleyke'nin şöyle dediğini işittim. Ukbe b. Haris bana şöyle rivayet etti (veya onu şöyle söylerken işittim): \"Ümmü Yahya binti Ebi İhab ile evlenmiştim. Zenci bir cariye gelerek \"Ben ikinizi de emzirmiştim\" dedi. Bunun üzerine olayı Hz. Nebi'e anlattım. Nebi Sallallahu Aleyhi ve Sellem bana yüzünü döndü. Ben de yanına varıp tekrar söyledim. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem: \"Bu kadın sizi emzirdiğini iddia ettiği halde sen onunla nasıl evli kalabilirsin!\" buyurarak onun evliliğini sürdürmesine izin vermedi",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2660,
			"arabicnumber": 2660,
			"text": "Ukbe İbnü'l-Haris r.a.'den rivayet edilmiştir: Bir kadınla evlenmiştim. Bir başka kadın gelerek \"Ben sizin ikinizi de emzirmiştir\" dedi. Bunun üzerine Hz. Nebi'e gelerek durumu ona arzettim. Nebi Sallallahu Aleyhi ve Sellem: \"Böyle bir söz söylenmiş iken evliliğini nasıl sürdürebilirsin' Onu bırak\" buyurdu",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2661,
			"arabicnumber": 2661,
			"text": "Nebi s.a.v.'in hanımı Aişe r.anha'dan rivayet edilmiştir: Hz. Aişe bu sözü, ifk olayına karışanlar ona iftira attıktan sonra Allah kendisini temize çıkarınca söylemiştir. Zührı, diyor ki: Bu olayı bana bir grup anlattı. O gruptakilerden bir kısmı olayı diğerlerinden daha net hatırlıyor ve daha güzel anlatıyordu. Ben hepsinin Aişe hakkında anlattığı bu olayı dinleyip öğrendim. Onların anlattıkları birbirini doğrular niteliktedir. Hz. Aişe'nin şöyle dediğini naklettiler: Nebi Sallallahu Aleyhi ve Sellem bir yolculuğa çıkacağı zaman hanımları arasında kur'a çekerdi. Kur'ada kim çıkarsa onu yanında götürürdü. Bir savaşa çıkacağı sırada yine bizim aramızda kur'a çekmiş ve bu kez kur'a bana çıkmıştı. Onunla birlikte yola çıktım. Bu olay öncesinde örtünme emri indirilmişti. Ben deve sırtında bir mahfelde taşınıyor ve yere indiriliyordum. Yola böyle devam ettik. Savaş sona erdi ve geriye döndük. Medine'ye yakın bir yerde konaklamıştık. Geceleyin yola çıkılması için duyuru yaptırdı. Yola çıkılacağı duyurusu yapılınca ben kalkıp ordudan biraz ileriye yürüdüm. İhtiyacımı gördükten sonra mahfelime doğru yürümeye başladım. Bu sırada elimi göğsüme koydum ve Yemen işi gerdanlığımın düşmüş olduğunu fark ettim. Geri dönüp gerdanlığımı aramaya başladım. Onu bulma arzusu beni ordudan geride bırakmıştı. Bu sırada beni taşımakla görevli askerler, gelip benim mahfelimi taşımış ve içinde olduğumu sanarak deveme bindirmişler. O günlerde kadınlar, hafif yiyecekler yedikleri için ağır olmazlardı. Bu yüzden, askerler mahfelimi kaldırınca mahfelin hafifliğini fark edemeden devenin üzerine koymuşlar. Ben de zaten genç yaşta bir kızcağız idim. Deveyi sürüp gitmişler. Gerdanlığımı ancak ordu oradan ayrıldıktan sonra bulabildim. Konaklama yerine geldim ki kimsecikler yok. Kendi konakladığım yere vardım. Sanıyordum ki benim olmadığımı fark edecekler ve gerisin geriye dönecekler. Otururken gözlerimi tutamayıp uyumuşum. Süleym-oğulları kabilesinden Safvan b. Muattal ordunun gerisinden geliyormuş. Benim konakladığım yerden geçerken uyuyan bir kişinin karaltısını fark edip gelmiş. Hicab ayetleri ve örtünme emri inmeden önce beni görürdü. (Yüksek sesle) \"inna lillah ve inna ileyhi raciun\" demesiyle uyandım. Devesini çöktürdü ve ben deveye bindim. Yola koyulduk. Ordu, Nahru'z-zahira mevkiinde konaklamış. Orada yetiştik. Mahvolanlar işte orada mahvoldu. İftirayı ilk çıkaran Abdullah b. Ubey b. Seıül'dü. Medine'ye vardık ve ben rahatsızlandım. Bu rahatsızlığım tam bir ay sürdü. Bu süre zarfında birkaç kişinin attığı iftira herkesin diline düşmüş. Hastalığım sırasında Hz. Nebi'den görmeye alıştığı m eski iltifatını, inceliğini göremediğim için kuşkulanmıştım. Yalnızca içeri giriyor, selam verdikten sonra \"Nasılsınız?\" diyordu. İyileşinceye kadar ne olup bitti, bir şey hatırlamıyorum. İyileşmeye yakın günlerimden birinde Mistah'ın annesiyle birlikte Medine'nin dışında tuvalet olarak kullandığımız yere gittik. Oraya ancak geceleri giderdik. O sırada, henüz evlerimizin yakınında tuvaletlerimiz yoktu. Araplar önceden sahrada ne yaparlarsa (ihtiyaçlarını nasıl görürlerse) biz de öyle yapıyorduk. Ebu Rühem'in kızı olan Mistah'ın annesiyle yolda yürürken elbisesine takıldı ve \"Geberesice Mistah!\" dedi. \"Ne kötü konuşuyorsun! Bedir savaşına katılmış birine beddua mı ediyorsun?\" dedim. \"Kızcağızım! Hiç duymadın mı neler söylüyorlar?\" dedi ve iftiracıların söylediklerini bana anlattı. Bu söz üzerine hastalığım bir kat daha arttı. Evime döndüm. Allah Resulü Sallallahu Aleyhi ve Sellem yanıma girip selam verdi ve \"Nasılsınız?\" dedi. \"Bana izin versen de anne-babamın evine gitsem\" dedim. Olayı bir de onlardan dinlemek istiyordum. Allah Resulü Sallallahu Aleyhi ve Sellem bana izin verdi. Annemın-babamın yanına geldim ve anneme: \"İnsanlar neler söylüyorlar?\" dedim. Annem: \"Kızcağızım! Sen kendini üzme Allah'a yemin ederim ki, bir kadın kocası tarafından sevilip kocası ona değer verdiğinde diğer hanımları onun lafını ederler\" dedi. \"Demek insanlar bunu konuşabiliyorlar ha!\" dedim. O gece sabaha kadar gözümün yaşı dinmedi ve gözlerime uyku girmedi. Sabahleyin Allah Resulü Sallallahu Aleyhi ve Sellem Ali b. Ebu Talib'i ve Usame b. Zeyd'i yanına çağırdı. Vahiy geciktiği için benden ayrılıp ayrılmamak konusunda onların görüşünü almak istemişti. Usame, Hz. Nebi'in duymak istediği şeyi söylemiş ve: \"Ey Allah'ın Resulül O senin ailen. Allah'a yemin olsun ki, biz onun hakkında iyilikten başka bir şey bilmeyiz\" demişti. Ali b. Ebu Talib ise: \"Ey Allah'ın Resulü' Allah kadınları bitirmedi ya. Onun dışında bir sürü kadın var. Cariyene sor, sana işin doğrusunu söylesin\" dedi. Bunun üzerine Allah Resulü Sallallahu Aleyhi ve Sellem Berire'yi çağırdı ve \"Berire! Sen hiç Aişe'de seni kuşkulandıran bir hal gördün mü?\" buyurdu. Berire: \"Seni hak Nebi olarak gönderen Allah'a yemin ederim ki, ben onda ayıplayabileceğim en ufak bir hal görmedim. Tek bir kusuru var, genç bir kız olması. Hamurunun üstünü açık bırakıp uyur. Tavuk da gelip onu yiyiverir\" dedi. Allah Resulü, aynı gün kalktı ve Abdullah b. Ubey b. Selul'ün bu yaptığının karşılıksız kalmamasını isteyerek: \"Ailem hakkında bana cefa eden bu adam'ın cezasını kim verir? Ben ailem hakkında iyilikten başka bir şey bilmiyorum. Ve öyle bir adam'dan söz ediyorlar ki onun hakkında da iyilikten başka bir şey bilmem. Ailemin yanına da bensiz asla girmez\" buyurdu. Sa'd b. Muaz kalktı ve \"Ey Allah'ın Resulü! Allah'a yemin ederim ki ben onun cezasını veririm. Evs kabilesindense boynunu vururuz. Din kardeşlerimizden olan Hazreç kabilesindense buyurduğun gibi yaparız\" dedi. Bunun üzerine Hazrec kabilesinin lideri Sa'd b. Ubade kalktı ve: \"Allah'a yemin ederim ki yalan söylüyorsun. ValIahi! Sen onu öldürmezsin. Öldürmeye gücün yetmez\" dedi. -Sa'd b. Ubade iyi bir adamdı ama ansızın kabilecilik damarı tutmuştu.- Bunun üzerine Useyd b. Hudayr: \"Allah'a yemin ederim ki, asıl sen yalan söylüyorsun. ValIahi! Onu öldürürüz. Sen münafık mısın, Münafıkları nasıl savunabilirsin?\" dedi. Bunun üzerine Evs ve Hazreç kabileleri ayağa kalktı, neredeyse aralarında kavga çıkacaktı. Bu esnada Nebi Sallallahu Aleyhi ve Sellem minberdeydi. Derhal minberden inerek onları yatıştırdı. Onlar susunca Hz. Nebi de sustu. Ben gün boyunca ağladım, ne gözümün yaşı diniyordu, ne de gözüme bir parça uyku giriyordu. Annem-babam da benim yanımda kaldılar. İki gece ve bir gün boyunca aralıksız ağladım. Öyle ağlıyordum ki ağlamak ciğerimi parçalayacak sandım. Anne-babam benim yanımda oturuyorlar ve ben ağlıyordum. Derken ensardan bir kadın içeri girmek için müsaade istedi. Gel dedim. Oturdu, o da benimle birlikte ağlamaya başladı. Biz bu haldeyken Allah Resulü Sallallahu Aleyhi ve Sellem içeri girip yanıma oturdu. O söylenti çıkalı beri yanıma hiç oturmamıştı. Tam bir ay geçti ama hakkımda hiçbir vahiy gelmemişti. Kelime-i şehadeti söyledi. Sonra: \"Aişe! Senin hakkında bana bazı şeyler anlatıldı. Suçsuzsan Allah seni aklayacaktır. Yok eğer bir günah işlediysen Allah'tan bağışlanma dile ve tevbe et. Çünkü kul günahını itiraf edip tevbe ederse Allah onun tevbesini kabul eder\" buyurdu. Allah Resulü Sallallahu Aleyhi ve Sellem sözünü bitirir bitirmez gözümün yaşı kesildi. Bir damla bile geldiğini hissetmiyordum. Babama \"Benim adıma Allah Resulü'ne cevap ver\" dedim Babam: \"Vallahi! Ben Allah Resulü’ne ne cevap vereyim bilemiyorum\" dedi. Sonra anneme: \"Benim adıma Allah Resulü'ne cevap ver\" dedim. O da: \"Vallahi! Allah Resulü'ne ne diyeyim bilemiyorum\" dedi. Genç bir kızdım ve Kur'an'dan çok bir şey bilmiyordum. Dedim ki: \"Vallahi! insanların söylediğini duydunuz ve bildiniz. Söylentiler kalbinizde yer tuttu ve bunlara inanma noktasına geldiniz. Ben suçsuz olduğumu söylesem bile -ki Allah suçsuz olduğumu biliyor- siz bana inanacak değilsiniz. Size herhangi bir itirafta bulunsam -ki Allah suçsuz olduğumu biliyor- siz beni doğrulayacaksınız. ValIahi! Ben, benim ve sizin hakkınızda Yusuf'un babasının söylediği \"Bana düşen güzelce sabretmektir. Allah sizin anlattıklarınız konusunda yardımını isteyeceğim tek sığınaktır\" sözünden daha uygun bir söz bilmiyorum.\" Sonra yatağıma döndüm ve Allah'ın beni aklamasını beklemeye başladım. Fakat doğrusu benim hakkımda vahiy indirileceğini de sanmıyordum. Ben, Kur'an'da kendisinden söz edilmeyecek kadar değersiz biriyim. Ben, Allah Resulü'nün beni aklayan bir rüya görmesini umuyordum. ValIahi! Allah Resulü daha yerinden kalkmamıştı, aile fertlerinden kimse de ev'den ayrılmamıştı. Oracıkta vahiy indiriliverdi. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem'den öyle bir ter boşandı ki kış gününde alnından ve vücudundan boncuk boncuk ter akıyordu. Allah Resulü'nün sıkıntısı giderilip iş açığa çıkarılınca gülmeye başladı. ilk söylediği söz: \"Aişe' Allah'a şükret. Seni akladı\" oldu. Annem \"Allah Resulü için ayağa kalk\" dedi. Ben: \"Vallahi! Onun için ayağa kalkmam. Allah'tan başkasına da şükretmem\" dedim. Allah Teala: \"Bu ağır iftirayı uyduranlar şüphesiz sizin içinizden bir gruptur ... \"[Nur 11] ayetini indirmişti. Allah benim suçsuzluğumu belgeleyen bu ayetleri indirince Ebu Bekir, -Mistah b. Usase ile akrabalığı olduğu için ona yardımda bulunurdu- \"Vallahi! Aişe hakkında bunları söyledi ya, daha Mistah'a hiçbir yardımda bulunmam\" dedi. Bunun üzerine Allah Teala: \"İçinizden faziletli ve servet sahibi olanlar akrabaya ... {mallarından vermeyeceklerine yemin etmesinler. Bağışlasınlar, feragat göstersinler. Allah'ın sizi bağışlamasını arzulamaz mısınız? Allah çok bağışlayandır, çok merhametlidir\" [Nur 22] buyruğunu indirdi. Bu ayet inince Ebu Bekir, \"Allah'a yemin . ederim ki elbette Allah'ın beni bağışlamasını isterim\" dedi ve Mistah'a yardım etmeme yeminini bozdu. Allah Resulü Sallallahu Aleyhi ve Sellem Zeynep binti Cahş'a da benim durumumu sorarak, \"Zeynep! Sen bu olay hakkında ne bildin, ne gördün?\" demişti. Zeynep, \"Ey Allah'ın Resulü! Ben kulağımı ve gözümü korurum. Vallahi' Onun hakkında iyilikten başka bir şey bilmem\" diye cevap verdi. Aişe diyor ki: \"Zeynep de benim gibi güzel ve Hz. Nebi katında değerliydi. Bu sebeple Allah ona verdiği takva ile onu korudu",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2662,
			"arabicnumber": 2662,
			"text": "Abdurrahman b. Ebu Bekre r.a.'den rivayet edilmiştir: Ebu Bekre şöyle anlatmıştır: Birisi Hz. Nebi'in huzurunda bir başkasını övmüştü. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem: \"Arkadaşının boynunu vurdun Arkadaşının boynunu vurdun\" dedi. (Bunu birkaç kez tekrarladı.) Sonra şöyle devam etti: \"Birini illa ki övecekseniz bari \"Falanca hakkında şöyle düşünüyorum Ama onun gerçekte nasıl biri olduğunu Allah bilir. Ben Allah'a rağmen kimseyi temize çıkaramam Ama onun iyi bir kişi olduğunu düşünüyorum\" deyin Tabii onu öyle biliyorsanız!\" Tekrar: 6061, 6162",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2663,
			"arabicnumber": 2663,
			"text": "Ebu Musa r.a.'dan rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem birini öven veya onun hakkında methiyeler dizen birini duymuştu. \"Adamın omurgasını kırdınız\" buyurdu. Tekrar: 6060",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2664,
			"arabicnumber": 2664,
			"text": "Abdullah b. Ömer'den rivayet edilmiştir: İbn Ömer, Allah Resulü Sallallahu Aleyhi ve Sellem'e henüz on dört yaşında iken Uhud savaşına katılmak için teklif edilmişti. Hz. Nebi onun katılmasını kabul etmedi. Sonra on beş yaşında iken Hendek savaşına katılması teklif edildi ve Hz. Nebi onu kabul etti. Nafi' şöyle demiştir: Ömer b. Abdülaziz'e gelerek bu olayı ona aktardım. \"Bu, küçükle büyük arasındaki sınırdır\" diyerek valilerine on beş yaşına girmiş olanlar için ordu divanından maaş bağlanmasını emretmiştir. Tekrar: 4097 Diğer tahric: Tirmizi Ahkam Tirmizi der ki: İbn ebî Ömer, Sûfyân b. Uyeyne yoluyla Ubeydullah b. Ömer’den, Nafi’den, İbn Ömer’den bu hadisin bir benzerini rivâyet etmiş olup bu rivâyetinde: “Ömer b. Abdulaziz’in küçük ile büyük arasındaki yaş sınırının bu olduğunu yazı ile bildirdi” bölümünü zikretmemiştir. İbn Uyeyne rivâyetinde ise Nafi’ şöyle der: “Buhadisi Ömer b. Abdulaziz’e rivâyet ettiğimde işte bu savaşa katılamayanlar ile savaşa katılabilecekler arasındaki yaş sınırıdır” dedi. Tirmizî: Bu hadis hasen sahihtir. İlim adamlarının bir kısmının uygulaması bu hadise göre olup Sûfyân es Sevrî, İbn’ül Mübarek, Şâfii, Ahmed ve İshâk bunlardandır ve şöyle derler: “On beş yaşını dolduran kimsenin erkek konumunda olduğu, on beş yaşından önce ihtilam olanların da yine erkek konumuna geldikleri görüşündedirler.” Ahmed ve İshâk ise şöyle derler: Ergenlik bûluğ yaşına girmek üç modelle bilinir: 1- On beş yaşını doldurmak, 2- İhtilam olmak, 3- Yaş ve ihtilam olması bilinmez ise kasıklardan kıl bitmesi",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2665,
			"arabicnumber": 2665,
			"text": "Ebu Said el-Hudri'den rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"İhtilam olan (baliğ olan) herkesin Cum'a günü boy abdesti alması farzdır",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2666,
			"arabicnumber": 2666,
			"text": "Abdullah r.a.'dan rivayet edilmiştir: Allah Resulü Sallallahu Aleyhi ve Sellem \"Her kim bir müslümanın malını elinden almak için haksız yere yemin ederse Allah'ın huzuruna vardığında Allah'ın kendisine gazablandığını! kendisine kızmış olduğunu görür\" buyurmuştu. Eş'as b. Kays \"Allah'a yemin ederim ki bu hadis benimle ilgiliydi. Bir Yahudi ile benim ortak bir tarlamız vardı. Yahudi benim payımı inkar etti. Nebi s.a.v.'e gelerek durumu kendisine arz ettim. Nebi Sallallahu Aleyhi ve Sellem: \"Delilin şahidin var mı?\" diye sordu. \"Hayır\" dedim. Yahudiye \"Yemin et\" dedi. Bunun üzerine ben: \"Ey Allah'ın Resulü! O çekinmeden yemin eder ve malımı elimden alır\" dedim. Bunun üzerine: \"Allah'a karşı verdikleri sözü ve yeminlerini az bir bedelle değiştirenlere gelince, işte bunların ahirette bir payı yoktur. Kıyamet günü Allah onlarla konuşmayacak, onlara bakmayacak ve onları temize çıkarmayacaktır. Onlar için acı bir azap vardır\" [AI-i İmran 77] ayeti indirildi",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2668,
			"arabicnumber": 2668,
			"text": "İbn Ebi Müleyke'den rivayet edilmiştir: \"İbn Abbas r.a. bana mektup yazarak Hz. Nebi'in davalıyı yemin etmekle yükümlü tuttuğunu bildirdi",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2669,
			"arabicnumber": 2669,
			"text": "Ebu Vail r.a.'den rivayet edilmiştir: Abdullah şöyle demiştir: Nebi (Sallallahu aleyhi ve Sellem) \"Her kim başkasına ait bir mala sahip olmak için haksız yere yemin ederse Allah'ın huzuruna vardığında Allah'ın kendisine gazablandığını görür\".\" (buyurmuştu.) Sonra Allah bunu doğrulayan şu ayeti indirdi: \"Allah'a karşı verdikleri sözü ve yeminlerini az bir bedelle değiştirenlere gelince, işte bunların ahirette bir payı yoktur. Kıyamet günü Allah onlarla konuşmayacak, onlara bakmayacak ve onları temize çıkarmayacaktır. Onlar için acı bir azap vardır\"[Al-i İmran 77] Sonra Eş'as b. Kays bir gün çıkıp yanımıza (Ebu Vail'in bulunduğu bir meclise) geldi ve \"Abdurrahman (İbn Mes'ud) size ne anlattı?\" diye sordu. Biz de İbn Mes'ud'un sözünü ona söyledik. Bunun üzerine şöyle dedi: \"Doğru söylemiş. O ayet benim hakkımda indirilmişti. Ben biriyle mahkemelik olmuştum. Allah Resulü'ne gittik. Nebi Sallallahu Aleyhi ve Sellem: \"Ya iki şahit getirirsin, ya yemin eder\" buyurdu. Bunun üzerine ben \"İyi de o yemin eder ve hiç de umursamaz\" dedim. Nebi Sallallahu Aleyhi ve Sellem: \"Her kim haksız yere yemin ederek bir mala sahip olursa• Allah'ın huzuruna, O, kendisine öfkelenmiş olarak çıkar\" buyurdu. Allah da bunu doğrulayan bu ayetleri indirdi",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2671,
			"arabicnumber": 2671,
			"text": "İbn Abbas r.a.'dan rivayet edilmiştir: Hilal b. Ümeyye r.a. Nebi (Sallallahu aleyhi ve Sellem)'in huzurunda hanımının Şerik b. Sahma ile zina ettiğini söylemişti. Nebi Sallallahu Aleyhi ve Sellem: \"Ya şahit getirirsin, ya da sırtına sopa yersin\" buyurdu. Hilal: \"Ey Allah'ın Resulü! Bir adam hanımının üzerinde bir erkek gördüğünde hiç gider de şahit arar mı?\" dedi. Hz. Nebi yine: \"Ya şahit getirirsin, ya da sırtına sopa yersin\" buyurdu. İbn Abbas daha sonra lian hadisini zikretti. Tekrar: 4747, 5307",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2672,
			"arabicnumber": 2672,
			"text": "Ebu Hureyre r.a.'den rivayet edilmiştir: Allah Resulü Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Üç kişi var ki (kıyamet günü) Allah onlarla konuşmaz, onlara bakmaz, onları arındırmaz ve onlar için acı bir azap vardır: Tarlasında ihtiyacından fazla suyu olduğu halde yoldan geçenlerin ondan faydalanmasını engelleyen kişi, birisiyle sadece dünyalık için alışveriş yapan, karşısındaki istediğini verirse ona veren, vermezse eksilten kişi ve ikindiden sonra bir malın pazarlığını yaptıktan sonra \"Vallahi ona şunu ve şunu verdim, o da aldı\" diye yemin eden kişi",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2673,
			"arabicnumber": 2673,
			"text": "Abdullah b. Mes'ud r.a.'dan rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem \"Her kim birinin malını elinden almak için (yalan yere) yemin ederse Allah'ın huzuruna vardığında, Allah'ın ona gazab etmiş olduğunu görecektir.'' buyurmuştur",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2674,
			"arabicnumber": 2674,
			"text": "Ebu Hureyre r.a.'den rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem bir topluluğa yemin teklif etmiş ve bir ağızdan yemin etmeye başlamışlardı. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem bir sıra belirleyerek sıra ile yemin etmelerini emretti. باب: قول الله تعالى: {إن الذين يشترون بعهد الله وأيمانهم ثمنا قليلا}. 25. ALLAH TEALA \"ALLAH'A KARŞI VERDİKLERİ SÖZÜ VE YEMİNLERİNİ AZ BİR BEDELLE DEGİŞTİRENLERE GELİNCE, İŞTE BUNLARIN AHİRETTE BİR PAYI YOKTUR. KIYAMET GÜNÜ ALLAH ONLARLA KONUŞMAYACAK, ONLARA BAKMAYACAK VE ONLARI TEMİZE ÇIKARMAYACAKTIR\" [Al-i imran 77] BUYURMUŞTUR",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2675,
			"arabicnumber": 2675,
			"text": "Abdullah b. Ebu Evfa'dan rivayet edilmiştir: Bir adam satılık eşyasını (kalabalık bir yere) koyarak \"Allah'a yemin ederim ki bu mal'a senin teklif ettiğinden çok daha fazla para teklif edildi (de vermedim)\" diye yemin etti. Bunun üzerine \"Allah'a karşı verdikleri sözü ve yeminlerini. .. \"(Al-i imran 77) ayeti indirildi. İbn Ebi Evfa \"Pazarlık kızıştıran, faizcidir ve haindir\" demiştir",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2676,
			"arabicnumber": 2676,
			"text": "Abdullah r.a.'dan rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem \"Her kim birinin malını elinden almak için yalan yere yemin ederse Allah'ın huzuruna, O, kendisine kızmış olarak çıkar.\" buyurdu. Sonra Allah bunu doğrulayıcı olarak \"Allah'a karşı verdikleri sözü ve yeminlerini. .. \" (Al-i imran 77) ayetini indirdi. Sonra Eş'as'a rastladım. \"Abdullah bugün size ne anlattı\" diye sordu. Ben de şunları, şunları anlattı, dedim. Bunun üzerine Eş'as bu ayet benim hakkımda indirilmiştiı dedi",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2678,
			"arabicnumber": 2678,
			"text": "Süheyl b. Malik'ten rivayet edilmiştir: Onun babası Talha b. Ubeydullah'ı şöyle derken dinlemiştir: Allah Resulü Sallallahu Aleyhi ve Sellem'e birisi gelerek İslam'ın ne olduğunu sordu. Allah Resulü Sallallahu Aleyhi ve Sellem: \"Gündüz ve gecede beş vakit namazdır\" buyurdu. Adam \"Başka bir namaz kılmam gerekir mi?\" diye sordu. Nebi Sallallahu Aleyhi ve Sellem \"Hayır, ama nafile namaz kılabilirsin\" buyurdu. Allah Resulü Sallallahu Aleyhi ve Sellem \"Ramazan ayı orucudur\" diye devam etti. Adam \"Başka bir oruç tutmam gerekir mi?\" diye sordu. Nebi Sallallahu Aleyhi ve Sellem \"Hayır, ama nafile oruç tutabilirsin\" buyurdu. Sonra Allah Resulü Sallallahu Aleyhi ve Sellem ona zekat ibadetinden söz etti. Adam \"Başka bir sadaka vermem gerekir mi?\" diye sordu. Nebi Sallallahu Aleyhi ve Sellem \"Hayır, ama nafile sadaka verebilirsin\" buyurdu. Adam \"Vallahi! Ben buna ne bir şeyeklerim, ne de eksik yaparım\" diyerek çekip gitti. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem: \"Sözünde durursa kurtulur\" buyurdu",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2679,
			"arabicnumber": 2679,
			"text": "Nafi’ Abdullah r.a.'den rivayet etmiştir: Nebi Sallallahu Aleyhi ve Sellem \"Her kim yemin edecekse Allah adına yemin etsin ya da sussun\" buyurmuştur. Tekrar: 3836, 6108, 6646, 6648",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2680,
			"arabicnumber": 2680,
			"text": "Ümmü Seleme r.anha'dan rivayet edilmiştir: Allah Resulü Sallallahu Aleyhi ve Sellem \"Siz anlaşmazlıklarınızı bana iletiyorsunuz. Belki bazılarınız meramını diğerinizden daha iyi anlatır (da onun lehine hükmederim). Her kimin sözüne güvenerek kardeşine ait bir hakkı alıp ona verirsem ona ateşten bir parça kesip vermiş olurum. Sakın ha! Onu almasın\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2681,
			"arabicnumber": 2681,
			"text": "Ubeydullah b. Abdullah, Abdullah b. Abbas'ın kendisine şöyle haber verdiğini nakletmiştir: Bana Ebu Süfyan, Herakleios'un kendisine \"Sana onun neyi emrettiğini sordum. Sen namaz kılmayı, doğru sözlü olmayı, iffetli olmayı, sözünde durmayı ve emaneti korumayı emreder, dedin. Bu Nebilere ait bir niteliktir\" dediğini haber verdi",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2682,
			"arabicnumber": 2682,
			"text": "Ebu Hureyre r.a.'den rivayet edilmiştir: Allah Resulü Sallallahu Aleyhi ve Sellem \"Münafığın emaresi üçtür: Söylediğinde yalan söyler, kendisine güvenildiğinde güveni boşa çıkarır ve söz verdiğinde sözünü tutmaz\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 2683,
			"arabicnumber": 2683,
			"text": "Cabir b. Abdullah r.a.'dan rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem vefat edince Ebu Bekir r.a.'e Ala b. Hadram! tarafından bir mal geldi. Ebu Bekir, \"Her kimin Hz. Nebi'de bir alacağı var idiyse veya onun tarafından verilmiş bir sözü var idiyse yanımıza gelsin\" dedi. Cabir şöyle devam ediyor: Ben \"Allah Resulü Sallallahu Aleyhi ve Sellem bana -ellerini üç kez açarak- şu kadar, şu kadar ve şu kadar vermeye söz vermişti\" dedim. Bunun üzerine Ebu Bekir benim elime beş yüz, sonra beş yüz, sonra beş yüz saydı",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 2684,
			"arabicnumber": 2684,
			"text": "Said b. Cübeyr r.a.'den rivayet edilmiştir: Hire Yahudilerinden biri bana \"Musa, iki süreden hangisine hükmetmişti?\" diye sormuştu. Ben \"Bilmiyorum. Ama Arab'ın büyük alimine (İbn Abbas'a) gideyim de bir sorayım\" dedim. İbn Abbas'ın yanına varıp sordum. Şu cevabı verdi: \"O, daha uzun ve daha güzel olan süreye hükmetmiştir. Çünkü Allah Resulü Sallallahu Aleyhi ve Sellem bir söz söylediğinde onu mutlaka yapardı",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 2685,
			"arabicnumber": 2685,
			"text": "Abdullah b. Abbas r.a.'ın şöyle dediği rivayet edilmiştir: \"Ey müslümanlar! Allah'ın Nebiine indirdiği Kitab'ı Allah'la ilgili haberlerin en yenisi iken ve Onu katışıksız (saf bir halde) okuyup dururken nasıl ehl-i kitaba soru sorabiliyorsunuz! Allah size ehl-i kitabın, Allah'ın yazdığını değiştirdiklerini ve Kitaplarını elleriyle tahrif ederek, az bir bedelle değiştirmek için \"Bu Allah'ın katındandır\" dediklerini bildirmedi mi? Size gelen ilim, onlara soru sormayı size yasaklamıyor mu? Vallahi! Biz bu güne değin, onlardan tek bir kişinin gelip de size ne indirildi diye sorduğunu görmedik\" Tekrar: 7363, 7522, 7523",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 2686,
			"arabicnumber": 2686,
			"text": "Nu'man b. Beşir r.a.'den rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Allah’ın koyduğu sınırlarını gözetmeyenlerle, sınırlar içinde kalanlar şuna benzerler: Bir topluluk düşünün ki gemiyi aralarında paylaşmışlar. Bir kısmı yukarı katta, bir kısmı aşağı katta oturuyor. Aşağıdakiler yukarıya çıkıp kendileri için su alıyorlar ve yukarıdakiler bundan rahatsız oluyorlar. Bunun üzerine aşağıdakiler ellerine baltayı alıp geminin dibini delmeye kalkışıyor. Yukarıdakiler onların yanına gelerek \"Niye böyle yapıyorsunuz?\" diyorlar. Onlar da \"Siz bizden rahatsız oldunuz, ama bize de su lazım\" diyorlar. Şimdi diğerleri onların elini tutar yaptıklarına engel olurlarsa hem onları, hem de kendilerini kurtarırlar. Onları kendi hallerine bırakırlarsa hem onların, hem de kendilerinin ölümüne sebep olurlar",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 2687,
			"arabicnumber": 2687,
			"text": "Harice b. Zeyd el-Ensari r.a.'den rivayet edilmiştir: Ensar kadınlarından Ummü'l-A'la' adında, Nebi s.a.v.'e biat veren bir kadın ona şunu bildirmişti: Ensar, muhacirleri evlerinde barındırmak için kur'a çektiklerinde Osman b. Maz'un da bizim payımıza çıkmıştı. -Ümmü'l-Ala şöyle devam ediyor-: Osman b. Maz'un bizim evimizde oturdu. Hastalandı ve hastabakıcılığını yaptık. Sonra vefat edip de onu kefenine sardığımız zaman Nebi Sallallahu Aleyhi ve Sellem evimize geldi. Ben: \"Saib'in babası! Allah'ın rahmeti üzerine olsun. Şahitlik ederim ki Allah seni yüceltti\" dedim. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem: \"Kim bilir, belki de onu yüceltmiştir\" buyurdu. \"Anam babam sana feda olsun, elbette bilemem, Ey Allah'ın Resulü!\" dedim. Allah Resulü Sallallahu Aleyhi ve Sellem: ''Vallahi! Bu Osman'a ölüm gelip çattı. Ben onun için iyilik umanm. Vallahi! Ben -ki Allah Resulü'yüm- ona ne yapılacağını bilmiyorum\" buyurdu. -Ümmü'l-Ala diyor ki \"Vallahi! Ben o günden bu yana hiç kimseyi asla tezkiye etmem (temize çıkarmam). Ayrıca bu beni çok üzdü.\"- Ümmü'l-Ala devamla şöyle diyor: Uyudum ve rüyamda Osman'ın akan bir pınarı olduğunu gördüm. Hemen Allah Resulü Sallallahu Aleyhi ve Sellem'e gelerek haber verdim. Nebi Sallallahu Aleyhi ve Sellem: \"O akan pınar Osman'ın dünyada yaptıklarıdır\" buyurdu",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 2688,
			"arabicnumber": 2688,
			"text": "Aişe r.anha'dan rivayet edilmiştir: Allah Resulü Sallallahu Aleyhi ve Sellem yolculuğa çıkacağı zaman hanımları arasında kur'a çekerdi. Kur'a kime çıkarsa onu da beraberinde götürürdü. Hanımları arasında bir gün ve geceyi paylaştırmıştı. Ancak Sevde binti Zem'a Hz. Nebi'i memnun etmek ümidiyle, gecesini ve gündüzünü hanımı Aişe'ye bağışlamıştı",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 2689,
			"arabicnumber": 2689,
			"text": "Ebu Hureyre r.a.'den rivayet edilmiştir: Allah Resulü Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"İnsanlar ezan okumanın ve birinci saf ta namaz kılmanın değerini bilseler ve kur'a çekmekten başka yol bulamasalardı aralarında kur'a çekerlerdi. Namaza erken gitmenin değerini bilselerdi birbirleriyle yarışırlardı. Yatsı ve sabah namazının değerini bilselerdi sürünerek de olsa namaza gelirlerdi",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 50
			}
		}
	]
}