{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"57": "One-fifth of Booty to the Cause of Allah (Khumus)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3091,
			"arabicnumber": 3091,
			"text": "ez-Zuhrî şöyle demiştir: Bana Alî ibnu'l-Hüseyin haber verdi ki, babası Hüseyin ibn Alî aleyhime's-selâm ona şöyle haber vermiştir: Alî (radıyallahü anh) şöyle demiştir: Benim Bedir günündeki ganîmet payımdan yaşlı bir devem vardı. Peygamber(sallallahü aleyhi ve sellem) bana(Bedir'den evvel) beşte birden başka bir yaşlı deve daha vermişti. Rasûlüllah'ın kızı Fâtıma ile evlenmek istediğim zaman Kaynukaa oğullarından kuyumcu bir adamla benimle beraber gelmesi ve beraber ızhır otu getirmemiz hususunda va'dleştim. Bu otu kuyumculara satmak ve parasıyle düğün yemeğim hususunda yardım sağlamak istedim. Ben yaşlı develerim için semerler, çuvallar ve ipler toplarken, iki devem de Ensâr'dan bir adamın hücresi yanında çöktürülmüş hâldeydiler. Topladığım şeyleri toplayıp döndüğüm zaman develerimi gördüm ki hörgüçleri kesilmiş, böğürleri yarılıp ciğerleri alınmış. Develerimin bu manzarasını gördüğüm zaman gözlerime mâlik olamayıp ağladım. Ve: Bu işi kim yaptı? Dedim. bulunanlar: Bu develeri kesme işini Hamza ibn Abdilmuttalib yaptı, kendişi şu evin içinde Ensâr'dan içki içenler topluluğu arasındadır, dediler. Hemen gidip Peygamber'in yanına girdim. Yanında Zeyd ibn Harise vardı. Peygamber yüzümden, karşılaştığım kötü durumu anladı: \"Neyin var?\" diye sordu. Yâ Rasûlallah, ben bugünkü kadar korkunç manzara görmedim: Hamza benim yaşlı iki dişi deveme saldırıp onların hörgüçlerini kesti, böğürlerini yardı, işte o, şu evde içki içenlerin berâberindedir, dedim. ridâsını istedi ve ona büründü. Sonra yürüyerek gitti. Zeyd ibn Harise ile ben kendisini ta'kîb ettik. Nihayet içinde Hamza'nın bulunduğu o eve geldi, içeri girme izni istedi. İçeridekiler gelenlere girme izni verdiler. İçerde içki içmekte olan bir toplulukla karşılaştık. Rasûlüllah, yaptığı iş hakkında Hamza'yı kınamaya başladı. Hamza da sarhoş olmuş, gözleri kıpkırmızı idi. Hamza, Rasûlüllah'a doğru baktı, sonra bakışı yükseltti, akabinde dizlerine baktı. Sonra bakışı yükseltip göbeğine baktı. Sonra bakışı yükseltip yüzüne baktı. Sonra Hamza: Siz, babam Abdulmuttalib'in köleleri değil misiniz? Dedi. amcası Hamza'nın sarhoş olduğunu anladı da (şuursuzca bir fiile kalkışmasından sakınarak) topukları üzerinde arka arkaya çekildi. Biz de O'nunla beraber odadan dışarı çıktık",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3093,
			"arabicnumber": 3093,
			"text": "",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3094,
			"arabicnumber": 3094,
			"text": "",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3095,
			"arabicnumber": 3095,
			"text": "",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3096,
			"arabicnumber": 3096,
			"text": "",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 3097,
			"arabicnumber": 3097,
			"text": "Âişe (r.anha) şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) vefat etti. O hâlde ki, benim evimde ciğer sahibi bir hayvanın (yani insan ve hayvanın) yiyeceği bir şey yoktu; ancak bana âid bir raf (yani dolap veya kiler) içinde yarım vesk ölçeği mikdârı arpa vardı. Ben ondan yedim. Müddet uzadı, onu ölçtüm, sonra tükendi",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3098,
			"arabicnumber": 3098,
			"text": "",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3099,
			"arabicnumber": 3099,
			"text": "",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3100,
			"arabicnumber": 3100,
			"text": "Âişe (r.anha) şöyle dedi: Peygamber (sallallahü aleyhi ve sellem) benim evimde, benim nevbetimde, benim göğsümün üstü ile gerdanımın arasında vefat etti. Bir de Allah (O'nun vefatı sırasında) benim tükrüğüm ile O'nun tükrüğünü birarada birleştirdi. Âişe şöyle dedi: (Kardeşim) Abdurrahmân elinde bir misvakla odaya girdi... Peygamber'in, misvak katı geldiği için kullanmaya gücü yetmedi. Bu sefer misvakı ben aldım ve onu kendi dişlerim üzerine sürerek yumuşattım. Sonra bu yumuşatılmış misvakla O'nun dişlerini misvâkladım",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3101,
			"arabicnumber": 3101,
			"text": "",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3102,
			"arabicnumber": 3102,
			"text": "",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3103,
			"arabicnumber": 3103,
			"text": "İbn Şihâb'dan; o da Alî ibn Hüseyin'den tahdîs etti ki, ona da Peygamber'in zevcesi haber vermiştir: Rasûlüllah (sallallahü aleyhi ve sellem) ramazânın son on günü içinde mescidde i'tikâfta iken Safiyye ziyaretine gitmişti. (Bir müddet konuştuktan) sonra dönmek üzere Safiyye ayağa kalkmış, Rasûlüllah da onu geçirmek üzere onunla beraber ayağa kalkmış. Peygamber'in bir diğer zevcesi olan Ümmü Seleme'nin kapısı yanındaki mescid kapısına geldiğinde, Ensâr'dan iki kişi onların yakınından geçmişler ve Rasûlüllah'a selâm verip acele yürüyerek geçmişler. Rasûlüllah onlara: \"Acele etmeyiniz, durunuz! (Yanımdaki kadın Safiyye bintu Huyey'dir)\" buyurdu. iki zât: Yâ Rasûlallah, biz Allah'ı tenzih ederiz, dediler. Peygamber'in Safiyye'nin hüviyyetini ta'yîne mecburiyet hissetmesi bunlara ağır geldi. Bunun üzerine Peygamber: \"Şeytân insanda(yani insân bedeninde dolaşan) kan mesâbesindedir. Ben sizin gönüllerinize şeytânın kötü bir şübhe atmasından endîşe ettim\" buyurdu. ibn Omer (radıyallahü anh): Ben bir gün Hafsa'nın evinin damı üstüne çıktım ve Peygamber(sallallahü aleyhi ve sellem)'i arkasını kıbleye döndürerek Şâm tarafına yönelerek ihtiyâcını yerine getirir hâlde gözümle gördüm, demiştir. anha), Rasûlüllah (sallallahü aleyhi ve sellem) ikindi namazını güneş henüz Âişe'nin odasından çıkmadan kılar idi, demiştir. ibn Omer (radıyallahü anh) şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem) bir gün hatîb olarak ayağa kalktı ve hutbe esnasında eliyle Âişe'nin meskeni tarafını işaret ederek üç defa:\"İşte fitne bu taraftadır, şeytânın boynuzunun doğacağı yerdedir\" buyurdu. zevcesi Âişe (r. anha), Abdurrahmân kızı Amre'ye şöyle haber vermiştir: Rasûlüllah(sallallahü aleyhi ve sellem), Âişe'nin yanında idi. Bu sırada Âişe bir insan sesi işitti ki, o insan Hafsa'nın evine girmek için izin istiyordu. (Âişe dedi ki:) Ben: Yâ Rasûlallah, şu adam evinize girmek için izin istiyor, dedim. üzerine Rasûlüllah: \"Sanıyorum ki o, Hafsa'nın süt amcası fulan kimsedir!\" buyurdu. dedi ki: Süt amcam fulân hayâtta olsaydı benim yanıma girebilecek miydi? diye sordum.)Rasûlüllah: \"(Evet girebilirdi, çünkü) süt, velâdet ve nesebin haram kıldığı her şeyi haram kılar\" buyurdu",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3104,
			"arabicnumber": 3104,
			"text": "",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3105,
			"arabicnumber": 3105,
			"text": "",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3106,
			"arabicnumber": 3106,
			"text": "Basra Kaadısı Sumâme ibn Abdillah ibn Enes'ten; o da dedesi Enes'ten tahdîs etti ki, Ebû Bekr halîfe yapılınca, Enes'i Bahreyn'e gönderdi ve kendisi için şu meşhur mektubu (yânı sadaka farizası kitabını) yazdı ve Ebû Bekr bu mektubu mühürledi. Bu mührün nakşı (yânı üzerindeki yazı) üç satır idi: bir satır ve Rasûlu bir satır veAllâhi bir satırdı",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3107,
			"arabicnumber": 3107,
			"text": "İsâ ibnu Tahmân tahdîs edip şöyle demiştir: Enes ibn Mâlik -Peygamber'in vefatından sonra- tüyleri dökülmüş meşinden, tasmalı bir çift ayakkabı çıkardı. İbn Tahmân dedi ki: Bana Sabit el-Bunânî, Enes'ten şöyle tahdîs etti: Enes bize iki ayakkabı çıkardıktan sonra: Bunlar Peygamber(sallallahü aleyhi ve sellem)'in ayakkabılarıdır, diye haber verdi",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 3108,
			"arabicnumber": 3108,
			"text": "Ebû Burde şöyle demiştir: Âişe -Peygamber'in ölümünden sonra- bize yünden keçelenmiş bir kaftan çıkardı ve: Peygamber'in rûhu bu kaftanın içinde kabz olundu, yani koparılıp çekildi, dedi. ibnu'l-Mugîre, Humeyd'den rivayetinde şunu ziyâde etti: Ebû Burde şöyle dedi: Âişe bize Yemen'de dokunan tok kumaştan yapılmış bir izâr ile yine bu kumaştan yapılıp \"el-Mulebbede= الْمُلَبَّدَةَ‏.‏ \" dedikleri bir kisve çıkardı",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 3109,
			"arabicnumber": 3109,
			"text": "Enes ibn Mâlik (radıyallahü anh)'ten: Peygamber(sallallahü aleyhi ve sellem)'in su bardağı kırıldı, akabinde kırık yerine gümüşten bir bardak edindi dediğini tahdîs etti. Râvî Âsim el-Ahvel: Ben bu kadehi gördüm ve (teberrüken içine su koyup) ondan su içtim, demiştir",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 3110,
			"arabicnumber": 3110,
			"text": "İbn Şihâb, Muhammed ibn Amr ibn Halhale ed-Duelî'ye şöyle tahdîs etmiştir: Ona da Hz. Hüseyin'in oğlu Alî tahdîs etti ki, onlar, kendileri Alî'nin oğlu Hüseyin'in öldürüldüğü zaman -Allah'ın rahmeti onun üzerine olsun- Muâviye'nin oğlu Yezîd'in yanından Medîne'ye geldikleri sırada kendilerini Mısver ibn Mahrame (radıyallahü anh) karşılamış ve: Bana herhangi bir ihtiyâcın var mı? Varsa onu bana emredebilirsin, demiştir. oğlu Alî dedi ki: Ben de Mısver'e: Hayır, bir ihtiyâcım yoktur, dedim. Mısver, Hüseyin'in oğlu Alî'ye: Sen Rasûlüllah'ın kılıcını bana verir misin? Çünkü ben bu kavmin onu almakta sana galebe etmesinden endîşe ediyorum. Allah'a yemîn ederim ki, eğer sen onu bana verirsen, benim nefsime ulaşılmadıkça, yani ruhum kabz olunmadıkça bu kılıç ebediyyen onlara ulaştırılmaz. Şu da muhakkak ki Ebû Tâlib'in oğlu Alî, Fâtıma'nın üstüne -aleyhi's-selâm- Ebû Cehl'in kızını istemişti, işte bu sıradaRasûlüllah'tan işittim. O, şu minberin üzerine çıkmıştı da bu hususta hutbe îrâd ediyordu. Ben de o günlerde ihtilâm olmuş hâlde idim. Rasûlüllah(sallallahü aleyhi ve sellem) orada: \"Muhakkak Fâtıma bendendir. Ben onun -beşer tabîatinden neş'et eden kıskançlık sebebiyle- dîni hususunda fitneye ma'rûz kalmasından endîşe ediyorum\" buyurdu. Mahrame dedi ki: Sonra Rasûlüllah, Abdu'ş-Şems oğullarından olan bir damadını (yani kızı Zeyneb'in kocası bulunan Ebû'l- Âs ibn Rabî'ı) zikretti de onu kendisine hısımlığı hususunda övdü ve güzel hâllerini şöyle dile getirdi; \"O bana söz söylemiş, sözünde gerçek çıkmıştır. O bana va'd etmiş, va'dini yerine getirmiştir. Kat'î söylüyorum ki, ben hiçbir halâlı haram kılıyor değilim, hiçbir haramı da halâl kılmıyorum. Lâkin Allah'a yemîn ediyorum ki, Allah Rasûlü'nün kızı ile Allah düşmanının kızı ebeden (bir adamın nikâhında) birleşmez",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 3111,
			"arabicnumber": 3111,
			"text": "Muhammed ibnu'l-Hanefiyye şöyle demiştir: Eğer Bâbam Alî(radıyallahü anh) Usmân ibn Affân'ı kötülükle zikredici olaydı, birtakım insanlar ona gelip de Usmân'ın zekât me'mûrlarından şikâyet ettikleri gün zikrederdi. O gün babam Alî, bana: Usmân'a git de ona(gönderdiğim) sahîfenin Rasûlüllah'ın sadakası(yani sarf yerlerinin yazıldığı sahîfe) olduğunu haber ver de: Zekât me'mûrlarına emret ki, bunun içindeki hükümlerle amel etsinler, dedi. ibnu'l-Hanefiyye dedi ki: Bunun üzerine ben bu sahîfeyi Usmân'a götürdüm. Usmân: O sahîfeyi bizden geri çevir, dedi. Akabinde ben o sahîfeyi tekrar Alî'ye getirdim ve olanı kendisine haber verdim. Babam: O sahîfeyi aldığın yere koy, dedi",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 3112,
			"arabicnumber": 3112,
			"text": "Buhârî'nin şeyhi el-Humeydî şöyle dedi: Bize Sufyân ibn Uyeyne tahdîs edip şöyle dedi: Bize Muhammed ibn Sûka tahdîs edip şöyle dedi: Ben Munzir es-Sevrî'den işittim ki, Muhammed ibnu’l-Hanefiyye şöyle demiştir: Beni Bâbam Alî haberci gönderdi de: Şu kitabı, yani yazıyı al ve onu Usmân'a götür. Çünkü bunun içindePeygamber (sallallahü aleyhi ve sellem)'in sadaka hususundaki emri vardır, dedi",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 3113,
			"arabicnumber": 3113,
			"text": "Bize Alî şöyle tahdîs etti: Fâtıma aleyhi's-selâmın el değirmeniyle hububat öğütmekten dolayı eline hastalık gelmişti. O sırada Rasûlüllah'a birtakım harb esirleri getirildiği Fâtıma'ya ulaştı. Fâtıma da o esirlerden bir hizmetçi istemek üzere babasına gitti, fakat babasını evde bulamadı. Derdini Âişe'ye zikretti. Akabinde Peygamber geldiğinde Âişe, Fâtima'nın geldiğini ve dileğini kendisine söyledi.(Alî dedi ki:) Müteakiben biz yataklarımıza girmiş hâlde iken Peygamber bize geldi. Biz hemen yatağımızdan kalkmağa davrandık. aleyhi ve sellem): \"Yerinizde durunuz!\" buyurdu ve (ikimizin arasına oturdu) hattâ ben göğsümün üzerine dokunan iki ayağının serinliğini hissettim. Peygamber: dinleyin! Ben size, sizin benden istediğiniz esîr hizmetçiden daha hayırlı bir şeye delâlet ediyorum: Siz(gece) yataklarınıza girdiğinizde otuzdört defa Allâhu Ekber, otuzüç kerre Elhamdulillâhi ve otuzüç kerre de Subhânallahi deyiniz. Bunları söylemeniz sizler için benden istediğiniz hizmetçiden daha hayırlıdır\" buyurdu",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 3114,
			"arabicnumber": 3114,
			"text": "Bize Şu'be, Süleyman ibn Mihrân'dan, Mansûr'dan ve Katâde'den tahdîs etti. Bu üçü de Salim ibn Ebi'l-Ca'd'dan işitmişlerdir. Câbir ibn Abdillah(radıyallahü anh): Bizim Ensâr'dan bir adamın bir oğlu doğdu. O kimse Oğluna Muhammed adını vermek istedi, demiştir. Şu'be: Mansûr hadîsinde şöyle dedi: O Ensârî: Ben oğlumu boynum üzerinde taşıyıp onu Peygamber'e getirdim, dedi. Yine Şu'be: Süleyman el-A'meş hadîsinde şöyle dedi: O Ensârî'nin (yani Enes ibn Fudâle'nin) bir oğlu oldu. Onu Muhammed diye isimlemek istedi. Peygamber(sallallahü aleyhi ve sellem):\"Benim ismimle isimleyiniz, fakat künyem ile künyelenmeyiniz. Çünkü ancak ben Kaasım, yani taksim edici kılındım, (mîrâs ve ganimet mallarını) aranızda ancak ben taksim ederim\" buyurdu. ibn Abdirrahmân es-Sulemî, Rasûlüllah’ın \"Ben bir taksim edici olarak gönderildim, aranızda ben taksim ederim\" buyurduğunu söyledi. şeyhi Amr ibn Merzûk şöyle dedi: Bize Şu'be haber verdi: Katâde şöyle demiştir: Ben Sâlim'den işittim; o da Câbir'den: el-Ensârî, oğluna el-Kaasım ismini vermek istedi. Peygamber: ismimle isimleyin, fakat künyem ile künyelenmeyin\" buyurdu",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 3115,
			"arabicnumber": 3115,
			"text": "Câbir ibn Abdillah (radıyallahü anh) şöyle demiştir: Bizim Ensâr taifesinden bir adamın bir oğlu doğdu. Kendisi çocuğa el-Kaasım adını verdi. Ensâr ona: Biz seni Ebû'l-Kaasım künyesiyle anmayız ve sana bu doğum sebebiyle \"gözaydın\" diye ikram da etmeyiz, dediler. üzerine o Ensârî zât Peygamber'e geldi ve: Yâ Rasûlallah, bir oğlum doğdu, ona el-Kaasım adını verdim. Ensâr bana: Biz seni Ebû'l-Kaasım künyesiyle lâkablamayız ve sana \"gözaydın\" tebrikinde de bulunmayız, dediler(ne buyurursunuz diye sordu)? aleyhi ve sellem): \"el-Ensâr güzel söylemiştir. Benim ismimle ad verebilirsiniz, fakat benim künyem ile künyelenmeyin. Çünkü Kaasım, yalnız benimdir\" buyurdu",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 3116,
			"arabicnumber": 3116,
			"text": "Humeyd ibn Abdirrahmân, Muâviye ibn Ebî Sufyân'ın şöyle dediğini işitmiştir: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: \"Allah her kimin hayrını murâd ederse ona dîn hususunda (büyük bir) anlayış verir. Verici ancak Allah'tır. Ben (verici değil) yalnız taksim ediciyim. Bir de bu ümmet Allah'ın emri gelinceye (kıyâmet gününe) kadar kendilerine muhalefet edenler üzerine gâlib olmakta devam edecekler, onlar gâlib hâlde bulunacaklar",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 3117,
			"arabicnumber": 3117,
			"text": "Bize Hilâl, Abdurrahmân ibn Ebî Amre'den; o da Ebû Hureyre(radıyallahü anh)'den tahdîs etti ki, Rasûlüllah (sallallahü aleyhi ve sellem): \"Ben size ne bir şey verebilirim, ne de (verilene) mâni' olabilirim. Ben taksim ediciyim, emrolunduğum yere koyarım\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 3118,
			"arabicnumber": 3118,
			"text": "Havle el-Ensâriyye (radıyallahü anh) şöyle demiştir: Ben Peygamber(sallallahü aleyhi ve sellem)'den işittim, şöyle buyuruyordu: \"Birtakım adamlar Allah'ın (müslümânların iyiliğine tahsîs buyurduğu) malında haksız olarak tasarruf ederler, işte onlar için kıyâmet gününde o ateş muhakkaktır",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 3119,
			"arabicnumber": 3119,
			"text": "Bize Husayn ibn Abdirrahmân es-Sulemî, Âmir eş- Şa'bî'den; o da Urve el-Bârıkî'den tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem):\" (Gazâya giden) atın alnına dökülen saçlarında kıyâmet gününe kadar hayır düğümlüdür. Hayır kıyâmet gününe kadar ecir (yani sevâb) ve ganimettir\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 3120,
			"arabicnumber": 3120,
			"text": "Bize Ebu'z-Zinâd, el-A'rac'dan; o da Ebû Hureyre (radıyallahü anh)'den haber verdi ki, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: \"Kisrâ helak olduğu zaman ondan sonra kisrâ yoktur. (Bizans hükümdarı olan) Kayser helak olduğu zaman ondan sonra kayser yoktur (yani kayser hâkimiyeti olmayacaktır). Nefsim yed’inde olan Allah 'a yeminle söylüyorum ki, Kisrâ ile Kayser'in hazîneleri muhakkak Allah yolunda harcanacaktır",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 3121,
			"arabicnumber": 3121,
			"text": "Câbir ibn Semure (radıyallahü anh) şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem) şöyle buyurdu: \"Kisrâ helak olduğu zaman ondan sonra kisrâ yoktur. Kayser helak olduğu zaman ondan sonra da kayser yoktur. Nefsim yed’inde olan Allah'a yeminle söylüyorum ki, Kisrâ ile Kayser'in hazîneleri muhakkak Allah yolunda harcanacaktır",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 3122,
			"arabicnumber": 3122,
			"text": "Bize Câbir ibn Abdillah (radıyallahü anh) tahdîs edip şöyle dedi: Rasûlüllah(sallallahü aleyhi ve sellem):\"Ganimetler bana halâl kılındı (Halbuki benden evvel kimseye helâl edilmemiştir)\" buyurdu",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 3123,
			"arabicnumber": 3123,
			"text": "Bana Mâlik, Ebu'z-Zinâd'dan; o da el-A'rac'dan; o'da Ebû Hureyre(radıyallahü anh)'den haber verdi ki, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: \"Kendisini (evinden sırf) Allah yolunda cihâd etmek ve kelimetu'llah'ı tasdik etmek niyeti çıkararak Allah yolunda cihâd eden kimseye Allah onu, şehîd olmak suretiyle cennete girdirmeyi yahut içinden çıkmış olduğu meskenine sevâbla yahut ganimetle salimen döndürmeyi tekeffül etmiştir",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 3124,
			"arabicnumber": 3124,
			"text": "Ebû Hureyre (radıyallahü anh) şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: \"Peygamberlerden bir peygamber gazaya gitti ve kavmine şöyle dedi: Bir kadın fercine nikâhla mâlik olup da onunla evlenmek istediği hâlde henüz evlenmemiş olan bir erkek bana tâbi' olmasın (yânı benimle beraber cihâda yürümesin). Birçok evler kurmuş, fakat henüz tavanlarını yükseltmemiş olan kimse de benimle yürümesin. Koyun yahut gebe develer satın almış da bunların yavrularını doğurmalarını beklemekte olan kimse de benimle beraber yürümesin. bu ta'lîmâtı verdikten sonra gazaya gitti ve nihayet ikindi namazı vaktinde yahut buna yakın bir zamanda fethedeceği beldeye yaklaşınca güneşe hitaben: Sen bir me'mûresin, ben de bir me'mûrum dedi ve: Allahım! Bu güneşi bizim üzerimizde biraz durdur! diye dua etti. Müteakiben Allah bu peygambere fetih verinceye kadar güneş onun üzerinde durduruldu. Neticede o peygamber ganimetleri topladı. Derken onları yemesi için (gökten bir) ateş geldi. Fakat ateş o ganimetleri yemedi. Bunun üzerine peygamber, ordusuna: Sizin içinizde ganimet malına bir hıyanet vardır, binâenaleyh her bir kabileden bir kimse bana bey'at etsin, dedi. (Bey'at ettiler.) Bu bey'at sırasında birisinin eti peygamberin eline yapıştı. Peygamber, derhâl: Hıyanet muhakkak sizin içinizdedir. Binâenaleyh senin kabilen benimle bey'at yapsın, dedi. (Kabile bey'at yaptı.) Bu sırada iki yahut üç kimsenin elleripeygamberin eline yapıştı. Peygamber: Hıyanet fiili sizdedir, sizler hıyanet ettiniz, dedi. Akabinde onlar sığır başı gibi altından bir baş getirdiler ve bunu yere koydular. Akabinde ateş geldi ve o ganimet malını yedi. Sonra Allah bizler için ganimeti halâl kıldı. Allah bizim zayıflığımızı ve aczimizi gördü de ganimetleri bize halâl kıldı",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 3125,
			"arabicnumber": 3125,
			"text": "Eslem şöyle demiştir: Omer ibnu'l-Hattâb (radıyallahü anh): Eğer mülümanların sonu (yani müstakbel nesillerin hayâtı endîşesi) olmasaydı, Peygamber'in Hayber arazîsini taksîm ettiği gibi, ben de fethettiğim her karyeyi (her memleketin arazîsini) muhakkak ganîmet sâhibleri (yani fâtihleri) arasında taksîm ederdim; dedi",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 3126,
			"arabicnumber": 3126,
			"text": "Bize Ebû Mûsâ el-Eş'arî(radıyallahü anh) tahdîs edip şöyle dedi: Bir çöl Arabı Peygamber'e: Bâzı kimseler ganimet almak için harbeder, bâzı kimseler insanlar yanında yiğitliği zikrolunsun diye harbeder, bâzıları da(yiğitlik) derecesi görülsün diye harbeder. Şu hâlde Allah' yolunda olan kimdir? dedi. aleyhi ve sellem): \"Kim Allah kelimesi (Allah'ın tevhidi kelimesi) en yüksek olsun diye muharebe ederse, işte o mücâhid Allah yolundadır\" buyurdu",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 3127,
			"arabicnumber": 3127,
			"text": "Bize Hammâd ibn Zeyd, Eyyûb es-Sahtıyânî'den; o da Abdullah ibn Ebî Muleyke'den tahdîs etti: Peygamber (sallallahü aleyhi ve sellem)'e has ipekten altın düğmeli (yahut altın halkalarla örülü) birçok kaftanlar hediye edildi. Peygamber bu kaftanları sahâbîlerinden birtakım insanlar arasında taksim etti. Bu kaftanlardan bir tanesini de Mahrame ibn Nevfel için ayırdı. Müteakiben Mahrame, beraberinde oğlu Mısver ibn Mahrame olduğu hâlde geldi de,Peygamber'in kapısı Önünde dikidi. Ve oğluna: Peygamber'i bana çağır! dedi. babamın sesini işitti de, yanıma bir kaftan alıp düğmelerini öne doğru tutarak babam Mahrame'yi bununla karşıladı ve: \"Yâ Eba'l-Mısver, bunu senin için sakladım! Yâ Eba'l-Mısver, bunu senin için sakladım!\" buyurdu. huyunda bir şiddet ve sertlik vardı. hadîsi İsmail ibn Uleyye, Eyyûb es-Sahtıyânî'den rivayet etmiştir. Hâtem ibnu Verdân şöyle dedi: Bize Eyyûb es-Sahtıyânî, İbnu Ebî Muleyke'den tahdîs etti ki el-Mısver: Peygamber'e bir çok kaftanlar geldi... demiştir. Bu hadîsi İbnu Ebî Muleyke'den rivayet etmekte el-Leys ibn Sa'd, Eyyûb es-Sahtıyânî'ye mutâbaat etti",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 3128,
			"arabicnumber": 3128,
			"text": "Ben Enes ibn Mâlik (radıyallahü anh)'ten işittim, şöyle diyordu: Ensâr'dan olan insanlar gelir getiren hurmalıklarını Peygamber (sallallahü aleyhi ve sellem)'e kendi masraflarını karşılaması için hediye ediyorlardı. Nihayet Peygamber Kurayza ve Benu'n-Nadîr kabilelerini fethetti. Bunun ardından Medîneli Ensâr'a daha evvel Muhâcirler'e teslîm ettikleri hurmalıkları kendilerine geri verilir oldu",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 3129,
			"arabicnumber": 3129,
			"text": "Ben Ebû Usâme Hammâd ibn Seleme'ye: Hişâm ibn Urve size tahdîs etti mi? diye sordum. (Burada suâlin cevâbı zikredilmedi. Fakat İshâk ibn Râhûye'nin Müsned'inde bu isnâd ile \"evet\" deyip şunu sevk etmiştir) Bana Hişâm ibn Urve, Bâbası Urve ibnu'z-Zubeyr'den; o da kardeşi Abdullah ibnu'z-Zubeyr'den tahdîs etti. O şöyle demiştir: ez-Zubeyr ibnu'l-Avvâm Cemel Vak'ası gününde durduğu zaman beni çağırdı. Ben yanında dikeldim. Bana şunları söyledi: Ey oğulcuğum! Şu muhakkak ki, bu gün ancak zâlim olan yahut mazlum olan öldürülür. Ve ben bu gün kendimi başka türlü değil, ancak mazlum olarak öldürüleceğimi zannediyorum. Ve benim en büyük hüznüm ve endîşem elbette borcumdur. Son borcumuzun, malımızdan herhangi bir şey bırakacağını zannediyor musun? dedi ve: Ey oğulcuğum malımızı sat ve borcumu öde, sözünü söyledi. malının üçte birini vasiyet etti; bu üçte birin üçte birini husûsî olarak Abdullah ibn Zubeyr'in oğullarına vasiyet etti. Zubeyr, oğlu Abdullah ibn Zubeyr'i kasdederek onun oğulları için üçte birin üçte biri diyor: Eğer borcun ödenmesinden sonra bir şey artmış olursa, o fazlanın üçte biri senin oğullarına âiddir. ibn Urve (geçen senedle) şöyle dedi: Abdullah ibnu'z-Zubeyr'in çocuklarının bâzısı yaşça (yahut vasiyetteki payca) Zubeyr'in oğullarının bâzısına müsavi olmuştur: Bunlar Hubeyb ve Abbâd'dır. Zubeyr'in bu vasiyeti yaptığı gün dokuz oğlu ve dokuz kızı vardı, dedi ki: Bâbam Zubeyr, borcunun ödenmesini bana vasiyet etmeye başladı ve şöyle diyordu: Ey oğulcuğum! Eğer borç ödemekten herhangi bir şey hususunda âciz olursan, o zorluğa karşı Mevlâmdan yardım iste! dedi. şöyle dedi: Vallahi ben babamın bu \"Mevlâm\" sözüyle ne kasdettiğini bilemedim. Sonunda: Bâbacığım, senin Mevlân kimdir? diye sordum. (Benim Mevlâm) Allah'tır, dedi. şöyle devam etti: Vallahi ben onun borcunu ödemekten dolayı herhangi bir sıkıntıya düştükçe muhakkak: Yâ Mevlâ'z-Zubeyr( = Ey Zubeyr'in Mevlâsı)! Zubeyr'in borcunu kaza et! diye duâ ettim; akabinde Yüce Allah onun borcunu ödedi. Sonunda Zubeyr(radıyallahü anh) Öldürüldü. Zubeyr arkasında altın para ve gümüş para bırakmadı; o yalnız bâzı arazîler bıraktı. Gâbe mevkiindeki büyük arazî, Medine'de on bir ev, Basra'da iki ev, Kûfe'de bir ev, Mısır'da bir ev bunlardandır. dedi kî: Zubeyr'in üzerindeki borç ancak şöyle oluşmuştur: Birtakım kimseler ona mal getirir ve malı Zubeyr'in yanında emânet bırakmak ister idi. Zubeyr ise ona: Hayır, ben bu malı emânet olarak teslim almam; lâkin o mal benim zimmetimde bir ödünçtür. Çünkü ben emânetin zayi' olmasından (ve bunun da benim malı iyi korumadığımdan meydana geldiğinin zannolunmasından) korkarım, der idi. asla bir kumandanlık, harâc toplayıcılığı ve (mal toplamaya sebeb olacak cinsten) herhangi bir vazifeyi üzerine almamıştır O sâdece Peygamber (sallallahü aleyhi ve sellem)'in yahut Ebû Bekr'in yahut Omer'in yâhûd Usmân'ın -Allah onlardan razı olsun- maiyyetlerinde yapılan gazvelerde mevcûd olmuştur. ibnu'z-Zubeyr şöyle dedi: Ben babam Zubeyr'in üzerindeki borcu hesâb ettim de, onu iki milyon ikiyüz bin olarak buldum. Râvî dedi ki: Hakîm ibn Hizam, Abdullah ibnu'z-Zubeyr'e kavuştu da: Ey kardeşimin oğlu! Kardeşim Zubeyr'in üzerinde ne kadar borç vardır? diye sordu. Abdullah, borcun bir kısmını gizledi de: Yüz bin, dedi. üzerine Hakîm: Vallahi ben sizin mallarınızın bu kadar borcu ödemeye yeteceğini zannetmiyorum, dedi. Bu sefer Abdullah: Eğer borçlar ikimilyon ikiyüzbin olmuş ise, senin re'yin nedir bana haber ver? dedi. Hakîm: Bu kadar borcu ödemeye takat yetireceğinizi sanmıyorum. Eğer bu borçtan herhangi bir şeyi ödemekten âciz olursanız benden yardım isteyin, dedi. dedi ki: Zubeyr, Gâbe'deki arazîyi yüz yetmiş bine satın almış idi. Oğlu Abdullah ise bu arazîyi satmak için bir milyon altıyüz bin kıymet ta'yîn etti. Sonra ayağa kalktı ve: Her kimin Zubeyr'in üzerinde alacağı bir hakk varsa, Gâbe'ye bizim yanımıza gelsin, dedi. Abdullah ibn Ca'fer ibn Ebî Tâlib oraya geldi. Bu Abdullah'ın, Zubeyr'in üzerinde dörtyüz bin alacağı vardı. Bu Abdullah, Abdullah ibnu'z-Zubeyr'e hitaben: Eğer isterseniz bu dörtyüz binlik alacağımı size bırakayım, dedi. Abdullah ibnu'z-Zubeyr: Hayır (alacağını bırakma; bunu istemeyiz), dedi. ibn Ca'fer: Eğer isterseniz, benim alacağımı geri bırakmak istediğiniz alacakların içine koyup geriye bırakırsınız, dedi. ibnu'z-Zubeyr: Hayır, alacağını geri bırakma, dedi. Râvî dedi ki: Abdullah ibn Ca'fer: Öyleyse bu arazîden benim için bir parça kesin, dedi. Abdullah ibnu'z-Zubeyr de ona hitaben: Şuradan şuraya kadar olan parça senindir, dedi. dedi ki: Abdullah ibnu'z-Zubeyr, Gâbe arazîsinden (ve evlerden) bâzısını sattı da babası Zubeyr'in borcunu ödedi. Borcun hepsini tamamen ödedikten sonra Gâbe arazîsinden dörtbuçuk pay bakî kaldı. Abdullah ibnu'z-Zubeyr akabinde Şam'a Muâviye ibn Ebî Sufyân'ın yanına geldi. Muâviye'nin yanında Amr ibnu Usmân ibn Affân, Abdullah ibnu'z-Zubeyr'in kardeşi el-Munzir ibnu'z-Zubeyr,(Mü'minlerin anası Sevde'nin kardeşi) Abdullah ibnu Zem'a bulunuyorlardı. Muâviye, Abdullah ibnu'z-Zubeyr'e hitaben: Gâbe arazîsine ne kadar kıymet ta'yîn edildi? dedi. Abdullah: (Onaltı pay aslından) her bir pay yüz bine geldi, dedi. Geriye kaç pay kaldı? dedi. Abdullah: Dört bütün pay ile bir yarım pay kaldı, dedi, ibnu'z-Zubeyr: Ben yüzbin mukaabilinde bir pay satın aldım, dedi. ibnu Usmân: Ben de yüz bine mukaabil bir pay satın aldım, dedi. ibnu Zem'a: Ben de yüz bîn karşılığında bir pay satın aldım, dedi. sefer Muâviye: Geriye ne kadar pay kaldı? diye sordu. Bir pay ile yarım pay kaldı, dedi, Ben de onu yüz elli bin karşılığında satın aldım, dedi. Râvî dedi ki: Abdullah ibn Ca'fer (ibn Ebî Tâlib), Muâviye'den onun payını altıyüz bin mukaabilinde satın aldı (da böylece ikiyüz bin kazandı). Abdullah ibnu'z-Zubeyr Bâbasının borçlarını ödeyip bu borç işini bitirdiği zaman Zubeyr'in diğer oğulları kendisine: Artık mirasımızı aramızda taksîm et, dediler. Abdullah: Hayır, Allah'a yemîn ederim ki, dört sene hacc mevsiminde \"Haberiniz olsun! Her kimin Zubeyr üzerinde alacağı bir hakk varsa bize gelsin de o borcu ödeyelim!\" diye nida ve i'lân etmedikçe, mîrâsı aranızda taksîm etmem, dedi. dedi ki: Artık Abdullah ibnu'z-Zubeyr her sene hacc mevsiminde böyle nida ve i'lân etmeye başladı. Nihayet dört yıl geçince (ve kendisine hakk isteyici kimse gelmeyince) mîrâsı Zubeyr'in oğulları arasında taksîm etti. dedi ki: Zubeyr öldüğü zaman arkasında dört karısı vardı. Abdullah'a vasiyet edilen üçte biri kaldı da her bir kadına (sekizde bir hisse olarak) bir milyon ikiyüz bin isabet etti. Buna göre Zubeyr' in (vasiyet, mîrâs ve borçlarını içine alan) malı elli milyon ikiyüz bindir",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 3130,
			"arabicnumber": 3130,
			"text": "Bize Mûsâ ibn İsmail tahdîs edip şöyle dedi: Bize Ebû Avâne tahdîs edip şöyle dedi: Bize Usmân ibn Vehb tahdîs etti ki, İbn Omer (radıyallahü anh) şöyle demiştir: Usmân Bedir vak'asından ancak şu sebebden dolayı kaybolmuştur: Çünkü hakikat şudur ki,Rasûlüllah'ın kızı(Rukayye) Usmân'ın nikâhı altında idi ve(Bedir seferi sırasında) ağır hasta bulunuyordu.Peygamber(sallallahü aleyhi ve sellem) Usmân'a hitaben: \"Senin için Bedir'de hazır bulunan bir gâzî sevabı ve onun ganimet payı vardır\" buyurdu (ve ona hisse verdi)",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 3132,
			"arabicnumber": 3132,
			"text": "",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 3133,
			"arabicnumber": 3133,
			"text": "",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 3134,
			"arabicnumber": 3134,
			"text": "Bize (İmâm) Mâlik, Nâfi'den; o da İbn Omer(radıyallahü anh) 'den haber verdi ki, Rasûlüllah (sallallahü aleyhi ve sellem) Necd tarafına bir fırka asker gönderdi. Abdullah ibn Omer de bu askerî birlik içinde bulundu. Bu askerler birçok deve ganimet aldılar. Her bir askerin hissesine on iki yahut on bir deve düştü. Bu hisselerine ilâve olarak kendilerine birer deve de (Rasûlüllah'a âid beşte bir hisseden) ihsan buyrulmuştu",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 3135,
			"arabicnumber": 3135,
			"text": "Bize el-Leys, Ukayl'den; o da İbnu Şihâb'dan; o da Sâlim'den; o da Bâbası İbn Omer (radıyallahü anh) 'den şöyle tahdîs etti:Rasûlüllah (sallallahü aleyhi ve sellem) göndermekte olduğu seriyyelerden bâzı kimselere, o askerî birliğin umûmuna isabet edecek hisse taksiminden başka hassaten bizzat kendilerine âid olmak üzere fazladan ganîmet verir idi",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 3136,
			"arabicnumber": 3136,
			"text": "Ebû Mûsâ el-Eş'arî (radıyallahü anh) şöyle demiştir: Biz Eş'arîler Yemen'de iken Peygamber(sallallahü aleyhi ve sellem)'in çıkışı ve Medine'ye hicret edişi haberi bize erişti. Biz de ben ve iki kardeşim ki, biri Ebû Burde, diğeri de Ebû Ruhm'dür; ben kardeşlerimin en küçüğü idim- kavmimiz Eş'arîler'den (Râvî: Ya elli bu kadar dedi veya şöyle söyledi:) elli üç yahut elli iki kişi içinde Peygamber'in tarafına muhacirler olarak Yemen’den çıktık. Biz bir gemiye bindik. Fakat (havanın muhalefetiyle) gemimiz bizleri Habeş hükümdarı Necâşî'nin memleketi sahiline bıraktı. Orada Ca'fer ibn Ebî Tâlib ile yanındaki arkadaşlarıyla karşılaştık. Ca'fer: Rasûlüllah bizleri buraya gönderdi ve bizim burada ikaamet etmemizi emretti. Sizler de bizim beraberimizde ikaamet ediniz, dedi. üzerine biz de Ca'fer'in beraberinde Habeşistan'da ikaamet ettik. Nihayet hepimiz beraberce Medine'ye geldik. Ve Peygamber'e Hayber'i fethettiği sırada kavuştuk. Rasûlüllah bizlere pay ayırdı (yahut râvî: Rasûlüllah o ganimetten bizlere de verdi, demiştir). Halbuki Rasûlüllah Hayber fethinden gâib olan hiçbir kimseye Hayber ganimetinden bir şey ayırmadı, ganimeti ancak beraberinde hazır bulunanlara ayırdı. Bu esâstan Cafer’in maiyyetinde olarak bizim gemimizle gelenleri ve Ca'fer'in arkadaşlarını müstesna tuttu da Hayber'de hazır bulunanlarla beraber onlara da pay ayırdı",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 3137,
			"arabicnumber": 3137,
			"text": "Câbir (radıyallahü anh) şöyle demiştir. Rasûlüllah (sallallahü aleyhi ve sellem): \"Bahreyn malının gelmesi gerçekleşirse, muhakkak sana şöyle şöyle şöyle veririm'' buyurdu. Peygamber'in ruhu alınıncaya kadar Bahreyn malı gelmedi. Bahreyn malı geldiği zaman Ebû Bekr bir münâdîye emretti, o da: Her kimin Rasûlüllah'ın yanında bir alacağı veya yapılmış bir va'di varsa bize gelsin! diye ilân etti. Bunun üzerine ben Ebû Bekr'e gittim ve: Rasûlüllah bana \"Şöyle şöyle... Veririm\" buyurdu, dedim. Bekr benim için üç avuç avuçladı. Bunu anlatırken râvî Sufyân ibn Uyeyne iki avucunu bir yere getirerek avuçlamaya başladı da, sonra bize hitaben: İşte bize İbnu'l-Munkedir böyle söyledi, dedi. Sufyân bir kerre de Câbir'in şöyle dediğini söyledi: Bunun üzerine ben Ebû Bekr'e geldim ve kendisinden alacağımı istedim. Fakat o bana vermedi. Sonra yine geldim, o yine bana vermedi. Sonra üçüncü defa geldim ve: Senden istedim, fakat sen bana vermedin. Sonra senden yine istedim, sen yine vermedin. Sonra senden istedim, sen yine vermedin. Artık ya bana verirsin, ya da benim tarafımdan cimri olursun, dedim. Bekr şöyle dedi: Benim üzerime cimrilik nisbet edersin, dedim. Birinci defada vermekten seni ancak sana vermek isteyerek men' ettim. dedi ki: Ve bize Amr ibn Dînâr, Muhammed ibn Alî'den tahdîs etti ki, Câbir şöyle demiştir: Ebû Bekr benim için bir avuç avuçladı da: Bunu say, dedi. Beri onu saydım ve beş yüz aded buldum. Ebû Bekr: Bunun (mislini) iki kerre daha al, buyurdu. dedi ki: İbnu'l-Munkedir'i kastederek o: Cimrilikten daha kötü hangi hastalık vardır? Dedi",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 3138,
			"arabicnumber": 3138,
			"text": "Bize Amr ibnu Dînâr tahdîs etti ki, Câbir ibn Abdillah (radıyallahü anh) şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) Cı'râne mevkiinde (Huneyn ve Hevâzin harbinde alınan) ganimetleri taksim etmekte iken birden (Zu'l-Huveysıra et-Temîmî denilen) bir adam Rasûlüllah'a hitaben: Adalet et! Dedi. Rasûlüllah da ona: \"Eğer ben adalet etmezsem bedbaht olurum\" buyurdu",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 3139,
			"arabicnumber": 3139,
			"text": "Bize Ma'mer ibn Râşid, ez-Zuhrî'den; o da Muhamrned ibnu Cubeyr'den; o da Bâbası Cubeyr ibnu Mut'ım'den haber verdi ki, Peygamber (sallallahü aleyhi ve sellem) müşriklerin Bedir'de esir alınanları hakkında: \"Eğer el-Mut'ım ibnu Adiyy sağ olsaydı, sonra şu kokmuş adamlar hakkında benimle konuşup onlara şefaat etseydi, muhakkak ben bunları el-Mut'im 'in hatırı için (fidye almaksızın) bırakırdım'' buyurmuştur",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 3140,
			"arabicnumber": 3140,
			"text": "Cubeyr ibnu Mut'ım (radıyallahü anh) şöyle demiştir: (Nevfel oğullarından olan) ben, (Abduşşems oğullarından olan) Usmân ibn Affân ile Rasûlüllah'ın yanına gittik de: Yâ Rasûlallah! Muttalib oğullarına verdin de bizleri bıraktın. Halbuki sana (nesebce) nisbetimiz cihetiyle bizimle Abdulmuttalib oğulları bir mertebedeyiz(hepimiz büyükbabamız Abdi Menâf'da birleşiyoruz), dedik. üzerine Rasûlüllah (sallallahü aleyhi ve sellem): \"Muttalib Oğullarıyla Hâşim Oğulları bir soydur'' buyurdu. el-Leys ibn Sa'd şöyle dedi: Bana Yûnus tahdîs edip şunu ziyâde etti: Cubeyr: Peygamber (sallallahü aleyhi ve sellem) -beşte bir hisseyi akraba arasında taksim ederken- Abdi Şems oğulları'na ve Nevfel oğulları'na birer pay ayırmamıştı, demiştir. İbnu İshâk şöyle dedi: Abdu Şems, Hâşim ve el-Muttalib ana bir kardeşlerdir. Anaları da Âtike bintu Murre'dir. Nevfel ile de bu üçü baba bir kardeşlerdir; (babaları da Abdi Menâf tır. Nevfel'in anası ise Vâkıde bintu Amr'dır)",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 3141,
			"arabicnumber": 3141,
			"text": "Abdurrahmân ibn Avf (radıyallahü anh) şöyle demiştir: Bedir harbi günü ben harb saffında durup sağıma soluma baktığım zaman Ensâr'dan yaşca taze iki genç gördüm.Bunlardan daha şiddetli ve kuvvetli olan iki kimse arasında olmamı temenni ettim. Bu iki gençten biri beni gözü ile süzdü de: Ey amca! Ebû Cehli tanır mısın? diye sordu. Ben de: Evet, tanırım, dedim ve: Ey kardeşim oğlu! Ebû Cehl'i ne ya pacaksın? Diye sordum. O da: Bana haber verildi ki, o Rasûlüllah'a sövüyormuş. Hayâtım elinde olan Allah'a yemîn ederim ki, eğer onu görürsem artık benimle ondan eceli yakın olan ölünceye kadar, şahsım onun şahsından asla ayrılmayacaktır, dedi. (bu gencin heyecanla söylediği) bu kat'î sözden dolayı hayret ettim. iki gençten diğeri de beni gözden geçirdi de öbürünün söylediği gibi söyledi. Bu sırada gözlerim hiçbir tarafa takılmadan ben Ebû Cehl'i görmüştüm. O, Kureyş askeri içinde dolaşıp duruyordu. Ben: Gençler! Öteye beriye telâşla giden şu şahıs, bana sormuş olduğunuz Ebû Cehl'dir, dedim. da çabucak kılıçlarına sarıldılar ve Ebû Cehl'i öldürünceye kadar kılıçlarıyla ona vurdular. Sonra dönüp Rasûlüllah'ın huzuruna geldiler ve hâdiseyi O'na haber verdiler. Rasûlüllah(sallallahü aleyhi ve sellem): \"Ebû Cehl'i hanginiz öldürdü?\" diye sordu. Bunlardan her biri: Onu ben öldürdüm, dedi. Rasûlüllah: \"Kılıçlarınızı sildiniz mi?\" diye sordu. Onlar: Hayır, silmedik, diye cevâb verdiler. üzerine Rasûlüllah (kılıçlarına ne kadar kan bulaştığını ve ne derece derinlikte battığını anlamak için) genç gazilerin kılıçlarına baktı da (gönüllerini hoş etmek için): \"Onu her ikiniz öldürmüşsünüz; Ebû Cehl'in ele geçen eşyası (öldürücü darbeyi vurduğu için)Muâz ibn Amr ibni'l-Cemûh'a âiddir\" buyurdu. iki mücâhid Mûaz ibn Afra ile Muâz ibn Amr ibni'l-Cemûh idi",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 3142,
			"arabicnumber": 3142,
			"text": "Ebû Katâde'nin himayesinde bulunan Ebû Muhammed'den tahdîs etti ki, Ebû Katâde(radıyallahü anh) şöyle demiştir: Biz Huneyn senesi Rasûlüllah'ın maiyyetinde sefere çıktık. Düşmanla karşılaştığımız zaman müslümân ordusu için bir ilerleme ve gerileme olmuştu. Bu sırada müşriklerden birini müslümânlardan bir kimse üzerine çıkmış hâlde gördüm. Hemen o düşman tarafına dolandım, nihayet arkasından onun yanına geldim ve boynu ile kürek kemiği arasından kılıçla onu vurdum. O hemen benden tarafa döndü ve beni öyle bir kucakladı ki, bu sıkı kucaklayıştan ölüm kokusunu hissettim. Sonra ona ölüm yetişti de beni salıverdi. Müteakiben Omer ibnu'l-Hattâb'a rast geldim ve: Bu insanlara ne oluyor? dedim. Omer: Allah'ın işidir, dedi. insanlar (bozulmanın ardından) döndüler, Peygamber de oturdu ve: \"Her kim bir düşmanı öldürür ve öldürdüğüne dâir beyyinesi de olursa, öldürdüğü kimsenin elbise, silâh ve diğer eşyası onundur\" buyurdu. hemen kalktım ve: Benim için kim şâhid olur? dedim, sonra oturdum. Sonra Rasûlüllah yine: \"Her kim bir düşmanı öldürür ve öldürdüğüne dâir beyyinesi de olursa, öldürdüğü kimsenin elbise, silâh ve diğer eşyası onundur\" yine ayağa kalktım ve: Benim için kim şâhid olur? deyip, sonra oturdum. Sonra Rasûlüllah üçüncü kerre bu sözlerin benzerini söyledi. Bunun üzerine bir adam: Yâ Rasûlallah, Ebû Katâde doğru söyledi, o öldürülen düşman askerinin eşyası benim yanımdadır. Artık hakkı olan bu şeyler yerine onu başka şeylerle benden yana razı kıl, dedi. Bekr es-Sıddîk: Allah'a yemîn olsun bu olmaz. Peygamber, Allah ve Rasûlü yolunda mukaatele eden Allah arslanlarından bir arslanın hakkını ibtâle yanaşmaz ve onun selebini sana veremez, dedi. üzerine. Peygamber (sallallahü aleyhi ve sellem): \"Ebû Bekr doğru söyledi\" buyurdu ve akabinde o ölü askerin eşyasını Ebû Katâde'ye verdi. Katâde şöyle dedi: Ben zırhı sattım ve onun bedeline mukaabil Benû Seleme yurdunda bir bustân satın aldım. İşte bu bustân İslâm'da aslına sâhib olduğum ilk maldır",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 3143,
			"arabicnumber": 3143,
			"text": "Hakîm ibn Hizam (radıyallahü anh) şöyle demiştir: Ben Rasûlüllah'tan istedim, O bana verdi. Sonra kendisinden yine istedim, O da yine bana verdi. Sonra bana şöyle buyurdu: \"Yâ Hakîm! Şu mal, yeşil, tatlı bir meyvedir. Her kim bu malı nefis ferâgatiyle (hırssız) alırsa, o malda kendisi için bereketlilik ve meymenetlilik ihsan olunur. Her kim de bunu hırs ile (nefis düşkünlüğü ile) alırsa, bu malda alan için bereketlilik ve şereflilik olmaz. hırslı kimse bir obur gibidir ki, dâima yer, fakat bir türlü doymaz. (Veren) yüksek el, (alan) alçak elden hayırlıdır.\" Hakîm dedi ki: Ben: Yâ Rasûlallah, Seni hakk ile peygamber gönderen Allah'a yemîn ederim ki, ben şu dünyâdan ayrılıncaya kadar Sen'den başka hiçbir kimseye, hiçbir şey için elimi uzatmam, dedim. Ebû Bekr, Beytu'l-mâl'daki hakkını vermek için Hakîm'i çağırmış, fakat Hakîm, Ebû Bekr'in ihsanından hiçbirşey kabul etmemiştir. Sonra Omer de onu, hakkım vermek için çağırmış, ondan da bir şey kabul etmekten çekinmiştir. Bundan sonra Omer: Ey Müslümanlar cemâati! Ben Hakîm'in, Allah'ın kendisine ayırdığı bu fey'den olan hakkını kendisine arz ediyorum, o ise bunu almaktan çekiniyor, demiştir. (hakîkaten) Hakîm, Peygamber(sallallahü aleyhi ve sellem)'den sonra tâ vefat edinceye kadar hiçbir insandan bir şey almamıştır",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 3144,
			"arabicnumber": 3144,
			"text": "Omer ibnu'l-Hattâb (radıyallahü anh) -Tâif dönüşünde Cı'râne'de: Yâ Rasûlallah! Şu muhakkak ki üzerimde Câhiliyet devrinde -el-Mescidu'l Harâm'da- bir gün i'tikâf etme adağı vardır(ne buyurursunuz)? dedi. (sallallahü aleyhi ve sellem) ona adağını îfâ edip yerine getirmesini emretti. Nâfi' şöyle demiştir: Omer (radıyallahü anh), Huneyn harbi esirlerinden iki cariyeye nail oldu ve bunları Mekke'deki evlerden birisinin içine koydu. Yine ikinci râvî Nâfi' dedi ki: Müteakiben Rasûlüllah, Huneyn(harbi) esirlerine hürriyet verdi. Bu sebeble esirler sokaklarda koşmaya başladılar. Bunun üzerine Omer, oğluna: Yâ Abdallah! Bak, gör, bu ne hâldir? Dedi da sokaklarda ileri geri koşan câriye kalabalığının sebebini sorup öğrenerek geldi ve:) Rasûlüllah bütün cariyelere hürriyet vermiştir, dedi. Omer de oğluna; Haydi sen de git ve o iki cariyeyi salıver! Dedi. Nâfi': Rasûlüllah (sallallahü aleyhi ve sellem) Ci'râne'den umre yapmamıştır; eğer oradan umre yapmış olaydı bu husus Abdullah ibn Omer'e gizli kalmazdı, demiştir. Cerîr ibn Hazım, Eyyûb'dan; o da Nâfi'den; o da İbn Omer’den olmak üzere, İbn Omer'in \"Bu iki câriye beşte birden idi\" dediğini ziyâde etmiştir. Ve bu i'tikâf hadîsini Ma'mer ibn Râşid, Eyyüb'dan; o da Nâfi'den; o da İbn Omer'den olmak üzere en-Nezr Kitâbı'nda rivayet etti, fakat orada \"Yevmin\" -yahut- \"Yevme= يَوْمَ‏ \" demedi",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 3145,
			"arabicnumber": 3145,
			"text": "Bize el-Hasen el-Basrî tahdîs edip şöyle dedi: Bana Amr ibnu Tağlib(radıyallahü anh) tahdîs edip şöyle dedi: Rasûlüllah (sallallahü aleyhi ve sellem) bir kavme (bir topluluğa) mal verdi de diğerlerine vermedi. Sonra o mal vermediklerinin kendisi aleyhine öfkeli konuşmalar yaptıklarım haber aldı da bunun üzerine şöyle buyurdu: \"Muhakkak ki ben kalb hastalığı ve sabırsızlıklarından endîşe etmekte olduğum birtakım insanlara mal veririm. Bâzı toplulukları da Allah'ın onların kalblerinde yarattığı (fıtrî) hayra ve zenginliğe havale ederim. Amr ibn Tağlib de bunlardan biridir\". Amr ibn Tağlib: Rasûlüllah'ın bu lûtufkâr sözüne bedel kırmızı develere (yani bütün dünyâya) mâlik olmayı arzu etmem, demiştir. Ebû Âsım, Cerîr ibn Hâzım'dan yaptığı rivayetinde şunu ziyâde etti: Cerîr ibn Hazım şöyle diyordu: Bize Amr ibn Tağlib(radıyallahü anh) şöyle tahdîs etti: Bir defasında Rasûlüllah'a birçok mal yahut birçok esîr -bir rivayette birçok şey- gönderilmişti. Akabinde Rasûlüllah (sallallahü aleyhi ve sellem) o malı burada zikrolunduğu surette taksim etti",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 3146,
			"arabicnumber": 3146,
			"text": "Enes (radıyallahü anh) şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem): \"Ben Kureyş'e onları müslümânlığa alıştırmak için (ganîmet malından çok hisse)veriyorum. Çünkü onlar Câhiliyet devrine yakındırlar\" buyurdu",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 3147,
			"arabicnumber": 3147,
			"text": "Bize ez-Zuhrî tahdîs edip şöyle dedi: Bana Enes ibn Mâlik(radıyallahü anh) şöyle haber verdi: Allah Hevâzin (harbindeki ganimet) mallarından kendi Rasülü'ne fey' olarak verdiği şeyleri verdiği zaman, Rasûlüllah da Kureyş'ten birtakım kimselere (kalblerini İslâm'a alıştırmak için) yüzer deve vermeye başladığı zaman, Ensâr'dan bâzı kimseler: Allah, Rasûlüllah'a mağfiret etsin! O, Kureyş'e veriyor da bizi terk ediyor. Halbuki kılıçlarımızdan hâlâ Kureyşliler'in kanları damlıyor, dediler. (sözüne devamla) dedi ki: Ensâr'ın bu sözü Rasûlüllah'a duyuruldu da, Rasûlüllah Ensâr'a haber gönderdi ve onları deriden bir çadır içinde toplattı. Ensâr'dan başka kimseyi onların yanına bırakmadı. Ensâr toplanınca, Rasûlüllah, onların yanına geldi ve: \"Sizin tarafınızdan söylenip bana ulaşan söz nedir?\" buyurdu. Ensâr'ın anlayış sahibi olanları Rasûlüllah'a hitaben: Yâ Rasûlallah! Bizim re'y sahibi olanlarımız hiçbir söz söylemediler. Amma bizden yaşları küçük birtakım genç insanlar \"Allah, Rasûlüllah'a mağfiret etsin. O, Kureyş'e veriyor da Ensâr'ı terk ediyor; Halbuki bizim kılıçlarımızdan henüz Kureyşliler'in kanları damlıyor\" sözlerini söylediler, dediler. üzerine Rasûlüllah (sallallahü aleyhi ve sellem) şunları söyledi: \"Şüphesiz ben zamanları kâfirliğe yakın bulanan birtakım insanlara dünyalık mal veriyorum. İnsanlar evlerine aldıkları malları götürürlerken sizler yurtlarınıza Allah'ın Rasûlü ile dönmenizden râzı olmuyor musunuz? Allah'a yemin ederim ki, sizin kendisiyle dönüp gideceğiniz şey, onların alıp gidecekleri şeyden hayırlıdır!\" üzerine Ensâr: Evet yâ Rasûlallah! Bizler razı olmuşuzdur, dediler. onlara: \"Sizler benden sonra yakında (dünyâ işlerinde) başkalarının size şiddetle tercih edildiğini göreceksiniz. O takdirde sizler havuz başında Allah'a ve Rasûlü'ne kavuşuncaya kadar sabrediniz (ki sabra karşı bol sevaba zafer bulaşınız)\" buyurdu. Enes: Fakat biz sabredemedik, demiştir",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 3148,
			"arabicnumber": 3148,
			"text": "Muhammed ibn Cubeyr şöyle demiştir: Bana babam Cubeyr ibn Mut'ım haber verdi ki, kendisi Rasûlüllah'ın beraberinde bulunduğu ve Rasûlüllah da beraberinde birtakım insanlar olduğu hâlde Huneyn seferinden döndüğü sırada birtakım bedevi Arablar ganimet isteyerek Rasûlüllah'ın etrafına takılmışlardı. Hattâ Rasülullah'ı sıkıştırıp zorlamışlardı da O'nu Semure (denilen dikenli büyük bir ağaç) altına sığınmaya mecbur etmişlerdi. Ve o ağacın iri dikenleri Rasûlüllah'ın ridâsına takılıp kapmıştı da bu yüzden Rasûlüllah bir müddet orada durmuş ve: \"Ridâmı bana veriniz! Eğer şu iri dikenli ağacın dikenleri sayısınca ganimet devesi ve sığırı mevcûd olaydı, muhakkak ben onları aranızda taksim ederdim. Sonra siz beni ne cimri, ne yalancı, ne de korkak bulmazdınız (yânı böyle ittihâm etmezdiniz)\" buyurdu",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 3149,
			"arabicnumber": 3149,
			"text": "Enes ibn Mâlik (radıyallahü anh) şöyle demiştir: Ben (bir kerresinde) Peygamber'in beraberinde yürüyordum. Peygamber'in üzerinde Necrân dokumalarından kalın kenarlı bir ridâ (yânı bir kaftan) bulunuyordu. Bir çöl Arabı Peygamber'e yetişti de ridâsını şiddetle çekti. O sırada ben Peygamber'in boynu ile iki omuzu arasına baktım da bedevînin ridâyı şiddetle çekmesinden dolayı, ridânın kalın kenarı Peygamber'in boyun safhasında iz bırakmış olduğunu gördüm. Bundan sonra bedevi, Peygamber'e: Yanında bulunan Allah malından bana bir şey verilmesini emret, dedi. üzerine Peygamber (sallallahü aleyhi ve sellem), bedeviye doğru (şefkatle) baktı da güldü, sonra bu bedeviye biraz dünyalık verilmesini emretti",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 3150,
			"arabicnumber": 3150,
			"text": "Abdullah ibn Mes'ûd (radıyallahü anh) şöyle demiştir: Huneyn günü harb olup bitince Peygamber(sallallahü aleyhi ve sellem) -ganîmet taksîmi sırasında- bâzı kimselere fazla vermek suretiyle bir tercîh ve hususiyet bahşetti. Meselâ (kalbleri İslâm'a alıştırılanlardan) el-Akra' ibnu Hâbis'e yüz deve verdi. Uyeyne'ye de bunun kadar vermişti. Arab eşrafından bâzı insanlara da bu suretle (yüzer deve) ihsan buyurdu da, bu Arab eşrafını o gün ganîmet taksiminde başkalarına tercîh etmişti. (Peygamber'in bundan maksadını anlamayanlardan) bir kişi (i'tirâz ederek): Vallahi bu taksim, kendisinde adalet gözetilmeyen yahut kendisiyle Allah rızâsı kastedilmeyen bir taksimdir, dedi. de: Vallahi bu (küstahça) sözü ben Peygamber'e muhakkak haber veririm, dedim. akabinde Peygamber'e varıp bunu kendisine haber verdim. aleyhi ve sellem): \"Allah ve Rasûlü adalet etmezse kim adalet eder? Allah Mûsâ'ya rahmet etsin, o bundan daha çok sözlerle ezâlandırıldı da sabretti\" buyurdu",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 3151,
			"arabicnumber": 3151,
			"text": "Ebü Bekr'in kızı Esma (radıyallahü anh) şöyle demiştir: Ben, Rasûllullah’ın ez- Zübeyr’e kesip verdiği hurmalık arazisinden(deveye yedirmek için) başının üstünde hurma çekirdeği taşır idim. Bu hurmalık benim meskenimden bir fersahın üçe ikisi uzaklıkta idi. Ebu Damre Enes ibn Iyâd Hişâm’dan; O da babası Urve İbni'z-Zubeyr'den söyledi ki, Peygamber (sallallahü aleyhi ve sellem) ez-Zubeyr’e Benu Nadır mallarından bir mikdâr hurmalık arazı ayırıp vermiştir",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 3152,
			"arabicnumber": 3152,
			"text": "Bize Mûsâ ibn Ukbe tahdîs edip şöyle dedi: Bana Nâfi', İbn Omer(radıyallahü anh) 'den şöyle haber verdi: Omer ibnu'l-Hattâb (radıyallahü anh), -devlet başkanlığı zamanında- Yahûdî ve Hrıstiyanlar'ı Hicaz toprağından çıkardı. Rasûlüllah (sallallahü aleyhi ve sellem) da Hayber ahâlîsine gâlib gelip orayı fethedince Yahûdîler'i oradan çıkarmak istemişti. (Çünkü) Rasûlüllah bu toprağı fethettiği zaman o arazî Yahûdîler'in, Rasûl'ün ve müslümanların olmuştu.(Rasûlüllah Yahûdîler'i çıkarmak istemişti.) Bunun üzerine Yahudiler, Rasûlüllah'tan hurmaları tımar etmek ve mahsûlün yarısı kendilerine âid olmak üzere, kendilerini yurdlarında bırakmasını istediler. Rasûlüllah onlara: \"Dediğiniz şartlara göre sizleri dilediğimiz müddetçe burada oturtuyoruz\" buyurdu. Omer bunları kendi devlet başkanlığı zamanında Teymâ ve Erîha'ya sürünceye kadar Hayber'de oturtuldular",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 3153,
			"arabicnumber": 3153,
			"text": "",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 3154,
			"arabicnumber": 3154,
			"text": "Abdullah ibn Omer (radıyallahü anh): Biz gazalarımızda bal, üzüm (gibi yiyecek şeyler) ele geçirirdik de bunları (yerinde) yerdik,(biriktirmek için) taşımazdık, demiştir",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 3155,
			"arabicnumber": 3155,
			"text": "Ben Abdullah ibn Ebî Evfâ'dan işittim, şöyle diyordu: Hayber gecelerinde bize şiddetli bir açlık isabet etmişti. Hayber günü olduğu zaman bizler ehlî eşeklerin içine düştük ve onları kestik. Eşek etlerinin pişmekte olduğu tencereler kaynayınca Rasûlüllah'ın münâdîsi: Tencereleri devirin ve sakın eşeklerin etlerinden hiçbir şey yemeyin! Diye nida etti. Abdullah dedi ki: Peygamber(sallallahü aleyhi ve sellem) bunları ancak henüz beşte bir taksimine tâbi' tutulmadıkları için nehyetmiştir, dedik. Diğerleri de: Peygamber(sallallahü aleyhi ve sellem) eşek etlerinden kesin olarak nehyetmiştir, dediler. eş-Şeybânî dedi ki: Ben Saîd ibn Cubeyr'e sordum da, o da: Peygamber eşek etlerini kat'î olarak yasak etti, dedi",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 63
			}
		}
	]
}