{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"58": "Jizyah and Mawaada'ah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3157,
			"arabicnumber": 3157,
			"text": "",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3158,
			"arabicnumber": 3158,
			"text": "ez-Zuhrî şöyle demiştir: Bana Urvetu'bnu'z-Zubeyr, el-Misver ibnu'l-Mahrame'den tahdîs etti, ona da Âmir ibn Luey oğulları'nın yeminli dostu olan ve Bedir harbinde hazır bulunan Amr ibn Avf el-Ensârî (radıyallahü anh) şöyle haber vermiştir: aleyhi ve sellem) harb etmeksizin Bahreyn ahâlîsiyle barış andlaşması yapmış ve Bahreyn ahâlîsi üzerine el-Alâ ibnu'l-Hadramî'yi emîr ta'yîn etmişti. Tahsil olunan cizye mallarını getirmek üzere de Rasûlüllah, arkadan Ebû Ubeyde ibnu'l-Cerrâh'ı Bahreyn'e gönderdi. Ebû Ubeyde cizye mallarını alıp Bahreyn'den Medine'ye geldiğinde, Ensâr onun geldiğini işitince -ki bu haberin yayılması sahabelerin, Peygamber'in beraberinde sabah namazı kıldıkları zamana tesadüf etmişti- Peygamber'in onlara sabah namazını kıldırıp ayrılması ile beraber hemen sahâbîler Ebû Ubeyde'ye karşı çıktılar. Rasûlüllah sahâbîleri bu hâlde görünce gülümsedi ve onlara: \"Ebû Ubeyde'nin birçok malla geldiğini işitmiş olduğunuzu sanıyorum\" buyurdu. da: Evet yâ Rasûlallah! Diye tasdik ettiler. Bunun üzerine Rasûlüllah: \"Sevininiz ve sizi sevindirecek ni'metleri (bundan böyle her zaman) ümîd ediniz. Allah'a yemin ederim ki (bundan sonra) size fakirlik ve ihtiyaç geleceğinden korkmam. Fakat sizin üzerinize korkmakta olduğum şey, sizden önce gelip geçen ümmetlerin önüne dünyâ nimetlerinin yayıldığı gibi sizin önünüze de yayılması, onların birbirlerine bu nimetlerde hased ettikleri ve en nefîs olanını elde etme yarışına giriştikleri gibi sizin de birbirinizle nefsâniyet yarışına girişmeniz ve bu yarışmanın onları helak ettiği gibi sizleri de helak etmesidir\" buyurdu",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3160,
			"arabicnumber": 3160,
			"text": "",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3161,
			"arabicnumber": 3161,
			"text": "Ebû Humeyd es-Sâidî (radıyallahü anh) şöyle demiştir: Biz Peygamber(sallallahü aleyhi ve sellem)'in beraberinde Tebûk'e gaza etmiştik. (Bu sefer esnasında) Eyle Meliki (Buhne -yahut Yuhannâ- ibn Ru'be Peygamber'in huzuruna geldi, sulh oldu, cizye vermeyi kabul etti,) Peygamber'e (Düldül adlı) beyaz bir katır hediye etti. Ve kendisine de bir Yemen bürdü giydirdi. Peygamber de ona sahil boyundaki köyler halkı hakkında bir emânnâme yazdı",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3162,
			"arabicnumber": 3162,
			"text": "Bize Ebû Cemre tahdîs edip şöyle dedi: Ben Cuveyriye ibnu Kudâme et-Teymî'den işittim, şöyle dedi: Ben Omer ibnu'l-Hattâb (radıyallahü anh)'dan işittim. Ona: Ey Mü'minlerin Emîri! Bize vasiyyet eyle! dedik. Omer: Sizlere Allah'ın zimmetini yerine getirmeyi tavsiye ediyorum. Çünkü bu, Peygamberinizin zimmeti ve ıyâlinizin rızkıdır, dedi (Zımmîler'den alınmakta olan cizye ve haracı kasdetti)",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 3163,
			"arabicnumber": 3163,
			"text": "Ben Enes (radıyallahü anh)'ten işittim, şöyle dedi: Peygamber(sallallahü aleyhi ve sellem) Bahreyn toprağından (yânı oranın cizye ve haracından kesip ayırmak yoluyla her birinin hissesini tayîn edip) kendi isimlerine yazmak için Ensâr'ı çağırdı. Ensâr: Bize ayırıp verdiğin şeyin benzerini Kureyş'ten olan Muhacir kardeşlerimize de ayırıp verinceye kadar vallahi olmaz(yânı kabul etmeyiz), dediler. üzerine Peygamber: \"Bu mal Allah'ın dilediği bu usûl üzere Kureyş Muhacirleri'ne de âiddir\" buyurdu. Muhâcirler'in durumu hakkında ısrar ederek bunu Peygamber'e söylüyorlardı. Sonunda Peygamber, Ensâr'a hitaben: \"Benden sonra siz Ensâr topluluğu yakın bir gelecekte başkalarının size tercih edilmesini göreceksiniz.O takdirde sizler (havz başında) bana kavuşuncaya kadar sabrediniz!\" buyurdu. hadîsin bir rivayeti Şirb Kitâbı'nda da geçmişti",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3165,
			"arabicnumber": 3165,
			"text": "",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3166,
			"arabicnumber": 3166,
			"text": "",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3167,
			"arabicnumber": 3167,
			"text": "",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3168,
			"arabicnumber": 3168,
			"text": "İbn Abbâs radıyallahü anhüma şöyle diyordu: O perşembe günü; o perşembe günü ne acı gündü! dedi de, sonra ağladı; hattâ gözyaşları yerdeki çakılları ıslattı.(Saîd ibn Cubeyr dedi ki:) Ben: Ey Abbâs oğlu! O perşembe günü nedir? dedim. İbn Abbâs dedi ki: Perşembe günü Rasûlüllah'ın ağrısı şiddetlenip arttı. Bunun üzerine: \"Bana bir kürek kemiği getirin. Size bir kitâb (bir vasiyetname) yazdırayım ki, ondan sonra ebediyyen yolunuzu şaşırmayasınız!\" buyurdu. Bunun üzerine orada bulunanlar ihtilâf edip çekiştiler. Rasûlüllah:\"Hiçbir peygamberin yanında ihtilâf edip çekişmek lâyık ve doğru olmaz\" buyurdu. Oradakiler: Rasûlüllah’ın nesi var(hastalığın şiddetinden dolayı) sayıkladı mı? Bunu kendisinden almak isteyin! Dediler. Rasûlüllah: \"Beni (kendi hâlime) bırakınız. Benim şu içinde bulunduğum (murakabe ve Allah'a dönüş hazırlığı) hâl, sizin beni da'vet ettiğiniz (yazı yazmak gibi) şeylerden hayırlıdır\" buyurdu. Ve sahâbîlere üç şey emretti: \"Bütün müşrikleri Arab yarımadasından çıkarınız!\" \"Elçilere, ferd ve hey'etlere benim izin verip hediyeler ikram etmekte olduğum gibi, siz de yabancı elçilere, hey'etlere hediyeler vermek suretiyle hürmet gösteriniz\" buyurdu. Üçüncüsü hayırlıdır: Ya üçüncüsünden sükût etti, yahut onu söyledi de ben onu unuttum. Sufyân ibnu Uyeyne: Bu, râvî Süleyman ibn Ebî Müslim'in sözündendir, demiştir",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3169,
			"arabicnumber": 3169,
			"text": "",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3170,
			"arabicnumber": 3170,
			"text": "Bize Âsim ibn Süleyman tahdîs edip şöyle dedi: Ben Enes(radıyallahü anh)'e kunûttan sordum. Enes: Kunût, rukû'dan öncedir, dedi. Bunun, üzerine ben Enes'e: Fulân kimse (yânı Muhammed ibn Sîrîn) iddia ediyor ki, sen kunût rukû'dan sonradır demişsin (buna ne dersin)? diye sordum. O yanlış söylemiştir, dedi. bize, Peygamber (sallallahü aleyhi ve sellem)'in rukû'dan sonra Suleym oğulları’ndan olan bâzı Arab kabileleri aleyhine duâ ederek bir ay kunût yaptığını tahdîs etti. sayıda tereddüd ederek dedi ki: Peygamber (sallallahü aleyhi ve sellem) kırk yâhûd yetmiş kurrâyı, müşriklerden birtakım insanların yanına göndermişti. O kabileler bunlara karşı çıktılar ve onları öldürdüler. O müşrikler ile Peygamber arasında yapılmış bir ahid de vardı. Artık ben Peygamber'in bunlar üzerine hüzünlendiği kadar hiçbir kimse üzerine hüzünlendiğini görmedim",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3171,
			"arabicnumber": 3171,
			"text": "Bize Mâlik, Omer ibn Ubeydillah'ın âzâdlısı olan Ebu'n- Nadr'dan haber verdi. Ona da Ebû Tâlib'in kızı Ümmü Hani'in âzâdlısı Ebû Murre haber vermiştir. Ebû Murre, Ebû Tâlib'in kızı Ümmü Hâni' şöyle derken işitmiştir: Ben Mekke fethi yılı Rasûlüllah'ın yanına gittim ve O'nu yıkanıyor buldum. Kızı Fâtıma da O'nu perde ile örtüyordu. Kendisine selâm verdim. \"Bu kadın kimdir?\" diye sordu. Ben: Ben Ebû Tâlib'in kızı Ümmü Hâni'im, dedim. Rasûlüllah(sallallahü aleyhi ve sellem): \"Merhaben bi-ümmi hânî (Hoş geldin Ümmü Hâni')\" buyurdu. ayrılınca bir tek elbise içinde (yani sırtındaki bezi) çaprazvari bağlamış olduğu hâlde sekiz rek'at namaz kıldı. Namaz akabinde ben kendisine: Yâ Rasûlallah! Anamın oğlu Alî, benim ahd ve emân verdiğim fulânı, İbnu Hubeyre'yi öldüreceğini söylüyor, dedim. \"Yâ Ümme Hâni'! Senin ahd ve emân verdiğin kimseye biz de ahd ve emân verdik\" buyurdu. kıldığı bu namaz, duhâ namazı idi",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3172,
			"arabicnumber": 3172,
			"text": "Bize Vekf ibnu'l-Cerrâh, el-A'meş'ten; o da İbrâhîm et-Teymî'den haber verdi ki, babası Yezîd ibn Şureyk şöyle demiştir: Alî ibn Ebî Tâlib (radıyallahü anh) hutbe yaptı da şunları söyledi: Bizim yanımızda Allah'ın Kitâbı'ndan başka [okumakta olduğumuz] bir kitâb yoktur. Bir de şu sahîfenin içinde bulunan hükümler vardır. Bunun içinde şunlar yazılıdır, dedi: \"Yaralamaların hükümleri, diyet develerinin yaşları, bir de Medine'nin Aîr Dağı'yla şuraya kadar arası haramdır; kim Medine'nin bu haremi içinde Kitâb ve sünnete aykırı bir bid'at çıkarır yahut burada bir bid'atçıyı barındırına Allah'ın, meleklerin ve bütün insanların la'neti onun üzerine olsun. Ondan ne bir nafile ibâdet, ne de bir farz ibâdet kabul olunur. Her kim de velîlerinden başkasını velî edinirse, onun üzerine de bid'atçının üzerine olan la'netin benzeri olsun! Müslümanların emânı birdir. Her kim bir müslümânın verdiği ahdi bozarsa, ona da bunun benzeri olsun(yani Allah'ın, meleklerin ve bütün insanların la'neti onun üzerine olsun ve ondan ne bir nafile, ne de bir farz ibâdet kabul olunsun)",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3173,
			"arabicnumber": 3173,
			"text": "Sehl ibnu Ebî Haşmete şöyle demiştir: (Bir hurma mevsimi) Abdullah ibn Sehl ile Mes'ûd ibn Zeyd'in oğlu Muhayyısa, Hayber'e gitmişlerdi. O sene Hayberliler'le müslümânlar arasında barış vardı. Bu iki yoldaş Hayber'e vardıklarında (kendi işlerine) ayrıldılar. Bir müddet sonra Muhayyısa (işlerini bitirip) Abdullah ibn Seh1’e geldi. Fakat Abdullah kan içine bulanmış, öldürülmüş bir hâlde idi. Muhayyısa onu gömdü. Sonra dönüp Medine'ye geldi. Vak'ayı Peygamber'e arz etmek üzere Abdurrahmân ibn Sehl ve (Ensâr'dan Mes'ûd'un iki oğlu) Muhayyısa ile Huveyyısa Peygamber'e gittiler. (Evvelâ) Abdurrahmân söze başladı. Fakat Peygamber(sallallahü aleyhi ve sellem), yaşça pek genç olan Abdurrahmân'a: \"İlik sözü yaşlıya bırak, ilk sözü yaşlıya ver!\" buyurdu. Bunun üzerine Abdurrahmân sustu. İki kardeş vak'ayı arz ettiler. Sonunda Peygamber onların üçüne: \"Bu cinayetin Hayber'de Yahudiler tarafından işlendiğine yemin eder ve arkadaşınızın kan bedeli olan diyete hakk kazanır mısınız?\" teklifinde bulundu. Onlar da: Yanında bulunmadığımız ve görmediğimiz bir cinayet hakkında nasıl yemîn ederiz? Dediler ve çekindiler. Peygamber: \"Şu hâlde Yahudiler elli yemin ile isnâd ettiğiniz cinayetten size berâatlerini isbât ederler\" buyurdu. Da'vâcılar: Kâfirler güruhunun yeminlerine nasıl tutunabiliriz? diye razı olmadılar. üzerine Peygamber (sallallahü aleyhi ve sellem) cinayetin diyetini kendi yanından verdi",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3174,
			"arabicnumber": 3174,
			"text": "Abdullah İbn Abbâs radıyallahü anhüma haber vermiştir: Ona da Ebû Sufyân ibn Harb haber vermiştir: Gerek Ebû Sufyân, gerek Kureyş kâfirleri ile Rasûlüllah, Hudeybiye barışıyla akdeylediği mütâreke müddeti içinde ticâret için Şam'a giden bir Kureyş kaafilesi içinde bulunduğu sırada Rûm Kayseri Hırakl tarafından da'vet olunmuş. Ebû Sufyân ile arkadaşları Hırakl'ın yanına gelmişler",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 3175,
			"arabicnumber": 3175,
			"text": "Bize Hişâm tahdîs edip şöyle dedi: Bana babam Urve ibnu'z-Zubeyr, Âişe (r.anha)'den: Peygamber (sallallahü aleyhi ve sellem)'e sihr yapıldığını, hattâ Peygamberce işlemediği bir şeyi işlediği hayâli verildiğini tahdîs etti",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 3176,
			"arabicnumber": 3176,
			"text": "Ebû İdrîs şöyle demiştir: Ben Avf ibn Mâlik'ten işittim, şöyle dedi:.Ben Tebûk gazasında deriden yapılmış yuvarlak bir çadır içinde iken Peygamber'in huzuruna geldim.(Görüşürken bana) şöyle buyurdu: \"Kıyâmetin kopması yaklaştığı sıra (onun alâmetlerinden olmak üzere şu) altı şeyi say!. ölümüm",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 3177,
			"arabicnumber": 3177,
			"text": "Ebû Hureyre (radıyallahü anh) şöyle demiştir: Ebû Bekr (radıyallahü anh) nahr gününde Minâ'da i'lân yapacak olan kimseler içinde: \"Artık bu yıldan sonra hiçbir müşrik hac, hiçbir çıplak da Beyt'i tavaf etmesin!\" diye ilâna beni de gönderdi. En büyük hac günü nahr günüdür. Ona en büyük hac denilmesi, insanların umreye küçük hac demelerinden dolayıdır. İşte Ebû Bekr bu yıl içinde insanlara ahidlerini attı da artık Peygamber'in yapmış olduğu Veda Haccı yılında hiçbir müşrik hac yapmadı",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 3178,
			"arabicnumber": 3178,
			"text": "Abdullah ibn Amr (radıyallahü anh) şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: \"Dört huy vardır ki, bunlar her kimde topluca bulunursa o kişi hâlis münafık olur: söylediğinde yalan söyleyen; ettiği zaman va'dinden dönen; ettiğinde ahdini bozan; ve muhakeme zamanında haktan ayrılan kişi. bir kişide bu huylardan birisi bulunursa o (kötü) huyu bırakıncaya kadar kendisinde münafıklıktan bir huy bulunur",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 3179,
			"arabicnumber": 3179,
			"text": "Alî (radıyallahü anh) şöyle demiştir: Bizler Peygamber(sallallahü aleyhi ve sellem)'den Kur'ân'dan başka bir şey yazmadık; bir de şu sahîfenin içindeki şeyleri yazdık: Peygamber (sallallahü aleyhi ve sellem) şöyle buyurdu: \"Medine şuraya kadar Âir Dağı arası haremdir. Kim Medine'nin bu haremi içinde Kitâb ve sünnete aykırı bir iş işlerse yahut bir bid'atçıyı barındırır, yardım ederse Allah'ın, meleklerin ve toptan bütün insanların la'neti onun üzerine olsun. Ondan hiçbir adalet ve hiçbir harcama kabul olunmaz. Müslümanların emânı (ahdi) birdir. Müslümanların sayıca en azı da bu emânı yürütür. Kim bir müslümânın verdiği ahdi bozarsa Allah'ın, meleklerin ve toptan bütün insanların la'neti onun üzerine olsun. Ondan ne nafile, ne farz hiçbir ibâdet kabul olunmaz. Her kim de kendi efendilerinin izni olmaksızın başka bir kavmi velî ve efendi edinirse Allah'ın, meleklerin ve toptan bütün insanların la'neti onun üzerine de olsun ve ondan hiçbir harcama ve hiçbir adi kabul olunmasın\". Ebû Mûsâ Muhammed ibnu'l-Müsennâ şöyle dedi: Bize Hâşim ibnu'l-Kaasım tahdîs edip şöyle dedi: Bize İshâk ibn Saîd, babası Saîd ibn Amr'dan tahdîs etti ki, Ebû Hureyre (bir kerre mecliste bulunanlara): (Cizye ve harâc olarak) dînâr, dirhem almayacak olursanız hâliniz nice olur? Demişti de kendisine: Yâ Ebâ Hureyre, sen böyle birşeyin olacağını nasıl düşünüyorsun? Denilmişti.' üzerine Ebû Hureyre(radıyallahü anh): Evet, Ebû Hureyre'nin nefsi elinde olan Allah'a yemîn ederim ki, ben size kendisi doğru söyleyen, kendisine de(vahiyle) doğru söylenenin(Rasûlüllah'ın) sözünden haber veriyorum, dedi. Oradakiler: Pekiyi! Şu cizye, haraç altınlarını, gümüşlerini alamamak neden neş'et ediyor? Diye sordular. Ebû Hureyre: Allah'ın ve Rasûlü'nün muâhedeli kimselere verdikleri ahd ve emânlar yırtılır, atılır; o zaman Azîz ve Celîl olan Allah zımmîlerin kalblerini sıkıca bağlar da bu sebeble onlar ellerindeki cizye, harâc mallarını vermezler, diye cevâb verdi",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 3180,
			"arabicnumber": 3180,
			"text": "",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 3181,
			"arabicnumber": 3181,
			"text": "",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 3182,
			"arabicnumber": 3182,
			"text": "Bana Ebû Vâil tahdîs edip şöyle dedi: Biz Sıffîn'da bulunduk. Sehl ibnu Huneyf ayağa kalkıp şunları söyledi: Ey insanlar! Siz kendi nefislerinizi töhmetli kılınız. Bizler Hudeybiye gününde Rasûlüllah'ın maiyyetinde bulunduk. Eğer bizler harb etmeyi(hayırlı) görseydik, muhakkak harb ederdik. Omer ibnu'l-Hattâb geldi ve: Yâ Rasûlallah! Onlar bâtıl üzerinde, bizler ise hakk üzerinde değil miyiz? dedi. \"Evet, biz hakk üzerindeyiz\" buyurdu. Omer: Bizim ölülerimiz cennette, onların ölüleri ateşte değil mi? dedi. Rasûlüllah: \"Evet böyledir\" buyurdu. Omer: Öyle ise dînimiz uğrunda bu alçaklığa hangi sebeble söz veriyoruz ve Allah henüz onlarla bizim aramızda hükmünü vermeden biz neden dönüyoruz? dedi. \"Ey Hattâb oğlu! Ben Allah'ın Rasûlü'yüm. Allah beni ebediyyen zayi' etmeyecektir\" buyurdu. üzerine Omer, Ebû Bekr'e gitti ve ona da Peygamber'e söylediği sözlerin benzerini söyledi. Ebû Bekr de Omer'e: Şübhesiz O, Allah'ın Rasûlü'dür ve Allah O'nu ebediyyen zayi' etmeyecektir, dedi. dedi ki: Müteakiben el-Feth Süresi indi. Rasûlüllah bu sûreyi sonuna kadar Omer'e karşı okudu. Akabinde Omer: Yâ Rasûlallah! Feth bu mudur? dedi. Rasûlüllah: \"Evet\" buyurdu (ve Omer'in gönlü hoş olup döndü)",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 3183,
			"arabicnumber": 3183,
			"text": "Esma bintu Ebî Bekr (radıyallahü anh) şöyle demiştir. Annem Kuteyle bintu'l-Hâris müşrike olduğu hâlde Kureyş'in Rasûlüllah ile muahede yaptıkları zaman, bu müddetleri içinde babası Haris ile beraber Medine'ye benim yanıma(bâzı hediyelerle) geldi. Esma, Rasûlüllah'tan fetva istedi de: Yâ Rasûlallah! Annem beni arzu ederek bana geldi. Ben onunla ilgileneyim mi? dedi. Rasûlüllah (sallallahü aleyhi ve sellem): \"Evet, annene ilgi ve iltifat eyle\" buyurdu",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 3184,
			"arabicnumber": 3184,
			"text": "Bana el-Berâ (radıyallahü anh) şöyle tahdîs etti: Peygamber (sallallahü aleyhi ve sellem) –altıncı yılın zu’l-ka'desinde- umre yapmak istediği zaman, Mekke'ye girmek için onlardan izin istemek üzere Mekke ahâlîsine elçi gönderdi. Mekkeliler Peygamber'e (gelecek yıl girmesini,) Mekke'de ancak üç gece ikaamet etmesini, Mekke'ye ancak kılıç ve yay gibi silâhlar kınları içinde olarak girmesini ve Mekkeliler'den hiçbir kimseyi da'vet etmemesini şart koştular. dedi ki: Bu şartları aralarında Alî ibn Ebî Tâlib yazmaya başladı ve: \"Bu, Muhammed Rasûlüllah'ın üzerinde sulh olduğu anlaşma maddeleridir\" yazdı. Biz senin Allah'ın Rasûlü olduğunu bilmiş ve tasdîk etmiş olaydık, seni Beyt'ten men' etmezdik ve elbette sana bey'at ederdik. Fakat sen: \"Bu Abdullah oğlu Muhammed'in üzerinde anlaştığı maddelerdir\" diye yaz, dediler. üzerine Peygamber: \"Allah 'a yemîn ederim ki ben Abdullah'ın oğlu Muhammed'im ve yine Allah'a yemin ederim ki, ben Allah'ın Rasûlü'yum\" buyurdu. yazmıyordu. dedi ki: Resûlüllah, Alî'ye hitaben: \"Rasûlüllah lafzını sil\" buyurdu. Alî: Vallahi ben Rasûlüllah lafzını ebediyyen silmem! dedi. Peygamber: \"Öyleyse onu bana göster!\" buyurdu. dedi ki: Alî, Peygamber'e o lâfzı gösterdi, Peygamber de kendi eliyle Rasûlüllah lâfzını sildi. Ertesi yıl Peygamber Mekke'ye girip şart kıldıkları üç gün (ikaamet süresi) geçince, Mekkeliler Alî'ye geldiler ve: Peygamber'ine söyle de hemen Mekke'den hareket etsin! dediler. de bunu Rasûlüllah'a zikretti. Bunun üzerine Peygamber: \"Evet(müddet tamam)\" buyurduktan sonra hareket etti",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 3185,
			"arabicnumber": 3185,
			"text": "Abdullah ibn Mes'ûd (radıyallahü anh) şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) Ka'be'nin yanında secde edici olduğu sırada etrafında Kureyş müşriklerinden birtakım insanlar vardı. Bu sırada Ukbe ibnu Ebî Muayt, (kesilmiş olan) bir devenin döl eşini getirdi ve onu, secde hâlindeki Peygamber'in sırtı üzerine attı. Peygamber secdeden başını kaldırmadı. Nihayet kızı Fâtıma aleyhi'sselâm geldi, onu sırtından aldı ve bu işi yapan kimseler aleyhine beddua etti. de (namazını tamamlayınca): \" Allahım! Kureyş'ten olan bu topluluğu Sana havale ediyorum. Allahım Ebû Cehl ibn Hişâm'ı, Utbe ibn Rabîa'yı, Şeybe ibn Rabîa'yı, Ukbe ibn Ebî Muayt'ı, Ümeyyeibn Halefi-yahut:Ubeyy ibn Halefi- Sana havale ediyorum (yânı bunları yakala da helak eyle)\" diye beddua etti. şöyle dedi: Allah'a yemîn ediyorum ki, ben bu sayılanları Bedir gününde öldürülmüşler gördüm. Sonra bunlar bir kuyunun içine atıldılar. Ancak Ümeyye ibn Halef yahut Ubeyy ibn Halef müstesnadır. Çünkü bu iri bir adamdı. Onu kuyuya atmak üzere sürükledikleri zaman, kuyuya atılmadan önce bütün eklemleri parça parça oldu",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 3186,
			"arabicnumber": 3186,
			"text": "Sâbit'ten ve Enes'ten tahdîs etti ki, Peygamber (sallallahü aleyhi ve sellem): \"Ahdini bozan her kişi için kıyâmet gününde bir bayrak vardır\" buyurmuştur. Râvîlerin biri \"Bayrak dikilir\"; diğeri de: \"Kıyâmet gününde kendisiyle ahde vefasızlık derecesinin tanınacağı bir alâmet (bir bayrak) görülür'' şeklinde rivayet etmiştir",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 3188,
			"arabicnumber": 3188,
			"text": "",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 3189,
			"arabicnumber": 3189,
			"text": "Abdullah İbn Abbâs radıyallahü anhüma şöyle demiştir: Rasûluüah (sallallahü aleyhi ve sellem) Mekke'nin fethi günü: \"Mekke fethinden sonra (artık Mekke'den Medine'ye)hicret yoktur. Mekke'den yalnız cihâd kasdı ve ilim tahsili niyetiyle çıkılabilir. Devlet tarafından cihâd seferine hareket etmeniz istendiği zaman hemen toplanıp seferber olunuz\"buyurdu. yine Rasûlüllah Mekke fethi günü: \"Şübhesiz ki Allah bu beldeyi, gökleri ve yeri yarattığı günden beri haram kılmıştır. İşte bu Mekke şehri Allah'ın haram kılması sebebiyle kıyâmet gününe kadar haram(yani ihtiram edilmesi vâcib) olmuştur. Ve şu da muhakkak ki benden evvel burada harb etmek hiçbir kimseye halâl olmamıştır. Benim için de sâdece bir gündüzün bir saatinde halâl olmuştur. Binâenaleyh Mekke, Allah'ın haram kılması sebebiyle kıyâmete kadar haram bir şehirdir; dikeni kesilmez, av hayvanları ürkütülmez, orada düşürülmüş şeyi ancak sahibini arayacak olan kimse uzanıp alabilir, Mekke'nin yeşil otları da koparılmaz\" buyurdu. üzerine el-Abbâs: Yâ Rasûlallah! Izhır otu müstesna olsun! Çünkü o Mekkeliler'in demircileri ve kuyumcuları ve evleri içindir! dedi. \"Izhır müstesna olsun!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 30
			}
		}
	]
}