{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"59": "Beginning of Creation"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3190,
			"arabicnumber": 3190,
			"text": "İmran İbn Husayn r.a.'ın şöyle dediği nakledilmiştir: \"Temim oğullarından bir grup Nebi Sallallahu Aleyhi ve Sellem'in yanına gelmişlerdi. Resulullah Sallallahu Aleyhi ve Sellem onlara: \"Ey Temim oğulları, müjdeler olsun size!\" buyurdu. Onlar da daha sonra şöyle dediler: \"Sen bize müjde vermiştin. Haydi bize vereceğini ver!\" Bunun üzerine Hz.Nebi'in yüzündeki ifade değişti. Daha sonra Yemenliler geldi. Resul-i Ekrem Sallallahu Aleyhi ve Sellem onlara: \"Ey Yemenliler, müjdeyi kabul edin! Temim oğullarını sorarsanız onlar verdiğim müjdeyi kabul etmedi\" dedi. Onlar bu davete uyarak: \"Kabul ettik\" dediler. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem onlara yaratılışın başlamasından ve arştan bahsetmeye koyuldu. Bu sırada birisi geldi ve: \"Ey imran, yetiş bineğin kaçıp gitti\" dedi. Keşke oradan kalkıp ayrılmasaydım.\" Tekrar: 4365, 4386, 7418 Diğer tahric eden: (Tirmizi Menakib)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3191,
			"arabicnumber": 3191,
			"text": "İmran İbn Husayn'ın şöyle dediği nakledilmiştir: \"Resul-i Ekrem Sallallahu Aleyhi ve Sellem'in yanına uğramıştım. Devemi kapıya bağlayıp girdim. Bu sırada Temim oğullarından bir grup Resulullah Sallallahu Aleyhi ve Sellem'in huzuruna geldi. Nebi Sallallahu Aleyhi ve Sellem onlara: \"Ey Temim oğulları, müjdeyi kabul edin!\" dedi. Onlar da iki kez: \"Sen bize müjde vermiştin. Haydi bize vereceğini ver!\" dediler. Sonra Nebi Sallallahu Aleyhi ve Sellem'in huzuruna Yemenliler geldi. Nebiimiz Sallallahu Aleyhi ve Sellem onlara da: \"Ey Yemenliler, müjdeyi kabul edin! Temim oğullarını sorarsanız onlar verdiğim müjdeyi kabul etmedi\" dedi. Yemenliler: \"Tamam, ey Allah'ın Resulü kabul ettik\" dediler ve eklediler: \"Biz, yeryüzünün yaratılışı ve arş hakkında bazı sorular sormaya gelmiştik. \" Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Allah vardı ve O'ndan başka hiçbir şey yoktu. O'nun arşı da suyun üzerinde idi. Allah Teala, Zikir'de (levh-i mahfuz) olacak her şeyi yazdı (takdir etti). Gökleri ve yeri yarattı.\" Bu sırada birisi: \"Ey Husayn oğlu, deven kaçıp gitmiş. Ben de çıktım ve devemin bir su başında kaldığını gördüm. Vallahi, (Resulullah Sallallahu Aleyhi ve Sellem'in meclisini terk etmektense) onu orada öylece bırakıp gitmeyi isterdim",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3192,
			"arabicnumber": 3192,
			"text": "Ömer radiyallahu anh'in şöyle dediği nakledilmiştir: \"Resulullah Sallallahu Aleyhi ve Sellem bir gün ayağa kalkıp bize hitap etti ve yaratılışın başlangıcından başlamak suretiyle cennetliklerin cennete, cehennemliklerin de cehennem'e girecekleri an'a kadar olacakları anlattı. Bu anlatılanları ezberleyen ezberledi; unutan ise unuttu",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3193,
			"arabicnumber": 3193,
			"text": "Ebu Hureyre r.a.'in naklettiğine göre Nebi Sallallahu Aleyhi ve Sellem Allah Teala'nın şöyle buyurduğunu söylemiştir: \"İnsanoğlu asla yapmaması gerektiği halde beni şanıma yakışmayan sıfatlarla anıyor (şetm ediyor) ve yine asla yapmaması gerektiği halde beni yalanlıyor (tekzib ediyor). Onun beni şanıma yakışmayan sıfatlarla anması benim bir çocuğum olduğunu iddia etmesidir; beni yalanlaması ise \"Allah beni ilk olarak yarattığı gibi tekrar yaratıp diriitemez\" demesidir. \" Tekrar: 4975, 9474",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3194,
			"arabicnumber": 3194,
			"text": "Ebu Hureyre r.a.'in naklettiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Allah Teala mahlukatı yaratmayı dilediğinde kendi katında, arşının üzerinde bulunan kitabına şunu yazdı: \"Benim rahmetim gazabımı geçmiştir. \" Tekrar: 7404, 7412, 7453, 7553, 7554. 3190, 3191, 3192, 3193 ve 3194 için:",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 3195,
			"arabicnumber": 3195,
			"text": "Bir arazi dolayısıyla bazı kimselerle anlaşmazlık yaşayan Ebu Seleme İbn Abdurrahman Hz. Aişe'ye gitmiş ve yaşananları ona anlatmıştı. Hz. Aişe ona şunları söyledi: \"Ebu Seleme, gel bu toprak parçasından vazgeç. Zira Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Kim haksızlık ederek, zulüm ile bir karış toprağı ele geçirse, yedi kat yer onun boynuna dolanır",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3196,
			"arabicnumber": 3196,
			"text": "Salim'in babası (İbn-i Ömer r.a.)dan naklettiğine göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Kim haksızlık ederek, zulüm ile çok küçük bir toprak parçasına el koysa, kıyamet gününde bu yüzden yedi kat yerin dibine geçirilir",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3197,
			"arabicnumber": 3197,
			"text": "Ebu Bekre r.a.'in naklettiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Zaman, Allah'ın gökleri ve yeri yarattığı günden bu yana hiç değişmeden, aynı şekilde sürüp gitmektedir. Bir yıl on iki aydır. Bunlardan dördü haram aylardır. Haram aylardan Zilkade, Zilhicce ve Muharrem peşpeşe gelir, Mudar kabilesinin (ayrı bir önem verdiği) Receb ise Cümade'l-Ahir ile Şa'ban arasındadır",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3198,
			"arabicnumber": 3198,
			"text": "Hişam bin Urve'nin babası Urve İbnü'z-Zübeyr'den naklettiğine göre Said İbn Zeyd İbn Amr İbn Nufeyl'in başından şöyle bir olay geçmiştir: \"Erva binti Ebı Uveys, Mervan'a müracaat ederek Said İbn Zeyd aleyhine dava açmıştı. Erva, kendi hakkı olan bir arazi parçasının bir kısmına Said İbn Zeyd'in el koyduğunu iddia ediyordu. Said İbn Zeyd bu dava üzerine şöyle demişti: \"Ben mi onun hakkı olan bir arazi parçasına el koymuşum!? Bu olacak iş değildir! Şehadet ederim ki, ben Resulullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu işittim: \"Kim haksızlık ederek, zulüm ile bir karış toprak parçasına el koyarsa, şüphesiz bunun yüzünden kıyamet gününde yedi kat yer boynuna dolanır!\" Bu rivayetin Said İbn Zeyd r.a.'den şu şekilde de gelmiştir: \"Ben Nebi Sallallahu Aleyhi ve Sellem huzuruna vardırn ... \" demiştir",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3199,
			"arabicnumber": 3199,
			"text": "Ebu Zer'den nakledilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem bir gün bana güneş batınca: \"Güneşin nereye gittiğini biliyor musun?\" diye sordu. Ben: \"Allah ve Resulü daha iyi bilir!\" diye karşılık verince şöyle buyurdu: \"Güneş arşın altında secdeye varıncaya kadar gider ve (tekrar doğmak için) izin ister. Kendisine bu izin verilir. Fakat secde için gittiği halde secdesinin kabul edilmemesi ve izin istediği halde kendisine müsaade edilmeyip 'Haydi geldiğin yere geri dön!\" denmesi pek yakındır. Güneş o gün battığı yerden doğacaktır. İşte bu, \"Güneş de, kendisi için (tesbit edilmiş) olan bir müstakarra (sona) doğru akıp-gitmektedir. Bu, aziz ve alim oLan Allah'ın kanunudur. \"[Yasin, 38] ayetinde anlatılan durumdur. \" Tekrar: 4802, 4803, 7424, 7433 Mahir: Güneş ve Ay; dünyanın etrafında dönerler. Bu kesindir. Dünyanın güneşin etrafında döndüğünü iddia etmek akla aykırıdır. Zira milyon kez dünyadan büyük olan güneş, eğer kütle çekimi ile Dünyayı yörüngesinde tutuyorsa hiç kış olmaz, yazın da dünya güneş’e çarpardı. Diğer gezegenlerin dünyayı tutması diye bir iddia ise akla ziyandır. Güneş, Ay ve dahi tüm kainat Arş’ın altındadır. Güneş’in bilmediğimiz ve görmediğimiz bir şekilde secdesi Allah-u A’lem günde bir yani bir tam tur da birdir. Kur’an anlattığı mes’eleleri hem o günün insanları, hem de bu günün insanları için açıklar. O günün insanlarının bizim bu gün gördüğümüz şeyleri tam olarak anlamamış olmaları garip değildir",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3200,
			"arabicnumber": 3200,
			"text": "Ebu Hureyre r.a.'den nakledildiğine göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Güneş ve ay kıyamet gününde dürülüp katlanacaktır",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3201,
			"arabicnumber": 3201,
			"text": "Abdullah İbn Ömer Nebi Sallallahu Aleyhi ve Sellem'den haber vererek onun şöyle buyurduğunu nakletmiştir: \"Güneş ve ay hiç kimsenin ne ölümü ne de hayatı dolayısıyla tutulur. Fakat bunlar Allah'ın birer ayetidir. Siz güneşin ve ay'ın tutulduğunu görürseniz namaz kılın",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3202,
			"arabicnumber": 3202,
			"text": "Abdullah İbn Abbas r.a.'dan nakledildiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Güneş ve ay Allah'ın birer ayetidir. Bunlar ne bir kimsenin ölümü ne de hayatı dolayısıyla tutulur. Eğer güneş ve ay'ın tutulduğunu görürseniz Allah'ı zikredin",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3203,
			"arabicnumber": 3203,
			"text": "Mu'minlerin annesi Aişe r.anha'nın şöyle dediği nakledilmiştir: \"Resulullah Sallallahu Aleyhi ve Sellem güneşin tutulduğu gün namaz kılmak üzere kalktı ve tekbir getirip namaza başladı. Uzun bir kıraattan sonra rüku'ya vardı ve uzun bir süre rüku.da bekledikten sonra سمع الله لمن حمده semi' allahu limen hamideh deyip doğruldu. Kıyamda ilk kıraati kadar olmasa da uzun bir süre Kur'an okudu. Sonra yeniden rüku'ya vardı. Rüku'da yine uzun bir müddet bekledi; fakat bu rüku. birinci rüku. kadar uzun değildi. Sonda secdeye gitti ve uzun bir secde yaptı. Son rekatı da tıpkı birinci rekat gibi kıldı. Namazı bitirip selam verdiğinde güneş de açılmıştı. Resul-i Ekrem sallallahu aleyhi ve sellem namaz bittikten sonra kalktı ve güneş ile ayın tutulması hakkında şöyle buyurdu: \"Güneş ve ay Allah'ın birer ayetidir. Bunlar ne bir kimsenin ölümü ne de hayatı yüzünden tutulurlar. Eğer ay ve güneşin tutulduğunu görürseniz derhal namaz kılmaya koşun",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3204,
			"arabicnumber": 3204,
			"text": "Abdullah İbn Mes'ud'dan nakledildiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Güneş ve ay ne bir kimsenin ölümü ne de hayatı yüzünden tutulurlar. Bunlar Allah'ın birer ayetidir. Eğer ay ve güneşin tutulduğunu görürseniz namaz kılın",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3205,
			"arabicnumber": 3205,
			"text": "O'DUR Kİ, RAHMETİ OLAN (YAĞMURUN) ÖNÜNDEN MÜJDECİ OLARAK FARKLI YÖNLERDEN RÜZGARLAR GÖNDERİR.\" AYETİ",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 3206,
			"arabicnumber": 3206,
			"text": "قاصفا.kelimesi her şeyi kökünden söküp atan demektir. ملاقح kelimesi ile eş anlamlı olan لواقح kelimesi aşılayan, aşılayıcı ملقحة anlamına gelir. إعصار kelimesi adeta içinde ateş yanan bir sütun görüntüsüde olan ve yeryüzünden gökyüzüne doğru şiddetle esen rüzgar anlamındadır. صر kelimesi soğuk anlamı-na gelir. متفرقة ise farklı yönlerden / birbirinden ayrı () anlamındadır",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 3207,
			"arabicnumber": 3207,
			"text": "Malik İbn Sa'sa'a r.a.'dan nakledildiğine göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Ben Beytullah'ta uyku ile uyanıklık arası bir halde iken hikmet ve iman ile dolu altın bir kadeh bana sunuldu. Göğsüm karnıma kadar yarıldı ve içim zemzem suyu ile yıkandı. Sonra da hikmet ve iman ile dolduruldu. Daha sonra bana Burak denilen ve katırdan küçük fakat Eşekten büyük bir binek getirildi. Ben Cebrail ile birlikte en alt tabakadaki sema katına vardım. Orada: 'Gelen kimdir?' diye sorulunca, Cebrail: 'Gelen Cebrail!' diye karşılık verdi. 'Yanındaki kimdir?' diye soruldu. Cebrail: 'Muhammed' deyince, 'O, Nebi olarak gönderildi!, denildi. Cebrail: 'Evet' karşılığını verince: 'Hoş gelmiş, merhaba ona! Ne güzel, ne iyi bir geliş bu!' denildi. Ben bu konuşmanın ardından Hz. Adem'in yanına varıp kendisine selam verdim. O da bana: 'Oğul ve Nebi, merhaba!' dedi. Sonra ikinci sema katına geldik. Orada: 'Gelen kimdir?' diye sorulunca, Cebrail: 'Gelen Cebrail!' diye karşılık verdi. 'Yanındaki kimdir?' diye soruldu. Cebrail: 'Muhammed' deyince, 'O, Nebi olarak gönderildi!' denildi. Cebrail: 'Evet' karşılığını verince: 'Hoş gelmiş, merhaba ona! Ne güzel, ne iyi bir geliş bu!' denildi. Ben de İsa ve Yahya Nebilerin yanına gittim. Bana: 'Kardeş Nebi merhaba sana!' dediler. Sonra üçüncü kat semaya çıktık. Orada: 'Gelen kimdir?' diye sorulunca, Cebrail: 'Gelen Cebrail!' diye karşılık verdi. 'Yanındaki kimdir?' .. ,diye soruldu. Cebrail: 'Muhammed' deyince, 'O, Nebi olarak gönderildi!' 'denildi. Cebrail: 'Evet' karşılığını verince: 'Hoş gelmiş, merhaba ona! Ne güzel, ne iyi bir geliş bu!' denildi. Orada Yusuf Nebiin yanına gidip kendisine selam verdim Bana: 'Kardeş Nebi merhaba sana!' dedi. Sonra dördüncü kat semaya çıktık. Orada: 'Gelen kimdir?' diye sorulunca, Cebrail: 'Gelen Cebrail!' diye karşılık verdi. 'Yanındaki kimdir?' diye soruldu. Cebrail: 'Muhammed' deyince, 'O, Nebi olarak gönderildi!' denildi. Cebrail: 'Evet' karşılığını verince: 'Hoş gelmiş, merhaba ona! Ne güzel, ne iyi bir geliş bu!' denildi. Orada İdris Nebiin yanına gidip kendisine selam verdim. Bana: 'Kardeş Nebi merhaba sana!' dedi. Sonra beşinci kat semaya çıktık. Orada: 'Gelen kimdir?' diye sorulunca, Cebrail: 'Gelen Cebrail!' diye karşılık verdi. 'Yanındaki kimdir?' diye soruldu. Cebrail: 'Muhammed' deyince, 'O, Nebi olarak gönderildi!' denildi. Cebrail: 'Evet' karşılığını verince: ''Hoş gelmiş, merhaba ona! Ne güzel, ne iyi bir geliş bu!' denildi. Orada Harun Nebiin yanına varıp kendisine selam verdim. Bana: 'Kardeş Nebi merhaba sana!' dedi. Sonra altıncı kat semaya çıktık. Orada: 'Gelen kimdir?' diye sorulunca, Cebrail: 'Gelen Cebrail!' diye karşılık verdi. 'Yanındaki kimdir?' diye soruldu. Cebrail: 'Muhammed' deyince, 'O, Nebi olarak gönderildi!' denildi. Cebrail: 'Evet' karşılığını verince: 'Hoş gelmiş, merhaba ona! Ne güzel, ne iyi bir geliş bu!' denildi. Orada Musa Nebiin yanına gidip kendisine selam verdim. Bana: 'Kardeş Nebi merhaba sana!' dedi. Ben oradan ayrılınca Musa Nebi ağlamaya başladı. Kendisine: 'Sen niçin ağlarsın?' diye sorulunca şöyle cevap verdi: 'Ey Rabbim, Benden sonra Nebi olarak gönderilen bu yiğit delikanlının ümmetinden cennete girecekler, benim ümmetimden cennete gireceklere göre daha üstün / fazla olacak!' Sonra yedinci kat semaya çıktık. Orada: 'Gelen kimdir?' diye sorulunca, Cebrail: 'Gelen Cebrail!' diye karşılık verdi. 'Yanındaki kimdir?' diye soruldu. Cebrail: 'Muhammed' deyince, 'O, Nebi olarak gönderildi! Hoş gelmiş, merhaba ona! Ne güzel, ne iyi bir geliş bu!' denildi. Orada İbrahim Nebiin yanına gidip kendisine selam verdim. Bana: 'Oğul Nebi merhaba sana!' dedi. Ardından bana Beyt-i ma'mur yaklaştırılıp gösterildi. Ben Cebrail'e bunun ne olduğunu sorunca bana şöyle cevap verdi: 'Bu Beyt-i ma'mur'dur. Burada her gün yetmiş bin melek namaz kılar ve oradan çıktıktan sonra bir daha kendilerine sıra gelmez!' Bundan sonra önüme Sidretü'l-münteha (en uçtaki ağaç) açıldı ve bana yaklaştırıldı. Bu ağacın meyveleri Hecey kullelerine, yaprakları ise fillerin kulaklarına benziyordu. Sidretü'l-münteha'nın kökünden ikisi gizli, ikisi açık dört nehir kaynıyordu. Cebrail'e bu nehirleri sorduğumda bana şöyle dedi: 'Gizli olan nehirler cennettedir. Açıktan akan iki nehir ise Nil ve Fırat'tır.' Sonra bana elli vakit namaz farz kılındı ve geri döndüm. Musa Nebi'in yanına vardığımda bana: 'Ne oldu, neler yaptın?' diye sordu. Ben: 'Bana elli vakit namaz farz kılındı' deyince, 'Ben insanları senden daha iyi tanırım. İsrail oğulları ile az mı uğraştım! Senin ümmetin bu kadar namazı kılamaz, buna güçleri yetmez. Rabbine dön ve (bu yükümlülüğü azaltmasını) iste!' Bunun üzerine dönüp Rabbimden istekte bulundum ve kırk vakit namaz kılınmasını emretti. Sonra dönüş yolunda yine Musa Nebi aynı şeyleri söyledi ve namaz, otuz vakte indi, ardından yine aynı şeyler oldu ve on vakte indi. Sonra yine Musa Nebiin yanına vardım ve bana aynı şeyleri söyledi. Bunun üzerine Allah Teala namaz vakitlerini beşe indirdi. Dönerken yine Musa Nebie geldim. Bana: 'Ne oldu, neler yaptın?' diye sorunca: 'Allah beş vakit namazı farz kıldı!' dedim. Fakat Musa Nebi yine aynı şeyleri söyledi. Ben de: 'Artık tamam, ben bunu hayırla kabul ettim!' dedim. Sonra Allah tarafından: 'Ben beş vakit olarak namazı farz kıldım ve kullarıma kolaylık gösterdim, onların yükünü azalttım. Bununla birlikte her bir iyiliğe karşılık on kat mükafat vereceğim!' diye nida edildi.\" Ebu Hureyre bu hadisi: \" ... Beyt-i ma'mur'da iken ... \"şeklinde nakletmiştir. Tekrar: 3393, 3430, 3887",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 3208,
			"arabicnumber": 3208,
			"text": "Abdullah İbn Mes'ud şöyle demiştir: \"Hem doğru hem de doğruluğu tasdik edilmiş olan Resulullah Sallallahu Aleyhi ve Sellem bize şunları anlattı: \"Her birinizin annesinin karnında yaratılışının ilk safhada toparlanması kırk gün sürer. Sonra kırk gün alaka ve bunun ardından yine kırk gün mudğa dönemi olur. Sonra Allah Teala dört hususu yazmakla görevli bir melek gönderir. Bu meleğe şunlar emredilir: 'Bu çocuğun amelini, rızkını, bedbahtlardan (şaki) mı yoksa bahtiyarlardan (said) mı olacağını yaz!' Sonra anne karnındaki bu cenine ruh üfürülür. İçinizden bazıları, öyle iyi ameller işler ki cennet ile aralarında bir zira mesafe kalır. Fakat haklarındaki bu yazı öne geçer ve cehennemliklerin amelini işlerler. Kiminiz de, öyle kötü ameller işler ki cehennem ile aralarında bir zira mesafe kalır. Fakat haklarındaki bu yazı öne geçer ve cennetliklerin amelini işlerler. \" Tekrar: 3332. 6594, 7454",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 3209,
			"arabicnumber": 3209,
			"text": "Ebu Hureyre r.a.'den nakledildiğine göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Allah bir kulunu sevdiği zaman Cebrail'e şöyle seslenir: 'Allah, falan kişiyi seviyor sen de sev!' Bunun üzerine Cebrail. o kul'u sever ve gök ehline: 'Allah, falan kişiyi seviyor siz de sevin!' diye nida eder. Gökte bulunanlar da o kul'u severler ve daha sonra yeryüzünde bu kul'a karşı sevgi duyulur ve bu kişi itibar sahibi olur. \" Tekrar: 6040, 7485 Diğer tahric: Tirmizi Tefsirul Kur’an; Müslim, Birr ve Sıla",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 3210,
			"arabicnumber": 3210,
			"text": "Aişe (radiyallahu anha)’dan nakledilmiştir: \"Resulullah (Sallallahu Aleyhi ve Sellem)’in şunları söylediğini işittim: \"Melekler bulut içerisinde inerler ve gökte olacağı yazılan hususları konuşurlar. Şeytanlar da bu konuşulanları duymak için sinsi sinsi hareket ederler. Kimisi duyar ve duyduklarını kahinlere fısıldar. Bu sırada da söylediklerine kendi uydurdukları yüz yalan daha katarlar. \" Tekrarı: 3288, 5762, 6213, 7561",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 3211,
			"arabicnumber": 3211,
			"text": "Ebu Hureyre r.a.'den nakledildiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Cuma günü olduğunda melekler mesciddeki kapıların her birine dizilir ve ilk olarak gelenlerden itibaren sırayla gelen cemaati yazarlar. İmam oturduğunda melekler kayıtları tuttukları defterleri kaldırırlar ve okunan zikri dinlemeye gelirler",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 3212,
			"arabicnumber": 3212,
			"text": "Said İbnü'l-Müseyyeb'in şöyle dediği nakledilmiştir: \"Hassan İbn Sabit şiir okurken Ömer mescide girdi. Hassan ona: 'Senden daha hayırlı olan - Nebi Sallallahu Aleyhi ve Sellem - mescidde iken bile ben burada şiir okuyordum, deyip Ebu Hureyre'ye döndü ve: 'Allah için söyle, Resulullah Sallallahu Aleyhi ve Sellem'in bana: 'Benim adıma cevap ver! Allahım, onu Ruhu'l-Kudüs ile destekle!' dediğini işittin mi?' diye sordu. Ebu Hureyre de: 'Evet işittim' dedi",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 3213,
			"arabicnumber": 3213,
			"text": "Bera' İbn A'zib'den nakledildiğine göre Resulullah Sallallahu Aleyhi ve Sellem, Hassan İbn Sabit'e: \"Onların hicivlerine karşılık ver! Cebrail senin yanında!\" demiştir. Tekrar: 4123, 4124. 6153",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 3214,
			"arabicnumber": 3214,
			"text": "Enes bin Malik r.a.'in şöyle dediği nakledilmiştir: \"Ganm oğulları sokağından kalkan toz hala gözlerimin önünde!\" Musa İbn İsmail bu rivayeti şu ek bilgiyle nakletmiştir: \"Cebrail'in gezdiği o yerleri (hala görür gibiyim)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 3215,
			"arabicnumber": 3215,
			"text": "Aişe r.anha'dan nakledildiğine göre bir gün Haris İbn Hişam Resulullah Sallallahu Aleyhi ve Sellem'e: \"Size vahiy nasıl geliyor?\" diye sormuş, Nebi Sallallahu Aleyhi ve Sellem de şu cevabı vermiştir: \"Melek kimi zaman bana tıpkı metal bir maden parçasının çınlaması şeklinde vahiy getirir. Bu çınlama kesildiğinde ben onun söylediklerini anlamış olurum. Bazen de melek bana bir insan şeklinde gelir ve benimle konuşur. Ben de onun söylediklerini kavrarım",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 3216,
			"arabicnumber": 3216,
			"text": "Ebu Hureyre r.a.'den nakledildiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Kim Allah yolunda bir çift malını infak ederse cennetteki sorumlu melekler ona: 'Ey falanca, gel buraya!' derler.\" Bunun üzerine Ebu Bekir r.a.: 'Öyleyse bu kişi için asla yok olma söz konusu değil!' dedi. Resulullah Sallallahu Aleyhi ve Sellem ise ona: 'Umarım sen böylelerinden olursun!' diye karşılık verdi",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 3217,
			"arabicnumber": 3217,
			"text": "Hz. Aişe'nin şöyle dediği nakledilmiştir:\"Bir gün Resulullah Sallallahu Aleyhi ve Sellem bana: 'Ey Aişe, işte Cebrail عليك السلام sana selam söylüyor' buyurdu. Ben de: \" وعليه السلام ورحمة الله وبركاته Allah'ın selamı, rahmeti ve bereketi onun da üzerine olsun! Sen benim göremediğimi görüyorsun!\" dedim.\" Tekrar: 3768, 6201, 6249 Diğer tahric edenler: Tirmizi Edeb, Müslim, Fedailü-üs Sahabe",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 3218,
			"arabicnumber": 3218,
			"text": "Abdullah İbn Abbas r.a.'dan nakledildiğine göre Resulullah Sallallahu Aleyhi ve Sellem Cebrail'e: \"Bizi daha sık ziyaret etseniz keşke?\" dedi ve bu talep üzerine \"Rabbinin emri olmadıkça biz (meleklerden olan elçiler) inmeyiz. Geçmişimizi, geleceğimizi ve ikisinin arasındakileri bilmek O'na mahsustur. \"[Meryem, 64] ayeti nazil oldu.\" Tekrar: 4731, 7455",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 3219,
			"arabicnumber": 3219,
			"text": "Abdullah İbn Abbas r.a.'dan nakledildiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Cebrail, (Kur'an'ı) bana bir harf üzere okuttu. Fakat ben bunu artırmasını talep ettim ve nihayet yedi harfe kadar çıkıp orada kaldı. \" Tekrar: 4991",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 3220,
			"arabicnumber": 3220,
			"text": "Abdullah İbn Abbas r.a.'in şöyle dediği nakledilmiştir: \"Resul-i Ekrem Sallallahu Aleyhi ve Sellem insanların en cömerdi idi. Hele Ramazan girip Cebrail (A.S.) ile buluştuğunda daha da cömert olurdu. Cebrail (A.S.), Ramazan ayında her gece Nebi Sallallahu Aleyhi ve Sellem ile buluşurdu ve onunla birlikte Kur'an'ı mütalaa ederdi ......... İşte Cebrail (A.S.), Resul-i Ekrem Sallallahu Aleyhi ve Sellem ile buluştuğu zaman Nebi Sallallahu Aleyhi ve Sellem rüzgarlar gibi cömert olurdu.\" Ebu. Hureyre ve Hz. Fatıma bu hadisteki bir bölümü şöyle rivayet etmişlerdir: \"Cebraiı, onunla birlikte Kur'an'ı karşılaştırmalı olarak okurdu",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 3221,
			"arabicnumber": 3221,
			"text": "İbn Şihab'dan nakledildiğine göre Ömer İbn Abdülaziz bir defasında ikindi namazını biraz geciktirmişti. Urve ona şöyIe dedi: \"Fakat Cebrail inip Resulullah Sallallahu Aleyhi ve Sellem'in önünde namaz kıldırmıştı.\" Bunun üzerine Ömer İbn AbdüIaziz: \"Urve, söyledikIerini kanıtla!\" dedi. O da: \"Ben, Beşir İbn Ebi Mes'ud'dan duydum. Onun Ebu Mes'ud'dan duyduğuna göre Ebu Mes'ud Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu işitmiştir: \"Cebrail indi ve bana imamlık yaptı. Ben onunla birlikte namaz kıldım. Sonra bir daha, sonra bir daha, sonra bir daha ve sonra bir daha onunla birlikte namaz kıldım.\" Resulullah Sallallahu Aleyhi ve Sellem bu sırada beş defa namaz kıldığını parmaklarıyla saymıştır",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 3222,
			"arabicnumber": 3222,
			"text": "Ebu Zer'den nakledildiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Cebrail bana, 'Senin ümmetinden Allah'a hiçbir şeyi şirk koşmaksızın ölenler cennete girecektir veya cehenneme girmeyecektir' dedi.\" Ben: \"Zina etse ve hırsızlık yapsa bile, öyle mi?!\" deyince Nebi Sallallahu Aleyhi ve Sellem: \"Evet!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 3223,
			"arabicnumber": 3223,
			"text": "Ebu Hureyre r.a.'den nakledildiğine göre Resul-i Ekrem Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Melekler nöbetleşe birbirlerini takip ederler. Bunların kimisi gece melekleri kimisi de gündüz melekleridir. Fakat bu melekler sabah namazı ile ikindi namazında bir araya gelirler. Sonra sizinle birlikte bulunan melekler göğe yükselir. Allah Teala daha iyi bilmesine rağmen onlara: 'Kullarımın yanından ayrıldığınızda ne yapıyorlardı?' diye sorar. Onlar da: 'Biz onların yanından ayrıldığımızda da namaz kılıyorlardı yanlarına vardığımızda da namaz kılıyorlardı' derler",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 3224,
			"arabicnumber": 3224,
			"text": "Aişe r.anha'nın şöyle dediği nakledilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem için bir yastık yapmıştım. Fakat bu yastığın üzerinde resimler vardı. Resulullah Sallallahu Aleyhi ve Sellem kalktı ve insanların arasında durdu. Yüzündeki ifade değişmeye başlamıştı. Ben: 'Ey Allah'ın Resulü, biz ne yaptık ki!?' deyince (yastığı kasdederek): 'Bu da ne böyle?' buyurdu. Ben: 'Üzerine uzanman için yaptığım bir yastık!' diye karşılık verdim. O da şöyle buyurdu: \"Sen bilmez misin, içinde suret / resim bulunan eve melek girmez! Kim böyle suret yaparsa kıyamet günü azab görecek ve kendisine: Haydi yarattığın bu şeye can ver bakalım, denecek",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 3225,
			"arabicnumber": 3225,
			"text": "Abdullah İbn Abbas r.a.'in Ebu Talha'dan dinlediğine göre Ebu Talha, Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu duymuştur: \"Melekler, içinde köpek ve suret / resim bulunan eve girmezler. \" Tekrar: 3322, 4002, 5949, 5958",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 3226,
			"arabicnumber": 3226,
			"text": "Zeyd İbn Halid'in Ebu Talha'dan naklettiğine göre Resul-i Ekrem Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Melekler, içinde suret bulunan eve girmezler.\" Bu hadisin ravilerinden Büsr İbn Said şöyle demiştir: \"Zeyd İbn Halid hastalanmıştı. Biz de onu ziyarete gittik. Fakat evine girdiğimizde gördüğüm resimli örtü karşısında şok oldum. Hemen Ubeydullah el-Havlani'ye: 'Zeyd bize resim konusunda hadis nakletmemiş miydi?' dedim. Ubeydullah: 'O: ' ... kumaşa işlenen nakış dışında, suret bulunan ... ' demişti, sen bunu duymadın mı?' diye karşılık verince ben: 'Hayır, duymadım!' dedim. Bunun üzerine Ubeydullah: 'Sen duymamış olabilirsin fakat bunu söyledi' dedi",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 3227,
			"arabicnumber": 3227,
			"text": "Salim İbn Abdullah İbn Ömer'in naklettiğine göre babası Abdullah İbn Ömer şöyle demiştir: \"Cebrail, Nebi Sallallahu Aleyhi ve Sellem'in yanına geleceğine söz verdiği halde gelmemişti. Resul-i Ekrem Sallallahu Aleyhi ve Sellem sebebini sorunca Cebrail: \"Biz içinde suret / resim ve köpek bulunan eve girmeyiz' dedi",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 3228,
			"arabicnumber": 3228,
			"text": "Ebu Hureyre r.a.'in naklettiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"İmam ‘سمع الله لمن حمده ‘ (Allah kendisine hamd edeni işitir) dediğinde siz : ‘ربنا لك الحمد ‘ (Rabbimiz hamd sana mahsustur) deyin' Zira söylediği bu hamd cümlesi meleklerin hamd etmeleri ile aynı anda olan kimsenin geçmiş günahları bağışlanır",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 3229,
			"arabicnumber": 3229,
			"text": "Ebu Hureyre r.a.'in naklettiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Siz namaz kıldığınız yerden ayrılmadığınız sürece namazdasınız demektir. Melekler böyle bir kimse için yerinden ayrılana veya abdestini bozana kadar: 'Allahım, onu bağışla ve ona merhametinle muamele et' diye dua ederler",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 3230,
			"arabicnumber": 3230,
			"text": "Safvan İbn Ya'la'dan nakledildiğine göre, babası Ya'la İbn Ümeyye r.a. Resul-i Ekrem Sallallahu Aleyhi ve Sellem'in minberde [ez-Zuhruf 77. ayetini ونادوا يا مالك ( \"Cehennem bekçisine şöyle feryad ederler: \" Malik Ne olur, tükendik artık! Rabbin canımızı alsın, bitirsin işimizi!'' O da: \"Ölüp kurtulmak yok, ebedi kalacaksınız burada'' der.\" ....) diye okuduğunu işitmiştir. Süfyan İbn Uyeyne şöyle demiştir: \"Bu ayet Abdullah İbn Mes'ud'un kıraatinde ونادوا يا مال şeklindedir,\" Tekrar: 3266, 4819",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 3231,
			"arabicnumber": 3231,
			"text": "Aişe radiyallahu anha naklediyor: \"Bir gün Resulullah Sallallahu Aleyhi ve Sellem'e: 'Uhud savaşında yaşadıklarından daha kötü ve sıkıntılı günlerin oldu mu hiç?' diye sorduğumda bana şunları anlattı: \"Ne çile çektiysem senin bu kavminden çektim! Onlardan gördüğüm en büyük çile ise Akabe biatında oldu. Ben de sığınma talebiyle (Taif liderlerinden) İbn Abdi Yaleyl İbn Abdi Külal'e gittim. Fakat beni geri çevirdi, isteğimi kabul etmedi. Ben de bütün ümitlerim sönmüş bir şekilde geri döndüm. Karnü's-sealib'e varana kadar da kendime gelemedim. Bu sırada başımı göğe kaldırdığımda beni gölgeleyen bir bulut gördüm. Buluta baktığımda içinde Cebrail'in olduğunu fark ettim. Bana seslenerek şöyle dedi: 'Allah, senin kavminden olanların sana ne söylediklerini ve seni nasıl reddettiklerini işitti. İşte Rabbin sana dağlarla sorumlu meleği gönderdi. Kavmine ne yapılmasını istiyorsan bu meleğe emredebilirsin!' Bu sırada dağlarla sorumlu olan melek bana selam verdikten sonra şöyle dedi: 'Ey Muhammed, bu senin istemene bağlı. İstersen şu iki dağı birleştirip onları arada sıkıştırarak ezebilirim!' Ben ise: 'Hayır, ben Allah'ın onların nesillerinden sadece Allah'a kulluk eden ve O'na hiçbir şeyi ortak koşmayan insanlar çıkarmasını dilerim!' diye karşılık verdim",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 3232,
			"arabicnumber": 3232,
			"text": "Ebu İshak eş-Şeybanı anlatıyor: \"Bir defasında Zir İbn Hubeyş'e \"Sonra yaklaştı ve iyice sarktı. Öyle ki araları yayın iki ucu arası kadar veya daha az kaldı. O da kuluna vahyetmek istediği her şeyi vahyetti\" [Necm 8-10] ayetlerini sordum. Bana Abdullah İbn Mes'ud'un şu sözlerini aktardı: \"Nebi Sallallahu Aleyhi ve Sellem, Cebrail'i altı yüz kanadıyla gördü.\" Tekrar: 4856, 4857",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 3233,
			"arabicnumber": 3233,
			"text": "Abdullah İbn Mes'ud'un, \"Vallahi gördü, hem de Rabbinin ayetlerinden en büyüğünü gördü!\" ayetiyle ilgili olarak: \"Resulullah Sallallahu Aleyhi ve Sellem göğün ufkunu kaplayan yeşil bir رفرفا Refref gördü\" dediği nakledilmiştir. Diğer tahric: Tirmizi Tefsirul Kur’an; Müslim, İman",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 3234,
			"arabicnumber": 3234,
			"text": "Aişe radiyallahu anha'nın şöyle dediği nakledilmiştir: \"Kim Muhammed'in, Rabbini gördüğünü ileri sürüyorsa şüphesiz çok aşırı bir düşünceye saplanmıştır. Ancak Resulullah Sallallahu Aleyhi ve Sellem, Cebrail'i bütün bir ufku kaplamış şekilde kendi aslı suretinde ve yaratılışında görmüştür.\" Tekrar: 4612, 4855, 7380, 7531",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 3235,
			"arabicnumber": 3235,
			"text": "Şa'bi'den nakledildiğine göre Mesruk, Hz. Aişe'ye: \"Peki \"Sonra yaklaştı ve iyice sarktı. Öyle ki araları yayın iki ucu arası kadar veya daha az kaldı\" [Necm 8-10] ayetleri hakkında ne diyeceksiniz?\" diye sormuş, Hz. Aişe de şu cevabı vermiştir: \"O Cebrail idi. Cebrail, Nebi Sallallahu Aleyhi ve Sellem'e insan şeklinde gelirdi. Fakat bu sefer gerçek şeklinde göründü ve bütün bir ufku kapladı",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 3236,
			"arabicnumber": 3236,
			"text": "Semure'den nakledildiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Bu gece yanıma iki kişi gelip şöyle dediler: \"Ateşi yakan melek, cehennem'den sorumlu olan Malik'tir. Ben Cebrail'im, bu ise Mikail'dir",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 3237,
			"arabicnumber": 3237,
			"text": "Ebu Hureyre r.a.'den nakledildiğine göre Resul-i Ekrem Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Bir kimse karısını yatağına çağırdığı halde kadın buna yanaşmazsa ve kocası da bu yüzden ona kızgın olarak yatarsa, melekler sabaha kadar o kadına la'net ederler. \" Tekrar: 5193, 5194",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 3238,
			"arabicnumber": 3238,
			"text": "Cabir İbn Abdullah r.a. Resulullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu işitmiştir: \"Sonra bir süre bana vahiy gelmesi kesildi (fetret). Fakat bir gün ben yürürken gökten bir ses işittim. Bakışlarımı gökyüzüne çevirdiğimde Hira mağarasında bana gelen meleği gördüm; gök ile yeryüzü arasını kuşatan bir taht (kürsi) üzerine kurulmuştu. Ondan öylesine korkmuştum ki yere düştüm. Sonra ailemin yanına geldim ve: 'Beni örtün, beni örtün!' dedim. İşte Allah Teala \"Ey örtüye bürünen! Ayağa kalk ve insanları uyar! Rabbinin büyüklüğünü an! Elbiseni tertemiz tut, maddı manevi kirlerden arın, Pis ve murdar olan her şeyden kaçın!\" [Müddessir 1-5] ayetlerini bu sırada vahyetti.\" Ebu Seleme: \"Burada geçen الرجز (er-rucz) kelimesi putlar anlamına gelir' demiştir",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 3239,
			"arabicnumber": 3239,
			"text": "Abdullah İbn Abbas r.a.'dan nakledildiğine göre Resul-i Ekrem Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Gece yolculuğuna çıkarıldığım İsra gecesi Musa Nebiyi gördüm. Esmer, uzun boylu ve topluca bir adamdı. Bu özellikleriyle tıpkı Şenue kabilesine mensup insanlara benziyordu. İsa Nebii de gördüm. Orta boylu idi ve kızıl ile beyaz arası bir ten rengi vardı. Saçları da düz ve uzundu. O gece cehennemin bekçisi Malik'i ve Allah'ın bana gösterdiği özellikleriyle Deccal'i de gördüm. Onunla bir gün muhakkak karşı karşıya geleceğin konusunda asla kuşkuya kapılma!\" Enes İbn Malik ile Ebu Bekre, Nebi Sallallahu Aleyhi ve Sellem'in: \"Melekler Medine'yi Deccal'den koruyacaklardır\" buyurduğunu nakletmişlerdir",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 3240,
			"arabicnumber": 3240,
			"text": "Abdullah İbn Ömer r.a.'den nakledildiğine göre Resul-i Ekrem Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Sizden birisi öldüğü zaman sabah ve akşam vakitlerinde gideceği yer kendisine gösterilir. Eğer cennetliklerden ise cennetliklerin yeri, yok cehennemliklerden ise cehennemliklerin yeri gösterilir",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 3241,
			"arabicnumber": 3241,
			"text": "İmran İbn Husayn r.a.'ın naklettiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Ben cenneti gördüm ve oradakilerin çoğunun fakirler olduğunu fark ettim. Cehennemi de gördüm ve oradakilerin çoğunun kadınlar olduğunu gördüm.\" Tekrar: 5198, 6449, 6546",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 3242,
			"arabicnumber": 3242,
			"text": "Ebu Hureyre r.a. anlatıyor: \"Biz bir defasında Nebi Sallallahu Aleyhi ve Sellem'in yanında iken bize şunları söylemişti: \"Bir gün rüyamda kendimi cennette gördüm. Orada bir köşkün yanı başında duran çok güzel bir kadın vardı 'Bu köşk kime aittir?' diye sorduğumda: 'Ömer İbnü'l-Hattab'ındır' dediler. Ben de onun kıskançlığını bildiğim için hemen geriye döndüm.\" Bunun üzerine Ömer ağladı ve: \"Senden neyi kıskanırım ki, ey Allah'ın Resulü!\" dedi. Tekrar: 3680, 5227, 7023, 7025",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 3243,
			"arabicnumber": 3243,
			"text": "Ebu Bekir İbn Abdullah İbn Kays el-Eş'ari'nin babası Ebu Musa el-Eş'ari r.a.'den naklettiğine göre Resul-i Ekrem Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Cennet çadırlarından her biri göğe doğru otuz mil uzanan yüksekliğe sahip içi boş bir inci tanesi gibidir. Bunun her köşesinde mu'min için bir eş (ehl) bulunur. Onları başkaları göremez.\" Ebu Imran'dan nakledilen rivayette ise: \" ... altmış mil ... \" diye geçmektedir",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 3244,
			"arabicnumber": 3244,
			"text": "Ebu Hureyre r.a.'in naklettiğine göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Allah Teala şöyle buyuruyor: 'Salih kullarım için hiç bir gözün görmediği, hiç bir kulağın işitmediği ve hiç bir insanın aklına hayaline gelmeyecek nimetler hazırladım.' Bu müjdenin doğruluğunu görmek için isterseniz 'İşte onların dünyada yaptıkları makbul işlere mükafat olarak gözlerini aydın edecek, gönüllerini ferahlatacak hangi sürprizlerin, hangi nimetlerin saklandığını hiç kimse bilemez'[Secde 17] ayetini okuyun. \" Tekrar: 4779, 4780, 7498",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 3245,
			"arabicnumber": 3245,
			"text": "Ebu Hureyre r.a.'den nakledildiğine göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Cennete ilk olarak girecek grupta bulunacak kimselerin yüzleri gece vakti parlayan dolunaydan farksız olacak. Bu kimselerin tükürme, sümkürme ve dışkı yapma ihtiyaçları olmayacak. Onların cennetteki kapları altındandır; tarakları altın ve gümüştendir; buhurdanlarına konulan koku öd ağacındandır; terleri misktir. Bunların her birine iki eş verilecektir. Bu eşler öylesine güzel ve şeffaftır ki, vücutlarındaki etin ötesinden kemiklerinin ilikleri görünür. Onlar arasında hiçbir anlaşmazlık, çekişme ve kin olmaz; kalpleri tek bir kalptir. Sabah ve akşam daima Allah'ı tesbih ederler.\" Diğer tahric: Tirmizi Cennet; Müslim, Cennet",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 3246,
			"arabicnumber": 3246,
			"text": "Ebu Hureyre r.a.'den nakledildiğine göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Cennete ilk olarak girecek grupta bulunacak kimselerin yüzleri gece vakti parlayan dolunaydan farksız olacak. Onu takip eden grup ise, parlaklık yönüyle en fazla ışık saçan yıldız gibidir. Onların kalpleri adeta tek bir kişinin kalbi gibidir; aralarında hiçbir anlaşmazlık, çekişme ve kin olmaz. Bunların herbirine iki eş verilecektir. Bu eşler öylesine güzel ve şeffaftır ki, vücutlarındaki etin ötesinden kemiklerinin ilikleri görünür. Onlar sabah ve akşam daima Allah'ı tesbih ederler. Hiç bir zaman hastalanmazlar, tükürme ve sümkürme ihtiyaçları olmaz. Onların kapları altından ve gümüştendir; tarakları altındır; buhurdanlarına konulan koku öd ağacındandır; terleri misktir.\" Mücahid şöyle demiştir: [Sabah diye çevirisi yapılan] الإبكار kelimesi fecrin başı (şafağın söktüğü an) anlamına gelir. [Akşam karşılığı verilen] العشي kelimesi ise güneşin tepe noktasından batıya doğru meyletmeye başladıgı andan itibaren akşam güneş batana kadar geçen süre için kullanılır",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 3247,
			"arabicnumber": 3247,
			"text": "Sehl İbn Sa'ad'dan nakledildiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Ümmetimden yetmiş bin - veya yediyüz bin - kişi hep birlikte, aralarında öncelik sonralık olmaksızın cennete girecek. Bunların yüzleri dolunay gecesindeki ay gibi parlar. \" Tekrar: 6543, 6554",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 3248,
			"arabicnumber": 3248,
			"text": "Enes bin Malik r.a.'in şöyle dediği nakledilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem'e ipek bir cübbe hediye edilmişti. Resulullah Sallallahu Aleyhi ve Sellem ipeği daha önce yasaklamıştı. İnsanlar bu ipek cübbeye hayran kalmışlardı. Bunu fark eden Resul-i Ekrem Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Muhammed'in canını elinde bulunduran Allah'a yemin ederim ki Sa'ad İbn Muaz'ın cennetteki mendil/eri bundan daha güzel, daha üstündür. \" Tekrar: 3802, 5836, 6640",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 3249,
			"arabicnumber": 3249,
			"text": "Bera İbn A'zib r.a.'in şöyle dediği nakledilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem'e ipek bir elbise getirildi. İnsanlar onun güzelliğine ve yumuşaklığına hayran kalmışlardı. Bunu fark eden Resul-i Ekrem Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Kesinlikle Sa'ad İbn Muaz'ın cennetteki mendilleri bundan daha üstündür",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 3250,
			"arabicnumber": 3250,
			"text": "Sehl İbn Sa'ad es-Saidi'den nakledildiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Cennetteki bir kırbaçlık yer dünyadan ve dünyada bulunan her şeyden daha hayırlıdır",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 3251,
			"arabicnumber": 3251,
			"text": "Enes İbn Malik r.a.'den nakledildiğine göre Resul-i Ekrem Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Cennette bir ağaç bulunmaktadır. Bineğiyle yolculuk yapan bir kimse bunun gölgesinde yüz yıl مائة عام gitse bile o mesafeyi kat edemez",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 3253,
			"arabicnumber": 3253,
			"text": "",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 3254,
			"arabicnumber": 3254,
			"text": "Ebu Hureyre r.a.'den nakledildiğine göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Cennete ilk olarak girecek grupta bulunacak kimselerin yüzleri gece vakti parlayan dolunaydan farksız olacak. Onu takip eden grup ise, parlaklık yönüyle en fazla ışık saçan, inci gibi ışıldayan yıldıza benzer. Onların kalpleri adeta tek bir kişinin kalbi gibidir; aralarında hiçbir şekilde kin ve hased olmaz. Bunların herbirine iri gözlü hurilerden iki eş verilecektir. Bu güzel eşlerin vücutlarındaki kemiğin ve etin ötesinden adeta ilikleri görünür",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 3255,
			"arabicnumber": 3255,
			"text": "Bera İbn Azib'den nakledildiğine göre Nebi Sallallahu Aleyhi ve Sellem oğlu İbrahim vefat ettiği zaman: \"Cennette onu emzirecek bir süt anne bekliyor!\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 3256,
			"arabicnumber": 3256,
			"text": "Ebu Said el-Hudri'den nakledildiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Cennetlikler, yükseklerdeki özel odalarda kalanları (ehl-i guraf) gözlerini yukarıya dikerek gıptayla seyrederler. Tıpkı, ufukta doğudan veya batıdan geçip giden inci gibi parlak yıldızları seyreder gibi. Aralarındaki derece ve üstünlük farkı dolayısıyla özel oda sahipleri diğer cennetliklerden daha yukarıdadırlar.\" Bunun üzerine sahabeler: \"Ey Allah'ın Resulü! Bu söylediğiniz, Nebiler için ayrılan yerler olmalı! Oraya zaten başkaları ulaşamaz!\" dediler. Nebi Sallallahu Aleyhi ve Sellem ise: \"Aksine! Canımı elinde tutan Allah'a yemin ederim ki, o özel odalarda kalanlar Allah'a iman edip Nebileri tasdik eden kimselerdir!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 3257,
			"arabicnumber": 3257,
			"text": "Sehl İbn Sa'd Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmiştir: \"Cennette sekiz kapı vardır. Bu kapılardan birisinin adı da Reyyan'dır. Bu kapıdan sadece oruçlu olanlar cennete girecektir",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 3258,
			"arabicnumber": 3258,
			"text": "Ebu Zer r.a. anlatıyor: \"Nebi Sallallahu Aleyhi ve Sellem bir yolculuk sırasında: \"Serinliği bekle (أبرد)!\" buyurdu. Bir süre geçtikten sonra yine: \"Serinliği bekle (أبرد)!\" buyurdu. Bu şekilde tepelerin gölgeleri eteklerine düşene kadar vakit geçti. Sonra Resul-i Ekrem Sallallahu Aleyhi ve Sellem: \"Namazı serinlik vaktine kadar erteleyin! Çünkü bu aşırı sıcaklar adeta cehennemin bir yalazıdır",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 3259,
			"arabicnumber": 3259,
			"text": "Ebu Said el-Hudri'nin naklettiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Namazı serinlik vaktine kadar erteleyin! Çünkü bu aşırı sıcaklar adeta cehennemin bir yalazıdır",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 3260,
			"arabicnumber": 3260,
			"text": "Ebu Hureyre r.a.'den nakledildiğine göre Resul-i Ekrem Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Cehennem, Allah'a derdini yanarak: 'Rabbim, kendi kendimi yiyip tüketiyorum! (Beni rahatlatacak bir çare ver!)' dedi. Allah Teala da ona biri yazın diğer kışın olmak üzere rahatlaması için iki defa nefes almasına müsaade etti. İşte yazın hissettiğiniz en yüksek sıcaklık ve kışın hissettiğiniz en düşük soğukluk bu sebepledir",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 3261,
			"arabicnumber": 3261,
			"text": "Ebu Cemre ed-Dubai anlatıyor: \"Mekke'de Abdullah İbn Abbas ile oturuyordum. O sırada beni ateş bastı. Abdullah İbn Abbas bana şöyle dedi: \"Zemzem suyu ile serinlemeye çalış, ateşini düşür! Nitekim Nebi Sallallahu Aleyhi ve Sellem de: 'Bu hararet, adeta cehennemin bir yalazıdır. Hararetlenince su ile veya zemzem suyu ile ateşinizi düşürüp serinlemeye çalışın!' buyurdu,\" Buradaki şekk ravilerden Hemmam'a aittir",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 3262,
			"arabicnumber": 3262,
			"text": "Rafi' İbn Hadic şöyle demiştir: \"Nebi Sallallahu Aleyhi ve Sellem'in: 'Hararet, adeta cehennemin fokurdamasından ileri gelir. Su ile bu harareti giderip serinlemeye çalışın!' buyurduğunu işittim",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 3263,
			"arabicnumber": 3263,
			"text": "Hz. Aişe'nin naklettiğine göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Hararet, adeta cehennem'in bir yalazıdır. Hararetlenince su ile serinlemeye çalışın",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 3264,
			"arabicnumber": 3264,
			"text": "Abdullah İbn Ömer'in naklettiğine göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Hararet, adeta cehennem'in bir yalazıdır. Hararetlenince su ile serinlemeye çalışın",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 3265,
			"arabicnumber": 3265,
			"text": "Ebu Hureyre r.a.'in naklettiğine göre Resulullah Sallallahu Aleyhi ve Sellem: \"Sizin dünyada yararlandığınız bu ateşiniz cehennem ateşinin yetmiş parçasından biridir\" buyurunca orada bulunanlar: \"Ey Allah'ın Resulü, cehennem ateşi sadece bu bir parçadan ibaret olsaydı yine de yeterdi!\" dediler. Resul-i Ekrem Sallallahu Aleyhi ve Sellem onlara şöyle karşılık verdi: \"Fakat cehennem ateşi, dünya ateşlerinden altmış dokuz 'parça daha fazladır ve her bir parçası onun kadar etkilidir.\" Diğer tahric: Tirmizi Cennet; Müslim: Cennet",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 3266,
			"arabicnumber": 3266,
			"text": "Safvan İbn Ya'la'dan nakledildiğine göre, babası Ya'la İbn Ümeyye Resul-i Ekrem Sallallahu Aleyhi ve Sellem'in minberde [ez-Zuhruf 77. ayetini] ونادوا يا مالك diye okuduğunu işitmiştir. (Yani: \"Cehennem bekçisine şöyle feryad ederler: «Malik! Ne olur, tükendik artık! Rabbin canımızı alsın, bitirsin işimizi!» O da: \"Ölüp kurtulmak yok, ebedi kalacaksınız burada\" der)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 3267,
			"arabicnumber": 3267,
			"text": "Ebu Vail anlatıyor: \"Usame, şu kişiyle gidip konuşsanız nasıl olur?!\" diyenlere şöyle cevap vermişti: \"Onunla konuştuğumda konuşulan her şeyi siz de duyacaksınız. Baş başa görüşecek olursak kesinlikle fitne kapısını ilk açan kişi konumuna düşmeme sebep olacak konular üzerine konuşmayacağım. Ayrıca Resulullah Sallallahu Aleyhi ve Sellem'den işittiğim şu sözlerden sonra tutup da birisinin başıma yönetici olması için: \"O insanların en iyisidir!\" diyecek değilim.\" Oradakiler: \"Peki Resulullah Sallallahu Aleyhi ve Sellem'den neler duymuştun?\" deyince, Usame: \"Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu işittim: \"Kıyamet gününde bir adam getirilir ve cehenneme fırlatılır. Ateşte içindeki organları eriyip akar. Bu kişi tıpkı bir dolap beygiri gibi döner durur. Cehennemlikler onun etrafına toplanır ve: \"Hey, sen ne yaptın da bu hallere düştün? Sen bize iyiliği emredip kötülüğü yasaklamaz mıydın?\" diye sorarlar. O da: \"Evet ancak ben size iyiliği emrettiğim halde kendim yapmazdım. Size yasakladığım kötülükleri ise işlerdim\" der.\" Tekrar: 7098",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 3268,
			"arabicnumber": 3268,
			"text": "Hz. Aişe: \"Nebi Sallallahu Aleyhi ve Sellem'e sihir yapıldı\" demiştir. Bu rivayeti nakledenlerden Leys şöyle demiştir: \"Hişam bana bir mektup yazarak bunu Aişe r.anha'dan işitip ezberlediğini bildirdi. Söylediğine göre Hz. Aişe şunları anlatmıştı: Nebi Sallallahu Aleyhi ve Sellem'e sihir yapıldı. Hatta bu yüzden bazen aslında yapmadığı bir şeyi yaptığını zannediyordu. Bir gün dua üstüne dua etti sonra şöyle buyurdu: Ya Aişe, sen de hissettin mi? Allah bana rahatsızlığımı giderecek, şifa bulmamı sağlayacak yolu gösterdi! Yanıma iki kişi geldi. Bunlardan biri baş ucuma diğeri de ayak ucuma oturdu ve konuşmaya başladılar: - Bu zatın hastalığı, rahatsızlığı nedir? - Kendisine sihir yapılmış! - Peki bu büyüyü ona yapan kim? - Lebid İbnü'I-A'sam! - Büyüyü ne ile yapmış peki? - Bir tarak, saç ve sakal tarantısı, erkek hurmanın kurumuş çiçek kapçığı ile! - Büyü yaptığı bu parçalar şimdi nerede? - Zervan kuyusunda! Daha sonra Resulullah Sallallahu Aleyhi ve Sellem O kuyuya gitti ve döndüğünde bana: \"O kuyudan sulanan hurma ağaçlarının uçları adeta şeytanların başlarına benziyor!\" dedi. Ben: \"Kuyudan o büyüyü çıkarıp çözdünüz mü?\" diye sorunca şöyle buyurdu: \"Hayır çıkarmadım. Allah beni bu rahatsızlıktan kurtarıp bana şifa verdi. Ben sihir yapılan bu parçaların insanlara zarar vereceğinden endişe duydum.\" Daha sonra bu kuyu kapatıldı",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 3269,
			"arabicnumber": 3269,
			"text": "Ebu Hureyre r.a. Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmiştir: \"Sizden biri uyuduğu zaman şeytan onun kafasının arka tarafına üç düğüm atar ve her düğümü attıkça: \"Önünde uzun bir gece var, haydi uyu!\" der. Kişi uyanıp Allah'ı zikrederse bu düğümlerden biri çözülür. Kalkıp abdest alırsa ikincisi, namaz kıldığında da düğümlerin tamamı çözülür. Böylece o kişi dinç ve huzurlu bir şekilde sabaha kavuşur. Aksi halde uyuşuk, tembel ve huzursuz bir halde sabaha girer",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 3270,
			"arabicnumber": 3270,
			"text": "Abdullah İbn Ömer'in naklettiğine göre Resulullah Sallallahu Aleyhi ve Sellem'in yanında gece boyunca ta sabah vakti çıkana kadar uyuyan bir adamdan söz edildi. Resul-i Ekrem Sallallahu Aleyhi ve Sellem de: \"Şeytan bu adamın iki kulağına da işemiş!\" buyurdu veya: \" ... Kulağına işemiş!\" dedi",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 3271,
			"arabicnumber": 3271,
			"text": "Abdullah İbn Abbas r.a.'dan nakledildiğine göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Sizden birisi eşiyle cima' etmeden önce: بسم الله، اللهم جنبنا الشيطان وجنب الشيطان ما رزقتنا (Bismillah. Allahım şeytanı bizden uzaklaştır, şeytan'ı bize rızık olarak lütfedeceğin neslimizden de uzaklaştır!) diye dua eder kendilerine rızık olarak bir çocuk lutfedilirse şeytan o çocuğa zarar veremez",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 3273,
			"arabicnumber": 3273,
			"text": "",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 3274,
			"arabicnumber": 3274,
			"text": "Ebu Said el-Hudri'nin naklettiğine göre Resul-i Ekrem Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"İçinizden biri namaz kılarken önünden herhangi bir varlık geçerse ona engel olsun. Geçmek için diretirse yine engellesin. Yine de geçmeye çalışırsa onunla mukatele etsin. Çünkü o şeytandır.\" Mahir: Mukatele: Dövüşmek, savaşmak demektir. Namaz kılarken ısrarla önünden geçmeye çalışan kişi’ye elinle engel olursun, ısrar ederse ve senin önünde sütre mesafesi kadar boşluk yoksa O kişiye yumruk atarsın. Mümkünse bir adım ileri giderek o kişinin senin arkandan geçmesini sağlayabilirsin, göğsünü kıbleden ayırmamaya dikkat et",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 3275,
			"arabicnumber": 3275,
			"text": "Ebu Hureyre r.a. anlatıyor: \"Resulullah Sallallahu Aleyhi ve Sellem, beni Ramazan zekatlarını korumak üzere görevlendirmişti. Ben bu malları korurken oradaki gıda maddelerini aşırmaya çalışan biri geldi. Ben de onu yakalayıp: 'Seni Resulullah Sallallahu Aleyhi ve Sellem'e götüreceğim' dedim.\" Ebu Hureyre yaşadıklarını anlattıktan sonra o kişinin kendisine şunları söylediğini bildirmiştir: \"Yatağına uzandı ğında ayete'l-kürsi'yi oku! Bunu yaparsan sabaha kadar başında Allah'ın görevlendirdiği bir bekçi nöbet tutar ve hiçbir şeytan sana yaklaşamaz!\" Resul-i Ekrem Sallallahu Aleyhi ve Sellem bu kıssayı duyunca: \"O kişi sana doğru söylemiş fakat kendisi yalancının tekidir; o şeytandı!\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 3276,
			"arabicnumber": 3276,
			"text": "Ebu Hureyre r.a.'den nakledildiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Şeytan bazen size gelir ve şöyle der: 'Şunu kim yarattı? Peki onu kim yarattı?' En sonunda: 'Rabbini kim yarattı?' der. İşte şeytan kişiyi bu noktaya getirirse hemen o kişi Allah'a sığınsın ve bu düşünceden vazgeçsin",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 3277,
			"arabicnumber": 3277,
			"text": "Ebu Hureyre r.a.'den nakledildiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Ramazan girince cennetin kapıları açılır, cehennemin kapıları kapatılır ve şeytanlar zincire vurulur",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 3278,
			"arabicnumber": 3278,
			"text": "Ubey İbn Ka'b, Resulullah Sallallahu Aleyhi ve Sellem'den işittiği bir hadisi şöyle nakletmiştir: \"Hz. Musa, yardımcısı olan delikanlıya: 'Haydi azığımızı getir!' deyince delikanlı şöyle demişti: 'Bak şu işe! O kayanın yanında mola verdiğimizde, ben balığı unutmuşum! Muhakkak ki onu sana söylememi unutturan da şeytandan başkası değildir.' İşte Hz. Musa, Allah'ın buluşma noktası olarak belirlediği yeri geçinceye kadar yorgunluk duymamıştı",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 3279,
			"arabicnumber": 3279,
			"text": "Abdullah İbn Ömer'in şöyle dediği nakledilmiştir: \"Ben Resulullah Sallallahu Aleyhi ve Sellem'in doğu tarafına işaret ettiğini gördüm ve şöyle buyurduğunu işittim: \"Orada, fitne işte orada! Fitne işte orada! Fitne şeytanın taraftarlarının toplanacağı o taraftan çıkacak",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 3280,
			"arabicnumber": 3280,
			"text": "Cabir İbn Abdullah r.a.'ın naklettiğine göre Resul-i Ekrem Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Gece karanlığı bastırınca çocuklarınızı kesinlikle dışarıya bırakmayın! Çünkü bu vakitte şeytanlar cirit atar. Yatsı vaktinin üzerinden bir süre geçince artık çocuklarınızı evde tutun! Besmele çekerek kapınızı kapatın! Besmele çekerek ışığınızı söndürün! Besmele çekerek su kaplarının ağzını kapatın! Ve her ne ile olursa olsun kap kacağın ağzını besmele çekerek örtün!\" Tekrar: 3304, 3316, 5623, 5624, 6295, 6296",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 3281,
			"arabicnumber": 3281,
			"text": "Safiyye binti Huyeyy (r.anha) (validemiz) anlatıyor: \"Nebi Sallallahu Aleyhi ve Sellem itikafa girmişti. Ben de bir gece ziyaret maksadıyla onun yanına gittim. Onunla bir süre konuşup dışarı çıkmak üzere kalktım. Resulullah Sallallahu Aleyhi ve Sellem de beni uğurlamak üzere benimle birlikte kalktı - Safiyye binti Huyey'in evi Usame İbn Zeyd mahallesinde idi - O sırada oradan Ensar'dan iki kişi geçiyordu. Bunlar Resulullah Sallallahu Aleyhi ve Sellem'i görünce hızlandılar. Nebi Sallallahu Aleyhi ve Sellem de onlara seslenerek: 'Ağır olun! (Sakın aklınıza bir şey gelmesin!) O kadın, Safiyye binti Huyey'dir' dedi. Onlar: 'Sübhanellah, ey Allah'ın Resulü! (Hiç öyle bir şey düşünür müyüz!)' diye karşılık verince Resulullah Sallallahu Aleyhi ve Sellem: 'Şeytan, insanın vücudunda kanın dolaşması gibi dolaşır. Ben şeytanın, sizin kalplerinize bir kötülük, yanlış bir şey fırlatmasından korktum!' buyurdu",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 3282,
			"arabicnumber": 3282,
			"text": "Süleyman İbn Surad anlatıyor: \"Nebi Sallallahu Aleyhi ve Sellem'in yanında oturuyordum. Bu sırada iki kişi tartışıyor ve birbirlerine bağırıp çağırıyorlardı. Hatta birisinin öfkeden yüzü kıpkırmızı kesilmiş ve şahdamarı patlayacak gibi şişmişti. Resul-i Ekrem Sallallahu Aleyhi ve Sellem: 'Ben bir söz biliyorum! Eğer bu öfkeden çıldıran kişi o sözü söylerse kızgınlığı gider. Eğer, [Euzu billahi mine’ş-şeytan] şeytandan Allah'a sığınırım, derse içindeki öfke kaybolur' buyurdu. Orada bulunanlar adamın yanına gidip: 'Nebi Sallallahu Aleyhi ve Sellem, şeytandan Allah'a sığın, diyor' dediler. O da: 'Ne yani, ben deli miyim?!' diye karşılık verdi. \" Tekrar: 6048, 6115",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 3283,
			"arabicnumber": 3283,
			"text": "Abdullah İbn Abbas r.a.'ın naklettiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Sizden birisi eşiyle cima'dan önce: .......... (Bismillah. Allahım şeytanı benden uzaklaştır, şeytanı bana rızık olarak lütfedeceğin nesilmizden de uzaklaştır!) diye dua eder ve kendilerine rızık olarak bir çocuk lutfedilirse şeytan o çocuğa zarar veremez ve ona musallat edilmez",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 3284,
			"arabicnumber": 3284,
			"text": "Ebu Hureyre r.a.'den nakledildiğine göre Resulullah Sallallahu Aleyhi ve Sellem bir gün namaz kıldıktan sonra: \"Şeytan bana göründü ve bütün gücüyle saldırıp namazımı kesmeye çalıştı. Fakat Allah, bana onu alt etme gücü verdi. .. \" buyurdu. Ebu Hureyre daha sonra o gün yaşananları anlattı",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 3285,
			"arabicnumber": 3285,
			"text": "Ebu Hureyre r.a.'den nakledildiğine göre Resul-i Ekrem Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Namaz için ezan okununca şeytan arkasını döner ve (tıpkı bir Eşek gibi) yellenerek kaçar. Ezan bitince geri gelir. Kamet getirildiğinde şeytan yine dönüp kaçar. Kamet bittiğinde yine gelir ve insan ile kalbi arasına girip vesvese vermeye başlar: 'Haydi şunu düşün, şunu hatırla!' der. Namaz kılmakta olan kişi, üç rekat mı yoksa dört mı kıldığı konusunda kuşkuya düşene kadar da devam eder. Bir kimse üç rekat mı yoksa dört rekat mı kıldığını bilemezse iki sehiv secdesi yapar",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 3286,
			"arabicnumber": 3286,
			"text": "Ebu Hureyre r.a.'in naklettiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Şeytan, doğumu sırasında her çocuğun iki yanına iki parmağıyla dürter. Ancak Meryem oğlu İsa Nebi bunun dışındadır. Şeytan ona da dürtmek için gelmiş fakat ancak plasentaya dokunabilmiştir.\" Tekrar: 3431, 4548 Plasenta karşılığını verdiğimiz الحجاب kelimesi İbnü'I-Cevzı'ye göre çocuğun sarıldığı kundak anlamını vermiştir",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 3287,
			"arabicnumber": 3287,
			"text": "Alkame anlatıyor: \"Şam'a gelmiştim. Mescidde iken birisi geldi. Onun kim olduğunu sorduğumda: Ebü'd-Derda diye cevap verdiler. Ebü'd-Derda bana: İçinizde Allah tarafından şeytandan korunduğu Resulullah Sallallahu Aleyhi ve Sellem'in diliyle bildirilen zat yok mu? dedi.\" Ravilerden Muğire ed-Dabbı'nin naklettiğine göre ayrıca Ammar'ı kasdederek: \"O, Allah tarafından korunduğu Resulullahlın Sallallahu Aleyhi ve Sellem diliyle bildirilen kişidir\" demiştir. Tekrar: 6223, 6226",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 3288,
			"arabicnumber": 3288,
			"text": "Hz. Aişe r.anha'nın naklettiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Melekler gökyüzünde bulutlar arasında yeryüzünde olacak işleri konuşurlar. Bu sırada şeytanlar da onlardan bir şeyler duymak için çalışırlar ve duydukları sözü tıpkı bir testinin doldurulması gibi kahinlerin kulaklarına aktarırlar. Bununla da kalmaz o söze kendilerinden yüz yalan daha katarlar",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 3289,
			"arabicnumber": 3289,
			"text": "Ebu Hureyre r.a.'in naklettiğine göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Esnemek şeytandandır. İçinizden birisi esnemesi gelirse gücü ölçüsünce esnememek için kendisini tutsun. Çünkü esnemek üzere ağzınız! açıp hah diyecek olursanız şeytan güler. \" Tekrar: 3742, 3743, 3761, 4943, 4944, 6278",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 3290,
			"arabicnumber": 3290,
			"text": "Hz. Aişe r.anha anlatıyor: \"Uhud savaşında müşrikler hezimete uğramışlardı. Bu sırada İblis Müslümanlara: 'Ey Allah'ın kulları, arkanızdakilere dikkat edin, onlara saldırın!' diye olanca gücüyle bağırdı. Bunun üzerine öndeki grupla arkada kalan Müslüman savaşçılar birbirine girdi. Bu hengamede Huzeyfe İbnü'l-Yeman babası Yeman'ın Müslümanların saldırısına uğradığını gördü ve: 'Ey Allah'ın kulları, o benim babam, o benim babam!' diye bağırdı. Ancak, Allah'a yemin ederim ki, onu öldürünceye kadar devam ettiler. Huzeyfe ise o gün babasını öldürenlere: 'Allah sizleri affetsin!' diye dua etti.\" Urve şöyle demiştir: \"Huzeyfe, Allah'a kavuşuncaya kadar babasını öldürenlere dua etmiş ve Allah'tan onlar için af dilemiştir.\" Tekrar: 3824, 4065, 6668, 6883, 6890 Urve'nin bu sözü farklı bir yoruma göre şu anlama gelmektedir: \"Huzeyfe, ettiği bu dua sayesinde Allah'a kavuşuncaya kadar hayır görmüştür",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 3291,
			"arabicnumber": 3291,
			"text": "Mesruk'tan nakledildiğine göre Hz. Aişe şöyle demiştir: \"Nebi Sallallahu Aleyhi ve Sellem'e kişinin namazda iken (vücudunun ve kalbinin) başka tarafa yönelmesini (التفات) sormuştum. Bana: 'Bu, şeytanın sizin namazınızdan kapıp kaçırdığı kısımdır' diye cevap verdi",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 3292,
			"arabicnumber": 3292,
			"text": "Abdullah İbn Ebu Katade'nin babası Ebu Katade'den naklettiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Salih rüya Allah'tan, kabus ise şeytandandır. Sizden birisi kendisini korkuya ve dehşete düşüren bir rüya görürse sol tarafına tükürüp onun şerrinden Allah'a sığınsın. Bu durumda kendisine zarar vermez. \" Tekrar: 5747, 6984, 6986, 6995, 6996,7005, 7044 BU HADİS’İN AÇIKLAMALI SAYFASI İÇİN BURAYA TIKLAYIN Diğer tahric edenler: Tirmizi Rüya; Dârimî: Rüya",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 3293,
			"arabicnumber": 3293,
			"text": "Ebu Hureyre r.a.'in naklettiğine göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Kim günde yüz defa ......... la ilahe illallahu vahdehu la şerike leh. Lehü'l-mülkü ve lehü'l-'hamdu ve huve ala kulli şey'in kadirun derse on köle azad etmeye denk iş yapmış olur. Kendisine yüz sevab yazılır, yüz günahı silinir ve o gün boyunca akşama kadar kendisini şeytandan koruyan bir sığınak olur. Ayrıca bundan daha fazlasını yapan biri olmadığı sürece kendisinden daha faziletli bir amel işleyen yok demektir. \" Zikrin meali: Allah'tan başka hiçbir ilah yoktur. O tektir, hiçbir ortağı yoktur. Mülk tümüyle ona aittir ve hamd ona mahsustur. O'nun her şeye gücü yeter. Tekrar: 6403",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 3294,
			"arabicnumber": 3294,
			"text": "Muhammed İbn Sa'd İbn Ebı Vakkas, babası Sa'd İbn Ebi Vakkas r.a.'ın şöyle dediğini nakletmiştir: \"Bir gün Hz. Ömer, Resulullah Sallallahu Aleyhi ve Sellem'in huzuruna girmek üzere izin istemişti. O sırada Resul-i Ekrem Sallallahu Aleyhi ve Sellem Kureyş'li bazı kadınlarla görüşüyordu. Kadınlar yüksek sesle Nebi Sallallahu Aleyhi ve Sellem ile konuşuyorlardı ve O'nu (s.a.v.) bunaltmışlardı. Kadınlar Hz. Ömer'in izin istediğini duyunca hemen örtülerini düzeltmeye ve kendilerine çeki düzen vermeye başladılar. Resulullah Sallallahu Aleyhi ve Sellem gülümseyerek Ömer'e izin verdi. Hz. Ömer: 'Ey Allah'ın Resulü, Allah yüzünüzden gülümsemeyi eksik etmesin!' deyince Resul-i Ekrem Sallallahu Aleyhi ve Sellem: 'Benim yanımda bulunan bu kadınların haline gülüyorum! Senin sesini duyunca hemen örtülerini düzeltip kendilerine çeki düzen vermeye çalıştılar da!' buyurdu. Ömer ise: 'Ey Allahın Resulü, senden daha fazla çekinmeleri gerekirdi' dedi. Ardından da kadınlara yönelerek: 'Sizi yaramazlar (Ey kendilerinin düşmanları), benden çekiniyorsunuz da Resulullah Sallallahu Aleyhi ve Sellem'den çekinmiyorsunuz öyle mi?!' diye çıkıştı. Onlar ise: 'Tabi ki, senden daha çok çekiniyoruz! Sen Resulullah Sallallahu Aleyhi ve Sellem'e göre çok sert ve kaba bir adamsın!' dediler. Bunun üzerine Resul-i Ekrem Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Canımı elinde tutan Allah'a yemin ederim ki, şeytan seninle bir yolda karşılaşacak olsa, kesinlikle o yolunu değiştirir, senin tuttuğun yoldan başka bir yola girer.\" Tekrar: 3683, 6085",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 3295,
			"arabicnumber": 3295,
			"text": "Ebu Hüreyre r.a.'in şöyle dediği nakledilmiştir: \"Bir kimse uyandıktan sonra abdest aldığı zaman üç kere sümkürsün! Çünkü şeytan geceyi onun genzi üzerinde geçirmiştir",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 3296,
			"arabicnumber": 3296,
			"text": "Abdurrahman İbn Abdullah İbn Abdurrahman İbn Ebi Sa'sa'a'nın babasından naklettiğine göre Ebu Said el-Hudrı babasına şöyle demiştir: \"Anladığım kadarıyla sen koyunları ve kırları seven birisin. Kırda koyunlarını otlatırken eğer namaz için ezan okuyacak olursan sesini iyice yükselt! Çünkü müezzinin sesini duyan insanlar, cinler ve bütün varlıklar kıyamet gününde onun lehine şahitlik edeceklerdir.\" Ebu Said el-Hudri: \"Ben bunu Resulullah Sallallahu Aleyhi ve Sellem'den duydum\" demiştir",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 3298,
			"arabicnumber": 3298,
			"text": "Abdullah İbn Abbas الثعبان kelimesini erkek yılan / ejderha diye açıklamıştır. Yılanların pek çok türünün olduğu söylenir: Küçük yılanlar, engerek yılanı, kara mamba yılanı gibi. صافات kanatlarını açarak, yayarak demektir. يقبضن fiili ise kuşların kanat vurmalarını, kanat çırpmalarını anlatır",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 3299,
			"arabicnumber": 3299,
			"text": "",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 3300,
			"arabicnumber": 3300,
			"text": "Ebu Said el-Hudri r.a.'in naklettiğine göre Resul-i Ekrem Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Dağların tepelerinde ve vadilerin derinliklerinde beslenip peşlerine düşülen koyunların kişi için en değerli mallar olması vakti çok yaklaştı. Kişi bu şekilde dinini fitnelerden korumak için kaçar",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 3301,
			"arabicnumber": 3301,
			"text": "Ebu Hureyre r.a.'den nakledildiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Küfrün başı doğu tarafındadır. Böbürlenme ve kibirlenme, at ve deve sürülerine sahip olanlarda görülür. Develerinin, sığırlarının peşinden giden kaba ve çığırtkan insanlar (el-feddadun), bedevilerdir. Koyun sürülerine sahip olanlarda ise sükunet ve huzur vardır.\" Tekrar: 3499, 4388-4390",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 3302,
			"arabicnumber": 3302,
			"text": "Ebu Mes'ud Ukbe İbn Amr'dan nakledildiğine göre Resul-i Ekrem Sallallahu Aleyhi ve Sellem eliyle Yemen tarafına işaret ederek: \"İman işte orada Yemenlidir. Katı kalplilik ve kabalık ise Rebia ve Mudar kabilelerinden olup deve/erin kuyruklarına yapışan çığırtkan insanların bulunduğu yerde, şeytan işi çirkinliklerin çıktığı taraftadır. \" Tekrar: 3498, 4387, 5303",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 3303,
			"arabicnumber": 3303,
			"text": "Ebu Hureyre r.a.'in naklettiğine göre Resul-i Ekrem Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Horoz'un öttüğünü işittiğiniz zaman Allah'ın fazlından ve ihsanından isteyiniz! Çünkü bu durumda horoz bir melek görmüştür. Buna karşılık bir eşek anırması duyarsanız şeytandan Allah'a sığınınız! Çünkü o, bir şeytan görmüştür.\" Diğer tahric: Müslim, Zikr: Tirmizi Daavat",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 3304,
			"arabicnumber": 3304,
			"text": "Cabir İbn Abdullah r.a.'dan nakledildiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Gece karanlığı bastırınca - veya akşam olunca - çocuklarınızı kesinlikle dışarıya bırakmayın! Çünkü bu vakitte şeytanlar cirit atar. Gecenin bir kısmı geçince artık çocuklarınızı evde tutun, kapıları kapatın ve Allah'ın adını anın! Zira şeytan kapalı kapıyı açamaz",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 3305,
			"arabicnumber": 3305,
			"text": "Ebu Hureyre'nin naklettiğine göre Resul-i Ekrem Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"İsrailoğullarından bir grup kayboldu. Bu gruba ne olduğu bilinmiyor. Ancak bana öyle geliyor ki bunlar (bir ceza olarak) fareye dönüştürülmüşler. Çünkü farenin önüne deve sütü konulursa içmiyor fakat koyun sütü konulursa içiyor!\" Ebu. Hureyre şöyle demiştir: \"Ben bunu Ka'b'a anlattım. O da bana bir kaç defa: 'Sen Nebi Sallallahu Aleyhi ve Sellem'in böyle dediğini gerçekten işittin mi?' diye sordu. En sonunda ona: 'Ne yani, benim Tevrat'ı okuduğumu mu düşünüyorsun?' diye çıkıştım",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 3306,
			"arabicnumber": 3306,
			"text": "Hz. Aişe'nin şöyle dediği nakledilmiştir: \"Resulullah Sallallahu Aleyhi ve Sellem kelere fuveysık (minik fasık) demişti. Fakat kelerin öldürülmesini emrettiğini işitmedim.\" Sa'ad İbn Ebı Vakkas ise ResuluIlah Sallallahu Aleyhi ve Sellem'in kelerin öldürülmesini emrettiğini söylemiştir",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 3307,
			"arabicnumber": 3307,
			"text": "Ümmü Şerik'ten nakledildiğine göre ResuluIlah Sallallahu Aleyhi ve Sellem ona kelerleri öldürmesini emretmiştir",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 3308,
			"arabicnumber": 3308,
			"text": "Aişe r.anha'dan nakledildiğine göre Resul-i Ekrem Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Sırtında iki beyaz çizgi olan zehirli yılan türünü (zü't-tufeyteyn) öldürün! Çünkü bu yılanlar gözün nurunu söndürür ve hamile kadınlara zarar verir",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 3309,
			"arabicnumber": 3309,
			"text": "Aişe r.anha'dan nakledildiğine göre Resul-i Ekrem Sallallahu Aleyhi ve Sellem kuyruğu küt / güdük olan yılan türünün (ebter) öldürülmesini emretmiş ve şöyle buyurmuştur: \"Çünkü bu yılanlar gözün nurunu söndürür ve hamile kadınların çocuklarını düşürmelerine sebep olur",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 3311,
			"arabicnumber": 3311,
			"text": "",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 3313,
			"arabicnumber": 3313,
			"text": "",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 3314,
			"arabicnumber": 3314,
			"text": "Hz Aişe'den nakledildiğine göre Resul-i Ekrem Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: ''Beş tür zararlı hayvan harem sınırları içerisinde dahi öldürülür: Fare, akrep, çaylak, karga ve kelb-i akur (saldırgan köpek)",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 3315,
			"arabicnumber": 3315,
			"text": "Abdullah İbn Ömer'den nakledildiğine göre Resul-i Ekrem Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Bir kimse ihramlı olduğu halde şu beş hayvanı öldürsebile günahı olmaz: Akrep, fare, kelb-i akur (saldırgan köpek), karga ve çaylak:",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 3316,
			"arabicnumber": 3316,
			"text": "Cabir İbn Abdullah r.a.'ın merfu' olarak naklettiği bir rivayete göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Kaplarınızın ağızlarını kapatın, su kırbalarının ağızlarını bağlayın, kapılarımzı örtün, akşam olduğunda çocuklarınızı yanınıza alın ve dışarı salmayın! Çünkü bu vakitlerde cinler etrafa yayılır ve zarar verir. Yatacağınız zaman kandilleri söndürün. Kim bilir belki bir fare çıkar ve kandili devirerek ev halkının yanmasına sebep olur!\" [Ata'dan nakledilen rivayette cinler yerine şeytanlar ifadesi kullanılmıştır]",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 3317,
			"arabicnumber": 3317,
			"text": "Abdullah İbn Mes'ud anlatıyor: \"Resulullah Sallallahu Aleyhi ve Sellem ile birlikte bir mağarada iken, Mürselat suresi nazil oldu. Biz inen ayetleri, O'nun ağzından öğrenirken, birden bir yılan yuvasından çıkıverdi. Hemen onu öldürmek üzere atıldık. Fakat yılan hızlı davranıp yuvasına kaçtı. Resulullah Sallallahu Aleyhi ve Sellem bunun üzerine: 'Siz onun zararından / şerrinden korunduğunuz gibi, o da sizin zararınızdan / şerrinizden korundu!' buyurdular.\" Bu rivayet Abdullah İbn Mes'ud'dan: \"Ayetleri okuduğu sırada ağzındaki ıslaklık daha kurumamıştı ki, (bir yılan çıkıverdi)\" şeklinde de nakledilmiştir",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 3318,
			"arabicnumber": 3318,
			"text": "Abdullah İbn Ömer'den nakledildiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Bir kadın bir kedi sebebiyle cehenneme girdi. Çünkü bu kediyi bağlayıp hapsetmiş, beslemeyip aç bırakmış ve yeryüzündeki bazı canlıları yakalayıp yemesi için serbest bırakmamıştı",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 3319,
			"arabicnumber": 3319,
			"text": "Ebu Hureyre r.a.'den nakledildiğine göre Resul-i Ekrem Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Nebilerden birisi dinlenmek üzere bir ağacın gölgesinde konaklamıştı. Bu sırada onu bir karınca ısırdı. O Nebi eşyalarının getirilmesini emretti ve ağacın altında karıncanın yuvasını buldu. Sonra da bu yuvanın yakılmasını emretti. Bunun üzerine Allah Teala ona: 'Cezalandıracaksan tek bir karıncayı cezalandırman gerekmez miydi?!' diye vahyetti",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 3320,
			"arabicnumber": 3320,
			"text": "Ebu Hureyre r.a.'in naklettiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Herhangi birinizin içeceğine sinek düşecek olursa o sineği içeceğe daldırsın ve geri çıkarsın. Zira onun kanatlarından birinde hastalık diğerinde ise bunun şifası vardır",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 3321,
			"arabicnumber": 3321,
			"text": "Ebu Hureyre r.a.'in naklettiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Kötü yola düşmüş / fahişe bir kadın, bir kuyu başında rastladığı susuzluktan ölmek üzere olan bir köpeğe yardımı sebebiyle bağışlanmıştır. Bu kadın köpeğe su vermek için ayakkabısını çıkardı ve örtüsüne bağlayıp kuyudan su çekti. İşte köpeğe yaptığı bu iyilikten dolayı bağışlandı",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 3322,
			"arabicnumber": 3322,
			"text": "Ebu Talha'dan nakledildiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"İçinde köpek ve resim (suret) bulunan eve melekler girmez",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 3323,
			"arabicnumber": 3323,
			"text": "Abdulah İbn Ömer'den nakledildiğine göre Resulullah Sallallahu Aleyhi ve Sellem köpeklerin öldürülmesini emretmiştir",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 3324,
			"arabicnumber": 3324,
			"text": "Ebu Hureyre r.a.'den nakledildiğine göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Bekçi veya çoban köpeği dışında köpek bulunduran kimselerin amellerinden her gün bir kırat eksilir",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 3325,
			"arabicnumber": 3325,
			"text": "Süfyan İbn Ebu Züheyr eş-Şenei şöyle demiştir: \"Resulullah Sallallahu Aleyhi ve Sellem'in, 'Bağını / bahçesini ve hayvanlarını korumak dışında bir maksatla köpek barındıran kimselerin amellerinden her gün bir kırat eksilir' buyurduğunu duydum.\" Ravilerden Saib İbn Yezıd, Süfyan İbn Ebu Züheyr'e: \"Bunu gerçekten Resulullah Sallallahu Aleyhi ve Sellem'den bizzat işittinmi?\" diye sorunca Süfyan: \"Evet, işte şu kıblenin Rabbine yemin olsun ki işittim!\" demiştir. 6.CİLT VE BED’İL-HALK BİTTİ. 7. CİLT VE AHADİSU’L-ENBİYA BİR SONRAKİ SAYFADA",
			"grades": [],
			"reference": {
				"book": 59,
				"hadith": 131
			}
		}
	]
}