{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"60": "Prophets"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3326,
			"arabicnumber": 3326,
			"text": "Ebu Hureyre r.a.'dan rivayete göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Allah Adem'i yetmiş zira' boyunda yarattı. Sonra: Git, şu meleklere selam ver ve selamını nasıl alacaklarını dikkatle dinle. Bu senin ve senin soyundan geleceklerin selamlaşma şekli olacaktır, diye buyurdu. (Adem): es-Selamu aleykum dedi, onlar da: es-Selamu aleyke ve rahmetullah, diye cevap verdiler ve 'rahmetullah' lafzını eklediler. Artık cennete girecek olan herkes Adem'in sureti üzeri girecektir. İnsanların hilkati şu an'a kadar hala eksilip durmaktadır. \" Tekrar: 6227",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3327,
			"arabicnumber": 3327,
			"text": "Ebu Hureyre r.a. dedi ki: Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Cennete girecek ilk grup, on dördündeki ay gibi olacaklardır. Onlardan sonra girecekler ise aydınlığı itibariyle gökte en ileri derecede ışık saçan yıldız gibi olacaklardır. Onlar küçük, büyük abdestlerini bozmayacaklar, tükürmeyecekler, sümkürmeyecekler, tarakları altından olacaktır. Terleri misk olacaktır, tütsüleri öd ağacından olacaktır. Zevceleri de el-huru'l-'in olacaktır. Hepsi tek bir adamın hilkati üzere babaları Adem'in Suretinde ve boyları 60 (ar) zira\" olacaktır",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3328,
			"arabicnumber": 3328,
			"text": "Ümmü Süleym'den, dedi ki: Ey Allah'ın Resulü, şüphesiz Allah haktan çekinmez. Kadın ihtilam olursa gusletmesi gerekir mi? \"Suyu görecek olursa• evet\" diye buyurdu. Ümmü Seleme güldü ve: Kadın hiç ihtilam olur mu, dedi. Resulullah Sallallahu Aleyhi ve Sellem: \"Ya çocuk nasıl (annesine) benzer ki?\" diye buyurdu",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3329,
			"arabicnumber": 3329,
			"text": "Enes r.a.'dan dedi ki: Nebi Sallallahu Aleyhi ve Sellem'in Medine'ye teşrif ettiği haberi Abdullah bin Selam'a ulaştı. Yanına giderek dedi ki: Ben sana Nebi dışında kimsenin bilmediği üç hususa dair soru soracağım: Saatin (kıyametin) ilk şartı (alametil nedir? Cennet ehlinin ilk yiyeceği yemek nedir? Çocuk babasına nasıl benzer ve çocuk hangi sebepten dolayı dayılarına benzer? Resulullah Sallallahu Aleyhi ve Sellem: \"Az önce Cibril bu hususları bana haber verdi\" diye buyurdu. Abdullah: Bu, melekler arasında Yahudilerin düşmanıdır, dedi. Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Kıyametin şartlarından (alametlerinden) ilki doğudan, batıya doğru insanları önüne katıp sürükleyecek bir ateş olacaktır. Cennet ehlinin ilk yiyeceği ise bir balığın karaciğerinin yan tarafındaki fazlalık olacaktır. çocuğun benzemesine gelince, erkek kadın ile bir araya gelip de onun suyu kadınınkinden erken ulaşırsa çocuk babasına benzer, eğer kadının suyu erken ulaşırsa çocuk annesine benzer.\" Abdullah: Şehadet ederim ki, hiç şüphesiz sen Allah'ın Resulüsün, dedi. Daha sonra şunları ekledi: Ey Allah'ın Resulü! Yahudiler çok iftiracı bir kavimdir. Onlar eğer kendilerine sormadan önce benim Müslüman olduğumu bilecek olurlarsa sana karşı bana iftirada bulunurlar. Yahudiler geldi, Abdullah da bir başka odaya girdi. Resulullah Sallallahu Aleyhi ve Sellem: \"Abdullah bin Selam aranızda nasıl bir adam olarak bilinir\" diye sordu. Onlar: O, bizim en alimimiz ve en alimimizin oğludur. Bizim en ileri gelen hahamımız ve en ileri gelen hahamımızın da oğludur, dediler. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem sordu: \"Abdullah Müslüman olursa kanaatiniz ne olur?\" Onlar: Böyle bir iş yapmaktan Allah onu korusun, dediler. Bunun üzerine Abdullah yanlarına çıkarak dedi ki: Allah'tan başka hiçbir ilah'ın olmadığına şehadet ederim. Muhammed'in de Allah'ın Resulü olduğuna şehadet ederim. Bu sefer Yahudiler: O bizim en şerlimizdir. En şerlimizin de oğludur dediler ve hakkında ileri geri konuştular. Tekrar: 448, 3911, 3938",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3330,
			"arabicnumber": 3330,
			"text": "Ebu Hureyre r.a. de Nebi Sallallahu Aleyhi ve Sellem'den buna yakın bir rivayet nakletmiş bulunmaktadır. Yani o şöyle buyurmuştur: \"Eğer İsrailoğulları olmasaydı et kokmayacaktı ve eğer Havva da olmasaydı, hiçbir kadın kocasına ihanet etmeyecekti",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 3331,
			"arabicnumber": 3331,
			"text": "Ebu Hureyre r.a. dedi ki: Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Kadınlar hakkında tavsiyemi kabul ediniz, ona uyunuz. Çünkü kadın bir kaburga kemiğinden yaratılmıştır. Şüphesiz kaburga kemiğinde en eğri taraf da onun en üst tarafıdır. Sen onu düzeltmeye kalkışırsan kırarsın. O haliyle bırakacak olursan eğriliği devam eder. O halde kadınlar hakkında tavsiyemi kabul ediniz. \" Tekrar: 5184, 5186",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3332,
			"arabicnumber": 3332,
			"text": "Abdullah dedi ki: Hem doğru sözlü, hem doğru sözlülüğü tasdik edilmiş bulunan Resulullah Sallallahu Aleyhi ve Sellem bize şunu anlattı: \"Her biriniz annesinin karnında (nutfe olarak) kırk gün süreyle kalır. Bundan sonra bir o kadar süre alaka olarak kalır, bundan sonra bir o kadar süre mudğa (bir çiğnemlik et) kalır. Daha sonra Allah ona şu dört hususu yazmakla görevli bir melek gönderir: Ameli, eceli ve rızkı, bedbaht mı yoksa bahtiyar mı olacağı yazılır. Sonra ona ruh üflenir. Hiç şüphesiz kişi cehennem ehlinin ameli ile amel eder, durur ve nihayet kendisi ile cehennem arasında bir arşınlık mesafe kalır, fakat kitap (takdir edilen) onun hakkında öne geçer, bu sebeple o da cennetliklerin ameli ile amel eder ve cennete girer ve şüphesiz (bir başka) adam cennetliklerin ameli ile amel eder ve nihayet kendisi ile cennet arasında ancak bir arşınlık mesafe kalmışken onun hakkında kitap (takdir) öne geçer ve o da cehennem ehlinin ameliyle amel eder, sonunda cehenneme girer",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3333,
			"arabicnumber": 3333,
			"text": "Enes bin Malik r.a.'dan rivayete göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Şüphesiz Allah rahimde bir melek görevlendirmiştir. Melek: Rabbim, nutfe oldu, Rabbim alaka oldu, Rabbim mudğa oldu, der. (Allah) onu yaratmayı murad ederse (melek): Rabbim, erkek mi yoksa dişi mi olacak, bedbaht mı yoksa bahtiyar mı olacak, rızkı nedir, eceli nedir, diye sorar. Annesinin karnında iken bunlar yazılır",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3334,
			"arabicnumber": 3334,
			"text": "Enes'ten Nebi Sallallahu Aleyhi ve Sellem'e ref ederek (onun buyurmuş olduğunu belirterek): \"Şüphesiz Allah cehennem ehli arasında azabı en hafif olan kimseye şöyle diyecek: Eğer yeryüzünde her ne varsa senin olsaydı (azaptan kurtulmak için) feda edermiydin? O, evet diyecek. Yüce Allah şu cevabı verecek: Fakat sen henüz Adem'in sulbünde iken ben senden bundan daha kolay bir şey olan bana şirk koşmamanı istemiştim. Ancak sen şirk koşmaktan başka bir şeyi kabul etmedin. \" Tekrar: 6538, 6557",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3335,
			"arabicnumber": 3335,
			"text": "Abdullah (b. Mes'ud) dedi ki: Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Haksızca öldürülen her bir nefsin, günahından bir pay da -haksızca dökülen kanı dolayısıyla- mutlaka Adem'in ilk (olarak kan döken) oğluna da verilir. Çünkü öldürme çığırını ilk açan odur.'' Tekrar: 6867 ve 7321",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3336,
			"arabicnumber": 3336,
			"text": "Aişe r.anha dedi ki: Nebi Sallallahu Aleyhi ve Sellem'i şöyle buyururken dinledim: \"Ruhlar (özelliklerine göre) bir araya getirilmiş kafilelerdir. Bu sebeple aralarından birbirlerini tanıyanlar kaynaşırlar. Birbirlerini tanımayanlar da ayrılırlar",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3337,
			"arabicnumber": 3337,
			"text": "İbn Ömer r.a. dedi ki: Resulullah Sallallahu Aleyhi ve Sellem Müslümanların huzurunda ayağa kalktı. Yüce Allah'a layık olduğu şekliyle övgülerde bulundu. Daha sonra Deccal'i sözkonusu ederek dedi ki: \"Ben de sizi onunla uyarıp korkutuyorum. Kavmini onunla uyarıp korkutmamış hiçbir nebi yoktur. Nuh kavmini uyarıp korkuttu, fakat ben size onun hakkında hiçbir Nebiin kavmine söylemediği bir şey söyleyeceğim. Şunu bilin ki, onun tek gözü kördür. Allah'ın ise hiç şüphesiz gözü kör değildir",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3338,
			"arabicnumber": 3338,
			"text": "Ebu Hureyre r.a. dedi ki: Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Ben size Deccal hakkında daha önce hiçbir Nebiin kavmine anlatmamış olduğu bir şeyi anlatacağım: Şüphesiz ki onun bir gözü kördür ve o beraberinde cennete ve cehenneme benzeyen bir şey ile gelecektir. Onun, bu cennettir dediği şeyaslında cehennemdir. Ben Nuh'un onu hatırlatarak kavmini inzar ettiği gibi sizi de uyarıp, korkutuyorum",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3339,
			"arabicnumber": 3339,
			"text": "Ebu Said dedi ki: Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Nuh ve ümmeti gelecek. Yüce Allah: \"Tebliğ ettin mi, diye soracak. O, evet Rabbim, diye cevap verecek. Ümmetine: Size tebliğ etti mi, diye soracak, onlar: Hayır, bize hiçbir Nebi gelmedi, diyecekler. Nuh'a: Peki, sana kim şahitlik eder, diye soracak. Nuh: Muhammed Sallallahu Aleyhi ve Sellem ve onun ümmeti, diyecek. Biz de onun tebliğ etmiş olduğuna şahitlik edeceğiz. İşte şanı yüce Allah'ın: \"Böylece sizi vasat bir ümmet kıldık. Bütün insanlara karşı şahitler olasınız.\" [Bakara, 143] buyruğu bunu dile getirmektedir ki, vasat, adil olan demektir.\" Tekrar: 4487, 7349",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3340,
			"arabicnumber": 3340,
			"text": "Ebu Hureyre r.a. dedi ki: Nebi Sallallahu Aleyhi ve Sellem ile birlikte bir davette idik. Ona kol düştü -kolu da severdi-, ondan bir miktar sıyırıp aldı ve şöyle buyurdu: \"Kıyamet gününde insanların efendisi benim. Neden biliyor musunuz? Allah öncekileri de, sonrakileri de aynı düzlükte bir araya toplayacaktır. Bakan herkes onları görür, davetçi onlara sesini işittirir, güneş onlara oldukça yaklaşır. Bazı kimseler şöyle diyecektir: İçinde bulunduğunuz bu durumu, ne hale vardığınızı görmüyor musunuz? Niçin Rabbinizin huzurunda sizin için şefaatte bulunacak kimse araştırmıyorsunuz? Aralarından kimisi, babanız Adem (bu işi yapar) diyecek. Bunun üzerine yanına gidecekler. Ey Adem diyecekler, sen insanların babasısın. Allah seni eliyle yarattı ve sana ruhundan üfledi, meleklere emir verdi, onlar da sana secde ettiler. Seni de kendi cennetine yerleştirdi. Rabbinin huzurunda bize şefaat etmez misin? İçinde bulunduğumuz durumumuzu, ne hale geldiğimizi görmez misin? O şöyle diyecek: Rabbim daha önce benzeri görülmedik bir şekilde gazap etmiştir. Bundan sonra da bu şekilde gazap etmeyecektir. O bana ağacı yasakladığı halde ben ona itaat etmedim. Kendimi kurtarmaya bakıyorum, kendimi. Benden başkasına gidiniz. Nuh'un yanına gidiniz. Kalkıp Nuh'a giderler, ey Nuh derler. Sen yeryüzündekilere gönderilen ilk Resulsün. Allah seni çok şükreden bir kul diye nitelendirdi. İçinde bulunduğumuz bu durumumuzu, ne hale geldiğimizi görmez misin? Rabbinin huzurunda bize şefaat etmeyecek misin? Nuh şu cevabı verir: Rabbim bugün öyle bir gazap etti ki, bundan önce böyle gazap etmediği gibi, bundan sonra da bu şekilde gazap etmeyecektir. Ben canımı kurtarmaya bakıyorum, canımı. Haydi Nebi Sallallahu Aleyhi ve Sellem'e gidin. Bunun üzerine yanıma gelirler. Ben de Arş'ın altında secdeye kapanırım. Ey Muhammed başını kaldır, şefaat et, şefaatin kabul edilecek, iste, istediğin verilecek, denilir.\" (Ravilerden) Muhammed b. Ubeyd dedi ki: Hadisin geri kalan bölümleri hıfzımda değildir. Tekrar: 3361, 4712",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3341,
			"arabicnumber": 3341,
			"text": "Abdullah r.a.'dan rivayete göre Resulullah Sallallahu Aleyhi ve Sellem: \"O halde var mı ibret alıp, düşünen?\" [Kamer, 15] (mealindeki) buyruğu herkes nasıl okuyorsa öylece okumuştur. Hadis 3345,3376,3869,3870,3871,3872,3873 ve 3874 numara ile gelecektir",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 3342,
			"arabicnumber": 3342,
			"text": "Ebu Zer' r.a.'dan rivayete göre o, Resulullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu rivayet etmiştir: \"Ben Mekke'de iken içinde bulunduğum evin tavanı yarıldı. Cibril indi, göğsümü yardı, sonra onu Zemzem suyu ile yıkadı. Daha sonra hikmet ve iman ile dolu altından bir leğen getirdi. Onu göğsümün içine boşalttıktan sonra göğsümü kapattı. Daha sonra elimden tutarak benim ile semaya yükseldi. Dünya semasına gelince, Cibril semadaki bekçiye: Aç, dedi. Bekçi: O kim, diye sordu, Cibril'im dedi. (Bekçi): Beraberinde kimse var mı, dedi. (Cibril): Beraberimde Muhammed var, dedi. Ona risalet verildi mi, diye sordu. Evet kapıyı aç, dedi. Nihayet biz semaya yükselince sağ tarafında gölgeler, sol tarafında gölgeler bulunan bir adam gördüm. Sağ tarafına baktığında gülüyor, sol tarafına baktığında ağlıyordu. Bu salih Nebi'ye, bu salih evlada merhaba, dedi. Bu kim ey Cibril, diye sordum. (Cebrail): Bu Adem'dir, dedi. Sağında ve solunda gördüğün şu gölgeler ise onun çocuklarının canlarıdır. Bunlardan sağda olanlar cennet ehlidir, solda bulunan gölgeler ise cehennem ehlidir. Bu sebeple o sağ tarafına bakınca güler, sol tarafına bakınca ağlar. Daha sonra Cibril beni alıp ikinci semaya çıkardı. O semanın bekçisine: Aç dedi. Bekçisi birincisinin ona dediklerini söyledi. O da semayı açtı.\" Enes dedi ki: Resulullah semavatta İdris'i, Musa'yı, İsa'yı ve İbrahim'i gördüğünü zikretti. Ancak onların mevkilerinin nasıl olduğunu iyice belleyemedim. Şu kadar var ki onun zikrettiğine göre Adem'i dünya semasında, İbrahim'i de altıncı semada görmüştür. Enes devamla dedi ki: Cibril, İdris'in yanından geçince salih Nebi'ye, salih kardeşe merhaba, dedi. Ben: Bu kimdir diye sordum. O: Bu İdris'tir dedi. Daha sonra Musa'nın yanından geçtim. Salih nebiye, salih kardeşe merhaba, dedi. Bu kim diye sordum. (Cebrail): Bu Musa'dır dedi. Sonra İsa'nın yanından geçtim, salih Nebi'ye, salih kardeşe merhaba, dedi. Bu kim diye sordum. İsa'dır dedi. İbrahim'in yanından geçince, salih Nebi'ye ve salih evlada merhaba dedi. Ben, bu kimdir diye sordum. Bu İbrahim'dir dedi.\" (Senedde zikredilen İbn Şihab) dedi ki: Bana (ensardan) İbn Hazm'ın haber verdiğine göre İbn Abbas ile ensardan Ebu Habbe şöyle diyorlardı: Nebi Sallallahu Aleyhi ve Sellem buyurdu ki: \"Sonra ben (mirac'a) yükseltildim. Nihayet (yazıcı meleklerin) kalem seslerini işiteceğim bir yere kadar vardım.\" İbn Hazm ile Enes b. Malik r.a. dediler ki: Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Allah bana elli vakit namaz farz kıldı. Ben de bu mükellefiyet ile geri döndüm. Musa'nın yanından geçerken Musa: Ümmetine ne farz kılındı, diye sordu. Ben: (Allah) onlara elli vakit namaz farz kıldı, dedim. Rabbine başvur, dedi. Senin ümmetin bunu kaldıramaz. Ben de dönüp Rabbime müracaat ettim. Ellinin yarısını indirdi. Musa'nın yanına geri dönünce, yine: Rabbine müracaat et dedi. Az önce söylediklerinin benzerini zikretti. Allah da onun da yarısını indirdi. Musa'ya geri dönüp ona haber verdim. Rabbine müracaat et, dedi. Senin ümmetin bunu kaldıramaz. Ben de dönüp Rabbime müracaat ettim. Şöyle buyurdu: Bunlar beştir ve ellidir. Benim nezdimde söz değişmez. Musa'ya geri döndüm, yine Rabbine müracaat et dedi. Ben: Artık Rabbime karşı yüzüm tutmuyor, dedim. Daha sonra es-Sidretu'l-Münteha'ya varıncaya kadar yoluna devam etti. Ne olduklarını bilemediğim renkler onun etrafını bürüdü. Sonra cennete girdirildim. Orada inciden çadırlar bulunduğunu, toprağının da misk olduğunu gördüm",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 3343,
			"arabicnumber": 3343,
			"text": "İbn Abbas r.a.'dan rivayete göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Ben (doğudan esen) saba rüzgarı ile yardıma mazhar oldum. Ad kavmi ise (batıdan esen) debur rüzgarı ile helak edildi",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 3344,
			"arabicnumber": 3344,
			"text": "Ebu Said r.a. dedi ki: Ali r.a. Nebi Sallallahu Aleyhi ve Sellem'e bir parçacık altın gönderdi. O da bunu şu dört kişi arasında paylaştırdı: el-Akra b. Habis el-Hanzali el-Mücaşi, Uyeyne b. Bedr el-Fezari, Nebhan oğullarından birisi olarak da sayılan Zeyd et-Tai ve Kilab oğullarından birisi olan Alkame b. Ulase el-Amiri. Kureyşlilerle, Ensar buna kızdılar ve: Necid'in ileri gelenlerine bir şeyler veriyor, buna karşılık bizi terk ediyor, dediler. Allah Resulü şöyle buyurdu: \"Ben sadece onların kalplerini ısındırmaya çalışıyorum. \" Gözleri içeri doğru çökmüş, yanakları kalkık, alnı çıkık, sakalı sık, (başını) traş etmiş birisi gelerek: Allah'tan kork ey Muhammed, dedi. Şöyle buyurdu: \"Ben ona karşı gelecek olursam Allah'a kim itaat eder ki? Allah yeryüzündekilere karşı bana güveniyor da, siz mi bana güvenmiyorsunuz?\" Bir adam -zannederim Halid b. el-Velid idi- bu adamı öldürmek için ondan izin istedi, fakat engelledi. Adam gidince, şöyle buyurdu: \"Bunun soyundan Kur'an'ı okudukları halde hançerelerinden aşağıya inmeyen, okun hedefi delip geçtiği gibi dinden çıkan, Müslümanları öldüren fakat putperestleri hallerine terk eden kimseler gelecektir. Andolsun onlara yetişecek olursam Ad kavminin öldürüldüğü gibi onları öldüreceğim. \" Tekrar: 3610, 4351, 4667, 5058, 6163, 6931, 6933, 7432, 5762",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 3345,
			"arabicnumber": 3345,
			"text": "Abdullah (b. Mes'ud)'dan dedi ki: Nebi Sallallahu Aleyhi ve Sellem'i: \"O halde var mı ibret alıp, düşünen ?\"[Kamer, 15] buyruğunu okurken dinledim",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 3346,
			"arabicnumber": 3346,
			"text": "Cahş kızı Zeyneb r.anha'dan rivayete göre Nebi Sallallahu Aleyhi ve Sellem onun yanına dehşete kapılmış bir halde girdi. Bu arada şöyle diyordu: \"La ilahe illallah, yaklaşmış bulunan bir şerden dolayı Arapların vay haline! Bugün Ye'cuc ile Me'cuc seddinden şunun gibi bir delik açıldı.\" -Bu arada baş parmağı ile şehadet parmağını halka yaptı.- Cahş kızı Zeynep dedi ki: \"Ey Allah'ın Resulü, dedim. Salih kimseler aramızda varken helak edilir miyiz? O: Fısk ve günahkarlık çoğalırsa evet, diye buyurdu.\" Tekrar: 3598, -7059 ve 7135 Diğer tahric: Buhari (3346, 3598, 7059, 7135); Müslim 2880 (1, 2); Nesai s-kübra (11249); Tirmizi (2187); İbni Mace (3953); Ahmed, Müsned (27413); İbn Hibban (327)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 3347,
			"arabicnumber": 3347,
			"text": "Ebu Hureyre r.a.'dan rivayete göre Nebi Sallallahu Aleyhi ve Sellem: \"Allah Ye'cuc ile Me'cuc seddinde bunun kadar bir delik açtı, diye buyurdu ve elini doksan gibi şekillendirdi.\" Tekrar: 7136",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 3348,
			"arabicnumber": 3348,
			"text": "Ebu Said el-Hudri r.a.'dan rivayete göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Yüce Allah: Ey Adem diye buyuracak. Adem: Buyur Allah'ım, huzurundayım. Hayır yalnız senin elindedir, diyecek. Cehennem ateşi kafilesini çıkar diyecek. Adem: Cehennem kafilesi ne demek, diye soracak. Yüce Allah şöyle buyuracak: Her bin'den dokuz yüz doksandokuz kişi. İşte o vakit küçük olanın saçları ağaracak. \"Her hamile yükünü bırakacak. Sen insanları sarhoş göreceksin. Halbuki onlar sarhoş değildirler, fakat Allah'ın azabı pek şiddetlidir. \" [Hac, 2] Ashab: Ey Allah'ın Resulü, dediler. Bu (binde bir olan o) tek kişiler arasına hangimiz girebilir ki? Şöyle buyurdu: Müjdeler olsun! Sizden bir kişi, Ye'cuc ile Me'cuc'den bin kişi. Daha sonra şöyle buyurdu: Nefsim elinde olan'a yemin ederim ki, ben sizin cennetliklerin dörtte biri olacağınızı ümit ediyorum. Biz tekbir getirdik. Bu sefer: Ben sizin cennetliklerin üçte biri olacağınızı ümit ediyorum, diye buyurdu. Biz yine tekbir getirdik. Bu sefer: Ben sizin cennetliklerin yarısı olacağınızı ümit ediyorum, dedi. Biz yine tekbir getirdik. Şöyle buyurdu: Sizler (sayınız itibariyle) insanlar arasında ancak beyaz bir öküzün derisindeki siyah bir kıl'a yahut da siyah bir öküzün derisindeki beyaz bir kıl'a benzersiniz. \" Tekrar: 4741, 6530, 7483",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 3349,
			"arabicnumber": 3349,
			"text": "İbn Abbas r.a.'dan rivayete göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Sizler çıplak ayaklı, elbisesiz ve sünnetsiz olarak haşredileceksiniz.\" Daha sonra yüce Allah'ın: \"İlk yaratmaya başladığımız gibi onu tekrar iade ederiz. Biz bunu vaad edip üzerimize almıştık. Şüphesiz yapanlar bizleriz. \"[Enbiya, 104] buyruğunu okudu. (Devamla şöyle buyurdu): \"Kıyamet gününde kendisine elbise giydirilecek ilk kişi İbrahim olacaktır. Ashabımdan bir takım insanlar alınıp, sol tarafa doğru götürülecek. Ben: Ashabım, Ashabım, diyeceğim. Bana: Bunlar kendilerinden ayrıldığından beri ökçeleri üzerine gerisİn geri irtidad edip durdular, denilecek. Bu sefer ben de salih kulun dediği gibi: \"Ben aralarında bulunduğum müddetçe üzerlerinde bir şahit idim. Beni aralarından aldıktan sonra artık onlar üzerinde gözetleyici sen oldun ... Şüphe yok ki sen aziz ve hakim olansın. \"[Maide, 117] diyeceğim . Tekrar: 3447, 4625, 4626, 4740, 6524, 6525, 6526 Diğer tahric edenler: Tirmizi Tefsirul Kur’an; Müslim, Cennet",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 3350,
			"arabicnumber": 3350,
			"text": "Ebu Hureyre r.a.'dan rivayete göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Kıyamet gününde İbrahim, babası Azer ile karşılaşacaktır. Babası Azer'in yüzünde dumanın siyahlığı ve toz olacaktır. İbrahim ona: Ben sana bana isyan etme, dememiş miydim diyecek, babası: İşte bugün sana karşı gelmeyeceğim, diyecek. Bu sefer İbrahim şöyle diyecek: Rabbim, sen bana kıyamet günü diriltilecekleri günde beni rüsvay etmeyeceğini vaad etmiştin. Rahmetinden uzak olasıca babamın bu halinden daha büyük bir rüsvaylık olabilir mi? Yüce Allah şöyle buyuracak: Gerçek şu ki, ben cenneti kafirlere haram ettim. Daha sonra şöyle denilecek: Ey İbrahim, ayaklarının altında ne var? Bakınca ne görsün? Orada çok kıllı, çamura bulanmış bir sırtlan görmesin mi? Ayaklarından tutulup cehennem ateşine atılacak. \" Tekrar: 4768, 4769",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 3351,
			"arabicnumber": 3351,
			"text": "İbn Abbas r.a dedi ki: Nebi Sallallahu Aleyhi ve Sellem Ka'be'ye girdi. İçinde İbrahim'in ve Meryem'in suretlerini bulunca şöyle buyurdu: \"Onlar meleklerin içinde suret bulunan hiçbir eve girmediğini işitmişlerdir. Bu İbrahim'in bir suretidir. O, ne diye fal oklarıyla kısmet arasın ki?",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 3352,
			"arabicnumber": 3352,
			"text": "İbn Abbas r.a.'dan rivayete göre Nebi Sallallahu Aleyhi ve Sellem Ka'be'de suretleri görünce emir verip, o suretler silinmedikçe içeriye girmedi. İbrahim ve İsmail'i -ikisine de selam olsun- ellerinde fal okları bulunduğu halde (suretleri yapılmış) gördü. Bunun üzerine şöyle buyurdu: \"Allah kahretsin onları! Allah'a yemin olsun ki her ikisi de asla fal oklarıyla kısmet aramamışlardır",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 3353,
			"arabicnumber": 3353,
			"text": "Ebu Hureyre r.a.'dan rivayete göre: \"Ey Allah'ın Resulü insanların en kerimi kimdir diye soruldu. O: En takvalılarıdır, diye buyurdu. Bizim sana sorduğumuz bu değil, dediler. O halde Allah'ın Halilinin oğlu, Allah'ın Nebisinin oğlu, Allah'ın Nebisi Yusuftur, dedi. Yine: Bizim sana sorduğumuz bu değildir, dediler. Bu sefer: Siz bana Arapların madenleri (neseblerinin asılları) hakkında (mı) soruyorsunuz? Onların cahiliye döneminde hayırlı olanları, fıkhetmeleri (dini iyi bilmeleri) şartıyla İslamda da hayırlılarıdır, diye buyurdu.\" Tekrar: 3274, 3383, 3490, 4689",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 3354,
			"arabicnumber": 3354,
			"text": "Semure dedi ki: Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Bu gece (rüyamda) bana iki kişi geldi. Uzunluğundan dolayı neredeyse başını göremeyeceğim kadar uzunca bir adamın yanından geçtim. O İbrahim Sallallahu Aleyhi ve Sellem'di",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 3355,
			"arabicnumber": 3355,
			"text": "Mücahid'den rivayete göre İbn Abbas r.a.'a: (Nebi'in) Deccal'in iki gözü arasında kafir -yahut da ke, fe re ك ف ر yazdığını (söylediğini) zikrettiler.- O, dedi ki: Ben bunu duymadım fakat o(nun) şöyle buyurdu(ğunu dinlemişimdirı: \"İbrahim'e gelince, sizin bu arkadaşınıza bakınız. Musa'yı ise eti sıkı, esmerce, liften yuları bulunan kırmızı bir devenin üzerinde vadiden aşağı inerken görüyor gibiyim)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 3356,
			"arabicnumber": 3356,
			"text": "Ebu Hureyre r.a. dedi ki: Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"İbrahim aleyhisselam seksen yaşında iken el-Kaddum denilen yerde sünnet olmuştur.\" Ebu'z-Zinad, dal harfi şeddesiz olarak. \"el-Kadum\" diye rivayet etmiştir. Tekrar: 6298",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 3357,
			"arabicnumber": 3357,
			"text": "Bize Ebu'z-Zinâd, şeddesiz olarak \"Kadûm’la\" diye tahdîs etti. Bu hadîsi Ebu'z-Zinâd'dan rivayet etmekte Abdurrahmân ibnu İshâk, Şuayb'e mutâbaat etmiştir. bunu Ebû Hureyre'den rivayet etmekte Şuayb'e yahut Abdurrahmân ibn İshâk'a Aclân mutâbaat etmiştir. yine bu hadîsi Muhammed ibn Amr da Ebû Seleme'den; o da Ebû Hureyre'den olmak üzere rivayet etmiştir",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 3358,
			"arabicnumber": 3358,
			"text": "Ebu Hureyre r.a. dedi ki: Resulullah Sallallahu Aleyhi ve Sellem şöyle' buyurdu: \"İbrahim aleyhisselam sadece üç tane yalan söylemiştir.\" [-3358-] Ebu Hureyre r.a. dedi ki: İbrahim aleyhisselam yalnızca üç tane yalan söylemiştir. Bunların ikisi yüce Allah için idi. \"Ben hastayım\" buyruğu ile \"hayır bu işi onların bu büyükleri yaptı\" sözleridir. Devamla şöyle buyurdu: Bir gün Sara ile birlikte zorbalardan birisinin bulunduğu yere gitti. O zorbaya: Burada bir adam var, onunla beraber en güzellerinden bir kadın vardır, denildi. Ona (bir elçiyle) haber gönderdi. Kadının kim olduğunu sordu. Bu kimdir, dedi. İbrahim: Kızkardeşimdir dedi. Sara'nın yanına gidince: Ey Sara dedi, yeryüzünde benden ve senden başka mu'min kimse yoktur. Bu bana senin kim olduğunu sordu. Ben de ona kızkardeşimdir, dedim. Beni yalancı çıkarma. Zorba, Sara'ya haber gönderdi. Sara onun yanına girince, eliyle onu yakalamak istedi, fakat bunu yapamadı. Bu sefer: Benim için Allah'a dua et, benim sana zararım olmayacak, dedi. Sara Allah'a dua edince, eli eski haline geldi. İkinci bir defa onu yakalamak istedi yine bir önceki gibi, hatta daha da şiddetli bir şekilde ona engelolundu. Yine: Benim için Allah'a dua et, sana zararım olmayacak dedi. Sara da Allah'a dua edince eski haline döndü. Bu sefer yakın görevlilerinden birisini. çağırarak dedi ki: Siz bana bir insan getirmediniz. Bana bir şeytan getirdiniz. Daha sonra ona hizmet etmek üzere Hacer'i verdi. Sara, İbrahim'in yanına vardığında namaz kılıyordu. Eliyle işaret ederek: Ne oldu diye sordu. Sara: Allah, o kafirin -yahut facirin (günahkarın)tuzağını başına geçirdi ve Hacer'i de (bana) hizmetçi verdi, dedi.\" Ebu Hureyre dedi ki: \"Ey yağmurun çocukları işte anneniz budur",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 3359,
			"arabicnumber": 3359,
			"text": "Ümmü Şerik r.anha'dan rivayete göre Resulullah Sallallahu Aleyhi ve Sellem, kelerin öldürülmesini emredip, şöyle buyurdu: \"O, İbrahim aleyhisselam'a karşı ateşi üffüyordu",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 3360,
			"arabicnumber": 3360,
			"text": "Abdullah r.a.'dan dedi ki: \"İman eden ve imanlarına zulüm karıştırmayanlar ... \"[En'am, 82] buyruğu nazil olunca, bizler: Ey Allah'ın Resulü, hangimiz nefsine zulmetmez ki, dedik. O şöyle buyurdu: \"Durum dediğiniz gibi değildir. \"İmanlarına zulüm bulaştırmayanlar\"dan kasıt, şirk karıştırmayanlardır. Hem siz Lukman'ın oğluna: \"Oğulcuğum Allah'a şirk koşma. Muhakkak şirk büyük bir zulümdür. \"[Lukman, 13] dediğini duymadınız mı?",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 3361,
			"arabicnumber": 3361,
			"text": "Ebu Hureyre r.a. dedi ki: Nebi Sallallahu Aleyhi ve Sellem'e bir gün bir miktar et getirildi. Şöyle buyurdu: \"Şüphesiz Allah kıyamet gününde öncekileri de, sonrakileri de aynı düzlükte bir araya getirecektir. Davetçi onlara sözlerini işittirir, göz de onları görür. Güneş onlara yaklaşır -deyip, şefaat hadisini zikretti. Devamında dedi ki-: İbrahim'e giderler ve sen Allah'ın Nebisi, yeryüzündeki halilisin, Rabbinin huzurunda bizim için şefaat et, derler. O da onlara der ki: - ... deyip, kendisinin onlara vaktiyle söylemiş olduğu yalanları zikretti-: \"Ben kendimi kurtarmaya bakıyorum kendimi. Siz Musa'nın yanına gidiniz.\" Bu rivayette, Enes de Nebi Sallallahu Aleyhi ve Sellem'den diyerek ona (Ebu Hureyre'ye) mutabaat etmiştir",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 3363,
			"arabicnumber": 3363,
			"text": "",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 3364,
			"arabicnumber": 3364,
			"text": "Said b. Cubeyr'den rivayete göre İbn Abbas dedi ki: \"Kadınlar arasında ilk kuşak bağlayan İsmail'in annesidir. O Sara'ya izini kaybettirmek için bir kuşak edinmişti. Daha sonra İbrahim onu ve süt emzirmekte olduğu oğlu İsmail'i getirip Beytin yanında mescidin yukarılarında Zemzem'in üzerinde büyükçe bir ağacın yanında yerleştirdi. O gün Mekke'de kimse yoktu. Orada su da bulunmuyordu, fakat her ikisini de orada bıraktı. Yanlarında da içinde biraz hurma bulunan bir torba ve içinde bir miktar su bulunan bir kırba bıraktı. Daha sonra İbrahim geri dönüp gitti. İsmail'in annesi arkasından giderek: Ey İbrahim! Hiçbir şeyin bulunmadığı bu vadide bizi bırakıp nereye gidiyorsun, dedi. Ona bu sözlerini birkaç defa söyledi. İbrahim dönüp ona bakmıyordu. Ona: Sana bunu Allah mı emretti, diye sordu. İbrahim: Evet dedi. İsmail'in annesi: O vakit o bizi sahipsiz bırakmayacaktır, deyip, geri döndü. İbrahim yoluna devam etti. Nihayet onu göremeyecekleri tepenin yanına varınca yüzünü Ka'be'ye çevirerek ellerini yukarıya kaldırıp: \"Rabbimiz, ben zürriyetimden bir kısmını senin mukaddes Ev'inin yanında ekin bitmez bir vadiye yerleştirdim ... Şükrederler diye.\"[İbrahim, 37] diye dua etti. İsmail'in annesi İsmail'i emzirmeye ve o sudan içmeye başladı. Nihayet kırbadaki su bitti. Kendisi de susadı, oğlu da susadı. Susuzluktan kıvranan ve kendisini yerden yere atan oğluna bakıp durdu. Onu görmek istemediğinden yanından kalkıp gitti. Bulunduğu yere Safa'nın en yakın bir tepe olduğunu gördü. Onun üzerinde ayağa dikildi, daha sonra vadiye yönelip kimseyi görür mü yüm diye baktı, kimseyi göremedi. Safa'dan indi, vadiye ulaştı. Elbisesinin ucunu eliyle kaldırdı, sonra da oldukça yorgun bir kimsenin koşuşu ile koştu. Nihayet vadiyi geçti. Merve'ye geldi. Merve'nin üstünde ayağa kalktı, kimseyi görür müyüm diye baktı, kimseyi göremedi. Bu işi yedi defa yaptı. İbn Abbas dedi ki: Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: İşte insanların bu iki tepe arasındaki sa'yi böyle başladı. Merve'ye çıkınca bir ses duydu. -Kendi kendisine-: Sus, dedi. Sonra da etrafa kulak kabarttı ve dedi ki: Sen sesini duyurmuş oldun, eğer imdadımıza yetişebileceksen (gel). Bir de ne görsün? Melek Zemzem'in bulunduğu yerde duruyor. Topuğu ile yeri eşti -yahut kanadı ile böyle yaptı- ve nihayet su çıktı. O da suyun önünde çukur açmaya başladı ve eliyle şöyle yaparak sudan avuçlayıp, kırbasına doldurmaya koyuldu. O avuçladıkça suda kaynayıp duruyordu. İbn Abbas dedi ki: Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: Allah İsmail'in annesine rahmet ihsan buyursun. Eğer Zemzem'i bıraksaydı -ya da: Sudan auuçlamamış olsaydı, diye buyurdu- Zemzem yer üzerinde akan bir pınar olurdu. (Devamla) dedi ki: Kendisi de içti, oğluna da süt emzirdi. Melek ona: Telef olmaktan korkmayınız. Bu çocuk babası ile birlikte burada Allah'ın Ev'ini bina edeceklerdir. Şüphesiz Allah da kendi ehlini telef etmez, dedi. Beyt (Ka'be'nin yeri) bir tepeyi andırır şekilde yerden tümsekçe idi. Akan seller gelip sağından, solundan toprak götürüyordu. İsmail'in annesi bu haliyle kaldı. Nihayet Cürhümlülerden bir arkadaş grubu -yahut da Cürhümlü bir aile halkı- Keda yolundan onlara doğru geldiler. Mekke'nin alt tarafında konakladılar. Suyun bulunduğu yerlerde uçan bir kuş gördüler. Dediler ki: Şüphesiz bu kuş suyun olduğu bir yerde uçar, döner durur. Bizim de bildiğimiz kadarıyla bu vadide su bulunmamaktadır. Bu sebeple bir ya da iki kişiyi görevlendirip gönderdiler. Onlar da gidip arkadaşlarına su bulunduğu haberini verdiler. Arkadaşları da geldiler. (İbn Abbas) dedi ki: İsmail'in annesi de suyun yanında bulunuyordu. Ona: Senin yakınında konaklamamıza izin verir misin, dediler. Onlara: Evet, ama su da bir hakkınız yok, diye cevap verdi. Onlar da kabul dediler. İbn Abbas dedi ki: Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: Onların bu izin istemeleri İsmail'in annesinin başkaları ile de teselli bulmayı arzu ettiği bir zamana denk gelmişti. Cürhümlüler gelip konakladılar. Ondan sonra da akrabalarına haber gönderdiler. Akrabaları da gelip onlarla birlikte konakladılar. Sonunda orada Cürhümlülerden bazı aileler buldu., Çocuk gençlik yaşına erişti. Onlardan Arapça'yı öğrendi. Gençlik yaşına erişince bunlar ondan hoşlandılar ve onu beğendiler. Olgunluk yaşına gelince, kendilerinden bir hanımla onu evlendirdiler. İsmail'in annesi vefat etti. İsmail'in evlenmesinden sonra İbrahim gelip, geride bıraktıklarının halini görmek istedi. İsmail'i bulamadı. Hanımına kocasını sordu. Hanımı: Bizim için bir şeyler almak üzere çıktı, diye cevap verdi. Daha sonra hanımına geçimlerini, hallerini sordu. Hanımı: Kötü bir haldeyiz, darlık ve sıkıntı içindeyiz, deyip ona şikayette bulundu. İbrahim dedi ki: Kocan gelirse ona selam söyle ve kendisine kapısının eşiğini değiştirmesini söyle. İsmail gelince bir şeyler hisseder gibi olduğundan: Kimse geldi mi, diye sordu, hanımı evet dedi. Bize şöyle şöyle bir yaşlı geldi. Bize seni sordu. Ben de ona söyledim. Geçimimizin nasıl olduğunu da sordu, ben de kendisine darlık ve sıkıntı içerisinde olduğumuzu bildirdim. İsmail: Sana her hangi bir tavsiyede bulundu mu, diye sordu. Hanımı: Evet dedi. Bana sana selam söylememi söyledi ve kapının eşiğini değiştir, dedi. İsmail dedi ki: O kişi benim babamdır. Bana da senden ayrılmamı emretti. Haydi, ailenin yanına git, deyip onu boşadı. Cürhümlülerden bir başka kadın ile evlendi. İbrahim Allah'ın dilediği kadar bir süre yanlarına geri dönmedi. Sonraları yanlarına geldi. Yine İsmail'i bulamadı. Hanımının yanına gitti, ona İsmail'i sordu. Bizim için bir şeyler aramak üzere çıktı, dedi. Nasılsınız deyip, ona geçimlerini, durumlarını sordu. Hanımı: İyi haldeyiz, bolluk içindeyiz, dedi ve Allah'a hamdetti. Ona ne yersiniz, diye sordu. Et, dedi. Ne içersiniz diye sordu, su dedi. Bunun üzerine İbrahim şu duayı yaptı: Allah'ım, onlar için eti ve suyu bereketli kıl! Nebi Sallallahu Aleyhi ve Sellem (devamla) buyurdu ki: O gün için (buğday ve bu gibi) taneli şeyleri yoktu. Eğer bu taneli şeyler olsaydı, onlar hakkında da kendilerine dua ederdi. (Devamla) buyurdu ki: Bu sebeple Mekke dışında herhangi bir kimse sırf onları yiyip içecek olursa onu uygun görmezler. İbrahim dedi ki: Kocan gelirse ona selam söyle ve kendisine evinin eşiğini sağlamlaştırmasını emret. İsmail gelince: Yanınıza kimse geldi mi, diye sordu, hanımı: Evet, bize güzel görünümlü bir yaşlı adam geldi, deyip ondan övgüyle söz etti. Bana seni sordu, ben de ona söyledim. Nasıl yaşadığımızı sordu, ben de iyi ve bolluk içerisinde olduğumuzu söyledim .. İsmail: Sana bir tavsiyesi oldu mu, diye sordu. Hanımı: Evet dedi. Sana selamı var ve sana kapının eşiğini sağlamlaştırmanı istiyor. İsmail, o gelen babamdır, eşikten kastı da sensin. Seni nikahım altında tutmama devam etmemi emretti, dedi. Allah'ın dilediği kadar bir süre daha yanlarına gelmedi. Bundan sonra geldiğinde İsmail, Zemzem'e yakın büyükçe bir ağacın altında oklarını sivriltmekle uğraşıyordu. Babasını görünce, kalktı ve babanın evladına, evladın babasına yaptığı gibi birbirlerini karşıladılar. Daha sonra: Ey İsmail, dedi. Allah bana bir emir vermiş bulunuyor. İsmail: Rabbinin sana emrettiğini yap, dedi. İbrahim: Bana yardım edecek misin, diye sordu. İsmail: Sana yardım edeceğim, dedi. İbrahim dedi ki: Allah bana burada bir ev yapmamı emretti -ve etrafına göre daha yüksekçe bir yere işaret etti.- (Nebi Sallallahu Aleyhi ve Sellem devamla) buyurdu ki: İşte o vakit Evin temellerini yükselttiler. İsmail taş getiriyor, İbrahim de bina ediyordu. Nihayet bina yükselince şu taşı getirdi ve onun için yere bıraktı. İbrahim de binayı yükseltmek üzere onun üzerine Çıktı. İsmail de ona taş uzatıyordu. Her ikisi birlikte: \"Rabbimiz, bizden kabul buyur. Şüphesiz sen her şeyi işitensin, hakkıyla bilensin. \"[Bakara,127] diyorlardı. Onlar binayı yaparlarken Beyt'in etrafında dönüyorlar ve: \"Rabbimiz bizden kabul buyur çünkü sen her şeyi işitensin, herşeyi bilensin\" diyorlardı",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 3365,
			"arabicnumber": 3365,
			"text": "İbn Abbas r.a. dedi ki: İbrahim ile hanımı arasında olanlar olunca İsmail ile birlikte çıkıp gitti. Beraberlerinde içinde su bulunan, derisi kurumuş bir kırba vardı. İsmail'in annesi kırbadan su içiyordu. Böylelikle çocuğuna süt oluyordu. Nihayet Mekke'ye varınca onu bir ağacın altına bıraktı. Daha sonra İbrahim hanımının yanına geri döndü. İsmail'in annesi arkasından gitti. Nihayet Keda denilen yere vardıklarında arkasından İbrahim'e şöyle seslendi: Ey İbrahim, bizi kime bırakıyorsun? Allah'a dedi. İsmail'in annesi: Bizi Allah'a bırakmana razıyım, dedi. Daha sonra geri döndü. Kırbadan su içiyor, çocuğuna süt oluyordu. Nihayet su bitince gidip de bir baksam; belki bir kimseyi fark ederim, dedi. Gidip Safa tepesine çıktı. Kimseyi görür müyüm diye bakındı, durdu. Hiç kimseyi göremedi. Vadiye gelince, sa'y etti ve Merve'ye kadar geldi. Aynı işi birkaç şavt (tur) tekrarladı. Sonra kendi kendisine şöyle dedi: Gidip de ne yaptığını bir görsem -kastettiği çocuğu idi-o Gidip, baktığında onu, ölüm dolayısıyla hırıltılı soluyor gibi gördü. Nefsi kendisine rahat vermedi. Kendi kendisine gidip bir baksam, belki birilerinin varlığını fark ederim, dedi. Kalkıp Safa'nın üzerine çıktı. Etrafına bakıp durdu, kimseyi göremedi. Nihayet (gidiş gelişini) yediye tamamladı. Arkasından: Gitsem de çocuğun ne yaptığını bir görsem, dedi. Aniden bir ses duydu. Eğer sende bir hayır varsa imdadımıza yetiş, dedi. Cibril ile karşılaşıverdi. Topuğuyla şöyle yaptı ve topuğunu yere vurdu. Oradan su fışkırdı. İsmail'in annesi dehşete kapıldı. O da suyu toplamaya başladı. (İbn Abbas) dedi ki: Ebu'I-Kasım Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: Eğer onu bırakmış olsaydı su açıktan akacaktı. Dedi ki: Su içmeye başladı, çocuğa da süt geldi. Cürhümlülerden bir takım kimseler vadinin iç tarafından geçerken bir kuşun uçtuğunu fark ettiler. Bunu garip karşılar gibi oldular ve kuş ancak su olan yerde bulunur, dediler. Bunun üzerine elçilerini gönderdiler, o da duruma baktı. Su olduğunu anladılar. Elçi yanlarına gelip onlara haber verdi. Onlar da İsmail'in annesinin yanına gelip: Ey İsmail'in annesi seninle birlikte kalmamıza yahut seninle beraber yerleşmemize izin verir misin? Oğlu olgunluk yaşına geldi, onlardan bir kadın ile nikahlandı. Daha sonra İbrahim hatırına gelen düşünce ile hanımına: Ben gidip bıraktıklarımın durumunu göreceğim, dedi. Geldi, selam verdi. İsmail nerede, diye sordu. İsmail'in hanımı: Avlanmaya gitti, dedi. İbrahim: Geldiği vakit ona: Kapının eşiğini değiştir, dedi. Hanımı ona durumu haber verince İsmail: O (eşik) dediği sensin. Haydi, ailenin yanına git, dedi. Daha sonra yine İbrahim'in hatırına gelen' bir düşünce üzerine hanımına: Ben geride bıraktıklarıma gidip bakacağım, dedi ve yanlarina geldi. İsmail nerede, diye sordu. Hanımı: Avlanmaya gitti, dedi. Hanımı: İnip bir şey yemez, içmez misin, dedi. İbrahim: Ne yer, ne içersiniz, diye sordu. Hanımı: Biz et yeriz, su içeriz. İbrahim dedi ki: Allah'ım, onların yediklerini de, içtiklerini de onlara mübarek kıL. (İbn Abbas) dedi ki: Ebu'I-Kasım Sallallahu Aleyhi ve Sellem şöyle buyurdu: İşte bu, İbrahim'in duasının bereketidir. (Devamla) dedi ki: Daha sonra yine İbrahim hatırına gelen düşünce üzerine hanımına: Gidip de geride bıraktıklarıma bir bakayım, dedi. Geldiğinde İsmail ile Zemzem'in arka tarafında rastlaştılar. İsmail, oklarını düzeltiyordu. Ey İsmail, dedi, Rabbim bana kendisi için bir ev bina etmemi buyurdu. İsmail: Rabbine itaat et, dedi. O bana bu işte senin de bana yardımcı olmanı emretti, dedi. İsmail: O zaman ben de yardım ederim dedi -ya da bunun gibi bir söz söyledi.- Her ikisi de kalktı, İbrahim bina yapmaya, İsmail de ona taş uzatmaya başladı. Her ikisi de: \"Rabbimiz bizden kabul buyur. Çünkü sen her şeyi işitensin, her şeyi bilensin\" diyorlardı",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 3366,
			"arabicnumber": 3366,
			"text": "Ebu Zer' r.a. dedi ki: \"Ey Allah'ın Resulü! Yeryüzünde ilk yapılan mescid hangisidir? Resulullah Sallallahu Aleyhi ve Sellem: Mescid-i Haram'dır, diye buyurdu. Ben: Sonra hangisidir, diye sordum. O: Mescid-İ Aksa'dır, dedi. Peki, ikisi arasında ne kadar bir zaman var, diye sordum. Kırk yıl, buyurdu. Hem namaz vakti nerede iken girerse orada namazını kılıver. Çünkü fazilet ondadır. \" Tekrar: 3425",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 3367,
			"arabicnumber": 3367,
			"text": "Enes b. Malik r.a.'dan rivayete göre Resulullah Sallallahu Aleyhi ve Sellem Uhud dağını görünce: \"Bu bizi seven, bizim de kendisini sevdiğimiz bir dağdır. Allah'ım, İbrahim Mekke'yi haram belde yaptı. Ben de onun (Medine'nin) Labe diye bilinen iki kara taşfığı arasını haram ilan ediyorum",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 3368,
			"arabicnumber": 3368,
			"text": "Nebi s.a.v.'in zevcesi Aişe r.anha'dan rivayete göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Bilmez misin senin kavmin, Ka'be'yi (tamir edip yeniden) bina ettiklerinde İbrahim'in temellerine göre geriye çektiler.\" Ben: Ey Allah'ın Resulü, sen onu tekrar İbrahim'in temelleri üzere yenilemeyecek misin? diye sordum. \"Eğer senin kavmin henüz küfürden yeni kurtulmamış olsaydı (olabilirdi)\" diye buyurdu. Abdullah b. Ömer dedi ki: Eğer Aişe, bunu gerçekten Resulullah Sallallahu Aleyhi ve Sellem'den işitmiş ise, görüşüm odur ki, Resulullah Sallallahu Aleyhi ve Sellem'in Hicr'e bitişik olan iki rüknü istilam etmeyi terk edişinin sebebi, Beyt'in İbrahim'in temelleri üzere tamamlanmamış olmasından başkası değildir",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 3369,
			"arabicnumber": 3369,
			"text": "Ebu Humeyd es-Saidi r.a.'dan rivayete göre: Ey Allah'ın Resulü, Sana nasıl salavat getirelim? dediler. Allah Resulü şöyle buyurdu: \"Allahumme salli ala Muhammedin ve ezvacihi ve zürriyetihi kema sallayte ala ali İbrahim. Ve barik ala Muhammedin ve ezvacihi ve zürriyetihi kema barekte ala ali İbrahim. İnneke Hamidun Mecid. \" SALAVAT MEALİ: Allah'ım, İbrahim'in aline salavat getirdiğin gibi, Muhammed'e, onun eşlerine ve zürriyetine salat eyle. İbrahim'in aline bereketler ihsan ettiğin gibi Muhammed'e, onun eşlerine ve zürriyetine de bereketler ihsan eyle. Şüphesiz ki sen Hamidsin, Mecidsin. \" Tekrar: 6360",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 3370,
			"arabicnumber": 3370,
			"text": "Abdurrahman b. Ebi Leyla'dan dedi ki: Ka'b b. Ucre ile karşılaştım. Dedi ki: Nebi Sallallahu Aleyhi ve Sellem'den işitmiş olduğum bir hediyeyi hediye olarak sana vereyim mi? Ben: Tabi, onu bana hediye olarak ver, dedim. Dedi ki: Resulullah (Sallallahu aleyhi ve Sellem'e şunu sorduk: Ey Allah'ın Resulü, siz ehl-i beyte salavat nasıl olur? Çünkü Allah bize nasıl selam söyleyeceğimizi öğretti. Şöyle buyurdu: \"Allahumme salli ala Muhammedin ve ala ali Muhammed; kema salleyte ala İbrahime ve ala ali İbrahim; inneke Hamidun Mecid. Allahumme barik ala Muhammedin ve ala ali Muhammed; kema barekte ala İbrahime ve ala ali İbrahim, inneke Hamidun Mecid: deyin. \" SALAVAT MEALİ: Allah'ım, İbrahim'e ve İbrahim'in aline salat getirdiğin gibi, Muhammed'e ve Muhammed'in aline de salat getir. Çünkü sen Hamidsin, Mecidsin. Allah'ım, İbrahim'e ve İbrahim'in aline bereketler ihsan ettiğin gibi, Muhammed'e ve Muhammed'in aline de bereketler ihsan eyle. Çünkü sen Hamidsin Mecidsin, Tekrar: 4797 ve 6357)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 3371,
			"arabicnumber": 3371,
			"text": "İbn Abbas r.a.'dan dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem el-Hasen ve el-Huseyn'e okuyup üflüyor ve şöyle diyordu: Şüphesiz babanız bunlarla İsmail ve İshak'a da okuyup üflüyordu: Euzu bi kelimatillahi’ttammeh min kulli şeytanin ve hammeh ve min kulli aynin lammeh: '' Meali: Bütün şeytanlardan ve tüm zehirli haşerattan, insana zarar ve musibet celbeden her bir göz den Allah'ın eksiksiz kelimelerine sığınırım",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 3372,
			"arabicnumber": 3372,
			"text": "Ebu Hureyre r.a.'dan rivayete göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Şüpheye düşmek İbrahim'den çok bizim hakkımızdır. Çünkü o: \"Rabbim ölüleri nasıl dirilttiğini bana göster demişti. İnanmadın mı yoksa diye buyurdu. O da: İnandım, fakat kalbimin mutmain olması için (soruyorum) demişti.\"[Bakara,260] Bir de Allah Lut'a rahmetini ihsan eylesin. O esasen pek güçlü bir yere sığınıyordu ve eğer Yusuf'un kaldığı kadar-uzun bir süre hapiste kalmış olsaydım, çağıran kişinin o çağrısını kabul edecektim. \" Tekrarı: 3375,3387,4537,4694 ve 6992",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 3373,
			"arabicnumber": 3373,
			"text": "Seleme b. el-Ekva' r.a dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem, Eslem oğullarından ok atma yarışı yapan birkaç kişinin yanından geçti. Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: Ey İsmail oğulları, ok atınız. Çünkü sizin babanız da ok atıcısı idi. Haydi atınız ve ben filan oğullarıyla beraberim. (Seleme) dedi ki: Ve iki takımdan birisinin ellerini tuttu. Resulullah Sallallahu Aleyhi ve Sellem: Ne oluyor size, niye atmıyorsunuz, deyince onlar: Ey Allah'ın Resulü, sen onlarla beraberken nasıl atarız, dediler. Bu sefer: Atınız, ben hepinizle beraberim, diye buyurdu",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 3374,
			"arabicnumber": 3374,
			"text": "Ebu Hureyre r.a., dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem'e: İnsanların en kerimi kimdir, diye soruldu. O: İnsanların en kerimi, en takvalı olanlardır, diye cevap verdi. Onlar: Ey Allah'ın Nebii, bizim sana sormak istediğimiz bu değildir, dediler. Bu sefer şöyle buyurdu: İnsanların en kerimi, Allah'ın halilinin oğlu, Allah'ın Nebiinin oğlu, Allah'ın Nebiinin oğlu, Allah'ın Nebii Yusuf'dur. Yine: Bizim sana sorduğumuz bu değildir, dediler. Bunun üzerine: Yoksa siz bana Arapların cevherleri (nesebleri) hakkında mı soruyorsunuz, diye sordu. Evet, dediler. Şöyle buyurdu: Cahiliye döneminde en hayırlı olanlarınız, fakih olmaları şartıyla İslam'da da en hayırlılarınızdır",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 3375,
			"arabicnumber": 3375,
			"text": "Ebu Hureyre r.a.'dan rivayete göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Allah Lut'a mağfiret buyursun. Şüphesiz o pek güçlü bir yere (zaten) sığınıyordu",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 3376,
			"arabicnumber": 3376,
			"text": "Abdullah r.a.'dan dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem: \"Fe hel min muddekir: O halde var mı ibret alıp düşünen?\" diye okumuştur",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 3377,
			"arabicnumber": 3377,
			"text": "Abdullah b. Zem'a dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem'i -(Salih kavminin) dişi devesinin kesilmesini sözkonusu ederken- şöyle buyurduğunu dinledim: O dişi deveyi kesmeye kavmi arasında güçlü ve kendisine zarar verilemeyen Ebu Zem'a'ya benzeyen birisi kalkıştı. \" Tekrar: 4942, 5204, 6042",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 3378,
			"arabicnumber": 3378,
			"text": "İbn Ömer r.a.'dan rivayete göre \"Resulullah Sallallahu Aleyhi ve Sellem Tebuk gazvesinde Hicr denilen yerde konaklayınca onlara oranın kuyusundan su içmemelerini ve ordan su çekmemelerini emretti. Ona: Biz ordan aldığımız suyla hamur yoğurduk, su doldurduk denilince, kendilerine o hamuru atmalarını ve o suyu dökmelerini emretti.\" Ebu'ş-Şumus'dan gelen rivayete göre de Nebi Sallallahu Aleyhi ve Sellem yemeğin atılmasını emretti. Ebu Zer', Nebi Sallallahu Aleyhi ve Sellem'den: \"Onun suyuyla hamuru yoğuran ... \" diye buyurduğunu rivayet etmiştir. Tekrar: 3379",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 3379,
			"arabicnumber": 3379,
			"text": "Abdullah b. Ömer r.a.'dan rivayete göre Müslümanlar, Resulullah Sallallahu Aleyhi ve Sellem ile birlikte Semud diyarı el-Hicr denilen yerde konakladılar. Kuyusundan su çektiler ve o su ile hamur yoğurdular. Resulullah Sallallahu Aleyhi ve Sellem de kendilerine kuyularından çektikleri suları dökmelerini, hamuru da develerine yedirmelerini emretti. Kendilerine dişi devenin gidip su içtiği pınardan su almalarını emretti",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 3380,
			"arabicnumber": 3380,
			"text": "Salim b. Abdullah'ın babasından r.a. rivayet ettiğine göre Nebi Sallallahu Aleyhi ve Sellem Hicr'den geçerken şöyle buyurdu: \"Zulmedenlerin kaldıkları yerlere onlara isabet eden size isabet etmesin diye ancak ağlayanlar olarak giriniz.\" Daha sonra bineğin üzerinde olduğu halde elbisesi ile iyice örtündü",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 3381,
			"arabicnumber": 3381,
			"text": "İbn Ömer dedi ki:. Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Onlara isabet edenin bir benzerinin size isabet etmemesi için kendilerine zulmedenlerin yurtlarına ancak ağlayanlar olarak giriniz",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 3382,
			"arabicnumber": 3382,
			"text": "İbn Ömer r.a.'dan rivayete göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Kerim oğlu, kerim oğlu, kerim olan kişi, İbrahim oğlu İshak oğlu Yakub oğlu Yusufdur. Hepsine selam olsun. \" Tekrar: 3390, 4688",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 3383,
			"arabicnumber": 3383,
			"text": "Ebu Hureyre r.a.'dan rivayete göre Resulullah Sallallahu Aleyhi ve Sellem'e, insanların en kerimi kimdir, diye soruldu. O: \"Allah'a karşı en takvalı olanlardır\" diye cevap verdi. Bizim sana sorduğumuz bu değildir, dediler. Bu sefer: \"İnsanların en kerimi Allah'ın halilinin oğlu, Allah'ın Nebiinin oğlu, Allah'ın Nebiinin oğlu ve kendisi de Allah'ın Nebii olan Yusuftur\" diye buyurdu. Yine: Bizim sana sorduğumuz bu değildir, dediler. Şöyle buyurdu: \"Siz bana Arapların madenleri hakkında mı soruyorsunuz? İnsanlar madendir. Cahiliye döneminde hayırlı olanlar, fakih olmaları şartıyla İslam'da da hayırlı olanlardır",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 3384,
			"arabicnumber": 3384,
			"text": "Aişe r.anha'dan rivayete göre Nebi Sallallahu Aleyhi ve Sellem ona: \"Ebu Bekir'e emret, Müslümanlara namaz kıldırsın\" diye buyurdu. O: Ebu Bekir ince kalpli, çabuk ağlayan birisidir. Senin makamında duracak olursa mutlaka kalbine rikkat gelir, dedi. Nebi Sallallahu Aleyhi ve Sellem sözünü tekrarladı, o da aynı cevabı tekrar etti. Şu'be dedi ki: Üçüncüsünde -ya da dördüncüsünde- şöyle buyurdu: \"Şüphesiz sizler Yusuf'un (başına o işleri açan) kadınlarsınız. Ebu Bekir'e söyleyin",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 3385,
			"arabicnumber": 3385,
			"text": "Ebu Burde b. Ebi Musa'dan rivayete göre o babasından şöyle dediğini rivayet etmektedir: \"Nebi Sallallahu Aleyhi ve Sellem hastalandı. \"Ebu Bekir'e emredin cemaate namaz kıldırsın\" dedi. Aişe: Ebu Bekir, şöyle şöyle bir adamdır, dedi. Yine aynı şeyi söyledi, o da aynı şeyleri tekrarlayınca, şöyle buyurdu: \"Ebu Bekir'e emredin, siz Yusufun (başına o işleri açan) kadınlarsınız. \" Ebu Bekir, Resulullah Sallallahu Aleyhi ve Sellem hayatta iken imamlık yaptı",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 3386,
			"arabicnumber": 3386,
			"text": "Ebu Hureyre r.a. dedi ki: \"Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: Allah'ım, Ayyaş b. Ebi Rebia'yı kurtar, Allah'ım, Seleme b. Hişam'ı kurtar. Allah'ım, el-Velid b. el-Velid'i kurtar. Allah'ım, müminlerden mustaz'af olanları kurtar. Allah'ım, Mudar üzerindeki baskıyı daha da şiddetlendir. Allah'ım, bunları (gelecek yılları) onların üzerine Yusufun yılları gibi kıl",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 3387,
			"arabicnumber": 3387,
			"text": "Ebu Hureyre r.a. dedi ki: \"Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: Allah Lut'a rahmetini ihsan eylesin. O esasen güçlü bir yere sığınıyordu ve eğer ben Yusufun kaldığı kadar zindanda kalmış olsaydım, sonra da o davetçi bana gelseydi, (vakit geçirmeden) onun çağrısına uyardım (hapisten çıkardım)",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 3388,
			"arabicnumber": 3388,
			"text": "Mesruk'tan dedi ki: Ümmü Ruman'a -ki o Aişe'nin annesidir- Aişe hakkında söylenen o malum iftiraya dair soru sordum da şöyle dedi: Ben Aişe ile birlikte oturuyorken yanımıza ensardan bir kadın girdi. Şöyle dedi: Allah filanı şöyle şöyle etsin. (Ümmü Ruman) dedi ki: Niye, diye sordum. Kadın: O, o anlatılan sözleri diline doladı, başkalarına anlattı. Aişe dedi ki: Hangi sözlerden bahsediyorsun? Kadın ona da anlattı. Bu sefer: Bu sözleri Ebu Bekir ve Resulullah Sallallahu Aleyhi ve Sellem de duydu mu, diye sordu. Kadın: Evet deyince, Aişe bayılıverdi. Kendisine gelip ayıldığında titreme ile birlikte ateşi de yükselmişti. Nebi Sallallahu Aleyhi ve Sellem gelip: Buna ne oldu diye sordu. Ben hakkında konuşulanlar dolayısıyla o hummaya yakalandı, dedim. Aişe oturdu ve dedi ki: Allah'a yemin ederim, yemin edecek olursam doğru söylediğime inanmazsınız. Mazeretimi anlatacak olursam, mazeretimi kabul etmezsiniz. Benim misalim ile sizin misaliniz Yakup ve oğullarının misaline benzer. Sizin bu anlattıklarınıza karşı yardımı Allah'tan dilerim. Nebi Sallallahu Aleyhi ve Sellem çıkıp gitti, yüce Allah da o buyrukları ona indirdi. Kendisine inen buyrukları (Aişe'ye) haber verince (Aişe) dedi ki: Sadece Allah'a hamdederim. Kimseye hamdedecek değilim.\" [Yusuf, 110]",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 3389,
			"arabicnumber": 3389,
			"text": "Urve'den rivayete göre o Nebi Sallallahu Aleyhi ve Sellem'in zevcesi Aişe r.anha'ya sordu: Yüce Allah'ın: \"Nihayet o Resuller ümitlerini kesip de kendilerinin yalanlandıklarını sandıklarında ... \" buyruğundaki (mealde: yalanlandıkları anlamı verilen) kuzzibu (yalanlandılar) şeklinde midir, yoksa: \"kuzibu: kendilerine yalan söylendi\" şeklinde midir? Aişe: Hayır, kavimleri kendilerini yalanladı. Ben: Allah'a yemin ederim ki onlar kavimlerinin kendilerini yalanladıklarından kesinlikle emin idiler. Bu bir zan değildi, deyince, dedi ki: Ey Urve'cik andolsun onlar bundan emin idiler. Bu sefer ben belki de bu \"yahut kendilerine yalan söylendi (anlamında kuzibu)\" diye olabilir mi, dedim. O şu cevabı verdi: Bundan Allah'a sığınırız. Resuller asla Rableri hakkında böyle bir şey zannetmezler. Bu ayete gelince ... (devamla) dedi ki: Kastedilenler Rablerine iman edip, tasdik eden ve çektikleri belalar uzun süre devam edip, ilahi yardıma mazhar oluşları geciken (mümin) lerdir. Nihayet (Resuller) kavimlerinden kendilerini yalanlayanlardan ümit kesip, artık kendilerine de tabi olanların da kendilerini yalanladıklarını zannedince o vakit Allah'ın yardımı geldi.\" Ebu Abdullah (Buhari) dedi ki: \"Ondan\" Yusuftan \"ümitlerini kesince ... \"[Yusuf, 80] \"Allah'ın rahmetinden ümit kesilmez. \"[Yusuf, 87] buyruğu ondan ümit etmekten geri kalmayın, demektir. Tekrar: 4525, 4695, 4696",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 3390,
			"arabicnumber": 3390,
			"text": "Abdullah b. Ömer (r.a.)'dan rivayete göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Kerim oğlu kerim oğlu kerim oğlu kerim, İbrahim oğlu İshak oğlu Yakub oğlu Yusuftur. -Hepsine selam olsun",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 3391,
			"arabicnumber": 3391,
			"text": "Ebu Hureyre r.a.'dan rivayete göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Eyyub, çıplak olarak yıkanmakta iken üzerine altından çekirgeler yağdı. O da elbisesine doldurmaya koyulunca, Rabbi şöyle seslendi: Ey Eyyub, şu gördüğün duruma ihtiyacın olmayacak kadar sana varlık vermedim mi? Eyyub: Öyledir Rabbim, fakat senin bereketinden de ben müstağni kalamam, dedi",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 3392,
			"arabicnumber": 3392,
			"text": "Âişe(r.anha) şöyle dedi: Peygamber (-sallallahü aleyhi ve sellem- Cibrîl kendisine vahy getirdikten sonra Hırâ'dan) korkuyla yüreği titreyerek Hadîce'ye döndü. Bundan sonra Hadîce, Peygamber'i birlikte alıp amca oğlu olan Varaka ibn Nevfel'in yanına götürdü. Bu zât (puta tapıcılığı terkedip) Hrıstiyan dîni'ne girmiş, İncil'i Arab diliyle okuyan bir kimse idi. Varaka, Peygamber'e: Ne görüyorsun? dedi. gördüklerini ona haber verdi. Bunun üzerine Varaka: Bu gördüğün, Allah'ın Mûsâ Peygamber'e indirdiği Nâmûs'tur(yani vahy sırrının sahibidir). Eğer senin da'vet günlerine yetişirsem, sana kuvvetli bir şekilde yardım ederim, dedi. Allah'ın başkalarından gizlemekte olduğu şeyleri kendisine bildirmekte olduğu sır sahibidir",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 3393,
			"arabicnumber": 3393,
			"text": "Malik b. Sa’saa’dan rivayete göre Resulullah Sallallahu Aleyhi ve Sellem kendilerine İsra gecesini anlattı: \"Nihayet beşinci semaya geldi. Orada Harun ile karşılaştı. (Cebrail) bu Harun'dur, ona selam ver, dedi. Ben de ona selam verdim. Selamımı aldı, sonra da: Salih kardeşe ve salih nebiye merhaba, dedi.\" 23. \"FİRAVUN AİLESİNDEN OLUP, İMANINI GİZLEYEN MU'MİN BİR ADAM DEDİ Kİ... ŞÜPHESİZ ALLAH HADDİ AŞAN VE YALAN SÖYLEYEN KİMSELERİ DOĞRU YOLA İLETMEZ.\" [Mu'min, 28]",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 3394,
			"arabicnumber": 3394,
			"text": "Ebu Hureyre r.a.'dan dedi ki: \"Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: İsra'ya götürüldüğüm gece Musa'yı gördüm. Sanki Yemen'li Şenuelilerden bir adammış gibi (uzun boylu), balık etinde, saçlarını yağlamış olarak gördüm. İsa'yı da gördüm. O da orta boylu, kırmızıya yakın tenli, hamamdan çıkmış birisi gibi idi. Ben ise İbrahim aleyhisselam'ın soyundan gelenler arasında ona en çok benzeyen kişiyim. Daha sonra bana birisinde süt, diğerinde şarap bulunan iki kap getirildi. (Cibril bana:) İstediğin birisini iç, dedi. Ben de sütü alıp içtim. Fıtratı aldın, denildi ama eğer şarabı almış olsaydın, ümmetin azacaktı.\" Tekrar: 3437, 4709, 5576, 5603",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 3396,
			"arabicnumber": 3396,
			"text": "",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 3397,
			"arabicnumber": 3397,
			"text": "İbn Abbas r.a.'dan rivayete göre \"Nebi Sallallahu Aleyhi ve Sellem Medine'ye geldiğinde onların bir gün -yani Aşura günü- oruç tuttuklarını gördü. Bu büyük bir gündür, dediler. Bu Allah'ın Musa'yı kurtardığı, Firavun hanedanını ise suda boğduğu bir gündür. Bu sebeple Musa Allah'a şükür olsun diye oruç tutmuştur. Allah Resulü: Ben Musa'ya onlardan daha yakınım, dedi. O günü oruç ,tuttu ve oruç tutulmasını emrettL",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 3398,
			"arabicnumber": 3398,
			"text": "Ebu Said r.a.'dan rivayete göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Kıyamet gününde insanlar baygın düşeceklerdir. İlk ayılacak kişi ben olacağım. Bir de ne göreyim: Musa, Arş'ın ayaklarından birisini yakalamış duruyor. Bilemiyorum benden önce mi ayılmış olacak, yoksa Tur'daki baygınlığının karşılığı mı ona verilmiş olacak?",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 3399,
			"arabicnumber": 3399,
			"text": "Ebu Hureyre r.a. dedi ki: Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"İsrailoğulları olmamış olsaydı, et kokmazdı. Havva da olmamış olsaydı, hiçbir kadın ebediyen kocasına hainlik etmezdi",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 3400,
			"arabicnumber": 3400,
			"text": "İbn Abbas'tan rivayete göre kendisi el-Hurr b. Kays el-Fezari ile Musa'nın arkadaşı hakkında tartıştı. İbn Abbas: O, Hızır'dır dedi. Yanlarından Ubeyy. b. Ka'b geçti. İbn Abbas (onu) çağırarak dedi ki: Ben ve bu arkadaşım Musa'nın nasıl kendisi ile karşılaşabileceğini sorduğu arkadaşı hakkında tartıştık. ResuluIlah Sallallahu Aleyhi ve Sellem'i ona dair bir şey zikrederken dinledin mi? Ubey: \"Evet, dedi. Resulullah Sallallahu Aleyhi ve Sellem'i şöyle buyururken dinledim: Musa İsrailoğullarından ileri gelen bir grup kimse ile birlikte bulunuyorken bir adam gelerek: Senden daha alim birisinin olduğunu biliyor musun, diye sordu. O, hayır dedi. Bunun üzerine yüce Allah Musa'ya: Aksine, kulumuz Hızır var, diye ona vahyetti. Musa onunla nasıl görüşebileceğini sordu. Bu iş için ona alamet olarak balık verildi ve kendisine şöyle denildi: Balığı kaybettiğin takdirde geri dön, onunla karşılaşacaksın. Ondan dolayı denizde balığın peşini takip ediyordu. Beraberindeki genç delikanlı Musa'ya dedi ki: Hani biz kayanın yanında dinlenmiştik ya! İşte ben balığı (orada) unuttum, onu sana söylemeyi de şey tandan başkası bana unutturmadı. Bunun üzerine Musa dedi ki: İşte bu bizim aradığımızdı. Böylelikle izlerini takip ederek gerisin geri döndüler ve Hızır'ı buldular. Ondan sonra da yüce Allah'ın Kitabında anlattıkları şeyler başlarından geçti",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 3401,
			"arabicnumber": 3401,
			"text": "Said b. Cubeyr dedi ki: \"İbn Abbas'a dedim ki: Nevf el-Bikali, Hızır ile arkadaşlığı olan Musa'nın, İsrailoğullarına gönderilen Musa olmadığını, onun bir başka Musa olduğunu ileri sürmektedir. İbn Abbas: Allah'ın düşmanı yalan söylemiştir, dedi. Bize Ubeyy b. Ka'ab'ın, Nebi Sallallahu Aleyhi ve Sellem'den naklen anlattığına göre Musa İsrailoğullarına bir hutbe irad etmek üzere ayağa kalktı. En bilgili insan hangisidir, diye soruldu. O: Benim dedi. Yüce Allah ona ilmi kendisine havale etmediği için sitem etti ve: Hayır, buyurdu. Benim iki denizin birleştiği yerde bir kulum var. O senden daha alimdir. Musa: Rabbim onunla beni kim görüştürebilir, dedi. Süfyan bazen de: Rabbim onunla nasıl görüşebilirim, dedi, diye rivayet etti. (Yüce Allah) buyurdu ki: Bir balık al, onu bir zenbile koy. Balığı nerede kaybedersen o, oradadır. Musa bir balık alıp, onu bir zenbile koydu. Sonra kendisi ve genç birisi olan Yuşa' b. Nun ile birlikte yola koyuldu. Nihayet o kayanın yanına vardıklarında başlarını koyup yattılar. Musa uyudu. Balık çırpındı, (zenbilden) çıktı ve denize düştü. Denizde bir serap halinde yolunu alıp gitti. Allah suyun balığın üzerinde akıntısını tuttu ve su bir takı andırdı. -Bir tak gibi bu şekilde oldu, dedi.- Fakat yollarına koyuldular, gece ve gündüzlerinin geri kalan kısmını yürüyerek devam ettiler. Ertesi gün olunca (Musa) yanındaki delikanlıya: Bize yemeğimizi getir. Gerçekten biz bu yolculuğumuzdan ötürü çokça yorulduk, dedi. Musa yüce Allah'ın kendisine em rettiği yeri aşıncaya kadar yorgunluk hissetmemişti. Yanındaki genç ona dedi ki: Gördün mü? Biz kayanın yanında dinlendiğimizde ben sana balığın denize koyulup gittiğini söylemeyi unuttum. Bunu sana söylememi de şeytandan başkası unutturmadı. Balık hayret verici bir şekilde denizde yol alıp gitti. Deniz, balık için bir serap (bir çeşit tünel), onlar için de hayret edilecek bir husus olmuştu. Musa ona: İşte bizim aradığımız bu idi deyip, her ikisi de izlerini takip ederek gerisin geri döndüler. Nihayet o kayanın yanına vardılar. Bir elbise ile üzerini örtmüş bir adam ile karşılaştılar. Musa selam verdi, o da selamını alarak: Senin bulunduğun yerde selam ne gezer, dedi. Ben Musa'yım, dedi. Adam: İsrailoğullarının Musa'sı mı? diye sordu. Evet. Sana öğretilen doğru bilgilerden bana da öğretmen için yanına geldim, dedi. Ona dedi ki: Ey Musa, ben Allah tarafından gelmiş ve Allah'ın bana öğrettiği, senin ise bilmediğin bir ilme sahibim. Sen de Allah'ın sana öğretmiş olduğu, benim bilmediğim, Allah tarafından sana verilmiş bir ilme sahipsin. Musa: Sana tabi olayım mı? diye sordu. Hızır: Sen benimle kalmaya sabır gösteremezsin, hem hakkında yeteri kadar bilgi sahibi olmadığın bir şeye karşı nasılsabredebilirsin, dedi. (Yüce Allah'ın): \"Büyük bir iş yaptın.\"[Kehf, 71] buyruğuna kadar (geçenleri anlattı). Deniz kıyısında yürümeye koyuldular. Bulundukları yerden bir gemi geçti. Yeni sahipleri ile kendilerini taşımaları hususunda konuştular (kendilerini gemiye bindirmelerini istediler). Gemidekiler Hızır'ı tanıdılar ve onu herhangi bir ücret almadan taşıdılar. Gemiye bindikten sonra bir kuş gelip, geminin kıyısında bir yere kondu. Denize bir veya iki defa gagasını daldırıp çıkardı. Hızır ona dedi ki: Ey Musa! Benim ilmim ile senin ilmin, Allah'ın ilmine göre ancak bu kuşun gagasıyla denizde eksilttiği miktara benzer. Derken Hızır, baltayı alıp bir tahtayı söktü. Musa kaşla göz arasında Hızır'ın elindeki keser ile bir tahtayı sökmüş olduğunu görünce ona dedi ki: Sen ne yaptın? Bunlar bizi ücretsiz taşıdılar, sen kalkıp onların gemilerini içindekiler suda boğulsun diye deldin. Gerçekten görülmedik bir iş yaptın. Hızır dedi ki: Ben sana benimle birlikte kalmaya sabır gösteremezsin dememiş miydim? Musa dedi ki: Unuttuğumdan ötürü beni mesul tutma, bu işimde de bana zorluk çıkarma. Musa'nın bu ilk itirazı unutmaktan ötürü idi. Denizden (gemiden) çıkınca başka çocuklarla oynamakta olan bir çocuğun yanından geçtiler. Hızır onun başını yakalayıp, eliyle şu şekilde kafasını kopardı. -Süfyan parmak uçlarıyla bir şey koparırcasına işaret etti.- Musa ona dedi ki: Sen tertemiz bir nefsi, başka bir cana karşılık olmadan nasıl öldürdün? Sen gerçekten kabul edilemeyecek bir iş yaptın. Hızır dedi ki: Ben sana, benimle birlikte bulunmaya tahammül gösteremezsin dememiş miydim? Musa dedi ki: Artık bundan sonra sana herhangi bir şeye dair soru soracak olursam benimle arkadaşlık etme. O takdirde tarafımdan da mazur görüleceksin. Yollarına koyuldular. Nihayet bir kasaba halkının yanına vardılar. Kasaba halkından kendilerine yemek yedirmelerini istediler. Fakat kasaba halkı onları misafir etmek istemedi. Musa ile Hızır kasabada yıkılmaya yüz tutmuş, yan yatmış bir duvar buldular. -Bu şekilde eliyle işaret etti. Süfyan da aşağıdan yukarıya doğru bir şeyi sıvazlarcasına işaret etti. Onun \"eğilmiş\" olduğunu yalnızca bir defa söylediğini dinledim, dedi.- Musa dedi ki: Biz bunların yanına geldik, onlar bize yemek vermediler, bizi misafir de etmediler. Sen kalktın, onların duvarlarını düzelttin. İsteseydin buna karşılık onlardan bir ücret alırdın. Hızır dedi ki: İşte bu hadiseden sonra ben ve sen ayrılıyoruz. Fakat senin sabır ve tahammül gösteremediğin şeylerin açıklamasını sana bildireceğim. Nebi Sallallahu Aleyhi ve Sellem buyurdu ki: Keşke Musa sabretseydi. Yüce Allah'ın bize onların başından geçenlere dair haberleri anlatmasını çok arzu ederdik. Süfyan dedi ki: Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: Allah Musa'ya rahmetini ihsan eylesin. Eğer sabretmiş olsaydı, yüce Allah onların başlarından geçenleri de anlatırdı. İbn Abbas da: \"Çünkü arkalarında her gemiyi zorla gasbeden bir hükümdar vardı. \"[Kehf, 79] buyruğundaki \"arkalarında\" anlamındaki lafzı \"önlerinde\" anlamına gelecek şekilde \"emamehum\" diye okumuştur. Çocuk ise kafir idi, anne-babası da mümin idi. Sonra Süfyan bana dedi ki: Ben bu hadisi ondan iki defa dinledim ve bu hadisi ondan belledim. Süfyan'a: Sen bunu Amr'dan işitmeden önce mi bellemiştin yoksa onu bir başka kimseden mi bellemiştin? Bu sefer: Ben bunu kimden belleyebilirim ki, diye sordu. Ayrıca bunu benden başkası Amr'dan rivayet etmiş midir ki? Ben bu hadisi ondan iki ya da üç defa dinledim ve bunu ondan hıfzettim",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 3402,
			"arabicnumber": 3402,
			"text": "Ebu Hureyre r.a.'dan rivayete göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Hızır'a bu ismin veriliş sebebi, onun ot bitmeyen bir yere oturmuş olmasından sonra o yerin yeşil (hadra) olarak sarsılıvermesidir.\" el-Hamevi dedi ki: Muhammed b. Yusuf b. Matar el-firebri dedi ki: Bize Ali b. Haşrem, Süfyan'dan bu hadisi bu şekilde uzun uzadıya nakletti. Diğer tahric eden: Tirmizi Tefsirul Kur’an",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 3403,
			"arabicnumber": 3403,
			"text": "Ebu Hureyre r.a dedi ki: Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"İsrailoğullarına: 'Kapıdan içeriye secde ederek girin ve hıtta deyin' denildi. Onlar ise sözü değiştirdiler ve arkalarını dönerek girdiler. habbe (Bir arpa içinde bir buğday olsun), dediler. \" Tekrar: 4479, 4641",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 3404,
			"arabicnumber": 3404,
			"text": "Ebu Hureyre r.a. dedi ki: Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Musa çok hayalı ve avretini örtmeye çokça gayret eden birisi idi. Hayasından ötürü teninden hiçbir yer görünmezdi. İsrailoğullarından ona eziyette bulunanlar eziyet ederek: Onun bu şekilde örtünmesinin tek sebebi derisindeki bir kusurdan dolayıdır. Başka bir sebebi de yoktur. Bu ya bir baraştır ya hayalarında şişiklik vardır yahut bir başka hastalığı vardır, dediler. Allah da onların Musa'nın onların söylediklerinden beri olduğunu ortaya çıkarmak istedi. Bir gün tek başına iken elbiselerini çıkartıp, taşın üzerine bıraktı. Sonra yıkandı. Yıkanmasını bitirince elbiselerini almak üzere geldi. Fakat taş, elbisesini de beraberinde hızlıca götürüp gitti. Musa, asasını aldı ve taşın arkasından gitti. Bu arada: Ey taş elbisemi ver, ey taş elbisemi ver, diyordu. Nihayet İsrailoğullarından bir topluluğun yanına kadar vardı. Onun çıplak olduğunu ve Allah'ın yarattığı en güzel bir surette bulunduğunu gördüler. Böylelikle Allah onların söylediklerinden onu temize çıkarmış oldu. Taş da yerinde durdu, elbisesini alıp giyindi. Asasıyla da taşa vurmaya koyuldu. Allah'a yemin ederim, onun üç, dört ya da beş defa taşa vurmasından ötürü taşta girintiler vardır. İşte yüce Allah'ın: \"Ey iman edenler! Siz de Musa'yı incitenler gibi olmayın. Allah onları dediklerinden temize çıkardı. O Allah indinde itibarlı ve değerli idi. \"[Ahzab,69] buyruğu bunu anlatmaktadır",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 3405,
			"arabicnumber": 3405,
			"text": "Abdullah r.a. dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem bir miktar mal paylaştırdı. Bir adam: Şüphesiz bu paylaştırma ile Allah'ın rızası maksat olarak gözetilmemiştir, dedi. Ben Nebi Sallallahu Aleyhi ve Sellem'in yanına gidip ona (söyleneni) haber verdim. Ben öfkesinin etkisini yüzünde fark edebileceğim kadar öfkelendi, sonra şöyle buyurdu: Allah Musa'ya rahmetini ihsan eylesin. Ona bundan fazlasıyla eziyet edildi, yine de sabretmişti",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 3406,
			"arabicnumber": 3406,
			"text": "Cabir b. Abdullah r.a dedi ki: \"Resulullah Sallallahu Aleyhi ve Sellem ile birlikte 'kebas (denilen misvak çubuklarının alındığı erak ağacının meyvesini)' topluyor idik. Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: Bunun siyah olanını toplamaya gayret gösteriniz. Çünkü onun en lezzetli olanı o türüdür. Ashab: Ey Allah'ın Resulü, sen koyun otlatıyor muydun, diye sordular. O: Koyun otlatmamış bir Nebi var mı ki? diye buyurdu.\" Hadis ileride 5453 numara ile gelecektir. Fethu'l-Bari Açıklaması: \"el-Kebas\" ince dallarından misvak yapılan erak ağacının meyvesidir. Bu meyvenin olgun olanına bu isim verilmektedir. Nevevı dilcilerden böylece naketmiş bulunmaktadır. Cabir r.a.'ın rivayet ettiği bu hadisin Musa aleyhisselam kıssası ile ilgisi, Allah Resulünün: \"Koyun otlatmamış bir Nebi var mıdır?\" buyruğunun umumi bir ifade olması cihetiyledir. Bunun kapsamına Musa aleyhisselam da girmiş olmaktadır. Hatta bu hadisin bazı rivayet yollarında şu ifadeler de zikredilmekedir: \"Musa'ya Nebilik verildiğinde kendisi koyun otlatmakta idi.\" Bu riayet Nesaı'nin Tefsir'de zikrettiği Ebu İshak Nasr b. HCfm yoluyla gelmiş olan bir rivayet olup, buna göre Nasr b. Hazm şöyle demiştir: \"Deve sahipleri ile koyun sahipleri birbirlerine karşı öğündü. Nebi Sallallahu Aleyhi ve Sellem: \"Musa'ya Nebilik verildiğinde o bir koyun çobanı idi, diye buyurdu.\" Senedindeki raviler sikadırlar. Önder alimlerin dediklerine göre; enbiyanın koyun çobanlığı yapmalarındaki hikmet, kendilerini tevazuya alıştırmaları, kalplerinin halveti itiyat haline etirmesi ve koyunları idare etmekten ümmetieri idare etmek derecesine yüksel:neleri içindir",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 3407,
			"arabicnumber": 3407,
			"text": "Ebu Hureyre r.a. dedi ki: \"Ölüm meleği aleyhisselam, Musa aleyhisselam'a gönderildi. Melek ona gelince, gözü üzerine bir tokat indirdi. Melek Rabbinin yanına dönerek dedi ki: Sen beni ölmek istemeyen bir kula gönderdin. Yüce Allah buyurdu ki: Ona dön ve ona de ki: Elini bir öküzün sırtı üzerine koysun. Eli altında kalan her bir kıl için ona bir sene ömür verilecektir. (Musa): Rabbim sonra ne olacak deyince, sonra öleceksin, diye buyurdu. Musa: O halde şimdi (öleyim), dedi. Yüce Allah'tan da kendisini Arz-ı Mukaddese bir taş atım1ığı kadar bir mesafeye yaklaştırmasını niyaz etti. Ebu Hureyre dedi ki: Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: Eğer arda olsaydım, o kırmızı kum yığınının alt tarafındaki yolun kenarında bulunan kabrini size gösterecektim",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 3408,
			"arabicnumber": 3408,
			"text": "Ebu Hureyre r.a. dedi ki: \"Müslümanlardan bir adam ile Yahudilerden bir adam birbirine ağır sözler söyledi. Müslüman -bir hususa dair yemin ederken- Muhammed'i sallallahu aleyhi ve sellem alemlere üstün kılana yemin ederim ki, deyince Yahudi de: Musa'yı alemlere üstün kılana yemin ederim ki, dedi. Bu sefer Müslüman elini kaldırıp, yahudiye bir tokat indirdi. Yahudi, Nebi Sallallahu Aleyhi ve Sellem'in yanına giderek kendisi ile Müslüman kişi arasında olup biteni ona haber verdi. Allah Resulü şöyle buyurdu: Benim Musa'dan hayırlı olduğmu söylemeyiniz; çünkü (kıyamet güe) bütün insanlar baygın düşecekler. Ilk ayılacak kişi ben olacağım. Bir de ne göreceğim! Musa Arş'ın bir kenarından yakalamış. Bilemiyorum acaba o da baygın düşenlerden birisi olup benden önce mi ayılmış olacak, yoksa Allah'ın baygın düşeceklerden istisna ettiği kimseler arasında mı olacak?",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 3409,
			"arabicnumber": 3409,
			"text": "Ebu Hureyre dedi ki: \"Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: Adem ile Musa birbirleriyle delil getirerek tartışmaya koyuldu. Musa, Adem'e dedi ki: Sen, günahınla kendini cennetten çıkartan Adem'sin, dedi. Adem ona: Sen Allah'ın risaletleri ve kelamı için seçtiği Musa'sın. Sonra da kalkmış beni ben yaratılmadan önce üzerimde takdir edilmiş bulunan bir iş dolayısıyla kınıyorsun, dedi. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem iki kere: Böylece Adem, Musa'ya karşı (bağlayıcı) delil getirmiş oldu, diye buyurdu.\" Hadis ileride 4736,4738,6614 ve 7515 numara ile gelecektir",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 3410,
			"arabicnumber": 3410,
			"text": "İbn Abbas r.a dedi ki: \"Bir gün Nebi Sallallahu Aleyhi ve Sellem yanımıza çıkıp geldi ve şöyle buyurdu: Ümmetler bana gösterildi. Ufku kaplayan bir kalabalık gördüm. İşte bu (gördüğün kalabalık), kavmi arasında Musa'dır, denildi. \" Hadis 5705, 5752, 6472 ve 6541 numara ile gelecektir. Fethu'l-Bari Açıklaması: \"Ölüm meleği aleyhisselam Musa aleyhisselam'a gönderildi. Yanına gelince gözü üzerine bir tokat attı.\" Hemmam'ın, Ebu Hureyre'den diye rivayet ettiği Ahmed ve Müslim'de yer alan rivayette şöyle denilmektedir: \"Ölüm meleği Musa'ya geldi ve ona: Rabbine icabet et, dedi. Musa ölüm meleğınin yüzüne bir tokat attı ve gözünü çıkardı.\" \"Ölmek istemeyen\" ifadesine Hemmam şu fazlalığı da eklemektedir: \"İşte gözümü çıkardı. Bunun üzerine Allah gözünü eski haline getirdi.\" Ammar yoluyla gelen rivayette de şöyle denilmektedir: \"Rabbim, Musa kulun gözümü çıkardı. Senin nezdinde ki değeri olmasaydı ben de ona karşı gelecek ve onu zor bir duruma sokacaktım.\" \"Allah'tan kendisini Arz-ı Mukaddese bir taş atımlığı kadar bir mesafe yaklaştırmasını niyaz etti.\" Buna dair şerh ve açıklamalar Cenaiz bölümünde geçmiş bulunmaktadır. \"Kırmızı kum yığınının alt tarafıında ... \" İbn Huzeyme der ki: Bazı bid'atçiler bu hadisi reddederek şöyle demişlerdir: Şayet Musa ölüm meleğini tanımış ise o, onu hafife almış demektir. Eğer onu tanımamış idiyse neden gözünü çıkardığından ötürü Musa'ya kısas uygulanmadı? Buna cevap şudur: Allah Musa'ya ölüm meleğini gönderdiğinde tam o sırada ruhunu kabzetmeyi murat etmemişti. Ölüm meleğini ona denemek üzere göndermişti. Musa'nın ölüm meleğinin gözüne tokat indirmesi ise, ona iznini almadan evine girmiş bir insan olarak görçlüğünden dolayıdır. Onun ölüm meleği olduğunu bilmiyordu. Şeriat koyucu da müslümanın evine izinsiz bakan kimsenin gözünü çıkarmayı mubah kılmıştır. Melekler İbrahim'e ve Lut'a da insan suretinde gelmişler ve ilk anda onları tanımamışlardı. Eğer İbrahim aleyhisselam melekleri tanımış olsaydı onlara yiyecek ikram etmezdi. Şayet Lut aleyhisselam onları tanımış olsaydı, kavminin onlara zarar vereceğinden korkmazdı. Musa'nın ölüm meleğini tanıdığını varsayacak olursak bu bid'atçi şahıs, melekler ile insanlar arasında kısasın meşru' olduğunu nerden biliyor? Diğer taraftan ölüm meleğinin Musa'dan kısas isteyip de ona kısas uygulanmadığını nereden çıkartıyor? Hattabı, İbn Huzeyme'nin açıklamalarını özetledikten sonra şunları da eklemektedir: Musa'nın onu kendisinden bu şekilde uzaklaştırmak istemesi, tabiatı itibariyle hiddetli birisi oluşundandır. Diğer taraftan Allah ölüm meleğine gözünü tekrar iade etti ki Musa da Ö meleğin Allah tarafından geldiğini bu yolla bilsin. Bundan dolayı o vakit Musa'nın teslimiyet gösterdiğini anlıyoruz. Nevevi de diyor ki: Kendisine tokat atılanı sınamak amacıyla yüce Allah'ın Musa'ya böyle bir tokat atma iznini vermiş olması da olmayacak bir şey değildir. Başkası da şöyle demektedir: Ona tokat indirmesinin sebebi, kendisini tercih yapmakta serbest bırakmadan önce ruhunu kabzetmek üzere gelişi idi. Çünkü sabit olduğuna göre istediğini tercih etmekte serbest bırakılmadıkça hiçbir Nebiin ruhu kabzedilmemiştir. Bundan dolayı ikinci defada onu tercihte serbest bırakınca boyun eğip, itaat etmiştir: Görüşler arasında doğruya en yakın olanın bu olduğu söylenmiş olmakla birlikte bu görüşün doğruluğu da tartışılabilir. Çünkü sorunun esasına dönülerek tekrar şöyle denilebilir: Ölüm meleği ne diye Allah'ın Nebiinin ruhunu kabzetmeye kalkıştı ve bu husustaki şartı (yani Nebilere has bir özellik olan muhayyer bırakma şartını) yerine getirmedi? O zaman buna da tekrar: Bu, imtihan olmak üzere meydana gelmiştir, denilir. Hadisten anlaşıldığına göre melek insan suretinde görünebilir. Bu husus pek çok hadiste zikredilmiş bir konudur. Yine hadisten anlaşıldığına göre Arz-ı Mukaddes'te defnedilmenin bir fazileti vardır. \"Bunun üzerine Müslüman elini kaldırdı ve yahudiye bir tokat indirdi.\" Yani yahudinin: \"Musa'yı alemlere üstün kılana yemin olsun\" dediğini işitince bu işi yaptı. Onun bu hareketi yapmasının sebebi, \"alemler\" lafzının genel ve kapsamlı oluşundan anladı ğı manadır. Bunun kapsamına Muhammed sallall€ıhu aleyhi ve sellem de girmektedir. Oysa müslümanın kanaatine göre Muhammed daha faziletlidir. Bu husus Ebu Said yoluyla rivayet edilen hadiste açıklanmış bulunmaktadır. Buna göre tokat vuran Müslüman, bu sözlerini söyleyen yahudiye şöyle demişti: Ey murdar, Muhammed'den de mi üstündür?\" İşte bu, onun yahudiye, kendisine göre yalan söylediğine karşılık bir ceza olmak üzere tokat vurmuş olduğunu göstermektedir. \"Yahudi ona kendisi ile müslümanın arasında olanları haber verdi.\" İbnu'lFadl'ın rivayetinde şöyle denmektedir: \"(Yahudi) dedi ki: Ey Ebu'l-Kasım ben zimmeti ve ahdi olan birisiyim. Ne diye filan kişi yüzüme tokat vuruyor? Allah !\\esulü (müslümana): Sen ne diye onun yüzüne tokat vurdun, diye sordu; -de;,,'ip, hadisin geri kalan bölümünü zikretti ... - Nebi sallall€ıhu aleyhi ve sellem öyle \":Jir öfkelendi ki öfkenin etkisi yüzünde görüldü.\" \"Bir de ne göreceğim, Musa Arş'ın bir tarafını yakalamış.\" Yani Arş'ın bir :arafını kuwetle yakalamış, sımsıkı sarılmış. Ek Bir Bilgi İbn Hazm'ın iddia ettiğine göre kıyamet gününde dört Nefha olacaktır: Birincisi ölüm nefhasıdlL Yeryüzünde hayatta kalmış olan herkes bu Nefha ile ölecektir. İkinci nefha ise diriltme nefhasıdır. Ölmüş olan her bir şey o nefha ile ayağa kalkacak, kabirlerden çıkarılacak ve hesap için bir araya getirileceklerdiL Üçüncü nefha ise korku ve baygın düşme nefhasıdlL Bu nefhadan herkes baygın düşmüşçesine ayılacaktır, fakat bundan dolayı da kimse ölmeyecektir. Dördüncüsü ise bu baygınlıktan ayılma nefhası olacaktır. Onun açıkladığı şekilde iki nefhanın dört nefha oluşu açıklanabilir bir şey değildir. Aksine ortada sadece iki nefha vardiL Bu iki nefhadan her birisinde birtakım farklılıklar ortaya çıkacak olması, bu nefhaları işitecek olanlara göredir. Birinci nefhada hayatta olan herkes o nefha dolayısıyla ölecek, ancak Allah'ın istisna ettiği kimselerden olup, ölmeyecek kimseler ise baygın düşeceklerdiL İkinci nefhada ise daha önce ölmüş olanlar yaşayacak ve baygın düşmüş olanlar da ayılacaklardır. Doğrusunu en iyi bilen Allah'tır. Nebi sallallShu aleyhi ve sellem'in Nebiler arasında birinin diğerinden üstün olduğu iddiasında bulunmayı yasaklaması hususunda ilim adamları şu açıklamalarda bulunmuşlardır: Böyle bir şeyin söylenmesinin yasak oluşu, delile dayalı olarak değil de sırf kendi görüşüyle böyle bir iddiada bulunmakla ilgilidir. Yahut da bunu fazileti daha az olduğu söylenen nebinin değerini azaltma sonucunu verecek şekilde söylemekle ya da böyle bir iddianın, anlaşmazlık ve düşmanlıklara götürmesi haliyle ilgilidir. Yahut, daha az üstün olduğu söylenen kimsenin, üstün olduğu hiçbir tarafını bırakmayacak şekilde, bütün üstünlük türlerini kapsayacak şekilde üstünlük iddialarında bulunmayınız, maksadıyla söylenmiş olabilir. Mesela, imam müezzinden faziletlidir (üstündür), diyecek olursa bu, müezzinin ezana göre de faziletinin eksik olmasını gerektirmez. Bir diğer açıklamaya göre üstünlük iddialarının yasaklanış sebebi, bizatihi Nübuwetin kendisi ile alakalıdır. Nitekim yüce Allah: \"Resullerinden hiçbirini diğerine üstün tutmayız. \"[Bakara, 285] diye buyurmaktadır. Bununla birlikte bazı kimselerjn diğer bazılarından üstün olduğunun söylenmesi yasaklanmamıştlL Çünkü yüce Allah şöyle buyurmaktadır: \"İşte biz o Resullerin bazısını bazısına üstün kıldık. \"[Bakara, 253] diye buyurmaktadır. el-Halim! der ki: Birinin diğerinden hayırlı olduğunu ileri sürmeyi yasaklayan buyruklar ya kitap ehli ile tartışma hakkındadır ya da hayırlı olduğu ileri sürülerek bazı Nebilerin diğerlerinden üstün olduğunu söylemek manasınadır. Çünkü hayırlı oluş iddiası eğer iki ayrı din mensubu arasında ortaya çıkacak olursa onlardan birinin diğerini küçümseyecek noktaya varmayacağından emin olunamaz. Bu ise küfre kadar götürür. Şayet hayırlı oluş iddiası üstünlüğün ortaya konulması amacıyla faziletler arasında bir karşılaştırmaya dayanıyor ise bu, yasağın kapsamına girmez. (Babın sonundaki) hadisten Musa ümmetinin, Muhammed Sallallahu Aleyhi ve Sellem ümmetinden sonra en çok ümmet olduğu anlaşılmaktadır",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 3411,
			"arabicnumber": 3411,
			"text": "Ebu Musa r.a. dedi ki: \"Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: Erkeklerden pek çok kişi kemale ermiştir. Kadınlardan ise kemale ancak Firavun'un karısı Asiye ile İmran kızı Meryem kemale ermiştir ve şüphesiz Aişe'nin diğer kadınlara üstünlüğü, tiridin diğer yemeklere olan üstünlüğü gibidir.\" Hadis ileride 3433, 3769 ve 5418 numara ile gelecektir. Diğer tahric edenler: Tirmizi Et’ime; Nesâî, Muaşeret Fethu'l-Bari Açıklaması: Bu başlıktan maksat, Firavun'un hanım i Müzahim kızı Asiye'yi sözkonusu etmektir. Denildiğine göre o İsrailoğullarından idi ve Musa'nın halası idi. Meryem ise daha sonra ayrıca sözkonusu edilecektir. \"Kadınlardan Firavun'un karısı Asiye ile İmran'ın kızı Meryem dışında kimse kemale ermemiştir\" buyruğu ile Buharı bu kapsamı daraltılmış ifadeyi bu iki kadının birer nebi olduğuna delil göstermektedir. Çünkü insan türünün en mükemmeli hiç şüphesiz önce nebilerdir, sonra velilerdir, sıddıklar ve şehidlerdir. Eğer bu iki kadın nebi olmamış olsaydı, kadınlar arasında da veli, sıddıka ve şehide olmaması gerekirdi. Vakıada ise bu nitelikler birçok kadında bulunan niteliklerdir. Sanki yüce Allah Resulü şöyle buyurmuş gibidir: \"Kadınlardan filan ve filan kadın dışında kimseye nübüwet verilmemiştir.\" Eğer sıddıka yahut veliyye ya da şehitlik sıfatı yalnızca filan kadın ile filan kadın için sabittir, demiş olsaydı, elbette ki bu doğru olmazdı. Çünkü bu nitelikler başkalarında da bulunmaktadır. Şu kadar var ki hadiste sözkonusu edilen kemale ermekten maksadın, nebilerin dışındakilerin kemali olması hali müstesnadır. Ancak açıklanan durum sebebiyle nebilerin dışındakilerin kemalinin kastedildiğini ortaya koyacak tam bir delil bulunmamaktadır. Doğrusunu en iyi bilen Allah'tır. Buna göre maksat, Nebi Sallallahu Aleyhi ve Sellem'in zamanından önceki zamanlardır. Ayrıca Nebi sallallahu aleyhi ve sellem kendi dönemindeki kadınlardan Aişe dışında kimseyi sözkonusu etmemiştir. Hadiste Aişe r.a.a'nın diğer kadınlara göre daha faziletli olduğuna dair açık bir ifade bulunmamaktadır. Çünkü tiridin diğer yemeklere üstünlüğü ancak hazırlanmasının külfetsiz oluşu ve ko- . laylıkla hazmedilişi dolayısı iledir ve o dönemde onların yemeklerinin en Üstünü idi. Bununla birlikte bütün bu özellikler her bakımdan tiridin en üstün olmasını gerektirmemektedir. Başka açılardan başka yemeğe nispetle daha az faziletli olması mümkündür. Kurtubı der ki: Sahih olan, Meryem'in nebi olduğudur. Çünkü yüce Allah ona melek vasıtasıyla vahiy bildirmiştir. Asiye'ye gelince, onun nebi olduğuna dair herhangi bir delil varid olmamıştır. el-Kermanı der ki: \"Kemale eriş\" lafzı dolayısıyla nebi olması gerekmez. Çünkü kemal bir şeyin tamam olması ve kendi alanında en ileri dereceye varmış olması halini anlatmak için kullanılır. O halde maksat onun kadınlar hakkında sözkonusu olan bütün fazilet alanlarında en ileri dereceye ulaşmış olmasıdır. (Devamla) der ki: Kadınlardan nebi olmadığına dair icma' da nakledilmiş bulunmaktadır. Evet Kermanı böyle demektedir. Bununla birlikte el-Eşarı'den, kadınlardan altı tane nebi olduğunu söylediği de nakledilmiştir. Bunlar Hawa, Sara, Musa'nın annesi, Hacer, Asiye ve Meryem'dir. Onun nübüwet hususunda belirlediği ölçüye göre, Allah tarafından meleğin bir emir, nehiy ya da ileride meydana geleceklere dair bir bilgi getirerek geldiği her bir şahıs, bir nebidir. Yüce Allah tarafından bu kabilden çeşitli hususları bildirmek üzere bunlara meleğin gelmiş olduğu da sabittir. Kur'an-ı Kerim'de bunların bazılarına vahiyde bulunulduğu da açıkça ifade edilmiştir. İbn Hazm \"el-Milel ve'n-Nihal\" adlı eserinde bu meselede görüş ayrılığının ancak kendi çağında Kurtuba'da tartışma konusu edildiğini ve o zamana kadar böyle bir tartışmanın bulunmadığını zikretmiş bulunmaktadır. Bu hususta görüş belirtenler arasında üçüncü bir görüş daha nakletmiştir ki, o da bu hususta görüş açıklamamaktır. (Devamla) der ki: Kadınlardan nebi geldiğini kabul etmeyenlerin delili yüce Allah'ın: \"Senden önce gönderdiğimiz Resuller kendilerine vahyettiğimiz şehirli erkeklerden başkaları değildi. \"[Yusuf, 109] buyruğudur. (İbn Hazm) der ki: Ancak bu buyrukta delilolacak bir taraf yoktur. Çünkü kimse kadınlara risalet verildiğini iddia etmiş değildir. Sözkonusu görüş ayrılığı sadece Nübuvvet ile alakalıdır. Bu hususta varid olmuş en açık buyruklar Meryem kıssasındadır. Musa'nın annesinin kıssasında da onun için Nübuvvetin sabit olduğuna delil olacak taraflar vardır. Çünkü sadece ona bu hususun vahyedilmesi dolayısı ile çocuğunu denize attığını görüyoruz. Şanı yüce Allah da Meryem'i ve ondan sonra da başka nebileri sözkonusu ettikten sonra şöyle buyurmaktadır: \"İşte bunlar AIlahım kendilerine nimet verdiği ... nebilerdendir.\" (Meryem, 58) Böylelikle o da bu genel buyruğun kapsamı içerisine girmiş olmaktadır. Doğrusunu en iyi bilen Allah'tır",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 3412,
			"arabicnumber": 3412,
			"text": "Abdullah r.a.'dan rivayete göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Sizden hiçbiriniz: Ben Yunus'tan hayırlıyım demesin.\" Müsedded: \"Yunus b. Metta\" diye ifade etmiştir. Hadis ileride 4603 ve 4804 numara ile gelecektir",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 3413,
			"arabicnumber": 3413,
			"text": "İbn Abbas r.a.'dan rivayete göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Hiçbir kulun: Ben Yunus b. Metta'dan hayırlıyım demesi uygun değildir, diye buyurarak onu babasına nisbet etmiştir",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 3415,
			"arabicnumber": 3415,
			"text": "Bize Şu'be, Katâde'den; o da Ebû’l-Âliye'den; o da İbn Abbâsradıyallahü anhüma'tan tahdîs etti ki, Peygamber (sallallahü aleyhi ve sellem): \"Hiçbir kul için: Ben muhakkak Yûnus ibn Mettâ'dan hayırlıyım, demesi uygun değildir\" buyurmuş ve Yûnus'u babası Mettâ'ya nisbet etmiştir",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 3416,
			"arabicnumber": 3416,
			"text": "Ebu Hureyre r.a'dan rivayete göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Hiçbir kulun ben Metta oğlu Yunus'tan hayırhyım, demesi uygun değildir.\" Fethu'l-Bari Açıklaması: \"Vaktınden: Kabak ve benzeri gövdesi olmayan ağaçlardan\" şeklindeki açıklamaya uygun olarak Ebu Ubeyde de: Gövdesi üzerinde durmayan her bir ağaç (bitki) yaktındir, diye açıklamıştır. Kabak, Ebu Cehil karpuzu ve kavun gibi. Meşhur olan bunun kabak olduğudur. İncir ve muz olduğu da söylenmiştir. İlim adamları derler ki: Nebi sallaııahu aleyhi ve sellem, eğer bu sözlerini yaratılmışların en faziletIilerinin kendisi olduğu ona bildirildikten sonra söylemiş ise, tevazu yoluyla söylemiştir. Eğer bu husus ona bildirilmeden önce söylemiş ise açıklanması zor bir tarafı yoktur. İbn Ebi HMim de Amr b. Meymun'dan, İbn Mes'ud'a kadar ulaşan sahih bir sened ile buna yakın bir rivayet kaydetmiştir. Bu rivayette şunlar da vardır: \"Sabah olduğunda Yunus bulunduğu yüksekçe yerden kasabaya baktı. Azabın onların üzerine inmediğini gördü. Onların şeriatine göre yalan söyleyen kişi öldürüıürdü. O, kızgın bir şekilde yola koyuldu. Nihayet bir gemiye bindi. -Bu rivayetinde şunları da söylemektedir:- Yunus onlara dedi ki: Beraberlerinde Rabbinden (kinaye yoluyla, efendisinden anlamına da gelir) kaçmış bir köle vardır. Onu (suya) atmadığınız sürece gemi yürümeyecektir. Gemidekiler: Ey Allah'ın Nebii, biz ebediyen seni atmayız, dediler. Bu sefer kura çektiler. Üç defa kura onun aleyhine çıktı. Onu suya attılar, balık onu yuttu. Onu yerin dibine kadar ulaştırdı. Orada çakıl taşlarının tesbihlerini duyunca kendisi de karanlıklarda: Senden başka hiçbir ilah yoktur, diye seslendi",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 3417,
			"arabicnumber": 3417,
			"text": "Ebu Hureyre r.a.'dan rivayete göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Davud aleyhisselam'a (Zebur'u) okumak kolaylaştırılmış idi. O atlarının eğerlenmesini emrederdi, atları eğerlenirdi. Fakat atları eğerlenmeden önce (Zebur'u) okur bitirirdi. O, ancak kendi el emeğinden yerdi",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 3418,
			"arabicnumber": 3418,
			"text": "Abdullah b. Amr r.a. dedi ki: \"Resulullah Sallallahu Aleyhi ve Sellem'e benim şunları söylediğim haberi ulaştırıldı: Allah'a yemin ederim, hayatta kaldığım sürece gündüzleri oruç tutacak, geceleri namaz kılacağım. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem ona sordu: Allah'a yemin ederim, hayatta kaldığım sürece gündüzleri oruç tutacak, geceleri namaz kılacağım, diyen sen misin? Ben: Evet, bu sözü söyledim, dedim. Şöyle buyurdu: Senin buna gücün yetmez. (Bazen) oruç tut, (bazen) iftar et. (Bazen) namaz kıl, (bazen) uyu. Her aydan üç gün oruç tut. Çünkü. hasene on misli iledir. Bu da bütün sene oruç tutmak gibidir. Ben: Ey Allah'ın Resulü, bundan daha fazlasına gücüm yeter, dedim. O: O halde bir gün oruç tut, iki gün oruç tutma, dedi. Ben: Benim bundan daha fazlasına gücüm yeter, dedim. O halde bir gün oruç tut, bir gün tutma. İşte bu Davud'un oruç tutma şekli idi. Bu oruçların en mutedili (üstünü)dir, diye buyurdu. Ben: Ey Allah'ın Resulü bundan fazlasına gücüm yeter, dedim. O: Bundan daha faziletlisi olmaz, diye buyurdu",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 3419,
			"arabicnumber": 3419,
			"text": "Abduııah b. Amr b. eı-As dedi ki: \"Resuluııah Sallallahu Aleyhi ve Sellem bana dedi ki: Bana senin gece boyunca namaz kıldığın, gündüzleri de oruç tuttuğun haberi ulaştırılmadı mı sanıyorsun? Ben: Evet (durum) böyledir, dedim. Şöyle buyurdu: Sen bunu yapacak olursan göz, çukurlarına gömülür, nefis bitkinleşir. Her aydan üç gün oruç tut. İşte sene boyunca oruç tutmak budur. -Yahut: Bu sene boyunca oruç tutmak gibidir. Ben: Ben, kendimde -Mis'ar: Ben kendimde güç buluyorum, dedim. Şöyle buyurdu: O halde Da.vud aleyhisselam orucu tut, o bir gün oruç tutuyor, bir gün tutmuyordu. Düşmanla karşılaştığı vakit de kaçmıyordu.\" Hadislerden Çıkan Sonuçlar 1. (3417 no'lu) hadisten anlaşıldığına göre bazen zaman bereketlenir ve bu (kısa) zamanda pek çok amel işlenebilir. \"O ancak kendi el emeğinden yerdi\" buyruğuna dair açıklamalar Buyu' (alışverişier) bölümünün baş taraflarında geçmiş bulunmaktadır. 2. Hadiste el emeğinin, kazançların en faziletli olduğuna delil vardır. Yine bu hadis icare akdinin meşruiyetine de delil gösterilmiştir. Çünkü el emeğinin, başkasına ya da sadece kişinin kendislhe faydalı olmaktan öte bir anlam ifade eder. 3. Görülen o ki Davud'un eliyle yaptığı zırh dokumaktl. Allah ona demiri yumuşatınıştı. O zırhları dokur ve bunları satardı. Hükümdarların büyüklerinden olmakla birlikte ancak onlardan kazandıklarından yer idi. Çünkü yüce Allah: \"Ve onun mülkünü pekiştirdik. \"[Sad,20] diye buyurmaktadır. Bu başlığın birinci hadisinde de buna delilolacak ifadeler bulunmaktadır. Çünkü o, bineklerine binmek istediği zaman onların eğerlenmesini emredecek ve bu hizmetleri başkaları görecek şekilde bolluk içerisinde bulunmakla birlikte, vera'a uygun hareket eder ve ancak eliyle yaptıklarından yerdi",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 3420,
			"arabicnumber": 3420,
			"text": "Abdullah b. Amr dedi ki: \"Resulullah Sallallahu Aleyhi ve Sellem bana dedi ki: Allah'm en sevdiği oruç Davud'un orucudur. O, bir gün oruç tutar, bir gün oruç tutmazdı. Allah'ın en sevdiği namaz, D6vud'un namazıdır. Gecenin yarısmı uyur, üçte birini namaz kılar, geri kalan altıda birini de uyurdu",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 3421,
			"arabicnumber": 3421,
			"text": "Mücahid dedi ki: \"İbn Abbas'a sordum: Sad Suresinde secde edelim mi? O: \"Onun zürriyetinden Davud'a, Süleyman'a ... O halde sen de onların hidayetlerine uy. \"[En'am, 84-90] buyruklarını okudu. İbn Abbas r.a. dedi ki: Sizin Nebiiniz Sallallahu Aleyhi ve Sellem onlara uymakla emrolunmuş kimselerdendir.\" Hadis 4632,4806 ve 4807 numara ile gelecektir",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 3422,
			"arabicnumber": 3422,
			"text": "İbn Abbas r.a. dedi ki: \"Sad (Suresindeki secde) secde edilmesi kesin olarak istenmişlerden değildir. Bununla birlikte Nebi Sallallahu Aleyhi ve Sellem'in ondan dolayı secde ettiğini de gördüm.\" Fethu'l-Bari Açıklaması: \"Yüce Allah'ın: \"Güçlü kulumuz Davud'u hatırla. Çünkü o (Allah'a) çokça dönen birisi idi ... Ve onafasle'l-hitabı verdik.\" (Sad, 17-20) buyruğu.\" Davud aleyhisselam ileri derecede kahramanlık vasfına sahip birisi idi. el-Ewab lafzının tefsiri biraz sonra gelecektir. Bu hadise dair geniş açıklamalar yüce Allah'ın izniyle Tefsir bölümünde gelecektir. 40. Allah Teala dediki: Bir de Davud'a Süleyman'ı bahşettik. Süleyman ne güzel kuldu. Çünkü o seslice tesbih edip Allah'a yönelirdi. [Sad,30] ayeti. \" ... Benden sonra hiç kimseye nasip olmayacak bir mülk ver banaf\"m \"Şeytanıarın Süleyman'ın mülkü üzere okuduklarına tabi oldular. \"[Bakara, 102] \"Süleyman'ın emrine de rüzgarı verdik. Sabah esişinde bir aylık yol alırdı, akşam da bir aylık yol giderdi. Biz ona erimiş bakır pınarını sel gibi akıttık. Cinden bir kesim de Rabbinin emri ile eli altında iş görürlerdi. .. Kendisine köşkler\" Mücahid dedi ki: Saraylardan daha aşağı binalar \"dan, heykellerden, büyük havuzları andıran çanaklardan ve yerlerinde sabit kazanlardan istediğini yaparlardı. .. Kullarımdan şükreden ise pek azdır. Biz ölümüne hükmedince asasını yiyen ağaç kurdundan başkası onlara ölümünü göstermedi. Nihayet yere düşünce ... bu horlayıcı azap içinde devam etmezlerdi. \"[Sebe',12-14] \"Ben ancak hayırsevgisi ile meşgul iken Rabbimi anmaktan uzak kaldım ... Boyunlarını ve ayaklarını sıvazlamaya başlamıştı. \"[Sad, 32-33] _ Atların yelelerini ve ayaklarını sıvazladı, demektir- buyrukları \"es-Esfad\" zincirler demektir. Mücahid dedi ki: \"es-Safinat\" atın, ayaklarından birisini toynağının ucu üzerinde dayayıp durmasıdır. \"el-Ciyad\" hızlı giden at1ar demektir. \"Cesed\" şeytan anlamındadır. \"Ruhaen\" hoş ve rahat; \"haysu esab\" dilediği yerde, \"hesabsız\" herhangi bir harec, vebal olmadan, demektir",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 3423,
			"arabicnumber": 3423,
			"text": "Ebu Hureyre'den rivayete göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Dün cinlerden bir ifrit ansızın namazımı kesmek üzere ileri atıldı. Ancak Allah'ın yardımı ile gücüm ona yetti, onu yakaladım. Hepinizin onu görmesi için mescidin direklerinden birisine onu bağlamak istedim. Fakat kardeşim Süleyman'ın: \"Rabbim benden sonra kimseye vermeyeceğin bir mülk bağışlaf\" dediğini hatırlayınca ben de o ifriti hor ve hakir olarak geri çevirdim.\" \"ifrit\" insan ya da cinlerden azgın olan demektir. Tekil olan \"zibniyyetun\" lafzının çoğulunun ez-zebaniye diye gelmesi gibi",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 3424,
			"arabicnumber": 3424,
			"text": "Ebu Hureyre'den rivayete göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Davud oğlu Süleyman dedi ki: Bu gece yetmiş hanımı(mı) dolaşacağım. Bunların her birisi de Allah yolunda cihad edecek bir suvari doğuracaktır. Yanındaki arkadaşı ona: inşallah de, dedi. Fakat Süleyman demedi. Kadınlar -yarısı bulunmayan bir tek evlat dışında- hiçbir şekilde hamile kalmadılar. Nebi Sallallahu Aleyhi ve Sellem: Eğer o sözü (inşaaılah'ı) demiş olsaydı, bunlar Allah yolunda cihad edeceklerdi.\" Şuayb ile ibn Ebi'z-Zinad \"(yetmiş yerine) doksan\" demişlerdir ki, bu daha sahihtir",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 3425,
			"arabicnumber": 3425,
			"text": "Ebu Zer' r.a'dan dedi ki: \"Ey Allah'ın Resulü dedim. Hangi mescid daha önce bina edildi? O: Mescid-i Haram, diye buyurdu. Sonra hangisi, diye sordum. Sonra Mescid-i Aksa diye buyurdu. ikisi arasında ne kadar süre vardı, diye sordum. Kırk (yıl) diye buyurdu. Sonra şöyle buyurdu: Sen neredeyken namaz vakti girerse, orada namaz kıl. Yeryüzü de senin için bir mesciddir",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 3427,
			"arabicnumber": 3427,
			"text": "Yine dedi ki: \"İki kadın ve beraberlerinde onların iki oğlan çocukları vardı. (Bunlar yolda giderken) kurt geldi, bunlardan birisinin çocuğunu kapıp gitti. Bunun üzerine (çocuğunu kurt kapan büyük) kadın, arkadaşı küçük kadına: Kurt senin çocuğunu götürdü, dedi. Diğer kadın da: Hayır, senin çocuğunu götürdü, dedi. bu iki kadın muhakemelerini Davud'a arzettiler. O da büyük kadın lehine hükmetti (Kurdun kaptığı çocuk, küçük kadına âid oldu). Bunlar mahkemeden çıkıp Davud'un oğlu Süleyman'a gittiler. Ve babasının hükmünü yeniden ona bildirdiler. O da: Bana bir bıçak getirin de çocuğu iki kadın arasında paylaştırayım, dedi. üzerine küçük kadın: Aman öyle yapma! Allah sana merhamet etsin! Çocuk bu kadınındır, dedi. bu söz üzerine çocuğun küçük kadına âid olduğuna hükmetti\". Hureyre: Vallahi ben \"Sikkîn\" sözünü o güne kadar hiç işitmemiştim; biz bıçağa sâdece \"Müdye\" diyorduk, demiştir",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 3428,
			"arabicnumber": 3428,
			"text": "Abdullah dedi ki: \"İman edenlere ve imanlarına zulüm karıştırmayanlara gelince ... \"[En'am, 82] buyruğu nazil olunca Nebi Sallallahu Aleyhi ve Sellem'in ashabı: Hangimiz imanına zulüm karıştırmaz ki, dediler. Bunun üzerine: \"Allah'a ortak koşma! Şüphesiz şirk pek büyük bir zuıümdür.\"[Lukman, 13] ayeti nazil oldu",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 3429,
			"arabicnumber": 3429,
			"text": "Abdullah r.a. dedi ki: الذين آمنوا ولم يلبسوا إيمانهم بظلم \"İman edenlere ve imanlarına zulüm karıştırmayanlara gelince ... \"[En'am, 82] ayeti nazil olunca bu, Müslümanlara ağır geldi ve: Ey Allah'ın Resulü, bizden kim nefsine zulmetmez ki, dediler. Şöyle buyurdu: \"Kasıt o değildir. Kasıt şirk koşmaktır. Sizler Lukman'ın oğluna öğüt verirken söylediği: \"Oğulcağızım! Allah'a ortak koşma! Çünkü şirk pek büyük bir zuıümdür.\"[Lukman, 13] dediğini hiç duymadınız mı?\" Fethu'l-Bari Açıklaması: Yüce Allah'ın: \"Andolsun biz Lukman'a hikmeti verdik ... Muhakkak şirk pek büyük bir zulümdür\" buyruğunda sözkonusu edilen Lukman hakkında görüş ayrılığı vardır. Onun Habeşistanlı olduğu söylendiği gibi, NObeli (Sudan'ın kuzey kısımları) olduğu da söylenmiştir. Nebi olup olmadığı da ihtilaflrdır. es-Sevrı Tefsir'inde Eş'as'dan, o İkrime'den, o İbn Abbas'tan şöyle dediğini rivayet etmektedir: Lukman Habeşistanlı marangoz bir köle idi. İbn Ebi Şeybe'nin Musannefinde de tabiınden bir kişi olan Halid b. Sabit er-Rib'i'den buna benzer bir rivayet zikredilmiştir. Taberı, Yahya b. Said el-Ensari yoluyla, Said b. el-Müseyyeb 'den, Lukman'ın Mısır'ın siyahilerinden kalın dudaklı birisi olduğunu rivayet etmektedir. Allah ona hikmeti vermiş, ancak Nübuvvet vermemiştir. el-Müstedrek'te de sahih bir sened ile Enes'ten şöyle dediği rivayet edilmektedir: \"Davud zırh dokurken Lukman da onun yanında bulunuyordu. Lukman yaptığı işe hayret ediyor ve ona bu işin faydasını sormak da istiyordu. Ancak hikmeti ona buna dair soru sormasını engelliyordu.\". Bu hadis onun Davud aleyhisselam ile çağdaş olduğunu açıkça ortaya koymaktadır. Şube, el-Hakem'den, o Mücahid'den salih bir kimse olduğunu, ancak nebi olmadığını söylediğini nakletmektedir. Denildiğine göre onun nebi olduğunu sadece İkrime söylemiştir. Said b. Ebi Arube, Katade'den yüce Allah'ın: \"Andolsun biz Lukman'a hikmet; ı;:rdik\" buyruğu hakkında şunları söylediğini rivayet etmektedir: Ona din hususunda derinlemesine bilgi sahibi olmayı (tefakkuh) verdik, fakat o bir nebi değildi. İlim bölümünün baş taraflarında İbn Abbas'ın rivayet ettiği \"Allah'ım, ona hikmeti öğret\" hadisi açıklanırken hikmetten kastın ne olduğuna dair açıklamalar da geçmiş bulunmaktadır. Lukman'ın terzi olduğu söylendiği gibi, marangoz olduğu da söylenmiştir",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 3430,
			"arabicnumber": 3430,
			"text": "Malik b. Sa'saa'dan rivayete göre \"Allah'ın Nebii Sallallahu Aleyhi ve Sellem kendilerine İsra'ya götürüldüğü geceyi anlattı: Daha sonra ikinci semaya gelinceye kadar yukarı çıktı. Kapının açılmasını istedi. O kim, diye soruldu, Cibril, diye cevap verdi. Beraberinde kim var, diye soruldu, Muhammed dedi. Ona nsalet verildi mi, diye soruldu, evet dedi. Ordan geçince teyze çocukları olon Yahya ve İsa ile karşılaştı m. (Cebrail): Bunlar Yahya ve İsa'dır, haydi onlara selam ver, dedi. Ben de selam verdim, selamımı aldıktan sonra: Salih kardeşe ve salih nebiye merhaba dediler. \" Fethu'l-Bari Açıklaması: \"Hafi lütufkar demektir\" açıklaması ile ilgili olarak Ebu Ubeyde yüce Allah': \"O bana hajfdir. \"[Meryem, 47] Bana lütuflarda bulunandır, demektir",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 3431,
			"arabicnumber": 3431,
			"text": "Ebu Hureyre r.a. dedi ki: \"Resulullah Sallallahu Aleyhi ve Sellem'i şöyle buyururken dinledim: Ademoğullarından doğan her bir kişiye doğduğu zaman mutlaka şeytan dokunmuştur. Şeytan'ın dokunmasından dolayı ağlayarak dünyaya gelir. Bundan Meryem ve oğlu müstesnadır. Daha sonra Ebu Hureyre şu buyruğu okudu. \"Ben onu da, zürriyetini de kovulmuş şeytandan sana sığındırdım. ' Ali İmran, 36 Fethu'l-Bari Açıklaması: \"Ademoğullarından her bir doğana doğduğu zaman mutlaka şeytan dokunur.\" \"İblisin nitelikleri\" başlığında geçen Said b. el-Müseyyeb'in, Ebu Hureyre 'den yaptığı rivayet açıklanırken burada sözkonusu edilen dokunmaya dair açıklamalar yapılmıştı. Ordaki lafzıyla rivayet şöyledir: \"Şeytan her bir Adem evladı doğduğunda onun böğrünü dürter. Meryem oğlu İsa müstesna. Onu dürtmek isteyince hicabı dürttü.\" Buradaki hicabdan kasıt çocuğun içinde bulunduğu eşidir. Kurtubı der ki: İşte şeytan ın bu dürtmesi onun musallat kılınmasının başlangıcıdır. Yüce Allah, Meryem'in annesinin yaptığı duanın bereketiyle Meryem'i ve oğlunu muhafaza etmiştir. Çünkü o şöyle dua etmiş ve: \"Ben onu da, zürriyetinden gelecek olanları da kovulmuş şeytandan sana sığındırıyorum. \" [Al-i İmran, 36] demişti. Meryem'in de İsa dışında zürriyeti olmamıştır. \"Şeytanın dokunmasından dolayı ağlayarak doğar.\" Sözü geçen Ma'mer yoluyla gelen rivayette \"şeytan ın dürtmesinden dolayı\" şeklindedir. Yani doğar doğmaz küçük çocuğun ağlamasının sebebi, şeytan ın ona dokunmasının verdiği acıdır",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 3432,
			"arabicnumber": 3432,
			"text": "Ali r.a.'dan dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem'i şöyle buyururken dinledim: Onun (dünyada ona çağdaş olanların) kadınlarının hayırlısı İmran kızı Meryem'dir. Onun (bu ümmetin) kadınlarının hayırlısı ise Hatice'diı'.\" Hadis ileride 3815 numara ile gelecektir. Fethu'l-Bari Açıklaması: (Parantez içerisindeki açıklamalar Fethu'l-Bari'deki şerh dikkate alınarak yapılmıştır. ) \"Hani melekler: Ey Meryem şüphesiz ki Allah seni seçti. .. \"[Ali İmran, 42] Buhari yüce Allah'ın: \"Şüphesiz Allah seni seçti\" buyruğunuonun (Meryem'in) bir nebi olduğuna delil göstermiştir. Ancak bu, bu hususta açık değildir. Bu kanaatini de Meryem Suresinde onun nebilerle birlikte sözkonusu edilişi ile desteklemektedir. Fakat onun \"sıddıka\" diye nitelendirilmiş olması (nebi oluşuna) engel değildir. Çünkü Yusuf da bu şekilde nitelendirilmiştir. el-Eş'arı'den nakledildiğine göre kadınlar arasında birden çok nebi vardır. İbn Hazm ise bunları altı tane olarak tespit etmiştir: Hawa, Sara, Hacer, Musa'nın annesi, Asiye ve Meryem. Kurtubı ise Sara ve Hacer'i saymamaktadır. Bunu (İbn Abdi'l-Berr), et-Temhıd adlı eserinde fukahanın bir çoğundan nakletmiş bulunmaktadır. Kurtubı der ki: Sahih olan Meryem'in nebi olduğudur. (Kadı) Iyad der ki: Ancak cumhur aksi kanaattedir. Nevevı ise el-Ezkar adlı eserinde İmamın (İmamu'l-Harameyn'in), Meryem'in nebi olmadığı hususunda icma' bulunduğunu belirttiğini nakletmektedir. Fakat el-Hasen'den gelen rivayete göre kadınlar arasında da, cinler arasında da nebi yoktur. es-Sübkı el-Kebir der ki: Bana göre bu meselede sahih herhangi bir rivayet yoktur. es-Süheylı bunu er-Ravdu'l-Unuf adlı eserinin sonunda fukahanın bir çoğundan diye nakletmiş bulunmaktadır. \"Kadınlarının hayırlısı Hatice'dir.\" Bu ümmetin kadınlarının hayırlısı demektir. Kadı Ebu Bekir b. el-Arabı der ki: Bu hadis dolayısıyla bu ümmetin kadınlarının en faziletlisi kayıtsız ve şartsız olarak Hatice'dir. Musa'nın kıssasının sonlarında da Ebu Musa yoluyla gelen Meryem ve Asiye'nin sözkonusu edildiği hadiste ise her ikisinin diğer kadınlardan faziletli olmaları gerektiği anlaşılmaktadır. Bu hadis de Meryem'in Asiye'den daha faziletli olduğunu, Hatice'nin de bu ümmetin kadınlarının en faziletlisi olduğunu göstermektedir",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 3433,
			"arabicnumber": 3433,
			"text": "Ebu Musa el-Eş'ari r.a. dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: Aişe'nin kadınlara üstünlüğü tiridin diğer yemeklere üstünlüğü gibidir. Erkeklerden pek çok kişi kemale erdiği halde kadınlardan ancak İmran kızı Meryem ile Firavun'un karısı Asiye kemale ermiştir",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 3434,
			"arabicnumber": 3434,
			"text": "Ebu Hureyre r.a. dedi ki: \"Resu!ullah Sallallahu Aleyhi ve Sellem'i şöyle buyururken dinledim: Kureyş'in kadınları deve sırtına binmiş kadınların hayırlılarıdır. Çocuklara karşı en şefkatlileri, kocalarının sahip olduğu malı, mülkü en iyi kollayıp gözetenleridir.\" Ebu Hureyre bunun akabinde der ki: İmran'ın kızı Meryem ise asla deve sırtına binmemiştir. Hadis 5082 ve 5365 numara ile gelecektir. Fethu'l-Bari Açıklaması: İbrahim'in bu açıklamadan maksadı, yüce Allah'ın onu mesh ederek, günahlardan temizleyip, arındırdığını ifade etmektir. Bundan dolayı bu kelime meful anlamında fall veznindedir. Derim ki: Ona Mesıh denmesi ile Deccal'e Mesih denilmesi arasında fark vardır. Çünkü ona bu ismin verilişi, fail anlamında fall veznindedir. Denildiğine göre ona bu adın veriliş sebebi, onun yeryüzünü meshetTnesi (aolaşması)dır. Bir başka görüşe göre ona bu adın veriliş sebebi, gözlerinin meshedilmiş olmasıdır. Bu durumda ona Mesih denilmesi de mefCı! anlamındadır. Yine İsa Mesih hakkında açıklandığına göre, bu isim \"yeryüzünü meshetti\" tabirinden türetilmiştir. Çünkü o belli bir yerde karar kılmamıştı. Bir diğer açıklamaya göre ona bu adın veriliş sebebi, hastalığı ve musibeti olan her kime (eliyle) meshederse (sürerse) mutlaka iyileşmesi idi. Oldukça güzelolduğundan ötürü bu adın verildiği de söylenmiştir. Yüce Allah onu güzel bir şekilde yarattı, anlamında \"mesehahullah\" denilir. Arapların, \"Bihi mishatun min cemal: O pek güzeldir\" şeklindeki tabirieri de buradan gelmektedir. \"Mücahid dedi ki: el-Kehl, halım demektir.\" Ebu Cafer en-Nehhas da şöyle demektedir: Bu anlam dilde bilinmemektedir. Araplara göre kehl, kırkına basmış ya da yaklaşmış kimseye denilir. Otuzu aşmış kimseye denileceği de söylenmiştir. Otuzüç de denilmiştir. Görüldüğü kadarıyla Mücahid bu açıklamayı bu adı alan kişide çoğunlukla görülen durumu göz önünde bulundurarak yapmıştır. Çünkü el-kehl denilen kişi çoğunlukla vakarla ve sükunetle hareket eder. \"En şefkatlisi\" (anlamındaki ahnahu), babanın ölümünden sonra çocuğuna bakan kadın hakkında kuııanılır. Kadın çocuğuna şefkat gösterdi (hadanet) tabiri babanın ölümünden sonra evlenmediği takdirde kuııanılır. İbnu't-Tın der ki: Evlenecek olursa o kadına bu vasıf verilmez. \"Bunun sonunda Ebu Hureyre der ki: İmran kızı Meryem ise asla bir deveye binmiş değildir.\" Ebu Hureyre bu sözleriyle Meryem'in hayırlı kadınlar olarak anılan kadınların kapsamına girmediğini kastetmektedir. Çünkü Nebi Sallallahu Aleyhi ve Sellem onları deveye binrnek kaydı ile sözkonusu etmiştir. Meryem ise deveye binenlerden değildi. Bu açık1amasıyla sanki o, Meryem'in kayıtsız ve şartsız olarak en faziletli kadın olduğu görüşünde idi",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 3435,
			"arabicnumber": 3435,
			"text": "Ubade r.a.'dan rivayete göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Kim Allah'tan başka hiçbir ilah olmadığına, onun tek olduğuna, ortağının bulunmadığına, Muhammed'in onun kulu ve Resulü olduğuna, İsa'nın Allah'ın kulu, Resulü, Meryem'e bıraktığı kelimesi ve kendinden bir ruh olduğuna, cennetin hak, cehennemin de hak olduğuna şehadet ederse, Allah da onu ameli ne olursa olsun cennete girdirir.\" Fethu'l-Bari Açıklaması: Kurtubı dedi ki: Bu hadisten maksat, Hıristiyanların İsa ve annesi ile ilgili içine düştükleri sapıklıklara dikkat çekmektir. Ayrıca bu hadisten Hıristiyanın, Müslüman olması halinde ona nasıl bir telkinde bulunulacağı da anlaşılmaktadır. Nevevı der ki: Bu büyük bir önem taşıyan bir hadistir. İtikadi hususları ihtiva eden en kapsamlı hadislerden birisidir. Çünkü bu hadis, inançlarının farklılıklarına, birbirlerinden uzak oluşları na rağmen bütün küfür milletlerinin küfürlerinden nasıl çıkabileceklerini bir arada ifade etmiş bulunmaktadır. Başkası da şöyle demektedir: İsa'nın sözkonusu edilmesi ile Hıristiyanlara işaret edilmekte, onların TesIIsi kabul etmekle birlikte iman etmelerinin katıksız ir şirk olduğuna dikkat çekilmektedir. \"Onun kulu\" buyruğu da bu şekildedir. \"Onun Resulü\" ifadesi ile de onun Resuloluşunu inkar eden, ona da, annesine de münezzeh oldukları iftiralarda bulunan Yahudilere işaret edilmektedir. Hadis-i şerifteki: \"Ve onun kadın kulunun oğludur\" ifadesi onun şerefinin yüceliğine dikkat çekmek içindir. (bu ifade buhari'nin değil Müslim'in rivayetinde geçer) Ona \"ruh\" adının verilmesi ve \"kendinden\" olmakla onu nitelendirmesi de bu şekilde olup, yüce Aııah'ın şu buyruğuna da benzemektedir: \"Göklerde ve yerde bulunanların tümünü kendinden size Musahhar kılmıştır. \"[Casiye, 13] Yani o, onun tarafından yaratılmış bir varlıktır. Diğer ayetin anlamı da onun bütün bu şeyleri kendi tarafından Musahhar kıldığı manasındadır. Yani o bütün bunları kudret ve hikmeti ile yaratan, yoktan var eden, icat edendir. \"Onun kelimesidir\" buyruğu da İsa aleyhisselam'ın Allah'ın kuııarına karşı bir delili olduğuna işarettir. Çünkü onu babasız Olarak yaratmış, zamanı gelmeden önce onu konuşturmuş, onun eııeri ile ölüleri .diriltmiştir. \"Cunaderden şu fazlalığı eklemektedir\" .. \" ********* Hadisin sonunda orjinal Buharı'de şu ibareler de yer almaktadır: \"el-Velid (hadisi Buharı'ye nakleden Sadaka'ya hadisi aktaran kişidir) dedi ki: Bana İbn Cabir•de Umeyr'den, o Cunade'den diye anlattı ve şunları ekledi: Cennetin sekiz kapısından hangisinden dilerse (cennete girecektir).\" Fethu'I-Badyi ihtisar eden muhterem Ebu Suhayb, Buhari'de esasen mevcut olan bu ibareyi hadisin sonunda zikretmemiş olmakla birlikte Fethu'l-Bari'den ona dair açıklamaları naklettiği için, dipnotta bu fazlalığa işaret etmemiz gerekli görülmüştür. ********* \"Ameli ne olursa olsun\" ifadesi de ameli ister salih olsun, ister bozuk olsun, demektir. Esasen tevhid ehli olanların cennete girmeleri kaçınılmaz bir husustur. O bakımdan \"ameli ne olursa olsun\" buyruğunun şu anlama gelme ihtimali vardır: Cennet ehli olan herkes, ameline göre uygun derecelerde cennete girecektir. Beydavı Aııah Resulünün: \"Ameli ne olursa olsun\" sözleri hakkında şunları söylemektedir: Bu, iki bakımdan Mutezile'ye karşı bir delildir: Onların iddialarına göre asi kişi cehennemde ebediyyen kalacaktır. Tevbe etmeyen kimsenin de cehenneme girmesi vaciptir. Ancak Aııah Resulünün \"ameli ne olursa olsun\" sözleri \"Allah onu cennete girdirir\" sözünden haldir. O vakitte ise amel sözkonusu olmayacaktır. Tevbe etmeden ölen kimse hakkında ise, bu durum ancak yüce Allah'ın cezalandırmadan önce onu cennete koyması halinde düşünülebilir. Ancak şefaat ile ilgili hadislerden anlaşıldığına göre bazı günahkarlar azap edildikten sonra cehennemden çıkartılacaktır. Bu durumda bu umumi ifade bu hadislerle tahsis edilir. Aksi takdirde bütün günahkarlar için (cehennemde azap edilmek) korkusu nasıl sözkonusu ise onlar için (cennete girmek) umudu da sözkonusudur. İşte ehl-i sünnetin: Onlar ilahı meşietin muhtemel tehlikesi altındadır, şeklindeki sözlerinin anlamı da budur",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 3436,
			"arabicnumber": 3436,
			"text": "Ebu Hureyre'den rivayete göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Beşikte sadece üç kişi konuşmuştur. (Bunlardan biri) İsa'dır. {Diğerine gelince} İsrailoğulları arasında Cureyc adında bir adam vardı. Namaz kılıyordu. Annesi yanına gelip onu çağırdı. (Kendi kendisine): Ona karşılık mı vereyim, yoksa namaza mı devam edeyim dedi. Annesi: Allahlım sen ona fahişelerin yüzlerini göstermeden canını alma. Cureyc manastmnda iken bir kadın karşısına çıkt,l, onunla konuştu. O kadından yüz çevirdi. Daha sonra bir çobanın yanına gitti. Çobanın kendisi ile beraber olmasına imkan tanıdı. Bir çocuk doğurdu. Kadın: Bu, Cureyc'dendir, dedi. İnsanlar onun yanına gittiler, manastırını yıktılar, oradan onu indirdiler, ona ağır sözler söylediler. Abdest aldıktan sonra namaz kıldı. Sonra çocuğun yanına giderek: Ey çocuk, baban kimdir, diye sordu. Çocuk: Çobandır dedi. Bu sefer manastırını yıkanlar: Senin manastırını altından bina edelim, dediler. O: Hayır çamurdan başkasını kabul etmem, dedi. (Üçüncülerine gelince) İsrailoğullarından bir kadın çocuğunu emziriyordu. Bineği üzerinde yakışıklı bir adam geçti. Annesi: Allah'ım, benim oğlumu da bunun gibi kıl, dedi. Çocuğu annesinin memesini bırakarak bineği üzerindeki adama dönüp: Allah'ım, beni onun gibi yapma, dedi. Sonra da annesinin memesini emmeye koyuldu. Ebu Hureyre dedi ki: Şu anda ben Nebi Sallallahu Aleyhi ve Sellem'in parmağını emişini görüyor gibiyim. Daha sonra bir cariyenin yanından geçti(ler). Annesi: Allah'ım, oğlumu bu cariye gibi kılma, dedi. Çocuk annesinin memesini bırakarak: Allah'ım, beni onun gibi kıl, dedi. Annesi: O nedenmiş, diye sordu. Çocuk dedi ki: Bineği üzerindeki adam zorbalardan bir zorba idi. Bu cariyeye ise hırsızlık yaptın, zina ettin diyorlar. Oysa o bunları yapmamıştır.\" BU HADİS’İN MÜSLİM RİVAYETİ VE İZAH İÇİN buraya tıklayın",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 3437,
			"arabicnumber": 3437,
			"text": "Ebu Hureyre r.a.'dan dedi ki: Nebi Sallallahu Aleyhi ve Sellem İsra'ya götürüldüğü gece(yi anlatırken) dedi ki: Musa ile karşılaştım. (Ebu Hureyre) dedi ki: Onu şöylece anlattı: Onun -zannederim şöyle dedi- aşırı olmamak üzere cüsseli birisi olduğunu gördüm. Saçları hafif dalgalı idi. Sanki Şenuelilerden bir damı andırıyordu. (Devamla) buyurdu ki: İsa ile de karşılaştım. -Nebi Sallallahu Aleyhi ve Sellem onun niteliklerini anlatarak şöyle buyurdu: \"Orta boylu, teni kırmızıya çalıyordu. Sanki hamamdan çıkmış gibi idi. İbrahim'i de gördüm. Onun soyundan gelen çocukları arasında ona en çok benzeyen kişi benim. (Devamla şöyle) buyurdu: Bana birisinde süt, diğerinde şarap bulunan iki kap getirildi. Dilediğini alabilirsin, denildi. Ben süt'ü alıp, içtim. Bana: Sen fıtrata doğru iletildin -ya da: fıtratı isabet ettirdin- denildi. Eğer şarabı almış olsaydın, senin ümmetin azmış olacaktı.\" AÇIKLAMA 1405. SAYFA 3447.HADİSTE",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 3438,
			"arabicnumber": 3438,
			"text": "İbn Abbas r.a. dedi ki: Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"İsa'yı, Musa'yı ve İbrahim'i gördüm. İsa kırmızı tenii, dalgalı saçlı, geniş omuzlu idi. Musa esmer, iri yapılı, saçları düz, Zut adamlarından birisi imiş gibiydi.\" AÇIKLAMA 1405. SAYFA 3447.HADİSTE",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 3440,
			"arabicnumber": 3440,
			"text": "",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 3441,
			"arabicnumber": 3441,
			"text": "Salim, babasından dedi ki: \"Hayır, Aııah'a yemin ederim ki Nebi Sallallahu Aleyhi ve Sellem, İsa için kırmızı tenlidir demedi. Fakat şöyle dedi: Ben uykuda iken Ka'be'yi tavaf ettiğimi gördüm. Esmer, düz saçlı bir adam görüverdim. İki adam arasında yürüyordu. Başından su damlıyordu -yahut da başından adeta su dök'ülüyordu.- Bu kimdir dedim, Meryem oğludur dediler. Oradan gittim. Bu sefer kırmızı tenii, iri cüsseli, saçları kıvırcık, sağ gözü kör, adeta gözü patlak bir üzüm tanesini andıran bir adam ile karşılaştım. Bu kimdir dedim. Bu Deccal'dir dediler. İnsanlar arasında ona en çok benzeyen kişi de İbn Katan'dır.\" ez-Zühri dedi ki: Bu, Huzaalılardan bir adam olup, cahiliye döneminde ölmüştür. AÇIKLAMA 1405. SAYFA 3447.HADİSTE",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 3442,
			"arabicnumber": 3442,
			"text": "Ebu Hureyre r.a. dedi ki: \"ResuJullah Sallallahu Aleyhi ve Sellem'i şöyle buyururken dinledim: İnsanlar arasında Meryem ağıtına en yakın benim. Çünkü bütün Nebiler anneleri ayrı, kardeş gibidirler. Benimle onun arasında da hiçbir Nebi yoktur. \" Hadis 3443 numara ile gelecektir. AÇIKLAMA 1405. SAYFA 3447.HADİSTE",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 3443,
			"arabicnumber": 3443,
			"text": "Ebu Hureyre dedi ki: \"Resuluilah Sallallahu Aleyhi ve Sellem şöyle buyurdu: Dünyada da, ahirette de insanlar arasında Meryem oğlu İsa'ya en yakın olan benim. Nebiler anaları ayrı kardeş gibidirler. Anneleri farklı, dinleri birdir.\" AÇIKLAMA 1405. SAYFA 3447.HADİSTE",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 3444,
			"arabicnumber": 3444,
			"text": "Ebu Hureyre r.a.dan rivayete göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Meryem oğlu İsa hırsızlık yapmakta olan bir adam gördü. Ona: Hırsızlık mı yaptın, diye sordu. Adam: Kendisinden başka ilah bulunmayan Allahla yemin ederim ki hayır, dedi. Bunun üzerine İsa: Allah'a iman ettim, gözümü yalanladım dedi.\" AÇIKLAMA 1405. SAYFA 3447.HADİSTE",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 3445,
			"arabicnumber": 3445,
			"text": "Ömer r.a.'dan rivayete göre, minber üzerinde dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem'i şöyle buyururken dinledim: Hıristiyanların Meryem oğlu (İsa) hakkında ileri derecede hak olmayan bir şekilde onu tazim edip övdükleri gibi siz de beni olmadık şekilde tazim edip övmeyiniz. Ben ancak onun kuluyum. Bu sebeple bana Allah'ın kulu ve Resulü deyiniz",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 3446,
			"arabicnumber": 3446,
			"text": "Ebu Musa elcEş'ari r.a. dedi ki: \"Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: Adam cariyesini güzel bir şekilde edeplendirir, ona güzel bir şekilde öğretir. Sonra da o cariyeyi azad edip onunla evlenecek olursa ona iki ecir verilir. Yine bir kimse İsa'ya iman ettikten sonra bana da iman ederse onun için iki ecir vardır. Köle Rabbine karşı takvalı olup, efendilerine itaat ederse onun için de iki ecir vardır",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 3447,
			"arabicnumber": 3447,
			"text": "İbn Abbas r.a.'dan dedi ki: \"Resulullah Sallallahu Aleyhi ve Sellem şöy le buyurdu: Sizler çıplak ayaklı, elbisesiz ve sünnetsiz olarak haşredileceksiniz. Daha sonra yüce Allah'ın: \"İlk yaratmaya başladığımız gibi onu tekrar iade ederiz. Biz bunu vaat edip üzerimize almıştık. Şüphesiz yapanlar bizleriz. \"[Enbiya, 104] buyruğunu okudu. Elbise giydirilecek ilk kişi İbrahim olacaktır. Bundan sonra ashabımdan bir takım adamlar sağa ve sola alınıp götürülecek. Ben: Ashabım(ı nereye götürüyorsunuz) diyeceğim, şöyle cevap verilecek: Sen onlardan ayrıldığından beri devamlı topukları üzerinde gerisin geri dönüp durdular. Bu sefer ben de salih kul Meryem oğlu İsa'nın dediği gibi diyeceğim: \"Ben aralarında bulunduğum müddeiçe üzerlerinde bir şahit idi m. Beni aralarından aldıktan sonra artık onlar üzerinde gözetleyici sen oldun. Sen her şeye hakkıyla şahitsin. Eğer onları azaplandırırsan şüphe yok ki onlar senin kullarındır ve eğer onlara mağfiret edersen şüphe yok ki sen Azizsin, Hakimsin. \"[Maide, 117-118] Muhammed b. Yusuf el-Firebri dedi ki: \"Ebu Abdullah (Buhari)'nin yanında Kabisa'nın şöyle dediği naklediidi: Burada kastedilenler Ebu Bekir döneminde irtidad edenlerdir. Ebu Bekir r.a. onlarla savaşmıştır.\" Fethu'l-Bari Açıklaması: \"İsrailoğulları arasında Cureye denilen birisi vardı.\" Manastır: Üst tarafı sivriltilmiş, yüksekçe bina demektir. \"Annesi onu çağırdı. Ona mı cevap vereyim yoksa namaz mı kılayım, dedi.\" Musannıf (Buharı), Mezalim bölümünde burada zikrettiği sened ile şunu da ilave etmektedir: \"Fakat ona cevap vermedi.\" Hadisteki \"hem annem, hem namazım\" ifadesi, ben hem annerne cevap vereyim, hem de namazımı bitireyim, Rabbim onlardan hangisi daha faziletli Oise onu yapma muvaffa.kiyetini bana nasip et, demektir. Ebu Rafi' yoluyla gelen rivayette de şöyle denilmektedir: \"Annesi onun namaz kılmakta' olduğunu gördü. Elini kaşının üzerine koyarak: Ey Cureye dedi. O: Rabbim, annem ve namazım (hangisini tercih edeyim), dedi. Namazını tercih etti. Annesi geri döndü. Daha sonra yanına bir daha geldi. Yine onun namazda olduğunu gördü. Ey Cureye ben senin annenim benimle konuş, dedi. Yine önceki gibi söyledi ... \" deyip hadisin geri kalan kısmını zikretti. İmran b. Husayn yoluyla gelen rivayette belirtildiğine göre, annesi yanına üç defa geldi ve ona seslendi. Her birisinde de onu üç defa çağırıyordu. el-A'rec'in, el-İsmail1'deki rivayetinde şöyle demımektedir: \"Annem ve Rabbim için kılmakta olduğum namaz. Ben namaz kılmayı anneme tercih ediyorum, dedi ve bu hususu üç defa zikretti.\" Namaz bölümünün sonlarında Yezid b. Havşeb'in babasından merfu olarak naklettiği şu rivayeti kaydetmiş bulunuyoruz: \"Eğer Cureye alim birisi olsaydı, annesine cevap vermesinin namazından daha evla (öncelikli) olduğunu bileçekti.\" (Annesi dedi ki): \"Allah'ım, ona fahişelerin yü.zünü göstermeden caf1lnı alma.'\" İmran b. Husayn yoluyla gelen rivayette şöyle denilmektedir: Annesi kızarak dedi ki: Allah'ım, fahişe kadınların yüzlerine bakmadan Cureye ölmesin. \"Sana manastırını altından yapalım, dediler. O: Ancak çamurdan yaparsanız olur (kabul edebilirim), dedi.\" Vehb b. Cerir yoluyla gelen rivayette: \"Siz bunu önceden olduğu gibi çamurdan bina ediniz\" dediği belirtilmektedir. Ebu Rafi' yoluyla gelen rivayet de şöyledir: \"Ona: Senin bu manastırını yıktığımız için altın ve gümüşten yeniden bina edelim, dediler. O: Hayır, fakat onu önceki hali gibi yeniden yapınız, dedi. Onlar da bunu yaptılar.\" Ebu Seleme rivayetinde şu fazlalık da vardır: \"Onu eski haline getirdiler, o da manastırına geri döndü. Ona: Allah aşkına neden güldün, diye sordular. O dedi ki: Benim gülmemin tek sebebi, annemin bana (vaktiyle) yapmış olduğu bedduadır.\" . Hadisten Çıkan Sonuçlar 1- Annenin isteğine cevap vermek nafile namaza tercih edilir. Çünkü nafile namazı sürdürmek de nafiledir. Annenin isteğine cevap vermek ve ona karşı iyi davranmak ise vacip (farz)dır. 2- Nevevi ve başkaları der ki: Annesinin ona yaptığı bedduanın kabul ediliş sebebi namazını kısa kesip, annesine cevap vermesinin mümkün oluşu idi. Fakat o muhtemelen manastırından ayrılmaya, dünyaya ve dünya ile alakalı işlere tekrar geri dönmeye kendisini çağıracağından korkmuştu. Nevevi böyle demektedir. Ancak bu su götürür bir iddiadır. Çünkü daha önce de geçtiği gibi annesi yanına gelir, o da onunla konuşurdu. Görüldüğü kadarıyla annesi onu özler, onu ziyarete gelir, onu görmek ve onunla konuşmak ile yetinir idi. Sanki onun namazını çabuklaştırıp, annesinin isteğine cevap vermeyişinin sebebi, namazdaki huşuunun kesileceğinden korkması idi. Namaz bölümünün sonlarında geçen Yezid b. Havşeb'in babasından diye naklettiği hadiste şöyle denilmektedir: \"Nebi sallal1ahu aleyhi ve sellem buyurdu ki: Eğer Cureyc fakih birisi olsaydı, annesine cevap vermesinin Rabbine ibadet etmekten daha öncelikli olduğunu da bilirdi.\" Bunu el-Hasen b. Süfyan rivayet etmiştir. Eğer hadisteki mutlak ifadeler yine oldukları gibi mutlak olarak ele alınacak olursa, kılınan namaz nafile yahut farz olsun annenin çağırıp seslenmesi halinde ona cevap vermek için mutlak olarak namazı yarıda bırakmanın caiz olduğu anlaşılır. Bu aynı zamanda Şafiı mezhebinde er-Ruyanl'nin naklettiği bir görüştür. Nevevı de başkalarına tabi olarak şöyle demektedir: Bu durum, onların şeriatinde bu şekilde hareket etmenin mubah olması demektir. Fakat bu da su götürür bir iddiadır. Ben bu hususu daha önce Namaz bölümünün sonlarında ele almış bulunuyorum. Şafillerce daha sahih olan görüş budur. Eğer namaz nafile olup, cevap vermeyi terk etmekten dolayı babanın rahatsız olacağı biliniyor ise, o takdirde ona cevap vermek icap eder, aksi takdirde icap etmez. Şayet namaz farz olup, vakit de daralmış ise onun isteğine cevap vermek vacip değildir. Eğer vakit dar ise İmamu'l-Harameyn'e göre cevap vermek vacip olur. Başkası ise ona muhalefet etmiştir. Çünkü namaza başlandı mı onun tamamlanması gerekir. Malikilere göre nafile namaz kılarken babanın çağrısına cevap vermek, namazı ürdürmekten daha faziletlidiri. Kadı Ebu'I-Velid'in naklettiğine göre ise bu sadece anneye ait bir özellika için sözkonusu değildir. 3- Hadisten anne babaya karşı iyi davranmanın, onların isteklerine -çocuğun mazereti bulunsa dahi- cevap vermenin büyük önemi anlaşılmaktadır. Fakat burada durum maksatıara göre farklılık arzedebilir. 4- Kişinin eli altındakiler eğer tehdit edilmelerini gerektiren bir şey yapacak olurlarsa, onlara karşı merhametli davranmak gerekir. Çünkü Cureyc'in annesi ona kızmakla birlikte ona yaptığı özel beddua dışında beddua etmedi. Eğer ona karşı yumuşak davranma yolunu seçmemiş olsaydı, bu kötü işi bizzat kendisinin işlemesi ya da katil olması için beddua ederdi. 5- Allah'a karşı samimi ve sadakat sahibi olan kimselere fitnelerin zararı olmaz. 6- Sözü geçen Cureyc'in yakıninin ne kadar güçlü ve Allah'a güvenin ümidinin ne kadar sağlam olduğu anlaşılmaktadır. Çünkü adeten yeni doğmuş bir çocuğun konuşmaması sözkonusu olmakla birlikte o, küçük çocuğun konuşmasını istemiştir. Çocuğun konuşacağına dair Allah'a karşı duyduğu güven sağlam olmasaydı Allah, onun konuşmasını itemezdi. 7 - İki iş birbiriyle çatışacak olursa onlardan daha önemlileri hangisiyse ona başlanır. Şanı yüce Allah da gerçek dostları belaya maruz kaldıkları takdirde onlara çıkış yollarını gösterir. Ancak bu, onları daha bir arındırmak ve onlara daha çok sevap vermek amacı ile bazı vakitlerde bazıları için gecikebilir. 8- Evliyanın kerametinin sabit olduğu, onların tercih ve istekleri ile keramet göstermelerinin sözkonusu olabileceği de anlaşılmaktadır. 9- Hayasızlık işlemiş bir kimsenin, riayet edilmesi gereken bir hürmeti kalmaz. Önemli işlerde yüce Allah'a sığınmak isteyen bir.kimse, namaz kılmak suretiyle ona yönelir. 10- Bazılarının iddialarının aksine abdest, yalnızca bu ümmete ait bir özellik değildir. Bu ümmete ait olan ise ahirette ğurra ve tahdl (denilen abdest nurunun kolların dirseklerden yukarı, ayakların da topuklardan yukarı yıkanması neticesinde görülecek olan nur)dur. Yine daha önce İbrahim kıssasında Sara'nın zorba hükümdar ile birlikte başından geçenlere dair anlatılan haberde benzeri bir durum geçmiş bulunmaktadır. Doğrusunu en iyi bilen Allah'tır. \"Yakışıklı\" güzelliği olan, görünüşü, kılığı kıyafeti güzel, görenin hayran olup, işaret ederek göstereceği türden birisi, diye açıklanmıştır. \"Annesi oğluna: Neden, diye sordu?\" Yani anne oğluna bu şekilde konuşmasının sebebini sordu. Hadisten anlaşıldığına göre dünyadakilerin tasavvurları, zahiri hayal edebildiği yere kadar gider ve orada durur. Bundan dolayı mevcut halin kötülüğünden korkar. Oysa tahkik ehli olanlar böyle değildir. Onlar bMın! hakikat ile birlikte olurlcG. Bundan dolayı iç dünyalarının güzelolması halinde başka şeylere aldırmazlar. Nitekim yüce Allah'ın Karun'un arkadaşları ile ilgili naklettiklerinden de bu anlaşılmaktadır. O karşılarına ihtişam ve debdebesiyle çıktığında bazıları şöyle demişti: \"Keşke Karun'a verilen gibi bize de verilseydi. .. Kendilerine ilim verilenler ise dediler ki: Vah size ... Allah'ın sevabı daha hayırlıdır.\"[Kasas, 79-80] Bu hadisten anlaşıldığına göre, insanlar hayır dilernek konusunda çocuklarını kendilerine tercih edecek bir tabiatta yaratılmışlardır. Çünkü kadın çocuğu için hayır istemiş, ondan kötülüğün uzaklaştırılmasını dilemiş fakat kendisi adına bir şey istememiştir. \"Sanki o Zutlulardan bir adamdı.\" Yani siyahilere benzeyen birisi idi. \"Ancak Mesih Deccal'in sağ gözü kördür. Gözü adeta patlak\" yani öne çıkmış olduğu açıkça görülen \"bir üzüm tanesini andırır.\" \"Salim'den\" ile kastedilen Abdullah b. Ömer'in oğlu Salim'dir. \"Ben uyurken\" (rüyamda) \"Ka'be'yi tavaf ettiğimi gördüm.\" Bu onun bu seerki Nebileri görmesinin daha önce Ebu Hureyre'nin rivayet ettiği hadiste geçen görmekten farklı olduğunu göstermektedir. Çünkü Ebu Hureyrelnin rivayet ettiği hadiste anlatılanlar İsra gecesinde olmuştu. Her ne kadar İsra'nın tamamıyla rüyada olduğu söylenmiş ise de doğru olan İsra'nın uyanık halde iken gerçekleştiğidir. \"İnsanlar arasında Meryem oğluna en yakın olan benim.\" Abdurrahman b. Ebi Amra'nın, Ebu Hureyre'den diye naklettiği rivayette de şöyle denilmektedir: \"İnsanlar arasında Meryem oğlu İsa'ya dünyada da, ahirette de en yakın olan kişi benim.\" Bu da insanlar arasında onun en hası ve ona en yakın olan kişi benim, demektir. Çünkü o Muhammed Sallallahu Aleyhi ve Sellem'in kendisinden sonra geleceği müjdesini vermiştir. \"Enbiya anneleri farklı kardeşler gibidir.\" Sözü geçen Abdurrahman yoluyla gelen rivayette \"nebiler anneleri ayrı kardeşlerdir\" şeklindedir. (Anneleri ayrı diye Türkçeleştirilen) ei-AHat, kuma olan kadınlar demektir. Çünkü birisi bir kala evlendikten sonra bir başkası ile evlenecek olursa ondan içmiş gibidir. Çü (mastarını teşkil eden) el-alel, ardı arkasına su içmek anlamına gelir. Annelerı ayrı kardeşler (evladu'l-allat) ise anneleri farklı, babaları bir kardeşler demektir. Hadisin anlamı da şudur: Onların dinleri asıl itibariyle birdir, bu asıl da tevhittir. Şeriatın fer'i hükümlerinde farklılık olsa bile. Maksadın farklı zamanlarda gönderilmeleri olduğu da söylenmiştir. \"Benimle onun arasında bir nebi yoktur.\" Bunu insanlar arasında İsa'ya en yakın olanın kendisi olduğu şeklindeki sözüne delil gibi göstermiş görünmektedir. O bunu İsa'dan sonra bizim Nebiimizin dışında bir Nebi gönderilmediğine de delil göstermiştir .. \"Gözümü yalanladım.\" Kurtubi der ki: İsa'nın hırsızlık yapan adama: \"Sen hırsızlık yaptın\" şeklindeki ifadesinin zahirinden anlaşıldığına göre, adamın hırsızlık yaptığı kesin olarak dile getirilen bir husustur. Çünkü o koruma altında olan bir malı gizlice aldığını görmüştü. Adamın ise \"Asla hayır\" demesi bunu reddetmek anlamındadır. Daha sonra da bunu yemin ile pekiştirmiştir. İsa'nın: \"Ben Allah'a iman ettim, gözümün gördüğünü de yalanladım\" sözüne gelince, ben Allah adına yemin edeni tasdik ederim. Alınan o şeyin bana hırsızlık olarak görünmesi halini de yalanlarım. Çünkü adamın hakkı olan bir malı almış olma ihtimali vardır yahut o malın sahibi o kimseye o malı atmış olmasına izin vermiş olabilir. Onu alıp evirip çevirmek ve onu görmek maksadıyla almış, gasp ya da onu ele geçirmek maksadını da gütmemiş olabilir. (Kurtubi devamla) dedi ki: Bununla birlikte İsa'nın bu sözü kesin bir ifade anlamını da taşımayabilir. O \"hırsızlık yaptın\" derken ona hırsızlık mı yaptın, diye sormak istemiş de olabilir. Bu durumda soru edatı hazfedilmiş demektir. Bu da . kurallara uygun bir kullanımdır ve çokça görülen bir şeydir. (Kurtubi'nin açıklamaları burada sona ermektedir.) Nebi Sallallahu Aleyhi ve Sellem'in \"İsa, hırsızlık yapan bir adam gördü\" diye kat'i bir ifade kullanmışken bunu soru kastıyla söylemiş olma ihtimali uzaktır. O malın alınmasının onun için helal olma ihtimali de 'Yine Nebi efendimizin kesin olarak kullandığı aynı ifade dolayısıyla uzak bir ihtimaldir. Birinci ihtimal Kadı lyad'ın açıklamalarından alınmıştır. Fakat İbnu'l-Kayyim \"İğasetu'l-lehfan\" adlı eserinde ona şöylece cevapvermektedir: Bu oldukça zorlanılarak yapılmış bir açıklamadır. Hakikat şu ki, Hz. İsa yüce Allah'ın, İsa'nın kalbinde herhangi bir kimsenin yalan yere adını zikredip, yemin edemeyeceği kadar büyük bir konumda idi. Bundan dolayı ya yemin edeni itham edecekti ya da kendi gözünü. O da kendi gözünü itham etme yolunu seçti. Nitekim A.dem de İblis kendisine samimiyetle öğüt verdiğine dair nasihatte bulunurken İblis'in doğru söylediğini zannetmiş idi. Derim ki: İbnu'l-Cevzi'nin bu tevili de zorlama olması bakımından Kadı lyad'ınkinden aşağı kalmaz. Benzetme de pek uygun değildir. Doğrusunu en iyi bilen Allah'tır. Bu hadis, şüphe sebebi ile haddin uygulanmayacağına, özel bilgisine dayanarak hakimin hüküm veremeyeceğine de delil gösterilmiştir. Malikiler ile Hanbelilerin tercih ettiği görüş ise bUİ1un mutlak olarak sözkonusu olmayacağı şeklindedir. Şafi1lere göre ise hadler dışında (hakimin özel bilgisine göre hüküm vermesi) caizdir. İşte bu hadise de bundan (hadler türünden)dir. İleride buna dair geniş açıklamalar yüce Allah'ın izniyle Ahkam bölümünde gelecektir.(7161nolu hadis) \"Beni aşırı övmeyiniz.\" Batıl iddialarla beni övmeye kalk]şmayınız. \"Hıristiyanların Meryem oğlu İsa'yı övdükleri gibi.\" Çünkü onlar İsa'nın ilah olduğunu ve daha başka özelliklere sahip olduğunu iddia etmişlerdir. \"Kişi cariyesini güzel bir şekilde tedib ederse\" sözü ile ilgili açıklamalar nikah bölümünde gelecektir. (5083 nolu hadis) \"Kişi İsa'ya iman ettikten sonra bana da iman ederse ona iki ecir vardır\" hususu ile ilgili olarak çeşitli konular, yeterli açıklamalarıyla İlim bölümünde geçmiş bulunmaktadır.(97 nolu hadis) Hadiste İsa ile bizim Nebiimiz sallallahu a1eyhi ve sellem arasında herhangi bir nebi gelmemiş olduğuna işaret edilmektedir",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 3448,
			"arabicnumber": 3448,
			"text": "Ebu Hureyre r.a. dedi ki: Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Nefsim elinde olan'a yemin ederim ki fazla zaman geçmeden Meryem oğlu aranızda adaleti i bir hakem olarak inecektir. Haçı kıracaktır, domuzu öldürecektir, savaşı kaldıracaktır, malokadar artacak ki kimse onu kabul etmeyecektir ve nihayet bir tek secde dahi dünyadan ve içindekilerinden hayırlı olacaktır.\" Daha sonra Ebu Hureyre dedi ki: Dilerseniz; \"Kitap ehlinden olup, ölümünden önce ona iman etmeyecek kimse yoktur. O da kıyamet günü aleyhlerinde bir şahit olacaktır.\"[Nisa, 159] buyruğunu okuyabilirsiniz",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 3449,
			"arabicnumber": 3449,
			"text": "Ebu Hureyre r.a. dedi; Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Sizin imamınız kendinizden olacağı halde, Meryem oğlunun ineceği zamanda haliniz ne olacak?\" Fethu'l-Bari Açıklaması: \"Çok geçmeden\" yani bunun gerçekleşmesi yakındır. Çabucak gerçekleşeceği kaçınılmaz bir şeydir. \"Aranızda inmesi\" bu ümmet arasında inmesi. Çünkü buyruk, onun ineceği zamana yetişmeyecek ümmetin bir kısmına hitaptır. \"Hakem\" hakim demektir. Yani o bu şeriat ile hükmeden birisi olarak inecektir. Çünkü bu şeriat bakidir, nesh olmayacaktır. İsa da bu ümmetin hakimIerinden bir hakim olacaktır. Müslim'de yer alan el-leys'in, İbn Şihab'dan naklettiği rivayetinde\"kıst yapan (adaletle hükmeden) bir hakem\" şeklindedir. Yine Müslim'de İbn Uyeyne'nin, İbn Şihab yoluyla kaydettiği rivayetinde \"kıst yapan bir imam\" yani adalet ile hükmeden bir önder (yönetici) demektir. Ancak \"kaasıt\" kelimesi böyle değildir. O, zalim demektir. \"Haçı kıracak, domuzu öldürecektir.\" Yani o gerçek manada haçı kırmakla Hıristiyanların azametli ve büyük olduklarına inandıkları şeylerin böyle olduğunu ortaya koymakla Nasraniliği (Hıristiyanlığı) iptal edecektir, çürütecektir. Bu hadisten anlaşıldığına göre domuz beslemek, onu yemek haramdır ve domuz necistir. Çünkü kendisinden yararlanılabilen bir şeyin telef edilmesi meşru değildir. BuyCı' (alışverişIer) bahsi sonlarında (2222 no da buna dair kısmi açıklama geçti) buna dair bazı açıklamalar geçmiş bulunmaktadır. Yine bu hadisten münker hususların değiştirilmesi, batıla hizmet eden araçların kırılması gereği de anlaşılmaktadır. Yani din bir tek din olacaktır. Zimmet ehlinden olup, cizyeyi ödeyecek kimse kalmayacaktır. Bir diğer görüşe göre anlamı şudur: Mal o kadar çok artacaktır ki, cizye olmak üzere alınacak malın harcanması mümkün olacak kimse kalmayacaktır. Böylelikle ona ihtiyaç olmayacağından cizye alınmayacaktır. Iyad der ki: \"Cizyenin kaldırılması\"ndan kastın, onun kafirlere hiçbir hatır gözetilmeden konulacağı anlamına gelme ihtimali de vardır. İşte malın çoğalmasının da sebebi bu olacaktır. Ancak Nevevı bunu kabul etmeyerek şunları söylemektedir: Doğrusu ise İsa'nın (kimseden) İslam dinine girmekten başka bir şeyi kabul etmeyeceğidir. Nevevı der ki: İslam şeriatinde cizye meşru' olmakla birlikte İsa'nın cizyeyi kaldırmasının manası şudur: Cizyenin meşruiyeti(nin devamı) İsa'nın nüzulü kaydına bağlıdır. Çünkü bu haber buna delil teşkil etmektedir. Yoksa İsa, cizye hükmünü neshetmeyecektir. Aksine bizim Nebiimiz bu sözü ile böyle bir neshi beyan etmektedir. İbn Battal der ki: İsa'nın nüzulünden önce cizyeyi kabul edişimizin sebebi, mala olan ihtiyacımızdır. Oysa İsa döneminde böyle olmayacaktır. Çünkü onU1'l zamanında mala ihtiyaç duyulmayacaktır. Onun zamanında malokadar çoğalacak ki kimse onu kabul dahi etmeyecektir. Cizyenin Yahudilerle Hıristiyanlardan kabul edilmesinin meşruiyeti ile ilgili olarak şöyle denilebilir: Onların ellerinde (Allah'tan gelmesi hususunda) şüpheli bir kitap bulunmaktadır ve onlar kendi iddialarıııa göre eski bir şeriate bağlıdırlar. İsa aleyhisselam, ineceği vakit onların bu şüpheleri bizzat kendisinin gözle görülmesiyle ortadan kalkmış olacaktır. Böylelikle onlar delil getirernernek. ve durumlarının açığa çıkması bakımından putperestler gibi olacaktır. Onlardan cizyenin kabul edilmemesi şeklinde bir muameleye tabi tutularak putperestlere yapılan muamele gibi onlara da muamele yapılması uygun düşecektir. İşte bunu hocalarımızdan biri, bir ihtimalolarak zikretmiş bulunmaktadır. Doğrusunu en iyi bilen Allah'tır. \"Ve mal çoğalacak.\" Çoğalmasınınnedeni ise, adaletli uygulamalar yapılıp zulüm olmaması sebebiyle bereketierin inmesi, hayırların ardı arkasına gelmesi olacaktır. O vakit yeryüzü, hazinelerini çıkartacak, Kıyametin yaklaştığına da.ir bilgi sahibi olmaları dolayısıyla mal edinmek arzuları da azalacaktır. \"Öyle ki, tek bir secde dahi dünyadan ve içindekilerden hayırlı olacaktır.\" Yani onlar 'o vakit yüce Allah'a mal tasadduk etmekle değil, sadece ibadet etmekle yakınlaşmaya çalışacaklardır. Anlamının şu olduğu da söylenmiştir: İnsanlar dünyaya iltifat etmeyecekler, hatta tek bir secdeyi dünyadan ve dünyadaki her şeyden daha çok seveceklerdir. \"Daha sonra Ebu Hureyre dedi ki: Dilerseniz: \"Kitap ehlinden olup ölümünden önce ona iman etmeyecek kimse yoktur ... \"[Nisa, 159] S.yetini okuyunuz.\" Yani İsa indikten sonra kitap ehli olan Yahudilerle Hıristiyanlardan ona iman etmeyecek kimse kalmayacaktır. \"Bu, Ebu ı;ureyre'nin yüce Allah'ın: \"Ona iman etmeyecek ... \" buyruğu ile: \"Olümüriden önce\" buyruğundaki zamirlerin ait olduğu şahıslar ile ilgili kanaati.nin bir neticesidir. Ona göre bu zamir İsa'ya aittir. Yani İsa ölmeden önce kitap ehfinden olan het:kes İsa'ya mutlaka iman edecektir. İbn Cerir'in, Said b. Cubeyr yoluyla sahih bir serıed ile İbn Abbas'tan naklettiği rivayete göre İbn Abbas da bunu kesin bi.r kanaat: olarak ifadeetmiştir . İlim adamları der ki: Diğer nebiler arasında İsa'nın nuzulündeki hikmet, Yahudilerin onu öldürdükleri şeklindeki iddialarını reddetmektir. Yüce Allah onların yalancı olduklarını beyan edecek ve İsa aleyhisselam Yahudileri öldürecektir. Müslim'in de İbn Ömer yolu ile rivayet ettiği bu hadiste, İsa'nın nüzulünden sonra yeryüzünde kalacağı süre yedi yılalacaktır. İsa aleyhisselam'ın göklere kaldırılmasından önce ölümü hususunda görüş ayrılığı vardır. Bu ayrılığın da asıl sebebi yüce Allah'ın: \"Ben seni vefat ettireceğim ve yükselteceğim. \"[Ali İmran, 55] buyruğudur. Bunun zahirinden ne anlaşılıyorsa onun kastedildiği söylenmiştir. Buna göre İsa yeryüzüne inip de onun için takdir edilen süre geçtikten sonra ikinci defa bir daha ölecektir. \"Seni vefat ettireceğim\" buyruğunun yerden seni vefat ettireceğim (arda kalı süren bittiği zaman seni alacağım) anlamında olduğu da söylenmiştir. Buna göre o, ancak ahir zamanda ölecektir. \"İmamınız sizden iken Meryem oğlu aranıza ine.ceği vakit haliniz ne olacak?\" Ebu'I-Has9.n el-Hasai el-Ebedi, Menakibu'ş-Şafii adlı eserinde şunları söylemektedir: Mehdi'nin bu ümmetten olacağına, İsa'nın da onun arkasında namaz kılacağına dair haberler tevatür derecesine ulaşmıştır. Ebu Zerr el-Herevi dedi ki: Bize el-Cevzaki önceki alimlerden birisinin şöyle dediğini nakletmiştir: \"İmamınız sizden\" ifadesi, onun İncil ile değil Kur'an ile hükmedeceği anlamındadır. İbnu't-Tin der ki: \"İmamınız sizden\" ifadesinin anlamı şudur: Şeriat-i Muhammediyye kıyamet gününe kadar kesintisiz devam edecektir. Her bir nesilde de ilim ehlinden bir kesim bulunacaktır. İşte bu hadis ve bundan önceki hadis, İsa'nın nüzulünden sonra imam yahut me'mum (yani başka bir imama uyan) olacağını beyan etmemektedir. İsa'nın imam olacağı kabul edilecek olursa bunun da anlamı şu olur: O cemaate katılmak ile birlikte bu ümmetten olacaktır. et-Tıybi der ki: Yani İsa sizin dininizden birisi olarak size imam olacaktır. Ancak Müslim'de bulunan bir başka hadis onun bu sözünü anlamsız kılmaktadır: \"Ona: Bize namaz kıldır denilecek, o hayır diyecektir. Çünkü sizin bir kısmınız diğer bir kısmınıza emirdir. -(Bu) bu ümmete bir ikram olarak verilmiştir.-\" İbnu'l-Cevzi der ki: İsa imam olarak öne geçecek olursa insanın içinde çözülmesi gereken bir problem ortaya çıkar ve şöyle denilir: O bir naib olarak mı öne geçip imam olmuştur yoksa yeni bir şeriat getiren birisi olarak mı? Bundan dolayı o cemaatten birisi gibi namaza uyacak, böylelikle Nebi efendimizin: \"Benden sonra hiçbir nebi gelmeyecektir\" buyruğu hiçbir şekilde şüphenin tozundan dahi etkilenmeyecektir. İsa'nın ahir zamanda ve kıyametin kopacağına yakın bir dönemde gelecek olmasına rağmen, bu ümmetten bir adamın arkasında namaz kılmasında, bu husustaki sahih olan görüşün lehine bir delil bulunmaktadır. Söz konusu görüş, Allah için delili ile ortada olacak bir kimsenin, yeryüzünde her zaman var olacağı şeklindedir. Doğrusunu en iyi bilen Allah'tır",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 3452,
			"arabicnumber": 3452,
			"text": "",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 3454,
			"arabicnumber": 3454,
			"text": "",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 3455,
			"arabicnumber": 3455,
			"text": "Ebu Hazim dedi ki: Beş yıl süreyle Ebu Hureyre ile oturup kalktım. Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletti: \"İsrailoğullarını nebiler idare ediyordu. Bir nebi vefat etti mi onun yerine bir başka nebi gelirdi. Ancak şu var ki benden sonra nebi gelmeyecektir. Halifeler olacak ve bunlar çoğalacaktır. Ashab: Bize ne emredersin, diye sordular. Şöyle buyurdu: Öncelikle kime bey'at ettiyseniz ona bağlı kalınız. Onlara haklarını veriniz. Şüphesiz Allah yönetsinler diye ellerinin altına verdiklerinden onları sorgulayacaktır",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 3456,
			"arabicnumber": 3456,
			"text": "Ebu Said r.a.'dan rivayete göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Sizden öncekilerin gittiği yolu karış karış, arşın arşın izleyeceksiniz. Hatta onlar bir kertenkele deliğine girecek olsalar, siz de ona gireceksiniz. Biz: Ey Allah'ın Resulü Yahudilerle, Hıristiyanları mı kastediyorsun, dedik. O: Başka kim olabilir ki, diye buyurdu.\" Bu hadis İleride 7320 numara ile gelecektir",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 3457,
			"arabicnumber": 3457,
			"text": "Bize Hâlid el-Hazzâ, Ebû Kılâbe'den tahdîs etti ki, Enes(radıyallahü anh) şöyle demiştir:(Sahâbîler çoğalıp da namaz vaktini tanıyacakları bir şeyle bildirmek istedikleri zaman) ateş yakmak, çan çalmak hatırlarına geldi. Yahudiler ve Hrıstiyanları da, yani bunların onlara âid işler olduğunu da düşündüler (ve vazgeçildi). Sonra Bilâl'e ezan lâfızlarını ikişer ikişer; ikaamet lâfızlarını birer birer söylemesi emrolundu",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 3458,
			"arabicnumber": 3458,
			"text": "Aişe r.anha'dan rivayete göre, o namaz kılan bir kimsenin namaz kılarken elini boğrüne koymasını mekruh görür ve: \"Bunu Yahudiler yapar, derdi",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 3459,
			"arabicnumber": 3459,
			"text": "İbn Ömer r.a'dan rivayete göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Geçmiş ümmetiere göre sizin eceliniz, ancak ikindi namazı ile güneşin batımına kadar olan süreye benzer. Sizin misaliniz ile Yahudilerle Hıristiyanların misali de bir takım işçileri ücretl tutmuş bir adama benzer. Bu adam: Birer kırat ücret karşılığında günün yarısına kadar kim benim için çalışır, dedi. Bunun üzerine Yahudiler birer kırat karşılığında günün yarısına kadar çalıştılar. Daha sonra: Günün yarısından itibaren ikindi namazına kadar birer kırat ücret karşılığında benim için kim çalışır, dedi. Hıristiyanlar da günün yarısından ikindi namazına kadar birer Klrat karşılığında çalıştılar. Daha sonra dedi ki: İkindi namazından güneşin batışına kadar ikişer kırat karşılığında benim için kim çalışır? Dikkat edin, işte ikindi namazından, güneşin batımına kadar ikişer kırat karşılığında çalışanlar sizlersiniz. Dikkat edin size ecir iki defa verilir. Yahudilerle Hıristiyanlar buna kızarak dediler ki: Biz daha çok amel ettiğimiz halde bize verilen daha az. Allah: Ben hakkettiğinizden az vererek size zulmettim mi, diye sordu. Onlar, hayır dediler. Şöyle buyurdu: Bu. benim Lutfumdur. Onu dilediğime veririm",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 3460,
			"arabicnumber": 3460,
			"text": "İbn Abbas r.a. dedi ki: Ömer r.a'ı şöyle derken dinledim: \"Allah filanı kahretsin. O Nebi Sallallahu Aleyhi ve Sellem'in Yahudilere lanet ettiğini bilmiyor mu? Onlara iç yağları haram edildi. Kendileri ise o yağları eritip, sattılar",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 3461,
			"arabicnumber": 3461,
			"text": "Abdullah b. Amr'dan rivayete göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Benden bir ayet dahi olsa tebliğ ediniz. İsrailoğullarından nakledebilirsiniz, bunda bir mahzur yoktur. Kasten aleyhime yalan söyleyen kimse de cehennemdeki yerine hazırlansın.\" Diğer tahric eden: Tirmizi İlim",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 3462,
			"arabicnumber": 3462,
			"text": "Ebu Hureyre r.a. dedi ki: \"Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: Yahudilerle Hıristiyanlar (ağaran saçlarını) boyamazlar. Siz onlara muhalefet ediniz.\" Bu Hadis İleride 5899 numara ile gelecektir",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 3463,
			"arabicnumber": 3463,
			"text": "el-Hasen'den dedi ki: \"Bize Cündeb b. Abdullah bu mescidde anlattı. Onun bize (bunu) anlattığından bu yana biz (anlatılanları) unutmadık. Cündeb'in, Nebi Sallallahu Aleyhi ve Sellem'e yalan söylüyor diye bir korkumuz da yok. O dedi ki: Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: Sizden öncekiler arasında yaralı bir adam vardı. Acıya tahammül edemediği için bir bıçak alıp onunla elini kesti. Ölene kadar da kanı durmadı. Yüce Allah: Kulum canını almakta benden önce davranmak istedi. Ben de ona cenneti haram ettim, buyurdu.\" Fethu'l-Bari Açıklaması: \"İsrailoğullarına dair anlatılanlar\" İsrailoğulları, İbrahim oğlu İshak'ın oğlu Yakub'un soyundan gelenlerdir. İsrail, Yakub'un lakabıdır. Başlık, onların döneminde meydana gelmiş hayret verici şeylere dair, anlamındadır. \"Deccal çıkacağında onunla birlikte ... \" Deccal'e dair yeterli açıklamalar ileride Fiten (Fitneler) bölümünde gelecektir. (bkz.7130 nolu hadis) \"Nebiler onları idare ediyordu.\" Yani İsrailoğulları arasında fesat baş gösterdi mi yüce Allah onlara işlerini yoluna koymak ve değiştirdikleri Tevrat hükümlerinin değişikliklerini sona erdirmek üzere bir nebi gönderirdi. Hadiste raiyye'nin (toplumun) işlerini düzene koyacak, güzel yolu izlemelerini sağlayacak, zalimden mazlum un hakkını alacak bir kimsenin varlığının kaçınılmaz olduğuna işaret edilmektedir. \"Şu kadar var ki benden sonra\" onların yaptıklarını yapmak üzere gelecek \"bir nebi olmayacaktır.\" \"Fakat\" benden sonra \"halifeler olacaktır.\" \" ... beylatine bağlı kalınız, vefa gösteriniz.\" Yani eğer bir halifeden sonra bir başka halifeye bey'at edilecek olursa birincisine yapılan bey'at sahihtir. Ona bağlı kalmak icap eder. İkincisinin bey'ati ise batııdır. Nevevı der ki: İkincisine bey'at edenler, birincisine bey'at edildiğini bilsinler ya da bilmesinler fark etmez. Aynı şehirde olsunlar yahut birden çok şehirde bunu yapsınlar yine fark etmez. Görevden ayrılan imarnın şehrinde bulunsunlar ya da bulunmasınlar yine fark etmez. İşte cumhurun kabul ettiği doğru görüş budur. Kurtubı der ki: Bu hadiste birincisine yapılan bey'atin hükmü ve bu bey'ate bağlı kalmanın icap ettiği belirtilmekle birlikte, ikincisine bey'ate dair bir şey söylememektedir. Ancak Müslimlin Sahih'inde yer alan Arfece'nin rivayet ettiği hadis bunu açıkça ifade etmiş bulunmaktadır. Orada: \"Diğerinin ise boynuflu vurun\" diye buyurulmuştur. \"Onlara haklarını verin\" yani onlara itaat edin, emirlerini dinleyerek itaat ederek onlarla ilişkilerinizi sürdürün. Şüphesiz Allah onların size yapacakları uygulama dolayısıyla kendilerini hesaba çekecektir. Fiten bölümünün baş taraflarında bu hususa dair tamamlayıcı bilgiler gelecektir. (bkz. 7052 nolu hadis) \"Çünkü Allah onları yönetimlerine verdiği kimselerden sorgulayacaktır.\" Hadisten anlaşıldığına göre dünya ile ilgili hususlara öncelik verilmelidir. Çünkü Nebi Sallallahu Aleyhi ve Sellemlin yöneticinin hakkını yerine getirmeyi emretmesinin sebebi, bu yolla dinin şanının yükseltileceği, fitne ve şerrin önleneceği dolayısı iledir. Kişinin (yönetilenin) hakkını istemesini sonraya bırakması, o hakkı ortadan kaldırmaz. Çünkü yüce Allah ahiret yurdunda dahi olsa, ona hakkını eksiksiz olarak vereceğini vaat etmiştir. \"Nebi salı allah u aleyhi ve sellem: Başka kim olabilir ki, dedi.\" Yani onlardan başkası kastedilmemiştir. \"İsnıiloğullarından nakledebilirsiniz, bunda bir sakınca yoktur.\" Yani onlardan nakletmekte sizin için darlık sözkonusu değildir. Çünkü daha önce Nebi Sallallahu Aleyhi ve Sellem onlardan bilgi edinmeyi, onların kitaplarını okumayı yasaklamış idi. Daha sonra bu hususta bir genişlik hasıl oldu. Sanki bu yasak İslamı ahkam ve dini kaideler iyice yerleşmeden önce fitne çıkar endişesi ile konulmuş idi. Daha sonra da bu sakınca ortadan kalkınca bu hususta izin verildi. Çünkü onların zamanlarında meydana gelmiş olan haberleri dinlemekle alınacak ibretlerin varlığı sözkonusudur. İsrailoğulları'ndan maksadın bizzat İsrail'in yani Yakub'un çocukları olduğu da söylenmiştir. Malik der ki: Onlardan sözetmenin caiz -olmasından kastedilen iyi olan hususlarla alakalı olanlardır. Yalan olduğu bilinen şeyler hakkında bu sözkonusu değildir. Şafiı der ki: Bilindiği gibi Nebi Sallallahu Aleyhi ve Sellem yalan şeyleri anlatmayı caiz görmemiştir. O halde anlam şudur: İsrailoğullarından yalan olduğunu bilmediğiniz sözleri nakledip anlatabilirsiniz. Sizce caiz gördüğünüz şeylere gelince, onlardan nakletmenizde sizin için bir vebal yoktur. Bu da Nebi efendimizin şu hadisini hatırlatmaktadır: \"Kitap ehli size bir şeyanlattıklarında onları tasdik de etmeyiniz, yalanlamayınız da.\" Doğru olduğu kesinlikle bilinen hususları anlatmaya gelince, bu hususta ne izin varid olmuştur, ne de yasak. \"Kim benim aleyhime kasten yalan uydurursa ... \" Buna dair yeterli açıklamalar İlim bölümünde geçmişti. (bkz.110 nolu hadis) İlim adamları Resulullah sallaııahu aleyhi ve sellem hakkında yalan uydurmanın pek büyük bir iş ve büyük günahlardan olduğu hususundaittifak etmişlerdir. Hatta Şeyh Ebu Muhammed el-Cuveynı bu hususta 'şi ileriye götürerek böyle hir şeyi yapanın kafir olduğuna hüküm vermiştir. Kadı Ebu Bekir İbnu'l-Arabl'nin açıklamaları da buna yakındır. \"Şüphesiz Yahudilerle Hıristiyanlar (ağaran saçlarını) boyamazlar. Siz onlara muhalefet ediniz.\" Bu ifadeler (ağaran saçları) boyamanın meşru olmasını gerektirmektedir. Bundan kasıt da saç ve sakalın ağaran kısmının boyanmasıdır. Ağaran saçları izale etmeyi yasaklamaya dair varid olmuş buyruklar bu ifadelerle çatışmamaktadır. Çünkü boyama izale etmeyi gerektirmemektedir. Diğer taraftan izin verilen boya siyah olmamak kaydına bağlıdır. Çünkü Müslim'in rivayet ettiği Cabir yoluyla gelen hadise göre Nebi efendimiz şöyle buyurmuştur: \"Ağaran saçlarını değiştiriniz, fakat siyaha boyamaktan da uzak durunuz.\" Cihad edenin bundan müstesna olduğu ittifakla kabul edilmiştir. İleride Giyim bahsinde yüce Allah'ın izniyle buna dair geniş açıklamalar gelecektir. (bkz. 5899 numaralı hadis) \"Aziz ve celil olan Allah: Kulum benden önce canını almak istedi.\" Bu tabir sözü geçen kimsenin acilen ölmek istediğini anlatan kinayeli bir ifadedir. Buyruk, onun çoğunlukla faydalı bir tedavi maksadı ile değil, ölmek isteği ile elini kestiğini göstermektedir. Nebi efendimizin: \"Canını benden önce almak istedi\" buyruğu ile: \"Cenneti ona haram ettim\" buyruğunun birlikte izahı zor görülmüştür. Çünkü birinci ifade ölen kimsenin ecelinden önce ölmüş olduğu izlenimini vermektedir. ÇÜnkü hadisin anlatımından şayet kendisini öldürmemiş olsaydı bu vakitten sonraya kalıp yaşayabileceği izlenimi çıkmaktadır. Fakat o acele edince ölüm de daha çabuk geldi. İkinci ifade ise muvahhid bir kimsenin cehennem ateşinde ebediyen kalmasını gerektirmektedir. Birincisine cevap: \"Acele etmek\" bu işe sebep teşkil etmek, onu kastetmek ve onu iradesiyle tercih etmek cihetiyle sözkonusu edilmiştir. Ona \"acele etme\" denilmesi, şeklen bunun böyle oluşundan dolayıdır. Cezalandırılmayı hak etmesi ise yüce. Allah'ın onu ecelinin bittiğine muttali kılmamış olmasından dolayıdır. O buna rağmen kendisini öldürmeyi tercih ettiğinden asi olmuş ve bundan dolayı da cezalandırılmayı hak etmiştir. Açıklanması zor görülen ikinci hususun cevabı da birkaç türlü verilebilir: 1- O böyle bir davranışı helal gördüğünden ötürü kafir olmuştur. 2- O esasen kafir idi. Bu masiyeti dolayısı ile de küfründen ayrı, fazladan bir ceza ile cezalandırıldı. 3- Cennetin ona haram edilmesinden maksat, es-Sabikun (ileri geçenler) zümresinin cennete gireceği bir vakit yahut da muvahhidlerin cehennemde azap edilecekleri, sonra da çıkartılacakları bir vakit kadar cennete girmesinin ona haram edilmesidir. 4- Kastedilen cennet mesela Firdevs gibi belirli bir cennet olabilir. 5- Bu, azabın ağırlığını anlatmak ve korkutmak amacıyla kullanılmış bir ifadedir. Onun zahiri kastedilmiş değildir. 6- İfadenin takdiri şöyledir: Cennete girmesi (çok uzun bir süre) ona haram kılınmıştır. Öyle ki sen bunu sürekli olarak dahi kabul edebilirsin. 7 - Nevevı der ki: Muhtemelen bizden öncekilerin şeriatinde hüküm böyle olabilir. Yani büyük günah sahipleri büyük günahı işlemekle kafir oluyorlardı. Hadisten Çıkan Sonuçlar 1- Cana kıymak haramdır. İster kişinin kendi canına, ister başkasının canına olsun fark etmez. 2- Allah'ın haklarının sınırlarını aşmamak gerekir; O'nun yarattıklarına merhameti çok engindir. Çünkü onlara kendilerini öldürmeyi haram kılmıştır. 3- Can (nefis), Allah'ın mülküdür. 4- Geçmiş ümmetierin durumları anlatılabilir. 5- Belaya sabretmek fazilettir ve daha zor bir sonuca götürmemesi için de acılara karşı tahammülsüz bir hali terk etmelidir. 6- Ölüm ile sonuçlanabilecek işleri yapmak haram kılınmıştır",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 3464,
			"arabicnumber": 3464,
			"text": "Ebu Hureyre r.a.'dan rivayete göre o ResuluIlah Sallallahu Aleyhi ve Sellem'i şöyle buyururken dinlemiştir: \"İsrailoğullarında bir abraş, bir kör ve bir kel vardı. Aziz ve celil olan Allah onları sınamak istedi. Bunun için onlara bir melek gönderdi. Melek abraşın yanına giderek dedi ki: En sevdiğin şey nedir? Abraş: Güzel bir renk, güzel bir ten. Çünkü insanlar benden tiksiniyor. (Allah Resulü) buyurdu ki: Onu sıvazladı ve ondan (baraş hastalığı) gidiverdi. Ona güzel bir renk ve güzel bir ten verildi. Melek: En sevdiğin mal hangisidir,' diye sordu. O, deve -yahut inek- dedi. -Bu hususta şüphe eden kişi odur. (Yani ravilerden İshak b. Abdullah'tır): Yani Abraş ile kel olanın birisi deve dedi, diğeri inek dedi.- Bunun üzerine ona (doğumu yaklaşmış) on aylık hamile deve verildi. Melek: Allah bunda sana bereket ihsan etsin, dedi. Kel'in yanına giderek: En sevdiğin şey nedir, diye sordu. O, güzel bir saç ve bu halin benden gitmesidir, dedi. Çünkü insanlar benden tiksiniyor. (Ebu Hureyre) dedi ki: Onu sıvazladı ve (keli) gitti, ona güzel bir saç verildi. Melek: En sevdiğin mal hangisidir diye sordu. O da inektir dedi. (Ebu Hureyre) dedi ki: Ona gebe bir inek verdi ve: Allah senin için bunu mübarek kılsın, dedi. Kör'ün yanına giderek: En sevdiğin şey nedir, diye sordu. O: Allah'ın, gözlerimi bana tekrar geri vermesi ve böylelikle insanları görebilmemdir, dedi. (Ebu \"Hureyre) dedi ki: Onu sıvazladı, Allah da ona gözlerini geri verdi. En sevdiğin mal hangisidir diye sordu. o, koyundur dedi. Ona yavrusu olan bir koyun verdi. Daha sonra diğerlerinin devesi ve ineği doğurdu, öbürünün koyunu yavruladı. Bunun bir vadi dolusu devesi, öbürünün bir vadi dolusu ineği, berikinin bir vadi dolusu koyunu oldu. Daha sonra melek, (önceki) şekil ve kılığı ile abraşın yanına gitti ve: Ben yoksul birisiyim. Yolculuğumda çarelerim tükendi, çaresiz kaldım. Bugün gideceğim yere ulaşabilmem ancak Allah'ın yardımı ile, sonra da senin yardımınla mümkün olabilir. Sana bu güzel rengi, bu güzel teni ve bu kadar malı veren hakkı için bu yolculuğumda vasıtasıyla yerine ulaşabileceğim bir deve vermeni istiyorum. Abraş ona: Yerine getirmemiz gereken haklar pek çoktur dedi. Melek bunun üzerine ona: Ben seni tanıyor gibiyim. Sen insanların kendisinden tiksindiği bir abraş ve fakir bir kimse değil miydin? Sonra Allah sana mal verdi, öyle mi? Abraş: Hayır, ben bunu büyüklerimden miras olarak aldım, dedi. Melek dedi ki: Eğer yalan söylüyorsan Allah seni önceki haline geri ç?ııirsin. Daha sonra kel'in yanına (önceki) şekil ve kılığıyla gitti. Ona d.a bir öncekine dediklerinin benzerini söyledi. O da öbürü gibi ona karşılık verince, melek de şöyle dua etti: Eğer yalan söylüyor isen Allah seni önceki haline geri çevirsin. Daha sonra ilk şekliyle körün yanına gitti. Ona da: Ben yoksul ve yolcu bir adamım. Yolumda çaresiz kaldım. Bugün ancak Allah'ın yardımı, SGnra da senin sayende gidebileceğim yere gidebilirim. Sana gözlerini geri veren hakkı için senden bu yolculuğumda gideceğim yere ulaşabilmem içjn bir koyuİı istiyorum. Kör ona dedi ki: Evet ben kör idim. Allah bana gözlerimi geri verdi, fakir idim beni zengin etti, dilediğini al. Allahla yemin ederim bugün senin Allah için alacağın hiçbir şey dolayısıyla seni yormayacağım. Bunun üzerine melek dedi ki: Malını elinde tut. Sizler sınandınız. Allah senden razı oldu, öbür iki arkadaşına da gazap etti. \" Bu Hadis 6653 numara ile gelecektir. Fethu'l-Bari Açıklaması: \"Allah diledi\" yani Allah'ın ezeli ilminde bu vardı, bunu ortaya çıkarmayı murad etti. Yoksa daha önce bu, Allah için gizli idi de sonradan öğrendi, anlamında değildir. Çünkü böyle bir mana yüce Allah hakkında imkansızdır. Hadisten Çıkan Sonuçlar 1- Duyanların bu yolla öğüt almaları için geçmişlerin başından geçen olayları anlatmak caizdir ve bu onların gıybetinin yapılması anlamına gelmez. İsimlerinin verilmeyip, bundan sonra ne ile karşılaştıklarının açıkça belirtilmemesindeki sır bu olmalıdır. Göründüğü kadarıyla onların durumu meleğin dediği gibi olmuştur. 2- Nimetlere karşı nankörlük etmekten sakındırılmakta, onlara şükretmek ve onları itiraf edip, o nimetlerdolayısıyla Allah'a hamdetmek teşvik edilmektedir. 3- Sadakanın faziletli olduğu anlatılmakta, zayıflara karşı yumuşak davranılması teşvik edilmekte, onlara ikramda bulunulup maksatlarını gerçekleştirmeleri için yardımcı olunması gerektiğine dikkat çekilmektedir. 4- Cimrilikten uzak durulması istenmektedir. Çünkü cimrilik kişiyi yalan söylemeye itti, yüce Allah'ın nimetlerini inkar etmeye götürdü",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 3465,
			"arabicnumber": 3465,
			"text": "İbn Ömer r.a.'dan rivayete göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Sizden öncekilerden üç kişi aniden bir yağmura tutuldular. Bunun için bir mağaraya sığındılar. Mağaranın ağzı üzerlerine kapandı. Biri diğerine dedi ki: Allah'a yemin ederim arkadaşlar, sizi ancak sıdk (ihlas, doğruluk, samimiyet) kurtarabilir. Dolayısıyla her biriniz gerçekten sıdk ile yaptığını bildiği bir işi söyleyerek dua etsin, Onlardan birileri dedi ki: Allah'ım, biliyorsun ki, benim ücretle çalıştırdığım birisi vardı. O bana bir ferak pirinç karşılığında bir iş yaptı. Fakat onu almayıp gitti. Ben de o miktardaki pirinci alıp ektim. Sonunda öyle bir hale geldi ki, onun karşılığında bir miktar inek aldım. Daha sonra gelip benden ücretini istedi. Ben de ona: Şu inekleri al, önüne kat git, dedim. Bana: Benim sendeki alacağım bir ferak pirinçtir, dedi. Ben ona: Sen o inekleri al, onlar bu bir feraktan oldu, dedim. O da inekleri önüne katıp gitti. Eğer bunu sana olan haşyetimden ötürü yapmışsam biliyorsan bizi bu halden kurtar. Kaya üzerlerinden bir miktar açıldı. Diğeri dedi ki: Allah'ım, biliyorsun ki, benim oldukça yaşlı annem, babam vardı. Her gece onlara koyunlarımın sütünü getiriyordum. Bir gece yanlarına gelmekte geciktim. Geldiğimde ikisi de uyumuştu. Hanımım ve çocuklarım ise açlıktan sızlanıp ağlıyoriardı. Fakat ben anne babama içi rm eden önce onlara içirmiyordum. Anne babamı da uyandırmak hoşuma gitmedi. Bununla birlikte sütlerini içmeden onları bırakmak da zayıf düşecekleri korkusuyla hoşuma gitmedi. Nihayet tan yeri ağarıncaya kadar onları beklemeye devam ettim. Eğer ben bu işi senin haşyetinden dolayı yapmışsam bizi bu sıkıntıdan kurtar. Kaya bir parça daha açıldı ve nihayet göğü görebildiler. Diğer arkadaşları da dedi ki: Allah'ım, biliyorsun ki, benim bir amca kızım vardı. İnsanlar arasında en sevdiğim kişi idi. Kendisini bana teslim etmesini istedim. Kendisine yüz dinar vermedikçe kabul etmeyeceğini söyledi. Ben de o parayı bulmaya koyuldum. Nihayet toplayabildim. O parayı götürüp ona verdim. O da bana kendisini teslim etti. Bacakları arasına oturunca: Allah'tan kork ve hakkı ile olmadıkça yüzüğü kırma, dedi. Ben de ayağa kalktım ve yüz dinarı da almadım. Ben bu işi senin haşyetinden dolayı yapmışsam bizi kurtar. Allah da onların üzerlerini açtı ve (oradan) çıktılar.\" Fethu'l-Bari Açıklaması: \"Allah'ım biliyorsun ki ... \" Bu buyrukta açıklaması zor bir taraf vardır. Çünkü mümin Aııah'ın bunu bildiğini kat'i olarak bilir. Buna şöyle cevap verilmiştir: Onun ameli hakkındaki bu tereddüdü, Aııah nezdinde muteber olup olmaması ile alakalıdır. Şöyle demiş gibidir: Eğer benim o amelim makbul ise duam! kabul buyur. \"Bir ferak karşılığında ... \" Ferak, üç sa' alan bir ölçektir. \"Açlıktan sızlanıp ağlıyorlardı.\" Aç olmaları sebebiyle yüksek sesle ağlıyorIardı. \"Yüzüğü kırma!\" ifadesindeki yüzük, bakire oluşundan kinayedir. Muhtemelen bakire idi. Kırmayı ilişki kurmanın, yüzüğü de fercin kinayesi olarak kullanmıştır. Hadisten Çıkan Sonuçlar 1- Sıkıntılı zamanlarda dua etmek, salih amelleri anarak yüce Allah'a yakınIaşmaya çalışmak, kullarına vaadini, ona dua ederek gerçekleştirmesini istemek müstehaptır. 2- Bazı fakihler, bunların istiska (yağmur duası) da sözkonusu edilmesini de müstehap görmüşlerdir. Ancak Muhibuddin eteTaberi bunda amellerle riyakarlık sözkonusu olduğundan, istiskada bulunurken de kulun kendisini hakir görmesi daha uygun olduğundan, bunun açıklamasının zor olduğunu belirtmiştir. Çünkü istiska için yapılan dua, yalvarıp yakarma makamıdır. Mağara sahiplerinin kıssası ile ilgili olarak da şu cevabı vermiştir: Onlar amellerini sözkonusu ederek şefaatte bulunmamışlardır. Onlar amellerinin halis ve kabul edilmiş olması halinde Allah'tan buna karşılık olarak kendilerinin sıkıntıdan kurtarılmalarını istemişlerdir. Böylelikle o, verdiği cevabın muhtevasında (salih amelleri zikrederek) dua etmeyi kabul etmekle birlikte, bu kaydı da zikretmiş olmaktadır. Bu da güzel bir kayıttır. 3- Amelin ihlasla yapılması, anne-babaya iyi davranmak, onlara hizmet etmek, onların çoluk-çocuğa tercih edilmeleri, onlar uğrunda meşakkatlere katlanmak fazileti üstün işlerdendir. 4- İffetli olmak ve güç yetirmekle birlikte haramdan uzak durmak, faziletli bir iş olduğu gibi; masiyeti işlemeyi terk etmek de, onu işlemek için öncelikli olarak yapılması gereken işlerin yapılmış olması halinde, günahlarını siler; tevbe de kendisinden önceki günahları siler. 5- Ücretli iş akdi yapan taraflarca belli bir yiyecek karşılığında icare akdi yapmak caizdir. 6- Emaneti sahibine eksiksiz ödemek faziletli bir iştir. 7- Salih kimselerin keramet göstermeleri mümkündür. 8- Fuzuli diye bilinen alışveriş türü caizdir. Buna dair açıklamalar daha önce de alışverişler bölümünde geçmiş bulunmaktadır, (bkz.2272 nolu hadis) 8- Kendisine emanet bırakılmış kişi, emanet bırakılan malı ticaret için kullanacak olursa sağlanacak olan kar emanetin sahibine aittir. Bu İ. Ahmed'in görüşüdür. Hattabi der ki: Çoğunluk ona muhalefet ederek şöyle demışlerdir: Eğer emanet bırakılan mal, yanına emanet bırakılan kişinin zimmetinde sabit olursa aynı şekilde mudarib (sermaye ve kar ortaklığı demek olan mudarebe akdindeki emek tarafının adı), mesela kendisine izin verilmediği halde malda tasarruf ettiği takdirde onun zimmetinde ödenmesi gereken bir borç haline gelir, bu malı ticaret için kullanacak olursa, sağlayacağı kar ona ait olur. Ebu Hanife'den de (maldan zarar olursa) zararın tazminatını vereceği görüşü nakledilmiştir. Kar ise ona aittir, fakat onu tasadduk eder. Şafiı ise konuyu etraflı birşekilde ele alıp şöyle demektedir: Kendisi adına mal satın aldıktan sonra bedelini başkasına ait olan maldan ödeyecek olursa, akit de onun adınadir, kar da ona aittir. Eğer Aynı bedel ile satın alacak olursa kar o ayn'a malik olana aittir. Bu husustaki görüş ayrılıkları da yine alışverişler bahsinde daha önce de nakledilmiş bulunmaktadır. 9- Dinleyenler amelleriyle ibret alsın ve güzelolanları gibi amel etsin, çirkin olanlarını da terk etsinler diye geçmiş ümmetierin başından geçen olaylara dair haber vermek (güzel bir şeydir). Doğrusunu en iyi bilen Allah'tır. 54. BAB",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 3466,
			"arabicnumber": 3466,
			"text": "Ebu Hureyre r.a.'dan rivayete göre o Resuluilah Sallallahu Aleyhi ve Sellem'i şöyle buyururken dinlemiştir: \"Bir kadın oğlunu emzirirken yanından bir atlı geçti. Oğlunu emzirdiği halde: Allah'ım, bunun gibi olmadıkça oğlumun canını alma, dedi. Oğlu: Allah'ım, beni onun gibi yapma, dedi. Sonra da annesinin memesini emmeye devam etti. Daha sonra dört bir yandan sürüklenen ve kendisiyle alayedilen bir kadının yanından geçtiler. çocuğun annesi: Allah'ım, oğlumu bu kadın gibi yapma, dedi. Oğlu: Allah'ım, beni bu kadın gibi yap, dedi. Sonra dedi ki: O suvari bir kafirdi. Kadına gelince, bunlar ona zina ediyor(-. sun) diyorlar, kendisi ise Allah bana yeter, diye cevap veriyor. Hırsızlık yapıyor(sun) diyorlar, o Allah bana yeter, diyor",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 3467,
			"arabicnumber": 3467,
			"text": "Ebu Hureyre r.a. dedi ki: Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Susuzluktan neredeyse ölmek üzere olari bir köpek, bir kuyunun etrafında dönüp dururken İsrailoğulları fahişelerinden bir fahişe onu gördü. Ayakkabısını çıkartıp o köpeğe (onunla) su içirdi. Bundan dolayı da ona mağfiret olundu",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 3468,
			"arabicnumber": 3468,
			"text": "Humeyd b. Abdurrahman'dan rivayete göre o, Muaviye b. Ebi Süfyan 'ı -birhac yılında- minber üzerinde eline -bir koruma görevlisinin elinde bulunan- bir tutam saç alarak şunları söylediğini dinlemiştir: \"Ey MedineliIer! Nerede alimleriniz? Ben Nebi Sallallahu Aleyhi ve Sellem'i bunun gibi bir işi yapmaktan nehyederken ve şöyle buyururken dinledim: İsrailoğulları ancak kadınlan bu işi yapmaya başlayınca helak 0ldular.'' Hadis 3488, 5932 ve 5938 numara ile gelecektir:",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 3469,
			"arabicnumber": 3469,
			"text": "Ebu Hureyre r.a.'dan rivayete göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Sizden önce geçmiş olan ümmetler arasında muhaddes (ilahı ilhama mazhar olan) kimseler vardı. Eğer benim bu ümmetim arasında onlardan (bir kişi) varsa, şüphesiz ki o Ömer b. el-Hattab'dır. \" Bu hadis İleride 3689 numara ile gelecektir. AÇIKLAMA 1420.SAYFA, 3488.HADİSTE",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 3470,
			"arabicnumber": 3470,
			"text": "Ebu Saıd el-Hudrı r.a.'dan rivayete göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"İsrailoğullarından doksan dokuz insan öldürmüş bir adam vardı. Daha sonra çıkıp soruşturmaya koyuldu. Bir rahibin yanına gitti. Ona sorarak: Tevbe (etse)m kabulolur mu, dedi. Rahip: Olmaz deyince, onu da öldürdü, ama yine sormaya devam etti. Bir adam kendisine: Şu, şu kasabaya git, dedi. Fakat (yolda iken) ölüm ona yetişti. Göğsüyle o kasabaya doğru yöneldi. Rahmet melekleri ile azap melekleri onun hakkında anlaşmazlığa düştü. Yüce Allah bu (taraftaki) yere: Yaklaş diye vahyetti, ötekine de: Uzaklaş diye vahyetti. Sonra: Bu ikisi arasındakini ölçün, dedi. Bu (gideceği) kasabaya bir karış daha yakın olduğu görüldü. Bu sebeple günahları bağışlandı",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 3471,
			"arabicnumber": 3471,
			"text": "Ebu Hureyre r.a. dedi ki: \"Resulullah Sallallahu Aleyhi ve Sellem sabah namazını kıl(dır)dıktan sonra insanlara doğru dönüp dedi ki: Bir adam bir inek önüne katmış gidiyorken o ineğin sırtına bindi ve ona vurdu. İnek: Biz bunun için yaratılmadık. Biz ancak yeri sürmek için yaratıldık, dedi. İnsanlar: Subhanallah, inek konuşur mu, dediler. Allah Resulü şöyle buyurdu: Şüphesiz buna ben, Ebu Bekir Ve Ömer de iman ediyoruz. Halbuki ikisi orda değillerdi. Yine bir adam koyunları ile birlikte iken kurt saldırıp, sürüden bir koyun aldı. Sonra onun arkasından gitti. Nihayet o koyunu ondan kurtarır gibi oldu. Kurt ona dedi ki: Haydi, şimdi bunu benden kurtardm. Peki fitneler gününde, benden başka çobanı olmayacağı günde ona kim ne yapabilir? İnsanlar: Subhanallah, hiç kurt konuşur mu deyince, şöyle buyurdu: Şüphesiz ben de buna iman ediyorum, EbU Bekir de, Ömer de. Ama ikisi de orada değillerdi. \" AÇIKLAMA 1420.SAYFA, 3488.HADİSTE",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 3472,
			"arabicnumber": 3472,
			"text": "Ebu Hureyre r.a. dedi ki: Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Bir adam bir diğerinden akarını (arazisini) satın aldı. O akarı satın alan adam akarında içinde altın bulunan bir testi buldu. Akarı satın alan kişi eski sahibine: Şu altınını benden al. Çünkü ben senden araziyi satın aldım ama altını satın almadım, dedi. Arazinin eski sahibi ona: Ben sana araziyi içindekileriyle beraber sattım, dedi. Bir adamın hakemliğine başvurdular. Hakemliğine başvurdukları şahıs: Çocuklarınız var mı, diye sordu. Onlardan biri benim bir oğlum var, dedi. Diğeri benim de kızım var, dedi. Hakem: Oğlanı kızla evlendirinı bu altından onlara harcamalarda bulunun ve tasadduk da edin, dedi.\" AÇIKLAMA 1420.SAYFA, 3488.HADİSTE",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 3473,
			"arabicnumber": 3473,
			"text": "Amir b. Said b. Ebi Vakkas, babasını Üsame b. Zeyd'e şu soruyu sorarken dinlemiştir: Resulullah Sallallahu Aleyhi ve Sellem'den tauna dair ne dinledin? Usame dedi ki: Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: Taun İsrailoğullarından bir kesim -yahut da: sizden öncckiler- üzerine gönderilmiş bir azaptır. Herhangi bir yerde onun baş gösterdiğini işitirseniz oraya gitmeyiniz. Eğer sizin bulunduğunuz yerde görülecek olursa ondan kaçmak maksadıyla o yerden dışarı çıkmayınız.\" Ebu'n-Nadr dedi ki: \"Ancak ondan kaçmak amacıyla çıkacaksamz ... (çıkmayınız}.\" Hadis 5728 ve 6974 numara ile gelecektir. Diğer tahric edenler: Tirmizî, Cenaiz; Müslim, Selam AÇIKLAMA 1420.SAYFA, 3488.HADİSTE",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 3474,
			"arabicnumber": 3474,
			"text": "Nebi s.a.v.'in zevcesi Aişe r.anha dedi ki: \"Resulullah Sallallahu Aleyhi ve Sellem taun'a dair soru sordum. Bana onun, Allah'ın dilediği kimseler üzerine gönderdiği bir azap olduğunu ve Allah'ın onu mu'minlere bir rahmet kıldığını haber verdi (ve devamla şöyle buyurdu): Taun bir yerde baş gösterir de bir kimse sabrederek, ecrini ümit ederek, Allah'ın kendisi için yazdığı dışında hiçbir şeyin kendisine isabet etmeyeceğini bilerek o şehrinde kalacak olursa, mutlaka ona bir şehid ecri verilir.\" Hadis 5734 ve 6619 numara ile gelecektir",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 3475,
			"arabicnumber": 3475,
			"text": "Aişe r.anha'dan rivayete göre; hırsızlık yapan Mahzum oğullarına mensup kadının durumu dolayısıyla Kureyşliler tasaya düştü. Bu kadın hakkında Reslilullah Sallallahu Aleyhi ve Sellem ile kim konuşabilir, dediler. Kendi aralarında: Buna Reslilullah Sallallahu Aleyhi ve Sellem'in çok sevdiği Usame oğlu Zeyd'in dışında kim cesaret edebilir ki, dediler. Bunun üzerine Usame onunla konuştu. Reslilullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: Allah'ın hadlerinden bir had hakkında mı iltimas ediyorsun? Sonra kalkıp bir hutbe verdi ve şöyle buyurdu: -Sizden öncekileri helake götüren yalnızca şu olmuştur: Aralarında şerefli kabul ettikleri kimse hırsızlık yaptı mı ona ilişmezlerdi, fakat zayıf kabul ettikleri birisi hırsızlık yaptı mı ona had uygularlardı. Allah adına yemin ederim ki eğer Muhammed'in kızı Fatıma hırsızlık yapsaydı onun dahi elini keserdim",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 3476,
			"arabicnumber": 3476,
			"text": "İbn Mes'ud r.a. dedi ki: \"Bir adamın bir ayet okuduğunu dinledim. Nebi Sallallahu Aleyhi ve Sellem'in ise (aynı ayeti) farklı şekilde okuduğunu dinlemiştim. Onu alıp Nebi Sallallahu Aleyhi ve Sellem'in yanına götürdüm ve ona durumu haber verdim. Yüzünden hoşlanmadığını anladım ve şöyle buyurdu: Her ikiniz de güzel okuyorsunuz, ihtilafa düşmeyiniz. Şüphesiz sizden öncekiler ihtilafa düştüler de helak oldular.\" AÇIKLAMA 1420.SAYFA, 3488.HADİSTE",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 3477,
			"arabicnumber": 3477,
			"text": "Abdullah dedi ki: \"Sanki ben Nebi Sallallahu Aleyhi ve Sellem'i Nebilerden birisinin durumunu anlatırken görür gibiyim. Kavmi ona vurmuş ve onu kanatmışlardı. O ise yüzünden kanı silerken: Allah'ım, kavmime mağfiret buyur. Çünkü onlar bilmiyorlar, diyordu.\" Hadis 6929 numara ile gelecektir",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 3478,
			"arabicnumber": 3478,
			"text": "Ebu Said r.a.'dan rivayete göre Nebi Sallallahu Aleyhi ve Sellem (buyurdu ki): \"Sizden öncekilerden bir adama Allah çok miktarda mal vermişti. Ölüm döşeğinde çocuklanna dedi ki: Size karşı nasıl bir baba idim? Onlar: Çok iyi bir baba idin, dediler. O dedi ki: Ben hayır namına hiçbir şey işlemedim. ÖIdüğüm takdirde beni yakınız, sonra iyice öğütünüz, sonra da fırtınalı bir günde beni savurunuz. Onlar da yaptılar. Yüce Allah ise onu bir araya getirdi. Böyle yapmaya seni iten ne oldu, diye sordu. Adam: Senden korkum deyince, Allah onu rahmetiyle karşıladı. \" Hadis 6481 ve 5708 numara ile gelecektir",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 3479,
			"arabicnumber": 3479,
			"text": "Ukbe, Huzeyfe'ye: Nebi Sallallahu Aleyhi ve Sellem'den dinlediğin bir hadisi bize nakletmez misin? dedi. Huzeyfe dedi ki: \"Ben onu şöyle buyururken dinledim: Bir adamın ölüm vakti yaklaşmıştı. Hayattan ümidini kesince, ailesine şu vasiyeti yaptı: Öldüğü m takdirde benim için çok miktarda odun toplayın. Sonra bir ateş yakın. Ateş etimi yiyip kemiklerime ulaşınca kemiklerim; alın, öğütün. Beni sıcak -ya da rüzgarlı- bir günde savurun. Allah onu bir araya getirip, topladı. Niye yaptın, diye sordu. O: Senden haşyetim dolayısıyla deyince, ona mağfiret etti",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 3480,
			"arabicnumber": 3480,
			"text": "Ebu Hureyre r.a.'dan rivayete göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"İnsanlara borç veren bir adam vardı. O yanındaki görevliye şöyle diyordu: Ödeme zorluğu çeken birisine gidecek olursan onun borcunu affet. Belki Allah da bizi affeder. (Allah Resulü) buyurdu ki: Allah'ın huzuruna çıktı ve onu affetti",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 3481,
			"arabicnumber": 3481,
			"text": "Ebu Hureyre r.a.'dan rivayete göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Kendi aleyhine günah işlemekte aşırıya giden bir adam vardı. Ölüm vakti yaklaşınca çocuklarına dedi ki: Ben öldi.ikten sonra beni öğütünüz, sonra da rüzgara karşı savurunuz. Çünkü Allahla yemin ederim, eğer Allah bana güç yetirirse (beni sıkıştırırsa) hiçbir kimseye yapmadığı bir azap ile beni azaplandıracaktır. Adam ölünce dediklerini yaptılar. Allah yere emrederek: Bu adama ait sende nesi varsa toplayıp bir araya getir, dedi. Yer emre uydu. Adam ayakta doğruluverdi. Seni bu yaptığını yapmaya iten nedir, diye sordu. Rabbim senden haşyetimdir deyince, ona mağfiret buyurdu.\" Başkası ise: \"Rabbim senden korkumdur\" demiştir. Bu Hadis 7506 numara ile gelecektir",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 3482,
			"arabicnumber": 3482,
			"text": "Abdullah b. Ömer r.a.'dan rivayete göre Resuluilah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Bir kadın ölünceye kadar bağladığı bir kedi sebebiyle azaba uğratıldı ve o kediden dolayı cehennem ateşine girdi. Kediyi hapsettiği halde ona yiyecek de vermedi, içecek bir şey de vermedi. Yerin haşeratından yiyebilsin diye de onu salmadı",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 3483,
			"arabicnumber": 3483,
			"text": "Ukbe'den dedi ki: Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"İnsanların Nübuvvet kelamından idrak ettikleri arasında: Eğer utanmazsan dilediğini yap, sözüdür. \" Bu Hadis 3484 ve 6120 numara ile gelecektir. [-3484-] Ebu Mes'ud dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: Nübuvvet kelamından insanların idrak ettikleri arasında: Utanmazsan dilediğini yapabilirsin, (hikmeti)dir.\" AÇIKLAMA 1420.SAYFA, 3488.HADİSTE",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 3484,
			"arabicnumber": 3484,
			"text": "(Bize Ebû Mes'ûd Ukbe ibn Amr tahdîs edip şöyle dedi: aleyhi ve sellem) şöyle buyurdu: \"Vaktiyle gelip geçen peygamberlerin sözlerinden, bütün peygamberlerin üzerinde ittifak ettikleri nevi'den insanlığın eriştiği yüksek bir düstûr: Utanmazsan dilediğini işle! sözüdür",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 3485,
			"arabicnumber": 3485,
			"text": "İbn Ömer'den rivayete göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Bir adam kibirinden ötürü elbisesini sürüklerken yerin dibine geçirildi. o, kıyamet gününe kadar yerin içine doğru gitmeye devam edecektir.\" Hadis 5790 numara ile gelecektir",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 3487,
			"arabicnumber": 3487,
			"text": "",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 3488,
			"arabicnumber": 3488,
			"text": "Muaviye b. Ebi Süfyan Medine'ye son gelişinde bize bir hutbe verdi. Bir top saç çıkartarak dedi ki: \"Ben bu işi Yahudilerden başka bir kimsenin yapacağı kanaatinde değildim. Nebi Sallallahu Aleyhi ve Sellem ise buna \"ez-zur (yalan)\" adını vermiştir. Kastettiği saça saç eklemektir.\" Bu rivayette ona (Buhari'nin hocası Adem'e) Gunder, Şu'be'den diye rivayet ederek mutabaatta bulunmuştur. Fethu'l-Bari Açıklaması: 3468 - \"Eline bir miktar saç aldı.\" Kasıt perçemden kesilmiş saçtır. \"el-Haresı\" tekil olup, koruma görevlisi demektir. \"Nerede alimlerinjz\" cümlesinde o dönemde aralarındaki alimlerin sayıca azalmış olduklarına işaret vardır. Durum da böyledir. Çünkü Ashabın çoğu o gün vefat etmiş bulunuyorlardı. Sanki o avam arasındaki cahillerin bu işi yapmış olduklarıkanaatine kapılmış, bundan dolayı alimlerine hatırlatarak böyle bir münkere karşı tepki göstermeyi terk ettiklerinden onları uyarmak istemiş gibidir. -- Bu başlıkta zikredilen hadisler sayıca fazla olduklarından yapılan açıklamaların hangi hadise ait olduğunun daha kolay takip edilebilmesi için hadislerin numaralarını açıklamada tekrar etmeyi faydalı gördük. 3470- \"Bir rahibe gitti.\" Bu ifade ile bu hadisenin İsa aleyhisselam'ın yükseltilmesinden sonra cereyan ettiği hissettirilmektedir. Çünkü rahipliği -Kur'an'ın da . açıkça belirttiği gibi- ona tabi olanlar bid'at olarak sonradan uydurmuşlardır. \"Bir adam ona şöyle şöyle olan bir kasabaya git, dedi.\" Hişam'ın naklettiği rivayette şu fazlalık vardır: \"Çünkü o kasabada Allah'a ibadet eden insanlar var-o dır. Sen de onlarla birlikte Allah'a ibadet et. Eski toprağına geri dönme. Çünkü o kötü bir yerdir. O da yoluna koyuldu. Yolun yarısına vardığında ona ölüm meleği geldi.\" \"Yöneldi\" yani gideceği tarafa doğru kendisini daha da yakınlaştırdı. \"Melekler onun hakkında anlaşmazlığa düştü.\" Hişam yoluyla gelen rivayetteki bir fazlalık da şöyledir: \"Rahmet melekleri dedi ki: Bu tevbe ederek, kalbiyle Allah'a yönelmiş olarak geldi. Azap melekleri de: O hayır namına hiçbir şey işlemedi dediler. Onlara insan suretinde bir melek geldi. Onu aralarında (hakem) yaptılar. O da: \"İki yerin arasını ölçünüz, hangisine daha yakın ise oraya aittir.\" \"Bunun üzerine Allah buna\" çıkıp geldiği kasabaya: \"Uzaklaş, diye vahyetti. Öbürüne de\" gitmek istediği kasabaya \"yaklaş diye vahyetti.\" Tercümeye esas aldığımız Muhtasar'da da Fethu'l-Bari'nin Daru'r-Reyyan, Kahire, 1409/1980 baskısında da tekil olarak ölen şahısa ait olmak üzere \"ona geldi\" şeklindedir. Ancak yine Buhari şerhi olan Aynı'de olsun, hadisin yer aldığı diğer kaynaklar olsun hep \"onlara\" şeklinde olduğu gibi mana cihetiyle de böyle olması daha doğrudur. Hadisten Çıkarılan Sonuçlar 1- İnsan öldürmek dahil bütün büyük günahlardan dolayı tevbe etmek şeriatin öngördüğü bir iştir. Yüce Allah katilin tevbesini kabul edecek olursa onun hasmını da razı etmeyi üzerine alır. 2- İnsanın masiyet işlemekle karşı karşıya kaldığı bir yerden başka bir yere gitmesi faziletli bir iştir. Çünkü adeten bu gibi haller insanı daha çok etkiler. Ya bundan önce işlemiş olduğu fiillerini ve onlara tutkunluğunu hatırladığı için yahut da bu hususta ona destek verip onu bu işlere teşvik eden kimseler bulunduğu için böyle bir etki sözkonusudur. Bundan dolayı sonraki zat ona şöyle demiştir: \"Eski topraklarına da dönme. Çünkü o bir kötülük diyarıdır.\" 3- Tevbe eden bir kimsenin, masiyet işlediği zamanlarda alışageldiği hallerden ayrılması ve bütün bunları büsbütün değiştirerek başkalarıyla uğraşması gerekir. 4- Alim, abidden üstündür. Çünkü ona ilkin tevbesinin kabul• edilmeyeceği fetvasını veren kişi, daha çok ibadet eden birisi idi. Katilin bu kadar çok sayıda kimseyi öldürme cesaretini göstermiş olmasını pek büyük bir iş olarak gördü. İkincisi ise daha çok ilimle uğraşan birisi olduğundan ona doğru şekilde fetva verdi ve kendisine kurtuluş yolunu gösterdi. 5- (Kadı) Iyad der ki: Hadisten anlaşıldığına göre tevbenin diğer günahlara faydası olduğu gibi, öldürmeye karşı da faydası vardır. 6- Hadis, meleklerin kendi aralarında anlaşmazlığa düşmeleri halinde Ademoğullarından aralarında hüküm verebilecek durumda olan kimseler bulunduğuna da delil gösterilmiştir. 7- Tahkimin (anlaşmazlıkları çözme işini bir hakerne ,havale etmenin) caiz olduğunu, tahkimi için iki tarafın rıza gösterdiği kimsenin vereceği hükmün, onlar hakkında geçerli olacağını kabul edenlerin görüşlerinin lehine de delil bulunmaktadır. \"Halbuki ikisi orada değillerdi.\" Yani (olayı anlatırken Nebiin) huzurunda bulunmuyorlardı. Bu, rivayeti nakledenin sözlerindendir. 3472- \"Akar\" sözlükte ev ve tarla anlamlarındadır. Bazıları ise sadece hurmalık anlamında olduğunu kabul etmişlerdir. Evin oldukça değerli eşyalarına da akar denilebilir. \"Akarı satın alan kişi o akarında içinde altın bulunan bir testi buldu. Onu satana: Altınını al, çünkü ben senden ancak toprağı satın aldım, altını satın almadım dedi.\" İshak b. Bişr yoluyla gelen rivayete göre müşteri kendisinin bir ev satın aldığını, onu imar ederken içinde bir hazine bulduğunu söyledi. Satıcı da ona bu hazineyi gelip almaya çağırınca şu cevabı vermişti: Ben ne gömdüm, ne de bunu biliyorum. Her ikisi de hakime dedi ki: Sen bunu alacak birisini gönder, nasıl uygun görürsen onu öyle kullan. Ancak hakim bunu kabul etmedi. Buna göre bu malın hükmü, cahiliye döneminde gömülmüş olduğu bilinmesi halinde bizim şeriatimizde rika.zın hükmüdür. Eğer onun Müslümanlar tarafından gömüldüğü bilinecek olursa o takdirde o bir lukatadır. Bilinmeyecek olursa kaybolmuş mal hükmündedir, Beytu'I-Mal'e konulur. Muhtemelen onların şeriatinde böyle bir teferruat bulunmuyordu. Bundan dolayı kadı da belirtilen şekilde hüküm verdi. Kurtubı ise hakimin onlardan herhangi birisi hakkında hüküm vermemiş olduğunu kesin bir dille ifade etmiştir. O, adı geçen malın sadece kaybolmuş mal hükmünde olduğunu görünce aralarında sulh yapmıştır. Onların bu mala başkalarından daha bir hak sahibi olduklarını görmüştür. Çünkü her ikisinin de oldukça vera' sahibi olduklarını, hallerinin de güzelolduğunu görerek onların soylarından güzel bir semere ve salih bir zürriyet çıkacağını ümit ederek böyle hareket etmiştir. 3477 - \"Nebi Sallallahu Aleyhi ve Sellem'i nebilerden bir nebiyi anlatırken görür gibiyim. Kavmi onu vurmuş ve kanatmışlardı.\" Ben bu nebinin isminin ne olduğunu açık bir şekilde tespit edemedim. Nuh aleyhisselam olması ihtimali vardır. Ancak Nevevı diyor ki: Nebi Sallallahu Aleyhi ve Sellem'in bu anlattığı olayın başından geçtiği Nebi, öncekilerden birisidir. Uhud gününde de bizim Nebiimizin başından buna yakın bir olay geçmiştir. 3478- \"Allah'ın kendisine mal verdiği ... \" Malını çoğalttığı bir kimse demektir. 3481- \"Allah'a yemin ederim, Allah bana güç yetirirse (beni sıkıştırırsa)\" ifadesi ile ilgili olarak el-Hattabı şunları söylemektedir: Bu ifadenin açıklanması kimilerine göre zor gelebilir ve: Böyle bir kimse ölümden sonra dirilişi ve ölüleri diriltme kudretini inkar ettiği halde, nasılolur da Allah ona mağfiret edebilir? Cevap şudur: Bu kişi ölümden sonra dirilişi inkar eden birisi değildi. O sadece cahillik etmiş birisi idi. Dolayısıyla kendisine bu uygulama yapılacak olursa diriltilmeyeceğini ve azaba uğratılmayacağını sanmıştı. Onun iman sahibi olduğu, bu işi Allah'ın haşyetinden yaptığını itiraf etmek ile ortaya çıkmıştır. İbn Kuteybe der ki: Bazı sıfatlar hakkında birtakım Müslümanlar hata edebilir ve bundan dolayı da kafir sayılmazlar. Ancak İbnu'l-Cevzı bunu kabul etmeyerek şunu söylemektedir: Bir kimsenin kudret sıfatını inkar etmesi ittifakla küfürdür. Hadisteki: \"Andolsun Allah beni sıkıştırırsa\" sözleri beni sıkıştırıp aleyhime daraltırsa, demektir. Yüce Allah'ın: \"Kime rızkı daraltılırsa\" buyruğuna benzemektedir. \"Belki Allah'ı idlal ederim\" sözlerinin anlamı ise, belki ondan kurtulurum şeklindedir. Nitekim bir şey geçip gidince de onun hakkında \"dalle\" fiili kullanılabilir. Bu da yüce Allah'ın: \"Rabbim kaybolup gitmez de, unutmaz da.\"[Taha, 52] buyruğuna benzemektedir. Muhtemelen bu adam bu sözlerini aşırı derecedeki korkus1:lndan ve çekinmesinden dolayı söylemiştir. Nitekim bir başkası: \"Sen benim kulumsun, ben de senin rabbinim\" dediği rivayet edilmiştir. Yahut da: \"Eğer Rabbim hakkımda takdir ederse\" (anlamında kaddere şeklinde) dal harfi şeddeli söylenmiş de olabilir. Yani eğer beni azaplandırmayı takdir etmişse, elbetteki beni azaplandıracaktır. Yahut da o yaratıcıyı kabul eden birisi olmakla birlikte, fetret zamanında yaşayan birisi idi. İmanın şartlarının ne olduğu ona ulaşmamıştı. Bu konudaki en güçlü görüş, onun bu sözlerini neler söylediğini akledip, kavrayamayacak hale gelecek şekilde korku ve dehşetin baskısı altında bulunduğu bir halde söylemiş olduğudur. Yoksa o bu sözlerini gerçek manasını kastederek söylememiş; aksine o bu sözleri kişinin yaptıklarından sorumlu tutulmayacağı gaflet halinde iken, yanılacak ya da unutacak bir halde iken söylemiştir. 3483- \"Nübuvvet sözlerinden insanların idrak ettikleri arasında ... \" ibaresinde bütün rivayet yollarında (insanlar anlamındaki) \"en-nas\" lafz! merfudur (özne konumundadır.) Bunun nasb ile okunması da caizdir. İnsanlara ulaşanlardan demek olur. \"Nübuvvet kelamından\" enbiyanın ittifakla belirttikleri hususlardan anlamındadır. Yani bütün nebiler bunu teşvik etmiştir ve onların hiçbirisinin şeriatinde bu hüküm nesholmamıştır. Çünkü bu bütün akılların da ittifaklakabul ettikleri bir husustur. \"Dilediğini yapabilirsin\" ibaresi, haber anlamında emirdir ya da tehdit için söylenmiş olabilir. Dilediğini yapabilirsin, şüphesiz Allah da sana yaptığının karşılığını verecektir, demek olur. Yahut şu anlamda olabilir: Yapmak istediğine bak, düşün. Eğer utanç vermeyecek işlerdense yap. Utandıracak işlerdense onu bırak. Şu anlama da gelebilir. Şayet sen din ile ilgili olup, utanmaman gereken bir şey yaptığında Allah'tan da utanmanı gerektirmiyorsa onu yap ve insanlara aldırma. Maksat hayalı olmayı teşvik ve onun faziletine dikkat çekmek de olabilir. Yani senin dilediğin her şeyi yapman caiz olmadığına göre utanmayı, hayalı olmayı terk etmen de caiz değildir",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 154
			}
		}
	]
}