{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"62": "Companions of the Prophet"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3649,
			"arabicnumber": 3649,
			"text": "Amr ibn Dînâr şöyle demiştir: Ben Câbir ibn Abdillah (radıyallahü anh)'tan işittim, şöyle diyordu: Bize Ebû Saîd el-Hudrî(radıyallahü anh) tahdîs edip şöyle dedi: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: \"İnsanlar üzerine bir zaman gelir ki, o zamanda insanlardan bir cemâat gaza eder. Onlara: İçinizde Peygamber'le sohbet eden kimse var mıdır? Diye sorarlar. da: Evet vardır! Diye cevâb verirler. Nihayet (ordu içindeki sahâbîye hürmeten zafer kapısı) onlara açılır. Sonra insanlar üzerine bir zaman daha gelir. İnsanlardan bir gurup daha gaza eder. Onlara da: İçinizde Peygamber'in sahâbîleriyle görüşen kimse var mıdır? sorulur. Onlar da: Evet var! Diye cevâb verirler; onlara da fetih müyesser olur. Sonra insanlar üzerine bir zaman daha gelir, yine bir topluluk harb ederler. Onlara da: İçinizde Peygamber'in sahâbîlerini gören ile görüşen tabiî kimse var mıdır? Diye sorulur. Bu defa onlar da: Evet vardır! Derler; onlara da fetih müyesser olur",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3650,
			"arabicnumber": 3650,
			"text": "Ebû Cemre şöyle demiştir: Ben Zehdem ibn Mudarrib'den işittim, şöyle dedi: Ben İmrân ibn Husayn(radıyallahü anh)'dan işittim, şöyle diyordu: Rasûlüllah (sallallahü aleyhi ve sellem): \"Ümmetimin hayırlısı, benim asrımdır. Sonra onlara yakın olan (tab'iî)lerdir. Sonra onlara yakın olanlardır\" buyurdu. Rasûlüllah, kendi asrından sonra(hayırlı olarak) iki asır mı, yoksa üç asır mı zikretti bilmiyorum, demiştir. devamla: \"Sizden sonra bir kavim gelecektir ki, bunlar şehâdet etmeleri istenmeden şehâdet edecekler, bunlar hıyanet edecekler, kendilerine i'timâd edilmeyecek, yine bunlar adak adayacaklar, fakat adaklarını yerine getirmeyecekler. Artık bunlarda (aşırı yemek içmek hayâtın gayesi olduğundan) semizlenme meydana gelecektir\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3651,
			"arabicnumber": 3651,
			"text": "Abdullah ibn Mes'ûd (radıyallahü anh)'dan: Peygamber (sallallahü aleyhi ve sellem) şöyle buyurmuştur: \"İnsanların hayırlısı benim asrımdır. Sonra onlara yakın olanlardır (yani tâbiîler'dir). Sonra onlara yakın olanlardır. Sonra bir kavim gelir ki, onlardan birinin şehâdeti (ihtiras ile) yeminine; yemîni de şehâdetinin önüne geçer\". râvîlerinden İbrâhîm en-Nahaî: Bizler çocuk iken velîlerimiz bizi \"Eşhedü billahi...\" gibi şehâdet sözlerimizden ve \"Allah ile ahdim olsun\" şeklindeki ahd sözlerimizden dolayı döverlerdi, demişti",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3652,
			"arabicnumber": 3652,
			"text": "el-Berâ(radıyallahü anh) şöyle demiştir: Ebû Bekr(radıyallahü anh) Âzib'den onüç dirhem mukaabilinde bir binek devesi satın aldı. Akabinde Ebû Bekr,(babam) Âzib'e hitaben: (Oğlun) el-Berâ'ya emret de devemi bana naklediversin! dedi. Bu isteğin olmaz. Ancak sen ve Rasûlüllah beraberce Mekke'den Medine'ye doğru yola çıktığınız zaman, müşrikler de sizi aramaktalarken nasıl yaptığınızı bize anlatırsan olur, dedi. Bekr şöyle dedi: Mekke'den hareket ettik. Bütün gecemizi ve gündüzümüzü ihya ettik, yahut yürüdük. Nihayet sıcak vakte girdik. Güneş gündüzün yarısına gelip dikildi. Ben, kendisine sığınıp barınabileceğimiz bir gölge görebilir miyim diye etrafa bir göz attım. Büyük bir kaya gördüm. O'nun yanına geldim ve onun kalan gölgesine baktım. Oradan bir yeri düzelttim. Sonra orayı Peygamber için döşedim. Sonra O'na: Yâ Nebiyyallah, yat! dedim. yattı. Sonra ben, etrafıma bakmak üzere, arayıcılardan herhangi bir kimse görür müyüm diye gittim. Derken koyunlarını bulunduğumuz kayaya doğru sürüp getirmekte olan bir koyun çobanı ile karşılaştım. O da bizim gibi o kayanın gölgesinden faydalanmak istiyordu. Ona sorup: Sen kimin çobanısın ey delikanlı? dedim. Kureyş'ten bir adamın çobanıyım, dedi ve onun ismini söyledi. onun söylediği adamı tanıdım. Sonra: Senin koyunlarında süt var mı? dedim. O: Evet vardır, dedi. Ben: Sen bize süt sağar mısın? dedim. Evet sağarım, dedi; Ben ona emrettim de o sürüsünden bir koyunu durdurup tuttu. ona, koyunun memesini tozlardan silkelemesini emrettim. Sonra da ona ellerini silkeleyip temizlemesini emrettim. Avuçlarından birini diğerine şöylece vurup silkeledi. Ve çoban benim için bir adam kandıracak kadar az bir süt sağdı. Ben Rasûlüllah için ağzında bir bez parçası olan deriden bir su kabı yapmıştım. Ondan sütün üzerine biraz su döktüm, hattâ süt kabının aşağısı serinledi. Akabinde o süt kabını Peygamber'in yanına götürdüm ve kendisini uyanmış buldum. O'na: İç yâ Rasûlallah! dedim. içti, ben de bundan hoşnûd oldum. Sonra: Hareket etme vakti gelmiştir yâ Rasûlallah! Dedim. O: \"Evet\" dedi ve hareket ettik. bizi arıyorlardı. Bize onlardan atının üzerinde Surâka tu'bnu Mâlik ibn Cu'şum'dan başka hiçbir kimse erişmedi. Ben: İşte arayanlar bize yetiştiler yâ Rasûlallah! dedim. \"La tahzen inne'llâhe maanâ- Tasalanma, çünkü Allah hiç şübhe yok bizimle beraberdir\"(et-Tevbe: 40) dedi. getirirken, sabahleyin salıverirken onlarda sizin için güzel bir zînet (ve zevk) vardır\" (en-Nahl: 6)",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3653,
			"arabicnumber": 3653,
			"text": "Ebû Bekr (radıyallahü anh) şöyle demiştir: Biz mağarada iken (bizi aramağa çıkan müşrikler bize çok yaklaşmış, üstümüze gelmişlerdi). Ben: Yâ Rasûlallah! Bunlardan birisi eğilip de ayaklarının altına baksa bizi muhakkak görecekler, dedim. aleyhi ve sellem): \"Yâ Ebâ Bekr! Üçüncüleri Allah olan iki kimseyi ne zannediyorsun?\" dedi",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 3654,
			"arabicnumber": 3654,
			"text": "Ebû Saîd el-Hudrî (radıyallahü anh) şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) son -hastalığında - insanlara bir hutbe yaptı da: \"Allah bir kulunu dünyâ ile kendi yanında bulunan şeyler ara-'sında muhayyer bıraktı. O kul da Allah katındaki şeyleri tercih etti\" buyurdu. dedi ki: (Bu söz üzerine) Ebû Bekr ağlamaya başladı. Biz, Rasûlüllah'ın muhayyer kılınmış bir kuldan haber vermesi sebebiyle onun ağlamasına hayret ettik. Meğer o muhayyer kılınan kul Rasûlüllah'ın kendisi imiş, Ebû Bekr de o sözü en bilenimiz imiş. Rasûlüllah (Ebû Bekr'i ağlar görünce): \"Sohbeti (yani arkadaşlığı) hususunda da, malı hususunda da insanların bana en çok vergisi olanı Ebû Bekr'dir. Bir halîl edinecek olaydım elbette Ebû Bekr'i bir halîl edinirdim. Lâkin İslâm yönünden meydana gelen kardeşlik ve sevgi (şahsî dostluktan daha faziletlidir). Mescidde Ebû Bekr'in kapısından başka kapatılmadık hiçbir kapı kalmasın",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3655,
			"arabicnumber": 3655,
			"text": "Abdullah ibn Omer (radıyallahü anh) şöyle demiştir: Biz, Peygamber (sallallahü aleyhi ve sellem)'in hayâtı zamanında: İnsanlar arasında fulân fulândan hayırlıdır, fulân da fulân kimseden hayırlıdır, diye konuşurduk. Neticede Ebû Bekr'i, sonra Omer ibnu'l-Hattâb'ı, sonra Usmân ibn Affân'ı (Allah onların hepsinden razı olsun) hayırlıdır, derdik",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3656,
			"arabicnumber": 3656,
			"text": "İbn Abbâs radıyallahü anhüma'tan: Peygamber(sallallahü aleyhi ve sellem): \"Ümmetimden birini sevgisi samîmi ve silinmesi kaabil olmayan bir dost edinecek olsaydım, hiç şüphesiz Ebû Bekr'i edinirdim. Fakat o benim dîn kardeşim ve (hazarda, seferde) sahibim, arkadaşımdır\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3657,
			"arabicnumber": 3657,
			"text": "Eyyüb es-Sahtıyânî'den: o da İkrime'den; o da ibn Abbâs'tan gelen hadîste Peygamber(sallallahü aleyhi ve sellem): \"Eğer bir halîl edinecek olsaydım, elbette onu(Ebû Bekr'i) halil edinirdim. Fakat İslâm kardeşliği daha üstündür\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3658,
			"arabicnumber": 3658,
			"text": "Abdullah ibn Ebî Muleyke şöyle demiştir: Bir kerre Küfe ahâlîsi (yani Küfe kaadısı Abdullah ibn Utbe ibn Mes'ûd), Abdullah ibnu'z-Zubeyr'e, dedenin mîrâsı hakkında bir mektûb yazıp bu mes'eleyi sordu. İbnu'z-Zubeyr de: Hakkında Rasûlüllah (sallallahü aleyhi ve sellem)'ın \"Eğer İslâm Ümmeti içinden bir kimseyi sâdık, samîmi dost edinecek olsaydım, muhakkak onu dost edinirdim\" buyurmuş olduğu zât (yani Ebû Bekr), dedeyi, mîrâs hükmünde baba yerine koymuştur, diye cevâb verdi",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3659,
			"arabicnumber": 3659,
			"text": "Cubeyr ibn Mut'ım (radıyallahü anh) şöyle demiştir: Bir kerre Peygamber(sallallahü aleyhi ve sellem)'in yanına bir kadın geldi. (Giderken) Peygamber kadına tekrar kendisine müracaat etmesini emretti. Kadın sanki Peygamber'in ölümünü ta'rîz ederek: Ben gelir de seni bulamazsam? diye sordu. Peygamber: “Şâyet beni bulamazsan Ebû Bekr'e müracaat et” buyurdu",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3660,
			"arabicnumber": 3660,
			"text": "Hemmâm (ibnu'l-Hâris en-Nahaî el-Kûfî) şöyle demiştir: Ben Ammâr-ibn Yâsir (radıyallahü anh)'den işittim; o: Ben Rasûlüllah(sallallahü aleyhi ve sellem)'ı gördüğümde, O'nun beraberinde (ilk müslümânlar olarak) beş köle, iki kadın, bir de Ebû Bekr'den başka kimse yoktu, diyordu",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3661,
			"arabicnumber": 3661,
			"text": "Ebu'd-Derdâ (radıyallahü anh) şöyle demiştir: Ben Peygamber (sallallahü aleyhi ve sellem)'in yanında oturuyordum.. Bu sırada Ebû Bekr, elbisesinin eteğini diz kapaklarını açıncaya kadar toplayarak(telâşla) çıkageldi. Peygamber bize: \"Arkadaşınıza gelince, o birisiyle çekişmiş olacak\" buyurdu. Bekr selâm verdi ve: Yâ Rasûlallah! Benimle Hattâb oğlu arasında bir şey (bir çekişme) oldu. Ben bu çekişmede Omer'e tecâvüz ettim. Sonra pişman oldum da kendisinden beni affetmesini istedim. Fakat Omer kabul etmedi. Ben de Sana geldim, dedi. üzerine Rasûlüllah üç kerre: \"Allah seni mağfiret etsin yâ Ebâ Bekr!\" dedi Sonra Omer de bu dargınlıktan pişman oldu da Ebû Bekrin evine gitti ve: Ebû Bekr burada mı? diye sordu. Ev halkı: Hayır, burada değil, diye cevâb vermeleri üzerine, Omer de Peygamber'in huzuruna geldi ve O'na selâm verdi. sırada Peygamber'in yüzü değişmeye başladı. Hattâ Ebû Bekr korktu da iki dizi üzerine çöktü ve iki kerre: Yâ Rasûlallah! Vallâhî bu işte Omer'den ziyâde ileriye gitmişimdir, dedi. üzerine Peygamber (hepimize hitaben): \"Şübhesiz ki, Allah beni size peygamber göndermişti. Bunu size tebliğ ettiğimde hepiniz bana: 'Yalan söyledin' demiştiniz- Ebû Bekr ise: 'Doğru söyledin' demiş ve bana canı ile malı ile yâr ve yardımcı olmuştur” buyurdu. Rasûlüllah iki kerre: \"Şimdi sizler benim bu dostumu, bu nisbeti ve bu hususiyeti ile bana bırakırsınız değil mi?\" buyurdu. Ebu'd-Derdâ: Ebû Bekr, hakkında Peygamber'in ortaya koyduğu bu büyütmeden sonra artık O'nun hatırı için hiç incitilmedi, demiştir",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3662,
			"arabicnumber": 3662,
			"text": "Amr ibnu’l-Âs (radıyallahü anh) şöyle tahdîs etmiştir: Peygamber(sallallahü aleyhi ve sellem) Amr'ı Zât-ı Selâsil ordusu üzerine kumandan yapıp göndermişti. Amr dedi ki: Bu gazveden döndüğümüzde Peygamber'in huzuruna geldim ve: İnsanların hangisi sana en sevimlidir? Diye sordum. Peygamber: \"Âişe'dir\" dedi. Ben: Erkeklerden en sevimli olan kimdir? dedim. Peygamber: \"Âişe'nin babasıdır\" buyurdu. Ben: Sonra kimdir? dedim. Peygamber: \"Sonra Omer ibnu'l-Hattâb'dır\" buyurup, birtakım adamların adlarını saydı",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3663,
			"arabicnumber": 3663,
			"text": "Ebû Hureyre (radıyallahü anh) şöyle demiştir: Ben Rasûlüllah(sallallahü aleyhi ve sellem)'den işittim, şöyle buyuruyordu: \"Bir çoban, sürüsünün içinde bulunduğu sırada sürüye kurt saldırdı ve ondan bir koyun aldı. Çoban (ondan koyunu geri almak için) ardından araştırdı. Derken kurt çobana döndü de: Yırtıcı hayvan (ların sürüye saldıracağı o fitne) gününde, koyun sürüsünün benden başka çobanı bulunmayacak o günde, koyunu benden kim kurtarır? Dedi. yine bir adam bir sığırın üzerine yük yüklemiş olarak onu sevkeder giderken, sığır o kimseye yüzünü çevirdi de onunla kelâm edip: Ben bunun için yaratılmadım, lâkin ben tarla sürmek için yaratıldım, dedi \". dedi ki:) İnsanlar (bu hikâyeden hayret ederek): Subhânallah! dediler. Peygamber ise: \"Ben bu hayvanların böyle söz söylediklerine inanıyorum; Ebû Bekr de, Omer ibnu'l-Hattâb da (inanıyorlar)\" buyurdu",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3664,
			"arabicnumber": 3664,
			"text": "Ebû Hureyre (radıyallahü anh) şöyle demiştir: Ben Peygamber (sallallahü aleyhi ve sellem)'den işittim, şöyle buyuruyordu: \"Ben kendimi ru'yâmda üzerinde bir kova olan bir kuyu başında gördüm. O kuyudan Allah'ın dilediği kadar su çektim. Sonra kovayı Ebû Kuhâfe'nin oğlu aldı, o da kova ile bir yahut iki kova su çekti. Ebû Kuhâfe oğlu Ebû Bekr'in su çekmesinde bir zayıflık vardı. Allah Ebû Bekr'e bu za'fından dolayı mağfiret etsin. Sonra bu küçük kova büyük bir kovaya dönüştü. Onu Omer ibnu'l-Hattâb aldı. Ben insanlar içinde Omer'in çekişi gibi su çekebilecek kuvvette kavi ve kâmil bir kişi göremedim. Nihayet insanlar o kuyu başını develerin sulak ve eylek yeri edindiler",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 3665,
			"arabicnumber": 3665,
			"text": "Abdullah ibn Omer (radıyallahü anh) şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem): \"Kim giydiği elbisesini büyüklenerek (yerde) sürüklerse, kıyâmet gününde Allah ona (rahmet bakışıyle) bakmaz\" buyurdu. Bekr: Benim elbisemin iki tarafından birisi -ben onu sürünmekten korumazsam- muhakkak yerde sürünür (ne buyurursun)? Diye sordu. ' 'Sen kaftanını sürüklemeyi büyüklenerek yapar değilsin'' buyurdu. râvîlerinden Mûsâ ibn Ukbe, Sâlim'e: Abdullah ibn Omer: \"Kim izârını yerde sürüklerse\" sözünü zikretti mi? diye sordu. de: Ben babam Abdullah'tan ancak \"Elbisesini\" sözünü zikrettiğini işittim, demiştir",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 3666,
			"arabicnumber": 3666,
			"text": "Ebû Hureyre (radıyallahü anh) şöyle demiştir: Ben Rasûlüllah(sallallahü aleyhi ve sellem)'tan işittim, şöyle buyuruyordu: \"Kim Allah yolunda (yani Allah rızâsı için) şeylerden herhangi birşeyden çift sadaka verirse, kapılardan, yani cennet kapılarından: Ey Allah'ın kulu! Bu kapı hayırlıdır! Diye çağırılır. Her kim de devamlı namaz kılanlardan olursa, o da (cennetin) namaz kapısından çağırılır. Cihâd ehlinden olan ise cihâd kapısından çağırılır. Sadaka verenlerden olan kimse ise sadaka kapısından çağırılır. Oruç tutanlardan ise oruç kapısından ve Reyyân kapısından çağırılır\". Bekr: Bu kapıların hepsinden çağırılan kimse üzerine bir zarar var mıdır? dedi. Ebû Bekr: Yâ Rasûlallah, bir kimse bu kapıların hepsinden çağırılır mı? Diye sordu. \"Evet, hepsinden da'vet olunur ve ben senin onlardan olacağını ümîd ediyorum yâ Ebâ Bekr!\" dedi",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 3668,
			"arabicnumber": 3668,
			"text": "",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 3670,
			"arabicnumber": 3670,
			"text": "",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 3671,
			"arabicnumber": 3671,
			"text": "Muhammed ibnu'l-Hanefiyye şöyle demiştir: Ben babam Alî ibn Ebî Tâlib'e: Rasûlüllah (sallallahü aleyhi ve sellem)'tan sonra insanların en hayırlısı hangisidir? diye sordum. Babam: Ebû Bekr'dir, dedi. Ben: Sonra kimdir? Dedim Babam: Sonra Omer'dir, dedi. \"Usmân\" denilmesinden korktum da: Omer'den sonra sensin, dedim. Babam: Ben müslümânlardan bir adam olmaktan başka birşey değilim, dedi",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 3672,
			"arabicnumber": 3672,
			"text": "Âişe (r.anha) şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem)'ın yaptığı seferlerin birinde beraberinde yola çıktık. Ya Beydâ'ya, ya da Zâtu'l-Ceyş'e vardığımızda(yanımda ariyet olan) bir gerdanlığım koptu. Onun aranması için Rasûlüllah bekledi. İnsanlar da O'nunla beraber beklediler. Halbuki bir su yanında değillerdi; beraberlerinde de su yoktu. İnsanlar Ebû Bekr'e gelip: Âişe'nin yaptığını görüyor musun? Rasûlüllah'ı da, O'nunla beraber insanları da (yollarından) alıkoydu. İnsanlar su başında değiller, yanlarında su da yok! dediler. Bekr yanıma geldi. Rasûlüllah başını dizimin üzerine koyup uyumuştu. Ebû Bekr: Sen Rasûlüllah'ı da, insanları da yolundan alıkoydun. Su başında değiller, yanlarında da su yok! dedi. dedi ki: Ebû Bekr beni azarladı ve Allah'ın, onun söylemesini istediği şeyleri söyledi, eli ile de böğrümü dürtmeye başladı. Beni kıpırdamaktan Rasûlüllah'ın dizim üzerinde bulunmasından başka hiçbirşey men' etmiyordu. Rasûlüllah sabah oluncaya kadar uyudu, hiç su yoktu. İşte bunun üzerine Allah, Teyemmüm (el-Mâide:6) âyetini indirdi. İnsanlar teyemmüm ettiler. Useyd ibn Hudayr(radıyallahü anh): Yâ Ebâ Bekr hanedanı! Bu sizin ilk bereketiniz değildir, dedi. (Sonra, gideceğimiz sırada) üzerine bindiğim deveyi kaldırdık ve gerdanlığı altında bulduk, demiştir",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 3673,
			"arabicnumber": 3673,
			"text": "Ebû Saîd el-Hudrî (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem): (Ey müstakbel müslümânlar!) Sahâbîlerime sövmeyiniz. Sizden biriniz Uhud Dağı kadar altın sadaka verse, sahâbîlerden birinin iki avuç (hurma) sadakasına erişemez; bunun yarısına da ulaşamaz\" buyurdu hadîsi el-A'meş'ten rivayet etmekte Şu'be'ye, Cerîr, Abdullah ibn Dâvûd, Ebû-Muâviye ve Muhâdır mutâbaat etmişlerdir",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 3674,
			"arabicnumber": 3674,
			"text": "Saîd ibnu'l-Müseyyeb şöyle dedi: Bana Ebû Mûsâ el- Eş'arî haber verdi ki, kendisi evinde abdest alıp sonra dışarıya çıkmış. (Ebû Mûsâ devamla şöyle dedi:) Evden çıkınca: Bu günümde muhakkak Rasûlüllah'tan ayrılmayacağım ve muhakkak O'nun maiyyetinde olacağım diye ahdettim. dedi ki: Ebû Mûsâ bu niyetle Mescid'e geldi ve Peygamber(sallallahü aleyhi ve sellem)'i sordu. Mescidde bulunanlar: Peygamber Mescid'den çıktı ve şu tarafa yönelip gitti, dediler. de Mescid'den çıkıp Peygamber'i sora sora izi üzerinde arkasından gittim. Nihayet Peygamber'i Erîs Kuyusu'na (kuyunun bulunduğu bostana) girmiş buldum. Ben de kapının yanına oturdum. Bu bostanın kapısı hurma dalından yapılmıştı. Nihayet Rasûlüllah hacetini yerine getirip abdest aldı. Ben de kalkıp O'nun yanına vardım. Gördüm ki, Rasûlüllah Erîs Kuyusu'nun ağzındaki bileziğin (yahut kuyu ağzının etrafına örülmüş düz taşların) ortasına oturmuş ve (serinlemek için) iki baldırını açarak kuyuya sarkıtmıştı. Ben Rasûlüllah'a selâm verdim. Sonra geri dönüp kapının yanına oturdum. Ve kendi kendime: Artık bugün ben muhakkak Rasûlüllah'ın kapıcısı olacağım, karar verdim. sırada Ebû Bekr geldi, kapıyı çaldı. Ben: Kimdir o? diye sordum. Ebû Bekr! dedi. Biraz bekle, dedim, Sonra gittim ve: Yâ Rasûlallah! Şu bekleyen Ebû Bekr,(yanınıza gelmek için) izin istiyor, dedim. \"Ona izin ver ve kendisini cennetle müjdele\" buyurdu. Hemen geri döndüm ve Ebû Bekr'e: Gir! Hem Rasûlüllah seni cennetle müjdeler, dedim. Bekr içeriye girdi ve kuyu bileziğinde Rasûlüllah'ın sağ tarafında O'nun yanına oturdu. Ve Rasûlüllah'ın yaptığı gibi baldırlarını açarak ayaklarını kuyuya sarkıttı. Sonra ben dönüp(kapı yanındaki yerime) oturdum. Ben,(evden çıkarken) kardeşimi abdest alıp arkamdan bana yetişmek üzere bırakmıştım. Kardeşimi kasdederek: Allah fulân kuluna hayır kasdederse, şimdi o da buraya gelir, diye hatırladım. sırada bir insan kapıyı salladı. Kimdir o? dedim. Omer ibnu'l-Hattâb'dır! diye cevâb verdi. Yavaş ol, biraz bekle, dedim. Rasûlüllah'a geldim, kendisine selâm verip: (Yâ Rasûlallah!) Şu bekleyen Omer ibnu'l-Hattâb'dır, izin istiyor, dedim. \"Ona izin ver ve kendisini cennetle müjdele\" buyurdu. : Geldim ve Omer'e: Gir, Rasûlüllah seni cennetle müjdeledi, dedim. de girdi ve kuyu ağzındaki bilezikte Rasûlüllah'ın sol tarafına oturdu. O da iki ayağını kuyuya sarkıttı. Sonra ben kapı yanındaki yerime dönüp oturdum. Yine (kardeşimi hatırlayarak): Allah fulân kimseye hayır ve saadet dilerse, o da buraya gelir, (bu saadete erişir), dedim. bir insan geldi, kapıyı hareket ettirdi. Kimdir o? dedim. Usmân ibnu Affân'dır, dedi. Yavaş ol, biraz bekle, dedim. Rasûlüllah'a gelip haber verdim. Rasûlüllah: \"Ona izin ver ve kendisine, erişecek belâ ve imtihan üzerine onu cennetle müjdele\" buyurdu. de geldim ve Usmân'a: Gir, Rasûlüllah sana erişecek belâ ve musibet üzerine cennetle müjdeledi, dedim. da girdi. Fakat kuyu bileziğini dolmuş buldu da Rasûlüllah'ın karşısında başka tarafa oturdu. Şerîk ibn Abdillah şöyle dedi: Saîd ibnu'l-Müseyyeb: İkisinin Peygamber'in beraberinde, Usmân’ın da karşılarında oturmuş olmasını ben onların kabirleriyle te'vîl ettim, dedi",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 3675,
			"arabicnumber": 3675,
			"text": "",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 3676,
			"arabicnumber": 3676,
			"text": "",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 3677,
			"arabicnumber": 3677,
			"text": "İbn Abbâs radıyallahü anhüma şöyle demiştir: Ben, Omer ibnu'l-Hattâb tâbutu üzerine konmuş olduğu hâlde onun için Allah'a duâ eden cemâatin içinde ayakta dikildim. Bu sırada bir adam arkamda dirseğini omuzum üzerine koymuş da şöyle diyordu: (Yâ Omer!) Allah sana merhamet etti. Ben muhakkak Allah'ın seni iki dostunla(Peygamber ve Ebû Bekr'le) beraber bulunduracağını kuvvetle umuyordum. Çünkü ben, Rasûlüllah (sallallahü aleyhi ve sellem)'tan çok defa bir düzeye: \"Ben, Ebû Bekr ve Omer'le şöyle oldum; ben Ebû Bekr ve Omer'le şöyle yaptım; ben Ebû Bekr ve Omer'le şuraya gittim\" derken işitir dururdum. Bunun için ben, Allah'ın seni muhakkak iki dostunla beraber bulunduracağını kuvvetle ümîd ederdim. Abbâs dedi ki:) Bir de dönüp baktım ki, bu sözleri söyleyen Alî ibn Ebî Tâlib(radıyallahü anh)'dir",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 3678,
			"arabicnumber": 3678,
			"text": "Urvetu'bnu'z-Zubeyr şöyle demiştir: Ben Abdullah ibn Amr'a müşriklerin Rasûlüllah'a yaptıkları işkencenin en şiddetlisini sordum. Abdullah ibn Amr (radıyallahü anh) şöyle dedi: Ben günün birinde Peygamber(sallallahü aleyhi ve sellem) Ka'be'nin Hıcr'ında namaz kılarken yanına Ukbe ibn Ebî Muayt'ın geldiğini gördüm. Ukbe, Peygamber'in ridâsını toplayıp boynuna koydu ve O'nu şiddetli bir boğuşla boğmağa başladı. Tam bu sırada Ebû Bekr geldi ve nihayet onu Peygamber'den uzaklaştırdı da: \"Siz bir adamı, Rabbim Allah'tır demesiyle öldürür müsünüz? Halbuki O size Rabbinizden apaçık mu 'cizeler de getirmiştir...\" (el-Mü'min: 28) âyetini söyledi",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 3679,
			"arabicnumber": 3679,
			"text": "Câbir ibn Abdillah (radıyallahü anh) şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem) şöyle buyurdu: \"Ben (ru'yâmda) kendimi cennete girmiş gördüm. Orada Ebû Talha'nın karısı Rumeysâ ile karşılaştım. Bir de gürültüsüz, sakin bir ayak sesi işittim. Ve: Kimdir bu? diye sordum. Cibril: Bilâl'dır! diye cevâb verdi. bir de büyük bir köşk gördüm. Avlusunda bir câriye vardı. Ben: Bu köşk kimindir? dedim. Cibril: Omer'indir! dedi. içine girmek ve bakmak istedim. Fakat yâ Omer, senin kıskançlığını hatırladım.” de: Anam babam sana feda olsun yâ Rasülallah! Sana karşı mı kıskanacağım? dedi",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 3680,
			"arabicnumber": 3680,
			"text": "",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 3681,
			"arabicnumber": 3681,
			"text": "",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 3682,
			"arabicnumber": 3682,
			"text": "",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 3683,
			"arabicnumber": 3683,
			"text": "",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 3684,
			"arabicnumber": 3684,
			"text": "",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 3685,
			"arabicnumber": 3685,
			"text": "İbnu Ebî Muleyke, İbn Abbâs'tan şöyle derken işitmiştir: Omer,(vefat ettiğinde) seririnin üzerine konuldu. O yerden kaldırılmadan önce insanlar O'na duâ ederek ve cenaze namazı kılarak O'nun etrafını çepeçevre kuşattılar. Ben de Omer'in tâbutu etrafındaki insanların içinde bulundum. Beni hiçbir şey korkutmadı, ancak şu olay beni ürpertti: Bir adam benim omuzumu tuttu. Baktım ki o, Alî'dir. Alî, Omer'e rahmet okudu ve: Yaptığı işlerin benzeriyle Allah'a kavuşmak istediğim senden daha sevgili hiçbir kimseyi arkanda bırakmadın. Allah'a yemîn ederim ki, ben Allah'ın muhakkak seni (hücrede veya cennette) iki dostunla beraber bulunduracağını kuvvetle zannediyor idim. Ve çünkü ben bildim ki, kendim bizzat Peygamber'den çok defa bir düzeye şöyle buyururken işitirdim: \"Ben, Ebû Bekr ve Omer'le gittim. Ben, Ebû Bekr ve Omer'le girdim. Ben Ebû Bekr ve Omer'le çıktım",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 3686,
			"arabicnumber": 3686,
			"text": "Saîd'den; o da Katâde'den tahdîs etti ki, Enes (radıyallahü anh) onlara tahdîs edip şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem) beraberinde Ebû Bekr, Omer ve Usmân olduğu hâlde Uhud Dağı'na çıkmıştı. Orada bulundukları sırada dağ deprendi. Peygamber hemen: \"Ey Uhud sakin ol!\" buyurdu. Enes: Zannediyorum ki Peygamber ayağı ile dağa vurdu da: \"Senin üzerinde bir Peygamber, bir sıddîk ve iki şehîdden başkası yoktur\" buyurdu, demiştir",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 3687,
			"arabicnumber": 3687,
			"text": "Zeyd ibn Eslem tahdîs etti ki, (Omer'in âzâdlısı olan) babası Eslem şöyle demiştir: Bir kerre Abdullah ibnu Omer, benden Omer'in hâl ve şânına dâir bâzı menkabeler anlatmamı istedi. Ben de hatırladığım bâzı şeyleri ona haber verdim. Bunun üzerine İbn Omer: Rasûlüllah (sallallahü aleyhi ve sellem) müstesna olmak üzere ben, Omer derecesinde güzel huylu hiçbir kimse kat'î surette görmedim. Rasûlüllahın ruûhunun alınmasından Omer ibnu'l-Hattâb'ın hayâtının son bulmasına kadar Omer, insanların en ciddîsi ve en cömerdi idi, diye beni te'yîd etti",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 3688,
			"arabicnumber": 3688,
			"text": "Enes ibn Mâlik (radıyallahü anh)'ten(şöyle demiştir): Bir kimse Peygamber'e kıyâmetten sordu da: Kıyâmet ne zaman kopacak? dedi. Peygamber (sallallahü aleyhi ve sellem) de ona: \"O saate, o güne ne hazırladın?\" diye sordu. O kimse: Hiçbirşey hazırlamadım. Yalnız ben Allah'ı ve Rasûlü'nü severim, dedi. da: \"Öyle ise sen sevdiklerinle berabersin\" diye müjdeledi. Enes: Peygamber'in bu \"Sen sevdiklerinle beraber olacaksın\" müjdesiyle sevindiğimiz gibi hiçbirşeyle sevinip ferahlanmadık, demiştir. Enes ibn Mâlik: Ben Peygamber (sallallahü aleyhi ve sellem)'i, Ebû Bekr'i, Omer'i seviyorum. Onlara olan bu sevgim sebebiyle (kıyâmette) onlarla beraber olacağımı umuyorum. Hernekadar ben onların hayır işlerine benzer hayır ve ibâdet işlememiş isem de! demiştir",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 3689,
			"arabicnumber": 3689,
			"text": "",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 3690,
			"arabicnumber": 3690,
			"text": "Saîd ibnu'l-Müseyy eb ile Ebû Seleme ibn Abdirrahmân şöyle demişlerdir: Biz Ebû Hureyre (radıyallahü anh)'den işittik, şöyle diyordu: Rasûlüllah(sallallahü aleyhi ve sellem) şöyle buyurdu: \"Bir çoban koyun sürüsü içinde bulunduğu sırada sürüye kurt saldırdı ve ondan bir koyun aldı. Çoban onun arkasına düştü; nihayet koyunu o kurttan kurtardı. Bunun üzerine kurt çobana yöneldi de: Sürünün benden başka çobanı bulunmayacak olan o yırtıcı hayvanlar gününde koyunu benden kim kurtarır? dedi\". (kurdun konuşmasına şaşarak): Subhânallah, dediler. Bunun üzerindePeygamber (sallallahü aleyhi ve sellem): \"Ben kurdun böyle konuştuğuna inanıyorum. Ebû Bekr ile Omer de böyle inanırlar\" buyurdu. Peygamber \"Ebû Bekr ile Omer de böyle inanırlar\" dediği zaman orada Ebû Bekr ile Omer mevcûd değillerdi, demiştir",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 3691,
			"arabicnumber": 3691,
			"text": "Ebû Saîd el-Hudrî (radıyallahü anh) şöyle demiştir: Ben Rasûlüllah(sallallahü aleyhi ve sellem)'tan işittim, şöyle buyuruyordu: \"Ben uyuduğum sırada (ru'yâmda) birtakım insanlar gördüm. Onlar bana arz olundular. Üstlerinde gömlekler vardı. Bu gömleklerin kimi memelere ulaşıyor, kimi de bundan daha az yere ulaşıyordu. Omer de bana arz olundu. Üstünde (eteklerini yerde) sürüdüğü bir gömlek vardı\". Yâ Rasûlallah, bunu ne ile te'vîl(yani ta'Bir) ettin? diye sordular. \"Dîn ile\" cevâbını verdi",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 3692,
			"arabicnumber": 3692,
			"text": "Bize Eyyûb es-Sahtıyânî, İbnu Ebî Muleyke'den tahdîs etti ki, el-Mısver ibn Mahrame (radıyallahü anh) şöyle demiştir: Omer vurulduğu zaman elemlenmeye, endîşelenmeye başladı. Hemen(pek sevdiği) İbn Abbâs yanına gelerek endîşesini gidermek ve teselli etmek maksadıyle: Ey Mü'minlerin Emîri! Eğer bu vurulmadan ölüm olursa, vaziyetten o kadar endîşe etme! Yemin olsun, muhakkak sen Rasûlüllah(sallallahü aleyhi ve sellem)'a yâr ve hemdem oldun ve O'na pek güzel dostluk ettin. Sonra Rasûlüllah'tan -O, senden hoşnûd olarak- ayrıldın. Ondan sonra Ebû Bekr'e arkadaş oldun. Ona da pekiyi yoldaş oldun. Sonra Ebû Bekr'den de -o, senden hoşnûd ve razı olarak- ayrıldın. Sonra Peygamber'in ve Ebû Bekr'in bunca arkadaşlarına dost oldun; bunlara da pek güzel dostluk ettin. Eğer sen (bu defa ) sahâbîlerden ayrılırsan, muhakkak onlar senden hoşnûd ve râzı oldukları hâlde ayrılacaksın! Dedi. üzerine Omer: Rasûlüllah ile sohbet ve O'nun hoşnûdluğu hakkında zikrettiğin o güzel hâtıralar Yüce Allah'ın bana bahşettiği bir minnet ve ihsanıdır. Ebû Bekr'in sohbeti ve onun benden hoşnûdluğu hakkında zikrettiğin hâtıralar da yine hiç şübhesiz zikri ulu olan Allah'ın bir minnet ve ihsanıdır ki, onu bana bahşetmiştir. Senin şu anda bende görmekte olduğun ıztırab ve endîşeme gelince, o senin için ve senin en yakın ve en sâdık dostların içindir. Vallâhî şayet benim şu yer dolusu altınım olaydı azîz ve celîl olan Allah'ın azabından kurtulmak için o azâbı görmeden önce bu altınları (hiç tereddüd etmeden) muhakkak feda ederdim, demiştir",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 3693,
			"arabicnumber": 3693,
			"text": "Ebû Mûsâ (radıyallahü anh) şöyle demiştir: BenPeygamber'in beraberinde Medine bustânlarından bir bustânın içinde idim. Bir adam geldi de kapının açılmasını istedi. Peygamber: \"Ona kapıyı aç da kendisini cennetle müjdele\" buyurdu. o kimseye kapıyı açtım. Gördüm ki, o Ebû Bekr'dir. Ve kendisini Peygamber'in söylediği şeyle müjdeledim. Bu müjde üzerine Ebû Bekr Allah'a hamdetti. Sonra bir adam daha gelip o da kapının açılmasını istedi. Peygamber: \"Ona kapıyı aç ve kendisini cennetle müjdele\" buyurdu. Ben kapıyı açtım ve Omer'le karşılaştım. Ona da Peygamber'in söylediği şeyi haber verdim. O da Allah'a hamdetti. Sonra bir kimse daha kapının açılmasını istedi. Peygamber yine bana: \"Ona kapıyı aç ve kendisine isabet edecek belâ ve imtihana \"karşı onu cennetle müjdele\" buyurdu. Usmân olduğunu gördüm ve ona daRasûlüllah (sallallahü aleyhi ve sellem)'ın söylediklerini haber verdim, O da Allah'a hamdetti, sonra: (Gelecek musibetlere karşı) yardımına sığınılacak olan ancak Allah'tır, dedi. ibn Hişâm: Biz Peygamber(sallallahü aleyhi ve sellem) ile beraber bulunuyorduk. Peygamber(o topluluk içinde) Omer ibnu’l-Hattâb'ın elini tutuyordu, demiştir",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 3694,
			"arabicnumber": 3694,
			"text": "",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 3695,
			"arabicnumber": 3695,
			"text": "",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 3696,
			"arabicnumber": 3696,
			"text": "İbnu Şihâb şöyle demiştir: Bana Urve haber verdi. Ona da Ubeydullah ibn Adiyy ibni'l-Hıyâr haber verdi ki, Mısver ibn Mahrame ile Abdurrahmân ibnu'l-Esved ibn Abdi Yegûs, Ubeydullah ibn Adiyy'e: Seni ana bir kardeşi el-Velîd(ibn Ukbe ibn Ebî Muayt) için Usmân'la konuşmandan men' eden nedir? İnsanlar el-Velîd hakkında ithamı çoğaltmışlardır, dediler. dedi ki:) Bunun üzerine ben Usmân'a gitmeyi kasdettim. Namaza çıktığı zaman ona: Benim sana bir hacetim var, o hacet sana nasihattir, dedim. Usmân: Ey insan! dedi. Ma'mer ibn Râşid dedi ki: Ben sanıyorum ki, Usmân: Senden Allah'a sığınıyorum, dedi. üzerine ben Usmân'ın yanından ayrıldım da Mısver ile Abdurrahmân'ın yanına döndüm. Bu sırada Usmân'ın elçisi çıkageldi (Usmân beni çağırmış). Ben Usmân'ın yanına vardım. Usmân bana: Senin nasihatin nedir? dedi. Ben Usmân'a hitaben: Şübhesiz ki münezzeh olan Allah, Muhammed'i hakk ile gönderdi ve O'na Kitâb'ı indirdi. Sen de Allah'a ve Rasûlü'ne icabet edenlerden oldun. İki kerre hicret ettin. Allah Elçisi'yle sohbet ve arkadaşlık yaptın ve O'nun yolunu görüp bildin. İnsanlar(sîretinin kötülüğü sebebiyle) Velîd'in hâli hakkında çok söz etmişlerdir, dedim Sen Rasûlüllah'a yetiştin (O'ndan hadîs işittin) mi? dedi. Ben: Hayır, O'ndan hadîs işitmedim, lâkin O'nun ilminden bana, perdesi arkasındaki bakire kıza ulaşmakta olan yaygın ilim ulaşmıştır, dedim. şöyle dedi: Emmâ ba'dü = Sözün bundan sonrasına gelince: Şübhesiz Allah, Muhammed'i hakk ile peygamber göndermiş, ben de Allah'a ve Rasûlü'ne icabet eden kimselerden olmuşumdur. Ve Peygamber'le gönderilmiş olan bilgilere îmân etmiş, senin de söylediğin gibi iki defa hicret etmişimdir. Rasûlüllah'la sohbet etmiş ve O'na bey'at eylemişimdir. Allah'a yemîn ederim ki, Allah O'nu vefat ettirinceye kadar ben O'na isyan etmedim ve O'nu hiçbir zaman aldatmadım. O'ndan sonra Ebû Bekr geldi. Ona da isyan etmedim ve aldatmadım. Sonra Omer geldi. Ona da isyan etmedim ve aldatmadım. Sonra ben halîfe seçildim. Öyle olunca benim sizin üzerinizde, onların hakkı gibi hakkım olmadı mı? dedi. Ben: Evet, oldu, dedim. Usmân: Öyleyse sizlerden bana ulaşan şu uydurma haberler nedir? Amma Velîd'in durumundan zikrettiğin şeye gelince, inşâallah biz onun hakkında haklı karârı alacağız, dedi. Alî'yi çağırdı da Velîd'e deynekleme cezası vurmasını emretti. Alî de el-Velîd ibn Ukbe'ye seksen deynek vurdu",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 3697,
			"arabicnumber": 3697,
			"text": "Bize Abdulazîz ibnu Ebî Seleme el-Mâcişûn, Ubeydullah'tan; o da Nâfi'den; o da ibn Omer'den tahdîs etti ki, İbn Omer (radıyallahü anh): \"Bizler Peygamber'in hayâtı zamanında(sahâbîler arasındaki fazilet derecelerini görüşürdük de), sahâbîlerden hiçbirisini fazilette Ebû Bekr'e denk tutmazdık. Sonra Omer'e, sonra Usmân'a da müsâvî ve muâdil kimse bulmazdık. Bunlardan sonra Peygamber (sallallahü aleyhi ve sellem)'in diğer sahâbîlerini bırakırdık. Onların arasında fazilet farkı aramazdık\" demiştir. hadîsi Abdulazîz'den rivayet etmekte Abdullah ibn Salih, Şâzân'a mutâbaat etmiştir",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 3698,
			"arabicnumber": 3698,
			"text": "Bize Usmân -ki o İbnu Mevheb'dir- tahdîs edip şöyle dedi: Mısırlılar'dan bir adam geldi, Beyt'i hacc eyledi, bu sırada oturmakta olan bir topluluk gördü de: Bu topluluk kimlerdir? dedi. Oradakilerden biri: Bunlar Kureyş'tir, dedi. O zât bu sefer: Bunların içinde şeyh kimdir? dedi. Abdullah ibn Omer'dir, diye cevâb verdiler. zât: Ey Omer'in oğlu! Ben senden birşey soracağım, onu bana tahdîs et: Uhud günü Usmân (harbe katılmayıp) kaçmıştır, bilir misin? diye sordu. Omer: Evet, diye cevâb verdi. Usmân'ın Bedir gününde kaybolup harbde hazır bulunmadığını bilir misin? dedi. Omer: Evet biliyorum, dedi. kimse: Usmân'ın Rıdvan Bey'atı'nda kaybolup Hudeybiye'de hazır bulunmadığını biliyor musun? dedi. İbn Omer: Evet biliyorum, diye tasdik etti. kimse (sorularına aldığı tasdik cevâblarını fikrine uygun bulup tahsîn ederek): Allâhu Ekber, dedi. üzerine İbn Omer(bu adamın yanlış düşüncelerini düzeltmek üzere): Gel, sana hakikati beyân edeyim: Uhud harbi günü Usmân'ın kaçmasına gelince; ben çok iyi bilir, sana da bildiririm ki, Allah Uhud'da bulunmamak kusurunu afv ve bundan doğan günâhını mağfiret etmiştir. Bedir gazasından kaybolması ise, Usmân'ın nikâhında Rasûlüllah'ın kızı Rukayye vardı. Rukayye Bedir seferi sırasında ağır hasta idi. Rasûlüllah Usmân'a: \"Ey Usmân! Senin için Bedir'de hazır bulunan bir gâzî sevabı ve bir gâzînîn ganimet payı vardır\" buyurup izin vermesi sebebiyledir. Rıdvan Bey'atı'ndan kaybolmasına gelince(Mekke'ye vazîfe ile gönderilmiş olmasındandır). Eğer Mekke vadisinde Usmân'dan ziyâde şeref ve nufüz sahibi bir kimse bulunsaydı, muhakkak Rasûlüllah Usmân'ın yerine onu gönderirdi. Rasûlüllah, Usmân'ı gönderip, o Mekke'ye gittikten sonra Rıdvan Bey'atı yapılmıştı. Usmân'ın bu şerefli bey'attan mahrum olmaması için, Rasûlüllah (sallallahü aleyhi ve sellem) sağ eline işaret ederek: \"İşte bu, Usmân'ın elidir\" buyurup onunla sol eli üzerine vurdu da \"İşte bu Usmân için bey'attır\" buyurdu. ibn Omer, Mısırlı sorucuya(bu açıklamaları verdikten sonra): Sana verdiğim bu cevâblarla beraber, artık şimdi gidebilirsin, dedi",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 3699,
			"arabicnumber": 3699,
			"text": "Saîd'den; o da Katâde'den tahdîs etti ki, Enes (radıyallahü anh) onlara tahdîs edip şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem) beraberinde Ebû Bekr, Omer ve Usmân olduğu hâlde Uhud Dağı'na çıkmıştı. Orada bulundukları sırada dağ deprendi. Peygamber hemen: \"Ey Uhud sakin ol!\" buyurdu. Enes: Zannediyorum ki Peygamber ayağı ile dağa vurdu da: \"Senin üzerinde bir Peygamber, bir sıddîk ve iki şehîdden başkası yoktur\" buyurdu, demiştir",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 3700,
			"arabicnumber": 3700,
			"text": "Amr ibnu Meymûn şöyle demiştir: Ben, Omer ibnu'l- Hattâb'ı vurulmasından birkaç gün önce Medine'de görmüştüm: Huzeyfe ibnu'l-Yemân ile Usmân ibn Huneyf'in yanı başlarında durdu da: Nasıl yaptınız? Irak ahâlîsine takat yetiremeyecekleri harâc yüklemiş olmanızdan korkuyor musunuz? dedi. Biz Irak arazîsine onların tâkat yetirebilecekleri, büyük bir fazlalık olmayan bir vergi yükledik, dediler. Arazîye takat yetiremeyecekleri bir harâc yüklemiş olmanızdan iyi düşünüp sakınınız, dedi. ibn Meymûn dedi ki: Huzeyfe ile İbnu Huneyf: Hayır, biz oraya takatlerinin üstünde vergi yüklemedik, dediler. üzerine Omer: Eğer Allah beni selâmette kılarsa, muhakkak ben Irak ahâlîsinin dullarını benden sonra ebediyyen bir erkeğe muhtâc olmayacakları hâlde bırakacağım, dedi. ibn Meymûn şöyle dedi: Omer'in üzerinden sâdece dördüncü gece geçti. Nihayet dördüncü gecenin sabahında Omer vuruldu. Vurulduğu sabah ben Mescid'de saff içinde dikeliyordum. Benimle Omer arasında Abdullah ibn Abbâs bulunuyordu. Omer'in âdeti iki saff arasından geçerken \"Saffları düzeltiniz\" diye emreder, nihayet safflarda imtizâmsızlık görmeyince mihraba geçer, iftitâh tekbîrini alırdı. Cemâatin toplanması için ekseriya ilk rek'atte Yûsuf Sûresi'ni yahut en-Nahl Sûresi'ni yahut da bunlara benzer uzunlukta bir sûre okurdu. O sabah da bu suretle mihraba geçip tekbîr aldı. Müteakiben ben Omer'in: \"Köpek beni öldürdü (yahut köpek beni yedi)\" dediğini işittim. anda (Ebû Lû'lû Fîrûz denilen mecûsî) bir Acem genci Omer'i hançerlemişti ve elinde iki yüzlü bir hançerle kaçmaya ve geçtiği safflarda sağlı sollu râst geldiği kimseleri vurmaya başlamıştı. Nihayet bu suretle onüç kimseyi hançerledi. Bunlardan yedisi öldü. Bu kanlı vaziyeti gören müslümânlardan birisi borus denilen geniş başlığını cânînin boynuna atıp geçirdi. Kâfir köle yakalandığını anlayınca kendini hançerleyerek intihar etti. yaralanınca Abdurrahmân ibn Avf'ın elinden tutup, onu mihraba geçirdi. ibnu Meymûn şöyle dedi: Omer'e yakın bulunan herkes benim görmekte olduğum bu işi (yânı kölenin Omer'i hançerlemesini) muhakkak görmüştür. Amma mescidin kenarlarında bulunan kimselere gelince onlar birşey bilmiyorlardı. Ancak onlar Omer'in namaz içindeki sesini kaybetmişlerdi. Onlar bundan taaccüb ederek: Subhânallah, Subhânallah, diyorlardı. cemâate hafif bir namaz kıldırdı. Namazdan çıkınca Omer, İbn Abbâs'a: Ey Abbâs oğlu! Git gör bakalım, beni kim vurdu? Dedi. Abbâs bir müddet dolaştıktan sonra geldi ve: Mugîre ibn Şu'be'nin kölesidir, dedi. Şu san'atkâr mı? Dedi. Abbâs: Evet, diye tasdîk etti. Allah onun canını alsın! Ben ona iyilik emretmiştim. Allah'a hamd olsun ki, benim ölümümü müslümânlık iddiasında bulunan bir kimsenin eliyle yaptırmadı! dedi. Omer, İbn Abbâs'a hitaben şunları söyledi: Sen ve baban Abbâs, ikiniz Medine'de kâfir kölelerin çok olmasını arzu ediyordunuz. sahâbîler içinde ençok kölesi olan kimse idi. Bunun üzerine İbn Abbâs, Omer'e: İstersen yaparım, yani eğer istersen Medine'deki köleleri öldürürüz, dedi. İbn Abbâs'a: Yanlış söyledin. Onları sizin dilinizle konuşmaları, sizin kıblenize namaz kılmaları ve haccınızı hacc yapmalarından sonra öldürebilir misin? dedi. ibn Meymûn devamla dedi ki: Sonra Omer kendi evine taşındı. Biz de beraberinde gittik. Durum öyle idi ki, sahâbîlere ve Medîne halkına bundan önce bu derece elem verici bir musibet erişmemişti. Bâzı kimse yaralarında tehlike yoktur diyor, bâzı kimse de ben Omer üzerine korkuyorum diyordu. Yaralar tedaviye başlandığı sırada bir'mikdâr nebîz getirildi. Omer onu içti, fakat hemen karnından dışarı çıktı. Sonra süt getirildi. Omer onu da içti, fakat bu da karnındaki yaradan çıkmaya başladı. Bunun üzerine herkes, Omer'in bu yaralardan öleceğini bildiler. Biz de Omer'in yanına girdik. Artık insanlar takım' takım geldiler de Omer'in iyiliklerini söylüyor, onu övüyorlardı. Bu sırada Omer'in yanına Ensâr'dan genç bir insan geldi de: Ey Müzminlerin Emîri! Allah'ın sana olan lutûf ve insaniyle sevin: Rasûlüllah'la sohbetin ve iyice bilmekte olduğun İslâm'daki kıdemin (bunca yüksek hizmetlerin) vardır. Sonra halîfe oldun, hep adalet ettin. Bu beşerî faziletlerden sonra şehîdlik rütbesi vardır! Dedi. Bu halifelik işinin bana bir kefâf olmasını, yani ne aleyhime ikaabi, ne de lehime sevabı olmasını arzu ettim, dedi. genç arkasını dönüp giderken Omer onun izârının uzunluğundan dolayı yerde sürünüyor olduğunu gördü de: Şu genci bana geri getirin, dedi. O genç gelince, ona: Ey kardeşim oğlu! Elbiseni yerden kaldır. Çünkü bu kaldırma elbisen için daha bekaa verici(yahut daha temiz kılıcı), Rabb'ın için de daha takvâlı olur, dedi. sonra Omer oğluna hitaben şunları söyledi: Ey Omer'in oğlu Abdullah! Üzerimde olan borçlara bak! dedi. hesâb ettiler ve borcunu seksen bin yahut buna yakın buldular. Omer şöyle devam etti: Eğer Omer ailesinin malı bu borca yeterse, borcu onların mallarından öde! Eğer Omer'in malı borca yetmezse Adiyy ibn Ka'b oğulları'ndan mal iste. Eğer onların malları da yetmezse Kureyş kabilesinden mal iste ve onlardan öteye, yani daha başkalarına gitme Bu mallarla benim borcumu öde! Mü'minlerin Anası Âişe'ye git de ona: Omer sana selâm söylüyor, de: \"Mü'minlerin Emîri\" ta'bîrini söyleme. Çünkü ben bu gün Mü'minlerin Emîri değilim. Ve Âişe'ye: Omer ibnu'l-Hattâb iki arkadaşının yanına gömülmek için senden izin istiyor, de! dedi. Omer, Âişe'ye gitti, ona selam verip yanına girmeye izin istedi. Sonra Âişe'nin yanına girdi, onu oturmuş(Omer için) ağlıyor buldu. İbn Omer, Âişe'ye: Omer ibnu'l-Hattâb sana selâm ediyor ve iki arkadaşının beraberinde gömülmesi hususunda izin istiyor, dedi. Ben burayı kendim için düşünüyordum. Fakat bu gün elbette Omer'i nefsime üstün tutarım, dedi. dönüp gelince, Omer'e: İşte Abdullah ibn Omer gelmiştir, denildi. Omer: Beni kaldırın, dedi. kimse Omer'i kendisine dayadı. Omer, Abdullah'a: Yanında ne haber var? diye sordu. Abdullah: Ey Mü'minlerin Emîri, yanımda senin arzu etmekte olduğun şey vardır. Âişe (iki arkadaşınla gömülmene) izin verdi, dedi. el-Hamdü lillâh(Allah'a hamd olsun)! Bu gün benim için dostlarımın yanına gömülmekten başka daha ehemmiyetli hiçbir iş ve arzu yoktur. Ben ölünce cenazemi hücreye taşıyınız. Sonra Âişe'ye teslim ediniz. Sen Âişe'ye: Omer ibnu'l-Hattâb senden izin diler, de. Eğer Âişe benim oraya gömülmem için izin verirse, beni oraya girdiriniz. Şayet Âişe beni reddederse, sizler benim cesedimi müslimânlarm kabirlerine götürüp gömünüz, diye vasiyet etti. sırada mü'minlerin anası Hafsa geldi. Beraberinde birtakım kadınlar yürüyordu. Biz onları görünce kalktık. Hafsa babasının huzuruna girdi ve yanında bir müddet ağladı -bir nüshada: Bir müddet eylendi-. Erkekler Omer'in yanına girme izni istediler. Hafsa da kendi ev halkına âid olan bir yere girdi. Biz o içeri mekândan onun ağlamasını işittik. Gelen erkekler Omer'e: Ey Mü'minlerin Emîri, vasiyet et, yerine birini halef seç de onu bize tavsiye et, dediler. Mü'minlerin bu halifelik işine Rasûlüllah'ın kendilerinden razı olarak vefat ettiği şu neferler yahut şu topluluktan daha lâyık bir kimse bulmuyorum, dedi ve Alî, Usmân, ez-Zubeyr, Talha, Sa'd ibn Ebî Vakkaas, Abdurrahmân ibn Avf diye isimlerini saydı. Omer şunu da söyledi: Abdullah ibn Omer de sizlerle hazır bulunup nezâret eder. Fakat ona bu halifelik işinden hiçbirşey yoktur(yani onun re'y hakkı olmayacaktır). -Omer'in, oğlunun re'y hakkı olmamasından kınlan gönlünü, o şûrada hazır bulunmasını söylemesi- ibn Omer'i teselli hey'etinde olmuştur. devamla: Eğer emirlik Sa'd'a isabet ederse, o bu işin ehli ve yeridir. Îsabet etmezse, sizden hanginiz emîr yapılırsa Sa'd'ın yardımını istesin (ondan istifâde etsin). Çünkü ben Sa'd'ı Küfe Valiliğinden ne aczi, ne de hıyanetinden dolayı ayırdım, dedi. devamla şunları söyledi: Benden sonraki halîfeye ilk Muhâcirler'i tavsiye ederim. Bu ilk Muhacirlerin haklarının tanınmasını ve onlara yapılan hürmetin muhafaza edilmesini tavsiye ederim. Ve yine benden sonraki halîfeye Ensâr'a da hayırlı olmasını tavsiye ederim. O Ensâr ki, Peygamber'in ve Muhâcirler'in Medine'ye gelmelerinden önce Medine'yi yurt ve îmân evi edinmiş olan kimselerdir. İşte onların iyilerinin iyilikleri kabul olunmalı, kötülerinin kötülüğü ve kusurları affedilmelidir. Ben yeni halîfeye bütün memleketler halklarına da hayırla muamele etmesini tavsiye ederim. Çünkü onlar İslâm'ın yardımcılarıdır, mal toplayıcılardır, çoklukları ve kuvvetleriyle düşmanı öfkelendirenlerdir. Onlardan ancak kendi nzâlarıyle mallarının fazlası alınmalıdır. Ve yine ben yeni halîfeye, bedevilere de hayırla muamele etmesini tavsiye ederim. Çünkü bedeviler Arab'ın aslı ve İslâm'ın maddesidirler. Onların mallarının(en iyilerinden değil de) etraf olanlarından alınıp fakirlerine verilmesini tavsiye ederim. Ve yeni halîfeye Allah'ın zimmetini ve Rasûlüllah'ın zimmetini tavsiye ederim: Allah'ın ve Rasûlü'nün ahd ve emâmnda olan(Yahûdî, Hristiyan..) her topluluğun ahd ve emânlarmın yerine getirilmesini tavsiye ederim. Bütün ferdlerin ve grupların hakları verilmeli, vazifeleri ve işleri görülmelidir. Onlara bir düşman saldırdığında, onların arkalarından ve önlerinden müdâfaa edilmeleri için harb yapılmalı ve kendileri ancak takat yetirecekleri cizye vergisi ile mükellef kılınmalıdırlar. şöyle devam etti:) Omer vefat edince, onu evinden çıkardık(onun namazını Suheyb kıldırdı). Sonra yürüyerekonu Âişe'nin hücresine getirdik. Abdullah selâm verdikten sonra Âişe'ye: Omer ibnu'l-Hattâb senden izin ister, dedi. Âişe: Onu içeriye girdiriniz, dedi. hücrenin içine girdirildi ve orada iki arkadaşının yanında kabrine konuldu. gömülmesi işi bitirilince, o şûra hey'eti toplandı. Bu toplantıda Abdurrahmân ibn Avf, ihtilâfı azaltacak ve seçimi kolaylaştıracak şu amelî teklifi söyledi: Seçmedeki re'yinizi kendinizden gönül hoşluğu ile üç kişiye veriniz! dedi. teklif üzerine ez-Zubeyr: Ben seçim işimi, yani re'yimi Alî'ye tahsis ettim, dedi. Talha da: Ben seçim işimi Usmân'a tahsis ettim, dedi. Sa'd ibn Ebî Vakkaas: Ben seçim işimi Abdurrahmân ibnAvf'a tahsis ettim, dedi. Bunun üzerine Abdurrahmân, Alî ile Usmân'a da: Arkadaşlar, hanginiz devlet başkanlığı adaylığından feragat ederse bu seçim işiyle meşgul olmayı ona verelim. Allah ve müslümânlar ona murâkıb ve şâhiddir. Onlar işin kendisinde(yahut kendi i'tikaadında) bu işe kimin daha elverişli olduğunu şübhesiz daha iyi görür ve bilirler, dedi. ile Usmân sükût ettiler. Bunun üzerine Abdurrahmân iki arkadaşına: Öyleyse bu seçim işiyle uğraşmayı bana havale ediyor musunuz? (Çünkü ben size rekaabet edecek değilim.) Allah üzerimde şâhiddir ki, ben sizin efdalinizi seçmekte kısaltma, yâni eksiklik yapmayacağım (adaletten ayrılmayacağım), dedi. da: Evet (bu seçim işini sana havale ediyoruz), dediler. (Abdurrahmân üç gün üç gece uyku bile uyumaksızın bütün halk tabakalarıyle temas ederek umûmî arzuyu anladı.) Bunun üzerine son akdedilen toplantıda Alî'nin elini tutarak: Yâ Alî, kat'î bilirsin ki, senin Rasülullah'a hısımlığın ve islâm'da kıdemin vardır. Allah, üzerinde murâkıbdır. Yemîn olsun eğer ben seni emîr seçersem, İslâm ümmeti üzerinde muhakkak adalet edersin. Yine yemîn ederim ki, eğer Usmân'ı seçersem, muhakkak sen onun da sözlerini dinler ve elbette emirlerine itaat edersin, dedi. Abdurrahmân ibn Avf, diğerine yani Usmân'a dönerek, Alî'ye söylediğinin benzerini ona da söyledi. Abdurrahmân onların her ikisinden de bu suretle mîsâk (yani çok sağlam söz ve ahd) aldıktan sonra, Usmân'a: Yâ Usman elini kaldır! Dedi ve Usmân'a bey'at etti. de Usmân'a bey'at etti.(Sonra kapılar açıldı.) Medîne ahâlîsi de girdiler ve Usmân'a bey'at ettiler",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 3701,
			"arabicnumber": 3701,
			"text": "Bize Abdulazîz, Ebû Hâzım'dan; o da Sehl ibn Sa'd (radıyallahü anh)'dan tahdîs etti ki, Rasûlüllah (sallallahü aleyhi ve sellem) Hayber günü: \"Bayrağı yarın bir kişiye vereceğim ki, Allah fethi onun iki eliyle müyesser kılacaktır\" buyurmuştur. dedi ki: Bunun üzerine orada bulunan sahâbîler o gecelerini bayrağın onlardan hangisine verileceği hayâline dalıp huzursuzlukla geçirdiler. İnsanlar sabaha girince Rasûlüllah'ın huzuruna gittiler. Hepsi bayrağın kendisine verilmesini umuyorlardı. Fakat Rasûlüllah: \"Alî ibn Ebî Tâlib nerededir?\" diye sordu. Sahâbîler: Yâ Rasûlallah, onun iki gözü ağrıyor, dediler. Rasûlüllah: \"Ona haber gönderin de onu bana getirin\" buyurdu. gelince, Rasûlüllah onun gözlerine tükürdü ve ona şifâ duası yaptı. Akabinde Alî'nin gözleri iyileşti, hattâ onda hiçbir ağrı yokmuş gibi oldu. Hemen bayrağı Alî'ye verdi. Bunun üzerine Alî: Yâ Rasûlallah, Hayber Yahûdîleri ile onlar da bizim gibi (müslümân) oluncaya kadar vuruşacak mıyım? dedi. \"Tâ Hayberliler'in sahasına ininceye kadar hey'etin üzere sükûnetle yürü. Sonra onları İslâm'a girmeye da'vet et. Ve onlara İslâm'da üzerlerine vâcib olacak Allah haklarını haber ver. Allah'a yemin ederim ki, senin sayende Allah'ın bir tek kişiye hidâyet vermesi senin lehine, senin kırmızı develerin olmasından daha hayırlıdır\" buyurdu",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 3702,
			"arabicnumber": 3702,
			"text": "Selemetu'bnu’l-Ekva' (radıyallahü anh) şöyle demiştir: Alî, Hayber'de gözünde rahatsızlık olduğu için Peygamber'den geride kalmış idi. Alî kendi kendine: Ben göz rahatsızlığı sebebiyle Rasûlüllah'tan geriye kalır mıyım? Diyerek dışarı çıktı ve Peygamber'e yetişti. Allah'ın, sabahında fetih ihsan ettiği gecenin akşamı olunca, Rasûlüllah (sallallahü aleyhi ve sellem): \"Yemîn olsun, İslâm bayrağını yarın muhakkak bir kimseye vereceğim ki (yahut yarın bayrağı bir adam alacak ki), Allah ve Resûlü onu sever yahut o kimse Allah'ı ve Rasûlü'nü sever. Allah ona fetih ihsan edecektir\" buyurdu. gün Alî ile karşılaştık. Halbuki biz, göz rahatsızlığından dolayı onun gelmesini ummuyorduk. Sahâbîler: İşte Alî geldi, dediler. bayrağı ona verdi. Allah Hayber'in fethini ona müyesser kıldı",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 3703,
			"arabicnumber": 3703,
			"text": "Ebû Hazım Seleme ibn Dînâr'dan ( o şöyle demiştir): kimse Sehl ibn Sa'd(radıyallahü anh)'a geldi de: Medîne Emîri şu Fulân kişi minber yanında Alî'yi razı olunmayan birşeyle zikrediyor, dedi. Ebû Hazım dedi ki: Sehl: Bu emîr Alî için ne söyledi? der. Râvî Ebû Hazım dedi ki: Emîr, Alî'ye Ebû Turâb diyor, deyince Sehl ibn Sa'd güldü de: Vallahi bu lakabı Alî'ye muhakkak Peygamber isim yapmıştır ve Alî'ye bundan daha sevgili bir isim de olmamıştır, dedi. Hazım dedi ki: Ben(bu unvanı Peygamber'in Alî'ye nasıl verdiğini öğrenerek) lezzet almak istedim de, Sehl ibn Sa'd'a bu hadîsi sordum ve: Yâ Ebâ Abbâs, bu isim verme işi nasıl oldu? dedim. da şöyle anlattı: Bir kerre Alî, Fâtıma'nın yanına girmiş, sonra bir şeyden Fâtıma'ya darılarak dışarı çıkmış ve Mescid'de yatmıştı. Bu sırada Fâtıma'nın yanına Peygamber gelip: \"Amcan oğlu nerede?\" diye sorduğunda Fâtıma: Mescid'dedir, dedi. Bunun üzerine Peygamber Mescid'e çıktı ve Alî'yi, sırtından ridâsı düşmüş, sırtına toprak bulaşmış bir hâlde yatıyor buldu. Bunun üzerine Peygamber (sallallahü aleyhi ve sellem), Alî'nin sırtından topraklan eliyle silkmeye başladı ve iki kerre: \"Otur yâ Ebâ Turâb! Otur yâ Ebâ Turâb!\" buyuruyordu",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 3704,
			"arabicnumber": 3704,
			"text": "Sa'd ibnu Ubeyde şöyle demiştir: İbn Omer'in yanına bir adam(yani Nâfi' ibnu'l-Ezrak) geldi de, ona Usmân'dan sordu. İbn Omer, Usmân'ın güzel amellerinden zikretti de o kimseye: Belki Usmân'ın işlerinden sana zikrettiğim şeyler, sana kötü geliyordur, dedi. kimse: Evet kötü geliyor, dedi. İbn Omer: Allah senin burnunu topraklandırıp horlasın, dedi. Sonra o kimse İbn Omer'e Alî'den sordu. ibn Omer, Alî'nin güzel amellerini zikretti de: Alî budur, evi de Peygamber'in evlerinin en güzelidir(yahut ortasındadır), dedi. yine:. Belki benim Alî'den söylediğim şeyler sana kötü geliyordur, dedi. adam: Evet (kötü geliyor), dedi. Bunun üzerine İbn Omer ona: Allah senin burnunu toprağa sürtüp horlasın. Git de benim hakkımda neye gücün yeterse yap! Dedi",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 3705,
			"arabicnumber": 3705,
			"text": "Bize Şu'be, el-Hakem'den tahdîs etti ki, o şöyle demiştir: İbnu Ebî Leylâ'dan işittim, şöyle dedi: Bize Alî şöyle tahdîs etti: Fâtıma aleyhi's-selâm değirmen taşı çevirmenin te'sirinden elinde meydana gelen rahatsızlıktan şikâyet etti. O sırada Peygamber'e birtakım esirler gelmişti. O esirlerden bir hizmetçi istemek üzere Peygamber'in evine gitti, fakat Peygamber'i evde bulamadı; Âişe'yi buldu ve ona ne için geldiğini haber verdi. Peygamber geldiğinde Âişe, Fâtıma'nın gelişini Peygamber'e haber verdi. dedi ki: Bunun üzerine Peygamber bize geldi ve bizi yataklarımıza girmiş hâlde buldu. Ben hemen ayağa kalkmaya davrandım. Peygamber derhâl: \"Yerinizde durunuz\" buyurdu ve ikimizin arasına oturdu; hattâ ben göğsüm üstüne dokunan iki ayağının serinliğini hissettim. Peygamber (sallallahü aleyhi ve sellem): \"İyi dinleyiniz! Ben size, sizin benden istediğiniz esîr hizmetçiden daha hayırlı birşey öğreteceğim: Siz (geceleyin) yatağınıza girdiğinizde otuzdört defa Allâhu Ekber; otuzüç kerre Subhânallah dersiniz. Otuz üç kerre de el-Hamdülillah dersiniz. İşte bunları söylemeniz sizlere hizmetçiden hayırlıdır\" buyurdu",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 3706,
			"arabicnumber": 3706,
			"text": "Sa'd ibn Ebî Vakkaas (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem), hitaben: \"Senin bana bağlılığın, Harun'un Musa'ya bağlılığı derecesinde olmandan razı olmuyor musun?\" buyurdu",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 3707,
			"arabicnumber": 3707,
			"text": "Bize Şu'be, Eyyûb es-Sahtıyânî'den; o da Ibn Sîrîn'den; o da Abîde es-Selmânî'den haber verdi ki, Alî (radıyallahü anh) Irak ahâlîsine: Bundan evvel hüküm veregeldiğiniz gibi hüküm veriniz. Çünkü ben (Ebû Bekr ve Ümer, üzerinde çekişme ve fitneye götürücü) ihtilâfı çirkin görüyorum. Tâ ki, insanların bir cemâati olsun yahut da ben arkadaşlarımın öldüğü gibi ölürüm, demiştir. ibn Sîrîn(Râfızîler tarafından) Alî üzerine rivayet edilen (Şeyhayn'e muhalefet) haberlerinin çoğunu yalandan ibaret görür idi",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 3708,
			"arabicnumber": 3708,
			"text": "Ebû Hureyre (radıyallahü anh)'den(şöyle demiştir): İnsanlar: Ebû Hureyre çok(hadîs rivayet) ediyor, deyip duruyorlar. Halbuki ben, karnımın doyması mukaabilinde boğaz tokluğuna Rasûlüllah'tan hiç ayrılmaz idim. Hattâ ben mayalı (yahut katıklık) ekmek yemez, yeni ve güzel elbise giymezdim. Bana hiçbir erkek ve hiçbir kadın da hizmet etmezdi. Ben(bazen) açlıktan karnıma taş bağlardım. Şu muhakkak ki, ben (bazen) yanımda yânı ezberimde bulunan âyetleri bir kimseye -o beni evine götürsün de beni doyursun diye, sırf bu maksadla- okutmak isterdim. Fakirler için insanların en hayırlısı Ca'fer ibn Ebî Tâlib idi. O bizleri evine götürürdü ve evinde bulunan şeyleri bize yedirir idi. Hattâ şu da muhakkak ki, o bize bazen içinde hiçbirşey bulunmayan yağ tulumunu çıkarır idi de, biz de onu yarar ve etrafında bulunan yağ kırıntılarını yalar idik",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 3709,
			"arabicnumber": 3709,
			"text": "eş-Şa'bî_şöyle demiştir: İbn Omer (radıyallahü anh), Abdullah ibn Ca'fer'e selâm verdiği zaman: es-Selâmu aleyke ey iki kanatlı adamın oğlu! der idi. Abdillah el-Buhârî:(ibn Omer'in sözündeki) \"İki kanat\", iki tarafın hepsidir, demiştir",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 3710,
			"arabicnumber": 3710,
			"text": "Enes (radıyallahü anh)'ten(o, şöyle demiştir): Halk kıtlığa uğradıklarında Omer ibnu'l-Hattâb, Abbâs ibnu Abdümuttalib ile (tevessül ederek) yağmur duası yapar ve: \"Yâ Allah, bizler(hayâtta iken) Peygamberimiz ile tevessül ederek senden niyazda bulunurduk da sen bize yağmur ihsan ederdin. Bizler (şimdi de) Peygamberimizin amcası ile tevessül ederek senden niyaz ediyoruz; bize (yine) yağmur ihsan et!\" diye duâ ederdi. Bu duayı edince insanlara yağmur verilirdi, demiştir",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 3712,
			"arabicnumber": 3712,
			"text": "",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 3713,
			"arabicnumber": 3713,
			"text": "İbnu Ebî Muleyke'den: O da el-Mısver ibn Mahrame (radıyallahü anh)'den: Rasûlüllah(sallallahü aleyhi ve sellem): \"Fâtıma benden bir parçadır. Her kim onu öfkelendirirse, şübhesiz beni öfkelendirmiş olur\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 3714,
			"arabicnumber": 3714,
			"text": "",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 3716,
			"arabicnumber": 3716,
			"text": "",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 3717,
			"arabicnumber": 3717,
			"text": "Urve ibnu'z-Zubeyr şöyle demiştir: Bana Mervân ibnu'l-Hakem haber verip şöyle dedi: Usmân ibn Affân'a ruâf hastalığı senesinde (otuzbirinci hicret yılında) salgın hâlinde hüküm süren bir ruâf hastalığı isabet etti ve hattâ bu hastalık, Usmân'ı hacc etmekten men' etmişti. Usmân da ölüm endişesiyle vasiyet etmeye başlamıştı. Usmân'ın yanına Kureyş'ten bir adam girdi de: Yerine bir halîfe ta'yin et, dedi. Herkes bunu söyledi, dedi. O kimse de: Evet, öyle söylüyorlar, diye te'yîd etti. Kimin halef yapılmasını söylüyorlar? diye sorunca, o kimse sükût etti. Mervân dedi ki: Usmân'ın yanına başka bir adam daha girmisti. O kimsenin (kardeşim) el-Hâris olduğunu zannediyorum. O da Usmân'a: Yerine bir halef göster, dedi. Usmân yine: Herkes bunu söyledi, dedi. O zât da: Evet öyle söylüyorlar, diye Usmân'ı te'yîd etti. Usmân yine: Kimin halef yapılmasını söylüyorlar? diye sorunca, o da sükût etti. defa Üsmân kendisi: Belki insanlar ez-Zubeyr'i söylemişlerdir, dedi. Haris Evet, diye tasdîk etti.Usmân: Dikkat edin! Nefsim elinde bulunan Allah'a yemîn ederim ki, şübhesiz ez-Zubeyr, benim faziletli olduklarını bildiğim kimselerin en hayırlısıdır. Ve yine şübhesiz o, Rasûlüllah'a, onların en sevimli olanıdır, dedi",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 3718,
			"arabicnumber": 3718,
			"text": "Hişâm şöyle demiştir: Bana babam Urvetu'bnu'z-Zubeyr haber verip şöyle dedi: Ben Mervân ibnu'l-Hakem'den işittim (şöyle diyordu): Ben Usmân'ın yanında idim. Ona bir adam geldi de: Yerine bir halef göster, dedi. Usmân: Bu söylendi mi? diye sordu. O zât: Evet, halef olması söylenen kimse ez-Zubeyr'dir, dedi. Usmân üç kerre: Dikkat edin! Allah'a yemîn ederim ki, muhakkak sizler, ez-Zubeyr'in en hayırlınız olduğunu bilmektesinizdir, dedi",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 3719,
			"arabicnumber": 3719,
			"text": "Câbir (radıyallahü anh): Peygamber (sallallahü aleyhi ve sellem): \"Şübhesiz her peygamberin havarisi vardır. Ve şübhesiz benim havarim de ez-Zubeyr ibnu'l-Avvâm'dır\" buyurdu, demiştir",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 3720,
			"arabicnumber": 3720,
			"text": "Abdullah ibnu'z-Zubeyr (radıyallahü anh) şöyle demiştir: Ahzâb günü ben, Ebû Seleme'nin oğlu Omer ile beraber(çocuk olduğumuzdan) kadınların yanında bırakıldım. Bir de baktım ki, babam ez-Zubeyr, atının üstünde iki yahut üç kerre Kurayza oğulları'na gidip geliyor. Ben evimize dönüp geldiğimde babama: Ey babacığım! Ben seni Kurayza oğulları yurduna gidip gelirken gördüm, dedim. Ey oğulcuğum! Sen beni öyle gördün mü? dedi. de: Evet, dedim. Babam(bu hareketinin sebebini bildirmek için) dedi ki: Rasûlüllah (sallallahü aleyhi ve sellem):\"Kurayza oğulları'na kim gider de onların haberlerini bana getirir?\" dedi. Ben de (icabet edip) gittim. Gelince Rasûlüllah bana babasıyle anasını bir arada zikrederek: \"Zubeyr! Babam anam sana feda olsun!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 3721,
			"arabicnumber": 3721,
			"text": "Bize Hişâm ibn Urve, babası Urve'den haber verdi (o, şöyle demiştir): Yermuk vak'ası gününde Peygamber'in sahâbîleri, Zubeyr'e hitaben: Ey Zubeyr! Rumlar'a şiddetli bir saldırı yapmaz mısın ki, biz de seninle beraber şiddetli bir saldırı yapalım? Dediler. ez-Zubeyr, Rûmlar üzerine amansız hamleler yaptı. Rumlar bu hamle sırasında Zubeyr'in omuz kökü üzerine iki darbe vurdular. Bu iki geniş yara arasında Bedir harbinde yediği bir darbenin çukurluğu vardı. Ben çocukken bu üç darbenin yerlerine parmaklarımı sokar, oynardım, demiştir",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 3722,
			"arabicnumber": 3722,
			"text": "",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 3724,
			"arabicnumber": 3724,
			"text": "",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 3725,
			"arabicnumber": 3725,
			"text": "",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 3726,
			"arabicnumber": 3726,
			"text": "",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 3727,
			"arabicnumber": 3727,
			"text": "",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 3728,
			"arabicnumber": 3728,
			"text": "Kays ibn Ebî Hazım şöyle demiştir: Ben Sa'd ibn Ebî Vakkaas (radıyallahü anh)'tan işittim, şöyle diyordu: Ben Allah yolunda ok atmış olan Arab mücâhidlerinin muhakkak birincisiyim. Ve biz Peygamber'in beraberinde gaza ediyorduk. Yanımızda bizim ağaç yaprağından başka yiyecek birşeyimiz de yoktu. Hattâ bizlerden herbirimiz, hacetini yaparken, muhakkak devenin yahut koyunun çıkardığı gibi kuru dışkı çıkarırdı, bu dışkı katılığından dolayı birbirine karışmazdı. (İslâm'a yaptığımız bunca hizmetlerden sonra Esed oğulları İslâm (esâsları ve ibâdeti) üzerinde bizi ayıplar oldular. Yemîn olsun ben onların iddia ettikleri gibi namazı güzel kıldıramıyorsam, o takdîrde ben onların öğretmesine muhtâc olurum ve bunca amelim de boşa gitmiş olur! dedi ki:) Esed oğulları (Sa'd Irak'ta vâlî iken Halîfe Omer'e) Sa'd aleyhine gammazlık etmişlerdi de: Sa'd namazı güzel kıldırmıyor, demişlerdi",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 3729,
			"arabicnumber": 3729,
			"text": "ez-Zuhrî şöyle demiştir: Bana Alî ibn Hüseyin tahdîs etti ki, el-Mısver ibn Mahrame (radıyallahü anh) şöyle demiştir: Alî bir ara Ebû Cehl'in kızı ile nişanlanmak istedi. Alî'nin bu arzusunu Fâtıma işitti ve akabinde Rasûlüllah'a geldi ve: Kavmin senin kızların için öfkelenmez olduğunu söylüyorlar. Bak işte Alî, Ebû Cehl'in kızını nikâh edecek! Dedi. üzerine Rasûlüllah kalktı (bir hutbe yaptı). Mısver dedi ki: Ben Rasûlüllah'tan bu hutbesinde şehâdet getirdikten sonra şöyle derken işittim: \"Amma ba'du (- Sözün bundan sonrasına gelince): Şübhesiz ben (kızım Zeyneb'i) Ebû'l-Âs ibn Rabî'a nikâh ettim. O bana söz verdi ve bana karşı verdiği sözde doğru hareket etti. Şübhesiz Fâtıma bendendir parçadır. Muhakkak ki, ben ona fenalık yapılmasını çirkin görürüm. Vallahi Allah Rasûlü'nün kızı, Allah düşmanının kızı ile bir erkeğin yanında bir araya gelmez\". dedi ki:) Bunun üzerine Alî, Ebû Cehl'in kızı ile evlenmeyi bıraktı. ibn Amr ibn Halhala şunu ziyâde etti: ibn Şihâb'dan; o da Alî'den; o da Misver'den; o şöyle demiştir: Ben Peygamber'den işittim; Abdu Şems oğullârı'ndan bir damadını (Ebû’l-Âs'ı) zikretti ve onu dâmâdlığı hususunda çok güzel övdü: \"O bana söz verdi, sözünde gerçek çıktı ve bana verdiği va'di yerine getirdi\"buyurdu",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 3730,
			"arabicnumber": 3730,
			"text": "Abdullah ibn Omer (radıyallahü anh) şöyle demiştir: Peygamber, bir fırka mücâhid hazırladı da başlarına Usâme ibn Zeyd'i emîr (yani kumandan) ta'yîn edip sefere gönderdi. Bâzı kimseler Usâme'nin emîrliği hakkında i'tirâz ve dedikodu ettiler. Bunun üzerine Peygamber \"Siz şimdi Usâme'nin kumandanlığını kötülüyorsunuz. Siz bundan önce onun babasının kumandanlığı hususunda da kötüleme yapmıştınız. Allah hakkı için Zeyd kumandanlığa nasıl tamâmiyle lâyıksa ve o, bana insanların en sevimlilerinden biriyse, hiç şübhesiz şu Usâme de babasından sonra bana insanların en sevimlilerindendir\" buyurdu",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 3731,
			"arabicnumber": 3731,
			"text": "Âişe (r.anha) şöyle demiştir: Bir kerre Peygamber (sallallahü aleyhi ve sellem) benim yanımda bulunurken bir izci gelmişti. O sırada Usâme ibn Zeyd ile Zeyd ibn Harise yan üstü yatmışlardı. O izci onların ayaklarına baktı da: Şübhesiz şu ayakların bâzısı bâzısından olmuştur! Dedi. dedi ki: İzcinin bu sözü ile Peygamber sevindi ve bu söz kendisini hayrete düşürdü de bunu Âişe'ye haber verdi",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 3732,
			"arabicnumber": 3732,
			"text": "Bize Leys, ez-Zuhrî'den; o da Âişe (r.anha)'den tahdîs etti (ki, o şöyle demiştir); Mahzûm oğulları'na mensûb bir kadının işi Kureyş'e keder verdi de: (Bu kadının şefaat edilmesi için) Rasûlüllah'ın huzurunda, Rasûlüllah'ın sevgilisi olan Usâme'den başka kimse konuşmaya cesaret edemez, dediler",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 3733,
			"arabicnumber": 3733,
			"text": "Ve bize Alî (ibn Abdillah el-Medînî) tahdîs etti. Bize Sufyân ibn Uyeyne tahdîs edip şöyle dedi: Ben o Mahzûmlu kadının hadîsini sormak üzere ez-Zuhrî'ye gittim. O bana bağırdı. dedi ki: Ben Sufyân'a: Sen bu hadîsi başka hiçbir kimseden alıp yüklenmedin dedim. Ben bu hadîsi, Eyyûb ibn Musa'nın ez-Zuhrî'den; o da Urve'den; o da Âişe (r.anha)'den senediyle yazdığı bir kitâbda buldum. Âişe şöyle demiştir: Mahzûmoğulları'nda(Fâtıma adlı) bir kadın hırsızlık yapmıştı. Kureyş: Bu kadının affı hakkında Peygamber'le kim konuşabilir? Dediler. hiç kimse Peygamber'e söylemeye cesaret edemedi. Nihayet Usâme ibn Zeyd Peygamber'e söyledi. Bunun üzerine Peygamber(sallallahü aleyhi ve sellem): \"İsrâîl oğulları, kendi aralarında şerefli, nufûz sahibi büyük kişiler hırsızlık yaparsa onları bırakırlardı da, içlerindeki zayıf kimseler hırsızlık yaparsa onların elini keserlerdi. Eğer (kızım) Fâtıma çalmış olsaydı, muhakkak onun elini de keserdim!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 3734,
			"arabicnumber": 3734,
			"text": "Abdullah ibn Dînâr haber verip şöyle demiştir: Bir gün Abdullah ibn Omer mescidde iken, mescidin bir tarafında (siyah.renkli) birisinin ihramını sürüyerek gezdiğini gördü de, İbn Dînâr'a: Şuna bak, kimdir? Keski bu kimse yanımda bulunsaydı (da ona öğüt verseydim)! dedi. üzerine orada bulunan bir insan İbn Omer'e: Yâ Ebâ Abdirrahmân, bunu tanımıyor musun? Bu, Usâme ibn Zeyd'in oğlu Muhammed'dir, dedi. İbn Dînâr dedi ki: Bunun üzerine İbn Omer bir müddet başını önüne eğdi ve elleriyle yeri karıştırdı. Sonra: Eğer Rasûlüllah bu Muhammed'i görseydi, muhakkak onu severdi, dedi",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 3735,
			"arabicnumber": 3735,
			"text": "Bize Ebû Usmân Abdurrahmân en-Nehdî, Usâme ibn Zeyd (radıyallahü anh)'den tahdîs etti; o da Peygamber (sallallahü aleyhi ve sellem)'in onu, yani Usâme'yi ve Alî'nin oğlu Hasen'i kucağına alarak: \"Yâ Allah! Sen bunları sev! Çünkü ben bunları seviyorum\" duasını söyler olduğunu tahdîs etmiştir",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 3736,
			"arabicnumber": 3736,
			"text": "Ve Nuaym ibn Hammâd, İbnu’l-Mubârek'ten söyledi; o şöyle demiştir: Bize Ma'mer ibn Râşid, ez-Zuhrî'den haber verdi (o, şöyle demiştir): Bana Usâme ibn Zeyd'in bir kölesi şöyle haber verdi: Ümmü Eymen'in oğlu olan Eymen'in oğlu Haccâc -Ümmü Eymen'in oğlu ve Haccâc'ın babası olan Eymen, Usâme ibn Zeyd'in ana-bir kardeşi idi ve bu Eymen, Ensâr'dan bir zâttır-(Mescide girip namaz kıldı). İbn Omer onun rukû'unu ve sucûdunu tamamlamadığını gördü de: Namazını yeniden kıl, dedi",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 3737,
			"arabicnumber": 3737,
			"text": "Ebû Abdillah el-Buhârî dedi ki: Ve bana Süleyman ibn Abdirrahmân tahdîs etti: Bana el-Velîd ibn Müslim tahdîs etti: Bize Abdurrahmân ibn Nemr, ez-Zuhrî'den tahdîs etti: Bize Usâme ibn Zeyd'in âzâdlısı Harmele tahdîs etti ki, kendisi İbn Omer'le birlikte bulunduğu sırada mescide el-Haccâc ibn Eymen girip namaz kılmış. Fikat el-Haccâc, rukû'unu ve sucûdunu tam yapmamış. üzerine İbn Omer ona: Namazını tekrar kıl! Diye emretmiştir. el-Haccâc dönüp giderken, İbn Omer bana: Yâ Harmele! Bu namaz kılan kimdir? dedi. Ben de ona: Ümmü Eymen'in oğlu olan Eymen'in oğlu el-Haccâc'dır, dedim. üzerine İbn Omer: Eğer Rasûlüllah bu sîmâyı görseydi (Eymen'i ve anasını sevdiği için) muhakkak onu da severdi, dedi ve Peygamber'in Usâme'ye olan sevgisini ve Ümmü Eymen'in doğurduğu erkek ve kız çocuklarım zikretti. dedi ki: Ve bana arkadaşlarımdan bâzısı (Ya'kûb ibn Süleyman yahut ez-Zuhlî), Süleyman ibn Abdirrahmân'dan: Ümmü Eymen, Peygamber'in dadısı(ikinci anası, mürebbîyesi) idi, diye tahdîs etti",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 3739,
			"arabicnumber": 3739,
			"text": "",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 3740,
			"arabicnumber": 3740,
			"text": "",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 3742,
			"arabicnumber": 3742,
			"text": "",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 3743,
			"arabicnumber": 3743,
			"text": "İbrâhîm en-Nahâî şöyle demiştir: Alkame Şam'a gitti. Şâm mescidine girince: Yâ Allah! Bana iyi bir meclis arkadaşı müyesser kıl! Diye duâ etti. Ebu'd-Derdâ'nın yanına oturdu. Ebu'd-Derdâ ona: Sen kimlerdensin? diye sordu. Alkame: Küfe ahâlîsindenim, dedi. Ebu'd-Derdâ, Ebû Huzeyfe'yi kasdederek: Kendisinden başka kimsenin bilmez olduğu o sırrın (gizli haberlerin) sahibi sizin içinizde yahut sizden değil mi? dedi. dedi ki: Ben: Evet, (Küfe'de, aramızdadır), dedim. Ebû'd-Derdâ: Peygamberinin dili ile (yani O'nun duası üzerine) Allah'ın kurtardığı kimse(Ammar'ın şeytândan kurtarılmasını kasdediyor) sizin içinizde yahut sizden değil mi? dedi. Evet (bizdedir), dedim. Ebu'd-Derdâ: Peygamberin o misvakını veya sırârını (yani sırrını) taşıyan kimse sizin içinizde veya sizden değil mi? dedi. Evet bizdedir, dedim. Ebu'd-Derdâ: Abdullah ibn Mes'ûd \"Ve'l-leyli izâ yağşâ ve'n-nehâri izâ tecellâ\" âyetinden sonrasını nasıl okuyordu? dedi. \"Ve'z-zekeri vel-ünsâ\" diye okuyor, dedim. Ebu'd-Derdâ: Şu Şamlılar bana karşı \"ve mâ halaka'z-zekerâ vel-ünsâ\" kıraatinde ısrar ediyorlar da, en sonu beni Rasûlüllah'tan işittiğim kıraatten caydırmak istiyorlar! dedi",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 3744,
			"arabicnumber": 3744,
			"text": "Ebû Kılâbe şöyle demiştir: Bana Enes ibn Mâlik(radıyallahü anh) tahdîs etti ki, Rasûlüllah (sallallahü aleyhi ve sellem): \"Her peygamber ümmetinin güvendiği emin bir kimsesi vardır. Ey Muhammed Ümmeti, bizim eminimiz de hâsseten Ebû Ubeyde ibnu'l-Cerrâh'tır\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 3745,
			"arabicnumber": 3745,
			"text": "Huzeyfe ibnu'l-Yemân (radıyallahü anh) şöyle demiştir: Necrân hey'eti Peygamber'den kendilerine emîn bir zâtın emîr gönderilmesini istediklerinde, Peygamber(sallallahü aleyhi ve sellem) onlara: \"Sizin üzerinize muhakkak emîn bir kimse göndereceğim ki, o şübhesiz hakkıyle güvenilir bir kimsedir\" buyurdu. sözü üzerine sahâbîleri, bu emînlik ve emirliğe rağbet ederek herbiri kendisinin gönderilmesini gözetlediler. Bu sırada Peygamber, Ebû Ubeyde(radıyallahü anh)'yi gönderdi",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 3746,
			"arabicnumber": 3746,
			"text": "Bize Ebû Mûsâ (İsrâîl ibn Mûsâ), el-Hasen el-Basrî'den tahdîs etti; O, Ebû Bekre (radıyallahü anh)'den isitmiştir (o, şöyle demiştir): Ben Peygamber (sallallahü aleyhi ve sellem)'den işittim. O, minber üzerinde torunu Hasen de yanıbaşında olduğu hâlde, bir kerre insanlara(yani cemâate), bir kerre de Hasen'e bakıyor ve onlara: \"Bu benim oğlumdur, şeref sahibi bir efendidir. Allah'ın bu oğlum sebebiyle müslümânlardan iki fırkanın arasını iyileştirmesi umulur\" buyuruyordu",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 3747,
			"arabicnumber": 3747,
			"text": "Usâme ibn Zeyd (radıyallahü anh)'den: Peygamber (sallallahü aleyhi ve sellem): Usâme'yi Hasen (ibn Alî) ile beraber kucağına alırdı da: \"Yâ Allah, ben bunları seviyorum, sen de bunları sev\" buyururdu. Râvî: Yâhud buna benzer bir söz söyledi, demiştir",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 3748,
			"arabicnumber": 3748,
			"text": "Enes ibn Mâlik (radıyallahü anh)'ten(o, şöyle demiştir): Hüseyin ibn Alî aleyhi's-selâm Kerbelâ'da şehîd edildikten sonra, başı Kûfe'ye getirildi. Ve o sırada Yezîd ibn Muâviye'nin Küfe Vâlîsi bulunan Abdullah ibn Ziyâd'ın karşısında bir taş içine konuldu. Bu İbn Ziyâd, elindeki süngüsüyle mübarek başın burnuna, gözlerine vurmağa başladı... rivayetine devamla dedi ki: Ziyâd bu Hüseyin'in güzelliği hakkında bir söz söyledi. Bunun üzerine Enes: Hüseyin, Ehli Beyt içinde Rasûlüllah'a en çok benzeyeni idi, demiştir. O sırada Hüseyin'in başı vesme bitkisi ile boyalı idi",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 3749,
			"arabicnumber": 3749,
			"text": "Adiyy (ibn Sabit el-Ensârî) haber verip şöyle demiştir: el-Berâ ibn Âzib(radıyallahü anh)'den işittim, şöyle dedi: BenPeygamber (sallallahü aleyhi ve sellem)'i gördüm ki, O, Hasen ibn Alî'yi omuzu üzerine almış da: \"Yâ Allah! Ben bunu seviyorum, bunu sen de sev!\" buyuruyordu",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 3750,
			"arabicnumber": 3750,
			"text": "Ukbe ibnu’l-Hâris (radıyallahü anh) şöyle demiştir: Ben Ebû Bekr (radıyallahü anh)'i şu hâlde gördüm: Kendisi Alî'nin oğlu Hasen'i yüklenmiş de: Peygamber'e benzeyen, Alî'ye benzemeyen (yavru), babam sana feda olsun! diyordu. Bu sırada Alî de yanında gülüyordu",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 3751,
			"arabicnumber": 3751,
			"text": "ibn Omer (radıyallahü anh): Ebû Bekr: Ey insanlar! Muhammed'e hürmetinizi, onun ev halkı hususunda da gözetip muhafaza ediniz! Dedi, demiştir",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 3752,
			"arabicnumber": 3752,
			"text": "Enes ibn Mâlik (radıyallahü anh): Hiçbir kimsePeygamber (sallallahü aleyhi ve sellem)'e, Hasen ibn Alî kadar çok benzer değildi, demiştir",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 3753,
			"arabicnumber": 3753,
			"text": "BizeŞu'be, Muhammed ibn Ya'kûb'dan tahdîs etti (o, şöyle demiştir): Ben İbnu Ebî Nu'm'dan işittim (şöyle diyordu): Ben Abdullah ibn Omer (radıyallahü anh) 'den işittim: İbn Omer'e (Iraklı) bir kimse: Ben onun \"Sinek öldüren\" dediğini sanıyorum, demiştir- ihrâmlı bir kişinin hâlinden sormuştu. İbn Omer: Irak ahâlîsi sinekten(yani sinek öldürmenin cinayet olup olmadığından) soruyorlar. Halbuki onlar (vaktiyle) Rasûlüllah'ın kızı Fâtıma'nın oğlunu öldürmüşlerdi. Peygamber(sallallahü aleyhi ve sellem) ise, o iki torunu hakkında: \"Onlar benim dünyâdan (öpüp kokladığım) iki reyhânımdır\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 3754,
			"arabicnumber": 3754,
			"text": "Câbir ibn Abdillah (radıyallahü anh) haber verip şöyle demiştir: Omer: Ebû Bekr bizim seyyidimizdir. O bizim seyyidimizi de hürriyete kavuşturdu, der idi ve bununla da Bilâl'i kasdederdi",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 3755,
			"arabicnumber": 3755,
			"text": "Kays ibn HâzınVdan: (Bilâl, Peygamber'in ölümünden sonra Medine'den çıkıp gitmek istedi. Fakat Ebû Bekr ona müsâade etmedi de, Mescid'de müezzinlik yapmasını istedi. Bilâl de: Ben Rasûlüllah'sız Medine'yi istemem, Rasûlüllah'ın makaamını O'ndan boşalmış hâlde görmeye dayanamam, dedikten sonra) Bilâl, Ebû Bekr'e hitaben: Eğer sen beni vaktiyle ancak nefsin için satın aldıysan, beni yanında tut, bir tarafa bırakma. Eğer beni ancak Allah için satın alıp hürriyete kavuşturdun ise, beni Allah'ın ameliyle bırak, dedi",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 3756,
			"arabicnumber": 3756,
			"text": "Abdullah İbn Abbâs radıyallahü anhüma: Peygamber(sallallahü aleyhi ve sellem) beni bağrına bastı da: \"Yâ Allah, buna hikmet öğret” diye duâ etti, demiştir",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 3757,
			"arabicnumber": 3757,
			"text": "",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 3758,
			"arabicnumber": 3758,
			"text": "Mesrûk şöyle demiştir: Bir defasında Abdullah ibn Amr’ın yanında Abdullah ibn Mes'ûd anıldı. Bunun üzerine Abdullah ibn Amr şöyle dedi: İşte bu o kimsedir ki, ben Rasûlüllah(sallallahü aleyhi ve sellem)'ın: \"Kur'ân okumayı dört kişiden isteyiniz: Abdullah ibn Mes'ûd'dan -Rasûlüllah isim saymaya Abdullah ile başladı- Ebû Huzeyfe'nin âzâdlısı Salim'den, Ubeyy ibn Ka'b'dan ve Muâz ibn Cebel'den\" buyururken işittiğimden sonra, artık onu sevmeye devam edeceğim. Amr ibn Murre: Ubeyy ile mi, yoksa Muâz ile mi saymağa başladı, bilmiyorum, demiştir",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 3760,
			"arabicnumber": 3760,
			"text": "Ve yine Rasûlüllah: \"Kur'ân 'ı şu dört kişiden okumak isteyiniz: Abdullah ibn Mes'ûd'dan, Huzeyfe'nin âzâdlısı Sâlim'den, Ubeyy ibn Ka'b'dan ve Muâz ibn Cebel'den\" buyurdu",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 3761,
			"arabicnumber": 3761,
			"text": "",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 3762,
			"arabicnumber": 3762,
			"text": "Abdurrahmân ibn Yezîd en-Nahaî şöyle dedi: Biz bir defasında Huzeyfe'ye: Sahâbîler içinde güzel hâl ve hareketi, meslek ve yolu bakımından Peygamber'e yakın olan kimdir ki, biz onu bilip, onun görünür hâline bakarak hayâtını örnek alalım? diye sorduk. Güzel hâl ve hareketi, meslek ve meşrebi ve sîreti yönünden Peygamber'e İbnu Ümmi Abd'den daha yakın hiçbir kimse bilmiyorum, dedi",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 3763,
			"arabicnumber": 3763,
			"text": "el-Esved ibn Yezîd en-Nahaî tahdîs edip şöyle demiştir: Ben Ebû Mûsâ el-Eş'arî'den işittim, şöyle diyordu: Ben kardeşimle beraber Yemen'den Medîne'ye geldiğim zaman bir müddet bekledik. Peygamber'in hâllerini ve yakınlarını gözetledik. Bu esnada bizim en çok öğrendiğimiz husus, Abdullah ibn Mes'üd'un Ehli Beyt'ten bir kişi olduğunu zannetmemizdir. Çünkü bizPeygamber (sallallahü aleyhi ve sellem)'in huzuruna dâima İbn Mes'ûd ile anasının girdiğini görüyorduk",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 3764,
			"arabicnumber": 3764,
			"text": "",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 3765,
			"arabicnumber": 3765,
			"text": "",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 3766,
			"arabicnumber": 3766,
			"text": "Ebu't-Teyyâh şöyle demiştir: Ben Humrân ibn Ebân'dan işittim ki, Muâviye(radıyallahü anh) şöyle demiştir: Sizler (ikindi namazından sonra) öyle bir namaz kılıyorsunuz ki, yemîn olsun bizler Peygamber(sallallahü aleyhi ve sellem) ile o kadar beraber bulunduk da O'nun bu namazı kıldığını hiç görmedik. Ve yine yemîn olsun ki, Peygamber bil'akis o iki rek'atten(yani ikindiden sonra iki rek'at kılmaktan) nehyetmiştir, dedi",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 3767,
			"arabicnumber": 3767,
			"text": "",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 3768,
			"arabicnumber": 3768,
			"text": "(Abdurrahmân ibn Avf'ın oğlu) Ebû Seleme şöyle demiştir: Âişe (r.anha) şöyle dedi: Rasûlüllah(sallallahü aleyhi ve sellem) bir gün: \"Yâ Âişe! Şu (yanımdaki) Cibril'dir, sana selâm ediyor\" buyurdu. de: Selâm, Allah'ın rahmeti ve bereketleri onun üzerine de olsun! Benim göremediğim Cibril'i Sen görüyorsun, dedim. bu son sözü ile Rasûlüllah'ı kasdediyordu",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 3769,
			"arabicnumber": 3769,
			"text": "Ebû Mûsâ el-Eş'arî (radıyallahü anh) şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem) şöyle buyurdu: \"Erkeklerden birçoğu (fazilette) kemâle ulaştı. Halbuki kadınlardan İmrân kızı Meryem ile Fir'avn 'in kadını Âsiye'den başkası kemâle ermedi. Ümmetimin kadınlarına karşı Âişe'nin fazileti de tirit aşının diğer yemeklere karşı fazileti gibidir",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 3770,
			"arabicnumber": 3770,
			"text": "Abdullah ibnu Abdirrahmân, Enes ibn Mâlik (radıyallahü anh)'ten şöyle derken işitmiştir: Ben Rasûlüllah (sallallahü aleyhi ve sellem)'tan işittim: \"Âişe'nin diğer kadınlara karşı fazileti, tirit aşının diğer yemeklere karşı fazileti gibidir\" buyuruyordu",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 3771,
			"arabicnumber": 3771,
			"text": "İbnu Avn, el-Kaasım ibn Muhammed'den şöyle tahdîs etmiştir: Âişe hasta oldu. İbnu Abbâs ona hasta ziyaretine geldi de: Ey Mü'minlerin Anası, sen Rasûlüllah (sallallahü aleyhi ve sellem) ile Ebû Bekr'in, senden Önce varıp cennette hazırladıkları güzel bir makaama gideceksin (ne mutlu sana! Artık endîşe etme, ferah ol)! Dedi",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 3772,
			"arabicnumber": 3772,
			"text": "Şu'be, el-Hakem ibn Uteybe'den tahdîs etti ki, o şöyle demiştir: Ben Ebû Vâil'den işittim, şöyle dedi: Alî ibn Ebî Tâlib, Ammâr ibn Yâsir ile kendi oğlu Hasen'i Kûfeliler'in Alî tarafına yardımlarını istemeleri için Kûfe'ye gönderdiği zaman, Ammâr bir hutbe yapıp, bunda: Ben kesin surette biliyorum ki, Aişe dünyâda ve âhirette Peygamber'in zevcesidir. Lâkin Allah sizleri, kendi hükmüne mi, yahut Âişe'ye mi tâbi' olacaksınız diye imtihan etmektedir, demiştir",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 3773,
			"arabicnumber": 3773,
			"text": "Âişe (r.anha)'den: Kendisi, kızkardeşi Esmâ'dan ariyet bir gerdanlık almıştı. Sonra bu gerdanlık bir seferde kayboldu. Rasûlüllah (sallallahü aleyhi ve sellem), sahâbîlerinden bâzı kimseleri -ki Useyd ibn Hudayr da bunlar arasında idi- onu aramağa gönderdi. Onlara bu sırada namaz vakti erişti. Su bulamadıkları için abdestsiz olarak namaz kıldılar. Peygamber'e geldikleri zaman bunu kendisine arzettiler. İşte bu vak'a üzerine Teyemmüm Âyeti (el-Mâide: 6) inmiştir. Bunun üzerine Useyd ibn Hudayr, Âişe'ye: Allah seni hayır ile mükâfatlandırsın. Vallâhî senin başına (hoşlanmadığın) hiçbir iş gelmez ki, Allah onda senin için de, müslümânlar için de bir hayır bulundurmasın, dedi",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 3774,
			"arabicnumber": 3774,
			"text": "Urve ibnu'z-Zubeyr'den (şöyle demiştir): Rasülullah (sallallahü aleyhi ve sellem) vefat sebebi olan hastalığı içinde, kadınlarının nevbetlerinde dolaşmayı ve Âişe'nin evinde olmayı şiddetle arzu ederek: \"Yarın ben nerede olacağım? Yarın ben nerede olacağım?\" demeğe başladı. dedi ki:) Âişe: Benim nevbet günüm olunca, Peygamber (bu sözü söylemez) sükût ederdi, dedi",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 3775,
			"arabicnumber": 3775,
			"text": "Urve ibnu'z-Zubeyr şöyle demiştir: İnsanlar Peygamber'e takdim edecekleri hediyelerini Âişe'nin nevbeti gününde vermeyi kasdederlerdi. Âişe şöyle dedi: Kadın arkadaşlarım(bundan gayrete gelerek) Ümmü Seleme'nin yanında toplandılar da: Ey Ümmü Seleme, şübhesiz biliyorsun ki, insanlar hediyelerini Âişe'nin nevbeti gününde getirmeye çalışıyorlar. Halbuki bizler de Âişe'nin hayır istemekte olduğu gibi hayır istemekteyiz. Binâenaleyh sen Rasûlüllah'a söyle de, O, insanlara hediyelerini kadınlarından kimin yanında bulunur ve kimlerin nevbet günlerini dolaşırsa, orada vermelerini emretsin! dediler. dedi ki: Ümmü Seleme diğer kadınların kendisine söylediklerini nevbetinde Peygamber'e zikretti. Ümmü Seleme dedi ki: Ben bunu Peygamber'e zikrettim, O benden yüz çevirdi. Sonra benim nevbetimde bana geldiğinde kendisine bunu yine zikrettim, benden yine yüz çevirdi. Üçüncü nevbetim de geldiği zaman bunu kendisine yine söyledim. Bu defa bana: \"Yâ Ümme Seleme, Âişe hakkında bana eziyet etme. Çünkü şu bir hakikattir ki, vallahi Âişe'den başka sizden hiçbir kadının örtüsü altında bulunduğum hâlde bana vahiy inmedi\" buyurdu. hadîsin daha uzun bir rivayeti Hibe Kitabı, \"Hibenin kabulü bâbı\"nda geçmişti",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 120
			}
		}
	]
}