{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3776,
			"arabicnumber": 3776,
			"text": "Ğaylan b. Cerir'den dedi ki: \"Enes'e sordum: Ne dersin? Ensar adını siz kullanıyor muydunuz yoksa bu adı size Allah mı verdi diye sordum? 0, hayır, bu adı bize Allah verdi, dedi. Biz de Enes'in yanına girerdik, o da bizlere Ensarın menkıbelerini ve bulundukları önemli olayları anlatırdı. Bana yahut da Ezdlilerden bir adama yönelir ve senin kavmin, filan ve filan günü şu şu işi yaptı, derdi. \" Bu Hadis 3844 numara ile gelecektir",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3777,
			"arabicnumber": 3777,
			"text": "Aişe r.anha dedi ki: \"Buas günü Allah'ın, Resulü için önceden cereyan etmesini takdir ettiği bir gündür. Resulullah Sallallahu Aleyhi ve Sellem geldiğinde onların ileri gelenleri tefrikaya (ayrılığa) düşmüş, onların hayırlıları öldürülmüş ve yaralanmış bulunuyordu. Bu sebeple yüce Allah bugünü Resulü için, onların İslam'a girmelerini sağlayan bir sebep olarak önceden takdir etmiş oldu.\" Bu Hadis 3846 ve 3930 numara ile gelecektir",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3778,
			"arabicnumber": 3778,
			"text": "Ebu't-Teyyah dedi ki: Enes r.a.'ı şöyle derken dinledim: \"Ensar Mekke'nin fethedildiği günü --ki Kureyş'(in ileri gelelenlerin)e (ganimet) vermiş idi-- dediler ki: Allah'a yemin olsun, bu gerçekten hayret verici bir şey! Kılıçlarımızdan Kureyş'in kanları damlarken bizim ganimetIerirniz onlara geri veriliyor. Bu sözler Nebi Sallallahu Aleyhi ve Sellem'e ulaşınca Ensarı çağırdı ve onlara dedi ki: Sizden bana ulaşan sözlerin mahiyeti nedir? -Onlar yalan söylemezlerdi.- Dediler ki: Sana ulaşanlar doğrudur. Şöyle buyurdu: İnsanlar ganimetler ile evlerine dönerken, siz de Resulullah sallallahu aleyhi ve selle m ile birlikte evlerinize dönmeye razı olmaz mısınız? Eğer Ensar bir vadiden yahut dağ arası bir yoldan gidecek olursa andolsun ben de Ensarın gittiği o vadiden yahut dağ arası o yoldan giderim.\" Fethu'l-Bari Açıklaması: \"Ensarın menkıbeleri\" Ensar, İslami bir isimdir. Nebi Sallallahu Aleyhi ve Sellem, -Enes'in rivayet ettiği hadiste görüldüğü gibi- bu adı. Evslilere, Hazredilere ve onlarla ile antlaşmalı olanlara vermiştir. Evsliler, Evs b. Harise'ye mensupturlar. Hazrediler ise el-Hazrec b. Harise'ye mensupturlar. Her ikisi de Kayle'nin oğullarıdır. Kayle ise annelerinin adı olup, babalarının adıHarise b. Amr b. Amir olup, EzdiiIerin nesebleri onda bir araya gelirler. Yüce Allah'ın: \"Onlardan ewel Medine'yi yurt edinip, imana sahip olanlar\" ayeti ile ilgili açıklamalar, daha önce Osman'ın menkıbelerinin girişinde geçmiş bulunmaktadır. \"Girerdik\" lafzı bu rivayette bu şekilde atıf edatı kullanılmakszın gelmiştir. Bu da Gaylan'ın sözü olup, Enes'in sözü değildir. \"Enes'in yanına girerdik\" ifadesi, Basra'da onun yanına girerdik, demektir. \"Bana dönerek\" bana hitap ederek. \"Senin kavmin şunu yaptı.\" Yani gazalarda ve İslama yardım hususunda onların yaptıkları güzel işleri anlatırdı. \"Buas günü\" ibaresinde geçen \"Buas\" bir mekanın adıdır. Buranın Medine'den iki mil uzaklıkta\" Kureyza oğulları yakınında bir kale olduğu söylendiği gibi bir mezraa olduğu da söylenmiştir. Burada Evs ile Hazrec arasında bir vakıa meydana gelmişti. Onlardan çok kimse bu vakada öldürülmüştü. Bu savaşta Evslilerin başkanı Useyd b. Hudayr'ın babası Hudayr idi. Ona Hudayru'l-Ketaib (birlikler Hudayr'ı) denilirdi. Bu vakada öldürüldü. O gün Hazreclilerin başında ise Amr b. Numan el-Beyadi vardı. O da bu vakada öldürülmüştür. Bu vakada zafer önce Hazreclilerin iken daha sonra Hudayr kavminin sebat edip geri dönmelerini sağladı ve Evsliler zaferi kazandılar. O günde Hudayr yaralandı ve bu vakada öldü. Sözkonusu bu olay hicretten beş yıl önce meydana gelmiştir. \"Onların ileri gelenleri\" hayırlıları demektir. \"es-Serevat: Hayırlılar, ileri gelenler\" lafzı \"serM\"ın çoğulu olup, bu da \"seriy\" lafzının çoğuludur. Bu da şerefli, soylu kimse demektir. \"Mekke'nin fethedildiği gün\" Mekke fethi yılında demektir. Çünkü sözü edilen ganimetler Huneyn ganimetIeri idi. Bu da Mekke fethinden iki ay sonra olmuştu",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3779,
			"arabicnumber": 3779,
			"text": "Ebu Hureyre r.a., Nebi Sallallahu Aleyhi ve Sellem'den, --diye yahut Ebu'l-Kasım dedi (diyerek)--: \"Eğer Ensar bir vadiden yahut da bir dağ yolundan gidecek olsalar şüphesiz ben de Ensann vadisinden giderim. Eğer hicret olmasaydı, Ensardan bir kişi olurdum.\" Ebu Hureyre dedi ki: Babam, anam ona feda olsun. 0, bu sözü söylerken haksızlık etmedi. Onlar onu barındırdılar, ona yardım ettiler. Yahut da (buna yakın) başka bir söz söyledi. Bu Hadis 7244 numara ile gelecektir. Fethu'l-Bari Açıklaması: el-Hattabı der ki: Nebi sallall€ıhu aleyhi ve sellern, bununla Ensarın kalplerini hoş tutmak istemiştir. Çünkü bu sözleri ile eğer hicretin üstünlüğü gibi bir engel olmasaydı, onlardan bir kişi olmaya razı olacağını ifade etmektedir. \"Ebu Hureyre dedi ki: Haksızlık etmedi.\" Yani o bu sözü söylemekle haddi aşmadı ve onlara hak ettiklerinden fazlasını vermiş olmadı. Daha sonra Ebu Hureyre bunu: \"Onu barındırdılar, ona yardım ettiler\" sözleri ile açıklamaktadır. \"Ya da bir başka söz söyledi.\" Muhtemelen maksat, onu ve ashabını mallarıyla kollayıp, gözetlediklerini kastetmiştir. \"Ensarın vadisinden giderdim\" sözleri ile de onlara güzel bir şekilde muvafakat edeceğini, onlara uygun hareket edeceğiı:ıi anlatmak istemiştir. Çünkü onların güzel komşuluklarını ve ahde vefalarını görmüş, bunlara tanık olmuştur. Yoksa maksat onlara tabi olacağı değildir. Çünkü her mu'minin kendisine uyması ve itaat etmesi farz olan, emrine itaat olunan kişi odur. 3. NEBİ S.A.V.'IN MUHACİHLER İLE ENSAR ARASINDA KARDEŞLİK KURMASI",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3780,
			"arabicnumber": 3780,
			"text": "İbrahim b. SaId babasından o da dedesinden rivayetle, dedi ki: \"Medine'ye geldiklerinde Resulullah Sallallahu Aleyhi ve Sellem, Abdurrahman ile Sa'd b. er-Rebı'i kardeş yaptı. (Sa'd b. er-Rebı') Abdurrahman'a dedi ki: Ben Ensar arasında malı en çok olanım. Malımı ortadan ikiye böleceğim. İki tane de hanımım vardır. Bak, hangilerini daha çok beğenirsen söyle, ben de onu boşayayım. İddeti sona erince de onunla evlenirsin. Abdurrahman dedi ki: Allah aileni de, malını da senin için mübarek kılsın. Pazarınız nerede? . Ona Kaynuka oğullarının pazarını gösterdiler. Geri döndüğünde beraberinde bir miktar keş ve yağ artmıştı. Daha sonra sabah erkenden pazara gitmeyi sürdürdü. Arkasından bir gün üzerinde zaferan izi bulunduğu halde geldi. Nebi Sallallahu Aleyhi ve Sellem: Hayrola deyince, Abdurrahman: Evlendim dedi. Peki hanımına ne kadar mehir verdin, diye sordu. Abdurrahman: Bir çekirdek kadar altın --yahut da bir çekirdek ağırlığı kadar altın-- dedi.\" Şüphe eden (ravilerden) İbrahim'dir",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 3781,
			"arabicnumber": 3781,
			"text": "Enes r.a.'dan dedi ki: \"Abdurrahman b. Avf bize geldi. Nebi Sallallahu Aleyhi ve Sellem de onu ve Sa'd b. er-Rebi'i kardeş yaptı. --Sa'd malı çok olan birisi idi.-- Said dedi ki: Ensar da bilir ki ben Ensar arasında malı en çok olan birisiyim. Malımı kendim ve senin aranda iki eşit parçaya böleceğim. Benim iki tane de hanımım var. Bak onların hangisini daha çok beğenirsen onu boşayayım. İddeti bitti mi de onunla evlenirsin. Abdurrahman dedi ki: Allah aileni sana mübarek kılsın. O gün geri döndüğünde bir miktar yağ ve keş arttırmıştı. Aradan fazla zaman geçmeden Reslilullah Sallallahu Aleyhi ve Sellem'in yanına üzerinde za'feran parçaları bulaşmış olarak geldi. Reslilullah Sallallahu Aleyhi ve Sellem ona: Hayrola, diye sordu. O, Ensardan bir kadın ile evlendim, dedi. Mehir olarak ona ne verdin, diye sordu. O, bir hurma çekirdeği ağırlığı kadar altın --ya da, bir hurma çekirdeği kadar altın-- dedC Allah Reslilü: Bir koyun ile dahi olsa düğün ziyafeti ver, diye buyurdu",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3782,
			"arabicnumber": 3782,
			"text": "Ebu Hureyre r.a. dedi ki: \"Ensar: Bizimle onlar arasında hurma ağaçlarını paylaştır, dedi. O, hayır diye buyurdu. Bu sefer, siz ağaçların bakımını bizim yerimize yaparsınız, mahsulde de bize ortak olursunuz dedi(ler}. (Muhacirler) dinledik ve itaat ettik, dediler.\" Fethu'l-Bari Açıklaması: \"Nebi Sallallahu Aleyhi ve Sellem'in Muhacirler ile Ensarı kardeş yapması.\" İleride Meğazi bölümünden biraz önce hicret ile ilgili başlıklar sırasında buna dair geniş açıklamalar gelecektir. \"Medine'ye geldiklerinde Resulullah Sallallahu Aleyhi ve Sellem, Abdurrahman b. Avf ile Sa'd b. er-Reb'i'i kardeş yaptl.\" Sa'd b. er-Reb'il b. Amr b. Ebi Zuheyr, Ensari ve Hazredi olup Nakiblerden birisidir. Uhud günü şehit düşmüştür. Abdurrahman b. Avfın evlenmesi ile ilgili bilgi, Nikah bölümünde, Velime (düğün yemeği) başlığında gelecektir. \"Ensar, hurma ağaçlarını bizimle onlar arasında paylaştır, dediler.\" Onlardan kasıt Muhacirlerdir. Buna dair açıklamalar da Muzaraa bahsinde geçmiş bulunmaktadır. Burada Ensarın açıkça bir fazileti görülmektedir",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3783,
			"arabicnumber": 3783,
			"text": "Bera r.a. dedi ki: Nebi Sallallahu Aleyhi ve Sellem'i (şöyle buyururken) dinledim --ya da, Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu, dedi-: \"Ensar'ı ancak mu'min olan bir kimse sever, onlara ancak münafık olan birisi buğzeder. Onlan seveni Allah da sever, onlara buğzedene Allah da buğzeder.\" Diğer tahric edenler: Tirmizî, Menakîb; Müslim, İman Tirmizî: Bu hadis sahihtir",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3784,
			"arabicnumber": 3784,
			"text": "Enes b. Malik r.a., Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu söyledi: buyurdu ki: \"İman'ın alameti Ensarı sevmektir. Münafıklığın alameti de Ensara buğzetmektir.\" Fethu'l-Bari Açıklaması: \"Ensarı sevmek\" yani onları sevmenin fazileti. Bu başlık altında el-Bera yoluyla gelen \"onları ancak mu'min bir kişi sever\" hadisini ve Enes'in: \"İmanın alameti Ensarı sevmektir\" hadisini zikretmiş bulunmaktadır. İbnu't-Tın der ki: Maksat onların hepsini sevmek ve onların hepsine buğzetmektir. Çünkü böyle bir şeyancak din adına yapılır. Kendisi adına buğzetmenin uygun olduğu bir husus dolayısıyla birilerine buğzeden bir kimse, bu kapsama girmez. Bu da güzel bir açıklamadır. İman bölümünde hadisin şerhine dair açıklamalar geçmiş bulunmaktadır",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3785,
			"arabicnumber": 3785,
			"text": "Enes r.a. dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem kadınlarla çocukları gelirlerken -ravi: Zannederim o, bir düğünden ... dedi- gördü. Nebi Sallallahu Aleyhi ve Sellem ayağa kalkarak: Allah'ım, sizler insanlar arasında en sevdiğim kişilersiniz, diyıe buyurdu. Bu sözlerini üç defa tekrarladL\" Bu Hadis 5180 numara ile gelecektir",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3786,
			"arabicnumber": 3786,
			"text": "Yine Enes r.a. dedi ki: \"Ensardan bir kadın, beraberinde küçük bir çocuğu olduğu halde Resulullah Sallallahu Aleyhi ve Sellem'in yanına geldi. Resulullah Sallallahu Aleyhi ve Sellem O kadınla konuşup şöyle buyurdu: Nefsim elinde olan'a yemin ederim ki siz, insanlar arasında en sevdiğim kişilersiniz. Bu sözlerini iki defa tekrarladı. \" Bu Hadis 5234 ve 6645 numara ile gelecektir. Fethu'l-Bari Açıklaması: \"Nebi Sallallahu Aleyhi ve Sellem'in Ensar'a: Sizler insanlar arasında en sevdiğim kişilersiniz demesi.\" Bu, topluluklarını kastetmek üzere söylenmiştir. Yani sizin tümünüzü sizden başkalarının tümüne göre daha çok seviyorum. Böylelikle \"insanlar arasında en sevdiğin kişi kimdir\" sorusuna \"Ebu Bekir'dir\" diye cevap verdiği şeklinde daha önce geçmiş olan hadisteki buyrukları ile çelişmem iş olur. \"Nebi Sallallahu Aleyhi ve Sellem ayağa kalktı.\" İbnu't-Tın der ki: Fiil bu şekilde rubai olarak kullanılmıştır. Fakat dilcilerin zikrettikleri ise: Mesule er-reculü, musulen şeklinde, ayakta dikilmeyi anlatmak üzere ve sülasi (üç harfli olarak) kullanılır. \"Resulullah salı allah u aleyhi ve sellem onunla konuştu.\" Yani kendisine sorduğu soruya cevap verdi yahut da onun söze karışmasını sağlamak amacıyla onunla önce kendisi konuştu",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3787,
			"arabicnumber": 3787,
			"text": "Zeyd b. Erkam'dan rivayete göre \"Ensar, Ey Allah'ın Resulü, her bir Nebie tabi olanlar vardır. Biz de sana tabi olduk. Bu sebeple bize tabi olanları bizden kılması için Allah'a dua buyur, dediler. O da bunun için dua etti.\" Bunu ben (Amr b. Murre), İbn Ebi Leyla'ya aktardım. O: \"Zeyd de böyle demiştir\" dedi. Bu Hadis 3788 numara ile gelecektir",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3788,
			"arabicnumber": 3788,
			"text": "Amr b. Murre dedi ki: Ensardan bir adam olan Ebu Hamza'yı şöyle derken dinledim: \"Ensar, Şüphesiz her bir kavme tabi olanlar vardır. Biz de sana tabi olduk. Bu sebeple bize tabi olacakları bizden kılması için Allah'a dua et, dediler. Nebi Sallallahu Aleyhi ve Sellem: Allah'ım, bunlara tabi olacakları kendilerinden kıl, diye dua etti.\" Amr dedi ki: Ben bunu İbn Ebi Leyla'ya aktardım. O, Zeyd de böyle demiştir, dedi. Şu'be: Zannederim o(nun kastettiği) Zeyd b. Erkam'dır, dedi. Fethu'l-Bari Açıklaması: \"Ensara tabi olanlar\" yani onlarla antIaşması bulunanlar ve meval1ler. \"Bize tabi olacakları bizden kılması. .. \" Ensar hakkında iyilik yapılması ve benzeri vasiyetin onları da kapsaması için onlara da Ensar denilmesi demektir. \"O da bu duayı yaptı.\" İstedikleri gibi dua etti. Bundan sonraki rivayette de: \"Allah'ım, onlara tabi olanları kendilerinden kıl:Jı ile bunu açıklamış bulunmaktadır. ( \"Ben de bunu aktardım\" yani naklettim)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3789,
			"arabicnumber": 3789,
			"text": "Ebu Useyd r.a. dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: Ensar evlerinin en hayırlısı, Neccar oğullarıdır, sonra Abdu'l-Eşhel oğulları, sonra el-Haris b. el-Hazrec oğulları, sonra Saide oğullarıdır. Bununla birlikte bütün Ensar ailelerinde hayır vardır. Sa'd, benim gördüğüm kadarıyla Nebi Sallallahu Aleyhi ve Sellem başkalarını bize üstün tutmuştur, dedi. Bunun üzerine, gerçekte o sizi pek çok kimseye üstün kılmıştır, denildi. \" Bu Hadis 3790,3807 ve 6053 numara ile gelecektir",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3790,
			"arabicnumber": 3790,
			"text": "Yine onun (Ebu Useyd) r.a.'ın, Nebi Sallallahu Aleyhi ve Sellem'i şöyle buyururken dinlediği rivayet edilmiştir: \"Ensarın en hayırlıları --ya da Ensar evlerinin en hayırlıları, diye buyurdu-- Neccar oğulları, Abdu'l-Eşhel oğulları, elHaris oğulları ve Sazde oğullarıdır",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3791,
			"arabicnumber": 3791,
			"text": "Ebu Humeyd'den rivayete göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Şüphesiz Ensarın evlerinin en hayırlısı Neccar oğullarının evi, sonra Abdu'l-Eşhel, sonra el-Haris oğullarının, sonra Saide oğullarının evleridir. Bununla birlikte Ensarın bütün evlerinde hayır vardır. Biz arkasından Sa'd b. Ubade'ye yetiştik. (Ebu Hammad): Ey Ebu Useyd, Allah'ın Nebi'i Sallallahu Aleyhi ve Sellem'in Ensar arasında hayırlı olanlari sıralarken bizi en sona bıraktığını görmedin mi? dedi. Sa'd, Nebi Sallallahu Aleyhi ve Sellem'in arkasından yetişti ve, ey Allah'ın Resulü, Ensarın evleri arasında hayırlı olanlar söylendi de biz en sona bırakıldık, dedi. Allah Resulü: Hayırlı olanlar arasında olmak size yetmez mi, diye buyurdu.\" . Fethu'l-Bari Açıklaması: \"Ensarın evlerinin fazileti\" onların konakladıkları yerler kastedilmektedir. \"Ebu Useyd\" es-Said! olup, künyesi ile meşhurdur. Adının Malik olduğu söylenmiştir. \"Ensarın evlerinin en hayırlısı Neccar oğullarıdır.\" Bunlar Hazredilerdendir. en-Neccar denilen kişi Teymullah'ın kendisidir. Ona bu adın veriliş sebebi ise bir adama vurduğu bir darbe ile bir tarafını kesmesidir. Bundan dolayı ona en-Neccar denilmiştir. Babasının adı Sa'lebe b. Amr olup, Hazredilerdendir. \"Sonra Abdu'l-Eşhel oğullarıdır.\" Bunlar da Evs'tendir. Adı Abdu'I-Eşhel b. Cuşem b. el-Haris b. el-Hazrec el-Asğar b. Amr b. Malik b. el-Evs b. Harise'dir. \"Sonra da el-Haris b. el-Hazrec oğullarıdır.\" Bu da el-Hazrec el-Ekber olup, İbn Amr b. Malik -sözü geçen- b. el-Evs b. Harise'diY:' \"Sonra Saide oğullarıdır.\" Bunlar da Hazredidir. Saide b. Ka'b b. el-Hazrec el-Ekber'dir. \"Ensar evlerinin en hayırlılarıdır. Bununla birlikte Ensarın bütün evlerinde hayır vardır.\" Birinci \"hayırlıdır\" daha faziletlidir anlamındadır, ikincisi ise bütün Ensar için sözkonusu olan -farklı mertebelerde olsa dahi- fazilettir. \"Said b. Ubade\" dedi. Said da Saide oğullarındandır. O gün için onların ileri gelenleri (büyükleri) idi. \"Hayırlılardan olmak size yetmez mi?\" Faziletlilerden olmak size yetmez mi demektir. Çünkü onlar kendilerine göre daha aşağıda olanlara nisbetle daha faziletlidirler. Aralarındaki bu fazilet mertebesi daha erken İslama girmeye, yüce Allah'ın kelimesini yükseltmek için çalışmaya ve benzeri hususlara göre yapılmış gibidir",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 3792,
			"arabicnumber": 3792,
			"text": "Useyd b. Hudayr r.a.'dan rivayete göre \"Ensardan bir adam: Ey Allah'ın Resulü, filan kimseyi görevlendirdiğin gibi bana da görev vermez( misin, dedi. Allah Resulü şöyle buyurdu: Benden sonra (sizlere başkalarının) tercih edildiğini göreceksiniz. Havz'ın başında benimle karşılaşıncaya kadar sabredin iz. \" Bu Hadis 7057 numara da var",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 3793,
			"arabicnumber": 3793,
			"text": "Enes b. Malik r.a. dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem Ensara şöyIe dedi: Sizler benden sonra (sizlere) başkalarının tercih edildiğini göreceksiniz. Bu sebeple benimle karşılaşacağınız vakte kadar sabrediniz. Sizinle buluşma yerimiz de Havz(ın başı)dır",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 3794,
			"arabicnumber": 3794,
			"text": "Yahya b. Sa'd'dan rivayete göre o, Enes b. Malik r.a. ile eI-Velid'in yanına gittiği zaman (ona) şöyIe dediğini dinlemiştir: \"Nebi Sallallahu Aleyhi ve Sellem Ensarı onIara Bahreyn'i ikta oIarak vermeye davet etti (teklif etti). OnIar ise kardeşIerimiz Muhacirlere onun gibisini ikta oIarak vermedikçe oImaz, dediler. Şöyle buyurdu: Madem kabul etmiyorsunuz, o halde benimle karşılaşacağınız vakte kadar sabrediniz. Gerçek şu ki benden sonra (size) başkalarının tercih edildiğini göreceksiniz.\" Fethu'l-Bari Açıklaması: \"Nebi Sallallahu Aleyhi ve Sellem'in Ensara: Havz'ın başında benimIe karşılaşıncaya kadar sabrediniz, diye buyurmas!.\" Yani o Ensara böyIe hitap etmişti. \"Bunu Abdullah b. Zeyd nakletmiştir.\" Ab4ıa-h b. Zeyd b. Asım eI-Mazini'dir. Onun bu hadisini müellif mevsuI bir sened ile bundan daha tam oIarak iIeride yüce Allah'ın izniyIe geIeceği gibi Huneyn gazvesinde zikretmiş buIunmaktadır. \"Bana görev vermez misin?\" Yani beni de sadaka topIamak yahut bir böIgeyi yönetmek üzere görevIendirmez misin? \"Benden sonra başkaIarının (size) tercih edildiğini göreceksiniz.\" BununIa yönetim işinin başkaIarının eline geçeceğine ve Ensar dışarıda tutuIarak malların başkalarının elinde bulunacağına işaret etmektedir. Durum Reso.lullah Sallallahu Aleyhi ve Sellem'in anlattığı gibi olmuştur. Bu da onun gelecekte gerçekleşeceğini haber verip, haber verdiği şekilde meydana gelen haberler arasında sayılmaktadır. İleride Fiten bahsinde buna dair geniş açıklamalar gelecektir. \"Sizinle buluşma yerimiz Havz(ın başıdır.)\" Kıyamet gününde Nebi Sallallahu Aleyhi ve Sellem'in Havzı başında demektir. \"Onunla\" yolculuğa \"gittiği zaman.\" \"el-Velid b. Abdulmelik b. Mervan ... \" Enes, Haccac kendisini rahatsız edince Basra'dan Dımaşk'a onu el-Velid b. Abdulmelik'e şikayet etmek üzere gitmişti. Velid de Enes'in Haccac'dan hakkını almıştı. 9. NEBİ S.A.V.'İN: \"(ALLAH'IM) ENSAR İLE MUHACİRİ ISLAH ET\" DİYE DUA ETMESİ",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 3795,
			"arabicnumber": 3795,
			"text": "Enes b. Malik r.a. dedi ki: Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Yaşamak dediğin ahiret hayatıdır. Allah'ım, ıslah et Ensar ile Muhacirleri.\" Katade de, Enes r.a.'dan bunun gibisini rivayet etmiş ve: \"Ensara mağfiret et\" diye eklemiştir",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 3796,
			"arabicnumber": 3796,
			"text": "Humeyd et-Tavll'den: Enes b. Malik r.a.'ı şöyle derken dinledim: Hendek gününde Ensar şöyle diyordu: \"Biz Muhammed'e bey'at etmiş olanlarız- Hayatta kaldığımız sürece ebediyyen cihad etmek üzere.\" O da onlara şöyle cevap vermişti: \"Allah'ım, hayat dediğin ahiret hayatıdır. Ensarı ve Muhacirleri keremli kıl",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 3797,
			"arabicnumber": 3797,
			"text": "Sehl dedi ki: \"Biz hendeği kazıyıp, toprağını sırtımızda taşırken Resulullah Sallallahu Aleyhi ve Sellem yanımıza geldi ve şöyle dedi: Allah'ım, hayat dediğin şey ahiret hayatıdır. Muhacirlerle Ensara mağfiret buyur.\" Bu Hadis 4098 ve 6414 numara ile gelecektir. Fethu'l-Bari Açıklaması: \"Nebi sallAllahu aleyhi ve sellem'in: Ensar ile Muhaciri ıslah et, diye dua etmesi.\" Yani o böyle diyerek onlara dua etmiştir. Bu başlık altında Enes'ten gelen hadisi zikretmiş bulunmaktadır. \"Sırtımız üzerinde\" ifadesindeki \"ektad\" kelimesinin tekili \"keted\" olup omuzdan sırta kadar olan arayı ifade eder",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 3798,
			"arabicnumber": 3798,
			"text": "Ebu Hureyre r.a.'dan rivayete göre \"Bir adam Nebi Sallallahu Aleyhi ve Sellem'e geldi. O da (misafire bir şeyler ikram etmek Üzere) hanımlarına haber gönderdi. Onlar: yanımızda sudan başka bir şey yok, diye cevap verdiler. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem, bunu kim beraberinde alıp götürür --ya da misafir eder-- diye buyurdu. Ensardan bir adam, ben dedi. Adamı alarak hanımına gitti ve, Resulullah Sallallahu Aleyhi ve Sellem'in misafirine ikram et, dedi. Hanımı, yanımızda çocuklarına yetecek kadarından fazlası yok deyince, kocası yemeğini hazırla ve kandilini yak, çocuklarını akşam yemeğini yemek istedikleri takdirde uyut, dedi. Kadın yemeğini hazırladı, kandilini yaktı, çocuklı.rını uyuttu. Daha sonra kalkıp kandilini düzeltir gibi yaparken kandili söndürdü. Her ikisi de adama yemek yedikleri izlenimini verdiler. Karı-koca yemek yemeden geceyi geçirdiler. Sabah olunca Resulullah Sallallahu Aleyhi ve Sellem'in yanına gitti. Resulullah şöyle buyurdu: Bu gece Allah -ikinizin yaptığına güldü --ya da beğendi.-- Bunun üzerine yüce Allah, \"Kendileri fakirlik içinde bulunsalar dahi öz nefislerine tercih ederler. Kim nefsinin cimriliğinden korunursa, işte onlar, umduklarını bulanların ta kendileridir. \" [Haşr, 9] buyruğunu indirdi. Bu Hadis 4889 numara ile gelecektir. Diğer tahric edenler: Tirmizi Tefsirul Kur’an; Müslim, Eşribe Tirmizî: Bu hadis hasen sahihtir. Fethu'l-Bari Açıklaması: \"Bir adam Nebi sallAllahu aleyhi ve sellem'in yanına geldi.\" Bunun ismini tespit edemedim. İleride onun Ensardan birisi olduğuna dair bilgi gelecektir. \"Hanımlarına haber gönderdi.\" Yani onlardan misafirini ağırlayacak şeyler istedi. \"Yanımızda sudan başkası yok, dediler.\" Bu ibarede bu olayın yüce Allah'ın Hayber ve benzeri diğer yerleri fethetmeyi nasip etmeden önce, ilk dönemlerde olduğu izlenimi vardır. \"Kim yanına alır ya da misafir eder?\" Yani kim bunu yanına alıp, onu misafir olarak ağırlar? Ebu Usame yoluyla gelen rivayette: \"Bu gece bu adamı misafir edecek bir kimse yok mu? Allah da ona rahmet ihsan edecektir\" şeklindedir. \"Ensardan bir adam: Ben dedi.\" İbnu't-Tın'in iddiasına göre bu Sabit b. Kays b. Şemmas'dır. \"Çocuklarıma yetecek kadarından fazlası yok.\" Misafir edenin ve hanımının akşam yemeği yemiş olması ihtimali vardır. Çocukları da o sırada işleriyle meşgul veya uykuda olduklarından onlara yetecek kadarını ayırmışlar yahut da çocuklarının akşam yemeğine ihtiyaçlarının fazla olması dolayısıyla akşam yemeğini onlara ayırmış olabilirler. Ebu Usame yoluyla gelen rivayetteki: \"Biz de bu gece aç kalırız\" sözleri dolayısıyla kabul edilmeye değer görüş de budur. Bu rivayetin sonunda aynı şekilde her ikisinde de: \"Akşam bir şey yemeden sabahı ettiler\" denilmektedir. \"Kandilini yak, çocuklarını uyut.\" Müslim'deki bir rivayette \"onları herhangi bir şeyle oyala\" şeklindedir. \"Bu gece Allah sizin yaptığınızdan dolayı güldü ya da beğendi.\" Gülmenin ve beğenmenin yüce Allah'a nispet edilmesi mecazidir. Her ikisinden de maksat karı-kocanın yapmış olduklarından razı olmasıdır. Hadisten Çıkarılan Bazı Sonuçlar Hadiste dini ya da dünyevi bir masıahat bulunduğu takdirde, ağır olmayan bir zarar ihtiva ediyor olsa dahi babanın fiilinin, küçük çocuğu hakkında geçerli ve nafiz olduğuna delil vardır. Bu hüküm küçük çocuğun benzer durumlara adeten katlanabileceğinin bilinmesi şartına bağlı olarak kabul edilir. Doğruyu en iyi bilen Allah'tır",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 3799,
			"arabicnumber": 3799,
			"text": "Hişam b. Zeyd dedi ki: Enes b. Malik'i şöyle derken dinledim: \"Ebu Bekir ve Abbas (r.anhuma) Ensarın birlikte oturdukları bir meclisten geçerlerken Ensar ağlıyordu. Niye ağlıyorsunuz diye sordu, onlar: Nebi'in bizim yanımızda oturuşunu hatırladık, dediler. Nebi Sallallahu Aleyhi ve Sellem'in yanına girerek ona durumu haber verdi. (Enes) dedi ki: Nebi Sallallahu Aleyhi ve Sellem başına çizgili bir kumaşın kenarından bir parça bağlamış olarak dışarı çıktı. Minbere çıktı. O günden sonra da bir daha minbere çıkmadı. Yüce Allah'a hamdu senada bulunduktan sonra şöyle buyurdu: Size Ensarı tavsiye ediyorum. Çünkü onlar benim iç organlarıma ve heybeme benzerler. Onlar üzerlerine düşeni sonuna kadar yaptılar. Artık geriye onların lehine olan (onları mükafatlandırmak) kalmıştır. O halde onların iyilik yapanlarının (iyiliğini) kabul ediniz, kötülük yapanlarının (kötülüklerini) bağışlayınız.\" Bu Hadis 3801 numara ile gelecektir",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 3800,
			"arabicnumber": 3800,
			"text": "İbn Abbas r.a. dedi ki: \"Resulullah Sallallahu Aleyhi ve Sellem omuzlarının üzerine atmış oldugu bir örtüye bürünmüş olduğu halde çıktı. Başını da kirli-beyaz bir bezle bağlamıştı. Nihayet minberin üzerine oturdu, Allah'a hamdu sena ettikten sonra dedi ki: Ey insanlar, diğer insanlar çoğalırken Ensar azalıp duruyor ve nihayet onlar yemekteki tuz kadar olacaklar. Sizden kim bir kimseye fayda ya da zarar verecek bir işin başına gelecek olursa onların iyilik yapanlarından (iyiliğini) kabul etsin, kötülük yapanlarının da (kötülüklerini) bağışlasın",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 3801,
			"arabicnumber": 3801,
			"text": "Enes b. Malik r.a.'dan rivayete göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Ensar benim iç organlarım ve benim heybemdirler. İnsanlar çoğalacak, onlar azalacaklardır. O halde onların iyilik yapanlarından (iyiliğini) kabul ediniz, kötülük yapanlarından (kötülüklerini) bağışlayınız.\" Fethu'l-Bari Açıklaması: \"Nebi sallallahu aleyhi ve sellem'in onların iyilik yapanlarından (iyiliğini) kabul ediniz, kötülük yapanlarının (kötülüğünü) bağışlayınız\" buyruğu ile kastettiği kimseler Ensardır. \"Ebu Bekir\" es-Sıddik \"ve el-Abbas\" b. Abdulmuttalib \"geçtiler.\" Bu olay Nebi sallallahu aleyhi ve sellem'in hastalığı döneminde olmuştur. O sırada o meclisteki Ensar ağlıyordu. \"Niçin ağlıyorsunuz, dedi.\" Onlara bu şekilde hitap eden kimsenin adını tes: pit edemedim. O kişi Ebu Bekir midir yoksa el-Abbas mı? Benim daha kuwetli gördüğüm, bu kişinin el-Abbas olduğudur. \"Size Ensarı tavsiye ediyorum.\" Bazı imamlar bundan halifeliğin Ensarda sözkonusu olmayacağını hükmünü çıkarmıştır. Çünkü aralarında halife olacaklara tavsiye yapılır. Onların lehine başkalarına tavsiyede bulunulmaz. Fakat böyle bir delalet bulunmamaktadır. Çünkü buna bir engel yoktur. \"Benim iç organlarım ve heybemdirler.\" Yani benim sırdaşlarım ve benim özel yakınlarımdır. Filanın kerşi (iç organları) darmadağınıktır, denilince pek çok çoluğu çocuğu vardır demek istenir. Heybe ise kişinin yanındaki değerli eşyasını içine koyduğu şeydir. Onların sırrını tevdi ettiği ve kendilerine güvendiği kimseler olduğunu anlatmak istemektedir. \"Onlar üzerlerine düşeni (görevlerini) yerine getirdiler. Geriye onların lehine olan (hakları, mükafatları) kald!.\" Bu sözler ile onların Akabe gecesi bey'atleşirken söylediklerine işaret etmektedir. Çünkü onlar Nebi Sallallahu Aleyhi ve Sellem'i kendilerine tercih edeceklerine ve ona yardım edeceklerine dair bey'at etmişlerdi. Buna karşılık da onlara cennet vaat edilmişti. Onlar verdikleri sözü eksiksiz yerine getirdiler. \"Ona bürünmüş olduğu halde\" yani o elbiseye sarılmış ve bürünmüş olduğu halde. \"Desma\" yağ renginde demektir. (Kirli beyaz diye tercüme edilmiştir.) Enes yoluyla rivayet edilen hadisteki \"insanlar' artarken onlar eksiliyorlar\" sözleri Ensarın azalmakta olduklarını ifade etmektedir. Hadiste şuna da işaret edilmektedir: Arap kabileler ve arap olmayanlar İslama gireceklerdir. Bunlar ise Ensar denilen kabilenin kat kat fazlasıdır. Nesillerinin çoğalması suretiyle Ensarın ne kadar çoğalacakları farz edilse bile, bunların da aynı şekilde çoğalacakları düşünülür. Dolayısıyla onlar her zaman için diğerlerine nispetle çok az kalacaklardır. Muhtemelen Nebi salı allah u aleyhi ve sellem onların mutlak olarak da azalacaklarına muttali olmuş olabilir. Bu sebeple onlara bu durumu haber vermiştir ve nitekim durum onun dediği gibi çıkmıştır. Çünkü şu anda Ali b. Ebi Talib soyundan gelip ona nispeti muhakkak olan kimselerin sayısı Evs ve Hazrec kabilelerine mensubiyetleri muhakkak olup, bu iki kabileden oldukları kesin olarak bilinenlerin kat kat fazlasıdır. \"Ve nihayet yemekteki tuz gibi olacaklardır.\" Maksat onların azlıklarını anlatmaktır. \"Aralarından kötülük yapanlarını affetsin.\" Kasıt hadler ve insanların hakları dışındaki kötülüklerdir",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 3802,
			"arabicnumber": 3802,
			"text": "Bera r.a.'dan dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem'e ipek bir hulle (elbise) hediye edildi. Ashabı ona dokunmaya ve yumuşaklığından hayret etmeye koyuldu. Şöyle buyurdu: Bunun yumuşaklığına hayret mi ediyorsunuz? Andolsun Sa'd b. Muaz'ın mendilleri bundan daha hayırlı yahut daha yum uşaktır",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 3803,
			"arabicnumber": 3803,
			"text": "Cabir r.a.'dan: Nebi Sallallahu Aleyhi ve Sellem'i şöyle buyururken dinledim: \"Sa'd b. Muaz'ın ölümü dolayısıyla arş sarsıldı.\" Yine Cabir'den, Nebi Sallallahu Aleyhi ve Sellem'in buna benzer bir hadis buyurduğu rivayet edilmiştir. \"Bir adam Cabir'e dedi ki: Bera diyor ki: Serir (taht sarsıldı). Bunun üzerine (Cabir) dedi ki: Bu iki kabile arasında düşmanlık vardı. Ben Nebi Sallallahu Aleyhi ve Sellem'i şöyle buyururken dinledim: Sa'd b. Muaz'ın ölümü dolayısıyla Rahman'ın Arşı sarsıldı",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 3804,
			"arabicnumber": 3804,
			"text": "Ebu Said el-Hudrı r.a.'dan rivayete göre \"Bazı kimseler Sa'd b. Muaz'ın hükmünü kabul ederek indiler. Ona haber gönderildi. Bir eşek üzerinde geldi. Mescide yakın yere gelince, Nebi Sallallahu Aleyhi ve Sellem: Sizin en hayırlınız --yahut efendiniz-- için ayağa kalkınız, diye buyurdu. (Sa'd'a hitaben): Ey Sa'd bunlar senin hükmünü kabul ederek indiler, dedi. Sa'd, ben de onlar hakkında savaşçılarının öldürülmesi, kadın ve çocuklarının esir edilmesi hükmünü veriyorum, dedi. Allah Resulü: Sen Allah'ın hükmü ile yahut Melikin hükmü ile hüküm verdin, dedi.\" Fethu'l-Bari Açıklaması: \"Sa'd b. Muaz\" b. en-Numan b. İmriu'l-Kays b. Abdi'l-Eşhel \"ın menkıbeleri.\" Evs'in büyüğü idi. Nitekim Sa'd b. Ubade de Hazredilerin büyüğü idi. \"Nebi Sallallahu Aleyhi ve Sellem'e ipekten bir hulle hediye edildi.\" Ona bunu hediye eden Oı1me'li Ukeydir idi. \"el-Bera: Taht sarsıldı diyor.\" Kasıt onun üzerinde bulunandır. \"Bu iki kabile arasında ... \" Yani Evsli1erle Hazrediler arasında düşmanlık vardı. el-Hattabi der ki: Cabir'in böyle demesine sebep şudur: Sa'd Evsli, el-Bera da Hazredi idi. Hazrediler ise Evslilerln herhangi bir fazilete sahip olduklarını kabul etmezlerdi. O böyle demiş ise de bu büyük bir hatadır. Aksine el-Bera da Evslidir. Çünkü o İbn Azib b. el-Haris b. Adiy b. Mecdea b. Harise b. el-Haris b. el-Hazrec b. Amr b. Malik b. el-Evs'dir. Sa'd b. Muaz ile birlikte el-Haris b. el-Hazrec ile nesebleri bir araya gelmektedir ki, el-Hazrec aynı zamanda el-Haris b. el-Hazrec'in de babasıdır. Bu da Evs'in karşı noktasında nesebde yer alan el-Hazrec değildir. Onun adı ona verilmiştir. Evet, Evs'in mukabili olan Hazreç'lilerden ona mukabil olan kişi Cabir'dir. Cabir'in bu sözleri söylemesi hakkı ortaya çıkarmak ve fazilet sahibinin faziletini itiraf etmek içindir. O bu sözleriyle el-Bera'nın Evs'li olmakla birlikte bu sözleri nasıl söylediğine şaşmış gibi görülmektedir. Sonra da şunları eklemiştir: Ben her ne kadar Hazredi isem ve Evs ile Hazrediler arasında olanlar olmuş olsa bile, bu benim hakkı söylememe engel değildir deyip, hadisi zikretmektedir. Bu hususta el-Bera lehine sürülecek mazeret şudur. O Sa'd b. Muaz'ın faziletinin üstünü örtrnek maksadıyla bu sözlerini söylememiştir. O bunu anlamış Ve bunu ifade etmiştir. Onun hakkında ona yakışanı düşünmek, bunu gerektirmektedir. Ayrıca bu onun taassub sahibi olmadığının da delilidir. el-Hattabi az önce geçen kanaati ortaya attığından, kendisi ve ona uyanlar da Cabir'in el-Ber hakkında söylediklerine mazeret bulma ihtiyacını hissetmişler ve bu hususta özetle şunları söylemişlerdir: Bera bu sözlerinde mazurdur. Çünkü o bu sözlerini Sa'd'a düşmanlık dolayısıyla söylemiş değildir. O muhtemelolan bir anlamı çıkarmış ve hadisi ona göre yorumlamıştır. Cabir'in lehine sürülecek mazeret de şudur: O el-Bera'nın Sa'd'e olan kinini dile getirmek istediğini zanetmiştir. Dolayısıyla onun Sa'd'e yardım etmesi de uygun bir davranış görülmüştür. Doğrusunu en iyi bilen Allah'tır. Arş'ın sarsılmasından maksat ise ruhun gelişi ile sevinmesi ve sürur duymasıdır. Bir kimsenin huzuruna gelmesi dolayısıyla sevinen herkes için, \"Onun gelişine sarsıldı\", denilir. Yer bitkilerle yeşerip güzelleştiği zaman \"arz sarsıldı\" ifadesi de buradan gelmektedir. \"Bir takım kimseler Sa'd'in hükmünü kabul ederek indiler\" ifadesi ile kastedilenler Kureyza oğullarıdır. İleride buna dair açıklamalar Meğazi bölümünde gelecektir. (4121 numaralı hadiste)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 3805,
			"arabicnumber": 3805,
			"text": "Enes r.a.'dan rivayete göre iki adam karanlık bir gecede Nebi Sallallahu Aleyhi ve Sellem'in yanından çıktılar. Önlerinde bir nur görüverdiler. Nihayet birbirlerinden ayrıldıklarında o nur da onlarla birlikte ayrıldı. Ma'mer'in Sabit'ten, onun da Enes'den rivayetine göre Useyd b. Hudayr ile Ensardan bir adam Hammad dedi ki: Bize Sabit, Enes'den diye haber verdi ki: \"Useyd b. Hudayr ile Abbad b. Bişr Nebi Sallallahu Aleyhi ve Sellem'in yanında idiler. .. \" Fethu'l-Bari Açıklaması: \"Useyd b. Hudayr ile Abbad b. Bişr'in bir menkıbesi\" Useyd b. Hudayr b. Simak b. Atık b. Rafi' b. İmriu'l-Kays b. Zeyd b. Abdi'l-Eşhel olup, Ensari Evs'li ve Eşhel'lidir. Künyesi Ebu. Yahya'dır, başka künyeler de söylenmiştir. En sahih kabul edilen görüşe göre Ömer r.a.'ın halifeliği döneminde 20 h. yılında vefat etmiştir. Abbad b. Bişr'in -ileride açıklayacağımız gibi- babasının adı Vakş'dır. Buhari'nin et-Tarih adlı eseri ile Ebu Ya'la'nın Müsned'inde yer alan ve Hakim'in de sahih olduğunu belirttiği İbn İshak yoluyla Yahya b. Abbad'dan, onun babasından, onun Aişe'den rivayetine göre Aişe şöyle demiştir: \"Ensardan üç kişi vardır ki kimse onlardan daha faziletli değildir. Hepsi de Abdu'l-Eşhel oğullarındandı: Sa'd b. Muaz, Useyd b. Hudayr ve Abbad b. Bişr\" \"İki adam\" Ma'mer'in rivayetinden açıkça anlaşıldığına göre Useyd b. Hudayr bunlardan birisi idi. Hammad'ın rivayetinden de anlaşıldığına göre ikincisi Abbad b. Bişr idi. Bundan dolayı müellif (Buhari) başlıkta bunu kesin bir ifade ile belirtmiş ve onlar ile ilgili hadise işaret etmiştir",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 3806,
			"arabicnumber": 3806,
			"text": "Abdullah b. Amr r.a.'dan rivayete göre: \"Nebi Sallallahu Aleyhi ve Sellem'i şöyle buyururken dinledim: Kur'an okumayı şu dört kişiden öğreniniz: İbn Mes'ud'dan, EbU Huzeyfe'nin mevlası Salim'den, Ubey'den ve Muaz b. Cebel'den.\" Fethu'l-Bari Açıklaması: \"Mu az b. Cebel\" b. Amr b. Evs \"in menkıbeleri\" Esed b. Şaride b. Vezid b. Cuşem b. el-Hazrec oğullarından Hazredidir. Künyesi Ebu Abdurrahman'dır. Bedir gazvesinde ve Akabe'de bulunmuştur. Nebi Sallallahu Aleyhi ve Sellem tarafından Yemen'e emir tayin edilmiştir. Vefatından sonra Medine'ye geri dönmüş, daha sonra cihad etmek üzere Şam'a çıkıp gitmiştir. Amevas taununda 18 h. yılında vefat etmiştir. (Buhari) onun hakkında Abdullah b. Amr'ın rivayet ettiği: \"Kur'an akumayı şu dört kişiden öğreniniz\" hadisini zikretmiştir. Bu hadise dair açıklama az önce geçmiş bulunmaktadır. İbn Hibban ve Tirmizi, Ebu Hureyre yoluyla merfu olarak şu hadisi rivayet etmişlerdir: \"Muaz b. Cebel ne iyi bir adamdır.\" O Akabe bey'atlerinde bulunmuş, Bedir savaşına katılmış, ashab-ı kiramın fukahasından idi. Tirmizi ve İbn Mace, Enes'ten merfu olarak şöyle dediğini rivayet etmişlerdir: ,\"Ümmetimin en merhametlisi Ebu Bekir'dir ... -Bu hadiste şu ibarelerde vardır:- Helal ve hararnı en iyi bilenleri de Muaz'dır.\" Bu hadisin ravileri sikadırlar. Ömer'den de şöyle dediği sahih olarak nakledilmiş bulunmaktadır: \"fıkıh öğrenmek isteyen Muaz'a gitsin.\" İleride Nahl suresinin tefsirinde ondan sözedilecektir. Muaz sahih kabul edilen görüşe göre 33 yıl yaşamıştır",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 3807,
			"arabicnumber": 3807,
			"text": "Ebu Useyd Resulullah'ın şöyle buyurduğunu söyledi: \"Ensar'ın evlerinin hayırlısı Neccar oğullarıdır. Sonra Abdu'l-Eşhel oğulları, sonra el-Haris b. el-Hazrec oğulları, sonra Saide oğullarıdır. Bununla birlikte Ensarın bütün evlerinde bir hayır vardır. Sa'd b. Ubade -ki İslama erken girmişlerden idi- dedi ki: Resulullah Sallallahu Aleyhi ve Sellem'in başkalarının bizden faziletli olduğunu söylediğini görüyorum. Ona, o, sizlerin pek çok kimseden daha faziletli olduğunuzu söylemiştir, denildi.\" Fethu'l-Bari Açıklaması: \"Said b. Ubade\" b. Du!eym b. Harise b. Ebi Huzeyme b. Sa'lebe b. Tarif b. el-Hazrec b. Saide \"nin bir menkıbesi\" Künyesi Ebu Sabit'tir. Ashab-ı kiramın meşhurlarından biri olan Kays b. Sa'd'ın da babasıdır. Sa'd, Hazreclilerin büyüğü, cömertliğiyle meşhur bir kimse idi. Şam topraklarından sayılan Havran denilen yerde Ömer radıyallahu anhlın halifeliği döneminde h. 14 yahut 15. yılda vefat etmiştir. Daha sonra Buhari onun hakkında Ebu Useyd'in Ensarın evlerine dair rivayet ettiği hadisi zikretmektedir. Az önce geçmiştir. Burada onu tekrar etmesinin sebebi bu rivayet yolunda: \"Ki İslamda önceliği olan birisi idi\" demiş olmasıdır. \"Aişe dedi ki: O bundan önce salih bir kimse idi.\" Bu İfk hadisinin bir bölümüdür. Bu hadis bütünüyle yüce Allah'ın izniyle Nur suresinin tefsirinde gelecektir. Aişe bu hadiste Sa'd b. Ubade ile Useyd b. Hudayr arasındaki konuşmaları zikretmiştir. Ordaki rivayete göre Useyd b. Hudayr şöyle demiştir: \"Eğer bu kişi Hazrec'den olan kardeşlerimizden ise sen de bize düşeni emret. Bunun üzerine Sa'd b. Ubade kendisine: Sen onu öldüremezsin, dedi\" ve bunun sonucunda aralarındaki tartışma alevlendi, nihayet Nebi sallallahu aleyhi ve sellem onları susturdu. Aişe bu sözleriyle Said b. Ubade'nin o sözü söylemeden önce de salih bir kişi olduğuna işaret etmiş olmaktadır. Ancak bu onun bu sıfatın dışına çıkmış olmasını gerektirmez. Zira bu haberde o sözü söylediğinden sonraki durumu ile alakalı bir ifade bulunmamaktadır. Göründüğü kadarıyla onun bu niteliği devam etmişir. Çünkü o bu sözü söylemekte mazur idi. Çünkü bunu söylerken kendisine göre bir yorumda bulunmuştu. Bundan dolayı musannıf (Buhari) bu sözü menkıbeleri arasında zikretmiş bulunmaktadır. Bu sözü söylemeden önce de ayıplanmasını gerektirecek bir hali ortaya çıkmamıştır. Sa'd'ın bu sözü söylemekteki mazereti de açıkça ortadadır. Çünkü onun kanaatine göre Evs'den olan kardeşi, her iki kesim arasında olanlar dolayısıyla Hazrec kabilesinin değerini düşürmek istediğini sanmıştı ve bu sebeple ona cevap yetiştirmişti. * * *Not: İbn Hacer burada Sa'd b. Ubade'nin adını vermiş olmakla birlikte işaret olunan İfk hadisinde bu husus ile ilgili ifadeleri ayrıca zikretmemiştir. Bu hususa dair olan ibarelerin tercümesi şöyledir: \"Ensardan Said b. Muaz ayağa kalkarak, ey Allah'ın Reslılü dedi. Bu hususta ben senin istediğini yapmaya hazırım. Eğer bu kişi Evslilerden ise boynunu vururum, şayet kardeşlerimiz Hazredilerden ise bize emret, senin emrini yerine getiririz. (Aişe) dedi ki: Hazredilerin efendisi olan ve bundan önce de salih bir kişi olan -fakat hamiyet duygusunun tesiri altında kalan. Said b. Ubade ayağa kalkarak, Sa'd (b. Muaz)'a: Allah'a yemin ederim onu öldüremezsin. Buna gücün de yetmez, dedi. Bunun üzerine Useyd b. Hudayr -ki o Said b. Muaz'ın amcasının oğlu idi- ayağa kalktı ve SaId b. Ubade'ye: Allah hakkı için yalan söylüyorsun. Andolsun biz onu öldüreceğiz. Şüphesiz ki sen de münafık bir kimsesin ve münafıklar adına onları savunarak mücadele ediyorsun, dedi. .. \" (Sk. 4750 numaralı hadis). * * *Not bitti",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 3808,
			"arabicnumber": 3808,
			"text": "Mesruk dedi ki: \"Abdullah b. Amr'ın yanında Abdullah b. Mes'ud'un sözü edilince şöyle dedi: Bu adam hala sevdiğim ve seveceğim birisidir. (Çünkü) Nebi Sallallahu Aleyhi ve Sellem'i şöyle buyururken dinledim: Kur'am'ı dört kişiden öğreniniz: Abdullah b. Mes'ud'dan -diyerek önce onu zikretti-, Ebu. Huzeyfe'nin mevltısı (azatlısı) Salim'den, Muaz b. Cebel'den ve Ubeyy b. Kalb'dan",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 3809,
			"arabicnumber": 3809,
			"text": "Enes b. Malik r.a.: \"Nebi Sallallahu Aleyhi ve Sellem Ubeyy'e dedi ki: Şüphesiz Allah bana: لَمْ يَكُنِ الَّذِينَ \"Kafir Kitap ehlinden ve müşriklerden... ayrılmayacaklardı. \"[Beyyine, 1] suresini sana okumamı emretti. Ubey adımı da söyledi mi, dedi. Allah Resulü: Evet deyince, ağladı.\" Bu Hadis 4959, 4960, 4961 numara ile gelecektir. Diğer tahric edenler: Tirmizî, Menakîb; Müslim, Fedail Fethu'l-Bari Açıklaması: \"Ubeyy b. Ka'b\" b. Kays b. Ubeyd b. Zeyd b. Muaviye b. Amr b. Malik b. en-Neccar \"ın menkıbeleri.\" Ensardan olup, Hazredi ve Neccar oğullarındandır. Künyesi Ebu'I-Munzir ve Ebu't-Tufayl'dır. Ensar arasından erken Müslüman olanlardan idi. Akabe'de, Bedir'de ve onlardan sonraki belli başlı olaylarda bulunmuş birisidir. 30 h. yılında vefat ettiği söylendiği gibi başka tarihler de söylenmiştir. (Buhari) bu başlık altında az önce Abdullah b. Mes'ud'un menkıbeleri arasında zikredilmiş bulunan Abdullah b. Amr'ın rivayet ettiği hadisi zikretmektedir: \"Ubeyy: Benim adımı da verdi mi, dedi.\" Yani ismimi açıkça zikretti mi yoksa ashabımdan herhangi birisine bunu oku, diye buyurdu da beni sen mi seçtin? Allah Resulü ona \"evet\" deyince, ya bundan dolayı sevincinden ötürü ağladı ya da yüce Allah'ın bu nimetine karşı şükretmekte zayıf olabilir korkusu ile ve huşu' ile ağladı. Bu hadisten, insanın ilmi ehli olanlardan öğrenmek hususunda -bu kişiler mertebe itibariyle daha aşağıda olsalar dahi- mütevazı davranmanın fazileti anlaşılmaktadır. Kurtubi der ki: Özellikle bu surenin sözkonusu edilmesi -oldukça veciz (özlü) olmakla birlikte- tevhidi, risaleti, ihlası, diğer nebilere indirilmiş bulunan sahifeleri, kitapları kapsaması, namazdan, zekattan, ölümden sonra dirilişten sözetmesi, cennetIiklerle cehennemlikleri açıklaması dolayısıyladır",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 3810,
			"arabicnumber": 3810,
			"text": "Enes r.a.'dan rivayete göre; \"Kur'an-ı Kerim'i Nebi Sallallahu Aleyhi ve Sellem döneminde hepsi de Ensardan olan dört kişi cem' etmişti: Ubeyy, Muaz b. Cebel, Ebe Zeyd ve Zeyd b. Sabit.\" Ben (Katade) Enes'e, Ebe Zeyd kimdir dedim, o da amcalarımdan birisi olur, dedL\" Bu Hadis 1996, 5003, 5004 numara gelecektir. Fethu'l-Bari Açıklaması: \"Zeyd b. Sabit\" b. ed-Oahhak b. Zeyd b. Levezan \"ın menkıbelerL\" Malik b. en-Neccar oğullarından olup vahiy katibidir. Ashab-ı kiramın fakihlerinden birisidir, 45 h. yılında vefat etmiştir. \"Kur'an'ı cem' etmiştL\" Yani ezberden okuyabilecek şekilde hıfzetmiştir, bellemiştir",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 3811,
			"arabicnumber": 3811,
			"text": "Enes r.a. dedi ki: \"Uhud günü insanIar Nebi Sallallahu Aleyhi ve Sellem'in etrafından dağılıp, geri çekildiğinde Ebu TaIha da Nebi Sallallahu Aleyhi ve Sellem'in önünde kaIkanı iIe onu korumaya çalışıyordu. Ebu TaIha iyi ok atan, yayının kirişini oIdukça gererek ok atan birisi idi. O gün elinde iki ya da üç yay kırıIdı. Elinde bir demet ok buIunan adam onunIa birlikte yürürken, bunIarı Ebu TaIha için aç, derdi. Nebi Sallallahu Aleyhi ve Sellem yukarıdan savaşçıIara bakınca Ebu TaIha şöyIe derdi: Ey Allah'ın Nebii, babam, anam sana feda oIsun bakma, attıkIarı okIardan bir ok sana isabet edebilir. Benim göğsüm, senin göğsüne siperdir. AndoIsun o gün Ebu Bekir'in kızı Aişe ve Ümmü SüIeym'in, ayak bilekIerini göreceğim kadar etekIerini yukarıya çekmiş oIdukIarını, omuzIarı üzerine su kırbaIarını taşıdıkIarını ve o suyu kavmin (mücahidIerin) ağzına boşaIttıkIarını, sonra geri dönüp tekrar kırbalarını doIdurdukIarını, tekrar o kırbaIarı getirip, suyunu mücahitlerin ağızIarına boşaIttıkIarını gördüm. Kılıç Ebu TaIha'nın elinden iki ya da üç defa düşmüştü.\" Fethu'l-Bari Açıklaması: \"Ebu TaIha\" Zeyd b. SehI b. el-Esved b. Haram'ın menkıbeIeri.\" Ensardan oIup.Hazrec'li ve Neccar oğullarındandır. Enes'in annesi, Ümmü SüIeym'in kocasıdır. Onun vefatı ile ilgili açıkIamaIar ve vefat tarihi Cihad böIümünde geçmiş buIunmaktadır. Bu hadis ile ilgili diğer açıklamalar yüce Allah'ın izniyle Meğazi bölümünde (4064 nolu hadiste) gelecektir",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 3812,
			"arabicnumber": 3812,
			"text": "Amir b. Said b. Ebi Vakkas, babasından rivayetle dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem'in, Abdullah b. Selam dışında yeryüzünde yürüyen bir kimse hakkında, O cennetliklerdendir, dediğini işitmiş değilim. (Devamla) dedi ki: Şu ayet de onun hakkında inmiştir: \"İsrailoğullarından bir şahit de onun misline tanıklık etmiştir.\" [Ahkaf 10] (Buhari'nin hocası Abdullah b. Yusuf) dedi ki: Malik, ayet mi dedi yoksa hadis olarak mı bunu zikretti, bilmiyorum",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 3813,
			"arabicnumber": 3813,
			"text": "Kays b. Ubad dedi ki: \"Medine mescidinde oturuyarken yüzünde huşu'un izleri görülen bir adam mescide girdi. Bu, cennet ehlinden bir adamdır, dediler. Hafifçe iki rekat namaz kıldı, sonra çıktı. Ben de arkasından giderek dedim ki: Sen mescide girdiğinde bu cennet ehlinden bir adamdır dediler. Şu cevabı verdi: Allah'a yemin ederim kimsenin bilmediği bir şeyi söylememesi gerekir. Ben sana bunun sebebini anlatayım. Nebi Sallallahu Aleyhi ve Sellem döneminde bir rüya gördüm. Ben de o rüyamı ona anlattım. Kendimi bir bahçedeymişim gibi gördüm. -Bahçenin genişliğini, yeşilliğini de zikretti- ortasında alt tarafı yerde, üst tarafı semada olan demirden bir direk vardı. Üst tarafında da bir kulp vardı. Bana, ona çık denildi. Ben, buna gücüm yetmez dedim. Daha sonra yanıma bir hizmetçi geldi, arkamdan elbiselerimi kaldırdı. Ben de o direğe yükseldim ve nihayet onun en üst tarafına kadar çıktım. O kulpu yakaladım. Bana, iyice tutun denildi. Uyandığımda hala o kulp elimde idi. Rüyamı Nebi Sallallahu Aleyhi ve Sellemle anlatınca şöyle buyurdu: O gördüğün bahçe İslamdır, direk İslamın direğidir, o kuIp ise sapasağlam olan kulptur, sen ölene kadar İslam üzere kalacaksın.\" İşte sözü geçen o adam Abdullah b. Selam'dır. Kays b. Ubad'dan, o İbn Selam'dan: (Hizmetçi demek olan) \"Minsafi yerine \"vasıf' lafzını kullanmıştır. Bu Hadis 7010 ve 7014 numara ile gelecektir",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 3814,
			"arabicnumber": 3814,
			"text": "Said b. Ebi Burde, babasından rivayetle dedi ki: \"Medine'ye gittim. Abdullah b. Selam r.a. ile karşılaştım: Benimle gelmez misin? Sana sevik ve hurma yedireceğim ve bir evin içerisine girmiş olacaksın, dedikten sonra şunları ekledi: Sen ribanın yaygın olduğu biryerde bulunuyorsun. Bir kimseden bir alacağın var da o sana bir saman çöpü yahut bir arpa ağırlığı kadar bir şey ya da bir yük alaf hediye edecek olursa şüphesiz ki bu bir ribadır. \" Bu Hadis 7342 numara ile gelecektir. Fethu'l-Bari Açıklaması: \"Abdullah b. Selam\" b. el-Haris \"in menkıbeleri\" Kaynuka oğullarındandır. Bunlar da es-Sıddik Yusuf aleyhissel€ım'ın soyundandıriar. Cahiliye döneminde Abdullah b. Selam'ın adı el-Husayn idi. Nebi sallall€ıhu aleyhi ve sellem ona Abdullah adını vermiştir. Bu rivayeti ibn Mace zikretmektedir. O Ensardan el-Hazreclilerle antlaşması olan birisi idi. Nebi sallall€ıhu aleyhi ve sellem'in Medine'ye ilk geldiği sıralarda islama girmiştir. ileride buna dair açıklamalar Hicretin baş taraflarında gelecektir.(3938 numaralı hadiste) Abdullah b. Selam 43 h. yılında vefat etmiştir. \" ... duymuş değilim.\" Bunun açıklaması zor görülmüştür. Çünkü Nebi sallall€ıhu aleyhi ve sellem, Abdullah b. Selam dışında daha başka kimseler hakkında da cennet ehlinden olduklarını söylemiştir. Sa'd (b. Ebi Vakkası'ın bunu bilmemiş olması da uzak bir ihtimaldir. Ancak buna şöylece cevap verilmiştir: O kendisini tezkiye etmekten hoşlanmamıştır.. Çünkü kendisi de bu şekilde müjdelenen on kişiden birisidir. Ancak buna şöyle cevap verilmiştir: Bu durum başkası hakkında aynı şeyi işitmemiş olmasını gerektirmez. Bana göründüğü kadarıyla şu şekilde cevap verilebilir: O bu sözünü cennetle müjdelenmiş kimselerin vefatından sonra söylemiştir. Çünkü Abdullah b. Selam onlardan sonra yaşamış ve Sa\"d ile Said dışında cennetle müjdelenen on kişiden kimse onunla birlikte o tarihlere kadar yaşamamıştır. Bu da Sa'd b. Ebi Vakkas'ın: \"Yer üzerinde yürüyen\" ifadesinden anlaşılabilir. İshak b. et-Tabba'ın, Malik'ten naklettiği ve Darakutnı'de yer alan rivayette de şöyle denilmektedir: \"Nebi sallAllahu aleyhi ve sellem'in hayatta olup, yeryüzünde yürüyen herhangi bir kimse için \"O cennet ehlindendir dediğini işitmedim.\" İbn Hibban da, Mus'ab b. Sa'd yoluyla babasından bu hadisin vünld sebebini şu lafızIa zikretmektedir: \"Nebi sallAllahu aleyhi ve sellem'i şöyle buyururken dinledim: Şimdi yanınıza cennet ehlinden birisi gelecektir. Hemen Abdullah b. Selam girdi.\" \"Yanıma bir minsaf' yani hizmetçi \"geldL\" \"Sen ribanın yaygın olduğu bir yerdesin\" sözleriyle kastettiği Irak topraklandır. \"Şüphesiz ki o bir ribadır.\" Muhtemelen bu Abdullah b. Selam'ın kendi görüşüdür. Yoksa fukaha ancak şart koşulması halinde bunların riba olacağını söylemişlerdir. Ancak vera' (şüphe ihtimali bulunan şeylerden kaçınmak) bu gibi hediyeleri kabul etmemeyi gerektirir",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 3815,
			"arabicnumber": 3815,
			"text": "Ali b. Ebi Talib r.a. Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu bildirdi: \"Onun kadınlarının (çağdaşlarının) en hayırlıları Meryem'dir. Yine onun kadınlarının (çağdaşlarının) en hayırlıları Hatice'dir",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 3816,
			"arabicnumber": 3816,
			"text": "Aişe r.anha dedi ki: Nebi Sallallahu Aleyhi ve Sellem'in hanımları arasında Hatice'yi kıskandığım kadar hiçbir hanımını kıskanmış değilim. (Halbuki) benimle evlenmeden önce o vefat etmişti. Buna sebep ise onun, (sürekli olarak) adını anmasını duymamdır. Ayrıca Allah ona içi oyulmuş inciden bir köşk ile onu müjdelemesini emretmişti. Andalsun bir koyun keser ve onun arkadaşlarına onlara yetecek kadarını hediye olarak gönderirdi.\" Bu Hadis 3817, 3818, 5229, 6004, 7484 numara ile gelecektir. AÇIKLAMA 1538.SAYFADA",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 3817,
			"arabicnumber": 3817,
			"text": "Aişe r.anha dedi ki:\"Resulullah Sallallahu Aleyhi ve Sellem adını çokça andığından ötürü Hatice'yi kıskandığım kadar hiçbir kadını kıskanmadım. (Aişe devamla) dedi ki: Üstelik benimle ondan üç yıl sonra evlenmiştir. Aziz ve celil olan Rabbi -ya da Cibril aleyhisselam- onu cennette içi oyulmuş inciden bir köşk ile müjdelemesini emir buyurmuştu",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 3818,
			"arabicnumber": 3818,
			"text": "Aişe r.anha dedi ki: Hatice'yi kıskandığım kadar Nebi Sallallahu Aleyhi ve Sellem'in hanımlarından kimseyi kıskanmadım. Üstelik onu görmüş de değilim fakat Nebi Sallallahu Aleyhi ve Sellem onu çokça anıyordu. Kimi zaman bir koyun keser, sonra da onu parçalar, arkasından onu Hatice'nin arkadaşlarına gönderirdi. Bazen ona: Sanki dünya da Hatice'den başka kadın yokmuş, derdim de, şöyle derdi: O şöyle idi, böyle idi. Üstelik benim ondan çocuklarım oldu",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 3819,
			"arabicnumber": 3819,
			"text": "İsmail dedi ki: \"Abdullah b. Ebi Evfa r.a.'a dedim ki: Nebi Sallallahu Aleyhi ve Sellem Hatice'yi müjdeledi mi? O şöyle buyurdu: Evet (onu cennette) içinde gürültü, patırtı ve yorgunluk olmayan, içi oyulmuş inciden bir köşk ile müjdeledi",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 3820,
			"arabicnumber": 3820,
			"text": "Ebu Hureyre r.a. dedi ki: \"Cibril, Nebi Sallallahu Aleyhi ve Sellem'e gelerek dedi ki: Ey Allah'ın Resulü, işte bu Hatice'dir. Beraberinde içinde yemek yahut yiyecek ya da içecek bulunan bir kap ile geliyor. Yanına geldiği vakit sen ona Rabbinden ve benden selam söyle ve ona içinde gürültünün, patırtının, yorgunluğun, argınlığın bulunmadığı, içi oyulmuş inciden bir köşkü de müjdele.\" Bu Hadis 7497 numara ile gelecektir. AÇIKLAMA 1538.SAYFADA",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 3821,
			"arabicnumber": 3821,
			"text": "Aişe r.anha dedi ki: \"-Hatice'nin kızkardeşi- Huveylid kızı Hale Resulullah Sallallahu Aleyhi ve Sellem'in huzuruna girmek üzere izin istedi. Bu ona Hatice'nin izin isteyişi gibi geldi. Bu sebeple adeta dehşete kapıldı. Allah'ım, Hale bu, dedi. (Aişe) dedi ki: Ben de kıskandım ve dedim ki: Geçmiş zamanda ölüp gitmiş, ağzının etrafı kırmızı, Kureyş'in koca karılarından bir kocakarının nesini hatırlıyorsun ki? Üstelik Allah sana onun yerine ondan hayırlısını vermiş bulunuyor.\" Fethu'l-Bari Açıklaması: \"Hatice\" Nebi efendimizin ilk olarak evlendiği kadındır. Huveylid'in kızı olup, Huveylid'in babası, Esed b. Abdu'l-Uzza b. Kusay'dır. Nesebi Nebi Sallallahu Aleyhi ve Sellem ile birlikte Kusay'da bir araya gelmektedir. Neseb itibariyle hanımları arasında kendisine en yakın olanı odur. Ümmü Habibe dışında ondan başka Kusay'ın soyundan gelen bir kadınla da evlenmemiştir. Hatice ile cumhurun görüşüne göre 25 yaşında iken evlenmiştir. Hatice'yi onunla babası Huveylid evlendirmiştir. Nebiden önce Ebu Hale b. enNebbaş b. ez-Zürare et-Temimı ile evliydi. Bu da Abdu'd-Oarr oğulları ile antlaşmalı idi. Nebi Sallallahu Aleyhi ve Sellem, Hatice ile evlenmeden önce onun malı ile Şam'a ticari ortak olarak yolculuk yapmıştı. Hatice'nin kölesi Meysere Nebide gördüğü haller dolayısıyla Hatice onunla evlenmeyi arzuladı. ez-Zubeyr der ki: Hatice cahiliye döneminde et-Tahire diye çağırılırdı. Sahih kabul edilen görüşe göre Nebi Sallallahu Aleyhi ve Sellem'e nübuvvet verildikten on yıl sonra Ramazan ayında vefat etmiştir. Böylece -sahih görüşe göre- Nebi Sallallahu Aleyhi ve Sellem ile birlikte onbeş yıl kalmış olmaktadır. Bundan önce Vahyin başlangıcı bölümündeki başlıklarda Nebi sallallah u aleyhi ve sellem'i ilk olarak tasdik ettiğine ve onun bu işte sebat gösterdiğine dair açıklamalar geçmiş bulunmaktadır ki, bu da onun yakıninin ne kadar güçlü olduğunu, oldukça akıllı ve sağlam kararlı olduğunu göstermektedir. Şüphesiz o, -tercih edilen görüşe göre- hanımlarının en faziletlisi idi. Daha önce Nebiler ile ilgili hadisler bölümünde Meryem sözkonusu edilmiş ve buna dair bazı açıklamalar da geçmiş bulunmaktadır. 3815- \"Onun kadınlarının en hayırlısı Meryem'dir, onun kadınlarının en hayırlısı Hatice'dir.\" Benim daha kuwetli gördüğüm görüşe göre \"onun kadınlarının en hayırlısı\" ifadesi mukaddem bir haber olup, zamir de Meryem'e aittir. Şöyle buyurmuş gibidir: Meryem onun yani ona çağdaş olan kadınların en hayırlısıdır. Hatice hakkında da aynı şey sözkonusudur. Diğer taraftan şarihlerin pek çoğu da kastedilenin çağdaşı olan kadınlar olduğunu da söylemişlerdir. Nesaı'nin sahih bir sened ile rivayet ettiği, Hakim'in de zikrettiği İbn Abbas yoluyla gelen merfu hadiste şöyle denilmektedir: \"Cennet ehli kadınlarının en faziletiileri Hatice, Fatıma, Meryem ve Asiyeldir.\" Bu, tevil edilme ihtimali bulunmayan apaçık bir nastır. 3816- \" ... Nebi s.a.v.'in hanımlarından kimseyi (bu kadar) kıskanmadım.\" Hadiste (kumalar arası) kıskançlığın olduğu kabul edilmektedir. Bunun reddedilebilecek bir şeyolmadığı, ayrıca daha alt mertebede olanlar bir yana üstün fazilete sahip kadınlar arasında bile görülebileceği tespit edilmektedir. Aynı şekilde Aişe radıyAllahu anha Nebi sallAllahu aıeyhi ve sellem'in diğer hanımlarını da kıskanırdl. Fakat Hatice'yi daha çok kıskanırdl. Bunun sebebini de açıklamış ve Nebi sallAllahu aleyhi ve sellem'in onu çok anmasının buna sebep olduğunu belirtmiştir. 3818- \"O şöyle idi, böyle idi.\" Yani o faziletli bir kadın idi, akıllı idi ve buna benzer. \"Hem benim ondan çocuklarım oldu.\" İbrahim dışında Nebi sallAllahu aleyhi ve sellem'in bütün çocukları Hatice'dendir. İbrahim cariyesi Mariye'den doğmuştu. Nebi sallAllahu aleyhi ve sellem'in Hatice'den doğduğu ittifakla kabul edilmiş çocukları şunlardır: Kendisi ile künyelendiği el-Kasım -Nebiliğin verilmesinden önce ya da sonra küçük yaşta ölmüştür.- dört kızı olan Zeyneb, sonra Rukayye, sonra Ümmü Gülsum, sonra da Fatıma. Denildiğine göre Ümmü Gülsum, Fatıma'dan daha küçük idi. Abdullah ise Nebiliğin verilmesinden sonra doğmuştur. İttifakla kabul edildiğine göre erkekler küçük yaşta vefat etmiştir. Nebi sallAllahu aleyhi ve sellem'in dünya da iken Hatice'ye verdiği mükafatlardan birisi de o hayatta olduğu sürece başkasıyla evlenmemiş olmasıdır. Müslim'in, ez-Zühri'den, onun Urve'den, onun Aişe'den diye rivayet ettiğine göre Aişe şöyle demiştir: \"Nebi s.a.v. Hatice ölünceye kadar başkasıyla evlenmemiştir.\" Bu, haberlere dair ilim sahibi olan kimseler arasında görüş ayrılığı bulunmayan hususlardan birisidir. Hadiste Hatice'nin Nebi nezdindeki değerinin büyüklüğüne,faziletinin oldukça fazla olduğuna delil vardır. Çünkü o kendisinden başka bir hanım ile evlenmesine ihtiyaç bırakmamıştır. Onunla birlikte kalmak hususunda, başkalarının ortaklaşa sahip oldukları sürenin iki katı kadar bir süre boyunca o tek başına onunla birlikte kalmıştır. Çünkü Nebi sallallfıhu aleyhi ve sellem Hatice ile evlendikten sonra 38 yıl yaşamıştır. Hatice bu 38 yılın 25 yılında tek başına Nebi ile birlikte yaşamıştır. Bu ise yaklaşık toplam sürenin üçte ikisi eder. Sürenin uzunluğuna rağmen, onun kalbine kıskançlığın girmesine sebep teşkil edecek bir tutumdan, muhtemelen kendisini dahi rahatsız edebilecek kumaların tartışmalarından onu uzak tutmuştur. İşte bu, ondan başka kimsenin onunla paylaşmadığı bir faziletidir. Hatice'nin sahip olduğu özelliklerden birisi de bu ümmetin hanımları arasında herkesten önce iman etmiş olmasıdır. Böylelikle o kendisinden sonra iman eden bütün hanımlara bu yolu açmış oldu. Bu sebeple onların ecirlerinin bir misli de ona verilecektir. Çünkü \"kim güzel bir yol açarsa ... \" hadisinde sabit olan budur. Bu özellikte erkekler arasında Ebu Bekir es-Sıddık onunla ortaktır. Bu sebeple onların aldıkları sevabın ne kadar olduğunu yüce Allah'tan başkası bilemez. Nevevı der ki: Bu hadislerde güzel geçinmeye, sevginin hakkını korumaya, ölmüş ya da hayatta bulunan arkadaş ın ve birlikte yaşanılan kimsenin hatırasına saygı göstermek gerektiği, o arkadaş ın tanıdıklarına ikramda bulunmanın gereği de dile getirilmektedir. 3819- \"İçi oyulmuş inciden\" İbnu't-Tın der ki: Bundan maksat pek büyük bir köşk (saray) gibi oldukça geniş, içi oyulmuş bir incidir. es-Süheyll der ki: Beyt (köşk)in sözkonusu edilmesinin ince bir anlamı vardır. Çünkü o Nebilikten önce bir ev hanımı idi. Daha sonra İslam gelince de tek başına bir ev hanımı oldu. Nebi sallallfıhu aıeyhi ve sellem'in Nebi olarak gönderildiği ilk günden itibaren yeryüzünde onun evi dışında İslam evi yoktu. Bu ise yine ondan başka kimsenin kendisiyle paylaşmadığı bir fazilettir. (es-Süheyll devamla) der ki: Yapılan bir fiilin karşılığı ondan daha üstün olsa bile çoğunlukla aynı lafızIa sözkonusu edilir. Bundan dolayı hadiste köşk, saray lafzı değil de beyt (ev) lafzı kullanılmıştır. es-Süheyll'nin ifadeleri burada sona ermektedir. \"Beyt\" lafzının zikredilmesinin bir başka anlamı daha vardır. Çünkü Nebi sallallfıhu aıeyhi ve sellem'in Ehl-i Beyti'nin vardığı yer odur. Nitekim yüce Allah'ın: \"Ey Ehl-i Bey tt Allah sizden ancak kir i giderip, tam anlamıyla sizi temizlemek ister.\"[Ahzab,33] buyruğunun tefsiri ile ilgili olarak sabit olduğuna göre Ümmü Seleme şöyle demiştir: \"Bu ayet nazil olunca Nebi sallallfıhu aleyhi ve sellem Fatıma'yı, Ali'yi, el-Hasan'ı ve el-Hüseyn'i çağırdı. Onların üzerini bir elbise ile örterek: Allah'ım, bunlar benim Ehl-i Beytimdir, demiştir.\" Bu hadisi Tirmizi ve başkaları rivayet etmiştir. Bütün bu Ehl-i Beyt'in vardığı yer ise Hatice r.a.a'dır. Çünkü el-Hasan ile el-Hüseyn Fatıma'dandır. Fatıma da onun kızıdır. Ali de Hatice'nin evinde küçük yaştan beri büyümüş, onun vefatından sonra da kızıyla evlenmiştir. Böylelikle Beyt-i Nebevi'nin ehlinin başkasına değil, yalnız Hatice'ye rad olduğu da ortaya çıkmış olmaktadır. \"Gürültünün, patırtının, yorgunluğu n argınlığın olmadığ!.\" Buradaki \"es-sahab (gürültü patırtı)\" yüksek sesle bağırmak, yüksek sesle tartışmak demektir. \"en-Nasab\" de yorgunluk argınlık demektir. 3820- \"Ona Rabbinden ve benden selam söyle.\" Nesaı'de Enes'ten şöyle dediği rivayet edilmektedir: \"Cibril, Nebi Sallallahu Aleyhi ve Sellem'e dedi ki: Şüphesiz Allah Hatice'ye selam söylüyor.\" Yani ona bunu bildir. \"Bunun üzerine Hatice: Şüphesiz Allah es-Selamdır. Cibril'e de selam olsun, sana da ey Allah'ın Reso.lü. Allah'ın rahmeti ve bereketleri de.\" İlim adamları der ki: Bu olayda Hatice'nin oldukça fakih (ince anlayışlı) oluşuna delil vardır. Çünkü o teşehhüdde bazı sahabilerin dedikleri \"es-selam u alallah\" şeklinde karşılık vermemiştir. Nebi sallallahu aleyhi ve selle m de onların böyle demelerini yasaklamış ve: \"Şüphesiz Allah es-Selam'ın kendisidir. Bunun yerine et-tahiyyatu lillahi deyiniz\" diye buyurmuştur. Hatice anlayışının doğruluğu sebebiyle yaratılmışların selamının alındığı gibi, yüce Allah'a da öylece karşılık verilmeyeceğini kavrayıvermişti. Çünkü \"es-Selam\" Allah'ın isimlerinden birisidir. Aynı zamanda bu, esenlik için bir dua mahiyetindedir. Her iki anlamı ile de Allah'a karşılık verilmesi uygun değildir. Sanki şöyle cevap vermiş gibidir: es-Selam onun adı iken esenlik (selamet) ondan istenir ve ondan husule geliyor iken nasıl \"aleyhisselam\" diyebilirim ki! Bu hadisten anlaşıldığına göre şanı yüce Allah'a ancak övgülerde bulunmak yakışır. Bundan dolayı o \"es-selam u aleyhi\" diyecek yerde yüce Allah'a senada bulunmuştur. Daha sonra Allah'a yakışan ile başkasına yakışan ifadeleri birbirinden ayırt etmiş ve farklı tabirler kullanarak: \"Cibril'e de selam olsun\" dedikten sonra \"sana da selam olsun\" demiştir. Bundan anlaşıldığına göre selam gönderenin de, selam getirenin de selamı alınarak karşılık verilir. 3821- \"Hatice'nin izin istemesini hatırlad!.\" Hale'nin sesinin kızkardeşinin sesine benzemesi dolayısıyla izin isteyişinin niteliklerini hatırladı, bu yolla da Hatice'yi hatırlamış oldu. Hadisten anlaşıldığına göre bir şeyi seven bir kimse onun sevdiklerini de, ona benzeyenleri de, onunla ilgili olanları da sever. \"Ağzının etrafı kırmızı\" ilk anda hatıra gelen ağzın iç tarafıdır. O bu sözleri ile dişlerinin dökülmüş olduğunu ve ağzının içinde diş eti ve diğer kırmızı etlerin dışında bir şey kalmamış olduğunu kinayeli olarak anlatmış olmaktadır. Nevevı ve başkaları bunu ifade etmişlerdir. \"Allah sana onun yerine ondan hayırlısını vermiş bulunuyor.\" Vakıa şu ki, Nebi Sallallahu Aleyhi ve Sellem onun bu sözlerine karşılık vermiştir. Ebu Nedh'in Aişe'den yoluyla gelen, Ahmed ve Taberani'de yer alan bu olayı anlatan rivayette şöyle denilmektedir: \"Aişe dedi ki: Ben, Allah sana yaşlı birisinin yerine yaşı küçük birisini vermiş bulunuyor dedim. O buna kızınca ben de seni hak ile gönderene yemin ederim ki bundan sonra ondan ancak hayır ile sözedeceğim, dedim",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 3822,
			"arabicnumber": 3822,
			"text": "Kays şöyle demiştir: Ben onu şöyle derken işittim: Cerîr ibn Abdillah (radıyallahü anh): Ben islâm'a girdiğimden beri Rasûlüllah beni huzuruna girmekten men' etmedi ve beni her gördüğünde muhakkak gülümsedi, demiştir",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 3823,
			"arabicnumber": 3823,
			"text": "Cerir b. Abdullah r.a. dedi ki: \"İslam'a girdiğimden beri Resulullah Sallallahu Aleyhi ve Sellem benden saklanmadı ve beni ne zaman gördüyse mutlaka güldü.\" [-3823-] Cerir b. Abdullah dedi ki: \"Cahiliye döneminde Zulhalasa diye anılan bir ev vardı. Ona el-Ka'betu'Piemamiyye yahut el-Ka'betu'ş-Şamiyye denilirdi. Resulullah Sallallahu Aleyhi ve Sellem bana: Zulhalasa'dan yana beni rahata kavuşturur musun, dedi. (Cerir) dedi ki: Ben de Ahneslilerden yüz elli atlı ile onun üzerine gittim. (Dedi ki): Onu kırdık, yanında kimi bulduysak öldürdük. Daha sonra Nebiin yanına geldik. Ona olanı haber verdik. O da hem bize, hem de Ahnes'e dua etti.\" Fethu'l-Bari Açıklaması: \"Cerir b. Abdullah\" b. Cabir b. Malik \"el-Becel!\" Enmar b. Eraş oğullarındandır. Bunlar anneleri Becile'ye nispet edilmişlerdir. Meşhur olan künyesi Ebu Amr'dır. Müslüman oluşu (tarihinde) görüş ayrılığı vardır. Sahih olan onun Elçiler yılı (senetu'l-vüfUd) diye bilinen 9 h. yılında Müslüman olduğudur. Cerir 50 yılında vefat etmiştir. Daha sonra vefat ettiği de söylenmiştir. \"Resulullah Sallallahu Aleyhi ve Sellem benden saklanmadı.\" Yani eğer evinde bulunuyor ise ve ben yanına girmek için izin istedim ise yanına girmeme engel olmadı. \"Ve beni ne zaman gördüyse hep güldü.\" el-Humeydi'nin İsmail'den rivayetinde: \"Mutlaka yüzüme gülümserdi\" şeklindedir. Ahmed ve İbn Hibban'ın ise el-Muğire b. Şubeyl'den, onun Cerir'den rivayetine göre Cerir şöyle demiştir: \"Medine'ye yaklaşınca devemi çöktürdüm. Sonra hullemi giyinip (Medine'ye) girdim. İnsanlar bana bakıp duruyordu. Ben, Resulullah sallallahu aleyhi ve selle m beni sözkonusu etti mi, diye sordum. Evet, senden en güzel şekilde bahsetti ve şunları söyledi dediler: Yanınıza yüzünde melek siması bulunan şu Yemenlilerin en hayırlılarından birisi girecektir",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 3824,
			"arabicnumber": 3824,
			"text": "Aişe r.anha dedi ki: \"Uhud gününde müşrikler açık bir şekilde bozguna uğradılar. Bunun üzerine İblis, ey Allah'ın kulları, arkanızda bulunanlara bakınız, diye feryat etti. Bunun üzerine önde olanlar arkada kalanların yanına geri döndüler ve geride kalanlarla birlikte çarpıştılar. Huzeyfe bir baktı, babasını görüverdi. Ey Allah'ın kulları babam, babam diye bağırdı. (Aişe) dedi ki: Allah'a yemin ederim onlar onu öldürünceye kadar birbirlerinden ayrılmadılar. Bunun üzerine Huzeyfe, Allah size mağfiret etsin, dedi.\" (Ravi Hişam) dedi ki: Babam (Urve): Allah'a yemin ederim aziz ve celil olan Allah'ın huzuruna kavuşuncaya kadar bundan dolayı Huzeyfe'de hep bir hayır kalıntısı varlığını sürdürüp gitti, dedi. Fethu'l-Bari Açıklaması: \"Huzeyfe b. el-Yeman el-Absı\" el-Yeman'ın adı Hısn b. Cabir'dir. Onun da, babasının da sahabiliği vardır. \"Bozguna uğrayınca\" ile \"sizin arkanızdakiler\" sözü, arkanızdakilerin yanına dönünüz yahut da arkanızdakilerden sakınınız ya da arkanızdakilere yardımcı olunuz demektir. \"Ayrılmadılar\" yani savaştan ayrılmadılar ve biri diğerinden uzaklaşmadı. İleride bu olaya dair geri kalan açıklamalar Meğazi bölümünde gelecektir. \"Bundan dolayı Huzeyfe'de bir hayır kalıntısı devam ettL\" Bu sözden dolayı ya da bunun sebebiyle demektir. Bundan da şu sonuç çıkar: Bir hayır yapmanın bereketi hayatı boyunca o hayrı işleyene de döner",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 3825,
			"arabicnumber": 3825,
			"text": "Aişe r.anha dedi ki: \"Utbe'nin kızı Hind gelerek, ey Allah'ın Resulü dedi. Yeryüzünde bulunan bütün hane halkları arasında senin hane halkından daha çok zelil olmalarını istediğim hiçbir hane halkı yoktu. Şimdi ise artık bugün yeryüzündeki bütün hane halkları arasında senin hane halkından daha çok aziz olmalarını istediğim kimse yoktur. (Allah Reso.ıü): Nefsim elinde olana yemin ederim ki yine de, diye buyurdu. Hind dedi ki: Ey Allah'ın Resulü, Ebu Süfyan çok eli sıkı birisidir. Ona ait olan maldan çoluk çocuğumuza bir şeyler yedirmemde benim için bir sakınca olur mu? Allah Resulü: Ma’ruf ile olmak şartıyla olmayacağı kanaatindeyim.\" Fethu'l-Bari Açıklaması: \"Hind bint Utbe\" Hind'in babası, Utbe b. Rabia b. Abdi ŞemsIdir. Hind, Muaviye'nin annesidir. İleride Meğazi bölümünde geleceği üzere babası Bedir'de öldürülmüştür. Kocası Ebu Süfyan ile birlikte Uhud'a katılmıştır. Nebi Sallallahu Aleyhi ve Sellem'in amcası Hamza'nın öldürülmesini teşvik etmiştir. Çünkü Hamza, Hind'in amcası Şeybe'yi öldürmüş, babası Utbe'nin öldürülmesine de iştirak etmişti. Hamza'yı ileride Vahşi ile ilgili hadiste açıklanacağı üzere Vahşi b. Harb öldürmüştür. Daha sonra Hind, Mekke'nin fethedildiği günü Müslüman olmuştur. Kadınların akıllılarından idi. Ebu Süfyan'dan önce Mahzumoğullarından el-Fakih b. el-Muğire ile evli idi. Sonra meydana gelen bir olay dolayısıyla onu boşamıştı. Ebu Süfyan'ın onunla evlendikten sonra ondan çocukları oldu. Kadınlar ile bey'at1eştiğinde hırsızlık yapmayacaklarını, zina etmeyeceklerini şart koştuğunda Nebie: \"Hür kadın hiç zina eder mi?\" diyen odur. Hind, Ömer radıyalIahu anh'ın halifeliği döneminde vefat etmiştir. \"Hiba (tercümede ev)\" kıldan yahut yünden yapılmış çadır demek olmakla birlikte, daha sonraları nasılolursa olsun ev için kullanılır olmuştur. \"Nefsim elinde olana yemin ederim ki, yine de ... buyurdu.\" İbnu't-Tın der ki: Bu sözler ile Hind'in zikrettiklerini tasdik etmektedir. Sanki İbnu't-Tın'in görüşüne göre anlam şudur: Aynı şekilde ben de sana karşı bu durumdayım. Ancak iki taraflı nefret ve sevgi cihetiyle onun bu şekildeki anlayışına karşı çıkılmıştır. Çünkü müşrikler arasında Hind'den de, onun aile halkından da Nebi salIalIahu aleyhi ve selIem'e daha çok eziyet edenler vardı. Hind Müslüman olduktan sonra da Müslümanlar arasında Nebi salIalIahu aleyhi ve selIem'in ondan da, aile halkından da daha çok sevdiği kimseler vardı. Dolayısıyla bu haberin zahirine göre açıklanmasına imkan yoktur. Başkası ise şöyle demektedir: Nebi efendimizin \"yine de\" diye buyurmasının anlamı şudur: İman senin kalbinde daha çok yer ettikçe, senin sevgin . daha da artacaktır ve sözü geçen nefretinden hiçbir izi kalmayıncaya kadar tamamıyla vazgeçeceksin. \"Şüphesiz Ebu Süfyan eli sıkı birisidir.\" İleride buna dair açıklamalar Nafakalar bölümünde (5364 nolu hadiste) inşallah gelecektir. Hadisten Çıkarılan Sonuçlar 1-Hadiste Hind'in oldukça akıllı olduğuna, konuşmada güzel bir üslup kullandığına da delalet vardır. 2-Hadisten anlaşıldığına göre ihtiyaç sahibi olan bir kimsenin özelolarak konuşmaya başlamadan, eğer kendisi ile konuştuğu kimsenin kalbinde ona karşı menfi bir duygu bulunuyor ise, önce mazeretini beyan etmesinin müstehap olduğuna, özür beyan edenin özür beyan ettiği kimse tarafından doğrulanmasını daha bir sağlamak amacıyla önden bir takım şeyler söylemesinin de müstehap olduğuna delil vardır. Çünkü Hind önce daha önceki kin ve nefretini itiraf etti. Böylelikle ileri sürdüğü sevgi iddiasında doğru söylediğinin bilinmesini istedi. 3-Hind, Nebi Sallallahu Aleyhi ve Sellem'in hanımlarının anneleri konumunda idi. Çünkü onun eşlerinden birisi olan Ümmü Habibe kocası Ebu Süfyan'ın kızıdır",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 3826,
			"arabicnumber": 3826,
			"text": "Abdullah b. Ömer r.a.'dan rivayete göre \"Nebi Sallallahu Aleyhi ve Sellem Beldah denilen yerin alt taraflarında kendisine vahiy nazil olmadan önce Zeyd b. Amr b. Nufeyl ile karşılaştı. Nebi Sallallahu Aleyhi ve Sellem'in önüne bir sofra serildi. Ondan yemek istemedi. Daha sonra Zeyd dedi ki: Ben sizlerin putlarınız üzere kestiklerinizden yemem. Ben ancak üzerine Allah'ın adı anılarak kesilenleri yerim. Şüphesiz Zeyd b. Amr Kureyşlilerin kestiği hayvanları ayıplar ve şöyle derdi: Koyunu yaratan Allah'tır. Ona sema'dan su indirdi, yerden de ona ot bitirdi. Daha sonra sizler onu Allah'tan başkası adına kesiyorsunuz. Böylece onların yaptıklarını reddediyar ve (vebali) pek büyük bir iş yaptıkları kanaatinde olduğunu açığa vurmuş oluyordu.\" Bu Hadis 5499 numara ile gelecektir",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 3827,
			"arabicnumber": 3827,
			"text": "İbn Ömer'den rivayete göre Zeyd b. Amr b. Nufeyl doğru dini soruşturmak ve ona tabi olmak üzere Şam'a çıkıp gitti. Yahudilerden bir alim ile karşılaştı. Ona dinlerine dair bir şeyler sordu ve, belki sizin dininize girebilirim, bana anlat, dedi. Yahudi alimi, Allah'ın gazabından payına düşeni almadığın sürece sen bizim dinimiz üzere olamazsın, dedi. Zeyd, ben ancak Allah'ın gazabından kaçmaya çalışıyorum. Ben ebediyyen, gücüm yettiği sürece Allah'ın gazabından hiçbir şey yüklenmek istemiyorum. Peki, sen bana başkasını gösterebilir misin, dedi. Yahudi alimi, bildiğim kadarıyla bu ancak hanif (dini) olabilir, dedi. Zeyd, Hanif nedir, diye sordu. Yahudi, İbrahim'in dini, dedi. O Yahudi de değildi, Nasrani de değildi, Allah'tan başkasına ibadet de etmiyordu. Zeyd çıkıp gitti. Hristiyanlardan bir alime rastladı. Ona da benzeri şeyleri zikretti. Hristiyan alimi ona, Allah'ın lanetinden payına düşeni almadığın sürece bizim dinimiz üzere olamazsın, dedi. Zeyd, ben ise ancak Allah'ın lanetinden kaçıyorum. Gücüm yettiği sürece Allah'ın lanetinden de, onun gazabından da hiçbir şey yüklenmek istemiyorum. Sen bana başkasını gösterebilir misin, dedi. Hristiyan alimi, bildiğim kadarıyla bu ancak hanif'lik olabilir, dedi. Zeyd, Hanif ne demek, diye sordu. Hristiyan, İbrahim'in dinidir, dedi. O Yahudi de değildi, hristiyan da değildi. Allah'tan başkasına da ibadet etmezdi. Zeyd, onların İbrahim aleyhisselam hakkında söylediklerini görünce yanlarından çıkıp ayrıldıktan sonra ellerini kaldırarak dua etti: Allah'ım, İbrahim'in dini üzere olduğuma seni şahit tutuyorum",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 3828,
			"arabicnumber": 3828,
			"text": "Ebu Bekir r.a.'ın kızı Esma r.anha, dedi ki: \"Ben Zeyd b. Amr b. Nufeyl'i ayakta sırtını Ka'be'ye vermiş olarak şöyle derken gördüm: Ey Kureyş topluluğu! Allah'a yemin ederim, aranızda benim dışımda kimse İbrahim'in dini üzere değildir. O mev'udeyi (diri diri gömülmek istenen kızı) ölümden kurtarıyor, kızını öldürmek istediği takdirde adama onu öldürme, onun geçimini senin yerine ben karşılayacağım, diyordu. Sonra o kızı ondan alırdı. Büyüyünce babasına, arzu edersen onu sana geri verebilirim, dilersen onun ihtiyaçlarını senin yerine karşılamaya devam edebilirim, derdi.\" Fethu'l-Bari Açıklaması: \"Zeyd b. Amr b. Nufeyl hadisi\" Bu Ömer b. el-Hattab b. Nufeyl'in amcasının oğludur. Aşere-i mübeşşere'den birisi olan Said b. Zeyd'in babasıdır. Tevhidi bulmak isteyip, putları bir kenara iten, şirkten uzak duran kimselerden idi. Fakat Nebi sallallShu aleyhi ve sellem'e nübuwet verilmeden önce vefat etmişti. el-Bezzar ve Taberanl'nin rivayet ettikleri bu hadiste Said b. Zeyd şunları söylemektedir: \"Zeyd b. Amr ile Varaka b. Nevfel hak dini aramak üzere çıktılar. Nihayet Şam'a geldiler. Varaka hristiyanlığı kabul etti, fakat Zeyd onu kabul etmedi. Musul'a gitti. Orada bir rahip ile karşılaştı, rahip ona hristiyanlığı teklif etti, yine kabul etmedi.\" Bundan sonra da hadisi ona dair tercümede (başlıkta) yer alan İbn Ömer hadisine yakın bir şekilde zikretti. Bu rivayetinde şunlar da yer almaktadır: \"Said b. Zeyd dedi ki: Ben ve Ömer Resulullah Sallallahu Aleyhi ve Sellem'e Zeyd'in durumu hakkında sordum da şöyle buyurdu: Allah ona mağfiret etsin, ona rahmetini ihsan etsin. Şüphesiz ki o İbrahim'in dini üzere ölmüştür.\" \"Hak dini soruşturmak üzere çıktı.\" Tevhid dinini araştırmak üzere çıktı. \"Gücüm yettiği takdirde\" yani benim böyle bir şeyi yüklenmeme kudretim var ise. Bir rivayette \"ene: ben\" lafzında nun, böyle bir işin uzak bir ihtimal olduğu anlamını ifade edecek şekilde şeddeli gelmiştir. Allah'ın gazabından maksat ise onun ikabının (cezasının) ulaştırılmasıdır. \"Yanlarından ayrılınca\" yani onların topraklarının dışına çıkınca. \"Diri diri gömülmek istenen kızı ölümden kurtarıyordu.\" İfadede mecaz vardır. Onu ölümden kurtarmaktan kasıt, hayatta kalmasını sağlamak, diri diri gömülmesini önlemektir. Hadiste de bunu nasıl yaptığı açıklanmış bulunmaktadır. İbn Ebi'z-Zinad'ın rivayetinde: \"O öldürülmesin diye diri diri gömülmek istenen kızı fidye vererek kurtarırdı.\" Cahiliye dönemi insanları hayatta oldukları halde kız çocuklarını gömerlerdi. Denildiğine göre bunun asıl sebebi, onların iftetleri adına korkulması idi. Çünkü bazı Araplar bir başkasının kızını esir almış ve ona cariye muamelesi yapmıştı. Babası fidye vererek onu kurtarmak isteyince kız da kendisini esir alanı tercih etmişti. Bunun üzerine babası da doğacak her bir kız çocuğunu öldüreceğine dair yemin etti. Diğerleri de bu hususta onun ardından gittiler. Ben bunu \"el-Evail\" adlı eserimde uzun uzadıya açıklamış bulunuyorum. Aralarından bu işi yapanların çoğunluğu ise yüce Allah'ın şu buyruğunda olduğu gibi açlık ve fakirlik endişesi ile yapıyordu: \"Yoksulluk endişesiyle çocuklarınızı öldürmeyin. Çünkü sizin de, onların da rızkını biz veririz. \"[En'am, 151] Zeyd'in kıssası da bu ikinci hususa delil teşkil etmektedir. Her iki hususun da bu konuda birer sebep olma ihtimali de vardır",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 3829,
			"arabicnumber": 3829,
			"text": "Cabir b. Abdullah r.a. dedi ki: \"Ka'be bina edilince Nebi Sallallahu Aleyhi ve Sellem ile Abbas taş taşımaya gittiler. Abbas, Nebi Sallallahu Aleyhi ve Sellemle, İzarını (belden aşağısını örten elbiseni) boynun üzerine koy, seni taşlardan korusun, dedi. Nebi hemen yere yıkıldı ve gözleri göğe doğru bakmaya başladı. Daha sonra ayılınca izarım, izarım dedi ve üzerine izarını bağladı",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 3830,
			"arabicnumber": 3830,
			"text": "Amr b. Dinar ile Ubeydullah b. Ebi Zeyd dediler ki: \"Nebi Sallallahu Aleyhi ve Sellem'in döneminde Beyt'in etrafında bir çevre duvarı yoktu. Onlar Beyt'in etrafında namaz kılıyorlardı. Nihayet Ömer (halifeliği döneminde) etrafında bir duvar bina etti.\" Ubeydullah: \"Duvarları kısa idi, dedi. Onu (duvarlarını yüksek tutarak) İbnu'z-Zubeyr bina etti.\" Fethu'l-Bari Açıklaması: \"Ka'be'nin\" Nebi sallallahu aleyhi ve sellem'in hayatında ve ona Nebilik verilmeden önce Kureyş tarafından \"bina edilmesi.\" Bundan önce İbrahim sallalIflhu aleyhi ve sellem'in, -Kureyşiiler tarafından bina edilmesinden önce- Ka'be'yi bina etmesi ile alakah açıklamalar geçmiş bulunduğu gibi, Abdullah b. ez-Zubeyr'in de İslam geldikten sonra Ka'be'yi bina etmesiyle ilgili açıklamalar da geçmiş bulunmaktadır. İbn İshak'ın ve başkalarının naklettiklerine göre Kureyş Ka'be'yi bina ettiğinde Nebi sallallahu aleyhi ve sellem 25 yaşında idi. İshak b. RahCye (Rahaveyh)'in, Halid b. Ar'ara yoluyla AIi'den İbrahim aleyhisselflm'ın Beytullahlı bina etmesi ile ilgili olarak şunları söylediğini rivayet etmektedir: \"Aradan uzun zaman geçti ve Ka'be'nin binası yıkıldı. Bunun üzerine amalika onu bina etti. Yine aradan bir zaman geçti, yine binası yıkıldı, bu sefer Cürhümlüler onu bina etti. Aradan bir zaman daha geçti, yine yıkıldı. Bu sefer onu Kureyş bina etti. Resulullah sallallahu aleyhi ve sellem de o sırada genç idi. Hacer-i Esved'i yerine koymak istediklerinde aralarında anlaşmazlık çıktı. Bunun üzerine, bu yoldan çıkacak olan ilk kişi aramızda hakem olsun, dediler. O yoldan ilk çıkıp gelen kişi Nebi sallallflhu aleyhi ve sellem oldu. O da aralarında taşı bir örtü üzerine koyup, her kabileden bir adam tarafından da kaldırılması şeklinde hüküm verdi",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 3831,
			"arabicnumber": 3831,
			"text": "Aişe r.anha dedi ki: \"Cahiliye döneminde Kureyş Aşure günü oruç tutardı. Nebi Sallallahu Aleyhi ve Sellem de o günü oruçla geçirirdi. Medine'ye geldiğinde kendisi o gün oruç tuttuğu gibi oruç tutulmasını da emretti. Ramazan orucuna dair hüküm nazil olunca dileyen o günü oruç tutar, istemeyen de tutmazdı",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 3832,
			"arabicnumber": 3832,
			"text": "İbn Abbas r.a. dedi ki: \"(Cahiliye dönemi insanları) hac aylarında umre yapmayı, yeryüzünde facirlik olarak görüyorlardı. Diğer taraftan Muharrem ayına Safer adını veriyorlar ve, develerin (vesair bineklerin) sırtındaki yaralar iyileşip, izleri silinince umre yapmak isteyen kimseye umre yapmak helal olur, derlerdi. (İbn Abbas devamla) dedi ki: Resulullah Sallallahu Aleyhi ve Sellem ve ashabı (Zulhiccenin) dördüncü günü hac niyetiyle ihrama girip telbiye etmiş olarak geldiler. Nebi Sallallahu Aleyhi ve Sellem de onlara bu ihrama girişlerini umre diye değiştirmelerini emretti. Ey Allah'ın Resulü (ihramdan çıktıktan sonra) ne helal olur, dediler. O da her şey helaldir, diye buyurdu",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 3833,
			"arabicnumber": 3833,
			"text": "Said b. el-Museyyeb babasından, o da dedesinden rivayetle dedi ki: \"Cahiliye döneminde bir sel geldi. Her iki dağın arasını örttü. (Ravilerden) Süfyan dedi ki: (Amr) ayrıca bu çok önemi olan bir hadistir, derdi",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 3834,
			"arabicnumber": 3834,
			"text": "Kays b. Ebi Hfuim dedi ki: \"Ebu Bekir, Zeyneb diye anılan Ahneslilerden bir kadının yanına gitti. Onun konuşmadığını gördü. Buna ne oluyor, niye konuşmuyor diye sordu. Etrafındakiler, konuşmamak şartıyla haccediyor, dediler. Ebu Bekir ona, Konuş dedi, böyle bir şey helal olmaz. Bu cahiliye dönemi uygulamalarındandır. Bunun üzerine kadın konuştu, sen kimsin dedi. O, ben muhacirlerden bir kişiyim dedi. Kadın, hangi muhacirlerden diye sordu, Kureyş'ten dedi. Kadın: Kureyş'in hangilerindensin, dedi. O, sen çok soru soruyorsun, ben Ebu Bekir'im dedi. Kadın, cahiliyeden sonra Allah'ın bize gönderdiği bu doğru iş üzerinde ne kadar kalacağız, diye sordu. Ebu Bekir şu cevabı verdi: Sizin bu iş üzere kalışınız, sizin imamlarınızın size istikamet üzere muamele etmesine bağlıdır. Kadın, imamlar ne oluyor, deyince, dedi ki: Senin kavminin onlara emir veren ve kavminin kendilerine itaat ettiği başları ve eşrafı yok muydu? Kadın evet deyince, şu cevabı verdi: İşte onlar insanların başında olan (yöneticilerldir, dedi)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 3835,
			"arabicnumber": 3835,
			"text": "Aişe r.anha dedi ki: \"Araplardan birisine ait siyah bir kadın Müslüman oldu. Bu kadının mescitte daracık bir evi de vardı. (Aişe) dedi ki: (Zaman zaman) yanımıza gelir ve yanımızda konuşurdu. Sözü bittiği vakit şöyle derdi: \"O kemer günü Rabbimizin hayret verici işlerindendir Haberiniz olsun, şüphesiz ki o, küfür beldesinden beni kurtardı.\" Bunu çokça söylediğini görünce Aişe ona dedi ki: Bu kemer günü dediğin nedir? Kadın dedi ki: Benim yakınlarımdan birisinin küçücük bir kızı üzerinde deriden yapılmış bir kemer olduğu halde dışarı çıkmıştı. Bu kemerini düşürdü, onu et sanan bir çaylak o kemerin üzerine indi ve onu alıp gitti. Onu çalmakla beni itham ettiler. Bu sebeple de bana işkence ettiler. Hatta onlar bunu önümde (fercimde) dahi araştıracak kadar işi ileriye götürdüler. Onlar benim etrafımda iken ve ben de o sıkıntıların içerisinde bulunuyarken o çaylak geliverdi ve tam başlarımızın hizasında durdu. Sonra da kemeri bırakıverdi, onlar da kemeri aldılar. Ben de onlara, işte kendisini çalmaktan beri olduğum halde beni çalmakla itham ettiğiniz budur, dedim",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 3836,
			"arabicnumber": 3836,
			"text": "İbn Ömer r.a.'dan rivayete göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Dikkat edin, kim yemin edecek olursa Allah'tan başkası adına yemin etmesin. Çünkü Kureyş atalarının adına yemin ediyordu. (Nebi s.a.v.): Atalarınız adına yemin etmeyiniz, diye buyurdu",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 3837,
			"arabicnumber": 3837,
			"text": "Abdurrahman b. el-Kasım'dan rivayete göre Kasım cenazenin önünden yürür, cenaze dolayısıyla ayağa kalkmazdı. Aişe'nin de şöyle dediğini haber verirdi: \"Cahiliye dönemi insanları cenaze dolayısıyla ayağa kalkarlar ve onu gördüklerinde: -İki defa- sen yakınların arasında ne idiysen, öyle olacaksın, derlerdi",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 3838,
			"arabicnumber": 3838,
			"text": "Amr b. Meymun dedi ki: \"Ömer r.a. dedi ki: Müşrikler güneş Sebir dağı üzerine doğmadıkça Cem'den (Müzdelife'den) ayrılmazlardı. Nebi Sallallahu Aleyhi ve Sellem onlara muhalefet ederek güneş doğmadan oradan ayrıldı",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 3839,
			"arabicnumber": 3839,
			"text": "İkrime'den rivayete göre وكأسا دهاقا \"ve ke'sen dihakan\" buyruğunu, ardı arkasına gelen dopdolu (kaseler), diye açıklamıştır. [-3840-] \"İbn Abbas da dedi ki: Ben babamı cahiliye döneminde: Bize dopdolu bir kase ver de içelim, derken dinlemişimdir",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 3840,
			"arabicnumber": 3840,
			"text": "Ve yine İkrime dedi ki: İbn Abbâs: Ben babam Abbâs'tan işittim, Câhiliyet devrinde hizmetçisine: \"Bizi arka arkaya dolu kadehle sula\" diyordu, demiştir",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 3841,
			"arabicnumber": 3841,
			"text": "Ebu Hureyre r.a. Nebi'in şöyle buyurduğunu rivayet etti: \"Bir şairin söylemiş olduğu en doğru söz, Lebid'in şu sözüdür: Dikkat edin, Allah'ın dışında her bir şey batıldır. Umeyye b. es-Salt da neredeyse Müslüman oluverecekti. \" Bu Hadis Hadis 6147 ve 6489 numara ile gelecektir . Diğer tahric edenler: Tirmizi edeb; Müslim, Şiir",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 3842,
			"arabicnumber": 3842,
			"text": "Aişe r.anha dedi ki: \"Ebu Bekir'in kendisine haraç getiren (kazandıklarını getirip teslim eden) bir kölesi vardı. O da onun gelirinden yerdi. Bir gün ona bir şeyler getirdi, Ebu Bekir de ondan yedi. Köle ona, bunun ne olduğunu biliyor musun, dedi. Ebu Bekir, nedir diye sordu. Kölesi, cahiliye döneminde bir kişiye kahinlik yapmış idim. Halbuki bu işi doğru dürüst bilen birisi de değildim. Ancak ben onu aldattım. O da bu işime karşılık bana (bunu) verdi. İşte senin o yediğin de ondandır, dedi. Bunun üzerine Ebu Bekir elini (ağzına) soktu ve karnında ne varsa dışarı çıkardı",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 3843,
			"arabicnumber": 3843,
			"text": "İbn Ömer r.a. dedi ki: \"Cahiliye dönemi insanları kesilmiş deve etini habelu'l-habeleye kadar vadeli olarak satadardı,.\" Dedi ki: \"Habelu'l-habele dişi devenin, karnındaki yavruyu doğurduktan sonra o doğan yavrunun bir daha hamile kalması demektir. Nebi Sallallahu Aleyhi ve Sellem onlara bu işi yasakladı",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 3844,
			"arabicnumber": 3844,
			"text": "Ğaylan b. Cerir'den rivayete göre \"Biz Enes b. Malik'in yanına gider, o da bize Ensara dair hadisler anlatırdı. Bana, senin kavmin de filan filan günü şunu şunu yaptı. Senin kavminde şu şu günü şunları şunları yaptı, derdi.\" Fethu'l-Bari Açıklaması: \"Cahiliye günleri\" yani Nebi saIlaIlahu aleyhi ve seIlem'in doğumu ile bi'seti (Nebi olarak gönderilmesi) arasında meydana gelen olaylar. Burada maksat budur. Çoğunlukla Nebiliğin verilmesinden önceki dönem hakkında kullanılır. Yüce Allah'ın, \"Allah'a karşı cahiliye zannı gibi hakkın dışında bir zan besliyorlardı.\" [Al-i İmran,1S4] buyruğu ile, \"İlk cahiliyenin ki gibi açılıp saçılarak salınıp yürümeyin.\" [Ahzab,33] buyrukları bu kabildendir. Bu başlıktaki hadislerin çoğu da böyledir. 3834- \"Bu\" yani konuşmayı terk etmek \"helal değildir.\" el-İsmail1'nin de bir başka yoldan Ebu Bekir es-Sıddık'tan diye nakledilen rivayete göre kadın ona şöyle demiştir: \"Cahiliye döneminde bizlerle senin kavmin arasında bir şer çıkmıştı. Bu sebeple Allah bizi bundan esenliğe çıkartacak olursa hac yapana kadar hiçbir kimseylekonuşmamaya dair yemin etmiştim. Bunun üzerine Ebu Bekir, şüphesiz İslam böyle bir şeyi yıkar, diye cevap verdi.\" Ebu Bekir radıyaIlahu anh'ın bu sözü, konuşmamak üzere yemin etmiş olan bir kimsenin konuşmasının müstehap olduğuna ve bundan dolayı keffaret yükümlülüğünün de bulunmadığına delil gösterilmiştir. Çünkü Ebu Bekir o kadına keffarette bulunmasını söylememiştir. Bunun kıyas edildiği bir mesele de şudur: Bir kimse konuşmamayı adayacak olursa onun bu adağı adak olmaz. Çünkü Ebu Bekir böyle bir işin helal olmayacağını, böyle bir şeyin cahiliye işlerinden olduğunu, İslamın bunu yıktığını açıkça ifade etmiş bulunmaktadır. Ebu Bekir de böyle bir şeyi ancak bir tevkife (Nebiden aldığı bir habere) bağlı olarak söyler. Dolayısıyla onun bu sözleri merfu' (hadis) hükmündedir. \"Bu salih iş üzere ne kadar kalacağız?\" Kastettiği, İslam dini ile onun kapsadığı adalet, söz birliği, mazluma yardım ve her bir şeyin yerli yerince konulması halidir. \"Sizin imamlarınız (önderleriniz, yöneticileriniz)\" Çünkü insanlar kendilerini yönetenlerin dinleri üzeredirler. Bu sebeple kim gerçek imamların gösterdiği yolun dışına çıkarsa kendisi de sapıtmış olur, başkasını da saptırmış olur. 3835- \"Onun bir hifşi vardı.\" Hifş küçük ve dar ev demektir. Bu olaya dair açıklamalar daha önce Namaz bahsinde Mescidler ile ilgili başlıklarda açıklanmış bulunmaktadır.(439 numaralı hadiste) Bu olaya dair hadisin bu başlıkta yer alması, da cahiliye döneminin hem tiill uygulamalarında, hem de sözlerinde ne kadar kaba ve katı olduklarını ifade etmesi cihetiyledir. 3837- \"Cahiliye dönemi insanları cenaze dolayısıyla ayağa kalkarlard!.\" Bu hadisin zahirinden anlaşıldığına göre Aişe radıyallahu an ha 'ya şariin (Nebi efendimizin) cenaze için ayağa kalkılması emri ulaşmamıştır. Bu sebeple o bu işin cahiliye döneminde yapılan işlerden olduğu ve İslamın da onlara muhalefet ilkesini getirdiği kanaatinde olmuş bulunmaktadır. Cenazeler bölümünde (1310 nolu hadiste) bu mesele ile ilgili ve bu hükmün nesh olup olmadığına dair görüş ayrılıklarını ortaya koyan açıklamalar geçmiş bulunmaktadır. Bunun nesh olduğu kabul edildiği takdirde acaba bu vücubun neshi midir ve geriye müstehap olarak kalmış mıdır, kalmamış mıdır yoksa mutlak olarak cevaz mı neshedilmiştir? Şafiı alimlerinden bazıları sonuncusunu tercih etmiş ve Şafi\\1erin çoğunluğu bunun mekruh olduğu kanaatini benimsemiştir. el-Mehamili ise bu konuda ittifak olduğunu dahi iddia etmiştir. Fakat el-Mütevelli muhalefet ederek müstehaptır demiş, Nevevı de bunu tercih ederek şunları söylemiştir: Bu Aişe'nin ashab-ı kiram ile ilgili onlardan farklı olarak dile getirdiği hükümler arasındadır. Fakat bu hususta ashab-ı kiram'ın görüşü daha bir tercihe şayandır. 3841-'''Şairin söylediği en doğru söz\" ile kast edilen şairin \"Allah'ın dışındaki. .. \" ifcidesidir. Yani onun zati sıfatlarının rahmeti, azabı ve benzeri fiili sıfatların dışındaki her şey batıldır. Bundan dolayı (Allah Resulü) cenneti ve cehennemi sözkonusu etmiştir. Yahut da beyitte \"batıl oluş\"tan kasıt yok oluştur, fani oluştur. Bozukluk ve fesad değildir. Çünkü Allah'ın dışındaki her bir varlığın zatı dolayısıyla fani olduğu aşikardır. Hatta cennet ve cehennem için bile bu sözkonusudur. Fakat onlar yüce Allah'ın onları baki kılması ile ve cennet ile cehennem ehli hakkında devamlılığı yaratması suretiyle baki kalırlar. \"el-Hak\" hakikat anlamı ile hakkında zevalin caiz olmadığı, düşünülemediği şeydir. Nebi efendimizin, \"Sen el-haksın, sözün el-haktır, vaadin el-haktır\" derken başlarına elif lam getirip, bunların dışındakileri sözkonusu ederken elif, lam'ı getirmeyişindeki sır da muhtemelen budur. Doğrusunu en iyi bilen Allah'tır. 3842- \"Ona haraç verirdi.\" Yani kazandıklarını getirip, teslim ederdi. Haraç efendinin kölesinin kazancından getirip teslim etmek üzere tespit ettiği miktara denilir. \"Bana onun karşılığında bunu verdi.\" Yani benim onun için kahinlik yapmam karşılığında bunu verdi. İbnu't-Tın der ki: Ebu Bekir'in kendisini kusturması böyle bir şeyden büsbütün sakınmak, korunmak içindir. Çünkü cahiliye döneminde yapılanların vebali kaldırılmıştır. Eğer böyle bir iş İslam geldikten sonra olmuş olsaydı yediğinin mislini ya da kıymetini tazminat olarak vermesi gerekirdi. Sa'dece kusması da yetmezdi. İbnu't-Tın şöyle demiştir: Fakat görüldüğü kadarıyla Ebu Bekir r.a.'ın kendisini kusturmasının sebebi, kahinin kehaneti karşılığında aldığı ücretin yenilmesini yasaklayan hükmü sabit görmüş olmasındandır. Kahin ise şer'i bir delile dayanmaksızın yakında meydana gelecek şeyleri haber veren kimsedir. Bu cahiliye döneminde, özellikle de Nebi sallallahu aleyhi ve sellem'in Nebiliğinden önce oldukça çoğalmıştı. 3843- (Numaralı hadis) İbn Ömer'in gebe kalmış dişi devenin gebeliği ile ilgili hadisi rivayet ettiği olup buna dair yeterli açıklamalar daha önce Alışverişler (Buyur) bölümünde geçmiş bulunmaktadır.(2143 numaralı hadis) Burada zikredilmesinden maksat ise onların cahiliye döneminde bu şekilde alışveriş yapıyor olmaları idi",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 3845,
			"arabicnumber": 3845,
			"text": "İbn Abbas r.a. dedi ki: \"Şüphesiz cahiliye dönemindeki ilk kasame şüphesiz bizim aramızda, yani Haşim oğulları arasında görülmüştür. Haşim oğullarından bir adamı, Kureyş'in bir başka boyundan, bir başkası ücretle tutmuştu. Onunla birlikte develeriyle beraber yola koyuldu. Ücretli tuttuğu o işçinin yanından, heybelerinin bağları kopmuş Haşimoğullarından bir başka adam geçti. Heybelerini bağlayabileceğim bir ip getirerek yardıma koş ki develer ürküp kaçmasın, dedi. Ona bir ip verdi, o da heybelerini onunla bağladı. Bir yere inip konakladıklarında bir deve dışında bütyn develer kazığa bağlandı. Onu ücretle tutan kişi, bütün develer arasında şu kazığa bağlanmayan devenin durumu neden böyle, diye sordu. İşçi, onun yuları yok, dedi. Adam, yuları nerde diye sorunca, işçi, onu attı, diye cevap verdi. O (ücretle onu tutan kişi) da ecelinin gelmesine sebep teşkil eden bir sopa ile ona vurdu. Yemenlilerden bir adam yanından geçti. Hac mevsiminde bulunacak mısın, diye sordu. Yemenli, her zaman bulunmam ama bulunduğum da olur, dedi. Adam, peki herhangi bir zamanda benden bir mesaj ulaştırabilir misin, diye sordu. Yemenli, olur dedi. (İbn Abbas) dedi ki: Sen hac mevsiminde bulunduğun takdirde, ey KureyşIiler diye seslen. Sana cevap verdikleri vakit sen de, Ey Haşim oğulları hanedanı diye seslen. Sana karşılık verirlerse, Ebu Talib'i sor ve ona şunu haber ver: Filan kişi beni bir deve yuları dolayısıyla öldürdü. Daha sonra ücretle kiralanan kişi öldü. Onu ücretle tutan kişi (Mekke'ye) gelince Ebu Talib onun yanına giderek, bizim arkadaşımız ne yaptı, diye sordu. O kişi, Sizin adamınız hastalandı, ben de ona güzel bir şekilde baktım. Sonra da kendim onu defnettim, dedi. (Ebu Talib): Sana da böyle yapmak yakışırdı, dedi. Bir süre böylece geçti. Daha sonra kendisine bu vasiyeti kendi adına bildirmesini söylediği kişi hacca geldi. Ey Kureyşliler, diye seslendi. Kureyşliler bizleriz, dediler. Ey Haşim oğulları dedi. Haşim oğulları bizleriz, dediler. Ebu Talib nerede diye sordu. İşte bu Ebu Talib'tir, dediler. Ona dedi ki: Filan kişi bana sana şu haberi bildirmemi emretti, Filan kişi onu bir deve yuları dolayısıyla öldürdü. Ebu Talib o adamın yanına giderek ona, bizden şu üç şeyden birisini seçerek kabul et, dedi. Dilersen yüz deve ödersin. Çünkü bizim arkadaşımızı öldürdün. Dilersen senin kavminden elli kişi onu öldürmediğine dair yemin etsinler. Eğer bunları kabul etmeyecek olursan biz de adamımıza karşılık olarak seni öldürürüz. O kişi kavminin yanına gitti, kavmi yemin ederiz dediler. Onun (Ebu Talib'in) yanına o kavimden bir adamın nikahı altında olup, ondan da çocuğu doğmuş bulunan Haşim oğullarından bir kadın gelerek, ey Ebu Talib dedi. Benim bu oğlumu yemin etmesini istediğin elli adamın dışında tutmanı ve kat'i olarak yemin edilen yerde onu yemin etmekle yükümlü tutmamanı diliyorum. Ebu TaIib onun istediğini yaptı. Onlardan bir adam gelerek: Ey Ebu Talib, yüz deveye karşılık elli adamın yemin etmesini istedin. Buna göre her bir adama iki deve isabet eder. İşte sana iki deve. Benden bunları kabul et ve kesin olarak yeminlerin yapıldığı yerde yemin etmekten beni muaf tut, dedi. Ebu Talib bu iki deveyi de kabul etti. Diğer kırk sekiz kişi gelip yemin ettiler.\" İbn Abbas dedi ki: \"Nefsim elinde olan (Allah)'a yemin ederim ki bir sene bu olayın üzerinden geçmeden o kırk sekiz kişiden gözünü kırpan tek kişi kalmamıştı",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 3846,
			"arabicnumber": 3846,
			"text": "Aişe r.anha dedi ki: \"Buas günü Allah'ın, Resulünün lehine önceden olmasını takdir ettiği bir gündür. Resulullah Sallallahu Aleyhi ve Sellem (Medine'ye) geldiğinde onların ileri gelenleri dağılmış bulunuyordu. Önder olanları ölmüş ve yaralanmış idiler. İşte bu, Allah'ın, Resulünün Sallallahu Aleyhi ve Sellem lehine onların İslama girmeleri için önceden meydana gelmesini takdir ettiği bir olaydır",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 3847,
			"arabicnumber": 3847,
			"text": "İbn Abbas r.a.'dan: \"Safa ile Merve arasındaki vadinin iç tarafında sa'y etmek sünnet değildir. Cahiliye dönemi insanları burada sa'y ederler ve bizler Batha denilen yeri ancak hızlıca koşarak geçeriz, derlerdL",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 3848,
			"arabicnumber": 3848,
			"text": "İbn Abbas r.a. dedi ki: \"Ey insanlar! Söyleyeceklerime kulak veriniz. Sizler de ne diyecekseniz bana duyurunuz. (Böyle yapmadan) gidip de İbn Abbas şöyle dedi demeyiniz.\" İbn Abbas dedi ki: \"Kim Beyt'i tavaf ederse Hicr'in arkasından tavaf etsin. Ona el-Hatim demeyiniz. Çünkü cahiliye döneminde bir kimse yemin eder, sonra da (oraya) kamçısını, ayakkabısını ya da yayını atard",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 3849,
			"arabicnumber": 3849,
			"text": "Amr b. Meymun dedi ki: \"Cahiliye döneminde zina etmiş maymunlar etrafında toplanıp da zina edenleri recmeden maymunlar görmüştüm. Ben de onlarla birlikte o zina eden maymunları recm ettim",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 3850,
			"arabicnumber": 3850,
			"text": "İbn Abbas r.a. dedi ki: \"Bazı•hasletler vardır ki, cahiliye dönemi hasletlerindendir: Neseblere dil uzatmak, ölüler için ağıt yakmak. (Senetteki ravilerden Ubeydullah) üçüncüsünü unuttu. (Yine senetteki ravilerden) Süfyan dedi ki: Derler ki, o, yıldızların konakları vasıtası ile yağmur dilemektir.\" Fethu'l-Bari Açıklaması: 3845- \"İlk kasame\" ilk yemin demektir. Şer'i bir terim olarak, Öldürme itharnı esnasında o itharnı kabul veya nefyetmek amacıyla muayyen bir şekilde yemin etmektir. Bunun yemin edenlere yeminlerin taksim edilmesinden alınmış bir lafız olduğu da söylenmiştir. İleride diyetler bölümünde (6899 numaralı hadiste) yüce Allah'ın izniyle hükmü ile ilgili görüş ayrılığı açıklanacaktır. \"Haşim oğullarından bir adam.\" Bu, Amr b. A1kame b. el-Muttalib b. Abdi Menartır. Sanki İbn Abbas bu rivayeti Haşim oğulları ile Muttalib oğulları arasındaki sevgi, kardeşlik ve yardımlaşma dolayısıyla mecazi olarak Haşim oğullarına nispet etmiş gibidir. \"Yanından\" işçi tutulanın yanından\"geçti.\" \"Heybelerinin bağı\" heybe deriden ve' elbiseden yapılmış olan kaba denilir. Bağ denilen şey de iptir. \"Ecelinin gelmesine sebep olan\" yani onun ölümü neticesini veren, \"öldü\" ifadesi daha sonraki ifadelerin deliliyle ölüm kertesine geldi, demektir. \"Son nefeslerini vermeden önce Yemen halkından bit adam onun yanından geçti.\" * * * \"Öldü\" ifadesi ve ondan sonraki \"Son nefeslerini vermeden önce\" ifadesi Buhari'nin nüshalannda bulunmamaktadır. (Fethu'l-Bari baskısındaki dipnottan, VII, 193) * * * \"Mevsimde\" yani hac mevsiminde \"bulunacak mısın?\" \"Bir yular dolayısıyla beni öldürdü.\" Bir yuları bahane ederek beni öldürdü. \"Onun yanına Haşim oğullarından bir kadıngeldi.\" Bu kadın da öldürülenin kızkardeşi Alkame'nin kızı Zeyneb'tir. \"Yeminlerin kesin olarak yapıldığı yer\" olan Rükün ile Makam arasıdır. \"Nefsim elinde olana yemin ederim.\" İbnu't-Tın der ki: Görüldüğü kadarıyla bu olayı İbn Abbas'a doğru söylediklerinden kesin olarak emin olduğu bir topluluk haber vermiştir. Bu sebeple buna dair yemin edebiimiştir. Derim ki: Şunu demek istiyor, bu Kasame (yemin) sırasında henüz doğmamıştı. Ona bunu haber verenin Nebi Sallallahu Aleyhi ve Sellem olma ihtimali de vardır. Bu hadisin Sahih-i Buhari'nin kapsamına girmesi bakımından bu daha mümkün görünmektedir. \"Sene geçmeden\" yani yemin ettikleri günden itibaren bir sene bitmeden. 3846- \"Buas günü.\" Buna dair açıklamalar Ensarın Menkıbeleri başlığının girişinde (2777 nolu Hadis'te) ve tercih edilen görüşe göre nübuvvetin verilişinden önce olduğuna dair açıklamalar geçmiş bulunmaktadır. 3848- \"Ey insanlar, size söyleyeceklerim e kulak veriniz ve siz de sözünüzü bana işittiriniz.\" Yani sizin söylediğimi bellediğinizi bileyim diye sözümü bana tekrar ediniz. Sanki maksadını anlayamayıp, ondan söylediğinden farklı bir şey haber vereceklerinden çekinmiş gibidir. Bu sebeple şöyle demiş gibidir: Benden sağlam ve iyi bir şekilde bellemek üzere sözümü dinleyiniz ve it ıice bellemeden İbn Abbas dedi, demeye kalkışmayınız. 3849- \"Cahiliye döneminde ... maymunlar gördüm.\" el-İsmail! bu kıssayı bir başka yoldan İsa b. Hittan yoluyla Amr b. Meymun'dan nispeten daha uzun bir şekilde zikretmiş bulunmaktadır. Amr b. Meymun dedi ki: \"Yemen'de yakınlarıma ait koyunlar ile birlikte idim. Yüksekçe bir tepede bulunuyordum. Bir maymun bir başka maymun ile birlikte geldi. Onun eli üzerine yattı. Ondan daha küçük bir maymun geldi, o dişi maymuna işaret etti. Dişi maymun elini ilk maymunun altından yavaşça çekti ve onun arkasından gitti. Gözümün önünde onunla ilişki kurdu. Daha sonra geri döndü, yavaşça elini birinci maymunun yanağı altına sokmaya başlayınca dehşetle uyanıverdi. Onu koklayınca bağırdı. Diğer maymu nlar gelip toplandı. Yine bağırmaya devam ederek eliyle o dişi maymunu işaret etmeye başladı. Maymunlar sağa sola gidip geldi. O benim tanıdığım maymunu getirdiler. Her ikisine bir çukur kazdılar ve iki maymunu da recm ettiler. Andolsun ben Adem oğullarından olmayanlar arasında recmi görmüş oldum.\" İbnu't-Tin der ki: Belki de bunlar daha önce mesh olmuşların soyundan gelmiş ve bu hüküm de aralarında devam etmiş olabilir. Daha sonra da: Mesh olanların nesli devam etmez, demektedir. Derim ki: Mutemet olan görüş budur. Çünkü Müslim'in Sahih'inde sabit olduğuna göre: \"Mesh olanların nesli yoktur.\" Yine Müslim'de İbn Mes'ud tarafından merfu olarak rivayet edilmiş hadiste şöyle denilmektedir: \"Allah, helak etmiş olduğu hiçbir kavmin nesiini devam ettirmemiştir.\" 3850- \"Cahiliye dönemi hasletlerinden: Neseplere dil uzatmak\" yani bazı kimselerin diğer bazılarının nesebine bilgisizce dil uzatmaları. Ölülere \"ağıt yakmak.\" \"Derler ki: O yıldızların konaklamaları vasıtasıyla yağmur dilemektir.\" Yani onlar bu yıldızın doğuşu sebebiyle bize yağmur yağdırıldı, derler. İstiska bölümünde buna dair açıklamalar geçmiş bulunmaktadır",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 3851,
			"arabicnumber": 3851,
			"text": "İbn Abbas r.a. dedi ki: Resuluilah Sallallahu Aleyhi ve Sellem'e O kırk yaşında iken (vahiy) indirildi. Mekke'de on-üç yıl kaldı. Sonra ona hicret etmesi emri verildi. Medine'ye hicret etti. Orada da on yıl kaldıktan sonra vefat etti sallal .. l€ıhu aleyhi ve sellem\" Bu Hadis 3902, 3903, 4465, 4979 numara ile gelecektir. Fethu'l-Bari Açıklaması: \"Nebi sallall€ıhu aleyhi ve sellem'in bi'seti\" (başlıktaki şekliyle) el-meb'as: ba's'ten gelmektedir. Asıl anlamıyla harekete getirmek demektir. Herhangi bir işe yönlendirmek için dekullanılır. \"Muhammed\" Beyhaki'nin Oelailu'n-Nubuwe adlı eserinde mürsel bir senetle zikrettiğine göre \"Abdulmuttalib, Nebi Sallallahu Aleyhi ve Sellem doğunca onun için bir ziyafet hazırladı. Misafirler yemeklerini yedikten sonra \"adını ne koydun\" diye sordular. O da:' Muhammed diye cevap verdi. Niçin onun akrabalarından (atalarından) birisinin herhangi bir ismini verrrJ€din, diye sordular. Semada Allah'ın, yeryüzünde de onun yarattıklarının ondan hamd ile (övgüyle) söz etmesini istedim, çiiye cevap verdi. \"B. Abdullah.\" Babasının adının Abdullah olduğu hususunda görüş ayrılığı yoktur. Ancak ne zaman öldüğü hususunda ihtilaf vardır. Nebi Sallallahu Aleyhi ve Sellem doğmadan önce öldüğü söylendiği gibi, doğduktan sonra öldüğü' de söylenmiştir. Ancak birincisi daha sağlam bir görüştür. Nebi Sallallahu Aleyhi ve Sellem'in babası(nın doğumundan sonra öldüğünü söyleyenler} de Nebiin yaşı hususunda farklı görüşlere sahiptirler. Tercih edilen görüş bir yaşından küçük olduğudur. \"B. Abdulmuttalib.\" Adının cumhura göre Şeybetu'l-Hamd olduğu belirtilmiştir. \"Resulullah Sallallahu Aleyhi ve Sellem'e kırk yaşında iken vahiy indirildi.\" İşte bu başlıkta bu hadisten maksat budur. Bu hususta ittifak hasıl olmuştur. Nebi Sallallahu Aleyhi ve Sellem'in nitelikleri ile ilgili başlıkta Enes'in rivayet ettiği: \"Kırk yaşına bastığında ona Nebilik verildi\" hadisi geçmiş bulunmaktadır. Bed'u'l-vahy bahsinde de ona vahyin Ramazan ayında indirildiği belirtilmiştir. Sahih ve meşhur olan görüşe göre o Rebiulevvel ayında doğmuştur. Bu durumda ona vahiy indirildiği sırada kırkbuçuk yaşında idi, demektir",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 3852,
			"arabicnumber": 3852,
			"text": "Habbab dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem Ka'be'nin gölgesinde bulunuyorken bir burdeyi yastık edinip ona yaslanmışken yanına vardım. Ey Allah'ın Resulü dedim. Bizim için Allah'a dua etmez misin? Yüzü kızarmış olduğu halde oturdu ve dedi ki: Sizden öncekiler andolsun demir taraklarla taranarak eti ya da damarları kemiklerinden ayrılırdı da bu dahi onu dininden geri döndürinezdi. Testere başının ortasına konulur, ikiye ayrılırdı. Bu da onu dininden geri çevirmezdi. Andolsun Allah bu dini tamamlayacaktır. Öyle ki bir suvari San'a'dan, Hadramevt'e kadar yol alacak da Allah'tan başkasından korkmayacaktır.\" (Ravilerden) Beyan: \"Ve koyunları için kurttan ... \" ibaresini eklemiştir",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 3853,
			"arabicnumber": 3853,
			"text": "Abdullah r.a. dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem Necm (suresin)i okudu ve secde etti. Bir adam dışında, secde etmedik kimse kalmadı. Onun da bir avuç çakıl alarak (alnına doğru) kaldırdığını ve onun üzerine secde ettiğini gördü ve, bu kadarı bana yeter, dedi. Andolsun daha sonra onun Allah'ı inkar eden bir kafir olarak öldürülmüş gördüm",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 3854,
			"arabicnumber": 3854,
			"text": "Abdullah r.a. dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem etrafında Kureyş'ten bir takım kimseler bulunuyorken, secde halindeyken Ukbe b. Ebi Muayt doğum yapmış bir devenin eşini getirerek onu Nebi Sallallahu Aleyhi ve Sellem'in sırtına bıraktı. Allah Resulü başını kaldırmadı. Fatıma (aleyhesselam) gelip onu sırtından aldı ve bunu yapana beddua etti. Bunun üzerinde Nebi Sallallahu Aleyhi ve Sellem şöyle dedi: Allah'ım, Kureyş'in ileri gelenlerini, Ebu Cehil b. Hişam'ı, Utbe b. Rabia'yı, Şeybe b. Rabia'yı ve Umeyye b. Halefi -yahut da Ubeyy b. Halefi şüphe eden ravilerden Şu'be'dir- sana havale ediyorum. Bedir günü onların öldürülmüş olduğunu gördüm. Umeyye b. Halef yahut Ubeyy (b. Halef) dışında hepsi bir kuyuya atılmışlardı. Umeyye -yahut Ubeyyise organları dağılmış olduğundan dolayı kuyuya atılmadı",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 3855,
			"arabicnumber": 3855,
			"text": "Said b. Cubeyr dedi ki: \"Abdurrahman b. Ebza bana dedi ki: Abdullah b. Abbas'a şu iki ayetin durumunu bir sor: \"Allah'ın haram kıldığı canı öldürmeyin . \" [En'am, 151; İsra, 33] ayeti ile: \"Kim kasten bir mu'mini öldürürse ... \" [Nisa, 93] ayetini. Ben de İbn Abbas'a sordum. Dedi ki: Furkan suresindeki (68. ayet) nazil olunca Mekke müşrikleri, biz Allah'ın haram kıldığı canı öldürdük. Allah ile birlikte başka bir ilaha dua (ve ibadet) ettik, üstelik fuhşiyatı da işledik. Bunun üzerine yüce Allah: \"Tövbe eden ve iman eden müstesna ... \" [Furkan, 70] buyruğunu indirdi. İşte bu ayet onlar içindir. Nisa suresindeki (93.) ayet ise İslamı ve şer'i hükümlerini bildikten sonra öldüren kimse hakkındadır. İşte onun cezası cehennemdir. Ben bunu Mücahid'e naklettim de o: pişman olan müstesna dedi.\" Bu Hadis 4590,4762,4763,4764,4765,4766 numara ile gelecektir",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 3856,
			"arabicnumber": 3856,
			"text": "Urve b. Zubeyr'den dedi ki: Ben (Abdullah) b. Amr b. el-As'a sordum: Bana müşriklerin Nebi Sallallahu Aleyhi ve Sellem'e yaptıkları en ağır işkencenin ne olduğunu haber ver, dedim. Dedi ki: Nebi Sallallahu Aleyhi ve Sellem Ka'be'nin Hicr'inde namaz kılmakta iken Ukbe b. Ebi Muayt geldi ve elbisesini onun boynuna dolayıp, boğazını alabildiğine sıkt!. Ebu Bekir gelip, onu omzundan tutarak Nebi Sallallahu Aleyhi ve Sellem'in üzerinden geri itti ve: Sizler bir adamı Rabbim Allah'tır diye öldürür müsünüz?\" [Mu'min, 28] dedi. Fethu'l-Bari Açıklaması: \"Yüzü\" uykunun etkisinden dolayı \"kızarmış olduğu halde oturdu.\" Kızgınlığından ötürü kızarmış olma ihtimali de v.ardır. İbnu't-TIn bunu kesin olarak ifade etmiştir. \"Testere ... konulurdu.\" İbnu't-TIn der ki: Kendilerine bu işkencenin yapıldığı kimseler enbiya ya da onlara tabi olan kimseler idi. Ashab-ı kiram arasında da kendisine bu işkence yapıldığı takdirde sabredecek kimseler vardı. Daha sonra şunları söyler: Ashab-ı kiram'dan olsun, onların peşinden gidenler arasından ve onlardan sonra gelenlerden olsun Allah yolunda eziyet görüp de ruhsat olanı yapacak olsalar da kendileri için uygun bir iş olacak kimseler hala var olagelmiştir. \"Andalsun Allah bu işi tamamlayacaktır.\" İş (emr)den kasıt, İslam'dır. 3855 numaralı İbn Abbas'tan gelen katilin tövbesi ile ilgili hadisin açıklaması ileride yüce Allah'ın izniyle en-Nisa suresinin tefsirinde gelecektir. Burada bundan maksat, müşriklerin Müslümanlara yaptıkları öldürme, işkence ve buna benzer işlerin (günahlarının) Müslüman olmaları halinde üzerlerinden kalkmış olacağına işaret etmektir. \"Muhammed b. Amr, Ebu Selerne dedi ki: Bana Amr b. eı-As anlattı.\" Ebu Ya'la ve el-Bezzar sahih bir senedie Enes'in şöyle dediğini rivayet etmektedirler: \"Bir keresinde Resulullah sallallahu aleyhi ve sellem'i baygın düşünceye kadar dövdüler. Ebu Bekir ayağa kalkarak şöyle seslendi: Veyl olsun sizlere! Siz Rabbim Allah'tır dedi diye birisini öldürecek misiniz? Bunun üzerine onu bırakarak Ebu Bekir'in üzerine yürüdüler.\" Bu, sahabe mürsellerinden bir rivayettir. Bunu Ebu Ya'la hasen bir senedie uzunca, Ebu Bekir'in kızı Esma yoluyla gelen bir hadis olarak rivayet etmektedir: \"Ona: Müşriklerin Resulullah sallallahu aleyhi ve sellem'e yaptıklarını gördüğün en aşırı ve ağır işkence nedir?\" diye sordular. Bundan sonra da az önce kaydettiğimiz İbn İshak'ın anlattığına yakın olarak hadisi zikretmektedir. Bu rivayette şu ifadeler de vardır: \"Haberi Ebu Bekir'e ulaştıran kişi gelip dedi ki: Arkadaşını yetiş! (Esrna) dedi ki: Ebu Bekir yanımızdan -ki dört küçük örüğü de vardı-: Veyl size! Rabbim Allah'tır dedi diye bir adamı öldürür müsünüz diyerek çıktı. Nebii bırakıp, Ebu Bekir'in üzerine yürüdüler. Ebu Bekir yanımıza geri döndüğünde elini örüklerinden hangisine dokundurduysa (saçları) elinde kalıyordu.\" Ebu Bekir'in başından geçen bu olayın Ali yoluyla gelen bir şahidi de vardır. Bunu el-Bezzar, Muhammed b. Ali yoluyla rivayet etmiştir. O da babasından naklettiğine göre Ali irad ettiği hutbesinde dedi ki: \"İnsanların en kahramanı kimdir? Sensin dediler. O dedi ki: Evet, kim benimle teke tek çarpıştıysa mutlaka ben ondan intikamımı almışımdır, fakat en kahraman kişi Ebu Bekir'dir. Andolsun ResuluIlah Sallallahu Aleyhi ve Sellem'i Kureyş'in yakalamış olduğunu gördüm. Birisi onu tekmeliyor, diğeri ona karşı dikiliyor ve ona: Sen bunca ilahı tek bir ilah kabul ediyorsun öyle mi, diyorlardı. Allah'a yemin ederim aramızdan Ebu Bekir dışında kimse (oraya) yaklaşamadı. Kimisine vuruyor, kimisini itiyor ve şöyle diyordu: Veyl olsun size! Rabbim Allah'tır dedi diye bir adamı öldürecek misiniz? Daha sonra Ali ağladı, sonra şöyle devam etti: Allah adına size soruyorum. Firavun hanedanından iman eden kişi mi daha faziletlidir yoksa Ebu Bekir mi? Herkes sustu, sonra Ali dedi ki: Allah'a yemin ederim Ebu Bekir'in bir anı dahi ondan daha hayırlıdır. Çünkü o imanını gizleyen bir adamdı, bu (Ebu Bekir) ise imanını açıkça ilan ediyordu",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 3857,
			"arabicnumber": 3857,
			"text": "Ammar b. Yasir dedi ki: \"ResuluIlah Sallallahu Aleyhi ve Sellem'i beraberinde beş köle, iki kadın ve Ebu Bekir'den başka kimse olmadığı halde görmüşümdür.\" Fethu'l-Bari Açıklaması: \"Ebu Bekir es-Sıddık r.a.'ın Müslüman olması\" Bu başlık altında Ammar'ın hadisini zikretmektedir. Buna dair açıklama daha önceden geçmiş bulunmaktadır. Bu hadiste Ebu Bekir r.a.'ın erken dönemde Müslüman olduğuna delil vardır. Çünkü Ammar, Nebi Sallallahu Aleyhi ve Sellem ile beraber onun dışında erkeklerden bir kimseyi gördüğünü söylememiştir. Cumhur da Ebu Bekir'in ilk Müslüman erkek olduğunu ittifakla kabul etmiştir. İbn İshak'ın belirttiğine göre, Ebu Bekir Muhammed Sallallahu Aleyhi ve Sellem'e pek yakında Nebilik verileceğinden çok emin idi. Buna sebep ise buna dair işitip gördüğü delillerdi. Bundan dolayı Allah Resulü onu İslamı kabul etmeye davet edince, ilk anda elini çabuk tutarak onu tasdike koşmuştur. 31. SAID B. EBİ VAKKAS R.A.'IN MÜSLÜMAN OLMASI",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 3858,
			"arabicnumber": 3858,
			"text": "Said b. el-Müseyyeb dedi ki: Ben Ebu İshak Sa'd b. Ebi Vakkas'ı şöyle derken dinledim: \"İslama girdiğim günde hiç kimse müslüman olmadı. Andolsun yedi gün boyunca ben İslamın üçte biri olarak kaldım.\" Fethu'l-Bari Açıklaması: \"Sa'd'ın Müslüman olması\" Burada Sa'd'ın rivayet ettiği hadisi zikretmektedir. Bunun yeterli açıklaması onun menkıbeleri ile ilgili başlıkta geçmiş bulunmaktadır. Bu hadisin bir önceki başlıktaki ile ilişkisi ve ikisinin ortak noktası, her birisinde sözü edilen kişinin İslama özelolarak önce girmiş olmasını gerektirmesidir. Fakat bu husus o kişinin bu konuda sahip olduğu bilgiye göre yorumlanmıştır. Yoksa Bilal ve Sa'd'den önce Hatice, Sa'd b. Harise, Ali b. Ebi Talib ve başkaları Müslüman olmuştur. (Muhtasar olmayan Fethu'l-Bari'de de böyle)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 3859,
			"arabicnumber": 3859,
			"text": "Ma'n b. Abdurrahman dedi ki: Babamı şöyle derken dinledim: \"Ben Mesruk'a, Nebi Sallallahu Aleyhi ve Sellem'e Kur'an'ı dinledikleri gece cinleri kim haber verdi, diye sordum. O dedi ki: Bana senin babanın --yani Abdullah'ın-- anlattığına göre onların gelişini bir ağaç haber verdL",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 3860,
			"arabicnumber": 3860,
			"text": "Ebu Hureyre r.a.'dan rivayte göre; \"O, Nebi Sallallahu Aleyhi ve Sellem ile birlikte iken, abdesti ve ihtiyacını karşılamak için bir su matarası taşıyordu. Bir seferinde beraberinde bu matara ile birlikte onun arkasından giderken, bu kimdir diye sordu. Ben Ebu Hureyre'yim dedi. Ban'a kendileri ile temizlenmek üzere birkaç taş bul, fakat bana kemik ve hayvan pisliği getirme, buyurdu. Ona elbisemin ucuna koyarak taşıdığım birkaç taş götürüp yanına bıraktım. Sonra uzaklaştım. Nihayet işini bitirince onunla beraber yürüdüm, Acaba kemiğin ve hayvan pisliğinin durumu nedir? Diye sordum. Şöyle buyurdu: Bu ikisi cinlerin yiyeceklerindendir. Bana Nasibin cinlerinden --ki onlar ne iyi cinlerdir-- bir heyet geldi ve benden azık istediler, Bunun üzerine ben de onlar için Allah'a, nerede bir kemik ve bir pislik bulurlarsa mutlaka üzerinde yiyecek bir şeyler bulmalan için dua ettim,\" Fethu'l-Bari Açıklaması: \"Cinlere dair\" yaratmanın başlangıcı (Bed'u'l-halk) bölümünün baş taraflanhda cinler ile ilgili, tekrara ihtiyaç bırakmayacak açıklamalar geçmiş bulunmaktadır. \"Ma'n b. Abdurrahman\" b. Abdullah b. Mes'ud'dur, \"Bana Nasıbın cinlerinin heyeti geldi.\" Nasıbın, el-Cezire (bölgesin)de meşhur bir beldedir",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 3861,
			"arabicnumber": 3861,
			"text": "İbn Abbas r.a., dedi ki: \"Ebu Zer', Nebi Sallallahu Aleyhi ve Sellem'e Nebilik verildiği haberini alınca kardeşine: (Devene) bin de şu vadiye git. Kendisinin bir Nebi olduğunu, semadan kendisine haber geldiğini iddia eden bu adam ile ilgili bana dair bilgi topla ve onun sözünü bizzat işit, sonra yanıma gel, dedi. Kardeşi gitti, onun yanına vardı, onun sözlerini dinledi. Sonra da Ebu Zerr'in yanına dönerek ona dedi ki: Ben onun ahlakın üstün değerlerini enirettiğini, şiir olmayan bir söz söylediğini gördüm. Ebu Zerr, bana istediğim bilgiyi beni rahatlatacak şekilde getiremedin, dedi. Bunun üzerine kendisi azığını hazırladı, içinde su bulunan kırbasını yüklendi. Nihayet Mekke'ye geldi. Mescide gitti. Nebi Sallallahu Aleyhi ve Sellem'i aradı ama onu tanımıyordu. Ona dair kimseye bir şey sormaktan da hoşlanmadı. Sonunda gece oldu. Ali onu görünce bir yabancı olduğunu anladı. (Ebu Zerr) onu görünce onun (Ali'nin) arkasından gitti. Onlardan biri arkadaşına sabah oluncaya kadar . hiçbir şey sormadı. Daha sonra kırbasını ve azığını taşıyarak mescide gitti. O gün geçip gitti ve akşam oluncaya kadar Nebi onu görmedi. Nihayet akşam olunca yatacağı yere geri döndü. Yine Ali yanından geçerek, bu adamın kalacağı yeri bilme zamanı gelmedi mi, dedi. Sonra onu kaldırdı ve onunla birlikte gitti, ama biri arkadaşına bir şey sormuyordu. Nihayet üçüncü gün oldu, Ali tekrar aynı şeyi yaptı. Yine onunla birlikte kalktı, gitti. Sonra, bana senin buraya neden geldiğini anlatmayacak mısın, dedi. Ebu Zerr, eğer bana mutlaka doğruyu göstereceğine dair bir söz ve bir ant verecek olursan anlatırım, dedi. O da istediğini verdi. Ebu Zerr de ona durumu bildirdi. (Ali) dedi ki: O haktır, o Resuluilah Sallallahu Aleyhi ve Sellem'dir. Sabahı edince benim arkamdan gel. Ben senin için korkulacak bir şey görürsem su döker gibi duracağım. Yoluma devam ettiğim takdirde benim gireceğim yere sen de girene kadar arkamdan gel. O da bunu yaptı. Arkasından onu takip etmeye koyuldu. Nihayet (Ali) Nebi Sallallahu Aleyhi ve Sellem'in huzuruna girdi. O da onunla birlikte girdi, bazı sözlerini dinledi ve hemen o yerde Müslüman oldu. Nebi Sallallahu Aleyhi ve Sellem ona dedi ki: Sen kavminin yanına geri dön ve onlara bildir. Benim emrim (durumum) sana gelinceye kadar (öylece kal.) (Ebu Zer') dedi ki: Nefsim elinde olana yemin ederim ki onların (Kureyş'in) arasında bunu yüksek sesle bağırıp söyleyeceğim. Dışarı çıktı ve mescide gitti. En yüksek sesiyle bağırdı: Şahadet ederim ki Allah'tan başka hiçbir ilah yoktur ve şüphesiz Muhammed Allah'ın Resulüdür. Hemen akabinde orada bulunanlar ayağa kalkıp canını acıtacak şekilde onu dövdüler. Abbas geldi, üzerine abanarak: Yazık size! Siz bunun Gıfar kabilesinden olduğunu bilmiyor musunuz? Sizin Şam'a giden ticaret yolunuzun üzerinde olduklarını bilmiyor musunuz, diyerek onu ellerinden kurtardı. Ertesi gün aynı şeyi yaptı, yine onu dövdüler, üzerine yürüdüler. el-Abbas da üzerine abandı (onu korudu).\" Fethu'l-Bari Açıklaması: \"Ebu Zerr el-Gıfari\" Cundub b. Cunade b. Süfyan b. Ubeyde b. Haram b. Gıfar (el-Gıfari) \"nin Müslüman olması\" Gıfar Kinane oğullarındandır. \"Ona dair soru sormaktan hoşlanmadı.\" Çünkü Nebiin kavminin onun yanına gitmek isteyenlere işkence ettiklerini yahut bizzat yanına gelmek isteyenler dolayısıyla Nebie işkence ettiklerini ya da onun işinin açığa çıkmasından hoşlanmadıkları için hakkında soru soranlara yol göstermediklerini veya onunla bir araya gelmeyi engellediklerini ya da onu bırakıp geri dönsün diye o soranı aldatmak istediklerini anlamıştı. \"Ali b. Ebi Talib onu gördü.\" Bu, Ebu Zerr'in başından geçen bu olayın Nebi sallallahu aleyhi ve sellem'e Nebiliğin verilmesinden iki seneden daha fazla bir süre geçtikten sonra cereyan etmiş olduğunu göstermektedir. Öyle ki Ali bu zaman zarfında tek başına yabancılarla konuşabilecek ve onları misafir olarak ağarlayabilecek bir konuma gelmişti. Çünkü sahih kabul edilen görüşe göre nubuwet verildiği sırada Ali 10 yaşında idi. Bundan daha küçük olduğu da söylenmiştir. Bu haber ise yaşı ile ilgili sahih kabul edilen görüşü daha da pekiştirmektedir. \"Kavminin yanına geri dön, onlara haber ver. Benim emrim sana gelinceye kadar...\" Ebu Kuteybe'nin rivayetinde şöyle denilmektedir: \"Bu durumu gizle ve kavminin yanına geri dönerek onlara haber ver. Bizim üstün geldiğimize (ya da durumumuzun açığa çıktığına) dair haber sana ulaşınca sen de geL\" Abdullah b. es-Samit'in rivayetinde şöyle denilmektedir: \"Benim önümde hurmalıkları olan bir yer bana gösterildi. Sen benden kavmine tebliği götürebilir misin? Belki Allah senin vasıtanla onlara fayda verir.\" Bundan sonra da kardeşi Uneys'in annesinin İslam'a giriş olayını zikretti, onların kavimleri Gıfar'a gittiklerini ve onların yarısının Müslüman olduklarını zikrettiği hadisi aktardı. \"Andalsun bunu yüksek sesle\" yani tevhid kelimesini bağırarak \"söyleyeceğim.\" Maksat onun yüksek sesle bunu müşrikler arasında açıkça söyleyeceğidir. O Nebi sallallahu aleyhi ve sellem'in kendisine gizleme emrini vermesinin vücub ifade etmek üzere değil, kendisine şefkati sebebiyle söylediğini anlamış gibidir. Böylelikle ona kendisinin bu işe gücünün yettiğini anlatmış oldu. Bundan dolayı da Nebi sallallahu aleyhi ve sellem onun bu işi yapmasına itiraz etmemiştir. Bundan hakkı söyleyen kimseye eziyet (ve işkence) yapacağından korkulan kimselerin yanında hakkı söylemenin -susmak caiz olsa bile- caiz olduğu anlaşılmaktadır. Meselenin tahkiki sonucu, bu hususun hükmü durumun ve maksatların farklılığına göre farklı olacağıdır, buna göre ecrin kazanılıp kazanılmayacağıdır. \"Sonra oradakiler kalktl.\" İbn Kuteybe rivayetinde: \"Bu Sabiı (dininden dönen)in üzerine kalkınız (hücum ediniz), dediler.\" \"Onlar da kalktılar.\" Müslüman olan kimseye SaM derlerdi. Çünkü bu kelime bir şeyden bir şeye intikal etmeyi anlatmak üzere kullanılan \"saba, yesbu\" fiilinden gelmektedir. \"Canını acıtacak kadar onu dövdüler.\" Ebu Kuteybe rivayetinde: \"Öleyim diye beni dövdüler.\" Yani beni öyle bir dövdüler ki, dövenler ondan dolayı ölseydim dahi buna aldırmazlardl. \"Bunun üzerine beni bıraktılar\" dövmekten vazgeçtiler. * * * Bu cümle Buhari'deki bu başlıkta bulunmamaktadır. Daha önce 3522 numara ile geçmiş bulunan Ebu Kuteybe rivayetinde yer almaktadır. (Fethu'l-Bari, VII, 214'deki dipnot). * * * \"el-Abbas onun üzerine abandı.\" Ebu Kuteybe yoluyla gelen rivayette: \"Bir önceki gün söylediği sözün aynışını tekrarladı\" şeklindedir. Hadiste el-Abbas'ın güzel tutum sergilediği ne ve onun güzel kavrayışlı olduğuna delil olacak ifadeler bulunmaktadır. Çünkü o, kavminden onları korkutarak Ebu Zerr'i kurtarmak sonucuna ulaşmıştır. Zira onun kavmi ticaret yollarını keserek onları uzaklaştırabilirdi. Mekkelilerin ise geçimleri ticarete bağlı idi. Bundan dolayı hemen onu dövmekten vazgeçtiler. Yine hadiste Ebu Zerr'in erken dönemde Müslüman olduğuna delil bulunmaktadır. Fakat açıkça görüldüğü \\,izere bu, Nebilikten uzun bir süre sonra olmuştur. Zira az önce kaydettiğimiz gibi Ali radıyall€ıhu anh'dan da söz edilmektedir",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 3862,
			"arabicnumber": 3862,
			"text": "Kays dedi ki: \"Ben Said b. Zeyd b. Amr b. Nufeyl'i Kufe mescidinde şöyle derken dinledim: Allah'a yemin ederim, ben kendimi şu halde gördüm: Ömer kendisi daha Müslüman olmadan önce beni Müslüman oldum diye bağlamıştı ve eğer Uhud dağı sizin Osman'a yaptıklarınız dolayısıyla yerinden kopsa, hiç şüphesiz bu gerçekleşmesi uygun olan bir şey olurdu.\" Bu Hadis 3867 ve 6942 numara ile gelecektir. Fethu'l-Bari Açıklaması: \"Said b. Zeyd\" b. Amr b. Nufeyl \"in müslüman olması\" Babası (Zeyd)'den daha önce söz edilmiş ve bunun Ömer b. el-Hattab'ın amcasının oğlu olduğu da belirtilmiş idi. \"Allah'a yemin ederim, ben kendimi şu halde gördüm\" Müslüman ulduğu için onu tahkir etmek üzere ve İslamdan dönmeye mecbur etmek amacıyla bağlamıştı. \"Eğer Uhud yerinden oynasa ... \" Bundan sonra gelecek olan rivayette \"yerinden oynaması da hakka uygun olurdu\" denilmektedir. el-İsmaill'nin rivayetinde ise \"bu hak olurdu\" şeklindedir. Yani böyle bir şey gerekirdi. Said bu sözü Osman'ı öldürmenin büyük bir iş olduğunu anlatmak için söylemiştir. O bu ifadeleri yüce Allah'ın şu buyruğundan hareketle söylemiştir: \"Bundan dolayı neredeyse gökler çatlayacak, yer yarılacak ve dağlar parçalanıp dağılarak yıkılacak. Rahman'a evi ad isnad ettiler diye.\" [Meryem, 90-91] İbnu't-Tın der ki: Said bu sözlerini temsili ifade olmak üzere söylemiştir. edDavudı der ki: Yani bütün kabileler harekete geçip Osman'ın intikamını isteyecek olsa buna değerdi. Ancak bu, uzak bir yorumdur",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 3863,
			"arabicnumber": 3863,
			"text": "Abdullah b. Mes'ud r.a. dedi ki: \"Ömer İslam'a girdikten sonra hep aziz (güçlü) olageldik",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 3864,
			"arabicnumber": 3864,
			"text": "Abdullah b. Ömer, babasının şöyle dediğini rivayet etmektedir: \"Kendisi evde korku ile duruyorken yanına el-As b. Vail es-Sehmi Ebu Amr üzerinde çizgili bir cübbe ve ipek şeritler konulmuş bir gömlek bulunduğu halde --ki o Sehm oğullarından olup, cahiliye döneminde bizimle antlaşmalı olanlardan idi-- dedi ki: Bu halin nedir? (Ömer) cevap verdi: Senin kavmin İslama girdiğim takdirde beni öldüreceklerini ileri sürüyorlar. el-As b. Vail: Onlar sana bir zarar veremezler, dedi. O bana bu sözü söyledikten sonra ben de kendimi güvende hissettim. el-As dışarı çıktı. İnsanların vadiyi bir sel gibi doldurmuş olduklarını gördü, nereye gitmek istiyorsunuz diye sordu. Onlar şu dininden dönen Hattab'ın oğlunun yanına gidiyoruz deyince, elAs: Hayır, buna imkan yok dedi ve bunun üzerine insanlar geri döndü.\" Bu Hadis 3865 numara ile gelecektir",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 3865,
			"arabicnumber": 3865,
			"text": "Amr b. Dinar Abdullah b. Ömer'den rivayetle dedi ki: \"Ömer Müslüman olunca insanlar onun evinin yanında toplandılar ve Ömer dininden döndü dediler. --Bu sırada ben küçük bir çocuktum ve odamın damında idim.-- Üzerinde ipekten bir kaftan bulunan bir adam geldi. Ömer dininden döndü, bu da ne oluyor? İşte ben onu himayeme alıyorum, dedi. (İbn Ömer) dedi ki: İnsanların yanlarından bölük bölük ayrılıp gittiklerini gördüm. Bu adam kim, diye sordum. Bu el-As b. Vail'dir dediler",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 3866,
			"arabicnumber": 3866,
			"text": "Abdullah b. Ömer dedi ki: \"Ömer'in bir şey için, ben onun böyle olduğunu zannediyorum, dediğini ne kadar işittimse mutlaka o şeyin onun zannettiği gibi olduğunu gördüm. Ömer oturuyorken yanından güzel bir adam geçti. Bunun üzerine Ömer, andolsun bunun hakkındaki zannım doğru çıkmadı, yahut bu cahiliye dönemindeki dini üzere devam etmektedir ya da cahiliye döneminde onların kahini idi, o adamı yanıma getirin, dedi. Adam yanına çağrılınca ona bunları söyledi. O adam dedi ki: Ben bugün gördüğüm şekilde bir Müslüman adamın bir şeyle karşılanmış olduğunu görmedim. Ömer dedi ki: Sana ant vererek söylüyorum ki, mutlaka bana haber vermelisin. Adam: Evet, ben cahiliye döneminde onların kahinleri idim, dedi. Ömer, Peki, sana haber getiren kadın cinnin sana getirdiği en şaşırtıcı neydi, diye sordu. Adam dedi ki: Bir gün ben çarşıda iken halinden korkuya kapılmış olduğunu anladığım bir vaziyette bana geldi ve cinlerin ne kadar ümitsiz olduğunu ve artık baş aşağı geri çevrildikten sonra ne kadar ümitlerini kestiklerini, develerinin yanına ve onların eğerleri altında konulanıara var(ıp sığın)dıklarını görmüyor musun, dedi. Ömer dedi ki: Doğru söylüyor. Ben bir gün onların putlarının yakınlarında bir yerde uyurken bir adam bir buzağı ile geldi ve onu boğazlayıverdi. Ona birisi yüksek sesle bağırdı. .Asla ondan daha yüksek sesle bağıran bir kimseyi işitmiş değilim. Şöyle diyordu: Ey açıkça düşmanlık eden kişi! Başarılı bir iş ortaya çıktı. Fasih bir adam senden başka hiçbir ilah yok, diyor. Bunun üzerine herkes ileri atıldı. Ben de, bunun ötesinde ne olduğunu öğrenmeden durmayacağım dedim. Sonra bir daha seslendi: Ey düşmanlığı açıkça olan bir kimse! Başarılı bir iş ortağı çıktı, fasih bir adam lajlahe illailah diyor. Ben de kalktım, aradan fazla zaman geçmemişti ki bize, bu bir nebidir denildi",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 3867,
			"arabicnumber": 3867,
			"text": "Kays dedi ki: \"Ben Said b. Zeyd'i etrafındakilere şöyle derken dinIedim: Ömer'in henüz daha Müslüman olmadan önce, beni ve kendi kız kardeşini Müslüman olmuşuz diye nasıl bağlamış olduğunu bir görseydiniz. Eğer Osman'a da yaptıklarınızdan dolayı Uhud çöküp yerinden gitse, gerçekten bu (yaptığınız işin büyüklüğüne göre) hak ve uygun bir şey olur.\" Fethu'l-Bari Açıklaması: 3864- \"Üzerinde çizgili bir elbise olduğu halde\" çizgili olarak dikilmiş burdeye \"hulletun habirun\" denilir. 38ti5- \"Bu da ne demek?\" Yani böyle bir şeyolmaz, kimse seni öldüremez, kimse sana ilişemez. \"Ben onu himayeme alıyorum.\" Kimsenin ona haksızlık etmesine karşı onu korumama alıyorum. 3866- \"Mutlaka onun zannettiği gibi olurdu.\" Bu da onun daha önce menkıbeleri anlatılırken muhaddes birisi olduğuna uygun bir açıklamadır. \"Bunun hakkındaki zannım doğru çıkmadı.\" İbn Ömer yoluyla gelen Beyhaki'nin kaydettiği rivayette şöyle denilmektedir: \"Ben feraset sahibi birisi idim. Şayet bu adam vaktiyle kahinlik yapan birisi değilse şu an için benim görüşüm doğru olamaz demektir.\" .. \"Andolsun o onların kahini idi.\" Yani kavmine kahinlik yapardı. Hulasa Omer iki tahmınde bulundu. Bu iki tahmininden birisinin de iki ihtimali vardı. Şöyle demiş gibidir: Benim bu zannım ya yanlıştır, ya doğrudur. Eğer doğru ise şu anda bu kişi ya küfrü üzere devam etmektedir ya da daha önce bir kahin idi. Durum sonuncusunun doğru olduğunu ortaya çıkarmıştır. Muhtemelen o bu halini yürüyüşünün şeklinden ya da bu zanna sahip olmasını etkileyen daha başka bir karineden tespit etmiştir. Doğrusunu en iyi bilen AlIah'hr. \"Ben sana and veriyorum.\" Muhammed b. Ka'b yoluyla gelen rivayette: \"Bi_ zim daha önceki müşrikliğimiz senin daha önce yapmış olduğun kahinliğinden daha büyüktür\" denilmektedir. \"Mutlaka bana haber vermelisin.\" Yani ben senden bana •haber vermeni istiyorum. Başkasını kabul etmem. \"Evet, ben cahiliye döneminde onların kahini idim.\" Kahin gaybı işlere dair haber getiren kimsedir. Cahiliye döneminde çok idiler. Onların önemli. bir çoğunluğu da bu hususta cinlerine tabi olurdu. Bazısı ise kendisine soru soranın sözlerinden hareketle meydana gelecek bazı işlerin daha önce ortaya çıkacak olan sebeplerini bildiği iddiasında bulunuyordu. Böyle olan kimseye de arraf adı verilir. İleride buna dair hükmün ne olduğu Tıp bölümünde (5758 nolu hadiste) açıkve anlaşılır bir şekilde gelecektir",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 3868,
			"arabicnumber": 3868,
			"text": "Enes b. Malik r.a. rivayete göre \"Mekkeliler Resulullah Sallallahu Aleyhi ve Sellem'den kendilerine bir ayet (belge) göstermesini istediler. O da kendilerine ayın iki parçaya bölündüğünü gösterdi. Öyle ki Hira dağını o iki parça arasında gördüler",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 3869,
			"arabicnumber": 3869,
			"text": "Abdullah r.a. dedi ki: \"Biz Nebi Sallallahu Aleyhi ve Sellem ile birlikte Mina'da bulunuyorken ay yarıldı. Şahit olunuz dedi. Ay'dan bir parça da dağ tarafına gitti.\" Ebu'd-Duha, Mesruk, Abdullah'tan: \"Mekke'de (ay) yarıldı\" diye rivayet etmiştir. Muhammed b. Müslim de, İbn Ebi Necih'den, o Mücahid'den, o Ma'mer'den, o Abdullah'tan diye ona mutabaatta bulunmuştur",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 3870,
			"arabicnumber": 3870,
			"text": "Abdullah b. Abbas r.a.: \"Ay, Resulullah Sallallahu Aleyhi ve Sellem zamanında yarıldı",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 3871,
			"arabicnumber": 3871,
			"text": "Abdullah r.a. dedi ki: \"Ay yarıldı.\" Fethu'l-Bari Açıklaması: \"Ayın\" Nebi Sallallahu Aleyhi ve Sellem döneminde onun bir mucizesi olmak üzere \"yarılması\" \"Nübuvvetin alametleri başlığı\"ndan sonra da bu anlamda bir başlık açmıştır. \"İki parçaya (ayrıldığını onlara gösterdi)\" Müslim de bu hadisi Buhari ile aynı yoldan Said'in, Katade'den diye zikrettiği bir rivayet olarak ve: \"Onlara ayın yarıldığını iki defa gösterdi\" lafzıyla zikretmiştir. Hocamız Hafız Ebu'I-Fadl'a ait \"Nazmu's-sıre\" adlı eserde şu ifadeler yer almaktadır: \"Ayın iki defa yarıldığı icma' ile kabul edilmiştir. Fakat hadis alimleri arasında ayın Nebi döneminde birden çok defa yarıldığını açıkça söyleyen kimse olduğunu bilmiyorum. Buhari ve Müslim'in şarihlerinden kimse de bu hususa el atmamıştır. İbnu'l-Kayyim bu rivayeti sözkonusu ederek şöyle demektedir: 'el-Merrat: Kereler, defalar' lafzı ile kimi zaman fiiller, kimi zaman da başka maddi şeyler kastedilir ama birinci anlam daha çok görülen bir husustur. \"Ay iki defa yarıldı\" rivayeti ikinci türdendir. Bazıları bu inceliği fark etmediğinden ayın yarılmasının iki defa ortaya çıktığını iddia etmiştir. Bu ise hadis ve sıret alimlerinin yanlış olduğunu bildikleri bir husustur. Böyle bir iş sadece bir defa gerçekleşmiştir. el-İmad b. Kesir der ki: \"İki defa\" ifadesinin bulunduğu rivayet üzerinde düşünmek gerekir. Muhtemelen bu ifadeyi kullanan kişi iki parçaya ayrıldığını söylemek. istemiştir. Derim ki: İşte bu husustaki rivayetleri telif etmek için başka türlü açıklamanın uygun görükmeyeceği tek açıklama budur. Daha sOnra hocamızın manzumesine baş vurdum, manzumedeki ifadelerin sözü geçen şekilde yorumlanmasının da muhtemelolduğunu gördüm. Lafızları şöyledir: \"Ve ay iki parça oldu. Bir parçası yükseldi, Bir diğer parçası ise dağın yakınına indL Bu ise icma' ile iki kere oldu, Hem nass ve sema' yoluyla nakledilen tevatürle böyledir.\" ° halde onun \"iki parça\" sözü ile \"iki kere\" sözünün açıklaması şöyle yapılabilir: 0, \"icma' ile\" derken birden çok gerçekleşmesini değil, bizzat yarılmasının esası ile ilgilidir. Bununla birlikte bizzat ayın yarılması ile ilgili icma'ın nakledildiğı hususu da su götürür. İleride buna dair açıklama gelecektir. \"Öyle ki Hira'yı ikisi\" ayın iki parçası \"arasında gördüler.\" Hira'nın Mekke'den Mina'ya giden kimsenin sol tarafında kalan bir dağ olduğuna dair açıklamalar Bed'u'l-vahy (Vahyin başlangıcı) bahsinde geçmiş bulunmaktadır. el-Hattabi der ki: Ayın yarılması diğer Nebilerin göstermiş olduğu ayetlerden (mucizelerden) hemen hemen hiç birisinin onunla boy ölçüşemeyeceği büyüklükte büyük bir ayet (mucize)dir. Çünkü bu, göklerin melekOtunda ve bu aHmin yapısında mürekkep (yerleştirilmiş) tabiatıardan (karakterlerden) farklı bir şekilde ortaya çıkmıştır. Herhangi bir yolla buna ulaşmak, bunu gerçekleştirmek ümit dahi edilemez. Bundan dolayı bu ayetin kesin bir deliloluşu daha bi.r açıktır",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 3872,
			"arabicnumber": 3872,
			"text": "Urve b. Zubeyr'den rivayete göre; Ubeydullah b. Adiy b. el-Hıyar'ın kendisine Misver b. Mahreme ile Abdurrahman b. el-Esved b. Abdi Yeğus'dan şöyle dediklerini haber vermektedir: Dayın Osman ile (onun anne bir) kardeşi Velid b. Ukbe hakkında konuşmaktan seni alıkoyan nedir? Çünkü herkes Osman'ın ona yaptıkları dolayısı ile çok konuşmaya başlamıştı. Ubeydullah dedi ki: Bunun üzerine ben de Osman namaza çıkıp giderken önüne çıktım ve, seninle görülecek bir işim var. Bu iş bir nasihattir, dedim. Ey adam senden Allah'a sığınınm dedi. Bunun üzerine ben de ayrılıp gittim. Namazı bitirdikten sonra el-Misver ile İbn Abdi Yeğus'un yanına oturdum. Ben de onlara Osman'a söylediğimi, onun da bana verdiği cevabı aktardım. Her ikisi de bana, sen üzerine düşeni yaptın, dediler. Ben onlarla birlikte oturuyorken, Osman'ın elçisi yanıma geldi. Bana: Allah seni sınıyor, dediler. Gittim ve Osman'ın yanına girdim. Bana, az önce sözünü ettiğin nasihatin neydi, dedi. (Ubeydullah) dedi ki: Önce kelime-i şahadet getirdim, sonra şunları söyledim: Şüphesiz Allah Muhammed Sallallahu Aleyhi ve Sellem'i Nebi olarak gönderdi. Üzerine Kitabı indirdi. Sen de Allah'ın ve Resulünün davetini kabul edip, ona iman edenlerden oldun. İlk iki hicrette bulundun. Resulullah Sallallahu Aleyhi ve Sellem'e sahabilik ettin, onun hareket ve tutumlarını gördün. İnsanlar ise Velid b. Ukbe hakkında çokça konuşur oldular. Dolayısıyla senin ona had uygulamak senin üzerinde bir hak oldu. Bana dedi ki: Kardeşimin oğlu, sen Resulullah Sallallahu Aleyhi ve Sellem'e yetiştinmi? Ben: Hayır dedim fakat örtüsünün arkasındaki bakire kıza kadar ulaşan ilmi bana da ulaştı. (Ubeydullah) dedi ki: Osman da kelime-i şahadet getirdikten sonra dedi ki: Şüphesiz Allah Muhammed Sallallahu Aleyhi ve Sellem'i hak ile gönderdi. Üzerine Kitabı indirdi, ben de Allah ve Resulünün davetini kabul edenlerden oldum. Muhammed Sallallahu Aleyhi ve Sellem ile gönderilenlere iman ettim. Senin de dediğin gibi ilk iki hicrette bulundum. Resulullah Sallallahu Aleyhi ve Sellem'e sahabelik ettim, ona bey'at ettim. Allah'a yemin ederim, Allah onun ruhunu kabzedinceye kadar ona itaatsizlik etmedim, onu aldatmadım. Daha sonra yüce Allah Ebu Bekir'e halifelik verdi. Allah'a yemin ederim, ona da karşı gelmedim ve onu da aldatmadım. Sonra Ömer halife oldu. Allah'a yemin ederim ona da karşı gelmedim, onu da aldatmadım. Arkasından ben halifelik makamına getirildim, onların benim üzerimdeki hakları ne idiyse, benim de sizin üzerinizde öyle hakkım yok mudur? (Ubeydullah), evet dedi. (Osman) dedi ki: O halde sizden bana ulaşan bu sözler (dedikodular) ne oluyor? el-Velid b. Ukbe'nin durumu ile ilgili olarak söylediklerine gelince, inşallah bu hususta biz hak olan ne ise onu yapacağız. (Ubeydullah) dedi ki: Velid'e de kırk celde vurdu. Ali'ye celdeyi vurması için emir verdi, ona celde vuran o oldu.\" Yunus ile Zühri'nin kardeşinin oğlu, Zühri'den şöyle dediğini nakletmektedirler: \"(Osman dedi ki): Onların hakı gibi benim de sizin üzerinizde hakkım yok mu?",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 3873,
			"arabicnumber": 3873,
			"text": "Aişe r.anha'dan rivayete göre \"Ümmü Habibe ile Ümmü Selerne Habeşistan'da iken gördükleri ve içinde suretler bulunan bir kiliseyi söz konusu ettiler. Onu Nebi Sallallahu Aleyhi ve Sellem'e anlattılar, o şöyle buyurdu: Onlar, aralarında salih bir insan öldüğü takdirde kabri üzerine bir mescit bina eder ve o mescidin içinde o suretleri yaparlardı. Bunlar kıyamet gününde Allah nezdinde insanların en şerlileridir",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 3874,
			"arabicnumber": 3874,
			"text": "Halid kızı Ümmü Halid dedi ki: \"Ben küçük bir kız iken Habeşistan'dan geri geldim. Resulullah Sallallahu Aleyhi ve Sellem bana üzerinde çizgiler bulunan bir elbise giydirdi. Resulullah Sallallahu Aleyhi ve Sellem eliyle o çizgilerin üzerini siliyor ve senah senah diyordu.\" Humeydı dedi ki: \"(Senah senah), güzel güzel demektir",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 3875,
			"arabicnumber": 3875,
			"text": "Abdullah r.a. dedi ki: \"Daha önce Nebi Sallallahu Aleyhi ve Sellem'e namazda olduğu halde selam veriyor, o da selamımızı alıyordu. Fakat Necaşı'nin yanından döndükten sonra ona selam verdik ama selamımızı almadı. Ey Allah'ın Resulü dedik, daha önce biz sana selam veriyorduk, sen de selamımızı alıyordun. Şöyle buyurdu: Şüphesiz namazda belli bir meşguliyet vardır.\" (Senedde yer alan ravilerden Süleyman dedi ki): \"Ben İbrahim'e: Sen nasıl yapıyorsun, diye sordum. O da İçimden selamı alıyorum, dedi",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 3876,
			"arabicnumber": 3876,
			"text": "Ebu Musa r.a.'dan rivayete göre \"Biz Yemen'de bulunuyarken Nebi Sallallahu Aleyhi ve Sellem'in Nebiliğini açıkladığı haberi ulaştı. Bunun üzerine biz. de bir gemiye bindik. Gemimiz bizi Habeşistan'da Necaşi'ye attı. Bu sırada Ca'fer b. Ebi Talib'e rastladık. (Medine'ye) gelinceye kadar onunla birlikte kaldık. Nebi Sallallahu Aleyhi ve Sellem'in Hayber'i fethi sırasında onunla karşılaştık. Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: Ey gemi yolcuları, sizin için iki hicret (sevabı) vardır.\" Fethu'l-Bari Açıklaması: \"Habeşistan'a hicret\" Yani Müslümanların Mekke'den Habeşistan'a hicretleri. Bu hicret iki defa gerçekleşmiştir. Siyer bilginlerinin naklettiklerine göre birincisi Nebiliğin beşinci yılında Receb ayında gerçekleşmiştir. İlk hicret eden kimseler arasında onbir erkek ve dört tane kadın vardı. İki kadın olduğu da söylenmiştir. Erkeklerin oniki olduğu da, on kişi oldukları da söylenmiştir. Deniz kıyısına yürüyerek gitmişler ve yarım dinar ücretle bir gemi kiralamışlardı. İbn İshak'ın naklettiğine göre buna sebep, Nebi Sallallahu Aleyhi ve Sellem'in müşriklerin onlara işkence ettiklerini, müşrikleri onlara işkence etmekten alıkoyamadığını görünce ashabına şunları söyledi: \"Habeşistan'da nezdinde kimsenin zulme uğramadığı bir kral vardır. Allah sizin için bir çıkış yolu takdir edinceye kadar keşke onun yanına gitseniz.\" Bu sebeple onlardan ilk hicret edenler arasında Osman b. Affan da vardı. Beraberinde de Resulullah Sallallahu Aleyhi ve Sellem'in kızı ve onun eşi Rukayye de vardı. Onların durumu ile ilgili haberlerin Resulullah salı allah u aleyhi ve sellem'e ulaşması bir parça gecikmişti. Yakub b. Süfyan, Enes'e kadar mevsul bir senedIe şöyle dediğini rivayet etmektedir: \"Her ikisine dair haberlerin Resulullah Sallallahu Aleyhi ve Sellem'e varması gecikmişti. Bir kadın geldi ve ona dedi ki: Andolsun ben o ikisini gördüm. Osman hanımını bir eşeğe bindirmiş idi. Allah Resulü bunun üzerine: Allah onlarla beraber olsun, dedi. Hiç şüphesiz Osman, Lut'tan sonra hanımıyla beraber hicret eden ilk kişi olmuştur.\" Derim ki: Buhari'nin bu başlığın başına Osman'ın hadisini zikrederek başlamasındaki nükte de ortaya çıkmaktadır. İbn İshak bu hicrete katılanların isimlerini de sıralamıştır. Bu hicrete katılan erkekler: Osman b. Affan, Abdurrahman b. Avf, ez-Zubeyr b. el-Awam, Ebu Huzeyfe b. Utbe, Mus'ab b. Umeyr, Ebu Selerne b. Abdu'l-Esed, Osman b. Maz'un, Amil b. Rabia, Suheyl b. Beyda ve Ebu Sebre b. Ebi Ruhm el-Amirl'dirler. İşte bu on kişi Müslümanlardan Habeşistan'a ilk çıkıp gidenlerdir. İbn Hişam der ki: Bana ulaştığına göre başlarında Osman b. Maz'un vardı. Beraberlerindeki hanımlara gelince, Nebi sallallfıhu aleyhi ve sellem'in kızı Rukayye, Ebu Huzeyfe'nin hanımı Sehl kızı Sehle, Ebu Seleme'nin hanımı ve Ebu Umeyye'nin kızı Ümmü Selerne, Amir b. Rabia'nın hanım i Ebu Hasme kızı Leyla. el-Vakidı de bu hanımların isimlerini ona uygun olarak vermiş, ayrıca Abdullah b. Mes'ud ile Hatıb b. Amr'ı da eklemiştir. İbn İshak ikinci hicrete katılanların da isimlerini vermektedir. Bunlar da seksen kişiden fazladıriar. İbn Cerir et-Taberi der ki: Bunlar hanımları ve çocukları dışında seksensekiz erkektiler. Ammar b. Yasir hakkında ise aralarında olup olmadığı hususunda şüphe etmiştir. Ammar ile erkeklerin sayısı otuzsekize ulaşmaktadır. Hanımların sayısının onsekiz olduğu da söylenmiştir. 38. NECAŞİ'NİN ÖLÜMÜ",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 3877,
			"arabicnumber": 3877,
			"text": "Cabir r.a.'dan: \"Nebi Sallallahu Aleyhi ve Sellem Necaşi öldüğünde buyurdu ki: Bugün salih bir insan öldü. Kalkın kardeşimiz Ashama'nın cenaze namazını kılınız",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 3878,
			"arabicnumber": 3878,
			"text": "Cabir b. Abdullah el-Ensari r.a.'dan rivayete göre; \"Nebi Sallallahu Aleyhi ve Sellem Necaşi'nin üzerine cenaze namazı kıldırdı. Bizi arkasında saf halinde dizdi. Ben ikinci ya da üçüncü safta idim",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 3879,
			"arabicnumber": 3879,
			"text": "Cabir b. Abdullah r.a.'dan rivayete göre, \"Nebi Sallallahu Aleyhi ve Sellem Necaşi Ashama üzerine cenaze namazı kıldırdı. Üzerine dört tekbir aldı.\" Abdussamed de ona mutabaatta bulunmuştur",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 3880,
			"arabicnumber": 3880,
			"text": "Ebu Hureyre r.a.'dan rivayete göre; \"Resulullah Sallallahu Aleyhi ve Sellem kendilerine vefat ettiği aynı günde Habeşistan sahibi (hükümdarı) Necaşi'nin vefat ettiğini haber verdi ve: Kardeşiniz için mağfiret dileyiniz, dedi",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 3881,
			"arabicnumber": 3881,
			"text": "Ebu Hureyre r.a.'dan rivayete göre; \"Resulullah Sallallahu Aleyhi ve Sellem, musallada onları saf halinde dizdi ve üzerine• namaz kıldırdı ve dört tekbir aldı.\" Fethu'l-Bari Açıklaması: \"Necaşi'nin ölümü\" Cenazeler bölümünde (1334 numaralı hadiste) onun ve babasının adı sözkonusu edilmiş idi. Necaşi'nin de Habeşistan'a kralalanların lakabı olduğunu da belirtmiştik. Burada Müslümanların onun yanına hicret etmiş olmaları sebebiyle onun vefatından bir istitrad olmak üzere sözkonusu edilmiştir. Onun vefatı çoğunluğun görüşüne göre hicretten sonra dokuzuncu yılda gerçekleşmiştir. Mekke'nin fethinden önce sekizinci yılda olduğu da söylenmiştir. Nitekim Beyhaki, Delailu'n-Nübuwe adlı eserinde bunu zikretmiş bulunmaktadır. Burası yeri olmakla birlikte Buhari'nin başlıkta onun Müslüman oluşunu sözkonusu etmeyip, Habeşistan hicretinden uzunca bir zaman sonra vefat 2tmiş olmasına rağmen onun vefatını bu başlıkta sözkonusu etmiş olması, açıklaması zor hususlardan birisi olarak görülmüştür. Buna şu şekilde cevap verilmiştir: Hangi vasıflarda Müslüman olduğuna dair açıklamalar ihtiva eden kıssa Buhari tarafından sabit görülmemiş olmakla birlikte, onun Müslüman oluşuna delalet eden hadis ona göre sabit olmuştur. Ayrıca bu hadis onun vefatı hususunda da açık ifadeler taşımaktadır. Böylelikle onun üzerine cenaze namazı kılınmış olduğundan Müslüman olduğu sonucuna ulaşılması için bu şekilde bir başlık açmış bulunmaktadır. Cenazeler bölümünde tu başlıktaki iki hadis hakkında gerekli açıklamalar daha önceden geçmiş bulunmaktadır.(Bk. 1318 nolu hadis)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 3882,
			"arabicnumber": 3882,
			"text": "Ebu Hureyre r.a. dedi ki: \"Reslilullah Sallallahu Aleyhi ve Sellem Huneyn üzerine yürümek isteyince şöyle buyurdu: İnşailah yarın konaklayacağımız yer onların küfür üzere yeminleştikleri yer olan Kinane oğulları Hayfi olacaktır.\" Fethu'l-Bari Açıklaması: \"Müşriklerin Nebi Sallallahu Aleyhi ve Sellem aleyhine yeminleşmeleri.\" Bu olay Nebiliğin yedinci yılı Muharrem ayının birinci günü olmuştur. Necaşi, Cafer'i ve beraberindekileri (Medine'ye yolcu etmek üzere) hazırlamış bulunuyordu. Geldiklerinde de Nebi Sallallahu Aleyhi ve Sellem Hayber'de idi. Bu olay ise o yılın Safer ayında olmuştur. (Bk. 1318 numaralı hadis) Muhtemelen Necaşi onları yolculamak üzere hazırladıktan sonra vefat etmiştir. Beyhaki'nin Oelailu'n-Nübuwe adlı eserinde Mekke'nin .feth.inden önce olduğu belirtilmektedir ki, doğru olma ihtimali daha yüksektir. ıbn ıshak, Musa b. Ukbe ve diğer Megazi bilginleri der ki: Kureyş ashab-ı kiram'ın em an (güvenlik) altında oldukları bir yere konakladıklarını, Ömer'in İslama girdiğini, İslamın kabileler arasında yayıldığını görünce Resulullah Sallallahu Aleyhi ve Sellem'i öldürmek kararını aldılar. Bu karar Ebu Talib'e ulaşınca o da Haşim oğulları ile Muttalib oğullarını topladı. Resulullah Sallallahu Aleyhi ve Sellem'i kendi mahallelerine aldılar ve onu kendisini öldürmek isteyenlere karşı korudular. Ebu Talib'in bu çağrısını aralarından kafir olanlar dahi kabul etti ve cahiliye adeti üzere hamiyet duygusuyla bu işi yaptılar. Kureyş onların bu davranışlarını görünce bu sefer kendileri ile Haşim ve Muttalib oğulları arasında kendilerine Resulullah Sallallahu Aleyhi ve Sellem'i teslim edecekleri vakte kadar onlarla hiçbir ilişkiye girmemek ve onlara kız alıp vermemek üzere bir belge düzenlemek hususunda ittifak ettiler. Onlar bu kararlarını uygulamaya koydular ve bu belgeyi de Ka'be'nin içine astılar. Bunu yazan kişinin adı Mansur b. İkrime b. Amir b. Haşim b. Abdi Menaf b. Abdu'd-Oarr b. Kusay olup, daha sonra parmakları felç oldu. İbn İshak der ki: Bunun üzerine Haşim oğulları ile Muttalib oğulları Ebu Talib'in yanında yer aldılar. Ancak Ebu Leheb müstesna, o Kureyşlilerle birlikte oldu. Oenildiğine göre onları boykotun başladığı tarih, Nebiliğin yedinci yılı Muharrem ayıdır. İbn İshak der ki: İki ya da üç yıl bu hal üzere devam ettiler. Musa b. Ukbe ise bu sürenin üç yılolduğunu kat'i olarak ifade etmiştir. Nihayet (Nebi ve Beraberindekiler) çok zor duruma düştü. Gizli saklı olması hali dışında onlara yiyecek hiçbir şey gelmiyordu. Hatta bazı akrabaları arasında akrabalık bağını gözetmek amacıyla gizli saklı bir şeyler gönderdiğini tespit ettikleri kimselere dahi işkence ediyorlardı. Bu hal sahifede yazılanları bozmak üzere faaliyete geçen ve bu hususta en gayretli çalışmalarda bulunan Hişam b. Amr b. el-Haris el-Amirı'nin harekete geçtiği vakte kadar devam etmiştir. Onun baba tarafından annesi kendi dedesi onunla evlenmeden önce Haşim b. Abdi Menarın nikahı altında idi. Bu sebeple onlar Ebu Talib şi'binde (mahallesinde) muhasara altında iken onları gözetirdi. Daha sonra Zuheyr b. Ebi Umeyye'nin yanına gitti. Onun da annesi Atike Abdulmuttalib'in kızı idi. Bu hususta onunla konuşunca ona muvafakat etti. Her ikisi kalkıp, Mut'am (Mut'im) b. Adiy'in ve Zem'a b. el-Esved'in yanına gittiler. Hepsi bu hususta görüş birliğine vardı. Hicr'de oturun ca bu hususta söz açtılar ve bunu reddettiler. Ona karşı çıkmak üzere de ittifak ettiler. EbuCehil, bu, geceleyin hazırlanmış bir plandır dedi. Sonunda sahifeyi (Ka'be'den) dışarıya çıkarttılar, yırtıp parçaladılar, hükmünü iptal ettiler. İbn Hişam'ın naklettiğine göre onlar bir kurdun, yüce Allah'ın adı dışında içindeki bütün yazıları yemiş olduğunu gördüler. el-Vakıdl'nin naklettiğine göre onların Şi'b'den dışarı çıkması, Nübuvvetin 10. yılında olmuştur. Bu da hicretten üç yıl önceye rastlar. Ebu Talib de oradan dışarı çıktıktan kısa bir süre sonra vefat etti. İbn İshak der ki: Ebu Talib ve Hatice aynı yılda vefat etmiştir. Bunun üzerine Kureyş Resulullah Sallallahu Aleyhi ve Sellem'e Ebu Talib hayatta iken yapmadıklarını yapmaya koyuldu. Bu anlatılanlardan Buhari'ye göre herhangi bir şey sabit görülmediğinden dolayı o bu hususta kıssanın aslına delalet etmesi için Ebu Hureyre yoluyla gelen hadisi zikretmekle yetinmiştir. İleride yüce Allah'ın izniyle Meğazi bölümünde Mekke'nin Fethi gazvesi ile alakalı hadisin açıklaması gelecektir. (bkz. 4284 nolu hadis)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 3883,
			"arabicnumber": 3883,
			"text": "Abbas b. Abdulmuttalib r.a., Nebi Sallallahu Aleyhi ve Sellem'e dedi ki: \"Senin amcana faydan ne oldu? O seni himaye ediyor, senin için kızıp öfkeleniyordu. (Allah Resölü) şöyle buyurdu: O topuklanna kadar varan bir ateştedir. Ben olmasaydım şüphesiz ateşin en aşağı basamağında olacaktı.\" Bu Hadis 6208 ve 6572 numara ile gelecektir",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 3884,
			"arabicnumber": 3884,
			"text": "İbn el-Müseyyeb, babasından rivayete göre; \"Ebu Talib'in vefatı yaklaşınca Nebi Sallallahu Aleyhi ve Sellem --Ebu Cehil de yanında bulunuyorken onun yanına girdi. Ey amcam Allah'ın huzurunda kendisini senin lehine delil gösterebileceğim bir söz olan la ilahe ilIallah de, dedi. Bunun üzerine Ebu Cehil ve Abdullah b. Ebi Umeyye: Ey Ebu Talib dediler. Abdulmuttalibrin dininden yüz mü çeviriyorsun? Onlar onunla konuşup durdular. Nihayet onlara söylediği son sözler: Abdulmuttalib'in dini üzere (ölüyorum), demek oldu. Nebi Sallallahu Aleyhi ve Sellem de: Bana yasaklanmadığı sürece andolsun senin için mağfiret dileyeceğim, dedi. Bunun üzerine de: \"O çılgm ateşlikler oldukları açıkça ortaya çıktıktan sonra akrabaları dahi o/sa/ar müşriklere Nebiin de, mu'minlerin de mağfiret dilemeleri olur şey değil. \" [Tevbe, 113] ayeti ile \"Şüpnesiz sen sevdiklerini hidayete iletemezsin.\" [Kasas, 56] ayetleri nazil oldu",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 3885,
			"arabicnumber": 3885,
			"text": "Ebu Said el-Hudri r.a.'dan rivayete göre \"O (Ebu Talib hakkında huzurunda konuşulunca) Nebi Sallallahu Aleyhi ve Sellem'i şöyle buyururken dinlemiştir: Belki Kıyamet gününde şefaatimin ona faydası olur da Kıyamet gününde topuklarına kadar ulaşacak ve bundan dolayı beyni kaynayacak olan hafif bir ateşe konulur.\" Bu Hadis 6564 numara ile gelecektir. Fethu'l-Bari Açıklaması: \"Ebu Talib'in kıssası.\" Adının, Abdi Menaf olduğu üzerinde ittifak vardır. Resulullah sallallShu aleyhi ve sellem'in babası Abdullah'ın öz kardeşidir. Bundan dolayı Abdulmuttalib vefat ettiğinde torununu ona vasiyet ederek bırakmış, o da büyüyünceye kadar ona bakmıştı. Nebi olarak gönderildiğinden sonra ölünceye kadar Ebu Talib hep ona yardımını sürdürmüştür. Onun Şi'bden çıkışlarından sonra öldüğünü belirtmiş idik. Bu da Nebiliğin onuncu yılı sonlarında olmuştur. Nebi sallallShu aleyhi ve sellem'i koruyor, onu rahatsız edecek her şeye karşı onu savunuyordu. Bununla birlikte o kavminin dini üzere kalmaya devam ediyordu. Az önce İbn Mes'ud'un rivayet ettiği: \"Resulullah Sallallahu Aleyhi ve Sellem'e gelince, Allah onu amcası vasıtasıyla korumuştu\" şeklindeki hadis geçmiş bulunmaktadır. Ebu Talib'in Nebi Sallallahu Aleyhi ve Sellem'i himaye etmesi, onu savunması bilinen ve meşhur bir husustur. Bu hususta onun meşhur şiirleri arasında şu beyit de vardır: \"Allah'a yemin ederim hep birlik olsalar dahi sana ulaşamayacaklardır Ta ki ben toprağa uzanıp gömülünceye kadar\" \"Seni koruyordu\" seni kollayıp, gözetliyordu. Bu ibarede İbn İshak'ın sözkonusu ettiği şu hususa da bir işaret vardır: Daha sonra Hatice ve Ebu Talib hicretten üç yıl önce aynı yılda vefat ettiler. Hatice, İslam yolunda kendisi ile huzur bulduğu son derece doğru ve samimi bir yardımcı idi. Ebu Talib de kavmine karşı ona bir destek ve bir yardımcıydı. Ebu Talib öldükten sonra Kureyşliler Resuluilah Sallallahu Aleyhi ve Sellem'e Ebu Talib hayatta iken asla ummadıkları bir seviyede rahatsızlık verdiler. Hatta Kureyş'in beyinsizlerinden birisi onun karşısına çıkmış, başının üzerine toprak atmıştı. Bana Hişam b. Urve'nin babasından naklettiğine göre o şöyle demiştir: Bunun üzerine Resulullah sallallahu aleyhi ve selle m evine girerken şöyle diyordu: \"Ebu Talib ölünceye kadar Kureyşliler bana hoşuma gitmeyecek bir şey yapamamışt!.\" \"O topuklarına kadar varan bir ateş içindedir.\" (Topuklarına kadar varan ateş diye tercüme ettiğimiz) 'ed-dahdah' topuğa varan su demektir. Yani onun azabı hafifletilmiş bulunmaktadır. Müslim'de yer alan İbn Abbas'ın rivayet ettiği hadiste şöyle denilmektedir: \"Hiç şüphesiz cehenl1em ehli arasında azabı en hafif olan kişi Ebu Talib'dir. Onun beynini kaynatan ayakkabıları olacaktır.\" Rafızilerden birisinin derlediği ve Ebu Talib'in Müslüman olduğuna delalet eden pek çok vahi (gevşek, senedi sağlam olmayan) hadisi bir araya getirdiği bir cüz gördüm. Bunların hiçbiri sabit değildir. Başarı Allah'tandır. Ben bunları elİsabe adlı eserin Ebu Talib'in hayatını anlatan bölümünde özetledim. \"Ebu Talib'in ölüm vakti gelince\" yani henüz ölüm hırıltısı boğazına ulaşmadan ... \"Senin için tartışayım .. \" Cenazeler bölümünün sonlarında: \"Allah'ın huzurunda onunla senin lehine şahitlik edeyim\" lafzı ile geçmişti. Nebi Sallallahu Aleyhi ve Sellem Ebu Talib'in bu halde iken şahadet kelimesini getirmek istemeyişinden onun şu zanna sahip olduğunu anlamış gibidir: Ona göre böyle bir şey ölüm halinde söylendiğinde kendisine fayda sağlamayacaktır yahut da namaz ve benzeri diğer amelleri işlernek imkanını bulamadığından bu şahadetin faydasının olmayacağını sanmıştı. Bundan dolayı Nebi efendimiz, onun lehine delil getirip tartışmayı sözkonusu etmiştir . \"Şahitlik etme\" lafzına gelince, muhtemelen Ebu Talib bunun kendisine fayda sağlamayacağını zannetmiştir. Çünkü o vakit Nebi sallallahu aleyhi ve selle m ile birlikte mu'minlerden hiçbir kimse yanında bulunmuyordu. Resulullah saIJallahu aleyhi ve sellem de bunu söylemiş olduğuna dair lehine şahadette bulunacağını ve bunun kendisine fayda sağlayacağını belirterek gönlünü hoş etmek istedi. Ebu Hazim'in, Ebu Hureyre'den yaptığı ve İmam Ahmed'in naklettiği rivayette şöyle denilmektedir: \"Ebu Talib dedi ki: Eğer Kureyşliler beni ayıplamayacak ve, ölüm korkusundan başka bir sebeple bunu söylemiş değildir, demeyecek olsalardı bunu söyleyerek senin gönlünü hoş, gözünü aydın ederdim.\" Hadisten, müşrik yakın akrabayı ziyaret etmenin, hasta ise yanına gitmenin caiz olduğuna, ölümün ağır hastalığı halinde bile tevbenin kabul edileceğine delil vardır. Bu tevbe ölüm meleğinin görüleceği ana kadar makbuldür. O noktadan sonra kabul edilmez. Çünkü yüce Allah şöyle buyurmaktadır: \"Bizim azabırnızı gördüklerinde imanlarının onlara faydası olmadL\" Ayrıca kafir, hak olan şehadeti getirecek olursa azaptan kurtulur. Çünkü İslam kendisinden öncekileri yıkar. Kafirlerin azabı farklı farklıdır. Ebu Talib hakkında sözkonusu olan fayda da Nebi Sallallahu Aleyhi ve Sellem'in bereketi ile sahip olduğu özelliklerdendir. Nebi Sallallahu Aleyhi ve Sellem'in ona, la ilah e illailah demeyi teklif etmekle birlikte bu arada Muhammedu'r-Resulullah dememiş olmasının sebebi, her iki sözün artık tek bir söz gibi oluşundan dolayıdır. Muhtemelen Ebu Talib onun Allah'ın Resulü olduğundan emin idi, fakat tevhidi kabul etmiyordu. Bundan dolayı o \"nun\" kafiyeli (Nuniye) beyitlerinden birisinde şöyle demiştir: \"Davet ettin beni ve senin sadık olduğunu bildimben, Andolsun sen doğru söylemişsin ve önceden de emin birisi idin.\" Ek bir bilgi: Hayret verici denk düşmelerden birisi de şudur: Nebi sallallahu aleyhi ve seIJem'in amcaları arasında İslamın gelişine yetişenler dört tanedir. Bunlardan ikisi Müslüman olmadı, ikisi de Müslüman oldu. Müslüman olmayanların adı, Müslümanolanların adı ile aykırılık arzediyordu. Müslüman olmayanların asıl adı, Abdi Menaf olan Ebu Talib ile asıl adı Abdu'l-Uzza olan Ebu Leheb'tir. Oysa Müslüman olanların adları Hamza ile el-Abbas'dır",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 3886,
			"arabicnumber": 3886,
			"text": "Cabir b. Abdullah r.a.'dan rivayete göre o Resulullah Sallallahu Aleyhi ve Sellem'i şöyle buyururken dinlemiştir: \"Kureyş beni yalanlayınca ben de Hicr'de ayakta durdum. Allah bana Beytu'l-Makdis'i ayan beyan gösterdi. Ben de ona bakarak onun alametlerini onlara bildirmeye başladım.\" Bu Hadis 4710 numara ile gelecektir. Fethu'l-Bari Açıklaması: \"İsra hadisi ve yüce Allah'ın: \"Kulunu geceleyin yürüten ... in şam münezzehtir\" buyruğu ileride \"esra\" lafzı ile ilgili açıklamalar Subhan (İsra) suresinin tefsirinde yüce Allah'ın izniyle gelecektir. (4790 nolu hadis) İbn Dihye der ki: Buhari İsra gecesinin Mi'rac gecesinden farklı olduğu kanaatine meyyaldir. Çünkü o bunların her birisini ayrı bir başlıkta ele almıştır. Derim ki: Bunda ona göre bunların farklı olduğunu gösterecek bir delil yoktur. Aksine onun Namaz bölümünün baş tarafındaki sözleri her iki gecenin bir olduğu hususunda çok açıktır. Çünkü o: \"İsra gecesinde namaz nasıl farz kılındı\" diyebir başlık açmıştır. Namaz ise Mi'rac gecesinde farz kılınmıştır. O halde bu durum Buhari'ye göre bu iki gecenin bir olduğunun açık delilidir. Bunların her birisini ayrı bir başlıkta alış sebebine gelince, bu gecelerin her birinin -birlikte gerçekleşmiş olsalar dahi- bağımsız bir kıssa ihtiva etmesidir. Bu hususta varid olmuş haberlere göre de selef farklı kanaatlere sahiptir. Onlardan kimilerine göre İsra ile Mi'rac aynı gecede Nebi uyanıkken ve Nebilikten sonra ruh ve ceset ile birlikte gerçekleşmiştir. Muhaddislerin, fukahanın ve kelamcıların cumhuru bu görüşü benimsemiştir. Sahih haberlerin zahirieri de hep bu kanaat etrafında dönüp dolaşmaktadır. Bunu kabul edip, başka bir kanaate yönelmeye de gerek yoktur. Çünkü aklın bunu imkansız göreceği bir tarafı yoktur ki, ayrıca tevile ihtiyacı bulunsun. \"Subhan\"ın asıl anlamı tenzih içindir. Hayret ve şaşkınlık konumunda da kullanılır. Birincisine göre anlamı, yüce Allah' Resulünün yalancı olmasından münezzehtir. İkincisine göre de yüce Allah Resulüne ihsan ettiği nimetlerinden ötürü kulları hayrete düşmüştür. Emir anlamına gelme ihtimali de vardır. Kulunu yürüteni tesbih ediniz, demek olur. \"Esra\" ge'celeyin yürümek demek olan \"es-sery\"den gelmektedir. Beni yalanladıklarında\" Ahmed ve Bezzar tarafından hasen bir senedie rivayet edilmiş, İbn Abbas yoluyla gelen hadiste şöyle denilmektedir: Resulullah salla;lahu aleyhi ve sellem buyurdu ki: Geceleyin İsra'ya götürüldüğüm ve sabahı Mekke'de ettiğim sırada yanımdan Allah'ın düşmanı Ebu Cehil geçti ve bir şeyoldu mu, dedi. Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: Bu gece ben Beytu'l-Makdis'e götürüldüm. Ebu Cehil: Sonra da sabahı aramızda ettin öyle mi? Allah Resulü: Evet diye buyurdu. Ebu Cehil sordu: Peki kavmini çağıracak olursam onlara bunları anlatır mısın? Allah Resulü: Evet deyince, Ebu Cehil: Ey Kab b. Lueyl oğulları dedi. Bütün meclisler dağılarak onların yanına geldiler. Ebu Cehil: Hadi bana anlattıklarını kavmine de anlat, dedi. O da onlara anlattı. Kimi alkışlıyor, kimi hayret ederek elini başının üstüne koyuyordu. Peki, bize mescidi anlatabilir misin, dediler ve hadisin geri kalan bölümlerini zikretti. Bu rivayetin dışındaki diğer rivayetlerde İsra gecesi gördüğü şeylere dair açıklamalar da yer almaktadır. Bunlardan birisi de Nesai'de yer alanYezid b. Ebi Malik'in Enes'ten şöyle dediğine dair rivayetidir: \"Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: Bana eşekten yüksek, katırdan alçak bir binek getirildi.\" Bu hadiste şu ifadeler de yer almaktadır: \"Beraberimde Cibril olduğu halde (o hayvana) bindim ve yola koyuldum. İn ve namaz kıl dedi, ben de indim. Nerede namaz kıldığını biliyor musun, diye sordu. Sen Taybe denilen yerde namaz kıldın ve hicret edilecek yer burasıdır dedi.\" Yine bu rivayette dönüşü esnçısında yolda Kureyş'e ait bir kervana rastladığı, onlara selam verdiği, birilerinin: Bu Muhammed'in sesidir dediği de zikredilmektedir: Bu hadiste ayrıca onun Kureyşe bunu haber verdiği ve kervanlarının filan gün geleceğini bildirdiği de zikredilmektedir: Kervan öğle vakti ve önlerinde niteliklerini belirttiği deve bulunduğu halde geldi. Yezid b. Ebi Malik'in rivayetinde şu fazlal.ı!51a.r da yer almaktadır: \"Sonra Beytu'l-Makdis'e girdim. Benim için bütün nebiler biraraya geldi. Cibril beni öne geçirdi ve onlara imamlık yaptım.\" Abdurrahman b. Haşim b. Utbe'nin, Enes'ten naklettiği ve Beyhaki'nin Delailu'n-Nubuwe'de zikrettiği rivayette belirtildiğine göre; o yolun dışına çıkmış ve kendisini davet eden bir şeyin yanından geçmiş, Cibril ona yürü demiştir. Yine buradaki rivayete göre oldukça yaşlı bir kadının yanından geçmiş,\\bu nedir diy sormuş, Cibril yürü demiştir. Bir topluluğun yanından geçmiş, onlar ona selam vermişler. Cibril ona: Onların selamını al, demiştir. Hadisin sonunda da ona şunları söylemektedir: Seni çağıran kişi İblis'tir. O yaşlı kadın dünyadır, selam veren kimseler İbrahim, Musa ve İsa'dır .. Taberani ve el-Bezzar tarafından rivayet edilen Ebu Hureyre'nin zikrettiği hadiste de şöyle denilmektedir: \"Ekin eken ve biçen bir topluluğun yanından geçti. Ekinlerini biçtikçe eski haline dönüyordu. Cibril, bunlar mücahitlerdir dedi. Başları kayalarla yarılan bir topluluğun yanından da geçti. Başları yaralandıkça eski haline dönüveriyordu. Bunlar da başları ağırlaşarak namaza kalkmayanlardır, dedi. Avret yerleri üzerinde yamalar bulunan ve davarlar gibi etrafta yayılan bir topluluğun yanından geçti. Bunlar ise zekatı eda etmeyen kimselerdir, dedi. Çiğ ve kokuşmuş et yiyip buna karşılık pişmiş ve pek hoş eti bırakan bir topluluğun yanından geçti. Bunlar zinakarlardır, dedi. Bir demet ot topladığı halde onu taşıyamayıp, sonra onlara başkalarını da ekleyen bir adamın yanından geçti. Bu da yanındaki emaneti eksiksiz olarak geri vermediği hald başka emanet isteyen kimsedir, dedi. Dilleri ve dudakları (makaslarla) kesilen bir topluluğun yanından geçti. Bunlar kesildikçe eski hallerine geri dönüyordu. Bunlar fitne hatipleridir, dedi. Küçük bir delikten çıkan büyükçe bİr öküzün yanından geçti. Geri dönmek istiyor fakat buna gücü yetmiyordu. Bu bir söz söyleyip sonra söylediğine pişman olan, söylediği sözü geri almak istediği halde buna gücü yetmeyen kimsedir, dedL\" \"Yüce Allah bana Beytu'l-Makdis'i ayan beyan gösterdi.\" Denildiğine göre bunun anlamı şudur: Benimle onun arasındaki perdeleri açtı ve nihayet ben de onu gördüm. Şeyh Ebu Muhammed b. Ebi Hamza der ki: Göklere yükselmekten (Mi'racdan) önce Beytu'l-Makdis'e İsra'daki hikmet, hakkı söndürmek isteyen kimselere karşı hakkı açıkça ortaya koymak isteğidir. Çünkü Mekke'den semaya yükselip, mi'raca çıkmış olsaydı düşmanlara karşı gerekli beyan ve açıklamaya imkanı olmazdı. O kendisinin geceleyin Beytu'l-Makdis'e götürüldüğünü söyleyince ondan Beytu'l-Makdis ile ilgili daha önce _kendilerinin görmüş oldukları bir takım tanım ve cüz'i bazı hususlara dair sorular sordular. Ayrıca onun bundan önce bu sordukları şeyleri görmemiş olduğunu da biliyorlardı. Kendisi onlara sorduklarını haber verince böylelikle bir gece içerisinde, geceleyin Beytu'l-Makdis'e gittiğine dair söylediklerinde doğruluğunun muhakkak olduğu ortaya çıkmış oldu. Bu hususta onun verdiği haber doğru olduğuna göre, sözünü ettiği diğer hususlarda da onu tasdik etmek gerekir. Böylelikle bu, mu'minin imanını daha da arttırdı, inkarcı ve inatçının bedbahtlığının daha da artmasına sebep oldu. (Özetle)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 3887,
			"arabicnumber": 3887,
			"text": "Enes b. Malik b. Sa'saa r.a.'dan rivayete göre; \"Allah'ın Nebii Sallallahu Aleyhi ve Sellem kendisine İsra'ya götürüldüğü geceyi anlatarak şöyle buyurmuştur: Ben el-Hatim'de -ravi belki de el-Hicr'de demiştir- yatıyordum. Aniden bana birisi geldi. Şurdan şuraya kesti. -Katade dedi ki: Onu (Enes'i) yardı, dediğini de dinlemişimdir.- (Katade dedi ki:) Ben yanımda bulunan el-Carud'a dedim ki: Bununla neyi kastediyor? O, boğazından eteğine kadar -yine onu: \"Göğsünün üst tarafından eteğine kadar (yardı) dediğini de dinlemişimdir- Kalbimi çıkardı. Daha sonra yanıma iman ile dolu altından bir leğen getirildi. Kalbim yıkandı, sonra içi dolduruldu. Sonra da eski haline iade edildi. Arkasından bana beyaz renkli, katırdan alçak, eşekten yüksek bir binek getirildi. -el-Carud ona dedi ki: Ey EbU Hamza o binek Burak mıdır? Enes dedi ki: Evet, o adımını gözüyle gördüğü en son noktaya koyar.- O bineğe bindirildim. Cibril beni alıp götürdü. Nihayet dünya semasına kadar geldi. Açılmasını istedi. O kim diye soruldu, Cibril dedi. Beraberinde kim var, diye soruldu. Muhammed denildi. (Mi'rac için) Ona risalet verildi mi, diye soruldu, o evet dedi. Merhaba ona, onun gelişi ne güzeldir, denildi. Kapı açıldı. İçeri girdikten sonra orada Adem' ile karşı laştı m. Bu senin baban Ademidir, ona selam ver dedi. Ben de ona selam verdim, selamımı aldıktan sonra, salih oğluma ve salih nebiye merhaba, dedi. Sonra beni alıp ikinci semaya çıkardı. Açılmasını istedi. O kim diye soruldu, Cibril dedi. Beraberinde kim var diye soruldu, Muhammed dedi. Ona (Mi'rac için) risalet (haber, emir) verildi mi diye soruldu, evet dedi. Merhaba ona, onun gelişi ne güzeldir denildi. Kapı açıldı, içeri girince teyze çocukları olan Yahya ve İsa'yı gördüm. Bu Yahya, bu da İsa'dır, haydi onlara selam ver dedi, ben de selam verdim. Selamımı aldıktan sonra, salih kardeşimize ve salih nebiye merhaba dediler. Sonra beni alıp üçüncü semaya çıkardı, açılmasını istedi. O kim denildi, Cibril dedi. Beraberinde kim var diye soruldu. Muhammed dedi. Ona (Mi'rac için) risalet verildi mi diye soruldu, evet dedi. Merhaba ona, bu geliş ne güzel geliştir denildi, kapı açıldı. İçeri girdiğimde Yusuf ile karşılaştım. Bu Yusuftur, ona selam ver dedi. Ben de ona selam verdim. Selamımı aldıktan sonra salih kardeşime ve salih nebiye merhaba dedi. Sonra beni alıp dördüncü semaya çıkardı, açılmasını istedi. O kim denildi, Cibril dedi. Beraberinde kim var diye soruldu, Muhammed, dedi. Ona risalet verildi mi, diye soruldu. Evet, dedi. Merhaba ona, onun gelişi ne güzeldir, denildi. Kapı açıldı, içeri girdiğimde İdris'i gördüm. Bu İdris'tir, ona selam ver, dedi. Ben de ona selam verdim, selamımı aldıktan sonra salih kardeşime ve salih nebiye merhaba dedi. Daha sonra beni beşinci semaya çıkardı, açılmasını istedi. O kim diye soruldu, Cibril dedi. Beraberinde kim var diye soruldu, Muhammed dedi. Ona (Mi'rac için) risalet (haber) gönderildi mi diye sordu, evet dedi. Merhaba ona, onun bu gelişi ne güzel bir geliştir, denildi. İçeri girince Harun ile karşılaştım, bu Harun'dur ona selam ver dedi. Ben de ona selam verdim, selamımı aldıktan sonra, salih kardeşe ve salih nebiye merhaba dedi. Sonra beni alıp altıncı semaya çıkardı. Açılmasını istedi. O kim diye soruldu, Cibril dedi. Beraberinde kim var diye soruldu, Muhammed dedi. Ona (Mi'rac için) risalet (haber) gönderildi mi, diye soruldu, evet dedi. Merhaba ona, onun bu gelişi ne güzeldir, dedi. İçeri girdiğimde Musa ile karşılaştı m. Bu Musa'dır, ona selam ver dedi. Ben de ona selam verdim. O da selamımı aldıktan sonra: Salih• kardeşime ve salih nebiye merhaba, dedi. Yanından ayrılıp gidince ağlamaya başladı. Ona niçin ağlıyorsun diye soruldu, şöyle dedi: Ağlayışımın sebebi şu ki, benden sonra Nebi olarak gönderilen bir delikanlının ümmetinden cennete gireceklerin sayısı benim ümmetimden daha fazla olacaktır. Sonra beni yedinci semaya çıkardı. Cibril (kapısının) açılmasını istedi. O kim denildi, Cibril dedi. Beraberinde kim var diye soruldu, Muhammed dedi. Ona bi'set verildi mi (yani semaya gelmesi için haber gönderildi mi) diye soruldu, evet dedi. Merhaba ona, onun gelişi ne güzeldir dedi. Girince İbrahim ile karşılaştım. Bu senin babandır, ona selam ver dedi. Ben de ona selam verdim, selamımı aldıktan sonra, salih oğluma ve salih nebiye merhaba dedi. Daha sonra Sidretu'l-Müntehfı bana yaklaştırıldı. Onun meyvesinin Hecer testilerini, yapraklarının fil kulaklarını andırdığını gördüm. Bu Sidretu'l-Müntehfı'dır dedi. Orada dört de nehir gördüm, ikisi gizli ikisi açıktı. Bu iki nehir ne oluyor ey Cibril, diye sordum. Dedi ki: Gizli olan ikisi cennetteki iki ırmaktır, açıktan akan ikisi ise Nil ile Fırat'tır. Daha sonra bana el-Beytu'l-Ma'mur yakınlaştırıldı. Sonra birinin içinde şarab, birinin içinde süt, birinin içinde bal bulunan kaplar getirildi. Ben süt bulunan kabı aldım. İşte bu senin ve ümmetinin üzerinde olduğun fıtrattır dedi. Sonra bana her gün elli namaz olmak üzere namaz farz kılındı. Geri döndüğümde Musa'nın yanından geçtim. Sana ne emrolundu diye sordu. Ben, her gün elli vakit namaz ile emrolundum dedim. Senin ümmetinin her gün elli vakit namaz kılmaya gücü yetmez, şüphesiz Allah'a yemin ederim ki senden önce ben insanları denedim. İsrailoğulları ile çok uğraştım. Rabbine dön de ondan ümmetinin yükünü hafifletmesini dile, dedi. Ben de döndüm, üzerimden onunu kaldırdı. Musa'nın yanına döndüm. Yine önceki gibi söyledi. Geri döndüm, üzerimden bir onunu daha kaldırdı. Musa'nın yanına geri geldim, bana aynısını söyledi. Tekrar geri döndüm, benden onunu daha kaldırdı. Yine Musa'nın yanına döndüğümde bana aynısını tekrar söyledi. Bir daha geri döndüm, her gün on vakit namaz kılmakla emrolundum. Geri döndüm, yine Musa aynısını söyledi. Tekrar ben de geri döndüm. Her gün beş vakit namaz kılmakla emrolundum. Musa'nın yanına geri döndüğümde, sana ne emrolundu diye sordu. Ben, her gün beş vakit namaz kılmakla emrolundum dedim. Bana: Senin ümmetin her gün beş vakit namaz kılamaz, dedi. Çünkü ben senden önce insanları denedim. İsrailoğullarıyla alabildiğine uğraştım. Haydi Rabbine geri dön, ondan ümmetinin yükünü hafifletmesini dile. (Allah Resulü) buyurdu ki: Rabbimden çok istedim artık utanıyorum, fakat onun emrine rıza gösteriyorum, teslim oluyorum. Ayrılıp gidince bir münadi şöyle buyurdu: Ben farz kıldığımı gerçekleştirdim, kullarımın yükünü de hafiflettim",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 3888,
			"arabicnumber": 3888,
			"text": "İbn Abbas r.a. yüce Allah'ın: \"Sana gösterdiğimiz o rüyayı biz ancak insanlara bir fitne kıldık.\" [İsra, 60] buyruğu hakkında dedi ki: Bu Resulullah Sallallahu Aleyhi ve Sellem'in Beytu'l-Makdis'e İsra olunduğu gece gözleri ile gördüğü bir rüyadır.\" (İbn Abbas) dedi ki: \"Kur'an-ı Kerim'de lanet olunmuş ağaç ise Zakkum ağacıdır.\" Bu Hadis 4716 ve 6613 numara ile gelecektir. Diğer tahric edenler: Tirmizî, Tefsirul Kur'an Tirmizî: Bu hadis hasen sahihtir. Fethu'l-Bari Açıklaması: \"Mi'rac\" yuk5lmek anlamını ifade eden \"arace, ya'rucu\" fiilinden gelmektedir. Mi'racın zamanı hususunda görüş ayrılığı vardır. Nebilik verilmeden önce olduğu söylenmiş olmakla birlikte bu şaz bir görüştür. Ancak bu görüş, o zaman bunun rüyada gerçekleşmiş olduğu şeklinde yorumlanmıştır. Çoğunluğun kanaati bunun Nebilikten sonra olduğudur. Ancak ne vakit olduğu hususunda görüş ayrılığı vardır. Bir görüşe göre hicretten bir sene önce olmuştur. Bu İbn Sa'd ve başkalarının görüşü olup Nevevı de bunu açık bir dille ifade etmiştir. İbn Hazm ise işi aşırıya götürerek bu hususta icma' olduğunu nakletmiştir. Ancak bu görüş reddedilmiştir. Çünkü bu konuda ondan fazla görüş ayrılığı bulunmaktadır. Bunların bazılarını İbnu'l-Cevzi nakletmiş bulunmaktadır. Naklettiği bir gorüşe göre hicretten sekiz ay önce olmuştur, altı ay önce olduğu söylendiği gibi, hicretten üç sene önce olduğu da söylenmiştir ki, bunu da İbnu'l-Esir nakletmiş bulunmaktadır. (Kadı) Iyad ve onun arkasından Kurtubi ile Nevevı de ez-Zührilden rivayetle, mi'racın hicretten beş yıl önce olduğu da söylenmiştir. Iyad ve ona uyanlar bu görüşü tercih etmiş ve Hatice'nin, namazın farz kılınışından sonra Nebi efendimizle birlikte namaz kıldığı hususunda görüş ayrılığı bulunmadığını da delil olarak göstermiş(ler)dir. Oysa onun hicretten önce üç ya da ona yakın bir süre önce yahut beş yıl önce vefat ettiği hususunda görüş ayrılığı yoktur. Namazın da İsra gecesinde farz kılındığında görüş ayrılığı yoktur. Derim ki: Görüş ayrılığının olmadığını söylediği bütün hususlar tartışma konusudur. \"el-Hatlm'de -bazen de el-Hicr'de dedi-\" Burada el-Hatım'den kasıt, el-Hicr denilen yerdir. \"Birisinin bana geldiğini gördüm.\" Daha önce geçtiği gibi Cibril aleyhisseIam'dır. \"İman ile (doldurdu.)\" Bed'u'l-Halk bölümünde \"ve hikmet ile (doldurdu)\" şeklindedir. Nevevi der ki: Bunun anlamı şudur: Leğenin'lçerisinde öyle bir şey vardı ki onunla imanın kemali ve hikmetin kemali artış gösterir. Buradaki doldurmanın hakikat anlamı ile •kullanılmış olma ihtimali vardlManevi şeylerin müşahhaslaştırılması da Bakara suresinin bir gölge gibi gelmesi, ölümün koç suretinde görünmesi ile ilgili rivayetlerde de görüldüğü gibi caizdir. Aynı şekilde amellerin tartılması ve buna benzer diğer gayb halleri de böyledir. \"Kalbimi yıkadl.\" Müslim'in rivayetinde: \"Kalbimi çıkardı ve onu Zemzem suyuyla yıkadı\" şeklindedir. Bundan da Zemzem suyunun bütün sulardan daha faziletli olduğu anlaşılmaktadır. \"Salih oğluma ve salih nebiye ... \" Denildiğine göre Nebilerin onu sadece bununla nitelendirmelerinin ve bunu ardı arkasına sürdürmelerinin sebebi, \"salah (salih oluş)\"ın bütün hayrın özelliklerini kapsayan bir nitelik oluşundan dolayıdır. Bundan dolayı onların her biri, her bir nitelik belirtmelerinde bunu tekrarlamış bulunmaktadıriar. Salih kişi, Allah'ın ve kulların yerine getirilmesi gereken haklarını yerine getiren kimsedir. Bundan dolayı salih oluş, hayrın bütün manalarını kapsayan geniş kapsamlı bir kelimedir. Musa ile ilgili olay anlatılırken: \"Ben yanından ayrılırken ağladı, ona niçin ağlıyorsun denildi o, şunun için ağlıyorum, benden sonra Nebilik verilen bir gencin ümmetinden cennete girecekler, benim ümmetimden daha fazla olacaktır, dedi\" sözleri hakkında ilim adamları şöyle demiştir: Musa'nın bu ağlayışının sebebi -haşa- kıskaryçlık değildir. Çünkü o alemde kıskançlık, mu'min şahıslardan bile alınmış bir özelliktir. Yüce Allah'ın seçtiği kimseler hakkında nasıl düşünülebilir? Aksine onun ağlamasının sebebi, derecesinin yükseltilmesi sonucunu veren elde edemediği ecre duyduğu üzüntüdür. Çünkü onun ümmeti kendisinin ecrinin eksilmesi sonucunu verecek ş.ekilde ecirlerinin eksiltilmesini gerektiren çokça muhalif davranış ve hareketlerde bulunmuşlardır. Çünkü her bir Nebie kendisine uyanların ecri gibi de ecir verilir. Bundan ötürü onun ümmeti arasında ona uyanların sayısı bu ümmete nispetle sürelerinin uzunluğu ile birlikte bizim Nebiimize uyanların sayısından daha azdır. \"Genç (gulam)\" ifadesi de onun değerini eksiltmek için kullanılmış değildir. Yüce Allah'ın kudretine, kereminin büyüklüğüne dikkat çekmek için kullanılmıştır. Çünkü bu yaşta olan bir kimseye kendisinden önce ve yaşı ondan daha ileride olan hiçbir kimseye verilmemiş şeyleri yüce Allah ona vermiştir. Kurtubi der ki: Namaz hususunda Nebi sallallShu aleyhi ve sellem'in Rabbine dönmesini söyleyen kimsenin özellikle Musa aleyhisselam oluşundaki hikmetin sebebi şu olabilir: Musa'nın ümmeti de diğer ümmetierin mükellef kılınmadığı farz namazlar ile mükellef tutulmuşlardı. Bu da onlara ağır gelmişti. Bundan dolayı Musa aleyhisselam benzeri bir durumla karşılaşırlar diye Muhammed ümmetine şefkat göstermiştir. Buna da onun: \"Şüphesiz ben senden önce insanları denedim\" sözleri işaret etmektedir. \"Sonra bana Sidretu'l-Münteha ref' edildi.\" Maksat onun oraya yükseltilmesi yahut onun üzerine çıkartılması ve Sidretu'l-Münteha'nın ona görünmesi, gösterilmesidir. Ona Sidretu'l-Münteha adının veriliş sebebi, Müslim'de yer alan İbn Mes'ud'dan nakledilen hadiste beyan edilmiştir. Oradaki lafzıyla şöyledir: \"Resulullah sallAllahu aleyhi ve sellem İsra'ya götürülünce dedi ki: Sonra ben Sidretu'l-Münteha'ya kadar götürüldüm. Bu altıncı semadadır. Yerden yükselenler oraya kadar varır, ordan (yukarlara) alınır. Yukardan inenler de oraya varır ve ordan (aşağıya) indirilir. \" \"Bir de baktım ki onun meyveleri Hecer testilerini andırıyor.\" Hattabı der ki: Maksat onun meyvelerinin büyüklüklerinin testiler gibi olduğunu ifade etmektir. \"Açıktaki iki nehir ise Nil ve Fırat'tır.\" Nevevı der ki: Bu hadisten anlaşıldığına göre Nil'in ve Fırat'ın aslı cennettendir. Her ikisi de Sidretu'l-Münteha'nın dibinden fışkırmaktadır. Sonra yüce Allah'ın dilediği yerlerde yol alırlar, sonra da yere inerler. Arkasından yerde yollarını takip ederler, daha sonra yerden bir daha çıkarlar. Akıl bunu imkansız görmez. Haberin zahiri de buna tanıklık etmektedir. O halde dayanak alınması gerekir. Iyad'ın: Hadis, Sidretu'l-Münteha'nın kökünün yerde oluşuna delildir, çünkü hadiste şöyle demiştir: Nil ile Fırat o ağacın kökünden çıkar. Bu iki ırmak ise müşahede ile görüldüğü gibi yerden çıkmaktadır. O halde bu, Sidretu'l-Münteha'nın kökünün yerde olmasını gerektirir, şeklindeki sözüne gelince; Onun bu görüşü tenkit edilmiştir. Çünkü onların yani bu iki nehrin Sidretu'l-Münteha'nın kökünden çıkmalarından maksat, yerden ilk çıktıkları kaynak değildir. Özetle söyleyecek olursak, bu ağacın kökü cennettedir. Bu iki nehir de önce bu ağacın kökünden çıkarlar. Sonra yerde yerlerini alıncaya kadar yol alırlar, ondan sonra yerde kaynaklarından fışkırırlar. Buradaki ifadeler, Nil ile Fırat'ın asıl kaynakları cennetten olduğundan ötürü sularının faziletli olduğuna delil gösterilmiştir. Seyhan ile Ceyhan nehirleri de böyledir. \"Daha sonra birinde şarap, birinde süt, birinde bal bulunan kaplar bana getirildi. Ben içinde süt bulunan kabı aldım. Bu, senin üzerinde olduğun fıtrattır, dedi.\" Fıtrattan kas ıt da İslam dinidir. \"Sonra bana namaz farz kılındı.\" Namazın özellikle İsra gecesinde farz kılınmasındaki hikmet şudur: Nebi sallAllahu aleyhi ve sellem Mi'dıca yükseltilince, o gece meleklerin ibadetlerini gördü. Onların kiminin oturmaksızın ayakta, kiminin secdeye varmaksızın rüklida, kiminin hiç oturmadan secdede olduklarını gördü. Yüce Allah bütün bu ibadetleri kulun kıldığı her bifffikatte hem onun için, hem de ümmeti için -tumainine ve ihlas gibi şartlarıyla bJrlikte- bir arada toplamış oldu. İbn Ebi Cemre bu hususa işaret etmiş ve şunları söylemiştir: Namazın özellikle İsra gecesinde farz kılınması onun beyanının (öneminin) büyüklüğüne bir işarettir. \"Ben orayı geçince bir münadi bana şöyle seslendi: Ben farz kıldığımı yerine getirdim ve kullarımın yükünü hafiflettim.\" Bu, şanı yüce Allah'ın İsra gecesinde herhangi bir as1ta':tulunr:ıksızın nbisi Mhamme alalahu aleyhi ve sellem ile konuşmuş olduguna dafrtırılen en guçlu delıllerden bırısıdır. Hadis-i şerifte işaret ettiklerimizden başka şu hususlara da dikkat çekilmiş olmaktadır: 1- Semanın gerçek manada kapıları ve o kapılarda görevli koruyucuları vardır. 2- İzin istemek ve izin isteyen kimsenin: Ben filan kişiyim diyerek sadece benim dememesi gerekir. Çünkü böyle bir şey soru sormakla öğrenilmek istenen ile bağdaşan bir durum değildir. 3- Yürüyen oturana selam verir. İsterse yürüyen kişi oturandan daha faziletli olsun. 4- Fazilet ehli olan kimseleri sevinçle, merhabalaşarak, överek ve dua ederek karşılamak müstehaptır. 5- Fitneye maruz kalmayacağından emin olunan bir kimsenin yüzüne karşı methedilmesi caizdir. 6- Sırtını kıbleye ve başka yere vererek yaslanmak caizdir. Bu hüküm İbrahim'in el-Beytu'l-Ma'mur'a yaslanmış olmasından çıkartılır. el-Beytu'I-Malmur ise her bakımdan kıble olması yönüyle Ka'be gibidir. 7- Fiili olarak yapılmadan önce hükmün neshedilmesi caizdir. Namaz bölümünün baş taraflarında buna dair gerekli araştırma yapılmış bulunmaktadır. 8- Geceleyin yol almak, gündüzün yol almaktan faziletlidir. Çünkü İsra geceleyin gerçekleşmiştir. Bundan dolayı Nebi sallAllahu aleyhi ve sellem'in ibadeti de çoğunlukla gece idi. Yolculuklarını da çoğunlukla geceleyin yapardı. Ayrıca şöyle buyurmuştur: \"Geceleyin yol almaya bakınız, çünkü yer geceleyin dürüıür.\" 9- Tecrübe ve deney, çokça bilgiye göre istenilen maksadı elde etmekte daha güçlü bir yoldur. Bu da Musa aleyhisselam'ın Nebi sallaiıahu aleyhi ve sellem'e söylediği kendisinden önce insanlarla uğraşmış ve onları denemiş olduğunu söylemesinden anlaşılmaktadır. 10- Adetin hükmüne başvurulması ve daha üstte olanın vasıtası ile daha altta olana dikkat çekilmesi de anlaşılmaktadır. Çünkü geçmiş olan ümmetler beden itibariyle bu ümmetten daha güçlü idi. Musa aleyhisselam ise bundan daha azını yerine getirmeleri için İsrailoğulları ile uğraşmış olduğunu fakat onların kendisine muvafakat etmediklerini söylemiştir. 11- Bu hususa İbn Ebi Cemre işaret etmiş ve şunları söylemiştir: Bundan anlaşıldığına göre Halillik makamı rıza ve teslimiyet makamıdır. Kelim (Allah ile konuşmak) makamı ise nazlandırma ve hemhalalma makamıdır. Bundan dolayı Hz. Musa, Nebi Sallallahu Aleyhi ve Sellem'den yükün hafifletilmesini istemesini söylemiş, İbrahim aleyhisselam bunu söyleyen olmamıştır. Oysa Nebi salı allah u aleyhi ve sellem'in İbrahim aleyhisselam'a olan özel yakınlığı Musa aleyhisselam'a olan yakınlığından fazladır. Çünkü onun ata oluş makamı vardır. Ayrıca mevkisi daha yüksek ve onun dinine de tabi oluş sözkonusudur. 12- Şanı yüce Allah'tan çokça istekte bulunup dua etmek ve nezdinde çokça şefaati talep etmek müstehaptır. Çünkü Nebi Sallallahu Aleyhi ve Sellem namaz yükünün hafifletilmesi hususunda Musa aleyhisselam'ın teklifini kabul etmiştir. 13- Haya sahibi olmanın büyük bir fazileti vardır. 14- Nasihata ihtiyacı olan kimseye karşılıksız nasihatta bulunmak (güzeldir). İsterse bu hususta nasihat edecek olana danışılmamış olsun",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 3889,
			"arabicnumber": 3889,
			"text": "Bize Yahya b. Bukeyr anlattı, bize Leys Ukayl'den rivayetle, o da İbn Şihab'dan rivayetle anlattı. Yine bize Ahmed b. Salih anlattı, bize Anbese anlattı, bize Yunus, İbn Şihab'dan diye nakletti, dedi ki: Bana Abdurrahman b. Abdullah b. Ka'b b. Malik'in haber verdiğine göre Abdullah b. Ka'b -ki a'ma olduktan sonra babası Ka'b'ı yediyar idi- dedi ki: Ka'b b. Malik'i Nebi Sallallahu Aleyhi ve Sellem'den Tebuk gazvesinde geri kalışını anlattığı uzunca hadisinde şöyle derken dinledim ... İbn Bukeyr hadisin rivayetinde dedi ki: \"Andolsun Nebi Sonra ile birlikte İslam üzere ahitleştiğimizde Akabe gecesinde bulunmuştum. Ona karşılık (Bedir'de bulunmayışım dolayısıyla) Bedir'de bulunmuş olmayı -her ne kadar Bedir insanlar arasında ondan daha çok biliniyor ise de- sevrnem (tercih etmem)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 3890,
			"arabicnumber": 3890,
			"text": "Cabir b. Abdullah r.a. dedi ki: \"İki dayımla birlikte Akabe'de ben de bulundum.\" Bu Hadis 3891 numara ile gelecektir",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 3891,
			"arabicnumber": 3891,
			"text": "Cabir dedi ki: \"Ben babam ve iki dayım Akabe'de bulunanlardanız",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 3892,
			"arabicnumber": 3892,
			"text": "Aizullah b. Abdullah dedi ki: \"Ubade b. es-Samit, Resulullah Sallallahu Aleyhi ve Sellem ile birlikte Bedir'de bulunanlardan -ve Akabe gecesindeki ashabından idi- kendisine haber verdiğine göre Resulullah Sallallahu Aleyhi ve Sellem etrafında ashabından bir topluluk bulunduğu halde şöyle buyurdu: Geliniz, bana Allah'a hiçbir şeyi ortak koşmayacağınıza, hırsızlık yapmayacağınıza, zina etmeyeceğinize, çocuklarınızı öldürmeyeceğinize, elleriniz ve ayaklarınız arasında iftira edip düzeceğiniz bir bühtanda bulunmayacağınıza ve maruf olan hiçbir hususta bana karşı gelmeyeceğinize dair bey'at ediniz. Aranızdan bunu eksiksiz yerine getirenlerin ecrini vermek Allah'a aittir. Kim bunlardan herhangi birisini yapacak olup da dünyada bundan dolayı cezalandırılacak olursa, bu ceza onun için bir keffaret olur, kim de bunlardan bir şey işleyip de Allah onu setrederse işi Allah'a kalır. Dilerse onu cezalandırır, dilerese onu affeder. (Ubade) dedi ki: Biz de bunlar üzere onunla bey'atIeştik",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 3893,
			"arabicnumber": 3893,
			"text": "Ubade b. es-Samit r.a. şöyle dediği rivayet edilmiştir: \"Ben Resulullah Sallallahu Aleyhi ve Sellem ile bey'atleşen nakiblerden birisiyim. Devamla dedi ki: Biz onunla Allah'a hiçbir şeyi ortak koşmamak, hırsızlık yapmamak, zina etmemek, hak ile olması hali dışında Allah'ın haram kıldığı canı öldürmemek, kimsenin malını haksızca almamak;-bunları yaptığımız takdirde, (onu yapan hakkında) cennetlik olacağına hüküm vermemek üzere bey'atleştik. Eğer bunlardan birisini işleyecek olursak bu işe dair hüküm vermek de Allah'a aittir.\" Fethu'l-Bari Açıklaması: \"Nebi Sallallahu Aleyhi ve Sellem'e Mekke'de Ensarın heyet halinde gelmeleri ve Akabe bey'atL\" İbn İshak ve başkalarının zikrettiklerine göre Nebi Sallallahu Aleyhi ve Sellem, Ebu Talib'in vefatından sonra Taif'te bulunan Sakif kabilesine onları kendisine yardım etmeye davet etmek üzere çıkıp gitmişti. Daha önce Bed'u'I-Halk (yaratmanın başlaması) bölümünde açıklandığı üzere (3231 nolu hadis) onun bu isteğini kabul etmedikleri için o da Mekke'ye geri dönmüştü. Hac mevsimlerinde ise kendisini himaye etmeyi Arap kabilelerine teklif ediyordu. (İbn İshak'ın) farklı senetlerle zikrettiğine göre o Kindelilere, Ka'b oğullarına, Huzeyfe oğullarına, Amir b. Sa'saa oğullarına ve başkalarına gitmiş, fakat bunlardan hiçbirisi onun istediğini olumlu karşılamamışt!. Musa b. Ukbe, ez-Zühri'den naklen der ki: \"Bu yıllarda -yani hicretten önce kendisini (himaye etmeyi) kabileiere teklif ediyor ve her bir kavmin önderleri ile konuşuyordu. Onlardan sadece kendisini barındırmalarını ve korumalarını istiyor ve, sizden hiçbir kimseyi herhangi bir işi yapmaya zorlarnam, diyordu. Bunun yerine sizden beni bana eziyet edenlere karşı korumanızı istiyorum. Böylelikle Rabbimin risaletini tebliğ edebileyim. Fakat kimse onun istediğini kabul etmiyor, hatta şöyle diyorlardı: Bir adamın kendi kavmi onu daha iyi bilirler.\" Hakim, Ebu Nuaym ve Delailu'n-Nubuwe adlı eserinde Beyhaki hasen bir senedie İbn Abbas'tan şöyle dediğini rivayet etmektedirler: \"Ali b. Ebi Talib bana anlattı, dedi ki: Allah nebisine kendisini Arap kabilelerine (korumalarını) teklif etmesini emredince, onunla birlikte ben ve Ebu Bekir, Mina'ya çıktık. Nihayet Arapların meclislerinden bir meclise girdik. Ebu Bekir öne geçtL O iyi bir nesep bilgini idi. Kimlerdensiniz, diye sordu. Onlar, biz Rabia kabilesindeniz dediler. Siz Rabia'nın hangi kolundansınız diye sorunca onlar, biz Zuhl'deniz dediler -ve karşılıklı olarak konuşmalarını anlatan ve sonunda olumlu karşılık vermediklerini belirten uzunca açıklamalar ihtiva eden hadisi zikrettiler.- (Ali devamla) dedi ki: Daha sonra Evslilerle Hazredilerin medisine gittik. Bunlar ise Resulullah sallAllahu aleyhi ve sellem'in kendilerine Ensar adını verdiği kimselerdir. Çünkü bunlar kendisini barındırmak ve ona yardım etmek isteğine olumlu cevap vermişlerdi. (Ali devamla) dedi ki: Resulullah sallAllahu aleyhi ve sellem'e bey'at etmeden yerlerinden kalkmadılar.\" İbn İshak'ın zikrettiğine göre birinci Akabe bey'atinde bulunanlar şu aItı kişi idiler: Ebu Umame, Esa'd b. Zurare en-Neccarı, Rafi' b. Malik b. el-Adan elAdanı, Kutbe b. Amir b. Hadide, Cabir b. Abdullah b. Riab, Ukbe b. Amir -bu (son) üç kişi Seleme oğullarındandır- ile Malik b. en-Neccar oğullarından Avf b. el-Haris b. Rifaa'dır. İbn İshak der ki: \"Bana Asım b. Ömer b. Katade kavminden yaşlı bazı kimselerden naklen anlattı, dedi ki: Nebi sallAllahu aleyhl ve sellem onları görünce siz kimlerdensiniz diye sordu. Onlar, biz Hazredilerdeniz dediler. Peki sizinle konuşmak üzere oturmaz mısınız deyince, onlar olur dediler. Kendilerini Allah'ın yoluna çağırdı. Onlara Müslüman olmayı teklif etti, onlara Kur'an okudu. Allah'ın onların lehine yaptıklarından birisi de şu idi: Yahudiler onların yurtlarında onlarla beraber idi. Kitap ehli kimselerdi. EvsliIer ile Hazrediler de sayıca onlardan fazla idi. Bundan dolayı aralarında bir şeyolduğu zaman şöyle derlerdi: Pek yakında bir Nebi gönderilecek, artık onun gönderilme zamanı geldi. Biz dea Nebie uyacağız, onunla birlikte sizi öldüreceğiz. Nebi sallAllahu aleyhi vesellem onlarla (Hazredilerle) konuşunca bu anlatılanın o olduğunu anladılar. Biri diğerine, Yahudiler bu işte bizim önümüze geçmesin, dediler. Bunun üzerine iman edip onu tasdik ettiler. Kendi kavimlerini de davet etmek üzere yurtlarına geri döndüler. Onlara olanı haber verdiklerinde içinde Resulullah sallAllahu aleyhi ve sellem'in adı anılmadık kavimlerine mensup hiçbir kimsenin evi kalmadı. Ertesi sene hac mevsiminde onlardan oniki kişi Nebi ile bir araya geldi.\" İbn İshak der ki: \"Bana Ma'bed b. Ka'b b. Malik anlattı: Kardeşi Abdullah -ki Ensarın en bilginleri idi- kendisine anlattığına göre babası Ka'b kendisine anlatmıştır. Ka'b de Akabe'de bulunanlardan ve orada bey'atleşenlerden idi. Dedi ki: Kavmimizin müşrikleri ile birlikte haccetmek üzere çıktık. O zamana kadar namaz kılmış, fıkh etmiş (dini öğrenmiş) idik. Beraberimizde efendim,iz ve büyüğümüz olan el-Bera b. Ma'rur da vardı. Onun Ka'be'ye doğru namaz kılışını sözkonusu ederek- dedi ki: Bizler Mekke'ye vardığımı'da daha önceden Resulullah Sallallahu Aleyhi ve Sellem'i görmemiştik. Onu sorduk. O mescidde el-Abbas ile birliktedir, diye cevap verildi. Biz de içeri girdik, yanına oturduk. el-Bera ona kıbleyi sordu. Sonra da hacca gitmek üzere yola çıktık. Onunla Akabe'de buluşmak üzere sözleştik. Beraberimizde Cabir'in babası Abdullah b. Amr vardı ve henüz Müslüman olmamıştı. Ona İslamı anlatınca derhal Müslüman oldu ve Nakiblerden oldu. (Ka'b) dedi ki: Akabe'nin yakınında yetmiş üç adam toplandık. Beraberimizde Mazin oğullarından birisinin hanımı olan Ka'b kızı Ümmü Umare ile Selerne oğullarından birisinin hanımı olan Amr b. Adiy kızı Esma adında iki hanım da vardı. j Nebi beraberinde el-Abbas olduğu halde geldi. Söbayarak dedi ki: Şüphesiz Muhammed'in aramızdaki durumunu biliyorstınuz. Biz onu (ona zarar vermek isteyenlere karşı) koruduk. O güçlü bir ortamda bulunuyor. Eğer sizler onu kendisine davet ettiğiniz hususları ona karşı eksiksiz yerine getirmeyi ve ona muhalefet edenlere karşı onu korumayı istiyor iseniz biz sizi isteğinizle baş başa bırakabiliriz. Aksi takdirde şimdiden bu işten vazgeçiniz. (Ka'b b. Malik) dedi ki: Biz konuş ey Allah'ın Resulü, dedik. Kendin için istediğin sözü aL. O da konuştu. Allah'a davet etti, Kur'an okudu, İslama bağlılığı teşvik etti, sonra şöyle buyurdu: Hanımlannızı, evlatlarınızı neye karşı koruyorsanız beni de öylece korumanız şartıyla sizinle bey'atIeşiyorum. (Ka'b) dedi ki: el-Bera b. Ma'rur onun elini tutarak: Evet dedi\" ve hadisin geri kalanın! zikretti. Bu hadise göre Resulullah sallalli\\hu aleyhi ve selle m onlara dedi ki: \"Siz kiminle barış yaparsanız ben de onunla barış yaparım, kiminle savaşırsanız ben de onunla savaşırım. Sonra da, bana aranızdan on iki nakib gösterin, diye buyurdu.\" İbn İshak nakibleri de zikretmektedir. Nakibler şunlardır: Es'ad b. Zurare, RMi' b. Malik, el-Bera b. Ma'rur, Ubade b. es-Samit, Abdullah b. Amr b. Haram, Sa 'd b. er-Rebi, Abdullah b. Revaha, Sa 'd b. Ubade, el-Münzir b. Amr b. Hubeyş, Useyd b. Hudayr, Sa'd b. Hayseme ve Ebu'I-Heysem b. et-Teyyihan'dır. İbn İshak dedi ki: \"Bana Abdullah b. Ebi Bekr b. Hazm'in anlattığına göre Resulullah sallalli\\hu aleyhi ve sellem nakiblere, sizler havarilerin Meryem oğlu İsa'ya kefil oldukları gibi kavminize karşı kefilsiniz dedi. Onlar da, evet dediler.\" Yine onun zikrettiğine göre Kureyş'e bey'at haberi ulaştı. Ancak onlarla birlikte gelmiş olanlar böyle bir şeyin olmadığını söylediler. Aralarından müşrik olanlar -ki sayıca onlardan fazla idi, beşyüz kişi olduğu söylenmiştir- böyle bir şeyin olmadığına dair yemin ettiler. Çünkü onlar olan bitenden haberdar değillerdi. İbn İshak'ın belirttiğine göre Nebi sallalli\\hu aleyhi ve selle m bu on iki adam ile birlikte Abdu'd-Dar oğullarından Mus'ab b. Umeyr'i de göndermişti. Daha sonra onların kendilerine dini ve Kur'an'ı öğretmek üzere istekte bulunmaları üzerine kendilerine Mus'ab'ı gönderdiği de söylenmiştir. Mus'ab, Es'ad b. Zurare 'ye misafir oldu. Ebu Davud'un, Abdurrahman b. Ka'b b. Malik yoluyla şöyle dediği rivayet edilmektedir: \"Babam Cuma için ezanı işitince Es'ad b. Zurare'ye Allah'tan mağfiret dilerdi. Ona (sebebini) sordum dedi ki: Medine'de Cuma için bizi ilk toplayan kişi o olmuştu.\" Darakutni de İbn Abbas'tan şunu rivayet etmektedir: \"Nebi s.a.v. Mus'ab b. Umeyr'e Cuma için onları topla, diye mektup yazdı.\" Ensar'dan pek çok kimse Es'ad b. Zurare'nin de yardımcı olması suretiyle Mus'ab b. Umeyr vasıtası ile Müslüman oldu ve nihayet İslam Medine'de yayıldı. Bu ise onların bir sonraki sene yola çıkmalarına sebep oldu. Nihayet onlardan yetmiş kişi hatta daha fazla Akabe'de bulundu ve -daha önce geçtiği gibi- bey'atleştiler",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 3894,
			"arabicnumber": 3894,
			"text": "Aişe r.anha dedi ki: \"Ben altı yaşında iken Nebi Sallallahu Aleyhi ve Sellem benimle nikahlandl. Medine'ye geldiğimizde Haris b. Hazrec oğulları arasında konakladık. Ateşli bir hastalığa yakalandığımdan dolayı saçlarım kırılıp döküldü. (İyileştikten sonra) saçlarım artarak perçemim uzadı. Annem Ümmü Ruman --ben diğer kız arkadaşlarımla birlikte bir salıncakta iken-- gelip beni çağırdı. Ben de yanına gittim. Benden ne istediğini bilmiyordum. Elimden tuttu, evin kapısında drduruncaya kadar götürdü. Ben de hızlı ca soluk alıp duruyordu. J Nihayet nefesim biraz yavaşladı. Bundan sonra biraz su alarak onunla yüzümV ve başımı sildi. Sonra da beni evin içine soktu. Evin içinde Ensardan bazı kadınlar olduğunu gördüm. Hayırlı ve mübarek olsun, kısmetin hayırlı olsun, dediler. Beni o kadınlara teslim etti, onlar da benim üstümü başımı düzelttiler. Kuşluk vakti Resulullah Sallallahu Aleyhi ve Sellem yanıma girinceye kadar beni korkutacak bir şeyle karşılaşmadım. Kadınlar beni ona teslim ettiler. O gün dokuz yaşında idim.\" Bu Hadis 3896,5134,5156,5158 ve 5160 numara ile gelecektir",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 3895,
			"arabicnumber": 3895,
			"text": "Aişe r.anha rivayete göre \"Nebi Sallallahu Aleyhi ve Sellem kendisine, sen bana rüyada iki defa gösterildin. Seni ipek bir parça üzerinde görüyordum ve, bu, senin zevcendir, diyor, ben de açınca onun sen olduğunu görüyor- . dum. Eğer bu Allah'tan ise Allah onu gerçekleştirecektir, diyordum",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 3896,
			"arabicnumber": 3896,
			"text": "Hişam, babasından dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem Medine'ye (gitmek üzere) çıkmadan üç sene önce Hatice vefat etmişti. İki sene ya da ona yakın bir süre geçtikten sonra Aişe'yi o henüz altı yaşında iken nikahladı. Sonra dokuz yaşında iken onunla zifafa girdi.\" Fethu'l-Bari Açıklaması: \"Aişe'nin Medine'ye\" hicret edip \"gelmesi\" \"Onunla\" Medine'de \"gerdeğe girmesi\" Nebi efendimizin yanına Aişe'nin getirilmesi hicretin birinci yılı -ikinci yılı da denilmiştir- Şewal ayında olmuştur. \"Ve (saçım) arttı.\" İfadede şu takdirde hazfedilmiş sözler vardır: Daha sonra o hastalıktan iyileştim. Saçım da beslenip çoğaldı ve bir perçemim oldu. \"Kısmetin hayırlı olsun\" yani kısmetin, nasibin hayır olsun. \"Beni korkutacak bir şeyolmadı.\" Yani onun yanıma girişi dışında korkmamı gerektiren bir şeyle karşılaşmadım. O bununla durumu bilmeyen bir kimsenin yanına aniden girişini kinayeli olarak kastetmiş olmaktadır. Çünkü çoğunlukla böyle bir ani giriş, insanı korkutur. Sureti kendisine \"bir bez parçası üzerinde\" gös.teriliyordu.\"Onun sen olduğunu gördüm.\" Yüce Allah'ın izniyle ileride Nikah bölümünde (5125. hadiste) buna dair açıklamalar gelecektir. Ahmed ve Taberani hasen bir senedie Aişe'nin şöyle dediğini rivayet etmektedir: \"Hatice vefat ettiğinde Osman b. Maz'un'un hanımı Hakım kızı Havle dedi ki: Ey Allah'ın Resulü evlenmez misin? O da Olur, bildiğin bir kimse var mı diye sordu. Havle, evet, biri bakire, biri de duL. Bakire Allah'ın yarattıkları arasında en sevdiğin kişinin kızı olan Aişe'dir. Dul ise Zem'a kızı Sevde'dir. Allah Resulü, git, onların yanında benden söz et dedi. O da Ebu Bekir'in yanına gitti, bunun üzerine, o kardeşinin kızıdır, dedi. Allah Resulü ona, sen de ona sen benim İslam kardeşimsin, senin kızın da bana olur de, dedi. Bunun üzerine Ebu Bekir onun yanına gelerek ona Aişe'yi nik&hladı. Sonra Sevde'nin yanına gitti. Ona: Babana haber ver dedi. Babasına bunu anlatınca, babası da Sevde'yi Nebi ile evlendirdi.\" Bunu Taberatii de bir başka yoldan Aişe'den diye rivayet etmiştir. Aişe dedi ki: Resulullah sallallahu aleyhi ve selle m ve Ebu Bekir hicret ettiklerinde biz Mekke'de kalmıştık. (Alah Resulü) Medine'de yerIeştikten sonra Zeyd b. Harise ile Ebu Rafi'i• gönderdi. Ebu Bekir de Abdullah b. Ureykıt'ı gönderdi. Abdullah b. Ebi Bekre de beraberinde Ümmü ROman'ı, Ebu Bekir'in annesini, beni ve kızkardeşim Esma'yı bineklerine bindirerek getirmesine dair mektup yazdı. O da bizi alıp yola koyuldu. Zeyd ile Ebu Rafi' de Fatıma'yı, Üm mü Gülsum'u ve Zem'a kızı Sevde'yi götürdü. Zeyd hanımı Üm mü Eymen'i, iki çocuğu Eymen ile Usame'yi de aldı. Birlikte yol arkadaşlığı ettik ve nihayet Medine'ye geldik. Ben Ebu Bekir'in ailesi ile birlikte kaldım, Nebi Sallallahu Aleyhi ve Sellem'in ailesi de onun yanında konakladılar. O gün kendisi mescidi ve mescidin etrafındaki odaları bina ediyordu. Zem'a kızı Sevde'yi bu odalardan birisine yerleştirdi. O sırada da onun yanında kalırdı. Ebu Bekir ona, hanımın ile gerdeğe girmeni engelleyen nedir diye sordu. Bunun üzerine benimle gerdeğe girdL\" el-Maverdi der ki: Fukaha Aişe ile Sevde'den önce evlenmiştir. Muhaddisler ise Sevde ile Aişe'den önce evlenmiştir derler. Bu iki görüş şöylece telif edilebilir. O Aişe'yi nikahlamış olmakla birlikte onunla gerdeğe girmemişhAakat ondan önce Sevde ile gerdeğe girmişti. Derim ki: Taberani'den naklettiğim rivayet bu husustaki problemi ortadan kaldırmakta ve sözü geçen bu telifin uygun olduğunu ortaya koymaktadır. Doğrusunu en iyi bilen Allah'tır",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 3897,
			"arabicnumber": 3897,
			"text": "el-A'meş dedi ki: Ebu Vail'i şöyle derken dinledim: \"Habbab'ı (hasta iken) ziyaret ettik. Dedi ki: Allah rızasını isteyerek Nebi Sallallahu Aleyhi ve Sellem ile birlikte hicret ettik. Ecrimizi vermek de Allah'a ait oldu. Aramızdan kimisi ecrinden hiçbir şey almadan geçip gitti. Mus'ab b. Umeyr bunlardandır. Uhud günü öldürüldüğünde geriye çizgili bir elbisesi kalmıştı. Onunla başını örtecek olursak ayakları dışarıda kalırdı. Ayaklarını örtecek olursak başı dışarıda kalırdı. Restilullah Sallallahu Aleyhi ve Sellem bizlere başını örtmemizi ve ayakları üzerine de izhir otundan bırakmamızı emretti. Aramızdan kimisinin de mahsulleri olgunlaştı, işte bunlar da bu mahsullerini devşirmektedirler",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 3898,
			"arabicnumber": 3898,
			"text": "Alkame b. Vakkas dedi ki: Ömer r.a.'i şöyle derken dinledim: \"Ben Nebi Sallallahu Aleyhi ve Sellem'i -zannederim- şöylederken dinledim: Ameller niyet iledir. Kimin hicreti elde edeceği bir dünyalık yahut da evleneceği bir kadın için olursa onun hicreti hicret ettiği şey içindir. Kim de Allah ve Resulü için hicret ederse onun hicreti Allah'a ve Resulüne Sallallahu Aleyhi ve Sellem'e dir",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 3899,
			"arabicnumber": 3899,
			"text": "Mücahid b. Cebr el-Mekki'den rivayete göre Abdullah b. Ömer r.a.: \"Fetihten sonra hicret yoktur, derdi.\" Bu Hadis 4309,4310,4311 numara ile gelecektir",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 3900,
			"arabicnumber": 3900,
			"text": "Ata b. Ebi Rebah dedi ki: Ubeydullah b. Umeyr el-Leysl ile birlikte Aişe'yi ziyaret ettik. Ona hicret hakkında sorduk o da: \"Bugün hicret yoktur. mu'minlerden herhangi bir kimse, dini ile yüce Allahla ve Resulüne dininden ötürü fitneye maruz bırakılır korkusu ile kaçıyordu. Bu güne gelince Allah İslamı galip getirmiştir. Bugün herkes dilediği yerde Rabbine ibadet eder. Fakat cihfıd ve niyet (bakidir)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 3901,
			"arabicnumber": 3901,
			"text": "Aişe r.anha'dan rivayete göre Said dedi ki: \"Allah'ım, sen de bilirsin ki Resulünü yalanlayan ve onu (yurdundan) çıkartan bir kavme karşı senin uğrunda cihad etmekten daha çok sevdiğim hiçbir şey yoktur. Allah'ım, ben zannediyorum ki bizimle onlar arasında savaşı kaldırmış bulunuyorsun.\" Eban b. Yezid dedi ki: Bize Hişam, babasından naklen dedi ki: Bana Aişe haber verdi: (Sa'd): \"Senin nebini yalanlayan ve onu Kureyş'in arasından <;ıkartan bir kavme karşı ... \" (demiştir>",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 3902,
			"arabicnumber": 3902,
			"text": "İbn Abbas r.a. dedi ki: \"Resulullah Sallallahu Aleyhi ve Sellem'e kırk yaşında iken Nebilik verildi. (Bundan sonra) Mekke'de on üç yıl boyunca kaldı ve bu süre zarfında ona vahiy geliyordu. Sonra hicret etmekle emrolundu, o da hicret etti. (Hicret'ten sonra) on yıl muhacir kaldı ve altmış üç yaşında iken vefat etti",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 3903,
			"arabicnumber": 3903,
			"text": "İbn Abbas dedi ki: \"Resulul\\ah Sallallahu Aleyhi ve Sellem Mekke'de on üç yıl kaldı, altmış üç yaşında vefat etti",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 3904,
			"arabicnumber": 3904,
			"text": "Ebu Said el-Hudri r.a.'dan rivayete göre: Resulullah Sallallahu Aleyhi ve Sellem minber üzerinde oturdu ve şöyle dedi: Bir kulu, Allah, ona dünya güzelliklerinden dilediklerini vermek ile nezdindekileri seçmek hususunda serbest bıraktı. O da Allah nezdinde olanı seçti. Bunun üzerine Ebu Bekir ağladı, babalarımız, annelerimiz sana feda olsun dedi. Biz ona hayret ettik. Herkes, şu yaşlı adama bakınız. Resulullah Sallallahu Aleyhi ve Sellem, Allah'ın bir kulunu ona dünya güzelliklerini vermek ile nezdindekileri seçmekte muhayyer bırakmış olduğunu haber veriyor, o kalkmış babalarımız annelerimiz sana feda olsun, diyor. Meğer muhayyer bırakılan kişi Resulullah Sallallahu Aleyhi ve Sellem imiş. Ebu Bekir de bu işi aramızda en iyi bilen imiş. Resulullah Sallallahu Aleyhi ve Sellem ayrıca şöyle buyurdu: Şüphesiz arkadaşlığı ve malı hususunda insanlar arasında bana en çok fedakarlık etmiş olan kişi EbU Bekir'dir ve eğer ümmetim arasından bir Halil (candan dost) edinecek olsaydım, şüphesiz EbU Bekir'i edinirdim. Ancak İslam Halilliği vardır. EbU Bekir'in gediği müstesna- Mescide açılan hiçbir gedik kalmasın hepsi kapatılsın).\" Fethu'l-Bari Açıklaması: \"Nebi sallallahualeyhivesellem'in ve ashabının Medine'ye hicreti\" Nebi Sallallahu Aleyhi ve Sellem'in hicreti ile ilgili olarak İbn Abbas'tan gelen rivayete göre, ona Medine'ye hicret hususunda yüce Allah'ın şu buyruğu ile izin verilmiştir: \"Ve de ki: Rabbim beni doğruluk girdirişi ile girdir, doğruluk çıkarışı ile çıkar. Tarafından bana destekleyici üstün bir belge ver.\" [İsra, ı 80] Bu hadisi Tirmizi rivayet etmiş olup, o da Hakim de sahih olduğunu belirtmişlerdir. Hakim de Nebi efendimizin Mekke'den Akabe bey'atinden üç ay ya da ona yakın bir süre sonra çıkıp ayrıldığını zikretmektedir. Nebi sallAllahu aleyhi ve sellem'in ashabına gelince, onlardan Ebu Bekir esSıddik ile Amir b. Fuheyre onunla birlikte yola çıkmışlardı. Bundan önce ise iki Akabe arasında aralarında İbn Ümmü Mektum'un da bulunduğu bir topluluk Medine'ye çıkmışlardır. Denildiğine göre Medine'ye ilk hicret eden kişi Üm mü Seleme'nin kocası Mahzum oğullarından Ebu Selerne b. Abdi'l-Eşhel hicret etmiştir. Buna sebep ise onun Habeşistan'dan dönmesinden sonra eziyete maruz kalması idi. Tekrar Habeşistan'a hicret etmek üzere karar vermişken Ensardan oniki kişinin olayı ona ulaşınca Medine'ye yönelmiştir. Daha sonra ise az önce geçtiği gibi Ensardan Müslüman olanları İslam hakkında bilgilendirmek üzere Mus'ab b. Umeyr, Medine'ye gitmek üzere yola çıkmıştır. 3899- \"Bugün\" yani Mekke'nin fethedilmesinden sonra \"hicret yoktur.\" 3900- \"Mürninlerden herhangi bir kimse dinini kurtarmak için ... kaçardı.\" Aişe r.anha hicretin meşruiyetine dair gerekli açıklamalara ve bunun sebebinin dinde fitneye maruz kalma korkusu olduğuna işaret etmiştir. Hüküm illete bağlıdır. Buna göre nerede olursa olsun Allah'a ibadet edebilen bir kimsenin o yerden hicret etmesi icap etmez. Aksi takdirde icap eder. İşte bundan dolayı el-Maverdt şunları söylemektedir: Küfür şehirlerinden herhangi birisinde dinini açıkça ortaya koymaya gücü yeten bir kimse ile artık o şehir (belde), o kimse vasıtası ile Dar-ı İslam olur. Böyle bir yerde ikamet etmek oradan göç etmesinden. daha iyidir. Çünkü bu vesile ile başkasının da İslama girmesi ümit edilir. Cihad bölümünün baş taraflarında \"İslam idarecilerinin savaş çağrısına uymanın vücubu\" ile ilgili başlıkta İbn Abbas'ın: \"Fetihten sonra hicret yoktur\" diye rivayet ettiği hadis ile Abdullah b. es-Sa'dt'nin: \"Hicretin ardı arkası kesilmez\" hadisini birlikte telife işaret edilmiş bulunmaktadır. el-Hattabt de diyor ki: Hicret yani Nebi Sallallahu Aleyhi ve Sellem'in yanına gitmek, İslamın ilk dönemlerinde istenen bir 'şey idi. Daha sonra Nebi Sallallahu Aleyhi ve Sellem Medine'ye hicret ettikten sonra onunla birlikte savaşmak ve dinin şer'i hükümlerini öğrenmek amacıyla Medine'ye hicret etmek farz kılınmıştır. Şam yüce Allah bu hususu birden çok ayet-i keime'de tekitli bir şekilde ifade etmiş ve hatta hicret eden ile etmeyen arasındaki velilik bağını dahi kopartmış ve şöyle buyurmuştur: \"İman edip hicret etmyenıer ise hicret edene kadar sizin onlarla hiçbir velayetiniz yoktur.\"[Enfal, 72] Mekke fethedilip, insanlar bütün kabilelerden İslama girince farz olan hicret kalktı ve müstehap olarak devam etti. el-Beğavt, Şerhu's-Sünne adlı eserinde şunları söylemektedir: Nebi efendimizin \"Fetihten sonra\" yani Mekke'den Medine'ye \"hicret yoktur\" hadisi ile \"hicretin ardı arkası kesilmez\" buyruğunun bir başka yolla telif edilme ihtimali de vardır. Bu da Müslüman olan kimse için Dar-ı Küfür'den, Dar-ı İslam'a hicret etme gereğinin kesilmeyeceği anlamındadır. el-İsmail1'nin şu lafızIa naklettiği rivayette İbn Ömer maksadı açıkça ifade etmiş bulunmaktadır: \"Mekke fethedildikten sonra Reslilullah Sallallahu Aleyhi ve Sellem'in yanına hicret etme emri sona ermiştir fakat kafirlerle savaşıldığı sürece hicretin ardı arkası kesilmeyecektir.\" Yani dünyada küfür diyarı bulunduğu sürece Müslüman olup da dini dolayısıyla fitneye maruz kalmaktan korkan kimseye oradan hicret etmek vaciptir. Bundan anlaşıldığına göre; dünyada Dar-ı Küfr'ün kalmadığı var sayılacak olursa, bunu gerektiren sebebin sona ermesi dolayısıyla hicret te sona erer. Doğrusunu err--iyi bilen Allah'tır. 3903- \"On yıl muhacir kald!.\" Yani muhacir olarak on yıl ikamet etti",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 3905,
			"arabicnumber": 3905,
			"text": "Nebi s.a.v.'in eşi Aişe r.anha dedi ki: \"Aklım erdiğinden beri anne babamı hep dini kabul etmiş olarak hatırlıyorum. ResuluIlah Sallallahu Aleyhi ve Sellem'in günün iki tarafında, sabah akşam bize gelmediği bir günümüzün geçtiği de olmuyordu. Müslümanlar belalara maruz kalınca Ebu Bekir Habeşistan topraklarına doğru hicret etmek üzere çıkıp gitti. Nihayet Berk el-ğimad denilen yere ulaşınca Kare kabilesinin efendisi olan İbnu'd-Dağine onunla karşılaştı. Ona: Ey Ebu Bekir nereye gitmek istiyorsun diye sordu. Ebu Bekir ona dedi ki: Kavmim beni dışaı çıkardı. Bu sebeple ben de yeryüzünde dolaşmak ve Rabbime ibadet etmek istiyorum. İbnu'd-Dağine dedi ki: Ey Ebu Bekir, senin gibi birisi ne çıkar, ne çıkartılır. Çünkü sen hiçbir şeye sahip olmayana mal verirsin. Akrabalık bağını gözetirsin, çaresiz kalmış kimselerin yükünü kaldırmasına yardım edersin. Misafire ikram edersin. Haklı olunan hallerde karşı karşıya kalınan musibetlere karşı da yardımcı olursun. Ben seni himayeme alıyorum. Geri dön ve kendi şehrinde Rabbine ibadet et. Ebu Bekir geri döndü, İbn ed-Dağine de onunla beraber bineğine binerek gitti. İbnu'd-Dağine akşama doğru Kureyş eşrafını dolaşarak onlara dedi ki: Şüphesiz Ebu Bekir gibi bir kimse ne yurdundan çıkar, ne de çıkartılır. Sizler hiçbir şeyi olmayana bir şeyler veren, akrabalık bağını gözeten,' yükünü kaldıramayan kimsenin yükünü taşımasına yardımcı olan, misafiri ikram edip ağırlayan, haklı olunan hallerde musibetler'e karşı karşıya kalındığı takdirde yardımcı olan birisini mi şehrinizin dışına çıkartacaksınız? Kureyş İbnu'd-Dağine'nin 0'nu himayesine almasına karşı çıkmadı. İbnu'dDağine'ye dediler ki: O halde Ebu Bekir'e söyle de Rabbine evinde ibadet etsin, orada namazını kılsın ve orada dilediği kadar (Kur'an) okusun. Bunları yaparak bizleri rahatsız etmesin ve bu işini açık bir şekilde yapmasın. Çünkü bizler kadınlarımızın ve çocüklarımızın fitneye maruz kalmalarından (dinleri hakkında tereddüte düşmelerinden) korkuyoruz. İbnu'd-Dağine bunları Ebu Bekir'e söyledi. Ebu Bekir bir süre böylece devam etti. Evinde Rabbine ibadet ediyor, namazını açıktan kılmıyor, evi dışında bir yerde Kur'an okumuyordu. Daha sonra Ebu Bekir'in hatırına bir başka fikir geldi. Evinin avlusuna bir mescid bina etti. Orada namaz kılıyor, Kur'an okuyordu. Bunun üzerine müşriklerin kadınları ve çocukları onun etrafında gelip toplanıyorlardı. Onun bu haline hayret ediyor veseyrediyorlardı. Ebu Bekir Kur'an okuduğu vakit gözlerine hakim olamayarak çokça ağlayan bir adam idi. Bu hal Kureyş'in müşrik eşrafını korkutmaya başladı. Bunun için İbnu'd-Dağine'ye haber gönderdiler. O da yanlarına gelince dediler ki: Biz senin Ebu Bekir'i himaye etmeni kabul etmiştik. Ancak Rabbine evinde ibadet etmesi şartıyla bunu kabul etmiştik. O bu şartı çiğneyerek evinin avlusunda bir mescid bina etti, açıkça namaz kılmaya ve orada Kur'an okumaya başladı. Bizler ise hanımlarımızı ve çocuklarımızı dinleri hususunda tereddüte düşürmesinden korktuk. Ona bu işten vazgeçmesini söyle. Şayet yalnızca kendi evi içerisinde Rabbine ibadet etmek ile yetinmeyi arzu ederse yapsın. Şayet bunu açıkça yapmaktan başka bir teklifi kabul etmezse ondan senin himayeni tekrar sana geri iade etmesini söyle. Çünkü biz senin himayeni bozmak istemedik. Fakat bizler Ebu Bekir'in açıkça ibadet etmesini de kabul etmiyoruz. Aişe (devamla) dedi ki: Bunun üzerine İbnu'd-Dağine Ebu Bekir'e gelerek dedi ki: Benim senin için, nasıl akit1eştiğimi biliyorsun. Ya bu akdin hududu içerisinde kalırsın yahut da bana himayeni geri verirsin. Çünkü ben Arapların, kendisine bir himaye verdiğim bir kimseye karşı bu ahdimi bozduğumu işitmesini istemiyorum. Bunun üzerine Ebu Bekir, ben de senin himaye ni sana geri iade ediyorum, buna karşılık yüce Allah'ın himayesine razıyım, dedi. O sırada Nebi henüz Mekke'de idi. Nebi Müslümanlara: Bana hicret edeceğiniz yer iki kara taşlık arasında hurmalıklı bir yer olarak gösterildi, dedi. Bu iki kara taşlık (Medine'nin) iki Harresidir. Bu sefer hicret edenler Medine'ye doğru hicret etti. Daha önce Habeşistan'a hicret etmiş olanların hepsi de Medine'ye geri döndü. Ebu Bekir de Medine'ye gitmek üzere hazırlandı. Fakat Resulullah Sallallahu Aleyhi ve Sellem kendisine: Acele etme! Çünkü ben bana da (hicret için) izin verileceğini ümit ederim dedi. Bu sefer Ebu Bekir: Babam sana feda olsun, böyle bir şey ümit ediyor musun diye sordu. Evet, diye cevap verdi. Bunun üzerine Ebu Bekir de Resulullah Sallallahu Aleyhi ve Sellem ile birlikte gitmek için hicret etmekten geri kaldı. Yanında bulunan iki deveyi de dört ay boyunca Arabistan kirazı yapraklarıyla besledi. Aişe dedi ki: Bir ara biz öğle sıcağına doğru Ebu Bekir'in evinde oturmakta iken birisi Ebu Bekir'e, işte Resulullah, yüzünü örtmüş olduğu halde geliyor, dedi. -Allah Resulünün de o saatte bize gelmek adeti yoktu.- Ebu Bekir, babam anam ona feda olsun, Allah'a yemin ederim bu saatte onun gelmesi için mutlaka önemli bir sebep vardır, dedi. (Aişe) dedi ki: Resulullah Sallallahu Aleyhi ve Sellem geldi ve izin istedi. Ebu Bekir de ona izin verince içeri girdi. Nebi Sallallahu Aleyhi ve Sellem, Ebu Bekir'e: Yanında kim varsa dışarı çıkart, dedi. Ey Allah'ın Resulü, babam sana feda olsun. Bunlar senin ehlin(yakınların)dir, dedi. Allah Resulü: (Mekke'den) çıkmak hususunda bana izin verildi, dedi. Ebu Bekir: Ben de seninle yol arkadaşı mıyım? Babam sana feda olsun ey Allah'ın Resulü, dedi. Resulullah Sallallahu Aleyhi ve Sellem: Evet diye buyurdu. Ebu Bekir: Babam sana feda olsun ey Allah'ın Resulü, şu iki devemden birisini al, dedi. Resulullah Sallallahu Aleyhi ve Sellem: Bedelini ödemek şartıyla dedi. Aişe dedi ki: Biz de alelacele onların hazırlıklarını yaptık. Bir heybeye onlara yiyeceklerini koyduk. Ağzı bağlanacağı sıra Ebu Bekir'in kızı kardeşim Esma belinin kuşağından bir parça yırtıp ayırdı ve onunla dağarcığın ağzını kapattı. Bu cihetle Esma'ya \"Zatu'n-Nitakayn: İki kuşaklı\" denildi. Aişe der ki: Sonra Resulullah Sallallahu Aleyhi ve Sellem ile Ebu Bekir, Sevr dağındaki bir mağaraya gittiler ve orada üç gece gizlendiler. Her gece yanlarında Ebu Bekir'in oğlu Abdullah gecelerdi. Abdullah becerikli; anlayışlı bir genç delikanlı idi. Seher vakti Resulullah ile Ebu Bekir'in yanından ayrılır, geceyi Mekke'de geçirıniş gibi Kureyş ile sabahlardı. Abdullah, Allah Resulü ile Ebu Bekir hakkında Kureyş müşriklerinin hazırladıkları hilelerden duyduklarını iyice beller, karanlık basınca gider Resulullah ile Ebu Bekir'e haber verirdi. . Ebu Bekir'in kölesi Amir b. Fuheyre bol süt1ü, sağmal koyun otlatır ve akşamdan bir süre geçtikten sonra Resulullah ile Ebu Bekir'e getirirdi. Onlar da taze süt içerek gecelerlerdi. O süt kendi sağmallarının sütü idi. İçine kızgın taş konularak ısıtılıyordu. Nihayet gecenin sonunda Amir (b. Fuheyre) mağaranın önüne gelip sağmal koyunlara seslenirdi. Mağarada bulundukları üç gece boyunca Amir hep böyle yaptı. Resulullah ile Ebu Bekir ed-Dll oğullarından bir adamı da ücretle tutmuşlardı. Bu kişi Abd b. Adiy oğullarından idi. Maharetli bir yol kılavuzu idi. el-As b. Vail es-Sehmi oğulları için antlaşmalı olarak elini kana sokmuştu. Ama yine de Kureyş kafirlerinin dini üzere idi. Her ikisi de ona güvenerek develerini ona teslim ettikten sonra üç gece sonra üçüncü gecenin sabahında develerini de beraber getirmek üzere Sevr mağarasında buluşmak üzere onunla sözleştiler. Amir b. Fuheyre ile kılavuz onlarla birlikte yola koyuldu ve (kılavuz) onları alarak Sevahil yolundan gitti.\" Fethu'l-Bari Açıklaması: \"Anne babamı\" Ebu Bekir ile Ümmü Ruman'ı \"Dine bağlı\" yani İslam dinine bağlı idiler. \"Müslümanlar\" Haşim ve Muttalib oğullarını Ebu Talib şi'binde muhasara, ettiklerinde müşriklerin eziyet ve işkencelerine maruz kalarak \"ibtila olunduklarında\" Nebi salı allah u aleyhi ve sellem de daha önce açıklandığı üzere Habeşistan'a hicret etmek için ashabına izin verdiğinde ... \"Ebu Bekir de Habeşistan'a doğru hicret etmek üzere çıktı.\" Böylelikle daha önce oraya giden Müslümanlara katılmak istemişti. Önce Hc1'heştan'a hicret etmiş olanların ewela Cidde'ye gittiklerini açıklamış idik. Cidde Mekke'nin sahilidir. Oradan deniz yoluyla Habeşistan'a gideceklerdi. \"Berku'I-Gımad\" Mekke'den Yemen cihetine doğru beş günlük mesafededir. \"O Kare'nin efendisi idi.\" Kare, Hun oğullarından meşhur bir kabiledir. \"Kavmim beni çıkardı.\" Yani çıkmama sebep teşkil etti. \"Dolaşmak istiyorum.\" Muhtemelen Ebu Bekir, İbn ed-Dağine'den nereye gitmek istediğini saklamıştır. Çünkü o bir kafir idi. Yoksa daha önce onun Habeşistan'a gitmek üzere yola çıktığı açıklanmış bulunmaktadır. Bilindiği gibi, belli bir süre yeryüzünde tek başına yürümeden gitmek istediği yoldan oraya ulaşamazdı. Dolayısıyla onun bu gidişi için dolaşmak (seyahat) denilebilir. Yoksa gerçek anlamıyla seyahat, yerleşmek amacıyla belirli bir yere gitmek maksadını gözetmemektir. \"Ben seni himayeme alıyorum.\" Seni rahatsız edecek kimselere karşı seni koruyorum. \"Bunun üzerine\" Ebu Bekir \"geri döndü. İbnu'd-Dağine de onunla birlikte gitmek üzere bineğine bindi.\" Kefalet bölümündeki rivayette \"İbnu'd-Dağine bineğine bindi ve Ebu Bekir ile döndü\" denilmektedir. \"Senin gibi birisi çıkmaz.\" Kendi isteğiyle başka bir yerde ikamet etmek niyetiyle vatanından çıkmaz. Çünkü senin gibi birisi kendi şehrinin halkına faydalı olan birisidir. \"Çıkartılmaz\" Yine belirtilen husus dolayısıyla kendi isteği olmaksızın kimse onu dışarı çıkartmaz. Bazı Maliki mezhebi alimleri buradan şu sonucu çıkartmışlardır: Başkasına faydalı olan bir kimsenin ağır basan bir zorunluluk olmaksızın başka bir şehre gitmesine imkan verilmez. \"Kureyşiiler onun istediğini reddetmedi.\" Yani Ebu Bekir'i himayesi altına aldığını söylemesine karşı çıkmadı. \"Bu\" kafirleri \"korkuttu.\" Çünkü onların kadınların ve gençlerin kalplerinin ince ve yufka oluşu sebebiyle İslam dinine yöneleceklerini biliyorlardı. \"Biz Ebu Bekir'in (bu işleri) açıktan yapmasını kabul etmiyoruz.\" Yani sözünü ettikleri kadınlarının ve çocuklarının dinine girmeleri korkusu dolayısı ile ona karşı tepkisiz duramayıp, sessiz kalamayacaklarını anlatmak istiyorlardı. \"Ben de Allah'ın himayesine razı oluyorum.\" Onun emanına ve himayesine razıyım. Hadisten dinde daha ağır olan amell uygulamanın caiz olduğu ve Ebu Bekir'in de yakininin oldukça güçlü olduğu anlaşılmaktadır. \"Nebi sallall€ıhu aleyhi ve sellem henüz Mekke'de idi.\" İşte bu bölümde Ebu Bekir es-Sıddık'in pek çok fazileti bulunmaktadır ki, bunlar onu başkalarından ayrıcalıklı kılmıştır. Üzerinde düşünen kimse için bunlar açıkça görülür. \"Yavaş ol\" acele etme. \"Kendisini\" hicret etmekten \"alıkoydu.\" \"Öğle sıcağında\" yani zevalin ilk vakitlerinde. Bu, gündüzün en sıcak olduğu zamandır. Sıcak günlerde de çoğunlukla bu vakitte kaylule yapılır. \"İşte Resulullah üstünü\" başını \"örtmüş olarak geliyor.\" \"Buradakiler sadece senin yakınlarındır.\" Bununla Musa b. Ukbe'nin açıkladığı gibi Aişe ve Esma'ya işaret etmektedir. O rivayetinde şöyle demektedir: \"(Allah Resulü): Yanındakileri dışarı çıkar, dedi. Ebu Bekir dedi ki: Burada senin aleyhine duruma şahit olacak kimse yoktur. Bu ikisi benim kızlarımdır.\" \"Bu iki devemden birisini (al). Allah Resulü, bedelini ödeyerek diye buyurdu.\" İbn İshak şunu eklemektedir: \"Allah Resulü ben bana ait olmayan bir deveye binmem, dedi. Ebu Bekir: O senindir dedi. Allah Resulü: Hayır, fakat bunu satın aldığın fiyata alırım, dedi. Ebu Bekir, ben bunu şu kadara satın aldım, deyince, Allah Resulü de: Ben de o bedele satın ahyorum, dedi. Ebu Bekir: Deve senindir dedi.\" Ebu Bekir'in kızı Esma yoluyla gelen Taberani'deki rivayette şöyle denilmektedir: \"Allah Resulü: Bedeliyle ey Ebu Bekir dedi. O, madem arzu ediyorsun, bedeliyle olsun dedi.\" es-Süheylı de er-Revdu'I-Unuf adlı eserinde Mağribli ilim adamlarından bir kimseye: Ebu Bekir, Allah Resulü yolunda malını harcamış olmakla birlikte deveyi karşılıksız almak istememesinin sebebi sorulunca: Hicretinin ancak kendi öz malından aldığı deve üzerine gerçekleşmesini istemiştir, diye açıklamıştır. \"Biz de bir heybede onlara azık hazırladık.\" Yani bir dağarcığa azıklarını koyduk. \"Kuşak sahibi (zatu'n-nitak)\" Kuşak (nitak): Göbeğin etrafında bağlanan şeye denilir. \"(Aişe) dedi ki: Sonra Resulullah sallall€ıhu aleyhi ve sellem ve Ebu Bekir Sevr da\\ ğındaki bir mağaraya gittiler.\" Hakim der ki: Nebi sallall€ıhu aleyhi ve sellem'in (Mekke'den) çıktığı gül1ün pazartesi, Medine'ye girdiği günün de pazartsLgÜnü olduğu hususunda haberler tevatür derecesini bulmuştur. Musa b. Ukbe de İbn Şihab'dan şöyle dediğini rivayet etmektedir: Ali, Resulullah Sallallahu Aleyhi ve Sellem'in yatağında yatakta olanın Nebi olduğu izlenimini verecek şekilde yattı. Kureyşliler ise yatakta yatan kimsenin üzerine hangisinin hücum edip, onu bağlayacağı hususunda farklı görüşleri ortaya atarak danışıp durdu. Nihayet sabah olunca karşılarında Ali'yi buldular. Ona Nebii sordular. O, bu hususta bir şey bilmiyorum deyince, onu ellerinden kaçırmış olduklarını anladılar. İbn İshak da buna yakın bir şekilde olayı anlatarak şunları eklemektedir: \"Cibril ona o gece yatağında yatmaması emrini verdi. O da Ali'yi çağırarak bu gece yatağında yatmasını ve yeşil burdesi ile örtünmesini emretti. Ali de onun dediğini yaptı. Daha sonra Nebi sallallahu aleyhi ve selle m bir avuç toprak alarak onların yanına çıktı. Bu toprağı başlarına saçmaya koyuldu. Bu arada Yasin suresini \"Artık onlar görmezler\" [Yasin, 9] buyruğuna kadar okudu. Ahmed de İbn Abbas'tan hasen bir senedIe yüce Allah'ın: \"Hani o kafir!er senin için tuzak kuruyorlardı.\" [Enfal, 30] buyruğu hakkında şunları söylediğini zikretmektedir: \"Bir gece Kureyşliler Mekke'de birbirleriyle danışınca onlardan birisi: Sabah olunca onu zincire vurunuz dedi. Kastettiği kişi Nebi sallallahu aleyhi ve selle m idi. Bir diğeri hayır onu öldürünüz, bir başkası onu şehrinizden çıkartınız dedi. Yüce Allah Nebie haber verdi, o gece Nebi Sallallahu Aleyhi ve Sellem'in yatağında Ali yattı. Nebi Sallallahu Aleyhi ve Sellem de çıktı ve mağaraya gitti. Müşrikler geceyi Nebi sallallahu aleyhi ve selle m zannederek Ali'yi koruyarak geçirdiler. Yani uyanıp kalkmasını ve aralarında söz birliği ettikleri işi yapma vaktin i bekleyip durdular. Sabah olduğunda Ali'yi gördüler ve böylelikle Allah onların tuzaklarını boşa çıkarmış oldu. -Senin o arkadaşın nerede, diye sordular. Ali bilmiyorum deyince, onun izini takip etmeye koyuldular. Dağa vardıklarında izleri karıştırdılar. Dağın tepesine çıktılar, mağaranın yanından geçtiler. Mağaranın kapısında örümcek ağını görünce, buraya girmiş olsaydı bu mağara kapısında bu örümcek ağının olmaması gerekirdi dediler. Allah Resulü o mağarada üç gece kaldı.\" \"Orada\" mağarada \"gizlendiler\" saklandılar. \"Zeki ve anlayışlı\" anlayışı hızlı, kıvrak ve maharetli birisi demektir. \"Sabah erkenden\" çıkar, seher vakti Mekke'ye giderdi. \"Minha: Sağmal koyun\" ile ilgili açıklamalar daha önce Hibe bölümünde (2629. hadiste) geçmiş bulunmaktadır. Bu tabir aynı zamanda her, koyun hakkında da kullanılabilir. \"Kızgın taş konularak ısıtılmış taze süt\" yani guneşte ya da ateşte kızdınlmış, taşların içine konduğu taze süttür. Bu işten kasıt ise, sütün bir parça pişmesi ve hamlığının gitmesidir. \"Antlaşmalı olarak elini (kana) sokmuştu.\" Cahiliye dönemi insanları yeminleştikleri vakit sağ ellerini kana, hoş bir kokuya yahut da bulaşma özelliği olan herhangi bir şeye daldırırlardı. Bu onların yaptıkları yemini daha bir pekiştirici olurdu",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 3906,
			"arabicnumber": 3906,
			"text": "Suraka b. Malik b. Cu'şum'un kardeşinin oğlu olan Abdurrahmanb. Malik el-Müdlid'den rivayete göre o Suraka b. Cu'şum'u şöyle derken dinlemiştir: \"Kureyş müşriklerinin etrafa saldıkları adamlar bizlere de geldi. Resulullah Sallallahu Aleyhi ve Sellem ile Ebu Bekir'den her birisini öldüren veya esir alan kimse için müşrikler bir diyet miktarını mükafat olarak verceklerini söylemişlerdi. Ben Müdlic oğulları diye bilinen kavmimin meclislerinden birisinde oturmakta iken kavmimden bir adam geldi. Biz oturuyorken kendisi henüz ayakta iken: Ey Suraka dedi. Ben az önce sahilde bazı karartılar gördüm. Kanaatime görebu Muhammed ve arkadaşlarıdır. Suraka dedi ki: Ben onların kim olduklarını anladım, ama ona şunları söyledim: O senin gördüklerin onlar değildir. Senin gördüğün filan kişi ile filan kişidir. Az önce gözümüzün önünden geçip gittiler. Daha sonra o mecliste bir süre daha bekıedim. Sonra ayağa kalkıp eve girdim. Cariyeme atımı çıkarmasını, tepenin arkasında atımla beni beklemesini söyledim. Mızrağımı alıp evin arkasından çıktım. (Parlamasın diye) ucunu yerde sürterek sap kısmını da yukarıda tutarak gittim, Nihayet atıının yanına vardım ve atıma bindim. Beni onlara yaklaştırsın diye onu dört nala koşturdum. Nihayet onlara yaklaştım. Bu sefer atım tökezledi ve ben de üstünden düştüm. Düştüğüm yerden kalktım ve hemen elimi ok torbama uzattım. Oradan faloklarını çıkardım ve onlarla fal açtım, onlara zarar verecek miyim, vermeyecek miyim diye. Hoşuma gitmeyenısonuç çıktı. Ben de fal oklarının gösterdiği neticeye karşı çıkarak atıma bindim, ö beni onlara yaklaştırıp durdu. Nihayet Resulullah sallall€ıhu aleyhi ve sellem'in okumalarını işitmeye başladım. Etrafına dönüp bakmıyordu. Ebu Bekir ise etrafına çokça bakınıyordu. Atımın ön ayakları diz kapaklarına kadar yere gömüldü ve ben de attan düştüm. Daha sonra onu kalkmaya zorladım, o da kalkmaya çalıştı. Henüz ön ayaklarını çıkartamamıştım. Nihayet at güçlükle ayağa kalkmış ve ön ayaklarını battığı yerden çıkartmış idi ki ayakta durur durmaz ön ayaklarının iz bıraktığı yerden dumanı andıran bir gürültü göğe doğru yükseldi. Tekrar fal oklarıyla kısmet aradım, yine hoşuma gitmeyen sonuç çıktı. Bu sefer bana em an vermeleri için onlara seslendim. Onlar da durdular. Atıma binerek yanlarına gittim. Onlara ulaşmamı engelleyen bu hallerle karşılaşınca içimde Resulullah Sallallahu Aleyhi ve Sellem'in emrinin pek yakında üstün geleceği hissi uyandı. Bu sebeple ona dedim ki: Senin kavmin sana karşılık diyet veriyor. Onlara ayrıca insanların (Kureyş kafirlerinin) kendisine neler yapmak istediklerini haber verdim. Onlara azık ve ihtiyaçları olan eşyayı vermeyi teklif ettim, fakat benden bir şeyalmadılar ve hiçbir şey istemediler. Ancak bana şunu dedi(ler): Sen bizim halimizi sakla. Ben de ondan bana bir eman yazısı yazmasını istedim. Amir b. Fuheyre'ye emir verdi, o da bir deri parçasına (istediğim emanı) yazdı. Daha sonra Reso.lullah Sallallahu Aleyhi ve Sellem yoluna devam etti",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 3907,
			"arabicnumber": 3907,
			"text": "Hişam'ın, o babası ile Fatıma'dan, rivayetle Esma r.anha'nın şöyle dediği rivayet edilmiştir: \"Ben Medine'ye gitmek istedikleri vakit Nebi Sallallahu Aleyhi ve Sellem ile Ebu Bekir'e azık hazırladım. Babama: Bunu (dağarcığı) bağlamak için kemerimden başka bir şey bulamıyorum. Ebu Bekir: O halde onu ortadan böl, dedi. Ben de onun dediği gibi ortadan ikiye ayırdım. Bundan dolayı bana zatu'n-nitakayn (iki kemer sahibi) adı verilmiştir.\" İbn Abbas da: \"Zatu'n-nitak (kemer sahibi) Esma\" demiştir",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 3908,
			"arabicnumber": 3908,
			"text": "Bera r.a. dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem Medine'ye doğru yola koyulunca Suraka b. Malik b. Cu'şum onu takip etti. Nebi Sallallahu Aleyhi ve Sellem'in ona beddua etmesi üzerine atının ayakları kuma gömüldü. Suraka: Benim için Allah'a dua et ve benim sana zararım olmayacaktır deyince, bu sefer ona dua etti. Dedi ki: Resulullah Sallallahu Aleyhi ve Sellem susadı. Bir çobanın yanından geçti. Ebu Bekir dedi ki: Ben de bir kap aldım ve ona bir miktar süt sağdım. Ben (kendi kendime) yeteri kadar içti, diyene kadar içti.\" Fethu'l-Bari Açıklaması: \"Herbirisi için\" yüz deve olmak üzere \"bir diyet.\" \"Az önce\" yani şu vakitte. \"Karartılar\" kimseler. \"Aşağıda tuttu\" yani mızrağı elinde tutarak sivri ucunu yere doğru eğdi. Uzaklaştığı kimseler onun parıltısını görmesin diye yere saplayarak yürüdü. Çünkü birilerinin de onun arkasından gelip, verilecek olan ikramiyeye ortak olmasını istemiyordu. \"Usan: Duman\" Ebu Ubeyd'in Garibu'l-Hadis adlı eserinde belirttiğine göre dumandan kastettiği bizatihi tozdur. Ayaklarının çıkardığı tozu dumana benzetmiştir. \"Benden bir şeyalmayı kabul etmediler.\" Beraberimde bulunan hiçbir şeyimi eksiltmediler. \"Yahudilerden bir adam (kendilerine ait bir sur üzerine) çıkmıştı.\" Yani yüksekçe bir yere -kaleye- çıkmış ve oradan etrafına bakmıştı. Saray gibi taştan yapılmış bina demek olduğu da söylenmiştir. \"Ebu Bekir insanları\" karşılamak üzere \"kalktı.\" \"Ensardan gelenler arasında daha önce Resulullah Sallallahu Aleyhi ve Sellem'i görmeyenler Ebu Bekir'i selamlamaya koyuldu.\" Derim ki: İfadenin zahirinden anlaşıldığına göre Nebi Sallallahu Aleyhi ve Sellem'i tanımayanlardan selam verip, gelenler Ebu Bekir'i Nebi zannediyordu. Bundan dolayı öncelikle ona selam. veriyorlardı. Hadisin geri kalan kısmı da buna delildir. \"Ebu Bekir ridası ile Nebie gölge yapmaya başlayınca herkes Resulullah Sallallahu Aleyhi ve Sellem'i tanıdı.\" \"Takva esası üzerine kurulmuş olan mescidi tesis etti.\" Maksat Kuba mescididir. İbn Ebi Şeybe, Cabir şöyle dediğini rivayet etmektedir: \"Resulullah Sallallahu Aleyhi ve Sellem yanımıza gelmeden seneler önce biz Medine'de mescidler yapıyor ve namaz kılıyorduk.\" Yüce Allah'ın: \"İlk gününden beri temeli takva üzerine kurulan bir mescidde (namaza) durman elbette daha layıktır.\"[Tevbe,108] buyruğu ile hangi mescidin kastedildiği hususunda görüş aynlığı vardır. Cumhurun kanaatine göre bundan maksat bu Kuba mescididir, ayetin zahirinden anlaşılan da budur. Müslim, Abdmrahman b. Ebi Said yoluyla babasından şunu rivayet etmektedir: Ben Resulullah Sallallahu Aleyhi ve Sellem'e takva üzere tesis edilmiş olan mescid hakkında sordum, o, ''Sözünü ettiğin o mescid, sizin bu mescidinizdir diye buyurdu.\" Ahmed ve Tirmizi de bir başka yoldan Ebu Said şöyle dediğini rivayet etmektedirler: \"İki adam takva üzere tesis olunan mescid hakkında ihtilafa düştü. Onlardan birisi: O, Nebi Sallallahu Aleyhi ve Sellem'in mescididir dedi. Diğeri ise Kuba mescididir dedi. Resulullah Sallallahu Aleyhi ve Sellem'e giderek hangisi olduğunu sordular. O da O mescid, bu mesciddir dedi. Bunda -yani Kuba mescidinde- pek büyük bir hayır vardır.\" ed-Davudı ve başkalan da der ki: Aslında bu bir görüş aynlığı değildir. Çünkü bu iki mescidin her biri de takva esası üzerine kurulmuştur. \"Sonra devesine bindi.\" Hakim de İshak b. Ebi Talha'nın, Enes'ten yaptığı rivayette şöyle demektedir: \"Ensar gelerek: Yanımıza buyur ey Allah'ın Resulü dediler. O: Deveyi serbest bırakınız, o emir alarak hareket eder, diye buyurdu. Deve Ebu Eyyub'un kapısı önünde çöktü.\" \"Nihayet deve Resulullah Sallallahu Aleyhi ve Sellem'in mescidi yanında çöktü.\" elBera'nın Ebu Bekir'den diye naklettiği hadiste şöyle denilmektedir: \"Hangisi onu yanında misafir edecek, diye Ensar arasında anlaşmazlık çıktı. O, ben onlara ikram olsun diye Abdulmuttalib'in dayılan yanında misafir olacağım, diye buyurdu.\" İbn Aiz'de, el-Velid b. Müslim'den, Said b. Mansur'da her ikisi Utaf b. Halid'den şunu rivayet etmektedirler: \"Deve minberin mescidde bulunduğu yerde çöktü. Sonra yükq çözüldü, üzerinden indi. Ebu Eyyub yanına gelerek: Buraya en yakın ev benim evimdir. Yükünü taşımak üzere bana izinver, dedi. O da: Olur deyince, eşyasını taşıdı ve devesini de evinde çöktürdü.\" İbn Sa'd'ın naklettiğine göre Ebu Eyyub, Nebi Sallallahu Aleyhi ve Sellem'in eşyasını evine taşıyınca Nebi sallallahu aleyhl ve sellem: \"Kişi eşyaları nerdeyse o da orada olur\" diye buyurdu. SaId b. Zurare de gelip devesini aldı. Devesi de Sa'd'ın yanında kaldı. (İbn Saldı dedi ki: Bu daha sağlam 'bir rivayettir. \"Orası\" yani mescidin yapıldığı yer \"hurma kurutulan bir harman yeri idi.\" Burada hurma kurutuluyordu. el-Esmaı der ki: \"Merbid (harman yeri)\" deve ya da koyunların alıkoyulduğu her bir yere denilir. \"Resulullah Sallallahu Aleyhi ve Sellem de onlarla birlikte kerpiç taşımaya koyuldu.\" Kerpiç ateşte pişirilmeden çamurdan yapılunlara denilir. Hadisten anlaşıldığına göre; Çeşitli türleriyle özellikle de savaşta recez türünde şiir söylemek, değişik zor işleri yaparken yardımlaşmak caiz bir iştir. Çünkü böylelikle gayretler harekete gelir, kişiler teşvik edilir, zor işlerin üstesinden gelmek için harekete geçilir",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 3909,
			"arabicnumber": 3909,
			"text": "(Esma r.anha'dan rivayete göre; \"Abdullah b. Zübeyr'e hamile kaldı. Dedi ki: Mekke'den) çıkarak Medine'ye geldim. Kuba'da konakladım ve onu Kuba'da doğurdum. Sonra onu yanıma alarak Nebi Sallallahu Aleyhi ve Sellem'e götürdüm. Resulullah Sallallahu Aleyhi ve Sellem'in kucağına bıraktım. Arkasından bir hurma istedi. Onu çiğnedikten sonra ağzına hafifçe tükürdü. Böylelikle onun karnına ilk giren şey, Resulullah Sallallahu Aleyhi ve Sellem'in tükürüğü oldu. Daha sonra bir hurmayı onun ağzına çaldı (tahnık etti). Sonra da ona dua etti, mübarek kılınmasını diledi. (Medine'ye hicretten sonra) Müslümanların doğan ilk çocuğu o oldu.\" Esma radıyallahu anhii'dan rivayete göre: \"O hamile olduğu halde Nebi Sallallahu Aleyhi ve Sellem'e hicret etti. \" Bu Hadis 5469 numara ile gelecektir",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 3910,
			"arabicnumber": 3910,
			"text": "Aişe r.anha dedi ki: \"(Medine'ye hicretten sonra) Müslümanların doğan ilk çocuğu Abdullah b. ez-Zübeyr'dir. Onu Nebi sallallahu aleyhi ve sellem'e getirdiler. Nebi Sallallahu Aleyhi ve Sellem bir hurma alarak onu çiğnedi. Sonra da onun ağzına soktu. Böylelikle onun karnına giren ilk şey, Nebi sallallahu aleyhi ve sellem'in tükürüğü oldu.\" Fethu'l-Bari Açıklaması: Ebu Bekir'in kızı Esma'nın Abdullah b. ez-Zübeyr'e Mekke'de hamile kalışı hadisinde geçen: \"Hamilelik sürernin tamamlanmak üzere olduğu (doğumumun yaklaştığı sıralarda)\" Çoğunlukla gebelik süresi olan dokuz ayı tamamlaladığımda, demektir. Aynı laflZ sürenin tamamlaması sonucunda doğum yapan kadın hakkında da kullanılır. \"Sonra onu tahnık etti.\" Yani ağzına hurma koydu ve onu çenesine sürdü. \"Onun mübarek kılınmçısını diledL\" Yani barekellahu fihi ya da Allahumme barik fihi: Allah onu mübarek kılsın yahut da Allah'ım onu mübarek kıl, diye dua etti. \"Müslümanların\" Medine'de muhacirlerin \"doğan ilk çocuğu o oldu.\" Medine dışında muhacirlerin doğan ilk çocuklarının ise HabeşisHm'da doğan Abdullah b. Cafer olduğu söylenmiştir. Medine'de hicretten sonra Ensarın doğan ilk çocuğu ise İbn Ebi Şeybe'nin rivayet ettiği üzere Mesleme b. Mahled'dir. en-Numan b. Beşir olduğu da söylenmiştir. Hadisten anlaşıldığına göre; Abdullah b. ez-Zubeyr hicretin ilk yılında doğmuştur, kabul edilen kuwetli görüş de budur",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 3911,
			"arabicnumber": 3911,
			"text": "Enes b. Malik r.a. dedi ki: \"Allah'ın Nebii Sallallahu Aleyhi ve Sellem Medine'ye Ebu Bekir'i terkisine bindirmiş olarak geldi. Ebu Bekir, (görünüşte) yaşlı ve tanınan birisi olduğu halde, Allah'ın Nebii Sallallahu Aleyhi ve Sellem ise genç ve kimse tarafından tanınmayan birisi idi. Herhangi bir adam Ebu Bekir ile karşılaşır ve: Ey Ebu Bekir, şu önündeki adam kimdir, diye sorardı. O da: Bu adam bana doğru yolu gösteriyor, diye cevap verirdi. (Enes) dedi ki: Kişi, Ebu Bekir'in bu sözleriyle yolu kastettiğini zannediyordu. Oysa onun kastettiği hayır yolu idi. Ebu Bekir dönüp baktığında arkalarından kendilerine yetişen bir adam görüverdi. Ey Allah'ın Resulü, işte bir atlı bize yetişti, dedi. Allah'ın Nebii ona doğru dönerek: Allah'ım, onu yere yık, diye dua etti. At onu yere düşürdü. Sonra da kalkıp homurdanmaya başladı. Ey Allah'ın Nebii, bana dilediğin emri ver, dedi. Yerinde dur ve kimsenin bize yetişmesine imkan verme, diye buyurdu. (Enes) dedi ki: Günün başlangıcında Allah'ın Nebi Sallallahu Aleyhi ve Sellem'e karşı mücadele veren birisi iken, günün sonunda onun lehine silah taşıyan birisi oldu. Resulullah Sallallahu Aleyhi ve Sellem el-Harre'nin yanına konakladı. Daha sonra Ensara haber gönderdi. Onlar da Allah'ın Nebii ile Ebu Bekir'in yanına geldiler. Her ikisine de selam vererek: Güvenlik içerisinde ve itaat edilenler olarak bininiz, dediler. Allah'ın Nebii ile Ebu Bekir bindi ve her ikisinin de etrafını silahlarıyla kuşattılar. Medine'de, Allah'ın Nebii geldi, Allah'ın Nebii geldi, diye sesleniidi. Onlar da çıkıp seyretmeye ve Allah'ın Nebii demeye koyuldular. Nebi geldi ve nihayet Ebu Eyyub'un evinin yakınında konakladı. O (Nebi) aile halkıyla konuşurken, Abdullah b. Selam da ailesine ait bir hurma bağında onlar için hurma toplamakta iken onun geldiğini işitti. Elini çabuk tutarak onlar için topladıklarını orada koymaya çalıştı. Fakat topladığı hurmalar(ı bir yere koyamadan) beraberinde olduğu halde geldi. Allah'ın Nebiinden söylediği sözleri dinledikten sonra aile halkının yanına geri döndü. Allah'ın Nebii Sallallahu Aleyhi ve Sellem, bizim akrabalarımızın hangisinin evi daha yakındır diye sordu. Ebu Eyyub: Benim ey Allah'ın Nebii! İşte şu evim, şu da benim kapım dedi. Allah Resulü: O halde kalk git de öğle vakti dinlenelim diye bizim için bir hazırlık yap dedi. Ebu Eyyub: O halde Allah'ın bereketi üzere kalkınız dedi. Allah'ın Nebii sallallahu aleyhi ve selle m gelince Abdullah b. Selam da gelip: Şahadet ederim ki sen Allah'ın Resulüsün ve şüphesiz sen hak ile geldin. Yahudiler de biliyor ki ben onların efendisiyim, efendilerinin oğluyum. Onların en bilgilisiyim, onların en bilgilisinin oğluyum. Onları çağır ve benim Müslüman olduğumu bilmeden önce benim hakkımda onlara soru sor. Çünkü onlar benim Müslüman olduğumu bilecek olurlarsa bende olmayan şeyleri hakkımda söylerler, dedi. Bunun üzerine Allah'ın Nebii (Yahudilere) haber gönderdi. Onlar da gelip huzuruna girdiler. Resulullah Sallallahu Aleyhi ve Sellem onlara: Ey Yahudiler toP-o luluğu! Veyl olsun sizlere! Allah'a karşı takvalı olunuz. Kendisinden başka hiçbir ilah olmayan Allah adına yemin ederim ki şüphesiz sizler benim hak olarak Allah'ın Resulü olduğumu ve benim hakkı getirdiğimi biliyorsunuz. Haydi Müslüman olunuz, dedi. Onlar: Biz bunu bilmiyoruz dediler. Evet, Nebi sallaW\\hu aleyhi ve sellern'e böyle dediler. b da bu sözlerini üç defa tekrarladı. Aranızda Abdullah b. Selam nasıl bir adamdır dedi. Onlar: O bizim efendimizdir, efendimizin oğludur, en alimimizdir, en alimimizin oğludur, dediler. Allah Resulü: Müslüman olmasına ne dersiniz diye sordu. Onlar: Asla, Allah için o, Müslüman olacak birisi değildir. Yine sordu: Müslüman olursa ne dersiniz? Yine onlar: Asla, Allah körusun, o Müslüman olacak birisi değildir. Yine: Ya Müslüman olursa ne dersiniz diye sordu. Onlar: Asla, Allah için o Müslüman olacak değildir, dediler. Allah Resulü: Ey İbn Selam onların yanına çık, diye buyurdu, o da çıktı ve şunları söyledi: Ey Yahudiler, Allah'a karşı takvalı olunuz. Kendisinden başka hiçbir ilah olmayan Allah'a yemin ederim ki şüphesiz sizler onun Allah'ın Resulü olduğunu ve onun hakkı getirdiğini biliyorsunuz. Yahudiler: Yalan söylüyorsun dediler. Resulullah Sallallahu Aleyhi ve Sellem onları dışarı çıkardı.\" Fethu'l-Bari Açıklaması: \"Ebu Bekir (görünüşte) yaşlı idL\" Saçlarının ağarmış olduğunu kastetmektedir. \"Tanınıyordu\" çünkü o ticaret için yaptığı yolculuklarında Medinelilere uğrayıp gidiyordu. Oysa her iki hususta da Nebi sallallahu aleyhi ve sellern'in durumu ondan farklı idi. Uzun bir süreden beri Mekkelden dışarıya yolculuk yapmamıştı. Saçları da ağarmamıştı. Yoksa hakikatte Nebi sallallahu aleyhi ve sellern Ebu Bekir'den yaşça daha büyüktür. \"Allah'ın Nebii ise gençti ve tanınmıyordu.\" Ebu Bekir r.a. ile ilgili olarak Müslim'in Sahihlinde Muaviye'den sabit olan rivayete göre 63 yıl yaşamıştır. Nebi sallallahu aleyhi ve sellerniden sonra ise iki yıl ve birkaç ay yaşamıştır. O halde Ebu Bekir'in yaşı ile ilgili olarak sahih kabul edilen görüşe göre onun Nebi sallallahu aleyhi ve sellerniden iki yaştan daha fazla bir süre küçük olması gerekir. \"Bana yol gösteriyor\" ifadesi ile ilgili olarak bunun sebebini İbn Sa'd zikretmiş olduğu bir rivayetinde şöylece açıklamaktadır: \"Nebi sallallahu aleyhi ve sellern Ebu Bekir'e: İnsanların dikkatini benden başka tarafa çek, demişti. Bundan dolayı ona: Sen kimsin diye sorulduğunda, ben bir ihtiyacın peşindeyim derdi. Bu beraberindeki kim diye sorulunca da, bu bana yolu gösteren bir rehberdir, derdi.\" Bununla dinde doğru yolu, hidayeti kastediyordu. Ona soru soran kişi ise onu kılavuz ve yol gösterici zannediyordu. \"Öğle vakti dinlenelim diye hazırlık yap.\" Yani öğlenleyin dinleneceğimiz (kayllile yapacağımız) bir yer hazırla bize",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 3912,
			"arabicnumber": 3912,
			"text": "Ömer b. el-Hattab r.a.'dan dedi ki: \"İlk muhacirlere dörder bin maaş bağladı. İbn Ömer'e ise üçbin beşyüz maaş tayin etti. Ona: O muhacirlerdendir, niçin ona dörtbinden aşağı veriyorsun, diye sorulunca şu cevabı verdi: . Onunla beraber anne babası hicret etti. Yani o, kendi başına hicret eden gibi olamaz",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 3913,
			"arabicnumber": 3913,
			"text": "Habbab dedi ki: \"Resulullah Sallallahu Aleyhi ve Sellem ile birlikte hicret ettik",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 3914,
			"arabicnumber": 3914,
			"text": "Habbab dedi ki: \"Resulullah Sallallahu Aleyhi ve Sellem ile birlikte Allah'ın rızasını arayarak hicret ettik. Ecrimizi vermek Allah'a aittir. Bizden kimisi ecrinden hiçbir şey yemeden geçip gitti. Mus'ab b. Umeyr bunlardan birisidir. Uhud günü öldürüldüğünde onu kendisi ile kefenleyeceğimiz bir çizgili kumaş dışında bir şey bulamamıştık. Onunla baş tarafını örtersek ayakları dışarıda kalırdı, ayaklarından itibaren örtecek olursak başı açıkta kalırdı. Resulullah Sallallahu Aleyhi ve Sellem bizlere onunla baş tarafını örtmemizi ve ayaklarının üzerine de bir miktar izhir otu koymamızı emretti. Bizden kimisinin de mahsulü olgunlaştı ve işte o bu mahsulleri toplamaktadır",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 3915,
			"arabicnumber": 3915,
			"text": "Ebi Musa el-Eş'ari'nin oğlu Ebu Burde dedi ki: \"Abdullah b. Ömer bana: Benim babamın senin babana ne dediğini biliyor musun, diye sordu. Ben: Hayır dedim. Dedi ki: Babam (Ömer) baban (Ebu Musa'y)a dedi ki: Ey Ebu Musa, Resulullah sallallahu aleyhi ve selle m ile birlikte Müslüman oluşumuz, onunla beraber hicret edişimiz, onunla beraber cihad edişimiz ve bütün amelimizin bizim için (ecri itibariyle) sabit olması ve devam etmesi seni sevindirir mi? Buna karşılık ondan sonra yapmış olduğumuz her bir amelden lehimize de, aleyhimize de olmaksızın başa baş çıkmamız (hoşuna gider mi?) Bunun üzerine babam dedi ki: Allah'a yemin ederim ki hayır. Biz Resulullah Sallallahu Aleyhi ve Sellem ile sonra da cihad ettik, namaz kıldık, oruç tuttuk, pek çok hayır işledik. Bizim elimizle pek çok insan Müslüman oldu. Şüphesiz bizler bunları (ecirlerini) ümit ederiz. Bunun üzerine babam (Ömer) dedi ki: Bana gelince Ömer'in canı elinde olana yemin ederim ki, o dediklerimizin ecrinin bize baki kılınıp verilmesini, daha sonra yaptığımız her bir işten de vebalsiz başa baş kurtulmuş olmayı çok arzu ederim. (Ebu Musa'nın oğlu Burde der ki): Ben de bunun üzerine: Allah'a yemin ederim şüphesiz senin baban, benim babamdan daha hayırlıdır, dedim.\" Fethu'l-Bari Açıklaması: \"Dedim ki\" diyen kişi (Ebu Musa'nın oğlu) Ebu Burde'dir. Bu sözleriyle İbn Ömer'e hitap ederek Ömer r.a.'ın sözü geçen bu bakımdan babası Ebu Musa r.a.'dan hayırlı olduğunu kastetmiştir. Bununla birlikte kabul edilen şu ki; Ömer bütün kesimlere göre Ebu Musa'dan faziletlidir. Fakat fazilet itibariyle daha alt mertebede olan bazı kimselerin mutlak olarak faziletli olmayı gerektirmeyen bir hasletle daha üstün faziletlilerden o noktada faziletli olmalarına mani yoktur. Bununla birlikte Ömer sözü geçen bu haslet itibariyle de Ebu Musa'dan daha faziletlidir. Çünkü havf makamı, reca makamından daha faziletlidir. İnsanoğlunun yapmak istediği her hayırlı işlerde kusmdan uzak kalamayacağı bilinen bir husustur. Ömer bu sözlerini nefsini bastırmak için söylemiştir. Yoksa onun faziletler ve kemalat bakımından işgal ettiği makam, ayrıca zikretmeye gerek bırakmayacak kadar meşhurdur",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 3916,
			"arabicnumber": 3916,
			"text": "Ebu Osman dedi ki: \"İbn Ömer r.a.'ı kendisine, babasından önce hicret ettiği söylenince, kızarak şöyle derken dinlemişimdir: Ben ve Ömer, Resulullah Sallallahu Aleyhi ve Sellem'in huzuruna gittik, onun öğle vakti kaylule yaptığını (dinlendiğini) gördük. Bu sebeple kaldığımız yere geri döndük. Ömer beni gönderdi ve: Git, uyan dı mı bir bak, dedi. Onun yanına gittim, huzuruna vardım ve ona bey'at ettim. Sonra Ömer'in yanına giderek Allah Resulünün uyanmış olduğunu ona haber verdim. Koşarak onun yanına gittik. Nihayet Ömer onun huzuruna girdi, önce o ona bey'at etti, sonra da ben ona bey'at ettim.\" Bu Hadis 4186 ve 4187 numara ile gelecektir",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 3917,
			"arabicnumber": 3917,
			"text": "Ebu İshak dedi ki: \"Bera'yı şöyle derken dinledim: Ebu Bekir, Azib'den bir eğer satın aldı. Ben de onu onunla birlikte taşıdım. (el-Bera) dedi ki: Azib ona Resulullah Sallallahu Aleyhi ve Sellem'in yol alışı hakkında sordu. Dedi ki: O bizim yolu gözetlememizi söyledi. Geceleyin yola çıktık. O gecemizi ve gündüzümüzü hızlıca yürüyerek geçirdik. Nihayet öğle sıcağı iyice bastırdı. Sonra bir kaya gördük. Onun yanına vardık, bir parça gölgesi vardı. (Ebu Bekir) dedi ki: Resulullah Sallallahu Aleyhi ve Sellem'e beraberimde bulunan bir postu serdim. Daha sonra Nebi Sallallahu Aleyhi ve Sellem üzerine yattı. Ben de etrafında bulunanları silkelemeye (temizlemeye) koyuldum. Derken bir çobanın koyunları ile birlikte bizim kayanın yanına geliş amacımızın aynısıyla geldiğini gördüm. Ona: Ey genç, sen kiminsin diye sordum. Ben filanım dedi. Ona: Koyunlarında süt var mı diye sordum, evet dedi. Ona: Sen süt sağar mısın diye sordum. Evet, dedi. Koyunlarından birisini tuttu. Ona: Memesini iyice temizle, dedim. ' (Ebu Bekir) dedi ki: Bir miktar süt sağdı. Beraberimde ise Resulullah sallall€ıhu aleyhi ve sellem için daha önceden hazırlamış olduğum bir bezin üzerinde bulunduğu bir su matarası vardı. Sütün dibi soğuyuncaya kadar üzerine döktüm. Sonra onu Nebi Sallallahu Aleyhi ve Sellem'e götürdüm. İç ey Allah'ın Resulü dedim. ResuluIlah Sallallahu Aleyhi ve Sellem ben hoşnut oluncaya kadar içti. Sonra da takip edenler peşimizde olduğu halde yolumuza koyulduk.\" [-3918-] Bera’ dedi ki: \"Ebu Bekir ile birlikte ailesinin yanına girdim. Kızı Aişe'nin hummaya tutulmuş olduğu halde yattığını gördüm. Babasının yanağını öptüğünü ve nasılsın kızcağızım dediğini gördüm.\" Fethu'l-Bari Açıklaması: \"Ona babasından önce hicret ettiği söylenince kızıyordu.\" Yani az önce geçtiği gibi, o ancak babasıyla birlikte hicret etmiş idi. \"Ben ve Ömer Resulullah Sallallahu Aleyhi ve Sellem'in huzuruna gittik.\" Bey'at esnasında kastetmektedir. Muhtemelen bu Rıdvan bey'atidir. \"Koşarak\" (hervele) yavaş yürümek ile koşmak arasındaki bir yürüyüştür. \"el-Bera dedi ki: Ebu Bekir ile birlikte ailesinin yanına girdim. Kızı Aişe'nin hummaya tutulmuş olarak yatmış olduğunu gördüm. Babasının yanağını öperek nasılsın kızcağım dediğini gördüm.\" \" . el-Bera'nın Ebu Bekir r.a.'ın ailesinin yanına girmesi kesinlikle hicabın (mu'minlerin annelerinin perde arkasında saklanma emrinin) inişinden önce olmuştur. Aynı sırada o dönemde kendisi de henüz buluğa ermemişti, Aişe r.anha da böyle",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 3918,
			"arabicnumber": 3918,
			"text": "el-Berâ dedi ki: Ben Ebû Bekr'in beraberinde olarak onun ailesi yanına girdim. Birden kızı Âişe'yle karşılaştım ki, o kendisine ateşli bir hastalık isabet etmiş olduğu için yatmakta idi. Bu esnada babasını gördüm ki, onun yanına gitti de kızının yanağından öptü ve: Nasılsın ey kızcağızım? Dedi",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 3919,
			"arabicnumber": 3919,
			"text": "Peygamber'e hizmet eden Enes(radıyallahü anh) şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem) Medine'ye geldi. Onun sahâbîleri içinde Ebû Bekr'den başka saç ve sakalı kırçıl kimse yoktu. Ebû Bekr saç ve sakalını kına ve ketem bitkisi ile gılıfladı, yânı saçlarını boyadı",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 3920,
			"arabicnumber": 3920,
			"text": "Nebi Sallallahu Aleyhi ve Sellem'in hizmetkarı Enes dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem (Medine'ye) geldiğinde ashabı arasında Ebu Bekir dışında saçları ağarmaya başlamış kimse yoktu. O ağarmış saçlarını kına ve ketem ile kapattı. \" Bu Hadis 3920 numara ile gelecektir. [-3920-] Enes b. Malik r.a. dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem Medine'ye geldiğinde ashabının en yaşlısı Ebu Bekir idi. O, onu (ağaran saçlarını) kına ve ketem ile kapattı ve nihayet ağaran saçlarının rengi oldukça kırmızılaştı",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 3921,
			"arabicnumber": 3921,
			"text": "Aişe r.anha'dan rivayete göre \"Ebu Bekir r.a., Ümmü Bekir diye anılan Kelb'den bir kadın ile evlendi. Ebu Bekir hicret edince onu boşadı. Kureyş kafiderine mersiye olarak söylediği şu kasidenin sahibi şair olan amcasının oğlu, o kadın ile evlendi: Ne var o kuyuda, o Bedir kuyusunda Deve hörgücünü andıran etlerle süslenmiş tencereler (eş-şıza) Ne var o kuyuda, o Bedir kuyusunda Şarkıcılar ve o şerefli içki içenler Bekr'in annesi bize esenlik dileyerek selamlıyor Ya benim kavmimden sonra bir esenliğim mi olurmuş? Resul bize diriltileceğimizi anlatıyor Baykuşların ve iskelet kalmış kafatasıarının hayat bulması nasılolurmuş?",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 3922,
			"arabicnumber": 3922,
			"text": "Ebu Bekir r.a. dedi ki: \"Mağarada Nebi Sallallahu Aleyhi ve Sellem ile birlikte idim. Başımı kaldırdığımda izleri takip edenlerin ayaklarını gördüm. Ey Allah'ın Nebii, onlardan birisi aşağıya bakacak olsa bizi görecektir, dedim. Sus ey Ebu Bekir, (biz) üçüncüleri Allah olan iki kişiyiz",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 3923,
			"arabicnumber": 3923,
			"text": "Ebu Said r.a. dedi ki: \"Bir bedevi Nebi Sallallahu Aleyhi ve Sellem'e gelerek ona hicret hakkında sordu. Şöyle buyurdu: Ne oluyor sana, hicretin işi ağırdır. Senin develerin var mı, diye buyurdu. Bedevi: Evet dedi. Peki, onların zekatını veriyor musun diye sordu. Bedevi: Evet dedi. Peki, ondan bağışlarda bulunuyor musun, diye sordu. Evet, dedi. Suya gittikleri gün onları sağıyar musun, diye sordu. Evet, dedi. Allah Resulü şöyle buyurdu: Sen (istersen) denizlerin ötesinden amel et. Şüphesiz Allah senin amelinden hiçbir şeyini eksiitmez.\" Fethu'l-Bari Açıklaması: \"(Ağaran saçlarını) örttü.\" Yani kınaladı. Kasıt da sakalıdır. \"Ketem\" Küçük kayalarda yetişen ve ince iplikleri sarkan. saçı kınalamak için kullanılan ve mersin ağacını andıran bir yapraktır. Toplanması oldukça zordur. Bundan dolayı da pek azdır. \"Ashabının en yaşlısı Ebu Bekir idi.\" Daha önceden de geçtiği üzere, o sırada ve ondan önce Medine'ye gelmiş olanlar arasında demektir. \"Nihayet saçları kırmızılaştı.\" Saçlarının kırmızı rengi oldukça arttı. \"Kureyş kafirleri için mersiye okuyan.\" Bedir günü öldürülüp, Nebi Sallallahu Aleyhi ve Sellem onları suyu kurumuş olan kuyuya attığı vakit bu mersiye söylenmişti. \"eş-Şıza\" İçine tirit yapılan ahşap tencere ve çömleklerin yapıldığı bir ağaçtır. Şair şunu söylemiş gibidir: Deve hörgüçlerinin etleriyle dolup taşan o tencere sahiplerinden kuyuda olanların hali nedir? Çünkü cahiliye Arapları çokça yemek yediren kimseye (tencere anlamındaki) \"cefne\" derlerdi. Buna sebep ise o kap ile insanlara çokça yemek yedirmesi idi. \"Baykuşlar. .. \" Şair bu sözleriyle ölümden sonra dirilişi inkar etmek istemiştir. İnsan böyle bir kuşa benzedikten sonra nasıl bir defa daha insan olarak diriltilebilir, demek istemiştir",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 3924,
			"arabicnumber": 3924,
			"text": "Bera r.a. dedi ki: \"Yanımıza ilk gelen kişi Mus'ab b. Umeyr ile İbn Ümmü Mektum oldu. Daha sonra yanımıza Ammar b. Yasir ile Bilal (Allah hepsinden razı olsun) geldi",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 3925,
			"arabicnumber": 3925,
			"text": "Bera b. A'zib r.a. dedi ki: \"Yanımıza ilk gelen Mus'ab b. Umeyr ve İbn Ümmü Mektum oldu. Bunlar insanlara Kur'an öğretiyorlardı. Bilal, Said ve Ammar b. Yasir de geldi. Daha sonra Ömer b. el-Hattab, Nebi Sallallahu Aleyhi ve Sellem'in ashabından yirmi kişi ile birlikte geldi. Sonra da Nebi Sallallahu Aleyhi ve Sellem geldi. Medine halkının ResuluIlah Sallallahu Aleyhi ve Sellem'in gelişine sevindikleri kadar bir şeye sevindiklerini görmedim. Hatta cariyeler bile: ResuluIlah Sallallahu Aleyhi ve Sellem geldi, diyorlardı. O Medine'ye ancak ben Mufassal bölümünden bir takım surelerle birlikte \"Sebbihisme Rabbike'l-a'la\" suresini de öğrendikten sonra geldi.\" Fethu'l-Bari Açıklaması: \"O (Medine'ye) ancak ben Mufassal bölümünden bir takım surelerle birlikte \"Sebbihisme Rabbike'l-a'la\" suresini öğrendikten sonra geldi.\" Yani bu sureyi Mufassal bölümünden bir takım surelerle birlikte ezberlemiştim. Bu rivayetin gereği olarak \"Sebbihisme Rabbike'l-a'la\" suresi Mekke'de inmiştir. Ancak bu tartışılır bir sonuçtur. Çünkü İbn Ebi Hatim'in, Hayde yoluyla rivayet ettiğine göre yüce Allah'ın: \"Felah bulmuştur, arınıp temizlenen, Rabbinin adını zikredip namaz kılan\"[A'la, 14-15] buyrukları bayram namazı ile Fıtır sadakası hakkında nazil olmuştur. Senedi de hasendir. Bunların her birisi ise hicretin ikinci yılında teşri' olunmuştur. Bu sebeple bu surenin bu son iki ayetinin Medine'de inmiş olması mümkündür. Bundan daha kuwetli bir görüş ise surenin tamamının Mekke'de inmiş olduğudur. Daha sonra Nebi Sallallahu Aleyhi ve Sellem \"namaz kılan\" buyruğu ile bayram namazının \"arınıp temizlenen (tezekki eden)\" buyruğundan kastın da Fıtır sadakası olduğunu beyan etmiş olabilir. Çünkü beyanın hitap vaktinden sonraya bırakılması caizdir. Problem olarak görülen bu hususa iki bakımdan cevap verilebilir: Birincisi bu iki ayet dışında surenin Mekki olma ihtimali, ikincisi -ki bu da daha sahihtir- surenin tamamının Mekke'de inmiş olması, sonra da Nebi Sallallahu Aleyhi ve Sellem'in yüce Allah'ın: \"Felah bulmuştur teze kk i eden ve Rabbinin adını anarak namaz kılan\" buyrukları ile bayram namazı ve Fıtır sadakasının kastedildiğini beyan etmiş olabilir. Çünkü ayetin muhtevası, maksadın ne olduğu beyan edilmeksizin zikir ve namazın teşvik edilmesinden ibarettir. Daha sonra sünnet bunu beyan etmiş olmaktadır",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 3926,
			"arabicnumber": 3926,
			"text": "Aişe r.anha'nın şöyle dediği rivayet edilmiştir: \"Resulullah Sallallahu Aleyhi ve Sellem Medine'ye geldikten sonra Ebu Bekir ve Bilal ateşli bir hastalığa yakalandı. (Aişe) dedi ki: Onların yanlarına girdim. Babacığım, kendini nasıl buluyorsun, dedim. Ey Bilal kendini nasıl buluyorsun, diye sordum. (Aişe) dedi ki: Ebu Bekir hummaya yakalandı mı şöyle derdi: \"Aile halkı arasında sabahı eden herkese Ölüm daha yakındır, ayakkabısının bağından.\" Bilal'in de humması kesildi mi yüksek sesle (ağlayarak) şöyle derdi: \"Ah keşke bilsem acaba geçirecek miyim bir gece Etrafında izhir ve küçük otların bittiği bir vadide Bir gün olsun Micenne sularına varacak mıyım Mekke'ye yakın Şame ve Tam tepelerini görebilecek miyim?\" Aişe dedi ki: Resulullah Sallallahu Aleyhi ve Sellem'in yanına gelip, ona durumu haber verince şöyle dedi: Allah'ım, Mekke'ye olan sevgimiz gibi ya da daha fazlasıyla Medine'yi bize sevdir ve (havasını) sağlıklı kıl. Bizim için sa'ını ve muddunu bereketli kıl. Onun hummasını başka yere naklederek el-Cuhfe'ye koy.\" Fethu'l-Bari Açıklaması: \"Medine'ye geldik.\" Ebu Usame'nin Hişam'dan diye naklettiği rivayette şöyle denilmektedir: \"Orası da Allah'ın arzının vebası en çok olan bir yer idi.\" Muhammed b. İshak'ın, Hişam b. Urve'den rivayeti de buna yakın olup, orda şu fazlalık da vardır: \"Hişam dedi ki: Medine'nin vebası cahiliye döneminde bilinen bir husustu. Bir kimse oraya girip de onun vebasından kurtulmak isterse ona, anır derlerdi. O da eşeğin anırdığı gibi anırırd!.\" \"Ateşli hastalıklıdan kasıt hummadır",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 3927,
			"arabicnumber": 3927,
			"text": "Urve b. Zübeyr'den rivayete göre; Ubeydullah b. Adiy b. el-Hiyar kendisine haber vererek dedi ki: \"Osman'ın yanına girdim. Kelime-i şahadet getirdikten sonra dedi ki: Şüphesiz Allah Muhammed Sallallahu Aleyhi ve Sellem'i hak ile gönderdi. Ben de Allah'ın ve Resulünün davetini kabul eden Muhammed Sallallahu Aleyhi ve Sellem ile gönderileniere iman eden birisi oldum. Sonra da iki defa hicret ettim. Resulullah Sallallahu Aleyhi ve Sellem'e damat oldum, ona bey'at ettim. Allah'a yemin ederim, yüce Allah onun ruhunu kabzedinceye kadar ona ne isyan ettim, ne de onu aldattım",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 3928,
			"arabicnumber": 3928,
			"text": "İbn Şihab dedi ki: Bana Ubeydullah b. Abdullah'ın haber verdiğine göre İbn Abbas kendisine şunu haber vermiştir: \"Abdurrahman b. Avf, Ömer'in yaptığı son haccı esnasında Mina'da iken ailesinin yanına döndü. Ömer beni görünce: Ey Abdurrahman, dedi. Ben: Ey mu'minlerin emiri dedim. Şüphesiz hac mevsiminde sıradan ve anlayışsız insanlar da bir araya gelir. Benim görüşüme göre Medine'ye varıncaya kadar bu işe mühlet vermendir. Çünkü orası hicret, sünnet ve esenlik yurdudur. Orada fıkıh ehli, insanların eşrafı ve görüş sahipleri ile baş başa kalırsın. Ömer dedi ki: Andalsun Medine'de (hitap etmek üzere) ayağa kalkacağım ilk günde ayağa kalkıp (şunları) söyleyeceğim",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 3929,
			"arabicnumber": 3929,
			"text": "Harice b. Zeyd b. Sabiften rivayete göre; \"(Ensar) hanımlarından birisi olan ve Nebi s.a.v.'e da bey'at etmiş bulunan Ümmü'l-Ala'nın kendisine haber verdiğine göre muhacirlerin (hangilerinin kimin yanında) barınacağını tespit etmek üzere kura çektiklerinde kendileriyle beraber kalmak üzere kurada Osman b. Maz'un çıkmıştı. Ümmü Ala dedi ki: Osman b. Maz'un yanımızda hastalandı. Ben de vefat edinceye kadar ona hasta bakıcılık yaptım. Onu elbiselerine sardık. Nebi Sallallahu Aleyhi ve Sellem yanımıza girdiğinde: Ben ey Ebu's-Saib Allah'ın rahmeti üzerine olsun. Senin için şahadet ederim ki andolsun Allah sana ikramda bulunmuştur, dedim. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: Allah'ın ona ikramda bulunmuş olduğunu nerden anladın? Ümmü el-Ala dedi ki: Ben ona: Ey Allah'ın Resulü babam anam sana feda olsun, eğer ona ikram etmemişse kime ikram edeceğini bilemiyorum, dedim. Allah Resulü şöyle buyurdu: Allah'a yemin ederim, ona şu anda yakın gelmiş bulunuyor. Allah'a yemin ederim, onun lehine hayır ümid ediyorum. Bununla birlikte ben Allah'ın ResuIü olduğum halde Allah'a yemin ederim ki bana neler yapılacağını bilmiyorum. Ümmü el-Ala dedi ki: Allah'a yemin ederim, ondan sonra kimseyi tezkiye etmeyeceğim. Ümmü Ala dedi ki: Ama bu durum beni Ülmüştü. Uyudum, Osman için akan bir pınar gördüm. Gelip Resulullah Sallallahu Aleyhi ve Sellem'e gördüğüm rüyayı haber verdim. O, onun amelidir, dedi",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 3930,
			"arabicnumber": 3930,
			"text": "Aişe r.anha dedi ki: \"Buas günü, yüce Allah'ın Resulü lehine ve İslama girişlerine zemin olmak üzere önceden hazırlamayı takdir buyurduğu bir gün olmuştu. Çünkü Resulullah Sallallahu Aleyhi ve Sellem Medine'ye geldiğinde onların ileri gelenleri darmadağın olmuş, önderleri öldürülmüş bulunuyordu",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 3931,
			"arabicnumber": 3931,
			"text": "Aişe r.anha'dan rivayete göre \"Bir ramazan bayramı -yahut kurban bayramı- günü yanında Buas günü Ensarın çalıp oynadıkları sözleri nağmeli olarak söyleyen iki cariyenin de bulunduğu bir sırada Nebi Sallallahu Aleyhi ve Sellem de yanında bulunuyorken Ebu Bekir r.a. yanlarına girdi. Ebu Bekir -iki defa-: Şeytanın çaIgıIarı mı deyince, Nebi Sallallahu Aleyhi ve SellemşöyIe buyurdu: Onlara ilişme ey Ebu Bekir, her bir toplumun bir bayramı vardır. Bizim bayramımız da işte bu gündür",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 3932,
			"arabicnumber": 3932,
			"text": "Enes b. Malik r.a. dedi ki: \"ResuIullah Sallallahu Aleyhi ve Sellem Medine'ye gelince, Medine'nin üst taraflarında Amr b. Avf oğulları diye anıIan bir topIuIuğun arasında konakladı. (Enes) dedi ki: AraIarında ondört gün ikamet etti. Sonra Neccar oğullarından ileri geIen bazı kimseIere haber gönderdi. (Enes) dedi ki: KılıçIarını kuşanmış oIarak geIdiler. Sanki ben Resulullah Sallallahu Aleyhi ve Sellem'i bineği üzerinde, Ebu Bekir de terkisinde, Neccar oğullarından o gelenleri de onun etrafında görüyor gibiyim. Nihayet (eşyaları) Ebu Eyyub'un a\\Zlusuna bırakıldı. (Enes) dedi ki: Allah Resulü namaz vakti nerede girerse, orada namaz kılardı. Koyun ağılıarında dahi namaz kıldığı olurdu. Daha sonra mescidin bina edilmesini emretti. Neccar oğullarından ileri gelen kimselere haber gönderdi. Onlar da gelince dedi ki: Ey Neccar oğulları, bana bu bahçenizin bedelini söyleyiniz. Onlar Allah'a yemin ederiz olmaz. Biz bunun bedelini Allah'tan başkasından istemeyiz dediler. (Enes) dedi ki: Orada şimdi size söyleyeceklerim vardı: Orada müşriklerin bazılarının kabideri, bir takım yıkık kalıntılar ve birkaç hurma ağacı vardı. Resulullah s.a.v.'in emriyle müşriklerin kabideri açıldı (başka yere taşındı). Yıkıklar dümdüz edildi, hurma ağaçları da kesildi. (Enes) dedi ki: Hurma ağaçlarını mescidin kıble tarafına dizdiler. Onun kapısının iki yanını ise taştan yaptılar. Resulullah Sallallahu Aleyhi ve Sellem onlarla birlikte olduğu halde taşları taşıyor ve recez vezninde şöyle diyorlardı: 'Allah'ım, ahiret hayrı dışında yoktur bir hayır Sen Ensar ile muhacirlere yardım et.' \" Fethu'l-Bari Açıklaması: \"Bana bedelini söyleyiniz.\" Yani burayı bana bedeliyle satınız. \"Resulullah s.a.v.'in emriyle müşriklerin kabirleri açıldı.\" İbn Battal der ki: İlim adamlarından herhangi bir kimseden müşriklerin kabirlerinin yeri mescid edinilsin diye açılacağına dair bir ifade tespit edemedim. Evet, mal buı mak isteği ile kabirlerin açılışı hususunda görüş ayrılığı vardır. Cumhur bunu caiz kabul ederken, Evzaı bunu kabul etmemiştir. Ancak bu hadis bu işin caiz oluşuna bir delildir. Çünkü müşrik bir kimsenin hayatta olsun, ölmüş olsun herhangi bir saygınlığı yoktur. Bununla alakah gerekli araştırma Mescidler bölÜmünde (428. hadiste) geçmiş bulunmaktadır. \"Recez vezninde söylüyorlardı. .. \" Bu sahih kabul edilen görüşe göre bir şiir türüdür",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 3933,
			"arabicnumber": 3933,
			"text": "Abdurrahman b. Humeyd, ez-Zühri dedi ki: Ömer b. Abdu'l-Aziz'i en-Nemr'in kızkardeşinin oğlu Saib'e şunu sorarken dinledim: Mekke'de kalmak hususunda ne dinlemişsin? Dedi ki: el-Ala b. el-Hadramı'yi şöyle derken dinledim: Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Muhacir için sader tavafından sonra üç gün kalmak hakkı vardır.\" Fethu'l-Bari Açıklaması: \"Muhacir bir kimsenin menasikini bitirdikten sonra Mekke'de ikamet etmesi.\" Menasikten kas ıt hac ya da umre ibadetinin gerekleridir. \"el-Ala b. el-Hadraml\"nin adı Abdullah b. İmad'dır. Umeyye oğulları ile antlaşması olan birisi idi. el-Ala üstün bir sahabi idi. Nebi s.a.v. onu Bahreyn'e vali tayin etmişti. Duası kabul edilen birisi idi. Ömer r.a.'ın halifeliği döneminde vefat etmiştir. Buhari'de bunun dışında ondan gelen bir hadis rivayeti bulunmamaktadır. \"Muhacir için sader tavafından sonra üç gün kalmak hakkı vardır.\" Maksat Mina'dan dönüşten sonradır. Bu Hadisten Çıkarılan Sonuçlar 1- Mckke fethedilmeden önce oradan I-ıicret etmiş olan bir kimsenin Mekke'de ikamet etmesi haram idi. Fakat hac ya da umre menasikini bitirdikten sonra Mekke'ye giden kimsenin orada en fazla üç gün kalmasına izin verilmiştir. Bundan dolayı Nebi Sallallahu Aleyhi ve Sellem, Sa'd b. Havle'nin Mekke'de ölmesi üzerine üzüntüsünü belirten ifadeler kullanmıştır. 2- Bundan şu hüküm çıkartılır: Üç gün süreli bir ikamet kişiyi misafir (yolcu) olmaktan çıkarmaz. Bununla birlikte ed-Davudı'nin kullandığı ifadelerden bunun ilk muhacirlere mahsus olduğu anlaşılmaktadır. Ancak bunun ilk muhacirler diye kayıtlanmasının hiçbir anlamı yoktur. Nevevı der ki: Bu hadisin anlamı şöyledir: Mekke'den hicret eden kimseler için Mekke'yi yurt (vatan) edinmek haramdır. lyad da bunun cumhurun görüşü olduğunu naklederek şunları söylemektedir: Bununla birlikte Mekke fethedildikten sonra bir kesim bunun caiz olduğunu söylemiştir. İlim adamları bu görüşü sözü geçen hicretin farz olduğu zaman hakkında yorumlamışlardır. (Devamla) dedi ki: Bununla beraber herkes Mekke fethedilmeden önce hicret edip, Medine'de yerleşmenin vacip olduğunu ittifakla kabul etmişlerdir. Çünkü böylelikle Nebi Sallallahu Aleyhi ve Sellem'e yardım edilmiş ve canı ile de onun yanında yer anılmış olunur. Muhacir olmayan kimselerin ise ister Mekke, ister bir başkası olsun istediği herhangi bir yerde yerleşmesi ittifakla caiz kabul edilmiştir. (Kadı Iyad'ın sözleri burada sona ermektedir.) Bundan Nebi Sallallahu Aleyhi ve Sellem'in Medine dışında ikamet edip yerleşmeye izin verdiği kimseler istisna edilmiştir. 3- Bu hadis veda tavafının hac menasikinden olmayıp, bağımsız bir ibadet olduğuna da delil gösterilmiştir. Mezheb(imiz)deki iki görüşün daha sahih olanı budur. Çünkü bu hadiste: \"Nüsüklerini bitirdikten sonra\" denilmektedir. Zira veda tavafından sonra Mekke'de kalmak sözkonusu değildir. Eğer Mekke'de kalacak olursa bu durumda veda tavafı olmaktan çıkar. Kurtubı der ki: Bu hadis ile kastedilen Nebi Sallallahu Aleyhi ve Sellem'e yardımcı olmak amacıyla Mekke'den Medine'ye hicret eden kimselerdir. Bununla Mekke'nin dışındaki bir yerden hicret edenler kastedilmemiştir. Çünkü bu cevap onların Mekke'de ikamet etmek istememeleri ile ilgili olarak sordukları soruya cevap olarak verilmiştir. Zira onlar Mekke'yi Allah için terk etmiş bulunuyorlardı. Allah ResLılü de onlara bu şekilde cevap vermiş, üç gün süre ile kalmanın orada ikamet etmek anlamına gelmeyeceğini haber vermiştir. (Devamla) der ki: lyad'ın sözkonusu ettiği görüş ayrılıkları ise daha önce geçmiş olanlar hakkındadır. Acaba, dini hususunda fitneye maruz kalmaktan korktuğu bir yerden dinini kurtarmak amacı ile kaçan bir kimse, bu fitne hali sona erdikten sonra o yere geri dönebilir mi, hususu ile ilgili görüş ayrılıkları da buna göre ileri sürülebilir mi? Şöyle demek mümkündür: Şayet muhacirlerin yaptığı gibi orayı Allah için terk etmiş ise, hiçbir şekilde geri dönmesi sözkonusu olamaz. Eğer dinini kurtarmak amacıyla orayı terk etmiş ve bizatihi orayı terk etmek maksadını gütmemiş ise aynı yere (fitneye maruz kalma halinin sona erişinden sonra) gelebilir. (Kurtubi'nin ifadeleri burada sona ermektedir) Bu görüş güzel ve uygundur. Ancak bunun gayrimenkul yahut evleri geride bırakan kimseler ile tahsis edilmiştir. Fakat meselenin bununla tahsisine ihtiyacı yoktur. Doğrusunu en iyi bilen Allah'tır",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 3934,
			"arabicnumber": 3934,
			"text": "Sehl b. Sa'd dedi ki: \"Ne Nebi Sallallahu Aleyhi ve Sellem'in Nebi olarak gönderilişinden, ne vefatından itibaren (yılları) saymaya başladılar. Onlar ancak onun Medine'ye gelişinden itibaren saydılar",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 3935,
			"arabicnumber": 3935,
			"text": "Aişe r.anha dedi ki: \"Namaz iki rekat olarak farz kılındı. Daha sonra Nebi Sallallahu Aleyhi ve Sellem hicret etti, dört rekat olarak farz kılındı. Sefer (yolcu) namazı ise önceki hali gibi bırakıldl.\" Fethu'l-Bari Açıklaması: \"Tarih\" Cevheri der ki: Tarih, vaktin tarif edilmesi demektir. \"Tarihi nereden başlattılar.\" O bu ibareleriyle bu husustaki görüş ayrılıklarına işaret etmiş gibidir. es-Süheyll'nin belirttiğine göre ashab-ı kiram tarihi yüce Allah'ın şu buyruğundan hareket ederek hicret ile başlatmışlardır: \"İlk gününden temeli takva üzere kurulan mescid içinde (namaza) durman, elbette daha layıktır. \"[Tevbe, 108] Bilindiği gibi buradan kasıt, mutlak olarak ilk gün değildir. Böylelikle bunun zikredilmemiş bir şeye izafe edildiği ortaya çıkmaktadır. Bu ise yüce Allah'ın İslamı aziz kılıp güçlendirdiği, Nebi s.a.v.'in Rabbine güvenlik içerisinde ibadet ettiği ilk zamandır. Bu zamanda mescidi bina etmeye başlamıştır. Bu sebeple ashab-ı kiram da tarihi o günden başlatmayı uygun görmüşlerdir. Onların bu uygulamalarından yüce Allah'ın \"ilk günden\" ibaresinden İslam tarihinin ilk günü ibaresi anlaşılmıştır. (Evet, es-Süheyll) böyle demektedir. Hatıra ilk gelen ise yüce Allah'ın: \"İlk gününden\" buyruğunun Nebi s.a.v.'in ve ashabının Medine'ye ilk girdikleri gün olduğudur. Doğrusunu en iyi bilen Allah'tır. \"Medine'ye gelişinden\" yani geliş zamanından kastettiği, geldiği ay değildir. Çünkü tarih başlangıcı senenin başından itibarendir. Bazıları tarihi hicret ile başlatmanın bir münasebetle olduğunu da açıklayarak şöyle demektedir: Nebi s.a.v. ile ilgili tarihe başlangıç olarak alınması mümkün olan hususlar doğumu, ona Nebiliğin verilmesi, hicreti ve vefatı olmak üzere dört husustur. Onlar tarihi hicretten başlatmanın daha uygun olduğunu gördüler. Çünkü doğum ve Nebilik tarihlerinin yılolarak tayin edilmesi halinde ihtilaftan kurtulmak mümkün değildi. Vefat tarihini kabul etmeyişlerinin sebebi ise, vefatının sözkonusu edilmesiyle birlikte onun için üzüntünün tazeleneceğidir. Bundan dolayı tarihe başlangıç olarak sadece hicretin alınabileceği ortaya çıkmış oldu. Rebiu'l-ewel ayından Muharrem ayına ertelemelerinin sebebine gelince, hicret etme kararının Muharrem ayında verilmiş olmasıdır. Çünkü bey'at Zülhicce'de gerçekleşmiştir. Sözkonusu beyfat (Akabe beyTatil ise hicretin bir mukaddimesi durumundadır. Bu nedenle bey'atten sonraki ilk ay ve hicrete karar verilen ay, Muharrem ayı oldu. Bundan dolayı Muharrem ayının başlangıç kabul edilmesi uygun görülmüştür. Bu, benim Muharrem ayını başlangıç olarak kabul edilmesi ile gördüğüm açıklamaların en güçlü olanıdır. 49. NEBİ S.A.V.'İN: \"ALLAH'IM, ASHABIMIN HİCRETLERİNİ KABUL BUYUR\" DİYE DUASI VE MEKKE'DE ÖLEN KİMSELER İÇİN AĞITTA BULUNMASI)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 3936,
			"arabicnumber": 3936,
			"text": "Amir b. Sa'd b. Malik, babasından rivayetle dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem Veda haccı senesinde ölümün kertesine geldiğim bir hastalık dolayısıyla beni ziyaret etti. Ey Allah'ın Resuılü dedim. Hastalığım gördüğün dereceye ulaştı. Ben mal varlığı olan birisiyim. Bir kız çocuğumdan başka mirasçım da yok. Malımın üçte ikisini tas ad du k edeyim mi? Allah Resulü, hayır dedi. Sa'd, peki, onun yarısını tasadduk edeyim mi, diye sordu. Allah Resulü, ey Sa'd, üçte birini tasadduk et. Üçte biri de çoktur ya. Çünkü senin mirasçılarını arkanda zengin olarak bırakıp gitmen, onları insanlara el avuç açacak şekilde fakir olarak bırakmandan hayırlıdır. -Ahmed b. Yunus, İbrahim'den naklen: Zürriyetini bırakman diye zikretmiştir.- Üstelik sen Allah'ın rızasını arayarak her ne harcayacak olursan mutlaka Allah onun karşılığında sana ecir verir. Hatta hanımın ağzına koyduğun bir lokmanın bile. Ben, ey Allah'ın Resulü, ashabımdan geri kalacak mıyım diye sordum. O şöyle buyurdu: Sen geri bırakılıp da Allah'ın rızasını arayarak bir amelde bulunacak olursan mutlaka o amelin sebebiyle derecen artar ve merteben yükselir. Muhtemelen sen birtakım kimselerin seninle faydalanacağı, bir takım kimselerin de senden zarar göreceği bir vakte kadar geri kalacaksın (yaşayacaksın). A1lah'ım, ashabımın hicretlerini kabul buyur. Onları topuklarının üzerine gerisin geri çevirme! Fakat zavallı Sa'd b. Havle ... Bu sözleriyle Resulullah Sallallahu Aleyhi ve Sellem Mekke'de vefatı dolayısıyla üzüntüsünü dile getirmiş oldu.\".\" Ahmed b. Yunus ile Musa, İbrahim'den: \"Mirasçılarını bırakman\" diye rivayet etmişlerdir. Fethu'l-Bari Açıklaması: \"Nebi Sallallahu Aleyhi ve Sellem'in: A1lah'lm, ashabımın hicretlerini kabul buyur, demesi. .. ve Resulullah Sallallahu Aleyhi ve Sellem'in Mekke'de vefat edenler için üzüntüsünü dile getirmesi. .. \" Burada maksat, hicret edip terk ettiği şehirde öldüğünden ötürü onun için üzülmektir",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 3937,
			"arabicnumber": 3937,
			"text": "Enes r.a. dedi ki: \"Abdurrahman b. Avf (Medine'ye) geldi. Nebi Sallallahu Aleyhi ve Sellem onunla Ensardan Sa'd b. er-Rabi'i kardeş yaptı. Sa'd kendisine hanımlarından birisini ve malının yarısını ona vermeyi teklif etti. Abdurrahman, Allah hanımlarını da, malını da senin için mübarek kılsın. Sen bana pazarın yolımu göster, dedi. Bir parça keş ve biraz da yağ kar etti. Günler sonra Nebi Sallallahu Aleyhi ve Sellem, onun üzerinde safran kokusu bulaşmış olarak gördü. Nebi Sallallahu Aleyhi ve Sellem: Ne haber ey Abdurrahman, dedi. Abdurrahman: Ey Allah'ın Resulü, Ensardan bir kadın ile evlendim deyince, Allah Resulü: Sen ona (mehir olarak) ne verdin, diye sordu. O: Hurma çekirdeği ağırlığınca altın, dedi. Nebi Sallallahu Aleyhi ve Sellem: Bir koyun ile dahi olsa düğün ziyafeti ver, buyurdu.\" Fethu'l-Bari Açıklaması: \"Nebi s.a.v., ashabı arasında nasıl kardeşlik yaptı.\" İbn Abdilberr der ki: Ashab arasında kardeşlik kılma olayı iki defa olmuştur. Birisi özelolarak muhacirler arasında olmuştur, bu Mekke'de yapıldı. Birisi de muhacirlerle Ensar arasında yapılmıştır. Burada maksat da odur. İbn Sa'd, Vakidi yoluyla gelen ve tabiinden bir grup kişiye ulaşan bir takım senedIerle şöyle dediklerini rivayet etmektedir: Nebi s.a.v. Medine'ye geldi ve muhacirler arasında kardeşlik yaptığı gibi muhacirlerle Ensar arasında da birbirlerini gözetIemek üzere kardeşlik yaptı. Önceleri birbirlerine mirasçı dahi oluyorlardı. Bunlar doksan kişi idi. Bazıları muhacirden, bazıları Ensardan idiler. Yüz kişi oldukları da söylenmiştir. Yüce Allah'ın: \"Akrabalar ... \"[Enfal, 75] buyruğu nazil olunca bu kardeşlik sebebiyle aralarındaki mirasçılık da sona ermiş oldu. Derim ki: İleride Feraiz (miras hukuku) bölümünde geleceği üzere İbn Abbas'tan şöyle dediği rivayet edilmiştir: \"Muhacirler Medine'ye geldiklerinde muhacir olan kimse akrabalık bağı olanlar bir tarafa Nebi s.a.v.'in aralarında yaptığı kardeşlik sebebiyle, kardeşlik vasfıyla Ensardan olana mirasçı oluyordu. Bunun üzerine bu ayet nazil oldu.\" es-Süheyll der ki: Allah Resulünün ashabı arasında kardeşlik yapmasının sebebi, gurbeti n sebep olduğu yalnızlık duygularını gidermek ve ailelerinden, aşiretlerinden ayrılmanı yalnızlığını unutarak teselli bulmalarını sağlamak, birinin diğerine yardımcı olmasını temin etmektir. İslam güçlenip, herkes ailesiyle bir araya gelip, bu yalnızlığın etkileri de gidince kardeşlik dolayısıyla mirasçı olmayı kaldırdı ve mu'minlerin hepsini kardeş yaparak: \"Mürninler kardeştir\" buyruğunu indirdi. Maksat da onların birbirlerine karşı sevgi ve daveti n kapsamlı oluşu açısından kardeş olduklarıdır. Muhammed b. İshak da kardeş yapmayı sözkonusu ederek şunları söylemiştir: \"Resı1lu!lah Sallallahu Aleyhi ve Sellem hicret ettikten sonra ashabına, ikişer ikişer kardeş olun uz dedi. Kendisi Ali ile Hamza, Zeyd b. Harise ile Cafer b. Ebi Talib Muaz b. Cebel ile kardeş oldu.\" Süneyd'in Tefsir'inde de şöyle denilmektedir: Muaz ile İbn Mes'ud, Ebı1 Bekir ile Harice b. Zeyd, Ömer ile İtban b. Malik kardeş oldular. Namaz girişinde taraflarında Ömer'in: \"Ensardan bir kardeşim vardı\" sözü de geçmiş bulunmaktadır. Bu kardeşinin kimliği İtban diye açıklanmıştır. Ebı1'd-Derda ve Selman'ın durumunda olduğu gibi, onunla kardeşliği uzun süre de devam etmiş olabilir. Mus'ab b. Umeyr ile Ebu Eyyub, Ebu Huzeyfe b. Utbe ile Abbad b. Bişr, Hatıb b. Ebi Beltaa ile Uveym b. Saide, Selman ile Ebu'dDerda da kardeş olmuşlardı. Kardeşlik ilk olarak Nebi efendimizin Medine'ye ilk gelişi sırasında başladı ve İslama girenlerin ya da Medine'ye gelenlerin çoğalmasına bağlı olarak bu kardeşliği tekrarlamaya devam etti. Hakim ile İbn Abdilberr'in hasen bir senedIe Ebu'ş-Şa'sa'dan, onun İbn Abbas'tan rivayetine göre \"Nebi Sallallahu Aleyhi ve Sellem ez-Zubeyr ile İbn Mes'ud'u kardeş yapmıştır.\" Her ikisi de muhacirdirler. Derim ki: Ayrıca ed-Dıya bunu el-Muhtare adlı eserinde Taberani'nin el-Mu'cemu'I-Kebir adlı eserinden, diye rivayet etmiştir. İbn Teymiye'de açıkça el-Muhtare'deki hadislerin Müstedrek'teki hadislerden daha sahih ve kavi olduklarını belirtmiştir. Kardeşlik ile alakalı birinci kıssayı Hakim Cumey' b. Umeyr yoluyla İbn Ömer'den diye şöylece rivayet etmiştir: \"Resulullah s.a.v. Ebu Bekir ile Ömer, Talha ile ez-Zubeyr, Abdurrahman Avf ile Osman'ı kardeş yapmıştır. -Bir topluluğun da ismini zikrettikten sonra şunları söylemektedir:- Ali dedi ki: Ey Allah'ın Resulü sen ashabın arasında kardeşlik yaptın ya benim kardeşim kim? Allah Resulü: Senin kardeşin benim diye buyurdu.\" Bu rivayet daha önce geçenlere katılacak olursa, bu yolla daha bir güçlenmiş olurlar. 51. BAB",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 3938,
			"arabicnumber": 3938,
			"text": "Enes'den rivayete göre \"Abdullah b. Selam'a Nebi Sallallahu Aleyhi ve Sellem'in Medine'ye ulaştığı haberi gelince, onun yanına bazı hususları sormak üzere gitti ve dedi ki: Ben sana bir nebiden başkasının bilmediği üç hususu soracağım: Kıyametin ilk al am eti nedir? Cennetliklerin ilk yiyeceği yemek ne olacaktır? Evlat ne diye babasına ya da annesine çeker? Allah Resulü şöyle buyurdu: Bunu az önce Cibril bana haber verdi. İbn Selam dedi ki: Bu Yahudilerin düşman kesildiği melektir. Allah Resulü şöyle buyurdu: Kıyametin ilk alameti, insanları doğudan batıya doğru sürükleyip toplayan bir ateş olacaktır. Cennetliklerin yiyeceği ilk yemek, balığın kara ciğerinin ziyadesi olacaktır. çocuğa gelince erkeğin suyu kadının suyunu geçerse çocuk ona benzer. Eğer kadının suyu erkeğin suyunu geçerse çocuk ona benzer. (Abdullah b. Selam) dedi ki: Allah'tan başka hiçbir ilah olmadığına ve senin Allah'ın Rest1lü olduğuna şehadetederim. (Daha sonra) dedi ki: Ey Allah'ın Resuıü, Yahudiler iftiracı bir kavimdir. Onlara benim Müslüman olduğumu bilmelerinden önce benim hakkımda soru sor. Yahudiler gelince, Nebi Sallallahu Aleyhi ve Sellem: Aranızda Abdullah b. Selam nasıl bir adamdır diye sordu. Onlar: Bizim de hayırlımızdır, en hayırlımlZın da oğludur. Bizim de en faziletlimizdir, en faziletlimizin de oğludur. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem şöyle sordu: Peki Abdullah b. Selam Müslüman olursa ne dersiniz? Onlar: Böyle bir şeyden Allah onu korusun, dediler. Aynı soruyu onlara tekrar sorunca onlar da az önceki gibi cevap verdiler. Abdullah b. Selam yanlarına çıkarak: Allah'tan başka hiçbir ilahın olmadığına, Muhammed'in de Allah'ın Resulü olduğuna şahadet ederim, dedi. Bu sefer Yahudiler: Bizim kötümüz, aramızdaki en kötünün oğlu, diyerek onun değerini küçültücü sözler kullandılar. (Abdullah b. Selam): İşte ben bundan korkuyordum ey Allah'ın Resulü, dedi",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 3940,
			"arabicnumber": 3940,
			"text": "هادو \"Hadu\" Yahudi oldular demektir. هدنا \"Hudna\" buyruğu ise tevbe ettik demektir. هائد \"Haid\" de tevbe eden anlamındadır",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 3941,
			"arabicnumber": 3941,
			"text": "Ebu Hureyre'den rivayete göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Yahudilerden on kişi bana iman etse, şüphesiz (bütün) Yahudiler bana iman ederdi",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 3942,
			"arabicnumber": 3942,
			"text": "Ebu Musa r.a. dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem Medine'ye girdiğinde Yahudilerden bazı insanların Aşura (günü)nü tazim ettiklerini ve o gün de oruç tuttuklarını gördü. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem: Bizim o gün oruç tutmamız daha uygundur, dedi ve o gün oruç tutulmasını emretti",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 3943,
			"arabicnumber": 3943,
			"text": "İbn Abbas r.a. dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem Medine'ye gelince Yahudilerin Aşura günü oruç tuttuklarını gördü. Buna dair kendilerine soru sorulunca şu cevabı verdiler: Bu, Allah'ın Musa'ya ve İsrailoğullarına Firavun'a karşı zafer verdiği gündür. Biz de onu tazim etmek üzere bugünü oruç tutuyoruz. Onlar böyle deyince, Resulullah Sallallahu Aleyhi ve Sellem: Biz Musa'ya sizden daha yakınız deyip, o gün oruç tutulmasını emretti",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 3944,
			"arabicnumber": 3944,
			"text": "Abdullah b. Abbas r.a.'dan rivayete göre \"Nebi Sallallahu Aleyhi ve Sellem saçlarını serbest bırakırdI. Müşrikler ise saçlarını ortadan ayırırlardı. Kitap ehli de saçlarını serbest bırakırdI. Nebi Sallallahu Aleyhi ve Sellem de hakkında kendisine herhangi bir emir verilmediği hususlarda kitap ehline muvafakat etmeyi severdi. Fakat Nebi Sallallahu Aleyhi ve Sellem deha sonra saçlarını ayırdı",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 3945,
			"arabicnumber": 3945,
			"text": "İbn Abbas r.a. dedi ki: \"Onlar kitap ehlidirler. Onu kısımlara ayırdılar. Bir bölümüne iman ettiler, diğer bazısını inkar edip kafir oldular.\" Bu Hadis 4705 ve 4706 numara ile gelecektir. Fethu'l-Bari Açıklaması: \"Nebi Sallallahu Aleyhi ve Sellem'in Medine'ye gelişinden sonra Yahudilerin yanına gelmeleri\" Ebu Said \"Şerefu'I-Mustafa\" adlı eserinde Said b. Cubeyr yoluyla şunu rivayet etmektedir: Yahudilerin başı olan Meymun b. Yamın, Resuluilah Sallallahu Aleyhi ve Sellem'in yanına gelerek dedi ki: Ey Allah'ın Resulü! Onlara bir haber gönder ve beni de hakem tayin et. Onlar (anlaşmazlık konularında) bana başvururlar. O da onu içeriye yerleştirdi. Sonra Yahudilere haber gönderdi. Onun yanına gelerek onunla konuştular. Allah Resulü onlara: Benimle sizin aranızda hakemlik yapacak bir adam seçiniz, diye buyurdu. Onlar: Biz Meymun b. Yamın'in hakemliğine razıylZ, dediler. Allah Resulü: Yanlarına çık diye buyurdu. Meymun: Şehadet ederim ki o Allah'ın Resulüdür, dedi. Fakat onu tasdik etmeyi kabul etmediler. İbn İshak'ın zikrettiğine göre Nebi Sallallahu Aleyhi ve Sellem Medine'ye geldikten sonra Yahudilerle bir barış antlaşması yaptı. Onlar ona tabi olmayı kabul etmediler. Bu sebeple onlarla arasında bir kitap yazdı (bir antlaşma belgesi düzenledi.) Yahudiler Kaynuka, Nadir ve Kureyza olmak üzere üç kabile idiler. Üçü de biri diğerinden sonra ahitlerini bozdular. Kaynuka oğullarını karşılıksız serbest bıraktı, Nadir oğullarını sürgüne gönderdi, Kureyza oğullarını da kökten imha etti. Yüce Allah'ın izniyle biraz sonra bütün bunlara dair etraflı açıklamalar gelecektir. \"Yahudilerden on kişi bana iman etse, Yahudilerin hepsi bana iman edecektir.\" el-İsmaill'nin rivayetinde: \"Müslüman olmadık Yahudi kalmaz\" şeklindedir. Ebu Said de \"Şerefu'I-Mustafa\" adlı eserinde bunu böylece rivayet etmiş ve sonunda şunları eklemiştir: \"Ka'b dedi ki: Bunlar yüce Allah'ın Maide suresinde sözünü ettiği kimselerdir.\" Buna göre kastedilen, belirli özel on kişidir. Çünkü ona (Yahudilerden) on kişiden fazla iman etmiş idi. Göründüğükadarıyla bunlar, o dönemde Yahudiler arasında başkanlık konumunda idiler. Onların dışında olanlar da onlara tabi kimseler idi. Fakat bunlar arasından ancak pek az kimse Müslüman olmuştur. Abdullah b. Selam gibi. O da Nebi s.a.v.'in Medine'ye gelişi sırasında Yahudiler arasında başkanlığı ile ünlü kimselerden idi. Nadir oğullarından Ebu Yasir b. Ahtab, onun kardeşi Huyey b. Ahtab, Ka'b b. el-Eşref ile Rafi' b. Ebi'l-Hukayk da bulunmaktadır. Kaynuka oğullarından Abdullah b. Huneyf, Finhas ve Rifaa b. Zeyd'dir. Kureyza oğullarından ise Zubeyr b. Batıya, Ka'b b. Esed ve Şemuvil b. Zeyd'dir. Bunlardan hiçbirisinin Müslüman olduğu sabit değildir. Bunların her birisi Yahudiler arasında bir başkan idi. Eğer bu başkan Müslüman olmuş olsaydı, Yahudilerden bir topluluk onlara uyardı. Muhtemelen kastedilen de budur",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 3946,
			"arabicnumber": 3946,
			"text": "Ebu Osman'dan rivayete göre \"Selman el-Farisi'den nakledildiğine göre o bir rabden (efendiden) diğerine geçmek suretiyle on küsur rab (efendi) arasında el değiştirdi",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 3947,
			"arabicnumber": 3947,
			"text": "Ebu Osman dedi ki: Selman r.a.'i şöyle derken dinledim: \"Ben Ramehürmüz'lüyüm",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 3948,
			"arabicnumber": 3948,
			"text": "Selman dedi ki: \"İsa ile Muhammed (ikisine de Allah'ın salat ve selamları olsun) arasındaki fetret (süre) altıyüz yıldır.\" Fethu'l-Bari Açıklaması: \"Bir rabden diğerine geçmek suretiyle on küsur rab arasında el değiştirdL\" Muhtemelen Ebu. Hureyre'nin \"rab\" lafzının efendi hakkında kullanılmasını nehyeden hadisi ona ulaşmamıştır. Bu hadis daha önce Buyo.' (alışverişier) bölümünde geçmiş bulunmaktadır. \"Küsur (el-bıd')\" kelimesinin meşhur görüşe göre üçten dokuza kadar olanları anlatmak için kullanıldığı geçmiş bulunmktadır. \"Ben Ramehürmüz'ıüyüm.\" Burası Fars ülkesinde lrak-ı Arab'a yakın, bilinen bir şehirdir. \"İsa ile Muhammed (ikisine de Allah'ın salat ve selamları olsun) arasındaki fetret 600 yıldır.\" Maksat içinde Allah'tan vahiy alan bir Resulün gönderilmediği süredir. Fakat bu dönem zarfında son Resulün şeriatına davet edecek kimselere nubuwet verilmesine de mani yoktur. 7 CİLT BURADA SONA ERDİ. 8.CİL ve MEĞAZİ BÖLÜMÜ, BİR SONRAKİ SAYFA İLE BAŞLIYOR",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 172
			}
		}
	]
}