{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"66": "Virtues of the Qur'an"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4979,
			"arabicnumber": 4979,
			"text": "",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 4980,
			"arabicnumber": 4980,
			"text": "Ebu Osman'dan rivayet edildiğine göre, o şöyle demiştir: \"Bana haber verildiğine göre, Nebi Sallallahu Aleyhi ve Sellem Ümmü Seleme'nin yanında iken Cebrall A.S. gelip onunla konuşurdu. Allah Resıılü Sallallahu Aleyhi ve Sellem Ümmü Seleme'ye 'bu kimdir?'' diye sordu. Ya da buna benzer bir soru yöneltti. O da, 'Dihye' diye karşılık verdi. Nebi Sallallahu Aleyhi ve Sellem kalkınca Ümmü Seleme: 'Allah'a and olsun ki, onun ancak Dihye olduğunu düşünüyorum', dedi. Ravi, 'Nebi Sallallahu Aleyhi ve Sellem'in Cebrail haberini anlattığı hutbesini dinledim' dedi veya buna yakın bir söz söyledi. Babam şöyle dedi: Ebu Osman'a bu hadisi kimden duyduğunu sordum. O bu hadisi Üsame İbn Zeyd'den duyduğunu haber verdi",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 4981,
			"arabicnumber": 4981,
			"text": "Ebu Hureyre'den Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğu rivayet edilmiştir: \"Bütün Nebilere, insanların onların benzerine iman ettiği bir takım mu'cizeler verilmiştir. Bana verilen mu'cize ise, Allah'ın bana ilka ettiği vahiydir. Bu nedenle, kıyamet günü Nebiler arasında kendisine uyanların en çok olduğu Nebi olmayı umuyorum. \" Hadisin geçtiği diğer yer: 7274",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4982,
			"arabicnumber": 4982,
			"text": "Enes İbn Malik'ten şöyle dediği nakledilmiştir: \"Allah Teala Nebi Sallallahu Aleyhi ve Sellem vefat edinceye kadar vahiy indirdi. Hatta vefatından önce çok sık vahiy gelirdi. Sonra Allah Resulü Sallallahu Aleyhi ve Sellem ahirete irtihal etti",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 4983,
			"arabicnumber": 4983,
			"text": "Cündeb'den şöyle söylediği rivayet edilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem'in vahyin kesilmesinden dolayı canı sıkılmıştı. Bundan rahatsızlandı, bu arada bir ya da iki gece geçmeden kadının biri ona gelip 'şeytanın seni terk etmiş galiba, dedi. Bunun üzerine Allah Teala tekrar vahiy indirmeye başladı ve Duha suresinin ilk ayetlerini Resulüne vahyetti: Kuşluk vaktine ve örtüp bürüdüğünde/sükuna erdiğinde geceye yemin ederim ki, Rabbin seni terk edip bırakmadı, sana asla da darılmadl. \"(Duha 1-3) Fethu'l-Bari Açıklaması: Nebi Sallallahu Aleyhi ve Sellem vahiy inmeye başladıktan sonra Mekke'de on yıl kaldı. Medıne'de de on yıl kaldı. Hz. Nebi Sallallahu Aleyhi ve Sellem'in kırk yaşına girdikten sonra vahiy almaya başladığına dair meşhur görüş dikkate alınınca, bu rivayetten ortaya çıkan sonuca göre Hz. Nebi altmış sene yaşamıştır. Ancak ravinin küsürlü rakamları yuvarlama ihtimali de vardır. Nitekim bu konu, Hz. Nebi Sallallahu Aleyhi ve Sellem'in vefatı anlatılırken geçmişti. İtibar edilen görüşe göre Hz. Nebi altmış üç sene yaşamıştır. Bu hadisten konu başlığı ile ilgili olarak Kur'an'ın tamamının birden değil de, parça parça nazil olduğu sonucu ortaya çıkar. Hakim ve Beyhaki'nin \"Delail\" adlı eserinde naklettiği rivayette \"senelere yayılarak indirildi\" ifadesi yer almaktadır. İbn Ebi Şeybe ve Hakim'in naklettikleri başka bir sahih rivayette ise şöyle geçmektedir: \"Kur'an yakın semadaki beyt-i izzeye kondu. Daha sonra Cebrail aleyhisselam onu, Hz. Nebi'e Sallallahu Aleyhi ve Sellem parça parça indirmeye başlad!.\" Bu rivayetin senedi sahihtir. Kur'an-ı Kerim'in levh-i mahfUzdan bütünüyle yakın semaya, buradan da parça parça Allah Resulü'ne indirildiği görüşü, kabul edilen sahih görüştür. Yine kabul edilen gerçeklerden biri de, Cebrail aleyhisselam'ın her Ramazan ayında o yıl boyunca inen ayetleri Nebi Sallallahu Aleyhi ve Sellem ile mukabele edip karşılaştırdığıdır. Nitekim Ebu Ubeyd ve İbn Ebi Şeybe'nin sahih bir senetle naklettikleri rivayette Şa'bi kesin bir dille bunu ifade etmiştir. Ahmed İbn Hanbel ve \"Şuabu'l-fman\" adlı kitabında Beyhaki, Vasile İbn Eska'dan Hz. Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmiştir: \"Tevrat Ramazan'ın altıncı günü, İncilonüçüncü günü, ZebUr onsekizinci günü, Kur'an ise yirmi dördüncü günü nazil olmuştur.\" Bütün bu rivayetler, şu ayet-i kerimelerle uyum içindedir: \"Ramazan ayı, insanlara yol gösterici, doğrunun ve doğruyu eğriden ayırmanın açık delilleri olarak Kur'an'ın indirildiği aydır. \"(Bakara 185) \"Biz onu (Kur'an'ı) Kadir gecesinde indirdik.\"(Kadr 1 ) O seneki Kadir gecesinin, Kur'an'ın bütünüyle dünya semasına indirildiği gece olma ihtimali vardır. Daha sonra da Ramazan'ın yirmi dördüncü günü Alak suresinin ilk beş ayatinden başlamak üzere, parça parça dünyaya indirilmeye başlanmıştır. Bu konuda zikredilen hadisten, Kur'an'ın sadece Mekke ve Medine şehirlerinde nazil olduğu anlaşılır. Vakıa da böyledir. Ancak, bir çok Kur'an ayeti haremeynin dışında nazil olmuştur. Mesela; Hz. Nebi'in hac yolculuğunda, umre seyahatinde ve askeri seferlerinde Kur'an ayetleri inmiştir. Şu kadarı var ki, ister bu şehirlerde ikamet halinde, isterse sefer halinde nazil olsun, terim olarak hicretten önce inen ayetlere Mekkı, hicretten sonra inen ayetlere ise Medenı denir. Bu hadisten anlaşıldığına göre melek, insan suretine girebilir. O kendi suretinde iken insanlar onu göremezler. Çünkü insanoğlunun beşeri melekeleri bunun için yeterli değildir. Ancak Allah Teala, dilediğini melekleri görecek kadar güçlü hale getirir. Bundan dolayıdır ki, Cebra'il aleyhisselam Hz. Nebi Sallallahu Aleyhi ve Sellem'e çoğu defa insan suretinde gelirdi. Nitekim bu husus \"Bedu'l-vahy\" konusu işlenirken \"bazen de melek bana insan şekline bürünerek gelirdi,\" şeklinde geçmişti. Cebral1 aleyhisselam ancak iki defa Allah'ın kendisini yarattığı suret üzere görülmüştür. Bu iki durum, Sahihayn'da sabittir. \"Bana verilen mucize ise, Allah'ın bana ilka ettiği vahiydir.\" ifadesi \"benim, insanlara meydan okuduğum mucizem, Allah'ın bana indirdiği vahiydir, bir başka ifadeyle Kur'an'dır\", anlamına gelir. Çünkü Kur'an'da apaçık bir i'caz vardır. Yoksa bu ifade, Hz. Nebi Sallallahu Aleyhi ve Sellem'in gösterdiği mucizelerin sadece Kur'an'dan ibaret olduğu anlamına gelmez. Yani ondan önceki Nebilere verilen mucizeler gibi kendisine de mucize verilmediği manasını taşımaz. Bilakis bununla, en büyük mucizenin başkalarına değil de yalnızca kendisine verildiği kastedilmiştir. Çünkü her Nebie kendisine özgü bir mucize verilmiştir. Aynı mucize başka bir Nebi'e verilmemiştir. Nebiler bu mucizelerle kavimlerine meydan okurlardl. Her Nebiin mucizesi, kavminin durumuna uygun olurdu. Mesela sihrin yaygın olduğu Firavun döneminde Hz. Musa aleyhisselam sihirbazların yaptıkları surete dönüşen bir asa ile gönderilmiştir. Bu asa, sihirbazların yaptıklarını yutuyordu. Bu mucize bir başka Nebie verilmemiştir. Benzer şekilde Hz. İsa aleyhisselam körleri ve alaca hastalarını iyileştiriyordu. Aslında bunlar doktor ve hekimlerin işiydi. Hz. İsa'ya aleyhisselam bu mu cizelerin verilmesi, o dönemde tıppın ileri bir noktada olmasından kaynaklanır. Bu yüzden o, kavminin mesleği olan ama onların güç yetiremeyecekleri mucizelerle gönderilmiştir. Bundan dolayıdır ki Hz. Nebi Sallallahu Aleyhi ve Sellem, belagatta zirve de olan Arap toplumuna Kur'an ile gönderilmiştir. Onlara Kur'an'ın bir suresinin benzerini getirmeleri yönünde meydan okumuştur. Ama bunu başaramamışlardır. Hz. Nebi Sallallahu Aleyhi ve Sellem'in bu sözünün şu anlama geldiği de ileri sürülmüştür: Diğer Nebilerin mucizeleri, dönemleri bitince sona ermiştir. Ancak bu mucizeler o dönemde yaşayanlar tarafından görülmüştür. Kur'an mucizesi ise kıyamete kadar devam edecektir. Üslubu, belagati, gaybi haberleri ile harikulade olma özelliği sürecektir. Her geçen asırda onun haber verdiği yeni bir hakikat ortaya çıkacaktır. Bu da, onun mesajının doğruluğuna delil olacaktır. Bu görüş, bu konu etrafında ileri sürülen ihtimallerin en güçıüsüdür. \"Bu vesileyle kıyamet günü Nebiler arasında kendisine uyanlann en çok olduğu Nebi olmayı umuyorum.\" Hz. Nebi Sallallahu Aleyhi ve Sellem bu sözünü, sonsuz mucizesi Kur'an'dan bahsettikten sonra söylemiştir. Çünkü Kur'an'da birçok fayda ve son derece umumı pek çok yarar vardır. Zira geleceğe dair haber, delil ve çağırıları içermektedir. Bu yüzden Kur'an'ın yararı herkesi kapsamaktadır. Hem onun nüzulüne şahid olanlara, hem olmayanlara, hem şu an bulunanlara, hem de daha sonra var olacak kimselere yöneliktir. Dolayısıyla Allah Resulü Sallallahu Aleyhi ve Sellem'in yukarıdaki beklentisini bunun üzerine bina etmesi güzelolmuştur. Nitekim onun bu beklentisi gerçekleşmiştir. Artık o, kendisine en fazla uyulan Nebidir. inşallah \"Kitabu'r-rikak\" bölümünde bu konu ayrıntılı bir biçimde ele alınacaktır. Hadisin Konu Başlığı ile ilişkisi: Kur'an, rüya veya ilham yoluyla değil, melek CebralI'in getirdiği va hi yle nazil olmuştur. Bazıları Kur'an'ın icazını dört konuda toplamıştır: a) Telif Bakımından: Kur'an'ın telifi ile ayetlerinin kısa ve beliğ olmasına rağmen birbiri ile kaynaşması fevkalade güzelliktedir. b) Üslup Bakımından: Kur'an, belagat ustası Arapların nesir ve şiir olarak sergiledikleri bütün üsluplardan farklıdır. Bu yüzden Kur'an karşısında akılları şaşmış ve onun bir benzerini getirmekten aciz kalmışlardır. Oysa bunu yapmaları için bütün şartlar oluşmuştu. Üstelik Kur'an da onlara bunu yapamayacaklarına dair meydan okumuştu. c) Geçmiş Milletlerin Bilgileri: Kur'an'da önceki milletlerin haberleri ile ehli kitabın büyük bir kısmı yok olmuş şeriatlarından bahsedilmiştir. Ehli kitabın çok azı bu şeriatların bir kısmını bilebilir. d) Gelecekten Haber Verme: Kur'an'da meydana gelecek olaylardan haberler mevcuttur. Bunlardan bir kısmı Hz. Nebi döneminde meydana gelmiştir. Bir kısmı ise ondan sonraki dönemlerde gerçekleşmiştir. Bu dört konu dışında, insanların Hz. Nebi Sallallahu Aleyhi ve Sellem'i yalanlamaları sebebiyle bir çok nedene binaen yapmaları gereken fakat yapamayıp aciz kaldıkları bir takım konularda da onun mucizeleri söz konusudur. Mesela; yahudilerin ölümü temenni edememeleri, Kur'an'ı dinleyen kimseyi ürperti kaplaması, onu okuyan ve dinleyenin bıkmaması, onun defalarca okunması ancak bunun onun güzelliğini ve tadını artırması, dünya döndüğü sürece mücizevi özelliğinin devam etmesi, yeni ve yararlı yönlerinin hiç eksik olmayacağı ilim ve bilgileri içermesi buna örnek olarak verilebilir. Bu görüşleri Kadı Iyaz ve diğerlerinin düşüncelerinden özetleyerek oluşturdum. Hz. Nebi Sallallahu Aleyhi ve Sellem'i vefatının gerçekleşmesine yakın zamanlarda, diğer dönemlere göre daha çok vahiy inmiştir. \"Süfyan bize rivayet etti.\" ifadesinde bahsi geçen Süfyan, es-Sevrl'dir. Bu hadisin açıklaması biraz önce \"Duha Suresinin Tefsiri\" başlığı altında geçmişti. İmam Buharı'nin bu rivayeti burada zikretmedeki gayesi ise, vahyin gecikmesine işaret etmek içindir. Vahiy, ancak bir hikmete binaen gecikir. Vahyin gecikmesi, asla Allah Teala'nın Nebiini terk ettiği manasına gelmez. Vahyin inişi çeşitli şekillerde olmuştur. Vahiy, bazen peş peşe nazil olmuştur, bazen ise gecikmiştir. Kur'an'ın parça parça indirilmesinin bir takım hikmetleri vardır. Bunları şu şekilde sıralamak mümkündür: a) Kur'an'ın ezberlenmesini kolaylaştırmak: Eğer Kur'an-ı Kerim büyük bir çoğunluğunun okur-yazar olmadığı bir topluma bir defada inseydi, insanların onu ezberlemesi zor olurdu. Nitekim Allah Teala, kafirlerin itirazını reddederken şu ayet ile buna işaret etmiştir: \"İnkar edenler: Kur'an ona bir defada indirilmeyi değil miydi? dediler. Biz onu senin kalbine iyice yerleştirmek için böyle yaptık (parça parça indirdik) ve onu tane tane (ayırarak) okuduk.\"(Furkan 32) Aynı şekilde şu ayetle de buna temas etmiştir: \"Biz Kur'an'ı insanlara dura dura okuyasın diye (ayet ayet, sure sure) ayırdık. Ve onu peyderpey indirdik.\"(İsra 106) b) Hz. Nebi Sallallahu Aleyhi ve Sellem'e verilen önem: Kur'an'ın peyderpey indilirişi, Allah Resulü Sallallahu Aleyhi ve Sellem'e değer verilip ihtimam gösterildiğine delalet eder. Çünkü Rabbinin elçisi defalarca kendisine gelmiş ve karşılaştığı konular veya kendisine yöneltilen sorular hakkında Hz. Nebi'e Rahman'ın hükümlerini öğretmiştir. c) Kur'an yedi harf üzere inmiştir. Dolayısıyla farklı zamanlarda parça parça nazil olması uygun oldu. Eğer bir defada nazil olsaydı, bu yedi harfi insanlara açıklamak, bilindiği üzere zor olacaktı. d) Allah Teala dilediği hükümlerini ne sh etmeyi murat etmiştir. Kur'an'ın parça parça nazil olması nasihin mensuhtan ayrılması içindir. Nasih ve mensuh ayetlerin bu şekilde ayrı ayrı inmesi, ikisinin birden inmesinden daha evladır",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 4984,
			"arabicnumber": 4984,
			"text": "Enes İbn Malik'ten rivayet edildiğine göre, o şöyle demiştir: \"Hz. Osman, Zeyd İbn Sabit, Said İbnu'l-As, Abdullah İbnu'z-Zubeyr ve Abdurrahman İbnu'I-Haris İbn Hişam'a Kur'an nüshalarını çoğaltmalarını emretti. Onlara şöyle talimat verdi: Siz ve Zeyd İbn Sabit Kur'an'ın Arapçası hususunda herhangi bir yerde ihtilafa düşerseniz, onu Kureyş lehçesi ile yazınız. Çünkü Kur'an, onların lehçesi ile nazil oldu. Komisyon üyeleri bu talimata uydular",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 4985,
			"arabicnumber": 4985,
			"text": "Safvan İbn Ya'la İbn Ümeyye'den şöyle dediği rivayet edilmiştir: \"Ya'la 'keşke vahiy nazil olduğu zaman Rasulullah'ı görseydim' diye temennide bulundu. Nebi Sallallahu Aleyhi ve Sellem Ci'rane'de iken üzerinde kendisini güneşten koruyan bir örtü vardı. Beraberinde ise ashabından bazı insanlar bulunuyordu. Derken koku sürünmüş bir adam gelip 'Ey Allah'ın Resulü! koku süründükten sonra bir cübbeyle ihram'a giren adam hakkında ne buyurursunuz?' diye sordu. Allah Resulü bir müddet baktı. Sonra vahiy geldi. Hz. Ömer, Ya'la'ya 'gel diye işaret etti. Ya'la gelip başını soktu. Bir de ne görsün, Nebi Sallallahu Aleyhi ve Sellem'in yüzü kıpkırmızı kesilmiş. Bir müddet de horlar gibi ses çıkardı. (Vahiy tamamlanıp) rahata kavuşunca: 'Biraz önce umre hakkında soru yöne/ten nerede?' diye sordu. Bunun üzerine adam arandı ve Allah Resulünün huzuruna çıkarıldı. Nebi Sallallahu Aleyhi ve Sellem ona şöyle dedi: Üzerindeki kokuyu üç kez yıka! Cübbeni ise çıkart! Daha sonra hacda ne yapıyorsan, umre yaparken de onu yap!\" Bu hadisin şerhi \"Kitabu'l-Hac'da geçti",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 4986,
			"arabicnumber": 4986,
			"text": "Zeyd İbn Sabit'ten şöyle söylediği nakledilmiştir: \"Hz. Ebu Bekir Yemame'de kurra' (Kur'an hafız) ların öldürülmesinin ardından haber yollayıp beni çağırttı. Yanına vardığım zaman, Ömer'in orada bulunduğunu fark ettim. Ebu Bekir dedi ki: Ömer bana gelip 'Yemame savaşında Kur'an hafızlarından önemli bir kısmı şehid oldu. Ben diğer savaşlarda da, hafızların ağır zayiat vermesinden ve Kur'an'ın bir çok kısmının kaybolmasından endişe ediyorum. Bu yüzden Kur'an'ın toplanmasını emretmen gerektiğini düşünüyorum' dedi. Ona 'Nebi Sallallahu Aleyhi ve Sellem'in yapmadığı bir şeyi nasıl yaparız?' diye itiraz ettim. Ömer, 'Allah'a yemin ederim ki, bu hayırlı bir iştir' dedi. Israrla benden böyle bir şey yapmamı istedi. Nihayet Allah Teala aklıma bu işi yatırdı. Ben de Ömer gibi düşünür oldum.\" Zeyd olayı anlatmaya şöyle devam etti: \"Ebu Bekir bana: 'Sen genç ve akıllı birisin. Bu güne kadar senin bir eksikliğini gören ve seni bir konuda itham eden olmadı. Nebi Sallallahu Aleyhi ve Sellem. için vahyi yazıyordun. O halde, Kur'an'ı araştırıp topla!' dedi. Allah'a yemin ederim ki, beni dağlardan birini taşımakla sorumlu tutsaydı, bu, bana emrettiği Kur'an'ı toplama görevinden daha ağır olmazdı. Ebu Bekir'e 'Allah Resulünün yapmadığı birşeyi sizler nasıl yaparsınız' diyerek itiraz ettim. O da 'Allah'a and olsun ki, bu hayırlı bir iştir' dedi. Ebu Bekir beni ikna etmek için ısrarlarını sürdürdü. Nihayet, Allah Teala Ebu Bekir ve Ömer'in aklına yatanı, benim de aklıma yatırdı. Sonunda Kur'an'ı bir araya getirmek için o güne kadar hurma dallarında, yassı taşlar üzerinde yazılı olanları ve hafızların hafızalarında bulunanları toplamaya başladım. \"Andalsun size kendinizden öyle bir Nebi gelmiştir ki, sizin sıkıntıya uğramanzz ona çok ağır gelir, \"(Tevbe 128) ayetinden itibaren Tevbe suresinin sonuna kadar olan (iki ayetlik) kısmı sadece Ebu Huzeyme el-Ensarı'nin yanında buldum. Onun dışında başka birinde bulamadım. Toplayıp yazdığım ve bir araya getirdiğim sahifeleri Halife Ebu Bekr'e teslim ettim. Bunlar, vefat edinceye kadar Ebu Bekir'in yanında kaldı. Sonra Ömer Halife olunca o teslim aldı ve hayatı boyunca onda kaldı. Daha sonra bu mushaf, Ömer'in kızı Hafsa'ya geçti",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 4987,
			"arabicnumber": 4987,
			"text": "Enes İbn Malik'in rivayet ettiğine göre; \"Huzeyfe İbn Yeman Hz. Osman'ın huzuruna çıktı. Ermenistan ve Azerbaycan'ın fethi sırasında Iraklılarla birlikte Şamlılarla tartışmıştı. İki tarafın kıraatler konusunda ihtilafa düşmesi Huzeyfe'yi endişelendirmişti. Bu yüzden Hz. Osman'a: 'Ey mu'minlerin Emiri! Yahudi ve Hıristiyanların ihtilafı gibi, Kitap hakkında ihtilafa düşmeden önce ümmet için tedbir al!' dedi. Bunun üzerine Hz. Osman, Hafsa'ya haber gönderdi ve 'Mushafı bize gönder, onu çoğaltıp tekrar sana iade edelim' dedi. Hafsa, mushafı Hz. Osman'a gönderdi. O da, Zeyd İbn Sabit, Abdullah İbnu'z-ZUbeyr, Saıd İbnu'ı-As ve Abdurrahman İbnu'l-Haris İbn Hişam'a Kur'an' nüshalarının çoğaltılmasını emretti. Komisyonun üç Kureyşli üyesine şöyle tenbih etti: Siz, Zeyd İbn Sabit ile herhangi bir ayetin yazımı konusunda ayrılığa düşerseniz, onu Kureyş lehçesiyle yazın! Çünkü Kur'an onların diliyle indi. Üyeler de bu talimatı yerine getirdi. Sonunda Mushafı çoğalttılar. Hz. Osman da, ana mushafı Hafsa'ya geri verdi. Daha sonra çoğalttıkları Mushaflardan her tarafa birer tane gönderdi. Bunun dışında sahifelerde yazılı bulunan veya Mushaf şeklinde yazılmış olan Kur'anların yakılmasını emretti",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 4988,
			"arabicnumber": 4988,
			"text": "Harice İbn Zeyd İbn Sabit şöyle söylerken işittiğini rivayet etmiştir: \"Mushafı çoğaltırken Ahzab suresinden bir ayeti bulamadım. Oysa Nebi Sallallahu Aleyhi ve Sellem'in O ayeti okuduğu işitmiştim. Bu yüzden onu aradık. Nihayet o ayeti ensardan Huzeyme İbn Sabit'in yanında bulduk. (Söz konusu ayet şuydu:) \"Mu'minler içinde Allah'a verdikleri sözde duran nice erler var ... \"(Ahzab 23) Sonra bu ayeti, geçtiği surenin içine koyup Mushafa ilave ettik.\" Fethu'l-Bari Açıklaması: Yemame hadisesi ile, Müseylimetü'l-kezzab'la yapılan savaşta sahabilerin öldürülmesi kast edilir. Söz konusu savaş şu şekilde ortaya çıkmıştı: Müseylime Nebilik iddiasında bulunmuştu. Bir çokArap'ın irtidat etmesi ile Hz. Nebi'in sallalIa.hu aleyhi ve sellem vefatından sonra güç kazanmıştı. Bu yüzden Hz. Ebu Bekir Halid ibn Velid kumandasında birçok sahabeyi onunla savaşmak üzere Yemame'ye göndermişti. Ashabı kiram Müseylime'nin adamlarıyla çetin bir savaşa tutuştular. Neticede Allah Teala onun mağlup olmasını diledi ve Müseylime öldürüldü. Ancak bu savaş sırasında 700'e yakın, hatta bazılarına göre daha fazla sahabi de şehit düştü. Yukarıda Süfyan İbn Uyeyne'den nakledilen hadiste Hz. Ömer'in kast ettiği karilerden Ebu Huzeyfe'nin mevlası Salim'in adı zikredilerek öldürüldüğü bildirilmiştir. Rivayet şu şekildedir: \"Ebu Huzeyfe'nin mevlası Salim öldürülünce J-k DmfI J$llIl1n}n Jşııyb9JllfDğ; f.J)9jg.9jJ)g J5apJJrlJ, Bu ylizrlı;:J) Hz_ .Ebu Bekir'in yanına gitti.\" Salim'in, Hz. Nebi'in Sallallahu Aleyhi ve Sellem kendisinden Kur'an öğrenilmesini emrettiği bir sahabi olduğu ileride gelecektir. \"Ben diğer savaşlarda da\" ifadesi \"diğer yerlerde kafirlerle yapılan savaşlarda da\" manasına gelir. Hattabi ve diğerleri şöyle demiştir: \"Muhtemelen Allah Resulü Sallallahu Aleyhi ve Sellem, bazı ayetlerin hükmünü veya tilavetini neshedecek bir vahiy beklentisi içinde olduğu için Kur'an'ı bir kitapta toplamamıştı. Vefatından sonra vahiy kesilince, Allah Teala, raşit halifelere Kur'an'ı bir kitapta toplama düşüncesini ilham etti. Böylece Muhammed ümmeti (Allah şerefini artırsın) için garanti ettiği koruma vaadini gerçekleştirdi. Kur'an'ı toplama faaliyeti Hz. Ömer'in istişaresi sayesinde Hz. Ebu Bekir tarafından başlatılmıştır. Rafizilerden bazıları, Hz. Ebu Bekir'in Kur'an ayetlerini bir mushafta toplama faaliyetine itiraz etmeyi bir meziyet olarak telakki etmiştir: \"O, Rasululah Sallallahu Aleyhi ve Sellem'in yapmadığı bir şeyi nasıl yapar,\" diyerek bu faaliyeti karalamak istemişlerdir. Onlara şu şekilde cevap verilir: Hz. Ebu Bekir, ancak Allah'a, Kitab'ına, Nebiine, Müslümanların ileri gelenlerine ve halka olan samimiyetinden kaynaklanan idihadından hareketle Kur'an'ı toplamıştır. Hz. Nebi sallaııahu aleyhi ve sellem Kur'an'ın yazılmasına müsaade etmiş, onunla birlikte başka bir sözün yazılmasını ise yasaklamıştır. Hz. Ebu Bekir ise, ancak yazılı olan bir vahyin tekrar yazılmasını emretmiştir. Bundan dolayı Zeyd, Tevbe suresinin son kısmında bulunan ayeti yazılı buluncaya kadar onu Mushaf'a yazmaktan geri durdu. Oysa o ve daha başkaları bu ayeti hatırlıyor ve biliyordu. İmam Buhari Ebu Bekir'in bu hizmetini düşününce bunun, onunu faziletlerinden sayılması gerektiğine kesin kanaat getirdi ve onun yüce deQerine dikkat çekti. Çünkü Hz. Nebi Sallallahu Aleyhi ve Sellem şöyle buyrumuştur: \"Kim iyi bir iş baş/atırsa, yaptığı bu işin sevabın! ve bu işi yapacak/arın sevabının [bir benzerini] de alır.\" Hz. Ebu Bekir, kıyamete kadar kendisinden sonra Kur'an'ı bir araya getiren herkesin sevabının bir benzerini alır. Bu rivayette Hz. Ebu Bekir, Zeyd'in dört özelliğini zikretmiştir: a) Genç Olması: Zeyd, genç olduğu için kendisine verilen görevi rahatça yapabilirdi. b)Akıllı Olması: Verilen görevin künhüne vakıf olup layıkı vechile yapardı. c) İtham Edilmemesi: Herhangi bir kötülükle itham edilmemesi, insanların güvenini kazanması için son derece önemliydi. d) Vahiy Katibi Olması: En fazla vahiy yazan katip idi. Zeyd'de toplanan bu özellikler, başkalarında da vardı. Ancak hepsini bir arada başka bir şahısta bulmak mümkün değildi. ......Usub kelimesi, I/as!b kelimesinin çoğuludur ve hurma dalı anlamına gelir. Araplar hurma dallarının kabuğunu sayarak geriye kalan geniş kısma yazı yazarlardı. Zeyd, söz konusu ayeti yazılı olarak Ebu Huzeyme'nin dışında başka birinin yanında bulamamıştır. Çünkü daha önce de ifade ettiğimiz gibi, Kur'an'ı toplarken yazı olmadan sadece ezbere itibar etmiyordu. O vakit bu ayeti sadece onun yanında bulması, bu ayetin Hz. Nebi'den başkasından bu ayeti öğrenenlerin nezdinde mütevatir hale gelmediği anlamına gelmez. Çünkü Zeyd, vasıtasiZ olarak Hz. Nebi'den Kur'an öğrenenleri araştırıp onlardan ayetleri topluyordu. Zeyd bu ayeti Ebu Huzeyme'nin yanında bulunca, muhtemelen diğer sahabiler bu ayeti hatırlamıştır. Nitekim Zeyd'in kendisi de hatırlamıştı. Bu şekildeki bir araştırmanın faydası, Hz. Nebi'in Sallallahu Aleyhi ve Sellem huzurunda ezberlenen ve yazılan ayetleri tespit etmedeki hassasiyeti gösterir. Toplanan Kur'an Hz. Ömer'in hilafetinden sonra Hz. Osman döneminde Hz. Hafsa validemizin yanında kaldı. Hz. Osman'ın istinsah faaliyetine kadar da kalmaya devam etti. Çünkü Mushaf'ın onun yanında kalmasını Hz. Ömer vasiyet etmişti. Bu yüzden kendisinden istenilen zamana kadar, Mushafı muhafaza etmeye devam etti. Hz. Osman'ın sahabilerle istişare ettikten sonra Kur'an'ı çoğalttığı nakledilmiştir. İbn Ebi DavO.d sahih bir senetle Süveyd İbn Gafle'den şu rivayeti aktarmıştır: \"Hz. Ali dedi ki: Osman hakkında ancak iyi sözler sarfedin! Allah'a and olsun ki o, bizden ileri gelenlerle istişare ettikten sonra Mushafları çoğaltmıştı. Bize, 'Kur'an'ın bu şekilde okunması hakkında ne düşünüyorsunuz? Bana anlattıklarına göre, 'bazıları benim kıraatım senin kıraatından daha hayırlıdır' diyor. Bu durum neredeyse küfre neden olacak' dedi. Biz de 'peki ne düşünüyorsunuz?' diye sorduk. Bunun üzerine 'ihtilaf ve ayrılık olmaması için insanları Mushaf etrafında birleştirmek istiyorum' dedi. Biz de 'ne kadar da güzel düşünmüşsün' şeklinde karşılık verdik.\" \"Daha sonra her tarafa çoğalttıkları Mushaflardan birer tane gönderdi.\" ifadesi Şuayb'dan nakledilen rivayette şu şekilde aktarılmıştır: \"Hz. Osman, Müslüman ordularından her birine bir Mushaf gönderdi.\" - Hz. Osman'ın çoğaltıp çeşitli bölgelere gönderdiği Mushaf'ların sayısı hakkında ihtilaf edilmiştir. Ancak meşhur olan görüşe göre, bunlar beş tanedir. İbn Battal şöyle demiştir: \"Bu hadise göre, içerisinde Allah'ın ismi bulunan kitapların yakılması caizdir. Yakmak, bu kitaplara değer verildiğini gösterir. Ayrıca ayak altında kalmasına engelolur. Abdurrezzak TavO.s'un besmele ile başlayan mektupları yaktığını nakletmiştir. Aynı şekilde Urve'nin de böyle yaptığı nakledilmiştir. İbnu't-TIn ve diğerleri şöyle demişlerdir: \"Hz. Ebu Bekir'in cem'i ile Hz. Osman'ın cem'i arasında fark vardır. Hz. Ebu Bekir hafızların ölmesiyle, Kur'an ayetlerinden bazılarının kaybolmasından endişe ettiği için onu toplatmıştı. Çünkü Kur'an'ın tamamı bir yerde derli toplu bulunmuyordu. Bu yüzden Hz. Nebi'in salla11ahu a1eyhi ve sellem öğrettiği şekilde sure ve ayetleri sıralanmış olarak Kur'an'ı toplattı' Hz. Osman ise, ashabı kiramın, sahip oldukları çok değişik lehçelere göre Kur'an'ı farklı farklı okumaya başlamalarıyla ortaya çıkan ihtilafların çoğalması sonucu Kur'an'ı cem ettirmiştir. Çünkü insanların farklı kıraatlere göre Kur'an okumaları, birbirlerini hata ile suçlamalarına neden olmuştu. Hz. Osman bu durumun çok ciddi bir boyuta ulaşmasından endişe duymuştu. Bu nedenle Kur'an'ın yazılı bulunduğu sayfaları bir mu sh afta toplayarak çoğaitmıştır",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 4989,
			"arabicnumber": 4989,
			"text": "İbnu's-Sebbak'tan şöyle dediği rivayet edilmiştir: \"Zeyd İbn Sabit şöyle dedi: Ebu Bekir haber gönderip beni çağırttı. Yanına varınca 'sen, Allah Restılü Sallallahu Aleyhi ve Sellem için vahiy yazıyordun. o halde Kur'an'ı araştır' dedi. Ben de Kur'an'ı araştırmaya koyuldum. Tevbe suresinin son iki ayetini Ebu Huzeyme el-Ensarı'nin yanında buldum. Onun dışında başka birinin yanında bu ayetleri bulamadım. Söz konusu iki ayet şunlardı: And olsun size, kendinizden öyle bir Nebi gelmiştir ki, sizin sıkıntıya uğramanız ona çok ağır gelir. 0, size çok . düşkün, mu'minlere karşı çok şefkatlidir, merhametlidir. (Ey Muhammed!) Yüz çevirirlerse de ki: Allah bana yeter. O'ndan başka ilah yoktur. Ben sadece O'na güvenip dayınınm. O yüce arşın sahibidir. \"(Tevbe 128-129)",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 4990,
			"arabicnumber": 4990,
			"text": "Bera'dan rivayet edildiğine göre, o şöyle demiştir: \"Mu'minIerden oturanlarla, Allah yolunda cihad edenler bir 0lmaz\"(Nısa 95) ayeti nazil olunca Allah Resulü Sallallahu Aleyhi ve Sellem: \"Bana Zeyd'i çağırın, levha, mürekkep ve kürek kemiği getirsin veya kürek kemiği ile mürekkep getirsin,\" dedi. Sonra ona şöyle emretti: \"Yaz, 'mu'minIerden ... \" Bu esnada Allah Resulü'nün Sallallahu Aleyhi ve Sellem arkasında ama İbn İbn Ümmi MektCım vardı. (Ayeti duyunca) \"Ya Resulallah! Sallallahu Aleyhi ve Sellem Bana ne emredersiniz? Zira ben gözleri görmeyen bir adamım,\" dedi. Bunun üzerine yukarıdaki ayet şu şekilde nazil oldu: \"mu'minierden özür sahibi olanlar dışında, oturanlarla mallan ve canlanyla Allah yolunda cihad edenler bir olmaz.\"(Nısa 95) Fethu'l-Bari Açıklaması: Zeyd İbn Sabit dışında bir çok kimse Hz. Nebi Sallallahu Aleyhi ve Sellem için vahyi yazmıştır. Mekke'de inen ayetlerin tamamını Zeyd'in dışındaki vahiy katipleri yazmıştır. Çünkü o, ancak hicretten sonra Müslüman olmuştu. Medine'de inen ayetlerin ise çoğunu o yazmıştı. Bu yüzden ona el-Katib den me ye başlanmıştı. Onun için kullanılan Kll/el-Katib lakabının başındaki harf-i tarif ahd içindir. Nitekim bu konuda ikinci hadis olarak Bera'dan gelen rivayette de onun vahiy katipliği yaptığı görülmektedir. Bundan dolayı Ebu Bekir ona \"sen Hz. Nebi Sallallahu Aleyhi ve Sellem için vahyi yazıyordun,\" demiştir. Zeyd, vahiy geldiği zaman bazen hazır bulunmuyor olabilirdi. İşte bu yüzden onun dışındakilerde vahyi yazmıştır. Zeyd'den önce de Hz. Nebi için Ubeyy İbn Ka'b vahiy yazmıştır. Ubeyy, Medine'de Allah Resulü Sallallahu Aleyhi ve Sellem için vahiy yazan ilk katiptir. Mekke'de ise ilk vahiy katibi, Kureyş kabilesinden Abdullah İbn Sa'd İbn Ebi Serh'tir. Daha sonra bu zat irtidat etmiş, Mekke'nin fethi esnasında tekrar Müslüman olmuştur. Hz. Nebi Sallallahu Aleyhi ve Sellem için vahiy yazan katipleri şu şekilde sıralayabiliriz: 1- Dört Halife 2- ZUbeyr İbn Avam 3- Said İbn eı-As İbn Ümeyye'nin iki oğlu Eban ve Halid 4- Hanıala İbn Rabi' el-Esedi 5- Muayklb İbn Ebı Fatıma 6- Abdullah İbn el-Erkam ez-Zührı 7- Şurahbll İbn Hasene 8- Abdullah İbn Ravaha",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 4991,
			"arabicnumber": 4991,
			"text": "İbn Abbas r.a.'dan şöyle söylediği rivayet edilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Cebrail A.S. Kur'an'ı bana bir harf üzere okuttu. Ona dönüp bunu arttırmasını istedim. Ben artırma isteğimi yenileyip durdum. O da arttırdı. Nihayet yedi harfle tamamlandı",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 4992,
			"arabicnumber": 4992,
			"text": "Ömer (bin el-Hattab)'den şöyle söylediği rivayet edilmiştir: \"Resulullah Sallallahu Aleyhi ve Sellem henüz hayatta iken Hişam İbn Hakim'in Furkan suresini okuduğunu işittim. Bir müddet okuyuşuna kulak verdim. Birden onun, Nebi Sallallahu Aleyhi ve Sellem'in bana okutmadığı birçok harf üzerine Kur'an'ı okuduğunu fark ettim. Namazda iken yakasına yapışmaktan kendimi zor tuttum. Selam verinceye kadar güçlükle sabrettim. Sonra ridasından yakalayıp 'Senden dinlediğim bu sureyi sana kim öğretti?' diye sordum. 'Bana bunu Allah Resıılü Sallallahu Aleyhi ve Sellem öğretti' diye cevap verdi. 'Yalan söylüyorsun! Zira Resulullah Sallallahu Aleyhi ve Sellem bu sureyi bana, senin okuduğundan farklı öğretti' dedim. Onu alıp Nebi Sallallahu Aleyhi ve Sellem'e götürdüm. Ona: 'Bu adamı, Furkan suresini sizirı bana öğrettiğinizden farklı bir harf üzere okurken işittim' diye şikayet ettim. Allah Resulü Sallallahu Aleyhi ve Sellem: 'O nu bırak' dedi. Sonra ona 'Ey Hişam! Oku bakayım' dedi. O da kendisinden işittiğim şekilde okudu. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem, 'Bu sure bu şekilde indi' buyurdu. Sonra bana 'Ey Ömer! Sen oku bakayım!' dedi. Ben de bana öğrettiği şekilde okudum. Yine Hz. Nebi sallaııahu a1eyhi ve sellem, 'Bu sure bu şeklide nazil oldu' dedi ve şöyle ekledi: Bu Kur'an yedi harf üzerine nazil oldu. Hangisi kolayımza geliyorsa onu okuyun!\" Diğer tahric edenler: Tirmizi Kraat; Müslim, Salat-ül Müsafirin Fethu'l-Bari Açıklaması: Kur'an yedi vecih üzere nazil olmuştur. Kur'an'ı, bu vecihlerin her biriyle okumak caizdir. Ancak bu hadis, Kur'an'ın her bir kelimesinin, her bir cümlesinin yedi vecih üzere indiği anlamına gelmez. Aksine bununla bir kelime hakkında varid olan kıraat sayısının yediyi bulduğu kast edilmiştir. Hadiste geçen yediden maksadın, hakiki manada yedi olmadığı söylenmiştir. Bununla kolaylığın kast edildiği ileri sürülmüştür. Yedi lafzı, tek rakamlı sayı;:,larda çokluğu ifade etmek için kullanılır. Benzer şekilde yetmiş lafzı onlu sayılarda, yediyüz rakamı da yüzlü sayılarda çokluğu ifade etmek için söylenir. Yani bu lafızlarla muayyen bir sayı kast edilmez. Kadi İyad ve ona tabi olanlar bu görüşü benimsemişlerdir. Hicazlılar hata yaptın yerine, yalan söylüyorsun derler. \"Hangisi kolayımza geliyorsa, onu okuyun!\" ifadesi, \"nazil olan harflerden hangisi kolayınıza geliyorsa, onu okuyun\" manasına gelir. Hadisin bu kısmında, Kur'an'ın yedi harf üzere nazil olmasının hikmetine işaret edilmiştir. Bunun okuyucu için kolaylık olduğu belirtilmiştir. Bu da, yedi harften maksadın aynı lehçe içinde olsa bile Kur'anı manaları müteradif (eşanlamlı) lafızlarla ifade etmek olduğunu iddia edenlerin görüşünü desteklemektedir. Çünkü Hişam, Kureyş lehçesini kullanıyordu. Aynı şeklide Hz. Ömer de bu lehçeyi kullanıyordu. Buna rağmen ikisinin kıraati de farklılık göstermiştir. Bu hususa İbn Abdilberr dikkat çekmiştir. O, ilim ehlinin çoğundan, yedi harften maksadın bu olduğu görüşünü nakletmiştir. Ebu Ubeyd ve diğerleri ise yedi harften maksadın, farklı lehçeler olduğunu ileri sürmüştür. İbn Atıyye de bunu tercih etmiştir. Ancak Arapların yediden fazla lehçeye sahip olduğu belirtilerek bu görüşe itiraz edilmiştir. Cevap olarak ise, fasih olanların sayısının yedi olduğu söylenmiştir. Ebu Şame bir alimin şöyle dediğini nakletmiştir: \"Kur'an önce, Kureyş ve onlara komşu olan fasih Arapların lehçesi üzerine nazil oldu. Daha sonra Arapların keni lehçeleriyle Kur'an okumalarına müsaade edildi. Söz konusu bu lehçeler arasında ise, lafız ve i'rab farklılıkları mevcuttu.\" Kanaatime göre bu söz şu şekilde tamamlanır: Bu müsaade insanların arzusuna bırakılmamıştır. Yani herkes kendi kafasına göre Kur'an kelimelerini kendi lehçesindeki müteradif lafızlarla değiştirmiyordu. Aksine bu konuda, Hz. Nebi'den Sallallahu Aleyhi ve Sellem işitme dikkate alınıyordu. Nitekim bu konuda zikredilen hadiste hem Hz. Ömer'.in, hem de Hişam'ın 'bana bunu Allah Resulü Sallallahu Aleyhi ve Sellem öğretti' demesi buna işaret eder. İbn Kuteybe (ö. 276) \"Müşkilu'I-Kur'an\" adlı kitabının baş tarafında şöyle der: \"Allah'ın, Resulullah'a Sallallahu Aleyhi ve Sellem Kur'an'ı her kavmin kendi lehçesine göre okumasını emretmesi, bu ümmete gösterdiği kolaylıklardan biridir. Bu sayede Hüzeyl kabilesine mensup biri .......hatta hıne ifadesini .........atta hıne şeklinde, Esed kabilesine mensup biri, kelimesini ilk harfin harekesini kesralı olarak (tı'lemo.ne şeklinde), Temım kabilesine mensup olan biri, hemzeli, Kureyşliler hemzesiz okuyabilmektedir. Eğer Allah Teala her kabilenin kendi lehçesinden vazgeçmesini, çocukken, gençken ve yetişkinken kullandıkları lehçelerini bir kenara itmelerini isteseydi, insanlar için bu son derece güç olurdu. Bu yüzden lütfu ile onlara kolaylık sağladı.\" İbn Kuteybe ve daha başkaları, hadiste bahsi geçen rakamı şu yedi hususta meydana gelen farklı vecihlere hamletmişlerdir: 1- Sureti ve manası değişmeden harekesi değişen vecih. ...........Vela yudarra katibun ve la şehid ayeti buna örnek olarak verilebilir. Bu ayette geçen .........ve la yudarru kelimesindeki jra harfi hem mansup,soo hem de merfu olarak okunmuştur. 2- Fiilin değişmesi ile değişen vecih. li.)l.4.....t /Baid beyne esfarina ayeti buna örnek verilebilir. Buradaki ..lç./baid emir fiil şeklinde okunduğusoı gibi / beude olarak mazi fiil şeklinde de okunmuştur. 3- Noktasız harflere nokta verilmek suretiyle meydana gelen farklı vecih. Mesela, U. /sümme nünşiruha ayeti buna örnek olarak verilebilir. Bu ayette /nünşir kelimesinin son harfi hem noktasız (.;Ira), hem de noktalı (jIze) şeklindes02 okunmuştur. 4- Mahreç bakımından birbirine yakın olan harflerin değişmesiyle meydana gelen vecih ......... ve talhun mendud ayeti, Hz. Ali'den nakledilen kıraate göre .........ve tal'un mendud şeklinde okunmuştur. 5- Takdim ve tehirle meydana gelen değişiklik ile oluşan vecih. ........ve caet sekratül-mevti bi'l hakkı ayeti, Ebu Bekir, Talha İbn Musamf ve Zeynu'l-abidın kıraatine göre ...........ve caet sekratü'l-hakkı bi'l-mevti şeklinde okunmuştur. 6- Ziyade ve eksiklik bulunmasıyla farklılık arz eden vecih. Kitabu't-tefsır'de İbn Mes'ud ve Ebu'd-Oerda'dan nakledilen rivayet buna örnek olabilir. Nitekim eksik kıraate göre Leyl suresinin ilk üç ayeti, ............ve'I-leyli iza yağşa ve'n-nehari iza tecella ve'z-zekeri ve'l-ünsa şeklinde okunmuştur. Fazlalık olan kıraate göre ise, .......tebbet yeda ebi Leheb suresinin tefsiri yapılırken İbn Abbas'tan nakleailen şu kıraat örnek olarak verilebilir: ............ Ne enzir aşırateke'l-akrabın ve rahdake minhumu'l- muhlesln. 7 - Bir kelimenin eşanlamlısıyla değiştirilmesi şeklinde meydana gelen vecih. Mesela ........Kel-İhni'l-menfuş ayeti, İbn Mes'ud ve Saıd İbn Cübeyr kıraatine göre ı.f i J ........es-slifi'l-menfı1ş şeklinde okunmuştur. ......teYbe'nin (ö. 276) bu izahı gayet güzeldir. Kur'an'ın nazif olduğu yedi harfin tamamı şu an Müslümanların elinde bulunan mushaflarda mevcut mudur? Yoksa bundan sadece bir harf mi kalmıştır? İşte bu konuda selef alimleri farklı yorumlar yapmışlardır.. İbnu'l-Bakıllanı yedi harfi n de mevcut olduğu görüşünü benimsemeye meyletmiştir. Taberı ve bir grup alim sadece bir harfin mevcut olduğunu açık bir dille ifade etmiştir. İtimada şayan görüş de budur .. Ebu'l-Fadl er-Razı \"el-Levaih\" adlı eserinde şöyle demiştir: \"Eğer kıraat imamlarından biri bazı harfleri tercih etse, kıraat konusunda da tercihte bulunmak şartıyla yeni bir çığır açsa, yedi harfin dışına çıkmış olmaz.\" Kevaşı de şöyle demiştir: \"Senedi sahih, Arapçaya uygunluğu tam ve hattı da imam mushafına muvafık olan bütün kıraatler, nasla sabit olmuş yedi har- . fin içinde yer alır. Buna binaen sayıları ister yedi olsun,ister yedi bin, kurra'ın kıraatleri bu kriterlere göre kabul edilir. Bu üç kriterden birini taşımayan kıraat, şazdır.\" Son asırlarda meşhur kıraatlerin \"Teysir\", \"Şatıbiyye\" gibi kıraat kitaplarında toplandığı vehminin canlılığını koruması bu konudaki görüşlerin genişlemesine neden olmuştur. Hz. Nebi'in Sallallahu Aleyhi ve Sellem \"Hangisi kolayınıza geliyorsa onu okuyun!\" sözünü, yukarıda bahsi geçen şartları taşıyan okuyuş şekilleriyle Kur'an ayetlerinin okunabileceğine delil olarak getirmişlerdir. Bu şartlar mutlaka dikkate alınmalıdır. Bunlardan herhangi birinin bulunmadığı kıraatler Kur'an olarak kabul edilmez. Nitekim Ebu Şame \"el-Vecfz\" adlı kitabında bu konuyu gayet güzel açıklamıştır: \"Bir kıratın, Allah katından nazil olduğu ancak şu şekilde kesinlik kazanır: a) Bulunduğu bölgenin kıraat imamlığını yapan kariden birbiriyle ittifak halinde olan tariklerle nakledilmiş olacak. b) İmamın muasırları ile daha sonraki dönemlerde gelenler onun kıraatler hususunda imam olduğu konusunda icma' edecek.\" Daha sonra Ebu Şame şöyle demiştir: \"Bir imamdan nakledilen-tarikler farklılık arz ederse, bu durumda kıraatlerin Kur'an olduğu söylenem& Eğer bir ayet yukarıda belirttiğimiz şartları taşıyan birbirinden farklı birçok kıraatı içeriyorsa, mananın bozulmaması ve i'rabın değişmemesi şartıyla bu kıraa\\ıer okunabilir.\" Ebu Şame \"el-Vecfz\" adlı eserinde şöyle bir olaydan bahsetmektedir: \"Anadi- li Arapça olmayan gençler Şam'a gelip kıraatleri birbirine karıştırarak Kur'an'dan aşır okuyan birinin durumunu sordu. Bu soruya İbnu'l-Hacib, İbnu's-Salah ve dönemin diğer alimleri okunan kıraatlerin yukarıdaki şartları taşıması kaydıyla bunun caiz olduğunu belirterek cevap vermiştir. Ancak kişi, ............fetelekka Ademu min Rabbihı kelimat ayetini (Bakara 58) İbn Kesir kıratma göre .......Adem kelimesinin nasbı, Ebu Amr kıratma göre de ......... kelimat kelimesinin nasbı ile okuyamaz. Benzer şekilde ........... .neğfir leküm hatayatiküm ayetinde (A'raf 161) plgafera fiilini muzari mütekellim cemi sigasıyla ......neğfiru şeklinde, .........hatayaküm kelimesini de merfu' olarak okuyamaz.\" ... \"Bu tür kıraatleri haram olduğu hususunda hiç şüphe yoktur. Bunun dışmdaki okumalar ise caizdir. Doğrusunu en iyi Allah bilir. Günümüzde karilerden öyle bir grup ortaya çıktı ki, bunlar bu tür okumaları inkar etmektedirler. Hatta onlardan biri açıkça bu şekilde okumanm haram olduğunu söylemiştir. Fakihlerin çoğu onları bu sahada otorite kabul edip onlara tabi olmuş ve kendilerini 'her fennin alimi o fenni diğerlerinden daha iyi bilir' diyerek savunmuşlardır. Ancak bunun haram olduğunu söyleyenler yanılmışlardır. Kaldı ki, neyin haram, neyin helal olduğu fakihlerden öğrenilir. Karilerin bu tür okuyuşu yasaklamaları şu şekilde izah edilir: O kişi belli bir rivayet üzerine Kur'an okuyordur. Eğer bu rivayete başka bir rivayeti karıştırırsa, o kendisinden kıraat öğrenip sonra da onun kıratını öğretmeye başladığı raviye yalan isnat etmiş olur. Kim bir kıraati okutuyorsa, onu bırakıp başka bir rivayete geçmesi iyi olmaz. Nitekim Şeyh Muhyiddin de böyle söylemiştir. Tabii geçmemesi eweliyetle ilgilidir, kesinlikle geçmemeli denemez. Bunun herhalukarda yasaklanması ise asla doğru değildir. Doğrusunu en iyi Allah bilir",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 4993,
			"arabicnumber": 4993,
			"text": "Yusuf İbn Mahek'ten şöyle söylediği rivayet edilmiştir: \"Ben mu'minlerin annesi Aişe r.anha'nın yanındayken Iraklı birisi geldi. Ona 'hangi kefen daha hayırlıdır?' diye sordu. Hz. Aişe: 'Zavallı adam, nasıl kefenlenirsen kefenlen, bunun sana bir zararı olur mu?' diye karşılık verdi. Adam bu defa 'ey mu'minlerin annesi bana mushafını göster' dedi. Hz. Aişe: 'Neden?' diye sorunca şöyle dedi: Bendeki Kur'an'ı ona göre telif etmeye çalışayım. Çünkü o, okunuyorken harfleri aynilik arzetmiyor .. Bunun üzerine Hz. Aişe: 'Ha öyle okumuşsun ha böyle, sana bir zararı var mı?' diye karşılık verdi ve şöyle devam etti: İlk olarak Kur'an'dan Cennet ve Cehennemin işlendiği bir sure nazil oldu. Ne zaman ki, insanlar İslam'a girmeye başladı, haram ve helale ilişkin ayetler indi. Eğer ilk olarak 'şarap içmeyin!' diye bir ayet inseydi, insanlar 'asla şarabı bırakmayız' diyerek karşı çıkarlardı. Eğer ilk olarak 'zina etmeyin!' diye bir ayet inseydi, 'asla zinayı bırakmayız' diyerek İslam'a yanaşmazlardı. Mekke'de ben daha oyun oynayan bir çocukken Nebi Sallallahu Aleyhi ve Sellem'e 'Bilakis kıyamet, onlara va'ad edilen asıl saattir. Ve o saat, daha belalı ve daha acıdır' (Kamer 46) ayeti nazil oldu. Bakara ve Nisa sureleri ise ancak ben onunla evlendikten sonra indi.\" Ravi der ki: \"Sonra Hz. Aişe, mushafını çıkardı ve surelerin ayetlerini adama imla ettirdi",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 4994,
			"arabicnumber": 4994,
			"text": "İbn Mes'ud İsra, Kehf, Meryem, Taha ve Enbiya sureleri için \"Bu sureler, ilk inenlerdendir, ilk başta nazil olan Kur'an pasajlarıdır,\" demiştir",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 4995,
			"arabicnumber": 4995,
			"text": "Bera'dan şöyle dediği nakledilmiştir: سبح اسم ربك الأعلى Sebbihisme rabbike'l-a'la,,(Aıa suresini) Resulullah Sallallahu Aleyhi ve Sellem Medine ye gelmeden önce öğrendim",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 4996,
			"arabicnumber": 4996,
			"text": "Şakik'ten rivayet edildiği ne göre, Abdullah [İbn Mes'ud]'dan şöyle nakledilmiştir: \"Allah Resulü Sallallahu Aleyhi ve Sellem'in her rekatta ikişer ikişer okuduğu birbirine benzer sureleri öğrendim\" dedi. Sonra Abdulluh bulunduğu yerden kalkıp evine gitti. Beraberinde Alkame de vardı. Bir müddet sonra Alkame evden çıktı, ona bu surelerin hangileri olduğunu sorduk. O da şöyle cevap verdi: \"İbn Mes'ud'un mushafına göre mufassal surelerden yirmi sure. Hamimler, Duhan ve Amme bu surelerin sonunda yer alır.\" Fethu'l-Bari Açıklaması: \"Kur'an'ın Tertibi\" başlığı, bir surenin ayetlerinin tertibi manasına gelebileceği gibi surelerin mushaftaki sıralanışı manasına da gelebilir. Hadisin \"Ona 'hangi kefen daha hayırlıdır?' diye sordu. Hz. Aişe 'zavallı adam, kefenlenirsen kefenlen, bunun sana bir zararı olur mu?' diye karşılık verdi.\" ifadesinden şunlar anlaşılmaktadır: Iraklı bu adam öyle anlaşılıyor ki, Semura'dan nakledilen şu merru' hadisi işitmiştir: \"Elbiselerinizden beyaz olanlan giyin. Ölülerinizi de beyaz bezle kefenleyin! Çünkü beyaz daha temiz ve daha güzeldir.\" Tirmizl'ye göre bu hadis sahihtir. Ayrıca Tirmizi İbn Abbas'tan da bunu nakletmiştir. Muhtemelen Iraklı adam bu hadisi duymuş ve bunun doğru olup olmadığını Hz. Aişe'den öğrenmek istemiştir. Malum olduğu üzere Iraklılar sorularıyla ortalığı karıştırmakla meşhur olmuşlardır. Bundan dolayı Hz. Aişe adama \"neyle kefenlenirsen kefenlen, bunun sana bir zararı oiur mu?\" diye karşılık vermiştir. Bu ifadesi hangi kefenle gömülürsen gömül, kefenlenmiş olursun manasına gelir. İbn Ömer'in sivrisineğin kanı hakkında soru soran Iraklıya söylediği şu söz çok meşhurdur: \"Irak halkına bakın! Allah Resıılü'nün Sallallahu Aleyhi ve Sellem torununun kanını akıttıkları halde sivrisineğin kanının hükmünü soruyorlar.\" İbn Battal şöyle demiştir: \"Ne namazda iken, ne de namaz dışında Kur'an okurken surelerin tertibine riayetin farz olduğunu söyleyen bir alim bilmiyorum. Aksine kişinin, Bakara'dan önce Kehf suresini, Kehf'ten önce de Hacc suresini okuması caizdir. Seleften Kur'an'ı tersten okumanın yasaklandığına dair gelen haberler ise, bir surenin ayetlerini sondan başa doğru okumak hakkındadır. Çünkü bazıları ezberlemede aşırı çaba gösterdikleri ve dillerinin, yazdıklarını kolayca telaffuz etmesini sağlamak istedikleri için kasidelerde böyle bir yönteme başvurmuşlardl. İşte selef, bu yöntemin Kur'an'a uygulanmasına karşı çıkmıştır. Kur'an'ın bu şekilde okunması haramdır.\" Kadı iyad Hz. Nebi'in gece namazında N-i İmran suresinden önce Nisa suresini okuduğunu gösteren Huzeyfe hadisini şerhederken şöyle demiştir: \"Ubey İbn Kalb'ın mushafında adı geçen sureler bu şekilde dizilmiştL Ayrıca bu hadiste, surelerin ictihada göre tertip edildiğini söyleyenler için bir delil vardır. Sureler tevkifi olarak dizilmemiştir. Nitekim alimlerin çoğu bu kanaattedir. Kadı el-Bakıllani de bunu tercih etmiştir. O, bu konuda şunları söylemiştir: Kur'an okurken surelerin sırasına riayet etmek farz değildir. Namaz kılarken, ders verirken ve Kur'an öğretirken tertibe riayet gerekli değildir. Zaten bu yüzden sahabelerin Mushafları farklılık arzetmiştir. Hz. Osman mushafı yazılınca, sureleri bugün elimizde bulunan tertibe göre sıraladılar.\" Daha sonra İbn Battal'ın söylediklerine benzer sözler sarfetmiş ve sonra şöyle demiştir: \"Bütün surelerin ayetleri, bu- . gün mushafta bulunduğu sıraya göre Allah'ın buyruğu doğrultusunda diziimiştir. Ayetler tevkifi tertibi bozulmadan Hz. Nebilden günümüze kadar nakledilmiştir. \" Hz. Aişe \"haram ve helale ilişkin ayetler indL\" sözüyle, Kur'an ayetlerinin inişi sırasında gözetilen ilahi hikmete işaret etmiştir. Kur'an-ı Kerim'den ilk önce tevhid inancına çağıran, mu'minleri ve itaat edenleri cennetle müjdeleyip kafir ve isyankarları cehennemle korkutan ayetler indi. İnsanlar bu ilkelere gönülden bağlanınca ahkam ayetleri nazil oldu. Bundan dolayı Hz. Aişe, \"Eğer ilk olarak 'şarap içmeyin!' diye bir ayet inseydi, insanlar 'asla şarabı bırakmayız' diyerek karşı çıkarlardı\" demiştir. Çünkü insan tabiatı, alışkanlıklarını bırakmaktan nefret edecek şekilde yaratılmıştır",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 4997,
			"arabicnumber": 4997,
			"text": "İbn Abbas'tan rivayet edildiğine göre, o şöyle demiştir: \"Nebi Sallallahu Aleyhi ve Sellem insanların en cömerti idi. En fazla da Ramazan ayında cömert olurdu. Çünkü Cebrall A.S. Ramazan ayında her gece ona gelir, gece bitene kadar da gitmezdL Hz. Nebi ona Kur'an'ı arz ederdi. Allah Resulü Sallallahu Aleyhi ve Sellem Cebrall A.S. ile karşılaştığı zaman esen yelden daha cömert olurdu",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 4998,
			"arabicnumber": 4998,
			"text": "Ebu Hureyre r.a.'den şöyle söylediği rivayet edilmiştir: \"Melek Cebrall A.S. her sene bir defa Kur'an'ı Nebi Sallallahu Aleyhi ve Sellem'e arz ederdi. Vefat ettiği sene ise, iki kez arz etti. Allah Resulü Sallallahu Aleyhi ve Sellem her sene on gün itikaf'a girerdi. Vefat ettiği sene ise yirmi gün itikaf'a girmişti.\" Fethu'l-Bari Açıklaması: Bu konuda geçen arz kelimesi okumak anlamına gelir. Meleğin arzından maksat ise, Nebi s.a.v.'e okuttuğu ayetleri, onun kendisine okumasını istemesidir. \"Cebrall a1eyhisselam Ramazan ayında her gece ona gelir\" ifadesi, Resulullah'ın sallallahu a1eyhi ve sellem bahsedilen cömertliğinin hikmetini açıklamaktadır. Hadisten Çıkarılan Sonuçlar 1 - Ramazan mübarek bir aydır. Çünkü Kur'an bu ayda inmeye başlamıştır. Bir de Hz. Nebi'in Cebrall aleyhisselam ile Kur'an'ı gözden geçirmesi bu ayda gerçekleşmiştir. Bu da Cebrall'in aleyhisselam bu ayda daha fazla indiğini gösterir. Onun fazla inmesiyle sayılamayacak kadar çok bereket ve hayır meydana gelir. Bundan bir zamanın faziletinin, o zamanda bolca ibadet etmekle elde edileceği sonucu çıkar. 2- Kur'an okumaya devam etmek, daha fazla hayır işlemeyi gerektirir. 3- Ömrün sonlarına doğru çok ibadet yapmak müstehaptır. 4- Faziletli biri ile ilim ve hayır konuları müzakere edilir. Her ne kadar o kişi bunu bilse de, daha ziyade öğüt alması ve hatırlaması için böyle yapılır",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 4999,
			"arabicnumber": 4999,
			"text": "Mesruk'tan şöyle dediği nakledilmiştir: \"Abdullah İbn Amr, Abdullah İbn Mes'ud'dan bahsetti. Sonra şöyle dedi: Hala onu seviyorum. Çünkü Allah Resulü Sallallahu Aleyhi ve Sellem'i şöyle derken işittim: Kur'an'ı şu dört kişiden öğrenin: Abdullah İbn Mes'ud, Salim, Muaz ve Ubey İbn Ka'b",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 5000,
			"arabicnumber": 5000,
			"text": "Şakik İbn Seleme'den rivayet edildiğine göre, o şöyle demiştir: \"Abdullah İbn Mes'ud bize hutbe okudu ve şöyle dedi: Allah'a and olsun ki, Nebi Sallallahu Aleyhi ve Sellem mubarek dudaklarından yetmiş küsür sure öğrendim. Yine Allah'a yemin olsun ki, Allah Resulü Sallallahu Aleyhi ve Sellem'in ashabı, onların en hayırlısı olmamama rağmen içlerinde Allah'ın kitabını en iyi bilinin ben olduğumu bilirler.\" Şakik şöyle demiştir: \"Halka halka oturan insanların arasına oturdum. Ne söylediklerine kulak verdim. Onun bu sözünü reddeden birini duymadım",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 5001,
			"arabicnumber": 5001,
			"text": "Alkame'den şöyle söylediği nakledilmiştir: \"Biz Hıms'ta idik. İbn Mes'ud Yusuf suresini okudu. Adamın biri çıkıp, 'bu sure bu şekilde nazil olmadı' diye itiraz etti. İbn Mes'ud da şöyle cevap verdi: Ben bu sureyi Nebi Sallallahu Aleyhi ve Sellem'e okudum, bana 'aferin' dedi. Bu esnada İbn Mes'ud adamdan şarap kokusu geldiğini fark etti. Bunun üzerine, 'hem Allah'ın kitabını yalanla, hem de şarap iç, öyle mi!' diye tepki gösterdi. Sonra da adama had cezası uyguladı",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 5002,
			"arabicnumber": 5002,
			"text": "Mesruk'tan şöyle dediği rivayet edilmiştir: \"Abdullah [İbn Mes'ud] şöyle dedi: Kendisinden başka ilah olmayan Allah'a yemin ederim ki, Allah'ın kitabında inen her surenin, mutlaka nerede indiğini bilirim. Her ayetin kimin hakkında indiğini elbette bilirim. Eğer birinin Allah'ın kitabını benden daha iyi bildiğini öğrensem, deveyle gidilecek bir yerde yaşadığını bilsem, kuşkusuz kalkar onun yanına giderim",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 5003,
			"arabicnumber": 5003,
			"text": "Katade'den şöyle dediği rivayet edilmiştir: \"Enes İbn Malik'e Nebi Sallallahu Aleyhi ve Sellem döneminde kimlerin hafız olduğunu sordum. O da şöyle cevap verdi: Dört kişi Kur'an'ı ezberlemişti. Hepsi de ensardandı. Onlar, Ubey İbn Ka'b, Muaz İbn Cebel, Zeyd İbn Sabit ve Ebu Zeyd'dir",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 5004,
			"arabicnumber": 5004,
			"text": "Enes'in şöyle dediği nakledilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem vefat ettiği zaman Kur'an'ı dört kişiden başkası ezberlememişti. Onlar Ebu'd-Derda, Muaz İbn Cebel, Zeyd İbn Sabit ve Ebu Zeyd'dir. Bizler, Kur'an'ı onlardan miras aldık",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 5005,
			"arabicnumber": 5005,
			"text": "İbn Abbas'tan şöyle nakledilmiştir: \"Hz. Ömer şöyle dedi: Ubey içimizde en iyi Kur'an okuyandır. Ancak onun lahnini bir kenara bırakırız. Buna karşın Ubey şöyle demiştir: Ömer'in Lahn dediklerini ben Nebi Sallallahu Aleyhi ve Sellem'den öğrendim. Hiçbir şey için bunları bırakmam. Hz. Ömer de şöyle demiştir: Allah Teala buyurdu ki; Biz, bir ayetin hükümünü yürürlükten kaldırır veya onu unutturursak mutlaka daha iyisini veya benzerini getiririz. \"(Bakara 106) Fethu'l-Bari Açıklaması: Hadiste geçen lahndan maksat, tilaveti mensuh ayetlerin okunmasıdır \"Nebi s.a.v.'in Ashabından Kari Olanlar\" başlığı Kur'an ezberleme ve onun öğretme ile meşgul olmakla meşhur olan sahabilere tahsis edilmiştir. Kari' lafzı, selefin literatüründe Kur'an'ın manasına vakıf olan kimseler için de kullanılırdı. \"Kur'an'ı şu dört kişiden öğrenin\" hadisinde zikredilen dört kişiden ikisi muhacirlerden, diğer ikisi ise ensardandır. Bu konudaki hadislerin ilkinde Abdullah İbn Amr'ın yanında İbn Mes'ud'dan bahsedilmiştir. O da onun hakkında \"Onu hala seviyorum. Çünkü Nebi s.a.v.'in Kur'an'z şu dört kişiden öğrenin buyurduğunu işittim\" demiş ve ilk olarak da İbn Mes'ud'u zikretmiştir. Bu hadisten Kur'an'ı güzelokuyana sevgi beslemenin iyi olduğu sonucu çıkar. Kurtubi şöyle demiştir: \"Bu hadiste Hanefiler gibi şarap kokusunun had ce. zasını gerektirdiğini kabul etmeyenıere karşı bir delil söz konusudur. İmam Malik ve öğrencileri ile Hicaz Ehline göre, kendisinden şarap kokusu gelen kimseye had cezası uygulanır. Bu konu meşhur tartışmalı konulardan biridir. Bunu kabul etmeyenler şöyle der: Muhtemelen hadisteki adam şarap içtiğini kabul etmiştir. Bu durumda bu hadis delilolmaktan çıkar. Mufavvak \"Muğni'de sadece şarap kokusu yüzünden had cezasının gerekli olup olmadığı konusundaki ihtilafı zikrettikten sonra, sadece şarap kokusuna dayanarak haddin uygulanamayacağı görüşünü tercih etmiştir. Bununla birlikte kişinin sarhoş olması, kusması gibi başka bir delilin bulunması gerektiğini belirtmiştir. Fısk ile tanınan bir grubun olması, yanlarında şarabın bulunması, içlerinden birinden şarap kokusunun gelmesi gibi hususlar da delil olarak kabul edilmiştir. İbnu'l-Münzir selef alimlerinin birinden şu görüşü nakletmiştir: Şarap kokusu yüzünden had cezasına çarptırılması gereken kimse, şarap müptelası olan kimsedir. \"Enes İbn Malik'e Hz. Nebi Sallallahu Aleyhi ve Sellem döneminde kimlerin hafız olduğunu sordum. O da şöyle cevap verdi: Dört kişi Kur'an'ı ezberlemişti. Hepsi de ensardandı.\" Taberi'nin Said İbn Ebi Arı1be kanalıyla Katade'den naklettiği rivayette bu hadisin baş kısmı şu şekildedir: \"Evs ve Hazreç kabileleri birbirlerine karşı övünmeye başladı. Evsliler 'bizde dört kişi var ki, onlar için arş titrer' dedi. Bunlar Sa'd İbn Muaz, şahitliği iki kişinin yerine geçen Huzeyme İbn Sabit, cenazesini meleklerin yıkadığı Hanıala İbn Ebi Amir ve bal arılarının kendisini ayının saldırısından koruduğu kişi olan Asım İbn Sabit'tir. Buna karşın Hazreçliler, bizde dört kişi var ki, bunlar Kur'an'ı ezberlemiştir. Onların dışında da Kur'an'ı ezberlyen yoktur deyip bu dört kişinin ismini sıralamışlardır. Maziri şöyle demiştir: \"Enes'in 'Hz. Nebi Sallallahu Aleyhi ve Sellem vefat ettiği zaman Kur'an'ı dört kişiden başkası ezberlememişti' sözünden vakıanın bu şekilde olduğu sonucu çıkmaz. Çünkü o, bu dört kişi dışında Kur'an'ı ezberleyen birini bilmiyordu. Yoksa haflZ sahabilerin sayısının çok olduğunu ve çeşitli şehirlere dağıldığını düşünecek olursak onun bu kadar kuşatıcı bir araştırma yapması ' imkansızdır. Onun bu sonuca ulaşması bütün sahabilerin teker teker kendisine gelip Hz. Nebi Sallallahu Aleyhi ve Sellem döneminde Kur'an'ı ezberlemediğini bildirmesiyle mümkün olur. Bunun da gerçekleşmesi son derece zordur.\" Kurtubi, daha önce bahsi geçtiği üzere, Yemame savaşında öldürülen yetmiş kurra ile henüz Allah Resulü Sallallahu Aleyhi ve Sellem hayatta iken Bi'ru Maune faciasında katledilen bir kadar daha kurrayı delil olarak bu gösterip hafızların sayısının dörtten fazla olduğunu savunmuştur. Bu konuda şunu söylemiştir: \"Enes haflZlar arasında sadece bu dördünü, onları diğerlerinden çok sevdiği için zikretmiştir. Ya da aklında haflZ olarak sadece onlar vardı",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 5006,
			"arabicnumber": 5006,
			"text": "Ebu Said İbn el-Mualla'dan şöyle dediği nakledilmiştir: \"Namaz kılıyordum. Derken Allah Resulü Sallallahu Aleyhi ve Sellem beni çağırdı. Ancak çağrısına icabet etmedim. Sonra yanına varıp 'Ey Allah'ın Elçisi! Namaz kılıyordum' dedim. Bunun üzerine Allah Teala'nın 'sizi çağırdığı zaman Allah ve Resulü'ne uyun!'(Enfal, 24) emrini duymadın mı? dedi. Daha sonra Mescid'den çıkmadan önce Kur'an'daki en büyük sureyi sana öğreteyim mi? dedi. Sonra elimden tuttu. Mescid'den çıkmak istediğimiz zaman 'Ey Allah'ın Elçisi! Hani bana Kur'an'daki en büyük sureyi öğretecektin' dedim. O da şöyle buyurdu: Bahsini ettiğim sure Elhamdu lillahi rabbi'l-alemin'dir. O tekrarlanan yedi ve bana verilen Kur'an'dır",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 5007,
			"arabicnumber": 5007,
			"text": "Ebu Said el-Hudrı'den rivayet edildiğine göre, o şöyle demiştir: \"Bir yolculuk sırasında mola vermiştik. Bu esnada bir cariye yanımıza gelip 'kabilenin reisini (akrep) soktu. Adamlarımız da burada yok. Sizden rukye yapacak kimse var mı? diye sordu. Onunla birlikte daha önce rukye yaptığını bilmediğimiz biri kalkıp gitti. Kabile reisine rukye yaptı, o da iyileşti. Adam, bize otuz koyun verilmesini emretti. Koyunların sütünü içtik. Geri döndüğümüz zaman onu iyileştiren arkadaşımıza 'sen rukyeyi iyi yapar mıydın, sen rukye bilir miydin?' diye sorduk. O da, 'hayır ona sadece Ümmü'l-kitab'ı okuyarak rukye yaptım' dedi. Biz de 'Allah Resulü Sallallahu Aleyhi ve Sellem'e varana veya ona bu durumu sorana kadar bu koyunlar hakkında hiçbir işlem yapmayın!' dedik. Medıne'ye gelince olayı Nebi Sallallahu Aleyhi ve Sellem'e anlattık. O da şöyle buyurdu: Fatiha suresinin rukye olduğunu nereden öğrenmiş! Koyunları pay edin! Bu.arada bana da bir pay ayırın!\" Fethu'l-Bari Açıklaması: İmam Buharı \"Fatiha Suresinin Fazileti\" hakkında iki hadis zikretti. İlkini Ebu Said İbnu'I-Mualla'dan nakletti. Buna göre Fatiha, Kur'an'ın en büyük suresidir. Buradaki büyüklükten maksat, her ne kadar diğer sureler daha uzun olsa da, bu surenin okunuşu sayesinde elde edilecek sevabın çok olmasıdır. Çünkü bu surenin ihtiva ettiği konular bu büyüklüğe uygundur. İkincisini ise, Ebu Said el-Hudri'den nakletmiştir. Bu da Fatiha suresini okuyarak hastaları tedavi etmekle ilgilidir. Bu hadisin detaylı açıklaması İcare Bölümü'nde geçti. Bu durum, Fatiha'nın faziletini gösterme hususunda son derece açıktır. Kurtubi şöyle demiştir: \"Kur'an'ın başlangıcı olma ve bütün Kur'an ilimierini ihtiva etme sadece Fatiha suresinin özelliğidir. Çünkü bu sure şu konuları içerir: 1- Allah'a övgü. 2- O'na yapılan kulluğu ikrar. 3- O'na karşı ihlaslı hareket etmek. 4- O'ndan hidayet dilemek. 5- Nimetlerinin karşılığını yerine getirmekten aciz olduğumuzu itiraf. 6- Ahiret inancı. 7 - İnkarcıların akıbeti. Daha buna benzer saymadığımız bir çok konuyu ihtiva eder. İşte bütün bunlar bu surenin, okunarak tedavide kullanılmasını gerektirir",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 5008,
			"arabicnumber": 5008,
			"text": "Ebu Mes'ud Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmiştir: \"Her kim iki ayeti okursa",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 5009,
			"arabicnumber": 5009,
			"text": "Ebu Mes'ud Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmiştir: \"Her kim bir gecede Bakara suresinin sonundaki iki ayeti okursa, bu iki ayet ona yeter",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 5010,
			"arabicnumber": 5010,
			"text": "Ebu Hureyre r.a.'den rivayet edildiğine göre, o şöyle demiştir: \"Allah Resulü Sallallahu Aleyhi ve Sellem beni Ramazan'da toplanan zekat mallarına bekçi kıldı. Bir gün birisi gelip, avucuyla yiyecek {hurma) aldı. Hemen onu yakaladım. Ona, 'seni Allah Resulü Sallallahu Aleyhi ve Sellem'in huzuruna çıkaracağım' dedim. Sonra Ebu Hureyre olayın devamını anlattı. Ebu Hureyre şöyle dedi: \"O bana şunu dedi: Yatağına girdiğin vakit, ayete'l-kürsi'yi oku. Bu durumda mutlaka Allah tarafından gönderilen bir bekçin olur. Şeytan da sabaha kadar sana ilişemez. \" Bunun üzerine Allah Resulü şöyle buyurdu: \"O yalancı olduğu halde sana doğru söylemiş. O kişi şeytandı.\" Fethu'l-Bari Açıklaması: (Yeter) Yani geceyi Kur'an okuyarak ihya etmesinin yerini tutar. Buradaki \"yeter\" ifadesi, ister namaz içinde, isterse namaz dışında olsun Kur'an okumanın yerine geçer şeklinde de yorumlanmıştır. Bunun iman ile ilgili meselelerde yeterli olacağı da söylenmiştir. Çünkü bu ayetler, genelolarak iman ve amelden bahsetmektedir. \"Yeter\" ifadesinin, bu ayetlerin bütün kötülüklere karşı yeterli olduğu da ileri sürülmüştür. Bunların şeytan ın şenine yeteceği de belirtilmiştir. Bu husustaki bir başka görüşe göre ise, bu ayetler insanların ve cinlerin kötülüklerine karşı yeterlidir. Bir diğer görüşe göre ise, bu ayetleri okumakla elde edilecek sevap başka bir şeyi yapma isteğine karşı yeterlidir. Bu iki ayete bu özelliğin verilmesi, sahabeyi övmesinden ileri gelmiş olabilir. Çünkü onlar, Allah'a güzel bir şekilde boyun eğmişlerdi. O'na bağlanıp O'na yönelmişlerdi. Ayrıca kendilerinden istenen şeyleri yerine getirmişlerdi. Bu ayetlerin kişiye yetmesi konusunda yukarıda söylediğimiz hususların hepsi de kastedilmiş olabilir. Doğrusunu en iyi Allah bilir",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 5011,
			"arabicnumber": 5011,
			"text": "Bera'dan rivayet edildiğine göre, o şöyle demiştir: \"Adam'ın biri Kehf suresini okuyormuş. Yan tarafında da iki iple bağlı iyi cins bir at varmış. Derken bir bulut kaplamış. Bulut yaklaştıkça yaklaşmış. Bu esnada atı kaçmaya başlamış. Sabah olunca, adam Allah Resu!ü Sallallahu Aleyhi ve Sellem'e gelip bu durumu haber vermiş. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuş: O Kur'an'la birlikte inen sekinettir.\" Fethu'l-Bari Açıklaması: Hadiste ismi belirtilmeyen kişinin Üseyd İbn Hudayr olduğu söylenmiştir. .......şedaneyn kelimesi /şedan kelimesinin tesniyesidir. Sekinet, hem Kur'an'da, hem de hadislerde geçen bir kavramdır. Taberi ve diğerleri Hz. Ali'nin şöyle dediğini nakletmişlerdir. \"Sekinet, ses çıkararak esen bir rüzgarın adıdır. Onun, insan yüzüne benzer yüzü vardır.\" Söylendiğine göre sekinetin iki başı varmış. Mücahid'den nakledildiğine göre sekinetin kedi başı gibi bir başı varmış. Rabı' İbn Enes'ten, sekinetin ışık saçan bir gözü olduğu nakledilmiştir. Süddı ise şöyle demiştir: \"Sekinet, Cennetten gelen altın bir leğendir. Nebilerin kalpleri bu leğende yıkanır.\" Ebu Malik de şunları spylemiştir: \"Sekinet, Musa'nın levhaları, Tevratı ve asayı içine koyduğu şeyin adıdır.\" Vehb İbn Münebbih \"Sekinet, Allah'tan gelen bir rahatlıktır\" demiştir. Dahhak İbn Müzahim, sekinetin rahmet olduğunu söylemiştir. \"Sekinet, kalbin sukOna ermesidir\" sözü de ondan nakledilmiştir. Sekinetin, gönül huzuru ve ağırbaşlılık olduğu da ileri sürülmüştür. Sekinetin melekler olduğu da ifade edilmiştir. Bu görüşü, Saganı zikretmiştir. Kısaca sekinet geçtiği yere göre anlam kazanır. Bu konudaki hadiste geçen sekinetin uygun açıklaması ilk aktardığımız izahtır. Ancak Vehb'in sözü de göz ardı edilemez. Nevevı şöyle demiştir: \"Tercih edilen görüşe göre sekinet, gönül huzurunu, rahmeti ve melekleri bir araya getiren bir tür canlı yaratıktır",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 5012,
			"arabicnumber": 5012,
			"text": "Zeyd İbn Eslem babasından onun şöyle söylediğini rivayet etmiştir: \"Nebi Sallallahu Aleyhi ve Sellem seferlerinin birinde gece vakti yürüyordu. Hz. Ömer de ona eşlik ediyordu. Derken Hz. Ömer ona bir şey sordu. Fakat Allah Resulü Sallallahu Aleyhi ve Sellem cevap vermedi. Sonra tekrar sordu. Yine cevap vermedi. Bir kez daha sordu. Hz. Nebi yine cevap vermedi. Sonunda Hz. Ömer şöyle dedi: Anan seni kaybetsin, sana ağıtlar yaksın Ömer! Rasulullah Sallallahu Aleyhi ve Sellem'e üç defa ısrarla soru sordun. Üçünde de sana cevap vermedi. Hz. Ömer olayı anlatmaya şöyle devam etti: Devemi hızlandırdım ve ordudaki herkesin önüne geçtim. Hakkımda bir Kur'an ayetinin inmesinden endişe ediyordum. Çok geçmeden bir adamın beni çağırdığını duydum. Kendi kendime, 'korktuğum başıma geldi hakkımda ayet nazil oldu galiba' dedim. Allah Resulü Sallallahu Aleyhi ve Sellem'in huzuruna gelip ona selam verdim. O da selamımı aldı ve şöyle buyurdu: Bu gece bana bir sure indirildi. Kuşkusuz bu sure, benim için güneşin üzerine doğduğu her şeyden daha sevimlidir. Sonra إنا فتحنا لك فتحا مبينا inna fetehna leke fethan mübina diye başlayan Fetih suresini okudu",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 5013,
			"arabicnumber": 5013,
			"text": "Ebu Said el-Hudrl'den rivayet edildiğine göre; Adam'ın biri, başka birinin İhlas suresini tekrarlayıp durduğunu işitmiş. Sabah olunca, Nebi Sallallahu Aleyhi ve Sellem'e gelip biraz da adamın yaptığını hafife alarak bu durumu haber vermiş. Bunun üzerine Allah Resülü Sallallahu Aleyhi ve Sellem şöyle buyurmuş: \"Canım elinde bulunan Allah'a yemin ederim ki, bu sure Kur'an'ın üçte birine denktir.\" Hadisin geçtiği diğer yerler: 6643, 7374",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 5014,
			"arabicnumber": 5014,
			"text": "Ebu Said el-Hudri'den şöyle söylediği rivayet edilmiştir: \"Kardeşim Katade İbn Nu'man şöyle haber verdi: Adam'ın biri seher vakti kalkıp İhlas suresini okumuş. Başka da bir sure okumamış. Sabah olunca adam Nebi Sallallahu Aleyhi ve Sellem'e geldi... Hadisin bundan sonraki kısmı önceki (5014.) hadis'e benzer",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 5015,
			"arabicnumber": 5015,
			"text": "Ebu Said el-Hudrı'den rivayet edildiğine göre, o şöyle demiştir: Nebi Sallallahu Aleyhi ve Sellem ashabına: \"İçinizden biri bir gecede Kur'an'ın üçte birini okuyabilir mi?\" diye sordu. Kur'an'ın üçte birini okumak onlara zor geldi ve: \"Ey Allah'ın Resulü! (s.a.v.) Hangimiz buna güç yetirebilir\" dediler. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Allah tektir, Samed'dir, (İhlas Suresi) Kur'an'ın üçte biridir.\" Fethu'l-Bari Açıklaması: \"Hafife alarak\" ifadesi \"sadece İhlas suresini okumasını azımsayarak anlamına\" gelir. Katade İbn Nu'man, Ebu Said el-Hudri'nin anneleri bir, babaları ayrı kardeşidir. Bazı alimler, \"Kuran'ın üçte birine\" ifadesinin zahiri ne hamlederek/ilk bakışta anlaşılan anlamına bakarak şöyle demiştir: \"İhlas suresi Kur'an'ın manalarına göre onun üçte biridir. Çünkü Kur'an'ın üç ana konusu vardır. Bunlar, hükümler, kıssalar ve tevhid inancıdır. İhlas suresi bu konulardan üçüncüsünü ihtiva etmektedir. Bu itibarla Kur'an'ın üçte birini teşkil etmektedir.\" Ebu Ubeyde'nin Ebu'dDerda'dan naklettiği şu hadis de bu görüşü destekler niteliktedir: \"Nebi Sallallahu Aleyhi ve Sellem Kur'an'ı üç bölüme ayırdı. İhlas suresini bu bölümlerden biri yaptı.\" Kurtubi şöyle demiştir: \"Bu sure, Allah'ın isimlerinden ikisini ihtiva etmektedir. Bu iki isim de bütün kemal sıfatlarını barındırmaktadır. Bunlar başka bir surede de geçmemektedir. Bu isimler Ahad ve Samed'dir. Bu isimler, bütün kemal sıfatlarla muttasıf olan yüce Zat'ın bir olduğuna delalet eder. Şöyle ki; Ahad, Hak Teala'nın herkesten farklı kendine özgü varlığını gösterir. Samed ise, bütün kemal sıfatlarına delalet eder. Çünkü Samed, Allah'ın yüceliğinin son noktasıdır. Bu yüzden sadece ondan istenir ve ona yönelinir. Bu özellikler ancak bütün kemal vasıfları taşıyan varlıkta bulunur. Bunlar, sadece Allah Teala hakkında geçerli olur. Hadisten Çıkarılan Sonuçlar 1- İhlas suresinin fazileti ortaya konmuştur. 2- Alim kimse, kendiliğinden bir takım konuları etrafındakilere öğretebilir. 3- Bir lafız akla ilk gelen manasının dışında kullanılabilir. Çünkü Kur'an'ın üçte biri ifadesinden akla gelen ilk mana, uzunluk bakımından İhlas suresinin Kur'an'ın üçte biri kadar olduğudur. Ancak bunun kastedilmediği yukarıda ortaya çıkmıştır",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 5016,
			"arabicnumber": 5016,
			"text": "Aişe r.anha'dan rivayet edildiğine göre; Allah Resıılü Sallallahu Aleyhi ve Sellem rahatsızlandığı vakit kendisine muavvizatı okurdu. Rahatsızlığı ilerleyince ona ben okumaya başladım. Elinin bereketinin sinmesi umuduyla elini sıvazlardım",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 5017,
			"arabicnumber": 5017,
			"text": "Aişe r.anha'dan şöyle nakledilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem her gece yatağına girdiği zaman iki avucunu birleştirip açar, sonra onlara üflerdi. Avuçlarına .......kul huvallahu ahad (İhlas suresini), ........kul euzu bi Rabbi'l-felak (Felak suresini) ve ...........kul euzu bi Rabbi'n-nas (Nas suresini) okurdu. Sonra yapabildiği kadar ellerini vücudunda gezdirirdi. Önce başına yüzüne ve ön tarafına sürerdi. Bunu üç kez tekrar ederdi. \" Takrar: 5748, 6319. İhlas, Felak ve Nas surelerine muawizat denir",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 5018,
			"arabicnumber": 5018,
			"text": "Useyd İbn Hudayr, bir gece Bakara suresini okuyormuş. Atı da yanında bağlı imiş. Derken at huysuzlanmış. Hudayr susunca at sakinleşmiş. Tekrar okumaya başlayınca at da huysuzlanmaya başlamış. Tekrar susmuş, at da susmuş. Sonra yeniden okumaya başlamış. At yine huysuzlanmış. Useyd de okumayı bırakmış. Çünkü oğlu Yahya atın yakınındaymış. Hayvanın ona zarar vermesinden korkmuş. Oğlunu bulunduğu yere doğru götürürken başını kaldırıp semaya bakmış ama gökyüzünü göremeyecek kadar her tarafın kaplandığını görmüş. Sabah olunca Allah Resulü Sallallahu Aleyhi ve Sellem'e gidip dun,ımu anlatmış. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem ona: \"Oku! Ey Hudayr'ın oğlu. Oku! Ey Hudayr'ın oğlu\" demiş. O da şöyle demiş: Ey Allah'ın Elçisi! Atın oğlum Yahya'yı tepmesinden korktum. Çünkü ona yakın bir yerde idi. Başımı mushaftan kaldırıp onun yanına gittim. Bu esnada başımı göğe çevirdim. Orada buluta benzer bir şey vardı. İçinde lambaları andıran parıltılar gördüm. Çıktı m ama onları göremedim. Allah Resulü Sallallahu Aleyhi ve Sellem ona: \"Onların ne olduğunu biliyor musun?\" diye sormuş, o da, \"hayır\" cevabını verince şöyle buyurmuştur: \"Onlar Meleklerdi. Senin sesini duymak için yaklaşmışlardı. Eğer okumaya devam et- ' seydin, sabaha kadar orada olurlardı. Herkes de gelip onlara bakar görürdü. Zira melekler böyle bir durumda insanlardan uzaklaşmazlar.\" Fethu'l-Bari Açıklaması: ..........İcterrahu ifadesindeki, o/huzamiri İbn Hudayrım oğluna döner. Bu ifade göstermektedir ki, İbn Hudayr, oğlunu, atın tepmesi için kendi bulunduğu yere götürmüştür. \"Oku! Ey Hudayr'ın oğlu. Oku! Ey Hudayr'ın oğlu\" ifadesi \"okumaya devam etmen gerekirdi\" anlamına gelir. Yoksa İbn Hudayr'a başından geçenleri anlatırken ayeti okumasının emredildiği manasına gelmez. Öyle anlaşılıyor ki, Allah Resulü Sallallahu Aleyhi ve Sellem olayı canlandırmak istemiştir. Bir an için kendisini İbn Hudayr'ın gördüklerini gördüğü sırada onun yanında hissetmiştir. Bu yüzden okumaya devam etmesini istemiştir. Böylece meleklerin inişiyle oluşan bereketin sürmesini ve meleklerin onun kıraatini dinlemeye devam etmelerini temenni etmiştir. Üseyd bunu anladığı için, \"Oğlumu tepmesinden korktum\" diyerek neden okumayı bıraktığını belirterek Rasulullah'a cevap vermiştir. Yani \"Okumaya devam etmem durumunda atın oğlumu tepmesinden korktum,\" demek istemiştir. Hadisin akışı Üseyd'in namazdaki huşo.'unu bozmadığını gösterir. Çünkü o, atın ilk huysuzlandığı anda sesini yükseltebilirdi. Öyle' anlaşılıyor ki o, namaz kılanın göğe başını kaldırmasının yasaklandığından da haberdardı. Çünkü iş ciddileşene kadar semaya başını çevirmemiştir. İmam Nevevt\"Bu hadisten, bir Müslümanın tek başına melekleri görebileceği sonucu çıkar\" derken bu çıkarımını mutlak olarak ifade etmiştir. Meleklerin Müslüman fertler tarafından görülebileceği doğrudur. Ancak bunun, salih kimseler, güzel sesli kişiler şeklinde takyid edilmesi gerekir. İmam Nevevl\"Bu hadis, Kur'an okumanın faziletli bir amel olduğunu gösterir. Çünkü Kur'an okumak rahmetin inmesine ve meleklerin gelmesine vesile olur\" demiştir. Kanaatime göre bu hadis bu hüküm için delil olamaz. Çünkü rivayette anlatılanlar, belli bir surenin belli bir tarzda okunuşundan ileri gelmiştir. Belki de burada bahsedilmeyen bir hususiyetten kaynaklanıyor olabilir. Aksi takdirde bu hüküm herkes için geçerli olsaydı, her Kur'an okuyanın aynı olayı yaşaması gerekirdi.. Hadisten Çıkarılan Sonuçlar 1- Hadisin sonunda yer alan \"İnsanlardan uzaklaşmazlardı\" bölümü, meleklerin kendilerini tamamen Kur'an okumaya verdiklerini gösterir. Bu yüzden onlar, genel halleri olan gizli kalmayı bir kenara bırakmaya devam etmişlerdir. 2- Üseyd İbn Hudayr'ın bir menkıbesi ortaya çıkmıştır. 3- Gece namazında Bakara suresini okumak faziletli bir ameldir. 4- Namazda huşulu olmak faziletlidir. 5- Mübah olsa bile dünya işlerinden basit bir şeyle ilgilenmek birçok hayrın kaçırılmasına neden olabilir. Mübah olmayanları ise, varın siz düşünün",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 5019,
			"arabicnumber": 5019,
			"text": "Abdulaziz İbn Rufay'dan rivayet edildiğine göre, o şöyle demiştir: \"Şeddad İbn Ma'kıl ile birlikte İbn Abbas'ın yanına gittim. Şeddad ona 'Nebi Sallallahu Aleyhi ve Sellem bunun dışında bir şey bıraktı mı?' diye sordu. O da şöyle cevap verdi: Ancak Mushaf'ın iki kapağı arasındakileri bıraktı.\" İbn Rufay' şöyle dedi: \"Muhammed İbnu'l-Hanefiyye'nin yanına gittik ve aynı soruyu ona da soruduk. O da şu cevabı verdi: Ancak Mushaf'ın iki kapağı arasındakileri bıraktı.\" Fethu'l-Bari Açıklaması: \"Nebi s.a.v.'in Sadece Kur'an'ın İki Kapağı Arasındakileri Bıraktığını Söyleyenler\" başlığı ile Hz. Nebi s.a.v.'in Kur'an'ı iki kapak arasında kitap şeklinde bir araya getirdiği kast edilmemiştir. Çünkü böyle bir şey, daha önce anlatılan Ebu Bekir döneminde yapılan cem' ile Hz. Osman zamanında gerçekleştirilen istinsaha aykırıdır. Bu başlık, hafızların ölmesiyle birlikte Kur'an'ın büyük bir kısmının yok olduğunu iddia edenlere cevap vermek için konmuştur. Bu iddiayı Rafizller ortaya atmıştır. Bununla, Hz. Ali'nin nass ile halife tayin edildiğinin ve Nebi s.a.v.'in vefatından sonra hilafeti hak ettiğinin Kur'an'da sabit olduğu, ancak bunun sahabe tarafından gizlendiği, şeklindeki iddialarını doğrulamaya çalışmışlardır. Hakikaten bu, batıl bir iddiadır. Çünkü sahabe \"Sen, benim yanımda, Harun'un Musa yanındaki konumundasın\" hadisini gizlememiştir. Daha bunun dışında zahirine Hz. Ali'nin imametini iddia edenlerin tutunduğu birçok hadisi saklamamışlardır. Aynı şekilde bu iddiaya muhalif hadisleri de ne gizlemişler, ne tahsis, ne de takyit etmişlerdir. İmam Buhari, Rafizilere karşı, kendilerinin imametini idia ettikleri imamların biri olan Muhammed İbnu'u-Hanefiyye'den naklettiği hadisi delil getirmek suretiyle, onlara ince bir mesaj vermiştir. Muhammed İbnu'l-Hanefiyye, Hz. Ali'nin oğludur. Eğer ortada babasıyla ilgili bir durum olsaydı, o, bunu herkesten daha iyi bilirdi. Aynı şekilde İbn Abbas da bunu daha iyi bitirdi. Çünkü o, Hz. Ali'nin amcasının oğluydu. Üstelik insanlar arasında ona en fazla bağlı kalan ve onun durumunu en iyi bilen kimse idi",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 5020,
			"arabicnumber": 5020,
			"text": "Ebu Musa el-Eş'ari'den Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğu rivayet edilmiştir: \"Kur'an okuyan kimse, turunçgillere benzer. Hem tadı güzeldir, hem de kokusu. Kur'an okumayan (mu'min) hurma gibidir. Tadı güzeldir ama kokusu yoktur. Kur'an okuyan facir kimse, rayhane gibidir. Kokusu güzel, tadı acıdır. Kur'an okumayan facir kimse ise, Ebu Cehil karpuzuna benzer. Hem tadı acıdır, hem de kokusu yoktur. \" Tekrar: 5059, 5427, 7560. Diğer tahric:: Müslim, müsafirin; Tirmizî, emsal, Ebu Davud, edeb; Nesaî, iman; İbn Mace, mukaddime; Darimî, Fedailü'l-Kur'an; Ahmed b. Han bel, IV, 397, 404, 408",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 5021,
			"arabicnumber": 5021,
			"text": "Abdullah İbn DInar, İbn Ömer'i Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu derken işittim demiştir: \"Önceki ümmetlere göre sizin ümmetin yaşayacağı süre, ikindi namazı ile akşam namazı arasındaki süre kadardır. Sizin bu durumunuz, Yahudi ve Hıristiyanların haline benzer. Şöyle ki, bir adam, iş görmeleri için bir takım işçiler tutar. Onlara 'kim benim için öğleye kadar bir kırat karşılığı çalışır?' diye teklifte bulunur. Bu teklif karşısında Yahudiler çalışır. Adam 'kim benim için gündüzün ortasından ikindi vaktine kadar çalışır?' diye iş teklifinde bulunur. Bu defa Hıristiyanlar çalışır. Sonra siz, ikindiden akşama kadar iki kırat karşılığı çalışırsınız. Kıyamet günü onlar 'biz daha çok çalıştık. Ama az ücret aldık' diye itiraz edecekler. Allah Teala: 'ben sizin hakkınızı yedim mi?' diyecek. Onlar da 'hayır' diyecekler. Bu defa Rahman şöyle buyuracak: İşte bu benim lütfumdur. Dilediğime onu veririm.\" Fethu'l-Bari Açıklaması: \"Hem tadı güzeldir, hem de kokusulı ifadesi ile bu hadiste iman tad, Kur'an okumak da koku ile vasıflandırılmıştır. Çünkü iman, mu'min için Kur'an okumaktan daha çok gereklidir. Zira Kur'an okuma olmadan da iman hasıl olur. Bunun gibi tad da, bir şeyin özüne kokusundan daha gereklidir. Çünkü özün kokusu gider ama tadı kalır. Burada elma gibi hem güzel kokan, hem de tadı güzelolan diğer meyvelerin aksine turunçgillerin buna örnek verilmesinin hikmeti ise şu şekilde açıklanmıştır: Turunçgillerin kabuğu tedavide kullanılır. Bu özelliği sayesinde rahatlatıcıdır. Ayrıca çekirdeğinden yağ elde edilir ki, bunun da bir takım yararları vardır. Anlatıldığına göre içinde turunçgiller bulunan eve cin girmezmiş. Bu yüzden Kur'an'ın bu meyveye benzetilmesi uygun oldu. Zira Kur'an'a şeytanlar yanaşamaz. Bu meyvenin çekirdeğinin kabuğu beyazdır. Dolayısıyla mu'minin kalbine uygun oldu. Ayrıca bu meyvede bir takım özellikler daha vardır. Mesela cisminin büyük olması, görünüşünün güzel, renginin insanın içini açması, yumuşak olması,lezzet alarak yenmesi, güzel koku vermesi, zarının ince olması, mideyi rahatlatması, hazmının kolayolması bunlar arasında sayılabilir. Bir de \"Müjredat\"ta zikredilen başka yararları da vardır. Hadisten Çıkarılan Sonuçlar: 1- Kur'an'ı ezbere bilenlerin üstünlüğüne işaret edilmiştir. 2- Bazı konuları daha kolayanlatmak için benzetmeler yapılabilir. 3- Kur'an'ı okumaktan maksat, gereğince amel etmektir",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 5022,
			"arabicnumber": 5022,
			"text": "Talha'dan rivayet edildiğine göre, o şöyle demiştir: \"Abdullah İbn Ebi Evfa'ya Nebi Sallallahu Aleyhi ve Sellem'in herhangi bir vasiyyette bulunup bulunmadığını sordum. O da: 'hayır' diye cevap verdi. Bunun üzerine, 'Nebi Sallallahu Aleyhi ve Sellem vasiyyette bulunmadıysa nasıl vasiyyet etmek insanlara farz kılındı, neden vasiyyette bulunmaları• emredildi?' diye sordum. O da şöyle cevap verdi: \"Nebi Sallallahu Aleyhi ve Sellem Allah'ın kitabını vasiyyet etti.\" Fethu'l-Bari Açıklaması: Bu başlıktaki Allah'ın kitabını vasiyyet etmek ibaresinden maksat, onun hem aslını, hem de manasını korumaktır. Ona saygı gösterip onu muhafaza etmektir. Düşman topraklarına onu götürmemektir. İçindekilere tabi olup emirlerini yerine getirmek, nehiylerinden sakınmaktır. Okumaya devam edip, aksatmadan onu öğrenme ve öğretme faaliyetini sürdürmektir",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 5023,
			"arabicnumber": 5023,
			"text": "Ebu Hureyre Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu rivayet etmiştir: \"Allah Teala Nebi'in Kur'an'ı yüksek sesle güzel okuması konusunda izin verdiği gibi başka hiçbir konuda böyle teğanni ile okumaya müsaade etmemiştir.\" [İbn Şihab dediki: Ravi Ebu Seleme'nin] bir arkadaşı, Kur'an'ı güzel okumaktan maksadın, onu yüksek sesle okumak olduğunu söylemiştir. Tekrar: 5024, 7482, 7544",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 5024,
			"arabicnumber": 5024,
			"text": "Ebu Hureyre r.a.'den rivayet edildiğine göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Allah Teala Nebi'in Kur'an'ı yüksek sesle güzel okuması konusunda izin verdiği gibi başka hiçbir konuda böyle teğanni ile okumaya müsaade etmemiştir.\" Fethu'l-Bari Açıklaması: \"Kendilerine okunmakta olan Kitab'ı sana indirmemiz onlara yetmemiş mil?\" İmam Buharı bu ayeti burada zikretmekle, İbn Uyeyne'nin jyeteganna fiilini I/istağna şeklinde yaptığı tefsiri tercih ettiğini göstermiştir. Bu ayetle, önceki milletlerin kıssaları ile yetinmek kastedilmiştir. Yoksa fakirliğin zıddı olan ve zenginlik manasına gelen istiğna ........el-istiğna kastedilmemiştir. Nitekim İmam Buharl'nin de, bu başlıktan sonra bu ayeti zikretmesi bu görüşü benimsediğini gösterir. Kurtubi şöyle demiştir: \"Asıl itibariyle ..... kelimesi, kişinin dinlediği kimseye kulak vermesi anlamına gelir. Bu mana Allah Teala hakkında düşünülemez. Bu kullanım, muhatapların örflerinde yaygın olan bir esasa dayanarak mecaz ifade eder. Bu kavram Allah Teala hakkında kullanılınca, O'nun, Kur'an okuyana lütufta bulunması ve ona bolca sevap vermesi anlamına gelir. Çünkü bunlar, kulak vermenin neticeleridir. Bu durumda hadis, Kur'an okumayı teşvik eder ve Kur'an'ı bırakıp başka bir kelama meyletmemeyi öğütler.\" Kurtubı, bu hadisi mana bakımından Buharı'nin tercih ettiği istiğnanın tahsisine göre te'vll etmektedir. Çünkü Kur'an varken başka kitapıara ihtiyaç kalmaz. .........Lem yeteganne ifadesi ile Kur'an'ın kendisine bir fayda sağlamadığı, bu kitabın imanına bir yararı dokunmadığı, Kur'an'da var olan va 'd ile vaıdi tasdik etmeye yardımcı olmadığı kimselerin kastedildiği de söylenmiştir. Bu başlık ile \"Kur'an okuyup onu dinlemekle rahata kavuşmayan\" manasının kast edildiği de ileri sürülmüştür. Ancak bu lafız ile Ebu Ubeyd'in tercih ettiği fakirliğin zıddı olan zenginlik kastedilmemiştir. Yine de Ebu Ubeyd'in görüşü yabana atılamaz. Bununla, fakirliğin zıddı olan ve gözle görülebilen zenginliğin değil de, kanaat olan ve nefis zenginliği anlamına gelen manevi temizlik kastediImiş olabilir. Çünkü malum olan zenginlik başka bir özellik olmazsa sırf Kur'an okumakla elde edilemez. Hadisin akışı da böyle bir özelliğin bulunmadığını gösterir. Bu hadiste Kur'an'ı güzelokumak için gayret sarfedilmesine teşvik söz konusudur. Ayrıca gayret sarfetmenin nedeni de açıklanmıştır. Buna göre sanki Hz. Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: Kur'an okurken teğanni ile okumayı arzu etmeyenler bizden değildir. İmam Taberl'nin naklettiğine göre İmam Şafii'ye İbn Uyeyne'nin teğanni kelimesini istiğna ile tefsir etmesi hakkında ne düşündüğü sorulunca, bu tevili kabul etmeyip şöyle demiştir: \"Eğer Nebi Sallallahu Aleyhi ve Sellem bu lafız ile zengin olmayı kast etseydi, r-!/lem yesteğni lafzını kullanırdı. Şüphesiz Rasulullah güzel sesle Kur'an okumayı kastetmiştir.\" İbn Battal şöyle demiştir: \"İbn Ebi Müleyke, Abdullah İbn Mübarek ve Nadr İbn Şümeyl de bunu bu şekilde tefsir etmiştir. Nitekim, Abdula'la'nın, Ma'mer kanalıyla İbn Şihab'dan bu konuda zikredilen hadise ilişkin naklettiği şu sözler de bunu destekler: \"Allah Teala Kur'an'ı makamlı biçimde okumaya müsaade ettği gibi başka bir şeyi teğanni ile söylemeye müsaade etmemiştir.\" Bu rivayeti Taberi tahriç etmiştir. Yine Taberi, Abdurrezzak kanalıyla Ma'mer'den şu rivayeti nakletmektedir: \"Allah Teala güzel sesli başka bir Nebie böyle bir şey için izin vermemiştir.\" Bu lafız, İmam Müslim tarafından Muhammed İbn İbrahim et-Teymi kanalıyla Ebu Seleme'den, İbn Ebi Davı1d ve Tahavi tarafından Amr İbn Dinar ve Ebu Seleme kanalıyla Ebu Hureyre'den \"Allah Teala Kur'an'ı güzel terennüm etmekten dolayı başka bir Nebie böyle bir teğanni izni vermemiştir, \" şeklinde nakledilmiştir. Bu konuda Taberi şöyle demiştir: \"Terennüm, ancak okuyucunun sesini güzelleştirip kulağa hoş hale getirmesiyle mümkün olur. Eğer teğanninin anlamı istiğna olsaydı, burada sesin zikredilmesine gerek kalmazdı. Aynı şekilde yüksek sesle okumaya da temas edilmezdi.\" Sonuç olarak bu konuya ilişkin yukarıda zikredilen bütün görüşleri şu şekilde uzlaştırmak mümkündür: Okuyucu, Kur'an okurken sesini yükselterek, içli içli okuyarak, onunla yetinip diğer sözlere yönelmeyerek, onunla gönül zenginliğini ve maddi bolluğu yakalamayı umarak Kur'an'la sesini güzelleştirmiş olur. Bu mesele ile ilgili düşüncelerimi şu beyitlere döktüm: Kur'an'ı oku nameli güzel sesle İçli içli, terennüm ederek yükses sesle Diğer kitapları terk eyle umarak Günül zenginliğini, hakiki zenginlği Hiç kuşkusuz, nefisler makamlı okuyuşlara makamsız okuyuşlardan daha fazla meyleder. Çünkü name, kalbin hislenmesinde ve gözyaşının akmasında son derece etkilidir. Selef alimleri, Kur'an'ın makamla okunup okunmayacağı hususunda ihtilaf etmişlerdir. Ancak güzel sesle Kur'an okumak ile güzel sesli birinin Kur'an okumasını başkalarına önceleme hususunda aralarında hiç ihtilaf yoktur. İmam Nevevi \"et-TibyCin\" adlı eserinde şöyle demiştir: \"Alimler Kur'an okurken sesin güzelleştirilmesi hakkında icma' etmişlerdir. Ancak sesi güzelleştirmek için aşırı derecede uzata uzata okumaya meyletmemek gerektiğini vurgulamışlardır. Eğer okunurken bir harf ilave edilmesi veya bir harfin gizlenmesi haramdır. Makam yaparak okuma hakkında ise .İmam Şafii bir yerde bunun mekruh olduğunu, başka bir yerde ise bunda bir sakınca bulunmadığını söylemiştir. Onun bu durumunu öğrencileri ve ona tabi olan ilim adamları şu şekilde izah etmiştir: İmam Şafii iki zıt görüş beyan etmemiştir. Çünkü o, farklı hallere göre farklı konuşmuştur. Eğer Kur'an okuyan doğru dürüst okur ve makam yaparsa, bu caizdir. Aksi takdirde haramdır. Bu konudaki delillerden şu sonuç ortaya çıkmıştır: Kur'an'ı güzel sesle okumak güzel bir davranıştır. Eğer kişinin sesi güzel değilse, gücü ye ttiği kadar güzel okumaya gayret etsin. Nitekim İbn Ebi Müleyke hadis ravilerinden birine böyle demiştir. Bu rivayeti, Ebu Davııd sahih bir senede nakletmiştir. Kur'an okuyanın sesini güzelleştirmesinin bir yolu da, makamların kurallarına dikkat etmektir. Çünkü güzel ses, makam ile daha da güzelleşir. Kişinin makamdan uzak durması sesinin güzelliğini etkiler. Sesi güzelolmayan kimse belki de kıraat ehli nezdinde muteber olan kuralların dışına çıkmamak kaydıyla bu makamlara rivayet etmek zorunda kalır. Buna riayet etmezse, kuralına uygun okumadığı için sesini güzelleştiremez. Belki de bu görüş, makamla Kur'an okumayı mekruh görenlere aittir. Çünkü genellikle makamlara riayet edenler Kur'an'ı düzgün okumaya özen göstermezler. Eğer bir kimse, hem Kur'an okuma kurallarına hem de makama riayet ederse, onun kıraatı başkasınınkine tercih edilir. Çünkü o, hem dinin arzuladığı gibi sesini güzelleştirmiş, hem de haram olan okuma hatalarından korunmuştur.\" Doğrusunu en iyi Allah bilir",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 5025,
			"arabicnumber": 5025,
			"text": "Abdulllah İbn Ömer Allah Resulü Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu rivayet etmiştir: \"Şu iki kişi hariç başkasına ğıbta edilmez. İlki Allah'ın Kur'an'ı lutfettiği kişidir. Bu kimse gece boyu zamanınz Kur'an'la ihya eder. Diğeri ise, Allah'ın servet bahşettiği kimsedir. Bu da, malını gece gündüz tasadduk eder. \" Hadisin geçtiği yer: 7529",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 5026,
			"arabicnumber": 5026,
			"text": "Ebu Hureyre'den Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğu rivayet etmiştir: \"Ancak şu iki kişiye ğıpta edilir: Biri Allah'ın Kur'an öğrettiği kimsedir. Bu kişi, gece ve gündüzün belirli vakitlerinde Kur'an okur. Komşusu onun okuyuşunu duyunca 'keşke falancaya lutfedilen bu özellik bana da bahşedilseydi de, ben de onun gibi amel etseydim' diye temennide bulunur. Diğeri ise, Allah'ın servet verdiği adamdır. Bu kişi, hak yolunda malını harcar. Onu gören biri, 'keşke falancaya verilen bana da verilseydi de, ben de onun gibi amel etseydim' diye temennide bulunur. \" Hadisin geçtiği yerler: 7233, 7528. Kitabu'l-ilm'in baş kısımlarında \"İlim ve Hikmet Konusunda Gıbta Etmek\" başlığı geçmişti. Burada gıbtanın açıklaması ile gıbta ile has ed arasındaki farklar zikredilmişti. Hadiste gıbtaya mecazi olarak hased dendiği belirtilmişti",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 5027,
			"arabicnumber": 5027,
			"text": "Osman radiyallahu anh'dan Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğu rivayet edilmiştir: \"Sizin en hayırlınız Kur'an'ı öğrenen ve öğretendir.\" Sa 'd İbn Ubeyde şöyle dedi: Hz. Osman döneminde Ebu Abdurrahman Müslümanlara Kur'an öğretti. Haccac dönemine kadar da bu faaliyetini sürdürdü. Bu konuda şöyle demiştir: \"Kur'an'ın faziletine ilişkin nakledilen hadis, benim buraya oturup Kur'an öğretmeme vesile oldu.\" Diğer tahric edenler: Tirmizî, Fedail-ül Kur’ân; İbn Mâce,i Mukaddime",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 5028,
			"arabicnumber": 5028,
			"text": "Osman bin Affan (r.a.)'dan rivayet edildiğine göre, o Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu demiştir: \"Sizin en faziletliniz Kur'an'ı öğrenen ve öğretendir",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 5029,
			"arabicnumber": 5029,
			"text": "Sehl İbn Sa'd'dan rivayet edildiğine göre, o şöyle demiştir: \"Nebi Sallallahu Aleyhi ve Sellem'e bir hanım geldi. Ona kendisini Allah'a ve Resulü Sallallahu Aleyhi ve Sellem'e hediye ettiğini söyledi. Bunun üzerine Allah Resulü Sallallahu Aleyhi ve Sellem: 'Benim kadınlara ihtiyacım yok' buyurdu. Hemen ordan biri '(Ey Allah'ın Resulü!) Onu benimle evlendir' dedi. Allah Resulü Sallallahu Aleyhi ve Sellem 'Ona (mehir olarak) bir elbise ver' deyince adam 'hayır, buna gücüm yetmez' diye karşılık verdi. Bu defa Allah Resulü Sallallahu Aleyhi ve Sellem: 'Demirden bir yüzük dahi olsa ona bir şeyler ver' dedi. Adamcağız bir şey veremediği için mahzun oldu. Son olarak Allah Resulü Sallallahu Aleyhi ve Sellem ona, 'Kur'an'dan bildiğin ayet var mı?' diye sordu. O da, 'şunu, şunu biliyorum' diyerek öğrendiği Kur'an surelerini saydı. Bunun üzerine Allah Resulü Sallallahu Aleyhi ve Sellem 'Bildiğin bu Kur'an surelerini bu kadına öğretmen karşılığında, onu seninle evlendirdim,' buyurdu.\" Fethu'l-Bari Açıklaması: \"Sizin en hayırlınız Kur'an'ı öğrenen ve öğretendir.\" hadisindeki hayırlı olma vasfı, öğrendikten sonra öğretmekten ileri gelir. Başkasına öğreten, sadece amel edenin aksine çevresine de yarar sağlar. Hatta amellerin en değerlisi, başkasına bir şey öğretmektir. Başkasına bir şöy öğretenin, öğreteceğini önce kendisinin öğrenmesi gerekir. Başkasına öğretmek, bir ameldir, çevreye fayda verecek bir davranıştır. Hayırlı olmak, başkasına fayda verecek davranışta bulunmaksa, başkasına her hangi bir bilgi öğretenin bu hadisin kapsamına gireceği söylenemez. Çünkü Kur'an, ilimierin en şereflisidir. Dolayısıyla onu öğrenen ve başkasına öğreten de, Kur'an dışında başka bir şeyi öğrenip öğretenden daha değerlidir. Hem Kur'an öğrenen, hem de onu öğreten kendisini ve başkasını kemale yöneltmiştir. Sadece kendisine fayda sağlamakla çevresine yarar sağlamayı başarmıştır. Bu yüzden en faziletli kişi olur. Bu kimseler, Hak Teala'nın şu ayetinde kastettiği insanlar arasına girer: \"İnsanları Allah'a çağıran, iyi iş yapan ve 'ben müslümanlardamm' diyenden kimin sözü daha güzeldirf\"(Fussılet 33) Allah'a davet etmek çeşitli şekillerde gerçekleşir. Kur'an Öğretmek de bunlar arasında yer alır. Hatta, bunların en faziletlisidir. İnsanların en kötüsü ise, başkalarının Müslüman olmasına mani olan kimsedir: \"Allah'ın ayetlerini yalanlayıp onlardan yüz çevirenden daha zalim kimse olur mu?\"(En'am 157) Bu anlattıklarımızdan, karinin fakih'ten daha faziletli olduğu sonucunu Çlkaranlara karşı şunu deriz: Bu, doğru değildir. Çünkü bu hükme muhatab olan sahabe, tabiatıarı gereği fakih idiler. Çünkü onlar, Kur'an'ın nazil olduğu dili iyi biliyorlardı. Selikaları sayesinde Kur'an'ın manasını kendilerinden sonra gelen ve sonradan kazandıkları bir takım yeteneklerle Kur'an'ın manasını anlayan kimselerden daha iyi idrak ediyorlardı. Fıkıh onlar için bir karaktere dönüşmüştü, Onların bu özelliğini taşıyan kimseler, onlarla aynı kategoriye girer. Yoksa okuduğu veya okutluğu ayetlerin manasını hiç anlamayan kar i veya Kur'an öğreten kimseler, sırf bu özelliklerinden dolayı bu sınıfa dahil değildirler. Karinin, cihad, serhatlarda görev yapma ve emr-i bi'l-ma'ruf nehy-i anillmünker yapma gibi İslam dinine daha çok hizmet edenlerden daha faziletli olması gerektiği ileri sürülmüştür. Kanaatimize göre, kimin daha faziletli olduğu çevresine verdiği yararla ölçülür. Kim daha fazla yarar veriyorsa, o daha üstündür",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 5030,
			"arabicnumber": 5030,
			"text": "Sehl İbn Sa'd'dan şöyle rivayet edilmiştir: \"Bir kadın Allah Resulü Sallallahu Aleyhi ve Sellem'e gelip 'Ey Allah'ın Elçisi! Kendimi size hediye etmek için geldim' dedi. Nebi Sallallahu Aleyhi ve Sellem ona baktı ve onu baştan aşağı süzdü. Sonra başını öne eğdi. Kadın, onun kendisi hakkında bir karara varmadığını görünce oturdu. Derken ashabın içinden biri çıkıp 'Ey Allah'ın Elçisi! Eğer ona ihtiyacın yoksa, onu benimle evlendir' dedi. Hz. Nebi Sallallahu Aleyhi ve Sellem 'ona (mehir olarak vereceğin) bir şeyin var mı?' diye sordu. Adam, 'Ey Allah'ın Elçisi!' diye cevap verdi. Bu defa Allah Resulü Sallallahu Aleyhi ve Sellem 'ailene git, bak bakalım bir şey bulabilecek misin?' dedi. Adam ailesinin yanına gitti. Bir müddet sonra döndü ve 'Ey Allah'ın Elçisi! Bir şey bulamadım' dedi. Nebi Sallallahu Aleyhi ve Sellem 'bak bakalım, demirden bir yüzük de olsa yeter' dedi. Adam yine gitti. Bir müddet sonra çıkageldi ve 'bulamadım Ey Allah'ın Elçisi! Ancak şu izarım var' dedi. Sehl dedi ki: Adamın ridası bile yoktu. Sadece üzerinde o gün giyilen elbisenin yarısı (izar) vardı. Hz. Nebi 'izarını ne yapacaksın? Eğer izarını sen giyersen o kullanamaz, yok o giyerse, senin üzerinde bir şey kalmaz' dedi. Adamcağız çöktü kaldı. Uzun süre yerinden kımıIdamadı. Sonra kalktı. Nebi Sallallahu Aleyhi ve Sellem onun arkasını dönüp gittiğini fark etti. Emredip onu çağırttı. Adam gelince 'Kur'an'dan ne biliyorsun?' diye sordu. Adam 'şu, şu sureleri' deyip bildiği sureleri saydı. Bu defa Nebi Sallallahu Aleyhi ve Sellem 'onları ezbere biliyor musun?' diye sordu. Adam 'evet' dedi. Son olarak Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: Hadi git! Bildiğin sureleri ona öğretmen karşılığında, onu sana verdim, (onunla seni evlendirdim}.\" Fethu'l-Bari Açıklaması: İmam Buhari bu konuda kendisini Allah Resulü Sallallahu Aleyhi ve Sellem'e hediye eden kadına ilişkin Sehl'den rivayet edilen hadisi nakletti. Bu hadisin konu başlığı ile ilişkisi gayet açıktır. Çünkü bu hadiste 'onları ezbere biliyor musun?' ifadesi geçmektedir. Bu da, ezbere Kur'an bilmenin faziletini gösterir. Çünkü, ezbere Kur'an bilmek, başkasına öğretmeye zemin hazırlamıştır. İbn Kesir şöyle der: \"İmam Buhari bu hadis ile ezbere Kur'an okumanın Mushaf'a bakarak okumaktan daha faziletli olduğunu kastediyorsa, bu eleştirilir. Çünkü yüzüne Kur'an okumak görerek yapılan bir ameldir. Belki de, hadisteki sahabi yazmayı bilmeyen biriydi. Nebi Sallallahu Aleyhi ve Sellem de onun bu durumunu bilmekteydi. Dolayısıyla bu durum, ezbere Kur'an okumanın okuryazar olan ve olmayan için efdal olduğunu göstermez.\" İmam Buhari bu tür iddialardan hiç birini reddetmemiştir. Çünkü o \"Kur'an'ı Ezbere Okumak\" başlığı ile bunun din tarafından uygun görüldüğünü ve mü stehap bir am el olduğunu ifade etmek istemiştir. Dolayısıyla hadis, kendisi için konan başlığa uygundur. Bunun için ezbere okumanın, yüzüne bakarak okumaktan daha faziletli olduğu tezinden hareketle bu başlık eleştirilemez. Bir çok alim, açıkça mushafa bakarak okumanın ezbere okumadan daha faziletli olduğunu söylemiştir. Ebu Ubeyd \"Fezailu'l-Kur'an\" adlı eserinde İbn Mes'ud kanalıyla mevkuf olarak şu hadisi nakletmiştir: \"Mushafa bakmaya devam ediniz!\" Bu rivayetin isnadı sahihtir. Mana açısından da Mushaf'a bakarak okumak hataya düşmekten daha çok korur. Ancak ezbere okumak riyadan uzak bir davranıştır. Huşo.ıu olmayı sağlar. Doğrusu hangisinin daha efdal olduğu, kişiden kişiye değişir",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 5031,
			"arabicnumber": 5031,
			"text": "İbn Ömer radiyallahu anh'den Resulullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğu rivayet edilmiştir: \"Kur'an'ı ezbere bilen kimsenin durumu, bağlı develeri olan kimseye benzer. Eğer o kimse develerini bağlı tutarsa, onlan kontrol eder, yok eğer serbest bırakırsa onlar dağılır. \" Hadisin geçtiği diğer yer: 5039",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 5032,
			"arabicnumber": 5032,
			"text": "",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 5033,
			"arabicnumber": 5033,
			"text": "Ebu Musa Eş'ari Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmiştir: \"[Ezberleyerek ve tekrar ederek] Kur'an ile muhafaza edin! Hayatım elinde bulunan Allah'a and olsun ki, Kur'an'ın hafızada n çıkması bağlı bulunan develerin boşalıp kaçmasından daha hızlıdır.\" Fethu'l-Bari Açıklaması: .........Kal, devenin dizinden bağlandığı ipe denir. Bu hadiste Allah Resulü Sallallahu Aleyhi ve Sellem Kur'an dersini, onu okumaya devam etmeyi serkeşliğinden endişe edilen devenin bağlanmasına benzetti. Kur'an ile ilişki sürdüğü sürece, onu korumak da devam edecek demektir. Tıpkı devenin ıkal ile bağlı olduğu müddetçe korunduğu gibi. Musa İbn Ukbe'nin Nafi\"den naklettiği rivayette şöyle buyurulmuştur: \"Ezbere Kur'an bilen gece ve gündüz onu okursa hatırlar. Eğer bunu yapmazsa unutur.\" Bu hadis-i şeriflerde, Kur'an'ı sürekli gözden geçirip okuyarak korumak teşvik edilmiştir. Burada yapılan temsiller ise maksadı açıklamak içindir",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 5034,
			"arabicnumber": 5034,
			"text": "Abdullah İbn Muğaffel'in şöyle dediği rivayet edilmiştir: \"Mekke'nin fethedildiği gün Nebi Sallallahu Aleyhi ve Sellem'i gördüm. Devesinin üstünde Fetih suresini okuyordu",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 5035,
			"arabicnumber": 5035,
			"text": "Said İbn Cübeyr'den şöyle söylediği rivayet edilmiştir: \"Sizin mufassal dediğiniz sureler elbette muhkemdir. İbn Abbas şöyle demiştir: Allah Resıılü Sallallahu Aleyhi ve Sellem vefat ettiği zaman ben on yaşında idim. O vakit muhkem (sureleri) okumuştum.\" Hadisin geçtiği diğer yer: 5036",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 5036,
			"arabicnumber": 5036,
			"text": "İbn Abbas'tan rivayet edildiğine göre, o şöyle demiştir: \"Nebi Sallallahu Aleyhi ve Sellem döneminde Muhkem (sureleri) ezberlemiştim.\" [Ravi İbn Cübeyr şöyle demiştir:] \"Ona 'muhkem sureler hangileridir?' diye sordum. O da 'mufassal' diye cevap verdi.\" Fethu'l-Bari Açıklaması: Öyle anlaşılıyor ki, İmam Buhari bu başlık ile çocuklara Kur'an öğretmeyi hoş karşılamayan kimselere cevap vermiştir. Said İbn Cübeyr ve İbrahim enNehai'nin bunu hoş karşılamadığına dair haberler gelmiştir. İbn Ebi Davo.d bu görüşü senedli olarak onlara nispet etmiştir. Buna göre İbrahim şöyle demiştir: \"[Sahabe] Aklı erinceye kadar çocuğa Kur'an öğretmeyi hoş karşılamazd1.\" Said İbn Cübeyr ise, çocukların Kur'an'dan bıkacağı endişesiyle bunu iyi görmediğini söylemiştir. Yine İbn Ebi Davı1d'a göre şöyle demiştir: \"[Sahabe] belli bir müddet sonra çocuğun Kur'an okumasını isterdi.\" Sahih bir senetle nakledilen bir rivayete göre Eş'as İbn Kays, küçük bir çocuğu öne geçirmiş. Bu yüzden çevresindekiler onu ayıplamış. Bunun üzerine o şöyle demiştir: Ben onu değil, Kur'an'ı öne geçirdim. Küçük çocuklara Kur'an öğretmeyi caiz görenler, bunun caiz ve yerleşmiş bir uygulama olduğunu gösteren bu rivayeti delil olarak ileri sürmüşlerdir. Nitekim, küçük yaşta öğrenmek, taş üstüne yapılan nakışa benzer denmiştir. Said İbn Cübeyr'in sözü, kendisinin çocuğun ilk başta serbest bırakılmasını, daha sonra' yavaş yavaş ciddiyete alıştırılmasını müstehap gördüğüne delalet eder. Doğrusu çocuklara nasıl muamele edileceği kişiden kişiye değişir. Sizin mufassal dediğiniz sureler elbette muhkemdir. İbn Abbas şöyle demiştir: Allah Resulü Sallallahu Aleyhi ve Sellem vefat ettiği zaman ben on yaşında idim. O vakit, muhkem sureleri okumuştum. Bu rivayetteki muhkemden maksat, içinde mensuh ayet bulunmayan surelerdir. Aynı zamanda muhkem, müteşabihin zıddı olarak da kullanılır. Bunlar Fıkıh Usulü alimlerinin terminolojisine yerleşmiş iki kavramdır. Mufassaldan maksat ise, fasııaları çok olan Kur'an sureleridir. Sahih olan görüşe göre bunlar, Hucurat'tan başlayıp Nas suresine kadar olan surelerdir",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 5037,
			"arabicnumber": 5037,
			"text": "Aişe r.anha'dan şöyle söylediği rivayet edilmiştir: \" Nebi Sallallahu Aleyhi ve SellemMescid'de bir adamı Kur'an okurken dinledi. Sonra şöyle dedi: Allah falancaya merhametiyle muamele etsin! Zira falanca surenin şu şu ayetini bana hatırlattı",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 5038,
			"arabicnumber": 5038,
			"text": "Aişe r.anha'dan şöyle dediği rivayet edilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem bir gece adamın birini Kur'an okurken dinledi. Sonra şöyle buyurdu: Allah ona merhametiyle muamele etsin! Zira bana, falanca sureden unutturulan şu, şu ayeti hatırlattı",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 5039,
			"arabicnumber": 5039,
			"text": "Abdullah (ibn-i Mes'ud r.a.)'dan rivayet edildiğine göre, o Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu demiştir: \"Birinin 'şu, şu ayeti unuttum' demesi ne kadar da kötü! Aslında o, unutturulmuştur.\" Fethu'l-Bari Açıklaması: Kur'an'ı unutmanın nasıl bir günah olduğu hususunda selef alimleri ihtilaf etmişlerdir. Bazıları, bunu büyük günahlar içinde saymıştır. Ebu Ubeyde Dahhak İbn Müzahim kanalıyla mevkuf olarak şunu nakletmiştir: \"Kur'an'ı öğrenip sonra unutan herkes, kendi işlediği bir günaha düşmüştür. Çünkü Hak Teala şöyle buyurmaktadır: \"Başınıza gelen bütün musibetleri kendi elinizle yaptınız!\"(Şura 30) Kur'an'ı unutmak ise en büyük musibettir.\" Ebu'ı-A.ıiye'den de mevkuf olarak şöyle nakledilmiştir: \"Birinin Kur'an'dan bir bölüm öğrenip sonra onu unutuncaya kadar uyumasını en büyük günahlardan biri olarak kabul ederdik.\" İbn Sırın kanalıyla nakledilen sahih bir rivayete göre ise sahabe, Kur'an'ı unutanıarı sevmez ve onlar hakkında ağır sözler sarfederdi",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 5040,
			"arabicnumber": 5040,
			"text": "Ebu Mes'ud el-Ensari Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu söylemiştir: \"Her kim Bakara Suresi'nin sonunda bulunan iki ayeti bir gecede okursa, bu ayetler ona yeter",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 5041,
			"arabicnumber": 5041,
			"text": "Misver İbn Mahrame ve Abdurrahman İbn Abdulkariyy Ömer (b. el-Hattab)'ı şöyle derken işittiklerini nakletmişlerdir: \"Nebi Sallallahu Aleyhi ve Sellem hayatta iken Hişam İbn Hakim İbn Hizam'ı Furkan suresini okurken işittim. Bir müddet okuyuşuna kulak verdim. Birden onun, Nebi Sallallahu Aleyhi ve Sellem'in bana öğretmediği birçok harf ile Kur'an okuduğunu fark edim. Neredeyse namazda iken yakasına yapışacaktım. Selam verinceye kadar bekledim. Sonra hemen elbisesini boynuna dolayarak onu yakaladut!. Ona, Biraz önce okuduğun ve benim de senden işittiğim sureyi sana kim öğretti diye?' sordum. 'Bana bunu Allah Resulü Sallallahu Aleyhi ve Sellem öğretti' diye cevap verdi. Bunun üzerine 'yalan söylüyorsun! Allah'a and olsun ki, Nebi Sallallahu Aleyhi ve Sellem senden dinlediğim bu sureyi bana da öğretti' dedim. Sonra onu alıp Resulullah Sallallahu Aleyhi ve Sellem'e götürdüm ve: 'Ey Allah'ın Elçisi! Bu adamın Furkan suresini bana öğretmediğin harflerle okuduğunu işittim. Bu sureyi bana sen öğretmiştin' diye şikayette bulundum. Nebi Sallallahu Aleyhi ve Sellem 'Ey Hişam! Oku!' dedi. O da kendisinden işittiğim şekilde okudu. Resulullah Sallallahu Aleyhi ve Sellem 'bu sure bu şekilde nazil oldu' buyurdu. Sonra bana 'Ey Ömer! Sen de oku!' dedi. Ben de bana öğrettiği şekilde okudum. Resulullah Sallallahu Aleyhi ve Sellem yine 'Bu sure bu şekilde nazil oldu' buyurdu. Sonra şöyle dedi: Bu Kur'an yedi harf üzere nazil oldu. Bundan kolayınlza geleni okuyun",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 5042,
			"arabicnumber": 5042,
			"text": "Aişe r.anha'dan şöyle söylediği rivayet edilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem Mescid'de bir gece Kur'an okuyan birini dinledi. Sonra şöyle buyurdu: Allah ona merhametiyle muamele etsin! Zira falanca sureden unuttuğum şu şu ayeti bana hatırlattı. \" Fethu'l-Bari Açıklaması: İmam Buhar! bu başlık ile sureleri isimleriyle birlikte zikretmeyi iyi karşılamayanlara cevap vermek istemiştir. Bunu iyi karşılamayanlar falanca sure ifadesi yerine, şu şu konuların zikredildiği sure demeyi uygun görmüşlerdir. Hac Bölümü'nde şöyle bir rivayet geçmişti: \"A'meş, Haccac İbn Yusuf'un minberde 'şu, şu konuların zikredildiği sure' dediğini işitmiş ve Ebu Mes'Od hadisi ile ona karşı çıkmıştı.\" Kadı [yaz şöyle demiştir: \"Ebu Mes'Od'dan nakledilen hadis, Bakara suresi örneğinde olduğu gibi, sureleri isimleri ile birlikte söyleyenler için delil teşkil eder. Alimler bu konuda farklı yorumlar yapmışlardır. Bazıları bunu caiz görürken, diğer bazıları ise mekruh kabul demiştir. Bunun yerine şu, şu konuların zikredildiği sure denmesini uygun görmüşlerdir.\" Hac Bölümü'nde re my/şeytan taşlama ile ilgili konularda İbrahim en-Nehaı'nin, Haccac'ın \"Bakara suresi demeyin!\" sözünü reddettiği ve ona itirazda bulunduğu nakledilmişti. Müslim'in rivayetinde ise, böyle demenin sünnet olduğu geçmektedir. Ayrıca o Ebu Mes'ud hadisine de yer vermiştir. Delil bakımından bundan daha güçlü olanı, İmam Buharı'nin bizzat Nebi Sallallahu Aleyhi ve Sellem'den naklettiği ifadelerdir. Nitekim bu konuda birçok sahih hadis nakledilmiştir. İmam Nevevı \"el-Ezkar\" adlı kitabında şöyle demiştir: \"Bakara suresi demek caizdir.\" Bu şekilde Ankebut suresine kadar sure isimlerini sıraladıktan sonra \"diğer sureler hakkında da aynı şey geçerlidir. Bu şekilde bir ifade kesinlikle mekruh değildir. Selef alimlerinden bazıları bunun mekruh olduğunu söylemiştir. Ancak doğrusu bunun mekruh olmadığıdır. Nitekim çoğunluk da bu kanaattedir]",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 5043,
			"arabicnumber": 5043,
			"text": "Ebu Vail, Abdullah [İbn Mes'ud]'dan şöyle rivayet etmiştir: \"(Ebu Vail der ki) Bir sabah Abdullah İbn Mes'ud'un yanına gittik. Adamın biri 'dün gece Mufassal sureleri okudum' dedi. Bunun üzerine İbn Mes'ud şöyle dedi: Hızlıca şiir okur gibi mi?! Biz kıraatı dinleyerek öğrendik. Ben uzunluk ve kısalık bakımından birbirine yakın sureleri Nebi Sallallahu Aleyhi ve Sellem okurken ezberledim. Bu surelerin on sekizi Mufassal surelerden, ikisi ise elif lam mım Hamım diye başlayan surelerdendi",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 5044,
			"arabicnumber": 5044,
			"text": "İbn Abbas \"(Resulüm!) Vahyi çabucak okumak için dilini kımıldatma!\"(Kıyame 16) ayeti hakkında şöyle demiştir: \"Nebi Sallallahu Aleyhi ve Sellem, Cebrail A.S. kendisine vahiy getirdiği zaman, vahiyle birlikte dilini ve dudaklarını hareket ettirirdi. Bu durum onun için son derece zordu. Onun bu hali herkes tarafından bilinmekte idi. Derken Allah Teala \"Kıyamet gününe yemin ederim\"(Kıyame 1) diye başlayan suredeki, \"(Resulüm!) Vahyi çabucak okumak için dilini kımıldatma! Şüphesiz onu toplamak ve okutmak bize aittir, ayetlerini indirdi. \"(Kıyame 16-17) Yani bu Kur'anı hafızanda toplamak ve okutmak bize aittir. \"O halde, biz onu okuduğumuz zaman, sen onun okunuşunu takip et!\"(Kıyame 18) Yani biz onu indirdiğimiz zaman, onu dinle! \"Sonra şüphen olmasın ki, onu açıklamak da bize aittir. \"(Kıyame 19) Yani onu senin dilinle açıklamak bize aittir. Bundan böyle Nebi Sallallahu Aleyhi ve Sellem Cebaril aleyhisselam ona geldiği zaman bakışlarını indirip sustu. Cebrall aleyhisseJam gittiği zaman ise tıpkı Allah'ın vad ettiği gibi okudu.\" Fethu'l-Bari Açıklaması: Öyle anlaşılıyor ki, İmam BuhMi, bu başlık ile, tertil ile ilgili ayet in seleften nakledilen tefsirlerine işaret etmiştir. Mesela; İmam Taberi sahih bir senetle Mücahid'den \"Kur'an'ı tane taneterlil ile oku!\" ayetinin tefsiri hakkında şunu nakletmiştir: \"Yavaş yavaş,bir kısmını diğerinin peşinden getir.\" Katade'den de \"tam olarak açıkla!\" yorumunu nakletmiştir. Kur'an'ın tane tane okunması emri her ne kadar farz olmasa da, müstehap bir ameldir. \"Kur'an'ı hızlıca şiir okur gibi okumak mekruhtur.\" Öyle anlaşılıyor ki, İmam Buharı, bu ifade ile tane tane Kur'an okumanın müstehap olmasının hızlı okumanın mekruh olduğu anlamına gelmeyeceğine işaret etmiştir. Çünkü bazı harflerin yutulması veya mahreçlerine uygun telaffuz edilmemesi şeklinde zuhur eden okuma mekruhtur. \"İbn Abbas oI.:J )/feraknahu ifadesini ol:.L,.2j/fessalnahu şeklinde tefsir etmiştir.\" Ebu Ubeyd, Mücahid kanalıyla şu rivayeti nakletmiştir: Adamın biri İbn Abbas'a, aynı sürede kıyam, rukü ve secdede kalan iki adamdan birinin sadece Bakara suresini, diğerinin ise hem Bakara hem de Al-i İmran suresini okuduğunu bildirip bunlardan hangisinin faziletli olduğunu sordu. İbn Abbas, 'sadece Bakara suresini okuyan daha faziletlidir' diye cevap verdikten sonra \"Biz onu, Kur'an olarak, insanlara dıira dura okuyasın diye (ayet ayet, sure sure) ayırdık\"(İsra 106) ayetini okudu.\" Ebu Hamza kanalıyla da şu rivayeti nakletmiştir: \"İbn Abbasla Iben hızlı okuyan biriyim. Üç günde Kur'anlı hatmederiml dedim. Bunun üzerine şöyle dedi: Bakara suresini tane tane ve manalarını düşünerek okumam senin söylediğin gibi okumamdan daha hayırlıdır.\" İbn Ebı Davı.1d başka bir senetle Ebu Hamzaldan şunu nakletmiştir: \"İbn Abbasla 'ben hızlı okuyan biriyim. Kur'anlı bir gecede hatmederiml dedim. Bunun üzerine o, şöyle dedi: [Bir gecede] bir sure okumak benim için daha sevimlidir. İlle de çok Kur'an okuyacaksan, kulaklarının işitip kalbinin de manalarını idrak edeceği tarzda oku!\" İşin özü, hızlı ve yavaş okumanın her birinin kendisine özgü fazileti vardır. Ancak, hızlı okuyanın, mutlaka gerekli olan harf, hareke ve sükunlara riayet etmesi gerekir. Bu okuyuşlardan birinin diğerine üstün veya eşit olması mümteni değildir. Zira yavaş yavaş okuyan kimse, eşsiz bir mücevheri tasadduk etmiş birine benzer. Hızlı okuyan ise, bir çok mücevheri tasadduk edene benzer. Ancak onun tasadduk ettiği mücevherlerin kıymeti, bir eşsiz mücevherin kıymeti kadardır. Bazen de, bir mücevher birçok mücevherden çok daha kıymetli olur. Bazen de bunun tam tersi olur",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 5045,
			"arabicnumber": 5045,
			"text": "Katade'den şöyle dediği rivayet edilmiştir: \"Enes İbn Malik'e Nebi Sallallahu Aleyhi ve Sellem'in nasıl Kur'an okuduğunu sordum. 'İyice uzatarak okurdu' diye cevap verdi.\" Hadisin geçtiği diğer yer: 5046",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 5046,
			"arabicnumber": 5046,
			"text": "Katade'den şöyle dediği rivayet edilmiştir: \"Enes'e 'Nebi Sallallahu Aleyhi ve Sellem nasıl Kur'an okurdu?' diye sordular. O da 'uzatılması gereken yerleri uzatarak okurdu' şeklinde cevap verdikten sonra besmeleyi okudu. بسم الله Bismillahi, الرحمن الرحيم iler-Rahman i ve iler-Rahim kelimelerini uzattı.\" Fethu'l-Bari Açıklaması: Kur'an okurken yapılan uzatma (med) iki türlüdür: a) Asli Med: Kendisinden sonra elif, vav ve ya harflerinden biri gelen harf, bir elif miktarı çekilerek okunur. b) Gayr-i Asli Med: Kendisinden sonra elif, vav ve ya harflerinden birinin geldiği, bunlardan sonra da hemzenin geldiği durumlarda söz konusu olan medde denir. Bu meddin, muttasıl ve munfasıl olmak üzere iki kısmı vardır. Eğer bu bahsettiğimiz durum, aynı kelime içinde olursa buna muttasıl, iki kelime arasında meydana gelirse buna da munfasıl denir. Asli med, elif, vav ve ya harfleri bulunduğu zaman aşırıya kaçmadan bir elif miktarı uzatılarak okunur. Gayr-i asli med ise aşırıya kaçmamak şartı ile bundan daha fazla uzatılır. Normalolan, bu med sayesinde asli meddin iki katı kadar uzatmaktır. Bundan biraz daha fazla uzatılabilir. Ancak bundan daha az uzatılması iyi değildir. Bu konu başlığı ile asli med kastediimiştir",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 5047,
			"arabicnumber": 5047,
			"text": "Abdullah İbn Muğaffel'den şöyle dediği rivayet edilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem'in, devesi üzerinde yolda giderken Kur'an okuduğunu gördüm. Devesiyle ilerlerken Fetih suresini (veya Fetih suresinden bazı ayetleri) yumuşak yumuşak okuyordu. Bu arada terci' yapıyordu.\" Fethu'l-Bari Açıklaması: Terci'; Kur'an okurken hareke türlerinin birbirine yakın olması anlamına gelir. Bu kavramın asıl anlamı, tekrarlamaktır. Sesin terd' edilmesi, boğazda tekrarlanması anlamına gelir. Nitekim ileride Kitabu't-Tevhid'de Abdullah İbn Muğaffel'den nakledilecek hadiste bu şekilde açıklanacaktır. Söz konusu rivayette şöyle geçmektedir: \"Tır önce fethalı hemze, ondan sonra sakin elif, daha sonra ise diğer hemze ... \" Alimler Nebi Sallallahu Aleyhi ve Sellem'in neden böyle okuduğu hakkında iki görüş beyan etmişlerdir: a) Devenin kendisini sarsmasından dolayı böyle okumuştur. b) Meddi yerinde işba' etmiştir. Bu yüzden bu durum meydana gelmiştir. Bu ikinci görüş, hadisin akışına daha uygundur. Çünkü bu hadisin bir rivayetinde \"Eğer insanların başımıza toplanmayacağım bilseydim, size bu şekilde nağmeli okurdum\" şeklinde bir ifade yer almaktadır. Terd' bunun dışındaki yerlerde de sabit olmuştur. Ebu Muhammed İbn Ebı Cemra şöyle demiştir: \"Tercl'; okuyuşu güzelleştirmek demektir, name yaparak şarkı söyler gibi okumak manasına gelmez. Çünkü name yaparak şarkı söyler gibi Kur'an okumak, tilavetin esas gayesi olan huşı.1 ile çelişir.\" Hadisten Çıkarılan Sonuçlar 1- Nebi s.a.v. ibadet halini her zaman sürdürmüştür. Çünkü, deve üzerinde seyir halindeyken bile Kur'an okumakla yapılan ibadetten geri kalmamıştır. 2- Nebi s.a.v.'in açıktan Kur'an okuması, gafilleri uyarmak ve bilmeyenlere öğretmek gayesinin güdüldüğü kimi zamanlarda, ibadetlerin açıktan yapılmasının gizli yapılmasından daha faziletli olduğunu gösterir",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 5048,
			"arabicnumber": 5048,
			"text": "Ebu Musa el-Eş'ari r.a.'den nakledildiğine göre Nebi Sallallahu Aleyhi ve Sellem ona şöyle demiştir: \"Ey Ebu Musa! Sana Davud Nebi'in mizmarından (namelerinden) bir mizmar (name) verilmiştir.\" Diğer tahric edenler: Tirmizi Menakib; Müslim, Salt-ül Müsafirin Fethu'l-Bari Açıklaması: \"Kur'an ile teğanni etmeyen kimse\" başlığı altında güzel sesli kimselerden Kur'an dinlemenin müstehap olduğu konusunda icma bulunduğu nakledilmiştir. İbn Ebi Davı1d İbn Ebi Müseccea kanalıyla şunu nakletmiştir: \"Hz. Ömer, güzel sesli bir genci güzel sesinden dolayı topluluk içinde öne geçirirdi",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 5049,
			"arabicnumber": 5049,
			"text": "Abdullah [İbn Mes'ud]'dan şöyle dediği rivayet edilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem 'bana Kur'an oku!' dedi. Ben hayretle, 'Kur'an sana inmişken ben mi sana Kur'an okuyacağım!' dedim. Bunun üzerine şöyle buyurdu: Kur'an'! başkalarından duymak hoşuma gidiyor.\" Fethu'l-Bari Açıklaması: İbn Battal şöyle demiştir: \"Nebi s.a.v. başkalarından Kur'an dinlemeyi sevmesi, muhtemelen Kur'an'ı arz etmenin sünnet olmasından ileri gelir. Belki de, onu düşünüp iyice anlamak gayesinden kaynaklanır. Çünkü dinleyen daha iyi düşünür. Zira dinleyen, kıraat ve kıraat hükümlerine riayet etmekle meşgulolan okuyandan daha rahat bir konumdadır. Ancak, Hz. Nebi'in Ubey İbn Ka'b'a Kur'an okuması bunun dışındadır. Nitekim bu konu Menakıb bölümünde geçmiştir. Çünkü burada Allah Resıılü Sallallahu Aleyhi ve Sellem ona, nasılokuyacağım, harflerin mahreçlerini nasıl çıkaracağını öğretmek istemiştir. Bu hadisin açıklaması, \"Kur'an Okurken Ağlamak\" başlığı altında yapılacaktır",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 5050,
			"arabicnumber": 5050,
			"text": "Abdullah İbn Mes'ud şöyle demiştir: Nebi Sallallahu Aleyhi ve Sellem: \"Bana Kur'an oku!\" dedi. Ben hayretle, \"Kur'an sana inmişken ben mi sana Kur'an okuyacağım!\" dedim. O da, \"Evet\" dedi. Nihayet en-Ni'sa suresini okumaya başladım. Derken \"Her bir ümmetten bir şahit getirdiğimiz ve seni de onlara şahit olarak gösterdiğimiz zaman halleri nice olacak!\"(Ntsa 41) ayetine geldim. Hesulullah Sallallahu Aleyhi ve Sellem \"Şimdilik yeter\" buyurdu. Ona döndüğüm zaman birden göz yaşlarının boşandığını fark ettim",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 5051,
			"arabicnumber": 5051,
			"text": "Süfyan şöyle demiştir: \"İbn Şübrüme bana şöyle dedi: Bir kişiye ne kadar Kur'an okumanın yeteceği konusunda Kur'an'a baktım, üç ayetten daha az bir sure bulamadım. Ben de ona \"Birinin üç ayetten daha az okuması uygun değildir,\" dedim. Alkame'den şöyle nakledilmiştir: \"Ka'be'yi tavaf ettiği bir sırada Ebu Mesudlla karşılaştım. O, Nebi Sallallahu Aleyhi ve Sellem'in 'her kim Bakara suresinin sonunda bulunan iki ayeti okursa, bu ayetler ona yeter' buyurduğunu zikretti",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 5052,
			"arabicnumber": 5052,
			"text": "Abduııah İbn Amr r.a.'dan şöyle dediği rivayet edilmiştir: \"Babam beni, asil bir aileye mensup bir kadınla evlendirdi. Daima gelinine kocasından memnun olup olmadığını sorardı. O da şöyle derdi: Abdullah erkekler arasında bulunmaz bir adam. Evlendik evleneli yatağımıza hiç basmadı, bir örtüyü de kaldırmış değil. Bu durum bu şekilde uzayınca babam Resulullah Sallallahu Aleyhi ve Sellem'e gidip bu konuyu anlatmış. Bunun üzerine Allah Resulü Sallallahu Aleyhi ve Sellem 'onu benim yanıma getir!' demiş. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem'in yanına gittim. Bana 'nasıl oruç tutuyorsun?' diye sordu. 'Her gün oruç tutuyorum' şeklinde cevap verdim. Bu defa 'Ne kadar zamanda Kur'an'ı hatmediyorsun?' diye sordu. Ben de 'Her gece' diyerek cevap verdim. Buna karşın, 'Her ay üç gün oruç tut ve Kur'an'ı bir ayda hatmet!' buyurdu. Bunun üzerine 'Ben bundan daha fazlasını yapabilirim' dedim. 'O zaman haftada. üç gün oruç tut!' buyurdu. 'Ben bundan da fazlasını yapabilirim' deyince 'Bir gün oruç tut, iki gün tutma!' buyurdu. 'Ben bundan da fazlasını yapabilirim' dedim. Bu defa Allah Resulü Sallallahu Aleyhi ve Sellem şöyle buyurdu: O halde en faziletli oruç olan, Ddvud Nebiin orucunu tut. Bir gün ye, bir gün oruç tut! Kur'an'ı da bir hafta da hatmet! Abdullah İbn Amr şöyle demiştir: Keşke Nebi Sallallahu Aleyhi ve Sellem'in bana verdiği ruhsatı kabul etseydim. Çünkü artık yaşlandım, takatim kalmadı. Abduııah İbn Amr gündüz ailesinden birine Kur'an'ın yedi de birini okurdu. Gece okumak istediği kısmı gündüzün hazırlardı. Böylece gece yükünü hafifletmek isterdi. Oruç için güçlü olmak istediği zaman ise peşpeşe günlerce oruç tutmazdı. Tutmadığı günleri de sayardı. Daha sonra bu günlerin sayısı kadar oruç tutardı. Çünkü o, Hz. Nebi'in vefatından sonra onun zamanında yaptığı amelleri bırakmaktan hoşlanmazdı.\" Ebu Abdillah (İmam Buhari) şöyle demiştir: \"Bazıları üç günde, bazıları bir haftada, bazıları da bir haftadan daha uzun zamanda Kur'an'ın hatmedilebileceğini söylemiştir",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 5053,
			"arabicnumber": 5053,
			"text": "Abdullah İbn Amr'dan şöyle nakledilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem bana 'kaç günde Kur'an'ı hatmediyorsun?' diye sordu",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 5054,
			"arabicnumber": 5054,
			"text": "Abdullah İbn Amr'dan şöyle dediği rivayet edilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem bana 'Kur'an'ı bir ayda hatmet!' dedi. Ben, 'bundan daha fazlasını yapacak güce sahibim' diye karşılık verdim. Nihayet Allah Reslilü şöyle buyurdu: Kur'arı'! yedi günde hatmet! Bundan daha ileri gitme!\" Fethu'l-Bari Açıklaması: \"Evlendik evleneli yatağımıza hiç basmadı\" ifadesi birlikte yatmadık manasına gelir .. \"Bir örtüyü de kaldırmış değil\" ifadesi de, birlikte olmadık anlamınadır. \"Bu durum bu şekilde uzayınca, babam Resulullah Sallallahu Aleyhi ve Sellem'e gidip durumu anlatmış.\" Öyle anlaşılıyor ki, Amr'ın babası, oğlu, hatasını anlayıp telafi eder umuduyla şikayetini geciktirmiştir. Ancak oğlu istikametini değiştirmeyince, eşinin hakkına riayet etmemesi yüzünden günaha düşmesinden endişe ettiği için onu şikayet etmiştir. Bazıları üç günde, bazıları bir haftada, bazıları da bir haftadan daha uzun zamanda Kur'an'ın hatmedilebileceğini söylemiştir. Ebu Davı1d ve Tirmizi sahih olarak Yezid İbn Abdullah İbnü'ş-Şahir kanalıyla Abdullah İbn Amr'dan merfu olarak şu rivayeti nakletmiştir: \"Üç günden daha az bir zamanda Kur'an'ı hatmeden, onu anlayamaz.\" Bu hadisin Said İbn Manslir'un sahih bir senetle İbn Mes'ud'dan nakledilen bir de şahidi vardır: \"Kur'an'ı bir haftada hatmedin! Üç günden daha az bir zamanda onu hatmetmeyin!\" Seleften birçok kimsenin Kur'an'ı bu süreden daha az zamada hatmettikleri bilinmektedir. Bu konuda İmam Nevevı şöyle demiştir: \"Tercih edilen görüşe göre bu durum, kişiden kişiye değişir. Kimin anlayışı yüksek, fikriyatı üst seviyede ise, bu belirtilen sürede Kur'an'ı hatmetmesi müstehap olur. Ancak Kur'an okumanın ana gayesi olan tefekkürü ve bir takım manaları anlamayı ihmal etmemek şartı aranır. Kim de ilim ve diğer dini konularla meşgulse varsa veya Müslümanların genel menfaatiyle ilgileniyorsa, kıraatteki manayı ihlal etmeyeceği sürede Kur'an'ı hatmeder. Bu iki duruma girmeyen kimsenin, bıkkınlığa yol açmayacak derecede mümkün olduğu kadar çok Kur'an okuması müstehaptır. Ancak ne söylediğini bilmeyecek şekilde Kur'an'ı okumamalıdır. Doğrusunu en iyi Allah bilir",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 5055,
			"arabicnumber": 5055,
			"text": "Abdullah'tan şöyle dediği rivayet edilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem 'Bana Kur'an oku!' dedi. Ben hayretIe, Kur'an sana indirildiği halde ben sana Kur'an mı okuyayım?' diye sordum. Buna karşın şöyle buyurdu: Ben onu başkasından duymayı arzu ediyorum.\" Bunun üzerine Nisa suresini okumaya başladım. \"Her bir ümmetten bir şahit getirdiğimiz ve seni de onlara şahit olarak gösterdiğimiz zaman halleri nice olacak!\"(Nlsa 41) ayetine gelince 'yeter' veya 'dur' dedi. Ona baktığım zaman (mübarek) gözyaşlarının aktığını gördüm",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 5056,
			"arabicnumber": 5056,
			"text": "Abdullah İbn Mes'ud'dan şöyle dediği rivayet edilmiştir: \"Allah Resulü Sallallahu Aleyhi ve Sellem bana, 'Bana Kur'an oku!' dedi. Kur'an sana indirildiği halde ben sana Kur'an mı okuyayım?' diye hayretimi ifade ettim. Bunun üzerine şöyle buyurdu: Ben onu başkalanndan işitmeyi seviyorum.\" Fethu'l-Bari Açıklaması: İmam Nevevı \"Kur'an Okunurken Ağlamak\" konusunda şunları söylemiştir: \"Kur'an okurken ağlamak, ariflerin bir özelliği, salihlerin bir alametidir. Nitekim bu konuda Allah TeSIS şöyle buyurmuştur: 'Ağlayarak yüz üstü yere kapanırlar'(İsra ı 109), 'Allah'ın ayet/eri okunduğunda ağlayarak secdeye kapanırlar. '(Meryem 58) Ayrıca bu konuda çok sayıda hadis vardır.\" GazzSl1 şöyle demiştir: \"Kur'an okurken veya okunurken ağlamak müstehaptır. Kişi, Kur'an'da geçen şiddetli tehditleri, vaıdleri, cezaları düşünür ve kendi kusurlarını hatırlar. Bu vesileyle korku ve üzüntü kalbine hakim olduğu için ağlar. Eğer kişinin kalbi bu durumlar karşısında hüzünlenmezse bundan daha büyük musibetten bahsedilemez.\" İbn BattaI şöyle demiştir: \"Hz. Nebi Sallallahu Aleyhi ve Sellem İbn Mes'ud bu ayeti okurken ağlamıştır. Çünkü kıyamet gününün denşetli anları gözünde canlanmıştı. Kendisinin ümmetini tasdik etmesi için şahit olarak getirileceği anı ve oradaki insanlara şefaat isteğinde bulunmasını bir an için yaşıyor gibi olmuştu.\" Öyle anlaşılıyor ki Nebi Sallallahu Aleyhi ve Sellem ümmetine merhametinden dolayı ağlamıştır. Çünkü o, kesinlikle kendisinin ümmetinin amellerine şahitlik edeceğini, onların amellerinin bazen düzgün olmayacağını ve bu yüzden onların cehenneme sürük1eneceklerini biliyordu",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 5057,
			"arabicnumber": 5057,
			"text": "Ali r.a., Allah Resulü şöyle buyururken işittim demiştir: \"Ahir zamanda ömürleri kısa, akıIları kıt bir nesil türeyecek. Mahlukata gönderilmiş sözlerin en hayırlısı hakkında ileri geri konuşacaklar. Okun hedefi delip geçtiği gibi İslam'a girip çıkacaklar. İman onların boğazlarından aşağı inmez. Bu kimselerle nerede karşılaşırsanzz onları öldürün! Onların öldürülmesi, kıyamet günü öldürenler için bir ecir olarak karşılarına çıkar",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 5058,
			"arabicnumber": 5058,
			"text": "Ebu Said el-Hudri Nebi (Sallallahu Aleyhi ve Sellem)'in şöyle buyurduğunu nakletmiştir: \"İçinizden öyle bir topluluk türeyecek ki, onların namazlarına bakınca namazlarınızı, oruçlarına bakınca oruçlarınızı ve diğer amellerine bakınca da amellerinizi küçük göreceksiniz. Onlar Kur'an da okurlar. Ama Kur'an kalplerine inmez. Böyleleri ok'un hedefi delip geçtiği gibi İslam'a girip çıkarlar. Bu şekilde bir ok atan kimse okun temrenine bakar, ama kan namına bir şey göremez. Sapına bakar onda da bir şey göremez. Bir de yelesine bakar, onda da bir emare göremez. Son olarak, acaba av’a dokunmadı mı şüphesiyle fok denen veter medhaline bakar, ancak orada da kan izini göremez",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 5059,
			"arabicnumber": 5059,
			"text": "Ebu Musa el-Eş'arı'den Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğu rivayet edilmiştir: \"Kur'an okuyup onunla amel eden mu'min kimse tadı ve kokusu güzel turunç gibidir. Kur'an okumayıp fakat onunla amel eden mu'min, kokusu olmayan fakat tadı güzel hurmaya benzer. Kur'an okuyan münafık ise, kokusu güzel, tadı acı reyhan (fesleyen) otu gibidir. Kur'an okumayan münafık ise, tadı acı ve kötü, kokusu iğrenç Ebu Cehil karpuzuna benzer.\" Diğer tahric edenler: Tirmizi Emsal; Müslim, Salat-ül Müsafirin Fethu'l-Bari Açıklaması: Dawdi \"İmam Buhari sallallahu a1eyhi ve sellem 'İman onların boğazlarından aşağı inmez' hadisi ile onların Kur'an'dan bir şeye tutunduklarını ifade etmek istemiştir,\" demiştir. Eğer tutunmaktan maksadı Kur'an'ın manasını bilmek değil de ezberlemek ise, kastettiği mana doğrudur. Ancak alimler, bu hadisin akışından burada imanın kalplerine yerleşmediğinin kastedildiği kanaatindedirler. Çünkü boğazda duran, buradan aşağı geçmeyen şey kalbe ulaşamaz",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 5060,
			"arabicnumber": 5060,
			"text": "Cündeb İbn Abdullah'tan Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğu rivayet edilmiştir: \"Kalpleriniz birleştiği sürece Kur'an okuyun! İhtilafa düştüğünüz zaman Kur'an okumaktan uzuklaşın!\" Hadisin geçtiği diğer yerler: 5061,7364,7365 İBN-İ MACE’DEKİ ŞU HADİS’İDE OKUYUN BURAYA TIKLAYIN",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 5061,
			"arabicnumber": 5061,
			"text": "Cündeb'den Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğu rivayet edilmiştir: \"Kalpleriniz onun hakkında birleştiği sürece Kur'an okuyun! İhtilafa düşünce onu okumaktan uzak durun",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 5062,
			"arabicnumber": 5062,
			"text": "Abdullah'tan rivayet edildiğine göre o, bir adamı bir ayeti okurken işitmiş. Ama Nebi Sallallahu Aleyhi ve Sellem'den O ayetin farklı şekilde okunduğunu öğrenmişti. (Abdullah anlatmaya devam ediyor:) Adamın elinden tuttum ve Resulullah Sallallahu Aleyhi ve Sellem'e götürdüm. (Olayı anlatınca Nebi s.a.v. şöyle) buyurdu: \"İkinizin de okuyuşu güzel. Böyle okuyun!\"556 Bildiğim en büyük hakikat onun şöyle buyurduğudur: [İhtilafa düşmeyin!] Zira sizden önceki toplumları ihtilafa düşmeleri helak etmiştir.\" Fethu'l-Bari Açıklaması: \"İhtilafa düşünce\" ifadesi, Kur'an'ın manası hakkında ayrılığa düşünce anlamına gelir. (Kur'an okumaktan uzuklaşın!) Bu ifade, daha fazla ihtilafın derinleşmemesi için ayrılın manasını taşır. Kadı Iyaz şöyle der: Buradaki ihtilaftan korkup Kur'an okumaktan alıkonma hususundaki nehiy muhtemelen Nebi s.a.v.dönemine özgü bir nehiydir. Zira \"Ey İman Edenler! Size açıklanınca üzüleceğiniz bir takım şeyleri sormayınlZ\" ayetinde ifade edildiği gibi, böyle bir ihtilaf, sonunda onları üzecek daha büyük yasakların veya emirlerin inmesinden korkulduğundandır. Zira böyle olaylardan sonra vahyin inme ihtimali her zaman vardı. Kur'an'ı okuyun ve okuduğunuz ayetlerin delalet ettiği ve sizi ona sürüklediği en kuvvetli anlamı kabul ederek aranızdaki görüş farklılıklarını ve yorumlarınızı telif edin. Fakat ayrılıklara yol açacak ve aranızdaki tartışmaları alevlendirecek bir durum ortaya çıkarsa okumayı kesin. O zaman kalplerinizin ülfet etmesi için, muhkem ve kesin olan görüşü tercih edip sizi ayrılığa götürecek müteşabih görüşleri ise terk edin. Cenab-ı Allah'ın şu ayetinin hükmünde olduğu gibi: \"Ondaki müteşabihlere uymaya meyilli olanları gördüğünüzde onlardan kendinizi sakındırınız.\" Diğer bir ihtimal de farzların edasındaki biçimde bir görüş ayrılığı sözkonusu olursa, o zaman okumayı bırakmak gerekir. Böyle bir ihtilaf anında yan yana durmaktan uzaklaşıp herkes kendi başına okumaya devam etsin anlamında söylemiş olması da muhtemeldir. Yukarıda Abdullah İbn Mes'ud ile iki sahabi arasında eda konusunda söz konusu olan ihtilaftan sonra Rasulullah'ın hakemliğine başvurmaları olayında olduğu gibi Hz. Nebi onlara \"hepiniz isabet ettiniz ve güzel yaptınız\" demişti. Bu ve bundan önceki hadiste cemaate ve Müslümanların birliğine teşvik; ayrılık ve ihtilafa düşmekten de sakındırma vardır",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 87
			}
		}
	]
}