{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"70": "Food, Meals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5373,
			"arabicnumber": 5373,
			"text": "Ebu Musa el-Eş'ari r.a.'dan rivayete göre \"Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Aç olana yemek yediriniz. Hasta olanı ziyaret ediniz. Esir olanı da esaretten kurtarınız.\" Süfyan dedi ki: el-'Anı: Esir demektir",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 5374,
			"arabicnumber": 5374,
			"text": "Ebu Hureyre r.a.'den, dedi ki: \"Muhammed Sallallahu Aleyhi ve Sellem'in aile halkı, ruhu kabzedilinceye kadar üç gün (arka arkaya) doya doya yemek yememişlerdir",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 5375,
			"arabicnumber": 5375,
			"text": "Eba. Hureyre'den, dedi ki: \"Aşırı derecede bitkin düşmüştüm. Ömer b. el-Hattab ile karşılaştım. Ondan Allah'ın kitabından bir ayeti bana okumasını istedim. O da evine girdi ve o ayeti bana okuyup hatırlattı. Fazla uzağa gitmeden aşırı bitkinlik ve açlıktan yüzüstü yere düştüm. Ansızın Rasulullah Sallallahu Aleyhi ve Sellem'i başımın ucunda dikilir gördüm. Ey Eba. Hureyre, dedi. Ben: Buyur ey Allah'ın Rasulü, emret dedim. Elimden tuttu, beni ayağa kaldırdı. Benim niçin bu hale düştüğümü anladı. Alıp evine götürdü ve bana büyükçe bir kapta süt getirilmesini emir buyurdu. Ben de ondan içtim. Daha sonra: Tekrar iç ey Eba. Hureyre, diye buyurdu. Ben de tekrar içtim. Arkasından: Tekrar, diye buyurdu. Ben de tekrar içtim. Nihayet karnım düzeldi, hatta bir ok gibi dümdüz oluverdi. Eba. Hureyre devamla dedi ki: Sonra Ömer ile karşılaştım ve ona başımdan geçenleri anlattım, şunları da söyledim: Ey Ömer, bu işi senden daha layık olan bir kimse üstlendi. Allah'a yemin ederim benim senden okumanı istediğim ayeti kerimeyi ben senden daha iyi biliyordum. Ömer dedi ki: Allah'a yemin ederim, seni içeriye almış (ve karnını doyurmuş) olmayı kırmızı develere sahip olmaktan daha çok severim. \" Hadisin geçtiği diğer yerler: 6246 ve 6452 Fethu'l-Bari Açıklaması: \"Tayyibat\" kelimesi \"tayyibe\"nin çoğul u olup, zararı olmayan, temiz, eziyet verici bir yanı bulunmayan ve helal olup kendisinden lezzet alınan şeyler hakkında kullanılır. Yüce Allah'ın şu buyruğu birinci türden olanları söz konusu etmektedir: \"Senden kendilerine neyin helal kılındığını soruyorlar. De ki: Size bütün iyi ve temiz şeyler (tayyibs.t) helal kllındl.' (Maide, 4) Bu ayetin tefsirinde tercih edilen açıklama budur. Eğer maksat helal olsaydı, cevapta sorudan fazlası yer almazdı. Yüce Allah'ın: \"O vakit tertemiz (tayyib) toprakla teyemmüm edin.'(Maide, 6) buyruğu ikinci türdendir. Bugün tayyib bir gündür ve bu tayyib bir gecedir, sözü de üçüncü tür anlama, başlıktaki ikinci ayet dördüncü tür anlama örnektir. Zekat bölümünde bu ayetin tefsirine dair açıklamalarda ticaretten maksadın helal olduğu da geçmiş bulunmaktadır. İbn Battal dedi ki: Tevil bilginleri yüce Allah'ın: \"Ey iman edenler, Allah'ın size helal kıldığı o en temiz ve en güzel şeyleri (tayyibat) haram kllmayın.\"(Maide, 87) buyruğunun kendisine lezzetli yiyecekleri ve mubah lezzetleri haram kılan kimseler hakkında indiği hususunda görüş ayrılığı yoktur. \"Esiri kurtarınız.\" Esiri esaretten kUl-tarınız. \"Aşırı derecede bitkin düşmüştüm.\" Yani açlıktandolayı bu halde idim. Bitkin düşmek anlamında olmak üzere cehd ile cühd lafızlannın kullanıldığına dair açıklama daha önceden geçmiş bulunmaktadır. Maksat zorluk ve meşakkattir. Her şey hakkında kendisine göre söz konusu olur. \"Ondan bir ayeti okumasını istedim.\" Yani yararlanmak amacıyla Kur'an-ı Kerim'in muayyen bir ayetini bana okumasını istedim .. \"Bana bir uss \"büyükçe bir kase\"getirilmesini emir buyurdu.\" \"Ta ki karnım düzeldi.\" Yani sütle dolduğundan dolayı dümdüz oldu. \"Kıdh (ok) gibi.\" Kıdh, tüyü olmayan ok demektir. \"Kırmızı tüylü develer\". Kırmızı tüylü develer, diğer türlere göre daha üstündür",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 5376,
			"arabicnumber": 5376,
			"text": "(Ömer b. Ebi Seleme'den, dedi ki: \"Ben Resulullah Sallallahu Aleyhi ve Sellem'in himayesinde büyüyen küçük bir çocuk idim. Elim de yemek kabında rastgele dolaşır dururdu. Resulullah Sallallahu Aleyhi ve Sellem bana: Ey oğul, Allah'ın adını an, sağ elinle ye ve önünden ye, buyurdu. Bundan sonra da hep bu şekilde yemek yedim.' Hadis'in geçtiği diğer yerler: 5377 ve 5328 Fethu'l-Bari Açıklaması: \"Yemeğe bc.şlamadan besmele çekmek ve sağ el ile yemek.\" Yemeğe başlamadan önce besmele çekmekten kasıt, yemeğin başında \"bismiilah\" demektir. Besmele çekmenin nasılolacağı ile ilgili olarak varid olmuş en sari h rivayet Ebu Davud ile Tirmizi'nin Ümmü Kulsum yoluyla Aişe radıyallahu anha'dan Nebie merfu olarak nakledilmiş şU: hadistir: \"Sizden bir kimse yemek yiyecek olursa bismillah desin. Eğer başlangıcında unutursa o takdirde: \"Bismillahi fi ewelihl ve ahirihl: Başında da, sonunda da bismillah\" desin.\" \"Küçük bir çocuk,\" yani büluğa ermemiş idim.\" \"Rasulullah Sallallahu Aleyhi ve Sellem'in himayesinde\", onun terbiyesi ve gözetimi altında. Rasulullah Sallallahu Aleyhi ve Sellem'ın himayesinde, kendi çocuğunu terbiye eder gibi terbiyesinde ... demektir. \"Elim yemek kabının içerisinde\" yani yemek yerken \"rastgele dolaşır dururdu.\" Elin rastgele dolaşması kabın etrafına, çeşitli yerlerine dalması ve bir tek yere uzanmakla kalmaması demektir. \"Eyoğul! Allah'ın adını an.\" Nevevi dedi ki: Yemeğin başında besmele çekmenin müstehap oluşu üzerinde ilim adamları icma' etmişlerdir. Ancak m\\)stehap oluşu üzerinde icma'ın nakledildiği su götürür. Şu kadar var ki müstehaplıkla tercih edilen fiil olduğu kastedilirse müstesna. Yoksa bir topluluk bunun vacip olduğu kanaatindedir. Bu da sağ elle yemenin vacip olduğu görüşünü kabul etmenin bir gereğidir. Çünkü her ikisi hakkındaki emir kipi aynıdır. \"Sağ elinle ye ve önünden ye.\" Hocamız \"Tirmizi Şerhi\" adlı eserinde şöyle demektedir: Şafii alimlerinin çoğunluğu bunu mendub olarak kabul etmişlerdir. Once el-Gazzali, daha sonra en-Nevevl de bunu bu şekilde ifade etmişlerdir. Ancak Şafı1, er-Risale adlı eserinde ve el-Umm'un başka bir yerinde bunun vacip olduğunu belirtmiş bulunmaktadır. Derim ki: Sağ elle.yemek yemenin vacip oluşuna, sol elle yemek yemeğe dair tehdidin varid oluşu delil teşkil etmektedir. Müslim'in Sahih'inde Seleme b. el-Ekva yoluyla gelen hadiste şöyle denilmektedir: \"Nebi Sallallahu Aleyhi ve Sellem sol eliyle yemek yiyen bir adam gördü. Allah Rasulü: Sağ elinle ye, diye buyurdu. Adam: Yiyemiyorum deyince, Allah Rasulü: Yiyemez olasın diye buyurdu. Ondan sonra elini ağzına kaldıramad!.\" Sol elle yemek yemeyi yasaklayan ve onunşeytanın işi olduğunu belirten hadis, İbn Ömer ve Cabir yoluyla Müslim'de, ayrıca Ahmed'in Müsned'inde hasen bir sened ile Aişe'den diye sabit olmuştur. Aişe radıyallahu anha hadisiNebi efendimize ref ederek şöylece zikretmiştir: \"Sol eliyle yemek yiyen kişi ile birlikte şeytan da yer.\" Nevevi der ki: Bu hadislerden anlaşıldığına göre sağ elle yemek yemek ve içmek müstehap, aynı işi sol el ile yapmak mekruhtur. İbn Ömer yoluyla gelen hadisin bazı rivayet yollarında görüldüğü gibi bütün alıp vermeler de böyledir. EI verir ki (sağ elde) herhangi bir hastalık ya da yara gibi bir mazeret bulunmasın. Eğer böyle bir mazeret varsa mekruhluk yoktur. Nevevi böyle demiştir. Rasu.lullah Sallallahu Aleyhi ve Sellem'in sol eliyle yemek yiyip de mazeret beyan eden ve onun mazeretini kabul etmediğini gösteren bedduasındaki problem ile ilgili olarak da şöyle cevap vermektedir: Iyad bu zatın münafık olduğunu iddia etmiştir. \"Artık bundan sonra hep bu şekilde yemek yedim.\" Yani yemek yiyişim hep böyle oldu. Böyle yemeye davet ettim ve bu benim adetim oldu. Hadisten Çıkarılan Sonuçlar 1- Hadisten anlaşıldığına göre şeytanların ve kafirlerin amellerine benzeyen amellerden sakınmak gerekir. 2- Şeytanın iki eli vardır. Şeytan yer, içer, alır ve verir. 3- Şer'! hükme aykırı hareket eden kimselere beddua etmek caizdir. 4- İyiliği emretmek, münkerden alıkoymak yemek esnasında bile yerine getirilmelidir. 5- Yemek ve içmek adabını öğretmek müstehaptır. 6- EbU. Seleme'nin oğlu Ömer'e ait güzel bir menkıbe söz konusudur. Çünkü Nebiin emrine uymuş ve gereğini hep yerine getirmiştir",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 5377,
			"arabicnumber": 5377,
			"text": "Nebi Sallallahu Aleyhi ve Sellem'in zevcesi Ümmü Seleme'nin oğlu olan Ömer b. Ebi Seleme'den şöyle dediği rivayet edilmiştir: \"Bir gün Rasulullah Sallallahu Aleyhi ve Sellem ile birlikte bir yemek yedim. Tabağın çeşitli yerlerinden yemeğe başlayınca, Rasulullah Sallallahu Aleyhi ve Sellem bana: Önünden ye, diye buyurdu",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 5378,
			"arabicnumber": 5378,
			"text": "Ebu. Nuaym, Vehb b. Keysan'dan, dedi ki: \"Rasulullah Sallallahu Aleyhi ve Sellem ile birlikte (Ümmü Seleme'nin ilk kocasından oğlu olup) himayesinde bulunan Ömer b. Ebi Seleme ile birlikte iken bir yemek getirildi. Allah Rasulü: Allah'ın adını an ve önünden ye, diye buyurdu",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 5379,
			"arabicnumber": 5379,
			"text": "Enes b. Malik r.a.'den şöyle dediği rivayet edilmiştir: \"Bir terzi Rasulullah Sallallahu Aleyhi ve Sellem'i hazırladığı bir yemeğe davet etti. Enes dedi ki: Rasulullah Sallallahu Aleyhi ve Sellem ile birlikte gittim. Onun tabağın çeşitli yerlerindeki kabağı araştırdığını gördüm. Enes dedi ki: İşte o günden bu yana kabağı hep sevmişimdir.\" Fethu'l-Bari Açıklaması: \"Arkadaşı ile birlikte yemek yerken tabağın etrafından yemek araştırmak.\" Tabağın etrafı onun kenarları demektir. \"Arkadaşının bundan hoşlanmadığını ortaya koyan bir belirti yoksa.\" Buhari bu başlık altında Enes r.a.'ın rivayet ettiği Nebi Sallallahu Aleyhi ve Sellem'in tabağın çeşitli yerlerindeki kabağı arayıp bulmasına dair hadisini de zikretmektedir. Bu hadis zahiri itibariyle bundan önce geçen, önündekinden yeme emri ile çatışmaktadır. Buhari bu iki hadisi beraberinde yemek yiyen kimsenin buna razı olduğunu bilmesi halinde caiz olduğunu yorumlayarak, iki hadisi bir arada telif etmiş bulunmaktadır. Hadisten Çıkarılan Sonuçlar 1- Şerefli bir kimsenin bir meslek icra eden kimse ile ve daha başkaları gibi kendinden daha aşağı bir kişi ile yemek yemesi, onun davetini kabul etmesi, hizmetçi ile beraber yemek yemek caizdir. 2- Hadisten Nebi Sallallahu Aleyhi ve Sellem'in ashabına karşı ne kadar alçak gönüllü, onlara karşı ne kadar yumuşak olduğu ve zaman zaman onların evlerine gidip geldiği de anlaşılmaktadır. 3-1\\z dahi olsa yemek için yapılan davete icabet edilir. 4- Misafirler önlerine konulan yemekten birbirlerine ikram edebilirler. Yasak olan, başkasının önündekini kendisi ya da başkası için almaktır. 5- Hayırlı kimselere benzeme ve yemek ve diğer hususlarda onlara uymaya özel gayret ve dikkat gösterilmelidir. 6- Hadiste Enes'in açıkça bir fazileti görülmektedir. Çünkü o insan tabiatıyla alakah olan hususlara varıncaya kadar Nebi Sallallahu Aleyhi ve Sellem'in izinde gitmeye çalışmıştır. Ayrıca bu hususlarda ona tabi olmak için nefsirÜ zorladığı dahi olmuştur. Allah ondan razı olsun",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 5380,
			"arabicnumber": 5380,
			"text": "Şu'be'den, o Eş'as'dan, o babasından, o Mesruk'tan diye rivayet ettiğine göre Aişe rad'yalliıhu anhiı şöyle demiştir: \"Nebi Sallallahu Aleyhi ve Sellem temizlenmesinde, ayakkabısını giyişinde, saçlarını tarayışında gücü yettiğince sağdan başlamayı severdi.\" (Şu'be) bundan önce Vasıt'ta iken: \"Ve bütün işlerinde ... \" ziyadesini de söylemiştir",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 5381,
			"arabicnumber": 5381,
			"text": "Enes b. Malik r.a.'den, diyor ki: \"Ebu Talha, Ümmü Suleym'e: Andolsun Rasulullah Sallallahu Aleyhi ve Sellem'in sesini, sesinden aç olduğunu anlayacağım şekilde oldukça zayıf duydum. Sende yiyecek bir şey var mı, dedi. Ümmü Talha birkaç arpa ekmeği çıkardı. Daha sonra da bir başörtüsü çıkarıp onun bir parçası ile ekmeği sardı. Sonra bu ekmeği elbisemin albna yerleştirdi. Geri kalan kısmı ile de üzerimi rida gibi örttü. Arkasından beni Rasulullah Sallallahu Aleyhi ve Sellem 'e gönderdi. Enes dedi ki: Ekmeği alıp gittim. Rasulullah Sallallahu Aleyhi ve Sellem'i beraberinde insanlar da bulunduğu halde mescidde buldum. Onların başlarında ayakta dikildim. Rasulullah Sallallahu Aleyhi ve Sellem bana: Seni Ebu Talha mı gönderdi, diye sordu. Ben: Evet, dedim. Beraberinde yiyecek bir şey de gönderdi mi, diye sordu. Ben yine: Evet, dedim. Bu sefer Rasulullah Sallallahu Aleyhi ve Sellem beraberinde bulunanlara: Kalkın, diye buyurdu. O yola koyuldu, ben de onların önlerinde gidiyordum. Nihayet Ebu Talha'nın yanına vardım. Ebu Talha: Ey Üm mü Süleym, Rasulullah Sallallahu Aleyhi ve Sellem insanlarla birlikte gelmiş bulunuyor. Yanımızda da onlara yedirecek bir şeyimiz yok, dedi. Ümmü Talha bunun üzerine: Allah ve Rasulü daha iyi bilir, dedi. Enes dedi ki: Ebu Talha yola koyuldu ve nihayet Rasulullah Sallallahu Aleyhi ve Sellem ile karşılaştı. Ebu Talha ve Rasulullah gelip evin içine girdiler. Rasulullah Sallallahu Aleyhi ve Sellem: Ey Ümmü Süleym, yanında ne varsa getir, dedi. Ümmü Süleym de bana verdiği o ekmeği getirdi. Allah Rasulünün emri üzere ekmek doğrandı. Ümmü Süleym de onun üzerine yanındaki bir yağ tulumundan üzerine bir miktar yağ sıktı ve ona katık yaptı. Daha sonra Rasulullah bunun üzerine Allah'ın söylemesini dilediği şeyleri söyledi. Arkasından da: On kişiye içeri girmeleri için izin ver, diye buyurdu. Ebu Talha da onlara izin verdi. Doyuncaya kadar yedikten sonra çıktılar. Arkasından yine: On kişiye izin ver, dedi. Ebu Talha da on kişiye izin verdi. Onlar da doyuncaya kadar yiyip çıktılar. Daha sonra: On kişiye izin ver, dedi. Ebu Talha da onlara izin verdi. Onlar da doyuncaya kadar yiyip çıktılar. Sonra bir on kişiye daha izin verdi. Böylelikle hepsi doyuncaya kadar yemek yediler. Bunlar seksen kişi idiler",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 5382,
			"arabicnumber": 5382,
			"text": "Abdurrahman b. Ebi Bekr r.a.'dan, dedi ki: ''Yüz otuz kişi Nebi Sallallahu Aleyhi ve Sellem ile birlikte idik. Nebi Sallallahu Aleyhi ve Sellem: Sizden birinizin yanında yiyecek bir şey var mı, diye sordu. Bir de baktık ki bir adamın yanında buğday (unu) yahut ona benzer bir sa' kadar bir şey var. Bu hemen yoğuruldu. Daha sonra boylu poslu, saçları uzun ve dağınık müşrik bir adam, önüne katmış olduğu bir koyun sürüsü ile geldi. Nebi Sallallahu Aleyhi ve Sellem: Bunlar satılık mı yoksa bir bağış mı -yahut bir hibe mi- diye sordu. Müşrik: Hayır, bunlar satılıktır, dedi. (Abdurrahman b. Ebi Bekr) dedi ki: Ondan bir koyun satın aldı. Bu koyun pişirildi. Allah'ın Nebisi Sallallahu Aleyhi ve Sellem koyunun siyahının (kara ciğerinin) kızartılmasını emir buyurdu. Allah'a yemin ederim, bu koyunun içindeki siyahtan kendisine parça kesilmedik o yüz otuz kişiden kimse kalmadı. Eğer o kişi orada hazır bulunuyor ise hemen payını ona vermişti. Bulunmuyor ise onun için payını sakladı. Daha sonra yemeği iki kaba koydu. Hepimiz birlikte yedik ve doyduk. Ayrıca iki kapta da bir şeyler arttı. Ben de onu deveye yükledim.\" Ravi: Yahut Abdurrahman b. Ebi Bekı\"in dediği gibi, demiştir",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 5383,
			"arabicnumber": 5383,
			"text": "Aişe r.anha'dan rivayete göre \"Nebi Sallallahu Aleyhi ve Sellem, bizim iki siyah denilen hurma ve sudan doyduğumuz zamanda vefat etti.' Hadis 5442 numara ile gelecektir. Fethu'l-Bari Açıklaması: Ebu Talha'nın kıssasından, misafir kabuleden kimsenin, misafirine ikram olmak üzere evinin kapısına kadar misafirini karşılamasının ziyafet adabından olduğu anlaşılmaktadır. İbn Battal dedi ki: Bu hadislerde doyuncaya kadar yemenin caiz olduğu ve bazen bunu yapmamanın da daha faziletli olduğu anlaşılmaktadır. Taberi ise şöyle demektedir: Şu kadar var ki, doyasıya yemek mubah ise de bunun vardığı bir son nokta olmalıdır. Bundan fazlası ise israftır. Bunun mutlak olarak mubah olan kısmı ise, yemek yiyen kimsenin Rabbine itaatine yardımcı olan ve yemeğin verdiği ağırlıktan ötürü üzerine vacip olan şeyleri eda etmekten geri bırakmayan miktardır",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 5384,
			"arabicnumber": 5384,
			"text": "Suveyd b. en-Numan'dan, dedi ki: Resulullah Sallallahu Aleyhi ve Sellem ile birlikte Hayber'e çıktık. es-Sahba denilen yere varınca -Yahya: Burası Hayber'den yarım günlük uzaklıktadır, demiştir- Resulullah Sallallahu Aleyhi ve Sellem yiyecek bir şey getirilmesini emir buyurdu. Ona sadece sevlk getirildi. Onu ağzımızda evirip çevererek yedik. Daha sonra su aetirilmesini istedi. o da ağzını calkaladı. biz de (Ravilerden) Süfyan (b. Uyeyne) dedi ki: \"Ben bu hadisi ondan (Yahya b. Said'den) önce de, sonra da işittim.\" Fethu'l-Bari Açıklaması: İbn Battal, el-Mühelleb'den şöyle dediğini nakletmektedir: Ayetin Suveyd b. en-Numan'ın rivayet ettiği hadis ile olan ilişkisi, tefsir bilginlerinin zikrettiklerine göre şöyledir: Ashab-ı Kiram, yemek için bir araya geldiklerinde gözleri görmeyeni ayrı bir yerde, topalı ayrı bir yerde, hastayı ayrı bir yerde tutuyorlardı. Buna sebep ise sağlıklı kimselere göre daha ağır yemek yemeleridir. Çünkü onlardan daha çok yemek yiyerek günaha girmekten korkuyorlardı. Bu el-Kelbi'den rivayet edilmiştir. Ata b. Yezid de şöyle demiştir: Gözleri görmeyen bir kimse elini olmadık yere uzatmak suretiyle başkasının yemeğinden yemekten korkuyordu. Topal da aynı şekilde yemek yediği yerde genişçe oturmak ihtiyacını duyardı. Hasta olan kimse de hoş olmayan kokusu ile diğerlerini rahatsız etmekten çekinirdi. Bu ayet-i kerime nazil olarak bunlara başkaları ile birlikte yemek yemelerini mubah kıldı. İşte Suveyd'in rivayet ettiği hadiste ayetin ihtiva ettiği bu mana da söz konusudur. Çünkü onlar hep birlikte ellerini hazırda bulunan azığın içine daldırdılar. Oysa insanların bu husustaki hallerinin farklı oluşu nedeniyle hepsinin eşit yemeleri de imkansız bir şeydir. Şeriat koyucu ise bu husustaki fazlalık ve eksikliğine rağmen bu işi onlara caiz kılmıştır. Bundan ötürü bu şekilde hareket etmek mubahtır. Doğrusunu en iyi bilen Allah'tır. İbn Battalın açıklamaları burada sona ermektedir. İbnu'l-Müneyyir dedi ki: Başlık ile uygunluğu ayetin ortasındaki ifadelerdir. O da yüce Allah'ın: \"Ve sizin için topluca yahut ayrı ayrı yemenizde de bir vebal yoktur. \"(Nur, 61) buyruğudur. Bu buyruk herkesin yanında bulunanı ortaya koymak suretiyle yemek yemenin caiz oluşunda da asıl bir delildir. Bundan dolayı Buhari başlıkta herkesin yanında bulunanı ortaya koyması suretiyle yemek yemek demek olan \"en-nihd\"i söz konusu etmiştir. Doğrusunu en iyi bilen Allah'tır",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 5385,
			"arabicnumber": 5385,
			"text": "Katade'den, dedi ki: \"Enes r.a.'in yanında idik. Huzurunda onun ekmek pişiricisi de vardı. Enes dedi ki: Nebi Sallallahu Aleyhi ve Sellem Allah'ın huzuruna varıncaya kadar ne inceltilmiş ekmek yedi, ne de közde kızartılmış koyun kebabı yedi. \" Bu Hadis 5421 ve 6357 numara ile de var",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 5386,
			"arabicnumber": 5386,
			"text": "Enes r.a.'dan, dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem'in küçük tabakta yemek yediğini de, inceltilmiş yufka ekmeği yediğini de, bir masa üzerinde yemek yediğini de asla bilmiyorum. Katade'ye: Peki neyin üzerinde yemek yerlerdi diye soruldu. Katade: Sofralar üzerinde diye cevap verdi. \" Bu Hadis 5415 ve 6450 numara ile gelecektir",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 5387,
			"arabicnumber": 5387,
			"text": "Enes r.a.'den, dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem (Hayber dönüşü) ikamet etti ve Safiye ile zifafa girdi. Ben de Müslümanları düğün yemeğine davet ettim. Nebi Sallallahu Aleyhi ve Sellem sofraların açılmasını emretti, sofralar yayıldı. Sofralara hurma, keş ve yağ bırakıldı.\" Amr da, Enes'den rivayetle şöyle demiştir: \"Nebi Sallallahu Aleyhi ve Sellem Safiye ile zifafa girdikten sonra deriden sofralar üzerinde Hays denilen yemeği yaptı",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 5388,
			"arabicnumber": 5388,
			"text": "Vehb b. Keysan'dan, dedi ki: \"Şam halkı İbnu'z-Zubeyr'i ayıplayarak: Ey iki kuşaklı kadının oğlu, diyorlardı. (Annesi) Esma ona dedi ki: Oğlum, onlar seni iki kuşak ile ayıplıyorlar. Bu iki kuşağın ne olduğunu biliyor musun? Bu benim bir kuşağımdı. Ben onu ortadan ikiye ayırdım ve onlardan birisi ile Rasulullah Sallallahu Aleyhi ve Sellem'in kırbasının ağzını bağladım, diğeri ile de azığının bulunduğu sofrasını bağladım.\" Vehb b. Keysan dedi ki: \"Daha sonra Şam halkı onu iki kuşak ile ayıpladıkları vakit şöyle derdi: ilahıma yemin ederim ki doğru söylüyorsunuz. \"Bu ayıbı senden uzak bir çirkinliktir\" diyor (ve Ebu Zuheyb ez-Zühell'nin bu mısraını okuyor)du",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 5389,
			"arabicnumber": 5389,
			"text": "İbn Abbas'tan rivayete göre \"İbn Abbas'ın teyzesi olan el-Haris b. Hazm'in kızı Ümmü Tufeyl, Nebi Sallallahu Aleyhi ve Sellem'e bir miktar tereyağı, keş ve birkaç keler hediye etmişti. O da bunların getirilmesini emir buyurdu. Sofrası üzerinde bunlar yenildi. Nebi Sallallahu Aleyhi ve Sellem. onlardan tiksinmiş gibi o kelerleri yiyemedi. Eğer kelerlerin yenilmesi haram olsaydı, Nebi Sallallahu Aleyhi ve Sellem'in sofrası üzerinde bunlar yenilmez ve yenilmelerini de emretmezdi.\" Fethu'l-Bari Açıklaması: \"İnceltilmiş ekmek ve masa üstünde ve sofrada yemek yemek.\" İnceltilmiş ekmek ile ilgili olarak Iyad şunları söylemektedir: İnceıtilmiş ekmektenmaksat, beyaz ekmek ve benzeri ekmekler gibi yumuşatılmış, güzelleştirilmiş ekmek demektir. İnceltmek (terklk) yumuşatmak anlamındadır. Çünkü o dönemde Araplarda elek yoktu. İnceltilmiş (anlamındaki murakkak) lafzı bazen ince ve geniş ekmek anlamına da gelir. İbnu'l-Cevzl de şöyle demiştir: Bu, hafif olan ekmek anlamındadır. Kendisi ile (hamurun) inceltildiği tahta (merdane) olan er-Rikak'tan alınmış gibidir. Masa, üzerinde yemek bulunmayan, yemek yenilen araçtır. Sofra ise üzerinde yemek konulan örtü hakkında kullanılması meşhurdur, ama asıl anlamı yemeğin kendisidir. \"Enes'in ekmek pişiricisi yanında iken biz de Enes'in yanında idik.\" Taberanı'de Raşid b. Ebi Raşid yoluyla şöyle dediği rivayet edilmiştir: \"Enes'in kendisine bazı kurutmalar yapan, on iki tür yemek pişiren ve ona elenmiş undan ekmek pişirip tereyağı ile yoğuran bir kölesi vard!.\" Elenmiş un (el-huvarı) ardı arkasına defalarca elenen has un demektir. \"Nebi Sallallahu Aleyhi ve Sellem ne inceltilmiş ekmek, ne de közde kızartılıp kebap yapılmış koyun yedi.\" el-Mesmut (közde kızartılıp kebap yapılmış), sıcak su ile tüyleri izale edildikten sonra derisi ile közde pişirilen ya da tencerede haşlanarak pişirilen ete denilir. Bu şekildeki pişirme, körpe ve yaşı küçük olanlar için söz konusudur. Böyle bir iş iki bakımdan mutı'ef (varlıklı ve rahat) yaşayan kimselerin işlerindendir. Birincisi eğer hayatta kalacak olsaydı, değeri artacak olan bir hayvanı erken dönemde kesmektir. İkincisi ise derisi soyulan bir hayvanın postundan giyecek olarak ya da başka bir şekilde yararlanılır. Ancak bu şekilde pişirmek deriyi kullanılmaz hale getirir. İbn Battal el-Masmut'un közde kızartılarak pişirilmiş olduğu kanaatini kabul etmiştir. \"Sukurruce'de\" İbn Mekkl der ki: Sukurruce, içinde yemek yenen küçük kaplara denilir. Hocamız da \"TirmiziŞerhi\" adlı eserinde şunları söylemiştir: Nebi efendimizin sukurruce (denilen küçük tabaklarda) yemek yememesi ya o dönemde onların beldesinde bunların yapılmayışından dolayıdır yahut bu kapları küçük bulduğundan ötürüdür. Çünkü yemek etrafında bir araya gelip toplanmak onların adeti idi. \"Hişam, babasından ve Vehb b. Keysan'dan.\" Buradaki İbnu'z-Zubeyr, Abdullah b. ez-Zubeyr'dir. Şam ehlinden maksat ise Haccac b. Yusufun askerleridir. Onlar Abdulmelik b. Mervan tarafından görevlendirilmişlerdi ve onunla savaşıyorlardı. Yahut daha önce Yezid b. Muaviye'nin emri üzere onunla savaşmış bulunan el-Husayn b. Numeyr'in askerleri de olabilirler. \"Ben kuşağımı ortadan ikiye böldüm ve bir parçası ile kırbasının ağzını bağladım.\" Medine'ye hicret bahsinde Ebu Bekr es-Sıddık'ın Nebi Sallallahu Aleyhi ve Sellem ile birlikte Medine'ye hicret ettiğinde bunu böyle yapmasını em rettiği geçmiş bulunmaktadır. \"Bu ayıbı, senden uzak bir çirkinliktir.\" Buradaki \"şekat (çirkinlik)\" çirkin bir sözü yüksek sesle söylemek demektir. Zahir lafzı ise uzak anlamındadır. el-Hattabı dedi ki: Yani bu, senden kaldırılmış bir çirkinliktir. Dolayısıyla bunun seninle ilgisi yoktur",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 5390,
			"arabicnumber": 5390,
			"text": "Suveyd b. en-Numan'dan rivayete göre \"es-Sahba denilen yerde Nebi Sallallahu Aleyhi ve Sellem iie birlikte idiler. -Burası Hayber'den yarım gün uzaklıkta bir yerdir.- Namaz vakti girdi. Nebi yiyecek bir şeyler getirilmesini emir buyurdu. Sevikten başka bir şey getirilmediğini gördü. Ondan bir kısmını alıp ağzında evire çevire çiğnedi. Biz de onunla birlikte (onu) ağzımızda çiğnedik. Daha sonra su getirilmesini söyledi ve ağzını çalkaladı. Arkasından abdest almaksızın namaz kıldı, biz de kıldık",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 5391,
			"arabicnumber": 5391,
			"text": "İbn Abbas'tan rivayete göre, kendisine Allah'ın kılıcı (Seyfullah) denilen Halid b. el-Velid'in haber verdiğine göre o (Halid), Rasulullah Sallallahu Aleyhi ve Sellem ile birlikte Meymune'nin huzuruna girdi -ki bu Meymune hem Halid b. el-Velid'in, hem İbn Abbas'ın teyzesi idi- onun yanında kızartılmış keler buldu.!. Bu keleri Necid'den Meymune'nin kız kardeşi el-Haris'in kızı Hufeyde getirmişti. Keleri Rasulullah Sallallahu Aleyhi ve Sellem'in önüne getirip koydu. Rasulullah Sallallahu Aleyhi ve Sellem'e o yemekten söz edilip, adı söylenmedikçe yiyecek bir şeye elini uzattığı çok nadir idi. Resulullah elini kelere uzattı. Orada hazır bulunan kadınlardan birisi: Rasulullah Sallallahu Aleyhi ve Sellem'e takdim ettiğinizin ne olduğunu haber veriniz, dedi. Onlar da: O kelerdir, ey Allah'ın Rasulü deyince. Rasulullah Sallallahu Aleyhi ve Sellem kelerden elini çekti. Halid b. el-Velid: Ey Allah'ın Rasulü, keler haram mıdır, diye sordu. Allah Rasulü: Hayır. Fakat bu benim kavmimin yaşadığı bölgede yoktu. Ondan tiksindiğimi hissediyorum, dedi. Halid dedi ki: Rasulullah Sallallahu Aleyhi ve Sellem bana bakıp dururken o keleri ben önüme çekip yedim. \" Bu Hadis 5400 ve 5537 numara ile gelecektir",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 5392,
			"arabicnumber": 5392,
			"text": "Ebu Hureyre r.a.'dan, dedi ki: \"Rasulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: İki kişinin yemeği üç kişiye, üç kişinin yemeği de dört kişiye yeter.\" Fethu'l-Bari Açıklaması: \"Bir kişinin yemeği iki kişiye yeter.\" Cerir'den şöyle dediği nakledilmiştir: Hadis, bir kişiyi doyuran bir yemeğin iki kişinin açlığını giderebileceği manasınadır. İki kişilik yemek de dört kişinin açlığını giderir. el-Mühelleb dedi ki: Bu hadislerle, fazilete ve yetecek kadarı ile kanaat etmeye teşvik kastedilmektedir. Yoksa bundan maksat, yeterli olan miktarın münhasıran tespiti değildir. Maksat başkalarının görüp gözetilmesi gereğini anlatmak ve yemeği olan iki kişinin hazır bulunanlara göre yemeklerine üçüncüsünü, gerekirse de dördüncüsünü katmaya teşvik etmektir. İbn Mace'deki Ömer yoluyla gelen hadiste şu lafız ile zikredilmiştir: \"Bir kişinin yemeği iki kişiye yeter. İki kişinin yemeği üç kişiye ve dört kişiye yeter. Dört kişinin yemeği de beş kişiye ve altı kişiye yeter.\" Abdurrahman b. Ebi Bekr'in rivayet ettiği hadiste Ebu Bekr'in misafirleri ile ilgili kıssada da şu ibareler yer almıştır: \"Nebi Sallallahu Aleyhi ve Sellem şöyle . buyurdu: Kimin yanında iki kişilik bir yemek varsa üçüncü bir kişiyi alıp gitsin, kimin yanında dört kişilik yemek varsa beşincisini ya da altıncısını alıp gitsin.\" Taberani'de İbn Ömer yoluyla gelen hadis de bundaki illetin ne olduğuna işaret vardır. Hadisin baş tarafları şöyledir: Hep birlikte yiyiniz ve dağılmayınız. Çünkü bir kişinin yemeği ikikişiye yeter.\" İşte bu hadisten, yetecek miktarın aslında toplu olmak bereketinden ileri geldiği anlaşılmaktadır. Topluluk ne kadar çoğalırsa, bereket de o kadar artar. Tirmizi de İbn Ömer'in hadisine işaret etmiş, ayrıca el-Bezzar da Semura'dan, Ömer'in rivayet ettiği hadise yakın bir hadis nakletmiş, sonunda da \"ve Allah'ın eli cemaatin üzerindedir\" fazlalığını da kaydetmiştir. İbnu'l-Münzir de şöyle demektedir: Ebu Hureyre'nin hadisinden yemeklerin topluca yenilmesinin müstehap olduğu ve kişinin tek başına yemek yememesi gerektiği anlaşılmaktadır. Yine hadiste başkasının gözetilmesi halinde bereketin de elde edileceğine ve hazır bulunanların hepsini kapsayacağına işaret vardır. Ayrıca hadisten, kişinin yanında bulunan yiyeceği küçümseyerek onu misafirlerin önÜne koymaktan çekinmemesi gerektiği de anlaşılmaktadır. Çünkü az bir miktar ile dahi yetinmek mümkün olabilir. Yani kişi bu yolla açlığını giderebilir ve bünyesinin de ayakta durmasını sağlayabilir, yoksa gerçek manada tokluk olmayabilir",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 5393,
			"arabicnumber": 5393,
			"text": "Nafi'den, dedi ki: \"İbn Ömer, yanına onunla birlikte yemek yiyecek bir yoksul getirilmedikçe yemek yemezdi. Bir gün onunla beraber yemek yesin diye bir adamı içeriye aldım. Adam çok fazla yemek yedi. İbn Ömer: Ey Nafi bu adamı bir daha yanıma sokma, dedi. Çünkü ben Nebi Sallallahu Aleyhi ve Sellem'i: Mu'min tek bir bağırsağı doldurmak için yer, katir ise yedi bağırsağı doldurmak için yer, diye buyururken dinledim. \" Bu Hadis 5394 ve 5395 numara ile gelecektir",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 5394,
			"arabicnumber": 5394,
			"text": "İbn Ömer r.a.'dan: \"Raslilullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: Şüphesiz mu'min tek bir bağırsağı doldurmak için yer, kafir --yahut münafık, Ubeydullah'ın hangisini söylediğini bilmiyorum-- ise yedi bağırsağı doldurmak için yer",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 5395,
			"arabicnumber": 5395,
			"text": "Amr'dan, dedi ki: \"Ebli Nehik çok yemek yiyen birisi idi. İbn Ömer ona dedi ki: Raslilullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: Şüphesiz kafir yedi bağırsağı doldurmak için yer. Ebu Nehik: Ama ben Allah'a ve Rasulüne iman ediyorum, diye cevap verdi",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 5396,
			"arabicnumber": 5396,
			"text": "Ebu Hureyre r.a.'dan, dedi ki: Rasulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Müslüman tek bir bağırsakta yer, kafir ise yedi bağırsakta yer.\" Bu Hadis 5397 numara ile gelecektir",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 5397,
			"arabicnumber": 5397,
			"text": "Ebu Hureyre r.a.'den rivayete göre \"Bir adam çokça yemek yerdi. Müslüman olduktan sonra çok az yemek yemeğe başladı. Bu durum Nebi Sallallahu Aleyhi ve Sellem'e aktarılınca o: Mu'min tek bir bağırsak için yer, kafir ise yedi bağırsak için yer, diye buyurdu.\" Fethu'l-Bari Açıklaması: \"Ben Allah'a ve Rasulüne iman ediyorum, dedi.\" Bundan dolayı ilim adamları hadisi ileride açıklaması geleceği üzere zahirinden anlaşılan bir başka anlama yorumlamakta ittifak etmişlerdir. Hadisin ne anlama geldiği hususunda görüş ayrılığı vardır. Zahirinden anlaşılanın kastedilmediği ama asıl maksadın, mu'minin dünyadaki zahidliğini, kafir'in de dünyaya karşı tutkusunu bir örnekle açıklamak olduğu söylenmiştir. mu'min kimsenin dünyadan az nasip almak istemesi dolayısıyla o tek bir bağırsak için yemek yer. Kafir ise dünyaya şiddetli şekilde bağlı ve istekli olduğundan, çokça dünyalığa sahip olmak istediğinden yedi bağu'sak için yer (gibidir). Yoksa maksat gerçek manasıyla bağırsaklar da değildir, özelolarak yemeğin miktarı da değildir. Maksat sadece birisinin dünyadan az bir şeyleralmaya çalıştığını, diğerinin ise olabildiği kadar çok almaya gayret ettiğini anlatmaktır. Sanki dünyayı ele geçirme isteğini yemek ile bunun sebep ve yollarını da bağırsaklar ile ifade etmiş gibidir. Aradaki ilişki de açıkça anlaşılmaktadır. Anlamın şöyle olduğu da söylenmiştir: mu'min helal yer, kafir ise haram yer. Varlık aleminde helal olan şeyler ise haramlardan daha azdır. Bu açıklamayı da İbnu't-Tin nakletmiştir. Maksadın, mu'minin çok yemek yemenin, kafirin niteliği olduğunu bilmesi halinde az yemek yemeye teşvik edilmesi olduğu da söylenmiştir. Çünkü mu'minin kendisi kafirin niteliğine sahip olmaktan nefret eder. Çok yemek yemenin kafirlerin niteliğinden olduğuna yüce Allah'ın şu buyruğu da•delil teşkil etmektedir: \"Kafirler ise, onlar faydalanırlar ve davarların yediği gibi yerler.''(Muhammed, 12) Aksine, hadis zahiri üzeredir de denilmiştir. Daha sonra bu görüşte olanlar farklı açıklamalarda bulunmuşlardır. Birinci açıklamaya göre hadis muayyen bir şahıs hakkında varid olmuştur. \"Kafir\" lafzının başındaki lam, cins için değil, ahi d içindir. Bu görüşü İbn Abdilben- kesin bir ifade ile dile getirerek şöyle demiştir: Hadisin genelolarak yorumlanmasına imkan yoktur. Çünkü müşahede böyle bir anlamı kabil değildir. Nice kafirler vardır ki mu'minden daha az yemek yer, aksi de söz konusudur. Nice kafir vardır ki Müslüman olduktan sonra yediği yemek miktarında bir değişiklik olmamıştır. İkinci görüşe göre ise hadis, çoğunlukla görülen için variddir. Gerçek sayı da kastediimiş değildir. Bunlar yedi sayısının çokluğu anlatmak için özelolarak kullanılan bir mübalağa kipi olduğunu söylemişlerdir. Yüce Allah'ın: \"Deniz de ardından yedi deniz daha ona (mürekkep olup) katılsa ... \"(Lukman, 27) buyruğunda olduğu gibi. Yani mu'minin özelliği az yemek ile yetinmektir. Çünkü o ibadetin sebepleri olan şeylerle meşguldür. Diğer taraftan şeriatın yemekten kastı, açlığı gidermek, insanın bünyesini ayakta tutmak, ibadete yardımcı olmak olduğunu bilir. Ayrıca daha fazla yemesi halinde hesaba çekilmekten de korkar. Kafir ise tamamen farklı bir durumdadır. O, şeriatın maksadının durduğu yerde durmaz. Bilakis kafir nefsinin, şehvetinin peşinden gider ve haramın sorumluluklarından korkmaksızın arzu ve isteklerini alabildiğine yerine getirmeye çalışır. Böylelikle mu'minin -sözünü ettiğimiz sebepler dolayısıyla- kafirin yediklerine nispet edilmesi halinde, onun yediği miktarın yedide biri gibi görülür. Fakat bu her mu'min ve kafir hakkında genelolarak böyle olmasını gerektirmez. mu'minler arasında ya adeten yahut dahili bir hastalık sebebiyle ya da bir başka sebep dolayısıyla arızı bir durumdan ötürü çokça yiyebilenler olabilir. Kafirler arasında da ya doktorların görüşlerine uygun sağlığına riay.et yahut rahiplerin görüşlerine uygun riyazet amacı ile az yemek yiyen bulunabilir ya da midenin güçsüzlüğü gibi arızi bir sebeple az yiyebilir. et-TIb! dedi ki: Sözün özü şudur: Zühde yönelmek ve açlığı giderecek kadarına kanaatgöstermek tutkusu, kafirin aksine mu'minin şanındandır. Eğer bu niteliğe uymayan bir mu'min ya da bir kafir bulunacak olursa bundan hareketle hadisin tenkidi cihetine gidilemez. Üçüncü görüşe göre bu hadiste mu'minden kasıt, imanı tam mu'mindir. Çünkü Müslümanlığı güzel, imanı kamilolan bir kimsenin düşüncesi, sonunda karşı karşıya kalacağı ölüm ile ölümün sonrası ile meşgul olur. Bu şekilde ileri derecedeki korkusu, çokça tefekkürü ve nefsine karşı şefkati, arzu ve isteklerinin tamamını yerine getirmesine engel olur. Aç gözlülük ise kafirin şanındandır. Bundan dolayı o, hayvanın yediği gibi saldırırcasına yer. Bünyesini ayakta tutmak için gözettiği bir masıahattan ötürü yemez. Ancak el-Hattabi bu açıklamayı kabul etmeyerek şöyle demiştir: Seleften faziletli birçok kimsenin çok yemek yediği nakledilmiştir. Bu imanlarında bir eksiklik meydana getirmemiştir. Dördüncü görüşe göre ise maksat şudur: mu'min yemek yerken, içerken A1lah'ın adını anar. Bundan dolayı şeytan ona ortak olmaz ve az bir şey ona yeterli gelir. Kafir ise besmele çekmez. Bu sebeple şeytan -önceden de açıklandığı üzere- ona ortak olur",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 5398,
			"arabicnumber": 5398,
			"text": "Ebu Cuhayfe'den, dedi ki: \"ResuluIlah Sallallahu Aleyhi ve Sellem: Şüphesiz ki ben, bir yanıma yaslanarak yemek yemem, diye buyurdu. \" Bu Hadis 5399 numara ile gelecektir",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 5399,
			"arabicnumber": 5399,
			"text": "Ebu Cuhayfe r.a.'den, dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem'in yanında bulunuyordum. Huzurunda bulunan bir adama: Ben bir yanıma yaslanmış olduğum halde yemek yemem, dedL\" Fethu'l-Bari Açıklaması: \"Bir yanı üzere yaslanarak yemek yemek.\" Yani bu şekilde yemek yemenin hükmü nedir? Buhari bu hükmü kat'i bir dille ifade etmemiştir. Çünkü bu hususta açık bir nehy gelmemiştir. \"Şüphesiz ki ben bir yanıma yaslanarak yemek yemem.\" İbnu'l-Cevzı \"yaslanma\"yı açıklarken, kesin olarak yanlarından bir tarafa doğru meyletmek olduğunu açık bir dille ifade etmiştir. İbnu'l-Esir de en-Nihaye adlı eserinde yaslanmayı, yanlarından bir tarafına meyletmek diye açıklayanların bu durumda yemeğin mecralarından kolaylıkla geçemeyeceğini, onu hazmedemeyeceğini hatta ondan rahatsız dahi olabileceğini söyleyerek açıklayan tıbbi görüşlere göre yorumladığını nakletmiş bulunmaktadır. Selef, yaslanarak yemek yemenin hükmü hakkında farklı görüşlere sahiptir. İbn el-Kass'ın iddiasına göre bu (bu şekilde yemek yememek) nebevi hususiyetlerdendir. Ancak el-Beyhakı buna şöyle karşılık vermektedir: Böyle yemek yemek başkası için de mekruh olabilir. Çünkü bu kendisini büyük gösterenlerin yaptığı işlerdendir. Bu da esasen Acem krallarından alınmış bir davranış tarzıdır. Eğer kişinin bir engeli bulunup da ancak yaslanarak yemek yiyebiliyorsa bunda bir kerahet yoktur. İbn Ebi Şeybe, İbn Abbas, Halid b. el-Velid, Abıde es-ı Muhammed b. Slrln, Ata b. Yesar ve ez-Zühri'den bu şekilde yemek yemenin mutlak olarak caiz olduğuna dair rivayetler nakletmiştir. Eğer bunun mekruh ya da evla olanın aksi olduğu sabit ise, yemek için oturmanın müstehap şekli, diz kapaklan ve ayaklarının yüzü üzerine oturması yahut sağ ayağını dikip, sol ayak üzerine oturmasıdır. Mekruhluğun illeti hususunda da görüş ayrılığı vardır. Bu konuda varid olmuş en güçlü rivayet, İbn Ebi Şeybe'nin, İbrahim en-Nehaı yoluyla naklettiği şu sözüdür: \"Selef, göbekleri büyür korkusu ile yaslanarak yemek yemekten hoşlanmazlardJ",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 5400,
			"arabicnumber": 5400,
			"text": "Halid b. el-Velid'den, dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem'e kızartılmış bir keler getirildi. Yemek için ona doğru elini uzatınca, ona: O bir kelerdir, denildi, o da elini geri çekti. Halid: O haram mıdır diye sordu, Allah Rasulü: Hayır, ama benim kavmimin topraklarında bu olmazdı. Kendimi ondan tiksiniyar buluyorum, dedi. Rasulullah Sallallahu Aleyhi ve Sellem'in gözü önünde Halid (o keleri) yedi.\" Malik, İbn Şihab'dan şöyle dediğini nakletmektedir: \"(Kızarmış keler anlamındaki): \"Bidabbin meşvı\" yerine (aynı anlamda) \"bidabbin mahnCrz\" demiştir",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 5401,
			"arabicnumber": 5401,
			"text": "İbn Şihab'dan, dedi ki: Bana Mahmud b. er-Rebi el-Ensari'nin haber verdiğine göre ''Itban b. Malik -ki Nebi Sallallahu Aleyhi ve Sellem ashabından olup, ensardan Bedir'de hazır bulunanlardan idi- Rasulullah Sallallahu Aleyhi ve Sellem'in huzuruna vararak: Ey Allah'ın Rasulü dedi. Artık ben gözlerimi tanıyamaz oldum (gözlerim pek iyi görmüyor), üstelik ben kavmime namaz kıldınyorum. Yağmur yağdı mı benimle onlar arasındaki vadi selolup taşıyor ve onların mescidlerine gidip, onlara namaz kıldıramıyorum. Bu sebeple ey Allah'ın Rasulü, senin,şeref verip evimde namaz kılmanı ve orayı da namaz kılacağım yer edinmey{ arzu ediyorum, dedim. Allah Rasulü de: İnşallah dediğini yapacağım, diye buyurdu. Itban dedi ki: Ertesi sabah gün yükseldiğinde Rasulullah Sallallahu Aleyhi ve Sellem ile Ebu Bekir geldiler. Nebi Sallallahu Aleyhi ve Sellem izin istedi, ben de ona izin verdim. Oturmayıp, içeri girdi. Sonra bana: Evinin neresinde namaz kılmamı arzu edersin, diye sordu. Ben de evin bir tarafını gösterdim. Nebi Sallallahu Aleyhi ve Sellem ayakta durup, tekbir getirdi. Biz de saf tuttuk. İki rekat kıldı, sonra selam verdi. Onu hazırladığımız bir hazıre çorbası için alıkoyduk. O yurdun ahalisinden çok sayıda adamlar da evde toplanıp bir araya geldiler. Onlardan birisi: Malik b. ed-Ouhşun nerede, diye sordu. Birisi: O bir münafıktır, Allah'ı ve Rasulünü sevmez, dedi. Nebi Sallallahu Aleyhi ve Sellem: Böyle deme, sen onun Allah rızasını isteyerek la ilahe illallah dediğini görmüyor musun dedi. Adam: Allah ve Rasulü daha iyi bilir, dedi.\" Itban dedi ki: \"Bizler onun yüzünün ve nasihatinin münafıklara yönelik olduğunu görüyoruz, dedik. Allah Rasulü şöyle buyurdu: Şüphe yok ki Allah, Allah'ın vechini isteyerek la ilahe illallah diyen kimseye ateşi haram kılmıştır.\" Fethu'l-Bari Açıklaması: \"el-Hazare\" Undan bulamaç şeklinde yapılan bir çorbadır. Ancak bulamaçtan daha ince olui'. Bu açıklamayı Taberi yapmıştır. Ibn Faris de şöyle demiştir: Una iç yağı karıştırılarak yapılır. el-Kutebi ve arkasından el-Cevherı de şöyle demektedir: el-Hazire, etin küçük parçalara ayrıldıktan sonra üzerine çokça su dökülerek yapılır. Et piştikten sonra üzerine un serpilir. Eğer içinde et yoksa ona asıde (bulamaç) denilir. Elenmiş un ıslatıldıktan sonra suyunun süzülüp pişirilmesi şeklinde yapıldığı da söylenmiştir. Yağ ve undan yapılan bir çorba olduğu da söylenmiştir",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 5402,
			"arabicnumber": 5402,
			"text": "İbn Abbas r.a.'dan dedi ki: \"Teyzem Nebi Sallallahu Aleyhi ve Sellem'e birkaç keler, bir miktar keş ve süt hediye etti. Keler onun sofrasına konuldu. Eğer haram olsaydı, sofrasına konmazdı. Sütten içti, keşten de yedi.\" AÇIKLAMA : \"Keş (ekıt)\" denilen şey, yağı çıkartılmış sütün peynirine denilir",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 5403,
			"arabicnumber": 5403,
			"text": "Sehl b. Sa'd'dan, dedi ki: \"Cuma günü geldi mi sevinirdik. Çünkü bizim yaşlı bir ninemiz bu çöyündür otunun köklerini alır, bunları kendisine ait bir tencereye koyar, o tencereye birkaç tane arpa da atardı. Cuma namazını kıldıktan sonra onu ziyarete giderdik, o da bize bu yemeği ikram ederdi. İşte bundan dolayı Cuma gününün gelişi bizi sevindiriyordu. Biz kuşluk yemeğini ancak Cuma namazından sonra yer ve ancak namazdan sonra kaylule yapardık (öğleden sonra dinlenirdik). Allah'a yemin ederim, o yemekte de ne bir iç yağı, ne de bir et yağı bulunurdu.\" Fethu'l-Bari Açıklaması: \"Çöyündür otu (sılk: Pazı ve benzerleri)\" Bilinen bir tür sebzedir. Bu hadisin açıklamaları daha önce Cumua bölümünde geçmiş bulunmaktadır. Hadis-i şeriften selefin, yüce A1lah'ın kendilerine büyük fetihleri nasip ettiği vakte kadar oldukça dar geçimH, iktisat11 ve dar geçime karşı da sabırlı olduklarını göstermektedir. Fetihlerden sonra kimisi dünyanın mubah olan imkanlarını genişçe kullanmış, kimisi ise zühd ve vera yolunu seçerek gücü yetmekle birlikte aşağı olan miktar ile yetinmiştir",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 5404,
			"arabicnumber": 5404,
			"text": "İbn Abbas r.a.'tan, dedi ki: \"Rasulullah Sallallahu Aleyhi ve Sellem bir kol üzerindeki eti dişleriyle ısırıp kopardı. Sonra da abdest almaksızın kalkıp namaz kıldı",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 5405,
			"arabicnumber": 5405,
			"text": "İbn Abbas r.a.'dan, dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem bir tencereden kemikli bir et çıkarıp yedi, sonra da abdest almaksızın namaz kıldı.\" Fethu'l-Bari Açıklaması: \"Eti ısırıp koparmak ve tencereden çıkarmak.\" (Eti ısırıp koparmak anlamı verilen:) \"en-nehş\", etin ağız ile ısırılıp, kemik ve başka şeyin üzerinden alınması, izale edilmesi demektir. Hocamız da Şerhu't-Tirmizi adlı eserinde şöyle demektedir: Etin bıçakla kesiLeceğine dair nehy sabit değildir. Aksine kol kemiğinden etin kesilerek alındığı sabittir. O halde etin dişlerle ısırılıp koparılması zor olduğu takdirde bıçakla kesilmesi halinde olduğu gibi, etin farklılığına göre değişiklik arz eder. Bıçağın bulunmaması hali de böyledir. Diğer taraftan işinin acele olması ile ağır hareket etme durumlarına göre değişiklik görülür. Doğrusunu en iyi bilen Allah'tır",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 5406,
			"arabicnumber": 5406,
			"text": "Abdullah b. Ebi Katade'den, o babasından şöyle dediğini rivayet etmiştir: \"Nebi Sallallahu Aleyhi ve Sellem ile birlikte Mekke'ye doğru yola çıktık",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 5407,
			"arabicnumber": 5407,
			"text": "Abdullah b. Ebi Katade es-Sülem'i'den, o babasından şöyle demiştir: \"Bir gün Nebi Sallallahu Aleyhi ve Sellem'in ashabından birtakım adamlar ile birlikte Mekke yolunda bir konaklama yerinde oturuyor idim. Resulullah Sallallahu Aleyhi ve Sellem de önümüzde konaklamış idi. Başkaları ihramlı iken ben ihramsız idim. Derken yabani bir eşek gördüler. O sırada ben de ayakkabımın söküğünü tamir etmekle meşguldüm. Bundan dolayı o hayvandan beni haberdar etmemişlerdi. Bununla birlikte keşke onu görseydim diye arzu da etmişlerdi. Derken atıma gittim, onu eğerledim, daha sonra ata bindim. Fakat kamçıyı ve mızrağı unutmuştum. Orada bulunanlara: Bana şu kamçıyı ve mızrağı uzatınız, dedim. Onlar: Hayır, Allah'a yemin olsun ki bu hayvana karşı hiçbir şekilde sana yardımcı olmayız, dediler. Bundan dolayı ben de kızıp atımdan indim ve her ikisini aldıktan sonra tekrar atıma bindim. Eşeğin üzerine hızlıca koştum ve onu vurdum. Sonra da ölmüş olduğu halde onu yanlarına götürdüm. Üzerine atılıp, ondan yemeğe başladılar. Daha sonra ihramlı oldukları halde o hayvandan yedikleri hususunda şüpheye düştüler. Bu sebeple biz de kalkıp gittik. Ben eşeğin kolunun pazusunu beraberimde saklamıştım. Resulullah Sallallahu Aleyhi ve Sellem'e yetiştik. Ona bu durum hakkında sorduk, o: Beraberinizde ondan bir şey var mı, diye sordu. Ben de ona pazusunu uzattım, o da ihramlı olduğu halde etleri dişleri ile sıyırıncaya kadar yemesine devam etti.\" Bu hadise dair yeterli açıklamalar daha önce Hac bölümünde(1822.hadisin şerhinde) geçmiş bulunmaktadır",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 5408,
			"arabicnumber": 5408,
			"text": "Cafer b. Amr b. Umeyye'den rivayete göre babası Nebi Sallallahu Aleyhi ve Sellem'i bir bıçak ile elinde bulunan bir koyun'un kürek kemiğinden et keserken görmüştür. Bu arada namazı kıldırmak üzere davet olundu. Eti de kendisi ile kestiği bıçağı da bıraktı, sonra da abdest almaksızın kalkıp namaz kıldı. Hadis daha önce Taharet (temizlenmek) bölümünde (208.hadis olarak) şerh edilmiş olarak geçmiştir",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 5409,
			"arabicnumber": 5409,
			"text": "Ebu Hureyre r.a.'den, dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem bir yemeği asla ayıplamış değildir. Eğer canı onu çekerse ondan yemiştir, eğer ondan hoşlanmamışsa onu terk etmiştir.\" Fethu'l-Bari Açıklaması: Nebi Sallallahu Aleyhi ve Sellem hiçbir yemeği ayıplamamıştır. Kasıt mubah olan yemektir. Haram olan yemeği ise ayıplardı ve ondan yemeği de nehyederdi. Nevevi dedi ki: Yemek yemenin müekked adabından birisi de yemeği n ayıplanmamasıdır. Mesela, tuzluduL ekşidir, tuzu azdır, kabadır, katı olmuştur, ince olmuştur, pişmemiştir ve benzeri sözler gibi ... \"Eğer ondan hoşlanmazsa onu yemezdi.\" İbn Battal dedi ki: Bu, güzel edepten ileri gelen bir şeydir. ÇÜnkü kişinin canı bazen bir şeyi çekmeyebilir. Fakat şeriat tarafından yenilmesinde izin bulunan her bir yiyecekte herhangi bir eksik ve kusur yok demektir",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 5410,
			"arabicnumber": 5410,
			"text": "Ebu Hazım'dan rivayete göre o Sehl'e: \"Siz Nebi Sallallahu Aleyhi ve Sellem zamanında iyice elenmiş un görmüş müydünüz, diye sordu. Sehl: Hayır dedi. Peki arpayı elekten geçirir miydiniz? O, hayır. Fakat biz ona üflerdik, demiştir. \" Bu Hadis Hadis 5413 numara ile gelecektir. Fethu'l-Bari Açıklaması: \"Arpaya üfleme\" yani kabukları uçsun diye değirmende öğütüldükten sonra ona üfleme. Buhari bu başlık ile yemeğe üflemenin nehyedilmesinin pişirilmiş yemeğe mahsus olduğuna dikkat çekmek istemiş gibidir",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 5411,
			"arabicnumber": 5411,
			"text": "Ebu Hureyre radiyallahu anh'den, dediki: \"Bir gün Nebi Sallallahu Aleyhi ve Sellem ashabı arasında bir miktar hurmayı böıüştürdü. Herkese yedi tane hurma verdi. Bana birileri ağacında olgunlaşmamış, korukalmak üzere yedi tane hurma verdi. Aralarında ondan daha çok beğendiğim hurma olmadı. Ağzımda çabucak erimedi. Onu çiğnedim durdum.\" Bu Hadis 5441 ve aynı rakam ile mükerrer 5441 numara ile gelecektir",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 5412,
			"arabicnumber": 5412,
			"text": "Sa'd'den, dedi ki: \"Ben kendimi Nebi Sallallahu Aleyhi ve Sellem ile birlikte yedinin yedincisi olarak görmüşümdür. Selem denilen dikenli bir çöl ağacı yapraklarından başka yiyecek bir şeyimiz yoktu. Öyle ki birimiz tıpkı bir koyun gibi def-i hacette bulunurdu. Daha sonra Esed oğulları kalkmış bana İslam'a dair bilgi öğretiyorlar. Eğer (onlara kaldıysam) zarara uğramış, amellerim boşa çıkmış demektir",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 5413,
			"arabicnumber": 5413,
			"text": "Ebu HazimIden, dedi ki: \"Sehl b. Sa'd'a sordum ve: RasuluIlah Sallallahu Aleyhi ve Sellem beyaz undan yapılmış ekmek yedi mi, dedim. Sehl dedi ki: Resulullah Sallallahu Aleyhi ve Sellem Allah'ın kendisine Nebilik verdiği zamandan Allah onun ruhunu kabzettiği vakte kadar beyaz undan yapılmış ekmek görmedi bile. Ebli Hazim dedi ki: Peki RasuluIlah Sallallahu Aleyhi ve Sellem'in döneminde sizin elekleriniz var mıydı, diye sordum. Sehl: RasuluIlah Sallallahu Aleyhi ve Sellem Allah'ın kendisine Nebilik verdiği zamandan Allah ruhunu kabzettiği vakte kadar elek görmedi, dedi. Ebli Hazim dedi ki: Peki, siz elenmeden arpa (ekmeğini) nasıl yerdiniz, diye sordum, o: Arpayı öğütür ve ona üflerdik. Uçan uçar, geriye kalanı ise yoğurarak yerdik, dedi",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 5414,
			"arabicnumber": 5414,
			"text": "Ebli Hureyre r.a.'dan rivayete göre o önlerinde kebap yapılmış bir koyun bulunan topluluğun yanından geçti. Onu da davet ettiler. Fakat o yemek tekliflerini kabul etmeyerek: \"RasuluIlah Sallallahu Aleyhi ve Sellem karnı arpa ekmeğinden doymadığı halde dünyadan çıkıp gitti, dedi",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 5415,
			"arabicnumber": 5415,
			"text": "Enes b. Malik r.a.'den, dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem ne masa üzerinde, ne sukurrece (denilen tepsi ve tabak) içinde yemek yedi, ne onun için halis buğday unundan inceltilmiş ekmek pişirildi. Ben (Yunus) Katade'ye: Peki, ne üzerinde yerlerdi, diye sordum. Katade: Sofralar üzerinde, diye cevap verdi",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 5416,
			"arabicnumber": 5416,
			"text": "Aişe r.anha'dan, dedi ki: \"Muhammed Sallallahu Aleyhi ve Sellem, Medine'ye geldiğinden itibaren ruhu kabzedilinceye kadar onun hanımlarının karınıarı peş peşe üç gün buğday ekmeğinden doymuştur.\" Bu Hadis 6454 numara ile gelecektir. Fethu'l-Bari Açıklaması: \"Nebi Sallallahu Aleyhi ve Sellem ve ashabının\" onun zamanında \"yedikleri.\" Buharı bu başlık altında altı hadis zikretmiş bulunmaktadır. Birinci hadis, EbU. Hureyre'nin rivayet ettiği hurma paylaştırma ile ilgili olan hadistir. Bunun açıklaması daha sonra: \"Taze hurma ile hıyar\" başlığında gelecektir. EbU. Hureyre'nin bu rivayetteki: \"Ağzımda onu çokça çiğnedim\" ifadesinden kastı şudur: Bu hurma tanesini çiğnerken oldukça sert olduğundan sakız gibi uzun süre çiğnemiştir. \"Selem denilen dikenli çöl ağacı yaprağından başka ... \" Bundan maksat ise bu çöl ağaçlarının ve bir çeşit Arabistan kirazının meyvesidir. Bu da fasulyeyi andırırdı. Bu ağaçların köklerinin kastedildiği de söylenmiştir. İleride yüce Allah'ın izni ile Rikak bölümünde bu hadise dair geniş açıklamalar gelecektir:",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 5417,
			"arabicnumber": 5417,
			"text": "Nebi Sallallahu Aleyhi ve Sellem'in zevcesi Aişe r.anha'dan rivayete göre: Yakınlarından birisi öldüğü için kadınlar bu amaçla toplanıp bir araya geldikten sonra -onun akrabaları ve özel yakınları dışında- dağıldıklarında bir çömlek içinde bir telbıne bulamacı pişirilmesini emretti. Daha sonra da tirit yapıldı. Telbine onunüzerine döküldükten sonra: Bundan yiyiniz dedi. Çünkü ben Rasulullah Sallallahu Aleyhi ve Sellem'i: Telbine bulamacı hastanın kalbini rahatlatır ve kederin bir kısmını da giderir, diye buyururken dinlemişimdir. \" Bu Hadis 5689 ve 5690 numara ile gelecektir. Fethu'l-Bari Açıklaması: \"Telbine bulamacL\" Telbine, un ya da kepekten yapılan, bazen içine bal da katılan bir bulamaçtır. Ona bu adın veriliş sebebi beyazlığı ve inceliği bakımından leben (süt)e benzediğinden dolayıdır. Bunun faydalı olanı, katı ve çiğ olanı değil de ince ve iyice pişmiş alanıdır. \"Rahatlatır.\" İleride Aişe radıyallahu anha'nın rivayet ettiği bu hadisin şerhi yüce Allah'ın izniyle Tıb bölümünde (5689.hadiste) gelecektir",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 5418,
			"arabicnumber": 5418,
			"text": "Ebu Musa el-Eş'ari'den rivayete göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Erkeklerden pek çok kişi kemale ermiştir. Kadınlardan ise İmran'ın kızı Meryem, Firavun'un karısı Asiyelden başka kimse kl?male ermemiştir. Aişe'nin diğer kadınlara üstünlüğü ise tiridin diğer yemeklere olan üstünlüğü gibidir",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 5419,
			"arabicnumber": 5419,
			"text": "Enes r.a.'den rivayete göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Aişe'nin diğer kadınlara üstünlüğü tiridin diğer yemeklere olan üstünlüğü gibidir",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 5420,
			"arabicnumber": 5420,
			"text": "Enes r.a.'dan, dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem ile birlikte terzi olan bir azadlısının yanına girdik. Bu terzi, onun önüne içinde tirid bulunan bir tencere getirdi. (Enes) dedi ki: Sonra da işine döndü. Nebi Sallallahu Aleyhi ve Sellem kabakları araştırmaya koyuldu. (Enes) dedi ki: Ben de kabakları araştırmaya ve bulduklarımı önüne koymaya koyuldum. (Enes) dedi ki: İşte bundan sonra kabağı hep seviyorum",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 5421,
			"arabicnumber": 5421,
			"text": "Katade'den, dedi ki: \"Biz Enes b. Malik r.a.'ın yanına giderdik. Onun ekmekçisi ayakta iken dedi ki: Yiyiniz, ben Nebi Sallallahu Aleyhi ve Sellem'in Allah'ın huzuruna çıkıncaya kadar inceltiimiş ne bir beyaz ekmek gördüğünü, ne de gözleri ile tüyleri sıcak suyla izale edilmiş kızartılmış bir koyun gördüğünü bilmiyorum, dedi",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 5422,
			"arabicnumber": 5422,
			"text": "Cafer b. Amr b. Umeyye ed-Damrı'den, o babasından dedi ki: \"Rasulullah Sallallahu Aleyhi ve Sellem'in bir koyunun kürek kemiğinden et keserek yediğini gördüm. Sonra namaza çağrıldı, ayağa kalktı, bıçağı bıraktı ve abdest almadan namaz kıl(dır)d",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 5423,
			"arabicnumber": 5423,
			"text": "Abdurrahman b. AbisIten, o babasından şöyle demiştir: \"Ben Aişe'ye: Nebi Sallallahu Aleyhi ve Sellem'in, kurbanlık etlerinin üç günden sonra yenilmelerini yasakladığı doğru mudur, diye sordum. O, şu cevabı verdi: Allah Rasulü bu işi sadece insanların açlık çektikleri bir yılda yapmıştı. Zenginin fakire yemek yedirmesini istemişti. Hiç şüphesiz bizler davar bacaklarını kaldırıp saklardık da (bayramdan) onbeş gün sonra onu yerdik. Ona: Sizi böyJe yapmaya mecbur eden ne idi, aiye soruldu, Aişe gülerek: Muhammed Sallallahu Aleyhi ve Sellemlin ali (aile halkı) o Allah'a kavuşuncaya kadar(arka arkaya) üç gün süre ile katığı da bulunan buğdayekmeğinden karınıarını doyurmuş değildirler. \" Bu Hadis 5438, 5570 ve 6687 numara ile gelecektir",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 5424,
			"arabicnumber": 5424,
			"text": "Cabir r.a.'den, dedi ki: \"Bizler Nebi Sallallahu Aleyhi ve Sellem'in döneminde hediyelik kurbanlıkların etlerini Medine'ye kadar azık edinirdik.\" Fethu'l-Bari Açıklaması: \"O bunu sadece insanların açlık çektikleri bir yılda yapmıştı. Zenginin fakire yedirmesini istemişti, dedi.\" A1şe bu hadis ile kurbanlık etlerinin üç günden fazla saklanmasının yasaklığının neshedilmiş olduğunu açıkça ifade etmiş bulunmaktadır. Buna göre bu yasağın sebebi, söz konusu illet (sebep, gerekçe) dolayısı ile özelolarak o yıla aitti. İleride -yüce Allah'ın izniyle- el-Edah'i (kurbanlıklar) bölümünün sonlarında (5570.hadiste) buna dair geniş açıklamalar gelecektir. Buhar'ı'nin bu hadisi zikretmekteki amacı ise, Aişe r.anha'nın söylediği: \"Biz davarların bacaklarını ... saklardık\" sözleridir. Bu sözlerle et saklamanın ve kurutulmuş et yemenin caiz olduğu açıklanmaktadır. Bunun sebebinin o zaman için etin az bulunması olduğu, hatta (et bir tarafa) ardı arkasına üç gün süre ile buğday unundan yapılmış ekmekten karınıarını doyuramadıkları da sabit bulunmaktadır. \"İbn Cüreyc dedi ki. .. \"ıos Musannıf asıl hadisi Hac bölümünün \"Kurbanlık hayvanlardan yenilenler\" başlığında mevsul olarak rivayet etmiş bulunmaktadır. Lafzı şöyledir: \"Biz önceleri kurbanlık develerimizin etlerinden üç günden fazla yemezdik. Nebi Sallallahu Aleyhi ve Sellem bize ruhsat vererek: Yiyiniz ve azıklanınız, diye buyurdu.\" Ancak Buhari bu fazlalığı zikretmemiş olmakla birlikte Müslim zikretmiş bulunmaktadır. Hadisteki: \"Yiyiniz ve azıklanınız\" ifadelerinden sonra şunları söylemektedir: Ben Ata'ya: \"Cabir: Medine'ye gelinceye kadar dedi mi, diye sordum. O: Evet, dedi.\" Ancak bu, Medine'ye varıncaya kadar bu azıklandıkları etlerin onlarla birlikte kalmasını gerektirmez. Doğrusunu en iyi bilen Allah'tır. Fakat Müslim, Sevban yoluyla gelen hadiste şunu söylediğini zikretmektedir: \"Nebi Sallallahu Aleyhi ve Sellem kurbanlığını kestikten sonra bana: Ey Sevban, benim için bunun etini pişir, diye buyurdu. Ben de Medine'ye gelinceye kadar ona o pişirdiğim etten yedirip durdum.\" İbn Battal dedi ki: Hadisten anlaşıldığına göre; 'ertesi güne herhangi bir yemek saklamak caiz değildir, az dahi olsa bir şey saklayan bir kimse, velilik adına hak kazanamaz, yiyecek bir şeyler saklayan kimse Allah hakkında kötü zan beslemiş olur' iddialarında bulunan sufilerin kanaatleri reddedilmektedir. Bu iddiada bulunan kimselerin bu kanaatlerini reddetmek için bu hadisler de yeterlidir",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 5425,
			"arabicnumber": 5425,
			"text": "Enes b. Malik r.a.'den, dedi ki: \"Resulullah Sallallahu Aleyhi ve Sellem Ebu Talha'ya: Sizin küçük çocuklarınızdan bana hizmet edecek küçük bir çocuk araştır, dedi. Ebu Talha beni arkasında terkisine bindirerek çıkarıp götürdü. Ben de Rasulullah Sallallahu Aleyhi ve Sellem ne zaman konakladıysa gider ona hizmet ederdim. Onun: Allah'ım, kederden, üzüntüden, acizlikten, tembellikten, cimrilikten, korkaklıktan, ağır borç yükünden ve erkeklerin galip gelmesinden sana sığınırım, duasını çokça yaptığını işitir dururdum. Bu şekilde Hayber'den dönünceye kadar ona hizmet edip durdum. Hayber'den kendisi için ayırmış olduğu Huyey'in kızı Safiye ile döndü. Ben onun Safiye için arkasında bir aba ya da bir örtü ile yer hazırladığını, sonra da onu arkasına, terkisine bindirdiğini gördüm. Nihayet es-Sahba denilen yere vardığımızda deriden sofralar üzerinde Hays denilen yemeği hazırlattı. Sonra beni gönderdi, ben de birtakım adamları davet ettim, onlar da gelip yemek yediler. Bu, Safiye ile evlenmesi (dolayısıyla) idi. Daha sonra Medine'ye doğru yoluna devam etti. Nihayet Uhud'u görünce: Bu bizi seven, bizim de kendisini sevdiğimiz bir dağdır, dedi, Medine'ye yaklaşınca da: Allah'ım, şüphesiz ben İbrahim'in Mekke'yi haram kıldığı gibi Medine'nin iki dağının arasını da haram kılıyorum. Allah'ım, (Medinelilerin) mudlerini ve sa'larını onlar için bereketli kıL.\" Fethu'l-Bari Açıklaması: \"Hays yemeği.\" Buna dair açıklama, -başlıktaki hadisin şerhi ile birlikte- Meğazı bölümünün Hayber gazvesinde Safiye kıssası başlığında (4211.hadiste) geçmiş bulunmaktadır. Hays, aslında hurma, keş ve tereyağından yapılır. Bazı hallerde keşin yerine doğranmış ekmek ya da un da konulabilir. \"Ağır borç yükü.\" borcun ağırlığı demektir",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 5426,
			"arabicnumber": 5426,
			"text": "Mücahid'den, dedi ki: \"Bana Abdurrahman b. Ebi Leyla'nın tahdis ettiğine göre onlar Huzeyfe'nin yanında idiler. Huzeyfe kendisine su getirilmesini istedi. Bir Mecusi ona su getirdi. Mecusi bardağı Huzeyfe'nin eline verince onu fırlatarak: Eğer ona böyle yapmamasını bir ya da iki defa söylememiş olsaydım ... -Sanki: ... böyle yapmazdım, demek istiyordu.- Ama ben Nebi Sallallahu Aleyhi ve Sellem'i şöyle buyururken dinledim: İnce ipek de, kalın ipek de giymeyiniz, altın ve gümüş kaplardan içmeyiniz. Bunlardan yapılmış tabaklarda da yemek yemeyiniz. Çünkü bunlar bu dünyada onların (kafirlerindir), ahirette de bizimdir.\" Bu Hadis Hadis 5632,5633,5831 ve 5837 numara ile gelecektir. Fethu'l-Bari Açıklaması: \"Gümüş parçaları kakılmış kapIal'da yemek yemek.\" Yani içinde (bu şekilde) gümüş parçaların bulunduğu kaplarda yemek yemek. Buharı, kaplar arasında sadece bunu söz konusu etmekle yetinmiştir. Gümüş ve altın kaplar dışındaki bütün kaplarla yemek yemek mubahtır. Fakat ister kakma, ister karıştırma, isterse de kaplama suretiyle kısmen altın ve gümüş bulunan kaplar hakkında görüş ayrılığı vardır. Buharıinin bu başlıktasöz konusu ettiği Huzeyfe yoluyla gelen bu hadiste, altın ve gümüş kaplarda yalnızca içmeninyasaklandığı görülmektedir. Yemek de hüküm itibariyle içmeğe katılmak suretiyle, bu kapIal'da yemek yemenin de yasaklandığı hükmü çıkai,tılır. Böyle bir istinbat Huzeyfe hadisine nispetle böyledir ama Müslimlde yer alan Ümmü Seleme yoluyla gelen hadiste -ileride Eşribe (içecekler) bölümünde dikkat çekileceği üzere- yemek yemek de söz konusu edilmiştir. Dolayısıyla bu kaplarda yemek yemek de nas ile yasaklanmış olmaktadır",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 5427,
			"arabicnumber": 5427,
			"text": "Ebu Musa el-Eş'arl r.a.'den, dedi ki: \"Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: Kur'an okuyan mu'minin misali, kokusu da hoş, tadı da hoş olan portakala benzer. Kur'an okumayan mu'minin misali ise kokusu bulunmayan ve tadı da tatlı olan hurmaya benzer. Kur'an okuyan münafığın misali ise kokusu hoş, tadı acı olan reyhan, (fesleğen)e benzer. Kur'an'ı okumayan münafığın misali ise kokusu da olmayan, tadı da acı olan Hamala'ya (Ebu Cehil karpuzuna) benzer",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 5428,
			"arabicnumber": 5428,
			"text": "Enes r.a.'den rivayete göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Aişe'nin kadınlara üstünlüğü, tiridin diğer yemeklere üstünlüğü gibidir",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 5429,
			"arabicnumber": 5429,
			"text": "Ebu Hureyre r.a.'den rivayete göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Yolculuk azaptan bir parçadır. Sizden herhangi birinizin uykusunu ve yemek yemesini engeller. Bu sebeple yolcu yolculuğundan maksadını gerçekleştirecek olursa ailesinin yanına dönmekte acele etsin",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 5430,
			"arabicnumber": 5430,
			"text": "Kasım b. Muhammed'den, dedi ki: \"Berire hususunda üç tane sünnet (hüküm) ortaya çıkmıştı:Aişe onu satın alıp hürriyetine kavuşturmak istemişti; ama onun sahipleri, ve!a hakkı bizim olsun demişlerdi. Aişe bunu Resulullah Sallallahu Aleyhi ve Sellem'e aktarınca, o: Arzu edersen onların lehine bu şartı koşabilirsin. Çünkü vela ancak kim hün-iyete kavuşturursa onundur, diye buyurdu. Kasım dedi ki: Berire hürriyetine kavuşturulduktan sonra kocasının nikahı altında kalmakta yahut ondan ayrılmakta muhayyer (serbest) bırakıldı. (Üçüncüsüne gelince) Resulullah Sallallahu Aleyhi ve Sellem bir gün Aişe'nin evine girdi. O sırada ateşin üzerinde kaynayan bir tencere vardı. Allah Rasulü kendisine kuşluk vakti yemeğinin getirilmesini istedi. Önüne ekmek ve evdeki katıklardan bir katık getirildi. Allah Resulü: Ben (ateş üzerinde pişen) et görmemiş miydim, diye sordu. Onlar: Doğrudur ey Allah'ın Rasulü! Fakat o et Berıre'ye sadaka olarak verilmişti, o da bize onu hediye etmişti, diye buyurdular. Bu sefer Allah Rasulü: 0, ona verilmiş bir sadakadır, bize de hediyedir, diye buyurdu.\" Katık anlamı verilen \"el-edm\" kelimesi, \"idam\"in çoğuludur",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 5431,
			"arabicnumber": 5431,
			"text": "Aişe r.anha'dan rivayete göre o: \"Rasulullah Sallallahu Aleyhi ve Sellem helvayı ve balı severdi\" demiştir",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 5432,
			"arabicnumber": 5432,
			"text": "Ebu Hureyre r.a.'den, dedi ki: \"Mayalı ekmek bulamadığım, ipek giyinmediğim, filan erkeğin ve filan cariyenin bana hizmet etmediği zamanlarda karın tokluğu için Nebi Sallallahu Aleyhi ve Sellem'in yanından ayrılmazdım. (Açlıktan) karnımı yere yapl!itırırdım, beni evine alıp götürür ve bana yemek yedirir ümidi ile bildiğim bir ayeti bir başka adamdan bana okumasını (öğretmesini) isterdim. Yoksullara kar!il da insanların en hayııolısı Cafer b. Ebi Talib idi. O bizi alır, götürür ve evinde ne varsa bize yedirirdi. Hatta bize içinde hiçbir şey bulunmayan küçük bir kırbayı çıkartır, biz de onu yarar ve içindeki artıkları yalardık.\" Fethu'l-Bari Açıklaması: \"Helvayı ve balı severdi.\" İbn Battal dedi ki: Helva ve bal yüce Allah 'ın: \"Tayyibattan yiyiniz\" buyruğunda sözü edilen tayyibat (hoş ve güzel !ieyler) arasındadır. Hadis, (tayyibat ile) kendisinden zevk alınan !ieyleri kastetmektedir, diyenıerin görü!ilerini de pekiştirmektedir. Bu hadisin kapsamına daha önceden Et'ıme (yiyecekIer) bölümünün ba!i taraflarında açıkiandığı gibi, çe!iitli lezzetli yiyecek türleri arasında helvaya ve balabenzeyen diğer bütün yiyecekIer de girmektedir. el-Hattabı ve daha sonra arkasından İbnu't-TIn de şöyle demiştir: Nebi Sallallahu Aleyhi ve Sellem'in bunları sevmesi, bunları çokça arzulaması ve nefsinin bunlara ileri derecede meyletmesi sureti ile değildi. O sadece bunlar huzuruna getirildiğinde onlardan uygun olan miktarı alırdı. BöylelikIe onun bunları beğendiği de anla!iılml!i olmaktadır. Yine bu hadisten çeşitli türlerden yemek yemenin caiz olduğu anlaşılmaktadır; ama bazı vera' ehli kimseler bunu hO!i görmez ve hurma ve bal gibi tabiatı itibariyle tatlı olan şeyler dışında tatlı şeyleri yemeye ruhsat vermezdi. Ama bu hadis onların bu kanaatini reddetmektedir. Selef arasında bunlardan vera' yoluyla kaçınanlar, sadece tayyibatı elde etmeyi ahirete erteleyen kimseler olmu!itur. Bununla birlikte bu tayyibatı dünya hayatında da elde edebiliyorlardı, ama cimrilikIerinden dolayı değil de tevazuları sebebiyle bunları yemiyarlardı. \"İnsanlar arasında yoksullara en hayırlı olan ki!ii Cafer ... idi.\" Buna dair açıkIamalar Menakıb bölümünde (3708.hadiste) geçmiş bulunmaktadır. İbnu'l-Müneyyir dedi ki: Ebu Hureyre'nin rivayet ettiği bu hadisin ba!ilığa uygunluğu !iöyle açıkianır: Helva, tatlı olan her şey hakkında kullanılır. Küçük tulumda çoğunlukIa bal bulunduğu için -ki bazı rivayet yollarında bundan açıkça söz edilmiştir- böyle bir ba!ilık da uygundur",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 5433,
			"arabicnumber": 5433,
			"text": "Enes r.a.'den rivayete göre \"Rasulullah Sallallahu Aleyhi ve Sellem terzi olan bir azadlısının yanına gitmişti. Önüne kabak yemeği getirildi, Allah Rasulü kabağı yemeğe başladı, ben de Rasulullah Sallallahu Aleyhi ve Sellem'i kabağı (severek) yerken gördüğümden beri kabağı severim",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 5434,
			"arabicnumber": 5434,
			"text": "Ebu Mes’ud el-Ensari’den dediki: Ensar arasında Ebu Şuayb diye Anılan bir adam vardı. Bu adamın da kasap bir kölesi vardı. Kölesine: Bana Rasulullah Sallallahu Aleyhi ve Sellem'i da beşinci kişi olarak davet edeceğim şekilde bir yemek hazırla, dedi. Adam Rasulullah Sallallahu Aleyhi ve Sellem'i beşin beşincisi olarak davet etti. Bunların arkasına bir kişi daha takıldı. Nebi Sallallahu Aleyhi ve Sellem (ev sahibine): Sen bizi beşin beşincisi olarak davet ettin. Bu adam da arkamızdan geldi. Arzu edersen ona izin verirsin, arzu edersen onu dışarıda bırakırsın, diye buyurdu. Adam: Hayır, ona izin verdim, diye cevap verdi.\" Hadisten Çıkarılan Sonuçlar Hadisten pek çok sonuç çıkarblmıştır: 1- Kasaplık mesleğini icra ederek kazanç sağlamak caizdir. 2- Mesleği olan kölenin gücü yettiği şekilde çalıştırılması ve o meslekten kazandıklarından yararlanmak da caizdir. 3- Misafirlik meşrudur ve misafir edilmeye ihtiyacı olan kimselerio. misafir edilmesi de tekiden müstehaptır. 4- Başkasına yemek hazırlayan bir kimse, yemeği o başkasına göndermek ile onu evine davet etmek arasında muhayyerdir. 5- Bir kimse bir başkasını ziyafete davet etmiş ise, onunla birlikte özel arkadaşlarının ve onun meclis arkadaşlarının bulunduğunu görürse, o kimseleri de davet etmesi müstehaptır. 6- Hadiste geçen: \"Ben onun yüzünden aç olduğunu anladım\" ifadesi dolayısıyla, delil e göre hüküm verilebilir. 7- Ashab-ı kiram onun bereketinden yararlanmak ümidiyle Nebi Sallallahu Aleyhi ve Sellem'in yüzüne uzun uzun bakarlardı, ama aralarında -Müslim'in naklettiği rivayette Amr b. el-As 'ın açıkça ifade ettiği gibi- utancından, hayasından ötürü uzun süre yüzüne bakamayanlar da vardı. 8- Nebi Sallallahu Aleyhi ve Sellem bazı hallerde açlık çekerdi. 9- İmamın, soylu birisinin, yaşça büyük bir kimsenin, kendilerinden daha aşağı mertebede bulunanların davetlerini kabul edip, kasaplık gibi pek üstün olmayan meslek sahiplerinin yemeklerinin yenilebileceği de belirtilmektedir. 10- Bu gibi meslekleri icra etmek hoşlanılmayan şeylerden sakınan kimselerin değerini düşürmediği gibi, sırf bu meslekleri icra ediyorlar diye bu meslek sahiplerinin şahit1iği de düşmez. 11- Bir topluluk için ziyafet yemeği hazırlayan bir kimsenin daha fazlasına gücü yetmiyor ise onlara yetecek kadar yemek hazırlaması ve o miktardan daha aşağısını -bir kişinin yemeği iki kişiye yeter prensibine dayanarak- hazırlamaması gerekir. 12- Belli bir niteliğe sahip bir topluluk eğer ziyafete davet edilmiş ise daha sonra da davet esnasında kendileri ile beraber olmayan bir kişi ile karşı karşıya kalırlarsa bu şahıs o davetin genel çerçevesine girmez. 13- Yapılan davete davetsiz olarak katılan bir kimseyi davet sahibi dışarıda İUtmakta muhayyerdir. Davet sahibinin izni olmadan içeri girerse onu dışarı çıkartabilir. 14-Davetsiz olarak katılan bir kimse derhal bu katılımdan alıkonulmaz. Çünkü bu adam Nebi Sallallahu Aleyhi ve Sellem'in peşinden gitmiş ve davet sahibinin gönül hoşluğuyla ona izin vermesi ihtimali dolayısıyla onu geri çevirmemiştir. 15- Bu hadisin davetsiz misafirliğin caiz oluşu konusunda asıl bir dayanak olarak alınması gerekir. Ama buna ihtiyacı olan kimseler için de kayıtlanması gerekir. 16- Hadis ayrıca ziyafete davet olunan kimsenin davet edenin, bu işe razı olduğunu bilmesi hali dışında, başkasını peşine takmamasına ve bu durumda davetsiz misafirin haram yemiş olacağına da delil gösterilmiştir. 17- Davet edilen bir kimse eğer kendisi ile beraber gelenlerden bir kişiye izin vermeyecek olursa, kendisi daveti kabul etmemezlik etmez. Müslim'in, Enes'in rivayet ettiği: \"Farslı birisi güzel sulu yemek yapardı. Nebi Sallallahu Aleyhi ve Sellem'e bir yemek hazırlayıp, onu o yemeğe davet etti. Nebi Sallallahu Aleyhi ve Sellem Aişe'yi göstererek: Bu da mı deyince, adam hayır dedi. Bu sefer Nebi de: (O halde ben de) hayır (diyorum) diye buyurdu.\" hadisine gelince, buna da şöyle cevap verilir: Orada davet bir ziyafete değildi. Farisi sadece bir kişiye yetecek kadarıyla yemek hazırlamıştı. Eğer Aişe'nin de gelmesine izin verecek olursa, Nebie yetmeyeceğinden korkmuştu. Muhtemelen aradaki fark şu da olabilir: Aişe davetsiz misafirden farklı olarak, davetin yapıldığı esnada hazır bulunuyordu. 18- Bu gibi durumlarda kendisinden izin istenen kişinin Ebu Şuayb'in yaptığı şekilde sonradan davetsiz olarak gelene izin vermesi gerekir. Böyle bir iş de mekarim-i ahlaktandır",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 5435,
			"arabicnumber": 5435,
			"text": "Enes radıyallShu anh'dan, dedi ki: \"Ben Rasulullah Sallallahu Aleyhi ve Sellem ile birlikte yürüyen bir genç idim. Rasulullah Sallallahu Aleyhi ve Sellem terzi bir azadlısının yanına girdi. O da içinde yemek bulunan ve üzerinde kabak parçaları olan bir yemeği n bulunduğu bir kap getirdi. Rasulullah Sallallahu Aleyhi ve Sellem kabakları araştırmaya koyuldu. Enes dedi ki: Onun böyle yaptığını görünce ben de kabakları önünde toplamaya Başladım. (Enes) dedi ki: Azadlı köle de işine devam etti. Enes dedi ki: Rasulullah Sallallahu Aleyhi ve Sellem'in O yaptıklarını gördükten sonra ben de kabağı hep sevmişimdir. \" Fethu'l-Bari Açıklaması: \"Bir adamı ziyafete davet edip ağırlayan kimsenin işine devam etmesi.\" Buharı bu Başlık ile davet edenin davet ettiği kimseyle birlikte yemek yemesinin kaçınılmaz olmadığına işaret etmektedir. İbn Battal der ki: Ben davet edenin misafiri ile birlikte yemek yemesinin şart olduğuna dair bir şey bilmiyorum. Ancak bu, misafiri rahatlatmak açısından daha uygun, onun utangaçlığını izale etme açısından da daha yerindedir. Böyle davranan bir kimse misafirini ağırlamakta daha ileriye gitmiş olur. Bunu yapmayan kimsenin de bu davranışı caizdir. Ebu Bekr radıyallahu anh'ın misafirleri ile ilgili (daha önce) geçen olayda misafırlerin kendileri ile birlikte yemedikçe yemedikleri, onun ise buna karşı tepki gösterdiği görülmüştür",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 5436,
			"arabicnumber": 5436,
			"text": "Enes b. Malik r.a.'den rivayete göre \"Bir terzi hazırladığı bir yemeğe Nebi Sallallahu Aleyhi ve Sellem'i davet etmişti. Ben de Nebi Sallallahu Aleyhi ve Sellem ile birlikte gittim. Önüne arpa ekmeği ve içinde kabak taneleri ile kurutulmuş et bulunan sulu bir yemek getirildi. Nebi Sallallahu Aleyhi ve Sellem'in yemek kabının köşe bucağından kabak tanelerini aldığını gördüm. İşte o günden itibaren kabağı hep severim",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 5437,
			"arabicnumber": 5437,
			"text": "Enes radiyallahu anh'dan, dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem'e içinde kabak taneleri ve kurutulmuş et bulunan sulu bir yemek getirildiğini gördüm. Onun kabak tanelerini seçerek yediğini gördüm",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 5438,
			"arabicnumber": 5438,
			"text": "Aişe radıyallahu anha'dan, dedi ki: \"Resulullah Sallallahu Aleyhi ve Sellem O işi (kurban etlerinin üç günden fazla saklanmasını yasaklaması) ancak insanların açIıkla karşılaştığı bir senede yapmıştı. Böylelikle zenginlerin fakirlere yedirmesini murad etmişti. Bizler ise (daha sonra) hiç şüphesiz davar bacaklarını onbeş gün sonrasına saklardık. Muhammed Sallallahu Aleyhi ve Sellem'in aile halkı üç gün üst üste katıklı buğdayekmeğinden karınıarını doyurmuş değillerdir",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 5439,
			"arabicnumber": 5439,
			"text": "Enes b. Malik r.a.'den, dedi ki: \"Bir terzi hazırladığı bir yemeğe Resulullah Sallallahu Aleyhi ve Sellem'i davet etmişti. Enes dedi ki: Ben de o yemeğe Resulullah Sallallahu Aleyhi ve Sellem ile birlikte gittim. Resulullah Sallallahu Aleyhi ve Sellem'e arpa ekmeği ve içinde kabak taneleri ve kurutulmuş et bulunan sulu bir yemek ikram edildi. Enes dedi ki: Resulullah Sallallahu Aleyhi ve Sellem'in tabağın etrafındaki kabak tanelerini ayıkladığını gördüm. İşte o günden bu yana ben de kabağı hep severim.\" Sümame, Enes'ten: \"Ben de kabak tanelerini önüne toplamaya başladım\" dediğini eklemiştir. Fethu'l-Bari Açıklaması: \"Sofra üzerinde arkadaşına elden ele bir şey uzatan yahut önüne koyan kimse.\" İbnu'l-Mübarek dedi ki: \"(Aynı sofrada bulunanların) birbirlerine elden ele bir şey uzatmalarında bir sakınca yoktur. Fakat bu sofradan diğer sofradakine elden ele bir şey uzatmaz.\" İbn Battal dedi ki: Aynı sofrada birbirlerine bir şey uzatmalarının caiz olması, o yemeğin muayyen olarak onlara takdim edilmiş olmasından dolayıdır. O yemeğin tamamını kendileri yiyebilirler. Bu yemekte o sofradakilerin hepsi ortaktır. Daha önceden de herkesin önünden yemesine dair emir geçmiş bulunmaktadır. Önünde bulunan bir şeyi arkadaşına uzatan bir kimse, arkadaşının o şeydeki ortaklığı ile birlikte kendi payını ona vererek kendisine tercih etmiş gibidir; ama bir başka sofrada bulunan kimsenin durumu böyle değildir. Başka sofradakine kendi sofrasından bir şeyler uzatan kimsenin önünde bulunan yemekte hakkı bulunmakla birlikte, onun bir kısmını bir başka sofradakine vermek hakkı yoktur. Çünkü diğer sofradakinin onda bir ortaklığı bulunmamaktadır",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 5440,
			"arabicnumber": 5440,
			"text": "Abdullah b. Cafer b. Ebi Talib r.a.'dan, dedi ki: \"Ben Nebi Sallallahu Aleyhi ve Sellem'i olgunlaşmış taze hurma ile birlikte acur yerken gördüm. \" Bu Hadis 5447 ve 5449 numara da da geçior 40. BAB",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 5441,
			"arabicnumber": 5441,
			"text": "Ebu Osman'dan, dedi ki: \"Ebu Hureyre r.a.'e yedi gün misafir oldum. Kendisi, hanımı ve hizmetçisi, biri diğerinin arkasında, her biri gecenin üçte birinde nöbetleşiyordu. Biri namaz kılıyor, sonra ötekini uyandırıyordu. Onu: Rasulullah Sallallahu Aleyhi ve Sellem bir defa ashabı arasında bir miktar hurma bölüştürdü. Bana birisi adi hurmadan olmak üzere yedi hurma isabet etmişti, derken dinledim",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 5442,
			"arabicnumber": 5442,
			"text": "Aişe r.anha'dan, dedi ki: \"Rasulullah Sallallahu Aleyhi ve Sellem vefat ettiğinde biz esvedeyn (iki siyah) adını verdiğimiz kuru hurma ile suya doymuştuk",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 5443,
			"arabicnumber": 5443,
			"text": "Cabir b. Abdullah r.a.'dan, dedi ki: \"Medine'de bir Yahudi vardı. Bu bana hurmaların toplanma zamanına kadar kuru hurma satardı. Rume yolu üzerindeki arazi de Cabir'e aitti. Bir sene bu hurma bağımız alışılmış şekilde meyve vermedi. Mahsulleri toplama zamanında o Yahudi yanıma geldi. O mahsullerinden ona verecek bir şey bulamadığımdan gelecek seneye kadar bana mühlet vermesini istemeye koyuldum, o ise bunu kabul etmiyordu. Benim bu durumum Nebi Sallallahu Aleyhi ve Sellem'e haber verilince, o da ashabına: Kalkın, yahudiden Cabir'e mühlet vermesini isteyelim, dedi. Ben hurma ağaçlarımın arasında iken yanıma geldiler. Nebi Sallallahu Aleyhi ve Sellem Yahudi ile konuşmaya koyuldu. Ancak Yahudi: Ya Ebu'l-Kasım, ona mühlet vermiyorum, diyordu. Nebi Sallallahu Aleyhi ve Sellem bunu görünce kalkıp hurma ağaçları arasında dolaştı. Daha sonra onun yanına gelip tekrar onunla konuştu. Yahudi yine kabul etmedi. Kalktım, az miktarda taze olgun hurma getirdim ve onu Nebi Sallallahu Aleyhi ve Sellem'in önüne koydum. Nebi yedikten sonra: Ey Cabir, senin çardağın nerede, diye sordu. Ben de ona söyledim. Allah Rasulü: Çardağın altında bana bir yaygı ser, dedi. Ben de ona yaygı serdim. Allah Rasulü çardağın altına girip biraz uyuduktan sonra uyandı. Ona bir avuç daha taze hurma getirdim, ondan da bir miktar yedi. Sonra kalkıp yine Yahudi ile konuştu. Yahudi yine kabul etmedi. Allah Rasulü ikinci bir defa hurmalıklar arasında dolaştı. Sonra: Ey Cabir, hurma devşir ve borcunu öde, diye buyurdu. Allah Rasulü de toplanan hurmaların başında durdu. Ben ağaçlardan onun borcunu ödeyecek kadarını topladığım gibi ondan bir miktar daha arttı. Çıkıp Nebi Sallallahu Aleyhi ve Sellem'in yanına geldim ve ona müjdeyi verdim. Allah Rasulü: Şehadet ederim ki ben Allah'ın Rasulüyüm, diye buyurdu.\" Areşe ve arlş (hadiste çardak) yapı demektir. İbn Abbas dedi ki: \"Ma'ruşat\"(En'am, 141) üzüm asması ve diğer ağaçlardan çardaklı olanlar demektir. \"Urlişuha\" da yapıları, binaları demektir. Fethu'l-Bari Açıklaması: \"Ben de gelecek seneye kadar ondan mühlet vermesini, bir yıl daha bana süre tanımasını istiyordum.\" \"Senin arışin (çardağın) nerede?\" Yani altında gölgelenmek ve öğle uykusunda kayluleye yatmak için bahçende edindiği n yer nerede? ''Ben ona bir avuç daha\" taze hurma \"getirdim.\" \"İkinci bir defa hurmalıklar arasında kalktı, dolaştı ... Sonra: \"Ey Cabir, dev- . şir ve (borcunu) öde.\" diye emir buyurdu \"Şehadet ederim ki ben Allah'ın Rasulüyüm, diye buyurdu.\" Rasulullah Sallallahu Aleyhi ve Sellem'in bu sözleri söylemesinin sebebi, bu olayda açıkça bir harikuladeliğin bulunmasıdır. Çünkü az miktardan çok miktar geriye kaldı. Oysa bu miktarın -bir şeyler artırması bir yana- borcun tamamını ödemesi dahi düşünülmüyordu. Hele hele borcun ödenmesinden sonra geriye yine onun kadar bir şey kalacağı hiç düşünülemiyordu. İbnu't-TIn dedi ki: Hadisten anlaşıldığına göre, ashab yanlarında ödeyecek karşılıkları bulunduğu için bir şeyler borç alıyoriardı. Borçlanmaktan sığınmak ise çokluğu ya da ödenecek karşılığı bulunamayan borç hakkındadır. Bundan dolayı Nebi Sallallahu Aleyhi ve Sellem aile halkı için almış olduğu arpa karşılığında zırhı rehin bırakılmış olduğu halde vefat etmiş idi. Hadisten Çıkartılan Diğer Sonuçlar 1- Nebi Sallallahu Aleyhi ve Sellem'in ashabını ziyaret ettiği, bağlarına bahçelerine girip orada kayllile istirahatına çekildiği, bahçelerinin gölgesinde gölgelendiği anlaşılmaktadır. 2- Borçlu olan hakkında daha uygun olacağı için, alacaklı ve varlıklı kimsenin hak ettiği muayyen alacağından başkasını almak üzere süre tanıması konusunda i1timasta bulunulabilir",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 5444,
			"arabicnumber": 5444,
			"text": "Abdullah b. Ömer r.a.'dan, dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem'in huzurunda oturuyor iken ona bir hurma ağacının cummarı getirildi. Nebi Sallallahu Aleyhi ve Sellem: Öyle ağaçlar vardır ki, bereketleri müslümanın bereketi gibidir, diye buyurdu. Ben onun hurma ağacını kastettiğini anladım. Ey Allah'ın Rasulü o hurma ağacıdır, demek istedim. Fakat etrafıma bakınınca on kişinin onuncusu ve en gençleri olduğumu gördüm, bu sebeple sustum. Nebi Sallallahu Aleyhi ve Sellem: O hurma ağacıdır, diye buyurdu.\" Buna dair yeterli açıklama İlim bölümünde (72 nolu hadiste) var. Başlığın özellikle cummar yemek hakkında olmasına dair açıklamalar da Buyu’ bölümünde (2209 nolu hadiste) var",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 5445,
			"arabicnumber": 5445,
			"text": "Amir b. Sa'd'dan, o babasından, dedi ki: \"Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: Her kim sabahleyin yedi acve hurması yiyecek olursa o gün ona ne bir zehir, ne de bir sihir zarar verebilir. \" İleride 5768,5769 ve 5779 numara ile geçiyor Acve ile ilgili hadise dair açıklamalar yüce Allah'ın izniyle Tıb bölümünde (5769 nolu hadiste) gelecektir",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 5446,
			"arabicnumber": 5446,
			"text": "Cebele b. Suhaym'den, dedi ki: \"İbn ez-Zübeyr ile birlikte iken bize bir kıtlık senesi gelip çattı. o bize geçinmek üzere hurma verdi. Abdullah b. Ömer biz yerken yanımızdan geçiyor ve: Hurmaları ikişer ikişer yemeyiniz. Çünkü Nebi Sallallahu Aleyhi ve Sellem ikişer ikişer yemeği nehyetmişti, diyordu. Sonra da: Kişinin kardeşinden (bu maksatla) izin alması hali müstesnadır, diyordu.\" Şu'be dedi ki: İzin İbn Ömer'in kendi sözlerindendir. Fethu'l-Bari Açıklaması: \"Hurmaları ikişer ikişer yemek\" Yani topluluk ile birlikte yiyen kimseler için bir hurmayı diğer hurma ile birlikte yeme(nin hükmü) demektir. Abdullah \"İbn ez-Zubeyr\"in halifeliği dönemınde onunla \"birlikte iken bize• bir kıtlık senesi isabet etti. Bize geçimimiz için hurma veriyordu.\" Yani maaşlanmızı öderken arada hurma da veriyordu. Buradaki maaş (erzak)dan kasıt, her yılonlara haraç ve daha başka gelirlerden yapılan ödemedir. Nakit karşılığında hurma ödenmesi de, hasıl olan kıtlık sebebiyle o sıradaki nakdin azlığından ötürüidi. Bu meselenin (hurmaları birlikte yemenin) hükmü hususunda görüş ayrılığı vardır. Nevevı şöyle demektedir: Buradaki nehyin haramlık için mi olduğu yoksa mekruhluk mu ifade ettiğihususunda ilim adamları ihtilaf etmişlerdir. Doğrusu ise, hükmün duruma göre farklı olacağıdır. Eğer yiyecek aralarında ortak ise hurmaları ikişer ikişer yemek, onların rızası ileolmadıkça haramdır. Böyle bir izin ise onların ya açıkça ifadeleri ile yahut halin bunun yerine geçen karinesi ile anlaşılır. Böylece buna izin verdikleri kanaati ağır basmalıdır. Eğer yemek başkalarına ait ise bu şekilde yemek haram olur. Eğer onlardan birisine ait olup ondan yemelerine izin vermiş ise yemek sahibinin rızası şarttır. Rıza göstermediği kimselerin yemesi haramdır. Kişinin kendisi için caiz olmakla birlikte kendisiyle beraber yemek yiyenlerden izin alması müstehaptır. Misafir ağırlayan kimsenin ise misafiri ile eşit olması için çifter çifter yememesi güzeldir. Ancak onların, yedikten sonra artıracakları kadar ise müstesna. Bununla birlikte yemek hususunda edeb, mutlak olarak açgözlülüğe delil olan şeyleri terk etmektir. Ama bir başka işe yetişmek için acele etmesi ve bundan dolayı çabuk yemeğe çalışması müstesnadır. el-Hattabı'nin naklettiğine göre böyle bir izin istemenin şart oluşu, onların zamanlarında idi. Çünkü onların elinde bulunan şeyler çok azdı. Günümüzde bolluk söz konusu olduğundan ötürü izin istemeye gerek yoktur. Ancak Nevevi doğru olanın, duruma göre farklı hükmün olduğunu göz önünde bulundurmaktır, diye cevap vermiştir. Çünkü muteber olan, sebebin özelliği değil, lafzın umumi oluşudur. Hem sabit olmamış böyle bir şey nasıl sebep olarak kabul edilebilir ki? İbn Şahin, en-Nasih ve'l-Mensuh adlı eserinde aynı zamanda el-Bezzar'ın Müsned'inde de bulunan İbn Bureyde'nin babası yoluyla merfu olarak zikrettiği şu hadisi kaydetmiştir: \"Ben size daha önceden hurmaları ikişer ikişer yemenizi yasaklamış idim. Şüphesiz Allah artık size bolluk ihsan etmiştir. İkişer ikişer yiyebilirsiniz.\" Muhtemelen Nevev! bu hadise işaret etmiştir. Bu hadisin senedinde bir zayıflık vardır. el-Hazimı şöyle demektedir: Nehy bildiren hadis daha sahih ve daha meşhurdur. Ancak bu hususta mesele basit ve kolaydır. Çünkü bu, ibadetler türünden değildir. Ancak dünyevi masıahatlar kabilinden olduğundan bu hususta yetinilebilir. Diğer taraftan bunun caiz oluşuna ümmetin icma' etmiş olması da bu görüşü desteklemektedir. Evet, el-Hazimi böyle demiştir. Caiz oluşundan kastı ise -Nevevı'nin açıkladığı gibi- şahsın o yenilen şeye -yemek için ona izin verilmiş olması yolu ile dahi olsa- malik olma hali hakkındadır. Yoksa alimlerden hiçbir kimse başkasına ait olan bir malı, sahibinin izni olmaksızın sırf kendisine tahsis etmesini caiz görmüş değildir",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 5447,
			"arabicnumber": 5447,
			"text": "Abdullah b. Cafer'den, dedi ki: \"Ben Nebi Sallallahu Aleyhi ve Sellem'i olgun taze hurmayı acur ile birlikte yerken gördüm",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 5448,
			"arabicnumber": 5448,
			"text": "İbn Ömer r.a.'den, Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Ağaçlardan öyle bir ağaç vardır ki Müslüman gibi (bereketli)dir. Bu da hurma ağacıdır",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 5449,
			"arabicnumber": 5449,
			"text": "Abdullah b. Cafer r.a.'dan, dedi ki: \"Resulullah Sallallahu Aleyhi ve Sellem'i olgun taze hurma ile birlikte acur yerken gördüm.\" Fethu'l-Bari Açıklaması: \"Olgun taze hurma ile birlikte acur yerken.\" Nesal sahih bir sened ile Humeyd'den, o Enes'ten şöyle dediğini rivayet etmektedir: \"Resulullah sallallahli a1eyhi vesellem'i olgun taze hurma ile birlikte kavun yerken gördüm.\" Yine Nesai'de sahih bir sened ile Aişe: \"Nebi Sallallahu Aleyhi ve Sellem'in kavunu taze hurma ile birlikte yediği\"ni rivayet etmektedir. İbn Mace de Aişe'den şu rivayeti zikretmektedir: \"Annem, beni Nebi Sallallahu Aleyhi ve Sellem'in hanımı olarak onunla zifafa göndermek üzere kilo alayım diye tedavi etmek istedi. Ben olgun taze hurma ile birlikte acuru yiyinceye kadar bunu bir türlü gerçekleştiremedi. Bunları beraber yiyince en güzel şekilde kilo aldım.\" Nesa! de Aişe'den şu rivayeti zikretmektedir: \"Nebi Sallallahu Aleyhi ve Sellem benimle evlendiğinde çeşitli şeylerle beni tedavi etmek istediler. Bunun için hurma ile birlikte bana acur yedirdiler. Bunları yiyerek en güzel şekilde kilo aldım.\" Nevevi der ki: Bu başlıktaki hadisten anlaşıldığına göre iki tür meyveyi ya da başka bir şeyi birlikte yemek caiz olduğu gibi, iki ayrı yemeği de birlikte yemek caizdir. Buradan da yenecek şeylerde genişliğin caiz olduğu da anlaşılmaktadır. Bunun caiz olduğu konusunda da ilim adamları arasında görüş ayrılığı yoktur. Seleften bundan farklı olarak nakledilmiş olan rivayetler dini bir masıahat gözetmeksizin bolluk, refah ve genişlik içinde yaşamayı itiyat ve alışkanlık haline getirmeyi önlemek amacı ile mekruh oluşayorumlamak gerekir. Kurtubi dedi ki: Bu hadisten, yemeklerin niteliklerini ve tabiatıarını göz önünde bulundurmanın ve tıp kurallarına uygun olarak doğru bir şekilde onları yemenin caiz olduğu da anlaşılmaktadır. Çünkü olgun, taze hurmanın tabiatında hararet, acurun tabiatında ise serinlik vardır. Birlikte yenildikleri takdirde birbirlerini dengelerler. İşte bu, ilaçlardaki terkiplerde göz önünde bulundurulan pek büyük bir esastır",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 5450,
			"arabicnumber": 5450,
			"text": "Enes r.a.'den rivayete göre \"Annesi Ümmü Suleym bir mud arpa alarak onu kalınca öğüttü. Onun bir kısmını süt bulamacı yaptı. Yanındaki bir yağ tulumundan bir miktar da yağ sıktı. Sonra beni Nebi Sallallahu Aleyhi ve Sellem'e gönderdi. Onun yanına -ashabı ile birlikte iken- varıp onu davet ettim. Allah Rasulü: Beraberimdekiler de mi diye sordu. Ben de anneme gelip: Beraberimdekiler de mi, diyor dedim. Ebu Talha onu karşılamaya çıktı ve: Ey Allah'ın Rasulü, bu Ümmü Suleym'in yaptığı az bir yemektir, dedi. Allah Rasulü içeri girdi, Ümmü Suleym'in yaptığı yemek getirildi. Allah Rasulü: Yanıma on kişi al, diye buyurdu. O on kişi içeri alındı ve doyuncaya kadar yediler. Daha sonra: Yanıma on kişi al, diye buyurdu, onlar da içeri girip doyuncaya kadar yediler. Tekrar: Yanıma on kişi al, diye buyurdu ve nihayet toplam saydıkları kırk kişiyi buldu. Daha sonra Nebi Sallallahu Aleyhi ve Sellem yedi ve sonra kalktı.\" (Enes dedi ki): \"Ben acaba ondan birşey eksildi mi, diye bakmaya koyuldum.\" Fethu'l-Bari Açıklaması: \"Misafideri içeriye onar kişi onar kişi almak ve yemeğe onarkişi onar kişi oturmak.\" Yemeğin azlı ğı yahutyemeğe oturulacak yerin darlığı dolayısıyla böyle bir şeye ihtiyaç duyulursa demektir. \"Unukalınca öğütlli.\" Kökünü teşkil eden \"el-ceşış\", ince olmayan un demektir. Daha önce ''Nübüvvetin alametleri\" bahsinde Müslim'deki rivayetlerin birisinde bu başlıktaki şekliyle hadisin siyakında bir ihtisar bulunduğunu söylemiş idim. Mesela Yakup b. Abdullah b. Ebi Talha'nın, Enes'ten diye yaptığı rivayette şöyle denilmektedir: Ebu Talha dedi ki: \"Ey Allah'ın Rasulü! Ben Enes'i yalnızca seni davet etsin, diye göndermiştim. Çünkü yanımızda gördüğüm kadar kişiyi doyuracak bir şey yoktu.\" Amr b. Abdullah'ın, Enes'ten diye naklettiği rivayette de şöyle denilmektedir: \"Ebu Talha dedi ki: Bu sadece bir kap yemektir. Allah Rasulü: Şüphesiz Allah ona bereket ihsan edecektir, diye buyurdu.\" İbn Battal dedi ki: Yemek için topluca bir araya gelmek, bereketin sebeplerindendir. Ebu Davud, Vahşi b. Harb yoluyla merfu olarak Nebi'e isnad ettiği hadiste şunu zikretmektedir: \"Yemeğiniz üzerinde toplanıp bir araya gelin ve Allah'ın adını anın. Ona sizin için bereket ihsan olunacaktır.\" (İbn Battal) dedi ki: Nebi Sallallahu Aleyhi ve Sellem'in onları onar kişi, onar kişi olarak içeri alması -doğrusunu en iyi bilen Allah'tır ya- yemeğin tek bir kap içinde oluşu ve büyük bir topluluğun yemeği n azlığı ile birlikte ondan alıp yemeğe imkanlarının olmayacağı dolayısı ile idi. Bundan dolayı sıkışmadan yemek imkanını bulmaları için onları onar onar böldü. Ayrıca şunları söylemektedir: Hadiste yemeğin etrafında on kişiden daha fazla toplanmanın yasaklanışına bir delil bulunmamaktadır",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 5451,
			"arabicnumber": 5451,
			"text": "Abdulaziz'den, dedi ki: \"Enes'e: Nebi Sallallahu Aleyhi ve Sellem'den sarımsak hakkında ne söylediğini dinledin, diye soruldu. O şöyle dedi: Kim (bundan) yerse asla mescidimize yaklaşmasın, diye buyurdu",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 5452,
			"arabicnumber": 5452,
			"text": "Ata'dan rivayete göre Cabir b. Abdullah r.a. Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu söylemiştir: \"Kim bir sarımsak yahut soğan yerse bizden uzak dursun ya da mescidimizden uzak kalsın, diye buyurdu.\" Fethu'l-Bari Açıklaması: \"Sarımsak ve (benzer) sebzelerden mekruh olanlar.\" Kasıt, hoş olmayan kokusu olanlardır. Buradaki nehy genel olarak bunları yiyen kimselerin mescide girmelerinin yasaklanması anlamında mıdır yoksa bunların pişmiş olanları değil de, çiğ olanlarını yiyen kimseler hakkında mıdır? Buna dair açıklamalar Namaz bölümünde (853.hadisin şerhinde) geçmiş bulunmaktadır. Bu hadislerde sarımsak, soğan ve pırasa yemenin caiz olduğu açıklanmaktadır. Ancak bunlar, yiyen kimsenin mescidde bulunması mekruhtur. Fukaha bunlara turp gibi kokusu hoş olmayan diğer sebzeleri de katmışlardır. Ancak mekruhluk hususunda görüş ayrılığı vardır. Cumhur bunun tenzihen mekruh olduğunu kabul etmiştir. Zahiri mezhebine mensup alimlerden bazılarının haram olduğunu söyledikleri nakledilmiştir",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 5453,
			"arabicnumber": 5453,
			"text": "Cabir b. Abdullah'tan, dedi ki: \"Rasulullah Sallallahu Aleyhi ve Sellem ile birlikte Merru'z-Zahran'da idik. Biz kebas topluyorduk. O bize: Onun kararmış olan meyvesini toplamaya bakınız. Çünkü o ey tab (daha hoş ve lezzetli) dir, diye buyurdu. Sen koyun otlatıyor muydun, diye sorulunca, o: Evet, koyun otlatmamış bir nebi var mıdır ki, diye sordu.\" Fethu'l-Bari Açıklaması: \"Erak yaprağı olan.\" Doğrusu ise erakin meyvesi olduğudur. İbn Battal dedi ki: el-Kebas, erakin taze olan, meyvesidir. el-Berir ise, onun taze ve kuru olan meyvesine denilir. İbnu't-Tin dedi ki: Buharl'nin \"erak ağacının yaprağı olan\" demesi doğru değildir. Sözlükte doğru olan onunerak ağacının meyvesi olduğudur. Onun olgun olanına böyle denildiği de söylenmiştir. \"Merru'z-Zehran\" Mekke'den bir merhale uzaklıkta bulunan bir yerin adıdır. \"O eytab\"dır. Bu atyab (daha hoş ve lezzetli) anlamında bir söyleyiş olup, onun kalb edilmiş (kelimenin söyleyişinde tı ile ya harfinin yeri değiştirilmiş) şeklidir. Nitekim Araplar cezebe ve cebeze'yi böyle kullanmışlardır. \"Koyun otlatır mıydın, diye soruldu.\" Bu soru tarzında ihtisar vardır. İfadenin takdiri şudur: Sen koyun otlatıyor muydun ki kebasın hangisinin daha lezzetli olduğunu biliyorsun? Çünkü çokça koyun otlatan bir kimse, hem koyunlarını otlatmak, hem de altlarında gölgelenmek üzere ağaçların altına çokça gider. Buna dair açıklamalar da Enbiyaya dair hadislerin söz konusu edildiği bölümde, Musa'nın kıssası nakledilirken geçmiş bulunmaktadır. Ayrıca İcare bölümünün baş taraflarında enbiyanın koyun otlatmalarının hikmetine dair açıklamalar da geçmiş bulunmaktadır. İbnu't-Tin, ed-Davudi'den şu bilgiyi nakletmektedir: Koyunların bu özelliğindeki hikmet, sırtlarına binilmediğinden, onların sırtına binilerek kişinin nefsinin büyüklenmeyişidir. Yine İbnu't-Tin der ki: Bu hadiste mülk olmayan ağacın meyvesinin yenilmesinin mubah olduğu anlaşılmaktadır. İbn Battal dedi ki: Bu besleyici gıdaların bulunmadığı, İslam'ın ilk dönemlerinde böyle idi. Şanı yüce Allah artık kullarına buğday ve pek çok tahıllar ile zenginleştirip, onlara geniş rızık verdikten sonra erak ağacının meyvesine ihtiyaçları kalmamıştır. Derim ki: Eğer bu sözleriyle bu gibi mahsulleri almanın mekruh oluşuna işaret etmeyi düşünmüşse bu kabul edilemez. Çünkü sözünü ettiği durumun varlığı, bedelini ödemeden mubah olan şeylerin yasaklanmasını gerektirmez. Aksine vera' ehli pek çok kişi, para ile satın alınanları yemekten çok, bu tür mubah olan şeylere daha çok rağbet ederler. Doğrusunu en iyi bilen Allah'tır",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 5454,
			"arabicnumber": 5454,
			"text": "Suveyd b. en-Numan'dan, dedi ki: \"Rasulullah Sallallahu Aleyhi ve Sellem ile birlikte Hayber'e çıktık. es-Sahba denilen yere varınca Allah Rasulü yiyecek getirilmesini istedi. Sevikten başka bir şey getirilmedi. Biz de yedik. Allah Rasulü namaza kalkınca ağzını çalkaladı, biz de çalkaladık",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 5455,
			"arabicnumber": 5455,
			"text": "Yahya dedi ki: Ben Buşeyr'i şöyle derken dinledim: \"Bize Suveyd tahdis etti: Rasulullah Sallallahu Aleyhi ve Sellem ile Hayber'e çıktık. es-Sahba denilen yere varınca -Yahya dedi ki: Burası Hayber'den yarım günlük bir mesafededir- yemek getirilmesini istedi. Ona sevikten başka bir şey getirilmedi. Biz de ağızlarımızia onu çiğnedik ve ondan bir kısım yedik. Daha sonra da bir su getirilmesini emir buyurdu, ağzını çalkaladı. Onunla birlikte biz de çalkaladık. Sonra abdest almaksızın bize akşam namazını kıldırdı",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 5456,
			"arabicnumber": 5456,
			"text": "İbn Abbas r.a.'dan rivayete göre Nebi Sallallahu Aleyhi ve Sellem: \"Sizden herhangi bir kimse yemek yedikten sonra elini (parmaklarını) yalamadıkça yahut yalatmadıkça silmesin\" diye buyurdu. Fethu'l-Bari Açıklaması: \"Valamadıkça\", kendisi yalamadıkça ... \"yahut yalatmadıkça\", başkasına yalatmadıkça ... NeveVi dedi ki: Maksat bundan tiksinmeyen zevcesi, cariyesi, hizmetçisi, çocuğu gibi başkasına yalatmasıdır. Hadis bu işten tiksinerek parmaklan yalamayı mekruh görenlerin kanaatini reddetmektedir. Evet, yemek esnasında bunu yaparsa bu tiksinti husule gelebilir. Çünkü tekrar parmaklannı üzerlerinde tükürüğünün izleri bulunduğu halde yemeğe daldırır. Hadisten Çıkarılan Sonuçlar 1- Yemekten sonra eli silmek müstehaptır. Kadı lyad dedi ki: Silmek ayrıca yıkamaya ihtiyaç göstermeyen şeyler içindir. Elin daldırılması ve ancak yıkama ile giderilebilecek bir nemlilik gibi haller müstesnadır. Çünkü hadis-i şerifte el yıkamak teşvik edilmiş, bunu terk etmek de sakındırılmıştır. Evet, böyle demiştir. Fakat bu başlıktaki hadis parmakların yalanmadan önce ellerin yıkanmasının ve silinmesinin men edilmesini gerektirmektedir. Çünkü bu işler yapılmadan parmakların yalanması açıkça emredilmiş bulunmaktadır. Bu da bereketin hasılolması içindir. Kokunun giderilmesi için parmakların yalanmasından sonra yıkanmasının muayyen bir mendub olacağı da doğrudur. İşte onun işaret ettiği hadis de böyle yorumlanır. Bu hadisi Ebu Davud, Müslim'in şartına göre sahih bir sened ile Ebu Hureyre'den rivayet etmiştir. Ebu Hureyre hadisi Nebi efendimize ref ederek şöyle demiştir: \"Her kim elinde yemek bulaşığı bulunduğu halde onu yıkamadan uyur ve ona herhangi bir şey isabet ederse kendinden başka kimseyi kınamasın.\" 2- Örfe göre değersiz ve önemsiz olsa bile yenilen ya da içilen şeyler gibi Allah'ın lütfundan olanhiçbir şeyin ihmal edilmemesinin özenle devam ettirilmesine işaret edilmektedir",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 5457,
			"arabicnumber": 5457,
			"text": "Cabir b. Abdullah r.a.'dan rivayete göre; o (hadisi Cabir'den rivayet eden Said b. el-Haris) kendisine ateşin değdiği ve böylece pişmiş şeylerden yemekten ötürü abdest alınıp alınmayacağına dair soru sordu. Cabir: Hayır. Çünkü biz Nebi Sallallahu Aleyhi ve Sellem zamanında bu tür yiyeceklerden ancak çok az bir şey bulabiliyorduk. Bizler bu gibi yiyecek şeyleri bulduğumuz vakit de mendillerimiz yoktu. Bulabildiğimizle sadece ellerimizi siliyor idik. Sonra da abdest almaksızın namaz kılardık, diye cevap verdL",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 5458,
			"arabicnumber": 5458,
			"text": "Ebu Umame'den rivayete göre Nebi Sallallahu Aleyhi ve Sellem yemeğini yiyip sofrasını kaldırınca: الحمد لله كثيراً طيباً مباركاً فيه، غير مكفيٍّ ولا مُودَّع ولا مُستغنًى عنه، ربنا \"El-hamdulillahi kesiren tayyiben mubareken fihi ğayra mekfiyyin ve la muveddain ve la müstağnen anhu Rabbena: diye dua ederdi.\" --- Dua'nın meali: Çok temiz, bereketli, kafi görülmeyen ve terk olunmayan, kendisinden de müstağni kalınmayan bir hamd ile Allah'a hamd olsun, Rabbimiz, --- Bu hadis 5459 numara dada geçiyor",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 5459,
			"arabicnumber": 5459,
			"text": "Ebu Umame'den rivayete göre \"Nebi Sallallahu Aleyhi ve Sellem yemeğini bitirdi mi -ravi bir defasında: Yemeğini kaldırdı mı, dedi- şöyle dua ederdi: Elhamdulillahillezi kefana ve ervana gayra mekfiyyin ve la mekfurin -bir defasında da: leke'l-hamdu Rabbena gayra mekfiyyin ve la muveddain ve la müstağnen Rabbena demiştir.-: --- Meali: Bize kifayetiyle rızık veren, bizi susuzluktan kurtarıp sulayan Allah'a, kafi görülmeyecek ve nimeti inkar olunmayacak bir hamd ile Allah'a hamdolsun. -Bir seferinde de: Rabbimiz hamd sanadır. Kafi görülmeyerek ve terk olunmayarak ve müstağni olunmayarak yapılan hamd yalnız sanadır Rabbimiz, demiştir.\" --- Fethu'l-Bari Açıklaması: \"Yemeği bitirdikten sonra neler söyleneceği. .. \" İbn Battal dedi ki: Yemekten sonra hamd etmenin müstehap oluşu üzerinde ilim adamları ittifak etmişlerdir. \"Kafi görülmeyerek.\" İbn Battal dedi ki: Bu ibarenin, kabı ters çevirdim anlamındaki: \"Kefa'tu'l-inae\"den gelme ihtimali vardır. Yani bağışladığı nimetleri kendisine geri çevrilmeyen demek olur. İbnu't-TIn de şöyle açıklamıştır: Başka kimseye muhtaç olmayan, aksine kullarına yediren ve ihtiyaçlarını yeteri kadarıyla karşılayan odur demektir. el-Kazzaz da şöyle demiştir: Yani ben kendi başıma bu ihtiyaçlarımı karşılamak noktasında kendime yetmem demektir. İbnu'l-Cevzi de Ebu Mansur elCevalikl'den şunu nakletmektedir: Doğrusu, bunun hemzeli mükafat lafzından geldiğidir. Yani Allah'ın nimetine kafi gelecek şekilde karşılık verilemez. Derim ki: Bu lafız bu şekilde (yani hemzeli olarak) Ebu Hureyre'nin rivayet ettiği hadiste sabittir. Fakat bu başlıktaki hadiste ye ile (kafi görülmeyecek anlamında) \"gayra mekfiyyin\" şeklindedir. Her birisinin ayrı bir manası vardır. \"Ve la mekfQrin: inkar edilmeyerek\" yani lütfu ve nimetleri inkar olunmayarak. \"Ve la muveddain: Terk olunmayan\", terk edilmeyen, bırakılmayan, demektir",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 5460,
			"arabicnumber": 5460,
			"text": "Ebu Hureyre r.a.'den rivayete göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Sizden birinize hizmetçisi yemeğini getirecek olursa, kendisi ile beraber oturtmasa bile ona bir ya da iki çiğnemlik yahut bir ya da iki lokma uzatıversin. Çünkü hizmetçi onun sıcaklığını hissetmiş ve hazırlığını bizzat yapmıştır.\" Fethu’l-Bari Açıklaması: \"Hizmetçi ile yemek yemek\", tevazu maksadıyla bu işi yapmak demektir. Hizmetçi lafzı erkek ve dişi hakkında kullanılır. Köle ya da hür olmasını da kapsayacak şekilde genel bir ifadedir. Eğer efendi erkek ise, hizmetçi de dişi ise onun mülkü (cariyesi) yahut mahremi ya da onun hükmünde bulunan bir kimse olur ve bunun da aksi söz konusudur. \"Sıcaklığını ve pişirilmesini. .. \" Pişirirken, gerekli malzemesi sağlanırken ve tencere ateşin üzerine konulmadan pişirme işini \"üstlenmiştir.\"• İbnu'l-Münzir, bütün ilim ehlinden hizmetçiye o beldede benzeri yenilen temel gıdalardan çoğunlukla kullanılan türü yedirmesinin vacip olduğunu nakletmiş bulunmaktadır. Aynı şekilde katık ve giyecek hakkında görüş de böyledir. Bununla birlikte efendinin bu türden nefis olan şeyleri kendisine ayırma hakkı da vardır. Ama daha faziletli olan bu hususlarda hizmetçisini de kendisine ortak etmesidir. Doğrusunu en iyi bilen Allah'tır. Hizmetçiyi yemeğe beraberinde oturtmak yahut eline bir şeyler vermek emrinin hükmü hususunda görüş ayrılığı vardır. Şafii hadisi zikrettikten sonra şunları söylemektedir: Bu bize göre -doğrusunu en iyi bilen Allah'tır- iki anlamı ihtiva eder. Birincisi, hizmetçiyi kendisiyle beraber oturtmasının daha faziletli olduğu anlamına geldiğidir; eğer bunu yapmayacak olursa vacip değildir. Ya da hizmetçiyi kendisiyle birlikte oturtmak ile eline bir şeyler vermek arasında muhayyer olduğudur. Çünkü Nebiin emri bazen kesin olmayanihtiyari bir emir anlamında olabilir. İkincisi ise buradaki emrin mutlak olarak mendubluk ifade ettiğidir",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 5461,
			"arabicnumber": 5461,
			"text": "Ebu Mes'ud el-Ensari'den, dedi ki: \"Ensardan Ebu Şuayb künyeli bir adam vardı. Bunun da kas ap bir kölesi vardı. Nebi Sallallahu Aleyhi ve Sellem ashabı ile birlikte iken Nebiin yanına geldi. Nebi Sallallahu Aleyhi ve Sellem'in yüzünden aç olduğunu anladı. Kasap kölesine giderek: Bana beş kişiye yetecek kadar az bir yemek hazırla, dedi. Belki Nebi Sallallahu Aleyhi ve Sellem'i beş kişinin beşincisi olarak davet ederim. Adam da ona az miktarda bir yemek hazırladı. Daha sonra adam Nebiin yanına gidip onu yemeğe davet etti. Onlara, davet edilmeyen bir adam daha katıldı. Nebi Sallallahu Aleyhi ve Sellem: Ey Ebu Şuayb, bir adam bizimle beraber geldi. Dilersen ona izin verirsin, dilersen vermezsin, dedi. Adam: Hayır, ona izin veriyorum, dedi.\" Fethu'l-Bari Açıklaması: \"Bir yemeğe davet edilip de: Bu da benimle beraberdir diyen adam.\" Bu başlık altında Ebu Mesud'un kas ap kölesi ile ilgili naklettiği olayı anlatan hadisi zikretmiştir. Bundan yirmi küsur başlık önce (5434.hadiste) yeteri kadar g.çıklaması geçmiş bulunmaktadır",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 5462,
			"arabicnumber": 5462,
			"text": "Cafer b. Amr b. Umeyye'den rivayete göre \"Babası Amr b. Umeyye kendisine şunu haber vermiştir: O Rasulullah Sallallahu Aleyhi ve Sellem'i elinde bulunan bir koyunun kürek kemiğinden et keserken görmüştür. Namaz kılmaya çağrılınca eti ve onunla kestiği bıçağı bıraktı, sonra abdest almaksızın kalkıp namaza durdu",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 5463,
			"arabicnumber": 5463,
			"text": "Enes b. Malik r.a.'dan rivayete göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Akşam yemeği konulup namaz için kamet getirilirse akşam yemeğini yemekle başlayınız",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 5464,
			"arabicnumber": 5464,
			"text": "Nafi'den rivayete göre \"İbn Ömer bir seferinde imamın namazdaki kıraatini işittiği halde, akşam yemeğini yemişti",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 5465,
			"arabicnumber": 5465,
			"text": "Aişe r.anha'dan rivayete göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Namaz için kamet getirilip akşam yemeği de hazır ise önce akşam yemeğini yemekle başlayın.\" Fethu'l-Bari Açıklaması: \"Akşam yemeği hazır olduğu takdirde, acele edip akşam yemeğini bırakmasın.\" el-Kermani dedi ki: Başlıkta yer alan \"el-aşa (akşam yemeği)\" ile sabah (kuşluk) vakti yenen yemeğin zıttının kastedilme ihtimali vardır. Bu lafız (ayn harfi) fethalı söylenir. Yatsı namazının kastedilme ihtimali de vardır. Bunun ayn lafzı ise kesrelidir. \"An aşaihl, akşam yemeğinden\" ibaresin ise, ayn harfi sadece fethalı söylenir, başka türlü rivayeti yoktur. Derim ki: Kesreli olma ihtimali de uzaktır. Çünkü hadis akşam namazı hakkında varid olmuştur. Ayrıca bu namaza \"işa\" adının verilmesine dair nehy de vardır. Bu başlık lafz1 anlamı itibariyle musannıfın cemaatle namaz bahislerinin başlarında Namaz bölümünde zikrettiği bir hadiste de geçmiş bulunmaktadır. Söz konusu bu hadis İbn Şihab yoluyla Enes'ten şu lafızia gelmiştir: \"Akşam yemeği getirildiği takdirde siz akşam namazını kılmadan önce onu yemekle işe başlayın ve akşam yemeğinizi acele edip bırakmayın",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 5466,
			"arabicnumber": 5466,
			"text": "Enes'ten, dedi ki: \"Hicab meselesini insanlar arasında en iyi bilen benim. Ubey b. Ka'b bana bu hususta soru soruyordu. Rasulullah Sallallahu Aleyhi ve Sellem Zeyneb bint Cahş ile yeni evlenmiş bir damat olarak sabahı etti. -Medine'de iken onunla evlenmişti.- Gün yükseldikten sonra insanları yemeğe davet etti. Rasulullah Sallallahu Aleyhi ve Sellem oturdu. Yemeğe gelen davetlilerin bir kısmı kalktıktan sonra bazı kimsele.r de onunla birlikte oturmaya devam etti. Nihayet Rasulullah Sallallahu Aleyhi ve Sellem ayağa kalktı ve Aişe'nin adasının kapısına varıncaya kadar yürüdü, ben de onunla beraber yürüdüm. Sonra onların dışarı çıktıklarını zannettiği için geri döndü. Ben de onunla beraber döndüm. Onların, oldukları yerde oturduklarını gördü. Bu sefer tekrar Aişe'nin adasının kapısına ulaşıncaya kadar geri döndü, ikinci defa ben de onunla döndüm. Geri dönünce ben de onunla döndüm. Onların kalktıklarını gördük. Benimle kendisi arasına bir perde gerdi ve hicabı emreden buyruk nazil oldu.\" Fethu'l-Bari Açıklaması: ''Yüce Allah'ın: ''Yemek yediniz mi dağllın.\"(Ahzab, 53) buyruğu.\" Buhari bu başlıkta Enes'in, Cahş kızı Zeyneb ile Nebi efendimizin evlenmesi olayına dair ve hicab ayetinin inişini söz konusu eden hadisi zikretmektedir. Hadiste \"Resulullah Sallallahu Aleyhi ve Sellem Zeyneb ile zifafa girmiş, damat olarak sabahı etti\" buyruğunda \"el-arus\" bir sıfat olup kullanılışı bakımından erkek ve dişi arasında fark yoktur. (Yani hem damat, hem gelinanlamındadır.) Urs (düğün) ise erkeğin yeni hanımı ile birlikte kaldığı süreye denilir. Asıl anlamı ise beraberlik ve birlikte olup ayrılmamak demektir. Alışveriş bölümünün baş taraflarında yüce Allah'ın: \"Artık o namaz kılındı mı, yeryüzüne dağılın.\" (Cumua, 10) buyruğu açıklanırken Cuma namazından sonra dağılma emri ile ilgili görüş ayrılığına dair açıklamalar geçmiş bulunmaktadır. Buradaki yemekten sonra dağılmaktan maksat ise, yemek yenilen yerden ev sahibinin yükünü hafifletmek için başka bir yere gitmek demektir. Nitekim ayetin muktezası da budur. Ahzab suresinin tefsirinde (4792.hadisin şerhinde) buna dair yeterli açıklamalar geçmiş bulunmaktadır",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 95
			}
		}
	]
}