{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"74": "Drinks"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5575,
			"arabicnumber": 5575,
			"text": "Bize Mâlik, Nâfi'den; o da Abdullah ibn Omer (radıyallahü anh) 'den haber verdi ki, Rasûlüllah (sallallahü aleyhi ve sellem):\"Kim dünyâda şarâb içer de sonra bu günâhından tevbe etmezse, o kişi âhirette cennet şarâbından mahrum olur\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 5576,
			"arabicnumber": 5576,
			"text": "ez-Zuhrî (şöyle demiştir): Bana Saîd ibnu'l-Müseyyeb haber verdi ki, kendisi Ebû Hureyre (radıyallahü anh)'den işitmiştir: Rasûlüllah'a isrâ ettirildiği gece Îliyâ'da (yani Beytu'l-Makdis'te) biri şarâb, biri süt dolu olan iki kadeh getirildi. Rasûlüllah(sallallahü aleyhi ve sellem) onlara baktı, sonra süt kadehini aldı. Bunun üzerine Cibrîl: \"Seni fıtrata hidâyet eden Allah'a hamd olsun! Eğer sen şarâbı almış olsaydın, ümmetin azgın olurdu\" dedi. hadîsi ez-Zuhrî'den rivayet etmekte Ma'mer ibn Râşid, İbnu'l-Hâd, Usmân ibnu Omer ve ez-Zubeydî, Şuayb'e mutâbaat etmişlerdir",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 5577,
			"arabicnumber": 5577,
			"text": "Enes (radıyallahü anh) şöyle demiştir: Ben Rasûlüllah (sallallahü aleyhi ve sellem)'tan bir hadîs işittim ki, onu sizlere benden başka hiçbir kimse söyleyemeyecektir: Şöyle buyurdu: \"Cehlin yayılması, ilmin azalması, zinanın yayılması, şarâbın içilmesi, erkeklerin mikdârı azalıp da kadınların çoğalması, o derecede ki elli kadının yalnız bir tek kayyımları, yani bakanı olması kıyâmet alâmetlerindendir",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 5578,
			"arabicnumber": 5578,
			"text": "İbnu Şihâb şöyle demiştir: Ben Ebû Seleme ibn Abdirrahmân ile İbnu'l-Müseyyeb'den işittim, şöyle diyorlardı: Ebû Hureyre (radıyallahü anh) şöyle dedi: Peygamber(sallallahü aleyhi ve sellem) şöyle buyurdu: \"Zina edici(mü'min) kişi zina ettiği sıra (tam ve kâmil bir) mü'min olduğu hâlde zina etmez. İçki içen de içki içtiği zamanda (kâmil bir) mü'min olarak içemez. Hırsız da hırsızlık yaparken (kâmil bir) mü'min olarak hırsızlık yapamaz.\" Şihâb şöyle dedi: Ve yine bana Abdulmelik ibnu Ebî Bekr ibn Abdirrahmân ibni'l-Hâris ibn Hişâm haber verdi ki, zikredilen Abdulmelik'in babası Ebû Bekr, bu hadîsi Ebû Hureyre'den tahdîs ederdi. Sonra şöyle der idi: Bu Ebû Bekr ibnu Abdirrahmân, şu Ebû Hureyre hadîsinde zikredilenlerin beraberine şunu da katardı: \"İnsanların gözleri önünde yağmacılık yapan yüksek mevki' sahibi (zâlim) kişi, yağmacılık ettiği zaman (kâmil) mü'min olarak yağmacılık edemez",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 5579,
			"arabicnumber": 5579,
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 5580,
			"arabicnumber": 5580,
			"text": "Enes (radıyallahü anh) şöyle demiştir: Hamr bizlere haram kılındı. Haram kılındığında biz üzümlerden yapılan hamrı -Medine'de demek istiyor- ancak pek az buluyorduk. Bizim hamrımızın çoğu (yani aslı) rutab kertesine varmamış olan hurma koruğu ve hurmadır",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 5581,
			"arabicnumber": 5581,
			"text": "Bize Âmir eş-Şa'bî tahdîs etti ki, İbn Omer (radıyallahü anh) şöyle demiştir: Omer, Peygamber'in minberi üzerinde ayağa kalktı da şöyle dedi: \"Amma ba'du: Hamrın, yani şarâbın haram kılınması indi. Hamr ise (bu gün) beş şeyden yapılıyor: Üzümden, hurmadan, baldan, buğdaydan, arpadan. Hamr, aklı ve şuuru örtüp karıştıran içkididir",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 5582,
			"arabicnumber": 5582,
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 5583,
			"arabicnumber": 5583,
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 5584,
			"arabicnumber": 5584,
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 5585,
			"arabicnumber": 5585,
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 5586,
			"arabicnumber": 5586,
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 5587,
			"arabicnumber": 5587,
			"text": "Yine ez-Zuhrî şöyle demiştir: Bana Enes ibnu Mâlik tahdîs etti ki, Rasûlüllah(sallallahü aleyhi ve sellem):\"Dubbâ' ve muzeffet denilen kaplarda şıra kurmayın\" buyurmuştur. dedi ki:) Ebû Hureyre bu iki kabın beraberine \"Hantem\" ile \"Nakîr\" ismindeki kapları da katardı",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 5588,
			"arabicnumber": 5588,
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 5589,
			"arabicnumber": 5589,
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 5590,
			"arabicnumber": 5590,
			"text": "Ve Hişâm ibnu Ammâr şöyle söyledi: Bize Sadaka ibnu Hâlid tahdîs etti. Bize Abdurrahmân ibnu Yezîd ibn Câbir tahdîs etti. Bize Atıyye ibnu Kays el-Kilâbî tahdîs etti. Bize Abdurrahmân ibnu Ganmin el-Eş'arî tahdîs edip şöyle dedi: Bana Ebû Âmir yahut Ebû Mâlik el-Eş'arî tahdîs etti: Vallahi o bana yalan söylemedi. Kendisi Peygamber(sallallahü aleyhi ve sellem)'den işitti ki, şöyle buyuruyordu: \"Yemîn olsun, ümmetimden muhakkak birtakım kavimler meydana gelecektir. Bunlar ferci (yânı zina etmeyi), ipek elbiseler giymeyi, şarâb içmeyi, çalgı âletleri çalıp eğlenmeyi halâl ve mübâh sayacaklar. Ve yine birtakım (merhametsiz) zümreler de bir dağın yanına(dağ mesirelerine) konaklayacaklar, onlara âid koyun sürüsü ile çoban sabahları yanlarına gelecek(akşamları gidecek). Bunlara fakir kişi bir hacet için gelecek de bu duygusuz insanlar fakire: Haydi(bugün git), bize yarın gel! diyecekler. Bunun üzerine Allah (eğlendikleri) dağı geceleyin üzerlerine indirip bir kısmını helak edecek, (sağ kalan) öbürlerini de kıyâmet gününe kadar maymunlar ve domuzlar suretine tebdil edecektir",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 5591,
			"arabicnumber": 5591,
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 5592,
			"arabicnumber": 5592,
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 5593,
			"arabicnumber": 5593,
			"text": "Abdullah ibn Amr (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) kırba, tulum gibi deriden yapılmış olanlardan başka kaplarda şıra yapılmasını nehyettiği zaman, sahâbîler tarafından Peygamber'e: İnsanların hepsi kırba ve tulum gibi deri kaplar bulamaz ki, denildi. üzerine Peygamber onlara ziftlenmemiş olan balçık çömlek ve küp içinde şıra kurmalarına ruhsat ve müsâade verdi",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 5594,
			"arabicnumber": 5594,
			"text": "Bize Yahya ibn Saîd el-Kattân, Sufyân'dan tahdîs etti. Bana Süleyman el-A'meş, İbrâhîm et-Teymî'den; o da el-Hâris ibn Suveyd'den tahdîs etti ki, Alî (radıyallahü anh):Peygamber(sallallahü aleyhi ve sellem) dubbâ'dan ve ziftlenmiş kap (içinde şıra kurmak)tan nehyetti, demiştir. Usmân ibn Ebî Şeybe tahdîs etti. Bize Cerîr ibn Abdilhamîd, el-A'meş'ten... bu geçen hadîsi tahdîs etti",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 5595,
			"arabicnumber": 5595,
			"text": "Bize Cerîr, Mansûr'dan tahdîs etti ki, İbrâhîm en-Nahaî (şöyle demiştir): Ben, el-Esved ibn Yezîd'e: Sen mü'minlerin anası Âişe'ye, hangi şeyler içinde şıra tutulması mekruh olur diye sordun mu? dedim. Evet, dedi ve şöyle ilâve etti: Ben: Ey mü'minlerin anası! Peygamber hangi şeylerin içinde şıra tutulmasından nehyetti? dedim. Bu hususta biz ev halkını dubbâ'da ve muzeffette (yânı ziftlenmiş kapta) şıra kurmamızdan nehyetti, dedi. en-Nahaî dedi ki:) Bu sefer Esved'e: Âişe, hantem ve cerr denilen testiyi zikretmedi mi? diye sordum. Ben sana ancak işittiğim şeyi tahdîs ediyorum, sana işitmediğim şeyi mi tahdîs edeyim? Dedi",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 5596,
			"arabicnumber": 5596,
			"text": "Bize eş-Şeybânî tahdîs edip şöyle demiştir: Ben Abdullah ibn Ebî Evfâ (radıyallahü anh)'dan işittim, o şöyle dedi: Peygamber (sallallahü aleyhi ve sellem) yeşil testi (içinde şıra tutmak)tan nehyetti. dedi ki:) Ben Abdullah'a: Beyaz testi içinde mi içelim? dedim. Abdullah: Hayır, ondan da içmeyin (çünkü hüküm birdir), dedi",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 5597,
			"arabicnumber": 5597,
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 5598,
			"arabicnumber": 5598,
			"text": "Bize Sufyân es-Sevrî haber verdi ki, Ebû’l-Cuveyriye şöyle demiştir: Ben İbn Abbâs'a \"el-Bâzak\" içkisinin hükmünü sordum. İbn Abbâs: Muhammed (sallallahü aleyhi ve sellem) bâzak içkisinin hükmünü önceden bildirip \"Sarhoş eden her şey haramdır\" buyurmuştur, dedi. Bâzak, halâl-tayyib içkidir, (çünkü o, halâl-tayyib olan üzümün sıkılmış sırasıdır), dedi. Abbâs: Halâl-tayyib olanı iç, şu muhakkak ki halâl-tayyib olandan sonra harâm-habîsten başkası yoktur, (çünkü o şıra ilk haletinden hamrlığa dönüşmüştür), dedi",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 5599,
			"arabicnumber": 5599,
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 5600,
			"arabicnumber": 5600,
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 5601,
			"arabicnumber": 5601,
			"text": "Bana Atâ ibn Ebî Rebâh haber verdi ki, kendisi Câbir (radıyallahü anh)’den şöyle derken işitmiştir: Peygamber (sallallahü aleyhi ve sellem) kuru üzümle hurmayı, alacalanmış hurma koruğu ile taze hurmayı birleştirmekten nehyetti",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 5602,
			"arabicnumber": 5602,
			"text": "Ebû Katâde (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem), olgun hurma ile ermemiş hurma koruğunun, yine hurma ile kuru üzümün bir arada birleştirilmesini nehyetti. Bunlardan herbirisi ayrı ayrı şıra ve hoşaf yapılmalıdır",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 5603,
			"arabicnumber": 5603,
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 5604,
			"arabicnumber": 5604,
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 5605,
			"arabicnumber": 5605,
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 5606,
			"arabicnumber": 5606,
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 5607,
			"arabicnumber": 5607,
			"text": "Ebû İshâk şöyle demiştir: Ben el-Berâ ibn Âzib (radıyallahü anh)'den işittim şöyle dedi: Peygamber (sallallahü aleyhi ve sellem) beraberinde Ebû Bekr olduğu hâlde, Mekke'den (Medîne'ye Muhacir olarak) geldi. Ebû Bekr dedi ki: Biz yolumuz üzerinde bir çobana uğradık. Rasûlüllah çok susamış hâldeydi. Bekr dedi ki: Ben bir kâse içine bir mikdâr süt sağdım. Rasûlüllah bu sütten içti, hattâ ben onun ihtiyâcı ve yeteri kadar içip doyduğunu bilip hoşnûd oldum. Bu sırada bize Surâka ibnu Cu'şum bir at üzerinde olarak geldi. Rasûlüllah ona beddua etti. Bunun üzerine Surâka, Rasûlüllah'tan kendisi aleyhine beddua etmemesini ve kendisinin selâmetle geri dönüp gitmesini İstedi. Peygamber de onun isteğini yerine getirdi (yani ona beddua etmedi)",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 5608,
			"arabicnumber": 5608,
			"text": "Bize Ebu'z-Zinâd, Abdurrahmân'dan; o da Ebû Hureyre (radıyallahü anh)'den olmak üzere tahdîs etti ki, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: \"Bol sütlü sağım devesi -sağılıp sahibine geri verilmek üzere- hediye etmek ne güzel sadakadır. Seçkin sağmal koyun hediye etmek de böyle güzel bir sadakadır. Bu bereketli hayvan, sabahleyin bir kap süt verir, akşamleyin bir kap süt verir\". Ebû Âsım, el-Evzâî'den; o da İbn Şihâb'dan; o da Ubeydullah ibn Abdillah'tan; o da İbn Abbâs radıyallahü anhüma'tan tahdîs etti ki, Rasûlüllah(sallallahü aleyhi ve sellem) süt içip ağzını çalkalamış da \"Bu yağlıdır\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 5609,
			"arabicnumber": 5609,
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 5610,
			"arabicnumber": 5610,
			"text": "Ve İbrâhîm ibn Tahmân, Şu'be'den; o da Katâde'den söyledi ki, Enes ibn Mâlik(radıyallahü anh) şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem) -Mi'râcı anlatırken-şöyle buyurdu: \"Bana Sidre ağacı gösterildi. Baktım ki, orada dört nehir vardı. İki nehir zahir, iki nehir de bâtın idi. Zahir olan nehirler Nil ile Furât nehirleridir. Bâtınî olan nehirler cennetteki iki nehirdir. Sonra bana üç bardak sunuldu. Birinde süt, birinde bal, birinde de şarâb vardı. Ben süt dolu olan bardağı aldım ve içtim. Bana: Sen ve ümmetin fıtrata isabet ettiniz, denildi...\". ed-Destevâî, Saîd ibn Ebî Arûbe ve Hemmâm ibn Yahya hepsi de Katâde'den; o da Enes ibn Mâlik'ten; o da Mâlik ibn Sa'saa'dan; o da Peygamber(sallallahü aleyhi ve sellem)'den olmak üzere nehirlerin zikrine kadar, geçen metin tarzında bu hadîsin metnini ittifakla söylediler, fakat \"Üç kadeh\" fıkrasını zikretmediler",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 5611,
			"arabicnumber": 5611,
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 5612,
			"arabicnumber": 5612,
			"text": "ez-Zuhrî şöyle dedi: Bana Enes ibn Mâlik (radıyallahü anh) haber verdi ki, kendisi Rasûlüllah'ın süt içtiğini görmüş. dedi ki:) Rasûlüllah, Enes'in evine gelmiş hâldeyken, ben bir koyunun sütünü sağdım ve Rasûlüllah için kuyudan biraz su ile karıştırdım. Rasûlüllah(sallallahü aleyhi ve sellem) kadehi alıp içti. Bu sırada solunda Ebû Bekr, sağında da bir bedevi bulunuyordu.Rasûlüllah kendisinden artan sütü bedeviye verdi. Sonra da: \"Sağa (ve Sıra ile sağa (ver)!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 5613,
			"arabicnumber": 5613,
			"text": "Bize Fuleyh ibnu Süleyman, Saîd ibnu'l-Hâris'ten; o da Câbir ibn Abdillah (radıyallahü anh)'tan tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem), Ensâr'dan bir zâtın bustânına girdi. Yanında dostu (Ebû Bekr) bulunuyordu. Peygamber bustân sahibine (Ebû'l-Heyseme): \"Eğer yanında eski kırba içinde bu gece geceleyip soğumuş su varsa (içeriz), yoksa biz şu sudan(bardaksız) dudağımızla içeriz!\" buyurdu. dedi ki: Bu sırada bustân sahibi(ağaçları sulamak için) bustânının bir tarafından öbür tarafına su çeviriyordu. Yine Câbir dedi ki: Bustân sahibi: Yâ Rasûlallah! Yanımda gecelemiş su vardır, çardağa doğru git, dedi. dedi ki: Akabinde onları (Rasûlüllah ile Ebû Bekr'i) çardağa götürdü. Bir bardağın içine su koydu, sonra suyun üzerine de elcil koyunun sütünden sağdı. Bunu Rasûlüllah içti. Sonra kendisiyle beraber gelen zât (yani Ebû Bekr) içti",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 5614,
			"arabicnumber": 5614,
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 5615,
			"arabicnumber": 5615,
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 5616,
			"arabicnumber": 5616,
			"text": "Bize Abdulmelik ibn Meysere tahdîs etti. Ben en-Nezzâl ibnu Sebre'den işittim. O, Alî'den şöyle tahdîs ediyordu: Alî(radıyallahü anh) öğle namazını kıldırdı. Sonra insanların hacetleri için Küfe Mescidi'nin geniş yerinde ikindi namazı vakti gelinceye kadar oturdu. Sonra kendisine su getirildi. Ondan içti, yüzünü ve ellerini yıkadı. Râvî, başını ve ayaklarını da zikretti. Abdest aldıktan sonra ayağa kalktı, artan suyu da ayakta dikilerek içti. Sonra: Şübhesiz birtakım insanlar, ayakta dikilirken su içmeyi kerîh görürler. Muhakkak ki, Peygamber(sallallahü aleyhi ve sellem) şu benim yaptığımın benzerini yaptı, dedi",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 5617,
			"arabicnumber": 5617,
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 5618,
			"arabicnumber": 5618,
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 5619,
			"arabicnumber": 5619,
			"text": "Sufyân, Âsim el-Ahvel'den; o da eş-Şa'bî'den tahdîs etti ki, İbn Abbâs radıyallahü anhüma:Peygamber(sallallahü aleyhi ve sellem) ayakta dikilerek Zemzem suyundan içti, demiştir",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 5620,
			"arabicnumber": 5620,
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 5621,
			"arabicnumber": 5621,
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 5622,
			"arabicnumber": 5622,
			"text": "Mu'temir'in babası Süleyman şöyle demiştir: Ben Enes (radıyallahü anh)'ten işittim, şöyle dedi: Ben bir içki meclisinde amcalarıma fadîh içkisi sunup sâkîlik hizmetini yapıyordum. Ben onların en küçüğü bulunuyordum. Bu sırada \"Şarâb haram kılındı\" denildi. Bana: Şarâb testilerini devir! dediler. Biz de onları devirip döktük, (Süleyman et-Teymî dedi ki:) Ben Enes'e: Onların içkileri ne idi? diye sordum. Enes: Taze hurma ve alacası düşmüş koruk hurmadır, diye cevâb verdi. Bekr ibnu Enes: Bu fadîh şarâbı, o gün onların içkisi idi dedi de, Enes bunu reddetmedi. Ve bana arkadaşlarımdan biri tahdîs etti ki, kendisi Enes'ten: 'Fadîh, o gün onların hamrı idi\" derken işitmiştir",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 5623,
			"arabicnumber": 5623,
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 5624,
			"arabicnumber": 5624,
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 5625,
			"arabicnumber": 5625,
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 5626,
			"arabicnumber": 5626,
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 5627,
			"arabicnumber": 5627,
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 5628,
			"arabicnumber": 5628,
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 5629,
			"arabicnumber": 5629,
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 5630,
			"arabicnumber": 5630,
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 5631,
			"arabicnumber": 5631,
			"text": "Azre ibnu Sabit şöyle dedi: Bana Sumâme ibnu Abdillah haber verip şöyle dedi: Enes (radıyallahü anh) su içtiği kap (dışın)da iki yahut üç kerre nefes alırdı ve: Peygamber(sallallahü aleyhi ve sellem) üç kerre nefes alırdı, dedi",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 5632,
			"arabicnumber": 5632,
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 5633,
			"arabicnumber": 5633,
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 5634,
			"arabicnumber": 5634,
			"text": "Peygamber'in zevcesi Ümmü Seleme'den (o şöyle demiştir): Rasûlüllah(sallallahü aleyhi ve sellem) şöyle buyurdu: \"Şu gümüş kaptan birşey içen kişi var ya, muhakkak o kişi karnına ancak (curb curb diye) cehennem ateşini göndermektedir",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 5635,
			"arabicnumber": 5635,
			"text": "el-Berâ ibn Âzib (radıyallahü anh) şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem) bizlere yedi şeyi işlememizi emretti, yedi şeyden de bizleri nehyetti. Bizlere hastayı ziyaret etmeyi, cenaze arkasından gitmeyi, aksırana duâ etmeyi, da'vetciye icabet etmeyi, selamlaşmayı yaymayı, zulme uğramışsa yardım etmeyi, yemîn edenin yemînini kabul edip isteğini yerine getirmeyi emreyledi. Ve yineRasûlüllah bizleri altın yüzükler takmaktan, gümüş kaptan içmekten -yahut: Gümüş kap kullanmaktan-, eyer ve semerler üzerine binicinin altına konulan içi pamuk veya yünle doldurulmuş, ipekten veya atlastan yapılmış küçük minderler kullanmaktan, kassî denilen ince ve kalın ipek kumaşlar giymekten nehyetti",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 5636,
			"arabicnumber": 5636,
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 5637,
			"arabicnumber": 5637,
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 5638,
			"arabicnumber": 5638,
			"text": "Âsım el-Ahvel şöyle demiştir: Ben Enes ibn Mâlik'in yanında Peygamber'in kadehini gördüm. Bu kadeh çatlamış hâldeydi, Enes onu gümüşle bağlayıp kenetlemişti. dedi ki: O, Nudâr ağacından yapılmış, enli, güzel bir su bardağı idi. Âsim dedi ki: Enes (radıyallahü anh): Yemîn olsun ben bu kadeh içinde Rasûlüllah'a şundan ve şundan daha çok zaman su vermişimdir, dedi. Âsim şöyle dedi: İbn Sîrîn de şöyle dedi: Bu kadehin üzerinde demirden yapılmış bir halka vardı. Enes ibn Mâlik bu halkanın yerine altından yahut gümüşten bir halka geçirmek istedi. Fakat (üvey babası) Ebû Talha ona: Sakın Rasûlüllah(sallallahü aleyhi ve sellem)'ın yapmış olduğundan hiçbirşeyi değiştirme! diye tenbîh etti. tenbîh üzerine Enes onu olduğu gibi bıraktı",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 5639,
			"arabicnumber": 5639,
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 65
			}
		}
	]
}