{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"74": "Drinks"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5575,
			"arabicnumber": 5575,
			"text": "Abdullah b. Ömer r.a.'dan riwyete göre Rasulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Kim dünyada hamr (şarap) içer, sonra ondan tevbe etmezse ahirette ondan mahrum edilir",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 5576,
			"arabicnumber": 5576,
			"text": "Ebu Hureyre r.a.'dan rivayete göre; \"Resulullah Sallallahu Aleyhi ve Sellem'e İsra'ya götürüldüğü gece İlya'da iken ona birinin içinde şarap, diğerinin içinde süt bulunan iki kase getirildi. O her ikisine de baktıktan sonra sütü aldı. Bunun üzerine Cibril: Sana, fıtrata uygun olana hidayet veren. Allah'a hamd olsun. Eğer şarabı almış olsaydın ümmetin azacaktı, dedi",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 5577,
			"arabicnumber": 5577,
			"text": "Enes r.a.'dan, dedi ki: \"Ben Rasulullah Sallallahu Aleyhi ve Sellem'den öyle bir hadis dinlemiştim ki, bu hadisi size benden başkası tahdis edemez. Allah Rasulü şöyle buyurmuştu: Kıyametin şartlarından (alametlerinden) bazıları cehaletin ortaya çıkıp baskın gelmesi, ilmin azalması, zinanın ortaya çıkması, şarabın içilmesi, elli kadının sorumluluklarını üstlenecek ancak bir tek erkek olacak şekilde erkeklerin azalıp kadınların çoğalmasıdır",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 5578,
			"arabicnumber": 5578,
			"text": "Ebu Hureyre r.a.'dan rivayete göre \"Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: Zina eden, zina ettiği vakit mu'min olarak zina etmez. İçki içen bir kimse mu'min olarak onu içmez. Hırsızlık yapan bir kimse mu'min olarak hırsızlık yapmaz.\" İbn Şihab dedi ki: Ayrıca Abdulmelik b. Ebi Bekr b. Abdurrahman b. el-Haris b. el-Hişam'ın bana haber verdiğine göre Ebu Bekr bunu ona Ebu Hureyre'den diye tahdis eder, sonra da şöyle derdi: \"Ebu Bekr bunlarla beraber şunu da ekliyordu: Değerli, insanların önemsediklerinden ötürü gözlerini kaldırıp bakacaklan bir şeyi zorla çekip alan bir kimse de, mu'min olarak böyle bir şeyi gasp edip almaz.\" Fethu'l-Bari Açıklaması: \"Kim dünyada şarap içer de sonra ondan tevbe etmezse, ahirette ondan mahrum edilir.\" el-Hattabi ve Şerhu's-Sünne adlı eserinde el-Beğavi şöyle demektedir: Hadis, \"böylesi cennete girmez\" anlamındadır. Çünkü şarap cennetliklerin içeceğidir. Onu içmekten mahrum edilmesi, onun cennete girmeyeceğinin delilidir. İbn Abdilberr de şöyle demektedir: Bu çok ağır bir tehdit olup, cennete girmekten mahrum oluşa delildir. Çünkü yüce Allah cennette içenlere lezzet veren şaraptan nehirler bulunduğunu, bu şaraptan içtikleri için başlarının ağrımayacağını, saçmalamayacaklarını haber vermiştir. Eğer içki içen bir kimse cennette içki olduğunu yahut ona ceza olmak üzere mahrum edildiğini bildiği halde girecek olursa, cennette üzüntü ve kederin de söz konusu olması gerekir. Oysa orada üzüntü ve keder olmayacaktır. Eğer cennette içkinin bulunduğunu bilmiyor ve ona ceza olmak üzere ondan mahrum kılındığını da bilmiyor ise, ondan mahrum edilmekten ötürü onun için bir acı söz konusu olmaz. Bu sebeple kimi ilim adamları şöyle demişlerdir: İçki içen asla cennete girmeyecektir. (İbn Abdilberr) dedi ki: Ancak bu pek benimsenen bir görüş değildir. Hadis ehl-i sünnete göre böyle bir kimsenin diğer büyük günah sahipleri hakkında olduğu gibi, Allah'ın kendisini affetmesi hali müstesna, cennete girmeyeceği ve orada hamrı (şarabı) içmeyeceği şeklinde yorumlanır. O, bu haliyle Allah'ın meşietine kalmıştır. Buna göre hadisin anlamı şöyle olur: Böyle bir kimsenin ahiretteki cezası -yüce Allah'ın onu affetmesi hali dışında- cennete girmekten mahrum edileceği için ahirette de içki içmekten mahrum edilmektir. (İbn Abdilberr devamla) der ki: İlahi affa mazhar olarak cennete girmesi, sonra da orada hiç içki içmemesi, cennette içki olduğunu bilse dahi canının onu çekmemesi ihtimali de düşünülebilir. Bunu Ebu Said'in merfu olarak zikrettiği hadis de desteklemektedir: \"Her kim dünyada ipek giyerse, ahirette onu giymeyecektir. O cennete girse dahi sair cennet ehli onu giyecek ama kendisi giymeyecektir.\" Derim ki: Bu hadisi Tayalisı rivayet etmiş, İbn Hibban da sahih olduğunu belirtmiştir. Buna yakın bir diğer hadis de Abdullah b. Amr'ın merfu olarak rivayet ettiği şu hadistir: \"Kim ümmetimden içki içtiği halde (tevbe etmeksizin) ölürse Allah ona cennette onu içmeyi haram kılar.\" Bu hadisi Ahmed hasen bir senedIe rivayet etmiştir. Hadislerden Çıkan Sonuçlar 1...:-_Tevbe / büyük masiyet olan günahlara keffarettir. Hadis, küfürden tevbe edilmesi halinde günahının keffareti olacağı hususunda kat'i olmakla birlikte, diğer günahlar hakkında ehl-i sünnet arasında kat'i mi yoksa zanni mi olduğu konusunda görüş ayrılığı vardır. Nevevı, daha güçlü görüş zanni olduğudur, demiştir. Kurtubi de şöyle demektedir: Şeriatın hükümlerini iyice inceleyen bir kimse, yüce Allah'ın samimi olarak tevbe edenlerin tevbesini kat'i olarak kabul ettiğini görür. Samimi bir tevbenin ise birtakım şartları vardır. Bu şartlara dair gerekli açıklamalar Rikak bahsinde gelecektir. Bu başlıktaki hadis bazı günahlara dair tevbenin sahih ve doğru olacağına, bazıları için de söz konusu olmayacağına delil gösterilebilir. 2- İçki içmeye dair tehdit, sarhoşluk olmasa dahi içki içen herkesi kapsar. Çünkü hadiste tehdit herhangi bir kayıt söz konusu olmaksızın mücerred içmek hakkında zikrediimiştir. Üzümden yapılan şarap hususunda icma' vardır. Başka sarhoş edici şeyler hakkında da böyledir. Ancak üzümün dışındaki maddelerden yapılıp sarhoşluk vermeyene gelince, cumhura göre onunla ilgili hüküm de böyledir. 3- Nebi efendimizin: \"Sonra ondan tevbe etmezse\" hadisinden tevbenin, gargara denilen can çekişme boğaza varmadığı sürece ömrün tamamında meşru olduğu anlaşılmaktadır. Çünkü \"sonra\" lafzı, arada bir sürenin geçmesinin söz konusu olacağına delildir. Tevbenin kabul edilmesi için hemen günahtan sonra yapılması şart değildir. Doğruyu en İyi bilen Allah'tır. \"İiya'da ... \" Burası Beytu'l-Makdis'in bulunduğu şehirdir. Hadiste hamd etmeyi gerektiren bir şeyin meydana gelmesi ve çekinilen bir şeyin bertaraf edilmesi halinde hamd etmenin meşru olduğu da anlaşılmaktadır. \"İçki içtiği zaman mu'min olarak o içkiyi içmez.\" İbn Battal der ki: Bu hadis içki içmeye dair varid olmuş buyrukların en ağındır. Hariciler buna sarılarak kasten ve haram olduğunu bilerek büyük günah işleyenin kafir olduğuna hüküm vermişlerdir. Ehl-i sünnet ise burada sözü geçen \"iman\"ı kamil iman diye yorumlamışlardır. Çünkü masiyet işleyen bir kimse, iman bakımından masiyet işlemeyene göre imanı daha eksik bir hale düşer. Bu işi yapan bir kimsenin hali, sonunda imanın gitmesine kadar varır, maksadıyla. söylenmiş olma ihtimali de vardır. Nitekim baş tarafları şöyle olan Osman'ın rivayet ettiği hadiste de böyle buyurulmaktadır: \"Hamr'dan uzak durunuz. Şüphesiz ki o, bütün kötülüklerin anasıdır. -Bu hadiste şu ifadeler de vardır-: Şüphesiz hamr ve iman bir arada bulunmaz. Mutlaka onlardan birisinin diğerini dışarı çıkarması da uzun sürmez.\" Bunu Beyhakı hem metfu, hem mevkuf olarak rivayet etmiş, İbn Hibban da merfu rivayetin sahih olduğunu belirtmiştir",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 5579,
			"arabicnumber": 5579,
			"text": "İbn Ömer r.a.'dan, dedi ki: \"Andolsun şarap haram kılındığında Medine'de şarap namına bir şey yoktu",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 5580,
			"arabicnumber": 5580,
			"text": "Enes'ten, dedi ki: \"Hamr bize haram kılındı. Haram kılındığı sırada bizler -Medine'de- üzümlerden yapılan hamrı ancak çok az bulabiliyorduk. İçkimiz genel olarak Busr denilen taze hurma ile kuru hurma(dan) idi",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 5581,
			"arabicnumber": 5581,
			"text": "İbn Ömer r.a.'dan şöyle dediği rivayet edilmiştir: \"Ömer minbere çıkarak dedi ki: İmdi, hamrı haram kılan buyruk indiğinde beş şeyden yapılırdı: Üzümden, kuru hurmadan, baldan, buğdaydan, arpadan. Hamr, aklı örten her şeydir.\" Fethu'l-Bari Açıklaması: \"Genelolarak hamrımız (içkimiz) busr (denilen hurma koruğu) ile temr (denilen kuru hurma)dan idi.\" Yani sonunda hamra dönüşen, bunların suda ıslatılmış hali, çoğunlukla busr (denilen taze koruk hurma)dan ve temr (denilen olgunlaşmış kuru hurma)dan idi. Denildiğine göre Enes'in maksadı, hamr adını sadece üzümden yapılana tahsis eden kimselerin kanaat ni reddetmektir. Bir başka görüşe göre onun maksadı haram oluşun üzümden edinilen hamra (içkiye) mahsus olmadığı, aksine sarhoşluk verici her içkinin haramlık hükmünde onunla ortak olduğunu anlatmaktır. Bu açıklama daha güçıüciür. Doğrusunu en iyi bilen Allah'tır",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 5582,
			"arabicnumber": 5582,
			"text": "Enes b. Malik r.a.'dan, dedi ki: \"Ebu Ubeyde'ye, Ebu Talha'ya ve Ubey b. Ka'b'a zehv denilen hurma koruğu ile kuru hurmadan yapılan içkiyi dağıtıyordum. Yanlarına birisi gelerek: İçki haram kılındı, dedi. Ebu Talha bunun üzerine: Kalk ey Enes, onu dök, dedi. Ben de onu döktüm",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 5583,
			"arabicnumber": 5583,
			"text": "Mu'temir'den, o babasından şöyle dediğini nakletti: \"Enes'i şöyle derken dinledim: Ben bir eğlence meclisinde ayakta -en küçükleri ben olduğum halde- amcalarıma el-fadıh denilen içkiyi sunuyordum. İçki haram kılındı, denildi, onlar da onu dök, dediler. Ben de onu döktüm. Enes'e: İçkileri ne idi, diye sordum. O: Rutab denilen taze hurma ile busr denilen hurma koruğu içkisi idi, dedi. Ebu Bekr b. Enes dedi ki: Onların hamrı da bu idi. Enes de buna karşı çıkıp reddetmedi",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 5584,
			"arabicnumber": 5584,
			"text": "Enes b. Malik'ten rivayete göre \"Hamr (içki) haram kılındığında o gün içki busr (denilen taze hurma)dan ve temr (denilen olgun kuru hurma)dan yapılıyordu.\" Fethu'l-Bari Açıklaması: \"İçkinin haram kılınışı nazil olduğunda busr ve temrden idi.\" Yani bunlardan yapılıyor veya ediniliyordu. \"Zehv ve temrin fadlhinden ... \" el-fadıh, hurma koruğu ezilip, yarılıp, nebız yapılan içkinin adıdır. Zehv ise rutab seviyesine gelmeden önce kızaran yahut sararan koruk hurma olan el-busr ile aynı şeydir. \"Onlara birisi geldi.\" İbn Merduye'nin rivayetine göre Enes şöyle demiştir: \"Içki haram kılınıp da ashabından birtakım kimseler içki önlerinde olduğu halde bana and verince, ben de ayağımla içkiyi tekmeledim ve: Artık içkinin haram kılınış hükmü nazil olmuştur, dedim.\" \"İçki haram kılındığında o gün içki busrden yapılıyordu.\" Üzümden yapılmış hamr (şarab)ın azının da, çoğunun da haram kılındığı hususunda icma' gerçek\" leştiği gibi, azının haram kılınışındaki illetin, fazlasını içmeye davet edişi olduğu üzerinde de icma' olmuştur. Ama üzümden yapılan şarap ile başkaşeylerden yapılan şarap arasında hüküm bakımından farklılık gözetenler, üzümden yapılan şarap hakkında, -ileride açıklanacağı üzere- pişirilmesi hali dışında azı da, çoğu da haram olur, ama üzümden başkasından yapılanşarabın ancaksarhoşluk veren miktarı haramdır, daha azı haram değildir, demişlerdir. Böylelikle her ikisinde illetin aynı olmasına rağmen, isimlerin farklılığını ileri sürerek bu tür şaraplar arasında fark gözetmişlerdir. Ama üzümden yapılan şarap hakkında söz konusu olan herbir şey başkasından yapılan şeyler hakkında da söz konusudur. Kurtubi der ki: Bu, kıyas türlerinin en inceliklilerindendir. Çünkü burada fer' (küçük önerme) asla (büyük önermeye) bütün nitelikleri bakımından eşit bulunmaktadır. Üstelik bu hususta kıyas, sahih nasların zahirlerine de uygundur. Doğrusunu en iyi bilen Allah'tır. Daha sonra Beyhaki, nebızin su ile kırılması (etkisinin giderilmesi) hususunda gelmiş olan hadisleri söz konusu etmektedir. Bu hadislerden birisini Hemmam b. el-Haris, Ömer'den rivayet etmiştir. Buna göre \"Ömer bir seferde iken ona bir nebız getirildi, o da ondan içti. Arkasından kaşlarını çatıp suratını ekşitti, sonra da: Taif nebızi şiddetlidir (ağırdır), diyerek su istedi ve üzerine su döktükten sonra içti.\" Hadisin senedi kavidir. Bu hususta varid olmuş en sahih rivayet budur. Ama bu o nebızin sarhoşluk verecek sınıra ulaştığı hususunda da bir nas değildir. Çünkü sarhoşluk verecek sınıra ulaşmış olsaydı, üzerine su dökmek, haramlığını gidermezdi. Tahav! de bunu itiraf ederek şöyle demiştir: Eğer haram olacak sınıra ulaşmış olsaydı, su dökmek ile şiddeti gitse bile helal olmazdı. Böylelikle üzerine su dökmeden önce de onun haram olmadığı sabit olmaktadır. Derim ki: O halde nebız sarhoşluk verecek sınıra ulaşmadığı takdirde, azının da, çoğunun da içilmesinin mubah olduğu hususunda görüş ayrılığı yoktur",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 5585,
			"arabicnumber": 5585,
			"text": "Aişe r.anha'den şöyle dediği rivayet edilmiştir: \"Resulullah Sallallahu Aleyhi ve Sellem'e bit'e dair soru soruldu, o da: Sarhoşluk veren her bir içki haramdır, diye buyurdu",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 5586,
			"arabicnumber": 5586,
			"text": "Aişe r.anha'dan şöyle dediği rivayet edilmiştir: \"Resulullah Sallallahu Aleyhi ve Sellem 'e bal nebızi olup -Yemen ahalisinin içtikleri bir içki olan- el-bit' hakkında soru soruldu da Rasulullah Sallallahu Aleyhi ve Sellem: Sekir (Sarhoşluk) veren her bir içecek haramdır, buyurdu",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 5587,
			"arabicnumber": 5587,
			"text": "Enes b. Malik r.a.'den rivayete göre Rasulullah Sallallahu Aleyhi ve Sellem: \"ed-Dubba' denilen (Kabak) ile, zift ile sıvanmış kaplarda nebız (şıra) yapmayınız diye buyurdu. Ebu Hureyre de el-Hantem (denilen testiyi) ve en-Nakır (denilen hurma kütüğü oyularak yapılan) kapları da bunlara katıyordu.\" Fethu'l-Bari Açıklaması: \"Ona el-bit'e dair soru soruldu.\" Bu hadisi Müslim, Ebu Musa'dan diye rivayetetmiştir. Buna göre Nebi Sallallahu Aleyhi ve Sellem kendisini Yemen'e göndermiş, o da ona Yemen'de yapılan bazı içeceklere dair soru sormuştu. Allah Rasulü: \"Bunlar nelerdir diye sorunca, Ebu Musa: Bunlar el-bit' ve el-mezar denilen içeceklerdir, dedi. Bu sefer Allah Rasulü: Sarhoşluk veren her şey haramdır, buyurdu. Ben Ebu Burde'ye: el-Bit' nedir diye sordum. O: Bal nebızi (şırası)dır dedi.\" Hadisten anlaşıldığına göre ister üzüm suyundan, ister başkasından yapılmış olsun, sarhoşluk veren her şey haramdır. el-Mazerı dedi ki: Şiddetlenmeden önce üzüm suyunun helalolduğu üzerinde icma' ettikleri gibi, şiddetlenip kaynayıp köpük attığı takdirde de azının da, çoğunun da haram olduğu üzerinde fukaha icma' etmişlerdir. Bundan sonra eğer kendiliğinden sirkeye dönüşürse yine icma' ile helalolur. O halde nazar-ı itibara alınan bu hükümlerin, edinilen bu içeceklerin değişmesi halinde değişeceğidir. Bu durum ise bunların birbirleriyle oldukça irtibatlı olduklarını göstermekte ve haram kılınış illetinin sarhoşluk veridiik olduğuna delilolmaktadır. O halde bu da şunu gerektirir: Sarhoşluk verme özelliğini taşıyan her bir içkinin azını da, çoğunu da kullanmak haram olur. --- Mazeri'nin açıklamalarıburada sona ermektedir. --- el-Mazeri'nin bir istinbat olarak sözünü ettiği hükmün, haberin bazı rivayet yollarında açıkça ifade edildiği de sabit olmuştur. Ebu Davud ve Nesai sahih olduğunu belirterek İbn Hibban'ın, Cabir'den şöyle dediğini rivayet etmişlerdir: \"Rasulullah s;,ılallahu a1eyhi ve sellem şöyle buyurdu: çoğu sarhoşluk veren şeyin azı da haramdır.\" \"Ebu Hureyre bunlara el-hantem ve en-nakir denilen kapları da katıyordu. Müslim, Zazan yoluyla şöyle dediğini rivayet etmektedir: \"Ben İbn Ömer'e kaplara dair soru sordum ve: Bize bu haber sizin şivenizle ulaştı, sen de bize bunu bizim şivemizle açıkla. O da şöyle dedi: Rasulullah Sallallahu Aleyhi ve Sellem testi demek olan el-Hantemeyi, kabak demek olan ed-dubba'yı, hurma kütüğünün oyularak kap haline getirilmesi demek olan en-nakiri ve zift ile sıvanan kap olan el-mukayyar'ı yasaklad",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 5588,
			"arabicnumber": 5588,
			"text": "İbn Ömer r.a.'dan, dedi ki: \"Ömer, Rasulullah Sallallahu Aleyhi ve Sellem'in minberi üzerinde bir hutbe vererek şunları söyledi: Hamrın (içkinin) haram edilmesi ile ilgili buyruk nazil olduğunda içki beş şeyden yapılıyordu: Üzüm, hurma, buğday, arpa ve bal. Hamr ise aklı örtüp perdeleyen şeydir. Üç husus vardır ki Rasulullah Sallallahu Aleyhi ve Sellem'in onlara dair açıklayıcı hükmünü bize açıklamadan bizden ayrılmamasIni çok arzu ederdim. Bunlar dede ile kelale(nin mirası) ve ribaya (faize) dair bazı hususlardır.\" (Ebu Hayyan et-Teyml) dedi ki: Ben (Amir eş-Şa'bi'ye): Ey Ebu Amr, Sind denilen ülkede pirinçten yapılan bir şey (içki) var. (Onun hükmü nedir?) diye sordum. O: O dediğin Nebi Sallallahu Aleyhi ve Sellem döneminde yoktu -yahut da: Ömer döneminde yoktu- diye cevap verdi. Haccac da, Hammad'dan, o Ebu Hayyan'dan rivayetinde \"üzüm\" yerine \"kuru üzüm\" lafzInI kullanmıştır",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 5589,
			"arabicnumber": 5589,
			"text": "İbn Ömer'den rivayete göre \"Ömer r.a. dedi ki: Hamr (içki) beş şeyden yapılır: Kuru üzümden, kuru olgun hurmadan, buğdaydan, arpadan ve baldan.\" Fethu'l-Bari Açıklaması: Ömer'in bu dedikleri Nebi Sallallahu Aleyhi ve Sellem'den açık ifadeler halinde rivayet edilmiş bulunmaktadıı:. Dört Sünen sahibi tarafından rivayet edilip İbn Hibban'ın da sahih olduğunu belirttiği eş-Şa'bi'den iki yolla nakledilmiş olan rivayete göre \"en-Numan b. Beşir dedi ki: Rasulullah Sallallahu Aleyhi ve Sellem'i şöyle buyururken dinledim: Hamr (içki) sıkılmış meyve suyundan, kuru üzümden, hurmadan, buğdaydan, arpadan ve darıdan yapılır ve ben size sarhoşluk verici her şeyi yasaklıyorum.\" Lafız EbQ Davud'a ait. \"Hamr (içki) aklı örtüp perdeleyen her şeydir.\" (Hamr kökünden gelen ve örtüp perdeleyen anlamı verilen: Hamera lafzı) örten, onunla iç içe olup karışarak onu kendi hali üzere bırakmayan demektir. \"Arzu ederdim\", temenni ederdim. Böyle bir temennide bulunmasının sebebi açıklamanın yapılmış olması halinde ictihadın ihtiva ettiği sakıncalardan uzak kalınmasıdır. Bu sakınca ise düşülmesi ihtimali bulunan hatadır. Her ne kadar idihad dolayısıyla ecir alınsa bile hata yapılması halinde ikinci ecri elde edemez; ama nassın gereğince amel etmek katıksız bir isabettir. \"Bize açıklamayapmadan bizden ayrılmamasını arzu ederdim.\" Müslim'deki rivayette: \"Nihai olarak kendisine başvurulacak bir açıklama\" şeklindedir. Bu ifadeler onun bu konuda Nebi Sallallahu Aleyhi ve Sellem'den gelen bir nass! bilme diğini göstermekte ve diğertaraftan içkiye dair haber verdiği husus dolayısı ile daha başka bir şeye ihtiyaç duymayacak şekilde Nebiden kendisine ulaşmış bir bilgiye sahip olduğu izlenimini vermektedir ki, bu hususta hutbesinde kesin bir kanaatini de belirtmiş oldu. \"Dede ile kelale(nin mirası) ve faize dair bazı bahisler.\" Dededen maksat, mirastan hak ettiği miktarın ne olduğudur. Çünkü ashab-ı kiram bu hususta çok büyük ihtilafa düşmüşlerdir. İleride Feraiz (miras bahisleri) bölümünde(6738.hadiste) Ömer'den bu hususta farklı hükümler verdiğine dair açıklamalar gelecektir. Kelale'ye dair açıklamalar da aynı şekilde Feraiz bölümünde gelecektir. Faiz ile ilgili çeşitli konulara gelince, muhtemelen bu sözüyle riba'l-fadl (denilen fazlalık faizin)e işaret etmektedir. Çünkü nesıe ribası (vade faizi) üzerinde ashab-ı kiram arasında ittifak vardır",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 5590,
			"arabicnumber": 5590,
			"text": "(Abdurrahman b. Ganm el-Eş'ari), Ebu Amir -ya da Ebu Malik- el-Eş'ari'den rivayetle dedi ki: \"Allah 'a yemin ederim, o bana yalan söylemiş değildir. Nebi Sallallahu Aleyhi ve Sellem'i şöyle buyururken dinlemiştir: Ümmetimden bazı kavimler çıkacak ve bunlar hirri (zinayı), ipeği, hamrı ve eğlence aletlerini çalmayı helal belleyecekler. Andalsun bazı topluluklar bir dağın yakınında konaklayacaklar. Çobanları onlara ait koyunlar ile gelecek. Fakir bir kimse bir ihtiyaç için yanlarına varacak da onlar: Sen yarın bize tekrar gel, diyecekler. Allah da onlara geceleyin azap gönderecek, dağı başlarına yıkacak. (Bu azaptan kurtulan) diğerlerini ise kıyamet gününe kadar mesh ederek maymunlara ve domuzlara dönüştürecektir.\" Fethu'l-Bari Açıklaması: \"el-Hirr'i ... helal bilecekler.\" el-Hirr, ferc demektir. Yani zinayı helal bilecekler. \"Çalgı aletlerini\", eğlence araçlarını demektir. \"Ve birtakım topluluklar bir dağın yanında konaklayacaklar.\" (Dağ anlamı verilen) Alem: yüksek dağ demektir. Dağın tepesi diye de açıklanmıştır. \"Allah geceleyin onları helak edecek.\" Geceleyin gönderdiği azap ile onları helak edecek. Çünkü (geceleyin helak etmek anlamı verilen) el-beyat: düşmanın geceleyin baskın yapması demektir. \"Dağı başlarına yıkacak.\" Yani dağı üzerlerine düşürecek, yıkacak. İbn Battal dedi ki: Eğer alem 'den kasıt dağ ise onu üzerlerine kısım kısım yıkacaktır. Eğer yüksek bir bina demek ise o binayı yıkacaktır ve buna benzer bir iş olacaktır, demektir. Hadisten Çıkan Sonuçlar 1- Bu hadiste Allahlın haram kıldığı bir şeyi ismini değiştirmek suretiyle helal kılmak için hileli yollara sapan kimselere ağır bir tehdit vardır. 2- Hüküm, illet ile beraberdir. İçkinin haram kılınmasındaki illet ise sarhoşluk vermesidir. O halde sarhoşluk nerede bulunursa haram hükmü de orada . vardır. İsterse isim devam etmesin. 3- İbnu'l-fuab1 der ki: Bu hadis, hükümlerin, isimlerin lafızlan ile değil de bizzat manalar ile alakalı olduğu hususunda esaslı bir dayanaktır. Bu da hükmü lafza ait olarak kabul edenlerin kanaatini reddetmektedir",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 5591,
			"arabicnumber": 5591,
			"text": "(Ebu Hazim'den, dedi ki): Ben Sehl'i şöyle derken dinledim: \"Ebu Useyd es-Saidi gelerek Rasulullah Sallallahu Aleyhi ve Sellem'i kendi düğün (yemeğin)e davet etti. Onlara hizmet eden -gelin haliyle- hanımı idi. Hanım!: Rasulullah Sallallahu Aleyhi ve Sellem'e ne içecek ikram ettiğimi biliyor musunuz? Ben ona geceden bir tevr (denilen toprak ya da taşdan yapılmış kap) içinde birkaç tane hurma ıslatmıştım (da onun şırasını içirdim), dedi",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 5592,
			"arabicnumber": 5592,
			"text": "Cabir r.a.'dan, dedi ki: \"Resulullah Sallallahu Aleyhi ve Sellem birtakım kapları kullanmayı yasakladı. Ensar: Biz onları kullanmadan edemeyiz, dediler. Allah Resulü de: O halde bunları kullanmak nehyedilmez, diye buyurdu.\" Süfyan'dan rivayete göre o bu hadisi naklederken: \"Nebi Sallallahu Aleyhi ve Sellem kaplar anlamı verilen \"ez-zurCıf\" lafzı yerine (aynı anlamdaki) el-ev'iye (lafzını kullanarak) nehyedince ... \" demiştir",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 5593,
			"arabicnumber": 5593,
			"text": "Abdullah b. Amr r.a.'dan şöyle dediği rivayet edilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem içecek doldurmak için kullanılan birtakım kapları kullanmayı yasaklayınca ona: Herkes içecek koyacak bir kap bulamayabilir, denildi. Bunun üzerine o da zift ile sıvanmış olanlar dışındaki testileri kullanmak hususunda onlara ruhsat verdi",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 5594,
			"arabicnumber": 5594,
			"text": "Ali r.a.'dan, dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem ed-Dubba (kabak) ile el-müzeffet (zift ile sırlanmış, sıvanmış) denilen kapları kullanmayı nehyetti",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 5595,
			"arabicnumber": 5595,
			"text": "İbrahim'den şöyle dediği rivayet edilmiştir: \"Ben el-Esved'e: mu'minlerin annesi Aişe'ye, içinde nebız (şıra) yapılması mekruh olan kaplara dair bir soru sordun mu, dedim. O: Ben mu'minlerin annesi Nebi Sallallahu Aleyhi ve Sellem nelerden nebız (şıra) yapılmasını nehyetti, diye sordum, dedi. O: Allah Resulü bize yani ehl-i beytine dubba (denilen kabak) ve müzeffet denilen (zift ile sırlanmış) kapial'da nebız (şıl'a) yapmamızı nehyetti, dedi. Ben: (İbrahim) ona: O testi ile el-hantem denilen testi türünü söz konusu etmedi mi, diye sordum. O da (yani el-Esved de) bana: Ben sana duyduğum şekilde hadisi naklediyorum. Sana duymadığımı hadis diye nakledebilir miyim, dedi",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 5596,
			"arabicnumber": 5596,
			"text": "Abdullah b. Ebi Evfa r.a.'dan şöyle dediği rivayet edilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem yeşil testileri kullanmayı nehyetti.\" Ben (ravilerden eş-Şeybani) ona Abdullah b. Ebi Evfa'ya): Peki, beyaz olanlarından içebilir miyiz, diye sordum. O: Hayır, dedi.\" Fethu'l-Bari Açıklaması: İbn Battal dedi ki: Çeşitli kapları kullanmanın yasaklanışı, zerianın sonunu getirmek (harama giden yolları kapatmak) için idi. Bu sebeple ashabın: Bizlerin şıra yapmak için bu kaplara ihtiyacımız var, başkasını bulamıyoruz demeleri üzerine o da: Şıra yapabilirsiniz ama sarhoşluk verici her şey haramdır, diye buyurdu. Başka bir husus göz önünde bulundurulmak suretiyle yasaklanmış her şey hakkında hüküm böyledir. Bu takdirde zaruret dolayısıyla hüküm kalkar. Yollarda oturmanın yasaklanışı gibi. .. Ashab: Yollarda oturmak bizim için kaçınılmaz bir şeyciir deyince, Allah Rasulü de: \"O halde yolun hakkını veriniz\" diye buyurdu. el-Hattabı de şöyle demiştir: Cumhur, nehyin ilk zamanlarda ?Iduğu, sonra da neshedildiği görüşündedir. Bir kesim de bu kaplarda nebız (şıra) yapma yasağının kalıcı olduğu kanaatindedir. İbn Ömer ve İbn Abbas bu kanaatte olanlar arasındadır. Malik, Ahmed ve İshak da bu görüştedirler. Evet, el-Hattabı bunu bu şekilde mutlak olarak söylemiş bulunmaktadır. Hattabı der ki: Ancak birinci görüş daha sahihtir. Bu nehyin asılsebebi de şudur: İçkinin mubah olduğu dönem henüz fazla uzak değildi. Haram olduğu hükmü etrafa yayılınca artık onlara sarhoşluk veren içkileri terk etmek şartıyla her kapta nebız (şıra) yapmaları mubah kılındı. Yasağın devam ettiği görüşünde olanlara nesh edici hüküm ulaşmamış gibidir. el-Hazimı de şöyle demektedir: İmam Malik'in görüşünüdestekleyen kimseler şöyle diyebilirler: Önce bütün kapların kullanılmasına dair yasak geldi. Daha sonra bu kaplardan, derilerden yapılmış kaplar ile ziftlenmemiş testiler nesh edildi. Diğerlerinin yasaklığı ise devam etti. Ancak diğer taraftan buna Müslim'de yer alan Bureyde yoluyla gelen şu lafızdaki hadis söz konusu edilerek itiraz edilmiştir: \"Daha önce ben sizlere deriden yapılmış kaplar (kırbalar) dışındaki bütün kaplardan içecekleri yasaklamış idim. Şimdi her bir kaptan içebilirsiniz. Ancak sarhoşluk verici bir şey içmeyiniz.\" (el-Hazimı) dedi ki: Her iki rivayetin telif yolu şöyle yapılabilir: Nehy genel olarak bütün kaplar hakkında varid olunca, ona bu kaplara muhtaç olduklarını belirterek şikayet arz ettiler. Bunun üzerine onlara deriden yapılmış kaplarda nebız yapmaya ruhsat verdi. Arkasından herkesin böyle bir kap (kırba ve benzeri) bulamadıklarından şikayet edince, bu sefer onlara bütün kapları kullanmaya ruhsat verdi",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 5597,
			"arabicnumber": 5597,
			"text": "Ebu Hazim dedi ki: Sehl b. Sa'd es-Said1'yi şöyle derken dinledim: \"Ebu Useyd es-Said1 Nebi Sallallahu Aleyhi ve Sellem'i düğün (yemeğin)e davet etti. O gün onların hizmetini gelin olan hanım! yapmıştı. Hanımı: Rasulullah Sallallahu Aleyhi ve Sellem'e neyi ıslatıp şırasını verdiğimi biliyor musunuz? Ben ona geceden bir tevr (denilen toprak, taştan yapılma kap) içinde birkaç hurma ıslatmıştım (da onun suyunu ona ikram ettim), dedi",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 5598,
			"arabicnumber": 5598,
			"text": "Ebu'l-Cuveyriye'den şöyle dediği rivayet edilmiştir: \"İbn Abbas'a bazek denilen içecek hakkında soru sordum. O bana: Muhammed Sallallahu Aleyhi ve Sellem bazek hakkında hükmünü önceden vermiş bulunuyor. Sarhoşluk veren her şey haramdır, diye buyurmuştur, dedi. (Ebu'I-Cuveyriye): Şarap (denilen içecek) hoş ve hela! bir şeydir dedi. İbn Abbas: Helal ve hoş olanın dışında ancak haram ve murdar olan vardır, diye cevap verdi",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 5599,
			"arabicnumber": 5599,
			"text": "Aişe r.anhiı'dan rivayete göre \"Nebi Sallallahu Aleyhi ve Sellem helvayı ve balı severdi\" demiştir. Fethu'l-Bari Açıklaması: \"el-Bazek\", kaynatıhp pişirilen şarap demektir. Ebu Ubeyde -ki b. el-Cerrah'tır- Muaz -ki İbn Cebel 'dir- 'dan nakledilen sözlerini Ebu Müslim el-Keccl, Said b. Mansur ve İbn Ebi Şeybe, Katade yoluyla Enes'ten diye rivayet etmişlerdir: \"Ebu Ubeyde, Muaz b. Cebel ve Ebu Talha tıla denilen şırayı ve üçte ikisi gidip, üçte biri kalıncaya kadar pişirilen şarabı içerlerdL\" Tıla, pekmez demektir. Develere sürülen (ve tıla adı verilen) katrana benzetilmiştir. Bu da develerin yağlandığı katran anlamındadır. Üzümün sıkılmış suyu katılaşıncaya kadar pişirildiği takdirde. develere sürülen katranın katılığına benzer. Bu durumda da çoğunlukla sarhoşluk vermez. Omer onunla birlikte adı geçenlere belirtilen hüküm konusunda Ebu Musa ve Ebu'd-Derda da muvafakat etmişlerdir. Ebu Musa ve Ebu'd-Derda'nın bu görüşlerini de Nesai onlardan nakletmiş bulunmaktadır. Ali, Ebu Umame, Halid b. el-Velid ve diğerlerinin de buna muvafık kanaatlerini İbn Ebi Şeybe ve başkalarırivayet etmiş bulunmaktadır. Tabi'inden İbnu'lMüseyyeb, el-Hasen ve İkrime, fukahadan ise es-Sevri, el-leys, Malik, Ahmed ve Cumhur da onlara bu görüşte muvafakat etmişlerdir. Bunlara göre onu içmenin mubah olmasının şartı, sarhoşluk vermemesidir. Ancak bir kesim de vera , yolunu seçerek bunu mekruh görmüşlerdir. \"İçki kokusu aldım. Ben o içkinin durumunu soruş.turacağım. Eğer sarhoşluk veriyorsa ona celde vuracağım.\" Bu da ko ku sebebiyle had uygulamanın caiz oluşuna delil gösterilmiştir. Kur'an'ın Faziletleri bahsinde İbn Mesud'dan buna göre uygulama yaptığına dair nakil gelmiş bulunmaktadır. İbnu'l-Münzir de Ömer b. Abdulaziz ve Malik'ten buna benzer bir kanaat naklettniştir. Malik dedi ki: Daha önce içki içip de tevbe edenlerden adaletli iki kişi, aldıkları kokunun şarap kokusu olduğuna dair şahitlik ederse had uygulamak icap eder. Ancak cumhur buna muhalefet ederek: Had ancak ya ikrar ile yahut içki içildiğine tanık olunduğuna dair beyyine ile icap eder. Çünkü bazen kokular birbirine benzeyebilir. Had ise bir şüphe ile birlikte uygulanmaz. Ömer'in başından geçen olayda koku sebebiyle celde cezası uyguladığına dair açık ifade yoktur. Aksine anlatılanların zahiri, onun bu hususta ikrara ya da beyyineye dayanmış olmasını gerektirmektedir. Çünkü sormadıkça oğluna celde vurmamıştır. \"Muhammed Sallallahu Aleyhi ve Sellem bazekin hükmünü daha önceden açıklamış bulunmaktadır. Sarhoşluk veren herşey haramdır.\" el-Mühelleb dediki: Yani onlar şaraba bazek adını vermeden önce de O Sallallahu Aleyhi ve Sellem şarabı haram kılmıştı. İbn Battal dedi ki: \"Sarhoşluk veren herşey haramdır\" sözü ile bunu yaptığını kastetmektedir. Bazek, baldan yapılan bir içkidir. Anlamın şöyle olma ihtimali de vardır: Muhammed Sallallahu Aleyhi ve Sellem'in, şarabın haram oluşuna dair hükmü, onların bu şaraba bir başka isim vermelerinden öncedir. Onların ismini değiştirmeleri sarhoşluk verici olması halinde onu helal kılmaz. (İbn Batlal) dedi ki: Sanki İbn Abbas soru sorandan bazek denilen içkiyi helal gördüğü anlamını çıkarmış gibidir. Bundan dolayı işin kökünü kestirip atmış ve böyle bir ümidini suya düşürmüş, onun dayandığı noktadan onu uzaklaştırarak kendisine: Sarhoşluk veren her şeyin haram olduğunu ve verilen adlara itibar edilmeyeceğini haber vermiştir",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 5600,
			"arabicnumber": 5600,
			"text": "Enes r.a.'dan şöyle dediği rivayet edilmiştir: \"Ben, Ebu Talha, Ebu Dücane ve Süheyl b. el-Beyda'ya busr (denilen hurma koruğu) şırası ile temr (denilen hurma) nebızi karışımını içirmekte iken şarap haram kılınıverdi. Ben onlara sakilik edip o içkiyi sunan kişi olmama rağmen ve yaşça en küçükleri olduğum halde hemen onu atıverdim. O gün için biz onu (o içkiyi) hamr (şarap) sayıyorduk",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 5601,
			"arabicnumber": 5601,
			"text": "(Ata b. Ebi Rebah) Cabir r.a.'l şöyle derken dinlemiştir: \"Nebi Sallallahu Aleyhi ve Sellem kuru üzüm, hurma, busr (taze hurma koruğu) ve rutab (denilen taze hurma) şırasını (içmeyi) yasakladı",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 5602,
			"arabicnumber": 5602,
			"text": "Abdullah b. Ebi Katade'den, o babasından şöyle dediğini rivayet etmektedir: \"Nebi Sallallahu Aleyhi ve Sellem hurma ile (zehv denilen) olgunlaşmamış hurma, hurma ile kuru üzüm (şıralarının) biraraya getirilmesini nehyetmiştir. Bunların her birinin ş!ras! ayrı ayrı yapılmalıdır.\" Fethu'l-Bari Açıklaması: \"Sarhoşluk verici olduğu takdirde hurma koruğu ile hurmanın (şırasının) karıştırılmaması görüşünde olanlar.\" İbn Battaı dedi ki: Buhari'nin \"sarhoşluk verici olduğu takdirde\" tabirini kullanması bir yanlışlıktır. Çünkü burada iki şeyi birbirine karıştırma yasağı, çok miktarda içilmeleri halinde sarhoşluk vermese dahi genel bir yasaktır. Çünkü kişi fark etmesede bunların sarhoşluk verici hale gelmeleri çok çabuk olur. O halde buradaki yasak, mevcut halleri ile iki karışımın sarhoşluk verici oluşundan dolayı değil, sonuçta sarhoşluk verici olabileceklerinden ötürüdür. Çünkü bunlar mevcut halleriyle sarhoşluk verici iseler yasaklandıkları konusunda zaten görüş ayrılığı yoktur. Tahavi \"İhtilafu'l-Ulema\" adlı eserinde el-leys'ten şöyle dediğini nakletmektedir: Ben hurma nebızi (şırası, hoşafı) ile kuru üzüm nebızinin birbirlerine karıştırıldıktan sonra hep birlikte içilmelerinde bir sakınca görmüyorum. Çünkü yasak bunların nebızlerinin bir arada yapılması, sonra da içilmesi ile ilgilidir. Zira bunların biri, diğerinin şiddetini artırır. \"Bunların her biriayrı ayrı nebız yapılır.\" Müslim'de, Ebu Said yoluyla gelen hadiste şöyle denilmektedir: \"Sizden nebız içen bir kimse onu ya tek başına kuru üzüm, yahut tek başına hurma, yahut tek başına busr (hurma kOl'UğU) nebızi olarak içsin.\" İbn Ebi Şeybe, Ahmed ve Nesai de el-Harran! yolu ile İbn Ömer'den, nehyin sebebini şöylece rivayet etmişlerdir: İbn Ömer dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem'in huzuruna sarhoş birisi getirildi. Ona celde vurdu. Sonra ona ne içtiğini sordu. Adam: Ben hurma ve kuru üzüm nebızini içtim, dedi. Nebi Sallallahu Aleyhi ve Sellem: Hayır, bunları birbirleriyle karıştırmayınız. Çünkü bunların her birisi tek başına yeter, diye buyurdu.\" Nevevi dedi ki: Mezhebimize mensup ilim adamları ve daha başka alimlerin kanaatine göre karıştırmanın yasaklanış sebebi şudur: İyice sertleşmeden önce karıştırmak sebebiyle sarhoşluk verme özelliği çabucak ortaya çıkar. Böylelikle onu içen bir kimse bunun sarhoşluk verecek sınıra -o sınıra ulaşmış olduğu halde- ulaşmamış olduğunu sanır. Cumhurun görüşüne göre ise bu hususta nehyin anlamı tenzih(ı mekruhluk) ifade eder ve ancak belirtileri saklanılamayacak şekilde açıkça ortaya çıkan sarhoşluk verici bir hale geldiği vakit yasak olur. Bazı Maıiki alimleri de buradaki yasak, haram kılmak içindir, demişlerdir. İbnu'l-Arabı de der ki: İçkinin sebep olduğu sarhoşluk dolayısıyla haram kılındığı, ancak sarhoşluk vermeyen tatlı nebızin (şıra, hoşafın) caiz oluşu da sabit bir hükümdür. Çeşitli kapial'da nebh yapmak yasağı önce sabit olmuş, sonra da nesh edilmiştir. İki cinsi karıştırıp nebız yapmak hususunda ise ilim adamlarının farklı görüşleri vardır. Ahmed, İshak ve Şafillerin çoğu alimleri sarhoşluk vermese dahi haram olduğu görüşündedirler. Klifeliler ise helal olduğunu söylemişlerdir. Bizim ilim adamlarımız ise mekruh oluşu üzerinde ittifak etmişlerdir, ama bu kerahetin tahrimı bir kerahet mi, tenzihı bir kerahet mi olduğu hususunda görüş ayrılıkları vardır. Aynı şekilde yasağın illetinin ne olduğu hususunda da görüş ayrılığı vardır. İllet, birinin diğerinin şiddetini (sertliğini) artırmasıdır denildiği gibi, sarhoşluk verici özellikleri çabucak ortaya çıkar, diye de açıklanmıştır. Devamla dedi ki: Balın süt ile kanştırılmasının burada sözü geçen farklı iki şeyin karıştırılması kabilinden olmadığı hususunda da görüş ayrılığı yoktur. Çünkü sütün nebızi yapılmaz. Onun Şafiılerin çoğunluğundan diye naklettiği görüşe dair Şafii'den ona uygun bir nas da bulunmuştur. Şafiı şöyle demektedir: Nebi Sallallahu Aleyhi ve Sellem'in iki şeyi birbirine karı~tırmaya dair nehyi sabittir. O halde hiçbir şekilde caiz olamaz. Maıik'ten ise şöyle dediği nakledilmektedir: Ben ~ehrimizde (Medine'de) ilim ehlinin bu görüşte olduğunu gördüm. el-Hattabi de şöyle demektedir: Birbirine karıştırılmış iki şeyin ~ırası sarhoşluk verici olmasa dahi haram olduğu görüşü bir topluluk tarafından hadisin gereğince am el etmek üzere kabul edilmiştir. Bu aynı zamanda Malik, Ahmed ve İshak'ın görüşü olup Şafii mezhebinin de kuvvetli görüşüdür. Derler ki: Her kim iki karı~ımı birlikte içerse tek bir sebep dolayısıyla günahkar olur. Eğer ~iddetlendikten (sertle~tikten) sonra içerse iki bakımdan günahkar olur. el-leys ise yasağı her ikisinin birlikte nebız yapılması haline ait özel bir hüküm olarak kabul etmiştir.---Nevevl'nin sözü burada bitti.--- Kurtubi der ki: İki karı~ıma dair yasak (nehy), hükmünün haram oluşu hususunda gayet açıktır ve bu, çe~itli bölge fukahasının cumhurunun da kabul ettiği görüştür",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 5603,
			"arabicnumber": 5603,
			"text": "Ebu. Hureyre r.a.'dan şöyle dediği rivayet edilmiştir: \"Rasulullah Sallallahu Aleyhi ve Sellem İsra'ya götürüldüğü gece ona bir kase süt ile bir kase şarap getirildi",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 5604,
			"arabicnumber": 5604,
			"text": "Ümmü el-Fadl'dan, dedi ki: \"Arafe gününde insanlar Rasulullah Sallallahu Aleyhi ve Sellem'in oruçlu olup olmadığı hususunda tereddüt etti. Ben ona içinde süt bulunan bir kap gönderdim. O da içti.\" Süfyan bazen şöyle derdi: \"İnsanlar Arafe gününde Rasulullah Sallallahu Aleyhi ve Sellem'in oruçlu olup olmadığı hususunda tereddüt etti. Bunun üzerine Ümmü el-Fadl ona (içinde süt bulunan bir kap) gönderdi.\" Süfyanla: Bu hadis kimden gelmiştir diye sorulduğunda, o: Hadis Ümmü el-Fadl'dan diye rivayet edilmiştir, derdi",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 5605,
			"arabicnumber": 5605,
			"text": "Cabir b. Abdullah'tan dedi ki: \"Ebu Humeyd,en-Naki' denilen mera(da otlayan koyunlar)dan bir kase süt getirmişti. Rasulullah Sallallahu Aleyhi ve Sellem ona: Üzerine enine bir çubuk koymak suretiyle dahi olsa keşke üzerini örtseydin, dedi.\" Tekrar 5606",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 5606,
			"arabicnumber": 5606,
			"text": "A'meş'den, dedi ki: Ben Ebu Salih'i -zannederim Cabir r.a.'dan diyerek- hadisi zikredip şöyle derken dinledim: \"Ebu Humeyd -adında ensardan bir adam- en-Naki' denilen yerden içinde süt bulunan bir kabı Nebi Sallallahu Aleyhi ve Sellemle getirdi. Nebi Sallallahu Aleyhi ve Sellem: Üzerine enine bir çubuk koymak suretiyle dahi olsa keşke onu örtseydin, diye buyurdu",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 5607,
			"arabicnumber": 5607,
			"text": "Bera r.a.'dan, dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem beraberinde Ebu Bekir ile birlikte Mekke'den geldi. Ebu Bekr dedi ki: Bir çobanın yanından geçtik. Rasulullah Sallallahu Aleyhi ve Sellem de susamıştı. Ebu Bekr r.a. dedi ki: Ben bir kasenin içine bir miktar süt sağdım. Gönlüm rahat edinceye kadar ondan içti. Bu sırada Suraka b. Cu'şum at üzerinde yanımıza yaklaştı. Ona beddua etti. Suraka ona kendisine beddua etmemesini ve geri dönmeyi teklif etti, Nebi Sallallahu Aleyhi ve Sellem de böyle yaptı",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 5608,
			"arabicnumber": 5608,
			"text": "Ebu Hureyre r.a.'dan rivayete göre Rasulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Sağmal devenin sütünü vermek he güzel bir sadakadır. Seçkin sağmal koyunu (sütünü) hediye etmek ne güzeldir. O koyun sabahleyin bir kap süt verir, akşamleyin bir başka kap süt verir",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 5609,
			"arabicnumber": 5609,
			"text": "İbn Abbas r.a.'dan rivayete göre \"Rasu!ullah Sallallahu Aleyhi ve Sellem süt içtikten sonra ağzını çalka!ayarak: Şüphesiz ki onun bir miktar yağı vardır, diye buyurdu",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 5610,
			"arabicnumber": 5610,
			"text": "Enes b. Malik'ten, dedi ki: \"Rasulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: (Mirac gecesi) bana Sidre gösterildi. Dört nehir ile karşılaştım. İkisi açıktan akıyordu, ikisi de gizliden akıyordu. Açıktan akan iki nehir Nil ile Fırat'tır. Gizliden akan iki nehir ise cennetteki iki nehirdir. Bana üç kase getirildi. Bir kasenin içinde süt, bir kasenin içinde bal, bir kasenin içinde de şarap vardı. Ben içinde süt bulunan kaseyi alıp içtim. Bana: Sen de, ümmetin de fıtratı isabet ettin, denildi.\" Fethu'l-Bari Açıklaması: \"Bir kase süt, bir kase şarap.\" -Haram olmakla birlikte- şarap ile -helal olmakla birlikte- sütten birisini seçmekte serbest bırakılmasının hikmeti ya o sırada henüz şarabın haram kılınmamış olmasıdır, yahut o şarap cennetten olduğundan dolayıdır. Çünkü cennet şarabı haram değildir",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 5611,
			"arabicnumber": 5611,
			"text": "Enes b. Malik'ten, diyor ki: \"Ebu Talha Medine'de ensar arasında en çok hurma ağaçları bulunan kişi idi. Onun malları arasında en sevdiği de Beyruha idi. Burası da Nebi mescidinin tam karşısında idi. Rasulullah Sallallahu Aleyhi ve Sellem buraya girer ve orada bulunan hoş, güzel bir sudan içerdi. Enes dedi ki: \"Siz sevdiğiniz şeylerden infak edinceye kadar bine kavuşamazsınız. \"(Al-i iİmran,92) ayeti nazil olunca Ebu Talha ayağa kalkarak: Ey Allah'ın Rasulü, şüphesiz ki yüce Allah: \"Siz sevdiğiniz şeylerden infak etmedikçe bine ulaşamazsınız\" diye buyuruyor ve şüphesiz benim en sevdiğim malım ise Beyruha'dır. Onu Allah için sadaka olarak bağışlıyorum. Bunun iyiliğini ve azığını Allah nezdinde ümitediyorum. Ey Allah'ın Rasulü, sen onu Allah'ın sana gösterdiği yerde harca, dedi. Bunun üzerine Rasulullah Sallallahu Aleyhi ve Sellem: Oh ne güzel! Bu, faydası sahibine çabuk ulaşan -yahut kar sağlayan, şüphe eden ravi Abdullah b. Mesleme'dirbir maldır. Ben senin neler söylediğini işittim. Ben de o malı akrabalarına ayırmanı uygun görüyorum, diye buyurdu. Bunun üzerine Ebu Talha: Öyle yapayım ey Allah'ın Rasulü, dedi ve Ebu Talha orasını akrabaları ve amcasının çocukları arasında paylaştırdı.\" Fethu'l-Bari Açıklaması: \"Tatlı suyu aramak.\" İbn Battal der ki: Tatlı suyu aramak zühde aykırı olmadığı gibi,yerilen refah kapsamına da girmez. Oysa misk ve benzeri şeylerle suyu hoş ve lezzetli kılmak böyle değildir. Malik ihtiva ettiği israf dolayısıyla bu işlemi mekruh görmüştür. Tatlı su içmek ve bunu aramak ise mubahtır, salih kimseler bu işi yapmıştır. Tuzlu su içmekte de bir fazilet yoktur. Hadisten Çıkan Sonuçlar İbn Battal dedi ki: 1- Hadis hoş ve güzel yemek aramanın caiz olduğuna ve bunun hayır ehli kimselerin uygulamalarından olduğuna delildir. Yüce Allah'ın: \"Ey iman edenler! Allah'ın size helal kılmış olduğu hoş ve temiz şeyleri haram kılmayın.\"(Maide, 87) buyruğunun, lezzetli yiyeceklerden uzak durmak isteyen kimseler hakkında nazil olduğu sabit olmuştur. 2- Yine İbn Battal der ki: Eğer lezzetli şeyleri yemek Allah'ın kullanılmasını istemediği şeylerden olsaydı, bunları söz konusu ederek kullarına olan lütuf ve minnetini hatırlatmazdı. Aksine bunları haram kılmayı yasaklamakla onlardan Allah'm kendilerine ihsan etmiş olduğu bu nimetlerine karşılık şükür etmeleri için bu nimetleri kullanmalarmı dilemiş olmaktadır. Her ne kadar onların şükürleri, onun nimetlerine denk olmuyarsa dahi bu böyledir. 3- İbnu'l-Müneyyir der ki: Tatlı su aramanın zühd ve veraa aykırı olmadığı gayet açıktır. Ama bunun lezzetli yiyeceklerin yenilmesine delil görülmesi de biraz uzaktır",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 5612,
			"arabicnumber": 5612,
			"text": "Enes b. Malik r.a.'dan rivayete göre o \"Rasulullah Sallallahu Aleyhi ve Sellem'i kendi evine (Enes'in evine) geldiği sırada süt içerken görmüştür. Ben ona bir koyunun sütünü sağdım ve Rasulullah Sallallahu Aleyhi ve Sellem için o süte kuyudan çektiğim suyu da kattım. Allah Rasulü kaseyi aldı ve içti. Sol tarafında, Ebu. Bekir, sağ tarafında da bedevi birisi vardı. İçtiğinden artanı o bedeviye verdi. sonra da: Sırasıyla sağdakine verilir, diye buyurdu",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 5613,
			"arabicnumber": 5613,
			"text": "Cabir b. Abdullah r.a.'dan rivayete göre \"Nebi Sallallahu Aleyhi ve Sellem beraberinde ashabından birisi ile olduğu halde ensardan bir adamın yanına girdi. Nebi Sallallahu Aleyhi ve Sellem ona: Eğer yanında geceden kırbada kalmış su varsa getir, değilse doğrudan (bardak ve benzeri bir şey kullanmadan) ağzımızIa içeriz, diye buyurdu. (Cabir devamla) dedi ki: O sırada adam suyu bahçesinde bir taraftan diğerine çeviriyordu. Adam: Ey Allah'ın Rasulü, geceden kalma bir su var, haydi çardağa buyur, dedi. Adam her ikisini alıp çardağa gitti ve bir kaseye su doldurdu. Daha sonra da bir koyunundan üzerine süt sağdı. Cabir dedi ki: Önce Rasulullah Sallallahu Aleyhi ve Sellem içti, sonra da beraberindeki adam içti.\" Bu Hadis 5621 numara ilede geçiyor Fethu'l-Bari Açıklaması: \"Süte su katarak içmek.\" Yani birbirleriyle karışmış oldukları halde içmek. Burada içme kaydını getirmesi, alışveriş esnasında bunları birbirine karıştuomayı dışarıda tutmak içindir. Çünkü bu bir aldatmadır. İbnu'I-Müneyyir dedi ki: Bundan maksadı, böyle bir iş yapmanın iki şeyi birbirine karıştırma yasağının kapsamına girmediğini anlatmaktır. Bu da sarhoşluk verici iki şeyi birbirine karıştırmaya dair kaydın faydasını daha da pekiştirmektedir. Yani iki şeyi birbirine karıştırması, onlardan her birisi sarhoşluk veren türden olması halinde nehyedilmiştir. Çünkü onlar süte su katıyorIardı. Çünkü süt sağı 1dığı vakit sıcak olur. O bölgeler de çoğunlukla sıcak bölgelerdi. Bu sebeple sütün sıcağını soğuk su ile kırıyorlardı. \"Ebu Bekir de sol tarafında idi.\" İçecekler bahsinde Şuayb yoluyla ezZühri'den bu hadiste şu ifadeleri n de geçtiği belirtilmiştir: \"Ömer elindeki kaseyi bedeviye vereceğinden korkarak: Ebu Bekir'e ver, dedi.\" Ebu Tıvale yoluyla gelen rivayette de: \"Ömer: İşte Ebu Bekir burada, dedi\" şeklindedir. el-Hattabi ve başkaları der ki: Cahiliye dönemi hükümdarları ve başkanlarının alışageldikleri adet, içecek ikramı konusunda sağdakine öncelik vermek şeklinde idi. O kadar ki Amr b. Külsum bir kasidesinde: \"Ve kaseler sağ taraflardan yol alıyordu\" demektedir. Bundan dolayı Ömer, içeceğin ikramı hususunda bedevi arabı Ebu Belde önceleyeceğinden korktuğu için ona dikkat çekmek istemiştir. Çünkü o, Nebi Sallallahu Aleyhi ve Sellem'in Ebu Bekir'i bu adete uymayarak tercih edeceğini bir ihtimal olarak görmüştü. Böylelikle içecek şeyin ikramı hususunda daha faziletli olan sağda bulunana göre öncelenmesi bir sünnet halini alacaktı. Ancak Nebi Sallallahu Aleyhi ve Sellem fiili uygulaması ve sözleri ile sünnetin bu adeti değiştirmemiş olduğunu ve bunun hala devam ettiğini, sağda bulunanın bu hususta daha faziletli olandan önce geldiğini, bunun ise daha faziletli olanın mertebesini a1çaltmayl gerektirmediğini, bu uygulamanın da sağın sola üstünlüğü dolayısıyla olduğunu beyan etmiş oldu. \"Eğer sende bir kırbada geceden kalmış su varsa ... \" Buradaki kırba (şenne lafzı) eskimiş kırba demektir. el-Mühelleb dedi ki: Geceden kalma su istemesindeki hikmet, bunun daha soğuk ve daha arı duru oluşundan dolayıdır. Süte . süt karıştırmaya gelince, muhtemelen bu sıcak bir günde olmuştu. Nitekim Ebu Bekr'in çoban ile başından geçenlerde böyle olmuştu. Derim ki: Ama bu iki olay birbirinden farklıdır. Ebu Bekir'in süte su katması aşırı sıcaktan ötürü idi. Ensardan olan zatın bu uygulaması ise Nebi Sallallahu Aleyhi ve Sellem'e katıksız, tek başına su içirmek istemediğinden ötürü idi. Bu sebeple suya süt katmak suretiyle hem Nebi efendimizeistediğini getirdi, hem de beğenip tercih etmek adetinde bulunduğu kabilden ona ilavede bulundu",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 5614,
			"arabicnumber": 5614,
			"text": "Aişe r.anha'dan, dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem tatlıyı ve balı severdi.\" Fethu'l-Bari Açıklaması: \"ez-Zühri dedi ki: İnsanl~rın karşı karşıyakaldıkları bir zorluk ve sıkıntı dolayısıyla sidiklerini içmek helal değildir. Çünkü o bir pisliktir. Yüce Allah: \"Size hoş ve temiz şeyler helal kılındı.\"(Maide, 5) diye buyurmuştur.\" İbnu't-TIn bunu şöyle açıklamıştır: Nebi Sallallahu Aleyhi ve Sellem sidiğe ricz (pislik, necaset) adını vermiş, Cenab-ı Allah da: \"O Nebi onlara pis ve murdar şeyleri haram kılar. \"(A'raf, 157) diye buyurmaktadır. Ricz ise pis ve murdar şeyler arasındadır. Zühri'nin böyle bir istidlaline karşı zorluk ve sıkıntı halinde yine bir ricz (pis) olan meyte (leş) yemenin caiz oluşu gösterilebilir. Bundan dolayı İbn Battal şöyle demiştir: Fukaha Zühri'nin bu sözleriyle dile getirdiği kanaate muhalif kanaattedir. Sidik hakkında söz konusu olacak en ağır durum, necaset arasında ve haram kılınması bakımından meyte, kan ve domuz eti gibi olmasıdır: Zaruret halinde bunların kullanılmasının caiz oluşu hususunda da fukaha arasında görüş ayrı lı ğı yoktur. \"İbn Mesud da sarhoşluk verici şeyler (ile tedavi) hakkında: Allah sizin şifanızı size haram ettiği şeylerde kılmadı demiştir.\" İbnu't-TIn dedi ki: \"Seker: Sarhoşluk verici şey\" hakkında görüş ayrılığı vardır. Bunun şarap olduğu söylendiği gibi, sertleşmeden önce ıslatılmış hurma ve sirke gibi içilmesi caiz şeyler olduğu da söylenmiştir. Sertleşmesi halinde hurma şırası olduğu da söylenmiştir. Derim ki: Nahl suresinin tefsirinde ilim ehlinin çoğunluğundan yapılan nakle göre yüce Allah'ın: \"Ağaçlarının meyvelerinden de içki çikarırsınız ve onlardan güzel bir rızık edinirsiniz.\"(Nahl, 67) buyruğundaki seker (içki) lafzının haram kılınan içki anlamına geldiği de geçmiş b~lunmaktadır. Güzel rızık ise A1lah'ınhelal kıldığı şeydir. Tedavi ve susuzluk gidermek amacıyla içki içmenin caiz oluşu hususunda da görüş ayrılığı vardır. Maıik Bu maksatla içki içemez. Çünkü o ancak susuzluğunu artırır, demiştir. Şafillerce daha sahih olan görüş de budur, ama gösterilen bu gerekçenin yasağın sadece üzüm ve kuru üzüm gibi yapısı itibariyle sıcak olan şeylerden yapılmış içeceklere münhasır olmasını gerektirmektedir. Arpa gibi yapısı serin olan şeylerden edinilen içecekler ise böyle olmamalıdır. Tedaviye gelince, bazıları da şöyle demiştir: Şarap haram kılınmadan önce şaraptaki faydalı hususlar daha önce zikrediJen hadisin de deıa.leti ile haram kılındıktan sonra kaldırılmıştır, Aynı şekilde içkinin haramlığı kat'idir, ama onun bir ilaç olacağı şüpheli bir ihtimaldir. Hatta hadisin mutlak ifadesi dolayısıyla tedavi edici bir ilaç değildir. Diğer taraftan görüş ayrılığı, bu içkilerin sarhoşluk vermeyenleri ile ilgilidir. Bunların sarhoşluk verenlerine gelince, tedavi esnasında kullanılmaları ancak bir durumda caiz, olabilir. O da kangren gibi -ki bundan Allah'a sığınırız-bir sebep dolayısıylabir organ ın kesilmesi için aklının izale edilmesine (uyuşturulmaya) mecbur kalan kimsenin halidir. er-Ram tedavi hususundaki görüş ayrılıklarına binaen yaptığı tahricini mutlak olarak zikretmiş, Nevevı ise burada cevazın söz konusu olmasının sahih olacağını belirtmiştir. Bununla birlikte eğer belirtilen husus, diğer organların sağlıklı kalmaları için izlenecek tek yol ise ve başka bir uyuşturucu bulunamayacak ise, hükmün böyle olması gerekir. Onunla tedavi olmayı caiz kabul edenler ikinci hususu açıkça ifade etmişlerdir. Hanefiler de bunu kayıtsız ve şartsız olarak caiz kabul ederler. Çünkü zaruret meyteyi bile mubah kılar. Kullanılması helalolacak bir hale dönüşmesine imkan yoktur ama sirkeye dönüşebilme ihtimali olan şarabınböyle bir durumda helal olması evveliyetle söz konusudur. Bazı Maliki alimlerine göre zannı galip gereği içmesi halinde hastalıktan kurtulacağıkanaati hakimse (zaruret icabı) kullanması caizdir. Nitekim lokması ağzında tıkanan kimsenin durumu da böyledir. Şafiilere göre ise ağzında lokması tıkanan kimse hakkında daha sahih olan görüş, onu içmesinin caiz olacağıdır. Bu ise sırf teqavi yönünden değildir. İleride Tıb bölümünün sonlarında içki ile tedavi yasağına delil teşkil edecek hususlar gelecektir ki, bu da bu husustaki sahih olan gi)rüşü desteklemektedir",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 5615,
			"arabicnumber": 5615,
			"text": "en-Nezzaı'den, dedi ki: \"Ali r.a.'a Kufe mescidindeki er-Rahbe (geniş tahta) kapısı yakınında iken su getirildi. O da o suyu ayakta içerek: Bazı kimseler ayakta su içmekten hoşlanmazlar. Ben ise Nebi Sallallahu Aleyhi ve Sellem'i siz benim bu yaptığımı gördüğünüz şekilde yaparken görmüşümdür, dedi.\" Bu Hadis 5616 numara ile de geçiyor",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 5616,
			"arabicnumber": 5616,
			"text": "en-Nezzal b. Sebre'nin, Ali r.a.'dan tahdis ettiğine göre, \"Ali r.a. öğle namazını kıldırdı. Sonra da insanların ihtiyaçlarını karşılamak üzere Kufe (mescidi)nin genişliğinde oturdu. Nihayet ikindi namazı vakti girdi. Sonra ona bir su getirildi. O sudan içti, yüzünü ve ellerini yıkadı. -Ravi başını ve ayaklarını da zikretti.- Sonra ayağa kalkıp, ayakta olduğu halde artanı içti. Sonra da: Bazı kimseler ayakta su içmeyi hoş görmüyorlar; ama şüphesiz Nebi Sallallahu Aleyhi ve Sellem benim bu yaptığım gibi yapmıştır, dedi",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 5617,
			"arabicnumber": 5617,
			"text": "İbn Abbas'tan: \"Nebi Sallallahu Aleyhi ve Sellem ayakta olduğu halde Zemzem'den içti, dedi.\" Fethu'l-Bari Açıklaması: Bu hadis ayakta olanın su içmesinin caiz oluşuna delil gösterilmiştir. Ancak bu işi açıkça nehyeden birtakım hadisler de bununla tearuz halindedir. Bunlardan birisi Müslim'in, Enes'ten naklettiği: \"Nebi Sallallahu Aleyhi ve Sellem ayakta su içmeyi kabul etmemiştir\" şeklindeki hadisidir. Yine bunun benzeri bir hadis Müslim'de Ebu Said'den \"nehyetmiştir\" lafzıyla gelmiştir. Buna benzer bir rivayet de Tirmizi'nin hasen olduğunu belirterek naklettiği el-Carad yoluyla gelen hadistir. Müslim'in Ebu Gatafan'dan, onun Ebu Hureyre'den diye ge17n yolla \"sizden hiçbir kimse ayakta su içmesin, unutarak içen olursa kussun\" lafzı ile zikrediImiştir. Müslim'de, Katade yoluyla Enes'ten gelen rivayet: \"Nebi Sallallahu Aleyhi ve Sellem adamın ayakta su içmesini nehyetti. Katade: Biz Enes'e: Ya yemek yemek, diye sorduk. O: O iş daha şerıidir, diy~ cevap verdi\" şeklindedir. el-Mazerı dedi ki: İnsanlar bu hususta ihtilaf etmişlerdir. Cumhurun kanaati ise bunun caiz olduğudur. Bazıları ise bunu mekruh görmüşlerdir. Hocalarımızdan birisi şöyle demiştir: Muhtemelen bu yasak, arkadaşlarına su getirip de onlardan önce bu işi tekeline alırcasına ve bir topluluğa su içiren bir kimse aralarında en son içer kuralının da dışına çıkarak, onlardan önce ayakta su içen kimse hakkındadır. Hocamız dedi ki: Aynı şekilde Ebu Hureyre hadisinde sözü geçen kusma emri de böyledir. İlim ehli arasında, bir kimsenin kusmakla yükümlü olmadığı hususunda görüş ayı•ılığı yoktur. Bazı ilim adamları da şöyle demiştir: Bu rivayetin kuvvetli görülen şekli, bunun Ebu Hureyre'ye mevkuf olduğudur. (Nebie ait bir söz olmadığıdır.) Enes'in hadisi de aynı şekilde ayakta yemek yemeyi, ihtiva etmektedir. Ayakta yemek yemenin caiz oluşu hususunda da görüş ayrılığı yoktur. Gördüğüm kadarıyla ayakta su içmeye dair hadisler, caiz oluşa delildir. Yasak oluşunu ihtiva eden hadisler ise müstehaplığa (oturarak içmenin müstehap oluşuna) ve daha uygun ve kamil olana teşvik diye yorumlanmalıdır, yahut ayakta içmenin zararlı olması dolayısıyla bunu kabul etmediği, kendisinin ise bu hususta güven altında olması dolayısıyla yaptığı şeklinde de açıklanabilir. Nevevi de özetle şunları söylemektedir: Bu hadislerin manası, bazı ilim adamları için içinden çıkılamaz bir hal almıştır. Hatta bu hususta batıl sözler söylemeye kadar gitmişler ve bazılarının zayıf olduğunu ileri sürebilecek kadar cüretkarlık göstermişlerdir. Düşülen hataları yaygınlaştırmanın da açıklanabilir bir tarafı yoktur. Bunun yerine doğru olan zikredilir, hatadan sakındırmak için de onlara işarette bulunulur. Hadislerde içinden çıkılamayacak bir durum olmadığı gibi, aralarında zayıf olanı da yoktur. Aksine doğrusu şudur: Bu hadislerdeki yasak, tenzih hakkında (kaçınmak için) yorumlanır. Ayakta içmek de caiz oluşu devam ettirmek içindir. Nesh ya da başka bir iddiada bulunan kimseler ise hata etmişlerdir. Çünkü nasların telifi mümkün olduğu takdirde tarih (hangisinin önceliği) sabit olsa dahi neshe gidilmez. Nebi Sallallahu Aleyhi ve Sellem'in fiili uygulaması ise cevazı açıklamak içindir. Böyle bir iş onun hakkında asla mekruh olamaz. O herhangi bir şeyi beyan etmek için bir ya da birkaç defa yapardı, ama daha faziletli olanı daha çok ve ısrarla yapardJ. Kusma emri ise müstehaplığa yorumlanır. Dolayısı ile ayakta su içen kimsenin bu açık ve sahih hadis dolayısıyla kusması müstehaptır. Çünkü emrin vücuba yorumlanmasına imkan yoksa müstehaplığa yorumlanır. Iyad'ın: Ayakta su içen kimsenin kusma yükümlülüğünün bulunmadığı üzerinde ilim adamları arasında görüş ayrılığı yoktur, sözlerine ve ayrıca bununla hadisin zayıf oluşuna işaret etmesine gelince, onun bu işaretine hiçbir şekilde iltifat edilmez. İlim ehlinin kusmayı vacip görmemeleri, kusmanın müstehap oluşuna mani değildir. İcma ile böyle bir müstehabın bulunmadığını iddia eden kimse ise, anlamsız bir iddiada bulunmaktadır. Birtakım vehim, iddia ve saçmalar ile sahih sünnet terk edilemez. --- Nevevl'nin sözü burada bitti. --- Hadisten Çıkan Sonuçlar 1- İlim adamı, insanların bir işten kaçındıklarını görüp onun caiz olduğunu biliyor ise, meselenin uzun süre devam edip haram olduğunun zannedilmesini önlemek için doğru olan şekli açıklamalıdır. İlim adamı böyle bir şeyden korktuğu takdirde kendisine soru sorulmadan dahi olsa hükmü açıklamakta elini çabuk tutmalıdır. Eğer soru sorulursa o zaman durumu açıklaması gereği daha da pekişir. 2- Herhangi bir kimseden hoşlanılmayan bir hal görürse, o kişiyi belli bir maksadı yoksa adıyla ayrıca teşhir etmez, aksine Nebi Sallallahu Aleyhi ve Sellem'in benzeri hallerde yaptığı gibi kinayeli olarak onu söz konusu eder",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 5618,
			"arabicnumber": 5618,
			"text": "Haris kızı Ümmü el-Fadl'dan rivayete göre o \"Nebi Sallallahu Aleyhi ve Sellem'e ikindi vakti Arafe'de vakfede iken bir kase süt gönderdi. O da o sütü eliyle alıp içti.\" Malik , Ebu'n-Nadr'dan: \"Devesi üzerinde olduğu halde\" fazlalığını da eklemiştir",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 5619,
			"arabicnumber": 5619,
			"text": "Enes b. Malik r.a.'dan rivayete gÖre, \"Resulullah Sallallahu Aleyhi ve Sellem'e biraz su karıştırılmış bir süt getirildi. Sağ tarafında bedevi bir Arap, sol tarafında da Ebu Bekir vardı. Önce kendisi içti, sonra da bedevi Araba vererek: Sırasıyla sağdakilere verilir, diye buyurdu",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 5620,
			"arabicnumber": 5620,
			"text": "Sehl b. Sa'd r.a.'dan rivayete göre \"Rasulullah Sallallahu Aleyhi ve Sellem'e bir içecek takdim edildi. O da ondan içti. -Sağ tarafında genç bir delikanlı, sol tarafında da yaşlıca kimseler vardı.- Sağındaki gence: Bunlara vermeme izin veriyor musun, diye sordu. Genç: Allah'a yemin ederim ki hayır, ey Allah'ın Resulü! Başkasını kendime tercih ederek senden payıma düşeni ona veremem, dedi. (Sehı) dedi ki: Bu sefer Rasulullah Sallallahu Aleyhi ve Sellem O içeceği o gencin eline koydu.\" Fethu'l-Bari Açıklaması: \"Bir kimse içme sırasında yaşça daha büyük olana vermek için sağında bulunan kimseden izin ister mi?\" Buhari'nin bu hususta kesin hüküm vermeyiş sebebi, muayyen bir olayalup tahsis edilme ihtimalinin bulunmasından ötürü gibi görünüyor. Çünkü böyle bir tahsis söz konusu ise bir mecliste oturanların hepsi hakkında bu hüküm geçerli olmaz. Bu başlık altında Buhari bu konuda Sehl b. Said'ın rivayet ettiği hadisi zikretmektedir. Bu hadis İçecekler bahsinin baş taraflarında geçmiş bulunmaktadır. Orada bu gencin adı da, sol tarafta bulunan yaşlı şahısların bazılarının adları da verilmiştir. Allah Rasulünün: \"Bana izin veriyor musun?\" buyruğu, Enes tarafından rivayet edilen sağ tarafındaki bedevi Arap'tan izin vermesi ile ilgili ifadelerinde geçmemektedir. Nevevı ve başkaları bu hususta şu cevabı verirler: Buna sebep genç delikanlının, amcasının oğlu oluşudur. Bundan dolayı da onu nazlandırıyordu. Sol tarafta bulunan kimseler de aynı şekilde o gencin akrabaları idi. Bununla beraber onun gönlünü hoş ederek izin almak suretiyle ayrıca hükmü beyan edip, sünnetin sağ tarafta bulunan kimse, sol tarafta bulunanlara nispetle daha az faziletli olsa bile sağdakine öncelik vermek olduğunu da göstermiştir. Hadisten Çıkan Sonuçlar 1- Genelolarak içme sırasında sünnet olan, her yerde sağda olana öncelik vermektir. 2- Sağda bulunan kimseye öncelik tanımak, ondaki bir özellikten ileri gelmez. Bu sağ tarafının bir özelliğinden dolayıdır. Bu da sağın sol tarafa olan üstünlüğüdür. Bundan dolayı böyle bir uygulamanın sağda bulunan kimsenin tercih edilmesi anlamına gelmediği, aksine sadece onun ciheti dolayısıyla tercihi demek olduğu da anlaşılmaktadır",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 5621,
			"arabicnumber": 5621,
			"text": "Cabir b. Abdullah r.a.'dan rivayete göre \"Nebi Sallallahu Aleyhi ve Sellem beraberinde ashabından birisi bulunduğu halde ensardan bir adamın yanına girdi. Nebi Sallallahu Aleyhi ve Sellem ve arkadaşı selam verdi. Adam da selamlarını alarak: Ey Allah'ın Rasulü, babam anam sana feda olsun. Bu vakit sıcak bir vakittir, dedi. O sırada da adam bahçesinde suyu bir taraftan diğer bir tarafa çeviriyordu. Nebi Sallallahu Aleyhi ve Sellem: -Adam bahçesinde suyu bir yerden bir başka yere çeviriyorken-: Eğer sende bir kırbada geceden kalmış bir miktar su varsa (bize onu getir), değilse doğrudan ağzımızIa içeriz, diye buyurdu. Adam: Ey Allah'ın Hasölü, yanımda bir kırbada geceden kalmış bir miktar su var, deyip çardağa doğru gidiverdi. Bir kaseye su doldurdu. Sonra da onun üzerine kendisine ait bir koyunun sütünü sağdı. Nebi Sallallahu Aleyhi ve Sellem O süt katılmış suyu içti. Sonra onu geri verdi ve onunla beraber gelmiş olan adam da içti",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 5622,
			"arabicnumber": 5622,
			"text": "Enes r.a.'dan, dedi ki: \"Ben ayakta amcalarima -en küçükleri olduğum halde- fadlh denilen içki yi sunuyordum. Bu sırada içki haram edildi denilince, onlar da: Onu dök, dediler. Biz de hemen döktük.\" (Süleyman et-Teyml dedi ki): \"Enes'e: O zaman içkileri nelerdendi, diye sordum. Enes: Taze hurma ve koruk hurma(dan) idi, dedi. Ebu Bekr b. Enes de hemen dedi ki: Bu fadlh şarabı o gün onların içkileri idi. Enes buna karşı çıkmadı",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 5623,
			"arabicnumber": 5623,
			"text": "Cabir b. Abdullah r.a. diyor ki: \"Rasulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: Gece karanlığı bastırınca -yahut akşamı ettiğinizde- çocuklarınızı dışarı salmayınız. Çünkü o esnada şeytanlar etrafa yayılırlar. Geceden bir saat (süre) geçtikten sonra onları içeri alınız, kapıları kapatınız, Allah'ın adını anınız. Çünkü şeytan kapatılmış bir kapıyı açamaz. Ayrıca kırbalarınızın ağzını bağlayarak Allah'ın adını zikrediniz. Kaplarınızın üzerini de -üzerlerine enine bir şey uzatmak şeklinde dahi olsa-örtünüz, kandillerinizi de söndürünüz",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 5624,
			"arabicnumber": 5624,
			"text": "Cabir'den rivayete göre Rasulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Uyuyacağınız vakit kandilleri söndürünüz, kapıları kapatınız. Su kaplarının ve kırbaların ağzını baSlayınız. Yiyecek ve içecek bulunan kapların üzerini -ravi dedi ki: Zannederim-: Uzerine enlemesine koyacağınız bir sopa ile dahi olsa örtünüz, dedi",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 5625,
			"arabicnumber": 5625,
			"text": "Ebu Said el-Hudrı r.a.'dan şöyle dediği rivayet edilmiştir: \"Rasulullah Sallallahu Aleyhi ve Sellem kırbaların ağızlarının kırılarak (dışa doğru kıvrılarak) su içilmesini yasakladı. \" Bu Hadis 5626 numara ile gelecektir",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 5626,
			"arabicnumber": 5626,
			"text": "Ebu Said el-Hudrı r.a.'dan şöyle dediği rivayet edilmiştir: \"Rasulullah Sallallahu Aleyhi ve Sellem'i kırbaların ağızlarının dışarıya doğru kıvrılarak kırbalardan su içilmesini yasaklarken dinlemişimdir.\" (Ravilerden) Abdullah (b. el-Mubarek) dedi ki: Ma'mer ya da başkası: Bu, kırbaların ağızlarından içmek demektir, diye açıklamıştır. Fethu'l-Bari Açıklaması: \"Kırba ve tulumların ağızlarını dışarıya doğru kıvırmak.\" Bu lafız (ihtinas) bükülmek, kıvrılmak ve kınlmak anlamlarına gelir. (Kırba ve tulum anlamı verilen) eskıye ise sikaa'nın çoğul u olup küçük ya da büyük olsun deriden yapılan su kapları kastedilmektedir. Kırba'nın büyük de, küçük de olabileceği, sikaa denilen su kabının ise ancak küçük olacağı söylenmiştir. \"Ağızlarının kırılarak onlardan su içilmesini\" ibaresinde geçen kırmak'tan kasıtgerçek manasıyla kırmak ve parçasını ayırmak değil, onları kıvırmaktır",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 5627,
			"arabicnumber": 5627,
			"text": "(Eyyub es-Sahtiyanı) dedi ki: İkrime bize dediki: \"Dikkat edin size kısa kısa bazı şeyleri haber vereceğim. Bunları bize Ebu Hureyre tahdis etmişti. Rasulullah Sallallahu Aleyhi ve Sellem kırba ya da tulumun ağzından içmeyi ve kişinin kendi evine komşusunun bir ağaç (kütüğünün) ucunu yerleştirmesine engel olmasını nehyetti",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 5628,
			"arabicnumber": 5628,
			"text": "Ebu Hureyre r.a.'dan rivayete göre \"Nebi Sallallahu Aleyhi ve Sellem kırba ve tulumun ağzından içmeyi yasaklamıştır",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 5629,
			"arabicnumber": 5629,
			"text": "İbn Abbas r.a.'dan rivayete göre \"Nebi Sallallahu Aleyhi ve Sellem kırba ve tulumların ağızlarından içmeyi yasaklamıştır",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 5630,
			"arabicnumber": 5630,
			"text": "Abdullah b. Ebi Katade'den rivayete göre o babasından şöyle dediğini rivayet etmiştir: \"Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: Sizden herhangi bir kimse (bir kab'dan) su içerse kab'ın içerisinde nefes alıp vermesin. Sizden. herhangi bir kimse küçük abdestini bozarsa sağ eliyle zekerini silmesin. Sizden herhangi bir kimse (helada) silindiği zaman sağ eliyle de silinmesin.\" Fethu'l-Bari Açıklaması: \"Su kabı içerisinde nefes alıp vermenin yasaklanması.\" Bu başlık altında Ebu Katade yoluyla gelen hadisi zikretrriiş bulunmaktadır ki bu hadise dair açıklamalar daha önce Taharet bölümünde (154.hadiste) geçmiştir",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 5631,
			"arabicnumber": 5631,
			"text": "Sümame b. Abdullah'tan, dedi ki: \"Enes su içtiği zaman kab(ın dışın) da iki ya da üç defa nefes alırdı. Nebi Sallallahu Aleyhi ve Sellem'in de üç kere nefes aldığını söylemiştir.\" Fethu'l-Bari Açıklaması: \"İki ya da üç nefes ile içmek.\" Başlıkta zikrettiği hadisin lafzında: \"Nefes alırdı\" denildiğihalde, kendisi bu şekilde başlığı tespit etmiştir. Böylelikle bu başlık altında zikrettiği hadis ile bundan bir önceki hadisi bir arada telif etmek istemiş gibidir. Çünkü bu iki hadis zahirleri itibariyle birbiriyle tearuz (çatışma) halindedir. Birinci hadis kapta nefes alıp vermeyi yasaklamak hususunda sarih iken, ikincisi nefes alınıp verileceğini söz konusu etmektedir. Bu durumda bu hadisleri iki ayrı hal ve durum için yorumlamak gerekir. Yasaklama hali kabın içerisinde nefes alıp vermek ile ilgilidir, nefes alma hali de kabın dışında nefes alıp verme ile ilgilidir. İbn Mace'de Ebu Hureyre'den merfu olarak zikredilen hadiste şöyle denilmektedir: \"Herhangi biriniz bir şey içtiği vakit kabın içerisinde nefes alıp vermesin. Tekrarlamak istediği takdirde kabı biraz uzaklaştırsın, sonra isterse bir daha tekrar içsin.\" el-Esrem der ki: Bu hususta rivayet farklılığı, cevaza ve üç defa nefes alıp vermenin tercih edildiğine delildir. Kabın içerisinde nefes alıp vermenin yasaklanışından maksat ise kabın içine girecek şekilde nefes alıp vermemesidir. Yoksa dinlenmek amacıyla kabın dışında nefes almak değildir. Bu hadis bir nefeste içmenin caiz oluşu hususunda Malik'in lehine delil gösterilmiştir. İbn Ebi Şeybe, Said b. el-Müseyyeb 'in ve bir başka kesimin bunu caiz gördüklerini rivayet etmektedir. Ömer b. Abdulaziz de şöyle demiştir: Ancak kabın içerisinde nefes alıp vermek yasaklanmıştır. Nefes alıp vermeyen bir kimse ise arzu ederse bir nefeste de içebilir. Derim ki: Bu, güzel bir ayrımdır. Nitekim Hakim'in rivayet ettiği Ebu Katade yoluyla gelen merfu hadiste tek bir nefesle içme emri de varid olmuştur. İşte bu da sözü geçen bu farklı hallere göre yorumlanır. el-Mühelleb dedi ki: İçerken nefes alıp vermenin yasaklanması, yemeğe ve içilin şeye üflemenin yasaklanması gibidir. Yani bu bazen insanın tükürüğünün bulaşması ve böylelikle içenin bundan tiksinip onu pisolarak değerlendirmemesi içindir. Çünkü bu gibi hallerde tiksinmek, insanların çoğunun tabiatlarında görülen bir haldir. Bunun yasak oluşu da başkası ile birlikte yiyip içmesi hali ile ilgilidir. Kendisi tek başına iken yahut eşi ile ya da yaptıklarından hiçbir şekilde tiksinmediğini bildiği kimselerle beraber iken böyle davranmasında bir beis yoktur. Derim ki: Ama daha uygun olan yasağın genelolarak bütün hallerde olduğunu kabul etmektir. Çünkübütün bunlarla birlikte yine de bir artı ğın kalmayacağından, kabın kirlenmeyeceğinden ya da benzeri bir halden emin olunamaz. İbnu'l-Arabı dedi ki: İlim adamlarımız şöyle demişlerdir: Bu mekarim-i ahlaktandır. Fakat bir kimsenin kardeşine tiksineceği şeyi uzatması da haramdır. Eğer kendi başına bunu yapıp sonra başkası yanına gelir, onu uzatacak olursa, arkadaşına yaptığını söylemesi gerekir. Bildirmeyecek olursa onu aldatmış olur. Aldatmak ise haramdır",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 5632,
			"arabicnumber": 5632,
			"text": "Ebu Leyla'dan, dedi ki: \"Huzeyfe Medain'de bulunuyordu. Kendisine su verilmesini istedi. Bir dihkan (Medain eşrafından birisi) ona gümüş bir kase getirdi. Huzeyfe o kaseyi ona doğru fırlatarak: Benim bunu atmamın tek sebebi, bu işi yapmamasını (defalarca) söylediğim halde bundan vazgeçmeyişidir. Halbuki Nebi Sallallahu Aleyhi ve Sellem de bizlere ipek ve atlas giyinmeyi, altın ve gümüş kaplarda içmeyi yasaklamış ve: Bunlar bu dünyada onlarındır, (kafirlerin) ahirette de sizlerindir diye buyurdu, dedi.\" Fethu'l-Bari Açıklaması: \"Altın kaplarda içmek.\" İbnulI-Münzir altın ve gümüş kaplarda içmenin haram olduğu üzerinde icmal bulunduğunu nakletmiştir. Tabilnden birisi olan Muaviye b. Kurra bundan müstesnadır. Bu husustaki nehiy ona ulaşmamış gibidir. Şafii'nin de kadim görüşüne göre -ki onun kullandığı ifade Harmele'de nakledilmiştir- buradaki nehiy tenzih içindir. Çünkü bu yasağın illeti Acemlere benzemeyi ihtiva etmesidir. Ama yeni mezhebindeki açık ifadesi, haram olduğu şeklindedir. Mezhebine mensup kimi ilim adamı ondan, onun bu hususta kat'i olarak haram olduğunu söylediğini nakletmiştir. Ona yakışan da budur. Çünkü bundan sonraki başlıkta geleceği üzere bunları kullanmaya ka.rşı cehennem ateşinin tehdidi sabittir. Eğer ŞafiiIden diye nakledilen görüş ondan gerçekten sabit olmuş ise sözü geçen hadis ona ulaşmadan önce bu görüşünü belirtmiş olabilir. Diğer taraftan Harmele'de ondan diye yapılan nakilde bir yanılma olduğunu destekleyen husus da şudur: et-Takrib adlı eserin sahibi Zekat bölümünde Harmele'de onun kullandığı ibarelerden altın ya da gümüş kap edinmenin haram kılınışına dair ifadeleri nakletmiş bulunmaktadır. Edinmek haram ise kullanmanın haram oluşu öncelikle söz konusudur. Daha önce değinilen illet ise ittifakla kabul edilmiş bir illet değildir. Aksine ilim adamları bu husustaki nehyin çeşitli illetlerini de söz konusu etmişlerdir. Fakirlerin kalplerini kırmak yahut büyüklenmek ve israf ile iki nakdin (altın ve gümüşÜn) piyasada az bulunmalarına sebep teşkil etmek gibi gerekçeler bunlar arasında sayılmıştır. \"Huzeyfe Medain'de iken ... \" Medain, Dicle kenarında büyük bir şehir olup onunla Bağdat arasında yedi fersah vardır. Medain, Fars krallarının kaldıkları şehir idi. Kisra'nın meşhur Eyvan'ı da oradadır. Medain, Ömer radıyallahu anh'ın halifeliği döneminde h. 16 yılında Sa'd b. Ebi Vakkas'ın kumandanlığında fethedilmiştir. Huzeyfe de önce Ömer radıyallfıhu anh'ın halifeliği döneminde, sOnra da Osman döneminde ve onun şehadetinden sonra, vefat edene kadar Medain valiliği ni yapmıştır. \"Kendisine su getirilmesini istedi. Bir dihkan ona ... getirdi.\" Dihkan Farsça'da kasabanın büyüğü demektir. Yiyecekler bahsinde Seyf yoluyla Mücahid'den o İbn Ebi Leyla'dan \"Huzeyfe'nin huzurunda idiler. O kendisine su getirilmesini istedi. Bir Mecusi ona su getirdi. .. \" diye geçmiş idi. \"Gümüş bir kase ile.\" Müslim'de \"Abdullah b. Ukeym yoluyla Huzeyfe'nin huzurunda idik. Bir dihkan ona gümüş bir kap içerisinde bir içecek getirdi ... \" şeklindedir. \"Ve: Bunlar dünya da onların (kafirlerin)dir ama ahirette de bunlar sizin olacaktır.\" el-İsmaill dedi ki: \"Dünyada\" lafzı onların bu dünya hayatında bunları kullanmalarının mubah kılındığı anlamına gelmez; ama \"onlarındır\" ifadesinden kasıt, Müslümanlara muhalefet olarak onlar bunları kullanırlar, demektir. Aynı şekilde \"ahirette ise sizindir\" yani dünya hayatında bunu terk etmenize kafşılık mükafat olarak siz bunları ahirette kullanacaksınız. Ama bunları kullanmak suretiyle dünyada Allah'a karşı geldiklerinden, ceza olarak bunu ahirette kullanamayacaklardır",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 5633,
			"arabicnumber": 5633,
			"text": "ibn Ebi Leyla'dan, dedi ki: \"Biz Huzeyfe ile birlikte çıktık. Huzeyfe Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu zikretti: Altın ve gümüş kaplarda içmeyiniz. İpek ve atlas da giyinmeyiniz. Çünkü bunlar kıyamet gününde onlarındır, ahirette de sizin olacaktır",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 5634,
			"arabicnumber": 5634,
			"text": "Nebi Sallallahu Aleyhi ve Sellem'in zevcesi Ümmü Seleme'den rivayete göre Rasulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Gümüş kab'dan içen bir kimse aslında karnına yudum yudum cehennem ateşini doldurur",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 5635,
			"arabicnumber": 5635,
			"text": "Bera b. Azib'den, dedi ki: \"Resulullah Sallallahu Aleyhi ve Sellem bize yedi şeyemretti, yedi şeyi de yasakladı: Bize hastayı ziyaret etmeyi, cenazelerin arkasından gitmeyi, aksırıp elhamdulillah diyene yerhamukellah demeyi, davette bulunanın davetine icabet etmeyi, selamlaşmayı yaygınlaştırmayı, mazluma yardım etmeyi ve yemin verenin yeminini yerine getirmesini emretti. Diğer taraftan bize altın yüzük takmayı, gümüş içinde içmeyi -ya da gümüş kaptan içmeyi- içi pamukla doldurulmuş, yüzleri atlas ve ipek olan eğer ve semeı-ler üzerine konulan küçük yastıklar kullanmayı, el-kassiy denilen ipek katılmış elbiseler kullanmayı, ince ipek, kalın ipek ve atlastan elbiseler giyinmeyi yasakladı. \" Fethu'l-Bari Açıklaması: Bu hadislerde altın ve gümüş kapIal'da yemenin ve içmenin erkek ya da kadın bütün mükelleflere haram olduğu ve bunların kadınların süs eşyaları gibi olmadığı belirtilmektedir. Çünkü bunlar herhangi bir şekilde kadın için mubah kılınan süs eşyaları ile ilgisi olmayan şeylerdir. Kurtubi ve başkaları şöyle demektedir: Hadis-i şerifte yemek ve içmek için altın ve gümüş kapların kullanılmasının haram olduğu belirtilmektedir. Koku sürünmek, sürmedanlık ve diğer kullanım şekilleri de bunlara dahildir. Cumhur da böyle demiştir. Daha önce geçtiği üzere kullanım dışındaki amaçlar için kap edinme hususundaysa görüş ayrılığı vardır. Daha meşhur olan, bu tür kapları edinmenin dahi yasak olduğudur. Cumhurun görüşü de budur",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 5636,
			"arabicnumber": 5636,
			"text": "Ümmü'l-Fadl'dan rivayete göre \"Ashab Arafe günü Nebi Sallallahu Aleyhi ve Sellem'in oruçlu olup olmadığı hususunda şüphe ettiler. Ona içinde süt bulunan bir kase gönderildi. O da o sütü içti.\" Fethu'l-Bari Açıklaması: \"Kase, bardak ve çanaklarda içmek.\" Yani bu mübah mıdır? Yoksa fasıkların şiarından olduğu için yasak mıdır? Muhtemelen Buhari bu kaplarda içmenin fasıkların şiarınd~m olsa dahi (mübah) olabileceğine işaret etmek istemiştir. Çünkü burada asıl göz önünde bulundurulan, içilen şeydir ve onların özel içme şekilleridir. Bu gibi hallerde onlara benzemeye çalışmak mekruhtur. Fakat bunun böyle olması, eğer bu hallerden uzak kalınabiliyorsa, kase ve benzeri kapIal'da içmenin mekruh olmasını gerektirmez",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 5637,
			"arabicnumber": 5637,
			"text": "Sehl b. Sa'd r.a.'dan, dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem'e Araplardan bir kadından söz edildi. O da Ebu Useyd es-Saidl'ye, o kadına haber göndermesini emir buyurdu. Ebu Useyd kadına haber gönderdi. Kadın gelip, Saide oğullarına ait bir kalede konakladı. Nebi Sallallahu Aleyhi ve Sellem evinden çıkıp kadının yanına geldi. Kadının bulunduğu yere girince, başını önüne eğmiş bir kadın ile karşılaştı. Nebi Sallallahu Aleyhi ve Sellem onunla konuşunca kadın: Senden Allah'a sığınınm, dedi. Nebi: Ben de senin benden sığınmanı kabul ettim, dedi. Kadına: Bunun kim olduğunu biliyor musun, diye sordular. Kadın hayır, dedi. Ona: Bu Hasulullah Sallallahu Aleyhi ve Sellem'dır. Sana evlenmek için talip olmak üzere gelmişti, dediler. Kadın: Demek ki ben çok bedbaht birisiymişim, dedi. O gün Nebi Sallallahu Aleyhi ve Sellem dönüp geldi ve nihayet Saide oğulları sakifesi (sundurması) altında arkadaşları ile birlikte oturdu. Sonra da: Ey Sehl bize su ver, buyurdu. Ben onlara işte bu kaseyi çıkardım, onunla onlara su ikram ettim, dedi.\" (Hadisi Sehl'den rivayet eden Ebu Hazim dedi ki:) Sehl bize o kaseyi çıkardı. Biz de ondan içtik. (Ebu Hazim) dedi ki: Bundan sonra Ömer b. Abdulaziz (Medine valisi iken) bunun kendisine hibe edilmesini istedi. O da o kaseyi ona hibe etti",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 5638,
			"arabicnumber": 5638,
			"text": "Asım el-Ahvel'den, dedi ki: \"Ben Nebi Sallallahu Aleyhi ve Sellem'in kasesini Enes b. Malik'in yanında gördüm. -Bu kase çatlamıştı da onu gümüş telle bağlamıştı.- Asım dedi ki: O kase nudar ağacından yapılmış, enlice, güzel bir bardak idi. Yine Asım dedi ki: Enes: Andolsun Hasulullah Sallallahu Aleyhi ve Sellem'e bu kas e ile şu kadar şu kadardan fazla defa su içirmişimdir, dedi.\" Asım dedi ki: İbn S1r1n de şöyle dedi: \"Bu kasenin demirden bir halkası vardı. Enes onun yerine altın ya da gümüş bir halka koymakistemişti de Ebu Talha ona: Rasulullah Sallallahu Aleyhi ve Sellem'in yaptığı hiçbir şeyi sakın değiştirme, dedi. Enes de vazgeçti.\" Fethu'l-Bari Açıklaması: \"Nebi Sallallahu Aleyhi ve Sellem'in kasesinden ... \" Onun bereketinden istifade etmek üzere \"içmek.\" \"Abdullah b. Selam bana dedi ki.\" Abdullah meşhur sahabidir. Daha sonra Sehl b. Sa'd'ın el-Cevniyye diye bilinen kadının olayını ve bu kadının Nebi Sallallahu Aleyhi ve Sellem'in kendisine talip olmak üzere geldiği sırada ondan Allah'a sığınması hadisesini nakletmektedir. Bu hadiseye dair geniş açıklamalar Talak bölümünün baş taraflarında (5255 ve 5256.hadislerin şerhinde) geçmiş bulunmaktadır. \"Kadın: Demek ki ben çok bedbahtmışım, dedi.\" Bu sözlerinden maksadı Rasulullah Sallallahu Aleyhi ve Sellem ile evlenme fırsatını kaçırdığı için bedbaht olduğunu ifade etmektir. \"Nebi Sallallahu Aleyhi ve Sellem geri dönüp Saide oğulları Sakifesinde (sundurmasının altında) oturdu.\" Sakife, Ebu Bekir es-Sıddık radıyallahu anh'a halifelik için bey'atin gerçekleştiği yerdir. Hadisten çıkan sonuçlar 1- Arkadaşlara karşı teklifsiz olmak ve arkadaşının yanında yiyecek, içecek ne varsa getirmesini istemek, 2- Arkadaşını künyesi ile çağırarak onu tazim etmek, 3- Salihlerin eserlerinin bereketinden yararlanmak istemek, 4- Arkadaşından kendisine ağır gelmeyecek şeyleri hibe etmesini istemek, mümkündür. \"O nudar ağacından enli, güzel bir kase idi.\" Nudar, odunun ve her şeyin katıksız olanına denilir. Bunun aslının neb' denilen Arabistan kirazından olduğu, renginin de sarıya çaldığı söylenir. Ebu Hanife ed-Dıneverı: Bu, kap yapmak için kullanılabilecek en kaliteli kerestedir, demiştir",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 5639,
			"arabicnumber": 5639,
			"text": "Cabir b. Abdullah r.a.'dan, dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem ile birlikte idim. İkindi namazı vakti girmiş, beraberimizde de çok az miktarda bir sudan başkası yoktu. Bu az miktardaki su, bir kaba konularak Nebi Sallallahu Aleyhi ve Sellem'e getirildi. O da elini o suyun içine soktu ve parmaklarını açtı. Daha sonra da: Haydi ab de st alacaklar gelsin, bereket Allah'tandır, diy~ buyurdu. And olsun suyun, parmakları arasından kaynadığını gördüm. (O seferde bizimle beraber bulunan) insanlar ab de st aldılar ve içtiler. Ben de içebildiğim kadarını içmek konusunda elimden geleni esirgemedim. Çünkü onun bere15et olduğunu öğrenmiştim.\" (Ravilerden Salim b. Ebi'l-Ca'd) dedi ki: \"Ben Cıı.bir'e: O gün kaç kişi idiniz, diye sordum. O: Bin dört yüz kişi idik, dedi.\" Fethu'l-Bari Açıklaması: \"Bereket için içmek ve bereketli sudan içmek.\" el-Mühelleb dedi ki: Sudan bereketli diye söz edilmesi, kendisine bereket ihsan edilerek mübarek kılınan şeye de bereket denilmesi dolayısı iledir. \"Elimden geleni esirgemedim.\" Yani bereketli olu~u dolayısıyla bu sudan alabildiği kadar çok içmeye çalı~tığını anlatmak istemektedir. İbn Battal dedi ki: Bu hadisten anlaşıldığına göre mucize yoluyla bereketin açıkça görüldüğü yemek ya da içmekte aç gözlülük de, israfa girmek de söz konusu değildir. Hatta bundan çokça elde etmeye çalı~mak, müstehaptır",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 65
			}
		}
	]
}