{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"75": "Patients"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5640,
			"arabicnumber": 5640,
			"text": "",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 5642,
			"arabicnumber": 5642,
			"text": "",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 5643,
			"arabicnumber": 5643,
			"text": "",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 5644,
			"arabicnumber": 5644,
			"text": "Ebû Hureyre (radıyallahü anh) şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem) şöyle buyurdu: \"Mü'min kişinin benzeri, bir sap üzerinde biten ekin gibidir. Hangi taraftan ona rüzgâr esip gelirse, rüzgâr onu eğer. Doğrulduğu zaman rüzgâr belâsı ile yine eğilir (fakat yıkılmayıp doğrulur, doğru kalır). Haktan yüz çeviren fâcir kişinin benzeri de sert ve düz çam gibidir ki, Allah onu dilediği vakit (bir defada) söküp kırıncaya kadar dimdik olmakta devam eder",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 5645,
			"arabicnumber": 5645,
			"text": "",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 5646,
			"arabicnumber": 5646,
			"text": "",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 5647,
			"arabicnumber": 5647,
			"text": "Abdullah ibn Mes'ûd (radıyallahü anh) şöyle demiştir: Ben Peygamber(sallallahü aleyhi ve sellem)'in hastalığında vücûdu hummanın hararetinden şiddetle sarsıldığı sırada huzuruna vardım ve: Yâ Rasûlallah, şübhesiz ki, humma hararetinden çok ıztırab çekmektesin! dedim. Yâ Rasûlallah, bu şiddetli hummanın şübhesiz iki kat ıztırabı var, elbette buna karşılık size de iki kat ecr ve mükâfat vardır! diye arzettim. \"Evet. Herhangi müslümâna bir ezâ isabet ederse, muhakkak ağacın yapraklarının düşmesi gibi, Allah o müslümândan günâhlarını düşürür\" buyurdu",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 5648,
			"arabicnumber": 5648,
			"text": "",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 5649,
			"arabicnumber": 5649,
			"text": "Bize Sufyân es-Sevrî, Mansûr'dan; o da Ebû Vâil'den;o da Ebû Mûsâ el-Eş'arî'den haber verdi ki, Peygamber(sallallahü aleyhi ve sellem):\"Açları doyurun, hastaları ziyaret edin, esirleri hürriyete kavuşturun\" buyurmuştur. Sufyân: \"el-Ânî\", \"Esîr\"dir, dedi",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 5650,
			"arabicnumber": 5650,
			"text": "el-Berâ ibn Âzib (radıyallahü anh) şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem) bize yedi şeyi işlememizi emretti ve yedi şeyden de nehyetti: Bizleri altın yüzük takmaktan; harîr, dîbâc, istebrak, kassîyy (denilen ipekli kumaşları) giymekten; binek üzerine içi yün ile doldurulmuş hâlis ipekten küçük minder koymaktan nehyetti. Yine bize cenazelerin ardından gitmemizi, hasta olanı ziyaret etmemizi ve selâm vermeyi yaymamızı emretti",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 5651,
			"arabicnumber": 5651,
			"text": "Bize Sufyân ibn Uyeyne, Muhammed ibnu'l-Munkedir'den tahdîs etti ki, o, Câbir ibn Abdillah (radıyallahü anh) şöyle derken işitmiştir: Ben bir hastalığa tutulmuştum. (Veda Haccı sırasında)Peygamber(sallallahü aleyhi ve sellem) ile Ebû Bekr es-Sıddîk; ikisi yürüyerek gelip bana hasta ziyareti yapıyorlardı. Onlar beni bayılmış hâlimde buldular. Peygamber abdest aldı, sonra abdest suyundan benim üzerime döktü. Akabinde ben ayıldım vePeygamber'i gördüm: Yâ Rasûlallah! Ben malım hakkında nasıl yapayım? Mallarım hakkında nasıl hükmedeyim? diye sordum. bana hiçbir cevâb vermedi. Nihayet Mîrâs Âyeti (en-Nisâ:ll-12 veyâ 176) indi",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 5652,
			"arabicnumber": 5652,
			"text": "(İbn Cureyc şöyle demiştir:) Bana Atâ ibn Ebî Rebâh, Ümmü Zufer denilen bu kadını Ka'be örtüsüne dayanmış hâlde gördüğünü haber verdi ki, o uzun boylu, iri yarı, siyah bir kadınmış",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 5653,
			"arabicnumber": 5653,
			"text": "",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 5654,
			"arabicnumber": 5654,
			"text": "",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 5655,
			"arabicnumber": 5655,
			"text": "",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 5656,
			"arabicnumber": 5656,
			"text": "",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 5657,
			"arabicnumber": 5657,
			"text": "",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 5658,
			"arabicnumber": 5658,
			"text": "",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 5659,
			"arabicnumber": 5659,
			"text": "",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 5660,
			"arabicnumber": 5660,
			"text": "Abdullah ibn Mes'ûd (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) humma hastalığına tutulmuş hâldeyken huzuruna girdim, O'na elimle dokundum da: Sen şiddetli bir humma hastalığıyle yanmaktasın! dedim. Peygamber: \"Evet, sizden iki kişinin humma harâretiyle yanması kadar şiddetlidir\" buyurdu. Mes'ûd: Sana iki kat ecir vardır! dedi. Peygamber: \"Evet, bir müslümâna hastalık ve daha başka bir eza isabet ederse, muhakkak Allah onun seyyielerini (sonbaharda) ağacın kendi yapraklarını atması gibi atar\" buyurdu",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 5661,
			"arabicnumber": 5661,
			"text": "",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 5662,
			"arabicnumber": 5662,
			"text": "Bize Süleyman ibn Bilâl haber verdi ki, Yahya ibn Saîd şöyle demiştir: Ben el-Kaasım ibn Muhammed'den işittim, şöyle dedi: Âişe (r.anha)(başı ağrıyınca): Vay başım! demişti. Rasûlüllah(sallallahü aleyhi ve sellem) da: \"Eğer sen ölür de ben hayâtta kalırsam, senin için mağfiret isterim, senin için duâ ederim\" dedi. üzerine Âişe: Vay başıma gelen musibete! Vallahi öyle sanıyorum ki, muhakkak Sen benim ölümümü istiyorsun! Eğer ben ölürsem, muhakkak Sen o son günün gecesinde kadınlarının birisi ile gerdek olup yaşayacaksın! dedi. bu sözü üzerine Peygamber: \" (Yâ Âişe! Endişelenme!) Bil'akisben 'Vay başım!\"demeliyim (çünkü senden önce öleceğim). Yâ Âişe, hattâ şimdi Ebû Bekr'e ve oğluna haber göndermeyi ve -halifelik dedikoducularının sözlerinden ve halifelik umanların temennilerinden nefret ederek, nizâyı kesmek için- halifeliği Ebû Bekr'e vasiyyet etmeyi kasdettim -yahut:istedim-. Fakat sonra düşünüp dedim ki, Allah (halifeliği Ebû Bekr'den başkasına vermekten) imtina eder; mü'minler de (Ebû Bekr'den başkasının halîfe olmasını) men' ederler -yahut: Allah (Ebû Bekr'den başkasının halîfe olmasını) men' eder; mü'minler de (Ebû Bekr'den başkasına bey'attan) imtina ederler",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 5663,
			"arabicnumber": 5663,
			"text": "",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 5664,
			"arabicnumber": 5664,
			"text": "Câbir ibn Abdillah el-Ensârî (radıyallahü anh): Hastalığımda Peygamber(sallallahü aleyhi ve sellem) bana hasta ziyareti yapmak üzere geldi. Gelirken ne katıra, ne de ata binmiş değildi, demiştir",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 5665,
			"arabicnumber": 5665,
			"text": "",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 5666,
			"arabicnumber": 5666,
			"text": "",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 5667,
			"arabicnumber": 5667,
			"text": "el-Hâris ibn Suveyd şöyle demiştir: Abdullah ibn Mes'ûd (radıyallahü anh) şöyle dedi: Ben Rasûlüllah(sallallahü aleyhi ve sellem) şiddetli bir humma ateşi ile yanarken huzuruna girdim de elimle vücûduna dokundum ve: Yâ Rasûlallah! Şübhesiz ki, Sen şiddetli bir humma hastalığiyle yanmaktasın! dedim. üzerine Rasûlüllah: \"Evet, hakîkaten ben sizden iki kişinin yanması gibi şiddetli bir humma ile yanmaktayım\" dedi. de O'na: Bu iki kat yanmanın.karşılığında muhakkak Sana iki kat ecir vardır, dedim. \"Evet\" buyurduktan sonra şunu söyledi: \"Bir müslümâna hastalık ve daha başka bir ezâ isabet ederse muhakkak Allah onun, ağacın kendi yapraklarını döküşü gibi seyyielerini döker",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 5668,
			"arabicnumber": 5668,
			"text": "Bize ez-Zuhrî, Âmir ibn Sa'd'dan haber verdi ki, babası Sa'd ibn Ebî Vakkaas (radıyallahü anh) şöyle demiştir: Veda Haccı zamanında (Mekke'de) yakalandığım şiddetli bir hastalıktan dolayı Rasûlüllah(sallallahü aleyhi ve sellem) hasta ziyareti yapmak üzere bize geldi. Ben: (Yâ Rasûlallah!) Bendeki bu hastalık, görmekte olduğun şu müzmin dereceye ulaştı. Ben ise mal sahibiyim. Bana bir tek kızımdan başkası da mîrâsçı olmayacaktır. Bu durumda ben malımın üçte ikisini sadaka (olarak ayırıp) vereyim mi? dedim. \"Hayır (üçte ikinin hepsini sadaka yapma)\" buyurdu. Ben: Yarısını sadaka edeyim mi? dedim.Rasûlüllah yine: \"Hayır (yarısını da sadaka yapma)\" buyurdu. Ben: Üçte bir (olur mu)? dedim. Rasûlüllah: \"Üçte bir de çoktur. Senin mirasçılarını zengin kimseler olarak bırakman, onları muhtaçlar ve insanlara(sadaka için) ellerini açar bir hâlde bırakmandan daha hayırlıdır. Allah rızâsını aramak için yapacağın her harcamaya karşılık muhakkak sana ecir verilecektir. Hattâ (yemek yerken hayat yoldaşın olan) kadınının ağzı içine koyacağın lokmadan da sana sevâb verilecektir\" buyurdu",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 5669,
			"arabicnumber": 5669,
			"text": "",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 5670,
			"arabicnumber": 5670,
			"text": "",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 5671,
			"arabicnumber": 5671,
			"text": "",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 5672,
			"arabicnumber": 5672,
			"text": "",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 5673,
			"arabicnumber": 5673,
			"text": "Ebû Hureyre (radıyallahü anh) şöyle demiştir: Ben Rasûlüllah (sallallahü aleyhi ve sellem)'tan işittim: \"Hiçbir kişiyi, onun güzel ameli(ve ibâdeti) cennete girdiremez\" buyuruyordu. üzerine sahâbîler: Yâ Rasûlallah! Seni de mi girdiremez? diye sordular. Rasûlüllah şöyle cevâb verdi: \"Evet, beni de Allah'ın fadlı ve rahmeti bürümedikçe, yalnız ibâdetim cennete girdiremez. Buna göre sizler iş ve ibâdetinizde ifrat ve tefritten sakınıp doğruyu arayınız ve doğru yoldan gidip Allah'ın yakınlığını isteyiniz. Sakın sizin hiçbiriniz (sâlih olsun, fâsık olsun) ölüm temenni etmesin! Çünkü, o, hayır ve ihsan sahibi ise yaşayıp hayrını, ihsanını artırması umulur. Eğer günahkâr bir kişi ise (yine yaşayıp, günün birisinde) tevbe ederek Allah 'ın rızâsını dilemesi umulur",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 5674,
			"arabicnumber": 5674,
			"text": "",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 5675,
			"arabicnumber": 5675,
			"text": "",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 5676,
			"arabicnumber": 5676,
			"text": "",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 5677,
			"arabicnumber": 5677,
			"text": "",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 37
			}
		}
	]
}