{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"77": "Dress"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5783,
			"arabicnumber": 5783,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 5784,
			"arabicnumber": 5784,
			"text": "Bize Mûsâ ibn Ukbe, Salim ibn Abdillah'tan; o da babası Abdullah ibn Omer (radıyallahü anh) 'den tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem): \"Büyüklenerek izârını (uzatıp yerde) sürükleyen kimseye Allah kıyâmet günü (merhamet bakışıyle) bakmaz\" buyurmuştur. Bekr es-Sıddîk: Yâ Rasûlallah! Benim izârımın yanlarından birisi -ben onu sürünmekten koruyup dikkat etmezsem- muhakak sarkar (yerde sürünür), dedi. de ona: \"Sen bu sarkıtmayı büyüklenmek için yapanlardan değilsin\" buyurdu",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 5785,
			"arabicnumber": 5785,
			"text": "Ebû Bekre (radıyallahü anh) şöyle demiştir: Biz Peygamber'in yanında bulunurken güneş tutuldu. Bunun üzerine Peygamber(sallallahü aleyhi ve sellem) kalkıp acele ile elbisesini ardından sürükleye sürükleye yürüdü, nihayet mescide geldi. İnsanlar (mescidden çıkmalarının ardından) hemen mescide döndüler. Peygamber insanlara iki rek'at namaz kıldırdı. Güneş de açıldı. Sonra Peygamber bize yöneldi ve: \"Şübhesiz Güneş ve Ay, Allah 'ın âyetlerinden iki âyettir. Siz bu âyetlerden böyle birşey gördüğünüz zaman, hemen namaz kılın ve açılıncaya kadar Allah'a dua ediniz!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 5786,
			"arabicnumber": 5786,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 5787,
			"arabicnumber": 5787,
			"text": "Ebû Cuhayfe (Vehb ibn Abdillah es-Suvâî-radıyallahü anh) şöyle demiştir: Ben Bilâl'i gördüm ki, o bir harbe getirdi de, onu dikti. Sonra da namaza ikaamet etti. Bunun üzerine Rasûlüllah'ı gördüm ki, O (kırmızı) bir takım elbise giyinmiş ve çemrenmiş olarak çadırından çıktı da, o dikilen harbeye doğru oradaki insanlara iki rek'at namaz kıldırdı. Bu sırada gördüm ki,Rasûlüllah(sallallahü aleyhi ve sellem)'ın önünden, dikili harbenin arkasından insanlar, hayvanlar geçip gidiyorlardı",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 5788,
			"arabicnumber": 5788,
			"text": "Bize Mâlik, Ebu'z-Zinâd'dan; o da el-A'rec'den; o da Ebû Hureyre (radıyallahü anh)'den haber verdi ki, Rasûlüllah(sallallahü aleyhi ve sellem):''Allah azgınlık ve kibirden dolayı izârını uzatıp yerde sürükleyen kimseye kıyâmet gününde (merhamet bakışıyle) bakmaz\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 5789,
			"arabicnumber": 5789,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 5790,
			"arabicnumber": 5790,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 5791,
			"arabicnumber": 5791,
			"text": "Bize Şu'be tahdîs edip şöyle dedi: Ben Muhârib ibn Disâr'a bir at üzerinde kavuştum. Kendisi Kûfe'de mahkeme hâkimliği yapmakta olduğu yere gitmekte idi. İşte orada kendisine bu hadîsi sordum. Bunun üzerine bana tahdîs edip şöyle dedi: Ben Abdullah ibn Omer (radıyallahü anh) 'den işittim, şöyle diyordu: Rasûlüllah(sallallahü aleyhi ve sellem): \"Kibirden dolayı elbisesini yerde sürükleyen kimseye Allah kıyâmet gününde (merhamet bakışıyle) bakmaz\" buyurdu. dedi ki: Ben Muhârib'e: Abdullah ibn Omer bu hadîsinde izârını zikretti mi? diye sordum. Abdullah izâr ve gömlek diye tahsis yapmadı (izâr, gömlek ve diğerlerini şâmil olarak \"Elbise\" ta'birini kullandı), dedi. hadîsi İbn Omer'den; o da Peygamber'den \"Elbise\" lafzıyle rivayet etmesinde Muhârib ibn Disâr'a Cebele ibnu Suhaym, Zeyd ibu Eslem, Zeyd ibn Abdillah mutâbaat etmişlerdir. de Nâfi'den; o da İbn Omer'den bunun benzerini söylemiştir. ibn Ukbe, Omer ibnu Muhammed, Kudâme ibnu Mûsâ üçlüsü de \"Elbisesini büyüklenerek yerde sürükleyen kimse...\" hadîsini İbn Omer'den; o da Peygamber'den rivayet etmekte, Nâfi'e mutâbaat etmişlerdir",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 5792,
			"arabicnumber": 5792,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 5793,
			"arabicnumber": 5793,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 5794,
			"arabicnumber": 5794,
			"text": "Bize İbnu Şihâb, Sâlim'den; o da Bâbası Abdullah ibn Omer'den tahdîs etti(o, şöyle demiştir): Rasûlüllah (sallallahü aleyhi ve sellem)'a ihrâmlı kimse elbiselerden neleri giyer? diye soruldu, Rasûlüllah: \"İhrama giren kimse gömlek, başlıklar, şalvarlar, bornus, zağferân ve vers ile boyanmış bir elbise (yani bez ve kumaş)giyemez. Eğer iki edik bulamadığı takdirde, iki mest giysin ve onları topuklardan aşağıya varıncaya kadar kessin\" buyurdu",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 5795,
			"arabicnumber": 5795,
			"text": "Câbir ibn Abdillah (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) Abdullah ibn Ubeyy'in yanına, o ölüp de kabrine girdirilmesinden sonra geldi.Peygamber onun çıkarılmasını emretti, o da kabrinden çıkarıldı ve Peygamber'in iki dizleri üzerine konuldu. Peygamber kendi tükrüğünden onun üzerine nefes etti ve kendi mübarek gömleğini ona giydirdi. (Peygamber'in kendi gömleğini ona giydirmesinin sebebini) Allah en bilendir",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 5796,
			"arabicnumber": 5796,
			"text": "Abdullah ibn Omer (radıyallahü anh) şöyle demiştir: Abdullah ibn Ubeyy vefat ettiği zaman onun oğlu Abdullah, Rasûlüllah'a geldi ve: Yâ Rasûlallah! Gömleğini bana versen de babamı onun içine kefenlesem, namazını da kılsanız ve onun için Allah'tan mağfiret is-teyiverseniz! dedi. Abdullah'a gömleğini verdi ve ona: \"Cenazenin hazırlanmasını bitirdiğin zaman bize bildirin\" buyurdu. babasının cenazesini hazırlayıp bitirince bunu Rasûlüllah'a bildirdi. Rasûlüllah da onun cenaze namazını kıldırmak için gitti. Namazını kıldıracağı sırada Omer,Rasûlüllah'ı çekti de: Allah seni münafıklar üzerine namaz kılmaktan nehyetmedi mi? Allah \"Onlar için istiğfar et yahut istiğfar etme. Eğer onlar için yetmiş defa istiğfar dahî etsen yine Allah kendilerini asla mağfiret edecek değildir... \" (et-Tevbe: 80) buyurdu, dedi. üzerine: \"Onlardan ölen hiçbir kimseye ebedî dua etme. (Defin ve ziyaret için) kabrinin başında da durma. Çünkü onlar Allah’ı ve Rasûlü'nü inkâr ile kâfir oldular, onlar fâsıklar olarak öldüler”(et-Tevbe: 84) âyeti indi. Bu âyetten sonra artık Rasûlüllah, ölen münafıklar üzerine cenaze namazı kıldırmayı terketti",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 5797,
			"arabicnumber": 5797,
			"text": "Bize İbrâhîm ibn Nâfi' el-Mahzûmî, el-Hasen ibn Müslim'den; o da Tâvûs'tan tahdîs etti ki, Ebû Hureyre (radıyallahü anh) şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem) cimri ile sadaka verici cömert kimsenin mesellerini şu iki adamın meselleri gibi beyân etti: \"Bu iki adamın üzerinde demirden birer cübbe vardır. Bu cübbe onların ellerini memelerine ve köprücük kemiklerine doğru sıkıştırıp zorlamıştır. Sadaka verici kişi bir sadaka verdiği zaman o cübbe onun bedeninden yayılıp genişler, hattâ onun ayak parmaklarının uçlarını bile kaplar da ayak izlerini siler giderir. Cimri ise bir sadaka vermek kasdettikçe cübbesi daralmaya başlar ve herbir halka, vücûdun kendisine değen yerini yakalayıp(şiddetle) sıkar\". Hureyre dedi ki: Ben Rasûlüllah'ı parmağıyle yakasına doğru şöyle diye işaret ederken gördüm. Eğer sen onu cübbesini genişletmeye çalışır, cübbenin de genişlemez olduğunu göreydin (elbette hayret ederdin)! oğlu Abdullah, babasından; o da Ebû Hureyre'den senediyle el-Hasen ibn Müslim'e mutâbaat etti. Ebu'z-Zinâd da el-A'rec'den; o da Ebû Hureyre'den senediyle \"İki cübbe\" sözüyle rivayette yine el-Hasen ibn Müslim'e mutâbaat etti. da şöyle demiştir: Ben Tâvûs'tan işittim, şöyle diyordu: Ben Ebû Hureyre'den işittim, \"İki cübbe\" sözünü söylüyordu. Ca'fer ibn Rabîa da el-A'rec'den \"İki cünne\" yani \"İki kalkan\" sözünü söylemiştir",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 5798,
			"arabicnumber": 5798,
			"text": "el-Mııgîre ibn Şu'be (radıyallahü anh) tahdîs edip şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) bir hacetini yerine getirmek için gitti. O işini bitirdikten sonra dönüp geldi. Bu sırada ben kendisini su alıp karşıladım. Abdest aldı. Üzerinde bir Şâm cübbesi vardı. Ağzını çalkaladı, burnuna su çekti, yüzünü yıkadı. Akabinde o cübbenin yenlerinden ellerini sıvayıp çıkarmaya davrandı. Yenler çok dar idiler.(Bu sebeble ellerini sığayıp çıkaramadı.) Bu sefer ellerini cübbenin aşağısından dışarı çıkardı ve onları da yıkadı.Başı ile ayakları üzerine de meshetti",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 5799,
			"arabicnumber": 5799,
			"text": "el-Mugîre ibn Şu'be (radıyallahü anh) şöyle demiştir: Ben bir seferde bir gece Peygamber'le birlikte idim. Bana: \"Yanında su var mı?\" diye sordu. Ben: Evet var, dedim. : üzerine bineğinden indi de gecenin karanlığı içinde benden iyice gizleninceye kadar yürüdü. Sonra geldi. Ben O'na kaptan su döktüm, O da yüzünü ve ellerini yıkadı. Üzerinde yünden yapılmış bir cübbe vardı. Peygamber kollarını ondan dışarıya çıkarmaya muktedir olamadı. Nihayet kollarını cübbenin aşağı tarafından çıkardı da, öyle yıkadı. Sonra başını meshetti. Sonra ben ayakkabılarını çıkarmak için ellerimi uzattım. \"Onlara ilişme! Çünkü ben ayaklarımı temiz oldukları hâlde (yani abdestli iken) onların içine soktum\" buyurdu, ve ayakkabıları üzerine meshetti",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 5800,
			"arabicnumber": 5800,
			"text": "el-Mısver ibn Mahrame (radıyallahü anh) şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem) sahâbîlerine birçok kaftanlar dağıttı da bunlardan Mahrame'ye birşey vermemişti. Bunun üzerine Mahrame, oğlu Mısver'e hitaben: Ey oğulcuğum! Haydi beraber Rasûlüllah'a gidelim, dedi. (Mısver dedi ki:) Ben, babam Mahrame'nin beraberinde gittim. bana: Haydi Peygamber'in yanına gir de O'nu bana çağır! dedi. dedi ki: Ben Rasûlüllah'ı babam için da'vet ettim. Rasûlüllah omuzunda bu kaftanlardan bir kaftan olduğu hâlde, babamın yanına çıktı ve: \"Bunu senin için sakladım!\" buyurdu. dedi ki: Babam kaftana baktı da kendisi (yâni Rasûlüllah): \"Mahrame razı oldu\" dedi",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 5801,
			"arabicnumber": 5801,
			"text": "Bize Kuteybe ibn Saîd tahdîs etti. Bize el-Leys, Yezîd ibn Ebî Habîb'den tahdîs etti ki, Ukbe ibnu Âmir (radıyallahü anh) şöyle demiştir:Rasûlüllah(sallallahü aleyhi ve sellem)'a bir ipek ferrûc hediye edilmişti. Onu giydi, sonra içinde namaz kıldı. Namazdan çıktıktan sonra onu istemez gibi bir tavır içinde bedeninden şiddetle çıkardı. Sonra: \"Bu, muttakilere yaraşmaz!\" buyurdu. hadîsi el-Leys'ten rivayet etmekte Abdullah ibn Yûsuf, Kuteybe ibn Saîd'e mutâbaat etmiştir. Abdullah ibn Yûsuf'tan başkası \"Ferrûcun harîrun = İpek bir ferrûce\" şeklinde söylemiştir",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 5802,
			"arabicnumber": 5802,
			"text": "Buharî dedi ki: Bana Müsedded ibn Muserhed söyledi: Bize Mu'temir tahdîs edip şöyle dedi: Ben babam Süleyman ibn Tarhân'dan işittim: Ben Enes’in üzerinde kalın ipekten sarı bir bornus gördüm, dedi",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 5803,
			"arabicnumber": 5803,
			"text": "Bana Mâlik, Nâfi' den; o da Abdullah ibn Omer (radıyallahü anh) ' den şöyle tahdîs etti: Bir adam: Yâ Rasûlallah! İhrama giren kimse elbiselerden ne giyer? diye sordu. aleyhi ve sellem): \"Gömlekler, sarıklar, donlar, bornuslar, ayakkabılar giymez. Ancak na'leyn bulamayan kimse ayakkabı giysin de topuklardan aşağısına kadar kessin. Bir de cehri ve zağferânla boyanmış kumaştan yapılı elbiseler giymez\" buyurdu",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 5804,
			"arabicnumber": 5804,
			"text": "Bize Sufyân ibn Uyeyne, Amr ibn Dinar'dan; o da Câbir ibn Zeyd'den; o da İbn Abbâs radıyallahü anhüma'tan tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem):\" (İhrâm'da) izâr bulamayan serâvîl (yâni don) giysin, na'leyn bulamayan da (topuklardan aşağı olan) huffeyn (iki mest) giysin” buyurmuştur",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 5805,
			"arabicnumber": 5805,
			"text": "Abdullah ibn Omer (radıyallahü anh) şöyle demiştir: Bir adam ayağa kalktı da: Yâ Rasûlallah! İhrama gireceğimiz zaman bize ne giymemizi emir buyurursun? dedi. \"Gömlek, serâvîl, başlıklar, bornuslar, ayakkabılar giymeyiniz. Ancak iki terliği bulunmayan kimse olursa, o topuklardan aşağıda olan ayakkabılar giysin. Bir de kendisine vers veyâ zağferân bitkisi boyaları dokunmuş elbiselerden hiçbirini giymeyiniz\" buyurdu",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 5806,
			"arabicnumber": 5806,
			"text": "ez-Zuhrî şöyle demiştir: Bana Salim, babası Abdullah ibn Omer (radıyallahü anh) 'den haber verdi ki, Peygamber (sallallahü aleyhi ve sellem) şöyle buyurmuştur: \"İhrama giren kimse ne gömlek, ne sarık, ne don, ne bornus, ne cehrî veya zağferânla boyanmış bir kumaş, ne ayakkabı giyer. Ancak iki terlik bulamayan kimse için ayakkabı giyme ruhsatı vardır. Şöyle ki, iki terlik bulamayan kimse, ayakkabıları topukların aşağısından keser",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 5807,
			"arabicnumber": 5807,
			"text": "Âişe (r.anha) şöyle demiştir: Müslümanlardan birçok adamlar Habeşistan'a muhacir olarak gittiler. Ebû Bekr de muhacir olmak üzere hazırlık yapmıştı. Bu sırada Peygamber(sallallahü aleyhi ve sellem) ona: \"Sabret, çünkü ben, bana da (hicret için) izin verileceğini ümîd etmekteyim\" buyurdu. üzerine Ebû Bekr: (Yâ Rasûlallah!) Babam anam Sana feda olsun! Böyle bir izin gelmesini umuyor musun? dedi. da: \"Evet umarım!\" diye cevâb verdi. sebeble Ebû Bekr de Peygamber'e hicrette yoldaşlık etmek üzere hemen hareket etmekten vazgeçip kendini alıkoydu. Bu arada Ebû Bekr, evinde bulunan kuvvetli iki binek devesini dört ay ağaç yapraklarıyle ev içinde besledi. Urve dedi ki: Âişe şöyle dedi: Bir gün biz güneşin en sıcak zamânında Ebû Bekr'in evinde oturuyorduk. Ev halkından biri Ebû Bekr'e: İşte Rasûlüllah, bize gelmesi alışılmış olmayan bir saatte başını bir sargı ile sarıp örtmüş olarak geliyor! dedi. Bekr de: Babam anam O'na feda olsun! Vallahi O'nu bu saatte buraya muhakkak mühim bir iş getirmiştir! dedi. Peygamber geldi, içeri girmeye izin istedi, Ebû Bekr izin verip buyurun dedi. Bunun üzerine içeriye girdi. Girdiği zaman Ebû Bekr'e:. \"Yanında kim varsa dışarı çıkar!\" buyurdu, Ebû Bekr de: Babam Sana feda olsun yâ Rasûlallah! Onlar ancak Sen'in ehlin ve mahremindir (yabancı yoktur)! dedi. \"Bana Mekke'den çıkmak hususunda izin verilmiştir\" buyurdu. Bekr de: Yâ Rasûlallah! Babam Sana feda olsun! Ben de sohbetinde ve beraberinde bulunmak isterim! dedi. \"Evet (sen de berâberimdesin)\" buyurdu. Bekr: Babam Sana feda olsun, yâ Rasûlallah! Şu iki binek devemden birini al! dedi. \"Ancak bedeliyle alırım\" buyurdu. dedi ki: Biz Rasûlüllah ile Ebû Bekr'in sefer malzemelerini çabucak hazırladık. Her ikisi için bir dağarcık içinde bir mikdâr azık düzenleyip bir sofra olarak koyduk. Ağzı bağlanacağı sıra Ebû Bekr'in kızı kardeşim Esma, belinin kuşağından bir parça kesip ayırdı da onunla dağarcığın ağzını bağladı. İşte bundan dolayı Esmâ'ya \"Zâtu'n-Nitâkayn = İki Kuşaklı\" diye isim verildi. Sonra Rasûlüllah ile Ebû Bekr Sevr denilen dağdaki bir mağaraya ulaştılar. Ve orada üç gece kaldılar. Her gece yanlarında Ebû Bekr'in oğlu Abdullah gecelerdi. Abdullah çabuk anlayışlı, kavrayışlı, taze bir gençti. Seher vakti Rasûlüllah ile Ebû Bekr'in yanlarından, Mekke'de gecelemiş gibi Kureyş ile sabaha ulaşırdı. Abdullah Rasûlüllah ile Ebû Bekr hakkında Kureyş müşriklerinin hilelerinden duyduğu şeyleri ezberinde tutar, tâ karanlık basınca gelir, Rasûlüllah ile babası Ebû Bekr'e haber verirdi. Ebû Bekr'in kölesi Âmir ibn Fuheyre (o civarda) bol sütlü sağmal koyun otlatır ve akşamdan bir müddet geçtiğinde Rasûlüllah ile Ebû Bekr'e getirirdi. Onlar da taze süt içerek gecelerlerdi. Nihayet gecenin sonunda Âmir ibn Fuheyre (mağaranın önüne gelir) sağmal koyuna seslenirdi (ve alır, yaymağa götürürdü). Rasûlüllah ile Ebû Bekr'in mağarada bulundukları üç gecenin hepsinde Âmir süt işini böyle te'mîn ederdi",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 5808,
			"arabicnumber": 5808,
			"text": "Bize Mâlik, ez-Zuhrfden; o da Enes (radıyallahü anh)'ten tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem) Fetih yılında Mekke'ye, başında miğfer olduğu hâlde girmiştir",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 5809,
			"arabicnumber": 5809,
			"text": "Enes ibn Mâlik (radıyallahü anh) şöyle demiştir: Ben Rasûlüllah (sallallahü aleyhi ve sellem)'ın beraberinde yürüyordum. Rasûlüllah'ın üzerinde Necrân dokumalarından kalın kenarlı bir bürde (yani kaftan) bulunuyordu. Bir çöl Arab'ı bize yetişti de Rasûlüllah'ın ridâsını şiddetli bir çekişle çekti. Hattâ ben o sırada Rasûlüllah’ın boynu ile omuzları arasına baktım da bedevinin ridâyı şiddetle çekmesinden ridânın kalın kenarı Rasûlüllah'ın boyun safhasında iz bırakmıştı. Bundan sonra bedevî, Rasûlüllah'a hitaben: Yâ Muhammedi Yanında bulunan Allah malından bana birşey verilmesini emret! dedi. üzerine Rasûlüllah, bedeviye doğru (şefkatle) baktı, sonra güldü, sonra da ona bir mikdâr atıyye verilmesini emretti",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 5810,
			"arabicnumber": 5810,
			"text": "Sehl ibn Sa'd (radıyallahü anh) şöyle demiştir: Bir gün bir kadın kenarlı dokunmuş bir bürde ile geldi. râvîsine: Sen bürde nedir bilir misin? diye sordu. da: Evet bilirim. Bürde, kenarında saçaklar bırakılarak dokunmuş bir şemledir, dedi. devamla şöyle dedi:) O kadın: Yâ Rasûlallah! Bu bürdeyi ben kendi elimle dokudum, onu Sana giydireceğim! dedi. üzerine Rasûlüllah o bürdeyi aldı, zâten kendisinin böyle bir bürdeye ihtiyâcı vardı. Sonra Rasûlüllah bu bürde sırtında onun izârı olmuş hâlde bizim yanımıza çıktı. Oradaki topluluktan bir sahâbî bu bürdeye eliyle dokundu da: Yâ Rasûlallah! (Bu ne güzelmiş!) Bunu bana giydir! dedi. Rasûlüllah: \"Evet\" buyurdu ve mecliste Allah'ın dilediği kadar oturdu. Sonra evine döndü, akabinde o bürdeyi sırtından çıkarıp dürdü. Sonra da onu isteyen adama gönderdi. Mecliste bulunan topluluk o zâta: Sen bunu iyi etmedin, Peygamber'in hiçbir isteyeni reddetmez olduğunu bildiğin hâlde bunu O'ndan istedin (Peygamber'in ise buna ihtiyâcı vardı), dediler. üzerine o zât: Vallahi bu bürdeyi giymek için istemedim. Ben onu ancak öldüğüm gün benim kefenim olsun diye istedim, dedi. Hakîkaten bu bürde o zâtın kefeni oldu, demiştir",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 5811,
			"arabicnumber": 5811,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 5812,
			"arabicnumber": 5812,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 5813,
			"arabicnumber": 5813,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 5814,
			"arabicnumber": 5814,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 5816,
			"arabicnumber": 5816,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 5817,
			"arabicnumber": 5817,
			"text": "Âişe (r.anha) şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem) bir defasında üstünde damgalar bulunan bir hamîsa içinde namaz kıldı. Namaz esnasında üstündeki damgalara bir göz atıp bakmıştı. Namazdan selâm verip çıkınca: \"Benim şu hamîsamı Ebû Cehm'e (geri) götürün de Adiyy ibn Ka'b oğulları'ndan Ebû Cehm ibn Cehm ibn Huzeyfe ibn Gânim'în enbicâniyyesini bana getirin. Çünkü bu hamîsa, biraz önce beni namazımdan meşgul etti\" buyurdu",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 5818,
			"arabicnumber": 5818,
			"text": "Bize Eyyûb, Humeyd ibn Hilâl'den tahdîs etti ki, Ebû Burde şöyle demiştir: Âişe(r.anha) bize bir kisâ ve kaba bir izâr çıkardı da: Peygamber(sallallahü aleyhi ve sellem)'in ruhu işte bu ikisi içinde kabzolundu, dedi",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 5819,
			"arabicnumber": 5819,
			"text": "Ebû Hureyre (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) mülâbeseden (el dokundurma alışverişinden), munâbezeden(birbirine atma suretiyle yapılan alışverişten) nehyetti. İki namazdan da nehy buyurdu: Fecr namazından sonra güneş doğuncaya kadar, ikindi namazından sonra da güneş batıncaya kadar namaz kılmaktan nehy buyurdu. Ve yine insanın bir tek elbise içinde avret yeri üzerinde onunla gök arasında elbiseden hiçbirşey olmayarak (yânı avret yerini örtmeyerek) ihtibâ etmesinden ve iştimâlu's-sammâ giyinişiyle libâsa bürünmesinden nehy buyurdu",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 5820,
			"arabicnumber": 5820,
			"text": "Ebû Saîd el-Hudrî (radıyallahü anh) şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem) iki türlü giyinişten ve iki türlü alışverişten nehyetti. Alışverişte mulâmeseden ve munâbezeden nehyetti. Mulâmese, bir kimsenin gece veya gündüz eliyle diğer birinin kumaşına dokunmasıdır. Bu adam o kumaşı alt üst etmez, sâdece böyle el dokundurur. Munâbeze ise bir adamın kendi kumaşını diğer adama doğru atması ve diğer adamın da kendi kumaşını atmasıdır, ve bu atışma, kumaşa bakmaksızın ve aralarında bir rızâlaşma da olmaksızın onların zoraki alışverişleri olur. türlü giyinişin biri iştimâlu's-sammâ'dır. \"es-Sammâ\", insanın sevbini, ihramını iki omuzundan biri üzerine koyması ve iki şıkkından birinin açılması, üzerinde hiçbir sevb bulunmamasıdır. Diğer giyiniş ise insanın büründüğü kumaştan bir parçasını ferci üzerinde bulundurmaksızın, oturur hâlde kendi kumaşıyle ihtibâ etmesi, yani onu sarınıp bürünmesidir",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 5821,
			"arabicnumber": 5821,
			"text": "Ebû Hureyre (radıyallahü anh) şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem) iki türlü giyinişten (ihtibâ ve istimal giyinişlerinden) nehyetti. İnsanın, büründüğü kumaşın bir parçasını avret yeri üzerinde bulundurmaksızın bir tek kumaşa sarınıp bürünmesinden ve insanın iki şıkktan biri üzerinde birşey bulunmayarak bir tek kumaşla bürünmesinden nehyetti. Bir de mulâmese ve munâbeze sûretleriyle alışveriş yapmaktan nehyetti",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 5822,
			"arabicnumber": 5822,
			"text": "Bize İbn Cureyc haber verip şöyle dedi: Bana İbn Şihâb, Ubeydullah ibn Abdillah'tan; o da Ebû Saîd el-Hudrî (radıyallahü anh)'den haber verdi ki, Peygamber(sallallahü aleyhi ve sellem) iştimâlu's-sammâ giyinişinden ve insanın, ferci üzerinde birşey yokken bir tek kumaş içinde sarınıp bürünmesinden nehyetmiştir",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 5823,
			"arabicnumber": 5823,
			"text": "Bize İshâk ibn Saîd, babası Saîd ibnu Fulân'dan -ki o Amr ibnu Saîd ibni'l-Âs'tır-; o da Hâlid ibnu Saîd'in kızı Ümmü Hâlid'den tahdîs etti ki, bu kadın şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem)'e birçok elbiseler getirilmişti. Bunların içinde bir küçük siyah yün kumaş vardı.Peygamber oradaki topluluğa: \"Bu küçük siyah yün kumaşı kime giydirelim diye düşünürsünüz?\" diye sordu. susup cevâb vermedi. Peygamber: \"Ümmü Hâlid'i bana getirin!\" buyurdu. üzerine Ümmü Hâlid küçük bir kızını taşıyarak huzura getirildi. Peygamber o siyah yün kumaşı eline aldı da onu Ümmü Hâlid'e giydirdi. Ve: \"Sen bunu sağlıkla eskit ve parçala!\" buyurdu. denilen bu yün kumaşta yeşil yahut sarı damgalar vardı. Bundan sonra Peygamber(sallallahü aleyhi ve sellem): \"Yâ Ümme Hâlid! Bu yün kumaşın alemi(yani damgası) senehtir senehtir!\" buyurdu. \"Seneh\" kelimesi Habeşçe olup, \"Güzel\" ma'nâsmadır",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 5824,
			"arabicnumber": 5824,
			"text": "Enes ibn Mâlik (radıyallahü anh) şöyle demiştir: Annem Ümmü Suleym, kardeşim Abdullah ibn Ebî Talha'yı doğurduğu zaman bana: Yâ Enes! Şu oğlana bak! Sakın ona zarar verecek hiçbirşey isabet ettirmeden, Peygamber'in yanına götür, Peygamber onun damağını çiğnemle ovuşturur, dedi. üzerine ben çocuğu Peygamber(sallallahü aleyhi ve sellem)'e getirdim. O sırada Peygamber bir hurmalık içinde bulunuyordu, üzerinde hureysiyye denilen yün kumaş vardı.Peygamber(sallallahü aleyhi ve sellem) fetih zamanında kendisine gelmiş olan yük develerini damgalamakla meşgul oluyordu",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 5825,
			"arabicnumber": 5825,
			"text": "Bize Eyyûb es-Sahtıyânî, İkrime'den şöyle haber verdi: karısını (Temime bintu Vehb'i) boşadı. Sonra o kadınla Abdurrahmân ibnu'z-Zubeyr el-Kurazî evlendi. dedi ki: Bu kadının üzerinde yeşil bir baş örtüsü vardı. Ben Âişe'ye geldi de kocası Abdurrahmân'dan şikâyet edip derd yandı ve cildi üzerinde (döğmeden meydana gelmiş) yeşil bir lekeyi gösterdi. Nihayet Rasûlüllah gelince -İkrime: Kadınlar, birbirlerine yardım ederler, dedi- Âişe: Yâ Rasûlallah! Ben mü'min kadınların karşılaşmakta oldukları böylesine meşakkat görmedim. Vallahi bu kadının cildi, üzerindeki örtüden daha yeşildir, dedi. dedi ki: Kadının kocası, kadınınRasûlüllah'a gidip şikâyet ettiğini işitti de, o da Peygamber'e geldi. Beraberinde başka kadından doğma iki oğlu da vardı. Karısı Temime: Vallahi (yâ Rasûlallah) benim ona karşı beni döğmesine sebeb olacak hiçbir günâhım yoktur. Ancak ondaki cinsiyet âleti şu elbise saçağı gibi gevşek olduğundan, benim şehvetimi gideremiyor, dedi ve elbisenin kenarında dokunmamış vaziyette sarkmakta olan bir saçağı tuttu (gevşekliği gösterdi). üzerine kocası Abdurrahmân: Vallahi yalan söyledi yâ Rasûlallah! Muhakkak ki, ben onu deri silker gibi silkeliyorum (yânı cima kuvvetim kemâlindedir), fakat o benimle cinsî münâsebet yapmaktan çekiniyor, (eski kocası) Rifâa'yı istiyor! dedi. üzerine Rasûlüllah(sallallahü aleyhi ve sellem) kadına: \"İş böyle ise, sen Rifâa'ya halâl olmazsın -yahut: Sen ona elverişli olmazsın-; tâ bu kocan Abdurrahmân senin balcığından tadıncaya kadar!\" buyurdu. dedi ki: Rasûlüllah, Abdurrahmân'ın beraberindeki iki oğlana baktı da: \"Bunlar senin oğulların mı?\" diye sordu. Abdurrahmân: Evet, dedi. kadına: \"Kocanın iktidarsızlığından iddia edegeldiğin iddia işte budur! Allah'a yemin ederim ki, Abdurrahmân’ın bu çocuklara benzerliği, karganın kargaya benzerliğinden daha açıktır!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 5826,
			"arabicnumber": 5826,
			"text": "Sa'd ibn Ebî Vakkaas (radıyallahü anh): Ben Uhud harbinde Peygamber(sallallahü aleyhi ve sellem)'in solunda ve sağında iki adam gördüm ki, üzerlerinde beyaz elbiseler vardı. Bu iki kişiyi ben Uhud harbinden önce de sonra da görmedim, demiştir",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 5827,
			"arabicnumber": 5827,
			"text": "Ebû'l-Esved ed-Dîlî tahdîs etmiştir. Ona da Ebû Zerr (radıyallahü anh) tahdîs edip şöyle demiştir: Ben bir kerresinde Peygamber(sallallahü aleyhi ve sellem)'e ziyarete geldim; O, üzerinde beyaz bir elbise olduğu hâlde uyuyordu. (Döndüm) sonra yine geldim. Bu defa uyanmıştı. Peygamber: \"Lâ ilâhe ille'llâh deyip de sonra bu ikrar ve îmân üzerine vefat eden her kul muhakkak cennete girecektir!\" buyurdu. O kul zina etse, hırsızlık yapsa da mı? diye sordum. \"Zina etse de, hırsızlık yapsa da girecektir\" buyurdu. Ben: Zina etse de, hırsızlık yapsa da mı? diye tekrar sordum. O: \"Zina etse de, hırsızlık yapsa da!\" buyurdu. Ben (üçüncü defa): Zina etse de, hırsızlık yapsa da mı? diye sordum. Peygamber: \"Evet, Ebû Zerr'in burnu toprakta sürünmesine rağmen o kul zina etse de, hırsızlık yapsa da (cennete girecektir)\" buyurdu. Ebû'l-Esved: Ebû Zerr bu hadîsi her rivayet ettiğinde: \"Ebû Zerr'in burnu toprakta sürünmesine rağmen\" sözünü söylerdi, dedi. Abdillah el-Buhârî: Peygamber'in söylediği bu \"Lâ ilahe ille’llâh diyen her kul...\" sözü, ancak ölüm sırasında yahut daha önceden günâhlardan tevbe edip bunlara pişman olduğu ve \"Lâ ilâhe ille’llâh\" dediği zaman mağfiret olunur da cennete girdirilir, dedi",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 5828,
			"arabicnumber": 5828,
			"text": "Bize Şu'be tahdîs etti. Bize Katâde tahdîs edip şöyle dedi: Ben Ebû Usmân en-Nehdî'den işittim, şöyle dedi: Biz (Cezire fetihlerinde Omer'in kumandanı olan) Utbe ibnu Ferkad'ın maiyyetinde Ezrabîcân'da bulunurken bize Omer ibnu'l-Hattâb'ın mektubu geldi (içinde şu da vardı):Rasûlüllah(sallallahü aleyhi ve sellem) hâlis ipek elbise giymekten nehyetmiştir. Yalnız baş parmağı yanındaki iki parmağıyle (şehâdet ve orta parmaklarıyle) işaret ederek: \"Şu kadarı müstesna\" demiştir. Ebû Usmân en-Nehdî: Bizim bildiğimize göre, Rasûlüllah bu işaretiyle (libâsın iki parmak mikdârı ipek) alâmetlerini kasdetmektedir, demiştir",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 5829,
			"arabicnumber": 5829,
			"text": "Bize Âsim tahdîs etti ki, Ebû Usmân en-Nehdî şöyle demiştir: Bizler, Ezrabîcân'da bulunduğumuz sırada Omer bize mektûb yazdı (içinde şu hadîs de vardı):Peygamber(sallallahü aleyhi ve sellem) ipek elbise giymekten nehyetmiştir. Ancak şu kadarı müstesnadır: Peygamber bize parmaklarını dizip gösterdi. Zuheyr, orta parmak ile şehâdet parmağını dikip göstermiştir",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 5830,
			"arabicnumber": 5830,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 5831,
			"arabicnumber": 5831,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 5832,
			"arabicnumber": 5832,
			"text": "(Abdurrahmân ibn Ebî Leylâ şöyle demiştir: Huzeyfe Medâin şehrinde idi, içmek için su istedi. Ona Dihkaan, yani oranın büyük bir adamı gümüş bir kap içinde su getirdi. Huzeyfe bardağı alıp sahibine fırlattı. Ve: Ben bunu ona ilk defa atmadım. Şu kadar ki, ben onu gümüş bardakla su vermekten nehyetmiştim, fakat o bundan vazgeçmedi. aleyhi ve sellem):\"Altın, gümüş, ipek, dîbâc; bunlar dünyâda onlara âid zînet, âhirette ise sizindir\" buyurdu, dedi",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 5833,
			"arabicnumber": 5833,
			"text": "Bize Hammâd ibn Zeyd tahdîs etti. Sabit el-Bunânî şöyle demiştir: Ben Abdullah ibnu'z-Zubeyr'den işittim, hutbe yaparken Muhammed (sallallahü aleyhi ve sellem):\"Her kim ipeği dünyâda giyerse, onu âhirette giymez\" buyurdu, diyordu",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 5834,
			"arabicnumber": 5834,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 5835,
			"arabicnumber": 5835,
			"text": "Bize Alî ibnu'l-Mübârek, Yahya ibn Ebî Kesîr'den tahdîs etti. Îmrân ibnu Hıttân şöyle demiştir: Ben Âişe'ye ipekten sordum. Âişe: İbn Abbâs'a git, ona sor, dedi. dedi ki: Ben İbn Abbâs'a gidip ona da sordum. O da bana: : İbn Omer'e sor, dedi. dedi ki: Ben de gidip İbn Omer'e sordum. İbn Omer şöyle dedi: Bana Ebû Hafs, yânı Omer ibnu'l-Hattâb haber verdi ki, Rasulullah (sallallahü aleyhi ve sellem):“Dünyâda ipeği ancak, âhirette nasibi olmayan kimse giyer!” buyurmuştur. Ebû Hafs doğru söyledi, Rasûlüllah üzerine yalan söylemedi, dedim. ibnu Recâ da şöyle dedi: Bize Cerîr, Yahya'dan tahdîs etti: Bana İmrân tahdîs edip, bu hadîsi senediyle anlattı",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 5836,
			"arabicnumber": 5836,
			"text": "el-Berâ' ibn Âzib (radıyallahü anh) şöyle demiştir: Peygamber'e bir ipek kumaş hediye edildi de bizler hemen ona ellerimizle dokunmaya ve onun güzelliğine hayret etmeye başladık. Bunun üzerine Peygam ber (sallallahü aleyhi ve sellem): \"Sizler buna hayret mi ediyorsunuz?\" buyurdu. Biz: Evet (çok beğendik), dedik. Peygamber: \"Sa'd ibn Muâz'ın cennetteki mendilleri bundan daha hayırlıdır!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 5837,
			"arabicnumber": 5837,
			"text": "Cerîr ibn Hazım tahdîs edip şöyle demiştir: Ben Yesâr ibn Ebî Necîh'ten işittim; o da Mucâhid'den; o da Abdurrahmân ibnu Ebî Leylâ'dan ki, Huzeyfe (radıyallahü anh):Peygamber(sallallahü aleyhi ve sellem) bizleri altın ve gümüş kaplardan içmemizi, bu kaplar içinde yemek yememizi nehyetti ve yine harîr ve dîbâc denilen hâlis ipek kumaşları giymekten ve bunların üzerine oturmamızdan da nehyetti, demiştir",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 5838,
			"arabicnumber": 5838,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 5839,
			"arabicnumber": 5839,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 5840,
			"arabicnumber": 5840,
			"text": "Alî ibn Ebî Tâlib (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) bana hulletu siyerâ denilen yol yol sarı kalemli dokunmuş ipek kumaştan bir takım elbise giydirdi. Müteakiben ben o elbiseyi giyerek dışarı çıktığımda,Peygamber'in yüzünde öfke eseri gördüm. Bunun üzerine ben o takımı kadınlarım arasında yarıp bölüştürdüm",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 5841,
			"arabicnumber": 5841,
			"text": "Abdullah ibn Omer'den (şöyle demiştir): Omer ibnu'l-Hattâb satılmakta olan hulletu siyerâ ipek bir takım elbise gördü de: Yâ Rasûlallah! Keski bunu satın alsan da Sana geldikleri zaman elçiler için ve cumua günleri giysen! dedi. aleyhi ve sellem): \"Bunu ancak âhiretten nasibi olmayan kimse giyer!\" buyurdu. Bundan bir müddet sonra (bunun gibi birçok hülleler geldi de) Peygamber, Omer'e ipekten bir takım elbise gönderdi ve o hülleyi ona hediye etti. Bunun üzerine Omer: (Yâ Rasûlallah!) Bunu bana verdin. Halbuki ben Sen'den bu ipekli kumaş hakkında daha önce söylediğin sözleri söylerken işitmişimdir, dedi. üzerine Rasûlüllah: \"Ben bunu sana (giymen için değil) ancak satman yahut başka birisine (yani bir kadına) giydirmen için göndermişimdir\" buyurdu",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 5842,
			"arabicnumber": 5842,
			"text": "ez-Zuhrî Muhammed ibn Müslim: Enes ibn Mâlik (radıyallahü anh) bana Rasûlüllah'ın kızı Ümmü Kulsüm aleyhâ's-selâm'ın üzerinde ipek bir siyerâ bürdü gördüğünü haber verdi, demiştir",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 5843,
			"arabicnumber": 5843,
			"text": "Bize Hammâd ibn Zeyd, Yahya ibn Saîd'den; o da Ubeyd ibn Huneyn'den tahdîs etti ki, İbn Abbâs radıyallahü anhüma şöyle demiştir: Ben Omer'e, Peygamber(sallallahü aleyhi ve sellem)'e karşı birbirine yardım etmiş olan (et-Tahrîm: 4) o iki kadının kim olduğunu sormak isteyerek bir sene bekledim. Ben onun heybetinden korkuyordum. Nihayet bir gün bir konak yerinde bineğinden indi ve hacetini yerine getirmek için erâk ağaçlarının içine girdi. Oradan çıkınca ben bunu kendisine sordum. O iki kadın Âişe ve Hafsa'dır, dedi de sonra şöyle devam etti: Bizler Câhiliyet devrinde kadınları birşey saymazdık. Nihayet İslâm Dînî gelip de Allah onları (\"Onlarla iyi geçinin\" -en Nisa:18) diye zikredince, bizler Allah'ın onları zikretmesiyle onları işlerimizden hiçbirine girdirmeksizin, üzerimizde onlar için hakk olduğunu düşündük. Bir gün benimle zevcem arasında bir söz oldu da kadın bana karşı sert konuştu. Bunun üzerine ben ona: Şübhesiz senin yerin şurasıdır, yânı senin bana karşı sert konuşacak cür'etin mi var? dedim. Sen bana bunu söylüyorsun. Halbuki senin kızın Peygamber'e ezâ veriyor, dedi. ben Hafsa'ya geldim de ona: Ben seni Allah'a ve Rasûlü'ne âsî olmandan sakındırıyorum, dedim. Peygamber'e ezası hususunda başkalarından evvel ona bu öğüdü verdim. Akabinde Ümmü Seleme'ye gittim, ona da Hafsa'ya söylediğim tarzda söyledim. Ümmü Seleme: Sana hayret ediyorum yâ Omer! Bizim işlerimize girdin, hiçbirşey kalmadı da şimdi Rasûlüllah ile zevceleri arasına girmen mi kaldı? dedi ve bunu tekrar tekrar söyledi. bir komşu adam vardı. O Rasûlüllah'tan kaybolduğu, O'nun meclisinde bulunmadığı zaman ben Rasûlüllah’ın yanında bulunurdum ve ona olan şeylerin haberini getirirdim. Ben Rasûlüllah’ın meclisinde bulunamadığım zaman o hazır bulunup, Rasûlüllah'tan(vahy ve benzeri) olan şeyleri bana getirirdi. O sıralarda Rasûlüllah'ın etrafında bulunan melik ve başkan gibi kimseler hep Rasûlüllah için doğrulmuş düzelmişlerdi. Düzelmedik yalnız Şam'daki Gassân Meliki kalmıştı. İşte biz Gassân Meliki'nin bize gelip saldırmasından korkar dururduk. Derken bir gün Ensârî komşumun geldiğini hissettim. O: Şu muhakkak ki bir iş meydana gelmiştir! diyordu. Ben de ona: Nedir o? Gassânî mi geldi? dedim. Ensârî: Bundan daha büyük bir iş! Rasûlüllah kadınlarını boşamış! dedi. ben geldim, bir de gördüm ki, kadınların hücrelerinin hepsinden bir ağlama var! Peygamber ise birkaç basamakla çıkılır meşrubesine (şerbetlik denilen sekili hücresine) çıkmış, kapısının ününde de siyah uşağı duruyor. Ben ona vardım da: Benim için içeri girmeye izin isteyiver! dedim. Peygamber bana izin verdi, yanına girdim. Bir de gördüm ki, bir hasır üzerinde bulunuyordu. Üzerine yattığı hasır yan tarafında izler yapmıştı. Başının altında içi lif dolu meşin bir yastık vardı. İçeride asılmış birkaç tane tabaklanmamış hayvan derisi ile deri tabaklamakta kullanılan bir mikdâr karaz ağacı yaprağı vardı. Ben Rasûlüllah'a, Hafsa ile Ümmü Seleme'ye söylediklerimi ve Ümmü Seleme'nin bana yaptığı reddiyeyi zikrettim. Rasûlüllah güldü. Kendi o yüksek oda içinde yirmidokuz gece ikaamet etti, sonra oradan ailelerinin yanına indi",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 5844,
			"arabicnumber": 5844,
			"text": "ez-Zuhrî şöyle demiştir: Bana Haris kızı Hind haber verdi ki, Ümmü Seleme(radıyallahü anha) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) geceden bir vakitte uyandı da şöyle diyordu: \"Lâ ilahe ille'llâh! Bu gece ne fitneler indirildi! Ve ne hazîneler de indirildi! Hücrelerin sahibeleri olan kadınları (yânı mü'minlerin analarını) kim uyandırır? Dünyâda nice giyinik kadınlar vardır ki, kıyâmet gününde çıplaktırlar!\" Bu Hind'in geniş elbisesinin iki yeninde, parmaklarının arasında birçok düğmeleri vardı, demiştir",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 5845,
			"arabicnumber": 5845,
			"text": "Hâlid ibn Saîd'in kızı Hâlid ibnu'z-Zubeyr'in anası şöyle demiştir: Rasûlüllah'a birçok elbiseler getirilmişti. Bunların içinde siyah bir yün elbise vardı.Rasûlüllah(sallallahü aleyhi ve sellem): \"Bu siyah yün kumaşı kime giydirelim dersiniz?\" buyurdu. Oradaki topluluk susturuldu. Rasûlüllah: \"Bana Ümmü Hâlid'i getirin!\" buyurdu. üzerine ben Peygamber'in yanına getirildim de Peygamber kendi eliyle onu giydirdi. Ve iki kerre: \" (Kızım bunu sağlıkla) eskit parçala!\" diye duâ etti.Peygamber o yün kumaşın damgalarına bakmaya ve eliyle bana işaret ederek: \"Yâ Ümme Hâlid, bu senadır (yani güzeldir)\" demeye başladı. kelimesi Habeş dilinde \"Güzel\" demektir. İshâk ibn Saîd: Bana ehlimden bir kadın \"Hamîsa\" denilen bu yünlü kumaşı Ümmü Hâlid'in üstünde gördüğünü haber verdi, demiştir",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 5846,
			"arabicnumber": 5846,
			"text": "Bize Abdulvâris, Abdulazîz ibn Suheyb'den tahdîs etti ki, Enes (radıyallahü anh):Peygamber(sallallahü aleyhi ve sellem) erkeğin zağferân sürünmesini nehyetti, demiştir",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 5847,
			"arabicnumber": 5847,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 5848,
			"arabicnumber": 5848,
			"text": "Bize Şu'be, Ebû İshâk'tan tahdîs etti. O da el-Berâ (radıyallahü anh)'dan şöyle derken işitmiştir: Peygamber(sallallahü aleyhi ve sellem) uzunla kısa boy arası orta boyda yaratılmıştı. Ben O'nu bir kerresinde kırmızı bir elbise içinde görmüştüm ki, ben O'ndan daha güzel birşey görmedim",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 5849,
			"arabicnumber": 5849,
			"text": "el-Berâ (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) bizlere yedi şeyi işlememizi emretti: Hasta ziyaretine gitmeyi, cenaze arkasından gitmeyi, aksırana duâ etmeyi... Yine Peygamber bizleri harîr, dîbâc, kassî ve istebrak denilen ipekli kumaşlar giymekten ve kırmızı ipek altlıklar (yahut üstlükler) kullanmaktan da nehyetti",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 5850,
			"arabicnumber": 5850,
			"text": "Ebû Seleme Saîd el-Ezdî şöyle demiştir: Ben Enes ibn Mâlik (radıyallahü anh)'e: Peygamber(sallallahü aleyhi ve sellem) ayağındaki iki ayakkabı ile namaz kılar mıydı? diye sordum. Evet (kılardı), diye cevâb verdi",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 5851,
			"arabicnumber": 5851,
			"text": "Ubeyd ibn Cureyc, Abdullah ibn Omer (radıyallahü anh) 'e: Arkadaşlarından hiçbirini yapar görmediğim dört şeyi, seni yapıyor görüyorum? dedi. Omer: Nedir onlar? Yâ Ubeydallah ibn Cureyc! dedi. İbn Cureyc: Seni görüyorum ki, sen Ka'be'nin rükünlerinden el-Haceru'l-Esved ile er-Rüknü'l-Yemânî'den başkasına el sürmüyorsun. Seni görüyorum ki, tabaklanmış deriden yapılmış ayakkabılar giyiyorsun. Seni görüyorum ki, sarı boya kullanıyorsun. Bir de görüyorum, Mekke'de bulunduğun zaman insanlar zu’l-hicce'nin hilâlini gördüklerinde yüksek sesle telbiyeye başladıkları hâlde, sen terviye yânı sekizinci gün girmedikçe telbiyeye başlamıyorsun, demiş. üzerine Abdullah ibn Omer de ona hitaben şöyle demiştir: Ka'be'nin rükünlerine gelince, benRasûlüllah'ın el-Hacerü'l-Esved ile er-Rüknü’l-Yemânî'den başkasına el sürdüğünü görmedim. Tabaklanmış deriden ayakkabılara gelince, ben Rasûlüllah'ın üzeri kılsız (deriden yapılmış) ayakkabılar giyip ayağı içinde iken abdest aldığını gördüm. Onun için ben onları giymeyi severim. Sarı boyaya gelince, Rasûlüllah'ın sarı boya ile (elbisesini veya sakalını) boyadığını gördüm. Ben de onun için o boya ile boyamayı severim. Telbiye okumaya gelince, ben Rasûlüllah(sallallahü aleyhi ve sellem)'ın binek hayvanı Mekke'den Minâ'ya doğru yönelip hareket etmedikçe telbiye ettiğini görmedim",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 5852,
			"arabicnumber": 5852,
			"text": "ez-Zuhrî şöyle demiştir: Bana Salim, babası Abdullah ibn Omer (radıyallahü anh) 'den haber verdi ki, Peygamber (sallallahü aleyhi ve sellem) şöyle buyurmuştur: \"İhrama giren kimse ne gömlek, ne sarık, ne don, ne bornus, ne cehrî veya zağferânla boyanmış bir kumaş, ne ayakkabı giyer. Ancak iki terlik bulamayan kimse için ayakkabı giyme ruhsatı vardır. Şöyle ki, iki terlik bulamayan kimse, ayakkabıları topukların aşağısından keser",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 5853,
			"arabicnumber": 5853,
			"text": "İbn Abbâs radıyallahü anhüma:Peygamber(sallallahü aleyhi ve sellem):\"îzârı olmayan kimse don giysin; iki na’li olmayan kimse de huffeyn, yâni iki mest giysin \" buyurdu, demiştir",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 5854,
			"arabicnumber": 5854,
			"text": "Âişe (r. anha):Peygamber(sallallahü aleyhi ve sellem) abdest almakta, saçını sakalanı taramakta, ayakkabı giymekte sağdan başlamayı severdi, demiştir",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 5855,
			"arabicnumber": 5855,
			"text": "el-A'rec'den; o da Ebû Hureyre (radıyallahü anh)'den tahdîs etti ki, Rasûlüllah(sallallahü aleyhi ve sellem) şöyle buyurmuştur: \"Sizin biriniz ayakkabısını giyeceği zaman sağ ayağı ile başlasın; çıkaracağı zaman da sol ayağıyle çıkarmaya başlasın! Bu suretle sağ ayak, giyilen iki ayağın evveli; çıkarılan iki ayağın da sonu olsun",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 5856,
			"arabicnumber": 5856,
			"text": "el-A'rec'den; o da Ebû Hureyre (radıyallahü anh)'den tahdîs etti ki, Rasûlüllah(sallallahü aleyhi ve sellem):\"Sakın sizin biriniz bir tek ayakkabı ile yürümesin! Ya ikisini beraber çıkarsın (çıplak ayakla yürüsün) yahut ikisini de beraberce giysin!\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 5857,
			"arabicnumber": 5857,
			"text": "Bize Katâde, Enes ibn Mâlik (radıyallahü anh)'ten:Peygamber(sallallahü aleyhi ve sellem)'in ayakkabısının iki tasması vardı, diye tahdîs etti",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 5858,
			"arabicnumber": 5858,
			"text": "Bize İsâ ibn Tahmân haber verip şöyle dedi: Enes ibn Mâlik (radıyallahü anh) bize iki ayakkabı çıkardı ki, bunlardan herbirinin iki tasması vardı. Sabit el-Bunânî: Bunlar, Peygamber(sallallahü aleyhi ve sellem)'in ayakkabılarıdır, dedi",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 5859,
			"arabicnumber": 5859,
			"text": "Ebû Cuhayfe (Vehb ibn Abdillah es-Suvâî-radıyallahü anh) şöyle demiştir: Ben Peygamber(sallallahü aleyhi ve sellem)'in yanına geldim. Kendisi o sırada kızıl sahtiyandan yapılmış kırmızı bir çadır içinde bulunuyordu. Bilâl'i de gördüm ki, Peygamber'in abdest suyunu alıp getirdi, insanlar o abdest suyunu almaya koşuşuyorlardı. O sudan her kimin eline birşey geçti ise (teberrük için) üzerine sürdü. Ele geçiremeyen ise arkadaşının elindeki ıslaklıktan aldı",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 5860,
			"arabicnumber": 5860,
			"text": "İbn Şihâb şöyle demiştir: Bana Enes ibn Mâlik (radıyallahü anh) haber verip Peygamber(sallallahü aleyhi ve sellem) Ensâr'a haber gönderdi de, onları deriden yapılmış bir çadır içinde topladı, dedi",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 5861,
			"arabicnumber": 5861,
			"text": "Bize Mu'temir, Ubeydullah'tan; o da Saîd ibn Ebî Saîd'den; o da Ebû Seleme ibn Abdirrahmân'dan; o da Âişe (r.anha)'den şöyle tahdîs etti: Peygamber(sallallahü aleyhi ve sellem) geceleyin hasırdan bir hücre edinir, namaz kılar, gündüzleyin onu yere yayar ve üzerine otururdu. Peygamber böyle nafile namazı kılarken insanlar O'nun namazına uyup namaz kılmaya başladılar, nihayet insanlar çoğaldılar. Bunun üzerine Peygamber yüzünü insanlara döndürdü de: \"Ey insanlar, amellerden gücünüzün yetişebileceği mikdârı alınız. Çünkü Allah, sizler ibâdetten usanıp bezmedikçe sevâb vermekten bıkmaz. Ve şübhesiz Allah 'a göre amellerin en sevimli olanı, az olsa bile devamlı olanıdır!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 5862,
			"arabicnumber": 5862,
			"text": "Ve el-Leys şöyle dedi: Bana Abdullah ibnu Muleyke, Mısver ibn Mahrame'den tahdîs etti ki, babası Mahrame ona: Ey oğulcuğum! Peygamber'e bir çok kaftanlar geldiği, O'nun da bunları taksim ediyor olduğu haberi bana ulaştı. Haydi Peygamberin yanına beraber gidelim, demiştir. dedi ki: Bunun üzerine biz gittik ve Peygamber'i evinde bulduk. Babam bana: Ey oğulcuğum! Peygamber'i bana çağır! dedi. çağırmayı ağır buldum da Rasûlüllah'ı senin yanına mı çağırayım? dedim. tekrar bana: Ey oğulcuğum! (Haydi çağır!) Çünkü O bir cebbar değildir, dedi. üzerine ben Rasûlüllah(sallallahü aleyhi ve sellem)'ı çağırdım. omuzlarında altın düğmelerle düğmelenip sağlamlaştırılmış dîbâcdan bir kaftan olduğu hâlde dışarı çıktı ve: \"Yâ Mahrame! Bu, senin için saklamış olduğum kaftandır!\" buyurdu da, o kaftanı Mahrame'ye verdi",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 5863,
			"arabicnumber": 5863,
			"text": "Bize Eş'as ibn Suleym tahdîs edip şöyle dedi: Ben Muâviye ibn Suveyd ibn Mukarrin'den işittim, şöyle dedi: Ben el-Berâ ibn Âzib'den işittim. Allah ikisinden de razı olsun, şöyle diyordu: Peygamber (sallallahü aleyhi ve sellem) bizleri yedi şeyi işlemekten nehyetti: Altın yüzük takmaktan -râvî: Yâhud altın halka takmaktan, dedi- harîr, istebrak, dîbâc denilen ipekli kumaşları kullanmaktan, kırmızı ipek altlık kullanmaktan, kassî denilen ipekli kumaşı kullanmaktan ve gümüş kaplar kullanmaktan nehyetti. Yine Peygamber bize şu yedi şeyi işlememizi emretti: Hasta ziyareti yapmayı, cenazelerin ardından gitmeyi, aksırana - \"Yerhamuke’llâhu = Allah sana merhamet eylesin!\" diye)- duâ etmeyi, verilen selâmı alıp karşılamayı, da'vet edene icabet etmeyi, yemîn edenin yeminini kabul etmeyi ve zulme uğramışa yardım etmeyi emreyledi",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 5864,
			"arabicnumber": 5864,
			"text": "Cerîr ibn Hazım tahdîs edip şöyle demiştir: Ben Yesâr ibn Ebî Necîh'ten işittim; o da Mucâhid'den; o da Abdurrahmân ibnu Ebî Leylâ'dan ki, Huzeyfe (radıyallahü anh):Peygamber(sallallahü aleyhi ve sellem) bizleri altın ve gümüş kaplardan içmemizi, bu kaplar içinde yemek yememizi nehyetti ve yine harîr ve dîbâc denilen hâlis ipek kumaşları giymekten ve bunların üzerine oturmamızdan da nehyetti, demiştir",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 5865,
			"arabicnumber": 5865,
			"text": "Buradaki senedde de el-Berâ' ibnÂzib (radıyallahü anh): Peygamber(sallallahü aleyhi ve sellem) bizleri kırmızı ipek altlıklardan ve kassî denilen ipekli kumaştan nehyetti, demiştir",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 5866,
			"arabicnumber": 5866,
			"text": "Alî ibn Ebî Tâlib (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) bana hulletu siyerâ denilen yol yol sarı kalemli dokunmuş ipek kumaştan bir takım elbise giydirdi. Müteakiben ben o elbiseyi giyerek dışarı çıktığımda,Peygamber'in yüzünde öfke eseri gördüm. Bunun üzerine ben o takımı kadınlarım arasında yarıp bölüştürdüm",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 5867,
			"arabicnumber": 5867,
			"text": "Abdullah ibn Omer (radıyallahü anh) şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem) altından bir mühür yüzük takardı. Bir gün onu çıkarıp attı da: \"Ben bunu ebediyyen takmam!\" buyurdu. üzerine parmaklarına altın yüzük takmış olan insanlar da kendi yüzüklerini çıkarıp attılar",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 5868,
			"arabicnumber": 5868,
			"text": "Bize el-Leys, Yûnus'tan tahdîs etti ki, İbn Şihâb şöyle demiştir: Bana Enes ibn Mâlik (radıyallahü anh) tahdîs etti ki, kendisi bir gün Rasûlüllah'ın elinde gümüşten.yapılmış bir mühür yüzük gördü. dedi ki:) Bundan sonra bunu gören insanlar da kendilerine gümüşten yüzükler yaptırıp bunları parmaklarına taktılar. Bunun üzerine Rasûlüllah (sallallahü aleyhi ve sellem) kendi parmağındaki mühür yüzüğünü çıkarıp attı. Akabinde insanlar da parmaklarındaki yüzükleri çıkarıp attılar. hadîsi ez-Zuhrî'den (yakın lafızlarla) rivayet etmekte Yûnus'a İbrâhîm ibn Sa'd, Ziyâd, Şuayb ibn Ebî Hamza mutâbaat ettiler. Musâfir, ez-Zuhrî'den yaptığı rivayetinde \"Enes gümüşten bir yüzük gösterdi\" şeklinde söylemiştir",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 5869,
			"arabicnumber": 5869,
			"text": "Bize Humeyd et-TavîI haber verip şöyle dedi: Enes ibn Mâlik'e: Peygamber(sallallahü aleyhi ve sellem) bir mühür yüzük edindi mi? diye soruldu. Enes şöyle dedi: Peygamber(sallallahü aleyhi ve sellem) bir gece yatsı namazını gece yarısına kadar geciktirdi. Namazı kıldırdıktan sonra yüzünü bize yöneltti. O zamanki Peygamber'in gümüş mühür yüzüğünün parıltısı hâlâ gözümün önündedir. Peygamber:\" (Bu saatte) insanlar namaz kılıp uyumuşlardır. Sizler ise namazı beklemekte bulunduğunuz müddetçe hep devamlı namaz içinde olmaktasınız\" buyurdu",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 5870,
			"arabicnumber": 5870,
			"text": "Bize Mu'temir haber verip şöyle dedi: Ben Humeyd'den işittim; o Enes ibn Mâlik(radıyallahü anh)'ten,Peygamber(sallallahü aleyhi ve sellem)'in mühür yüzüğü gümüştendi, onun kaşı da gümüştendi, dediğini tahdîs ediyordu. ibn Eyyûb şöyle dedi: Bana Humeyd tahdîs etti ki, kendisi Enes'ten işitmiştir; o da Peygamber'den",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 5871,
			"arabicnumber": 5871,
			"text": "Bize Abdulazîz, babası Ebû Hâzım'dan tahdîs etti ki, Ebû Hazım da Sehl ibn Sa'd(radıyallahü anh)'dan şöyle derken işitmiştir: Peygamr ber (sallallahü aleyhi ve sellem)'e bir kadın geldi de: Ben kendimi Sana hibe etmeye (kadınlık kıymetimi mehirsiz bağışlamaya) geldim, dedi ve uzun zaman ayakta dikildi. ona baktı ve başını indirdi. Kadının ayakta durması uzayınca, orada hazır bulunanlardan bir adam: Eğer bu kadına Sen'in için bir hacet yoksa, onu benimle evlendir! dedi. ona: \"Yanında kadına mehr vereceğin birşey var mı?\" buyurdu. Hayır yok! dedi. \"Ona mehr verecek birşey bak araştır!\" buyurdu. üzerine o zât gitti, sonra dönüp geldi de: Vallahi hiçbirşey bulamadım! dedi.Peygamber yine: \"Git araştır! Velev ki demirden bir yüzük olsun bul!\" buyurdu. yine gitti, sonra dönüp geldi ve yine: Hayır vallahi, demirden bir yüzük bile bulamadım! dedi. fakîr adamın belinden aşağısını örten bir tek izârı vardı, vücûdunun üst tarafını örtecek bir ridâsı bile yoktu. Böyle iken adam: Ben kadına bu izârımı mehr olarak veririm, dedi. Peygamber: \"Senin izârın; eğer onu kadın giyerse, ondan senin üzerinde hiçbirşey kalmaz; eğer sen giyersen, kadının üzerinde ondan birşey bulunmaz!\" buyurdu. üzerine adam geri çekildi de oturdu. Peygamber sonra onu dönüp giderken gördü de, onun çağırılmasını emretti. Çağırıldı. Peygamber ona: \"Kur'ân'dan ezberinde ne var?\" diye sordu. O zât: Ezberimde şu sûre var, şu sûre var! diye birtakım sûreleri saydı. \"Kur'ân'dan ezberindeki sûrelere mukaabil seni bu kadına mâlik kıldım!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 5872,
			"arabicnumber": 5872,
			"text": "Bize Saîd ibn Ebû Arûbe, Katâde'den; o da Enes ibn Mâlik (radıyallahü anh)'ten şöyle tahdîs etti. Peygamber(sallallahü aleyhi ve sellem) birçok kimselere yahut yabancılardan birtakım insanlara mektûb yazmak istedi. Sahâbîler tarafından kendisine: Onlar (yani Rûm'dan,Acem'den, Habeş'ten muhâtab olanlar) üzeri mühürlü olmadıkça hiçbir mektûb kabul etmezler, denildi. üzerine Peygamber, nakşı \"Muhammedun Rasûlüllah\" olan, gümüşten bir mühür yüzük edindi. Şimdi bile Peygamber'in parmağında yahut elinde o mühür yüzüğün parıldaması sanki karşımda gibidir",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 5873,
			"arabicnumber": 5873,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 5874,
			"arabicnumber": 5874,
			"text": "Enes ibn Mâlik (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) bir mühür yüzük edindi ve: \"Biz (gümüşten) bir mühür yüzük edindik, üzerine de bir nakış (Muhammedun Rasûlüllah) nakşettirdik. Artık hiçkimse (ben hayâtta iken) bu yazıyı yüzük üzerine nakş ve taklîd etmesin!\" buyurdu. Ben şimdi Peygamber'in küçük parmağında o mühür yüzüğün parıldamasını muhakkak görmekteyimdir, demiştir",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 5875,
			"arabicnumber": 5875,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 5876,
			"arabicnumber": 5876,
			"text": "Abdullah ibn Omer (radıyallahü anh), Nâfi'e şöyle tahdîs etmiştir: Peygamber(sallallahü aleyhi ve sellem) evvelâ altından bir mühür yaptırdı. Bunu takındığı zaman yazılı kaşını avucunun içine alırdı. Peygamber'in elinde altın yüzük gören insanlar da altından yüzükler yaptırdılar. Bunun üzerine Peygamber minbere çıktı da Allah'a hamd ve sena etti ve akabinde: \"Ben bu altından mühür yüzüğü yaptırmıştım. Fakat ben onu bundan sonra takmayacağım\" buyurdu da, parmağından onu çıkarıp attı. Bunun üzerine insanlar da altın yüzüklerini ellerinden çıkardılar. Cuveyriye: Ben Nâfi'in \"Yüzüğü sağ eline takardı\" dediğini kuvvetle sanıyorum, demiştir",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 5877,
			"arabicnumber": 5877,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 5878,
			"arabicnumber": 5878,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 5879,
			"arabicnumber": 5879,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 5880,
			"arabicnumber": 5880,
			"text": "Bize İbn Cureyc haber verdi: Bize el-Hasen ibnu Müslim, Tâvûs'tan; o da İbn Abbâs radıyallahü anhüma'tan haber verdi ki, o: Ben, Peygamber(sallallahü aleyhi ve sellem) ile birlikte bayram namazında hazır bulundum. Namazı hutbeden evvel kıldırdı(demiştir). Abdillah el-Buhârî şöyle dedi: İbnu Vehb, İbn Cureyc'ten getirdiği hadîste şunu ziyâde etti: Peygamber(sallallahü aleyhi ve sellem) bundan sonra yanında Bilâl olduğu hâlde kadınların bulundukları tarafa geldi de onlara sadaka vermeyi emretti. Kadınlar artık kaşsız halkaları ve yüzükleri Bilâl'in eteği içine atmaya başladılar, demiştir",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 5881,
			"arabicnumber": 5881,
			"text": "Bize Adiyy ibn Sabit haber verip şöyle dedi: Ben Saîd ibn Cubeyr'den; o da İbn Abbâs radıyallahü anhüma'tan ki, o: Peygamber(sallallahü aleyhi ve sellem) bayram günü yalnız iki rek'at bayram namazı kıldırıp, bu iki rek'atten evvel de sonra da hiçbir namaz kılmadı. Sonra yanında Bilâl olduğu hâlde kadınların bulunduğu tarafa geldi de onlara sadaka vermeyi emretti. Herbir kadın artık kulağındaki küpesini Bilâl'in eteği içine atmaya başladı, demiştir",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 5882,
			"arabicnumber": 5882,
			"text": "Bize Hişâm ibn Urve, babası Urve ibnu'z-Zubeyr'den tahdîs etti ki, Âişe (r.anha) şöyle demiştir; Bir seferde kızkardeşim Esmâ'ya âid olan bir gerdanlık kayboldu.Peygamber(sallallahü aleyhi ve sellem) onun aranması için birkaç adam yolladı. Bunlar ararken namaz vakti de geldi. Kendileri abdestli değillerdi ve bir su da bulamadılar. Artık çaresiz abdestsiz oldukları hâlde namazı kıldılar. Döndüklerinde onlar böyle abdestsiz olarak namaz kıldıklarını Peygamber'e söylediler. Bunun üzerine Allah Teyemmüm Âyeti'ni (el-Mâide: 6) indirdi. ibnu Numeyr, Hişâm'dan; o da babasından; o da Âişe'den yaptığı rivayette: Âişe bu gerdanlığı kizkardeşi Esma'dan ariyet olarak almıştı, ziyâdesini getirmiştir",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 5883,
			"arabicnumber": 5883,
			"text": "Bize Şu'be, Adiyy ibn Sâbit'ten; o da Saîd ibn Cubeyr'den tahdîs etti ki, İbn Abbâs radıyallahü anhüma şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) bir bayram günü namazgaha çıktı da yalnız iki rek'at kıldırıp, ondan evvel de sonra da hiçbir namaz kılmadı. Sonra (yanında Bilâl olduğu hâlde) kadınların bulundukları tarafa geldi de onlara sadaka vermelerini emretti. Bunun üzerine kadınlar küpelerini, gerdanlıklarını sadaka olarak vermeye başladılar",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 5884,
			"arabicnumber": 5884,
			"text": "Ebû Hureyre (radıyallahü anh) şöyle demiştir: Ben Medîne çarşılarından bir çarşıda Rasûlüllah'ın beraberinde idim. Rasûlüllah(sallallahü aleyhi ve sellem) yürüdü, ben de O'nun beraberinde yürüdüm. (Nihayet Fâtıma'nın evinin avlusunda bir kenara oturdu da torunu Hasen'i kasdederek) üç kerre: \"Küçük neredesin? Küçük neredesin? Küçük neredesin?\" diye seslendi. Ve bana: \"Alî'nin oğlu Hasen'i çağır!\" buyurdu. üzerine Alî'nin oğlu Hasen, boynunda kokulu boncuk gerdanlığı olduğu hâlde yürüyüp geldi. Peygamber(sallallahü aleyhi ve sellem) sarmaşmak üzere elini şöyle yaydı, Hasen de elini açıp yaydı, Peygamber Hasen'e yapışıp sarmaştı ve: \"Allah'ım, ben bu çocuğu seviyorum, Sen de onu sev ve onu seveni de sev!\" diye duâ etti. Hureyre: Rasûlüllah'ın Hasen hakkında söylediği bu sözIerden sonra artık bana hiçbir kimse Alî'nin oğlu Hasen'den daha sevgili olmadı, demiştir",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 5885,
			"arabicnumber": 5885,
			"text": "Bize Şu'be, Katâde'den; o da İkrime'den tahdîs etti ki, İbn Abbâs radıyallahü anhüma:Rasûlüllah(sallallahü aleyhi ve sellem) erkeklerden kadınlara benzemeye çalışanlara ve kadınlardan erkeklere benzemeye çalışanlara lânet etti, demiştir. hadîsi \"Bize Şu'be haber verdi\" diye rivayet eden Amr ibn Merzûk el-Bâhilî, Gunder'e mutâbaat etmiştir",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 5886,
			"arabicnumber": 5886,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 5887,
			"arabicnumber": 5887,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 5888,
			"arabicnumber": 5888,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 5889,
			"arabicnumber": 5889,
			"text": "İshâk ibn Süleyman tahdîs edip şöyle dedi: Ben Hanzala'dan işittim; o da Nâfi'den; o da ibn Omer (radıyallahü anh) 'den ki, Rasûlüllah(sallallahü aleyhi ve sellem): \"Eteği tıraş etmek, tırnaklan kesmek ve bıyığı kırkıp kısaltmak fıtrattandır (yani sünnettendir)\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 5890,
			"arabicnumber": 5890,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 5891,
			"arabicnumber": 5891,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 5892,
			"arabicnumber": 5892,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 5893,
			"arabicnumber": 5893,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 5894,
			"arabicnumber": 5894,
			"text": "Bize Vuheyb, Eyyûb'dan tahdîs etti ki, Muhammed ibn Sîrîn şöyle demiştir: Ben Enes'e: Peygamber(sallallahü aleyhi ve sellem) saçını sakalını boyadı mı? diye sordum. Enes (radıyallahü anh): Peygamber(sallallahü aleyhi ve sellem) az bir şeyden başka saç sakal ağarmasına ulaşmadı, dedi",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 5895,
			"arabicnumber": 5895,
			"text": "Sabit el-Bunânî şöyle dedi: Enes'e Peygamber'in sakalını boyaması (vâki' olup olmadığı) soruldu da, Enes (radıyallahü anh): Şu muhakkak ki, Peygamber(sallallahü aleyhi ve sellem) saç sakal boyayacak dereceye ulaşmadı. Eğer ben O'nun sakalındaki beyaz kılları saymak isteseydim (muhakkak sayardım), dedi",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 5896,
			"arabicnumber": 5896,
			"text": "Usmân ibn Abdillah ibn Mevheb şöyle demiştir: Ehlim (yânı Talha ailesi yahut zevcem) beni Peygamber'in zevcesi Ümmü Seleme'ye bir gümüş bardak içindeki su sebebiyle yolladı. râvîsi İsrâîl ibn Yûnus üç parmağını yumdu (üç defa gönderdiler yahut bardağın boyu bu kadardı demek istedi). devamla dedi ki:) O kadehin içinde Peygamber'in saçları vardı. İnsanlar kendilerinden bir insana göz değmesi yahut herhangi birşey isabet ettiği zaman Ümmü Seleme'ye bir kabını gönderirlerdi. İşte bu gönderilmemde ben Ümmü Seleme'nin yanında küçük bir kaba muttali' oldum ki, onun içinde bir takım kırmızı saçlar gördüm",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 5897,
			"arabicnumber": 5897,
			"text": "Usmân ibn Abdillah ibn Mevheb: Ben Ümmü Seleme'nin yanına girdim. O bizlerePeygamber(sallallahü aleyhi ve sellem)'in saçlarından bir mikdâr boyanmış saç çıkarıp gösterdi, demiştir. geçen senedle şöyle dedi:) Bize Ebû Nuaym Fadl ibn Dükeyn söyledi. Bize Nusayr ibn Ebi'l-Eş'as, İbn Mevheb'den tahdîs etti ki, Ümmü Seleme ona Peygamber'in kırmızı saçlarını göstermiştir",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 5898,
			"arabicnumber": 5898,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 5899,
			"arabicnumber": 5899,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 5900,
			"arabicnumber": 5900,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 5901,
			"arabicnumber": 5901,
			"text": "Bize Mâlik ibn İsmâîl tahdîs etti. Bize İsrâîl ibn Yûnus tahdîs etti ki, dedesi Ebû İshâk şöyle demiştir: Ben el-Berâ ibn Âzib'den işittim: Ben kırmızı bir takım elbise içinde Peygamber (sallallahü aleyhi ve sellem)'den daha güzel bir kimse görmedim, diyordu. dedi ki:) Arkadaşlarımın bâzısı(yani Ya'kûb ibn Sufyân) şeyhim Mâlik ibn İsmâîl'den: \"Peygamber'in başının saçı (sarktığı zaman) omuzlarına yakın uzun olup orayı döver dururdu\" tarzında söylemiştir. İshâk Amr es-Subey'î: Ben bu hadîsi el-Berâ'dan birçok defalar tahdîs ederken işittim. O bu hadîsi her tahdîs ettiğinde muhakkak güldü, demiştir. \"Peygamber'in saçları kulak memelerine kadar ulaşırdı\" sözünde Ebû İshâk'a mutâbaat etmiştir",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 5902,
			"arabicnumber": 5902,
			"text": "Bize Mâlik, Nâfi'den; o da Abdullah ibn Omer (radıyallahü anh) 'den şöyle haber verdi: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: \"Bana bir gece ru'yâmda kendim Ka'be'nin yanında gösterildi ve orada esmer erkeklerden görmekte bulunduklarının en güzeli olan esmer bir adam gördüm ki, yine görmekte olduklarının en güzeli nev'inden bol bir saçı vardı, saçlarını yeni taramış olup henüz su akıtıyordu, iki adama yahut iki adamın omuzlarına dayanarak Ka'be'yi tavaf ediyordu. Ben: Bu kimdir? diye sordum. Bu, Meryem'in oğlu İsâ Mesih'tir, denildi. de başının saçı çok kıvırcık, sağ gözü şaşı, sanki emsalinin arasından dışa doğru fırlamış bir üzüm tanesi gibi olan birisiyle karşılaştım ve: Bu kimdir? dedim. Bu, Mesîh Deccâl'dir, denildi",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 5903,
			"arabicnumber": 5903,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 5904,
			"arabicnumber": 5904,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 5905,
			"arabicnumber": 5905,
			"text": "Katâde şöyle demiştir: Ben, Enes ibn Mâlik (radıyallahü anh)'eRasûlüllah'ın saçlarından sordum da Enes şöyle dedi: Rasûlüllah(sallallahü aleyhi ve sellem)'ın saçları düz ve çok uzun da değil, kıvırcık ve kısa da değildi; O'nun saçları kulaklarıyle omuzu arasında idi",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 5906,
			"arabicnumber": 5906,
			"text": "Enes ibn Mâlik (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem)'in elleri iri ve kalın idi. Ben O'ndan önce de, sonra da (güzellikte) onun benzerini görmedim. Peygamber'in saçları kıvırcık da değil, düz de değil; ikisi arası bir kıvamda idi",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 5907,
			"arabicnumber": 5907,
			"text": "Enes ibn Mâlik (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem)'in iki eli ve iki ayağı kalındı, güzel yüzlü idi. Ben O'ndan önce de, O'ndan sonra da güzellikte O'nun benzerini görmedim. Peygamber'in iki avucu (hilkaten veya ikramca) açık idi",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 5909,
			"arabicnumber": 5909,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 5910,
			"arabicnumber": 5910,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 5912,
			"arabicnumber": 5912,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 5913,
			"arabicnumber": 5913,
			"text": "Mucâhid ibn Cebr şöyle demiştir: Biz İbn Abbâs'ın, yanında idik. Mecliste bulunanlar Deccâl'ı (şaşı ve çok yalancıdır diye) zikrettiler. Bunun üzerine İbn Abbâs: Şu muhakkak ki, onun iki gözü arasında \"Kâfir\" sözü yazılmıştır, dedi. yine İbn Abbâs: Ben Peygamber'den bu \"İki gözü arasında 'Kâfir' yazılmıştır\" sözünü işitmedim. Lâkin Peygamber(sallallahü aleyhi ve sellem)\"İbrâhim el-Halîl'e gelince(onu görmek isterseniz) işte ben arkadaşınıza bakınız. Musa'ya gelince, o buğday renkli, etli ve toplu bedenli bir adamdır. Saçları kıvırcık, lifle yularlanmış kızıl bir deve üzerine binmiş, telbiye ederek Ezrak Vâdîsi'nde akıp giderkenki hâli hâlâ gözümün önündedir\" buyurdu, demiştir",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 5914,
			"arabicnumber": 5914,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 5915,
			"arabicnumber": 5915,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 5916,
			"arabicnumber": 5916,
			"text": "ez-Zuhrî şöyle demiştir: Bana Salim ibn Abdillah haber verdi ki (babası) Abdullah ibn Omer şöyle demiştir: Ben babam Omer (radıyallahü anh) 'den işittim: Başının saçlarını enliliğine ören kimse saçlarını tıraş etsin. (İhram dışında) saçlarınızı yapıştırıp keçeleştirmeğe benzemeyiniz! diyordu. ibn Omer de: Yemîn olsun ben Rasûlüllah'ın başının saçlarını zamklı bir madde ile toplayıp yapıştırırken görmüşümdür, diyordu. Yûnus ibn Yezîd, ez-Zuhrî'den; o da Sâlim'den haber verdi ki, İbn Omer (radıyallahü anh) şöyle demiştir: Ben Rasûlüllah(sallallahü aleyhi ve sellem)'tan saçlarını zamklı bir madde ile toplayıp yapıştırmış olduğu hâlde ihramda yüksek sesle telbiye ederken işittim. O şu sözleri söylüyordu: \"Lebbeyk Allâhumme lebbeyke, lebbeyke lâ şerike leke, lebbeyke innel-hamde ve'n-nîmete leke, ve'l-mülke lâ şerike leke\".Rasûlüllah, bu kelimeler üzerine artırma yapmıyordu. Mâlik, Nâfi'den; o da Abdullah ibn Omer'den tahdîs etti ki, Peygamber'in zevcesi Hafsa (radıyallahü anha): Yâ Rasûlallah! Bu insanların hâli nedir? Herkes umre ile ihramdan çıktılar, Halbuki Sen umren ile ihramdan çıkmadın? diye sordu. (sallallahü aleyhi ve sellem): \"Ben başımın saçlarını yapıştırıp telbîd yaptım, kurbanıma da gerdanlık taktım. Artık ben kurbanımı kesinceye kadar ihramdan çıkamam\" diye cevâb verdi",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 5917,
			"arabicnumber": 5917,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 5918,
			"arabicnumber": 5918,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 5919,
			"arabicnumber": 5919,
			"text": "Bana Amr ibn Muhammed tahdîs etti. Bize Huşeym tahdîs etti: Bize Ebû Bişr bu hadîsi haber verdi ve \"Zülüflerimden yahut başımdan tuttu\" şeklinde söyledi",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 5920,
			"arabicnumber": 5920,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 5921,
			"arabicnumber": 5921,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 5922,
			"arabicnumber": 5922,
			"text": "Âişe (r. anha): Ben Peygamber(sallallahü aleyhi ve sellem)'i ihrama gireceği için kendi ellerimle güzel kokularla kokulandırdım. Ve yine Minâ'da (ilk ihramdan çıkıldığı sırada) Ka'be'ye tavaf etmek üzere hareket etmeden önce de kendisini güzel koku sürüp kokulandırdım, demiştir",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 5923,
			"arabicnumber": 5923,
			"text": "Âişe (r. anha): Ben Peygamber(sallallahü aleyhi ve sellem)'i hoşlandığı en güzel koku ile kokulardım. Hattâ sürdüğüm koku O'nun başında ve sakalında parlayıp şakıdığını hissedip görünceye kadar sürmeye devam ederdim, demiştir",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 5924,
			"arabicnumber": 5924,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 5925,
			"arabicnumber": 5925,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 5926,
			"arabicnumber": 5926,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 5927,
			"arabicnumber": 5927,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 5928,
			"arabicnumber": 5928,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 5929,
			"arabicnumber": 5929,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 5930,
			"arabicnumber": 5930,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 5931,
			"arabicnumber": 5931,
			"text": "İbrâhîm en-Nahaî'den; o da Alkame'den; o da Abdullah ibn Mes'ûd (radıyallahü anh)'dan tahdîs etti (ki o şöyle demiştir): Allah şu kadınlara la'net etmiştir: Döğün yapanlar, vücûdlarına döğün yaptıranlar, yüzlerinin tüylerini yolduranlar, seyrek dişli güzel görünmek için ön dişlerinin aralarını yontan sırıtkanlar, Yüce Allah'ın yarattığını değiştirenler. Bana ne var ki, ben Peygamber(sallallahü aleyhi ve sellem)'in la'net ettiği kimselere la'net etmeyeyim? Bu Allah'ın Kitâbı'nda var: \"O Rasûl size ne verdiyse onu alın, size ne yasak ettiyse ondan da sakının\"(el- Haşr: 7)",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 5932,
			"arabicnumber": 5932,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 5933,
			"arabicnumber": 5933,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 5934,
			"arabicnumber": 5934,
			"text": "Amr ibn Murre şöyle dedi: Ben el-Hasen ibn Müslim ibn Yennâk'tan işittim; o, Safiyye bintu Şeybe'den tahdîs ediyordu. O da Âişe (r.anha)'den.(Âişe şöyle demiştir:) Ensâr'dan bir kız evlendi. O kız hastalandı da bundan dolayı saçları döküldü. Ailesi onun saçlarına ekleme yapmak istediler de bunu Peygamber'e sordular. Bunun üzerine Peygamber (sallallahü aleyhi ve sellem): \"Başkasının saçından saç ekleyen ve saç ekleten kadınlara Allah la'net etti\" buyurdu",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 5935,
			"arabicnumber": 5935,
			"text": "Bize Mansûr ibnu Abdirrahmân tahdîs edip şöyle dedi: Bana annem Safiyye bintu Şeybe, Esma bintu Ebî Bekr (radıyallahü anh)'den şöyle tahdîs etti: Bir kadın Rasûlüllah'a geldi de: Ben kızımı nikâh edip evlendirdim. Sonra kızıma bir hastalık isabet etti ve bu sebeble başının saçları döküldü. Kocası beni, döküIen saçları kızın başına koymaya teşvik ediyor, binâenaleyh ben kızın başına saç ekleyeyim mi? dedi. üzerine Rasûlüllah (sallallahü aleyhi ve sellem) saç ekleyen ve saç ekletmek isteyen kadınları kötüledi",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 5936,
			"arabicnumber": 5936,
			"text": "Bize Şu'be, Hişâm ibn Urve'den; o da karısı Fâtıma bintu'l-Munzir'den tahdîs etti ki, Ebû Bekr'in kızı Esma (radıyallahü anh): Peygamber(sallallahü aleyhi ve sellem)başkasının saçından kendi başına saç ekleyen ve saç eklettiren kadınlara la'net etti, demiştir",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 5937,
			"arabicnumber": 5937,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 5938,
			"arabicnumber": 5938,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 5939,
			"arabicnumber": 5939,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 5940,
			"arabicnumber": 5940,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 5941,
			"arabicnumber": 5941,
			"text": "Bize Hişâm ibn Urve tahdîs etti ki, kendisi Fâtıma bintu'l-Munzir'den şöyle derken işitmiştir: Ben Ebû Bekr'in kızı Esmâ'dan işittim, şöyle dedi: Bir kadın Peygamber'e geldi de: Yâ Rasûlallah! Benim şu kızıma kızamık hastalığı isabet etti, bu yüzden saçları diplerinden çıkıp döküldü. Ben bunu evlendirmiş bulunuyorum. Ben şimdi bunun saçına başkasının saçından ekleme yapayım mı? dedi. üzerine Rasûlüllah(sallallahü aleyhi ve sellem): \"Allah saç ekleyene ve saç eklenmişe la'net etti\" buyurdu",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 5942,
			"arabicnumber": 5942,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 5943,
			"arabicnumber": 5943,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 5944,
			"arabicnumber": 5944,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 5945,
			"arabicnumber": 5945,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 5946,
			"arabicnumber": 5946,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 5947,
			"arabicnumber": 5947,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 5948,
			"arabicnumber": 5948,
			"text": "Abdullah ibn Mes'ûd (radıyallahü anh): Allah bedenlere döğme yapan kadınlara, döğme yaptıran kadınlara, yüz tüylerini yoldurtan kadınlara, güzellik için ön dişlerinin aralarını torpilleyip yontturan kadınlara ve Allah'ın yaratmasını değiştiren kadınlara la'net etti. Bana ne var ki, ben Rasûlüllah(sallallahü aleyhi ve sellem)'in la'net ettiği kimseye la'net etmeyeyim? Halbuki bu, Allah'ın Kitâbı'nda var! demiştir",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 5949,
			"arabicnumber": 5949,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 5950,
			"arabicnumber": 5950,
			"text": "Müslim ibn Subayh şöyle dedi: Biz Mesrûk'la beraber Yesâr ibn Numeyr'in evinde idik. Mesrûk evin sofasında birtakım timsâller (hayvan resimleri) gördü de: Ben Abdullah ibn Mes'ûd'dan işittim, şöyle dedi: Ben Peygamber(sallallahü aleyhi ve sellem)'den işittim: \"Şübhesiz kıyâmet gününde Allah katında insanların en şiddetli azâblıları suret yapanlardır\" buyuruyordu, dedi",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 5951,
			"arabicnumber": 5951,
			"text": "Abdullah ibn Omer (radıyallahü anh) şöyle haber vermiştir: Rasûlüllah (sallallahü aleyhi ve sellem): \"Şübhesiz bu suretleri yapmakta olanlar, kıyâmet gününde azab olunurlar, onlara: Haydi, yaptığınız suretlere can veriniz! denir\" buyurdu",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 5952,
			"arabicnumber": 5952,
			"text": "Bize Hişâm ibn Abdillah, Yahya ibn Kesîr'den; o da İmrân ibn Hıttân'dan tahdîs etti ki, ona da Âişe (r.anha) şöyle tahdîs etmiştir: Peygamber (sallallahü aleyhi ve sellem) kendi evinde, içinde (Hrıstiyanlar'ın) haç resimleri nakşedilmiş bulunan hiçbirşeyi bırakmaz, muhakkak onu nakzedip bozardı",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 5953,
			"arabicnumber": 5953,
			"text": "Bize Ebû Zur'a tahdîs edip şöyle dedi: Ben bir kerre Ebû Hureyre ile beraber Medine'de bir eve girdim. Ebû Hureyre bu evin üst katında bir ressamın resim ve suretler yapmakta olduğunu gördü de şöyle dedi: Ben Rasûlüllah(sallallahü aleyhi ve sellem)'tan işittim; O, Yüce Allah'ın şöyle buyurduğunu söylüyordu: \"Benim yarattığım gibi yaratmağa çalışan kişiden daha zâlim kim vardır? Haydi onlar (lezzetli ve gıda bolluğu yerinde) bir tek zerre yaratsınlar!\" sonra Ebû Hureyre bir kap su istedi de tâ koltuk altına ulaşıncaya kadar ellerini, kollarını (İsmâîlî rivayetinde: Ve dizlerine kadar iki ayaklarını) yıkadı. Zur'a dedi ki: Ben: Yâ Ebâ Hureyre! Böyle yukarılara kadar yıkama Rasûlüllah'tan işittiğin birşey midir? dedim. Hureyre: (yânı suyu koltuğa kadar ulaştırma, cennetteki) süsün sonudur, dedi",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 5954,
			"arabicnumber": 5954,
			"text": "Sufyân ibn Uyeyne tahdîs edip şöyle dedi: Ben Abdurrahmân ibnu'l-Kaasım'dan işittim. O günlerde Medine'de ondan daha faziletli kimse yoktu. O şöyle dedi: Ben babam (el-Kaasım ibn Muhammed ibn Ebî Bekr)'dan işittim, şöyle dedi: Ben Âişe (r.anha)'den işittim, şöyle diyordu: Rasûlüllah(sallallahü aleyhi ve sellem) bir seferden geldi. Ben de kendisinde birtakım timsâller bulunan bir perdemi bana âid olan bir raff üzerine örtmüştüm. Rasûlüllah onu görünce yerinden çıkarıp yırttı ve: \"Kıyâmet gününde insanların en şiddetli azâblıları, Allah'ın yaratmasına benzetmeye çalışan kimselerdir\" buyurdu. Müteakiben biz o perdeyi bir yastık yahut iki yastık yaptık, demiştir",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 5955,
			"arabicnumber": 5955,
			"text": "Buradaki senedde Âişe şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) bir seferden geldi. Ben de \"Durnûk\" denilen ve üzerinde timsâller bulunan bir perde asmıştım. Rasûlüllah bana onu yerinden çıkarmamı emretti, ben hemen onu oradan çıkardım",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 5956,
			"arabicnumber": 5956,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 5957,
			"arabicnumber": 5957,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 5958,
			"arabicnumber": 5958,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 5959,
			"arabicnumber": 5959,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 5960,
			"arabicnumber": 5960,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 5961,
			"arabicnumber": 5961,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 5962,
			"arabicnumber": 5962,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 5963,
			"arabicnumber": 5963,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 5964,
			"arabicnumber": 5964,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 5965,
			"arabicnumber": 5965,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 5966,
			"arabicnumber": 5966,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 5967,
			"arabicnumber": 5967,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 5968,
			"arabicnumber": 5968,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 5969,
			"arabicnumber": 5969,
			"text": "",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 185
			}
		}
	]
}