{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"79": "Asking Permission"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6227,
			"arabicnumber": 6227,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6228,
			"arabicnumber": 6228,
			"text": "ez-Zuhrî şöyle dedi: Bana Süleyman ibn Yesâr haber verdi. Bana Abdullah İbn Abbâs radıyallahü anhüma haber verip şöyle dedi: Rasûlüllah (sallallahü aleyhi ve sellem) nahr günü Fadl ibn Abbâs'i kendinin arka tarafına, bineğinin gerisine bindirdi. Fadl, güzel yüzlü, temiz giyimli bir genç idi. Peygamber insanların kendisine sorup öğrenmeleri için bineğini durdurdu. Bu sırada Has'am kabilesinden güzel bir kadın Rasûlüllah'tan fetva istemek üzere geldi. Fadl, bu kadına bakmağa başladı. Kadının güzelliği Fadl'ı hayran etmişti. Fadl o kadına bakarken, Peygamber ona yöneldi de eliyle arkaya döndürdü: Fadl'in çenesini tuttu ve onun yüzünü kadına bakmaktan öbür tarafa çevirdi. Kadın: Yâ Rasûlallah! Allah'ın kulları üzerinde bulunan hacc hususundaki farizası babama çok yaşlı bir ihtiyar hâlinde erişti. Deve üzerine binip düz durmağa gücü yetmiyor. Onun adına (vekâleten) benim hacc yapmaklığım onun haccı yerine geçer mi? diye sordu. \"Evet (geçer)\" buyurdu",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6229,
			"arabicnumber": 6229,
			"text": "Bize Zuheyr, Zeyd ibn Eslem'den; o da Atâ ibn Yesâr'dan; o da Ebû Saîd el-Hudrî (radıyallahü anh)'den tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem): \"Sizleri yollarda oturmaktan sakındırırım\" buyurdu. Sahâbîler: Yâ Rasûlallah! Bizim için oralarda oturmalarımızdan kurtuluş yoktur, biz yollarda oturup konuşuruz! dediler. üzerine Rasûlüllah: \"Mâdem ki sizler için oralarda oturmak zarureti vardır, öyleyse yola hakkını veriniz!\" buyurdu. Yolun hakkı nedir yâ Rasûlallah? dediler. Rasûlüllah: \"Haramdan bakışı kısmak, gelip geçenlere ezâ vermekten çekinmek, selâm alıp vermek, ma'rufu emredip münkerden nehyetmektir\" buyurdu",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6230,
			"arabicnumber": 6230,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6231,
			"arabicnumber": 6231,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6232,
			"arabicnumber": 6232,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6233,
			"arabicnumber": 6233,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6234,
			"arabicnumber": 6234,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6235,
			"arabicnumber": 6235,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6236,
			"arabicnumber": 6236,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6237,
			"arabicnumber": 6237,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6238,
			"arabicnumber": 6238,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6239,
			"arabicnumber": 6239,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6240,
			"arabicnumber": 6240,
			"text": "İbn Şihâb şöyle dedi: Bana Urvetu'bnu'z-Zubeyr haber verdi ki, Peygamber'in zevcesi Âişe (r.anha) şöyle demiştir: Omer ib-nu’l-Hattâb, Rasûlüllah(sallallahü aleyhi ve sellem)'a: Kadınlarını perde arkasına alsan!(Çünkü onlarla iyi de, kötü de konuşuyor), der dururdu. dedi ki: Rasûlüllah bunu yapmadı. Peygamber'in kadınları geceden geceye Menâsı' denilen tarafa doğru ihtiyâçlarını gidermek için dışarıya çıkarlardı. Bir kerresinde Sevde bintu Zem'a, ihtiyâcı için dışarı çıkmıştı. Şevde, uzun boylu bir kadındı. Omer ibnu'l-Hattâb mecliste otururken onu görünce: Yâ Sevde, ben seni tanıdım, demişti. bu sözü, Hicâb emrinin indirilmesini çok istemekte olduğu için söylemişti. dedi ki: Bunun üzerine Azîz ve Celîl olan Allah, Hicâb Âyeti'ni indirdi",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6241,
			"arabicnumber": 6241,
			"text": "Bize Sufyân ibn Uyeyne tahdîs etti: ez-Zuhrî: Ben bu hadîsi, senin burada bulunuşun gibi şekksiz olarak ezberledim, demiştir. Sehl ibn Sa'd (radıyallahü anh) şöyle dedi: Peygamber(sallallahü aleyhi ve sellem)'in evindeki pencerelerin birinden bir adam içeriye doğru bakmıştı. O sırada Peygamber, beraberindeki mıdrâ denilen demir bir tarakla başını (tarayıp) kaşıyordu. O kişiye: \"Eğer senin böyle mahrem yere bakar olduğunu daha önce bilseydim, muhakkak şu demir tarağı gözünün içine saplardım. İzin isteme, ancak gözün görmesinden dolayı vazife kılınmıştır!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 6242,
			"arabicnumber": 6242,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 6243,
			"arabicnumber": 6243,
			"text": "Bize Hammâd ibn Zeyd, Ubeydullah ibn Ebî Bekr'den; o da Enes ibn Mâlik (radıyallahü anh)'ten şöyle tahdîs etti: Bir adam Peygamber (sallallahü aleyhi ve sellem)'in hücrelerinin birinden içeriye uzanıp baktı. Peygamber de mışkas denilen uzunca ok demiri veya demirleriyle o adama doğru kalktı. dedi ki: Ben Peygamber'e bakıyordum, sanki Peygamber o adamı dürtmek için, onun görmez tarafından yanaşıyor gibiydi",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 6244,
			"arabicnumber": 6244,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 6245,
			"arabicnumber": 6245,
			"text": "Ebû Saîd el-Hudrî (radıyallahü anh) şöyle demiştir: Ben Ensâr'ın meclislerinden bir mecliste (oturmakta) idim. Bu sırada Ebû Mûsâ sanki birşeyden korkmuş gibi geldi de: (Omer beni çağırtmıştı.) Ben Omer'in yanına girmek için üç kerre izin istedim, bana izin verilmeyince geri döndüm. Omer bana: Seni bize gelmenden men' eden nedir? dedi. Ben: Senin yanına girmek için üç kerre izin istedim, bana izin verilmeyince geri döndüm. Çünkü Rasûlüllah(sallallahü aleyhi ve sellem):\"Sizden biriniz üç kerre izin istediği zaman kendisine izin verilmezse, hemen geri dönsün\" buyurdu, dedim. Omer: Vallahi bu rivayet ettiğin hadîs üzerine muhakkak bir beyyine getireceksin! dedi. Sizlerde bunu Peygamber'den işitmiş bir kimse var mı? dedi. ibn Ka'b: Vallahi senin beraberinde bu şehâdeti kavmin en küçüğü bile yerine getirir, dedi. kavmin en küçüğü idim. Ebû Mûsâ ile beraber kalkıp gittim ve Omer'e, Peygamber(sallallahü aleyhi ve sellem)'in bunu söylediğini haber verdim. ibnu'l-Mubârek de şöyle dedi: Bana İbn Uyeyne haber verdi. Bana Yezîd ibn Husayfe, Busr'dan tahdîs etti. Busr: Ben bu hadîsi Ebû Saîd'den işittim, demiştir",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 6246,
			"arabicnumber": 6246,
			"text": "Saîd ibn Ebî Arûbe, Katâde'den; o da Ebû Râfi'den; o da Ebû Hureyre'den söyledi ki, Peygamber(sallallahü aleyhi ve sellem): çağırılma ve isteme, onun iznidir (tekrarlamaya muhtaç olmaz)\" buyurmuştur. Mucâhid ibn Cebr haber verdi ki, Ebû Hureyre (radıyallahü anh) şöyle demiştir: Ben Rasûlüllah'ın beraberinde evine girdim. Kendisi bir kap içinde süt buldu da bana: \"Yâ Ebâ Hırrl Suffa ehline git ve onları bana çağır!\" buyurdu. Hureyre dedi ki: Ben hemen Suffa ehline gidip onları çağırdım. Hepsi geldiler, içeri girmeye izin istediler.Rasûlüllah(sallallahü aleyhi ve sellem) onlara izin verdi, onlar da içeri girdiler",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 6247,
			"arabicnumber": 6247,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 6248,
			"arabicnumber": 6248,
			"text": "Bize Şu'be, Seyyâr'dan; o da Sabit el-Bunânî'den; oda Enes ibn Mâlik (radıyallahü anh)'ten haber verdi ki, Enes bir kerresinde çocukların yanına uğrayıp onlara selâm vermiş ve:. Peygamber(sallallahü aleyhi ve sellem), çocuklara böyle selâm verirdi, demiştir",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 6249,
			"arabicnumber": 6249,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 6250,
			"arabicnumber": 6250,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 6251,
			"arabicnumber": 6251,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 6252,
			"arabicnumber": 6252,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 6253,
			"arabicnumber": 6253,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 6254,
			"arabicnumber": 6254,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 6255,
			"arabicnumber": 6255,
			"text": "Abdullah ibn Ka'b şöyle demiştir: Ben babam Ka'b ibn Mâlik'ten işittim, o Tebûk gazvesinden özürsüz geri kaldığı zamanki hâlini şöyle anlatıyordu: Ve Rasûlüllah(sallallahü aleyhi ve sellem) müslümânlan bizimle konuşmaktan nehyetmişti. Ben Rasûlüllah'a geliyor ve O'na selâm veriyordum da gönlümde benim selâmımı alıp dudaklarını hareket ettiriyor mu yahut almıyor mu diye söyleniyordum. Nihayet elli gece tamâm oldu. Sabah namazını kıldırdığı zaman Peygamber(sallallahü aleyhi ve sellem), Allah'ın bizlerin tevbelerimizi kabul ettiğini bildirdi",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 6256,
			"arabicnumber": 6256,
			"text": "Âişe (r.anha) şöyle dedi: Rasûlüllah(sallallahü aleyhi ve sellem)'ın huzuruna Yahûdîler'den bir topluluk girdi de: es-Sâmu aleyke (Ölüm üzerine olsun)! dediler. Bu çirkin sözü ben anladım da: Ölüm ve la'net sizin üzerinize olsun! diye karşılık verdim. Bunun üzerine Rasûlüllah: \"Yavaş ol yâ Âişe! Muhakkak ki, Allah herşeyde rıfk ile, yumuşaklıkla muamele etmeyi sever!\" buyurdu. de: Yâ Rasûlallah, onların dediklerini işitmedin mi? dedim, Rasûlüllah: Ben de onlara: 'O sizin üzerinize olsun' demişimdir!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 6257,
			"arabicnumber": 6257,
			"text": "Bize Mâlik, Abdullah ibn Dinar'dan; o da Abdillah ibn Omer (radıyallahü anh) 'den haber verdi ki, Rasûlüllah(sallallahü aleyhi ve sellem):\"Yahudiler size selâm verdikleri zaman, onların biri ancak 'es-Sâmu aleyke (Ölüm sana olsun)' der; sen de bunu karşılarken \"Ve aleyke (O senin üzerine de olsun)' de!\" buyurmuş",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 6258,
			"arabicnumber": 6258,
			"text": "Enes ibn Mâlik (radıyallahü anh) şöyle dedi: Peygamber(sallallahü aleyhi ve sellem):\"Kitâb ehli olanlar size selâm verdikleri zaman sizler (onlara karşılık verirken) 'Ve aleykum( Sizin üzerinize de)' deyiniz!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 6259,
			"arabicnumber": 6259,
			"text": "Alî ibn Ebî Tâlib (radıyallahü anh) şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem) beni, ez-Zubeyr ibnu'l-Avvâm'ı ve Ebû Mersed el-Ganevî'yi gönderdi. Bizim üçümüz de süvârî idik. Bizlere: \"Şimdi gidiniz, Hah bustânına kadar ilerleyiniz. Orada müşriklerden bir kadın vardır, onun yanında Hâtıb ibn Ebi Beltea'dan Mekke müşriklerine hitaben yazılmış bir sahîfe bulunmaktadır (onu, alıp bana getiriniz)\" buyurdu. dedi ki: Biz, Rasûlüllah'ın bize söylediği yerde, devesi üzerinde yol almakta olan o kadına eriştik. Alî dedi ki: Biz kadına: Beraberindeki mektûb nerede? dedik. Kadın: Benim yanımda hiçbir mektûb yoktur! dedi. onun devesini çöktürüp eşyası içinde mektubu aradık, fakat hiçbirşey bulamadık. Arkadaşlarım Zubeyr ile Ebû Mersed: Biz bir mektûb görmüyoruz, dediler. Alî dedi ki: Ben kadına: Vallahi Rasûlüllah'ın yalan söylediğini hiç bilmiş değilim. Kendi ismiyle yemîn edilmekte olan Allah'a yemîn ediyorum ki, ya mektubu muhakkak meydana çıkarırsın, yahut da ben senin elbiselerini senden soyacağım! dedim. dedi ki: Kadın benden bu ciddiyeti görünce elini izârının düğüm yerine uzattı -kendisi bir kumaşı beline fûta olarak bağlamış hâldeydi- ve oradan mektubu çıkardı. dedi ki: Biz de mektubu Rasûlüllah'a getirdik. Rasûlüllah, Hâtıb ibn Ebî Beltea'ya: \"Yâ Hâtıb! Bu yaptığın işe seni sevkeden nedir?\" buyurdu. Hâtıb da şöyle cevâb verdi: Bende Allah'a ve Rasûlü'ne mü'min olmaktan başka sıfat yoktur. Ben dînimi değiştirmedim, tebdîl de etmedim. Ben Mekkeliler'in yanında bir minnet ve ni'met elim bulunsun da Allah o ni'met sebebiyle Mekke'deki ailemi ve malımı korusun istedim. Sahâbîlerinden herbirinin orada muhakkak ailesini ve malını Allah'ın onun sebebiyle koruyacağı bir kimsesi vardır. (Benim ise koruyacak hiçbir kimsem yoktur!) dedi.' bu savunması üzerine Rasûlüllah orada bulunanlara: \"Hâtıb doğru söyledi. Artık onun hakkında hayırdan başka birşey söylemeyiniz!\" buyurdu. dedi ki: Unıer ibnu'l-Hattâb: Şu muhakkak ki, o Allah'a, Rasûlü'ne ve mü'minlere hainlik yapmıştır. Beni bırak da onun boynunu vurayım! dedi. dedi ki: Bunun üzerine Rasûlüllah: \"Yâ Omer! (Hatib Bedir gazvesinde hazır bulundu.) Sana ne bildirecek: Belki Allah Bedir'de hazır bulunanların yüksek ve samîmî mücâhedelerine muttali' olmuştu da: 'Ey Bedir mücâhidleri! Bundan böyle ne dilerseniz işleyiniz! Ben cenneti size vâcib kıldım' buyurmuştur!\" dedi. dedi ki: Bunun üzerine Omer'in iki gözü yaş akıttı da: Allah ve Rasûlü en bilendir! dedi",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 6260,
			"arabicnumber": 6260,
			"text": "ez-Zuhrî şöyle dedi: Bana Ubeydullah ibn Abdillah ibn Utbe haber verdi. Ona da İbn Abbâs haber verdi; ona da Ebû Sufyân ibn Harb şöyle haber vermiştir: Kendileri Şam'da tacirler olarak Kureyş'ten bir topluluk içinde bulunurlarken, Hıraklıyus'un adamları ona gelmişler... Hadîsi böyle zikretti. Sufyân dedi ki: Sonra Hırakl, Rasûlüllah'ın mektubunu istedi. Mektûb onun huzurunda okundu. Mektûbda şunlar vardı: \"Rahman ve Rahîm olan Allah'ın ismiyle! Allah'ın Kulu ve Elçisi Muhammed'den Rûmlar'ın büyüğü Hırakl’e! Selâm doğruya uyanlara! Amma ba'du (Sözün bundan sonrası şudur):",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 6261,
			"arabicnumber": 6261,
			"text": "el-Leys şöyle dedi: Bana Ca'fer ibn Rabîa, Abdurrahmân ibn Hürmüz'den; o da Ebû Hureyre (radıyallahü anh)'den tahdîs etti ki, Rasûlüllah(sallallahü aleyhi ve sellem), İsrâîl oğulları'ndan bir adamı zikretti ki, o bir ağaç parçasını alıp onun içini oymuş da bu oyuğa bin dînâr ile kendisinden arkadaşına yazılmış bir sahîfe koymuştur. ibn Ebî Seleme de babasından söyledi ki, o da Ebû Hureyre'den işitmiş: Peygamber(sallallahü aleyhi ve sellem):\"Bir adam bir ağaç parçasını deldi de, içine borcu olan parayı koydu ve bir de 'Fulân kimseden fulân kimseye’ diye bir sahîfe yazıp koydu” buyurdu, demiştir",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 6262,
			"arabicnumber": 6262,
			"text": "Bize Şu'be, Sa'd ibn İbrahim'den; o da Ebû Umâme ibn Sehl ibn Huneyf ten; o da Ebû Saîd (radıyallahü anh)'den şöyle tahdîs etti: Kurayza kabilesi muhâribleri Evs kabilesinin seyyidi Sa'd ibn Muâz'ın hükmüne razı olup kalelerinden indiler. Peygamber(sallallahü aleyhi ve sellem) Sa'd'a haber gönderdi. Sa'd (bir merkeb üzerinde) geldi. Yanına yaklaşınca, Peygamber Ensâr'a: \"Haydi ulunuza ayağa kalkınız -yahut: Hayırlınıza ayağa kalkınız-!\" buyurdu. Peygamber'in yanına oturdu. Peygamber, Sa'd'a: \"Şu Kurayza oğulları senin hükmüne razı olup indiler!\" buyurdu. da: Ben bunların harb edenlerinin öldürülmelerine, kadınlar ve çocuklarının da esîr edilmelerine hükmediyorum, dedi. \" (Ey Sa'd!) Yemin ederim ki, sen Melik olan Allah'ın hükmettiği ile hükmettin!\" buyurdu. Abdillah el-Buhârî: Arkadaşlarımdan biri bana evvelinden \"Senin hükmüne\" kadar bu hadîsi, senediyle Ebû'l-Velîd'den; o da Ebû Saîd'in kavlinden (yânı kendi takririnden) olmak üzere anlattı, demiştir",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 6263,
			"arabicnumber": 6263,
			"text": "Bize Hemmâm ibn Yahya tahdîs etti ki, Katâde şöyle demiştir: Ben Enes (radıyallahü anh)'e: Peygamber(sallallahü aleyhi ve sellem)'in sahâbîleri arasında musâfaha, yani el sıkışıp tokalaşmak var mıydı? diye sordum. Evet vardı, diye cevâb verdi",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 6264,
			"arabicnumber": 6264,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 6265,
			"arabicnumber": 6265,
			"text": "Hayve ibnu Şurayh el-Basrî şöyle demiştir: Bana Ebû Ukayl Zuhre ibnu Ma'bed tahdîs etti ki, kendisi dedesi Abdullah ibn Hişâm'dan şöyle dediğini işitmiştir: Bizler Peygamber(sallallahü aleyhi ve sellem)'in beraberinde idik. Peygamber, Omer ibnu'l-Hattâb'ın elini tutmuş hâldeydi",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 6266,
			"arabicnumber": 6266,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 6267,
			"arabicnumber": 6267,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 6268,
			"arabicnumber": 6268,
			"text": "Bize Zeyd ibn Vehb el-Cuhenî tahdîs edip şöyle dedi: bize Ebû Zerr Cundeb el-Gıfârî(radıyallahü anh) Rebeze'de tahdîs edip şöyle dedi: Ben bir yatsı vaktinde Peygamber(sallallahü aleyhi ve sellem) ile beraber Medine'nin dışındaki Harre denilen kara taşlık yerde yürüyordum. Bizim karşımıza Uhud Dağı çıkınca, Peygamber: \"Yâ Ebâ Zerr! Ben Uhud'un benim için altın olmasını ve bu kadar çok altından benim yanımda borç ödemek için hazırlamakta olduğum bir dînâr bulunduğu hâlde üzerimden bir gece yahut üç gece geçmesini arzu etmem, muhakkak bu altınları Allah'ın kullarına şöyle, şöyle, şöyle harcar infâk ederdim\" buyurdu . dedi ki: Ebû Zerr \"Şöyle, şöyle, şöyle\"sözlerini söylerken eliyle bize sağa, sola ve önüne doğru işaretler yapıp harcama yönlerini gösterdi. Sonra yine: \"Yâ Ebâ Zerr!\" diye seslendi. Ben: Lebbeyke ve sa'deyke yâ Rasûlallah! dedim. O: \"Malca çok zengin olanlar vardır ki, onlar sevâbca çok azdırlar. Ancak mallarını şöyle, şöyle (Allah'ın kullan yolunda) harcayanlar müstesnadırlar\" buyurdu. Rasûlüllah bana: \"Yâ Ebâ Zerr! Ben Sana dönünceye kadar sen yerinde dur, hiçbir yere ayrılma!\" buyurdu ve gidip nihayet gözümden kayboldu. sırada ben bir ses işittim de Rasûlüllah'ın bir tehlikeye uğratılmasından endîşe ettim ve O'nun yanına doğru gitmek istedim. Sonra Rasûlüllah'ın bana: \"Yerinden hiç ayrılma\"sözünü hatırladım da yerimde bekledim. Rasûlüllah gelince: Yâ Rasûlallah!Ben bir ses işittim de Sen'in bir tehlikeye uğratılmış olmandan endîşe ettim, yanına gelmek istedim, sonra bana \"Yerinden ayrılmadan bekle\" sözünü hatırladım da yerimde dikeldim, dedim. bana: \"Bu, Cibril idi. Bana geldi de: Ümmetimden her kim Allah'a hiçbirşeyi ortak kılmaksızın ölürse cennete girer! diye haber verdi\" buyurdu. Yâ Rasûlallah! O kul zina etse ve hırsızlık yapsa da mı (cennete girecek)? dedim. \"Zina etmiş olsa da, hırsızlık yapmış olsa da!\" buyurdu. Râvî el-A'meş şöyle dedi: Ben Zeyd ibn Vehb'e hitaben: Bana bu hadîsin râvîsi Ebu'd-Derdâ olduğu haberi ulaştı, dedim. üzerine Zeyd: Şehâdetle yemîn ederim ki, bu hadîsi bana Rebeze köyünde muhakkak Ebû Zerr Cundeb tahdîs etti, dedi. Ve bana Ebû Salih de Ebu'd-Derdâ'dan, bunun benzerini tahdîs etti, dedi. Şihâb da el-A'meş'ten yaptığı rivayetinde \"O altının üç gün yanımda kalmasını istemezdim\" şeklinde söylemiştir",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 6269,
			"arabicnumber": 6269,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 6270,
			"arabicnumber": 6270,
			"text": "Bize Sufyân es-Sevrî, Ubeydullah'tan; o da Nâfi'den; o da İbn Omer (radıyallahü anh) 'den tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem) bir kişinin oturduğu yerinden kaldırılmasını ve oraya başka birisinin oturmasını nehyetmiş: \"Ve lâkin yer açınız ve genişleyip genişletin\" buyurmuştur. İbn Omer de bir kişinin oturduğu yerden kaldırılıp da sonra onun yerine başkasını oturtmayı kerîh görürdü, demiştir",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 6271,
			"arabicnumber": 6271,
			"text": "Bize Ebû Mıclez tahdîs etti ki, Enes(radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) Zeyneb bintu Cahş ile evlendiği zaman, insanlar Zeyneb'in odasına girip düğün aşı yediler. Sonra da oturup konuşuyorlardı. Peygamber kalkmaya hazırlanır gibi vaziyet alarak bunların kalkıp gitmelerine işaret etti. Fakat onlar kalkmadılar. Peygamber onların kalkmadıklarını görünce, kendisi kalktı. Kendisi kalkınca oturanlardan da birkısmı kalktı. Topluluğun bakıyyesi oturup kaldı. Peygamber(diğer kadınlarının odalarına gidip hâl hatır sorduktan sonra) Zeyneb'in odasına girmek için geldiği hâlde, topluluk hâlâ'oturuyorlardı. (Peygamber tekrar Âişe'nin odasına doğru gitti.) Sonra onlar (durumu anladılar da) kalkıp gittiler. Ben onların kalkıp gittiklerini Peygamber'e haber verdim. Peygamber geldi ve Zeyneb'in odasına girdi. Ben de içeriye girmeye davrandım. Peygamber benimle kendisi arasına kapı perdesini indirdi. Yüce Allah şu âyetleri indirdi: îmân edenler, (bundan sonra)Peygamber'in evlerine yemeğe da'vet olunmaksızın, vaktine de bakmaksızın girmeyin. Fakat da'vet olunduğunuz zaman girin. Yemeği yiyince dağıtın. Söz dinlemek veya sohbet etmek için (izinsiz) girmeyin. Çünkü bu, Peygamber'e eza vermekte, O sizden utanmaktadır. Allah ise hakkı açıklamaktan çekinmez. Bir de O 'nun zevcelerinden lüzumlu birşey istediğiniz vakit perde ardından sorup isteyin. Bu, hem sizin kalbleriniz için, hem onların kalbleri için daha temizdir...\"(el-Ahzâb: 53). Abdillah el-Buhârî: Bu hadîste,Peygamber'in kalkıp dışarı çıktığı zaman oturup kalanlara izin vermediği fıkhı vardır. Ve yine bunda, Peygamber'in onların kalkmalarını isteyerek kalkmağa davranmasında, böylece ta'rîz etmenin cevazı hükmü de vardır, demiştir",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 6272,
			"arabicnumber": 6272,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 6273,
			"arabicnumber": 6273,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 6274,
			"arabicnumber": 6274,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 6275,
			"arabicnumber": 6275,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 6276,
			"arabicnumber": 6276,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 6277,
			"arabicnumber": 6277,
			"text": "Ebû Kılâbe şöyle demiştir: Bana Ebû'l-Melîh haber verip şöyle dedi: Ben senin baban Zeyd ile beraber Abdullah ibn Amr (radıyallahü anh)'ın yanına girdik. O bize şöyle tahdîs etti: Peygamber(sallallahü aleyhi ve sellem)'e benim oruç tutuşum zikredilmiş. Bu sebeble benim yanıma girdi. Ben de O'na, içi hurma ağacının lifleriyle doldurulmuş deriden bir yastık attım. Kendisi yer üzerine oturdu da o yastık benimle kendisi arasında kaldı. Rasûlüllah bana: \"Her aydan üç gün oruç tutman sana kâfi gelmiyor mu?\" buyurdu. Yâ Rasûlallah (bundan daha çoğuna gücüm yeter)! dedim. \" (Öyleyse her aydan) beş gün tut!\" buyurdu. Ben: Yâ Rasûlallah (bundan çoğuna da gücüm yeter)! dedim. \" (Her aydan) yedi gün oruç tut!\" buyurdu. Ben: Yâ Rasûlallah (daha fazlasına gücüm yeter)! dedim. \" (Her aydan) dokuz gün oruç tut!\" buyurdu. Ben: Yâ Rasûlallah (daha çoğuna gücüm yeter)! dedim. \" (Her aydan) onbir gün oruç tut!\" buyurdu. Ben: Yâ Rasûlallah (bundan çoğuna güç yetiririm)! dedim. \"Dâvûd Peygamber'in orucundan fazla oruç yoktur, o da senenin yarısıdır: Bir gün oruç tutmak, bir gün tutmamaktır\" buyurdu",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 6278,
			"arabicnumber": 6278,
			"text": "İbrâhîm en-Nahaî şöyle demiştir: Alkame Şam'a gitti, (Şam'daki) mescide varıp iki rek'at namaz kıldı da: Allah'ım! Bana burada iyi bir meclis arkadaşı ihsan eyle! diye duâ etti. Ebu'd-Derdâ'nın yanına varıp oturdu. Ebu'd-Derdâ ona: Sen kimlerdensin? diye sordu. Alkame: Küfe ahâlîsindendim (oradan geldim)! diye cevâb verdi. Ebu'd-Derdâ: Rasûlüllah'ın sırrının (gizli haberlerinin) sahibi olan ve kendisinden başkası o sırdan bilmeyen kimse, yani Huzeyfe, sizin içinizde değil mi? Yâhud Allah'ın, Rasülü'nün diliyle, yani duası üzerine şeytânın şerrinden kurtardığı kimse, yani Ammâr, sizin içinizde değil mi? YâhudRasûlüllah'ın misvak ve yastığının sahibi olup bunları taşıyan kimse, yani İbn Mes'ûd, sizin içinizde değil mi? Abdullah ibn Mes'ûd \"Ve'l-leyli izâ yağşâ ve'n-nehâri izâ tecellâ\"dan sonrasını nasıl okurdu? dedi. \"Ve'z-zekeri ve'l-ünsâ\" şeklinde okur (onun kıraatinde \"Ve mâ halaka\" yoktur), dedi. Şu Şamlılar bana \"Ve mâ halaka'z-zekerâ ve'l-ünsâ\" kırâatinde ısrar ediyorlar, en sonu beni Rasûlüllah'tan işitmiş olduğum kıraatten şübheye düşürmeye yaklaşıyorlar! Dedi",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 6279,
			"arabicnumber": 6279,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 6280,
			"arabicnumber": 6280,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 6281,
			"arabicnumber": 6281,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 6283,
			"arabicnumber": 6283,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 6284,
			"arabicnumber": 6284,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 6286,
			"arabicnumber": 6286,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 6287,
			"arabicnumber": 6287,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 6288,
			"arabicnumber": 6288,
			"text": "Bana Mâlik, Nâfi 'den; oda Abdullah ibn Omer (radıyallahü anh) 'den tahdîs etti ki, Rasûlüllah (sallallahü aleyhi ve sellem):\"Üç kişi bir arada bulundukları zaman, bunlardan ikisi, üçüncüyü bırakıp da gizli konuşmasınlar\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 6289,
			"arabicnumber": 6289,
			"text": "Süleyman ibn Tarhân et-Teymî şöyle demiştir: Ben Enes ibn MâIik (radıyallahü anh)'ten işittim, şöyle diyordu: Peygamber(sallallahü aleyhi ve sellem) bana bir sırr söyledi. Artık ben o sırrı, Peygamber'den sonra da kimseye haber vermedim. Yemîn olsun annem Ümmü Suleym de onu benden sordu da ben o sırrı ona da haber vermedim",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 6290,
			"arabicnumber": 6290,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 6291,
			"arabicnumber": 6291,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 6292,
			"arabicnumber": 6292,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 6293,
			"arabicnumber": 6293,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 6294,
			"arabicnumber": 6294,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 6295,
			"arabicnumber": 6295,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 6296,
			"arabicnumber": 6296,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 6297,
			"arabicnumber": 6297,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 6298,
			"arabicnumber": 6298,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 6299,
			"arabicnumber": 6299,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 6300,
			"arabicnumber": 6300,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 6301,
			"arabicnumber": 6301,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 6302,
			"arabicnumber": 6302,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 6303,
			"arabicnumber": 6303,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 75
			}
		}
	]
}