{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"79": "Asking Permission"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6227,
			"arabicnumber": 6227,
			"text": "Ebu Hureyre'den rivayete göre; \"Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: Allah Adem'i kendi suretinde altmış zira' boyunda yarattı. Onu yaratınca: Git de oturmakta olan şu melekler topluluğuna selam ver de sana ne şekilde cevap vereceklerini dinle. Çünkü onların sana verecekleri cevap hem senin selamın, hem zürriyetinin selamı olacaktır, buyurdu. Adem gidip: es-Selamu aleykum deyince, onlar da: es-Selamu aleyke ve rahmetullah deyip, ona fazladan \"ve rahmetullah\"ı eklediler. İşte cennete girecek olan herkes, Adem'in sureti üzere girecektir. Ama ondan sonra şimdiye kadar hilkat hep eksilip durmaktadır.\" Fethu'l-Bari Açıklaması: \"İzin isteme bölümü, selamın başlangıcı\" İsti'zan, kendisinden izin istenilen kimsenin sahip olduğu bir yere girmek için izin istemek demektir. Bed' de başlangıç demektir. Selamın ilk ortaya çıkışı anlamındadır. İzin istemekle birlikte selam başlığını kullanmış olması, selam vermeyen kimseden emin olunmayacağına işaret etmek içindir. Ebu Davud ve İbn Ebi Şeybe ceyyid bir sened ile Rib'ib Hiraş'dan şu rivayeti nakletmektedirler: \"Bana bir adamın tahdis ettiğine göre o, Nebi Sallallahu Aleyhi ve Sellem evinde iken içeri girmek için izin istedi ve: İçeri gireyim mi, dedi. Allah Resulü hizmetçisine: Bunun yanına çık, git ve ona öğret diye buyurdu. O da: es-Selamu aleykum gireyim mi de, dedi.\" Darakutn! hadisin sahih olduğunu söylemiştir. \"Allah A.dem'i kendi suretinde yarattı.\" Buna dair açıklamalar Bed'u'l-Halk da geçmiş bulunmaktadır. Buradaki \"kendi\" anlamı verilen zamirin kime ait olduğu hususunda görüş ayrılığı vardır. Adem'e ait olduğu söylenmiştir. Yani Allah, Adem'i cennetten indirilinceye ve ölünceye kadar sahip olup, devam ettiği sureti üzere yaratmıştır. Böylelikle cennette iken başka bir vasıfta olduğunu zannedenlerin bu yanılgısını yahut bulunduğu şekilde hilkatini başlatıp soyundan gelenlerin bir halden bir başka hale intikal edip geçtiği gibi, kendisinin geçmediğini zannedenlerin bu vehmini, yanılgısını önlemek istemiştir. Bunun Dehrilerin kanaat1erini reddetmek için dile getirildiği de söylenmiştir. Çünkü onlar, bir insan ancak bir nutfeden olur. insan nutfesi de ancak insandan olur ve bunun ilk başlangıcı yoktur, derler. Böylelikle A.dem'in ta baştan beri bu surette yaratılmış olduğunu beyan etmiş bulunmaktadır. Bir diğer görüşe göre, insanın tabiatın bir işi ve etkisi olarak meydana gelmiş olabileceğini iddia eden tabiatçıların görüşünün reddedilmesi için de böyle denilmiştir. Bir başka görüşe göre ise, insan kendisinin fiilini yaratır, iddiasında bulunan Kaderiyecilerin görüşlerini reddetmek için böyle demiştir. Bir başka görüşe göre bu hadisin bu rivayette belirtilmemiş bir sebebi vardır. Onun başı ise kölesini döven bir kimse ile ilgili olaydır. Nebi Sallallahu Aleyhi ve Sellem, O kimsenin kölesini dövmesini yasaklayarak ona: Şüphesiz Allah Adem'i de onun sureti üzerine yaratmıştır, demiştir. Itk (kölelerin hürriyete kavuşturulması) bölümünde buna dair açıklamalar geçmişti. Bir diğer görüşe göre zamir Allah'a gider. Bu görüşü kabul eden kimseler ise bazı rivayetlerinde varid olmuş bulunan \"Rahmanın sureti üzere\" ifadesine sarılmaktadır. Suretten kasıt ise niteliktir. Yani Allah onu ilim, hayat, semi', basar ve buna benzer kendi sıfatlarına (kısmen) sahip olarak yaratmıştır. Her ne kadar yüce Allah'ın sıfatlarına hiçbir şey benzemese dahi. \"Git onlara selam ver.\" İbn Abdilberr ilk olarak selam vermenin sünnet olduğunda iema' bulunduğunu nakletmiştir. Kadı Abdulvehhab'ın ifadelerinde ise -Iyad'ın ondan naklettiğine göre- şöyle dedigi nakl edilmiştir: İlk olarak selam vermenin sünnet ya da farz-ı kifaye olduğu hususunda görüş aynlığı yoktur. Buna göre topluluk arasından bir kişi selam verecek olursa, hepsi için yeterlidir. Iyad dedi ki: Sünnet olduğu üzerinde iema'ın bulunduğunun nakledilmesi ile birlikte farz-ı kifayedir demesi, sünnetleri uygulamanın ve onları diriltip canlandırmanın farz-ı kifaye oluşu anlamındadır. \"O\" yani onların sana cevap olarak söyleyecekleri sözler ya da verecekleri cevap demektir. \"Senin selam şeklin ve soyundan gelenlerin selam şekli olacak.\" Maksat şer'ı usule göre selamlaşmadır. Zürriyetten kasıt da onların bir kısmıdır. Bunlar da Müslüman olanlarıdır. Buhari el-Edebu'I-Müfred'de İbn Mace ve sahih olduğunu belirterek İbn Huzeyme, Aişe'den Nebie merfu olarak şu hadisi zikretmektedirler: \"Yahudilerin selam ve amin demek dolayısıyla sizi kıskandıkları kadar hiçbir şey için kıskanmış değildirler.\" İşte bu, selamın diğer ümmetler arasında sadece bu ümmete meşru olduğunun delilidir. Ebu Zerr, Müslüman oluşu ile ilgili rivayet ettiği uzunca hadisinde: \"Rasuluilah sallallahıı aıeyhi ve sellem geldi. .. \" deyip, hadisi nakletti. Hadiste de: \"Ben onu İslam selamı ilk selamlayan kişi oldum. O da: Ve aleyke ve rahmetullahi diye buyurdu\" demektedir. Hadisi Müslim rivayet etmiştir. Taberani ve eş-Şuabu'l-İman'da Beyhaki, Ebu Umame'den merfu olarak şu hadisi rivayet etmektedir: \"Allah selamı bizim ümmetimiz için bir selamlaşma, zimmetimiz altında bulunan ehl-i zimmet için bir eman kılmıştır.\" İbn Ebi Hatim de Mukatil İbn Hayyan'dan şöyle dediğini rivayet etmektedir: \"Araplar cahiliye döneminde: Hayıte mesaen ve hayıte sabahen (iyi akşamlar, iyi sabahlar)\" derlerdi. Yüce Allah bunu selam ile değiştirdi.\" \"O da es-selam u aleykum dedi.\" İbn Battal dedi ki: Yüce Allah'ın bunun nasılolacağını açık ifadelerle öğretmiş olması ihtimalolduğu gibi, onun bunu yüce Allah'ın kendisine: \"Selam ver\" demiş olmasından da anlayıp çıkartmış olması ihtimali de vardır. Derim ki: Allah'ın bunu ona ilham yoluyla bildirmiş olması ihtimali de vardır. Bunu da daha önce \"aksıranın hamdetmesi\" başlığında yer alan ıbn Hibban'ın bir başka yoldan Ebu. Hureyre'den diye merfu olarak rivayet etmiş olduğu şu hadis de desteklemektedir: \"Allah Adem'i yarattığında aksırdı. Allah da ona elhamdulillah demesini ilham ettL\" Aynı şekilde yüce Allah'ın ona selam verme şeklini ilham yoluyla öğretmiş olma ihtimali vardır. Hadis aynı zamanda bu şekilde selam vermenin, ilk selam verenin kullanması meşru olan kip olduğuna delil gösterilmiştir. Çünkü yüce Allah \"İşte o hem senin, hem senin soyundan gelecek olanların selam şeklidir\" buyurmuştur. Bu (es-selamu aleykum şekli) bir topluluğa selam vermesi halinde söz konusudur. Eğer tek bir kişiye selam verecek olursa, bunun da hükmü bir kaç başlık sonra gelecektir. Eğer baştaki lam'ı (söyleyişte es'i) zikretmeyip \"selamun aleykum\" diyecek olursa, bu da yeterlidir. Çünkü yüce Allah şöyle buyurmaktadır \"Melekler de her kapıdan onların yanına girip: Sabrettiğiniz şeylere karşılık selamun aleykum derler. \"(Ra'd, 23); \"De ki: Selamun aleykum, Rabbiniz kendi üzerine rahmeti yazdı. \"(En'am,54); \"Alemler arasında Nuh'a selam olsun.\"(Saffat, 79) ve benzeri buyruklar. Bununla birlikte lam ile (es-selamu şeklinde) söylemek daha uygundur. Çünkü bu hem işin önemini ifade eder, hem de çokluğu anlatır. İyad dedi ki: İlk selam verince aleyke's-selamu demek mekruhtur. Nevevı el-Ezkar'da: İlk selam veren kişi \"ve aleykumu's-selam\" diyecek olursa bu selam olmaz ve ona cevap verilmeyi de hak etmez. Namazdan çıkış halinde bu selamın yeterli olmayışı gibi yeterli olmama ihtimali de vardır, selam sayılmayarak alınmayı hak etmemesi ihtimali de vardır. Çünkü biz Ebu. Davud'un ve sahih olduğunu belirterek Tirmizi'nin Sünen'lerinde ve başka eserlerde sahih senedlerle Ebu. Curey'den şöyle dediğini rivayet etmiş bulunuyoruz: \"RasCılullah Sallallahu Aleyhi ve Sellem'in huzuruna varıp: Aleyke's-selamu ya Resulullah dedim. Allah Resuıü: Aleyke's-selam deme' Çünkü aleyke's-selam ölülere verilen selam şeklidir, buyurdu.\" Melekler ona fazladan \"ve rahmetullahi\" dediler. Bu ibarede de ilk selam verenin lafızlarına diğer lafızları da ekleyerek selam almanın meşruiyeti anlaşılmaktadır. Böyle bir selam almak da ittifakla müstehaptır. Çünkü yüce Allah'ın şu buyruğunda böyle bir selamlaşma dile getirilmiştir: \"Bir selamla selamlandığınızda siz de ondan daha güzeli ile selamı alın. Yahut aynısıyla karşılık verin. \"(Nisa, 86) Eğer selam veren kişi \"ve rahmetullah\" fazlalığını da ekleyecek olursa, onun söylediklerine \"ve berekatuh\" lafzının da eklenmesi müstehaptır. Selam veren kişi \"ve berekatuh\"u da ekleyerek selam verecek olursa fazla bir lafız ekleyerek selamı almak meşru olur mu? Aynı şekilde selamı veren kişi \"ve berekatuh\" lafzına başka bir şeyler eklemesi meşru olur mu? Malik el-Muvatta'da İbn Abbas'tan şöyle dediğini rivayet etmektedir: \"Selam son olarak bereket ile bitirilir.\" Bununla birlikte İbn Ömer'den bunun caiz olduğu rivayet edilmiştir. Buhari el-Edebu'l-Müfred'de, Amr İbn Şuayb yoluyla İbn Ömer'in azadlısı Salim'den şöyle dediğini rivayet etmektedir: \"İbn Ömer selam aldı mı fazladan lafız ekleyerek karşılık verirdi. Bir gün ona giderek: es-Selamu aleykum dedim. O da es-Selamu aleykum ve rahmetullahi dedi. Sonra yine yanına gittim. Buna bir de \"ve berekatuh\" lafzını ekledim. O da ve tayyibu salavatuh lafzını ilave etti.\" İbn Dakiki'l-'Id, Ebu'l-Velid İbn Rüşd'den şunu nakletmektedir: Yüce Allah'ın: \"Ondan daha güzeli ile selamı alın\" buyruğundan eğer selam veren kişi selamı \"ve berekatuh\"e kadar söyleyecek olursa, fazlasını eklemek caizdir. İlim adamları da selamı almanın kifaye yoluyla vacip olduğunu ittifakla kabul etmişlerdir. Ebu Yusuf'tan: Her kişinin teker teker selamı alması icap eder, diye nakledilmiştir",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6228,
			"arabicnumber": 6228,
			"text": "Abdullah İbn Abbas r.a.'dan dedi ki: \"Rasulullah Sallallahu Aleyhi ve Sellem Nahr (kurban bayramının birinci) günü el-fadl İbn Abbas r.a.'ı bineğinin arka tarafında kendi arkasına bindirmişti. el-fadl güzel, parlak yüzlü birisi idi. Nebi Sallallahu Aleyhi ve Sellem de durup insanlara fetva vermeye başladı. Has'amlılardan da güzel yüzlü bir kadın gelip Rasulullah Sallallahu Aleyhi ve Sellem'e fetva sordu. el-radı ona bakmaya başladı. Kadının güzelliği de hoşuna gitmişti. Nebi Sallallahu Aleyhi ve Sellem dönüp baktığında eı-radı da o kadına bakıyordu. Elini arkasına götürerek el-Fadl'ın çenesini yakalayıp yüzünü kadına bakmasın diye başka tarafa çevirdi. Kadın: Ey Allah'ın Rasulü' Allah'ın kulları üzerine haccı farz kıldığı sıra benim babarıı binek üzerinde doğrulamayacak kadar yaşlı bir ihtiyar idi. Acaba benim onun yerine hac etmem olur mu, diye sordu. Rasulullah sallallahu aleyhi ve sellem: Evet, buyurdu",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6229,
			"arabicnumber": 6229,
			"text": "Ebu Said el-Hudri r.a.'dan rivayete göre; \"Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: Yollarda oturmaktan sakınınız. Ashab: Ey Allah'ın Resuıü, bizim için oralarda oturmaktan başka çare yok. Biz oralarda oturup konuşuyoruz, dediler. Bu sefer Allah Rasulü: Madem sizin için oralarda oturmanın kaçınılmaz olduğunu söylüyorsunuz, o halde yolun hakkını veriniz, buyurdu. Ashab: Yolun hakkı nedir, ey Allah'ın Rasulü, deyince, o: Gözü harama bakmaktan sakınmak, yolda rahatsızlık verecek şeyleri kaldırmak, verilen selamı almak, marufu emredip münkerden alıkoymaktır, buyurdu.\" Fethu'l-Bari Açıklaması: \"Yüce Allah'ın: \"Ey iman edenler! Kendi evlerinizden başka evlere izin almadan ve o ev halkına selam vermeden girmeyin. Bu sizin için daha hayırlıdır, olur ki öğüt alırsınız ... Allah sizin ne yaptığınızı çok iyi bilir. \"(Nur, (27-28) buyruğu\" Bu buyrukta yer alan: \"İzin alıncaya kadar\" buyruğunda geçen \"el-isti'nas\" cumhura göre öksürmek ve benzeri bir yolla izin istemek demektir. Beyhaki dedi ki: Testa'nisu, içeriye basiret üzere girip ev sahibinin gelenlerin görmesinden hoşlanmayacağı bir durum ile karşılaşılmaması için girişin basiret üzere olmasını sağlamak için giresiniz diye, anlamındadır. \"Acem kadınları, göğüslerini ve başlarını açarlar deyince, el-Hasen: Sen de onlardan gözlerini başka tarafa çevir. Çünkü yüce Allah: \"mu'miniere söyle ki: Gözlerini (harama bakmaktan) sakınsınlar. Mahrem yerlerini de korusunlar.\"(Nur, 30) diye buyurmaktadır, dedi. Katade de: Kendilerine helal olmayan şeylere bakmaktan sakınsınlar, diye açıklamıştır.\" Bunun bu başlıkta zikredilmesindeki incelik, izin istemenin meşru oluşunun esas itibariyle izinsiz girilmesi halinde ev sahibinin görülmesini istemediği şeylerin görülmesinden sakınmak için istendiğine işaret etmektir. Sakınılması istenen şeylerin en büyüğü ise, kişiye yabancı olan kadınlara bakmaktır. \"Nebi Sallallahu Aleyhi ve Sellem el-Fadl'ı arkasına bindirmişti.\" EI-Fadl, Abbas r.a.'ın oğludur. Buna dair açıklamalar daha önce Hac bölümünde (1855 nolu hadiste) geçmiş bulunmaktadır. İbn Battal dedi ki: Hadis-i şerifte fitne korkusu ile gözün harama bakmaktan sakınılması emri yer almaktadır. Yine bu hadisten anlaşıldığına göre Ademoğlunun beşer tabiatında bulunan isteklere karşı durmak, onun yapısında yer alan kadınlara meyletmek ve onları beğenmek hali karşısındaki zayıflığı da anlaşılmaktadır. \"Ashab: Ey Allah'ın RasCılü oralarda oturmak bizim için kaçınılmaz bir şeydir. Biz orada konuşuyoruz, dediler.\" lyad dedi ki: Bunda Nebi Sallallahu Aleyhi ve Sellem'in onlara oturmayın şeklindeki emrinin vücub ifade etmediğine ve bu emrin sadece bir teşvik ve daha uygun olanı göstermek amacıyla verilmiş olduğuna delil vardır. Çünkü bu emirden vücub anlamını çıkarmış olsalardı, ona bu şekilde karşılık vermezlerdi",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6230,
			"arabicnumber": 6230,
			"text": "Abdullah (İbn Mes'ud)'dan dedi ki; \"Biz Nebi Sallallahu Aleyhi ve Sellem ile birlikte namaz kıldığımızda es-selamu alallahi Ka'ble ibadih, es-selamu ala Cibrll, es-selamu ala Mikail, es-selamu ala fulanin ve fulan: (Kullarından önce Allah'a selam, Cibri\\'e selam, Mikail'e selam, filana ve filana selam olsun) derdik Nebi Sallallahu Aleyhi ve Sellem namazı bitirince, bize yüzünü dönerek: Şüphesiz es-selam Allah'tır. Bu sebeple sizden herhangi bir kimse namazda oturdu mu; et-Tahiyyatu lillahi ve's-salavatu ve't-tayyibatu es-selamu aleyke eyyuhe'n-nebiyyu ve rahmetullahi ve berekatuhu. es-selamu aleyna ve ala ibadillahi's-salihin: (Bütün selamlar, dualar, hoş ve temiz dilekler yalnız Allah'ındır. Selam sana ey Nebii Allah'ın rahmeti ve bereketleri de. Selam bize ve Allah'ın salih kullarına olsun), desin. Çünkü bir kimse bunları söyledi mi gökte ve yerde bulunan salih her bir kula da selam vermiş olur. (Devamla:) Eşhedu en la ilahe illallah ve eşhedu enne Muhammeden abduhu ve Rasuluh: (Şehadet ederim ki Allah'tan başka hiçbir ilah yoktur ve yine şehadet ederim ki Muhammed onun kulu ve Rasulüdür), desin. Bundan sonra da hayır gördüğü sözlerden dilediğini söyler.\" Fethu'l-Bari Açıklaması: \"es-Selam yüce Allah'ın isimlerinden bir isimdir.\" es-Selam eksikliklerden uzak, kurtulmuş olan demektir. Kullarına selamet ve esenlik veren, gerçek dostlarına selam veren diye de açıklanmıştır. es-Selam'ın anlamı hakkında görüş ayrılığı vardır. lyad'ın naklettiğine göre Allah'ın ismi olarak, Allah'ın koruması ve koruyuculuğu senin üzerinde olsun demektir. Tıpkı Allah seninle beraber, Allah seninle birlikte olsun, denilmesine benzer. Bir başka görüşe göre: Şüphesiz Allah senin neler yaptığını görendir, demektir. Anlamının: Allah'ın adı ameller üzerine, amellerde çeşitli hayırların anlamlarının bulunup onları ifsad edecek arızı hallerin de söz konusu olmaması ümit edilerek zikredilir. Bir diğer açıklamaya göre bunun anlamı yüce Allah'ın: \"Yemin ashabından sana selam olsun.\"(Vakıa, 91) buyruğunda olduğu gibidir. Sanki Müslüman selam verdiği kimseye, kendisinden yana esenlikte olacağını ve kendisinden ona korkulacak bir şeyin gelmeyeceğini bildirmiş gibi olur. İbn Dakiki'l-'Id de Şerhu'l-İlmam adlı eserinde şunları söylemektedir: Selam, çeşitli anlamları ifade etmek için kullanılır. Esenlik, selam vermek, yüce Allah'ın isimlerinden bir isim olması gibi. Selam, bazen sadece selam vermek anlamında, bazen katıksız esenlik dileği anlamında, bazen de her iki anlama da gelebilecek şekilde kullanılabilir. Yüce Allah: \"Size selam verene dünya hayatının menfaatini arayarak sen mu'mindeğilsin, demeyin.\"(Nisa, 94) buyruğunda olduğu gibi. Bu buyrukta hem selam vermek, hem de esenlik dilemek anlamına gelme ihtimali vardır. Yüce Allah'ın: \" ... ve istedikleri her şey vardır. Çok merhametli bir Rab den de selam denir. \"(Yasin, 57-58) \"Bir selamla selamlandığınızda siz de ondan daha güzeli ile selamı alın yahut aynısıyla karşılık verin.\"(Nisa, 86) buyruğu.\" Bu ayetin bu başlıkta zikredilmesinin sebebi, birinci başlıkta işaret olunan hadislerin delalet ettiği üzere genelolan selam verme emrinin \"es-selam\" özel lafzı ile verileceğine işaret etmektir ilim adamları bu hususta ittifak etmişlerdir Ancak ibnu't-Tın'in, ibn Huveyzimendad'dan, onun Malik'ten naklettiği müstesnadır. Buna göre ayet-i kerime'de \"tahiyye (selam verme)\"den maksat hediyedir Yine ilim adamlarının ittifak ettiklerine göre selam lafzı ile selam veren kimsenin selamı ancak, yine es-selamu lafzı ile alınır Selamın alınışı için, sana da hayırlı sabahlar, mutlu sabahlar ve buna benzer cevaplar vermek yeterli olmaz. Selam verirken \"es-selamu\" lafzından başkasını kullanan kimseye cevap vererek selamını almak gerekip gerekmediği hususunda görüş ayrılığı vardır Selamı almanın vacip olmasını gerektirecek asgari miktar, selamı verenin selam verdiği kimseye sesini işittirmesidir işte o vakit selamının alınmasını hak eder. işaretle selamı almak yeterli değildir. Hatta bunun yapılmamasına dair emir de varid olmuştur. Bu da Nesai'nin ceyyid bir sened ile Cabir'den diye naklettiği şu merfu hadiste sözkonusudur: \"Yahuoilerin selamlaşmaları gibi selam vermeyiniz. Çünkü onların selamlaşmaları başlarla, ellerle ve işaret iledir.\" Nevevı der ki: Esma bint Yezid'in rivayet ettiği şu hadis bu görüşü reddetmez: \"Nebi Sallallahu Aleyhi ve Sellem mescidden geçerken bir grup kadın da oturuyor idi. Selam vermek üzere eli ile işaret buyurdu.\" Bu hadis, Nebi efendimizin lafız (sözlü selamı) ve işareti bir arada yaptığı şeklinde yorumlanır. Nitekim Ebu Davud da aynı şekilde Esma bint Yezid'den: \"Bize selam verdi\" lafzı ile de rivayet etmiştir. --- Nevevı'nin açıklamaları burada sona erınektedir. --- işaret ile selam vermenin yasaklanışı ise, fiilen ve şer'an lafız ile selam verme gücü yeten kimseler hakkında özeldir. Aksi takdirde namaz kılan, uzakta bulunan ve dilsiz kimsenin halinde olduğu gibi, selamı lafız ile cevap vermek suretiyle alma imkanına sahip olamayan kimseler için işaretle selamı almak meşrudur. Aynı şekilde sağır kimseye selam vermek de böyledir. Eğer Arapça olmayan bir lafızia selam verilecek olursa, cevabı hak eder mj? Bu hususta ilim adamlarının üç görüşü vardır. Üçüncüsü Arapça güzelce selam verebileninkini almak vaciptir, şeklindedir. Mektupla yazılan ve elçi ile gönderilen selama da cevap vermek gerekir. Küçük çocuk, ergenlik yaşındaki birisine selam verecek olursa selamını alması icap eder. Aralarında küçük çocuğun bulunduğu bir topluluğa selam verecek olup çocuk da selamı alacak. olursa, bir görüşe göre aldığı selam, hepsi adına yeterlidir",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6231,
			"arabicnumber": 6231,
			"text": "Ebu Hureyre'den rivayete göre; \"Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: Küçük büyüğe, yürüyen oturana, az sayıdakiler çok sayıda olanlara selam verir. \" Hadis 6232, 6233 ve 6234 numara ile geçiyor. Fethu'l-Bari Açıklaması: \"Az sayıda olanların çok sayıdakilere selam vermesi.\" Bu ikiye ve daha fazlasına nispetle biri, üçe ve daha fazlasına nispetle ikiyi ve bundan yukarıdaki sayıları kapsayan nisbi (göreceli) bir durumdur. el-Maverdi dedi ki: Bir kişi bir meclise girse, eğer hepsini kapsayacak tek bir selam kadar az iseler ve o da bir selam verse yeterlidir. Eğer artırarak bazılarına özellikle selam verecek olursa, bunda bir sakınca yoktur. Onlardan birisinin de selamı alması yeterlidir. Daha fazla sayıda kimselerin selamı almalarında da bir sakınca yoktur",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6232,
			"arabicnumber": 6232,
			"text": "Ebu Hureyre'den dedi ki: \"Rasulullah Sallallahu Aleyhi ve Sellem: Binekli yürüyene, yürüyen oturana, az sayıda olanlar çok sayıda olanlara selam verirler, diye buyurdu",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6233,
			"arabicnumber": 6233,
			"text": "Ebu Hureyre r.a.'dan rivayete göre; \"Rasuluilah Sallallahu Aleyhi ve Sellem şöyle buyurdu: Binekli yürüyene, yürüyen oturana, az sayıdaki kimseler çok olanlara selam verirler",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6234,
			"arabicnumber": 6234,
			"text": "(Ebu Hureyre'den dedi ki: \"Rasuluilah Sallallahu Aleyhi ve Sellem şöyle buyurdu: Küçük büyüğe, yürüyen oturaI)a, az sayıdaki kimse de çok sayıdaki kimselere selam verir.\" Fethu'l-Bari Açıklaması: \"Yürüyen oturana\" el-Edebu'l-Müfred'de ve sahih olduğunu belirterek Tirmizi'de,Nesai'de, İbn Hibban'ın Sahih'inde hadis: \"Ata binmiş olan yürüyene, yürüyen oturana selam verir\" lafzı ile zikredilmiştir. Eğer ayakta duran kimse hareketsiz duran diye yorumlanırsa, oturan, duran, yaslanmış yahut yatmış bulunan ifadesinden daha genelolur. Şayet bu şekil binene göre düşünülecek olursa, şekillerde de farklılık çokluk sözkonusu olur. Geriye nass ile belirtilmemiş tek bir şekil kalır. O da: İkisi de binek üzerinde bulunması yahut yürümesi halidir. e1Mazerı bu hususu söz konusu ederek şunları söylemektedir: Dinde daha alt mertebede bulunan bir kimse, -fazileti sebebiyle- daha üst mertebede olana selam verir. Çünkü din itibariyle fazilet ve üstünlük, şer'an teşvik edilmiş bir şeydir. \"Sayıca az olanlar, çok olanlara selam verirler.\" Buna dair açıklama daha önce geçmiş bulunmaktadır, ama durum aksi olup çok sayıda bir kalabalık, az sayıda bir kalabalığın yanından geçerse, aynı şekilde yaşça küçük olan büyük olanın yanından geçerse selamlaşmanın nasılolacağı hususunda açık bir ifade görmedim. Nevevı geçip gitmeyi nazar-ı itibara alarak şunları söylemektedir: Gelen ister küçük ister büyük, ister az ister çok olsun önce o selam verir. elMühelleb'in: Yürüyen kimse hüküm itibariyle dışarıdan içeri giren kimse gibidir, sözü de buna uygundur",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6235,
			"arabicnumber": 6235,
			"text": "Bera’ İbn Azib r.a.'dan dedi ki: \"Rasulullah Sallallahu Aleyhi ve Sellem bize şu yedi şeyi emretti: Hastayı ziyaret etmeyi, cenazenin peşindeng;tmeyi, aksırıp elhamdulillah diyene yerhamukellah demeyi, zayıf kimseye yardımcı olmayı, mazluma yardım etmeyi, selamı yaygınlaştırmayı, Allah adına yemin edenin andıyla istediği şeyi yerine getirmeyi. Diğer taraftan gümüş kapta içmeyi nehyetti. Altın yüzük takınmayı, hayvanların eğerleri üzerine ipekten yastık ve benzeri şeyler koyarak binmeyi, harir, dibac, kass! ve istebrak denilen ipek elbiseleri giyinmeyi nehy etti.\" Fethu'l-Bari Açıklaması: \"Selamı yaygınlaştırmak\" İfşa (yaygınlaştırmak), açığa çıkarmak demektir. Maksat, selam sünnetini canlandırmaları için selamın yayılmasıdır. Buhari elEdebu'l-Müfred'de sahih bir sened ile İbn Ömer'den: \"Selam verdiğin takdirde selamını işittir. Çünkü selam Allah'tan bir tahiyye (esenlik dileği)dir\" demiştir. Nevevi dedi ki: Selam vermenin asgari seviyesi, kendisine selam verilenin duyacağı şekilde yüksek sesle selam vermektir. Eğer selam verdiği kimseye sesini işittirmeyecek olursa sünneti yerine getirmiş olmaz. Selamını işittiğinden emin olacak kadar sesini yükseltmesi de müstehaptır. Ancak uyanık ve uyuyan kimselerin bir arada bulunduğu bir yere girmesi halinde yüksek sesle selam vermek, bundan istisna edilmiştir. Bu gibi durumda sünnet Müslim'in Sahih'inde el-Mikdad'dan sabit olan şu rivayetine uygun hareket etmektir: el-Mikdad dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem geceleyin gelir ve uyuyan birisini uyandırmayacak, uyanık olan kimseye de işittirecek şekilde bir selam verirdi.\" Nevev! de el-Mütevelli'den şöyle dediğini nakletmektedir: Bir topluluk ile karşılaştığı takdirde, onların bir bölümüne özelolarak selam vermesi mekruhtur. Çünkü selamın meşru kılınışından kasıt, ülfetin meydana gelmesidir. Selamın bir gruba özelleştirilmesi, dışarıda tutulan kimselerin uzaklaşmalarını gerektirir. \"Nebi Sallallahu Aleyhi ve Sellem bize şu yedi hususu emretti: Hastayı ziyaret etmeyi ... \" Libas (giyim) bölümünde Buhari'nin bu hadisi değişik yerlerde zikretmiş olmakla birlikte bunu çoğunluğunda bütünüyle kaydetmemiş olduğunu söylemiş idik. Burası emrolunan yedi hususun ve yasak kılınan yedi hususun zikredilmiş olduğu yerlerden birisidir. Burada bu hadisin zikredilmesinden kasıt ise, selamın yaygınlaştırılması ile ilgili kısımdır. Hasta ziyareti ile ilgili hususa dair açıklamalar Tıb bölümünde, (Tıb'da değil de merda'da 5650 nolu hadiste) cenazelerin arkasından gitmek aynı bölümde, mazluma yardımcı olmak ile ilgili açıklamalar Mezalim bölümünde, (2445.hadiste) aksırana yerhamukellah deme ile ilgili açıklamalar Edeb bölümünün son taraf1arında (6222.hadiste) geçmiş bulunmaktadır. And veren kimsenin yeminini yerine getirme ile ilgili açıklamalar da el-Eyman ve'n-Nuzur (yeminler ve adaklar) bölümünde gelecektir. Yasak kılınan hususlar ile ilgili açıklamalar da Eşribe (içecekler) bölümünde (5635.hadiste) ve Libas (giyim) bölümünde geçmiş bulunmaktadır. Burada sözü geçen zayıf kimseye yardımcı olmanın hükmü de Mezalim bölümünde geçmiş bulunmaktadır. el-Kermani dedi ki: Zayıf kimseye yardımcı olmak, davet edenin davetine icabet etmenin kapsamı içerisindedir. Çünkü davet eden bir kimse zayıf olabilir, onun davetini kabul edip icabet etmek de ona yardım etmek şeklinde olabilir. \"Ve selamı yaygınlaştırmayı\" Müslim, Ebu Hureyre'den şu merfu hadisi zikretmektedir: \"Dikkat edin' Ben size kendisi vasıtasıyla birbirinizi seveceğiniz şeyi göstereyim mi? Aranızda selamı yaygınlaştırınız.\" İbnu'l-Arabi dedi ki: Hadisten anlaşıldığına göre selamı yaygınlaştırmanın faydaları arasında selamlaşanlar arasında sevginin husule gelmesi de vardır. Bunun böyle olmasının sebebi, dinin şer'ı hükümlerinin uygulanması, kafirlerin de zelil kılınması için, karşılıklı yardımlaşmak suretiyle faydanın genel bir hal alması için kelimeye alışkanlığın kazanılması dolayısıyladır. Bu kelime işitildiği zaman onu iyice anlayan kimsenin kalbine ulaşır, kalpteki nefret uzaklaşarak onu söyleyen e doğru sevgiyle yönelinilir. Abdullah İbn Selam'dan Nebie ref ederek: \"Yemek yediriniz, selamı yaygınlaştırınız\" hadisi rivayet edilmiştir. Bu hadiste: \"Selametle cennete girersiniz\" ifadeleri de yer almaktadır. Bunu Buhari el-Edebu'I-Müfred'de rivayet etmiştir. Selamın yaygınlaştırılması ile ilgili hadislerden birisi de Nesai'nin, Ebu Hureyre'den Nebie merfu olarak rivayet ettiği şu hadistir: \"Sizden biriniz oturduğu takdirde selam versin, kalktığı vakit de selam versin. Çünkü ilk defa selam verilmesi, ayrılırken verilen selamdan daha ileri bir hak değildir.\" Selamın yaygınlaştırılmasının emredilmesi, . gizlice selam vermenin yeterli olmadığına delil gösterilmiştir. Aksine selamın açıkça verilmesi gerekir. Bunun asgari seviyesi ise selamın verilirken de, alınırken de işittirilmesidir. EI ve benzeri işaret de yeterli değildir. Nesai ceyyid bir senedie Cabir'den merfu olarak şu hadisi zikretmektedir: \"Yahudilerin selam verdiği gibi selam vermeyiniz. Çünkü onların selam vermeleri başlar ve eller iledir.\" Namaz hali bundan istisna edilir. Çünkü Nebi Sallallahu Aleyhi ve Sellem'in namaz kılarken işaret ile selamı aldığına dair senedi ceyyid hadisler varid olmuştur. Bunlardan birisi Ebu Said'in rivayet ettiği: \"Bir adam Nebi Sallallahu Aleyhi ve Sellem'e namaz kılarken selam verdi, işaret ile onun selamını aldı\" hadisidir. İbn Dakiki'l-'Id der ki: Kendisine selam verilmesinin terk edilmesi emrediImiş bulunan kimselere -kafir gibi- selam vermek, müstehap hükmünden istisna edilir. Derim ki: Buna da daha önce zikretmiş olduğumuz: \"Yaptığınız takdirde birbirinizi seveceğiniz bir işi size göstereyim mi?\" hadisi delil teşkil etmektedir. Müslümanın ise kafire düşmanlık etmekle emrolunduğundan ötürü onu sevmeyi, muhabbet beslemeyi gerektirecek işleri yapması meşru olmaz. Fasık kimseye, çocuğa selam vermenin ve erkeğin kadına, kadının da erkeğe selam vermesinin meşruiyeti, bir mecliste kafir ve Müslüman bir arada bulunuyorsa Müslümanın hakkına riayet etmek üzere selam vermenin meşru olup olmadığı yahutta kafir dolayısıyla selam verme yükümlülüğünün düşüp düşmeyeceği hususunda da görüş ayrılığı vardır. Buhari bütün bunlar hakkında başlık açmış bulunmaktadır. Nevevı der ki: Yemek, içmek, cima etmekle meşgulolan yahut helada hamamda bulunan, uyuyan uyuklayan, namaz kılan, ezan okuyan bir kimsenin sözü geçen bu hali devam ettiği sürece ona ilk olarak selam verme genel hükmünden müstesnadırlar (yani bu halde olanlara selam verilmez). Nevevı dedi ki: Cuma hutbesi esnasında selam vermeye gelince, dinleme emri dolayısıyla mekruhtur. Eğer hutbe sırasında selam verecek olursa, hutbeyi dinlemek vaciptir diyenlere göre, selamın alınması icap etmez. Sünnet olduğunu kabul edenlere göre ise selamı alır. Her iki durumda da bir kişiden fazlasının selamı almaması gerekir. Kur'an okumakla meşgulolana gelince, el-Vahidi dedi ki: Daha uygun olanı ona selam vermemektir. Eğer ona selam verilecek olursa, Kur'an okuyanın işaret ile selamı alması yeterlidir. Daha sonra da şunları söylemektedir: Dua ile meşgulolup kendisini tam anlamıyla duaya vermiş, kalbini huzur ile bir araya getirmiş kimse için de, Kurlan okuyan gibidir, denilebilir. Bana göre daha kuwetli görülen, ona selam vermenin mekruh olacağıdır. Çünkü bundan dolayı rahatsız edilmiş olur ve bu iş ona yemek yeme meşakkatinden daha ağır gelir. Selamı yaygınlaştırma genel emrinin kapsamına içinde kimsenin bulunmadığı bir mekana giren kişinin kendisine selam vermesi de girer. Çünkü yüce Allah: liNe zaman ki bu evlere girerseniz, kendinize Allah tarafından mübarek ve pek güzel bir selam olmak üzere selam veriniz.\"(Nur, 61) diye buyurmaktadır. Buhari de el-Edebull-Müfredlde, İbn Ebi Şeybe de hasen bir sened ile İbn ÖmerIden şu rivayeti nakletmektedirler: \"Evde herhangi bir kimse bulunmuyor ise es-selamu aleyna ve ala ibadillahissalihın: Selam bize ve Allah'ın salih kullarına olsun, demesi müstehaptır.\" Kendisine selam verdiği takdirde selamı almayacağını zannettiği bir kimsenin yanından geçen bir kimsenin de ona selam vermesi ve bu zan dolayısıyla selam vermekten vazgeçmemesi de meşrudur. Çünkü bu zannında hata ediyor olabilir. (Nevevi) dedi ki: Böyle bir durum ile karşı karşıya kalan kimsenin bu kişiye nazik ve yumuşak ifadelerle selamı almanın vacip olduğunu söylemesi ve bundan dolayı farzı yerine getirmiş olmak için de selam vermesi gerektiğini hatırlatması gerekir. Eğer selam vermemeyi sürdürecek olursa bundan dolayı hakkını helal etmesi de gerekir. Çünkü bu bir kul hakkıdır",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6236,
			"arabicnumber": 6236,
			"text": "Abdullah İbn Amr'dan rivayete göre; \"Bir adam Nebi Sallallahu Aleyhi ve Sellem'e: \"İslamın hangisi daha hayırlıdır, diye sordu. Allah Rasulü: Yemek yedirmen, tanıdığın ve tanımadığın herkese selam vermendir, buyurdu",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6237,
			"arabicnumber": 6237,
			"text": "Ebu Eyyub r.a.'dan rivayete göre; \"Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: Bir Müslümanın kardeşinden üç günden fazla küs durarak, karşılaştıklarında birinin yüzünü bir tarafa, diğerinin yüzünü öbür tarafa çevirmesi helal değildir. O ikisinden hayırlı olanları önce selam verenleridir.\" Fethu'l-Bari Açıklaması: \"Tanıdığına tanımadığına selam vermek.\" Yani Müslümanın tanıdığı kimseye de, tanımadığı kimseye de selam vermesi. Bu da tanımadıklarını dışarıda tutarak yalnızca tanıdıklarına özellikle selam vermemesi gerektiği anlamına gelir. Başlığın baş tarafı, Buharilnin el-Edebu'I-Müfred'de sahih bir senedie İbn Mesud'dan rivayet ettiği bir hadisin lafzıdır. Buna göre: \"Bir adamın yanından geçti. Adam ona es-selamu aleyke ey Ebu Abdurrahman (ibn-i Mes'ud) dedi. O da adamın selamını aldıktan sonra: Gerçek şu ki, insanlar üzerinden öyle bir zaman gelecek ki o zamanda selam sadece tanınan kimselere verilecektir, dedi.\" (Hadisi Abdullah İbn Amr'dan rivayet eden) \"Ebu'l-Hayr ... \" Bu hadise dair açıklamalar İman bölümünün baş taraflarında geçmiş bulunmaktadır. Nevevı der ki: Hadisteki: \"Tanıdığın ve tanımadığın herkese selam verme ndir\" buyruğunun anlamı: Karşılaştığın herkese selam vererek özellikle tanıdığın kimselere selam vermekle yetinmemektir. İşte bu, amelin Allah için ihlasla yapılmasını sağlar ve alçak gönüllü olup, bu ümmetin şiarı olan selamı yaygınlaştırmayı gerçekleştirir. Derim ki: Bu hadisten çıkartılan daha başka sonuçlar da vardır: Müslüman tanımadığı kimselere selam vermeyi terk edecek olursa daha sonra onun tanıdığı kimselerden olduğunun ortaya çıkması ihtimali vardır ve bu, o tanıdığının kendisinden uzaklaşmasına da sebep olabilir. (Nevevı) dedi ki: Ancak bu genellik Müslüman için özeldir. Kafire öncelikle selam vermez. İkinci hadis, Ebu Eyyub'un: \"Müslümanın kardeşine ... küs durması helal değildir\" hadisidir. Bu hadise dair açıklamalar daha önce yeteri kadarıyla Edeb bölümünde (6073 nolu hadiste) geçmiş bulunmaktadır",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6238,
			"arabicnumber": 6238,
			"text": "Enes İbn Malik'ten şöyle dediği rivayet edilmiştir: \"Rasulullah Sallallahu Aleyhi ve Sellem'in Medine'ye geldiği sıralarda ben on yaşında idim. Rasulullah Sallallahu Aleyhi ve Sellem'e hayatının geri kalan döneminde on yıl süreyle hizmet ettim. Hicabın indiği sırada hicabın durumu ile ilgili olarak insanların en bilgilisi olan da benim. Ubey İbn Ka'b bana hicaba dair soru sorardı. Hicabın ilk olarak nazil olduğu zaman ise Rasulullah Sallallahu Aleyhi ve Sellem'in Cahş kızı Zeyneb ile zifafa girdiği zamandır. Nebi Sallallahu Aleyhi ve Sellem onunla zifafa girmiş ve damat olarak sabahı etmişti. İnsanları düğün yemeğine davet etmiş, onlar da yemekten yemişlerdi. Daha sonra çıkıp gitmişlerdi. Ama onlardan birkaç kişi, Rasulullah Sallallahu Aleyhi ve Sellem'in yanında kalmış ve kaldıkları süre uzayıp gitmişti. Bundan dolayı Rasulullah Sallallahu Aleyhi ve Sellem ayağa kalkıp dışarı çıkmıştı. Ben de oturanlar çıksınlar diye onunla beraber çıktım. Rasulullah Sallallahu Aleyhi ve Sellem yürüdü, onunla birlikte ben de yürüdüm. Nihayet Aişe'nin odasının eşiğine kadar geldi. Sonra Rasulullah Sallallahu Aleyhi ve Sellem, çıktıklarını zannettiğinden geri döndü, ben de onunla birlikte geri döndüm. Nihayet Zeyneb'in odasına girdi. Onların hala oturmakta olduklarını ve dağılmadıklarını gördüm. Bundan dolayı Nebi Sallallahu Aleyhi ve Sellem tekrar geri döndü, ben de onunla birlikte geri döndüm. Nihayet Aişe'nin odasının eşiğine kadar geldi. Oturanların çıkıp gittiklerini sandığından geri döndü, ben de onunla birlikte geri döndüm. Çıkıp gitmiş olduklarını gördü. Hemen hicab ayet i nazil olunca Allah Rasulü de benimle kendisi arasına bir perde gerdi",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6239,
			"arabicnumber": 6239,
			"text": "Enes r.a.'dan dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem Zeyneb ile evlendiğinde davete gelenler; içeri girip yemek yediler. Sonra da oturup konuşmaya koyuldular. Nebi kalkmaya hazırlanır gibi yaptı, ama onlar kalkmadılar. Allah Hasıılü onların bu halini görünce kalktı. O kalkınca, oturanlardan bir kısmı kalktı, geriye kalanları oturmaya devam etti. Nebi Sallallahu Aleyhi ve Sellem dönüp içeri girmek isteyince, onların hala oturduklarını gördü. Daha sonra kalkıp gittiler. Ben de Nebi Sallallahu Aleyhi ve Sellem'e (gittiklerini) haber verince, gelip içeri girdi. Ben de içeri girmek istedimse de benimle kendisi arasına hicabı (perdeyi) indirdi. Yüce Allah da: \"Ey iman edenler! Nebiin evlerine sizin için yemeğe izin verilmeden girmeyin ... \"(Ahzab, 53) ayetini indirdi",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6240,
			"arabicnumber": 6240,
			"text": "Nebi Sallallahu Aleyhi ve Sellem'in zevcesi Aişe r.anha'dan dedi ki: \"Ömer İbn el-Hattab Rasulullah Sallallahu Aleyhi ve Sellem'e: Hanımlarını hicabın (perdenin) arkasına al, deyip duruyordu. Aişe dedi ki: Ama Nebi Sallallahu Aleyhi ve Sellem yapmıyordu. Nebi Sallallahu Aleyhi ve Sellem'in zevceleri de geceleyin el-Men ası' denilen yere doğru ihtiyaçları için çıkıp gidiyorlardı. Zem'a kızı Sevde -ki uzun boylu bir kadın idi- de (bir gece) çıkınca Ömer İbn el-Hattab onu bir mecliste oturuyor iken gördü ve: -Hicab emrinin nazil olmasını şiddetle arzu ettiğimden - Seni tanıdık ey Sevde, dedi. Aişe: Bunun üzerine yüce Allah hicab ayetini indirdi, dedi.\" Fethu'l-Bari Açıklaması: \"Hicab ayeti\" Nebi Sallallahu Aleyhi ve Sellem'in hanımlarının erkeklere karşı perdenin arkasına çekilmeleri emrini ihtiva eden ayet demektir. Buhari bu başlık altında Enes'den gelen bu rivayeti iki ayrı yoldan zikretmiştir. Buna dair yeterli açıklamalar da daha önce Ahzab suresinde (4791 nolu hadiste) geçmiş bulunmaktadır. \"Ömer İbn el-Hattab da Rasulullah Sallallahu Aleyhi ve Sellem'e: Hanımlarını perde arkasına al, deyip duruyordu.\" Buna dair yeterli açıklamalar da daha önce Taharet bölümünde geçmiş bulunmaktadır. Hadisin sonlarında geçen: \"Hicaba dair emrin nazil olmasını şiddetle arzu ettiğinden: Seni tanıdık ey Sevde dedi. Aziz ve celil olan Allah da hicab ayetini indirdi.\" ifadeleri ile, Enes'in hicabın iniş sebebini Zeyneb kıssası olarak gösterdiği hadisi bir arada şöylece açıklanabilir: Ömer bu işi o kadar ileri derecede arzu etmişti ki nihayet Sevde'ye o sözleri söyledi. Bu sözleri söylediği olay ile Zeyneb'in evliliği esnasında Nebiin evinde oturanların olayı denk zamana düştüğünden bu ayet nazil olmuştu. Böylelikle her iki durum da ayetin inişi için sebep oldu. Buna dair açıklamalar bazı fazlalıklarla birlikte Ahzab suresinin tefsirinde geçmiş bulunmaktadır. Kurtubi daha önceden bu rivayetleri telif ederek şöyle demiştir: Ömer r.a.'ın bu sözleri, hicabdan önce ve sonra birkaç defa tekrarlamış olduğu şeklinde yorumlanır",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6241,
			"arabicnumber": 6241,
			"text": "Sehl İbn Sa'd'dan dedi ki: \"Bir adam Nebi Sallallahu Aleyhi ve Sellem'in hücrelerinden bir hücrenin içine baktı. Nebi Sallallahu Aleyhi ve Sellem'in elinde de kendisi ile başını kaşıdığı demir bir tarak vardı. Adamı görünce: Eğer senin içeriye doğru baktığını bilseydim, bunu gözüne batırırdım. Gerçek şu ki, izin istemek görmeye karşı tedbir olsun diye emredilmiştir.\" Diğer tahric edenler: Tirmizi Edeb; Müslim, Edeb",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 6242,
			"arabicnumber": 6242,
			"text": "Enes İbn Malik'ten rivayet e göre; \"Bir adam Nebi Sallallahu Aleyhi ve Sellem'in hücrelerinden birisinin içine bakmıştı. Nebi Sallallahu Aleyhi ve Sellem elinde uzunca bir ok demiri -yahut ok demirleriyle- ona doğru kalktı. Hala adamı dürtmek için ona gizlice sokulmasını görüyor gibiyim.\" Bu Hadis 6889 ve 6900 numara ile de geçiyor. Fethu'l-Bari Açıklaması: \"İzin istemek, görmeye karşı tedbir olsun diyedir.\" Yani bunun için meşru kılınmıştır. Çünkü izin isteyen kişi izin almaksızın içeri girecek olursa, yanına girdiği kimsenin görmesinden hoşlanmayacağı bazı şeyleri görecektir. Buhari'nin el-Edebu'l-Müfred'de, Ebu Davud'un ve hasen olduğunu belirterek Tirmizi'nin rivayet etmiş olduğu Sevban yoluyla gelen merfu hadiste bu husus açıkça ifade edilmiş bulunmaktadır: \"Müslüman bir kimsenin izin almadıkça bir evin içine bakması helal değildir. Eğer böyle bir işi yaparsa içeri girmiş demektir.\" Yani içeri giren kimse hükmünde olur. Yine Buhari Ömer radıyaııa.hu anh'ın: \"Kim kendisine izin verilmeden önce bir evin iç tarafında bulunanları görerek gözüyle onlara dolu dolu bakarsa fasıklık etmiş olur.\" Ebu Davud kavi bir sened ile İbn Abbas'tan şu hadisi rivayet etmektedir: \"İnsanların evlerinin (kapıları) üzerinde perdeleri yoktu. Bu sebeple Allah onlara izin istemelerini emir buyurdu. Daha sonra yüce Allah hayırlar getirip sevk etti. Bundan dolayı artık kimsenin bu emir ile amel ettiğini görmüyorum.\" İbn Abdilberr dedi ki: Zannederim onlar kapıyı çalmakla yetindiler. Yine Ebu Davud, Abdullah İbn Busr yoluyla şu hadisi rivayet etmektedir: \"Rasulullah s.a.v. bir ailenin kapısına gidecek olursa yüzünü kapıya doğru çevirmez, ama ya sağ ya da sol tarafında dururdu. Çünkü evlerin, kapıları üzerinde perdeleri yoktu.\" Enes'in rivayet ettiği hadiste \"uzunca ok demiri yahut ok demirleri\" ifadesi, okun demir ucu enli olmayıp, uzun olduğu takdirde kullanılan tabirdir. \"Gizlice\" yani adam fark etmeksizin onu dürtmek istemesini ... demektir. Bundan dolayı gözü yahut başka organı isabet alıp yaralanan kimsenin hükmü, Diyetler bölümünde gelecektir. Bu durum, kasten bakan kimse hakkında özeldir, ama kastetmeksizin bu şekilde içeriyi gören bir kimse için herhangi bir vebal yoktur. Müslim'in Sahih'indeki rivayete göre \"Nebi Sallallahu Aleyhi ve Sellem'e ansızın görmenin hükmü soruldu da o: Gözünü başka tarafa çevir, buyurdu.\" Ali radıyall\"hu anh'a hitaben de: \"Bir defa baktıktan sonra arkasından bir daha bakma. Çünkü birincisi senin lehinedir ama ikincisinde hakkın yoktur, buyurdu.\" Bu hadis, kişinin kendi evine girmek için izin istemeye gerek olmadığına delil gösterilmiştir. Çünkü izin istemenin meşru kılınmasınasebep olan illet bulunmamaktadır. Evet, eğer bununla birlikte izin istemeye ihtiyaç duyuracak yeni bir durumun ortaya çıkmış olma ihtimali varsa, izin istemesi meşru olur. Buradan da mahremler dahil olmak üzere herkesin yanına girmek için izin istemenin meşru olduğu hükmü anlaşılır. Böylelikle mahrem olan bir kadın, avreti açık halde görülmemiş olur. Buhari el-Edebu'l-Müfred'de, NMi'den: \"İbn Ömer, çocuklarından birisi ergenlik yaşına geldi mi izin almadan çocuğunun yanına girmezdi\" rivayetini nakletmiş bulunmaktadır. Alkame yoluyla da şu rivayeti nakletmiştir: \"Bir adam İbn Mesud'a gelerek: Annemin yanına girmek için izin isteyeyim mi, diye sordu. Ona: \"O her zaman bulunduğu her halinde senin kendisini görmeni istemez, diye cevap verdi",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 6243,
			"arabicnumber": 6243,
			"text": "İbn Abbas r.a.'dan dedi ki: \"Ben Ebu Hureyre'nin Nebi Sallallahu Aleyhi ve Sellem'den diye rivayet ettiği şu buyrukta sözü edilen işlerden daha çok Lemem (denilen küçük günahlara) benzer hiçbir şey görmedim: Şüphesiz Allah Adem oğlu hakkında zinadan payına düşeni yazmıştır. Kaçınılmaz olarak bunu yapacaktır: Gözün zinası bakmaktır, dilin zinası konuşmaktır, nefis temenni ve arzu eder, cinselorgan ise bütün bunları ya doğrular yahut yalanlar. \" Fethu'l-Bari Açıklaması: \"Cinsel organın dışındaki azaların zinası.\" Yani zina, özelolarak cinselorgan hakkında kullanılır, diye bir şey yoktur. Aksine bakmak ve daha başka cinsel örganın yaptığının dışındaki şeyler hakkında da kullanılır. Bunda izin istemeksizin evin içinde bulunan şeylere bakıp görmenin yasaklanış hikmetine de işaret vardır ki, böylelikle bu başlığın bir önceki başlıkla ilişkisi de ortaya çıkmış olur. \"Ebu Hureyrelnin Nebilden diye naklettiği şu söylediğinden daha çok Lemem (denilen küçük günahla benzeyen bir şey görmedim.\" Bu hadise dair yeterli açıklamalar yüce Allahlın izniyle Kader bölümünde gelecektir. İbn Battal dedi ki: Bakmaya ve konuşmaya da zina denilmesinin sebebi, gerçek zinaya davet edici oluşudur)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 6244,
			"arabicnumber": 6244,
			"text": "Enes r.a.'dan rivayete göre Rasulullah Sallallahu Aleyhi ve Sellem selam verdiğinde, üç defa selam verirdi. Bir söz söyleyip konuştuğunda da onu üç defa tekrar ederdi",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 6245,
			"arabicnumber": 6245,
			"text": "Ebu Said el-Hudri'den dedi ki: \"Ben ensarın oturduğu meclislerinden birisinde bulunuyordum. Bir ara Ebu Musa adeta korkmuş gibi geldi ve şunları söyledi: -Ben Ömer'in yanına girmek için üç defa izin istedim, ama o bana izin vermeyince ben de geri döndüm. Sonra: Seni içeri girmekten ne alıkoydu, diye sordu. Ben: Üç defa izin istediğim halde bana izin verilmediği için ben de geri döndüm. Rasulullah Sallallahu Aleyhi ve Sellem da: Sizden biriniz üç defa izin istediği halde ona izin verilmeyecek olursa geri dönsün, buyurdu, diye cevap verdim. Bu sefer Ömer: Allah'a yemin ederim ya buna dair bir delil ortaya koyarsın (yahutta canını acıtacak şekilde seni cezalandırırım), dedi. Peki aranızdan bunu Nebi Sallallahu Aleyhi ve Sellem'den işitmiş birisi var mıdır? Hemen Ubey İbn Ka'b şu cevabı verdi: Allah'a yemin ederim, seninle beraber (bu iş için) ancak burada bulunanların yaşça en küçüğü gelecektir. Orada bulunanların yaşça en küçükleri bendim. Bundan dolayı onunla birlikte kalkıp gittim ve Ömer'e Nebi Sallallahu Aleyhi ve Sellem'in bu sözleri söylemiş olduğunu haber verdim.:' Fethu'l-Bari Açıklaması: \"Selam vermek ve izin istemek\". Yani ister bir arada olsunlar, ister ayrı ayrı olsunlar, izin istemek için selamın şart olup olmadığı hususunda görüş ayrılığı vardır. el-Mazeri: İzin isteme şekli: es-Selamu aleykum gireyim mi demek suretiyle olur. Bundan sonra kişi kendi adını vermekte yada selam ile yetinmekte muhayyerdir. Evet, el-Mazeri böyle demekle birlikte ileride \"O kim diye sorulursa benim diyen kimse\" başlığında, bu görüşün isabetli olmadığını gösterecek rivayetler gelecektir. \"Bize İshak tahdis ettL\" (6244 nolu hadisin Buhari'den önceki ravisL Yani hadisi Buhari'ye rivayet eden İshak İbn Mansur'dur.) Bu hadise dair açıklamalar ve el-İsmaili'nin: Selamın tekrarı ancak isti'zan (izin istemek) ile biriikte olması halinde meşrudur, dediği ve buna nasıl cevap verildiği, tek başına selam vermenin de eğer topluluk çoksa ya da bir kısmına işittirmemiş ve hepsinin de işitmesini istemiş ise tekrarının meşru olduğuna dair açıklamalar geçmiş bulunmaktadır. Nitekim Enes'in rivayet ettiği bu hadisin anlamının böyle olduğunu Nevevi kesin olarak ifade etmiştir. Aynı şekilde selam verdiği halde sesinin işitilmediğini düşünürse selamını tekrarlaması sünnettir. İkinci ve üçüncü defa selam vermeyi tekrarlar ama üçten fazla tekrar etmez. Cumhur ile bazı Malikiler, haberin zahirine uyarak daha fazla selam vermeyeceği görüşündedir. el-Mazerı ise şöyle demektedir: Verdiği selamın işitilmediğini zannedecek olursa üçten fazla selam verir mi vermez mi hususunda görüş ayrılığı vardır. Daha fazla selam vermez denildiği gibi, verilebilir de denilmiştir. (6245 nolu hadisin) bazı rivayet yollarında Ömer'in, Ebu Musa'ya şöyle dediği zikredilmektedir: \"Bana gelince, ben seni (yalancılıkla) itham etmiyorum ama insanların Rasulullah Sallallahu Aleyhi ve Sellem'den hadis naklederken cüretkarlık göstermemelerini istedim.\" Derim ki: Bu fazlalık Muvatta'da Rabia'dan diye rivayet edilmiştir. Az önce kendisine işaret etmiş olduğumuz Ubeyd İbn Huneyn rivayetinde: \"Bunun üzerine Ömer, Ebu Musa'ya: Allah'a yemin ederim, şüphesiz ki sen Rasulullah Sallallahu Aleyhi ve Sellem'in hadisi konusunda kendisine güvenilen birisisin ama ben işi sağlam tutmayı arzu ettim, demiştir.\" Nebi Sallallahu Aleyhi ve Sellem'e isnad edilen bu merfu haber, üç defadan fazla izin istemenin caiz olmadığına delil gösterilmiştir. İbn Abdilberr dedi ki: İlim ehlinin çoğunluğunun kanaati bu doğrultudadır. Bazıları da şöyle demiştir: Eğer kendisinden izin istenen kişi işitmemişse daha çok sayıda izin istemekte bir sakınca yoktur. Suhnun, İbn Vehb'den, o Malik'ten: Kendisinden izin istenen kişinin işitmediğini bilmesi hali dışında üçten fazla izin istemesini sevmiyorum, dediği rivayet edilmiştir. Derim ki: Şamler tarafından da daha sahih görülen görüş budur. Yine hadisten anlaşıldığına göre, ev sahibi izin istendiğini işittiği takdirde ister bir defa selam vermiş olsun, ister iki, ister üç defa şayet izin isteyene izin vermemekte mazur görülebileceği dini ya da dünyevi bir işle meşgul bulunuyor ise izin vermeme hakkına sahiptir. Hadisten anlaşılan bir diğer husus da şudur: Derya gibi alim bir kişi bazen kendisinden daha aşağı mertebede bulunan bir kimsenin bildiği bir bilgiyi bilmeyebilir. Bu ise onun ilim niteliğine ve ilimde derya gibi oluşuna gölge düşürmez. İbn Battal dedi ki: Böyle bir durumu bilmemek, Ömer için mümkün olduğuna göre ondan daha alt mertebede olan bir kimse hakkında ne düşünülebilir?",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 6246,
			"arabicnumber": 6246,
			"text": "Ebu Hureyre r.a.'dan dedi ki: \"Rasuluilah Sallallahu Aleyhi ve Sellem ile birlikte içeri girdim. Bir kap içinde bir miktar süt bulunca: Ey Eba Hirr, Suffa ahalisinin yanına var ve onları yanıma davet et, buyurdu. Ebu Hureyre dedi ki: Ben de yanlarına varıp onları davet ettim. Onlar da gelip izin istediler. Allah Rasulü onlara izin verince, onlar da içeri girdiler.\" Fethu'l-Bari Açıklaması: \"Kişi davet edilip de gelirse, izin ister mi?\" Yoksa gelmesi istendiği karinesi ile (onu izin sayarak) yetinir mi? Daha sonra musannıf Mücahid'in, Ebu Hureyre'den diye rivayet ettiği hadisin bir kısmınızikretmektedir. Ebu Hureyre dedi ki: \"Rasuluilah Sallallahu Aleyhi ve Sellem ile birlikte içeri girdim. Bir kapta bir miktar süt buldu. Ey Eba Hirr, Suffa ehlinin yanına var, onları yanıma çağır, buyurdu. Ebu Hureyre dedi ki: Ben de onların yanlarına varıp, onları davet ettim, onlar da geldiler. İçeri girmek için izin istediler, onlara izin verince onlar da içeri girdiler. i, Buhari burada hadisin bu kadarını zikretmiş bulunmaktadır. Çünkü burada bu kadarına ihtiyaç duymuştur. İleride geleceği üzere Rikaak bölümünde hadisi tamamıyla kaydetmiş bulunmaktadır. Hadisin zahiri (başlıktan sonra işaret ettiği) ilk hadis ile tearuz halinde olduğundan dolayı kesin olarak hükmü ifade etmemiştir. el-Mühelleb ve başkaları ise, bunu her iki durumun farklılığını esas alarak yorumlamışlardır: Eğer yapılan davet ile geliş arasında zaman uzamışsa yeniden izin istemeye ihtiyaç vardır. Aynı şekilde arada uzun süre olmamakla birlikte davet yapılmasını isteyen kişi şayet adeten içeri girilmesi için izin istemeyi gerektirecek bir halde ise yine izin istenir. Aksi takdirde yeniden izin istemeye ihtiyaç yoktur. İbnu't-Tın de şöyle demiştir: Birincisi, yanında kendisi dolayısıyla izin istemesini gerektirecek kimsenin bulunmadığını bilmesi hali hakkındadır. İkincisi ise böyle olmayan durum ile ilgilidir. İbnu't-Tın der ki: Bununla birlikte her durumda izin istemek, ihtiyata daha uygundur. Başkası ise şöyle demektedir: Eğer davette bulunan elçi ile birlikte gelmiş ise elçinin izin istemesi, ayrıca onun izin istemesine ihtiyaç bırakmaz ve onun için karşılaşıldığı vakit selam vermesi yeterlidir. Şayet daveti yapan elçiden sonraya kalırsa izin istemesi gerekir. Tahavı de rivayetleri böylece telif etmiş bulunmaktadır. İkinci hadiste yer alan: \"Onlar da gelip izin istediler\" ibaresini de delil göstermiştir. İşte bu, Ebu Hureyre'nin onlarla beraber olmadığına delildir. Çünkü onlarla birlikte olsaydı: Hep birlikte geldik, demesi gerekirdi. Evet, o {Tahavı} böyle demiştir",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 6247,
			"arabicnumber": 6247,
			"text": "Enes İbn Malik r.a.'dan rivayete göre o, bir sefer çocukların yanından geçerken onlara selam vermiş ve: \"Bunu Nebi Sallallahu Aleyhi ve Sellem yapardı\" demiştir. Fethu'l-Bari Açıklaması: \"Çocuklara selam vermek\" Buhari bu başlık ile, selamı almak farzdır. Çocuk ise farz olan bir ameli işlemek ehliyetine sahip değildir, gerekçesi ile çocuklara selamın meşru olmadığını söyleyenlerin kanaatlerini reddetmek istemiş gibidir. İbn Battal dedi ki: Çocuklara selam verilerek şeriatın öngördüğü adaba alışmaları sağlanır. Ayrıca bu yolla büyük kimseler büyüklük elbisesini sıyırıp atar, alçak gönüllülükle ve yumuşaklıkla muameleye yönelmiş olurlar. Ebu Said el-Mütevelli, et-Tetimme adlı eserinde şunları söylemektedir: Bir kimse çocuğa selam verse, çocuğun o selamı alması vacip değildir. Çünkü küçük çocuk farzı işlemek ehliyetine sahip değildir, ama küçük çocuğun velisinin, bu hususta eğitilmesi için selamı almasını emretmesi gerekir. Eğer aralarında çocuğun da bulunduğu bir topluluğa selam verilir de çocuk da tek başına selamı alırsa, farz yaşça büyüklerin üzerinden düşmüş olmaz",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 6248,
			"arabicnumber": 6248,
			"text": "(Ebu Hazim'den o) Sehl'den dedi ki: \"Cuma gününün gelmesine sevinirdik. Ben Sehl'e: Neden, diye sordum. O şöyle dedi: Bizim yaşlıca bir ninemiz vardı. -Medine'de bir hurmalık olanBudaa'ya birisini gönderir ve kırmızı pancar köklerini alır, onları bir tencereye koyar, onlarla bir miktar arpa taneleri de öğütürdü. Biz de Cuma namazını kılıp ayrıldıktan sonra gider ona selam verirdik. O da bizlere o yemeği takdim ederdi. Bundan dolayı çokça sevinirdik. Biz ancak Cuma namazını kıldıktan sonra öğle uykusunu uyur, öğle yemeğini yerdik",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 6249,
			"arabicnumber": 6249,
			"text": "Aişe r.anha'dan dedi ki: \"Rasulullah Sallallahu Aleyhi ve Sellem: Ey Aişe! İşte Cibril, sana selam söylüyor, buyurdu. Aişe dedi ki: Ben de: Ve aleyhisselam ve rahmetullah. Sen bizim görmediğimizi görüyorsun dedim\" Bununla Rasulullah Sallallahu Aleyhi ve Sellem'i kastediyordu. Fethu'l-Bari Açıklaması: \"Erkeklerin kadınlara, kadınların erkeklere selam vermesi.\" Bunun caiz olması fitneden yana emin olunması halindedir. Buhari bu başlıkta her ikisinden de caiz olduğu anlaşılan iki hadis zikretmektedir. Bu hususta Buhari'nin şartına uygun olmayan bir başka hadis varid olmuştur. O da Yezid kızı Esma'nın rivayet ettiği şu hadistir: Ben beraberimde başka kadınlar da varken Nebi Sallallahu Aleyhi ve Sellem yanımızdan geçti ve bize selam verdi.\" Tirmizi hasen olduğunu söylemiştir. el-Halim! dedi ki: Nebi Sallallahu Aleyhi ve Sellem günahtan korunmuş olduğundan ötürü fitneye düşmekten yana emin idi. Kendisinin esenlikte kalacağına güvenen bir kimse selam versin. Aksi takdirde susmak daha uygundur. \"İbn Mesleme Medine'de bir hurmalık olduğunu söylemiştir.\" Bu sözleriyle Budaa'nın Medine'de bir hurmalık olduğunu açıklamış olmaktadır. Hurmalıktan maksad da bahçedir. Bundan dolayı oradan kırmızı pancar kökleri getiriliyordu. Cuma bölümünde buranın adı geçen kadına ait bir bahçe olduğu geçmiş bulunmaktadır. \"Ey Aişe, işte Cibril sana selam söylüyor.\" İbn Battal, el-Mühelleb'den dedi ki: Erkeklerin kadınlara, kadınların da erkeklere selam vermeleri fitneden yana emin olunması halinde caizdir. Maliki alimleri ise kötülüğe giden yolu kapatmak için genç kadın ile yaşlı kadın arasında fark gözetmişlerdir. Rabia, mutlak olarak kadına selam verilmesini kabul etmezdi. KCıfeliler der ki: Kadınların erkeklere selam vermeleri meşru değildir. Çünkü kadınlara ezan okumaları, kamet getirmeleri, açıktan yüksek sesle Kur'an okumaları yasaktır. Derler ki: Ancak mahrem müstesnadır. Kadının mahremine selam vermesi caizdir. el-Mühelleb dedi ki: Malik'in delili, bu başlıkta yer alan Sehl'in hadisidir. Çünkü o yaşlı kadını ziyaret eden ve kendisinin de onlara yemek ikram ettiği erkekler, kadının mahremlerinden değil idiler",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 6250,
			"arabicnumber": 6250,
			"text": "Cabir r.a.'dan di ki: \"Nebi Sallallahu Aleyhi ve Sellem'in huzuruna babamın üzerindeki bir borç dolayısıyla gitmiştim. Kapıyı çaldım, o kim diye sordu. Ben: Benim deyince, Allah Rasulü verdiğim cevaptan hoşlanmamış gibi: Benim, benim, dedi.\" Diğer tahric edenler: Tirmizi Edeb; Müslim, Edeb Fethu'l-Bari Açıklaması: \"Kim o, diyene benim diye cevap verirse\" Bu husustaki haber böyle demenin mekruh olduğu hususunda açık bir ifade taşımadığından ötürü kesin bir hüküm vermemiş gibidir. Musannıfel-Edebu'l-Müfred'de, Hakim'in de sahih olduğunu belirttiği Bureyde'nin rivayet ettiği şu hadisi kaydetmiştir: \"Nebi s.a.v. mescide geldi. O sırada Ebu Musa Kur'an okuyordu. Bureyde dedi ki: Ben de geldim. Kim o, dedi. Ben: Ben Bureyde'yim dedim.\" Daha önce de Ümmü Hani'nin rivayet ettiği: \"Nebi Sallallahu Aleyhi ve Sellem'in yanına vardım. Ben Üm mü Hani'yim dedim ... \" şeklindeki hadis de Kuşluk namazı bahsinde geçmiş bulunmaktadır. Nevevı der ki: Eğer kişi kendisinin künyesini söylemeksizin tanınmayacaksa kendisini bu şekilde tanıtması mekruh değildir. Aynı şekilde: Ben şeyh filan yahut kari filan yahut kadı filanım demesi de -ancak bu yolla başkalarından ayırt edilebiliyorsa- mekruh değildir. İbnu'l-Cevzi'nin zikrettiğine göre \"benim\" demesinin mekruh oluş sebebi, bunda bir tür tekebbür bulunmasından dolayıdır. Çünkü böyle diyen bir kimse: Ben adını da, nesebini de ayrıca belirtmeye ihtiyacı olmayan kimseyim, demiş gibi olur. Ancak Muğultaı ona itiraz ederek, böyle bir konumda Cabir hakkında bu düşünülemez, demiştir. Buna şöyle cevap verilmiştir: Evet, Cabir dediğiniz gibi olsa bile bu, bnu sürdürmemesi ve alışkanlık haline getirmemesi için ona gerekeni öğretmeye engel değildir. Doğrusunu en iyi bilen Allah'tır. İbnu'l-Arabi dedi ki: Cabir'in hadisinden, kapıyı çalmanın meşru olduğu anlaşılmaktadır. Buhari el-Edebu'l-Müfred'de, Enes'den: \"Rasulullah Sallallahu Aleyhi ve Sellem'in kapıları tırnaklarla çalınırdı\" hadisini rivayet etmiş bulunmaktadır. Bu ise onların ileri derecede edepli davrandıklarına yorumlanır. Kapıya yakın bir yerde bulunan kimse için de bu güzel bir şeydir. Ama tırnakla kapının çalınmasının sesini alamayacak kadar kapıdan uzakta bulunan bir kimsenin kapısının duruma göre daha fazlasıyla çalınması müstehaptır",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 6251,
			"arabicnumber": 6251,
			"text": "Ebu Hureyre r.a.'dan rivayete göre; \"Bir adam mescide girdi. Rasulullah Sallallahu Aleyhi ve Sellem da o sırada mescidin bir tarafında oturuyordu. Bu adam namaz kıldıktan sonra geldi ve ona selam verdi. Rasulullah Sallallahu Aleyhi ve Sellem da ona: Ve aleykesselam, dön ve namaz kıL. Çünkü sen namaz kılmadın, dedi. Adam da döndü ve namaz kıldı. Sonra gelip, selam verdi. Allah Rasulü: Ve aleykesselam, dön ve namaz kıL. Çünkü sen namaz kılmadın, buyurdu. İkincisinde -yahut ondan sonrakisinde-: Ey Allah'ın Rasulü, bana öğret, dedi. Allah Rasulü şöyle buyurdu: Namaz kılmak için kalktığında güzelce abdest aL. Sonra kıbleye yönel, tekbir getir. Sonra Kur'an'dan kolayına gelen bir miktar oku .. Sonra rükuunda azaların yerli yerine oturuncaya kadar rükua var. Sonra ayakta doğruluncaya kadar başını kaldır. Sonra secde halinde iken azaların yerli yerine oturuncaya kadar secde et. Sonra otururken azaların yerli yerine oturuncaya kadar başını secdeden kaldır. Sonra secdede iken azaların yerli yerine oturuncaya kadar secde et. Sonra oturuşunda azaların yerli yerine gelinceye kadar başını secdeden kaldır. Daha sonra aynı şeyi namazın tamamında yap",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 6252,
			"arabicnumber": 6252,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 6253,
			"arabicnumber": 6253,
			"text": "Aişe r.anha'dan rivayete göre \"Nebi Sallallahu Aleyhi ve Sellem kendisine: Şüphesiz Cibril sana selam söylüyor, dedi. Aişe de: Ve aleyhimusselamu ve rahmetullah diye cevap verdi.\" Fethu'l-Bari Açıklaması: \"Filan kişinin sana selamı var derse\" el-Küşmiheni'nin rivayetinde: \"Yakrau aleykisselam: Sana selam söylüyor\" şeklindedir. Başlıktaki hadisin lafzında da böyledir. Buna dair açıklamalar daha önce Aişe radıyallahu anha'ın Menkıbeleri başlığında (3768 nolu hadiste) geçmiş bulunmaktadır. Nevevi dedi ki: Bu hadisten bir aracı ile selam göndermenin meşru olduğu anlaşılmaktadır. Kendisi ile selam gönderilen elçinin de onu bildirmesi gerekir. Çünkü bu bir emanettir. Ancak bunun vediaya daha çok benzediği söylenerek itiraz edilmiştir. Meselenin tahkiki şudur: Eğer elçi selamı götürmeyi kabul edip üstlenirse emanete daha çok benzer. Aksi takdirde bu bir vedia olur. Bir kimse bir vediayı kabul ettiğini belirtmezse herhangi bir yükümlülüğü olmaz. (Nevevi devamla) dedi ki: Birisine bir kişi bir başkasından selam getirse ya da bir kağıtta yazılı olsa derhal o selamın alınması vaciptir. Selamı ulaştırana da karşılık vermesi müstehaptır. Nitekim Nesai'nin Temim oğullarından bir adamdan rivayet ettiğine göre bu şahıs, Nebi Sallallahu Aleyhi ve Sellem'e babasının selamını bildirmiş, Allah Resuıü de ona: \"Ve aleyke ve ala ebikesselam: Sana da, babana da selam olsun, demiştir.\" Daha önce Menakıb (menkıbeler) bölümünde geçtiği üzere Nebi Sallallahu Aleyhi ve Sellem Hatice radıyalliihu anhii'ya Cibril'den Allah'ın kendisine selamını bildirince şöyle cevap vermişti: \"Şüphesiz Allah es-selamdır. es-Selam da ondandır. Sana da Cibril'e de selam olsun.\" Bununla birlikte Aişe ile ilgili hadisin rivayet yollarını hiç birisinde onun, selamı alırken Nebi Sallallahu Aleyhi ve Sellem'i da söz konusu ettiğini görmedim. İşte bu da getirene de selam vermenin vacip olmadığının deliIidir. Başlıktaki lafız ile, Nebi Sallallahu Aleyhi ve Sellem'in sözü olarak hadis de varid olmuş bulunmaktadır. Bunu Müslim, Enes'den diye rivayet etmiştir. Buna göre \"EslemIilerden bir genç: Ey Allah'ın Rasulü! Ben cihad etmek istiyorum, deyince, Allah Rasulü: Filanın yanına git ve: Şüphesiz Rasulullah Sallallahu Aleyhi ve Sellem'in sana selamı var ve: Cihada gitmek için hazırladığın malzemeyi bana ver diyor, de",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 6254,
			"arabicnumber": 6254,
			"text": "{Usame İbn Zeyd'den rivayete göre; \"Nebi Sallallahu Aleyhi ve Sellem, altında Fedek dokuması bir kadife bulunan palan vurulmuş bir eşeğe bindi. Arkasına da Usame İbn Zeyd'i hindirmişti. el-Haris İbn Hazrec oğulları yurdunda bulunan Said İbn Ubade'ye hasta ziyaretinde bulunmaya gidiyordu. -Bu olay, Bedir vakasından önce idi.- Nihayet aralarında Müslümanlardan, müşriklerden, puta tapıcılardan ve Yahudilerden karışık kimselerin oturduğu bir meclisin yanından geçti. Bunlar arasında Abdullah İbn Ubeyy İbn SeluI de vardı. Yine aynı mecliste Abdullah İbn Revaha da bulunuyordu. Bineğin çıkardığı tozlar, meclisin üzerine gelince, Abdullah İbn Ubeyy ridasıyla burnunu örttü, sonra da: Üzerimize toz çıkarmayınız, dedi. Nebi Sallallahu Aleyhi ve Sellem onlara selam verdikten sonra durdu. Bineğinden indi, onları Allah'a davet etti, onlara Kur'an okudu. Buna karşılık Abdullah İbn Ubeyy İbn Selul: Ey kişil Eğer bu söylediklerin bir hak ise bundan daha güzeli yoktur. Bu sebeple sen bizim meclisimizde bizi rahatsız etme. Kendi kaldığın yere geri dön. Bizden sana gelen olursa sen de ona anlatacaklarını anlat, dedi. İbn Revaha: Meclislerimizde yanımıza gel. Biz bunu seviyor, arzu ediyoruz, dedi. Bunun sonucunda Müslümanlar, müşrikler, Yahudiler birbirlerine ağır sözler söylediler. Hatta sonunda birbirleri üzerine yürüyüp kavgaya tutuşacak hale kadar geldiler. Nebi Sallallahu Aleyhi ve Sellem ise durmadan onları teskin etti. Daha sonra bineğine bindi, nihayet Sa'd İbn Ubade'nin bulunduğu yere girerek: Ey Sad' -Abdullah İbn Ubeyy'i kastederek- Ebu Hubab'ın ne söylediğini duymadın mı: O şöyle şöyle dedi, buyurdu. Sa'd: Ey Allah'ın HasCılü, onu affet ve bağışla! Allah'a yemin ederim ki Allah sana bu verdiği bağışı ihsan etmiş bulunuyor. O sırada bu şehir halkı da ona taç giydirmeyi ve ona hükümdarlığı sarığı sarmayı kararlaştırmış ve bunun üzerine anlaşmışlardı. Ama Allah bunu sana vermiş olduğu o hak ile geri çevirince İbn Ubeyy'in de hevesi kursağında kaldı. İşte senin o gördüklerini yapmaya iten odur, dedi. Nebi Sallallahu Aleyhi ve Sellem de onu affetti.\" Fethu'l-Bari Açıklaması: \"Müslüman ve müşriklerin karışık bulunduğu bir mecliste. oturanlara selam vermek.\" Nevevı dedi ki: Sünnet olan, aralarında Müslüman ve kMirin karışık olarak bulunduğu bir meclisin yanından geçen bir kimsenin genelleştirici bir ifade ile selam verip bununla Müslüman olanları kastetmesidir. İbnu'l-Arabi dedi ki: Aynı şekilde ehl-i sünnet ve bid'atçilerin toplu olarak bulunduğu bir meclisin, adaletli ve zalim kimselerin bulunduğu bir meclisin, sevenin ve nefret edenin bulunduğu bir meclisin yanından geçerse yine böyle yapar. Nevevi buna başlıktaki hadisi delil göstermiştir. Bu da kMire öncelikle selam vermenin yasaklanışı ile ilgili fer'i bir meseledir. Çünkü Müslim ve Buhari'nin el-Edebu'I-Müfred'de Ebu Hureyre'den merfu olarak rivayet ettikleri hadiste bu husustaki yasak açık bir şekilde varid olmuştur: \"Yahudilere ve Hıristiyanıara önce siz selam vermeyiniz ve onları yolun en dar kısmında yürümek zorunda bırakınız.\" Taberi de•şöyle demektedir: Usame'nin Nebi Sallallahu Aleyhi ve Sellem'in Müslümanlarla birlikte bulunan kafirlere selam vermesi ile ilgili rivayet ettiği hadis ile Ebu Hureyre'nin kafirlere öncelikle selam vermeyi yasaklayan hadis arasında herhangi bir aykırılık yoktur. Çünkü Ebu Hureyre'nin hadisi geneldir, Usame'nin hadisi ise özeldir. Kurtubi, hadiste geçen: \"Bir yolda onlarla karşılaştığınızda onları yolu en dar ' kısmından yürümeye mecbur ediniz\" buyruğunun anlamı hakkli}cia şunları söylemketir: Yani onlara ikramda bulunmak ve saygı göstermek ln dar olan yolda bir kenara çekilerek onlara yol açmayınız. Buna göre böyle bir cümle, anlam itibariyle birinci cümleye münasip düşmektedir. Yoksa bunun anlamı: Geniş bir yolda onlarla karşılaşacak olursanız, yalanlara dar ;delecek şekilde kenarından yürümeye onları mecbur ediniz demek değildir. ÇÜnkü böyle bir tutum onlara bir eziyettir, bize de sebepsiz yere onlara eziyey(memiz yasaklanmıştır)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 6255,
			"arabicnumber": 6255,
			"text": "Abdullah İbn Ka'b'dan dedi ki: \"Ben Ka'b İbn Malik'i, Tebuk'ten geri kalışını anlatmasını ve Hasulullah Sallallahu Aleyhi ve Sellem'in bizimle konuşmayı nehyetti, dediğini işittim. Ben Hasulullah Sallallahu Aleyhi ve Sellem'in yanına gidiyor, ona selam veriyordum. Kendi kendime de: Acaba selamımı almak için dudaklarını hareket ettirdi mi ettirmedi mi diyordum. Nihayet elli gün tamamlandı, Nebi Sallallahu Aleyhi ve Sellem da sabah namazını kıldıktan sonra Allah 'ın tevbemizi Kabul ettiğini ilan etti.\" Fethu'l-Bari Açıklaması: \"Bir günah işleyene tevbe ettiği açıkça ortaya çıkana kadar selam vermeyen ve onun selamını almayan kimse ile günahkarın tevbesi ne kadar bir sürE sonra açıkça anlaşılır.\" Birincisi ile ilgili hüküm hakkında görüş ayrılığı bulundu ğuna işaret etmiş bulunmaktadır. Cumhurun görüşüne göre fasık kimseye de, bid'atçiye de selam verilmez. Nevevi der ki: Eğer böylesine selam vermediği takdirde din ya da dünya ile ilgili bir kötülüğün meydana geleceğinden korkarsa selam verir. İbnu'l-Arabi de böyle demiş ve: es-Selam 'ın yüce Allah'ın isimlerinden bir isim olduğuna niyet eder. O, böylelikle Allah sizin üzerinize rakibdir. Sizi görüp gözetendir demiş gibidir, diye eklemiştir. El-Mühelleb de: Masiyet ehli olanlara selam vermeyi terk etmek eskiden beri uyulagelen bir sünnettir, demiştir. İlim ehlinin birçoğu da bid'at ehli hakkında böyle demişlerdir. Bazı Hanefiler çokça mizah yapmak, boş işlerle uğraşmak, çirkin sözlerle konuşmak, gidip gelen kadınları görmek için çarşı-pazarlarda oturmak ve buna benzer insanın mertlik ve insaniyet sıfatları ile bağdaşmayan işleri yapan kimseleri de masiyet işleyenler gibi değerlendirmişlerdir. İbn Rüşd de Malik'in şöyle dediğini nakletmektedir: Heva ehli olan kimselere selam verilmez. İbn Dakiki'l-'Id der ki: Bu onları edeplendirmek ve onlardan uzak oluşunu bildirmek için yapılır. İkinci durumun hükmüne gelince, bunda da görüş ayrılığı vardır. Bir görüşe göre bir sene süreyle onun halini inceler. Bir görüşe göre altı ay, bir görüşe göre de Ka'b İbn Malik kıssasında olduğu gibi elli gün süre ile gözetilir, demiştir. Bunun belli bir süresinin olmadığı, aksine tevbe iddiasında doğruluğuna delil teşkil edecek karinelerin varlığının göz önünde bulundurulacağı da söylenmiştir, ama bu iş için bir saat de, bir gün de yeterli değildir. Bu, işlenen suça ve suçu işleyenin farklılığına göre değişir. Nevevi de şöyle demiştir: Bid'atçi kimseye ve pek büyük bir günah işlemekle birlikte o günahından tevbe etmeyene selam da verilmez, selamları da alınmaz. Nitekim ilim ehlinden bir topluluk böyle demiştir. Buhari buna delil olarak Ka'b İbn Malik'in kıssasını göstermiştir. Burada \"tevbe etmeyen\" kaydı da güzeldir; ama bunun için Ka'b İbn Malik kıssasının delil gösterilmesi tartışılır. Çünkü o yaptığından pişman olup tevbe etmişti, ama Allah onun tevbesini kabul edinceye kadar onunla konuşmak ertelenmişti. Onun ile ilgili hüküm de tevbesi kabul edilinceye kadar onunla konuşulmaması şeklinde idi. Cevap şöyle verilebilir: Ka'b İbn Malik'in başından geçen olayda tevbenin kabul edilip edilmediğini bilmek mümkün idi. Ondan sonraki zamanlarda ise pişmanlığın alametinin ortaya çıkması, o günahtan nihai olarak vazgeçmesi ve bu husustaki sadakat emarelerinin görülmesi yeterlidir. \"İkterafe: İşledi\" kazandı, demektir. Çoğunluğun yorumu da böyledir. Ebu Ubeyde ise: İktiraf, töhmet demektir, demiştir. \"Abdullah İbn Amr içki içenlere selam vermeyiniz, demiştir.\" Abdullah İbn Amr'dan gelen bu eseri (rivayetil Buhari, el-Edebu'l-Müfred adlı eserinde Abdullah ibn Amr el-As'dan şu lafız ile, mevsul bir senedie rivayet etmiştir: \"içki içenlere selam vermeyiniz.\" Sonunda: \"içki içenleri hastalandıkları takdirde ziyaret etmeyiniz\" demiştir)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 6256,
			"arabicnumber": 6256,
			"text": "Aişe r.anha'dan şöyle dediği rivayet edilmiştir: \"Yahudilerden birkaç kişilik bir topluluk, Hasulullah Sallallahu Aleyhi ve Sellem'in huzuruna girip: es-Samu aleyke, dediler. Onların bu dediklerini ben anladığım için: Aleykumu's-samu ve'lla'netu: Sam da, lanet de üzerinize olsun, dedim. Bu sefer Rasulullah Sallallahu Aleyhi ve Sellem: Yavaş ol ey Aişe! Şüphesiz Allah, bütün işlerde rıfkı sever, buyurdu. Ben: Ey Allah'ın Hasulü' Ne söylediklerini duymadın mı, dedim. Hasulullah sallallahu aleyhi ve sellem: Bunun için ben de: Aleykum, dedim ya, buyurdu",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 6257,
			"arabicnumber": 6257,
			"text": "Abdullah İbn Ömer r.a.'dan rivayete göre; \"Rasuluilah Sallallahu Aleyhi ve Sellem şöyle buyurdu: Eğer Yahudiler size selam verirlerse, onlardan selam veren kişi muhakkak: es-Samu aleykum der. Bunun için sen de: Ve aleyke, de. \" Bu Hadis 6928 numara ile de var",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 6258,
			"arabicnumber": 6258,
			"text": "Enes İbn Malik r.a.'dan dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: Kitap ehli size selam verdikleri vakit, siz de: Ve aleykum deyiniz. \" Bu Hadis 6926 numara ile de var. Fethu'l-Bari Açıklaması: \"Zimmet ehlinin selamı nasıl alınır?\" Bu başlıkta zimmet ehlinin selamının alınmasının yasaklanmadığına bir işaret bulunmaktadır. Bundan dolayı başlıkta \"nasıl\" tabirini kullanmıştır. Yüce Allah'ın: \"Ondan daha güzeli ile selamı alınız yahut aynen geri çeviriniz\" buyruğu da bunu desteklemektedir. İşte bu da selam almanın, -daha önce açıklandığı gibi- daha güzeli ile olmazsa dahi verilene uygun olması gerektiğinin delilidir. Hadis ise Müslüman ile kMirin selamının farklı şekillerde alınacağına deIildir. İbn Battal dedi ki: Bazıları ayetin genel ifadesi dolayısıyla zimmet ehlinin selamını almak farzdır, demişlerdir. İbn Abbas'tan da şöyle dediği sabittir: \"Birisi sana selam verecek olursa, Mecusi dahi olsa sen de onun selamını aL.\" eş-Şa'bı ve Katade de bu görüşü ifade etmişlerdir. Ancak Malik ve cumhur bunu kabul etmezler. Ata der ki: Ayet Müslümanlar hakkında özeldir. Dolayısıyla kayıtsız ve şartsız olarak kMirin selamını almaz. Eğer selamın alınmamasından maksadı, selam lafzı ile cevap vermek ise mesele yoktur. Aksi takdirde bu başlıktaki hadisler, onun görüşünü reddetniektedir. \"es-Samu aleyke, dediler.\" Daha önce Tıp bölümünde bu lafzın ölüm ile açıklandığına dair bilgiler geçmiş bulunmaktadır. \"Ve lanet\" Aişe r.anha'nın zekası sayesinde sözlerinden maksatlarını anlamış olduğundan onlara tepki göstermiş ve Nebi Sallallahu Aleyhi ve Sellem'in onların selam lafzını kullandıklarını sandığını kabul ettiğinden, onlara tepkisini ileriye götürmüş olması ihtimali vardır. Bunu İbn Ömer ve Enes'in rivayet ettiği başlıktaki iki hadiste olduğu gibi, Nebi Sallallahu Aleyhi ve Sellem'den daha önceden işitmiş olması da bir başka ihtimaldir. Aişe'nin onlara lanet okumasının sebebi ise, ya mevcut hal göz önünde bulundurularak, özellikle de tedib edilmesini gerektiren bir işi işlediği takdirde muayyen kafire lanet okumanın caiz olduğu görüşünde idi, yahut sözü geçen kimselerin küfür üzere öleceklerine dair daha önceden bilgi edininmiş olmasıdır. İşte bu sebeple ölüm kaydını söz konusu etmeden onlara mutlak olarak lanet okumuştur. Ama daha kuvvetli görülen o ki; Nebi Sallallahu Aleyhi ve Sellem, onun dilinin bu gibi ağır ifadeler kullanmaya alışmasını istememiş yahut ağır sözler söylemekte aşırı gitmesine tepki göstermiştir. Yaşayan muayyen müşrik kimseye lanet okumanın caiz olduğuna dair açıklamalar, yüce Allah'ın izniyle Dualar bölümünde \"müşriklere beddua etmek başlığında\" gelecektir. (Sk. 6395 nolu hadis)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 6259,
			"arabicnumber": 6259,
			"text": "Ali r.a. dedi ki: \"Rasulullah Sallallahu Aleyhi ve Sellem beni, ez-Zubeyr İbn el-Avvam'ı ve Ebu Mersed el-Ganevı'yi -ki hepimiz süvari idik- gönderip bize: Ravdatuhah denilen yere varıncaya kadar yola koyulun. Orada beraberinde Hatıb İbn Ebi Beltea'dan müşriklere yazılmış bir sahife bulunan müşriklerden bir kadın vardır, buyurdu. Ali r.a. dedi ki: Biz de onu bir devesi üzerinde yol alırken, Rasulullah Sallallahu Aleyhi ve Sellem'in bize dediği yerde yetiştik. Ona: Beraberindeki mektup nerede, diye sorduk. Kadın: Benimle birlikte mektup diye bir şey yoktur deyince, devesini çöktürdük, eşyasını araştırdık, hiçbir şey bulamadık. Diğer iki arkadaşım: Beraberinde mektup olduğu görüşünde değiliz, dediler. Ben: Andolsun Rasulullah Sallallahu Aleyhi ve Sellem'in yalan söylemediğini biliyorum. Adına and olunana yemin ederek söylüyorum ki, ya mektubu çıkartırsın yahut seni çınlçlplak soyarım, dedim. Kadın benim ciddi olduğumu görünce, elini beline götürdü. Beline bir kumaşı peştamal şeklinde bağlamıştı. Oradan mektubu çıkardı. Ali devamla dedi ki: Mektubu alıp Rasulullah Sallallahu Aleyhi ve Sellem'e götürdü k. Allah Rasulü: Ey Hatıb, seni yaptığın bu işe iten ne oldu, dedi. Hatıb: Ben sadece Allah'a ve Rasulüne iman eden birisiyim. Ne bir değişiklik yaptım, ne de değiştirdim. Ama onlara bir iyiliğim dokunsun ve Allah bu iyiliğim sayesinde aileme ve malıma gelecek zararı önlesin istedim. Senin ashabından orada Allah'ın kendileri vasıtasıyla ailesine ve malına gelecek zararı def edecek kimseleri bulunmayan hiçbir kişi yoktur, dedim. Allah Rasulü: Doğru söylüyor, ona hayırdan başka bir şey demeyiniz, buyurdu. Ali dedi ki: Bu sefer Ömer İbn el-Hattab: Şüphesiz ki o Allah'a, Rasulüne ve mu'minlere hainlik etmiştir. Beni bırak da boynunu uçurayım, dedi. Allah Rasulü bunun üzerine: Ey Ömer! Allah'ın Bedir'e katılanlara muttali olup: Dilediğinizi yapınız, size cennet vacip olmuştur, demediğini nereden biliyorsun, buyurdu. Ali r.a. dediki: Ömer'in gözleri yaşardı ve: Allah ve Rasulü daha iyi bilir, dedi.\" Fethu'l-Bari Açıklaması: \"Müslümanlar için sakınılması gereken şeylerin yazılı bulunduğu bir mektuba yazanın durumu açıkça ortaya çıksın diye bakan kimse.\" Buhari başkasına ait mektuba bakmayı yasaklamaya dair varid olmuş rivayetin, bakma kötülüğünden daha büyük bir kötülüğü önlemeye elverişli bakmanın, biricik yololması halinin, ondan ayrı ve özelolduğuna işaret ediyor gibidir. Sözü geçen bu eseri Ebu Davud, İbn Abbas'ın sözü olarak \"Kim kardeşinin mektubuna onun izni olmaksızın bakacak olursa, ateşe bakıyor gibidir\" lafzı ile olup senedi zayıftır. el-Mühelleb dedi ki: Ali'nin rivayet ettiği bu hadisten günahkarın örtülü halinin açığa çıkarılabileceği, isyankar kadının üstünün açılabileceği anlaşılmaktadır. Başkasına ait mektuba izni olmaksızın bakmanın caiz olduğuna dair gelen rivayet, ancak Müslümanlar aleyhine iş yapmakla itham olunmayan kimseler hakkında söz konusudur. Böyle bir itham ile karşı karşıya bulunan kimsenin ise bu açıdan herhangi bir saygınlığı yoktur. Yine hadisten anlaşıldığına göre bakman ın kaçınılmaz bir zaruret halini alması dolayısıyla kadının avretine bakmak caizdir",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 6260,
			"arabicnumber": 6260,
			"text": "Ebu Süfyan İbn Harb'den rivayete göre; \"Hirakl (Heraklius) Kureyş'ten birkaç kişi ile birlikte iken ona bir elçi göndermişti. -O sırada Şam'da tüccar olarak bulunuyorlardı.- Arkadaşlarıyla beraber Heraklius'un yanına gittiler -deyip hadisi zikretti.- Ebu Süfyan dedi ki: Sonra Rasulullah Sallallahu Aleyhi ve Sellem'in mektubunun getirilmesini istedi ve mektup getirilip okundu. Mektupta şu yazılı idi: \"Rahman, Rahim Allah'ın adı ile. Allah'ın kulu ve Rasulü Muhammed'den Rumiarın (Bizanslıların) büyüğü Heraklius'e. Selam hidayete tabi olanlara. Emma ba'du., ,II Fethu'l-Bari Açıklaması: \"Kitap ehline nasıl mektup yazılır?\" Buhari bu başlık altında Ebu Süfyan'ın, Heraklius ile ilgili olayı anlatan hadisinin bir bölümünü zikretmektedir. Hadisin başlığa delaleti gayet açıktır. İbn Battal dedi ki: Hadisten anlaşıldığına göre, kitap ehline yazılan mektupta bismillahirrahmanirrahim'i yazmak, mektubu yazanın adını kendisine yazılanın adından önce yazmak caizdir. Ayrıca hadiste ihtiyaç halinde kitap ehline selam yazmayı caiz kabul edenlerin lehine bir delil vardır. Derim ki: Mutlak olarak selam vermenin caiz olduğu tartışılır. Hadisin delalet ettiği, haberde olduğu şekilde kayıtlı olarak kullanılan selamdır. O da şöyledir: Selam hidayete tabi olanlara yahut: Selam hakka sımsıkı sarılanlar ya da buna benzer ifadeler ile kayıtlanır. İzin isteme bölümünün (yani bu bölümün) baş taraftarında bu husustaki görüş ayrılıklarına dair nakiller geçmiş bulunmaktadır",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 6261,
			"arabicnumber": 6261,
			"text": "Ebu Hureyre r.a.'dan rivayete göre; \"Rasulullah Sallallahu Aleyhi ve Sellem, İsrailoğullarından bir adam'ı sözkonusu etti. Bu adam bir kereste parçası alıp içini oymuş, içine bin dinar ile kendisinden arkadaşına hitaben bir mektup sahifesi koymuştu. Ömer İbn Ebi Seleme'nin babasından, onun da Ebu Hureyre'den rivayetine göre, Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: Bir adam bir ağaç parçasını yonttu ve malı onun içine yerleştirdi, o kişiye de: Filan kimseden filan kimseye, diye bir sahife (mektup) yazıp koydu.\" Fethu'l-Bari Açıklaması: \"Mektuba kimin adı yazılarak başlanır.\" Yani kendi adını mı yoksa mektup yazdığı kimsenin adını mı yazarak başlar? Buhari bu başlık altında İsrailoğullarından bin dinar borç almış bir adam ile ilgili hadisin bir bölümünü zikretmiştir. Sanki bu hususta kendi şartına göre merfu bir hadis bulmadığından bununla yetinmiş gibidir. Bu hadis, Buhari'nin bizden öncekilerin şeriatını bizim şeriatimızda nakledilip reddolunmamışsa delil olarak kullanılabileceği şeklinde kabul ettiği kaidesine de uygundur. Özellikle de bizden öncekilerin şeriatindeki bu olay, yapanın övüldüğü bir surette nakledilmesi halinde böyledir. Bu hadiste delilolacak taraf, borçlu olan kimsenin mektubuna \"filan kimseden filan kimseye\" diye yazmış olmasıdır. Buhari'nin Nebi Sallallahu Aleyhi ve Sellem'in az önce işaret olunan Heraklius'a gönderdiği mektubu delil göstermesi mümkün olmakla birlikte, bunu büyük olan zatın küçüğe, azametli olan birisinin ise öyle olmayana mektup yazarken kendi adını yazması esası dolayısıyla delil göstermemiş olabilir. Ama durumun aksi ya da eşit olması halinde tereddüt söz konusu olur. Buhari, el-Edebu'l-Müfred adlı eserinde Harice İbn Zeyd İbn Sabit yoluyla Zeyd İbn Sabit hanedanının büyüklerinden: \"Bu mektup Allah'ın kulu, mü minlerin emiri Muaviye'nin Zeyd İbn Sabit'e mektubudur. Selam olsun sanal diye bir rivayet kaydetmiş bulunmaktadır. İbn Ömer'den de buna yakın bir rivayet nakletmiştir. Ebu Davud da İbn Sirin yoluyla Ebu'l-Ala İbn Hadrami'den, onun el-Ala'dan rivayet ettiğine göre o, Muhammed Rasulullah'a diye mektup yazmıştır. Naf!'den rivayete göre de İbn Ömer, kölelerine kendisine mektup yazdıkları takdirde kendi isimlerini zikretmekle başlamalarını emrederdi. Naf!'den yine rivayete göre Ömer'in gönderdiği görevliler ona mektup yazdıkları takdirde önce kendi adlarını yazarlardı. el-Mühelleb dedi ki: Sünnet olan, yazanın önce kendi adını yazarak başlamasıdır. Mamer'den, onun Eyyub'dan rivayetine göre bazen mektup yazdığı adamın adını kendi adından önce yazardı. Bu hususta Malik'e sorulan soru üzerine o: Bunda bir sakınca yoktur demiş ve şunları eklemiştir: Bu dışarıdan gelen bir kimseye mecliste yer açmaya benzer. Ona: Irak ehli senden önce kimsenin adını yazarak başlamaz, isterse bu kişi baban annen yahut senden daha büyük olsun diyorlar denilince, bunların böyle yapmalarını ayıpladı. Derim ki: İbn Ömer'den nakledilen onun çoğu hallerinde görülen durumdur. Yoksa Buhari el-Edebu'l-Müfred adlı eserinde sahih bir senedie Naf!'den şunu rivayet etmiştir: İbn Ömer'in, Muaviye'nin yanında görülecek bir ihtiyacı vardı. Önce kendi adını yazmak istedi. Etrafındakiler ona ısrar edip durdular, sonunda: Bismillahirahmanirrahim Muaviye'ye diye mektup yazdı. Yine el-Edebu'l-Müfred'de Abdullah İbn Dinar'ın bir rivayeti olarak Abdullah İbn Ömer'in, Abdulmelik'e bey'at etmek üzere şu şekilde mektup yazdığı nı rivayet etmektedir: \"Bismillahirrahmanirrahim. mu'minlerin emiri Abdulmelik'e, Abdullah İbn Ömer'den selam olsun sana",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 6262,
			"arabicnumber": 6262,
			"text": "Ebu Said'den rivayete göre; \"Kureyzalılar Sa'd'in hükmünü kabul ederek kalelerinden indiler. Nebi Sallallahu Aleyhi ve Sellem bu sebeple ona haber gönderdi, o da geldi. Gelince Allah Rasulü: Seyyidiniz için -yahut: en hayırlınız için, dedi- ayağa kalkınız, buyurdu. Nebi Sallallahu Aleyhi ve Sellem'in yanına oturdu. Allah Rasulü ona: Bunlar (Kureyzalılar) senin hükmünü kabul ederek kalelerinden indiler buyurdu. Sa'd İbn Muaz: Ben onların savaşçılarının öldürülmesine, kadın ve çocuklarının esir edilmesine hüküm veriyorum, dedi. Bunun üzerine Allah Rasulü: Andolsun sen me lik olan (Allah)ın vermiş olduğu hüküm ile hükmettin, buyurdu.\" Fethu'l-Bari Açıklaması: İbn Battal dedi ki: Bu hadiste İmam-ı A'zam'ın (en büyük imamın yani İslam devlet başkanının) Müslümanlar arasında büyük şahsiyete, ikrama dair emir verebileceği ve en büyük imamın meclisinde fazilet ehli kimselere ikramda bulunmanın, Nebi efendimizin dışında ashabından bazı kimseler için de ayağa kalkmanın, bütün insanları da aralarındaki büyük bir şahsiyet için ayağa kalkmaya zorlamanın meşru bir iş olduğu anlaşılmaktadır. Bununla birlikte bazı kimseler bunu yasak kabul etmişlerdir. Ayrıca bu kanaatte olanlar Abdullah İbn Bureyde'nin rivayet ettiği şu hadisi de delil gösterirler: Buna göre onun babası (Bureyde) Muaviye'nin huzuruna girerek ona Nebi Sallallahu Aleyhi ve Sellem'in: \"Her kim, adamların önünde ayağa kalkmalarını severse cehennem ateşi ona vacip olur\" buyurduğunu haber vermiştir. Taberi buna şöylece cevap vermiştir: Bu haberde kendisine ayağa kalkılmasından dolayı sevinmek yasaklanmaktadır. Yoksa kendisine ikram olsun diye kalkanların bu kalkışı yasaklanmamıştır. İbn Kuteybe de buna şöyle cevap vermiştir: Bu, Acem krallarının önünde ayakta durulduğu gibi, başı ucunda adamların durmasını isteyen kimseler içindir. Yoksa maksat kişinin, kendisine selam veren kardeşi için ayağa kalkmasının nehyedilmesi değildir. İbn Battal bunun caiz oluşuna Nesai'nin Talha kızı Aişe yoluyla Aişe r.anha'dan rivayet ettiği şu hadisi delil göstermiştir: \"Rasulullah Sallallahu Aleyhi ve Sellem kızı Fatıma'nın geldiğini görünce, ona sevinçle: Hoş geldin der, sonra kalkıp onu öper, daha sonra kendi yerinde onu oturtuncaya kadar elinden tutard!.\" Derim ki: Aişe r.anha'nın rivayet ettiği bu hadisi Ebu Davud, hasen olduğunu belirterek Tirmizi, sahih olduğunu belirterek İbn Hibban ve Hakim rivayet etmişlerdir. Bunun aslı da daha önce Menakıb bölümünde ve Nebi Sallallahu Aleyhi ve Sellem'in vefatı bahsinde geçtiği üzere, Sahih-i Buhari'de yer almaktadır. Ama Buhari'deki rivayette ayağa kalkış, söz konusu edilmemiştir. İmam Malik'ten yapılan bu nakillerden anlaşıldığına göre; kendisi için kalkılan kişi, -kendi özel işiyle uğraşıyor olsa dahi- oturmadığı sürece kalkanın oturmamaya devam etmesi uygun görülmemiştir. Çünkü ona kocasına ikramda ileriye giderek kocasını karşılayıp elbiselerini çıkartarak oturuncaya kadar ayakta bekleyen kadının durumu hakkında soru sorulunca şu cevabı vermiştir: Onu karşılamakta bir sakınca yoktur; ama o oturuncaya kadar ayakta beklemesi uygun değildir. Çünkü bu zorbaların uygulamalarındandır. Ömer İbn Abdulaziz de böyle bir şeyi kabul etmemiştir. el-Hattabi de başlıktaki hadis ile ilgili olarak şunları söylemektedir: Hadisten anlaşıldığına göre hayırlı ve faziletli kimseye \"seyyid\" demek caizdir. Yine bu hadisten yönetilenkimsenin fazilet sahibi yönetici başkanı için, adaletli imam için ve öğrencinin alim için ayağa kalkmasının müstehab olduğu anlaşılmaktadır. Bu niteliklere sahip olmayan kimseler için ayağa kalkmak mekruhtur. \"Kendisi için ayağa kalkılmasını seven kimse\" hadisinin anlamına gelince: Büyüklenmek ve gurur yapmak suretiyle saflar halinde başkalarını ayakta durmaya zorlamaktır. el-Münziri az önce kaydedilen İbn Kuteybe ve Buhari'den nakledilen hadislerin bir arada telif edilmesi ile ilgili açıklamalarını ve yasaklanan ayakta durmanın, kendisi oturduğu halde huzurunda ayakta durulmasını istemek olduğunu tercih etmiştir. İbnu'l-Kayyim ise \"Sünen Haşiyesi\"nde bu görüşü, Muaviye ile ilgili hadisin akışının bunun abine delil teşkil ettiğini belirterek reddetmekte ve Bureydelnin, Muaviye dışarı çıkınca ona tazim olsun diye ayağa kalkılmasını hoş karşılamadığını söylemektedir. Çünkü böyle bir ayağa kalkış için (Arapçada) adam için ayağa kalkmak denilmez. Buna kişinin başı ucunda yada yanında ayakta durmak (beklemek) denir. (Devamla) der ki: Ayakta duruşun üç mertebesi vardır: Kişinin başı ucunda ayakta beklemek -ki bu zorbaların işidir-, kişi gelirken ayağa kalkmak -bunda da bir sakınca yoktur-, kişiyi görünce onun için ayağa kalkmak. İşte hakkında görüş ayrılığı bulunan kalkma da budur. Derim ki: Oturan büyük bir zatın baş ucunda ayakta durmak hususuna dair Taberanilnin el-Evsat'ta zikrettiği şu rivayet varid olmuştur: Eneslden dedi ki: \"Şüphesiz sizden öncekilerin helak oluş sebebi, hükümdarları otururken kendileri ayakta durarak hükümdarlarını tazim edişleridir.\" Daha sonra el-Münziri bunu mutlak olarak kabul etmeyen bazı kimselerin bu husustaki delili şunu gerekçe göstererek reddettiğini nakletmektedir: Said'in olayında Nebi Sallallahu Aleyhi ve Sellemlin onlara Said için ayağa kalkmalarını emrediş sebebi, hasta olduğundan ötürü onu eşeğin üzerinden indirmeleri için idi. Nevevı de kıyam (ayağa kalkmak) bölümünde bunu delil göstermiş, Buhari, Müslim ve Ebu Davud'un da bunu delil gösterdiklerini söylemiştir. Müslimlin lafzı da: Bir kimsenin bir diğeri için ayağa kalkması hususunda bundan daha sahih bir hadis bilmiyorum, şeklindedir. Ancak Şeyh Ebu Abdullah İbn el-Hac ona itiraz ederek özetle şöyle demiştir: Eğer Said için emrolunan ayağa kalkmak, anlaşmazlık konusunu teşkil eden husus olsaydı, bu emri özelolarak ensara vermezdi. Çünkü Allah'a yakınlaştırıcı fiillerde aslolan geneloluştur. Şayet Said için ayağa kalkmak iyilik ve ikram yoluyla olsaydı, hiç şüphesiz bunu ilk yapan kişi Nebi Sallallahu Aleyhi ve Sellem'in kendisi olur ve hazır bulunan ashabın büyüklerine de bunu yapmalarını emrederdi. Allah Rasulü s.a.v. bunu emretmediğine, bizzat kendisi de yapmadığına, onlar da bu işi yapmadıklarına göre; bu, ayağa kalkma emrinin, hakkında anlaşmazlığa düşülen husustan farklı olduğunun delilidir. Bu emir ancak onu bineğinden indirmeleri için verilmiştir. Çünkü bazı rivayetlerde belirtildiği üzere hastalığı sebebiyle bu emri vermiştir. Daha sonra Ebu'l-Velid İbn Rüşd'den şu bilgileri nakletmektedir: Ayağa kalkmanın dört çeşidi vardır: 1- Yasak olan kalkış. Bu da huzurunda ayakta duranlara karşı tekebbür ve azametli görünüş için kendisi için ayağa kalkılmasını isteyen kimseler için ayakta duruş hakkındadır. 2- Mekruh olan ayakta durmak: Bu da ayakta duranlara karşı büyüklenmeyen ve kendisini azametli göstermeyen, bununla birlikte bundan dolayı sakınılması gereken duyguların nefsini etkileyeceğinden korkulan kimse için ve zorbalara benzeyiş ihtiva ettiği için söz konusudur. 3- Caiz olan ayakta duruş: Bu da böyle bir şeyi istemeyen, bununla birlikte zorbalara benzemek istemediğinden emin olunan kimseler için iyilik ve ikramda bulunmak üzere sözkonusu olandır. 4- Mendub olan ayağa kalkmak: Yolc$ktan gelen kimsenin gelişine sevinerek ona selam vermek maksadıyla yahut yeni bir nimete mazhar olan kimseyi o nimeti elde ettiği için tebrik etmek ya da bir musibet ile karşı karşıya kalan kimseyi bundan dolayı taziye ve teselli etmek amacıyla ayağa kalkış",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 6263,
			"arabicnumber": 6263,
			"text": "Katade'den dedi ki: \"Enes'e: Nebi Sallallahu Aleyhi ve Sellem'in ashabı arasında musafaha var mıydı ,diye sordum. O: Evet, dedi",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 6264,
			"arabicnumber": 6264,
			"text": "Abdullah İbn Hişam'dan dedi ki: \"Biz Nebi Sallallahu Aleyhi ve Sellem ile birlikte iken o da Ömer İbn el-Hattab'ın elinden tutmuş bulunuyordu.\" Fethu'l-Bari Açıklaması: \"Musafaha\" Musafaha lafzı \"es-safha\" lafzından mufaale vezninde bir kelimedir. Bundan maksat ise elin avucunun diğerinin elinin avucunu tutmasıdır. Musannıf (Buhari) el-Edebu'l-Müfred adlı eserinde ve Ebu Davud sahih bir senedie Eneslden Nebie merfu olarak: \"İşte Yemen halkı gelmiş bulunuyor. Onlar bizi musafaha yaparak ilk selamlayan kimselerdir\" diye buyurdu. İbn Battal dedi ki: Musafaha genelolarak bütün alimlere göre güzel görülmüştür. Malik önceleri bunu mekruh görürken, sonraları müstehap olduğu görüşünü kabul etmiştir. Nevev! de: Musafahanın karşılaşma esnasında sünnet olduğu icma' ile kabul edilmiştir, demektedir. Derim ki: Musafahaya dair emrin genel çerçevesinden yabancı kadın ve tüysüz güzel çocuklar müstesnadırlar",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 6265,
			"arabicnumber": 6265,
			"text": "İbn Mes'ud'dan dedi ki: \"Rasulullah Sallallahu Aleyhi ve Sellem, -elim onun iki eli arasında olduğu halde- Kur'an'dan bir sureyi öğretireesine bana teşehhüdü şöylece öğretti: et-Tahiyyatu lillahi vessalavatu vettayyibat; esselamu aleyke eyyuhennebiyyu ve rahmetullahi ve berekatuh; esselamu aleyna ve ala ibadillahissalihln. Eşhedu en la ilahe illallah ve eşhedu en ne Muhammeden abduhu ve rasuluh: Bütün esenlik dilekleri, güzel dualar ve övgüler yalnız Allah'ındır. Ey Nebi! Selam sana, Allah'ın rahmetleri ve bereketleri de üzerine olsun. Selam bizim ve Allah\\n salih kullarının üzerine. Şehadet ederim ki Allah'tan başka hiçbir ilah yoktur ve yine şehadet ederim ki Muhammed onun kulu ve Rasulüdür. Allah Rasulü, aramızdayken biz böyle derdik. Ama ruhu kabzedildikten sonra esselamu alennebiyyi demeye başladık.\" Fethu'l-Bari Açıklaması: İbn Battal dedi ki: Eli tutup yakalamak, musafahanın ileri derecesidir. İlim adamlarına göre bu müstehabtır. Ama elin öpülmesi hususunda görüş ayrılıkları vardır. Malik hem bunu, hem de bu hususta gelen rivayetleri kabul etmemiştir. Başkaları ise el öpmeyi caiz kabul etmiş ve Ömer'den gelen şu rivayet i delil göstermişlerdir: \"Düşmanın önünden kaçtıkları gazadan Medine'ye geri döndüklerinde, biz savaş kaçkınlanyız, demişlerdi. Allah Rasulü s.a.v. ise: Hayır, aksine sizler (taktik gereği geri çekilip) tekrar hücum edenlersiniz. Ben mu'minlerin kendisine sığındığı birlikleriyim, buyurdu. Ömer dedi ki: Biz de onun elini öptük.\" (İbn Battal devamla) dedi ki: \"Ebu Lubabe, Ka'b İbn Malik ve iki arkadaşı Allah tevbelerini kabul edince, Nebi Sallallahu Aleyhi ve Sellem'in elini öpmüştür.\" Bunu el-Ebheri' zikretmiş bulunmaktadır. Ebu Ubeyde de Medine'ye geldiğinde, Ömer r.a.'ın elini öpmüştü. Zeyd İbn Sabit de İbn Abbas bineğinin özengisini tutunca, İbn Abbas'ın elini öpmüştü. el-Ebheri' dedi ki: Malik'in el öpmeyi mekruh görmesi, tekebbür ve kendisini azametli görmek suretinde olması halindedir. Ama dinine bağlılığı, ilmi yada şerefi dolayısıyla Allah'a yakınlık isteği ile bir kimsenin elini öperse, bu caizdir. İbn Battal dedi ki: Tirmizi'nin Safvan İbn Assal yoluyla gelen hadisteki rivayetine göre; \"İki Yahudi Nebi Sallallahu Aleyhi ve Sellem'e gelip ona dokuz alamete dair soru sordular...\" hadisini zikretmekte ve hadisin sonunda: \"iki Yahudi onun elini, ayağını öptüler\" denilmektedir. Tirmizi de: Bu hasen, sahih bir hadistir, demiştir. Derim ki: İbn Ömer hadisini Buhari, el-Edebu'l-Müfred'de ve Ebu Davud rivayet etmişlerdir. Ebu Lubabe ile ilgili hadisi Beyhaki ed-Delail'de ve İbnu'lMukri rivayet etmişlerdir. Ka'b ve iki arkadaşına dair hadisi İbnu'l-Mukri', Ebu Ubeyde ile ilgili hadisi Cami'inde Süfyan, İbn Abbas ile ilgili hadisi Taberi ve İbnu'l-Mukri, Safvan ile ilgili hadisi de Nesai, İbn Mace ve sahih olduğunu belirterek el-Hakim rivayet etmişlerdir. Hafız Ebu Bekir İbnu'l-Mukri bizim de sema yoluyla aldığımız \"el öpme\"ye dair bir cüz toplamış olup, bunda pek çok hadis ve eseri kaydetmiş bulunmaktadır. Bu husustaki hadislerin en ceyyidlerinden birisi de ezZari' el-Abdi' ile ilgili hadistir. Bu zat Abdulkays heyetinde bulunuyordu. O şöyle demiştir: \"Biz kaldığımız yerlerden alelacele gidip Nebi Sallallahu Aleyhi ve Sellem'in elini ve ayağını öpmeye koyulduk.\" Usame İbn Şerik rivayet, ettiği hadiste şöyle demektedir: \"Kalkıp, Nebi Sallallahu Aleyhi ve Sellem'in elini öptü.\" Hadisin senedi kavidir. Cabir'in rivayet ettiği hadiste de \"Ömer, kalkıp Nebi Sallallahu Aleyhi ve Sellem'in elini öptü\" demektedir. Nevevi' dedi ki: Bir adamın zahidliği ve salih bir kimse oluşu sebebiyle yahut ilmi, şerefi, kendisini haramlardan koruması ve buna benzer dini sebepler için elini öpmek, mekruh değildir, hatta müstehabtır. Eğer zenginliği, gücü kuweti ya da dünya ehli nezdindeki makam ve mevkii dolayısıyla olursa, ileri derecede mekruhtur. Ebu Said el-Mütevelll ise: Caiz olmaz, demiştir",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 6266,
			"arabicnumber": 6266,
			"text": "Abdullah İbn Abbas'tan rivayete göre, \"Ali İbn Ebi Talib r.a., Nebi Sallallahu Aleyhi ve Sellem'in vefatı ile sonuçlanan rahatsızlığı esnasında Nebiin yanından çıktı. İnsanlar: Ey Ebu'l-Hasen, Rasulullah Sallallahu Aleyhi ve Sellem nasıl sabahladı, diye sordular. Ali: Allah'a hamdolsun iyileşmiş olarak sabahı etti, dedi. el-Abbas onun elinden yakalayarak: Sen onu görmüyor musun? Allah'a yemin ederim ki, sen üç gün sonra asanın kulu olacaksın. Allah'a yemin ederim ben Rasulullah Sallallahu Aleyhi ve Sellem'in bu hastalığı sonunda vefat edeceği görüşündeyim. Çünkü ben Abdulmuttalib oğullarının ölümlerinin yaklaştığını yüzlerinin halinden anlarım. Haydi kalk, seninle Rasulullah Sallallahu Aleyhi ve Sellem'in yanına gidelim de ona ondan sonra işin kimin hakkı olacağına dair soru soralım. Eğer bu iş bize ait olacaksa bunu öğrenmiş oluruz, eğer bizden başkasına ait olacaksa, ondan o kimselere hakkımızda tavsiyede bulunmasını isteriz, dedi. Ali: Allah'a yemin ederim eğer biz bu işi Rasulullah Sallallahu Aleyhi ve Sellem'e sorsak, o da bu işi bize vermeyecek olursa, insanlar da o işi bizi ebediyen vermeyecektir. Gerçek şu ki ben bu hususu ebediyen Rasulullah Sallallahu Aleyhi ve Sellem'e sormayacağım, dedi.\" Fethu'l-Bari Açıklaması: \"Mu'anaka (birbirinin boynuna sarılmak) ve kişinin: Nasıl sabahı ettin, diye sormas!.\" İbn Battal dedi ki: İnsanlar mu'anaka hususunda görüş ayrılığı içindedirler. Malik bunu mekruh görmüş, İbn Uyeyne ise caiz kabul etmiştir. el-Mühelleb dedi ki: el-Abbas'ın, Ali'nin elinden tutması, musafahanın caiz oluşuna, hasta olan kimsenin durumunu: Nasıl sabahı etti, diye sormanın da caiz oluşuna delil olduğu gibi, zann-ı galibe dair yemin etmenin caiz oluşuna dair delil de ihtiva eder. İbnu't-Tin'in naklettiğine göre ed-Davudi: \"Nasıl sabahı ettin\" tabirini insanlar ilk olarak Amevas TaCıriu esnasında kullandıklarını söylemiştir. Ancak ona Arapların bunu İslamdan önce de söyledikleri ve Müslümanların da bu hadiste belirtildiği üzere bunu kullandıkları belirtilerek itiraz edilmiştir. Derim ki: Buna şöyle cevap verilir: Öncelik, İslam döneminde meydana gelen hakkında yorumlanır. Çünkü İslam, karşı karşıya gelen kimselerin selamlaşmalarını teşri buyurmuştur. Daha sonra da halinin nasılolduğuna dair soru sormak, ortaya çıkmıştır. Her ikisini bir arada kullanan da çok az idi. Sünnet olan da selam ile söze başlamaktır. Buna (nasıl sabahı ettin, diye sormaya) sebep de görüldüğü kadarıyla meydana gelen Taun hastalığı idi. Bu hastalık sebebiyle kişinin arkadaşına halini sormasını gerektiren sebepler ortaya çıkmış oldu",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 6267,
			"arabicnumber": 6267,
			"text": "Enes'den rivayete göre; \"Muaz (İbn Cebel) dedi ki: Ben Nebi Sallallahu Aleyhi ve Sellem'in arkasında binek üzerinde iken Allah Rasulü: Ey Muaz, dedi. Ben: Lebbeyke ve sa'deyk, dedim. Sonra bunun benzerini üç defa tekrarladı. (Devamla şöyle buyurdu): Allah'ın kulları üzerindeki hakkının ne olduğunu biliyor musun? Ben: Hayır deyince, o: Allah'ın kulları üzerindeki hakkı, ona hiçbir şeyi ortak koşmaksızın ibadet etmeleridir, buyurdu. Daha sonra bir süre yol aldı ve: Ey Muaz, dedi. Ben: Lebbeyke ve sa'deyk, dedim. O: Eğer kullar bunu yapacak olurlarsa Allah'ın üzerindeki haklarının ne olduğunu biliyor musun? Onları azap etmemesidir, buyurdu",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 6268,
			"arabicnumber": 6268,
			"text": "Zeyd İbn Vehb'den: \"Allah'a yemin ederim. Bize Ebu Zer' Rebeze'de iken tahdis ederek dedi ki: Medine'nin Harre denilen bölgesinde yatsı vakti Nebi Sallallahu Aleyhi ve Sellem ile birlikte yürüyor idim. Karşımıza Uhud dağı gelince: Ey Ebu Zerr! Uhud dağı kadar altınım olup da üzerimden iki yahut üç gece geçtikten sonra yanımda bir borç için alıkoyacağım miktar dışında, tek bir dinarın dahi kalmasını sevmem. Ancak onu Allah'ın kulları arasında şöyle ve şöyle yapmak isterim -deyip, eliyle bize gösterdi.- Sonra: Ey Ebu Zerr, buyurdu. Ben: Lebbeyke ve sa'deyk, ey Allah'ın Rasulü, dedim. O: Daha çok olanlar daha az olacak olanlardır. Şöyle ve şöyle yapan müstesna, buyurdu. Sonra da bana: Yerinde dur ey Ebu Zerr, ben geri dönünceye kadar buradan ayrılma, deyip gitti, nihayet onu göremez oldum. Sonra bir ses işittim. Rasulullah Sallallahu Aleyhi ve Sellem'in başına bir şey gelmiş olduğundan korktum. Bu sebeple gitmek istedim, sonra Rasulullah Sallallahu Aleyhi ve Sellem'in bana: Yerinden ayrılma, dediğini hatırlayınca yerimde durdum. (Daha sonra ona): Ey Allah'ın Rasulü, ben bir ses işittim ve başına bir iş geldiğinden korktum. Sonra bana söylediğini hatırlayınca yerimde kaldım, dedim. Nebi Sallallahu Aleyhi ve Sellem: O Cibril idi, bana geldi ve bana: Kim benim ümmetimden Allah'a hiçbir şeyi ortak koşmaksızın ölürse cennete gireceğini haber verdi, dedi. Ben: Ey Allah'ın Rasulü, zina etse ve hırsızlık etse dahi mi, dedim. Allah Resulü: Zina da etse, hırsızlık da etse, buyurdu.\" (Hadisi Zeyd'den rivayet eden A'meş) dedi ki: Ben Zeyd'e: \"Bana bunun Ebu'd-Derda olduğu haberi ulaştı deyince, Zeyd İbn Vehb: Şehadet ederim ki bu hadisi bana Ebu Zerr, er-Rebeze'de iken tahdis etti, dedi.\" Fethu'l-Bari Açıklaması: \"Çağırana, lebbeyke ve sa'deyk diye karşılık veren.\" Bu başlıkta Enes'in Muaz'dan diye rivayet ettiği: \"Ben Nebi Sallallahu Aleyhi ve Sellem'in arkasına binmiş idim. Bana: Ey Muaz dedi, ben de: Lebbeyke ve sadeyk diye cevap verdim\" şeklindeki hadisini zikretmiş bulunmaktadır. Bu iki sözün (Iebbeyke ve sa'deyk kelimelerinin) açıklaması Hac bölümünde geçmiştir. Muaz'ın rivayet ettiği bu hadisin bir kısmının açıklamaları da İlim ve Cihad bölümlerinde geçmiş idi. Yeteri kadar diğer açıklamaları da Rikak bölümünde(6500 nolu hadiste) gelecektir. Bu sözleri (Iebbeyke ve sa'deyk sözlerini) Nebi Sallallahu Aleyhi ve Sellem'in bizzat söylediği de varid olmuştur. Nesai, sahih olduğunu belirterek İbn Hibban, Muhammed İbn Hatıb'dan gelen bir hadis olarak şöyle dediğini nakIetmektedirler: \"Ben ve annem oturan.bir adamın yanına gittik. Annem ona: Ey Allah'ın Resuıü dedi, o da: Lebbeyki ve sadeyki diye cevap verdi",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 6269,
			"arabicnumber": 6269,
			"text": "İbn Ömer r.a.'dan rivayete göre; \"Nebi Sallallahu Aleyhi ve Sellem: Bir kişi bir başkasını oturduğu yerden kaldırıp sonra da kendisi oraya oturmaz, buyurdu.\" Diğer tahric edenler: Tirmizi Edeb; Müslim: Selam",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 6270,
			"arabicnumber": 6270,
			"text": "İbn Ömer'den rivayete göre; \"Nebi Sallallahu Aleyhi ve Sellem, bir adamın oturduğu yerden kaldırılarak diğerinin onun yerine oturmasını nehyetmiştir; ama \"yer açınız, genişletiniz\" diye buyurmuştur.\" İbn Ömer de bir kimsenin oturduğu yerden kalktıktan sonra bir başkasının yerine oturtulmasını hoş görmezdi. Fethu'l-Bari Açıklaması: \"Yüce Allah'ın: \"Size yer açın, denildiğinde genişletin ki, Allah da size genişlik versin ... \"(Mücadele, 11) buyruğu.\" Ayetin anlamı ile ilgili olarak farklı görüşler vardır. Bunun Nebi Sallallahu Aleyhi ve Sellem'in bulunduğu meclise has olduğu söylenmiştir. İbn Battal dedi ki: Bazıları burada söz konusu edilen özellikle Nebi Sallallahu Aleyhi ve Sellem'in meclisidir, demişlerdir. Bu açıklama Mücahid ve Katade'den nakledilmiştir. Derim ki: Taberani'nin, Katade'den diye naklettiği şu şekildedir: Nebi Sallallahu Aleyhi ve Sellem'in meclisinde (yanında oturmak için) onun geldiğini gördüklerinde birbirleriyle yarış ıri ar ve oturdukları yerlerde darlık olurdu. Bu sebeple yüce Allah onlara birbirleri için yer genişletmelerini emretti. Derim ki: Bununla birlikte bu hususta ayetin özelolarak Nebi Sallallahu Aleyhi ve Sellem'in meclisi ile ilgili olduğunu anlamak gerekmemektedir. el-Hasen el-Basri 'den şöyle dediği nakledilmiştir: Bundan maksat savaş meclisidir. Yüce Allah'ın: \"Kalkın\" buyruğunun anlamı da savaş için kalkın demektir. Cumhurun görüşüne göre ayet, hayır meclislerinin bütün çeşitleri hakkında geneldir. Yüce Allah'ın: \"Genişletin ki, Allah da size genişlik versin\" buyruğu siz genişletirseniz Allah da dünya ve ahirette size genişlik verir, demektir. \"O, bir adamın oturduğu yerden kaldırılıp oraya bir başkasının oturmasını nehyetmiştir.\" Hadisi Müslim: \"Adam bir başkasını oturduğu yerden kaldırıp sonra kendisi oraya oturmasın\" diye rivayet etmiştir. \"Ama yer açınız, genişlik veriniz, derdi.\" el-İsmai!l bunu Kabisa'dan gelen bir rivayet olarak kaydetmiş olmakla birlikte, onda \"desin\" ifadesi bulunmamaktadır. Müslim ise bu fazlalığı münferid olarak Ubeydullah İbn Ömer'in Nafl'den diye rivayet etmiş olduğuna işaret etmiştir. Malik, Leys, Eyyub ve İbn Cüreyc de bu hadisi bu fazlalık olmaksızın Nafi'den diye rivayet etmişlerdir. İbn Cüreyc şunu eklemektedir: Ben Nafi'e: (Bu) Cuma namazı hakkında mıdır, diye sordum. O: Cuma namazı hakkında da, başkası hakkında da aynı şeydir, dedi. İbn Ebi Cemra dedi ki: Bu lafız bütün meclisler hakkında umumidir ama ya mescidler, hakimlerin meclisleri ile ilim meclisleri gibi umumi meclisler hakkında yahut muayyen birtakım kimseleri bir eve ziyafet ve benzeri bir maksatla davet eden kimsenin meclisinde olduğu gibi özel meclisler hakkındadır. Devamla dedi ki: Bu yasağın hikmeti, kinlerin ortaya çıkmasına sebep olan Müslümanın hakkını kısmanın yasaklanmasıdır ve karşılıklı sevgiyi gerektiren alçak gönüllülüğe bir teşviktir. Aynı şekilde mubah olan hususlarda bütün insanlar birbirine eşittir. Bundan dolayı herhangi bir şeyi öncelikle elde eden ona hak kazanır. Bir şeyi hak eden bir kimse ise, eğer o şeyden hakkı olmayan bir şey alacak olursa o aldığı haksız şey bir gasptır, gasp ise haramdır. Buna göre bu gibi tutumların bir kısmı mekruh, bir kısmı haram dahi olabilir. Hadisteki \"yer açın, genişlik verin\" ifadesine gelince, birincisi kendi aralarında yeri açıp genişletmeleri anlamında, ikincisi ise birbirlerine daha da yaklaşarak içerideki topluluğun dışarıdan giren kimselere oturacak yer açmaları anlamındadır. --- İbn Ebi Cemra'dan özetle iktibas burada sona ermektedir. --- \"Adamın oturduğu yerden kalkıp sonra da yerine başkasını oturtmayı hoş görmezdi.\" Bu hadisi Buhari el-Edebu'I-Müfred'de şu lafızIa rivayet etmiştir: \"İbn Ömer için bir adam oturduğu yerden kalkacak olursa, onun kalktığı yere oturmazdı.\" İbn Battal dedi ki: Bu husustaki yasağın hükmü hakkında görüş aynlığı vardır. Bunun edeb için emredildiği söylenmiştir. Yoksa alim kimse için ön görülen, anlayışlı ve akıl sahibi kimselerin etrafında bulunmalarıdır. Bunun zahiri üzere olduğu da söylenmiştir. Dolayısı ile mubah olan bir meclise daha önce gelmiş olan kimsenin kaldırılması caiz olmaz. Bu görüşün sahipleri hadisi yani Müslim'in, Ebu Hureyre'den rivayet ettiği şu merfu hadisi delil göstermişlerdir: \"Sizden biriniz meclisinden kalkıp da sonra o meclise geri dönerse, o oturduğu yere başkasına göre daha bir hak sahibidir.\" Bu görüşte olanlar derler ki: Döndükten sonra oturduğu yere daha çok hak sahibi olduğuna göre, kalkmadan önceki hakkı sabit demektir. Ayrıca bu az önce belirtilen İbn Ömer'in uygulaması ile de desteklenmektedir. Çünkü hadisi rivayet eden odur, hadisten neyin kastedildiğini de en iyi o bilir. Bunun edeb için olduğu açıklamasını yapanlar da şöyle cevap vermişlerdir: Oturulan yer aslında oturmadan önce de, oradan ayrıldıktan sonra da onun mülkü değildir. O halde burada hak sahibi oluşta kastedilen, öncelikle oturma halidir. Buna göre orayı terk edip kalkan bir kimsenin oturduğu yerdeki hakkı, büsbütün ortadan kalkar, ama dönmek üzere kalkan kimsenin ise başkasına göre öncelik hakkı vardır. İmam Malik'e, Ebu Hureyre'nin hadisine dair soru sorulunca, o: Ben onu işitmedim. Bununla birlikte eğer kısa zamanda geri dönecek olursa güzeldir, uzun zaman geçtikten sonra dönerse onun böyle bir hakka sahibi olduğu görüşünde değilim, ama bu güzel ahlak kabilindendir, demiştir. Kurtubi de el-Mufhim adlı eserinde şöyle demektedir: Bu hadis, oturan kimsenin oturduğu yerden kalkıncaya kadar o yerin özelolarak kendisine ait oluşunu vacip kabul eden görüşün doğru olduğuna delil teşkil etmektedir. Oturulan yer oturanın önceden de, sonradan da mülkü olmadığından bunu edeb öğretmek için kabul edenlerin gösterdikleri delil ise delil sayılmaz. Çünkü bizler oranın o kişinin mülkü olmadığını kabul ediyoruz ama maksadını gerçekleştirinceye kadar orası ona mahsustur. Bundan dolayı oranın menfaatine malik olmuş gibidir. Bu sebeple bu hususta başkası onunla çekişemez. Nevevi dedi ki: Bizim mezhebimize mensup ilim adamlarımız der ki: Bu, mescidde yahut bir başka yerde -mesela, namaz kılmak maksadıyla- oturan kimse hakkındadır. Böyle birisi bu yerden tekrar oraya dönmek maksadıyla -mesela, ab de st almak istemek yahut kısa süren bir iş görmek için- ayrılacak olursa, sonra da o yerine dönerse, o yerin ona ait olma özelliği ortadan kalkmaz. Ondan sonra o yerine gelip oturan kimseyi kaldırma hakkına sahiptir, oturan kimsenin de ona itaat etmesi görevidir. Peki ona itaat etmesi vacip midir? Farklı iki görüş vardır. Daha sahih olanı vacip olduğudur. Müstehap olduğu da söylenmiştir. Bu, aynı zamanda Malik'in görüşüdür. Bizim mezhebimize mensup ilim adamları şöyle der: Onun o yerde daha çok hak sahibi oluşu sadece o namaz içindir, başka namaz vakitleri için değildir. Oradan kalkıp seccade ve buna benzer bir şey bırakıp gitmesi ile bunu yapmaması arasında da bir fark yoktur. Doğrusunu en iyi bilen Allah'tır. İyad dedi ki: İlim adamları ders ve fetva vermek için mescidin belli bir yerine oturmayı alışkanlık haline getirmiş olan kimsenin durumu hakkında farklı görüşlere sahiptirler. İmam Malik'ten böyle bir kimsenin, eğer o yerde oturduğu bilinen bir hal alacak olursa, daha bir hak sahibidir. (Iyad devamla) dedi ki: Cumhurun benimsediği görüş ise bu vacip bir hak değil, daha güzel g6rülen bir şeydir. Muhtemelen Malik'in kasdettiği de budr. Açık arazilerde ve kimsenin mülkü olmayan yollarda satıcıların oturdukları yerler hakkında da b6yle demişlerdir. Derler ki: Bu gibi yerlerden herhangi bir kısmında oturmayı alışkanlık haline getirmiş olan bir kimse, maksadını gerçekleştirinceye kadar orada durmaya daha bir hak sahibidir. Kurtubi dedi ki: Cumhurun benimsediği görüş ise, bunun vacip bir hak 01madığıdır. Nevevı dedi ki: İbn Ömer'e nispet edilen tutuma gelince, o onun veraından ileri gelir. Yoksa kalkan kimsenin nzası ile olduğu takdirde orada oturması haram değildir. Ama kendisi, kendisi için ayağa kalkan kimsenin utandığından 6türü, g6nül hoşluğu ile olmayarak ayağa kalkmış olabileceği ihtimali dolayısıyla oraya oturmak istememiştir. Böylelikle bu sakıncadan kurtulmak için bu kapıyı kapatmak istemiştir yahut yakınlaştırıcı amellerde başkasını kendisine tercih etmenin mekruh olduğu ya da evla olanın aksi olduğu görüşünde olduğundan dolayı bunu kabul etmemiştir. O herhangi bir kimsenin kendisi için böyle bir şey yapmasını istemediğinden ötürü bu işe yanaşmazdl. Mezhebimiz alimleri: Başkasını kendisine tercih etmek, nefsin kendisine ait paylar ve dünyevı işler için yapıldığı takdirde 6vülen bir iş olur",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 6271,
			"arabicnumber": 6271,
			"text": "Enes İbn Malik r.a.'dan dedi ki: \"Rasuluilah Sallallahu Aleyhi ve Sellem, Cahş kızı Zeyneb ile evlendiğinde insanları (düğün yemeğine) davet etti. Onlar da yemek yedikten sonra oturup konuşmaya koyuldular. (Enes) dedi ki: (Allah rasulü) kalkmaya hazırlanıyormuş gibi yaptı, ama onlar yine kalkmadılar. Onların ka1kmadıklarını görünce kendisi kalktı. O kalkınca insanlardan onunla beraber kalkanlar da kalktı ama geriye üç kişi kaldı. Nebi Sallallahu Aleyhi ve Sellem içeri girmek üzere geldiğinde onlar hala oturuyorlardı. Daha sonra onlar da kalkıp gittiler. (Enes) dedi ki: Ben de gelip Nebi Sallallahu Aleyhi ve Sellem'e onların da gittiklerini haber verdim. O da gelip içeri girdi. Ben de içeri girmek isteyince, benimle kendisi arasına perdeyi sarkıttı. Yüce Allah da: \"Ey iman edenler! Nebiin evlerine sizin için yemeğe izin verilmeden girmeyin ... Çünkü bu Allah'ın yanında çok büyük bir iştir. \"(Ahzab, 53) buyruklarını indirdi.\" Fethu'l-Bari Açıklaması: \"Oturduğu yerden yahut evinden arkadaşlarından izin almaksızın kalkan yahut diğer insanlar kalksın diye kalkmaya hazırlanan kimse.\" Buhari bu başlıkta Enes İbn Malik'in Nebi efendimizin Cahş kızı Zeyneb ile evlenmesi ve hicap ayetinin nüzulünü anlatan hadisini zikretmektedir.Bu hadise dair yeterli açıklamalar daha önce Ahzab suresinde (4791 nolu hadiste) geçmiş bulunmaktadır. Hadisten çıkarılan sonuçlar İbn Battal dedi ki: 1- Bu hadisten, herhangi bir kimsenin, başkasının evine izni olmaksızın girmemesi gerektiği, 2- Girme iznini alan kimsenin de ev sahiplerini rahatsız etmemesi, kendi ihtiyaçlarını görmelerine engelolmaması için kendisine izin verilen maksadın gerçekleşmesinden sonra uzunca oturmaması gerektiği, 3- Ev sahibi bundan dolayı zarar görünceye kadar bu şekilde davranan kimseye karşı ev sahibinin ondan sıkıldığını açığa vurma hakkına sahip olduğu, 4- Bunu fark etsin diye iznini almaksızın ayağa kalkabileceği, 5- Ev sahibi, evinden çıktıktan sonra kalmak isteyenin, kendisine önceden verilmiş izinden ayrı yeni bir izin almadıkça orada kalma hakkına sahip olmadığı anlaşılmaktadır. Doğrusunu en iyi bilen Allah'tır",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 6272,
			"arabicnumber": 6272,
			"text": "İbn Ömer r.a.'dan dedi ki: \"Ben Rasıllullah Sallallahu Aleyhi ve Sellem'i Ka'be'nin bir yanında eliyle şöylece ihtiba etmiş iken gördüm ... \" Fethu'l-Bari Açıklaması: \"İki el ile ihtiba etmek\"ten mescidde namazı beklerken eliyle ihtiba halinde oturması istisna edilmiştir. Bü hadiste işaret edildiği üzere bir eli diğerinin bileği üzerine koymak suretiyle bir eliyle diğerini de tutması gerekir. Ama bu durumda parmaklarını birbirine geçirmemelidir. Çünkü Ahmed'in, Ebıl Said'den rivayet ettiği hadiste bu hususa dair nehy varid olmuştur. Hadisin senedinde bir beis yoktur. Namaz bölümünün Mescidlere dair başlıklarında parmakları birbirine geçirmeye dair açıklamalar geçmiş bulunmaktadır. İbn Battal dedi ki: İhtiba halinde oturan kimsenin elleriyle bir şeyler yapması namaz ya da başka bir şey için harekete geçmesi caiz değildir. Çünkü bu durumda avreti görülür. Ancak üzerinde avretini örten bir elbisesi varsa caizdir. Bu ihtiba denilen oturuş şeklinin sadece iki el ile yapılan hali ile ilgilidir. Kabul edilen açıklama şekli de budur. Ancak ed-Davudi, İbnu't-Tin'in kendisinden naklettiğine göre ihtiba ile kurfusa oturuşu arasında fark gözeterek şöyle demiştir: İhtiba oturuşu ayaklarını dikip diz kapaklarını birbirinden uzaklaştırıp üzerinden bir elbise dolayıp onu dğümlemesidir. Şayet kamis (gömlek) yahut bir başka elbise giyinmiş ise böyle bir oturuş yasak değildir. Eğer üzerinde hiçbir elbise bulunmuyor ise işte kurfusa oturuşu budur. ed-Davudi böyle demiştir olmakla birlikte kabul edilen açıklama, az önce geçen şeklidir",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 6273,
			"arabicnumber": 6273,
			"text": "Abdurrahman İbn Ebi Bekre'den, o babasından dedi ki: \"Rasulullah Sallallahu Aleyhi ve Sellem: Size büyük günahların en büyüğünü haber vermeyeyim mi, diye sordu. Ashab: Buyur ey Allah'ın Rasulü, dediler. O: Allah'a ortak koşmak, anne-babaya asi olmaktır, buyurdu",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 6274,
			"arabicnumber": 6274,
			"text": "Bişr'den de bunun bir benzeri bir rivayet gelmiş olup onda şu fazlalık da vardır: \"O esnada Allah Rasulü yaslanmış idi, sonra doğrulup oturdu ve: Dikkat edin! Bir de yalan söz, buyurdu. Bunu o kadar tekrar edip durdu ki, keşke sussa, dedik.\" Fethu'l-Bari Açıklaması: \"Arkadaşlarının huzurunda yaslanan kimse.\" Bir görüşe göre itti ka (yaslanmak) uzanıp yatmak demektir. Daha önce Talak bölümünde Ömer'den rivayet edilen hadiste: \"Ve o bir divan üzerinde yaslanmış bulunuyordu.\" Yani uzanıp yatmıştı, şeklindeki hadis geçmiş bulunmaktadır. el-Mühelleb dedi ki: Alimin, müftinin ve imamın bazı azalarındaki acı ve rahatsızlığı dolayısıyla yahut dinlenmek için insanların huzurunda meclisinde yaslanması (uzanması) caizdir, ama bu hal, bütün oturmalarında olmamalıdır",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 6275,
			"arabicnumber": 6275,
			"text": "Ukbe İbn el-Haris'den dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem ikindi namazını kıl(dır)dı ve hemen hızlıca kalkıp eve girdL\" Fethu'l-Bari Açıklaması: \"Bir ihtiyacını karşılamak için hızlıca yürüyen kimse.\" Yani herhangi bir sebep için hızlıca yürüyen kimse. \"Yahut bir maksadı görmek için\" Maruf olan bir maksat için demektir. İbn Battal dedi ki: Hadisten imamın bir ihtiyacını karşılamak üzere acele etmesinin caiz olduğu anlaşılmaktadır. Nebi Sallallahu Aleyhi ve Sellem'in eve girmekte acele etme sebebinin vaktinde dağıtmayı arzu ettiği bir sadaka olduğu bilinmektedir. İbnu'l-Mübarek Kitabu'l-İsti'zan'da \"İbn Ömer yürüyüşte acele eder ve böylesi kibirden daha uzak, ihtiyacı görmek için de daha çabuklaştırıcıdır, derdi.\" Başkası da şöyle demektedir: Çabuk yürümekle uğraşılmaması gereken şeylerden vakit bulup uğraşılması gereken şeylere yönelme imkanı elde edilir. İbnu'lArabi dedi ki: İhtiyaca göre yürümek -çabuk ya da yavaş olsun- sünnet olandır. Yoksa yürüyüşte yapmacıklık ya da tehevvür değildir",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 6276,
			"arabicnumber": 6276,
			"text": "Aişe r.anha'dan dedi ki: \"Ben Rasulullah Sallallahu Aleyhi ve Sellem ile kıblesi arasında (serır üzerinde) uzanmış yatıyorken, Rasulullah Sallallahu Aleyhi ve Sellem da serırin ortasına doğru namaz kılardı. Kalkmak ihtiyacım olunca onun kıblesine karşı doğrulmaktan hoşlanmadığım için, serırin ayak tarafından sıyrılıp giderdim.\" Fethu'l-Bari Açıklaması: İbn Battal dedi ki: Hadisten anlaşıldığına göre serir edinmek, serırin üzerinde uyumak, kadının kocasının huzurunda uyuması caizdir. Derim ki: İsti'zan (izin isteme) bölümünde bu başlığın, bundan öncekinin ve bundan sonrakinin zikredilmesinin ilgisi şudur: İzin istemek, evin içine girmeyi gerektirir. Bu sebeple istiddıd olmak üzere ev ile ilgili hususları da zikretmiş bulunmaktadır",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 6277,
			"arabicnumber": 6277,
			"text": "Ebu Kılabe'den dedi ki: \"Bana Ebu'l-Melih haber vererek dedi ki: Senin baban Zeyd ile birlikte Abdullah İbn Amr'ın huzuruna girdim. O bize şunu tahdis etti: Benim oruç tutuş şeklim Nebie anlatılınca, yanıma girdi. Ben de ona içi lif ile doldurulmuş bir yastık uzattım. O ise yere oturdu, yastık da benimle onun arasında kaldı. Bana: Her aydan üç gün oruç tutmak sana yetmez mi, dedi. Ben: Ey Allah'ın Resulü (daha çoğuna gücüm yeter) dedim. O: Beş gün diye buyurdu. Ben: Ey Allah'ın Resulü (fazlasına gücüm yeter), dedim. O: Yedi gün, buyurdu. Ben: Ey Allah'ın Resulü (daha fazlasına gücüm yeter), dedim. O: Dokuz gün, buyurdu. Ben: Ey Allah'ın Resulü (daha fazlasına gücüm yeter), dedim. O: Onbir gün, buyurdu. Ben: Ey Allah'ın Resulü (daha fazlasına gücüm yeter), dedim. O: Davud'un orucu üstüne oruç yoktur. O, senenin yarısı eder. Bir gün oruç tutar, bir gün oruç açar(dı), buyurdu",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 6278,
			"arabicnumber": 6278,
			"text": "İbrahim'den dedi ki: \"Alkame Şam'a gitti. Mescide gidip iki rekat namaz kıldı, sonra: Allah'ım, yanına oturacağım birisini nasip et, dedi ve Ebu'dDerda'nın yanına oturdu. Ebu'd-Derda ona: Sen kimlerdensin, sordu. Alkame: Kafe ahalisindenim, dedi. Ebu'd-Derda: -Huzeyfe'yi kastederek:- Aranızda kendisinden başkasının bilmediği o sır sahibi olan kimse yok mu? -Ammar'ı kastederek- aranızda Allah'ın Resulü Sallallahu Aleyhi ve Sellem'nün dili üzere şeytandan koruduğu kimse yok mu? - İbn Mesud'u kastederek- aranızda misvakın ve yastığın sahibi yok mu, dedi. Abdullah İbn Mesud \"velleyli iza yağşa .. .\"yı nasılokuyordu, diye sordu. Alkame: \"Vezzekeri ve'l-ünsa\" diye okurdu, dedi. Bu sefer Ebu'd-Derda: Bunlar (Şam halkı) az kalsın beni de şüpheye düşüreceklerdi. Halbuki ben bu okuyuş şeklini bizzat Resulullah Sallallahu Aleyhi ve Sellem'den işitmişimdir, dedi",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 6279,
			"arabicnumber": 6279,
			"text": "Sehl İbn Sa'd'dan dedi ki: \"Biz Cuma namazından sonra kaylule yapar ve yemeğimizi yerdik",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 6280,
			"arabicnumber": 6280,
			"text": "Sehl İbn Sa'd'dan dedi ki: \"Ali'nin \"Ebu Turab\"dan daha çok sevdiği bir ismi yoktu. Bu isim ile çağrıldığıvakit çok seviniyordu. Rasulullah Sallallahu Aleyhi ve Sellem (bir seferinde) Fatıma aleyhisselam'nın evine geldi. Ali'yi evde bulamayınca: Amcanın oğlu nerede, diye sordu. Fatıma: Benimle onun arasında bir şeyler oldu. Bu sebeple o bana kızdı ve yanımda kaylule yapmadan çıkıp gitti, dedi. Bunun üzerine Rasulullah Sallallahu Aleyhi ve Sellem birisine: Bir bak, o nerededir buyurdu. Adam gelip: Ey Allah'ın Rasulü, o mesddde uyuyor, dedi. Rasulullah Sallallahu Aleyhi ve Sellem, mescide geldiğinde Ali uzanmış yatıyordu. Ridası yanı üzerinden kayıp düşmüş ve yan tarafına toprak bulanmıştl. Rasulullah Sallallahu Aleyhi ve Sellem üzerindeki toprağı silerken: Kalk ey Ebu Turab, kalk ey Ebu Turab, diyordu",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 6281,
			"arabicnumber": 6281,
			"text": "Enes'den rivayet e göre \"Ümmü Suleym, Nebi Sallallahu Aleyhi ve Sellem'e deriden yapılmış bir döşek yayar, o da bu döşek üzerinde yatıp kaylule uykusunu uyurdu. (Enes) dedi ki: Nebi Sallallahu Aleyhi ve Sellem uyudu mu, onun terinden ve saçlarından alır ve onları bir şişe de toplardı. Sonra da o uyurken bunlara sük denilen bir hoş koku katardı.\" (Ravi Sümame) dedi ki: Enes İbn Malik'in vefatı yaklaşınca bana kefenine konulacak kokunun içerisine bu sükten konulmasını vasiyet etti. (Sümame) dedi ki: Bu sük ölümünden sonra kefenine ve vücuduna konulan kokular arasına katıldı",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 6283,
			"arabicnumber": 6283,
			"text": "",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 6284,
			"arabicnumber": 6284,
			"text": "Ebu Said el-Hudri r.a.'dan dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem kişinin tek bir elbise (dikişsiz bez) içerisinde, fercinin üzerinde bir şey bulunmaksızın sarınıp bürünmesi olan es-samma ile el-ihtiba diye bilinen iki giyinişi ve mülamese ile münabeze denilen iki alışverişi nehyetti.\" Fethu'l-Bari Açıklaması: \"Kolayına nasıl geliyorsa öylece oturmak.\" Bu başlıkta Ebu Said'in rivayet ettiği iki tür giyiniş ile iki tür alışverişin nehyedildiğini belirten hadis yer almaktadır. Bu hadise dair açıklamalar daha önce Namaz bölümünde avretin setredilmesi bahsinde(367 nolu hadiste) ve Buyu' bölümünde (2147 nolu hadiste) geçmiş bulunmaktadır. el-Mühelleb dedi ki: Bu başlık hadisin delalet ettiği bir husustur. Çünkü hadis iki durumu yasaklamaktadır. O halde bundan, insanın kolayına gelen durumlar ve giyiniş şekillerinin, -avretin setrini (örtünmesini) sağladığı takdirde- mubah olduğu anlaşılmaktadır. Derim ki: Benim görüşüme göre aradaki ilişki, oturuş şeklinin yasaklanması değil de iki giyiniş şeklinin yasaklanmış olması ciheti iledir. Yasaklanan bu iki giyiniş şeklinin her birisi, avretin açılmasını gerektirir. Eğer oturuş şekli bizatihi mekruh olsaydı, hiçbir şekilde giyinişi söz konusu etmezdi. O halde bu, yasağın avretin açılması sonucunu veren oturmaya dair olduğuna delildir. Avretin açılması sonucunu vermeyen oturuş ise her durumda mubah demektir",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 6286,
			"arabicnumber": 6286,
			"text": "Ve Allah Teala'nın: \"Ey iman edenler! Birbirinizle fısıldaştığınız zaman düş- ' manlık ve Rasulü isyan ile fısıldaşmayın. İyiliği ve takvayı fısıldaşın ... O halde mu'minler yalnız Allah'a tevekkül etsinler.(Mücadele, 9-10)\" buyruğu ile Yüce Allah'ın:",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 6287,
			"arabicnumber": 6287,
			"text": "Ubade İbn Temim'den, o amcasından dedi ki: \"Ben Rasıllullah Sallallahu Aleyhi ve Sellem'i mescidde bir ayağını diğerinin üstüne atarak sırt üstü yatmış gördüm.\" Fethu'l-Bari Açıklaması: \"Sırt üstü yatmak.\" İstilkaa (sırt üstü yatmak), ister uyusun, ister uyumasın sırt üstü yatmaya denilir. Bu başlık ve buradaki hadis, daha önce Edeb bölümünden az önce Libas bölümünün sonlarında geçmiş bulunmaktadır. Hükümlere dair açıklamalar da Namaz bölümünde Orada böyle bir yatmanın nesh olduğunu iddia edenlerin görüşünü zikretmiş ve rivayetlerin arasını cem ve telif edip açıklamanın daha uygun olduğunu, yasağın avretin açılması ile ilgili, cevazın ise avretin açılmaması hali ile ilgili olduğunu belirtmiş idim. Bu, aynı zamanda el-Hattabi'nin ve ona tabi olanların da cevabıdır. AÇIKLAMALARIN OLDUĞU SAYFA İÇİN BURAYA TIKLAYIN",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 6288,
			"arabicnumber": 6288,
			"text": "Abdullah r.a.'dan rivayete göre; \"Rasuluilah Sallallahu Aleyhi ve Sellem şöyle buyurdu: Üç kişi beraber oldukları takdirde üçüncüsünü dışarıda bırakarak ikisi kendi aralarında gizlice konuşmasın.\" Fethu'l-Bari Açıklaması: \"Üçüncüyü dışarıda tutarak iki kişi kendi arasında gizlice konuşmaz\" Yani bu iki kişi kendi aralarında gizlice konuşmamalıdırlar. Yüce Allah: \"Ey iman edenler! Birbirinizle gizlice konuştuğunuz zaman günah, düşmanlık ve Nebie isyan ile fısıldaşmayın ... O halde mu'minler yalnız Allah'a tevekkül etsinler.\"(Mücadele, 9-10) Bu iki ayeti zikretmekle, hadisin mefhumundan caiz olduğu anlaşılan gizlice konuşmanın, günah ve düşmanlık hakkında olmaması kaydı ile caiz olduğuna işaret etmektedir. \"Ve yüce Allah'ın: \"Ey iman edenler! Rasule gizli bir şey söyleyecek olursanız, bu gizli konuşmanızdan önce bir sadaka verin ... Allah her yaptığınızdan haberdardır. \"(Mücadele, 12-13) buyruğu.\" Tirmizi, Ali'den bu buyruğun neshedildiğine dair hadis rivayet etmiştir. Süfyan İbn Uyeyne de Cami'inde Asım el-Ahvel'den şöyle dediğini rivayet etmektedir: Bu ayet nazil olunca, Nebi Sallallahu Aleyhi ve Sellem ile gizlice konuşacak bir kimse mutlaka bir sadaka verirdi. Onunla gizlice ilk konuşan kişi Ali İbn Ebi Talib olmuştu. Bunun için de bir dinar sadaka vermişti. Daha sonra bu hususta ruhsat bildiren: \"Madem ki yapmadınız -ki Allah tevbenizi kabul etmiş bulunuyor- o halde ... \"(Mücadele, 13) buyruğu ile ruhsat nazil oldu. Bu hadis, ravileri sika olan mürsel bir hadistir. Nebie merfu olarak bir başka şekilde Ali'den de rivayet edilmiştir. Bunu Tirmizi, sahih olduğunu belirterek İbn Hibban ve İbn Merduye Ali İbn Alkame yoluyla Ali'den diye rivayet etmiştir. Buna göre Ali r.a. dedi ki: \"Bu ayet nazil olunca, Rasulullah Sallallahu Aleyhi ve Sellem bana: Ne dersin, bir dinar (sadaka versinler mi), dedi. Ben: Buna g0.çleri yetmez, dedim. Bu sefer: Yarım dinar hakkında ne dersin, dedi. Ben: Buna da güçleri yetmez dedim. O halde ne kadar olsun, diye sordu. Ben bir arpa ağırlığı kadar, dedim. Allah Resulü: O pek az bir miktardır, dedi. Daha sonra \"madem ki çekindiniz ... \" ayet i nazil oldu. Ali: Benim sayemde bu ümmetin yükü hafifletildi, dedi",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 6289,
			"arabicnumber": 6289,
			"text": "Mu'temir İbn Süleyman'dan dedi ki: \"Babamı şöyle derken dinledim: Enes İbn Malik'i dinledim. Şöyle diyordu: Nebi Sallallahu Aleyhi ve Sellem bana gizlice bir sır verdi. Ben de ondan sonra onu kimseye bildirmedim. Andolsun annem Ümmü Suleym dahi bana sordu. Ama ben ona bile o sırrı bildirmedim.\" Fethu'l-Bari Açıklaması: \"Sır saklamak\" yani açıklamamak. İbn Battal dedi ki: İlim ehlinin kabul ettiğine göre eğer sahibi bundan dolayı zarar görecek ise, sırrı açıklamamak gerekir. çoğu da: Sırrı veren kişi öldüğü takdirde hayatta iken gizlenip saklanması gerektiği gibi -açıklanması halinde o sırrı verenin küçültülmesinin söz konusu olması dışında- sırının saklanması gerekmez. Derim ki: Göründüğü kadarıyla ölümden sonra sırrın açıklanması bir kaç kısma ayrılır. Bir kısmı mubahtır, hatta bazen o sırrı veren sırrının açıklanmasından hoşlanmasa dahi anlatılması müstehap olabilir. Sırrın, sırrı veren kimsenin bir kerametini, menkıbesini ya da buna benzer tezkiye edilmesini ihtiva etmesi gibi. Mutlak olarak mekruh kısmı da vardır, haram da olabilir. İbn Battal'ın işaret ettiği de budur. Açıklanması vacip olabilir. O sırda yerine getirmekte mazur görülebileceği bir hakkın üzerinde bulunması hali gibi. Bu sırrın zikredilmesi ile, ondan sonra gelenler arasında onun adına bu işi yerine getirmeleri umulan kimseler ümit ediliyor ise bu sır açıklanır",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 6290,
			"arabicnumber": 6290,
			"text": "Abdullah r.a.'dan dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: Üç kişi iseniz üçüncüsünü dışarıda tutarak -diğer insanlar ile karışacağınız vakte kadar- iki kişi kendi aralarında gizlice konuşmasın. Çünkü böyle bir şeyonu üzer",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 6291,
			"arabicnumber": 6291,
			"text": "Abdullah'dan dedi ki: \"Bir gün Nebi Sallallahu Aleyhi ve Sellem paylaştırılacak bir malı paylaştırdı. Ensardan bir adam: Şüphesiz bu, kendisiyle Allah'ın rızası gözetilmemiş bir paylaştırmadır, dedi. Ben: Allah'a yemin ederim, Nebi Sallallahu Aleyhi ve Sellem'e gideceğim, dedim ve yanına gittim. O sırada bir topluluk ile birlikte idi. Ona gizlice söyledim. Allah Rasulü yüzü kızaracak kadar kızdı, sonra: Allah Musa'ya rahmetini ihsan eylesin. Ona bundan fazla eziyet edilmişti de o sabretmişti, buyurdu.\" Fethu'l-Bari Açıklaması: \"Üç kişiden fazla oldukları takdirde gizlice konuşmakta ve fısıldaşmakta sakınca yoktur.\" Yani birileri ile böyle konuşmayıp bazısıyla konuşmakta bir sakınca yoktur. \"İnsanlarla karışacağınız zamana kadar\" Yani üç kişi başkası ile bir araya gelinceye kadar. \"Başkası\" sözü \"bir\" ya da \"daha çok\" lafızlarının ifadelerinden daha geneldir. Bundan dolayı bu ifade başlığa uygundur. Bundan anlaşıldığına göre, dört kişi oldukları takdirde iki kişinin gizlice konuşmaları yasak olmaz. Çünkü diğer iki kişi de kendi arasında gizlice konuşabilirler. Bu husus, musannıfın el-Edebu'l-Müfred'de, Ebu Davud'un, sahih olduğunu belirterek İbn Hatim'in, Ebu Salih yoluyla zikrettikleri rivayette açık bir şekilde variddir. Bunu Ebu Salih, İbn Ömer'den diye rivayet etmiş, Ömer de bunu merfu olarak şöylece nakletmiştir: \"Ben: Ya dört kişi olurlarsa, diye sordum. Allah Resulü: O takdirde ona zararı olmaz, buyurdu.\" Malik'in, Abdullah İbn Dinar'dan diye naklettiği rivayete göre \"İbn Ömer bir adama gizlice bir şey söylemek isteyip üç kişi iseler dördüncü birisini çağırır, sonra da iki kişiye: Bir süre dinleniniz çünkü ben ... dinledim, derdi\" deyip, hadisin geri kalan bölümünü zikretmektedir. \"Çünkü bu onu üzer.\" el-Hattabi dedi ki: Allah Rasulünün \"onu üzer\" diye buyurması şu ndan dolayıdır. Üçüncü şahıs, iki kişinin kendi aralarında fısıldaşmalarının kendisi hakkındaki kötü düşünceleri dolayısıyla yahut onun için bir kötülük planlamaları sebebiyle olduğu vehmine kapılabilir. Derim ki: (Hadiste sözü edilen) gerekçeden, İbn Ömer'den az önce geçen dört kişi olmaları halinde bunun caiz olduğunu belirten şeklin istisna edileceği anlaşılmaktadır. Eğer dışarıda kalan tek kişi ile birbirleriyle gizlice konuşan iki kişi arasında her ikisinin ya da onlardan birisinin mazur görüleceği bir sebep dolayısıyla birtakım ilişkiler koparılmış ise, dışarıda kalan kişi tek başına kalmış gibi olur. (İşte dördüncünün bulunması halinde bunun sakıncası olmaz ve istisna olarak caiz olur.) Buradaki bu gerekçe dolayısıyla, gizlice konuşan kimse eğer özelolarak gizlice konuştuğu kimse dolayısıyla geri kalanların üzülmesine sebep teşkil edecek olursa, bunun yapılmaması gerekir. Böyle bir konuşmanın din e bir zararı olmayan önemli bir hususa dair olması müstesnadır. İbn Battal, Eşheb'den o da Malik'ten şöyle dediğini nakletmektedir: Bir kişiyi dışarıda tutarak üç kişi de olsa, on kişi de olsa kendi aralarında gizlice konuşamazlar. Çünkü bir kişinin dışarıda tutulması yasaklanmıştır. (İbn Batta!) dedi ki: Bu da bu başlıkta yer alan hadisten çıkartılmış bir hükümdür. Çünkü topluluğun bir kişiyi dışarıda bırakması ile iki kişinin bir kişiyi dışarıda bırakması aynı anlamı ihtiva eder. (İbn Battal devamla) dedi ki: İşte bu, karşılıklı olarak nefret beslememeleri, aralarındaki ilişkiyi koparmamaları için güzel bir edeptir. Bu husustaki asıl hükümden, dışarıda kalan kimsenin izin vermesi hali istisna edilir. Dışarıda kalanın da bir ya da daha fazla olması arasında fark yoktur. Bu kişinin ya da kişilerin, iki kişiye kendi aralarında gizlice konuşmalarına izin vermeleri yeterlidir. Çünkü böyle bir durumda yasak ortadan kalkar ve çünkü bu (izin vermek), dışarıda kalan kimselerin bir hakkıdır. Eğer önce iki kişi kendi aralarında gizlice konuşurken orada da yüksek sesle konuşsalar dahi seslerini işitemeyecek bir yerde bulunan üçüncü bir kişi varsa, bu da onların ne konuştuklarını dinlemek üzere gelirse, bu davranışı ta baştan beri onlarla birlikte değilmiş gibi caiz olmaz. Musannıf (Buhari), el-Edebu'l-Müfred'de, Said el-Makburi'den şöyle dediğini rivayet etmektedir: \"İbn Ömer'in yanından geçtim. Beraberinde onunla konuşan bir adam vardı. Ben de yanıbaşlarında durdum. İbn Ömer göğsüme vurdu ve: İki kişinin konuştuğunu görürsen onların iznini almadan onların yanında durma, dedi.\" Ahmed'in, Said'den bir başka yolla naklettiği rivayetinde şu fazlalık vardır: \"Ve şunu söyledi: Nebi Sallallahu Aleyhi ve Sellem'in: İki kişi kendi aralarında gizlice konuşuyor iseler onlardan izin almadıkça başkaları onlarla bir araya girmez, dediğini duymadın mı?",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 6292,
			"arabicnumber": 6292,
			"text": "Enes r.a.'dan dedi ki: \"Namaz için kamet getirildiğinde, bir adam da Rasulullah Sallallahu Aleyhi ve Sellem ile gizlice konuşuyordu. Allah Rasulünün ashabı uyuyuncaya kadar onunla gizlice konuşup durdu. Daha sonra Rasulullah kalktı ve namazı kıldırdı.\" Fethu'l-Bari Açıklaması: \"Uzun süre gizlice konuşmak ve \"o zalimler gizlice konuşurlarken\" (İsra, 47) buyruğu\" Daha sonra Buhari, Enes'in rivayet ettiği hadisi zikretmektedir. Hadise dair yeterli açıklamalar Cemaatle namaz bahsinden az önce \"imamın bir ihtiyacının ortaya çıkması\" başlığında geçmiş bulunmaktadır",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 6293,
			"arabicnumber": 6293,
			"text": "Salim'den, onun babasından rivayete göre; \"Nebi Sallallahu Aleyhi ve Sellem: Uyuyacağınız zaman ateşi evinizde (yanar halde) bırakmayınız, buyurdu",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 6294,
			"arabicnumber": 6294,
			"text": "Ebu Musa r.a.'dan dedi ki: \"Geceleyin Medine'de bir ev, ahalisi içinde olduğu halde yandı. Nebi Sallallahu Aleyhi ve Sellem'e onların durumu anlatılınca şöyle buyurdu: Şüphesiz bu ateş sizin için bir düşmandır. Bundan dolayı uyuyacak olursanız onu söndürünüz",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 6295,
			"arabicnumber": 6295,
			"text": "Cabir İbn Abdullah r.a.'dan dedi ki: \"Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: Kapların üstünü örtünüz. Kapıları kapatınız, kandilleri söndürünüz. Çünkü o fasıkcık (fare), kandilin fitilini çekip ev halkının yanmasına sebep olabilir.\" Fethu'l-Bari Açıklaması: Kurtubi dedi ki: Bu hadisteki emir ve nehy, irşad içindir. Yine Kurtubi: Mendubluk bildirmek için de olabilir, demiştir. Nevevı ise bunun irşad için olduğunu kesin olarak ifade etmiştir. Çünkü bu emir, dünyevı bir masıahat içindir. Ancak bu dini bir maslahata da götürebilir, denilerek ona itiraz edilmiştir. Bu da öldürülmesi haram olan nefsin, saçıp savrulması haram olan malın korunmasıdır. Kurtubi der ki: Bu hadislerden anlaşıldığına göre bir kişi bir evde geceyi geçirecek olup evde kendisinden başka birisi yoksa ve orada da ateş varsa uyumadan önce ateşi söndürmeli yahut ona karşı yanmaktan yana güven altında olunacak tedbirleri almalıdır. Şayet evde kalabalık iseler onlardan birisinin bunu muayyen olarak yapması gerekir. Bu işi aralarında en çok yapması gereken kişi ise son uyuyacak olanlarıdır. Bu hususta kusurlu davranan kimse sünnete muhalefet etmiş ,!e sünneti terk etmiş birisi olur. Daha sonra Kurtubi, Ebu.Davud'un rivayet ettiği ıbn Hibban'ın ve Hakim'in sahih olduğunu belirttikleri Ikrime yoluyla İbn Abbas'tan gelen şu hadisi kaydetmektedir: İbn Abbas dedi ki: \"Bir fare gelip çıra fitilini sürükleyerek Nebi Sallallahu Aleyhi ve Sellem'in üzerinde oturmakta olduğu seccadenin önüne bıraktı. O seccadenin dirhem büyüklüğündeki kadar bir yerinin yanmasına sebep oldu. Bundan dolayı Nebi Sallallahu Aleyhi ve Sellem: Uyuduğunuz vakit, çıralarınızı söndürünüz. Şüphesiz şeytan böyle birisine böylesini gösterir ve yanmanıza sebep olur, buyurdu.\" Aynı zamanda bu hadiste emrin sebebi de o fasıkcığı -ki fare dir- fitili çekmeye itenin şeytan olduğu da beyan edilmektedir. Böylelikle şeytan insanın düşmanı olarak onun bir başka düşmanı olan ateşin yardımını almaktadır. Allah lütfu keremiyle bizleri düşmanların hile ve tuzaklarından korusun. Şüphesiz ki o, çok Rauftur, Rahimdir. İbn Dakiki'l-'Id de şöyle diyor: Çıranın söndürülmesinin emredilme illeti fasıkçığın (farenin) fitili çekip sürüklemesinden sakınıp ona karşı tedbir almak olduğuna göre, bu emrin muktezası da şu olur: Eğer çıra farenin kendisine ulaşamayacağı bir durumda ise, onu yanık bırakmak yasak değildir. Mesela, farenin yükselip çıkmasına imkan vermeyen düz, pürüzsüz bir bakırdan yapılmış bir şamdan üzerinde ise yahut bulunduğu yer farenin çıraya kadar ulaşmasına imkc'in vermeyecek kadar uzakta bulunuyor ise (çıra yanık kalabilir). Devamla der ki: Ama ateşin söndürülmesi emri mutlak olarak varid olmuştur. Nitekim İbn Ömer ve Ebu Musa'nın rivayet ettikleri hadislerde böyledir. Ateş lafzı ise, çıranın ateşinden (alevinden) daha genel bir ifadedir. Çünkü bundan fitilin çekilip sürüklenmesi dışında bir başka kötülüğün çıkması imkanı da vardır. Çıradan bir şeyin, evin bazı eşyaları üzerine düşmesi, şamdanın düşerek çıranın birtakım eşyalar üzerine dağılıp, onları yakması hali gibi. Bu durumda bunların olmayacağından emin olmak gerekir. Eğer böyle bir yangına sebep olmayacağından emin olunursa, bu durumda illetin ortadan kalkması dolayısıyla hüküm de ortadan kalkmış olur. Derim ki: Nevev!, -mesela- kandil ile ilgili olarak bunu açıkça ifade etmiştir. Çünkü bu durumda zarardan yana emin olunabilir, ama çıra hakkında aynı şekilde emin olmak söz konusu değildir",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 6296,
			"arabicnumber": 6296,
			"text": "Cabir'den dedi ki: \"Rasulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: Geceleyin uyuduğunuz vakit kandilleri söndürünüz, kapıları kilitleyiniz, kırbaların, tulumların ağızlarını düğümleyiniz, yiyecek ve içeceğin üstünü örtüp kapatınız.\" Ravi Hemmam dedi ki: Ben onun (Ata'nın): \"Kabın üzerine enine koyacağı bir çubuk ile dahi olsa ... \" dediğini zannediyorum. Fethu'l-Bari Açıklaması: \"Kapıları kilitleyiniz.\" İbn Dakiki'l-'Id dedi ki: Kapıların kilitlenmesi emrinde dini ve dünyevi çeşitli masıahatlar vardır. Bu yolla canlar ve mallar, faydasız işler yapan ve fesad ehli olan kimselere karşı, özellikle de şeytanlara karşı korunma altına alınır. Nebi efendimizin: \"Çünkü şüphesiz şeytan kilitlenmiş bir kapıyı açamaz\" ifadesi, kapının kapatılması emrinin şeytanın insanlarla birlikte bulunmasından uzak tutulması için olduğuna bir işarettir. Özelolarak onu gerekçe göstermesi ise, ancak nübüwet yoluyla bilinebilecek ve sair kimselere gizli saklı kalınan böyle bir hususa dikkat çekmek içindir. Bu rivayette geçen \"yiyecek ve içecek kaplarının üstünü örtünüz. Hemmam dedi ki: Zannederim Ata: Kabın üzerine enine konulacak bir değnek ile dahi olsa dedi\" ifadeleri ile birlikte, (bir diğer rivayette) sözü geçen her bir emir ile ayrıca \"ve yüce Allah'ın adını da zikret\" fazlalığı da yer almaktadır. İbn Battal hadisi genel ifadeleri ile olduğu gibi kabul etmiş ve bu hususta bir müşkülüne işaret ederek şöyle demiştir: Nebi Sallallahu Aleyhi ve Sellem şeytan(bu kabilden hiçbir güç verilmemiş olduğunu haber vermektedir. Bununla birlik e şeytana bundan daha büyük imkanlar da verilmiştir. O da insanoğlunun girm kudretine sahip olmadığı yerlere girebllmesidir. Derim ki: Az önce işaret ettiğimiz fazlalık, bu müşkülü ortadan kaldırmaktadır. O da Allah'ın adının anılışının, şeytanın bu işleri yapmasına engel teşkil etmesidir. Buna göre eğer Allah'ın adı anılmayacak olursa, şeytan bütün bunları yapabilir. Bunu da Müslim'in ve dört Sünen sahibinin Cabir'den merfu olarak rivayet ettikleri şu hadis desteklemektedir: \"Adam evine girip evine girdiği sırada ve yemek yerken Allah'ın adını anarsa, şeytan: Sizin gece kalacak yeriniz de, akşam yemeğiniz de yoktur, der. Eğer evine girip de girince Allah'ın adını anmazsa, şeytan: (Gece kalacağınız yeri) tedarik ettiniz, der",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 6297,
			"arabicnumber": 6297,
			"text": "Ebu Hureyre r.a.'dan Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Fıtrat(ın gereği olan hasletler) beştir: Sünnet olmak, avret yerlerini tıraş etmek, koltuk altı kıllarını yolmak, bıyıkları kesmek ve tırnakları kesmek",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 6298,
			"arabicnumber": 6298,
			"text": "Ebu Hureyre'den rivayete göre; \"Rasulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: İbrahim aleyhisselam seksen yıl sonra sünnet oldu ve o el-Kadum denilen yerde sünnet oldu",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 6299,
			"arabicnumber": 6299,
			"text": "Said İbn Cubeyr'den dedi ki: \"İbn Abbas'a: Nebi Sallallahu Aleyhi ve Sellem'in ruhu kabzedildiğinde yaşça kimin gibi idin, diye soruldu. O: O gün ben sünnet edilmiştim. O vakit insanlar adamı buluğ çağına yetişinceye kadar sünnet ettirmezlerdL\" Bu hadis 6300 numara ile degeçiyor",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 6300,
			"arabicnumber": 6300,
			"text": "İbn Abbas'tan: \"Nebi Sallallahu Aleyhi ve Sellem'in ruhu kabzedildiğinde ben sünnet edilmiştim\" demiştir. Fethu'l-Bari Açıklaması: \"Büyüdükten sonra sünnet olmak.\" el-Kermanı dedi ki: Bu başlığın İzin isteme bölümü ile ilişkisi, sünnet olmanın çoğunlukla evlerde toplanıp bir araya gelmeyi gerektirmesi cihetiyledir. \"Fıtrat (gereği hasletler) beştir.\" Buna dair açıklamalar Libas (giyim) bölümünün sonlarında (5889 nolu hadiste) geçmiş bulunmaktadır. O SAYFA İÇİN BURAYA TIKLAYIN Sünnet olmanın hükmü de aynı şekilde geçti. İbn Battal sünnet olmanın vacip olmayışına Selman'ın Müslüman olduktan sonra sünnet olmasının emredilmemiş olmasını delil göstermiştir. Ancak sünnet olmayı bir mazeret sebebiyle terk etmiş olma ihtimali yahut onun Müslüman olmasının sünnet olmanın vücubundan önce olması ya da önceden beri sünnetli olmuş olması ihtimali bulunduğu belirtilerek ona itiraz edilmiştir. Diğer taraftan onun sünnet edildiğinin nakledilmemiş olması, sünnet olmamış olmasını gerektirmez. Esasen bu hususta başkasına (sünnet olması için) emir verilmiş olduğu da sabittir. İkinci hadiste \"İbrahim aleyhisselam seksen yaşından sonra sünnet oldu\" denilmektedir. Buna dair açıklamalar ve sünnet olduğu vakit kaç yaşında olduğu ile ilgili görüş ayrılıkları, onun ömrünün kaç yılalduğu ile ilgili açıklamalar İbrahim aleyhisselaın ile ilgili başlıkta sözü geçen hadis şerh edilirken (3356 nolu hadiste) geçmiş bulunmaktadır. el-Mühelleb dedi ki: İbrahim aleyhisseli,m'ın seksen yaşından sonra sünnet olması bizim de onun gibi yapmamızı gerektirmez. Çünkü insanlar çoğunlukla seksen yaşına varmadan ölmektedirler. O yüce Allah kendisine bunu vahyedip C emrettiği zaman sünnet olmuştur. Ayrıca akıl ve düşünme, cimada kullanılması j için organa ihtiyaç duyulacağı zamana yakın sünnet olmayı ancak gerekli görmektedir. Nitekim İbn Abbas da: \"Onlar birisini ergenlik yaşına yaklaşmadıkça sÜnnet ettirmezlerdi\" demiştir. Sonra da: Küçük yaşta sünnet olmak, çocuk için işin kolaylaştırılması içindir. Çünkü o yaşta çocuğun organı zayıftır ve anlayışı da azdır. Derim ki: İbrahim aleyhisselaın ile ilgili olay, herhangi bir engel dolayısıyla sözü geçen yaşa kadar geciktirilecek olsa dahi sünnet olmanın meşruiyetine delil gösterilmiştir. Bu halde bile bu sünnetin yerine getirilme isteği kalkmaz. Nitekim Buhari de başlıkta buna işaret etmiş bulunmaktadır. Yoksa maksat, sünnet dolayısıyla zorlukla karşılaşmanın söz konusu olacağı ileri yaşa kadar geciktirilmesinin meşru olduğunu söylemek değildir. el-Mühelleb'in aklı bakımdan sözünü ettiği gerekçe ise tartışılır. Çünkü sünnet olmanın hikmeti cima ile ilgili hususların tamamlanmasından ibaret değildir. Aksine sünnet olmama halinde sidik artıklarının kesilmesi gereken et parçacığı içerisinde kalmasından korkulmasıdır. Özellikle küçük abdestten sonra taş ile istinca yapan kimsenin sidiğinin akmayacağından ve bunun sonucunda elbisenin ya da bedenin necis olmayacağından emin olunamaz. Bundan dolayı küçük çocuğun namaz kılmakla emr olunacağı yaşa erişmesi, sünnet ile o et parçacığının kesilmesi için en güzel vakittir. Ben daha önce sünnet olmanın meşru olduğu vakit ile ilgili görüş ayrılıklarını açıklamış bulunuyorum. \"Ve el-Kadum denilen yerde sünnet oldu.\" Buhari bu rivayette \"el-Kadum\" lafzının dal harfinin şeddesiz olduğuna işaret ettikten sonra, bir başka rivayet yoluyla bu harfin şeddeli olduğuna işaret etmiş ve \"burası bir yer adıdır\" fazlalığını eklemiştir. Buna dair gerekli açıklamaları da Enbiya ile ilgili hadisler bölümünde İbrahim aleyhisselam ile ilgili başlıkta sözü geçen hadisin şerhinde açıklamış bulunuyorum. el-Mühelleb dedi ki: Dal harfi şeddesiz olarak \"el-Kadum\" alet adıdır (keser aleti), şeddeli ise yer adıdır. (Devamla) der ki: İbrahim aleyhisselam hakkında her ikisinin söz konusu olması da mümkündür. Yani alet olarak keser ile ve bu adı taşıyan yerde sünnet olmuştur. Derim ki: Ben bunlardan hangisinin tercihe değer olduğunu da belirttiği m yerde açıklamış bulunuyorum. el-Cevzaki'nin, el-Müttefak adlıeserinde sahih bir senedie Abdurrezzak'tan: el-Kadum bir karye (kasaba) adıır, dediğini nakıetse.dir. Ebu'l-Abbas .esSerrac da Tarih'inde Ubeydullah ıbn Said'den, o yi hya ıbn Said'den, o ıbn AdEm'dan, o babasından, o Ebu Hureyre'den Peygam e merfu olarak: \"İbrahim, el-Kadum'da sünnet oldu\" rivayetini kaydetmiştir. Ubeydullah dedi ki: Ben Yahya'ya: Kadum nedir, diye sordum. O, baltadır, dedi. el-Kemal İbnu'l-Adim: Çoğunluk İbrahim aleyhisselam'ın kendisi ile sünnet olduğu kadum'un bildiğimiz alet olduğu görüşündedir, demektedir. \"O sırada ben sünnet edilmiştim.\" Yani sünnetinin gerçekleşmiş olduğunu anlatmaktadır. \"Onlar adamı buluğ yaşına yaklaşıncaya kadar sünnet etmezlerdi.\" Aklı erip ergenlik yaşına yaklaşıncaya kadar demektir",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 6301,
			"arabicnumber": 6301,
			"text": "Ebu Hureyre'den dedi ki: \"Rasulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: Kim yemin edip de yemin ederken: Lat ve Uzza hakkı için derse hemen: La ilahe illallah desin, kim arkadaşına: Gel seninle kumar oynayalım derse, hemen bir sadaka versin.\" Fethu'l-Bari Açıklaması: \"Kişiyi Allah'a itaatten alıkoyduğu takdirde her bir lehv batııdır.\" Lehv ile oyalanan kişinin o lehv ile meşgul iken \"Allah'a itaatten uzak kalması\" hali kast edilmektedir. Yapılmasında ister izin olsun, ister yasak olsun mutlak olarak herhangi bir şey ile oyalanan kimse gibi. Mesela, nafile bir namaz ile yahut Kur'an tilaveti, zikir ya da Kur'an'ın anlamları üzerinde tefekkür ile meşgulolup farz olan namaz vakti çıkana kadar bunu kasten sürdürecek olursa bu dahi bu çerçeve içerisine girer. Teşvik edilmiş ve yapılması istenmiş bu gibi işlerle uğraşmasının durumu bu olduğuna göre, bunlardan daha aşağı durumda olanların durumu ne olur? Bu başlığın baş tarafları, Ahmed'in ve dört Sünen sahibinin rivayet ettiği İbn Huzeyme ve Hakim'in sahih olduğunu belirttikleri Ukbe İbn Amiriden gelen merfu bir hadistendir: \"Müslüman kimsenin kendisi ile oyalanıp eğlendiği her bir şey batııdır. Okuyla yayatması, atını eğitmesi ve hanımıyla oynaşması hariç.\" Bu hadis, musannıf (Buhari)'in şartına uymadığından ötürü onu bir başlık lafzı olarak kullanmış gibidir. Hadisin manasından hareketle de sözü geçen hüküm ile ilgili kaydı getirmiş bulunmaktadır. Hadiste ok atma ile ilgili olarak lehv (oyalama) adının kullanılması, ok atıcılığını öğrenme arzusun da şekle n bir oyalanıp eğlenmeye benzemesinden dolayıdır. Ama atıcılığın öğrenilmesinden maksat, cihada yardım etme özelliğidir. Atın eğitilmesi de onun üzerinde yarışmaya işarettir. Kişinin hanımıyla oynaşması ise teselli ve benzeri durumlar içindir. Nebiin bunların dışındaki oyalayıcı şeyler hakkında batıl ifadesini kullanması, anlatım itibariyle mukabele (karşıt ifade ile anlatım) içindir. Yoksa hepsinin haram olan batıldan olduğu anlamında değildir. \"Ve arkadaşına: Gel seninle kumar oynayalım diyen kimse\"nin hükmü ne olur, demektir. \"Yüce Allah'ın: \"İnsanlardan kimisi bilgisizce Allah'ın yolundan saptırmak ... için boş sözleri satın alırlar. \"(Lukman, 6) buyruğu.\" İbn Battal'ın naklettiğine göre Buhari başlıkta lehv için getirdiği kaydı, yüce Allah'ın: \"Allah'ın yolundan saptırmak için\" buyruğundan istinbat etmiştir. Çünkü bunun mefhumundan anlaşılan şudur: Eğer onu Allah yolundan saptırmamak için satın alırsa, yerilmiş olmaz. Aynı şekilde başlığın mefhumundan da anlaşıldığına göre eğer lehv (oyalayıcı, eğlendirici iş) kişiyi Allah'a itaatten alıkoymayacak olursa batıl olmaz. Ancak bu mefhumun genel çerçevesi mantuk ile (lafzan dile getirilmiş naslarla) tahsis edilir. Oyalayıcı şeyler arasından haram olduğuna dair nas bulunan her bir şey batıl olur. İster itaatten meşgul edip alıkoysun, ister alıkoymasın. Sanki Buhari bu ) ayette geçen \"lehve'l-hadis: Boş sözler\"in şarkı ile tefsir edilmesine dair varid olmuş rivayetlerin zayıf oluşuna da işaret etmiş gibidir. Buhari daha sonra Ebu Hureyre'nin hadisini zikretmektedir. Bu hadiste: \"Her kim arkadaşına: Gel seninle kumar oynayalım derse ... \" ifadeleri yer almaktadır. Bununla da kumarın lehv (oyalayıcı işler) kabilinden olduğuna işaret etmiştir. Kumar oynamaya çağıran da masiyete çağırmış olur. Bundan dolayı bu masiyete keffaret olsun diye sadaka vermesini emir buyurmuştur. Çünkü bir masiyete çağıran bir kimse bu çağırması ile masiyete düşmüş olur. el-Kermanı der ki: Bu hadisin başlık ile, bu başlığın da ızin istemek ile ilgisi şudur: Kumara çağıran bir kimsenin eve girmesine izin verilmemelidir. Diğer taraftan kumar oynamak insanların bir araya gelip toplanmasını da ihtiva eder. Hadisin geri kalan bölümünün başlıkla ilgisine gelince: Lat adına yemin etmek haktan alıkoyup halk ile (yaratılmışlarla) meşgul eden bir oyalayıcı şeydir ve bu da batııdır. --- el-Kirmani'nin açıklamaları burada sona ermektedir. --- Bununla birlikte ilişkinin şöyle olma ihtimali de vardır: Buhari daha önce bir günah işleyen kimseye selam vermeyi terk etmeye dair bir başlık kaydettiğinden lehv ile uğraşıp itaati işleyemeyen kimselere izin vermemeye de işaret etmiş bulunmaktadır. Bu başlıktaki hadise dair açıklama Vennecmi suresinin tefsirinde (4860 nolu hadiste) geçmiş bulunmaktadır",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 6302,
			"arabicnumber": 6302,
			"text": "İbn Ömer r.a.'dan dedi ki: \"Ben kendimi Nebi Sallallahu Aleyhi ve Sellem ile birlikte kendi ellerimle beni yağmurdan koruyacak, güneşten gölgelendirecek bir ev bina ederken görmüşümdür. Onu yaparken Allah'ın yarattıklarından hiç kimse bana yardım etmemişti",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 6303,
			"arabicnumber": 6303,
			"text": "İbn Ömer dedi ki: \"Allah'a yemin ederim, Nebi Sallallahu Aleyhi ve Sellem'in ruhu kabzedildikten bu yana bir kerpici diğer bir kerpiç üstüne koymadım ve bir tek hurma ağacı dahi dikmedim.\" Süfyan dedi ki: Ben bunu onun ailesinden birisine zikrettim. O: \"Allah'a yemin ederim o bir ev bina etti, dedi. Süfyan dedi ki: Ben: Muhtemelen o bu sözünü onun dediği binayı yapmadan önce söylemiştir, dedim.\" Fethu'l-Bari Açıklaması: \"Bina yapmaya dair gelmiş buyruklar.\" Yani yapmanın yasak ya da mubah oluşu ile ilgili gelmiş rivayetler. Bina, çamur, kil, ahşap, kamış ya da kıldan yapılan yapı türlerinden daha geniş kapsamlıdır. \"Ebu Hureyre, Nebi Sallallahu Aleyhi ve Sellem'den dedi ki: Kıyametin şartlarından (alametlerinden) birisi de kuzu, oğlak çobanlarının uzun bina yapmakta birbirleriyle yarışacakları zamandır.\" Bu hadis, muttasıl senedi ile uzun olarak şerhiyle birlikte İman bölümünde geçmiş bulunmaktadır. Hadisin bu bölümünü burada zikretmekle, uzun bina yapmakta yarışmanın yerildiğine işaret etmektedir. Kayıtsız ve şartsız olarak bina yapmanın yerilmesi hakkında da Habbab'ın merfu olarak rivayet ettiği şu hadis varid olmuştur. Nebi Sallallahu Aleyhi ve Sellem buyurdu ki: \"Kişi bütün nafakası (harcamaları)ndan ötürü ecir alır, toprak için harcadıkları\" -yada \"bina\" demiştir- müstesna\". Hadisi sahih olduğunu belirterek Tirmizi rivayet etmiş, ayrıca Enes'den buna şahit olarak şu lafızIa bir başka hadis de rivayet etmiştir: \" ... Bundan bina müstesnadır, onda hayıryoktur.\" Taberani de, Cabir'den şu merfu hadisi rivayet etmiştir: \"Allah bir kul ıkwsırida bir şer murad ederse bina yapıncaya kadar ona kerpiç ve çamuru güzel gösterir.\" Ebu Davud da, Abdullah İbn Amr İbn el-As'dan şöyle dediğini rivayet etmektedir: \"Bir gün ben bir duvarı çamur ile sıvarken Nebi Sallallahu Aleyhi ve Sellem yanımdan geçti ve şöyle buyurdu: İş, bundan daha da çabuk gelecektir.\" Tirmizi ve İbn Hibban bu hadisin sahih olduğunu belirtmişlerdir. Bütün bunlar yerleşmek, soğuğa ve sıcağa karşı korumak için mutlaka gerekli olanlar dışında kalıp ihtiyaç duyulmayan şeyler hakkında yorumlanır. Yine Ebu Davud, Enes'den Nebie merfu olarak şu hadisi rivayet etmiştir: \"Amma her bir bina, sahibi için vebaldir. Mutlaka gerekli olan, mutlaka ihtiyaç duyulan müstesna.\" \"Allahlın yarattıklarından hiç kimse, onu bina etmek için bana yardım etmedi.\" Bu da \"ellerimle bina ettim\" sözünü tekid edip başkasına külfetinin çok az olduğuna bir işarettir. \"Ne bir hurma ağacı diktim.\" ed-Davudi dedi ki: Ağaç dikmek, bina yapmak gibi değildir. Çünkü her kim ihtiyacı kadarını karşılamak yahut ondan dolayı bir fazilet elde etmek niyeti ile bir ağaç dikerse, böyle bir işte günah değil, fazilet vardır. Derim ki: Rivayette günah diye bir şeyden söz edilmediği için böyle bir itiraza gerek yoktur. Diğer taraftan onun bu ifadeleri her türlü bina yapmanın günah olduğu izlenimini vermektedir. Oysa durum böyle değildir. Aksine bu hususta duruma göre farklı hüküm söz konusudur. İhtiyaç fazlası olan her şey de günahı gerektirmez. Şüphesiz ağaç dikmekte, onun mahsulünden yenildiği için bina yapmakta söz konusu olmayan bir ecir vardır. Bununla birlikte bazı binalar dolayısıyla ecir de elde edilebilir. Binayı yapandan başkası için faydalı olan binalarda olduğu gibi. Böyle bir durumda binayı yapan sevap elde eder. Doğrusunu en iyi bilen şanı yüce Allah'tır. İbn Battal der ki: Süfyan'ın verdiği cevaptan anlaşıldığına göre ilim adamı bir zattan birbirinden farklı iki görüş nakledilecek olursa, bu iki sözü işiten kimsenin bu sözleri o halinin yalancılıktan tenzih edilmesi için çelişkinin sözkonusu olmayacağı bir şekilde yorumlaması gerekir. Belki de Süfyan, İbn Ömer'in yakınlarından birisinin o sözlerinden Süfyan'a, Amr İbn Dinar'dan, onun da İbn Ömer'den diye naklettiği rivayeti reddettiği anlamını çıkardığı için Süfyan da hemen hem kendi hocasının, yardımına koşmOl.k hem de kendisinin (yalancılık ithamından kurtarmak amacıyla) yardımına koşmak istemiş, kendisine bu hususta muhatap olan kimseye karşı edebe uygun olan yolu izleyerek sözünü ettiği telif yolunu dile getirip, açıklamıştır. Doğrusunu en iyi bilen şanı yüce Allah'tır",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 75
			}
		}
	]
}