{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"80": "Invocations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6304,
			"arabicnumber": 6304,
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6305,
			"arabicnumber": 6305,
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6306,
			"arabicnumber": 6306,
			"text": "Buşeyr ibn Ka'b el-Adevî şöyle demiştir: Bana Şeddâd ibn Evs (radıyallahü anh) tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem) şöyle buyurmuştur: \"Seyyidu'l-istiğfâr (yânı istiğfar dualarının ulusu) Allah'tan şöyle mağfiret dilemektir: ente Rabbî lâ ilahe illâ ente, halaktenî ve ene abduke ve ene alâ ahdike ve va'dike mastata'tu. Eûzu bike min şerri mâ sana'tu. Ebûu leke bi-nîmetike aliyye ve ebûu bi-zenbî fağfir lî. Fe-innehû lâ yağfiru'z-zunûbe illâ ente. Allah! Benim Rabb'im Sen'sin. Sen'den başka ilâh yoktur. Beni Sen yarattın. Ben Sen'in kulunum ve gücüm yettiği kadar ezelde Sana verdiğim ahd ve va'd üzere sabitim. İşlediğim günâhların şerrinden Sana sığınırım. Bana ihsan eylediğin ni'metlerini i'tirâf ederim, günâhımı da i'tirâf ederim. Benim günâhlarımı mağfiret eyle! Şu muhakkak ki, günâhları Sen'den başkası mağfiret edemez!)\" buyurdu ki: \"Bu seyyidu'l-istiğfâr duasını her kim kalbiyle sevâb ve faziletine kesin inanarak gündüz okur da o gün akşama girmeden önce ölürse, o kimse cennet ehlindendir. Her kim de sevâb ve faziletine kesin inanarak bunu geceleyin okur da sabaha girmeden evvel ölürse, o kimse de cennet ehli zümresindendir",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6307,
			"arabicnumber": 6307,
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6308,
			"arabicnumber": 6308,
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6309,
			"arabicnumber": 6309,
			"text": "Buradaki iki senedde Enes ibn Mâlik(radıyallahü anh) şöyle demiştir: aleyhi ve sellem):\"Allah, kulunun teybe etmesiyle, herhangi birinizin çöl bir arazîde kaybetmiş olduğu devesine ansızın tesadüf edivermesi anındaki sevincinden daha çok sevinir\" buyurdu",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6310,
			"arabicnumber": 6310,
			"text": "Âişe (r.anha) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) geceleyin onbir rek'at namaz kılardı. Fecr tulü' ettiği zaman da hafif iki rek'at daha kılar, sonra müezzin ikaameti haber vermek üzere gelinceye kadar sağ yanı üzerine yatardı",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6311,
			"arabicnumber": 6311,
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6312,
			"arabicnumber": 6312,
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6313,
			"arabicnumber": 6313,
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6314,
			"arabicnumber": 6314,
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6315,
			"arabicnumber": 6315,
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6316,
			"arabicnumber": 6316,
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6317,
			"arabicnumber": 6317,
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6318,
			"arabicnumber": 6318,
			"text": "Bize Şu'be, el-Hakem ibn Uyeyne'den; o da Abdurrahman ibn Ebî Leylâ'dan; o da Alî ibn Ebî Tâlib (radıyallahü anh)'den şöyle tahdîs etti: Fâtıma aleyha's-selâm el değirmeni çevirmekten dolayı eline rahatsızlık geldiğinden şikâyet etti. Peygamber(sallallahü aleyhi ve sellem)'den bir hizmetçi istemek üzere, Peygamber'in evine geldi, fakat evde Peygamber'i bulamadı. Bu dileğini Âişe'ye zikretti. Peygamber gelince Âişe, Fâtima'nın isteğini kendisine haber verdi. dedi ki: Biz yataklarımıza girmiş hâlde idik ki, Peygamber bize geldi. Ben kalkmağa davrandım. Rasûlüllah: \"Yerinde kal!\" buyurdu, ve ikimizin arasına oturdu. Hattâ ben göğsümün üstüne dokunan iki ayağının serinliğini hissettim. Rasûlüllah: \"İyi dinleyiniz! Size benden istediğiniz hizmetçiden daha hayırlı olan birşeye delâlet ediyorum: İkiniz döşeğinize girdiğiniz -yahut: İkiniz yataklarınızda yerinizi alıp yattığınız- zaman otuzüç kerre Allâhu Ekber, otuzüç kerre Subhânallahu, otuzüç kerre de Lâ ilahe ille'llâh söyleyerek tevhîd ediniz. İşte bunları söylemek, ikiniz için bir hizmetçiden daha hayırlıdır\" buyurdu. o da Hâlid el-Hazzâ'dan gelen rivayete Muhammed ibn Sîrîn: Tesbîh, otuzdörttür, demiştir",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 6319,
			"arabicnumber": 6319,
			"text": "el-Leys tahdîs edip şöyle demiştir: Bana Ukayl, İbn Şihâb'dan tahdîs etti. Bana Urve, Âişe (r.anha)'den şöyle haber verdi: Rasûlüllah(sallallahü aleyhi ve sellem) yatağında yerini aldığı zaman iki eline Muavvize Sûreleri'ni okuyup nefes eder ve elleriyle bedenine meshederdi",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 6320,
			"arabicnumber": 6320,
			"text": "Bize Zuheyribn Muâviye tahdîs etti. Bize Ubeydullah ibn Omer tahdîs etti. Bana Saîd ibnu Ebî Saîd el-Makburî, babasından tahdîs etti ki, Ebû Hureyre (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) şöyle buyurdu: biriniz döşeğine gireceği zaman izârının iç tarafıyle döşeğini silksin. Çünkü o kimse, kendisinin ardından döşeğine hangi mahlûkun girdiğini bilmez- Silktikten sonra şu duayı söyler: Rabbi, veda'tu cenbî, ve bike erfeuhû, İn emsekte nefsî ferhamhâ, Ve in erseltehâ fahfezhâ bimâ tahfezu bihî ibâdeke's- sâlihîn. Rabb'im, ancak Sen'in isminle yan tarafımı yatağıma koydum. Sen'in isminle de kaldırırım. (Ey Rabb'im!) Eğer canımı tutup alacaksan, nefsime merhamet ihsan eyle! Eğer salıverip hayâtta bırakacaksan, hayâtımı sâlih kullarını muhafaza ettiğin himayenle muhafaza eyle!)\" rivayet etmekte Ebû Demre ile İsmâîl ibn Zekeriyyâ da Zuheyr ibn Muâviye'ye mutâbaat etmişlerdir. Yahya ibn Saîd ile Bişr de Ubeydullah'tan; o da Saîd el-Makburî'den; o da Ebû Hureyre'den; o da Peygamber(sallallahü aleyhi ve sellem)'den söylediler. Bu hadîsi İmâm Mâlik ile İbnu Aclân da Saîd el-Makburî'den; o da Ebû Hureyre'den; o da Peygamber(sallallahü aleyhi ve sellem)'den olmak üzere rivayet etmişlerdir",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 6321,
			"arabicnumber": 6321,
			"text": "Bize Mâlik, ibn Şihâb'dan; oda Ebû Abdillah el-Agarr ile Ebû Seleme ibn Abdirrahmân'dan; onlar da Ebû Hureyre (radıyallahü anh)'den tahdîs ettiler ki,Rasûlüllah(sallallahü aleyhi ve sellem) şöyle buyurmuştur: \"Rabb'imiz Tebâreke ve Taâlâ her gece, gecenin son üçte biri kaldığı zaman (keyfiyeti bizce bilinmez bir hâlde) dünyâ semâya iner ve: Bana kim dua eder ki, onun duasını kabul edeyim! Benden kim bir hacetini ister ki, ona dileğini vereyim! Benden kim mağfiret ister ki, ona mağfiret edeyim! buyurur",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 6322,
			"arabicnumber": 6322,
			"text": "Enes ibn Mâlik (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) hacetini gidermek için halâya gireceği zaman: \"Allâhumme, innî eûzu bike minel-hubusi ve’l-habâisi ( = Yâ Allah, ben bütün habislerden ve habîselerden Sana sığınırım)\"duasını söylerdi",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 6323,
			"arabicnumber": 6323,
			"text": "Bize Abdullah ibn Bureyde, Buşeyr ibn Ka'b'dan; o da Şeddâd ibn Evs'ten tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem):\"Seyyidu'l-istiğfâr şudur: ente Rabbî Lâ ilahe illâ ente. Halaktenî. Ve ene abduke ve ene ala ahdike ve va'dike mastata 'tu. Ebûu leke bi-ni'metike ve ebûu leke bi-zenbî. Fağfir lî. Fe-innehû lâ yağfiru'z-zunûbe illâ ente. Eûzu bike min şerri mâ sana'tu! = Yâ Allah! Benim Rabb'im Sen'sin. Sen'den başka ilâh yoktur. Beni Sen yarattın. Ben Sen'in kulunum. Ben gücümün yettiği derecede Sen'in ahdin ve va'din üzere sabitim. Ben Sen'in ihsan ettiğin ni'metlerini i'tirâf ediyor ve günâhlarımı da i'tirâf ediyorum. Bana mağfiret eyle! Şu muhakkak ki, günâhları Sen'den başkası mağfiret edemez. Ben işlediğim işlerin şerrinden Sana sığınıyorum!) akşama girerken bu duayı söylediği zaman, o gece ölürse cennete girer -yahut: Cennet ehlinden olur-. Bu duayı sabaha girerken söylediği zaman da o gününde ölürse, o da Öteki gibi cennet ehlinden olur",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 6324,
			"arabicnumber": 6324,
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 6325,
			"arabicnumber": 6325,
			"text": "Ebû Zerr (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) geceleyin yatağında yerini aldığı zaman: \"Allâhumme, bismike emûtu ve ahyâ\" der idi. Uyandığı zaman da: “el-Hamdu lillâhi’llezî ahyânâ ba'demâ emâtenâ ve ileyhi’n-nuşûru!\" der idi",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 6326,
			"arabicnumber": 6326,
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 6327,
			"arabicnumber": 6327,
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 6328,
			"arabicnumber": 6328,
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 6329,
			"arabicnumber": 6329,
			"text": "Bize Verkaa, Sumeyy'den; o da Ebû Salih'ten; o da Ebû Hureyre (radıyallahü anh)'den şöyle haber verdi: Muhacirlerin fakîrleri: Yâ Rasûlallah! Çok mâl sâhibleri yüksek dereceleri ve devâmlı ni'meti kazanıp gittiler! dediler. aleyhi ve sellem): \"Bu senin söylediğin nasıl oldu?\" diye sordu. Onlar şöyle dediler: Zenginler hem bizim kıldığımız gibi namaz kıldılar, bizim cihâd ettiğimiz gibi cihâd ettiler, hem de mallarının fazlalarından Allah yolunda harcadılar. Halbuki bizim için mallar yok (bu yüzden onların harcama yaptıkları gibi harcama yapamıyoruz)? dediler. \"Ben size bir iş haber vereyim mi ki, siz onu yapmakla sizden önde olanlara erişirsiniz, sizden sonra gelen mal sahiblerinin de önlerine geçersiniz. Sizin yaptığınızın benzerini yapan herbir kimse de ancak sizin yaptığınızın benzerini yapar: Her (farz) namazın ardından on kerre tesbîh eder, on kerre tahmîd eder, on kene tekbîr getirirsiniz\" buyurdu. hadîsi Sumeyy'den rivayet etmekte Verkaa'ya Ubeydullah ibn Omer mutâbaat etti. Bu hadîsi Muhammed İbnu Aclân da Sumeyy'den ve Recâ ibn Hayve'den rivayet etti. yine bu hadîsi Cerîr de Abdulazîz ibn Rufey'den; o da Ebû Salih'ten; o da Ebu'd-Derdâ'dan rivayet etti. hadîsi Süheyl de babası Ebû Sâlih Zekvân'dan; o da Ebû Hureyre'den; o da Peygamber'den rivayet etti",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 6330,
			"arabicnumber": 6330,
			"text": "Verrâd şöyle demiştir: el-Mugîre ibn Şu'be, Muâviye ibn Ebı Sufyân'a (gönderdiği mektûbda) şunu yazdı: Rasûlüllah(sallallahü aleyhi ve sellem) her namazın ardında selâm verdiği zaman şu duayı söylerdi: ilahe ille'llâhu vahdehû lâ şerike lehu, lehu’l-mulku ve lehu’l-hamdu ve huve ala kullî şey’in kadîrun. Allâhumme lâ mania lima a'teyte, ve lâ mu'tiye limâ mena’te, ve lâ yenfeu za’l-ceddi minke’l-ceddu! = Allah'tan başka hiçbir ilâh yoktur. O tek'tir, O'nun hiçbir ortağı yoktur. Mülk O'nundur. Hamd O'na mahsûstur. Herşeye kudreti yeten de O'dur. Allah'ım! Sen'in verdiğine mâni' olabilecek hiç yok, vermediğini verebilecek de hiç yok! Baht ve zenginlik sahibinin baht ve zenginliği Sen'in lütuf ve ihsanın yerine geçip de kendisine fâide vermez!)\" ibnu'l-Haccâc, Mansûr ibnu'l-Mu'temir'den söyledi. O da: Ben el-Müseyyeb ibn Râfi'den işittim, dedi(de bu hadîsi rivayet etti)",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 6331,
			"arabicnumber": 6331,
			"text": "Bize Seleme ibnu’l-Ekva' (radıyallahü anh) tahdîs edip şöyle dedi: Biz Peygamber(sallallahü aleyhi ve sellem)'in beraberinde Hayber gazvesine çıkmıştık. Giderken kaafileden bir adam (Âmir ibnu'l-Ekva'a): Yâ Âmir! Bize kısa vezinli şiirlerinden biraz işittirsen! dedi. Bu istek üzerine Âmir, bineğinden indi de onların develerini şu şiirini hatırlatıp söyleyerek yürütüyordu: levlâ'llâhu ma'htedeynâ Velâ tasaddaknâ velâ salleynâ..... ve bundan sonraki mısraları söylüyordu. el-Kattân: Yezîd ibn Ebî Ubeyd bundan başka bir şiir de zikretti, lâkin ben onu ezberimde tutamadım, demiştir.Rasûlüllah: \"Şiir inşâd edip develeri yollandıran kimdir?\" diye sordu. Sahâbîler: Âmir ibnu'l-Ekva'dır! dediler. Rasûlüllah: \"Allah Âmir'e rahmet eylesin!\" diye duâ etti. Kaafileden bir adam (Omer ibnu'l-Hattâb): Yâ Rasülallah! Keşki Âmir'le (onun şiir ve yiğitliğiyle) bizleri faydalandırsaydın! dedi. Hayber'de ordu saff bağlayıp Yahûdîler'le harb ettikleri sırada Âmir, kendi kılıcının keskin tarafı kendisine isabet etti ve bu yaradan şehîd oldu. (Hayber'in fethedildiği gün) akşam olunca sahâbîler pekçok ateşler yakmışlardı. Rasûlüllah: \"Bu ateşler nedir? Neyin üzerine yakıyorsunuz?\" diye sordu. Evcil eşeklerin etlerini pişirmek üzere! diye cevâb verdiler. Rasûlüllah: \"O tencereler içinde olan etleri dökünüz, kapları da kırınız!\" buyurdu. bir adam: Yâ Rasülallah! İçlerindeki etleri döküp kaplarını yıkasak olmaz mı? diye sordu. \"Yâhud öyle yapınız!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 6332,
			"arabicnumber": 6332,
			"text": "Abdullah ibn Ebî Evfâ (radıyallahü anh) şöyle demiştir:Peygamber(sallallahü aleyhi ve sellem)'in âdeti, kendisine bir adam bir sadaka getirdiği zaman, onun için: \"Yâ Allah! Fulân ailesine salât eyle!\" diye duâ ederdi. Babam Ebû Evfâ da Peygamber'e kendi sadakasını getirdiği zaman, onun için de; \"Yâ Allah! Ebû Evfâ ailesine salât eyle!\" diye duâ etti",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 6333,
			"arabicnumber": 6333,
			"text": "Kays ibn Ebî Hazım şöyle demiştir: Ben Cerîr ibn Abdillah (radıyallahü anh)'tan işittim, o şöyle dedi: Rasûlüllah (sallallahü aleyhi ve sellem) bana: \" (Ey Cerîr!) Şu Zu'l-Halasa'dan beni rahata kavuşturmaz mir sın?\" buyurdu. O, dikili putlar için yapılmış bir bina idi ki, ona ibâdet ediyorlar ve \"el-Ka'betu’l-Yemâniyye\" diye isim veriyorlardı. dedi ki: Ben: Yâ Rasûlallah! Ben at üzerinde sabit duramayan bir adamım! dedim. üzerine Rasûlüllah göğsüme vurdu da: \"Yâ Allah! Sen Cerîr'i at üzerinde sabit tut ve onu hâdî ve mehdi kıl!\" diye duâ etti. dedi ki: Müteakiben ben kavmim olan Ahmes kabilesinden elli süvârî'nin başında Zu'l-Halasa'ya doğru yola çıktım. -Bazen râvî Sufyân ibn Uyeyne: \"Kavmimden bir topluluk içinde hareket ettim\" dediğini söylemiştir.- Sonunda Zu’l-Halasa'ya vardım ve onu yaktım. SonraPeygamber'e geldim ve: Yâ Rasûlallah! Vallahi ben Sen'in huzuruna muhakkak o put evini uyuz deve gibi bıraktıktan sonra geldim! dedim. sözüm üzerine Rasûlüllah Ahmes kabilesine ve süvarilerine duâ etti",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 6334,
			"arabicnumber": 6334,
			"text": "Katâde şöyle dedi: Ben Enes ibn Mâlik (radıyallahü anh)'ten işittim, şöyle dedi: Annem Ümmü Suleym, Peygamber(sallallahü aleyhi ve sellem)'e: Bu Enes, Sen'in hizmetçindir! dedi.Peygamber: \"Yâ Allah! Sen bu çocuğun malını ve zürriyetini çoğalt, ona verdiklerinde kendisi lehine bereketler ihsan eyle!\" diye duâ etti",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 6335,
			"arabicnumber": 6335,
			"text": "Âişe (r.anha) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) mescidde Kur'ân okumakta olan bir adamın sesini işitti de: \"Allah ona merhamet eyleşin! Yemin olsun o bana, fulân ve fulân sûrede düşürmüş olduğum şu ve şu âyetleri hatırla'mıştır\" bıyurdu",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 6336,
			"arabicnumber": 6336,
			"text": "Abdullah ibn Mes'ûd (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) -Huneyn harbi sonunda- bir ganîmet taksimi yapmıştı. Bu sırada (câhil bedevi) bir adam: Şübhesiz bu, kendisinde Allah'ın rızâsı kasdolunmayan bir taksimdir! dedi. de onun bu sözünü Peygamber'e haber verdim. Peygamber bu sözden çok öfkelendi. Hattâ ben O'nun yüzünde öfke eserini gördüm. SonraPeygamber: \"Allah Musa'ya rahmet eylesin! Yemin olsun o, bundan daha çok sözlerle ezâlandırılmıştı da sabretmişti\" buyurdu",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 6337,
			"arabicnumber": 6337,
			"text": "İbn Abbâs radıyallahü anhüma -irşâd emri olarak- şöyle demiştir: İnsanlara her cumua günü bir kerre hadîs tahdîs et. Eğer bunu az görüp kabul etmezsen, her haftada iki kerre tahdîs et! Eğer daha fazla yapmak istersen, haftada üç defa ders yap! İnsanları bu Kur'ân'dan bıktırma! Sakın seni, bir topluluk, kendi hadîslerinden bir hadîs üzerinde konuşurlarken onların yanına gelip de onlara karşı hadîs kıssa eder ve böylece onların konuşmalarını keser ve onları usandırıp bıktırır hâlde bulmayayım! Lâkin kendin (onlara kulak verip) sus! Onlar sana kendilerine ders anlatmanı isteyip emrederlerse, onlar derse arzulu bulundukları hâlde onlara hadîs ve ders tahdîs et! Duadan da seci'li nev'ini bırak da böylesinden sakın! (Zihnini böylesiye meşgul etme!) Çünkü ben Rasûlüllah(sallallahü aleyhi ve sellem)'tan ve sahâbîlerinden seci'li ve kaafiyeli duâ ile meşgul olmadıklarını bilmişimdir. Yâni onlar bunu değil de ancak seci'li ve kaafiyeli sözlerden çekinmeyi yapıyorlardı",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 6338,
			"arabicnumber": 6338,
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 6339,
			"arabicnumber": 6339,
			"text": "Bize Abdullah ibn Mesleme, Mâlik'ten; o da Ebu'z-Zinâd'dan; o da el-A'rec'den; o da Ebû Hureyre (radıyallahü anh)'den tahdîs etti ki, Rasûlüllah(sallallahü aleyhi ve sellem) şöyle buyurmuştur: \"Sakın sizin biriniz 'Yâ Allah! Dilersen beni mağfiret eyle! Yâ Allah! Dilersen bana merhamet eyle!' diye dua etmesin. İstemeyi azim ve kat’iyyetle, kesin bir ifâde ile yapsın! Çünkü şübhesiz Allah için hiçbir zorlayıcı yoktur",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 6340,
			"arabicnumber": 6340,
			"text": "Bize Mâlik, İbn Şihâb'dan; o da İbnu Ezher'in himayesinde bulunan Ebû Ubeyd'den; o da Ebû Hureyre (radıyallahü anh)'den haber verdi ki, Rasûlüllah(sallallahü aleyhi ve sellem):\"Sizden herbirinizin duasına acele etmediği takdirde icabet olunur: İnsan (acele edip): 'Dua ettim de kabul olunmadı' der\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 6341,
			"arabicnumber": 6341,
			"text": "Ebû Abdillah el-Buhârî dedi ki: bana el-Uveysî söyledi: Bana Muhammed ibn Ca'fer, Yahya ibn Saîd'den ve Serik'ten; onlar da Enes'ten işittiler diye tahdîs etti ki, Enes (radıyallahü anh):Peygamber(sallallahü aleyhi ve sellem) ellerini kaldırdı, hattâ ben O'nun iki koltuk altı beyazlığını gördüm, demiştir",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 6342,
			"arabicnumber": 6342,
			"text": "Enes ibn Mâlik (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) bir cumua günü hutbe yaparken bir adam kalktı da: Yâ Rasûlallah! Allah'a duâ et de bize yağmur yağdırsın! dedi. duası akabinde) gökyüzü hemen bulutlandı ve bol yağmura kavuşturulduk, hattâ her bir insan nerdeyse kendi menziline ulaşamıyordu. Gelecek cumuaya kadar üzerimize hep yağmur yağdırılmaya devam etti. Ertesi cumua (yine hutbe sırasında) bu adam yahut bir başkası ayağa kalktı da: Yağmuru bizden döndürmesi için Allah'a duâ ediver, sulara gömüldük! dedi. \"Allâhumme havâleynâ velâ aleynâ( = Yâ Allah etrafımıza yağdır, üzerimize değil)\" diye duâ etti. bulutlar Medîne'nin etrafına parçalanmaya ve Medîne ahâlîsi üzerine yağmur yağmamaya başladı",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 6343,
			"arabicnumber": 6343,
			"text": "Abdullah ibn Zeyd (radıyallahü anh): Peygamber(sallallahü aleyhi ve sellem) yağmur duası yapmak üzere şu musallaya çıktı, orada duâ etti ve yağmur yağdırılmasını istedi. Sonra kıbleye karşı yöneldi ve ridâsını çevirdi, demiştir",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 6344,
			"arabicnumber": 6344,
			"text": "Enes ibn Mâlik (radıyallahü anh) şöyle demiştir: Annem Ümmü Suleym: Yâ Rasûlallah! Enes Sen'in hizmetçindir, onun lehine Allah'a duâ ediver! dedi. \"Allâhumme, eksir mâlehû ve veledehû, ve bârik lehu fîmâ a’taytehû”- Yâ Allah! Onun malını ve evlâdını çoğalt, verdiğin nimetlerinde de ona bereket ihsan eyle)\" diye duâ etti",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 6345,
			"arabicnumber": 6345,
			"text": "Bize Katâde, Ebû'l-Âliye'den tahdîs etti. İbn Abbâs radıyallahü anhüma şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) keder ve hüzün veren şeyler sırasında duâ eder, şunu söylerdi: ilahe ille'llahu'l-Azîmu'l-Halîm. Lâ ilahe ille'llâhu Rabbu's-Semâvâti ve'l-Ardı, Rabbu’l-Arşı’l-Azîm = (İbâdete lâyık) hiçbir ilâh yok, ancak Azîm ve Halîm olan Allah vardır. İbâdete lâyık hiçbir ilâh yok, ancak göklerin ve Yer'in Rabb'i olan Allah vardır. O, büyük Arş'ın Rabbi'dir",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 6346,
			"arabicnumber": 6346,
			"text": "Bize Yahya (ibn Saîd el-Kattân), Hişâm ibn Ebî Abdillah'tan; o da Katâde'den; o da İbn Abbâs radıyallahü anhüma'tan şöyle tahdîs etti: Rasûlüllah (sallallahü aleyhi ve sellem) keder sırasında şu duayı söyler idi: \"Lâ ilahe ille'llâhu'l-Azîmu'l-Halîmu, Lâ ilahe ille’llahu Rabbu'l-Arşı'l-Azîmi. Lâ ilahe ille'llâhu Rabbu's-Semâvâti, ve Rabbu'l-Ârdı, Ve Rabbu'l-Arş’l'Kerîm! (İbâdete lâyık) hiçbir ilâh yok, ancak Azîm ve Halîm olan Allah vardır. (İbâdete lâyık) hiçbir ilâh yok, ancak büyük Arş'ın Rabbi olan Allah vardır. İbâdete lâyık hiçbir ilâh yoktur, ancak göklerin Rabb'i, Yer'in Rabb'i ve Kerîm Arş'ın Rabb'i olan Allah vardır!]\" Vehb de şöylededi: Bize Şu'be, Katâde'den bunun benzerini tahdîs etti",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 6347,
			"arabicnumber": 6347,
			"text": "Bize Sufyân ibn Uyeyne tahdîs etti. Bana Sumeyy, Ebû Salih'ten; o da Ebû Hureyre (radıyallahü anh)'den tahdîs etti: Rasûlüllah(sallallahü aleyhi ve sellem) belânın meşakkatinden, şakaanın erişmesinden, kazanın kötüsünden, düşmanların sevinmesinden Allah'a sığınır idi. Sufyân ibn Uyeyne: Ebû Hureyre'nin bu hadîsi üç şey idi: Birisini ben ziyâde ettim. Ziyâde ettiğim o bir, bunların hangisidir, bilmiyorum, demiştir",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 6348,
			"arabicnumber": 6348,
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 6349,
			"arabicnumber": 6349,
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 6350,
			"arabicnumber": 6350,
			"text": "Kays dedi ki: Habbâb’ın yanına vardım, yedi defa karnını dağlamış bulunuyordu; ve kendisini şöyle derken işittim: Peygamber(sallallahü aleyhi ve sellem) ölümü istememizi yasaklamamış olsaydı, mutlakaa gelmesini isteyecektim",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 6351,
			"arabicnumber": 6351,
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 6352,
			"arabicnumber": 6352,
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 6353,
			"arabicnumber": 6353,
			"text": "es-Sâib ibn Yezîd (radıyallahü anh) şöyle diyordu: Çocukluğumda teyzem beni Rasülullah (sallallahü aleyhi ve sellem)'ın yanına götürdü de: Yâ Rasûlallah! Benim şu kızkardeşimin oğlunun ayağından rahatsızlığı var! dedi. başımı eliyle sıvadı ve bana bereket duası etti. Sonra abdest aldı. Ben O'nun abdest suyundan içtim. Sonra sırtının arka tarafında durdum da iki kürek kemiği arasında gerdek çadırının koca düğmeleri -yahut: Keklik yumurtası- gibi olan Peygamberlik Mührü'ne baktım. Saîd ibnu Ebî Eyyûb tahdîs etti ki, Ebû Akîli, dedesi Abdullah ibn Hişâm (radıyallahü anh) çarşıdan yahut çarşıya çıkarır idi de, kendisi yiyecek maddesi satın alırdı. Bu sırada Abdullah ibn Hişâm'a İbnu'z-Zubeyr ile İbn Omer kavuşurlar da ona: Aldığın şeye bizleri ortak yap. Çünkü Peygamber (sallallahü aleyhi ve sellem) sana bereket duası yapmıştır, derlerdi. da bu ikisini, satın aldığı mala ortak yapardı. Bâzı zaman olurdu ki, (Peygamber'in duası sebebiyle) tamâm bir deve yükü kâr isabet ederdi de, o kârı Abdullah (olduğu gibi) evine gönderirdi",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 6354,
			"arabicnumber": 6354,
			"text": "İbn Şihâb şöyle demiştir: Bana Mahmûd ibnu'r-Rabî' (radıyallahü anh) haber verdi: Kendisi (beş yaşında) bir çocuk iken kendilerine âid olan bir kuyunun başında Rasûlüllah (sallallahü aleyhi ve sellem) onun yüzüne ağzıyle su püskürtmüş olduğu kimsedir",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 6355,
			"arabicnumber": 6355,
			"text": "Âişe (r.anha) şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem)'e çocuklar getirilirdi; O da çocuklar için duâ ederdi. Bir kerresinde küçük bir çocuk getirildi, o küçük çocuk Peygamber'in elbisesi üzerine bevletti. Peygamber biraz su istedi de o suyu idrarın üzerine akıttı ve onu yıkamadı",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 6356,
			"arabicnumber": 6356,
			"text": "ez-Zuhrî şöyle dedi: Bana Abdullah ibnu-Sa'lebe ibn Suayr haber verdi. Bu Abdullah'ı Rasûlüllah (sallallahü aleyhi ve sellem) -Fetih yılında- eliyle dokunup meshetmişti. İşte bu Abdullah, Sa'd ibn Ebî Vakkaas'ı tek rek'atle vitr namazı kılarken görmüştür",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 6357,
			"arabicnumber": 6357,
			"text": "Bize el-Hakem ibn Uteybe tahdîs edip şöyle dedi: Ben Abdurrahmân ibnu Ebî Leylâ'dan işittim, şöyle dedi: Bana bir kerresinde Ka'b ibn Ucre (radıyallahü anh) kavuştu da, şöyle dedi: Sana Peygamber'den işittiğim bir hediye vereyim mi? Peygamber (sallallahü aleyhi ve sellem) bizim yanımıza çıktı. Biz O'na: Yâ Rasûlallah! Bizler Sen'in üzerine nasıl Selâm okuyacağımızı bildik. Fakat Sen'in üzerine nasıl Salât okuyacağız (bunu bilmiyoruz)? dedik. bize; \"Allâhumme salli alâ Muhammedin ve alâ âli Muhammedin. Kemâ salleyte alâ âli İbrâhîme inneke Hamîdun Mecîdun. bârik alâ Muhammedin ve alâ âli Muhammedin. Kemâ bârekte alâ âli İbrâhîme inneke Hamîdun Mecîdun. Yâ Allah! Muhammed'e ve Muhammed'in âli üzerine, İbrahîm'in âli üzerine salât ettiğin gibi salât et. Şübhe yok ki, Sen Hamîd'sin, Mecîd'sin. Yâ Allah! Muhammed'e ve Muhammed'in âline, İbrahim'in âline bereket ihsan ettiğin gibi bereket ihsan eyle! Şübhesiz ki, Sen Hamîd'sin, Mecîd'sin!) deyiniz\" buyurdu",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 6358,
			"arabicnumber": 6358,
			"text": "Ebû Saîd el-Hudrî (radıyallahü anh) şöyle demiştir: Biz: Yâ Rasûlallah! Şu Sen'in üzerine okunacak Selâm'dır (biz onu biliyoruz), fakat biz Sen'in üzerine nasıl Salât edeceğiz? diye sorduk. aleyhi ve sellem): \"Allâhumme salli alâ Muhammedin abdike ve Rasûlike, kemâ salleyte alâ İbrâhime. Ve bârik alâ Muhammedin ve alâ âli Muhammedin, kemâ bârekte alâ İbrâhime ve âli İbrâhîm. (= Yâ Allah, Sen'in kulun ye Rasûlün olan Muhammed'e, İbrahim'in âline salât ettiğin gibi salât eyle! Ve Muhammed'le Muhammed'in âline, İbrâhîm ile İbrâhîm'in âline bereketler ihsan ettiğin gibi bereket ihsan eyle!) deyiniz\" buyurdu",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 6359,
			"arabicnumber": 6359,
			"text": "Abdullah ibn Ebî Evfâ (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem)'in âdeti, bir kimse O'na kendi sadakasını getirdiği zaman: \"Allâhumme salli aleyhi (-Yâ Allah, ona salât eyle)\"diye salât ederdi. Babam Ebû Evfâ da sadakasını getirdi, ona da: \"Allâhumme salli alâ âli Ebî Evfâ( = Yâ Allah, Ebû Evfâ ailesi üzerine salât eyle)\" diye duâ etti",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 6360,
			"arabicnumber": 6360,
			"text": "Amr ibnu Suleym ez-Zurakî şöyle dedi: Bana Ebû Humeyd es-Sâidî (radıyallahü anh) haber verdi ki, kendileri: Yâ Rasûlallah! Biz Sana nasıl salât edelim? diye sormuşlar. Rasûlüllah (sallallahü aleyhi ve sellem): \"Allâhumme salli alâ Muhammedin ve ezvâcihi vezurriyyetihi, kemâ salleyte alâ âli İbrâhîme. Ve bârik alâ Muhammedin ve ezvâcihi ve zürriyyetihi, kemâ bârekte alâ âli İbrâhîme, İnneke Hamîdun Mecîdun (= Yâ Allah, Muhammed'e, zevcelerine ve zürriyetine, İbrâhîm ailesine salât ettiğin gibi salât et. Ve yine Muhammed'e, O'nun zevcelerine ve zürriyetine, İbrâhîm'in âline bereket ihsan ettiğin gibi bereket ihsan eyle. Şübhesiz ki, Sen Hamîd'sin, Mecîd'sin) deyiniz\" buyurdu",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 6361,
			"arabicnumber": 6361,
			"text": "ibn Şihâb şöyle demiştir: Bana Saîd ibnu'l-Müseyyeb haber verdi ki, Ebû Hureyre(radıyallahü anh),Peygamber(sallallahü aleyhi ve sellem)'den şöyle buyururken işitmiştir: \"Yâ Allah! Herhangibir mü'mine ağır bir söz söylemiş olursam, Sen o sözümü kıyâmet gününde o mü'min için Sana yakınlığa bir vesile kıl",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 6362,
			"arabicnumber": 6362,
			"text": "Bize Hişâm ed-Destevâî, Katâde'den; o da Enes (radıyallahü anh)'ten şöyle tahdîs etti:Rasûlüllah(sallallahü aleyhi ve sellem)'a soru sordular, soru sormayı çoğaltıp bunda ısrar ettiklerinde öfkelendi de minbere çıkıp: \"Bana bugün hangi şeyden sorarsanız, muhakkak onu size beyân ederim!\" buyurdu. dedi ki: Ben bu sırada sağa sola bakmağa başladım, bir de gördüm ki, herkes başını elbisesinin içine dürmüş de ağlamaktadır. Bir de adamlarla kavga ettiği zamanlarda babasından başkasının adiyle çağırılmakta (yani babasından başkasına nisbet edilmekte) olan bir adam: Yâ Rasûlallah! Benim babam kimdir? dedi. Rasûlüllah: \" (Baban) Huzâfe'dir\" buyurdu. Omer ibnu'l-Hattâb meydana çıktı da: Biz Allah'ı Rabb, İslâm'ı dîn, Muhammed'i de Rasûl olarak kabul ve tasdîk ettik. Biz fitnelerden Allah'a sığınırız! dedi. da: \"Ben hayır ve şerr hakkında bu günün benzerini asla görmedim. Şu muhakkak ki, cennet ile cehennem benim için sûretlendirildi (yani suretleri bana gösterildi) de ben şu mihrâb duvarı arkasında onları gözlerimle gördüm\" buyurdu. bu hadîsi rivayeti sırasında şu âyeti de zikrederdi: \"Ey îmân edenler, Allah 'ın affettiği şeyleri -ki eğer size açıklanırsa ve, siz bunları Kur'ân inerken sorup da hükmü kendinize izhâr edilirse fenanıza gidecektir- sormayın. Allah çok mağfiret edicidir, cezada da aceleci değildir\"(el-Mâide:101)",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 6363,
			"arabicnumber": 6363,
			"text": "Enes ibn Mâlik (radıyallahü anh) şöyle der idi: Rasûlüllah(sallallahü aleyhi ve sellem); üvey babam Ebû Talha'ya: \"Oğlanlarınızdan bana hizmet edecek bir oğlan araştır\" buyurdu. Ebû Talha beni bineğinin arka tarafına bindirerek Rasûlüllah'ın yanına çıkardı. Artık ben Rasûlüllah'a devamlı hizmet ediyordum. (Seferlerde konak için bineğinden) her inişinde O'nun şu duayı çok söyler olduğunu işitip dururdum: \"Allâhumme innî eûzu bike minel-hemmi ve'l-hazani ve'l-aczi ve'l-keseli ve’l-buhli, vel-cübni, ve dalai’d-dîni ve ğalebeti'r-ricâli Allah; ben tasadan, mahzunluktan, acizlikten, tenbellikten, cimrilikten, korkaklıktan, borç baskısından ve ağırlığından, kudret sahibi insanların tasallut ve galebesinden Sana sığınırım)\" O'na böyle hizmet etmeğe devam ettim. Nihayet Hayber seferinden dönüyorduk, Rasûlüllah kendisine ayırıp aldığı Safiyye bintu Huyeyy ile dönüyordu. Ben Rasûlüllah'ın bineğinin arka tarafını bir abâ yahut bir örtü ile çevirir görüyordum. Sonra arka tarafına Safiyye'yi bindirerek yol aldı. Nihayet es-Sahbâ mevki'inde konakladığımız zaman Rasûlüllah, deriden sofralar içinde hurma, yağ ve kuru yoğurt karışığı olan hays yemeği yaptı. Sonra beni gönderdi. Ben insanları düğün aşına da'vet ettim. İnsanlar gelip bu yemekten yediler. İşte Rasûlüllah'ın Safiyye ile zifafı burada oldu. Sonra dönüşe devam etti. Nihayet Uhud meydana çıkıp görününce: \"Şu Uhud'dur. O bizi sever, biz de onu severiz!\" buyurdu. Medîne'yi uzaktan görünce de: \"Yâ Allah! Ben Medine'nin iki kara taşlığı arasını, İbrâhim’in Mekke'yi haram kıldığı gibi haram kılıyorum. Yâ Allah! Sen Medineliler'in müdd ve sâ' ölçeklerinde kendilerine bereket ihsan eyle!\" diye duâ etti",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 6364,
			"arabicnumber": 6364,
			"text": "Bize Mûsâ ibn Ukbe tahdîs edip şöyle dedi: Ben Hâlid kızı ümmü HâIid (radıyallahü anh)'den işittim. dedi ki: Ümmü Hâlid'den başka Peygamber'den bunu işitmiş olan bir kişiyi de işitmedim. Ümmü Hâlid (radıyallahü anh): Ben Peygamber(sallallahü aleyhi ve sellem)'den, kabir azabından Allah'a sığınırken işittim, dedi",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 6365,
			"arabicnumber": 6365,
			"text": "Mus'ab ibn Sa'd şöyle demiştir: Babam Sa'd ibn Ebî Vakkaas (radıyallahü anh) beş şeyi emreder ve bunların Peygamber(sallallahü aleyhi ve sellem)'den olduğunu zikrederdi: Peygamber (sallallahü aleyhi ve sellem) şu kelimelerle duâ etmeyi emrederdi: \"Allâhumme innî eûzu bike mine'l-buhli, Ve eûzu bike minel-cubni, Ve eûzu bike en uredde ilâ erzeli’l-umuri, Ve eûzu bike min fitneti’d-dünyâ ya'nî fitneti'd-Deccâli, Ve eûzu bike min azâbi 'l-kabri(- Yâ Allah, ben cimrilikten Sana sığınırım. Korkaklıktan da Sana sığınırım, ömrün en değersizine döndürülmekten de Sana sığınırım. Dünyâ fitnesinden yani Deccâl fitnesinden de Sana sığınırım. Kabir azabından da Sana sığınırım)",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 6366,
			"arabicnumber": 6366,
			"text": "Âişe (r.anha) şöyle demiştir: Benim yanıma Medine Yahûdîleri'nden iki yaşlı kadın girdiler de konuşma arasında bana: Şübhesiz, kabirler ahâlîsi kendi kabirleri içinde azâb olunurlar! dediler. o kadınların bu sözünü kabul etmedim, onları tasdik etmem bana güzel gelmedi. Sonra çıkıp gittiler. Bu sıradaPeygamber(sallallahü aleyhi ve sellem) de benim yanıma girdi. Ben kendisine: Yâ Rasûlallah! İki koca-karı benim yanıma geldiler de kabirdekiler kabirlerinde azâb olunurlar dediler, diye zikrettim. \"Onlar doğru söylediler. Kabir ehli, öyle bir azâbla azâb edilirler ki, onların azâblarını hayvanların hepsi işitir\" buyurdu. sonra Rasülullah'ı, kıldığı her namazda muhakkak kabir azabından Allah'a sığınırken görmüşümdür",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 6367,
			"arabicnumber": 6367,
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 6368,
			"arabicnumber": 6368,
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 6369,
			"arabicnumber": 6369,
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 6370,
			"arabicnumber": 6370,
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 6371,
			"arabicnumber": 6371,
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 6372,
			"arabicnumber": 6372,
			"text": "Âişe (r.anha) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) -Medîne'ye geldiği zaman- şöyle duâ etti: Allah! Bizlere Mekke'yi sevdirdiğin gibi Medine'yi de sevdir yahut Medine'yi daha fazla sevdir. Medine'nin humma ve sıtma hastalığını da Cuhfe'ye naklet! Yâ Allah! Müdd ve sâ' ölçeklerimizle ölçülen rızıklarımızda bizler için bereket ihsan eyle",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 6373,
			"arabicnumber": 6373,
			"text": "Bize ibn Şihâb, Âmir ibn Sa'd'dan şöyle haber verdi: Sa'd ibn Ebî Vakkaas (radıyallahü anh) şöyle demiştir: Veda Haccı'nda benim hastalığımdan dolayı Rasûlüllah(sallallahü aleyhi ve sellem) bana hasta ziyaretine geldi. Ben bu hastalıktan ölmeye yaklaşmıştım. O'nun bu ziyaretinde ben: Yâ Rasûlallah! Bendeki bu hastalık, görmekte olduğun bu müzmin dereceye ulaştı. Ben mal sahibi bir kimseyim. Bana tek kızım (Âişe)dan başka kimse vâris olmayacaktır. Bu durumda ben malımın üçte ikisini sadaka yapayım mı? diye sordum. \"Hayır (tasadduk etme)\" buyurdu. Ben: Yarısını sadaka yapayım mı? dedim.Rasûlüllah: \"Üçte bir (yeter, üçte bir bile) çoktur. Ey Sa'd! Senin mirasçılarını zengin bırakman, onları fakirler ve (sadaka için) insanlara ellerini açar bir hâlde bırakmandan daha hayırlıdır. Sen Allah rızâsı için harcayacağın her nafakadan muhakkak ecre nail kılınırsın. Hattâ yemek yerken eşinin ağzına koyacağın bir lokmadan da sevâb alacaksın!\" dedi. Yâ Rasûlallah! (Siz Medine'ye döneceksiniz de) ben dostlarımdan geriye mi bırakılacağım? diye sordum. şöyle buyurdu: \"Hayır, sen bizden asla geri bırakılmazsın. (Şayet burada kalır da) Allah rızâsını aramak için sâlih amel yaparsan, muhakkak bu iyi amelinle derecen artar ve merteben yükselir. Ve öyle ümîd ediyorum ki Senin ecelin geri bırakılacak da sen uzun zaman yaşayacaksın! Hattâ seninle birtakım kavimler fayda görecek, diğer birtakım kavimler de senden zarar göreceklerdir. Yâ Allah! Sahâbîlerimin (Mekke’den Medîne'ye dönüş) hicretlerini tamamla! Onları topukları üzerinde geri döndürme! Lâkin acınacak olan, Sa'd ibn Havle'dir!\" buyurdu. ibn Ebî Vakkaas: Rasûlüllah, Sa'd ibn Havle'ye (hicret ettikten sonra) Mekke'de ölmesinden dolayı hüzünlenip acıdı, demiştir",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 6374,
			"arabicnumber": 6374,
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 6375,
			"arabicnumber": 6375,
			"text": "Bize Vuheyb, Hişâm ibn Urve'den; o da babasından; o da Âişe (r.anha)'den tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem) şu duayı söylerdi: innî eûzu bike mine’l-keseli ve’l-heremi ve’l-me'semi ve’l-mağrami ve min fitneti’l-kabri ve azabi’l-kabri ve minfitneti’n-nâri ve azâbı'n-nâri ve min şerri fitneti’l-ğınâ. Ve eûzu bike min fitneti’l-fakri ve eûzu bike min fitneti’l-Mesîhi’d-Deccâli. Allâhumme'ğsil annî hatâyâye bi-mâi’s-selci ve’l-beradi ve nakkı kalbi mine'l-hatâyâ kemâ nakkayte 's-sevbe’l-ebyâde mine'd-denesi. Ve bâid beynî ve beyne hatâyâye kemâ bâadte beyne’l-meşnkı vel-mağribi! = Yâ Allah, tenbellikten, bunaklık derecesinde ihtiyarlıktan, günâhtan, korkaklıktan, kabir suâlinden ve kabir azabından, ateş fitnesinden ve ateş azabından, zenginlik gururunun şerrinden Sana sığınırım. Fakîrlik fitnesinden de Sana sığınırım. Mesîh Deccâl'in fitnesinden de Sana sığınırım. Yâ Allah! Günahları (mın kirini) benden kar ve buz suyu ile yıka, kalbimi de günâhlardan -beyaz elbiseyi kirden temizlediğin gibi- pakla! Benimle günâhlarımın arasını da doğu ile batı arasını uzaklaştırdığın gibi uzaklaştır",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 6376,
			"arabicnumber": 6376,
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 6377,
			"arabicnumber": 6377,
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 6379,
			"arabicnumber": 6379,
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 6381,
			"arabicnumber": 6381,
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 6382,
			"arabicnumber": 6382,
			"text": "Enes (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) şu duayı söylerdi: innî eûzu bike mine'l-hammi ve'l-hazeni ve aczi ve'l-keseli ve'l-cubni ve'l-buhli ve dalaı'd-deyni ve ğalebeti’r-ricâli",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 6383,
			"arabicnumber": 6383,
			"text": "Ebû Mûsâ el-Eş'ari (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) abdest suyu istedi ve o su ile abdest aldı. Sonra iki elini kaldırıp: \"Allâhumme'ğfir lî Ubeydin Ebî Âmirini Allâhumme'c'al-hu yevme 'l-kıyâmeti fevka kesîrin min halkıke mine'n-nâsi (= Yâ Allah! Ebû Âmir Ubeyd kulunu mağfiret eyle! Yâ Allah! Ebû Âmir kulunu kıyâmet gününde şu yarattığın insanlardan çoğunun üstünde yüksek bir makaamda kıl)\" diye duâ etti. ederken (ellerini o kadar kaldırdı ki) ben O'nun iki koltuğunun beyazlığını gördüm",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 6384,
			"arabicnumber": 6384,
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 6385,
			"arabicnumber": 6385,
			"text": "ez-Zuhrî tahdîs edip şöyle demiştir: Bana Abbâd ibnu Temîm, amcası Abdullah ibn Zeyd el-Ensârî'den haber verdi ki, o: Ben Rasülullah (sallallahü aleyhi ve sellem)'ı mescidin içinde sırtüstü yatıp bir ayağını diğeri üzerine koymuş hâlde gördüm, demiştir",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 6386,
			"arabicnumber": 6386,
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 6387,
			"arabicnumber": 6387,
			"text": "Câbir (radıyallahü anh) şöyle demiştir: Babam Abdullah, arkasında yedi yahut dokuz kız bırakıp vefat etti. Bir müddet geçince ben bir kadınla evlendim. Peygamber(sallallahü aleyhi ve sellem): \"Evlendin rni yâ Câbir?\" diye sordu. Ben: Evet evlendim! diye cevâb verdim. O: \"Bakire kız ile mi, yoksa dul ile mi evlendin?\" dedi. Ben: Dul bir kadınla evlendim, dedim.Peygamber: \"Kendisiyle oynaşacağın, seninle oynaşacak- -yahut: Kendisiyle gülüşeceğin, seninle gülüşecek- bir kızla evlenseydin ya!\" bu yurdu. Babam vefat etti, arkasında yedi yahut dokuz kız bıraktı. Ben onların arasına, kendileri gibi bir kız getirmekten hoşlanmadım. Bu sebeble onların işlerini görecek bir kadınla evlendim, dedim.Rasûlüllah: \"Bareke'llâhu aleyhe ( = Allah eşini sana mübarek eylesin)” diye duâ etti. ibn Uyeyne ile Muhammed ibn Müslim, Amr ibn Dînâr dan; o da Câbir'den rivayet ettikleri hadîslerinde \"Bâreke'llâhu aleyke duasını söylemediler",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 6388,
			"arabicnumber": 6388,
			"text": "İbn Abbâs radıyallahü anhüma şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) şöyle buyurdu: \"Onların herhangibiri (cinsî münâsebet yapmak için) eşine gelmek istediği zaman Bismillâhi, Allâhumme cennibna'ş-şeytâne, ve cennibi’ş-şeytâne mâ razaktenâ, (= Bismillâhi. Yâ Allah, bizleri şeytândan uzaklaştır, şeytânı da bize ihsan ettiğin çocuktan uzak kıl) derse, şu muhakkak ki, eğer o karı-koca arasındaki bu cinsî münâsebette bir çocuk takdir olunursa, o çocuğa ebediyyen şeytân zarar veremez”",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 6389,
			"arabicnumber": 6389,
			"text": "Enes ibn Mâlik (radıyallahü anh):Peygamber(sallallahü aleyhi ve sellem)'in en çok okuduğu duâ: \"Allâhumme, Rabbena âtinâ fi’d-dünyâ haseneten ve fi’l-âhireti haseneten ve kına azâbe'n-nâri( = Yâ Allah, ey Rabb'imiz, bize dünyâda da bir güzellik ver, âhirette de bir güzellik ver ve bizi ateş azabından koru)\"duası idi, demiştir",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 6390,
			"arabicnumber": 6390,
			"text": "Sa'd ibn Ebî Vakkaas (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) bizlere şu duâ kelimelerini yazı -yahut kitâb- öğretir gibi öğretirdi: 'Allahümme, innî eûzu bike mine’l-buhli ve eûzü bike mine’l-cubni. Ve eûzu bike min en uredde ilâ erzeli’l-umuri. Ve eûzu bike min fîtneti'd-dünyâ ve azâbi’l-kabri” = Yâ Allah, ben cemrilikten, Sana sığınırım, korkaklıktan da Sana sığınırım. Ömrün en kötüsüne (ihtiyarlığın bunaklık devrine) döndürülmemizden de Sana sığınırım. Dünyâ fitnesinden ve kabir azabından da Sana sığınırım",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 6391,
			"arabicnumber": 6391,
			"text": "Bize Enes ibnu Iyâd, Hişâm'dan; o da babası Urve'den; o da Âişe (r.anha)'den şöyle tahdîs etti: Rasûlüllah(sallallahü aleyhi ve sellem)'a sihir yapılmıştı. Hattâ kendisine bâzı işi yapmadığı hâlde yaptım hayâl ettirilirdi. Rasûlüllah, Rabb'ine (tekrar tekrar) duâ etti. Sonra bana: \" (Yâ Âişe) Hissettin mi? Fetva istemekte olduğun şey hakkında Allah bana fetva verip bildirmiştir\" buyurdu. Âişe de: Yâ Rasûlallah! Bu nedir? diye sordum.Rasûlüllah şöyle anlattı: \"Bana iki adam geldi. Bunlardan biri başımın yanına, diğeri de ayaklarımın yanına oturdu. Biri arkadaşına: Bu zâtın hastalığı nedir? diye sordu. O da: Sihir yapılmıştır, diye cevâb verdi. Öbürü: Ona kim sihir yapmıştır? dedi. Öteki: Lebîd ibnu'l-A'sam! diye cevâb verdi. Bu sihir ne ile yapılmıştır? diye sordu. O da: Bir tarak, saç sakal tarantısı ve erkek hurmanın kurumuş çiçek kapçığı ile! diye cevâb verdi. Nerede yapılmıştır? sorusuna da: Zervân da! diye cevâb verdi.\" Zurayk oğulları yurdunda bir kuyudur. Âişe dedi ki: Rasûlüllah bâzı sahâbîleriyle o kuyuya gitti. (Ona baktı, üzerinde hurma ağacı vardı.) Sonra dönüp Âişe'ye geldi de: \" (Yâ Âişe!) Vallahi kuyunun suyu, içinde kına bekletilmiş gibi kıpkırmızı, kuyunun etrafındaki hurma ağacının uçları şeytânların başları gibidir!\" buyurdu. dedi ki: Rasûlüllah geldi de ben Âişe'ye o kuyunun hâlinden haber verdi. Ben: (Yâ Rasûlallah!) Sen o sihri çıkarıp çözseydin? dedim. \"Bana gelince, Allah benim şifâmı vermiştir. Ben o sihri çıkarıp da insanlar arasında bir şerri yaymayı istemedim\" buyurdu. ibn Yûnus ile el-Leys ibn Sa'd, Hişâm'dan; o da babası Urve'den; o da Âişe'den yaptıkları rivayette şu ziyâde vardır: Âişe: Peygamber'e sihir yapılmıştı da O tekrar tekrar duâ etti, dedi ve hadîsi şevketti",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 6392,
			"arabicnumber": 6392,
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 6393,
			"arabicnumber": 6393,
			"text": "Bize Hişâm ed-Destevâî, Yahya ibn Ebî Kesîr'den; o da Ebû Seleme'den; o da Ebû Hureyre (radıyallahü anh)'den şöyle tahdîs etti: Peygamber(sallallahü aleyhi ve sellem) yatsı namazının son rek'atinde başını rukû'dan kaldırıp “Semiallâhu limen hamideh” dediği zaman, kunût yapar, şu duayı söylerdi: \"Yâ Allah! el-Velîd ibnu'l-Velid'i kurtar. Allah, Seleme ibnu'l-Hişâm'ı kurtar! Allah, (müşrikler elinde) zaif ve âciz görülen diğer mü'minleri de kurtar! Allah, Mudar (müşrikleri) üzerine baskını şiddetlendir. Allah, içinde bulundukları bu yılları onlara Yûsuf Peygamber'in kıtlık yıllarına benzet",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 6394,
			"arabicnumber": 6394,
			"text": "Enes ibn Mâlik (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem)(Munzir ibn Amr'ın başkanlığı altında) kendilerine Kurrâ denilen (kırk yahut yetmiş kişilik) bir birliği Necd halkının isteği üzerine, onlara dîni öğretmek üzere göndermişti. Bunlar Maûne Kuyusu başında pusuya düşürülüp öldürüldüler. Ben Peygamber'in onların öldürülmelerine üzüldüğü kadar hiçbirşeye üzüldüğünü görmedim. Peygamber, sabah namazında bir ay kunût yaptı da; \"Usayya kabilesi Allah'a ve Rasûlü'ne âsî oldular!\" buyururdu",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 6395,
			"arabicnumber": 6395,
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 6396,
			"arabicnumber": 6396,
			"text": "Bize Alî ibn Ebî Tâlib (radıyallahü anh) tahdîs edip şöyle dedi: Biz Hendek harbi gününde Peygamber(sallallahü aleyhi ve sellem)'in beraberinde bulunduk. O: \"Allah bu müşriklerin kabirlerine ve evlerine ateş doldursun! Çünkü onlar bizi tâ güneş batıncaya kadar orta namazını kılmaktan alıkoydular; orta namazı ikindi namazıdır\" buyurdu",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 6397,
			"arabicnumber": 6397,
			"text": "Ebû Hureyre (radıyallahü anh) şöyle demiştir: et-Tufeyl ibnu Amr ed-Devsî, Rasûlüllah(sallallahü aleyhi ve sellem)'ın huzuruna geldi de: Yâ Rasûlallah! Devs kabilesi halkı Allah'a âsî oldular ve İslâm'ı kabulden çekindiler! Bu sebeble Sen onların aleyhine duâ et! dedi. bu sözü üzerine oradaki insanlarRasûlüllah'ın Devs kabîlesi halkı aleyhine duâ edeceğini sandılar. Rasûlüllah ise: \"Yâ Allah! Devs halkına hidâyet eyle de onları İslâm topluluğumuza getir!\" diye duâ etti",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 6398,
			"arabicnumber": 6398,
			"text": "Bize Şu'be, Ebû İshâk'tan; o da Ebû Burde'den; o da babası Ebû Mûsâ el-Eş'arî(radıyallahü anh)'den şöyle tahdîs etti: Peygamber(sallallahü aleyhi ve sellem) şu duâ ile duâ ederdi: lî hatîetî ve cehli ve israfı fî emri kullihî, ve mâ ente a’lemu bihi minnî. Allâhumme’ğfir lî hatâyâye ve amdî ve cehli ve hezlî, ve küllü zâlike indî! Allâhumme'ğfir lî mâ kaddemtu ve mâ ahhartu vemâ esrertu vemâ a'lentu. Ente’l-Mukaddimu ve ente’l-Muahhıru. Ve ente alâ külli şey'in kadîrun! = Ey Rabb'im! Benim günâhımı, bilgisizliğimi, her işimde israfımı ve benden daha iyi bilmekte olduğun kusurlarımı mağfiret eyle! Yâ Allah! Benim hatâlarımı, kasdımla ve bilgisizliğimle işlediklerimi, şakalarımı mağfiret eyle! Bunların hepsi bende vardır. Yâ Allah! Evvelden yaptığım, sonradan yapacağım; gizlediğim, açığa çıkardığım bütün günâhlarımı Sen mağfiret eyle! Öne geçiren ancak Sen'sin, sonraya bırakan da ancak Sen'sin. Sen herşeye gücü yetensin",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 6399,
			"arabicnumber": 6399,
			"text": "Ubeydullah ibnu Muâz şöyle dedi: Ve bize Şu'be, Ebû İshâk'tan; o da Ebû Burde'den; o da babası Ebû Musa'dan; o da Peygamber(sallallahü aleyhi ve sellem)'den bunun benzeri olan hadîsi tahdîs etti",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 6400,
			"arabicnumber": 6400,
			"text": "Bize Ebû İshâk, Ebû Bekr ibnu Ebî Musa'dan ve Ebû Burde'den; sanırım ki, o da babası Ebû Mûsâ el-Eş'arî (radıyallahü anh)'den tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem) şöyle duâ ederdi: lî hatîetî ve cehli ve isrâfi fî emri ve mâ ente a’lemu bihî minnî. Allâhumme'ğfir lî hezlî ve ciddî ve hatâye ve amdî ve küllü zâlike indî!\" Allah! Benim günâhımı, bilgisizliğimi, isimdeki israfımı ve benden daha iyi bilmekte olduğun bütün kusurlarımı mağfiret eyle! Allah! Benim latifemi, ciddî hâlimi, hatâmı ve dileyerek işlediğim günâhımı mağfiret eyle! İ'tirâf ederim ki, bu kusurların hepsi bende vardır",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 6401,
			"arabicnumber": 6401,
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 6402,
			"arabicnumber": 6402,
			"text": "Bize Sufyân ibn Uyeyne tahdîs edip şöyle dedi: Bu hadîsi bize ez-Zuhrî, Saîd ibnu'l-Müseyyeb'den; o da Ebû Hureyre (radıyallahü anh)'den tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem) şöyle buyurmuştur: \"Okuyucu, yânı Fatiha okuyan kimse ‘Âmîn’ dediği zaman sizde ‘Âmîn’ deyiniz. Çünkü melekler de 'Âmîn' derler. Her kimin 'Âmîn' demesi meleklerin 'Âmîn' demesine uyarsa, geçmiş günâhları mağfiret olunur",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 6403,
			"arabicnumber": 6403,
			"text": "Bize Abdullah ibn Mesleme, Mâlik'ten; o da Sumeyy'den; o da Ebû Salih'ten; o da Ebû Hureyre (radıyallahü anh)'den şöyle tahdîs etti ki, Rasûlüllah(sallallahü aleyhi ve sellem) şöyle buyurmuştur: \"Her kim günde yüz kerre ‘Lâ ilahe ille’llâhu vahdehû lâ şerike leh lehu'l-mulku ve lehu’l-hamdu ve huve ala kullî şey’in kadîr(= Bir tek Allah'tan başka hiçbir ilâh yoktur. O'nun hiçbir ortağı yoktur. Mülk O'nundur. Hamd O'na mahsûstur. Herşeye kudreti yeten O'dur)' tehlîlini söylerse, bu onun lehine on köleyi hürriyete kavuşturmaya denk sevâb olur ve onun lehine yüz hasene yazılır, ondan yüz seyyie de silinir. Ve bu, o kimse için bu gününde tâ akşama girinceye kadar şeytândan da bir sığınma olur. Hiçkimse onun yaptığından daha faziletlisini yapmış olmaz, ancak onunkinden daha çok çalışmış olan adam müstesnadır\". Abdullah ibnu Muhammed tahdîs etti. Bize Abdulme-lik ibnu Amr tahdîs etti. Bize Amr ibnu Ebî Zaide, Ebû İshâk'tan tahdîs etti ki, Amr ibnu Meymûn: \"Her kim günde on kerre 'Lâ ilahe ille'llâhu...' tehlîlini okursa, İsmail Peygamber neslinden on esîr âzâdlamış gibi sevaba hakk kazanır\" diye söylemiştir. ibnu Ebî Zaide şöyle dedi: Ve bize Abdullah ibnu Ebi's-Sefer, eş-Şa'bî'den; o da er-Rabî' ibnu Hüseyin'den bunun benzerini tahdîs etti. Ben, er-Rabî'e: Sen bunu kimden işittin? diye sordum. O: Amr ibnu Meymûn'dan, dedi. Akabinde Amr ibnu Meymûn'a geldim ve ona: Sen bunu kimden işittin? diye sordum. O: İbnu Ebû Leylâ'dan, dedi. İbnu Ebî Leylâ'ya geldim ve ona: Sen bunu kimden işittin? diye sordum. O: Ebû Eyyûb el-Ensârî (radıyallahü anh)'den işittim, o bunu Peygamber(sallallahü aleyhi ve sellem)'den tahdîs ediyordu, dedi. îbrâhîm ibn Yûsuf da babası Yûsuf ibn İshâk'tan; o da dedesi Ebû İshâk Amr'dan söyledi ki, o şöyle demiştir: Bana Amr ibnu Meymûn, Abdurrahmân ibnu Ebî Leylâ'dan; o da Ebû Eyyûb (radıyallahü anh)'dan,Peygamber'in bu hadîsini tahdîs etti. Abdillâh el-Buhârî: Sahîh olan, Amr'ın, Peygamber(sallallahü aleyhi ve sellem)'den olan sözüdür, dedi",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 6404,
			"arabicnumber": 6404,
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 6405,
			"arabicnumber": 6405,
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 6406,
			"arabicnumber": 6406,
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 6407,
			"arabicnumber": 6407,
			"text": "Ebû Mûsâ el-Eş'arî (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem): \"Rabb'ini zikreden kimse ile zikretmeyen kimsenin benzeri, diri ile ölü gibidir\" buyurdu",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 6408,
			"arabicnumber": 6408,
			"text": "Ebû Hureyre (radıyallahü anh) şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem) şöyle buyurdu: \"Allah'ın bir sınıf melekleri vardır ki, bunlar yollarda, sokaklarda dolaşırlar, zikir ehlini ararlar. Onlar (Azîz ve Celîl olan) Allah'ı anan bir cemâat bulunca birbirlerine: Aradığınıza geliniz, diye seslenirler. üzerine melekler zikir ehlini dünyâ semâsına kadar kanatlarıyle tavaf edip etrafını kuşatırlar. Rabb'leri onları pek iyi bildiği hâlde, meleklere: Kullarım ne söylüyorlar? diye sorar. Onlar da: (Subhânallah' diyerek) Sen 'i tesbîh ediyorlar, ('Allâhu Ekber’ diyerek) Sen 'i tekbîr ediyorlar, ('el-Hamdu lillâhi' diyerek) Sen’i hamd ve sena ediyorlar! suretinde cevâb verirler. Allah: Bu kullarım Beni görürler mi ki? diye sorar. Melekler: Hayır, vallahi onlar Sen'i görmezler! derler. Allah: O kullarım ya Beni görseler nasıl olurlar? buyurur. Melekler: Onlar Sen 'i görseler, Sana ibâdet ve ubudiyetleri daha şiddetli; temcîd ve tahmîdleri daha çetin; tesbihleri daha çok olur! derler. Allah: Benden ne diliyorlar? diye sorar. Melekler: Cennet istiyorlar! diye cevâb verirler. Allah: Onlar cenneti görmüşler mi? Hayır, vallahi onlar cenneti görmemişlerdir! Ya onlar cenneti görselerdi? Eğer görselerdi cennete karşı hevesleri daha çok, talebleri daha şiddetli, rağbetleri daha büyük olurdu. O kullarım neden istiâze ederler? Melekler: Cehennem ateşinden! Cehennemi gördüler mi? Hayır, vallahi onu görmediler. Ya görselerdi nasıl olurlardı? Ondan daha çok kaçınırlardı, korkuları daha çok olurdu. Bunun üzerine Yüce Allah, meleklere: Ey melekler, ben sizleri şâhid yapıyorum ki, ben bu zikreden kullarımı mağfiret ettim! buyurur. birisi: O zikredenlerin arasında fulan kişi var ki, o zikredenlerden değildir, bir haceti için gelmiş oturmuştu! der. Allah: O mecliste oturanlar öyle kemâl sahibi kimselerdir ki, onlarla birlikte oturanlar şakı olamaz! cevâbını verir.\" hadîsi Şu'be, el-A'meş'ten, Peygamber'e yükseltmeyerek rivayet etti. Keza bu hadîsi Süheyl, babası Ebû Salih es-Semmân'dan; o da Ebû Hureyre (radıyallahü anh)'den; o daPeygamber(sallallahü aleyhi ve sellem)'den olmak üzere rivayet etmiştir",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 6409,
			"arabicnumber": 6409,
			"text": "Ebû Mûsâ el-Eş'arî (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) bir dağ yolunda yahut bir tepede yol alıp yürüdü. Mûsâ dedi ki: Rasûlüllah(sallallahü aleyhi ve sellem) katırının üzerinde yol alıyordu: \"Sizler sağırı ve gaibi çağırmıyorsunuz!\" buyurdu. \"La ilahe illellâhu vallâhu ekber {= Hiçbir ilâh yok, ancak Allah vardır. Allah en büyüktür)\" tehlîl ve tekbîrini söyledi. Mûsâ dedi ki: Rasûlüllah(sallallahü aleyhi ve sellem) katırının üzerinde yol alıyordu: \"Sizler sağırı ve gaibi çağırmıyorsunuz!\" buyurdu. da: \"Yâ Ebâ Mûsâ -yahut: Yâ Abdallah-!Ben sana cennet hazînesinden bir kelimeye delâlet edeyim mi?\" diye sordu. Evet (delâlet buyur), dedim. Rasûlüllah: \"Lâ havle velâ kuvvete illâ billahi (= Tahavvül ve kuvvet ancak Allah iledir)\" buyurdu",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 6410,
			"arabicnumber": 6410,
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 6411,
			"arabicnumber": 6411,
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 106
			}
		}
	]
}