{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"81": "To make the Heart Tender (Ar-Riqaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6412,
			"arabicnumber": 6412,
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6413,
			"arabicnumber": 6413,
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6414,
			"arabicnumber": 6414,
			"text": "Bize Sehl ibn Sa'd es-Sâidî (radıyallahü anh) tahdîs edip şöyle dedi: Bizler Rasûlüllah(sallallahü aleyhi ve sellem)'ın maiyyetinde idik. Kendisi hendek kazıyor, bizler de toprak taşıyorduk. Rasûlüllah bizim yanımıza uğrar ve şu beyti söylerdi: lâ ayşe illâ ayşu'l-âhire lî'l-Ensârî ve'l-Muhâcire Yâ Allah, âhiret yaşayışından başka gerçek yaşayış yoktur. Sen Ensâr'ı ve Muhâcirler'i mağfiret eyle!)\" benzeri hadîsi Peygamber'den rivayet etmekte Sehl ibn Sa'd, ona mutâbaat etmiştir",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6415,
			"arabicnumber": 6415,
			"text": "Sehl ibn Sa'd (radıyallahü anh) şöyle demiştir: Ben Peygamber (sallallahü aleyhi ve sellem)'den işittim, şöyle buyuruyordu: \"Cennette bir kamçı kadar yer, dünyâdan ve dünyâdaki şeylerden daha hayırlıdır. Sabahleyin veya akşamleyin -herhangibir zamanda- Allah yolunda cihâd için bir yürüyüş, hiç şübhesiz dünyâdan ve dünyâdaki herşeyden daha hayırlıdır",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6416,
			"arabicnumber": 6416,
			"text": "el-A'meş şöyle demiştir: Bana Mucâhid ibn Cebr tahdîs etti ki, Abdullah ibn Omer(radıyallahü anh) şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem) benim omuzumu tuttu da bana: \"Abdullah, sen dünyâda yabancı kimse gibi yahut yolcu gibi ol!\" buyurdu. dedi ki:) İbn Omer de: \" (Ey mü'min!) Akşama eriştiğinde sabahı gözleyip bekleme, sabaha eriştiğinde de akşamı gözleme(işlerini zamanında yap)! Sıhhatinden bir kısmını hastalık zamanına ayır, hayâtından bir kısmını da ölümün için faydalı kıl!\" diye vasiyet ederdi",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6417,
			"arabicnumber": 6417,
			"text": "Abdullah ibn Mes'üd (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) kum üzerine bir murabba', yani kare resmi çizdi. Sonra (başlangıcı) karenin ortasından olarak, kare dışına uzanan bir çizgi çizdi. Sonra bu çizginin ortasından i'tibâren bu ortadaki çizgiye dik açıyla dayanan birtakım küçük çizgiler çizdi. Sonra Peygamber (bu çizgileri ta'rîf ederek): \"Şu (karenin ortasındaki uzun çizgi) insandır. Şu (kare de) eceldir, her tarafından onu kuşatmıştır. Şu kare dışında uzanan çizgi de, insanın emelidir. Şu ufak çizgiler de insana arız olan âfetler, musibetlerdir. İmdi insana şu âfet oku hatâ eder, dokunmazsa, öbür âfet isabet eder, o da hatâ eder dokunmazsa, Öbürü isabet eder (en sonu ecel -denilen ölüm- onu yakalar)",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6418,
			"arabicnumber": 6418,
			"text": "Bize Hemmâm ibn Yahya, İshâk ibn Abdillah ibn Ebî Talha'dan tahdîs etti ki, Enes ibn Mâlik (radıyallahü anh):Peygamber(sallallahü aleyhi ve sellem) birçok çizgiler çizdi de: \"Şu (insanın beslemekte olduğu) emeldir. Şu da insanın ecelidir... İnsan böyle uzak emelinin talibi iken, kendisine en yakın olan çizgi birden ona geliverir!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6419,
			"arabicnumber": 6419,
			"text": "Bize Omer ibnu Alî, Ma'n ibn Muhammed el-Gıfârî'den; o da Saîd ibn Ebî Saîd el-Makburî'den; o da Ebû Hureyre (radıyallahü anh)'den tahdîs etti. Peygamber(sallallahü aleyhi ve sellem):\"Allahü Taâlâ altmış seneye kadar yaşatıp ölümünü geri bıraktığı (hâlde yaratanı ve yaşatanı tanımayan) kimsenin özrünü izâle ve reddeder\" buyurmuştur. hadîsi el-Makburî'den rivayet etmekte Ebû Hazım ile İbnu Aclân da, Ma'n ibn Muhammed'e mutâbaat ettiler",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6420,
			"arabicnumber": 6420,
			"text": "İbnu Şihâb şöyle demiştir: Bana Saîd ibnu'l-Müseyyeb haber verdi ki, Ebû Hureyre(radıyallahü anh) şöyle demiştir: Ben Rasülullah (sallallahü aleyhi ve sellem)tan işittim: \"İhtiyar kimsenin gönlü iki huyda her zaman genç bir hâlde bulunur: Dünya sevgisinde ve emel uzunluğunda!\" buyuruyordu. Bana Yûnus tahdîs etti, dedi. İbn Vehb de yine Yûnus'tan söyledi ki, İbn Şihâb: Bana Saîd ibnu'l-Müseyyeb ile Ebû Seleme haber verdi, demiştir",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6421,
			"arabicnumber": 6421,
			"text": "Enes ibn Mâlik (radıyallahü anh) şöyle dedi: Rasûlüllah(sallallahü aleyhi ve sellem): “Âdem oğlu büyür, onunla beraber şu iki şey de büyür: Mal sevgisi ve uzun ömür (temennisi)\" buyurdu. hadîsi Şu'be, Katâde'den rivayet etti",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6422,
			"arabicnumber": 6422,
			"text": "ez-Zuhrî şöyle dedi: Bana Mahmûd ibnu'r-Rabî' haber verdi ve bu Mahmûd, Rasûlüllah(sallallahü aleyhi ve sellem)'ı hatırladığını söyledi. bu Mahmûd, Rasûlüllah'ın, onların yurdunda bulunan bir kuyudan ağzına su alıp bunu yüzüne püskürttüğünü de hatırladığını söyledi",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6423,
			"arabicnumber": 6423,
			"text": "Bu Mahmûd şöyle dedi: Ben İtbân ibn Mâlik el-Ensârî'den işittim. Sonra Salim oğulları'nın birinden de işittim, şöyle dedi: Rasûlüllah(sallallahü aleyhi ve sellem) gün yükseldiği zaman benim yanıma geldi. (İki rek'at nafile namaz kıldırdıktan sonra) şöyle buyurdu; \"Kıyâmet gününe ‘Lâ ilahe ille’llah' tevhidini söyleyerek ve bununla da sırf Allah'ın rızâsını isteyerek ulaşan mü'min kula, Allah muhakkak ateşi haram kılacaktır",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6424,
			"arabicnumber": 6424,
			"text": "Bize Ya'kûb ibn Abdirrahmân, Amr'dan; o da Saîd el-Makburî'den; o da Ebû Hureyre (radıyallahü anh)'den tahdîs etti ki, Rasûlüllah(sallallahü aleyhi ve sellem) şöyle demiştir: \"Yüce Allah şöyle buyurur; Mü'min kulumun dünyâdaki ailesinden en sevdiği birisini elinden aldığımda, sonra o da benden ecrini istediğinde, benim katımda o kulumun mükâfatı ancak cennettir",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6425,
			"arabicnumber": 6425,
			"text": "Ensâr'dan Amr ibn Avf -ki kendisi Âmir ibn Lueyy oğulları'nın yemînli dostu idi ve RasûIullah (sallallahü aleyhi ve sellem)'ın beraberinde Bedir'de hazır bulunmuştu- şöyle haber vermiştir: Rasûlüllah, harb etmeksizin Bahreyn ahâlîsiyle bir sulh akdi yapmış ve üzerlerine Alâ ibn Hadramî'yi emîr tayin etmişti. Toplanan cizye mallarını getirmek üzere de bilâhare Rasûlüllah, Ebû Ubeyde ibnu’l-Cerrâh'ı Bahreyn'e gönderdi. Ebû Ubeyde onların cizye mallarını alarak Bahreyn'den Medine'ye geldiğinde, Ensâr onun gelişini işitti. Onun bu gelişi, Ensâr'ın Rasûlüllah'la beraber sabah namazı kıldıkları zamana denk gelmişti. Ensâr sabah namazını kılınca, hemen Ebû Ubeyde'ye karşı çıktılar. Rasûlüllah sahâbîleri bu hâlde görünce gülümsedi de onlara: \"Öyle sanıyorum ki, sizler Ebû Ubeyde'nin gelişini ve onun birçok mal getirdiğini işitmişsiniz!\" buyurdu. da: Evet yâ Rasûlallah! dediler. Bunun üzerine Rasûlüllah: \"Sevininiz ve sizi sevindirecek nîmetleri (bundan sonra her zaman) ümîd ediniz! Vallahi ben bundan sonra sizin üzerinize fakirlik geleceğinden korkmam. Fakat sizin üzerinize geleceğinden korktuğum şey, sizden önce gelip geçen ümmetlerin önüne dünyâ ni'metlerinin yayıldığı gibi sizin önünüze de yayılarak, onların birbirlerine hased ettikleri ve nefsâniyet güttükleri gibi, sizin de birbirinize düşmeniz ve bunun onları âhiret işlerinden alıkoyduğu gibi, sizleri de âhiret işlerinden alıkoymasıdır\" buyurdu",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6426,
			"arabicnumber": 6426,
			"text": "Bize el-Leys, Yezîd ibn Ebî Habîb'den; o da Ebû'l-Hayr'dan; o da Ukbe ibnu Âmir (radıyallahü anh)'den şöyle tahdîs etti: Rasûlüllah (sallallahü aleyhi ve sellem) -vefatına yakın- bir gün çıktı da Uhud şehîdleri üzerine ölüye namaz kılar gibi namaz kıldı. Sonra Medine'ye dönüp minbere çıktı ve (dirilere ve ölülere veda eder gibi bir hutbe yapıp) şöyle buyurdu: \"Ben sizin Kevser havuzuna önden gideniniz olacağım. Ben sizin Hakk yolundaki hizmetlerinize şâhidlik edeceğim. Vallahi ben şu anda (cennetteki) havuzumu görüyorum. Ve emîn olunuz ki, bana Arz hazînelerinin anahtarları -yahut: Arz'ın anahtarları- verilmiştir. Vallahi ben vefatımdan sonra sizlerin müşrikliğe döneceğinizden hiç endîşe etmem. Fakat ben sizlerin dünyâya aşırı düşkünlük yapıp nefsâniyet yarışına kalkışmanızdan (birbirinizle didişmenizden) korkarım",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 6427,
			"arabicnumber": 6427,
			"text": "Ebû Saîd el-Hudrî (radıyallahü anh) şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem): \"Sizin üzerinize en çok korkmakta olduğum şey, Allah'ın sizler için çıkaracağı Arz bereketleridir (dünyâ zenginlikleridir)\" buyurdu. Arz bereketleri nedir? diye soruldu. Rasûlüllah: \"Dünyâ çiçekleri, dünyâ güzellikleridir\" buyurdu. Bir sahâbî O'na: Hayır, şerr getirir mi? diye sordu. soru üzerine Peygamber sustu, hattâ biz üzerine vahiy indiriliyor olduğunu zannettik. Sonra Rasûlüllah alnından terlerini silmeye başladı da: \"Soran kimse nerede?\" buyurdu. O zât; Benim (yâ Rasûlallah)! dedi. Saîd dedi ki: Biz and olsun, o adamı bu meydana çıktığı zaman övdük. Rasûlüllah şöyle buyurdu: \"Hayır, hayırdan başka birşey getirmez. Şübhesiz bu dünyâ malı yeşildir, tatlıdır. Baharın bitirdiği şeylerin hepsi çok yiyen ve karnını şişiren hayvanı öldürür yahut da ölüme yaklaştırır. Ancak yeşil ot yiyen hayvan böyle değildir, onu otlayan hayvan ölüm tehlikesinden uzaktır. Bu hayvan o yeşil otu yer, nihayet iki böğrünü şişirince bahar güneşini karşılar. Kolayca gübresini çıkarır, bevleder, genişler. Sonra yine otlamağa döner, ve bol bol otlar. İşte bu dünyâ malı da (yeşil ot gibi) tatlıdır. Bundan hakkıyle alan ve aldığını da hakkı olan yere koyup harcayan kimseye bu ne güzel bir ni'mettir. Dünyâ malını haksız olarak hırsla alan kimseye gelince o da dâima yiyen, fakat bir türlü doymayan obur kimse gibi olmuştur",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 6428,
			"arabicnumber": 6428,
			"text": "Zehdem ibnu Mudarrıb şöyle demiştir: Ben İmrân ibnu Husayn (radıyallahü anh)'dan işittim ki, Peygamber (sallallahü aleyhi ve sellem) şöyle buyurmuştur: \"Sizin hayırlı olanlarınız, benim asrımda yaşayanlarınızda. Sonra onların ardından gelenlerdir. Sonra onların ardından gelenlerdir\". Ben Peygamber'in, kendi asrından sonra hayırlı nesiller olarak iki nesil mi, yahut üç nesil mi zikrettiğini bilmiyorum, demiştir. Peygamber devamla şöyle buyurdu: \"Onlardan sonra öyle bir kavim olur ki, onlar kendilerinden şahidlik yapmaları islenilmeden şâhidlik yaparlar, hıyanet ederler, bunlara güvenilmez. Bunlar nezr ederler, fakat nezrlerini ifâ etmezler. Bunlar arasında (çok yemek yemek) semizlik, şişmanlık meydana çıkar (hayâtın gayesi bu olur)”",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 6429,
			"arabicnumber": 6429,
			"text": "Bize Abdan, .... Abîde'den; o da Abdullah ibnu Mes'ûd (radıyallahü anh)'dan tahclîs etti. Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: \"İnsanların hayırlısı benim asrımdır. Sonra onlara yakın olanlardır. Sonra onlara yakın olanlardır. Sonra onların ardından bir kavim gelir ki, onlardan herbirinin şehâdetleri yeminlerinin, yeminleri de şehâdetlerinin önüne geçer",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 6430,
			"arabicnumber": 6430,
			"text": "Kays ibn Ebî Hazım şöyle demiştir: Ben (bir hastalığında Habbâb'ı ziyarete gitmiştim) Habbâb o gün karnında yedi kerre dağlama tedavisi yapmıştı. İşte o gün Habbâb'dan işittim, o şöyle dedi: Eğer Rasûlüllah (sallallahü aleyhi ve sellem) bizi ölümü dua etmekten nehyetmiş olmayaydı, muhakkak ben ölümü çağırırdım. Muhammed'in sahâbîleri (nden bir kısmı) ölüp gittiler. Dünyâ onlardan (onların âhiret saadetlerinden) bir şey eksiltmedi. (Çünkü darlık içinde yaşadılar.) Bizler ise dünyâdan o kadar çok mala kavuştuk ki, bugün biz onu topraktan (yânı bina yapmaktan) başka koyacak (sarfedecek) yer bulamıyoruz",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 6431,
			"arabicnumber": 6431,
			"text": "Kays şöyle demiştir: Ben Habbâb'ın yanına geldim; o, kendisine âid bir duvar yapmakla meşgul idi. Şöyle dedi: Bizden evvel geçip giden arkadaşlarımız var ki, dünyâ onların (âhiret saadetlerinden) hiçbirşey eksiltmedi. Bizler ise onların ardından öyle çok şeye (mala) kavuştuk ki, biz onu topraktan başka koyacak yer bulamıyoruz",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 6432,
			"arabicnumber": 6432,
			"text": "Buradaki râvî de: Habbâb ibnu'l-Erett (radıyallahü anh): Biz Rasûlüllah (sallallahü aleyhi ve sellem) ile beraber hicret ettik dedi, diyerek, onun bu hadîsini nakletmiştir",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 6433,
			"arabicnumber": 6433,
			"text": "Usmân ibn Affân'ın hizmetçisi Humran ibn Ebân haber verip şöyle dedi: Usmân oturaklarda otururken ben ona abdest suyunu getirdim. Kendisi abdest aldı ve abdest alışı güzel yaptı. Sonra şöyle dedi: Ben Peygamber(sallallahü aleyhi ve sellem)'in bu mecliste otururken abdest aldığını ve abdest almayı güzel yaptığını gördüm. Sonra: \"Kim benim şu abdest alışım gibi abdest alır, sonra mescide gelir de iki rek'at namaz kılar, sonra oturursa, onun geçmiş günâhları mağfiret olunur\" buyurdu. Usmân: Peygamber\"Aldanmayınız (yani mağfirete aldanıp da günâh kazanmaya cür'et etmeyiniz)\" buyurdu, demiştir",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 6434,
			"arabicnumber": 6434,
			"text": "Mirdâs el-Eslemî (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) şöyle buyurdu: \"Bu ümmetin sâlih kulları birbiri ardınca bu hayâttan gider, geriye arpanın yahut hurmanın çalkantı kozalakları gibi değersizleri kalır ki, Allah onlara hiçbir değer vermez.\" Abdillah el-Buhârî: \"Hufâle\"ve \"Husâle\"denilir (yânîbu iki kelime bir ma'nâyadır), demiştir",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 6435,
			"arabicnumber": 6435,
			"text": "Ebû Hureyre (radıyallahü anh) şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem) şöyle buyurdu: \"Altın, gümüş ve iyi cins elbise kulu olan kişiler kahrolsun! Böyle kişiye verilirse memnun olur, verilmezse (Allah'ın takdirine kızar) razı olmaz",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 6436,
			"arabicnumber": 6436,
			"text": "Atâ ibn EbîRebâh şöyle demiştir: Ben İbn Abbâs radıyallahü anhüma'tan işittim, şöyle diyordu: Ben Peygamber (sallallahü aleyhi ve sellem)'den işittim, şöyle buyuruyordu: \"Âdem oğlunun iki vâdî dolusu malı olsa, muhakkak bir üçüncüsünü ister. Âdem oğlunun iç boşluğunu (hırslı gönlünü) topraktan başka birşey dolduramaz. Allah (ihtirastan) tevbe eden kişinin tevbesinı kabul eder",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 6437,
			"arabicnumber": 6437,
			"text": "İbn Cureyc haber verip şöyle demiştir: Ben Atâ'dan işittim, şöyle diyordu: Ben İbn Abbâs radıyallahü anhüma'tan işittim, şöyle diyordu: Ben Rasûlüllah (sallallahü aleyhi ve sellem)'tan işittim, şöyle buyuruyordu: \"Âdem oğlunun bir vâdî gibi -yahut: dolusu-malı olsa, muhakkak kendisine onun bir mislinin daha olmasını arzu eder. Âdem oğlunun aç gözünü ancak toprak doldurur. Allah tevbe eden kimsenin tevbesini kabul eder.\" Abbâs: Ben bu lafız, tilâveti neshedilmiş Kur'ân mıdır yahut değil midir, bilmiyorum! demiştir. da: Ben (Mekke'de) minber üzerinde Abdullah ibnu'z-Zubey'rden: \"Ben bu lafız Kur'ân'dan mı yahut değil mi, bilmiyorum\" derken işittim, demiştir",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 6438,
			"arabicnumber": 6438,
			"text": "Bize Abdurrahmân ibnu Süleyman ibni'l-Gasîl tahdîs etti ki, Abbâs ibnu Sehl ibn Sa'd şöyle demiştir: Ben Abdullah ibnu'z-Zubeyr'den Mekke'de minber üzerinde hutbe yaparken işittim; o şöyle diyordu: Ey insanlar! Peygamber(sallallahü aleyhi ve sellem) şöyle buyurdu: \"EğerÂdem oğluna altın ile dolu bir vâdî verilseydi, o kendisine ikinci bir vâdî verilmesini arzu ederdi. Şayet kendisine ikinci bir vâdî verilse, üçüncüsünü isterdi. Âdem oğlunun iç boşluğunu ancak toprak kapatır. Allah da (hırstan) tevbe eden kimsenin tevbesini kabul eder",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 6439,
			"arabicnumber": 6439,
			"text": "İbn Şihâb şöyle demiştir: Bana Enes ibn Mâlik haber verdi ki, Rasûlüllah(sallallahü aleyhi ve sellem) şöyle buyurmuştur: \"Âdem oğlunun altından bir vâdîsi olsa o kendisinin iki vâdîsi olmasını ister. Onun ağzını topraktan başka birşey asla dolduramaz. (Hırstan) tevbe edenin tevbesini Allah kabul eder",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 6440,
			"arabicnumber": 6440,
			"text": "Buhârî şöyle dedi: Ve bize Ebû'l-Velîd söyledi: Bize Hammâd ibn Seleme Sabit el-Bunânî'den; o da Enes'ten tahdîs etti ki, Ubeyy ibn Ka'b (radıyallahü anh):\"el-Hâkümü't-tekâsüru\"Sûresi ininceye kadar biz \"Lev kâne li'bniÂdeme\" sözünü Kur'ân'dan bir âyet sanırdık, demiştir",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 6441,
			"arabicnumber": 6441,
			"text": "Hakîm ibn Hızâm (radıyallahü anh) şöyle demiştir: Ben Peygamber (sallallahü aleyhi ve sellem)'den istedim; O da bana verdi. Sonra yine istedim, O da bana verdi. Sonra yine istedim, yine verdi. Bundan sonra: \"Bu mal... \" buyurdu. râvî Sufyân ibn Uyeyne: Hakîm şöyle dedi, demiştir: Peygamber (sallallahü aleyhi ve sellem) bana: \"Yâ Hakîm! Şübhesiz bu mal yeşildir, tatlıdır. Her kim bu malı nefis güzelliği ile hırssız olarak alırsa, o mal kendisi için bereketli, meymenetli kılınır. Kim de bunu nefis düşkünlüğü ile, hırsla alırsa, mal alan için bereketli kılınmaz. O ihtiraslı kişi yiyip yiyip de hiç doymayan (köpek açlığı hastalığına tutulmuş) kimse gibi olur. Yüksek el, alçak elden hayırlıdır!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 6442,
			"arabicnumber": 6442,
			"text": "Abdullah ibn Mes'ûd (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) \"Hanginize mirasçısının malı, kendi malından daha çok sevimlidir?\" diye sordu. Yâ Rasûlallah! Bizden herbir kişiye muhakkak kendi malı daha sevimlidir! dediler. \"Çünkü kişinin kendi malı, ölümünden Önce hayır yoluna harcayıp önden gönderdiği malıdır. Mirasçının malı da kişinin hayra sarfetmeyip ölünceye kadar geri bıraktığı malıdır\" buyurdu",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 6443,
			"arabicnumber": 6443,
			"text": "Ebû Zerr (radıyallahü anh) şöyle demiştir: Ben gecelerden bir gece dışarı çıktım. Baktım ki, Rasûlüllah(sallallahü aleyhi ve sellem) da, yanında hiçbir insan olmayarak, tek başına yürüyor. Zerr dedi ki: Ben O'nu, beraberinde kimsenin yürümesini istemiyor sandım. Zerr dedi ki: Ay'ın gölgesinde yürümeye başladım. Rasûlüllah dönüp beni gördü de: \"Kimdir o?\" diye sordu. Ebû Zerr'dir, Allah beni Sana feda eylesin! dedim. O: \"Yâ Ebâ Zerr! Gel!\" diye çağırdı. Zerr dedi ki: Ben de O'nun beraberinde bir müddet yürüdüm. O: \"Malı devamlı çoğaltanlar kıyâmet gününde sevabı azaltanlardır, ancak Allah'ın kendisine bir hayır (yani mal) verdiği, onun da bu malı sağına, soluna, önüne, arkasına veren ve bu malda hayır yapan kimse böyle değildir.\" Zerr dedi ki: Sonra Rasûlüllah beni, etrafı taşlık bir meydanda oturttu da: \"Ben sana dönünceye kadar burada otur!\" buyurdu. Ebû Zerr dedi ki: Sonra kara taşlık arazî içinde ben kendisini görmez oluncaya kadar gitti. Ve bana dönmesi epey gecikti ve gecikmeyi uzattı. Sonra ben O'nun gelmekte olduğunu işittim. Gelirken: \"Hırsızlık yapsa ve zina etse de mi?\" sözlerini söylüyordu. Ebû Zerr dedi ki: Rasûlüllah gelince sabredemeyip: Ey Allah'ın Peygamberi, Allah beni Sana feda etsin. Sen taşlık yerin kenarında birisiyle konuşuyordun, fakat ben Sana cevâb veren bir kimse işitmedim, dedim. \"Bu, Cibril aleyhi's-selâmdır. Harre'nin yanında bana geldi de: Ümmetini müjdele: Her kim Allah 'a hiçbirşeyi ortak kılmayarak (tevhîd inancıyle) ölürse, cennete girer, dedi. Ben: Yâ Cibril! O kimse hırsızlık yapsa ve zina etse de mi? dedim. Evet, dedi. Ben yine: Hırsızlık yapsa ve zina etse de mi? dedim. O da: Evet; şarâb içmiş olsa da, dedi",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 6444,
			"arabicnumber": 6444,
			"text": "Ebû Zerr (radıyallahü anh) şöyle demiştir: Ben (bir kerresinde) Medine'nin Harre mevkiinde Peygamber(sallallahü aleyhi ve sellem)'in beraberinde yürüyordum. Uhud Dağı bizim karşımıza çıkınca, Peygamber: \"Yâ Ebâ Zerr!\" diye seslendi. Ben: Lebbeyke yâ Rasûlallah! (Buyur!) dedim. Rasûlüllah: \"Benim yanımda şu Uhud Dağı kadar altın olup da, ondan benim yanımda bir dînâr altın bulunduğu hâlde üzerimden üç gün geçmesi beni sevindirmez. Ancak borç için hazırlamakta olduğum mikdâr altın müstesnadır. Beni sevindiren, ancak o kadar çok altını Allah'ın kulları uğrunda şöyle, şöyle ve şöyle verip dağıtmamdır!\" buyurup sağına, soluna ve arkasına eliyle verme işaretleri yaptı. yürüdü. Yine: \"Malları çok olanlar kıyâmet gününde sevâbları az olanlardır, ancak sağına, soluna, arkasına şöyle, şöyle ve şöyle verip hayır yollarına harcayanlar müstesnadır. Bu cömert insanlar da ne kadar azdırlar!\" buyurdu. bana: \"Ben senin yanına gelinceye kadar olduğun yerde dur, oradan ayrılma!\" buyurdu. gecenin karanlığı içinde görünmez oluncaya kadar gitti. Bu sırada ben yüksekçe bir ses işittim de Peygamber'e bir musibet arız olmuş olmasından korktum ve hemen O'nun yanına gitmek istedim. Fakat O'nun bana \"Ben sana gelinceye kadar yerinden ayrılma!\" diye tenbîhlediği sözünü hatırladım da yerimden ayrılmadım. Nihayet benim yanıma geldi. Ben: Yâ Rasûlallah, bir ses işittim de üzerine korkup endişelendim, diye vaziyeti kendisine zikrettim. \"O sesi sen de işittin mi?\" buyurdu. Ben de: Evet işittim, dedim. Rasûlüllah: \"O, Cibril'di; bana geldi de: Ümmetinden Allah'a hiçbirşeyi ortak kılmayarak Ölen kimse cennete girer, dedi. Ben: O kimse zina etse ve hırsızlık yapsa da mı? diye sordum. Cibril: Zina etse ve hırsızlık yapsa da! diye cevâb verdi",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 6445,
			"arabicnumber": 6445,
			"text": "Ebû Hureyre (radıyallahü anh) şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem):\"Benim Uhud Dağı kadar altınım olsa, ondan yanımda bir parça şey bulunduğu hâlde üzerimden üç gecenin geçmemesi beni sevindirir, ancak bir borç ödemek için ayırıp hazır tutmakta olduğum mikdâr hâriçtir\" buyurdu",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 6446,
			"arabicnumber": 6446,
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 6447,
			"arabicnumber": 6447,
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 6448,
			"arabicnumber": 6448,
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 6449,
			"arabicnumber": 6449,
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 6450,
			"arabicnumber": 6450,
			"text": "Enes ibn Mâlik (radıyallahü anh):Peygamber(sallallahü aleyhi ve sellem) ölünceye kadar yüksek bir masa üzerinde yemek yemedi, yine ölünceye kadar inceltilmiş (hâlis buğday unundan) yufka ekmeği de yemedi, demiştir",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 6451,
			"arabicnumber": 6451,
			"text": "Âişe (r.anha) şöyle demiştir: Vallahi Peygamber (sallallahü aleyhi ve sellem) vefat etti. Öyle bir hâlde ki, o zaman benim rafımda herhangi bir ciğer sahibinin yiyeceği yarım vesk arpadan başka birşey yoktu. Ben, bana âid olan bu raf içindeki arpadan yemeğe devam ettim. Nihayet bunu yemek bana uzun geldi de, ben o arpayı ölçtüm, sonra tükendi",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 6452,
			"arabicnumber": 6452,
			"text": "Ebû Nuaym Fadl ibn Dukeyn, bu hadîsin yarısından bir kısmını tahdîs etti. Bize Omer ibnu Zerr tahdîs etti. Bize Mucâhid ibn Cebr tahdîs etti ki, Ebû Hureyre(radıyallahü anh) şöyle der idi: Kendisinden başka ilâh olmayan Allah'a yemîn ederim ki, muhakkak ben (bazen) açlıktan karnımı yere dayardım, bazen de açlıktan karnıma taş bağlardım. Bir gün ben (Rasûlüllah ile sahâbîlerinin mescidden) çıkıp gittikleri yol uğrağı üzerine(aç ve mecalsiz) oturdum. Bu sırada Ebû Bekr geçti. Ona Allah'ın Kitâbı'ndan bir âyet sordum.Bu soruşum ancak (beni doyurmak üzere) kendisini ta'kîb etmemi istemesi içindi. Fakat geçti gitti; ümîd ettiğim çağırmayı yapmadı. Sonra Omer uğradı. Ona da Allah'ın Kitâbı'ndan bir âyet sordum. (Maksadım âyeti öğrenmek değildi, çünkü âyeti ben iyi biliyordum.) Yine Omer'in (beni doyurmak üzere) benim kendisini ta'kîb etmemi istemesi içindi. Omer de geçti gitti, benim ümîd ettiğim çağırmayı yapmadı. Sonra bana Ebû'l-Kaasım (sallallahü aleyhi ve sellem) uğradı ve beni gördüğü zaman, bendeki hâlsizliği ve yüzümdeki açlık alâmetini anladı da gülümsedi. Sonra bana: \"Yâ Ebâ Hırr!\" dedi. Ben de: Lebbeyke yâ Rasûlallah ( = Buyur, emrine hazırım yâ Rasûlallah)! dedim. \"Ardımsıra gel!\" buyurdu, yürüdü. de O'nu ta'kîb ettim. Eve girdi. Ben de izin istedim. Bana da izin verildi. Rasûlüllah girdiğinde bir bardak içinde süt buldu. \"Bu süt nereden geldi?\" diye sordu. Onu Sana fulân kimse yahut fulân kadın hediye etti dediler. Rasûlüllah da bana: \"Yâ Ebâ Hırr!\" diye seslendi. Ben de: Buyur yâ Rasûlallah, emrine hazırım! dedim. \"Haydi Suffa ehline git de onları bana çağır!\" buyurdu. Hureyre dedi ki: Suffa ehli, İslâm konuklan idiler. Sığınacak aileleri, malları ve dayanacak bir kimseleri yoktu.Rasûlüllah bir sadaka geldiğinde, sadaka malını onlara gönderirdi. Kendisi sadaka malından birşey almazdı. Bir hediye geldiğinde de bunu Suffa ehline gönderirdi. Hediyeden kendisi de alır ve Suffa ehlini onda ortak yapardı. Hureyre dedi ki: Suffa ehlini (süt ziyafetine) çağırmak bana fena geldi. (Kendi kendime) dedim ki: \"Suffa halkı içinde şu bir bardak süt nedir ki! Lâyık olan, şu sütten bana bir yudum isabet etmeli idi de kuvvet kazanmalı idim. Da'vet edilmelerine me'mûr olduğum Suffa halkı şimdi gelip onlara dağıttığında, bu bir bardak sütten bana ne düşecek?\" diye endişeleniyordum. Allah'a ve Rasûlü'ne itaatten başka çâre yoktu. Bu sebeble gittim, Suffa halkını da'vet ettim. Geldiler, izin istediler, izin verilmesi üzerine evin içinde baştan başa yerlerini aldılar. Bunun üzerine Rasûlüllah bana: \"Yâ Ebâ Hırr!\" diye seslendi. Ben de: Buyur yâ Rasûlallah! Emrine hazırım! dedim. Rasûlüllah: \"Şu süt bardağını al, konuklara ver!\" buyurdu. de bardağı alıp vermeğe başladım. Bir kişiye veriyordum, o kanıncaya kadar içiyordu, sonra bardağı bana veriyordu. Ben de bardağı alıp diğer bir kişiye veriyordum. O da kanıncaya kadar içiyor, sonra bardağı bana veriyordu. Bu suretle bütün halk kana kana içip bardağı bana vererek tâ Rasûlüllah'a kadar gelip dağıtım işi sona erdi. Artık da'vetlilerin hepsi süte kanmışlardı. süt bardağını Rasûlüllah aldı, elinde tutarak bana bakıp gülümsedi ve: \"Yâ Ebâ Hırrl\" buyurdu. Ben de: Emret yâ Rasûlallah, emrine hazırım! dedim. Rasûlüllah: \"Süt içmedik bir ben, bir de sen kaldın!\" buyurdu. Ben de: Doğru buyurdun yâ Rasûlallah! dedim.Rasûlüllah bana: \"Haydi otur da iç!\" buyurdu. Ben de oturup içtim. Rasûlüllah tekrar: \"İç!\" buyurdu. Ben de içtim. Rasûlüllah tekrar: \"İç!\" diye emrediyordu (Ben de içiyordum). En sonu: Yâ Rasûlallah! İçemiyeceğim! Seni hakk ile gönderen Allah'a yemîn ederim ki, süt gidecek bir yol bulamam! dedim. \"Öyle ise bardağı bana ver!\" buyurdu. Ben de verdim. Rasûlüllah da Allah'a hamd etti ve Besmele çekip geri kalan sütü içti",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 6453,
			"arabicnumber": 6453,
			"text": "Bize Kays ibn Ebî Hazım tahdîs edip şöyle dedi: Ben Sa'd ibn Ebî Vakkaas (radıyallahü anh)'tan işittim, şöyle diyordu. Muhakkak ki, ben Allah yolunda ilk ok atan Arab mücâhidiyim. Ben kendimizi pek iyi bilirim ki, biz, Allah yolunda gaza ettiğimiz sıra huble ağacı ve şu semer ağacı denilen dikenli bâdiye ağaçlarının yapraklarından (ve yemişlerinden) başka yiyeceğimiz yoktu. Ve herbirimiz muhakkak davarların gübre çıkarışı gibi hiç birbirine karışmayan kuru gübre çıkarır olmuştuk. Sonra görüyorum ki, Esed oğulları kabilesi bana İslâm hükümleri ve âdabı üzerine öğretme ve doğrultma yapar oldular. (İslâm'daki öncülüğümle beraber dîn rükünlerini bana Esed oğulları öğretmeğe kalkarsa) o takdirde ben ziyan etmiş, geçmişte yaptığım çalışmalarım da zayi' olmuş gitmiştir",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 6454,
			"arabicnumber": 6454,
			"text": "Âişe (r. anha): Medine'ye geldiğinden vefatı zamanına kadar Muhammed (sallallahü aleyhi ve sellem)'in aile halkı üç gün arka arkaya buğday ekmeğinden karnını doyurmadı, demiştir",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 6455,
			"arabicnumber": 6455,
			"text": "Âişe (r. anha): Muhammed (sallallahü aleyhi ve sellem)'in aile ferdleri bir günde iki öğün yemek yemedi; yediği iki öğünden biri muhakkak hurma idi, demiştir",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 6456,
			"arabicnumber": 6456,
			"text": "Âişe (r. anha):Rasûlüllah(sallallahü aleyhi ve sellem)'ın döşeği tabaklanmış deriden idi, içi de hurma lifi dolu idi, demiştir",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 6457,
			"arabicnumber": 6457,
			"text": "Bize Katâde tahdîs edip şöyle dedi: Biz (Basra'da) Enes ibn Mâlik (radıyallahü anh)'in yanına giderdik, ekmekçisi yanıbaşında ayakta dururken bize: Yiyiniz, ben Peygamber(sallallahü aleyhi ve sellem)'in Allah'a kavuşuncaya kadar ne inceltilmiş hâlis buğday unundan yapılmış yufka ekmeği gördüğünü, ne de gözüyle kızartılmış davar gördüğünü bilmiyorum, dedi",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 6458,
			"arabicnumber": 6458,
			"text": "Âişe (r. anha): Üzerimize ay gelir geçerdi de evimizde yemek pişirecek bir ateş yakmazdık. Bizim yemeğimiz, sâdece hurma ile sudan ibaretti. Ancak bize bir parça et verilmesi müstesna, demiştir",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 6459,
			"arabicnumber": 6459,
			"text": "Âişe (r. anha), Urve'ye hitaben: Ey kızkardeşimin oğlu! Biz Peygamber ailesi iki ay içinde üç hilâl görürdük de RasûIullah (sallallahü aleyhi ve sellem)'ın evlerinde bir ateş yakılmazdı, demişti. de: Teyzeciğim, sizleri ne yaşatırdı? diye sorunca da: İki siyah şey: Hurma ile su! diye cevâb verip şunu ilâve etmiştir: Ancak Rasûlüllah'ın Ensâr'dan birtakım komşuları vardı. Bu komşuların da sağımlı develeri olurdu. Onlar evlerinden bu sağımlı develerden sağıp geri vermek üzere Rasûlüllah'a ariyet verirlerdi de, böylece onların sütlerini bize içirirlerdi, demiştir",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 6460,
			"arabicnumber": 6460,
			"text": "Ebû Hureyre (radıyallahü anh):Rasûlüllah(sallallahü aleyhi ve sellem):\"Allâhumme urzuk âle Muhammedin kûten (= Yâ Allah! Muhammed ailesine geçinecek kadar rızk ihsan eyle)\" diye duâ ederdi, demiştir",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 6461,
			"arabicnumber": 6461,
			"text": "Eş'as şöyle dedi: Ben babam Ebû’s-Sa'saa'dan işittim, şöyle dedi: Ben Mesrûk'tan işittim, şöyle dedi: Ben Âişe (r.anha)'ye: Peygamber(sallallahü aleyhi ve sellem)'e amelin hangisi daha sevimli idi? diye sordum. Âişe: (Yapıcısının devam ettiği) devamlı amel! dedi. Mesrûk dedi ki: Ben Âişe'ye: Rasûlüllah(gece namazına) ne zaman kalkardı? dedim. Oda: Rasûlüllah, horoz sesini işittiği zaman kalkardı, dedi",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 6462,
			"arabicnumber": 6462,
			"text": "Âişe (r. anha):Rasûlüllah(sallallahü aleyhi ve sellem)'ın en çok sevdiği amel, sahibinin üzerinde devam eder olduğu ameldi, demiştir",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 6463,
			"arabicnumber": 6463,
			"text": "Ebû Hureyre (radıyallahü anh) şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem): \"Sizden hiçbirinizi asla kendi ameli kurtaramaz!\" buyurdu. Sahâbîler: Yâ Rasûlallah! Seni de mi amelin kurtaramaz? diye sordular. \"Evet, beni de kendi amelim kurtaramaz. Ancak Allah beni rahmetiyle bürüyüp korur. Sizler doğru yolu tutun, ifrat etmeyin, gündüzün ilk ve son saatlerinde yürüyün, gecenin sonundan da bir mikdâr faydalanın. Ve sizler (her hâl ve hareketinizde) i'tidâle tutunun, i'tidâle tutunun ki, maksadınıza eresiniz\" buyurdu",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 6464,
			"arabicnumber": 6464,
			"text": "Bize Süleyman ibn Bilâl, Mûsâ ibn Ukbe'den; o da Ebû Seleme ibn Abdirrahmân'dan; o da Âişe (r.anha)'den tahdîs etti ki,Rasûlüllah(sallallahü aleyhi ve sellem):“Doğru yolu tutunuz, (işleriniz ve ibâdetlerinizde) ifrat etmeyiniz. Şunu iyi biliniz ki, sizlerden hiçbirinizi kendi ameli cennete girdiremiyecektir. Amellerin Allah'a en sevgili olanı da, az olsa bile en devamlı yapılanıdır\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 6465,
			"arabicnumber": 6465,
			"text": "Âişe (r.anha) şöyle demiştir: Bir kerresinde Peygamber(sallallahü aleyhi ve sellem)'e: Amellerin hangisi Allah'a daha sevimlidir? diye soruldu da, \"Az olsa da en devamlı yapılanıdır\"buyurdu ve: \"Sizler amellerden takat yetirebileceğiniz kadarını üzerinize alınız!\" tavsiyesini de ilâve etti",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 6466,
			"arabicnumber": 6466,
			"text": "Alkame şöyle demiştir: Ben mü'minlerin anası Âişe (r.anha)'ye: Ey mü'minlerin anası! Peygamber'in ameli nasıl idi? O herhangi bir şeyi günlerden birine tahsîs eder miydi? diye sordum. Hayır, tahsîs etmezdi. O'nun ameli devamlı olurdu. Sizin hanginiz Peygamber(sallallahü aleyhi ve sellem)'in güç yetirmekte olduğu kadar amele güç yetirebilir? Dedi",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 6467,
			"arabicnumber": 6467,
			"text": "Bize Mûsâ ibn Ukbe, Ebû Seleme ibn Abdirrahmân'dan; o da Âişe (r.anha)'den tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem): \"Doğru yolu tutunuz, amellerde ifrata gitmeyiniz, (ameller üzerine sevâbla) müjdeleyip sevdiriniz. Şu muhakkak ki, hiçbir kimseyi kendi ameli cennete girdiremez\" buyurdu. Seni de mi kendi amelin girdiremez yâ Rasûlallah? diye sordular. \"Evet beni de, ancak Allah beni bir mağfiret ve bir rahmetle bürüyüp korumuştur\" buyurdu. üstadı) Alî ibn Abdillah el-Medînî: Ben bu hadîsi Ebu'n-Nadr'dan; o da Ebû Seleme'den; o da Âişe'den senediyle bilmekteyim, demiştir",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 6468,
			"arabicnumber": 6468,
			"text": "Hilâl ibn Alî şöyle demiştir: Ben Enes ibn Mâlik (radıyallahü anh)'ten işittim, şöyle diyordu: Rasûlüllah (sallallahü aleyhi ve sellem) bir gün bizlere namaz kıldırdı, sonra minbere çıktı ve eliyle mescidin kıble tarafına işaret edip göstererek şöyle buyurdu: \"Şimdi sizlere namaz kıldırdığımdan beri mescidin şu kıble duvarı önünde cennet ve ateş, misâllendirilmiş olarak bana gösterildi. Ben hayır ve şerrde bugünkü gibisini görmedim, ben hayır ve şerrde bugünkü gibisini görmedim!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 6469,
			"arabicnumber": 6469,
			"text": "Ebû Hureyre (radıyallahü anh) şöyle demiştir: Ben Rasûlüllah(sallallahü aleyhi ve sellem)'tan işittim, şöyle buyuruyordu: \"Allah, (kullarının birbirine rahmet edegeldikleri) rahmeti yarattığı gün, onu yüz rahmet olarak yarattı da kendi yanında doksan dokuz rahmeti tutup alıkoydu, geri kalan tek bir rahmeti de bütün mahlûkları arasına salıverdi. Eğer kâfir, Allah yanında bulunan rahmetin hepsini bilir olsaydı, cennetten ümidini kesmezdi. Eğer mü'min de Allah yanındaki azabın hepsini bilir olsaydı, ateş azabından emîn olmazdı",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 6470,
			"arabicnumber": 6470,
			"text": "Ebû Saîd el-Hudrî (radıyallahü anh) şöyle haber vermiştir: Ensâr'dan bâzı kimseler Rasûlüllah (sallallahü aleyhi ve sellem)'tan(mal) istediler. Onlardan isteyen herbir kimseye Rasûlüllah muhakkak verdi de, nihayet yanındaki mallar tükendi. Elleriyle infâk ettiği şeylerin hepsi tükendiği zaman, onlara şöyle buyurdu: \"Yanımda bulunan hayırdan (yânı maldan) hiçbirşeyi sizlerden alıkoymuyorum. Şu muhakkak ki, kim (istemeyip) iffetli kalmak isterse, Allah onu iffetli kılar. Kim de sabretmeye çalışırsa, Allah ona da sabır ihsan eder. Kim insanlardan müstağni olmak isterse, Allah onu müstağni kılar. Sizlere sabırdan daha hayırlı ve sabırdan daha geniş hiçbir atıyye asla verilmemiştir!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 6471,
			"arabicnumber": 6471,
			"text": "el-Mugîre ibn Şu'be (radıyallahü anh) şöyle diyordu: Peygamber(sallallahü aleyhi ve sellem) iki ayağı şişinceye yahut kabarıncaya kadar gece namazı kılardı. Kendisine(Allah Sen'in gelmiş, gelecek bütün günâhlarını mağfiret ettiği hâlde bu yorucu ibâdetin sebebi nedir?) denildiğinde: \"Ben çok şükredici bir kul olmayayım mı?\" diye cevâb verirdi",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 6472,
			"arabicnumber": 6472,
			"text": "Bize Şu'be tahdîs edip şöyle dedi: Ben Husayn ibn Abdirrahman'dan işittim, şöyle dedi: Ben Saîd ibn Cubeyr'in yanında oturuyordum. O İbn Abbâs radıyallahü anhüma'tan söyledi: Rasûlüllah(sallallahü aleyhi ve sellem):\"Ümmetimden yetmişbin kişi cennete hesaba çekilmeden girerler, onlar efsun yapmazlar, uçan hayvanlarla uğursuzluk olacağı görüşüne gitmezler ve her hususta Rabb'lerine güvenip dayanırlar\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 6473,
			"arabicnumber": 6473,
			"text": "Bize birden çok kimseler haber verdi. Onlardan biri Mugîre ibn Mıksem, biri fulân kimse, üçüncüsü de bir adamdır. Bunların üçü de eş-Şa'bî'den; o da el-Mugîre ibn Şu'be'nin kâtibi olan Verrâd'dan şöyle dediğini naklettiler. Muâviye ibn Ebî Sufyân, el-Mugîre'ye: Benim için Rasülullah (sallallahü aleyhi ve sellem)'tan işitmiş olduğun hadîsi yaz! diye mektûb yazıp yolladı. Verrâd dedi ki: Bunun üzerine el-Mugîre de Muâviye'ye şunları yazdı: Ben Rasûlüllah'ın namazdan çıkması akabinde üç kerre şunları söyler olduğunu işittim; \"Lâ ilahe ille'llâhu vahdehu lâ şerike lehu, lehu'l-mulku ve lehu’l-hamdu, ve huve ala kullî şey 'in kadîr''. Ve yine Rasûlüllah, \"Kîle ve kaale ( = Denildi ve dedi)\" den, çok çok suâl sormaktan, mal telef etmekten, analara itaatsizlik etmekten, kızları diri diri gömmekten nehyederdi, diye yazdı. Huşeym'den: Bize Abdulmelik ibnu Umeyr haber verip şöyle dedi: Ben Verrâd'dan işittim; o bu hadîsi el-Mugîre'den; o da Peygamber'den olmak üzere tahdîs ediyordu",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 6474,
			"arabicnumber": 6474,
			"text": "Bize Amr ibnu Alî tahdîs etti, kendisi Ebû Hâzım'dan işitmiştir. O da Sehl ibn Sa'd (radıyallahü anh)'dan ki, Rasûlüllah(sallallahü aleyhi ve sellem):\"Her kim iki çene kemiği arasındaki dilini ve iki budu arasında bulunan organını (şerrden korumayı) bana te'mîn ederse, ben de ona cenneti te'mîn ederim!\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 6475,
			"arabicnumber": 6475,
			"text": "Ebû Hureyre (radıyallahü anh) şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem) şöyle buyurdu: \"Allah'a ve son güne îmân eden hayır söylesin yahut sussun. Allah'a ve son güne îmân eden komşusuna ezâ etmesin. Allah'a ve son güne îmân eden, konuğuna ikram etsin",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 6476,
			"arabicnumber": 6476,
			"text": "Ebû Şurayh el-Huzâî (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) bu hadîsi tebliğ ederken (benim iki gözüm yüzünü gördü) iki kulağım söylediklerini işitti ve kalbim de ezberledi. Peygamber: \"Konukluk üç gündür. Onlardan biri gelip geçici olandır\" buyurdu. Konuğun caize olanı, yani gelip geçici olanı nedir? denildi. Peygamber: \" (Onun gelip geçicisi) bir gün ve bir gecedir. Kim Allah'a ve son güne îmân ediyorsa, konuğuna ikram etsin. Kim Allah'a ve son güne îmân ediyorsa hayır söylesin yahut sükût etsin!'' buyurdu",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 6477,
			"arabicnumber": 6477,
			"text": "Ebû Hureyre (radıyallahü anh),Rasûlüllah(sallallahü aleyhi ve sellem) şöyle buyururken işitmiştir: \"Kul bazen içinde ne olduğu belli olmayan (yani kötülüğünü ve ne sabit olacağını düşünmeden) bir söz söyler de, o söz sebebiyle ateşin içinde, güneşin doğduğu yer ile battığı yer arasından daha uzak bir derinliğe kayıp gider",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 6478,
			"arabicnumber": 6478,
			"text": "Bize Abdurrahmân ibnu Abdillah, yânı İbn Dînâr, babası Abdullah'tan; o da Ebû Salih'ten; o da Ebû Hureyre (radıyallahü anh)'den tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem) şöyle buyurmuştur: \"Bir kul, Allah'ın hoşnûd olduğu kelimelerden bir kelimeyi ehemmiyet vermiyerek söyler de Allah o kimseyi bu kelime sebebiyle birçok derecelere yükseltir. Bir kul da Allah'ı öfkelendirecek kelimelerden bir kelimeyi, hiç ehemmiyet vermeden söyler de, kendisi o kelime sebebiyle cehennemin içine düşer",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 6479,
			"arabicnumber": 6479,
			"text": "Ubeydullah şöyle dedi: Bana Habîb ibnu Abdirrahmân, Hafs ibn Âsım'dan; o da Ebû Hureyre (radıyallahü anh)'den tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem):\"Yedi sınıf insan vardır ki, Allah onları (kıyâmet gününde) gölgelendirecektir: Biri (lisânen yahut kalben) Allah'ı anıp da iki gözü yaş akıtan kişidir...\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 6480,
			"arabicnumber": 6480,
			"text": "Bize Cerîr, Mansûr'dan; o da Rıb'î'den; o da Huzeyfe (radıyallahü anh)'den tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem) şöyle buyurmuştur: \"Sizden önce geçen ümmetlerden bir kişi vardı. Amelinin kötülüğünü düşünerek ailesine şöyle vasiyet etti: Ben öldüğüm zaman sizler benim cesedimi alın ve beni küçük küçük zerrelere parçalayın da sıcak bir günde denize serpip dağıtın! dedi. Ölünce ailesi ferdleri onu dediği şekilde yaptılar. Allah onun zerrelerini topladıktan sonra, ona: Seni bu yaptığın işe sevkeden nedir? diye sordu. O kul da: Beni bu işi yapmaya sevkeden, ancak Sen 'den korkmamdır, dedi. Bunun üzerine Allah onu mağfiret eyledi",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 6481,
			"arabicnumber": 6481,
			"text": "Bize Katâde, Ukbe ibnu Abdilgâfir'den; o da Ebû Saîd (radıyallahü anh)'den tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem) şöyle zikretmiştir: \"Sizden önce geçenler içinde yahutsizden önceki ümmetlerden bir adam vardı. Allah ona mal ve evlâd getirmişti, yân? ona mal vermişti.\" ki: \"Kendisine ölüm yaklaşınca oğullarına: Ben sizler için hangi çeşit bir baba oldum? dedi. Oğulları: Sen bize hayırlı bir baba oldun, dediler. O da: Şu muhakkak ki, bu baba, Allah yanında bir hayır biriktirmemiştir, dedi.\" bu \"Lem yebteir...\" sözünü, \"Allah yanında bir hayır biriktirmedi\" diye tefsir etmiştir. \"Baba şöyle devam etti: Bu baba, Allah huzuruna vardığında Allah onu azâb edecektir. Bunun için bakınız! Ben öldüğüm zaman siz beni yakınız, kapkara kömür olduğum zaman beni ezip öğüterek ufalayınız -yahut: Beni iyice inceltiniz-. Sonra şiddetli esen bir rüzgâr olduğu zaman benim zerrelerimi rüzgâra verip uçurunuz, dedi ve oğullarından bu söylediklerini yapacaklarına dâir: Rabb'ime yemîn olsun ki, yapacağız! diye kesin ahd ve mîsâklarım aldı. Sonra oğulları onun kendilerine söylediği bu işleri yaptılar. Allah Taâlâ o kimseye \"Ol!\" buyurdu, o da hemen bir adam olup ayakta durdu. Sonra Allah ona: Ey kulum, bu yaptığın vasiyete seni sevkeden nedir? diye sordu. zât: Sen'in mahâfetin -yahut: Sen'den korkmaktır-, dedi. Allah: Kusuru -yahut: Elden kaçan fırsatı- Allah'ın merhamet etmesi telâfi eder, buyurdu.\" et-Teymî yahut Katâde şöyle dedi: Ben bu hadîsi Ebû Usmân'a tahdîs ettim. O da: Ben bunu Selmân el-Fârisî'den; o da Peygamber'den tahdîs ediyordu. Ancak o şunu ziyâde etti: \"O adam: Benim zerrelerimi denize serpin, dedi\" yahut Ebû Saîd'in tahdîs ettiği gibi",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 6482,
			"arabicnumber": 6482,
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 6483,
			"arabicnumber": 6483,
			"text": "Bize Ebu'z-Zinâd, Abdurrahmân'dan tahdîs etti. O da Ebu'z-Zinâd'a Ebû Hureyre(radıyallahü anh)'den işittiğini tahdîs etmişti. Ebû Hureyre de Rasûlüllah(sallallahü aleyhi ve sellem)'tan şöyle buyururken işitmiştir: \"Benim meselimle insanların meseli, ancak şu adamın meseli gibidir: O bir ateş yaktı da, ateşin ışığı etrafını aydınlattığı zaman küçük kelebekler ve ateşin içine düşer olan şu hayvanlar ateşin içine düşmeğe başladılar. O adam da bu hayvancıkları geri çekmeye başladı. Fakat hayvanlar ona gâlib gelip hepsi de ateşin içine düşüyorlardı. İşte ben de sizlerin izâr bağlarınızdan tutuyor ve sizleri ateşten çekip kurtarmaya çalışıyorum, insanlar ise ateşe giriyorlar",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 6484,
			"arabicnumber": 6484,
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 6485,
			"arabicnumber": 6485,
			"text": "Âmir eş-Şa'bî şöyle demiştir: Ben Abdullah ibn Amr'dan işittim, şöyle diyordu:Peygamber(sallallahü aleyhi ve sellem):\"Müslüman, dilinden ve elinden müslümânların selâmette kaldığı kimsedir. Muhacir de Allah'ın nehyettiği şeyleri terkedendir\" buyurdu",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 6486,
			"arabicnumber": 6486,
			"text": "Ebû Hureyre (radıyallahü anh) şöyle der idi: Rasûlüllah(sallallahü aleyhi ve sellem):\"Benim bilmekte olduğum hakikatleri sizler bilir olsaydınız, muhakkak az güler, çok ağlardınız\" buyurdu. ibn Mâlik (radıyallahü anh) de: Peygamber(sallallahü aleyhi ve sellem):\"Benim bilmekte olduğum şeyleri sizler bilir olsaydınız, elbette az güler, çok ağlardınız\" buyurdu, demiştir",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 6487,
			"arabicnumber": 6487,
			"text": "Bana Mâlik, Ebu'z-Zinâd'dan; o da el-A'rec'den; o da Ebû Hureyre (radıyallahü anh)'den tahdîs etti ki, Rasûlüllah(sallallahü aleyhi ve sellem):\"Ateş, şehvet perdeleriyle perdelenip örtüldü. Cennet de nefsin hoşlanmadığı mükellefiyetlerin zorluklarıyle perdelenip örtüldü\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 6488,
			"arabicnumber": 6488,
			"text": "Abdullah ibn Mes'ûd (radıyallahü anh):Peygamber(sallallahü aleyhi ve sellem):\"Cennet sizin herbirinize, kendi ayağındaki ediğin tasmasından daha yakındır. Ateş de bunun gibi yakındır\" buyurdu, demiştir",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 6489,
			"arabicnumber": 6489,
			"text": "Bize Şu'be, Abdulmelik ibn Umeyr'den; o da Ebû Seleme'den; o da Ebû Hureyre(radıyallahü anh)'den tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem):\"Şâir sınıfının söylediği en doğru beyit: küllü şey'in mâ halâllâhe bâtılu küllü naîmin lâ mâ hâlete zâilu) başka herşey bâtıldır, her ni'met çaresiz zail olucudur) beytidir\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 6490,
			"arabicnumber": 6490,
			"text": "Bana Mâlik, Ebu'z-Zinâd'dan; o da el-A'rec'den; oda Ebû Hureyre (radıyallahü anh)'den tahdîs etti ki, Rasûlüllah(sallallahü aleyhi ve sellem):\"Sizden biriniz yaratılış, mal ve evlâd hususunda kendisinden üstün kılınmış kimselere baktığı zaman (üzülmesin), hemen kendisinden aşağı (hâlli) kimselere baksın\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 6491,
			"arabicnumber": 6491,
			"text": "Bize Ebû Recâ el-Utâridî, İbn Abbâs radıyallahü anhüma'tan tahdîs etti. Peygamber(sallallahü aleyhi ve sellem) Azîz ve Celîl olan Rabb'inden rivayet ettiği bir hadîsinde şöyle dedi: \"Şübhesiz Yüce Allah (eşyadaki) güzellikleri ve çirkinlikleri takdir edip yazdı. Sonra güzellerin güzelliğini, fenaların ve kötülerin de çirkinliklerini beyân edip açıkladı. Her kim bir güzel iş yapmak diler de onu yapamazsa, Allah o kimse hesabına kendi dîvânında (meleklerine) tam bir hasene (sevabı) yazdırır. Eğer o kimse güzel bir iş yapmak ister ve yaparsa Allah o kimse lehine kendi dîvânında on hasene sevabından yediyüz misline ve daha çok emsaline kadar hasene sevabı yazdırır. Bir kimse de çirkin bir iş yapmayı kasdeder ve onu işlemezse, Allah kendi dîvânında onun lehine tam bir hasene sevabı yazdırır. Eğer o kimse fena bir iş yapmak ister de o fenalığı yaparsa, Allah onun aleyhine bir tek kötülük yazdırır",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 6492,
			"arabicnumber": 6492,
			"text": "Enes ibn Mâlik (radıyallahü anh) şöyle demiştir: Sizler muhakkak birçok ameller yapmaktasınız ki, onlar sizin gözlerinizde kıldan incedir. Şu muhakkak ki, bizler Peygamber (sallallahü aleyhi ve sellem)'in zamanında onları helak edici günâhlar sayardık. Abdillah el-Buhârî: Enes, bu \"Mûbikaat\" sözüyle \"Muhlikât\"ı kasdediyor, demiştir",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 6493,
			"arabicnumber": 6493,
			"text": "Sehl ibn Sa'd es-Sâidî (radıyallahü anh) şöyle dedi:Peygamber(sallallahü aleyhi ve sellem) Hayber harbinde müşriklerle mukaatele etmekte olan bir adama baktı. O adam savaştaki yeterlilik bakımından müslümânlann en büyükleri derecesinde idi. Ona baktı da: \"Her kim cehennem ehlinden bir adama bakmak isterse, şu adama baksın!\" buyurdu. bu sözü üzerine sahâbîlerden bir zât hiç ayrılmaksızın o adamı ta'kîb edip gözledi. O adam sonunda yaralanınca çabuk ölmek isteyerek kendi kılıcının sivri ucunu iki memesinin arasına koydu. Sonra üzerine dayanıp yüklendi, kılıç iki küreği arasından dışarı çıktı (ve öldü). Onun bu işi Peygamber'e ulaşınca: \"Kul, insanların görüşünde cennet ehlinin amelini yapar, Halbuki o, muhakkak ateş ehlindendir. Yine kul insanların görüşünde ateş ehlinin amelini yapar, Halbuki o, cennet ehlindendir. Ameller ancak (ölüm sırasındaki) sonlarına göre değerlendirilir\" buyurdu",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 6494,
			"arabicnumber": 6494,
			"text": "Ebû Saîd el-Hudrî (radıyallahü anh) şöyle demiştir: Bir bedevî Arab Peygamber(sallallahü aleyhi ve sellem)'e geldi de: Yâ Rasûlallah! İnsanların hangisi hayırlıdır? diye sordu. Rasûlüllah: \"Canıyla, malıyla (Allah yolunda) cihâd eden adamdır ve bir de vâdilerden bir vâdî içinde (yalnızlığa çekilerek) Rabb'ine ibâdet eden ve insanları şerrinden rahat bırakan adamdır\" buyurdu. hadîsi ez-Zuhrî'den rivayet etmekte Şuayb'e, ez-Zubeydî, Süleyman ibn Kesîr ve en-Nu'mân mutâbaat etmişlerdir. Ve Ma'mer ibn Râşid, ez-Zuhrî'den; o da Atâ ibn Yezîd'den yahut Ubeydullah'tan; o da Ebû Saîd'den; o da Peygamber'den olmak üzere söyledi. İbnu Musâfir, Yahya ibn Saîd üçlüsü de İbn Şihâb'dan; o da Atâ ibn Yezîd'den; o da Peygamber'in bâzı sahâbîlerinden; onlar da Peygamber(sallallahü aleyhi ve sellem)'den söylediler",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 6495,
			"arabicnumber": 6495,
			"text": "Ebû Saîd el-Hudrî (radıyallahü anh) şöyle diyordu: Ben Peygamber(sallallahü aleyhi ve sellem)'den işittim, şöyle buyuruyordu: \"İnsanlar üzerine Öyle (sıkıntılı) bir zaman gelir ki, onda müslümân kişinin hayırlı malı koyun sürüsüdür. Müslümân o koyun sürüsünü dağ başlarına ve yağmur düşen vadilere götürür, böylece dîni yüzünden olacak fitnelerden kaçar kurtulur",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 6496,
			"arabicnumber": 6496,
			"text": "Ebû Hureyre (radıyallahü anh) şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem- bir A'râbî'nin sorusuna cevâb olarak): ''Emânet zayi' edildiği zaman kıyâmeti bekle!\" buyurdu. A'râbî: Emâneti zayi' etmek nasıl olur yâ Rasûlallah? diye tekrar sorunca: \"İş ehli olmayan kimseye havale edilip dayandırıldığı zaman kıyâmeti bekle!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 6497,
			"arabicnumber": 6497,
			"text": "Huzeyfe (radıyallahü anh) şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem) bize iki hâdise haber verdi. Bunlardan birisini gördüm, öbürüsünü görmeyi gözlüyorum. Rasûlüllah bana (emânetin nasıl indirildiğini şöyle) haber verdi: \"Emânet (yânı dîn duyguları, adalet ve emniyet umdeleri ilk önce) sâlih kimselerin gönüllerinin derinliğine indi. (Böylece emânet fıtrî oldu.) Sonra o kullar Kur'ân 'dan bilgi aldılar, sonra sünnetten bilgi aldılar (bu da kesbî oldu).\" bize emânetin geri kaldırılmasını da haber verip şöyle buyurdu: \" (Fıtrî ve kesbî duygular sahibi olan) bilgili kişi, bir uyku uyur. O uyurken emânet kalbinden silinip alınır da, emânetin eseri (izi, yeri), rengi uçuk bir nokta hâlinde yanık yeri gibi kalır. Sonra o bilgin kişi bir uyku daha uyurken, emânetin (geri kalan kısmı da) alınır. Bunun eseri ve yeri de balta sallayan bir işçinin avucundaki kabarcık gibi kalır (bir zaman sonra o da söner gider). Şu hâlde (o mübarek) emânet, senin ayağına düşürdüğün bir ateş parçasının düştüğü yeri şişirip senin onu bir kabarcık şeklinde görmen gibidir. Halbuki bu kabarcıkta (bedenin hayâtı üzerinde te'sîrli) birşey yoktur (bir zaman sonra söner gider). Şu vaziyette halk birbirleriyle alışveriş etmek ve medenî münâsebette bulunmak için (müşkil bir günün) sabahına erişmiş bulunur. Hiçbir kimse emâneti edâ etmek imkânım bulamaz. Şöyle ki, bazen 'Fulân oğulları içinde emîn bir kimse vardır (emâneti ona verelim)' denilir. Bazen birisinin lehine: 'O ne akıllıdır, ne tedbirlidir; o ne zerâfetli zâttır, o ne kahramandır!' diye şehâdet olunur. Halbuki hakkında propaganda yapılan şahsın kalbinde hardal dânesi kadar îmândan bir eser yoktur. \" dedi ki: Bana öyle bir zaman karşı geldi (öyle bir zamanda yaşadım) ki, o (saâdetli ve emânetli) devirde ben kiminle alışveriş edeceğim diye tasalanmazdım. Çünkü medenî münâsebette bulunacağım kimse müslümânsa, onu İslâm Dîni (bana hıyanet etmekten) men' ederdi. Eğer Hristiyân (ve Yahûdî) ise, onu bulunduğu yerin vâlîsi hıyanetten men ederdi. (Bu suretle o devirde umûmî bir emniyet vardı.) Bu gün ise, ben fulân ve fulândan başka kimse ile alışveriş edemez oldum",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 6498,
			"arabicnumber": 6498,
			"text": "Abdullah ibn Omer (radıyallahü anh) şöyle demiştir: Ben Rasûlüllah(sallallahü aleyhi ve sellem)'tan işittim: \"İnsanlar ancak yüz deve gibidirler; içlerinde hemen hemen kâmil sıfatlı, kullanışlı bir tane iyi binek devesi bulamazsın!\" buyuruyordu",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 6499,
			"arabicnumber": 6499,
			"text": "Seleme ibn Kuheyl şöyle demiştir: Ben Cundeb ibn Abdillah'tan işittim. Peygamber(sallallahü aleyhi ve sellem) şöyle buyurdu, diyordu. dedi ki: Ben (bu zamanda) Cundeb'den başka kimseden \"Peygamber(sallallahü aleyhi ve sellem) şöyle buyurdu\" derken işitmedim. Cundeb'e yaklaştım ve onun şöyle demekte olduğunu işittim: Peygamber(sallallahü aleyhi ve sellem):''Kim (işlediği hayrı şöhret için) insanlara duyurursa, Allah onun (gizli işlerini) duyurur. Kim de (herhangibir hayrı) gösterişçe yaparsa, Allah da onun gösterişçiliğini meydana çıkarır\" buyurdu",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 6500,
			"arabicnumber": 6500,
			"text": "Bize Enes ibn Mâlik (radıyallahü anh) tahdîs etti. Muâz ibn Cebel(radıyallahü anh) şöyle demiştir: Ben bineği üzerinde iken Peygamber(sallallahü aleyhi ve sellem)'in arka tarafına binmiş, O'nunla aramda ancak semerin ağacı olup beraber yol aldığımız sıra bana: \"Yâ Muâz!\" diye nida etti. Ben: Lebbeyke yâ Rasûlallahi ve sa'deyke(= Buyur yâ Rasûlallah, tekrar tekrar emrine hazırım, tekrar tekrar yardıma hazırım)! dedim. bir müddet yürüdü. Sonra yine: \"Yâ Muâz!\" diye seslendi. Ben: Buyur yâ Rasûlallah, tâate hazırım, yardıma hazırım! dedim. Sonra bir müddet daha yürüdü. Sonra yine: \"Yâ Muâz ibne Cebel!\" diye seslendi. Ben: Buyur yâ Rasûlallah, itaatine ve yardım etmeye hazırım! dedim. \"Allah'ın kulları üzerinde ne hakkı vardır bilir misin?\" diyre sordu. Ben: Allah ve Rasûlü en bilendir, dedim. \"Allah’ın kulları üzerinde sabit olan hakkı, kulların Allah'a itaat ve ibâdet etmeleri ve Allah'a hiçbirşeyi ortak kılmamalarıdır\" buyurdu. bir süre daha yürüdü. Sonra: \"Yâ Muâz ibne Cebel!\" dedi. yine: Lebbeyke yâ Rasûlallahi ve sa'deyke! dedim. \"Kullar bu tevhîd ve ibâdeti yaptıkları zaman, kulların Allah üzerindeki hakları nedir bilir misin?\" diye sordu. Allah ve Rasûlü en bilendir! dedim. \"Kulların Allah üzerindeki hakkı, Allah'ın onları azâb etmemesidir\" buyurdu",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 6501,
			"arabicnumber": 6501,
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 6502,
			"arabicnumber": 6502,
			"text": "Ebû Hureyre (radıyallahü anh) şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem) şöyle buyurdu: \"Allah şöyle buyurdu: Her kim beni tanıyan ve ihlâs ile bana ibâdet eden bir kuluma düşmanlık ederse, ben de ona harb i'lân ederim. Kulum bana, kendisine farz kıldığım şeylerden daha sevgili olan birşeyle yaklaşamaz. Kulum bana nafile ibâdetlerle de yaklaşmaya devam eder. Nihayet ben onu severim. Ben kulumu sevince de artık onun işitir kulağı, görür gözü, tutar eli, yürür ayağı mesabesinde olurum (ve bu organlarıyle meydana gelmesini arzu ettiği bütün dileklerini veririm). Diliyle de her ne isterse muhakkak onları da kendisine ihsan ederim. Bana sığınmak isteyince de muhakkak kulumu sığındırır, korurum. Ben yapmasını dilediğim hiçbirşey hakkında, mü'minin ölümü karşısındaki tereddüdüm gibi tereddüt etmedim. Fakat bunda kulum ölümden hoşlanmıyordu, ben de kuluma acı gelen şeyi sevmiyordum",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 6503,
			"arabicnumber": 6503,
			"text": "Sehl ibn Sa'd (radıyallahü anh):Rasûlüllah(sallallahü aleyhi ve sellem) iki parmağını (şehâdet parmağı ile orta parmağını) uzatıp işaret ederek: \"Kıyâmet günü ile ben şu ikisi gibi ba's olundum\" buyurdu, demiştir",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 6504,
			"arabicnumber": 6504,
			"text": "Bize Şu'be, Katâde'den; o da Ebu't-Teyyâh'tan; o da Enes (radıyallahü anh)'den tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem):\"Kıyâmet günü ile ben işte şu iki parmak gibi yanyana ba's olundum\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 6505,
			"arabicnumber": 6505,
			"text": "Bize Ebû Bekr ibn Ayyâs, Ebû Husayn'dan; o da Ebû Salih'ten; o da Ebû Hureyre (radıyallahü anh)'den haber verdi ki, Peygamber(sallallahü aleyhi ve sellem), iki parmağını kasdederek: \"Ben ve kıyâmet, şu iki parmak gibi birbirine yakın olarak gönderildim\" buyurmuştur. hadîsi Ebû Husayn'dan rivayet etmesinde İsrâîl ibn Yûnus, Ebû Bekr'e mutâbaat etmiştir",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 6506,
			"arabicnumber": 6506,
			"text": "Bize Ebu'z-Zinâd, Abdurrahmân'dan; o da Ebû Hureyre (radıyallahü anh)'den tahdîs etti ki, Rasûlüllah(sallallahü aleyhi ve sellem) şöyle buyurmuştur: \"Güneş batıdan doğuncaya kadar kıyâmet kopmaz- Güneş batıdan doğduğu zaman, insanların hepsi onu görürler de toptan hepsi îmân ederler. İşte bu, “... Rabbi’nin âyetlerinden biri geldiği gün, daha evvelden îmân etmiş veya îmânında bir hayır kazanmış olmayan hiçbir kimseye (o günkü) imânı asla fayda vermez...”(el-En'âm: 158)olduğu zamandır. Muhakkak ki, kıyâmet şübhesiz kopacaktır; öyle bir hâlde ki, alım-satım için satıcı ile müşteri aralarında kumaşlarını yaymış olacaklar da alım-satım yapamadan ve kumaşlarını da düremeden ansızın kopacaktır. Yine muhakkak kıyâmet kopacaktır. Şöyle ki: Kişi sağımlı devesinin sütünü sağıp getirdiği hâlde, onu tadıp içmeden ansızın kopacaktır. Yine kıyâmet şübhesiz kopacaktır. Öyle bir hâlde ki, kişi su havuzunu sıvayıp tamir edecek, fakat kıyâmet ansızın kopacak da havuzun suyunu kullanmak nasîb olmayacaktır. Kıyâmet muhakkak kopacak; öyle bir çabuklukta ki, sizden herhangi biriniz yemek yerken, lokmasını ağzına kaldıracak, fakat kıyâmet ansızın kopacak da o lokmasını yiyemeyecektir",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 6507,
			"arabicnumber": 6507,
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 6508,
			"arabicnumber": 6508,
			"text": "Bize Ebû Usâme, Bureyd'den; o da Ebû Burde'den; o da Ebû Mûsâ (radıyallahü anh)'dan tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem):\"Her kim Allah'a kavuşmayı severse, Allah da ona kavuşmayı sever. Her kim de Allah'a kavuşmayı sevmezse, Allah da onunla buluşmayı istemez\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 6509,
			"arabicnumber": 6509,
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 6510,
			"arabicnumber": 6510,
			"text": "İbn Şihâb şöyle demiştir: Bana Saîd ibnu’l-Müseyyeb ile Urvetu'bnu'z-Zubeyr, ilim ehlinden birçok adamlar içinde haber verdiler ki, Peygamber(sallallahü aleyhi ve sellem)'in zevcesi Âişe (r.anha) şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem) sıhhatte iken: \"Hiçbir peygamberin ruhu, cennetteki durağını görmedikçe kabzolunmaz. Sonra (ölümle hayât arasında) muhayyer kılınır\" buyurur dururdu. ruhu kabzolunmak zamanı gelince, başı benim dizimin üstünde bulunduğu bir sırada kendisine bir süre baygınlık geldi. Sonra ayıhnca gözünü tavana doğru dikti. Sonra: \"Yâ Allah, en yüksek refiki isterim\" diye duâ etti. Bunun üzerine ben: \"Artık Rasûlüllah şimdi bizleri ihtiyar etmiyor\" dedim. Ve bildim ki, Rasûlüllah’ın bu duası sıhhatli zamanında bize söyleyegeldiği haber (in kendisinde tecellîsi)dir. Peygamber’in tekellüm ettiği en son kelime, işte bu \"Allâ-humme er-Refîkal-Alâ\" duası oldu, demiştir",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 6511,
			"arabicnumber": 6511,
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 6512,
			"arabicnumber": 6512,
			"text": "Ebû Katâde Rıb'î el-Ensârî (radıyallahü anh) şöyle tahdîs ederdi: Rasûlüllah (sallallahü aleyhi ve sellem)'in yânından bir cenaze geçirilmişti. Bunun üzerine Rasûlüllah: \"Kendisi rahatlayan veya kendisinden kurtulunmuş olandır\" buyurdu. Yâ Rasûlallah! Rahatlayan veya kendisinden rahatlanan nedir? diye sordular. \"Mü'min olan kul, dünyânın yorgunluklarından ve ezalarından Azîz ve Celîl olan Allah'ın rahmetine gidip istirahat eder. Fâcir olan kula gelince ondan da diğer kullar, şehirler, ağaçlar ve hayvanlar kurtulup istirahat ederler\" buyurdu",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 6513,
			"arabicnumber": 6513,
			"text": "Muhammed ibn Amr ibn Halhala şöyle demiştir: Bana Ma'bed ibn Ka'b, Ebû Katâde'den tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem):\" (Ölmekle) istirahat eden ve kendisinden istirahat edilendir. Mü'min dünyâ yorgunluğundan istirahat eder\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 6514,
			"arabicnumber": 6514,
			"text": "Enes ibn Mâlik (radıyallahü anh) şöyle diyordu: Rasûlüllah(sallallahü aleyhi ve sellem) şöyle buyurdu: \"Ölüyü üç şey ta'kîb edip kabre kadar gider de ikisi tekrar geri döner, biri orada onunla beraber kalır: Ölüyü ailesi, malı ve ameli ta'kîb eder. Neticede ailesi ve malı geriye döner de, kendisiyle beraber sâdece ameli kalır",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 6515,
			"arabicnumber": 6515,
			"text": "Abdullah ibn Omer (radıyallahü anh) şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem) şöyle buyurdu: \"Sizden biriniz vefat ettiği zaman, sabah akşam ona oturacağı yer arz olunup gösterilir. Ateşten olan ve cennetten olan oturağı gösterilir de ona tâ diriltileceği vakte kadar: İşte burası senin durağındır! denilir",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 6516,
			"arabicnumber": 6516,
			"text": "Âişe (r. anha):Peygamber(sallallahü aleyhi ve sellem):\"Sizler ölülere sövmeyiniz. Çünkü onlar önden göndermiş oldukları amellerin karşılıklarına ulaşmışlardır\" buyurdu, demiştir",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 6517,
			"arabicnumber": 6517,
			"text": "Ebû Hureyre (radıyallahü anh) şöyle demiştir: Biri müslümânlardan, biri de Yahûdîler'den olan iki adam birbirleriyle sövüştüler. Müslüman, Yahudi'ye: Muhammed'i âlemler üzerine seçip tercih eden Allah'a yemîn ederim ki! dedi. de müslümâna hitaben: Musa'yı âlemler üzerine seçip tercih eden Allah'a yemîn ederim ki! dedi. Hureyre dedi ki: Yahûdî bu yemini yaptığı sırada müslümân öfkelendi de Yahudi'nin yüzüne bir tokat vurdu. Bunun üzerine Yahûdî, RasûIullah (sallallahü aleyhi ve sellem)'ın yanına gitti de, kendisinin ve müslümân kişinin işinden olup biten şeyleriRasûlüllah'a haber verdi. Bunun üzerine Rasûlüllah: \"BeniMûsâ üzerine daha hayırlı kılmayınız! Çünkü insanlar kıyâmet gününde hep çarpılıp bayılacaklardır. (Onlarla beraber ben de çarpılıp bayılırım.) Fakat ben ilk ayılan kimseler içinde olurum. O anda Musa'yı Arş'ın bir tarafına sıkıca tutunmuş hâlde görürüm. Bilmiyorum, Mûsâ da bayılanların içinde idi de benden evvel mi ayıldı yahut bayılmaktan Allah'ın müstesna kıldığı kimselerden mi idi?",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 6518,
			"arabicnumber": 6518,
			"text": "Ebû Hureyre (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) şöyle buyurdu: \"Bayılıp düşecekleri zaman insanlar hep bayılıp düşerler. Kalkışta ben, ayağa kalkanların ilki olurum. Bir de görürüm ki, Mûsâ Arş'a sıkıca tutunmuş durmaktadır. Artık ben Mûsâ da bayılanların içinde miydi (yahut değil miydi) bilemiyorum.\" hadîsin aslını Ebû Saîd de Peygamber'den rivayet etmiştir",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 6519,
			"arabicnumber": 6519,
			"text": "ez-Zuhrî şöyle demiştir: Bana Saîd ibnu'l-Müseyyeb, Ebû Hureyre (radıyallahü anh)'den tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem):\"Allah (kıyâmet günü) bütün yer tabakalarını kabzasına alır, gökleri de sağ eli içine dürer büker. Sonra (mahşer halkına): İşte ben kâinatın Melik'iyim! Yeryüzünün melikleri nerede? diye hitâb eder\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 6520,
			"arabicnumber": 6520,
			"text": "Ebû Saîdel-Hudri (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) şöyle buyurdu: \"Kıyâmet gününde bütün Arz, tandırda pişirilen bir tek ekmek (gibi) olur. Cebbar olan Allah, onu kudret eliyle evirir çevirir (düzelinceye kadar) altüst eder. Sizin biriniz yolculukta bazlamasını (tandıra koyup pişirinceye kadar) evirip çevirdiği gibi. (Bu muazzam ekmek, uzun müddet mahşerde bekleyen) cennet ehli için yolcu konuk azığı olarak hazırlanır.\" Saîd dedi ki: Bu sırada bir Yahûdî geldi de: Yâ Ebâ'l-Kaasım! Rahman Sana mübarek kılsın! Cennet ehlinin kıyâmet günü yol azığının ne olduğunu Sana haber vereyim mi? dedi. \"Evet\" buyurdu. Yahûdî: Rasûlüllah'ın söylediği gibi, Arz bir tek ekmek yapılır! dedi. Bunun üzerine Rasûlüllah bize baktı. Sonra (taaccüb edip hoşlanarak) son dişleri meydana çıkıncaya kadar güldü. Sonra Yahûdî: Sana cennet ehlinin ekmeklerinin katığını da haber vereyim mi? dedi\" ve şöyle devam etti: Cennet ehlinin katıkları Bâlâm ve Nûn'dur, dedi. Bunlar nedir? diye sordular. Yahûdî: Öküzle balıktır! Bu iki hayvanın ciğerlerinin en nefis uç parçalarını cennet ehlinden yetmiş bin kişi yiyecektir, diye cevâb verdi",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 6521,
			"arabicnumber": 6521,
			"text": "Sehl ibn Sa'd (radıyallahü anh) şöyle demiştir: Ben Peygamber (sallallahü aleyhi ve sellem)'den işittim, şöyle buyuruyordu: \"Kıyâmet günü insanlar, beyaz, duru beyaz ve kepekten arınmış undan yapılan çörek gibi bir saha üzerinde toplanırlar.\" ibn Sa'd'ın yahut başka birisinin rivayetinde: \"O sahada bir kimseye delâlet edecek, yol gösterecek (dağ taş gibi) hiçbir alâmet yoktur\" demiştir",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 6522,
			"arabicnumber": 6522,
			"text": "Bize Vuheyb, Abdullah ibn Tâvûs'tan; o da babası Tâvûs ibn Keysân el-Yemânî'den; o da Ebû Hureyre (radıyallahü anh)'den tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem) şöyle buyurmuştur: (mahşerde) üç fırka olarak toplanırlar. Birinci fırka gelecek hayâtı özleyen, (geride kalan dünyâ hayâtından) nefret eden zümredir. (Bunlar azık ve binekleri bol olanlardır). İkinci fırka ikisi bir deve, üçü bir deve, dördü bir deve, onu bir deve üzerinde sevkolunurlar. Bunların bakıyyesini (ki üçüncü fırkadır) bir ateş hasredip toplar. Onlar nerede istirahat ederlerse o ateş de beraberlerinde istirahat eder, onların geceledikleri yerde onlarla beraber geceler, onların sabahladıkları yerde beraberlerinde sabahlar. Ve onlarla beraber yürüyüp onların akşamladıkları yerde onlarla beraber akşamlar",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 6523,
			"arabicnumber": 6523,
			"text": "BizeEnes ibn Mâlik (radıyallahü anh) şöyle tahdîs etti: Bir adam: Ey Allah'ın Peygamberi! Kâfir kıyâmet günü yüzü üzerinde nasıl haşr olunur? diye sordu. aleyhi ve sellem): \"Dünyâda onu iki ayağı üzerinde yürüten Allah, kıyâmet gününde yüzü üzerinde yürütmeye kudretli değil midir?\" diye cevâb verdi. Katâde: Evet, Rabb'imizin izzetine yemîn ederim ki, kudretlidir! demiştir",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 6524,
			"arabicnumber": 6524,
			"text": "Bize Sufyân ibn Uyeyne tahdîs etti. Amr ibn Dînâr şöyle demiştir: Ben Saîd ibn Cubeyr'den işittim. Ben İbn Abbâs radıyallahü anhüma'tan işittim. Ben Peygamber(sallallahü aleyhi ve sellem)'den işittim: \"Muhakkak ki, sizler Allah 'a yalınayaklılar, çıplaklar, yayalar ve sünnetsizler olarak kavuşacaksınız\" buyuruyordu, demiştir. ibn Uyeyne: Bu hadîs, bizim İbn Abbâs'ın Peygamber(sallallahü aleyhi ve sellem)'den işittiğini saymakta olduğumuz hadîslerdendir, demiştir",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 6525,
			"arabicnumber": 6525,
			"text": "Bize Sufyân ibn Uyeyne, Amr'dan; o da Saîd ibn Cubeyr'den tahdîs etti ki, İbn Abbâs radıyallahü anhüma şöyle demiştir: Ben Rasûlüllah (sallallahü aleyhi ve sellem)'tan işittim, O, minber üzerinde hutbe yapıyor: \"Muhakkak ki, sizler Allah'a yalınayaklılar, çıplaklar, sünnetsizler olarak kavuşacaksınız\" buyuruyordu",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 6526,
			"arabicnumber": 6526,
			"text": "Bize Şu'be, el-Mugîre ibnu'n-Nu'mân'dan; o da Saîd ibn Cubeyr'den tahdîs etti ki, İbn Abbâs radıyallahü anhüma şöyle demiştir. Peygamber(sallallahü aleyhi ve sellem) bizim aramızda ayağa kalktı da hutbe yaparak şöyle buyurdu: \"Muhakkak sizler yahnayaklılar, çıplaklar olarak toplanacaksınız. ' yaradışa nasıl başladıksa, üzerimizde hakk bir va'd olarak yine onu iade edeceğiz. Hakikatte failler biziz!'(el-Enbiyâ: 104) içinde kıyâmet gününde ilk olarak elbise giydirilecek kimse İbrahim'dir. Şu da muhakkak ki ümmetimden birtakım adamlar getirilecek de onlar yakalanıp sol tarafa (cehennem tarafına) götürülecekler. Hemen ben: Yâ Rabb! Onlar benim sahâbîlerimdir! derim. Allah bana: Sen onların senden sonra dînde ne bid'atler meydana getirdiklerini bilmezsin! der. de Allah'ın sâlih kulunun (Meryem oğlu İsâ'nın) dediği gibi (şöyle) derim: 'Ben içlerinde bulunduğum müddetçe üzerlerinde bir murâkıb idim. Fakat vaktâ ki Sen beni (içlerinden) aldın, üstlerinde murakıb ancak Sen kaldın. Ve zâten Sen herşeye hakkıyle şâhidsin. Eğer kendilerine azâb edersen, şübhe yok ki, onlar Sen’in kullarındır. Eğer onları mağfiret edersen, yine şübhesiz ki, mutlak gâlib ve yegâne hüküm ve hikmet sahibi olan da Sen'sin!'(el-Mâide: 117-118).\" ki: \"Bunun üzerine bana: Bunlar ökçelerine basarak geri dönmüş mürtedler olmakta devam etmişlerdir, denilir",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 6527,
			"arabicnumber": 6527,
			"text": "Abdullah ibn Ebî Muleyke şöyle demiştir: Bana el- Kaasım ibn Muhammed ibn Ebî Bekr tahdîs etti ki, Âişe (r.anha) şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem):\"Sizler yahnay aklılar, çıplaklar, sünnetsizler olarak toplanacaksınız\" buyurdu. dedi ki: Ben de: Yâ Rasûlallah! Erkekler ve kadınlar birbirlerine (avret yerlerine) bakarlar?! dedim. \"Haşr işi, onların bunu düşünmelerinden bile çok şiddetli ve çetindir\" buyurdu",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 6528,
			"arabicnumber": 6528,
			"text": "Abdullah ibn Mes'ûd (radıyallahü anh) şöyle demiştir: Biz (kırk kişi kadar bir topluluk) bir kubbenin içinde Peygamber(sallallahü aleyhi ve sellem)'in beraberinde bulunuyorduk. Peygamber (sallallahü aleyhi ve sellem): \"Sizler cennet ehlinin dörtte biri olmanıza razı olur musunuz?\" buyurdu. Evet! dedik. Peygamber: \"Cennet ehlinin üçte biri olmanıza razı olur musunuz?\" diye sordu. tekrar: Evet! diye cevâb verdik. Peygamber: \"Cennet ehlinin yarısı olmanıza razı olur musunuz?\" buyurdu. yine: Evet! dîye cevâb verdik. Peygamber: \"Muhammed'in nefsi elinde bulunan Allah'a yemîn ederim ki, ben sizin cennet ehlinin yarısı olmanızı kuvvetle ümîd ediyorum. Şu da muhakkak ki, cennete müslümân nefisten başkası girmeyecektir. Sizler şirk ehline nisbetle siyah öküzün derisi üzerindeki beyaz kıl mesabesinden başka değilsiniz. Yâhud da sanki kırmızı öküzün derisi üzerindeki siyah kıl mesabesinde!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 6529,
			"arabicnumber": 6529,
			"text": "Bana kardeşim Abdulhamîd, Süleyman ibn Bilâl'den; o da Sevr'den; o da Ebû'l-Gays'tan; o da Ebû Hureyre (radıyallahü anh)'den tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem) şöyle buyurmuştur: günü ilk çağrılacak kimse Âdem Peygamber'dir. Zürriyeti ona arz olunup görürler. Onlara: Bu, babanız Âdem 'dir! denilir. Âdem: Lebbeyke ve sa'deyke (yâ Rabb) der. Allah ona: Zürriyetinden cehennem kaafilesini çıkar (gönder) buyurur. Yâ Rabb! Ne kadar çıkarayım? der. Her yüz kişiden doksandokuzu çıkar! buyurur\". Yâ Rasûlallah! Bizlerin herbir yüz kişisinden doksandokuz kişi alındığı zaman, bizden ne kadarı geri kalacak? dediler. \"Benim ümmetim, diğer ümmetler içinde siyah öküzdeki beyaz kıl gibidir!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 6530,
			"arabicnumber": 6530,
			"text": "Ebû Saîd (radıyallahü anh) şöyle dedi: Rasûlüllah(sallallahü aleyhi ve sellem) şöyle buyurdu: \"Allahü Taalâ: Yâ Âdem! buyurur. Adem hemen cevâb olarak: Yâ Rabb, mükerreren icabet eder, her emrini yerine getirmeye dâima kıyam eylerim. Ve her hayır Sen'in iki elinde(emir ve nehyinde)dir, der. Taâlâ: Ateşe girecekleri (halk arasından) çıkarıp gönder! der. Yâ Rabb, ateşe gönderileceklerin mikdârı ne kadardır? Diye sorar. Taâlâ: Her bin kişiden dokuzyüz doksandokuzu! diye cevâb verir. Âdem'e böyle buyurduğu sıra,(bunun verdiği şiddetli korkudan) çocuğun ihtiyarlayacağı 'Ve her gebe kadının çocuğunu düşüreceği zamandır. Ve onda mahşer halkını sarhoşlar hâlinde görürsün. Halbuki onlar hiç de sarhoş değillerdir. Fakat Allah'ın azâbı çok Şiddetlidir' (el-Hacc: 2)\". bu haber ağır geldi de: Yâ Rasûlallah! Bu (binde bir) kişi hangimizdir? diye sordular. üzerine Rasûlüllah: \"Size müjdeler olsun! Muhakkak ki, sizden bir kişiye mukaabil Ye'cûc ve Me'cûc'den bin kişi (cehenneme gönderilecektir)” buyurdu. da: \"Nefsim elinde bulunan Allah'ayemîn ederim: Ben sizlerin cennet ehlinin üçte biri olmanızı kuvvetle tama' etmekteyim\" buyurdu. dedi ki: Bunun üzerine bizler Allah'a hamdettik ve tekbîr getirdik. Sonra Rasûllulah: \"Nefsim elinde olan Allah'a yemîn ederim ki, ben sizlerin cennet ehlinin üçte biri olmanızı kuvvetle tama' etmekteyim\" buyurdu. dedi ki: Bunun üzerine biz yine Allah'a hamdettik ve tekbîr getirdik. Bundan sonra Rasûlüllah: \"Nefsim elinde bulunan Allah'a yemin ederim ki, ben sizlerin cennet ehlinin yarısı olmanızı kuvvetle tama' etmekteyim. Çünkü ümmetlere nisbetle sizin meseliniz, siyah öküzün derisi üzerindeki beyaz kıl gibidir. Yâhud da eşeğin ön ayaklarının iç taraflarında bulunan dâire şeklindeki mühre gibidir\" buyurdu",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 6531,
			"arabicnumber": 6531,
			"text": "Bize İbnu Avn, Nâfi'den; o da İbn Omer(radıyallahü anh) 'den tahdîs etti ki, Peygamber (sallallahü aleyhi ve sellem):\"İnsanlar Âlemlerin Rabbi için ayağa kalkacakları gün, onlardan herbiri kulaklarının yarılarına kadar kendi terleri içinde ayağa kalkacaklar\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 6532,
			"arabicnumber": 6532,
			"text": "Bize Süleyman ibn Hilâl, Sevr'den; o da İbn Zeyd'den; o da Ebû'l-Gays'tan; o da Ebû Hureyre (radıyallahü anh)'den tahdîs etti ki, Rasûlüllah(sallallahü aleyhi ve sellem) şöyle buyurmuştur: \"Kıyâmet günü insanlar mahşer yerinde (sıkışmaktan, şiddetten, güneşin yaklaşmasından) terleyecektir. Öyle bir derecede ki, dökülen ter yetmiş zira' derinliğinde yere geçecek ve onların ağızlarına yükselip gemliyecek, hattâ kulaklarına ulaşacaktır",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 6533,
			"arabicnumber": 6533,
			"text": "Abdullah ibn Omer (radıyallahü anh):Peygamber(sallallahü aleyhi ve sellem):\"Kıyâmet günü insanlar arasında verilen ilk hüküm, kan da'vâları hakkındadır\" buyurdu, demiştir",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 6534,
			"arabicnumber": 6534,
			"text": "Bana Saîd el-Makburî, Ebû Hureyre(radıyallahü anh)'den tahdîs etti ki, Rasûlüllah(sallallahü aleyhi ve sellem) şöyle buyurmuştur: \"Kimin yanında kardeşine âid haksız alınmış bir hakk varsa, o haksızlıktan dolayı hakk sahibiyle halâllaşsın. Muhakkak olan şu ki, kıyâmette hiçbir dînâr ve hiçbir gümüş yoktur. Kardeşinin hakkı için kendi hasenelerinden alınmadan evvel, dünyâda onunla halâllaşsın. Âhirette zâlimin o hakkı karşılayacak haseneîeri bulunmazsa, kardeşinin seyyielerinden alınır da o zâlimin üzerine atılır",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 6535,
			"arabicnumber": 6535,
			"text": "Bize Yezîd ibn Zuray' tahdîs edip şu''Biz onların göğüslerindeki kîni söküp atacağız..\" (el-A'râf 43; el-Hıcr: 47) âyetini okudu ve şöyle dedi: Bize Saîd ibn Ebî Arûbe, Katâde'den; o da Ebu'l-Mutevekkil en-Nâcî!den tahdîs etti ki, Ebû Saîd el-Hudrî (radıyallahü anh) şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem) şöyle buyurdu: \"Kıyâmet günü mü'minler (sırattan geçerek) ateşten kurtulurlar da cennetle ateş arasındaki bir köprü üzerinde durdurulurlar. Orada, dünyâda iken aralarında meydana gelmiş haksızlıklar birbirlerinden kısas yapılır. Nihayet haksızlıklardan temizlendikleri ve pampâk oldukları zaman onlara cennete girmelerine izin verilir. Muhammed'in nefsi elinde bulunan Allah 'a yemin ederim ki, o mü'minlerden herbiri cennetteki menziline, dünyâdaki meskeninden daha doğru yol bulur",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 6536,
			"arabicnumber": 6536,
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 6537,
			"arabicnumber": 6537,
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 6538,
			"arabicnumber": 6538,
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 6539,
			"arabicnumber": 6539,
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 6540,
			"arabicnumber": 6540,
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 6541,
			"arabicnumber": 6541,
			"text": "Husayn ibn Abdirrahmân şöyle dedi: Ben Saîd ibn Cubeyr'in yanında idim, şöyle dedi: Bana İbn Abbâs radıyallahü anhüma tahdîs edip şöyle dedi: Peygamber(sallallahü aleyhi ve sellem) şöyle buyurdu: \"Bütün ümmetler bana arz olunup gösterildi. Bir peygamber, yanına bir ümmet alıp geçiyordu. Bir peygamber, beraberinde bir toplulukla geçiyordu. Bir peygamber, beraberinde on kişiyle geçiyordu. Bir peygamber, beraberinde beş kişiyle geçiyordu. Bir peygamber de yalnız başına geçiyordu. Ben uzakta büyük bir karaltı gördüm de: Yâ Cibril! Bunlar benim ümmetim mi? diye sordum. O: Hayır değildir, lâkin şu ufka bak! dedi. oraya bakınca çok büyük bir karaltı gördüm. İşte bunlar senin ümmetindir. Bunların yetmiş bin olan öncüleri, üzerlerinde hiçbir hesâb ve azâb yoktur, dedi. Niçin bunlara hesâb ve azâb yoktur? dedim. Cibril: Onlar ateşle dağlama tedavisi yapmazlar, rukye yapmazlar, eşya ve kuşlarla uğursuzluk inancına gitmezler, onlar ancak Rabb'lerine dayanıp güvenirlerdi, dedi\". bunu söyleyince Ukkâşe ibn Mıhsan kendisine doğru ayağa kalktı da: (Yâ Rasûlallah!) Beni onlardan kılması için Allah'a duâ ediver! dedi. \"Yâ Allah! Bunu onlardan kıl!\" diye duâ etti. Sonra O'na diğer bir adam kalktı da o da: Beni de onlardan kılması için Allah'a duâ ediver! dedi. \"Bu hususta Ukkâşe senden öne geçti\" buyurdu",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 6542,
			"arabicnumber": 6542,
			"text": "ez-Zuhrî şöyle demiştir: Bana Saîd ibnu'l-Müseyyeb tahdîs etti; ona da Ebû Hureyre (radıyallahü anh) tahdîs edip şöyle demiştir: Ben Rasûlüllah(sallallahü aleyhi ve sellem)'tan işittim, şöyle buyuruyordu: \"Ümmetimden bir zümre (cennete) girer ki, onlar yetmişbindir. Onların yüzleri ayın ondördüncü gecesindeki parlaması gibi parlar\". Hureyre dedi ki: Bunun üzerine Ukkâşe ibnu Mıhsân el-Esedî, üstünde bulunan kaplan postu gibi siyah beyaz çizgili elbiseyi kaldırarak ayağa kalktı ve: Yâ Rasûlallah! Beni onlardan kılması için Allah'a duâ ediver! dedi. \"Yâ Allah, bunu onlardan kıl!\" diye duâ etti. Sonra Ensâr'dan bir adam ayağa kalktı ve: Yâ Rasûlallah! Beni de onlardan kılması için Allah'a duâ ediver! dedi. \"Bunda Ukkâşe senin önüne geçti!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 6543,
			"arabicnumber": 6543,
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 6544,
			"arabicnumber": 6544,
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 6545,
			"arabicnumber": 6545,
			"text": "Ebû Hureyre (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) şöyle buyurdu: \"Cennet ehline hitaben: Ey cennet ehli, artık ebedîlik vardır, ölüm yoktur! Ateş ehline hitaben de: Ey ateş ehli, artık ebedîlik vardır, ölüm yoktur! denilir",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 6546,
			"arabicnumber": 6546,
			"text": "Bize Avf, Ebû Recâ'dan; o da İmrân'dan tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem):\"Cennete çıktım da ahâlîsinin çoğunun fakirler olduğunu gördüm; cehenneme çıktım, onun ahâlîsinin çoğunu da kadınlar olarak gördüm\" buyurdu",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 6547,
			"arabicnumber": 6547,
			"text": "Bize Süleyman et-Teymî, Ebû Usmân'dan; o da Usâme'den haber verdi ki, Peygamber(sallallahü aleyhi ve sellem) şöyle buyurmuşun \"Ben cennetin kapısı önünde durdum, oraya girenlerin çoğu fakirler idi. Zenginlik sahibleri(fakirlerle beraber cennete girmekten) alıkonulmuşlardı. Lâkin ateş ehli, ateşe girmeye emrolunmuşlardı. Ben cehennemin kapısı önünde de durdum. Oraya girenlerin çoğunun kadınlar olduğunu gördüm",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 6548,
			"arabicnumber": 6548,
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 6549,
			"arabicnumber": 6549,
			"text": "Ebû Saîd el-Hudrî (radıyallahü anh) şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem) şöyle haber verdi: ve Yüce Allah cennet ehline: Ey cennet ehli! diye hitâb eder. Onlar da: Ey Rabb'imiz, buyur, emrini yapmaya hazırız, ubûdiyyette dâimiz! derler. Allah: Bu hâlinizden râzı mısınız? buyurur. Onlar da: Rabb'imiz, nasıl razı olmayalım? Sen bize, halkından hiçbir kimseye vermediğin bunca ni'metleri ihsan eyledin! derler. Ben size bunlardan daha şerefli bir ni'met vereceğim! buyurur. Yâ Rabb! Bunlardan daha üstün hangi ni'met var ki? derler. Sizden râzı ve hoşnûd olmaklığımın şerefi size lâyık kılındı. Artık bundan sonra ebedî olarak size darılmayacağım! buyurur",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 6550,
			"arabicnumber": 6550,
			"text": "Humeyd et-Tavîl, şöyle dedi: Ben Enes ibn Mâlik (radıyallahü anh)'ten işittim, şöyle diyordu: Harise ibn Surâka Bedir harbinde vurulup şehîd oldu. O genç bir oğlandı. Annesi er-Rubeyy' bintu'n-Nadr, Peygamber(sallallahü aleyhi ve sellem)'e geldi de: Yâ Rasûlallah! Hârise'nin benim yanımdaki menzilesini bilmektesindir. Eğer o cennette ise, onun acısına sabrederim ve sabrımın sevabını Allah'tan umarım. Eğer (cennette değil de) diğer bir yerde ise, yapacağım ağlamayı görürsün (yahut ne yapmamı re'y edersin)? dedi. \"Yazık sana! Sen aklını mı kaçırdın? Cennet bir tane midir? Cennet, şübhesiz birçok cennetlerdir. Şu muhakkak ki, senin oğlun elbette Firdevs Cenneti'ndedir!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 6551,
			"arabicnumber": 6551,
			"text": "Bize el-Fudayl, Ebû Hâzım'dan; o da Ebû Hureyre (radıyallahü anh)'den haber verdi ki, Peygamber(sallallahü aleyhi ve sellem): \" (Kıyâmet gününde) kâfirin iki omuzu arası, sür'atli birsüvârî yürüyüşü ile üç günlük mesafedir\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 6552,
			"arabicnumber": 6552,
			"text": "el-Buhârî dedi ki: Ve İshâk ibn İbrâhîm şöyle dedi: Bize el-Mugîre ibnu Seleme haber verdi. Bize Vuheyb, Ebû Hâzım'dan; o da Sehl ibn Sa'd (radıyallahü anh)'dan tahdîs etti ki, Rasûlüllah(sallallahü aleyhi ve sellem):\"Cennette bir ağaç vardır ki, bir süvârî, onun gölgesinde yüz sene yürür de, onun gölgesini geçip bitiremez\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 6553,
			"arabicnumber": 6553,
			"text": "Ebû Hazım şöyle dedi: Ben bu hadîsi en-Nu'mân ibn Ebî Ayyâş'a tahdîs ettim de o şöyle dedi: Bana Ebû Saîd tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem):\"Cennetin içinde şübhesiz öyle bir ağaç vardır ki, iyi cins, ta'lîmli ve çok sür'atli bir atın binicisi yüz yıl onun gölgesinde yürür de yine onun gölgesini kesip bitiremez\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 6554,
			"arabicnumber": 6554,
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 6555,
			"arabicnumber": 6555,
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 6556,
			"arabicnumber": 6556,
			"text": "Bize Abdulazîz, babası Ebû Hazım Seleme ibn Dînâr'dan; o da Sehl (radıyallahü anh)'den tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem) şöyle buyurmuştur: \"Cennet ehli cennette kendilerinden yükseklerdeki köşkleri (mesafe uzaklığından dolayı) güçlükle görebilirler. Sizin gökyüzündeki yıldızı güçlükle görür olduğunuz gibi!\" şöyle dedi:) Babam Ebû Hazım şöyle dedi: Ben bu hadîsi en-Nu'mân ibn Ebî Ayyâş'a tahdîs ettim, o: Ben şehâdet ediyorum ki, Ebû Saîd'den işittim, o bu hadîsi tahdîs ediyor ve bunda şu ziyâdeyi getiriyordu: \"Nasıl ki gündüz doğu ve batı ufkundaki ışıklı kalan parlak yıldızı -aradaki mesafe uzunluğundan dolayı- zorlukla görebilirsiniz",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 6557,
			"arabicnumber": 6557,
			"text": "Bize Şu'be tahdîs etti ki, Ebû İmrân şöyle demiştir: Enes ibn Mâlik (radıyallahü anh)'den işittim, Peygamber(sallallahü aleyhi ve sellem) şöyle demiştir: \"Yüce Allah kıyâmet gününde ateş ehlinin en hafif azâblısına hitaben: Eğer senin Arz'daki herşeyden malın olsa, bu azaba karşılık fidye verir miydin? buyurur. kul: Evet, fidye verirdim, der. Yüce Allah: Sen Âdem'in sulbünde iken ben senden bundan daha kolay olanını istemiştim: Bana hiçbirşeyi ortak kılmamanı istemiştim. Fakat sen bana ortak kılmana devam edip durdun! buyurur",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 6558,
			"arabicnumber": 6558,
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 6559,
			"arabicnumber": 6559,
			"text": "Bize Enes ibn Mâlik (radıyallahü anh) şöyle tahdîs etti: Peygamber(sallallahü aleyhi ve sellem):\"Bir kavim, kendilerine cehennem ateşi dokunduktan sonra sıîmaları kırmızımsı siyah bir renkte olarak cehennemden çıkacak ve cennete girecekler de cennet ehli bunlara 'Cehennemlikler\" diye isim vereceklerdir\" buyurdu",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 6560,
			"arabicnumber": 6560,
			"text": "Bize Amr ibnu Yahya, babası Yahya ibn Umâre'den; o da Ebû Saîd eI-Hudrî (radıyallahü anh)'den tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem) şöyle buyurmuştur: \"Cennet ehli cennete, dûzah ehli dûzaha girdikten sonra Yüce Allah: Kimin kalbinde bir hardal tanesi ağırlığınca îmân varsa, ateşten çıkarınız! diye ferman buyuracaktır. üzerine (bu gibiler) simsiyah yanmış ve kömüre dönmüş oldukları hâlde çıkacaklar da hemen hayât nehrinin içine atılacaklar ve orada seyl uğrağında -yahut seylin kokmuş kara çamuru içinde- kalan yabanı reyhan tohumları nasıl sür'atle biterse öylece bitecekledir\". Peygamber(sallallahü aleyhi ve sellem):\"Görmez misiniz, bu tohumlar(ne güzel) sapsarı olarak ve iki tarafına salınarak çıkıp sürerler!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 6561,
			"arabicnumber": 6561,
			"text": "Bize Şu'be tahdîs edip şöyle dedi: Ben Ebû İshâk'tan işittim, şöyle dedi: Ben en-Nu'mân ibn Beşîr (radıyallahü anh)'den işittim, şöyle dedi: BenPeygamber(sallallahü aleyhi ve sellem)'den işittim, şöyle buyuruyordu: \"Kıyâmet gününde cehennem ehlinin azâbca en hafif ceza göreni o kimsedir ki, onun iki ayağı altının çukurlarına iki ateş parçası konulacak, bunların te'sîriyle onun beyni (tencere gibi) kaynayacaktır",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 6562,
			"arabicnumber": 6562,
			"text": "En-Nu'mân ibn Beşîr (radıyallahü anh) şöyle demiştir: Ben Peygamber(sallallahü aleyhi ve sellem)'den işittim, şöyle buyuruyordu: \"Şübhesiz kıyâmet gününde ateş ehlinin en hafif azâblısı şöyle bir adamdır ki, onun iki ayağı altının çukurlarında iki ateş parçası vardır da, bunların sıcaklığından onun beyni bakır tencere ve dar boğazlı olup içinde su ısıtılan kumkuma adındaki ma'denı kabın kaynaması gibi kaynayacaktır",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 6563,
			"arabicnumber": 6563,
			"text": "Bize Şu'be, Amr ibn Murre'den; o da Hayseme'den; o da Adiyy ibn Hâtim(radıyallahü anh)'den şöyle tahdîs etti: Peygamber(sallallahü aleyhi ve sellem) ateşi zikredip yüzünü geri çekti ve bakındı da, ondan taavvuz edip Allah'a sığındı. Sonra yine ateşi zikretti, yüzünü geri çekip sakındı, yine ateşten taavvuz edip Allah'a sığındı. Sonra: \"Sizler tek hurmanın yarısıyle, bunu da bulamayan güzel bir sözle olsun ateşten korununuz\" buyurdu",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 6564,
			"arabicnumber": 6564,
			"text": "Bize Abdulazîz ibnu Ebî Hazım ile ed-Derâverdî, Yezîd ibn Abdillah'tan; o da Abdullah ibnu Habbâb'dan; o da Ebû Saîd el-Hudrî (radıyallahü anh)'den tahdîs etti ki, o, Rasûlüllah (sallallahü aleyhi ve sellem)'tan işitmiştir: Rasûlüllah, yanında amcası Ebû Tâlib anıldı da: \"Umarım ki, benim şefâatim kıyâmet gününde amcama fayda verir. Şefaatimle amcam, topuklarına ulaşabilen ateşten bir çukura konulur da o çukurdan dimağının aslı kaynar\" buyurdu",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 6565,
			"arabicnumber": 6565,
			"text": "Enes ibn Mâlik (radıyallahü anh) şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem) şöyle buyurdu: \"Allah kıyâmet gününde insanları toplar. Onlar: İçinde bulunduğumuz şu sıkıntılı durumdan bizleri kurtarması için Rabb'imize karşı şefaat istesek! derler. Âdem (sallallahü aleyhi ve sellem)'e gelirler ve: Sen, Allah'ın kendi eliyle yarattığı, sana kendi ruhundan hayât verdiği, meleklere emredip de meleklerin senin için secde ettikleri kimsesin. Sen bizim için Rabb'in huzurunda şefaat et! derler. de: Ben buna ehil değilim, der ve o işlemiş olduğu hatîesini zikreder. Siz, Allah'ın gönderdiği ilk resul olan Nuh'a gidin, der. onlar Nuh'a gelirler. Nûh; işlemiş olduğu hatîesini anar da: Ben buna ehil değilim. Siz, Allah'ın kendisini bir haltl edindiği İbrâhîm (sallallahü aleyhi ve sellem)'e gidin, der. onlar İbrahim 'e gelirler. İbrâhîm de, işlediği hatîesini anarak: Ben buna ehil değilim. Siz Îsa'ya gidin, der. Akabinde Îsa'ya gelirler: O da: Ben buna ehil değilim, siz Muhammed (sallallahü aleyhi ve sellem)'e gidin. Allah O'nun geçmiş ve geri kalmış bütün günâhlarını mağfiret buyurmuştur! der. üzerine insanlar bana gelirler. Ben Rabb'imin huzuruna izin isterim. O'nu görünce hemen secdeye kapanırım. Allah dilediği kadar beni bu vaziyette bırakır. Sonra Allah tarafından bana: Başını kaldır! iste, sana verilir; söyle, sözün dinlenir; şefaat et, şefaatin kabul olunur! buyurulur. secdeden başımı kaldırır ve Rabb'imin bana öğreteceği bir tahmîd ile Rabb'ime hamd ederim. Sonra şefaat ederim. Benim için bir sınır ta'yîn buyurur. Sonra ben insanları ateşten çıkarır ve cennete girdiririm. Sonra döner yine evvelki gibi secdeye kapanırım. Böylece nihayet üçüncü yahut dördüncü defada: Yâ Rabb! Ateş içinde Kur'ân 'ın habsettiklerinden başka (yani ebedîlik vâcib olanlardan başka) kimse kalmıyor! derim\". Bu \"Kur'ân’ın habsettikleri\" sözünün yanında, yânı üzerine \"Hulûd\" (yânı ebedîlik) vâcib olanlar sözünü söylerdi",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 6566,
			"arabicnumber": 6566,
			"text": "Bize İmrân ibnu Husayn (radıyallahü anh) tahdîs etti ki,Peygamber(sallallahü aleyhi ve sellem):\"Muhammed'in şefaati ile bir kavim ateşten çıkar da cennete girerler. Onlar 'Cehennemlikler' diye isimlendirilirler\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 6568,
			"arabicnumber": 6568,
			"text": "Ve yine Rasûlüllah şöyle buyurdu: \"Sabahleyin veya akşamleyin herhangibir zamanda Allah yolunda bir yürüyüş hiç şübhesiz dünyâdan ve dünyâdaki şeylerin hepsinden hayırlıdır. Ve elbette cennette herhangibirinizin yayının arası kadar veya ayağının yeri kadar olan bir kısım dünyâdan ve dünyâdaki herşeyden hayırlıdır. Şayet cennet ehli kadınlardan bir kadın Arz'a çıkmış olaydı, muhakkak yer ile gök arasını aydınlatır ve ikisi arasını güzel bir koku doldururdu. Ve elbet o kadının nasîfi, yânı baş örtüsü dünyâdan ve dünyâdaki herşeyden hayırlıdır",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 6569,
			"arabicnumber": 6569,
			"text": "Ebû Hureyre (radıyallahü anh) dedi ki: Peygamber(sallallahü aleyhi ve sellem) şöyle buyurdu: \"Cennete girecek herbir kişiye, dünyâda iken kötü amel yapmış olduğu takdirde cehennemdeki oturağı kendisine muhakkak gösterilecektir. Bu da şükrünün artması içindir. Cehenneme girecek herbir kimseye de, dünyâda iken güzel işler işlemiş olaydı cennetten olacak oturağı kendisine muhakkak gösterilecektir. Bu da kendisi aleyhine bir hasret olması içindir",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 6570,
			"arabicnumber": 6570,
			"text": "Ebû Hureyre (radıyallahü anh) şöyle demiştir: Ben bir kerre: Yâ Rasûlallah! Kıyâmet gününde Sen'in şefaatin en ziyâde kime olacak? diye sordum, aleyhi ve sellem): \"Yâ Ebâ Hureyre! Hadîs (bellemek) için sende gördüğüm hırsa göre, bu hadîsi senden evvel kimsenin bana sormayacağını zâten tahmîn ediyordum. Kıyâmet gününde halk içinde şefaatime en ziyâde mazhar olacak kimse, kalbinden ve gönlünden hâlis ve samîmi olarak 'La ilahe ille’llâh' diyen kimsedir\" buyurdu",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 6571,
			"arabicnumber": 6571,
			"text": "Bize Cerîr, Mansûr'dan; o da İbrahim'den; o da Abîde'den; o da Abdullah ibn Mes'ûd (radıyallahü anh)'dan tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem) şöyle buyurmuştur: \"Ben ateş ehlinin cehennemden son çıkacak ve cennet ehlinin cennete son girecek olanını bilip duruyorum. Bu bir kimsedir ki, cehennemden emekliye emekliye çıkar. Yüce Allah ona: Git, cennete gir! buyurur. kimse cennete varır, ona öyle bir hayâl gelir ki, cennet dopdoludur (herkes kendilerine âid yerlerini almış, açık bir yer kalmamıştır). Dönüp: Yâ Rabb! Ben cenneti dopdolu buldum! der. Allah yine: Git, cennete gir! buyurur, kimse cennete varır. Yine cennet ona dopdolu gibi hayâl ettirilir. Dönüp: Yâ Rabb! Cenneti ben dopdolu buldum! der. Allah ona: Git, cennete gir! Dünyâ kadar ve dünyânın on misli kadar yer senindir -yahut: Dünyânın on misli kadar yer senindir-! buyurur. kul: Sen yegâne Melik olduğun hâlde benimle alay mı ediyorsun -yahut: Bana gülüyor musun-? der\". dedi ki: (Bu ilâhî va'di o kimse alaya hamlettiğinden dolayı) VallâhîRasûlüllah'ın gerideki dişleri belirinceye kadar güldüğünü gördüm. Sahâbîler arasında: Cennet ehlinin en aşağı menzil sahibi, işte bu kimsedir! denilirdi",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 6572,
			"arabicnumber": 6572,
			"text": "Abbâs (radıyallahü anh)Peygamber(sallallahü aleyhi ve sellem)'e: Sen amcan Ebû Tâlib'e herhangi birşeyle fayda verdin mi? diye sordu",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 6573,
			"arabicnumber": 6573,
			"text": "Buradaki iki senedde Ebû Hureyre (radıyallahü anh) haber verip şöyle demiştir: Bir defasında birtakım insanlar: Yâ Rasûlallah! Kıyâmet gününde biz Rabb'imizi görecek miyiz? diye sordular. aleyhi ve sellem): \"Önünde görmeye engel hiçbir bulut yokken güneşi görmeniz hususunda itişip kakışma suretiyle bir zarar ve sıkışıklığa düşer misiniz?\" diye sordu. Hayır yâ Rasûlallah, dediler. Rasûlüllah tekrar: \"Önünde engel hiçbir bulut yok iken ayın ondördüncü gecesi kameri görmek hususunda itişip kakışma suretiyle bir zarar ve sıkışıklığa uğrar mısınız?\" diye sordu. Hayır yâ Rasûlallah (bunda da sıkışıklık yapılmaz), deyince Rasûlüllah: \"İşte şübhesiz sizler O'nu kıyâmet gününde böyle apaçık, sıkışıksız olarak göreceksiniz. Allah bütün insanları bir araya toplayacak da: Her kim her neye tapıyor idiyse onun ardına düşsün! buyuracak (yahut Allah'ın emriyle bu sözü diyen diyecek). Artık güneşe tapmakta olan güneşin ardına düşer; kamere tapmakta olan kamerin ardına düşer; tâğûtlara tapmakta olanlar onların ardına takılıp gidecek. Yalnız bu ümmet, içlerinde münafıkları da olduğu hâlde yerinde durup kalacak. Allah onlara, evvelce tanıdıklarından başka surette gelip: Ben sizin Rabb'inizim! buyuracak. Onlar (Rabb'lerini o tecellî ile tanıyamadıkları için); Biz Sen 'den Allah 'a sığınırız, Rabb'imiz bize gelinceye kadar bizim yerimiz burasıdır, (yerimizden ayrılmayız). Rabb'imiz bize geldikte, biz O'nu tanırız! diyecekler. Allah onlara bu defa da tanıdıkları surette gelip: Ben sizin Rabb'inizim! buyuracak. Onlar da: Sen bizim Rabb'imizsin! diyecekler. Ve (O'nun daVeti üzerine) O'na tâbi' olacaklar. Ve cehennem köprüsü kurulur\". buyurdu ki: \"Ümmetini onun üstünden en evvel geçirecek, ben olacağım. O gün rasûllerin duaları 'Allâhumme! Sellim sellim(= Yâ Allah, selâmet ver, selâmet ver)’ (den ibaret) olacaktır. Sırat Köprüsü 'nde sa 'dân dikenlerine benzer birçok çengeller vardır. Sizler sa'dân dikenlerini gördünüz mü?\" Evet görmüşüzdür yâ Rasûlallah! dediler. Rasûlüllah devamla dedi ki: \"İştebu çengeller sa'dân dikenlerine benzerler. Ancak şu var ki, ne kadar büyük olduklarını yalnız Allahü Taâlâ bilir, tşte bu çengeller insanları (kötü) amellerinden dolayı kapıp alırlar. Kimi kötü ameli sebebiyle helak olur. Kimi hardal gibi ezik ezik ezildikten sonra kurtulur. Nihayet Allahü Taâlâ kulları arasında hüküm ve adaletini tamamlayıp sırf ilâhî rahmeti olarak, nâr ehlinden dilediklerini cehennemden çıkarmayı irâde ettiğinde meleklerine, ilâhî rahmete nâiliyetleri murâd olanlardan Allah'a birşeyi ortak edinmemişleri, ‘Lâ ilahe ille 'ilâh’ diye şehâdet etmişleri cehennemden çıkarsınlar diye ferman buyuracaktır. Melekler bunları cehennemde, üzerlerindeki sucûd izleri, alâmetleriyle tanıyıp çıkaracaklardır. Allah Âdem oğlu'ndan sucûd eserini yemeyi ateşe haram kılmıştır. Melekler onları ateşten kavrulup kapkara olarak çıkaracaklar. Sonra üzerlerine hayât suyu denilen bir su dökülecek de sel uğrağında biten yabanî reyhan tohumları nasıl çabuk biterlerse (yeniden) öyle biteceklerdir. Ve onlardan yüzü ateşe dönük bir kimse kalır ki, o: Yâ Rabb! Beni şu ateşin kokusu zehirleyip duruyor, yalını beni yakıp duruyor, benim yüzümü bu ateşten döndür! diyecek. kimse mütemadiyen yüzünü ateşten çevirmesi için Allah'a duâ edip duracak. Sonunda Allah ona: Senin istemekte olduğun şeyi sana verirsem, ondan başka bîrşey daha istemen olacak mı? buyuracak. kul: İzzetineyemîn ederim ki, Sen'den, ondan başkasını istemem! diyecek. onun yüzünü ateşten döndürecek. Sonra bunun ardından o kul: Yâ Rabb, beni cennetin kapısına yanaştır! diyecek. Allah: Sen ondan başka birşey istemeyeceğine azmedip kesin söz vermiş değil miydin? Yazık sana ey Âdem oğlu! Sen ne kadar sözünde durmaz, ahdine vefa etmez kişisin! buyuracak. kul Allah'a devamlı duâ edip duracak. Allah: Bu isteğini sana verirsem, ondan başkasını ister misin? buyuracak. kul: Hayır, izzetine yemîn ederim ki, ondan başka birşey istemem! deyip, ondan başka hiçbir şey istemeyeceğine dâir Allah'a birçok ahidler ve mîsâklar verecek. üzerine Allah onu cennetin kapısına yaklaştıracak. O kimse cennet kapısına yanaşıp da ondaki güzellikleri görünce Allah'ın dilediği kadar bir müddet sükût edecek. Sonra: Yâ Rabb! Beni cennetin içine girdir! diyecek. Sonra Allah da: Sen ondan başka hiçbirşey istemeyceğine kesin söz vermiş değil miydin? Yazık sana ey Âdem oğlu! Sen ne sözünde durmaz kimsesin! buyuracak. Yâ Rabb! Beni mahlûkaatının en bedbahtı kılma! diyecek ve bu söz üzerine duâ ve niyazını tekrar ede ede nihayet Allah Taâlâ ona Gülecek. Allah ona gülünce de, o kimseye, cennete girmesine izin vermiş olacaktır. Cennete girdiği zaman da o kula: Fulân şeyden temenni et! Denilir, o da temenni edecek. Sonra ona: Fulân şeyden de temenni et! denilecek. da uzun uzun temennilerde bulunacak. Nihayet bütün temennileri kesilince, Allah Taâlâ ona: Bunların hepsi ve bir o kadar dahası da hep senindir.’ buyuracaktır\". Hureyre: Bu kimse, cennet ehlinin cennete en son girecek kişisidir, demiştir",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 6574,
			"arabicnumber": 6574,
			"text": "Hadîsi Ebû Hureyre'den rivayet edenlerden birisi olan Atâ ibn Yezîd el-Leysî dedi ki: Ebû Hureyre bunu rivayet ederken, Ebû Saîd el-Hudrî de Ebû Hureyre'nin beraberinde oturuyor ve Ebû Hureyre'nin dediklerinden hiçbir şeyi değiştirmeye lüzum görmüyordu. Tâ \"Bunların hepsi senin ve bir o kadar dahası da hep senindir\" sözüne gelince, Ebû Saîd, Ebû Hureyre'ye: Ben Rasûlüllah(sallallahü aleyhi ve sellem)'tan\"Bunların hepsi ve daha on misli de senindir, buyuracaktır\" derken işittim, dedi. Hureyre de: Ben Rasûlüllah'tan yalnız \"Bunlar ve beraberinde bir misli daha senindir\" buyurduğunu belledim, dedi",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 6575,
			"arabicnumber": 6575,
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 6576,
			"arabicnumber": 6576,
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 6577,
			"arabicnumber": 6577,
			"text": "BanaNâfi', İbn Omer (radıyallahü anh) 'den tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem):\"Önünüzde bir havuz vardır ki,(büyüklüğü) Cerbâ ile Ezruh arası gibidir\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 6578,
			"arabicnumber": 6578,
			"text": "Bize Ebû Bişr ile Atâ ibnu's-Sâib, Saîd ibn Cubeyr'den haber verdi ki, İbn Abbâsradıyallahü anhüma: Kevser, Allah Taâlâ'nın O'na, yani Rasûlü'ne ihsan buyurmuş olduğu çok hayırdır, demiştir. Bişr dedi ki: Ben Saîd ibn Cubeyr'e: Birçok kimseler Kevser'in cennette bir nehir olduğunu söylüyorlar, dedim. üzerine Saîd ibn Cubeyr: Cennetteki o nehir de Allahü Taâlâ'nın O'na ihsan buyurduğu hayırdandır, cevâbını verdi",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 6579,
			"arabicnumber": 6579,
			"text": "Abdullah ibn Amr (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) şöyle buyurdu: \"Benim havzım(açıları müsâvî olarak) bir aylık yol genişliğindedir. Onun suyu sütten daha beyaz, kokusu miskten daha hoştur. Bardakları da gökyüzünün yıldızları gibi çoktur. Her kim ondan içerse, o kimse artık ebediyyen susamaz",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 6580,
			"arabicnumber": 6580,
			"text": "İbn Şihâb şöyle demiştir: Bana Enes ibn Mâlik (radıyallahü anh) tahdîs etti ki, Rasûlüllah(sallallahü aleyhi ve sellem) şöyle buyurmuştur: \"Şübhesiz havzımın (sahası) mikdârı Eyle ile Yemen'in San'â şehri arasındaki mesafe gibidir. Muhakkak ki, havzda semânın yıldızları sayısınca ibrikler vardır",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 6581,
			"arabicnumber": 6581,
			"text": "Bize Enes ibn Mâlik (radıyallahü anh) tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem) şöyle buyurmuştur: \"Ben cennette yürüdüğüm sırada bir nehir gördüm, iki tarafında inciden oyulmuş kubbeler vardı. Yâ Cibril! Bu nedir? diye sordum. Cibril: Bu nehir, Rabb'inin Sana vermiş olduğu Kevser'dir, diye cevâb verdi. Ben gördüm ki, onun toprağı -yahut kokusu- keskin ve temiz misk idi\". Buhârî'nin üstadı Hudbe ibnu Hâlid'dir",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 6582,
			"arabicnumber": 6582,
			"text": "Bize Abdulazîz, Enes (radıyallahü anh)'ten tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem) şöyle buyurmuştur: \"Sahâbîlerimden birtakım insanlar muhakkak havz başında benim yanıma geleceklerdir. Nihayet ben onları görüp tanıdığım zaman onlar benim önümden çekilip götürülürler. Ben: Onlar benim sahâbîlerim! derim. (Allah tarafından vazîfeli melek) bana: Sen onların, Senden sonra (havzdan mahrûmluğa sebeb olacak ma'siyetlerden) neler meydana getirdiklerini bilmezsin! der",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 6583,
			"arabicnumber": 6583,
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 6584,
			"arabicnumber": 6584,
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 6585,
			"arabicnumber": 6585,
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 6586,
			"arabicnumber": 6586,
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 6587,
			"arabicnumber": 6587,
			"text": "Bana Hilâl ibn Alî, Atâ ibn Yesâr'dan; o da Ebû Hureyre (radıyallahü anh)'den tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem) şöyle buyurmuştur: \"Ben (havz başında) dikilip durduğum sırada bir zümre görürüm. Nihayet onları tanıdığım zaman benimle onlar arasından bir adam (bir melek) ortaya çıktı da onlara: Geliniz! dedi. Ben ona: Bunları nereye götürüyorsun? dedim. Melek: Vallahi cehneneme götürüyorum! diye cevâb verdi. Bunların hâli, günâhı nedir? dedim. Melek: Bunlar Sen 'in ardından kıçları üzerine dönüp (dînlerine) arkalarını çevirerek irtidâd ettiler! dedi. ben havz başında bir zümre daha gördüm. Nihayet onları tanıdığım zaman yine benimle onlar arasından bir adam daha ortaya çıktı da bu topluluğa: Geliniz! dedi. Ben ona da: Bunları nereye götürüyorsun? diye sordum. Vallahi ateşe götürüyorum, diye cevâb verdi. Bunların günâhı nedir? dedim. Melek: Sen'den sonra bunlar kıçları üzerine dönüp dînlerine arkalarını çevirerek gerisin geri dînden çıkmışlardır! dedi. bu havza yaklaşıp da geriye çevrilenlerden hiçkimsenin cehennemden kurtulacağını sanmıyorum. Ancak çobansız yolunu şaşıran deve sürüsünden yolunu bulanlar misâli bunlardan da (tek tük) cehennemden kurtulanlar olabilir",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 6588,
			"arabicnumber": 6588,
			"text": "Bize Enes ibn Iyâd, Ubeydullah'tan; o da Hubeyb,'den; o da Hafs ibn Âsım'dan; o da Ebû Hureyre (radıyallahü anh)'den tahdîs etti ki, Rasûlüllah(sallallahü aleyhi ve sellem):\"Evimle minberim arasındaki saha, cennet bahçelerinden bir bahçedir, minberim de havzımın üzerindedir\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 6589,
			"arabicnumber": 6589,
			"text": "Abdulmelik ibn Umeyr şöyle dedi: Ben Cundeb (radıyallahü anh)'den işittim, şöyle dedi:Ben Peygamber (sallallahü aleyhi ve sellem)'den işittim: \"Ben havz başında sizin öncünüzüm\" buyuruyordu",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 6590,
			"arabicnumber": 6590,
			"text": "Bize el-Leys, Yezîd ibn Ebî Habîb'den; o da Ukbe ibn Âmir (radıyallahü anh)'den şöyle tahdîs etti: Peygamber(sallallahü aleyhi ve sellem) birgün dışarı çıkıp Uhud (harbi) şehîdleri üzerine ölüye cenaze namazı kılar gibi namaz kıldı. Sonra (Medîne'ye) dönüp minbere çıktı ve (ölülere, dirilere veda eder gibi bir hutbe yapıp) şöyle buyurdu: \"Ben sizin, havz başına ilk ulaşanınız olacağım. Ve sizin hakk yolundaki hizmetlerinize şehâdet edeceğim. Vallahi ben şu anda muhakkak (cennetteki) havzıma bakıp görüyorum. Şuöhesiz bana Arz'ın hazînelerinin anahtarları yahut: Arz'ın anahtarları- verilmiştir. Vallahi ben, benden sonra sizin üzerinize müşrikliğe dönmenizden korkmam. Lâkin ben sizin bu hazîneler (yahut dünyâ) hususunda birbirinizle nefsâniyet yarışına girişip didişmenizden korkarım",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 6591,
			"arabicnumber": 6591,
			"text": "Bize Şu'be, Ma'bed ibn Hâlid'den tahdîs etti. O da Harise ibn Vehb'den şöyle derken işitmiştir: Ben Peygamber (sallallahü aleyhi ve sellem)'den işittim: Ve kendisi havzı zikretti de: \" (Onun büyüklüğü) Medine ile San'â arasındaki saha gibidir\" buyurdu",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 6592,
			"arabicnumber": 6592,
			"text": "Ve İbnu Ebî Adiyy, Şu'be'den; o da Ma'bed ibn Hâlid'den; o da Hârise'den: OnunPeygamber'den işittiğini ve \"Onun havzı, Medîne ile San 'â arasındaki mesafe sahası kadardır\" dediğini ziyâde etmiştir. râvîye: Sen ondan \"Kapları\" söylediğini işitmedin mi? dedi. Râvî: Hayır, diye cevâb verdi. Bunun üzerine el-Mustevrid: \"Orada yıldızlar gibi kaplar görülür\" dedi",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 6593,
			"arabicnumber": 6593,
			"text": "Esma bintu Ebî Bekr (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) şöyle buyurdu: \"Ben havz başında olacağım. Hattâ sizden bana gelmekte olanları gözetlerken, benim önümde birtakım insanlar yakalanacak. Bunun üzerine ben: Yâ Rabb! (Onlar) benden ve benim ümmetimdendir, derim. cevaben:) Sen onların Sen 'den sonra neler yaptıklarını bildin mi? Vallahi onlar Sen 'den sonra ayak topukları üzerinde dönmekten hiç mi hiç ayrılmadılar, denilir\". dedi ki: Abdullah ibn Ebî Muleyke: Yâ Allah! Biz topuklarımız üzerinde dönmemizden yahut dînimizden fitnelere uğratılmamızdan Sana sığınırız! diye duâ ederdi. a'kaabihim yenkisûn\", \"Topuk üzerinde geriye dönüyorlar\" demektir. Bir rivayette âyetteki gibi gelmiştir: \"Fe kuntum alâ a'kaabıkum tenkısûn\"(el-Mu'minûn: 66)\"Topuklarınız üzerinde geriye dönüyordunuz\" demektir",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 181
			}
		}
	]
}