{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"83": "Oaths and Vows"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6621,
			"arabicnumber": 6621,
			"text": "Aişe r.anha'dan rivayet edildiğine göre, Allah yemin kefareti hakkında ayet indirene değin, Ebu Bekir r.a. asla yemininden dönmezdİ. Bu ayet inince şöyle dedi: \"Bir konuda yemin eder ancak başkasının daha hayırlı olduğunu görürsem o zaman hayırlı olanı yapar ve yeminimin kefaretini veririm",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6622,
			"arabicnumber": 6622,
			"text": "Abdurrahman İbn Semure Nebi Sallallahu Aleyhi ve Sellem'in kendisine şöyle dediğini rivayet etmiştir: \"Ey Abdurrahman İbn Semure, idareciliği isteme. Eğer sen isteyerek idareciliğe getirilirsen yalnız kalırsın. Ancak istemediğin halde bu iş sana verilirse o zaman sana yardım edilir. Bir konuda yemin edersen ve yemin ettiğin dışinda bir şeyin daha hayırlı olduğunu görürsen yemin kefaretini ver ve hayırlı olanı yap.\" Tekrar: 6722,7146, 7147",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6623,
			"arabicnumber": 6623,
			"text": "Ebu Bürde, babasının şöyle dediğini rivayet etmiştir: Eş'ari kabilesinden bir grubun arasında, kendisinden binek istemek üzere, Nebi Sallallahu Aleyhi ve Sellem'in yanına geldim. Ancak Nebi Sallallahu Aleyhi ve Sellem: \"Allah'a yemin ederim ki, size binek vermeyeceğim. Zaten verecek bineğim de yok\" buyurdu. Biz, Allah'ın dilediği kadar bir müddet bekledik. Bu arada Nebi Sallallahu Aleyhi ve Sellem'e üç grup beyaz alınlı deve getirildi. Biz de bunlara bindik. Ancak aramızdan bazıları: \"Vallahi, bunlar bize bereket getirmeyecek. Biz Nebi Sallallahu Aleyhi ve Sellem'den binek istemeye gittiğimizde o, bize binek vermeyeceğine dair yemin etmişti. Ama daha sonra bizi bu hayvanlara binmemiz için bunları bize verdi. Gelin, hep beraber Nebi Sallallahu Aleyhi ve Sellem'e dönelim, bu durumu ona hatırlatalım\" dediler. Biz de Nebi Sallallahu Aleyhi ve Sellem'in yanına döndük. O bize şöyle dedi: \"Size bu binekleri ben vermedim, Allah verdi. Ben Allah'a yemin ederim ki bir hususta yemin eder ancak başka bir şeyin daha hayırlı olduğunu görürsem o zaman yeminimin kefaretini vererek hayırlı olanı işlerim. Ya da hayırlı olanı işler ve yeminimin kefaretini veririm",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6624,
			"arabicnumber": 6624,
			"text": "Ebu Hureyre r.a.'den nakledildiğine göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Biz (dünyada kendilerine kitap verilen ümmetierin) sonuncusuyuz, kıyamet gününde ise (cennete girenlerin) ilki biz olacağız",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6625,
			"arabicnumber": 6625,
			"text": "Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: Allah'ın gerekli gördüğü kefareti vermek yerine aileniz hakkındaki yemininizde ısrarlı olursanız Allah katında günahkar olursunuz. \" Tekrar: 6626",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6626,
			"arabicnumber": 6626,
			"text": "Ebu Hureyre r.a.'den nakledildiğine göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Ailesi hakkındaki yemininde ısrar etmek daha büyük günahtır. Salih amel işlesin ve kefaret versin\" Fethu'l-Bari Açıklaması: Lağv: Ragıp şöyle demiştir: Lağv kelimesinin asıl anlamı, sözde haddi aşmamaktır. Yeminler söz konusu olunca istemeden söylenen anlamındadır. Arapçada kuş sesi •. Wl i olarak adlandırılır. Bu itibarla istemeden söylenen söz için de aynı kökten gelen y.U\\ kelimesi kullanılmıştır. Bağlanmış olduğunuz yeminler: Müfessir Ata, 'bağlanmış olan yemin' ifadesinin 'kesin bir dille söylenen yemin' anlamına geldiğini belirtmiştir. Allah yemin kefareti hakkında ayet indirene değin, Hz. EbU Bekir asla yemininden dönmezdi: Ebu Bekir'in bu sözü akrabası Mistah'la bağını koparmaya veya ona infak etmemeye yemin etmesi ve akabinde \"Sizden fazilet ve imkan sahipleri yakınlara, fakirlere ve Allah yolunda hicret edenlere infak etmemeye yemin etmesinler, affetsinler ve görmezlikten gelsinler\"(Nur, 22) ayetinin na,zil olması üzerine söylediği nakledilmiştir. Bu ayet nazil olduktan sonra Ebu Bekir yeniden Mistah'a infak etmeye başladı. Bu olay Nur Süresi tefsirinde İfk hadisesi anlatılırken açıklanmıştı. (475 numaralı hadis) Ey Abdurrahman İbn Semüre, idareciliği isteme: Yöneticiliği isteme, anlamındadır. Bu rivayet Kitabu'l-ahkam'da şerh edilecektir.(7147 numaralı hadis) Yemininde ısrar etmek: ....... kayıtsız şartsız ısrar anlamındadır. Bile bile hatalı davranışı sürdürmektir. Günahkardır: Daha büyük günah işlemiş olur. Allah'ın gerekli gördüğü kefareti vermek yerine: Nevevi şöyle demiştir: Yemininden dönmemesi halinde ailesine zarar verecek bir durum ortaya çıkacaksa, kişinin yemininden dönmesi ve yemin kefareti vermesi gereklidir. Eğer, yeminden dönme günahını işlemekten kaçınarak yemininden dönmeyeceğini söylerse bu sözüyle günah işlemiş olur. Yeminden dönmeyerek ailesine zarar vermeye devam ederse kazanacağı günah yeminden dönme günahından daha büyüktür. Kuşkusuz bu ayet yeminden dönmenin bir masiyet içermediği durumlarda geçerlidir. Günahkardır, ifadesinin daha günahkardır anlamında ism-i tafdil sıgasıyla gelmesi yemin eden kişinin zan ve evhamının dikkate alınmasından ötürüdür. Bu kimse yeminden dönmekle günah kazanacağını zannetmektedir. Oysa yeminden dönerek günah kazanmamaktadır. Bu nedenle ona ısrar etmek, yeminden dönmekten daha buyük günahtır, denilmektedir. Salih am e/ iş/esin ve kefaret versin: Hadiste \"salih amel işlesin/salihlerden olsun\" anlaı;nında yer alan ..r.:1 kelimesi fo kökünden gelmektedir. Yeminini tutmakta ısrar etmeyi bırakarak salih amel işlemiş olsun anlamındadır. fo kefaret anlamında da tefsir edilmiştir. Böylece yemin ettiği hususta ısrar etmeyi bırakarak yemininden dönsün, yemin kefareti ödemesi sebebiyle salih amel işlemiş olsun 11],anasl kastedilmiş olmaktadır. Hadiste bir maslahata dayanıyorsa yeminden dönmenin, yemini sürdürmekten daha faziletli olduğu belirtilmektedir. Bu durum yemin edilen meselenin hükmüne göre değişiklik arz eder. Bir vacibi işlemeye ya da bir haramdan kaçınmaya yemin etmişse bu yemin Allah'a itaattir ve böyle bir yemini sürdürmek vaciptir, bu yeminden dönmek masiyettir. Aksi de aynı şekildedir. Nafile bir ibadet için yemin etmişse de bu yemin itaattir, yemini sürdıirmek müstehap, yeminden dönmek mekruhtur. Bir mendubu terk etmeye yemin etmişse bu da bir önceki durumun tersidir. Güzel yemek yememek ve güzel giyinmemek gibi mübah bir şeyi yapmaya yemin etmişse, bu fiili işlemek ya da terk etmenin hangisinin maslahata uygun olduğu konusunda kararsız kalmışsa, bu meselenin hükmü hakkında Şafiler arasında ihtilaf bulunmaktadır. İbnu's-Sabbağ şöyle demiştir: Bunun hükmü duruma göre değişir. İki durum da masıahat bakımından eşitse doğru olan yemini sürdürmektir. Müteahhirun alimleri de İbnu's-Sabbağ'ın bu fikrini doğru kabul etmişlerdir. Allah en doğrusunu bilir. Hadis her ne kadar edilen yeminin ailenin maslahatı ile ilgili olmasını vurgulamışsa da bu, çoğunlukla gerçekleşen bir durum olması nedeniyledir. Oysa aile ile ilgili olmayan meselelerde de yeminden dönmeyi gerektirecek bir sebep olduğu sürece aynı hüküm geçerlidir",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6627,
			"arabicnumber": 6627,
			"text": "İbn Ömer r.a.'den rivayet edildiğine göre Nebi Sallallahu Aleyhi ve Sellem Usame İbn Zeyd komutanlığında bir seriye gönderdi. Ancak bazı kimseler Usame'nin komutanlığı hakkında ileri geri konuşmaya başladılar. Nebi Sallallahu Aleyhi ve Sellem bunun üzerine şöyle buyurdu: ''Usame'nin komutanlığı hakkında ileri geri konuşuyorsunuz. Daha önce babasının komutanlığı hakkında da ileri geri konuşmuştunuz. Allah'a yemin ederim ki, (babası Zeyd) komutanlığa layıktı, o benim en çok sevdiğim kişilerden biriydi. Usame de Zeyd'den sonra benim en çok sevdiğim kimselerden biridir. Fethu'l-Bari Açıklaması: Nebi s.a.v.'in ........ diyerek yemin etmesi: İbn Abbas'tan nakledildiğine göre Allah'a yemin etmek Allah'ın isimleriyle yemin etmektir. Bu nedenle Malikiler ve Hanefiler ...... ifadesinin bir yemin olduğu kanaatindedirler. Şafiiler'e göre yemine niyet etme halinde bu lafızia yemin sabit olur. Yemin dışında bir niyetle bu lafız kullanılırsa o zaman yemin sabit olmaz. Bu lafız mutlak olarak söylenirse, anlamı ile ilgili iki değerlendirme bulunmaktadır: Bunların doğru olanı yemin niyetiyle söylenmemişse bu lafızia yemin sabit olmayacağıdır. Ahmed İbn Hanbel'den bu hususta iki görüş nakledilmiştir. Bunların sahih olanı bu lafızia yemin sabit olacağıdır. Gazali .uıl IJ ifadesinin anlamı ile ilgili iki görüş bulunduğunu belirtmiştir. Bu görüşlerden birine göre bu lafız .uıG anlamındadır. Diğer görüşe göre ise i .uı anlamındadır. Tercih edilmesi gereken görüş de ikincisidir. Bazıları ...... lafzının.uıl lafzı ile aynı anlama geldiğini söylemişlerdir. Maverdi,.uıı lafzının, ..... lafzının aksine, Arap örfünde kullanımının oldukça yaygın olduğunu belirtmiştir ........ lafzının kullanımıyla yeminin sabit olacağını söyleyenler bu lafzın .uıl anlamına gelmesinden hareket etmişlerdir .... Allah'ın sıfatlarından biridir, O'nun sıfatları kadimdir. Nevevi, et-Tehzib'de .uıl IJ lafzının ....... tamlaması gibi olduğunu, bu nedenle mutlak olarak söylendiğinde bu lafızia yeminin sabit olduğunu söylemiştir. Bir sonraki bölüm başlığı altında yer alan bir rivayet bu lafzın yemin anlamına geldiğini desteklemektedir. Süleyman İbn Davud aleyhisseıam kıssası ile ilgili Ebu Hureyre'den nakledilen bu hadise göre Hz. Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Muhammed'in nefsini elinde bulundurana yemin ederim ki ..........\" Süleyman inşallah deseydi (istediği kadar çocuğu olur ve bunların) her biri cihat ederdi» Allah en doğrusunu bilir . .......lafzının mutlak söylenmesi ile yeminin sabit olacağını ileri sürenler bu hadise dayanmışlardır. Oysa bu hadis sadece önce takdir edilenin aynısına delalet etmektedir, .uıl ........' Allah hakkı için anlamındadır. Musannif daha sonra Usame İbn Zeyd'in komutan tayin edilmesi ile ilgili İbn Ömer hadisini nakletmiştir. Bu hadis Megazi ve Menakıb'da yeterince şerh edilmişti",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6628,
			"arabicnumber": 6628,
			"text": "İbn Ömer, Nebi Sallallahu Aleyhi ve Sellem'in لا ومقلِّب القلوب Hayır, kalpleri çevirene yemin ederim, diye yemin ettiğini nakletmiştir",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6629,
			"arabicnumber": 6629,
			"text": "Cabir İbn Semure'den nakledildiğine göre Nebi Sallallahu Aleyhi ve Sellem şöyle demiştir: \"Kayser helak olduktan sonra başka kayser yoktur, kisra helak olduktan sonra da başka kisra yoktur. Nefsimi elinde bulundurana yemin ederim ki, onların hazineleri Allah yolunda infak edilecektir",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6630,
			"arabicnumber": 6630,
			"text": "Ebu Hureyre r.a.'den nakledildiğinegöre Nebi Sallallahu Aleyhi ve Sellem şöyle demiştir: \"Kayser helak olduktan sonra başka kayser yoktur, kisra helak olduktan sonra da başka kisra yoktur. Nefsimi elinde bulundurana yemin ederim ki, onların hazineleri Allah yolunda infak edilecektir",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6631,
			"arabicnumber": 6631,
			"text": "Aişe r.anha Nebi Sallallahu Aleyhi ve Sellem'in şöyle dediğini nakletmiştir: \"Ey Muhammet ümmeti, Allah'a yemin ederim ki, benim bildiklerimi bilseniz çok ağlar, az gülerdiniz.»",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6632,
			"arabicnumber": 6632,
			"text": "Abdullah İbn Hişam şöyle rivayet etmiştir: Biz Nebi Sallallahu Aleyhi ve Sellem'in yanındaydık. O, Ömer İbn el-Hattab'ın elini tutuyordu. Ömer r.a. ona şöyle dedi: \"Ey Allah'ın resulü, kendim hariç, seni herkesten daha çok seviyorum» dedi. Nebi Sallallahu Aleyhi ve Sellem: \"Hayır, nefsimi elinde bulundurana yemin ederim ki, beni kendinden de daha çok sevmelisin, buyurdu. Ömer r.a.: \"Evet, Allah'a yemin ederim ki, şimdi seni kendimden de daha çok seviyorum» dedi. Nebi Sallallahu Aleyhi ve Sellem: \"Şimdi oldu, ey Ömer'' dedi",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6634,
			"arabicnumber": 6634,
			"text": "",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6635,
			"arabicnumber": 6635,
			"text": "Abdurrahman İbn Ebi Bekre, babasından naklen Nebi Sallallahu Aleyhi ve Sellem'in şöyle dediğini nakletmiştir: \"Ne dersiniz, Eslem, Ğifar, Müzeyne ve Cüheyne kabileleri zarar ve ziyanda olan Temim, Amir İbn Sa'sa'a, Gatafan ve Esed'den daha hayırlı değilmidir? \"Ashap Nebi Sallallahu Aleyhi ve Sellem'e \"Evet\" dedi. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem: \"Nefsimi elinde tutana yemin ederim ki onlar bunlardan daha hayırlıdır\" buyurdu",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6636,
			"arabicnumber": 6636,
			"text": "Ebu Humeyd es-Said! şöyle nakletmiştir: Nebi Sallallahu Aleyhi ve Sellem, bir zekat memuru çalıştırmıştı. Memur, görevden dönünce Nebi Sallallahu Aleyhi ve Sellemle gelip \"Ey Allah'ın elçisi bunlar sizindir, bunlar da bana hediye olarak verildi\" dedi. Nebi Sallallahu Aleyhi ve Sellem adama şöyle dedi: \"Ananın babanın evinde oturup bekleseydin bunlar sana yine hediye edilir miydi edilmez miydi?\" Daha sonra namazın ardından kalkıp kelime-i şehadet getirdi, Allah'ı layıkıyla övdü ve şöyle dedi: \"Şimdi, bizim görevlendirdiğimiz memura ne oluyor da gelip \"bu sizin toplamam için beni görevlendirdiğiniz (mal ve paradır) bu da bana hediye olarak verilmiştir\" diyebiliyor. Muhammed'in nefsini elinde bulundurana yemin ederim ki (Ümmetin malından) bir şeyi haksız yere alan kimse kıyamet gününde bunu boynunda taşıyarak gelir. Bu mal bir deve ise böğürerek gelir. Bir sığır ise böğürerek gelir. Bir koyun ise meleyerek gelir. Ben size tebliğ ettim\" EbU, Humeyd şöyle dedi: Nebi Sallallahu Aleyhi ve Sellem daha sonra ellerini kaldırdı. Biz koltuk altlarının beyazlığını görebiliyorduk. Bu hadisi benimle beraber Zeyd İbn Sabit de Hz. Nebi Sallallahu Aleyhi ve Sellemiden dinlemiştir. Ona da sorun",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 6637,
			"arabicnumber": 6637,
			"text": "Ebu Hureyre'den şöyle rivayet edilmiştir: Ebu'I-Kasım dedi ki: \"Siz benim bildiklerimi bilseydiniz çok ağlar az gülerdiniz",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 6638,
			"arabicnumber": 6638,
			"text": "Ebu Zer' şöyle demiştir: Nebi Sallallahu Aleyhi ve Sellem Kabe'nin gölgesinde şöyle derken ben onun yanına vardım: \"Kabe'nin rabbine yemin ederim ki, onlar en çok ziyan edenlerdir. Kabe'nin rabbine yemin ederim ki, onlar en çok ziyan edenlerdir.\" Ben kendi kendime dedim ki: \"Ben ne yaptım? Ben de bir kusur mu gördü? Ben ne yaptım?\" Hz. Nebi Sallallahu Aleyhi ve Sellem'in yanında oturdum, kendimi tutamadım, susamayıp sordum: \"Annem babam sana feda olsun ey Allah'm elçisi, onlar kimlerdir?\" Şöyle cevap verdi: \"Malı çok olanlar, ancak şunu, şunu ve şunu söyleyenler hariç",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 6639,
			"arabicnumber": 6639,
			"text": "Ebu Hureyre'den nakledildiğine göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Süleyman aleyhisselam bir gecede doksan kadınla birlikte olmaya ve kadınlardan her birinin birer atlı mücahit dünyaya getirmesine yemin etti. Arkadaşı Süleyman a.s.'a, inşallah / Allah dilerse, demesini öğütledi ancak Süleyman bunu söylemedi. Süleyman bu kadınların hepsini dolaştı. Ancak biri hariç hiçbir kadın gebe kalamadı. Gebe kalan da sakatbir evlat doğurdu. Muhammed'in nefsini elinde bulundurana yemin ederim ki, inşallah deseydi, temenni ettiği gibi hepsi atlı birer mücahit doğururdu",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 6640,
			"arabicnumber": 6640,
			"text": "Bera' İbn Azib şöyle edilmiştir: Nebi Sallallahu Aleyhi ve Sellem'e ipek bir kumaş parçası hediye edildi. Herkes bu kumaşın güzelliği ve yumuşaklığını o kadar beğendi ki elden ele dolaştırmaya başladı. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem: \"Çok mu beğendiniz? diye sordu. \"Evet\" dediler. Şöyle buyurdu: \"Nefsimi elinde bulundurana yemin ederim ki Sa'd'ın cennetteki mendilleri bundan daha güzeldir",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 6641,
			"arabicnumber": 6641,
			"text": "Aişe r.anha şöyle demiştir: Utbe İbn Rebia'nın kızı Hind Nebi Sallallahu Aleyhi ve Sellem'e şöyle dedi: \"Ey Allah'ın elçisi bir zamanlar senin hane halkın kadar yeryüzünde zelil olmasını istediğim hiçbir hane yoktu. Oysa şimdi senin hane halkın kadar aziz olmasını istediğim hiçbir hane yoktur. Nebi Sallallahu Aleyhi ve Sellem şöyle dedi: \"Muhammed'in nefsini elinde bulundurana yemin ederim ki dediğin doğrudur.\" Hind: \"Ey Allah'ın elçisi, Ebu Süfyan tutumlu bir adamdır. Onun malından alıp ikramda bulunmamda bir mahzur var mıdır?\" diye sordu. Nebi Sallallahu Aleyhi ve Sellem: \"Makul ölçüde olduğu sürece bir mahzur yoktur\" dedi",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 6642,
			"arabicnumber": 6642,
			"text": "Abdullah İbn Mesud r.a. şöyle buyurmuştur: Nebi Sallallahu Aleyhi ve Sellem sırtını deriden yapılmış yemen işi bir direğe yaslamıştı. Ashabına şöyle dedi: \"Cennet ehlinin dörtte biri olmayı ister misiniz?\" Onlar da: \"Evet\" dediler. \"Peki, üçte biri olmayı ister misiniz?\" dedi. Onlar yine \"Evet\" dediler. Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Muhammed'in nefsini elinde bulundurana yemin ederim ki ben sizin cennet ehlinin yarısı olmanızı ümit ediyorum",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 6643,
			"arabicnumber": 6643,
			"text": "Ebu Said el-Hudri şöyle rivayet etmiştir. Bir adam birinin İhlas suresini tekrar tekrar okuduğunu duymuştu. Sanki adam bunu az buluyor gibiydi. Sabah olunca durumu Hz. Nebi Sallallahu Aleyhi ve Sellem'e anlattı. Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Nefsimi elinde bulundurana yemin ederim ki bu süre Kur'an'ın üçte birine denktir",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 6644,
			"arabicnumber": 6644,
			"text": "Enes İbn Malik Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu işitmiştir: \"Rüku ve secdeyi tam yapınız. Nefsimi elinde bulundurana yemin ederim ki ben sırtımın arkasından sizin rüku ve secdenizi görüyorum",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 6645,
			"arabicnumber": 6645,
			"text": "Enes İbn Malik şöyle rivayet etmiştir. Ensardan bir kadın çocukları ile beraber Nebi Sallallahu Aleyhi ve Sellem'in yanına geldi. Hz. Nebi Sallallahu Aleyhi ve Sellem üç kez şöyle buyurdu: \"Nefsimi elinde bulundurana yemin ederim ki siz benim en sevdiğim kimselersiniz.\" Fethu'l-Bari Açıklaması: Nebi s.a.v. nasıl yemin ederdi?: Devamlı ettiği yemin nasıldı? Ya da en çok nasıl yemin ederdi? Bu bölümde dört yemin lafzından söz edilmiştir. Bunlardan biri \"Nefsimi elinde bulundurana yemin ederim\" lafzıdır. \"Muhammed'in nefsini elinde bulundurana yemin ederim\" lafzı da bununla aynıdır. Bu lafzın başında bazen bazen L..i bazen e r-:i getirilmiştir. İkinci lafız \"Hayır, kalpleri değiştirene yemin ederim» lafzıdır. Uçüncüsü \"Allah'a yemin ederim» lafzıdır. Dördüncüsü \"Kabe'nin Rabbine yemin ederim» lafzıdır. i! .uıl lafzının yemin anlamı taşıması lafzından değil, yemin edilmesinden kaynaklanır. Bu lafızların ilki hadislerde en çok varit alandır. İkincisi ile ilgili rivayette bu lafzın da çok kullanıldığına değinilmiştir. İbn Hazm Allah'ın, Kur'an ve sahih sünnette yer alan isimleri ve sıfatları ile yemin edilmiş olacağını, buna muhalefetin kefaret gerektireceğini belirtmişlerdir. Malikilerin ve Hanefilerin görüşü de budur. Bu görüş Şafilerden garip olarak nakledilmiştir. Şafiilerin meşhur görüşüne ve Hanbelilere göre üç çeşit yemin vardır: Bunlardan biri er-Rahman, alemlerin rabbi, mahlukatın yaratıcısı gibi Allah'a has isim ve sıfatlarla edilen yemindir. Bu lafızlar ister tek başına söylensin ister Allah kastedilerek söylensin bunlarla edilen yemin gerçekleşmiş sayılır, bağlayıcıdır. İkincisi Allah hakkında kullanıldığı gibi başka varlıklar için de sınırlı olarak kullanılan rab, hak gibi isim ve sıfatlarla edilen yeminlerdir. Bunlar Allah kastedilerek söylendiğinde bunlarla yemin gerçekleşmiş olur aksi takdirde gerçekleşmez. Üçüncüsü el-hayy, el-mümin, el-mevcut gibi başka varlıklar için de kullanılan isim ve sıfatlarla edilen yeminlerdir. Allah dışında bir varlık kastedilmişse ya da mutlak olarak kullanılmışlarsa bunlarla edilen yemin gerçekleşmiş sayılmaz. Ancak Allah adına yemin etmek kastedilerek bu lafızlarla yemin edilmişse sahih olan görüşe göre bu 'lafızlarla edilen yemin de bağlayıcıdır. Bu başlık altında toplam yirmi hadis naklediimiştir. Birinci hadis (Sa'd dedi ki) Sa'd İbn Ebi Vakkas'tır. Bu hadis Ömer'in menkıbeleri arasında yer almıştır. Orada yeterince şerh edilmiştir. (3683. hadis) (Hayır! Kalpleri evirip çevirene yemin ederim ........ İbn Mace bu hadisi Zühri'den naklen bir başka tarikle ve şu lafızia rivayet etmiştir: \"Nebi s.a.v.'in en çok kullandığı yemin 'Hayır, kalpleri bir halden bir hale evirip çevirene yemin ederim!\" ........ lafzıdır.'' Nebi s.a.v.'in bu lafzın başında \"Hayıri ... demesi önceki sözü nefyetmek içindir. ........... lafzı yemin lafzıdır. Kalpleri çevirmekten kasıt özelliklerinin ve durumunun değişmesidir. Bizzat kalbin değişmesi değildir. Hadis kalbin isteme, sebep oluşturma ve diğer özellikleriyle amellerinin Allah'ın yaratmasıyla gerçekleşeceğine delalet etmektedir. Hadiste Allah'ın Kur'an ve sünnette sabit olan sıfatları ile ona layık bir şekilde besmele çekmenin caiz olduğu hükmü yer almaktadır. Bu hadiste Allah'ın sıfatlarından biri ile yemin edip daha sonra yemininden dönen kimseye kefaret gerekeceği de belirtilmiştir. Bu meselenin temelinde bir ihtilaf bulunmamaktadır. İhtilaf hangi sıfatlarla yemin gerçekleşeceği ile ilgilidir. Doğru olan kalpleri \"bir halden bir hale evirip çeviren\" sıfatı gibi Allah'a has olup başkası hakkında kullanılmayan sıfatlarla yemin edileceğidir. Dördüncü ve beşinci hadisler (Cabir İbn Semüre ve Ebu Hureyre rivayetleri) Kisra helak olduktan sonra da başka kisra yoktur: Bu hadis Nebilik alametleri bölümünün sonunda geçmiştj,(3618. hadis) Burada yeniden ele alınma nedeni Nebi Sallallahu Aleyhi ve Sellem'in yemin etmesidir. Hayır, nefsimi elinde bulundurana yemin ederim ki, beni kendinden de daha çok sevmelisin: En üstün dereceye ulaşmak için senin söylediğin yeterli değildir. Buna benim söylediğim hususu da eklemelisin. Bazı zahitler bu hadisin \"helak olacağını bilsen dahi benim rızamı kendi arzularından öne geçirme dikçe beni sevdiğini iddia edemezsin\" anlamına geldiğini söylemişlerdir. Bu yorum İman kitabının başlarında da yer almıştl.(15. hadis) Ömer radıyallahu anh: \"Evet, Allah'a yemin ederim ki, şimdi seni kendimden de daha çok seviyorum\" dedi. Nebi Sallallahu Aleyhi ve Sellem: \"Şimdi oldu, ey Ömer\" dedi: Ed-Davudi şöyle demiştir: Ömer'in bu mertebeye ulaştığına emin olamadığından Allah adına yalan yere yemin etmemek için önce durup kendini istisna etmiştir. Nebi Sallallahu Aleyhi ve Sellem ona olması gerekeni söyleyince kendini bir kez daha yoklamış ve Nebii kendi nefsinden de daha çok sevdiğine kesin kanaat getirmiş ve yemin etmiştir. El-Hattabi şöyle demiştir: İnsanın kendisini sevmesi doğaldır. Bir başkasını sevmesi ise sebeplere bağlı ve ihtiyaridir. Nebi Sallallahu Aleyhi ve Sellem in-' san doğasını değiştirmek ve çevirmek imkansız olduğu halde, ihtiyari bir sevgi istemiştir. Bu değerlendirmeye şöyle bir cevap verilebilir: Ömer'in ilk verdiği cevap tabiata uygundu. Daha sonra düşünmüş, bir takım delillerden hareketle Hz. Nebii kendinden de daha çok sevdiğini anlamıştı. Kendisinin dünyada ve ahirette helakten kurtulmasına vesile olan ve tercih edilmesi gerekeni haber veren Hz. Nebidi. Ömer bunu anlayıp da gerekeni söyleyince Nebi Sallallahu Aleyhi ve Sellem ona \"Şimdioldu, .ey Ömer\" demiştir. Sekizinci ve dokuzuncu hadisler Ebu Hureyre ve Zeyd İbn Halid'den nakledilen işçi kıssasının şerh i Hudud bölümünde genişçe ele alınacaktır. (6842. hadis) Ne dersiniz, Eslem, Gıfar, Müzeyne ve Cüheyne kabileleri: Bu hadiste yer alan i) kelimesi ........ anlamındadır. Eslem ve diğerlerinden kasıt meşhur kabilelerdir. Bu hadis Nebi Sallallahu Aleyhi ve Sellem'in gönderilişi ile ilgili hadislerin baş tarafında yer almıştır. Burada ele alınma amacı hadiste Nebi Sallallahu Aleyhi ve Sellem'in yemin ederek hayırlı olanı açıklamasıdır. Hayırlı olmanın anlamı çoğunluğun (genelin) çoğunlukla kıyas edilmesi ile olur. Diğer tarafta hayırlı olan kabiledeki bir fertten daha hayırlı bir fert bulunabilmesi mümkündür. On birinci hadis Bir memur görevlendirdi: Bu hadis Allah'ın izniyle Ahkam bölümünde genişçe şerh edilecektir. On beşinci hadis Sa'd İbn Muaz'ın mendilleri ile ilgili el-Bera İbn Azib'in rivayetidir. Bu hadis Menakıp ve Libasta şerh edilmiştir. Bu hadislerde Allah adına yemin etmenin caiz olduğu hükmü yer almaktadır. Bazıları ''Allah'ı yeminlerinizle, iyilik etmenize, takva sahibi olmanıza ve insanların arasını bulmaya engel yapmayın.\"(Bakara, 224) ayetinden hareketle yemin etmeyi mekruh kabul ederler. Zira kişi çoğu kere yeminine bağlı kalmakta aciz olabilir. Burada varit olanlardan hareketle şu netice elde edilir: İtaat konusunda, bir ihtiyaç gereği olarak bir şeyi vurgulamak ya da tazim edilmeyi hak edene tazimde bulunmak için veya bir davada doğru sözlü ise hakim huzurunda yemin etmek caizdir",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 6646,
			"arabicnumber": 6646,
			"text": "Abdullah İbn Ömer r.a.'den şöyle rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem bir kervanda yol alırken Ömer İbn e\\-Hattab'ın babası adına yemin ettiğini işitti ve şöyle buyurdu: \"Dikkat edin, Allah atalarınız adına yemin etmenizi yasaklıyar. Kim yemin edecekse ya Allah adına yemin etsin ya da sussun",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 6647,
			"arabicnumber": 6647,
			"text": "Abdullah İbn Ömer r.a. şöyle demiştir: Babam Ömer, Nebi Sallallahu Aleyhi ve Sellem'in kendisine \"Allah atalarınız adına yemin etmenizi yasaklıyar\" dediğini anlattı. Ömer şöyle demiştir: \"Allah'a yemin ederim ki Nebi Sallallahu Aleyhi ve Sellem'in bu sözünü duyduktan sonra ister kasten ister başkasından naklederek olsun asla böyle yemin etmedim",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 6648,
			"arabicnumber": 6648,
			"text": "Abdullah İbn Ömer r.a.'den rivayet edildiğine göre, Nebi Sallallahu Aleyhi ve Sellem \"Atalarınız adına yemin etmeyin\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 6649,
			"arabicnumber": 6649,
			"text": "Zehdem İbn el-Haris şöyle rivayet etmiştir: Bu kabile ile Eşariler arasında sevgi ve kardeşlik vardı. Bir gün biz Ebu Musa el-Eş'arl'nin yanındaydık. Ona içinde tavuk eti bulunan bir yemek ikram edildi. Ebu Musa'nın yanında Teymullah kabilesinden kızıl bir adam vardı. Sanki mevaliden biriydi. Ebu Musa onu da yerr.eğe davet etti. Adam: Ben tavuğu n bir şey yediğini gördüm, bu nedenle tiksindim ve bir daha tavuk eti yememeye yemin ettim\" dedi. Ebu Musa adama şöyle dedi: \"Bak sana bu konuda ne anlatacağım. Ben Eş'arilerden bir topluluk içinde Nebi Sallallahu Aleyhi ve Sellem'in yanına gitmiştim. Ondan binek istemiştik. O da bize: \"Vallahi size binek vermeyeceğim, yanımda binek hayvanı yok\" dedi. Daha sonra Nebi Sallallahu Aleyhi ve Sellem eganimet malı olarak deve getirildi. O da bizi sorarak: \"Eşariler nerede?\" dedi. Bize beş tane beyaz alınlı deve verilmesini emretti. Develeri alıp yola çıkınca: \"Biz ne yaptık, Nebi s.a.v. bize yanında binek olmadığını söyledi ve binek vermeyeceğine yemin etmişti. Daha sonra da binek verdi. Biz ona yeminini unutturduk. Vallahi asla felah bulamayız\" dedik. Hemen Nebi s.a.v.'in yanına döndük ve ona şöyle dedik: \"Biz binek istemek üzere sana gelmiştik. Ancak sen bineğin olmadığını söylemiş ve bize vermeyeceğine yemin etmiştin.\" Nebi s.a.v. şöyle buyurdu: Size bineği ben vermedim. Allah verdi. Allah'a yemin ederim ki bir konuda yemin ettikten sonra bir başka şeyin daha hayırlı olduğunu görsem hayırlı olanı yapar ve kefaret veririm. Fethu'l-Bari Açıklaması: Dikkat edin, Allah atalarınız adına yemin etmenizi yasaklıyar: Bu rivayet İbn Ebi Şeybe'nin Musannefinde İkrime tarikiyle nakledilmiştir. Bu rivayete göre Ömer radıyalIahu anh şöyle demiştir: \"Bir grupla konuşmuş ve onlara \"Hayır, babam adına yemin ederim ki\" demiştim. O esnada arkadan birinin \"Atalarınız adına yemin etmeyin\" dediğini duydum. Dönüp baktım ki Resulullah Sallallahu Aleyhi ve Sellem şöyle diyordu: \" Mesih sizin atalarınızdan hayırlı olduğu halde, Mesih adına yemin eden helak olmuştur. \" Bu hadis şahitlerle güçlenen mürsel bir rivayettir. Tirmizi bir başka senetle şöyle nakletmiştir: İbn Ömer, bir adamın Ka'be adına yemin ettiğini duymuş ve ona şöyle demiştir: \"Allah'tan başkası adına yemin etme. Ben Nebi s.a.v.'in şöyle buyurduğunu duydum: \"Kim Allah'tan başkası adına yemin ederse küfre düşmüştür ya da müşrik olmuştur.\" Tirmizi bu hadisin hasen, el-Hakim ise sahih olduğunu söylemiştir. Hadiste zikredilen \" küfre düşmüştür ya da müşrik olmuştur\" ifadesi azarlama ve kınamada mübalağa amacıyladır. Allah'tan başkası adına yemin etmenin haram olduğunu söyleyenler bu rivayete dayanmışlardır. Kim yemin edecekse ya Allah adına yemin etsin ya da sussun: Alimler Allah'tan başkası adına yemin etmenin yasaklanmasındaki hikmeti şöyle açıklamışlardır: Bir şeyadına yemin etmek ona tazimde bulunmaktır. 'Oysa hakiki anlamda azamet yalnızca Allah'a mahsustur. Hadis zahiren sadece Allah adına yemin etmekle sınırlı olsa da fakihler Allah adına ve Allah'ın zatı ve yüce sıfatları üzerine yemin edileceğinde ittifak etmişlerdir. Ancak daha önce de anlattığımız üzere, bazı sıfatları üzerine edilen yeminin bağlayıcılığı hususunda ihtilafa düşmüşlerclir. \"Allah'a yemin ederim\" ifadesinde kasıt Allah lafzı değil Allah'ın zatı\" dır. Bir başka şey üzerine yemin yasaklanmıştır. Peki, bu yasaklama haram kılma anlamında mıdır? Malikilerin bu konuda iki görüşü vardır: İbn Dakiki'l-ıd bu yasaklamanın haram kılma anlamına geldiğini belirtmiştir. Malikilerden nakledilen meşhur görüş ise bu yasaklamanın kerahet anlamında olmasıdır. Hanbeliler arasında da bu konuda ihtilaf vardır. Ancak onlar arasındaki meşhur görüş bu yasağın haram kılma anlamında olmasıdır. Zahiriler de bu yasağın haram kılma anlamında olduğunu kesin olarak belirtmişlerdir. İbn Abdilberr, Allah'tan başkası adına yemin etmenin icmaen caiz olmadığını söylemiştir. İbn Abdilberr cevazı nefyederek tahrim ve tenzihten daha geniş anlamı olan keraheti kastetmiştir. Bir başka konuda şöyle demiştir: \"Alimler Allah'tan başkası adına edilen yeminin mekruh olduğu, yasaklandığı, hiç kimsenin bu şekilde yemin etmesinin caiz olmadığı konusunda icma etmişlerdir.\" İmam Şafinin \"Allah'tan başkası adına yemin etmenin masiyet olmasından korkarım\" deyip tereddüt göstermesinden dolayı bu konuda Şafiler arasında ihtilaf bulunmaktadır. Şafinin talebelerinin çoğunluğu bunun tenzihen mekruh olduğu kanaatindedir. EI-Maverdi şöyle demiştir: Hiç kimsenin boşamada, köle azat etmede, adakta Allah'tan başkası adına yemin etmesi caiz değildir. Bir hakim herhangi birini Allah'tan başka bir şeyadına yemin etmeye zorlarsa cehaletinden ötürü o hakimin görevden alınması gerekir. (.......) Kasıtlı olarak yapmak anlamındadır. (......) Başkasından nakletmek anlamındadır. Yani Ömer ister kasıtlı olarak ister başkasından naklederek olsun asla Allah'tan başkası adına yemin etmemiştir. Hadisten çıkarılan sonuçlar Allah'tan başkası adına yemin etmek kınanmıştır. Ömer radıyallahu anh hadisinde her ne kadar sadece atalar adına yemin etmek yasaklanmışsa da, bu, hadisin böyle bir sebepten dolayı varit olmasından kaynaklanmıştır. Ya da atalar adına yemin etmenin yaygın olmasından dolayı özellikle bu tarz yemin yasaklanmıştır. Nitekim bir başka rivayette Kureyş kabilesinin ataları adına yemin ettikleri nakledilmiştir. \"Kim yemin edecekse ya Allah adına yemin etsin ya da sussun\" hadisi de bu genel yasağa delalet etmektedir. Kur'an'da Allah'tan başkası adına edilen yeminlere gelince, bunlarla ilgili iki cevap bulunmaktadır: Birinci cevap: Bu yeminlerde hazif bulunmakta olup \"güneşin rabbi\" ve benzeri anlamlarda takdir edilirler. İkinci cevap: Bu şekilde yemin etmek Allah'a mahsustur. O yarattığı varlıklardan birini yüceltmek isteyince onun adına yemin eder. Bu durum Allah'tan başkası için geçerli değildir. Bu rivayete muhalif olan şöyle bir rivayet de vardır: Nebi s.a.v. bir bedeviye: \"Babası adına yemin ederim ki eğer doğru söylediyse kurtuluşa erer\" demiştir. Bu rivayet, bu şerhin baş kısmında, İman kitabının, 'zekat vermenin İslamıdan kaynaklandığına dair' bölümünde yer almıştı. Bazı hadisçiler bu hadisin metninde yer alan söz konusu ifadenin sahih olmadığı kanaatindedir. İbn Abdilben, bu lafzın gayr-ı mahfuz (şazz) olduğunu, hadisin ravilerinden İsmail İbn Cafer tarafından \"Vallahi\" lafzının nakledildiğini belirtmiş ve şöyle demiştir: \"İsmail İbn Cafer rivayeti, içinde baba adına yeminin bulunduğu diğer rivayete kıyasla tercihe şayandır. Çünkü diğer rivayette sahih hadislerde reddedilen münker bir lafız bulunmaktadır. Üstelik bu lafız İmam Malik'in asıl rivayetinde bulunmamaktadır. Kimisi de bu hadiste bazı ravilerin ..ılı lafzını tashif ile \",,:: :ij okuduklarını ileri sürmüşlerdir. Böyle bir tashifin varlığı muhtemel olmakla birlikte bu gibi durumlar ihtimalden hareketle tespit edilemez. Benzer bir kullanım Ebu Bekir es-Sıddık'ın, kızının (Esmainın) takılarını çalan hırsız hakkında \"Babana yemin olsun, senin gecelerin hiç de bir hırsızın gecesine benzemiyor» ifadesinde de yer almaktadır. Bu kıssa Malik'in Muvatta'ında yer almıştır. Es-Süheyli şöyle demektedir: Benzer bir lafız başka bir merfu hadiste daha yer almıştır. Müslim'de yer alan bu rivayette Nebi s.a.v., hangi sadakanın daha faziletli olduğunu soran kişiye \"Babana and olsun, sana bu sorunun cevabı verilecektir\" demiştir. Bu lafızların hadislerde sabit olması şöyle açıklanabilir: Birincisi: Bu lafızları yemin kastı olmadan söylüyorlardı. Yasaklama yemin kastederek bu lafızların kullanılması hakkındadır. EI-Beyhaki bu kanaattedir. EnNevevi de bu açıklamanın güzelolduğunu söylemiştir. İkincisi: Bu lafızlar iki amaçla kullanılıyordu. Talzim ve telkit. Yasaklama, ta'zim amacıyla kullanılması hakkındadır. Üçüncü cevap: Maverdi ve Beyhaki'ye göre, bu şekilde yemin etmek önceleri caizdi, daha sonra bu cevaz nesh edildi. Es-Sübkı, şarihlerin çoğunluğunun bu kanaatte olduklarını söylemiştir. Dördüncü cevap: Bu yeminin cevabı hazfedilmiştir. Babasının rabbine and olsun, doğru söylediyse kurtuluşa erdi, anlamındadır. Et-Taberi şöyle demektedir: Ömer radıyallahu anh hadisi -bu bö!ümün hadisi kastedilmektedir- sadece Allah adına edilen yeminin bağlayıcı olduğunu ortaya koymaktadır. Kabe üzerine, Adem aleyhisselam üzerine ya da Cebrail üzerine yemin eden kimsenin bu sözüyle yemin sabit olmaz. Yasaklanmış bir amel işlediğinden ötürü bu kişinin tevbe etmesi gerekir ancak kefaret vermesi gerekmez. Kur'an'da yaratılmışlar üzerine edilen yeminler hakkında eş-Şa'bi şöyle demiştir: Yaratan yarattıklarından istediği şey üzerine. yemin eder. Fakat yaratılmışlar ancak yaratan adına yemin edebilirler. Allah'a yemin edip yeminden dönmek, başkası adına yemin edip yemini tutmaktan daha iyidir. Bu rivayet aynı zamanda İbn Mesud, İbn Abbas ve İbn Ömer'den de naklediImiştir. Mutarrif, Abdullah'tan şöyle rivayet etmiştir: Allah mahlukatın dikkatini yemin ettiği şeylere çekmek, bunların yaratıcıya delalet etmeleri ve yaratan katındaki kıymetlerini öğretmek için bu şekilde yemin etmiştir. Alimler başkasının üzerindeki bir hakkından dolayı yemin etmesi gereken kimsenin yalnızca Allah adına yemin edebileceği konusunda icma etmişlerdir. Eğer Allah dışında bir varlık adına yemin etmesi istenir de, yemin etmesi istenen varlığın Rabbi adına yemin ederse bu yemin sayılmaz. İbn Hübeyre, K.itabu'l-icma'da şöyle demiştir: Alimler Allah adına ve Allah'ın isimleri, izzet, celal, ilim, kuvvet ve kudret gibi sıfatları üzerine edilen yeminin geçerli olacağı konusunda icma etmişlerdir. Ebu Hanife ilim ve hak sıfatlarını istisna etmiş, bunlar üzerine edilen yeminleri geçerli kabul etmemiştir. Alimler Allah dışında, Nebi s.a.v. gibi yüce bir varlık adına yemin edilemeyeceği konusunda da ittifak etmişlerdir. Bir rivayete göre Ahmed İbn Hanbel bu konuda tek başına kalarak, bu şekilde de yemin edilebileceğini söylemiştir. Kadı lyaz şöyle demiştir: Allah'ın isim ve sıfatları üzerine edilen yeminin bağlayıcı olduğu konusunda İmam Şafii haricinde, hiçbir bölge alimi arasında bir ihtilaf bulunmamaktadır. İmam Şafii sıfatlar üzerine yemin edilecekse niyetin şart olduğunu, niyet edilmemişse kefaret gerekmeyeceğini söylemiştir. Şafii Allah'a ve Allah'tan başkasına izafe edilebilecek sıfatlarla yemin ederken niyetin gerekli olduğunu belirtmiş, niyet etmemeyi tenkit etmiştir. Ancak kalpleri değiştiren, mahlukatı yaratan, her canlıya rızık veren, alemlerin rabbi, taneyi yaran, rüzgarı yaratan gibi şer'i anlamda yüceitme (tazim) içeren ve sadece Allah'a izafe edilmesi caiz olan sıfatlarla edilen yemin geçerlidir ve bozulması halinde kefaret gerekir. Bu tip yeminler 'vallahi' lafzı gibidir. Şafiilerden nakledilen bir görüşe göre ise sari h olan tek yemin, Allah lafzıdır",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 6650,
			"arabicnumber": 6650,
			"text": "{Ebu Hureyre'den naklen Nebi Sallallahu Aleyhi ve Sellem'in şöyle dediği rivayet edilmiştir: Kim Lat ve Uzza adına yemin ederse, hemen Allah'tan başka bir ilah olmadığını söylesin. Kim arkadaşına: \"Gel kumar oynayalım\" derse, hemen sadaka versin.\" Fethu'l-Bari Açıklaması: Lat, Uzza ve Tağutlar Adına Yemin Edilmez: Lat ve Uzza adına yemin etmek ile ilgili bu bölümde rivayet edilen hadis, en-Necm Süresi tefsirinde açıklanmıştı. Tağutlar adına yemin etme ile ilgili rivayet ise Müslim, Nesai ve İbn Mace'de Abdurrahman İbn Semüre'den merfu olarak nakledilmiştir: \"Tağutlar ve atalarınız adına yemin etmeyin.\" Müslim ve İbn Mace rivayetlerinde 41}O yerine \"Putlar adına yemin etmeyin» anlamında I}O denilmiştir. I}O kelimesi kelimesinin çoğulu olup put anlamındadır. Kafirlerin puta tapırıarak azgınlığa (tuğyana) düşmelerinden ötürü putlar böyle adlandırılmıştır. Yüceltmede veya bir başka hususta haddi aşan herkes tuğyana düşmüştür. Nitekim \"Şüphesiz ki, (tufanda) su haddini aştığı sirada sizleri gemide Biz taşıdık'' (Hakka, 11) ayetinde de suyun taşması tuğyan kelimesi ile anlatılmıştır. 41}O ise tağut kelimesinin çoğuludur. Bu kelimenin anlamı en-Nisa süresinin tefsirinde açıklanmıştı. Alimlerin çoğunluğu Lat, Uzza ve diğer putlar adına yemin eden ya da \"Şunu yaparsam Yahudi olayım veya Hıristiyan olayım ya da İslam'dan yahut Nebiden uzak olayım» diyen kimsenin yemini geçerlidir. Allah'tan bağışlanma dilemelidir. Ancak kefaret vermesi gerekmez. Bu tür sözler sarf ettikten sonra \"La ilahe illailah» demesi müstehaptır. Hanefilere göre bu ifadelerle yemin eden kimsenin de kefaret ödemesi gerekir. Ancak \"Nebiden uzak olayım ya da bidatçi olayım» demişse bu tarz bir yemin kefaret gerektirmez. Hanefiler bu konuda, Allah Teala'nın buyurduğu üzere, zıhar çirkin ve yalan bir söz olduğu halde (Mücadele, 2) zıhar yapanın kefaret vereceği hükmünden hareket etmişlerdir. Bu gibi şeyler üzerine yemin etmek de çirkindir. Bu rivayette bu şekilde yemin eden kimsenin sadece \"La ilah e iHaliah» demesi belirtilmiş, kefaretten söz edilmemiştir. Nitekim gerekliliğine dair bir delilolmadığı sürece kefaret gerekmez. Bu konuda zıharla kıyas yapmaları doğru değildir. Çünkü bu gibi lafızlarla yeminden dolayı vacip gördükleri kefaret zıhar kefareti değildir. Ayrıca kefareti gerekli görmedikleri bazı çirkin sözleri de istisna etmişlerdir. Tüm bunlar yapılan kıyasın sahih olmadığını göstermektedir. Nevevi el-Ezkar'da şöyle demiştir: Bu sözlerle yemin etmek haramdır, te vbe gerektirir. Maverdi ve bir başkası da daha önce aynı görüşü ileri sürmüştür. Ancak haberde belirtildiği şekilde \"La ilahe illailah\" demek gerektiği üzerinde durmamışlardır. İbn Diryas el-Mühezzeb Şerhinde bunu kesin olarak belirtmiştir. Begavi Şerhu's-Sünne'de Hattabi'ye tabi olarak şöyle demiştir: Bu hadiste İslam'a uygun olmayan bir tarzda yemin eden kimsenin günahkar olacağını ancak kefaret vermesi gerekmediğini, tevbe etmesi gerektiğini belirtilmiştir. Zira Nebi Sallallahu Aleyhi ve Sellem ona kelime-i tevhidi söylemesini emretmiştir. Çünkü Lat ve Uzza adına yemin etmek kefaret gerektiren bir duruma benzer, bu kefaret de kelime-i tevhit ile karşılanır. Et-Tibi şöyle demiştir: Lat ve Uzza adına yemin etmenin ardından kumardan bahsedilmesinde şöyle bir hikmet vardır: Lat ve Uzza adına yemin etmek yemin konusunda kafirlerle aynı şeyi yapmaktır. Bu kimseye tevhit emredilmiştir. Kumar oynamaya davet eden kimse de oyunları konusunda kafirlere benzemektir. Bunun kefareti de sadaka vermektir. Hadiste kumar oynamaya çağıran kimsenin kefaret olarak sadaka vermesi emredilmişse kumar oynayan kişinin de sadaka vermesi gereklidir",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 6651,
			"arabicnumber": 6651,
			"text": "İbn Ömer r.a.'den nakledildiğine göre Nebi Sallallahu Aleyhi ve Sellem altından bir yüzük yaptırmıştl. Yüzüğün kaşını, avucunun içine doğru getirerek takıyordu. Bunun üzerine insanlar da kendilerine yüzük yaptırdılar. Daha sonra Nebi Sallallahu Aleyhi ve Sellem minbere çıktı, oturdu, yüzüğü Çıkardı ve: \"Ben bu yüzüğü takıyor, kaşını da avvcmun içine getiriyordum\" dedi. Yüzüğü attıktan sonra da: \"Vallahi, bunu bir daha takmayaeağım\" buyurdu. İnsanlar da yüzüklerini çıkardılar. Fethu'l-Bari Açıklaması: Yemin etmesi istenmediği halde yemin eden kişi: Nebi s.a.v.'in nasıl yemin ettiğine dair bölümde bu konuda çok fazla örnek zikredilmişti. Musannif, burada da Nebi s.a.v.'in altın yüzük takması ile ilgili İbn Ömer'den radıyalli'ıhu anh nakledilen bir rivayete yer vermiştir. Bu hadisin şerhine Libas kitabının sonunda genişçe yer verilmişti. Bazı Şafii ilim adamlarına göre itaat ile ilgili meseleler haricinde, istenmediği halde yemin etmek mekruhtur. İbnu'l-Müneyyir şöyle demiştir: Bu bölüm başlığında kastedilen' \"Allah'ı yeminierinizle, iyilik etmenize, takva sahibi olmanıza ve insanlann arasını bulmaya engel yapmayın\"(Bakara, 224) ayetinde kastedilen ile aynıdır",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 6652,
			"arabicnumber": 6652,
			"text": "Sabit bin Dahhak'tan nakledildiğine göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"İslam dışında bir din adına yemin eden kimse, söylediği gibidir. Bir kimse kendisini bir şeyle öldürürse cehennemde de o şey ile azap görür. Mümine lanet etmek onu öldürmek gibidir. Müminin kafir olduğunu söylemek onu öldürmek gibidir. Fethu'l-Bari Açıklaması: İslam dışında bir din adına yemin eden kimse: Din kelimesi tüm dinleri kapsar. Yahudilik, Hıristiyanlık, Mecusilik, Sabillik, puta tapınmak, Dehrilik, Muattıla, şeytana ve meleklere tapınmak ve diğerleri birer dindir. Musannif bu şekilde yemin eden kimsenin kafir olup olmayacağını kesin olarak belirtmemiştir. Ancak \" Kim Lat ve Uzza adına yemin ederse, hemen Allah'tan başka bir ilah olmadığını söylesin\" hadisini mu allak olarak naklettikten sonra Nebi s.a.v.'in bu kimseleri küfre nispet etmediğini belirtmiştir. Bu şekilde yemin eden kimsenin sadece Allah'tan başka bir ilah olmadığını söylemesi emrediimiş, şehadetin ikinci kısmını söylemesi istenmemiştir. Eğer küfre girmiş olsaydı iki şehadeti de söylemesi gerekirdi. İbnu'I-Münzir, \"Şunu yaparsam Allah'ı inkar etmiş olayım\" deyip de daha sonra o işi yapan kimsenin durumunun ihtilaflı olduğunu söylemiştir. İbn Abbas, Ebu Hureyre, Ata, Katade ve fakihlerin çoğunluğu bu kimsenin kefaret vermesi gerekmediğini, kMir olmayacağını söylemişlerdir. Ancak küfrü kalbinde gizlemiş olması durumunu hariç tutmuşlardır. EI-Evzai, es-Sevri, Hanefiler, Ahmed İbn Hanbel ve İshak İbn Rahuye bunun da bir çeşit yemin olduğunu ve bu kimsenin kefaret vermesi gerektiğini belirtmişlerdir. İbnu'l-Münzir birinci görüşün daha doğru olduğu kanaatindedir. Zira hadiste \"Kim Lat ve Uzza adına yemin ederse, hemen Allah'tan başka bir ilah olmadığını söylesin\" buyrulmuş, ancak kefaretten söz edilmemiştir. Bir başkası şöyle demiştir: Bu nedenle hadiste \"İslam dışında bir din adına yemin eden kimse söylediği gibidir\" buyrulmuş, kimse böyle bir yemine cür'et etmesin diye sert bir dil kullanılmıştır. Maliki ilim adamlarından Ebu'I-Hasan el-Kassar Hanefiler'in bu durumda kefareti gerekli görürken yeminin bir fiilden kaçınmak ve zikredilen lafızlarla İslam'ı yücelterek sözlerine kefil getirmek olmasından hareket ettiklerini nakletmiştir. Ancak daha sonra onların \"İslam hakkı için\" diyerek yemin edip bu yeminden dönen kimseye kefaret düşmeyeceğini, İslam'ı açıkça yücelterek yemin etme halinde kefaret gerekeceğini ancak bu yüceltmenin net olmadığı durumlarda kefaret gerekmediğini söylediklerini belirterek bu rivayeti sorgulamıştır. Bir kimse kendisini bir şeyle öldürürse cehennemde de o şey ile azap görür: İbn Dakik el-Id şöyle demiştir: Bu, dünyada işlenen suçların ahirette nasıl cezalandırılacağı ile ilgili rivayetlerden biridir. Bir insanın kendisini öldürmesi bir başkasını öldürmesi gibi günahtır. Çünkü canı kendi mülkü değildir. Aksine can Allah'ın mülküdür. İnsan canı hakkında ancak Allah'ın izin verdiği ölçüde tas arrufta bulunabilir. Bu hadis, kısası, hadlerde belirlenen şekilde vacip görenlerin hilafına, mümasil olarak vacip görenler için de delil teşkil etmektedir. Ancak İbn Dakik el-Id, Allah'ın ahkamının filleriyle kıyaslanamayacağını söyleyerek bu fikri reddetmiştir. Allah'ın ahirette yapacağını bildirdiği her şeyin dünyada kullar için meşru olacağı söylenemez. Ateşte yakmak, bağırsakları parçalayacak kadar kaynar su içirmek benzeri filler böyledir. Sonuç olarak, mümasil kısasa delil getirmek için bu hadis dışında başka bir delil gereklidir. Nitekim bu konuda \" Bir kötülüğün cezası onun gibi bir kötülüktür\"(Şura, 40) ayeti ile istidlalde bulunulmuştur. Bu mesele, Allah dilerse, Kısas ve Diyetler Bölümünde açıklanacaktır",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 6653,
			"arabicnumber": 6653,
			"text": "Ebu Hureyre r.a. Nebi Sallallahu Aleyhi ve Sellem'den şöyle işittiğini nakletmiştir: \"Allah İsrailoğullarından üç kişiyi sınamak istedi. Bunlardan alaca hastalığına tutulana bir melek gönderdi. Melek adama: \"Yolda kaldım. Önce Allah'ın sonra senin yardımınla istediğim yere ulaşabilirim\" dedi .. Fethu'l-Bari Açıklaması: Allah dilerse ve sen dilersen\" demesin. Peki, \"Önce Allah'ın sonra senin yardımın/a\" diyebilir mi?: EI-Mühelleb şöyle demiştir: Buhari burada \"Önce Allah sonra sen dilersen\" demenin caiz olduğunu belirtmiş ve bu hususta meleğin \"Önce Allah sonra senin yardımınla',' demesini delil getirmiştir. Bu ifadenin caiz olması arada zikredilen \"sonra\" lafzına bağlıdır. Bu konuda Nebi s.a.v.'den de hadis nakledilmiştir. Çünkü Allah'ın dilem?si insanın dilemesinden öncedir. Bu konuda nakledilen hadis kendi şartlarına uygun olmadığından Buhari, bu hadisi bölüm başlığında ele almış daha sonra kendi şartlarına uygun olan sahih hadisi delil getirmiştir",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 6654,
			"arabicnumber": 6654,
			"text": "Bera r.a. şöyle demiştir: Nebi Sallallahu Aleyhi ve Sellem bize yeminimizi yerine getirmeyi emretti",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 6655,
			"arabicnumber": 6655,
			"text": "Usame'den şöyle rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem'in kızlarından biri Nebi Sallallahu Aleyhi ve Sellem'e oğlunun can çekiştiği haberini gönderdi. Nebi Sallallahu Aleyhi ve Sellem'in yanlarına gelmesini istedi. O sırada Nebi Sallallahu Aleyhi ve Sellem'in yanında Usame İbn Zeyd, Said ve babam ya da Ubeyy vardı. Nebi Sallallahu Aleyhi ve Sellem, Kızına selam göndererek şöyle haber yolladı: \"Alan da veren de Allah'tır. Onun katında her şey yazılıdır. Sabretsin ve sevabını Allah'tan beklesin.\" Ancak kızı yemin ile tekrar haber gönderdi. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem kalktı, biz de onunla beraber kalktık. Oraya varıp oturunca çocuk yanına getirildi, Nebi Sallallahu Aleyhi ve Sellem çocuğu kucağına oturttu. Çocuk zorlukla nefes alıp veriyordu. Nebi Sallallahu Aleyhi ve Sellem'in gözleri doldu. Sa'd: \"Neler oluyor ey Allah'ın elçisi\" dedi. Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Bu, Allah'ın dilediği kullarının kalbine yerleştirdiği merhamet duygusudur. Allah merhametli kullarına rahmet eder",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 6656,
			"arabicnumber": 6656,
			"text": "Ebu Hureyre Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu rivayet etmiştir: \"Üç evladını yitiren hiçbir müslümana cehennem ateşi isabet etmez. Ancak yemin kefareti borcu olması durumu müstesnadır",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 6657,
			"arabicnumber": 6657,
			"text": "Harise İbn Vehb Nebi Sallallahu Aleyhi ve Sellem'den şöyle dinlediğini nakletmiştir: \"Size cennet halkının kimler olduğunu söyleyeyim mi? Bunlar zayıf düşürülmüş kimselerdir. Allah adına yemin etseler Allah yeminlerini tutmalarını sağlar. Cehennem halkı ise kaba, batıl yolda başkaları ile mücadele eden, kendini beğenmiş kimselerdir.\" Fethu'l-Bari Açıklaması: Allah Tealanın \"Olanca güçleri ile Allah adına yemin ettiler\" (el-En'am, 61109) buyurması: Ragıb el-Isfahanı şöyle demiştir: \"Kasem yemin demektir. Kasem kelimesi 'kasame' kökünden gelmektedir. 'Kasame' ise maktulün velilerine yemin ettirmektir. Daha sonra bu kelime her tür yemin hakkında kuııanılmıştır. Ragıb şöyle demiştir: (Olanca güçleri ile yemin etmek) yemin ederken kapasitelerinin son haddinde yemin etmeye çalışmak anlamındadır. ibnu'l-Münzir şöyle demektedir: Allah adına yemin ettiğini söylemek ile sadece yemin ettiğini söylemek ile ilgili ihtilaf edilmiştir. Bazıları sadece yemin ettiğini söylemenin de yemin kastedilmese dahi yemin anlamına geleceğini belirtmişlerdir. Bu görüş İbn Ömer ve ibn Abbas'tan nakledilmiştir. İbrahim en-Nehaı, Süfyan es-Sevri ve Kufeliler bu kanaattedir. Çoğunluk ise, niyet edilmemişse, bunun yemin olmayacağı kanaatindedirler. İmam Malik şöyle demiştir: \"Aııah'a yemin ederim demek yemindir. Ancak sadece yemin ederim demek ancak yemine niyet edilmişse yemindir.\" imam eş-Şafiı şöyle demiştir: \"Sadece yemin ettiğini söylemek niyet etse dahi yemin sayılmaz. Allah'a yemin ederim demek de niyet edilirse yemindir.\" ibnu'l-Münir el-Haşiye'de şöyle demiştir: Buhari, 'yemin ederim' demenin yemin olmayacağını söyleyenlerin görüşünü reddetmektedir. Bu hususta, ilgili ayeti nakletmiştir. Bu ayette Allah adına kasem etmekten söz edilmiştir. Böylelikle kasem lafzı ile Allah lafzının bir arada zikredilmesinin hadislerde şart koşulmadığını açıklamıştır. Hadisler sadece kasem lafzının yemin anlamına geldiğine işaret etmektedir. Yemin eden kimsenin dışındakiler için de yemini yerine getirmek menduptur. Bu hadisin diğer bölümleri el-Cenaiz kitabında yer almaktadır. Hadiste söz edilen zayıf kimseler fakirler ve zayıf düşürülenlerdir. Bu hadisin şerhi Nur Süresinin tefsirinde genişçe anlatılmıştır. (Aııah adına yemin etseler Allah yeminlerini tutmalarını sağlar.) Bir şey yapmak için yemin etseler Aııah keremi ile onun yeminini yerine getirmesini ister, yeminınin gereğini ona yaptırır, böylece o da yeminini yerine getirmiş olur. Bu ifade kişinin duasının kabul edilmesi anlamında kinayedir",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 6658,
			"arabicnumber": 6658,
			"text": "Abdullah'tan şöyle rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem'e kimlerin en hayırlı insanlar olduğu soruldu. Şöyle cevap verdi: Benim dönemimde yaşayanlar. Sonra onların ardından gelenler, daha sonra da onların ardından gelenler. Daha sonra öyle bir topluluk gelir ki onların şahitlikleri yeminden, yeminleri şahitlikten öncedir.\" Fethu'l-Bari Açıklaması: \"Allah'ı şahit tutarım\" ya da \"Allah'ı şahit tuttum\" demek: Bu ifadeler yemin anlamına gelir mi? Bu konuda ihtilaf edilmiştir. Hanefiler ve Hanbeliler bunun da yemin olduğunu söylemişlerdir. İbrahim en-Nehai ve Süfyan es-Sevri de bu kanaattedir. Hanbeliler'e göre tercihe şayan görüş Allah adı zikredilmese dahi şahit olmak yemin etmektir. Rebia ve el-Evzai bu kanaattedir. Şafiilere göre Allah lafzı zikredilerek şahit olunursa bu yemin sayılır. Aslında tercih edilmesi gerekli görüşe göre bu ifade bir kinayedir ve niyete gerek vardır. Şafii el-Muhtasar'da bu şekilde belirtmiştir. Çünkü Allah'ın emri ile veya O'nun birliği üzerine şahitlik ederim anlamındadır. Çoğunluk bu görüştedir. Bu hadis Şahitlikler kitabında ayrıntılı olarak şerh edilmiştir. (2652 no'lu hadis) (Onların şahitlikleri yeminden, yeminleri şahitlikten öncedir) Tahavi şöyle demiştir: O kadar çok yemin ederler ki yemin etmek bir alışkanlık haline gelir. Kendilerinden yemin etmeleri istenmeyen zamanlarda ve yemin etmeleri istenmeden önce dahi yemin ederler. Bir başka ilim adamı şöyle demiştir: Şahitliğinin doğru olduğunu belirtmek için henüz şahitlik etmeden önce ya da şahitlikten sonra yemin ederler. Şahitler hakemden önce böyle davranırsa şahitlikleri düşer. Bu ifadeden kastın şahitlik yapmak ve yemin etmek konusunda acele etmek ve hırslı olmak, tecrübesizlikten dolayı önce nasıl başlayacağını bilmemek anlamına geldiği de söylenmiştir. (Şahitlik ve anlaşma için yemin etmek) Birimizin 'Allah'ı şahit tutarım, Allah adına söz veririm' demesidir. İbn Abdilben bu görüştedir. Bu konu Şahitlikler kitabında ele alınmıştır",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 6660,
			"arabicnumber": 6660,
			"text": "Ebu Hureyre Nebi Sallallahu Aleyhi ve Sellem'den naklen şöyle rivayet etmiştir: Bir adam cennet ve cehennem arasında kalır ve şöyle der: Rabbim, yüzümü cehennem tarafından çevir. Senin izzetin adına yemin ederim ki senden başka bir şey istemeyeceğim",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 6661,
			"arabicnumber": 6661,
			"text": "Enes İbn Malik r.a.'den şöyle rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: Cehennem durmaksızın daha fazla yok mu der. Nihayet izzetin rabbi oraya kademini koyar, cehennem de \"Yeter, yeter\" der ve bir kısmı diğer kısmına yaklaşır. Fethu'l-Bari Açıklaması: AÇIKLAMA’DAN SONRA –Lİ UMRİLLAH BAB’I VAR Allah'ın izzeti, sıfatları ve kelimeleri adına yemin etmek: Bu başlıkta genel, özele, özel de genele atfedilmiştir. Çünkü sıfatlar izzetten ve kelimelerden geneldir. 'Atalar adına yemin etmeyin' başlığı altında bu duruma işaret edilmişti. Yeminler sarih, kinayeli ve ikisi arasında olmak üzere farklı kısımlara ayrılırlar. İkisi arasında olanlar sıfatlardır. Sıfatların sarih yemine dahil olup olmadığı, sıfatlarla yemin ederken niyete gerek olup olmadığı ihtilaflıdır. Tercih edilen görüşe göre, zati sıfatların bir kısmı sarih yemine dahildir. Kişi hakları ile ilgili böyle bir yemin edilmişse bu yeminde gizli saklı bir yön kalmamaktadır. Fiili sıfatlar ise kinayeye dahildir. Allah'ın izzeti zati sıfatlardandır. Celal ve azameti de öyledir. Beyhaki'nin Marife'de açıkladığına göre Şafii şöyle demiştir: \"Kim Allah'ın hakkı, azameti, celali, kudreti adına yemin ederse yemin etmeyi ister kastetmiş olsun ister olmasın yemin etmiş sayılır.\" (Ebu Hureyre şöyle demiştir) Ebu Said şöyle demiştir: Nebi Sallallahu Aleyhi ve Sellem Allah'ın şöyle buyurduğunu söylemiştir: \"Sana istediğin şeyin on katı verilecektir.\" Bu hadis haşır ile ilgili uzun bir hadisin özeti olup Rikak kitabının sonunda yeterince şerh edilmiştir. (6573 nolu hadis) \"Senin izzetin adına yemin ederim ki senden başka bir şey istemeyeceğim.\" diyen adamın sözüne karşılıktır. Nebi Sallallahu Aleyhi ve Sellem'in bu ifadeyi zikretmesi bu yemini takrir etmek olup böyle bir ifadenin yemin olacağına delalet etmektedir",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 6662,
			"arabicnumber": 6662,
			"text": "Zühri'den şöyle rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem'in eşi Hz. Aişe'nin, ifk hadisesi ile ilgili dedikodular ve Allah'ın onun günahlardan uzak olduğunu buyurması ile ilgili rivayetini Urve İbn Zübeyr, Said İbn el-Müseyyeb, Alkame İbn Vakkas ve Ubeydullah İbn Abdullah'dan dinledi m. Bunların her biri bana hadisin bir kısmını anlattılar. Bu olayların ardından Nebi Sallallahu Aleyhi ve Sellem kalkıp Abdullah İbn Übey'in özür dilemesini istemişti. Üseyd İbn Hudayr Sa'd İbn Ubade'ye: \"Allah'ın hayatı adına yemin ederim onu (İbn Übey'i) öldüreceğiz\" demişti. Fethu'l-Bari Açıklaması: Kişinin liumrillah yani, \"Allah'ın hayatı adına\" demesi yemin sayılır mı? Bu sorunun cevabı li umri sözünün tefsirine bağlıdır. Bu nedenle musannif İbn Abbas'ın rivayetini nakletmiştir. Bu rivayet Hicr Suresinin tefsirinde geçmiştir. İbn Ebi Hatim bu rivayeti mevsul olarak nakletmiştir. İbn Ebi'I\"Cevza'nın İbn Abbas'tan rivayetine göre de li umrike hayatın hakkı için anlamındadır. Ebu'I-Kasım ez-Zeccac şöyle demiştir: Ömür hayat demektir. Bu nedenle li umrillah diye yemin eden kimse Allah'ın bekası adına yemin etmiş demektir. Bu lafızda yer alan lam harfi te'kit içindir. Cümlenin haberi mahzuftur. Bu mahzuf haber ise \"yemin ederim'' olarak edilir. Bu nedenle Malikiler ve Hanefiler bu lafızia yeminin geçerli olacağını, çünkü beka'nın Allah'ın zati sıfatlarından biri olduğunu söylemişlerdir. İmam Malik bu lafızIa yemin etmekten hoşlanmadığını söylemiştir. İshak İbn Rahuye Musannefinde Abdurrahman İbn Ebi Bekre'den şöyle rivayet etmiştir: Osman İbn Ebi'I-As li umri 'hayatım hakkı için' diye yemin ederdi. . Şafii ve İshak şöyle demiştir: Bu lafız ancak yemin niyetiyle kullanılırsa geçerli bir yemin olur. Çünkü ilim ve hak adına da yemin edilir ve ilimle ma'lum, hak ile de Allah'ın vacip kıldıkları kastedilir. Ahmed İbn Hanbel'den bu iki mezhebin görüşünün aynısı nakledilmiştir. Ahmed İbn Hanbel'in tercih edilmesi gereken görüşü ise İmam Şafii'nin görüşü ile aynı olandır. Allah kendi yarattıklarından dilediği adına yemin eder. Allah'ın bu şekilde yemin etmesi başkalarının Allah'tan başkası adına yemin edebileceğine delalet etmez. Musannifin burada ifk hadisini nakletme amacı Useyd İbn Hudayr'ın li umrillah Iafzı ile yemin ederek İbn Ubey'i öldüreceğini söylemesidir. Bu hadis Nur Suresi tefsirinde yeterince açıklanmıştır",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 6663,
			"arabicnumber": 6663,
			"text": "Hişam babasından naklen Aişe r.anha'nın \"Allah sizi yeminlerinizdeki lağiv'den (yemin niyeti olmadan yemin sözlerini söylemek'ten) dolayı sorumlu tutmaz\" ayetinin \"hayır vallahi\" gibi sözler hakkında nazil olduğunu söylemiştir. Diğer tahric: Ebu Davud (3254); Nesa (s-kübra), 11084; İbn Hibban (4333)",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 6664,
			"arabicnumber": 6664,
			"text": "Ebu Hureyre merfu olarak şöyle rivayet etmiştir: \"Aııah ümmetime, kalbine giren vesveselere karşı, bunlarla amel etmedikçe ve bunlardan söz etmediği sürece, müsamaha göstermiştir",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 6665,
			"arabicnumber": 6665,
			"text": "Abdullah İbn Amr İbn eı-As şöyle rivayet etmiştir: \"Nebi Sallallahu Aleyhi ve Sellem Kurban Bayramı hutbesi okurken bir adam ayağa kalkıp: \"Ey Allah'ın elçisi ben (hac menasikinin) şöyle şöyle yapılacağını sanıyordum\" dedi. Ardından bir başka adam kalktı: \"Ey Allah'ın elçisi ben şu üç rüknün (tıraş olma, kurban kesme ve şeytan taşlama) şöyle şöyle yapılacağını sanıyordum\" dedi. Nebi Sallallahu Aleyhi ve Sellem onlara: \"Bildiğiniz gibi yapın, bir sakınca yoktur, hepsinin günü aynıdır\" buyurdu. O gün Nebi Sallallahu Aleyhi ve Sellem'e ne sorulduysa o: \"Öyle de yapabilirsiniz, bir sakınca yoktur\" diye cevap verdi",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 6666,
			"arabicnumber": 6666,
			"text": "İbn Abbas r.a. şöyle demiştir: Bir adam Nebi Sallallahu Aleyhi ve Sellem'e: \"Şeytan taşlamadan önce tavaf ettim\" dedi. Nebi Sallallahu Aleyhi ve Sellem: \"Bir sakıncası yoktur\" buyurdu. Bir .başkası: \"Kurban kesmeden önce tıraş oldum\" dedi. Nebi Sallallahu Aleyhi ve Sellem: \"Bir sakıncası yoktur\" buyurdu. Bir başkası: \"Şeytantaşlamadan önce kurban kestim\" dedi. Nebi Sallallahu Aleyhi ve Sellem: \"Birsakıncası yoktur\" buyurdu",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 6667,
			"arabicnumber": 6667,
			"text": "Ebu Hureyre şöyle rivayet etmiştir: Bir adam namaz kılmak için mescide geldi. Nebi Sallallahu Aleyhi ve Sellem de mescidin bir köşesindeydi. Adam Nebi Sallallahu Aleyhi ve Sellem'e selam verdi. Nebi Sallallahu Aleyhi ve Sellem ona: \"Git, bir daha namaz kıl, sen namaz kılmadın\" dedi. Adam geri döndü, bir daha namaz kıldı, ardından Nebi Sallallahu Aleyhi ve Sellem'e selam verdi. Nebi Sallallahu Aleyhi ve Sellem selama .J diye karşılık verdikten sonra: \"Git, bir daha namaz kıl, sen namaz kılmadm» buyurdu. Bu durum üçüncü kez tekrarlayınca adam Nebi Sallallahu Aleyhi ve Sellem'in kendisine namaz kılmayı öğretmesini istedi. Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Namaz kılacağm zaman güzelce abdest al, daha sonra kıbleye yönel, tekbir getir. Kur'an'dan kolayına geleni oku. Daha sonra tüm azaların yerli yerine oturacak şekilde rüko. et. Daha sonra dimdik ayakta duracak kadar başını kaldır. Daha sonra tüm azaların yerli yerine oturacak şekilde secde et. Daha sonra dimdik olacak ve azaların yerli yerine gelecek şekilde otur. Daha sonra yine azaların yerli yerine oturacak şekilde secde et. Daha sonra dimdik ayağa kalk. Bunları tüm namazın boyunca yap.»",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 6668,
			"arabicnumber": 6668,
			"text": "Aişe r.anha'dan şöyle rivayet edilmiştir: Müşrikler Uhud Savaşında çok bariz bir biçimde yenilgiye uğramışlardı. İblis: \"Ey Allah'ın kulları, arkanıza bakın» diye seslendi. Öndeki askerler geri döndü ve arkadakilerle savaşmaya başladılar. (Müslümanlarla müşrikler birbirine karışmıştı) O esnada Huzeyfe İbn el-Yeman babasını gördü: \"Babam, babam» diye (etrafındakilere) bildirmeye çalıştı. Aişe r.anha şöyle dedi: \"Allah'a yemin ederim ki, Müslümanlar bunu anlamadı, uzaklaşmayıp Huzeyfe'nin babasını öldürdüler. Huzeyfe: \"Allah sizi affetsin» dedi. Urve şöyle diyor: \"Allah'a yemin ederim ki Huzeyfe vefat edinceye kadar üzerinde bu olayın tesiri vardı.»",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 6669,
			"arabicnumber": 6669,
			"text": "Ebu Hureyre'den naklen Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğu rivayet etmiştir: \"Kim oruçluyken unutarak yerse orucuna devam etsin. Onu yediren ve içiren Allah'tır.»",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 6670,
			"arabicnumber": 6670,
			"text": "Abduııah İbn Buhayne şöyle rivayet etmiştir: \"Nebi Sallallahu Aleyhi ve Sellem bize namaz kıldırdı, ilk iki re kattan sonra oturmadan ayağa kalktı. Namaza devam etti. Namazı bitirince herkes onun selam vermesini bekledi 'ama o tekbir getirerek iki kez secdeye gitti. Ardından şöyle dedi: \"Bu iki secde namazını uzun ya da kısa kıldığından emin olamayan kimse içindir. Bu kişi doğru olanı bulmaya çalışır, namazın kalanını tamamlar ve ardından bu iki secdeyi yapar.»",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 6671,
			"arabicnumber": 6671,
			"text": "İbrahim Alkame vasıtasıyla İbn Mesud'dan şöyle rivayet etmiştir: Nebi Sallallahu Aleyhi ve Sellem onlara öğle namazını kıldırmış, ancak bu namazı kısa ya da uzun kılmıştır. Mansur diyor ki: Bu hususta İbrahim mi Alkame mi yanıldı, bilemiyorum. Ashab Nebi Sallallahu Aleyhi ve Sellem'e \"Şöyle şöyle kıldın» deyince Nebi Sallallahu Aleyhi ve Sellem iki secde yaptı ve şöyle buyurdu: \"Bu iki secde namazını uzun ya da kısa kıldığını bilmeyen kimse içindir. Bu kimse doğruyu araştırır, namazını tamamlar daha sonra bu iki secdeyi yapar.»",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 6672,
			"arabicnumber": 6672,
			"text": "Ubey ibn Ka'b Nebi Sallallahu Aleyhi ve Sellem'in şöyle dediğini işitmiştir: \"Unuttuğum şeyden dolayı bana çıkışma; şu işimde de bana güçlük çıkarma!\"(Kehf, 73) dedi. Musa bu ilk sözünü unutarak söylemiştir.»",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 6673,
			"arabicnumber": 6673,
			"text": "Şa'bi şöyle demiştir: el-Bera' İbn A'zib bir misafirleri olduğunu ve hanımına kendisi eve gelmeden önce misafirin de yiyebilmesi için kurban kesmelerini söylemişti. Onlar da namazdan önce kurban kesmişlerdi. Bu durumu Nebi Sallallahu Aleyhi ve Sellem'e anlattıklarında Nebi Sallallahu Aleyhi ve Sellem, yeniden kurban kesmeleri gerektiğini söyledi. El-Be ra ise iki kurbanlık koyun değerinde, süt veren besili dişi bir keçisi olduğunu söyledi",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 6674,
			"arabicnumber": 6674,
			"text": "Cündeb şöyle demiştir: Nebi Sallallahu Aleyhi ve Sellem bayram namazı kıldırdı, ardından hutbe okudu, sonra şöyle buyurdu: \"Kim kurban kestiyse onun yerine bir daha kessin. Kesmeyenler de Allah'ın adıyla kessinier.\" Fethu'l-Bari Açıklaması: (Unutarak yemini bozmak) Kefaret gerektirir mi gerektirmez mi? , \"Hata etmenizden dolayı size bir günah yoktur\" Kasıtlı olmadıkça unutarak ya da zorlanarak yemininden dönen kişinin yemininin bozulmuş sayılmayacağı fikrini ileri sürenler bu ayete dayanmışlardır. Bu ayete dayanılarak kişiye şer'i anlamda yeminden dönme fiili nispet edilmemiştir. Zira ayette kişi böyle bir fiili işlememiş kabul edilerek haram hükmü kaldırılmıştır. Selef alimleri bu konuda farklı görüşler ileri sürmüşlerdir: Boşama ve köle azadı yukarıdaki hükümden istisna edilmiştir. Bilmeden ya da unutarak dahi olsa bunlardan dolayı kefaret gerekir. Ancak yeminler konusunda unutma ya da bilmemek söz konusu ise kefaret gerekmez. İmam Şafii'den ve Ahmed İbn Hanbel'den nakledilen bir rivayet bu yöndedir. Şafiler'in tercih edilen görüşüne göre ise boşama, köle azadı ve yeminler bu konuda eşittir ve unutma söz konusu ise hiç biri için kefaret gerekemez. (Bunlarla amel etmedikçe ve bunlardan söz etmediği sürece) İsmalll şöyle demiştir: Bu hadiste unutmaktan söz edilmemiştir. Burada insanın hatırına gelenler kastediimiştir. Buhari'nin kastı, unutmaktan kaynaklanan davranışlara müsamaha ile bakmaktır. Çünkü unutmak kalbin amellerindendir. Kirmani şöyle demiştir: Buhari hata ve unutma ile vesveseyi kıyaslamıştır. Aynı şekilde alışkanlık haline getirmek söz konusu değilse hata ve unutmaya itibar edilmez. Unutan ve yanılan bunu alışkanlık haline getirmiş olmamalıdır. Hadisin zahirinden anlaşılan amelden kastın azalarla amel olmasıdır. Çünkü \"amel etmedikçe\" ibaresi başlangıç aşamasında hiçbir şeyden dolayı sorgu olmayacağı fikrini vermektedir. Bu konuyla ilgili Rikak Kitabının sonlarında yer alan \"Kim bir günah işlemeyi aklına getirirse bu günah yazılmaz\" hadisi etrafında açıklama yapılmıştı. Bu hadiste Hz. Muhammed'in ümmetinin, yüceliğine işaret edilmiştir. Zira Nebi Sallallahu Aleyhi ve Sellem \"Allah bana müsamaha gösterdi\" buyurmuştur. Hadiste ümmetin bu konuda diğer ümmetlerden ayrıldığına işaret edilmiştir. Bazıları unutan kişinin durumunun günahı kasten işleyenle aynı olduğunu söylemiş bunun bizden önceki ümmetler için günah olan hususlardan olduğunu söylemişlerdir. Müslim'de Ebu Hureyre'den nakledilen •bir rivayet bu durumu desteklemektedir: \"Nefislerinizde olanı gizleseniz de açıklasanız da Allah ondan dolayı sizi hesaba çeker\" ayeti nazil olunca bu hüküm sahabilere çok ağır geldi. Hadiste sahabilerin bu konudaki şikayetlerizikredilmiştir. Nebi Sallallahu Aleyhi ve Sellem bu şikayetler karşısında onlara \"Siz de ehl-i kitap gibi işittik ve isyan ettik mi demek istiyorsunuz? Bilakis işittik ve itaat ettik deyiniz\" buyurdu. Onlar da öyle dediler. Bunun üzerine \"O Nebi Sallallahu Aleyhi ve Sellem, kendisine Rabbinden indirilene iman etti\" diye başlayan ve içinde \"Rabbimiz, unuttuk yahut yanıldıysak bizi sorguya çekme!\" ifadesi yer alan el-Baka ra suresinin son ayetleri nazil oldu. Beşinci hadis Uhut Savaşı'nda Huzeyfe'nin babası el-Yeman'ın öldürülmesi hakkındadır. Bu hadis Menakıb Kitabı'nın sonlarında Uhut Gazvesi ile ilgili bölümde yeterince şerh edilmiştir. Huzeyfe vefat edinceye değin hayırlı bir kimse idi. Yanlışlıkla babasını öldüren müslümanlara \"Allah sizi affetsin\" demesinden ötürü hayırlı bir kimse olmuştu. Ölünceye değin de hayırlı bir kimse olarak kaldı. Hadisin sonunda belirtilen, Huzeyfe'nin üzerinde bu olayın tesirinin kalmasından kasıt bu durumdur",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 6675,
			"arabicnumber": 6675,
			"text": "Abdullah İbn Amr Nebi Sallallahu Aleyhi ve Sellem'in şöyle dediğini rivayet etmiştir: Büyük günahlar Allah'a şirk koşmak, ana babaya isyan etmek, adam öldürmek ve yalan yere yemin etmektir. Bu hadis aynca 6780 ve 6920'de de yer almaktadır. Fethu'l-Bari Açıklaması: Yalan yere yemin etmek gamus yemini olarak adlandırılmıştır. Çünkü sahibini günaha ve daha sonra ateşe düşürür. İbnu't-Tin, yalan yere yemin etmenin kişiyi günaha düşüreceğini söylemiştir. Bu nedenle İmam Malik bu yeminin kefareti olmadığını belirtmiş ve \"Sizi bağladığınız yeminlerden dolayı sorguya çeker\" ayetine dayanmıştır. Yalan yere yE!min ise mun'akia (bağlı) değildir. Mun'akid yemin çözülmesi mümkün olan yemindir. Yalan yere yeminde hiçbir şekilde iyilik bulunmaz. Ebu Ubeyde şöyle demiştir: Ayette geçen ........ kelimesi her türlü fesadı ihtiva etmektedir. Taberi şöyle demiştir: Bu ayet 'yemin ederek söz verdiğiniz kişilere karşı bu yemini ihanet ve mağdur etme aracı olarak kullanmayın. Siz yemin edince onlar size güven duyarlar ancak siz içinizde onlara tuzak kurmayı hesap edersiniz' anlamındadır. Musannifin yalan yere yeminle ilgili başlığın altında bu ayet i zikretme nedeni ayet in kasten yalan yere yemin edeni tehdit etmesinden kaynaklanmaktadır. Muhammed İbn Nasr alimler arasındaki ihtilaftan söz ederken İbnu'l-Münzir ve daha sonra İbn Abdilber sahabenin, yalan yere yemin kefareti olmadığı konusunda ittifak ettiğini belirtmişledir. Adem İbn Ebi İyas, Şube'nin Müsned'inde, İsmail el-Kadı el-Ahkam'da İbn Mesud'dan naklen şöyle rivayet etmiştir: \"Biz kefareti olmayan yeminin gamus yemini olduğunu kabul ederdik. Gamus yemini kişinin kardeşinin malından kendine bir payayırmak için yalan yere yemin etmesidir.\" Sahabiler arasında bu konuda bir ihtilaf bulunmamaktadır. Onlar bu meselede yalan yere yemin etmenin küfürden daha büyük günah olmasına dayanmışlardır. Ancak Hakem, Ata, el-Evzai, Mamer ve Şafii kefaret gerektiği kanaatinde olup yalan yere yemin edenin diğerlerine göre kefarete daha muhtaç olduğunu, kefaret vermenin ona sadece hayır getireceğini söylemişlerdir. Bu kişiye düşen hakikate dönmek ve mazlumun hakkını vermektir. Böyle yapmayıp sadece kefaret verirse bu kefaret onun yaptığı haksızlığı gidermez sadece ona bir fayda getirmiş olur. Yeminler Kitabının başında yer alan hadisteki \"Hayırlı olanı yapsın ve yemin kefareti versin\" ifadesini Şafi'nin delilolarak kullanmış ve yeminden dönen kişinin kefaret vermesi gerektiğine hükmetmiştir. Bu hadisten yemin edip yeminden dönen için kefaretin meşru olduğu neticesi çıkar",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 6677,
			"arabicnumber": 6677,
			"text": "Süleyman ibn Mihrân kendi hadîsinde şöyle dedi: el-Eş'as ibn Kays meclise uğradı da: Ebû Abdirrahmân size ne tahdîs ediyor? diye sordu. Oradakiler ona: Şöyle şöyle olan hadîsi söyledi, dediler. üzerine el-Eş'as: Bu âyet benim hakkımda indi. Şöyle ki: Bir amca oğlumun arazisinde bana âid bir kuyu vardı. (Bu kuyuda ihtilâf ettik.) Ben Rasûlüllah'a gidip da'vâmı arzettim. Rasûlüllah: \" (Kuyunun sana âid olduğuna dâir) beyyinen hazır olsun yahut onun yemini olur\" buyurdu. Ben: Yâ Rasûlallah! Bu takdirde o zât bu kuyunun kendisinin olduğuna yalan yere yemîn eder, dedim. Bunun üzerine Rasûlüllah:\"Her kim müslümân bir kişinin malını koparıp almak için yalancı olduğu hâlde bir yemîni sabr üzerine (yani kendini yalana habseden bir yemîn üzerine) yemîn ederse, o kimse kıyâmet gününde Allah'a, Allah kendisine gadab etmiş olduğu hâlde kavuşacaktır\"buyurdu",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 6678,
			"arabicnumber": 6678,
			"text": "Ebu. Musa el-Eş'arı şöyle anlatmıştır: Arkadaşlarım (Eş'arfler Tebük seferinde) kendilerine binek ve yük hayvanı istemek üzere beni Nebi'e gönderdiler. Resulullah Sallallahu Aleyhi ve Sellem \"Vaılahi ben sizleri hiçbir hayvana bindiremem\" dedi. O sırada ben kendisini öfkeli bir halde bulmuştum. (Bir süre sonra Bilal tarafından Nebi Sallallahu Aleyhi ve Sellem'in yanına çağrıldım.) Bu sefer Resulullah'a geldiğimde bana \"Arkadaşlarına git ve onlara 'Allah -veya- Resulullah Sallallahu Aleyhi ve Sellem sizleri (develere) yükleyecektir!' de\" buyurdu",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 6679,
			"arabicnumber": 6679,
			"text": "Zühri şöyle anlatmıştır: Urve b. Zubeyr, Said b. elcMüseyyeb,Alkame b. Kays, Ubeyduııah b. Utbe'den Nebi Sallallahu Aleyhi ve Sellem'in eşi Aişe olayını, yani iftira edenlerin kendisi aleyhinde söylediklerini söyledikleri zaman Aııah'ın Aişe'yi onların dedikodularından temize çıkarıp beri kılması olayını işittim. Bu dört kişinin her biri bana bu hadisin bir kısmını naklettiler. Aişe şöyle demiştir: Allah (({Nebi Sallallahu Aleyhi ve Sellem'in eşine) bu ağır iftirayı uyduranlar şüphesiz sizin içinizden bir gruptur\"(Nur 11) cümlesiyle başlayan bu on ayeti benim suçsuzluğum hakkında indirdi. Bunun üzerine babam Ebu Bekir es-Sıddık hısımlığından dolayı nafaka vermekte bulunduğu Mıstah hakkında \"Kızım Aişe'ye bu iftirayı attıktan sonra vallahi ben Mıstah'a ebediyyen bir şey vermem\" diye yemin etti. Bunun üzerine Yüce Aııah \"Içinizden faziletli ve servet sahibi kimseler akrabaya, yoksullara, Allah yolunda göç edenlere {mallarından} vermeyeceklerine yemin etmesinler\"(Nur 22) ayet-i kerimesini indirdi. Ebu Bekir şöyle dedi: \"Vaııahi ben Aııah'ın beni mağfiret etmesini muhakkak severim\" dedi ve Mıstah'a veregeldiği nafakayı tekrar vermeye başladı. Ve \"Ben bu nafakayı ondan ebediyyen koparmaml\" dedi",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 6680,
			"arabicnumber": 6680,
			"text": "Zehdem şöyle anlatmıştır: Ebu Musa el-Eş'arl'nin yanında bulunuyorcluk. Bize şöyle dedi: Eş'arllerden bir topluluk içinde Nebi'e geldim. Onu bu sırada öfkeli bir halde buldum. Kendisinden bizlere binecek deve vermesini istedik. Resuluııah Sallallahu Aleyhi ve Sellem bizleri (develere) yükleyemeyeceğine dair yemin etti. Bir süre sonra da \"Vallahi inşallah ben bir şeye yemin eder ve sonra ondan başkasını yemin ettiğim şeyden daha hcyırlı görürsem, muhakkak o hayırlı olanı yapar, yeminimi de kefaretle çözer, kurtulurum\" dedi: Fethu'l-Bari Açıklaması: İbnü'l-Müneyyir şöyle demiştir: İbn Battal, İmam Buhari'nin attığı bu başc lıkla bir kadının nikahına malik olmadan önce talakını veya bir köleye sahip olmadan önce hürriyetini ta'lik etmenin caiz olduğu görüşüne meylettiği sonucunu çıkarmıştır. O bu konuda meydana gelen ihtilafları nakletmiş ve bu husustaki görüşleri ve delilleri uzun uzadıya açıklamıştır. Öyle anlaşılıyor ki İmam Buharl'nin maksadı onun dediğinden başkadır. Buharl'nin eğilimi şu yöndedir: Nebi s.a.v. kendisinden binecek deve isteyenlere onları bindiremeyeceğine dair yemin etmiştir. Bir süre sonril kendilerini develere bindirince onlar ettiği yemini hatırlatmak için Nebie başvurmuşlardır. Resulullah Sallallahu Aleyhi ve Sellem onlara \"Sizleri yükleyen ben değilim. Fakat sizleri Allah yüklemiştir\" demiş ve yemininin, malik olduğu hususlarda geçerli olduğunu beyan etmiştir. Resulullah Sallallahu Aleyhi ve Sellem onları malik olduğu deveye bindirseydi yeminini bozmuş olurdu ve kefaret verirdi. Fakat o Eş'arileri özelolarak malik olmadığı Allah'ın malı olan develere bindirdi. Böylece Nebi Sallallahu Aleyhi ve Sellem yeminini bozmuş duruma düşmemiş oldu. Nebi s.a.v.'in Eş'arileri develere bindirdikten sonra \"Bir şeye yemin eder ve sonra ondan başkasını yemin ettiğim şeyden daha hayırlı görürsem muhakkak o hayırlı olanı yapar, yeminimi de kefaretle çözer kurtulurum\" şeklindeki ifadesi, yeni bir hüküm kurucu, başlı başına bir kaideyi ifade etmektedir. Resulullah Sallallahu Aleyhi ve Sellem adeta şöyle demektedir: Eğer ben yemin eder, sonra yemin ettiğim şeyi terk etmeyi ondan daha hayırlı görürse m yeminimi bozar ve ona karşılık kefaret veririm. İbnü'I-Müneyyir şöyle devam eder: Eş'arilerin Hz. Nebi'den binecek hayvan istemeleri, onun binek ve yük hayvanına malik olduğunu zannetmelerindendir. Bu taleplerinin ardından Nebi Sallallahu Aleyhi ve Sellem kendilerini malik olduğu herhangi bir hayvana bindiremeyeceğine yemin etmiştir. Çünkü kendisi o esnada böyle bir hayvana malik değildi. İbnü'l-Müneyyir sözüne devamle şöyle der: Bir kimse mülkünde olmayan bir şey üzerine o şeye bağlayarak herhangi bir fiili yapmayacağına yemin etse ... Bunu bir örnekle açıklamak daha iyi olur: Bir kimse sahip olmadığı bir deveyi kastederek \"Şu deveye binersem şöyle şöyle yapmak boynuma borç olsun\" diye yemin etse ve daha sonra o deve ye malik olup binse, bu yeminini bozmuş olduğu noktasında bilginler arasında ihtilaf yoktur. Bu, yeminin mülkiyete bağlanması kabilinden değildir. Bizim bu konudaki görüşümüz ise farklıdır: İbnü'I-Müneyyir'in dile getirdiği görüş ihtimale açıktır. İbn Battal'ın görüşü de uzak bir ihtimal değildir. Aksine daha doğrudur. Şöylesine; Nebi s.a.v.'den binek ve yük hayvanı isteyen sahabiler, Nebi Sallallahu Aleyhi ve Sellem'in yemin ettiğini, yapmayacağım diye yemin ettiği şeyin aksini yaptığını anlamışlar, bundan dolayı Nebi Sallallahu Aleyhi ve Sellem kendileri için binek ve yük hayvanı verilmesini emrettiğinde \"Resulullah'a yeminini unutturduk\" demişler ve onun daha önce ettiği yemini unuttuğunu zannetmişlerdir. Nebi Sallallahu Aleyhi ve Sellem ise onlara bunu unutmadığını, fakat yaptığının ettiği yeminden daha hayırlı olduğu, yemin ettiğinde ve yemininden daha hayırlısını gördüğünde yapmayacağım diye yemin ettiği şeyi yaptığı ve yeminini kefaret vererek çözüp kurtulduğu şeklinde cevap vermiştir. Bu konu \"Yemini Bozmadan Önce Kefaret Verme\" başlığı altında daha açık olarak gelecektir. Bir Kimsenin Malik Olmadığı Hususta Nezirde Bulunması başlığı altında insanın malik olmadığı hususta yemini meselesi hakkında daha fazla açıklama inşallah gelecektir",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 6681,
			"arabicnumber": 6681,
			"text": "Said b. eI-Müseyyeb'in babasından nakline göre Ebu Talib'e ölüm aIametIeri geIdiği zaman ResuIullah s.a.v. onun yanına girdi ve \"(Amca!) La ilahe illallah kelimesini söyle ki bununla Allah katında senin için hüccet getireyim\" dedi",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 6682,
			"arabicnumber": 6682,
			"text": "Ebu Hureyre'nin nakline göre ResuIullah Sallallahu Aleyhi ve Sellem şöyIe 'demiştir: \"Subhanallahi ve bihamdihi, subhannallahi'l-azim, dile hafif, mizanda ağır, Rahman'a sevgili iki kelimedir",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 6683,
			"arabicnumber": 6683,
			"text": "Abdullah b. Mesud şöyIe demiştir: ResuIuIlah Sallallahu Aleyhi ve Sellem bir kelime söyIedi, ben de başka bir kelime söyIedim. O 'llah'a bir şeyi eş kılarak ölen kimse ateşe sokulacaktır\" dedi. Ben de \"Allah'a hiçbir şeyi eş klImayarak ölen kimse cennete girdirilir\" dedim. Fethu'l-Bari Açıklaması: \"Bir kimse 'Vaııahi bugün konuşmam' dediği ve akabinde namaz kıldığı zaman bunun kendi niyeti üzere olduğu.\" İmam Buhari'nin bu başlıkta söylemek istediği şudur: Bir kimse vallahi bugün konuşmayacağım diye yemin eder, \"kıraat\" ve \"zikir\"i konuşmasına katmaya niyet ederse okuduğunda veya zikirde bulunduğunda yeminini bozmuş olur. Bunları katma niyetinde bulunmazsa bozmuş olmaz. İmam Buhari kişinin herhangi bir niyete dayalı olmaksızın mutlak olarak kıraatte ve zikirde bulunması durumuna değinmemiştir. Çoğunluk, bu durumda da o kişinin yemininin bozulacağı kanaatini benimsemiştir. Hanemerden nakledilen bir görüşe göre ise bu takdirde yemini bozulmaz. Bazı Şafiı alimleri Kur'an'ı ayrı değerlendirmişler ve böyle bir yemini ettikten sonra Kur'an okuyanın yemininin bozulmayacağını ama zikirde bulunanın bozulacağını söylemişlerdir. Çoğunluğun delili örfe göre \"kelam\" dendi mi bundan insariların sözlerinin anlaşıldığıdır. Bundan dolayı kişi namaz kılarken \"kıraat\"ta bulunup, \"zikir\"yaptığında yemini bozulmaz. Namaz dışında da hükmün böyle olması gerekir. Bu konudaki deliııerden birisi Müslim'de yer alan şu hadistir: \"Bizim şu namazımızda insan sözlerinden bir şey konuşmak uygun olmaz. Namaz ancak tesbih, tekbir ve Kur'an okumaktan ibarettir\"(Müslim, Mesacid) Hadis-i şerifte Nebi Sallallahu Aleyhi ve Sellem \"zikir\" ve \"kıraat\" için \"insanların sözleri\"nden başka bir hüküm vermektedir. Ebu Hureyre'nin rivayet ettiği \"Subhanallahi ve bihamdihi, subhannallahi'l-azfm, dile hafif, mizanda ağır; Rahman'a sevgili iki kelimedir\" hadisinin geniş bir açıklaması bu bölümün sonunda gelecektir",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 6684,
			"arabicnumber": 6684,
			"text": "Enes r.a. şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem ailelerinin yanlarına bir ay girmemeye yemin etti (ııa). Ayağı da çıkmıştı. 29 gece yüksekçe bir odada ikamet etti. Sonra ailelerinin yanına indi. \"Ya Resulallah! Sen bir ayailelerinin yanlarına girmemeye yemin etmiştin\" dediler. Resulullah Sallallahu Aleyhi ve Sellem: 'Ay 29 da olur!\" buyurdu. Fethu'l-Bari Açıklaması: \"Bir Kimsenin Ay 29 Günde Tamam Olduğu Halde Ailesinin Yanına Bir Ay Girmeyeceğine Yemin Etmesi.\" Yani 29 gün geçtikten sonra onların yanına girmesi. Bu durumda kişi yeminini bozmuş olmaz. Bu durum sözkonusu yeminin bir rastlantı eseri o ayın ilk girdiği anda yapılmış olması durumunda tas avvur edilebilir. Buna karşılık yemin ayın içinde herhangi bir günde yapılmışsa ve geri kalan günler bir aydan eksikse o kimsenin günleri otuza veya yirmidokuza tamamlaması gerekir mi gerekmez mi? Bunlardan birincisi çoğunluğun görüşüdür. Aralarında Malikilerden İbn Abdulhakem'in de bulunduğu bir zümre ikinci yaklaşımı benimsemişlerdir. Bu konunun açıklaması Nikah Bölümünün sonunda. yer alan ve Hz. Ömer'in rivayet ettiği uzun hadisin açıklamasının son kısmında gemişti. Ilanın ne demek olduğu ve yukarda zikredilen Enes hadisinin açıklaması, Ila başlığı altında daha önce yapılmıştı",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 6685,
			"arabicnumber": 6685,
			"text": "Sehl b. Sa'd'ın nakline göre Nebi Sallallahu Aleyhi ve Sellem'in sahabisi olan Ebu Useyd evlenir ve Nebii düğün aşına davet eder. Yeni gelin olan karısı da davetlilere hizmet eder. Sehl kendilerine hadis nakletmekte olduğu topluluğa \"Sizler bu gelinin Nebi'e ne içirdiğini biliyor musunuz?\" diye sorar ve sonra kendisi şöyle cevap verir: \"Geceden tevr denilen bir kap içinde bir miktar hurma ıslattı, sabah olunca işte bu tatlı şırayı ona içirdi",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 6686,
			"arabicnumber": 6686,
			"text": "Nebi Sallallahu Aleyhi ve Sellem'in eşi Sevde şöyle demiştir: \"Bizim bir davarımız vardı, öldü. Biz de onun derisini tabakladık. Sonra o tabaklanmış derinin içinde eskiyineeye kadar nEbiz şırası kurmakta devam ettik.\" Fethu'l-Bari Açıklaması: \"Tila\", \"seker\", \"NEbiz\" kelimelerinin Açıklamaları Eşribe Bölümüride daha önce geçmişti. el-Mühelleb şöyle der: Çoğunluğun kanaatine göre muayyen bir nEbizi içmeye ce ği ne yemin eden bir kimse bir başka nEbizi içtiğinde yeminini bozmuş olmaz. Sarhoş olmak korkusuyla nEbiz içmeyeceğine yemin eden bir kimse sarhoşluk verici vasfı bulunan içeceklerden hangini içerse yeminini bozmuş olur. Çünkü ister pişirerek (tabıh) ister suyunu sıkarak (asır) elde edilsin hurma suyudur (Mehmet Erdoğan, Fıkıh ve Hukuk Terimleri Sözlüğü, s. 499). diğer içecek maddeleri vasıf itibariyle ona benzedikleri için nEbiz adını alırlar. Bu durumda yemin eden kimse hiçbir meşrubatı içmeyeceğine yemin edip bunlar arasında ayırım gözetmediğinde nasıl ki adına \"meşrubat\" denilen herhangi bir nesneyi içtiğinde yemini bozulursa aynen onun gibi olur. İbn Battal'ın görüşü şöyledir: İmam BuhSrl'nin yukarıdaki başlıkta \"birileri\" derken kastı, İmam Ebu Hanıfe ve onun mezhebine uyanlardır. Çünkü onlar \"tıIS\" ve \"asır\"in nEbiz olmadığını, zira nEbizin gerçekte suya bırakılan ve yatırılan şeyolduğunu söylemişlerdir. Bundan dolayı \"menbuz\"a menbuz denilmesi, atılmasından ve bırakılmasından kaynaklanmıştır. İmam Buhari ise bunlara cevap vermek istemiştir. Onun yukarıda yer verdiği iki hadisten Sehl'in rivayet ettiği hadis, içmesi helal bile olsa kısa bir süre önce suya bırakıldığı bilinen şeylere nEbiz adını vermeyi gerektirmektedir. Eşribe Bölümünde Aişe r.anha'nın, Nebi Sallallahu Aleyhi ve Sellem Efendimize geceden nebiz yapıldığı ve onu sabahleyin içtiği, sabahleyin nebiz yapıldığı ve onu da akşam üstü içtiği rivayet i geçmişti. Sevde'nin yukarıdaki hadisi bunu teyit etmektedir. Çünkü o ölmüş kOyıınun derisine nebiz şırası kurmçıkta olduklarından söz etmiştir. Nebi Sallallahu Aleyhi ve Sellem ve ailesi ancak içmesi helalolan şeyin şırasını çıkarıyarlardı. Bununla birlikte ona nebiz adını veriyorlardı. Hadiste geçen \"mesk\" cilt, deri demektir",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 6687,
			"arabicnumber": 6687,
			"text": "Aişe r.anha \"Muhammed'in ailesi kendisi Allah'a kavuşuncaya kadar üç gün üst üste katıklandırılmış buğday ekmeğinden karnını doyurmadı\" demiştir",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 6688,
			"arabicnumber": 6688,
			"text": "Enes b. Malik r.a. şöyle anlatmıştır: Ebu Talha, Ümmü Süleym'e \"Ben bu defa Resulullah Sallallahu Aleyhi ve Sellem'in sesini zayıf olarak işittim. Kendisinde bir açlık olduğunu biliyorum, yanında yiyecek bir şey var mı?\" diye sordu Ümmü Süleym \"Evet var\" dedi ve arpadan yapılmış birkaç yuvarlak ekmek çıkarttı. Sonra kendi başörtüsünü aldı ve onun bir kısmı ile ekmekleri sarıp dürdü. Sonra beni Resulullah Sallallahu Aleyhi ve Sellem'in yanına gönderdi. Ben de gittim. Resuluılahı mescidde oturur halde buldum. Beraberinde insanlar vardı. Onların yanına varıp dikildim. Resulullah Sallallahu Aleyhi ve Sellem \"Seni Ebu Talha mı gönderdi?\" diye sordu. \"Evet\" dedim. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem beraberinde bulunanlara hitaben \"Kaıkınız!\" buyurdu. Onlar da kalkıp yürüdüler, ben de aralarında yürüdüm. Nihayet Ebu Talha'ya geldim ve durumu ona haber verdim. Ebu Talha (annem) Ümmü Süleym'e \"Ya Üm mü Süleym! Resulullah Sallallahu Aleyhi ve Sellem insanlarla birlikte gelmektedir. Halbuki yanımızda onları doyurabileceğimiz bir şey yoktur\" dedi. Ümmü Süleym \"Allah ve Resulü en iyi bilendir\" dedi. Akabinde Ebu Talha evden hareket etti, nihayet Resulullah Sallallahu Aleyhi ve Sellem'e kavuştu. Resulullah Sallallahu Aleyhi ve Sellem Ebu Talha ile birlikte geldi ve ikisi birden içeriye girdiler. Resulullah Sallallahu Aleyhi ve Sellem \"Ya Ümmü Süleym! Yanında ne varsa getir!\" buyurdu. O da bu ekmekleri getirdi. Enes şöyle devam etti: Resulullah Sallallahu Aleyhi ve Sellem'in emri üzere bu ekmek parçalara bölündü. Ümmü Süleym bunun üzerine kendine ait yağ tulumundan biraz yağ sıktı ve onu bulayıp katık yaptı. Sonra Resulullah Sallallahu Aleyhi ve Sellem O katık hakkında Allah'ın söyletmek istediği şeyleri söyledi. Sonra \"On kişi için izin ver!\" buyurdu. Ebu Talha o on kişiye izin verdi. Onlar doyuncaya kadar yediler ve sonra dışarı çıktılar. Ardından \"On kişiye daha izin ver!\" buyurdu. Ebu Talha onlara da izin verdi. Onlar da doyuncaya kadar yediler. Sonra dışarı çıktılar. Resuluilah Sallallahu Aleyhi ve Sellem \"On kişiye .daha izin ver!\" buyurdu. Nihayet böylece topluluğun' hepsi yedi ve doydu. Bu topluluk yetmiş yahut seksen kişiydi. Fethu'l-Bari Açıklaması: \"Katık Yememeye Yemin Edip, Ekmekle Hurma Yiyen Kimsenin Katık Yemiş Olup Olmayacağı.\" Bunun manası bu kimse katı k yemiş olup yeminini bozmuş mu olur yoksa olmaz mı demektir. İbn Battal şöyle demiştir: Bu hadis evde katık yapmak adet haline gelmiş olan her şeye ister sıvı, ister katı olsun katık denileceğini göstermektedir. \"Kıyamet bir tek ekmek gibi olacaktır. Onların azıkları balığın ciğerinden bir parça olacaktır\" hadisi de böyledir. Bu hadisin açıklaması Rikak Bölümünde daha önce geçmişti. Yukarıdaki başlıkta zikredilen yemin hakkında Yusuf b. Abdullah b. Selam'ın \"Hz. Nebii gördüm. Bir parça arpa ekmeği aldı ve üzerine bir hurma koydu. Sonra 'Bu, bunun azığıdır' dedi\" hadisi vardır. Bu hadisi Ebu Davud (Et'ime) ve Tirmizi hasen isnadla rivayet etmişlerdir",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 6689,
			"arabicnumber": 6689,
			"text": "Alkame b. Vakkas el-Leysi'nin Hz. Ömer'den nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Ameller ancak niyete göredir. Herkesin niyet ettiği neyse eline geçecek olan ancak odur. Kimin hicreti Allah'a ve Resulüne yönelik ise hicreti Allah'a ve Resulünedir. Kimin hicreti de nail olacağı dünyaya (dünya malına) veya evleneceği kadına ise onun hicreti de hicretine sebep olan şeyedir. \" Fethu'l-Bari Açıklaması: \"Yeminlerde Niyetin Esas Olmas!.\" Amellerin niyetlere göre olduğu hadisinin açıklaması Bed'ü'l-Vahy'in baş taraflarında geçmişti. Bu hadisin yukarıdaki başlıkla olan ilişkisi, yeminin amellerden birisi olmasından dolayıdır. Bu hadisten lafızların -Iafızda bunu gerektiren bir şeyolmasa bile- zaman ve mekan açısından niyetle tahsis edilebileceği sonucu çıkarılmıştır. Söz gelimi bir kimse Zeyd'in evine girmeyeceğine yemin etse ve bunun için mesela bir ay veya bir yıl gibi bir süreyi kastetse ya da bir kimse mesela Zeyd'le konuşmayacağına yemin etse ve bunun sadece evi içip geçerli olmasına başka yerler için sözkonusu olmamasına niyet etse birinci durumda eve bir ay veya bir yıl sonra girse yemini bozulmuş olmaz. İkinci durumda da onunla başkasının evinde konuşsa yine bozulmuş olmaz. İmam Şafii ve onun mezhebine uyanlar şu olay için bu hadisi delil olarak almışlardır. Bir kimse karısına \"Şöyle yaparsan boş ol\" dese ve içinden boşamanın sayısına niyet etse bunu açıkça telaffuz etmemiş bile olsa içinden geçen sayı geçerlidir. Aynı şekilde bir kimse karısına \"Şöyle yaparsan bain talakla boş ol\" dese ve bununla üç talakı kastetse kadın bain talakla boş düşer. Buna karşılık daha az bir sayıyı içinden geçirse boşama niyetine uygun olarak ric'i talakla gerçekleşir. Hanefiler her iki surette de muhalif olmuşlardır. Bu hadisten yeminin yemin eden kimsenin niyetine göre değerlendirileceği sonucu çıkarılmıştır. Fakat bu, insan hakları ile ilgili olmayan hususlarda geçerlidir. Zira insan hakları sözkonusu olduğunda yemin, yemini verenin niyetine göredir. Bir kimse, ettiği yeminle bir başkasının hakkına tecavüz ediyorsa bu konuda tevriyeden yararlanamaz",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 6690,
			"arabicnumber": 6690,
			"text": "Abdullah b. Ka'b b. Malik şöyle anlatmıştır: -Bu Abdullah babası Ka'b b. Malik'in gözleri görmez olduğu zaman oğulları arasında onun elinden tutup götüreni idi.- Abdullah şöyle demiştir: Babam Ka'b b. Malik'ten işittim. Tebuk gazvesinden geri kalması hakkındaki uzun hadisinin bir yerinde \"Ve (seferden) geri bırakılan üç kişinin de (tövbelerini kabul etti). Yeryüzü genişliğine rağmen onlara 'dar gelmiş, vicdanları kendilerini sıktıkça sıkmıştı\"(Tevbe 118) ayetinden sonra \"(Ya Resulallah!) Allah ve Resulünün rızası uğrunda halis bir sadaka olmak üzere malımın hepsinden sıyrılıp vazgeçmem tövbemdir\" dedi. Nebi Sallallahu Aleyhi ve Sellem \"(Hayır!) malının bir kısmını kendinde tutup alıkoy, bu senin için daha hayırlıdır\" buyurdu. Fethu'l-Bari Açıklaması: \"Bir Kimsenin Malını Nezir (adak) Veya Tövbe Şeklinde Hediye ve Sadaka Ettiği Zaman Bunun Geçerli Olup Olmadığı.\" Kirmanı şöyle demiştir: İmam Buharl'nin başlığında yer alan \"ehda\" malını tasadduk etti veya Müslümanlara hediye kıldı anlamınadır. Bu, adakla ilgili başlıkların ilkidir. Adak anlamına gelen \"nezr\" Arap dilinde herhangi bir iyiliği veya kötülüğü üstlenmek anlamına gelir. Dini bir terim olarak mükellefin yapmakla yükümlü olmadığı bir şeyi derhal veya herhangi bir şeyin gerçekleşmesine bağlayarak (muallak) yapmayı üstlenmesi demektir. Adak iki kısımdır: Nezr-i teberrur ve nezr-i lecac. Nezr-i teberrur de kendi içinde iki çeşittir, Bunlardan birincisi \"Şu kadar oruç tutmak Allah için üzerime nezr olsun\" ifadesinde olduğu gibi kişinin ilk baştan Allah'a yaklaşmak maksadıyla yaptığı nezirdir. Bir kişinin -mesela- \" Hastama şifa ihsan ettiği için' verdiği nimete şükrane olarak şu kadar oruç tutmak Allah için üzerime nezr olsun\" demesi de bu çeşit nezre girer. Bazıları nezr-i teberrurun sahih ve müstehab olduğu noktasında alimlerinittifakı olduğunu nakletmişlerdir. Nezr-i teberrurün ikinci çeşidi ise \"Gurbetteki yakınım gelirse veya düşmanımın şerrinden kurtulursam Allah için şu kadar oruç tutmak nezrim olsun\" ifadesinde olduğu gibi kişinin nezrini yararlanacağı bir şeye bağlayarak Allah'a yaklaşmaya çalışmasıdır, Muallak Nezir (adak) de bilginlerin ittifakıyla kişiyi bağlar. Tercih edilen görüşe göre anında yapılan Nezir (adak) de (müneccez) aynı şekilde bağlayıcıdır. Nezr-i lecac da iki çeşittir. Birincisi; kişinin haram olan bir şeyi yapmaya veya bir vacibi terk etmeye bağladığı nezirdir. Bilginler arasında tercih edilen görüşe göre böyle bir Nezir (adak) dinen yapılamaz. Ancak terk edilen şey farz-ı kifaye veya onu yapmak meşakkatli bir şeyolursa bu takdirde bağlayıcı olur. Kişinin hoşlanmadığı bir şeyi yapmaya bağlamış olduğu Nezir (adak) de bu kategoridedir, İkincisi ise kişinin evla olmayanı veya bir mubahı yapmaya ya da bir müstehabı terk etmeye bağladığı nezirdir. Bu nezir hakkında bilginler üç görüşe ayrılmışlardır. Yapılan nezre uymak veya yemin kefareti vermek ya da bu ikisi arasında muhayyer olmak. Şafiı mezhebinde bunların hangisinin tercih edileceği noktasında ihtilaf vardır, Aynı ihtilaf Hanbelı mezhebi için de sözkonusudur. Hanemer bunların üçünde de yemin kefareti verileceğini ifade etmişlerdir. Malikller ise böyle bir nezrin esasen yapılamayacağını söylemişlerdir. Selef bilginleri bütün malını tasadduk etmeye nezreden kimse hakkında ihtilaf etmişlerdir. Bu konuda on ayrı görüş sözkonusudur, İmam Malik yukarıdaki hadisten dolayı nezr yapan kişinin malının üçte birini vermesi gerektiğini söylemiştir, Ancak kendisine şu gerekçelerle itiraz edilmiştir: Ka'b b. Malik \"nezir = adak\" sözcüğünü açıkça telaffuz etmediği gibi bu manaya gelebilecek başka bir şeyi de söylememiştir. Tam aksine o anda nezirde bulunmuş olma ihtimali söz- , konusu olduğu gibi, nezir yapmak istemiş ve bu nedenle Nebi Sallallahu Aleyhi ve Sellem'in iznine başvurmuş olması da muhtemeldir. \"Malının tamamını bırakıp sıyrılması\" nezirde bulunduğuna açıkça delalet etmemektedir. Bu ifadeden asıl anlaşılan onun Allahu Teala'ın kendine bahşettiği nimete şükür etmek için tüm malını tasadduk ederek tövbesini pekiştirmek istediğidir. Fakihani, Şerhu'l-Umde isimli eserde şöyle der: Ka'b için en uygun olanı danışmada bulunmak ve kendi görüşüne görehareket etmemekti. Fakat tövbesinin kabul edilmesine duyduğu ferahlıktan dolayı öyle bir duygusal atmosfere girmiştir ki bunun etkisi ile tüm malını tasadduk etmenin şükür açısından üzerine yapılması gereken bir hareket olduğu düşüncesine kapılmış ve istişare sözcüğü kesin bir kararlılık kipiyle ağzından çıkmıştır. Bizim düşüncemize gelince, Ka'b b. Malik'in soru sormuş olma ve cümlenin başından soru edatını atmış bulunma ihtimali vardır. Bundan dolayı birçok alim nezdinde tercihe şayan olan görüş bütün malını tasadduk etmeyi üstlenmiş olan kimsenin buna uymasının vacip olduğu şeklinde olmuştur. Ancak bunun Allah'a yaklaşma kabilinden olması müstesnadır. Bazıları şöyle demiştir: Nezirde bulunan kişi, hali vakti yerinde olduğu takdirde bunu yerine getirmekle yükümlüdÜr. Şayet fakirse yemin kefareti vermelidir. Leys'in görüşü bu doğrultudadır. İbn Vehb de ona katılmıştır. İbn Vehb şunu da eklemiştir: Kişi orta gelir seviyesinde ise malının zekatı kadar bir miktarı çıkarır. Bu konudaki son görüş, kişinin mali durumu konusunda herhangi bir ayrıntı sözkonusu olmaksızın İmam Ebu Hanife'den nakledilen görüştür. Rebia'nın görüşü de bu doğrultudadır. Sevri, Evzaı ve bir grup bilgine göre malının tamamını tasadduk etmeyi adayan kimse, mali durumuna bakılmaksızın yemin kefareti vermelidir. Bu açıklamalardan sonra Ka'b'ın hadisinin Buharl'nin attığı başlıkla olan ilişkisine gelecek olursak, başlığın manası şudur: Bir kimse herhangi bir günahtan tövbeettiğinde veya nezirde bulunduğunda bütün malını hediye etse veya tasaddukta bulunsa bunu o anda yapsa veya bir şeye bağlayarak ifade etse geçerli olur mu, olmaz mı? Ka'b'ın olayı birinci ihtimalle yani nezrin anında yapılanı ile (tenciz) uyumludur. Fakat daha önce açıklığa kavuşturduğumuz üzere KS'b'ın ağzından kesinlik ifade eden (tendz) bir şey çıkmamıştır. O sadece danışmada bulunmuş ve kendisine malının bir kısmını elinde tutması ifade edilmiştir. Netice olarak bütün malını kesin olarak tasadduk etmek isteyen veya bunu bir şeye bağlayan (ta' lik) kimseye en uygun olanı, malının bir kısmını elinde tutmaktır. Bundan nezrini kesin olarak yaptığı takdirde bunun yapılmamış olması sonucu çıkmaz. Zekat BölümÜnde malın tamamını tasadduk etmenin durumdan duruma farklılık gösterdiğine de işaret edilmişti. Her kim bunu yapabilecek bir güçte olur, nefsinin sabredeceğini bilirse bunu yapmasına engel olunmaz. Hz. Ebu Bekir'in uygulaması, Ensarın kendileri ihtiyaç içinde oldukları halde Muhacirıeri kendi nefislerine tercih etmeleri bu şekilde yorumlanır. Buna gücü yetmeyen kımse ise böyle değildir. \"Sadaka, ancak (verenin) ihtiyacı olmadığında geçerlidir\" hadisi kapsamında değerlendirilir. Bu hadis bir de \"Sadakanın en efdal olanı, kişinin ihtiyacı olmadığında verdiği sadakadır\" şeklinde de rivayet edilmiştir",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 6691,
			"arabicnumber": 6691,
			"text": "Ubeyd b. Umeyr'in nakline göre Aişe r.anha şöyle anlatmıştır: Resulullah Sallallahu Aleyhi ve Sellem Zeynep bnt. Cahş'ın yanında eğlenir ve onun yanında bal şerbeti içerdi. Bunun üzerine ben ve Hafsa, birbirimizle şöyle anlaştık: Nebi Sallallahu Aleyhi ve Sellem ikimizden hangimizin yanına girerse \"Ya Resulallah! meğafir mi yedin, sende meğafir kokusu duyuyorum\" desin diye söz birliği yaptık. Resulullah Sallallahu Aleyhi ve Sellem bu iki eşten birisinin yanına girince eşi bunu ona söyledi. Nebi Sallallahu Aleyhi ve Sellem \"Hayır ben mega/ir yemedim. Yalnız Zeynep bnt. Cahş'ın yanında bal şerbeti içmiştim. Artık bir daha onu içmem!\" diye yemin etti. Bunun üzerine \"Ey Nebi Sallallahu Aleyhi ve Sellem' Eşlerinin rızasını gözeterek Allah'ın sana helal kıldığı şeyi niçin kendine haram ediyorsun?\" ayet i indi. Allahu Teala Aişe ve Hafsa için de \"Eğer ikiniz de Allah'a tövbe ederseniz (yerinde olur)\" buyururken, Nebi Sallallahu Aleyhi ve Sellem eşlerine hayır bal şerbeti içtim dediği için \"Nebi Sallallahu Aleyhi ve Sellem eşlerinden .birine gizlice bir söz söylemişti\" ayeti indi. Fethu'l-Bari Açıklaması: \"Bir Kimsenin Herhangi Bir Yemeği Kendisine Haram Kılması.\" Bu, lecElC nezrine örneklerdendir. Nezr-i lecac kişinin mesela \"Şu yemek veya şu içecek bana haram olsun\" veya \"nezrettim\" ya da \"Allah için şunu yemeyeceğim, şunu içmeyeceğim\" demesidir. Alimlerin görüşleri arasında ağır basan, böyle bir nezrin doğmayacağıdır. Ancak kişi nezrine bir de yemin ekleyecek olursa, bu takdirde yemin kefareti vermekle yükümlü olur. Bu konudaki ihtilaf, \"Resulullah Sallallahu Aleyhi ve Sellem Mariye'yi mi kendine haram kıldı yoksa bal şerbeti içmeyi mi\" şeklinde Talak Bölümünde daha önce geçmişti. İmam Buhari hadise burada yer vererek ikinci ihtimale işaret etmiştir. Bir kimsenin kendisine belli bir yemeği haram kılmasının hükmü, içmeyi haram kllmasH1dan anlaşılır. İbnü'l-Müneyyir şöyle der: Bilginler esasen hela! olan herhangi bir yiyecek veya içecek maddesini kendisine haram kılan kimse hakkında ihtilaf etmişlerdir. Bazı bilginler bu o kişiye haram olmaz, yemin kefareti vermesi gerekir demişlerdir. Iraklı fıkıh bilginlerinin görüşü bu doğrultudadır. Bir grup alim ise yemin etmediği takdirde kefaret vermesi gerekmez demişlerdir. İmam Buhari hadise yer vermek suretiyle bu görüşü tercih ettiğine işaret etmiştir. Çünkü hadiste \"yemin ettim\" cümlesi geçmektedir. Mesruk, Şafiı ve Malik'in görüşü bu doğrultudadır. Fakat İmam Malik kişinin eşini kendisine haram kılmasını istisna etmiş ve bu durumda karısi boş düşer demiştir. İsmail el-Kadı şöyle der: Kadınla cariye arasındaki fark şudur: Bir kimse \"Karım bana haram olsun\" dediği takdirde bu bir ayrılıktır ve kişiyi bağlar. Netice olarak karısı boş düşer. Buna karşılık kişi cariyesine yemin etmeksizin bu cümleyi sarfettiğinde kendi nefsine gerekli olmayan bir şeyi yüklemiş olur. Netice olarak cariyesi kendisine haram olmaz. İmam Şafil'nin görüşü ise şöyledir: Kişi yemin etmediği takdirde üzerine herhangi bir yükümlülük gelmez. Ancak boşamaya niyet ederse karısı boş düşer veyacariyesini aza d etmeye niyet etmişse cariyesi hür olur. İmam Şafil'den böyle bir kimsenin yemin kefareti vermesi gerekir şeklinde bir görüş de nakledilmiştir. 'AIlah'ın size helal kıldığı iyi ve temiz şeyleri (siz kendinize) haram kılmayın. \"(Maide 87) ayetine gelince, İmam Buhari, Cami'inde Sevrl'nin ve onun vasıtasıyla İbnü'lMünzir'in sahih bi'r isnadla İbn Mesud'dan yaptığı rivayete işaret eder gibidir. Bir gün İbn Mesud'un huzuruna bir yemek getirilir. Ancak (sofrada bulunan) birisi onu yemekten kaçınır ve \"Bu yemeği yememek için kendime haram kıldım\" der. Bunun üzerine İbn Mesud \"Yemeği ye ve yeminin için kefaret ver\" der. Ardından bu ayeti \"Ve sınırı aşmayın\"(Maide 87) ayetine kadar okur. İbnü'l-Münzir şöyle der: Kişi yemin etmemiş bile olsa kefaret vermesinin gerekli olduğunu söyleyen bazı alimler Cerm kabilesinden olup, iğrenç bir şey yediği için tavuk etini yemeyi kendisine haram kılan kişi olayı hakkındaki Ebu Musa hadisinde geçen ifadeleri delilolarak almışlardır",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 6692,
			"arabicnumber": 6692,
			"text": "İbn Ömer r.a. şöyle demiştir: Onların nezirde bulunmaları yasak edilmedi mi? Şüphesiz Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Muhakkak, ki nezir hiçbir şeyi öne geçiremez, geriye de bırakamaz. Ancak nezir sebebiyle cimriden (fakirler lehine) mal çıkarılır",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 6693,
			"arabicnumber": 6693,
			"text": "Abdullah b. Ömer r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem nezirde bulunmayı yasaklamış ve \"Şurası muhakkaktır ki nezir hiçbir şeyi geri çevirmez. Fakat nezir sebebiyle cimri kimseden mal çıkarılır\" demiştir",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 6694,
			"arabicnumber": 6694,
			"text": "Ebu Hureyre r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle demiştir: \"Nezir Adem oğluna kendisi için takdir edilmemiş bir şey getirmez. Fakat nezir onu (kendisi için takdir edilmiş olan) kadere sürükler ve bu nezir sebebiyle Allah cimriden mal çıkarır. Artık o kimse nezrine sebep olan iş dolayısıyla daha önceden vermez olduğu malı getirip verir.\" Fethu'l-Bari Açıklaması: AÇIKLAMA’DAN SONRA BİR BAB VE BİR HADİS DAHA VAR !!! \"Yaptığı Nezre Uymak\" yani bunun hükmü veya fazileti. \"Allahu Teala'ın 'onlar adaklarını yerine getirirler' sözü.\" Bu ayetten kişinin adağını yerine getirmesinin Allah tarafından övgü ye ve yakınlığına sebep olduğu anlaşılmaktadır. Fakat bu, itaat nezrine mahsustur. Kurtubl'nin Allahu Teala'ın \"Onlar adaklarını yerine getirirler\" ayeti hakkında yaptığı .rivayete göre Mücahid Allah'a itaat uğrunda nezretmişlerse şeklinde bir açıklamada bulunmuştur. Kurtubi şöyle der: Nezir (adak), uyulması emredilen ve failine övilen akitlerdendir. Nezrin en üstün çeşidi herhangi bir şeye bağlı olmaksızın yapılanıdır. Mesela bir kimse yakalandığı hastalıktan kurtulduktan sonra \"Allah için şu kadar oruç tutmak veya ona şükretmek için şu kadar tasaddukta bulunmak üzerime nezr (adak) olsun\" demesi buna örnektir. Fazilet bakımından bunu herhangi bir itaat fiilini işlemeye bağlanmış olan nezir takip eder. Sözgelimi bir kimse ''Allah bana şu hastalıktan kurtuluş nasip ederse şu kadar gün oruç tutayım veya şu kadar namaz kılayım\" dese nezrin bu çeşidine örnek olur. Nezir (adak) çeşitlerinden bunların dışında bir de nezr-i lecac gibi olanı vardır. Mesela bir kimse kölesinin elini ağır bulsa ve ondan kurtulmak için kendisini aza d etmeye nezr etse ve bu hareketiyle Allah'a yakınlık niyeti taşımasa ya da kendi nefsine yüklenip, kendisine ağır gelen ve zarar göreceği şekilde çok namaz kılmaya veya oruç tutmaya nezr etse bütün bunlar mekruhtur ve bazıları haramlık derecesine kadar varır. \"İbn Ömer'i 'Onların nezirde bulunması yasak edilmedi mi' sözü.\" Hakim el-Müstedrek (Hakim, el-Müstedrek, ıV, 338) isimli eserinde el-Muafi b. Süleyman ve İsmaili'den Ebu Amir el-Akadi ve Ebu Davud vasıtasıyla -bu rivayetin lafzı ona aittir- şu nakilde bulunur: Fuleyh'in nakline göre Said b. el-Haris şöyle anlatmıştır: Fars diyarında İbn Ömer'le birlikte bulunuyordum. Orada şiddetli bir veba hastalığı baş gösterdi. Ben de oğlum sağ salim dönecek olursa yürüyerek Beytullaha gitmeyi adadım. Oğlum bize hastalanmış olarak geldi, sonra öldü buna ne dersin? İbn Ömer şöyle cevap verdi: \"Size adakta bulunmak yasak edilmedi mi? Nebi Sallallahu Aleyhi ve Sellem; \"Muhakkak ki Nezir (adak) hiçbir şeyi öne geçiremez, geriye de bırakamaz. Ancak Nezir (adak) sebebiyle cimriden (fakirler lehine) mal çıkarılır.)! buyurmuştur. İbn Ömer bu hadisi zikrettikten sonra \"Nezrini (adağını) yerine getir\" şeklinde bir ilave de bulundu. Ebu Amir \"Ey Ebu Abdurrahman! Ben oğlumun yürümsini nezretmiştim\" deyince, İbn Ömer \"Adağını yerine getir\" demiştir. İbn Ömer'in bu rivayetteki \"Onların nezirde bulunmaları yasak edilmedi mi?\" cümlesi bizce tartışılır. Çünkü onun zikrettiği merfu hadiste yasaklık açık olarak geçmemektedir. Fakat İbn Ömer bunu açıkça ifade etmektedir. Ondan sonraki Abdullah b. Murre el-Hemdani vasıtasıyla yapılan rivayette İbn Ömer şöyle demiştir: \"Nebi Sallallahu Aleyhi ve Sellem nezirde bulunmayı yasakladı.\" Bu isnadla Müslim' de yer alan rivayet ise \"Nebi Sallallahu Aleyhi ve Sellem bize nezirde bulunmamızı yasaklamaya başladı\" şeklindedir. (Müs!im, Nezir) Yine Müslim'de yer alan el-Ala b. Abdurrahman'ın babası vasıtasıyla Ebu Hureyre'den yaptığı nakilde yasaklık açık bir şekilde \"Nezirde bulunmayınız\" şeklinde yer almaktadır. (Müs!im, Nezir) Bilginler bu yasaklığın mahiyeti konusunda ihtilaf etmişlerdir. Bazıları bunu zahiri üzere anlarken, bazıları tevil etmişlerdir. İbnü'l-Esır, en-Nihaye'de şöyle der: Hadiste nezirde bulunmak yasaklığı tekerrür etmektedir. Bu, yasaklığı pekiştirmekte ve adakta bulunduktan sonra onu hafife almaktan kaçındırmaktadır. Yasaklık bundan kaçındırma manasında olsaydı ve adakta bulunmamak gerektiği anlamını taşısaydı bu adağın hükmünü iptal ve gereğini yerine getirmenin zorunluluğunu ıskat ederdi. Çünkü bu yasaklıkla adakta bulunmak masiyet haline gelir ve dolayısıyla kişiyi bağlamazdı. Oysa hadiste söylenmek istenen, yapılan adağın acil olarak herhangi bir faydayı getirmeyeceği ve zararı gidermeyeceği, kaderde olan bir şeyi değiştirmeyeceğidir. Bundan dolayı Nebi Sallallahu Aleyhi ve Sellem şöyle demek istemiştir: Allah'ın sizin için takdir etmediği bir şeyi elde edeceğiniz veya hakkınızda takdir ettiği bir şeyi çevireceğiniz zannıyla adakta bulunmayınız. Nezirde bulunduğunuzda onu yerine getiriniz. Çünkü yaptığınız adak sizi bağlar. Hattabİ, el-A'lam'da şöyle der: İlmin bu kısmı garibtir. Çünkü bir şeyin yapılması yasak ediliyor, fakat kişi onu yaptığında gereğini yerine getirmesi vacip oluyor. Şafillerin çoğunluğu nezrin sözkonusu yasaklıktan dolayı mekruh olduğundan söz etmişlerdir. Malikllerden de bu doğrultuda bir görüş nakledilmiştir. İbn Dakık el-Iyd onların bu görüşte olduğunu kesin bir dille ifade etmiştir. İbnü'lArabı ise bu mezhepte ihtilaf olduğuna işaret etmiştir. Şafillerden nakledilen kesin görüş, bunun mekruh olduğu yolundadır. Hattabı şöyle devam eder: Şafiller, delilolarak adağın sırf itaat nitelikli olmamasına dayanmışlardır. Zira nezirle saf ve halis bir yakınlık (kurbe) kastedilmez. Kişinin yaptığı bu adakla hedefi kendisine menfaat sağlamak ve bir zararı gidermektir. HanbeIller de kesin bir dille nezrin mekruh olduğunu ifade etmişlerdir. Tirmizi, adağın mekruh olduğu başlığını attıktan ve Ebu Hureyre hadisine yer verdikten sonra şöyle der: \"Nebi Sallallahu Aleyhi ve Sellem'in sahabilerinden ve başkalarından olmak üzere ilim ehli bazı kimseler nezdinde uygulama, onların adakta bulunmayı mekruh gördükleri yolundadır. İbnü'l-Mübarek şöyle demiştir: Mekruhluk, itaatte ve masiyette nezir (adak) konusunda geçerlidir. Bir kimse itaatte bulunacağına adakta bulunsa ve bunu yerine getirse ecir alır ancak nezirde bulunması mekruhtur. \"(Tirmizi, Nezir) Kurtubi, el-Müfhim'de hadislerde söz konusu olan yasaklığın bir şey karşılığında yapılan nezirle ilgili olduğu şeklinde yorumlandığını kesin bir dille ifade etmiş ve bu yasaklık \"Allah hastamı şifaya kavuşturursa şu kadar sadaka vermek üzerime nezr olsun\" gibi durumlarda sözkonusudur demiştir. Mekruhluk şuradan kaynaklanmaktadır. Söz konusu Allah'a yakınlaşma fiili, zikri geçen amacın gerçekleşmesine dayandırılınca buradan kulda Allah'a yaklaşmanın halisane olmadığı ortaya çıkıyor. Çünkü o burada karşılıklı bedel alış verişi yolunu tutmaktadır. Nitekim durumun böyle olduğunu hastası sağlığına kavuşmadığı takdirde onun şifasına bağladığı şeyi vermeyeceği ortaya koymaktadır. Bu bir cimrinin ruh halidir. Zira cimri, genellikle verdiğinden daha fazlasını peşin olarak almadıkça malından hiçbir şeyi elden çıkarmaz. Hadiste işaret edilen sebep budur. Zira Rasulullah nezir cimriden (normalde) elden çıkarmayacağı şeyleri çıkarır demiştir. Bu sakıncaya cahilin nezrin amacını gerçekleştireceği ya da Allahu Teala'ın hedeflediği şeyi kendisine bu nezir sebebiyle vereceği zannına kapılmasını eklemek mümkündür. Birinci durum küfre yakınken, ikincisi apaçık bir hatadır. Bizce bu ikincisi de küfre yakındır. Kurtubi alimlerin bu haberde yer alan yasaklığı mekruhluk şeklinde yorumladıklarını nakleder ve şöyle der: Benim anladığım bunun sözkonusu bozuk inanca kapılacağından korkulan kimseler açısından haramlık olduğudur. Dolayısıyla böyle bir kimsenin adakta bulunmaya kalkışması haram olur. Mekruhluk bu şekilde bir inanca kapılmayan kimseler için sözkonusudur. Kurtubi'nin bu ayrıntılı açıklaması güzeldir. Hadisten Çıkan Sonuçlar 1- Hadisten bir mükellefin iyilik olarak yapmaya başladığı bütün amellerin adakla üstüne aldığından daha faziletli olduğu anlaşılmaktadır. Bu görüş Maverdl'ye aittir. 2- Hadiste hayır işlerinde ihlas teşvik edilmekte ve cimrilik kınanmaktadır. 3- Hadise göre emredilen şeylere uyup, yasak edilenlerden kaçınan cimri sayılmaz",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 6695,
			"arabicnumber": 6695,
			"text": "İmran b. Husayn'ın nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Sizin en hayırlılarınız benim içinde bulunduğum nesildir. Sonra onların ardından gelenler, sonra da onların ardından gelenlerdir.\" İmran, Nebi Sallallahu Aleyhi ve Sellem kendi asrından sonra hayırlı asır olarak iki mi yoksa üç mü zikretti bilmiyorum, demiştir. Nebi Sallallahu Aleyhi ve Sellem devamla \"Sonra bir kavim gelir ki onlar adak adarlar ve bunu yerine getirmezler, hıyanet ederler ve kendilerine itimat edilmez; Bunlar şahitlik yapmaları istenmediği halde şahitlik ederler. Bunların arasında şişmanlık baş gösterecektir. \" Fethu'l-Bari Açıklaması: \"Ve la yu'temenune = Kendilerine itimat edilmez.\" Yani Nebiimizin işaret ettiği o asırdan sonra kimse onlardan güven içinde olmayacağı için bu apaçık bir hıyanettir. İbn Battal özetle şöyle demiştir: Nebi s.a.v. emanetine hıyanet edenle, adağını yerine getirmeyeni bir tutmuştur. Hıyanet kınanmıştır. Şu halde adağını yerine getirmemek de kınanmış olmaktadır. Bu açıklamayla hadisin atılan başlıkla olan ilişkisi ortaya çıkmaktadır",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 6696,
			"arabicnumber": 6696,
			"text": "Aişe r.anha'nın nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"Her kim Allah'a itaat etmeyi adarsa ona itaat etsin. Her kim de Allah'a karşı masiyet işlemeyi nezrederse sakın Allah'a asi olmasın!\" buyurmuştur. Fethu'l-Bari Açıklaması: \"İtaat Konusunda Nezir {adak).\" Yani adağın bu çeşidinin hükmü. Yukarıdaki başlığın \"babun\" şeklinde tenvinli olma ihtimali de vardır. İmam Buhari \"en-nezr fi't-taa\" ifadesiyle mübtedayı (özneyi) habere (yüklem) hasıretmektedir ki netice olarak buradan masiyete yapılan nezirin şer'an nezir olmadığı ifade edilmiş olmaktadır. \"Her kim Allah'a itaat etmeyi adarsa ona itaat etsin.\" \"İtaat\" vacib veya müstehab olmaktan daha geneldir. Vacib olan bir fiilde onu zamana bağlamak suretiyle nezirde bulunmak tasavvur edilebilir. Mesela bir kimse vakti girer girmez namaz kılmaya nezirde bulunsa belirlediği o vakitte bunu yapması gerekir. Mali ve bedeni tüm ibadetlerden müstehab olanlara gelince bunlar nezir (adak) sebebiyle vacib hale gelirler ve nezreden kimsenin kayıtladığı şey ile kayıtlanırlar. Bu haber itaat yolunda yapıldığı takdirde onu yerine getirmenin emredildiği, masiyet yolunda yapıldığı takdirde onu yerine getirmenin yasaklı ğı konusunda açık ve nettir. Acaba bir masiyetin işlenmesi adandığında yemin kefareti gerekir mi yoksa gerekmez mi? Bu konuda alimlerin iki görüşü sözkonusudur. Bunun açıklaması bundan iki başlık sonra gelecektir",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 6697,
			"arabicnumber": 6697,
			"text": "İbn Ömer'in nakline göre Hz. Ömer \"Ya Resulallah! Ben cahiliye devrinde Mescid-i Haram'da bir gece itikaf etmeyi nezretmiştim (ne yapayım)?\" dedi. Resulullah Sallallahu Aleyhi ve Sellem \"Nezrini yerine getir!\" buyurdu. Fethu'l-Bari Açıklaması: \"İslama Girmeden Önce Bir Kimse İle Konuşmayacağını Nezreden Veya Yemin Eden, Sonra da Müslüman Olan Kimsenin Durumu.\" Yani bu adağı yerine getirmek gerekli midir yoksa değil midir? Yukarıdaki başlıkta yer alan \"cahiliye\" kelimesinden maksat, kişinin İslamdan önceki durumudur. Cahiliye, esasen Nebi Sallallahu Aleyhi ve Sellem'in gönderilmesinden önceki durumun adıdır. Tahavı bu mesele için \"Müşrik iken adakta bulunup, sonra Müslüman olan kimsenin durumu\" şeklinde bir başlık kullanmıştır ve sonra bunun ne demek olduğunu açıklamıştır. Tahavı orada Hz. Ömer'in cahiliye döneminde itikafta bulunacağına dair yaptığı adak hakkındaki İbn Ömer hadisine yer vermiştir. Nebi Sallallahu Aleyhi ve Sellem ona 'f\\dağını yerine getir\" emrini vermiştir. İbn Battal şöyle der: İmam Buhari yemini, adağı, konuşmamayı itikafa kıyaslamıştır. Buna göre bir kimse Müslüman olmadan önce herhangi bir şeyi yapacağına dair yemin etse veya adakta bulunsa Müslüman olduğu takdirde bunu yerine getirmesi gerekir. Çünkü o kişi Müslüman olduğunda Hz. Ömer olayının zahirine göre adağını yerine getirmek kendisine vacib olmaktadır. İbn Battal, İmam Şafil ve Ebu Sevr'in de bu kanaatte olduklarını belirtmiştir. İbn Hazm da İmam ŞafiJ'den bu şekilde bir görüş nakletmiştir. Şafil mezhebinde meşhur olan görüşe göre bu, onlardanbazılarının görüşüdür. İmam Şafiı ve arkadaşlarına göre böyle bir yemin veya nezre uymak gerekmez. Tam tersine bu müstehabtır. Malikilerin ve Hanemerin görüşü de bu doğrultudadır. Bir rivayete göre Ahmed b. Hanbel bunun vacib olduğunu söylemiştir. Taberi, Malikllerden el-Muğiia b. Abdurrahman, İmam Buhari, Davı}d ve ona uyanlar bunun vacib olduğunu kesin bir dille ifade etmişlerdir. Biz de şunu ekleyelim: İmam Buhari' den bundan önce böyle bir yemin veya nezri yerine getirmenin vacib olduğuna dair açık bir ifade mevcutsa ne ala! Aksi takdirde onun attığı başlık, yalın olarak kendisinin buna uymanın vacib olduğunu söylediğini göstermez. Zira bu başlık, onun böyle bir yemin veya nezri yerine getirmenin mendub olduğunu söylediğine de muhtemeldir. Buna göre soru, \"Böyle bir kimseye nezrine uymak medup olur mu olmaz mı?\" şeklinde takdir edilir",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 6698,
			"arabicnumber": 6698,
			"text": "Sa'd b. Ubade el-Ensarı, anasının üzerinde bir adak (nezir) olduğunu, fakat bunu yerine getiremeden vefat ettiğini Nebi'e söyleyip fetva istedi. Resulullah Sallallahu Aleyhi ve Sellem ona anası adına o adağı kaza edip yerine getirmesi fetvasını verdi. Zührl, bu, dinde meşru bir kanun oldu demiştir",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 6699,
			"arabicnumber": 6699,
			"text": "İbn Abbas r.a. şöyle demiştir: Nebi Sallallahu Aleyhi ve Sellem'e bir adam geldi ve \"Kız kardeşim hac yapmayı adamıştı, adağını yerine getiremeden vefat etti\" dedi. Nebi Sallallahu Aleyhi ve Sellem \"Şayet kardeşinin üzerinde bir borç olsaydı sen o borcu öder miydin?\" diye sordu. O zat \"Evet, öderdim\" dedi. Nebi Sallallahu Aleyhi ve Sellem \"Öyleyse Allah'a olan borcu da öde, Allah hakkı ödenmeye daha layıktır\" buyurdu. Fethu'l-Bari Açıklaması: \"Üzerinde Bir Adak (nezir) Olduğu Halde Ölen Kimsenin Durumu.\" Yani bu Nezir (adak) onun adına kaza edilir mi yoksa edilmez mi? İmam Buharl'nin burada zikrettiği hadise göre bu onun adına kaza edilmelidir. Fakat bu kaza vacib olduğu için mi yoksa mendub olduğu için mi yapılmalıdır? Bu konuda açıklaması ileride gelecek ihtilaf sözkonusudur. Sa'd b. Ubade'nin naklettiği olayın son kısmında yer alan \"fekanet sünneten ba'du\" ifadesi, varisin miras bırakan üzerindeki adağı kaza etmesi vaciblik veya mendubluktan daha genel, dini bir yol haline geldi demektir. Bu hadis vacib olan hakların ölü adına kaza edilmesi gerektiğini ifade etmektedir. Çoğunluk üzerinde mali bir adak olduğu halde ölen kimse bunu vasiyet etmese bile kendi sermayesinden kaza edilmesinin gerekli olduğu görüşünü benimsemiştir. Ancak sözkonusu nezir (adak), kişinin ölümüyle sonuçlanaMastalığında yapılmışsa sözkonusu mali kaza, bıraktığı malın üçte biriyle sınırlıdır. Maliki ve Hanefiler ölen kişinin bunu mutlak olarak vasiyet etmesinin şart olduğu kanaatini benimsemişlerdir. Çoğunluk ise yukarda yer verilen Ümmü Sa'd hadisi ile Zühri'nin \"Bu dinde meşru bir kanun haline geldi\" şeklindeki sözünü esas almışlardır. Fakat Sa'd'ın bunu annesinin bıraktığı maldan kaza etme ihtimali olduğu gibi kendi yanından teberru şeklinde vermiş olması da muhtemeldir. Hadisten bir konuyu iyi bilen kimseden fetva istemenin meşru olduğu, vefatıarından sonra anne ve babaya iyilik etmenin faziletli bir hareket olduğu, onların zimmetlerindeki borçtan kurtulmalarının çaresini bulmak gerektiği anlaşılmaktadır",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 6700,
			"arabicnumber": 6700,
			"text": "Aişe'nin nakline göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Her kim Allah'a itaat etmeyi adarsa o kişi ona itaat etsin. Her kim de Allah'a karşı masiyet olacak bir iş nezrederse o da ona asi olmasın",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 6701,
			"arabicnumber": 6701,
			"text": "Enes'in nakline göre Nebi Sallallahu Aleyhi ve Sellem iki oğlu arasında (hac yolunda) yürümekte olan bir ihtiyarı gördüğünde Allah bu (ihtiyarın) kendi nefsine azap etmek suretiyle yaptığı ibadetten elbette müstağnidir\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 6702,
			"arabicnumber": 6702,
			"text": "İbn Abbas'ın nakline göre Resulullah Sallallahu Aleyhi ve Sellem Kabe'yi bir yular veya yulardan başka bir bağ ile tavaf etmekte olan bir adam gördü ve o bağı kopardı",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 6703,
			"arabicnumber": 6703,
			"text": "İbn Abbas'ın nakline göre Resulullah Sallallahu Aleyhi ve Sellem Kabe'yi tavaf ederken birisine rastladı. O kişi burnundan bir yularla bağlanmış olan diğer bir insanı önünden çekerek tavaf ettiriyordu. Nebi Sallallahu Aleyhi ve Sellem hemen o yuları kendi eliyle kopardı. Sonra yanındaki adama onu eliyle tutmak suretiyle tavaf ettirmesini emretti",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 6704,
			"arabicnumber": 6704,
			"text": "İbn Abbas şöyle demiştir: Nebi Sallallahu Aleyhi ve Sellem hutbe okurken güneşte dikilmiş bir adam gördü de onun ismini ve halini sordu. Sahabiler \"O Ebu İsrail'dir, ayakta dikilmeye, oturmamaya, güneşten gölgelenmemeye, konuşmamaya ve bu suretle oruç tutmaya nezretmiştir\" dediler. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem O zata \"Ona söyle konuşsun, gölgelensin, otursun ve orucunu tamamlasın!\" diye emretti. Fethu'l-Bari Açıklaması: \"Bir Kimsenin Malik Olmadığı Şey İle Masiyet Konusundaki Nezrinin Hükmü.\" İbn Battal'ın şerhinde \"Masiyet konusunda nezr {adak} yoktur\" cümlesi yer almaktadır. İbn Battal şöyle der: İmam Buhari bu konuda Aişe r.anha'nın rivayet ettiği; \"Her kim Allah'a itaat etmeyi adarsa o kişi ona itaat etsin. Her kim de Allah'a karşı masiyet olacak bir iş nezrederse o da ona asi olmasın.\" hadisine, ardından iki oğlu arasında hac yolunda yürümekte olan bir ihtiyarın Nebi Sallallahu Aleyhi ve Sellem'in bunu yapmasını yasakladığından söz eden Enes hadisine, Kabe'yi bir yular veya yulardan başka bir bağ ile tav af etmekte olan ve kendisine yasak getirilen İbn Abbas hadisine, ayakta dikilmeye, oturmamaya, güneşte gölgelenmemeye nezreden ve o hareketine yasaklık getirilen kişi hakkındaki İbn Abbas hadisine yer vermiştir. İbn Battal bu hadislerin kişinin malik olmadığıkonularda nezirde bulunması konusu ile ilgisi olmadığını, bunların masiyet hakkında nezirle ilgili olduğunu söylemiştir. İbnü'l-Müneyyir ise isabetli olanın İmam Buharl'nin yaptığı olduğunu söylemiştir. Çünkü Buhari, kişinin malik olmadığı hususlarda yaptığı nezrin bağlayıcı olmadığını, masiyet konusunda yapılan nezrin bağlayıcı olmamasından çıkarmıştır. Zira kişinin başkasının malik olduğu bir mal konusunda nezirde bulunması, onun izni olmadan mülkünde tasarrufta bulunmak anlamına gelir ki bu da masiyettir. Sözkonusu hadisin lafzı \"Adamın biri Nebi Sallallahu Aleyhi ve Sellem döneminde Büvane denilen yerde bir deveyi boğazlamayı nezretmişti\" şeklindedir. (Ebu Davud Eyman ve'n-nuzur) Aynı hadisi Müslim, esir iken Nebi Sallallahu Aleyhi ve Sellem'in devesine binip kaçan kadının olayının anlatıldığı İmran b. Husayn hadisi olarak nakletmiştir.(Müslim, Nezir) Bu kadını esir edenler kaçtığını fark edince peşine düştüler. Kadın da bunlardan kurtulduğu takdirde sözkonusu deveyi Allah için keseceğine nezretti. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem \"Masiyet konusunda nezir (adak) olmadığı gibi Adem oğlunun malik olmadığı husus/arda da nezir yoktur\" buyurdu. Bilginler bu şekilde nezir (adak) yapan kimseye kefaret gerekip gerekmediği konusunda ihtilaf etmişlerdir. Çoğunluk, gerekmediği görüşünü benimsemiştir. Kendisinden nakledilen bir görüşünde Ahmed b. Hanbel, Sevri, İshak, bazı Şafii alimleri ve Hanefiler ise gerektiği kanaatine varmışlardır. Tirmizi sahabenin bu konuda iki ayrı görüşe ayrıldığını nakletmiştir. Bilginler masiyet konusunda adakta bulunmanın haram olduğu noktasında ittifak etmişlerdir. Onların ihtilafı sadece kefaretin gerekli olup olmadığı noktasındadır. İbn Abbas'ın rivayet ettiği hadise göre bir kimsenin mubah olan sözleri söylemeyip, sükut etmesi Allah'a itaat sayılmaz. Hadise göre yalın ayak yürümek, güneşin altında oturmak gibi kitap veya sünnetten meşruluğuna delilolmayan hareketlerden şu anda değilse bile ilerde insanın eziyet duyacağı her türlü şeyin Allah'a itaat olmadığı anlaşılmaktadır. Netice olarak bu gibi şeyleri yapmaya nezretmek geçerli olmaz. Zira Nebi Sallallahu Aleyhi ve Sellem, Ebu İsrail' e adadığı şeylerden sadece orucunu tamamlamasını emretmiştir. Bu, Nebi Sallallahu Aleyhi ve Sellem'in orucu tamamlamanın ona meşakkat vermeyeceğini bildiği şeklinde yorumlanmıştır. Buna karşılık kendisine ayakta dikilmeyip oturmasını, konuşmasını ve güneşten kaçınıp gölgede durmasını emretmiştir. Kurtubi şöyle der: Ebu İsrailolayı bir masiyeti işlemeye veya itaat sayılmayan bir hareketi yapmaya nezreden kimseye kefaret gerekmediği görüşünü benimseyen çoğunluğu destekleyen delillerin en açığıdır. İmam Malik, kendi naklettiği hadisin açıklamasında Nebi Sallallahu Aleyhi ve Sellem'in ona kefaret vermesini emrettiğini duymadım demiştir",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 6705,
			"arabicnumber": 6705,
			"text": "Hakim b. Ebi Hurra el-Esleml'nin nakline göre Abdullah b. Ömer' e bundan sonra karşılaşacağı her gün muhakkak oruç tutacağına nezreden ve bu orucu da kurban veya ramazan bayramı gününe tesadüf eden kimsenin durumu soruldu. İbn Ömer şöyle dedi: \"Andolsun ki Resulullah Sallallahu Aleyhi ve Sellem sizin için Allah'a ve ahiret gününe kavuşmayı umanlar ve Allah'ı çok zikredenler için güzel bir örnektir. \"(Ahzab 21) Resulullah Sallallahu Aleyhi ve Sellem kurban ve ramazan bayramı günlerinde oruç tutmazdı. Biz onun bugünlerde oruç tu.tmasını (doğru) görmeyiz",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 6706,
			"arabicnumber": 6706,
			"text": "Ziyad b. Cubeyr şöyle anlatmıştır: İbn Ömerin beraberinde bulunduğum bir sırada adamın biri \"Ben yaşadığım sürece her Salı veya her Çarşamba günü oruç tutmaya nezrettim ve orucumu tutarken şu kurban bayramı gününe rast geldim\" deyip, hükmünü sordu. İbn Ömer: \"Allah adaklarınızı yerine getirmenizi emretti. Nebi Sallallahu Aleyhi ve Sellem kurban bayramı günü oruç tutmayı yasakladı\" diye cevap verdi. Soruyu soran sorusunu tekrarlayınca İbn Ömer hiçbir şey ilave etmeyerek önceki sözün benzerini aynen tekrarladı.\" Fethu'l-Bari Açıklaması: \"GÜnlerce\" yani muayyen bazı günlerde \"Oruç Tutmayı Nezredip Orucu Kurban veya Ramazan Bayramı Günlerine Tesadüf Eden Kimsenin Durumu.\" Yani böyle bir kimsenin oruç tutması veya bedel ödemesi ya da kefaret vermesinin caiz olup olmadığı. Bir kimsenin ramazan bayramı veya kurban bayramı günlerinde gerek tatavvu, gerekse nezir olarak oruç tutmasının caiz olmadığı noktasında icma oluşmuştur. Bu iki günü veya birisini adakla kişi kendisi tayin etmiş veya tesadüfen her iki güne veya birisine rastlamış olsun farketmez. Bir kişi böyle bir nezirde bulunursa çoğunluğa göre yaptığı nezir (adak) geçerli değildir. Hanbeli mezhebinde böyle bir kişinin orucunu kaza edip etmemesi gerektiği noktasında iki görüş vardır. İmam Ebu Hanife çoğunluğa muhalif olmuş ve bir kimse böyle bir günde oruç tutmaya nezreder ve orucunututarsa nezrini yerine getirmiş olur demiştir. Bu konudaki geniş açıklama Siyam Bölümünün sonla-. rında geçmişti. Orada nezirde bulunan kimsenin belli bir günü belirleyip, sonra bunun ramazan veya kurban bayramı günlerine tesadüf etmesi konusunda hükmün ne olacağı noktasında meydana gelen ihtilaftan söz etmiştik",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 6707,
			"arabicnumber": 6707,
			"text": "Ebu Hureyre şöyle anlatmıştır: Nebi Sallallahu Aleyhi ve Sellem'e birlikte Hayber günü yola çıktık Ne altın, ne gümüş ganimet aldık. Biz oradan birçok mallar (hayvan sürüleri), elbise, eşya ganimeti aldık. Dubeyb oğullarından Rifaa b. Zeyd, Mid'am adında bir köleyi Nebi Sallallahu Aleyhi ve Sellem'e hediye etti. Resulullah Sallallahu Aleyhi ve Sellem onu Vadi'l-Kura'ya gönderdi. Mid'am oraya vardığında Nebi Sallallahu Aleyhi ve Sellem'in eşyasını indirirken kendisine kimin attığı bilinmeyen bir ok isabet etti ve onu öldürdü. İnsanlar \"Cennet ona mübarek olsunı\" dediler. Resulullah Sallallahu Aleyhi ve Sellem; \"Hayır! Hayber gününde ganimetler bölüşülmeden almış olduğu bir örtü şimdi onun üzerinde bir ateş o/up yanmaktadır\" dedi. İnsanlar korktu. Bunun üzerinebirisi bir veya iki ayakkabı tasmasını geri getirdi. Nebi Sallallahu Aleyhi ve Sellem \"Ateşten bir ayakkabı tasması veya iki ayakkabı tasması\" dedi. Fethu'l-Bari Açıklaması: İbn Abdülberr ve onun görüşünde olan bazıları şu görüşü benimsemişlerdir. Ebu Hureyre'nin kabilesi olan Dev's lehçesinde \"el-mal\" kelimesi mal ve kumaş gibi ayn olmayan şeylere denir. Bir grup bilgine göre \"el-mal\" altın ve gümüş gibi ayn denilen maddelere verilen isimdir. Arapların kullanımından bilinen, insanın malolarak mülkiyetine geçirdiği ve malik olduğu her şeye \"mal\" denilir. İmam Buhari attığı başlıkta zikrettiği hadislerle birlikte bu görüşü tercih ettiğine işaret etmektedir. Hz. Ömer'in \"Öyle bir toprak parçası elime geçti ki daha önce bundan daha nefis bir mala sahip olmadım\", Ebu Talha'nın\" Bence mallarımın en sevimlisi Beyruha'da bulunanlardır\" ve Ebu Hureyre'nin \"Ne altın, ne gümüş ganimet aldık\" cümleleri buna örnektir. Bu görüşü Allahu Teala'ın \"Allah'ın geçiminize dayanak kı/dığı mallarınızı aklı ermez/ere vermeyin\"(Nisa 5) ayet-i kerimesi de bu görüşü teyid etmektedir. Çünkü ayette geçen \"mal\" kelimesi insanın malik olduğu her şeyi kapsamaktadır. Dilcilerin \"Araplar mal kelimesini mutlak olarak kullandıklarında nazarlarında şerefli olduğu için sadece deve için kullanırlar\" şeklindeki ifadelerine gelince, bu cümle onların deveden başkasına mal demelerini ortadan kaldırmaz. Araplar deve dışındaki diğer hayvanlara da mal demişlerdir",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 84
			}
		}
	]
}