{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"84": "Expiation for Unfulfilled Oaths"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6708,
			"arabicnumber": 6708,
			"text": "Ka'b İbn Ucre'nin şöyle dediği nakledilmiştir: Nebi Sallallahu Aleyhi ve Sellem'e geldim. Bana \"yak/aş\" dedi. Ben de yaklaştım. Bana \"Başındaki bit/er sana rahatsız/ık veriyor mu?\" diye sordu. \"Evet veriyor\" diye cevap verdim. Nebi Sallallahu Aleyhi ve Sellem \"Oruç tutarak veya sadaka vererek ya da kurban keserek fidye vermen gerekir\" buyurdu. Fethu'l-Bari Açıklaması: Yukarıda belirtilen hususlara \"kefaret\" denilmesi, günahları örtmesinden dolayıdır. Rağıb konu ile ilgili olarak şöyle bir açıklama yapmaktadır: \"Kefaret\", yeminini bozan kimsenin verdiği şeydir. Bu kelime, adam öldürme ve zıhar kefaretinde de kullanılır. Kelime \"tekfir\" kökündendir. Bu kök, bir fiili örtme ve üzerini kapatma anlamına gelir. Kefareti verilen fiil, hiç yapılmamış gibidir. Allahu Teala bu kelimeyi bir ayette şöyle kullanır: \"Eğer ehl-i kitap iman edip sakınsaydı herhalde (geçmiş) kötülüklerini örterdik. \"(Maide 65) Bu ayetteki \"lekefferna\" kelimesi, izale ederdik, yok ederdik anlamınadır. \"Allahu Teala 'ın 'Yeminin kefCıreti on fakiri doyurmaktır\" İmam Buharl'nin bu ayete yer vermekten maksadı, ayetin tamamıdır. Ayette belirtilen sayıya uymak gerektiği kanaatini taşıyan çoğunluk, bu ayeti delilolarak almıştır. \"On fakire vermek gereken miktarı, bir kişiye verince yeterli olur\" diyenlere karşı bu ayet delil olarak alınmıştır. Bu görüş, İbn Ebi Şeybe tarafından Hasan-ı BasrI'den nakledilmiştir. \"İbn Abbas, Ata ve İkrime'nin şöyle dedik/eri nak/edilmiştir: Kur'an-ı Kerim'de \"ev=veya\" ev=veya\" harfi ile belirtilen hüküm/erde mükellefmuhayyerdir\" İbn Battal şöyle der: Bu, alimler arasında üzerinde görüş birliği edilen bir husustur. Bilginler fakire ne kadar yedirileceği konusunda ihtilaf etmişlerdir. Çoğunluğun kanaatine göre her bir fakire Nebi Sallallahu Aleyhi ve Sellem'in müddü ile bir müd buğday verilmelidir. İmam Malik, Medine'li fakirlere verilecek buğday cinsinin farklı olduğu kanaatine varmış ve onlar açısından -başka şehirlerin aksine- ortalama geçimleri olacağı gerekçesiyle tükettikleri buğdayı esas almıştır. Ona göre her bir belde halkı açısından itibar edilmesi gereken, ortalama geçimin sağlandığı buğday cinsidir. İbnü'l-Kasım, bu konuda İmam Malik'e muhalefet etmiş ve çoğunluğun yanında yer almıştır. Kufeliler verilmesi vacip olanın yarım sa' buğdayolduğu kanaatine varmışlardır. Birinci görüşün delili, Resulullah Sallallahu Aleyhi ve Sellem'in Ramazanda oruçlu iken eşiyle ilişkiye giren kişinin kefareti hakkında her bir fakire bir müd verileceği yolundaki emridir",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6709,
			"arabicnumber": 6709,
			"text": "Ebu Hureyre r.a. şöyle anlatır: Adam'ın biri Nebi Sallallahu Aleyhi ve Sellem'e gelerek \"mahvoldum\" dedi. Resulullah Sallallahu Aleyhi ve Sellem \"Derdin nedir?\" diye sordu. Adam \"Ramazan günü oruçlu iken eşimle ilişkide bulundum\" dedi. Resulullah Sallallahu Aleyhi ve Sellem \"Bir köleyi özgürlüğüne kavuşturabilir misin?\" deyince adam \"hayır\" diye cevap verdi. Nebi Sallallahu Aleyhi ve Sellem \"İki ay peşpeşe oruç tutabilir misin?\" diye sordu. Adam \"hayır\" dedi. Resulullah Sallallahu Aleyhi ve Sellem ''Altmış fakiri doyurmaya gücün yeter mi?\" deyince, adam \"hayır\" dedi. ResuluIlah Sallallahu Aleyhi ve Sellem \"Otur\" dedi ve adam oturdu. O arada Resulullah Sallallahu Aleyhi ve Sellem'e bir arak hurma getirildi. Arak büyükçe bir kabın adıdır. Nebi Sallallahu Aleyhi ve Sellem O kişiye : \"Bunu al ve tasadduk et\" buyurdu. Adam \"Bizden daha fakirine mi?\" deyince, Nebi Sallallahu Aleyhi ve Sellem azı dişleri görülecek kadar güldü ve \"Bunu al da çoluk çocuğuna yedir\" buyurdu. Fethu'l-Bari Açıklaması: İmam Buhari', bu konuda, ramazan günü oruçlu iken eşiyleilişkide bulunan kimsenin durumuna değinen hadise yer verdi. Bu hadisin açıklaması oruç bölümünde uzun uzadıya geçmişti. O bölümde kefaret verecek bir şey bulamayan ve oruç da tutamayan kimseden bu yükümlülüğün düşeceği veya zimmetinde borç olarak kalacağı konusundaki farklı görüşlere de yer vermiştik. İbnü'l-Müneyyir şöyle der: İmam Buhari'nin maksadı, eşiyle ilişkide bulunan kocaya kefaretin o günahı işlemesi nedeniyle farz olması gibi, yemini bozmakla farz olduğu noktasına dikkat çekmektir. İmam Buhari, fakirin zimmetinden kefaret yükümlülüğünün düşmediğine işaret etmektedir. Çünkü Resulullah Sallallahu Aleyhi ve Sellem kendisine gelen kişinin fakir olduğunu biliyordu. Bununla birlikte ona -tıpkı bir fakire borcunu ödemesi için para vermesi örneğinde olduğu gibi- kefaretini ödemesi için o hurmayı verdi",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6710,
			"arabicnumber": 6710,
			"text": "Ebu Hureyre şöyle anlatmıştır: Adamın biri Resulullah Sallallahu Aleyhi ve Sellem'e gelerek \"Mahvoldum\" dedi. Nebi Sallallahu Aleyhi ve Sellem \"Nedir mesele?\" diye sorunca, adam \"Ramazan günü oruçlu iken eşimle ilişkiye girdim\" dedi. Nebi Sallallahu Aleyhi ve Sellem \"Bir köle bulabilir misin?\" diye sordu. Adam \"Hayır\" deyince, Resulullah Sallallahu Aleyhi ve Sellem \"İki ay peşpeşe oruç tutabilir misin?\" diye sordu. Adam \"Hayır\" dedi. Resulullah Sallallahu Aleyhi ve Sellem ''Altmış fakiri doyurmaya gücün yeter mi?\" deyince, adam \"hayır\" diye cevap verdi. O sırada Ensardan birisi bir arakla çıkageldi. Arak, içinde hurma konulan bir kaptır. Resulullah Sallallahu Aleyhi ve Sellem adama \"Bunları al götür ve m uhtaç olan birine tasadduk et\" dedi. Adam \"Ya Resulallah! Bizden daha fakir olana mı? Seni hakla gönderen Allah'a yemin olsun ki Medine'nin kara taşlı iki yanı arasında bizden daha fakir bir aile yoktur\" dedi. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem \"Git ve onu çoluk çocuğuna yedir\" buyurdu. Fethu'l-Bari Açıklaması: İmam Buhari bu konuda daha önce yukarıdaki Ebu Hureyre hadisine yer vermişti. Hadisin atılan başlıkla ilişkisi açıktır. Ramazan günü oruçlu iken eşiyle ilişkiye giren fakire kefaretini vermesi için yardım etmek nasıl caizse, aynı şekilde ettiği yemini bozan fakire de kefaretini vermesi için yardımda bulunmak da caizdir",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6711,
			"arabicnumber": 6711,
			"text": "Ebu Hureyre şöyle demiştir: Adamın biri Resulullah Sallallahu Aleyhi ve Sellem'e gelerek \"mahvoldum\" dedi. Nebi Sallallahu Aleyhi ve Sellem \"Derdin nedir?\" diye sordu. Adam \"Ramazan günü eşimle oruçlu iken ilişkiye girdim\" dedi. Nebi Sallallahu Aleyhi ve Sellem \"Bir köleyi özgürlüğüne kavuşturacak mali gücün var mı?\" diye sordu. Adam \"Hayır\" deyince, Resulullah Sallallahu Aleyhi ve Sellem \"İki ay peşpeşe oruç tutabilir misin?\" dedi. Adam \"Hayır\" cevabını verdi. Nebi Sallallahu Aleyhi ve Sellem \"Altmış fakiri doyurmaya gücün yeter mi?\" diye sorunca, adam \"Doyuracak bir şey bulamam\" dedi. O sırada Nebi Sallallahu Aleyhi ve Sellem'e bir arak (zembil) dolusu hurma getirildi. Efendimiz sallallahu aleyhi ve sellenı \"Bunu al ve sadaka olarak dağıt\" dedi. Adam \"Bizden daha fakirine mi? Medine'nin kara taşlı iki yanı arasında bizden daha fakir bir aile yoktur\" deyince, Nebi Sallallahu Aleyhi ve Sellem \"Onu al ve çoluk çocuğuna yedir\" buyurdu. Fethu'l-Bari Açıklaması: On fakirin doyurulacağı hükmü, Kur'an'ın yemin kefareti ile ilgili ayetinin gereğidir. Bu konudaki ihtilafı az önce belirtmiştik. Yakın fakirle uzak fakirin aynı olması konusunda İbnü'l- Müneyyir şöyle der: İmam Buhari bu konuda daha önce yukarıda zikredilen Ebu Hureyre hadisine yer verdi. Bu hadiste sadece \"Onu çoluk çocuğuna yedir\" emri yer almaktadır. Kefaret bedelini -akrabalara vermek caiz olduğuna göre, akraba olmayan fakirlere vermek evleviyetle caiz olur. İmam Buhari kefareti akrabalam vermenin caizliği konusunda yemin kefaretini Ramazan günü oruçlu iken ilişkide bulunma kefaretine kıyas etmiştir. Kanaatimizce \"Onu çoluk çocuğuna yedir\" emrini, kefaretle ilgili olarak yorumlayan bütün bilginlerin zihnindeki düşünce budur. Nebi Sallallahu Aleyhi ve Sellem'in hadiste adı geçen hurmayı o fakire ailesine harcaması için verdiği ve eli genişleyinceye dek kefaretin zimmetinde borç olarak kalmaya devam edeceği kanaatinde olan bilginlere göre böyle bir kıyas isabetli değildir. Aynı şekilde sözkonusu kıyas, kefaret borcunun fakirden mutlak olarak sakıt olacağı kanaatinde olan bilginlere göre de doğru değildir. Bu konu oruç bölümünde daha önce incelenmiş ve ihtilaflara yer verilmişti. İmam Şafii'nin mezhebi, bir kimsenin, -nafakalarını temin etmekle yükümlü olduğu yakınları hariç- akrabalam kefaret verilmesinin caiz olduğu yönündedir. Bu konunun bir uzantısı da kefaret verilecek kimselerin mümin olmalarının şart olup olmadığıdır. Çoğunluğa göre fakirIerin mümin olmaları şarttır. Rey ehli bilginler buna zimmliere kefaret vermenin caiz olduğu hükmüyle cevap vermişlerdir. Ebu Sevr de onlara katılmıştır",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6712,
			"arabicnumber": 6712,
			"text": "Saib b. Yezid r.a. şöyle demiştir: \"Nebi Sallallahu Aleyhi ve Sellem'in dönemindeki sa', sizin bugünkü kullandığınız müd ile bir müdd ve bir müddün üçte biri idi. Ömer b. Abdulaziz zamanında sa' ölçeğinde artırma yapılmıştır",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6713,
			"arabicnumber": 6713,
			"text": "Nafi şöyle demiştir: \"İbn Ömer Ramazan zekatını (yani fıtır sadakasını) Nebi Sallallahu Aleyhi ve Sellem'in müddü olan ilk müdle veriyordu. O yemin kefaretinde de Resulullah Sallallahu Aleyhi ve Sellem'in müddünü esas alıyordu. Ebu Kuteybe şöyle der: İmam Malik bize dedi ki: Bizim müddümüz sizinkinden daha büyükdür. Nebi Sallallahu Aleyhi ve Sellem'in müddünden başkasında herhangi bir fazilet görmüyoruz. İmam Malik bana sordu: \"Herhangi bir emir size gelse ve Resulullah Sallallahu Aleyhi ve Sellem'in müddünden daha küçük bir müdd bassa (darb etse) zekatınızı bunlardan hangisiyle verirsiniz?\" Ona şöyle cevap verdim: \"Nebi Sallallahu Aleyhi ve Sellem'in müddüyle veriyordu k. \" Bunun üzerine İmam Malik şöyle dedi: \"Bu konUda Resulullah Sallallahu Aleyhi ve Sellem'in müddünün esas alınacağı kanaatinde değil misin?",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6714,
			"arabicnumber": 6714,
			"text": "Enes b. Malik r.a.'den nakledilmiştir: Resulullah Sallallahu Aleyhi ve Sellem \"Ya Rabbi! Onların ölçeklerini, sa'larını ve müddIerini mübarek kıl\" diye dua etmiştir. Fethu'l-Bari Açıklaması: İmam Buhari bu başlıkla din! hüküm gereğince verilmesi gerekli olan şeylerde Medinelilerin sa'ının esas alınması gerektiğine işaret etmiştir. Zira şer'! hükümler öncelikle bu ölçüler esas alınarak getirilmiştir. İmam Buhari bu görüşünü Nebi Sallallahu Aleyhi ve Sellem'in bu konuda onlara bereket duası ile teyit etmiştir. \"Medinelilerin asırdan asıra kullana geldikleri ağırlık ve hacim birimleri\" İmam Buhari bu cümleyle Medine'de müdd ve sa'ının -mütevatir olarak nakledildiği için- kendi zamanına kadar hiç değişmediğine işaret etmektedir. İmam Malik, İmam Ebu Yusuf'la aralarında geçen meşhur olayda bu haberi delil olarak kullanmıştır. Ve Ebu Yusuf sa' ın miktarı konusunda Kufelilerin görüşünden, Me dinelilerin görüşüne dönmüştür. \"İmam Malik bana sordu: Herhangi bir emir size gelse ... \" İmam Malik, bu ifadesi ile muhalifini susturmak istemiştir. Çünküuygulamaya muhalif olma açısıı:dan arttırmayla eksiltme arasında hiçbir fark yoktur. Fitre, yemin kefareti ve fakirleri doyurma gibi müdd üzerinden verilmesi hükme bağlanan başka yükümlülükleri ifa etmede Şam müddünü esas alan bilgin, müddün daha fazlasını almak daha evladır görüşünü delil olarak ileri sürerse ona şöyle cevap verilir: Şari'in takdir ettiğine uymak bereket olarak yeter. Fazla olan miktarı almak suretiyle meşru kılınana muhalefet caiz olsa, o zaman onu eksilterek muhalefet de caiz olur. Uygulamaya muhalif olan, eksiği almaktan kaçındığında İmam Malik ona şöyle der: Bu konuda Resulullah Sallallahu Aleyhi ve Sellem'in müddünün esas alınacağı kanaatinde değil misin? Çünkü sözkonusu üç müdd yani birincisi, sonradan icad edilen Şam müddü -ki bu ondan daha fazladır- ve şu an mevcut değilse de ileride birincisinden daha hafif olarak basılacağı farz edilen üçüncüsü birbirinden farklı olunca birincinin esas alınması daha evla olmuştur. Çünkü meşruluğu tahakkuk eden odur. İbn Battal şöyle demiştir: Bu haberin delil değeri Medinelilerin bu uygulamayı asırdan asıra ve nesilden nesile birbirlerinden miras olarak devralmalarıdır. İbn Battal, Ebu Yusuf'un müd d ve sa'ın takdiri konusunda İmam Malik'in görüşüne döndüğünü ve onun görüşünü esas aldığıri.i ifade etmiştir",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6715,
			"arabicnumber": 6715,
			"text": "Ebu Hureyre r.a.'in nakline göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Kim bir Müslüman köleyi azad edip hürriyetine kauuşturursa Allahu Teala o köleden bir organa karşılık azad edinin bir organını hatta onun cinselorganına mukabil bununkini cehennem ateşinden aza d edip kurtarır.\" Fethu'l-Bari Açıklaması: \"Yahut da bir köle azad etmektir\" ayeti, yemin kefareti ile ilgili ayette geçen kölenin, -adam öldürme (katl) kefaretini konu alan ayetin aksine- mutlak olduğuna işaret etmektedir. Çünkü adam öldürme (katı) kefaretinde azad edilecek köle, \"iman\" la kayıtlanmıştır. İbn Battal şöyle der: Aralarında Evzaı, İmam Malik, Şafiı, Ahmed b. Hanbel ve İshak'ın da bulunduğu çoğunluk, mutlakı mukayyed gibi değerlendirmişlerdir. Aynen bunun gibi \"(Genellikle) alışveriş yaptığınızda şahit tutun\"(Bakara 282) ayetindeki mutlak \"şahid\"i, \"İçinizden adalet sahibi iki kişiyi de şahit tutun\"(Talak 2) ayetindeki mukayyede (adil şahit) olarak yorumlamışlardır. Kufeliler bu anlayışa muhalif olarak şöyle demişlerdir: Katir olan bir köleyi hürriyetine kavuşturmak caizdir. Ebu Sevr ve İbnü'l-Münzir bu konuda onlara katılmıştır. İmam Buhari et-Tarihu'I-Kebir'inde bu görüşün delilini şu anlayışa dayandırmıştır. Adam öldürme kefareti, yemin kefaretinin aksine ağırlaştırılmıştır (muğallaza). Bundan dolayı yemin kefaretinin aksine adam öldürme (katı) orucunda peşpeşe tutulma şartı getirilmiştir",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6716,
			"arabicnumber": 6716,
			"text": "Cabir'in nakline göre Ensardan birisi kölesini müdebber yaptı. Ancak kendisinin ondan başka hiçbir malı yoktu. Bu durum Nebi Sallallahu Aleyhi ve Sellem'in kulağına gidince \"Bunu benden kim satın almak ister?\" diye sordu. Bunun üzerine Nuaym b. en-Nahham onu 800 dirheme satın aldı. Hadisi Cabir'den rivayet eden Amr, şöyle demiştir: Ben Cabir b. Abdullah'ın o köle için \"Kıpt! bir köleydi. İbnü'z-ZUbeyr'in hilafetinin ilk yılında vefat etti\" dediğini işittim. Fethu'l-Bari Açıklaması: İmam Buhari bu başlık altında müdebberin azad edilmesi hadisine yer vermiştir. Sözkonusu hadisin geniş bir açıklaması, bu konudaki ihtilaflar ve müdebberin satışının sahih olduğu görüşünde olan bilginlerin delil olarak bu hadise dayanmaları, ltk bölümünde daha önce geçmişti. Burada aynı hadise yer verilmesi, müdebberin kefarette aza d edilmesinin sahih olmasıdır. Çünkü müdebberin satışının sahih oluşu, üzerindeki mülkiyet bağının bir uzantısıdır. Dolayısıyla onu hürriyetine kavuşturmak da sahih olmuştur. Ümmü'l-veled ise cinayet, hudCid ve efendisinin kendisinden yararlanması örneğinde olduğu gibi ahkamın çoğunda köle hükmündedir.' Bir çok alim, ümmü'l-veledin satışının caiz olduğu kanaatine varmıştır, Fakat bu konudaki hüküm sözkonusu satışın sahih olmadığı şeklinde yerleşmiştir. Bilginler ümmü'l-veled'in azad edilmesinin caiz olduğu noktasında görüş birliği etmişlerdir. Dolayısıyla kefarette ümmü'l-veled'i azad etmek caizdir. Mükatebi hürriyetine kavuşturma konusunagelince, İmam Malik, Şafii ve Sevri bunun caiz olduğunu söylemişlerdir. İbnü'l-münzir'in nakli de bu yöndedir. İmam Malik'ten nakledilen bir görüşe göre kefarette mükatebiazad etmek caiz değildir. Rey taraftarı olan bilginler ise şöyle demişlerdir: Mükateb anlaşması yapan köle, anlaşma miktarının bir kısmını ödemişse kefaret için azad edilemez. Çünkü bu takdirde kefaret veren, kölenin sadece bir kısmını hürriyetine kavuşturmuş olmaktadır. Evzai ve Leys'in kanaati de bu yöndedir. Ahmed b. Hanbel ve İshak ise \"mükateb bedelinin üçte bir ve daha fazlasını pdemişse kefaret olarak azad edilemez\" demişlerdir. Tavus'un müdebber ve ümmü'l-veled'in kefaretteazad edilebileceği yolundaki görüşlerine gelince, selef bilginleri bu konuda ihtilaf etmişlerdir. Müdebberin azad edilebileceği no.ktasında Hasan-ı Basri, Tavus'a katılırken, İbrahim en-Nehai, ümmü'l-veled konusunda ona katılmıştır. Zühri ve Şa'bi ise her iki konuda Tavus'a muhalefet etmişlerdir. İmam Malik ve Evzai şöyle demiştir: Kefarette müdebber, ümmü'l-veled'i azad etmek yeterli olmadığı gibi, özgürlüğüne kavuşturulması bir şeyin gerçekleşmesine bağlanmış olan da yeterli değildir. KMelilerin görüşü de bu yöndedir. İmam Şafii ise kefaret için müdebberin özgürlüğüne kavuşturulmasının yeterli olduğu kanaatindedir",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6717,
			"arabicnumber": 6717,
			"text": "Aişe r.anha Berire'yi efendilerindep'$atın almakistedi. Ancak efendileri onun velayetinin kendilerine ait olmasını şart koşarlar. Aişe bu şartı Nebi Sallallahu Aleyhi ve Sellem'e açınca efendimiz şöyle dedi: \"Onu satın al! Velayet hakkı ancak köleyi azad edenin hakkıdır.\" Fethu'l-Bari Açıklaması: İmam Buhari bu konuda Aişe r.anha'nın Berıre'nin satılmasını konu alan hadisine muhtasar olarak yer vermiştir. O haberin sonunda Nebi Sallallahu Aleyhi ve Sellem \"Velayet hakkı ancak köleyi azad edenin hakkıdır\" buyurmuştur. Buradan çıkan sonuç şudur: Köleyi hürriyetine kavuşturup, yaptığı bu muamele sahih olan kimse, onun velasına sahip olur. Birisiyle ortak olan köleyi azad eden kişi de bu hükme dahil olur. Çünkü o kişi zenginse bu yaptığı sahihtir ve ortağının hissesini tazmin eder. Onun kölesini karşılıksız aza d etmesi ile kefaret olarak hürriyetine kavuşturması arasında fark yoktur. Aralarında İmam Ebu Hanıfe'nin iki Öğrencisi dahil olmak üzere çoğunluğun yaklaşımı bu doğrultudadır. İmam Ebu Hanife'den gelen başka bir nakle göre ise bir başka kişiyle ortak olan köleyi kefarette aza d etmek yeterli olmaz. Çünkü kefaret sahibi kölesinin tamamını değil, sadece bir kısmını hürriyetine kavuşturmuş olur. Sebebine gelince; İmam Ebu Hanife'ye göre diğer ortak bu durumda muhayyer olur. Dilerse kendi hissesi olarak takdir edilir (ve onu alır), dilerse o da hissesini azad eder, dilerse kölenin kendi hissesine düşen kısmını çalışıp kazanarak getirmesini talep eder",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6718,
			"arabicnumber": 6718,
			"text": "Ebu Musa el-Eş'ari r.a. şöyle demiştir: \"Ben Eş'arilerden bir topluluk ile birlikte Resulullah Sallallahu Aleyhi ve Sellem'e geldim ve kendisinden, binek olarak kullanmak ve ağırlıklarımızı yüklemek üzere deve istedim. Nebi Sallallahu Aleyhi ve Sellem \"Vaılahi sizlerin binek olarak kullanacağınız deve/erim yoktur, sizi bindireceğim hayvan da yoktur\" dedi. Sonra biz Allah'ın dilediği kadar bir müddet bekledik. Derken Rsulullah Sallallahu Aleyhi ve Sellem'e birtakım develer getirildi. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem bize üç deve verilmesini emretti. Yola koyulduğumuzda içimizden bazıları şöyle dedi: Allah bize bereket ihsan etmez. Biz kendisinden binecek ve ağırlıklarımızı taşıyacak deve istemek için geldik, o da bizlere deve vermeyeceğine yemin etti. Ebu. Musa olayın devamını şöyle anlatmıştır: Bu konuşmanın ardından Resulullah Sallallahu Aleyhi ve Sellem'e geldik ve aramızda konuştuklarımızı ona açtık. Bize şöyle dedi: \"Sizleri develere yükleyen ben değilim. Fakat sizleri develere Allah yüklemiştir ve ben Allah'a yemin ederim ki inşaailah (diye) yemin eder de, sonra ondan başkasını daha hayırlı görürsem muhakkak yeminimden kefaret verir ve o daha hayırlı olan işi yaparım, kefCıret veririm",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6719,
			"arabicnumber": 6719,
			"text": "Hammad'ın nakline göre Nebi Sallallahu Aleyhi ve Sellem yukarıda geçen hadisteki son cümleyi şöyle ifade etmiştir: \"Allah'a yemin ederim ki inşaallah (diye) yemin eder de sonra ondan daha hayırlısını görürsem yeminimin kefaretini verir, o daha hayırlı olanı yapanm\" ya da \"daha hayırlı olanı yapar, yeminimin kefaretini veririm",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6720,
			"arabicnumber": 6720,
			"text": "Ebu Hureyre r.a. şöyle anlatmıştır: Hz. Süleyman: \"Yemin ederim ki ben bu gece doksan dokuz kadını dolaşırım ve onların her biri Allah yolunda çarpışacak birer oğlan doğurur\" dedi. Arkadaşı ona -Süfyan arkadaş kelimesini' 'yani melek' diye açıklamıştır- \"İnşallah de!\" dedi. Hz. Süleyman bunu söylemeyi unuttu ve kadınları dolaştı. Neticede kadınlardan bir tanesi hariç hiç biri çocuk doğurmadı. O bir kadın da yarım bir oğlan dünyaya getirdi.\" Ebu Hureyre bu hadisi Nebi Sallallahu Aleyhi ve Sellem'den rivayet ederek onun şöyle dediğini nakletti: \"Eğer Süleyman Nebi Sallallahu Aleyhi ve Sellem inşaallah deseydi, hem yemininde yanlışlık yapmış olmaz, hem de bu ihtiyacına erişme vesilesi olurdu.\" Ebu Hureyre bir keresinde de Nebi Sallallahu Aleyhi ve Sellem \"Eğer Süleyman yemininde istisna yapsaydı. .. \" buyurdu demiştir. Fethu'l-Bari Açıklaması: İmam Buhari'nin \"Yeminlerde istisna\" şeklinde attığı başlıkta yer alan \"istisna\" kelimesi \"sünya\" kökünden olup, istif'al babındadır. Kelime, katlamak ve bükmek anlamına gelen \"senneytu'ş-şey'e\" fiilinden türemedir. Yemininde istisna yapan kişi, sanki ağzından çıkan sözlerin bir kısmını katlayıp, dürdüğü için yaptığı eylem bu fiil ile ifade edilmiştir. Çünkü bir terim olarak istisna, söylenilen sözün bazı anlamlarını hüküm dışına çıkarmak demektir. Bir kimse \"Yemin olsun ki inşallah (Allah dilerse) şöyle yapacağım\" derse istisna yapmış olur. Aynı şekilde \"Yemin olsun ki inşallah şöyle yapmayacağım\" dediğinde de yine istisna yapmış olur. \"Yemin olsun ki şöyle yapacağım ancak Allah' ın dilemesi hariç (en yeşaallah)\" veya \"Yemin olsun ki şöyle yapacağım ancak Allah'ın dilemesi (inşallah) hariç\" cümleleri de aynı hükümdedir. Yemin eden kimse \"inşaallah\" yerine \"irade etme\" ve \"ihtiyar\" kökünü kullandığı takdirde bu da caizdir. İnşallah yaparım deyip yapmayınca, inşallah yapmam deyip yapınca da yeminini bozmuş olmaz. İbnü'l-Münzir şöyle demiştir: Alimler istisnanın vakti konusunda ihtilaf etmişlerdir. Çoğunluğa göre \"inşaallah\" sözcüğünün yemine bitişik olması şarttır. İmam Malik \"Yemin eden kişi yeminini bitirdikten sonra susarsa veya sözüne ara verirse istisna yapmış olmaz\" demiştir. İmam Şafiı ise şu görüşü benimsemiştir: \"İstisnanın ilk cümleye bitişik olması şarttır. İstisnayı cümleye bitiştirmek, söze ara vermemekle olur. Yemin sözcüğüyle istisna arasında bir sükut meydana gelecek olursa araları açılmış olur. Ancak hatırlama susuşu veya nefes alma ya da yorulma veya sözün kesilmesi gibi mazeretler müstesnadır. Yemin ettikten sonra başka bir söze başlamak da o cümlenin istisna ile ilişkisini keser. İbnü'l-Hacib bu meseleyi şöyle özetlemiştir: İstisnanın şartı lafzan veya o hükümde bir şeyle bunu temel cümleye bitiştirmektir. Örfen bitişmeye engel olmayan şeylerden soluklanma veya öksürme gibi ara vermeler hükme n bitiştirmeye örnektir. İbnü'l-Arabl'nin görüşü ise şöyledir: İstisna kefarete benzer. Allahu Teala \"Yemin ettiğiniz takdirde yeminlerinizin kefareti işte budur\"l99 buyurmuştur. Bu hükme sadece meşru olan yemin dahildir ki bu da Allah'ın adı üstüne yapılan yemindir",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6721,
			"arabicnumber": 6721,
			"text": "Zehdem el-Cermİ şöyle demiştir: Bir seferinde Ebu Musa'nın yanında bulunuyorduk. Bizimle Cerm kabilesinden olan şu mahalle halkı arasında bir dostluk ve lütufkarlık vardı. Zehdem şöyle devam etti: Biz Ebu Musa'nın yanında iken yemeği getirildi. Yemeğinin içinde tavuk eti de takdim edildi. Bu topluluğun içinde Teymullah oğullarından yabancı kılıklı kızıl bir adam vardı. Bu adam sofraya yanaşmadı. Ebu Musa ona 'Sofraya yanaş! Ben Resulullah Sallallahu Aleyhi ve Sellem'i tavuk etinden yerken görmüşümdür' dedi. O kişi de \"Ben tavuğu pis bir şey yerken gördüm, ondan tiksindim ve ebediyyen tavuk eti yememeye yemin ettim\" dedi. Ebu Musa ona şöyle dedi: \"Sofraya yanaş! Sana buna dair bir hadis nakledeyim. Bizler Eş'arllerden bir topluluk içinde Nebi Sallallahu Aleyhi ve Sellem'e geldik. Maksadım kendisinden biz Eş'arllere deve vermesini istemekti. O ise zekat develerinden bir bölük deveyi taksim etmekle meşguldü. -Ravi Eyyub Ben el-Kasım et-Temiml'nin \"Resulullah Sallallahu Aleyhi ve Sellem öfkeli halde idi\" dediğini sanıyorum demiştir.- Nebi Sallallahu Aleyhi ve Sellem \"Valiahi ben sizleri taşıyacak develere sahip değilim, benim yanımda sizi yükleyebileceğim deve yoktur\" dedi. Ebu Musa şöyle devam etti: Bu söz üzerine biz yürüdük, oradan ayrıldık. Bu sırada Resuluııah Sallallahu Aleyhi ve Sellem'e birtakım ganimet develeri getirildi. Bunun üzerine \"Eş'arller nerede? O Eş'arller nerede?\" diye soruldu. Bizler hemen geldik. Nebi Sallallahu Aleyhi ve Sellem bizlere beyazhörgüçlü beş tane deve verilmesini emretti. Ebu Musa dedi ki: Biz develeri alıp yürüdük. Bu sırada ben arkadaşlarıma şunları söyledim: Resulullah s.a.v.'e geldik, ondan bizlere binek deve vremesini istedik .. O bizleri taşıyacak develere sahip olmadığına yemin etti. Sonra bize haber gönderdi ve bize deve verdi. Nebi Sallallahu Aleyhi ve Sellem önceki yaptığı yeminini unuttu. Vaııahi biz Resulullah s.a.v.'i gaflete getirip, yeminini unutturduk, biz ebediyyen iflah olmayız. Haydin beraberce Resulullah Sallallahu Aleyhi ve Sellem'e dönün de kendisine yapmış olduğu yeminini zikredip hatırlatalım! dedim. Bunun üzerine geriye döndük ve \"Ya Resulallah! Bizlere binek vermeni istemek maksadıyla sana gelmiştik. Sen bize böyle develerinin olmadığına dair yemin ettin. Sonra bize deve verdin. Bizler senin o yeminini unutmuş olduğunu zannettik veya bildik! dedik. Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Gidiniz! ancak Allah Sizlere bu imkanı bağışladı .. Ben yemin ettim. Valiahi inşaailah ben bir şey üzerine yemin eder de ardından yemin ettiğim şeyden başkasını daha hayırlı görürsem (o yemine bağlı kalmayıp) mutlaka o daha hayırlı olduğuna kanaat ettiğim şeyi yaparım ve o yeminin kefGretini verip onu çözerim",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6722,
			"arabicnumber": 6722,
			"text": "Abdurrahman b. Semura'nın nakline göre Nebi Sallallahu Aleyhi ve Sellem şöyle demiştir: \"Sen (kendiliğinden) bir görevi isteme' Eğer kendin istemeksizin sana görev verilirse o işte (Allah tarafından) yardım görürsün. Eğer talebin üzerine sana görev verilirse işinde yalnız bırakılırsın. Bir şeye yemin edip de başkasını daha hayırlı gördüğünde o daha hayırlı olan işi yap ve yemininin kefaretini ver. \" Fethu'l-Bari Açıklaması: İbnü'l-Münzir bu konuda şu açıklamayı yapmıştır: Rebi'a, Evzai, İmam Malik, Leys ve -Rey ehli hariç- belli başlı beldelerdeki diğer fıkıh bilginlerinin görüşü, yemini bozmadan önce kefaret vermenin geçerli olduğu yönündedir. Ancak İmam Şafii bu hükümden oruç kefaretini istisna etmiş ve \"Oruç kefareti ancak oruç bozulduktan sonra verilebilir\" demiştir. Rey taraftarı olan bilginler ise \"Yemini bozmadan kefaret vermek geçerli değildir\" demişlerdir. Tahavi onların görüşünü \"Yemin ettiğiniz takdirde yeminlerinizin kefareti işte budur\"(Maide 89) ayetine dayandırmıştır. Onlara göre ayetten maksat, \"yemin edip, yemininizi bozduğunuzda ... \" demektir. Muhalif görüşte olan bilginler ise Tahavi'nin yaklaşımını reddetmişler ve şöyle demişlerdir: Tam tersine ayetin takdiri \"yemin edip, yemininizi bozmak istediğinizde ... \" şeklindedir. Bundan daha uygun olanı ise şöyle demektir: Ayetin takdiri bunlardan daha geneldir. Bu iki takdirden biri diğerinden daha iyi değildir. Bu bilginler bir de ayetin zahirine göre kefaret bizatihi yeminle vacip olur demişlerdir. Yemini bozmadan önce kefaret vermenin caiz olduğunu savunan bilginler ise kefaret bizatihi yeminle vacip olsaydı, yeminine sadık kalan kimselerden kefaret, bilginlerin ittifakıyla saklt olmazdı diye cevap vermişlerdir. lyaz şöyle demiştir: Bilginler kefaretin sadece yemini bozmakla vacip olduğu ve yemini bozduktan sonra ertelenmesinin caiz olduğu noktasında ittifak etmişlerdir. İmam Malik, Şafii, Evzai ve Sevri yeminin bozulmasından sonra kefaretin tehir edilmesini müstehap görmüşlerdir. lyaz şöyle devam eder: Bazı Malikiler, günah olan yemin bozma kefaretinin onu bozmadan önce verilemeyeceğini ifade etmişler ve bu tavrın, masiyete yardım anlamı taşıdığını ileri sürmüşlerdir. Çoğunluk ise bu görüşü reddetmiştir. İbnü'l-Münzir şu açıklamayı yapar: Çoğunluğun delili şudur: Ebu Musa ve Abdurrahman hadislerindeki lafızların farklılığı, iki şeyden birisinin muayyen olduğunu göstermez. Yemin edene iki şey emredilmiştir. Bunlardan ikisini birden yaptığında kendisine emredileni yapmış olur. Haber, yemini bozmadan önce kefaret verilemeyeceğini göstermediğine göre geriye bu konuda akıl yürütmekten başka çare kalmaz. Kadi İyad şöyle der: Kefaretin yemini bozmadan önceden verilmesinin caizliği noktasındaki ihtilaf, onun yemini çözmek veya bozmaktan kaynaklanan günahına kefaret vermek için ruhsat olduğu düşüncesine dayanmaktadır. Çoğu nluğa göre kefaret, Allahu Teala'ın yapılan yemini çözmek için getirdiği bir ruhsattır. Bundan dolayı o, yemini bozmadan önce de sonra da verilebilir .. Mazerl'nin bu konudaki görüşü şöyledir: Kefaret için üç şeyden söz edilebilir: a. Yemini etmeden önce. Bu durumda kefaret vermek bilginlerin ittifakıyla geçerli değildir. b. Yemin ettikten ve onu bozduktan sonra. Bu durumda bilginlerin ittifakıyla kefaretini vermek caizdir. c. Yemin ettikten sonra ve bozmadan önce bu durumda ihtilaf sözkonusudur. Bilginler \"Siz/ere binmeniz için deve/er veren ben değilim. Fakat Allah siz/ere bu deve/eri ihsan etmiştir\" hadisi hakkında şöyle demişlerdir: Nebi Sallallahu Aleyhi ve Sellem bu ifade ile onları minnet altında bırakmak istememiş ve nimetin asli malikine izafe etmek istemiştir. Resulullah Sallallahu Aleyhi ve Sellem onları develere yüklerken hiçbir rolünün olmadığını söylemek istememiştir. Çünkü bunu isteseydi daha sonra \"Allah'a yemin ederim ki inşaailah (diye) yemin eder de sonra ondan daha hayırlısını görürsem yeminimin kefaretini verir, o daha hayırlı o/anı yaparım ve kefaret veririm\" demezdL Mazeri şöyle demiştir: \"Siz/eri deve/ere Allah yük/emiştir\" sözünün manası şudur: Sizleri yüklediğim develeri bana veren Yüce Aııahtır. O bunu yapmasaydı benim yanımda sizi yükleyeceğim hiçbir şeyolmazdı. Bazı bilginler ise şöyle demişlerdir: Resulullah Sallallahu Aleyhi ve Sellem'in yeminini unutmuş olması da muhtemeldir. Unutan kimseye herhangi bir fiil izafe edilmez. Ancak Resulullah Sallallahu Aleyhi ve Sellem'in daha önce beyan ettiğimiz üzere Müslim'de yer alan \"Valiahi onu unutmadım\" (Müslim, Eyman) şeklindeki açık ifadesi bu görüşü reddetmektedir. Bazı bilginlere göre Nebi Sallallahu Aleyhi ve Sellem'in onları develere kendisinin yüklemediği, bunu yapanın Allahu Teala olduğu ifadesinden maksat, onun kendisine ihsan ettiği ganimete işarettir. Çünkü bu ganimet, Nebi Sallallahu Aleyhi ve Sellem'in çabasıyla ele geçmediği gibi, kendisi onu istemiyordu ve böyle bir beklenti içinde de değildi. Buna göre hadisin manası şöyle olmaktadır: Sizleri develere ben yüklemedim. Çünkü ilk başta yanımda böyle bir imkan yoktu. Fakat bize nasip ettiği ganimetten dolayı sizleri develere yükleyen Yüce Aııah'tır",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 15
			}
		}
	]
}