{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"85": "Laws of Inheritance (Al-Faraa'id)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6723,
			"arabicnumber": 6723,
			"text": "Cabir b. Abdullah şöyle anlatmıştır: Ben hastalandım. Resulullah Sallallahu Aleyhi ve Sellem ile Ebu Bekir yürüyerek beni ziyarete geldiler. Bana geldiklerinde bayılmışım. Nebi Sallallahu Aleyhi ve Sellem abdest alıp abdest suyundan benim üzerime serpmiş. Sonra ayıldım. Kendisine \"Ya Resulallah! Ben malım hususunda nasıl davranayım? Malım hususunda nasıl hükmedeyim?\" diye sordum. Resulullah Sallallahu Aleyhi ve Sellem bana hiçbir cevap vermedi. Nihayet miras payları ayeti indi. Fethu'l-Bari Açıklaması: İmam Buharl'nin attığı başlıktaki \"feraiz\" kelimesi \"farıza\"nın çoğuludur. Tıpkı \"hadaik\" kelimesinin \"hadıka\"nın çoğulu olduğu gibi. \"Farıza\" \"kesmek\" anfamına olan \"farz\" kökünden alınma olup, \"faııe\" kalıbında ve ayrılmış paylar anlamınadır. Ragıb şöyle der: Arapça'da \"el-farz\" sert olan bir şeyi kesmek ve ona tesir etmek anlamına gelir. Miras olarak bırakılan mallara \"feraiz\" ismi, ayetteki \"nasiben mafrCıdan\" ifadesinden alınmıştır. MafrCıd, takdir edilmiş veya malum ya da başkalarından kesilip ayrılmış anlamına gelir",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6724,
			"arabicnumber": 6724,
			"text": "Ebu Hureyre r.a.'nin nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Zandan sakının! Çünkü zan, sözlerin en yalanıdır. Birbirinizin özel hayatını işitmeye çalışmayın, birbirinizin mahrem hayatını araştırmayın. Birbirinize karşılıklı kin beslemeyin, birbirinize arka dönüp yüz çevirmeyin. Ey Allah'ın kulları! Birbirinize kardeşler olun.\" Fethu'l-Bari Açıklaması: Ukbe b. Amir'in \"Zanna dayanarak konuşanlardan önce\" şeklindeki ifadesi, o zamanın insanlarının nassın çizgisinden ayrılmadıklarına, onu aşmadıklarına ve bazılarından görüşe dayanarak nakledilen fetvanın nispeten az olduğuna işa- . ret etmektedir. Bu ifadede ayrıca reye dayanarak hüküm veren birçok kişinin sebep olduğu şeylere uyarı vardır. Bazıları Ukbe'nin maksadı, feraiz ilminin yok olmasından ve ilme dayanmaksızın sırf zannına göre konuşan kimselerin ortaya çıkmasından öncesine dikkat çekmektir• demişlerdir. İbnü'l-Müneyyir şöyle demiştir: İmam Buharl'nin, Ukb.e'nin feraize dair ifadesini başlık olarak kullanmasının sebebi, bu ilmin diğerlerine nazaran daha kapsamlı olmasındandır. Çünkü feraiz ilminde ağır basan taraf, taabbudllik, reye yer olmaması ve zanna göre konuşma!!ın sınırlarının tespit edilebilir qlmamasıdır. Diğer ilim dalları ise bunun aksinedir. Çünkü o dallarda reye yer vardır ve genellikle reye dayanarak sınırlarını tespit etmek mümkündür. Bu açıklamadan yukarıdaki merfu hadisin başlık için hangi münasebetle seçildiği ortaya çıkmaktadır. Bazılarına göre hadisin başlığa uygunluğu, zanna göre amelin yasaklanmasının, i1me göre ameli teşvik içermesine işaret etmesinden dolayıdır. Bu da feraiz ilminin öğrenilmesinin bir yan koludur. Feraiz ilmi genellikle daha önce açıklandığı üzere ilim yoluyla öğrenilir. İmam Buhari bundan sonra Ebu Hureyre'nin rivayet ettiği \"Zandan kaçınınız\" hadisine yer vermektedir. Bu hadis bir başka açıdan edep bölümünün baş taraflarında \"Karşılıklı Kıskanmanın Yasaklığı\" başlığı altında geçmişti. Orada hadis yeteri kadar açıklanmıştı. Hadiste buradaki zandan maksadın ne olduğu da açıklanmakta ve bunun herhangi bir esasa dayanmayan şeyolduğu vurgu lanmaktadır. Bir Müslüman hakkında kötü zan beslemek de buna dahildir",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6726,
			"arabicnumber": 6726,
			"text": "",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6727,
			"arabicnumber": 6727,
			"text": "Aişe r.anhs.'nın nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"Biz Nebiler topluluğuna mirasçı olunmaz. Geriye bıraktığımız her mal sadakadır\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6728,
			"arabicnumber": 6728,
			"text": "Malik b. Evs b. el-Hadesan şöyle demiştir: -Hadisi Malik b. Evs'ten nakleden İbn Şihab şöyle dedi: Muhammed b. Cubeyr b. Mut'im bana Malik b. Evs'in hadisinden bir kısmını nakletmişti. Ben bu hadisi bizzat Malik b. Evs'ten işitmek için gidip huzuruna girdim ve kendisine bu hadisi sordum. O da şöyle anlattı: Ben Ömer r.a.'in huzuruna gittim. Bu sırada halife Ömer'in kapıcısı Yerfe içeriye girdi ve \"Ey mu'minlerin emiri! Osman, Abdurrahman b. Avf, ZUbeyr b. el-Avvam, Sa'd b. Ebi Vakkas'ın girmelerine müsaade eder misiniz?\" Hz. Ömer \"evet\" dedi. (Adı geçenler içeri girdiler, selam verip oturdular.) Biraz sonra Yerfe yine geldi ve \"Ali'yle, Abbas da geldiler, izin verir misin?\" dedi. Hz. Ömer \"evet\" dedi. (Bunlar da içeri girdiler. Selamdan sonra) Abbas \"Ey müminlerin emiri! Benimle şu Ali arasında hükmeti\" dedi. Hz. Ömer orada bulunanlara \"Gök ve yerin izniyle ayakta durmakta olduğu Allah hakkı için soruyorum. Sizler ResuluIlah Sallallahu Aleyhi ve Sellem'in 'Biz Nebiler topluluğuna mirasçı olunmaz.Geriye bıraktığımız her mal sadakadır' buyurduğunu ve bu sözüyle kendini kastetmekte olduğunu biliyorsunuz değil mi?\" dedi. Hz. Osman ve arkadaşları \"Evet, Resulullah Sallallahu Aleyhi ve Sellem böyle buyurdu\" dediler. Bunun üzerine Hz. Ömer, Ali ve Abbas'a dönüp \"Resulullah Sallallahu Aleyhi ve Sellem'in kendisini kastederek böyle buyurduğunu siz de biliyorsunuz değil mi?\" dedi. Ali ve Abbas \"Evet Resulullah Sallallahu Aleyhi ve Sellem böyle buyurdu\" dediler .. Hz. Ömer şöyle devam etti: \"Şimdi ben size bu malın hukuki durumunu bildireyim. Allahu Teala bu ganimette (fey) tasarrufu Resulüne tahsis etti. Ondan başka kimseye bu hakkı vermedi. Allahu Tealaşöyle buyurdu: \"Allah'ın onlardan {mallarından} Nebiine verdiği ganimetler için siz at ve deve koşturmuş değilsiniz. Fakat Allah, Nebilerini dilediği kimselere karşı üstün kılar, Allah her şeye kadirdir. \"(Haşr 6) Bu mal özelolarak Nebi Sallallahu Aleyhi ve Sellem' e mahsustu. Sonra valiahi o bu malı sizi bir yana bırakıp da kendi mülküne katmadı, sizi dışlayıp da kendine özel de kılmadı. Resulullah Sallallahu Aleyhi ve Sellem bu fey malını size verdi ve aranızda taksim etti. Nihayet o feyden bu mal kaldı. Nebi Sallallahu Aleyhi ve Sellem ailesinin bir senelik nafakasını bu maldan ayırır, sonra kalanını alır, onu da Allah'ın malının sarfedileceği yerlere harcardı. ResuluIlah Sallallahu Aleyhi ve Sellem bu malı kendi hayatında böyle kullandı. Ey topluluk! Sizlere Allah adına soruyorum. Sizler bunun böyle olduğunu biliyorsunuz değil mi? dedi. Onlar da \"Evet, böyledir!\" diye tasdik ettiler. Sonra Hz. Ömer, Ali ile Abbas'a hitaben \"Sizin ikinize de Allah adına soruyorum! Sizler de bunun böyle olduğunu biliyorsunuz değil mi?\" dedi. Onlar da \"evet\" deyip, tasdik ettiler. Hz. Ömer şÖyle devam etti: Sonra Allah Nebiini vefat ettirdi. Ebu Bekir \"Ben Allah'ın Resulünün velisiyim\" dedi ve o mallara el koydu, Resulullah Sallallahu Aleyhi ve Sellem'in kullandığı gibi kullandı. Sonra Allah Ebu Bekir'i de vefat ettirdi. Ben de Resulullah Sallallahu Aleyhi ve Sellem'in velisiyim dedim ve onları iki sene önce teslim alc;lım. Onları Resulullah Sallallahu Aleyhi ve Sellem ve Ebu Bekir' in kullandığı gibi kullanmaktayım. Sonra ikiniz bana geldiniz. Sözünüz bir, işiniz dedi toplu idi. Ey Abbas! Sen bana geldin, bEmden kardeşinin oğlundan payına düşen hisseni istiyordun. Ali de banageldi, hanımının babasından payına düşen hissesini istiyordu. Ben isterseniz bu hurmalıkları size bu şartla geri vereyim dedim. Şimdi siz benden bundan başka bir hüküm mü istiyorsunuz? Gök ve yer izni ile ayakta duran Allah'a yemin ederim ki ben kıyamet kopuncaya kadar bu mallar hakkında bundan başka bir hüküm vermem. Eğer siz bu malları idareden acizseniz onları bana geri verin. Ben onları sizin hesabınıza yeterlilikle idare ederim dedi",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6729,
			"arabicnumber": 6729,
			"text": "Ebu Hureyre r.a.'nin nakline göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"(Vefatımda) benim mirasçılarım dinar paylaşmazlar. Eşlerimin nafakalanndan ve işçimin ücretinden geri kalanlar sadakadır",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6730,
			"arabicnumber": 6730,
			"text": "Aişe r.anha'nın nakline göre Resulullah Sallallahu Aleyhi ve Sellem vefat ettiğinde eşleri Osman'ı mirastan paylarını istemek üzere Ebu Bekir'e gönderdiler. Aişe r.anha onlara \"Resulullah Sallallahu Aleyhi ve Sellem 'Bize mirasçı olunmaz. Geriye bıraktığımız her mal sadakadır' buyurmamış mıdır?\" dedi. Fethu'l-Bari Açıklaması: \"Bize mirasçı olunmaz. Geriye bıraktığımız her mal sadakadır.\" Bunun anlamı geride bıkaktığımı.i mallar sadakadır demektir. İmam Buhari bu konuda dört hadise yer vermiştir. Bunlardan birisi Hz. Ebu Bekir'le Fatıma arasındaki olayı aktaran hadistir. Bu hadis Humus bölümünde açıklamasıyla birlikte daha önce geçmişti. \"(Vefatımda) eşlerimin nafakalanndan ve işçimin ücretinden sonra geri kalan sadakadır.\" İbn Battal ve başka bilginler şöyle demiştir: Bu hadisin -Allahu Teala daha iyi bilir- başlığa uygunluğu şu açıdandır: Allah Teala Nebileri kendi mesajını tebliğ eden elçiler olarak gönderdi ve onlara bu görevlerinin karşılığında herhangi bir ücret almamalarını emretti. Nitekim Allahu Teala şöyle buyurur: \"Deki: Ben buna karşılık sizden akrabalık sevgisinden başka bir ücret istemiyorum.''(Şura 23) Hz. Nuh, Hud ve başka Nebiler de buna benzer şekilde konuşmuşlardır. Nebilerin miras bırakmamalarındaki hikmet, onların mirasçıları için mal biriktirdikleri zannı uyanmasın diyedir. İbn Battal şöyle devam etti: Müfessirler \"Süleyman, Davud'a varis oldu\"(Neml 16) ayetini \"ilim ve hikmette varis oldu\" şeklinde tevil etmişlerdir. Hz. Zekeriya'nın \"Tarafından bana bir veli (oğul) ver ki o bana varis olsun\"(Meryem 5-6) ifadesi de aynı manayadır. İbn Abdilberr alimlerin bu konuda iki görüşe ayrıldıklarını ve çoğunluğun Nebilerin miras bırakmayacakları kanaatini taşıdıklarını belirtir. \"Allah size çocuklarınız hakkında (miras vermenizi) emreder\" ayetindeki genelliğe gelince, buna şöyle cevap verilmiştir: Bu ayet, malik olduğu bir şeyleri miras bırakan kimseler hakkında geneldir. Bir kimsenin ölmeden önce malını vakfettiği ve miras olarak alınacak herhangi bir şey bırakmadığı sabit olduğu takdirde bu kişiye mirasçı olunmaz. Malik olduğu şeylerden geriye bir şey bırakması takdirinde Nebi Sallallahu Aleyhi ve Sellem'in bu ayetin genelliğine dahil oluşu tahsise uygundur. Çünkü onun kendine mahsus birçok özelliği olduğu bilinmektedir. Nebi s.a.v.'e mirasçı olunamayacağı hükmü meşhurdur. Netice olarak bu hükmü n herkese değil, sadece ona mahsus olduğu ortaya çıkar. Bazı bilginlere göre Nebi Sallallahu Aleyhi ve Sellem'in miras bırakmamasındaki hikmet, varisin mirasa konma arzusuyla miras bırakanın ölmesini temenni etmesini ortadan kaldırmaktır. Bazı bilginlere göre ise bunun hikmeti, Nebi Sallallahu Aleyhi ve Sellem'in ümmetinin babası mesabesinde olmasındandır. Dolayısıyla onun bırakacağı miras, herkesin olur. Genel sadakanın niteliği budur. İbnü'lMüneyyir Haşiye'sinde şöyle der: Bu hadisten şöyle bir hüküm daha çıkmaktadır: Bir kimse, \"Evim sadakadır, kimseye miras olarak kalamaz\" dediği takdirde -vakfedildiğine• veya mülkiyetinin durdurulduğuna dair açık bir ifadeye ihtiyaç olmaksızın- o ev vakfedilmiş olur. Bu yaklaşım güzeldir, fakat acaba bu sarih bir vakfetme ifadesi midir yoksa niyet gereken kinayeli bir ifade midir? Ebu Hureyre hadisi menkul malların vakfedilmesinin sahih olduğunu ve vakfın sadece gayr-ı menkullere mahsus olmadığını göstermektedir. Çünkü \"eşlerimin nafakalarından sonra geri kalan\" ifadesi geneldir",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6731,
			"arabicnumber": 6731,
			"text": "Ebu Hureyre r.a.'in nakline göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Ben mu'minlere kendi öz nefislerinden daha yakımmdır. Her kim üzerinde borç olduğu halde ölür ve o borcu ödeyecek bir şey bırakmazsa onu ödemek bize aittir. Her kim de bir mal bırakırsa o da kendi mirasçılarına aittir.\" Fethu'l-Bari Açıklaması: İbn Battal şöyle demiştir: Devlet başkanı o kişinin borcunu beytü'l-malden ödemeyecek olursa, cennete girmesine engel olunmaz. Çünkü o kişi, beytü'lmaldeki paradan borcu kadar miktara hak sahibidir. Yeter ki borcu beytü'lmaldeki hakkından daha fazla olmasın. Bizim kanaatimiz ise şudur: Anlaşılan bu karşılıklı ödeşmeye girer. Borçlu olan kişi alacağı ve borcu olan şahıs gibidir. Daha önce ifade ettik ki onlar sırattan geçince cennetle cehennem arasında kurulu bir köprüde durdurulup, yaptıkları haksızlık dolayısıyla birbirleriyle ödeşirier. Karşılıklı olarak arınıp, borçlarını ödediklerinde cennete girmelerine izin verilir. İbn Battal'ın \"Cennete girmesine engel olunmaz\" şeklindeki ifadesi, mesela azap görerek durdurulmaz demektir. Doğruyu en iyi Allah Teala bilir. \"Her kim de bir mal bırakırsa, o da kendi mirasçılarına aittir.\" Yani bıraktığı mal varislerine aittir. Abdurrahman b. Ebu Umre'nin nakline göre Nebi Sallallahu Aleyhi ve Sellem \"Her kim de bir mal bırakırsa, mevcut olan asabeleri ona mirasçı olur\" buyurmuştur. Müslim'de el-A'rac vasıtasıyla Ebu Hureyre'nin nakline göre ise \"Bıraktığı ma/ mevcut o/an asabesine aittir\" buyurmuştur (Müslim, Feraiz). Davudi' şöyle demiştir: Hadiste geçen \"asabe\" den maksat feraiz ilminde asabe yoluyla mirasçı olanlar değil, normal varislerdir. Çünkü feraiz ilminde bir terim olarak asabe, mirasçı oldukları ittifakla kabul edilenlerden belli bir hisseye sahip olan varislerdir. Bunlar tek başına kaldıklarında bütün mala mirasçı olurlar ve ashab-ı feraiz hisselerini aldıktan sonra geriye artan malı asabe yoluyla alırlar. Bazı bilginlere göre \"asabe\"den maksad, erkeğin akrabalarıdır. Bunlar ölüye bir babayla -baba, babanın babası, babanın babasının babası... şeklinde de olabilir- bağlanan kişilerdir. Kirmani\"nin görüşüne göre \"asabe\"den maksat, ashab-ı feraiz'den sonra miras alan akrabalardır",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6732,
			"arabicnumber": 6732,
			"text": "İbn Abbas'ın nakline göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Miras pay/arını sahip/erine veriniz. Bu pay/ardan geri kalan her hangi bir şey de baba tarafından en yakın olan erkek kişiye aittir.\" Fethu'l-Bari Açıklaması: İmam Buharl'nin kullandığı başlıkta geçn \"el-veled\" kelimesi genelolup erkek ve kız çocukları ifade eder. Bir kimsenin kendi sulbünden olan oğluna veled denilebileceği gibi, ne kadar aşağıya doğru giderse gitsin oğlunun oğluna da denilir. İbn Abdilberr şöyle der: İmam Malik, Şafii, Hicazlılar ve feraiz konusunda onlara katılan bilginlerin esas aldıkları görüş, Zeyd b. Sabit' in görüşüdür. Iraklılarla, onlara katılan bilginlerin esas aldıkları ise Hz. Ali'nin görüşüdür. Her iki grup, önemsiz ve nadir durumlar hariç birbirinden farklı şeyler söylemezler. Bu da, itibar etmek gereken özel bir delil bulunduğunda sözkonusu olur. İbn Battal, Zeyd b. Sabit'in \"Kızların yanında erkek de bulunduğunda\" şeklindeki ifadesini şöyle açıklamıştır: Zeyd b. Sabit bu sözü ile kızlarla birlikte onların babalarından olan erkek kardeş bulunduğunda ve bunlarla birlikte -mesela baba gibi- Kur'an'da belirlenmiş hissesi bulunan bir başka varis bulunduğunda demektir. Bu yüzden Zeyd b. Sabit \"o kızlarla birlikte bulunan\" yerine \"erkeklerle birlikte bulunan\" tabirini kullanmıştır. Buna göre mesela önce babaya hissesi verilir ve geri kalan miras, bir erkeğe iki kız hissesi şeklinde oğlanla kızlara taksim edilir. Zeyd b. Sabit şöyle der: \"Miras pay/arını sahip/erine veriniz\" hadisinin açıklaması budur. \"Miras pay/arını sahip/erine veriniz\" hadisinde geçen \"el-feraiz\" kelimesinden maksat, Kur'an-ı Kerim'de takdir edilmiş olan hisselerdir. Bunlar yarım (1/2), yarımın yarısı (1/4), yarımın yarısının yarısı (1/8), üçte iki (2/3), bunun yarısı (1/3), ve bunun yarısının yarısı (1/6)'dır. Hadiste yer alan \"ehil\"den maksat, Kur'an'ın ifadesi ile mirasa hak sahibi olan kimselerdir. Ravh b. el-Kasım' ın Tavlıs'tan nakline göre Nebi Sallallahu Aleyhi ve Sellem \"Ma/ı mirastan pay sahip/erine Allah 'ın kitabına göre taksim ediniz\" buyurmuştur. Bundan maksat Allahu Teala'ın kitabında indirdiğine göre demektir. Zeyd bin Sabit'in \" W fema bakiye = geriye kalan miras ise\" şeklindeki ifadesi, bir başka rivayette \" ..... fe ma turiket= geriye bırakılan\" şeklindedir. \"En yakın olan erkek kişi ... \" cümlesinde kastedilen, bu paylardan geri kalan, miras bırakana nesepçe en yakın kişinin hakkıdır demektir. Yoksa maksat \"daha layık\" anlamına değildir. Hattabi şu açıklamayı yapmıştır: Bunun manası asabe içinden ölüye en yakın kişi demektir. İbn Battal'a göre maksat şudur: Ashab-ı feraizden sonra asabe erkekler arasında ölüye daha yakın olan erkek, mirasın kalanına hak sahibi olurken, daha uzak olan böyle değildir. Bunlar aynı seviyede olduklarında ise mirasın kalanını ortaklaşa böıüşürler. İbn Battal şöyle devam eder: Bu hadiste söylenmek istenen -mesela- ölüye baba veya anne vasıtasıyla bağlanan mirasçılar değildir. Çünkü onlar aynı derecede olduklarında aralarında mirasa diğerlerinden daha öncelikli olan yoktur. İbnü'l-münzir'in kanaati de bu yöndedir. İbnü't-Tın ise şöyle demiştir: Bundan maksat, amcayla birlikte hala, erkek kardeşin kızıyla birlikte onun oğlu, amca kızıyla birlikte amca oğludur. Bu . durumda öz erkek ve kız kardeş veya baba bir erkek ve kız kardeş hüküm dışı olmaktadır. Çünkü onlar \"Eğer erkekli kadın/ı daha fazla kardeş mevcut ise erkeğin hakkı, iki kadının payı kadardır\"(Nisa 176) ayeti gereğince mirasçı olurlar. Bu hükümden -ölünün baba bir erkek kardeşinin kızıyla veya öz kız kardeşiyle birlikte bulunması örneğinde olduğu üzere- hacba uğrayanlar müstesnadır. Aynı şekilde anne bir erkek ve kız kardeş de \"Bir erkek yahut bir kız kardeşi varsa her birine aItıda bir düşer\"(Nisa 12) ayeti gereğince bu hükmü n dışındadırlar. Ayetten maksadın anne bir kardeşler olduğu noktasında bilginler arasında görüş birliği olduğu nakledilmiştir. Bu konuda \"Biri ana bir kardeş, diğeri koca olan iki mirasçı amcaoğlu\" bölümünde daha fazla açıklama gelecektir. \"En yakın olan erkek kişi\" ifadesi hakkında Fakih İbnü'l-Arabı şöyle demiştir: \"Erkek kişi\" nitelemesi, mirasın tamamını kızların değil, erkeklerin alacağını ifade eder. Buna \"Kız da malın tamamını alıyor\" diye itiraz edilemez. Çünkü kız, malın tamamını birbirinden farklı iki sebeb e dayanarak almaktadır. İhata şeklindeki alma ise bir tek sebebe dayanmaktadır ki bu da, \"erkek olmak\"tan başka bir şey değildir. Bundan dolayı Nebi Sallallahu Aleyhi ve Sellem erkek olmayı zikrederek bu noktaya dikkat çekti.\" İbnü'l-Arabı \"Bu inceliği her iddia sahibi fark edemez\" demiştir. Bazılarına göre hadisteki \"erkeklik\", her iki yerde de hünsayı hüküm dışına çıkarmak içindir. Zekatta da buna benzer bir hüküm söz konusudur, çünkü hünsa zekat develerinden zekat alamaz. Hünsa da mirasta tek mirasçı olarak kaldığında malın tamamını (asebe olarak) alamaz. Nevevi şöyle demiştir: Bilginler ashab-ı feraiz hissesini aldıktan sonra geri kalanı asabenin alacağında ittifak etmişlerdir. Ölüye daha yakın asabe, daha uzak olandan önceliklidir. Bundan dolayı yakın asabe varken, uzak asabe mirasçı olamaz. Asabe, ölüyle bağlantısı herhangi bir kadınla değil, bizzat kendisi tarafından olan bütün erkek akrabalardır. Asabeler tek mirasçı olarak kaldıklarında malın tamamını alırlar. Alacakları paylar, hisselerin tamamını kuşatmayan ashab-ı feraizle birlikte bulunduklarında onlardan artakalan malı alırlar. Eğer herhangi bir şey artmazsa bir şeyalamazlar. Kurtubi şöyle der: Fıkıh bilginlerinin kız kardeşle, kıza \"asabe\" ismini vermeleri mecazendir. Çünkü bu meselede kız kardeş, ölünün kızından artanı aldığı için asabeye benzemiş olmaktadır. İleride geleceği üzere Buhari böyle bir başlık kullanmıştır. Tahavı şöyle demiştir: İbn Abbas ve ona tabi olanlar, İbn Abbas hadisine dayanarak şu hükmü vermiştir: Bir kimse ölüp, geriye kızı, anababa bir erkek ve kız kardeşi kalsa kızı, mirasın yarısını alır. Arta kalanı erkek kardeşinindir. Kız kardeşi ise ana-baba bir kardeş olduğu halde herhangi bir şey alamaz. İbn Abbas ve onun görüşünü benimseyenler, bL;! hükmü şu meselede geçerli bir kuralolarak kabul etmişlerdir: Ana-baba bir kız kardeşle birlikte asabe de bulunsaydı, ölünün kızının yanında kız kardeşine hiçbir şey düşmeyecekti. Tam tersine kızdan arta kalan miras -ne kadar uzak olurlarsa olsunlar- asabelerin olacaktı. Bunlar görüşlerini bir de \"Eğer çocuğu olmayan bir kimse ölür de onun bir kız kardeşi bulunursa, bıraktığının yarısı bunundur\"(Nisa 176) ayetine dayanmışlardır. Bu görüşün savunucuları şöyle derler: Ölünün kızıyla birlikte kız kardeşine mirastan pay verenler, Kur' an' ın zahirine muhalif düşerler. Tahavı şöyle devam eder: İbn Abbas ve onun görüşünü benimseyenlere karşı ittifakla kabul edilen şu yaklaşım ileri sürülmüştür: Bir kimse ölüp, geriye kızı ve oğlunun oğluyla, oğlunun kızı kalsa kızı mirasın yarısını alırken, geriye kalan oğlunun oğluyla, oğlunun kızı arasında paylaştırılır. Bu bilginler oğlunun oğluna erkek olduğu için mirasın kalanını tahsis etmemişler, tam tersine onun yanında kız kardeşini de -dişi olduğu halde- mirastan pay sahibi kılmışlardır. Tahavı şöyle devam eder: Buradan anlaşılıyor ki İbn Abbas hadisi ifadesindeki genellik üzere değildir. Tam tersine o şöyle bir özel durumla ilgilidir: Bir kimse ölse geriye kızı, amcası ve halası kalsa kıza mirasın yarısı verilir. Geriye kalanı bilginlerin ittifakıyla halanın değil, amcanındır. Tahavı der ki: Akıl erkek kardeşle kız kardeşin amca ve hala gibi değil, oğlan ve kız gibi değerle ndirilmesinin tercih edilmesini gerektirmektedir. Çünkü ölünün geriye sadece öz erkek ve kız kardeşi kalsa mal aralarında ikili birli taksim edilir. Ölünün oğlunun oğlu ve oğlunun kızı kaldığı takdirde de hüküm böyledir. Buna karşılık ölünün amcası ve halası mirasçı kaldığında bilginlerin ittifakıyla malın tamamı halaya değil, amcaya verilir. Tahavı şöyle der: Delilolarak dayandıkları ayetten başlayacak olursak, bu görüşü savunanlar bir kimse ölür, geriye kızı ve baba bir erkek kardeşi kalırsa kızın mirasın yarısını alacağı ve geriye kalanın erkek kardeşe verileceği noktasında ittifak etmişlerdir. Onların anlayışına göre \"çocuğu olmayan\" ayetinden maksat, malın tamamını almayan değil, alan çocuktur. Asabelerin ölüye en yakın olanları oğulları, sonra aşağıya doğru oğlunun oğullarıdır. Bunların ardından babası, sonra -birlikte olmamak kaydıyla- dedesi ve erkek kardeşi gelir. Dedeyle erkek kardeşin birlikte bulunmasının hükmü ileride gelecektir. Daha sonra erkek kardeşin oğulları, sonra aşağıya doğru onların oğulları, ardından amcalar, sonra aşağıya doğru amcaoğulları gelir. Ölüye ana ve baba ile bağlanan akrabalar, baba ile bağlanandan önceliklidir. Fakat baba bir erkek kardeş, ana baba bir erkek kardeşin oğlundan önceliklidir. Baba bir erkek kardeşin oğlu, ana baba bir amcadan önceliklidir. Baba bir amca, ana baba bir amcaoğlundan önceliklidir. İmam Buhari bu hadise dayanarak ölünün oğlunun oğlunun kendisinden daha aşağı derecede oğlan yoksa malın tamamını alacağı, dedesinin kendisinden daha alt derecede dede yoksa malın tamamına mirasçı olacağı ve ana bir erkek kardeşin ölünün amcaoğlu olmadığı takdirde hem ashab-ı feraizden ve hem de asabeden olmak kaydıyla mirasçı olacağını söylemiştir",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6733,
			"arabicnumber": 6733,
			"text": "Sa'd b. Ebi Vakkas şöyle anlatmıştır: Ben Mekke'de öyle bir hastalığa yakalandım ki neredeyse ölecektim. Bu sırada Resulullah Sallallahu Aleyhi ve Sellem beni ziyarete geldi. Ona \"Ya Resulallah! Benim çok malım vardır. Bana kızımdan başka varis olacak kimse de yoktur. Bu durumda malımın üçte ikisini tasadduk edebilir miyim?\" diye sordum. Nebi Sallallahu Aleyhi ve Sellem \"Hayır\" dedi. Ben \"Yarısını tasadduk edebilir miyim?\" dedim. ResuIuIlah Sallallahu Aleyhi ve Sellem \"Hayır\" dedi. Bunun üzerine \"Ya üçte birini?\" diye sordum. Bana şöyIe cevap verdi: \"Üçte bir bile fazladır. Çocuklarını zengin kişiler olarak bırakman, muhtaç ve insanlara el açar bir halde bırakıp gitmenden daha hayırlıdır. Şüphesiz sen eşinin ağzına kaldırıp vereceği n lokmaya varıncaya kadar infak edeceği n her bir nafakadan muhakkak sevaba ereceksin.\" Ben yine \"Ya ResuIaIlah! Hicretimden geriye mi kalacağım?\" dedim. ResuIuIlah Sallallahu Aleyhi ve Sellem şöyIe cevap verdi: \"Hayır, sen benim ardımda asla geri kalmayacaksın. (Şayet burada kalır da) Allah rızasını isteyerek herhangi bir amel yaparsan elbette onunla merteben yükselecek, derecen artacaktır. Öyle ümit ediyorum ki sen benim ardımdan uzun zaman yaşayacaksın. Hatta senden birtakım kavimler faydalanacaktır,diğer bir takımları da zarar göreceklerdir. Lakin en çaresiz olan Sad b. Havledir.\" Ravi \" Nebi Sallallahu Aleyhi ve Sellem Sa' db. HavIe Mekke' de öIdüğü için ona acır, üzüIürdü\" demiştir. Ravinin ifadesine göre Sa'd b. HavIe, Amir b. Luey oğullarından bir kişi idi",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6734,
			"arabicnumber": 6734,
			"text": "Esved b. Yezid şöyIe demiştir: \"Muaz b. CebeI bize Yemen'e bir eğitici / öğretici ve emir oIarak geIdi. Kendisine vefat edip, geride bir kızıyIa kız kardeşi kaIan kimsenin mirasının nasıI payIaştmIacağını sordu k. Muaz mirasın yarısını kıza, yarısını da kız kardeşe verdi.\" Fethu'l-Bari Açıklaması: Kız çocukIarının mirası konusundaki temeI dayanak, Feraiz böIümünün baş tarafında geçtiği üzere \"Allah size çocuklarınız hakkında erkeğe, kadının payının iki misli (miras vermenizi) emreder\"(Nisa 11) ayet-i kerimesidir. KızIarın mirasına, ayetin nüzuI sebebine ve cahiliye haIkının kızIara miras vermedikIerine daha önce işaret edilmişti. \"(Çocuklar) ikiden fazla kadın iseler\"(Nisa 11) ayet-i kerimesi hakkında o meşhur soruya cevap veren bilginIer de aynı sebebi esas aImışIardır. Çünkü bu ayet inince şöyIe denilmişti: Ayette iki kızın tek başIarına değil, öIenin,oğIuyIa birlikte bulunma durumundaki hükmü ile her iki halde tek kızın ve iki kızdan daha fazlasının durumu zikredilmektedir. İbn Abbas, iki kızın hükmünün bir kız gibi olduğu görüşünde tek kalmıştır. Çoğunluk bu görüşü benimsememiştir. Bilginlerin bu konudaki esas aldıkları delil hakkında ihtilaf edilmiştir. Bazı bilginler, iki kızın hükmünün üç ve daha fazla kızın hükmü gibi olduğunu söylemiştir. Bunların delili sünnetteki açıklamalardır. Çünkü ayet ihtimale açık olunca sünnet, iki kızın hükmünün ikiden daha fazla kızın hükmü gibi olduğunu açıklamıştır. Bu, nüzul sebebi konusunda açık ve nettir. Zira amca iki kızın mirastan payalmasına engel olunca ve kızların anneleri bunu şüpheyle karşılayınca Nebi Sallallahu Aleyhi ve Sellem ona \"Allah bu konuda hükmünü verecektir\" buyurmuş, bunun üzerine miras ayeti inmiştir. Resulullah Sallallahu Aleyhi ve Sellem amcaya haber göndermiş ve \"Sa'd'ın iki kızına mirasın üçte ikisini ver\" buyurmuştur. Bu durum Kitabın (Kur'an) sünnetle nesh edilmesi sonucunu doğurur gibi bir itiraza mahal yoktur. Çünkü yapılan nesh değil, açıklamadır. Bazıları ise şöyle demiştir: İki kızın hükmü, iki kız kardeşe kıyas edilerek bulunmuştur. Çünkü kızlar daha önceliklidir. Zira onlar, ölüye kızkardeşine nazaran daha şefkatli olmak gibi bir özellik taşırlar, Dolayısıyla onlar, kızkardeşlerden daha aşağı mertebede olamazlar",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6735,
			"arabicnumber": 6735,
			"text": "İbn Abbas'ın nakline göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Miras pay/arını sahip/erine veriniz. Bu pay/ardan geri ka/an herhangi bir şey de baba tarafından en yakın o/an erkek kişiye aittir. \" Fethu'l-Bari Açıklaması: İmam Buhari'nin attığı bu başlıktan maksadı, ölen kişinin kendi sulbünden oğlu hayatta olmadığı takdirde demektir ki ölenin oğlu, oğlun oğlunun ister babası olsun, isterse amcası olsun farketmez. İbn Battal şöyle demiştir: Fıkıh bilginlerinin çoğunluğuna göre bir kimse ölür, geride eşi, babası, kızı ve oğlunun oğluyla, oğlunun kızı kalırsa, ashab-ı feraiz'den eş, 114, baba 116 ve kız 112 alır. Geriye kalan ise bir erkeğe iki dişi hissesi olmak şartıyla oğlun oğluyla kızına kalır. Geride kalan kız, oğlandan daha alt derecede ise oğlan mirasın kalanını alırken, kız bir şeyalamaz. Bazı alimlere göre ise geri kalan hisse mutlak olarak oğlana verilir. Çünkü Nebi Sallallahu Aleyhi ve Sellem \"Bu pay/ardan geri ka/an herhangi bir şey de baba tarafından en yakın o/an erkek kişiye aittir\" buyurmaktadır. Zeyd b. Sabit ve çoğunluk ise \"Allah size çocuk/arın ız hakkında erkeğe, kadının payının iki mis/i (miras vermenizi) emreder\"(Nisa 11) ayetini esas almışlardır. Onlar, gerek erkek, gerek kız oğlanın çocuklarının ölünün oğlu hayatta olmadığı takdirde aynı derecede olmaları kaydıyla oğullar gibi olduğu noktasında icma etmişlerdir. Buna göre oğlun oğluyla, oğlun kızının birlikte mirastan payalmaları \"en yakın o/an erkek kişiye aittir\" ifadesinin genelliğini tahsis etmektedir",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6736,
			"arabicnumber": 6736,
			"text": "Huzeyl b. Şurahbil şöyle demiştir: Ebu Musa el-fş'ari'ye ölenin kızı, oğlunun kızı ve kız kardeşi birlikte bulunduklarında miras payları soruldu. Ebu Musa şöyle cevap verdi: \"Miras malın yarısı ölen kişinin kızına, bir yarısı da kız kardeşine aittir.\" Ebu Musa soruyu soran kişiye \"Abdullah b. Mesud'a git (bu meseleyi ona da sor). Zannediyorum o da benim görüşüm e uygun cevap verecektir\" dedi. Mesele İbn Mesud'a sorulup, Ebu Musa'nın cevabı ve onun tarafından gönderildiği haber verilince Abdullah b. Mesud şöyle dedi: \"Eğer oğlun kızını mirastan mahrum edersem elbette dalalete düşmüş kimselerden olurum. Hidayete erenlerden olamam. Bu meselede ben Nebi Sallallahu Aleyhi ve Sellem'in hükmettiği gibi hükmederim (ki o da şudur): Ölünün kızı mirasın yarısını alır, oğlununkızı da üçte ikiyi tamamlamak üzere ltıda bir alır. Geri kalan (üçte bir) de kız kardeşin payı olur\" dedi. Hüzeyl şöyle dedi: Biz Ebu Musa'ya gelip, İbn Mesud'un fetvasını kendisine haber verdik. Bize \"Aranızda bu habr (büyük alim) bulunduğu sürece bana bir şey sormayınız\" dedi. Fethu'l-Bari Açıklaması: Ebu Ubeyd el-Herevı, \"habr\" kelimesinin sözü yazıp telif etme, güzelleştirme kökünden türeme \"alim\" anlamına olduğunu söylemiştir. İbn Battal şöyle der: Bu hadisten şöyle bir sonuç çıkmaktadır: Bir alim herhangi bir meselede nass olmadığını düşündüğü takdirde içtihad eder ve o meseleyi araştırmadıkça cevap vermeye kalkışmaz. Hadis bize herhangi bir ihtilaf halinde Nebi s.a.v.'in sünnetinin delil olduğunu göstermektedir. Dolayısıyla böyle bir durumda hadisi esas almak gerekir. Hadisten o dönemin bilginlerinin in saf sahibi kişiler olduklarını, hakkı kabul edip, ona döndüklerini, birbirlerinin alim ve fazilet sahibi kimseler olduğuna şehadet ettiklerini, İbn MfZsud'un sünneti iyi bildiğini, Ebu Musa'nın fetva verirken araştırdığını ve kencljsinden daha alim olduğunu düşündüğü kimseyi gösterdiğini görüyoruz.\" . İbn Battal şöyle devam eder: --İbn Mesud'un rivayeti konusunda bilginler arasında herhangi bir ihtilaf yoktur. Ebu Musa'nın cevabı onun kendi görüşünden döndüğünü göstermektedir. Tahavı, İbn Mesud hadisine dayanarak İbn Abbas'ın rivayet ettiği \"Bu paylardan geri kalan herhangi bir şey de baba tarafından en yakın olan erkek kişiye aittir\" hadisinden maksadın, ölüye asabelerin en yakını olduğunu söylemiştir. Buna göre ölüye en yakın asabe kadın bile olsa ashab-ı feraizden arta kalan malı o alır. Hadisin bu hükme delaleti şöyledir: Nebi Sallallahu Aleyhi ve Sellem baba tarafından olan kızkardeşleri kızlarla birlikte asabe yapmıştır. Dolayısıyla onlar kızlarla birlikte bulunduklarında miras açısından erkek hükmünde olmuşlardır. İbnü'l-Arabı şöyle der: Ebu Musa ve İbn Mesud olayından herhangi bir konuda haber olduğu öğrenilmeden önce kıyasa göre amel etmenin caiz olduğu, öğrendikten sonra haberin hükmüne dönmek gerektiği ve nassa aykırı olan hükmü almamak gerektiği anlaşılmaktadır",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6737,
			"arabicnumber": 6737,
			"text": "İbn Abbas'ın nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"Miras paylarını sahiplerine veriniz. Bu paylardan geri kalan herhangi bir şey de baba tarafından en yakın olan erkek kişiye aittir\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6738,
			"arabicnumber": 6738,
			"text": "İbn Abbas şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem'in \"Bu ümmetten bir dost edinseydim muhakkak onu (EbU Bekir'i) edinirdim, fakat İslam dostluğu her şeyden daha üstündür -yahut- daha hayırlıdır\" buyurmasına gelince şüphesiz o dedeyi (mirasta) baba derecesine indirmiştir veya dedenin baba gibi olduğuna hükmetmiştir. Fethu'l-Bari Açıklaması: Bu konuda \"dede\"den maksat, baba tarafından olan dededir. Erkek kardeşlerden maksat ise ana-baba bir erkek kardeşlerle, baba bir erkek kardeşlerdir. Ölünün babası varken, dedesinin miras alamayacağı noktasında icma meydana gelmiştir. Oede gerçekten babadır. Fakat ölüye yakınlığı ve uzaklığı itibariyle mertebeleri farklıdır. Bazı alimlere göre bu sözün manası şudur: Oede evlenme haramlığı ve çeşitli iyiliklerin yapılması açısından baba mesabesindedir. Ancak bu iki görüşten meşhur olanı birincisidir. Sıddık olan Hz. Ebu Bekir'in sözüne gelince, Darimi' Müslim'in şartını taşıyan bir senetle bu ifadeyi Ebu Said el-Hudrl'den mevsul olarak \"Ebu Bekir es-Sıddik dedeyi baba (gibi) mütalaa etti\" şeklinde nakletmiştir. Aynı haber Ebu Musa rivayeti ile de sahih olarak nakledilmiştir. Yine Hz. Osman'a dayanan sahih bir isnadla Hz. Ebu Bekir'in dedeyi baba (gibi) mütalaa ettiği rivayet edilmiştir. Hz. Osman'a ait bir ifadede Ebu Bekir'in dedeyi ölenin babası hayatta değilse baba gibi değerlendirdiği nakledilmiştir. İbn Abbas'a dayanan senedi sahih bir rivayete göre Hz. Ebu Bekir dedeyi baba gibi kabul etmiştir. \"Nebi Sallallahu Aleyhi ve Sellem'in sahabileri çok olduğu halde Ebu Bekir'in bu hükmüne muhalefet eden hiçbir kimse olmadığı ile ilgili bir bilgi nakledilmemiştir\" cümlesiyle İbn Abbas zikredilen görüşün delilini güçlendirmek ister gibidir. Çünkü sükuti iemanın delil değeri vardır ve bu konuda sükuti icma meydana gelmiştir. Ölenin babası hayatta değilse, dedenin babanın aldığı mirası alacağını açıkça belirten kişiler arasında müellifin saydıklarından başka Muaz, Ebü'd-Oerda, Ebu Musa, Ubey b. K'ab, Hz. Aişe ve Ebu Hureyre'nin adı zikredilir. İleride geleceği üzere bu görüş, ayrıca -ayrıntıda ihtilaf olmakla birlikte- Hz. Ömer, Osman, Ali ve İbn Mesud'dan rivayet edilmiştir. Tabiundan Ata, Tavus, Ubeydullah b. Abdullah b. Utbe, Ebü'ş-Şa'sa, Şureyh ve Şa'bi'den de bu dOğrultuda görüş nakledilmiştir. Belli başlı beldelere dağılmış fıkıh bilginlerinden (Fukahau'l-emsar) Osman et-Teymi, İmam Ebu Hanife, İshak b. Rahuye, Oavud, Ebu Sevr, el-Müzeni, İbnü's-Süreyc de bu görüşü benimsemişlerdir. Hz. Ömer, Ali, Zeyd b. Sabit, İbn Mesud dede bulunurken erkek kardeşlerin mirasçı olabilecekleri kanaatine varmışlardır. Fakat onlar, ilerde açıklanacağı üzere bunun nasılolacağı noktasında ihtilaf etmişlerdir. İbn Abbas; \"Oğlumun oğlu dururken erkek kardeşlerim bana mirasçı olamazlar. Ben oğlumun oğluna mirasçı olurum\" demiştir. İbn Abdilberr'in ifadesine göre İbn Abbas'ın yaklaşımı şöyledir: Oğlun oğlu oğulolmayınca oğul gibi olduğundan babanın babası da babanın hayatta olmaması halinde baba gibidir . Darimi'nin nakline göre Şa'bi şöyle demiştir: \"Hz. Ömer, de de ye ölünün bir veya iki erkek kardeşi ile birlikte mirastan pay veriyordu. Kardeşler ikiden çok olduklarında onlara mirasın üçte birini paylaştırıyordu. O, ölünün oğlu hayatta olduğunda dedeye mirasın altıda bir veriyordu.\"(Darimi, feraiz) Beyhaki'nin sahih bir senedie nakline göre \"Hz. Ömer, ölenin dedesinin -alacağı miras üçte birden daha çok olacaksa- ana-baba bir erkek ve baba bir erkek kardeşleri ile mirası paylaşacağına hükmetmişti. O, kardeşler çok olduğunda dedeye mirasın üçte birini verirdi. \"(Beyhaki, es-Sünen, VI, 248) Hz. Ali'ye gelince, İbn Ebi Şeybe ve Muhammed b. Nasr'ın sahih bir is na dıa nakillerine göre Şa'bi şöyle demiştir: İbn Abbas, Hz. Ali'ye bir kimse ölüp, geriye mirasçı olarak altı erkek kardeşi ve dedesi kaldığında nasıl hareket edileceğini sordu. Hz. Ali ona \"Oedeyi o kardeşlerden biri gibi kabul edip, mirası yediye böl ve mektubumu at gitsin\" diye cevap verdi. Darimi'nin güçlü bir senetle nakline göre Şa'bi şöyle demiştir: İbn Abbas Basra'da iken Hz. Ali'ye \"Bir dede ve altı kardeşin mirasçı olduğu bir durumla karşılaştım. Ne yapayım?\" diye yazdı. Hz. Ali ona şöyle cevap verdi: \"Dedeye mirasın yedide birini ver. Ondan sonrakilere verme\"(Darimi, Feraiz) Darimi'nin sahih bir senedIe Abdullah b. Seleme'den nakline göre Hz. Ali dedeyi erkek kardeş gibi kabul ediyor ve altıncı mirasçı kılıyordu. Abdullah b. Mesud'a gelince, Darimi'nin sahih bir senetle nakline göre Ebu İshak es-Sebi'i şöyle demiştir: Şureyh'in huzuruna girdim. Yanında Şa'bi, Abdurrahman b. Abdullah b. Mesud bulunuyordu. eı-Aliye adında bizden bir kadının mirasını paylaştırıyarlardı. Kadının kocası, annesi, baba bir erkek kardeşi ve dedesi kalmıştı. Ebu İshak bu olayın devamını şöyle nakletmektedir: Ubeyde b. Amr'ın yanına geldim. -Kufe'de feraizi Ubeyde ve el-Haris el-Aver'den daha iyi bilen kimse yoktur deniyordu.- Ona bu meseleyi sordum. Bana şöyle dedi: \"Eğer istiyorsanız size bu konuda Abdullah b. Mesud'un hükmünü bildireyim. O, (mirası altıya bölüp) kocaya üç hisse yani mirasın yarısını, anneye geriye kalanın üçte birini yani mirasın altıda birini, erkek kardeşe altıda bir ve dedeye altıda bir verdi.(Darimı, Feraiz) Said b. Mansur ve Ebu Bekir b. Ebi Şeybe'nin sahih olan aynı isnadla nakillerine göre Ubeyd b. Nadla şöyle demiştir: Hz. Ömer ve İbn Mesud, erkek kardeşlerle birlikte bulunan dedeye mirastan pay verirlerken altıda birle, kardeşlerle eşit olarak bölüşmekten hangisi lehine ise ona göre hareket ediyorlardı. Aynı haberi Muhammed b. Nasr bu şekilde nakletmiş ve şu ilave de bulunmuştur: Hz. Ömer, Abdullah'a \"Dedeyi mağdur ettiğimizi düşünmekteyim. Bu mektubum sana ulaştığında dedeye erkek kardeşlerle birlikte bulunduğunda mirastan pay ver. Üçte biri ile mirası kardeşlerle eşit bölüşmekten hangisi lehine ise onu ver \"(İbn Ebi Şeybe, el-Musannef, VI, 259) diye yazdı. Sahih bir isnadla Muhammed b. Nasr'ın nakline göre Ubeyde b. Amr şöyle demiştir: Erkek kardeşlerle birlikte bulunduğundadedeye mirasın üçte biri veriliyordu. Hz. Ömer dedeye mirasın altıda birini veriyordu. Sonra Abdullah'a şöyle yazdı: Biz bu dede yüzünden helak olacağımızdan korkuyoruz. Ona mirasın üçte birini ver. Sonra Hz. Ali buraya yani Kufe'ye geldi ve dedeye mirasın altıda birini verdi. Ubeyde şöyle dedi: Hz. Ali ile Ömer'in birlikte verdikleri hüküm, bana ayrı ayrı verdikleri hükümden daha sevimlidir. Zeyd b. Sabit' e gelince, Darimi'nin nakline göre Hasan-ı Basri şöyle demiştir: Zeyd, erkek kardeşlerle birlikte bulunan dedeye mirasın üçte birini veriyordu. (Darimı, Feraiz) İbn Abdilberr şöyle demiştir: Sahabe arasında Zeyd b. Sabit dedenin baba bir erkek kardeşlerle, ana-baba bir erkek kardeşlere denk olduğu görüşünde tek kalmıştır. Birçok fıkıh bilgini bu konuda ona muhalif olmuştur. Çünkü baba bir erkek kardeşler, ana-baba bir erkek kardeşlerle birlikte bulunduklarında mirastan payalamazlar. Dolayısıyla onları öz kardeşlerle bir tutmanın herhangi bir anlamı yoktur. Zira dedenin miras bölüşme durumunda alacağı mirasın azalacağından korkulur. İbn Abbas, Zeyd b. Sabit'e bu durumu sorunca, Zeyd şöyle demiştir: Sen bu konuda nasıl kendi görüşünü söylüyorsan, ben de kendi görüşümü söylüyorum. Tahav! şöyle demiştir: İmam Malik, Şafil ve Ebu Yusuf, beraberinde ana-baba bir erkek kardeşler bulunduğunda dedeye miras verme noktasında Zeyd b. Sabit'in görüşüne katılmışlardır. Onlara göre dedenin kardeşlerle birlikte mirastan ortaklaşa payalması, alacağı üçte birden daha fazla olduğu takdirde onlarla ortaklaşa böıüşür. Eğer üçte bir onun için daha uygunsa onu alır ve baba bir erkek kardeşler dedeyle birlikte bulunduklarında hiçbir şeyalamayacakları gibi, erkek kardeşlerin oğulları da -öz kardeş bile olsalar- mirastan payalamazlar. Dede ve erkek kardeşlerle birlikte ashab-ı feraizden bir kişi bulunduğunda önce onların hissesi verilir, sonra dedeye mirasçılarla birlikte eşit bölüşmek, kalanın üçte birini almak ve mirasın altıda birini almak seçeneklerinde lehine en uygun olanı verilir. Dedenin hissesi Ekderiyye hariç altıda birden eksik olmaz. Tahav! şöyle demiştir: Hişam'ın nakline göre Muhammed b. el-Hasen dede konusunda hüküm vermemiştir. Ebu Yusuf, İbn Ebu Leyla dede konusunda Hz. Ali'nin görüşünü esas alırlardı. Ahmed b. Hanbel'in yaklaşımı ise dedenin (miras açısından) erkek kardeşlerden birisi gibi olduğudur. Mirasın üçte biri dedenin daha çok lehine olduğunda onu alır. Ashab-ı feraizle birlikte bulunduğunda ise onlar hisselerini aldıktan sonra kardeş gibi bölüşme, mirasın kalanının üçte birini alma ya da tümünün altıda birini alma seçeneklerinden lehine en uygun olanı alır. Yukarıda işaret edilen Ekderiyye'ye merbaatü'l-cemaa da denilir. Çünkü onlar mirasçıların dört kişi oldukları noktasında icma etmişler, ancak hisseleri açısından ihtilaf etmişlerdir. Söz konusu mirasçılar, koca, anne, kız kardeş ve dededir. Bu durumda koca mirasın yarısını alırken, anne üçte birini, dede altıda birini, kız kardeş ise yarısını alır. Burada meselenin paydası genişletilerek miras 27 hisse üzerinden bölüştürülür. Buna göre 27 nin 9'unu koca, 6'sını anne, 4'ünü kız kardeş ve 8'ini dede alır. Bazıları bu meseleyi şu şekilde şiir dizelerine dökmüşlerdir. Bilir misin dört kişinin mirastan hissesini? Hesapla her birinin bu mirastan hissesini! Birisi alır tüm serveti n üçte birini (eş), İkincisine verirler geri kalanın üçte birini (anne) Üçüncü de bundan sonra alır kalanın üçte birini (kız kardeş) Nedir hissesi dördüncünün? Yokla bakalım bilgini! (dede)",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 6739,
			"arabicnumber": 6739,
			"text": "İbn Abbas şöyle demiştir: \"Miras olarak kalan mal, çocuklara aitti. Vasiyet de (ilk zamanlar) ana baba için yapılıyordu. Allahu Teala bundan dilediği kısmı nesh etti ve erkeğe iki dişinin payı hisse tahsis etti. Ölen kişinin anne ve babasından her birine altıda bir, hanımına (çocuğu olauğu takdirde) sekizde bir, (bulunmadığında) dörtte bir ayırdı. Kocaya (ölenin çocuğu bulunmadığında) yarısını ve (çocuğu bulunduğunda) dörtte birini verdi.\" Fethu'l-Bari Açıklaması: Koca, hiçbir durumda mirastan mahrum olmaz. Ancak ölen eşin çocuğu bulunduğunda hissesi yandan dörtte bire iner. İmam Buhari bu konuda \"Miras olarak kalan mal, çocuklara aitti. Vasiyet de (ilk zamanlar) ana baba için yapılıyordu ... \" hadisini zikretmiştir. Bu hadis daha önce Vasaya bölümünde geçmişti ve biz orada bu hadisin gerek senet ve gerekse metin yönünden uzun uzun açıklamasını yapmıştık. İbnü'I-Müneyyir şöyle demiştir: İmam Buharl'nin ayet delili konuya gayet açık olarak işaret ettiği halde İbn Abbas hadisini delilolarak göstermesi, ayetin nüzul sebebini belirtmek ve onun tevil edilmeksizin ve nesih de sozkonusu olmaksızın zahiri üzere olduğuna işaret etmek içindir. Süheylı anne ve babadan her birine mirasın altıda birinin tahsis edilmesindeki hikmeti şu şekilde açıklamıştır: Anne ve babaya mirastan eşit şekilde pay verilmesi, hisselerinin bu miktarın altına düşmemesi ve mesela çocuklar çok olduğu takdirde mağdur olmamaları amacına yöneliktir. Ölenin çocukları veya erkek kardeşleri varken anne ve babanın mirastan eşit olarak payalmaları, her birinin ölen çocuklarını yetiştirme ve benzeri fedakarlıklarına karşılıktır. Ölenin çocuğu ve erkek kardeşleri bulunmadığı takdirde baba, anneye nazaran daha fazla payalır. Çünkü onun harcamada bulunma, yardım etme ve benzeri ayrıcalıkları vardır. Annenin bu durumu ise çocuğun hayatta iken ona iyilik açısından babasına üstün tutulması isteği ile telafi edilir",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 6740,
			"arabicnumber": 6740,
			"text": "Ebu Hureyre r.a. şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem, Lihyan oğullarından bir kadının ölü olarak düşen ce nın i için gurre yani bir köle veya bir cariye verilmesine hükmetti. Sonra hakkında.gurre ile hükmettiği kadın vefat edince Nebi Sallallahu Aleyhi ve Sellem O kadının mirasının oğullarına ve kocasına ait olduğuna ve ödeyeceği diyeti asabesinin ödemekle yükümlü olduğuna hükmetti. Fethu'l-Bari Açıklaması: Karı-kocadan hiçbirinin herhangi bir şekilde miras hakları sakıt olmaz. Aksine çocuk kocanın miras payını yarıdan dörtte bire, kadınınkini ise dörtte birden sekizde bire düşürür. İmam Buhari bu konuda bir başka kadına vurup, çocuğunun düşmesine sebep olan kadın hakkında verilen hükmü Ebu Hureyre'den nakletti. Bu olayda vuran kadın daha sonra ölür. Nebi s.a.v. cenin hakkında gurre ile hükmeder ve bunu katil olan kadının asabesinin ödemek zorunda olduğunu ve kendi mirasının ise çocuklarına ve kocasına kalacağını belirtir. Bu hadisin geniş bir açıklaması ileride inşaallah Diyat bölümünde gelecektir",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 6741,
			"arabicnumber": 6741,
			"text": "Esved şöyle demiştir: Muaz b. Cebel, Nebi Sallallahu Aleyhi ve Sellem'in zamanında bizim aramızda kız için yarım, kız kardeş için de yarım paya hükmetti. Hadisi nakleden ravilerden Süleyman b. Mihran \"Bizim aramızda hükmetti\" derken, \"Resulullah Sallallahu Aleyhi ve Sellem zamanında\" cümlesini zikretmemiştir",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 6742,
			"arabicnumber": 6742,
			"text": "Huzeyl b. Şurahbil, (Kız, oğlun kızı ve kız kardeş mirası) konusunda elbette Nebi Sallallahu Aleyhi ve Sellem'in hükmettiği gibi hüküm vereceğim -veya Nebi Sallallahu Aleyhi ve Sellem buyurdu ki- diyerek söze başlamış ve kız için yarım, oğlun kızı için altıda bir ve kızkardeş için de asabe yoluyla geri kalan üçte bir verileceğini söylemiştir. Fethu'l-Bari Açıklaması: İbn Battal şöyle demiştir: Bilginler, kız kardeşlerin ölünün kızlarıyla birlikte bulunduklarında asabe oldukları konusunda icma etmişlerdir. Buna göre kız kardeşler, kızlardan arta kalan mirası alırlar. Bir kimsenin geriye sadece kızı ve kız kardeşi kalsa Muaz'ın rivayet ettiği hadise göre kızı yarısını, kız kardeşi de kalan yarısını alır. Buna karşılık iki kız ve bir kız kardeşi kalacak olsa, kızlar mirasın üçte ikisini alırken kız kardeş kalan üçte birini alır. Bir kimsenin öldükten sonra geriye kızı, kız kardeşi, oğlunun kızı kalsa İbn Mesud hadisine göre kızı mirasın yarısını alırken, oğlunun kızı, bu payı 2/3'e çıkaracak hisseyi alırken, kız kardeşi de geriye kalanı alır. Çünkü kızlar 2/3'ten daha fazlasına mirasçı olamazlar. Bu konuda İbn Mesud'a, İbn Abbas'tan başka muhalif olan olmamıştır. Çünkü İbn Abbas şöyle diyordu: Kız, mirasın yarısını alırken, kalanı asabenindir. Kız kardeş ise hiçbir şeyalamaz. Aynı şekilde ölenin kızıyla, oğlunun kızı mirasın 2/3'ünü alırken, kalanı asabenindir. Ölünün asabesi olmadığında ise kalan kısım kıza veya kızlara iade edilir. Bu konudaki hüküm daha önce geçmişti. İbn Battal şöyle devam eder: Zahiriler hariç bu konuda İbn Abbas'a katılan olmamıştır. İbn Battal şöyle devam eder: Çoğunluğun delili akli açıdan şöyledir: Allahu Teala'ın \"Eğer çocuğu olmayan bir kimse ölür de onun bir kız kardeşi bulunursa ... \"(Nisa 176) ayet-i kerimesinde \"çocuğun olmaması\", kız kardeşin mutlak olarak mirastan payalmasının değil, diğer varislerle bölüştüğü payını almasının şartı kılınmıştır. Şart bulunmadığında hisse sakıt olur. Bu onun başka bir manada mirasçı olmasına engel değildir. Tıpkı erkek kardeşin kız kardeşine mirasçı olmasının onun çocuğunun bulunmaması şartına bağlanması gibi. Erkek kardeş, kız kardeşine -onu!) çocuğu olmadığı takdirde- mirasçı olur. Bilginler, erkek kardeşin kız kardeşine onun kızı ile birlikte mirasçı olabileceği noktasında icma etmişlerdir. Bu mesele kocanın mirasın yarısını alabilmesi için ölenin çocuğunun olmamasının şart olmasına benzemektedir. Bu, kocanın ölenin kızıyla birlikte bulunduğunda mirasın yarısını almasına man i değildir. Koca yarının yarısını hissesi olarak, kalan yarıyı da -mesela ölen kadının amcaoğlu ise- asabe olarak alır. Kız kardeş de açıklamasını yaptığımız durumda aynen böyledir. Doğruyu en iyi Allah Teala bilir",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 6743,
			"arabicnumber": 6743,
			"text": "Cabir r.a. şöyle demiştir: Ben hasta iken Resulullah Sallallahu Aleyhi ve Sellem yanıma geldi. Abdest suyu istemiş ve abdest almış. Sonra abdest suyundan benim üzerime serpmiş. Bunun üzerine baygınlıktan ayıldım ve \"Ya Resu:allah! Benim (mirasçı olarak) ancak kız kardeşlerim vardır\" dedim. Bunun üzerine feraiz ayet i indi. Fethu'l-Bari Açıklaması: İmam Buhari bu konuda Feraiz bölümünün en başında yer alan Cabir hadisini zikretmiştir. Hadise burada da yer verilmesinin amacı Cabir'in \"Benim (mirasçı olarak) ancak kız kardeşlerim vardır\" şeklindeki ifadesidir. Çünkü bu ifade onun çocuğunun olmadığını kesin olarak belirtmektedir. Müellif buradan erkek kardeşlerin mirastan evleviyetle payalacakları sonucunu çıkarmıştır. Imam Buharl'nin önce kız kardeşlerden söz etmesi, hadis-i şerifte onların açık olarak ifade edilmelerindendir. İbn Battal şöyle demiştir: Bilginler, ana-baba bir erkek kardeşlerle baba bir kardeşlerin, ölenin oğluyla (oğlunun oğlu, oğlunun oğlunun oğlu ... da aynıdır) birlikte bulunduklarında ona mirasçı olacakları, babayla birlikte bulunduklarında olamayacakları noktasında görüş birliği etmilerdir. Fıkıh bilginleri daha önce işaret edildiği üzere sözü geçen varislerin öleı.:n dedesiyle birlikte bulunmaları durumunda mirastan pay alıp alama'acakları noktasında ihtilaf etmişlerdir. Bunun dışında kız kardeşlerden birisi hissenin yarısını alırken, iki kız ve daha fazlası üçte ikisini alırlar. Erkek kardeş ise tamamını alır. Bundan daha fazla mirasçı bulunduğunda mirası ortaklaşa böıüşürler. Mirasçılar erkek ve kız kardeşler şeklinde iseler Kur'an-ı Kerim'in açıkça belirttiği üzere erkek, iki dişi hissesi alır. Bu konuda fıkıh bilginleri arasında herhangi bir ihtilaf yoktur. Ancak bir kadının geriye kocası, annesi ve ana bir iki kız kardeşiyle, ana-baba bir erkek kardeşi kaldığı takdirde çoğunluğu oluşturan bilginler, bunların tümü mirastan payalır derlerken, Hz. Ali, Ubey, Ebu Musa ana-baba bir bile olsalar erkek kardeşlerin ana bir erkek kardeşlerle birlikte bulunduklarında mirasçı olamayacaklarını söylemişlerdir. Çünkü onlar asabedirler. Oysa ashab-ı feraiz mirasın tamamını almış bulunmaktadır. KCıfelilerden bir grup da aynı görüşü ileri sürmüşlerdir",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 6744,
			"arabicnumber": 6744,
			"text": "Bera’ şöyle demiştir: En son inen ayet Nisa suresinin sonundaki \"Senden fetva isterler. Deki: Allah; babası ve çocuğu olmayan kimsenin mirası hakkındaki hükmü şöyle açıklıyor\" ayetidir. Fethu'l-Bari Açıklaması: İmam Buhari bu konuda Bera hadisine yer vermiştir. Ebu Davud'un elMerasil'inde nakline göre Ebu Seleme b. Abdurrahman şöyle anlatmıştır: Adamın biri Nebi s.a.v.'e gelerek \"Ya Resulallah! Kelale nedir?\" diye sordu. Resulullah Sallallahu Aleyhi ve Sellem \"Babası ve çocuğu olmayan bir kimsenin varisleri kelaledir\" buyurdu. Müslim'in Sahih'inde nakline göre Hz. Ömer bir Cuma hutbesinde şöyle demiştir: \"Benden sonraya kanaatimce kelaleden daha önemli bir şey bırakmıyorum. Nebi s.a.v.'e kelale hakkında_başvurduğum kadar, başka bir konuda başvurmuş değilim. Sonunda Resulullah s.a.v. parmağı ile göğsümü dürterek şöyle dedi: \"Nisa suresinin sonundaki yazın inen ayet sana yetmiyor mu?\" Kelalenin açıklaması konusunda bilginler ihtilaf etmişlerdir. Çoğunluğa göre kelale, çocuğu ve babası olmayan kişidir. Fıkıh bilginleri, ölünün kızıyla birlikte mirasçı olarak kalan kız kardeşin onunla birlikte mirastan payalıp alamayacağı noktasında ihtilaf etmişlerdir. Bilginler aynı şekilde dedenin baba gibi kabul edilip, onun mirasçı olarak bulunması durumunda kardeşlerin mirastan payalıp alamayacağı noktasında da ihtilafa düşmüşlerdir. İbnü'l-Müneyyir şöyle der: Kelale ayetine dayanarak kız. kardeşlerin asabe olacakları sonucunu çıkarmak son derece hoştur. Feraiz ayetlerinde yerleşen usul şöyledir: Kız kardeşler hakkında zikri geçen şart, mirasçı olup olmadıkları ile ilgili değil, onların alacakları hissenin miktarı ile ilgilidir. Buradan anlaşılan şudur: Miras miktarının değişmesi için şart bulunmadığı takdirde bu sözkonusu usuldendir. Ana-babanın miras paylarını düzenleyen ayette mirasın miktarı değişirken, mirasçı olmak durumu değişmemektedir. Aynı durum koca ve karı için de geçerlidir .. Buna kıyas ederek kız kardeş hakkında şöyle bir kural çıkarılabilir: Ölenin çocuğu olmadığı takdirde kız kardeş mirasın yarısını alır. çocuğu olduğu takdirde miktarı değişir ama mirasçı olma durumu değişmez. Bu konuda asabe olmaktan başka değişikliğin sözkonusu olan bir başka miktar yoktur. Bundan kız kardeşin ölen kişinin oğluyla birlikte bulunması durumunda mirastan payalacağı sonucu çıkarılmamalıdır. Çünkü o bilginlerin İcmaı ile istisnadır. Dolayısıyla onun dış ındakiler aslı üzere kalırlar. Doğruyu en iyi Allahu Teala bilir",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 6745,
			"arabicnumber": 6745,
			"text": "Ebu Hureyre r.a.'in nakline göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Ben mu'minlere kendi öz nefislerinden daha yakınımdır. Her kim ölür de arkasında bir mal bırakırsa, malı mirasçılarına, asabesine aittir. Her kim de arkasında borç veya kendi ihtiyaçlarını göremeyen aciz kimseler bırakırsa ben onun velisiyim. Ben o kimse için çağrıImm",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 6746,
			"arabicnumber": 6746,
			"text": "İbn Abbas'ın nakline göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Miras paylarını sahiplerine veriniz. Bu paylardan geri kalan herhangi bir şey de baba tarafından en yakın olan erkek kişiye aittir.\" Fethu'l-Bari Açıklaması: İmam Buharl'nin attığı başlığı şu şekilde açıklamak mümkündür: Bir adam bir kadınla evlenir. Kadın ondan bir erkek çocuk dünyaya getirir. Sonra aynı adam, başka bir kadınla evlenir. O kadın da bundan bir erkek çocuk doğurur. Sonra adam ikinci kadından ayrılır. O ikinci kadınla bu kişinin erkek kardeşi evlenir. Kadın ondan da bir kız doğurur. Bu kız, ikinci oğlanın ana bir kız kardeşi ve amcasının kızıdır. Sonra bu kız da amcaoğlu olan birinci oğlanla evlenir. Sonra bu kadın ölür, geriye birisi ana bir erkek kardeş, diğeri de kocası olan iki amcaoğlu bırakmış olur. Hz. Ali'nin yaptığı taksime göre koca mirasın yarısını alır. Ana bir erkek kardeş altıda birini alırken, geriye kalan aralarında ortaklaşa bölünür. Kısacası erkeğe kadının kocası olduğu için mirasın yarısı verilirken, diğerine ana bir erkek kardeşi olduğu için altıda biri verilir. Geriye mirasın üçte biri kalır. Bu da asabe olma hasebiyle aralarında böıüştürüıür. Böylece koca mirastan kocalık hissesi ve asabe olması hasebiyle üçte ikisini alırken, diğeri miras hissesi ve asabe olarak üçte birini alır. İbn Battal şöyle demiştir: Zeyd b. Sabit ve çoğunluğu oluşturan fıkıh bilginleri bu konuda Hz. Ali'ye katılmışlardır. Hz. Ömer ve İbn Abbas ise şöyle demişlerdir: Kocanın hissesinden arta kalan malın tamamı, iki akrabalığı kendisinde bulundurana verilir. O kişi altıda birini normal hissesi olarak alırken, kalan üçte birini asabe olarak alır. Hasan-ı Basrı, Ubey, Sevr, Zahirilerin görüşü bu doğrultudadır. Bu görüşü savunanlar birisi ana baba bir, diğeri baba bir olan iki erkek kardeş hakkında var olan icmaı delil .olarak göstermişlerdir. İcmaa göre bu durumda ana baba bir erkek kardeş annesi hasebiyle daha yakın olduğu için malın tamamını alır. Çoğunluğu oluşturanların delilleri ise Buharl'nin Ebu Hureyre hadisinde işaret ettiği husustur. \"Her kim ölür de arkasında bir mal bırakırsa onun malı mirasçılarına, asabesine aittir\" hadisinde \"mevali'l-asabe\" amcaoğullarıdır. Hadiste Nebi Sallallahu Aleyhi ve Sellem amcaoğullarını eşit tutmuş, birini diğerine üstün tutmamıştır. \"Ben o kimse için çağrı lı rı m \" cümlesini İbn Battal şöyle açıklamıştır: Borcunu ödemek ve geride bıraktığı ihtiyaçlarını göremeyen acizlerin ihtiyaçlarını gidermek için beni çağırın",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 6747,
			"arabicnumber": 6747,
			"text": "İbn Abbas \"(Erkek ve kadından) her biri için, ana, baba ve akrabanın bıraktığından (hisselerini alacak olan) varisler kıldık. \"(Nisa 33) ayetini okumuş ve şöyle demiştir: Muhacirler Medine'ye geldikleri zaman Ensara -Nebi Sallallahu Aleyhi ve Sellem'in aralarında kurmuş olduğu kardeşlik sebebiyle- kendi hısımları değil, bunlar mirasçı olurlardı. Nihayet \"(Erkek ve kadından) her biri için, ana, baba ve akrabanın bıraktığından (hisselerini alacak olan) varisler kıldık\" ayeti,devamındaki \"yeminlerinizin bağladığı kimselere de paylarını verin\" ayetini nesh etmiştir. Fethu'l-Bari Açıklaması: İmam Buharl'nin bu başlığı atmaktaki geyesi, zevi'l-erham'ın mirastan pay alıp, alamayacaklarını açıklamaktır. Zevi'l-erham on sınıf olup şunlardır: Dayı, teyze, ananın babası, kızın oğlu, kız kardeş oğlu, erkek kardeşin kızı, amca kızı, hala, ana bir amca, ana bir erkek kardeşin oğlu ve ölene bu bunlardan herhangi biriyle bağlanan kimse. Zevi'l-erham'ın mirastan payalacağını söyleyen bilginler, bunların içerisinde en öncelikli olanın kızın oğuııarı, sonra kız kardeş oğuııarı, sonra erkek kardeş kızları, sonra sırasıyla amca, hala, dayı ve teyze olduklarını söylemişlerdir. Zevi'l-erham'dan iki kişi birbiriyle eşit olduğunda ashab-ı feraiz veya asabeye daha yakın olana öncelik verilir. Burada hadise yer verilmesinin sebebi \"(Erkek ve kadından her biri için, ana, baba ve akrabanın bıraktığından (hisselerini alacak olan) varis kıldık\" ayetinin \"yeminlerinizin bağladığı kimselere de paylarını verin\" ifadesini nesh etmiş olduğunu vurgulamaktır. İbn Battal şöyle demiştir: Müfessirlerin çoğunluğuna göre \"(Erkek ve kadından) her biri için ... \" ayetini nesh eden, Enfal suresindeki \"Allah'ın kitabına göre yakın akrabalar birbirlerine (varis olmağa) daha uygundur\"(Enfal 75) ayet-i kerimesidiL Ebu Ubeyd, enNasih ve'l-Mensuh'ta bunu kesin bir dille ifade etmektedir. Biz de şunu ekleyelim: Ebu Davud hasen bir isnadla İbn Abbas'tan bu hadisi rivayet etmitir. İbn Battal şöyle demiştir: Fıkıh bilginleri zevi'!-erham'ın mirastan payalıp, almayacağı noktasında farklı görüşler ortaya koymuşlardır. Zevi'l-erham ayette kendilerine hisse takdir edilmemiş ve asabe de olmayan kimselerdir. Hicaz ve Şam bilginleri, onların mirastan pay alamayacakları kanaatine varmışlardır. KCıfe fıkıh bilginleriyle Ahmed b. Hanbel ve İshak ise, miras alacakları hükmünü benimsemiştir. Bunlar, görüşlerini \"Allah 'ın kitabına göre yakın akrabalar birbirlerine (varis olmağa) daha uygundur\" ayetine dayandırmışlardır. Diğerleri ise şöyle demişlerdir: Bu.ndan maksat, Allah'ın kitabında kendilerine herhangi bir hisse ayrılan kimselerdir. Çünkü Enfal ayeti mücmeldir. Miras ayeti ise onu tefsir etmektedir. Bu bilginlerin hadisten delilleri ise \"Her kim ölür de arkasında bir mal bırakırsa, o asabesine aittir.\" Bu bilginler ifadeyi zahiri üzere bırakma noktasında görüş birliği etmişler ve azad edilen kölenin öldüğünde geride bıraktığı malın mevlalarına (onu azad edenlere) değil, asabelerine miras kalacağını, asabeleri olmadığı takdirde zevi'l-erhamına• değil, mevlalarına intikal edeceğini ifade etmişlerdir ve zevi'l-erham'ın mirastan payalıp almayacağı noktasında ihtilaf etmişlerdir. Ebu Ubeyd şöyle demiştir: Irak bilginlerine göre ashab-ı feraiz hissesini aldıktan sonra ölenin asabesi olmadığı takdirde kalan miras ashab-ı feraize reddedilir. Asabe olduğu takdirde ise hem ashab-ı feraize ve h.em de asabeye red yapılır. Bunlarolmadığı takdirde miras zevi'l-erhama verilir. ıbn Mesud zevi'l-erhamdan her birini, ölüye kimin vasıtası ile mirasçı oluyorsa onun yerine ko'yardı. Sahih bir isnadla nakledilen bir habere göre İbn Mesud halayı baba, teyzeyi anne gibi kabul eder ve mirası aralarında ikili birli taksim ederdi. Hz. Ali'nin anne dururken kıza mirası reddetmediği nakledilir. Bu grup bilginlerin delillerinden birisi de \"Dayı varisi olmayanın varisidir\"(Tirmizi, Feraiz) hadisidir. Bu hadis hasen olup, Tirmizi ve başkaları tarafından nakledilmiştir",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 6748,
			"arabicnumber": 6748,
			"text": "İbn Ömer r.a.'in nakline göre adamın biri Nebi Sallallahu Aleyhi ve Sellem'in zamanında hanımıyla mülaane yaptı ve kadının çocuğunu (n kendinden olduğunu) kabul etmedi. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem aralarını ayırdı, boşanmalarına hükmetti, çocuğa da kadının nesebini verdi. Fethu'l-Bari Açıklaması: İmam Buharl'nin bu başlığı kullanmaktan maksadı kadının kocasıyla mülaanesine konu olan çocuğa mirasçı olup olmayacağıdır. İmam Buhari burada İbn Ömer' in mülaane konusundaki muhtasar hadisine yer vermiştir. Bu hadisin açıklaması lian bölümünde daha önce geçmişti. Burada hadise yer verilmesinin amacı \"çocuğa da kadının nesebini verdi\" cümlesidir. Selef bilginleri bir kimsenin nesebini kabul etmediği çocukla arasında miras cereyan etmeyeceği noktasında ittifak etmekle birlikte, onun nesebinin annesine verilmesinin ne anlama geldiği meselesinde ihtilaf etmişlerdir. Hz. Ali ve İbn Mesud kocasıyla mülaane yapmış kadının oğlu hakkında şöyle demişlerdir: \"Bu çocuğun asabesi annesinin asabesidir.Çocuk onlara, onlar da çocuğa mirasçı olurlar.\" Bu haberi İbn Ebi Şeybe rivayet etmiştir. İbrahim en-Nehaı ve Şa'bl'nin görüşü de bu doğrultudadır. Hz. Ali ve İbn Mesud'un sadece çocuğun annesini asabe kabul ettikleri ve malın tamamının ona verileceğini söyledikleri, naklediimiştir. Anne, çocuktan önce öldüğü takdirde çocuğun malı annenin asabesine aittir. Aralarında Hasan-ı Basrl, İbn Sırın, Mekhul, Sevrı, -bir rivayete göre- Ahmed b. Hanbel'in de bulunduğu bir topluluk bu doğrultuda hüküm vermişlerdir. Hz. Ali'den nakledilen bir rivayete göre mülaane yapmış olan kadın çocuğuna mirasçı olur. Anneden olan erkek kardeşleri de anneye mirasçı olur. Mirastan herhangi bir şeyarttığında o kısım da beytü'l-male intikal eder. Zeyd b. Sabit, bilginlerin çoğunluğu ve belli başlı büyük şehirlerdeki fıkıh bilginlerinin (fukahu'l-emsar) ekseriyeti bu görüştedir. İmam Malik şöyle demiştir: Ben ilim ehli bilginleri bu yaklaşımı benimser gördüm. Şa'bl'nin şöyle dediği naklediImiştir: KufeIiler, Hz. Osman zamanında Hicaz' a birisini göndererek mülaane yapmış kadının' oğlunun miras hükmünü sordular. Hicazlılar onlara çocuğun mirasının annesine ve annesinin asabesine kalacağını haber verdiler",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 6749,
			"arabicnumber": 6749,
			"text": "Aişe r.anha şöyle demiştir: Utbe b. Ebi Vakkas, kardeşi Sa'd b. Ebi Vakkas'a \"Zem'an'ın cariyesinin oğlu Abdurrahman bendendir. Bu çocuğu almalısın\" diye vasiyet etmişti. Mekke'nin fethi yılı olunca Sa'd b. Ebi Vakkas çocuğu yakaladı ve \"Bu kardeşim Utbe'nin oğludur. Bunun nesebinin kendisine verilmesini bana vasiyet etmiştir\" dedi. Bunun üzerine Abd b. Zem'a ayaklanıp \"Bu, benim kardeşimdir; babamın cariyesinin oğludur. Babamın yatağında doğmuştur\" dedi. Her iki taraf anlaşmazlığı çözmek üzere Nebi Sallallahu Aleyhi ve Sellem'e gittiler. Sa'd b. EbiVakkas \"Ya Resulallah! Bu çocuk, kardeşim Utbe'nin oğuludur. Nesebinin kendisine verilmesine dair bana vasiyeti vardır\" dedi. Abd b. Zem'a da \"Bu, benim kardeşimdir ve babamın cariyesi doğurmuştur; babamın yatağında dünyaya gelmiştir\" dedi. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem: \"Ey Abd b.Zem'a! Çocuk sana aittir. Çünkü çocuk kimin yatağında dünyaya ge/mişse onundur. Zina eden için de mahrumiyet vardır\" buyurdu. Hz. Nebi saııallahu aleyhi ve sellem (çocuğun sima itibariyle Utbe'ye benzediğini görerek) eşi Sevde binti Zem'a'ya dönerek \"Ey Sevde! Bundan sonra Abdurrahman'ın karşısında tesettürde bu/un\" buyurdu. Bundan sonra Abdurrahman, Sevde vefat edip, Allahu Teala'ya kavuşuncaya kadar bir daha onu görmedi. Tekrar: 2053, 2218, 2421, 2533, 2745, 4303, 6765, 6817, 7182",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 6750,
			"arabicnumber": 6750,
			"text": "Ebu Hureyre r.a.'in nakline göre Nebi Sallallahu Aleyhi ve Sellem \"Çocuk kimin yatağında dünyaya ge/mişse onundur\" buyurmuştur. Fethu'l-Bari Açıklaması: Hattabi ve ona uyarak lyaz, Kurtubi ve başka bilginler şöyle demişlerdir: Cahiliye dönemi insanları cariye alırlar ve onları her gün kendilerine belli bir bedeli ödemekle yükümlü tutarlardı. Bundan dolayı cariyeler fuhuş yoluyla para kazanırlardı. Cahiliye dönemi insanları -nikah bölümünde değindiğimiz üzerezina eden kimseler, çocuğun nesebinin kendilerine ait olduğunu iddia ettikleri takdirde o nesebi iddia edene verirlerdi. Yukarıdaki hadiste adı geçen Zem'an'ın bir cariyesi vardı. Zem'a arasıra bunun yanına gelip gidiyordu. Derken hamile olduğu anlaşıldı. Utbe b. Ebi Vakkas çocuğun kendinden olduğunu iddia ederek kardeşi Sa'd'a onun nesebinin kendisine verilmesini vasiyet etti. Sa'd b. Ebi Vakkas bu çocuk hakkında Abd b. Zem'a ile anlaşmazlığa düştü. Sa'd, Abd'e \"Cahiliye döneminde geçerli kurallaragöre o çocuk kardeşimin oğludur\" dedi. Abd ise \"İslam' da yerleşik kaideye göre o benim kardeşimdir\" cevabını verdi. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem cahiliye hükmünü ortadan kaldırıp, çocuğun Zem'a'ya ait olduğu hükmünü verdi. lyaz, Hattabl'nin \"çocuğun nesebinin kendilerine ait olduğunu iddia ettikleri takdirde\" cümlesini \"anne bunu itiraf ettiğinde\" şeklinde değiştirmiştir. Kurtubi ise görüşünü her iki yaklaşıma dayandırarak şöyle demiştir: çocuğun nesebi cahiliye döneminde Utbe'ye verilmemişti. Bu ya Utbe'nin çocuğun nesebinin keı;ı.dine ait olduğunu iddia etmediğinden ya da annenin çocuğun Utbe'ye ait olduğunu kabul etmemesinden kaynaklanıyordu. Biz de şunu belirtelim: Nikah bölümünde Hz. Aişe radıyallilhu anhil'dan naklen bir hadis yer almıştı. O hadis cahiliye insanlarının bir olayda annenin babaya nesep vermesini kabul ettiklerini teyid ederken, bir başka olayda kaiflerin nesep verdiklerini gösteriyordu. Sözkonusu rivayet \"Cahiliye döneminde nikah dört çeşitti\" şeklinde başlırdu. Bu hadiste konumuzia ilgili olarak şu ifadeler yer almaktaydı: \"Sayıları onu bulmayan bir topluluk bir araya gelir ve kadının yanına girerek her biri onunla ilişkide bulunurdu. Kadın hamile kalıp, çocuğunu doğurduğunda ve birkaç gece geçtiğinde onlara haber gönderirdi ve erkeklerin tümü kadının yanında bir araya gelirlerdi. Kadın 'çocuğu dünyaya getirdim ey filanca o senin oğlundur' der ve kadının çocuğunun nesebi o erkeğe verilirdi. Erkek bunu reddedemezdi.\" Aynı rivayette şu ifadeler de yer almaktadır: \"Nikah çeşitlerinden birisi de facir ve fahişelerin nikahı idi. Bu tip kadınlar kapıları üzerine bir bez asarlardı. Onları arzulayan erkekler odalarına girerdi. Bu kadınlardan herhangi biri hamile kalıp çocuğunu doğurduğunda kaif1er oraya toplanır, sonra kadının çocuğunun nesebini kaifin uygun gördüğü bir erkeğe verirlerdi. Erkek bunu reddedemezdi.\" Zem'a'nın cariyesi olayına uygun düşen bu son rivayettir. Yukarıda anlatılan kıssadan çocuğa neseb verilmesinin sadece babaya mahsus olmadığı, tam tersine erkek kardeşin baba adına nesep kabul edebileceği sonucu çıkarılmıştır. Şafiilerin ve bir grup fıkıh bilgininin görüşü bu doğrultudadır. Ançak erkek kardeşin mirastan payalıyor olması veya diğer vereselerin bunu kabul etmeleri, çocuğun adı geçen erkekten dünyaya gelmesinin imkan dahilinde olması, çocuğun akıl (akıl sağlığı yerinde) ve ergenlik çağına gelmişse bunu kabul etmesi ve çocuğun babasının bilinmemesi şarttır. Ancak bu görüş, Zem'a'nın Abd'dan başka da mirasçısı olduğu ileri sürülerek tenkit edilmiştir. Bu itiraza Zem'a'nın, Sevde hariç oğlu Abd'dan başka varisi yoktu şeklinde cevap verilmiştir. Zem'a kafir olarak ölseydi kendisine Abd'dan başkası var is olamazdı. Onun Müslüman olması takdirinde ise kendisine kızı Sevde varis olacaktı. Sevde'nin bu konuda erkek kardeşini ve kil etmiş olması veya onun da çocuğu kabul etmiş bulunması ihtimali vardır. İmam Malik ve bir grup fıkıh bilgini nesep kabul etmenin sadece babaya aitolduğu görüşünü benimsemişler ve nesep vermenin sadece Abd b. Zem'a'nın nesebinin verilmesiyle sınırlı olmadığı şeklinde cevap vermişlerdir. Çünkü Nebi Sallallahu Aleyhi ve Sellem'in buna -Zem'a'nın o kadınla ilişkiye girdiğini itiraf etmesi gibi- herhangi bir şekilde muttali olmuş bulunma ihtimali vardır. Nebi Sallallahu Aleyhi ve Sellem çocuğun dünyaya geldiği yatağın sahibine ait olduğu hükmünü vermiştir. Çünkü o \"Çocuk sana aittir\" dedikten sonra \"Çocuk kimin döşeğinde dünyaya gelmişse onundur\" buyurmuştur. Zira dinimiz bu çocuğun zina eden erkeğe verilmesini yasaklayınca, geriye yatak sahibinden başkası kalmamıştır. Bu görüşe vasinin vasiyet edenin çocuğunun nesebini -bunu kendisine vasiyet ettiği takdirde- onun adına almasının caiz olduğu hükmünü delil olarak göstermişlerdir. Bu durumda kendisine vasiyet edilen kişi, vasiyet denin bu konudaki vekili gibi olur. Eşhas bölümünde bu konuda bir başlık geçmişti. Yine bu hükümden cariyenin ilişki sebebiyle döşek olacağı hükmü çıkarılmıştır. Efendi cariyesiyle ilişkide bulunduğunu itiraf ettiğinde veya bu herhangi bir yolla sabit olduğunda cariye ilişkiden sonra çocuk doğuracak bir sürenin ardından doğum yaptığında -tıpkı nikahlı eşte olduğu gibi- çocuğun nesebinin kendine ait olduğunu kabul etmesine gerek kalmaksızın nesep kendiliğinden babaya ait olur. Fakat eş, sırf nikah akdiyle döşk haline gelir. Dolayısıyla nesebin babaya verilmesi için hamileliğin grektirdiği makul bir sürenin geçmesi hariç başka bir şart aranmaz. Çünkü eş cinsel ilişkide bulunmak için nikahlanılır. Dolayısıyla nikah akdi onunla ilişki gibi kabul edilir. Cariye ise böyle değildir. Çünkü cariye başka amaçlarla da edinilir. Onun açısından cinsel ilişki şarttır. Bundan dolayı iki kız kardeşle ilişki caiz değilken, onları cariye olarak mülkiyette bulundurmak caiz görülmüştür. Çoğunluğu oluşturan fıkıh bilginlerinin görüşü bu doğrultudadır. Hanefilerden bir görüşe göre bir cariye efendisinden çocuk doğurup, nesebi kendisine verilmedikçe doğurduğu çocuk onun yatağında doğmuş kabul edileme? Bundan sonra cariyenin doğurduğu her çocuğun nesebi, baba inkar etmedikçe kendisine aittir. Hanefilerden nakledilen bir görüşe göre bir kimse cariyesi ile ilişkide bulunduğunu itiraf etse ve cariyesi hamile kalıp doğurması mümkün olan bir süre geçtikten sonra çocuk doğursa bu çocuk o kişiye aittir. Cari ye bu kişiden önce çocuk doğursa ve sonra efendi çocuğun nesebini kabul etse Hanbelilerde tercih edilen görüşe göre daha sonraki çocuCıun nesebi yeni bir ikrar olmadıkça babaya verilmez. Birinci görüşün tercih e degr olduğu gayet açıktır. Çünkü Zem'a'nın bu cariyeden başka bir çocuğunun daha olduğu nakledilmemiştir. Bütün fıkıh bilginleri cariyenin ancak ilişkiyle yatak ortağı haline geleceği noktasında görüş birliği etmişlerdir. Hadiste geçen \"tesaveka\" fiili, Sa'd b. Ebi' Vakkas Abd b. Zem'a birlikte Hz. Nebi Sallallahu Aleyhi ve Sellem'e gittiler. Her ikisi de adeta diğerini Efendimiz'e doğru iter gibiydi. İbn Abdilberr şöyle demiştir: Hicaz bilginlerine göre cariyenin efendisi onun yanına girip çıktığını ikrar ettiğinde müstefreşe olur. Irak bilginlerine göre ise efendi cariyeden dünyaya gelen çocuğu kabul ettiğinde cariye müstefreşe haline gelir ve dOğuracağı çocuk müşterek yatakta doğmuş kabul edilir. Mazeri' şöyle demiştir: Bu hadisten erkek kardeşin kardeşi adına nesep kabul edebileceği anlaşılmaktadır. Bu, ölenin o kardeşten başka mirasçısı olmadığı takdirde geçerlidir. Zina edene mahrumiyet vardır demek, onun için kaybetme ve mahrumiyet söz konusudur demektir. Çünkü hadiste geçen \"el-aher\" zina demektir. Burada \"y haybet\" kelimesi kişinin nesebinin kendisine ait olduğunu iddia ettiği çocuktan mahrum olması anlamına gelir. Araplar bu duruma düşen kişiye \"lehu'lhacer\" ve \" fihi']-hacer ve't-turab\" veya buna benzer şeyler söylerlerdi. Bazıları hadiste geçen \"i el-hacer\" kelimesinden maksadın recm edilmek olduğunu söylemişlerdir. Nevevi' şöyle demiştir: Bu yaklaşım zayıftır. Çünkü recm muhsan olan kişilere uygulanır. Sonra bir kimsenin recmedilmesi çocuğun nesebinin ondan alınmasını gerektirmez. Burada hadis çocuğun nesebinin iddia eden kişiden alınması konusunda zikredilmiştir. Hanemer \"Bundan sonra Abdurrahman, Sevde vefat edip Allah'a kavuşuncaya kadar onu görmedi\" cümlesine dayanarak Nebi Sallallahu Aleyhi ve Sellem'in çocuğun nesebini Zem'a'ya vermediği sonucunu çıkarmışlardır. Çünkü eğer çocuğun nesebini Zem'a'ya vermiş olsaydı, çocuk Sevde'nin erkek kardeşi olacaktı. Bir kız kardeşe erkek kardeşinin karşısında tesettürde bulunması emredilmez. Çoğunluğu oluşturan fıkıh bilginleri ise Hanemerin bu yaklaşımına şöyle cevap vermişlerdir: Burada tesettür emri ihtiyattan dolayıdır. Çünkü Nebi Sallallahu Aleyhi ve Sellem -sahih rivayet yollarıyla nakledildiği üzere- \"Ey Abd! O senin kardeşindir\" diyerek onun kardeşi olduğuna hükmetmiştir. Çocuk Abd'ın baba bir kardeşi olduğuna göre Sevde'nin de baba bir kardeşi olmaktadır. Fakat Nebi Sallallahu Aleyhi ve Sellem çocukla Utbe arasındaki apaçık benzerliği görünce Sevde'ye ihtiyaten onun karşısında tesettürde bulunmasını emretmiştir. Hattabi' bu hükmün mu'minlerin annelerine ait bir özellik olduğuna işaret etmiştir. Çünkü onlar bu konuda başka kadınlar gibi değillerdir. Hattabi' şöyle demiştir: Benzerlik bazı yerlerde geçerli kabul edilir, ancak ondan daha güçlü bir emare bulunduğunda benzerliğe dayanılarak hüküm verilmez. Fıkıh bilginleri, kız alma yoluyla meydana gelen haramlık (sıhriyyet) doğurması açısından zina ilişkisinin helal yoldan yapılan ilişki hükmü doğuracağı sonucunu çıkarmışlardır. Çoğunluğun görüşü bu doğrultudadır. Rivayetin bu hükme delaleti şöyle olmaktadır: Nebi Sallallahu Aleyhi ve Sellem çocuğun Sevde'nin erkek kardeşi olduğuna hükmettikten sonra onun zina edene benzerliğinden do.layı eşine tesettürde bulunmasını emretmiştir. Kendisinden nakledilen meşhur rivayete göre İmam Malik ve Şafii şöyle demişlerdir: Zina ilişkisinin herhangi bir hukuki sonucu yoktur. Tam tersine zina eden erkek zina ettiği kadının annesiyle ve başka kocadan olan kızıyla evlenebilir. İmam Şafil bu hükme şöyle bir hüküm daha eklemiştir ki İbn Macişun da bu görüşünde kendisine katılmaktadır: Zina eden erkek, zina ettiği kadının doğurduğu kızla -kadın bu kızın o erkekten olduğunu bilse bile- evlenebilir",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 6751,
			"arabicnumber": 6751,
			"text": "Aişe r.anha şöyle demiştir: Ben Berire'yi satın aldım. Nebi Sallallahu Aleyhi ve Sellem bana \"Berfre'yi satın al. Çünkü vefa hakkı ancak azad edene aittir\" buyurdu. Berire'ye bir koyun hediye edilmişti. Nebi Sallallahu Aleyhi ve Sellem Efendimiz Sallallahu Aleyhi ve Sellem \"O koyun Berfre için sadakadır. Bizim için hediyedir\" buyurdu. el-Hakem \"Berire'nin kocası hür idi\" demiştir. elHakem'in bu sözü mürseldir. İbn Abbas ise \"Ben onu (Berire'nin kocasını) köle olarak gördüm\" demiştir",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 6752,
			"arabicnumber": 6752,
			"text": "İbn Ömer'in nakline göre Nebi Sallallahu Aleyhi ve Sellem \"Vela hakkı ancak azad edene aittir\" buyurmuştur. Fethu'l-Bari Açıklaması: İmam Buharl'nin attığı bu başlık, buluntu çocuğun mirası ile ilgilidir. İmam Buhari böylece çoğunluğu oluşturan fıkıh bilginlerinin görüşünü tercih ettiğine işaret etmektedir. Bu bilginleregöre buluntu çocuk, hürdür ve onun velası beytü'lmala aittir. İmam Buhari bir de İbrahim en-NehaI' den buluntu çocuğun velasının onu bulana ait olduğu şeklinde nakledilen görüşün tercih e değer olduğuna işaret etmektedir. O bu görüşüne Hz•. Ömer'in Ebu Cemile'ye bulduğu çocuk hakkında söylediği \"Git, o hürdür, nafakası bize aittir, velası sana aittir\" şeklindeki ifadesini delilolarak göstermektedir. Bu haber Şehadet bölümünün baş taraflarında tam olarak muallak birşekilde nakledilmişti. Orada bu yaklaşıma cevc:p vermiş ve Hz. Ömer'in \"Velası sana aittir\" şeklindeki ifadesinin manasının, onu yetiştirecek ve bakımını yapacak olan sensin. Bu aza d etme velayeti değil, İslam velayetidir, şeklinde olduğunu belirtmiştik. Bu yaklaşımın delili merfu olarak rivayet edilen \"Vela hakkı ancak azad edene aittir\" hadisinin açık ifadesidir. Bu hadis köleyi azad etmeyenin vela hakkının olmayacağını gerekli kılmaktadır. Çünkü köle azad etmek azaddan önce onun üzerinde mülkiyet olmasını gerektirir. Daru'l-İslam'da bir çocuğu bulan ona malik olamaz. Çünkü insanlarda temel kuralonların özgür olarak dünyaya geldikleridir. Zira yolun kenarına bırakılmış olan çocuğun hür bir kimsenin çocuğu olması ihtimal dışı değildir. Dolayısıyla bu çocuk çalınamaz ya da böyle bir buluntu çocuk bir topluluğun cariyesinin çocuğu olabilir. Dolayısıyla onun mirası o topluluğa aittir. Çocuğun babası bilinmediğine göre o beytü'lmale teslim edilir ve kendisini bulan kimse onun efendisi olamaz",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 6753,
			"arabicnumber": 6753,
			"text": "Abdullah b. Mes'ud şöyle demiştir: \"Müslümanlar (köleleri) başıboş, velayet hakkı olmaksızın salıvermezlerdi. Cahiliye dönemi insanları ise onları başıboş salıverir, saibe yaparlardı",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 6754,
			"arabicnumber": 6754,
			"text": "Esved'in nakline göre Aişe r.anha Berire'yi azad etmek için sahiplerinden satın almak istedi. Sahipleri de vela hakkının kendilerine ait olması şartını ileri sürdüler, Aişe r.anha \"Ya Resulallah! Ben Berıre'yi hürriye tine kavuşturmak için satın almak istedim. Sahipleri onun velasının kendilerine ait olmasını şart koşuyorlar!\" dedi. Resulullah Sallallahu Aleyhi ve Sellem \"Sen onu aza d et! VelCi hakkı ancak azad edene aittir -veya- sen bedelini ver\" buyurdu. Ravi şöyle devam eder: Bunun üzerine Aişe r.anha Berıre'yi satın alıp, azad etti. Berıre hür olunca (köle bulunan kocasıyla nikahını fesh etme veya devam. hususunda) muhayyer kılındı. O da kendi nefsini(yani nikahının feshini) tercih etti ve \"Bana şu kadar mal verilse bile artık onunla birlikte olmam\" dedi. Esved \"Berıre'nin kocası hür idi\" demiştir. Ancak Esved'in sözü munkatıdır. İbn Abbas'ın \"Ben onu bir köle olarak gördüm\" sözü daha sahihtir. Fethu'l-Bari Açıklaması: İmam Buhari'nin attığı bu başlıktan maksat efendinin \"Senin üzerinde kimsenin velası olmasın\" veya \"sen başıboş ol\" dediği köledir. Efendi bu sözüyle onu azad etmek istemekte ve kimsenin üzerinde velahakkının bulunmasını arzu etmemektedir. Efendi bazen kölesine \"Seni başıboş olarak azad ettim\" veya \"Sen başıboş olarak hürsün\" de diyebilir. İlk iki cümlede efendinin köleyi aza d etme niyeti taşıması gerekirken, son ikisinde köle kendiliğinden hür olur. Yukarıda nakledilen hadis, el-İsmaili'nin tamamını Abdurrahman b. Mehdi, Süfyan vasıtasıyla Hüzeyl' e ulaştırdığı bir isnadla rivayet ettiği hadisin başlangıç kısmıdır. Bu hadis şöyledir: Adamın biri Abdullah'a gelerek \"Ben kendime ait bir köleyi başıboş olarak azad ettim. Bu köle öldü ve geriye mal bıraktı. Hiçbir varisi de yoktur\" dedi. \"Bunun üzerine Abdullah b. Mesud dedi ki ... \" Ravi bundan sonra yukarıdaki hadisi zikretti. Ancak farklı olarak şöyle bir rivayette bulundu: \"Sen o kölenin velinimetisin. Mirası sana aittir. Eğer bu konuda günahtan kaçınmak ister veya sıkıntı duyarsan onu biz kabul eder ve beytü'l-male koyarız.\" Sa ibe hakkında Hasen-i Basri, İbn Sirin, İmam Şafii'nin görüşleri bu doğ rultudadır. Abdurrezzak'ın (Abdurrezzak, Musannef, IX, 28) sahih bir senedie İbn Sirin'den nakline göre meşhur sahabi Ebu Huzeyfe'nin mevlası Salim' i Ensardan bir kadın saibe olarak azad etmiş ve kendisine \"Dilediğin kimse ile vela anlaşmasını yap\" demişti. Bumin üzerine Salim, Ebu Huzeyfe ile ve la anlaşması yapmıştı. Salim, Yemame savaşında şehit düşünce, mirası Ensardan kendini aza d eden o kadına veya onun oğluna verildi. İbnü'l-münzir'in Bekr b. Abdullah el-Müzeni'den nakline göre İbn Ömer'e ölmüş olan azadlısının (mevla) malı getirildi. İbn Ömer \"Biz onu saibe olarak azad etmiştik\" dedi ve o malın bedeli ile köle alınıp azad edilmesini emretti.\" İbn Ömer'in bunu vücuben veya mendub olarak yapma ihtimali bulunmaktadır. Bu haberin zahirini Ata esas almış ve şöyle demiştir: \"Saibe olan köle geriye bir varis bırakmadığında onu azad eden çağrılır. Azad eden kişi onun malını kabul ederse ne ala! Aksi takdirde bu malla köle satın alınıp, azad edilir.\" Bu konuda bir başka görüş daha vardır. Buna göre saibenin velası Müslümanlara aittir ve malına onlar mirasçı olurlar, yanlışlıkla bir cinayet işlediğinde bedelini Müslümanlar öderler. Ömer b. Abdulaziz ve Zühri'nin görüşü bu doğrultudadır. İmam Malik de aynı görüştedir",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 6755,
			"arabicnumber": 6755,
			"text": "İbrahim et-Teymi'nin babasından nakline göre Ali r.a. şöyle demiştir: \"Bizim yanımızda -şu sahife hariç- okumakta olduğumuz Allah'ın kitabından başka yazılı bir kitap yoktur.\" İbrahim'in babası şöyle devam etti: Hz. Ali bundan sonra sözünü ettiği sahifeyi çıkardı. İçinde yaralamalara, diyet ve zekat develerinin yaşlarına dair birtakım hükümler yazılıydı. Bir de şunlar yazılmıştı: \"Medine'nin Air dağı ile Sevr dağı arasında bulunan sahası haremdir. Kim Medine'nin bu haremi içinde (kitap ve sünnete aykırı) bir iş yapar yahut bid'atçiyi barındırırsa Allah'ın, meleklerin ve bütün insanların laneti onun üzerine olsun! Ondan kıyamet günü hiçbir nafile ve farz kabul olunmaz. Her kim de kendi efendilerinin izni olmadan başka bir kavmi veli edinirse Allah'ın, meleklerin ve bütün insanların Ianeti onun üzerine olsun! Ondan kıyamet günü hiçbir nafile ve farz kabul olunmaz. Müslümanların emanı birdir. Onların (statü itibariyle) en aşağı olanları dahi bir harbıye eman verdiğinde o eman bütün Müslümanlarca geçerli olur. Kim bir Müslümanın verdiği ahdi bozarsa Allah'ın, meleklerin ve bütün insanların laneti onun üzerine olsun. Kıyamet günü ondan ne bir nafile, ne de bir farz kabul olunmaz",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 6756,
			"arabicnumber": 6756,
			"text": "İbn Ömer'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem vela hakkının satılmasını ve hibe edilmesini yasaklamıştır. Fethu'l-Bari Açıklaması: İmam Buharl'nin kullandığı başlık, Ahmed b. Hanbel ve Taberanl'nin, Sehl b. Muaz b. Enes vasıtasıyla babası Enes'ten naklettikleri şu hadisin ifadesidir. Buna göre Nebi s.a.v. şöyle buyurmuştur: \"Allah'ın öyle kulları vardır ki Allahu Teala onlarla konuşmaz ... \"(Ahmed b. Hanbel, III, 440; Taberani, Mu'cemu'l-kebir, XX, 195) Bu hadiste şöyle bir ifade yer almaktadır: \"Bunlardan birisi bir kavimden iyilik gördükten sonra onların iyiliğini inkar edip, kendilerinden olmadığını iddia eden kimsedir.\" Yukarıdaki başlıkta yer alan hadis, daha önce Fadailu'l-Medine ve el-Cizye bölümlerinde geçmişti. Aynı hadis Diyat bölümünde tekrar gelecektir. Hz. Ali'nin yukarıdaki naklettiği hadisle aynı manada merfu olarak Aişe r.anha'dan şöyle bir rivayet nakledilmiştir: \"Her kim efendilerinden başkalarını mevla edinirse, cehennemdeki yerine hazırlansın.\" İbn Hibban bu hadisin sahih olduğunu belirtmiştir.(İbn Hibban, Sahih, X, 170) Hz. Ali'nin sözünü ettiği sahifede yer alan hadiste dört şeyden söz edilmektedir: Bunlardan birisi yaralamalar ve zekat develerinin yaşlarıdır. Bu hadisin açıklaması Diyat bölümünde gelecektir. Orada bu develerin haraç veya zekat devesi olduğu ya da bundan daha geniş bir kapsamda ele alınacaktır. Sözkonusu sahifedeki ikinci hüküm Medine'nin harem olduğudur .. Bunun açıklaması geniş bir şekilde Hac bölümünün sonlarında Medine'nin fazileti bölümünde geçmişti. Hz. Ali'nin elindeki sayfada yer alan üçüncü hüküm \"Her kim başka bir kavmi veli edinirse\" ifadesidir. Burada konumuzia ilgili olan kısım, bu cümledir. Hadisteki \"Efendilerinin izni olmadan\" şeklindeki ifadeye gelecek olursak; hadiste en alt tabakadan bir azadiının, en üst tabakaya mensup bir başka efendinin azadlısı olduğunu iddia etmesi haramdır. Çünkü bu tavır, nimete nankörlük, vela ve akile sebebiyle doğan miras hakkını zayi etme ve bunun dışında başka sakıncalara yol açar. İbn Vehb'in nakline göre İmam Malik, Muvatta'ında bu hadisi delilolarak almıştır. Sözkonusu eserde yer alan rivayet şöyledir: İmam Malik' e velasının dilediği kişiye ait olması şartıyla kendisini efı;mdisine satan k?lenin durumu sorulunca o bunun caiz olmadığını söylemiş ve ıbn ümer hadisini bu görüşüne delilolarak göstermiştir. Sonra şöyle demiştir: Yasaklanan hibe işte budur.(Muvatta, itk ve'vela) Ata b. Ebu Rebah bu hadisin mefhum-u muhalifini almak suretiyle kaide dışı davranmıştır. Abdurrezzak'ın nakline göre İbn Cüreyc şöyle demiştir: Bir kimsenin kölesine velasını dilediği kimseye vermesine müsaade etmesi caizdir. Ata bu hükmü verdikten sonra sözkonusu hadisi delil olarak göstermiştir. İbn Battal ve bir grup fıkıh bilgini, Ata'nın dediğinin aksi görüşü savunmuş ve şöyle demişlerdir: Hz. Ali'nin rivayet ettiği hadis, \"Geçim endişesiyle çocuklarınızın canına kıymayın\"(İsra 31) ayetinde olduğu gibi genel uygulamaya uygun olarak ifade edilmiştir. Zira bilginler, ister geçim endişesiyle, ister başka bir gerekçeyle bir kimsenin çocuğunu öldürmesinin haram olduğu konusunda görşü birliği etmişlerdir. Yukarıda ifade edilen hadis, velanın satış ve bağışlanmasını yasaklayan hadisle mensuhtur. İbn Battal şöyle demiştir: Hadisten azad edilmiş bir kölenin filan oğlu filanca yazıp, adını ve kendisini azad eden efendisini yazmasının caiz olmadığı hükmü anlaşılmaktadır. Buna karşılık, filancanın mevlası filanca yazmalıdır. Fakat aza d edilen kişinin Kureyşli ve buna benzer başka bir yere mensup olduğunu yazabilir. İbn Battal şöyle devam eder. En uygunu azad edilen kişinin bunu da açıkça belirtip, ve!a itibariyle Kureyşli veya onların azadlısı gibi bir ifade kullanmasıdır. Hadisten Müslüman bile olsalar fasıklara genellikle lanet okumanın caizliği anlaşılmaktadır. Hz. Ali'nin sözünü ettiği sahifede yer alan dördüncü hüküm ise \"Müslümanların zimmetinin bir olup, statü itibariyle en düşük olan bir ferdinin eman verebileceğidir.\" İbn Battal şöyle der: Bilginler nesebi bir kimseden bir başkasına çevirmenin caiz olmadığı noktasında görüş birliği etmişlerdir. Velanın hükmü, nesebin hükmüyle aynı olduğuna ve nesep bir kişiden bir başkasına intikal edemediğine göre vela da geçemez. Cahiliye döneminde insanlar ve layı satış yoluyla veya başka bir yolla nakledebiliyorlardı. Dinimiz bunu yasaklamıştır",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 6757,
			"arabicnumber": 6757,
			"text": "İbn Ömer'in nakline göre mu'minlerin annesi Aişe r.anha azad etmek üzere bir cariye satın almak istedi. Cariyenin sahipleri \"Onu sana velası bize ait olmak şartıyla satarız\" dediler. Aişe r.anha bu teklifi Resuluilah Sallallahu Aleyhi ve Sellem'e aktarınca Nebiimiz Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Bu şart satın almana mani olmasın! Çünkü vela hakkı ancak azad edene aittir",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 6758,
			"arabicnumber": 6758,
			"text": "Aişe r.anha şöyle anlatmıştır: Ben Berire'yi satın almak istedim. Sahipleri onun velasının kendilerine ait olmasını şart koştular. Bunu Nebi Sallallahu Aleyhi ve Sellem'e açınca bana şöyle dedi: \"Onu azad et! Çünkü vela hakkı gümüş parayıveren kimseye aittir.\" Aişe r.anha şöyle devam etti: Ben onu aza d ettim. Sonra Resulullah Sallallahu Aleyhi ve Sellem Berire'yi çağırdı ve kocasının nikahında kalıp kalmamak hususunda onu muhayyer kıldı. Berire \"O bana şu kadar mal verse bile onUn yanında bir gece bile kalmam\" dedi ve ondan ayrılmayı tercih etti",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 6759,
			"arabicnumber": 6759,
			"text": "İbn Ömer şöyle demiştir: Aişe, Berire'yi satın almak istedi ve Resulullah Sallallahu Aleyhi ve Sellem'e \"Onun sahipleri velanın kendilerine ait olmasını şart koşuyorlar\" dedi. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem \"Vela hakkı ancak azad edene aittir\" buyurdu",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 6760,
			"arabicnumber": 6760,
			"text": "Aişe r.anha'nın nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"Vela hakkı, kölenin bedeli olan gümüş paraları veren ve hürriyet nimetini vermeyi üzerine alan kimseye aittir\" buyurmuştur. Fethu'l-Bari Açıklaması: İbn Battal şöyle demiştir: Bu hadis gerek erkek, gerek kadın köleyi hürriyetine kavuşturan herkesin olduğunu gerekli kılmaktadır ki bu, bilginlerin üzerinde ittifak ettikleri görüştür. Vela hakkının bir varisten diğerine geçme meselesine gelince, Ebheri şöyle demiştir: Fıkıh bilginlerinin ittifakla belirttiklerine göre kadınlar ancak köleyi hürriyetine kavuşturduklarında veya böyle bir kadının evladı olduklarında vela hakkı kazanırlar. Ancak Mesruk'un şöyle dediği rivayet edilmiştir: Vela hakkını babalarından miras olarak elde etme sadece erkeklere mahsus değildir. Tam aksine bu konuda -tıpkı mirasta olduğu gibi- erkekler ve kadınlar eşittir",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 6761,
			"arabicnumber": 6761,
			"text": "Enes b. Malik'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"Bir topluluğun azadlı kölesi, kendilerindendir\" buyurmuştur ya da buna benzer bir ifade kullanmıştır",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 6762,
			"arabicnumber": 6762,
			"text": "Enes'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Bir topluluğun kız kardeşinin oğlu da onlardandır\" ya da \"kendilerindendir.\" Fethu'l-Bari Açıklaması: \"Bir topluluğun azadlı köleSi, kendilerindendir\", bir topluiuğun hürriyetine kavuşturdu kı arı kimse kendilerinş' nispet edilir ve o topluluk sözkonusu köleye mirasçı olur demektir. \"Bir topluluğun kız kardeşinin oğlu da onlardandır.\" Yani o çocuk o topluluktan bir kişiye mensuptur ki o da çocuğun annesidir. İbn Ebu Cemre şöyle demiştir: Kız kardeş çocuğundan söz edilmesinin hikmeti, cahiliye döneminde Arapların kız kardeşin -çocukları• şöyle dursun- kızlarının çocuklarına bile iltifat etmeme şeklindeki anlayışlarını yıkmaktır. Cahiliye Araplarından şairin biri şöyle der: Oğullarımız, oğullarımızın oğulları bunlardır nesiimiz, Kızlarımızın oğulları ise değil bizim neslimiz! Şair bu ifadesiyle akrabalar arasında kaynaşmayı teşvik etmektedir. Biz de şunu ekleyelim: Azadlılar hakkındaki söze gelince, buradaki hikmet daha önce belirtildiği üzere bir kölnin efendisine evladı lafzı kullanılmaksızın nispet edileceğidir. Zira yakında babasından başkasına intisab eden kimseye yönelik tehdit ve kölenin \"nispet\" lafzıyla efendisine nispetinin caizliği gelecektir. Bu açıklamayla deliller birbiriyle uzlaşmış olmaktadır. Başarı Allahu Teala'tandır",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 6763,
			"arabicnumber": 6763,
			"text": "Ebu Hureyre r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"Her kim mal bırakırsa o mal kendi mirasçılarına aittir. Her kim de borç bırakırsa bize aittir\" buyurmuştur. Fethu'l-Bari Açıklaması: İmam Buharl'ninkullandığı bu başlık, esirin nerede ve ne durumda olduğu ister bilinsin, ister bilinmesin kendisine kalan miras hakkında yapılacak işlemle ilgilidir. İbn Battal şöyle demiştir: Çoğunluğu oluşturan fıkıh bilginleri, bir esire miras düştüğünde o payın kendisi adına bekletileceği kanaatine varmışlardır. Said b. el-Müseyyeb' in düşman elindeki esire mirastan pay verilemeyeceği kanaatinde olduğu nakledilmiştir. İbn Battal şöyle der: Çoğunluğu oluşturan fıkıh bilginlerinin görüşleri daha uygundur. Çünkü o kişi Müslümansa \"Her kim mal bırakırsa o mal kendi mirasçılarına aittir\" ifadesinin genelliğine girer. İmam Buhari, Ebu Hureyre hadisine yer vererek bu hükme işaret etmektedir. Öte yandan düşman elindeki esir Müslümandır. Dolayısıyla ona Müslümanların ahkamı uygulanır. O kişiye elde bir delilolmadıkça Müslümanların ahkamından farklı bir şey uygulanmaz. Nitekim Ömer b. Abdulaziz de buna işaret etmektedir. Esirin dinden dönmüş olması -bunu kendi isteğiyle yaptığı sabit olmadıkça- yeterli değildir. Netice olarak esir hiçbir kimsenin baskısı altında kalmaksızın kendi gönlüyle dinden döndüğü sabit olmadıkça malının elinden çıktığına hükmedilmez",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 6764,
			"arabicnumber": 6764,
			"text": "Usame b. Zeyd'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"Müslüman kafire, kafir de Müslümana mirasçı olamaz\" buyurmuştur. Fethu'l-Bari Açıklaması: İmam Buhari hadisin ifadesini başlık olarak kullanmış ve sonra da \"Kafir miras taksim olunmadan önce İslama girerse onun için miras yoktur\" demiştir. İmam Buhari bu ifadesiyle hadisin genelliğinin bu hükmü içerdiğine işaret etmiştir. Mirasın intikal etmemesini mirasın taksimiyle kayıtlayan, bunun delilini getirmek zorundadır. Çoğunluğu oluşturan fıkıh bilginlerinin delili ise şudur: Mirasın cereyan etmesi için ölümün meydana gelmiş olması gerekir. Kişinin ölüm sebebiyle mülkü kendisinden varislerine intikal ettiğine göre o mal ölünün taksimini beklemiyar demektir. Çünkü ölüden intikal eden mal, taksim edilmemiş bile olsa hak edilmiştir. İbnü'l-Müneyyir'e göre bir Müslüman ölse ve geriye -mesela- biri Müslüman, diğeri kafir iki oğlu kalsa ve malın taksim edilmesinden önce kafir olan çocuk da Müslüman olsa bu konuya örnek teşkil ederler. İbnü'l-Münzir şöyle der: Çoğunluk fıkıh bilginleri, burada yer verilen Usame hadisinin genelliğinin gösterdiği üzere o çocuğun da mirastan payalacağı kanaatine varmışlardır. Ancak Muaz'ın şöyle dediği nakledilmiştir: Müslüman, kafire mirasçı olurken, kafir Müslümana olamaz. Muaz bu görüşüne delil olarak Nebi Sallallahu Aleyhi ve Sellem'in \"İslam artar, eksilmez\" hadisini delil olarak göstermiştir. Bu hadisi Ebu Davud ve Hakim rivayet etmişler, Hakim sahih olduğunu belirtmiştir. (Ebu Davud, Feraiz; Hakim,el-Müstedrek, LV, 383) \"Müslüman kafire, kafir Müslümana mirasçı olamaz.\" Bu hadisi Nesal, Huşeym vasıtasıyla Zührl'den \"İki ayrı din'den olanlar birbirine mirasçı atamazlar\" şeklinde rivayet etmiştir. (Nesai, es-Sünenu'l-Kübra, IV, 82) Bir dine mensup kafir, bir başka dine mensup olan kafire mirasçı olamaz diyen bilginler, bu hadisi delil olarak göstermişlerdir. Çoğunluğu oluşturan fıkıh bilginleri ise \"İki ayrı dinden\" ifadesini İslam ve küfür şeklinde yorumlamışlardır. Bu takdirde hadis başlıkta nakledilen hadisin lafzıyla aynı olmuş olur. Bu, rivayeti genelliğinin zahirine yorumlamaktan daha evladır. Hadis genelliğine göre yorumlandığı takdirde mesela bir Yahudi, bir Hıristiyana mirasçı olamaz. ŞaH mezhebinde en sahih olan görüşe göre bir kafir, bir başka kafire mirasçı olur. Hanefılerin ve çoğunluğu oluşturan bilginlerin görüşü de bu doğrultudadır. Bunun karşıtı ise İmam Malik ve Ahmed b. Hanbel'in görüşüdür. Ahmed b. Hanbel'den gelen bir rivayete göre bir zimmı ile harbi arasında fark vardır. Şam mezhebinde de hüküm böyledir. İmam Ebu Hanife'den gelen bir rivayete göre bir harbi, zimmiye mirasçı olamaz. Bunların ikisi de harbi oldukları takdirde aynı ülkeye mensup olmaları şarttır. Şafiilere göre ise bunların aynı ülkeye mensup olup olmamaları arasında hiçbir fark yoktur. Şafiilere ait bir başka görüş ise Hanefiler gibidir. Sevri, Rebi'a ve bir grup bilgine göre kafirler üç çeşittir. Bunlar Yahudiler, Hıristiyanlar ve başkalarıdır. Bu üç grupta bir dinin mensubu diğer iki din mensubuna mirasçı olamaz",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 6765,
			"arabicnumber": 6765,
			"text": "Aişe r.anha şöyle demiştir: Sa'd b. Ebi Vakkas ile Utbe b. Zem'a bir oğlan çocuğu hakkında anlaşmazlığa düştüler ve Sa'd b. Ebi Vakkas \"Ya Resulallah! Kardeşimin oğlu Utbe b. Ebi Vakkas bana bu çocuğun kendi oğlu olduğunu bildirip, bu çocuğun kendi nesebine bağlanmasını vasiyet etti. Şu çocuğun ona benzeyişine bak!\" dedi. Abd b. Zem'a da \"Ya Resulallah! bu çocuk benim kardeşimdir. Babamın cariyesinden babamın yatağı üzerinde doğdu\" dedi. Resulullah Sallallahu Aleyhi ve Sellem çocuğun simasına baktı ve onda Utbe'ye açık bir benzerlik gördü. Sonra \"Ey Abd b. Zem'a! Çocuk sana aittir. Çünkü çocuk kimin yatağında dünyaya gelmişse onundur. Zina eden için de mahrumiyet vardır\" dedi. Aişe şöyle dedi: \"Artık o çocuk Sevde'yi bir daha hiç görmedi.\" Fethu'l-Bari Açıklaması: İbn Battal şöyle demiştir: İmam Buhari 27 numaralı başlığın altına herhangi bir hadis koymamıştır. Fıkıh bilginlerinin görüşü Hıristiyan köle öldüğünde malı kölelik sebebiyle efendisinindir. Çünkü kölenin herhangi bir mala sahip olması geçerli olmadığı gibi yerleşmiş bir kural da değildir. Dolayısıyla o mal efendinindir. Efendi o malı miras yoluyla hak etmiş değildir. Miras yoluyla ancak miras bırakanın istikrarlı mülkü hak edilir. İbn Sırın'in bu durumdaki kölenin malının beytü'l-inale ait olduğunu, aradaki din farkından dolayı efendinin hiçbir şey alamayacağını söylediği nakledilmiştir. Mükatebe gelince eğer o anlaşma bedelini ödemeden ölmüşse geriye bıraktığı mal, anlaşma bedelinin kalanını kapatmaya yettiği takdirde anlaşma bedeli oradan alınır. Geriye artan ise beytü'l-male kalır. Biz de şunu ekleyelim: Mükateb meselesinde bilginler arasında ihtilaf vardır. Bu ihtilaf, anlaşma bedelinin bir kısmını ödeyen kölenin ödediği miktar kadar hürriyetine kavuşur mu, yoksa üzerinde borç kaldığı sürece köle olmaya devam eder mi şeklindeki ihtilaftan kaynaklanmaktadır. !tk bölümünde bu konuyla ilgili açıklama geçmişti. İmam Buhari çocuğunun nesebini inkar edenin günahı konusunda Sa'd b. Ebi Vakkas'la, Abd b. Zem'a arasındaki anlaşmazlığın sözkonusu edildiği Hz. Aişe radıyallahu an ha hadisine yer vermiştir. Bu hadisin açıklaması \"Çocuk kimin döşeğinde dünyaya gelmişse onundur\" başlığı altında geçmişti",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 6767,
			"arabicnumber": 6767,
			"text": "",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 6768,
			"arabicnumber": 6768,
			"text": "Ebu Hureyre'nin nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"Sakın babalarınızdan yüz çevirip uzaklaşmayınız! Her kim babasından yüz çevirip onu terk ederse nankörlük etmiş olur\" buyurmuştur. Fethu'l-Bari Açıklaması: İmam Buharl'nin bu başlıktan maksadı, daha önceki başlıkta açıkça belirtildiği üzere babasından başkasının çocuğu olduğunu iddia edenin günahını vurgulamaktır. Ya da bu başlığın \"günah\" kelimesine yer verilmeksizin mutlak olarak söylenmesi, içerisinde nankörlük ve cennetin haram olması gibi kelimeler dolayısıyla tehdit bulunmasından dolayıdır. Dolayısıyla bu mana, hadisi açıklamaya çalışan kimselerin düşünce ve görüşlerine bırakılmıştır. Müslim'de, Hüşeym'in Halid el-Hazza' dan naklettiği bir rivayet şöyledir: \"Ziyad'ın nesebi kabul edilince, Ebu Bekre ile karşılaştım. Ona \"Bu yaptığınız nedir? Ben Sa'd b. Ebu Vakkas' i her kim babasından başkasının -onun kendi babası olmadığını bile bile- çocuğu olduğunu iddia ederse bu kişiye cennet haramdır\"(Müslim, İman) derken işittim. Ebu Bekre şöyle demiştir: Ben de bu hadisi Resulullah Sallallahu Aleyhi ve Sellemiden duydum. Burada adı geçen Ziyad, Ziyad b. Sümeyye'dir ki Sümeyye annesi olup, el-Haris b. Kelede'nin cariyesi idi. Haris onu azadlısı Ubeyd'le evlendirmişti. Bu cariye Ziyad'ı Ubeyd'in döşeğinde dünyaya getirdi. Onlar o vakitler Taif'te bulunuyorlardı ve Taifliler henüz Müslüman olmamışlardı. Hz. Ömer'in halifelik döneminde Ebu Süfyan b. Harb, Ömer'in yanında Ziyad'ın konuşmasını işitti. Ziyad çok belagatlı idi. Muaviye onu beğendi ve şöyle dedi: \"Ben onun annesinden dolayı durumunu biliyorum. İstesem adını söylerdim, fakat Ömer' den korkuyorum.\" Muaviye halifeliğe gelince, Ziyad Hz. Ali tarafından Fars diyarına tayin edilmiş bulunuyordu. Muaviye onunla iyi geçinmek istedi ve onda Ebu Süfyan'ın nesebini alma isteğini uyandırdı. Ziyad buna boyun eğdi ve bu konuda birtakım talihsizlikler ve terslikler meydana geldi. Sonunda Muaviye onun babasının oğlu olduğunu iddia etti ve kendisini önce Basra, sonra Kufe'ye vali tayin etti ve ona değer verdi. Ziyad meşhur yaşantısına ve siyasetine devam etti. Sahabe ve tabiundan birçok kişi Muaviye'nin bu yaptığına \"Çocuk kimin yatağında dünyaya gelmişse onundur\" hadisini delil göstererek tepki gösterdi. Biraz önce bu konuda bir şeyler söylemiştik. Ebu Osman'ın tepkisini açığa vurmak için Ebu Bekre'yi seçmesi, Ziyad'ınonun ana bir erkek kardeşi olmasından dolayıdır. Ebu Bekre'nin, Ziyad'la yaşadığı bir olay vardır ki buna daha önce Şehadat bölümünde işaret edilmişti. Bu hadis Huneyn gazvesinden söz edilirken geçmişti. \"Sakın babalarınızdan yüz çevirip uzaklaşmayınız!\" hadisindeki \"......\" cümlesi, Küşmihenl' de \".......\" şeklinde yer almaktadır. Bazı hadis şarihleri şöyle demişlerdir: Burada \"küfür\" kelimesine yer verilmesi, o kişinin Allahu Teala'a iftira atar duruma düşmesindendir. Çünkü o adeta \"Allah beni filancanın sperminden yarattı\" demiş olmaktadır. Oysa gerçek böyle değildir. Çünkü onu Allahu Teala bir başka babadan yaratmıştır. Yakında geçen \"Bir topluluğun kız kardeşinin oğlu da onlardandır\" ve \"Bir topluluğun azadlı köleSi, kendilerindendir\" hadislerinin genelliği üzere olmadığı bu hadise dayanılarak ifade edilmiştir. Zira hadisler genelliği üzere olsaydı, bir kimsenin mesela dayısının oğlu olduğunu söylemesi caiz olurdu. O iki hadis genelliği üzere olsaydı, o zaman bunu yapan kimseye yönelik şiddetli tehdit içeren başlıktaki hadisle çelişirdi. Buradan o hadisin kapsamının dar olduğu (haas) anlaşılmaktadır. Bundan maksat kız kardeş çocuğunun şefkat, iyilik, yardımlaşma ve benzeri konularda onlardan olduğudur",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 6769,
			"arabicnumber": 6769,
			"text": "Ebu Hureyre r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle demiştir: \"İki kadın ve kadınların beraberinde iki oğlan çocukları vardı. Bir kurt geldi ve bunlardan birisinin oğlunu kapıp götürdü. Bunun üzerine kadın diğer kadına \"Kurt senin çocuğunu götürdü\" dedi. Diğeri de \"Hayır, kurt senin çocuğunu götürdü\" dedi. Nihayet bu iki kadın davalarını Hz. Dauud Nebie arzettiler. O da aralarında büyük kadının lehine hükmetti. Bu iki kadın çıkıp Davud'un oğlu Süleyman Nebi Sallallahu Aleyhi ve Sellem'e gittiler ve davalarına yeniden baktırmak için meseleyi ona haber verdiler. Süleyman Nebi a.s.: \"Bana bir bıçak getirin, çocuğu iki kadın arasında yarıp paylaştırayım\" dedi. Bunun üzerine küçük kadın 'Aman öyle yapma! Allah sana merhamet etsin! Çocuk bu kadının oğludur\" deyince, Süleyman da çocuğun küçük kadına ait olduğuna hükmetti. Ebu Hureyre \"VAllahi ben o güne kadar 'sikkiyn' kelimesini asla duymamıştım. Ancak o gün işittim. Bizler sadece \"müdye\" kelimesini kullanırdık\" demiştir. Fethu'l-Bari Açıklaması: İmam Buhari, her biri bir oğlana sahip olup, bunlardan birini kurt kapınca, onun hangisi olduğu yolunda ihtilaf eden, sonra anlaşmazlıklarını Davud Nebi s.a.v.'e arz edip, ardından Süleyman Nebi s.a.v.'in hüküm verdiği bu iki kadının kıssasına yer vermiştir. Bu hadisin açıklaması Enbiya bölümünde Süleyman'ın aleyhisselam hayatı verilirken genişçe geçmişti. İbn Battal şöyle demiştir: Fıkıh bilginleri, kadının çocuğunun nesebini onu inkar eden kocasına veremeyeceği noktasında görüş birliği etmişlerdir. Kadın bu konuda herhangi bir beyyine getirebilirse bu kabul edilir. Çünkü kadın o erkeğin nikahı altındadır. Buna karşılık evli değilse ve babasının kim olduğu bilinmeyen bir çocuk için \"Bu benim oğlumdur\" deyip, bu konuda kendisiyle hiç kimse çekişmeye girmezse kadının ifadesine göre hareket edilir. Kadın o çocuğa, çocuk da ona mirasçı olur. Ayrıca o çocuğun ana bir kardeşleri de kendisine mirasçı olur. Ancak İbnü't-Tın, İbn Battal'a itiraz etmiş ve İbnü'l-Kasım'dan bir kadın buluntu çocuğun nesebinin kendine ait olduğunu iddia ettiğinde, sözünün kabuledilemeyeceğine dair bir görüş nakletmiştir. Nesai, es-Sünenü'l-Kübra'da bu hadisten çok nefis sonuçlar çıkarmış ve şöyle bir başlık atmıştır: \"Hakimin kendisi gibi veya kendisinden daha yüksek mertebede bir başkasının verdiği hükmü -durum bunu gerektirdiğinde- bozması",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 6770,
			"arabicnumber": 6770,
			"text": "Aişe r.anha şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem sevinmiş olarak ve yüz çizgileri parlar bir halde yanıma geldi ve bana şöyle dedi: \"Görmedin mi biraz önce (kaif) Mücezziz, Zeyd b. Harise ile Usame b. Zeyd'e baktı da 'muhakkak bu ayaklar birbirinden olmadır' dedi.\" :",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 6771,
			"arabicnumber": 6771,
			"text": "Aişe r.anha şöyle demiştir: Bir gün Resulullah Sallallahu Aleyhi ve Sellem sevinçli olarak adama girdi ve şöyle buyurdu: \"Ya Aişe! Görmedin mi? (kaif) Müdlic kabilesinden olan Mücezziz yanıma geldi de Usame ile oğlu Zeyd'i gördü. Onların üzerinde bir kadife vardı. Kadife ile başlarını örtmüşlerdi de ayaklan açıkta idi. Mücezziz 'şüphe yok ki bu ayaklar birbirinden olmadır' dedi.\" Fethu'l-Bari Açıklaması: \"Kaif\", benzerliği anlayan ve izleri birbirinden ayıran kimsedir. Ona kaif denmesi birtakım belirtileri ve izleri araştırmasındandır. Kelime \"el-kafi\" kelimesinden çevrilmiş gibidir. Müslim'de, Ma'mer ve İbn Cüreye'in nakillerine göre Zühri \"Müeezziz kaifti\" demişti. Müeezziz'in künyesi İbnü'l-A'ver b. Ca'de el-Müdlici olup, Müdlie b. Murre b. Abd Menaf b. Kinane'ye mensuptur. Kaifler, Kinane ve Esed oğullarına mensuptu. Araplar onların bu mesleklerini kabul ediyorlardı. Sahih olan görüşe göre kaiflik sadece onlara mahsus değildi. Hadiste geçen \"l4'{rl2;\" cümlesi, az önce veya çok kısa bir zaman önce baktı demektir. Hadisten çıkan sonuçlar: 1. Yüzü örtülü bir kadının aleyhine şahitlik etmek caizdir ve yüzünü görmeksizin onu tanımış olmak yeterlidir. 2.Bir erkek aynı örtü altında oğluyla birlikte yatabilir. 3. Şaibe olmadığı takdirde şahitliğine başvurulmadan önce bir kimsenin şahitliği kabul edilebilir. 4. Bir hakimin heva ve heves sözkonusu olmaksızın davalı veya davacı lehine gerçeğin ortaya çıkmış olmasından dolayı sevinmesi caizdir. (Bir uyan:) Bu hadisin Feraiz kitabına alınması kaifin görüşüne itibar yoktur iddiasında bulunanlara bir red içindir. Çünkü kaifin görüşüne itibar edip, gereğine göre amel eden kimse, nesep verilen çocukla, nesebine katılan baba arasında miras cereyan edeceğini kabul etmek zorundadır",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 47
			}
		}
	]
}