{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"86": "Limits and Punishments set by Allah (Hudood)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6772,
			"arabicnumber": 6772,
			"text": "Ebu Hureyre r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Zina eden kişi zina ettiği sırada mu'min olduğu halde zina edemez. İçki içen de içki içtiği sırada mu'min olarak içemez. Hırsız da hırsızlık yaptığı sırada mu'min olduğu halde hırsızlık edemez. Yağmacılık yapan kimse de insanların gözleri önünde yağmacılık ettiği zaman mu'min olarak yağmacılık ve çapulculuk edemez.\" Fethu'l-Bari Açıklaması: İmam Buhari'nin kullandığı bu başlık, zina etme ve şarap içmeden kaçın dırma anlamına gelmektedir. İbn Abbas'ın sözünü EbU Bekir b. Ebi Şeybe, Kitabu'l- iman'da Osman b. Ebu Safiyye vasıtasıyla mevsul olarak şöyle rivayet etmiştir: \"İbn Abbas kölelerine gulam, gulam diye hitap eder ve şöyle derdi: Seni evlendireyim mi? Zina eden hiçbir köle yoktur ki Allahu Teala ondan iman nurunu çekip almasın.\"(İbn Ebi Şeybe, Musannef, VI, 160) Bu hadisi Ebu Cafer et-Taberi Mücahid vasıtasıyla İbn Abbas'tan merfu olarak şöyle rivayet etmiştir: \"Ben Nebi Sallallahu Aleyhi ve Sellem Efendimizi şöyle derken işittim: 'Kim zina ederse Allah onun kalbinden imanın nurunu çekip alır. Eğer bu nuru ona geri vermek isterse geri verir. ,,, Bu hadisin Ebu Davud'da, Ebu Hureyre'den nakledilen şahidi bulunmaktadır. Yukarıdaki hadiste Nebi Sallallahu Aleyhi ve Sellem, imanın bulunmamasını zina fiilinin işlenmesi durumuyla kayıtlamıştır. Bunun gereği, kişi o fiili bitirdikten sonra imansızlık durumunun devam etmemesidir. Doğru olan da budur. Hadisin manası, imansızlık durumunun sona ermesi kişinin o fiilden tam olarak vazgeçmesi durumunda sözkonusudur şeklinde de olabilir. Buna karşılık kişi sözkonusu günahta ısrarlı olduğu halde bu fiili bıraksa onu işleyen gibi olur. Bu gibi kimseden imansızlık durumunun devam etmesi daha isabetli olur. Muharibun bölümünde geleceği üzere hadisin bazı rivayet yollarında yer alan İbn Abbas'ın \"Tövbe ederse imanı kendine döner\" şeklindeki ifade de bu görüşü desteklemektedir. Fakat Taberi'nin Nafi b. CUbeyr b. Mut'im vasıtasıyla nakline göre İbn Abbas şöyle demiştir: \"Zina eden kişi zina ettiği sırada mu'min olduğu halde zina edemez. O fiili bitirdiğinde imanı kendisine geri döner. Bu rivayette \"tövbe ettiğinde\" şeklinde bir ifade mevcut değildir, fakat o fiili işlemeye ara vermesi sözkonusudur. Bu yaklaşımı günahta ısrarlı olan kimsenin durumunu söz konusu etmektedir. Bir fiili işlemekte ısrarlı olan kimsenin günahı her ne kadar sürekli olsa bile bu günah, mesela hırsızlık fiilinde olduğu gibi onu doğrudan doğruya işleyen kimsenin ki gibi değildir. Hadiste geçen \"nühbe\" yağma edilmiş mal demektir. Bundan maksat, insanların elinden açıktan açığa ve cebren alınan mal demektir. Nebi Sallallahu Aleyhi ve Sellem \"insanların gözleri önünde\" ifadesiyle malları ellerinden alınan mağdurların durumuna işaret etmektedir. Çünkü onlar mallarını ellerinden yağma eden kimselere bakmakta ancak buna mani olamadıkları gibi yalvaramamaktadırlar. Bu ifadenin yağmanın gizlenmeden yapılmasının kinaye olarak anlatım olması da muhtemeldir. Bu durumda ifade yağmanın vazgeçilmez bir niteliği olmaktadır. Hırsızlıkla, hile ve düzenbazlıkla malı zimmetine geçirmek (ihtilas) böyle değildir. Çünkü bu fiiller gizlice yapılır. Yağmacılık ise hırsızlıktan daha beterdir. Zira bunda daha fazla bir cüret ve pervasızlık sözkonusudur. Nevevi şöyle demiştir: Bilginler bu hadisin manası üzerinde ihtilaf etmişlerdir. Araştırmacı bilginlerin ifade ettikleri isabetli ve doğru mana şudur: Bir kimse kamil bir iman halinde iken bu masiyetleri işleyemez. Burada kullanılan ifade bir şeyin olmadığını belirten ifadelerdendir. Maksat ise onun kamil manada olmadığını ifade etmektir. Bu ifadenin benzeri şudur: Fayda veren hariç hiçbir ilim yoktur, ürün verip verimli olan hariç hiçbir mal yoktur, ahiret hayatı hariç hiçbir yaşantı yoktur. Hadisi bu şekilde açıklamamız, Ebu Zerr'in rivayet ettiği şu hadisten dolayıdır. \"La ilahe illAllah diyen kimse zina etmiş ve hırsızlık yapmış bile olsa cennete gider.\" Bir diğer hadis ise meşhur ve sahih olan Ubade hadisidir. Onun nakline göre \"İnsanlar Nebi Sallallahu Aleyhi ve Sellem'e hırsızlık yapmamak ve zina etmemek üzere bey'at etmişlerdir.\" Bu hadisin sonunda \"Bu fiillerden herhangi birini işleyen kimse dünyada cezasını görür. Bu ona kefaret olur. Dünyada ceza görmeyen kimsenin durumu ise Allahu Teala'a kalmıştır. Allah dilerse onu bağışlar, dilerse azap eder\" cümlesi yer almaktadır. Bunun yanında bir de \"Allah kendisine ortak koşulmasını asla bağışlamaz; Bundan başkasını, dilediği kimse için bağışlar\"(Nisa 48) ayet-i kerimesi de vardır. Ayrıca ehl-i sünnetin büyük günah işleyen kimseler, şirk günahını işlemedikçe katir olmaz şeklinde icmaları vardır. Burada yer verdiğimiz iki hadis, ayet-i kerime ve icma bizi bu ve benzeri hadisleri yukarıdaki şekilde açıklamak zorunda bırakmaktadır. Yaptığımız, doğru ve dil açısından uygun bir açıklama olup, dilde çok başvurulan bir yöntemdir. Nevevi son olarak şöyle der: Bazı alimler hadisi \"Her kim haram olduğunu bile bile helal olduğuna inanarak zina ederse\" şeklinde açıklamışlardır. Hasan-ı Basri ve Muhammed b. Cerir et-Taberi şöyle demişlerdir: Hadisin manası o kişiden Allahu Teala'ın dostlarını isimlendirmiş olduğu övgü ismi çekilip alınır demektir. DQlayısıyla onun hakkında mu'min denemez. O kınanma ismini almaya layıktır. Bu yüzden ona hırsız, zinakar, facir ve fasık denir. İbn Abbas'ın \"Böyle bir kişiden imanın nuru çekilip alınır\" dediği nakledilmiştir. Bu konuda merfu bir hadis bulunmaktadır. Mühelleb'in \"Ondan Allah'a itaat noktasında basireti çekilip alınır\" şeklinde mana verdiği nakledilmiştir. Hadisten Çıkan Sonuçlar ı. Zina eden bir kimse ister bekar, ister muhsan, ister zina ettiği kadın yabancı, ister mahremi olsun hadiste belirtilen tehdide dahil olur. Zinanın mahrem olan kadınla yapılmasının daha iğrenç, evli kimse tarafından yapılmasının daha büyük bir günah olduğunda hiç şüphe yoktur. 2. Haram olan dokunma gibi adına zina denilen fiiller hadiste belirtilen zina kavramına dahil değildir. Aynı şekilde haram olan öpme ve bakma da böyledir. Çünkü bunlara dinimizin örfünde her ne kadar zina denilse de burada zikri . geçen zinaya dahildeğildir. Sebebine gelince; bu fiiller \"el-lemem\" kelimesinin tefsirinde daha önce geçtiği üzere küçük günahlardandır. 3. Az veya çok çalan, hadiste sözü edilen tehdide dahildir. Yağmacılık yapan da böyledir. Ancak bu konu bizce tartışılır. Aralarında bazı Şafii alimleri olmak üzere bir grup bilgin gasbın büyük günah olması için gasbedilen maun nisab miktarı olmasını şart koşmuşlardır. Hırsızlıkta da bazıları kayıtsız şartsız olduğunu söyleseler de durum böyledir. Mutlak ifade meşhur anlayışa paralel yorumlanmıştır. Sözkonusu anlayışa göre hırsızlıkta el kesmenin gerekliliği -nisap miktarından daha azı bile haram olmakla birlikte- nisap miktarının bulunmasına bağlıdır. 4.Başkasının malını haksız yere almak çok büyük bir günahtır. 5. Şarap içen kimse içtiği çok veya az olsun hadiste belirtilen tehdit kapsamına dahildir. Çünkü az miktardaki şarap büyük günahlardan sayılmıştır. Gerçi yasak edilmiş içkinin doğurduğu akıl sakatlığı, aklı bozmayan şeyleri içmekten daha ağırdır. Düğünlerde gelinin başına saçılan şeyler örneğinde olduğu gibi sahibi izin verse bile yağma tümüyle haramdır diyen bilginler bu hadisi delilolarak göstermişlerdir. Fakat Hasan-ı Basri, İbrahim en-Nehai ve Katade, İbnü'l-münzir'in kendilerinden yaptığı bir nakle göre haramlığın şartı, yağmanın \"mal sahibinin izni olmaksızın yapılmasıdır\" demişlerdir. Ebu Ubeyde bu meselede hüküm onların dedikleri gibidir demiştir. İhtilaflı olan yağma ise, hediyeleri saçan kişinin herkese eşit veya eşite yakın vermek maksadıyla izin verdiği yağmadır. Yağmacılardan güçlü olan zayıf olana galip geldiğinde ve mal sahibinin buna rızası olmadığında sözkonusu yağma mekruhtur ve bu harama kadar gider. Maliki, Şafii ve çoğunluğu oluşturan fıkıh bilginleri bunun mekruh olduğunu açıkça belirtmişlerdir. Böyle bir fiilin mekruh olduğunu belirtenler arasında sahabilerden Ebu Mesud el-Bedri, tabiundan İbrahim en-Nehai ve İkrime bulunmaktadır",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6773,
			"arabicnumber": 6773,
			"text": "Enes b. Malik r.a.'in nakline göre Nebi Sallallahu Aleyhi ve Sellem içki içme suçunda yaprakları soyulmuş hurma değneği ve ayakkabılarla dövme cezası uygulamıştır. Sonra Ebu Bekir de içki içen kimseye kırk değnek vurmuştur. Fethu'l-Bari Açıklaması: İmam Buhari'nin kullandığı bu başlık, içki içene verilecek tek cezanın ona sapa vurmak olduğu görüşünün aksine atılmıştır. Başlığın amacı, vurulacak sopanın miktarı hakkındaki ihtilafı açıklamaktır. Bundan önce \"Eşribe Bölümü\"nde içkinin haramlığı, haramlığın getirildiği vakit, ilgili ayetin nüzul sebebi ve şarabın mahiyeti, müştak (türemiş) olup olmadığı ve müzekker bir kelime yapmanın caiz olup olmadığı konuları ele alınmıştı. Yukarıda yer verilen hadisi Müslim ve Nesai de Muhammed b. Cafer vasıtasıyla Şu'be'den yukarıdaki rivayete benzer şekilde nakletmişlerdir. Ancak Şu'be'nin rivayetinde şöyle bir farklılık vardır: \"Bunu Hz. Ebu Bekir de uygulamıştır. Hz. Ömer hilafete geldiğinde insanların görüşüne başvurmuş ve Abdurrahman b. Avf \"Şer'ı cezaların en hafifi seksen değnektir\" deyince, Hz. Ömer bunun vurulmasını emretmiştir",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6774,
			"arabicnumber": 6774,
			"text": "Ukbe b. Haris şöyle demiştir: \"en-Nuayman veya en-Nuayman'ın oğlu içki içmiş olarak getirildi. Nebi Sallallahu Aleyhi ve Sellem O anda orada bulunan kimselere onu dövmelerini emretti. Ukbe şöyle devam etti: Bu emir üzerine ona vurdular. Ben de ona ayakkabılarla vuranların içindeydim.\" Fethu'l-Bari Açıklaması: İmam Buharl'nin kullandığı başlık, içki içme cezasının gizlice vurulamayacağını söyleyen görüşün aksidir. Ebu Şahme'nin oğlunun olayı hakkında Hz. Ömer'den daha önce bir nakil geçmişti. Ebu Şahme'nin oğlu Mısır'da içki içince Amr b. eı-As ona evde içki içme cezası uyguladı. Hz. Ömer ise Amr'ın bu fiiline tepki gösterdi ve o kişiyi Medine'ye getirterek sözkonusu cezayı açıktan uyguladı. Bu haberi İbn Sa'd rivayet etmiştir. ez-ZUbeyr ise buna işaret etmiştir. Sözkonusu haberi Abdurrezzak sahih bir isnadla uzun bir şekilde İbn Öiner' den rivayet etmiştir. Bilginlerin çoğunluğu ise evde verilen ceza ile yetinileceğini söylemişler ve Hz. Ömer'in uygulamasını, içki içme cezası ancak açıktan vurulursa sahih olur şeklinde değil de Ebu Şahme'nin oğlunu tedib etme konusunda mubalağada bulunma şeklinde yorumlamışlardır. Yukarıdaki hadiste geçen \"şariben=içmiş olarak\" Vüheyb'in rivayetinde \"sekran = sarhoş olarak\" şeklinde yer almaktadır. Bazı bilginler içki içme cezasının kişiye sarhoşken uygulanabileceğinin caizliğini bu hadisten çıkarmışlardır. Bazı zahiri alimlerinin kanaati bu doğrultudadır. Çoğunluğu oluşturan fıkıh bilginleri ise bunun aksi görüştedirler. Onlar sözkonusu hadisi, \"Bundan maksat vurmanın sebebini belirtmektir. Bu nitelik (içmiş olmak) o kişiye ceza uygulanırken de mevcuttur\" şeklinde yorumlamışlardır. Bilginler bunu ayrıca şöyle bir akıl yürütme ile de teyit etmişlerdir. Şer', cezayı uygularken suçluya vurmaktan maksat, caydırıcılığı sağlamak için ona bir parça acı vermektir. Hadisten çıkan sonuçlar: 1. İçki içmek haramdır. 2. İçki içen kimseye ister çok, ister az içsin, ister sarhoş olsun, isterse olmasın ceza uygulamak gereklidir",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6775,
			"arabicnumber": 6775,
			"text": "Ukbe b. el-Haris şöyle anlatmıştır: Nuayman veya onun oğlu Nebi Sallallahu Aleyhi ve Sellem'e sarhoş olarak getirildi. Bu kendisine ağır geldi ve evde bulunan kimselere ona vurmalarını emretti. Oradakiler kendisini hurma değnekleri ve ayakkabılarla dövdüler. Ben de ona vuranlar arasında idim",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6776,
			"arabicnumber": 6776,
			"text": "Enes b. Malik \"Nebi Sallallahu Aleyhi ve Sellem şarap içmede hurma dalları ve ayakkabılarla dövme cezası uyguladı. Ebu Bekir de kırk değnek vurdu\" demiştir",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6777,
			"arabicnumber": 6777,
			"text": "Ebu Hureyre'nin nakline göre Nebi Sallallahu Aleyhi ve Sellem'e içki içmiş olan bir adam getirildi. Resulullah Sallallahu Aleyhi ve Sellem \"Bunu dövünüz!\" buyurdu. Ebu Hureyre şöyle devam etti: Artık aramızda eliyle, ayakkabısıyla vuran ve ihramı ile vuran kimseler vardı. Vurma işi bitince topluluktan bazı kimseler \"Allah seni rezil rüsvay etsin\" dediler. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem : \"(Hayır) böyle söylemeyiniz! Bu adam'ın aleyhine şeytan'a yardım etmeyiniz\" buyurdu",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6778,
			"arabicnumber": 6778,
			"text": "Ali r.a. şöyle demiştir: \"Herhangi bir kimseye had cezası uygulayıp da onun ölmesi ile üzüntü duymazdım. Ancak böyle bir üzüntüyü içki içen kimse hakkında duyardım. İçki içen kimse had cezasından dolayı ölseydi, muhakkak onun diyetini verirdim. Bunun sebebi şudur: Nebi Sallallahu Aleyhi ve Sellem, içki içenin cezası hakkında bize sabit bir sayı ile vurarak had uygulamamız konusunda kesin bir hüküm bildirmemiştir",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6779,
			"arabicnumber": 6779,
			"text": "Saib b. Yezid şöyle demiştir: Nebi Sallallahu Aleyhi ve Sellem'in zamanında, Ebu Bekir'in halifeliğinde ve Ömer'in halifeliğinin ilk zamanlarında bize şarap içmiş olan sarhoş bir kişi getirildi de ona doğru kalkıp ellerimizle, ayakkabılarımızla ve ridalarımızla vurduk. Hz. Ömer, halifeliğinin son yıllarında o sarhoşa kırk değnek vurdu. Nihayet insanlar içki içmek ve fesad çıkarmakta ileri gittiklerinde Ömer içki içenlere seksen değnek vurdu. Fethu'l-Bari Açıklaması: İmam Buhari, attığı bu başlıkla değnekle vurmanın şart olmadığına işaret etmiştir. Bu konuda bilginler üç görüşe ayrılmışlardır. Bunlar Şafi mezhebinde tercihe değer üç görüştür. Bunların içinde en sahih olanı içki içen kimseye kamçıyla vurmanın caiz olduğudur. Ellerle, ayakkabılarla ve elbiselerle vurmakla yetinmek caizdir. İkinci yaklaşıma göre tek çıkar yol sopayla vurmaktır. Üçüncüsüne göre ise tek seçenek vurmaktır. Tercihe değer olan görüşün yaklaşımı şudur: Bu Nebi Sallallahu Aleyhi ve Sellem'in zamanında uygulanmıştır. Nesh edildiği sabit değildir. Sapa vurma ise sahabe döneminde uygulanmıştır. Dolayısıyla bu uygulama sopanın caiz olduğunu gösterir. Diğer görüşün delili ise İmam Şafii'nin elÜmm' deki şu ifadesidir: İçki içene kamçıyla ceza uygulansaydı öldüğü takdirde diyetin i vermek gerekirdi. Buna göre İmam Şafii sopayla vurmayla, ondan daha ağırını vurmayı eşit görmüştür. Bu da bize vurmada asıl aracın kamçıdan başka bir şeyolduğunu göstermektedir. Ebü't-Tayyib ve ona tabi olan bilginler içki içme suçunda kamçıyla vurmanın caiz olmadığını açıkça belirtmişlerdir. Kadı Hüseyin ise kamçıyla vurmanın gerekli olduğunu belirtmiş ve bu konuda sahabenin icmaını delil olarak göstermiştir. Kadı Hüseyin nasstan kendi görüşüne uygun ifadeler nakletmiştir. Fakat sahabe iemaını delil olarak gösterme, bizce tartışılır. İmam Nevevi, Müslim şerhinde şöyle demiştir: Bilginler hurma dalı, ayakkabı ve elbiselerin ucuyla vurmakla yetinileceği noktasında görüş birliği etmişlerdir. Nevevi' şöyle devam etmiştir: En sahih olanı, kamçıyla vurmanın caizliğidir. Bunun şart olduğunu söyleyen bilgin ise bilginlerin genelinden ayrı düşmüştür. Bu hatadır ve sahih hadislerle reddedilmiştir. Bizim kanaatimize gelince, bazı müteahhirun bilginleri orta bir yol bulmuşlar ve kamçıyı içki içmekte inat edenlere, elbiselerin ucuyla ve ayakkabıyla vurmayı zayıflara özel kabul ederken, bunların dışındakiler için ise durumlarına uygun hareket edilmesi gerektiğini ifade etmişlerdir. Bu görüş de isabetlidir. \"(Hayır) böyle söylemeyiniz! Bu adamın aleyhine şeytana yardım etmeyiniz!\" Onların böyle davranarak şeytana yardım etmeleri şu nedenledir: Şeytan, o kişiye günahı süslü göstermek suretiyle onun rezil ve rusvay olmasını istemektedir. Müslümanlar ona rezil ve rüsvay olması için beddua ettikleri takdirde sanki şeytanın hedefini gerçekleştirmiş olmaktadırlar. Bu hadisten Allah'a isyan eden kimseye -lanet okuma örneğinde olduğu gibi- Allah'ın rahmetinden uzaklaşması bedduasında bulunmanın yasaklı ğı anlaşılmaktadır. \"Fe yemlite fe ecide\", \"ecide\" kelimesinin çeşitli manaları vardır. Bunlardan buraya en uygun olanı üzüntü duymaktır. \"İçki içen kimse uygulanan had sonunda dolayı ölseydi, onun diyetini verirdim. \" Yani onun diyetini, bunu almaya hak sahibi olanlara verirdim demektir. \"Lem yesunne\" yani Resulullah Sallallahu Aleyhi ve Sellem bu konuda bize sabit bir adet kanunlaştırmamıştır. (Kısaca Nebi Sallallahu Aleyhi ve Sellem, içki içenin cezası hakkında bize, sabit bir sayı ile sarhoşa vurarak had uygulamamız konusunda kesin bir hüküm bildirmemiştir.) (Önemli bilgi:) Fıkıh bilginleri içki içme cezası hariç şer'i' cezalar uygulanırken aldığı darbelerden dolayı ölen kimsenin katilinin herhangi bir tazminat ödemekle yükümlü olmayacağı konusunda ittifak etmişlerdir. Hz. AIi'den az önce belirttiğimiz şekilde bir görüş nakledilmiştir. İmam Şafil şöyle demiştir: Kamçı dışında bir şeyle vurmak durumunda herhangi bir tazminat gerekmez. Ancak kamçıyla vurduğu takdirde bazı bilginlere göre diyet öderken, bazılarına göre kamçıyla vurmayla başka bir nesneyle vurma arasındaki farkı öder. Bu konudaki diyet, devlet başkanının akilesine aittir. Suçlu kırk sopadan daha fazla vurulduğu takdirde öldüğünde de hüküm böyledir. \"Ona doğru kalkar, ellerimizle, ayakkabılarımzia ve ridalarımızla vururduk.\" Yani bu sayılan şeylerle ona vururduk demektir. \"Hz. Ömer'in halifeliğinin son yıllarında o sarhoşa kırk değnek vurdu.\" Bu ifadenin zahirinden anlaşılan kırk sopa belirlenmesi, Hz. Ömer'in halifeliğinin son yıllarında olmuştur. Oysa gerçek böyle değildir. Çünkü Halid b. Velid kıssası ile onun Hz. Ömer' e yazı yazması olayı bize Hz. Ömer'in içki içene seksen sapa vurulması emrini halifeliğinin ortalarında verdiğini göstermektedir. Zira Halid b. Velid, Hz. Ömer'in halifeliğinin ortalarına doğru vefat etmiştir. \"lyLJ\" yani Allah'a itaatin dışına çıktılar. \"Seksen sapa vurdu.\" İmam Malik'in Muvatta'ında Sevr b. Yezid'den nakline göre Hz. Ömer içki içme cezası konusunda sahabelerle danıştı. Hz. Ali ona \"Bizim görüşümüze göre bu cezayı seksen sopa olarak belirlemelisin. Zira içki içen kimse sarhoş olur. Sarhoş olan kimse abuk sabuk konuşur. Böyle konuştuğunda da iftira eder\" dedi. (Muvatta, Eşribe) Bunun üzerine Hz. Ömer içki içme cezasını seksen sapa olarak belirledi. Bu rivayet mu'daldır. Nesai ve Tahavı aynı rivayeti Yahya b. Fuleyh, Sevr, İkrime ve İbn Abbas isnadıyla daha uzun bir olarak nakletmişlerdir. Bu rivayet şöyledir: \"İçki içenlere Nebi Sallallahu Aleyhi ve Sellem'in döneminde el, ayakkabı ve sopa ile usanıncaya kadar vuruluyordu. Hz. Ebu Bekir'in halifeliğinde içki içenler daha da çoğaldılar. Ebu Bekir, 'Onlar için bir ceza belirlesek'dedi ve Nebi Sallallahu Aleyhi ve Sellem'in döneminde yapılan uygulamayı benimsedi ve içki içenlere kırk sopa vuruldu. Bu uygulama Hz. Ebu Bekir vefat edinceye kadar sürdü. Sonra Hz. Ömer'in dönemi geldi. O da aynı şekilde içki içenleri dövdürdü. Nihayet bir gün içki içmiş bir adam getirildi. \"(Nesai, Sünenu'l-Kübra, III, 252) İbn Abbas bu hadisin devamında sarhoş olarak yakalanan kimsenin hikayesine yer vermekte ve \"İman eden ve iyi işler yapanlara ... (haram kılınmadan önce) tattıklarından dolayı günah yoktur\"(Maide 93) ayetini kendi lehine delil olarak gösterdiğini, İbn Abbas'ın bu konuda onunla tartıştığını ve ayetin kalan kısmı olan \"hakkıyla sakındıkları\" ifadesini delil olarak gösterdiğini ve Allahu Teala'ın haram kıldığı bir şeyi işleyen kimsenin takva sahibi olamayacağını söylediğini ifade etmektedir. Bunun üzerine Hz. Ömer \"Görüşünüz nedir?\" diye sorunca, Hz. Ali söz almış ve yukarıdaki yaklaşımını ifade etmiştir. O görüşünün sonunda \"Abuk sabuk konuştuğunda iftira atar, iftira atana ise seksen sopa vurulur\" deyince, Hz. Ömer bunu emretmiş ve içki içene seksen sopa vurulmaya başlanmıştır. Hz. Ömer'in içki içene seksen sapa vurma uygulaması içki içme cezasının seksen olduğuna delil gösterilmiştir. Uç mezhep imamının görüşü bu doğrultudadır. Bu görüş İmam Şafii'nin iki görüşünden biridir. İbnü'l-Münzir de bunu tercih etmiştir. İmam Şafil'nin sahih olan diğer görüşü ise içki içme cezasının kırk sopa olduğu yolundadır. Burada bir hususu belirtelim: Ahmed b. Hanbel'den de yukarıda zikredilen iki görüş doğrultusunda görüş naklediimiştir. Kadı lyaz şöyle demiştir: Fıkıh bilginleri içki içme de ceza verileceği noktasında görüş birliği etmişler, ancak bunun miktarı konusunda ihtilaf etmişlerdir. Çoğunluk, içki içme cezasının seksen sopa olduğu görüşünü benimsemiştir. Kendisinden meşhur olarak nakledilen bir rivayette İmam Şafiı, bir rivayete göre Ahmed b. Hanbel, Ebu Sevr ve Davud içki içme cezasının kırk sopa olduğunu söylemişlerdir. İcmanın nakli konusunda İbn Dakik el-lyd, Nevevi ve onların paralelinde düşünen fıkıh bilginleri Kadı lyaz'a tabi olmuşlardır. Taberi, İbnü'l-Münzir ve başka bilginlerin bir grup bilginden naklettikleri görüş nedeniyle icma görüşü tenkit edilmiştir. Buna göre içki içmede herhangi bir had (şer'ı ceza) yoktur. Ancak tazir vardır. Bu bilginler yukarıda zikredilen hadisleri delil olarak göstermişlerdir. Çünkü bu hadisler içki içme konusunda belli bir sayıdan söz etmemektedir. Sözkonusu hadislerin en açık olanı Enes hadisidir ve bu hadis herhangi bir sayıdan söz etmemektedir. İçki içme cezası Enes'ten gelen hadis yollarının tercihe en değer olanına göre kırktır. Abdurrezzak'ın Musannef'inde şöyle bir rivayet yer almaktadır: İbn Cüreyc ve Ma'mer'in nakline göre İbn Şihab'a \"Resulullah Sallallahu Aleyhi ve Sellem içki içme suçunda kaç sopa uyguladı? diye sorulmuş, o da \"Nebi Sallallahu Aleyhi ve Sellem bu konuda herhangi bir sınır belirlemedi. Yanında bulunanlara içki içen kimseye elleriyle ve ayakkabılarıyla vurmalarını emrediyordu ve sonunda da onlara 'tamam yeter' diyordu\"(Abdurrezzak, Musannef, VII, 377) Nebi Sallallahu Aleyhi ve Sellem'in içki içene hiç vurmadığı şeklinde bir rivayet de vardır. Bu rivayet Ebu Davud ve Nesal'de güçlü bir senedie şu şekilde yer almaktadır: İbn Abbas'ın nakline göre Resulullah Sallallahu Aleyhi ve Sellem içki içme suçunda herhangi bir sınır belirlemedi. İbn Abbas şöyle devam etmiştir: Adamın biri içki içti ve sarhoş oldu. Yakalanıp, Nebi s.a.v.'e getirilmek üzere yola çıkıldı. Adam Abbas'ın evinin hizasına gelince, onların elinden kurtuldu ve Abbas'ın evine girdi ve oraya sığındı. Bu durum Nebi Sallallahu Aleyhi ve Sellem' e arzedilince Efendimiz sallalliihu aleyhi ve selleın güldü ve o adam hakkında herhangi bir şeyi emretmedi.(Ebu Davud, Hudud; Nesai, Sünenu'l-kübra, III, 254) Taberl'nin bir başka yolla İbn Abbas'tan nakline göre Nebi Sallallahu Aleyhi ve Sellem içki içmeye ancak son zamanlarda vurma cezası uyguladı. Resulullah Sallallahu Aleyhi ve Sellem Tebuk gazvesine çıkmıştı. Geceleyin odasına bir sarhoş getirildi. Resulullah Sallallahu Aleyhi ve Sellem \"Bu adamın koluna birisi girsin, elinden tutup onu evine götürsün\" buyurdu. Bu rivayetıere verilecek cevap şudur: Bundan sonra içki içmeye had cezası uygulanacağı noktasında icma oluşmuştur. Çünkü Hz. Ebu Bekir, Nebi Sallallahu Aleyhi ve Sellem'in sarhoşa uyguladığı vurmayı araştırmış ve onu şer'ı cezc.\\ olarak belirlemiştir ve bu uygulamaya devam etmiştir. Kendisinden sonra gelenler de -sayısında ihtilaf etmiş olsalar bile- bu uygulamaya devam ettiler. Kurtubi bu haberleri şu şekilde yorumlayarak cem ve telif etmiştir: İlk başlarda içki içme konusunda herhangi bir şer'ı ceza yoktu. İbn Abbas'ın, Abbas'a sığınan kişi hakkındaki hadisi bu manada yorumlanır. Sonra içki içme cezası konusunda herhangi bir miktar belirtmeyen diğer hadislerde yer aldığı üzere tazir cezasına başlandı. Bunun ardından içki içmenin şer'i cezası (had) uygulandı. Sahabilerin ekserisi içki içmenin muayyen bir cezası olduğuna inandıkları halde açık ve net olarak bunun belirlendiğine muttali olmadılar. Buradan hareketle Hz. Ebu Bekir, Resulullah Sallallahu Aleyhi ve Sellem'in huzurunda yapılan uygulamayı esas aldı ve uygulama bu doğrultuda yerleşti. Sonra Hz. Ömer ve onun görüşüne katılanlar kırk sapanın arttırılması kanaatine vardılar. Bu ya hüküm çıkarma yoluyla şer'i ceza olarak ya da tazir cezası olarak arttırıldı. Burada bir hususa daha değinmek gerekir: Geriye hadiste bir kimse içki içtiğinde üç kez had cezası uygulanır. Dördüncü kez içtiğinde öldürülür, bir rivayete göre ise beşinci kez içtiğinde öldürülür şeklindeki hüküm kalmaktadır. Bu, Sünen'lerde isnadları güçlü olan birçok yoldan rivayet edilmiş olan bir hadistir. Tirmizi, içki içen kimseye öldürme cezasının uygulanmayacağı şeklinde bir icma nakletmiştir. içki içenin öldürüleceğinden söz eden haber, -Ahmed b. Hanbel, Hasan-ı Basri ve bazı zahiri müçtehidlerinin rivayet ettikleri üzere- Abdullah b. Amr gibi başkasının ondan buna dair sözünü nakletmesinden uzak olan kimsenin naklidir şeklinde yorumlanmıştır. Nevevi bu konuda daha da ileri gitmiş ve şöyle demiştir: Bu görüş batııdır ve sahabi ve ondan sonra gelenlerin iemaına muhalifiir. Bu konuda varid olan hadis mensuhtur. Hadis ya \"Üç sebepten biri olmadıkça bir Müslümanın kanı helalolmaz. \" hadisiyle ya da onun nesh edildiğine dair icma ile nesh edilmiştir. Bizce nesih delili açıkça nasslarda vardır. Bu Ebu Davud'un, Zühri vasıtasıyla Kubaysa'dan bu konuda naklettiği şu haberdir: içki içmiş birisi getirildi ve ResuluIlah Sallallahu Aleyhi ve Sellem ona sapa cezası uyguladı. Sonra aynı kişi içmiş olarak yine getirildi yine sapa cezası uyguladı. Ardından bir kez daha getirildi, yine sapa cezası uygulandı. Sonra bir kez daha getirildi, yine sapa cezası uygulandı. Böylece öldürme hükmü kaldırılmış oldu. Öldürme cezası bir ruhsattı.\"(Ebu Davud, HudCld) içki içme cezasının sabit olduğu ve bu konuda öldürme cezası bulunmadığı yolundaki icma yerleşik bir kuralalarak kalmıştır. Kırk ve seksen sapa şeklindeki ihtilaf ise sürüp gitmiştir. Bu, Müslüman ve hür olan bir kimseye mahsustur. Zimmiye gelince, ona had cezası uygulanmaz. Ahmed b. Hanbel'den zimmiye de had uygulanacağına dair bir rivayet vardır. Yine ondan gelen bir başka rivayete göre sarhoş olduğu takdirde bu ceza uygulanır. Hanbelilerde sahih olan görüş çoğunluğun görüşü gibidir",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6780,
			"arabicnumber": 6780,
			"text": "Ömer r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem'in zamanında Abdullah isminde bir adam vardı. İnsanlar tarafından \"himar\" (eşek) lakabı ile lakaplandırılmıştı. Bu kişi Resulullah Sallallahu Aleyhi ve Sellem'i arasıra güldürürdü. Nebi Sallallahu Aleyhi ve Sellem ona içki içtiği için sapa vurma cezası uygulamışt!. Bir gün bu şahıs yine Resulullah Sallallahu Aleyhi ve Sellem'in huzuruna getirildi. Nebi Sallallahu Aleyhi ve Sellem ona sapa cezası uygulanmasını emretti. Bunun üzerine değnekle dövüldü. Topluluktan birisi \"Ya Rabbi şu adam'a lanet et, içki yüzünden ne kadar da çok huzura getiriliyor!\" dedi. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem \"Ona lanet okumayınız! VAllahi kesin olarak bilmişimdir ki bu zat Allah'ı ve Resulünü sevmektedir\" buyurdu",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6781,
			"arabicnumber": 6781,
			"text": "Ebu Hureyre r.a. şöyle demiştir: Nebi Sallallahu Aleyhi ve Sellem'e sarhoş bir adam getirildi. Nebi Sallallahu Aleyhi ve Sellem Efendimiz onun dövülmesini emretti. Artık bizden kimimiz ona eliyle vuruyor, kimimiz ayakkabısıyla, kimimiz de elbisesiyle vuruyordu. Dövme işi bitince içimizden bir adam \"Buna ne oluyor! Allah bunu rezil ve rüsvay etsin!\" dedi. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem \"Kardeşinizin aleyhinde şeytanın yardımcıları olmayınız\" buyurdu. Fethu'l-Bari Açıklaması: imam Buhari, içki içene lanet etmeyi yasaklayan hadisle, en başta \"İçki içen içki içtiği sırada mu'min olarak içemez\" hükmünün birbiriyle nasıl cem ve telif edileceğine işaret etmektedir. Onun anlayışına göre maksat, içki içen kişinin tam olarak imandan çıktığı değil, kamil bir imana sahip olmadığıdır. imam Buhari burada \"mekruhluk\"la laneti hak etmiş kimse hakkındaki lanet yasaklığının tenzihi olduğuna işaret etmektedir. Ancak bunun için lanet okuyan kimsenin onun gerçek manası olan Allah'ın rahmetinden uzak kılınması değil, sadece ona ağır bir söz kullanma manası kastedilmelidir. Buna karşılık bir kimse lanet okuduğu şahsın Allah'ın rahmetinden uzak olmasını kastederse bu haram olur. Özellikle laneti hak etmeyen kimse hakkında söylenmişse hüküm böyledir. Allah'ı ve Resulünü seven ve özellikle de had cezası kendisine uygulanan kimseye lanet okumak böyledir. Bu gibi kimseye tövbe etmesi ve Allah' ın affına ermesi için dua etmek mendubtur. Bu ayrıntılı sebepten dolayı imam Buhari başlıkta \"içki içene lanet okumanın mekruhluğu\" yerine \"içki içene lanet okumanın mekruh olanı\" demiştir. Buhari bununla sözkonusu ayrıntıya işaret etmiştir. Bu açıklamaya göre muayyen bir fasığa mutlak olarak lanet okunmayacağına bir delil yoktur. Bazıları şöyle demişlerdir: Yasaklık, Nebi Sallallahu Aleyhi ve Sellem'in huzurunda vaki olana mahsustur. Çünkü lanet okumaya tepki gösterilmediği takdirde içki içen kimse kendisinin buna layık olduğu vehmine kapılabilir. Belki de şeytan onun kalbine kendisini fitneye düşürebileceği bir kanaat verebilir. Ebu Hureyre hadisinde yer alan \"Kardeşinizin aleyhinde şeytanın yardımcıları olmayınız\" şeklindeki ifade ile bu noktaya işaret edilmektedir. Bazı bilginlere göre içki içme cezası uygulanmış olan kimselere mutlak olarak lanet okunamaz. Çünkü ceza onun sözkonusu günahına kefaret olmuştur. Bazıları ise hata eden kimse hakkında mutlak olarak lanet okunamaz demişlerdir. Mutlak caizlik, suçu açıktan açığa işleyenler hakkındadır. ibnü'l-Müneyyir, mutlak lanet okuma yasaklığının muayyen kimse hakkında, caizliğin muayyen olmayan kimse hakkında olduğunu doğrulamış ve şöyle demiştir: Çünkü muayyen olmayan kimse hakkında okunacak lanet, bu fiilin yapılmasını engeller. Muayyen kişi hakkındaki lanet ise ona eziyet verir ve kendisine kötü söz söyleme anlamı taşır. Oysa Müslümana eziyet vermek yasaklanmıştır. Muayyen bir kimseye lanet okumaya cevaz veren bilginler delilolarak şöyle demişlerdir: Resulullah Sallallahu Aleyhi ve Sellem laneti hak edene lanet okumuştur. Dolayısıyla bu konuda muayyen olanla olmayan arasında herhangi bir fark yoktur. Bu görüş söz konusu kimse lanete gayr-i muayyenlik vasfıyla layık olmuştur denilerek tenkide uğramıştır. Şayet had cezası uygulanmadan önce o kişiye lanet okumak caiz olsaydı, ceza uygulandıktan sonra bu devam ederdi. Tıpkı sopa cezası yanında sürgüne göndermenin sakıt olmadığı gibi. Öte yandan muayyen olmayan kimsenin bu lanetten alacağı pay, son derece küçük ve hafiftir. Doğruyu en iyi Allahu Teala bilir. Nevevi, el-Ezkar isimli eserinde şöyle demiştir: Herhangi bir günahı işlemekle nitelenmiş muayyen bir insana beddua etmeye gelince, hadisin zahiri bunun haram olmadığını göstermektedir. Nevevi'nin de ifade ettiği üzere hadisler bunun caiz olduğunu göstermektedir. Nebi Sallallahu Aleyhi ve Sellem birisine \"Sağ elinle ye\" buyurmuş, o kişi \"bunu yapamıyorum\" deyince, Resulullah Sallallahu Aleyhi ve Sellem \"Yapamayasın!\" demiştir. Bu hadis, şer't hükme muhalif olan kimseye beddua etmenin caiz olduğunu göstermektedir.(Müslim, Eşribe) \"Bu kişi Resulullah Sallallahu Aleyhi ve Sellem'ı ara sıra güldürürdü\" Yani söz konusu şahıs, Nebi Sallallahu Aleyhi ve Sellem'in huzurunda bir şeyler söyler ya da onu güldürecek birtakım hareketlerde bulunurdu. Ebu Ya']a'nın Hişam b. Sa'd vasıtasıyla Zeyd b. Eslem'den yukarıdaki isnadla nakline göre adamın biri \"himar= eşek\" lakabı ile lakaplandırılmıştı. Bu kişi Nebi Sallallahu Aleyhi ve Sellem' e bir tulum yağ ve bal hediye etti. Arkadaşı gelip, kendisinden alacağını isteyince onu Nebi Sallallahu Aleyhi ve Sellem' e getirdi ve \"Buna malını ver\" dedi. Resulullah Sallallahu Aleyhi ve Sellem gülümsemekten başka bir şey yapmadı ve isteği üzerine tulum, sahibine geri verildi. \"(Ebu Ya'la, Müsned, I, 161) Hadisten Çıkan Sonuçlar 1. insanlara lakap takmak caizdir. 2. Hadis büyük günah işleyen kimsenin kafir olacağını iddia edenlere cevap teşkil etmektedir. Zira hadiste büyük günah işleyen kimselere lanet okumanın yasaklı ğı ve onlara dua edilmesi emri yer almaktadır. Hadisten anlaşıldığına göre yasak bir fiili işleme ile Allah ve Nebi Sallallahu Aleyhi ve Sellem sevgisinin o kimsenin kalbinde bulunması arasında herhangi bir çelişki yoktur. Çünkü Resulullah Sallallahu Aleyhi ve Sellem O kişinin sözkonusu yasaklığı işlemiş olmasına rağmen Allah'ı ve Resulullah Sallallahu Aleyhi ve Sellem' ı sevdiğini haber vermektedir. 3. Resulullah s.a.v. bir de günahı tekrar tekrar işleyen kimsenin kalbinden Allah ve Resulullah s.a.v. sevgisinin çekilip alınmayacağını bildirmektedir. 4. İçki içen kimsenin o anda imana sahip olmayacağı yolundaki haberden maksat, imanın tamamıyla kalbinden gittiği değil, tam aksine -daha önce işaret edildiği üzere- imanının kamil bir iman olmadığıdır. Allah' a isyan eden bir kalpte Allah ve Nebi Sallallahu Aleyhi ve Sellem sevgisinin var olmaya devam etmesi, sözkonusu kişinin işlediği günahtan pişman olması, kendisine ceza uygulanıp, bunun o günaha kefaret olması ile kayıtlı bulunması ihtimali vardır. İşlediği günaha pişman olmayıp, ceza da görmeyen kimse böyle değildir. Çünkü onun tekrar günah işlemek suretiyle kalbine bir şey gelmesinden ve imanını çekip almasından korkulur. Allahu Teala'tan bağış ve afiyet dileriz",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6782,
			"arabicnumber": 6782,
			"text": "İbn Abbas'ın nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"Zina eden kişi zina ettiği sırada mu'min olduğu halde zina edemez. Hırsız kişi de hırsızlık ettiği sırada mu'min olduğu halde hırsızlık yapamaz\" buyurmuştur. İmam Buhari bu konuda İbn Abbas hadisini zikretmişti. Bu hadisin açıklaması HudCıd bölümünün baş tarafında yapılmıştı",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6783,
			"arabicnumber": 6783,
			"text": "Ebu Hureyre r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Allah hırsız kişiye lanet etsin ki o bir miğfer çalar da o nedenle eli kesilir, bir ip çalar o yüzden eli kesilir. \" A'meş'in ifadesine göre hadisi rivayet edenler, hadisteki \"beyda\"nın demir miğfer ve \"habl\"in ip olduğunu ve bunların içinde değeri birkaç dirhem olan çeşitli değerde olduğuni ifade etmişlerdir. Fethu'l-Bari Açıklaması: İmam Buharl'nin kullandığı bu başlıktaki \"hırsız\" dan maksat, belli olmayan hırsızdır. İmam Buhari böylece -daha önce açıklandığı üzere- muayyen içki içen kimseye lanet okuma yasaklığı ile bu bölümde geçen hadisi cem ve telif etmeye/ aralarında uyum sağlamağa işaret etmektedir. İbn Battal şöyle demiştir: Hadise göre günah işleyen kimseleri isim isim belirtmek ve yüzlerine karşı lanet okumak uygun değildir. Uygun olanı, onları caydırmak ve alıkoymak için bu tür fiilleri işleyene genelolarak lanet okumaktır. Muayyen bir kişiye Allah'tan ümit kesmemesi için lanet okumak isabetli değildir. İbn Battal şöyle devam eder: İmam Buhari'nin maksadı buysa, bu isabetli değildir. Çünkü Nebi Sallallahu Aleyhi ve Sellem içki içen kimseye lanet okumayı yasaklamış ve kendisine gerekli ceza verildikten sonra \"Kardeşinizin aleyhinde şeytanın yardımcıları olmayınız\" buyurmuştur. Bu konunun açıklaması az önce geçmişti. TIbı, burada lanetten maksat her halde kişinin hakir ve zelil olmasıdır demiştir. İyad ise şöyle demiştir: Bazı bilginler şer'ı ceza uygulanmadığı sürece belli bir kişiye lanet okumaya cevaz vermişlerdir. Çünkü şer'ı ceza (had) kefarettir. lyaz'a göre bu yaklaşım isabetli değildir. Zira Nebi Sallallahu Aleyhi ve Sellem genelde lanet okumayı yasaklamıştır. Bunu muayyen bir kişiye yorumlamak daha isabetli ve uygundur. Bazıları şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem'in günah işleyen kimselere laneti, o fiil işlenmeden önce kendilerini sakındırmaya yöneliktir. Fiili işlediklerinde Resulullah Sallallahu Aleyhi ve Sellem onlar için istiğfar etmiş ve tövbekar olmaları için dua etmiştir. Resulullah Sallallahu Aleyhi ve Sellem'in bir kimsenin işlediği fiile karşılık ağır konuşup, lanet ettiği kimseye gelince, o lanetin genel şartına dahildir. Çünkü Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Rabbimden o kişiye lanetimi kefaret ve rahmet kılmasını diledim.\" Bu konu hakkında daha önce gerekli açıklamalarda bulunmuştuk. Orada Müslim'in Sahih'inde kaydettiği üzere bu sözün Ianeti hak etmemiş kimse hakkında söylendiğini açıklamıştık. \" 'el-habl'in ip olduğunu ve bunların içinde değeri birkaçdirhem olan değerli çeşitleri olduğuni ifade etmişlerdir.\" Bu hadisin ifade ediliş sebebi hırsızlığı kınamak, bu fiiHn iğrenç olduğunu vurgulamak ve gerek az, gerek çok olsun hırsızlık fiilinin akıbetinin kötü olduğu noktasında uyarıda bulunmaktır. Nebi Sallallahu Aleyhi ve Sellem adeta şöyle demektedir: Bir kişi değersiz bir miğfer ve eski püskü bir ip gibi basit bir şeyi çalmayı adet haline getirdiğinde ve bunu sürekli yaptığında sözkonusu alışkanlığın o kişiyi daha değerli bir şeyi çalmaya götüreceği şüphesizdir. Çaldığı mal karşılığında hırsıza el kesilme cezası uygulanacak bir miktara ulaşır ve eli kesilir. Sanki Resulullah Sallallahu Aleyhi ve Sellem şöyle demektedir:. Kişi bu fiilden kaçınsın ve hırsızlık karekterine hakim olmadan ve bunu alışkanlık haline getirmeden önce onu bıraksın, böylece o fiilin kötü sonucundan ve vahim sonucundan yakasım kurtarmış olur",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6784,
			"arabicnumber": 6784,
			"text": "Ubade b. es-Samit şöyle anlatmıştır: Bizler bir mecliste Resulullah Sallallahu Aleyhi ve Sellem'in yanında idik. Nebi Sallallahu Aleyhi ve Sellem bizlere 'Allah' a (ibadette) hiçbir şeyi ortak koşmamak, hırsızlık etmemek ve zina etmemek üzere bana bey'at ediniz\" dedi. Bundan sonra \"Ey Nebi Sallallahu Aleyhi ve Sellem! İnanmış kadınlar, Allah'a hiçbir şeyi ortak koşmamak, hırsızlık yapmamak, zina etmemek, çocuklarını öldürmemek, elleriyle ayakları arasında bir iftira uydurup getirmemek ... hususunda sana bey'at etmeye geldikleri zaman biatlarını kabul et\"(Mumtehine 12) ayetini okudu. Sonra şöyle dedi: \"İçinizden bu ahd ve sözünde duran ın ecri Allah'a aittir. Bu dediklerimden birini yapıp da ondan dolayı dünyada cezaya uğratılırsa bu ceza ona kefarettir. Bunlardan bir suçu yapıp da yaptığı fiili Allah Teala örterse (onun işi de Allah'a aittir.) Allah dilerse onu mağfiret eder, dilerse onu azaplandırır.\" Fethu'l-Bari Açıklaması: İmam Buhari burada Ubade b. es-Samit hadisine yer vermiştir. Ahmed b. Hanbel'in, Huzeyme b. Sabit'ten nakline göre Resulullah s.a.v. \"Kim bir günah işler ve bu günahın cezası kendisine uygulanırsa bu ona kefarettir\" buyurmuştur. (Ahmed b. Hanbel, V, 214) Hadisin senedi hasendir. Yukarıdaki hadisi Sahih-i Buharinin baş tarafında iman bölümünün onuneu kısmında uzun uzadıya açıklamıştık",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6785,
			"arabicnumber": 6785,
			"text": "Abdullah b. Ömer r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem veda haccında şöyle buyurmuştur: \"Dikkat edin! Hürmetçe en büyük bildiğiniz ay hangisidir?\" Sahabiler \"Bu hac ayımız değil midir?\" dediler. Resulullah Sallallahu Aleyhi ve Sellem \"Hürmetçe en büyük bildiğiniz belde hangisidir?\" diye sordu. Sahabiler \"Bu Mekke beIdemiz değil midir?\" diye cevap verdiler. Resulullah Sallallahu Aleyhi ve Sellem \"Hürmetçe en büyük bildiğiniz gün hangisidir?\" diye sordu. Sahabiler \"Bu hac günlerimiz değil midir?\" dediler. Resulullah Sallallahu Aleyhi ve Sellem şöyle devam etti: \"Şüphesiz Allahu Teala sizlere bu gününüzün, bu beldenizin ve bu ayınızın haram olduğu gibi karılannızı, mallarınızı ve namuslarınızı dokunulmaz kılmıştır. Ancak bir hak karşılığında olmak müstesnadır. Dikkat edin bunlan sizlere tebliğ ettim mi?\" Resulullah Sallallahu Aleyhi ve Sellem bu soruyu üç kere sordu. Sahabiler her defasında ona \"Evet, tebliğ ettinı\" diye cevap verdiler. Sonra Nebi Sallallahu Aleyhi ve Sellem şöyle dedi: \"Sizlere yazık -yahut- sizlere veyl olsun sakın benden sonra birbirlerinin boyunlarını vuran kafirler almayınız.\" Fethu'l-Bari Açıklaması: Bir mu'minin sırtının dokunulmaz olması, ona eziyet verilmekten korunmuş olduğu anlamına gelir. \"Bir hak veya şer't bir ceza olması hariç\" Yani bir Müslümanın sırtına onu tedib etmek maksadıyla had ve tazir cezası yoluyla olanı hariç vurulmaz ve o kişi aşağılanmaz. \"Benden sonra ... dönmeyiniz\" emriyle ilgili olarak ileride \"Fiten\" bölümünde gerekli açıklama yapılacaktır",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6786,
			"arabicnumber": 6786,
			"text": "Aişe r.anha şöyle demiştir: \"Resulullah Sallallahu Aleyhi ve Sellem dünya işlerinde iki iş arasında muhayyer kılındığında, -o iş günah olmadığı sürece- muhakkak durumların en kolay olanını tercih ederdi. Eğer söz konusu şey, günah türünden olursa Nebi Sallallahu Aleyhi ve Sellem onların ikisinden de insanların en uzak bulunanı olurdu. Allah'a yemin ederim ki o, kendisine getirilen hiçbir şeyde kendi nefsi için intikam almazdı. O ancak Allah'ın haramlarının çiğnenmesi durumunda Allah için (öfkelenir), intikam alırdı.\" Fethu'l-Bari Açıklaması: İmam Buhari, attığı bu başlık altında Aişe r.anha hadisine yer vermiştir. Bu hadis Menakıb bölümünde Nebi s.a.v.'in niteliği başlığı altında geniş bir biçimde açıklanmıştı. İbn Battal şöyle demiştir: Buradaki muhayyer kılma, Allahu Teala tarafından yapılmış değildir. Çünkü Allahu Teala Nebi s.a.v.'ini birisi günah olan iki şey karşısında muhayyer kılmaz. Ancak dinde iki seçenek olur ve bunlardan biri -haddi aşma örneğinde olduğu gibi- kişiyi günaha sürükleyici nitelikte bulunursa, bu müstesnadır. Çünkü haddi aşmak kınanmıştır. Mesela bir kimse kendisini çok ağır bir ibadet i yapmakla yükümlü tutsa ve sonra da onu yapmaktan aciz kalsa bu, haddi aşmaya örnek olur. Buradan hareketle Nebi s.a.v. sahabilerine dünyadan el etek çekmelerini yasaklamıştır. İbnü't-TIn şöyle demiştir: Hadiste muhayyer bırakmaktan maksat, dünya ile ilgili meselelerde sözkonusudur. Ahiretle ilgili işlere gelince, bunlar ne kadar zor olursa o kadar sevabı fazla olur. Ancak İbn Battal'ın söylediği daha iyidir. Bu iki görüşten daha uygun olanı, bunun dünya işleri konusunda olduğudur. Çünkü dünyanın bazı işleri insanı çoğunlukla günaha sürükleyebilir. Akla en yakın ihtimal muhayyer bırakanın insanoğlu olduğudur. Bunu anlamak gayet açıktır. Örnekleri çoktur. Özellikle muhayyer bırakma bir kafir tarafından yapıldığında sonucu ve uygulaması gayet açıktır",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 6787,
			"arabicnumber": 6787,
			"text": "Aişe r.anhs-'nın nakline göre Usame, Kureyş'in Mahzum soyuna mensup olup, hırsızlık yapmış bir kadın hakkında (aracılık yapmak üzere) Nebi Sallallahu Aleyhi ve Sellem'e konuşmuştu. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Sizden önceki ümmetler ancak şundan helak olmuşlardır: Onlar haddi (cezayı) sade ve sıradan kimseye uygularken, itibariz olan kimseyi bırakırlardı. Kudreti ile yaşadığım Allah'a yemin ederim ki eğer (Muhammed'in kızı) Fatıma bu işi yapmış olsaydı, muhakkak onun elini de keserdim.\" Hadiste geçen \"vadi'\" eksiklik ve noksanlık anlamınadır ki burada maksat sıradan, sade insanlar demektir",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 6788,
			"arabicnumber": 6788,
			"text": "Aişe r.anha şöyle anlatmıştır: Kureyş'in Mahzumoğullarından hırsızlık yapmış bir kadının durumu Kureyş'i bir hayli üzmüştü. Kureyşliler \"Bu kadın hakkında Resulullah Sallallahu Aleyhi ve Sellem ile kim konuşabilir? Bu hususta söz söylemeye Resulullah Sallallahu Aleyhi ve Sellem'in en çok sevdiği kişilerden birisi olan Usame'den başka kim cesaret edebilir?\" dediler. Nihayet Usame bu konuda Resulullah Sallallahu Aleyhi ve Sellem ile konuştu. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem şöyle dedi: ''Allah 'ın belirlediği cezalardan bir ceza hakkında aracılık mı ediyorsun?\" Resulullah Sallallahu Aleyhi ve Sellem sonra ayağa kalkıp şöyle bir konuşma yaptı: \"Ey insanlar! Sizden öncekiler ancakşu sebepten dolayı sapmışlardır: Onlar aralarında itibarlı bir kimse çaldığı zaman onu bırakırlardı, zayıf olan çaldığı zaman ona ceza uygularlardı. Allah'a yemin ederim ki eğer Muhammed'in kızı Fatıma çalmış olsaydı, hiç şüpheniz olmasın onun da elini keserdim.\" Fethu'l-Bari Açıklaması: İmam Buhari yukarıdaki başlıkla \"Allah 'ın belirlediği cezalardan bir ceza hakkında aracılık mı ediyorsun?\" şeklindeki bölüm hadisindeki mutiaklığı kayıtlamıştır. Bu kayıt açık ve net değildir. İmam Buhari sanki böyle yaparak hadisin bazı rivayet yollarında açıkça gelen hükme işaret etmektedir. Bu işaret etmiş olduğum Hab!b b. Ebu Sabit'in mürselinde yer almaktadır. Sözkonusu habere göre \"Nebi Sallallahu Aleyhi ve Sellem, Usame kendisine o konuda aracılık edince şöyle buyurmuştur: 'Şer'f bir ceza hususunda aracılık etme! Çünkü hadler bana ulaştığında artık uygulanmaması sözkonusu değildir.\" Bu haberin Amr b. Şuayb'ın babası vasıtasıyla dedesinden merfu olarak naklettiği bir şahidi bulunmaktadır. O rivayet şöyledir: \"Hadleri kendi aranızda tutunuz, yetkili makama intikal ettirmeyiniz. Herhangi bir şer'f cezalık suç, bana intikal etti mi onu uygulamak gerekli olur. \"(Ebu Davud, Hudud) Ebu Davud bu hadisin üzerine \"Yetkili makama (Sultan) İletilmediği Sürece Haddin Affı\" şeklinde bir başlık atmıştır. Hakim, hadisi sahih olarak kabul etmiştir. Hadisin Amr b. Şuayb'a ulaşan isnadı sahihtir. Ebu Davud, Ahmed b. Hanbel ve \"sahihtir\" değerlendirmesiyle Hakim'in nakillerine göre Yahya b. Raşid şöyle anlatmıştır: Bir gün İbn Ömer yanımıza çıkageldi ve ben Resulullah Sallallahu Aleyhi ve Sellem'in \"Kim Allah'ın hadlerinden birisine aracılık edip engellerse Allahu Teala'ın emrine karşı gelmiş olur\" buyurduğu nu işittim, dedi. (Ebu Davud, Akdiye; Ahmed b. Hanbel, II, 70; Hakim, el-Müstedrek, II, 32) Taberani'nin nakline göre Urve b. ZUbeyr şöyle anlatmıştır: \"ZUbeyr, bir hırsızla karşılaştı ve affedilmesi için aracılık (şefaat) etti. Kendisine \"Bu, yetkili makama (Sultan) iletilinceye kadardır\" denildi. ZUbeyr şöyle dedi: \"Bir suç yetkili makama (Sultan) iletildiğinde Allah aracılık edene de, edilene de lanet etsin.\" Bu hadis İbn Ebi Şeybe'de hasen bir isnadla ZUbeyr'in sözü olarak yer almaktadır. Sahih bir isnadla yapılan nakle göre İkrime şöyle anlatmıştır: İbn Abbas, Ammar ve ZUbeyr, bir hırsızı yakaladılar, sonra da salıverdiler. İbn Abbas'a \"Bu adamı salıvermekle ne kötü bir şey yaptınız\" dedim. O şöyle cevap verdi: \"Anasız kalasıca! Onun yerinde sen olsaydın salıverilmek seni mutlu etmez miydi?\" Darekutnl'nin mevsul ve merfu bir isnadla ZUbeyr'den nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Suç yetkili makama (valiye) ulaşmadıkça aracılık edebilirsiniz. Ona ulaştığında bu suçu affederse, Allah onu affetmesin. \"(Darekutni, Sünen, III, 204) Ancak mevkuf olan rivayet güvenilirdir. Bu konuda bunun dışında bir de Saffan b. Umeyye hadisi vardır. Bu hadis Ahmed b. Hanbel, Ebu Davud, Nesai, İbn Mace ve Hakim'in eserlerinde yer almakta ve ridası çalınan Saffan'ın hikayesini konu almaktadır. Saffan daha sonra o kişinin elinin kesilmemesini isteyince, Resulullah Sallallahu Aleyhi ve Sellem ona \"Bunu onu bana getirmeden önce yapamaz mıydın?\" demiştir.(Ahmed b. Hanbel, III, 401; Ebu Davud, Hudud; Nesai, Kat'u's-Sarik; İbn Mace, Hudud) Bu hadisten tazir gerektiren bir suçta aracılıkta bulunmanın caiz olduğu anlaşılmaktadır. İbn Abdilberr ve başkaları bu konuda bilginler arasında ittifak olduğunu naklederler. Bir Müslümanın suçunun gizlenmesini teşvik eden diğer hadisler de bu kategoriye girer. Tazirlik suçları gizleme de aynı şekilde \"yetkili makama (Sultan) intikal etmediği sürece\" şeklinde yorumlanmıştır. \"kadının durumu Kureyş'i bir hayli üzmüştü.\" Yani hırsızlık yapan kadın onlara üzüntü getirmiş veya yaptığı hırsızlıktan dolayı onları üzüntülü bir duruma sokmuştu. Ebu Davud, Nesai ve Sahih'inde Ebu Avane'nin, Eyyub ve Nafi isnadıyla İbn Ömer' den nakillerine göre Mahzum soyundan bir kadın bir eşyayı ödünç alır, sonra inkar ederdi. Nebi Sallallahu Aleyhi ve Sellem bu kadının elinin kesilmesini emretti.(Ebu Davud, Hudud; Nesai, Kat'u's-Sarik) Nesai ve Ebu Avane'nin bir başka isnadla Ubeydullah b. Ömer vasıtasıyla Nafi'den yaptıkları nakilde \"Zınet eşyası ödünç almıştı\" ifadesi yer almaktadır. Bilginlerin bu konudaki görüşleri farklıdır. Kendisinden gelen iki rivayetin en meşhuruna göre Ahmed b. Hanbel ve İshak, bu haberin zahirini esas almıştır. Zahiri mezhebinden İbn Hazm da onu desteklemiştir. Çoğunluğu oluşturan fıkıhbilginlerine göre ise ödünç bir malın inkarı nedeniyle el kesme cezası uygulanmaz. Bu görüş, aynı zamanda Ahmed b. Hanbel'den de nakledilmiştir. Çoğunluğu oluşturan bilginler, emaneti inkar etme dolayısıyla el kesilmesini hükme bağlayan hadise \"çalmıştı\" şeklindeki rivayetin daha tercihe değer olduğu şeklinde cevap vermişlerdir. İbnü'l-Münzir'in bazı alimlerden nakline göre olayaynı kadınla ilgilidir. Bu kadın hem ödünç alıp inkar etmiş ve hem de çalmıştı. Eli ödünçten dolayı değil, hırsızlık nedeniyle kesilmişti. İbnü'l-Münzir bizim kanaatimiz de bu doğrultudadır demiştir. Hattabi, Mealimu's-Sünen'de bilginlerin ihtilafına yer verdikten sonra İbnü'l-Münzir'in anlattığına işaret eder ve şöyle der: Bu olayda ödünç alma ve inkar, sözkonusu kadının özel niteliğini tanıtmak için zikredilmiştir. Zira o bunu çok yapardı. Ayrıca o kadının Mahzum soyundan olduğu da bilinmektedir. Kadının ödünç alıp, inkarı çok yapması dolayısıyla işi hırsızlık yapmaya kadar vardırmış ve buna cesaret etmiştir. Bu hadisten ortaya çıkan hükümlerden birisi de hadlerde aracılığın (şefaat) yasak olduğudur. İmam Buharl'nin attığı başlıkta aracılık (şefaat) yasaklığının, mesele yetkili makama (ulu'l-emr) intikal etmesiyle kayıtlı olduğu daha önce geçmişti. Bilginler bu konuda ihtilaf etmişlerdir. Ebu Ömer b. Abdilberr şöyle demiştir: Günah işleyen kimselere mesele yetkili makama (ulu'l-emr) intikal etmediği sürece aracılık (şefaat) etmenin' güzel bir fiil olduğu, yetkili makamın (ulu'l-emr) suç kendisine intikal ettiğinde cezayı uygulamak zorunda olduğu noktasında bilginler arasında herhangi bir ihtilaf olduğunu ben bilmiyorum. Hattabi ve başkalarının nakline göre İmam Malik, insanlara eziyet vermekle meşhur olan kimselerle, böyle olmayanlar arasında fark görmüş ve şöyle demiştir: İnsanlara eziyet vermekle meşhur olmuş kimseye suçu ister yetkili makama (ulu'l-emr) ister intikal etsin, isterse etmesin mutlak olarak aracılık (şefaat) edilmez. Ama böyle tanınmayan bir kimseye suçu yetkili makama intikal etmediği sürece şefaat etmekte herhangi bir sakınca yoktur. İmam Malik delilolarak iffete iftira eden kimsenin suçu yetkili makama (devlet başkanına) intikal ettiğinde iftiraya uğrayan affetse bile cezanın uygulanması gerektiğini ifade eden hadisi esas almıştır. Hanefilerle, Sevri ve Evzal'nin görüşü bu doğrultudadır. İmam Malik, Şafii ve Ebu Yusuf ise şöyle demişlerdir: Mutlak olarak affetmek caizdir. Böylece şer'i ceza düşer. Zira yetkili makam (devlet başkanı) mağdurun affından sonra iftiracıyı yakalasa onun doğru söylediğine delil sunması caizdir. Bu da güçlü bir şüphedir. Hadisten hırsızlık suçunun uygulanması açısından kadınlarla erkeklerin eşit oldukları anlaşılmaktadır. Hadiste hırsızın tövbesinin kabul edildiği, Usame'nin menkıbesi yer almaktadır. Hadis cezayı uygulamak gerekli olan kimseye -bu kişinin çocuğu, yakını ya da itibarı yüksek bir kişi bile olsa- ceza uygulanırken kayırma yapılamayacağını ve bu konuda titiz de davranmak gerektiğini ifade etmekte ve bu konuda ruhsat veren veya ceza alması gerekli olan kimseye şefaate kalkışan kimseye tepki koymaktadır. Hadisten geçmiş ümmetierin durumları ve özellikle dinin emrine aykırı hareket edenlerin başlarına gelenler ibret dersi olarak yer almaktadır",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 6789,
			"arabicnumber": 6789,
			"text": "Aişe r.anha'nın nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"Hırsızın eli çeyrek dinar ve daha fazlasını çaldığı zaman kesilir\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 6790,
			"arabicnumber": 6790,
			"text": "Aişe r.anha'nın nakline göre Nebi Sallallahu Aleyhi ve Sellem \"Hırsızın eli çeyrek dinar çaldığı zaman kesilir\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 6791,
			"arabicnumber": 6791,
			"text": "Amra bnt. Abdurrahman'ın Hz. Aişe r.anha'dan nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"Çeyrek dinar çalındığında el kesilir\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 6792,
			"arabicnumber": 6792,
			"text": "Hişam'ın babası vasıtasıyla nakline göre Aişe r.anha Resulullah Sallallahu Aleyhi ve Sellem zamanında hırsızın elinin ancak hacefe veya türs denilen kalkan değerinde bir mal çalındığında kesilirdi diye haber vermiştir",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 6793,
			"arabicnumber": 6793,
			"text": "Aişe r.anha \"Hırsızın eli hacefeden veya türsten daha aşağı bir mal için kesilmezdi. Bunların her biri kıymetli şeylerdi\" demiştir",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 6794,
			"arabicnumber": 6794,
			"text": "Aişe r.anha şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem zamanında hiçbir hırsızın eli micenn veya hacefe denilen bir kalkan bedelinden daha aşağı bir mal için kesilmemiştir. Halbuki bu kalkanlardan her biri kıymetli şeylerdi",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 6795,
			"arabicnumber": 6795,
			"text": "Abdullah b. Ömer r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem fiyatı üç dirhem olan bir kalkan hırsızlığında hırsızın elini kestirmiştir",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 6796,
			"arabicnumber": 6796,
			"text": "İbn Ömer'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem fiyatı üç dirhem olan bir kalkan hırsızlığında hırsızın elini kestirmiştir",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 6797,
			"arabicnumber": 6797,
			"text": "Abdullah b. Ömer r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem fiyatı üç dirhem olan bir kalkan hırsızlığında hırsızın elini kestirmiştir",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 6798,
			"arabicnumber": 6798,
			"text": "Abdullah b. Ömer r.a.'in nakline göre Nebi Sallallahu Aleyhi ve Sellem\" fiyatı üç dirhem olan bir kalkan hırsızlığında hırsızın elini kestirmiştir",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 6799,
			"arabicnumber": 6799,
			"text": "Ebu Hureyre r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Allah şu hırsıza lanet etsin ki o bir miğfer çalar da eli kesilir. Bir ip çalar da eli kesilir. \" Fethu'l-Bari Açıklaması: İmam Buharl'nin başlıkta yer verdiği ayette el anlamına gelen \"el-yedd\" kelimesi mutlak olarak söylenmektedir. Bilginler bundan maksadın mevcutsa sağ el olduğu noktasında görüş birliği etmişlerdir. Fıkıh bilginleri bir kimsenin kasten veya yanlışlıkla sol eli kesildiği takdirde bunun yeterli olup olamayacağı lçonusunda ihtilaf etmişlerdir. Ayette kadın hırsızdan önce erkek hırsızdan söz edilirken, zina konusunda önce kadına yer verilmiştir. Çünkü hırsızlık genellikle erkeklerin başvurduğu bir suç iken, zinaya çağıran ses dişilerde daha fazladır. Çünkü dişi zinanın meydana gelmesine sebeptir. Zira zina genellikle dişinin bunu istemesiyle gerçekleşir. Hırsızlık gizlice almak demektir. Dinı bir terim olarak hırsızlık, bir kimsenin başkasına ait bir malı yetkisi olmadığı halde gizlice alması demektir. Malın koruma altında olmasını şart koşan çoğunluğu oluşturan fıkıh bilginleri, buna bir de o malın benzerinin korunduğu gibi korunması şartını eklemişlerdir. Mazerı ve onun paralelinde düşünen bilginler şöyle demişlerdir: Allahu Teala hırsızın elini kesme cezası getirmek suretiyle malları korurken bunu sadece hırsızlık suçuna mahsus kılmıştır. Çünkü hırsızlığın dışındaki diğer yağmalama ve gasp gibi suçlar hırsızlığa oranla daha az işlenir. Bir de hırsızlığın dışındaki suçları delil getirerek ispat etmek daha kolaydır. Allah Teala caydırma unsuru çok güçlü olsun diye hırsızlıkta cezayı ağır belirlemiştir. Buna karşılık bir cinayet nedeniyle elin kopması durumunda onun diyetini, eli saldırıdan korumak amacıyla hırsızlıkta çalınan malın nisabı gibi belirlememiştir. Ancak el hain davrandığında bu değerini kaybeder. Bu açıklama Ebü'l-Ala el-Maarrl'ye nispet edilen şüpheye işaret etmektedir. Şair bir beytinde şöyle der: Bir el ki beş yüz altındır diyet bedeli Çalınca çeyrek dinar, kesiliyor ne demeli? Maliki alimlerinden Kadı Abdulvehhab bu bey te yine beyitle şöyle cevap vermiştir: Organı korumaktır amacı beş yüz altının, Çeyrek dinar korur malı, hikmeti budur yaratıcının! Bunun açıklaması şudur: Eğer el kesme suçunun diyeti çeyrek dinar olsaydı, millet o cezayı verir ve çok el keserdi. Şayet hırsızlıkta çalınan malın nisabı beş yüz dinar olsaydı, mala karşı çok hırsızlık cinayeti işlenirdi. Böylece Allahu Teala'ın her iki açıdan hikmeti ortaya çıkmaktadır. Bu uygulamada hem eli, hem de malı koruma vardır. ''Ali hırsızın elini avuçtan kesmiştir.\" İmam Buhari bu haberle elin nereden ,.esileceği noktasında bilginler arasındaki ihtilafa işaret etmiştir. Gerçek anlamda din sınırlarının nereden başlayıp, nerede bittiği noktasında bilginler ihtilaf etmişlerdir. Bazıları omuzdan aşağısı eldir derken, bazı bilginler dirsekten aşağısı eldir demişlerdir. Başka bazı bilginler ise elin bilekten başladığını söylerlerken, bazıları da parmak dibinden itibaren başlar demişlerdir. Bu dört görüşten birincisinin dayanağı Arapların omuzdan aşağıya el demeleridir. İkinci görüş ise abdest ayetine dayanmaktadır. Allahu Teala bu ayette \"ve eydiyekum ile'l-merafiki= dirseklerinize kadar ellerinizi\"(Maide 6) buyurmaktadır. Üçüncü görüş ise teyemmüm ayetini delil olarak almıştır. Kur'an-ı Kerim'de\" yüzünüzü ve ellerinizi onunla mesh edin\" buyurmaktadır.(Maide 6) İlgili yerde daha önce geçtiği üzere sünnet, teyemmüm ederken, kişinin sadece iki avuçlarını mesh edeceğini beyan etmiştir. Bazı HaridIer birinci görüşün zahirini esas almışlardır. Said b. el-Müseyyeb' den de böyle bir görüş nakledilmiştir. Ancak çoğunluk, bunu benimsemiştir. İkinci görüşü hırsızlık suçunda hangi bilginin söylediğini bilmiyoruz. Üçüncü görüş, çoğunluğu oluşturan bilginlerin benimsediği görüştür. Bazı alimlerden bu konuda icma olduğu nakledilmiştir. Dördüncü ise Hz. Ali'den nakledilmiştir. Ebu Sevr bunu güzel görmüştür. Ancak bu yaklaşım, parmakları dibinde n kesilmiş olan bir kimseye ne Arap dili açısından ve ne de halkın kullemmı (örf) açısından \"eli kesik\" denmez, \"parmakları kesik\" denilir denilerek reddedilmiştir. \"Katade, hırsızlık yapmış bir kadının yalnız sol eli kesildi, onda başka bir kesme olmadı, demiştir.\" Bu haberi Abdurrezzak, Ma'mer vasıtasıyla Katade' den nakletmiştir ve Şa'bı'nin görüşü gibi bir görüş zikretmiştir. Buna göre sol eli kesilen hırsıza had cezası uygulanmıştır. Başka bir şey yapmaya gerek yoktur. İmam Buhari bu rivayet e yer vermekle asıl prensibe işaret etmiştir. Buna göre hırsızın önce sağ eli kesilir. Çoğunluğun görüşü çle bu doğrultudadır. İbn Mesud hırsızlık cezasından söz eden ayeti \" 4111.9 = onların sağ ellerini kesiniz\" şeklinde okumuştur. Said b. Mansur'un sahih bir isnadla nakline göre İbrahim en-Nehaı şöyle demiştir: Bu, bizim yani İbn Mesud ashabının kıraatıdır. Iyaz bu konuda icma nakletmiştir. Ancak bu görüş tenkit edilmiştir. Katade'den yapılan naklin zahirinden de anlaşılacağı üzere sol el kesilmişse bu mutlak olarak hırsızlık cezası için yeterlidir diyen bilginler• kural dışı konuşmuşlardır. İmam Malik ise şöyle demiştir: Sol el kasten kesilmişse onu kesen kişiye kısas uygulamak ve sağ eli hırsızlık cezası olarak kesmek gerekir. Şayet bir yanlışlık eseri olmuşsa diyet vermek gerekir ve bu hırsızlık cezası olarak yeterlidir. İmam Ebu Hanıfe de böyle söylemiştir. İmam Şafiı ve Ahmed b. Hanbel' den hırsızlık konusunda iki görüş nakledilmiştir. Selef bilginleri bir kez çalıp eli kesilen, sonra ikinci kez çalan hırsıza ne muamele yapılacağı noktasında ihtilaf etmişlerdir. Çoğunluk, ikinci kez çalarsa, sol ayağı kesilir. Sonra bir kez daha çalarsa sol eli kesilir. Bir kez daha çalarsa sağ ayağı kesilir, demiştir. Onların delilleri hirabe ayeti ve sahabilerin uygulamasıdır. Sahabiler ayetten şunu anlamışlardır: EI kesme, suçun ilk işlenmesindedir. Hırsız bir kez daha çalarsa yine kesmek gerekir. Bu işlem kesilecek yeri kalmayıncaya kadar devam eder. Sonra yine çalarsa tazir edilir ve hapse atılır. \"ResuluIlah Sallallahu Aleyhi ve Sellem zamanında hiçbir hırsızın eli micenn veya hacefe denilen bir kalkan bedelinden daha aşağı bir mal için kesilmemiştir.\" \"Micenn\" kelimesi \"idinan\" kökündendir. Bu, gizlenen kimsenin sakındığı şeyden kendisini gizlemesi anlamınadır. \"Cehafe\" ise kalkan olup, ahşaptan veya kemikten yapılmaktadır. Bu deri veya başka bir şeyle kaplanır. (Önemli Bilgi:) \"ResuluIlah Sallallahu Aleyhi ve Sellem, değeri üç dirhem olan bir kalkan hırsızlığında hırsızın elini kesmiştir\" haberinde geçen \"kesmiştir\" fiilinin manası, \"kesilmesini emretmiştir\" demektir. Çünkü ResuluIlah Sallallahu Aleyhi ve Sellem bizzat kendisi kesmemiştir. Bu haberi koruma altındaki bir malı çalmamış bile olsa hırsızın elinin kesilmesi gerektiğine delilolarak göstermişlerdir. Zahirilerin ve Mutezile mezhebinden Ebu Ubeydullah el-Basri'nin görüşü bu doğrultudadır. Çoğunluk ise bunlara muhalif olmuştur. Onlar çeyrek dinarın mutlak söylenmesini, altından çeyrek dinar denilebilecek miktarın çalınması durumunda el kesmenin gerekli olduğuna delilolarak göstermişlerdir. Bu altın ister basılmış, ister basılmamış, ister kaliteli, ister kalitesiz olsun hiç farketmez",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 6800,
			"arabicnumber": 6800,
			"text": "Aişe r.anha'nın nakline göre ResuluIlah Sallallahu Aleyhi ve Sellem hırsızlık eden bir kadının elini kestirmiştir. Aişe şöyle demiştir: \"Artık bundan sonra o kadın bana gelir, ben de onun ihtiyacını Resulullah Sallallahu Aleyhi ve Sellem'e arzederdim. Kendisi bu hadiseden sonra tövbe etti ve tövbesi de güzel oldu",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 6801,
			"arabicnumber": 6801,
			"text": "Ubade b. es-Samit şöyle anlatmıştır: Ben bir topluluk içinde ResuluIlah Sallallahu Aleyhi ve Sellem ile bey'atlaştım. Resulullah Sallallahu Aleyhi ve Sellem bana şöyle buyurdu: \"Ben sizlerle şu şartlar üzerine Bey'atlaşıyorum: Allah'a hiçbir şeyi ortak kılmamanız, hırsızlık yapmamanız, çocuklarınızı öldürmemeniz, ellerinizle ayaklarınız arasından bir iftira düzüp getirmemeniz, hiçbir maruf işte bana isyan etmemeniz. Sizden her kim bu sözünde durursa, onun ecri Allah'ın zimmetindedir. Bu dediklerimden birini yapıp da ondan dolayı dünyada yakalanırsa bu onun için bir kefarettir ve bir temizliktir. Bunlardan birini yapıp da yaptığı fiili Allah örterse onun bu işi de Allah'a kalır. Allah isterse onu azaplandınr, isterse affeder. \" Ebu Abdullah el-Buhari şöyle demiştir: Hırsız, eli kesildikten sonra tövbe ederse şahitliği kabul edilir. Şer'ı ceza uygulanmış her suçlunun, tövbe ettiği takdirde şahitliği kabul edilir. Fethu'l-Bari Açıklaması: \"Hırsızın tövbe Etmesi.\" Bu başlığın açılımı şöyledir: Bir hırsız tövbe ettiğinde tövbesi fasıklık lekesini ondan kaldırıp da şahitliği kabul edilir mi yoksa edilmez mi? Beyhakl'nin nakline göre İmam Şafil şöyle demiştir: Tövbe ile bütün Allah haklarının düşme ihtimali bulunmaktadır. İmam Şafil bunu Hudud bölümünde kesin bir dille ifade etmiştir. er-Rebl'in ondan nakline göre zina cezası tövbe ile düşmez. Leys ve Hasan-ı BasrI'nin had cezalarından hiçbiri tövbe ile asla düşmez dedikleri nakledilmiştir. Beyhaki, İmam Malik'in görüşü de bu doğru1tudadır demiştir. Hanefilerden nakledilen bir görüşe göre içki içme hariç tövbe ile Allah hakları sakıt olur. Tahavi ise yol kesme suçundan başka hiçbir suç tövbe ile düşmez. Yol kesme suçunda ise nass vardır demiştir. Doğruyu en iyi Allahu Teala bilir. Tahavi bu konuda hırsızlık yapan kadının olayından söz eden Aişe r.anha hadisine yer vermiştir. Bu hadisin açıklaması biraz önce geniş bir şekilde verilmişti",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 6802,
			"arabicnumber": 6802,
			"text": "Enes şöyle anlatmıştır: \"Ukl kabilesinden bir topluluk Medine'ye gelip Müslüman oldular. Medine'nin havasına alışamadılar. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem zekat develerinin otlatıldığı yere gidip, onların idrarlarından ve sütlerinden içmelerini tavsiye etti. Bunu yapıp sağlıklarına kavuştular. Sonra İslamdan döndüler. Develerin çobanlarını katledip, sürüyü önlerine kattılar. Resulullah Sallallahu Aleyhi ve Sellem onların arkasından bir askeri birlik gönderdi ve yakalanıp Medine'ye getirildiler. Nebi Sallallahu Aleyhi ve Sellem onların ellerini ve ayaklarını kestirip, gözlerine mil çekilmesini emretti. Ancak kesilen yerlerin ateşle dağlamasını emretmedi. sonunda onlar öldüler.\" Fethu'l-Bari Açıklaması: İbn Battal şöyle demiştir: İmam Buhari hirabe ayetinin kafirler ve mürtedler hakkında indiği kanaatine varmıştır. Bu yüzden o Ureynelilerden söz eden olay yer vermiştir. Bu hadiste hirabe cezasının sadece kafir ve mürtediere uygulanacağına dair bir açıklık yoktur. Fakat Abdurrezzak, Ma'mer vasıtasıyla Katade'den Ureyneliler hadisini nakletmiştir. Bu hadisin son kısmında şöyle denilmektedir: \"Bize ulaşan habere göre 'Allah ve Resulüne karşı savaşanların ve yeryüzünde düzeni bozmaya çalışanların cezası. .. ' ayeti Ureyne'liler hakkında inmiştir. Bu şekilde görüş bildiren bilginler arasında Hasan-ı Basri, Ata, Dahhak ve Zühri bulunmaktadır. Katade şöyle demiştir: Fıkıh bilginlerinin çoğunluğu, bu ayetin Müslümanlardan yola çıkıp, yeryüzünde fesad peşinde koşan ve yol kesen kimseler hakkında indiği kanaatine varmışlardır. İmam Malik, Şafii ve KOfeli bilginIerin görüşü bu doğrultudadır. Katade şöyle devam etmiştir: Bu, birinci görüşe çelişik değildir. Çünkü ayet bizzat Ureyneliler hakkında inmiş bile olsa lafzı geneldir ve onların yaptığı gibi devlete savaş açıp fesad çıkaran herkes bu ayetin kapsamına dahildir. Bizim kanaatimize göre bu iki görüş birbirine zıttır. Bu konuda esas alınması gereken hirabeden neyin kastedildiğidir. Bunu kafirlik şeklinde yorumlayanlar ayet i kafirlerle tahsis etmişlerdir. Ayeti masiyet ve günah şeklinde yorumlayanlar ise genel kılmışlardır. Daha sonra İbn Battal, İsmail el-Kadl'den şöyle bir görüş nakletmiştir: Kur'an'ın zahiri ve Müslümanların geçmiş uygulamaları bize ayette sözü edilen cezanın Müslümanlar hakkında indiğini göstermektedir. Kafirlere gelince, onların hakkında \"İnkar edenlerle karşılaştığımz zaman boyunlanm vurun\"(Muhammed 4) cümlesiyle başlayan ayet-i kerime inmiştir. Dolayısıyla kafirlerin hükmü bunun dışındadır. YüceAllah, hirabe ayetinde \"Ancak siz kendilerini yenip ele geçirmeden önce tövbe edenler müstesna\"(Maide 34) buyurmaktadır. Bu ayet savaşçıların içinden tövbe edenlerden işlediği cinayete karşılık belirtilen isteğin düştüğünü göstermektedir. Bu ayet kafirler hakkında olsaydı, hirabe ona fayda verirdi ve kafir, kafir olmasına rağmen hirabe suçunu işlediğinde ayette zikredilen uygulamayla yetinirdik ve o kafir kendini katledilmekten kurtarır ve hirabe kendisinden katledilme cezasını kaldırarak hafifletirdi. Bu probleme şöyle cevap verilmiştir: Mesela mürted olan bir savaşçıya bu cezaların uygulanması yeniden islama dönmesi talebini veya katledilmesini düşürmez. imam Buhari bundan sonra Ureyneliler hakkındaki Enes hadisine yer vermektedir. Bu hadisin açıklaması Taharet bölümünde \"Develerin idrarı\" başlığı altında yapılmıştı",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 6803,
			"arabicnumber": 6803,
			"text": "Enes'in nakline göre Nebi Sallallahu Aleyhi ve Sellem Ureynelilerin Ellerini ve ayaklarını kestirmiş ve kesilen yeri dağlamayarak onları ölüme terk etmiştir. Fethu'l-Bari Açıklaması: Yukarıdaki hadiste geçen \"hasm\", kan ın dinmesi için kesilen yeri ateşle dağlamak demektir. \"Hasemtu'l-ırka\" damarın kanını kestim ve akmasını engelledim demektir. Davudı şöyle demiştir: Bu hadiste geçen \"el-hasm\", elin kesildikten sonra kızgın yağa batırılmasıdır. Bizim kanaatimize göre bu tarif edilen hasmın çeşitlerinden sadece birisidir ve hasm sadece bu demek değildir. İmam Buhari bu konuda Ureynelilerin olayından bahseden hadisin bir kısmına yer vermiş ve \"kesilen yeri dağlamayarak onları ölüme terk etmiştir\" demiştir. ibn Battal, Nebi Sallallahu Aleyhi ve Sellem'in dağlama yaptırmaması, ölmelerini i;;tediğindendir. Buna karşılık hırsızlık suçunun cezası olarak bir el kesildiğinde kesilen yeri dağlamak gereklidir. Çünkü böyle yapılmazsa kişinin kan kaybından genellikle ölmeyeceğinden emin olunamaz",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 6804,
			"arabicnumber": 6804,
			"text": "Enes şöyle demiştir: Ukl kabilesinden bir topluluk Nebi Sallallahu Aleyhi ve Sellem'in huzuruna geldi ve Suffa'da ikamet etmeye başladı. Ancak Medine'nin havası onlara iyi gelmedi ve burada kalmak istemediler. Bunun üzerine \"Ya Resulallah! Bize süt arayıver!\" dediler. Nebi Sallallahu Aleyhi ve Sellem de \"Ben sizin için süt bulamam. Ancak Allah'ın Resulünün deve sürülerinin yanına gitmeniz çaresini bulabilirim\" dedi. Bundan sonra onlar deve sürülerinin bulunduğu yere gittiler. Orada develerin sütlerinden ve idrarlarından içtiler. Nihayet böylece sağlıklarına kavuştular, semizlenip, kuvvetlendiler. Sonra da çobanı öldürdüler ve develeri önlerinekatıp, sürüp götürdüler. Bundan sonra Nebi Sallallahu Aleyhi ve Sellem'e imdat isteyen bir kişi gelip, haber verince Resulullah Sallallahu Aleyhi ve Sellem onların izleri üzerine bir askeri birlik gönderdi. Gün yükselmeden onları yakalayıp getirdiler. Nebi Sallallahu Aleyhi ve Sellem Efendimiz demir çubuk getirilmesini emretti. Demir çubuklar ateşte kızdırıldı. Bunlarla suçluların gözlerine mil çektirdi, ellerini ve ayaklarını kestirtti, kesilen yerlere kanı dindirici bir dağlama tedavisi uygulamadı. Sonra bu caniler Harre denilen kara taşlık bir yere atıldılar. Bunlar orada su istediler fakat kendilerine su verilmedi, nihayet ölüp gittiler. Ebu Kılabe bunlarla ilgili olarak şöyle der: Bu kişiler hırsızlık yaptılar, insan öldürdüler, Allah ve Resulüne karşı savaş açtılar. Fethu'l-Bari Açıklaması: \"Nebi s.a.v. onların gözlerine mil çektirdL\" Bu haberde geçen \"...\" hakkında lyaz şu açıklamayı yapmıştır: \"........\" ifadesi gözünü kızgın kızgın demir çubuk ile dağladı demektir. Fiil bu durumda \".......\" fiili ile aynı olmuş olur. Zira bu fiil şu şekilde tefsir edilmiştir: Göze kızgın bir demir yaklaştırılır ve böylece görme gücü gider. Bu açıklama \"r---\" fiiline uygun düşmektedir. Çünkü \"r---\" sözkonusu demirin çivi olmasını ifade etmektedir. (Önemli Bir Bilgi:) Hirabe ayetindeki \"Bu onların dünyadaki rüsvaylığıdır. Onlar için ahirette de büyük azap vardır\"(Maide 33) ifadesi ile Ubade'nin dünyada şer' ı ceza almış kimseye aldığı ceza kefaret olur mealindeki hadisi ile anlam problemi doğmaktadır. Çünkü hirabe ayetinin zahiri, iki hususu (dünyada rezalet, ahirette ceza) birden ifade etmektedir. Buna verilecek cevap şudur: Ubade hadisi Müslümanlara mahsustur. Zira hadiste şirk ona katılan masiyetle birlikte yer almaktadır. Katir şirki üzere öldürüldüğünde müşrik olarak ölürse bu katlin onun için kefaret olmayacağı yolunda icma vardır. Ehl-i sünnet günahkar kimselere had cezası uygulandığında bunun o günah için kefaret olacağı yolunda icma etmişlerdir. Bu hususu çözüme kavuşturan Allahu Teala'ın şu ifadesidir: \"Allah, kendisine ortak koşulmasını asla bağışlamaz; Bundan başkasını, dilediği kimse için bağışlar. \"(Nisa 48)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 6805,
			"arabicnumber": 6805,
			"text": "Enes b. Malik'in nakline göre Ukl veya Ureyne kabilelerinden bir topluluk -Ravi: Ben onun ancak Ukl'den dediğini biliyorum, demiştir- Medine'ye geldiler. Nebi Sallallahu Aleyhi ve Sellem onlar için sütlü develer emretti. Onlara sadaka develerinin bulundukları yere çıkmalarım, onların idrarlarından ve sütlerinden içmelerini emretti. Onlar gidip o develerin sütlerinden ve idrarlarından içtiler, nihayet hastalıklarından kurtulup iyileşti kle ri zaman çobanı öldürdüler de develeri sürüp götürdüler. Bu haber kuşluk vakti Nebi (s.a.v.)'e ulaşınca, hemen arkalarından arayıcılar gönderdi. Gündüz yükselmeden yakalanıp getirildiler. Nebi onlarla ilgili emrini verdi. Onların ellerini, ayaklarını kestirdi, gözlerini çıkarttı. Sonra onlar Harre mevkiine atıldılar. Onlar su istediler, fakat kendilerine su verilmedi",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 6806,
			"arabicnumber": 6806,
			"text": "Hafs b. Asım'ın Ebu Hureyre'den nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Yedi kimseyi Allah kendi gölgesinden başka hiçbir gölgenin olmadığı kıyamet gününde kendi gölgesi altında gölgelendirecektir. Adil devlet başkanı, Allah'a ibadet içinde yetişen genç, tenha bir yerde Allah'ı anıp da gözleri yaş akıtan kimse, kalbi mescidlere bağlı olan kimse, Allah yolunda birbirini seven iki kimse, mevki ve güzellik sahibi olan bir kadın kendisini nefsini tatmine çağırdığı zaman 'Ben Allah'tan korkarım' diyen erkek, bir sadaka verdiğinde bunu sol eli, sağ elinin yaptığı işi bilmeyecek kadar gizli olarak veren kimse",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 6807,
			"arabicnumber": 6807,
			"text": "Sehl b. Sa'd es-Saidl'nin nakline göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Kim bana iki bacağı arasındaki ile iki çene kemiği arasındakini günahtan korumayı garanti ederse, ben de o kimseye cenneti garanti ederim.\" Fethu'l-Bari Açıklaması: Yukarıdaki hadiste çirkinlik anlamına kullanılan \"fevahiş\", \"fahişe\" kelimesinin çoğuludur. Fahişe -gerek mı, gerek söz- çok çirkin olan günahlardır. \"elFahşa\" ve \"el-fuhş\" kelimeleri de aynı anlamadır. \"el-kelamu'l-fahiş\" deyimi bu kökten türemedir. Genellikle zinaya \"fahişe\" denir. Nitekim Allahu Teala \"velCi takrabu'z-zina innehu kCine fahişe= zinaya yaklaşmayın. Zira o, birhayasızlıktır ve çok kötü bir yoldur\"(İsra 32) ayetinde kelimeyi bu manada kullanmıştır. İmam Buhari daha sonra bu konuda iki hadise yer vermiştir. Bunlardan birisi YüceAllah'ın kendi gölgesi altında gölgelendirecek olduğu yedi kişi hakkındaki Ebu Hureyre hadisidir. Bu hadiste konumuzia ilgili olan kısım \"Mevki ve güzellik sahibi olan bir kadın kendisini nefsini tatmin etmeye çağırdığı zaman 'ben Allah'tan korkarım' diyen erkek\" cümlesidir. Bu hadisin açıklaması Zekat bölümünde daha önce geniş şekilde yapılmıştı. Hadiste geçen \"tevekkele li\" ifadesi \"bana tekeffül etti, garanti etti\" demektir. \".J lo = iki bacağı arasındaki\" den maksat cinselorgandır. \"...... \" sakal bitimi anlamına olup, iki çene demektir. Bundan maksat dildir. Bazıları konuşmadır demişlerdir. İmam Buhari Rikak bölümünde bu hadise \"Dilini muhafaza\" başlığını atmıştı. Hadisin geniş bir açıklaması orada geçmişti",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 6808,
			"arabicnumber": 6808,
			"text": "Katade'nin nakline göre Enes şöyle demiştir: Ben size Nebi Sallallahu Aleyhi ve Sellem'den işittiğim öyle bir hadis söyleyeceğim ki, benden sonra onu size hiçbir kimse söylemeyecektir. Ben Nebi Sallallahu Aleyhi ve Sellem'den işittim şöyle buyuruyordu: \"(Şunlar olmadıkça) kıyamet kopmaz.\" Ya da şöyle buyurdu: \"İlmin kaldırılması, cahilliğin meydana çıkıp kökleşmesi, şarabin içilmesi, zina'nın aşikare yapılması, erkeklerin azalıp, kadınların çoğalması kıyamet alametlerindendir. Kadınlar o kadar çoğalacak ki, elli kadın için bir kayyım olacaktır",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 6809,
			"arabicnumber": 6809,
			"text": "İbn Abbas'ın nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Kul zina ettiği sırada (kamil) bir mu'min olduğu halde zina edemez. Hırsızlık yaptığı sırada mu'min olduğu halde hırsızlık edemez. İçki içerken de mu'min olduğu halde içki içemez. (Haksız olarak birini öldürdüğünde de) mu'min olarak öldüremez. \" İkrime şöyle dedi: Ben İbn Abbas'a \"Bu günahları işlerken ondan iman nasıl sökülüp çıkarılır?\" diye sordum. İbn Abbas \"İşte şöyle\" dedi ve parmaklarını birbirine geçirdi, sonra onları çıkardı. Ardından şöyle dedi: \"Kişi tövbe ederse iman tekrar ona döner\" ve bu dönüşü de parmaklarını birbirine geçirerek \"işte böyle döner\" diye gösterdi",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 6810,
			"arabicnumber": 6810,
			"text": "Ebu Hureyre r.a.'in nakline göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Zina eden kimse, zina ettiği sırada mu'min olduğu halde zina edemez; Hırsızlık eden kişi de hırsızlık yaparken mu'min olduğu halde hırsızlık yapamaz. İçki içen içki içerken mu'min olduğu halde içemez. O bu günahları işledikten sonra tövbe (kapısı) hala önündedir",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 6811,
			"arabicnumber": 6811,
			"text": "Abdullah b. Mes'ud şöyle demiştir: Ben \"Ya Resulallah! Hangi günah en büyüktür?\" diye sordum. Resulullah Sallallahu Aleyhi ve Sellem 'Allah seni yarattığı halde, Allah'a bir ortak uydurmandır\" buyurdu. Ben \"Sonra hangi (günah büyüktür)?\" diye sordum. Nebi Sallallahu Aleyhi ve Sellem \"Seninle beraber yemek yemesinden korktuğu için çocuğunu öldürmendir\" buyurdu. Ben \"Bundan sonra hangisi (büyüktür)?\" dedim. Resulullah Sallallahu Aleyhi ve Sellem \"Komşunun eşiyle zina etmendir\" buyurdu. Fethu'l-Bari Açıklaması: İmam Buharl'nin başlığındaki \"zünad\" kelimesi \"zanı\" kelimesinin çoğuludur. Tıpkı \"rumat\"ın \"ramin\"in çoğulu olduğu gibi. İmam Buhari \"Onlar zina etmezler\" cümlesi ile Furkan suresindeki ayete işaret etmektedir. Bu ayetin baş tarafı \"Yine onlar ki Allah ile beraber başka bir tanrıya yalvarmazlar\" şeklindedir. Ayetin buraya alınmasından maksat, içinde yer alan \"Bunları yapan günahımın cezasını) bulur\" cümlesidir. İmam Buhari bu bölümde dört hadise yer vermiştir. Bunlardan birinci hadisin açıklaması İlim bölümünde geçmişti. İkincisi \"Kul zina ettiği sıra (kamil) bir mu'min olduğu halde zina edemez\" şeklindeki İbn Abbas hadisidir. Bu hadisin açıklaması da Hudud bölümünün başındaki Ebu Hureyre hadisi açıklanırken geniş bir şekilde yapılmıştı. Tirmizi, Ebu Hureyre hadisini naklettikten sonra şöyle der: \"Zina eden kimse, zina ettiği sırada mu'min olduğu halde zina edemez\" hadisinin açıklaması sadedinde hiç kimsenin zina, hırsızlık ve içki içme fiilinden dolayı herhangi bir kişiyi kafir kabul ettiğini bilmiyoruz. Tirmizi şöyle devam eder: Ebu Cafer Muhammed el-Bakır' ın bu konuda böyle bir kişi imandan çıkıp, İslama girer dediği rivayet edilir. Buna göre Muhammed el-Bakır, imanı İslamın içinde daha dar bir çerçeve olarak kabul etmiş olmaktadır. Kişi iman dairesinden çıkınca geriye daha geniş olan İslam dairesi kalmaktadır. Bu yaklaşım, çoğunluğun buradaki imandan maksat, imanın aslı değil, kamil alanıdır şeklindeki görüşlerine uygun düşmektedir. Doğruyu en iyi Allahu Teala bilir. \"Hangi günah daha büyüktür?\" İbn Battal'ın nakline göre Mühelleb şöyle demiştir: Bazı günahların bu hadiste şirkten sonra sıralanan iki günahın her birinden daha büyük olması mümkündür. Çünkü bilginler arasında homoseksüelliğin (livata), zinadan daha günah olduğu noktasında ihtilaf yoktur. Nebi s.a.v. burada sanki en büyük kelimesiyle çok işlenen ve o anda açıklamasına ihtiyaç beliren günahı kastetmiş gibidir. Tıpkı Abdulkays heyeti geldiğinde kendi beldelerinde çok yaygın olduğu için onlara içki içmeyle ilgili yasaklar getirmekle yetindiği gibi. Bize göre ise Mühelleb'in bu yaklaşımı birkaç yönden tartışıhr: 1. Önce onun sözünü ettiği icmadan başlayalım. Her halde o iddiasına bir tek imamdan açık ve sahih bir nakil getiremez. Tam tersine bilginler topluluğundan nakledilen görüş onun iddia ettiğinin aksidir. Zira çoğunluğa göre had cezası zina fiili için sözkonusudur. Bu konuda ileri sürülen görüşlerden tercih edilene göre had cezası homoseksüellikte zinaya kıyaslanarak sabittir. Kuralolarak makisu'n-aleyh (zina), makis'ten (livata) daha büyük olur veya onunla eşit olur. Livata suçunda aktif ve pasif olanın katledileceklerine veya recm edileceklerine dair haber zayıftır. 2. Homoseksüellikte ne gibi bir mefsedet varsa onun aynısı zinada da bulunmaktadır. Hatta daha beteri mevcuttur. Sözkonusu hadiste zikredilen mefsedet dışında bir kötülük olmasa bile zinadaki mefsedet son derece ağırdır. Bunun bir benzeri başka bir günahta olamaz. Var olduğunu kabul etsek bile bu mefsedet, zina mefsedetinden daha ağır olamaz. 3. Böyle bir yaklaşım hiç zorunluluk yokken büyük günahı ifade eden açık ve net nasla çatışma sözkonusudur. 4. Onun içki içme yasaklığı ile ilgili olarak verdiği örneğe gelecek olursak, Nebi s.a.v. Abdulkays heyetine bazı yasakları bildirmekle yetinmiştir. Ancak bu ifadede sadece o günahla yetindiğine dair açık bir beyan olmadığı gibi işaret de yoktur. Anlaşılan hadiste sözü edilen üç günah, büyüklük açısından orada sıralandığı gibidir. Nebi s.a.v.'in belirtmediği günah içinde daha büyük olarak nitelenecek bir başka günah olsaydı, verilen cevap sorulan soruya uygun düşmezdi. Resulullah Sallallahu Aleyhi ve Sellem'in zikretmediği günahlardan zikrettiğine eşit derecede olan bulunması mümkündür. Bunu biz de kabul edebiliriz. Bu durumda şöyle bir günah takdir etmek mümkündür: Söz gelimi hadiste zikredilen kişinin çocuğunu öldürmesi fiilinden sonra ikinci mertebede çirkinlikte de onun aynısı veya benzeri (ancak adı zikredilmeyen) bir Jünah daha bulunabilir. Fakat bu, Nebi s.a.v.'in ikinci mertebede zikretmediği günahlar arasında üçüncü mertebede zikrettiğinden daha büyük bir günah olmasını gerektirir. Bunda herhangi bir sakınca yoktur. Edep bölümünde ana ve babaya asi olmanın büyük günahların en büyüğü olduğu yolundaki ifadeye gelince, o J vav harfiyle zikredilmiştir. Dolayısıyla bu günahın kendisinden aşağıdakilerden daha büyük bir günah olarak dördüncü mertebede bulunması mümkündür. Bu hadisin kalan kısmının açıklaması tevhid bölümünde inşaallah gelecektir",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 6812,
			"arabicnumber": 6812,
			"text": "Ali r.a.'in bir Cuma günü bir kadına recm cezası uyguladığında \"Bu kadını Resulullah Sallallahu Aleyhi ve Sellem'in sünneti ile recm ettim\" dediği naklediImiştir",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 6813,
			"arabicnumber": 6813,
			"text": "Şeybanı şöyle anlatmıştır: Abdullah İbn Ebu Evfa'ya \"Resulullah Sallallahu Aleyhi ve Sellem recm cezası uyguladı mı?\" diye sordum. O da \"evet\" dedi. Ben tekrar \"Resulullah Sallallahu Aleyhi ve Sellem en-Nur suresinin inmesinden önce mi, yoksa sonra mı recm etti?\" diye sordum. Abdullah b. Ebu Evfa \"Bunu bilmiyorum\" dedi",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 6814,
			"arabicnumber": 6814,
			"text": "Cabir b. Abdullah şöyle demiştir: \"Eslem kabilesinden bir adam Resulullah Sallallahu Aleyhi ve Sellem'e geldi. Ona zina ettiğini söyledi ve kendisine aleyhine dört kez şehadette bulundu. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem recm edilmesini emretti ve o kişi recm edildi. Bu adam evli olduğu halde zina etmişti.\" Fethu'l-Bari Açıklaması: Muhsan, \"ihsan\" kökünden türemedir. Bu kelime iffet, evli olma, Müslüman ve hür olma anlamına gelir. Çünkü bu özelliklerden her biri mükellefin zina işlemesine mani olur. İbnü'l-Münzir şöyle demiştir: Bilginler, fasid nikahla şüphe üzerine birleşmenin kişiyi muhsan yapmayacağı noktasında görüş birliği etmişlerdir. Ebu. Sevr onlara muhalif kalmış ve bu durumda kişi muhsan olur demiştir. Ebu. Sevr'in deIili şudur: Fasid nikaha sahih nikahın doğurduğu mehir yükümlülüğü, iddet beklemenin gerekliliği, doğacak çocuğun nesebinin sabit oluşu ve o kadının başka kocadan olan kızıyla evlenmenin haramlığı gibi hükümler bağlanmaktadır. Ebu. Sevr' e \"Hadleri şüphelerle düşürünüz\" hadisinin genellik ifade ettiği şeklinde cevap verilmiştir. İbnü'l-Münzir şöyle devam eder: Bilginler sırf nikah akdi yapmış olmakla kişinin muhsan olmayacağı noktasında görüş birliği etmişlerdir. Kişi kadınla gerdeğe girip, ilişkiye girmediğini iddia ettiğinde muhsan olup olmayacağı noktasında ihtilaf etmişlerdir. İbnü'l-Münzir şöyle der: Bu konuda bir beyyine bulunduğunda veya kişi ilişkiye girdiğini ikrar ettiğinde ya da bu kadından çocuğunun olduğu bilindiğinde muhsan olur. Maliki alimlerinden birisi şöyle demiştir: Bir erkek bir kadın ta zina eder ve ilişkinin gerçekleştiği konusunda ihtilafa düşerlerse, zina eden erkek -sadece bir gece geçirmiş olsalar bile- tasdik edilmez. Zina öncesine gelince -erkek o kadınla kaldığı kadar kalsa bile- bununla muhsan olmaz. Bilginler hür bir erkeğin cariye ile evlenmesi durumunda cariyenin kendisini muhsan haline getirip getirmeyeceği konusunda ihtilaf etmişlerdir. Çoğunluk, kişinin böyle bir evlilikle muhsan olacağı kanaatini benimsemiştir. Ata, Hasan-ı Basri, Katade, Sevrı, Ko.fe bilginleri, Ahmed b. Hanbel ve İshak böyle bir ilişkiyle kişinin muhsan olamayacağını söylemişlerdir. Fıkıh bilginleri bir erkeğin ehli kitap kadınla evlenmesi durumunda muhsan olup olmayacağı konusunda ihtilaf etmişlerdir. İbrahim en-Nehaı, Tavo.s ve Şa'bı, ehl-i kitap kadını erkeği muhsan yapmaz görüşünü benimsemişlerdir. Hasan-ı Basri ise o erkek, ehl-i kitap olan kadınla Müslüman olduktan sonra birleşmezse bu kadın onu muhsan yapmaz demiştir. Bu iki görüşü İbn Ebi Şeybe nakletmiştir.(İbn Ebi Şeybe, Musannef, V, 536) Cabir b. Zeyd'le İbnü'l-Müseyyeb'in ehl-İ kitap kadınının erkeği muhsan yapacağı görüşünü benimsedikleri nakledilmiştir. Ata ve Said b. CUbeyr'in görüşü de bu doğrultudadır. İbn Battal şöyle demiştir: Sahabe ve belli başlı merkezlerin önde gelen fıkıh bilginleri (fukahu'l-emsar) muhsan olan bir erkeğin kasten, bile bile, kendi tercihiyle zina ettiği takdirde ona recm cezası uygulanacağı noktasında görüş birliği etmişlerdir. Hariciler ile bazı Mutezile bilginleri bu görüşü kabul etmezler. Onlar buna gerekli olarak recmin Kur' an' da zikredilmediğini ileri sürmüşlerdir. İbnü'l-Arabı Mağriblilerden karşılaştığı bir zümrenin de bu görüşte olduklarını nakletmiştir. Sözkonusu zümre Haricilerin kalıntılarıdır. Çoğunluğu oluşturan fıkıh bilginlerinin delili ise Nebi Sallallahu Aleyhi ve Sellem'in ve kendisinden sonraki imamların recm cezasını uygulamış olmasıdır. Bundan dolayı Hz. Ali yukarıdaki hadisin baş tarafında \"Bu kadını ResuluIlah Sallallahu Aleyhi ve Sellem'in sünnetiyle recm ettim\" demiştir. Müslim'in Sahih'inde Ubade'nin nakline göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Hükümleri benden alınız. Allahu Teala o kadınlar için bir yol belirlemiştir. Dul dulla zina ettiğinde cezası recmdir.\" (Müslim, \"Hudud) Bu hadis, ileride zinadan hamile kalan kadının recmi konusunda gelecektir. \"Kızkardeşiyle zina eden kişinin cezası, zina edene uygulanan cezadır.\" İbn Ebi Şeybe'nin nakline göre meşhur tabıun alimi Cabir b. Zeyd Ebü'ş-Şa'sa, evlenmesi haram olan bir kadınla (mahrem) zina eden kişi hakkında \"Onun boynu vurulur\" demiştir. Hz. Ali'nin \"Bu kadını Resulullah Sallallahu Aleyhi ve Sellem'in sünneti ile recm ettim\" şeklindeki ifadesi de buna delalet etmektedir. Çünkü Hz. Ali zinanın mahrem olan veya olmayan bir kadınla yapılıp yapılmaması arasında fark gözetmemiştir. İmam Buhari, mahremiyle zina eden kişinin katledilmesi şeklinde gelen haberin zayıflığına işaret etmiştir. \"Bu kadını Resulullah Sallallahu Aleyhi ve Sellem'in sünneti ile recm ettim.\" el-Hazimı şöyle demiştir: Ahmed b. Hanbel, İshak, Oavud, İbnü'l-Münzir, zina eden muhsan kişiye önce sapa cezası tatbik edileceği, sonra recm edileceği kanaatini benimsemişlerdir. Çoğunluğu oluşturan fıkıh bilginleri -bu görüş Ahmed b. Hanbel'den de rivayet edilmiştir- hem sapa, hem recm birlikte uygulanmaz demişlerdir. Bu bilginler Ubade hadisinin mensuh olduğunu söylemişlerdir. Ubade hadisi ile Müslim'in \"Dul, dulla zina ettiğinde yüz sapa vurulup recm edilir. Bekar, bekarla zina ettiğinde yüz sapa vurulur ve sürgün cezası uygulanır\" (Müslim, \"Hudud) hadisini kastetmektedirler. Bu hadisi nesh eden ise -Maiz alayında belirtildiği üzere- Nebi Sallallahu Aleyhi ve Sellem'in onu recm etmesidir. Söz konusu hadiste Maiz'e sapa cezası vuruldu ğu zikredilmemektedir. İmam Şafil şöyle der: Sünnet, be kar olan kişiye sapa cezası uygulanırken, dulolana uygulanmayacağını göstermiştir. Maiz olayının Ubade hadisinden daha sonra olduğuna delil ise Ubadehadisinin zina eden kişinin evlerde hapsedileceği yolunda yapılan ilk uygulamayı nesh ettiğidir. Zina edenin evlerde hapsedilmesi hükmü, sopa cezası hükmüyle nesh edilmiştir ve hadis dulolup, zina edene recm cezası eklemiştir. Bu, Ubade hadisinde gayet açık ve nettir. Sonra sopa cezası dul hakkında nesh edilmiştir. Bu hüküm Maiz olayında sadece recmle yetinilmesi uygulamasından alınmıştır. Aynı şey el-Gamidiyye, el-Cühenıyye ve iki Yahudi olayında da yapılmıştır. Bu olaylarda recm cezasıyla birlikte sopa vurmadan söz edilmemiştir. İbnü'l-Münzir şöyle der: İmam Şafil bunların bazılarına itiraz etmiş ve şöyle demiştir: Sopa cezası Allah'ın kitabında, recm ise -Hz. Ali'nin dediği gibi- Resulullah Sallallahu Aleyhi ve Sellem'in sünnetinde yer almaktadır. Ubade hadisinde bu iki uygulama birlikte yer almış ve Hz. Ali buna göre amel etmiş, Ubey de ona katılmıştır. Maiz olayı ile onunla birlikte zikredilen diğer ceza uygulamalarında recm edilen kişiden sopa cezasının düştüğüne dair açık bir ifade yoktur. Çünkü bu, açık ve net olup, temel prensip olduğu için zikredilmemiş olabilir. Açıkça ifade edilmiş olan bir şey, ihtimale açık bir hükümle reddedilemez. \"en-Nur suresinin inmesinden önce mi, yoksa sonra mı recm etti?\" Bu sorunun yararı şudur: Recm cezası en-Nur suresinin inmesinden önce uygulanmışsa eş-Şeybanl'nin -ayette zina cezası olarak sopadan söz edilmesi dolayısıyla- recm uygulamasının nesh edildiğini iddia etmesi imkan dahiline girer. Şayet bu surenin inmesinden sonra uygulanmışsa sopa cezasının muhsan açısından nesh edildiğine bunu delil göstermesi mümkündür. Fakat burada kendisine bu durumda Kur'an'ın sünnetle nesh edildiği şeklinde bir itiraz gelebilir. Kur'an'ın sünnetle neshi ise ihtilaflıdır. Bu yaklaşıma şöyle cevap verilmiştir: Kabul edilmeyen, Kur'an'ın ahad yolla gelen sünnetle nesh edilmesidir. Meşhur sünnete gelince, bunda herhangi bir engel yoktur. Öte yandan ortada bir nesih de mevcut değildir. Yapılan sopa cezasının muhsanolmayanlara tahsisinden ibarettir. \"Abdullah b. Ebu Evfa bunu bilmiyorum dedi.\" Bu sözün ne anlama geldiği birkaç başlık sonra gelecektir. Recm uygulamasının en-Nur suresinden sonra yapıldığına delil mevcuttur. Zira en-Nur suresi, ifk olayı üzerine inmiştir. Bilginler daha önce de değindiğimiz üzere bu olayın hicretin dört veya beş ya da altıncı yılında meydana geldiği noktasında ihtilaf etmişlerdir. Recm uygulaması bundan sonra olmuştur. Bu uygulama sırasında Ebu Hureyre oradaydı. O, hicretin yedinci yılında Müslüman olmuştu. İbn Abbas ise annesiyle birlikte Medine'ye hicretin dokuzuncu yılında gelmiştir",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 6816,
			"arabicnumber": 6816,
			"text": "",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 6817,
			"arabicnumber": 6817,
			"text": "Aişe r.anha'nın nakline göre Sa'd b. Ebi Vakkas ile Abd b. Zem'a (bir çocuğun nesebi hakkında) anlaşmazlığa düştüler ve davalarını Nebi Sallallahu Aleyhi ve Sellem' e arz ettiler. Resulullah Sallallahu Aleyhi ve Sellem \"Ey Abd b. Zem'a! Çocuk kimin döşeğinde dünyaya gelmişse onundur. Ey Sevde! Sen de bu çocuğun karşısında tesettürde bulun\" buyurdu",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 6818,
			"arabicnumber": 6818,
			"text": "Ebu Hureyre'nin nakline göre Nebi Sallallahu Aleyhi ve Sellem\" Çocuk kimin döşeğinde dünyaya geImişse onundur ve zina eden için ancak mahrumiyet vardır\" buyurmuştur. Fethu'l-Bari Açıklaması: İmam Buhari bu konuda Zem'a'nın oğlunun oğlu olayı hakkında Aişe r.anha hadisine yer vermiştir. Bu hadisin açıklaması Feraiz bölümünün sonlarında geniş bir şekilde yapılmıştı. Hadisin burada başlık olarak kullanılması, İmam Buharl'nin hadiste geçen \"el-hacer\" kelimesi için zina edene atılan taş anlamını tercih ettiğine işaret etmek içindir. Bu konu daha önce geçmişti. Bundan maksat, recmin her zina edene değil, şartlarını taşıyan kişilere yapılacağını vurgulamaktır",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 6819,
			"arabicnumber": 6819,
			"text": "İbn Ömer şöyle anlatmıştır: Nebi Sallallahu Aleyhi ve Sellem'e birbiriyle zina etmiş olan bir Yahudi erkekle, kadın getirildi. Resulullah Sallallahu Aleyhi ve Sellem onlara \"Sizler kitabınız Tevrafta zina edenler için ne cezası buluyorsunuz?\" diye sordu. Yahudiler \"Bizim alimlerimiz, zina edenin yüzünü kömürle karartma ve bir eşek üzerine (yüzleri birbirine gelecek şekilde) ters bindirme bid'atını Çıkardılar\" diye cevap verdiler. Abdullah b. Selam \"Ya Resulallah! Onlara Tevrat'ı getirmelerini emret!\" dedi. Tevrat getirildi. Yahudilerden biri elini recm ayeti üzerine koyup onun öncesini ve sonrasını okumaya başladı. Abdullah b. Selam ona \"Kaldır elini!\" dedi. Bir de baktılar ki recm ayeti elinin altındadır. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem zina eden o iki kimsenin recm edilmesini emretti ve onlar recm edildiler. İbn Ömer \"Zina eden o erkekle kadın, mescidin yanında düz taşlarla döşenip, kaplanmış olan balat denilen yerde recm edildiler. Ben erkek yahudinin kadını taşlardan korumak için üzerine kapandığını gördüm\" demiştir. Fethu'l-Bari Açıklaması: Hadiste geçen \"Balat\", Nebi Sallallahu Aleyhi ve Sellem mescidinin kapısı yanında taşlarla döşenmiş yerin adıdır. Nitekim \"balat denilen yerde recm edildiler\" ifadesi bu yaklaşımı teyid etmektedir. İbn Battal yukarıda başlık olarak kullanılan cümlede sorun olduğunu ileri sürerek şöyle demiştir: Bu konuda Nebi s.a.v. mescidinin kapısı yanındaki taş döşeli yerle bir başkası arasında fark yoktur. İbnü'l-Müneyyir buna şöyle cevap vermiştir: İmam Buhari bu başlıkla recm cezasının herhangi bir belirli mekana mahsus olmadığına dikkat çekmek istemiştir. Zira recm emri bazen namazgahta, bazen bir başka taşlık yerde verilmiştir. İbnü'l-Müneyyir şöyle devam etmiştir: İmam Buharl'nin bu başlığı atmakla recm cezası uygulanacak kimseler için çukur kazmanın şart olmadığına dikkat çekmek istemiş olabilir. Çünkü taşlık mekana çukur kazılamaz. İbnü'l-Kayyim de bunu vurgulamıştır. \"Tahmimu'l-vecih=yüzünü karartma\", kişinin üzerine külle karışık kaynar su dökülmek suretiyle yapılır. Bundan maksat, kişinin yüzünü kömürle karartmak demektir. Hadiste yer alan \"teebiye\" ise kişiyi hayvana ters bindirmek demektir. lyaz şöyle demiştir: Tecbiye kelimesi şöyle açıklanmıştır: Zina eden erkekle kadına sopa cezası uygulanır, yüzleri karartılır ve bir hayvan üzerine yüzyüze ve ters bindirilir. Bu konuda itimat edilecek olan görüş Ebu Ubeyde'nindir. Ona göre tecbiye, zina eden kişi ayakta olduğu halde ellerini dizleri üzerine koyar ve rüku eder bir konuma girer. Aynı şekilde secde eder gibi yüz üstü kapaklanır. \"Ben Yahudinin kadını taşlardan korumak için üzerine kapandığını gördüm.\" İbnü'l-Katta şöyle demiştir: \"Cenee ale'ş-şey'i\" sırtını onun üzerine eğdi demektir",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 6820,
			"arabicnumber": 6820,
			"text": "Cabir b. Abdullah şöyle demiştir: Eslem kabilesinden bir kişi Nebi Sallallahu Aleyhi ve Sellem'e gelerek zina ettiğini itiraf etti. Resulullah Sallallahu Aleyhi ve Sellem ondan yüz çevirdi. Adam kendi aleyhine dört kez şehadet edince, Resulullah Sallallahu Aleyhi ve Sellem \"akıl hastalığı var mı?\" diye sordu. O kişi \"hayır\" dedi. Resulullah Sallallahu Aleyhi ve Sellem \"Muhsan mısın?\" deyince, adam \"evet (evliyim)\" dedi. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem O kişinin recm edilmesini emretti ve o musallada recm edildi. Taşlar kendisine isabetedip, acıtınca adam kaçmaya başladı. Ancak kendisine yetiştiler ve ölünceye kadar taşlandl. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem O kişiyi hayırla yad etti ve cenaze namazını kıldırdl. Fethu'l-Bari Açıklaması: İmam Buharl'nin kullandığı başlıktan maksat namazgahın yanında recm demektir. Hadiste geçen musalladan kastedilen ise bayram ve cenaze namazlarının kılındığı namazgah demektir. Burası Cennetu'I-Bakl mezarlığı tarafında bulunuyordu. \"Nebi Sallallahu Aleyhi ve Sellem O kişiyi hayırla yad etti.\" Yani ondan güzellikle bahsetti. Müslim' de yer alan Büreyde hadisine göre insanlar Maiz recm edildikten sonra iki gruba ayrıldılar. Bazıları \"O helak olup gitti. Günahı kendisini çepeçevre kuşattı\" derken, bazıları \"Maiz'in tövbesinden daha üstün bir tövbe yoktur\" dediler. Aradan üç gün geçtikten sonra Nebi Sallallahu Aleyhi ve Sellem geldi ve şöyle dedi: \"Maiz b. Malik'e istiğfar ediniz. \"(Müslim, Hudud) Yine Büreyde'nin bir başka nakline göre Nebi Sallallahu Aleyhi ve Sellem \"Maiz öyle bir tövbe etti ki ümmete taksim edilse herkese yeterdi\" buyurmuştur. Fıkıh bilginleri bu meselede ihtilaf etmişlerdir. İmam Malik \"Yetkili makam (devlet başkanı) zina eden kimsenin recm edilmesini emreder. Bizzat kendisi yapmaz. Ölünceye kadar taşlamaya ara verilmez. Öldüğünde yıkamaları ve namazını kılmaları için cenaze ailesine verilir. Masiyet işleyen kimseler, recmedilerek öldürüleni namazı kılınmaz kimselerdendir diye biliyorlarsa devlet başkanı onları caydırmak ve o fiili işlemeye cüretlerini kırmak maksadıyla onun namazını kılmaz. Maliki alimlerinden biri şöyle demiştir: Devlet başkanı recm edilip ölen kimsenin cenaze namazını kılabilir. İmam Malik'ten nakledilen meşhur görüşe göre devlet başkanının ve fazilet ehli kimselerin recm edilerek öldürülmüş olan kimsenin namazını kılmaları mekruhtur. Ahmed b. Hanbel'in görüşü de bu doğrultudadır. İmam Şafil'ye göre ise devlet başkanı ve faziletli kimselerin böyle bir kişinin namazını kılmaları mekruh değildir. Bu aynı zamanda çoğunluğun da görüşüdür. Bir rivayete göre Zührı, recm edilerek öldürülenle intihar edenin cenaze namazı kılınmaz demiştir. [yaz mutlak konuşmuş ve şöyle demiştir: Bilginler fasık, masiyet ehli kişilerle, had cezası neticesinde öldürülmüş olanların cenaze namazıarının kılınabileceği konusunda ihtilaf etmemişlerdir. Ancak bazı bilginler fazilet ehli kimselerin bu kişilerin namazını kılmalarını mekruh görmüştür. İmam Ebu Hanıfe, hirabe suçu işleyip, öldürülenlerin cenaze namazı kılınmaz derken, Hasan-ı Basri zinadan çocuk doğurup, loğusa iken ölen kadının cenaze namazı kılınmaz demiştir. Fasık, masiyet işlemiş ve had cezaları uygulaması neticesi ölmüş kimselerin cenazelerinin kılınacağı hükmüne Zührı ve Katade de muhalif kalmışlardır. [yaz şöyle demiştir: Yukarıda Gamidiyye olayı hakkında zikredilen hadis, çoğunluğa delil teşkil etmektedir. Doğruyu en iyi Allahu Teala bilir]",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 6821,
			"arabicnumber": 6821,
			"text": "{Ebu Hureyre r.a.'in nakline göre bir adam Ramazan ayında oruçlu iken hanımı ile cins'?} ilişkide bulundu. Sonra Resulullah Sallallahu Aleyhi ve Sellem'e gelip, bunun hükmünü sordu. Nebi Sallallahu Aleyhi ve Sellem ona \"Bir köle bulabilir misin?\" diye sordu. Adam \"hayır (bulamam)\" dedi. Resulullah Sallallahu Aleyhi ve Sellem \"İki ay peşpeşe oruç tutabilir misin?\" diye sordu. Adam \"hayır\" deyince, Resulullah Sallallahu Aleyhi ve Sellem \"Öyle ise altmış fakiri doyur\" buyurdu",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 6822,
			"arabicnumber": 6822,
			"text": "Aişe r.anha'nın nakline göre Resulullah Sallallahu Aleyhi ve Sellem mescidde iken yanına bir adam geldi ve \"yandım\" dedi. Resulullah Sallallahu Aleyhi ve Sellem \"Neden yandın?\" dedi. Adam \"Ramazanda oruçlu iken eşi ml e cinsel ilişkide bulundum\" dedi. Nebi Sallallahu Aleyhi ve Sellem Efendimiz Sallallahu Aleyhi ve Sellem \"tasadduk et\" buyurdu. Adam \"Benim yanımda (tasadduk edecek) hiçbir şey yoktur\" dedi ve orada oturdu. O sırada Nebi Sallallahu Aleyhi ve Sellem'e bir kişi üzerinde yiyecek bir şey bulunan bir eşeği sürerek geldi. Abdurrahman, ben o yiyecek şeyin ne olduğunu bilmiyorum dedi. Hadisin konumuzIa ilgili olan son kısmı şöyledir: Nebi Sallallahu Aleyhi ve Sellem \"O yanan adam nerededir?\" diye seslendi. Adam \"O benim, işte buradayım\" dedi. Resulullah Sallallahu Aleyhi ve Sellem \"Bunu al ve tasadduk et\" dedi. Adam \"Benden daha muhtaç olana mı? Benim ailemin yiyecek hiçbir şeyi yoktur\" dedi. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem \"Öyleyse bunu sizler yiyin\" buyurdu. Fethu'l-Bari Açıklaması: İmam Buharl'nin kullandığı başlıkta işlenen günahın \"hadten daha hafif\" olarak nitelenmesi, işlediği günah had cezasını gerektiren bir kimseye -tövbe etmiş bile olsa- ceza verilmesini gerektirmektedir. Bu konudaki ihtilaf Hudıld bölümünün baş taraflarında geçmişti. Ata \"Nebi Sallallahu Aleyhi ve Sellem öyle bir kimseye ceza vermedi demiştir.\" Yani bir günah işlemiş olduğunu haber veren kimseyi Resulullah Sallallahu Aleyhi ve Sellem mühlet vermeksizin cezalandırmamıştır ve ona kıldığı namazın günahlarına kefaret olduğunu bildirmiştir. \"İbn Cüreyc'in ifadesine göre Nebi Sallallahu Aleyhi ve Sellem Ramazanda eşiyle ilişkiye girdiğini söyleyen kişiye ceza vermemiştir. Bu hadisin açıklaması Savm / Oruç bölümünde genişçe yapılmıştı. \"Hz. Ömer de ihramlı olduğu halde ceylan avlayan kimseye ceza uygulamamıştır. \" İmam Buhari bu ifadesiyle İmam Malik' in munkatı olarak zikrettiği ve Said b. Mansur'un sahih bir isnadla Kubaysa b. Cabir'den naklettiği şu habere işaret ediyor gibidir: Hac yapmak üzere yola çıktık. Sonra karşımıza bir ceylan çıktı. Ben ona bir taş attım ve öldü. Mekke'ye geldiğimizde bunu Hz. Ömer'e sorduk. O da Abdurrahman b. Avf'a sordu. Sonra her ikisi bu konuda ceza olarak bir keçi kurban etmemiz gerektiğine hükmettiler. Ben \"mu'minierin emiri ne diyeceğini bilmediği için başkasına sordu\" dedim. Hz. Ömer bana kamçısını çekerek \"Harem bölgesinde av öldürüp, sonra hakemin ehliyetsiz olduğunu mu söylüyorsun?\" dedi. Sonra devamla Allahu Teala 'İçinizden adalet sahibi iki kişi hükmeder'(Maide, 95) buyurmaktadır. Bu Abdurrahman b. Avf'tır, ben de Ömer' im\" dedi. Bu hüküm Buharl'nin attığı başlıktaki had suçundan hafif günah işleyenlere ceza verilemeyeceği ifadesiyle çelişmez. Hz. Ömer'in ona kamçısını çekmesi, verilen hükme dil uzatmasından dolayıdır. Aksi takdirde sözkonusu Hil işlendi diye ona ceza vermek gerekli olsaydı, Hz. Ömer bunu asla ertelemezdi",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 6823,
			"arabicnumber": 6823,
			"text": "Enes b. Malik r.a. şöyle demiştir: Nebi Sallallahu Aleyhi ve Sellem'in yanında bulunduğum bir sırada bir adam çıkageldi ve \"Ya Resulallah! Ben had cezası gerektirecek bir suç işledim. Bana cezasını uygulama!\" dedi. Nebi Sallallahu Aleyhi ve Sellem O adama işlediği günahın ne olduğunu sormadı. Bu sırada namaz vakti geldi. O adam Nebi Sallallahu Aleyhi ve Sellem Efendimizle birlikte namaz kıldı. Resulullah Sallallahu Aleyhi ve Sellem namazı bitirince aynı kişi Nebi Sallallahu Aleyhi ve Sellem'e doğru yöneldi ve \"Ya Resulallah! Ben had cezası gerektirecek bir günah işledim. Bana Allah'ın kitabını uygula\" dedi. Nebi Sallallahu Aleyhi ve Sellem \"Sen şimdi bizimle birlikte namaz kılmadın mı?\" dedi. Adam \"evet\" diye cevap verdi. Resulullah Sallallahu Aleyhi ve Sellem \"Şüphesiz ki Allah senin lehine günahını -yahut cezanı- bağışlamıştır\" buyurdu. Fethu'l-Bari Açıklaması: İmam Buharl'nin başlığında geçen \"....' lem yubeyyin\" açıklamadı anlamına gelir. Hadis metnindeki\" .......' lem yes'elhu anhu\" ise, açıklamasını istemedi, demektir ... \"Sen şimdi bizimle birlikte namaz kılmadın mı?\" Ümame'nin rivayetine göre Resulullah Sallallahu Aleyhi ve Sellem \"Evinden çıktığında abdest alıp, onu da güzelce almadın mı?\" diye sormuş o kişi de \"evet, aldım\" diye cevap vermiştir. Resulullah Sallallahu Aleyhi ve Sellem \"Sonra bizimle birlikte namazda bulunmadın mı?\" demiş Adam \"evet, bulundum\" cevabını vermiştir. \"Şüphesiz ki Allah senin lehine günahını -yahut cezanı- bağışlamıştır.\" Bilginler bu meselenin hükmü konusunda ihtilaf etmişlerdir. İmam Buharl'nin attığı başlığın zahiri, onun bunu \"Bir kimse haddi gerektiren bir suç işlediğini ikrar eder ve ne olduğunu açıklamazsa\" şeklinde yorumladığinl göstermektedir. Bu durumda devlet başkanının (yetkili makamın) suçu işleyen kişi tövbe ettiği takdirde kendisine ceza uygulaması gerekli değildir. Hattabl'nin anlayışına göre ise Nebi Sallallahu Aleyhi ve Sellem vahiy yoluyla o kişiyi Allahu Teala' ın bağışlamış olduğunu öğrenmiş olabilir. Çünkü işlenen suç belirli bir olaydır. Aksi takdirde o kişinin işlediği suçu soruşturur ve kendisine had cezasını uygulardı. Hattabi bir de şunu söylemiştir: Bu hadisten anlaşıldığına göre had cezası gerektiren fiiller açığa dökülmez, aksine mÜİnkün mertebe gizlenir. Nebi s.a.v.'e gelen kişi kendisine had cezası uygulamak gereken bir fiili açığa çıkarmamıştır. Belki de günahı küçük bir mı işlemiş, ama kendisi bunun had uygulamak gereken büyük bir günah olduğunu zannetmiştir. Resulullah Sallallahu Aleyhi ve Sellem de ona bunu açıklamamıştır. Zira haddin gereği olan ceza, ihtimale açık olduğu takdirde sabit olmaz. Hz. Peıgamber Sallallahu Aleyhi ve Sellem'in kendisine gelen o kişiye işlediği suçun ne olduğunu sormaması, ya bunun yasak olan gizlilikleri araştırma (tecessüs) fiiline girmesindendir ya da o kişinin fiilini örtmeyi tercih etmesi ve kişinin kendisine had cezası uygulanmayı istemesinin pişman olduğu ve günahtan döndüğü anlamını taşıdığını düşünmesindendir. Bilginler had uygulamak gereken bir günahı işlediğini ikrar eden kimseye ikrarından dönme telkini yapılmasını güzel görmüşlerdir. Bu telkin ya üstü kapalı yapılır ya da had cezasının düşmesi için bundan daha açık ve net yapılır. İmam Nevevi' ve bir grup fıkıh bilgini, Nebi s.a.v.'e gelen kişinin işlediği günahın küçük günahlardan olduğu kanaatine varmışlardır. Onların delili hadisin devamında o kişinin kıldığı namazın günahına kefaret olduğunun bildirilmesidir. Zira namazın kefaret olduğu günahlar, büyük değil, küçük günahlardır. En çok ve yaygın olan da günahın bu türüdür. Namaz bazen büyük günahlara da kefaret olabilir. Mesela bir kimse çok nafile namaz kılar ve bunlar birçok küçük günahın bağışlanmasına vesile olabilecek çoklukta olur. Ancak o kişinin küçük günahı ya hiç bulunmaz veya çok az bulunur, buna karşılık bir büyük günahı bulunur. İşte kıldığı namazıar, o günahına kefaret olur. Çünkü Allahu Teala güzel amel işleyen kimsenin ecrini ve sevabını zayi etmez. el-Huda müellifi yukarıdaki haberin zahirini esas almış ve şöyle demiştir: Bilginler yukarıda zikredilen Ebu Ümame hadisi açısından üç farklı kanaati benimsemişlerdir. Bunlardan birincisine göre had cezası, tam olarak belirlendikten ve işleyen kişinin bunu ısrarla ikrarından sonra gereklidir. İkincisine göre ise bu uygulama, yukarıdaki olayda adı geçen kişiye özel bir durumdur. Üçüncüsü ise had cezası tövbe ile düşer. Aynı müellif şöyle demiştir: Bu, sayılan üç yolun en sahih olanıdır. el-Hüda müellifi bu görüşün daha güçlü olduğunu şu anlayışa dayandırmıştır: O kişinin sırf Allah korkusuyla kendi isteği ile suçunu itiraf etme şeklinde yapmış olduğu gÜzel amel, daha önce işlemiş olduğu kötülüğe karşı durur. Çünkü hadlerin hikmeti, insanları o suçu işlemekten caydırmaktır. Suçu işleyen kimsenin bu şekilde davranması onun bu suçtan vazgeçtiğini gösterir. Dolayısıyla ondan had cezasını kaldırmak uygun düşmüştür. Doğruyu Allahu Teala bilir",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 6824,
			"arabicnumber": 6824,
			"text": "İbn Abbas r.a. şöyle demiştir: Maiz b. Malik, Nebi Sallallahu Aleyhi ve Sellem'e getirilince, Efendimiz Sallallahu Aleyhi ve Sellem ona \"Belki öpmüşsündür yahut ellemiş ya da bakmışsındır?\" dedi. Maiz \"Hayır Ya Resulallah!\" dedi. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem herhangi bir kinayeli sözcük kullanmayarak açıkça \"Sen onunla cinsel ilişkiye girdin mi?\" diye sordu. İbn Abbas şöyle der: Maiz zina ettiğini açıkça ikrar edince, Nebi Sallallahu Aleyhi ve Sellem recm edilmesini emretti. Fethu'l-Bari Açıklaması: İmam Buharl'nin atmış olduğu bu başlık, devlet başkanının (yetkili makamını had suçunu ikrar eden kişiye bu cezayı kendisinden savuşturacak şeyi telkin etmesinin caiz olduğunu vurgulama amaçlıdır. Bazı bilginler bu uygulamanın devlet başkanının zina kelimesini kullanırken hata ettiğini veya anlamını bilmediğini düşündüğü kimselere mahsus olduğunu söylemişlerdir. ....... Lealleke kabbeite\" yani belki o kadını öpmüşsündür, \"......\" ev ğamezte\" yani gözünle veya elinle işaret etmişsindir ya da elinle dokunmuş veya ellemişsindir demektir)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 6825,
			"arabicnumber": 6825,
			"text": "Ebu Hureyre r.a. şöyle anlatmıştır: Nebi Sallallahu Aleyhi ve Sellem'e mescidde bulunduğu bir sırada adamın birisi çıkageldi ve ona seslenerek \"Ya Resulallah! Ben zina ettim\" dedi. Adam bununla kendini kastediyordu. Resulullah Sallallahu Aleyhi ve Sellem ondan yüz çevirdi. Bu sefer o adam Resulullah Sallallahu Aleyhi ve Sellem'in yüzünü çevirdiği yöne geçerek yine \"Ya Resulallah! Ben zina ettim\" dedi. Nebi Sallallahu Aleyhi ve Sellem ondan yine yüz çevirdi. O da yine ResuluIlah Sallallahu Aleyhi ve Sellem'in yüzünü döndürdüğü tarafa geçti, bu itirafını tekrarladı. Nihayet kendi aleyhine dört kere şehadet edince Nebi Sallallahu Aleyhi ve Sellem Efendimiz onu çağırdı. \"Sende akıl hastalığı var mı?\" diye sordu. Adam \"hayır yoktur Ya Resulallah!\" dedi. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem \"Sen muhsan mısın\" diye sordu. O kişi \"evet, muhsanım\" diye cevap verdi. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem yanında bulunanlara \"Bunu götürün ve recm edin\" buyurdu",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 6828,
			"arabicnumber": 6828,
			"text": "",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 6829,
			"arabicnumber": 6829,
			"text": "Abdullah b. Abbas'ın nakline göre Hz. Ömer şöyle demiştir: Uzun bir zaman sonra bazı kimselerin \"Biz Allah'ın kitabında recm cezasını bulmuyaruz\" demesinden ve böylece Allah'ın indirmiş olduğu bir farızayı terk etmek suretiyle sapmalarından endişe etmişimdir. Dikkat edinizi Evli olduğu halde zina eden kimse üzerine buna dair bir beyyine bulunduğu yahut gebelik veya itiraf olduğunda recm cezası sabit olmuş bir haktır. Süfyan b. Uyeyne: Ben bunu böylece ezberledim dedikten sonra Ömer \"Dikkat edin! Resulullah Sallallahu Aleyhi ve Sellem recm yaptı, ondan sonra da biz yaptık\" dedi, demiştir. Fethu'l-Bari Açıklaması: İmam Buhari \"Zina İtirafı\" başlığını yukarıya aldığımız iki hadiste \"itiraf\" kelimesi yer aldığı için kullanmıştır. Maiz olayının açıklamasında zina ikrarının tekrarlanmasının şaıt olup olmadığı incelenmişti. Bir kez yapılan ikrara ceza uygulanacağı kanaatini taşıyan bilginler bu hadisteki itirafın mutlak olarak yer almasına dayanmışlardır. Maiz kıssasında zina itirafının tekrarlanması bu haberle çelişmez. Çünkü bu olay -daha önce geçtiği üzere- özel bir uygulamadır. \".......'' Enşudukellahe\" yani Aııah adına sana soruyorum demektir. \"........' Kane aslfen ala haza\" Bu ikinci işaret, şikayette bulunan davacının -hasmına yöneliktir. Bu kişi zina eden kadının kocasıdır. Şuayb rivayetinde \"el-asıf el-edr = ücret karşılığı hizmetçi\" tabirini kullanmıştır. Bu açıklama, habere dışarıdan katılmıştır. \"Yüz koyun ve hizmetçi.\" Hizmetçiden maksat, hizmet için tahsis edilen cariye demektir. \"Oğluna da yüz değnek vurulacak ve bir yıl sürgüne gönderilecek.\" Nevevi bunu Nebi Sallallahu Aleyhi ve Sellem'in bu şekilde hüküm vermesinin nedeni o çocuğun bekar olduğunu bilmesi ve zinayı itiraf etmesi dolayısıyladır diye açıklanmıştır. Hadisten Çıkan Sonuçlar 1. Bir olayı hükme bağlarken gerek nassa (ayet veya hadis) bakma, gerekse hüküm çıkarma (istinbat) şeklinde olsun Allah'ın kitabına başvurmak gerekir. 2. Bir meseleyi pekiştirmek için onun üzerine yemin etmek caizdir, 3.Yemin verilmediği halde yemin etmek de mümkündür. 4. Nebi s.a.v. güzel ahlak sahibi idi ve kendisine aksinin daha evla olduğu bir tarzda hitap eden kişiye sabırlı davranırdl. 5. \"Aramızda hakka göre hüküm ver\" şeklinde hitapta bulunan kimseye canı sıkılmayan hakim örneğinde olduğu gibi Nebi s.a.v.'in yolundan giden hakimler övülür. Beydavi şöyle demiştir: Kadının kocasıyla çocuğun babasının Nebi s.a.v.'in Allah'ın hükmünden başka bir şekilde hükmetmeyeceğini bilmelerine rağmen Allah'ın kitabına göre hüküm vermesini istemek üzere gelmeleri, Resulullah s.a.v.'in aralarında hüküm verirken -karşılıklı sulh yoluyla veya dostane olanı tercih etme şeklinde değil- hak neyse ona göre hüküm vermesi içindir. Çünkü hüküm veren hakim tarafların rızasıyla sulh yoluyla veya dostça olanı tercih etme şekilde hüküm verebilir. 6. Büyüklere hitap ederken güzel edep, dava görülürken davalı kişi daha sonra gelmiş bile olsa sözü ona vermeyi gerektirir. 7. Devlet başkanı (yetkili makam) dava esnasında taraflar birlikte gelmiş ve onlardan her birinin davacı olması mümkün bile olsa dava görülürken aralarından dilediğine söz verebilir. 8. Davacının hakimden, fetva soranın alimden konuşmak için izin alması müstehabtır. 9. Had cezasını gerektiren bir suçu itiraf eden kimseye -kendisine ortak olan kişi bunu itiraf etmese bile- devlet başkanının (yetkili makamın) gerekli cezayı uygulaması gereklidir. 10. İnsanların içine çıkmayı adet haline getirmemiş, hep evde oturan bir kadın (muhaddere) duruşma meclisine gelmekle yükümlü tutulamaz. Tam tersine böyle bir kadının lehine veya aleyhine hükmedecek bir şahıs göndermek caizdir. Nesa! bu konu için eserinde bir başlık kullanmıştır. 11. Hüküm isteyen davacı, dava konusu olayda neler yaşanmışsa tümünü dile getirmelidir. Çünkü müftü veya hakim anlatılanlardan o mesele ile ilgili hükmü verecek bir takım ipuçları elde edebilir. Zira Nebi s.a.v.'e gelen kişi \"Benim oğlum bu adamın yanında ücretli çalışıyordu\" demiştir. Çocuğun babası zinanın hükmünü sormak üzere gelmişti. Bunun arkasında yatan sır şuydu: Baba oğlu için herhangi bir bahane ve mazaret ortaya koymak istiyordu. Oğlunun zina yapmakla meşhur olmadığını, mesela kadına saldırmadığını, onu zinaya zorlamadığını, bunun daha fazla kaynaşma ve nazlanma sonucunu doğuran uzun süre birlikte bulunma neticesinde meydana geldiğini ileri sürmek istiyordu. Buradan yabancı bir erkekle kadının mümkün mertebe birbirlerinden uzak tutulmalarına teşvik olduğu anlaşılmaktadır. Zira birlikte bulunmak bazen fesada götürür ve şeytan kadını kullanarak kişiyi fesada düşürür. 12. Daha üstün pozisyonda olan varken böyle olmayanın fetva istemesi caizdir. Bu hadis mesela sahabi varken tabiOndan birisinin fetva veremeyeceğini söyleyen kimseye de açık bir redtir. 13. Sahabiler Nebi s.a.v.'in döneminde ve onun bulunduğu beldede fetva veriyorlardı. 14. Had cezası fidye kabul etmez. Bu hüküm zina, hırsızlık, hirabe ve sarhoşluk verici madde içme açısından bilginlerin üzerinde görüş birliğine vardıkları husustur. İHete iftira (kazf) suçunda ihtilaf edilmişti( Ancak sahih olanı bu suçun da diğer had suçları gibi olduğudur. Fidye kısasen öldürme ve zarar verilen organa karşılık organı kısas etme suçlarında olduğu gibi bedensel cezalarda geçerlidir. 15. Gayri meşru bir temele dayanan sulh reddedilir ve bu konuda alınan mal geri iade edilir. İbn Dakik el-Id şöyle demiştir: Böylece bazı fıkıh bilginlerinin fasid olan bazı akitler açısından ileri sürdükleri mazeretIerin zayıf olduğu ortaya çıkmaktadır. Bu bilginlere göre ihtilafa düşen iki kişi razı oldukları takdirde ve her biri diğerine tasarruf izni verdiğinde fasid akitler geçerlidir demişlerdir. Oysa gerçek şudur: Tasarrufa izin, sahih akitlerle kayıtlıdır. 16. Had cezasını uygulamada hakimin kendi yerine başka birisini geçirmesi caizdir. 17. Hür olan bir kimseyi kiralamak (ücret mukabili çalıştırmak) caizdir. Bir babanın buna ihtiyaç duyduğu takdirde küçük çocuğunu çalıştırmak isteyen bir kimsenin yanında ücret mukabili çalıştırması caizdir. 18. Zina eden kişilerin durumları birbirinden farklı olduğu halde her birine kendisine uygun olan ceza verilir. Çünkü hadiste ücretli çalışan hizmetçiye sopa cezası verilirken kadın recm edilmiştir. Zina edenlerden birisi hür, diğeri köle olduğunda da hüküm böyledir. Aynı şekilde ergenlik yaşına ermiş bir erkek, bir kız çocuğuyla veya akıllı bir erkek, akıl hastası bir kadınla zina ettiği takdirde ergenlik çağına ermiş erkekle, aklı başında kişiye had cezası uygulanırken, çocuğa ve akıl hastasına uygulanmaz. Bunun aksi durumda da hüküm böyledir",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 6830,
			"arabicnumber": 6830,
			"text": "İbn Abbas r.a. şöyle anlatmıştır: Muhacirlerden birtakım kimselere Kur'an okutuyordum. Bunlardan biri Abdurrahman b. Avf idi. Hz. Ömer'in yaptığı son haccında Mina'da Abdurrahman b. Avf'ın evinde bulunduğum sırada Abdurrahman, Ömer'in yanında imiş. Oradan evine benim yanıma döndü ve şöyle dedi: Bugün mu'minlerin emirinin yanına gelen adamı keşke görseydin! Adam şöyle dedi: Ey mu'minlerin emiri! Filan şahıs hakkında ne düşünürsün? Adam \"Eğer Ömer ölürse ben muhakkak filan kimseye bey'at ederim. Vallahi Ebu Bekir'e yapılan bey'at, ansızın birden bire yapılıp tamam oldu!\" dedi. Ömer bu söze çok öfkelendi, sonra şöyle dedi: \"İnşallah akşamüstü cemaate bir konuşma yapacağım ve milletin mukadderatını gasp etmek isteyenlere karşı onları sakındıracağım.\" Abdurrahman şöyle devam etti: Ben \"Ey mu'minlerin emiri! Böyle yapma! Çünkü hac mevsimi şerde hızlı ve ayak takımı kimseleri bir araya toplar. Cemaate konuşma yapmak üzere ayağa kalktığında bu kimseler sana yakın bir yerde çoğunluğu ele geçirirler. Ben senin kalkıp bu konuda bir konuşma yapmandan ve bunu laf taşıyanların senden alıp, etrafa uçurmasından, duyanların da onu belleyememeleri ve manasını anlamamalarından ve o konuşmayı yakışmayacak birtakım manalara çekmelerinden endişe ederim. Onun için acele etme, Medine'ye dönünceye kadar sabret. Çünkü Medine hicret ve sünnet yurdudur. Orada fakihlerle ve insanların ileri gelenleriyle bir araya gelip söylemek istediğin şeyleri o topluluğa sağlam olaraksöylersin, ilim ehli olanlar senin konuşmanı iyi belleyip kavrarlar ve onu gerektiği şekilde anlarlar. Bunun üzerine Hz. Ömer şöyle dedi: Valiahi inşallah Medine'ye varıp, yapacağım ilk konuşmada bu meseleyi mutlaka ele alacağım! dedi. İbn Abbas şöyle devam etti: Bizler zilhicce ayının sonunda Medine'ye geldik. Cuma günü olunca güneş tam tepe noktasından kaydığı zaman mescide gitmek için acele davrandım. Nihayet Said b. Zeyd b. Amr b. Nufeyl'i minberin köşesinin yanında oturmuşken ben de yanına varıp oturdum. Dizim onun dizine dokunuyordu. Çok geçmeden Hz. Ömer çıkageldi. Onun gelmekte olduğunu görünce Said b. Zeyd b. Amr b. Nufeyl'e \"Ömer bugün öğleden sonra öyle bir konuşma yapacak ki halifeliğe getirildiği günden beri böyle bir konuşma yapmamıştı!\" dedim. Said b. Zeyd benim bu dediklerimi bir anda doğrulamadı ve \"Ömer'in şimdiye kadar bundan önce söylemediği bir konuşma yapacağını nereden çıkarıyorsun!\" dedi. Ömer minber üzerine oturup, müezzinler de ezanları okuyup sükut ettikleri zaman ayağa kalktı. Allah'a hamd edip onu layık olduğu yüce sıfatlarla övdükten sonra \"Sadede gelince ... \" deyip şunları söyledi: \"Sizlere Allah'ın takdir etmiş olduğu bir konuşma yapacağım. Bilmiyorum belki de bu konuşmam benim ecelimden hemen öncedir! Bu konuşmam i kavrayıp, anlayan ve iyi belleyen kimse binitinin ulaştığı her yerde bunu söyleyip yaysın. Akledip, kavramayamayacağından endişe eden kimseye gelince, hiçbir kimseye benim üzerime yalan söylemesini helal etmiyorum. Şüphesiz ki Allah Muhammed'i hak Nebi Sallallahu Aleyhi ve Sellem olarak gönderdi ve ona kitabı indirdi. Allah'ın indirdiği şeyler içinde recm ayeti de vardı. Bizler o ayeti okuduk, akledip anladık ve iyice belledik. Bundan dolayı Resulullah Sallallahu Aleyhi ve Sellem zina edenlere recm uyguladı, ondan sonra biz de zina edenleri recm ettik. Ben aradan uzun zaman geçtikten sonra birisinin çıkıp \"Biz Allah'ın kitabında recm ayetini bulmuyoruz\" demesinden ve Allah'ın indirmiş olduğu bir farizayı terk etmek suretiyle insanların sapıklığa düşmelerinden endişe ediyorum. Recm, Allah'ın kitabında sabit bir haktır. Bu, erkeklerden ve kadınlardan meşru bir evlilik yapıp (muhsan), zina eden, zinası da beyyine ile veya gebelikle ya da itiraf sebebiyle sabit olan kimselere uygulanır. Sonra bizler Allah'ın kitabından okumakta olduğumuz şeyler için de \"Babalarınızdan yüz çevirmeyiniz! Çünkü sizin onlardan yüz çevirmeniz nankörlüktür -veya sizin babalarınızdan yüz çevirmeniz, muhakkak sizin için bir küfürdür\" sözleri de vardı. Dikkat edin! Sonra Resulullah Sallallahu Aleyhi ve Sellem şunu da buyurmuştur: \"Sizler beni, Meryem oğlu İsa'nın övüldüğü gibi övmeyiniz. Benim için 'Allah'ın kulu ve Resulü' deyiniz.\" Sonra içinizden birisi çıkıp, \"Valiahi Ömer ölürse ben muhakkak filan kimseye bey'at ederim\" demiştir. Sakın hiçbir kimse onun \"Ebu Bekir'e yapılan bey' at ancak istişaresiz birden bire yapılıp tamam oldu\" demesine aldanmasın. Dikkat ediniz! Gerçekten o iş böyle çabuk olmuştur. Fakat Allah o işin kötülüğünden ümmeti korumuştur. İçinizden hiçbir kimse, kendisine hızla gidilmek amacıyla develerin telef edilmesine Ebu Bekir' den daha layık değildir. Bundan sonra kim millete danışmadan Müslümanlardan bir adama bey'at ederse onun bey'ati kabul edilmez. O bey' at eden de, bey'at edilen de kendilerini öldürülme tehlikesine atmış olurlar! Şu da bir gerçektir ki Allah, Nebiini vefat ettirdiği zaman bizler Ensarın bize muhalefet ettiği ve tümünün Saide oğulları gölgeliğinde toplandıklarını haber almıştık Ali'yle ZUbeyr ve onların beraberinde bulunanlar da bize muhalefet ettiler. Muhacirler, Ebu Bekir'in yanında toplandılar. Ben Ebu Bekir'e \"Ey Ebu Bekir! Haydi şu Ensar kardeşlerimizin yanına gidelim!\" dedim. Bundan sonra onlara ulaşmak maksadıyla yola koyuldukOniara yaklaştığımızda bizleri aralarından iki salih kişi karşıladı ve toplananların benimseyip, üzerinde ittifak ettikleri görüşü bize bildirdiler ve \"Ey Muhacirler topluluğu! Nereye gitmek istiyorsunuz?\" dediler. Biz de onlara \"Şu Ensar kardeşlerimizin yanına gitmek istiyoruz\" dedik. Bize \"Ensar topluluğuna yaklaşmayınız, siz kendi işinizin hükmünü kendiniz veriniz!\" dediler. Ben de onlara \"Valiahi bizler muhakkak onların yanına gideceğiz!\" dedim ve yola Çıktık, nihayet Saide oğullarının danışmalarda bulundukları gölgelikte Ensar topluluğunun yanına vardık Bir de ne görelim onların arasında bir örtüye bürünmüş bir adam var! Ben \"Bu kimdir?\" dedim. Onlar \"Bu Sa'd b. Ubade'dir\" dediler. Ben \"Onun nesi var?\" dedim. Bana \"Sıtma nöbeti var!\" dediler. Birazcık oturduktan sonra onların hatibi şehadet kelimelerini söyledi ve Allahu Teala'ılayık olduğu yüce sıfatlarla övdü. Bundan sonra \"İmdi, sadede gelince ... \" dedikten sonra şöyle devam etti: \"Bizler Allah'ın Ensarın ve İslamın büyük ordusuyuz. Sizler -ey Muhacirler topluluğu!- Mekke'deki kavminizden bize gelmiş olan az bir topluluksunuz. Hal böyle iken şimdi bu azınlık, bizi aslımızdan koparmak ve bu görevi üstlenmemize mani olmak istiyorlar. Ömer şöyle devam etti: Ensarın hatibi susunca, ben söz almak istedim. Daha önce beğendiğim ve Ebu Bekir'in önünde yapmayı istediğim bir konuşma hazırlamıştım. Ebu Bekir' e gelen öfkenin bir kısmını yatıştırmaya uğraşıyordum. Ben konuşmak istediğim zaman Ebu Bekir bana \"Yavaş ol\" dedi. Ebu Bekir'i öfkelendirmek istemedim. Ebu Bekir kendisi konuşmaya başladı. O öfke sırasında benden daha ağır başlı, daha sakin ve daha vakarlı idi. Vallahi Ebu Bekir benim hazırlamış olduğum konuşmada hoşuma giden her şeyi söyledi. Marifeti sayesinde hazırladığım konuşmanın benzeri veya ondan daha üstün olan bir konuşmayı yaptı ve sonra sustu. Bu konuşmasında şunları söyledi: Kendinizde bulunduğunu ifade ettiğiniz hayra sizler ehilsiniz. Fakat şu halifelik işi Kureyş'ten olan şu Muhacirler topluluğundan başkasına asla tanınmayacaktır. Onlar nesep ve yurt bakımıarından Arapların en ortasıdır. Ben sizler için şu iki kişiden birisine razıyım, bunlardan dilediğiniz birisine bey'at edebilirsiniz. Ömer şöyle devam etti: Bundan sonra Ebu Bekir kendisi aramızda oturmakta bulunduğu halde benim elimi ve Ebu Ubeyde b. Cerrah'ın elini tuttu. Ben onun bu söylediklerinden rahatsız olduğum kadar başka bir sözden utanmamıştı. Vallahi öne geçirilip, boynumun -herhangi bir günahtan dolayı değil- vurulması bana aralarında Ebu Bekir'in bulunduğu bir kavme emirlik yapmaktan daha sevimlidir. Ancak ölümüm esnasında şeytan ın telkini ile nefsimin bunu bana süsleyip güzel göstermesi hali müstesnadır ki ben şu saatte onu vicdanımda hissetmiyar ve bulmuyorum! Bu sırada Ensardan birisi şöyle dedi: Bizler emirlik ağacının faydanılacak olan aslıyız, köküyüz. Yine bizler meyveleri düşmesin diye yapraklarla, dallarla bağlanmış yüklü hurma salkımlarıyız. Bir emir bizden, bir emir sizden olsun ey Kureyş topluluğu! dedi. Bunun üzerine karışık sözler çoğaldı ve sesler yükseldi. Hatta ben bir ihtilaf çıkmasından korktum ve hemen \"Uzat elini ey Ebu Bekir\" dedim. O da elini uzattı. Ben de ona bey' at ettim. Benden sonra Muhacirler ve Ensar Ebu Bekir'e bey' at ettiler. Biz böylece Sa'd b. Ubade'ye karşı çabuk davranıp, galebe sağlamış olduk. Onlardan birisi sizler Sa'd b. Ubade'yi öldürdünüz dedi. Hz. Ömer şöyle devam etti: Bu kişiye karşı ben \"Sa'd b. Ubade'yi Allah öldürdü\" dedim. Bundan sonra Hz. Ömer o Cuma konuşmasının sonunda şunları söyledi: Bizler o zaman Allah'a yemin ederim ki karşı karşıya olduğumuz sorunlar içinde Ebu Bekir'e bey' at etmeden daha güçlü başka bir iş bulmadık. Ensar topluluğundan ayrıldığımızda bir bey'at yapılmadığı için onların bizden sonra kendilerinden bir kişiye bey'at etmelerinden korktuk. Bu takdirde ya bizler razı olmamamıza rağmen onlara bey' at edecek ya da onlara muhalefet edecektik. Bu durumda büyük bir fesat meydana gelecekti. Artık bundan böyle Müslümanlarla istişare olmaksızın kim bir kişiye bey' at edecek olursa, öldürülecekleri korkusundan ne ona ve ne de bey' at ettiği kişiye tabi olunmayacaktır. Fethu'l-Bari Açıklaması: Başlıktaki \"muhsan olup ... \" ifadesi evli ise demektir. İsmam şöyle demiştir: İmam Buhari attığı bu başlıkla kadının evli iken zinadan gebe kalıp, sonra çocuğunu doğurmasını kastetmektedir. Buna karşılık kadın hamile ise çocuğunu dünyaya getirinceye kadar recm edilmez. İbn Battal şöyle demiştir: Atılan başlığın manası zinadan gebe kalmış bir kadına recin cezası uygulamak gerekli midir yoksa değil midir demektir. Bilginler arasında hamile kadının çocuğunu dünyaya getirinceye kadar recm edilemeyeceği noktasında icma oluşmuştur. Nevevi şöyle demiştir: Hamile kadının cezası sopa ise de hüküm böyledir, çocuğunu dünyaya getirinceye kadar bu ceza uygulanmaz. Kısas edilmesi gerekli olan hamile bir kadının durumu da böyledir. Yani o da çocuğunu dünyaya getirinceye kadar kısas edilemez. Bütün bunlarda bilginlerin icmaı vardır. Hz. Ömer hamile olan kadını recm etmek isteyince, Muaz ona \"Karnındakini dünyc;ya getirinceye kadar ona ilişemezsin\" demiştir. Hadisi İbn Ebi Şeybe rivayet etmiştir, ravileri sikadır.(İbn Ebi Şeybe, Musannef, V, 543) Kadının çocuğunu doğurmasından sonra ne yapılacağı konusunda bilginler arasında ihtilaf vardır. İmam Malik, çocuğunu doğurduğunda recm edilir, çocuğunu büyütüneeye kadar beklenmez demiştir. KOfe fıkıh bilginleri ise \"çocuğunu dünyaya getirdiğinde ona bakacak birini buluncaya kadar recm edilmez\" kanaatini benimsemişlerdir. İmam Şafil'nin görüşü de bu doğrultudadır. İmam Malik'ten de buna benzer bir görüş naklediimiştir. İmam Şafiı şu hükmü de eklemiştir: Kadın doğumun ardından gelen ilk sütü vermedikçe recm edilemez. Müslim'in nakline göre Büreyde şöyle anlatmıştır: Gamid kabilesinden kadının biri gelerek Nebi Sallallahu Aleyhi ve Sellem'e \"Ya Resulallah! Beni temizle!\" dedi. (Kadın zinadan hamile olduğunu söylemişti.) Nebi Sallallahu Aleyhi ve Sellem ona \"Doğumunu yapıncaya kadar bekle\" buyurdu. Kadın doğumunu yapınca, Resulullah Sallallahu Aleyhi ve Sellem \"Onu recm edip de çocuğunu küçük yaşta emzirecek birisi bulunmaz halde bzrakamayzz\" dedi. Bunun üzerine adamın biri ayağa kalktı ve \"Ya Resulallah! Onun emzirilmesi bana ait olsun\" dedi. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem kadını recm ettirdi.(Müslim, Hudud) Büreyde'nin bir başka rivayetine göre bu olay şöyle cereyan etmiştir: \"Kadın çocuğunu sütten kesilinceye kadar emzirdi. Sonra onu Müslümanlardan birisine teslim etti ve Resuluilah Sallallahu Aleyhi ve Sellem kendisini recm ettirdi.\" Büreyde'nin bu iki rivayetini şu şekilde cem ve telif etmek mümkündür: İkinci rivayette birincide olmayan bir fazlalık vardır. Dolayısıyla birinci rivayette yer alan \"ileyye irdauhu=onun emzirilmesi bana ait olsun\" cümlesini, onun bakımı bana ait olsun şeklinde yorumlamak mümkündür. \"İbn Abbas'ın nakline göre\" İbnü't-Tın'in nakline göre Davudı şöyle demiştir: İbn Abbas'ın \"......... küntü ukriu ricalen\" cümlesinin manası ben bazı kimselerden Kur'an öğreniyordum demektir. Çünkü İbn Abbas, Nebi Sallallahu Aleyhi ve Sellem vefat ettiğinde Muhacir ve Ensardan sadece mufassal grubu sureleri ezberlemişti. İbnü't-Tin şöyle der: Davudl'nin bu ifadesi, İbn Abbas'ın cümlesinin zahirinin dışına çıkmak hatta ifadeden uzaklaşmaktır. Çünkü \"ukriu\" öğretiyorum manasınadır. İbn İshak'ın, Abdullah b. Ebu Bekir vasıtasıyla Zührl' den yaptığı şu rivayet de bu tenkidi teyit etmektedir: \"Mina' da Hz. Ömer'le birlikte bulunduğumuz sırada zaman zaman Abdurrahman b. Avf'ın yanına gelip, ona Kur'an öğretiyordum.\" Bu haberi İbn Ebi Şeybe nakletmiştir.(İbn Ebi Şeybe, Musannef, VII, 431) İbn Abbas zeki ve hızlı ezber yapabilme yeteneğine sahip birisi idi. Birçok sahabe cihadla meşguloldukları için Kur'an'ı ezberleyememişlerdi. Nasibi olanlar, Nebi Sallallahu Aleyhi ve Sellem'in vefatından sonra Medine'de yerleşmelerinin ardından bu eksikliklerini giderdiler. Sahabe asil çocuklara güveniyorIardı. Buçocuklar kendilerine ezberleme telkin i yapmak için Kur'an okutuyordu. \"Filan kimseye\" yani Talha b. UbeyduIlah'a \"bey' at ettim.\" \"ValIahi Ebu Bekir'e yapılan bey'at\" \"felteten\" yani ansızın birden bire yapılıp tamam oldu! Hadiste geçen \"er-rua\" ayak takımı kimseler demektir. Kötülük işlerinde eli çabuk, ayak takımı kimselere Arapçada \"rua\" denilmektedir. \"Yağlibune ala kurbike\" yani onlar sana yakın bir yerde çoğunluğu ele geçirirler. \"Fetahlusu\" yani orada fakihlerle ve insanların ileri gelenleriyle bir araya gelirsin. \"Allah'ın kulu deyiniz.\" İmam Malik'in rivayetine göre Resulullah Sallallahu Aleyhi ve Sellem \"Ben ancakAllah'ın kuluyum. Benim için Allah'ın kulu ve Resulü deyiniz\" buyurmuştur. İbnü'I-Cevzl şöyle der: Bir şeyin yasaklanmasından onun vuku bulmuş olduğu sonucu çıkmaz. Çünkü biz Nebiimiz hakkında Hıristiyanların Hz. İsa hakkındaki iddiaları gibi iddiada bulunan olduğunu bilmiyoruz. Nebi Sallallahu Aleyhi ve Sellem'in getirdiği yasaklık öyle anlaşılıyor ki Muaz b. Cebel hadisinde belirtilen olaydan dolayıdır. Çünkü o secde etmek için izin isteyince, 'Nebi Sallallahu Aleyhi ve Sellem bundan kaçınmış ve ona yasak getirmiştir. Resuluilah Sallallahu Aleyhi ve Sellem adeta başkasının onun da ötesinde abartıya gideceği endişesine kapılmış ve emri teyid etmek için derhal yasaklama getirmiştir. İbnü'tTın şöyle demiştir: \"La tutTuni\" yani beni Meryem oğlu İsa'nın cvülmesi gibi övmeyiniz. Çünkü onların bir kısmı onun hakkında ileri gidip, kendisini Allah'ın yanında bir ilah kabul ettiler. Bazıları ise onun Allah olduğunu iddia ederken, bir kısmı Allah'ın oğludur dediler. Resulullah Sallallahu Aleyhi ve Sellem getirdiği yasaklama ardından \"Ben Allah'ın kuluyum\" dedi. İbnü't-Tin şöyledevam eder: Hz. Ömer'in bu olayı burada zikretmesinin ardında yatan incelik, kendisinin Müslümanlar hakkında aşırılığa kaçma endişesi duymasındandır. Yani Hz. Ömer anlama yeteneği olmayan bir kimsenin yanlış bir zanna kapılacağından ve herhangi bir kişinin halifeliğe layık olduğunu ve layık olmadığı halde bu görevi üst1enmeye kalkacağı düşüneceğinden korkmuştur. Yanlış zanna kapılan kişi ise onda olmayan şeylerle kendisini övüp, hadiste getirilen yasaklık kapsamına düşebilir. Hz. Ömer'in bu olayı nakletmesinin sebebi şu da olabilir: Ebu Bekir'i metheden kişinin ağzından çıkanlar yasaklanmış övgü türünden değildir. Bundan dolayı Hz. Ömer \"İçinizden hiçbir kimse ... Ebu Bekir' den daha layık değildir\" demiştir. Hz. Ömer'in recm olayıyla anne ve babalardan yüz çevirmeyi yasaklaması, konuşma yapmasına sebep olan olaydan dolayıdır. Bu olayaradan birisinin \"Eğer Ömer ölürse ben muhakkak filan kimseye bey' at ederim\" şeklindeki ifadesidir. Hz. Ömer recm olayıyla \"Şer'ı ahkam konusunda ancak Kur'an'da bulduğu m şeylerle amel ederim. Kur'an'da ise halife öldüğünde danışmalarda bulunma şartı açıkça getirilmemiştir. Tam tersine bu hüküm sünnetten alınmıştır. Nitekim recm de okunan Kur'an'da mevcut değildir. Bu hüküm sünnetten alınmıştır\" diyen kimsenin bundan vazgeçirilmesi gerektiğine işaret etmiştir. Anne ve babalardan yüz çevirmenin yasaklığına gelince; Hz. Ömer sanki halifenin toplum açısından baba mesabesinde olduğuna işaret etmektedir. Dolayısıyla toplumun halifeyi bırakıp, başka birisini isteme hakları yoktur. Tam tersine babaya itaat etmek nasıl gerekli ise, halifeye de itaat -şartlarını taşıması şartıylaöyle gereklidir. Hz. Ömer'in değindiği konuların birbiriyle ilgisi bizim anladığımız kadarıyla bundan ibarettir. Gerçek ilim Allahu Teala'ın katındadır. \"Dikkat ediniz! Gerçekten o iş\" yani Ebu Bekir'e yapılan bey'at\" \"Fakat Allah o işin kötülüğünden ümmeti korumuştur.\" Yani Allahu Teala genellikle acelede olan kötülükten onları korumuştur. Çünkü aniden yaptığı işteki hikmeti bilmeyen bir kimsenin genellikle ondan hoşnut olmaması normal bir durumdur. Hz. Ömer, Hz. Ebu Bekir'e bey'atta acele edilmesinin sebebini Ensarın Sa'd b. Ubade'ye bey' at etmelerinden korkması şeklinde açıklamıştır. Ebu Ubeyd \"Ebu Bekir'e bey'atta acele ettiler. Çünkü bu mesele yayılır ve layık olmayan kimseler bu işe kafalarını takar ve kötülük meydana gelir diye korktular\" demiştir. Davudl'nin bu konudaki görüşü şöyledir: Hz. Ömer'in \"Ebu Bekir'e yapılan bey'at birdenbire olmuş ve tamamlanmıştır\" sözünün manası, bu bey'at görüşünü almak gereken herkes mevcut olduğu halde hiç kimseye danışılmaksızın yapılmıştır demektir. İmam Şafil'nin talebesi Kerabısı bu açıklamaya tepki göstermiş ve şöyle demiştir: Tam tersine maksat, Hz. Ebu Bekir ve beraberinde olanların Ensara gitmekte muhalif davranmaları ve onların huzurunda Ebu Bekir' e bey' at etmeleridir. Oysa Ensarın arasında Ebu Bekir' e bey' at etmesi gerektiğini bilmeyen kimseler de vardı. Bunlar \"Biz Ensar topluluğundan bir emir, sizlerden de bir emir olsun ey Kureyş topluluğu!\" demiştir. Hadiste geçen \"el-felte\"den maksat Ensara ve onların Sa'd b. Ubade'ye bey'at etme isteklerine karşı muha1efettir. İbn Hibban şöyle der: \"hü ..:..jlS Kanet felteten\" ifadesinin manası, bey'at ilk başlarda çok az kişi tarafından yapıldı demektir. Bir şey böyle olduğunda ona \"U4.l1 el-felte\" denilir. Böyle bir durumda genellikle muhalif olanların muhalefeti dolayısıyla bir kötülük meydana geleceği tahmin edilir. Allahu Teala ise Ebu Bekir'e ,bey'atta kötülük olduğundan değil, genellikle böyle bir durumda olabilecek kötülüğe karşı Müslümanları korumuştur. \"İçinizden hiçbir kimse, kendisine hızla gidilmek amacıyla develerin telef edilmesine EbU Bekir'den daha layık değildir.\" Hattabi'ye göre Hz. Ömer'in demek istediği şudur: İçinizden fazilet açısından kendisine erişilemeyecek derecede yol almış bir kimse, Ebu Bekir'in derecesine erişemez. Hiç kimse Ebu Bekir'in eriştiği bey' ata erişeceğini ummasın. Ebu Bekir önce dar çerçevede bu bey'atı almış, sonra insanlar ona bey' at etmekte ittifak etmişler ve kendisi hakkında ihtilafa düşmemişlerdir. Zira onun halifeliğe layık olduğunu anlamışlar ve onun halifeliği konusunda düşünmeye, danışmalarda bulunmaya ihtiyaç duymamışlardır. Ondan başkası bu konumda değildir. Hz. Ömer'in bu sözü, Ebu Bekir'in halifeliğinde yapıldığı gibi bir konuda acele davranmaktan kaçınmak gerektiğine işaret etmektedir. Zira ortada Ebu Bekir gibi bir aday yoktur. Çünkü Ebu Bekir birçok güzel nitelikleri kendisinde toplamış bir kişidir. O Allah'ın emrine uyan, Müslümanlara alçakgönüllü davranan, güzel ahlak sahibi, siyaseti bilen ve tam bir takvaya sahip olan kişidir. Başka hiç kimse ondaki bu nitelikleri taşımamaktadır. Dolayısıyla onun dışında bir kimseye danışmlarda bulunmaksızın bey'at edildiğinde kötülük kaynağı olan ihtilafın doğmayacağından hiç kimse emin olamaz. \"Tağirreten en yuktela\" yani bey' at eden de, bey'at edilen de kendilerini öldürülme tehlikesine atmış olmamaları için. \"...... Yuakü\" yani ona va'k gelir. ....... titremeyle birlikte yüksek ateştir. Zaten bundan dolayı örtüye bürünmüştür. \"Onların hatibi şehadet kelimelerini söyledi.\" Onların konuşmacılarının ismine vakıf olamadım. Sabit b. Kays b. Şemmas, Ensarın hatibi olarak çağrılıyordu. Öyle anlaşılıyor ki Ensarın hatibi Sabit'ti. \"......... Ketibetü'l-İslam= İslamın büyük ordusu\" Hadiste geçen ketıbe'nin çoğulu ''....... ketaib\"dir. Bu, bir araya toplanmış, büyük bir ordudur. Hz. Ömer'in onlara bu şekilde hitap etmesi, abartı içindir. Hz. Ömer onlara sanki sizler İslamın toplumusunuz, demiş olmaktadır. ...... Rehtun\", az bir topluluk demektir. On veya daha az bir gruba reht denildiği daha önce geçmişti. \"Ve kad deffet daffetun min kavmikum\" yani sizin topluluğunuzdan az bir grup geldi demektir. Kelimenin aslı \"deff\" kökünden türemedir. Bu kök, grup halinde yavaş yol alma ve yürüme anlamın'adır, \"Yahtezihlna\" yani bu azınlık, bizi bu işten koparmak vedışlayıp tek başına kalmak istiyorlar. \"........ Ve en yahdununa\" Ebu Ubeyd'in ifadesine göre bu kelime elMüstemll'de \"yuhricuna\" şeklindedir. \"Hadanahu\" ve \"ihtedanehu ani'l-emri\" demek onu bir kenara çıkardı, o konuda tek başına kaldı veya karşısındaki kişiye mani oldu demektir. \"...... kl; Felemma sekete\" yani Ensarın hatibi susunca demektir. Onun ifadesinden anlaşılan şudur: Ensarın hatibi, Muhacirlerden bir grubun Ensara kendilerinin daha layık olduklarına inandıkları bir görev konusunda engelolmak istediklerini haber vermiştir. Ve böylece üstü kapalı olarak Ebu Bekir, Ömer ve onlarla gelenleri kastetmiştir. \"............ Ve küntu kad zewertu makaleten\" yani bir konuşma hazırlamış ve onu güzel yapmıştım. \".............. Fe kale kailü'l-Ensari.\" Bu sırada Ensardan birisi şöyle dedi: Süfyan, Bezzar'da yer alan rivayetinde bu hatibin ismini Hubab b. el-Münzir olarak vermektedir. İbn Şihab şöyle demiştir: Said b. el-Müseyyeb bana \"ene cüzeylüha'l-muhakkeku\" diyen kişinin Hubab b. el-Münzir olduğunu haber verdi. Daha önce Hz. Aişe radıyal\\ahu anha hadisinde mevsul olarak şöyle geçmişti: Ebu Bekir \"Bizler emiriz, sizler vezirsiniz\" dedi. Bunun üzerine Hubab b. el-Münzir şöyle cevap verdi: \"Hayır, vallahi bunu yapamayız! Bir emir bizden, bir emir sizden olsun\" dedi. \"el-Murecceb\" ve \"el-muhakkek\" kelimelerinin açıklaması o hadisin açıklaması yapılırken geçmişti. Ebu Bekir' e yapılan bu bey' at1a ilgili diğer hususlar da orada açıklanmıştı. İshak b. et-Tabba' burada şöyle bir ilave açıklamada bulunmuştur. İmam Malik' e bunun manasının ne olduğunu sordum. Bana şöyle dedi: Sanki Hubab b. el-Münzir ben Ensarın dahisiyim demek istiyor. Bu, mana itibariyle bir tefsirdir. O buradaki rivayetine \"iki kılıç\" kelimesini eklemiştir. Söz konusu \"ivayetin devamı şöyledir: \"Aksi takdirde bir hile olarak aramızda savaş hazırlarız.\" Bunun üzerine ben de \"İki kılıç bir kına girmez\" dedim. Ma'mer'in nakline göre bunu rivayet eden Katade'dir. Ma'mer şöyle demiştir: Katade'nin nakline göre Hz. Ömr dedi ki: İki kılıç bir kına girmez. Fakat emirler bizden, vezirler sizden olsun.\" İbn Sa'd da sahih bir isnadla el-Kasım b. Muhammed'in mürseli şöyledir: Ensar, Sa'd b. Ubade'nin etrafında toplandı. Ebu Bekir, Ömer ve Ebu Ubeyde onların yanına geldi. Hubab b. el-Münzir ayağa kalktı. Hubab Bedir'e katılmış sahabelerdendi. \"Bir emir bizden, bir emir sizden olsun. Biz vallahi bu konuda sizi kıskanmıyoruz. Fakat babalarını ve kardeşlerini öldürdüğümüz birtakım kimselerin geleceğinden korkuyoruz\" dedi. Hz. Ömer \"Böyle bir şeyolduğunda gücün yeterse öl!\" dedi. Hattabı \"Bir emir bizden, bir emir sizden olsun\" diyen kişiyi buna sevk eden Arapların anlayışıdır. Onlara göre bir topluluğun başına lider olacak kişi, ancak kendilerinden olur. Bu sözü söyleyen kişi, İslamın devlet başkanlığı konusundaki hükmünü ve bu görevin Kureyş'e ait olduğunu duymamış gibidir. Ancak bundan haberdar olunca konuşmasını kesmiş, kendisi ve kavmi Hz. Ebu Bekir'e bey'at etmiştir. \"Hatta feriktu mine'l-ihtilaf\" Bu fiil \"el-ferak\" kökünden türemedir. Manası korkmaktır. İmam Malik'in rivayetinde bu kelimenin yerine \"hatta hıftu\" ifadesi geçerken, Cüveyriye'nin rivayetinde \"hatta eşfakne'l-ihtilaf\" ifadesi geçmektedir. \"Ve nezevna\" sıçradık, galebe sağlamış olduk. Hadisten Çıkan Sonuçlar 1. İlmi verenin yaşı alandan daha küçük, toplum içindeki mertebesi ondan daha aşağı olsa bile yine de onu ehlinden almak gerekir. 2. İlim ehil olmayan kimselere verilmez ve onu kavramayacak kimseye açılmaz. 3.Anlayışı az olan bir kimseye tahammül edemeyeceği şey söylenmez. 4. Devlet başkanına toplumu fesada sürükleyecek bir faaliyet yapmasından endişe edilen bir kişinin konuştuğu şeyleri ihbar etmek caizdir ve bu, kınanmış olan söz taşımadan (nemıme) sayılmaz. Ancak iki maslahatı sağlamak ve ilgili kişiyi korumak için uyarının üstü kapalı yapılması gerekir. Her halde bu olayda gerçekleşen de böyle idi. Hz. Ömer bundan kaçındırmakla yetinmiş ve o görüşü dile getireni cezalandırmadığı gibi, söylediği iddia edilen kişiyi de cezalandırmamıştır. Mühelleb kendi iddiası üzerine maksadın Ensardan bir şahsa bey' at etmek olduğu sonucunu dayandırmış ve şöyle demiştir: Bunda Ebu Bekir'in sözüne muhalefet vardır: Çünkü o \"Fakat Araplar şu halifelik işini Kureyş'ten olan şu Muhacirler topluluğundan başkasına asla tanınmayacaktır\" demiştir. Bilinen, aksine davranmanın caiz olmadığı şeydir. Bizim kanaatimiz ise şu yöndedir: Yukarıdaki olayın ifade akışından ortaya çıkan şudur: Hz. Ömer'in tepkisi Müslümanlara danışmaksızın herhangi bir şahsa bey' at etmek isteyen kimseyedir. O, ilgili şahsın Kureyşli veya başka bir kabileden olmasına değinmemiştir. 5. Bir toplumun önde gelen büyüğü hakkında mubah olan öyle şeylere tahammül edilir ki bunlara başkası hakkında asla katlanılamaz. Çünkü Hz. Ömer \"İçinizden hiçbir kimse, kendisine boyunların uzatılmasına Ebu Bekir' den daha layık değildir\" demiştir. Genel bir danışma olmaksızın Ebu Bekir' e beyate girişilmesine tahammül edilmiş olmasından onun sıfatını taşımayan herkes için bunun mubah olduğu sonucu çıkarılamaz. Mühelleb şöyle demiştir: Hadisten halifeliğin sadece Kureyş içinden birine verileceği anlaşılmaktadır. Bunun delilleri çoktur. Budelillerden birisi Nebi Sallallahu Aleyhi ve Sellem'in Müslümanların emirliğini Ensara tavsiye etmiş olmasıdır. Bu tavsiye, onların halifeliğe haklarının olmadığına açık bir delildir. Ancak Mühelleb'in bu görüşü tartışılır. Bunun açıklaması ileride Ahkam bölümünde \"Emirlerin Kureyş'ten olması\" bölümünde gelecektir. 6. Bir kadın kocası ve efendisi olmadığı halde hamile olduğu takdirde kendisine had cezası uygulanır. Ancak hamileliğine bir delil getirir veya zorla tecavüze uğradığını ispat ederse cezadan kurtulur. İbn Abdilberr şöyle der: Hz. Ömer'in birçok davada zorlama olduğu vb. iddialarla had cezasını düşürdüğüne dair haberler gelmektedir. İbn Abdilberr bundan sonra Şu'be, Abdulmelik b. Meysara isnadıyla en-Nezzal b. Sebre'nin şu ifadesini nakleder: Mina'da Hz. Ömer'le birlikte bulunuyorduk. Birden karnı burnunda hamile bir kadın ağlayarak çıkageldi. Hz. Ömer kadına bunun sebebini sorunca, şöyle cevap verdi: Ben uykusu ağır bir kadınım. Bir gece namaza kalkmıştım. Sonra tekrar uyudum. Uyandığımda adamın birisi üstüme çıkmış bana tecavüz ediyordu. Sonra işini bitirince çekip gitti. Kim olduğunu bilmiyorum. Bu ifadenin ardından Hz. Ömer kadına had cezasını düşürdü. Bazı bilginler devlet başkanı (yetkili makam) kadının zorla tecavüze uğradığı iddiasında doğru söylediğine dair belirtiler görürse bunu kabul eder demişlerdir. Ancak memleketinde dindarlığıyla ve doğruluğuyla meşhur olmamış, zorla tecavüze uğradığına dair elinde bir karinesi bulunmayan kadının tecavüze uğradığı iddiası -özellikle de kadın şaibeli ise- kabul edilmez. İbn Abdilberr Medine halkının Abdurrahman b. Avf ve Hz. Ömer'in bu konuda ittifakları nedeniyle ilim ve anlayış sahibi kimseler olduklarını bu haberden çıkarmıştır. İbn Battal'ın naklettiği ve kabul ettiği üzere Mühelleb de böyle söylemiştir. Bu hüküm o dönemin insanları hakkında isabetlidir. Bu konuda onlara benzeyenler de kendileri kategorisindedirler. Bundan sözkonusu durumun her asırda, hatta her kişide bu şekilde sürüp gideceği sonucu çıkarılamaz. 7. İlmi belleyip, anlama yeteneği olan kimseye onu tebliğ etmeli, anlamayana ise bildirmemelidir. Ancak kişi duyduğu haberi harfi harfine nakledebiliyor ve üzerinde herhangi bir değişiklik yapmıyorsa ona da ilmi tebliğ etmede herhangi bir sakınca yoktur. Mühelleb Hz. Ömer'in \"Babalarından yüz çevirmeyiniz\" hadisi ile recm hadisine yer vermesinin ilişkisine şöyle işaret etmektedir: Hz. Ömer, bununla hiç kimsenin elinde Kur'an veya hadisten nass bulunmayan bir konuda kesin konuşmasının isabetli olmayacağını ve hiç kimsenin kendi görüşüne başvurmak suretiyle nefsinin kendisine hoş gösterdiği şeyi söyleyip, yapmasının uygun ofmay.acağına işaret etmiştir. Nitekim \"Ömer ölürse filan kimseye bey' at ederim\" diyen kişi işte böyle kesin konuşmuştur. Çünkü o kişi halifeliğe elverişli olan kimsenin taşıması gereken şartın Kur'an'da yazılı olduğunu görmemiştir ve halife olmasını istediği kişiyi Ebu Bekir'in halife seçilmesi olayına kıyaslamış, arada fark olduğu için kıyasında yanlışlık yapmıştır. Oysa yapması gereken, ilim ehli kimselere Kitap ve sünnetin hükmünü sorması ve onların gösterdiği şeklinde hareket etmesi idi. Hz. Ömer recm olayıyla anne ve babalardan yüz çevirmenin yasaklığı hadisesine yer vermiştir. Oysa bu iki olay, -her ne kadar Allahu Teala'ın hakkında hüküm indirdiği, hükmünün devam ettiği ve okunmasının nesh edildiği şeylerden ise de- okuduğumuz Kur'an'da ayet olarak mevcut değildir. Ancak bu hükmü anlamak sözkonusu gerçeği anlayabilecek kapasitedeki ilim ehli kimselere mahsustur. 8. Bir topluluğun fitneye düşeceği ve gerçeği kabul etmeyeceği endişesini taşıyan bir kimsenin onlara gitmesi, kendileriyle tartışması ve onlara gereken delili sunması gerekir. NesaS'nin nakline göre Salim b. Ubeydullah şöyle demiştir: \"Muhacirler halifelik konusunu görüşmek üzere biraraya geldiler ve sonra 'Buyrun Ensar kardeşlerimize gidelim!' dediler. Oraya varınca Ensara 'Bizden bir emir, sizden bir emir olsun' dediler. \"(Nesai es-Sünenu'l-Kübra, ıV, 263) Bunun üzerine Hz. Ömer şöyle dedi: \"Bir emir bizden, bir de sizden olursa bu, bir kında iki kılıç demektir. Bu da uygun olmaz.\" Sonra Hz. Ömer, Ebu Bekir'in elini tutarak \"Arkadaşına \"Üzülme! Çünkü Alla1-. bizimle beraberdir\"(Tevbe 40) derken üçüncüleri Allah olan kimdi? Onlar mağarada iken kimdi onun arkadaşı? Kimdi o iki arkadaş? Hz. Ömer bundan sonra Ebu Bekir'e bey' at etti. Ardından insanlar da ona en güzel ve en şık bir biatla bey' at ettiler. 9. Mertebesi yüksek bir kişi edepli olmak ve kendi nefsini temize çıkarmaktan kaçınmak amacıyla kendi seviyesinden daha aşağıda olan birisine alçak gönüllü davranıp, onu kendine tercih edebilir. Nitekim Hz. Ömer'in uzat elini dediğinde Hz. Ebu Bekir'in bundan kaçınmaması bu gerçeği göstermektedir. 10. Müslümanların birden daha fazla devlet başkanları olması mümkün değildir. 11. Fitneye devam edeceği endişesi söz konusu olan kimseye beddua etmek caizdir. 12. Devlet başkanının huzurunda bir başka kişiye iftira atan kimseye mağdur talep etmedikçe devlet başkanının iftira cezası uygulaması gerekmez. Çünkü iftiraya uğrayan kişi bunu atanı affedebilir veya onun suçunun örtülmesini isteyebilir. 13. Devlet başkanı bir topluluğun yasak olan bir fiili işleme endişesi taşıyorsa onlara gitmesi, Öğüt vermesi ve o fiili işlemeden önce kendilerini uyarması gerekir",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 6832,
			"arabicnumber": 6832,
			"text": "İbn Şihâb şöyle dedi: Ve bana Urve ibnu'z-Zubeyr haber verdi ki, Omer ibnu'l-Hattâb da gurbete sürgün cezası uygulamış, sonra bu, kaanûn olmakta devam etmiştir",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 6833,
			"arabicnumber": 6833,
			"text": "Ebu Hureyre r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem evlenmemiş olarak zina eden muhsan olmayan kimseler hakkında had cezasıyla birlikte (yüz sapa) bir yıl sürgüne gönderme hükmünü vermiştir. Fethu'l-Bari Açıklaması: Muhammed b.Nasr, Kitabu'l-İcma isimli eserinde zina eden erkeğin sürgüne gönderileceği konusunda -Kufeli bilginler hariç- görüş birliği olduğunu nakletmiştir. Aralarında İbn Ebi Leyla ve Ebu Yusuf olmak üzere onlardan bazı bilginler, çoğunluğa katılmışlardır. Tahavi bu hükmün mensuh olduğunu iddia etmiştir. Biz bunu Cariyeye Sürgün Cezası Uygulanmayacağı başlığı altında ele alacağız. Zina eden bekarın sürgüne gönderilmesi gerektiği hükmünü veren bilginler, kendi aralarında ihtilaf etmişlerdir. İmam Şafii, Sevri, Davud, Taberi bu hükmün genelolduğunu söylemişlerdir. İmam Şafii' den nakledilen bir başka görüşe göre köle olup, zina eden be karlar sürgüne gönderilmez. Evzai sürgün cezasının erkeklere mahsus olduğunu ifade etmiştir. İmam Malik'in görüşü de bu doğrultudadır. O sürgün cezasını hürriyetle kayıtlamıştır. İshak'ın görüşü de bu yöndedir. Ahmed b. Hanbel'den bu konuda iki görüş rivayet edilmiştir. Sürgüne gönderilecek kişinin hür olması şartını getiren bilginlerin bakış açısı şudur: Köleyi sürgüne göndermek onun sahibini cezalandırmak anlamına gelir. Zira bu durumda efendi kölesi sürgünde olduğu müddetçe ondan yararlanamamış olur. Şeriatın tutumu, suçludan başkasını cezalandırmamayı gerektirmektedir. Bu prensipten hareketle köleden hac ve cihad farizası düşmüştür. İbnü'lMünzir şöyle demiştir: Nebi Sallallahu Aleyhi ve Sellem, ev sahibinin eşiyle zina eden ücretli alayında Allah'ınkitabına göre hükmedeceğine dair yemin etmiş ve sonra \"Oğluna da yüz değnek vurulacak ve bir yıl sürgüne gönderilecek\" demiştir. Gerçekten Kur'an'da açıklanan hüküm de budur. Hz. Ömer bunu herkesin huzurunda yaptığı konuşmada dile getirmiş, Raşid Halifeler buna göre amel et• mişlerdir. Hiç kimse Hz. Ömer' e karşı tepki koymamıştır. Dolayısıyla bu, icma haline gelmiştir. Bilginler sürgüne gönderilecek kölenin ne kadaruzak mesafeye gönderileceği konusunda ihtilaf etmişlerdir. Bazı bilginler bu, devlet başkanının (yetkili makamın) görüşüne bırakılmıştır derken, bazıları namazı kısa kılma mesafesi kadar göndermek şarttır demişlerdir. Bazı bilginler ise üç günlük mesafeye gönderilmesi gerekir demişlerdir. Malikiler kölenin sürgün olduğu yerde hapse konulmasının şart olduğunu söylemişlerdir. \"Zina eden kadın ve zina eden erkekten herbirine yüz sapa vurun; Allah'a ve ahiret gününe inanıyorsanız, Allah'ın dininde (hükümlerini uygularken) onlara acıyacağınız tutmasın.\" Bu ayete yer verilmesinden maksat, sapa cezasının Allah'ın kitabıyla sabit olduğunu vurgulamaktır. Görüşüne itimat edilen bilginler sapa cezasının bekar olup, muhsan olmayanlara mahsus olduğunda görüş birliği etmişlerdir. Bilginler sapa cezasının nasıl uygulanacağı konusunda da ihtilaf etmişlerdir. İmam Malik'ten gelen bir görüşe göre bu ceza sadece sırta vurulmak suretiyle yerine getirilir. Çünkü liandan söz eden hadiste \"Delil getireceksin. Aksi takdirde sırtına sapa vurulur\" denilmektedir. Başka bilginler ise şöyle demişlerdir: Sapa organlara dağıtılır. Bu ceza uygulanırken yüze ve başa vurulmaz. Zina, içki içme ve tazir cezalarında kişi elbisesinden soyunmuş olarak sapa cezasıyla ayakta cezalandırılırken, kadın oturduğu yerden cezalandırılır. İHete iftirada ise kişi giyin ik olarak sapa cezasını alır. Ahmed b. Hanbel, İshak, Ebu Sevr had cezaları uygulanırken hiç kimse elbisesinden soyundurulmaz demişlerdir",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 6834,
			"arabicnumber": 6834,
			"text": "İbn Abbas r.a. şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem kadınlığa özenen erkeklerle, erkekliğe özenen kadınlara lanet etti ve \"Bu gibi insanları evlerinizden çıkarıp kovunuz!\" buyurdu. İbn Abbas şöyle dedi: Nebi Sallallahu Aleyhi ve Sellem filanı, Hz. Ömer de filanı çıkardı. Fethu'l-Bari Açıklaması: AÇIKLAMA SONRASI BİR BAB VE BİR HADİS DAHA VAR İmam Buhari attığı bu başlıkla hirabe (soygunculuk, eşkiyalık, yol kesme) suçu işlemiş kimselerden başkalarına sürgün cezası vermeyi kabul etmeyen kimselere cevap vermiş olmakta ve hirabe suçu işlememiş kimselere sürgün cezası vermenin, Nebi Sallallahu Aleyhi ve Sellem ve ardından gelen halifelerin uygu1amasıyla sabit olduğunu açıklamaktadır. Büyük günah işlemeyen bir kimse hakkında sürgün cezası sabit olunca, büyük günah işleyen kişi hakkında evleviyetle sabit olur. İbn Battal şöyle demiştir: İmam Buhari, zina başlığından sonra bu başlığı atmak suretiyle karşılığı had cezası olmayan bir günahı işleyen kimseye sürgün cezası getirildiğine göre karşılığı had cezası olan bir fiili işleyen kimseye evleviyetle getirileceğine işaret etmiş olmaktadır. Netice olarak sabit olan sünnet, kıyasla güç kazanmaktadır. Böylece o kıyas yoluyla sünnete karşı geleni reddetmektedir. İki kıyas hükmü birbiriyle çeliştiğinde sünnet herhangi bir karşı delil bulunmaksızın sabit olmaktadır. Bilginler bu hadisten yola çıkarak hadiste geçen \" muhannesin\" kelimesinden maksadın erkeklerle homoseksüel ilişki kuranlar değil, kadınlığa özenenler olduğunu söylemişlerdir. Çünkü homoseksüel ilişkinin cezası re cmdir. Hakkında recm cezası gereken bir kimse de sürgüne gönderilmez. Bu tip bir ilişkinin cezası ihtilaflıdır denilerek bu görüş tenkide uğramıştır. Bilginlerin çoğunluğuna göre homoseksüel ilişkinin hükmü -bunu yapan kişi hakkında sopa cezası ile sürgün sabit olsa bile- zina hükmüdür. Çünkü böyle bir kimse açısından evlilik (ihsan) tasavvur edilemez. Bir erkek kadınlara sadece benzemekle kalmışsa, sadece sürgün edilir. Bazı bilginlere göre Buharl'nin yukarıda attığı başlık, homoseksüel ilişkinin aktif ve pasif tarafına recm cezası uygulanmak.gerektiğini ifade eden görüşün zayıflığınaişaret içindir. Çünkü bu sahih hadiste böyle bir kişi hakkında sürgün hükmü getirilmemiştir. Ancak bu görüş tartışılmaya açıktır. Zira Nebi Sallallahu Aleyhi ve Sellem'in evlerinden çıkardığı kimselerden hiçbirinin pasif olarak homoseksüel ilişki içinde olduğu sabit değildir. Ebu Davud'un Ebu Haşim vasıtasıyla Ebu Hureyre' den nakline göre Resulullah Sallallahu Aleyhi ve Sellem'e ellerine ve ayaklarına kına yakmış, kadınlığa özenen bir kişi getirilir. Nebi Sallallahu Aleyhi ve Sellem \"Bunun durumu nedir?\" diye sorunca, orada bulunanlar \"Ya Resulallah! Adam kadınlara benzemeye çalışıyor\" derler. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem O kişiyi Medine'nin en-Naki ismindeki yöresine sürgüne gönderir.(Ebu Davud, Edeb)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 6836,
			"arabicnumber": 6836,
			"text": "",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 6838,
			"arabicnumber": 6838,
			"text": "",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 6839,
			"arabicnumber": 6839,
			"text": "Ebu Hureyre r.a.'in nakline göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Bir cariye zina eder de zina ettiği ortaya çıkarsa efendisi ona sapa cezası uygulasın fakat onu sözle kınayıp ayıplamasın. Sonra yine zina ederse efendisi ona yine sapa cezası uygulasın fakat ayıbını yüzüne vurup eziyet etmesin. Sonra üçüncÜ kez yine zina ederse efendi onu kıldan dokunmuş bir ip karşılığında bile olsa satsın. \" Fethu'l-Bari Açıklaması: Hadiste geçen \"'-:--:..?\" çıkışma ve azarlama demektir. Sürgüne göndermeye gelince, bilginler bunu \"onu satsın\" ifadesinden çıkarmışlardır. Zira sürgünden maksat kişinin günahı işlediği yerden uzaklaştırması demektir. Bu da cariyeyi satmak suretiyle hasılalmaktadır. İbn Battal şöyle demiştir: Hadisin buna delaleti Nebi Sallallahu Aleyhi ve Sellem'in \"efendisi ona sapa cezası uygulasın\" ve \"onu satsın\" ifadeleridir. Bu ifade sürgüne gönderme cezasının düştüğünü göstermektedir. Çünkü sürgüne gönderilen köleyi efendisi sattığı kişiye ancak bir süre sonra teslim edebilir. Sürgüne gönderilmiş olan köle veya cariye bu açıdan kaçan köleye benzer. Bizim kanaatimiz bu yönde değildir. Bizce bu açıklama tartışmaya açıktır. Zira müşteri o köleyi sürgünde olduğu sürece kendisinden yararlanmaksızın satın alabilir ya da kölenin sürgün edildiği yere giden bir kişiye tesadüfen satılmış olabilir. İbnü'l-Arabı şöyle demiştir: Cariyeler bu hükümden müstesnadır. Zira onlarda efendinin hakkı vardır. Dolayısıyla efendinin hakkı Allah hakkından önceliklidir. Had cezasının düşmemesi ise onun asıl, sürgüne göndermenin onun uzantısı (fer'i) olmasındandır. Bizce şöyle demek daha uygundur: Recm cezasını terk etmek suretiyle de efendinin hakkı gözetiimiş olmaktadır. Zira recm cezası -sapa cezasının aksine- menfaati kökünden yok eder. Kölenin sürgüne gönderilmesinde ise bu hak zedelenmiş olmaz. Çünkü efendinin kölenin bedeninden yararlanma gibi bir hakkı yoktur. \"Zina eden bekar kadınla erkeğe sapa ve sürgün cezası verileceği\" başlığı altında geçtiği üzere kadınlara mutlak olarak sürgün cezası vermek meşru değildir diyenler bu hadisi delil olarak almışlardır. Köleye sürgün cezası uygulanır diyen bilginler kendi aralarında ihtilaf etmişlerdir. Sahih olan görüşe göre bu cezanın süresi yarım yıldır. Şafiilerde zayıf bir görüşe göre tam bir yıldır. Bir üçüncü görüşe göre ise köleye sürgüne gönderme cezası diye bir şey yoktur. Mezhep imamıyla çoğunluğu oluşturan bilginlerin görüşü bu doğrultudadır. \"Bir cariye zina eder de zina ettiği ortaya çıkarsa\" yani zina ettiği zuhur ederse demektir. \"Efendisi ona sapa cezası uygulasın\" yani \"Onlara hür kadınların cezasının yarısı {uygulanır)\"(Nisa 25) ayetinden anlaşılan gerekli cezayı uygulayın demektir. \"La yuserrib\" hem sapa cezası uygulanıp, hem de ayıplama ve kınama yapılmasın demektir. Bazı bilginlere göre bu fiilden maksat, sapa cezasını uygulamayarak azarlama ve kınama ile yetinmesin demektir. İbn Battal şöyle demiştir: Bu hadisten had cezası uygulanmış kimselere kınama, azarlama ve çıkışma şeklinde tazir yapılmayacağı hükmü anlaşılmaktadır. Çıkışma ve paylama, korkutma ve kaçındırma amacıyla suçlunun devlet başkanına (yetkili makama) havale edilmesinden önce uygundur. Suçlu yetkili makama havale edilip, had cezası uygulandığında bu yeterlidir. Biz de şunu hatırlatalım: Bundan önce Hz. Nebi Sallallahu Aleyhi ve Sellem'in içki içme cezası uygulanan bir kimseye kötü söz söylemeyi yasakladığı ve \"Kardeşinizin aleyhinde şeytan ın yardımcıları almayınız\" buyurduğu geçmişti",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 6840,
			"arabicnumber": 6840,
			"text": "Şeyban! şöyle anlatır: Abdullah b. Ebu Evfa'ya recm cezasını sordum. Bana \"Nebi Sallallahu Aleyhi ve Sellem recm cezası uyguladı\" dedi. Ben \"Nur suresinden önce mi yoksa sonra mı uyguladı?\" diye sordum. Bana \"Bunu bilmiyorum\" dedi",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 6841,
			"arabicnumber": 6841,
			"text": "Abdullah b. Ömer şöyle demiştir: Yahudiler Nebi Sallallahu Aleyhi ve Sellem'e geldiler ve ona kendilerinden bir adamla bir kadının zina ettiğinden söz ettiler. Nebi Sallallahu Aleyhi ve Sellem onlara \"Siz recm hakkında Teurat'ta ne buluyorsunuz?\" diye sordu. Onlar, \"Biz zina edenleri teşhir ederiz, bunlar bir sopayla dövülürler\" dediler. Abdullah b. Selam bunlara, \"Yalan söylüyorsunuz. Tevrat'ta recm (ayeti) vardır\" dedi. Bunun üzerine Yahudiler Tevrat'ı getirdiler ve açtılar. İçlerinden birisi elini recm ayeti üzerine koydu, ondan önceki ve sonraki ayetleri okumaya başladı. Abdullah b. Selam ona \"kaldır elini\" dedi. Bir de baktılar ki recm ayeti elinin altındadır. Yahudiler \"Ya Muhammedl Abdullah b. Selam doğru söyledi, gerçekten Tevrat'ta recm ayeti vardır\" dediler. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem bu iki kişinin recm edilmesini emretti, onlar da recm olundular. Abdullah b. Ömer \"Ben, recm edilirken erkek yahudinin kadını taşlardan korumak için üzerine kapandığını gördüm\" demiştir. Fethu'l-Bari Açıklaması: \"Zimmllerin ahkamı\" yani Yahudi, Hıristiyan ve bunların dışında kendilerinden cizye alınan diğer kimselere uygulanacak hükümler. \"Zina ettiklerinde muhsan olmaları.\" Yani muhsan olmanın şartlarından birisi de İslamdır diyenlerin aksine zina ettiklerinde muhsan olmaları. \"Yetkili makama havale edildiklerinde.\" Yani haklarında hüküm versin diye Müslümanların hakimine ister kendileri gelsinler, isterse haddi aşmak suretiyle başkaları onları bu hakime hava le etsin hiç farketmez. Ancak bunu -Hanefiler gibi- Müslümanların hakimine onların gelmesi şeklinde kayıtlayan bilginler bu hükme muhalefet etmişlerdir. \"Abdullah b. Ebu Evfa'ya recm cezasını sordum.\" Yani muhsan olduğu halde zina ettiği sabit olan kimsenin recm hükmünü sordum. \"en-Nursuresinden önce mi?\" Yani en-Nur surenin inmesinden önce demektir. \"Bunu bilmiyorum.\" Buradan anlaşılıyor ki büyük bir sahabi bazı açık meseleleri bilmeyebilir ve faziletli bir kimsenin bunu bilmiyorum demesi onun açısından ayıp ve kusur değildir. Tam tersine onun bu konuyu araştırdığını gösterir ki bu övülecek bir durumdur. \"Birinci rivayet daha sahihtir.\" Yani \"en-Nur suresinden önce mi?\" şeklindeki soru daha sahihtir. Bizim kanaatimiz ise şudur: Herhalde bunu zikreden kişi, Yahudi erkek ve kadından söz edilmesinden dolayı maksadın el-Maide suresi olduğunu zannetti. Çünkü bu surede Yahudilerin içlerinden zina eden kadınla erkeğe uygulanacak hükmü sormaları sebebiyle inmiş ayet bulunmaktadır. \"Siz recm hakkında Teurat'ta ne buluyorsunuz?\" el-Bad şöyle der: Nebi Sallallahu Aleyhi ve Sellem'in recm hükmünün Tevrat'ta mevcut olduğunu ve değiştirilmediğini vahiy yoluyla öğrenmiş olması muhtemeldir. Bunu, -Abdullah b. Selam ve başkaları gibi- Yahudi iken Müslüman olanlardan öğrenmiş olması da mümkündür. Çünkü bunların nakilleri, doğru olduğu için bilgi kaynağı olabilir. Bir başka ihtimal de Nebi Sallallahu Aleyhi ve Sellem'in bunu bu konudaki hükmün onların nezdinde ne olduğunu öğrenmek maksadıyla sormuş, sonra bunun doğruluğunu Allahu Teala'tan öğrenmiş olmasıdır. \"Bunlar bir sopayla dövüıürler.\" İleride Tevhid bölümünde Eyyub'un Nafi'den yaptığı rivayette \" fadıha\" kelimesi \"yüzlerine kara çalıp, onları teşhir ederiz\" şeklinde açıklanacaktır. Abdullah b. Ömer rivayetine göre \"Yahudiler, yüzlerine kara çalar, bir hayvana sırt sırta bindirerek onları dolaştıtırız dediler.\" Abdullah b. Dinar'ın rivayetine göre \"Bizim bilginlerimiz yüzü karartma ve hayvana bindirip teşhir etme cezası uydurdular\" dediler. Ebu Hureyre hadisine göre ise \"Yüzüne kara çalınır, sırt sırta oturtulup, değnek cezası uygulanır\" dediler. Burada geçen \"tecbiye\" zina eden kadınla erkeğin bir eşeğe bindirilerek sırt sırta oturtulup, teşhir maksadıyla dolaştırılmalarıdır. el-Bad şöyle demiştir: Bu meseleden anlaşılan onlar verdikleri cevapta Tevrat'ın hükmünü tahrif etmeye ve Nebi Sallallahu Aleyhi ve Sellem'e yalan söylemeye kalkışmışlardır. Bunu ya Nebi Sallallahu Aleyhi ve Sellem aralarında Allah'ın indirdiğinden başka bir şeyle hükmeder ümidiyle yapmışlar ya da onun hükmüne başvurmakla zina edenlere hafif bir ceza verilmesiniamaçlamışlar ve bu uygulamanın kendilerini uygulamaları gereken hükmün dışına çıkaracağına inanmışlardır ya da Nebi Sallallahu Aleyhi ve Sellem'i denemeye kalkmışlardır. Çünkü Nebi Sallallahu Aleyhi ve Sellem olan bir kimsenin batıl olan bir şeyi kabul etmeyeceği yerleşmiş olan kaidelerdendir. Buradan, Allahu Teala'ın Nebiini başarılı kılması sayesinde -hamdolsun Allah'a- onların yalan, Nebi s.a.v.'in doğru söylediği ortaya çıkmıştır. \"Yakıha = onu korurken\" .fiili, \"yahnı= üzerine kapanıyor\" fiilinin tefsiridir. Hadistan Çıkan Sonuıar 1. Zimmı bir kafir zina ettiğinde kendisine had cezası uygulamak gereklidir. Çoğunluğun görüşü bu doğrultudadır. Bu konuda Şamlerin muhalefeti sözkonusudur. İbn Abdilben yanılmış ve recm cezasını gerektiren muhsanlığın şartının \"Müslüman olmak\" olduğu noktasında bilginler arasında ittifak bulunduğunu nakletmiştir. Şafillerle, Ahmed b. Hanbel'in bunun için Müslüman olmanın şart olmadığını söyledikleri ileri sürülerek kendisine itiraz edilmiştir. Şafiilerle Ahmed b. Hanbel'in görüşünü \"Recm edilen Yahudi kadınla erkek muhsan idiler\" şeklindeki açık ifade teyid etmektedir. Nitekim bu daha önce geçmişti. Malikilerle, Hanefıierin büyük bir kısmı ve İmam Malik'in hocası Rebl'a, muhsan olmanın şartı Müslüman olmaktır demişlerdir. Onlar yukarıda zikredilen hadise şöyle cevap vermişlerdir: Nebi Sallallahu Aleyhi ve Sellem O Yahudi erkek ve kadını Tevrat'ın hükmüne göre recm etmiştir ve bu hükmün İslamın hükmüyle hiçbir alakası yoktur. Yapılan, sadece kitaplarındaki hükmün kendilerine uygulanmasından ibarettir. Çünkü Tevrat'ta muhsan olanla olmayana recm cezası öngörülmektedir. Bu bilginler ayrıca sözkonusu uygulamanın Nebi Sallallahu Aleyhi ve Sellem'in Medine'ye girdiği ilk günlerde olduğunu söylemişler ve onun kendi şeriatında neshedilinceye kadar Tevrat'ın hükmüne uymak ve ona göre amel etmekle yükümlü olduğunu söylemişlerdir. Dolayısıyla Nebi Sallallahu Aleyhi ve Sellem O Yahudi erkekle kadını Tevrat'ın hükmÜne göre recm etti. Sonra bu hükmün \"Kadınlarınızdan fuhuş yapanlara karşı aranızdan dört şahit getirin. Eğer şahitlik ederlerse, o kadınlan ölüm alıp götürünceye yahut Allah onlara bir yol açıncaya kadar evlerde hapsedin\"(Nisa 15) ayetiyle nesh edildiğini ifade etmişlerdir. Öte yandan bu hüküm, -daha önce geçtiği üzere- muhsan olanla olmayanın cezasının birbirinden ayrılması ile nesh edilmiştir. Muhsan olmayan bir kimsenin recm edilmesi hükmü, Taberi ve başkalarının daha önce zikrettiğimiz rivayetlerinden dolayı tartışmalıdır. Hadisten Çıkan Diğer Sonuçlar 1. Zimmllerin birbirleri aleyhine yapacakları şahitlik kabul edilir. İbnü'I-Arabl, Cabir hadisindeki \" ....... = şahitleri çağırdı\" ifadesinin manasının zinalarını itiraflarına İslamın şal1iHerini çağırdı şeklinde olduğunu ileri sürmüştür. \"Onları şahitlerin şehadetiyle recm etti\" ifadesi, suçlarını itiraflarına beyyine bulunması dolayısıyla recm etti demektir. Bu tevil, aynı hadisteki \"Erkeğin organını kadının organı içinde sürme çubuğunun sürmedanlıktaki hali gibi gördüler \"(Ebu Davud, Hudud) hadisiyle reddedilmiştir. Bu hadis şahitliğin itirafla değil, bizzat müşahede ile olduğunu apaçık göstermektedir. Kurtubi şöyle demiştir: Fıkıh bilginlerinin çoğunluğuna göre bir kafirin bir Müslümanın veya bir kafirin aleyhine had suçu veya başka bir konuda yapacağı şahitlik kabul edilmez. Bu konuda seferi olmakla, mukim bulunmak arasında fark yoktur. Tabiun alimlerinden bir grupla, bazı fıkıh bilginleri şahitlik edecek bir Müslüman bulunmadığı takdirde kafirlerin şehadetini kabul etmiştir. Ahmed b. Hanbel bu hükümden -şahitlik edecek bir Müslüman bulunmadığında hükmünden- seferilik halini istisna etmiştir. Nevevi şöyle der: Doğru olanı Nebi Sallallahu Aleyhi ve Sellem'in O Yahudi erkekle kadını itirafları üzerine recm ettiğidir. Cabir hadisi sabit olsa bile her halde şahiHer Müslümandılar. Aksi takdirde MüslÜman olmayanların şehadetine itibar edilmez. Buradan anlaşılıyor ki o Yahudi erkek ve kadın zinalarını kendilerini ikrar etmişlerdi. 2. Kafirlerin nikahları sahihtir. Çünkü muhsanlığın sabit olması, sahih bir nikahın sabit olmasına bağlıdır",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 6843,
			"arabicnumber": 6843,
			"text": "",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 6844,
			"arabicnumber": 6844,
			"text": "Aişe r.anha şöyle demiştir: Ebu Bekir benim yanıma geldi. Resulullah Sallallahu Aleyhi ve Sellem O sırada başını dizimin üzerine koymuş vaziyette idi. Ebu Bekir \"Sen Resulullah Sallallahu Aleyhi ve Sellem'i de insanları da yollarından alıkoydun. Halbuki onlar su başında değiller\" dedi ve beni azarladı. İki eliyle de böğrümü dürtmeye başladı. Kıpırdamama Resulullah Sallallahu Aleyhi ve Sellem'in dizim üzerinde bulunmasından başka bir şey mani olmuyordu. Bu olay üzerine Allahu Teala, teyemmüm ayetini indirdi",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 6845,
			"arabicnumber": 6845,
			"text": "Aişe r.anha şöyle demiştir: (Gerdanlığım kaybolup da insanlar susuz bir yerde ikamet ettikleri zaman) Ebu Bekir benim yanıma geldi, bana şiddetli bir şekilde vurdu ve \"Sen insanları bir gerdanlık sebebiyle yollarından alıkoydun!\" dedi. Hadiste geçen ...... lekeze\" ..... vekeze= vurdu\" fiiliyle aynı manayadır. Fethu'l-Bari Açıklaması: İmam Buharl'nin yukarıda kullandığı başlık, bu konudaki ihtilafı beyan etmek için atılmıştır. Had cezası uygulamak gereken bir köle konusunda onun efendisinin sözkonusu cezayı uygulamak için devlet başkanından (yetkili makamdan) izin istemesi gerekir mi? Yoksa ona hiç danışmadan bu cezayı uygulayabilir mi? Bu konunun açıklaması \"Cariye zina ettiğinde ... \" başlığında geçmişti. İbn Battal şöyle demiştir: Bu iki hadis, bir kimsenin kendi ailesini ve onlardan başkalarını haklı olduğu takdirde -sultan buna izin vermese bile- onun huzurunda te'dib etmesinin caiz olduğunu göstermektedir. Köleyi te'dib insanın kendi ailesini tedib etme niteliklidir. Buna \"Cariye zina ettiğinde ... \" başlığı altında daha önce işaret edilmişti",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 6846,
			"arabicnumber": 6846,
			"text": "Muğire b. Şu'be şöyle demiştir: Sa'd b. Ubade \"Bir erkeği karımla birlikte yakalasam onu kılıcımın keskin ağzıyla vurur öldürürdüm\" demişti. Onun bu sözü Nebi Sallallahu Aleyhi ve Sellem'in kulağına gidince yanında bulunanlara \"Sizler Sa'd'ın bu kıskançlığına şaşıyor musunuz? Emin olunuz ki ben ondan daha kıskancım. Allah da muhakkak benden daha kıskançtır\" buyurdu. Fethu'l-Bari Açıklaması: İmam Buhari burada attığı başlıkta mutlak bir ifade kullanmış ve hükmü beyan etmemiştir. Bu konuda bilginler ihtilaf etmişlerdir. Çoğunluk fıkıh bilginlerine göre karısının yanında yakaladığı kişiyi öldüren kocaya kısas cezası uygulanır. Ahmed b. Hanbel ve İshak şöyle demişlerdir: Koca bu erkeği karısıyla birlikte yakaladığına delil getirebilirse kısas edilmez. (Öldürülen kişinin kanı heder olur.) İmam Şafiı şöyle demiştir: Bir kimsenin karısının yatağında yakaladığı erkek, muhsan olup karısıyla boy abdesti almak gerekecek derecede ilişkiye girdiğini bilecek olursa Allah katında o kişiyi öldürebilir. Fakat yargı açısından kısas cezası sakıt olmaz. Abdurrezzak'ın sahih bir isnadla nakline göre Hanı b. Hizam şöyle demiştir: \"Adamın biri bir erkeği karısıyla aynı yatakta yakaladı ve her ikisini de öldürdü. Bunun üzerine Hz. Ömer aşikare yazdığı mektupta o kişiyi kısas etmelerini emrederken, gizli yazdığı mektupta kendisine diyet yardımında bulunmalarını emretti.\"(Abdurrezzak, Musannef, iX, 435) İbnü'l-Münzir şöyle demiştir: Hz. Ömer'den bu konuda değişik haberler gelmiştir. Bu haberlerin tümünün isnadları munkatıdır. Hz. Ali'ye karısıyla yakaladığı erkeği öldüren kocanın durumu sorulduğunda şöyle cevap vermiştir: Koca dört erkek şahit getirebilirse ne ala! Aksi takdirde bu olayı tamamıyla kapatıp gizlesin. İmam Şafil \"Biz bu hükmü alıyoruz. Bu konuda Hz. Ali'ye muhalif birisi bulunduğunu bilmiyoruz\" demiştir. Hadiste soruyu soran Sa'd Ensardan olup, Hazrec'in ileri gelenlerindendi. Hadisten şer', hükümlere reyle karşı gelinemeyeceği hükmü anlaşılmaktadır",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 6847,
			"arabicnumber": 6847,
			"text": "Ebu Hureyre r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem'e bir bedevi geldi ve \"Ya Resulallah! Benim karım siyah bir oğlan doğurdu\" dedi. Nebi Sallallahu Aleyhi ve Sellem ona \"Senin develerin var mı?\" diye sordu. Bedevi \"evet vardır\" dedi. Resulullah Sallallahu Aleyhi ve Sellem \"Hangi renkteler?\" diye sordu. Bedevi \"kızıl\" diye cevap verdi. Resulullah Sallallahu Aleyhi ve Sellem \"İçlerinde hiç boz olanı var mı?\" dedi. Bedevi \"evet vardır\" diye cevap verdi. Resulullah Sallallahu Aleyhi ve Sellem \"Sence bunlar nasıl boz renkli oldu?\" diye sordu. Bedevi \"Herhalde bir damara çekti\" dedi. Resulullah Sallallahu Aleyhi ve Sellem \"Herhalde senin çocuğun da bir damara çekti\" buyurdu. Fethu'l-Bari Açıklaması: Rağıb el-Isfehanı ta'rizi, şöyle tarif eder: Ta'riz, bir zahiri ve bir de batıni yönü olan ifade biçimidir. Bu sözü söyleyen kimse sözün batını manasını kastederken, zahiri manayı kastettiği görüntüsünü verir. Ta'rizle ilgili olarak lian bölümünae \"Ta'riz yoluyla çocuğun nesebini reddetme\" başlığı altında Ebu Hureyre'nin rivayet ettiği \"karım siyah bir oğlan doğurdu\" diyen bedevi olayının açıklaması yapılırken bir parça üzerinde durmuştuk. Orada bu bedevinin adı hakkında söylenenlerden söz etmiş ve ta'rizin hükmü konusunda bilginler arasında var olan ihtilafı belirtmiştik. Aynı şekilde İmam ŞafiI' nin bu hadise dayanarak ta'riz yoluyla iffete iftiraya açıktan iffete iftira hükmü verilemeyeceği sonucunu çıkardığından bahsetmiştik. Bu konuda Buhari de Şafil'ye uymuştur. Çünkü o, bu hadisi iki yerde zikretmektedir. Orada işaret etmiş olduğum Ma'mer rivayetinin sonunda \"Nebi Sallallahu Aleyhi ve Sellem çocuğunu kabul etmemesine izin vermedi\" cümlesi yer almaktadır. Zührı ise şöyle der: Karı-koca arasında lanetleşme (lian) ancak koca ben zinayı gördüm dediği takdirde yapılır. İbnü't-Tın ise şu açıklamayı yapmıştır: Malikiler yukarıda zikrettiğimiz hadisten bedevi Nebi s.a.v.'e fetva sormak üzere gelmişti. O ta'rizi ile karısına iftira atmayı kastetmiyordu diyerek ayrılmışlardır. Kısaca belirtmek gerekirse ta' riz yoluyla iftira, ancak iftira atmak istediği bilinen kimse için geçerlidir. Bu da ta'rizde kişinin iradesine vakıf olmak imkansız olduğu için had cezası olmadığı görüşünü güçlendirmektedir. Doğruyu en iyi Allahu Teala bilir",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 6848,
			"arabicnumber": 6848,
			"text": "Ebu Büreyde'nin nakline göre Nebi Sallallahu Aleyhi ve Sellem Allah'ın tayin ettiği hadlerden birinde olmadıkça hiçbir kimseye on sopadan daha fazla vurulamaz\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 6849,
			"arabicnumber": 6849,
			"text": "Abdurrahman b. Cabir'in Nebi Sallallahu Aleyhi ve Sellem'den işiten bir kimseden nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"Allah'ın tayin ettiği hadlerden birinde olmadıkça on sopadan daha fazla ceza yoktur\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 6850,
			"arabicnumber": 6850,
			"text": "Ebu Burde el-Ensari'nin nakline göre Nebi Sallallahu Aleyhi ve Sellem Allah'ın tayin ettiği hallerden birinde olmadıkça hiçbir kimseye on kamçıdan fazla vurmayınız\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 6851,
			"arabicnumber": 6851,
			"text": "Ebu Hureyre şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem (sahur yemeden) orucu birbirine eklemeyi (savm-i visal) yasaklamıştı. Müslümanlardan bazıları ona \"Ya Resulallah! Sen bir günün orucunu öbür güne ekliyorsun\" dediler. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem \"Sizin hanginiz bana benzer? Ben, Rabbim beni doyurur ve içirir bir halde gecelerim\" buyurdu. Fakat sahabiler (sahursuz) oruç tutmaktan vazgeçmemekte ısrar edince, Resulullah Sallallahu Aleyhi ve Sellem onlara bir gün visal orucu tutturdu. Sonra (üçüncü günü) hilali gördüler. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem onların visalorucundan vazgeçmediklerini görünce, ceza verici bir tavırla \"Eğer ay geri kalsaydı, ben sizlere dahafazla visal orucu tuttururdum\" buyurdu",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 6852,
			"arabicnumber": 6852,
			"text": "Abdullah b. Ömer'in nakline göre sahabiler Nebi Sallallahu Aleyhi ve Sellem'in zamanında (ölçüp tartmaksızın) göz kararı pazarlıkla yiyecek maddesi satın aldıklarında onları bulundukları yerden teslim alıp da kendi evlerine taşıyıncaya kadar satmaktan men eder, böyle yapmayanlar dövüıürmüş",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 6853,
			"arabicnumber": 6853,
			"text": "Aişe r.anha \"Nebi Sallallahu Aleyhi ve Sellem kendisine arz edilen hiçbir şey hakkında Allah'ın haramlarından biri çiğnenilmediği müddetçe kendi nefsi için intikam almamıştır. Haramlardan biri çiğnendiğinde de Allah için intikam alırdı\" demiştir. Fethu'l-Bari Açıklaması: ......Ta'zir ....... azere\" kökünden türemedir. Bu kökün anlamı engelleme ve geri çevirme demektir. Ta'zir bir şahsı kaçındırmak demektir. Tıpkı düşmanlarını kendisinden savuşturup, ona zarar vermelerini önlemek gibi. \"Ve amentum bi'r-rusuli ve azzertümuhum =Nebilerime inanır, onları desteklerseniz\"(Maide 12) ayetinde kelime bu anlamda kullanılmıştır. Bu bir kimsenin çirkin bir fiili işlemesine engelolmak gibidir. '\\'r':'\\.4.l1 •.Jr\" tabiri de buna bir başka örnektir. Bu cümlenin anlamı hakim sanık bir kez daha çirkin fiili işlemesin diye onu te'dib etti demektir. Ta'zir, kişinin durumuna uygun olarak sözle olabildiği gibi, fiille de olur. Buharl'nin attığı başlıktaki \"Edeb\" kelimesinden maksat, te'dib etmektir. Bu kelimenin ta'zir kelimesine atfedilmesinin sebebi şudur: Ta'zir masiyet sebebiyle yapılırken, te'dib bundan daha geneldir. çocuğu te'dib, öğretmenin te'dibi bu kavrama dahildir. İmam Buhari ta'zir ve te'dibin miktarını soru işaretiyle belirterek -biraz sonra açıklayacağımız üzere- bu konudaki ihtilafa işaret etmektedir. \"Allah 'zn tayin ettiği hallerden birinde olmadıkça ... \" Bu ifadenin zahirinden anlaşılan \"had\"den maksadın, şari (Allah) tarafından hakkında belli sayıda sopa veya vurma ya da belli bir ukubet tayin edilen ceza olduğudur. Bunlardan üzerinde ittifak edilenler, zina, hırsızlık, sarhoş verici madde içmek, hirabe (yol kesme, eşkiyalık), zina iftirası, adam öldürme, kısasen öldürme ve organlara kısasen zarar verme, dinden dönme sebebiyle katı cezalarıdır. Bu cezalardan son ikisine \"had\" denilip, denilmeyeceği konusunda bilginler arasında ihtilaf vardır. İşleyen kimsenin cezayı hak ettiği birçok suça \"had\" veya başka bir şey denilip denilmeyeceği konusunda ihtilaf edilmiştir. Bunlar bırakılan emaneti inkar, homoseksüel ilişki (livata), hayvanlarla cinsel ilişki, bir kadının erkek bir hayvanla ilişkisi, kadın kadına sevicilik (lezbiyenlik), darda kalmayan bir kimsenin ölmüş bir hayvanın etini yiyip kanını içmesi, domuz eti yeme bu suçlardan bazılarıdır. Sihir yapma, içki içme iftirasında bulunma, tembellik ederek namaz kılmama, Ramazan orucunu yeme ve üstü kapalı sözcüklerle (ta'riz) zina iftirasında bulunma da böyledir. Bazı bilginler yukarıda zikrettiğimiz hadislerde geçen \"had\" kelimesinden maksadın Allah hakkı olduğu kanaatine varmışlardır. Selef bilginleri bu hadisin anlamı üzerinde ihtilaf etmişlerdir. Leys, kendisinden nakledilen meşhur rivayete göre Ahmed b. Hanbel, İshak, bazı Şafiı bilginleri bu hadisin zahirini almışlarqır. İmam Malik, Şafii ve İmam Ebu Hanıfe'nin iki öğrencisi, hadiste ifade edilen On sayısının üzerine çıkmak caizdir dedikten sonra ihtilaf etmişlerdir. İmam Şafii hiçe bir zaman had cezalarının en alt sınırına varılmaz demiştir. Ancak burada itibar edilecek olan hür bir kimseye uygulanacak had midir, yoksa köleye uygulanacak had midir? Bu konuda iki görüş vardır. Bir görüşe veya biryaklaşıma göre her ta'zir cezası kendi cinsinin had cezasından belirlenir ve o miktarı aşmaz. \"Bu konuda, had cezasına ulaşılmaz\" diyen Evzaı'nin görüşünün zorunlu sonucu da budur. Evzaı bu konuda ayrıntıya gitmemiştir. Diğer fıkıh bilginleri ise şöyle demişlerdir: Ta'zirde cezanın tayini hangi miktara çıkarsa çıksın devlet başkanına (hakime) kalmıştır. Ebu Sevr'in tercihi de bu yöndedir: Hz. Ömer'in, Ebu Musa'ya bir mektup yazarak \"ta'zir cezasında yirmiden daha fazla vurulamaz\" dediği nakledilmiştir. Hz. Osman'ın otuzdan daha fazla vurulamaz dediği rivayet edilirken, Hz. Ömer yüz kamçıya kadar çıkılabilir demiştir. İbn Mesud'dan da bu doğrultuda bir görüş nakledilmiştir. İmam Malik, Ebu Sevr ve Ata şöyle demişlerdir: Ta'zir cezası ancak bir suçu tekrar tekrar işleyen kimseye verilir. Bir kez günah işleyen kimseye had cezası verilemeyeceği gibi, ta'zir de uygulanmaz. Ebu Hanife'nin ta'zirde kırk sopaya çıkılmaz dediği nakledilmiştir. İbn Ebi Leyla ve Ebu Yusuf ise doksanbeş sopanın üstüne çıkılmaz demişlerdir. İmam Malik ve Ebu Yusuf'tan gelen bir nakle göre seksenin üzerine çıkılmaz. Bu bilginler yukarıdaki hadise birçok cevap vermişlerdir. Bunların içinden bazıları yukarıda geçti. Bu cevaplardan birisi de ta'zir cezasının sadece sopa vurularak uygulanacağıdır. Mesela bastonla veya elle vurmaya gelince, burada hadiste belirtilen rakamın üstüne çıkmak mümkündür. Fakat had cezalarının en düşük miktarının üzerine çıkılamaz. Hadise verilen cevaplardan birisi de onun mensuh olduğudur. Hadisin nesh edildiğini sahabenin icmaı göstermektedir. Buna bu görüşü bazı tabiun alimleri ifade etmişlerdir denilerek itiraz edilmiştir. Leys b. Sa' d' ın görüşü bu doğrultuda olup, İslam beldesinin belli başlı merkezlerinde bulunan fıkıh bilginleri de (fukahau'l-emsar) bu görüşü benimsemişlerdir. Hadise verilen cevaplardan bir diğeri de hadisin kendisinden daha güçlü olan bir delille çeliştiğidir. Bu güçlü delil, ta'zir cezasının had cezalarından farklı olacağına dair yapılmış icmadır. Yukarıda zikrettiğimiz hadis, ta'zirin on veya daha az bir sayıyla belirlenmesini gerektirmektedir. Dolayısıyla bu, had cezası gibi olmaktadır. Hadis bir de ta'zir cezası devlet başkanının (hakimin) görüşüne bırakılmıştır. Ağırlaştırmak ve hafifleştirmek onun görevidir şeklindeki icma ile çelişmektedir. ikinci hadis visal orucunu yasaklama hadisidir. Hadise bu başlık altında yer verilmesinden maksat, \"ceza verici bir tavırla onlara visal orucu tutturdu\". cümlesidir. ibn Battal'ın nakline göre Mühelleb şöyle demiştir: Bu hadisten anlaşılan ta'zir cezası devlet başkanının (hakimin) takdirine bırakılmıştır. Çünkü Nebi Sallallahu Aleyhi ve Sellem \"eğer ay geri kalsaydı, ben sizlere daha fazla visal orucu tuttururdum\" buyurmuştur. Bu ifade devlet başkanının (hakimin) ta'ziri uygun gördüğü kadar arttırmaya yetkisi olduğunu göstermektedir. Durum Mühelleb'in dediği gibidir. Fakat bu, yukarıda zikredilen hadisle çelişmez. Çünkü hadis belli bir sayıda vurma veya sopalama hakkında gelmiştir. Dolayısıyla belli bir şeyle ilgilidir. Bu visal orucu ise terk edilen bir şeyle ilgilidir. O da orucu bozan şeylerden kişinin kendini tutmasıdır. Burada çekilen acı aç ve susuz bırakma sebebi iledir. Açlığın ve susuzluğun şahıslardaki etkisi gerçekten birbirinden çok farklıdır. ifadeden öyle -anlaşılıyor ki Nebi Sallallahu Aleyhi ve Sellem'in visal orucu tutturdu ğu kişiler, genelde bunu başarabilecek güçte olankimselerdi. Nebi s.a.v., visal orucu onların aciz kalmalarıyla sonuçlanmış olsaydı, bunun onları vazgeçirmekte daha etkili olacağına işaret etmektedir. Hadisten anlaşılan ta'zirden maksadın caydırmayı sağlayan bir ceza olduğudur. Bu da değneğin veya vurmanın daha hafif veya daha ağır olması şeklinde çeşitli uygulamalar yapmak suretiyle on sopayla mümkün olur. Doğruyu en iyi Allahu Teala bilir. Bu hadisten aç bırakma veya benzeri manevi şeylerle ta'zir uygulamanın caiz olduğu da anlaşılmaktadır. \"Nebi s.a.v.'in zamanında (ölçüp tartmaksızın) göz kararı pazarlıkla yiyecek maddesi satın aldıklarında ... \" Bu hadisin açıklaması büyu' bölümünde geniş geniş yapılmıştı. Hadisten şer'! emre muhalif olan ve fasid akidere başvuran kimselere vurma suretiyle te'dib cezası uygulanabileceği, çarşı ve pazarlara muhtesib görevlendirmenin meşru olduğu anlaşılmaktadır. Hadiste zikredilen dövme dördüncü hadisten anlaşıldığı üzere emrekarşı gelen kimse içindir şeklinde açıklanmıştır. Bu hadisin geniş bir açıklaması, Nebi s.a.v.'in Sıfatı Bölümünde ge.çmlşti",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 6854,
			"arabicnumber": 6854,
			"text": "Sehl b. Sa'd şöyle demiştir: Ben onbeş yaşında ikenbir karı-kocanın karşılıklı lian uygulamalarına şahit oldum. Nebi Sallallahu Aleyhi ve Sellem onların lianlarından sonra aralarını ayırdı ve boşandılar. Kadının kocası \"Ya Resulallah! Ben bu kadını nikahımda tutarsam ona iftira etmiş olurum\" dedi. Süfyan, ben ez-Zührl'den bundan sonrasını şöyle ezberledim dedi: \"Eğer kadın şöyle şöyle sıfatta bir çocuk doğurursa adam kadın aleyhinde doğru söylemektedir. Eğer kadın şöyle şöyle nitelikte kızılca keler gibi kırmızı bir çocuk doğurursa adam iddiasında yalancıdır\" dedi. Süfyan şöyle dedi: Ben ez-Zührl'nin \"Bu kadın, sevilmeyen sıfatta bir çocuk doğuıdu\" dediğini işittim",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 6855,
			"arabicnumber": 6855,
			"text": "Kasım b. Muhammed şöyle demiştir: İbn Abbas lian yapan iki kişiden söz etti. Abdullah İbn Şeddad işte o kadın, Resulullah Sallallahu Aleyhi ve Sellem'in \"Eğer ben bir kadını beyyinesiz olarak recm etseydim bunu recm ederdim\" buyurduğu kadındır dedi. İbn Abbas hayır, bu, çirkinliği ve fücuru açıktan yapan kadındır dedi",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 6856,
			"arabicnumber": 6856,
			"text": "İbn Abbas r.a. şöyle demiştir: Nebi Sallallahu Aleyhi ve Sellem'in huzurunda liandan söz edildi. Asım b. Adiy bu konuda bir söz söylemiş, sonra evine gitmişti. Bundan sonra ona kendi kavminden olan bir kişi geldi ve kendi karısının yanında bir adamı yakaladığını söyleyip şikayette bulundu. Bunun üzerine Asım \"Ben bu belaya ancak kendi sözümden dolayı uğramışımdır\" dedi ve o adamı Nebi Sallallahu Aleyhi ve Sellem'in yanına götürdü. Adam Efendimize karısını birlikte yakaladığı kişiyi haber verdi. Şikayetçi olan kişi sarı benizli, az etli, düz saçlı idi. Karısıyla birlikte yakaladığını iddia ettiği kişi ise esmer, kalın ve dolgun bacaklı, çok etli, şişman bir kimse idi. Resulullah Sallallahu Aleyhi ve Sellem \"Allahümme beyyin= Allah'ım beyan buyur\" dedi. Sonunda kadın kocasının yanında yakaladığını söylediği adama benzer bir çocuk doğurdu. Resulullah Sallallahu Aleyhi ve Sellem bu karı koca arasında lian yaphrdl. Abdullah b. Şeddad bulundukları mecliste Abdullah b. Abbas'a hitaben \"İşte o kadın Resulullah Sallallahu Aleyhi ve Sellem'in \"Eğer ben beyyinesiz olarak recm etseydim, işte bu kadını recm ederdim\" buyurduğu kadındır deyince, İbn Abbas \"hayır, o kadın, İslamda kötülüğü açıktan açığa işleyen bir kadındı\" dedi. Fethu'l-Bari Açıklaması: \"Genelde çirkin fiile delalet eden bir şey yapmak\" Bu başlıktan maksat, söz konusu fiilin hükmünün ne olduğudur. \"Çirkin fiile delalet eden bir şey yapmak\" tabirinden maksat, elde herhangi bir beyyine veya kişinin ikrarı olmaksızın genelde fuhşa delalet eden bir şey yapmak demektir. Başlıkta geçen .\"lath\", kötülük iftirasında bulunmaktır. \"Lataha fulanun bi keza\" birisi birisine şöyle bir kötülük attı demektir. ......... ona bir kötülük attı ve töhmette bulundu demektir. Töhmet, bu fiil ile suçlanan kimseye normal yoldan bile olsa tahkik etmeksizin suçlamada bulunmak demektir. İmam Buhari bu konuda iki hadise yer vermektedir. Bunlardan birisi, Sehl b. Sa'd'ın karşılıklı !ian yapan karı-koca olayı hakkında naklettiği hadistir. Bu hadis muhtasar olarak nakledilmiştir. Hadisin geniş bir açıklaması lian bölümünde geçmişti. Mühelleb şöyle demiştir: Hadisten bir kimse zina ile itham edilse bile elde beyyine veya kişinin ikrarı olmaksızın ona had cezası uygulanamayacağı anlaşılmaktadır. Nevevi şöyle demiştir: \"Kötü bir şeyi ortaya koyma\" kişinin o kötülükle meşhur olması, bunun yaygın hale gelmesi ancak ispat için bir beyyinenin bulunmaması ve o kişinin de suçunu itiraf etmemesi demektir. Hadis bir kişinin işlediği suçun halk arasında yaygın hale gelmesi dolayısıyla ona had cezası uygulamanın gerekmediğine delildir",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 6857,
			"arabicnumber": 6857,
			"text": "Ebu Hureyre r.a.'in nakline göre Nebi Sallallahu Aleyhi ve Sellem bir keresinde \"Helak edici yedi şeyden sakınınız!\" buyurdu. Sahabiler \"Ya ResulaIlah! Nedir onlar?\" diye sordular. Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: Allah'a ortak koşmak, sihir yapmak, Allah'ın haram kıldığı cana haksız yere kıymak, faiz kazancı yemek, yetim malı yemek, düşmana hücum sırasında savaştan kaçmak, namuslu, kötülüklerden habersiz mu'min kadınlara zina isnadında bulunmaktır. \" Fethu'l-Bari Açıklaması: \"İffetii kadınlara zina iftirası atmak\" onlara iftirada bulunmak demektir. Burada \"el-muhsanat\" kelimesinden maksat, iffetli ve hür kadınlar demektir. Bu, sadece evli kadınlar demek değildir. Tam tersine bakire olan kadına zina iftirasının cezası da bilginlerin icmaı ile aynıdır. Yukarıda zikredilen birinci ayet, iffete iftira suçunun cezasını açıklarken, ikincisi bunun büyük günahlardan olduğunu ifade etmektedir. Karşılığında lanet veya azap tehdidi bulunan ya da had cezası getirilmiş olan bütün fiiller büyük günahtırlar. Bu konuda esas alınması gereken tanım budur. Böyle bir açıklamayla bu bölümde zikredilen hadisle iki ayet birbiriyle uyumlu hale gelmektedir. İffetli erkeklere zina iftirası atmanın hükmünün, iffetli kadınlara zina iftirasında bulunmayla aynı olduğu noktasında bilginlerin icmaı vardır. Bundan sonraki bölümde açıklayacağımız üzere kölelere zina isnadında bulunmanın hükmü ihtilaflıdır. \"Helak edici yedi şeyden sakınınız.\" Mühelleb şöyle demiştir: Büyük günahlara bu ismin verilmesi, onların bunları işleyen kimseleri helak etmesi sebebiyledir. Bizce burada\"r-ll\" kelimesi, büyük günah anlamındadır. Nesai ve Taberanl'nin rivayet ettikleri İbn Hibban ve Hakim'in sahih olarak degerlendirdikleri ve Ebu Hureyre ile Ebu Said'in naklettikleri bir hadise göre Nebi s.a.v.\"Beş namazı kılıp, yedi büyük günahtan kaçman hiçbir 'kul yoktur ki ona cennetin kapılan açılmasın\" buyurmuştur. (Nesai, Zekat; İbn Hibban, Sahih, V, 43; Hakim, el-Müstedrek, I, 316; Taberani, el-Mu'cemu'l-Kebir, IV, 128) İbn Abdusselam şöyle demiştir: Büyük günahın hiçbir itirazIa karşılaşmayacağı tanımına rastlamadım. Bence en uygun tarifi şudur: Büyük günah, işleyenin dinini hafife aldığını nasla bildirilen büyük günahların en küçüğünün gösterdiği kadar gösteren günahtır. İbn Abdusselam bir de şunu der: Bazıları büyük günahı, işleyene tehdit veya lanet getirilen her türlü günahtır şeklinde tanımlamışlardır. Bizce bu son tanım diğerinden daha kapsamlıdır. Bu tanıma \"ihlal edilmesi had cezası gerektirir\" şeklinde bir ilave yapmak gerekir şeklinde bir itiraza yer yoktur. Çünkü hakkında had cezası uygun görülen her fiil, onu yapan kişiye yönelik tehditten hali değildir. Kurtubl'nin el-Müfhim isimli eserinde yaptığı tarif büyük günah tanımlarının içinde en güzellerinden biridir: Kitap veya sünnetin ya da icmanın hakkında \"büyük günah\" deyimini kullandığı ya da karşılığında şiddetli bir ceza olduğu bildirilen veya had cezası konulan ya da şiddetli bir kınama yapılan fiiller büyük günahtır. Buna göre hakkında tehdit veya lanet ya da fısk terimlerinin kullanıldığı fiilleri Kur'an ya da sahih ve hasen hadislerden araştırmak ve gerek Kur'an, gerek sahih ve hasen hadislerde büyük günah olduğu bildirilen fiillere bunları eklemek uygun olur. Bu fiillerin toplamı kaça ulaşırsa ulaşsın bundan o fiilleri bir bir sıralamayı öğrenmek mümkündür. Ben bunları biraraya toplamaya başladım. Allahu Teala'tan lütfu ve inayetiyle bunları yazmaya yardımcı olmasını dilerim. Hallmı, el-Minhac isimli eserinde şöyle der: Büyük ve küçüğü olmayan hiçbir günah yoktur. Bazen küçük günah belli bir karine dolayısıyla büyük günaha dönüşebilirken, bazen büyük günah aynı şekilde çirkin bir fiile dönüşebilir. Bundan Allah'ı inkar etmek müstesnadır. Çünkü bu büyük günahların en çirkinlerindendir. Allah'ı inkar etme günahının küçüğü yoktur. Biz de şunu ekleyelim: Bununla birlikte bu günah da çirkin ve daha çirkin şeklinde iki kısma ayrılır. Halımı bundan sonra söylediklerine örnekler getirir. İkincisi ise haksız yere bir cana kıymak gibi bir fiildir. Bu büyük günahtır. Bir kimse kendi usulünü (babası, babasının babası. .. ) veya füruunu (oğlu, oğlunun oğlu ... ) ya da kan bağı olan yakın akrabasını öldürse veya Harem' de veya haram olan ayda katı fiilini işlese bu bir çirkin fiildir (fahişe). Zina büyük bir günahtır. Bir kimse komşusunun hanımıyla veya kan bağı olan akrabasıyla ya da Ramazan ayında veya Harem bölgesinde bu fiili işleyecek olursa, bunun adı fahişedir. içki içmek büyük günahtır ama Ramazan ayında gündüz içilirse veya Harem-i Şerif'te ya da açıktan açığa içilecek olursa bu da fahişedir. Nisab miktarından daha az bir değerde mal çalmak küçük günahtır. Malı çalınan kişinin bundan başka malı yoksa ve malı olmaması zaafa yol açıyorsa bu büyük günahtır. Halimi bu konuda daha bir çok örnek verir: Bu örneklerin çoğunda tenkit edilecek noktalar bulunmaktadır. Fakat bu onun alametidir. Yapılan bu ayırım güzel bir metod olup, dikkate almakta herhangi bir sakınca yoktur. Büyük ve küçük günah ayırımının dayanağı mefsedetin ağırlığı veya hafifliğidir. Doğruyu en iyi Allahu Teala bilir",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 6858,
			"arabicnumber": 6858,
			"text": "Ebu Hureyre r.a. şöyle demiştir: Ben Ebu'l-Kasım Nebi Sallallahu Aleyhi ve Sellem'den işittim. Şöyle buyuruyordu: \"Her kim maliki olduğu kölesine -söylediğinden berı olduğu halde- zina isnad ederse kıyamet gününde sapa ile dövülür. Ancak kölenin onun söylediği gibi olması müstesnadır.\" Fethu'l-Bari Açıklaması: imam Buhari yukarıya attığı başlıkta geçen \"\" kelimesini rivayette yer alan sözcüğe uyarak kullanmaktadır. Yoksa bu konuda köle ile cariye arasında fark yoktur. Bu konudaki hüküm şöyledir: Bir köle iffete iftira suçu işlediğinde ister erkek, ister kadın olsun hürlere verilen cezanın yarısını alır. Çoğunluğu oluşturan fıkıh bilginlerinin görüşü bu doğrultudadır. \"Söylediğinden berı olduğu halde.\" Bu cümle, Arapça grameri açısından hal cümlesidir. \"Ancak kölenin onun söylediği gibi olması hali müstesnadır.\" Yani bu durumda o kişiye iffete iftira cezası verilmez. Mühelleb şöyle demiştir: Bilginler, hür bir kimse bir köleye zina iftirasında bulunursa kendisine had cezası uygulamak gerekmediği konusunda görüş birliği etmişlerdir. Bu hadis, sözkonusu hükmün isabetli olduğunu göstermektedir. Zira efendiye kölesine zina iftirası attı diye dünyada sopa cezası uygulamak gerekli olsaydı, Nebi Sallallahu Aleyhi ve Sellem ahirette alacağı cezayı ifade ettiği gibi bunu da belirtirdi. Rasulullah'ın sözkonusu cezayı ahirete mahsus kılması, hür olan kimseleri kölelerden ayırmak içindir. Ahirete gelince, efendilerin köle üzerindeki mülkiyetleri ortadan kalkmakta ve kölelerle hürler had cezası açısından birbirlerine eşit olmaktadırlar. Dolayısıyla bunlardan her biri, mağdur olan taraf affetmedikçe kısasen hakkını alır. Ahirette üstünlük sadece takva açısındandır. Biz de şunu ekleyelim: Mühelleb'in icma olduğu yolundaki nakli tartışılır. Abdurrezzak'ın nakline göre İbn Ömer' e başkasına ait Ümmü Veled'e zina iftirası atan kimsenin durumu soruldu. Hz. Ömer şöyle cevap verdi: O kişiye hakir ve zelil kılıcı had cezası vurulur. Bu haber sahih bir isnadla rivayet edilmiştir. (Abdurrezzak, Musannef, VII, 439) Hasan-ı Basri ve Zahiriye alimlerinin görüşü bu doğrultudadır. İbnü'l-Münzir şöyle demiştir: Bir ümm-ü velede zina iftirasında bulunan kimsenin hakkında bilginler ihtilaf etmişlerdir. İmam Malik ve bir grup bilgin, iftirayı atana had cezası uygulamak gereklidir demişlerdir. Efendinin ölümünden sonra yapılan iftira konusunda İmam Şafil'nin görüşüne yapılan kıyasın hükmü bu doğrultudadır. Efendinin ölümüyle ümm-ü veled hür olur diyen bütün görüşlerin mukayesesinden çıkan sonuç da budur. Hasan-ı Basri'nin ümm-ü velede zina iftirasında bulunan kimseye had cezası uygulamak gerekmediği görüşünde olduğu nakledilmiştir. İmam Malik ve Şafii ise köle zannederek hür bir kimseye zina iftirasında bulunan kişiye had cezasını uygulamak gerekli olur demişlerdir",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 6860,
			"arabicnumber": 6860,
			"text": "",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 81
			}
		}
	]
}