{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"86": "Limits and Punishments set by Allah (Hudood)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6772,
			"arabicnumber": 6772,
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6773,
			"arabicnumber": 6773,
			"text": "Bize Katâde tahdîs etti ki, Enes ibn Mâlik (radıyallahü anh):Peygamber(sallallahü aleyhi ve sellem) şarâb içmede hurma dalları ve na'llerle dövme cezası uyguladı, Ebû Bekr de kırk deynek vurdu, demiştir",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6774,
			"arabicnumber": 6774,
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6775,
			"arabicnumber": 6775,
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6776,
			"arabicnumber": 6776,
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6777,
			"arabicnumber": 6777,
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6778,
			"arabicnumber": 6778,
			"text": "Bize Ebû Husayn tahdîs edip şöyle dedi: Ben Omer ibn Saîd en-Nahaî'den işittim, şöyle dedi: Ben Alî ibn Ebî Tâlib (radıyallahü anh)'den işittim, şöyle dedi: Ben herhangi bir kimseye hadd vurup da onun ölmesiyle nefsimde üzüntü duymuş değilimdir. Ancak böyle bir üzüntüyü içki içen kimse hakkında duymuşumdur. Şayet içki içen kimse hadden dolayı ölseydi, muhakkak ben onun diyetini verirdim. Bunun da sebebi şudur: Çünkü Rasûlüllah(sallallahü aleyhi ve sellem) içki içenin haddi hakkında bize sabit bir aded kaanûnlaştırmamıştır",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6779,
			"arabicnumber": 6779,
			"text": "es-Sâib ibn Yezîd (radıyallahü anh) şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem) zamanında, Ebû Bekr'in emirliğinde ve Omer'in halifeliğinin baş tarafında bize şarâb içmiş olan sarhoş getirilirdi de, bizler ona doğru kalkar, ellerimizle, ayakkabılarımızla ve ridâlarımızla döverdik. Omer'in emirliğinin sonunda, Omer sarhoşa kırk deynek vurdu. Nihayet insanlar içki içmek ve fesâd çıkarmakta ileri gittikleri zaman, Omer sarhoşlara seksen deynek vurdurdu",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6780,
			"arabicnumber": 6780,
			"text": "Bize el-Leys tahdîs edip şöyle dedi: Bana Halîd ibn Yezîd, Saîd ibn Ebî Hilâl'den; o da Zeyd ibn Eslem'den; o da babası (Omer'in hizmetçisi olan) Eşlem el-Habeşî'den; o da Omer ibnu'l-Hattâb (radıyallahü anh)'dan şöyle tahdîs etti:Peygamber(sallallahü aleyhi ve sellem) zamanında Abdullah isminde bir adam vardı. İnsanlar tarafından \"Hımâr ( = Eşek)\" lakabı ile lakablandırılırdı. Bu zât Rasûlüllah'ı arasıra güldürürdü. Peygamber bu adama, şarâb içtiği için deynekleme cezası uygulamıştı. Bir gün bu Abdullah yine huzura getirildi, Peygamber deyneklenmesini emretti, o da deyneklendi. Topluluktan birisi: Yâ Allah, şu adama la'net et, içki yüzünden ne kadar da çok huzura getiriliyor! dedi. üzerine Peygamber: \"Ona la'net etmeyiniz! Vallahi kesin olarak bilmişimdir ki bu zât muhakkak Allah'ı ve Rasûlü'nü sevmektedir\" buyurdu",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6781,
			"arabicnumber": 6781,
			"text": "Ebû Hureyre (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem)'e sarhoş bir adam getirildi. Peygamber onun dövülmesini emretti. Artık bizden kimimiz onu eliyle dövüyor, kimimiz ayakkabısıyle dövüyor, kimimiz de elbisesiyle dövüyordu. Dövme işi bitince içimizden bir adam: Buna ne oluyor! Allah bunu zelîl kılsın! dedi. üzerine Rasûlüllah: \"Kardeşinizin aleyhinde şeytânın yardımcıları olmayınız!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6782,
			"arabicnumber": 6782,
			"text": "Bize Fudayl ibn Gazvân, İkrime'den; o da İbn Abbâs radıyallahü anhüma'tan tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem) şöyle buyurmuştur: \"Zina edici kişi zina ettiği sırada mü'min olduğu hâlde zina edemez. Hırsız kişi de hırsızlık ettiği sırada mü'min olduğu hâlde hırsızlık yapmaz",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6783,
			"arabicnumber": 6783,
			"text": "Bize (Süleyman ibn Mihrân) el-A'meş tahdîs edip şöyle dedi: Ben Ebû Salih'ten işittim; o da Ebû Hureyre(radıyallahü anh)'den ki, Peygamber(sallallahü aleyhi ve sellem) şöyle buyurmuştur: \"Allah şu hırsız kişiye la'net etsin ki, o bir miğfer çalar da o sebeble eli kesilir, bir ip çalar da o yüzden eli kesilir!\" Ebû Hureyre'nin bu hadîsini rivayet edenler, hadîsteki \"Beyda\" lafzının harbde başa giyilen demir miğfer olduğunu, ipin de en az kıymeti birkaç dirheme müsâvî olan nevi'den değerli birşey olduğu görüşünde bulunurlardı, demiştir",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6784,
			"arabicnumber": 6784,
			"text": "Ubâdeibnu's-Sâmit (radıyallahü anh) şöyle demiştir: Bizler bir mecliste Peygamber(sallallahü aleyhi ve sellem)'in yanında idik. Bizlere şöyle buyurdu: \"Benimle şu şartlar üzere bey'at ediniz: Allah'a (ibâdette) hiçbirşeyi ortak kılmamak, hırsızlık etmemek, zina eylememek...\" diye sayıp el-Mümtehıne: 13. âyetinin hepsini okudu. \"İçinizden bu and ve sözünde duranın ecri Allah'a âiddir. Bu dediklerimden birini yapıp da ondan dolayı dünyâda ikaaba uğratılırsa, bu ikaab ona keffârettir. Bunlardan bir suçu yapıp da yaptığı fiili Allahü Taâlâ örterse (onun işi de Allah'a âiddir), Allah dilerse onu mağfiret eder, dilerse onu azâblandırır",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6785,
			"arabicnumber": 6785,
			"text": "Abdullah ibn Omer (radıyallahü anh) şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem) Veda Haccı'nda (Minâ'da Nahr günü yaptığı hutbesinde): \"Dikkat edin! Hürmetçe en büyük bilmekte olduğunuz ay hangisidir?\" buyurdu. Bu hacc ayımız değil mi? dediler.Rasûlüllah: \"Hürmetçe en büyük bilmekte olduğunuz belde hangisidir?\" buyurdu. Bu Mekke beldemiz değil mi? dediler.Rasûlüllah: \"Hürmetçe en büyük bilmekte olduğunuz gün hangisidir?\" buyurdu. Bu hacc günlerimiz değil mi? dediler.(Bu mukaddimeden sonra)Rasûlüllah: \"Şübhesiz ki Allah Tebâreke ve Taâlâ sizlere bu ayınızda, bu beldenizde, bu gününüzün haram olduğu gibi (birbirinize) kanlarınızı, mallarınızı, namuslarınızı haram kılmıştır (bunlar her türlü tecâvüzden korunmuştur). Ancak bir hakk karşılığında olmak müstesnadır. Dikkat edin! Bunları sizlere tebliğ ettim mi?\" buyurdu. soruyu Rasûlüllah üç kerre sordu. Sahâbîler her defasında O'na: Evet, tebliğ ettin! diye cevâb veriyorlardı. Sonra Rasûlüllah: \"Sizlere yazık -yahut: Sizlere veyl olur- sakın benden sonra birbirlerinizin boyunlarına vuracak surette birbirlerinizi küfre nisbet edip de kıtali halâl saymaya dönmeyin -yahut: Fiilleriniz birbirlerinin boyunlarına vuran kâfirlerin fiillerine benzemesin-!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6786,
			"arabicnumber": 6786,
			"text": "Âişe (r.anha) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) dünyâ işlerinde iki iş arasında muhayyer kılındığında, o iş günâh olmadığı müddetçe, muhakkak onların en kolay olanını tercîh ederdi. Eğer o işler günâh nev'inden olurlarsa,Peygamber onların ikisinden de insanların en uzak bulunanı olurdu. Allah'a yemîn ederim ki, O, kendisine getirilen hiçbirşeyde kendi nefsi için asla intikaam almazdı. O ancak Allah'ın haramlarının parçalanıp hürmetsizlik edilmesinde Allah için(öfkelenir) intikaam alırdı",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 6787,
			"arabicnumber": 6787,
			"text": "Bize el-Leys, İbn Şihâb'dan; o da Urve'den; o da Âişe (r.anha)'den şöyle tahdîs etti: Usâme, Kureyş'in Mahzum soyuna mensûb olup hırsızlık yapmış bir kadın hakkında (şefkat için)Peygamber(sallallahü aleyhi ve sellem)'le konuşmuştu. Bunun üzerine Peygamber:\"Sizden evvelki ümmetler ancak şundan helak olmuşlardır: onlar haddi (yani cezayı) hakir kimseye uygular idiler de şerefli olan kimseyi terkederlerdi. Nefsim elinde olan Allah'a yemin ederim ki, eğer (Muhammed'in kızı) Fâtıma bu işi yapmış olaydı, muhakkak onun elini de keserdim\" buyurdu",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 6788,
			"arabicnumber": 6788,
			"text": "Bize el-Leys, İbn Şihâb'dan; o da Urve'den; o da Âişe (r.anha)'den şöyle tahdîs etti (Âişe şöyle demiştir): Kureyş'in Mahzûm soyundan olup da hırsızlık etmiş bulunan bir kadının durumu, Kureyş'e haylî üzüntü vermişti. Onlar: Bu kadını cezadan afv hususunda Rasûlüllah ile kim konuşabilir? Bu hususta kelâm etmeye Rasûlüllah'ın sevgilisi olan Usâme'den başka kim cesaret edebilir ki? dediler. Usâme, bu hususta Rasûlüllah ile konuştu. Bunun üzerine Rasûlüllah (sallallahü aleyhi ve sellem): \"Allah'ın ta'yîn ettiği cezalardan bir ceza hususunda şefaat mi ediyorsun?\" buyurdu. ayağa kalkıp bir hitabe yaparak şöyle dedi: \"Ey insanlar! Sizden evvelki (ümmet)ler ancak şu sebebden sapmışlardır: Onlar aralarında şerefli bir kimse çaldığı zaman onu bırakırlardı da zayıf olan çaldığı zaman ona ceza uygularlardı. Allah 'a yemîn ediyorum ki, eğer Muhammed'in kızı Fâtıma çalmış olaydı, muhakkak onun elini de keserdim",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 6789,
			"arabicnumber": 6789,
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 6790,
			"arabicnumber": 6790,
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 6791,
			"arabicnumber": 6791,
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 6792,
			"arabicnumber": 6792,
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 6793,
			"arabicnumber": 6793,
			"text": "Bize Hişâm ibn Urve, babasından haber verdi ki Âişe (r. anha): Hırsızın eli hacefeden yahut tursten daha aşağıda bir mal için kesilmezdi. Bunların herbiri kıymetli şeylerdi, demiştir. hadîsi Vekî' ile İbn İdrîs de Hişâm'dan; o da babasından mürsel olarak rivayet etmiştir",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 6794,
			"arabicnumber": 6794,
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 6795,
			"arabicnumber": 6795,
			"text": "Bana Mâlik ibn Enes, Abdullah ibn Omer'in himayesinde bulunan Nâfi'den; o da Abdullah ibn Omer (radıyallahü anh) 'den tahdîs etti ki, Rasûlüllah(sallallahü aleyhi ve sellem) değeri üç dirhem olan bir kalkan hırsızlığında hırsızın elini kestirmiştir. ona Nâfi'den rivayette Muhammed ibn İshâk mutâbaat etmiştir. de: Bana Nâfi' \"Semenehu\" yerine \"Kıymetehu\" şeklinde tahdîs etti, demiştir",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 6796,
			"arabicnumber": 6796,
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 6797,
			"arabicnumber": 6797,
			"text": "Ubeydullah şöyle demiştir: Bana Nâfi' tahdîs etti ki, Abdullah ibn Omer (radıyallahü anh):Peygamber(sallallahü aleyhi ve sellem) semeni üç dirhem olan bir kalkan hırsızlığında hırsızın elini kestirdi, demiştir",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 6798,
			"arabicnumber": 6798,
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 6799,
			"arabicnumber": 6799,
			"text": "Bize el-A'meş tahdîs edip şöyle dedi: Ben Ebû Salih'ten işittim, şöyle dedi: Ben Ebû Hureyre (radıyallahü anh)'den işittim, şöyle dedi: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: \"Allah şu hırsıza la'net etsin ki, o bir miğfer çalar da eli kesilir, bir ip çalar da(o küçük şey sebebiyle) eli kesilir",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 6800,
			"arabicnumber": 6800,
			"text": "Bana İbnu Vehb, Yûnus'tan; o da Urve'den; o da Âişe (r.anha)'den tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem) hırsızlık eden bir kadının elini kestirmiştir. Âişe: Artık bundan sonra o kadın bana gelir, ben de onun hacetini Peygamber'e yükseltir, arzederdim. Kendisi bu hâdiseden sonra tevbe etti ve tevbesi de güzel oldu, demiştir",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 6801,
			"arabicnumber": 6801,
			"text": "Bize Ma'mer ibn Râşid, ez-Zuhrî'den; o da Ebû İdrîs'ten haber verdi ki, Ubâdetu'bnu's-Sâmit (radıyallahü anh) şöyle demiştir: Ben bir topluluk içinde Rasûlüllah(sallallahü aleyhi ve sellem) ile bey'atlaştım da bey'atte şöyle buyurdu: \"Ben sizlerle şu şartlar üzerine bey'atlaşıyorum: Allah'a (ibâdette) hiçbir şeyi ortak kılmamanız, hırsızlık yapmamanız, çocuklarınızı öldürmemeniz, ellerinizle ayaklarınız arasından bir iftira düzüp getirmemeniz (yani kendiliğinizden kimseye hiçbir iftira düzüp atmamanız), hiçbir ma'rüf işte bana isyan etmemeniz. Sizden her kim bu sözünde durursa, onun ecri Allah'ın (fazilet ve kerem) zimmetindedir. Bu dediklerimden birini yapıp da ondan dolayı dünyâda yakalanırsa, bu onun için bir keffârettir ve bir temizliktir. Bunlardan birini yapıp da yaptığı fiili Allah örterse, onun bu işi de Allah'a kalır. Allah isterse onu azâblandırır, isterse onu affeder.\" Abdillah el-Buhârî: Hırsız, elinin kesilmesinden sonra tevbe ettiği zaman şâhidliği kabul edilir. Her hadd vurulan da böyledir, tevbe ettiği zaman şâhidliği kabul edilir, dedi",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 6802,
			"arabicnumber": 6802,
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 6803,
			"arabicnumber": 6803,
			"text": "Bize el-Evzâî tahdîs etti. Bana Yahya ibn Ebî Kesîr tahdîs edip şöyle dedi: Bana Ebû Kılâbe el-Cermî tahdîs etti ki, Enes ibn Mâlik (radıyallahü anh) şöyle demiştir: Ukl kabilesinden bir topluluk Peygamber(sallallahü aleyhi ve sellem)'in huzuruna geldiler, İslâm Dîni'ne girdiler. Fakat hastalandıklarından dolayı Medîne'de ikaamet etmek istemediler. Peygamber de onlara Beytu'lmâle âid sadaka develerinin bulunduğu yere gitmelerini, develerin sidiklerinden ve sütlerinden içmelerini emretti. Onlar Peygamberin dediğini yaptılar ve sağlıklarını kazandılar. Sonra dînden geri döndüler, develerin çobanlarını öldürdüler ve develeri sürüp götürdüler. Onların bu işleriPeygamberce ulaşınca arkalarına bir süvârî birliği gönderdi. Yakalanıp getirildiler. Peygamber onların ellerini ve ayaklarını kestirdi, gözlerini oydurdu. Peygamber onların kesilen yerlerine kanın dinmesi için dağlama ameliyyesi yapmayıp öylece terketti. Nihayet öldüler",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 6804,
			"arabicnumber": 6804,
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 6805,
			"arabicnumber": 6805,
			"text": "Bize Hammâd, Eyyûb'dan; o da Ebû Kılâbe'den; o da Enes ibn Mâlik (radıyallahü anh)'ten şöyle tahdîs etti. Ukl veya Ureyne kabilelerinden bir topluluk -râvî: Ben onun ancak Ukl'den dediğini biliyorum, demiştir- Medine'ye geldiler. Peygamber(sallallahü aleyhi ve sellem) onlar için sütlü develer emretti. Onlara sadaka develerinin bulundukları yere çıkmalarını, onların sidiklerinden ve sütlerinden içmelerini emretti. Onlar gidip o develerin sütlerinden ve sidiklerinden içtiler. Nihayet hastalıklarından kurtulup iyileştikleri zaman çobanı öldürdüler de develeri sürüp götürdüler. Bu haber kuşluk vakti Peygamber'e ulaşınca, hemen arkalarından arayıcılar gönderdi. Gündüz yükselmeden yakalanıp getirildiler. Peygamber onlarla ilgili emrini verdi. Onların ellerini, ayaklarını kestirdi, gözlerini çıkarttı. Sonra onlar Harre mevkiine atıldılar. Onlar su istediler, fakat kendilerine su verilmedi. Kılâbe: İşte bunlar hırsızlık yapmışlar, insan öldürmüşler, îmândan sonra Allah'ı inkâr etmişler, bu büyük cürümlerle beraber Allah'a ve Rasûlü'ne de muhârib olmuşlardır, demiştir",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 6806,
			"arabicnumber": 6806,
			"text": "Bize Abdullah ibnu'l-Mubârek, Ubeydullah ibn Omer'den; o da Hubeyb ibn Abdirrahmân'dan; o da Hafs ibn Âsım'dan; o da Ebû Hureyre (radıyallahü anh)'den haber verdi ki, Peygamber(sallallahü aleyhi ve sellem) şöyle buyurmuştur: \"Yedi kimseyi Allah kendi gölgesinden başka hiçbir gölge bulunmayan kıyâmet gününde, kendi gölgesi altında gölgelendirecektir: Âdil imâm, Allah 'a ibâdet içinde gelişen genç, tenhâ bir yerde Allah 'ı (kalbi veya diliyle) anıp da gözleri yaş akıtan kimse, kalbi mescide bağlanmış kimse, Allah yolunda birbirleriyle sevişen iki kimse, mevki' ve güzellik sahibi olan bir kadın kendisini nefsini tatmîne çağırdığı zaman 'Ben Allah'tan korkarım' diyen erkek, bir sadaka verdiğinde bunu sol eli, sağ elinin yaptığı işi bilmeyecek kadar gizli olarak veren kimse",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 6807,
			"arabicnumber": 6807,
			"text": "Bize Ebû Hazım Seleme ibn Dînâr, Sehl ibn Sa'd es-Sâidî (radıyallahü anh)'den tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem) şöyle buyurmuştur: \"Her kim bana iki bacağı arasındaki organı ile, iki çene kemiği arasındaki organını günâhtan korumaya kejîl olursa, ben de o kimseye cennete kefil olurum",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 6808,
			"arabicnumber": 6808,
			"text": "Bize Katâde haber verdi; Enes (radıyallahü anh) şöyle demiştir; Ben size Peygamber'den işittiğim öyle bir hadîs söyleyeceğim ki, benden sonra onu size hiçbir kimse söyleyemiyecektir: Ben Peygamber(sallallahü aleyhi ve sellem)'den işittim, şöyle buyuruyordu: \" (Şunlar olmadıkça) saat ayağa kalkmaz\" yahut da Peygamber şöyle buyurdu: \"İlmin kaldırılması, cahilliğin meydana çıkıp kökleşmesi, şarâbın içilmesi, zinanın aşikâre olup çoğalması, erkeklerin azalıp kadınların çoğalması kıyâmet alâmetlerindendir. Kadınlar o kadar çoğalacak ki, elli kadın için bir kayyım (yani işlerini görücü) olacaktır",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 6809,
			"arabicnumber": 6809,
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 6810,
			"arabicnumber": 6810,
			"text": "Bize Amr ibn Alî tahdîs etti: Bize Yahya ibn Saîd el-Kattân tahdîs etti: Bize Sufyân es-Sevrî tahdîs edip şöyle dedi: Bana Mansûr ile Süleyman ibn Mıhrân, Ebû Vâil'den; o da Ebû Meysere'den tahdîs etti ki, Abdullah ibn Mes'ûd (radıyallahü anh) şöyle demiştir: Ben: Yâ RasûlaİIah! Hangi günâh en büyüktür? diye sordurn. Rasûlüllah(sallallahü aleyhi ve sellem): \"Allah seni yarattığı hâlde Allah'a bir ortak uydurmandır\" buyurdu. Sonra hangi (günâh büyüktür)? diye sordum. Rasûlüllah: \"Seninle beraber yemek yemesinden korktuğun için çocuğunu öldürmendir\" buyurdu. Bundan sonra hangisi (büyüktür)? dedim. Rasûlüllah: \"Komşunun halîlesi olan zevcesiyle zina edişmendir\" buyurdu",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 6811,
			"arabicnumber": 6811,
			"text": "Yahya bin Saîd şöyle dedi: Ve bize Sufyân es-Sevrî tahdîs etti. Bana Vâsıl ibn Hayyân, Ebû Vâil'den tahdîs etti ki, bunda da Abdullah ibn Mes'ûd: \"Ben: Yâ Rasûlallah!... diye sordum\" deyip geçen hadîsin benzerini söylemiştir. ibnu Alî şöyle dedi: Ben bu hadîsi Abdurrahmân ibn Mehdî'ye zikrettim. Halbuki o da bu hadîsi bize Sufyân es-Sevrî'den; o da el-A'meş'ten, Mansûr'dan, Vâsıl'dan; bu üçü de Ebû Vâil'den; o da Ebû Meysere'den diye tahdîs ediyordu. Abdurrahmân ibn Mehdî iki kerre:(İçinde Ebû Vâil ile Abdullah ibn Mes'ûd arasında Ebû Meysere'nin zikri bulunmayan) bu isnadı terket, bu isnadı terket! Dedi",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 6812,
			"arabicnumber": 6812,
			"text": "Bize Seleme ibnu Kuheyl tahdîs edip şöyle dedi: Ben eş-Şa'bî Âmir ibn Şurahbîl'den işittim. O, Alî ibn Ebî Tâlib (radıyallahü anh)'in, cumua günü (Şurâha el-Hamdâniyye denilen) kadını recmettiği zaman, Alî'nin: Ben bu kadım Rasûlüllah(sallallahü aleyhi ve sellem)'ın sünneti (yani kaanûnu) ile recmetmişimdir, dediğini tahdîs ediyordu",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 6813,
			"arabicnumber": 6813,
			"text": "Bize Hâlid ibn Abdillah, eş-Şeybânî'den tahdîs etti ki, eş-Şeybânî şöyle demiştir: Ben Abdullah ibn Ebî Evfâ (radıyallahü anh)'ya: Rasûlüllah(sallallahü aleyhi ve sellem) recmetti mi? diye sordum. da: Evet etti, diye cevâb verdi. tekrar: Rasûlüllah en-Nûr Sûresi'nin inmesinden evvel mi, yoksa sonra mı recmetti? dedim. ibn Ebî Evfâ: Bunu bilmiyorum, dedi",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 6814,
			"arabicnumber": 6814,
			"text": "ibn Şihâb şöyle demiştir: Bana Ebû Seleme ibn Abdirrahmân, Câbir ibn Abdillah(radıyallahü anh)'tan şöyle tahdîs etti: Eslem kabilesinden (Mâiz ibn Mâlik isminde) bir adam, Rasûlüllah(sallallahü aleyhi ve sellem)'a geldi de, O'na kendisinin zina ettiğini söyledi. Ve kendisi aleyhine dört defa şehâdet etti. Bu şehâdetler üzerine Rasûlüllah emretti de o adam recm olundu. Bu adam evli olduğu hâlde zina etmişti",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 6816,
			"arabicnumber": 6816,
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 6817,
			"arabicnumber": 6817,
			"text": "Âişe (r.anha) şöyle demiştir: Sa'd ibn Ebî Vakkaas ile Abd ibnu Zem'a (bir oğlanın nesebi hususunda) nizâlaşıp da'vâlaştılar. Peygamber(sallallahü aleyhi ve sellem):\"Oğlan sana âiddir yâ Abd ibne Zem'a! Çocuk, üzerinde doğduğu döşeğe âid olur. Ey Sevde! Sen de bu çocuktan perdelen!\" buyurdu. geçen senedle: Bize Kuteybe ibn Saîd, el-Leys'ten yaptığı rivayetinde de Peygamber'in\"Zina eden için ancak mahrumiyet vardır\"buyurduğunu ziyâde etti, demiştir",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 6818,
			"arabicnumber": 6818,
			"text": "Ebû Hureyre (radıyallahü anh)Peygamber(sallallahü aleyhi ve sellem)'in\"Çocuk, üzerinde doğduğu döşeğe âid olur. Ve zina eden için ancak mahrumiyet vardır” dediğini işitmiştir",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 6819,
			"arabicnumber": 6819,
			"text": "İbn Omer (radıyallahü anh) şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem)'a bir Yahûdî erkeği ile bir Yahûdî kadını getirildi. Bunlar birbirleriyle çirkin bir iş (yani zina fiili) meydana getirmişlerdi. Rasûlüllah Yahûdîler'e: \"Sizler kitabınız Tevrat'ta zina edenler için ne cezası buluyorsunuz?\" diye sordu. Âlimleriniz, zina edenin yüzünü kömürle karartma ve bir eşek üzerine (yüzlerini birbirine) ters bindirme bid'atini çıkardılar, diye cevâb verdiler. ibn Selâm: Yâ Rasûlallah! Onlara Tevrat'ı getirmelerini emret! dedi. Tevrat getirildi. Yahûdîler'den biri elini recm âyeti üzerine koydu da öncesini ve sonrasını okumaya başladı. Abdullah ibn Selâm ona: Elini kaldır! dedi. de baktılar ki, recm âyeti elinin altındadır. Bunun üzerine Rasûlüllah zina eden o iki kimsenin recm edilmesini emretti, onlar da recm olundular. Omer: Bu zina eden iki kişi Mescid'in yanında düz taşlarla döşenip kaplanmış olan Balat denilen yerde recm olundular. Ben erkek Yahûdî'nin kadını taşlardan korumak için üzerine kapandığını gördüm, demiştir",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 6820,
			"arabicnumber": 6820,
			"text": "Bize Ma'mer ibn Râşid ez-ZuhrTden; o da Ebû Seleme ibn Abdirrahmân'dan; o da Câbir ibn Abdillah (radıyallahü anh)'tan şöyle haber verdi: Eslem kabîlesinden (Mâiz ibn Mâlik el-Eslemî adında) bir adam Peygamberi geldi de zina ettiğini i'tirâf eyledi. Peygamber(sallallahü aleyhi ve sellem) ondan yüz çevirdi. O adam kendi aleyhine dört kerre böyle şehâdet edince, Peygamber ona hitaben: \"Sende delilik var mı?\" diye sordu. O zât: Hayır (yoktur), dedi. Peygamber: \"Sen evlendin mi?\" diye sordu. O zât: Evet (evlendim), dedi. üzerine o adamın recm edilmesini emretti ve o zât (cenazelere namaz kılınan) musallada recm olundu. Taşlar ona isabet edip acıtınca adam kaçmaya başladı, kendisine erişilip recm edildi, nihayet öldü. Peygamber onu hayırla zikretti ve üzerine cenaze namazı kıldırdı. Yûnus ile İbn Cureyc, ez-Zuhrî'den yaptıkları rivayetlerinde \"Üzerine namaz kıldı\" fıkrasını söylemediler. Abdillah el-Buhârî'ye: \"Peygamber onun üzerine cenaze namazı kıldı\" fıkrası sahîh olur mu? diye soruldu. Bunu Ma'mer ibn Râşid rivayet etti, diye cevâb verdi. Buhârî'ye: Bunu Ma'mer'den başkası rivayet etti mi? denildi de, o: Hayır, diye cevâb verdi",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 6821,
			"arabicnumber": 6821,
			"text": "Bize el-Leys, İbn Şihâb'dan; o da Humeyd ibn Abdirrahmân'dan; o da Ebû Hureyre(radıyallahü anh)'den şöyle tahdîs etti: Bir adam ramazân ayında oruçlu iken karısı ile cinsî münâsebette bulundu da Rasûlüllah(sallallahü aleyhi ve sellem)'a gelip bunun hükmünü istedi. Rasülullah ona: \"Azâd edecek bir köle bulabilir misin?\" diye sordu. O zât: Hayır (bulamam), dedi. Rasülullah: \"İki ay arka arkaya zincirlemesine oruç tutmaya gücün yeter mi?\" dedi. Hayır (buna gücüm yetmez), dedi. Rasülullah: \"Öyleyse altmış fakiri doyur!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 6822,
			"arabicnumber": 6822,
			"text": "Ve el-Leys, Amr ibnu'l-Hâris'ten; o da Abdurrahmân ibni'l-Kaasım'dan; o da Muhammed ibn Ca'fer ibni'z-Zubeyr'den; o da Abbâd ibnu Abdillah ibni'z-Zubeyr'den; o da Âişe (r.anha)'den şöyle söyledi: Mescidde iken Peygamber(sallallahü aleyhi ve sellem)'in yanına bir adam geldi de: (Yâ Rasûlallah!) Yandım! dedi. Peygamber: \"Bu yanman neden oldu?\" diye sordu. O adam: Ramazânda oruçlu iken karımla cinsî münâsebette bulundum! dedi. ona (sırasıyle köle azadı ve iki ay devamlı orucu zikrettikten sonra): \" (Altmış fakîri doyuracak) sadaka ver!\" buyurdu. O da: Benim yanımda sadaka vereceğim hiçbirşey yoktur, dedi. Ve orada oturdu. O sırada Peygamber'e bir insan, üzerinde yiyecek birşey bulunan bir eşeği sürerek geldi. ibnu'l-Kaasım: Ben o yiyecek şeyin ne olduğunu bilmiyorum, dedi. (Ebû Hureyre hadîsinde o yiyeceğin bir zenbîl hurma olduğu açıkça belirtilmiştir.) insan bu yiyecek şeyi Peygamber'e verdi. Bunun üzerine Peygamber: \"O yanan adam nerededir?\" diye seslendi. O adam: O benim; buradayım yâ Rasûlallah! dedi. Peygamber: \"Bu yiyecek taamı al da bunu keffâret olarak sadaka ver!\" buyurdu. adam: Benden daha muhtâc olana mı vereceğim? Benim ailemin hiçbirşeyi yoktur! dedi. de ona: \"Öyleyse bunu sizler yiyin!\" buyurdu. Abdillah el-Buhârî: Ebû Usmân en-Nehdî'den rivayet edilmiş olan birinci hadîs daha açıktır. Oradaki sözü\"Bunu kendi ailene yedir!\" şeklindedir, dedi",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 6823,
			"arabicnumber": 6823,
			"text": "Enes ibn Mâlik (radıyallahü anh) şöyle demiştir: Ben Peygamber (sallallahü aleyhi ve sellem)'in yanında idim. O'na bir adam geldi de: Yâ Rasûlallah! Ben hadd (yani dînî ceza) gerektirecek bir günâha isabet ettim, bana bu cezayı uygula! dedi. dedi ki: Peygamber o adama işlediği günâhı sormadı. dedi ki: Bu sırada namaz vakti geldi. O adam Peygamber'le beraber namazı kıldı. Peygamber namazı bitirince o adam Peygamber'e doğru kalktı da: Yâ Rasûlallah! Ben bir hadde isabet ettim, bana Allah'ın Kitâbı'nı uygula! dedi. \"Sen şimdi bizimle beraber namaz kılmış değil misin?\" dedi. O da: Evet (namaz kıldım), dedi. Rasûlüllah: \"Şübhesiz ki, Allah senin lehine günâhını -yahut: cezanı- mağfiret etmiştir!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 6824,
			"arabicnumber": 6824,
			"text": "İbn Abbâs radıyallahü anhüma şöyle demiştir: Mâiz ibnu Mâlik, Peygamber (sallallahü aleyhi ve sellem)'e gelip zina suçunu i'tirâf ettiği zaman Peygamber (ondan birkaç defalar yüz çevirdikten, deli ve sarhoş olup olmadığını araştırdıktan sonra) ona: \"Belki sen o kadını öptün yahut elinle elleyip çimdikledin yahut da sâdece baktın?\" buyurdu. Hayır yâ Rasûlallah! diye zina ettiğini ısrarla belirtince, Rasûlüllah hiçbir kinayeli lafız kullanmayarak açıkça: \"Sen erkeklik organını o kadının ferci içine koydun mu?\" diye sordu. Abbâs: Mâiz'in açıkça zina ettiğini ikrar etmesi sırasında artık Rasûlüllah onun recm edilmesini emretti, dedi",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 6825,
			"arabicnumber": 6825,
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 6828,
			"arabicnumber": 6828,
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 6829,
			"arabicnumber": 6829,
			"text": "Abdullah İbn Abbâs radıyallahü anhüma şöyle demiştir: Omer ibnu'l-Hattâb (radıyallahü anh) şöyle dedi: Ben insanlar üzerine zamanın uzayıp da herhangi bir sözcünün: \"Biz Allah'ın Kitâbı'nda recmi bulmuyoruz\" demesinden ve böylece Allah'ın indirmiş olduğu bir farizayı terketmek suretiyle sapmalarından endîşe etmişimdir. Dikkat ediniz! Evli olduğu hâlde zina eden kimse üzerine buna beyyine delâlet ettiği yahut gebelik yahut i'tirâf olduğunda recm cezası sabit olmuş bir haktır! dedi. ibn Uyeyne: Ben bunu böylece ezberledim: Dikkat edin! Rasûlüllah(sallallahü aleyhi ve sellem) recm etmiştir. O'ndan sonra biz de recm yaptık, dedi, demiştir",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 6830,
			"arabicnumber": 6830,
			"text": "İbn Abbâs radıyallahü anhüma şöyle demiştir: Ben Muhâcirler'den birtakım adamlara Kur'ân okutuyordum. Bunlardan biri Abdurrahmân ibn Avf idi. Ben Omer'in yaptığı son haccında Minâ'da Abdurrahmân ibn Avf’in evinde bulunduğum sırada, Abdurrahmân, Omer ibnu'l-Hattâb'ın yanında imiş, oradan evine benim yanıma döndü de şöyle dedi: Eğer sen şu adamı göreydin muhakkak hayret ederdin: Bu gün Emîru'l-Mü'minîn'in yanına bir adam geldi ve: Ey Mü'minlerin Emîri! Fulân kişi hakkında ne düşünürsün: O kişi: Eğer Omer ölürse, ben muhakkak fulân kimseye (Talha ibn Ubeydillah'a) bey'at ederim. Vallahi Ebû Bekr'e yapılan bey'at istişâresiz, ansızın birdenbire yapılıp tamam oldu! diye konuşarak bir fitne çıkarmak istedi. bu sözü işitince çok öfkelendi. Sonra: Ben bu akşam üzeri Allah isterse insanların arasında ayağa kalkıp bir hutbe yapacağım da milletin mukadderatını gasbetmek isteyen bu adamları teşhîr ederek, bunların te'vîlâtından insanları sakındıracağım! dedi, dedi ki: Ben de Omer'e: Ey Mü'minlerin Emîri! Böyle yapma! Çünkü hacc mevsimi insanların her türlüsünü ve şerr işlerinde sür'atli olanlarını bir araya toplar. Sen hutbe için ayağa kalkacağın zaman, bu kimseler sana yakın bir yerde olmakta diğer insanlara galebe ederler. Ben senin ayağa kalkar da bu konuda bir konuşma yaparsan, bu konuşmayı herbir uçurucunun senden alıp etrafa uçurmasından, onu belleyememeleri ve ma'nâsını anlamamalarından ve o konuşmayı yakışmayacak birtakım yerlere koymalarından endîşe ederim. Onun için sen yavaş ol, Medine'ye dönünceye kadar sabret. Çünkü Medîne hicret ve sünnet yurdudur. Orada Suffa ehli ile, insanların eşrafı ile toplanıp söylemek istediğin şeyleri o topluluğa sağlam olarak söylersin, ilim ehli olanlar senin konuşmanı iyi belleyip anlarlar ve onu uygun yerlerine koyarlar (da fitneyi önlerler), dedim. teklîfimi kabul edip: Dikkat et! Vallahi inşâallah Medîne'ye varıp ayağa kalkarak yapacağım ilk hutbemde bu mes'eleyi muhakkak konuşacağım! dedi, Abbâs dedi ki: Bizler zu'l-hicce ayının sonunda Medîne'ye geldik. Cumua günü olunca güneş ortadan meylettiği zaman bizler mescide gidişte acele davrandık. Nihayet ben Saîd ibn Zeyd ibn Amr ibn Nufeyl'i, minberin köşesinin yanında oturmuş olarak bulup, onun etrafına oturdum. Benim dizim onun dizine dokunuyordu. Çok beklemedim, Omer ibnu'l-Hattâb çıktı. Ben onun gelmekte olduğunu görünce Saîd ibn Zeyd ibn Amr ibni Nufeyl'e: Omer bu öğleden sonra öyle mühim bir konuşma yapacak ki, halîfe yapıldığı günden beri böyle bir konuşma yapmamıştı! dedim. ibn Zeyd benim sözümü kabul etmedi ve: Omer'in şimdiye kadar bundan önce söylemediği bir konuşma yapacağını neden ümîd ettin ki! diye bunu uzak saydı. minber üzerine oturup müezzinler de ezanları okuyup sükût ettikleri zaman ayağa kalktı. Allah'a hamd ve lâyık olduğu yüce sıfatlarla övdükten sonra \"Amma ba'du = Sözün bundan sonrasına gelince\" deyip şunları söyledi: Ben sizlere, Allah'ın benim konuşmamı takdir etmiş olduğu bir konuşma yapacağım: Bilmiyorum, belki bu konuşmam, benim ecelimin önündedir (vefatım yaklaşmış olabilir)! Her kim bu konuşmamı akledip anlar ve onu iyi ezberler ise bineğinin ulaştırdığı her yerde bunu söyleyip yaysın. Akledip kavramıyacağından endîşe eden kimseye gelince, ben hiçbir kimseye benim üzerime yalan söylemesini halâl etmiyorum. ki, Allah, Muhammed'i hakkpeygamber gönderdi ve O'na Kitâb indirdi. Allah'ın indirdiği şeyler içinde Recm Âyeti de vardı. Bizler o âyeti okuduk, akledip anladık ve iyice ezberledik. içindir ki, Rasûlüllah recm etti, O'ndan sonra biz de recm ettik. Ben insanlara zaman uzayıp da bir sözcünün: \"Biz Allah'ın Kitâbı'nda recm âyetini bulmuyoruz\" demesinden ve Allah'ın indirmiş olduğu bir farizayı terketmeleri suretiyle insanların sapıklığa düşmelerinden endîşe ediyorum. Recm, Allah'ın Kitâbı'nda sabit bir haktır. Bu, erkeklerden ve kadınlardan evlenip de zina eden, zinası da beyyine ile yahut gebelik ile yahut da i'tirâf ile sabit olan kimselere uygulanır. bizler Allah'ın Kitâbı'ndan okumakta olduğumuz şeyler içinde: \"Babalarınızdan yüz çevirmeyiniz! Şu muhakkaktır ki, sizin babalarınızdan yüz çevirmeniz (babalarınızdan başkalarına mensûbluk iddia etmeniz) sizin küfrünüz, nankörlüğünüzdür -yahut: Sizin babalarınızdan yüz çevirmeniz, muhakkak sizin için bir küfürdür-!\" sözleri de vardı! edin! Sonra Rasûlüllah(sallallahü aleyhi ve sellem) şunu da buyurmuştur: \"Sizler beni, Meryem oğlu İsâ 'nın bâtıl üzere aşırı övülmesi gibi mübalağalı ve aşırı şekilde övmeyiniz. Sizler bana 'Allah'ın kulu ve Rasûlü' deyiniz!\" şu da var ki, içinizden bir sözcü çıkıp: \"Vallahi Omer ölürse, ben fulân kimseye bey'at ederim\" demektedir. Sakın hiçbir kimse onun \"Ebû Bekr'e yapılan bey'at ancak istişâresiz, birdenbire olmuş ve tamamlanmıştır\" demesiyle aldanmasın! Dikkat ediniz! Hakîkaten o iş böyle çabuk olmuştur. Lâkin Allah, o işin şerrinden ümmeti korumuştur. İçinizden hiçbir kimse kendisine sür'atle gidilmekte develerin boyunlarının kopmasında Ebû Bekr gibi olamaz. sonra her kim milletin istişaresi ve re'yi olmaksızın müslümânlardan bir adama bey'at ederse, onun bey'ati kabul olunmaz. O bey'at eden de, bey'at edilen de kendilerini öldürülme tehlikesine atmış olurlar! da bir hakikattir ki, Allah, Peygamberi'ni vefat ettirdiği zaman bizim de haberimizden şunlar meydana gelmişti: Ensâr cemâati bize muhalefet ettiler ve hepsi Sâide oğulları sakîfesinde toplandılar. Alî ile ez-Zubeyr ve onların beraberinde olanlar da bize muhalefet ettiler. Muhacirler, Ebû Bekr'in yanında toplandılar. Ben Ebû Bekr'e: Yâ Ebâ Bekr! Bizi şu Ensâr kardeşlerimizin yanına götür! dedim. bizler onlara ulaşmak isteyerek yola koyulup gittik. Onlara yaklaştığımız zaman, bizleri onlardan iki sâlih adam(Uveymir İbn Sâide ile Ma'n ibn Adiyy) karşıladılar da topluluğun üzerine meyledip ittifak ettikleri görüşü (Sa'd ibn Ubâde'ye bey'ati) bize zikrettiler ve: Ey Muhacirler topluluğu! Sizler nereye gitmek istiyorsunuz? dediler. de onlara: Şu Ensâr kardeşlerimizin yanına gitmek istiyoruz, dedik. Onlar da bize: Ensâr topluluğuna yaklaşmayınız, siz kendi işinizin hükmünü veriniz! dediler. de onlara: Vallahi bizler muhakkak onların yanına gideceğiz! dedim. Ve yürüdük, nihayet Sâide oğulları'nın meşveret ettikleri sakîfede Ensâr cemâatinin yanına vardık. de baktık ki, onların arasında bir örtüye bürünüp sarınmış bir adam var! Ben: Bu kimdir? dedim. Onlar: Bu Sa'd ibn Ubâde'dir! dediler. Ben: Onun nesi var? dedim. Onlar: Sıtma ateşi var! dediler. birazcık oturduğumuzda onların hatîbi (Sabit ibn Kays ibn Şemmâs) şehâdet kelimelerim söyledi ve Allah'ı lâyık olduğu yüce sıfatlarıyle sena etti. Bundan sonra \"Amma ba'du\" hitâb fâsılını söyledi ve şöyle devam etti: Bizler Allah'ın Ensârı ve İslâm'ın büyük ordusuyuz. Siz Muhacirler cemâati ise Mekke'deki kavminizden bize yürüyüp gelmiş olan bir azınlıksınızdır. Böyle iken şimdi bu azınlık bizi aslımızdan koparmak ve bizleri emirlik işinden dışarıya çıkarmak istiyorlar! dedi. şöyle dedi: Ensâr'ın hatîbi susunca ben konuşmak istedim. Ben daha evvel, beğendiğim ve Ebû Bekr'in önünde takdîm edip konuşmak istediğim bir makaale (bir hitabe) hazırlamış idim. Ben Ebû Bekr'e ârız olan keskinliğin yani öfkenin bir kısmını ondan def etmeye uğraşıyordum. Ben konuşmak istediğim zaman, Ebû Bekr bana: Yavaş ol (yumuşak ve sükûnetli davran)! dedi. Ebû Bekr'i öfkelendirmek istemedim. Ebû Bekr kendisi konuşmaya başladı. Ebû Bekr öfke sırasında benden daha halîm, daha sükûnetli, hedeflere yönelip ulaşmakta da benden daha vakaarlı idi. Vallahi Ebû Bekr benim hazırlamamda hoşuma giden hiçbirşeyi terketmedi, o konuşmasına başlamasında, doğru olan görüşü belirtmekte benim hazırladığım hitabenin benzeri yahut ondan daha üstün olan bir konuşmayı susuncaya kadar sürdürdü. Bu konuşmasında şunları söyledi: (Ey Ensâr topluluğu! Allah'a yemîn ederim ki, bizler sizin fadlınızı, İslâm yolundaki belâlarınızı ve bizim üzerimize vâcib olan hakkınızı inkâr etmiyoruz! -İbn İshâk rivayetinden-) Sizler, kendinizde hayır bulunduğunu zikrettiniz, sizler bu hayrın ehlisiniz. Fakat şu halifelik işi Kureyş'ten olan şu Muhacirler topluluğundan başkasında asla tanınmayacaktır. Bu Kureyş topluluğu neseb ve yurt bakımlarından Arablar'ın ortası, yânı en adaletlisi ve en üstünüdür. Ben sizler için şu iki adamdan birine bey'at etmenizi teklîf edip buna razı olmuşumdur. Şimdi bu ikisinden istediğinize bey'at ediniz! dedi. dedi ki: Bundan sonra Ebû Bekr, kendisi aramızda oturmakta bulunduğu hâlde benim elimi ve Ebû Ubeyde ibnu'l-Cerrâh'ın elini tuttu. Ben onun söylediklerinden bundan başkasını kerîh görmedim. Vallahi benim öne geçirilip de boynumun vurulması (yânı) bir günâhtan dolayı benim boynumun öne geçirilip de vurulmaya yaklaştırılması, bana içlerinde Ebû Bekr'in mevcûd bulunduğu bir kavme emirlik yapmaklığımdan daha sevimlidir. Ancak ölümüm sırasında şeytânın telkîniyle nefsimin bunu bana süsleyip güzel göstermesi hâli müstesnadır ki, ben şu saatte onu vicdanımda hissetmiyor ve bulmuyorum! sırada Ensâr'dan bir sözcü (Habbâb ibnu'l-Munzir) şöyle dedi: Bizler emirlik ağacının faydalanılacak olan aslıyız, köküyüz (yani uyuz develerin kaşınmaları için ağıllara dikilen ağaç kökleriyiz, hasta develerin o ağaçlarla kaşınıp şifâ buldukları gibi, bu emirlik işi de bizlerle şifâ bulup yaşar). Yine bizler meyveleri düşmesin, kırılmasın diye yapraklarla, dallarla bağlanmış yüklü hurma salkımlarıyız. Biz Ensâr topluluğundan bir emir, sizlerden de bir emir olsun ey Kureyş cemâati! dedi. üzerine karışık sözler çoğaldı ve sesler yükseldi, hattâ ben bir ihtilâf çıkmasından korktum da hemen: Uzat elini yâ Ebâ Bekr! (Sana bey'at edeyim!)dedim. da elini uzattı. Ben de ona bey'at ettim. Benden sonra Muhacirler ve sonra Ensâr Ebû Bekr'e bey'at ettiler. Biz böylece Sa'd ibn Ubâde'ye karşı çabuk davranıp galebe sağlamış olduk. Onlardan bir sözcü: Sizler Sa'd ibn Ubâde'yi öldürdünüz,(yani onu yardımsız bırakmak ve kuvvetini gidermek suretiyle onu ölü gibi yaptınız)! dedi. dedi ki: Bu sözcüye karşı ben: (Hilâfet işine mâni' olmaya çalıştığı için) Allah Sa'd ibn Ubâde'yi öldürsün! dedim. sonra Omer o cumua hutbesindeki konuşmasının sonunda şunları tekrar olarak söyledi: Bizler o zaman Allah'a yemîn ederim ki, kendisinde hazır bulunup meşgul olduğumuz bu devlet başkanlığı müzâkeresi işinden, Ebû Bekr'e bey'at edilmesi işinden daha kuvvetli hiçbir iş ve meşguliyet bulmadık! Bizler Ensâr topluluğunun bizlerden ayrılıp da topluca bir bey'at olmamasından, bizden sonra onların kendilerinden bir adama bey'at etmelerinden korktuk. Bu takdirde ya bizler razı olmamamıza rağmen onlarla bey'atleşecek, yahut da onlara, muhalefet edecektik. Böylece de büyük bir fesâd olacaktı. bundan böyle müslümânların istişaresi ve rızâları olmaksızın her kim bir adama bey'at edecek olursa (insanlar tarafından ne o bey'at eden adama, ne de onun bey'at ettiği adama;) ikisinin de öldürülecekleri korkusundan, bey'at olunmayacaktır! (Onun için hiçbir kimse bey'at olunmaya ve kendisi için bey'atin -Ebû Bekr'e vâki' olduğu gibi- tamam olacağına tama' etmesin)",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 6832,
			"arabicnumber": 6832,
			"text": "İbn Şihâb şöyle dedi: Ve bana Urve ibnu'z-Zubeyr haber verdi ki, Omer ibnu'l-Hattâb da gurbete sürgün cezası uygulamış, sonra bu, kaanûn olmakta devam etmiştir",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 6833,
			"arabicnumber": 6833,
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 6834,
			"arabicnumber": 6834,
			"text": "İbn Abbâs radıyallahü anhüma şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) erkeklerden kadınlaşanlara, kadınlardan da erkekleşenlere la'net etti ve: \"Bu gibi insanları evlerinizden çıkarıp kovunuz!\" buyurdu. Abbâs dedi ki:) Peygamber fulân kimseyi çıkardı, Omer de fulân kimseyi çıkardı",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 6836,
			"arabicnumber": 6836,
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 6838,
			"arabicnumber": 6838,
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 6839,
			"arabicnumber": 6839,
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 6840,
			"arabicnumber": 6840,
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 6841,
			"arabicnumber": 6841,
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 6843,
			"arabicnumber": 6843,
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 6844,
			"arabicnumber": 6844,
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 6845,
			"arabicnumber": 6845,
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 6846,
			"arabicnumber": 6846,
			"text": "Bize Abdulmelik ibn Umeyr, el-Mugîre'nin kâtibi olan Verrâd'dan tahdîs etti. el-Mugîre ibn Şu'be (radıyallahü anh) şöyle demiştir: Sa'd ibn Ubâde (radıyallahü anh): Karımla beraber bir erkek görürsem, hiç aman vermeden onu kılıcımın keskin ağzıyle vurur öldürürdüm, demişti. bu sözü Peygamber(sallallahü aleyhi ve sellem)'e ulaşınca, yanında bulunanlara: \"Sizler Sa'd'ın bu kıskançlığına şaşıyor musunuz? Emîn olunuz ki, ben ondan daha kıskancım. Allah da muhakkak benden daha çok kıskançtır\" buyurdu",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 6847,
			"arabicnumber": 6847,
			"text": "Bana Mâlik, İbn Şihâb'dan; o da Saîd ibnu'l-Müseyyeb'den; o da Ebû Hureyre(radıyallahü anh)'den şöyle tahdîs etti: Rasûlüllah(sallallahü aleyhi ve sellem)'a bir bedevi geldi de: Yâ Rasûlallah! Benim karım siyah bir oğlan doğurdu (karımdan şübheleniyorum), dedi. da ona: \"Senin develerin var mı?\" diye sordu. Bedevî: Evet var! dedi. Rasûlüllah: \"Develerin renkleri nasıldır?\" diye sordu. O: Kırmızıdır, diye cevâb verdi. Rasûlüllah: \"Bunların içinde beyazı siyaha çalar boz renkli deve var mıdır?\" dedi. Evet vardır, diye cevâb verdi. Rasûlüllah: \"O boz renk nereden oldu?\" diye sordu. Bedevî: Soyunun bir damarına çekmiş olduğunu zannediyorun, dedi. Rasûlüllah: \"Senin bu oğlun da eski bir soy köküne çekmiş olabilir\" buyurdu",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 6848,
			"arabicnumber": 6848,
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 6849,
			"arabicnumber": 6849,
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 6850,
			"arabicnumber": 6850,
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 6851,
			"arabicnumber": 6851,
			"text": "Bize Ebû Selerne tahdîs etti ki, Ebû Hureyre (radıyallahü anh) şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem), orucu (arada sahur yemeden) birbirine eklemekten nehyetmişti. Müslümanlardan bâzı adamlar O'na: Yâ Rasûlallah! Sen bir günün orucunu öbür güne ekliyorsun? dediler. üzerine Rasûlüllah: \"Sizin hanginiz bana benzer? Ben, Rabb'im beni doyurur ve içirir bir hâlde gecelerim\" buyurdu. sahâbîler (sahûrsuz) ekleme orucu tutmaktan vazgeçmemekte ısrar edince, Rasûlüllah onlara bir gün ekleme orucu tutturdu. Sonra bir gün daha (arka arkaya iki gün) ekleme orucu tutturdu. Sonra (üçüncü günü) hilâli gördüler. Bunun üzerine Rasûlüllah onların orucu eklemekten vazgeçmedikleri zaman, onlara ceza verici bir tavırla: \"Eğer Ay geri kalsaydı (sizler ondan âciz kalıncaya kadar bir ceza olarak) ben sizlere daha fazla ekleme orucu tuttururdum!\" buyurdu. hadîsi ez-Zuhrî'den rivayet etmekte Şuayb, Yahya ibn Saîd, Yûnus üçlüsü de Ukayl'e mutâbaat etmişlerdir. ibn Hâlid de İbn Şihâb'dan; o da Saîd ibnu’l-Müseyyeb'den; o da Ebû Hureyre'den; o da Peygamber'den söylemiştir",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 6852,
			"arabicnumber": 6852,
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 6853,
			"arabicnumber": 6853,
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 6854,
			"arabicnumber": 6854,
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 6855,
			"arabicnumber": 6855,
			"text": "Bize Ebu'z-Zinâd tahdîs etti ki, el-Kaasım ibn Muhammed şöyle demiştir: İbn Abbâs, la'netleşme yapan iki kişiyi zikretmişti. Abdullah ibnu Şeddâd da: İşte o kadın, Rasûlüllah(sallallahü aleyhi ve sellem)'ın\"Eğer ben bir kadını beyyinesiz olarak recm edici olaydım, bunu recm ederdim\" buyurduğu kadındır, dedi. Abbâs: Hayır, bu, çirkinliği ve fucûru açıkta yapan kadındır, dedi",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 6856,
			"arabicnumber": 6856,
			"text": "İbn Abbâs radıyallahü anhüma şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem)'in yanında la'netleşme zikrolunmuştu. Âsım ibn Adiyy de bu konuda bir söz söylemişti. Sonra Âsım ayrılıp evine gitti. Akabinde ona kendi kavminden olan(Uveymir adında) bir adam geldi ve kendi karısının yanında bir adam bulduğunu söyleyip şikâyet ediyordu. Bunun üzerine Âsim: Ben bu belâya ancak kendi sözümden dolayı uğramışımdır, dedi ve o adamı Peygamber'in yanına götürdü. o adamın karısını beraberinde bulduğu kimseyi haber verdi. Bu adam sarı benizli, az etli, düz saçlı idi. Onun, ailesinin yanında bulduğunu iddia ettiği adam ise esmer, kalın ve dolgun bacaklı, çok etli şişman bir kimse idi. \"Allâhumme, beyyin” “Allah'ım, beyân buyur!\" dedi. Sonunda kadın, kocasının yanında bulduğunu zikrettiği adama benzer bir çocuk doğurdu. Peygamber bu karı-koca arasında la'netleşme yaptırdı... ibn Şeddâd, bulundukları bu mecliste Abdullah ibn Abbâs'a hitaben: İşte o kadın, Peygamber(sallallahü aleyhi ve sellem)'in\"Eğer ben beyyinesiz olarak recm edici bir kişi olsaydım, işte bu kadını recm ederdim\" buyurduğudur, dedi. Abbâs da: Hayır, o kadın, İslâm içinde kötülüğü açıkça yapan bir kadındı, dedi",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 6857,
			"arabicnumber": 6857,
			"text": "Bize Süleyman ibn Bilâl, Sevr ibn Zeyd'den; o daEbû'l- Gays'tan; o da Ebû Hureyre (radıyallahü anh)'den tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem) bir kerresinde: \"Helak edici yedi şeyden sakınınız!\" buyurdu. Sahâbîler: Yâ Rasûlallah! Bu yedi şey nedir? diye sordular. Rasülullah: \"Allah'a ortak kılmak, sihir yapmak, Allah'ın haram kıldığı bir hayâtı öldürmek, haklı öldürücüler müstesnadır; faiz kazancı yemek, yetim malı yemek, düşmana hücum sırasında harbden kaçmak, zinadan korunmuş olup hatırlarından bile geçmeyen mü'min kadınlara zina isnâd etmektir\" buyurdu",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 6858,
			"arabicnumber": 6858,
			"text": "Ebû Hureyre (radıyallahü anh) şöyle demiştir: Ben Ebû'l-Kaasım salla'llâhu aleyhi ve sellem'den işittim, şöyle buyuruyordu: \"Her kim mâliki olduğu kölesine zina isnâd eder, köle de onun söylediği bu isnâddan berî bulunursa, o kimse kıyâmet gününde dövülür, ancak kölenin onun söylediği gibi olması hâlinde dövülmez",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 6860,
			"arabicnumber": 6860,
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 81
			}
		}
	]
}