{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"87": "Blood Money (Ad-Diyat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6861,
			"arabicnumber": 6861,
			"text": "Abdullah b. Mes'ud şöyle demiştir: Adamın biri: \"Ya Resulallah! Allah katında hangi günah en büyüktür\" diye sordu. Resulullah Sallallahu Aleyhi ve Sellem: \"Allah seni yarattığı halde Allah'a ortak ilah kabul etmendir\" buyurdu. O adam \"Sonra hangisi?\" diye sordu. Resulullah Sallallahu Aleyhi ve Sellem \"Sonra beraberinde yemek yemesinden korktuğun için çocuğunu öldürmendir\" buyurdu. Soruyu soran kişi \"Bundan sonra hangisi?\" dedi. Nebi Sallallahu Aleyhi ve Sellem \"Sonra komşunun eşiyle zina etmendir\" buyurdu. Bunun üzerine Allahu Teala Nebi Sallallahu Aleyhi ve Sellem'in söylediklerinin tasdiki olmak üzere şu ayetleri indirdi: \"Yine onlar ki, Allah ile beraber (tuttukları) başka bir ilah'a yalvarmazlar, Allah'ın haram kıldığı can'a haksız yere kıymazlar ve zina etmezler. Bunları yapan günahımın cezasını) bulur. \"(Furkan 68)",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6862,
			"arabicnumber": 6862,
			"text": "İbn Ömer'in nakline göre Nebi Sallallahu Aleyhi ve Sellem \"Mu'min kişi dokunulması haram bir kanı dökmedikçe dininden bir genişlik içindedir\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6863,
			"arabicnumber": 6863,
			"text": "Abdullah b. Ömer \"Nefsini içine atan kimseler için hiçbir çıkış yeri olmayan işlerin helak edicilerinden biri, dokunulmaz olan bir kanı helal bir sebep olmaksızın dökmektir\" demiştir",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6864,
			"arabicnumber": 6864,
			"text": "Abdullah b. Mes'ud'un nakline göre Nebi Sallallahu Aleyhi ve Sellem \"(Kıyamet gününde) insanlar arasında verilecek ilk hüküm kan davaları hakkındadır\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6866,
			"arabicnumber": 6866,
			"text": "Ve Habîb ibn Ebî Amrete, Saîd ibn Cubeyr'den söyledi ki, İbn Abbâs radıyallahü anhüma şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) Mıkdâd'a: \"Ey Mıkdâd! Mü'min bir kişi, kâfirlerden meydana gelen kavminin beraberinde îmânını gizlese de (selâmete erişince) îmânını açığa çıkarsa, bunun üzerine sen de onun (îmânına i'timâd etmeyerek) öldürsen (bu doğru olmaz). Nitekim sen de hicretten önce Mekke'de îmânını böyle gizliyordun!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6867,
			"arabicnumber": 6867,
			"text": "Abdullah b. Mesud r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"Haksız yere öldürülen her nefsin öldürülme günahından mutlaka bir pay ilk Ademoğlu üzerine de olur\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6868,
			"arabicnumber": 6868,
			"text": "Abdullah b. Ömer'in nakline göre Nebi Sallallahu Aleyhi ve Sellem \"Benden sonra birbirinizin boyunlarını vuran kafirlere dönmeyiniz\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6869,
			"arabicnumber": 6869,
			"text": "Cerir b. Abdiilah şöyle demiştir: Nebi Sallallahu Aleyhi ve Sellem veda haccında bana \"insanlan sustur\" diye emretti ve okuduğu hutbede \"Benden sonra kafirlerin adetine dönüp birbirlerinizin boyunlannı vurmayınız!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6870,
			"arabicnumber": 6870,
			"text": "Abdullah b. Amr'ın nakline göre Resulullah Sallallahu Aleyhi ve Sellem: \"Büyük günahlar Allah'a ortak koşmak, ana-babaya karşı gelmek -veya - yalan yere yemin etmektir (yeminü'l-ğamus)\" demiştir. Ravi Şu'be hadisi böyle şüpheli rivayet etmiştir. Muaz'ın Şu'be'den nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"Büyük günahlar, Allah'a ortak koşmak, yalan yere yemin etmek (ğamus yemini), anababaya karşı gelmek -yahut adam öldürmektir-\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6871,
			"arabicnumber": 6871,
			"text": "Enes b. Malik r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem: \"Büyük günahların en büyüğü Allah'a ortak koşmak, adam öldürmek, ana-babaya eza etmek ve yalan söylemek -yahut- yalan yere şahitlik yapmaktır\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6872,
			"arabicnumber": 6872,
			"text": "Bize Ebû Zabyân tahdîs edip şöyle dedi: Ben Usâme ibn Zeyd ibn Hârise (radıyallahü anh)'den işittim, o tahdîs ederek şöyle dedi: Rasûlüllah(sallallahü aleyhi ve sellem) bizi Cuheyne kabilesinden el-Huraka boyu üzerine cihâda göndermişti. Bizler sabah vakti o kavme baskın yaptık ve onları bozguna uğrattık. Ben, Ensâr'dan bir adamla beraber onlardan bir kimseye kavuştuk. Biz onu kuşatıp yakalayınca \"Lâ ilahe ille'llâh \"dedi. Bu tevhîd sözü üzerine Ensârî arkadaşım ondan kendini çekti. Fakat ben mızrağımı ona sapladım ve onu öldürdüm. Medine'ye geldiğimizde bu hâdise Peygamber'e ulaştı da bana: \"Yâ Usâme! Sen o adamı 'Lâ ilahe ille'llâhu' demesinin ardından niçin öldürdün?\" buyurdu. Yâ Rasûlallah! O bu sözü ancak ölümden sığınıcı olarak söylemiştir, dedim. \"Sen onu ‘Lâ ilahe ille’llâh' demesinin ardından niçin öldürdün?\" buyurdu ve bu soruyu bana karşı devamlı tekrar ediyordu. ben: Keski bu günden önce müslümân olmayaydım! diye temennî ettim",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6873,
			"arabicnumber": 6873,
			"text": "Ubade b. Samit şöyle anlatmıştır: Ben Akabe gecesinde Nebi Sallallahu Aleyhi ve Sellem'le bey'at etmiş olan nakiblerden birisiydim. Biz: o gece Resulullah Sallallahu Aleyhi ve Sellem'e şu şartlar üzerine bey' at ettik. Allah' a hiçbir şeyi ortak koşmamak, hırsızlık yapmamak, zina etmemek, Allah'ın haram kıldığı cana kıymamak, yağma yapmamak, asi olmamak, bunlara sadık kaldığıriuz takdirde cennetle müjdelenmek, bu günahlardan birini işlersek bunun hükmünün Allah'a ait olması (üzerine bey'at ettik)",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6874,
			"arabicnumber": 6874,
			"text": "Abdullah b. Ömer'in nakline göre Nebi Sallallahu Aleyhi ve Sellem \"Kim bize silah çekerse artık o kimse bizden değildir\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6875,
			"arabicnumber": 6875,
			"text": "Ahnef b. Kays şöyle anlatmıştır: Ben (Sıffın savaşı sırasında) şu adama (Hz. Ali'ye) yardım etmek için gidiyordum. Ebu Bekir karşıma çıkarak bana \"Nereye gidiyorsun?\" diye sordu. Ben \"Şu adama yardım edeceğim!\" dedim. O da bana şöyle dedi: \"Geri dön! Çünkü ben Nebi Sallallahu Aleyhi ve Sellem'den işittim: \"İki Müslüman kılıçlarıyla karşılaştıkları zaman ölen de, öldüren de ateştedir\" buyuruyordu. Ben \"Ya Resulallah! Öldüren böyledir ama ölene ne oluyor?\" diye sordum. Nebi Sallallahu Aleyhi ve Sellem \"Ölen de, arkadaşını öldürmeye hırslı idi\" buyurdu. Fethu'l-Bari Açıklaması: Başlıkta yer alan ayetten maksat, baş tarafındaki \"Kim bir cana veya yeryüzünde bozgunculuk çıkarmaya karşılık olmaksızın (haksız yere) bir cana kıyarsa bütün insanları öldürmüş gibi olur\"(Maide 32) ifadesidir. Burada yer verdiğimiz hadislerin birincisi yani \"Haksız yere öldürülen her nefsin öldürülme günahından mutlaka bir pay ilk Ademoğlu üzerine de olur\" ifadesi ayetin bu hükmüne uygun düşmektedir. Kalan oniki hadis adam öldürmenin ne kadar büyük bir günah olduğu hakkındadır. İbn Battal şöyle demiştir: Bu hadislerde adam öldürmenin ne kadar büyük bir günah olduğu belirtilmekte ve bu fiilden kaçınmak gerektiği mübalağalı bir üslupla vurgulanmaktadır. İbn Battal şöyle demiştir: Selef bilginleri \"Bütün insanları öldürmüş gibi olur, bütün insanları kurtarmış gibi olur\" ifadesinden maksadın ne olduğu konusunda ihtilaf etmişlerdir. Bir kısım bilgin bunun manasının adam öldürmenin günahının ağır olduğunu vurgulamak ve bir mu'mini öldürmenin ne kadar büyük bir sorumluluk olduğunu belirtmektir demişlerdir. Taberi, Hasan-ı Basri, Mücahid ve Katade'nin bu görüşte olduklarını nakletmiştir. Hasan-ı Basri \"Bir tek cana kıyan kimse, bütün insanları öldürmüşçesine cehenneme gider\" demiştir. Bazıları, ayetin manası bütün insanlar onun hasmı olur demektir derken, bazı bilginler bir mu'mini öldürmesi dolayısıyla o kimseye bütün insanları öldürdüğünde nasıl kısas gerekiyorsa öylece gerekir demişlerdir. Çünkü herkesin lehine kısas olarak ona bir adet ölüm cezası uygulanır. Bu görüşü Taberi, Zeyd b. Eslem'den nakletmiştir. Taberi ayetten maksadın cezanın büyük olduğunu vurgulamak ve tehdidin şiddetini belirtmek olduğu görüşünü tercih etmiştir. Zira ayette bir kişiyi öldürmekle, herkesi öldürmek Allah'ın gazabını ve azabını çekme açısından eşittir. Buna mukabil hiç kimseyi öldürmeyen kişi, herkes elinden selamette kaldığı için bütün insanlığı kurtarmış gibi olur. Hadisteki \"ilk Ademoğlu\"'dan maksat, bilginlerin çoğuna göre Kabil'dir. Hadiste geçen \"……el-kifl\" kelimesi, pay anlamındadır. Bu kelime çoğunlukla ecir ve sevap karşılığı kullanılırken, zayıf bir görüşe göre günah karşılığında da kullanılır. \"Ey iman edenler! Allah 'tan korkun ve Nebiine inanın ki o, size rahmetinden iki kat versin\" ayetinde geçen \"\" nasip ve ecir manasındadır.(Hadid 28) \"......\" kelimesi \"Kim kötü bir işe aracılık ederse onun da ondan bir payı 0lur\"(Nisa 85) ayet-i kerimesinde günah anlamında kullanılmıştır. \"Çünkü o adam öldürme adetini ilk çıkaran kişidir\" ifadesinden bir uygulamayı ilk başlatan kişiye ya sevap ya da günah yazılacağı sonucu çıkmaktadır. Helal olmayan bir şeye yardımcı olmak haramdır kaidesi buna dayanmaktadır. Müslim'in Cerir'den nakline göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Kim İslamda güzel bir çığır açarsa onun ve onu işleyenlerin sevabı kıyamete kadar o kişiye olur. Kim de İslam'a kötü bir çığır açarsa onun günahı ile işleyenlerin günahı kıyamete kadar onun üzerinde olur. \"(Müslim, İlim, Zekat) Bu, açtığı çığırdan dolayı tövbe etmeyen kimse için de sözkonusudur denilmiştir. \"Benden sonra kafirlerin adetine dönüp birbirlerinizin boyunlarını vurmayınız!\" Bu cümlenin ne anlama geldiği hakkında sekiz görüş ileri sürülmüştür. 1- İfade, Haridierin anladığı gibi zahiri üzeredir. 2- İfade, boyun vurmayı helal sayanlarla ilgilidir. 3- İfade kanların, Müslümanların ve dinin haklarını inkar eden kişiler olarak dönmeyiniz demektir. 4- Birbirinizi öldürerek kafirlerin fiillerini yapan kişiler olmayınız. 5- Silah kuşanan kimseler olarak dönmeyiniz. Çünkü Arapça' da \"\"-P J:> .;s\" zırhını bir kumaş parçasıyla örttü demektir. 6- Allah'ın nimetine nankör kimseler olarak dönmeyiniz. 7 - Bu ifadeden maksat zahiri manası değil, o fiili yapmaktan kaçındırmaktır. 8- Birbirinizi tekfir eden kimseler olarak dönmeyiniz yani iki fırkadan biri diğerine ey kafir deyip, onu tekfir etmesin. Bundan sonra dokuzuncu ve onuncu bir açıklama daha buldum. Bunları Fiten bölümünde zikrettim. Hadisin geniş bir açıklaması inşallah Fiten bölümünde gelecektir. \"İnsanları sustur.\" Yani onlardan konuşmamı dinlemeleri için susmalarını iste. \"Sabah vakti o kavme baskın yaptık.\" Yani o insanlar henüz sabah vati daha ne olduğunu bile anlamaya fırsat bulamadan onlara saIdırdık. Arapça'da \"\" ona sabahleyin ansızın geldim demektir. \"Bir sabah kendilerine, yakalarını bir daha bırakmayacak olan bir azap gelip çattl\"(Kamer 38) ayet-i kerimesinde kelime bu anlama kullanılmıştır. .....= onu kuşatıp yakalayınca\" yani ona yetişip, etrafı bizim tarafımızdan sarıldığında demektir. \"Onu adamı 'la ilahe illailah' demesinin ardından niçin öldürdün?\" İbnü'tTın şöyle demiştir: Nebi Sallallahu Aleyhi ve Sellem'in bu kınaması, öğüt için bir tali m ve tebliğdir. Bundan maksat, hiç kimsenin kelime-i tevhidi telaffuz eden kimseyi öldürmeye kalkışmamasıdır. Kurtubi şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem'in bu soruyu tekrarlaması ve Usame'nin mazeretini kabul etmemesi, böyle bir fiile atılmayı ağır bir ifade ile engellemektedir. \"Keşke bugünden önce Müslüman olmayaydım diye temenni ettim.\" Yani keşke bugün Müslüman olsaydım diye temenni ettim. Çünkü İslam kendisinden önceki tüm hataları ve günahları silip, yok eder. Usame o fiilin sorumluluğundan emin olmak için İslam'a tam o sırada girmeyi temenni etti. Bununla o andan önce Müslüman olmamayı temenni etmedi. Kurtubi şöyle demiştir: Usame'nin bu sözü, -Nebi Sallallahu Aleyhi ve Sellem' den duymuş olduğu şiddetli tepkiden dolayı- işlediği o fiilin karşısında daha önceki salih amellerini küçük gördüğünü göstermektedir. Onun bu şekilde temennisi mübalağa niteliklidir. Bunun mübalağa olduğunu, hadisin A'meş'in bazı rivayet yollarında \"O gün Müslüman olmayı temenni ettim\" şeklindeki ifadesidir. \"Kim bize silah çekerse artık o kimse bizden değildir.\" Burada söylenmek istenen şudur: Kim Müslümanlarla çarpışmak için onlara silah çekecek olursa onlardan olmaz. Çünkü bu hareket onların yüreğine korku salar. Buna karşılık, onları korumak için silah çekmek böyle değildir. Çünkü bu takdirde kişi silahı onların aleyhinedeğil, lehlerine çekmektedir. \"Bizden değildir\" yani bizim gittiğimiz yolda gitmemektedir, anlamınadır. Hz. Nebi Sallallahu Aleyhi ve Sellem'in ifadesini - \"Kim bize silah çekerse İslam dininden değildir\" manasını kastetme ihtimaline rağmen- mutlak olarak kullanması, o fiili caydırma ve korkutmada mübalağada bulunmak içindir. \"Ateştedir\" yani eğer Allah kendilerini ateşe sokacak olursa ateştedir demektir. Çünkü katil ile maktul azaba uğramayı hak ettikleri bir fiil işlemişlerdir. Hattabi şöyle demiştir: Buradaki tehdit mesela dünyevi bir düşmanlık veya bir mülk talebi için adam öldüren kimseye yöneliktir. Zira zalimlerle çarpışan veya kendisine saldıranı savuşturup, öldüren kimse bu tehdide dahil değildir. Zira o şer' an çarpışmaya izinlidir",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6876,
			"arabicnumber": 6876,
			"text": "Enes b. Malik'in nakline göre yahudinin biri bir cariyenin başını iki taşın arasında ezdi. O cariyeye \"bunu sana kim yaptı? Filanca mı yoksa filanca mı?\" diye soruldu. Sonunda yahudinin adı verilince, o kişi Nebi Sallallahu Aleyhi ve Sellem'e getirildi. Orada alıkonuldu. Nihayet suçunu itiraf edince, onun da başı taşla ezildi.\" Fethu'l-Bari Açıklaması: \"Katili suçunu itiraf ettirmek amacıyla sorgulama ve had cezalarında ikrarın durumu.\" İbn Abdilberr şöyle demiştir: Fıkıh bilginleri, katil bir kölenin, hür bir kişiye, katil bir kadının erkeğe, katil bir erkeğin de kadına karşılıkkısasen katledileceği noktasında icma etmişlerdir. Ancak Hz. Ali gibi bazı sahabi ve Hasan-ı Basri gibi tabiun alimlerinden nakledilen bir görüşe göre bir erkek bir kadını öldürdüğünde kadının akrabaları, o erkeği öldürmek istediklerinde diyetin yarısını vermekle yükümlüdürler. Katili kısasen öldürmedikleri takdirde tam bir diyet alırlar. İbn Abdilberr şöyle der: Hz. Ali' den böyle bir görüş sahih olarak naklediimiş değildir. Fakat bu görüş, Basra fakihlerinden biri olan Osman eL.-Bettl'ye aittir. Kısas açısından erkekle kadının birbirine eşit olduğunu bilginlerin şu ittifakı göstermektedir: Eli kesik veya bir gözü kör bir kişiyi böyle olmayan sağlam bir kimse teammüden öldürdüğü takdirde ona kısas uygulamak gerekir. Öldürülenin bir gözünün kör veya elinin kesik olması, katilin söz konusu noksanlığın diyetten karşılığını almasını gerektirmez. İmam Buharl'nin \"Katili suçunu itiraf ettirmek amacıyla sorgulama\" şeklindeki başlığı, adam öldürmekle suçlanan ve aleyhinde bir beyyine bulunmayan kimseyi suçunu itiraf ettirmek amacıyla sorgulama demektir. \"Cariyenin başını ezdi.\" Hadisin metninde geçen \"er-rad\" ile \"er-radh\" aynı manadadır. Hadiste geçen \"cariye\"nin, bildiğimiz cariye olma ihtimali bulunduğu gibi ergenlik yaşına gelmemiş \"hür kız çocuğu\" olma ihtimali de sözkonusudur. Hişari1 b. Zeyd'in bundan sonraki bölümde yer alan Enes hadisi şöyledir: \"Üzerinde gümüş zınet eşyası bulunan bir cariye Medine'de evden dışarı çıktı. Yahudinin biri ona taş attı.\" Bu hadiste geçen\" evdahun\", Ebu Ubeyde'ye göre gümüşten yapılmış zınet eşyası demektir. \"Orada alıkonuldu. Nihayet suçunu itiraf edince ... \" Bu ifadeden anlaşılan hakimin cinayet işleyen kimseler aleyhine sonuçlar çıkarmasınin uygun olduğudur. Hakim sanıklar suçlarını itiraf etmeleri ve ikrarlarına binaen kendilerini tutuklamak için onlara kibar davranır. Suçlularından tövbe etmek üzere gelmeleri bunun aksinedir. Zira hakim cinayeti işlediğini açık ifadelerle söylemeyen kimseden yüz çevirir. Zira suçunu itiraf ettiği takdirde ona had cezası uygulamak gerekir. Yukarıdaki olayın devamı, o Yahudi aleyhine herhangi bir beyyinenin mevcut olmamasını ve onun ikrarına binaen cezalandırılmış olmasını gerekli kılmaktadır. Hadisten sırf şikayetçi olmakla ve işaretle kan talebi yapmak gerektiği anlaşılmaktadır. el-Mazerı şöyle demiştir: Bu hadis, kılıçtan başka bir aletle kısas uygulamasını inkar eden ve katil bir erkeğin öldürdüğü kadından dolayı katledilmesini inkar edenlere reddiyedir. .......... yani onun kafasını taşla ezdi demektir",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 6877,
			"arabicnumber": 6877,
			"text": "Hişam b. Zeyd'in nakline göre dedesi Enes b. Malik şöyle anlatmıştır: Medine'de üzerinde gümüş zınet eşyası bulunan bir cariye dışarı çıkar. Yahudinin biri ona bir taş atar. Cariye son nefeslerini verirken Nebi Sallallahu Aleyhi ve Sellem'e getirilir. Resulullah Sallallahu Aleyhi ve Sellem ona \"Seni filanca mı öldürmeye teşebbüs etti?\" diye sorunca, cariye başını kaldırarak \"hayır\" işareti yapar. Nebi Sallallahu Aleyhi ve Sellem soruyu tekrar ederek \"seni öldürmeye teşebbüs eden filanca mıydı?\" der. Cariye başını kaldırarak \"hayır\" işareti yapar. Nebi Sallallahu Aleyhi ve Sellem üçüncü kez \"Seni öldürmeye teşebbüs eden filanca mıydı?\" deyince, cariye başını indirerek \"evet\" işareti yapar. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem O kişiyi çağırtır ve başı iki taş arasında ezilerek (kısasen) öldürür. Fethu'l-Bari Açıklaması: \"Taş veya sapa ile öldürmenin hükmü.\" imam J3uharl başlıktaki ifadeyi görüldüğü üzere mutlak olarak kullanmış ve bu konuda ihtilaf olduğuna işaret etmek için kesin bir ifade kullanmamıştır. Fakat onun burada yer verdiği hadis, çoğunluğun görüşünü tercih ettiğine işaret etmektedir. imam Buhari, bu konuda bir yahudinin bir cariyenin hayatına kastettiğinden söz eden hadise yer verir. Bu, \"Bir katil öldürmede kullandığı aletle (kısasen) katledilir\" görüşünde olan çoğunluğu destekleyen bir delildir. Bu bilginler \"Eğer ceza verecekseniz, size yapılan işkencenin misliyle ceza verin\"(Nahl 126) ayeti ile \"Kim size saldınrsa siz de ona misilleme olacak kadar saldınn\"(Bakara 194) ayetlerini esas almışlardır. Ancak Kufeli fıkıh bilginleri bunlara muhalif kalmışlardır. Onlar \"Kılıçtan başka bir şeyle kısas olmaz\" hadisini delilolarak almışlardır. Ancak bu hadis zayıftır. Hadisi Bezzar, İbn Adiy, Ebu Bekre'den rivayet etmişlerdir. İbnü'l-Münzir şöyle demiştir: Fıkıh bilginlerinin çoğunluğuna göre bir kimse birisini bir şey kullanarak öldürürse genellikle onun gibi bir şeyle (kısasen) katledilir. Bir alet kullanarak katletme, teammüden öldürmedir. Ata ve Tavus teammüden öldürmenin şartı, silah kullanmaktır demişlerdir. İbnü'l-Arabı içki içmek, homoseksüel ilişki (livata) ve yakmak gibi içinde günah olan yollarla misilleme yapmak bundan müstesnadır. Yakma meselesinde Şafiı mezhebinde ihtilaf sözkonusudur. Ancak ilk ikisi üzerinde bilginlerin ittifakı vardır",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 6878,
			"arabicnumber": 6878,
			"text": "Abdullah'ın nakline göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"La ilahe illailah deyip, benim Allah'ın Resulü olduğuma şehadet eden bir Müslümanın kanı üç şey hariç helal olmaz. Bunlar cana can olmak üzere kısas edilmek, evlilik geçirip zina etmek ve dininden ayrılıp, mensup olduğu İslam toplumunu terk etmektir.\" Fethu'l-Bari Açıklaması: Başlıkta yukarıdaki' ayetin zikredilmesi, onun hadisin lafzı ile tam uyum halinde olmasındandır. Her halde İmam Buhari -ayet her ne kadar ehli kitap hakkında inmiş ise de- ayetin delalet ettiği hükmü n İslam'da da devam etmekte olduğunu açıklamak istemiştir. Teammüden öldürme olaylarında kısasta uyulacak prensip budur. \"Bir Müslümanın kan!. .. \" Bu cümleden maksat, bir Müslümanın kanının tamamını akıtmanın helal olmadığıdır. Bu, kanı akıtılmasa bile bir Müslümanın katledilmesinin haram olduğunun kinayeli olarak ifade edilmesidir. \"La ilahe illailah deyip ... şehadet eden ... \" Bu cümle, hadiste yer alan \"\"rl=kişi\" kelimesinin ikinci sıfatı olup, \"Müslüman\"dan maksadın iki kelime-i şehadeti getiren kimse olduğunu açıklamak için zikrediimiştir. \"Üç şey hariç.\" Yani üç özellikten biri hariç demektir. \"Cana can.\" Kim birisini haksız yere teammüden öldürecek olursa şartına riayet edilerek katledilir. \"Evlilik geçirip zina etmek.\" Böyle bir kişinin recm yoluyla katledilmesi helal olur. Hadiste geçen \"cemaat\" kelimesinden maksat, Müslümanların toplumudur. Buna göre mana, onlardan ayrılan veya irtidad etmek suretiyle onları terk eden demektir. İbn Dakik el-Id şöyle demiştir: Dinden dönmek (ridde), bilginlerin İcmaıyla erkekler açısından bir Müslümanın kanının mubahlığına sebeptir. Kadına gelince bu konuda ihtilaf vardır. İbn Dakik el-Id, bu hadisin zina cezası açısından kadınla erkeğin hükmünün aynı olması dolayısıyla irtidad olayında da kadının hükmünün erkeğin hükmüyle aynı olduğunu söyleyen çoğunluğa delil teşkil ettiğini ifade etmiştir. Nevevi\" ....... = dininden ayrılan ... \" ifadesinin ne şekilde olursa olsun dinden dönen herkes için genelolduğunu söylemiş ve netice olarak böyle bir kimsenin, İslama dönmediği takdirde katledilmesi gerekir demiştir. \"........= toplumu terk eden\" ifadesi ise, bid'atla veya iemayı kabul etmemekle toplumdan ayrılan herkesi kapsar. Rafızı, Harid ve başkalarının tutumlarında bunu görmek mümkündür. Nevevi böyle söylemiştir. Bu konu ileride etraflıca ele alınacaktır. Kurtubi, el-Mülhim isimli eserinde şöyle der: ......el-Mufariku li'l-cemaa= toplumdan ayrılan\" ifadesi, ...........= dinini terkeden\" ifadesinin sıfatıdır. Çünkü bir kimse dinden döndüğünde Müslümanların topluluğundan ayrılmış dur. Ne var ki irtidad etmemiş bile olsa Müslümanların topluluğunun dışına çıkan herkes, bu kategoriye girer. Sözgelimi gerekli olduğunda kendisine had cezası uygulanmasından kaçınan ve Müslümanlara karşı savaşanlar böyledirler. Haridierden ve başka zümrelerden bağı, yol kesici ve hirabe suçunu işleyenler bunun canlı örneğidirler. Kurtubi şöyle der: \".......\" kelimesi, genelliği ile bu kimseleri de kapsar. Gerçek böyle olmasaydı \"şu üç kişi\" şeklindeki sınırlama, isabetli olmazdı. Zira bu, (Rafızı, Harieı vb.leri gibi) yukarıda zikredilen ve kanları helal olan kimselerin istisna edildiği anlamına gelirdi. Bu durumda \"üç kişi\" şeklindeki sınırlama da (hasır) isabetli olmazdı. Ancak şarlin ifadesi böyle bir kusurdan münezzehtir. Bu da bize gösteriyor ki \"topluluktan ayrılma\" niteliği, bütün bunların tümünü kapsamaktadır. Kurtubi şöyle devam eder: Bunun açıklamasına gelince, topluluktan ayrılan herkes, dinini terk etmiş olmaktadır. Ancak mürted, dinin tamamını terk ederken, irtidad etmeksizin topluluktan ayrılan bir kısmını terk etmektedir. Ancak bu yaklaşım, tartışmaya açıktır. Çünkü üçüncü özelliğin aslı irtidaddır. Dolayısıyla irtidadın bulunması şarttır. İrtidad etmeksizin ayrılan kimseye mürted denemez. Dolayısıyla \"sınırlama\" (hasr) konusunda aykırı bir durum söz konusu olur. Bunun cevabı ise şöyledir: Hasr, bizzat katli belirlenmiş olan kişi hakkındadır. Kurtubl'nin saydıklarına gelince, bunlardan herhangi birini öldürmek, muharebe ve mukatele durumu gerçekleştiğinde mubah olur. Çünkü böyle bir kimsenin esir edildiğinde -hirabe suçluları hariç- öldürülmesi, bilginlerin ittifakıyla caiz değildir. Hirabe suçunda da tercih edilen böyledir. Fakat namazı terk eden kimsenin katledilmesi meselesi bununla çelişmektedir. İbn Dakik el-Id bu konuya değinerek şöyle demiştir: Bu hadis, namaz kılmayı terk eden kimsenin bundan dolayı öldürülemeyeceğine delil gösterilmiştir. Çünkü namaz kılmamak, hadiste verilen üç istisnadan değildir. Babamın hocası Hafız Ebü'l-Hasan b. el-Mufaddal el-Makdisı meşhur beyitlerinde delil olarak bunu kullanmıştır. Sonra sözkonusu beyitleri yazmıştır. O beyitlerden bazıları maksadımızı anlatmak için yeterlidir: Ta'zir eder hakim kılmayanı namazı, Ta'zirin her çeşididir bence cezası! Kanı masumdur kişinin, kural budur Üç şeyden birini işlerse cezasını bulur! Nevevi şöyle devam eder: Maliki mezhebinden olan bu bilgin (Kurtubl) kendi mezhebinin görüşünün aksi bir yaklaşımı tercih etmiştir. Şafillerden de İmamü'l-Haremeyn bu konuda bir problem olduğunu belirtmiştir. Bizim bu konudaki kanaatimiz şudur: Namaz kılmayan kimsenin durumu hakkında ihtilaf edilmiştir. Ahmed b. Hanbel, İshak ve bazı Maliki alimleri ile Şafiilerden İbn Huzeyme, Ebü't-Tayyib b. Seleme, Ebu Ubeyd b. Cüveyriye, Mansur el-Fakih, Ebu Cafer et-Tirmizi namazı terk eden kimsenin -vacipliğini inkar etmemiş bile olsa- kafir olacağı kanaatini benimsemişlerdir. Çoğunluk ise namaz kılmayan kişinin had cezası olarak katledileceği kanaatine varmışlardır. Hanefilerle onlar gibi düşünen Müzenı, namaz kılmayan kimsenin kafir olmayacağını ve öldürülme cezasının uygulanmayacağını söylemişlerdir. Namaz kılmayan kimsenin kafir olmadığına dair en güçlü delillerden birisi Ubade b. es-Samit'in rivayet ettiği şu hadistir: \"Beş namazı Allahu Teala kullara farz kılmıştır. \"(Muvatta, Salatu'l-leyl; İbn Mace, İkametu's-salaı; Nesai, Salat; İbn Hibban, Sahih, V, 23) Bu hadiste şöyle bir ifade yer almaktadır: \"Bu namazlan kılmayan kimse için Allah katında herhangi bir ahd yoktur. Allahu Teala dilerse o kişiye azap eder, dilerse onu cennetine koyar.\" Hadisi İmam Malik, Sünen imamları rivayet etmişlerdir. İbn Hibban, İbnü'sSeken ve başka bilginler sahih değerlendirmesinde bulunmuşlardır. Ahmed b. Hanbel ve onun paralelinde düşünen bilginler, namaz kılmayan kimsenin kafir olduğunu belirten hadislerin zahirierini esas alırken, onlara muhalif olanlar haberleri birbiriyle.cem ve telif etmek için \"namazı terketmeyi helal sayan\" şeklinde yorumlamışlardır. Doğruyu en iyi Allahu Teala bilir. Hocamız Tirmizi şerhinde şöyle demektedir: Bazı bilginler, hadiste sıralanan kanı helal olan üç kişiden bir kimsenin üzerine saldıran kişiyi öldürmeyi istisna etmişlerdir. Çünkü böyle bir kimseyi etkisiz hale getirmek için öldürmek caizdir. Hocamız bu açıklamasıyla Nevevl'nin istisna edilen üç kişinin genelliğinden, birisine saldıran ve benzeri kişileri tahsis ettiği yolundaki ifadesine işaret etmektedir. Çünkü böyle bir kimse etkisiz hale getirilirken öldürülebilir",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 6879,
			"arabicnumber": 6879,
			"text": "Enes'in nakline göre yahudinin biri üzerinde gümüş zınet eşyalan bulunan bir cariyeyi öldürür. Ve bunu taş kullanarak yapar. Bu cariye ölmek üzere iken Nebi Sallallahu Aleyhi ve Sellem' e getirilir. Resulullah Sallallahu Aleyhi ve Sellem ona \"seni öldürmeye teşebbüs eden filanca mıydı?\" der. Cariye başıyla \"hayır\" işareti yapar. Resulullah Sallallahu Aleyhi ve Sellem ikinci kez sorduğunda başıyla yine \"hayır\" işareti yapar. Üçüncü kez sorduğunda başıyla \"evet\" işareti yapar. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem O kişiyi kısasen iki taşla öldürür. Fethu'l-Bari Açıklaması: \"Taşla kısas etme.\" Yani taşla kısas etmenin hükmü. Kaved, Arapçada kısasta mislilik demektir. İmam Buhari bu konuda yahudiyle cariye olayından söz eden Enes hadisine yer vermiştir. Bu hadisin geniş bir açıklaması, kısa bir süre önce geçmişti",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 6880,
			"arabicnumber": 6880,
			"text": "Ebu Hureyre r.a.'in nakline göre Mekke'nin fethi yılı Huzaa kabilesi Leys oğullarından birini öldürdü. Bu kişi cahiliye döneminde Huzaa kabilesine mensup birisini öldürmüştü. Nebi Sallallahu Aleyhi ve Sellem ayağa kalkarak şöyle buyurdu: \"Allahu Teala filin Mekke'ye girmesine mani oldu, onlara Nebiini ve mu'minleri musallat kıldı. Dikkat ediniz Mekke benden önce hiç kimseye helal olmadt. Benden sonra da hiç kimseye helal olmayacaktır! Dikkat ediniz Mekke bana bir günün belli saatlerinde helal kılındı. Dikkat ediniz Mekke şu içinde bulunduğum saatte haramdır. Buranın dikeni koparılamaz, ağacı kesilemez, yere düşürülmüş bir eşya sahibini aramak maksadı hariç alınamaz. Bir yakını öldürülen kimse iki seçenekten birisi ile muhayyerdir. Ya kendisine fidye verilir ya da katil kısas edilir.\" Bunun üzerine Yemenlilerden Ebu Şah adında bir kişi ayağa kalktı ve \"Bana yaz ey Allah'ın Resulu!\" dedi. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem \"Bunları EbQ Şah için yazınız\" buyurdu. Sonra Kureyş'ten bir kişi ayağa kalktı ve \"Ya Resulallah! İzhir otu hariç olsun. Çünkü biz bu otu evlerimizde ve kabirlerimizde kullanıyoruz\" dedi. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem \"İzhir otu hariç\" buyurdu",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 6881,
			"arabicnumber": 6881,
			"text": "İbn Abbas r.a. şöyle demiştir: İsrailoğulları arasında kısas uygulanıyordu. Onların arasında diyet diye bir uygulama mevcut değildi. Allahu Teala bu ümmete \"Öldürülenler hakkında size kısas farz kılındı\" ayetinden başlayarak \"her kimin cezası kardeşi (öldürülenin velisi) tarafından bir miktar bağışlanırsa artık (taraflar) hakkaniyete uymalı\" ayetine kadar olan ayetler indi. (Bakara 178) İbn Abbas şöyle dedi: Af, teammüden öldürme de (mağdur yakınlarının kısastan vaz geçip) diyeti kabul etmeleri demektir. İbn Abbas sonra ..........= hakkaniyete uymalı\" yani iyilikle talep etmeli ve güzellikle ödemelidir, dedi. Fethu'l-Bari Açıklaması: İmam Buhari, başlığı haber formunda atmaktadır. Bu ifadenin zahiri sözkonusu muhayyerlik, diyet almakla katili kısas etmek, maktulün velilerine bırakılmıştır görüşünü benimseyen bilginlerin lehine delildir. Bu konuda katilin rızası şart değildir. Yukarıdaki atılan başlıkta kastedilen bu kadarıdır. Buradan hareketle İmam Buhari, Ebu Hureyre hadisi ile \"her kimin cezası kardeşi (öldürülenin velisi) tarafından bir miktar bağışlanırsa\" ayetinin tefsiri mahiyetinde olan İbn Abbas hadisine yer vermiştir. Ayette söylenmek istenen şudur: Maktulün velisi, onun kanını talep etmekten vazgeçip diyet vermesine razı olursa bu takdirde \"......\" yani diyeti talep edebilir. İbn Abbas ayette geçen \"af\" kelimesini teammüden öldürmelerde diyeti kabul etme şeklinde tefsir etmiştir. Diyeti kabul etme, kısas talep etme hakkı olan maktul velilerine aittir. Öte yandan katil kendi rızasına bakılmaksızın diyeti vermekle yükümlü tutulmuştur. Çünkü o \"Kendinizi öldürmeyiniz\"(Nisa 29) ayet-i kerimesinin genelliği dolayısıyla kendisini hayatta tutmakla emredilmiştir. Maktulün yakınları ondan diyet almaya razı olduklarında katilin bunu kabul etmeme gibi bir yetkisi yoktur. İbn Battal şöyle demiştir: \"Bu söylenenler Rabbinizden bir hafifletme ve rahmettir\"(Bakara 178) ayetinin manası İsrailoğullarında diyet uygulamasının olmadığına işaret etmektedir. İsrailoğullarında kısas, başvurulan bir tek ceza metoduydu. Allahu Teala maktulün yakınları razı 0lduğu takdirde diyet alma uygulaması getirerek bu ümmete hükmü hafifletmiştir. \"Allah fil'in Mekke'ye girmesine mani oldu.\" Nebi Sallallahu Aleyhi ve Sellem, filin Mekke'ye girmesinin engellenmesi ifadesi ile Habeşlilerin yaşadığı olaya işaret etmektedir. Bu olay meşhur olup, İbn İshak tarafından geniş geniş açıklanmıştır. Onun uzun açıklamalarını şöyle özetlemek mümkündür: Hıristiyan olan Habeşistanlı Ebrehe Yemen'i ele geçirince bir kilise yaptı ve insanları buraya hacca gelmeye zorladı. Araplardan birisi harekete geçerek bekçilerin dalgınlığından yararlanıp, kilisenin içine dışkısını yaptı ve sonra kaçtı. Ebrehe bunu duyunca öfkelendi ve Ka'be'yi yıkmaya karar verdi. Kalabalık bir ordu hazırladı ve yanına büyük bir fil aldı. Mekke'ye yaklaşınca Abdulmuttalib karşısına dikildi. Ebrehe ona hürmet etti. Çünkü Abdulmuttalib güzel ve yakışıklı bir insandı. Abdulmuttalib ondan yağmaladığı develerini geri istedi. Ebrehe, Abdulmuttalib'in ucuz hesapların adamı olduğunu düşündü ve \"Benden sadece yapmayı düşündüğüm şeyi yapmamamı rica edeceğini zannetmiştim\" dedi. Bunun üzerine Abdulmuttalib \"Bu beytin kendisini koruyacak Rabbi vardır\" dedi. Bunun üzerine Ebrehe ona develerini iade etti. Ebrehe ordularıyla ilerledi ve en öne o fili kattı. Ancak fil yere çöktü, onu kaldırmayı başaramadılar. Allahu Teala onların üzerine ikisi ayaklarında, birisi gagalarında olmak üzere üç taş bulunduran kuş sürüsü gönderdi. Kuşlar bu taşları onların üzerine attı ve Ebrehe ordusundan bu taşların isabet etmediği hiç kimse kalmadı. \"Ve men kutile lehu katflun\" yani kimin hayatta olan bir yakını öldürülür ve bu yüzden maktul haline gelirse ... \"Bu kişi iki seçenekten birini tercih edebilir.\" Tirmizi'nin, Evzaı yoluyla yaptığı rivayette \"Bu kişi ya affeder ya da katili (kısasen) öldürür\" denilmektedir.(Tirmizi, Diyat) Burada \"af\"tan maksat, her iki rivayeti birbiriyle cem ve telif etmiş olmak için kısastan vazgeçip, diyeti kabul etmek anlamındadır. Hadisten maktul yakınının kısasla diyetten birini tercih etmede muhayyer olduğu anlaşılmaktadır. Maktul l,.'akını diyeti tercih ettiğinde katilin bu isteğe uyma zorunluluğu olup olmadığı noktasında bilginler ihtilaf etmişlerdir. Bilginlerin çoğu katilin bu isteğe boyun eğmek zorunda olduğu kanaatine varmıştır. İmam Malik'ten gelen bir rivayete göre diyet ancak katilin rızası ile gerekli olur. O, görüşünü \"kimin bir yakını öldürülürse\" ifadesine dayandırmaktadır. Bu ifadeden hakkın maktulün varislerine ait olduğu anlaşılmaktadır. Maktul yakınlarından bazıları mevcut olmaz veya çocuk olursa kalan velilerin çocuk olan ergenlik çağına ermedikçe ve gaib olan geri dönmedikçe katili kısas ettirme hakları yoktur. Ya katil veya yakınları maktul yakınlarına diyet öder ya da katil bu suçundan dolayı (kısasen) katiedilir. Hadis-i şeriften Harem bölgesinde kısas uygulamanın caiz olduğu anlaşılmaktadır. Çünkü Nebi Sallallahu Aleyhi ve Sellem Mekke' de bu hitabı yapmış ve sözkonusu kısası Harem dışında yapılması şeklinde kayıtIamamıştır. \"Sonra Kureyş'ten bir kişi ayağa kalktı ve 'Ya Resulallah! İzhir otu hariç ol• sun' dedi.\" Ayağa kalkan kişinin Hz.Abbas b. Abdulmuttalib olduğu daha önCE geçmişti. Hadisin Mekke'nin haramlığı ve izhir otuyla ilgili kısmının açıklaması Hac bölümünde adı geçen başlıkların altında daha önce yapılmıştı. \"Allahu Teala bu ümmete 'öldürülenler hakkında size kısas farz kılındı' buyurdu.\" İsmail el-Kadı, Ahkamu'l-Kur'an'ında \"cana can\"dan maksat, şer'ı cezalar (hadler) açısından birbirine denk olan candır demiştir. Çünkü hür bir kişi, bir kölenin iffetine iftira attığında bilginlerin ittifakıyla sopa cezasıyla cezalandırılmaz. Kısasen katiedilmek had cezalarındandır. İsmail el-Kadı şöyle demiştir: Bunu Allahu Teala \"Yaralar da kısastır. Kim bunu (kısası) başlarsa kendisi için kefaret 01ur\"(Maide 45) ayetinde açıklamıştır. Buradan hareketle köle ve kafir bu hükmün dışında olur. Zira kölenin kanını ve yarasını tasadduk etme hakkı yoktur. Kafire gelince, ona \"tasadduk eden\" ismi verilemeyeceği gibi, \"kefaret veren\" de denemez. Bize göre İbn Abbas'ın açıklamasından anlaşılan, Allahu Teala'ın \"Onlara Tevrat'ta şöyle yazdık\" (Maide 45) ayeti Tevrat'ta İsrailoğullarına mutlak olarak \"cana can\" yazdık demektir. Bu hüküm, kısas hakkı olan kişilere affettikleri katilin öldürülmesi yerine diyet isteme yetkisi verilerek ve \"cana can\" ilkesi hüre karşı hür şeklinde genelliği daraltılarak hafifletiimiştir. Bu durumda köleyi öldüren hürün, kafiri öldüren Müslümanın kısasen katiedileceği hükmünü benimseyenleri Maide ayetinden destekleyecek bir delil bulunmadığı ortaya çıkmaktadır. Çünkü bizden önceki ümmetierin şeriatı, bizim şeriatımızda ona aykırı bir hüküm gelmediği sürece esas alınır. Hz. İsa'nın şeriatında kısas yoktu. Sadece diyet vardı denilmiştir. Eğer bu sabitse İslam şeriatı her iki uygulamaya da yer vermiş olmakta ve böylece ifrata ve tefrite kaçmaksızın ortada bulunmaktadır. Yukarıdaki hadis, katili kısas ettirmekle, diyet alma arasında muhayyer olan kişinin maktulün velisi olduğunu göstermektedir. Çoğunluğu oluşturan fıkıh bilginlerinin benimsediği görüş de budur. Hattabı ayette zikredilen \"aff'ın açıklamaya ihtiyacı olduğunu ifade etfuiştir. Çünkü kısasın zahirine bakacak olursak katille maktul yakınları arasında herhangi bir ilişki ve münasebet yoktur. Fakat ayetin manası ise şöyledir: Maktulün yakınları her kimi kısas etmekten vazgeçip, diyete razı olurlarsa diyeti hak edenlerin hakkaniyete uyması gerekir. Bu diyeti talep etmede hakkaniyettir. Katilin ise ödeme zorunluluğu vardır ki bu da diyeti güzellikle vermektir. imam Malik, Sevrı, Ebu Hanife kısasla diyet arasında muhayyerliğin katile ait olduğu hükmünü benimsemişlerdir. Bu ayetin nüzul sebebi konusunda ihtilaf edilmiştir. Bazıları ayet Araplardan iki mahalle hakkında indi. Bunlardan biri diğerinden daha şerefli idi. Şerefli olanlar karşı tarafın kadınları ile mehirsiz olarak evleniyarlardı. Aralarından bir köle öldürüldüğünde ona karşılık karşı taraftan bir hür kimseyi veya bir kadın öldürüldüğünde ona karşılık bir erkeği öldürüyorlardı. Bu haberi Taberi, Şa'bl'den rivayet etmiştir. Habere Ebu Davı1d da yer vermiştir. ibn Abbas şöyle anlatmıştır: Kureyza ve en-Nadır diye iki kabile vardı. en-Nadır, Kureyza'dan daha şerefliydi. Kureyza'dan birisi Nadır'den bir kişiyi öldürdüğünde katil kısasen öldürüıürdü. Nadır'den birisi Kureyza'dan birini öldürdüğünde yüz vesk hurma fidye verirdi. Nebi Sallallahu Aleyhi ve Sellem, Nebi olarak gönderildiğinde Nadır' den bir kişi Kureyza'dan birini öldürdü. Bunlar izin verin katili kısasen öldürelim dediler. Karşı taraf ise aramızda Nebi Sallallahu Aleyhi ve Sellem hakem olsun dediler ve Resulullaha geldiler. Bunun üzerine \"Ve eğer hüküm verirsen aralarında adaletle hükmet\"(Maide 42) ayet-i kerimesi indi. Ayette geçen \"kıst\" kelimesi cana can demektir. Sonra \"Yoksa onlar cahiliye idaresini mi arıyorlar\" ayeti indi.(Maide 50) Çoğunluğu oluşturan fıkıh bilginleri bu ayetten hile yoluyla olsa bile teammüden öldürme de diyet almanın caizliği hükmünü çıkarmıştır. Hileden maksat bir kimsenin maktulü aldatıp, kimsenin görmeyeceği bir yere götürerek orada katletmesi demektir. Malikiler bu hükme muhalif kalmışlardır. Bazı Maliki alimleri teammüden adam öldürdükten sonra Harem-i Şerif'e sığınan kişinin katledilebileceğini bu ayetten çıkarmışlardır. Buna karşılık bazıları, katil Harem' de katledilmez, tam tersine oradan çıkması beklenir diyerek bu hükme muhalif kalmışlardır. Hadisin bu hükme nasıl delalet ettiğine gelince; Resulullah Sallallahu Aleyhi ve Sellem bunu Harem bölgesinde öldürülmüş Huzaalı maktul olayı üzerine söylemiştir. Tea.mmüden öldürülmüş kimse hakkında kısas hükmü getirilmiştir. Harem-i Şerif'in dökunulmazlığı hakkında zikredilen ifade bununla çelişmez. Çünkü Harem-i Şerif'in dokunulmazlığından maksat, Allahu Teala'ın haram kıldığı şeyleri haram kılmak suretiyle Harem'e ta'zimde bulunmaktır. Cinayet işleyen birisine had cezasını orada uygulamak Allah'ın haramlarına ta'zim arasında yer alır",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 6882,
			"arabicnumber": 6882,
			"text": "İbn Abbas r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"İnsanların Allahu Teala'ya en sevimsizi üçtür: Bunlar Harem bölgesinde inkarcı, İslam'da cahiliye adetlerini isteyen ve bir kimsenin kanını haksız yere talep edendir\" buyurmuştur. Fethu'l-Bari Açıklaması: \"Bir kişinin kanını haksız yere talep etme\" den maksat, bunun hükmüdür. Mühelleb ve başkaları şöyle demişlerdir: Hadiste sözü edilen üç kişiden maksat bunların günah işleyenler arasında Allahu Teala'ın en sevmediği kişiler olduklarıdır. İfade Nebi s.a.v.'in \"ekberu'l-kebair= büyük günahların en büyüğü\" ifadesine benzemektedir. Aksi takdirde şirk, günahların tümü içinde Allahu Teala'a en sevimsiz olanıdır. \"Harem bölgesinde inkarcı\" \"Mülhid\" kelimesi esasen haktan sapan, meyleden demektir. \"İlhad\" doğrudan sapmak anlamına gelir. Küçük günah işleyen kimse de haktan saptığı için bu açıklama problemli görülmüştür. Ancak \"mülhid\" kelimesi örfte dinden çıkanlar anlamında kullanılmıştır denilerek bu itiraza cevap verilmiştir. Dolayısıyla bir günah işleyen kimseye \"mülhid\" denildiğinde bununla işlediği günahın ne kadar büyük olduğuna işaret edilmiş olmaktadır. \"İslam'da cahiliye adetlerini isteyen\" yani bir kimsenin bir başkasından alacağı olur ve alacağını o kişiyle babası veya çocuğu ya da akrabası gibi ortak kan bağı olmayan birisinden ister. Bazıları bundan maksadın cahiliye yaşantısını sürdürmek veya yaymak ya da hayata geçirmek isteyen kimseler olduğunu söylemişlerdir. \"i L=cahiliye adeti\" cahiliye insanlarının yaptıkları gibi bir komşu yu komşusu dolayısıyla ve bir müttefiği ittifak yaptığı kimse dolayısıyla sorumlu tutmak ve buna benzer uygulamalar demektir. Cahiliye dönemi insanlarının inandıkları şeyler de cahiliye adeti kavramına dahildir. Bundan maksat İslam'ın vazgeçirdiği uğursuz sayma, kehanet ve buna benzer şeylerdir. Taberani ve Oarekutnl'nin Ebu Şureyh'ten nakillerine göre Nebi s.a.v. \"İnsanlar içinde Allahu Teala'a en karşı gelen kişi katilinden başkasını öldüren veya İslam'da cahiliye döneminden kalma kanın davasını güdendir\" buyurmuştur.(Darekutnı, Sünen, III, 96; Taberani, el-Mu'cemü'l-kebir, XXII, 190) Bu hadiste geçen \"cahiliye adeti\"ni bu şekilde tefsir etmek mümkündür",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 6883,
			"arabicnumber": 6883,
			"text": "Aişe r.anha şöyle anlatmıştır: Uhud savaşı günü iblis insanların arasında \"Ey Allah'ın kulları! Arkanıza dikkat!\" diye bağırdı. Bunun üzerine önde bulunanlar arkaya döndüler ve bu kargaşa içinde el-Yeman'ı öldürdüler. Onun oğlu Huzeyfe \"Babam o! Babam o!\" dediyse de onu öldürdüler. Huzeyfe \"Allah sizi affetsin\" dedi. Ravi şöyle der: Onlardan bir grup yenilmiş ve Taif'e sığınmıştı. Fethu'l-Bari Açıklaması: \"Ölüm olayının ardından yanlışlıkla öldürmenin affı.\" Yani ölümün gerçekleşmesinden sonra maktulün değil, onun velisinin affı. Çünkü maktulün öldükten sonra affı imkansızdır. Öte yandan maktulün de bu affa girme ihtimali vardır. Buharl'nin \"Ölüm olayının ardından\" şeklinde kayıtlaması bunun eserinin ancak öldükten sonra ortaya çıkmasından dolayıdır. Zira maktul, karşı tarafı affedip, sonra da ölse bu aftan herhangi bir sonuç çıkmaz. Zira yaşasaydı affetmek sözkonusu olan bir hakkının olmadığı ortaya çıkacaktl. İbn Battal şöyle demiştir: Bilginler, velinin affının maktulün öldürülmesinden sonra olduğu noktasında görüş birliği etmişlerdir. Maktulün ölümünden önceye gelince, bu af -zahirilerin görüşlerinin aksine- maktule aittir. Zahiriler maktulün affın! geçersiz saymışlardır. Çoğunluğu oluşturan fıkıh bilginlerinin delili şudur: Veli, maktulün hak ettiği şeyi talep etme noktasında maktulün yerini aldığına, veliye af yetkisi verildiğine göre bunun asil olan maktule verilmesi evleviyetle gerekir. Ebu Bekir b. Ebi' Şeybe'nin Katade'den mürsel olaraknakline göre Ur ve b. Mesud kavmini İslam'a davet edince, atılan bir ok darbesiyle öldürülür. Ancak Ur ve ölmeden önce katilini affeder ve Nebi Sallallahu Aleyhi ve Sellem onun bu affın! geçerli sayar. \"Huzeyfe, 'Allah sizi affetsin' dedi.\" Maktulün diyeti orada bulunanlar üzerine vaciptir diyenler bu görüşü delil olarak almışlardır. Çünkü \"Allah sizi affetsin\" sözünün manası, sizleri bağışladım demektir. Maktul ancak talep etme hakkı olan bir şeyi bağışlayabilir",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 6884,
			"arabicnumber": 6884,
			"text": "Enes b. Malik'in nakline göre yahudinin biri bir cariyenin başını iki taşın arasında ezdi. eariyeye (ölmeden önce) \"Bunu sana kim yaptı? Filanca mı, yoksa filanca mı?\" diye soruldu. O yahudinin adı geçince cariye başıyla evet diye işaret etti. Ardından adı geçen Yahudi getirildi ve suçunu itiraf etti. Nebi Sallallahu Aleyhi ve Sellem'in emri üzerine başı bir taşla ezilerek kısas edildi. Hemmam: \"Başı iki taşın arasına konularak kısas edildi\" demiştir. Fethu'l-Bari Açıklaması: İbnü'l-Münzir şöyle der: Allahu Teala bir mu'mini yanlışlıkla öldüren mu'min hakkında diyet hükmü vermiştir. İlim ehli kimseler bu konuda icma etmişler ancak \"Eğer kendileri ile aranızda anlaşma bulunan bir toplumdan ise ... \"(Nisa 92) ayeti hakkında ihtilaf etmişlerdir. Bazıları burada sözkonusu olan maktulün kafir olduğunu söylemişler ve onun ailesinin, -aradaki anlaşma dolayısıyla- diyeti alacağını belirtmişlerdir. İbn Abbas, Şa'bi, İbrahim en-Nehai ve Zührl'nin görüşleri bu doğrultudadır. Bazıları ise burada sözkonusu olan maktulün mu'min olduğunu belirtmişlerdir. Ebü'ş-Şa'sa'nın görüşü bu yöndedir. İbrahim en-Nehal'den de bu yönde bir görüş nakledilmiştir. Taberi şöyle der: Bu iki yaklaşımdan birincisi, daha uygundur. Zira Allahu Teala \"misak= antlaşma\" kelimesini, mutlak söylemiş ve maktulün, -bundan önceki ayette olduğu gibi- mu'min olduğunu belirtmemiştir. Birinci yaklaşımın daha ağır basması, bir de şuna dayanmaktadır: mu'min zikredildiğinde diyet ve kefaret birlikte belirtilirken, kafirden söz edildiğinde sadece kefaretten söz edilmiştir. Burada ise hem diyet ve hem de kefaretten bahsedilmektedir",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 6885,
			"arabicnumber": 6885,
			"text": "Enes b. Malik'in nakline göre Nebi Sallallahu Aleyhi ve Sellem bir cariyeyi üzerindeki gümüş zinete tamah ederek öldüren yahudiyi kısasen öldürmüştür. İmam Buhari bu konuda Yahudi ile cariye olayını kısaca zikretmektedir. Bu haberin uzunca bir açıklaması yakında geçmişti",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 6886,
			"arabicnumber": 6886,
			"text": "Aişe r.anha şöyle anlatmıştır: Hastalığı esnasında Nebi Sallallahu Aleyhi ve Sellem'in ağzına ilaç koyduk. Bize 'Ağzıma ilaç koymayın\" dedi. Biz \"Hasta ilacı sevmez, onun için böyle söyledi\" dedik. Resulullah Sallallahu Aleyhi ve Sellem kendine gelince şöyle buyurdu: '1\\ranızdan ağzına ilaç damlatılmayacak hiç kimse kalmayacaktır. Bundan sadece Abbas müstesnadır. Çünkü o sizinle birlikte bulunmadı. \" Fethu'l-Bari Açıklaması: \"Yaralamalarda kadınlarla erkekler arasında kısas uygulaması.\" İbnü'lMünzir şöyle demiştir: Bilginler, bir erkeğin kadını öldürmesi dolayısıyla, bir kadının da erkeği öldürmesi sebebiyle kısasen katledileceği noktasında icma etmişlerdir. Ancak Hz. Ali, Hasan-ı Basri Ve Ata'dan gelen bir rivayet bundan müstesnadır. Hanefiler, yaralamalarda bu hükme muhalif kalmışlardır. Bazı bilginler sağlam elin çolak el karşılığında kısasen kesilmeyeceğini söylemişlerdir. Can ise bunun aksinedir. Çünkü sağlığı yerinde olan bir kimse bir hastayı öldürdüğü takdirde bilginlerin ittifakı ile kısasen öldürülür. İbnü'l-Münzir şöyle demiştir: Fıkıh bilginleri can konusunda kısas hükmünde icma etmelerine karşılık bunun dışındaki hususlarda ihtilaf etmişlerdir. İhtilaf edilen hususun ittifak edilene katılması gerekir. İlim ehli kimseler bir erkek öldürdüğü kadına karşılık kısasenöldürülür demişlerdir. Burada \"ilim ehli\"nden maksat çoğunluğu oluşturan bilginlerdir. \"er-Rebl'in kızkardeşi bir kişiyi yaralayınca Nebi Sallallahu Aleyhi ve Sellem 'Kısas uygulayın' diye emretti.\" Bu ifade Müslim'in Hammad b. Seleme ve Sabit vasıtasıyla Enes'ten naklettiği şu hadisin bir kısmıdır: \"er-Rebl'in kız kardeşi Üm mü Harise birisini yaralamıştı. Taraflar Nebi Sallallahu Aleyhi ve Sellem'in hükmüne başvurdular. Resulullah Sallallahu Aleyhi ve Sellem \"Kısas uygulayın\" buyurdu. Ümmü REbi \"Ya Resulallah! Filanca kadın kısas olunur mu! Vallahi o kısas edilmez\" dedi. Resulullah Sallallahu Aleyhi ve Sellem \"Subhanallah! Ey Ümmü Rebf! Kısas Allah'ın hükmüdür\" buyurdu. Çok geçmeden diyet vermeyi kabul ettiler. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: 'I\\llah'ın öyle kulları vardır ki yemin etseler Allah onları yeminlerinde yalancı çıkarmaz. \" (Müslim, Selam) \"Hastalığı esnasında Nebi Sallallahu Aleyhi ve Sellem'in ağzına ilaç koyduk. Bize I\\ğzıma ilaç koymayın' dedi.\" Bu hadisin açıklaması, Nebi Sallallahu Aleyhi ve Sellem'in vefatı bölümünde geçmişti. Burada hadise \"Aranızdan ağzına ilaç damlatılmayacak hiç kimse kalmayacaktır\" cümlesinden dolayı yer verilmiştir. Çünkü bu cümle, bir erkeğe karşı suç işleyen kadının kısas edilmesinin meşru olduğuna işaret etmektedir. Sebebine gelince; Nebi s.a.v.'in ağzına ilaç koyanlar, erkek ve kadın karışık halde idiler",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 6888,
			"arabicnumber": 6888,
			"text": "",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 6889,
			"arabicnumber": 6889,
			"text": "Humeyd şöyle demiştir: \"Adamın biri Nebi Sallallahu Aleyhi ve Sellem'in evine baktı. Resulullah Sallallahu Aleyhi ve Sellem ona bir tarak doğrulttu.\" Humeyd'e \"Bunu sana kim rivayet etti?\" diye sordum. \"Enes b. Malik\" diye cevap verdi. Fethu'l-Bari Açıklaması: \"Sultana (hakime) başvurmaksızın hakkını alma.\" Yani bir kimsenin hakimin hükmü olmadan borçlusundan alacağını alması. \"Veya kısas etme\" yani bir kimsenin bir başkasını kısasen öldürmeye veya organını kısas ettirmeye hakkı doğsa durumunu hakime arzetmesi şart mıdır yoksa hakime müracaat etmeksizin hakkını alması caiz midir? Yukarıdaki başlıkta geçen \"sultan\" kelimesinden maksat hakimdir. İbn Battal şöyle demiştir: Fetva veren imamlar hiç kimsenin hakime (sultan) müracaat etmeksizin hakkını kısasen almasının caiz olmadığı noktasında ittifak etmişlerdir. İbn Battal şöyle devam eder: Bilginler daha önce ayrıntısı geçtiği üzere bir kimsenin kendi kölesine had cezası uygulayıp, uygulayamayacağı konusunda ihtilaf etmişlerdir. İbn Battal şöyle devam eder: Hakkını almaya gelince, bilginlere göre -yakında açıklayacağımız üzere- bir kimsenin alacağı malolduğu ve karşı taraf da bunu inkar ettiği ve elinde de ispat edecek bir beyyine bulunmadığı takdirde hakkını o kişiden alması caizdir. İbn Battal bundan sonra yukarıda yer verilen hadise \"Bu ifade, insanların özel hayatlarından haberdar olmayı caydırma ve bunu yapana ağır bir ifade kullanma tarzında söylenmiştir\" diye cevap vermiştir. Bizim kanaatimize gelince, İbn Battal'ın sözünü ettiği ittifak, sanki İsmail el-Kadl'nin Nüshatu Ebi'z-Zinad'da görüşlerine başvurulan fıkıh bilginlerinden naklettiği ifadeye dayanır gibidir. Bu eserde şöyle denilmektedir: Bir kimsenin hakime başvurmaksızın had cezalarından herhangi birini uygulaması uygun değildir. Ancak bir kimsenin kendi kölesine zina haddini uygulaması mümkündür. Bu Ebü'z-Zinad zamanında Medinelilerin ittifakından ibarettir. Buna verilecek cevaba gelince, İbn Battal yukarıdaki haberin zahirine göre amel edilmez demek istiyorsa bu bizce tartışılır. \"İznin olmadan.\" Bu cümle izin verilerek evin içine bakmayı hüküm dışına çıkarmaktadır. \"Gözünü çıkarsan\" İbnü'l-Katta' \"fekae\" fiilinin gözünün ışığını giderdi anlamına geldiğini söylemiştir. \".......\" Günah veya hesaba çekilme anlamındadır. \"Ona bir tarak doğrulttu\" yani tarağını ona doğru doğrulttu demektir. Arapçada \"tasvıb\" oku hedefine yöneltmek demektir. \"Tesdıd\" de aynı manadadır. Nitekim şu meşhur beyitte kelime bu anlama kullanılmıştır: Atıcılık öğretiyorum ona her gün Ateş etti bana pazıları güçlendiği gün",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 6890,
			"arabicnumber": 6890,
			"text": "Aişe r.anha şöyle anlatmıştır: Uhud savaşı günü müşrikler yenildiler. İblis \"Ey Allah'ın kulları! Arkanıza dikkat!\" diye bağırdı. Bunun üzerine önde bulunanlar arkaya döndüler ve onlarla arkadakiler çatışmaya başladılar. Huzeyfe etrafa bakarken bir de ne görsün, babası el-Yeman Huzeyfe \"Ey Allah'ın kulları! Babam o, babam o!\" diye bağırdı. Hz. Aişe r.anha şöyle devam eder: Allah'a yemin olsun ki onu kurtaramadılar ve sonunda öldürdüler. Huzeyfe \"Allah sizi affetsin\" dedi. Urve şöyle demiştir: Huzeyfe babasını öldüren Müslümanlara son nefesini verinceye kadar dua ve istiğfar etti durdu. Fethu'l-Bari Açıklaması: \"Kalabalık içinde ölme veya öldürülme.\" İmam Buhari burada Huzeyfe'nin babası el-Yeman'ın öldürülmesi olayını konu alan Aişe r.anha hadisine yer vermiştir. İbn Battal şöyle der: Hz. Ali ve Ömer bu durumda ölen kimsenin beytü'l-malden diyetini vermek gerekir mi yoksa gerekmez mi diye ihtilaf etmişlerdir. İshak, verilmesi gerektiğini söylemiştir. Onun bakış açısı şöyledir: Ölen kişi, . Müslüman bir topluluğun fiili neticesinde ölmüş bir Müslümandır. Dolayısıyla beytü'l-malden diyetini vermek gerekir. Biz de şunu ekleyelim: Herhalde İshak'ın delili Huzeyfe olayının rivayet yollarından birinde yer alan ifadedir. Bunu Ebü'!Abbas es-Serrac, Tarih'inde İkrime'den şöyle nakleder: Uhud günü Huzeyfe'nin babasını bir Müslüman müşriklerden zannederek öldürdü. Resulullah Sallallahu Aleyhi ve Sellem Sallallahu Aleyhi ve Sellem onun diyetini ödedi. Bu haberin ravileri -mürsel olmakla birlikte- sikadır. Söz konusu haberin yanlışlıkla öldürmede af konusunda mürsel bir şahidi geçmişti. Müsedded'in Müsned'inde Yezid b. Mezkur'dan rivayetine göre adamın biri bir Cuma günü kalabalık tarafından sıkıştırıldı ve öldü. Bunun üzerine Hz. Ali onun diyetini beytü'l-malden ödedi. Bu konuda başka görüşler de vardır. Bunlardan birisi Hasen-i Basrl'ye aittir. Buna göre ölen kişinin diyeti orada bulunan herkes tarafından ödenmelidir. Bu bir önceki görüşten daha özeldir. Bu görüşün dayanağı şu anlayıştır: O kişi orada bulunanların fiilleri neticesinde ölmüştür. Dolayısıyla yaptıkları fiilin neticesi kendilerinden öteye geçip, başkalarını etkilemez. Bu konudaki görüşlerden birisi de İmam Şafiı ve ona tabi olanlara aittir. Buna göre ölen kişinin velisine \"Dilediğin bir kimseden davacı 01. Eğer yemin edersen diyeti hak edersin, yeminden kaçınırsan davalı kimse gerçeğin böyle olmadığına dair yemin eder ve böylece dava düşer\" denir. Bu yaklaşımın düşünce tarzına gelince, alen kimsenin kan bedeli ancak talep neticesinde ödenmesi gerekli olan bir yükümlülük haline gelir. Bir başka görüş ise İmam Malik' e aittir. Ona göre bu durumda ölen kimsenin kanı heder olmuştur. Bu yaklaşımın düşünce tarzı ise şöyledir: Ölen kimsenin katilinin kim olduğu bilinmediğine göre herhangi bir kimseyi sorumlu tutmak imkansızdır. Bu görüşlerden hangisinin tercihe değer olduğuna \"Yanlışlıkla Öldürmede Af\" başlığı altında işaret edilmiştir",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 6891,
			"arabicnumber": 6891,
			"text": "Seleme şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem'la birlikte Hayber'e çıkmıştık. Onlardan birisi \"Ey Amir! Bize kısa şiirlerinden bir şeyler söyle\" dedi. O kişi de bunları şiir söyleyerek götürdü. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem \"Sevkeden kimdir?\" diye sordu. Oradakiler \"Amir' dir\" dediler. Resulullah Sallallahu Aleyhi ve Sellem 'Iillah ona rahmet eylesin\" dedi. İnsanlar \"Ya Resulallah! Keşke bizi ondan biraz daha yararlandırsaydınız!\" dediler. Amir, o gecenin sabahında yaralandı. İnsanlar \"Amir'in ameli boşa gitti. Kendi kendini öldürdü\" dediler. Onlar Amir'in ameli boşa gitti derken ben döndüm ve Resulullah Sallallahu Aleyhi ve Sellem'e dedim ki: \"Ya Resulallah! Anam babam sana feda olsun! İnsanlar Amir'in amelinin boşa gittiğini söylüyorlar.\" Resulullah Sallallahu Aleyhi ve Sellem \"Bunu söyleyenler yalan söylerler. Onun iki sevabı var. O hem cahid ve hem de mücahiddir. Hangi katil onun ecrine ecir katabilir\" dedi. Fethu'l-Bari Açıklaması: \"Kendisini yanlışlıkla öldürenin diyetinin olmadığı\" konusunda İsma1li şöyle der: Kendisini teammüden öldüren e de diyet yoktur. Netice olarak \"yanlışlık\" kelimesinin anlama kattığı herhangi bir farklılık mevcut değildir. Öyle anlaşılıyor ki İmam BuhM' öldürmeyi \"yanlışlık\" kelimesiyle bu konunun ihtilaflı olması dolayısıyla kayıtlamışhr. İbn Battal şöyle der: Evzaı, Ahmed b. Hanbel ve İshak, bu durumdaki kimsenin akilesinin diyetini ödemesi gerekir demişlerdir. Böyle bir kimse yaşadığı takdirde bu diyeti onlardan alır, öldüğü takdirde diyeti varislerinindir. Çoğunluğu oluşturan fıkıh bilginleri şöyle der: Bu konuda herhangi bir şey vermek gerekli değildir. Burada yer verdiğimiz Amir olayı çoğunluğu destekleyen bir delildir. Zira Nebi Sallallahu Aleyhi ve Sellem'in bu olayda Amir için herhangi bir şey vermesi gerektiğine hükmettiği nakledilmemiştir. Şayet bir şey vermek gerekseydi, Resulullah Sallallahu Aleyhi ve Sellem bunu açıklardı. Zira ihtiyaç anında açıklamayı ertelerrek caiz değildir. Bilginler bir kimse teammüden veya yanlışlıkla bir tarafını kestiği takdirde ona herhangi bir şey vermek gerekmediği noktasında görüş birliği etmişlerdir. İbn Battal şöyle demiştir: Bu rivayet yolunda Amir'in kendisini ne şekilde öldürdüğü belirtilmemektedir. Bu konu Edep bölümünde daha önce geçmişti. Orada şöyle demiştik: \"Amir'in kılıcı kısaydı. Bir yahudiye saldırmak üzere kılıcını eline almıştı. Kılıcın ucu döndü ve onun dizine geldi",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 6892,
			"arabicnumber": 6892,
			"text": "İmran b. Husayn'ın nakline göre adamın biri birisinin elini ısırdı. O kişi elini onun ağzından çekince ön dişleri düştü. Bu iki kişi hüküm vermesi için Nebi Sallallahu Aleyhi ve Sellem'e başvurdular. Resulullah Sallallahu Aleyhi ve Sellem \"Bazılarınız (din) kardeşini tıpkı bir erkek devenin ısırdığı gibi ısırıyor. Böyle bir kimsenin diyeti yoktur\" buyurdu",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 6893,
			"arabicnumber": 6893,
			"text": "Saffan b. Ya'la'nın babası şöyle anlatmıştır: \"Bir savaşa çıkmıştım. Adamın biri diğerini ısırdı. Bunun neticesinde ön dişleri yerinden çıktı. Nebi Sallallahu Aleyhi ve Sellem bunun için herhangi bir şeye hükmetmedi.\" Fethu'l-Bari Açıklaması: \"Bir kimseyi ısıranın Ön Dişlerinin Düşmesi.\" Yani bu durumda herhangi bir şey gerekip gerekmediği. \"Erkek devenin ısırdığı gibi.\" Yani erkek deve gibi. Diğer hayvanların erkeklerine de Arapça'da hadisteki geçtiği ifadesiyle \"......\" denilir. \"Adamın biri diğerini ısırdı. Bunun neticesinde ön dişleri yerinden çıktı.\" Çoğunluk, bu olayın zahirini esas almış ve ısmlan kimse kısas edilmeyeceği gibi, diyet de ödemez demiştir. Çünkü ısıran kişi saldırgan hükmündedir. Bu bilginler ayrıca icma hükmünü de delil almışlardır. İcmaa göre bir kimse öldürmek maksadıyla birisine silah çekse, karşı taraf da onu zararsız hale getirmek için nefs-i müdafaada bulunsa ve bu arada silah çeken kimseyi öldürse kendisini savunan kimsenin herhangi bir şey vermesi gerekmez. Aynı şekilde o kimseyi kendisinden uzaklaştırması sebebiyle çıkan dişini tazmin etmez. Bilginler şöyle derler: ısırılan kimse o kişiyi başka bir yerinden yaralasa yine bir şey vermesi gerekmez. Bir şey gerekmemesi, şartı ısmlan kimsenin acı duyması, ısıranın çenesine vurarak veya onu açarak elini kurtarmasının mümkün olmaması şartına bağlıdır. Bunun dışında elini o kişinin ağzından kurtarması mümkün olur da bunu bırakıp, daha ağır bir yola başvurursa bu takdirde o kişinin organı heder olmaz. Şafii mezhebinde bu konuda iki görüş sözkonusudur. Bir görüşe göre o kimsenin dişleri, mutlak olarak hederdir. Bir diğer görüşe göre ise ısmlan kişi, ısıranı bunun dışında başka bir yolla zararsız hale getirebiliyorsa zararı tazmin eder. İmam Malik'ten bu konuda iki görüş rivayet edilmiştir. Bunların en meşhuruna göre tazmin etmesi gerekir. Bu hadise \"Uyarının sebebi, dişi geri çekme değil, ısırmanın şiddetidir\" diye cevap vermişlerdir. Bu durumda ısıran kimsenin ön dişlerinin düşmesi, ısmıanın fiiliyle değil, kendi fiili ile olur. Zira ısmlan kimsenin fiili olsaydı, dişi sökmeden de elini ağzından kurtarması mümkün olurdu. Daha hafifi varken, daha ağır bir yolla kişiyi zararsız hale getirmek, caiz değildir diye de eklemişlerdir. Maliki mezhebinden bir alim ise şöyle demiştir: Isıran kimse bizzat ısırdığı organa yönelmiştir. Bu organın itlaf edilmesi sebebiyle gereken şeyonun yaptığından başkadır. Dolayısıyla taraflardan her biri diğer tarafın verdiği zararı tazmin etmelidir. Bu, tıpkı birisinin karşısındaki kimsenin gözünü çıkarırken onun da bunun elini kesmesine benzer. Bu görüş, \"Yapılan nassa karşı kıyas yapmaktır, bu ise fasittir\" denilerek tenkid edilmiştir. Bazı bilginler şöyle demiştir: Herhalde hadiste belirtilen kimsenin dişleri sallanıyordu ve ısırdığı şahıs elini geriçekince dişi düşmüş olsa gerektir. Bu hadisin devamı, bu ihtimali ortadan kaldırmaktadır. Bazı bilgi.nler sözkonusu olay özel bir olayolup, genelleştirilemez demişlerdir. Bu görüş şöyle bir tenkid almıştır. Buhari İcare bölümünde bu Ya'la hadisinin ardından Ebu Bekir es-Sıddık'tan şöyle bir haber rivayet etmiştir: Ebu Bekir'in zamanında Nebi Sallallahu Aleyhi ve Sellem'in huzurunda olduğu gibi bir olay meydana gelmiş ve o bu konuda misliyle kısas edilme hükmünü vermiştir. Yahya b. Ömer şöyle der: Bu hadis İmam Malik'e ulaşsaydı, ona muhalif davranmazdı. Aynı şekilde İbn Battal şöyle demiştir: Bu hadis İmam Malik' e ulaşmamıştır. Aksi takdirde buna muhalif olmazdı. Davudı şöyle der: İmam Malik bu hadisi rivayet etmemiştir. Çünkü o Iraklıların rivayetidir. Hadisten Çıkan Sonuçlar 1- Öfkelenmeden kaçınmak gerekir. Öfkelenen bir kimsenin elinden geldiği kadar öfkesini yutmas! uygun olur. Zira öfke, hadiste anlatılan olayda öfkeli kimsenin ön dişlerinin düşmesine sebep olmuştur. Kişi kendisini öfkesine kaptırma!:a ydı, böyle bir sakıncaya düşmekten kurtulurdu. 2- Hizmetini almak için hür bir kimsenin kiralanması caizdir. Ve savaşta çalışmasının karşılığının verilmesi gerekir. Ci had bölümünde açıklandığı üzere bu ücret, o kişinin kendi adına savaşmasına karşılık değildir. 3-' Bir cinayet davasında hükmünü vermesi için olayın hakime götürülmesi gerekir. 4- Bir kimse kendi nefsi için birisini kısas edemez. 5- İki cinayetten sonuncusu, birincisinin neticesi ise saldırıya uğrayan kimsenin daha önceki cinayet dolayısıyla hak ettiği şeyler düşer. 6- İnsanın fiilini, benzerinden kaçındırma sadedinde hayvanın fiiline benzetmek caizdir. 7- Saldırgan bir kimseyi zararsız hale getirmek caizdir, saldırgandan kendisini öldürerek veya bazı organlarına zarar vererek kurtulmaktan başka çe re yoksa kanı veya organı heder olur. Bilginler arasında bu konuda ihtilaf vardır. Ayrıntısı bilinmektedir. 8- Başına hoşlanmadığı veya anlattığı takdirde kendisine nispet edilmesinden utandığı bir iş gelen kimse \"Adamın biri veya bir kimse şöyle şöyle yaptı\" diyerek, kendisini kinaye yoluyla gizleyebilir. Nitekim bu olayda Ya'lş'nın başına buna benzer bir iş gelmişti. Aişe r.anha de böyle bir kinaye yolunu benimseyerek \"Resulullah Sallallahu Aleyhi ve Sellem eşlerinden bırini öptü\" deyince, Urve ona \"Bu senden başka biri değildi değil mi?\" diye sormuş ve o da gülümsemiştir",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 6894,
			"arabicnumber": 6894,
			"text": "Enes'in nakline göre \"en-Nadr'ın kızı bir cariyenin yüzüne tokat attı ve ön dişini kırdı. İnsanlar Nebi Sallallahu Aleyhi ve Sellem'e geldiler. Resulullah Sallallahu Aleyhi ve Sellem kısas uygulanmasını emretti.\" Fethu'l-Bari Açıklaması: \"Dişlerde Kısas.\" İbn Battal şöyle demiştir: Bilginler kasıtlı yapıldığı takdirde dişe karşı dişin kısasen çıkarılacağı noktasındaicma etmişlerdir. Buna karşılık vücudun diğer kemikler konusunda kısas uygulanıp, uygulanamayacağı noktasında ihtilaf etmişlerdir. İmam Malik \"Vücudun diğer kemiklerinde de kısas uygulanır. Ancak içi boş kemikler veya me'mume, munakkıle ve ha.şime gibi yaralar bundan müstesnadır. Bu tip yaralarda diyet gerekir\" demiş ve delil olarak ilgili ayeti göstermiştir. Ayetinbuna delilolması şu açıdandır: Bizden öncekilerin şeriatı, -bizim Nebiimiz tarafından inka.r edilmeksizin nakledildiği takdirde- bizim için de uyulması gereken bir şeriattır. Allahu Teala'ın \"dişe diş\" şeklindeki ifadesi kemiklerde kısas uygulanacağını göstermektedir. Çünkü diş bir kemiktir. Ancak bilginlerin kişinin ölmesi endişesiyle veya kısas edilecek organda mislilik imkanı bulunmaması nedeniyle hakkında kısasa başvurulamayacağına icma ettikleri bundan müstesnadır. İmam Şafii, Leys ve Hanefiler şöyle demişlerdir: Diş dışında kemiklerde kısas uygulanamaz. Çünkü kemiğin üzerinde deri, et, sinir gibi engeller bulunmaktadır. Bu engeııerin varlığı ile misliliği sağlamak imkansızdır. Eğer mislilik imkanı olsaydı, kısas uygulanacağına hükmederdik Fakat kısas uygulayacak infaz memeru (ceııat) kemiğe ulaşamaz, onun dışında miktarı bilinmeyen bir derinlikte kalabilir. \"Resulullah Sallallahu Aleyhi ve Sellem kısas uygulanmasını emretti.\" İmam Buhari Sulh bölümünde \"Erkeklerle Kadınlar Arasında Kısas\" başlığı altında az önce aktardıklarımıza \"Enes b. en-Nadr dedi ki ... \" cümlesini ilave etmiş ve ifadeyi \"Cariyenin akrabaları razı oldular ve affettiler\" şeklinde bitirmiştir. Fezarı'nin rivayetinde \"Cariyenin akrabaları razı oldular ve erş vermeyi kabul ettiler\" cümlesi yer almıştır.(Buhari, Sulh) Mu'temir şöyle farklı bir rivayette bulunmuştur: Nebi Sallallahu Aleyhi ve Sellem bu duruma hayret etti ve \"Allah'ın öyle kulları vardır ki yemin etseler Allah onları yeminlerinde yalancı çıkarmaz\" yani yeminine sadık kılar buyurdu. Nebi s.a.v. \"Allahu Teala 'ın öyle kulları vardır ki\" ifadesiyle bir tevafuk eseri olan bu olayın Yüce Allah'tan yemininde sadık olması için Enes'e verilmiş bir ikram olduğuna ve onun duasını kabul edip, ihtiyaçlarını verdiği kuııarından birisi bulunduğuna işaret etmektedir. Enes b. en-Nadr'ın Nebi Sallallahu Aleyhi ve Sellem kısası emrettiğini duyduğu halde er-Rubeyyi'in dişinin kırılmasına karşı çıkması, sonra da \"erRUbeyyi'in dişi kırılır mı?\" demesi, ardından onun dişinin kırılamayacağını yeminle belirtmesi, bilginler arasında problemli görülmüştür. Buna Enes b. Nadr bu ifadesiyle karşı tarafın en-Nadr'ın kızını bağışlamaları için Nebi Sallallahu Aleyhi ve Sellem nezdinde aracılık talebini vurgulamak isteğine işaret etmiştir diye cevap vermiştir. Bazıları ise Enes'in ettiği bu yemin kısasın kesin olduğunu öğrenmesinden önce idi. O kısas, diyet veya bağışlama arasında muhayyer olduğunu zannediyordu demişlerdir. Başka bazı bilginler ise Enes bu ifadesiyle mutlak olarak kısası inkar etmek, reddetmek istememiş, tam tersine bunu Yüce Allah'ın lutfundan karşı taraftaki insanlara en-Nadr'ın kızını bağışlamaları veya erşi kabul etmeleri için hoşnutluk ilham etmesi beklentisi ve umudu ile söylemiştir demişlerdir. Dbi bu görüşü kesin bir dille şu şekilde ifade etmiştir: Enes bu cümleyi Nebi Sallallahu Aleyhi ve Sellem'in hükmünü reddetmek için söylememiştir. Tam tersine o kısasın gerçekleşmeyeceğini ifade etmiştir. Çünkü onun kendisini ilgilendiren işlerde Allah'ın lutufkar davranacağı umudu ve ettiği yemininde kendisini hayal kırıklığına uğratmayacağı ve karşı tarafın gönlüne af ilham ederek istediği konudaki beklentisini boşa çıkarmayacağı zannı vardı. Gerçekten de gelişme onun istediği gibi oldu. 1. Bir kimsenin vuku bulacağını zannettiği hususta yemin etmesi caizdir. Böyle bir durumla karşılaşan kimseyi -fitneye düşmesi endişesi bulunmadığı takdirde- övmek mümkündür. 2.Kısastan af müstehaptır. 3.Af konusunda şefaat etmek müstehaptır. 4. Kısasta veya diyette muhayyerlik, karşı taraf aleyhine hak sahibinin hakkıdır. 5. Yaralama ve dişlere zarar verme durumunda kadınlar arasında kısas uygulanabilir 6.Diyet üzerine sulh yapılabilir, 7. Diş kırmada kısas uygulanabilir. Sözkonusu kısas, iki diş arasında misliliğin mümkün olduğu durumlarda uygulanabilir. Bu da kırılan dişin ölçülebilir olmasını gerektirir. Bu durumda suçlu olan kişinin dişi, mağdurun dişi kadar olmak şartıyla -mesela törpüyle törpülenerek- küçü1tüıür. Ebu Davud es-Sünen'inde şöyle demiştir: Ahmed b. Hanbel'e \"Dişte kısas nasıl uygulanır?\" diye sordum. Bana \"Törpülenerek\" diye cevap verdi",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 6895,
			"arabicnumber": 6895,
			"text": "İbn Abbas'ın nakline göre Nebi Sallallahu Aleyhi ve Sellem serçe parmakla, başparmağı kastederek \"İşte şu ve şu birbirine eşittir\" buyurmuştur. Fethu'l-Bari Açıklaması: \"Parmakların diyeti\" başlığı, parmakların diyeti birbirine eşit midir yoksa farklı mıdır anlamınadır. \"Nebi s.a.v. serçe parmakla, başparmağı kastederek 'İşte şu ve şu birbirine eşittir' buyurmuştur.\" İbn Ebi Asım'ın nakline göre Mervan, Said b. el-Müseyyeb 'i, İbn Abbas'a göndererek parmakların diyetin i sordurmuştur. İbn Abbas \"Nebi Sallallahu Aleyhi ve Sellem bir elin diyetinin elli ve her bir parmağınkinin ise on olduğu hükmünü verdi\" demiştir. İmam Malik'in eserinde Amr b. Hazm'ın mektubunda da \"Parmakların her birinin diyetinin on olduğu\" ifade edilmiştir. İbn Mace'de Amr b. Şuayb'ın babası vasıtasıyla dedesinden nakline göre Nebi Sallallahu Aleyhi ve Sellem \"Parmakların tümü (diyet açısından) birbirine eşittir. Her bir parmak İçİn on deve verilir\" buyurmuştur.(İbn Mace, Diyat) Ebu Davud bunu iki hadis şeklinde nakletmiştir, senedi ceyyiddir. Tirmizi şöyle demiştir: İlim adamları nezdinde uygulama bu doğrultuda olmuştur. Sevri, Şafii, Ahmed b. Hanbel ve İshak bu görüşü benimsemişlerdir. Biz de belli başlı beldelerdeki fıkıh bilginlerinin (fukahau'l-emsar) tümünün bu kanaatte olduklarını belirtelim",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 6896,
			"arabicnumber": 6896,
			"text": "İbn Ömer'in nakline göre bir oğlan çocuğu gizlice öldürüldü. Bunun üzerine Hz. Ömer \"Bu öldürme fiiline San'a. halkı katılmış olsaydı, mutlaka onların hepsini (teker teker) öldürürdüm\" demiştir",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 6897,
			"arabicnumber": 6897,
			"text": "Ubeydullah b. Abdullah'ın nakline göre Aişe r.anha şöyle anlatmıştır: Hastalığı esnasında Nebi Sallallahu Aleyhi ve Sellem'in ağzına ilaç koyduk. Bize ':4ğzıma ilaç koymayın\" diye işaret etmeye başladı. Biz \"Hasta ila cı sevmez, onun için böyle söyledi\" dedik. Nebi Sallallahu Aleyhi ve Sellem kendine gelince, \"İlaç vermenizi yasaklamadım mı?\" diye çıkışınca biz yine \"hasta ilacı sevmez\" dedik. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem şöyle dedi: ':4ranızdan -gözlerimin önünde- ağzına ilaç damlatılmayacak hiç kimse kalmayacaktır. Bundan sadece Abbas müstesnadır. Çünkü o sizinle birlikte bulunmadı.\" Fethu'l-Bari Açıklaması: \"Bir topluluk bir kimseyi yaraladığında onların her biri cezalandırılır mı?\" Yani bir topluluk, bir kişiyi öldürdüğü veya yaraladığı takdirde bunların tümüne kısas uygulamak gerekli olur mu, yoksa aralarından kısas edilmek üzere bir kişi belirlenerek kalanlarından diyet mi alınır? Başlıkta geçen \"muakabe\"den maksat denkliktir. Müellif bu ifade ile sanki İbn Sırın'in şu hükmüne işaret eder gibidir: İki kişi bir şahsı öldürse bunlardan biri öldürülür, diğerinden diyet alınır. Daha çok oldukları takdirde kalan diyet onlara böıüştürüıür. Tıpkı on kişinin bir kişiyi öldürmesi gibi. Bu durumda aralarından bir kişi öldürülür. Geriye kalan dokuz kişiden her biri bir diyetin dokuzda birini öder. Şa'bl'nin şöyle dediği nakledilmiştir: Maktulün velisi katil iki kişi ise dilediği birini kısasen öldürür. Daha çok oldukları takdirde dilediği birini kısasen öldürürken, geri kalanlarını bağışlar. Selef bilginlerden birisi şöyle demiştir: Bu durumda kısas cezası düşer, diyet vermek tek seçenek haline gelir. Bu hüküm Rebl'a ve Zahirilerden nakledilmiştir. İbn Battal ise şöyle demiştir: Muaviye, İbnü'z-ZUbeyr ve Zührl'den, İbn Sırın'in görüşü gibi bir görüş nakledilmiştir. Çoğunluğu oluşturan fıkıh bilginlerinin delili ise canın böıünemeyeceğidir. Netice olarak bu kişi öldürmeye iştirak edenlerden bazılarının fiili ile ölmemiştir. Dolayısıyla bunların her biri katilolur. \"Çocuğun biri gizlice öldürüldü.\" Hadiste geçen \"ğıleten\" gizlice demektir. \"Ebu Bekir, İbnü'z-ZUbeyr, Ali, Süveyd b. Mukarrin tokattan dolayı kısas yapmışlardır. Hz. Ömer vurma nedeniyle kırbaçla kısas uygulamıştır. Hz. Ali üç kamçı vurmaktan dolayı kısas yapmıştır. Kadı Şureyh de bir değnek vurmaktan ve küçük yaralardan dolayı kısas uygulanmıştır.\" Hadisin ifadesinde geçen \".......\", tırmalama demektir. Tırmalamanın yaralamalar arasında bilinen bir erşi yoktur. İbnü'l-Kayyim şöyle demiştir: Müteahhirun (son dönem) bilginlerinden biri daha ileri giderek tokat atma ve vurmada kısas uygulanmayacağı noktasında icma naklederek sadece ta'zir cezası uygulanacağını belirtmiştir. Ancak bunda yanılmıştır. Zira bu konuda kısas uygulanacağı görüşü, Hulefa-yı Raşidın'den nakledilmiştir. Bu görüş üzerinde icma olmaya daha uygundur. Kitap ve sünnetin mutlak ifadesinin gereği de budur",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 6898,
			"arabicnumber": 6898,
			"text": "Buşeyr b. Yesar'ın nakline göre Ensardan Sehl b. Ebu Hasme şöyle anlatmıştır: Sehl'in kavminden bir topluluk Hayber'e giderler. Hayber hurmaIıkları içinde kendi işlerine dağılırlar. Sonra kendilerinden birini öldürülmüş olarak bulurlar. Bu topluluk maktulün aralarında bulunduğu Hayberlilere \"Bizim arkadaşımızı öldürdünüz!\" derler. Hayberliler de \"Onu biz öldürmedik, katilini de bilmiyoruz!\" derler. Sonra bu sahabiler topluluğu Nebi Sallallahu Aleyhi ve Sellem'e gidip \"Ya Resulallah! Bizler Hayber'e gittik ve orada arkadaşlarımızdan biri öldürüldü. Onu ölü bulduk\" dediler. Nebi Sallallahu Aleyhi ve Sellem \"Büyük konuşsun! Büyük konuşsun!\" buyurdu. Sonra onlara \"Onu öldüren kişi aleyhine beyyine getirebilir misiniz?\" diye sordu. Onlar \"Bizim beyyinemiz yoktur\" dediler. Resulullah Sallallahu Aleyhi ve Sellem \"O takdirde Yahudiler onu kendileri öldürmediklerine dair yemin ederler\" dedi. Sahabiler \"(Ya Resulallah!) Yahudilerin yeminlerine razı değiliz!\" dediler. Resulullah Sallallahu Aleyhi ve Sellem öldürülen kişinin kanını heder kılmayı istemedi ve zekat develerinden yüz tanesini onun diyeti olmak üzere verdi",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 6899,
			"arabicnumber": 6899,
			"text": "Ebu Kılabe şöyle anlatmıştır: Ömer b. Abdulaziz bir gün üzerine oturduğu tahtı ahali için evinin dışına çıkardı. Sonra halka izin verdi ve onun huzuruna girdiler. Halife onlara \"Bu Kasame hakkında ne diyorsunuz?\" dedi. Onlar \"Kasamede kısas bir haktır, Kasamede halifeler kısas yapmışlardır diyoruz\" dediler. Ebu Kılabe şöyle devam etti: Ömer b. Abdulaziz bana \"Sen Kasame hakkında ne diyorsun ey Ebu Kılabe!\" diye sordu ve beni (tartıştırmak üzere) orada hazır bulunanların önüne dikti. Ben de cevabımda şöyle dedim: \"Ey mu'minlerin emiri! Ordu kumandanıarı ve Arabın eşrafı huzurundadır. Bana söyler misin? Bunlardan elli kişi Şam'da bulunan evli bir erkek (muhsan) aleyhine kendisini görmedikleri halde zina ettiğine şahitlik etmiş olsalardı sen o kişiyi bunların şehadeti ile recm eder miydin?\" O da \"hayır\" diye cevap verdi. \"Bana söyler misin! Bunların arasından elli kişi gözleriyle görmedikleri halde birisi aleyhine hırsızlık yapmıştır diye şahitlik etseydi o kişinin elini keser miydin?\" dedim. Halife bu soruma da \"hayır\" diye cevap verdi. Ben ''Allah'a yemin ederim ki Resulullah Sallallahu Aleyhi ve Sellem şu üç fiilden başka hiçbir kimseyi asla ölümle cezalandırmad!. Kendi işlediği cinayet ile haksız olarak birini öldüren ve bu sebeple kısasen öldürülen, evli olduğu halde (muhsan olduktan sonra) zina eden İslam dininden çıkarak AlIah'a ve Resulüne karşı savaş açan\" dedim. Orada bulunanlar şöyle dediler: \"Enes b. Malik sana Nebi Sallallahu Aleyhi ve Sellem'in hırsızlık suçunda el kestiğini, gözleri oyduğunu ve onları güneşe attığını rivayet etmdi mi?\" Ben de onlara şöyle dedim: \"Sizlere Enes b. Malik'in hadisini ben nakledeyim: Enes şöyle anlattı: Ukl kabilesinden sekiz kişi Resulullah Sallallahu Aleyhi ve Sellem'e geldiler ve Müslüman olduklarına dair bey'atlaştılar. Bunun ardından Medine yöresinin havasını ağır buldular ve vücutları hastalandı. Bu hastalıklarını Nebi Sallallahu Aleyhi ve Sellem' e arzettiler. Resulullah Sallallahu Aleyhi ve Sellem \"Bizim çobanımızla beraber develerin yanına çıksanız, onlann sütlerinden ve idrarlanndan içseniz\" buyurdu. Onlar peki deyip, develerin yanına çıktılar. Develerin sütlerinden ve idrarlarından içtiler ve sıhhat buldular. Bunun ardından Nebi Sallallahu Aleyhi ve Sellem'in çobanını öldürdüler, develeri de sürüp gittiler. Sonunda bu haber Resulullah Sallallahu Aleyhi ve Sellem'e ulaştı. Nebi Sallallahu Aleyhi ve Sellem derhal ardlarından bir askeri birlik gönderdi ve kısa zamanda yakalanıp geri getirildiler. Nebi Sallallahu Aleyhi ve Sellem'in emri üzerine elleri ve ayakları kesildi, gözleri de oyuldu. Sonrçı Nebi Sallallahu Aleyhi ve Sellem onları güneşin altına attırdı ve ölünceye kadar öylece kaldılar. Ben \"Bunların işlemiş oldukları suçtan daha şiddetli hangi suç vardır. Bunlar İslam dininden geri dönmüşler, adam öldürmüşler, hırsızlık yapmışlardır\" dedim. Anbese b. Said \"ValIahi ben bugün senden işittiğimin benzerini daha önce asla işitmiş değilim!\" dedi. Ben de Anbese'ye \"Ey Anbese! Sen benim bu hadisimi (kabul etmeyip) bana geri mi iade ediyorsun?\" dedim. Anbese \"Hayır, fakat sen hadisi tastamam olduğu gibi rivayet ettin. ValIahi bu şeyh (yani Ebu Kılabe) aralarında yaşadığı müddetçe bu ordu (yani Şam ahalisi) hayırdan asla ayrılmaz\" dedi. Ben konuşmama şöyle devam ettim: \"Bu (benzeri işlerde uygulanmak üzere) Resulullah Sallallahu Aleyhi ve Sellem tarafından konulmuş bir kesin hüküm olmuştur. Resulullah Sallallahu Aleyhi ve Sellem'in huzuruna Ensardan bır topluluk girdi, onun yanında konuştular. (Sonra onlardan biri Hayber'e doğru yola çıktı.) Aralarından biri önlerinden gitti ve orada öldürüldü. Ötekiler de onun ardından Hayber'e vardıklarında arkadaşlarını kanlar içinde kıvranıyor gördüler. Hemen Resulullah Sallallahu Aleyhi ve Sellem'in yanına dönüp: \"Ya Resulallah! Arkadaşımız bizimle beraber senin yanında konuşuyordu. Bizim önümüzde yola çıktı, biz onu kanlar içinde kıvranır vaziyette bulduk!\" dediler. Resulullah Sallallahu Aleyhi ve Sellem çıkıp onların yanına geldi ve \"Onu kimin öldürdüğünü düşünüyor veya zannediyorsunuz?\" diye sordu. Onlar da \"Biz onu Yahudilerin öldürdüğünü düşünüyoruz\" dediler. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem Yahudilere haberci salıp, onları çağırttı ve \"Bunu öldüren sizler misiniz?\" diye sordu. Onlar \"hayır\" dediler. Resulullah Sallallahu Aleyhi ve Sellem davacılara \"Siz Yahudilerden elli kişinin onu öldürmediklerine dair yemin etmesine razı olur musunuz?\" dedi. Onlar \"Yahudiler bizi toptan öldürüp, sonra öldürmediklerine yemin etmekten çekinmezler!\" dediler. Resulullah Sallallahu Aleyhi ve Sellem yine davacılara hitaben \"Sizler aranızdan elli kişinin (onu bunlar öldürdü diye) yeminiyle diyeti hak etmek ister misiniz?\" buyurdu. O sahabiler \"Bizler bu yemini yapamayız\" dediler. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem O kimsenin diyetin i beytulmalden verdi. Ebu Kılabe şöyle devam etti: Ben şöyle dedim: Hüzeyl kabilesi, cahiliye devrinde müttefiklerinden biriyle bağlarını koparmış ve \"Sen bizden değilsin, biz de senden değiliz\" demişlerdi. O ilişkisi kesilen kişi, Batha denilen Mekke vadisinde Yemen'den bir ev halkına geceleyin hücum etti. Ancak ev halkından biri bunu fark etti ve bir kılıç darbesiyle adamı öldürdü. Bunun ardınan Hüzeyl kabilesi geldi ve o Yemen'li adamı yakalayıp hac mevsiminde Hz. Omer'in huzuruna çıkardı; \"Bu adam bizim adamımızı öldürdü\" dediler. Katil de \"Onlar bu kişiden ilişkilerini kesmişlerdi\" dedi. Hz. Ömer \"Hüzeyl kabilesinden elli kişi onunla ilişkilerini kesmediklerine yemin ederler\" dedi. Bunun üzerine onlardan 49 kişi o kimseden ayrılmadıklarına yalan yere yemin etti. Bu sırada Hüzeyl kabilsine mensup olan bir adam Şam'dan çıkageldi. Hemen ondan da kendileri gibi o kişiyle -ilişkilerini kesmediklerine dair yemin etmesini istediler. O Şam'dan gelen adam bin dirhem fidye verip, yalan yere yemin etmekten kurtuldu. Bu sef?r onun yerine başka bir adam soktular. Böylece Hz. Ömer o adamı maktulün Rçlrdeşine teslim etti. Onun eli, ötekinin eliyle bir yere getirilip bağlandı. Bunlar şöyle dediler: \"Biz elli kişi yani ondan ayrılmadığımıza yemin eden bizler yürüdük. Nihayet Mekke'den bir gecelik uzaklıkta olan Nahle mevkiine vardıklarında kendilerini bir yağmur yakaladı. Hemen bir mağaraya girdiler. Ardından o mağara yemin etmiş olan o elli kişinin üzerine çöktü, hepsi öldü. O elleri birbirine bağlanan iki kişi kaçıp kurtuldu. Onları da bir taş takip etti ve maktulün kardeşinin ayağına çarpıp C5nu kırdı. O kişi bir yıl daha yaşadı, sonra öldü. Ebu Kılabe şöyle devam etti: Ben şöyle dedim: Abdulmelik b. Mervan bir adamı kasa me yeminiyle kısas yaptı. Fakat sonra yaptığına pişman oldu ve emri üzerine yemin eden o elli kişinin isimleri divan defterinden silindi ve Şam'dan başka bir yere sürgün edildiler. Fethu'l-Bari Açıklaması: ....... Kasame\" Bu kelime \"kakseme\" fiilinin mastarı olup, ........ kasemen\" şeklinde bir mastarı daha vardır. \"Kasame\" yemin etmek anlamına gelir. Maktulün yakınları onun kanını iddia ettiklerinde veya davalılar aleypÜe kan iddiasında bulunulduğunda bu yemin verilir. Kan için yapılan yemin özelolarak \"kasame\" kelimesiyle ifade edilir. İmamü'l-Haremeyn şöyle demiştir: Dil bilginlerine göre kasame yemin eden topluluğun ismidir. Fıkıh bilginlerine göre ise kasame yemin demektir. el-Muhkem'de şöyle denir: Kasame bir topluluk olup, herhangi bir şey üzerine yemin ederler veya şehadette bulunurlar. Kasame, yemini onlara nispet edilir. Sonra yeminin bizatihi kendisine kasame denilmiştir. \"İbn Ebu Müleyke, Muaviye kasame yemini ile kısas yapmadı demiştir.\" Buradaki \"lem yukid\",\"ekade\"den türemedir. Bunun anlamı kısas etti demektir. \"Basra'ya emir tayin ettiği. ... ;' Ömer b. Abdulaziz, Adiyy'i Basra emirliğine 99 yılında getirmişti. Halife, onun 102 yılında öldürüldüğünden söz eder. \"Yağ tüccarlarının evlerinden ... \" Burada geçen \"........\" yağ ticaretiyle meşgul olanlar demektir. Ömer b. Abdulaziz'in Kasame yeminiyle kısas uygulayıp, uygulamadığı tıpkı Muaviye hakkında olduğu gibi ihtilaflıdır. İbn Battal, Hammad b. Seleme'nin Musannef'inde, İbn Ebu Müleyke'nin, Ömer b. Abdulaziz'in halifeliği döneminde Medine'de Kasame yemini ile kısas uyguladığını belirttiğinden söz eder. Bizim kanaatimiz ise şu yöndedir: Onun Medine' de emir iken bu kanaatte olduğu noktasında bilginlerin ittifakı vardır. Ancak halifeliğe geldiğinde bu görüşündeh dönmüştür. Herhalde bunun sebebi bu bölümün sonunda yer alan Ebu Kılabe olayı olsa gerektir. Zira bu olay Kasame yemini ile kısas uygulanmayacağına . delildir. Sanki o bu görüşe katılmış gibidir. İbnü'l-Münzir'in nakline göre Zührı şöyle demiştir: Ömer b. Abdulaziz bana şöyle dedi: Kasame uygulamasını bırakmak istiyorum. Filan veya falan yerden bir kişi bana geliyor ve görmedikleri bir şeyin üzerine yemin ediyorlar. Ben de ona \"Kasame'yi bırakacak olursan bir kişi çıkar, senin kapının önünde birisini öldürür ve kanı boşu boşuna heder olup gider. Kasame uygulamasında insanlar için hayat vardır\" dedim. Kasame'yi kabul etmeme noktasında Salim b. Abdullah b. Ömer, Ömer b. Abdulaziz'den daha öncedir. İbnü'l-Münzir'in nakline göre Salim b. Abdullah şöyle diyordu: \"Ey kavmim! Görmedikleri ve hazır bulunc madıkları bir şeye yemin eden şu insanların imdadına koşunuz. Benim elimde yetki olsaydı, onları cezalandırır ve aleme ibret kılardım ve şahitliklerini kabul etmezdim. Bu ifade Medinelilerin kasa me yemini ile kısas yapılabileceğine dair icma ettikleri yolundaki nakli zedelemektedir. Çünkü Salim, Medine fıkıh bilginlerinin en büyüklerinden biridir. İbnü'l-Münzir'in nakline göre İbn Abbas kasame yemini ile kısas uygulanamayacağını söylemiştir. İbn Ebi Şeybe'nin nakline göre İbrahim en-Nehaı şöyle demiştir: Kasame yemini ile kısas zulümdür. el-Hakem b. Uteybe'nin nakline göre İbrahim en-Nehaı Kasame'ye itibar etmezdi. Kasame konusundaki ihtilafın özü, kasa me ile amel edilir mi edilmez mi noktasındadır. Amel edildiği takdirde kasame yemini kısas veya diyeti gerektirir mi? Bu yeminde önce davacılardan mı yoksa davalılardan mı başlafVr? Ayrıca kasame yemininin şartı konusunda da ihtilaf sözkonusudur. ;: \"Kendilerinden birini. .. \" Yahya b. Said el-Ensarı, Beşir b. Yesar'dan yaptığı rivayette onlardan ikisinin adını vermiştir. Cizye Bölümünde Bişr b. elMufaddal'ın Yahya'dan yukarıdaki isnadla şöyle bir cümlesi geçmişti: \"Abdullah b. Sehl ve Muhayyısa b. Mesud b. Zeyd Hayber'e gittiler.\" Müslim'de el-Leys'in Yahya ve Buşeyr vasıtasıyla nakline göre Se hı şöyle demiştir: Yahya dedi ki: Zannediyorum Buşeyr, Rafi b. Hadk de dedi. Se hı ve Rafi'in nakline göre Abdullah b. Sehl b. Zeyd ve Muhayyısa b. Mesud b. Zeyd Hayber'e çıkarlar. (Müs!im, Kasame) \"Hayber' e çıkarlar ve Hayber hurmalıkları içinde kendi işlerine dağılırlar.\" Muhammed b. İshak'ın Buşeyr b. Yesar'dan nakline göre İbn Ebi Asım şöyle demiştir: \"Abdullah b. Sehl arkadaşlarıyla birlikte hurma toplamaya çıktı.\" Süleyman b. Bilat'in Müslim'de yer alan naklinde ise şöyle bir fazlalık vardır: \"Abdullah b. Sehl ile Muhayyisa b. Mesud, Nebi Sallallahu Aleyhi ve Sellem'in zamanında Hayber'e çıktılar. Hayber o günlerde sulh içinde olup, halkı Yahudi idi.\"(Müslim, Kasame) \"Sonra kendilerinden birini öldürülmüş olarak bulurlar.\" Bişr b. el-Mufaddal'ın rivayetinde olay şöyle anlatılmaktadır: \"Muhayyısa Abdullah b. Sehl'e geldiğinde ölmek üzere kana bulanmış kıvranıyordu.\" Yani kan içinde kıvranıyor, debelenip duruyordu. Sonra Muhayyısa onu toprağa verdi. \"Resulullah Sallallahu Aleyhi ve Sellem 'O takdirde Yahudiler onu kendileri öldürmediklerine dair yemin ederler' dedi. Sahabiler '(Ya Resulallah!) Biz, Yahudilerin yeminlerine razı olmayız!' dediler.\" Ebu Leyla'nın rivayetine göre sahabiler \"Onlar Müslüman değildir\" dediler. Yahya b. Said'in rivayetine göre ise \"Katir olan bir topluluğun ettiği yemini nasıl kabul edelim?\" dediler. Ebu Kılabe'nin rivayetine göre ise \"Onlar hepimizi öldürüp, sonra yemin etmekten çekinmezler\" dediler. Resulullah Sallallahu Aleyhi ve Sellem onun kanının heder olmasını istemedi. \"Zekat develerinden.\" Kurtubi el-Müfhim isimli eserinde şöyle der: ResuluIlah Sallallahu Aleyhi ve Sellem keremi, güzel siyaseti, maslahatı celb etmek ve mefsedeti savuşturmak için tarafları uzlaştırmak amacıyla böyle davrandı. Özellikle hakkı almaya bir çare bulmak imkansız olduğu için bu şekilde hareket etti. Bu hadis, kasame uygulamasının dinde yeri olduğunu göstermektedir. Kadı lyaz şöyle demiştir: Bu hadis, dinin temellerinden biri, ahkama dair bir kaide ve kulların masıahatını sağlayan unsurlardan biridir. Bütün imamlar, sahabe ve tabiundan selef bilginleri, ümmetin alimleri, Hicaz, Şam ve Kufeli önde gelen fıkıh bilginleri bu hükmü nasıl uygulamak gerektiği noktasında ihtilaf etmekle birlikte söz konusu uygulamayı benimsemişlerdir. Bir grup bilginin sözkonusu /) hükmü almayıp, durakladıkları rivayet edilmiştir. Onlar Kasameyi meşru bir uygulama olarak görmemişler ve bunun herhangi bir hükmü n ispat vasıtası olduğunu kabul etmemişlerdir. Hakem b. el-Uteybe, Ebu Kılabe, Salim b. Abdullah, Süleyman b. Yesar, Katade, Müslim b. Halid, İbrahim b. Uleyye'nin görüşleri bu doğrultudadır. Buhari de bu görüşe meyletmektedir. Ömer b. Abdulaziz'den -ihtilaflı olmakla birlikte- böyle bir görüş nakledilmiştir. Burada şu hususu belirtmekte fayda vardır. Bu ifade, Kadı lyaz'ın baş tarafta bütün imamların bu görüşü aldıkları yolundaki ifadesiyle çelişmektedir. Bu bölümü n baş tarafında kasame yemininin meşru olmadığını söyleyen kimselerden nakil yapılmıştı. Bunların içerisinde Kadı lyaz'ın adını vermediği kimseler bulunmaktadır. Kadı İyad şöyle demiştir: Yanlışlıkla öldürme konusunda kasame yemininin meşru olup olmadığı noktasında İmam Malik'ten farklı görüş nakledilmiştir. Teammüden öldürmede kasa me yeminine başvurulacağı görüşünde olan bilginler, bunun neticesinde kısas veya diyet gerekip gerekmeyeceği noktasında ihtilaf etmişlerdir. Hicaz fıkıh bilginlerinin büyük bir kısmı, kasame yemini şartlarına uyularak yapıldığı takdirde buna dayanarak kısas gerekeceği görüşünü beilimsemişlerdir. Zühri, Rebi'a, Ebü'z-Zinad, Malik, Leys, Evzai, iki görüşünden birisine göre İmam Şafii, Ahmed b. Hanbel, İshak, Ebu Sevr ve Davud'un görüşleri bu doğrultudadır. İbnü'z-ZUbeyr gibi sahabenin bazılarından bu doğrultuda bir rivayet yapılmıştır. Ömer b. Abdulaziz'in görüşü hakkındaki rivayetler birbirinden farklıdır. Ebü'z-Zinad şöyle demiştir: Sahabelerin büyük bir kısmı henüz hayatta iken kasa me yeminine dayanarak öldürme cezası uyguladık. Ben bunların bin kişi olduklarını düşünüyorum. Bunların içinden iki kişi birbiriyle ihtilaf etmiş değildir. Burada şu hususu vurgulamakta fayda görmekteyiz: Ebü'z-Zinad bunu Harice b. Zeyd b. Sabit'ten nakletmiştir. Nitekim Said b. Mansur, Beyhaki, Abdurrahman b. Ebü'z-Zinad vasıtasıyla babası Ebü'z-Zinad'dan böyle bir görüşü nakletmiştir. Aksi takdirde Ebü'zZinad'ın bin sahabe şöyle dursun, yirmi sahabe gördüğü bile sabit değildir. Kadi İyad şöyle der: Kasame yemini ile diyete hükmedileceği görüşünde olan bilginler, önce davalı tarafın yemin etmesi gerektiğini söylemişlerdir. Bu görüşe İmam Şafii ve Ahmed b. Hanbel muhalif kalmıştır. Onlar, -çoğunluğu oluşturan fıkıh bilginlerinin paralelinde görüş belirterek- hakim önce davacı tarafa yemin verir. Onlar yeminden kaçındıkları takdirde davalıların yemin etmesini ister demişlerdir. KOfe bilginleriyle Basra bilginlerinin büyük bir çoğunluğu ve Medine alimlerinin bazıları ve Evzai, bu görüşün aksini savunmuş ve şöyle demişlerdir: Bir köy halkından elli kişiye \"Bu şahsı biz öldürmedik, öldüreni de bilmiyoruz\" şeklinde yemin verilir. Bunlar yemin ettikleri takdirde Beraat ederler. Sayıları elliden az olduğunda veya yemin etmekten kaçındıklarında davacı taraf bir kişinin aleyhine yemin eder ve böylece talep ettikleri Şe9Wk ederler. Sayıları elliden az olduğu takdirde o şahıs diyet öder. Basra fıkıh bilginlerinden Osman el\"Betti şöyle demiştir: Sonra dava lı taraf yemine başlar. Onlar yemin ettikleri takdirde herhangi bir şeyle yükümlü olmazlar. KOfe bilginleri, yemin ettikleri takdirde diyet vermeleri gerekli olur demişlerdir. Bu görüş Hz. Ömer'den de naklediimiştir. Kadı lyaz şöyle der: Bütün bilginler maktulün yakınlarının sırf davacı olmalarıyla diyetin gerekmeyeceği noktasında ittifak etmişlerdir. Bunun için iddianın yanında bir şüphe olmalıdır ve bu şüpheye göre hüküm verildiği zannı ağır basmalıdır. Bilginler sözkonusu şüpheyi açıklarken yedi farklı görüşe ayrılmışlardır. Kadı lyaz bunları tek tek zikreder. Özeti şudur: 1- Ölmek üzere olan kişi üzerinde herhangi bir iz veya yara bere bulunmasa bile hayatıma filanca kastetti ya da buna benzer bir şey söylemelidir. Bu İmam Malik ve Leys'e göre Kasame yeminini gerektirir. Ancak bu görüşü onlardan başka kimse söylememiştir. Bazı Maliki alimleri bu durumdaki kimsenin üzerinde iz veya yara bere bulunmasını şart koşmuşlardır. 2- Bir kişi veya adil olmayan bir topluluk gibi şahit1iği ile nisab tamam olmayan kimseler şahitlik etmelidir. İmam Malik ve Leys bu görüşü savunmuşlar, Şafii ve ona tabi olan bilginler de buna katılmışlardır. 3- İki adil şahit ölen kişinin darb edildiğine şahitlik etmeli ve bunun ardından o kişinin günlerce yaşayıp, sonra iyileşme olmaksızın o darbtan ölmelidir. İmam Malik ve Leys şöyle derler: Bu durumda kasame yemini gerekir. İmam Şafii ise tam tersine böyle bir şehadetle kısas uygulamak gerekir demiştir. 4- Maktı:.ııün yanıbaşında veya yakınında elinde öldürme aleti bulunan ve mesela üzerinde kan izleri olan tek başına bir kişi yakalanmalıdır. Bu durumda İmam Malik ve ŞafiI'ye göre kasame yemini yapılır. 5- İki zümre birbiriyle çarpışıp, aralarında maktul bulunduğu takdirde çoğunluğu oluşturan fıkıh bilginlerine göre kasa me yeminine başvurulur. 6- Kişinin kalabalıktan sıkışarak ölmesi durumunda kasame yemini uygulanır. 7- Maktul bir mahalle veya kabile arasında bulunmalıdır. Bu Sevri, Evzai, Ebu Hanife ve ona tabi olan bilginlerce kasame yeminini gerektirir. Kasame yemini adı geçen bu bilginlere göre bu durumun dışında diğer şekillerde gerekmez. Hanefiler hariç olmak üzere'sözkonusu bilginlere göre kasamenin şartı maktulün üzerinde bir izin bulunmasıdır. Davud şöyle demiştir: Kasame ancak teammüden yapılan katllerde maktulün düşmanı olan şehir veya büyük köy halkına uygulanır. Çoğunluğu oluşturan fıkıh bilginleri bu durumda kasame uygulanmayacağı, tam tersine ölen kişinin kanının heder olduğu kanaatini benimsemişlerdir. Çün. kü maktul başka bir yerde öldürülüp, halkı itham edilsin diye o mahalleye atılmış olabilir. İmam Şafii'nin kanaati de bu doğrultudadır. Aynı görüş İmam Ahmed b. Hanbel'den de rivayet edilmiştir. Ancak yukarıda yer verilen hadiste anlatılan olayın benzeri durumlar bundan müstesnadır. Bu durumda düşmanlık mevcut olduğu için orada kasame uygulanır. Hanefllerle onların paralelinde düşünen bilginler, bu katı şekli dışında kasame'yi gerekli kılan bir karine (levs) görmemişlerdir. İbn Kudame'nin ifadesine göre Hanefllerin kanaati şudur: Maktul bir yerde bulunduğunda velisi öldürüldüğü yerden elli kişinin yemin etmesini ister. Bu elli kişi \"Onu biz öldürmedik, öldüreni de bilmiyoruz\" diye yemin ederler. Hakim elli kişi bulamadığı takdirde bulduğu kişiler, yemini tekrarlayıp sayıyı tamamlarlar. Bu durumda ara halkının kalanlarının diyet vermesi gerekir. Davalılardan yemin etmeyenler yemin edinceye veya maktülü öldürdüğünü kabul edinceye kadar hapsediler. Hanefiler bu görüşü Hz. Ömer'den gelen bir uygulamaya dayandırmışlardır. Buna göre Hz. Ömer elli kişiye elli yemin vermiş ve sonra onların diyet ödemelerine karar vermiştir. Ancak \"Bu kişiler suçu yanlışlıkla ikrar etmiş olabilirler ve te-ammüden öldürdüklerini inkar etmiş olma ihtimalleri vardır\" denilerek tenkit edilmiştir. Bir de \"Hanefiler usule aykırı olduğunda merfu bile olsa haber-i vahid'le amel etmezler. Şimdi usule aykırı olan mevkuf bir haber-i vahidi nasıl delil alıp da davalıdan başkasının yemin etmesini gerekli görüyorlar?\" denmiştir. Bu rivayetle kasame yemini ile kısas uygulanacağına delil getirilmiştir. Çünkü Nebi Sallallahu Aleyhi ve Sellem onlara \"Katilinizi hak edeceksiniz\" derken, bir başka rivayette \"Arkadaşımzın kanını hak edeceksiniz\" buyurmuştur. \"Onlardan biri kişi aleyhine\" ifadesi ile kasame ancak bir kişi aleyhine yapılır hükmü çıkarılmıştır. Ahmed b. Hanbel ile İmam Malik'in meşhur görüşü bu doğrultudadır. Çoğunluğu oluşturan fıkıh bilginleri şöyle derler: Kasame'nin ister bir, ister çok olsun muayyen şahıs veya şahıslar aleyhine yapılması şarttır. Bu bilginler kasame sonucunda kısasen bir kişinin mi yoksa onların tümünün mü Öldürüleceği noktasında ihtilaf etmişlerdir. Bu konu daha önce incelenmişti. Hadisten Çıkan Sonuçlar 1. Kasame' de yemin ancak katilin kesin olarak bilinmesi durumunda yapılır. Bunun yolu ise görmek veya buna delalet eden karıne ile birlikte güvenilir bir kimsenin haber vermesidir. 2. Yemin etmesi gereken kimse bundan kaçındığı takdirde hakkında hemen hüküm verilmez. Yemin başka bir kişiye tevcih edilir. Çoğunluğu oluşturan fıkıh oilginlerinin nezdinde meşhur olan görüş budur. Ahmed b. Hanbel ve Hanefllere göre ise bir başkasına yemin verilmeksizin o kişi hakkında hüküm verilir. 3. Kasame yemini elli kişiye verilir. Yemin edecek kişilerin sayısı konusunda ihtilaf edilmiştir. İmam Şafil, maktulün varisleri ister az, ister çok olsunlar elli yemin etmedikçe hak doğmaz demiştir. Verese yemin sayısı kadar olduğu takdirde her biri bir yemin eder. Sayıları az olduğunda veya bazıları yeminden kaçındığında diğer kişilere yemin verilir. Varis sadece bir kişi ise clli kez yemin eder ve talebini hak eder. H9;tta varis, ashab-ı feraizden ve asabeden-elsa ya da nesep ve vela yoluyla mirasçı olsa bile yemin ettiği takdirde talep ettiği şeyi hak eder. 4. Önemli işlerdedaha yaşlı kişiler öne çıkarılır. Ancak o kişinin buna ehil olması gereir. Böyle olmadığı takdirde öne geçirilmez. 5. Mal<tulün yakınlarına teselli verilir ve gönülleri hoş tutulur. 6. Yüz yüze görüşme imkanı varken yazışma veya haber-i vahidle yetinmek mümkündür. 7. Yeminin hakim tarafından tevcih edilmeden önce hiçbir hukukı sonucu olmaz. Çünkü Yahudiler cevaplarında \"Biz öldürmedik\" demişlerdir. Maktul yakınlarının \"Yahudilerin yeminlerine razı değiliz\" demeleri, onların doğru konuştuklarını uzak gördükleri anlamına gelir. Çünkü onlar Yahudilerin yalan söylediklerini veya yalandan yere yemine cüret ettiklerini biliyorlardı. 8. Kasamede mutlaka düşmanlık veya karşı tarafa bir kastın bulunması gerekir. Kasame'yi gerektirmese bile bu davanın dinleniHp, dinlenilmeyeceği noktasında ihtilaf edilmiştir. Bu konuda Ahmed b. Hanbel'den iki rivayet sözkonusudur. İmam Şafiı davanın dinleneceği görüşünü \"Davalı üzerine yemin vardır\" hadisinin genelliğine dayanmıştır. Zira Nebi Sallallahu Aleyhi ve Sellem bu ifadesinden önce \"İnsanlara iddialarına dayanılarak istedikleri verilseydi, insanlar başkalarının kanlarını ve mallarını dava ederlerdi\" buyurmuştur. Çünkü sözünü ettiğimiz davanın konusu, insandır: Dolayısıyla dinlenir ve davalıya yemin verilir. Karşı taraf bunu ya ikrar eder ki bu takdirde o kişinin katli konusunda hak sabit olur ve ikrarından dönmesi kabul edilmez. Yeminden kaçındığı takdirde iddia eden kişiye yemin verilir. Bunun sonucunda teammüden öldürmede kısas veya yanlışlıkla öldürme de diyet hak edilir. Hanefilerden gelen bir rivayete göre yemin davacı tarafa tevcih edilmez. Ahmed b. Hanbel'den de bu doğrultuda bir görüş naklediimiştir. 9. Davacı ve davalı taraflar yemin etmekten kaçındıklarında maktulün diyeti beytü'l-malden verilir. Bu konunun açıklaması az önce geçmişti. 10. Kasame yemininde yemin edecek kimsenin erkek veya ergenlik çağına girmiş olması şart değildir. Çünkü hadiste \"aranızdan elli kişi\" ifadesi kullanılmaktadır. Rebl'a, Sevrı, Leys, Evzaı ve Ahmed b. Hanbel bu görüşü benimsemişlerdir. İmam Malik \"Kasame yemininde kadınların işi yoktur. Çünkü kasamede talep edilen katildir. Böyle bir dava kadınlardan dinlenmez\" demiştir. İmam Şafil'nin görüşü ise şu yöndedir: Kasamede ancak ergenlik çağına ermiş ve maktule var is olacak kişiler yemin eder. Çünkü bu hükmı bir davada yemindir. Dolayısıyla diğer yeminler gibidir. Bu konuda erkekle kadın arasında herhangi bir fark yoktur. \"Beni insanlar önüne dikti.\" Yani beni onlarla tartışmak için dikti ya da kendisi tahtın gerisinde olduğu için onun görünür duruma geçmesini emretti. \"Ordu kumandanıarı ve Arabın eşrafı huzurundadır.\" Hadiste geçen \"ecnad\", \"cünd\" kelimesinin çoğuludur. Bu kelime esas en yardımcı ve destek olanlar anlamına gelmektedir. Sonra savaşta ve çarpışmada yardımcı anlamı meşhur oldu. Ömer, Ebu Ubeyde ve Muaz'ın vefatından sonra Şam'ı dört emirliğe ayırdı ve her bir emirin emrinde bir \"cünd\"ü/ordusu bulunmaktaydı. Filistin, Dimeşk, Hıms ve Kınnesrin'de birer cünd/ordu bulunuyordu. Bazı bilginler dördüncü cündün Ürdün olduğunu, Kınnesrin'in bundan sonra başlı başına cünd haline geldiğini söylerler. \"Kendi işlediği cinayet ile ... \" yani nefsinin cinayeti ve çekmesi ile. ...........Halau hali'an= ilişkilerini kesmişlerdi\" Arapça'da bir topluluk antlaşmayı bozduğunda \"tehalea'l-kavmu\" denilir. Bunu yaptıklarında cinayetinden sorumlu tutulmazlar ve sanki o sözle birlikte üzerlerine aldıkları yemin elbisesini çıkarmış gibi olurlar. Bundan dolayı görevinden azledilen emire \"hal!''' ve \"mahıu'\" denilir. \"Fe taraka ehle beytin= Yemen'den bir ev halkına Batha denilen Mekke vadisinde geceleyin hücum etti.\" yani bir gece mallarını çalmak için gizlice o ev halkına saldırdı. Bu olayın özeti şudur: Katil, maktulün hırsız olduğunu ve kavminin kendisinden ilişkisini kestiğini iddia eder, kavmi de bunu inkar edip, yalan yere yemin ederse Allahu Teala kasame yemini ile onları helak eder ve sadece mazlum olan kurtulur. \"Nahle mevkiine vardıklarında ... \" Burası Mekke'ye bir gecelik mesafede bir yerin adıdır. ........ yani mağara birden üzerlerine çöktü. '........' kurtuldu. Orada birlikte bulunanlar maktulün kardeşi ile elliyi tamamlayan kişiydi. ......... yani onları Şam'a sürdü>",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 6900,
			"arabicnumber": 6900,
			"text": "Enes b. Malik şöyle demiştir: Bir kimse Nebi Sallallahu Aleyhi ve Sellem'in evlerinden birisinde bulunan delikten içeriye baktı. Hemen Resulullah Sallallahu Aleyhi ve Sellem bir yassı demir veya birkaç demirle ona doğru ayağa kalktı, onu dürtmek için sinerek kendisine doğru yaklaşmaya başladı",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 6901,
			"arabicnumber": 6901,
			"text": "Sehl b. Sa'd es-Saidi'nin nakline göre adamın biri Resulullah Sallallahu Aleyhi ve Sellem'in kapısındaki bir delikten içeriye bakmıştı. O sırada Nebi Sallallahu Aleyhi ve Sellem elinde midra denilen demirden bir tarak vardı ki onunla başını kaşıyordu. Resulullah Sallallahu Aleyhi ve Sellem O kişiyi görünce \"Eğer senin bana bakıyor olduğunu daha önce bileydim, şu demiri gözüne saplardım!\" buyurdu. Resulullah Sallallahu Aleyhi ve Sellem \"İzin isteme ancak gözden dolayı getirilmiştir!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 6902,
			"arabicnumber": 6902,
			"text": "Ebu Hureyre r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Eğer bir kimse izinsiz olarak senin evine bakar, sen de bir çakıl taşı atarak onun gözünü çıkarırsan bundan dolayı sana herhangi bir günah olm\" Fethu'l-Bari Açıklaması: İmam Buhari, başlıkta görüldüğü üzere birisinin evinin içine izin almadan bakan ve bu yüzden gözü çıkarılan kimseye diyet verilmeyeceğini kesin bir dille ifade etmektedir. Onun buraya aldığı haberde diyetin olmayacağı açıkça belirtilmemektedir. Fakat o böylece hadisin bazı rivayet yollarından gelen şeylere adeti olduğu üzere işaret etmektedir. \"Adamın biri delikten içeri baktı\" yani yukarıdan evine baktı \".........\" \"Mişkas\" ince ve uzun ok temreni demektir. Şiş gibi demirden yapılmış, keskin bir başı vardır. Bazıları ise demirden dişi olduğunu söylemişlerdir. \"Onu dürtmek için sinerek kendisine doğru yaklaşmaya başladı.\" Kelime \"hatel\" kökünden türemedir. \"Hatel\" bir kimseyi gafil avlamak demektir. Hadisten Çıkan Sonuçlar 1. Baştaki saçı kesmemek, onu taramak caizdir. 2. Başından zararlı canlıları gidermek, kir ve bitleri temizlemek için bir tarak edinmek güzeldir. 3.Kapısı kapalı bir evin içinde bulunan kimseden izin almak gerekir. 4.Kapıda bulunan bir delikten içeri bakmak caiz değildir. 5. Saçları taramak meşrudur. İsti'zan bölümünde buna benzer birçok hadis geçmişti. 6. Eve girmek için izin almak sadece mÇlhrem olmayan kimselere mahsus değildir, tam tersine kişinin annesi veya kız kardeşi bile olsa elbisesi giyinik olmayan kimseden izin almak gerekir. 7. Tecessüste bulunan kimseye bir şeyatmak caizdir. Bu suç, hafif bir müeyyide ile önlenemediği takdirde daha ağırını kullanmak mümkündür. Buna göre içeri bakan kimsenin canına veya organına bir zarar geldiğinde bu hederdir. Malikiler bu durumda kısasa gidileceği kanaatine varmışlardır. Onlara göre içeri bakan kimsenin gözüne veya başka bir yerine kastetmek caiz değildir. Malikiler buna gerekçe olarak bir masiyetin bir başka masiyetle önlenemeyeceğini göstermişlerdir. Çoğunluğu oluşturan fıkıh bilginleri ise buna şöyle cevap vermişlerdir: Bir kimsenin bir hareketi yapmasına izin verilmişse buna masiyet denemez. Fiil, böyle bir nitelik taşımadığı takdirde masiyet sayılır. Bilginler, bir saldırganın hayatına mal olsJ!bile etkisiz hale getirilmesinin caiz olduğu noktasında ittifak etmişlerdir. Oysa byle bir gerekçe olmasaydı sözkonusu fiil masiyet olurdu. Hakkında nass sabit olmakla birlikte bu da saldırı fiili kategorisindedir. Malikiler hadise \"Bu hadis kişiyi korkutma ve yaptığı fiilin çok büyük bir günah olduğunu belirtmek amacıyla varid olmuştur\" diye cevap vermişlerdir. Ancak onlardan İbn Nafi çoğunluğa katılmıştır. Malikilerden Yahya b. Ömer şöyle der: Herhalde bu haber İmam Malik'e ulaşmamış olsa gerektir. Kurtubi el-Müfhim isimli eserinde şöyle der: Nebi Sallallahu Aleyhi ve Sellem, caiz olmayan bir şeyi yapmaya veya caiz olmayan bir sonuç doğuracak harekette bulunmaya teşebbüs edecek kimse değildir. Meşakkatin kaldırıldığı yolunda nass varken günahın kaldırıldığı şeklinde yorumlamak mümkün değildir. Nass varken kıyasa gidilmez. Bazı Malikiler görüşlerine sebep olarak başkasının avret mahalline kasıtlı olarak bakan kimse hakkındaki icmaı göstermişlerdir. Buna göre böyle bir hareket o kişinin gözünü çıkarmayı mubah kılmadığı gibi, çıkaran kimseden tazminat yükümlülüğünü düşürmez. Kendisine bakılan kimse evinde olduğu takdirde ve içeri bakan kişi de tecessüs ettiğinde durum yine böyledir. Kurtubi böyle bir icma bulunduğuna itirazda bulunmuş ve şöyle demiştir: Bu haber, başkasının evinin içine bakan herkesi kuşatmaktadır. Haber, evin içine bakan kimseyi -istenmeyen şeyleri görme ihtimali kuwetli olmakla birlikte- içerdiğine göre muhakkak olanı evleviyetle ihtiva eder. Bizce bu görüş tartışmaya açıktır. Çünkü evin içinde bulunan kimseye bakmak sözgelimi kişinin avreti gibi muayyen bir şeye bakmakla sınırlı değildir. Tam tersine kişinin harimine bakmayı ve ev sahibinin örtmek istediği ve kimsenin bakmaması gereken şeylere bakmasını da kapsar. Tecessüs yasaklığı ve tehdit bu gibi hareketleri yok etmek için sabit olmuştur. Var olduğu iddia edilen icma sabit olsaydı, bu özel hükmü reddetmek gerekli olmazdı. Bilindiği üzere aklı başında bir kimsenin eşinin ve kızının yüzüne yabancı bir erkeğin bakması ve benzeri şeyler çok ağırına gider. Aynı şekilde kişinin ailesi ile oynaşırken yabancı bir kişi tarafından görülmesi de erkeklik organının açık olarak görülmesinden daha çok ağırına giden hususlardandır. Kurtubl'nin söyledikleri, başkasının gizliliklerine bakmak isteyen ve karşı tarafın da onu savuşturduğu, etkisiz hale getirdiği kimse açısından yerindedir. Bakan kimseye bir şeyatmadan önce onu uyarmak şart mıdır? Bu konuda iki görüş sözkonusudur. Bazı bilginler saldırgan bir kimseyi etkisiz hale getirmede olduğu gibi bu şarttır demişlerdir. Bu iki görüşten daha sahih olanı bunun şart olmadığıdır. Çünkü hadiste \"onu dürtmek için sinerek kendisine doğru yaklaşmaya başladı\" denilmektedir. Evdeki bir delikten içeriye bakan kimse kapının deliğinden içeriye bakan kimse gibidir. Sokak ortasında durup başkasının mahremine veya bir başkasının evindeki bir şeye bakan kimsenin hükmü de böyledir. Bazı bilginlere göre yasaklık, baktığı kimsenin mülkünde bulunan kişi ile ilgilidir. Acaba kulak verip dinlemek bakma gibi midir? Bu konuda da iki görüş nakledilir. \\' Bunlardan daha sahih olanına göre dinlemek bakmak gibi değildir. Çünkü avret yerine bakmak onun anlatılmasını dinlemekten daha beterdir",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 6903,
			"arabicnumber": 6903,
			"text": "Ebu Cuhayfe şöyle demiştir: Ben Ali r.a.'e \"Sizin elinizde Kur'an'da olmayan herhangi bir şey var mı?\" diye sordum. -Ebu Cuhayfe bir keresinde insanların yanında olmayan bir şey var mı demiştir.- Ali r.a. \"Taneyi yaran ve insanı yaratan Allah'a yemin ederim ki bizim elimizde Kur'an'da olandan başka bir şey yoktur. Ancak insana Allah'ın kitabını anlama hususunda verilen bir anlayış ve bir de şu sahifedeki şey vardır\" dedi. Ben \"O sahifedeki nedir?\" diye sordum. Hz. AIi \"Akl yani diyet, esirin esaretten kurtarılması, kafir karşılığında Müslümanın öldürülemeyeceği hükümleri\" dedi. Fethu'l-Bari Açıklaması: \"Akile\" kelimesi \"akıl\" kelimesinin çoğuludur. Akıl, diyet veren kişi demektir. Diyete \"akl\" denilmesi, mastarla isimlendirme yapılmış olmasındandır. Çünkü diyet olarak verilen deve, maktulün avlusuna bağlanıyordu. Daha sonra bu kullanım yaygınlık kazandi ve -verilen deve olmasa bile- diyete \"akl\" denilmeye başlandı. Bir kimsenin akılesi, baba tarafındah'asabesi olan yakınlarıdır. Maktulün veIisinin kapısına diyet develerini bağlaenlar bunlardır. Akılenin diyeti üstlenmesi, sünnetle sabittir. Bilginler bu konuda icma etmişlerdir. Bu hüküm \"Hiçbir suçlu başkasının suçunu yüklenmez\"(En'am 164)ayetinin zahiri ile çelişmektedir. Fakat akıle hükmü bu ayetin genelliğinden tahsis edilmiştir. Çünkü bunda maslahat vardır. Zira katil diyeti vermekle sorumlu tutulsaydı neredeyse elinden bütün malı çıkardı. Bir kişinin ardarda hata etmeyeceğinden emin olunamaz. Kişi hatasının bedelini ödemeksizin bırakıldığı takdirde maktulün kanı heder olup, boşa gider. Biz de şunu ekleyelim: Akıle hükmünün arkasında yatan Sir şu olabilir: Katil diyeti tek başına ödeyip, fakir düştüğü takdirde fakirlik seviyesinde kalmaz heder olup gitme seviyesine düşer. Bundan dolayı onun diyetini akılesi ödemekle yükümlü tutulmuştur. Zira bir kimsenin fakir düşme ihtimali, bir topluluğun fakir düşme ihtimalinden çok daha fazladır. Bir de o kişi tekrar adam öldürdüğünde bu çeşit bir fiili tekrar işlememesi için bir topluluk tarafından uyarılması, kişinin kendi kendini uyarmasına oranla kabule daha yakındır. Doğruyu en iyi Allahu Teala bilir. Kişinin akılesi aşiretidir. Bunun için aşiretin ona en yakın kolundan başlanır. Bunlar diyeti ödemekte acizliğe düştüklerinde onlara en yakın olanlar devriye girer. Diyet hür, ergenlik çağına ermiş, hali vakti yerinde olan erkekler tarafından ödenir. \"Sizin elinizde Kur'an'da olmayan herhangi bir şey var mı?\" Yani ister ezberinizde olsun, isterse olmasın Nebi Sallallahu Aleyhi ve Sellem' den duyup da yazdığınız bir şey var mı? Bundan maksat yazılı ve ezberde olan bütün şeylere genellemek değildir. Çünkü Hz. Ali'den, Nebi Sallallahu Aleyhi ve Sellem'den rivayeten nakledilen ve sözü edilen sahifede bulunmayan çok şey vardır. Maksat, onun Kur'an'ın lafzının manasından anladığı ve manalarının batınından Çıkardığı şeylerdir. Hz. Ali'nin Kur'an'ın dışında yanında bulunan şeyden maksadı, sözkonusu sahifede ona nispet edilerek yazılan ve Kur'an'dan çıkardığı hükümlerdir. Sanki o bunları oraya unutmamak için yazmış gibidir. Nebi Sallallahu Aleyhi ve Sellem'den ezberlediği ahkam ise böyle değildir. Zira o hükümleri bilfiil ve fetva vermek suretiyle aklında tutmakta ve unutacağı endişesi taşımamaktadır. \"Ancak insana Allah'ın kitabını anlama hususunda verilen bir anlayış.\" Humeydi\"nin zikredilen rivayetinde \"Allah'ın bir kuluna kitabı hususunda verdiği anlayış\" şeklindedir",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 6904,
			"arabicnumber": 6904,
			"text": "Ebu Hureyre r.a.'in nakline göre Hüzeyl kabilesinden iki kadın birbiriyle kavgaya tutuşur, bu esnada biri diğerine bir taş fırlatır ve karnındaki çocuğu (cenin) düşürür. Resulullah Sallallahu Aleyhi ve Sellem o kadının çocuğu hakkında bir köle veya bir cariyeyi gurre olarak vermesi gerektiğine hükmeder",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 6906,
			"arabicnumber": 6906,
			"text": "",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 6908,
			"arabicnumber": 6908,
			"text": "Ebu Hureyre r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem Lihyan oğullarından bir kadının ölü olarak düşen cenin'i hakkında bir köle veya cariyenin gurre olarak verilmesine hükmetti. Sonra gurre vermesine hükmedilen o kadın öldü. Resulullah Sallallahu Aleyhi ve Sellem mirasının oğullarına ve kocasına ait olduğuna, diyetin ise cinayeti işleyen kadının asabesi {erkek akrabaları} üzerine olduğuna hükmetti",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 6909,
			"arabicnumber": 6909,
			"text": "",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 6910,
			"arabicnumber": 6910,
			"text": "Ebu Hureyre r.a. şöyle anlatmıştır: Huzeyl kabilesinden iki kadın birbiriyle kavgaya tuştu ve bu esnada biri diğerine bir taş fırlattı ve hem anneyi, hem de karnındaki yavruyu öldürdü. Taraflar Nebi Sallallahu Aleyhi ve Sellem'in hükmüne başvurdular. Resulullah Sallallahu Aleyhi ve Sellem cenin'in diyetnin bir köle veya cariyenin gurre olarak verilmesi, kadının diyetinin akılesi tarafından ödenmesi gerektiğine hükmetti. Fethu'l-Bari Açıklaması: ''Ana Rahmindeki Cenin'in Hükmü ... \" İbn Battal şöyle demiştir: Buharl'nin attığı bu başlıktan maksadı, öldürülen kadının diyetinin katil kadının babası ve babasının asabesi üzerine olduğunu vurgulamaktır. Biz de şunu ekleyelim: Kadının babası ve babasının asabesi, kadının kendi asabesidir. Böylece atılan başlık, birinci haberin lafzıyla tam olarak uygun düşmektedir. Buhari'nin bir diğer maksadı da diyetin kadının asabesi üzerine olduğunu belirtmektir. Bunu da naklettiği ikinci hadis açıklamaktadır. Buna göre Nebi s.a.v. kadının diyetinin akılesi üzerine olduğuna hükmetmiştir. Buharinin bunu \"baba\" kelimesiyle zikretmesi, olayın bazı rivayet yollarında gelen ifadeye işaret etmek içindir. \"Çocuk üzerine değil\" İbn Battal şöyle demiştir: İmam Buhari, öldürülen kadının çocuğunun kendi asabesinden olmadığı takdirde kadın adına diyete katıImayacağını vurgulamak istemektedir. Çünkü diyeti ödemekle zevi'l-erham değil, asabe yükümlüdür. Bundan dolayı ana bir kardeşler, kardeşlerinin diyetine katılmazlar. İbn Battal şöyle der: Bu haberin gereği, anneye mirasçı olan kimseler onun asabesinden olmadıkları takdirde onun adına diyet ödemekle yükümlü olmadıklarıdır. Bu İbnü'I-Münzir'in dediği gibi bilginler arasında ittifakla kabul edilen bir husustur. Biz de şunu hatırlatalım: Bundan önce Usame b. Umeyre'in rivayetinde şöyle bir cümlenin yer aldığını ifade etmiştim: \"Kadının babası diyeti onun çocukları öder deyince, Resulullah Sallallahu Aleyhi ve Sellem 'Diyeti ödemekle asabe yükümlü olur' buyurdu.\"(Beyhaki, Sünen, VIII, 108)",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 6911,
			"arabicnumber": 6911,
			"text": "Enes b. Malik şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem Medine'ye geldiği zaman (üvey babam) Ebu Talha benim elimden tutup, Resulullah Sallallahu Aleyhi ve Sellem'in yanına götürdü ve \"Ya Resulallah! Enes akıllı bir oğlandır, sana hizmet etsin!\" dedi. Ben de artık hem hazar'da, hem de seferde ona hizmet ettim. Valiahi bana yapmış olduğum bir şey için \"Bunu neden böyle yaptın?\", yapmadığım bir şey için de \"Bunu neden böyle yapmadın?\" demedi. Fethu'l-Bari Açıklaması: \"Köle veya çocuktan yardım istme.\" Kirmanı şö>,le demiştir: Atılan başlığın yazılan mektupla ilişkisi şudur: Köle (o işte çalışırken) helak olup ölse onun kıymetini ya da hürün diyetin i vermek gerekli olur. \"Ümmü Seleme'nin katiplerin hocasına haberci gönderip \"Bana yün tiftikleyecek oğlan köleler yolla, hür yollama demesi\" İbn Battal şöyle demiştir: Ümmü Seleme'nin hür istememesi şundandır: Çoğunluğu oluşturan bilginler şöyle derler: Bir kimse ergenlik çağına ermemiş, hür bir kişiden veya efendisinin iznini almaksızın köleden yardım ister de çocuk veya köle bu işte helak olurlarsa çalıştıran kişi o kölenin kıymetini tazmin eder. Hürün diyeti ise çalıştıranın akılesi tarafından ödenir. Kirmanı şöyle der: Ümmü Seleme'nin hür' gönderilmesini istememeGki maksadı, hüirü onurlandırma ve kölenin bedelini ödeme isteğidir. Zira hd,rrün' bu işte helak olması durumunda bedelini o tazmin etmeyecektir. Köle ise böyle değildir. Çünkü köle bu işte helak olduğu takdirde bedelini Ümmü Seleme ödeyecektir. Hadis, -yukarıdaki hadiste olduğu gibi- hür kimselerle komşu çocuklarını ağır meşakkatin bulunmadığı, ölmelerinden endişe edilmeyen işlerde çalıştırmanın caiz olduğuna delildir",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 6912,
			"arabicnumber": 6912,
			"text": "Ebu Hureyre r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"Hayvanların meydana getirdikleri yaralamalar hederdir, kuyu ve madenden kaynaklanan zarar ziyan, ölüm hederdir, rikaz (define) ma/larında beşte bir oranında vergi vardır\" buyurmuştur. Fethu'l-Bari Açıklaması: HAYVAN ZARARINA DAİR BÖLÜM AÇIKLAMADAN SONRA \"Acma\", \"a'cem\" kelimesinin müennesi olup, hayvan demektir. \"Cubar\" bir şey ödemek gerekmeyen heder demektir. Tirmizi şöyle demiştir: Bazı bilginler bunu tefsir ederken şu açıklamayı yaparlar: Acma, sahibinin elinden kurtulan hayvan demektir. Böyle bir hayvan bağını koparıp, herhangi bir zarar verdiğinde sahibinin bir şey tazmin etmesi gerekmez. Ebu. DavUd hadisi naklettikten sonra şöyle der: Acma, bağından boşanmış, yanında hiç kimse olmayan hayvan demektir. Bu geceleyin değil, gündüz sözkonusu olur. \"Kuyulardan kaynaklanan zarar ziyan, ölüm hederdir.\" Esved b. Ala'nın Müslim'de yer alan nakli \"Kuyunun sebep olduğu yara hederdir\" şeklindedir.(Müslim, Hudud) Ebu. Ubeyd şöyle der: Burada kuyudan maksat sahibi bilinmeyen çölde bulunan eski kuyulardır. Bu kuyuya bir insan' veya hayvan düştüğü takdirde hiçbir kimse bir şey ödemekle yükümlü olmaz. Aynı şekilde bir kimse kendi toprağında veya kimsenin sahibi olmadığı •jlü bir arazide kUY1('Pçsa oraya bir insan veya başka bir canlı düşüp ölse, buna kuyu açan kimse sep olmadığı takdirde herhangi bir tazminat ödemesi gerekmediği gibi ta'zir de gerekmez. Bunun gibi bir kimse kendisine kuyu kazsın diye bir başkasını işçi tutsa, o kişi çalışma esnasında bu kuyuya yuvarlansa yine herhangi bir şey tazmin etmek gerekmez. Buna karşılık bir kimse Müslümanların gelip geçtiği yol üzerinde kuyu kazsa, aynı şekilde bir başkasının mülkünde onun iznini almadan kuyu açsa ve bir kimse bu kuyuya düşerek ölse, o kişinin diyeti kuyuyu kazan kimsenin akılesine aittir. Kefareti ise kendi malından öder. Bu kuyuya insan değil de hayvan düşüp ölse, onun tazmini kuyuyu kazan kimsenin malından yapılır. Açılan hertürlü çukur yukarıda belirtilen ayrıntı çerçevesinde kuyu gibi değerlendirilir. Hadiste geçen \"cerh= yaralama\"dan maksat, en-Nihaye'de Ezherı'den nakledildiği üzere oraya düşenin aldığı yaradır. Yara sadece buna mahsus da değildir. Tam tersine bütün ölümler yaralama kategorisindedir. Kadi İyad ve bir grup bilgin şöyle derler: Resulullah Sallallahu Aleyhi ve Sellem'in bunu \"yaralama\" kelimesiyle ifade etmesi, genelde zarar ve ziyanın yaralama şeklinde ortaya çıkmasındandır ya da bu bir örnekleme olup, Nebi Sallallahu Aleyhi ve Sellem başka zarar ve ziyana bununla dikkat çekmiştir. Gerek cana, gerekse mala gelen bütün zarar ve ziyanlarda hüküm buna göredir. İbn Battal şöyle demiştir: Bu konuda Hanefiler muhalif kalmışlardır. Onlar hayvana binmiş bir kimseye kıyasen kuyu kazana mutlak olarak tazminat yükümlülüğü getirmişlerdir. Oysa nassın bulunduğu yerde kıyas yapılamaz. \"Madenden kaynaklanan zarar ziyan, ölüm hederdir.\" Bu konudaki hüküm kuyu konusundaki ile aynıdır. Bir kimse kendi mülkünde veya ölü arazide maden kuyusu kazsa ve oraya bir şahıs düşüp ölse kanı hederdir. Aynı şekilde bir kimse çalıştırmak üzere bir işçi kiralasa, o kişi o maden çukuruna yuvarlanıp ölse kanı hederdir. Bu konuda bir hurma ağacına çıkmak üzere kiralanıp, ağaçtan düşerek ölen işçi örneğinde olduğu gibi herhangi bir işi görmek üzere kiralanan bütün ücretliler bu konuda kuyu ve maden örneğinde zikredilen hükme tabidirler. \"Define mal/arında beşte bir oranında vergi vardır.\" Bunun genişçe bir açıklaması Zekat bölümünde geçmişti)",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 6913,
			"arabicnumber": 6913,
			"text": "Ebu Hureyre r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"Hayvanların verdiği zararın diyeti hederdir, kuyu kazmaktan meydana gelen zarar da hederdir. Maden kazmada meydana gelen zarar da hederdir. Define mallarında beşte bir oranında vergi vardır\" buyurmuştur. Fethu'l-Bari Açıklaması: \"İbn Sirin şöyle demiştir: Bilginler hayvan tepmesinden meydana gelen zararı ödetmezlerdi.\" Burada yer alan \"en-Nefha\" ayağıyla vurma yani tepme demektir. \"Binicinin hayvanın dizginini çekmesinden dolayı ayağı ile bir şeye zarar verdiğinde zararı ziya nı tazmin etmek gerektiğini belirtirlerdi.\" Hadis metninde yer alan \"el-inan\" hayvana binen kişinin onu istediği tarafa yönlendirmesi için ağzına konulan şey yani dizgin demektir. Hadisin ma\\: şudur: Bir hayvana binildiği ve binid de dizginini çektiği takdirde hayvan ayağıyla bir şeye zarar verirse, binen kişi o zararı tazmin eder. Buna karşılık binid sebep olmadan hayvan ay ağıyla bir şeye zarar verecek olursa, binen kişi bunu tazmin etmez. \"Hammad şöyle demiştir: Hayvan tepmesinden meydana gelen zarar tazmin olunmaz, ancak insanın hayvanı dürtmesi dolayısıyla meydana gelen zarar ziyan tazmin olunur.\" \"Ancak insanın hayvanı dürtmesi dolayısıyla meydana gelen zarar ziyan tazmin olunur.\" Bu durum, hayvanı sahibinin veya başka bir kimsenin dürtmesi durumundan daha geneldir. \"Bir kimse hayvanına vurur, hayvan da buna tepki olarak ayağı ile ona vurursa meydana gelen zarar ziyan tazmin edilmez.\" İbn Ebi Şeybe'nin nakline göre Muhammed b. Sırın şöyle demiştir: Kadı Şureyh hayvanı süren veya binen kimse hayvanın verdiği zarar ve ziyanı tazmin eder ancak hayvan kendisine vurulması neticesinde bir zarara yol açarsa tazmin etmez dedi. Ben \"Hayvanın muakabesi nedir\" diye sordum. Kadı Şureyh \"Bir kimse hayvana vurur da, hayvan da onu yaralarsa buna muakabe denir dedi. \"Hayvanını kiraya veren kimse (mükarı) üzerinde bir-kadın bulunan eşe ği sürdüğü zaman ... \" ve kadın da o hayvandan düştüğünde sürücü üzerine tazminat yoktur. \"Şa'bı ise şöyle demiştir: Sürücü hayvanı sürüp yorduğu zaman, hayvanın verdiği zararı tazmin eder. Hayvanı yormaksızın yavaş yavaş yumuşaklıkla sürer de bu sırada bir zarar verirse o zararı ödemez.\" İbn Battal şöyle demiştir: Hanefiler hayvanın-ön a)laklarıyla, arka ayaklarının verdiği zararı farkli mütalaa etmişler ve hayvan arka ayakları ve kuyruğuyla zarar verdiğinde kişi buna sebep bile olsa hayvanın verdiği zararı tazmin etmez, buna karşılık ön ayakları ve ağzıyla verdiği zararı tazmin eder demişlerdir. İmam Buhari, Kefe imamlarından bu görüşe muhalif görüşü naklederek bunu kabul etmediğine işaret etmektedir. Şafiilerin bu konudaki görüşü şöyledir: Hayvanla birlikte insan bulunduğu takdirde insan hayvanın cana veya organa ya da mala verdiği zararı tazmin eder. Bu kişi ister hayvanı süren, ister binen, ister yularını çeken olsun fark etmediği gibi hayvanın sahibi veya kiraya vereni ya da kiralayanı veya ödünçalanı ya da gasıbı olsun yine farketmez. Ayrıca hayvanın bu zarara ön veya arka ayaklarıyla ya da kuyruğuyla veya başıyla yol açması arasında fark olmadığı gibi zararın gece veya gündüz meydana gelmiş olmasında da herhangi bir fark yoktur. Bu görüşün deliline gelince, zarar ve ziyanın kasten veya başka bir yolla yapılmış olması arasında hiçbir fark yoktur. Hayvanla birlikte bulunan kimse ona hakimdir. Hayvan adeta onun elindeki bir alet gibidir. Dolayısıyla hayvanın fiili kişi hayvanı buna ister sevk etsin, isterse etmesin yine bunu ister bilsin, isterse bilmesin kendisine nispet edilir. İmam Malik'ten de buna benzer bir görüş nakledilmiştir. Ancak birisi hayvanın tepmesine sebep olacak bir hareket yapmadan teperse, bu müstesnadır. İbn Abdilberr'in nakline göre çoğunluğun görüşü bu doğrultudadır. Bu hadis, hayvanın ekin veya başka bir şeyi gece ve gündüz itlaf etmesi arasında fark olmadığına delil gösterilmiştir. Hanefl ve zahirilerin görüşü bu doğrultudadır. Çoğunluğu oluşturan fıkıh bilginleri şöyle demişlerdir: Verilen zarar ve ziyan gündüz meydana gelmişse tazminat yükümlülüğü düşer. Gece yapılmışsa hayvan sahibi hayvanını korumakla görevlidir. Dolayısıyla hayvan sahibinin kusuru neticesinde bir zarar ve ziyan meydana gelmişse hayvan sahibi hayvanın bu zararını tazmin etmekte yükümlüdür. Bu tahsisin delili ise İmam Şafii, Ebu Davlid, Nesa! ve İbn Mace'nin, Zührı, Haram b. Muhaysa el-Ensarı vasıtasıyla Bera b. Azib'den yaptıkları şu nakildir: \"Bera'nın zarara yol açan bir devesi vardı. Bir gün bu deve bir bahçeye girerek oraya hasar verdi. Bunun üzerine Resuluilah Sallallahu Aleyhi ve Sellem bahçeleri gündüz sahiplerinin korumaları, hayvanları geceleyin sahiplerinin muhafaza etmeleri ve geceleyin verdikleri zararı sahiplerinin tazmin etmesi gerektiğine hükmetti. \"(Ebu Diıvud, Buyu' ve'l-İcarat) İbn Abdilberr şöyle demiştir: Bu hadis her ne kadar mürsel ise de meşhur olup, sika raviler tarafından nakledilmiştir. Hadisi Hicaz fıkıh bilginleri kabul etmiştir. Tahavl'nin bu hadisin yukarıda zikredilen hadisle mensuh olduğuna işaret etmesine gelince, nesheden rivayetin tarihi bilinmeden ihtimale açık bir durumda nesih olamaz denilerek tenkit edilmiştir. Bundan daha güçlü olanı ise İmam Şafii'nin şu görüşüdür: Biz Bera hadisini sabit olduğu ve ravilerinin durumu bilindiği için kabul ediyoruz. \"Hayvanların verdiği zarar ziyan hederdir\" hadisi bu hadisle çelişmez. Çünkü bu, özel anlam kastedilerek kullanılmış genel ifadedir",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 6914,
			"arabicnumber": 6914,
			"text": "Abdullah b. Amr'ın nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Kim bir zimmfyi haksız yere öldürürse cennet kokusunu alamaz. Halbuki cennetin kokusu kırk yıllık uzakızktan duyulur.\" Fethu'l-Bari Açıklaması: \"Suçsuz bir zimmiyi öldürme.\" Hadisteki \"cennetin kokusunu alamama\", -genel anlamlıolmakla birlikte- belli bir zamana mahsustur. Çünkü akli ve nakli deliller bir kişinin Müslüman olarak öldüğü takdirde büyük günahları işlemiş bile olsa Müslüman olduğuna hükmedileceği ve cehennemde ebediyyen kalmayacağını göstermektedir. Böyle bir kimse cennete girmeden önce aza b görmüş olsa bile sonunda varacağı yer cennettir. . \"Kırk yıllzk uzaklzk\" Bu hadisin bir benzerini Tirmizi'de, Ebu Hureyre şu şekilde nakleder: \"Cennetin kokusu yetmiş yıllık uzakızktan duyulur. \"(Tirmizi, Diyat) el-Muvatta'da yer alan başka bir hadise göre Resulullah Sallallahu Aleyhi ve Sellem \"Cennetin kokusubeş yüz yıllzk mesafeden duyulur\" demiştir. İbn Battal bu konu üzerine şu açıklamayı yapar: Kırk yaş olgunluk yaşıdır. Bu yaşa eren kimsenin ameli, yakini ve pişmanlığı artar. Sanki bu yaşa gelmiş bir kişi kendisini itaata zorlayan cennet kokusunu almış gibidir. İbn Battal şöyle devam eder: Yetmiş yaş ise mücadelenin son sınırıdır. Bu yaşa gelince, insana pişmanlık ve ecelin gelip çatma korkusu musaHat olur. Netice olarak Allahu Teala'ın başarılı kılmasıyla itaati artar ve kişi yetmiş yaşından itibaren cennet kokusunu almaya başlar. Bizim kanaatimiz ise şöyledir: Hadiste yer alan rakamları cem' ve telif etmek için şöyle denebilir: Kırk, mahşer yerindeki durma noktasından cennet kokusunun alındığı zamanın en kısasıdır. Yetmiş, bundan daha ötedir ya da bu rakamlar abartı için ifade edilmiştir. Beşyüz sonra, bin bunlardan daha fazladır. Bu, şahıstan şahsa ve yapılan amellere göre farklılık arzeder. Cennetin kokusunu en uzak mesafeden alan kimsenin en yakın mesafeden ve bu ikisi arasındaki yerden alana göre üstünlüğü vardır. Tirmizi şerhinde bu konuya işaret ederek şöyle demiştir: Bu rivayetleri cem ve telif etmek için şöyle denebilir: Bu kişilerin mertebeleri ve derecelerindeki farklılığa göre şahıstan şahsa değişebilir. Sonra bu açıklamanın bir benzerini İbnü'I-Arabi'de gördüm. O şöyle demektedir: Cennetin kokusu doğalolarak alınamaz. Ancak Allahu Teala'ın alınmasını yaratmış olduğu şeyalınabilir. Allahu Teala'ın dilediği kimselerden bazıları cennetin kokusunu yetmiş yıllık mesafeden alırken, bazıları beş yüz yıllık mesafeden alır",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 6915,
			"arabicnumber": 6915,
			"text": "Ebu Cuhayfe şöyle demiştir: Ali r.a.'e \"Sizin yanınızda Kur'an'da olmayan herhangi bir şey var mı?\" diye sordum. Hadisi rivayet eden İbn Uyeyne bir keresinde \"insanların yanında olmayan bir şey var mı?\" diye sorduğunu nakletmiştir. Hz. Ali bu soruya şöyle cevap vermiştir: \"Taneyi yaran ve insanı yaratan Allah'a yemin ederim ki bizim yanımızda Kur'an'da olandan başka bir şey yoktur. Ancak insana Allah'ın kitabını anlama hususunda verilen bir anlayış ve bir de şu sahifedeki şey vardır\" dedi. Ben \"O sahifedeki nedir?\" diye sordum. Ali \"Diyet, esirin kurtarılması ve kafir karşılığında Müslümanın öldürülemeyeceği hükümleridir\" dedi. Fethu'l-Bari Açıklaması: \"Kafiri öldüren Müslümanın kısasen öldürülemeyeceği.\" imam Buharl'nin bu başlığı bir önceki başlıktan daha sonraya koyması, bir zimmıyi öldürmeye yönelik olarak gelen şiddetli tehditten onu teammüden öldüren Müslümanın kısas edilmesinin gerekmeyeceğine işaret etmek ve bir Müslüman bir kafiri öldürdü diye kısasen öldürülmediğine göre onun bütün kafirleri öldürmeye hakkının olmadığına, tam tersine haksız yere zimmıyi ve muahidi öldürmesinin haram olduğuna işaret etmek içindir. \"Hz. Ali'ye sordum.\" Bu rivayet, bir başka yönden İlim ve başka bölümlerde Mutarrıf'tan naklediimiştİ. Orada hadisin açıklaması, onu Hz. Ali'dennakleden ravilerin lafız farklılıklarının beyanı, diyet ve esiri kurtarmanın ne demek olduğu da açıklanmıştı. Kafiri öldüren Müslümanın öldürülmemesine gelince, çoğunluğun kanaati bu yöndedir. Ancak İmam Malik'in yol kesen ve bu nitelikte suç işleyen kimseler hakkındaki görüşüne göre bir kimse bir başkasını pusuya düşürerek öldürdüğünde -maktul zimmı bile olsa- kısasen öldürülmesi gerekir. Bu hüküm, kafiri öldüren Müslümanın öldürülemeyeceği hükmünün bir istisnasını teşkil etmektedir. Aslında bu, bir istisna değildir. Çünkü burada başka bir nitelik vardır. O da yeryüzünde fesad çıkarmaktır. Hanefiler bu hükme muhalif kalarak şöyle demişlerdir: Bir Müslüman, bir zimmıyi haksız yere öldürdüğü takdirde kısasen katledilir. Buna karşılık müste'meni öldürdüğünde katledilmez",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 6916,
			"arabicnumber": 6916,
			"text": "Ebu Said el-Hudrl'nin nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"Nebiler arasında şu, şundan daha hayırlıdır demeyiniz!\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 6917,
			"arabicnumber": 6917,
			"text": "Ebu Said el-Hudrı şöyle demiştir: Yahudilerden bimin yüzüne tokat atılmış bunun üzerine Yahudi Resulullah Sallallahu Aleyhi ve Sellem'e geldi ve \"Ya Muhammed! Ensardan olan sahabilerinden biri benim yüzüme tokat vurdu\" diye şikayet etti. Hz. Nebi Sallallahu Aleyhi ve Sellem \"Onu çağırın!\" buyurdu. Sahabiler o Ensarlı kişiyi çağırdılar. Nebi Sallallahu Aleyhi ve Sellem \"Sen bu kişinin yüzüne tokat attın mı?\" diye sordu. O kişi şöyle cevap verdi: \"Ya Resulallah! Ben Yahudilerin yanından geçtim de bu kişinin 'Musa'yı bütün insanlığın üstüne seçip tercih eden Allah'a yemin ederim ki' dediğini işittim. Ensarlı şöyle devam etti: 'Ben Muhammed'in üstüne de mi (yükseltti)?' dedim. Bu sırada öfkeye kapıldım ve yüzüne bir tokat attım. Nebi Sallallahu Aleyhi ve Sellem şöyle dedi: \"Nebiler arasında benim daha hayırlı olduğmu söylemeyiniz. Gerçek şu ki insanlar kıyamet gününde (dehşetten) bayılacaklar. Fakat ilk ayılan ben olacağım. O anda bir de göreceğim ki Musa arşın ayaklarından birini tutmuş olduğu halde olacaktır. Bilmiyorum Musa da bayılanların içinde olacak da benden evvel mi ayılacak, yoksa Tur dağındaki bayılmasının karşılığı mı verilecek?\" Fethu'l-Bari Açıklaması: \"Öfkelendiği bir anda bir yahudiye tokat atan Müslümana bir şey lazım gelmeyeceği.\" Yani böyle bir Müslümana tıpkı bir zimmıyi tokatladığında olduğu gibi kısas uygulanmaz. İmam Buhari, bu ifadesiyle sanki muhalif olan bil!;Iinin tokat atmada kısas yapılma kanaatini taşıdığına işaret etmektedir. Nebi Sallallahu Aleyhi ve Sellem zimmıden dolayı Müslümanı kısas etmediğini göre bu uygulama, kısasm cereyan etmediğini göstermektedir. Fakat Kufe bilginlerinin tamamı tokat atmada kısas uygulanacağı kanaatinde değillerdir. Buradaki hüküm, onların içinden bu kanaati taşıyanlarla ilgilidir. Hadisten Çıkan Sonuçlar 1. Bir zimmı bir Müslümanı şikayet edebilir, davasını hakime götürebilir ve hakim de bunu dinleyebilir. 2. Hükmü bilmeyen kimse, hakimden bunu öğrenebilir ve Müslüman açısından bu kadarıyla yetinilir. 3. Bir zimmı, bilgisi olmadığı bir hususta söz söylemeye kalkıştığında ilmiyle meşhur olan bir Müslüman ona ta'zir cezası uygulayabilir. Hadisten çıkan diğer sonuçlar, Musa aleyhisselam kıssasında geçmişti",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 55
			}
		}
	]
}