{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"89": "(Statements made under) Coercion"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6940,
			"arabicnumber": 6940,
			"text": "Ebu Hureyre r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem namazında şöyle dua ederdi: ''Allah'ım! Ayyaş b. Ebi Rebia, Seleme b. Hişam ve el-Velid b. el-Velid'i kurtar! Allah'ım kafir/erin zulmü altında ezilen, kurtulmaya çare bulamayan diğer mu'minleri (müstaz'afları) kurtar! Allah'ım Mudar kabilesini ezip, iyice perişan et, onları yerle bir eyle, onlara Hz. Yusuf'un zamanındaki kıtlık yıllarını gönder. \" Fethu'l-Bari Açıklaması: \"Tehdit ve zor kullanma.\" Zor kullanma (ikrah) başkasını yapmak istemediği bir şeye zorlamak anlamına gelir. İkrahın dört şartı vardır: 1- Zor kullanan kimsenin tehdit ettiği şeyi yapmaya gücü yetmesine karşılık, tehdide maruz kalan kaçarak bile olsa bunu savuşturmaktan aciz olmalıdır. 2- Tehdide maruz kalan kimse kendisinden istenilen fiili yapmadığı takdirde zor kullanan kimsenin söylediğini yapacağına yakın derecesinde zan taşımalıdır. 3- Zor kullanan kimsenin yaptığı tehdit o an için geçerli olmalıdır. Tehdit yönelten kimse \"Eğer şöyle yapmazsan seni yarın döverim\" dese, bu tehdide maruz kalan kimse tehdit altında kalmış sayılmaz. Ancak tehdit yöneiten kişi çok kısa bir zaman dilimini telaffuz etse veya tehdidinden dönmemek gibi bir adeti bulunsa bu takdirde zorlamaya maruz kalmış sayılır. 4- Tehdide maruz kalan kimse yaptığı fiili gönül rızasıyla yaptığını gösterecek davranışlar sergilememelidir. Çoğunluğu oluşturan bilginlere göre tehdidin söz ve fiille yapılmış olması arasında herhangi bir fark yoktur. Fiill tehdit açısından -bir kimseyi haksız yere öldürmek örneğinde olduğu gibi- ebediyyen haram olan bir fiil istisna tutulmuştur. Bilginler tehdide maruzkalan kimsenin zorlandığı fiili yapI1{amakla .mükellef olup olmadığı noktasında farklı görüşler ortaya atmışlardır. Şi&h Ebu ıshak eşŞirazı şöyle demiştir: Bilginler bir kimseyi öldürmeye zorlanan kimsenin, bundan kaçınmakla ve kendisini savunmakla yükümlü olduğu, o kişiyi öldürdüğü takdirde günaha gireceği noktasında icma etmişlerdir. Bu da bizezorlanan kimsenin o durumda mükellef olduğunu' göstermektedir. Aynı şeyleri İmam Gazzalı ve başkalarının ifadesinde de görmek mümkündür. Bilginlerin açıklamalarının zorunlu sonucu, sözkonusu ihtilafın zorlama faktörüyle şeriatın çağrısının birbiriyle uyumlu olması durumuna mahsus olduğudur. Bir kafiri öldürmeye ve Müslüman olmaya zorlama durumu buna örnektir. Buna karşılık bir kimseyi öldürmeye zorlama örneğinde olduğu gibi zorlama faktörüyle şeriatın çağrısı birbiriyle ters düştüğünde kişinin onu öldürmemekle yükümlü olduğu noktasında ihtilaf yoktur. İhtilaf, ikrah-ı müld durumunda kişinin mükellef olup olmadığı noktasındadır. İkrah-ı müld, kişinin zorlandığı fiili yapmaktan başka çare bulamadığı durumlardır. Bilginler tehdidin niteliği konusunda ihtilaf etmişlerdir. Öldürme, herhangi bir organı kesme, şiddetli bir şekilde dövme, uzun süre hapsetme tehdidi ittifakla geçerli kabul edilirken, hafifçe dövme ve bir ya da iki gün hapsetme tehdidinin geçerli olup olmadığı noktasında ihtilaf edilmiştir. \"Kalbi imanla dolu olduğu halde.\" Bu ifade, kendi rızasıyla dinden dönene çok ağır bir tehdittir. Buna karşılık zorlanarak bunu yapan kişi, ayetin hükmüne göre mazurdur. Zira müspet bir hükümden yapılan istisna olumsuz anlamı ifade eder. Dolayısıyla küfre zorlanan kimsenin ayette ifade edilen tehdide dahil olmaması gerekir. Meşhur olduğu üzere zikredilen ayet Ammar b. Yasir hakkında inmiştir. Nitekim Ebu Ubeyde b. Muhammed b. Ammar b. Yasir şöyle demiştir: \"Müşrikler Ammar'ı yakalayıp, ona işkence ettiler. Neticede onların istedikleri bazı şeylerde kendilerine uydu. Ammar Nebi Sallallahu Aleyhi ve Sellem'e yaptığı şeyden yakınınca, Resulullah Sallallahu Aleyhi ve Sellem \"Kalbini nasıl buluyorsun?\" diye sordu. Ammar \"imanla dopdolu\" deyince, Nebi Sallallahu Aleyhi ve Sellem \"Sana yine böyle yaparlarsa sen de öyle davran\" buyurdu. Bu haber mürsel olup, ravileri sikadır. Haberi Taberi rivayet etmiştir. \"Ancak kafir/erden gelebilecek bir tehlikeden sakınmanız başkadır.\" Ayette geçen \"ölZ\",\"takıyYe\" yani onlardan korkarsanız istediklerini yapınız demektir. İmam Buhari bu açıklamayı Ebu Ubeyde'nin ifadesinden almıştır. Ebu Ubeyde, tukat ve takıyye aynı manadadır demiştir. Biz de şunu ekleyelim: Bu kelime Al-i İmran suresinin tefsirinde geçmişti. Ayetin manasına gelince, bir mu'min bir kafiri zahiren ve batınan dost edinmesin. Ancak zahiren ondan sakınması müstesnadır. Bu durumda ondan korktuğunda kendisiyle dost olabilir. Ancak içinden ona düşmanlık besler. \"Görüldüğü üzere Allahu Teala, emrettiği şeyi terk etmekten kaçınmayan çaresizleri mazur görmektedir.\" Yani onlar mağlup olduklarında mazurdurlar. Zorlanan kimse, kendisine emredilen şeyi yapmaktan kaçınamayan zavallı ve aciz bir kimseden başkası değildir. Onu tehdit eden yaptığı tehdidi yerine getirmeye kudreti olan bir kimsedir. Çünkü o kendisinden istenilen fiili yapmamazlık edemez. Tıpkı zorlanan kimsenin istenilen fiilden kaçınamadığı gibi. Netice olarak zayıf ve aciz kimseler (müstazaf) tıpkı zorlanan (mükreh) hükmündedir. \"Hasan-ı Basri Ayette geçen \"ölZ= sakınma\", kıyamete kadar geçerlidir demiştir.\" Abd b. Humeyd ve İbn Ebi Şeybe'nin nakillerine göre Hasan-ı Basri şöyle demiştir: \"Sakınma (takiyye) mu'min için kıyamet gününe kadar caizdir. Ancak adam öldürme de takıyye olamaz. \"(İbn Ebi Şeybe, Musannef, VI, 474) Abd b. Humeyd'in rivayeti ise \"Ancak Allahu Teala'ın haram kıldığı nefsi öldürmede geçerli değildir\" şeklindedir. Yani başkasını öldürmeye zorlanan bir kimse kendi canını başkasının canına tercih ettiği için mazur değildir. Biz de şunu ekleyelim: \"Takıyye\" kelimesinin manası insanın içindeki inancını ve başka şeyleri başkasına açık etmekten kaçınması demektir. Beyhakl'nin nakline göre İbn Abbas şöyle demiştir: \"Takıyye kalp imanla dopdolu iken dille yapılır ve kişi adam öldürmek maksadıyla kimseye el uzatmaz.\" \"İbn Abbas hırsızların zorlaması neticesinde hanımını boşamak zorunda kalan kimse için yaptığına itibar edilmez demiştir. İbn Ömer, İbnü'z-ZUbeyr, Şa'bı ve Hasan-ı Basri bu görüştedirier.\" Abdurrezzak'ın sahih bir isnadla İkrime'den nakline göre İbn Abbas tehdide maruz kalarak yapılmış boşamayı geçerli saymazdı. İbn Battal, İbnü'l-Münzir'e uyarak şöyle demiştir: Müdehitler, küfre zorlanan ve öldürüleceği korkusuyla kalbi imanla dopdolu olduğu halde kafir olan kimsenin kafirliğine hükmedilemeyeceği ve hanımının kendisinden boş düşmeyeceği noktasında icma etmişlerdir. Ancak Muhammed b. el-Hasen şöyle demiştir: Böyle bir kimse -içten içe Müslüman bile olsa- küfrünü açıktan yaparsa mürted olur ve karısı kendisinden boş düşer. İbn Battal, bu söz naslara muhalif olduğu için cevap vermeye değmez, demiştir. Bazı bilginler ise şöyle derler: Sözkonusu ruhsatın mahalli sözdür. Puta tapma veya bir Müslümanı öldürme ya da domuz eti yeme veya zina etme gibi fiille ilgili şeylerde ruhsat sözkonusu değildir. Evzaı ve Sehnun'un görüşü bu doğrultudadır. İsmail el-Kadl'nin sahih bir senedIe nakline göre Hasan-ı Basri ilişilmesi haram olan bir cana kıymada takıyye olmayacağı kanaatinde idi. Bir grup bilgin ise zorlama altında söylenen sözle, yapılan fiil birbirine eşittir demişlerdir. Bilginler zorlamanın tanımı üerinde ihtilaf, etmişlerdir. Abd b. Humeyd'in sahih bir isnadla nakline göre Hz. Omer şöyle demiştir: \"Bir kimse hapse konulduğunda veya bağlandığında ya da işkenceye maruz kaldığında canından emin değilse zorlama altındadır. Kadı Şureyh'ten buna benzer ancak daha uzun bir rivayet nakledilmiştir. Bu rivayette \"Dörılşey vardır ki bunlarla zorlama gerçekleşir: Hapse atmak, dövmek, tehdit yöneltmek ve bağlamak.\" İbn Mesud ise şöyle demiştir: \"Herhangi bir söz, benden iki kamçıyı savuşturuyorsa onu söylerim.\" Çoğunluğu oluşturan bilginlerin görüşü bu doğrultudadır. KOfeli bilginlere göre bu konuda ayrıntı vardır. (Bilginler zorlama altında yapılmış boşama hakkında ihtilaf etmişlerdir. Çoğunluğu oluşturan bilginler böyle bir boşamanın geçerli olmadığı kanaatine varmışlardır. Bu konuda İbn Battal sahabilerin icmaı olduğunu nakleder. KOfeli bilginler ise böyle bir boşamanın geçerli olduğu kanaatindedirler. Zühri, Katade ve Ebu Kılabe' den buna benzer bir görüş '1akledilmiştir. \"Nebi s.a.v. 'Ameller niyet/ere göredir' buyurmuştur.\" Bu hadisin geniş bir çıklaması Sahih'in ilk hadisinde yapılmıştı)",
			"grades": [],
			"reference": {
				"book": 89,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6941,
			"arabicnumber": 6941,
			"text": "Enes b. Malik'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Üç şey vardır ki kimde bulunursa imanın tadını almış olur: Allah ve Resulü kendisine başkalarından daha sevgili olmak, bir kimseyi yalnız Allah için sevmek, küfre geri dönmekten ateşe atılacakmışçasına hoşlanmamak",
			"grades": [],
			"reference": {
				"book": 89,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6942,
			"arabicnumber": 6942,
			"text": "Saıd b. Zeyd şöyle demiştir: \"Yemin olsun ki Ömer'in İslam'a girdiğim için beni sıkıştırıp, esir gibi horlayarak bir iple bağladığı hala gözlerimin önündedir. Sizin Osman (b. Affan r.a.)'a yaptıklarınız yüzünden Uhud dağı çatlayıp, paramparça olsaydı, buna layık olurdu",
			"grades": [],
			"reference": {
				"book": 89,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6943,
			"arabicnumber": 6943,
			"text": "Habbab b. el-Eret şöyle anlatmıştır: Resulullah Sallallahu Aleyhi ve Sellem Kabe'nin gölgesinde kaftanına yaslandığı bir sırada kendisine \"Ya Resulallah! Bizim için Allah'tan yardım dileyemez misin? (Bunların zulmünden) kurtulmamız için AlIah'a dua edemez misin?\" dedik. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Sizden önceki ümmetler içinde öyle kişiler bulunmuştur ki, o kişi için yerde bir çukur kazıhr, kendisi o çukurun içine gömülürdü. Sonra büyük bir testere getirilir, başına konulur ve iki kısma ayrılırdı. Demir taraklar ile etinin altındaki kemiği ve sinirleri taranırdı da bu işkenceler o mu'mini dininden çevirmezdi. Allah'a yemin ederim ki şu İslam dini, artık kemale erecektir. Hatta o olacak ki bir süvari (tek başına) San'a'dan Hadramevt'e kadar (selametle) gidecek de Allah'tan başka hiçbir şeyden korkmayacaktır ve bir de (koyun sahibi ise) sadece koyununa kurt saldırmasından korkacaktır. Fakat sizler acele ediyorsunuz.\" Fethu'l-Bari Açıklaması: \"Dövülmeyi, öldürülmeyi ve aşağılanmayı küfre tercih etme.\" Bu konuya bundan önceki başlıkta işaret edilmişti. Orada Hz. Bilal'in kelime-i küfrü telaffuz etmektense, dayak yemeye ve horlanmaya razı olan kişilerden olduğunu söylemiştik. Bu başlık altında adı geçen Habbab ve onunla birlikte zikredilenler de aynı tavrı sergilemişlerdir. Ammar'ın anne-babası işkence altında can vermişlerdi. Bunlar sıhhat şartını taşımadıkları için müemf buna delalet eden rivayetle yetinmiştir ve bu konuda üç hadise yer vermiştirJ Birinci hadis \"Üç şey vardır ki kimde bulunursa imanın tadını almış olur\" hadisidir. Bu hadisin açıklaması Sahih'in baş taraflarında İman bölümünde geçmişti. İmam Buharl'nin başlığını bu hadisten seçmesi küfürden hoşlanmamakla ateşe girmekten hoşlanmamayı birbirine eşit tutmasındandır. Öldürülmek, dövülmek ve horlanmak bir mu'minin nazarında ateşe girmekten daha hafiftir. Netice olarak mu'min şiddeti tercih ettiği takdirde bunlar, küfürden daha hafiftir. Bu açıklamayı İbn Battal yapmış ve devamında şöyle demiştir: Bu hadis İmam Malik mezhebi müçtehidlerine delildir. İbnü't-T'in ise bilginler öldürülmeyi küfre tercih etme noktasında görüş birliği halindedirler diyerek onu tenkid etmiştir. Hadis küfrü telaffuz etmek, sabredip, öldürülmekten daha evladır diyenlere karşı delildir. Mühelleb'in bir grup bilginin bunu kabul etmediklerini ifade ettiği nakledilmiştir. Onlar delil olarak Allahu Teala'ın \"Ve kendinizi öldürmeyiniz\"(Nisa 29) ayetini delil olarak almışlardır. Oysa bu ayette onları destekleyecek bir taraf yoktur. Çünkü Allahu Teala o ayetin ardından \"Kim düşmanlık ve haksızlık ile bunu yaparsa (bilsin ki) onu ateşe koyacağız\"(Nisa 30) buyurmaktadır. Dolayısıyla Allahu Teala bir önceki ayetteki \"kendinizi öldürmeyiniz\" ifadesini bu şekilde kayıtlamaktadır. Allah'a itaat uğrunda kendisini helak eden kimse ne zalim ve ne de haddi aşmış olur. Bilginler cihad esnasında insanın kendini tehlikelere atmasının caiz olduğu noktasında icma etmişlerdir. \"Said b. Zeyd hadisinin isnadında bulunan Abbad, İbn Ebi'l-Awam' dır. Said -b. Zeyd ise İbn Amr b. Nufeyl olup, Ömer İbnü'l-Hattab b. Nufeyl'in amcasının oğlunun oğludur. Bu zatın hadisi Resulullah Sallallahu Aleyhi ve Sellem'in sıreti bölümünde \"Said b. Zeyd'in İslama'a girişi\" başlığıaltında daha önce geçmişti. Hadisin atılan başlığa uygunluğu gayet açıktır. Çünkü Said ve Hz. Ömer'in kızkardeşi olan eşi kafir olmaktansa, horlanmayı tercih ettiler. Hadisin atılan başlıkla ilişkisi böylece ortaya çıkmaktadır. Kirmanı şöyle demiştir: Bu başlık Hz. Osman' ın katillerinin isteklerine boyun eğmektense öldürülmeyi tercih etmesinden alınmıştır. Dolayısıyla bir kimsenin kafir olmaktansa öldürülmeyi tercih etmesi evleviyyetie caiz olur. Said'in eşinin adı Fatıma bintü'l-Hattab'dır. Fatıma rivayete göre Hz. Hatice'den sonra İslam'a ilk giren kadındır. Bazılarına göre Abbas'ın eşi Ümmü'lFadl ondan önce Müslüman olmuştur. İbn Battal şöyle demiştir: Bilginler küfre zorlanıp, öldürülmeyi tercih eden kimsenin Allah katında ruhsatı tercih edenden çok daha büyük ecir kazanacağı noktasında icma etmişlerdir. Küfrün dışındaki şeylere gelince, bir kimse sözgelimi domuz eti yemeye ve şarap içmeye zorlansa, bunlaı yapmak daha evladır. Bazı Malikiler ise şöyle demişlerdir: Tam tersine bunların dışında bir şeyi yemesiyasaklandığı takdirde sözü edilen şeyleri yemekle günaha girer. Çünkü böyle bir kimse öleceğinden korkup, ölü eti yemek zorunda kalıp, ancak yemeyenkimse gibi olmuştur",
			"grades": [],
			"reference": {
				"book": 89,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6944,
			"arabicnumber": 6944,
			"text": "Ebu Hureyre r.a. şöyle anlatmıştır: Mescidde bulunduğumuz bir sırada birden Resulullah Sallallahu Aleyhi ve Sellem yanımıza çıkageldi ve \"Yahudilerin yurduna yürüyünüz!\" diye buyurdu. Biz de onunla birlikte Beytü'l-Midras denilen yere vardık. Resulullah Sallallahu Aleyhi ve Sellem onlara doğru ayağa kalktı ve şöyle seslendi ve \"Ey Yahudi topluluğu! Müslüman olunuz, esenlik içinde kalınız\" dedi. Yahudiler cevaben \"Ey Ebü'l-Kasım! Sen tebliğ ettin!\" dediler. Resulullah Sallallahu Aleyhi ve Sellem onlara \"Ben ancak bunu istiyorum\" dedi. Sonra çağrısını ikinci kez yineledi. Yahudiler \"Ey Ebü'l-Kasım! Sen tebliğ ettin\" dediler. Resulullah Sallallahu Aleyhi ve Sellem onlara tebliğini üçüncü kez tekrar etti ve \"Şunu kesinlikle biliniz ki yeryüzü ancak Allah'a ve Resulüne aittir. Ben sizleri bu topraklardan çıkarmak istiyorum. Dolayısıyla sizden her kim kendi malından (taşıyamayacağı) bir şey olursa onu satsın. Aksi takdirde biliniz ki arz ancak Allah'a ve Resulüne aittir\" buyurdu. Fethu'l-Bari Açıklaması: \"Zorlanan ve benzeri durumda kalan kierin hak ve başka hususlardaki satışları.\" Hattab! şöyle demiştir: Ebu Abdullah 'cl-Buhari bu başlık altında zikredilen Ebu Hureyre hadisini zorlanan kimsenin satışının cevazına delil getirmiştir. Halbuki bu, darda kalanın satışına daha çok benzemektedir. Çünkü satışa zorlanan kimse istesin veya istemesin o satışı yapmaya sevkedilen kimsedir. Yahudiler arazilerini satmamış olsalardı, buna zorlanmayacaklardı, fakat onlar mallarına çok düşkün olduklarından onları satmayı tercih ettiler ve böylece mallarını satmak zorunda kalanlara benzediler ve bu halleriyle borca sıkışıp, malını satmak zorunda kalan kimse gibi oldular. Bu durumda yapılan satış caizdir, kişi buna zorlandığı takdirde caiz olmaz. Biz de şunu ekleyelim: İmam Buhari yukarıda kullandığı başlıkta sadece zorlanan kimseyle sınırlı kalmamış ve \"Zorlanan ve benzeri durumda kalan kimselerin hak ve başka hususlardaki satışları\" ifadesini kullanmıştır. Böylece onun başlığına darda kalan ,kimse de dahil olmuştur. Buhari bu ifadesiyle darda kalan kimsenin satışı sahih değildir diyenlere cevap vermiş olmaktadır. İbnü'l-Müneyyir şöyle der: İmam Buhart \"hak ve başka hususlardaki\" şeklinde başlık atmış ancak başlığın sadece birinci kısmı için hadis zikretmiştir. Buna onun \"hak\"tan maksadı borçtur \"başkası\"ndan maksadı ise bunun dışında satışı gerekli olan şeylerdir diye cevap verilmiştir. Çünkü Yahudiler borçları olmadıkları halde mallarını satmaya zorlandılar. Kirmi'mi \"hak\" kelimesinden maksat o bölgenin tahliyesi, \"başkası\" kelimesinden maksat ise suçlardır, \"hak\"tan maksat mali şeyler, \"başkası\"ndan maksat bölgenin tahliye edilmesidir demiştir. Biz de şunu ekleyelim: \"Başkası\" kelimesinden maksat borç olabilir. Bu durumda ifade genel anlamlı sözden sonra, özel anlamlı sözün getirilmesi şeklinde olur. Gayr-i mali bir sebep olarak zikredilen şekilde satış, sahih olduğuna göre mali bir sebep olarak borç sebebiyle satış evleviyede sahih olur. \"Beytü'l-Midras.\" Bu kelime \"ders\"ten türemedir. Maksat Yahudilerin büyükleridir. Bu beytin onun adına nispet edilmesi Yahudilerin kitaplarını okutanın kendisi olmasından dolayıdır. \"Ben ancak bunu istiyorum.\" Yani \"Müsıü.man olunuz\" ifadesiyle istediğim budur. Şayet siz benim size tebliğ ettiğimi itiraf ederseniz üzerimden sorumluluk düşer. \"Biliniz ki yeryüzü ... \" Bu cümleden maksat, bu konuda hüküm Allah'a ve Nebi'ine aittir. Çünkü o Allah adına tebliğde bulunmakta ve onun emirlerini yerine getirmektedir. \".......\" yani sizi buradan çıkarmak, burayı tahliye etmek istiyorum demektir",
			"grades": [],
			"reference": {
				"book": 89,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6945,
			"arabicnumber": 6945,
			"text": "Hansa binti Hizam el-Ensari'nin nakline göre \"Babası rızasını almaksızın kendisini evlendirmişti. Halbuki Hansa dul bir kadındı. Hansa Nebi Sallallahu Aleyhi ve Sellem'e gelerek bu nikahı reddetti",
			"grades": [],
			"reference": {
				"book": 89,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6946,
			"arabicnumber": 6946,
			"text": "Aişe r.anha şöyle anlatmıştır: Resulullah Sallallahu Aleyhi ve Sellem'e \"Ya Resulallah! Nikah akitleri hususunda kadınların görüşleri alınır mı?\" diye sordum. Bana \"Evet\" buyurdu. Ben \"(Ya Resulallah!) Bakirenin evleneceği kimse hakkında görüşüne başvurulursa utanır, susar\" dedim. Resulullah Sallallahu Aleyhi ve Sellem \"Onun sükutu iznidir\" buyurdu. Fethu'l-Bari Açıklaması: \"Dünya hayatının geçici menfaatlerini elde edeceksiniz diye namuslu kalmak isteyen cariyelerinizi fuhşa zorlamayın.\" Ayette cariyelerin \"namuslu kalmak istemeleri\" şeklinde kayıtlanmasının hikmeti şudur: Zorlama, ancak namuslu kalmak isteme ile gerçekleşir. Zira gönüllü ilişkiye giren kadına zorlanmış denmez. Buna göre ayeti şöyle anlamak gerekir: Dünya hayatının geçici menfaatlerini . elde edeceksiniz diye adetleri fuhuş yapmak olan cariyelerinizi fuhşa zorlamayın. Bu gerçek bazı müfessirler tarafından anlaşılmamış ve \"namuslu kalmak isteyen ... \" ifadesini bundan önceki \"aranızdaki bekarları evlendirin\" ayeti ile irtibatlandırmışlardır. Bu ayetle ilgili kalan açıklama iki başlık sonra gelecektir. İbn Battal şöyle demiştir: Çoğunluk, zorlanan kimsenin nikahının batıl olduğu kanaatine varmışlardır. Kt1feli fıkıh bilginleri ise buna cevaz vermişler ve \"Bir kimse bir kadınla on bin dirhem karşılığında evlenmeye zorlansa ve bu kadının mehr-i misli bin dirhem olsa bu nikah sahihtir ve o kişinin bin dirhem vermesi gerekir. Bunun dışındaki miktar batıl olur\" demişlerdir. İbn Battal şöyle devam eder: KOfe bilginleri fazla olan miktarı zorlama dolayısıyla iptal edince, aynı zorlama nedeniyle nikah da kökünden b atıl olmuş olur. Erkek nikaha razı olup, mehre zorlansa mesele üzerinde ittifak edilen mesele haline gelir. Bu durumda nikah akdi sahih olup, erkeğin gerdeğe girmekle birlikte belirlenen mehri vermesi gerekir. Erkek nikahlanmaya ve kadınla ilişkiye zorlansa kendisine had cezası uygulanmaz ve hiçbir şey vermesi gerekmez. Buna karşılık akde razı olmaksızın gönüllü olarak ilişkiye girse had cezası gerekir. İmam Buhari bu başlık altında iki hadise daha yer vermiştir. Bunlardan birisi Hansa binti Haddam hadisidir. Bu hadisin açıklaması Nikah bölümünde geçmişti",
			"grades": [],
			"reference": {
				"book": 89,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6947,
			"arabicnumber": 6947,
			"text": "Cabir r.a. şöyle anlatmıştır: Ensar'dan bir adam \"Ben öldükten sonra hürsün\" diye kölesini müdebber olarak azad etmişti. Halbuki bu kişinin o köleden başka hiçbir malı yoktu. Yaptığı butasarruf Resulullah Sallallahu Aleyhi ve Sellem'in kulağına gidince \"Bunu benden kim satın almak ister\" diye sordu. Bunun üzerine o köleyi Nuaym b. en\"Nahham 800 dirheme satın aldı. Hadisi rivayet eden ra vi şöyle devam etti: \"Ben Cabir'i 'o köle kıpti olup, evvelki yıl öldü' derken işittim. Fethu'l-Bari Açıklaması: \"Zorlama neticesinde köle bağışlama veya satmanın caiz olmadığı.\" Yani bu satış Ve hibe caiz değildir. Dolayısıyla köle o kimsenin mülkiyetinden çıkmaz. Bazı bilginler bu doğrultuda görüş beyan etmişlerdir. Buna göre müşteri o konuda adakta bulunsa bu caizdir yani adak, adağı yapan kimse hakkında geçerlidir. Zorlamayla birlikte yapılan satış sahihtir, hibe de böyledir. \".........\" yani onun nezdinde demektir. \"Za'm\" çoğunlukla \"söz\" anlamında kullanılır. \"Müdebber yaparsa da böyledir.\" Yani zorlama altında kölesini müdebber yapması geçerlidir. İbn Battal'ın nakline göre Muhammed b. Sahnun şöyle demiştir: Kufe fıkıh bilginleri zorlanan kimseninyaptığı satışın batıl olduğu noktasında çoğunluğa uymuşlardır. Bu, zorlamayla birlikte yapılan satışın mülkiyeti nakletmemesini gerektirir. Mühelleb şöyle der: Bilginler satış ve hibeye zorlama olduğu takdirde satış caiz değildir. Ebu Hanife'nin \"Müşteri buna inanırsa veya kölesini müdebber yaparsa bu caizdir. Kendisine bir şey bağışlanan da müşteri gibidir\" dediği nakledilmiştir. Ebu Hanife bu meseleyi fasit satışa mukayese ediyor gibidir. Çünkü onlar fasit satışta müşterinin tasarrufunun geçerli (nafiz) olduğunu söylerler",
			"grades": [],
			"reference": {
				"book": 89,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6948,
			"arabicnumber": 6948,
			"text": "İbn Abbas \"Ey iman edenler! Kadınlara zorla varis olmanız size helal değildir\"(Nisa 19) ayet-i kerimesinin nüzul sebebi hakkında şu açıklamayı yapmıştır: İslam'dan önce Arapların adeti şuydu: Bir erkek öldüğünde onun yakınları karısına, herkesten daha çok hak sahibi idi. İsterlerse aralarından biri o kadınla evlenir, isterlerse onu başkasıyla evlendirirler, dilerlerse o kadını kimseyle evlendirmezlerdi. Onlar bu kadın hakkında onun ailesinden daha çok söz sahibi idiler. İşte bu ayet, bu hususta indi. Fethu'l-Bari Açıklaması: \"Bir çeşit zorlama.\" İbn Battal'ın nakline göre Mühelleb şöyle demiştir: Bu başlıktan anlaşılan şudur: Kim bir kadını onun mirasına tamah ederek ölünceye kadar nikahı altında tutarsa bu miras Kur'an ayetiyle ona helal değildir. Ayetin mirasın helalolmadığı yolundaki bu ifadesi, zahiri hükme göre erkeğin ondan miras almasının sahih olmamasını gerektirmez",
			"grades": [],
			"reference": {
				"book": 89,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6949,
			"arabicnumber": 6949,
			"text": "Nafi'in nakline göre Safiye binti Ebu Ubeyd şöyle anlatmıştır: Tasarrufu halifeye ait kölelerden biri beşte bir ganimet kölelerinden bir cariyeyi cinsel ilişkiye zorlayarak bekaretini bozdu. Bunun üzerine Hz. Ömer ona zina cezası uygulayıp, sürgün etti. Fakat erkek kendisini ilişkiye zorladığı için o cariyeye sapa cezası uygulamadı. Zühri hür bir erkeğin bekaretini giderdiği bakire cariye hakkında şöyle dedi: Hakim bakire olan cariyenin bakire ve dul oluşu arasındaki değer farkını takdir eder ve o erkeğe sapa cezası verir. Dul cariye hakkında imamların hükümlerine göre bir para ödeme cezası yoktur, fakat erkeğe had cezası verilir",
			"grades": [],
			"reference": {
				"book": 89,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6950,
			"arabicnumber": 6950,
			"text": "Ebu Hureyre'nin nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"İbrahim Nebi Sallallahu Aleyhi ve Sellem eşi Sare ile hicret yolculuğuna çıkıp, onunla birlikte bir ülkeye girdi. Orada krallardan bir kral yahut zorbalardan bir zorba hükümdar vardı. Derken o hükümdar İbrahim'e 'yanındaki kadını bana gönder!' diye haberci yolladı. Bunun üzerine İbrahim, Sare'yi o hükümdara yolladı. Sare onun yanına varınca, hükümdar ona doğru harekete geçti. Sare kalkıp, abdest aldı ve namaza durdu. Namazın ardından i'\\lIah 'ımf Eğer ben sana ve Resu/üne iman ettimse benim üzerime şu kafiri musallat etme' diye dua etti. Bu dua ile o zalimin boğaz ı sıkıldı ve ayağıyla yere vurup, debelenmeye başladı. \" Fethu'l-Bari Açıklaması: \"Zinaya zorlanan kadına had cezasının gerekmediği.\" \"Kim onları zor altında bırakırsa, bilmelidir ki zorlanmalardan sonra Allah (onlar için) çok bağışlayıcı ve merhametlidir. \"(Nur 33) Yani onlara merhametlidir. Bağışlanmanın zorda kalan kadınlar için sözkonusu olması problemli görülmüştür. Çünkü bir günaha zorlanan kadın günahkar değildir ki bağışlansın. Buna şöyle cevap verilmiştir: Ayette sözü edilen zorlama şer'an itibar edilen zorlama olmayabilir. Belki de sözkonusu zorlama kadının mazur olabileceği sınırdan daha düşük olabilir ve bu durumda kişi günaha girer. Dolayısıyla hakkında bağışlanma ifadesi uygun düşer. Kadı Beydavı şöyle demiştir: Zorlama sorumlu tutulma ile çelişmez. Biz de şunu belirtelim: Ya da bağışlanma ve merhametin zikredilmesi, önceden bir günah işlenmiş olmasını gerektirmez. Ayette \"Her kim bunlardan yemeğe mecbur kalırsa, başkasının hakkına saldırmadan ve haddi aşmadan bir miktar yemesinde günah yoktur. Şüphe yok ki Allah çok bağışlayan, çokça esirgeyendir\"(Bakara 173) denilmektedir. Et-Tıbı şöyle demiştir: Bu ifadeden kadınları zorlayan erkeklere büyük bir tehdit olduğu anlaşılmaktadır. Bağışlanma ve rahmetin zikredilmesi, üstü kapalı bir dokundurmadır. İfadenin takdiri şöyledir: Ey kadınları zorlayanlar! Onlar zorlanmış birer kadın olarak Yüce Allah'ın rahmeti ve bağışlaması olmadığı takdirde hesaba çekileceklerine göre acaba sizin haliniz nice olacaktır! Bu ayetin yukarıda atılan başlıkla ilişkisine gelince, ayet zinaya zorlanan kadının günaha girmeyeceğini ifade etmektedir. Dolayısıyla ona bu durumda had cezası uygulamamak gerekir. Müslim'in Sahih'inde yer alan bir habere göre Cabir şöyle anlatmıştır: Abdullah b. Ubeyy'in Müseyke ve Ümeyme adında iki cariyesi vardı. Abdullah bunları zinaya zorluyordu. Bunun üzerine \"Cariyelerinizi fuhşa zorlamayinız\"(Nur 33) ayet-i kerimesi indi.(Müs!im, Tefsir) \"Beşte bir ganimet kölelerinden olan bir cariyeyi. .. \" Yani tasarrufu devlet başkanına ait olan beşte bir ganimet malından demektir. \"......\" fiili, onunla zina etti anlamına gelmektedir .. \"Onu cinsel ilişkiye zorlayarak bekaretini bozdu .. \" Bu kelime bekaret zarı anlamına gelen \"el-kıdda\" kökünden türemedir. İfade acariyenin bakire olduğunu göstermektedir. \"Hz. Ömer ona zina cezası uygulayıp, sürgün etti.\" Yani ona elli sapa vurdu ve altı ay sürgüne gönderdi. Çünkü erkek kölenin zina cezası, hürrün yarısı kadardır. Bu haberden Hz. Ömer'in kölenin hür gibi sürgüne gönderilebileceği kanaatinde olduğu anlaşılmaktadır. Bu konu HudCid bölümünde incelenmişti. \"Zührı hür bir erkeğin bekaretini giderdiği bakire J;ariye hakkında şöyle dedi\" Bu ifadedeki \"..........\" fiili bekaret bozma anl.9m1na gelmektedir. \".......\" yani bozulan bekareti \"hakem\" yani hakim, takdir eder. \"Değeri kadar.\" Hakim bu değerlendirmeyi bakirenin bekaretini izale eden kişiye yükler ve ona sopa cezası uygular. Bu şu demektir: Hakim cariyenin bekaretini bozan kişiden onun kıymeti oranında fiyatında meydana gelen eksikliği tazmin ettirir. Bu, onun bakire ve duloluşu arasındaki değer farkıdır. Zührl'nin ifadesinde geçen \"........\"= takdir eder\" anlamındadır. \"Sopa cezası verir\" ifadesi verilen değer farkının, sopa cezasına gerek bırakmadığı zannını ortadan kaldırmak maksadıyladır. \"Dul cariye hakkında imamların hükümlerine göre bir para ödeme cezası yoktur.\" Bu ifadedeki \"....... ğurm\".........:- ğaramet= para cezası\" anlamına gelmektedir. Ancak bu durumdaki erkeğe had cezası uygulanır. Buhari bundan sonra İbrahim ve Sare ile o zorba hükümdar hakkındaki Ebu Hureyre hadisinin bir kısmına yer vermektedir. Bu hadis geniş bir biçimde Enbiya bölümünde açıklanmıştı. İbnü'l-Müneyyir şöyle der: Esasen bu hadisin buradaki başlık altına katılması uygun değildi. Çünkü onun atılan başlıkla bir ilişkisi yoktur. Ancak Sare kralla başbaşa kaldığında o fiili işlemeye zorlandığı için kendisinden kınama düşmesi nedeniyle başlıkla münasebeti doğmuştur. Kirmanı tıpkı İbn Battal gibi düşünerek şöyle demiştir: Bu hadisin bu başlık altına sokulmasının gerekçesi şudur: Sare her türlü kötülüğü işlemekten masum olduğu ve o kralla başbaşa kaldığında sözkonusu fiili işlemeye zorlandığından dolayı kınanmadığına göre onun dışındaki kadınlar da zorlanarak kendileriyle zina edildiğinde had cezasına maruz kalmazlar. (Onemli bir bilgi:) Bilginler erkeğin zinaya zorlanmasının hükmünden söz etmemişlerdir. Çoğunluk, zinaya zorlanan erkeğe had cezası uygulanmayacağı görüşündedir. İmam Malik ve bir grup bilgin ise had cezası uygulanması görüşündedirler. Çünkü erkek lezzet almasa o ilişkiyi sürdüremez. Kendisini zorlayan ister hükümdar, ister başkası olsun farketmez. İmam Ebu Hanife'den nakledilen bir rivayete göre erkeği sultan ın dışında birisi zorlamışsa kendisine had cezası uygulanır. Ancak imameyn bu konuda kendisine muhalefet etmişlerdir. Malikiler gÖrüşlerine delil olarak şöyle bir akıl yürütmüşlerdir: Erkeğin ilişkiyi başarması ancak iç huzuru ve dinginlik halinde mümkün cilur. Zorlanan kimse ise böyle değildir. Çünkü o korkmaktadır. Ancak Malikilere bu görüşlerinin isabetli olmadığı ve cinsel ilişkinin ereksiyon (intişar) olmadan da tasavvur edilebileceği şeklinde cevap verilmiştir. Doğruyu en iyi Allahu Teala bilir",
			"grades": [],
			"reference": {
				"book": 89,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6951,
			"arabicnumber": 6951,
			"text": "Abdullah b. Ömer'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem. \"Müslüman, Müslümanın (din) kardeşidir. Müslüman Müslümana zulmetmez. Müslüman Müslümanı (başına gelen musibet esnasında) terk etmez. Her kim MüslümanarcJ:eşinin bir ihtiyacını giderirse Allah da onun ihtiyacını giderir\" buyurmuşfur..• :",
			"grades": [],
			"reference": {
				"book": 89,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6952,
			"arabicnumber": 6952,
			"text": "Enes b. Malik'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"Müslüman kardeşine zalim iken de, mazlum iken de yardım et!\" buyurdu. Bir kişi \"Ya Resulallah! Müslüman kardeş mazlum olduğu zaman ona yardım ederim, fakat o zalim olduğu zaman ona nasıl yardım edeceğim söyler misin!\" diye sordu. Resulullah Sallallahu Aleyhi ve Sellem \"Onu zulümden alıkoyarsın ya da zulmüne engel olursun. İşte bu ona yardım etmektir\" buyurdu. Fethu'l-Bari Açıklaması: \"Bir erkeğin arkadaşının öldürülmesinden endişe etmesi veya buna benzer bir zarar dolayısı ile onun kardeşi olduğuna yemin etmesi\" Bu şart cümlesine bağlanan hüküm daha sonra gelmektedir. \"Korku duyan her zorlanmış kişi de böyledir. Çünkü o kişi\" yani Müslüman \"yeminiyle o kimseden zalimi ve zulmü savuşturur, onun önünde çarpışır ve onu• desteksiz bırakmaz.\" İbn Battal şöyle der: İmam Malik ve çoğunluğun görüşüne göre etmediği takdirde din kardeşinin öldürülmesi tehdidi ile yemine zorlanan bir kimse, yemin ettiği takdirde bu yemini geçerli değildir. \"Bir kimse mazlumun önünde çarpışsa (bu sırada zalimi öldürse) ona diyet ve kısas yoktur.\" Davudı şöyle der: Buhari'nin demek istediği böyle bir kimseye kısas ve diyet olmadığıdır. Diyete \"erş\" denilir. Biz de şunu ekleyelim: En uygun olanı Buharl'nin sözündeki \".......\" ifadesinin tekid olduğudur ya da \"diyet\"e \"kaved\" denilmiştir. İbn Battal şu açıklamayı yapar: Bilginler öldürüleceğinden korktuğu bir kimseyi savunmak için çarpışan ve bu sırada saldırganı öldüren kişi hakkında buna kısas veya diyet gerekip gerekmeyeceği konusunda ihtilaf etmişlerdir. Bir grup bilgin böyle bir kimseye \"MüslümanMüslümanı (başına gelen musibet esnasında) terk etmez\" hadisiyle ondan sonraki \"Müslüman kardeşine yardım et\" hadisi dolayısıyla hiçbir şey gerekmez demişlerdir. Hz. Ömer'in görüşü bu doğrultudadır. Bir başka grup bilgin ise böyle bir kimseye _ diyet gerekir demişlerdir. Bu görüş Klife bilginlerine aittir. Bu konuda tercihe değer olan İbn Battal'ın \"Mazlumu kurtarmaya gücü yeten kimse olanca gücüyle zalimi etkisiz hale getirmekle yükümlüdüL Mazlumu savunurken zalimi öldürmek niyetiyle hareket etmez. Sadece onu etkisiz hale getirmeye niyet eder. Zalimi etkisiz kılarken onu öldürmek durumunda kalırsa, o zalim in kanı hederdiL Bu durumda kişinin kendi canını savunmasıyla bir başkasını savunması arasında fark yoktur\" şeklindeki görüşüdür. \"Bir kimseye kendisini zorlamakta olan bir zalim tarafından şarap içeceksin veya ölmüş hayvan eti yiyeceksin ... denilse, o kişinin bunları yapması caizdiL Çünkü Nebi Sallallahu Aleyhi ve Sellem \"Müslüman Müslümanın kardeşidir\" buyurmuştur.\" KirmEml şöyle der: Hadisteki \"akdi çözme\" ifadesinden maksat, onu fesh etmektir. \"Kardeş\"in \"İslam\" kelimesiyle kayıtlanması, yakın ve akrabadan daha genelolmasını sağlamak içindir. \"c.!.lll'; •..••.•••. /' yani kişinin babasını ve kardeşini kurtarmak için bütün bunları yapması caizdir. İbn Battal özet olarak şöyle der: İmam Buharl'nin demek istediği şudur: Herhangi bir günahı işlemezse veya üzerinde hiçbir borç yokken filan kimseye borcu olduğunu itiraf etmezse ya da gönül rızası olmadan bir bağışta bulunmazsa veya talak ve ıtak gibi bir akdi rızası olmadığı halde çözmezse babası veya din kardeşi öldürülmekle tehdit edilen bir kimse babasını ve din kardeşini o zalimden kurtarmak için tehdit edildiği şeylerin tümünü yapabiliL \"Bazı bilginler şöyle derler: Bir zorba zalim tarafından herhangi bir kimseye mutlaka şarap içeceksin veya muhakkak ölmüş hayvan eti yiyeceksin dese ... \" İbn Battal bu cümleyi şöyle açıklar: Zalimin biri bir kimseyi öldürmek istese ve o kişinin mesela çocuğuna şayet içki içmez veya ölmüş hayvan eti yemezsen babanı öldürürüm dese yine bunun gibi oğlunu veya yakın akrabanı öldürürüm dese de o kişi de istenileni yapsa, çoğunluğa göre günaha girmez. İmam Ebu Hanife ise \"Günaha gireL Çünkü darda kalmış değildir. Zira zorlama başkasına değil, bizzat insanın kendisine yöneldiğinde geçerli OIUL Böyle bir kimsenin başkasına saldıranı etkisiz hale getirmek için Allah'a isyan etme hakkı yoktur. Tam tersine Allah zalime soracak, oğlunu hesaba çekmeyecektiL Çünkü oğlu ona yapılan saldırıyı işlenmesi helal olmayan bir fiili yapmadıktan sonra önlemeyi başaramamıştır\" demiştir. İbrahim en-Nehaı \"Yemin veren zalim ise itibar yemin edenin niyetinedir, yemin veren mazlum ise itibar edilecek olan yemin verenin niyetidir demiştir.\" İbn Battal şöyle der: Nehal'nin bu ifadesi, ona göre geçerli olanın daima mazlumun niyeti olduğunu göstermektedir. İmam Malik ve çoğunluk da bu kanaattedir. İmam Ebu Hanıfe'ye göre yeminlerde daima yemin edenin niyeti geçerlidiL Biz de şunu vurgulayalım: İmam Şafii'nin görüşüne göre yemin hakimin huzurunda yapılıyorsa, hakimin niyeti esastır. Bu durumda hakimin niyeti hak sahibinin niyeti demek blur. Hüküm meclisi dışında ise yemin edenin niyeti geçerlidir. İbn Battal şöyle der: Yemin veren kimsenin mazlum olması şöyle düşünülebilir: Yemin veren kişinin birisinde hakkı vardır ve o kişi bunu inkar etmektedir ve hak sahibinin de elinde herhangi bir beyyine ve delil yoktur ve karşı tarafın yemin etmesini istemektedir. Bu durumda geçerli olan, yemin edenin değil, ettirenin niyetidir. Bu konuda tevriyenin (açığa vurmadığı bir şeyi kastetmek) de herhangi bir faydası yoktur. Bundan sonra Buhari \"Müslüman Müslümanın kardeşidir\" şeklindeki merfu İbn Ömer hadisi zikreder. Bu hadis açıklamasıyla birlikte Meza!im bölümünde geçmişti",
			"grades": [],
			"reference": {
				"book": 89,
				"hadith": 13
			}
		}
	]
}