{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"9": "Times of the Prayers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 522,
			"arabicnumber": 522,
			"text": "",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 523,
			"arabicnumber": 523,
			"text": "(Ebu Cemre İbn Abbâs'tan şöyle nakletmiştir: \"Abdulkaysoğullarının heyeti, Allah Rasûlü'ne gelip: 'Biz Rabîa' kabilesinin bir koluyuz. Buraya ancak haram aylarda gelebiliriz. O halde bize öyle şeyler emret ki, onlara tutunalım ve buraya gelmeyen kabilemiz mensubu kimseleri buna davet edelim' dediler. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Size şu dört şeyi emrediyorum: a) Allah'a iman. (Allah Resulü bunu şöylece açtklamıştır:) Yani, Allah'tan başka ilâh olmadığına ve benim Allah'ın elçisi olduğuma şehadet etmek. b) Namaz kılmak. c) Zekat vermek. d) Ganimet olarak elde ettiklerinizin beşte birini bana vermek. Şu dört şeyi de size yasaklıyorum: a) Dübâ: Su kabağı b) Hantem: Sırlı küp c) Mukayyar ziftli kap. d) Nakîr: Hurma ağacı kütüğünden oyularak yapılan kap",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 524,
			"arabicnumber": 524,
			"text": "Cerîr bin Abdullah (r.a.)'ın şöyle dediği nakledilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem'e namazı kılmak, zekatı vermek ve her müslümana nasihat etmek üzere biat ettim. Tekrar: 57",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 525,
			"arabicnumber": 525,
			"text": "A'meş, Şakîk kanalıyla Huzeyfe'nin şöyle dediğini nakletmiştir: \"Ömer (r.a.)'in yanında oturuyorduk. Bize: 'Hanginiz Rasulullah Sallallahu Aleyhi ve Sellem'in fitne hakkında söylediğini hafızasında tutuyor?' diye sordu. 'Ben. Hem de nasıl buyurmuşsa öylece aklımda tutuyorum' diye atıldım. Bu konuda çok cesursun' dedi. Fitne hakkındaki Kişi'nin ailesi, malı, çocuğu ve komşusu hakkında bulaşacağı fitneye (günaha) kıldığı namaz, tuttuğu oruç, verdiği zekat ve yaptığı emri bi'l-ma'ruf nehy ani'l-münker keffâret olur.' Hadisini söyledim. Ömer (r.a.): 'Bunu kasdetmemiştim. Denizin dalgalanması gibi kabaracak fitneyi kast etmiştim' dedi. Ben de: 'O fitne, sana zarar vermeyecek. Seninle onun arasında kapalı bir kapı var\" diye cevap verdim. Ömer (r.a.),: 'O kapı açılacak mı, yoksa kırılacak mı?' diye sordu. Ben de: 'Kırılacak' dedim. Bu defa: 'O zaman bir daha asla kapanmayacak' dedi. Biz, 'Ömer kapıyı biliyor muydu?' diye sorduk. Huzeyfe, 'Evet, tıpkı önceki gün, bu geceyi bildiği gibi biliyordu. O'na söylediklerimde hiç yalan yoktu' diye cevap verdi. Kapının kim olduğunu Huzeyfe'ye sormaktan çekindik. Bu yüzden Mesrûk'a gidip sormasını emrettik. O da sordu. Huzeyfe şöyle cevap verdi: Kapı Ömer'dir. Tekrar: 1435, 1895, 3586, 7096",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 526,
			"arabicnumber": 526,
			"text": "İbn Mes'ud'dan şöyle nakledilmiştir: \"Adam'ın biri, bir kadın'ı öpmüş. Sonra Rasulullah Sallallahu Aleyhi ve Sellem'e gelip bunu haber vermişti. Bunun üzerine, 'Gündüzün iki ucunda, gecenin de ilk saatlerinde namaz kıl. Çünkü iyilikler kötülükleri (günahları) giderir [Hud 114] âyeti nazil oldu. Adam, 'Ya Resulallah! Bu benim için mi geçerli ?' diye sordu. Nebi Sallallahu Aleyhi ve Sellem de: Bütün ümmetim için geçerlidir' buyurarak cevap verdi. Tekrar: 4687. Diğer tahric: Müslim, Tevbe; Tirmizi Tefsir",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 527,
			"arabicnumber": 527,
			"text": "Abdullah'tan şöyle nakledilmiştir: Allah Resûlü Sallallahu Aleyhi ve Sellem'e, amellerin hangisinin Allah'a daha sevimli olduğunu sordum. O da, Vaktinde kılınan namaz' diye cevap verdi. 'Sonra hangisi?' diye sordum. Bu defa: 'Ana-baba'ya iyilik etmek' diye cevap verdi. 'Bundan sonra hangisi?' diye sordum. Bu kez, Allah yolunda cihad etmek' diye cevap verdi. Bana bunları anlattı. Eğer daha fazla soru sorsaydım, elbette cevabını verirdi. Tekrar: 2782, 5970, 7534",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 528,
			"arabicnumber": 528,
			"text": "Ebu Hureyre r.a.'den şöyle nakledilmiştir: Nebi Sallallahu Aleyhi ve Sellem: Siz'den birinizin kapısının önünden günde beş kez yıkandığı bir nehir aksa, ne dersiniz bu yıkanma onun üzerinde bir kir bırakır mı?\" diye sordu. Ashâb-ı kiram, \"Kir'den eser bırakmaz\" diye cevap verdi. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Beş vakit namaz da böyledir. Onlar sayesinde Allah, günahları siler.\" Diğer tahric: Tirmizi Emsal; Müslim, Mesacid",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 529,
			"arabicnumber": 529,
			"text": "Enes İbn Mâlik (r.a.): \"Nebi Sallallahu Aleyhi ve Sellem. döneminde yapılan uygulamaların hiç biri kalmadı\" demiştir. Etrafındakiler \"Ya namaz?\" diye sorunca şöyle cevap vermiştir: \"Namazla da oynamadınız mı",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 530,
			"arabicnumber": 530,
			"text": "Abdulaziz'in kardeşi Osman İbn Ebî Ravvad'dan şöyle nakledilmiştir: \"Zührî'nin şöyle dediğini işittim: Şam'da bulunduğu bir sırada Enes İbn Mâlik'in yanına gittim. O esnada ağlıyordu. 'Neden ağlıyorsun?' diye sordum. O da şöyle cevap verdi: Benim yetiştiğim dönemde şu namaz dışında bir şey kalmamıştı. Şimdi bakıyorum o da yozlaştırıldı",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 531,
			"arabicnumber": 531,
			"text": "Enes İbn Malik Nebi (Sallallahu aleyhi ve Sellem)’in şöyle buyurduğunu nakletmiştir: \"Sizden biri namaz kıldığı zaman, Rabbine münacatta bulunur.'O anda O'na en yakın bir durumdadır. O halde bu kişi sağ tarafına tükürmesin. Ancak sol ayağının altına tükürebilir.\" Saîd, Katâde'den şöyle nakletmiştir: \"İleriye doğru ve ön tarafına tükürmesin. Ancak sol tarafına veya ayaklarının altına tükürebilir.\" Şu'be şöyle demiştir: \"Namaz kılan ne ön tarafına ne de sağ tarafına tükürür. Sol tarafına veya ayağının altına tükürür.\" Humeyd Enes kanalıyla Nebi s.a.v.'in şöyle buyurduğunu nakletmiştir: \"Ne önüne ne de sağına tükürür. Anca soluna veya ayağının altına tükürebilir",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 532,
			"arabicnumber": 532,
			"text": "Enes İbn Malik Nebi (Sallallahu aleyhi ve Sellem)’in şöyle dediğini nakletmiştir: \"Secdeye gittiğiniz zaman itidalli olunuz. Secdeye giden kişi, köpek gibi kollarını yaymasın. Eğer biri tükürmek zorunda kalırsa, önüne ve sağ tarafına tükürmesin. Çünkü o, Rabbine münacat ediyordur",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 534,
			"arabicnumber": 534,
			"text": "",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 535,
			"arabicnumber": 535,
			"text": "Ebu Zer' (r.a.)'den şöyle nakledilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem'in müezzini öğle ezanını okumaya başladı. Resulullah Sallallahu Aleyhi ve Sellem: 'Serin vakte bırak! Serin vakte bırak!1 veya Bekle!, bekle!' diye seslendi. Sonra da şöyle buyurdu: \"Havanın aşırı derecede sıcak olması, cehennem ateşinin kaynamasından ileri gelir. O halde, hava aşırı derecede sıcak olunca, namaz'ı serin vakte erteleyin! Ebu Zer şöyle demiştir: Tepelerin gölgesini görünceye kadar namazı ertelerdik. Tekrar: 539, 629, 3258",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 537,
			"arabicnumber": 537,
			"text": "",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 538,
			"arabicnumber": 538,
			"text": "Ebu Saîd Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmiştir: \"Öğle namazını serinlik düşünce kılın! Zira hava'nın aşırı sıcak olması, cehennemin kaynamasından ileri gelir. Tekrar: 3259",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 539,
			"arabicnumber": 539,
			"text": "Ebu Zer' el-Ğıfarî'den şöyle nakledilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem ile birlikte bir seferde idik. Müezzin öğle ezanını okumak İstedi. Allah Resulü (Sallallahu Aleyhi ve Sellem): 'Serinlik düşünceye kadar bekle!' buyurdu. Bir müddet sonra müezzin, tekrar ezan okumak istedi. Resulullah Sallallahu Aleyhi ve Sellem yine: 'Serinlik düşünceye kadar bekle!' buyurdu. Nihayet tepenin gölgesinin uzadığını gördüğümüz bir vakitte (müezzin ezan okudu).\" İbn Abbâs demiştir ki; gölge düşer kelimesi, yani güneş batıya doğru kayar manasına gelir. Diğer tahric: Tirmizi Salat; Ebû Dâvûd, Salat",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 540,
			"arabicnumber": 540,
			"text": "Enes İbn Mâlik (r.a.)'den şöyle nakledilmiştir; \"Güneş tam tepe noktasına geldikten sonra batıya doğru meyletmeye başladığı bir sırada Nebi Sallallahu Aleyhi ve Sellem evinden çıkıp öğle namazını kıldırdı. Sonra minbere çıkıp, kıyametten bahsetti. O gün meydana gelecek büyük olayları anlattı. Sonra: 'Kim bana bir soru sormak istiyorsa, sorsun! Burada bulunduğum sürece sorduğunuz bütün sorulara cevap vereceğim' dedi. insanlar pek içli içli ağlamaya başladılar. Nebi Sallallahu Aleyhi ve Sellem de: 'Bana sorun!' diye birkaç kez hitabını yeniledi. Nihayet Abdullah İbn Huzâfe es-Sehmî çıkıp 'Benim babam kim?' diye sordu. Nebi Sallallahu Aleyhi ve Sellem Huzâfe'dir' dîye cevap verdi. Sonra: 'Bana sorun!' diye birkaç kez daha hitabını yeniledi. Bu esnada Ömer dizlerinin üzerinde durup 'Rab olarak Allah'tan, din olarak İslam'dan, Nebi olarak da Muhammed'den razı olduk' dedi. Resulullah Sallallahu Aleyhi ve Sellem bir müddet sustu, sonra şöyle buyurdu; \"Biraz önce cennet ile cehennem şu duvar üzerinde bana gösterildi. Cennetten daha hayırlı, cehennemden de daha kötü bir şey görmedim",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 541,
			"arabicnumber": 541,
			"text": "Ebu Berze'den şöyle nakledilmiştir: Nebi Sallallahu Aleyhi ve Sellem Bizden biri yanı başındaki arkadaşını tanıdığı kadar aydınlık olunca sabah namazını kıldırırdı. Fatiha'dan sonra atmış ile yüz âyet arasında Kur'an okurdu. Öğle namazını ise, güneş en yüksek konuma geldikten sonra batmaya doğru meylettiği zaman kıldırırdı. İkindi namazını öyle bir zamanda kıldırırdı ki, namazdan sonra bizden biri 'Medine'nin en ücra köşesine gidip geldiği halde güneş hâlâ batmamış olurdu. Akşam namazı hakkında ne söylediğini unuttum deniştir. {Ebu Berze) 'Yatsı namazını İse, gecenin 2/3'üne kadar geciktirmekte bir sakınca görmezdi' demiştir. Bir başka seferinde ise 'Gece yarısına kadar te'hirde sakınca görmezdi' demiştir. Muaz, Şu'be'nin şöyle dediğini nakletmiştir: 'Bir defasında onunla karşılaştım, gecenin 1/3'üne kadar geciktirmekte sakınca görmezdi' demiştir. Tekrar: 547, 568, 599, 771",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 542,
			"arabicnumber": 542,
			"text": "Enes İbn Mâlikten şöyle nakledilmiştir. \"Rasulullah Sallallahu Aleyhi ve Sellem'in arkasında öğlenin en sıcak anlarında na­maz kıldığımız zaman, sıcaktan korunmak için elbiselerimizin üzerine secde ederdik",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 543,
			"arabicnumber": 543,
			"text": "İbn Abbâs'tan şöyle nakledilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem Medine'de öğle İle ikindi namazını birlikte sekiz rekat, akşam ile yatsı namazını da yedi rekat olarak kıldırmıştır.\" Ravilerden Eyyub kendisinden önceki râvî Câbir'e Bu olay yağmurlu bir gecede vaki olmuş olabilir mi?' diye sormuş, o da 'Muhtemelen' diye cevap vermiştir. Tekrar: 562, 1174",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 544,
			"arabicnumber": 544,
			"text": "Hişam babası (Urve) kanalıyla Âişe (r.anha)'nın şöyle dediğini nakletmiştir: \"Nebi Sallallahu Aleyhi ve Sellem güneş ışıkları odama girmeye devam ettiği bir sırada, ikindi namazını kılardı",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 545,
			"arabicnumber": 545,
			"text": "Âişe(r.anha): Rasûlüllah (sallallahü aleyhi ve sellem) ikindi namazını henüz Âişe'nin hücresinde güneş varken ve gölge Âişe'nin hücresinden yükselmeden kılardı, demiştir",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 546,
			"arabicnumber": 546,
			"text": "Aişe (r.anha) şöyle demiştir: \"Güneş ışıkları odama vururken, henüz gölgenin de uzamadığı bir vakitte Nebi Sallallahu Aleyhi ve Sellem ikindi namazını kılardı",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 547,
			"arabicnumber": 547,
			"text": "Seyyar İbn Selâme'den şöyle nakledilmiştir: \"Babamla birlikte Ebu Berze el-Eslemî'nin yanına gittik. Babam ona 'Rasulullah Sallallahu Aleyhi ve Sellem farz namazları nasıl ne zaman kılardı?' diye sordu. O da şöyle cevap verdi: 'Güneş en yüksek noktaya çıktıktan sonra batı istikametine doğru meyletmeye başlayınca sizin ilk namaz dediğiniz öğle namazını kılardı. Asr / İkindi namazını kıldığı zaman, bizden biri Medine'nin en ücra köşesinde bulunan evine gittiği zaman hâlâ güneş parlamaya devam ederdi. (Ravi Ebu Berze'nin) Akşam namazı hakkında söylediklerini unuttum' (demiştir); Sizin 'Ateme' dediğiniz yatsı namazını ise, geciktirirdi. Yatsı namazından önce uyumayı, bu namazdan sonra ise konuşmayı hoş karşılamazdı. Sabah namazını bitirdiği zaman herkes yanı başında oturanı tanırdı. Sabah namazında altmış ile yüz âyet arasında Kur'an okurdu",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 548,
			"arabicnumber": 548,
			"text": "Enes İbn Mâlik'ten şöyle nakledilmiştir: \"Biz İkindi namazını kılardık. Biri Amr İbn Avf oğullarının bulunduğu bölgeye gittiği zaman onların ikindi namazını kıldığını görürdü. Tekrar: 550, 551, 7229",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 549,
			"arabicnumber": 549,
			"text": "Ebu Bekir İbn Osman İbn Sehl İbn Huneyf, Ebu Ümâme'nin şöyle dediğini işittiğini nakletmiştir: \"Ömer İbn Abdülaziz ile birlikte öğle namazını kıldık. Sonra çıkıp Enes İbn Mâlik'in yanına gittik. O esnada ikindi namazını kılıyordu. Ona Amca! Hangi namazı kılıyorsun?' diye sordum. O da şöyle cevap verdi: İkindi namazını kılıyorum. Biz, Nebi Sallallahu Aleyhi ve Sellem ile birlikte böyle namaz kılardık",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 550,
			"arabicnumber": 550,
			"text": "Zührî, Enes İbn Mâlik'in kendisine şöyle naklettiğini bildirmiştir: \"Nebi Sallallahu Aleyhi ve Sellem ikindi namazını güneş yüksekte ışık saçmaya devam ederken kılardı. Hatta biri namazı kıldıktan sonra Medine'nin Avâlî'sine gidip gelir de, güneş hala ışık saçmaya devam ederdi. Medine'nin Avalî'sinin bir kısmı, yaklaşık olarak dört mil uzaklıkta idi",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 551,
			"arabicnumber": 551,
			"text": "Enes İbn Mâlik'in şöyle dediği nakledilmiştir: \"Biz ikindi namazını kılardık. Sonra içimizden biri Kuba'ya gidip dönerdi. Bu esnada güneş, hâlâ yüksekte bulunurdu",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 552,
			"arabicnumber": 552,
			"text": "İbn Ömer (r.a.)'den Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğu nakledilmiştir: \"İkindi namazını kaçıran kimse, ailesi helak olmuş, serveti batmış kimse gibidir.\" Diğer tahric: Tirmizi Salat; Nesâî, Mesâcid",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 553,
			"arabicnumber": 553,
			"text": "Ebu Melîh'ten şöyle nakledilmiştir: \"Bulutlu bir günde bir gazvede Büreyde ile beraberdik. Bize: 'İkindi namazını erken kılın!' diye talimat verdi. Sonra Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletti: Kim ikindi namazını terk ederse, ameli boşa gider. Tekrar: 594",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 554,
			"arabicnumber": 554,
			"text": "Cerîr (r.a.)'den şöyle nakledilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem ile birlikteydik. Bir gece ay'a (dolunaya) baktı ve şöyle buyurdu: Şu ay'ı gördüğünüz gibi kuşkusuz Rabbiniz'i de âhirette göreceksiniz. Onu görme konusunda hiç haksızlığa uğramayacaksınız. Güneşin doğuşundan ve batışından önceki namazları geçirmemeyi başarabîliyorsanız, bunu yapın!\" Sonra Cerîr, \"Güneşin doğmasından önce de, batmasından önce de Rabbini hamd ile tesbih et! [Tâhâ 130.] âyetini okudu. İsmail şöyle dedi: \"Bunu yapın ve sakın bir vakit namazı geçirmeyin! Tekrar: 573, 4851, 7434, 7435, 7436. Diğer tahric: Tirmizi Cennet; Müslim, Mesacid dede tahric ettiler",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 555,
			"arabicnumber": 555,
			"text": "Ebu Hureyre (r.a.) Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmiştir: \"Bazı melekler gece, bazıları da gündüz nöbetleşe yanınıza gelir. Bunlar, sabah ve ikindi namazlarında bir araya gelirler. Daha sonra gece sizin yanınızda olanlar Hak Teâlâ'nın huzuruna çıkar. Allah Teâlâ kullarını en iyi kendisi bilmesine rağmen yine de onlara 'Kullarımı nasıl bıraktınız?' diye sorar. Onlar da: Yanlarından ayrılırken namaz kılıyorlardı. Yanlarına vardığımızda da namaz kılıyorlardı' diye cevap verirler. Tekrar: 3223, 7429, 7486",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 556,
			"arabicnumber": 556,
			"text": "Ebu Hureyre (r.a.), Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmiştir: \"Siz'den biri, güneş batmadan önce ikindi namazının bîr secdesini yapmış ise, namazını tamamlasın. Aynı şekilde güneş doğmadan sabah namazının bir secdesini yapmış ise, namazını tamamlasın. Tekrar: 579, 580. Diğer tahric: Tirmizi Salat; Nesâî, Mevâkît",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 557,
			"arabicnumber": 557,
			"text": "Salim bin Abdullah, babasının kendisine Nebi Sallallahu Aleyhi ve Sellem'in Şöyle buyurduğunu naklettiğini bildirmiştir: \"Önceki ümmetlere nispeten sizin dünyada kalmanız, (tam güne göre) ikindi namazı İle güneşin batması arasında geçen süre kadardır. Tevrat ehline, Tevrat verildi. (Onun içindekilerle) amel etmeye başladılar. Gün ortasına gelince artık çalışamaz oldular. Yine de, birer kırat ile ödüllendirildiler. Sonra incil ehline incil verildi. İkindi namazına kadar çalıştılar. Sonra onlar da çalışmaktan aciz kaldılar. Yine de birer kırat ile ödüllendirildiler. Bize de Kur'an verildi. Güneş batıncaya kadar onunla amel ettik. Bize ikişer kırat, ikişer kırat verildi. Bunun üzerine Ehl-i kitap: Ey Rabbimiz, bunlara ikişer kırat ikişer kırat verdin. Bize ise birer birer verdin. Oysa biz onlardan daha çok çalıştık' dediler. Hak Teâlâ da onlara: 'Ücretiniz konusunda size en ufak bir haksızlık yaptım mı?' diye sordu. Onlar: Hayır' deyince şöyle buyurdu: Bu benim lütfumdandır. Lütfumu da dilediğime veririm. Tekrar: 2268, 2269, 3459, 5021, 7467, 7533 Diğer tahric: Tirmizi Emsal de tahric etti",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 558,
			"arabicnumber": 558,
			"text": "Ebu Musa Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletti: \"Müslümanlar ile Yahudi ve Hıristiyanlar'ın durumu şu örneğe benzer: Adamın biri, kendisi için gece vaktine kadar çalışmak şartıyla bir grup işçi ile anlaşır, işçiler öğlene kadar çalışır, sonra adama, 'Bizim senin vereceğin ücrete ihtiyacımız yok' deyip işi bırakırlar. Bunun üzerine adam, başka bir grup ile anlaşır. Onlara işin geri kalan kısmını tamamlayın, size ücretin tamamını vereyim' der. Onlar da, ikindi namazına kadar çalışıp adam'a, 'Çalıştığımız senin olsun! (ücret falan istemiyoruz)' derler. Nihayet adam, güneş batıncaya kadar günün geri kalan kısmında çalışan bir grupla anlaşır. Bu grup, öncekilerin ücretini de tam olarak alır. Tekrar: 2271",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 559,
			"arabicnumber": 559,
			"text": "Râfi' bin Hadîc (r.a.) şöyle demiştir: \"Nebi Sallallahu Aleyhi ve Sellem ile birlikte akşam namazını kılardık. Birimiz namazdan çıktıktan sonra (attığı) ok'un nereye düştüğünü görecek kadar, gün aydınlık olurdu",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 560,
			"arabicnumber": 560,
			"text": "Cabir İbn Abdullah (r.a.)'den şöyle nakledilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem Öğle namazını öğlenin en sıcak olduğu zamanda, İkindi namazını güneş beyaz ışık saçarken, akşam namazını güneş batınca kıldırırdi. Yatsı namazında ise esnek davranırdı. Cemaatin toplandığını görünce hemen kıldırır, cemaatin ağırdan aldığını görünce o da, geciktirirdi. Sabah namazını ise, karanlıkta kıldırırdı. Tekrar: 565",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 561,
			"arabicnumber": 561,
			"text": "Seleme (r.a.) şöyle demiştir: \"Nebi Sallallahu Aleyhi ve Sellem ile akşam namazını, güneş batınca kılardık",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 562,
			"arabicnumber": 562,
			"text": "İbn Abbas (r.a.)'den şöyle nakledilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem akşam ve yatsı namazını birlikte yedi rekat olarak, öğle ile İkindi namazını ise yine birlikte sekiz rekat olarak kıldı",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 563,
			"arabicnumber": 563,
			"text": "Abdullah el-Müzenî Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmiştir: \"Bedeviler akşam namazınızın adı hususunda size baskı yapmasınlar! Zira onlar akşam namazına işâ derler",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 564,
			"arabicnumber": 564,
			"text": "Abdullah İbn Ömer r.a.'den şöyle nakledilmiştir: \"Bir gece Nebi Sallallahu Aleyhi ve Sellem, bize, halkın ateme olarak isimlendirdiği yatsı namazını kıldırdı. Namazı bitirdikten sonra bize yönelip şöyle dedi: Bu gecenizi gördünüz mü? Bu gecenizden sonraki yüz sene sonunda yeryüzünde yaşayan insanlardan hiç bir kimse hayatta kalmayacaktır",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 565,
			"arabicnumber": 565,
			"text": "Muhammed İbn Amr'dan şöyle nakledilmiştir: \"Câbir İbn Abdillah'a Nebi Sallallahu Aleyhi ve Sellem'in hangi vakitlerde namaz kıldığını sorduk. O da şöyle cevap verdi: Öğle namazını öğlen sıcağının kızgın olduğu vakitte, ikindi namazını güneş ışık saçmaya devam ettiği bir vakitte, akşam namazını farz olunca (güneş battığında farz olur), yatsı namazını ise cemaat çoğalırsa erken, az olursa geç bir vakitte, sabah namazını ise gece karanlığının sonunda kılardı",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 566,
			"arabicnumber": 566,
			"text": "Urve Aişe r.anha'nın kendisine şöyle haber verdiğini nakletmiştir: \"Bir gece Nebi Sallallahu Aleyhi ve Sellem yatsı namazını geciktirdi. Bu olay İslâm'ın henüz yayılmadığı bir dönemde vuku bulmuştu. Ömer (r.a.), 'Kadınlar ve çocuklar uyuyakaldı' deyinceye kadar Allah Resulü Sallallahu Aleyhi ve Sellem namaz kılmaya gelmedi. Sonra mescid'e gelip cemaat'e, Yeryüzünde sizin dışınızda kimse bu namazı beklemiyor' dedi. Tekrar: 569, 862, 864",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 567,
			"arabicnumber": 567,
			"text": "Ebu Musa'nın şöyle dediği nakledilmiştir; \"Benimle birlikte gemi İle Medine'ye gelen arkadaşlarımla birlikte Bakîu Buthân vadisine yerleştik. O esnada Nebi (Sallallahu Aleyhi ve Sellem) Medine'de idi. Yatsı namazını arkasında kılmak için her gece sıra kime gelmişse o grup Allah Resûlü'nün yanına giderdi. Ben ve arkadaşlarım Nebi Sallallahu Aleyhi ve Sellem'in namaza geldiği an'a rastladık. O gece Nebi Sallallahu Aleyhi ve Sellem'in bir işi vardı. Bu yüzden namazı gece yarısına kadar geciktirmişti. Daha sonra Nebi Sallallahu Aleyhi ve Sellem çıkıp cemaate namaz kıldırdı. Namazı bitirdikten sonra orada bulunanlara, 'Gitmek için acele etmeyin! Sizlere müjdem var. Şu an sizin dışınızda başka hiç kimsenin namaz kılmaması, Allah'ın size bahşettiği nimetlerden biridir' veya 'Şu an sizin dışınızda hiç kimse namaz kılmadı' buyurdu. (Bu hadisi Ebu Musa'dan nakleden râvî, onun, Allah Resûlü'nün hangi sözü söylediğini hatırlayamadığını söylemiştir). Ebu Musa olayı anlatmaya şöyle devam etti: Sonra evimize döndük, Rasûlullah Sallallahu Aleyhi ve Sellem'den duyduklarımız bizi mutlu etmişti",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 568,
			"arabicnumber": 568,
			"text": "Ebu Berze (r.a.)'den şöyle nakledilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem yatsı namazından önce uyumayı, yatsı namazından sonra konuşmayı sevmezdi",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 569,
			"arabicnumber": 569,
			"text": "Urve Aişe (r.anha)'nın şöyle dediğini nakletmiştir: \"Rasulullah Sallallahu Aleyhi ve Sellem yatsı namazını geciktirdi. Derken Ömer (r.a.), 'Haydi namaza! Kadınlar ve çocuklar uyumaya başladı' diye seslendi. Sonra Allah Resulü Sallallahu Aleyhi ve Sellem namaz kıldırmak için çıktı ve şöyle buyurdu: Yeryüzünde sizden başka bu namazı bekleyen yoktur.\" Ravi şöyle demiştir: \"O dönemde sadece Medine'de cemaatle namaz kılınırdı. İnsanlar, şafak kaybolduktan sonra gecenin üçte biri dolana kadarki zaman içinde bu namazı kılardı",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 571,
			"arabicnumber": 571,
			"text": "",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 572,
			"arabicnumber": 572,
			"text": "Enes İbn Mâlİk (r.a.)'den şöyle nakledilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem yatsı namazını gece yarısına kadar geciktirdi. Sonra namaz kıldırıp şöyle uyurdu: İnsanlar namaz kılıp uyudu. Siz ise, namazı beklediğiniz sürece namaz kılıyor gibisiniz.\" Buna ilave olarak İbn Ebî Meryem, Yahya İbn Eyyub ve Humeyd kanalıy¬la Enes'in şöyle dediğini nakletmiştir: \"O gece yüzüğünün parlaması hâlâ gözlemin önündedir",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 573,
			"arabicnumber": 573,
			"text": "Cerîr İbn Abdullah (r.a.)'dan şöyle nakledilmiştir: \"Dolunay gecesi ay'a baktığı zaman Nebi (Sallallahu Aleyhi ve Sellem) ile birlikteydik. O zaman şöyle buyurmuştu: Kuşkusuz sizler, şu ayı gördüğünüz gibi Rabbiniz'i göreceksiniz. Onu görme hususunda sîze haksızlık yapılmayacak. Eğer güneş doğmadan ve batmadan önceki namazları kılabiliyorsanız, bunları kılın!\" Sonra şu âyeti okudu: \"Güneşin doğmasından ve batmasından önce Rabbini övgü ile tesbih et! [Tâhâ 130]",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 574,
			"arabicnumber": 574,
			"text": "Ebu Bekir İbn Ebî Musa babası kanalıyla Allah Resulü (Sallallahu Aleyhi ve Sellem)'in şöyle dediğini nakletmiştir: \"iki serin vakitteki namazları kim kılarsa cennete girer",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 575,
			"arabicnumber": 575,
			"text": "Enes İbn Mâlik (r.a.)'den şöyle nakledilmiştir: \"Zeyd bin Sâbit'in Nebi Sallallahu Aleyhi ve Sellem ile birlikte sahur yaptıklarını, sonra da namaza durduklarını bana anlattı. Ona: 'Sabah namazı ile sahur arasında ne kadar zaman geçmişti?' diye sordum. O da: 'Elli ya da altmış âyet okunacak kadar bir zaman' diye cevap verdi. Tekrar: 1921",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 576,
			"arabicnumber": 576,
			"text": "Enes İbn Mâlik (r.a.)'den şöyle nakledilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem ile Zeyd İbn Sabit sahur yaptı. Sahurlarını tamamladıktan bir müddet sonra Allah Resulü (Sallallahu Aleyhi ve Sellem) namaz'a durdu. Peşi sıra biz de namaza başladık.\" \"(Raviler şöyle dedi:) 'Enes'e Nebi Sallallahu Aleyhi ve Sellem ile Zeyd'in sahur yapıp namaza başlamaları arasında ne kadar bir zaman geçti?' diye sorduk. Bize 'Bir adamın elli âyet okuyacağı kadar bir zaman' diye cevap verdi. Tekrar: 1134",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 577,
			"arabicnumber": 577,
			"text": "Ebu Hazim Sehl İbn Sa'd'ın şöyle dediğini işittiğini nakletmiştir: \"Ailemle birlikte sahur yapardım. Nebi Sallallahu Aleyhi ve Sellem ile sabah namazını kılmaya yetişmek için acele ederdim. Tekrar: 1920",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 578,
			"arabicnumber": 578,
			"text": "Urve İbn Zübeyr Âişe (r.anha)'nın kendisine şöyle haber verdiğini nakletmiştir: \"Müslüman kadınlar, mırt adı verilen örtüye bürünerek Nebi Sallallahu Aleyhi ve Sellem ile birlikte sabah namazına iştirak ederlerdi. Namaz bitince evlerine dönerlerdi. Gecenin karanlığından ötürü kimse onları tanımazdı",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 579,
			"arabicnumber": 579,
			"text": "Ebu Hureyre (r.a.) Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmiştir: \"Her kim güneş doğmadan önce sabah namazından bir rekat'a yetişirse, sabah namazına yetişmiş demektir. Her kim de, güneş batmadan önce ikindi namazına yetişirse, ikindi namazına yetiş­miş demektir",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 580,
			"arabicnumber": 580,
			"text": "Ebu Hureyre (r.a.) Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmiştir: Her kim namaz'ın bir rek'atına yetişirse, namaz'a yetişmiş demek­tir",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 581,
			"arabicnumber": 581,
			"text": "İbni Abbas (r.a.)'ın şöyle dediği nakledilmiştir: \"Bence aralarında, Müslümanların rızasını en fazla kazanan Ömer (r.a.)'in de bulunduğu, (adı, sıdk, emanet ve diyanet bakımından) insanların kendilerinden razı olduğu birçok kimse bana, Nebi Sallallahu Aleyhi ve Sellem'in sabah namazından sonra güneş ışıklarının doğmasına, ikindi namazından sonra da güneş batıncaya kadar namaz kılmayı yasakladığını bildirdi. Tekrar: 585, 589, 1192, 1629, 3273. Diğer tahric: Tirmizi Salat; Nesâî, Mevâkît",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 583,
			"arabicnumber": 583,
			"text": "Bize Yahya ibn Saîd, Hişâm'dan tahdîs etti. Hişâm: Bana Bâbam haber verdi, dedi. Bâbası Urve: Bana İbn Omer haber verdi, dedi. İbn Omer (radıyallahü anh) şöyle demiştir: Rasülullah (sallallahü aleyhi ve sellem):\"Kılacağınız namaz için güneşin doğma zamanını ve batma zamanını taharri (yani arayıp intihâb) etmeyiniz\" buyurdu",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 584,
			"arabicnumber": 584,
			"text": "Ebu Hureyre (r.a.)'den şöyle nakledilmiştir: \"Resulullah Sallallahu Aleyhi ve Sellem iki tür alışverişi, iki tür giyinmeyi ve iki namazı yasaklamıştır: Güneş doğuncaya kadar sabah namazından sonra, batıncaya kadar da ikindi namazından sonra namaz kılmayı, Sama şeklinde bürünmeyi ve bir elbise ile ihtibâ şeklinde örtünmeyi, münabeze ve mülameseyi yasaklamıştır",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 585,
			"arabicnumber": 585,
			"text": "İbn Ömer (r.a.) Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmiştir: \"Sizd'en biri güneşin batışı veya doğuşu esnasında namaz kılmaya kalkışmasın",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 586,
			"arabicnumber": 586,
			"text": "Ebu Saîd el-Hudrî (r.a.) Nebi Sallallahu Aleyhi ve Sellem'in şöyle dediğini işittiğini nakletmiştir: \"Güneş yükselinceye kadar sabah namazından sonra namaz kılınmaz! Güneş batıncaya kadar da, ikindi namazından sonra namazı kılınmaz! Tekrar: 1188, 1197, 1864, 1993, 1995",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 587,
			"arabicnumber": 587,
			"text": "Muaviye'nin şöyle dediği nakledilmiştir; \"Siz öyle bir namaz kılıyorsunuz ki, biz Nebi Sallallahu Aleyhi ve Sellem İle birlikte olduk. Onun sizin bu namazınız gibi bir namaz kıldığına şahit olmadık. Muhakkak ki o, bunları.\" (Bu sözleriyle ikindi namazından sonra kılınan iki rekatı kasdetmiştir.) Tekrar: 3766",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 588,
			"arabicnumber": 588,
			"text": "Ebu Hureyre (r.a.)'in şöyle dediği nakledilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem şu iki namazı yasakladı: Sabah namazından sonra güneş doğuncaya kadar kılınan namaz ile ikindi namazından sonra güneş batıncaya kadar kılınan namaz",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 589,
			"arabicnumber": 589,
			"text": "İbn Ömer radiyallahu anh'den şöyle nakledilmiştir: \"Arkadaşlarımı nasıl namaz kılarken gördüysem öyle namaz kılıyorum. Güneşin doğduğu veya battığı anda namaz kılmaya kalkışanlar dışında, gece veya gündüzün herhangi bir vaktinde namaz kılmak isteyen kimseye namaz kılmasını yasaklamam",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 590,
			"arabicnumber": 590,
			"text": "Aişe radiyallahu anha şöyle demiştir: \"Nebi Sallallahu Aleyhi ve Sellem'i vefat ettiren Allah'a yemin olsun ki, Allah Resulü ikindi namazından sonra kıldığı iki rek'at namazı Hak Teâlâ'ya kavuşuncaya kadar terk etmedi. Namaz kılacak takati kalmayıncaya kadar Hak Teâlâ'ya kavuşmadı. Namazlarının (ikindi namazından sonra kıldığı iki rekatlik namazların) pek çoğunu oturarak kılardı. Daima Nebi Sallallahu Aleyhi ve Sellem bu iki rekatlık namaz'ı kılardı. Ancak ümmetine ağır gelir korkusu ile bu namazları mescidde kılmazdı. Ümmetinin sorumluluklarının hafifletilmesi hoşuna giderdi",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 591,
			"arabicnumber": 591,
			"text": "Hişam'dan şöyle nakledilmiştir: \"Babam, Âişe r.anha'nın kendisine şöyle dediğini bana haber verdi: Yeğenim! Allah Resulü yanımda bulunduğu zaman süresince ikindi namazından sonra kıldığı iki rekat namazı asla terk etmedi.\" AÇIKLAMA 351.sayfa’da",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 592,
			"arabicnumber": 592,
			"text": "Âişe r.anha şöyle demiştir: \"İki namaz vardır ki, Allah Resulü onları ne gizli ne de herkesin yanında kıldığı zaman terk ederdi. Bunlar, sabah namazının farzından önce kılınan iki rekat namaz ile ikindi namazının farzından sonra kılınan iki rekat namazdır",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 593,
			"arabicnumber": 593,
			"text": "Ebu İshak'tan şöyle nakledilmiştir: \"Esved ile Mesruk Aişe r.anha'nın: \"Nebi Sallallahu Aleyhi ve Sellem her ne vakit ikindi namazından sonra bana gelse iki rekat namaz kılardı\" dediğine şahit olmuşlardı",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 594,
			"arabicnumber": 594,
			"text": "Ebu Kılabe, Ebu'l-Melih'in kendisine şöyle naklettiğini rivayet etmiştir: \"Bulutlu bir günde Büreyde ile birlikte idik. Bize 'Namazı erken kılın! Zira Allah Resulü Sallallahu Aleyhi ve Sellem şöyle buyurdu: Her kim ikindi namazını terk ederse ameli boşa gider' dedi",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 595,
			"arabicnumber": 595,
			"text": "Abdullah İbn Ebî Katade babasından şöyle nakletmiştir: \"Bir gece Nebi Sallallahu Aleyhi ve Sellem ile birlikte seferdeydik. Derken topluluk içinden biri 'Ey Allah'ın elçisi bizim için bir mola versen!' dedi. Allah Resulü (Sallallahu Aleyhi ve Sellem): 'Ben uyuya kalıp namaza kalkamamanızdan endişe ediyorum' şeklinde karşılık verdi. Bunun üzerine Bilal, 'Ben sizi uyandırırım' dedi. Nihayet kafiledeki herkes uyudu. Bilâl de sırtını bineğine yasladı. Gözleri uykuya yenik düştü ve o da uyuya kaldı. Derken Nebi Sallallahu Aleyhi ve Sellem uyandı. O esnada, güneşin yuvarlağı ufukta belirmişti. Bunun üzerine: 'Ey Bilâl! Söylediğin söz nerde kaldı?' dedi. Bilal, 'Hayatımda bunun gibi bir uykuyla karşılaşmadım' diye cevap verdi. Allah Resulü Sallallahu Aleyhi ve Sellem şöyle buyurdu: Allah Teâlâ dilediği zaman sizin ruhlarınızı kabzeder, dilediği zaman de geri iade eder... Ey Bilal! Kalk Müslümanlara namazı haber vermek için ezan oku! Daha sonra Nebi Sallallahu Aleyhi ve Sellem abdest aldı. Güneş iyice yükselip ışığı beyazlaşınca kalktı ve cemaate namaz kıldırdı. Tekrar: 7471",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 596,
			"arabicnumber": 596,
			"text": "Câbir bin Abdullah r.a.'dan şöyle nakledilmiştir: \"Ömer r.a. Hendek savaşında güneş batmak üzere iken Nebi Sallallahu Aleyhi ve Sellem'in yanına geldi ve Kureyşli kafirlere hakaret etmeye başladı: 'Ey Allah'ın elçisi güneş batmadan neredeyse ikindi namazını kılamayacaktım’ dedi. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem: Allah'a and olsun ki, ben bile kılmadım' buyurdu. Sonra kalkıp Buthan'a gittik. Rasûlullah Sallallahu Aleyhi ve Sellem namaz kılmak için abdest aldı, biz de abdest aldık. Güneş battıktan sonra ikindi namazını kıldırdı. Ondan sonra da, akşam namazını kıldırdı. Tekrar: 598, 641, 945, 4112",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 597,
			"arabicnumber": 597,
			"text": "Enes bin Malik r.a. Nebi s.a.v.'in şöyle buyurduğunu nakletmiştir: \"Kim bir namaz'ı kılmayı unutmuşsa, onu hatırlayınca kılsın! Zira bundan başka bunun bir keffâreti yoktur. Beni anmak için namaz kıl. [Taha suresi 14] Musa, Hemmâm'ın şöyle dediğini bildirmiştir: \"Daha sonra şu âyeti okudu: Beni anmak için namaz kıl",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 598,
			"arabicnumber": 598,
			"text": "Cabir bin Abdullah r.a.'dan şöyle nakledilmiştir: \"Hendek savaşında Ömer r.a. kafirlere hakaret etmeye başladı. Bir ara, 'Neredeyse güneş batıncaya kadar namazımı kılamayacaktım' dedi. Sonra Buthan vadisine indik. Allah Re­sulü Sallallahu Aleyhi ve Sellem güneş battıktan sonra ikindi namazını, daha sonra da akşam namazını kıldırdı.\" باب: ما يكره من السمر بعد العشاء. 39. Yatsı Namazından Sonra Mekruh Olan Sohbet",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 599,
			"arabicnumber": 599,
			"text": "Ebu'l-Minhâl'den şöyle nakledilmiştir: \"Babamla birlikte Ebu Berze el-Eslemî'nin yanına gittik. Babam ona Rasulullah Sallallahu Aleyhi ve Sellem'in farz namazları nasıl kıldığını bize anlat' dedi. O da şunları söyledi: Öğle namazını güneş batı yönüne doğru harekete geçince sizin \"ilk namaz\" dediğiniz öğle namazını kılardı. İkindi namazını kılınca, bizden biri Medine'nin ücra köşesinde bulunan ailesinin yanına döndüğü vakit güneş hâlâ parlaklığını korurdu. (Ravi der ki:) Akşam namazı hakkında ne dediğini unuttum. Yatsı namazını ise geciktirmeyi severdi. Yatsı namazından önce uyumayı, ondan sonra da konuşmayı hoş karşılamazdı. Sabah namazını ise, bizim yanı başımızdakini tanıyacak kadar hava ağarınca bitirirdi. Sabah namazında altmış ile yüz âyet arasında Kur'an okurdu",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 600,
			"arabicnumber": 600,
			"text": "Enes bin Malik r.a.'den şöyle nakledilmiştir: \"Bir gece Nebi Sallallahu Aleyhi ve Sellem'i bekledik. Vakit gece yarısına doğru geliyordu. Derken Allah Resulü (Sallallahu aleyhi ve Sellem)’evinden çıktı ve bize namaz kıldırdı. Daha sonra bize hitap ederek şöyle buyurdu: Biliniz ki! Bütün insanlar namaz kılıp uyudular. Siz namazı beklediğiniz sürece namaz kılıyorsunuz demektir.\" Hasan-ı Basri şöyle demiştir: \"Bir topluluk hayırlı bir mesele için beklediği sürece hayır üzere olmaya devam eder.\" Kurre de şöyle demiştir: \"Bu söz, Enes'in Nebi s.a.v.'den naklettiği hadisin bir parçasıdır",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 601,
			"arabicnumber": 601,
			"text": "Abdullah İbn Ömer r.a.'den şöyle nakledilmiştir: \"Ömrünün sonlarına doğru Allah Resulü yatsı namazını kıldırdı. Selam verdikten sonra dönüp cemaate şöyle dedi: Bu gecenizi gördünüz mü? Yüz sene sonra bugün yaşayanlardan yeryüzünde hiçbir kimse kalmayacak. Hemen Müslümanlar Nebi Sallallahu Aleyhi ve Sellem'in sözünü yanlış anladılar. Onun 'yüz sene' sözü hakkında farklı görüşler ortaya attılar. Bunun üzerine Nebi (Sallallahu aleyhi ve Sellem) şöyle buyurdu: Bugün yeryüzünde yaşayanlardan kimse kalmayacak. Akıp giden zaman bu nesli yok edecek",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 602,
			"arabicnumber": 602,
			"text": "Abdurrahman bin Ebî Bekir'den şöyle nakledilmiştir: \"Ashâb-i suffe, fakir kimselerden oluşuyordu. Nebi Sallallahu Aleyhi ve Sellem iki kişilik yemeği olan kimse, üçüncü olarak ashâb-ı suffeden birini götürsün, dört kişilik yemeği olan beşinci veya altıncı olarak ashab-ı suffeden birini götürsün' buyurdu. Ebu Bekir beraberinde üç kişiyi götürdü. Nebi Sallallahu Aleyhi ve Sellem ise on kişiyi aldı. Bizim aile, ben, babam ve annemden meydana geliyordu. (Ravi Ebu Osman, 'Abdurrahman'ın eşini sayıp saymadığını hatırlamıyorum' demiştir.) Bir de Ebu Bekir'in evi ile bizim ev arasında müşterek olarak kullandığımız hizmetçimiz vardı. Ebu Bekir Nebi (Sallallahu aleyhi ve Sellem)’in evinde akşam yemeği yedi. Yatsı namazını kılıncaya kadar evinde kaldı. Sonra Nebi Sallallahu Aleyhi ve Sellem'in yanına dönüp O (Sallallahu aleyhi ve Sellem) akşam yemeğini yeyinceye kadar orada kaldı. Gece'nin bir bölümü ilerledikten sonra evine döndü. Hanımı ona, 'Neden misafirlerinle veya misafirinle ilgilenmedin?' diye sordu. O da, 'Onlara akşam yemeği verdin mi?' diye sordu. Hanımı da şöyle cevap verdi: 'Onlar sen gelinceye kadar yemek yemeyi kabul etmediler. Onlar için sofra kuruldu ama yemek İstemediler. Abdurrahman şöyle dedi: Babamın kızmasından korktuğum için bir köşeye gidip saklandım. Ebu Bekir şöyle dedi: Ey korkak adam nerdesin! Kulağı kopasıca! Burnu düşesice! Dudağı büzülesice nerdesin! diyerek oğluna hakaretler yağdırdı. Ancak misafirlerin yemek yememelerinin oğlunun kusurundan değil de onların tercihinden ileri geldiğini anlayınca onlara şöyle dedi: 'Buyurun, yeyin! Afiyet olmasın!' Sonra Ebu Bekir şöyle dedi: 'Allah'a and olsun ki, ben asla yemeyeceğim! Allah'a yemin olsun ki, yemekten bir lokma aldığımız zaman yemek alttan alta çoğalıyordu. Abdurrahman şöyle dedi: Misafirler doydu. Yemek ise sofraya konduğundan daha fazla idi. Ebu Bekir sofraya baktı ve yemeğin konduğu gibi hatta daha fazla olduğunu fark etti. Bunun üzerine hanımına şöyle seslendi: Benû Firâs'ın bacısı bu da nedir? O da 'Gözümün nuruna yemin olsun ki, bu yemekler sofraya koyduğumdan daha fazla!' diye üç kez seslendi. Sonra Ebu Bekir yemekten yedi ve şöyle dedi: Bu benim ettiğim yemin şeytanın vesvesesinden ileri geldi. 'Sonra yemekten bir lokma aldı. Daha sonra yemeği Nebi Sallallahu Aleyhi ve Sellem'e götürdü, sabaha kadar orada kaldı. O kavimle bizim aramızda barış sözleşmesi vardı. Anlaşmanın süresi dolmuştu. Bu yüzden Medine'ye gelmişlerdi. Biz de onları on iki gruba ayırmıştık. Her grupta bayağı adam vardı. Tam sayılarını ancak Allah bilir. İşte bu adamlar hep beraber bu yemekten yemişlerdir. Tekrar: 3581, 6140, 6141",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 77
			}
		}
	]
}