{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"91": "Interpretation of Dreams"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6982,
			"arabicnumber": 6982,
			"text": "ez-Zuhrî şöyle demiştir: Bana Urve, haber verdi ki, Âişe (r.anha) şöyle demiştir: RasûlulIah (sallallahü aleyhi ve sellem)'ın ilk vahy başlangıcı uykuda sâliha ru'yâ (yani güzel ve doğru ru'yâ) görmekle olmuştur. Hiçbir ru'yâ görmezdi ki, sabah aydınlığı gibi açık meydana gelmesin. Kendisi Hıra Dağı'na gider ve orada birçok geceler tahannüs -yani ibâdet-eder ve bunun için azık hazırlardı. Sonra Hadîce'ye döner ve bir o kadar zaman için yine azık hazırlardı. Nihayet bir gün kendisi Hıra Mağarası'nda bulunduğu sırada kendisine hakk (yani vahy) geldi. Şöyle ki: Mağarada iken melek O'na geldi ve: İkra'(yani oku)! dedi. Peygamber de ona: \"Ben okuma bilmem! dedim\" diye cevâb verdi. Peygamber devamla dedi ki: \"O zaman melek beni tuttu da takatim kesilinceye kadar sıkıştırdı. Sonra beni bıraktı da yine: lkra' (Oku) dedi. Ben de ona: Ben okumak bilmem, dedim. benî aldi ve ikinci defa takatim kesilinceye kadar sıkıştırdı. Sonra beni salıverdi de yine: İkra' (Oku)! dedi. Ben: Okumak bilmem! dedim. beni üçüncü defa takatim kesilinceye kadar sıkıştırdı. Sonra beni bıraktı da: 'Yaratan Rabb'inin adiyle oku! O insanı bir kan pıhtısından yarattı. Oku! Rabb'in nihayetsiz kerem sahibidir. Ki O, kalemle öğretendir. İnsana bilmediğini O öğretti' (el- Alâk: 1-5) âyetine kadar ulaştı.\" üzerine Rasûlüllah(kendisine vahyolunan) bu âyetlerle korkudan vücudundaki etleri titreyerek döndü. Nihayet Hadîce'nin yanına girdi ve: \"Beni sarıp örtünüz! Beni sarıp örtünüz!\" dedi. Korkusu gidinceye kadar kendisim sarıp örttüler. \"Yâ Hadîce! Bana ne oluyor?\" dedi ve ona olan haberi haber verdi ve ona: \"Kendimden korktum\" dedi. Hadîce de O'na: Öyle deme (Sana hiçbir korku yoktur)! Sen hayırla müjdelenip sevin! Allah'a yemîn ederim ki, Allah Seni hiçbir zaman utandırmaz. Çünkü Sen hısımlarına bakarsın, sözü dosdoğru söylersin, işini görmekten âciz olanların ağırlığını yüklenirsin, zayıflara yemek yedirirsin, hakk yolunda meydana gelen hâdiselerde ve mühim işlerde insanlara yardım edersin, dedi. sonra Hadîce O'nu birlikte alıp, Hadîce'nin babasının kardeşi (amca oğlu) olan Varaka ibnu Nevfel ibn Esed ibn Abdiluzzâ ibn Kusayy'a götürdü. Bu zât Câhiliyet zamanında Hrıstiyan Dîni'ne girmiş bir kimse olup İbrânîce yazı bilir ve İncîl’den Allah'ın dilediği mikdârda bâzı şeyleri İbrânîce yazardı. Varaka gözlerine körlük arız olmuş yaşlı bir ihtiyardı. Hadîce ona: Ey amcam oğlu! Dinle de bak! Kardeşinin oğlu ne söylüyor! dedi. Ey kardeşimin oğlu! Ne görüyorsun? diye sorunca, Peygamber ona gördüğü şeyleri haber verdi. üzerine Varaka dedi ki: \"Bu gördüğün Mûsâ üzerine indirilmiş olan Nâmûs'tur (yani vahy sırrının sahibidir). Ah keşki Sen'in da'vet günlerinde genç olaydım, kavmin Sen'i çıkaracakları zaman, keski hayâtta olsam!\" üzerine Rasûlüllah: \"Onlar beni çıkaracaklar mı?\" diye sordu. Varaka da: Evet, Sen'in gibi birşey getirmiş(yani vahy tebliğ etmiş) bir kimse yoktur ki, düşmanlığa uğramasın. Şayet Sen'in da'vet günlerine yetişirsem, Sana son derecede yardım ederim, cevâbını verdi. sonra çok geçmedi, Varaka vefat etti. Ve o esnada vahy fetreti oldu (yani bir müddet için vahy kesilmesi oldu). Hattâ bundan dolayı Peygamber çok hüzünlendi ve kendisini saran hüzün içinde, kederinden dolayı birkaç defa yüksek dağların başlarından kendini aşağıya atmak için gitmiş, her defasında kendini dağdan aşağısına atmak için bir dağın zirvesine çıktığında kendisine Cibrîl görünüp: Yâ Muhammedi Şübhesiz. Sen hakk olarak Allah'ın Rasûlü'sün! demiş; bununla ıztırabı sükûna kavuşur ve gönlü sevinir ve geriye dönerdi. fetreti kendisine uzun olduğu zaman yine böyle kendini dağdan aşağı atmak için gitmişti. Dağın zirvesine yükseldiğinde yine kendisine Cibril görünüp, O'na bu \"Sen muhakkak Allah'ın Rasûlü'sün!\" sözlerini söylemiştir. Abbâs \"Fâlihu'l-ısbâh\"(el-Enâm: 96) kavlinin tefsirinde \"Isbâh\", gündüzleyin güneşin ziyası, geceleyin de ayın ziyâsıdır, demiştir",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6983,
			"arabicnumber": 6983,
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6984,
			"arabicnumber": 6984,
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6985,
			"arabicnumber": 6985,
			"text": "Ebû Saîd el-Hudrî (radıyallahü anh), Peygamber(sallallahü aleyhi ve sellem)'den şöyle buyururken işitmiştir: \"Sizden biriniz sevdiği bir ru'yâ görürse, bilsin ki o muhakkak Allah tarafmdandır. Ru'yâ sahibi bu ru 'yası üzerine Allah'a hamdetsin ve başkasına da söylesin. Buna aykırı hoşlanmadığı bir ru'yâ gördüğünde de muhakkak ki bu ru'yâ da şeytândandır. Bu hâlde de ru'yâ sahibi, ru'yânın şerrinden Allah 'a sığınsın ve ru 'yasını kimseye söylemesin. Bu suretle o ru'yâ, sahibine zarar vermez",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6986,
			"arabicnumber": 6986,
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6987,
			"arabicnumber": 6987,
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6988,
			"arabicnumber": 6988,
			"text": "Bize Şu'be, Katâde'den; o da Enes ibn Mâlik (radıyallahü anh)'ten; o da Ubâde ibnu's-Sâmit(radıyallahü anh)'ten tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem):\"Mü'minin ru'yâsı nübüvvetin kırkaltı cüz'ünden bir cüz'dür\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6989,
			"arabicnumber": 6989,
			"text": "Bize İbrâhîm ibn Sa'd, ez-Zuhrî'den; o da Saîd ibnu'l-Müseyyeb'den; o da Ebû Hureyre (radıyallahü anh)'den tahdîs etti ki, Rasûlüllah(sallallahü aleyhi ve sellem):\"Mü'minin ru'yâsı, nübüvvetin kırkaltı cüz'ünden bir cüz'dür\" buyurmuştur. Bu hadîsi Sabit el-Bunânî, Humeyd et-Tavîl, îshâk ibnu Abdillah ve Şuayb dörtlüsü Enes'ten; o da Peygamber'den olmak üzere rivayet etmişlerdir",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6990,
			"arabicnumber": 6990,
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6991,
			"arabicnumber": 6991,
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6992,
			"arabicnumber": 6992,
			"text": "Ebû Hureyre (radıyallahü anh):Rasûlüllah(sallallahü aleyhi ve sellem):\"Eğer ben zindanda Yûsuf'un kaldığı kadar kalsaydım da sonra bana melik tarafından da'vetçi gelseydi, ben hemen ona icabet ederdim\" buyurdu, demiştir",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6993,
			"arabicnumber": 6993,
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6994,
			"arabicnumber": 6994,
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6995,
			"arabicnumber": 6995,
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6996,
			"arabicnumber": 6996,
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 6997,
			"arabicnumber": 6997,
			"text": "Bize el-Leys tahdîs etti. Bana İbnu’l-Hâd, Abdullah ibn Habbâb'dan tahdîs etti ki, Ebû Saîd el-Hudrî (radıyallahü anh)Peygamber(sallallahü aleyhi ve sellem)'den:\"Her kim ru'yâsında beni görürse, muhakkak o, hakkı görmüştür. Çünkü şeytân benim şekil ve hilkatime giremez\" buyururken işitmiştir",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 6998,
			"arabicnumber": 6998,
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 6999,
			"arabicnumber": 6999,
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 7000,
			"arabicnumber": 7000,
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 7002,
			"arabicnumber": 7002,
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 7003,
			"arabicnumber": 7003,
			"text": "Bana Hârice ibn Zeyd ibn Sabit şöyle haber verdi: Ensâr'dan bir kadın olan Ümmü’l-Alâ (radıyallahü anh),Rasûlüllah ile bey'at etmiştir. Ümmü’l-Alâ, râvîsi Hârice'ye, kendilerinin Muhâcirler'i aralarında kur'a ile taksim ettiklerini haber verip şöyle demiştir: Bizim ailemizin payına Usmân ibn Maz'ûn düşmüştü. Biz Usmân'ı evlerimizde konukladık. Fakat Usmân (bir müddet sonra) ölüm sebebi olan bir hastalıkla hastalandı. Vefat edince gasledildi ve kendi elbisesi içinde kefenlendi. Sonra Rasûlüllah(sallallahü aleyhi ve sellem) cenazenin yanına geldi. Ümmü’l-Alâ dedi ki: Ben (cenazeyi tezkiye ederek): Ey Ebâ's-Sâib! Allah'ın rahmeti senin üzerine olsun! Benim (senin hakkında bildiğim ve cemâate bildirmek istediğim) şehâdetim şudur ki: Allahü Taâlâ muhakkak sana ikram etmiştir! dedim. Bunun üzerine Rasûlüllah: \"Allahü Taâlâ'nın bu ölüye ikram ve inayet buyurduğunu sana ne bildiriyor?\" buyurdu. de O'na: Yâ Rasûlallah! Babam Sana feda olsun! Allah (bu îmânlı kuluna ikram etmez de) kime ikram eder? dedim. defa da Rasûlüllah: \"Usmân ibn Maz'ûn'a gelince; yemîn ederim ki, ona yakın gelmiştir (yani o ölmüş bulunuyor). Ve yine Allah'a yemîn ederim ki, ben de bu ölü için hayır ve saadet umarım. Yine Allah'a yemîn ederim ki, ben Allah'ın Rasûlü iken bana (ve size yarın) Allah tarafından ne muamele edileceğini bilemem!\" buyurdu. üzerine Ümmü’l-Alâ dedi ki: Vallahi bundan sonra ben kimseyi tezkiye etmeye cesaret edemiyorum! demiştir",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 7004,
			"arabicnumber": 7004,
			"text": "(Bize Şuayb, ez-Zuhrî'den bu hadîsi haber verdi: aleyhi ve sellem): \"Ben Usmân ibn Maz'ûn'a da ne yapılacağını bilmem\" buyurdu. Rasûlüllah'ın bu sözü beni kederlendirdi de akabinde uyudum. Ru'yâmda Usmân'a âid akmakta olan bir pınar gördüm. Uyanınca bu ru'yâyı Rasûlüllah'a haber verdim. Rasûlüllah: \"Bu senin Usmân için gördüğün akan pınar, onun (sevâb getiren) amelidir\" buyurdu",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 7005,
			"arabicnumber": 7005,
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 7006,
			"arabicnumber": 7006,
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 7007,
			"arabicnumber": 7007,
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 7008,
			"arabicnumber": 7008,
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 7009,
			"arabicnumber": 7009,
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 7010,
			"arabicnumber": 7010,
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 7011,
			"arabicnumber": 7011,
			"text": "Âişe (r.anha) şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem) şöyle buyurdu: (Yâ Âişe!) Sen iki kerre ru'yâmda bana gösterildin. Bir adam ipekten bir parça üzerinde senin suretini taşıyordu. O adam: Bu (suretin sahibi) senin müstakbel zevcendir, diyordu. Şimdi ben o sureti açıyorum ki (yani yüzünden anlıyorum ki), o suret, sen idin. Cibril'in o sözü üzerine ben: Eğer şu ru'yâm Allah tarafından gösterilmiş ise, Allah bunu infaz edip gerçekleştirir, dedim",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 7012,
			"arabicnumber": 7012,
			"text": "Bize Hişâm, babası Urve'den haber verdi ki, Âişe (r.anha) şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem) şöyle buyurdu: \"Ben seninle evlenmeden önce sen bana ru'yâda iki kerre gösterildin: Ben meleği, ipekten bir kumaş parçası üzerinde senin suretini taşıyor gördüm. Ben ona: Bu kumaş parçasını aç! dedim. onu açtı, bir de baktım ki, o sen idin. Ben: Eğer bu ru’yâ Allah tarafından ise Allah bunu infaz eder! dedim. melek, seni bir ipek parçası üzerinde taşırken, ikinci defa bana gösterildin. Ben ona: Bu parçayı aç! dedim. da açtı; bir de baktım ki, o suret sen idin. Bunun üzerine ben: Eğer bu ru'yâ Allah tarafından gösterilmiş ise, Allah bunu infaz eder, dedim",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 7013,
			"arabicnumber": 7013,
			"text": "İbn Şihâb'dan (o, şöyle demiştir): Bana Saîd ibnu'l- Müseyyeb haber verdi ki, Ebû Hureyre (radıyallahü anh) şöyle demiştir: Ben Rasûlüllah (sallallahü aleyhi ve sellem)'tan işittim, şöyle buyuruyordu: \"Ben cevâmi'u'l-kelim ile gönderildim. Ben (bir aylık mesafedeki düşman gönüllerine) korku salmak suretiyle yardım olundum. Bir de ben uyuduğum sırada, bana yer'in hazînelerinin anahtarları getirildi de benim elime konuldu\". (ibnu'z-Zuhrî) şöyle demiştir: Ve bize şöyle baliğ oldu ki, \"Cevâmi'u'l-kelim\" şudur: Allah Taâlâ, Peygamber'den önceki kitâblarda bir iş hakkında, iki iş hakkında veya bunun benzeri hakkında yazılmakta olan birçok şeyleri onun içine toplar birleştirir",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 7014,
			"arabicnumber": 7014,
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 7016,
			"arabicnumber": 7016,
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 7017,
			"arabicnumber": 7017,
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 7018,
			"arabicnumber": 7018,
			"text": "Bize Ma'mer ibn Râşid, ez-Zuhrî'den; o da Zeyd ibn Sâbit'in oğlu Hârice'den; o da Ensâr kadınlarından biri olup Rasûlüllah(sallallahü aleyhi ve sellem) ile bey'at eden Ümmü’l-Alâ'dan tahdîs etti. Ümmü’l-Alâ (radıyallahü anh) şöyle demiştir: Muhâcirler'in (Mekke'den Medîne'ye geldiklerinde) ikaamet edecekleri yerleri tesbît etmek üzere Ensâr, kendi aralarında kur'a çektikleri zaman Usmân ibn Maz'ûn'un ikaameti bizim aileye düşmüştü. Usmân bizim evimizde bir müddet ikaametten sonra hastalandı. Bizler onun hastalığında işlerini görüp hastabakıcılığını yaptık, nihayet vefat etti. Sonra onu kendi elbisesi içinde kefenledik. Akabinde Rasûlüllah bizim yanımıza (cenazeye) geldi. Ben: Yâ Ebâ's-Sâib! Allah'ın rahmeti senin üzerine olsun! Benim senin hakkındaki şehâdetim şudur: Muhakkak Allah sana ikram etmiştir! dedim. üzerine Rasûlüllah bana: \" (Allah'ın bu ölüye ikram ettiğini) sana bildiren nedir?\" diye sordu. de: Vallahi bilmem! dedim. Rasûlüllah: \"Amma Usmân 'a gelince; muhakkak ki ona yakın gelmiştir (yani o ölmüştür). Ben de onun için Allah'tan hayır ve saadet umarım. Vallahi yine ben, Allah'ın Rasûlü iken,-bana ve size (Allah tarafından) ne muamele edileceğini bilemem\" buyurdu. Vallahi ben bundan sonra kimseyi tezkiye etmeye cesaret edemedim, dedi. Ümmü’l-Alâ dedi ki: Ben ru'yâmda Usmân ibn Maz'ûn'un akan bir pınarı olduğunu gördüm. Akabinde Rasûlüllah'a gelip bu ru'yâmı kendisine zikrettim. Rasûlüllah: \"Bu senin gördüğün pınar, kendisinden sonra onun için akmaya devam eden amelidir\" buyurdu",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 7019,
			"arabicnumber": 7019,
			"text": "Bize Nâfi' tahdîs etti ki, ona da İbn Omer (radıyallahü anh) tahdîs edip şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: \"Ben bir kuyu üzerinde bulunup ondan (kova ile) su çıkarmakta olduğum sırada birden yanıma Ebû Bekr ile Omer geldi. Akabinde Ebû Bekr kovayı aldı da bir yahut iki dolu kova su çekti. Fakat onun su çekişinde bir za'f ve güçlük vardı. Allah Ebû Bekr'i mağfiret etsin. Sonra kovayı Ebû Bekr'in elinden Omer ibnu'l-Hattâb aldı. Ve o alınca bu kova Omer'in elinde büyük bir kovaya dönüştü. Ben, insanlar içinde Omer'in gördüğü işi işleyebilecek kuvvette kuvvetli ve kâmil bir kişi göremedim. En sonu insanlar o meydanı develerin sulak ve eylek yeri edindiler",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 7020,
			"arabicnumber": 7020,
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 7021,
			"arabicnumber": 7021,
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 7022,
			"arabicnumber": 7022,
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 7023,
			"arabicnumber": 7023,
			"text": "İbn Şihâb şöyle demiştir: Bana Saîd ibnu'l-Müseyyeb; biz resûlullahın huzurunda bulunduğumuz sırada, O bize şöyle buyurdu: \"Ben bir kerre uyurken kendimi cennette gördüm. O sırada bir kadın gördüm ki, o bir köşkün yanında abdest almakta idi. (Yanımdaki meleklere); Bu köşk kimindir? diye sordum. Onlar: Bu Omer ibnu'l-Hattâb içindir, dediler. girmek istedim, fakat) Omer'in kıskançlığını hatırladım da hemen yüzümü arkama çevirdim\". Hureyre: Omer ibnu'l-Hattâb (sevincinden) ağladı da, sonra: Babam anam Sana feda olsun yâ Rasûlallah; ben Sana karşı mı kıskançlık edeceğim! Dedi",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 7024,
			"arabicnumber": 7024,
			"text": "Câbir ibn Abdillah (radıyallahü anh) şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem) şöyle buyurdu: \"Ben ru'yâmda cennete girdim ve orada altından yapılmış bir köşk ile karşılaştım. Ben (yanımda bulunanlara): Bu kime âiddir? diye sordum. Onlar: Kureyş'ten bir adamındır, dediler. Hattâb oğlu! Bana oraya girmekten mâni' olan, ancak bilmekte olduğum kıskançlığındır!\" Omer: Yâ Rasûlallah! Sana karşı da mı kıskanacağım? dedi",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 7025,
			"arabicnumber": 7025,
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 7026,
			"arabicnumber": 7026,
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 7027,
			"arabicnumber": 7027,
			"text": "Abdullah ibn Omer (radıyallahü anh) şöyle demiştir: Ben Rasûlüllah (sallallahü aleyhi ve sellem)'tan işittim; O: \"Ben uyuduğum sırada bana süt dolu bir kadeh getirildi de, ben ondan içtim. Sonra artanımı Omer ibnu'l-Hat-tâb'a verdim” buyuruyordu. Rasûlallah! Bunu ne ile te'vîl (yani ta'Bir) ettin? diye sordular. \"ilim ile\" diye cevâb verdi",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 7029,
			"arabicnumber": 7029,
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 7031,
			"arabicnumber": 7031,
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 7032,
			"arabicnumber": 7032,
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 7033,
			"arabicnumber": 7033,
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 7034,
			"arabicnumber": 7034,
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 7035,
			"arabicnumber": 7035,
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 7037,
			"arabicnumber": 7037,
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 7038,
			"arabicnumber": 7038,
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 7039,
			"arabicnumber": 7039,
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 7040,
			"arabicnumber": 7040,
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 7041,
			"arabicnumber": 7041,
			"text": "Ebû Mûsâ (radıyallahü anh)'dan: el-Buhârî yahut şeyhi Muhammed ibnu’l-Alâ: Peygamber'den söylediğini, yani hadîsi Peygamber'e yükselttiğini zannediyorum, demiştir. Peygamber(sallallahü aleyhi ve sellem) şöyle buyurdu: \"Ben ru'yâmda şöyle gördüm: Ben bir kılıç salladım, akabinde kılıcın göğsü kırıldı. İşte bu, Uhud günü musibete uğrayan müminlerdir. Sonra ben o kılıcı başka bir defa daha salladım. Bu sefer kılıç olduğundan daha güzel bir hâle döndü. Bu da Allah'ın fetih ve mü'minlerin birleşip toplanmaları nev'înden getirmiş olduğu güzel sonuçlardır. Ben yine rü'yâda birtakım sığırlar gördüm. Allah hayırdır (yâni Allah'ın yapması hayırdır). Gördüm ki o sığırlar, Uhud günü şehîd edilen mü'minlermiş",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 7042,
			"arabicnumber": 7042,
			"text": "Bize Sufyân ibn Uyeyne, Eyyûb'dan; o da İkrime'den; o da İbn Abbâs radıyallahü anhüma'tan tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem) şöyle buyurmuştur: \"Her kim görmediği bir ru 'yayı gördüm diye iddia ve ısrar ederse (kıyâmet gününde) ona iki şair (=arpa) danesinin birbirine düğümlenmesi teklif ve hiçbir zaman yapamayacağı bu işle azâb olunur.Her kim de bir cemiyetin duyulmasını istemedikleri yahut bundan kaçındıkları bir haberini işitmeye çalışırsa, onun iki kulağına kıyâmet gününde kurşun dökülür. Her kim de (hayât sahibi) bir suret resmederse, ona da: Haydi buna rûh üfle (can ver) diye teklif olunarak azâb olunur. o, hayât vermek kudretini hâiz değildir\". Eyyûb bize bu hadîsi vasletti(yani senediyle rivayet etti), demiştir",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 7043,
			"arabicnumber": 7043,
			"text": "Kuteybe de şöyle dedi: Bize Ebû Avâne, Katâde'den; o da İkrime'den; o da Ebû Hureyre'den \"Ru'yâsı hakkında yalan söyleyen kimse\" kavlini tahdîs etti. de Ebû Hâşim er-Rummânî'den söyledi. O: Ben İkrime'den işittim, Ebû Hureyre (radıyallahü anh):\"Bir suret yapan, rüyasında yalandan birşey gördüğünü iddia eden ve istenilmeyen bir sözü işitmeye çalışan kimse...\" sözünü söyledi. Bize Hâlid ibn Abdillah et-Tahhân, Hâlid el-Hazzâ'dan; o da İkrime'den tahdîs etti ki, İbn Abbâs radıyallahü anhüma:\"işitmeye çatışan, yalandan ru'yâ gördüğünü iddia eden ve suret yapan\" diyerek, yukarıda geçen hadîs tarzında rivayet etmiştir. ibn Hassan el-Kardûsî, İkrime'den; o da İbn Abbâs'tan, onun kavli olmak üzere, Hâlid el-Hazzâ'ya mutâbaat etmiştir",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 7044,
			"arabicnumber": 7044,
			"text": "Bize İbn Omer'in kölesi olan Abdurrahmân ibnu Abdillah ibn Dînâr babası Abdullah ibn Dînâr el-Adevî'den; o da İbnu Omer(radıyallahü anh) 'den tahdîs etti ki, Rasûlüllah (sallallahü aleyhi ve sellem):\"Yalanlardan en büyük yalan, ru'yasında görmediği şeyi iki gözüne göstermek iddiasıdır\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 7045,
			"arabicnumber": 7045,
			"text": "Bana İbnu Ebî Hazım ile ed-Derâverdî, Yezîd ibn Abdillah'tan; o da Abdullah ibnu Habbâb'dan; o da Ebû Saîd el-Hudrî-(radıyallahü anh)'den tahdîs etti ki, o da Rasülullah (sallallahü aleyhi ve sellem)'tan şöyle buyururken işitmiştir: \"Sizden biriniz sevdiği bir ru'yâyı görürse, bilsin ki, o Allah tarafından(bir telkin)dir. Ru'yâ sahibi bu ru'yâsı üzerine Allah'a hamdetsin ve onu başkasına da söylesin. Buna aykırı, hoşlanmadığı bir ru'yâ gördüğünde de muhakkak ki, bu ru'yâ da şeytândandır. Bu hâlde ru'yâ sahibi, ru'yânın şerrinden Allah'a sığınsın ve ru'yasını kimseye söylemesin. Çünkü bu suretle o ru'yâ, sahibine zarar vermez",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 7046,
			"arabicnumber": 7046,
			"text": "İbn Abbâs radıyallahü anhüma şöyle tahdîs ediyordu: Bir kişi Rasûlüllah(sallallahü aleyhi ve sellem)'a geldi de şöyle dedi: Ya Rasûlallah! Ben bu gece ru'yâmda yerle gök arasında bir bulut gördüm, ondan yere yağ ve bal yağıyordu. İnsanların da bu yağdan ve baldan avuç avuç almakta olduklarını görüyordum. Kimi çok, kimi az topluyordu. Bu sırada yerden göğe bir ip uzandığını gördüm. Onun ardısıra Seni görüyordum ki Yâ Rasûlallah, Sen o ipe tutunup yukarıya (göğe doğru) yükseldin. Sonra o ipi başka bir kimse tuttu, o da yükseldi. Sonra başka bir kimse daha tutup bu (üçüncü kimse) de yükseldi. Sonra (dördüncü) biri tuttu. Fakat bu defa ip koptu. Sonra ip bağlanıp bitiştirildi. Bunun üzerine Ebû Bekr: Yâ Rasûlallah, babam anam Sana feda olsun! Vallahi beni bırakıp herhalde müsâade ediniz de, bu ru'yâyı ben ta'Bir edeyim! dedi. da: \"Haydi ta'Bir et!\" diye izin verince, Ebû Bekr şöyle yordu: Bu zâtın gördüğü bulut, İslâm'dır. Ondan yağan yağ, bal Kur'ândır. Onun tatlılığından çok veya az (kaabiliyet derecelerine göre, müslümânlar) faydalanacaklardır. Gökten yere erişen ip de, üzerinde bulunduğun hakk ve adalet ipidir. Sen onu tutuyorsun. Allah da Sen'i yükseltiyor. Sen'den sonra o hakk ve adalet ipini başka birisi tutacak ve o iple yükselecek. Sonra başka birisi daha tutacak, o da yükselecek. Sonra bir kimse daha tutacak, fakat ip kopacak. Sonra onun için bağlanıp, o da yükselecek. ta'bîrin sonunda Ebû Bekr: Yâ Rasûlallah, babam anam Sana kurban olsun! Bana haber versen, bu ta'bîrimde isabet mi ettim, yoksa hatâ mı ettim? diye sordu. \"Bâzısında isabet, bâzısında hatâ ettin\" buyurdu. Bekr: Yâ Rasûlallah, hatâ ettiğim ciheti Allah rızâsı için bana haber versen! dedi. \"Allah adına and vererek ısrar etme!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 7047,
			"arabicnumber": 7047,
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 61
			}
		}
	]
}