{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"91": "Interpretation of Dreams"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6982,
			"arabicnumber": 6982,
			"text": "Aişe r.anha şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem'e ilk vahiy başlangıcı uykuda saliha rüya görmekle olmuştur. Resulullh'ın gördüğü her biri rüya mutlaka sabah aydınlığı gibi apaçık olurdu. Kendisi Hira dağına gider ve orada birçok geceler ibadete çekilirdi. Bunun için önceden azık hazırlardı. Sonra Hatice'ye döner ve bir o kadar zaman için yine azık hazırlardı. Nihayet bir gün kendisi Hira mağarasında iken hiç ummadığı bir anda hakla karşılaştı. Şöyle ki: Mağarada iken melek ona geldi ve \"İkra (oku)!\" dedi. Nebi de ona \"Ben okuma bilmem!\" diye cevap verdi. Resulullah olayın devamını şöyle anlattı: \"O zaman melek beni tuttu ve takatim kesilinceye kadar sıkıştırd!. Sonra bıraktı ve yine 'İkra (oku)!' dedi. Ben de ona 'Ben okuma bilmem' dedim. Yine beni aldı ve ikinci defa takatim kesilinceye kadar sıkıştırd!. Sonra yine salıverdi ve 'İkra!' dedi. Ben 'Ben okuma bilmem!' dedim. Yine beni üçüncü defa takatim kesilinçeye kadar sıkıştırd!. Sonra bıraktı ve 'Yaratan Rabbinin adıyla oku! 0, insanı bir aşılanmış yumurtadan yaratt!. Oku! İnsana bilmediklerini belleten, kalemle (yazmayı) öğreten Rabbin, en büyük kerem sahibidir\"(Alak 1-5) ayetine kadar okudu. Bu olay üzerine Resulullah bu ayetlerle korkudan omuz başları (bir rivayette kalbi) titreyerek döndü. Nihayet Hatice'nin yanına girdi ve \"Beni sarıp, örtünüz! Beni sarıp örtünüz\" dedi. Korkusu gidinceye kadar kendisini sarıp örttüler. \"Ya Hatice! Bana ne oluyor?\" dedi. Ve ona olanları haber verdi. Sonra da \"kendimden korktum\" dedi. Hz. Hatice ona \"Öyle deme! Müjdeler olsun! Allah'a yemin ederim ki Allah seni hiçbir zaman utandırmaz. Çünkü sen akrabalarına bakarsın, sözü dosdoğru söylersin, işini görmekten aciz olanların ağırlığını yüklenirsin, zayıflam yemek yedirirsin, hak yolunda meydana gelen ha.diselerde insanlara yardım edersin\" dedi. Bundan sonra Hatice onu yanına alıp, babasının kardeşinin (amca) oğlu olan Varaka b. Nevfel İbn Esed b. AbduluzzEl b. Kusayy'a götürdü. Bu zat cahiliye döneminde Hıristiyanlığa girmiş bir kimse olup, İbranice yazı bilir ve İncil' den Allah'ın dilediği miktarda bazı şeyleri İbranice yazardı. Varaka, gözleri kör olmuş, yaşlı bir ihtiyardı. Hatice ona \"Eyamcaoğlu! Dinle de bak! Kardeşinin oğlu ne söylüyor!\" dedi. Varaka \"Ey kardeşimin oğlu! Ne görüyorsun?\" diye sorunca, Resulullah ona gördüğü şeyleri haber verdi. Bunun üzerine Varaka dedi ki: \"Bu gördüğün Musa üzerine indirilmiş olan namustur (Cebrail'dir). Keşke davet günlerinde genç olsaydım, kavmin seni çıkaracağı zaman keşke hayatta olsaydım!\" Bunun üzerine Resulullah \"On/ar beni çıkaracak/ar mı?\" diye sordu. Varaka şöyle cevap verdi: \"Evet, senin getirdiğin bu davetin benzerini getirip de düşmanlığa uğramamış olan hiçbir kimse yoktur. Şayet davet günlerine yetişirsem, sana var gücümle yardım edeceğim.\" Varaka bunun ardından çok geçmeden vefat etti. O esnada vahiy bir müddet için kesildi. Hatta bundan dolayı Hz. Nebi çok üzüldü ve bu yüzden birkaç defa kendini yüksek dağların başlarından aşağıya atmak için gitti. Kendini aşağı atmak için bir dağın zirvesine çıktığında Cebrail ona görünüp \"Ya Muhammed! Şüphesiz sen gerçekten Allah'ın Resulüsün!\" demişti. Bununla ızdırabı sükunete ermiş ve gönlü sevinç içinde geri dönmüştü. Vahyin kesilme süresi uzayınca yine böyle kendini dağdan aşağı atmak için gitmişti. Dağın zirvesine yükseldiğinde yine kendisine Cebrail görünmüş, ona yine aynı sözleri söylemişti. İbn Abbas \"ci J.llt\"(En'am 96) ifadesinin tefsirinde \"Bu, gündüzün güneşin, geceleyin ayın ışığıdır\" demiştir. Fethu'l-Bari Açıklaması: \"ResuluIlah'a \"ilk vahyin salih rüya görerek başladığı.\" İsmalll'nin Kitabu'tTabir adında bir eseri vard1r. Tabir, rüya yorumlamaya mahsus bir kelimedir. Tabir, rüyanın zahirinden batınına geçmek demektir. Kurtubi, e/-Müfhim'de şöyle der: Bazıları Arapçada \"ru'yet\" \"rü'ya\" manasına gelir. Nitekim \".......... ve ma cealne'r-rü'ya=sana gösterdiğimiz o rüyayı ve Kur'an'da /anetlenen ağacı ancak insan/an sınamak için meydana getirdik\"(İsra 60) ayeti buna örnektir demiş ve ayette geçen \"rü'ya\" kelimesinden maksat, ResuluIlah'ın İsra gecesinde görmüş olduğu birtakım acayip şeyler olduğunu iddia etmiştir. Oysa İsra olayında ResuluIlah baştan sonra uyanık haldeydi. Biz de şunu ekleyelim: Bazıları ise bunun tam aksini söylemiş ve ayetin İsra'nın uykuda gerçekleştiğini söyleyenlere delil olduğunu ileri sürmüştür. Ancak itimat edilmesi gereken, birinci görüştür. İsra'nın tefsiri yapılırken İbn Abbas'ın sözkonusu rüyanın gözün rüyası (gördüğü şey) olduğu yolundaki ifadesi geçmişti. Buna \"rüya\" denilmesinin hikmeti, gaybı şeylerin şehade tarzındaki görmeden farklı olmasından kaynaklanabilir. Böylece gaybı meselelerin görülmesi, rüyada görülen rüyaya benzemiş olabilir. Kadı Ebu Bekir b. el-Arabı şöyle demiştir: Rüya, Allahu Teala'ın bir melek veya şeytanın eliyle kulun kalbine bağlamış olduğu birtakım idraklardır. Bu da onların isimleriyle yani hakikatleriyle veya künyeleriyle yani ibareleriyle ya da karıştırmak şeklinde olur. Rüyanın uyanık haldeki benzeri, hatırdan geçen şeylerdir. Çünkü bunlar bir kıssa tarzında gelebildiği gibi, bölük pörçük bir şekilde düzenlenmemiş bir biçimde de gelebilir. Üstad Ebu İshak'ın görüşünün özeti budur. Mazerl şöyle der: Rüyanın hakikati konusunda bilginler çok söz söylemişlerdir. Sahih olanı, ehl-i sünnetin görüşüdür. Ehl-i sünnete göre Allahu Teala uyuyan kimsenin kalbinde tıpkı uyanık kişinin kalbinde yarattığı gibi birtakım inançlar yaratır. Bunları yarattığı vakit, sanki onları ilerde yaratacağı başka şeylere bir sembol kılmış olur. Bunlardan söz konusu inancın aksine gerçekleşen şeyler, uyanık kimsenin karşısında gerçekleşenler gibidir. Bunu bir buluta benzetebiliriz. Allahu Teala bulutu yağmurun alameti olarak yaratmıştır. Ancak bazen bulut olduğu halde yağmur yağmaz. Sözünü ettiğimiz inançlar, bazen bir meleğin huzurunda gerçekleşir ve bundan sonra insanı sevindiren şeyler meydana gelir. Bazen de şeytanın bulunduğu yerde gerçekleşir ve bundan sonra zarar veren şeyler meydana gelir. Bunun bilgisi Allahu Teala'ın katındadır. İbn Meymun'un Hamza b. ez-ZUbeyr vasıtasıyla Ubade'den nakline göre el-Hakim şöyle demiştir: Bazı müfessirler \"Allah bir insanla ancak vahiy yoluyla veya perde arkasından konuşur yahut bir elçi gönderip, izniyle ona dilediğini vahyeder\"(Şura 51) ayetinin tefsirini yaparken \"perde arkasından\" ifadesini \"rüyada\" şeklinde tefsir etmişlerdir. Nebilerin rüyalarının vahiy olduğu noktasında başka bilginlerin ihtilafı yoktur. Vahye dışarıdan herhangi bir şey karışmaz. Çünkü o korunmuştur. Nebilerin dışındakilerin rüyaları ise böyle değildir. Çünkü onların rüyalarına şeytan girebilir. Hakim bir de şunu söylemiştir: Allahu Teala, rüyada bir melek gönderir. Bu melek Adem oğlunun levh-i mahfuz' daki ahvaline bakar ve bundan bir kopya yapar ve herkes için kendi kıssasına göre bir misal getirir. Kul uyuduğunda bu şeyler ona hikmet yoluyla canlandırılır. Böylece onun kendisine bir müjde veya uyarı ya da azarlama olması hedeflenir. Adem oğluna aralarındaki düşmanlığın şiddetinden dolayı bazen şeytan musallat olur ve onu her yönden tuzağa düşürür, işlerini her yola başvurarak ifsad etmek ister. Rüyasını karıştırır, bunu ya rüyasında karışıklığa yol açarak ya da ondan gafil düşürerek yapar. Öte yandan görülen bütün rüyalar, iki kısma ayrılır. Bunlardan birincisi, sadık rüyadır ki Nebilerin ve onların ardından giden salih kimselerin rüyaları böyledir. Başkaları böyle rüyaları nadiren görür. Bunlar rüyada görülene uygun olarak uyanıkken gerçekleşen rüyalardır. Diğeri ise karışık rüyalardır (adğas). Bunlar herhangi bir uyarı niteliği olmayan rüyalardır. Karışık rüyalar da çeşit çeşittir: Birincisi, rüyayı gören kimseyi üzmek için şeytan ın oyunundan ibarettir. Mesela kişi rüyasında kendi başını kestiğini görür ve kendisi kesik başının ardından gitmektedir ya da korkunç bir duruma düşer ve imdadına koşacak hiç kimseyi bulamaz ya da buna benzer başka şeyler görür. İkincisi, kişi rüyasında meleklerden birisinin kendisine mesela haram bir şeyi veya aklen imkansız olan bir fiili yapmasını emrettiğini görür. Üçüncüsüne gelince, kişi rüyasında uyanıkken aklından geçen veya temenni ettiği bir şeyi görür. Aynı şekilde uyanıkken adeti olan bir şeyi rüyada görmek veya mizacına baskın olan bir şeyi görmek de böyledir. Bunlar galibiyetle geleceğe, çoğunlukla şu ana ve çok az olarak da geçmişe dair şeylerdir. Müellif bundan sonra vahyin başlangıcı hakkındaki Hz. Aişe hadisine yer vermiştir. Buhari, bu hadisi Sahih'in başında zikretmiş biz de orada açıklamıştık. Sonra açıklamasından eksik bıraktığımız noktaları \".......\" ayetinin tefsirinde tamamlamıştık. Burada her iki yerde daha önce büyük bir ihtimaııe geçmeyen ve açıklamasından yarar olacak şeylerden söz edeceğiz. \"Resuliıllah'ın gördüğü her bir rüya mutlaka sabah aydınlığı gibi apaçık meydana çıkardı.\" İbn Ebi Hamza şöyle demiştir: Bunun başka bir şey değil de sabah aydınlığına benzetilmesi şundan kaynaklanmaktadır. Nebilik güneşi doğarken \"rüya\", onun ilk ışıklarını görmek şeklinde olmuştur. Bu aydınlık, genişleye genişleye sonunda güneş doğmuştur. Kimin batını nuranı olursa, o kimse tasdikte Ebu Bekir gibi Bekri olur. Kimin batını karanlıkolursa yalanlamada Ebu Cehil gibi yarasa olur. Diğer insanlar bu iki nokta arasında yer alırlar. Her bir kişi kendisine verilen nur oranında tasdik eder. \"Orada birçok geceler ibadete çekilirdi.\" Kirmani şöyle demiştir: Hz. Nebi'in neye göre ibadet ettiği noktasında ihtilaf edilmiştir. Bu ihtilaf, o daha önceki bir şeriata göre ibadet ederdi veya etmezdi şeklindeki yaklaşıma dayanmaktadır. Çoğunluk ikinci görüşü benimsemiştir. Onların dayanağı, böyle bir şey olsaydı, Resulullah naklederdi şeklindeki akıl yürütmedir. Bazıları, Resulullah'ın o andaki ibadetinin tefekkür tarzında olduğunu söylerken, bazıları kavminin yaptıklarını görmekten kaçınma şeklindeydi demişlerdir. Amidı ve bir grup bilgin, bu ihtimaııerden birincisini tercih etmişlerdir. \"On/ar beni çıkaracak/ar mı?\" Süheyli şöyle demiştir: Efendimizin bu ifadesinden insanın vatandan ayrılmasının ne kadar ağır olduğu anlaşılmaktadır. Çünkü Resulullah (s.a.v) Varaka'nın kavminin kendisine eziyet edip, onu yalanlayacağı şeklindeki sözlerini duyunca herhangi bir can sıkıntısı belirtisi görülmemişti. Memleketten çıkarılacağından söz edince vatan sevgisi ve alışkanlığı dolayısıyla ruhu harekete geçti ve \"On/ar beni çıkaracak/ar mı?\" dedi. Süheyli şöyle devam eder: Bu yaklaşımı istifham elifinden sonra vav harfinin getirilmesi de teyit etmektedir. Halbuki çıkarma, o konuda bir soru üzerine idi. Bu da gösteriyor ki Nebi'in sorusu inkar veya acı duyma tarzında idi. Bunu teyit eden şeylerden birisi de işaret edilen vatanın, Allah'ın haremi, beytinin civarı ve Hz. İsmail'den aleyhisselfun bu yana babalarının beldesi olduğudur. Hz. Nebi'in canının sıkılması, umut ettiği şeyleri elden kaçırma korkusu da olabilir. Çünkü o kavminin Allah'a iman edeceğini ve onları şirkin pisliğinden, cahiliyenin kirlerinden ve ahiretin azabından kurtaracağını umuyordu. Böylece onlara gönderilmesindeki maksada erişmiş olacaktı. Resulullah'ın canının sıkılması her iki sebepten de kaynaklanmış olabilir. \"Ona yine aynı sözleri söylemişti.\" İsmam şöyle der: Muhaddislere dil uzatanıardan birisi gerçekleri çarpıtarak şöyle demiştir: Hz. Nebi nasılolur da Nebiliği hakkında şüpheye düşer ve Varaka'ya başvurur, Hatice'ye korktuğundan şikayet eder ve bu yüzden kendisini aşağı atmak için bir dağın zirvesine çıkar? O kişi sözlerine şöyle devam eder: Hz. Nebi s.a.v.'in -Rabbinden kendisine ineni gördüğü halde- şüphe duyması caiz olursa o zaman -ona ineni gözüyle görmediği halde- kendisine gelen hususunda şüphe duyan kimseye nasıl tepki gösterecektir? İsmam şöyle der: Bunun cevabı şudur: Allahu Teala'ın adeti, ağır bir görevi yarattıklarından birisine ulaştırmaya hükmettiğinde bundan önce bir adaylık ve hazırlama (tesis) dönemi geçirtmesi şeklinde tecelli etmiştir. Resulullah'ın görmüş olduğu sadık rüyalar, yalnız başına kalma sevgisi ve ibadete çekilmesi, işte bu hazırlama ve adaylıklardandır. Melek, kendisine gelince ansızın karşısına çıktı. Bu, normal ve alışılmış duruma benzemeyen bir haldi. Bundan dolayı onun beşer tabiatı bundan kaçtı ve bu durum onu korkuttu. Dolayısıyla içinde bulunduğu hal üzerinde düşünme fırsatı bulamadı. Çünkü Nebilik, insanın beşer olma karakterini tamamen ortadan kaldırmaz. Dolayısıyla onun alışmadığı bir şeyden kaygı duyması ve tabiatının ondan kaçınması, şaşılacak bir şey değildir. Nebi, karşılaştığı bu yeni duruma alişıp, ülfet ettiğinde yoluna devam etmiştir. Bundan dolayı Resulullah sıcaklığına alıştığı ailesine dönmüş, ona karşılaştığı durumu bildirmiş, eşi de onu üstün ahlakı ve güzel yaşantısından tanıdığı için korkusunun yersiz olduğunu belirtmiş, kendisini Varaka'ya götürerek onun desteğini almak istemiştir. Çünkü onun doğruluğunu, bilgisini ve eski kitapları okuduğunu bilmekte idi. Resulullah, Varaka'nın açıklamasını dinleyince, hakka kesin olarak inanmış ve bunu itiraf etmiştir. Öte yandan Nebiliğe hazırlama (tesis) öncesinde meydana gelen olaylardan birisi de Nebiin yavaş yavaş alışması ve ünsiyet peydah etmesi için vahye bir süreliğine ara vermektir. Vahyin kesilmesi ona ağır geldi. Çünkü kendisine Allah adına henüz \"Sen Allah'ın Resulüsün ve kullarına gönderilmiş bir Nebisin\" diye hitap edilmemişti. Bundan dolayı karşılaştığı şeyin ilk defa gerçekleşen bir olayolmasından ve Cebrail'.in sorduğu soruya cevap vermemiş olmaktan korku duydu ve qüntüye kapıldı. Nebilik yüklerini taşımaya alışıp, kendisine gelen görevin ağırlığına tahammül edince Allahu Teala ona verdiği görevi bilindiği şekliyle açıverdi",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6983,
			"arabicnumber": 6983,
			"text": "Enes b. Malik r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem: \"Salih bir kişi tarafından görülen güzel rüya, Nebiliğin kırk altı cüzünden bir cüzdür\" buyurmuştur. Fethu'l-Bari Açıklaması: \"Salih bir kişi tarafından görülen güzel rüya.\" Mühelleb şöyle demiştir: Söylenmek istenen salihlerin rüyalarının büyük bir kısmı demektir. Aksi takdirde salih kimse de bazen karışık rüyalar görebilir. Fakat bu, şeytan ın onlara hakimiyetinin az olmasından dolayı nadirdir. Oysa salih olmayan kimseler böyle değildir. Zira onların gördükleri rüyalardaki doğruluk payı, şeytan ın kendilerine tasallutunun baskın olmasından dolayı nadirdir. Mühelleb şöyle der: İnsanlar bu konuda üç dereceye ayrılırlar. Birincisi Nebilerdir. Onların rüyalarının tamamı doğrudur. Gördükleri rüyaların bazılarında tabire ihtiyaç olanlar olabilir. İkincisi salihlerdir. Bu kimselerin gördükleri rüyaların büyük bir kısmı doğru çıkar. Bazen onların rüyalarında tabire muhtaç olmayanlar olabilir. Üçüncüsü salihlerin dışındakilerdir. Bunların rüyalarında doğruluk payı olduğu gibi, gördükleri karmakarışık şeyler de olabilir. Bu gruptakiler kendi aralarında üçe ayrılırlar: a. Durumu kapalı olanlar: Onların hakkında çoğunlukla her iki ihtimal eşit eşittir. b. Fasıklar: Fasıkların rüyalarında galip olan karmakarışık olmaktır. Bu gibi kimselerin rüyalarında doğruluk payı azdır. c. Kafirler: Bu grubun rüyasında doğruluk çok nadir, olarak rastlanan bir şeydir. Resulullah Sallallahu Aleyhi ve Sellem'in \"Rüyası en doğru olanınız, sözü en doğru 0lanınızdır\"(Müslim, Rüya) ifadesi buna işaret etmektedir. Bu hadisi Müslim rivayet etmiştir. Rüyada ayaklarından bağlı olduğunu görme bölümünde bu hadise inşallah işaret edilecektir. Hz. Yusuf aleyhisselam ile birlikte hapiste yatan iki kişiyle, onların hükümdarlarının rüyaları ve başkaları örneğinde olduğu gibi bazı kafirlerin sadık rüyalar gördükleri vaki olmuştur. \"Nebiliğin kırk altı cüzünden bir cüzdür.\" Nebilik, Nebi s.a.v. ile birlikte sona erdiği halde rüyanın Nebilikten bir cüz olması, problemli bir durum olarak görülmüştür. Bunun cevabında şöyle denilmiştir: Rüyayı gören Hz. Nebi s.a.v. ise bu gerçekten onun Nebiliğinin cüzlerinden bir cüzdür. Hz. Nebi'in dışında birisi rüya görmüşse bunun, Nebiliğin cüzlerinden bir cüz olması mecaz yollu bir ifadedir. Hattabi şöyle demiştir: Söylenildiğine göre hadisin manası şudur: Rüya, Nebiliğin geri kalan bir parçası olarak değil, (gaybı raber alma açısından) Nebiliğe benzer olarak gelir. Bazılarına göre hadisin manası şudur: Rüya, Nebilik ilminin bir parçasıdır. Zira Nebilik her ne kadar sona ermişse de ilmi bakidir. İbn Abdilberr'in naklettiği bir haberde yer alan sözü dolayısıyla İmam Malik tenkit edilmiştir. Ona \"Herkesin rüyası tabir edilir mi?\" diye sorulmuş, o da \"Nebilikle oynanır mı?\" demiş, sonra \"Rüya Nebilikten bir cüzdür. Nebilikle oynanmaz\" diyerek devam etmiştir. Buna verilecek cevap şudur: İmam Malik, rüyanın Nebiliğin geride kalan bir parçası olduğunu söylemek istememiştir, onun söylemek istediği rüya bazı gaybi bilgilere sahip olma açısından Nebiliğe benzediği için onun hakkında bilgisizce konuşmak uygun değildir. İbn Battal şöyle demiştir: Rüyanın Nebilikten bir cüz olması, -bu, Nebiliğin binde bir cüzü bile olsa- büyük görülen şeylerdendir. Şöyle demek mümkündür: \"Nübüvvet=Nebilik\" sözcüğü dil açısından \"i'lam=bildirme\" anlamına olan \" •. :JI\" kökünden alınmadır. Buna göre hadisin manası şöyle olur: Rüya Allahu Teala'tan gelen bir haber-i sadıktır, yoksa yalan değildir. Nitekim nübüwetin manası da Allah'tan gelen ve hakkında yalan söylemenin caiz olmadığı doğru haber demektir. Netice olarak rüya, haberin doğruluğu açısından Nebiliğe benzemiştir",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6984,
			"arabicnumber": 6984,
			"text": "Ebu Katade'nin nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"Doğru rüya Allah tarafındandır. Hulmde şeytandandır\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6985,
			"arabicnumber": 6985,
			"text": "Ebu Said el-Hudrl'nin nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Herhangi biriniz sevdiği bir rüya görürse bilsin ki o muhakkak Allah tarafındandır. Rüya sahibi bu rüyası üzerine Allah'a hamdetsin ve başkasına da söylesin. Bunun dışında hoşlanmadığı bir rüya gördüğünde de muhakkak bu rüya da şeytandandır. Bu takdirde rüya sahibi rüyanın şerrinden Allah'a sığınsın ve rüyasını kimseye söylemesin. Böylece o rüya kendisine zarar vermez. \" Fethu'l-Bari Açıklaması: \"Rüyanın Allah tarafından olduğu.\" Yani hadiste \"saliha\" şeklinde kayıtlansa da rüyanın mutlak olarak Allah'tan olduğu. Rüyanın salih olarak nitelenmesi, şeytanın müdahalesine imkan olmaması açısındandır. Buna karşılık şeytanın müdahalesinin mümkün olduğu rüyalarda rüyanın ona nispet edilmesi mecazidir. Çünkü bütün rüyalar, yaratılma ve takdir edilme açısından Allah tarafındandır. Rüyanın Allah'a izafe edilmesi onu şereflendirmek içindir. \"Hulm de şeytandandır.\" \"Hulmün şeytandan olduğu\" başlığı altında müellifin \"Herhangi biriniz hoşlanmadığı bir rüya görecek olursa (uyanınca hemen) sol tarafına tükürsün ve ondan Allah'a sığınsın. Bu suretle o rüya, o kişiye zarar vermez\" şeklinde bir hadis daha gelecektir. Mühelleb şöyle demiştir: Şari karışıklıktan halis olan rüyaya salih ve sadık adını vermiştir ve bunu Allahu Teala'ya izafe etmiştir. Karışık rüyalara ise \"hulm\" adını vermiş ve bunu şeytana izafe etmiştir. Zira böyle bir rüya, şeytanın benzeri yaratılmıştır. Resulullah insanlara şeytan ın hilesini bildirmiş, onlara kendilerini üzme ve korku salma noktasında şeytanı maksadına ulaştırmamaları için bunu savuşturmanın yolunu göstermiştir. \"Ve rüyasını kimseye söylemesin. Böylece o rüya kendisine zarar vermez.\" Kısacası salih rüya adabı olarak üç şeyden söz etmek mümkündür: Rüya gören bundan dolayı Allah'a hamdetmeli, bunu bir müjde olarak almalı ve başkalarına anlatmalıdır. Fakat kendisinden hoşlanmayana değil, kendisini sevene anlatmalıdır. Kısacası hoşlanılmayan bir rüya adabı olarak dört şeyden söz edilmiştir. Görülen rüyanın şerrinden ve şeytanın kötülüğünden Allah'a sığınmalı, uykusundan uyandığında üç kez sol tarafına tükürmeli ve bu rüyayı hiç kimseye anlatmamalıdır. Müellifin \"rüyada ayaklarından bağlı olduğunu görmek\" başlığı altında Ebu Hureyre'den nakledilen bir rivayette bir beşinci edepten bahsedilmektedir. Bu da namaz kılmaktır. Bu hadisin lafzı şöyledir: \"Kim rüyada hoşlanmayacağı bir şey görürse bunu hiç kimseye söylemesin ve kalkıp namaz kılsın.\" Ancak Buhari bu hadisin mevsul olduğunu açık olarak belirtmemiş, Müslim ise belirtmişti. Müslim bir altıncı edepten daha bahseder. Bu yattığı taraftan öbür tarafına dönmektir. Cabir'in nakline göre Resulullah şöyle buyurmuştur: \"Herhangi biriniz hoşlanmadığı bir rüya görürse üç kez sol tarafına tükürsün, üç kez Allah'a sığınsın ve yattığı taraftan öbür tarafa dönsün. \" Rüyanın kötülüğünden nasıl sakınılacağına dair sahih bir haber bulunmaktadır. Bu haberi Said b. Mansur, İbn Ebi Şeybe ve Abdurrezzak sahih isnadlarla İbrahim en-Nehaı' den şöyle nakletmişlerdir: \"İçinizden herhangi biriniz rüyasında hoşlanmadığı bir şey görecek olursa uyandığında şöyle desin: Allah'ın me\" leklerinin ve Nebilerinin sığındıkları şeyle bu rüyanın \"dinim ve dünyam açısından hoşlanmadığım bir şeyin başıma gelmesi\" şeklindeki kötülüğünden Allah'a sığınırım.\" Rüyada korkmaktan sığınma konusunda İmam Malik'in Muvatta'ında şöyle bir haber yer alır: Bana ulaşan bir habere göre Halid b. Velid \"Ya Resulallah! Ben rüyada korkutuluyorum\" deyince, ResuluIlah Sallallahu Aleyhi ve Sellem \"Şöyle dua et!\" buyurduktan sonra şu duayı öğretmiştir: ''l\\llah'ın gazabından, ikabından, kullarının kötülüklerinden, şeytanların kışkırlmasından, bana kötülük yapmalarından Allah'ın tam olan kelimelerine sığınınm. \"(İmam Malik, Şiir)",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6986,
			"arabicnumber": 6986,
			"text": "Ebu Katade'nin nakline göre ResuluIlah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Salih rüya Allah tarafındandır. Hulm de şeytandandır. Biriniz hulm gördüğünde bundan Allah'a sığınsın, sol tarafına tükürsün. Bu suretle o düş, sahibine zarar vermez",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6987,
			"arabicnumber": 6987,
			"text": "Enes b. Malik r.a.'in Ubade b. es-Samit'ten nakline göre ResuluIlah Sallallahu Aleyhi ve Sellem \"mu'minin rüyası Nebiliğin kırk altı cüzünden bir cüzdür\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6988,
			"arabicnumber": 6988,
			"text": "Ebu Hureyre r.a.'in nakline göre ResuluIlah Sallallahu Aleyhi ve Sellem \"mu'minin rüyası Nebiliğin kırk altı cüzünden bir cüzdür\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6989,
			"arabicnumber": 6989,
			"text": "Ebu Said el-Hudri'nin nakline göre ResuluIlah Sallallahu Aleyhi ve Sellem \"Salih rüya Nebiliğin kırk altı cüzünden bir cüzdür\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6990,
			"arabicnumber": 6990,
			"text": "Ebu Hureyre r.a.'in nakline göre ResuluIlah Sallallahu Aleyhi ve Sellem \"Nebilikten geriye mübeşşirattan başka bir şey kalmadı\" buyurmuştur. Fethu'l-Bari Açıklaması: \"Nebilikten geriye mübeşşirattan başka bir şey kalmam/ştır.\" Bunun manası bana mahsus olan Nebilikten mübeşşirattan başka. geriye bir şey kalmamıştır demektir. ResuluIlah bunu daha sonra \"rüya\" ile tefsir etmiştir. İbn Abbas hadisinde Resulullah'ın bu sözü vefatı ile sonuçlanan hastalığmcla söylediği naklediImiştir. Müslim, Ebu Dawd ve Nesal'nin rivayet ettikleri bir habere göre Resulullah s.a.v. vefatıyla sonuçlanan hastalığında başı sarılmış bir halde evinin kapısı üzerinde asılı olan perdeyi açtı. Cemaat Ebu Bekir'in arkasında saf tutmuştu. Efendimiz şöyle buyurdu: \"Ey insanlar! Müslümanın gördüğü veya ona gösterilen salih rüyadan başka Nebilik müjdecilerinden geriye bir şey kalmam/ştır. \" Mühelleb şöyle demiştir: Kısacası \"rüya\"yı \"müjdeciler\" şeklinde yorumlamak, genellikle göz önüne alınarak yapılan bir şeydir. Çünkü rüyalardan \"uyarıcı\" olanlar da vardır. Bunlar da sadık rüyalar olup, Allahu Teala mu'min kuluna şefkatinden dolayı meydana gelecek bir şeyi henüz gerçekleşmeden önce ona hazırlansın diye göstermektedir. ibnü't-Tın şu açıklamayı yapar: Hadisin manası şöyledir: Vahiy benim vefatımla birlikte kesilecektir. İleride olacakları öğrenmek için rüyadan başka bir araç kalmayacaktır. Ancak ibnü't-Tın'e \"Bir de ilham vardır\" diye itiraz edilmiştir. Çünkü ilhamda da ileride olacakları haber verme niteliği vardır. ilham, Nebiler açısından rüyada olduğu gibi vahiy mesabesindedir. Hz. Ömer'in menkıbelerinde yer alan hadiste geçtiği üzere ilham, Nebi olmayan kimseler için de sözkonusudur. \"Geçmiş ümmetierde muhaddesler bulunmaktaydı.\" Hadiste geçen \"muhaddes\" kelimesi, ilhama mazhar olanlar şeklinde tefsir edilmiştir. Bu itiraza verilecek cevap şudur: Bunun rüyaya hasredilmesi, tek tek bütün mu'minleri kapsamasından dolayıdır. Oysa ilham öyle değildir. Çünkü o, bazı kimselere mahsustur. ilham bazı kimselere mahsus olmakla birlikte nadiren gerçekleşen bir durumdur. Rüyanın zikredilmesi, yaygın olması ve çok vuku bulmasındandıL Hz. Nebi'in \" 0\" şeklindeki ifadesi buna işaret etmektedir. Onun zamanında ilhamın azlığı ve kendisinden sonra çokluğunun arkasında yatan sır, uyanıkken ona çoğunlukla vahyin gelmesi ve kendisinden mucize göstermesi isteğidiL Bu durumda uygun olanı onun zamanında kendisinden başkalarından herhangi bir şeyin vuku bulmamasıdır. Efendimizin vefatıyla vahiy kesilince, Allahu Teala'ın seçmiş olduğu kimselere ilham gelmeye başladı. Zira vahiyle ilhamın birbirine karışma tehlikesi kalmamıştı. Rüyanın çok görülmesi ve meşhur olmasına rağmen bunun meydana geldiğini inkar etmek kÖrü körüne diretmekten başka bir şey değildir",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6991,
			"arabicnumber": 6991,
			"text": "İbn Ömer r.a. şöyle demiştir: Bazı kimselere rüyalarında kadir gecesinin Ramazanın son yedi günü içinde olduğu gösterildi. Diğer bazılarına da onun Ramazanın son on günü içinde olduğu gösterildi. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem: \"Sizler kadir gecesini Ramazanın son yedi gecesi içinde araştırinız\" buyurdu. Fethu'l-Bari Açıklaması: \"Bir topluluğun aynı rüyayı görmesi.\" Yani bir grubun -kullandığı ifadeler farklı olmakla birlikte- aynı rüya üzerinde uyuşmaları. Bu hadisten bir topluluğun tek bir rüya üzerinde uyuşmalarının, onun sadık ve doğru bir rüya olduğunu gösterdiğini anlıyoruz. Aynı şekilde bir topluluğun haberler üzerindeki benzer nakillerinin o haberin kuvvetini gösterdiğini de çıkarıyoruz",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6992,
			"arabicnumber": 6992,
			"text": "Ebu Hureyre r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem: \"Eğer ben zindanda Yusuf'un kaldığı kadar kalsaydım da sonra bana kral tarafından davetçi gelseydi, ben hemen ona icabet ederdim\" buyurmuştur. Fethu'l-Bari Açıklaması: \"Hapiste bulunanların, fesat ve şirk ehli kimselerin rüyaları.\"diye Buharinin attığı başlık Daha önce sahih rüyanın genellikle salih kimselere mahsus olmakla birlikte başkaları tarafından da görülebileceğine işaret etmiştik. Rüya tabiri yapan alimler şöyle derler: Bir kafir veya fasık salih bir rüya gördüğü takdirde bu mesela ona iman veya tövbe etmesi şeklinde hidayet edileceğine dair bir müjde ya da kafir veya fasık kaldığı takdirde bir uyarıdır. Bazen de onun dışında ailesinden biri hakkında müjde de olabilir. O kişi, içinde bulunduğu durumdan razı olduğunu gösteren şeyler görür. Oysa bu bir imtihan, aldanma ve hile kabilinden olabilir. Bundan Allah'a sığınırız",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6993,
			"arabicnumber": 6993,
			"text": "Ebu Hureyre r.a. şöyle demiştir: Ben Nebi Sallallahu Aleyhi ve Sellem'den işittim. Şöyle buyuruyordu: \"Kim beni rüyasında görürse muhakkak o, uyanık bir halde görecektir. Çünkü şeytan benim kılığıma giremez",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6994,
			"arabicnumber": 6994,
			"text": "Enes'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Kim beni rüyada görürse muhakkak o beni görmüştür. Çünkü şeytan benim kılığıma giremez. mu'minin rüyası, Nebiliğin kırk altı cüzünden bir cüzdür",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6995,
			"arabicnumber": 6995,
			"text": "Ebu Katade'nin nakline göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Salih olan rüya Allah tarafındandır. Hulm de şeytandandır. Kim rüyada hoşuna gitmeyecek bir şey görürse (uyanınca) sol tarafına üç defa 'tuh' desin ve şeytanın şerrinden Allah'a sığınsın. Bu suretle o düş, sahibine zarar vermez ve muhakkak ki şeytan benim kıfığıma giremez",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6996,
			"arabicnumber": 6996,
			"text": "Ebu Katade'nin nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"Kim beni rüyada görürse muhakkak o hakkı görmüştür\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 6997,
			"arabicnumber": 6997,
			"text": "Ebu Said el-Hudri, Nebi Sallallahu Aleyhi ve Sellem'den şöyle işitmiştir: \"Kim beni rüyada görürse muhakkak o hakkı görmüştür. Çünkü şeytan benim şekil ve kılığıma giremez.\" Fethu'l-Bari Açıklaması: \"Ebu Abdullah el-Buhari şöyle demiştir: İbn Sirin, hadiste sözü edilen durum, kişi Hz. Nebi'yi kendi özel suretinde gördüğü zaman geçerli olur demiştir.\" Biz bu haberi mevsul olarak şöyle rivayet etmiştik: İbn Sirin'e adamın biri Resulullah'ı rüyasında gördüğünü söyleyince ona şöyle dedi: \"Gördüğünü bana anlat.\" Rüyayı gören kişi ona İbn Sirin'in bilmediği birtakım niteliklerden bahsedince \"Sen Resulullah'ı görmemişsin\" dedi. Bu haberin senedi sahihtir. Ben Hakim'de sözkonusu haberi teyid eden bir rivayete rastladım. Asım b. Kuleyb'in nakline göre babası şöyle anlatmıştır: İbn Abbas'a \"Nebi s.a.v.'i rüyamda gördüm\" dedim. Bana \"Onu bana anlat\" dedi. Ben de Hz. Ali'nin oğlu Hz. Hasan'ı hatırladım ve onu Resulullah'a benzettim. İbn Abbas \"Onu görmüşsün\" dedi. Bu haberin isnadı ceyyiddir. Kurtubi şöyle der: Bu hadisin tevilinde sahih olanı şudur: Resulullah'ın söylemek istediği, onun her durumda görülmesi batıl olmadığı gibi bu, karmakarışık rüyalardan da değildir. Tam tersine bu -kendi kılığı dışında görülmüş olsa bile- özünde hak ve gerçektir ve bu şekil şeytandan değildir. Aksine Allahu Teala tarafındandır. Kadi Ebu Bekir b. et-Tayyib ve başkalarının görüşü bu doğrultudadır. \"O hakkı görmüştür\" ifadesi bunu teyid etmektedir. Yani o kimse kendisini görene bildirilmesi amaçlanan gerçeği görmüştür. Gördüğü rüya zahiri üzere oluyorsa ne ala! Aksi takdirde onu tevil etmeye çabalar ve gördüğü rüyayı değer vermemezlik etmez. Zira o ya bir hayrı müjdelemektedir ya da bir kötülükten dolayı uyarıda bulunmaktadır. Bununla Allahu Teala o kişiyi korkutmayı amaçlamıştır veya onun sözkonusu kötülükten el çekmesini istemektedir ya da dini veya dünyası hakkında karşılaşacağı bir şeyin sonucu hakkında kendisini uyarmaktadır. İbn Battal şöyle der: Resulullah \"Muhakkak o uyanık bir halde beni görecektir\" ifadesiyle bu rüyanın uyanık halde tasdikini, sahih olduğunu ve hak üzere gerçekleştiğini vurgulamak istemektedir. Yoksa maksadı o kişinin kendisini ahirette göreceği değildir. Zira o kıyamet günü Resulullah'ı uyanık bir halde görecektir. Hz. Nebi'i rüyada görenle görmeyen dahil olmak üzere bütün ümmeti kıyamet' günü onu görecektir. İbnü't-Tın şöyle demiştir: Maksat hayatında ona iman edip, ancak görmeyen kimsedir. Çünkü o kimse o anda Resulullah'ın yanında değildir. İşte böylece ona iman edip, ancak görmeyen herkes, vefat etmeden önce uyanıkken onu göreceği şekilde müjdelenmiş ol-maktadır. Bu görüş el-Gazzaz' a aittir. Ebu Sa'd Ahmed b. Muhammed b. Nasır şöyle demiştir: Her kim Resulullah'ı kendi hali ve kılığı üzere görecek olursa bu, o kişinin salih, mertebesinin mükemmel ve düşmanına zafer kazanacağını gösterir. Her kim de Resulullah'ı mesela durumu değişik, suratı asık görecek olursa bu o kişinin durumunun kötü olduğunu gösterir. Şeyh Ebu Muhammed b. Ebu Cemre, Nevevl'nin tercih ettiği görüşe meyletmiş ve ihtilafı naklettikten sonra' şöyle demiştir: Alimler arasında şeytanın Resulullah'ın kılığına asla giremeyeceğini söyleyenler vardır. Her kim Resulullah'ı güzel bir biçimde görecek olursa bu o kimsenin dini açısından güzeldir. Resulullah'ın organlarından herhangi birinde çirkinlik veya noksanlık görmek, din açısından o kişinin eksikliği anlamına gelir. Şeyh Ebu Muhammed şöyle devam eder: Gerçek olan budur: Bu gerçek denenmiş ve bu şekilde olduğu müşahede edilmiştir. Böylece Resulullah'ı rüyada görmede en büyük fayda hasıl olmaktadır ki rüyayı gören kendisinde bir eksiklik olup olmadığını böylece anlamafırsatı elde eder. \"Kim beni rüyada görürse muhakkak o beni görmüş gibidir.\" Benim bu ifadeden anladığım şudur: Resulullah şunu demek istiyor: Beni rüyasında herhangi bir kılıkta gören kimse, bundan sevinsin ve bunun hulm olan batıl değil, Allah'tan gelen bir hak rüya olduğunu bilsin. Çünkü şeytan benim kılığıma giremez",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 6998,
			"arabicnumber": 6998,
			"text": "Ebu Hureyre'nin nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Bana mefatihu’l-kelim (sözlerin anahtarları) verildi. Bana korku salmak suretiyle yardım edildi. Dün gece uyuduğum bir sırada bana yeryüzünün hazinelerinin anahtarları getirildi. Hatta bunlar avucumun içine konuldu",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 6999,
			"arabicnumber": 6999,
			"text": "Abdullah b. Ömer'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Bu gece rüyamda kendimi Kabe'nin yanında buldum. Orada esmer bir adam gördüm ki, o görmekte olduğum esmer erkeklerin en güzeliydi. Onun kulak memelerini geçmiş bir saçı vardı ki o da görmekte olduğum saçların en güzel türünden olup, bunları taramıştı ve bu saçlardan su damlıyordu. Bu zat iki adam üzerine -yahut iki kişinin omuzları üzerine- dayanarak Kabe'yi tava! ediyordu. Ben 'Bu kimdir?' diye sordum. 'Bu, Meryem'in oğlu Mesih'tir' denildi. Sonra birden kıvırcık saçlı, sağ gözü şaşı, sanki salkımındaki emsalinden dışarı çıkmış iri bir üzüm tanesi gibi olan bir adamla karşılaştım. 'Bu kimdir?' diye sordum. Bana 'Deccal, Mesih'tir' denildi",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 7000,
			"arabicnumber": 7000,
			"text": "İbn Abbas r.a. adamın birinin Resulullah'a geldiğini ve \"Bana bu gece rüyamda ... gösterildi\" dediğini nakleder. Bu hadisin baş tarafı 7046 numarada da var. Fethu'l-Bari Açıklaması: \"Geceleyin görülen rüya.\" Yani bir kimsenin geceleyin gördüğü rüya gündüz gördüğü rüya ile bir midir yoksa birbirinden farklı mıdır? Bunların her birinin zamanı arasında farklılık var mıdır? Buhari attığı bu başlıkla Ebu Said'in naklettiği \"Rüyanın en sadık olanı, seher vakti görülenidir\" şeklindeki hadise işaret etmektedir. Bu hadisi Ahmed b. Hanbel merfu olarak nakletmiş, İbn Hibban sahih olduğunu belirtmiştir. (Ahmed b. Hanbel, III, 68; İbn Hibban, Sahih, XIII, 407) Nasr b. Yakub ed-Oineveri'nin ifadesine göre gecenin başlarında görülen rüya geç çıkar. Gecenin ikinci yarısından sonra görülen ise görüldüğü anın durumuna göre farklı hızda çıkar. Rüyaların içinde en çabuk çıkanı seher vakti görülendir. Özellikle tan yeri ağardığı esnada görülen rüya en hızlı çıkandır. \"Dün gece uyuduğum bir sırada bana yeryüzünün hazinelerinin anahtarlan getirildL\" Bu hadisin genişçe bir açıklaması inşallah İ'tisam bölümünde gelecektir",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 7002,
			"arabicnumber": 7002,
			"text": "",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 7003,
			"arabicnumber": 7003,
			"text": "Harice b. Zeyd b. Sabit'in nakline göre Ensar'dan bir kadın olan Ümmü'l-Ala Resulullah Sallallahu Aleyhi ve Sellem'e bey'at etmişti. Ümmü'l-Ala hadisin ravisi Harice'ye (Hicrette) Muhacirleri aralarında kura ile taksim ettiklerini haber vererek şöyle dedi: Bizim payımıza Osman b. Maz'un düşmüştü. Onu evlerimizde konuk ettik, fakat Osman'ın (bir müddet sonra) ölüm sebebi olan o ağrısı tuttu. Vefat edince yıkandı ve kendi elbisesi içine kefenlendi. Sonra Resulullah cenazesinin yanına geldi. Ümmü'l-Ala şöyle devam etti: Ben (cenazeyi tezkiye ederek) \"Ey Ebü'sSaib! Allah'ın rahmeti üzerine olsun! Benim şahadetim şudur ki: Allah muhakkak sana ikram etmiştir!\" dedim. Bunun üzerine Resulullah \"Allah Teala'nın ona ikram buyurduğunu nereden biliyorsun?\" Ben de \"Ya Resulallah! Babam sana feda olsun! Allah ona ne zaman ikram eder?\" dedim. Resulullah Sallallahu Aleyhi ve Sellem \"Yemin ederim ki ona yakfn gelmiştir ve yine Allah'a yemin ederim ki ben de onun için hayır umuyorum. Yine Allah'a yemin ederim ki -ben Allah'ın Resulü iken- bana (Allah tarafından) ne muamele edileceğini bilemem!\" buyurdu. Bunun üzerine Ümmü'l-Ala dedi ki: \"Vallahi bundan sonra ben kimseyi asla tezkiye etmiyorum",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 7004,
			"arabicnumber": 7004,
			"text": "Bu hadis Zührl' den de bu şekilde nakledilmiştir. Onun rivayetinde şöyle bir ifade yer almaktadır: \"Bana (Allah tarafından) ne muamele edileceğini bilemem.\" Ümmü'l-Ala: \"Resulullah'ın bu sözü beni kederlendirdi. Ardından uyudum. Rüyamda Osman'a ait akmakta olan bir pınar gördüm. Uyanınca bu rüyayı Resulullah Sallallahu Aleyhi ve Sellem'e haber verdim. Resulullah \"(Bu gördüğün akan pınar) onun amelidir\" buyurdu. Fethu'l-Bari Açıklaması: \"Kadınların rüyası.\" İbn Battal saliha ve mu'min olan kadının gördüğü rüyanın \"Salih mu'minin rüyası Nebilik cüzlerinden bir cüzdür\" hadisine dahil olduğu noktasında ittifak olduğunu belirtmiştir. İmam Buhari bu bölümde Osman b. Maz'un olayı ile Ümmü'l-Ala'nın onun akan bir pınara sahip olduğunu görmesini konu alan hadise yer vermiştir. Bu hadisin açıklaması Cenaiz bölümünün baş taraflarında geçmişti",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 7005,
			"arabicnumber": 7005,
			"text": "Resulullah s.a.v.'in sahabilerinden ve süvarilerinden Ebu Katade el-Ensarı şöyle demiştir: Ben Resulullah Sallallahu Aleyhi ve Sellem'den işittim şöyle buyuruyordu: \"Rüya Allah tarafındandır. Hulm de şeytandandır. Herhangi biriniz hoşlanmadığı bir rüya görecek olursa (uyanınca hemen) sol tarafına tükürsün ve ondan Allah 'a sığınsın. Bu suretle o rüya, o kişiye zarar verrryez",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 7006,
			"arabicnumber": 7006,
			"text": "İbn Ömer'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle demiştir: \"Uyuduğum bir sırada bana silt dolu bir kadeh verildi. Bu kadehten o kadar içtim ki, süte kanma eserlerinin ta tırnaklarından sızdığını hala duyuyorum. Sonra artanını Ömer'e verdim.\" Sahabiler \"Ya Resulallah! Bunu ne ile tabir ettin?\" diye sordular. Resulullah \"İlim ile\" cevabını verdi. Fethu'l-Bari Açıklaması: \"Rüyada süt görme.\" Yani rüyada süt görüldüğünde bu ne ile tabir edilecektir? Mühelleb şöyle demiştir: Süt fıtrat, sünnet, Kur'an ve ilme delalet eder. Biz de şunu ekleyelim: Bazı merfu hadislerde sütün fıtratla tabir edildiği yer almaktadır. Nitekim Bezzar'ın, Ebu Hureyre'den nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"Rüyada görülen süt fıtrattır\" buyurmuştur. Taberani'de Ebu Bekre'nin nakline göre Resulullah \"Her kim rüyasında süt içtiğini görürse bu fıtrattır\" buyurmuştur. Eşribe bölümünün baş tarafında Ebu Hureyre hadisinde Resulullah'ın süt kadehini alınca Cebrail'in ona \"Sana fıtratı gösteren Allah'a hamdolsun\" dediği yer almaktaydı. \"Bunu ne ile tabir ettin?\" İbnü'l-Arabi şöyle der: Süt, Allahu Teala'ın kan ve fışkı gibi pis şeylerden süzüp, çıkarmış olduğu hoş bir nzıktır. Bu açıdan süt ilme benzer. İlim de Allahu Teala'ın cehaletin karanlığından ortaya çıkardığı bir nurdur. Rüyada ilme bir örnek getirilmiştir. Bazı arifler şöyle derler: Sütü fışkı ile kan arasından süzüp çıkaran yaratıcı, marifeti de şek ve cehalet arasından çıkanp yaratmaya ve o ameli, gafletten ve hatadan korumaya da kadirdir. Bu mesele o kişinin dediği gibidir fakat ilmin öğrenmekle elde edileceği yolunda bir düzenli kural vardır. O arifin sözünü ettiği şey ise harikulade olarak bazen vuku bulabilir. Bu takdirde sözkonusu ilim keramet kabilinden olur. İbn Ebi' Cemre şöyle der: Resulullah Sallallahu Aleyhi ve Sellem rüyada görülen sütü, kendisine bir şarap, bir de süt kadehi getirildiğinde ve kendisi sütü tercih ettiğinde Cebrail ona \"Fıtratı seçtin\" demesine kıyasen ilimle te vii etmiştir. Hadisten Çıkan Sonuçlar 1- Makamı ve mertebesi büyük olan bir kimse, gördüğü rüyayı kendisinden daha aşağı olan kimselere anlatabilir. 2- Bir alim bazı meseleleri gündeme getirerek etrafında bulunan kişilere bunun tabirini teklif ederek onları deneyebilir. 3- Öğrencinin sahip olduğu tevil ilmini hocasının eseri olarak takdim etmesi edeptendir. İbnü'I-Arabi' şöyle der: Öyle anlaşılıyor ki Resulullah s.a.v. sahabilerden o rüyayı tevil etmesini istemedi. Onun asıl istediği söz konusu rüyanın tabirini kendisine sormalarıdır. Nitekim sahabiler Hz. Nebi'in maksadını anlamışlar, ona bunun tevilini sormuşlar, Resulullah da cevabını vermiştir. İlim talibi olan kimselerin her durumda bu edebe uymaları uygun ve isabetlidir. İbnü'I-Arabi' şöyle devam eder: 4- Hz. Nebi'in Allah'l bilme noktasındaki derecesine hiçbir kime ulaşamaz. Zira o sütü o derece içmiştir ki ona kanıp doyma, tırnaklarının ucundan sızmıştır. İçtiği sütün artığını Hz. Ömer' e vermesi ise onun Allah'ı bilme noktasında ulaştığı dereceye işaret etmektedir ki Hz. Ömer Allah konusunda hiç kimsenin kınamasına aldırmazdı. 5- Rüyaların arasında geçmişe, şimdiye ve geleceğe delalet edenler vardır. Resulullah'ın gördüğü bu rüya geçmişe tevil edilmiştir. Zira onun bu rüyası gerçekleşmiş olan bir hususu canlandırmaktadır. Çünkü Resulullah kendisine verilen ilme sahip olmuştu. Hz. Ömer de böyle idi. Efendimizin görmüş olduğu bu rüyanın faydası, kendisine verilen ilimle, Ömer' e verilen ilim arasındaki münasebetin derecesinin bilinmesidir",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 7007,
			"arabicnumber": 7007,
			"text": "Abdullah b. Ömer r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle anlatmıştır: \"Uyuduğum bir sırada bana süt dolu bir kadeh verildi. Bu kadehten o kadar içtim ki kamp doymayı ta parmak uçlarımdan çıkarken duyuyordum. Sonra artanım Ömer b. el-Hattab'a verdim.\" Resulullah'ın etrafında bulunan sahabiler \"Ya Resulallah! Bunu ne ile tabir ettin?\" diye sordular. O da \"ilim ile\" diye cevap verdi",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 7008,
			"arabicnumber": 7008,
			"text": "Ebu Said el-Hudrl'nin nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Ben uyuduğum esnada insanlar bana arz olunuyorlardı. Üstlerinde gömlekler vardı. Bu gömleklerin kimi memelere ulaşıyor, kimi daha kısa idi. Bu sırada Ömer b. el-Hattab benim yanıma uğradı. Onun üstünde (eteklerini yerde) sürüklediği bir gömlek vardı.\" Sahabiler \"Ya Resulallah! Bunu ne ile tabir ettin?\" diye sordular. Resulullah \"din ile\" cevabını verdi",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 7009,
			"arabicnumber": 7009,
			"text": "Ebu Said el-Hudri şöyledemiştir: Ben Resulullah Sallallahu Aleyhi ve Sellem'den işittim: \"Uyuduğum sırada insanlar bana arz olunuyorlardı. Üstlerinde gömlekler vardı. Bu gömleklerin kimi memelere varıyor, kimi bundan daha kısa idi. Ömer b. el-Hattab da bana arz olundu. Onun üstünde (eteklerini yerde) sürüklediği bir gömlek vardı\" buyurdu. Sahabiler \"Ya Resulallah! Bunu ne ile tabir ettin?\" diye sordular. Resulullah \"din ile\" diye cevap verdi. Fethu'l-Bari Açıklaması: \"Rüyada gömleğini yerde sürükleme.\" Tabir alimleri şöyle derler: Gömleğin dinle tabir edilmesi şu açıdandır: Gömlek, dünyada aYret yerini örter. pin ise ahirette insanı örter ve her türlü istenmeyen durumdan korur. Bu konuda temel dayanak Allahu Teala'ın \"Takva elbisesi. .. işte o daha hayırlıdır\"(Araf, 26) ayet-i kerimesidir. Araplar fazilet ve iffeti \"kamis=gömlek\" kelimesi ile ifade ederler. Nitekim Resulullah Sallallahu Aleyhi ve Sellem'in Hz. Osman'a \"Allah sana öyle bir gömlek giydirecek ki onu çıkarma\"(Ahmed b. Hanbel, VI, 86, 114, 149; Tirmizi, Menakıb; İbn Mace, Mukaddime) ifadesinde geçen \"kamis\" kelimesi bu kabildendir. Bu hadisi Ahmed b. Hanbel, Tirmizi, İbn Mace rivayet etmişler, İbn Hibban sahih olduğunu belirtmiştir. Tabir alimleri \"kamis= gömlek\"in din ile tabir edileceğini, gömlek uzunluğunun o kişinin ardından eserlerinin baki kalacağını gösterdiği noktasında ittifak etmişlerdir. Hadis-i şerif dine mensup olan kimselerin dinde azlık, çokluk, kuwet, zayıflık bakımından birbirlerinden farklı olduklarını ifade etmektedir. Bunun açıklaması İman bölümünde geçmişti. Gömleğini yerde sürüyerek yürümek, rüyada övülen uyanıkken kınanan şeylerden olan fiillerden birisidir. Çünkü uyanıkken gömleği uzatıp, yerlerde sürüme konusunda tehdit gelmiştir. Hadisten çıkan sonuçlar 1. Rüya tabiri meşrudur. 2. Tabiri bilen kimsenin -rüyayı gören kendisi bile olsa- bunu başkalarına sorması caizdir. 3. Faziletli bir kimsenin mertebesini ortaya çıkarmak maksadıyla sahip olduğu faziletlerle kendisini övmek meşrudur. Bunun yerinin kişinin övdüğü şahsın bu yüzden kendini beğenmek gibi fitneye düşeceğinden emin olunduğu durumlar olduğu gayet açıktır. Hadiste Hz. Ömer'in faziletini gösteren ifadeler vardır. İbnü'l-Arabı şöyle demiştir: Nebi s.a.v.'in gömleği \"din\" ile tabir etmesi, elbisenin bedenin avretini örttüğü gibi, dinin cehalet avretini örtmesindendir. İbnü'l-Arabi şöyle devam eder: Hz. Ömer'den başkalarına gelince, gömleği memelerine ulaşan kimse -birtakım günahları işliyor olsa bile- kalbini küfürden koruyan kişidir. Gömleği bundan daha kısa olup, avret yeri açıkta olan ise ayaklarını günaha gitmekten alıkoymayandır. Giydiği gömlek ayaklarını örten ise takva ile her türlü günahtan sakınan kimsedir. Gömleğini arkasından sürükleyen kişi halis ve salih amelle bundan daha fazlasını yapandır. İbn Ebi Cemre özetle şöyle der: Hadisteki \"nas=insanlar\" kelimesinden maksat \"kamis\" kelimesi \"din\" ile tabir edildiğinden dolayı \"mu'minler\"dir. İbn Ebi Cemre şöyle devam eder: Öyle anlaşılıyor ki maksat bu Muhammed ümmetinin belirli bir kesimi, hatta bazılarıdır. \"Din\" den maksat ise dinin emirlerine sarılma, yasaklarından kaçınmaya hırsla yapışmak örneğinde olduğu gibi, onun gereğine göre amel etmektir. Hz. Ömer'in bu konuda yüce bir makamı vardır. İbn Ebi Cemre şöyle devam eder: Bu hadisten anlaşıldığına göre rüyada görülen gömlek, -güzelolsun veya olmasın- giyen kişinin dindarlığıyla tabir edilir. Gömlekteki nükte şudur: Gömleği giyen kimse dilerse üzerinden çıkarır, dilerse üzerinde bırakır. Allahu Teala mu'minlere iman elbisesini giydirip, onlar bu vasfa bürününce bu konudaki mükemmelolan elbisesi vücudunu tam olarak örten olurken, mükemmelolmayan böyle olmamıştır. Elbisenin eksikliği bazen iman eksikliği nedeniyle olurken, bazen amel eksikliği sebebiyle olabilir. Doğruyu en iyi Allahu Teala bilir. Bir başka alim ise şöyle der: Dünyada gömlek, avret yerini örter. Bunun fazlası kınanmıştır. Ahirette ise bu sırf bir zinettir. Gömleğin tabirinin onun uzunluğu veya kısalığı, güzelliği veya çirkinliğine göre olması uygun düşmüştür. Gömlek ne kadar uzun olursa onu giyenin fazileti o kadar olur ve herkese din veya ilim ya da güzellik veya ağırbaşlılık ya da bir zümre içinde ön safta olma gibi kendisine layık olan şey nispet edilir. Bunun zıttı bu sıralanan niteliklerin zıttı demektir",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 7010,
			"arabicnumber": 7010,
			"text": "Kays b. Abbad şöyle demiştir: Ben Sa'd b. Malik ve İbn Ömer'in yer aldığı bir halkada idiin. Derken Abdullah b. Selam uğradı. Oradakiler \"Bu, cennet ehlinden olan bir adamdır!\" dediler. Ben de ona \"Buradakiler senin hakkında şunu şunu söylediler\" dedim. Abdullah b. Selam \"Sübhanallah! Onlara hakkında bilgileri olmayan bir sözü söylemeleri uygun olmaz. Ben sadece şöyle bir rüya görmüştüm: Sanki yemyeşil bir bahçenin içine konulmuş bir sırık vardı. Bu sırık orada dikilmişti. Bu sırığın başında da bir kulp vardı. Aşağısında ise bir minsaf (hizmetçi) vardı. Bana 'Bu sırığa çık' denildi. Ben de çıktım ve hatta tepedeki kulpu elime aldım. Nihayet bu rüyamı Resulullah'a anlattım. Nebi Sallallahu Aleyhi ve Sellem \"Abdullah, bu en sağlam kulpa yapışmış olarak vefat edecektir\" buyurdu. Fethu'l-Bari Açıklaması: \"Rüyada yeşillikler ve yeşil bahçe görmek.\" el-Kayravani şöyle demiştir: Bitkisi tanınmayan bahçe tazeliği ve güzel ihtişamıyla İslam'la tabir olunur. Bahçe ayrıca faziletli mekan şeklinde de tabir edilir. Bazen Mushaf, ilim kitapları, alim ve benzeri şekilde tabir edildiği de olmuştur. \"el-Minsaf el-Vasif.\" Bu ifade, habere sonradan girmiştir. Kelime, İbn Sirin'in tefsiridir. Zira haberin Müslim'deki rivayeti \"Bana bir minsaf (hizmetçi) geldi\" şeklindedir. İbn Avn minsafın hizmetçi olduğunu söylemiştir. Hadis aynı zamanda Abdullah b. Selam'ın menkıbesi mahiyetindedir",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 7011,
			"arabicnumber": 7011,
			"text": "Aişe r.anha'nın nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"(Ya Aişe!) Sen iki kere rüyamda bana gösteri/din. Bir adam ipekten bir parça üzerinde senin suretini taşıyordu. O adam 'Bu (senin müstakbel) eşindir' diyordu. Şimdi ben o sureti keşfediyorum, o suret sendin.\" Bu söz üzerine ben 'Eğer bu rüyam Allah tarafından gösterilmiş ise Allah bunu gerçekleştirecektir' dedim",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 7012,
			"arabicnumber": 7012,
			"text": "Aişe r.anhs'nın nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle demiştir: \"Ben seninle evlenmeden önce bana rüyadg iki kere gösteri/din. Ben meleği ipekten bir kumaş parçası üzerinde senin suretini taşırken gördüm. Ona 'Bu kumaş parçasını aç!' dedim. Melek de onu açtı. Bir de baktım ki o sendin. Ben eğer bu rüya Allah tarafından ise o bunu gerçekleştirecektir dedim. Sonra melek seni bir ipek parçası üzerinde taşırken ikinci defa bana gösterildin. Ben ona 'Bu parçayı aç!' dedim. O da açtı; Bir de baktım ki o suret sendin. Bunun üzerine ben 'Eğer bu rüya Allah tarafından gösteri/miş ise Allah bunu gerçekleştirecektir' dedim.\" Fethu'l-Bari Açıklaması: \"Rüyada ipek elbise görmek.\" İmam Buhari bu ve bundan önceki konuyla ilgili olarak Hz. Aişe r.anhs'nın naklettiği hadise yer vermiştir. Bu hadis, Resuluilah Sallallahu Aleyhi ve Sellem'in kendisiyle evlenmeden önce onu rüyada görmesine dairdir. Söz konusu hadis, Resulullah Sallallahu Aleyhi ve Sellem'in Medine'ye hicretinden önceki sıreti bölümünde geçmişti. Kurtubi şöyle der: Resulullah s.a.v., Hz. Aişe r.anha'yı uyanıkken gördüğü gibi rüyada da gördüğünü ifade etmek istemektedir. Netice olarak rüyada kastedilen başkası değil, Hz. Aişe radıyallShu anhS olmaktadır. Hammad b. Seleme kendi rivayetinde kastedilenin kim olduğunu şu şekilde açıklamaktadır: \"Hz. Hatice'nin vefatından sonra ipekten bir kumaş parçası içinde bana bir kadın getiri/di. \" İbn Battal şu açıklamayı yapar: Rüyada kadın görmek birkaç şekilde tabir edilir. Bir tabire göre rüyada kadın görmek, kişinin bizzat o gördüğü kadınla veya benzeriyle evleneceği şeklinde tabir edilir. Bazen rüyada görülen kadın, dünyalık elde etme veya dünyada bir mertebe kazanma ya da rızık genişliği olarak tabir edilir. Rüya tabircilerinin bu konudaki görüşleri bundan ibarettir. Bazen rüyada görülen kadın, onunla birlikte rüyayı görenin başına gelecek olan bir fitneye delalet edebilir. Rüyada kadınların ipek elbise giymeleri evlenmeye, rahatlamaya, zenginliğe, kilo almaya delalet eder. Tabirciler insanın bedenini sarması dolayısıyla bütün giysilerin kişinin vücuduna delalet ettiğini söylemişlerdir. Özellikle de elbise örfte insanların toplum içindeki mertebeleri ve ahvalinin göstergesi olduğunda tabir böyle olacaktır",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 7013,
			"arabicnumber": 7013,
			"text": "Ebu Hureyre r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Ben cevami'u'l-kelim (özlü ve kapsamlı sözler) ile gönderildim. Bana (bir aylık mesafedeki düşman gönülIerine) korku salmak suretiyle yardım edildi. Bir de ben uyuduğum sırada bana yeryüzünün hazinelerinin anahtarları getirildi de benim elime konuldu. \" Ebu Abdullah şöyle demiştir: Belağ yoluyla bize ulaştığına göre \"cevami'u'lkelim\", Allahu Teala'ın Nebi Sallallahu Aleyhi ve Sellem' den önceki kitaplarda yazılı olan birçok şeyleri bir, iki veya buna benzer meselede toplamasıdır. Fethu'l-Bari Açıklaması: \"Rüyada elde anahtarlar görme\" Yani bir kimse rüyasında elinde anahtarlar görürse bu nasıl tabir edilir? Tabirciler şöylederler: Anahtar mal, izzet ve otoritedir. Her kim bir anahtarla herhangi bir kapıyı açtığını görürse, gücü kuweti olan bir kimsenin yardımıyla ihtiyacım giderir. Elinde anahtarlar gördüğü takdirde o kişi büyük bir güce ve kuwete kavuşur",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 7014,
			"arabicnumber": 7014,
			"text": "Abdullah b. Selam şöyle demiştir: Kendimi rüyada bir bahçe içinde gördüm. Bahçenin ortasında bir direk vardı. Bu direğin en yüksek yerinde de bir tutulacak kulp vardı. Bana \"Haydi bu direğe çık!\" denildi. Ben \"Gücüm yetmez!\" dedim. Bunun üzerine yanıma bir hizmetçi geldi ve arkamdan elbisemi kaldırdı. Ben direğe çıktım ve oradaki kulpa sımsıkı yapıştım. Derken o kulba sımsıkı yapışır bir halde iken uyandım. Daha sonra bu rüyamı Nebi Sallallahu Aleyhi ve Sellem'e anlattım. Bana \"Gördüğün bu bahçe, İslam bahçesidir. O direk de İslam'ın belkemiğidir. O kulp da çok sağlam olan kulptur. Sen ölünceye kadar İslam dinine yapışarak yaşayacaksın\" dedi. Fethu'l-Bari Açıklaması: \"Rüyada sağlam kulpa ve halkaya yapışma.\" İmam Buhari bu konuda Abdullah b. Selam hadisine yer vermiştir. Tabireiler rüyada görülen meçhul halka ve kulp ona yapışanın dininde güeünü ve ihlasını gösterir, demişlerdir",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 7016,
			"arabicnumber": 7016,
			"text": "",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 7017,
			"arabicnumber": 7017,
			"text": "Ebu Hureyre r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Zaman yaklaşınca mu'minin rüyası hemen hemen hiç yalan çıkmaz. Çünkü mu'minin rüyası, Nebiliğin kırk altı cüzünden bir cüzdür. Nebilikten cüz olan bir şey yalan çıkmaz.\" Muhammed b. Sirin şöyle dedi: Benim kanaatim de budur. İbn-i Sirin şöyle devam eder: Rüyanın üç çeşit olduğu söyleniyordu. İnsanın içinden geçenler, şeytanın korkutması ve Allah tarafından olan müjde. Kim rüyada hoşlanmayacağı bir şey görürse bunu hiç kimseye söylemesin ve kalkıp namaz kılsın. İbn-i Sirin şöyle devam eder: Rüyada tasma görmek hoş karşılanmazdı. Onlar ayağa vurulan bağı bukağıyı hoş görürlerdi ve ayağa vurulan bağ, dinde sebat anlamına gelir denirdi. Fethu'l-Bari Açıklaması: \"Rüyada ayaklarının bağlı olduğunu görmek.\" Yani bir kimse rüyada ayaklarının bağlı olduğunu görse bunun tabiri nedir? Haberin mutlak olarak zahiri, tüm çeşitleri ile rüyada görülen bağın dinde sebat olarak tabir edileceğini göstermektedir. Fakat tabirciler, bunu başka bir karine bulunmaması şartına bağlamışıardır. Sözgelimi bir kimse yolcu veya hasta ise ayak bağı, o kişinin yolculuğunun veya hastalığının uzayacağına delalet eder. Aynı şekilde bir kimse sözkonusu bağda fazladan bir nitelik görse, mesela ayağının gümüş bir bağ ile bağlandığını görse bu, o kişinin evleneceğine delalet eder. Ayağa vurulan bağ altından ise bu o kişinin arzulamış olduğu bir mala delalet eder. Bu bağ pirinçten (sarı) ise bu hoşlanılmayan bir şeyin başa geleceğine ya da elden çıkacak bir mala delalet eder. Ayak bağı kurşundan ise bu zayıf ve gevşek bir işe delalet eder. Bağ iptense dinle ilgilidir. Tahtadan olduğu takdirde içinde nifak olan bir meseleye delalet eder. Ahşaptan ise rüyayı görenin bir töhmete uğrayacağına delalet eder. Sözkonusu bağ bir hırka veya ipten ise bu devam etmeyecek bir işe delalet eder. \"Zaman yaklaşınca mu'minin rüyası hemen hemen hiç yalan çıkmaz.\" Hattabi Mealimu's-Sünen isimli eserinde şöyle der: \"Zamanın yaklaşması\"nın ne anlama geldiği konusunda iki görüş ileri sürülmüştür. Birincisine göre bunun manası gece ile gündüzün zamanının birbirine yaklaşmasıdır. Tabirciler şöyle derler: Rüyanın en doğru çıkanı, geceyle gündüzün birbirine eşit olduğu ve meyvelerin olgunlaştığı zamanlardır. Hattabi bunu Garibu'l-Hadis isimli eserde Ebu Davud' dan nakleder sonra şöyle der: Tabirciler rüyaların dosdoğru olarak çıktığı zaman çiçeklerin açtığı, meyvelerin olgunlaştığı zamandır. Bu iki zaman, geceyle gündüzün birbirine eşit olduğu vakittir. Bu konudaki ikinci yaklaşıma göre \"zamanın yaklaşması\" kıyametin kopması yaklaştığında süresinin sona ermesi anlamınadır. Biz de şunu ekleyelim: Birinci yaklaşımın mu'minle kayıtlanması, uzak bir ihtimaldir. Çünkü tabiatın mutedil olduğu vakit mü'mine mahsus değildir. İbn Battal birinci yaklaşımın doğru olduğunu kesin bir dille ifade etmiştir. O, bu konuda Tirmizi'nin Ma'mer vasıtasıyla Eyyub'dan naklettiği habere dayanmaktadır. Sözkonusu habere göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Zamanın ahirinde mu'minin rüyası yalan çıkmaz. Onların içinde rüyası en doğru olan, sözü en doğru olandır. \"(Tirmizi, Rüya) İbn Battal şöyle der: Buna göre hadisin manası şudur: Kıyamet yaklaştığında ve ilmin çoğu yeryüzünden alınıp, kargaşa ve fitne dolayısıyla dindarlığın dışa vuran alametleri yeryüzünden silindiğinde insanlar tıpkı fetret döneminde olduğu gibi kendilerini uyaran ve dinden silinmiş olan şeyleri yenileyen birisine ihtiyaç duyacaklardır. Tıpkı geçmiş ümmetierin Nebiler vasıtası ile uyarıldıkları gibi. .. Fakat bizim Nebiimiz, Nebilerin sonuncusu (Hatemü'l-Enbiya) olduğundan ve sözkonusu zaman fetret dönemine benzediğinden mahrum oldukları Nebilik yerine, müjdeleme ve uyarı müessesesi olan Nebiliğin bir cüzü olan sadık rüya verildi. Kurtubi el-Müfhim'de şöyle der: Hadiste zikri geçen \"zamanın ahiri\"nden maksat -Allah daha iyi bilir- Deccal'i öldürdükten sonra Meryem oğlu İsa ile birlikte bulunacak olan zümrenin zamanıdır. Müslim'in, Abdullah b. Ömer'den nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Yüce Allah Meryem oğlu İsa'yı gönderir. O insanların içinde yedi yıl kalır. Bu süre zarfında birinin diğeriyle arasında hiçbir düşmanlık olmaz. Sonra Yüce Allah Şam tarafından soğuk bir rüzgar gönderir. Yeryüzünde kalbinde zerre kadar hayır veya iman bulunup da ruhu kabzedilmemiş hiç kimse kalmaz.\"(Müs!im, Fiten) Kurtub! şöyle der: Bu zamanın insanları asr-ı saadetten sonra bu ümmetin içinde durumu en iyi ve sözleri en doğru olan zümre olacaktır. Onların rüyaları yalan çıkmayacaktır. Buradan hareketle Resulullah Sallallahu Aleyhi ve Sellem ifadesinin devamında \"Onların içinde rüyası en doğru olanı, sözü en doğru alandır\" buyurmaktadır. Bunun sebebi şudur: Çok doğru söyleyen kimsenin kalbi nurlanır, idraki güçlenir ve bu durumda manaları sahih bir şekilde tercih eder. Uyanık halde iken çoğunlukla doğru olan kimse de böyledir. Bu doğruluğu rüyasında da ondan ayrılmaz ve ancak doğru ve sadık rüya görür. Bu durum yalancı ve karıştıran kimsenin durumundan farklıdır. Çünkü yalancının kalbi bozuk ve karanlık olur. O ancak karmakarışık şeyler görür. Zaman zaman nadiren de olsa doğru sözlü kimse sahih olmayan şeyler görürken, yalancı sahih olanları görebilir. Fakat çoğunluk ve genelolan yukarda anlattığımız gibidir. Doğruyu en iyi Allah Teala bilir. \"İnsanın içinden geçenler, şeytanın korkutması ve Allah tarafından olan müjde.\" Müslim'de yer alan bir rivayette Cabir şöyleanlatır: \"Bedevinin biri Nebi Sallallahu Aleyhi ve Sellem'e gelerek \"Ya Resulallah! Rüyamda başımın koparıldığını ve onun ardından gittiğim i gördüm\" der. Bir başka rivayette ise \"Başım yerinden çıktı ve ardından koştum\" ifadesi yer almaktadır. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem \"Şeytanın rüyada seninle oynamasını kimseye anlatma\" buyurur.(Müs!im, Rüya) \"Rüyada tasma görmek hoş karşılanmazd!. Onlar ayağa vurulan bağı hoş görürlerdi ve ayağa vurulan bağ, dinde sebat anlamına gelir denirdi.\" Mühelleb şöyle der: Rüyada görülen tasma, hoşlanılmayan şeylerle tabir edilir. Çünkü Yüce Allah kitabında: \"Boyunlarında demir halkalar ve zincirler olduğu halde sıcak suya sürüklenecekler\"(Mu'min 71) ayet-i kerimesinde onun cehennemliklerin niteliklerinden olduğunu haber vermektedir. Boyuna geçirilen halka bazen küfre delalet edebilir. Bazen eziyet veren kadın şeklinde tabir edilir. İbnü'l-Arabi' şöyle der: Tabirdıerin ayağa vurulan bağı bukağıyı sevmeleri, Resulullah Sallallahu Aleyhi ve Sellem'in onu övülen kısımda zikretmesinden dolayıdır. Çünkü o \"İmanın kaydı adam öldürmeyi engellemesidir. Bir mu'min başkasını öldürmez\" buyurmuştur. (Abdurrezzak, Musannef, V, 298) Boyna vurulan halkaya gelince, bu anlam itibariyle şer'an çirkin görülmüştür. Yüce Allah şöyle buyurur: \"Onu yakalayın da {ellerini boynuna} bağlayın.\"(Hakka 30) \"Boyunlarında demir halkalar ve zincirler olduğu halde sıcak suya sürükleneeekler, sonra da ateşte yakılaeaklardır.\"(Mu'min 71- 72) \"Eli sıkı olma, büsbütün eli açık da olma.\"(İsra 29) \"Nay dedikleri yüzünden elleri bağlanası ve lanet olasılar!\" (Maide 64) Ayağa 'vurulan bağın dinde sebat olması, ayağı bağlı olan kimsenin yürüyememesinden kaynaklanmaktadır. Yüce Allah bunu insanın batıla yürümesine engelolan imana örnek olarak vermiştir. Nevevl'nin belirttiğine göre bilginler şöyle demişlerdir: Ayağa vurulan bağın sevimli olması, onun ayağa vurulmasından dolayıdır. Bu bağ insanı günahlara dalıp, kötülük işlemekten ve batıla sapmaktan alıkoyar. Boyuna vurulan bağın sevimsiz olması ise bunun boyuna vurulmasındandır. Bu da cehennemliklerin niteliğidir. Tabireiler ayağa vurulan bağ kişinin lehine gördüğü işte sebattır demişlerdir. Tabircilere göre kişi hem boynuna ve hem de ayağına bağ vurulduğunu görürse bu hoşlanılmayan şeyin fazlalığına delalet eder. Ellere vurulan bağ övülmüştür. Zira bu elleri kötülüğe uzanmaktan alıkoyar. Kişinin durumuna göre bazen ellere vurulan bağ cimrilik olarak tabir edilir. Tabireiler bir de şunu söylemişlerdir: Bir kimse iki elinin bağlanmış olduğunu görürse bu kişi eimridir. Buna karşılık elinin ve ayağının bağlanmış olduğunu gördüğü takdirde hapse veya sıkıntılı bir duruma düşer. Biz de şunu ekleyelim: Boyna vurulan bağ, bazı rüyalarda Hz. Ebu Bekir' de olduğu gibi övülmüştür. Ebu Bekir b. Ebi Şeybe'nin sahih bir senedIe nakline göre Mesruk şöyle anlatmıştır: Suhayb, Ebu Bekir' e uğrar ve ondan yüz çevirir. Ebu Bekir sebebini sorunca Suhayb \"Elini Ensardan Ebü'l-Haşr'ın kapısının üzerinde bağlı gördüm\" der. Bunun üzerine Ebu Bekir \"Haşr gününe kadar dini m benim için muhafaza edilecek\" der. (Abdurrezzak, Musannef, VI, 179)",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 7018,
			"arabicnumber": 7018,
			"text": "Ensar kadınlarından Resulullah Sallallahu Aleyhi ve Sellem'e bey'at eden Ümmü'l-Ala şöyle anlatmıştır: Muhacirlerin (Mekke'den Medine'ye hicret ettiklerinde) ikamet edecekleri yerleri tespit etmek üzere Ensar kendi aralarında kur'a çektikleri zaman Osman b. Maz'un'un ikameti bizim aileye düşmüştü. Osman bizim evimizde bir müddet kaldıktan sonra hastalandI. Evimizde vefat edinceye kadar onun hasta bakıcılığını yaptık. Sonra onu kendi elbisesi içinde kefenledik. Derken Resulullah Sallallahu Aleyhi ve Sellem yanımıza geldi. Ben \"Ey Ebü's-Saib! Allah'ın rahmeti üzerine olsun! Benim şahadetim şudur ki: Allah muhakkak sana ikram etmiştir!\" dedim. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem ''Allah Teala'nın ona ikram buyurduğunu nereden biliyorsun?\" dedi. Ben de \"Valiahi bilmiyorum\" dedim. Resulullah Sallallahu Aleyhi ve Sellem \"Osman'a muhakkak ki yakin gelmiştir. Ben de onun için Allah'tan hayır umarım ve yine ben -Allah'ın Resulü iken- bana ve size nasıl muamele edileceğini bilemem\" buyurdu. Ümmü'l-Ala \"Valiahi ben bundan sonra kimseyi tezkiye etmeye cesaret edemedim\" dedi ve şöyle devam etti: \"Rüyamda Osman b. Maz'un'un akan bir pınarı olduğunu gördüm. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem' e gelip, bu rüyamı kendisine anlattım. Nebi Sallallahu Aleyhi ve Sellem \"(Bu gördüğün akan pınar) onun amelidir\" buyurdu. Fethu'l-Bari Açıklaması: \"Rüyada akan pınar görme.\" Mühelleb şöyle demiştir: Rüyada akan pınar görmek birkaç şekilde tabir edilebilir. Pınarın suyu berraksa salih amelle tabir edilir, aksi takdirde başka türlü yorumlanır. Bir başkası şöyle demiştir: Rüyada akan pınar devam edip giden ameldir. Bu bir sadaka olabileceği gibi, ölünün bir canlıya veya ölüye yaptığı ya da icra ettiği bir iyilik de olabilir. Başka tabirciler ise şöyle demişlerdir: Su pınarı, rüyayı görenin durumu bilinmiyorsa nimet, bereket, hayır ve arzularına ulaşma olarak tabir edilir. Rüyayı gören kişi iffetli değilse başına ailesini ağlatacak bir musibet gelecek demektir",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 7019,
			"arabicnumber": 7019,
			"text": "İbn Ömer'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Ben bir kuyu üzerinde bulunup, ondan (kova ile) su çıkarmakta olduğum sırada birden yanıma EbU Bekir ile Ömer geldi. Bunun üzerine EbU Bekir kovayı aldı, bir veya iki dolu kova su çekti fakat onun su çekişinde biraz ku vvetsiz görünüyordu. Allah EbU Bekir'i mağfiret etsin. Sonra onu Ebu Bekir'in elinden Ömer b. el-Hattab aldı ve bu kova Ömer'in elinde büyük bir kovaya dönüştü. Ben insanlardan onun gördüğü işi görebilecek kuvvette bir kişi göremedim. Sonunda insanlar o meydanı develerin su kaynağı yakınındaki dinlenme yeri edindiler. \" Fethu'l-Bari Açıklaması: \"Rüyada insanlar suya kanıncaya kadar kuyudan su çekip çıkarma.\" Başlıkta geçen \"t)''' sulama maksadıyla kuyudan su çıkartmak demektir. \"Ben bir kuyu üzerinde bulunup, ondan (kova ile) su çıkarmakta olduğum sırada ... \" Yani kova gibi bir aletle kuyudan su çıkardığı m sırada. \"Fakat onun su çekişinde biraz kuvvetsiz görünüyordu\" Bu hadisin açıklaması ve yorumundaki ihtilafların beyanı Ömer'ın Menakıb'ı bölümünde Nebilik alametleri başlığı altında geçmişti. \"Sonra onu EbU Bekir'in elinden Ömer b. el-Hatta b ald!.\" İfade burada bu şekildedir. İmam Buhari benzer ifadeyle Ebu Bekir'in o kovayı Resulullah Sallallahu Aleyhi ve Sellem'in elinden aldığını zikretmemiştir. Bunda Hz. Ömer'in hilafete Ebu Bekir'in kendisine ricası üzere geleceğine işaret vardır. Ebu Bekir'in durumu ise böyle değildir. Çünkü onun hilafeti Nebi Sallallahu Aleyhi ve Sellem'in açık bir emri ile olmamıştı, fakat bu açıkça söylemeye yakın izler taşıyan birçok işaretlerle gerçekleşmişti. \"Bu kova Ömer'in elinde büyük bir kovaya dönüştü.\" Yani kova büyük bir kova haline geldi. Dilbilginleri \"........\" kelimesinin sığır derisinden yapılmış büyük kova anlamına geldiğini belirtmişlerdir. \"Ben insanlardan onun gördüğü işi görebilecek kuvvette bir kişi göremedim.\" Ebu Ömer eş-Şeybfmi şöyle demiştir: Arapçada \"abkariyyu'l-kavm\" topluluğun efendisi, güçlüsü, büyüğü demektir. elFarabi ise şu görüşü ileri sürmüştür: Erkeklerden \"i..Ş,H-\" kendisinden daha üstünü olmayan \"deha kişi\" demektir. el-Ezherı ise \",H-\" kelimesinin çölde bir yer olduğunu ileri sürmüştür. ,H- kelimesinin rengarenk dokunmuş halıların imal edildiği bir yer olduğu söylenmiştir. Kelime, kaliteli ve üstün olan her şey hakkında kullanılmıştır. \"Sonunda insanlar o meydan ı develerin su kaynağı yakınındaki dinlenme yeri edindiler.\" Hadisteki \"darabe\", develer dinlenme yerine geldi ve çöktü demektir. \"el-Atan\", insanlar açısından vatan ne ise deve için odur. Ancak daha çok develerin havuzun etrafında çöktükleri yer anlamında kullanılmıştır. Kadı lyaz şöyle der: Hadisin zahirine göre maksat, Hz. Ömer'in halifeliğidir. Bazıları her ikisinin halifeliği olduğunu söylemişlerdir. Çünkü Hz. Ebu Bekir, ilkin mürtedleri etkisiz hale getirmek suretiyle öncelikle Müslümanların iki yakasını bir araya getirmiş ve fetihler onun zamanında başlamıştır. Sonra halifelik görevini Ömer' e devretmiştir. Ömer'in halifeliği döneminde fetihler çoğalmış, İslam'ın nüfuzu genişlemiş ve kaideleri istikrar kazanmıştır. Bir başkası şöyle demiştir: Kovanın Hz. Ömer'in elinde büyümesi fetihlerin onun zamanında çoğalması demektir. '.........\" fiilinin manası, olduğundan daha büyük bir hale dönüştü demektir. Nevevı şöyle der: Tabirciler bu rüya her iki halifenin salih kraatlarının ortaya çıkması ve insanların bundan yararlanması gibi şeylerin misalidir demişlerdir. Bütün bunlar Nebi Sallallahu Aleyhi ve Sellem' den alınmıştır. Zira o işin sahibidir. O bu görevi en mükemmel bir biçimde yapmış ve dinin kaidelerini yerleştirmiştir. Sonra yerine Hz. Ebu Bekir geçmiş, mürtedlerle savaşmış, onların kökünü kazımıştır. Ardından Hz. Ömer halife olmuş ve onun zamanında İslam dünyası genişlemiştir. Müslümanların durumları büyük bir kovaya benzetilmiştir ki içinde onların hayatları ve iyiliklerini sağlayan su bulunmaktadır. Hz. Ebu Bekir de halkı için o kovadan su çeken kişiye benzetilmiştir. Onun sulaması, halkın menfaatlerini temin etmesi demektir. '\\;.r.l=beni rahatlatmak için\" ifadesi, Resulullah Sallallahu Aleyhi ve Sellem'in vefatından sonra Hz. Ebu Bekir'in hilafetine işaret etmektedir. Çünkü ölüm dünyanın tasası ve yorgunluğundan rahata ermek anlamına gelir. Ondan sonra Hz. Ebu Bekir ümmetin işlerini çekip çevirmek ve onların sıkıntılarını üstlenmek üzere göreve gelmiştir. \"Onun su çekişinde biraz kuvvetsizlik görünüyordu\" ifadesi Ebu Bekir'in faziletini düşürme anlamına değildir. Bu, onun halifelik müddetinin kısalığını belirtmek içindir. Hz. Ömer'in halifeliğine gelince, hilafeti uzun olduğu için insanlar daha çok yararlanmışlar, İslam dairesi birçok fetihle genişlemiş, birçok şehirler kurulmuş ve divanlar oluşturulmuştur. \"Allah EbU Bekir'i mağfiret etsin\" ifadesi onun değerini eksiltme anlamında olmadığı gibi günah işlediğine işaret de etmemektedir. Bu, Arapların ifadelerini pekiştirmede kullandıkları bir kelimedir. Hadis-i şerif Hz. Ebu Bekir ve Ömer'in halife olacaklarını, halifeliklerinin sahih ve kendilerinden yararlananların çok olacağını bildirmektedir. Nitekim tıpkı Nebi Sallallahu Aleyhi ve Sellem'in dediği gibi olmuştur",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 7020,
			"arabicnumber": 7020,
			"text": "Salim'in babasından Nebi Sallallahu Aleyhi ve Sellem'in, Ebu Bekir ve Ömer'i rüyasında gördüğüne dair naklettiği hadiste Resulullah Sallallahu Aleyhi ve Sellem şöyle anlatmıştır: \"Ben rüyamda insanları (bir kuyu başında) toplanmışlar gördüm. O sırada EbU Bekir kalktı. Bir veya iki kova su çekti, fakat EbU Bekir'in su çekmesinde bir zaaf vardı. Allah EbU Bekir'i mağfiret etsin! Bundan sonra Ömer kalktı. Kova Ömer'in elinde büyük bir kovaya dönüştü. Artık ben insanlar içinde Ömer'in çektiği gibi su çekecek kuvvetli bir kişi göremedim. Sonunda insanlar o meydanı develerin su kaynağı yakınındaki dinlenme yeri edindiler",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 7021,
			"arabicnumber": 7021,
			"text": "Ebu Hureyre'nin nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Uyuduğum bir sırada kendimi duvarı örülmemiş bir kuyu başında gördüm. Kuyunun üzerinde bir kova bulunuyordu. Ben hemen o kuyudan Allah'ın dilediği kadar su çıkardım. Sonra kovayı Ebu Kuhafe'nin oğlu aldı, o da dolu olarak bir veya iki kova su çekti. Onun çekişinde bir zaaf vardı. Allah onu mağfiret eylesin! Sonra o kova, olduğundan daha büyük bir kova haline dönüştü. Bu sefer onu Hattab oğlu Ömer aldı. Artık ben insanlardan Ömer b. el-Hattab'ın çekişi gibi kusursuz su çeker hiçbir abkari (ulu,güçlü ve deha kişi) görmedim. Nihayet insanlar su yöresinde olan otlaklarına istirahata çekildiler.\" Fethu'l-Bari Açıklaması: \"Rüyada kuyudan zayıf bir çekişle bir veya iki kova dolusu su çekme.\" Yani su çekmede zaafla birlikte su çekme. Hadis-i şerife göre rüyasında bir kuyudan su çektiğini görmek, büyük bir göreve gelmeye delalet eder. Bunun süresi kuyudan çekilen suyun azlığına ve çokluğuna göre değişir. Bazen kuyu, kadın, ondan çıkarılan su, evlat olarak tabir edilir. Tabircilerin esas aldıkları budur. Tabirciler, bundan önceki görüşün ötesine geçmemişlerdir. İtimat edilmesi uygun olan odur, fakat tabirde kuyudan su çekenin hali göz önüne alınır. Doğruyu en iyi Yüce Allah bilir",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 7022,
			"arabicnumber": 7022,
			"text": "Ebu Hureyre'nin nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle anlatmıştır: \"Uyuduğum bir sırada kendimi bir havuz başında insanları sularken gördüm. Derken yanıma EbU Bekir geldi ve beni rahatlatmak için elimden kovayı alıp, iki kova su çekti. Onun çekişinde bir zaaf vardı. Allah onu mağfiret eylesin! Ardından Hattab'ın oğlu Ömer geldi ve ondan kovayı aldı. Artık o kuyudan su çıkarmaya devam etti. Nihayet insanlar arkalarına döndüler, havuz ise hala su kaynayıp duruyordu. \" Fethu'l-Bari Açıklaması: \"Rüyada istirahat etme.\" Tabirciler şöyle derler: Rüyasında istirahat eden kimse, kafası üzere yatmışsa durumu güçlenecek ve dünya elinin altında olacak demektir. Çünkü yeryüzü üzerine yaslanılacak en güçlü zemindir. Yüzükoyun yatmak ise böyle değildir. Çünkü kişi bu durumda arkasında ne olduğunu bilemez. İmam Buhari bu konuda Hemmam'ın Nebi Sallallahu Aleyhi ve Sellem'in rüyasında kova gördüğü şeklindeki Ebu Hureyre hadisine yer verir. Bu hadisten çıkan sonuçlar bundan önceki hadisin açıklamasında geçmişti",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 7023,
			"arabicnumber": 7023,
			"text": "Ebu Hureyre şöyle anlatmıştır: Resulullah Sallallahu Aleyhi ve Sellem'in huzurunda bulunduğumuz bir sırada bize şöyle anlattı: \"Ben bir keresinde uyurken kendimi cennette gördüm. O sırada bir köşkün yanında abdest almakta olan bir kadın gördüm. Ona 'Bu köşk kimindir?' diye sordum. Onlar 'Bu Ömer b. el-Hattab'a aittir' dediler. Ömer'in kıskançlığını hatırladım da hemen yüzümü çevirdim.\" Ebu Hureyre, Ömer b. el-Hattab (sevincinden) ağladı ve sonra \"Babam anam sana feda olsun Ya Resulallah! Ben sana karşı mı kıskançlık edeceğim!\" dedi",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 7024,
			"arabicnumber": 7024,
			"text": "Cabir b. Abdullah r.a.'ın nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle demiştir: \"Ben rüyamda cennete girdim ve orada altından yapılmış bir köşkle karşılaştım. 'Bu kime aittir?' diye sordum. Bana 'Kureyş'ten bir adamındır' dediler. Ey Hattab oğlu! Oraya girmeme sadece senin bilmekte olduğum kıskançlzğın man i oldu.\" Fethu'l-Bari Açıklaması: \"Rüyada köşk görmek.\" Tabirciler şöyle demişlerdir: Rüyada köşk görmek dindar kimseler için salih ameldir. Başkaları için ise hapislik ve sıkıntıdır. Biz de şunu ekleyelim: Nebi Sallallahu Aleyhi ve Sellem'in cennette gördüğü kadının -görülen rüya olduğu için- gerçekten abdest aldığı kastedilmiş olmama ihtimali vardır. Bu durumda abdest alan kadın figürü sözü edilen kadının durumuna örnek olmaktadır. Menakıb bölümünde bu kadının Ümmü Süleym olduğu ve o zamanlar hayatta bulunduğu, Resulullah Sallallahu Aleyhi ve Sellem'in onu cennette Ömer'in köşkünün yanında gördüğü geçmişti. Bu rüyanın tabiri o kadının cennetlik olduğudur. Çünkü çoğu tabirciler, bir kimse cennete girdiğini görürse, oraya girecektir derler. O zaman rüyayı gören bütün insanların içinde en doğru sözlü kişi olduğuna göre durum nice olur düşünmek gerekir. Kadının abdest alması ise maddi ve manevi kirlerden temiz olduğu, bedeninin bedenen ve hükmen tahir bulunduğu şeklinde tabir edilir. Kadının Hz. Ömer'in köşkünün yanındabulunması, onun Hz. Ömer'in halifelik günlerine yetişeceğine işarettir. Nitekim aynen böyle olmuştur. Bu hadisten çıkan sonuçlar Menakıb bölümünde geçmişti. Hadis, Hz. Ömer'in kıskançlığı örneğinde olduğu gibi bir kimseyi bilinen ahlakıyla anmanın caiz olduğunu göstermektedir",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 7025,
			"arabicnumber": 7025,
			"text": "Ebu Hureyre r.a.şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem'in huzurunda bulunduğumuz bir sırada o şöyle anlattı: \"Ben uyurken kendimi cennette gördüm. Birden bir köşkün yanında abdest almakta olan bir kadın gördüm. 'Bu köşk kimindir?' diye sordum. Oradakiler 'Ömer'e aittir\" dediler. Ömer'in kıskançlığını hatırladım da hemen yüzümü arkama çevirdim.\" Bunun üzerine Ömer b. el-Hattab (sevincinden) ağladı ve sonra \"Babam anam sana feda olsun Ya Resulallah! Ben sana karşı mı kıskançlık edeceğim!\" dedi. Fethu'l-Bari Açıklaması: \"Rüyada abdest aldığını görmek.\" Tabirciler şöyle derler: Bir kimsenin rüyada abdest aldığını görmesi nüfuza veya bir işe delalet eder. Kişi rüyasında abdestini tamamladığını görürse uyanıkken muradına nail olur. Mesela suyun kalmaması gibi bir nedenle abdest alması imkansız hale geIirse veya kendisi ile namazın caiz olmayacağı bir şeyle abdest aldığını görürse muradına eremez. Korkan bir kimsenin abdest aldığını görmesi onun için güveniiktir ve böyle bir rüya sevap elde edeceğine, küçük günahlarının bağışlanacağına delildir",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 7026,
			"arabicnumber": 7026,
			"text": "Abdullah b. Ömer'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle anlatmıştır: \"Uyuduğum bir sırada kendimi rüyamda Kabe'yi tava! ederken gördüm. O sırada esmer, salıverilmiş düz saçlı bir kişi gördüm. İki kişi arasında idi ve başından su damlıyordu. Ben {orada bulunanlara} 'Bu kimdir?' diye sordum. Onlar 'Meryem oğludur' dediler. Ona yönelmek üzere ilerlediğim sırada bir de kırmızı yüzlü, uzun boylu, kıvırcık saçlı, sağ gözü şaşı, sanki salkımındaki benzerlerinden dışarı çıkmış iri bir üzüm tanesi! Ben {oradakilere} 'Bu kimdir?' diye sordum. Onlar 'Bu, Deccal'dir' dediler. Ona insanların içinde en çok benzeyen İbn Katan'dır.\" İbn Katan, Huzaa kabilesinin bir kolu olan Mustalık oğulları boyundanidi. Fethu'l-Bari Açıklaması: \"Rüyada Kabe'yi tavaf ettiğini görmek.\" Tabirciler şöyle demişlerdir: Rüyada Kabe'yi tavaf ettiğini görmek hacca gitmeye, evlenmeye, devlet başkanından arzu ettiği işi elde etmeye, ana babaya itaate, bir alime hizmete, devlet işine girmeye delalet eder. Rüyayı gören köle olduğu takdirde bu, onun efendisine sadık biri olduğuna delalet eder. \"Uyuduğum bir sırada kendimi rüyamda Kabe'yi tava! ederken gördüm.\" Bu hadisin geniş bir açıklaması, Enbiya bölümünde İsa aleyhisseliim başlığı altında geçmişti",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 7027,
			"arabicnumber": 7027,
			"text": "Hamza b. Abdullah b. Ömer şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellemiden işittim şöyle diyordu: \"Uyuduğum bir sırada bana süt dolu bir kadeh verildi. Bu kadehten o kadar içtim ki, süte kanma eserlerinin akmakta olduğunu hala görüyorum. Sonra artanını Ömer'e verdim.\" Sahabiler \"Ya Resulallah! Bunu ne ile tabir ettin?\" diye sordular. O da \"İlim ile\" diye cevap verdi",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 7029,
			"arabicnumber": 7029,
			"text": "",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 7031,
			"arabicnumber": 7031,
			"text": "",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 7032,
			"arabicnumber": 7032,
			"text": "Abdullah b. Ömer'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Uyuduğum bir sırada bana süt dolu bir kadeh getirildi. Ben ondan içtim. Sonra artanı Ömer b. el-Hattab'a verdim.\" Sahabiler \"Ya Resulallah! Bunu ne ile tabir ettin?\" diye sordular. Resulullah Sallallahu Aleyhi ve Sellem \"İlim ile\" diye cevap verdi. Fethu'l-Bari Açıklaması: \"Rüyada kendisine kadeh verildiğini görmek\" Tabirciler şöyle derler: Rüyada görülen kadeh, kadın veya kadın tarafından ele geçecek bir mal olarak tabir edilir. Cam kadeh, gizli şeylerin ortaya çıkacağını gösterir. Altın ve gümüş kadeh, güzel övgüdür demişlerdir. İmam Buhari bu konuda İbn Ömer'in \"Rüyada Süt Görme\" başlığı altında geçen hadisine yer vermiştir. Bu hadisin açıklaması orada geçmişti. BAHSİ GEÇEN SAYFA İÇİN BURAYA TIKLAYIN",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 7033,
			"arabicnumber": 7033,
			"text": "",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 7034,
			"arabicnumber": 7034,
			"text": "Ubeydullah b. Abdullah şöyle demiştir: Abdullah b. Abbas'a Resulullah Sallallahu Aleyhi ve Sellem'in zikretmiş olduğu rüyasını sordum. [-7034-] İbn Abbas şöyle cevap verdi: Bana Resulullah Sallallahu Aleyhi ve Sellem'in şöyle anlattığı naklediidi: \"Uyurken rüyamda ellerime altından iki bilezik konulduğunu gördüm. Ancak bunlardan korktum ve çirkin gördüm. Akabinde bana izin verildi de ben bunları üfledim. Bunun üzerine ikisi de uçtu. Ben bu iki bileziği benden sonra çıkacak olan iki yalancı (Nebi) ile tabir ettim.\" Fethu'l-Bari Açıklaması: \"Rüyada bir şeyin uçtuğunu görmek.\" Yani rüyada uçma özelliği olan bir şeyin uçtuğunu görmek. Tabireiler şöyle derler: Rüyada uçtuğunu gören kimseye bakılır. Şayet göğe doğru dimdik uçmuşsa bir zarara uğrar. Göğe doğru uçup, orada kaybolup gitmiş ve bir daha geri dönmemişse ölür. Geri döndüğü takdirde hastalığından kurtulur. Kişi rüyasında yana doğru enlemesine uçtuğunu görürse, yolculuğa çıkar ve uçması nispetinde bir yüksek dereceye erişir. Rüyada kanat takıp uçtuğunu görürse bu mal veya güçtür ki kişi onun sayesinde sefere çıkar. Kişi rüyada kanatsız uçtuğunu görürse bu tuttuğu işten aldatılacağı anlamına gelir. Tabireiler kötü kimseler için uçmak iyi değildir demişlerdir. Mühelleb şöyle demiştir: Rüya görüldüğü üzere yorumlanmaz. O bir misal getirme kabilindendir. Nebi s.a.v. eline konulan iki bileziği iki yalancı Nebi olarak tabir etmiştir. Çünkü yalan, bir şeyi olması gereken yerden başka yere koymaktır. Resulullah Sallallahu Aleyhi ve Sellem ellerinde altından iki bilezik görünce bunlar onun kullandığı şeylerden olmadığından -zira bilezik kadınların zinet eşyalarındandır- anladı ki kendisinde olmayan şeyi iddia edecek kişiler çıkacaktır ve yine o bileziklerin altından olması -altın kullanmak yasaklandığından- yalana delalet etmektedir. Bir de altın anlamına gelen \"zeheb\", gitmek anlamına gelen \"zehab\" kelimesinden türemedir. Buradan anlaşılıyor ki altın bırakılması gereken bir şeydir. Nitekim Resulullah Sallallahu Aleyhi ve Sellem'in onlara üflemesi ve akabinde uçmaları da bu anlayışı güçlendirmektedir. Resulullah Sallallahu Aleyhi ve Sellem, çıkacak olan o iki yalancı kimsenin davalarının yaşamayacağını ve getirmiş olduğu vahiyle söylemiş olduğu kelamının onları yerinden söküp atacağını anladı. Üfleme kelama delalet eder",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 7035,
			"arabicnumber": 7035,
			"text": "Ebu Musa'nın -zannederim Nebi Sallallahu Aleyhi ve Sellem'den diyerek- nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Rüyada Mekke'den hurmalık bir yere hicret ettiğimi gördüm. Buranın Yemame veya elHecer olduğunu tahayyül ettim. Bir de ne göreyim. Burası Medine-i Münewere yani Yesrib imiş. Rüyamda sığır sürüsü gördüm. Valiahi o hayırdır. Zira onların Uhud günü mu'minler olduğu ortaya çıktı. Hayır, Yüce Allah'ın getirmiş olduğu hayır ve onun Bedir' den sonra bize nasip etmiş olduğu doğruluğun sevabıdır.\" Fethu'l-Bari Açıklaması: ..... İbnü't-Tin bu tabiri şöyle açıklamıştır: Bunu \"vehell\" şeklinde rivayet ettik. Dil bilginlerinin ifadesi ise \"J vehlun\" şeklindedir. Kelime -tıpkı .......vehimtü\" fiilinde olduğu gibi- \"........ veheltü ehilü, vehlen\" kökünden türemiştir. Kişi başka bir şeyi isterken hayalinin başkasına gitmesi demektir. \"Hayır, Yüce Allah 'zn getirmiş olduğu hayır ve onun Bedir'den sonra bize nasip etmiş olduğu doğruluğun sevabıdır\" Bedir'den sonrasından maksat, Hayber'in, sonra da Mekke'nin fethidir. Bu konuda şunları söylemek mümkündür: Hadisin ifade akışı \"Valiahi hayırdır\" şeklindeki ifadenin rüyadan olduğuna işaret etmektedir. Benim anladığım bu lafzın yazılmış olmadığı ve İbn İshak rivayetinin bunu yazdırdığıdır. Nebi Sallallahu Aleyhi ve Sellem rüyasında sığır sürüsü görür ve bir de hayır görür. Sığır sürüsünü Uhud günü katledilen sahabiler olarak tabir eder. Hayrı ise Bedir günü ve ondan sonra Mekke'nin fethine kadar savaşmaya samimiyetle devam etmenin ve cihada sabırla dayanmanın bir sevabı olarak tabir eder. Buna göre \"ondan sonra\" lık tan maksat, Bedir'le Uhud arasına mahsus değildir. Nitekim İbn Battal buna dikkat çekmiştir. \"Bedir\" kelimesiyle Uhud' dan önce yapılan meşhur Bedir savaşı değil, vaadedilen Bedir olma ihtimali vardır. Çünkü vaadedilen Bedir, Uhud'dan sonra idi ve bu Bedir'de çarpışma olmamıştı. Müşrikler Uhud' dan döndüklerinde \"Sizinle bir dahaki karşılaşmamız gelecek yıl Bedir' dedir\" demişlerdi. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem yanında bulunanlarla birlikte Bedir' e kadar yürümüş ancak müşrikler oraya gelmemiş•lerdi. Bundan dolayı buna vaadedilen Bedir adı verildi. Nebi Sallallahu Aleyhi ve Sellem \"sıdk\" kelimesiyle kendilerinin vaatlerine sadık kaldıklarına, bundan caymadıklarına ve Yüce Allah'ın bundan dolayı kendilerine daha sonra Kureyza, Hayber ve ondan sonraki yerleri fethetmeyi nasip ederek karşılık verdiğine işaret etmiş olmaktadır",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 7037,
			"arabicnumber": 7037,
			"text": "",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 7038,
			"arabicnumber": 7038,
			"text": "(Salim b. Abdullah'ın babasından nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Rüyamda şöyle gördüm: Sanki siyah, başı saçı dağınık bir kadın Medine'den çıktı da nihayet Mehyea'ya -Cuhfe'ye- varıp orada durdu. Ben bu rüyamı Medine vebasının Mehyea'ya sıçrayacağı şeklinde tabir ettim.\" Fethu'l-Bari Açıklaması: \"Ben bu rüyamı Medine vebasının Mehyea'ya sıçrayacağı şeklinde tabir ettim.\" Mühelleb şöyle demiştir: Bu rüya, tabir edilmiş ve örnek verilen rüyalar kısmındandır. Örnek vermenin hangi açıdan olduğuna gelince; Nebi Sallallahu Aleyhi ve Sellem \".........\" kelimesinden \" .......''= kötülük\" ve \" .......'' = hastalık\" şeklinde iki kelime türetmiştir ve bunların çıkışını, isimlerini bir araya getirmek suretiyle tabir edip bulmuştur. Gördüğü kadının saçının dağınıklığını kötülük yapıp, bunu yayacak olanın Medine'den çıkacağı şeklinde tabir etmiştir. Bazıları şöyle demiştir: Saçın dağınıklığı vücudun titremesinden kaynaklanır. Çünkü \"ip\\ll\" uzak durma, tekin olmama aı:ılamınadır. Bundan dolay.ı ruhların tiksinti duyduğu şey, tıpkı sıtma hastalığında olduğu gibi bundan çıkar. Biz de şunu ekleyelim: Mühelleb'in \".......... =tiksinti duyma\" kelimesinden maksadı, onu görmenin' insanda tiksinti uyandırmasıdır. Aksi takdirde sözlükte \")'p\\lI\" saçın toplanması ve büzülmesi anlamına gelir. Kendi asli biçiminden değişen her şey için \"'.........\" fiili kullanılır. Mesela \"............\" denir ki \"Yeryüzü kuraklıktan, bitki susuzluktan dolayı bzzuldu\" demektir. Tabirci el-Kayrav 2101 şöyle demiştir: çoğu biçimlerinde kendisine karalık hakim olan her şey sevimsizdir. Bir başkası şöyle demiştir: Saçın dağınıklığı sıtma ile tabir edilir. Çünkü sıtma bedeni titreme ve başı yukarı kaldırma ile sarsar, özellikle siyah kadın daha çok sarsar. Çünkü o daha fazla ürküntü ve yabanilik verir",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 7039,
			"arabicnumber": 7039,
			"text": "Abdullah b. Ömer' in nakline göre Resulullah Sallallahu Aleyhi ve Sellem Medine hakkındaki rüyasım şöyle anlatmıştır: \"Rüyamda başı dağınık siyah bir kadın gördüm ki o Medine'den Çıktı da nihayet Mehyea'da konakladı. Ben bu rüyamı Medine vebasının Mehyea'ya -Cuhfe'ye- sıçrayacağı şeklinde tabir ettim",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 7040,
			"arabicnumber": 7040,
			"text": "Salim'in babasından nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Rüyamda saçı darmadağın ık siyah bir kadının Medine'den çıkıp nihayet Mehya'da durduğunu gördüm. Ben bunu Medine vebasının Mehyea'ya - Cuhfe'ye- sıçrayacağı şeklinde tabir ettim",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 7041,
			"arabicnumber": 7041,
			"text": "Ebu Musa'nın -zannederim Nebi Sallallahu Aleyhi ve Sellem'den diyerek- nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle anlatmıştır: \"Rüyamda bir kılıç salladığımı ve kılıcımın ortasının kırıldığını gördüm. Bunun tabiri Uhud günü mü'minlerden katledilenler imiş. Sonra bir kere daha kılıç salladım. Kılıç bu sefer olduğundan daha güzel hale döndü. Bunun tabiri de Allah'ın onunla getirdiği fetih ve mü'minlerin birleşmeleridir.\" Fethu'l-Bari Açıklaması: \"Rüyada kılıç salladığını görmek.\" Mühelleb şöyle demiştir: Bu rüya, örnek verme kabilindendir. Nebi Sallallahu Aleyhi ve Sellem, sahabileriyle birlikte saldırınca gördüğü kılıcı sahabiler, onu sallamasını sahabilere verdiği savaş emri, kılıçtaki kırığı sahabiler arasından ölenler şeklinde tabir etti. İkinci sallamada kılıcı eski haline döndüğü için bunu mu'minlerin toplanmaları ve kendilerine fetih nasip edilmesi şeklinde tabir etti. Rüya tabircileri, kılıç hakkında çeşitli tabirIerden söz etmişlerdir. Buna göre bir kılıç elde eden ya bir saltanata, ya bir göreve, ya verilecek bir emanete, ya bir eşe ya da bir çocuğa sahip olur. Bir kimse kılıcını kınından çektiğinde kılıcı kör ve kesmez olursa hanımı kurtulur, çocuğu yaralanır. Kılıcın kını kırılıp, kılıca bir şeyolmazsa bunun aksi meydana gelir. Kılıç da, kın da kırılmaz veya ikisi birden kırılırsa tabir yine aynıdır. Kılıcın kabzası babaya ve baba tarafından akrabalara bağlılık, temreni anne ve yakın akrabalar şeklinde tabir edilir. Bir kimse rüyasında kılıç çeker ve birisini öldürmek isterse bu onun dili olarak yorumlanır ki onu hasımları hakkında kullanır. Bazen kılıç zalim sultan olarak da tabir edilebilir. Bazı tabirciler ise şöyle demişlerdir: Bir kimse rüyasında kılıcını kınına soktuğunu görse o kişi evlenir veya bir kimse bir şahsa kılıcıyla vurduğunu görse onun hakkında söz söyler. Bir kimse rüyada bir başkasıyla çarpıştığını ve kılıcının onun kılıcından daha uzun olduğunu görse ona galip gelir. Rüyada büyük bir kılıç görmek fitnedir. Kılıç kuşanan kimse bir göreve gelir. Kılıcı kısa ise işi devam etmez. Bir kimse kılıcının askısını sürüdüğünü görse onu kullanmaktan aciz olur",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 7042,
			"arabicnumber": 7042,
			"text": "İbn Abbas'ın nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Her kim görmediği bir rüyayı gördüm diye iddia ederse (kıyamet gününde) ona iki arpa tanesini birbirine düğümlemesi teklif edilir ve hiçbir zaman bunu yapamaz. Her kim de bir topluluğun duyulmasını istemediği veya bundan kaçındığı bir konuşmayı dinlemeye çalışırsa onun iki kulağına kıyamet gününde kurşun dökülür. Her kim de bir suret resmederse ona hayat verecek kudrette olmadığı halde 'Haydi buna ruh üfle' diye teklif olunarak azap edilir",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 7043,
			"arabicnumber": 7043,
			"text": "İbn Ömer'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"Yalanların en büyüğü, kişinin rüyasında görmediği şeyi gözleriyle gördüğünü iddia etmesidir\" demiştir. Fethu'l-Bari Açıklaması: \"Görmediği bir rüyayı gördüğünü iddia etmek.\" Yani bunu yapan kişinin kınanmış olduğu. Bu hadis üç hüküm içermektedir. Rüyası hakkında yalan söylemek, sözünün dinlenmesinden hoşlanmayan kimsenin sözüne kulak vermek ve suret yapmaktır. Libas bölümünün son kısımlarında \"Her kim bir suret yaparsa ... \" hadisi açıklamasıyla birlikte geçmişti. Görmediği rüyayı gördüğünü iddia etmeye gelince, Taberi şöyle demiştir: Uyanıkken yalan söylemek, bazen görmediği rüyayı gördüğünü iddia ederek yalan söylemekten daha çok fesada yol açar. Zira bu, adam öldürme veya bir had cezası ya da birinin malını çalma hakkında yalan yere şahitlik olabilir. Böylısi yalan şahitlik daha çok fesada yol açtığı halde görmediği rüyayı gördüğünÜ iddia ederek yalan söylemeye bu derece tehdit yönlendirilmesi, rüya hakkında yalan söylemenin göstermediği rüyayı gösterdi diye' Allah'a yalan iftira atmaktan kaynaklanmaktadır. Allah'a yalan iftirası atmak, yaratıklara yalan iftira atmaktan çok daha ağırdır. Çünkü Yüce Allah \"Onlar (kıyamet gününde) Rablerine arz edilecekler, şahitler de 'işte bunlar Rablerine karşı yalan söyleyenlerdir' diyecekler\"(Hud 18) buyurmaktadır. Rüya hakkında yalan söylemek \"Rüya Nebilikten bir cüzdür\" hadisi dolayısıyla Allah'a yalan iftira etmek anlamındadır. Nebiliğin cüzlerinden birisi olan şey, Yüce Allah tarafındandır. \"Ona iki arpa tanesini birbirine düğümlemesi teklif edilir\" ifadesi terim anlamındaki mükellef kılma değildir. O, daha önce geçtiği üzere azap etmenin kinayeli anlatımıdır. Kulağına kurşun dökme şeklindeki tehdit, cezanın yapılan suçun cinsinden olmasından kaynaklanmaktadır. Hadis metninde geçen \"el-anük\" erimiş kurşun demektir. İbn Ebi Cemre şöyle demiştir: Hadisten kulluk niteliğinden dışarı çıkan kimsenin Çıktığı oranda cezayı hak ettiği anlaşılmaktadır. Hadiste bunu bilmeyen kimsenin bilmemesi dolayısıyla mazur olmayacağı uyarısı yapılmaktadır. Bu konuda batıl bir tevile sapan da aynı şekildedir. Çünkü haberde bunun haram olduğunu bilenle bilmeyen arasında herhangi bir fark gözetilmemektedir. \"Valanların en büyüğü\" \"efra\" ismi, ism-i tafdil ölçüsünde olarak yalanların en büyüğü demektir. \"el-Fira\" \"el-firye\" kelimesinin çoğuludur. İbn Battal \"elfirye\" hayret uyandıracak büyük yalan demektir",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 7044,
			"arabicnumber": 7044,
			"text": "Ebu Seleme şöyle alnlatmıştır: Andolsun ben rüya görürdüm de bu rüya beni hasta ederdi. Nihayet Ebu Katade'den işittim. Şöyle diyordu: Ben de rüya görürdüm de gördüğüm rüya beni hastalandırırdı. Nihayet Nebi Sallallahu Aleyhi ve Sellem'den işittim. O şöyle buyuruyordu: \"Güzel rüya Allah tarafındandır. Herhangi biriniz sevdiği bir şeyi gördüğünde bunu kendisini seven kimselerden başkasına anlatmasın. Hoşlanmadığı bir şey gördüğü zaman ise bu rüyanın ve şeytanın şerrinden Allah'a sığınsın ve sol tarafına üç defa tükürsün ve sakın bu kötü rüyasını kimseye söylemesin. Çünkü böyle yaparsa o çirkin rüya kendisine zarar veremez",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 7045,
			"arabicnumber": 7045,
			"text": "Ebu Said el-Hudrı'nin nakline göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Herhangi biriniz sevdiği bir rüya görürse (bilsin ki) o Allah tarafındandır. Rüya sahibi bu rüyası üzerine Allah'a hamdetsin ve onu başkasına da söylesin. Bunun dışında hoşlanmadığı bir rüya gördüğünde de muhakkak ki bu rüya da şeytandandır. Bu halde onu gören şerrinden Allah'a sığınsın ve rüyasını kimseye söylemesin. Çünkü böyle yaparsa o rüya, sahinibe zarar vermez. Fethu'l-Bari Açıklaması: \"Bunu kendisini seven kimselerden başkasına anlatmasın.\" Daha önce geçtiği üzere bunun hikmeti şudur: Kişi gördüğü güzel rüyayı kendisini sevmeyene anlattığında o kişi rüyasını ya kininden ya da kıskançlığından onun sevmeyeceği şekilde tabir eder ve rüya onun anlattığı şekilde çıkar ya da üzüntüsünden ve sıkıntısından dolayı bu rüyadan kendi nefsine de acele ile bir pay çıkarır. Bundan dolayı kendisini sevmeyen kimseye rüyasını anlatmaması emredilmiştir",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 7046,
			"arabicnumber": 7046,
			"text": "İbn Abbas şöyle anlatmıştır: Bir kişi Nebi Sallallahu Aleyhi ve Sellem'e geldi ve şöyle dedi: \"Ya Resulallah! Ben bu gece rüyamda yerle gök arasında bir bulut gördüm. Ondan yere yağ ve bal damlıyordu. İnsanların da ondan avuç avuç almakta olduklarını gördüm. Kimi çok, kimi az topluyordu. Bu sırada yerden göğe doğru bir ip uzandığını ve senin bu ipe tutunup, yukarıya doğru yükseldiğini gördüm. Sonra o ipi başka bir kişi tuttu, o da yükseldi. Sonra bir başkası tuttu fakat bu defa ip koptu. Sonra ip bağlanıp birleştiriidi. Bunun üzerine Ebu Bekir \"Ya Resulallah! Babam, anam sana feda olsun! Allah aşkına bana müsaade ediniz de bu rüyayı ben tabir edeyim!\" dedi. Resulullah Sallallahu Aleyhi ve Sellem ona \"Haydi tabir et!\" diye izin verince Ebu Bekir şöyle dedi: Bu zatın gördüğü bulut İslam'dır. Ondan damlayan yağ ve bal Kur'an'dır. Onun tadı damlayacaktır. Kur'an'dan kimi çok, kimi az faydalanacaktır. Gökten yere erişen ip de üzerinde bulunduğun hak ipidir. Sen onu tutuyorsun, Allah da seni yükseltiyor. Sonra onu başka biri tutacak ve o da yükselecek. Sonra bir başkası tutacak, o da yükselecek. Sonra onu bir diğeri tutacak fakat ip kopacak. Sonra onun için bağlanacak, o da yükselecek. Bu 'tabirin sonunda Ebu Bekir \"Ya Resulallah! -babam sana feda olsun. bana haber ver! Bu tabirimde isabet mi ettim yoksa hata mı ettim?\" diye sordu. Resulullah Sallallahu Aleyhi ve Sellem \"Bazısında isabet, bazısında hata ettin\" buyurdu. Ebu Bekir \"Ya Resulallah! Hata ettiğim şeyi Allah rızası için bana haber versen!\" dedi. Resulullah Sallallahu Aleyhi ve Sellem \"Allah adına and vererek ısrar etme!\" buyurdu. Fethu'l-Bari Açıklaması: \"Rüyanın tabiri çıkmadığında bunun ilk tabir edene ait olduğu görüşünü kabul etmeme.\" İmam Buhari attığı bu başlıkla Enes hadisine işaret eder gibidir. Enes'in naklettiği hadiste Resulullah Sallallahu Aleyhi ve Sellem \"Rüya ilk tabir edenindir\" buyurmuştur. Bu hadis zayıftır fakat hadisin Ebu Davud, Tirmizi ve İbn Mace'de hasen isnadla yer alan şahitleri vardır. Hakim'in sahihdir değerlendirmesi ile Ebu Rezın el-Ukayll' den nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Rüya tabir edilmediği sürece bir kuşun ayağındadır. Tabir edildiğinde (nasıl tabir edilmişse) öylece çıkar.\"(İbn Mace, Tabirü'r-rüya) Darimı'de hasen isnadla Süleyman b. Yesar'ın nakline göre Aişe r.anha. şöyle demiştir: Medine halkından bir kadının kocası tüccardı ve ticaret dolayısıyla seyahatlere çıkıyordu. Bu kadın Resulullah Sallallahu Aleyhi ve Sellem'e gelerek \"Kocam kayıp, beni hamile olarak bıraktı. Rüyamda evimin direğinin kırıldığını ve şaşı gözlü bir çocuk doğurduğumu gördüm\" dedi. Resulullah Sallallahu Aleyhi ve Sellem \"Hayırdır! İnşailah kocan sağ salim dönecek. Sen itaatkar bir çocuk doğuracaksın\" dedi. Kadın bu rüyayı üç kez anlattı. Resulullah Sallallahu Aleyhi ve Sellem'in evde bulunmadığı bir sırada yine geldi. Ben ona rüyasını sorunca bana da anlattı. Ona \"Rüyan doğru çıkarsa kocan ölecek, sen itaatkar olmayan bir çocuk doğuracaksın\" dedim. Kadın ağlamaya başladı. Bu sırada Resulullah Sallallahu Aleyhi ve Sellem geldi ve \"Ya Aişe böyle yapma! Bir Müslümanın rüyasını tabir edeceğinizde hayra yorunuz. Çünkü rüya onu görenin tabir ettiği gibi çıkar\" buyurdu.(Darimi, Rüya) Tabirciler, rüya gören kimsenin doğru konuşması, yatmadan önce abdest alıp sağ yanına yatması, uyumadan önce eş-Şems, el-Leyl, et-Tin ve el-İhlas, el-Felak ve en-Nas surelerini okuması adaptandır demişlerdir. Sonra kişi şöyle dua eder: \"Allah'lm! Kötü rüyadan sana sığınırım. Uyanıkken ve uykuda şeytanın oynamasından sana sığınırım. Ya Rabbi! Senden salih, sadık, faydalı, hatırlanan ve unutulmayan dua dilerim. Ya Rabbi! Bana rüyamda sevdiğimi göster.\" Kişinin gördüğü rüyayı bir kadına, düşmana ve cahile anlatmaması adaptandır. Rüya tabircisinin onu güneş doğarken, batarken, tam tepede iken ve geceleyin tabir etmemesi de adaptandır. \"....\" gölge veren bulut demektir. Hattabl'nin ifadesine göre gölgelik ve benzeri gölge veren her şeye Arapça'da \"...\" denilir. ............ O buluttan yağ ve bal damlıyordu, \" ıJ (j\"'l:JI LS);\" insanları avuç avuç alırken gördüm, .......... yani çok alan ve az alan bulunmaktadır anlamına gelir. '..........' sebep \"ip\" demektir. Hadisten Çıkan Sonuçlar 1- Rüya daha önce açıklandığı üzere ilk tabireinin değildir. 2- Rüya ilmini ve tabirini öğretmek ve onun tabirini sormaktan gaf1ete düşmemek gerekir. Bunun fazileti rüyanın bazı gaybı bilgileri ve kainatın esrarını kapsamasıdır. İbn HUbeyre şöyle demiştir: Önce ve sonra Ebu Bekir'in sorması ve Resulullah Sallallahu Aleyhi ve Sellem'in cevap vermesi onun Nebi Sallallahu Aleyhi ve Sellem'in karşısında rahat davrandığını ve sevgisine güvenerek nazlı bir tavır takındığını göstermektedir. 3- Rüya ancak alim, güvenilir bir öğütçü ve sevimli bir kişi tarafından tabir edilir. 4- Rüya tabir eden bazen hata ederken, bazen isabet edebilir. Tabir aliminin tabiri söylemektense gizlemek daha ağır bastığı durumlarda rüyanın tamamını veya bir kısmını tabir etmemelidir. Mühelleb şöyle der: Bunun yeri bu konuda genellik sözkonusu olduğundadır. Buna karşılık görülen rüya mesela bir kişiye mahsussa o kişinin kendisini sabra hazırlaması ve hadisenin başına gelmesini ciddiye alması için tabir etmekte sakınca yoktur. 5- Niyeti halisane ve kendini beğenmekten emin olduğu takdirde bir alimin güzel becerdiği şeyi izhar etmesi caizdir. Bir alim, kendisinden daha alim olan açıktan veya buna benzer bir yolla izin verdiği takdirde onun huzurunda bilgisini ortaya koyabilir. 6- Böyle bir durumda alim fetva ve hüküm verebilir. Öğrencinin kendisine hükmü bildirmesi için Allah aşkına diye müracaatta bulunması caizdir",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 7047,
			"arabicnumber": 7047,
			"text": "Semura b. Cündeb şöyle anlatmıştır: Resulullah Sallallahu Aleyhi ve Sellem'in \"Herhangi biriniz rüya gördü mü?\" diye sık sık sorduğu olurdu. Bunun üzerine Allah'ın anlatmasını dilediği biri olursa çıkar rüyasını anlatırdı. Bir gün Nebi Sallallahu Aleyhi ve Sellem, sabah vakti bize kendi gördüğü rüyasını şöyle anlattı: \"Bu gece bana iki kişi geldi. Beni (rüyada) uyandırdılar ve 'Bizimle yürü!' dediler. Ben de onlarla birlikte yürüdüm. Nihayet yatmakta olan bir adamın yanına vardık. Bunun başucunda da elinde taş bulunan başka bir adam durmuş, o yatan adamın başını taşla vurup kınyordu. Taşı başına her vurduğunda taş o tarafa yuvarlanıp gidiyordu. Atan adam da arkasından koşuyor ve onu tekrar alıp getiriyordu. O dönüp gelmeden berikinin başı iyi oluyor ve eski haline dönüyordu. Sonra taşı getiren adam yatan adamın üzerine dönüyor ve ona birinci defa yaptığının aynısını yapıyordu. \" Resulullah Sallallahu Aleyhi ve Sellem şöyle devam etti: \"Ben bu iki kişiye 'Subhanallah! Bu iki kişi nedir?' diye sordum. Bana 'Yürü, yürü!' dediler. Bizler yürüdük ve sonunda arka üstü yatmakta olan bir adamın yanına geldik. Onun başucunda da elinde demirden çatal bir kanca bulunan başka bir adam ayakta duruyordu. Ayakta duran adam yatan adamın. yüzünün bir tarafı üzerine eğiliyor ve ağzının yan tarafını ta başının arkasına kadar yırtıp parçalıyordu. Yine onun boğazını da başının arkasına kadar kesip parçalıyor, gözünü de başının arkasına kadar yırtıp parçalıyordu.\" Ravi dedi ki: Ebu Reca \"A=kesiyor\" yerine \"=yarıyor\" ifadesini kullanmış da olabilir. Resulullah Sallallahu Aleyhi ve Sellem şöyle devam etti: \"Sonra bu adam onun ağzının diğer tarafına geçiyor ve orasını da ilk yaptığı gibi yarıp parçalıyordu. Bu kısmı parçalamayı bitirinceye kadar ağzın diğer yanı eskiden olduğu gibi iyileşiyordu. Sonra adam tekrar oraya dönüyor, orasını birinci defada yaptığı gibi kesip yarıyordu.\" Resulullah Sallallahu Aleyhi ve Sellem dedi ki: \"Ben yine yanımdaki iki kişiye 'Subhanallah! Bu iki adamın hali nedir?' diye sordum. \" Resulullah Sallallahu Aleyhi ve Sellem şöyle devam etti: \"O iki kişi bana 'Yürü, yürü!' dediler. Biz yine yürüdük ve tennur (tandır) gibi bir şeyin yanına geldik.\" Ravi dedi ki: Zannederim ki o şöyle diyordu: \"Bir de baktık ki onun içinde karışık bağırmalar ve birçok sesler vardı.\" Resulullah Sallallahu Aleyhi ve Sellem şöyle devam etti: \"Biz onun ağzına doğru baktık ki içeride birçok çıplak erkekler ve çıplak kadınlar vardı. Onların aşağısından kendilerine bir ateş alevi geliyordu. Onlara bu alev geldikçe bağırıp çağırıyorlardı. \" Resulullah Sallallahu Aleyhi ve Sellem şöyle devam etti: \"Yanımdaki iki kişiye 'Bu çıplak erkekler ve kadınlar nedir?' diye sordum. O ikisi bana 'Yürü, yürü!' dediler. Biz yine yürüdük ve bir nehir üzerine geldik.\" Ravi dedi ki: Zannediyorum ki o şöyle diyordu: \"Nehir kan gibi kırmızı idi. Bir de baktık ki bu nehirin içinde yüzmekte olan bir adam vardı. Nehrin kenarında da yanıbaşında birçok taş toplamış bir adam vardı. Nehirdeki bu adam yüzdüğü kadar yüzüyor, sonra yanında taşlar toplayan adamın yanına geliyor ve ona doğru ağzını açıyor. Kenardaki adam da ona bir taş atıp yutturuyor. Bunun üzerine nehirdeki adam yüzerek geriye doğru gidiyor. Sonra tekrar kenardakine doğru dönüp geliyor. Kenardakinin yanına her dönüşünde onun ağzının içine bir taş daha atıyor ve ona taşı yutturuyor.\" Resulullah Sallallahu Aleyhi ve Sellem dedi ki: \"Yanımdaki iki kişiye 'Bu iki adamın hali nedir?' diye sordum. Bana 'Yürü, yürü!' dediler.\" Resulullah Sallallahu Aleyhi ve Sellem dedi ki: \"Biz yine yürüdük ve sonunda gördüğüm en çirkin görünüşte olan çirkin manzaralı bir adamın yanına geldik. Bir de baktı k ki onun yanında yatmakta olduğu ve etrafında koşmakta bulunduğu bir ateş vardır. Ben yine o iki kişiye 'Bu adamın hali nedir?' diye sordum. Onlar da bana 'Yürü, yürü!' diye emrettiler. Biz yine yürüdük. Sonunda uzun ağaçlar ve bol bitkilerle sarılmış bir bahçeye geldik. Bahçede baharın her bir çiçeğinden vardı. Bahçenin ortasında çok uzun boylu bir adam vardı ki ben onun semaya doğru uzanan başını hemen hemen göremiyordum. Adamın etrafında da asla görmediğim kadar pek çok çocuklar vardı. Ben yanımdaki iki kişiye 'Bu uzun adam ve bu çocuklar nedir?' diye sordum. O iki kişi bana 'Yürü, yürü!' dediler. Biz yine yürüdük ve sonunda büyük bir bahçeye vardık. Ben asla ondan daha büyük ve daha güzel bir bahçe görmüş değilim. Yanımdaki iki kişi bana 'Bu ağaçların içinde yükseğe çık!' dediler. Biz o ağaçların içlerinde yükseklere doğru çıktık. Nihayet altın ve gümüşten tuğlalarla bina edilmiş olan bir beldeye ulaştık. Şehrin kapısına geldik ve açılmasını istedik. Kapı bizim için açıldı. Kapıdan şehre girdik. Bizleri onun içinde birtakım adamlar karşıladılar ki, bunların vücutlarının yarısı gördüğüm en güzel insan şeklinde, diğer yarısı da gördüğüm en çirkin insan şeklinde idi. Yanımdaki iki kişi o insanlara 'Gidiniz de şu nehir içine giriniz' dediler. Orada enine akmakta olan bir nehir vardı ki sanki suyu süt kadar beyazdı. O insanlar gittiler ve o nehrin içine girdiler. Sonra kendilerinden o çirkin sıfatlar gitmiş olarak en güzel surette bizim yanımıza döndüler. Yanımda bulunan iki kişi bana 'Bu şehir Adn cennetidir, işte burası senin menzilindir!' dediler. Gözlerim yükselip, yukarıya doğru baktı, bir de ne göreyim! Gökyüzündeki çok uzak bulut gibi bembeyaz bir köşk gördüm. Yanımdaki iki kişi bana 'İşte orası senin menzilindir!' dediler. Ben de onlara '11 Ila h sizlere bereketler ihsan eylesin! Müsaade edin de oraya gireyim' dedim. Onlar 'Şimdi oraya giremezsin. Sen ileride oraya gireceksin!' dediler. Ben yanımda bulunan o iki kişiye 'Ben bu gece boyunca çok hayret verici şeyler gördüm. Benim gördüğüm bu şeyler nedir?' dedim. O iki kişi bana şöyle anlattı: Sana bunun haberini vereceğiz. Şu yanına geldiğin ve taş ile başı ezilen birinci adam Kur'an'ı alıyor, onu reddediyor ve farz namazı terk ederek uyuyordu. Şu üzerine gelip, başının arkasına kadar ağzının bir tarafı, boğazı da başının arkasına kadar, gözü de başının arkasına kadar yırtılıp parçalandığını gördüğün adam da erkenden evinden gider ve öyle bir yalan söylerdi ki onun bu yalanı her tarafa yayılırdı. Şu fırın gibi binanın içinde görmüş olduğun o çıplak erkek ve kadınlar da zina eden erkekler ve kadınlardır. O nehirde yüzmekte olup üzerine geldiğin ve kendisine taş yutturulan adam ise faiz yiyen kimsedir. Bir ateş yanında onu yakıp, etrafında koşmakta olan o çirkin manzaralı adam da cehennemin bekçisi olan Malik'tir. O büyük bahçenin içinde gördüğün uzun boylu adam İbrahim Nebidir. Onun etrafındaki çocuklar ise fıtrat üzere ölen her bir çocuğudur.\" Semura dedi ki: Bazı Müslümanlar \"Ya Resulallah! Müşriklerin çocukları da mı?\" diye sordular. Resulullah Sallallahu Aleyhi ve Sellem \"Müşriklerin çocukları da\" buyurdu ve devamla: \"Kendilerinin bir kısım güzel, diğer kısımları da çirkin olan o topluluk bir kısım güzel amellerini diğer çirkin amelleriyle karıştırmış olan kimselerdir ki Allah onların suçlarını bağışlamıştır.\" Fethu'l-Bari Açıklaması: \"Rüya tabirini sabah namazının ardından yapmak.\" Bu başlıkta Abdurrezzak'ın Ma'mer vasıtasıyla Said b. Abdurrahman'ın bazı alimlerden naklettiği şu görüşün zayıf olduğuna işaret edilmektedir: \"Rüyanı kadına anlatma, onu güneş doğuncaya kadar kimseye söyleme.\"(Abdurreızak, Musannef, XI, 215) Bu başlıkta ayrıca tabirdıerin müstehab olan rüya tabirinin güneş doğduktan itibaren dörde kadar ve ikindiden akşam namazının öncesine kadar yapılmasıdır şeklindeki görüşlerine red vardır. Çünkü hadis, rüya tabirinin güneş doğmadan önce yapılmasının müstehab olduğunu göstermektedir. Bu, tabircilerin rüyanın namaz kılmanın mekruh olduğu vakitlerde tabir edilmesinin mekruh olduğu şeklindeki görüşleriyle çelişmez. Mühelleb şöyle demiştir: Sabah namazı vakti rüya tabiri diğer vakitlerden daha evladır. Çünkü rüya gören kişi onu kısa bir süre önce gördüğü ve henüz unutmadığı için aklında tutar. Ayrıca tabirdnin zihni dağılmamış, geçimiyle ilgili şeyler konusunda düşüncesi fazla meşgulolmadığından rüyayı gören rüya sebebiyle kendisine arz olan şeyi bilir ve hayırla sevinir, kötülükten kaçınır ve buna hazırlanır. Belki de rüyasında bir masiyete karşı uyarı vardır ve bu sayede o masiyetten kaçınır. Gördüğü rüya bir iş konusunda uyarı niteliğinde olup, onu gören o hususta tetikte olur. Rüya tabirdsi son olarak şöyle der: Bunlar rüyanın günün ilk saatlerinde tabir edilmesinin birkaç faydasından ibarettir. .......... yani onlar beni uyandırdılar. .......... başını yardı. ........, onu yukarıdan aşağıya attı. \"C..l>.l.i Tedehdehe\" yukarıdan aşağıya düştü anlamına gelir. ........ yanağını yarıyordu......... eş-Şıdku\" ağzın yan tarafı demektir. \"Ke ekrehi ma ente ra in raculen mir'aten\" yani çirkin manzaralı. \"Ve yes'a havleha.\" Cerır'in rivayetine göre \"ve yukiduha\" bu kelime \"yahuşşuha\"nın tefsiri mahiyetindedir. \"Ke enne maehu'l-mahd\" bu ister tatlı, ister acı olsun içine hiç su katılmamış süt demektir. \"Mislu'r-rebabeti\" beyaz bulut parçası gibi demektir. \"Fe yerfuduhu=onu reddeder.\" İbn HUbeyre şöyle demiştir: Kur'an'ı ezberledikten sonra reddetmek büyük bir dnayettir. Çünkü bu Kur'an'da onu reddetmeyi gerekli kılan bir şey gördüğü izlenimini uyandırır. Bir kimse dünyadaki en şerefli şeyolan Kur' an' i reddettiğinde organlarının en şereflisi olan başı ezilerek ceza görür. \"Fehum ez-zünatu=Onlar zina edenlerdir.\" Zina edenlerle çıplaklık ilişkisi, onların rezil ve rüsvay olmayı hak etmelerinden dolayıdır. Çünkü onların adeti bir yere geçip gizlenmek olduğundan bu gizlilikleri açığa çıkarılmak suretiyle cezalandırıldılar. Onlara azabın alt taraflarından verilmesindeki hikmet, işledikleri fiilin üreme organları vasıtasıyla olmasından dolayıdır. \"Fe innehu akilu'r-rib\"=o faiz yiyendir.\" İbn Hubeyre şöyle demiştir: Faiz yiyen kimsenin kızıl bir nehirde yüzmesi ve kendisine taş yutturulması, faizi n altın üzerinden yapılmasındandır. Altın da . kırmızı renktedir. Meleğin faiz yiyene taş yutturması, taşın o kimseye hiçbir fayda vermeyeceğine işarettir. Faiz de böyledir. Çünkü faiz yiyen, malının artacağını hayal etmektedir. Halbuki Allah onun arkasından malını telef etmektedir. \"Ve eviadu'l-müşrikın =müşriklerin çocukları.\" Cenaiz bölümünün son kısımlarında müşriklerin çocukları ile ilgili geniş bir açıklama geçmişti. Bu hadisin zahirinden Nebi Sallallahu Aleyhi ve Sellem'in müşriklerin çocuklarını ahiret hükmü açısından Müslümanların çocuklarına kattığını göstermektedir. Bu \"Onlar babalarına tabidirler\" ifadesiyle çelişmez. Çünkü bu dünya hükmü açısından böyledir. Hadisten Çıkan Sonuçlar 1- İsra (gece yürüyüşü) birçok yerde uykuda ve uyanıkken defalarca gerçekleşmiştir. 2- Bazı asiler berzah aleminde azap göreceklerdir. 3- Hadiste bir çeşit bilgi özetleme vardır. Bu metoda göre meseleler önce toptan ele alınır, sonra zihinde topluca yer etmesi için açıklamaya geçilir. 4- Uyuyarak farz namazıarı geçirmemelidir. 5- Kur'an'ı ezberleyen kimse onu reddetmemelidir. Zina etmemeli, faiz yememeli ve kasten yalan söylememelidir. 6- Cennette köşkü olan kimse -Nebi ve şehit bile olsa- dünyada iken onun içinde oturmaz. Aksine öldüğünde ikamet eder. 7 - İlim öğrenmelidir ve kişi ilim alacağı kimsenin ardından gitmelidir. 8- Şehitlerin fazileti vardır ve onların cennetteki yerleri mertebelerin en yükseğidir. 9- İyilikleri ve kötülükleri birbirine eşit olan kimseyi Yüce Allah bağışlar. Ya Rabbi, ey merhamet edenlerin en merhametlisi! Rahmetinle bizim günahlarımızı da bağışla. 10- Rüyaya önem vermeli, tabirini sormalıdır. Rüyanın sabah namazından sonra tabir edilmesi faziletli ve müstehaptır. Çünkü o vakitte insanın aklı henüz çeşitli meselelere dalmamıştır. 11- İmam namazdan sonra kılınacak bir sünnet yoksa ve cemaate vaaz etmek veya fetva vermek ya da aralarında hüküm vermek istiyorsa yüzünücemaate döner. 12- İmamın cemaate dönmek için yüzünü kıbleden çevirmesi mekruh değildir. Aksine minberde bulunan hatip örneğinde olduğu gibi bu, meşrudur",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 61
			}
		}
	]
}