{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"92": "Afflictions and the End of the World"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7048,
			"arabicnumber": 7048,
			"text": "Esma binti Ebi Bekir'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Ben (kıyamet gününde) havuzumun başında yanıma gelecek olanları beklerim. Derken benim yakınımda birtakım insanlar yakalanırlar. Ben 'Onlar benim ümmetimdir' derim. Bana 'Sen bilmiyorsun, onlar (senden sonra) dinlerinden arkalarına dönüp gittiler' denilir",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 7049,
			"arabicnumber": 7049,
			"text": "Abdullah b. Mesud'un nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Ben, sizin havuz başına varan öncünüzüm. Yemin olsun orada sizden birtakım adamlar bana kaldınlıp gösterilecek, onlara vermek üzere elimi uzattığımda onlar çekilip, benden uzaklaştınlacaklar. Ben 'Ey Rabbim! Onlar benim arkadaşlarımdır' diyeceğim. (Yüce Allah) 'Sen onların senden sonra dinde neler icat ettiklerini bilmezsin!' buyuracaletır",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 7050,
			"arabicnumber": 7050,
			"text": "",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 7051,
			"arabicnumber": 7051,
			"text": "Sehl b. Sa'd şöyle demiştir: Ben Nebi Sallallahu Aleyhi ve Sellem'den işittim. O şöyle buyuruyordu: \"Ben sizin havuz başında öncünüzüm. Ona gelen içer, ondan içen ebediyen bir daha susamaz ve muhakkak benim yanıma birtakım kavimler gelecekler ki ben onlan tanırım, onlar da beni tanırlar. Sonra benimle onlar arasına bir perde çekilir.\" Fethu'l-Bari Açıklaması: AÇIKLAMADAN SONRA 2.BAB VE HADİSLER VAR \"Yüce Allah 'ın: 'Bir de öyle bir fitneden sakının ki o, içinizden sadece zulmedenlere erişmekle kalmaz. '26 buyruğu.\" Bu konuda Ahmed b. Hanbel ile el-Bezzar'ın, Mutarrıf b. Abdullah b. eşŞahır' den şöyle bir nakli vardır: \"Cemel olayı hakkında ZUbeyr' e 'Ey Ebu Abdullah! Ne yaptınız? Katledilen halife Osman' ı Medine'de harcadınız. Sonra Basra'dan gelip kanını arıyorsunuz' dedik. ZUbeyr şöyle cevap verdi: \"Bizler Nebi Sallallahu Aleyhi ve Sellem'in döneminde \"Bir de öyle bir fitneden sakının ki o, içinizden sadece zulmedenlere erişmekle kalmaz\"(Enfal 25) ayetini okuyorduk. Ancak bu ayet e konu olanların bizler olacağımızı hesap etmemiştik. Nihayet işte bildiğin o olaylara karıştık. \"(Ahmed b. Hanbel, I, 165) Taberl'de Ali b. Ebi Talha'nın nakline göre İbn Abbas şöyle demiştir: \"Yüce Allah mu'minlere huzurlarında işlenen münkeri kabul etmemelerini emretmiş, aksi takdirde azabı herkese vereceğini bildirmiştir.\" Bu haberin Adiyy b. Umeyre rivayetiyle hadisten şahidi vardır. Adiyy'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Yüce Allah seçkinlerin yaptıklarından dolayı herkese 'lzap etmez. Ancak avam huzurlarında bir münkerin işlendiğini görür ve ona tepki koyma güçleri olduğu halde tepki koymazlarsa Yüce Allah hem havassı, hem de avammı azaplandırır.\" Bu haberi hasen isnadla Ahmed b. Hanbel nakletmiştir. Haber Ebu Davud'da da yer almaktadır. (Ahmed b. Hanbel, 4, 192) \"Susamaz.\" Bilginlerin ifadesine göre bu, o kişi cennete girer ifadesinin kinayeli anlatımıdır. Zira susamamak cennete girenlerin vasfıdır. Ebu Said'in naklettiği hadiste Resulullah Sallallahu Aleyhi ve Sellem kendisine \"Onların (senden sonra) dinlerinden neleri değiştirdiğini sen bilmezsin\" denileceğini haber vermiştir. Kısaca söylemek gerekirse; hadiste sözü edilen kimselerin durumları şöyle yorumlanır: Bu kimseler İslam'dan dönmüşlerse Nebi Sallallahu Aleyhi ve Sellem'in onlardan uzak olması ve onların da uzaklaştırılmasında herhangi bir problem yoktur. Dinden dönmemişler ancak beden amellerinde büyük masiyetler uydurmuşlar veya kalp inancı açısından bid'atler ortaya çıkartmışlarsa bazıları buna şöyle cevap vermişlerdir: Resulullah Sallallahu Aleyhi ve Sellem bu kimselerden Yüce Allah'ın haklarındaki emri dolayısıyla yüz çevirmiş ve onlara şefaat etmemiştir ki Allah yaptıklarına karşılık onları cezalandırsın. Bu kimselerin Resulullah Sallallahu Aleyhi ve Sellem'in ümmetinden büyük günah işleyenlere şefaatinin genelliğine dahil olup, tevhid ehli kimselerin cehennemden çıktıkları sırada oradan çıkmalarında herhangi bir man i yoktur. Doğruyu en iyi Yüce Allah bilir",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 7052,
			"arabicnumber": 7052,
			"text": "Abdullah b. Mesud'un nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Sizler benden sonra ileride başkalarının size tercih edildiğini ve hoşlanmayacağınız birtakım işler göreceksiniz.\" Sahabiler \"Ya Resulallah! Bu durumda bize ne emredersiniz?\" diye sordular. Resulullah Sallallahu Aleyhi ve Sellem \"Onlara haklarını veriniz, kendi hakkınızı da Allah'tan isteyiniz\" buyurdu",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 7053,
			"arabicnumber": 7053,
			"text": "İbn Abbas r.a.'ın nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"Her kim başındaki idarecisinden (emir) hoşlanmayacağı bir şey görürse buna sabretsin. Çünkü her kim sultan (ın otoritesin) den bir karış dışarı çıkarsa o cahiliye ölümü ile ölür",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 7054,
			"arabicnumber": 7054,
			"text": "İbn Abbas'ın nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"Her kim başındaki idarecisinden (emir) hoşlanmayacağı bir şey görürse buna sabretsin. Çünkü kim cemaatten bir karış ayrılır da ölürse muhakkak o cahiliye ölümü ile ölür",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 7056,
			"arabicnumber": 7056,
			"text": "",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 7057,
			"arabicnumber": 7057,
			"text": "Useyd b. Hudayr şöyle anlatmıştır: Ensardan birisi Resulullah Sallallahu Aleyhi ve Sellem'e gelerek \"Ya Resulallah! Filanca kişiyi bir göreve tayin ettiniz. Beni tayin etmediniz\" dedi. Resulullah Sallallahu Aleyhi ve Sellem \"Şüphesiz sizler benden sonra başkalarının size tercih edildiğini göreceksiniz. Bununla beraber yine de (kıyamet günü) bana kavuşuncaya kadar sabrediniz.\" Fethu'l-Bari Açıklaması: .... yani dinle ilgili hoşlanmayacağınız birtakım durumlar. \"........\" yani böyle bir durum meydana geldiğinde ne yapmamızı emredersin? \".........\" yani emirlere \"......\" ister kendilerine mahsus, ister kamuya ait olsun isteme ve alma hakları bulunan haklarını veriniz. \".........\" Sevrı'nin rivayetinde bu ifade \".......... Ve tes'elunal\" şeklindedir. Bunun manası Allah'tan onlara sizlere insaflı davranmalarını ilham etmesini veya onlardan daha hayırlısını başınıza getirmesini isteyin. Bu ifadenin zahiri emre muhatap olan herkesedir. Müslim'in Ümmü Seleme'den nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"İleride birtakım emirler gelecektir. Siz onları tanıyacak ve tepki göstereceksiniz. Onların yaptıklarından hoşlanmayan günahtan uzak olacak, onlara tepki koyan kurtulacaktır, fakat günah, yaptıklarına razı olup, arkalarından gidenedir.\" Orada bulunanlar \"Onlarla çarpışalım mı?\" diye sorunca, Resulullah Sallallahu Aleyhi ve Sellem \"Namaz kıldıkları sürece hayır!\" buyurdu. (Müs!im, imara) İsmam'nin Müsned'inde Ebu Müslim el-Havlanl'nin, Ebu Ubeyde b. elCerrah vasıtasıyla Hz. Ömer' den nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle anlatmıştır: \"Cebrail bana geldi ve 'Senin ümmetin senden sonra fitneye düşecek' dedi. Ben de 'Nereden?' diye sordum. Cebrail 'Emirleri ve alimlerinden fitneye düşecekler. Emirler insanların haklarını vermeyecek. Onlar da haklarını isteyecek ve fitneye düşecekler. Alimler bu emirlere uyacak ve fitneye düşecekler' dedi. Ben 'Bunların elinden kurtulan nasıl kurtulacak?' diye sordum. Cebrail 'El çekip sabretmekle. Haklarını kendilerine verdiklerinde alırlar, vermezlerse bırakırlar' dedi.\" \"..........\" yani kim sultan (ın otoritesin) den dışarı çıkarsa. Ikinci rivayette ise \"\\ J.;lj .:r=kim cemaatten ayrılırsa\" denilmektedir. Bu, sultana isyan edip, onunla çarpışmanın kinayeli anlatımıdır. İbn Ebi Cemre şöyle der: Hadisteki \"mufarakat\"tan maksat, en hafifinden bile olsa emirin elde ettiği bey' at akdini çözmeye çalışmak demektir. Bu en düşük derece hadiste \"bir karış miktarı\" olarak ifade edilmiştir. Çünkü bu yola başvurmak haksız yere kan dökme ile sonuçlanır. \"........ = cahiliye ölümü ile ölür.\" \"Cahiliye ölümü\" tabirinden maksat, cahiliye insanlarının sapıklık üzere ölmeleri gibi bir ölümle ölüm demektir ki cahiliye insanının itaat ettiği bir lideri yoktu. Çünkü onlar bunu bilmiyordu. Söz konusu niteleme, o kimse katir olarak ölür anlamına değildir. Tam tersine o kişi, asi olarak ölür demektir. Bu benzetmenin zahiri üzere olması da muhtemeldir. Buna göre manası o kişi, cahiliyeye mensup olmasa bile cahiliye insanının ölümü gibi ölür demek olur ya da benzetme ecir ve kaçındırma yerinde gelmiş olup, zahiri kastedilmemiş olabilir. İfadede \"cahiliye\" kelimesinden maksadın benzetme olduğunu bir başka hadisteki \"Her kim (İslam) camiasından bir karış ayrılırsa sanki İslam'ın ilmiğini boynundan çıkarmış gibidir\" ifadesi teyid etmektedir. (Tirmizi, Edeb; İbn Huzeyme, Sahih, III, 195; İbn Hibban, Sahih, XIV, 124) İbn Battal şu açıklamayı yapar: Hadis zalim bile olsa sultana isyan etmemek gerektiğine delildir. Fıkıh bilginleri zorba sultana itaat edip, onunla birlikte cihada gitmenin vacip olduğu ve ona itaatin -kan akmayı önlediği ve felaketi durdurduğu için- kendisine isyandan daha hayırlı olduğu noktasında görüş birliği etmişlerdir. Bilginlerin delilleri bu haber ve buna destek olan başka rivayetlerdir. Fıkıh bilginleri sultanın açıkça küfre girme durumu hariç bu konuda herhangi bir istisnadan söz etmemişlerdir. Sultanın açıkça küfre düşmesi durumunda ona itaat etmek caiz değildir. Aksine bundan sonraki hadiste geldiği üzere gücü yeten in onunla mücadele etmesi gerekir. \".........\" yani bizim aktif olduğumuz zamanlarda ve bize emredilene göre amel etmekten aciz olduğumuz durumlarda demektir. İbnü't-Tin'in nakline göre Davudi bundan maksadın hoşlanmadıkları şeyler olduğunu söylemiştir. İbnü't-Tin şöyle der: Zahir olanı sözün \"\" ifadesine uygun düşmesi için isyan etme noktasında tembelolduğumuz anlarda ve meşakkat zamanlarımızda demektir. \"..........=başkalarının bize tercih edildiğini.\" Bundan maksat, onların başlarına geçen kimseye olan itaatleri, haklarının kendilerine verilmesine bağlı olmadığını, aksine o kişinin haklarını vermese bile ona itaat etmekle yükümlü olduklarını vurgulamaktır. \"Ve en la nünazia'l-emre ehlehQ\" yani iktidar ve emirlik konusunu sahipleriyle çekişmemek üzere. \"İlla en terav küfren bevahan=ancak emirin açık bir küfrünü görürseniz ... \" Hattabi \"bevahan\" kelimesinin açık ve seçik anlamına geldiğini söylemiştir. \"İndekum minaılahi fihi burhanun=onun küfrü hakkında yanınızda Allah'tan kuwetli bir delil bulunması hali müstesnadır.\" \"Burhan\" kelimesinden maksat, bir ayet veya tevile ihtimali olmayan sahih bir haberdir. Bunun gereği, emirlerin hareketleri tevile muhtemelolduğu sürece kendilerine isyan etmenin caiz olmadığıdır. Nevevi şöyle demiştir: Burada geçen \"küfür\" kelimesinden maksat, masiyet, gün?htır. Hadisin manası şudur: İdarecilerle görevleri konusunda çekişmeyiniz, onlara karşı gelmeyiniz. Ancak kendilerinden İslam'ın kaidelerine göre kesin olarak münker olduğunu gördüğünüz bir şeyolursa bu müstesnadır. Böyle bir münkeri gördüğünüzde onlara tepki gösteriniz ve nerede olursanız olun hakkı söyleyiniz. Bir başkası şöyle demiştir: Hadiste geçen ''.........'' kelimesinden maksat, günah ve küfürdür. Dolayısıyla bir sultana açık bir küfre düşmediği sürece karşı gelinemez. Anlaşılan odur ki küfür rivayeti, çekişmenin iktidar konusunda olduğu durumlarla yorumlandığı takdirde kişi, açık bir küfre düşmediği sürece sultanla, idaresini zedeleyecek bir şeyle çekişemez. \"Masiyet\" rivayeti çekişme yönetim dışında başka bir hususta olduğu takdirde diye yorumlandığında ise kişi yönetime tenkit yöneltmediğinde idareciyle günah konusunda çekişebilir. Onun yaptığına yumuşaklıkla tepki gösterir ve şiddete başvurmaksızın hakkı ispat etme yoluna gidebilir. Bunun yeri kişi kötülüğü önleme gücüne sahip olduğundadır. Doğruyu en iyi Yüce Allah bilir. İbnü't-Tin'in nakline göre Davudi şöyle demiştir: Alimlerin zalim sultanlar hakkındaki kanaatleri şudur: Kişi fitneye ve zulme düşmeksizin onu görevden alma gücüne sahipse bunu yapması vaciptir. Aksi takdirde sabredip, dayanması vacip olur. Bazıları şöyle demiştir: Fasıkla ilk baştan velayet akdi yapmak caiz değildir. Bir kimse adil iken, daha sonra zulüm işlerse ona isyan etmenin caiz olup olmadığı noktasında ihtilar etmişlerdir. Sahih olanı, küfre girmedikçe bunun caiz olmadığıdır. Sultan küfre girdiğinde ona isyan etmek vacip olur",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 7058,
			"arabicnumber": 7058,
			"text": "Amr b. Said'in dedesi şöyle anlatmıştır: Medine'de Nebi Sallallahu Aleyhi ve Sellem mescidinde Ebu Hureyre ile birlikte oturuyordum. Yanımızda Mervan b. Hakem de vardı. Ebu Hureyre ben doğru sözlü olan ve doğruluğu tasdik edilen Resulullah Sallallahu Aleyhi ve Sellem'den \"Ümmetin helaki Kureyş'ten birkaç gencin elleriyle olacaktır\" buyururken işittim dedi. Mervan \"Allah'ın laneti o gençlerin üzerine olsun!\" deyince EbU Hureyre \"Bunlar filan Qğulları ve filan oğulları diye isimlerini söylemek isteseydim, muhakkak söylerdim\" dedi. Fethu'l-Bari Açıklaması: \".........=Ebu Hureyre ile birlikte oturuyordum.\" Sözkonusu oturma, Muaviye zamanında olmuştur. '.........=Yanımızda Mervan b. elHakem de vard!.\" Adı geçen Mervan, Mervan b. el-Hakem b. Ebü'ı-As b. Umeyye olup, bundan sonra halife olmuştu. Muaviye'nin Medine valiliğine bazen bu Mervan gelirken, bazen de Amr'ın babası Said b. eı-As gelmişti. \"............\" Doğru sözlü ve doğruluğu tasdik olunandan maksat, Hz. Nebi s.a.v.'dir. '........=Ümmetimin helaki.\" Bu ifadede geçen \"ümmet\" kelimesinden maksat, kıyamete kadar ümmetin tamamı değil, o asırla ona yakın zamanda yaşayanlardır. İbn Battal şöyle demiştir: \"Helak\" kelimesinden maksat, Ebu Hureyre'nin bir başka hadisinde açıkça ifade edilmektedir. Bu hadisi Ali b. Ma'bed, İbn Ebi Şeybe bir başka yolla Ebu Hureyre'den şu şekilde nakletmişlerdir: Nebi s.a.v. \"Çocuklann emirliğinden Allah'a sığınırIm\" deyince orada bulunanlar \"Çocukların emirliği ne demektir?\" diye sordular. Nebi s.a.v. şöyle cevap verdi: \"Onlara itaat ettiğiniz takdirde dininiz konusunda helak olursunuz, karşı geldiğinizde onlar sizi helak ederler.\" Yani dünyanız konusunda cana kıyarak, mala zarar vererek veya her ikisine birden zarar vermek suretiyle sizi helak ederler. İbn Ebi Şeybe'nin rivayetine göre Ebu Hureyre yolda yürürken şöyle diyordu: \"Ya Rabbi! Beni altmışıncı yıla çıkarma ve çocukların emirliğini bana gösterme.\" Bu ifade çocukların ilk defa emir olacakları tarihin altmış yılı olduğuna işaret etmektedir. Nitekim gerçekten de böyle olmuştur. Zira Yezid b. Muaviye o sene halife olmuş ve 64 yılına kadar halifelikte kalmıştı. Sonra öldü ve yerine oğlu Muaviye geçti. O da birkaç ay sonra öldü. Bu rivayet Ebu Zür'a'nın Ebu Hureyre'den \"İnsanlan Kureyş'ten bu mahalle helak edecektir\" şeklinde Nebilik alametleri konusunda geçen rivayeti tahsis etmektedir. Bundan maksat Kureyş'in tamamı değil, içlerinden bir kısmını teşkil eden gençlerdir. Hadisin ifade etmek istediği, onların iktidar talep etmeleri ve bu uğurda savaşmaları dolayısıyla insanları helak edecekleri, onların durumlarının bozulacağı ve ardarda gelen fitneler nedeniyle birçok kimsenin bundan zarar göreceğidir. Nitekim aynen Nebi s.a.v.'in haber verdiği gibi olmuştur. \"İnsanlar onlardan uzak dursalardı\" cümlesinin hüküm cümlesi mahzuftur. Şöyle takdir edilebilir: \"İnsanlar onlardan uzak dursalardı bu kendileri için daha iyi olurdu.\" İnsanların uzak durmasından maksat, onların arasına dahil olmama, kendileriyle birlikte çarpışmama ve dinleri uğruna fitnelerden kaçınmadır. Bu hadisten içinde günahın açıktan işlendiği bir beldeden uzak durmanın müstehap olduğu hükmü anlaşılmaktadır. Çünkü bu, birçok fitnenin baş göstermesine sebeptir ki genel helak bundan kaynaklanır. İbn Vehb'in nakline göre İmam Malik şöyle demiştir: Münkerin açıkça işlendiği bir yer terkedilir. Seleften bir grup insan böyle yapmıştır. İbn Battal şu açıklamayı yapar: Bu hadis ayrıca zalim bile olsa sultana karşı ayaklanmama şeklinde geçen hükme delildir. Çünkü Nebi Sallallahu Aleyhi ve Sellem Ebu Hureyre'ye sözkonusu kimselerin kendilerinin ve babalarının isimlerini bildirmiş ve ümmetin helaki onların elleriyle olacağını bildirdiği halde onlara karşı isyan etmelerini emretmemiştir. Çünkü onlara karşı gelmek, onlara itaate oranla daha beter bir helak olma sebebi ve toptan yok olmaya daha yakın bir nedendir. Dolayısıyla Nebi Sallallahu Aleyhi ve Sellem iki fesaddan daha hafif, iki durumdan daha kolayalanını tercih etmiştir",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 7059,
			"arabicnumber": 7059,
			"text": "Zeynep binti Cahş şöyle demiştir: Nebi Sallallahu Aleyhi ve Sellem uykudan yüzü kıpkırmızı olarak uyandı ve şöyle dedi: \"Vukuu yaklaşan kötülükten vay Arapların haline! Bugün Ye'cüc ve Me'cüc seddinden şunun gibi bir delik açıldı!\" Süfyan b. Uyeyne parmaklarıyla doksan veya yüz işareti yaptı. Nebi Sallallahu Aleyhi ve Sellem' e \"İçimizde bu kadar salih kimseler varken biz helak olur muyuz?\" denildi. Resulullah Sallallahu Aleyhi ve Sellem \"Evet, fısk u fücur çoğaldığı zaman (helak olursunuz)\" buyurdu",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 7060,
			"arabicnumber": 7060,
			"text": "Urve'nin nakline göre Usame b. Zeyd şöyle anlatmıştır: Nebi Sallallahu Aleyhi ve Sellem yüksek bir yerden Medine evleri arasından yükselen köşklere baktı da \"Benim gördüklerimi sizler de görebiliyor musunuz?\" buyurdu. Sahabiler \"Hayır\" dediler. Resulullah Sallallahu Aleyhi ve Sellem \"Şüphesiz ben fitnelerin evlerinizin arasına yağmur damlası gibi döküldüğünü görüyorum\" buyurdu. Fethu'l-Bari Açıklaması: \"Yaklaşan bir kötülükten dolayı vay Arapların haline!\" Nebi Sallallahu Aleyhi ve Sellem'in burada özellikle Arapları zikretmesi İslam'a ilk girenlerin onlar olması ve bir de fitneler baş gösterdi mi helakin büyük bir hızla onlara geleceğine uyarıda bulunmak içindir. \"Utum\" kale demektir. \"..........\" ifadesindeki \"hilal\" ara, açıklık demektir. \".......\" el-Müstemlı ve el-Küşmıhenı rivayetine göre bu kelime ........=yağmur\" şeklindedir. Bu rivayet hakkında Hac bölümünün son kısmında açıklamada bulunmuştuk. Medine'nin bu şekilde nitelenmesinin sebebi, Hz. Osman'ın burada katlediimiş olması ve fitnelerin etrafa bundan sonra yayılmış bulunmasındandır. Cemel ve Sıffin savaşları Hz. Osman'ın katledilmesi üzerine çıkmıştı. Nehrevan' da çıkan çarpışma, Sıffın' da hakeme gidilmesi nedeniyle olmuştu. O asırda meydana gelen bütün çarpışmalar ya bu olayla ilgili bir şeyden veya ondan kaynaklanan başka bir sebepten meydana gelmiştir. Öte yandan Hz. Osman'ın katlinin sebeplerinin en başta geleni valilerine yapılan tenkit, sonra da onları göreve getirdiği için kendisine yönelen eleştiridir. Bu ilk defa Irak'tan kaynaklandı. Irak doğu tarafındadır. Netice olarak bu bölümde yer verilen hadisle \"Fitne doğu tarafından gelecektir\" şeklinde ileride gelecek olan hadis arasında herhangi bir çelişki yoktur. İbn Battal şöyle der: Nebi Sallallahu Aleyhi ve Sellem, Zeynep hadisinde insanlar kıyamet üzerlerine kopmadan önce tövbe edebilsinler diye onun yaklaştığı uyarısında bulunmaktadır. \"Ye'cüc ve Me'cüc'ün kıyametten önce çıkacağı sabittir. Ye'cüc ve Me'cüc seddinden Nebi Sallallahu Aleyhi ve Sellem'in zamanında o kadar bir delik açıldığına göre bu delik zaman geçtikçe genişlemeye devam edecektir. Ebu Hureyre'nin naklettiği bir hadiste Resulullah Sallallahu Aleyhi ve Sellem \"Yaklaşan kötülükten vay Arapların haline! Gücünüz yetiyorsa ölünüz\" buyurmuştur. İbn Battal bu hadisi şöyle yorumlamıştır: Hadisin ifadesi, gelecek fitne ve ona daIma konusunda büyük bir uyarıdır. Çünkü Resulullah Sallallahu Aleyhi ve Sellem ölümü, o fitneye dalmaktan daha hayırlı görmüştür. Nebi s.a.v., Üsame hadisinde Medineliler hazır olup, içine dalmasınıar, Allah'tan sabır ve kötülüğünden kurtuluş dilesinler diye fitnelerin evlerin arasından çıkacağını haber vermiştir",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 7061,
			"arabicnumber": 7061,
			"text": "Ebu Hureyre'nin nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle haber vermiştir: \"(Kıyametin yaklaşma alametleri şunlardır:) Zamanın yaklaşması, amelin eksilmesi, kalplere cimrilik yerleştirilmesi, fitnelerin ortaya çıkması ve herc'in çoğalmas!.\" Sahabiler \"Ya Resulallah! O herc nedir?\" diye sordular. Resulullah Sallallahu Aleyhi ve Sellem \"Öldürme, öldürme!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 7063,
			"arabicnumber": 7063,
			"text": "",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 7064,
			"arabicnumber": 7064,
			"text": "Ebu Musa'nın nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Kıyametin önünde öyle günler vardır ki o günlerde ilim kaldırılır, yeryüzüne cahil/ik iner ve orada herc çoğalır. Herc, öldürmedir",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 7065,
			"arabicnumber": 7065,
			"text": "Ebu Vail şöyle anlatmıştır: Ben Abdullah b. Mesud ve Ebu Musa ile birlikte oturuyordum. Ebu Musa \"Ben Nebi Sallallahu Aleyhi ve Sellem'den bundan önceki hadisin benzerini işittim. Herc, Habeş dilinde 'öldürme' anlamına gelir\" dedi",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 7066,
			"arabicnumber": 7066,
			"text": "Ebu Vail Abdullah'ın -zannediyorum Nebi Sallallahu Aleyhi ve Sellem söyledi diyerek- naklettiği şu habere yer verdi: \"Kıyametin kopmasından önce herc günleri vardır ki o günlerde ilim zail olur. Cehalet meydana gelir.\" Ebu Musa \"herc\" Habeş dilinde \"öldürme\" anlamına gelir, dedi",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 7067,
			"arabicnumber": 7067,
			"text": "Ebu Musa el-Eş'arı r.a.'in Abdullah b. Mesud'a \"Sen Nebi Sallallahu Aleyhi ve Sellem'in zikretmiş olduğu kıyametten önceki o herc günlerini biliyorsun\" deyip, bundan önceki hadis tarzında bir rivayette bulunmuştur. İbn Mesud ben Nebi Sallallahu Aleyhi ve Sellem'in \"Kendileri hayatta bulunurken kıyametin koptuğu zamana erişen kimseler insan/ann en şerlilerindendir\" buyururken işittim demiştir. Fethu'l-Bari Açıklaması: \"Herc çoğalır.\" Sahabiler 'Ya Resulallah o herc nedir?' diye sordular.\" Hadisteki \"eyyüma hüve\" tabiri \"eyyü şey'in hüve=nedir o?\"anlamına gelir. Anbese b. Halid'in Ebu Davud'dan, Yunus'tan naklettiği rivayete göre Nebi Sallallahu Aleyhi ve Sellem'e, Ya Resulallah \"........\" diye sorulmuş. Resulullah saııaııiihu aleyhi ve sellem de \"Öldürmedir, öldürmedir\" buyurmuştur. (Ebu Davud, fiten) İbn Battal şöyle demiştir: Bu hadiste \"zaman yaklaşır\" cümlesinden başka açıklamaya muhtaç bir nokta yoktur. Yüce Allah daha iyi bilir ya \"zamanın yaklaşması\" zamanda yaşayan insanların dindarlıklarının azlığı bakımından birbirlerine yaklaşması demektir. Dindarlık o kadar azalacaktır ki fıskın galebe çalmasından ve fasıkların ortaya çıkmasından dolayı insanların arasında iyiliği emreden ve kötülüğü yasaklayan kimse kalmayacaktır. Bir hadiste \"İnsanlar birbirlerinden farklı oldukları sürece hayır içinde olmaya devam edeceklerdir. Birbirlerine eşit hale geldiklerinde helak olacaklardır\" buyurulmuştur. Bu şu demektir: İnsanlar sıkıntı esnasında kendilerine sığınılan, görüşlerinden yarar umulan, duaları ile teberrük edilen, irşadları alınıp, izlerinden gidilen fazilet ehli, salih ve Allah'tan korkan kimseler bulunduğu sürece hayır içinde olacaklardır. Tahavı şöyle der: Bu hadisin manası özellikle ilim öğrenmeyi terk edip, cehalete rıza göstermek olabilir. Sebebine gelince, insanlar ilimde birbirlerine eşit olmazlar. Zira ilmin dereceleri birbirinden farklıdır. Nitekim Yüce Allah \"Zira her ilim sahibinin üstünde daha iyi bilen birisi vardır\" buyurmuştur.(Yusuf 76) İnsanlar ancak cahil olduklarında birbirlerine eşit olurlar. Nebi s.a.v. adeta alimlerin yok olmasıyla ilmin ortadan kalkması açısından cehaletin hakim olup, çoğalacağını haber vermektedir. İbn Battal şöyle der: Bu hadisin ihtiva ettiği kıyamet alametlerinin tümünü ayan beyan görmüş bulunuyoruz. Gerçekten ilim eksilmiş, cehalet baş göstermiş, kalplere cimrilik atılmış, fitneler her yanı sarmış ve adam öldürmeler çoğalmıştır. Biz de şunu ekleyelim: Öyle anlaşılıyor ki İbn Battal'ın gördüğü mukabili var olmakla birlikte çokluktur. Hadisten maksat ise Nebi s.a.v.'in saydığı alametlerin toplumda iyice kök salmasıdır. O derece ki nadir olanları hariç, bunların zıttı olan iyi şeylerden o toplumda eser kalmaz. \"İlmin alınması\" ifadesiyle buna işaret edilmektedir. Zira ilim alınınca ortada sırf cehalet kalır. İlim ehli bir zümrenin var olması bununla çelişmez. Çünkü onlar o günlerde cahil tabakanın içerisinde kaybolup gideceklerdir. Bu yaklaşımı İbn Mace'nin güçlü bir isnadla Huzeyfe'den naklettiği şu hadis teyid etmektedir: \"Kumaşın desenleri yok olduğu gibi İslam silinecektir. Hatta oruç, namaz, hac ibadeti, sadaka nedir bilinmeyecektir. Bir gecede Kur'an yeryüzünden alınacak ve orada Kur'an'dan bir ayet bile kalmayacaktır. \"(İbn Mace, Fiten) Fiten bölümünün sonlarında bu konuda daha fazla açıklama yapacağız. Taberani'nin nakline göre Abdullah b. Mesud şöyle demiştir: \"Kur'an sizin önünüzden çekilip alınacaktır. Bir gece götürülecektir ve o insanların hafızalarından silinecektir. Yeryüzünde Kur'an'dan hiçbir eser kalmayacaktır.\"(Taberani, el-Mu'cemü'l-kebir, iX, 141) Bu rivayet in senedi sahihtir, fakat bu İbn Mesud'un sözü olarak mevkuftur. İleride Ahkam bölümünde bu söze açıktan aykırı olan rivayet beyan edilip, ikisi birbiriyle cem ve telif edilecektir. K.ıyametin diğer alametleri hakkında da aynı şeyleri söylemek mümkündür. Bundan sonra İbn Battal, Hattabl' den diğer hadiste zikredilen \"zamanın yaklaşması\" tabirinin ne manaya geldiğine dair nakilde bulunur. Sözünü ettiğimiz hadis, Tirmizi'nin Enes'ten, Ahmed b.Hanbel'in Ebu Hureyre'den naklettiği şu rivayettir: \"Zaman yaklaşmadıkça. kıyamet kopmaz. Zaman yaklaşınca sene ay gibi, ay hafta gibi, hafta bir gün gibi, bir gün bir an gibi, bir an yapraksız hurma dalının yanması gibi olacaktır. \"(Tirmizi, Zühd; Ahmed b. Hanbel, II, 537) Hattabı şöyle der: \"Zamanın yaklaşması\"ndan maksat, hayattan tat almadır. Yüce Allah daha iyi bilir ya Resulallah şunu demek istiyor: Mehdi çıktığında ve yeryüzünde güven oluşup, adalet hakim olduğunda yaşamaktan zevk alınacak ve o süre insanlar tarafından kısa görülecektir. İnsanlar uzun bile olsa rahatlık ve refah içinde geçen günleri kısa görürken, sıkıntı günlerini kısa bile olsa uzun görürler. Nevevı, Kadı lyaz ve başkasına paralelolarak şöyle der: Zamanın kısalığından maksat bereketin olmamasıdır. Mesela bir günden yararlanma, bir saatten yararlanma kadar olur. Bilginler şöyle demişlerdir: Bu yaklaşım daha doğru, daha faydalı ve hadisin kalan kısmıyla daha uyumludur. İbn Ebi Cemre şöyle der: \"Zamanın yaklaşması\"ndan maksat \"Kıyamet, bir yıl, bir ay gibi olmadıkça kopmayacaktır\" hadisine uygun olarak zamanın kısalığı olabilir. Buna göre kısalık, manevi olabileceği gibi, maddi de olabilir. Manevi kısalık, henüz zuhur etmemiştir. Her halde bu kıyametin kopmasından hemen önce görülecek alametlerden olsa gerektir. Manevi kısalığa gelince, bunun zuhur ettiği andan itibaren bir süresi vardır. Bunu din alimleri bilirler. Dünyevi sebeplerden anlayan kıvrak zekalı insanlara gelince, onlar kendilerini yararlar. Ancak din alimlerinin bundan önce yaptıklarını yapmayı başaramazlar. Bundan şikayet ederler ve sakatlığın nerede olduğunu bilmezler. Herhalde bunun sebebi birçok açıdan dine muhalif şeylerin ortaya çıkması dolayısıyla imanda meydana gelen zaaftır. Bunun en ağırı yiyecek, içecek maddelerindedir. Bu maddelerin içinde sırf haram olan olduğu gibi, -açıkça görüldüğü üzere- şüpheli olanlar vardır. Hatta birçok kimse bu konuda herhangi bir bilgiye sahip değildir. Eline ne miktarda bir şey geçirirse ona hücum eder ve haramlığına hiç aldırmaz. Gerçek şu ki zamanda, rızıkta ve bitkide bereket, ancak iman kuweti, emirlere uyma ve yasaklardan kaçınma ile meydana gelir. Bunun delili Yüce Allah'ın \"O ülkelerin halkı, inansalar ve (günahtan) sakınsalardı, elbette onların üstüne gökten ve yerden nice bereket kapıları açardık fakat yalanladılar. Biz de ettikleri yüzünden onları yakalaYlVerdik\"(Araf 96) ayetidir. İbn Battal'ın hadisin kalan kısmının açıklamaya ihtiyacı olmadığına dair ifadesi bizce isabetli değildir. Bilginler ayrıca \"ilmin eksilmesi\" ifadesinin ne anlama geldiği noktasında da ihtilaf etmişlerdir. Bazıları \"ilmin eksilmesi\"nden maksat, mesela okuduklarını unutan her alimdir derken, başka bazıları bundan maksat, alimlerin ölmesidir demişlerdir. Bunlara göre bir beldede her alim öldükçe, yerine başka biri geçmediği sürece orada ilim azalır. \"Amelin eksik olması\" fert fert herkes için sözkonusu olabilir. Zira alim birtakım problemler ve tersliklerle karşılaştığında zikirlerini ve ibadetini yerine getirme fırsatı bulamaz. ''Amelin eksilmesi\" ile emanetlerde ve yapılan işlerde hıyanetin baş göstermesi de kastedilebilir. İbn Ebi Cemre şöyle demiştir: \"Kaıplere cimrilik yerleştirilmesi\" farklı insanların kalplerine onun yerleştirilmesi anlamına gelir. Hatta alim ilmiyle cimrilik edip, insanlara öğretmeyi ve fetva vermeyi bırakır. Sanatkar sanatında cimrilik ederek başkalarına o mesleği öğretmez. Zengin malında cimrilik ederek fakirin açlıktan ölüp gitmesine sebep olur. \"Cimriliğin kalplere yerleştirilmesi\" ise, cimriliğin aslının yerleştirilmesi değildir. Çünkü o zaten mevcuttur. İbn Ebi Cemre şöyle devam eder: \"Cimriliğin kalplere yerleştirilmesi\" nin bütün kişilerde genelolma ihtimali vardır. Bunun sakındınlan çeşidi, mefsedete yol açanıdır. Dine göre cimri, vermesi vacip olan şeyi vermeyen kimsedir. Malı vermemek onu helak eder, bereketini giderir. \"Zekat vermekle mal eksilmez\" ifadesi bu anlayışı teyit etmektedir. Çünkü marifet ehli kimseler bundan şer'i hakkı verilen mala afet gelmeyeceği, tam tersine onun artacağı anlamını çıkarmışlardır. Bundan dolayı verilen sadakaya zekat denilmiştir. Zira mal zekat vermekle artar ve mala bereket gelir. Hadis metninde yer alan ''Abdullah'', İbn Mesud'dur. \"Sen Nebi Sallallahu Aleyhi ve Sellem'in zikretmiş olduğu kıyametten önceki o herc günlerini biliyorsun.\" Bununla yukarıda zikredilen hadisin benzeri olan \"Kıyametin kopmasından önce herc günleri vardır\" ifadesini kastetmektedir. Ahmed b. Hanbel'le, İbn Mace'de yer alan rivayete göre adamın biri \"Ya Resulallah! Biz bir yılda şu kadar müşrik öldürüyoruz\" deyince, Resulullah Sallallahu Aleyhi ve Sellem \"Maksat müşrikleri öldürmeniz değildir, fakat birbirinizi öldürmenizdir\" buyurmuştur.(İbn Mace, Fiten; Ahmed b. Hanbel, LV, 414) \"Kendileri hayatta bulunurken kıyametin koptuğu zamana erişen kimseler insanların en şerlilerindendir.\" İbn Battal şöyle der: Bu ifadenin lafzı her ne kadar genellik ise de maksat özel birtakım kimselerdir. Hadisin manası kıyametin çoğunlukla ve ağır basan bir ihtimalle kötülerin başına kopacağıdır. Bunun delili \"Ümmetimden bir zümre kıyamet kopuncaya kadar hak üzere olacaktır\" hadisidir. Bu haber kıyametin aynı zamanda faziletli kimselerin de başına kopacağına delildir. Biz de şunu ekleyelim: İbn Battal'ın dediği kesin değildir. Sözkonusu genelliği teyit eden ifadeler de vardır. Bunlardan birisi İbn Mesud'un rivayet ettiği şu hadistir: \"Kıyamet ancak insanların kötülerinin başına kopacaktır.\" Hadisi Müslim rivayet etmiştir.(Müslim, fiten) Müslim'in Ebu Hureyre'den de başka bir rivayeti daha vardır: \"Yüce Allah Yemen taraflarından ipekten daha yumuşak bir rüzgar gönderecektir. Bu rüzgar, kalbinde zerre kadar iman olan hiç kimseyi canlı bırakmayıp, ruhunu alacaktır.\"(Müslim, İman) Müslim'in; Deccal, İsa, Ye'cüc ve Me'cüc hakkında en-Nevvas b. Sem'an'dan naklettiği uzunca bir hadiste şu ifade yer almaktadır: \"Zira Yüce Allah hoş bir rüzgar gönderecek ve bu bütün mu'min ve Müslümanların ruhlannı alacak, kötü insanlar ise hayatta kalıp, insanlann gözleri önünde tıpkı eşekler gibi kadın erkek cinsel ilişkiye gireceklerdir. İşte kıyamet bunların başına kopacaktır.\" Yine Müslim' de yer alan bir rivayete göre Resulullah Sallallahu Aleyhi ve Sellem \"Kıyamet Allah, Allah diyen insanın başına kopmayacaktır\" buyurmuştur.(Müslim, İman) Bu rivayet Ahmed b. Hanbel'de \"Lfı ilfıhe il/allah diyen hiç kimsenin başına kopmayacaktır\" şeklindedir.(Ahmed b. Hanbel, III, 162) Bu hadisle \"Ümmetimden kıyamet kopana kadar hak üzere bir zümre bulunacaktır\" şeklindeki hadisi şu şekilde uzlaştırmak mümkündür: Bu hadisteki \" ... e kadar\" şeklindeki zaman, her mu'min ve Müslümanın ruhunu alacak olan hoş rüzgarın eseceği vakte kadar geçerlidir. O andan itibaren ancak kötüler hayatta kalacaktır ve kıyamet biraz sonra açıklaması geleceği üzere ansızın onların başına kopacaktır",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 7068,
			"arabicnumber": 7068,
			"text": "Zübeyr b. Adiy şöyle anlatmıştır: Enes b. Malik r.a.'e gelip, hacıların Haccac'dan gördüğü zulümden şikayette bulunduk. Bize \"Sabrediniz! Çünkü bundan sonra gelecek zamanın bir sonrası bundan daha kötü olacaktır ve bu Rabbinize kavuşuncaya kadar böyle sürüp gidecektir. Ben bunu Nebiinizden işittim\" dedi",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 7069,
			"arabicnumber": 7069,
			"text": "Hind binti el-Haris el-Firasiyye'nin nakline göre Nebi Sallallahu Aleyhi ve Sellem'in eşi Ümmü Seleme şöyle anlatmıştır: Bir gece Resulullah Sallallahu Aleyhi ve Sellem dehşetle uyandı. Şöyle diyordu: \"Subhanallah! Allah bu gece ne hazineler indirdi! Ve ne fitneler indirdi! Namaz kılmaları için hücrelerdeki hanımları -eşlerini- kim uyandırır? Dünyada nice giyinik kadınlar vardır ki ahirette çıplaktıdar.\" Fethu'l-Bari Açıklaması: Hadiste geçen Haccac, meşhur vali Haccac b. Yusuf es-Sakafl'dir. İnsanların Enes b. Malik'e gelip şikayet etmeleri, onun kendilerine yaptığı zulüm ve haddi aşmadır. ez-ZUbeyr Muvaffakiyat'ta MÜc2ıhid vasıtasıyla Şabl'nin şu sözüne yer verir: \"Hz. Ömer ve ondan sonra gelenler, bir isyankarı yakaladıklcmnda insanların karşısına dikerler, başından sarığını çıkarırlardı. Ziyad iktidara gelince, işlenen suçları kamçıyla vurarak cezalandırmaya başladı. Sonra Mus'ab b. ZUbeyr sakal kesme cezası ilave etti. Bişr b. Mervan vali olunca suç işleyen kimsenin avucuna çivi çaktı. Haccac vali olunca bunların tamamı oyundan ibarettir diyerek suçluyu kılıçla öldürdü. \"Nebiinizden işittim ... \" İbn Battal şöyle der: Bu haber, Nebilik alametlerindendir. Zira Resulullah Sallallahu Aleyhi ve Sellem durumun kötüye gideceğini haber vermiştir. Bu, akıl yürütülerek bilinecek gaybı bir haber değildir. Bu ancak vahiyle bilinir. Bazı zamanların geçmişinden daha az kötü olması dolayısıyla sözkonusu mutlak ifade problemli görülmüştür. Bu konuda hiçbir örnek olmasa Ömer b. Abdulaziz zamanı buna örnektir. Ömer b. Abdulaziz, Haccac'dan kısa bir süre sonra halife olmuştur. Ömer b. Abdülaziz'in zamanındaki iyilik meşhurdur. Onun zamanının, -bir öncesinden daha kötü olması şöyle dursun- bu zamanda kötülük yavaş yavaş silinip yok oldu dense, gerçeğe uzak bir söz söylenmiş olmaz. Hasan-ı Basrl, bir sonraki zamanın bir öncekinden daha kötü olmasını genellikle ve çoğunlukla şeklinde açıklamıştır. Kendisine Haccac' dan sonra Ömer b. Abdulaziz'in gelmesi sorulunca \"İnsanların rahatlaması şarttır\" demiştir. Bazıları \"üstünlük\"ten maksat, bir asrın tamamının, diğer asrın tamamına olan üstünlüğüdür diye cevap vermişlerdir. Çünkü Haccac'ın asrında birçok sahabe hayattaydı. Ömer b. Abdulaziz zamanında ise vefat etmişlerdi. Sahabenin yaşadığı zaman onlardan sonraki zamandan daha hayırlıdır. Çünkü Resulullah Sallallahu Aleyhi ve Sellem \"Asırlann en hayırlısı içinde bulunduğum asırdır\" buyurmuştur.(Müslim, Fedailu's-sahabe) Bu hadis, Buhari ve Müslim' de yer almaktadır. Bu konudaki bir başka hadis şöyledir: \"Sahabilerim ümmetimin güvencesidir. Onlar hayattan çekildiklerinde ümmetimin başına tehdit edilen gelir.\"(Müs!im, Fedailü'sahabe) Bundan sonra Abdullah b. Mesud'un hadisten maksadın ne olduğuna dair açık ifadesine rastladım. Bu, uyulmaya daha elverişlidir. Yakub b. Şeybe'nin elHaris b. Hasıra vasıtasıyla nakline göre Zeyd b. Vehb şöyle demiştir: Abdullah b. Mesud'un şeyle dediğini duydum: \"Kıyamet kopuncaya kadar üzerinize hiçbir gün gelmez ki bir sonrası ondan daha kötü olmasın. Hayatta elde edilen refahı veya istifade edilen malı kastetmiyorum. Fakat üzerinize hiçbir gün gelmeyecektir ki o ilim açısından geçen günden daha geride olmasın. Alimler hayattan çekilince, insanlar birbiriyle eşit hale gelecek, birbirlerine iyiliği emretmeyip, kötülüğü yasaklamayacaklardır. İşte o durumda helak olup gideceklerdir.\" \"Allah bu gece ne hazineler indirdi! Ve ne fitneler indirdi!\" \"Hazineler ve onunla zikredilen şeyler\" den maksadın ne olduğu İlim bölümünde daha önce geçmişti. \"Giyinik ve çıplak kadınlar\" kelimesinden maksadın ne olduğu konusunda ihtilaf edilmiştir. Bir görüşe göre bu kadınlar dünyada zengin olmaları dolayısıyla giyinik, dünyada amel etmemeleri dolayısıyla ahirette sevaptan arı olacaklardır. İkinci bir görüşe göre elbise ile giyiniktirler, fakat elbiseleri şeffaf olup, avret yerlerini örtmeyecektir. Dolayısıyla ahirette bunun karşılığı olarak çıplak kalmakla cezalandırılacaklardır. Bir üçüncü görüşe göre onlar Allah'ın nimetlerinden giyinik, semeresi ahirette sevapla ortaya çıkan şükürden çıplaktırlar. Dördüncü görüşe göre vücutları giyiniktir, fakat başörtülerini arkalarından örttüklerinden göğüsleri ortaya çıkar ve çıplak hale gelirler. Dolayısıyla ahirette bunun cezasını göreceklerdir. Beşinci görüşe göre bunlar salih bir erkekle evlenme elbisesi bakımından giyinik, ancak ahirette amelden çıplaktırlar. Kocalarının salih olması bunlara fayda vermez. Nitekim Yüce Allah bu konuda \"Sura üflendiği zaman artık aralarında akrabalık bağları kalmamıştır\" uyurmaktadır.(Mu'minun 101) Bu son açıklamayı TIbl yapmış ve bu konuya ve hadisin lafzına uygun düştüğü için tercih etmiştir. Hadis her ne kadar Nebi Sallallahu Aleyhi ve Sellem 'in eşleri hakkında varid olmuş ise de itibar sözün genelinedir. Bunun bir benzerini Davudı şöyle nakletmişti: \"Onlar dünyada şerefli kesimden oldukları için şeref elbisesini giyin ik ancak kıyamet günü çıplaktırlar.\" Hadis-i şerif, fitne baş gösterdiğinde onun ortadan kalkması veya dua edenle, dua ettiği kimsenin ondan salim olması için özellikle duaların kabul vakti olduğu umulan gece vakti Yüce Allah'a dua etme ve yakarma çağrısında bulunmaktadır",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 7070,
			"arabicnumber": 7070,
			"text": "Abdullah b. Ömer'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"Kim bize silah çekerse, bizden değildir\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 7071,
			"arabicnumber": 7071,
			"text": "Ebu Musa'nın nakline göre Resulullah Sallallahu Aleyhi ve Sellem: \"Kim bize silah çekerse, bizden değildir\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 7072,
			"arabicnumber": 7072,
			"text": "Ebu Hureyre'nin nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Sakın biriniz silahını din kardeşine doğrultmasın! Çünkü silahı doğrultan bilmez. Belki şeytan elini dürtüp de (din kardeşini vurur) ve bu sebeple cehennemden bir çukura yuvarlanır",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 7073,
			"arabicnumber": 7073,
			"text": "Cabir b. Abdullah şöyle demiştir: Bir adam, yanında okları olduğu halde mescidden geçti. Resulullah Sallallahu Aleyhi ve Sellem ona \"Temreninden tut!\"\" buyurdu. Adam \"peki\" dedi",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 7074,
			"arabicnumber": 7074,
			"text": "Cabir'in nakline göre adamın biri yanında temrenleri meydana çıkmış birçok ok olduğu halde mescidden geçti. Okların herhangi bir Müslümana dokunup da yaralamaması için temreninden tutması emrediidi",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 7075,
			"arabicnumber": 7075,
			"text": "Ebu Musa'nın nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Herhangi biriniz mescidimizden veya çarşımızdan yanında aklar varken geçecek olursa herhangi bir Müslümana bir zarar vermemek için onları temrenlerinden tutsun -veya- onu avucunun içine alsın.\" Fethu'l-Bari Açıklaması: \"Kim bize silah çekerse ... \" Hadisin manası şudur: Kim haksız yere çarpışmak için Müslümanlara silah çekerse bizden değildir. Çünkü bu onları korkutmak ve kalplerine korku vermek anlamına gelir. Nebi Sallallahu Aleyhi ve Sellem \"silah taşıma\" fiilini kinaye yoluyla çarpışma veya öldürme anlamında kullanmıştır. Çünkü genellikle silah taşımakla adam öldürmek ve çarpışmak birlikte bulunur. \"Fe leyse minna\" yani kim bize silah çekerse bizim yolumuzda değildir veya bizim yolumuza uyan kimse değildir. Çünkü bir Müslümanın diğer Müslüman üzerindeki hakkı, onunla çarpışmak veya katletmek için kendisine silah çekerek yüreğine korku salmak değil, ona yardım etmek ve uğruna çarpışmaktır. \"Bizi aldatan bizden değildir\",(Müs/im, \"İman) \"Yanaklara vurup, ya ka yırtan bizden değildir\"(Müs/im, \"İman) gibi hadisler, bu hadisin benzeridir. Bu, sözkonusu fiilleri helal saymayan kimseler hakkındadır. Çünkü kişi sırf silah taşımak suretiyle değil, şart cümlesinde haram kılınmış olan fiili helal saymak suretiyle kafir olur. Selef bilginlerinin çoğuna göre en uygun olanı -sakındırmada daha etkin olması için- teviline değinmeksizin haberin lafzını mutlak olarak almaktır. Süfyan b. Uyeyne bu haberi zahirindeki manadan çevirene tepki gösteriyor ve \"Hadisin manası bizim yolumuz üzere değildir\" diyordu. O zikrettiğimiz nedenlerden dolayı hadisi tevil etmemeyi daha uygun görüyordu. Hadiste zikredilen tehdit hak üzere olup, bağllerle çarpışanları kapsamamaktadır. Dolayısıyla bu bağılere ve haksız yere savaşmaya başlayanlara yöneliktir. \"Çünkü silahı doğrultan bilmez. Belki şeytan elini dürtüp de (din kardeşini vurur) ve bu sebeple cehennemden bir çukura yuvarlanır.\" Cümlenin anlamı şudur: Belki şeytan biri diğerini silahı ile vursun ve o kişiye darbesini gerçekleştirsin diye onları kışkırtır. \"Bu sebeple cehennemden bir çukura yuvarlanır.\" Bu ifade kişinin cehenneme girmesine yol açacak günaha düşmesinin kinayeli anlatımıdır. İbn Battal şöyle der: İfadenin manası şeytan böylece tehdidi onun üzerinde gerçekleştirir demektir. Hadis sakıncalı bir duruma yol açacak şeyi yasaklamaktadır. Sakınca durumu -ister ciddi olarak, ister şaka şeklinde olsun- kesin olmasa bile hüküm böyledir. \"Kad beda\" Hadiste geçen \"en-nusul\" \"en- nasl\" kelimesinin çoğulu olup, kelime \"nisal\" şeklinde çoğul yapılır. \"Nasıı> okun temreni demektir. \"Bir Müslümana bir zarar vermemek için.\" Bu cümle oku temreninden tutma emrinin gerekçesini teşkil etmektedir. Hadiste geçen \"hadş\" yaranın başlangıç kısmı demektir",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 7076,
			"arabicnumber": 7076,
			"text": "Şeki'k'in, Abdullah b. Mesud' dan nakline göre Resulullah Sallallahu Aleyhi ve Sellem: \"Müslümana sövmek fısk, onunla çarpışmak küfürdür\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 7077,
			"arabicnumber": 7077,
			"text": "İbn Ömer'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"Benden sonra birbirinizin boyunlarını vuran kdfirlere dönmeyiniz\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 7078,
			"arabicnumber": 7078,
			"text": "Ebu Bekre'nin ve bence Abdurrahman b. Ebi Bekre'den daha faziletli bir adamın nakli ile yine Ebu Bekre'nin -ifadesine göre Resulullah Sallallahu Aleyhi ve Sellem Mina'da insanlara bir konuşma yaptı ve \"Bu hangi gündür biliyor musunuz?\" diye sordu. Sahabiler \"Allah ve Resulü daha iyi bilir!\" dediler. Hatta biz Resulullah Sallallahu Aleyhi ve Sellem bu güne adından başka bir isim verecek sandık. Resulullah Sallallahu Aleyhi ve Sellem \"Bu, nahr günü değil midir?\" buyurdu. Biz \"Evet Ya Resulallah! Nahr günüdür!\" dedik. Resulullah Sallallahu Aleyhi ve Sellem \"Bu içinde bulunduğunuz hangi beldedir? Bu haram olan belde (Mekke beldesi) değil midir?\" buyurdu. Bizler \"Evet Ya Resulallah! Mekke'dir!\" dedik. Resulullah Sallallahu Aleyhi ve Sellem \"Şu halde (iyi biliniz ki) bu ayınızda ve bu beldenizde bu gününüzün haram olduğu gibi kanlarınız, mallarınız, namuslarınız ve derileriniz birbirinize haramdır. Dikkat edin! Bunu sizlere tebliğ ettim mi?\" diye sordu. Bizle \"Evet, tebliğ ettin!\" dedik. Resulullah Sallallahu Aleyhi ve Sellem \"Allah'ım şahit ol!\" dedikten sonra \"Bunu burada hazır bulunanlar, bulunmayanlara tebliğ etsin. Çünkü nice tebliğ edilen, bunu kendisine tebliğ edenden daha iyi belleyebilir\" buyurdu. Gerçekten de aynen böyle olmuştur. Resulullah Sallallahu Aleyhi ve Sellem \"Benden sonra birbirinizin boyunlarını vuran kafirlere dönmeyiniz!\" buyurdu. Cariye b. Kudame İbnü'l-Hadraml'yi yaktığı gün Cariye askerlerine \"Ebu Bekre'ye bakınız\" deyince, askerler \"İşte bu Ebu Bekre'dir. O seni görmekte ve yaptığına ses çıkarmamaktadır\" dediler. Abdurrahman şöyle devam etti: ''Annemin nakline göre Ebu Bekre eğer onlar evime girmiş olsalardı, bir kamış değneği ile bile olsa kendimi savunmaya kalkışmazdım.\" demiştir",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 7079,
			"arabicnumber": 7079,
			"text": "İbn Abbas'ın nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"Benden sonra dininizden dönüp de birbirinizin boyunlarını vuran kafirler olmayınız\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 7080,
			"arabicnumber": 7080,
			"text": "Cerir b. Abdillah el-Becell şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem veda haccında bana \"İnsanları sustur da dinlesinler\" diye emretti. İnsanlar sükut ettikten sonra \" Benden sonra birbirinin boyunlarını vuran kafirler olmayınız.\" buyurdu. Fethu'l-Bari Açıklaması: \"Müslümana sövmek.\" Bu hadisin bir sebeb-i vürudu vardır. Bunu Beğavı ve Tabedmı, Amr b. en-Numan b. Mukarrin el-Müzenı'den şöyle nakletmişlerdir: Resulullah Sallallahu Aleyhi ve Sellem Ensar meclislerinden birisine gitti. Ensardan birisi müstehcen şeylerle ve insanlara sövmekle meşhur olmuştu. Resulullah Sallallahu Aleyhi ve Sellem \"Müslümana sövmek fısk, onunla çarpışmak küfürdür\" buyurdu. Beğavi'nin rivayetinde \"O kişi vallahi hiç kimseye sövmeyeceğim\" demiştir. \"Kafirler.\" Bundan maksadın ne olduğu Diyat bölümünün baş taraflarında geçmişti. Bu konuda sekiz görüş zikredilir. Daha sonra bir dokuzuncu görüş daha gördüm. Buna göre maksat hakkı örtmektir. Sözlükte \"el-küfür\" örtmek anlamına gelir. Zira Müslümanın Müslüman üzerindeki hakkı ona yardım etmesi ve destek olmasıdır. Müslüman Müslümanla çarpışınca sanki onun kendi üzerinde sabit olan hakkını örtmüş gibi olmaktadır. Onuncusu ise sözkonusu mı küfre götürür demektir. Çünkü büyük günahlara dalmayı adet haline getiren kimseyi onun uğursuzluğu daha beterine götürür. Dolayısıyla o kimsenin Müslümanın akıbeti üzere ölmeyeceğinden korkulur. Askeri'nin ifadesine göre İbnü'l-Hadrami'nin adı Abdullah b. Amr b. elHadrami' dir. Babası Amr, Bedir günü müşrikler tarafından ilk şehit edilen kimsedir. Buna göre Abdullah Resulullah Sallallahu Aleyhi ve Sellem'ı görmüş olmaktadır. Bazıları onu sahabilerin arasında zikreder. el-İstiab da şöyle denir: Vakıdi'nin ifadesine göre o, Nebi Sallallahu Aleyhi ve Sellem'in döneminde dünyaya gelmiştir. Ömer'den rivayet edildiğine ve el-Medainı'nin kanaatine göre onun adı Abdullah b. Amir el-Hadrami'dir. Kendisi adı geçen Amr'ın oğludur. Meşhur sahabi el-Ala b. el-Hadramı onun amcasıdır. \"Cariye b. Kudame İbnü'l-Hadrami'yi, yani İbn Malik b. Zuheyr b. el-Husayn et-Teymı es-Sa' di'yi yaktığı gün ... \" Bunun sebebini eı-Askerı es-Sahabe' de zikreder. Buna göre Cariye \"muharrık=yakan\" şeklinde lakaplanmıştı. Çünkü o Basra'da İbnü'l-Hadrami'yi yakmıştı. Muaviye, İbnü'l-Hadrami'yi Basra halkını Hz. Ali'ye karşı çarpışmak üzere seferber etmesi için oraya göndermişti. Hz. Ali de Cariye b. Kudame'yi gönderdi ve Cariye onu kuşattı. İbnü'l-Hadramı bir eve sığınarak kendisini koruma altına aldı. Ancak Cariye evi onun başına yaktı. \"Ebu Bekre'ye bakınız.\" Yani yüksekçe bir yere çıkarak Ebu Bekre'ye baktılar ve onu gördüler. el-Bezzar \"O kendisine ait bir bahçede idi\" şeklinde bir ifade kullanmaktadır. \"İşte bu Ebu Bekre' dir. O seni görmekte ve yaptığına ses çıkarmamaktadır.\" Mühelleb şöyle der: Cariye İbnü'l-Hadrami'yi yakınca bazılarına Ebu Bekre'ye bakmalarım emretti. Onun kendisine karşı savaşçı mı, yoksa ona itaat halinde mi olduğunu öğrenmek istiyordu. Hayseme on,,! şöyle demişti: \"İşte Ebu Bekre seni ve İbnü'l-Hadramı'ye yaptığını görüyor. Belki de o silah çekerek veya sözle sana tepki gösterecektir.\" Ebu Bekre kendine ait yukarı odada iken bunu duydu ve \"Eğer onlar evime girmiş olsalardı, bir kamış değneği ile bile olsa kendimi savunmaya kalkışmazdım. Çünkü ben Müslümanlarla çarpışmayı doğru görmem. O halde nasılolur da silah la onlarla çarpışırım!\" dedi. \"Ma beheştü\" Bunun manası onlara karşı direnmezdim demektir. Arapça'da \"beheşe ba'du'l-kavmi ila ba'd\" denilir ki manası bir topluluk savaşmak için diğerine ateş etti demektir. Sanki o şöyle demiş olmaktadır: Onlar benim evime girseler, elimi bir kamış çubuğuna uzatmayacağım gibi kendimisavunmak için onu elime bile almazdım. Ebu Bekre'nin bu sözü Ahmed b. Hanbel'in fitne konusunda İbn Mesud'dan naklettiği şu hadisle uyuşmaktadır. İbn Mesud \"Ya Resulallah! O günlere kalırsam bana ne emredersiniz?\" diye sordum. Resulullah Sallallahu Aleyhi ve Sellem \"Elini ve dilini tut! Evine gir\" buyurdu. Ben \"Ya Resulallah! Peki adam ya evime girerse!\" dedim. Resulullah Sallallahu Aleyhi ve Sellem \"Evine gir!\" buyurdu. Ben \"Ya evime yanıma girerse?\" dedim. Resulullah Sallallahu Aleyhi ve Sellem \"Mescidine gir\" buyurduktan sonra sağ eliyle bileğimden tutarak \"Ölünceye kadar 'Rabbim Allah'tır' de\" buyurdu. Bu manada birçok hadis vardır",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 7081,
			"arabicnumber": 7081,
			"text": "Ebu Hureyre r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Yakın gelecekte birtakım fitneler çıkacaktır. Fitne zamanında (ona karışmayıp) oturan kişi, ayakta durandan daha hayırlıdır. Ayakta duran da, yürüyenden daha hayırlıdır. Bu yolda yürüyen ise bilfiil fesada çalışandan daha hayırlıdır. Fitneden sakınmayıp, kendini ona maruz bırakmak suretiyle gözünü ona dikecek olursa, muhakkak onun kahrına uğrar. Her kim ondan iltica edip, sığınacak bir yer bulursa hemen sığınsın",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 7082,
			"arabicnumber": 7082,
			"text": "Ebu Hureyre r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"İleride bir takım fitneler çıkacaktır. Fitne zamanlarında oturan kimse, ayakta durandan daha hayırlıdır. Ayakta duran da yürüyenden daha hayırlıdır. Yürüyen ise koşandan daha hayırlıdır. Fitneye göz diken onun kahnna uğrar. Her kim o zaman iltica edecek veya sığınacak bir yer bulursa hemen ona sığınsın. \" Fethu'l-Bari Açıklaması: \"Yürüyen ise koşandan daha hayırlıdır.\" Ebu Bekre'nin Müslim' de yer alan hadisi \"fitneye koşandan\" şeklindedir. Bu rivayette şöyle bir farklılık vardır: \"Dikkat edin! Fitne geldi mi develeri olan develerine sığınsın.\"(Müs/im, fiten) Hadisleri açıklayan alimlerden biri \"Fitne zamanlarında oturan kimse, ayakta durandan daha hayırlıdır\" ifadesini fitne zamanlarında fitneden el çeken şeklinde açıklamıştır. Bu alimin ifadesine göre \"... =ayakta duran\" kelimesinden maksat, gözünü kaldırıp, ona bakmayan, \".... el-maşi=yürüyen\"den maksat ise fitnenin dışında başka bir sebeple yürüyen demektir. Ancak bu zamanda yürüyen kişi bu hareketiyle hoşlanmadığı bir duruma düşebilir. İbnü't-Tin'in nakline göre Davudi şöyle demiştir: Doğru olanı bu ifadeden maksadın bütün durumlarda fitne ile direk ilişkisi olan kimse olduğudur. Yani bu kişilerin bazıları, diğerlerinden daha beter bir durumdadır. Bunların içinde en kötü olanı, fitne zamanı koşması, fitne doğmasına sebep alandır. Sonra fitne çıkmasına sebep olan kimse gelir ki bu da fitne zamanı yürüyendir. Ardından direk olarak fitneyi yapan kişi gelir ki bu, ayakta durandır. Bundan sonra fitneye bakan, ancak çarpışmayan kişi gelir ki bu da oturandır. Bunun ardından fitneden kaçan, onunla sıcak temasta bulunmayan ve ona bakmayan kimse gelir ki bu da uyanık bir halde yan üstü yatandır. Bunun ardından bunlardan hiçbirini yapmayan, fakat fitneye razı olup, uyuyan kimse gelir. Burada sözü edilen daha hayırlı olmak konusundaki üstünlük, yukarıdaki ayrıntı uyarınca kendisinden bir yukarıdakinden daha az kötü olandır. \".........\" yani fitneye girişerek, kendini ona maruz bırakarak, ona bakan ve yüz çevirmeyen demektir. \".......\" yani fitne dolayısıyla helake yaklaştığı için fitneonu helak eder. \"\"'E-\" fitnenin kötülüğünden sığınacak olduğu sığınak demektir. \".........\" fitnenin kötülüğünden kurtulmak için o esnada fitneden uzak kalmak amacıyla sığınak yeri. \".......\" fitnenin kötülüğünden kurtulmak için ondan uzak dursun. Bu hadis fitneden kaçındırmakta, fitneye girmekten kaçmaya çalışmayı teşvik etmektedir. Hadise göre fitnenin kötülüğü ona ilişkinin derecesine göre değişir. Fitneden maksat kim haklı, kim haksız bilinmeyecek şekilde mülkiyet talebi konusunda ihtilaftan kaynaklanan şey demektir. Taberi şöyle der: Selef bilginleri bu konuda ihtilaf etmişlerdir. Bazıları hadisi genelliği üzere almışlardır. Bunlar Müslümanlar arasında çıkan savaşa kesin olarak dahil olmayıp, geri dururlar. Sa'd, ibn Ömer, Muhammed b. Mesleme, Ebu Bekre buna örnektir. Adı geçen kişiler zikredilen hadisle diğer hadislerin zahirlerini esas almışlardır. Bunlar daha sonra ihtilafa düşmüşler, bir grup evlerde kalmanın gerekli olduğunu söylerken, diğer grup fitne çıkan beldeden başka yere göçmek gerekir demişlerdir. Bundan sonra yine ihtilaf etmişler, bir kısmı fitne kişinin üzerine üzerine geldiğinde öldürülmesi pahasına bundan elini çeker derken, bir başka grup kendisini, malını ve ailesini savunur. Bu uğurda öldürülse de, öldürse de mazurdur demişlerdir. Bir başka grup ise şu görüşü savunmuştur: Bir zümre devlet başkanına karşi isyan ederse, üzerine gerekli olan yükümlülükleri yapmaktan vazgeçip, savaş açarsa onunla çarpışmak gerekli olur. Aynı şekilde iki zümre birbiriyle çarpıştığında gücü yeten herkesin yanlış yapanın elinden tutması ve haklı olana yardım etmesi gerekir. Çoğunluğun görüşü bu doğrultudadır. Başka bir grup ise bu konuda ayrıntıya giderek şöyle demişlerdir: iki Müslüman grup birbiriyle savaşa tutuşursa, topluluğun devlet başkanı olmayacağı için bu durumda çarpışmak yasaktır. Bu konudaki hadisler ve başkaları bu manada yorumlanır. Evzal'nin görüşü budur. Taberi şöyle der: isabetli olanı şöyle söylemektir: Fitne kelimesi esasen deneme ve imtihan etme anlamına gelir. Bir münkere tepki göstermek buna gücü yeten herkese vaciptir. Haklı olana yardım eden isabet eder. Haksıza yardım eden hata eder. Kişi kimin haklı, kimin haksız olduğunu bilmiyorsa bu, savaşmanın yasak olduğu durumdur",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 7083,
			"arabicnumber": 7083,
			"text": "Hasan-ı Basri şöyle anlatmıştır: Fitne gecelerinde silahımla çıkmıştım. Derken Ebu Bekre karşıma çıktı ve bana \"Nereye gitmek istiyorsun?\" diye sordu. Ben de \"Resulullah Sallallahu Aleyhi ve Sellem'in amcası oğluna (Hz. Ali'ye) yardım etmek istiyorum\" dedim. Ebu Bekre şöyle dedi: Resulullah Sallallahu Aleyhi ve Sellem \"İki Müslüman kılıçlanyla birbirlerine yönelip, vuruştuklan zaman, ikisi de ateştedir\" buyurdu. Ona \"Öldüren böyledir ama ölen niye ateştedir?\" diye soruldu. Resulullah Sallallahu Aleyhi ve Sellem \"Ölen de arkadaşını öldürmek istemiştir\" buyurdu. Fethu'l-Bari Açıklaması: Hadiste geçen Hasan, Hasan-ı BasrI' dir. \"Fitne gecelerinde silahımla çıkmıştım.\" Burada yer alan \"fitne\" kelimesinden maksat, Hz. Ali ve taraftarlarıyla Aişe r.anha ve taraftarları arasında çıkan savaştır. Sahih'in baş taraflarında İman bölümünde bu hadisle ilgili gerekli açıklama yapılmışh. Bilginler şöyle derler: Her ikisinin de ateşte olması, onların bunu hak etmeleri anlamınadır. Fakat iki zümrenin durumu da Allah'a kalmıştır. Dilerse onları cezalandırır. Sonra diğer tevhid ehli kimseler gibi cehennemden çıkarır. Dilerse onları affeder ve hiç cezalandırmaz. Fitne zamanı savaşmanın caiz olmadığını söyleyenler bu haberi delilolarak almışlardır. Bunlar Sa'd b. Ebi Vakkas, Abdullah b. Ömer, Muhammed b. Mesleme, Ebu Bekre ve başkaları gibi Hz. Ali'nin yaptığı savaşta yanında çarpışmayı terk edenlerdir. Bu zümre şu görüşü savunmuştur: Herhangi bir kimse kendisini öldürmeye kalkışsa bile çarpışmadan geri durmak ve kendini savunmamak gerekir. Bunların içerisinden bazıları ise fitneye girmek caiz değildir. Bir kimse diğerini öldürmeye kalksa, o kişi ancak kendi nefsini müdafaa eder. Sahabe ve tabiunun çoğunluğu hakka yardım edip, meşru yöneticiye isyan edenlerle çarpışmak gerektiği görüşünü benimsemişlerdir. Ehl-i sünnet haklı olan bilinse bile sahabilerin karıştıkları savaştan dolayı hiçbirine dil uzatmanın caiz olmadığı nok tasında ittifak etmişlerdir. Çünkü onlar bu savaşlara ancak içtihat neticesinde katılmışlardır. Yüce Allah içtihatta hatalı olanı affetmiştir. Hatta ileride Ahkam bölümünde geleceği üzere içtihadında hata eden e bir, isabet edene iki ecir verilecektir. Bu bilginler hadiste sözü edilen tehdidin meşru bir tevile dayanmaksızın, aksine sırf hükümdarın talebi üzerine çarpışan kimselere yönelik olduğu şeklinde açıklanmıştır. Ebu Bekre'nin, el-Ahnef'i Hz. Ali'yle birlikte çarpışmaktan alıkoyması karşı delil olarak sunulamaz. Çünkü bu Ebu Bekre'nin bir içtihadı neticesinde olmuştur. Onun yaptığı içtihat, kendisi ve nasihat ettiği kimse için ihtiyaten savaştan kaçınma ve uzak durma şeklinde olmuştur. Taberi şöyle der: Müslümanlar arasında ortaya çıkan her türlü ihtilafta evlere çekilip, kılıçları kırmak suretiyle ondan kaçınmak vacip olsaydı, hiçbir had uygulanmaz ve hiçbir batıl boşa çıkarılmazdı ve fasıklar başkalarının mallarını almak, kanlarını akıtmak ve ailenin hanımlarını esir etmek suretiyle haram işlemeye fırsat bulurlardı. Bunu onlarla çarpıştıkları ve Müslümanların da \"Bu bir fitnedir. Bizim fitne zamanı çarpışmamız yasak edildi\" demek suretiyle ellerini çekmeleri sayesinde yapmış olurlardı. Oysa bu tavır, sefihlerin ellerine yapışma şeklindeki emre aykırı bir harekettir. Bezzar \"Katil de ve maktul de cehennemdedir\" hadisinde maksadın ne olduğunu ortaya koyacak şekilde farklı bir rivayette bulunmuştur: \"Dünyalık elde etmek için çarpışırsanız katil de, maktul de cehennemdedir.\" Müslim'in naklettiği şu hadis bunu teyid etmektedir: \"İnsanlar katil neden öldürdüğünü, maktul neden öldürüldüğünü bilmedikleri bir zamanla karşılaşmadıkça dünya hayatı sona ermeyecektir.\" Orada bulunanlar \"Bu nasılolacak?\" diye sordular. Resulullah Sallallahu Aleyhi ve Sellem \"Katı olacak, katil de maktul de cehennemdedir\" buyurdu.(Müslim, Fıten) Kurtubi şöyle der: Bu hadis \"Katil de, maktul de cehennemdedir\" hadisi ile kastedilenin çarpışmanın dünyalık elde etmek veya heva ve heves peşinde koşmak şeklinde cehalete dayanması durumunda sözkonusu olduğunu açıklamaktadır. Biz de şunu ekleyelim: Bundan dolayı Cemel ve Sıffın savaşlarında savaştan geri duranlar çarpışanlardan daha az olmuştur. Bunların tamamı bir tevile dayandıkları için inşallah ecir alacaklardır. Ebu Berze el-Eslemi'den yapılan rivayette geIeceği üzere onIardan sonra gelip, dünyalık peşinde koştuğu için çarpışanIar böyIe değillerdir. Bundan önceki açıkIamayı teyit eden rivayetIerden birisi Müslim'in Ebu Hureyre' den yaptığı şu nakildir: \"Her kim belli bir hizip adına kızarak veya onların yanında yer almaya çağırırak ya da onlara yardım ederek kör bir dauanın bayrağı altında çarpışıp, öldürülürse öldürülüşü cahiliyye öldürüıüşüdür. \"(Müslim, İmara)",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 7084,
			"arabicnumber": 7084,
			"text": "Huzeyfe b. el-Yeman anlatmıştır: İnsanlar Resulullah Sallallahu Aleyhi ve Sellem'e hayır hakkında soru soruyorlardı. Ben ise bana erişir diye korkumdan kötülüğü sorardım. Bir keresinde \"Ya Resulallah! Biz (vaktiyle) cahiliye döneminde ve kötülük içindeydik. Sonra Yüce Allah bize bu hayrı getirdi. Bu hayırdan sonra bir şer var mıdır?\" diye sordum. Resulullah Sallallahu Aleyhi ve Sellem: \"Evet, vardır!\" diye buyurdu. Ben \"O kötülük ve şerden sonra bir hayır var mıdır?\" dedim. Resulullah Sallallahu Aleyhi ve Sellem \"Evet, içinde kin ve fesat bulunan bir hayır olacaktır\" buyurdu. Ben \"Onun fesadı nedir?\" diye sordum. Resulullah Sallallahu Aleyhi ve Sellem \"O devirde gelecek bir zümre, benim sünnetim ve yolumun dışında bir yoldan gideceklerdir. Sen bazılarının hareketlerini tanıyacak ve tepki koyacaksın\" buyurdu. Ben \"Ya Resulallah! Bu karışık hayır devrinden sonra yine bir şer ve fesat devri gelecek midir?\" diye sordum. Resulullah Sallallahu Aleyhi ve Sellem \"Evet, gelecektir. O devirde birtakım davetçiler halkı cehennem kapılarına çağıracaklardır. Her kim onların davetine icabet ederse onu cehenneme atacaklardır\" buyurdu. Ben \"Ya Resulallah! Bu davetçileri bize tanıtsanız!\" dedim. Resulullah Sallallahu Aleyhi ve Sellem \"Onlar bizim milletimizin insanlarıdır. Bizim dillerimizle konuşurlar\" buyurdu. Ben \"Ya Resulallah! O devre yetişirsem nasıl hareket etmemi emredersiniz?\" dedim. Resulullah Sallallahu Aleyhi ve Sellem \"Müslümanların topluluğundan ayrılma ve onların idarecilerine itaat et!\" buyurdu. Ben \"Ya Resulallah! Onların bir topluluğu ve başlarında idarecileri yoksa?\" dedim. Resulullah Sallallahu Aleyhi ve Sellem \"Bu takdirde bu fırkaların hepsinden -senin açından bir ağaç kökünü ısırmak gibi meşakkatli bile olsa- uzak dur! Artık ölüm sana erişinceye kadar bu tavır üzere bulun!\" buyurdu. Fethu'l-Bari Açıklaması: \"Cemaat bulunmadığında nasıl hareket edileceği. \" Başlıktaki \"Kane\" burada tam fiildir. Manası şudur: Bir halife etrafında bir araya gelmeden önce ihtilaf durumunda Müslüman ne şekilde hareket etmelidir? \"Biz (vaktiyle) cahiliye döneminde ve kötülük içindeydik.\" Huzeyfe bu sözü ile İslam'dan önce küfür içinde olduklarına, birbirlerini öldürüp, birbirlerinin mallarını yağmaladıklarına ve çirkin fiilleri işlediklerine işaret etmektedir. \"Sonra Yüce Allah bize bu hayrı getirdi.\" Yani bize imanı, düzgün hali veya çirkin fiillerden kaçınmayı nasip etti. Müslim'in nakline göre Huzeyfe \"Biz şimdi o durumdayız\" demiştir. \"O kötülük ve şerden sonra bir hayır var mıdır?\" dedim. Resulullah Sallallahu Aleyhi ve Sellem \"evet, vardır\" buyurdu. İbn Ebi Şeybe'de SUbey' b. Halid'in nakline göre Huzeyfe \"Bu kötülükten korunmanın yolu nedir?\" diye sormuş. Resulullah Sallallahu Aleyhi ve Sellem \"Kılıçtır\" diye cevap vermiştir. Huzeyfe \"Kılıçtan sonr.a başka bir şey daha var mıdır?\" diye sorunca, Resulullah Sallallahu Aleyhi ve Sellem \"Evet, vardır! Bu ateşkestir\" buyurmuştur. (İbn Ebi Şeybe, Musannef, 7,447. ) Hadiste geçen \"şer / kötülük\" ten maksat, Hz. Osman'ın öldürülmesinden sonra ortaya çıkan bir dizi fitnelerdir ya da bu fitnelerin sonucu ahirette verilecek cezalardır. \"Evet, içinde kin ve fesat bulunan bir hayır olacaktır.\" Arapça'da \"dehan\" kin demektir. Nebi Sallallahu Aleyhi ve Sellem bununla kötülük döneminden sonra gelecek olan iyilik döneminin halisane ve saf bir iyilik değil, içerisinde bulanıklık olan bir iyilik dönemi olduğuna işaret etmektedir. Bazılarına göre \"eddahan\" kelimesinden maksat, \"duhan =duman\" dır. Nebi Sallallahu Aleyhi ve Sellem bununla yaşanılacak durumun bulanıklığına işaret etmektedir. Başka alimlere göre \"ed-dahan\" istenilmeyen ve hoşlanılmayan her şeydir. Ebu Ubeyd, bu hadiste ne söylenmek istediğini bir başka hadis şu şekilde açıklamaktadır demiş.tir: \"İnsanlann kalbi eski safiyetine dönmeyecektir.\" \"Dahan\" kelimesi esasen hayvanın rengindeki bulanıklık anlamına gelmektedir. Buna göre hadisin manası onların kalpleri birbirine karşı saf ve tertemiz olmayacaktır demek olur. \"O devirde gelecek hir zümre, benim sünnetim ve yolumun dışında bir yoldan gideceklerdir.\" Ebu'I-Esved'in rivayet i \"Benden sonra benim yolumdan gidip, sünnetime uy'mayacak amirler gelecektir\" şeklindedir. \".......\" yani o adı geçen tophıluktan bazılarını tanıyıp, yaptıkları amellere tepki göstereceksin. Müslim'in Ummü Seleme'den nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"Kim bunlara tepki gösterirse uzak olur, kim hoşlanmazsa salim olur\" buyurmuştur.(Müs/im, İmara) \"........\" kelimesinin çoğulu olup, haktan başkasına davet eden davetçiler demektir. \"Cehennem kapılan üzerine çağıracaklar.\" Resulullah Sallallahu Aleyhi ve Sellem'in onlar hakkında bu ifadeyi kullanması, ileride bu duruma düşmeleri açısındandır. Bu tıpkı haram bir fiili emreden kimseye \"Adam cehennemin kıyısında durdu\" denilmesine benzer. \"Onlar bizim milletimizin insanlandır. \" Yani bizim kavmimizden, dilimizi konuşan ve milletimize mensup kimselerdir. Kabisi şöyle demiştir: Hadisin manası şudur: Onlar zahiren bizim dinimiz üzeredirler ama içten muhaliftirler. Ebü'I-Esved'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"Onlann içinde birtakım kimseler vardır ki kılıklan insan gibi olmasına karşılık, kalpleri şeytanın kalpleri gibidir\" demiştir. Kadı Iyaz şöyle der: Hadiste yer alan \"birinci kötülük\"ten maksat, Hz. Osman' dan sonra meydana gelen fitnelerdir. Ondan sonra meydana gelen hayırdan maksat Ömer b. Abdulaziz zamanında görülen iyi icraatlardır. \"Tanıdığın ve yaptıklarına tepki koyduğun kimseler\"den maksat Ömer b. Abdulaziz'den sonrakilerdir. Onların içinde sünnete, adalete yapışanlar olduğu gibi bid'ate davet eden ve insanlara zulmeden kimseler de vardı. Biz de şunu ekleyelim: Öyle anlaşılıyor ki hadisteki \"birinci kötülük\"ten maksat, Resulullah Sallallahu Aleyhi ve Sellem'in işaret ettiği ilk fitnelerdir. \"Hayır\" dan maksat ise insanların Ali ve Muaviye etrafında toplanmalarıdır. \"Dehan\" kelimesi ile kastedilen, Irak'ta Ziyad örneğinde olduğu gibi onların zamanındaki bazı valiler ve Haricller örneğinde olduğu gibi bazı kimselerin muhalefetidir. \"Cehennem kapıları üzerindeki davetçiler\", Haricl ve başkalarından olmak üzere iktidarı talep eden kimseler demektir. Nebi s.a.v. \"Müslümanlann topluluğundan aynlma ve onlann idarecilerine itaat et\" sözüyle buna işaret etmektedir. Yani Müslümanların idarecileri zalim bile olsa onlara yapış demektir. Nitekim Ebu.'I-Esved'in \"O sırtına vursa ve malını alsa bile\" şeklindeki rivayet i bunu açıklığa kavuşturmaktadır. Haccac'ın ve benzerlerinin valiliği döneminde bunun birçok örnekleri görülmüştür. \"Bir ağaç kökünü ısırmak gibi ... \" Bu ifade Müslümanların topluluğuna bağlanmanın ve asi bile olsalar onların hükümdarlarına itaat etmenin gerektiğinin kinayeli anlatımıdır. Beydavi' şöyle demiştir: Hadisin manası şudur: Yeryüzünde halife yoksa uzlete çekil ve zamanın sıkıntılarını üstlenmek için sabırlı ol. \"Ağaç kökünü ısırma\" tabiri, meşakkat çekmenin kinayeli anlatımıdır. Bu \"Filanca ağrılarının şiddetinden taşı ısırıyor\" cümlesine benzer ya da maksat bağlanmaktır. Bir başka hadisteki \".L:-Irl4 4::k \\=onu azı dişleriyle ısırdılar, ona hırsla sanldılar\" hadisi örnektir. Birinci yaklaşımı ve başka hadisteki şu ifade teyit etmektedir: \"Bir ağacın kökünü ısırdığın halde ölmen onlardan birinin ardından gitmekten sana daha hayırlıdır.\" İbn Battal şöyle der: Bu hadis Müslümanların topluluğuna yapışmanın ve zalim idarecilere isyan etmemenin gerekliği konusunda fıkıh bilginlerine delil olmuştur. Zira Nebi Sallallahu Aleyhi ve Sellem diğer zümreyi \"Cehennemin kapılan üzerindeki davetçiler\" olarak nitelemektedir. Resulullah Sallallahu Aleyhi ve Sellem onlar hakkında birinci zümre hakkında kullandığı gibi \"Onları tanırsın, bazı hareketlerine tepki gösterirsin\" dememiştir. Onların bu şekilde olmaları, hak üzere olmamalarından başka bir sebeb e dayanmamaktadır. Bununla birlikte Resulullah Sallallahu Aleyhi ve Sellem topluluktan ayrılmamayı emretmiştir. Taberi' şöyle demiştir: Hadisteki emir ve topluluk hakkında ihtilaf edilmiştir. Bazıları bu emir, vücub ifade eder, topluluk ise Müslümanların çoğunluğudur demişlerdir. Taberi' daha sonra Muhammed b. Si'ri'n'in bir haberine yer vermiştir. Buna göre İbn Mesud, Hz. Osman öldürülünce ne yapacağını soran kimseye \"Topluluğa sarıL. Çünkü Yüce Allah, Muhammed ümmetin İ sapıklık üzere bir araya getirmez\" tavsiyesinde bulunmuştur. Bir başka grup ise \"Topluluk\"tan maksat, sahabilerdir, onlardan sonraki nesil değildir derken, bir diğer grup onlardan maksat ilim ehlidir, çünkü Yüce Allah alimleri halka hüccet ve delil olarak yaratmıştır. İnsanlar dini hususlarda onlara uyarlar demişlerdir. Taberl'ye göre doğru olanı şudur: Haberden maksad, idareci olması hususunda ittifak edilen kimseye itaat üzere olan topluluktan ayrılmamak gerekir. Böyle bir idareciye uymaktan vazgeçen kimse cemaatten ayrılmış demektir. Taberi şöyle devam eder: Hadisten anlaşıldığına göre insanların idarecileri yoksa ve zümrelere, hiziplere ayrılmışlarsa kişi bu fırkalardan herhangi birine uymaz, kötülüğe düşmek korkusuyla gücü yetiyorsa bunların tümünden uzak durur. Hadisten Çıkan Sonuçlar 1- İbn Ebi Cemre şöyle der: Hadiste Yüce Allah'ın her bir kulunu dilediği tavra nasıl yönlendirdiğine dair hikmeti yer almaktadır. Bunun neticesi olarak sahabilerin çoğunluğuna gereğine göre amel edip, başkalarına tebliğ etmeleri için iyiliğin çeşitlerini sorma sevgisi verilirken, Huzeyfe'ye kötülüğü sorma sevdirilmiştir. Bununla onun kötülükten kaçınması ve yapılan açıklamanın Yüce Allah'ın kurtulmasını dilediği kimselerden kötülı1ğü savuşturmasına sebep olması hedeflenmiştir. 2- Hadisten Nebi Sallallahu Aleyhi ve Sellem'in gönlünün ne kadar geniş (toleransıı) olduğu ve bütün hikmetleri bildiği anlaşılmaktadır. Hatta Nebi Sallallahu Aleyhi ve Sellem kendisine soru soran herkese durumuna uygun cevap veriyordu. 3- Herhangi bir şeyin sevgisi nasip olan herkes, o konuda başkasından daha üstündür. Bundan dolayı Huzeyfe Nebi Sallallahu Aleyhi ve Sellem'in sır arkadaşıydı ve Resulullah Sallallahu Aleyhi ve Sellem bu sırları ondan başkasına söylemiyordu. Öyle ki ona münafıkların isimlerini ve ileride olacak birçok şeyleri haber vermişti. 4- Öğretme adabından birisi de öğretmenin öğrenciye mubah olan ilimIerden onun eğilim duyduğunu gördüğü ilimieri öğretmesidir. Çünkü böylesi onun hızlı anlaması ve gereğini yapması için en uygun yoldur. 5- Hayır yoluna insanı ileten her şeye hayır denir. Bunun aksi için de aynı şeyleri söylemek mümkündür. 6- Dil için kitap ve sünnet dışında bir asıl tespit edip, kitap ve sünneti o uydurulan aslın bir uzantısı yapan kimse kınanmıştır. 7 - Batılı ve Nebi Sallallahu Aleyhi ve Sellem'in yoluna muhalif olan her şeyi reddetmek gerekir. Bunu söyleyen, ister yüksek tabakadan, ister aşağı zümreden olsun hiç farketmez",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 7085,
			"arabicnumber": 7085,
			"text": "İbn Abbas r.a. şöyle anlatmıştır: Müslümaniardan birtakım kimseler müşriklerle birlikte oluyorlar ve Resulullah Sallallahu Aleyhi ve Sellem'e karşı müşriklerin topluluğunu çoğaltıyorlardı. Birisi bir ok atıyor, o da gelip birisine saplanarak onu öldürüyordu veya birisi diğerine bir kılıç darbesi atarak onu öldürüyordu. İşte bunun üzerine \"Kendilerine yazık eden kimselere melekler canlarını alırken 'ne işte idiniz!' dediler. Bunlar 'Biz yeryüzünde çaresizdik' diye cevap verdiler. Melekler de 'Allah'ın yeri geniş değil miydi? Hicret etseydiniz ya!' dediler. İşte onların barınağı cehennemdir, orası ne kötü bir gidiş yeridir\"(Nisa 97) ayet-i kerimesi indi. Fethu'l-Bari Açıklaması: \"Fitnelerin ve zulümlerin taraftarlarını çoğaltmanın mekruhluğu.\" Yani fitne ve zulmün taraftarlarını arttırmak. Başlıkta geçen \"sevad\" kelimesinden maksat insanlardır. İbn Mesud'un nakline göre Resulullah Sallallahu Aleyhi ve Sellem bu kelimeyi bir hadis-i şerifte şu şekilde kullanmaktadır: \"Kim bir topluluğun fertlerini çoğaltacak olursa onlardandır. Her kim bir topluluğun hareketinden razı olursa onu işleyenin ortağı olur.\" Hadisi Ebu Ya'la rivayet etmiştir. \"Birisi diğerine bir kılıç darbesi atarak. .. \" Yani onu ya okla ya da kılıçla öldürürdü. Bu hadis günah işleyen kimselerin arasında kendi isteği ile oturan kimselerin hata ettiklerini vurgulamaktadır. Buna karşılık kişi onlara -mesela- tepki göstermek veya bir Müslümanı helak olmaktan kurtarmak gibi meşru bir amaçla oturursa bu müstesnadır. Onların arasından ayrılmaya gücü yeten kimse mazur olmaz. Tıpkı Müslüman olup da müşriklerin hicret etmelerine mani oldukları kimseler gibi. Bunlar müşriklerle birlikte savaşa çıkıyorlardı. Maksatları Müslümanlarla çarpışmak değildi. Tam tersine Müslümanların gözünde onların çok oldukları izlenimini vermekti. Sırf bu amaçtan dolayı sorumluluk altına girdiler. İkrime Müslümanlarla çarpışan bir ordu için de sefere çıkan kimsenin çarpışmasa ve buna niyet etmese bile günaha gireceği kanaatine varmıştır. Bu anlayış sözkonusu tavrın aksini hükme bağlayan şu hadisle güçlenmektedir: \"Onlar öyle bir topluluktur ki kendileriyle birlikte bulunanlar bedbaht olmazlar",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 7086,
			"arabicnumber": 7086,
			"text": "Huzeyfe şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem bize iki olaydan söz etti. Bunlardan birini gördüm, diğerini bekliyorum. Resulullah Sallallahu Aleyhi ve Sellem bize (emanetin yeryüzüne nasıl indiğini şöyle) haber verdi: \"Emanet insanlarun gönüllerinin derinliğine iner. Sonra o kullar Kur'an'dan bilgi alırlar, daha sonra da sünnetten öğrenirler. \" Resulullah Sallallahu Aleyhi ve Sellem bize emanetin (dünyadan nasıl kaldırıldığını) da şöyle haber verdi: \"Kişi gece uykusunu uyur. 0, uyurken emanet kalbinden (silinip) alınır da emanetin eseri uçuk bir nokta halinde kalır. Sonra o bilgin kişi bir uyku daha uyurken emanetin (geri kalan kısmı da) alınır. Bunun izi de (bir işçinin avucundaki) kabarcık gibi kalır, Şu halde emanet, senin ayağına düşürdüğün bir kıvılcım gibidir ki orası su toplar ve kabarcık halinde görürsün, Halbuki bu kabarcıkta herhangi bir şey yoktur. (Bir zaman sonra söner gider). \"İnsanlar birbiriyle alışveriş etmek için sabaha ererler. Hiç kimse emaneti eda etme imkanını bulamaz. Şöyle ki (bazen) filan oğul/an içinde emin bir kimse vardır denilir. (Bazen) birisi için 'O ne akıllıdır, ne zarif adamdır, ne kahramandır' diye söylenir. Halbuki o kişinin kalbinde hardal tanesi kadar iman eseri yoktur.\" Huzeyfe dedi ki: \"Öyle bir zaman gördüm ki o devirde kiminle alışveriş edeceğim diye tasalanmazdım. Çünkü o kişi Müslümansa onu Müslümanlığı (bana hıyanet etmekten) men ederdi, eğer hıristiyansa onu (bulunduğu yerin) valisi hıyanetten men ederdi. Bugün ise ben filan ve filandan başka kimseyle alışveriş edemez oldum.\" Fethu'l-Bari Açıklaması: İmam Buharl'nin attığı başlığın açık ifadesi, bir Müslüman değersiz ve hayırsız insanların arasında kaldığında ne yapacaktır? şeklindedir. Başlıkta geçen \"elhusale\" kelimesinin tefsiri Rikak bölümünün baş taraflarında geçmişti. Bu başlık Taberi'nin rivayet edip, İbn Hibban'ın sahih olarak değerlendirdiği Ebu Hureyre hadisinde geçen bir ifadeden alınmıştır. Bu rivayete göre Nebi s.a.v. \"Ey Abdullah b. Amrl Ahidleri ve emanetleri yok olmuş, ihti!afa düşüp şu hale gelmiş -Resulullah Sallallahu Aleyhi ve Sellem parmaklarını birbirine geçirerek gösterdi- rezi! ve kötü insanların arasında kaldığında durumun nice olacaktır?\" Abdullah \"Bana ne emredersiniz?\" diye sordu. Resulullah Sallallahu Aleyhi ve Sellem \"Kendi yakın çevrene yapış! Onların avamını kendinden uzak tut\" buyurdu. \"Sonra o kullar Kur'an'dan bilgi alırlar, daha sonra da sünnetten öğrenirler.\" Bu ifade onların sünneti öğrenmeden önce Kur'an'ı öğrendiklerine işaret etmektedir. Hadisteki \"sünen\" kelimesinden maksat ister vacip, ister mendub Nebi Sallallahu Aleyhi ve Sellem' den öğrendikleri şeyler anlamınadır. \"Resulullah Sallallahu Aleyhi ve Sellem bize emanetin (dünyadan nasıl kaldırıldığını) da şöyle haber verdi.\" Bu Huzeyfe'nin beklediğini dile getirdiği ikinci hadis olmaktadır. Onun beklediği, emanetin -nadir olanlar hariç- bu sıfatla nitelenen hiçbir kimse kalmayacak derecede yeryüzünden kaldırılmasıdır. Hadisin son kısmında güvenilir olarak nitelenecek kimselerin azlığını gösteren ifade bu hükmü zedelemez. Zira bu yargı, öncekilerin durumuna nispetendir. Huzeyfe \"Bugün ise ben filan ve filandan başka kimseyle alışveriş edemez oldum\" şeklindeki ifadesi ile yetiştiği son asırdaki kimselere işaret etmektedir. ilk döneme nispeten onlardaki güvenilirlik daha azdı. Huzeyfe'nin ileride beklediğine gelince, emanetin nadir olanlar hariç ortadan yok olmasıdır. \"Emanetin eseri uçuk bir nokta halinde kalır.\" Bunun manası emanetin hadiste nitelenen eseri hariç olmak üzere hiç kalmayacağıdır. Örnekte geçen '\\:...5')1\" renkteki siyahlıktır. Aynı şekilde \".....\" çalışmanın avuç içinde su toplama şeklinde meydana getirdiği eserdir. \".....\" yani eli su toplayıp, kabarClk bağladı demektir. Arapçada \"........\" onun eli şişip, su topladı demektir. Kısacası hadis, emanetin yeryüzünden kaldırılacağı, emin olarak nitelenen kimselerin yok olacağı ve insanın emin iken hain haline geleceği uyarısında bulunmaktadır. Bu, hıyanet ehli kimselerle bir arada bulunan kişilerde görülür. Çünkü bu tip bir kişi, hain haline gelir. Zira arkadaş, arkadaşına uyar. \"Öyle bir zaman yaşadım ki. .. \" Huzeyfe bu ifadesiyle emanetin o zamana göre azalmaya başladığına işaret etmektedir. Huzeyfe'nin vefatı Hz. Osman'ın katledilmesinden kısa bir süre sonraya hicri 36 yılının başına rastlar. Huzeyfe değişikliğin baş gösterdiği zamanın bir kısmına yetişmiş olduğundan buna işaret etmektedir. ibnü't-TIn \"Emanet\" gizlenen ve mükellefte varlığını ancak Yüce Allah'ın bildiği bir niteliktir, demiştir. İbn Abbas şöyle demiştir: Emanet, kulların yapmaları emredilen farzlarla kendilerine yasaklanan şeylerin tümüdür. Bazılarına göre emanet itaattir, bazıları ise mükellefiyetlerdir demişlerdir. Emanetin Yüce Allah'ın kullarından aldığı ahid olduğunu söyleyenler de olmuştur. Bu ihtilaf, \"Biz emaneti göklere, yere ve dağlara teklif ettik\"(Ahzab 72) ayetinin tefsirinde zikri geçen emanetin açıklaması konusunda da vuku bulmuştur. et-Tahrfr müellifi şöyle demiştir: Hadiste sözü edilen \"emanet\" ayette zikri geçen emanetin aynısıdır ki bu bizatihi imandır. Bu emanet, kalpte yerleşti mi kişi kendisine emredileni ifa eder, yasaklanandan kaçar. ibnü'l-Arabi' şöyle demiştir: Huzeyfe hadisinde sözü edilen \"emanet\"ten maksat imandır. \"Kiminle alışveriş edeceğim diye tasalanmazdım.\" Rikak bölümünde \"Mübayaa\" kelimesinden maksadın halifeibe emirlik için bey' at manasında değil, mal ve benzeri ticaret mallarının mübadelesi manasında olduğu geçmişti. Ebu Ubeyd ve başkalarının bu hadiste geçen \"mübayaa\" kelimesini halifelik şeklinde yorumlamalarına büyük bir tepki gelmiştir ki bu gayet açıktır",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 7087,
			"arabicnumber": 7087,
			"text": "Seleme b. el-Ekva Haccac'ın huzuruna girdiğinde Haccac \"Ey İbnü'lEkva! Sen topukların üzere dininden geri döndün. Çölde bedevi Araplarla yaşıyorsun\" dedi. İbnü'I-Ekva \"Hayır! (ben Medine'den yüz çevimedim). Fakat Resulullah Sallallahu Aleyhi ve Sellem bana çölde oturma izni verdi\" diye karşılık verdi",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 7088,
			"arabicnumber": 7088,
			"text": "Ebu Said el-Hudrl'nin nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"Bir Müslümanın en hayırlı malının koyunları olacağı günler yakındır. Müslüman dini uğruna fitnelerden kaçarak kah dağların başlarını, kah vadilerin yağmur düşen yerlerini (otlak olarak) seçecektir\" diye haber vermiştir. Fethu'l-Bari Açıklaması: \"Fitne zamanında bedevilerle birlikte oturmak.\" Bunun anlamı, muhacirin hicret ettiği beldeden çıkarak bedevilerle birlikte oturması ve hicretinden sonra bedevi haline dönmesidir. O sıralarda Nebi s.a.v.'in izin verdikleri hariç bu şekilde davranmak haramdı. İmam Buharl'nin bu hareketi \"Fitne zamanı\" şeklinde kayıtlaması o zamanki iznin fjtnenin baş gösterme zamanı verildiğine işaret etmektedir. Bazıları fitne zamanı böyle bir şeye izin verilmemesi hak üzere olan kimselere destek vermeme sonucunu doğurur demişlerdir. Fakat selef bilginlerinin bu konudaki yaklaşımları değişik olmuştur. Bazıları Sa'd, Muhammed b. Mesleme, İbn Ömer gibi fitneden selamette olmayı ve bir kenara çekilmeyi tercih etmişlerdir. Bazıları ise -ki bunlar çoğunluktur- çarpışmayı üstün tutmuşlardır. \"Seleme b. el-Ekva, Haccac'ın huzuruna girdiğinde ... \" Bu haberde adı geçen Haccac meşhur emir Haccac b. Yusuf es-Sakafi'dir. Bu olay hicretin 74. yılı İbn ZUbeyr'in katlinden sonra Haccac'ın Hicaz emiri olup, Mekke'den Medine'ye geçtiğinde olmuştu. \"Topukların üzerine dininden geri döndün.\" Haccac bu ifadesiyle Hudo.d bölümünde büyük günahlar işlenirken geçtiği üzere bu konuda yer alan hadisteki ifadeye işaret etmektedir. Çünkü \"Kim hicretinden sonra bedevi olarak dönerse\" bu konuda zikredilenlerden birisiydi. Bu haberi Nesai, İbn Mesud' dan şu şekilde rivayet etmiştir: \"Allah faiz yiyene ve yedirene lanet etsin. \"(Nesai, Zinet) Bu hadiste \"Hicretinden sonra bedevi olarak dönene\" ifadesi de yer almaktadır. İbnü'l-Esir en-Nihaye'de şöyle der: Hicretten sonra herhangi bir mazereti olmaksızın bulunduğu yere geri döneni mürted gibi kabul ediyorlardı. Bir başkası şöyle demiştir: Bu Haccac'ın insanlara cefasından kaynaklanıyordu. Zira o, bu büyük sahabiye daha mazeretini anlayıp dinlemeden o çirkin sözle hitap edebilmişti. Rivayete göre Haccac, Seleme'yi öldürmek istemiş ve kendisini katledilmeye layık kılmak istediği gerekçeyi açıklamak istemjştir. \"Seleme hayır dedi.\" Yani Seleme ben hicretten dönmek için çölde yerIeşmedim dedi. \"Resulullah Sallallahu Aleyhi ve Sellem bana çölde oturma izni verdi.\" Hammad b. Mes'ade'nin, Yezid b. Ebi Ubeyd'den nakline göre Seleme Resulullah Sallallahu Aleyhi ve Sellem'den çölde oturma izni istemiş, Resulullah Sallallahu Aleyhi ve Sellem de ona bu izni vermiştir. Haberi el-İsmail! nakletmiştir. Seleme'nin bu konuda Haccac'dan başkasıyla yaşadığı bir olay daha vardır. Bunu Ahmed b. Hanbel şu şekilde nakleder: Seleme, Medine'ye geldiğinde Büreyde b. el-Hasib ile karşılaşır. Büreyde \"Hicretinden irtidad ettin\" deyince, Seleme \"Allah korusun! Ben Resulullah Sallallahu Aleyhi ve Sellem' den aldığım izne dayanarak orada oturuyarum. Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Ey Eslem kabilesi! Çölde oturunuz'\" -Eslem, Seleme, Ebu. Berze ve Büreyde'nin mensup olduğu meşhur kabilenin adıdır.- Onlar: .\"Bunun hicretimizi zedeleyeceğinden korkuyoruz\" deyince, Resulullah Sallallahu Aleyhi ve Sellem \"Sizler nerde bulunursanız bulunun muhacirsiniz\" buyurmuştur.(Ahmed b. Hanbel, LV, 55) Bu haberin Amr b. Abdurrahman b. Cürhed'den nakledilen şahidi bulunmaktadır. Abdurrahman şöyle demiştir: Ben birisinin Cabir' e şu soruyu sorduğunu gördüm: \"Resulullah Sallallahu Aleyhi ve Sellem'in sahabilerinden kimler kaldı?\" O kişi \"Enes b. Malik ve Seleme b. el-Ekva\" cevabını verdi. Adam \"Seleme hicretinden irtidad etti\" deyince, Cabir \"Böyle söyleme. Çünkü ben Resulullah Sallallahu Aleyhi ve Sellem ile Eslem oğulları arasında şöyle bir konuşmaya şahit oldum\" dedi. Resulullah Sallallahu Aleyhi ve Sellem, Eslem oğullarına \"Çölde oturun\" deyince, Eslem oğulları \"Biz hicretten sonra bundan dönmüş olmaktan korkuyoruz\" dediler. Resulullah Sallallahu Aleyhi ve Sellem \"Sizler nerede bulunursanız bulunun muhacirsiniz\" buyurdu. Bu iki haberin isnadı hasendir. \"Osman b. Affan katledilince, Seleme Rebze'ye çıktı.\" Rebze, Mekke ile Medine arasında çölde bir yerin adıdır. Bu haberden Seleme'nin çölde yaklaşık kırk yıl kaldığı anlaşılmaktadır. Çünkü Hz. Osman hicri 35 yılının zilhiccesinde öldürüldü. Seleme'nin ölümü ise sahih olan rivayete göre hicri 74'tür. \"Dini uğruna fitnelerden kaçarak. .. \" Bu haber dininden endişe duyan kimsenin uzlete çekilmesinin faziletli olduğunu göstermektedir. Selef bilginleri uzlete çekilmenin aslı konusunda ihtilaf etmişlerdir. Çoğunluk şöyle demiştir: Fitne zamanlarında insanların içine karışmak, İslam'ın sembol ibadetlerini yapmak, İslam toplumunun sayısını çoğaltniak, onlara yardım etmek, imdatlarına koşmak, hasta olduklarında ziyaret etmek ve benzeri şekillerde çeşitli iyiliklerde bulunmak dolayısıyla dini faideler kazanma olduğu için daha evladır. Bir başka grup bilgin ise şöyle demişlerdir: Uzlete çekilmek, yapılması gerekeni bilmek şartıyla fitneden selamette kalmak olduğu için daha evladır. Nevevi'nin görüşü şöyledir: Tercihe şayan olanı, günaha düşmeyeceğine dair kuwetli zan besleyen kimse için insanlarla birlikte yaşamaktır. Eğer bir sıkıntı doğacaksa o zaman uzlete çekilmek daha evladır. Bir başkası şöyle demiştir: Bu, kişiden kişiye değişir. Bazıları için iki seçenekten sadece birini yapması gerekirken, bazıları için tercih ve ağır basma sözkonusuur. Bizim sözkonusu ettiğimiz bu değildir. Aksine uzlete çekilmekle insanlarla bir arada yaşamak birbirine eşit olduğunda ne yapılacaktır? Bu, durumdan duruma değişir. İki durum birbiri ile çeliştiğinde zamandan zamana değişir. Bazıları için insanlarla birlikte yaşamak tek seçenektir. Bunlar gördükleri münkeri ortadan kaldırma gücü olanlardır. Bu gibi kimseler için insanlarla birlikte yaşamak duruma ve imkana göre ya farz-ı ayndır ya da kifayedir. Emr-i bi'l-maruf ve nehy-i ani'l-münker yaptığında canını kurtaracağına kuwetli zannı olan kimseler için de insanlarla birlikte yaşaması tercih edilir. Kendi canı açısından emin olduğu halde kendisine itaat edilemeyeceği kesinse bu gibi kimseler için uzlete çekilmekle insanlarla birlikte yaşamak eşittir. Bu, ortada yaygın bir fitne olmadığında sözkonusudur. Şayet yaygın bir fitne varsa genellikle sakıncalı bir duruma düşme sözkonusu olacağı için uzlete çekilJıek daha ağır basar",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 7089,
			"arabicnumber": 7089,
			"text": "Enes şöyle demiştir: Sahabiler Nebi Sallallahu Aleyhi ve Sellem'e birtakım sorular sordular ve nihayet işi ısrar derecesine vardırdılar. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem bir gün minbere çıktı. \"Bana soracağınız her şeyi açıklayacağım\" dedi. Bu sırada ben sağa ve sola bakmaya başladım. Bir de ne göreyim herkes başını elbisesinin içine gömmüş ağ.lıyordu. Bu arada birisi söze başladı. Bu kişi, birisi ile tartıştığı zaman yüzüne babasının başkası olduğu iddia ediliyordu. O kişi \"Ey Allah'ın Nebii! Benim babam kimdir?\" diye sordu. Resulullah Sallallahu Aleyhi ve Sellem \"Baban Huzafe'dir!\" dedi. Bunun üzerine Ömer söze başlayıp \"Biz Allah Teala'yı Rab, İslam'ı din, Muhammed'i Resul olarak kabul ve tasdik ettik. Bizler fitnelerin kötülüğünden Allah'a sığınırız!\" dedi. Bu sözü üzerine Nebi Sallallahu Aleyhi ve Sellem \"Ben hayırda ve şerde asla bugünün benzerini görmüş değilim. Şu muhakkak ki cennet ve ceh8nnem' benim önümde canlandırıldı da nihayet bu ikisini şu duvarın önünde gördüm\" buyurdu",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 7090,
			"arabicnumber": 7090,
			"text": "Katade dedi ki: Enes bu olayı Nebi Sallallahu Aleyhi ve Sellem'den onlara bu şekilde nakletti ve şöyle söyledi: Herkes başını elbisesinin içine gömmüş ağlıyordu. Enes \"Fitnelerin kötülüğünden Allah'a sığınıcı olarak\" demiş ya da \"Fitnelerin kötülüğünden Allah'a sığınınm diyerek\" şeklinde bir nitelemede bulunmuştur",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 7091,
			"arabicnumber": 7091,
			"text": "Katade'nin nakline göre Enes sözkonusu hadisi Nebi Sallallahu Aleyhi ve Sellem'den bu şekilde nakletmiş ve \"Her bir kişi fitnelerin kötülüğünden Allah'a sığınarak başı elbisesinin içine gömülmüş olarak ağlıyordu\" demiştir. Fethu'l-Bari Açıklaması: AÇIKLAMA SONRASI BİR BAB VE HADİSELER DAHA VAR \"Fitnelerden Allah'a sığınmak.\" İbn Battal şöyle demiştir: Bunun meşruluğu \"Allah'tan fitne dileyiniz. Çünkü fitne münafıkları biçer\" görüşünü savunaniara bir cevaptır. Bu gC?rüşü savunanlar sözkonusu yaklaşımın hadiste yer aldığını iddia etmişlerdir. Oysa bu rivayetin merfu olduğu sabit değildir. Tam aksine sahih olanı bunun tersidir. Dualar bölümünde birçok şeyden sığınma şeklinde birden fazla başlık yer almıştı. Bunların içinde \"Zenginliğin fitnesinden Allah'a sığınma\", \"Fakirliğinden fitnesinden AlIah'a sığınma\", \"Yaşlanıp köhnemekten Allah'a sığınma\", \"Dünyanın fitnesinden Allah'a sığınma\", \"Cehennemin fitnesinden Allah'a sığınma\" vs. gibi başlıklar vardı. Bilginler şöyle demişlerdir: Nebi Sallallahu Aleyhi ve Sellem, fitneden Allah'a sığınmanın ümmetine meşru olduğunu vurgulamak istemektedir. \"Ahfevhu.\" Bu kelime soru sormada ısrarcı oldular anlamınadır. \"ı..? 1;1 iJlS Kane iza laha \"......\" mücadele ve tartışma anlamına olan \"mülahat\" kökündendir. \"Baban Huza!e'dir.\" Ahmed b. Hanbel'de Muhammed b. Amr'ın Ebu Seleme vasıtasıyla Ebu Hureyre' den nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Bana bugün ne soraı:gınız size cevaplayacağım.\" Abdullah b. Huzafe \"Ya Resulallah! Babam kimdir?\" diye sorunca Resulullah Sallallahu Aleyhi ve Sellem \"Baban Huzafe b. Kays'tır\" demiştir. Bu cevap üzerine Abdullah annesine döner. Annesi \"Neden böyle bir soru sorma ihtiyacı hissetti n? Bizler o zamanlar cahiliye döneminde idik\" der. Abdullah, \"Babamın kim olduğunu, hangi kişinin babam olduğunu öğrenmek istiyordum\" diye cevap verir",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 7092,
			"arabicnumber": 7092,
			"text": "Salim'in babasından nakline göre Resulullah Sallallahu Aleyhi ve Sellem bir gün minberin yanında ayağa kalkmış ve \"Fitne şu taraftadır, fitne şu taraftadır. Şeytanın boynuzunun doğduğu yerdedir! -veya- Güneşin boynuzunun doğduğu yerdedir\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 7093,
			"arabicnumber": 7093,
			"text": "İbn Ömer'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem gün doğusu tarafına yönelmiş olarak \"Dikkat edin! İyi biliniz ki fitne işte bu taraftadır, şey tanın boynuzunun doğduğu yerdedir!\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 7094,
			"arabicnumber": 7094,
			"text": "İbn Ömer şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem bir gün söze başladı ve \"Allah'ım! Şam'ımızda bize bereket ihsan eyle! Allah'ım Yemen'imizde bize bereket ihsan eyle!\" diye dua etti. Sahabiler \"Ya Resulallah! Necd'imizde de!\" diye niyaz ettiler. Resulullah Sallallahu Aleyhi ve Sellem \"Allah'ım! Şam'ımızda bize bereket ihsan eyle! Allah 'ım Yemen'imizde bize bereket ihsan eyle!\" diye dua etti. Sahabiler \"Ya Resulallah' Necd'imizde de!\" dediler. İbn Ömer dedi ki: Zannediyorum Resulullah Sallallahu Aleyhi ve Sellem üçüncü defasında \"Zelzeleler ve fitneler işte oradadır. Şey tan ın boynuzu da orada çıkacaktır!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 7095,
			"arabicnumber": 7095,
			"text": "Said b. CUbeyr şöyle anlatmıştır: Bir gün yanımıza Abdullah b. Ömer çıkageldi. Biz de kendisinden bize güzel bir hadis rivayet etmesini rica ettik. Said dedi ki: Bizden önce birisi ona doğru ileri geçerek \"Ey Ebu Abdurrahman! Bize fitne anındaki çarpışmadan söz et!\" Yüce Allah \"Fitne tamamen yok edilinceye ve din de yalnız Allah için oluncaya kadar onlarla savaşın\"(Bakara 193) buyuruyor dedi. Bunun üzerine İbn Ömer \"Sen fitne nedir bilir misin? Anası evlatsız kalasıca! Muhammed ancak müşriklerle savaşırdI. Onların dinlerine girmek bir fitnedir. Onun savaşı sizin savaşınız gibi mülk yani iktidar üzerine değildi\" demiştir. Fethu'l-Bari Açıklaması: Nebi s.a.v.'in \"Fitne doğu tarafından gelecektir\" ifadesi, doğu cihetinden gelecektir anlamınadır. İmam Buhari bu konuda üç hadise yer vermiştir. Bunlardan birincisini iki açıdan zikretmiştir. Ben Fiten bölümünün baş taraflarında Üsame hadisinin açıklamasına yer vermiş ve bu hadisle \"Ben fitnelerin evlerinizin arasından çıktığını görüyorum\" ifadesinin nasıl cem ve telif edileceğini belirtmiştim. Nebi Sallallahu Aleyhi ve Sellem'in O hitabı Medinelilere idi. Mühelleb şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem doğu tarafında yaşanlar< dua etmemiştir. Çünkü onlar şeytanın fitnelerle istilası nedeniyle kendi yörelerine inmiş olan kötülük karşısında zayıftılar. \"01 0}\" ifadesi hakkında Davudi şöyle demiştir: Güneşin gerçekten iki adet boynuzu (0}) bulunmaktadır. Nebi Sallallahu Aleyhi ve Sellem'in bu ifade ile şeytan ın gücünü ve insanları saptırmak için yardımına başvurduğu şeyleri kastetmiş olma ihtimali vardır. Ağır basan ihtimal de budur. Bazıları şöyle demiştir: Şeytan güneş doğarken kendisine tapanların secdesi kendine olsun diye başını güneşe yaklaştırır. Başka bazıları ise güneşin, iki boynuzunun arasından doğduğu şeytanı bulunma ihtimali vardır demişlerdir. Hattabl'nin görüşü ise şöyledir: \"0,;JI\" insan topluluğu olup, bir nesil yok olduktan sonra diğeri gelir demiştir. Bir başkası ise şöyle demiştir: O gün doğu yöresindeki insanlar küfür ehli idi. Resulullah Sallallahu Aleyhi ve Sellem fitnenin O bölgeden çıkacağını haber vermiştir ki gerçek de aynen böyle olmuştur. Fitnelerin ilki doğu tarafından çıkmıştır. Bu, Müslümanlar arasındaki tefrikaya sebep olmuştur. Tefrika, şeytan ın sevdiği ve sevinç duyduğu bir şeydir. Bid'atler de aynı şekilde o taraftan çıkmıştır. Hartab! şöyle der: Necd, doğu tarafı demektir. Medine'de bulunan bir kimsenin ne cidi Irak çölü ve civarıdır. Burası Medinelilerin doğusuna düşer. \"Necd\" kelimesi esasen yüksekçe yer anlamınadır. Bunun zıttı \"el-ğavr\"dır. Çünkü ğavr alçak olan yer anlamınadır. Tihame baştan sonra ğavr olup Mekke, Tihame'ye dahildir. Bu açıklamayla Davudl'nin \"Necd Irak tarafındadır\" şeklindeki ifadesinin zayıflığı ortaya çıkmaktadır. Zira onun açıklaması Necd'in özel bir yer olduğu izlenimini vermektedir. Oysa gerçek böyle değildir. Tam aksine yanındakine nispetle yüksek olan her şey necddir. Bundan dolayı yüksek yerlere necd, alçak yerlere ğavr denilir. \"Bize fitne anındaki çarpışmadan söz et. Yüce Allah buyuruyor ki ... \" Abdullah'a bu talepte bulunan kişi, okuduğu ayetle çarpışmçının meşru olduğuna delil getirmek ve ayette İbn Ömer gibi çarpışmayı terkedene cevap olduğunu vurgulamak istemektedir. \".........\" Anası evlatsız kalasıca! Anan seni kaybetsin! Bu ifadenin zahiri duadır. Ancak bu cümle burada olduğu gibi kaçındırma yerinde gelebilir. İbn Ömer'in cevabı şöyledir: \".....= onlarla çarpışınız\" ayetindeki zamir \"kafirler\" yerine kullanılmıştır. Yüce Allah mu'minlere dini yüzünden fitneye uğrayan ve irtidad eden hiç kimse kalmasın diye kafirlerle çarpışmayı emretmektedir. Kafirlerin dinine girmek fitnedir. İnsan dini yüzünden fitneye uğruyordu. Onu ya öldürüyorlar ya da eline ayağına kelepçe vuruyorlardı. Sonunda Müslümanlar çoğaldı ve hiçbir fitne kalmadı. \".......'' yani kafirlerden hiçbir kimseden, hiçbir mü mine karşı herhangi bir fitne kalmadı. İbn Ömer'in görüşü, iki zümreden biri haklı, diğeri haksız olduğunda fitne zamanında savaşa katılmamak şeklinde idi. Bazıları, buradaki fitnenin iktidar talebinde galip gelme amacıyla çıkan savaş durumuna mahsus olduğunu söylemişlerdir. Buna karşılık meşru idareciye karşı isyan edenler \"bağıler\" sözkonusu olduğunda buna fitne denmez ve onlar itaata dönünceye kadar kendileriyle çarpışmak gerekli olur. Çoğunluğun görüşü bu doğrultudadır",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 7096,
			"arabicnumber": 7096,
			"text": "Huzeyfe şöyle anlatmıştır: Bizler Hz. Ömer'in yanında oturuyorduk. Ömer bir ara \"Nebi Sallallahu Aleyhi ve Sellem'in fitne hakkındaki sözlerini hanginiz ezberinde tutuyor?\" diye sordu. Huzeyfe: \"İnsanın ailesi, malı, evladı, komşusu yüzünden uğrayacağı fitnelere namaz, sadaka, marufu emir ve mürıkerden nehy amelleri kefaret olur\" dedi. Ömer Huzeyfe'ye \"Benim senden sormak istediğim bunlar değildir, fakat ben Nebi Sallallahu Aleyhi ve Sellem'in \"Denizin dalgalanması gibi dalgalanacak\" buyurduğu fitneyi soruyorum, dedi. Huzeyfe, Ömer'e \"Ey mu'minlerin emiri! O fitneden sen etkilenmeyeceksin. Çünkü seninle onun arasında kilitli bir kapı vardır\" dedi. Ömer, Huzeyfe'ye \"Kapı kınlacak mı, yoksa açılacak mı?\" diye sordu. Huzeyfe \"Kınlacaktır\" dedi. Ömer \"Demek ki bir daha ebediyyen kapanmayacak\" dedi. Huzeyfe \"Ben evet dedim\" diye ekledi. Biz Huzeyfe'ye \"Ömer kapıyı biliyor muydu?\" diye sorduk. Huzeyfe \"Evet, yarından önce bu gece olduğunu bildiği gibi biliyordu. Sebebine gelince, ben ona öyle bir hadis rivayet ettim ki içinde yalan olan hiçbir şey yoktur\" dedi. Biz \"Kapı kimdir\" diye sormaya cesaret edemedik de Mesruk'a sormasını rica ettik. Mesruk Huzeyfe'ye \"Kapı kimdir?\" diye sordu. O da \"Ömer'dir\" dedi",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 7097,
			"arabicnumber": 7097,
			"text": "Ebu Musa el-Eş'ari şöyle demiştir: Nebi Sallallahu Aleyhi ve Sellem bir gün bir ihtiyacını gidermek için Medine bahçelerinden birine çıktı, ben de onun izi üzerinde arkasından çıktım. Resulullah Sallallahu Aleyhi ve Sellem bahçeye girince onun kapısı önünde oturdum ve kendi kendime \"Ben bugün kendisi bana emretmediği halde Resulullah Sallallahu Aleyhi ve Sellem'in kapıcısı olacağım\" diye ahd ettim. Nebi Sallallahu Aleyhi ve Sellem gidip ihtiyacını gördü ve oradaki kuyunun etrafında oturmak için yapılmış yere oturdu ve baldırıarını açarak ayaklarını kuyunun içine doğru sarkıttı. Bu halde iken Ebu Bekir gelerek yanına girmek için izin istedi. Ben Ebu Bekir'e\" Burada dur. Senin için izin isteyeyim\" dedim. Ebu Bekir durdu. Ben Nebi Sallallahu Aleyhi ve Sellem'e gelip, \"Ey Allah'ın Resulü! Ebu Bekir yanına gelmek için izin istiyor\" dedim. Resulullah Sallallahu Aleyhi ve Sellem \"Ona izin ver ve kendisini cennetle müjdele!\" buyurdu. Ebu Bekir girdi ve Nebi Sallallahu Aleyhi ve Sellem'in sağ yanına gelip oturdu. O da baldırlarını açıp ayaklarını kuyunun içine doğru sarkıttı. Bundan sonra Ömer geldi. Ona da \"Burada dur! Senin için izin isteyeyim\" dedim. Resulullah Sallallahu Aleyhi ve Sellem \"Ona izin ver ve onu da cennetle müjdele\" buyurdu. Ömer gelip, Nebi Sallallahu Aleyhi ve Sellem'in sol tarafına oturdu. O da baldırlarını açıp, ayaklarını kuyuya sarkıttı. Bu suretle kuyunun yanındaki yer doldu ve oturacak başka bir yer kalmadı. Sonra Osman geldi. Ona da \"Olduğun yerde dur! Senin için izin alayım!\" dedim. Resulullah Sallallahu Aleyhi ve Sellem \"Ona izin ver ve kendisine isabet edecek bela ile birlikte cennetle müjdele!\" buyurdu. Osman da bahçeye girdi ve onların yanında oturacak bir yer bulamadı da değişik bir yere çekildi ve nihayet onların karşılarına gelip, kuyunun bir tarafı üzerine oturdu. O da baldırlarını açtı, sonra ayaklarını kuyunun içine sarkıttı. Ebu Musa dedi ki: Ben bu sırada bir kardeşim olmasını temenni etmeye ve onun da buraya gelmesi için Allah'a dua etmeye başladım",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 7098,
			"arabicnumber": 7098,
			"text": "Ebu Vail şöyle anlatmıştır: Üsame'ye \"Şununla konuşsan!\" denildi. Üsame cevaben şöyle dedi: \"Şüphesiz ben onunla konuştum. Ancak ilk açanı ben olarak (fitne) kapısını açmadan! Ben Resulullah Sallallahu Aleyhi ve Sellem'den işittiğim bir sözden sonra insanlardan iki kişi üzerine emir olan bir şahsa \"Sen hayırlısın\" diyecek değilim. Zira Resulullah Sallallahu Aleyhi ve Sellem şöyle buyuruyordu: \"Kıyamet günü bir adam getirilir ve cehenneme atılır da cehennem, eşeğin değirmen taşın döndürerek öğütmesi gibi onu öğütür. Bunun üzerine cehennem halkı da onun başına toplanırlar 'Ey filan! Sen marufu emredip, münkeri yasaklıyar değil miydin?' derler. O da 'Evet, ben marufu emreder ancak kendim yapmazdım ve yine ben münkeri yasaklar, onu da kendim işlerdim\" der. Fethu'l-Bari Açıklaması: AÇIKLAMA’DAN SONRA DA BİR BAB VE HADİSLER VAR \"Denizin dalgalanması gibi dalgalanacak olan fitne.\" İmam Buhari bu başlıkla İbn Ebi Şeybe'nin naklettiği şu hadise işaret eder gibidir: \"Yüce Allah bu ümmete beş fitne vermiştir. \"(İbn Ebi Şeybe, Musannef, VII, 453) Resulullah Sallallahu Aleyhi ve Sellem dört fitneyi zikrettikten sonra beşincisini şöyle anlatmıştır: \"Denizin dalgalanması gibi dalgalanacak olan fitne. Bu fitne esnasında insanlar hayvanlar gibi yani akılsız olacaklardır.\" Bunu Ebu Musa'nın \"O zamanın çoğunluğunun aklı gidecektir\" şeklindeki rivayet ettiği hadis teyid etmektedir. İbn Ebi Şeybe'nin bir başka rivayet yoluyla nakline göre Huzeyfe şöyle demiştir: \"Dinini bildiğin sürece fitne sana zarar vermeyecektir. Asıl fitne hak ile batılı karıştırdığında (zararlı olacaktır}.\"(İbn Ebi Şeybe, Musannef, VII, 468) \"Onlar fitne anında\" yani fitne başgösterdiğinde \"şu beyit1eri örnek edinmeyi severlerdi.\" \"Genç bir dilberdir savaş, ilk baş gösterdiğinde.\" Yani savaş genç kız gibi olur. Bir başka ifade ile savaş ilk çıktığında onu denemeyen kimse uzak durur ve sonra içine girer. Böylece savaş onu yok eder. \"O tutuştuğunda\" Bu ifade savaşın kızışmasının kinayeli anlatımıdır. \"Kocakarı\" Bunun manası savaşın kendisiyle evlenmeyi hiç kimsenin istemediği bir hale geldiğini vurgulamaktır. \"Şamta\" Bu şiirde sözü edilen koca karıyı niteleyen bir kelimedir. Davudl'ye göre bu kadının saçlarının çok çok ağardığının kinayeli anlatımıdır. \"Huzeyfe şöyle demiştir: Ömer'in yanında oturuyorduk.\" Bu hadisin açıklaması Nebilik alametleri bölümünde geniş bir şekilde yapılmıştı. \"Yarından önce bu gece olduğunu bildiği gibi biliyordu.\" Yani onun bilgisi tıpkı yarından önce bugünün olduğu gibi zorunlu bir bilgiydi. İbn Battal şöyle demiştir: Huzeyfe'nin Ömer kendisine en büyük fitneyi sorduğunda özel fitneyi haber vermesinin sebebi, kederlenip, kafasını meşgul etmemesi içindir. Bundan dolayı ona şöyle demiştir: \"Seninle onun arasında kapalı bir kapı vardır. Huzeyfe kapının o olduğunu bildiği halde kendisine \"Kapı sensin\" demedi ve anlayacağı şekilde üstü kapalı olarak ifade edip, açıkça belirtmedi. Bu onun güzel edebindendi. Hz. Ömer \"Kapı kırılırsa bir daha kapanmaz\" sonucunu kırma işleminin ancak galebe çalmakla olmasından çıkarmıştır. Galebe çalmak, ancak fitnede olur. Nebi Sallallahu Aleyhi ve Sellem'in haberinden ümmetin kendi arasında savaşacağı ve kıyamete kadar öldürmenin sürüp gideceği anlaşılmaktadır. Nitekim Şeddad'ın naklettiği bir hadiste buna benzer bir ifade yer almaktadır: \"Ümmetimin içine kılıç (bir defa) girdi mi kıyamete kadar kaldlnlmayacaktır.\" Bu hadisi Taberi rivayet etmiş, İbn Hibban sahih olduğunu belirtmiştir.(İbn Hibban, Sahih, XVI, 220) \"Nebi s.a.v. bir gün bir ihtiyacını gidermek için Medine bahçelerinden birine çıktı.\" Bu hadisin açıklaması Ebu Bekir'in menkıbeleri bölümünde geçmişti. \"Kuffu'l-bi'ri\" tamlaması, kuyunun etrafında oturmak için yapılan yer anlamına gelir. Nebi Sallallahu Aleyhi ve Sellem'in Osman hakkında \"Kendisine isabet edecek beJa\" ifadesine gelecek olursak, İbn Battal şu açıklamayı yapmıştır: Hz. Ömer de öldürüldüğü halde Nebi Sallallahu Aleyhi ve Sellem'in belayı Osman için zikretmesi, Ömer'in onun gibi bir imtihan geçirmemiş olmasından kaynaklanmaktadır. Çünkü halifelikten çekilmesini isteyen bazı insanlar ona musallat olmuşlardı. Zira kendisinin hiç alakası yokken ve ona karşı ileri sürdükleri şeylerden mazur iken zalim ve haksız olarak nitelenmişti. Sonra evine saldırmışlar, aile mahremiyetine dokunmuşlardı. Bütün bunlar öldürülmesine ilaveten fazladan uğradığı haksızlıklardı. Biz de şunu ekleyelim: Kısacası Hz. Osman'a mahsus olan beladan maksat öldürülmesine ilaveten gördüğü birtakım sıkıntılardır. Nitekim aynen böyle olmuştur. \"Üsame'ye şununla konuşsan denildi.\" Burada hem söyleyen ve hem de kendisiyle konuşulması istenen kişi müphem bırakılmıştır. Müslim'in rivayetinde kendisiyle konuşulması istenen kişinin adı şöyle geçmektedir: \"Ona Osman'ın huzuruna girip kendisiyle konuşsan denildi. \"(Müs!im, Zühd) \"Şüphesiz ben onunla konuştum. Ancak ilk açanı ben olarak (fitne) kapısını açmadan!\" Yani işaret ettiğiniz konuda onunla konuştum. Fakat sözümde fitne ve benzeri şeyleri uyandırmaksızın gizlice maslahatı gözetip, edebe uyarak konuştum. \"Eşeğin, değirmen taşlarıyla öğütmesi gibi onu öğütür.\" Süfyan ve Ebu Muaviye rivayetinde \"Bağırsakları dışarıya fırlayacak ve eşeğin döndüğü gibi dönecek\" ifadesi geçmişti. Burada yer alan \"aktab\", \"kıtb\" kelimesinin çoğulu olup, bağırsaklar demektir. \"İndilak\" bağırsakların hızla dışarıya dökülmesi demektir. Arapça'da kılıç herhangi bir kimse tarafından çekilmeksizin kınından çıkarsa bunu \"indeleka's-seyfu min ğımdihi''' cümlesiyle ifade ederler. \"Cehennem halkı onun başına toplanırlar.\" Yani etrafında toplanırlar. \"EtMe bihi'l-kavmu\" bir topluluk onun etrafında dönmeseler bile halka oldular demektir. \"Ben marufu emreder ancak kendim yapmazdım ve yine ben münkeri yasaklar, onu da kendim işlerdim.\" Kadı Iyaz şöyle demiştir: Üsame'nin demek istediği halifeye açıktan tepki koyma kapısını açmak istemediğidir. Çünkü o bunun kötü akıbetinden endişe duyuyordu. Tam tersine ona kibar davranıp, gizlice nasihat etmiştir. Bu, kabul edilmeye daha layık bir tavırdır. \"Üzerime emir olan bir kişi hakkında o insanların hayırlısıdır diyecek değilim.\" Bu ifade de -aslı esası olmayan bir şeyle kuyruk sallayan kimse gibi- hak sözkonusu olduğunda, emirlere yağcılık yapıp, içinden geçenin aksini dışa vurmayı kınama vardır. Üsame güzel görülen mudarat ile kınanmış olan yağcılığa işaret etmektedir. Mudaratın ölçüsü bunu yaparken dine herhangi bir zararın gelmemesidir. Kınanmış yağcılığın ölçüsü ise bunda çirkin olan bir şeyi süsleme, batılı doğru gösterme ve benzeri tavırlar sözkonusudur. Taberi' şöyle demiştir: Selef bilginleri iyiliği emretme konusunda ihtilaf etmişlerdir. Bazı bilginler iyiliği emretmek mutlak olarak vaciptir demişler ve buna delil olarak Tarık b. Şihab'ın naklettiği \"Cihadın en üstünü zalim sultanın huzurunda gerçeği söylemektir\" hadisi ile \"Herhangi biriniz bir kötülüğü görürse bunu eliyle değiştirsin\" hadisinin genelliğini göstermişlerdir. Bazıları ise münkere tepki koymak gereklidir, fakat şartı tepki koyan kimseye öldürülme k ve benzeri gibi daha önce sözkonusu olmayan bir belanın gelmemesidir demişlerdir. Bir başka bilgin grubu ise kişi münkere Ümmü Seleme hadisi dolayısıyla kalpten tepki koyar demişler ve delilolarak onun rivayet ettiği \"Benden sonra başınıza birtakım idareciler gelecek. Onların yaptıklarını kim çirkin görürse sorumluluğundan kurtulur, kim tepki gösterirse selamet bulur. Fakat sorumluluk (yaptıklarına) razı olup, ardından gidenedir\" hadisini delilolarak göstermişlerdir. Bir başkası ise şöyle demiştir: İyiliği emretmek buna gücü yeten ve kendi nefsi için herhangi bir zarar geleceği endişesi duymayan kimseye vaciptiı;. İsterse bunu emreden kimse günah işliyor olsun. Çünkü genelolarak iyiliği emretmek sevap kazandırır. Özellikle emreden kişi, itaat edilen bir şahıs ise. O kişinin özel günahına gelince, Yüce Allah onu bağışlayabilir de, hesaba çekebilir de! \"İyiliği kendisinde hiçbir ayıp ve kusur olmayan kimse ancak emreder\" diyen kimse bununla daha iyiyi kastediyorsa ne ala! Aksi takdirde kendisinden başka bunu yapan bulunmadığı takdirde böyle bir anlayış iyiliği emretme kapısının kapanmasını gerektirir. Taberi şöyle devam eder: \"Yukarıda zikredilen Üsame hadisinde iyilik yapmaları emredilen kimseler nasıloluyor da cehenneme gidiyorlar?\" diye sorulacak olursa cevabımız şudur: Onlar kendilerine emredilene sarılmadılar ve günahlarından dolayı azaba uğradılar. Kendilerine iyiliği emreden kişi ise onlara yasak ettiği şeyi kendisi yaptığı için cehenneme gitti. Bu hadisten emirlere saygı göstermek, onlara edep dairesi içinde davranmak ve insanların haklarında konuştuklarını kendilerine bildirmek gerektiği anlaşılmaktadır. Bundan maksat kötülükten vazgeçmeleri, başkasına eziyet etmeksizin amaca ulaşacak şekilde kibarlıkla ve güzel bir üslupla tedbir almalarıdır. 18. BAB",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 7099,
			"arabicnumber": 7099,
			"text": "Ebu Bekre şöyle demiştir: Yemin olsun ki Allah beni Cemel vakası günlerinde bir kelime ile mükafatlandırmıştır. Resulullah Sallallahu Aleyhi ve Sellem'in kulağına Fars halkının Kisra Perviz'in kızını başlarına hükümdar seçtikleri haberi gidince \"İdarelerini bir kadına veren hiçbir kavim iflah olmamıştır\" buyurmuştu",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 7100,
			"arabicnumber": 7100,
			"text": "Ebu Meryem'in nakline göre Abdullah b. Ziyad el-Esedi şöyle demiştir: Talha, ZUbeyr ve Hz. Aişe Basra'ya doğru yola çıktıkları zaman Hz. Ali, Ammar b. Yasir ve Hasen b. Ali'yi gönderdi. Bunların ikisi Kufe'ye bizim yanımıza geldi. İkisi de minbere çıktı. AIi'nin oğlu Hasen minberin üzerinde üst tarafına geçti. Ammar ise {minber üzerinde} Hasan'den daha aşağıda ayağa kalktı. Bizler onu dinlemek üzere toplandık. Ebu Meryem dedi ki: Ben Ammar'dan şöyle derken işittim. Hz. Aişe Basra'ya doğru yürümüştür ve Allah'a yemin ederim ki Hz. Aişe elbette dünyada ve ahirette sizin Nebiinizin eşidir. Fakat Allah Teala Ali b. Ebi Talib'e mi itaat ediyorsunuz, yoksa Hz. Aişe'yi mi itaat ediyorsunuz diye belli etmek için Hz. Aişe ile sizleri imtihan etmiştir",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 7101,
			"arabicnumber": 7101,
			"text": "Ebu Vail şöyle demiştir: Ammar b. Yasir, Kufe minberi üzerinde ayağa kalkarak Hz. Aişe'den ve onun {Beraberindekilerle} Basra'ya doğru yürüyüşünden söz etti ve \"Muhakkak ki Hz. Aişe dünyada da, ahirette de sizin Nebiinizin eşidir, fakat o, kendisi ile imtihan olunduğunuz zatlardan biridir\" dedi",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 7104,
			"arabicnumber": 7104,
			"text": "",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 7107,
			"arabicnumber": 7107,
			"text": "",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 7108,
			"arabicnumber": 7108,
			"text": "İbn Ömer'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"Allah bir kavme azap indirince, o kavim içinde bulunan her ferde azap gelir. Sonra herkes kendi amellerine göre diriltilir\" buyurdu. Fethu'l-Bari Açıklaması: ''Allah'ın bir topluluğa azap indirmesi.\" Yani Allah'ın, bir kavme kötü amellerine ceza olarak azap indirmesi. \"Sonra herkes kendi amellerine göre diriltilir.\" Yani onlardan her bir fert, kendi ameline göre diriltilir. Ameli salih ise akıbeti salih, aksi takdirde kötü olur. Bu azap, salihler için temizlik, fasıklar için intikam olmuş olur. İbn Hibban'ın Sahih'inde Aişe r.anha'nın nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Yüce Allah aralarında salih kimseler olduğu halde cezasını hak edenlere darbesini indirdiğinde salih kimseler de onlarla birlikte aynı darbeye maruz kalırlar. Sonra herkes kendi niyetine ve ameline göre diriltilir. \"(İbn Hibban, Sahih, XVI, 305) İbn Battal şöyle der: Bu hadis, Zeynep bnt. Cahş hadisini açıklamaktadır. Zeynep, Res.ulullah Sallallahu Aleyhi ve Sellem'e \"İçimizde bu kadar salih kimseler varken biz helak or muyuz?\" diye sormuş, Resulullah Sallallahu Aleyhi ve Sellem \"Evet, fısk u fücur çoğaldığı zaman (helak olursunuz)\" cevabını vermiştir. Münker açığa vurulup, günahlar alenen işlendiğinde herkes helak edilir. Biz de şunu ekleyelim: İbn Battal'ın son sözüne uygun düşen Hz. Ebu Bekir'in naklettiği şu hadistir: \"İnsanlar bir münkeri görür de onu değiştirmezlerse Yüce Allah'ın onların tümüne ceza vermesi yakındır.\" Bu hadisi Sünen imamları rivayet etmiş, İbn Hibban sahih olduğunu belirtmiştir. (İbn Hibban, Sahih, 1,540; Ebu Dawd, Melahim; İbn Mace, Rten; Tirmizi, Tefsir Maide) Bunun bir benzeri Hz. Aişe radıyallilhu anha'nın naklettiği şu hadistir: \"Hayret vericidir ki ümmetimden bazı kimseler Beytullah'a sığınmış bir adamı (yakalamaya) yönelirler. Onlar daha çölde iken yerin dibine batırılırlar.\" Biz \"Ya Resulallah! Bazen yolda her çeşit insan bulunabilir\" dedik. Resulullah Sallallahu Aleyhi ve Sellem \"Evet! Bunların aralarında oraya kasten yola çıkan olduğu gibi, istemeden çıkan, onlardan olmadığı halde onlarla birlikte bulunan olabi/ir. Bunların tümü helak olup gider ancak değişik şekilde dirilirler. Yüce Allah onları niyetlerine göre diri/tir\" buyurdu.(Müs!im, fiten) Müslim'in, Ümmü Seleme'den de buna benzer bir nakli vardır: \"Ben Ya Resulallah! Buna istemeden katılanın durumu nasılolur?\" diye sordum. Resulullah sallallilhu aleyhi ve sellem \"O da onlarla birlikte yerin dibine batırılır, fakat kıyamet günü niyetine göre diri/ir.\" buyurdu.(Müs!im, fiten) Onun Cabir'den de bir nakli daha vardır. Buna göre Resulullah Sallallahu Aleyhi ve Sellem \"Her kul öldüğü şekil üzere diri/ir\" buyurmuştur. Davudi şöyle der: İbn Ömer hadisinin manası şudur: \"Küfürlerinden dolayı azaba uğrayan milletlerin içerisinde çarşı-pazarlarda alışveriş edenler ve onlardan olmayanlar bulunabilir. Bunların tümü eceııeriyle ölür. Ancak kıyamet günü kendi ameııerine göre dirilirler.\" Kısacası aynı ölümü paylaşmak, aynı sevabı veya cezayı paylaşmayı gerektirmez. Tam tersine her bir ferde kendi niyetine göre amelinin karşılığı verilir. İbn Ebi Cemre bu akıbete uğrayan kimselerin başına bunun gelmesi, marufu emretmeyerek, münkeri yasaklamayarak sessiz kalmaları olduğu kanaatini benimsemiştir. İyiliği emredip, kötülüğü yasaklayanlar ise gerçek mu'minlerdir. Yüce Allah onların başlarına azap göndermez. Tam tersine azabı onlardan savuşturur. Nitekim şu ayetler bu anlayışı teyit etmektedir: \"Zaten biz ancak halkı zalim olan memleketleri helak etmişizdir. \"(Kasas,59) \"Halbuki sen onların içinde iken Allah onları azap edecek değildir ve onlar mağfiret dilerlerken de Allah onlara azap edici deği/dir. \"(Enfal 33) Kendisi yapmasa bile kötülüğü yasaklamayanların başına azabın geleceğini şu ayet-i kerime göstermektedir:: \"Allah'ın ayetlerinin inkar edildiğini yahut onlarla alayedildiğini işittiğiniz zaman, onlar bundan başka bir söze dalıneaya kadar kafirlerle beraber oturmayın yoksa siz de onlar gibi olursunuz. \"(Nisa 140) Bu ayetten kafirlerden ve zalimlerden kaçmanın meşru olduğu hükmü anlaşılmaktadır. Çünkü onlarla birlikte bulunmak, insanın kendisini tehlikeye atması anlamına gelmektedir. Bu, kişinin onlara yardım etmediği ve yaptıklarına razı olmadığında sözkonusudur. Buna karşılık onlara yardım eder veya yaptıklarından hoşlanırsa artık onlardan olur. Nitekim Nebi Sallallahu Aleyhi ve Sellem'in Semud diyarından çıkmakta acele etme emri vermesi bunu teyit etmektedir. İnsanların kendi amellerine göre dirilmeleri adil bir hükümdür. Çünkü onlar ahirette yaptıkları salih amellerin karşılığını alacaklardır. Dünyada ise başlarına hangi bela gelirse gelsin bu yaptıkları kötü amelin kefareti olacaktır. Dolayısıyla dünyada zulmedenlerin üzerine gönderilecek olan azap, onlarla birlikte bulunup, yaptıklarına ses çıkarmayanlara da gelecektir. Bu onların yağcılıklarına bir cezadır. Sonra kıyamet günü her bir fert dirilecek ve kendi amelinin karşılığını alacaktır. Bu hadis-i şerif kötülüğü yasaklamayan kimselere bir uyarı ve büyük bir korkutma niteliklidir. Onların hali bu olduğuna göre yağcılık yapanların hali nice olacaktık! Yapılanlara razı olanların durumu nice olacaktır! Onlarla iş birliği yapanların durumu nice olacaktır! Yüce Allah'tan esenlik dileriz. Biz de şunu ekleyelim: İbn Ebi Cemre'nin açıklamasından çıkan zorunlu sonuç şudur: Asilerin yaptıklarından dolayı itaatkarlara dünyada azap gelmez. Kurtubi et-Tezkire'de bu yaklaşıma meyletmiştir. Az önce yaptığımız açıklama bu hadisin zahirine çok daha yakındır. Bunun bir benzerini Kadı İbnü'l-Arabi benimsemiştir. Bu konu, Zeynep bnt. Cahş'ın naklettiği hadis açıklanırken ele alınacaktır. Zeynep \"İçimizde bu kadar iyi kimseler varken biz helak edilir miyiz?\" diye sorunca, Resulullah Sallallahu Aleyhi ve Sellem \"Evet, fısk u füeur çoğa/dığı zaman {helak olursunuz)!\" diye cevap vermiştir. Bu hadis Fiten bölümünün sonunda gelecektir",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 7109,
			"arabicnumber": 7109,
			"text": "Süfyan b. Uyeyne şöyle anlatmıştır: Bize İsrail Ebu Musa el-Basri rivayet etti. Onunla Kufe'de karşılaştım. O, Kufe kadısı Abdullah b. Şubrime'nin yanına gelmişti. Ona \"Beni Kufe emiri İsa b. Musa'nın huzuruna al da ona vaaz edeyim!\" dedi. İbn Şübrime, İsrail'e emirden bir tehlike gelir diye korktu da bunu yapmadı. İsrail şöyle dedi: \"Bize Hasan-ı Basrl şöyle anlatt•t: Ali'nin oğlu Hasan, Muaviye b. Süfyan'ın üzerine büyük birliklerle yürüdüğü zaman Amr b. eı-As, Muaviye'ye 'Ben arkada olanları geri dönmedikçe geri dönüp kaçmayacak olan bir ordu görüyorum' dedi. Muaviye Amr'a (babaları öldürülürse) Müslümanların çocuklarına bakmayı bana kim tekeffü! eder?\" dedi. Amr \"Ben tekeffül ederim\" dedi. Bundan sonra Abdullah b. Amir ile Abdurrahman b. Semura \"Biz Muaviye ile karşı karşıya gelir ve ona barış istemesini söyleriz\" dediler. Hasan-ı Basrı şöyle dedi: \"Yemin olsun ki ben Ebu Bekre'den işittim. Şöyle dedi: Resulullah Sallallahu Aleyhi ve Sellem minberde hutbe okurken torunu Hasan içeriye girdi. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem \"Şüphesiz bu benim oğlum bir seyyiddir. Umarım ki Allah bu oğlum sebebiyle Müslümanlardan iki büyük fı rkan ın arasını düzeltir\" buyurdu",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 7110,
			"arabicnumber": 7110,
			"text": "Usame'nin azatlısı Harmele şöyle anlatmıştır: -Amr b. Dinar 'Ben bu Harmele'yi görmüşümdür' demiştir.' -Usame b. Zeyd beni Ali'nin yanına gönderdi ve ona şöyle dedi: Ali senden şimdi soracak ve \"Arkadaş ın Üsame neden bana yardım etmekten, yanımda yer almaktan geri kaldı?\" diyecektir. Ali'ye şöyle de: Üsame sana şunu söylüyor: Eğer sen bir aslanın ağzının içinde olaydın, orada seninle beraber olmayı arzu ederdim. Fakat bu meseleyi (Müslümanlarla çarpışmayı) doğru bulmuyorum. Harmele olayın devamını şöyle anlattı: Ben bu sözü getirip, Ali'ye haber verdim, fakat bana hiçbir şey vermedi. Sonra Hasen, Hüseyin ve İbn Cafer'in yanına gittim. Onlar binek devemi ağır yüklerle yüklediler. Fethu'l-Bari Açıklaması: \"İsrail Ebu Musa.\" Bu İsrail'in künyesidir. İsrail, Basralı olup, ticaret maksadıyla Hindistan'a gider gelirdi ve orada bir süre kalırdı. \"Onunla Kufe'de karşılaştım.\" Bu sözü söyleyen Süfyan b. Uyeyne'dir. \"İbn Şübrüme'ye geldi.\" İbn Şübrüme, Ebu Cafer el-Mansur'un halifeliği döneminde Kufe kadılığı yapan Abdullah'tır. İbn Şübrüme, Ebu Cafer'in halifeliği zamanında 144 senesinde vefat etmiştir. Kendisi tavizsiz, iffetli, güvenilir ve fakih bir aHmdi. \"Beni Kı1fe emiri İsa b. Musa'nın huzuruna al da ona vaaz edeyim.\" Burada adı geçen İsa, Mansur'un kardeşinin oğlu İbn Musa b. Muhammed b. Ali b. Abdullah b. Abbas'tır. Kendisi o zamanlar Kı1fe emiri idi. \"İbn Şübrüme, İsrail'e emirden bir tehlike gelir diye korktu da bunu yapmadı.\" Yani onu .İsa b. Musa'nın huzuruna almadı. Herhalde bunun sebebi onun canından endişe duymasıydı. Çünkü o gerçeği bütün çıplaklığıyla söyleyen biriydi. Bundan dolayı İsa'ya kibar davranmayacağından ve onun da karşı tepki olarak gençliğin ve iktidarın verdiği gafletle ona gaddar davranacağından korktu. İbn Battal şöyle demiştir: İbn Şübrüme'nin bu uygulaması, bir kimsenin canına kastedileceğinden endişe duyduğu takdirde iyiliği emredip, kötülüğü yasaklama yükümlülüğünün üzerinden düşeceğini göstermektedir. Bu olayda adı geçen İsa, el-Mehdl'nin halifeliği döneminde 168 yılında vefat etmiştir. \"Ali'nin oğlu Hasan, Muaviye b. Ebi Süfyan'ın üzerine büyük birliklerle yürüdüğü zaman.\" Sulh bölümünde Abdullah b. Muhammed'in nakline göre Süfyan şöyle anlatır: \"Vallahi el-Has en b. Ali, Muaviye'yi dağlar gibi birliklerle karşıladı.\" Hadiste geçen \".........\" kelimesinin çoğuludur. Ketıbe, bir araya gelmiş büyük bir askeri birlik demektir. İbn Battal şöyle demiştir: el-Hasen Muaviye'ye halifelik işini teslim etti ve Allah'ın kitabı, Nebiinin sünnetini uygulamak şartıyla ona bey'at etti. Muaviye, KMe'ye girdi. Halk kendisine bey'at etti. Bu yıla insanlar bir araya geldiği ve savaş kesildiği için \"Senetü'l-cemaa\" adı verildi. İbn Ömer, Sa'd b. Ebi Vakkas, Muhammed b. Mesleme gibi savaşmaktan kaçınma fikrinde olan herkes, Muaviye'ye bey'at etti. Muaviye, el-Hasen'e üç yüz milyon elbise, otuz köle ve yüz deve verdi ve sonra Medine'ye döndü. Muaviye de KMe'ye el-Muğire b. Şu'be'yi, Basra'ya Abdullah b. Amir'i vali tayin etti. Kendisi ise Dımaşk'a dc,ndü. ''Amr b. eı-As, Muaviye'ye 'Ben arkada olanları geri dönmedikçe geri dönüp kaçmayacak olan bir ordu görüyorum' dedi.\" Yani mukabilinde olan geri dönmedikçe, geri dönüp kaçmayacak olan bir ordu görüyorum dedi. Sulh bölümünde Abdullah b. Muhammed'in rivayetinde şu ifade geçmişti: \"Ben öyle birlikler görüyorum ki akranını öldürmedikçe geri dönmez.\" Bu daha açıktır. \"Muaviye Amr'a (babaları öldürülürse) Müslümanların çocuklarını bakmayı bana kim tekeffül eder?\" dedi.\" Yani onların babaları öldürüldüğü takdirde kendilerini bakmayı kim üstlenir? Sulh bölümünde geçen rivayette şöyle bir cümle yer almaktaydı: \"Muaviye ona dedi ki: -Vallahi o, iki kişinin en hayırlısıydı.- Ey Amr! Bunlar, bunlar, şunlar, şunlar öldürüldüğü takdirde insanların işlerini görmeyi benim adıma kim üstlenecek? Kadınlarına benim adıma kim bakacak? Çocuklarına ve zayıflarına benim adıma kim bakacak?\" Muaviye bu sözüyle her iki ordunun askerlerinin her iki bölgedeki insanların büyük bir kısmını teşkil ettiğine işaret ediyor ve bunlar öldürüldüğü takdirde insanların durumunun kötüye gideceğini, onların ardından halkın ve çocuklarının durumlarının bozulacağını söylemek istiyordu. ''Abdullah b. Amir ile Abdurrahman b. Semura 'Biz Muaviye ile karşı karşıya gelir ve ona barış istemesini söyleriz'\" dediler. Yani ona barış teklif ederiz demek istediler. Bu ifadenin zahirinden anlaşılan, onların buna bilfiil başladıklarıdır. Sulh bölümünde ise o iki ismi Muaviye'nin gönderdiği geçmişti. Bu iki haberi Abdullah ve Abdurrahman kendilerini Muaviye'ye teklif ettiler, o da onların görüşüne katıldı diyerek cem ve telif etmek mümkündür. \"Muaviye dedi ki: Bu kişiye gidin ve ona\" dilediği kadar mal \"teklif edin ve deyin ki\" yani Müslümanların kanlarını sulh yoluyla kurtarma konusunda onunla konuşun ve \"Kendisinden isteyin\" yani ondan halifelik davasından geri çekilmesini ve görevi Muaviye'ye teslim etmesini isteyin. Ona da bunun karşılığında dilediği malı verin. el-Hasen b. Ali onlara şöyle dedi: \"Biz Abdulmuttalib'in çocuklarıyız. O maldan bizde de var. Bu ümmet kanı uğruna birbirini öldürdü.\" Abdullah'la, Abdurrahman şöyle dediler: \"Muaviye sana şunları şunları teklif ediyor, senden istiyor ve talep ediyor.\" el-Hasen \"Bunları bana kim garanti eder?\" diye sordu. Abdullah'la, Abdurrahman \"Biz bunları sana garanti ediyoruz\" dediler. el-Hasen onlardan ne istediyse, onlar \"Biz bunu sana tekeffül ediyoruz\" dediler. Bunun üzerine onlarla barıştı. \"(Buhari, Sulh) İbn Battal şöyle demiştir: Bu, Muaviye'nin sulh istediğini ve el-Hasen'e mal teklif edip, onda barış isteği uyandırdığını, kılıcı geri çekmeyi teşvik ettiğini ve dedesinin onun sebebiyle ıslah konusunda seyyid olacağı vaadini hatırlattığını göstermektedir. el-Hasen ona şöyle cevap vermiştir: \"Biz Abdulmuttalib'in çocuklarıyız. O maldan bizde de var.\" Yani bizler cömert ve bize tabi olan aile ve azatlılarımıza genişlik sağlama karakterinde yaratılmışız. Bizler bunu halifelikle birlikte başarıyorduk. Böylece sözkonusu tutum bizim için bir adet haline gelmiştir. el-Hasen \"Bu ümmet\" ifadesiyle Şam ve Irak ordularını kastetmektedir. \"Kad aset\" fiili onlar birbirlerini katletti demektir. Bundan ancak geçmişte yaptıklarını bağışlamakla ve mal verip birbirlerine kaynaşmakla vazgeçerler. el-Hasen yaptığı bu konuşmalarla fitneyi yatıştırmak ve maldan başkasıyla gönlü olmayacaklara mal dağıtmak istemiştir. Abdullah ve Abdurrahman onun ileri sürdüğü bütün şartları uygun görmüşler ve kendisine her yıl adı geçenlerin ihtiyaç duyacakları mal, elbise ve azıktan verileceği taahhüdünde bulunmuşlardır. Hadisten Çıkan Sonuçlar 1- Bu olay Nebilik alametlerinden ve el-Hasen b. Ali'nin menkıbelerinden biridir. Çünkü o iktidarı taraftarı az olduğu için terk etmediği gibi, bir zilletten veya hastalıktan da bırakmış değildir. Tam tersine Allah katında olanı istediği için vazgeçmiştir. Zira o bu tavrının Müslümanların kanlarını koruyacağını düşünmüştür ve böylece dini ve ümmetin masıahatını gözetmiştir. 2- Bu olay Hz. Ali ile beraberinde bulunanları, Muaviye ile taraftarlarını tekfir eden Haridiere bir cevaptır. Zira Resulullah Sallallahu Aleyhi ve Sellem her iki zümreyi \"Müslüman\" olarak nitelemektedir. Buradan hareketle Süfyan b. Uyeyne bu hadisin sonunda şöyle demiştir: Nebi Sallallahu Aleyhi ve Sellem'in \"mine'lmüslimın\" ifadesi, bizi son derece hayrette bırakmıştır. 3- Hadis Müslümanların arasını düzeltmenin, özellikle de bunda onların kanlarını koruma niteliği varsa faziletli olduğunu göstermektedir. Bu olay Muaviye'nin halka şefkatli olduğunu, Müslümanlara şefkatle yaklaştığını ve iktidarı çekip çevirmedeki ileri görüşlülüğünü, geleceği görmedeki yeteneğini göstermektedir. 4- Halifeliğe daha uygunu varken ondan daha aşağı mertebedeki birisi geçebilir. Çünkü Bedir savaşına katılmış olan Sa'd b. Ebi Vakkas ve Said b. Zeyd hayatta oldukları halde el-Hasen ve Muaviye'den her biri hilafet makamına geçmişlerdir. Bu görüş İbnu't-Tın'e aittir. 5- Bir halife Müslümanlar için fayda gördüğü takdirde kendi kendine halifelikten çekilebilir, dini ve dünyevi vazifelerini mal karşılığında bırakabilir. Bunun için mal almak ve şartlarını yerine getirdikten sonra onu vermek caizdir. Bunun şartı, lehine görevden çekinilen kişinin görevi terk edenden daha uygun olması ve verilen mal veren kimsenin şahsi malı olmasıdır. Çekilme kamu görevinden çekilme şeklinde olup, verilen mal da beytü'lmalden ise bu durumda masıahatın ve menfaatin halk yararına olması şarttır. İbn Battal bu hususa işaret ederek şöyle demiştir: Mal veren ve onu alan kişilerden her birinin görev konusunda dayanacağı bir sebebi ve esas alacağı bir görev akdi olmalıdır. 6- Seyyidlik en faziletli olana mahsus değildir. Tam tersine o kavmin başkanıdır. Kelimenin çoğulu \"sade\" şeklindedir. Bu kelime \"es-su'det\" kökünden türemedir. Bazıları seyyidin kalabalık bir insan grubuna başkan olmasını gözünün önüne alarak bunun \"es-sevad\" kökünden türediğini söylemişlerdir. \"es-Sevad\" çok sayıda insan demektir. Mühelleb şöyle demiştir: Seyyidlik insanların kendisinden yararlandığı kişinin hakkıdır. Çünkü seyyidlik ıslaha bağlanmıştır. 7- Kızın oğluna \"oğul\" denebilir. Annenin babası olan dedenin karısı kızının oğluna haram olduğu, kızın oğlunun karısının da o dedeye haram olduğu noktasında -bunlar miras almada birbirlerinden farklı olmakla birlikte- icma vardır. 8- Hz. Ali halifeliğe daha layık ve hakka daha yakın olduğu halde Muaviye ve Ali' den hiçbirinin yanında savaşa katılmayanların görüşlerinin doğru olduğu bu hadisten anlaşılmaktadır. Sa'd b. Ebi Vakkas, İbn Ömer, Muhammed b. Mesleme ve bu savaşlardan ayrılan diğer kişilerin görüşleri bu doğrultudadır. Ehl-i sünnet alimlerinin çoğunluğu \"Eğer mu'minlerden iki grup birbiriyle vuruşurlarsa aralannı düzeltin\"(Hucurat 9) ayet-i kerimesini esas aldıkları için Hz. Ali'nin yanında çarpışanların isabetli hareket ettikleri kanaatine varmışlardır. Ayet-i kerimede meşru devlet başkanına isyan eden kimselerle (bağı) savaşma emri verilmektedir. Hz. Ali'ye karşı çarpışanların bağı oldukları sabittir. Çoğunluğu oluşturan bilginler bu görüşlerinin yanında bunlardan hiçbirini kınamama konusunda ittifak etmişlerdir. Çoğunluk onlar \"içtihat edip, hata ettiler\" demektedirler. Ehl-i sünnetten az bir zümre ise -Mutezile mezhebinin çoğunluğu da bu görüştedir- her iki grubun isabetli olduğunu söylerken, bir başka grup isabetli olanın muayyen olmayan bir zümre olduğunu söylemişlerdir. \"Üsame b. Zeyd beni gönderdi.\" Yani Medine'den gönderdi. \"Ali'nin yanına\" yani KCıfe'deki Ali'ye gönderdi. Ravi burada mesajın içeriğinden söz etmiyor. Ancak \"fakat bana hiçbir şey vermedi\" ifadesi Üsame'nin onu Ali'den biraz mal istemek üzere gönderdiğini ifade etmektedir. \"Üsame, Harmele'ye dedi ki: Ali senden şimdi soracak ve 'Arkadaş ın Üsame bana yardımdan niçin geri kaldı?' diyecektir.\" Bunu Üsame, Ali'ye yardımdan geri kalmasının mazereti olarak hazırlamıştı. Çünkü o Ali'nin kendisine yardımdan geri kalanlara özellikle ehl-i beytine mensup Üsame gibi birisinin geri kalmasına tepki göstereceğini biliyordu. Bundan dolayı Üsame, kendisinin canına çok düşkün olduğu ve Ali'yi sevmediği için ona yardımdan geri kalmadığını, Ali en korkunç bir mekanda bile olsa onunla birlikte olmayı ve kendisine destek çıkmayı sevdiğini, ancak Müslümanlarla çarpışmaktan hoşlanmadığı için geri kaldığını ifade etti. \"Fakat bu meseleyi (Müslümanlarla çarpışmayı) doğru bulmuyorum\" cümlesi bunu ifade etmektedir. \"Hasen, Hüseyin ve İbn Cafer'in yanına gittim. Onlar binek devemi ağır yüklerle yüklediler.\" Yani benim için deveme götürebileceği kadar mal yüklediler",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 7111,
			"arabicnumber": 7111,
			"text": "Nafi şöyle anlatmıştır: Medine ahalisi Yezid b. Muaviye'ye bey'at etmekten caydıkları zaman İbn Ömer kendi maiyetini ve oğlunu topladı ve onlara hitaben şöyle dedi: Nebi Sallallahu Aleyhi ve Sellem'den işittim \"Verdiği sözde durmayıp cayan her bir kişi için kıyamet gününde bir bayrak dikilir\" diyordu. Bizler bu adama Allah'ın ve Resulünün bey'at emri üzere bey'at ettik ve ben bir kimsenin bir adama Allah'ın ve Resulünün bey'at emri üzere bey'at edilip de sonra savaş bayrağı dikilmesinden daha büyük bir sözden cayma bilmiyorum Sizden herhangi birinin Yezid'in bey'atinden caydığını ve başkasına bey'at ettiğini öğrenirsem, şayet böyle bir şey olursa bu tavır, aramızdaki ilişkiyi bitirir",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 7112,
			"arabicnumber": 7112,
			"text": "Ebu'l-Minhal şöyle demiştir: İbn Ziyad ve Mervan Şam'a hakim oldukları, Abdullah b. Zübeyr de Mekke'de harekete geçtiğinde, Basra'da kura ilimle uğraşanlar yine hilafete karşı isyan ettiklerinde, babamla birlikte Ebu Berze el-Eslemi'nin yanına gittik ve evinde bulunduğu sırada huzuruna girdik. Ebu Berze kendisine ait kamıştan yapılmış yüksek bir odanın gölgesinde otururken huzuruna girdik ve yanında oturduk. Babam ondan hadis rivayet etmesini istedi. Ona \"Ey Ebu Berze! İnsanların içine düştükleri hali görmez misin?\" dedi. Onun ilk konuştuğunda işittiğim sözü şu oldu: \"Şüphesiz benim Allah katında sevap beklediğim şeylerden biri, Kureyş'ten birtakım kabileiere öfke duyar oluşumdur. Şüphesiz sizler ey Arap topluluğu, sizler bilmekte olduğunuz şu illet, azlı k veya sapıklık hali üzere idiniz ve muhakkak ki Allah sizleri İslam dini ve Muhammed ile kurtardı. Nihayet şu gördüğünüz seviyeye ulaştınız. Şu dünya aranızı ifsat edip bozdu ve şu Şam' da bulunan zat vallahi eğer savaşırsa dünyalık elde etmekten başka bir amaçla savaşmaz. Şu sizlerin aranızda bulunan kimseler vallahi savaşırlarsa muhakkak dünyalık elde etmek için savaşırlar ve şu Mekke' de bulunan kimse de eğer savaşırsa mutlaka dünyalık elde etmek için savaşır",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 7113,
			"arabicnumber": 7113,
			"text": "Huzeyfe b. el-Yeman şöyle demiştir: Bugün zamanımızda münafıklar Nebi Sallallahu Aleyhi ve Sellem zamanındaki münafıklardan daha beterdirler. Çünkü o zamanki münafıklar nifaklarını gizlerlerdi. Bugünküler ise bütün bütün açığa vuruyorlar",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 7114,
			"arabicnumber": 7114,
			"text": "Huzeyfe şöyle demiştir: Münafıklık Nebi s.a.v. zamanında idi. Bugün ise nifak, imandan sonra küfürdür. Fethu'l-Bari Açıklaması: \"Bir kavmin yanında bir şey söyleyip sonra oradan çıkınca söylediğinin aksini söyleme.\" İmam Buhari bu konuda İbn Ömer'in rivayet ettiği \"Verdiği sözde durmayıp cayan her bir kişi için kıyamet gününde bir bayrak dikilir\" hadisine yer vermiştir. Bu konuda İbn Ömer'in Yezid b. Muaviye'ye bey'atle ilgili olarak yaşadığı bir olay vardır. İmam Buhari yine dünyalık elde etmek için iktidar uğruna çarpışan kimselere tepkisini konu alan Ebu Berze hadisine yer vermekte, ardından Huzeyfe'nin münafıklarla ilgili ifadesini zikretmektedir. Son ifadenin atılan başlığa olan uygunluğu gayet açıktır. Birinci rivayetin başlıkla uygunluğu ise arkadan konuşmanın, yüzüne konuşmaktan başka olmasının bir çeşit verilen sözden dönme olmasındandır. Ahkam bölümünde \"Bir kimsenin Sultanı Yüzüne Karşı Överken Dışarı Çıktığında Bunun Aksini Konuşmasının Çirkinliği\" şeklinde bir başlık gelecektir. İmam Buhari orada İbn Ömer'in emirlerin huzurunda oradan çıkınca söylenenlerin aksini söyleyen kimselerin durumunun ne olacağı şeklindeki soruya \"İbn Ömer \"Biz bu hareketi (Nebi zamanında) münafıklık sayıyorduk\" şeklindeki sözüne yer vermiştir. \"Medine ahalisi Yezid b. Muaviye'ye bey'at etmekten caydıkları zaman.\" elİsmallı'de şu ifade yer almaktadır: Muaviye İbn Ömer'in Yezid'e bey'at etmesini isteyince, İbn Ömer bunu kabul etmedi ve \"Her iki emire de bey'at etmiyorum\" dedi. Bunun üzerine Muaviye ona yüz bin dirhem para gönderdi. İbn Ömer paraları aldı. Akabinde de bir kişiyi göndererek \"Biat etmene man i olan nedir?\" diye sordurdu. İbn Ömer \"Bu, bunun içindir -yani bu paranın bağışlanması bey'atin gerçekleşmesi içindir.- Benim dinim o takdirde nazarımda çok ucuz olmuş olur\" dedi. Muaviye ölünce İbn Ömer, Yezid'e bey'atini bildirmek üzere mektup yazdı. \"Medine ahalisi Yezid b. Muaviye'ye bey'at etmekten caydıkları zaman.\" Hadisin kalan kısmı yukarıda zikredildiği gibidir. Biz şunu ekleyelim: Bunun sebebi Taberl'nin Yezid b. Muaviye'ye isnat ederek zikrettiği şu olaydır: Yezid, Medine'ye amcasının oğlu Osman b. Muhammed b. Ebu Süfyan'ı vali tayin etmişti. Vali Osman, aralarında melekler tarafından yıkanan Hanzala b. Ebu Amir'in oğlu Abdullah b. Hanzala, Abdullah b. Ebu Amr b. Hafs el-Mahzumı olmak üzere Medine halkından bir grubu Yezid' e gönderdi. Yezid onlara ikram etti ve birtakım hediyeler verdi. Heyet geri dönünce Yezid'in ayıp ve kusurlannı sayıp dökmeye başladı. Onun içki içtiğini söyleyip daha başka iddialarda bulundular. Sonra Osman'ın üzerine çullanıp, onu valilikten azlettiler. Yezid b. Muaviye'ye bey'at etmekten vazgeçtiler. Bu olay Yezid'in kulağına gidince, onlara karşı Müslim b. Ukbe el-Mürrı'nin kumandasında bir ordu hazırladı. Ona Medine halkına üç gün çağrıda bulunmasını emretti. \"Eğer bu görüşlerinden dönerlerse ne ala! Dönmezlerse onlarla çarpış. Medine'ye galip geldiğinde üç gün süreyle orduya izin ver, sonra saldırıdan vazgeç\" diye emretti. Ordu kumandanı Medinelilerin üzerine yürüdü. Hicrı30 yılının zilhicce ayında oraya ulaştı ve Medine ahalisiyle çarpıştı. Ensarın emiri Abdullah b. Hanzala idi. Kureyş'in başında Abdullah b. Mutl', diğer kabileierin başında ise Mukbil b. Yesar el-Eşcaıbulunuyordu. Bunlar bir hendek kazdılar. Savaş başlayınca Medine ahalisi yenildi. İbn Hanzala öldürüldü. İbn Mutl' kaçtı. Müslim b. Ukbe, Medinede üç gün süreyle orduya izin verdi. Aralarında Ma'ki! b. Sinan, Muhammed b. Ebu'l-Cehm b. Huzeyfe, Yezid b. Abdullah b. Zem'a bulunmak üzere bir grup çembere alınarak kat/edildi. Kalanlarıyla Yezid'e bağlanmaları şartıyla anlaşma yaptı. \"Haşemehu\" İbnu't-Tın, bu kelimenin burada hizmetçileri ve maiyeti anlamına olduğunu söylemiştir. Hadisten Çıkan Sonuçlar 1- Bey'at almış olan yöneticiye itaat vaciptir, idaresinde zalim bile olsa ona isyan edilemez ve böyle bir idareci, fasıklık yapmakla görevinden çekilmiş sayılmaz. \"Şu sizlerin aranızda bulunan kimseler.\" Yezid b. Zurey' ve İbnü'l-Mübarek'in rivayetine göre Ebu Berze \"Şu etrafınızda bulunan ve kurranız olduğunu iddia ettiğiniz kimseler\" demiştir. Sikkın'in rivayetine göre Nafi b. el-Ezrak'tan da söz etmiş ve son kısmında şöyle demiştir: \"Babam 'o halde bana ne emredersin?' dedi. Ben senin hiç kimseyi terk ettiğini görmüyorum. O da şöyle dedi: Bugün ancak karınıarı insanların malından boş, sırtları kanlarından hafif olan topluluğu hayırlı görüyorum\" demiştir. Sikkın'in rivayetine göre \"İnsanların içinde bana en sevimli olanı kursakları insanların mallarından boş, sırtları kanlarından hafif olan şu topluluktur demiştir.\" Bu ifade Ebu Berze'nin fitne zamanı bir köşeye çekilmek gerektiği ve Müslümanlarla savaşla ilgili olarak hiçbir şeye katılmamak, -özellikle bu savaş bir iktidar talebi uğruna ise- tarafsız kalmak gerektiği şeklinde idi. 2- Fitne baş gösterdiğinde alimlerle ve dini yaşayan kimselerle danışmalarda bulunmak gerekir. Bir alim de görüşüne başvuran kimseye gerekli nasihatı vermekle yükümlüdür. 3- Bir münkeri işleyene arkasından bile olsa sözlü tepki göstermekle yetinmek mümkündür. Çünkü bu tepkiyi duyan kimse bundan öğüt alır ve o münkere düşmekten kaçınır",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 7115,
			"arabicnumber": 7115,
			"text": "Ebu Hureyre r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem 'Hayattaki bir kişi kabirdeki bir adam'ın yanından geçerken 'Keşke şu ölünün yerinde ben olaydım' diye ölümü temenni etmedikçe kıyamet kopmaz' buyurmuştur. Fethu'l-Bari Açıklaması: \"Kabirlerde olanlar (diriler tarafından) gıpta edilmedikçe kıyametin kapmayacağı.\" Hadiste yer alan \"gıpta\", gıpta edilen kimse aynı durumda kalmak şartıyla onun gibi olmayı temenni etmek demektir. \"Hayattaki bir kişi kabirdeki bir adamın yanından geçerken 'Keşke şu ölünün yerinde ben olaydım' diyecektir.\" Yani keşke ben de ölü olaydım diyecektir. , İbn Battal şöyle demiştir: Fitne zamanlarında kabirde bulunanlara gıpta edip, ölmeyi temenni etmek batılın galebe çalmasından dolayı dinin elden gideceği korkusu, masiyetterin ve münkerin ortaya çıkması nedeniyledir. Bu, herkes için genel bir durum değildir. Bu sadece hayır ehli kimselere mahsustur. Onların dışındakiler, canlarına veya ailelerine ya da dünyalıklarına gelecek bir musibetten dolayı -dinleriyle ilgili bu konuda hiçbir şeyolmasa bile- bunu temenni ederler. Bu anlayışı Müslim'in Ebu H1zim rivayetiyle Ebu Hureyre' den naklettiği şu hadis teyit etmektedir: \"Dünya hayatı, bir kimsenin birisinin kabrine gidip, toprağına bulanarak 'Keşke şu kabirde yatanın yerinde ben olsaydım' demedikçe ve din, onun açısından beladan başka bir anlam ifade etmedikçe sona ermeyecektir.\"(Müslim, fiten) Hadiste \"recul=erkek\" kelimesinin kullanılması, genellikle kabristana erkeklerin gitmesinden dolayıdır. Aksi takdirde kadın açısından da aynı şeyleri tasawur etmek mümkündür. Bundan sonra Kurtub! şöyle demiştir: Bu hadis, ileride fitne ve ağır meşakkati n baş göstereceğine, bundan dolayı dinin hafife alınacağına ve dini meselelere özen göstermenin azalacağına, kimsenin dünyası, geçimi ve bununla ilgili şeylerden başka bir derdinin olmayacağına işaret etmektedir. Bundan dolayı fitne zamanlarındaibadetin değeri daha da büyük olmuştur. Nitekim Müslim'in Makil b. Yesar' dan naklettiği bir hadiste Resulullah Sallallahu Aleyhi ve Sellem \"Fitne zamanlarında ibadet bana hicret gibidir\" buyurmuştur. (Müslim, fiten)",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 7116,
			"arabicnumber": 7116,
			"text": "Ebu Hureyre'nin nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"Devs kabilesinin kadınlarımn kıçları Zülhalasa (putuna doğru) çalkalanmadıkça kıyamet kopmaz\" buyurmuştur. Zülhalasa, cahiliye döneminde Devs kabilesinin tapmış oldukları putun adıdır",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 7117,
			"arabicnumber": 7117,
			"text": "Ebu Hureyre'nin nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"Kahtan oğullarından bir adam çıkıp insanları asasıyla sevk ve idare etmedikçe kıyamet kopmayacaktr\" buyurmuştur. Fethu'l-Bari Açıklaması: \"Hatta tattaribe\" yani kıçları birbirine vurmadıkça. \"Eiyat\" \"el-elye\" kelimesinin çoğuludur. Kelime bu haliyle kıç anlamına gelen \"el-adze\"ye benzer. Çünkü onun da çoğulu, \"el-a'caz\"dır. \"Zülhalasa, Devs'in tağiyesidir.\" yani putudur. İbnü't-Tin şöyle demiştir: Hadis Devs kabilesi kadınlarının hayvanlara binerek kendi memleketlerinden sözkonusu puta doğru yolculuk yapacaklarını haber vermektedir. Kadınların kıçlarının çalkalanmasından maksat budur. Biz de şunu ekleyelim: Söylenmek istenen, sözkonusu putun etrafında dönerken kadınların kıçlarının birbirine vuracak kadar izdiham oluşturmaları olabilir. İbn Battal şöyle demiştir: Bu ve benzer hadislerde söylenmek istenen, dinin hiçbir mensubu kalmayacak derecede yeryüzünün her köşesinden silinip kesilmesi demek değildir. Zira İslam'ın kıyamet kopuncaya kadar yeryüzünde kalacağı sabittir. Ancak İslam zayıflayacak ve ilk başladığı gibi tekrar garip hale gelecektir. İmam Buhari' bundan sonra \"Ümmetimden bir zümre hak uğruna çarp/şmaya devam edecektir\" hadisine yer vermektedir. Bu hadisin, diğer haberleri tahsis ettiği ve hak üzere baki kalacak zümrenin kıyamet kopuncaya kadar Beytü'lMakdis'te olacakları anlaşılmaktadır. İbn Battal, bu açıklamayla bu konudaki haberler birbiriyle uzlaşmaktadır der. İbn Battal'ın delilolarak gösterdiği rivayette o kimselerin Beytü'l-Makdis'te kıyamete kadar kalacaklarına açık bir ifade yoktur. Haberde sadece \"Allah'ın emri gelinceye dek\" ifadesi yer almaktadır. \"Allah'ın emri\" deyiminden maksat, hayatta kalan ve hak üzere olan mu'minlerin alınması olma ihtimali vardır. Haberlerin zahirieri Beytü'l-makdis'te olmakla nitelenen kimselerin son nesiinin Hz. İsa ile birlikte bulunanlar olmasını gerektirmektedir. Sonra Yüce Allah hoş bir esinti gönderecek ve ne kadar mu'min varsa onların ruhlarını alacaktır, geriye sadece insanların kötüleri kalacaktır. \"Kahtan oğullarından bir adam çıkıp insanları asasıyla sevk ve idare etmedikçe.\" Bu hadisin açıklaması Kureyş'in menKıbeleri bölümünün baş taraflarında geçmişti. Kurtubi' et-Tezkira isimli eserinde şöyle der: \"İnsanları asasıyla sevk ve idare etmedikçe\" cümlesi, Kahtan oğullarından çıkacak adamın onlara galebe çalacağının ve insanların ona boyun eğeceğinin kinayeli anlatımıdır. Yoksa burada asanın bizzat kendisi kastedilmiş değildir. Fakat onun zikredilmesi sözkonusu kişinin onlara sert davranacağı ve kendilerine baskı uygulayacağına işaret etmektedir. Kurtubi' şöyle devam eder: Bazıları şöyle demiştir: Kahtan'lı kişi, onları gerçek asa ile önüne katıp sürecektir, deve ve davarlar nasıl sürülüyorsa öylece sürüp sevk edecektir",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 7118,
			"arabicnumber": 7118,
			"text": "Ebu Hureyre r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"Hicaz topraklarında bir ateş çıkıp, Busra'daki develerin boyunlarını aydınlatmadıkça kıyamet kopmayacaktır\" diye haber vermiştir",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 7119,
			"arabicnumber": 7119,
			"text": "Ebu Hureyre r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Fırat (nehrinin suyu çekilerek) kıymetli altın hazinesinin açığa çıkma zamanı yakındır. Her kim o zaman orada hazır bulunursa ondan bir şey almasın.\" Fethu'l-Bari Açıklaması: \"Ateş çıkması.\" Yani Hicaz topraklarından bir ateş çıkması. \"Hicaz topraklarında bir ateş çıkıp ... \" Kurtubi', et-Tezkira'da şöyle der: Sözkonusu ateş, Hicaz bölgesinde Medine'de çıkmıştır. Ateş 654 yılı cemaziyelahirinin üçüncü Çarşamba gecesi gecenin ilk saatlerinde büyük bir depremin ardından başlamış ve Cuma günü kuşluk vaktine kadar devam edip, sonra sönmüştür. Nevevi şöyle der: Şam halkı nezdinde bu ateşin çıktığı bilgisi tevatür derecesindedir. Ebu Şame, Zeylü'r-Ravdateyn isimli eserde şöyle der: 54 yılı şaban ayının başlarında Medine-i Münewere' den mektuplar geldi. Bu mektuplarda Sahihayn'da yer alan haberi tasdik eden büyük bir olayın açıklaması yer almaktaydı. Ebu Şame, bu hadise yer verir ve şöyle der: Sözkonusu yangını gören kimselerden güvendiğim birisi bana o ateşin ışığında çölde kitap yazdığını haber verdi. \"Busrd'daki develerin boyunlarını aydınlatmadıkça ... \" İbnü't-Tin şöyle demiştir: Yani bu ateşin bulunduğu yerden gelen ıŞığı; Şam toprakları hududu içinde yer alan Busra'daki develeri aydınlatacaktır. Ebü'l-Baka \"Yani develerin boyunlarını aydınlık edecektir\" demiştir. \"en-yahsira'l-Furatu\" yani meşhur Fırat nehri açılmadıkça. Öyle anlaşılıyor ki o hazinelerden alma yasaklığıonu almaktan kaynaklanan fitne ve çarpışma nedeniyledir. Sözkonusu alma yasaklığı, bu olayın zamanın ahirinda dünyadaki haşr zamanında, henüz ortaya çıkmadığında ya da çıkan kısmın az olduğu anda gerçekleşeceğinden kaynaklanabilir. Bu durumda o hazineden alan kimsenin aldığı bir işe yaramaz. İmam Buharl'nin bu hadise Ateş çıkması başlığı altında yer vermesinin arkasında yatan sır bu olsa gerektir. Bence birinci ihtimal daha ağır basmaktadır. Zira Müslim bu hadisi bir başka rivayet yoluyla Ebu Hureyre' den şu şekilde nakletmiştir: \"Fırat nehrinin suları çekilerek altın dağı çıkacaktır. İnsanlar bunun yüzünden birbiriyle çarpışacak ve her yüz kişiden doksandokuzu bu uğurda öldürülecektir. Her bir kimse bnu ele geçirecek olanın ben olacağını umarım' diyecektir.\"(Müslim, fiten)",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 7120,
			"arabicnumber": 7120,
			"text": "Harise b. Vehb'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Sadakalannızı veriniz! Zira ileride insanlar öyle bir zamana çatacaklar ki kişi sadakasıyla dolaşacak da onu kabul edecek bir kimse bulamayacaktır",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 7121,
			"arabicnumber": 7121,
			"text": "Ebu Hureyre'nin nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Davaları bir olan iki büyük topluluk birbiriyle savaşmadıkça kıyamet kopmayacaktır. Otuza yakın yalancı deccaller türemedikçe kıyamet kopmayacaktır. Bunların hepsi kendilerinin Allah'ın Resu/ü olduklarını iddia edeceklerdir. Yine ilim alınmadıkça, depremler çoğalmadıkça, zaman birbirine yaklaşmadıkça, fitneler zuhur etmedikçe, herc yani adam öldürme vakaları çoğalmadıkça kıyamet kopmayacaktır. Aranızda mal çoğalıp, sel gibi akmadıkça kıyamet kopmayacaktır. Hatta mal o derece çoğalacak ki mal sahibi malının zekatını kim kabul eder diye endişelenecektir. Dahası mal sahibi bazı kimseler, zekat vermek isteyecek fakat zekat teklif ettiği kimse 'Benim zekata ihtiyacım yoktur' diyecektir. İşte bunlar olmadıkça kıyamet kopmayacaktır. Yine halk yüksek binalar yapma yarışına girmedikçe ve bir kimse ölen bir kimsenin kabri yanından geçerken 'Keşke bunun yerinde ben olaydım' diye ölmeyi temenni etmedikçe kıyamet kopmayacaktır. Güneş batı tarafından doğup, insanlar bu hadiseyi görünce toptan iman edeceklerdir, fakat Bu iman evvelce iman etmemiş olan yahut imanında hayır ve fazilet kazanmayan kimseleri imanları kendilerine fayda vermeyeceği bir zamandır. Kıyamet şüphesiz kopacaktır. Hem de satıcıyla alıcı aralarında kumaşlarını açacaklar ancak satış tamam olmadan ansızın kıyamet kopacak, onu dürmeye fırsat bulamayacaklardır. Mutlaka kıyamet kopacaktır. Hem de sağmal devesinin sütünü sağıp gelen kişiye sütünü içmek nasip olmayacak, hem de kişi havuzunu sıuayıp tamir edecek, fakat kıyamet ansızın kopacak da havuzun suyunu kullanmak nasip olmayacaktır. Kıyamet muhakkak kopacaktır. Hem de yemek yemekte olan kişi lokmasını ağzına götürecek, (kıyamet ansızın kopacak da) o lokmayı yemek nasip olmayacaktır.\" Fethu'l-Bari Açıklaması: \"Kişi sadakasıyla dolaşacak da onu kabul edecek bir kimse bulamayacaktır.\" Bu olayın, Ömer b. Abdulaziz'in halifeliği döneminde gerçekten olduğu gibi meydana gelme ihtimali vardır. Bu durumda sözkonusu olay kıyamet alametlerinden olmaz. Bu, Nebilik alametleri bölümünde geçen Adiy b. Hatim hadisindeki ifade gibidir. O hadiste şöyle bir cümle geçmişti: \"Eğer uzun bir hayat yaşayacak olursan bir kimsenin avucunun içinin altınla dolu olarak çıktığını ve onu kabul edecek kimse arayıp da bulamayacağını göreceksin.\" Enbiya bölümünde Hz. İsa'nın hayat hikayesi anlatılırken şöyle bir hadis geçmişti: \"Meryem oğlu İsa'nın aranıza ineceği gün yakındır.\" Bu hadiste \"mal çoğalacak\" şeklinde bir cümle geçmişti. Bir başka rivayette ise \"Hatta onu hiç kimse kabul etmeyecek\" ifadesi yer almaktadır. Yukarıdaki hadisten maksat bu olabilir. Ancak birinci ihtimal daha ağır basmaktadır. \"İki büyük topluluk birbiriyle sauaşmadıkça.\" Bu hadis Rikak bölümünde geçmişti. \"İki topluluk\"tan maksat, Hz. Ali ve taraftarlarıyla, Muaviye ve taraftarlarıdır. Onların \"Müslüman\" şeklinde isimlendirilmeleri ve \"davalarının bir olduğu\"nun belirtilmesi, her iki grubu tekfir eden Haridiere ve onlar gibi düşünenlere cevap teşkil etmektedir. \"Ammar'ı haddi aşan zalim bir grup katledecektir\" hadisi, bu savaşta doğru yolda olanın Hz. Ali olduğunu göstermektedir. Zira Ammar'ı Muaviye taraftarları katletmişti. Bezzar'ın ceyyid bir isnadla nakline göre Zeyd b. Vehb şöyle demiştir: Bir gün Huzeyfe'nin yanında idik. Bize ''Dininize mensup bazı kimseler ortaya çıkıp birbirinin yüzüne kılıçla vurduğunda haliniz nice olacak?\" diye sordu. Orada bulunanlar \"Bu durumda bize ne emredersin?\" diye sordular. Huzeyfe \"Ali'nin yanında yer almaya davet edenzümreye bakınız ve onlardan ayrılmayınız. Çünkü hak üzere olan o grup olacaktır\" dedi. Yakub b. Süfyan'ın ceyyid bir isnadla nakline göre Zührı şöyle demiştir: \"Muaviye, Ali'nin Cemel vakasında yer alanlara galip olduğunu duyunca, Osman'ın kanını talep etmeye başladı. Şam halkı onun çağrısına uydu. Bunun üzerine Ali ona doğru yola çıktı ve iki grup Sıffin'de karşı karşıya geldi. Buharl'nin hocalarından Yahya b. Selman el-Cu'fi'nin Kitabu's-Sıffin isimli eserinde ceyyid bir isnadla nakline göre Ebu Müslim el-Havlını, Muaviye'ye \"Sen Ali'yle halifelik mi çekişiyorsun, sen onun gibi misin?\" diye sorar. Muaviye \"Hayır! Onun benden daha faziletli ve bu işe daha layık olduğunu biliyorum. Fakat siz Osman'ın haksız yere öldürüldüğünü bilmiyor musunuz? Ben onun amca oğluyum, velisiyim, kanını talep ediyorum. Ali'ye gidin ve ona söyleyin, Osman'ın katillerini bize versin\" der. Bunlar Ali'ye gelirler, onunla konuşurlar. Ali \"O biate dahil olsun ve onlarla olan anlaşmazlığını bana getirsin\" der. Ancak Muaviye bunu kabul etmez ve Ali Iraklılardan oluşturduğu ordunun başında yola çıkar. Nihayet Sıffın' da konaklar. Muaviye de yola çıkıp orada ordusunu konuşlandırır. Bu olay 36 yılı zilhiccesinde gerçekleşir. Ali'yle Muaviye birbirlerine elçi gönderirler. Ancak arzularına ulaşamazlar. Bunun üzerine savaş patlak verir. İbn Ebi Hayseme'nin Tarih'inde naklettiğine göre her iki zümreden yaklaşık yetmiş bin kişi katledilir. Bazıları öldürülenlerin bu sayıdan daha fazla olduğunu söylemişlerdir. Bunların arasında yetmişten fazla ordu olduğu söylenmiştir. İbn Ebi Şeybe'nin sahih bir isnatla nakline göre Ebü'r-Rıda şöyle demiştir: Sıffın günü Ammar'ın \"Her kimi hurilerin kucaklaması sevindirirse, Sıffin'de sevabını Allah'tan bekleyerek ileri atılsın\" dediğini duydum.(İbn Ebi Şeybe, el-Musannej, VII, 547) Ziyad b. Haris şöyle anlatmıştır: Ben Ammar'ın )lanı başında idim. Birisi \"Şam ahalisi kafir oldu\" deyince, Ammar \"Böyle söylemeyiniz! Nebiimiz birdir, fakat onlar haktan sapmış bir topluluktur. Onlarla bu yoldan dönünceye kadar savaşmak bize bir yükümlülüktür\" dedi. İbn Sa'd'ın nakline göre Osman katledilip de Ali'ye bey' at edilince, İbn Abbas biatini alabilmek için Muaviye'yi Şam'a tayin etmesi ve daha sonra ona dilediğini yapması teklifinde bulundu. Ancak Ali bunu yapmaktan kaçındı. Bu durum Muaviye'nin kulağına gidince \"Vallahi ona asla bey' at etmeyeceğim\" dedi. Ali Cemel savaşına katılanlarla işini bitirince Cerir b. Abdullah el-Becell'yi Muaviye'ye göndererek insanların girdiği yola onun da girmesi çağrısında bulundu. Ancak Muaviye bunu kabul etmedi ve daha önce geçtiği üzere Ebu Müslim'i gönderdi. Ancak o gelişini beklemedi. Ali askerleriyle birlikte Muaviye'nin üzerine yürüdü. İki ordu Muharrem ayının 10 unda Sıffın'da karşı karşıya geldi. Bunların ilk çarpışmaları safer ayının başında olmuştu. Şam halkı tam mağlup olmak üzere iken Amr b. el-As'ın verdiği fikir sayesinde Mushafları havaya kaldırarak içindeki hükme boyun eğme çağrısında bulundular. Sonunda iş iki hakem tayinine vardı. Bundan sonra iki grubun ihtilafları, Muaviye'nin Şam yöresinin idaresini tek başına ele alması ve Ali'nin Haridier ile uğraşması dönemi başladı. \"Yalancı deccaller türemedikçe ... \" Hadiste geçen \"deccahln\", \"deccal\" kelimesinin çoğuludur. Bunların hadiste geçen ifadesiyle \"ba's\" edilmesi, ortaya Çıkarılması demektir. Yoksa Nebi olarak gönderilmeleri anlamında değildir. Bu ifadeden kulların fiillerinin Allah tarafından yaratılmış olduğunu, bütün işlerin onun takdiri sayesinde gerçekleştiğini anlıyoruz. \"Bunların hepsi kendilerinin Allah'ın Resu/ü olduklarını iddia edeceklerdir.\" Bu ifade ortaya çıkacak deccallerden her birinin Nebi olduğunu iddia edeceği noktasında gayet açıktır. Geçen hadisin son kısmında \"Ben Nebilerin sonuncusuyum\" şeklindeki ifadenin arkasında yatan sır böylece açığa çıkmaktadır. Bunların içinden Nebilik iddiasında bulunacak olanların otuz veya civa rı olması ve bu sayıdan daha fazlasının sadece yalancı olup, sapıklığa davet edecek olması da muhtemeldir. Bu son grup Rafızllerin aşırıları, Batınller, vahdet-i vücutçular, Huıu.liyyeciler, Nebi Sallallahu Aleyhi ve Sellem'in getirdiğinin aksine olduğu zorunlu olarak bilinen şeylere davet eden diğer fırka mensupları gibidirler. Bu yaklaşımı Ahmed b. Hanbel'deki Hz. Ali'nin naklettiği şu hadis teyit etmektedir: \"Ali, Abdullah b. el-Kevvd'ya sen onlardansın dedi.\" İbnü'lKevva Nebilik iddia etmedi, o sadece reddetmede ileri gidiyordu. \"Depremler çoğalmadıkça ... \" Bir çok kuzey, doğu ve batı beldelerinde birden çok deprem meydana gelmiştir. Fakat öyle anlaşılıyor ki depremlerin çokluğundan maksat, onların yaygınlığı ve devamlılığıdır. Seleme b. Nufeyl'in naklettiği ve Ahmed b. Hanbel'de yer alan bir hadiste şöyle denilmektedir: \"Kıyametin hemen öncesinde deprem yılları vardır.\" Ahmed b. Hanbel'in Ebu Said'den nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"Kıyamet yaklaştığında yıldırımlar çoğalacaktır\" buyurmuştur.(Ahmed b. Hanbel, III, 64) \"Kıyamet kopacaktır, kişi havuzunu sıvayıp tamir edecektir.\" Bunun manası kişi havuzunu çamurla tamir edecek, havuzunu suyla doldurup hayvanlarım sulamak için duvardaki yarıkları çamurla sıvayacaktır. Arapça'da \"lata'l-havda -yelituhu.-\" onu çamur ve benzeri bir şeyle tamir etti demektir. \"Kıyamet muhakkak kopacak, hem de yemek yemekte olan kişi lokmasını ağzına götürecek ... \" Burada geçen \"ekletehu.\"lokması anlamınadır",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 7122,
			"arabicnumber": 7122,
			"text": "Muğire b. Şu'be radiyallahu anh şöyle anlatmıştır: Hiç kimse Nebi Sallallahu Aleyhi ve Sellem' e benim sorduğum kadar Deccal'i sormamıştır. Resulullah Sallallahu Aleyhi ve Sellem bana \"Ondan sana ne zarar gelecektir?\" dedi. \"Çünkü insanlar onun beraberinde ekmek dağı ve su nehri vardır diye söylüyorlar!\" dedim. Resulullah Sallallahu Aleyhi ve Sellem \"O, Allah nezdinde bunu mu'minlerin sapmasına sebep kılmayacak kadar hakirdir",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 7123,
			"arabicnumber": 7123,
			"text": "İbn Ömer'in -zannediyorum- Nebi Sallallahu Aleyhi ve Sellem'den nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"Deccal'in sol gözü şaşıdır, adeta salkımından dışarı doğru fırlamış üzüm tanesi gibidir\" diye haber vermiştir",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 7124,
			"arabicnumber": 7124,
			"text": "Enes b. Malik r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle anlatmıştır: \"Deccal gelecek, nihayet Medine'nin bir tarafına inecek. Sonra Medine üç kere sal/anacak da orada bulunan her kafir ve münafık ona doğru çıkıp gidecektir",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 7125,
			"arabicnumber": 7125,
			"text": "Ebu Bekre'nin nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Medine'ye Mesih Deccal'in (değil kendisi) korkusu (bile) giremeyecektir. O gün Medine'nin yedi kapısı olacak, her bir kapıda iki melek bulunacaktır",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 7126,
			"arabicnumber": 7126,
			"text": "Ebu Bekre'nin nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Medine'ye Mesih Decca/'in (değil kendisi) korkusu (bile) giremeyecektir. O gün Medine'nin yedi kapısı olacak, her bir kapıda iki melek bulunacaktır",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 7127,
			"arabicnumber": 7127,
			"text": "Abdullah b. Ömer şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem bir gün insanların arasında (bir konuşma yapmak üzere) ayağa kalktı. Allah'ı layık olduğu sıfatlarla övdü. Sonra Oeccal' den söz ederek şöyle buyurdu: \"Ben sizleri kesin olarak ondan korkutuyarum. Hiçbir Nebi yoktur ki kavmini ondan korkutmuş olmasın! Fakat ben sizlere onun hakkında hiçbir Nebiin kendi kavmine söylemediği bir niteliğinden söz edeceğim: Deccal şaşıdır, Allah ise şaşı değildir",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 7128,
			"arabicnumber": 7128,
			"text": "Abdullah b. Ömer'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle anlatmıştır \"Bir defasında uyumuştum. (Rüyamda) Kabe'yi tavaf ediyordum. Bir de ne göreyim! Esmer, salıverilmiş düz saçlı bir kişiyle karşı karşıyayım. Başından su dökülüyordu veya su damlıyordu. Oradakilere 'Bu kimdir?' diye sordum. Onlar 'Meryem'in oğludur' dediler. Sonra etrafıma bakarak ilerledim. Birden kırmızı yüzlü, uzun boylu, başı kıvırcık saçlı, sağ gözü sakat, börtlek sanki salkımındaki emsa/inden dışarı çıkmış iri bir üzüm tanesi gibibir adam gördüm. Onun kim olduğunu sordum. 'Bu Deccal'dir' dediler. Ona en çok benzeyen Huzaa kabilesinden İbn Katan'dır",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 7129,
			"arabicnumber": 7129,
			"text": "Aişe r.anha Resulullah Sallallahu Aleyhi ve Sellem'i namazın içinde Deccal'in fitnesinden Allah'a sığınırken işittim demiştir",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 7130,
			"arabicnumber": 7130,
			"text": "Huzeyfe'nin nakline göre Resulullah Sallallahu Aleyhi ve Sellem Deccal hakkında \"Deccal'in beraberinde bir su ve bir ateş bulunacaktır, fakat onun ateşi soğuk bir sudur, onun suyu ise yakıcı bir ateştir\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 7131,
			"arabicnumber": 7131,
			"text": "Enes'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Ümmetini şaşı gözlü ve pek yalancı olan Deccal'den sakındırmadık hiçbir Nebi gönderilmemiştir. Haberiniz olsun ki o şaşı gözıüdür. Rabbiniz ise şaşı gözlü değildir. Biliniz ki Deccal'in iki gözünün arasında 'kafir' sözcüğü yazılmıştır. \" Fethu'l-Bari Açıklaması: \"Deccal\" Bu kelime \"deceı\" kökünden türemedir. Bu kök \"örtmek\" anlamına gelir. Yalancıya \"deccal\" denilmesi hakkı kendi batılı ile örtmesindendir. Kurtubı, et-Tezkire'de şöyle der: Deccal'e neden deccal denildiği hakkında bilginler on farklı görüşe ayrılmışlardır. Deccal konusunda ihtiyaç duyulan şeylerden birisi, onun aslı yani İbn Sayyad mı yoksa bir başkası mı olduğudur? İkinci sorun, onun Nebi Sallallahu Aleyhi ve Sellem döneminde mevcut olup olmadığıdır. Üçüncüsü, ne zaman çıktığı, dördüncüsü, çıkış sebebi, beşincisi, nereden çıkacağı, altıncısı, vasıfları, yedincisi, iddia ettiği şey, sekizincisi, zuhur ettiği anda taraftarlarının çoğalması için çıkması mümkün olan olağanüstü haller, dokuzuncusu, ne zaman öleceği, onuncusu, onu kimin öldüreceğidir. Bunlardan birincisinin açıklaması İ'tisam bölümünde Cabir hadisi açıklanırken gelecektir. Buna göre Cabir, Deccal'in İbn Sayyad olduğuna yemin ediyordu. İkinci soruna gelince, Müslim'in naklettiği Temim ed-Darı kıssası ile ilgili olarak Fatıma bnt. Kays hadisinin zorunlu sonucu, onun Nebi Sallallahu Aleyhi ve Sellem döneminde mevcut olduğu ve adalardan birinde tutuklu bulunduğudur. Bunun açıklaması da Cabir hadisi açıklanırken gelecektir. Üçüncü meseleye gelecek olursak, Müslim'de yer alan en-Newas hadisinde onun Müslümanlar Konstantiniyye'yi fethettiği zaman ortaya çıkacağından söz edilmektedir. Çıkış sebebi ise Müslim'in İbn Ömer vasıtasıyla Hafsa'dan nakline göre bir öfkeden dolayı olacaktır. Nereden çıkacağı sorunusun cevabı kesin olarak doğu tarafından çıkacağı şeklindedir. Bir rivayete göre o Horasan'dan çıkacaktır. Bunu Ahmed b. Hanbel ve Hakim, Ebu Bekir' den nakletmişlerdir. Bir başka rivayete göre o Isfahan' dan çıkacaktır. Bu haberi Müslim rivayet etmiştir. Sıfatları bu bölümde naklettiğimiz hadislerde zikredilmektedir. Davası konusunda şunu söylemek mümkündür. Deccal önce çıkacak, sonra imanlı ve salih bir kişi olduğunu iddia edecek, ardından Nebi olduğunu ileri sürüp, sonunda ilahlık iddiasında bulunacaktır. Deccal'in elinde ortaya çıkacak şeyler burada zikredilecektir. Ne zaman öleceğine ve kimin öldüreceğine baktığımızda Deccal Mekke ve Medine hariç bütün yeryüzünde ortaya çıktıktan sonra ölecektir. Sonra Beytü'l-makdis' e yönelecek ve Hz. İsa oraya inip, Deccal'i öldürecektir. Bunu da Müslim rivayet etmiştir. \"Ekmek dağı.\" Bundan maksat, Deccal'in yanında dağlar kadar ekmek olacak demektir. Hadiste \"ekmek\" kelimesi kullanılmış, bununla ekmeği n asıl maddesi olan -mesela- buğday kastediimiştir. \"O, Allah nezdinde bunu mu'minlerin sapmasına sebep kılmayacak kadar hakirdir.\" Kadı Iyaz şöyle demiştir: Bu cümle Deccal, Yüce Allah'ın katında elinde mu'minleri saptıracak, inançlı kimselerin kalplerini şüpheye düşürecek şeyleri yaratamayacak kadar hakirdir. Onun elinde yaratılanlar, iman edenlerin imanlarını arttırmaya, kalplerinde hastalık olanları şüpheye düşürmeye yöneliktir. Bu ifade, Deccal'i öldürenin \"Sen kendi canın hakkında benden daha basiretli değildin\" demesine benzer. Yoksa \"O Allah nezdinde bundan daha hakirdir\" ifadesi, onun yanında bu zikredilenlerden hiçbiri yoktur anlamına değildir. Tam tersine o, Yüce Allah bu türden şeyleri onun doğruluğuna bir alamet kılmayacak kadar hakirdir demektir. Özellikle Yüce Allah onda yalancı ve kMir olduğuna dair açık bir alamet yaratmıştır. Bunu onun konuşması ve vücut kusurları gibi yalancılığına delilolabilecek şeylere ilaveten okumayı bilen ve bilmeyen okur. \"Hiçbir Nebi yoktur ki kavmini ondan korkutmuş olmasın!\" İbnü'lArabı şöyle der: Nebilerin kavimlerini Deccal konusunda uyarmaları, fitnelerden kaçındırma ve onlara gönül huzuru verme anlamınadır. Bununla onun insanları sarsıp, güzel inançlarından caydırmaması hedeflenmiştir. Nebi Sallallahu Aleyhi ve Sellem'in ona yakın bir zamanda gönderilmesi fazladan bir uyarı anlamınadır. Resulullah Sallallahu Aleyhi ve Sellemı bununla birlikte onların iman üzere sabit oldukları takdirde şüpheleri yakın ile savuşturacaklarına işaret etmektedir. \"Deccal şaşı gözıüdür. Rabbiniz ise şaşı gözlü değildir.\" Nebi Sallallahu Aleyhi ve Sellem'in Deccal' de sonradan yaratıldığına (hudus) dair deliller apaçık ayan beyan ortada iken, sırf onun şaşı olduğunu vurgulaması, bunun gözle görülür bir vücut kusuru olmasındandır. Zira bunu alim, sade insan ve akli delillere erişemeyecek derecedeki kimseler dahil herkes fark eder. Deccal yaratılışında noksanlık olduğu halde rablık iddiasında bulunduğuna, ilah ise eksiklikten münezzeh olduğuna göre onun yalan söylediği anlaşılacaktır. Müslim'in yaptığı farklı bir rivayete göre Nebi Sallallahu Aleyhi ve Sellem \"Biliyorsunuz ki içinizden hiçbi kimse ölünceye kadar Rabbini göremeyecektir\" demiştir.(Müslim, fiten) Hadis Deccal'in rablik iddiasının yalan olduğuna uyarıda bulunmaktadır. Çünkü Allah Teala'yı görmek ölümle kayıtlanmıştır. Deccal kendisinin Allah olduğunu iddia etmekte ve bununla birlikte insanlar onu görebilmektedir. Bu hadis, Allah'ı yakaza halinde gördüğünü iddia eden kimseye bir cevaptır. Çünkü Allah, böyle bir durumdan münezzehtir. Bu yargıya Nebi Sallallahu Aleyhi ve Sellem'in İsra gecesi Yüce Allah'ı görmüş olması ile itiraz edilemez. Zira bu Nebi Sallallahu Aleyhi ve Sellem'e mahsus hallerdendir. Yüce Allah ona dünyada öyle bir güç vermiştir ki bunu mu'minler ancak ahirette elde edebilir. \"Biliniz ki Deccal'in iki gözünün arasında 'kafir' sözcüğü yazılmıştır.\" Nevevı şöyle der: Tahkik alimlerinin esas aldığı sahih görüşe göre sözkonusu yazı hakiki oIup, Yüce Allah bunu onun yalan söyIediğine kesin bir delil kıImıştır. Allah, bu yazıyı mü mine gösterirken bedbaht oImasını dilediği kimseIere gizIer",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 7132,
			"arabicnumber": 7132,
			"text": "Ebu Said eI-Hudrı şöyIe demiştir: Resulullah Sallallahu Aleyhi ve Sellem bir gün bizIere DeccaI'Ie ilgili oIarak uzun bir konuşma yaptı. Onun bize anIattıkIan arasında şu cümIeIer de vardı: \"Deccal gelecektir. Onun Medine'nin içine girmesi haram kılınmıştır. Ancak Medine etrafındaki baz! çorak haldeki araziye inecektir. O gün Medine halkının en hayırlı bir siması yahut insanlann en hayırlılanndan birisi, Deccal'e karşı çıkar ve 'Ben şehadet ederim ki muhakkak sen Resulullah Sallallahu Aleyhi ve Sellem'in bize haber verdiği Deccal'sinf' der. Bunun üzerine Deccal (orada bulunanlara) 'Şimdi ben bu adamı öldürüp, sonra diriltirsem benim (ilahlık) iddiamda şüphe eder misiniz?' diye sorar. Onlar da 'Hayır, şüphe etmeyiz' derler. Deccal hemen o adamı öldürür, sonra diriltir. O adam 'Vallahi benim senin Deccal olduğun hakkındaki şimdiki kanaatim bundan önceki imanımdan daha kuvvetlidir' der. Bu defa Deccal bu adamı tekrar öldürmek ister fakat bir daha ona musallat edilmez",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 7133,
			"arabicnumber": 7133,
			"text": "Ebu Hureyre r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"Medine'nin giriş yerleri üzerinde birtakım melekler vardır. Medine'ye veba hastalığı ve Deccal giremez\" demiştir",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 7134,
			"arabicnumber": 7134,
			"text": "Enes b. Malik'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Medine'ye Deccal gelecek ve birçok meleklerin onu korumakta olduklarını görecektir. Artık oraya Deccal ve veba hastalığı inşallah yaklaşamayacaktır.\" Fethu'l-Bari Açıklaması: \"O adamı öldürür, sonra diri/tir.\" Hattflbl'ye göre burada şöyle bir soru gündeme gelebilir: \"Yüce Allah'ın bir kflfirin elinde mucize yaratması nasıl mümkün olur? Zira ölüleri diriltmek, Nebilerin gösterdiği büyük mucizelerden biridir. Deccal yalancı, iftiracı ve ilahlık iddia ettiği halde nasılolur da böyle bir mucizeye ulaşabilir?\" Bu soruya cevabımız şudur: Söz konusu mucize ona kullara karşı bir fitne kabilinden verilmiştir. Çünkü insanların nezdinde Deccal'in davasında haklı değil, haksız olduğunu gösteren deliller vardır. Bunlardan birisi onun şaşı gözlü olduğu, alnında kafir yazdığı ve bunu Müslümanın okuduğudur. Dolayısıyla onun iddiası, küfür damgası yemiş olması, organındaki eksiklik ve değersiz olmasıyla kendiliğinden çürümektedir. Zira o ilah olsaydı, bu damgayı alnından silerdi. Nebilerin mucizeleri, benzeri getirilebilecek şeyler değildir. Dolayısıyla bu ikisi birbirine benzemez. Mühelleb şöyle demiştir: Deccal'e sözü edilen maktulü canlandırma gücü verilmesi, \"O Allah katından bundan daha hakirdir\" şeklinde,ki daha önce geçen ifade ile çelişmez. Zira bu sözün anlamı, \"o Allah katında kendisine sahih bir biçimde mucize gösterme gücü verilmeyecek kadar hakirdir\" demektir. Zira onun bir kimseyi öldürüp, sonra diriltme gücü ne kendisinde, ne de bir başkasında devam etmemiştir. Sonra maktul de bundan sevap elde etmekle birlikte öldürülürken çektiği acı anı hariç herhangi bir zarar görmemiştir. O kişi Yüce Allah'ın bu acıyı kendisinden savuşturmaya olan kudreti sayesinde belki de ölüm acısını hiç duymamış olabilir. İbnü'l-Arabı şöyle der: Deccal'in elinde görülen yağmur yağdırma, kendisine inanana bolluk sağlama, kendisini yalanlayana kıtlık verme, yeryüzünün hazinelerinin onu takip etmesi, beraberindeki cennet ve cehennem, akan sular şeklinde elinde gözüken mucizelerin tümü Allah tarafından bir imtihan ve denemeden ibarettir. Yüce Allah bununla şüpheye düşenleri helak eder, imanı kesin olanları kurtarır. Bütün bunlar korkunç şeylerdir. Bundan dolayı Nebi Sallallahu Aleyhi ve Sellem \"Deccal'in fitnesinden daha büyük bir fitne yoktur\" buyurmuştur. Resulullah Sallallahu Aleyhi ve Sellem namazında ümmetinebir gidiş yolu olmak üzere Deccal'in fitnesinden Allah'a sığınırdı. Müslim'de yer alan diğer bir hadiste ise \"Deccalden başkası, sizin hakkınızda endişe ettiğim şeylerin en endişe verici olanıdır\"S1 şeklindeki hadise gelince, Nebi Sallallahu Aleyhi ve Sellem bu sözü sahabilere söylemiştir. Zira onlar hakkındaendişe ettiği şey, kendilerine Deccal' den daha yakındır. Nebi Sallallahu Aleyhi ve Sellem'in hakkında endişe ettiği kimse için meydana geleceği kesin olan yakın tehlikeden vuku bulacağı zanna dayanan uzak tehlikeye nazaran -bu daha ağır olsa bile- daha çok korku duyulur. \"Artık oraya Deccal ve veba hastalığı inşallah yaklaşamayacaktır.\" Bilginlerin ifadesine göre hadisteki istisna ifadesi (inşallah) gerçekten durumu Allah'ın iradesine bağlamak olabileceği gibi, teberrük için de olabilir. Bu ihtimal daha ağır basmaktadır. Kadı [yaz şöyle demiştir: Bu hadisler, ehl-i sünnete delil teşkil etmektedir. Ehl-i sünnete göre Deccal'in gerçekten vardır, o muayyen bir şahıstır. Yüce Allah onunla kullarını deneyecektir. Kendisine öldürdüğü kişiyi diriltme, bereket, nehirler, cennet, cehennem, yeryüzünün hazinelerirÜn ardından gitmesi, göğe emredip yağmur yağdırması, yeryüzüne emredip bitki bitirmesi gibi birtakım mucizeler verilecektir. Bütün bu sayılanlar Yüce Allah'ın dilemesiyle olacaktır. Sonra Allah Teala bunları yapmaktan onu aciz kılacak ve ne o kişiyi, ne de bir başkasını öldüremeyecektir. Sonra davası çürütülecek ve kendisini Meryem oğlu Hz. İsa öldürecektir. Bu konuda bazı Haridier, Mutezile, Cehmiye muhalif kalmıştır. Onlar Deccal' in varlığını inkar etmişler ve sahih olan hadisleri reddetmişlerdir]",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 7135,
			"arabicnumber": 7135,
			"text": "Zeynep bnt. Cahş şöyle anlatmıştır: Resulullah Sallallahu Aleyhi ve Sellem bir gün korku ile Zeyneb'in yanına girerek \"La ilahe illailah! Vukuu yaklaşan bir kötülükten dolayı vay Arapların haline! Bugün Ye'cüc ve Me'cüc'ün seddinde şunun gibi bir delik açıldı\" buyurdu, sonra baş parmağı ile ona yakın olan şehadet parmağını halkaladı. Zeynep bnt. Cahş dedi ki: Ben \"Ya Resulallah! İçimizde bu kadar iyi kimseler varken biz helak edilir miyiz?\" diye sordum. Resulullah Sallallahu Aleyhi ve Sellem \"Evet, fısk u fücur çoğaldığı zaman (helak olursunuz)\" buyurdu",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 7136,
			"arabicnumber": 7136,
			"text": "Ebu Hureyre r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"Redm, -Ye'cüc ve Me'cüc Seddi- şunun gibi açıldı\" buyurmuştur. Ravi Vüheyb, Nebi Sallallahu Aleyhi ve Sellem'in \"Şunun gibi\" işaretini göstermek için baş parmağının bir tarafını, şehadet parmağının iki boğumu arasına koymak ve şehadet parmağının bir tarafını da onun üzerine koymak suretiyle \"doksan\" işareti yapmıştr. Fethu'l-Bari Açıklaması: \"Ye'cüc ve Me'cüc\" Enbiya bölümünde Zülkarneyn başlığı altında Ye'cüc ve Me' cüc' e dair birtakım açıklamalar geçmişti. Bunların önce Ademoğlu, sonra da Yafes b. Nuh'un çocukları oldukları ifade edilmişti ve başkaları bunu kesin bir dille ifade etmişlerdir. Bazı ilim adamları bunların Yafes b. Nuh'un çocuklarından kabul edilen Moğollar olduğu ile ilgili kanaat sergilemişlerdir. Ed-Dahhak bu kanaaJte olanlardan birisidir. \"Vukuu yaklaşan bir kötülükten dolayı vay Arapların haline!\" Hadiste tehlike açısından sadece Araplardan söz edilmesi, o zamanlar İslam'a girenlerin büyük bir kısmının Arap olmasından dolayıydı. Hadisteki \"kötülük\" kelimesinden maksat, Nebi Sallallahu Aleyhi ve Sellem'den sonra meydana gelen Osman'ın katli olayıdır. Bundan sonra fitneler ardarda gelmiş ve Araplar diğer milletlerin arasında bir başka hadisteki ifadesiyle yemek yiyenlerin önündeki çanak gibi olmuşlardır. \"Birilerinin yemek çanağına üşüştükleri ve saldırdıkları gibi başka milletlerin sizin aleyhinize birbirlerini davet edecekleri ve size saldıracakları günler yakındır. \"(Taberani, el-Mucemu'l-Evsat, VII, 180 (Benzer lafızia) Bu hadisteki muhatap Araplardır. Kurtubi şöyle demiştir: Hadisteki \"kötülük\" kelimesinden maksat, Nebi Sallallahu Aleyhi ve Sellem'in Ümmü Seleme hadisinde işaret ettiği şeyolabilir: \"Bu gece ne fitneler indi! Ne hazineler indiI\" Nebi Sallallahu Aleyhi ve Sellem bununla kendisinden sonra yapılacak fetihlere işaret etmiştir. Gerçekten Müslümanların elinde mallar çoğalmış ve fitneleri çeken rekabet ve yarışma baş göstermiştir. İktidar konusundaki yarışma da böyledir. Zira Hz. Osman'a muhalif olanların ona yönelttikleri en büyük tenkit Ümeyye oğullarından ve başkalarından akrabalarını göreve tayin etmesiydi. İşte bu tavrı onun şehidedilmesine yol açtı. Hz. Osman'ın katledilmesi Müslümanlar arasında tarihte şöhret bulan ve devam eden savaşlara yol açtı. \"Redm, -Ye'cüc ve Me'cüc Seddi- şunun gibi açıldı.\" Hadiste geçen \"redm\" kelimesinden maksat, Zülkarneyn'in yaptırmış olduğu seddir. Bunun niteliği Enbiya bölümündeki hadislerde Zülkarneyn anlatılırken geçmişti. \"Baş parmağının bir tarafını, şehadet parmağının iki boğumu arasına koyarak halkaladı.\" Yani bu iki parmağı halka gibi yaptı. \"Evet, fısk u fücur çoğaldığı zaman (helak olursunuz).\" Hadiste geçen \"habes\" kelimesini zina, zinadan dünyaya gelen çocuklar, fısk ve fücur olarak tefsir etmişlerdir. Bu daha iyidir. Zira \"habes\" kelimesinin zıttı \"salah\" yani iyiliktir. İbnü'l-Arabi şöyle demiştir: Hadis-i şerif iyi insanların kötülerin kötülüğünü değiştirmedikleri takdirde onların helakıyla helak olacaklarını açıklamaktadır. İyiler, kötüleri değiştirdiğinde ancak bu fayda vermeyip, kötülük işlemeye devam ettiklerinde, kötülük yaygınlık gösterip çoğaldığında ve fesat her tarafı kapladığında da az olanlar da, çok olanlar da helak olup gideceklerdir. Sonra herkes kendi niyetine göre dirilecektir. Ye'cuc ve Me'cüc'un seddinde hadiste sözü edilen kadar bir açıklık meydana gelmesi ifadesinden, bunun devam etmesi dunımunda duvardaki yarığın onların çıkacağı derecede genişleyeceği anlaşılmaktadır. Sanki o esnada Ye'cüc ve Me' cüc'ün insanların karşısına çıkmaları onlar için genel bir helak olacağı anlaşılır. Ye'cüc ve Me'cüc'un ortaya çıktığı andaki dunımları hakkında Müslim'de en-Newas b. Sem'an'ın naklettiği bir hadis yer almaktadır. Bu hadiste Resulullah Sallallahu Aleyhi ve Sellem Deccal'den ve onu Hz. İsa'nın öldüreceğinden söz ettikten sonra sözü Ye'cüc ve Me'cüc'e getirerek şöyle demektedir: \"Sonra İsa'ya Yüce Allah 'ın Deccal' den korumuş olduğu bir topluluk gelir. İsa onlann yüzlerini mesh eder ve kendilerine cennetteki derecelerinden söz eder. O tam bundan söz ederken Yüce Allah İsa'ya 'Ben (birtakım) kullar çıkardım ki hiç kimse onlarla savaşamaz. Sen kullanmı al, Tur dağına çıkar' diye vahyeder. Allah Teala Ye'cüc ve Me'cüc'ü gönderir. Onlar her tepeden akın ederler. Ye'cüc ve Me'cüc'un baş tarafı Taberiye gölüne vardığında göldeki suyu içer. Son kısmı oraya geldiğinde 'Bu gölde eskiden su vardı' derler. Allah 'ın Nebii İsa ve beraberinde bulunanlar kuşatılır. (O hale gelirler ki bir öküzün başı onlar için yüz dinardan daha hayırlı olur. Allah'ın Nebii İsa ve beraberinde bulunanlar Yüce Allah'a dua ederler. Allah onlann boyunlanna bir böcek gönderir ve sanki bir kimsenin ölmesi gibi tümü birden ölü hale gelirler. Sonra Allah'ın Nebii İsa ve beraberinde bulunanlar yere inerler. Yeryüzünde onlann kan ve pis kokulannın olmadığı bir kanş yer bulamazlar. İsa ve beraberindekiler Allah'a dua ederler. Yüce Allah Horasan develerinin başı gibi bir kuş sürüsü gönderir. Bunlar leşleri yerden alıp Yüce Allah 'ın dilediği bir yere atar/ar. Sonra Allah bir yağmur gönderir. Bu yağmur sayesinde hiçbir çamur veya kıldan yapılmış ev kalmaz. Yağmur bütün yeryüzünü yıkayıp, ayna gibi yapar. Sonra yeryüzüne 'Meyven i bitir, eski bereketini tekrar getir' denir. O gün orada bulunan topluluk nardan yer ve altında gölgelenir. Onlar bu durumda iken Yüce Allah hoş bir esinti gönderir. Bu, onlan koltuklannın altından alır ve her mu'min ve Müslümanın ruhunu kabzeder. Geriye insanlann kötüleri kalır, onlar tıpkı eşeklerin yaptığı gibi birbirleriyle açıktan ilişkide bulunur ve kıyamet onlann başına kopar.\"(Müslim, fiten) Hadiste geçen \"ez-zelefe\" ayna demektir. Bazıları bunun suyu toplamak için yapılan biralet olduğunu söylemişlerdir. Söylenmek istenen şudur: Su yeryüzünün her tarafını kaplar, yeryüzünü öyle temizler ki yere bakan kimse orada kendi yüzünü görür. Yine Müslim' de yer alan bir başka rivayete göre Ye' cüc ve Me' cüc \"Yeryüzündekileri öldürdük. Şimdi gidip göktekileri öldürelim\" derler ve oklarını göğe doğru fırlatırlar. Bunun üzerine Yüce Allah oklarını kana bulanmış olarak onlara iade eder. (Müslim, fiten)",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 83
			}
		}
	]
}