{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"93": "Judgments (Ahkaam)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7137,
			"arabicnumber": 7137,
			"text": "ez-Zuhrî şöyle demiştir: Bana Ebû Seleme ibnu Abdirrahmân haber verdi ki, kendisi Ebû Hureyre (radıyallahü anh)'den şöyle derken işitmiştir: Rasûlüllah(sallallahü aleyhi ve sellem):\"Her kim bana itaat ederse, Allah'a itaat etmiştir. Her kim bana isyan ederse, Allah'a isyan etmiştir. Her kim benim emîrime itaat ederse, bana itaat etmiştir. Her kim de benim emîrime isyan ederse, bana isyan etmiştir\" buyurdu",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 7138,
			"arabicnumber": 7138,
			"text": "Bana Mâlik, Abdullah ibn Dinar'dan; o da Abdullah ibn Omer (radıyallahü anh) 'den tahdîs etti ki, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: \"Dikkat ediniz! Herbirerleriniz güdücüdür ve herbirerleriniz elinin altındakilerden sorumludur. Şöyle ki, insanlar üzerinde bulunan en büyük imâm (yâni devlet başkanı) da bir güdücüdür ve o da idaresi altında bulunanlardan sorumludur. Erkek, kendi ev halkı üzerinde bir güdücüdür, o da eli altındakilerden sorumludur. Kadın da kocasının ev halkı ve çocukları üzerinde bir güdücüdür ve o da onlardan sorumludur. İnsanın hizmetçisi de efendisinin malı üzerinde bir güdücüdür ve o da o malların korunmasından sorumludur. Dikkat edin! Hâsılı herbirerleriniz güdücü ve herbirerleriniz güttüğünüz şeylerden sorumlusunuz",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 7139,
			"arabicnumber": 7139,
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 7140,
			"arabicnumber": 7140,
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 7141,
			"arabicnumber": 7141,
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 7142,
			"arabicnumber": 7142,
			"text": "Enes ibn Mâlik (radıyallahü anh) şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem) şöyle buyurdu: \"Sizler valilerinizin, kumandanlarınızın emirlerini dinleyiniz ve onlara itaat ediniz; üzerinize ta'yîn olunan vâlî, başı siyah kuru üzüm gibi Habeşli bir köle olsa bile",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 7143,
			"arabicnumber": 7143,
			"text": "İbn Abbâs radıyallahü anhüma şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) şöyle buyurdu: \"Her kim emîrinden kerîh gördüğü bir iş meydana geldiğini görürse, onun fenalığına sabretsin (isyan etmesin). Çünkü her kim (İslâm) camiasından bir karış ayrılır da ölürse, muhakkak o, Câhiliyet ölümü ile ölür",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 7144,
			"arabicnumber": 7144,
			"text": "Bana Nâfî Abdullah ibn Omer (radıyallahü anh) 'den tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem):\"Devlet âmirlerinin sevdiği yahut sevmediği hususlardaki emirlerini dinlemek ve ma'siyetle emrolunmadıkça itaat ve icabet etmek müslim kişi üzerine vâcib bir haktır. Ma'siyetle emrolunduğu zaman da onları dinlemek ve boyun eğmek yoktur\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 7145,
			"arabicnumber": 7145,
			"text": "Alî ibn Ebî Tâlib (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) bir seriyye gönderdi de başlarına Ensâr'dan bir adamı kumandan ta'yin etti ve askerlere kumandanlarına itaat etmelerini emretti. Yolda kumandan maiyyetine öfkelendi de: Peygamber(sallallahü aleyhi ve sellem) bana itaat etmenizi emretmiş değil mi? dedi. Askerler: Evet emretti! dediler. Kumandan: Kat'î olarak size emrettim ki, muhakkak odun toplayacaksınız ve bir ateş yakacaksınız, sonra da ateşin içine gireceksiniz! dedi. odun topladılar, bir ateş yaktılar. (Bâzısı) ateşin içine girmeyi kasdettikleri zaman, bir kısmı diğer bir kısmına bakmaya ve: Bizler Peygamber'e ancak ateşten kaçmak için tâbi' olmuşuzdur; böyle iken şimdi biz bu ateşe girer miyiz? dedi. böyle konuşma yaptıkları sırada ateşin alevi söndü ve kumandanın da öfkesi sâkinleşti. Sonra bu vak'a Peygamber'e zikrolununca, Peygamber(sallallahü aleyhi ve sellem): \"Eğer mucâhidler bu ateşe girseler di, ebediyyen ondan dışarı çıkamazlardı. Çünkü âmire itaat, ancak ma'kûl ve meşru' olan emirler hakkındadır\" buyurdu",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 7146,
			"arabicnumber": 7146,
			"text": "Abdurrahmân ibn Semure (radıyallahü anh) şöyle demiştir;Peygamber(sallallahü aleyhi ve sellem) bana şu öğüdü verdi: \"Yâ Abderrahmân! Sen kimseden emirlik isteme! Eğer sen isteyerek sana emaret ve başkanlık verilirse, istediğin şey ile yalnız bırakılırsın. Eğer emirlik ve başkanlık, sen istemeden sana verilirse, (Allah tarafından) emirlik işi üzerinde yardım olunursun. Bir de sen birşeye yemîn edip de başkasını ondan daha hayırlı gördüğünde, yemininden keffâret verip, o hayırlı işi işle",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 7147,
			"arabicnumber": 7147,
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 7148,
			"arabicnumber": 7148,
			"text": "Bize İbnu Ebî Zi'b, Saîd el-Makburî'den; o da Ebû Hureyre (radıyallahü anh)'den tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem) şöyle buyurmuştur: \"Muhakkak ki sizler emarete (yüksek idare mevki' ve makaamlarına) çok hırslı oluyorsunuz- Halbuki emaret (kötü idareciler için) kıyâmet gününde nedamet olacaktır. O yüksek mevki' ne güzel süt-anadır (emmekle doyulmaz), fakat ondan ayrılmak da memeden fena bir ayrılıştır (ki, hüznü çekilmez)",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 7149,
			"arabicnumber": 7149,
			"text": "Ebû Mûsâ (radıyallahü anh) şöyle demiştir: Ben, beraberimde kavmim Eş'arîler'den iki kimseyle Peygamber'in huzuruna girmiştim. O iki adamdan biri: Yâ Rasûlallah, beni bir me'mûriyete ta'yîn et! dedi. Diğeri de bunun gibi bir me'mûriyet istedi. üzerine Rasûlüllah(sallallahü aleyhi ve sellem): \"Biz bu iş üzerine onu isteyen ve ona hırslı olan kimseyi ta'yîn etmeyiz\" buyurdu",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 7150,
			"arabicnumber": 7150,
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 7151,
			"arabicnumber": 7151,
			"text": "Hasen Basrî şöyle demiştir: Biz Ma'kıl ibn Yesâr (radıyallahü anh)'a geldik de kendisine hasta ziyareti yapıyorduk. Bu sırada yanımıza vâli Ubeydullah girdi. Ma’kıl da vâliye hemen şöyle dedi: Ben sana Resûlüllah(sallallahü aleyhi ve sellem)tan işittiğim bir hadîs tahdîs edeceğim: “Müslümanlardan bir ahâliye vâlik eden vâli, o ahâliyi aldatıp zulmetmiş olduğu halde ölürse, muhakkak Allah ona cenneti haram etmiştir”",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 7152,
			"arabicnumber": 7152,
			"text": "Tarîf Ebû Temime şöyle dedi: Ben, tabiî âlimi Safvân ibn Muharrız'a, sahâbî Cundeb ibn Abdillah el-Becelî'ye ve Safvân'ın arkadaşlarına, bir mecliste hâzır bulunup şâhid oldum. Cundeb onlara vasiyet ediyordu. Safvân ve arkadaşları Cundeb'e: Sen Rasûlüllah(sallallahü aleyhi ve sellem)'tan herhangi birşey işittin mi? dediler (de onu söylemesini istediler). de onlara şöyle dedi: (Evet.) Ben Rasûlüllah(sallallahü aleyhi ve sellem)'tan işittim: \"Her kim duyulsun diye bir iş işlerse, kıyâmet gününde Allah da onun rüsvâylığını duyurur\" buyuruyordu. Yine Rasûlüllah: \"Her kim de halka meşakkat ve zahmet verirse, Allah da kıyâmet gününde o kimseyi azâb ile cezalandırır\" buyurdu. üzerine tabiîler Cundeb'e: Bize daha vasiyet et! diye rica ettiler. Cundeb de şöyle dedi: \"İnsanın (öldükten sonra) ilk önce kokuşan organı karnıdır. Her kim şübheli kazançlardan çekinip yalnız halâl lokma ile geçinmeye gücü yeterse, bunu yapsın! Her kim de kendisiyle cennet arasını (haksız yere) döktüğü kan ile dolu eliyle ayırmamaya gücü yeterse, bunu da yapsın!\" Sahîh'inin râvîsi Firabrî şöyle dedi:) Ben, Ebû Abdillah Muhammed ibn İsmâîl el-Buhârî'ye: hadîsi Rasûlüllah'tan işittim\" diyen Cundeb midir? diye sordum. Evet Cundeb'dir! diye cevâb verdi",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 7153,
			"arabicnumber": 7153,
			"text": "Enes ibn Mâlik (radıyallahü anh) tahdîs edip şöyle demiştir: Ben ve Peygamber (sallallahü aleyhi ve sellem) beraber mescidden çıktığımız sırada mescid kapısı üzerindeki gölgeliğin yanında bize bir adam kavuştu da: Yâ Rasûlallah! Kıyâmet ne zaman kopacak? diye sordu. Peygamber de ona: \"Sen kıyâmet için ne hazırladın?\"diye sordu. adam sanki boyun eğdi (yahut bir hâlden diğer bir hâle geçti), sonra da: Yâ Rasûlallah, ben âhiret için oruçtan, namazdan, sadakadan çok bir hazırlık yapmadım. Lâkin ben Allah'ı ve Rasûlü'nü seviyorum! diye cevâb verdi. \"Sen sevdiğin kimse ile berabersin!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 7154,
			"arabicnumber": 7154,
			"text": "Bize Sabit el-Bunânî tahdîs etti ki, Enes ibn Mâlik (radıyallahü anh) kendi ehlinden bir kadına hitaben: Sen fulânca kadını tanıyor musun? diye soruyordu. O kadın: Evet ben onu tanıyorum, dedi. şöyle dedi: Peygamber(sallallahü aleyhi ve sellem), o kadın bir kabir yanında ağlamakta iken yanına uğradı da ona: \" (Ey Allah'ın dişi kulu!) Allah'tan kork ve sabreyle!\" buyurdu. Haydin benden uzaklaş! Çünkü Sen benim musibetimden boşsun (yani musîbetlenmiş değilsin)! dedi. dedi ki: Bunun üzerine Rasûlüllah o kadından öteye geçti ve yürüdü. Arkasından o kadının yanına bir adam (Fadl ibn Abbâs) uğradı ve ona: Rasûlüllah sana ne söyledi? diye sordu. Kadın ona: Ben O'nun Rasûlüllah olduğunu tanımadım, dedi. zât: Şübhesiz ki, O elbette Allah'ın Rasûlü'dür, dedi. dedi ki: Akabinde o kadın Peygamber'in kapısına geldi de, O'nun kapısı yanında hiçbir kapıcı bulmadı ve: Yâ Rasûlallah! Allah'a yemîn ederim ki, ben Seni tanıyamadım! dedi. de ona: kemâli, musibetin birinci darbesi sırasındadır'' buyurdu",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 7155,
			"arabicnumber": 7155,
			"text": "Bize babam Abdullah ibnu'l-Musennâ, babasının amcası Sumâme'den tahdîs etti ki, Enes ibn Mâlik (radıyallahü anh) Kays ibn Sa'd (ibn Ubâde el-Ensârî el-Hazrecî)Peygamber(sallallahü aleyhi ve sellem)'in önünde emîr tarafından (emniyeti korumak için ta'yîn olunmuş bulunan) şurtalar sahibi, menzilesinde olur idi, demiştir",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 7156,
			"arabicnumber": 7156,
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 7157,
			"arabicnumber": 7157,
			"text": "Bize Hâlid el-Hazzâ, Humeyd ibn Hilâl'den; o da Ebû Burde'den; o da Ebû Mûsâ(radıyallahü anh)'dan tahdîs etti ki, bir adam müslümân olmuş, sonra da Yahûdîliğe dönmüştü. Bu dîninden dönen kişi Ebû Musa'nın yanında bağlanmış hâlde dururken, Muâz ibn Cebel de oraya gelmiş ve: Bu bağlı adamın hâli nedir? diye sormuştur. Ebû Mûsâ da ona: Bu zât İslâm'a girmiş, bundan sonra da Yahûdî olmuştur! diye cevâb verdi. ibn Cebel: Ben bu dîninden dönen adamı Allah'ın hükmü ve Rasûlü'nün hükmü olarak öldürmedikçe yere oturmam! demiştir",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 7158,
			"arabicnumber": 7158,
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 7159,
			"arabicnumber": 7159,
			"text": "Ebû Mes'ûd el-Ensârî (radıyallahü anh) şöyle demiştir: Bir defaRasûlüllah'a bir adam geldi de: Yâ Rasûlallah! Fulân zât bize namaz kıldırırken o kadar uzatıyor ki, vallahi sabah namazına gitmekten geri kalıyorum! dedi. Mes'ûd dedi ki: Bunun üzerine Rasûlüllah öfke ve heyecan içinde bir hutbe yaptı ki, kendisini o günkü kadar hiçbir mev'izesinde o derece heyecan gösterdiğini görmemiştim. Rasûlüllah(hutbe girişinden sonra) şöyle buyurdu: \"Ey insanlar! İçinizden cemâati nefret ettirip kaçıranlar vardır! Herhangibiriniz insanlara namaz kıldıracak olursa hafif kıldırsın. Çünkü cemâatin içinde ihtiyar olanı var, zayıf olanı var, iş-güç sahibi olanı vardır",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 7160,
			"arabicnumber": 7160,
			"text": "Muhammed ez-Zuhrî şöyle dedi: Bana Salim haber verdi ki, ona da babası Abdullah ibn Omer (radıyallahü anh) şöyle haber vermiştir: Kendisi hayız hâlinde bulunan karısını Peygamber zamanında boşamıştı. Babası Omer ibnu'l-Hattâb, oğlunun bu hareketini Peygamber'e zikretmiş, bundan dolayı Rasûlüllah (sallallahü aleyhi ve sellem), İbn Omer'in bu hareketi hakkında öfkelenmiş, sonra: \"Abdullah karısına dönsün! Sonra temizleninceye, sonra tekrar hayız oluncaya, sonra tekrar temizleninceye kadar onu kendi yanında tutsun (yani onunla birlikte yaşasın). Kadın ikinci âdetinden temizlendikten sonra, kadını boşamak fikri kendisine zahir olursa, o takdirde -kadını ile cinsî münâsebet yapmaksızın- kadınını boşasın\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 7161,
			"arabicnumber": 7161,
			"text": "Bize Şuayb, ez-Zuhrî'den haber verdi: Bana Urve tahdîs etti ki, Âişe(r.anha) şöyle demiştir:Utbe ibn Rabîa'nın kızı Hind geldi de şöyle dedi: Yâ Rasûlallah! Allah'a yemîn ederim ki, vaktiyle yeryüzünde ev bark sahibi ailelerden hiçbir ailenin zelîl olmaları, bana Sen'in aile halkının zelîl olmaları kadar sevimli olmazdı. Sonra bu güne gelince, yeryüzünde hiçbir aile halkının aziz olmaları bana, Sen'in aile halkının azîz olması ve saadeti derecesinde sevimli değildir! dedi... Hind şöyle devam etti: Muhakkak ki, Ebû Sufyân malını çok sıkı tutucu bir adamdır. Bunun için ben, onun aile ferdlerinden olan kimseleri onun malından doyurmamda benim üzerime bir günâh var mıdır? diye sordu. da ona: \"Onun aile ferdlerinden olan kimseleri onun malından örfe göre doyurmanda sana hiçbir günâh yoktur\" buyurdu",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 7162,
			"arabicnumber": 7162,
			"text": "Bize Şu'be tahdîs edip şöyle dedi: Ben Katâde'den işittim, Enes ibn Mâlik (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) Rûmlar'a mektûb yazmak istediği zaman, sahâbîler: ancak üzeri mühürlenmiş bulunan mektubu okurlar! dediler. üzerine Peygamber gümüşten yapılmış bir mühür yüzük edindi. Onun Peygamber'in parmağındaki parlaması hâlâ gözümün önündedir. O mühür yüzüğün nakşı \"MuhammedRasûlüllah\" idi",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 7163,
			"arabicnumber": 7163,
			"text": "Bize Şuayb, ez-Zuhrî'den haber verdi: Bana Nemîr'in kızkardeşi oğlu es-Sâib ibnu Yezîd haber verdi ki, ona da Huveytıb ibn Abdiluzzâ haber vermiş, ona da Abdullah ibnu's-Sa'dî şöyle haber vermiştir: Kendisi, halifeliği zamanında Omer ibnu'l-Hattâb'ın yanına gelmişti. Omer de ona: Senin insanların vâlîlik ve hâkimlik gibi birtakım işlerini üzerine almakta olduğun ve çalışmanın ücreti sana verildiğinde bunu almak istemediğin bana haber verilmedi mi? dedi. da dedi ki: Ben: Evet böyledir, (benim ücrete ihtiyâcım olmadığı için reddettim), dedim. üzerine Omer bana: Bu redd ile neyi kasdediyorsun? dedi. de ona: Benim birçok beygirlerim ve kölelerim vardır, ben hayırlı ve rahat bir yaşayış içindeyim. Ben bu hizmetlerimin ücretinin müslümânlar üzerine sadaka olmasını arzu ediyorum, dedim. bana: Sen ücreti reddetme işini yapma! Çünkü ben de vaktiyle senin yapmak istediğin işi yapmak istedim. Şöyle ki: Rasûlüllah(sallallahü aleyhi ve sellem) bana, gördüğüm devlet işlerine karşılık Beytu'l-mâl'den atıyyemi verirdi de ben de O'na: Sen bu hissemi benden daha fakir olan kimselere ver! der idim. Nihayet bana büyük bir mal daha verdi. Ben yine O'na: (Yâ Rasûlallah!) Sen bunu benden daha muhtâc olanlara ver! dedim. Bunun üzerine Peygamber(sallallahü aleyhi ve sellem) bana: \"Sen bunu al da kendine mal yap ve yahut sadaka yap! Harîs olmadığın ve isteyicisi de bulunmadığın hâlde sana bu maldan birşey geldiğinde, sen onu al. Böyle kendi gelmeyen ve nefsin kendisine meylettiği bir malın arkasından nefsini ta'kîb ettirme!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 7164,
			"arabicnumber": 7164,
			"text": "Ve ez-Zuhrî şöyle dedi: Bana Salim ibn Abdillah tahdîs etti ki, Abdullah ibn Omer şöyle demiştir: Ben babam Omer'den işittim, şöyle diyordu: Peygamber(sallallahü aleyhi ve sellem) bana devlet hizmetim karşılığı olan atâmı verirdi, ben de O'na: benden daha muhtâc olanlara ver! derdim. Nihayet bana bir kerre daha mal verdi. Ben yine O'na: benden daha muhtâc olanlara ver! dedim. Bunun üzerine Peygamber (sallallahü aleyhi ve sellem) bana: \"Sen bunu al da kendine mal yap ve kendin sadaka yap. Kendin harîs olmadığın ve isteyicisi de bulunmadığın hâlde sana bu maldan birşey geldiğinde sen onu al. Böyle kendi gelmeyen ve nefsin kendisine meylettiği bir malın arkasından nefsini ta'kîb ettirme!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 7165,
			"arabicnumber": 7165,
			"text": "Bize Suyfân ibn Uyeyne tahdîs etti. ez-Zuhrî şöyle demiştir: Sehl ibn Sa'd(radıyallahü anh): Ben onbeş yaşında iken (Uveymir ile Havle bintu Kays'ın) la'netleşmelerinde hazır bulundum;Rasûlüllah onların arasını ayırdı, demiştir",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 7166,
			"arabicnumber": 7166,
			"text": "İbn Cureyc haber verip şöyle demiştir: Bana İbn Şihâb, Sâide oğulları'nın kardeşi olan Sehl ibn Sa'd'den şöyle haber verdi: Ensâr'dan (Uveymir el-Aclânî denen) bir adam Peygamber(sallallahü aleyhi ve sellem)'e geldi de: Karısının beraberinde bir adam bulan kimse hakkında ne dersin? Bu adam onu öldürür mü? diye sordu. bu karı-koca mescidde la'netleşme yaptılar, ben de orada hazır bulundum",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 7167,
			"arabicnumber": 7167,
			"text": "Ebû Hureyre (radıyallahü anh) şöyle demiştir: Rasûlüllah mescidde iken (Mâiz adındaki) adam geldi de: Yâ Rasûlallah, ben zina ettim! diye nida etti. Rasûlüllah ondan yüz çevirdi. O zât kendi nefsi aleyhine dört kerre zina i'tirâfı yapınca,Rasûlüllah ona: \"Sende delilik var mı?\" diye sordu. O zât: Hayır, bende delilik yoktur, dedi.Rasûlüllah(sallallahü aleyhi ve sellem): \"Bunu götürün de taşla öldürünüz!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 7168,
			"arabicnumber": 7168,
			"text": "İbn Şihâb şöyle dedi: Bana Câbir ibn Abdillah'tan işiten kimse haber verip: Ben (Bâkı' yakınındaki cenaze namazı kılınan) Musallâ'da onu taşlayan kimselerin içinde idim, dedi. hadîsi Yûnus ibn Yezîd, Ma'mer ibn Râşid ve İbn Cureyc de ez-Zuhrî'den; o da Ebû Seleme'den; o da Câbir'den; o daPeygamber(sallallahü aleyhi ve sellem)'den olmak üzere \"Recm\"de rivayet etmişlerdir",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 7169,
			"arabicnumber": 7169,
			"text": "Ebû Seleme'nin kızı Zeyneb'den; o da Ümmü Seleme (radıyallahü anha)'den tahdîs etti ki, Rasûlüllah(sallallahü aleyhi ve sellem) şöyle buyurmuştur: \"Şübhesiz ben de ancak bir insanım. Sizler bana da'vâlarınızı arzediyorsunuz. Belki bâzınız hüccetini diğerinden daha düzgün ifâde etmiş olabilir. Ben de ondan işitmekte olduğuma göre hükmederim. Binâenaleyh ben her kimin kardeşinin hakkı olan birşeyi onun lehine hükmetmiş isem, sakın onu almasın. Ben ona ancak ateşten bir parça hükmedip kesmekteyimdir",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 7170,
			"arabicnumber": 7170,
			"text": "Bize el-Leys, Yahya ibn Saîd'den; o da Amr ibn Kesîr'den; o da Ebû Katâde'nin âzâdlısı Ebû Muhammed'den tahdîs etti ki, Ebû Katâde (radıyallahü anh) şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem) Huneyn günü: \"Her kim bir düşman öldürür ve öldürdüğüne dâir beyyinesi de olursa, öldürdüğü kimsenin elbise, silâh ve diğer eşyaları onundur!” buyurdu. üzerine ben öldürmüş olduğum maktul için bir beyyine, bir şâhid aramağa kalktım. Fakat benim için onu öldürdüğüme şâhidlik yapacak hiçbir kimse bulamadım. Bunun üzerine oturdum. Sonra bende şu hâl meydana geldi: Ben o sırada bir adamın Rasûlüllah'a sözünü hatırladım. Onun meclisinde oturanlardan bir adam (Esved ibn Huzâî el-Eslemî): Şu Ebû Katâde'nin zikretmekte olduğu maktulün silâhları benim yanımdadır. dedi ki: O adam, Rasûlüllah'a: Ebû Katâde'yi o maktulün silâhları yerine başka şeyler ile raâzı kıl! dedi. üzerine Ebû Bekr: Hayır bu olmaz! Peygamber, Allah ve Rasûlü yolunda mukaatele eden bir arslanı bırakıp da, onun payını Kureyş'ten küçük bir çakala vermez! dedi. Katâde dedi ki: Bunun üzerine Rasûlüllah(sallallahü aleyhi ve sellem), o maktulün silâh ve eşyaları yanında bulunmakta olan adama emretti de, o da bu silâh ve eşyaları bana teslîm etti. Ben de onları sattım da bedeliyle bir bustân satın aldım. İşte bu bustân, benim aslına mâlik olduğum ilk maldır. şöyle dedi: el-Leys ibn Sa'd’ın kâtibi olan Abdullah ibn Salih bana el-Leys'ten olmak üzere şöyle dedi: Ebû Katâde: Peygamber(sallallahü aleyhi ve sellem) ayağa kalktı da o maktulün silâh ve eşyalarını bana teslîm etti, demiştir. ehli (yani Mâlik ve bu hususta ona uyanlar): Hâkim, hâkimliği üzerine aldığı zaman yahut daha önceden birşeye şâhid olup da bilmekte olduğu ilmiyle hüküm veremez. Eğer bir hasım, hâkimin yanında hüküm verme meclisinde diğer bir kimse lehine bir hakk ikrar eylese, bâzı fakîhlerin görüşünde o hâkim bunun üzerine hüküm veremez. Ancak o hâkim ayrıca iki şâhid çağırır ve onları mahkemede bu hasmın ikrarında hazır bulundurmak suretiyle hükmeder, dediler. Irak ehli de (Ebû Hanîfe ve tâbi'leri) şöyle dedi: Kaadı, hüküm meclisinde işittiği yahut gördüğü şeyle hükmeder; hüküm meclisi dışında olan şeylerle o hususta hüküm vermez, ancak ikrarında hazır bulunduracağı iki şahidin şehâdetiyle hükmeder. ehlinden diğer bâzıları da (Ebû Yûsuf ve ona tâbi' olanlar): Hâkim, iki şâhid olmadan da hükmeder, çünkü hâkim i'timâd edilip güvenilmiş bir kimsedir. Çünkü şehâdetten murâd edilen, ancak hakkı bilmektir. Hâkimin ilmi ise şehâdetten daha çoktur! dediler. ehlinin bâzısı da: Hâkim, mallar hususunda kendi ilmi ile hüküm verir, fakat mallar dışındaki da'vâlarda (meselâ bir adamı zina ederken görse, bunu huzurunda şehâdetle beyyine olmadıkça) kendi ilmi ile hükmedemez, dediler. (Bu, Ebû Hanîfe ve Ebû Yûsuf'tan nakledilmiştir.) ibn Muhammed ibn Ebî Bekr de şöyle demiştir: Hâkim için başkasının ilmi olmaksızın sırf kendi ilmi ile bir hüküm verip infaz etmesi olamaz, kendi ilmi başkasının şehâdetinden daha çok olmakla beraber (bu doğru olmaz). Çünkü beyyinesiz olarak sırf kendi ilmiyle hüküm vermekte müslümânlar katında kendi nefsini töhmete atmak ve onların gönüllerine fâsid zannlar düşürmek vardır. Peygamber(sallallahü aleyhi ve sellem) de zannı kerih görmüş de (gelecek hadîste): \"Bu kadın ancak Safiyye'dir\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 7171,
			"arabicnumber": 7171,
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 7172,
			"arabicnumber": 7172,
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 7173,
			"arabicnumber": 7173,
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 7174,
			"arabicnumber": 7174,
			"text": "Bize Sufyân ibn Uyeyne tahdîs etti ki, ez-Zuhrî, Urve'den işitmiştir. Bize Ebû Humeyd es-Sâidî (radıyallahü anh) haber verip şöyle dedi: Peygamber(sallallahü aleyhi ve sellem) Esed oğulları'ndan İbnu'l-Utbiyye denilen bir adamı Suleym oğulları zekâtını toplamak üzere me'mûr ta'yîn etti. Bu adam zekât malını alıp geldiğinde: (Yâ Rasûlallah!) Bu sizin zekât malınızdır, bu da bana hediye verilmiştir! dedi. üzerine Peygamber minber üstünde ayağa kalkıp bir hutbe yaptı. Sufyân ibn Uyeyne yine şöyle dedi:Peygamber minbere çıktı da Allah'a hamd ve yakışan sıfatlarla övdü, bundan sonra şöyle buyurdu: \"Birtakım devlet me'mûrunun hâli nedir ki, ben onu bir me'mûriyet üzerine gönderiyorum da, o akabinde geliyor ve 'Şu sizin malınızdır, şu da bana âid maldır' diyerek, kendisine bir pay ayırıyor? Bu adam (bir mal me'mûru olmayıp da) babasının yahut anasının evinde otursaydı da o zaman kendisine hediye verilir miydi yahut verilmez miydi baksaydı ya! Nefsim elinde bulunan Allah 'a yemîn ederim ki, zekât âmillerinden herhangibir kişi Beytu'l-mâl’den haksız olarak birşey alırsa, kıyâmet gününde muhakkak o kimse çaldığı malı boynuna yüklenerek haşrolup gelecektir: Çaldığı hayvan deve ise omuzunda musîbetli develer gibi inliyerek; eğer sığır ise omuz kökünde avaz avaz bağırarak; koyun ise şiddetle feryâd ederek Arasat meydanına getirilecektir!\" buyurdu. ellerini, biz O'nun koltuk altlarının kırmızıya karışık beyaz rengini görünceye kadar kaldırdı ve üç defa: \"Yâ Rabb! Emirlerini tebliğ ettim mi? Emirlerini tebliğ ettim mi? Emirlerini tebliğ ettim mi?\" diye sordu. ibn Uyeyne geçen senedle şöyle dedi: Bu hadîsi bize ez-Zuhrî kıssa edip anlattı. Ve Hişâm da babası Urve'den şunu ziyâde etti: Ebû Humeyd (radıyallahü anh): Ben bu hadîsiRasûlüllah'tan dinlerken iki kulağım işitti, kendisini de bunu söylerken iki gözüm gördü. Sizler bunu Zeyd ibn Sâbit'e de sorunuz. Çünkü o da benimle beraber bu konuşmayı işitmiştir, dedi. \"İki kulağım işitti\" dememiştir. şöyle dedi: \"Huvâr\", \"Savt\" demektir. \"el-Cuâru\", sığırın sesi gibi \"Tec'erûne(Böğürüyorlar)\" ma'nâsındandır",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 7175,
			"arabicnumber": 7175,
			"text": "Bize İbnu Cureyc haber verdi. Ona da Nâfi' haber verdi. Ona da İbn Omer (radıyallahü anh) haber verip şöyle demiştir: Ebû Huzeyfe'nin kölesi Salim, Medine'ye ilk hicret etmiş olan Muhâcirler'e ve Peygamber'in sahâbîlerine Kubâ Mescidi'nde imamlık eder idi. Bu cemâatin içinde Ebû Bekr es-Sıddîk, Omer ibnu'l-Hattâb, (Mü'minlerin annesi Ümmü Seleme'nin Peygamber'den önceki kocası) Ebû Seleme ibn Abdi’l-Esed el-Mahzûmî, Zeyd ibn Harise -yahut: İlk Muhâcirler'den Zeyd ibnu'l-Hattâb el-Adevî- ve Âmir ibnu Rabîa el-Anezî vardı",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 7177,
			"arabicnumber": 7177,
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 7178,
			"arabicnumber": 7178,
			"text": "Bize Âsim ibnu Muhammed ibn Zeyd ibn Abdillah ibn Omer, babası Muhammed ibn Zeyd'den tahdîs etti: Birtakım insanlar İbn Omer (radıyallahü anh) 'e:' Bizler sultânımızın huzuruna giriyoruz da onlar lehine; onların yanından dışarı çıktığımız zaman, konuşmakta olduklarımızın zıddını söylüyoruz! dediler. Omer: Biz bu fiili (Peygamber zamanında) münâfıklık sayıyorduk, dedi",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 7179,
			"arabicnumber": 7179,
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 7180,
			"arabicnumber": 7180,
			"text": "Bize Sufyân ibn Uyeyne, Hişâm'dan; o da babası Urve'den; o da Âişe (r.anha)'den tahdîs etti ki, Ebû Sufyân'ın karısı Hind bintu Utbe ibn Rabîa, Peygamber(sallallahü aleyhi ve sellem)'e: Şübhesiz Ebû Sufyân çok cimri bir adamdır, ben onun malından almaya muhtâc oluyorum! dedi. de ona: \"Örfe göre sâna ve çocuklarına yetecek mikdâr al!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 7181,
			"arabicnumber": 7181,
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 7182,
			"arabicnumber": 7182,
			"text": "Âişe (r.anha) şöyle demiştir: Utbe ibn Ebî Vakkaas, kardeşi Sa'd ibn Ebî Vakkaas'a vasiyet edip: Zem'a’nın cariyesi oğlu (Abdurrahmân) bendendir. Bu çocuğu almalısın! demiş. dedi ki: Mekke'nin fethi senesi(Mekke'ye varıldığında) Sa'd ibn Ebî Vakkaas, çocuğu yakaladı ve: Bu, kardeşim Utbe'nin oğludur. Bunun nesebinin kendisine katılması için bana vasiyet etmiştir, dedi. üzerine Abd ibn Zem'a ayağa kalkıp: Bu benim kardeşimdir, babamın cariyesinin oğludur; babamın döşeği üstünde doğmuştur, dedi. iki taraf bu niza' ve da'vâlarını arka arkaya Rasûlüllah'a arzettiler. Sa'd ibn Ebî Vakkaas: Yâ Rasûlallah, bu çocuk, kardeşim Utbe'nin oğludur. Nesebinin kendisine katılmasına dâir bana vasiyeti vardır, dedi. ibn Zem'a da: Bu, benim kardeşimdir ve babamın cariyesi doğurmuştur; babamın döşeği üstünde doğmuştur, dedi. aleyhi ve sellem): \"Yâ Abd ibne Zem 'a! Bu (Abdurrahmân), senin (kardeşin)dir\" da Rasûlüllah: \"Çocuk, döşek sahibinindir; zina edene de mahrumiyet vardır\" buyurdu. da Rasûlüllah, da'vâ konusu olan bu çocuğun sîmâca Utbe'ye benzediğini görerek, zevcesi Sevde bintu Zem'a'ya: \"Ey Sevde! Bundan sonra sen de Abdurrahmân'dan perde arkasına çekil!\" buyurdu. sonra Abdurrahmân, Sevde (vefat edip de) Yüce Allah'a kavuşuncaya kadar mü'minlerin annesinin yüzünü görmedi",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 7184,
			"arabicnumber": 7184,
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 7185,
			"arabicnumber": 7185,
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 7186,
			"arabicnumber": 7186,
			"text": "Bize Seleme ibnu Kuheyl, Atâ ibn Ebî Rebâh'tan tahdîs etti ki, Câbir ibn Abdillah (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem)'e sahâbîlerinden (Ebû Mezkûr denilen) bir adamın kölesini \"Hayâtımdan sonra sen hürsün\" deyip rnüdebber olarak azâd ettiği haberi ulaştı. Halbuki bu zâtın bu köleden başka hiçbir malı yoktu. Peygamber(sallallahü aleyhi ve sellem) o köleyi sekizyüz dirhem rnukaabilinde sattı da sonra onun bedelini o zâta gönderdi",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 7187,
			"arabicnumber": 7187,
			"text": "Bize Abdullah ibn Dînâr tahdîs edip şöyle dedi: Ben İbnu Omer (radıyallahü anh) 'den işittim, şöyle diyordu: Rasûlüllah(sallallahü aleyhi ve sellem) bir ordu birliği hazırladı da başına Zeyd'in karısının oğlu Usâme'yi kumandan yaptı. Akabinde onun kumandanlığı konusunda i'tirâzlar yapıldı. Rasûlüllah(sallallahü aleyhi ve sellem): \"Sizler şimdi Usâme'nin kumandanlığı hususuna ta'n ediyorsanız, muhakkak ki siz bundan önce onun babasının kumandanlığı hakkında da dil uzatmıştınız. Allah'a yemin ederim ki, Zeyd, kumandanlığa nasıl tamâmiyle lâyık olduysa ve o bana insanların en sevimlilerinden biri idiyse, hiç şübhesiz şu Usâme de babasından sonra bana insanların en sevimlilerindendir\" buyurdu",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 7188,
			"arabicnumber": 7188,
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 7189,
			"arabicnumber": 7189,
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 7190,
			"arabicnumber": 7190,
			"text": "Bize Ebû Hazım el-Medînî tahdîs etti ki, Sehl ibn Sa'd es-Sâidî şöyle demiştir: Medine civarındaki Ensâr'dan Amr ibn Avf oğulları arasında bir kavga vardı. Bu kavga Peygamber(sallallahü aleyhi ve sellem)'e ulaştı. Peygamber öğle namazını kıldıktan sonra, onların aralarını düzeltmek üzere yanlarına gitti. Nihayet ikindi namazı vakti gelince müezzin Bilâl ezan okudu, ikaamet etti ve Ebû Bekr'e namazı kıldırması için emretti. Ebû Bekr öne geçip namaza durdu. Ebû Bekr namaz içinde iken Peygamber geldi, insanların safflarını yara yara nihayet Ebû Bekr'in arkasına geldi ve ona yakın olan saffın içine geçip namaza durdu. dedi ki: İnsanlar (Ebû Bekr'e Peygamber'in gelişini haber vermek için) el çırptılar. Ebû Bekr ise namaza girdiği zaman, namazı bitirinceye kadar yüzünü başka tarafa çevirmezdi. Ebû Bekr cemâatin kendisi üzerine el çırpmasının durdurulmamasını görünce başım çevirdi ve Peygamber'i arkasında namaza durmuş gördü. Peygamber Ebû Bekr'e, namazını kıldırmağa devam et, diye işaret etti ve eliyle de yerinde durmasını işaret eyledi. Ebû Bekr yerinde birazcık eğlendi de Peygamber'in\"Yerinde dur\" sözünden dolayı Allah'a hamdediyordu. Sonra Ebû Bekr geri geri yürüyerek saffa girdi. Peygamber, Ebû Bekr'in geri çekildiğini görünce öne geçti ve Peygamber böylece insanlara bu namazı kıldırdı. Namazı bitirince: \"Yâ Ebâ Bekr! Ben sana yerinde olup namaza devam etmeni işaret ettiğim zaman seni yerinde durmaktan men' eden neydi?\" diye sordu. Bekr: Ebû Kuhâfe oğlu için Peygamber'in önünde imamlık yapması lâyık olmaz, dedi. sonra Peygamber, cemâate: \"Namazda iken size herhangibir iş ârız olursa erkekler tesbîh etsin, kadınlar da el çırpsın!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 7191,
			"arabicnumber": 7191,
			"text": "Zeyd ibn Sabit (radıyallahü anh) şöyle demiştir: Ebû Bekr, Yemâme'de şehîd olanların şehîd olmalarından dolayı bana geldi, yanında Omer de vardı. Ebû Bekr şunları söyledi: Omer bana geldi ve: Yemâme gününün şiddetli harbinde Kur'ân hafızlarından birçoğu şehîd oldu. Ben diğer harb sahalarında da harbin şiddetli olup Kur'ân hafızlarının şehîd edilmelerinden, bu sebeble de Kur'ân'dan büyükçe bir kısmın zayi' olup gitmesinden endîşe ediyorum. Binâenaleyh ben senin Kur'ân'ın kitâb hâlinde toplanmasını emretmeni düşünüyorum, dedi. Bekr, Zeyd'e şöyle dedi: Ben Omer'e: Rasûlüllah'ın yapmadığı bir işi nasıl yaparsın? dedim. Omer bana: Vallahi bu toplama bir hayırdır, dedi ve bana bu hususta müracaatta devam etti. Allah benim göğsümü, Omer'in göğsünü açmış olduğu iş için açtı da ben de bu işte Omer'in düşündüğü gibi düşündüm. dedi ki: Ebû Bekr bana şunları söyledi: Sen genç ve akıllı bir erkeksin. Biz seni hiçbir kusurla ittihâm etmiyoruz. Sen Rasûlüllah için vahyi yazıyordun. Binâenaleyh şimdi sen Kur'ân'ı tetebbu' et ve onu bir araya topla! buna karşı: Allah'a yemîn ederim ki, eğer bana dağlardan bir dağın nakledilmesini teklif etmiş olsalardı, o iş benim üzerime, Ebû Bekr'in bana teklîf ettiği bu Kur'ân'ı toplama işinden daha ağır olmazdı, dedi. dedi ki: Ben: Sizler Rasûlüllah'ın yapmadığı bir işi nasıl yapıyorsunuz? Bekr: Allah'a yemîn ederim ki, bu hayırlı bir iştir, dedi ve Ebû Bekr beni teşvik etmeğe, bana müracaata devam etti. Allah, Ebû Bekr'le Omer'in göğüslerini genişletip akıllarını yatırdığı bu işe benim de aklımı açtı ve gönlümü ferahlandırdı da ben de bu işi onların gördüğü gibi gördüm. Bunun üzerine ben de Kur'ân'ın ardına düşüp gereği gibi araştırdım ve onu yazılı bulunduğu hurma dallarından, inceltilmiş deri ve bez parçalarından, ince taş levhalardan ve hafızların ezberlerinden toplamağa koyuldum. Nihayet et-Tevbe Sûresi'nin sonunu \"Le-kad câekum rasûlun min en-fusikum azîzun aleyhi mâ anittum...\" âyetini nihayetine kadar Huzeyme'nin yahut Ebû Huzeyme el-Ensârî'nin beraberinde buldum. Ve en sonu o âyeti de Mushaf'taki sûresine kattım. toplanan bu sahîfeler tâ Azîz ve Celîl olan Allah kendisini vefat ettirinceye kadar Ebû Bekr'in yanında kaldı sonra hayâtı müddetince Allah onu vefat ettirinceye kadar Omer'in yanında kaldı. Bundan sonra Omer'in Hafsa'nın yanında kaldı. ibnu Ubeydillah: \"el-Lihâf\" ile \"el-Hazef'i kasdediyor, demiştir",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 7192,
			"arabicnumber": 7192,
			"text": "Bize Abdullah ibnu Yûsuf tahdîs etti. Bize Mâlik, Ebû Leylâ'dan haber verdi. Yine bize İsmâîl ibn Ebî Uveys tahdîs etti. Bana Mâlik Ebû Leylâ ıbn Abdillah ibn Abdirrahmân ibn Sehl'den; o da Sehl ibn Ebî Hasme'den haber verdi. O ve kavminin büyüklerinden birtakım adamlar şöyle haber vermişlerdir: Abdullah ibn Sehl ile Muhayyısa kendilerine isabet eden bir kıtlık ve fakîrlikten dolayı hurma satın almak için Hayber'e doğru çıkmışlardır. (Orada birbirlerinden ayrılıp kendi işleriyle meşgul olmuşlardı.) Sonunda Muhayyısa'ya, Abdullah ibn Senl'ın öldürülüp bir çukura -yahut bir pınar içine- atılmış olduğu haber verildi. Bunun üzerine Muhayyısa, Yahûdîler'e geldi de onlara: Vallahi onu sizler öldürdünüz! dedi. Yahudiler de ona: Vallahi onu biz öldürmedik! dediler. sonra Muhayyısa döndü ve Medine'ye, kendi kavminin yanına geldi ve onlara hâdiseyi zikretti. Bundan sonra Muhayyxsa ve kardeşi Huveyrısa -ki Huveyrısa, kardeşi Muhayyısa'dan daha büyük idi- ve öldürülenin kardeşi Abdurrahmân ibn Sehl; her üçü geldiler. Hayber'de bulunmuş olan Muhayyısa, Peygamber'e bu da'vâyı konuşmaya girişti. Peygamber de Muhayyısa'ya hitaben: \"İlk sözü büyüğe bırak, ilk sözü büyüğe bırak!\" buyurdu. Peygamber bu emriyle yaşça büyük olanı kasdediyordu. Bunun üzerine Huveyrısa konuştu, ondan sonra Muhayyısa konuştu. Bunun ardından Rasûlüllah(sallallahü aleyhi ve sellem) onlara Hayber Yahudileri hakkında: \"Ya Yahudiler arkadaşınızın diyetini öderler yahut da onlar bizimle harb i'lân etmiş olur!\" buyurdu ve bunu Yahûdîler'e yazıp gönderdi. tarafından da Rasûlüllah'a: \"Abdullah'ı biz öldürmedik\" diye mektûb yazıldı. üzerine Rasûlüllah, Huveyrısa, Muhayyısa ve Abdurrahmân üçlüsüne hitaben: \"Sizler bu cinayetin Hayber Yahudileri tarafından işlendiğine yemîn eder de arkadaşınızın kan badeline hakk kazanır mısınız?\" diye sordu. da: Bizler buna yemîn edemeyiz, dediler.Rasûlüllah: \"Öyleyse Yahudiler onu öldürmediklerine dâir size yemin ederler\" buyurdu. (Yâ Rasûlallah!) Onlar müslümân değillerdir (onların yemînlerine nasıl inanalım)? diye söylediler. üzerine Rasûlüllah, öldürülenin diyetini kendi yanından yüz deve olarak ödedi de sonunda bu develer onların evine girdirildi. Sehl ibn Ebî Hasme, bu develerden bir dişi deve bana ayağıyle vurdu, demiştir",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 7194,
			"arabicnumber": 7194,
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 7195,
			"arabicnumber": 7195,
			"text": "Hârice ibnu Zeyd ibn Sabit, babası Zeyd ibn Sâbit'ten söyledi ki, Peygamber(sallallahü aleyhi ve sellem) Zeyd ibn Sâbit'e, Yahûdîler'in yazısını öğrenmesini emretmiştir. ibn Sabit: onlara gönderdiği mektûblarını yazardım, onların da Peygamber'e yazdıkları zaman, onların yazıp göndermekte oldukları mektûblarını kendisine okuyordum, demiştir. ibnu'l-Hattâb da yanında Alî ibn Ebî Tâlib, Abdurrahmân ibn Avf ve Usmân ibn Affân bulunurlarken, yanlarında hazır bulunan bir kadına: kadın ne söylüyor? diye sormuş. Abdurrahmân ibn Hâtib ibn Ebî Beltea da o kadının sözlerini Omer'e terceme ederek: Ben \"Bu kadın sana iki arkadaşı ile yapmış olduğu işi haber veriyor\" dedim, demiştir. Cemre (Nasr ibnu İmrân ed-Dab'î el-Basrî) de: Ben İbn Abbâs ile insanlar arasında tercümanlık yapıyordum, demiştir. Âdem oğlu da: Hâkim için iki mütercim zarurîdir, demiştir",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 7196,
			"arabicnumber": 7196,
			"text": "Bize Şuayb, ez-Zuhrî'den haber verdi. BanaUbeydullah ibnu Abdillah haber verdi ki, ona da Abdullah ibn Abbâs haber vermiş, ona da Ebû Sufyân ibn Harb şöyle haber vermiştir: Kendisi Kureyş'ten bir ticâret hey'eti içinde Şam'da bulunduğu sırada Bizans Kayseri Hırakl, onları bir haberci gönderip çağırtmış. Onun huzuruna gelmişler. Sonra Hırakl, kendi tercümanına hitaben: Şu adamlara söyle de: Ben, bu Ebû Sufyân'a, \"Peygamber'im\" diyen o adamın vasıflarından bâzı şeyler soracağım. Eğer bu bana yalan söylerse, sizler bunun sözünü yalanlayınız! dedi... Ve o hadîsin tamâmını zikretti. Hırakl, kendi tercümanına: Ona şöyle de: Eğer bu dediklerin doğru ise o zât, yakında şu iki ayağımın bastığı yere mâlik olacaktır! Dedi",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 7197,
			"arabicnumber": 7197,
			"text": "Bize Hişâm ibn Urve, babası Urve'den; o da Ebû Humeyd es-Sâidî (radıyallahü anh)'den şöyle tahdîs etti: Peygamber(sallallahü aleyhi ve sellem) İbnu'l-Utebiyye (veya İbn Luteybiyye denilen) bir zâtı Suleym oğulları sadakaları üzerine âmil ta'yîn etmişti. Bu adam zekât mallarını toplayıp geldiği ve Rasûlüllah(sallallahü aleyhi ve sellem) onu hesaba çektiği zaman, bu adam: Bu sizin zekât malınızdır. Bu da bana hediye verilmiştir, dedi. Bunun üzerine Rasûlüllah ona: \"Eğer sen doğru söyleyen bir kimse isen (mal me'mûru olmayıp da) babanın evinde yahut ananın evinde otursaydın sana hediyen gelir miydi?\" buyurdu. sonra Rasûlüllah mescidde ayağa kalktı ve insanlara bir hutbe yaptı, Allah'a hamdedip O'na sena eyledi. Sonra \"Amma ba'du”(Sözün bundan sonrası şudur)diyerek şunları söyledi: \"Ben sizlerden birtakım adamları, Allah'ın bana tevliyet verdiği bâzı işler üzerine âmil ta'yîn ediyorum, sonra sizlerden herhangibiriniz geliyor ve: Bu mal sizindir, şu da bana verilen bir hediyedir, diyor! O zât doğru söyleyici bir kimse ise babasının evinde yahut anasının evinde otursa da kendisine verilen hediyesi ona gelecek miydi bir görseydi ya! Allah'a yemîn ederim ki, zekât âmillerinden herhangibiriniz topladığı mallardan haksız olarak herhangi birşey alırsa, muhakkak kıyâmet günü o kimse, aldığı malı boynuna yüklenerek Allah'ın huzuruna gelecektir. Dikkat edin: Sakın ben sizlerden hiçbir kimseyi, boynunda inlemesi olan bir deve ile yahut böğürmesi olan bir sığır ile yahut melemekte olan bir davar ile Allah 'ın huzuruna gelmesini tanımayayım!\" buyurdu. iki elini, ben O'nun iki koltuk altlarının beyazlığım görünceye kadar kaldırdı da: \"Dikkat edin! Sizlere Allah'ın emirlerini tebliğ ettim mi?\" buyurdu",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 7198,
			"arabicnumber": 7198,
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 7200,
			"arabicnumber": 7200,
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 7201,
			"arabicnumber": 7201,
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 7202,
			"arabicnumber": 7202,
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 7203,
			"arabicnumber": 7203,
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 7204,
			"arabicnumber": 7204,
			"text": "Cerîr ibn Abdillah el-Becelî (radıyallahü anh) şöyle demiştir: Ben Peygamber(sallallahü aleyhi ve sellem) ile emir ve nehiylerini dinlemek ve itaat etmek üzere bey'at ettim, O da bana:\"Gücümün yettiği kadar\" kaydını söylememi telkîn buyurdu. Bir de ben Peygamber'e“herbir müslümâna hayırhah olmak üzerine” de bey'at ettim",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 7205,
			"arabicnumber": 7205,
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 7206,
			"arabicnumber": 7206,
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 7207,
			"arabicnumber": 7207,
			"text": "Cuveyriye ibn Esma, Mâlik'ten; o da Zuhrî'den tahdıs etti ki, ona da Humeyd ibn Abdirrahmân haber vermiş, ona da Misver ibnu Mahrame (radıyallahü anh) şöyle haber vermiştir: Omer ibnu'l-Hattâb'ın kendisinden sonra halifelik işini kendilerine havale ettiği kimseler toplanıp aralarında halifeliği kendisine verip akdedecekleri kimse hakkında istişare ettiler. O zaman Abdurrahmân ibn Avf, o topluluğa şöyle dedi: Ben bu hilâfet işi üzerine sizlerle çekişecek değilim. (Çünkü benim buna rağbetim yoktur.) Lâkin eğer isterseniz, ben sizin içinizden size, birinizi seçeyim! dedi. teklif üzerine o topluluk bu tercîhi Abdurrahmân ibn Avf'a bıraktılar. Onlar kendilerinden birini tercîh etme işlerini Abdurrahmân'a havale edince insanlar Abdurrahmân üzerine meylettiler, hattâ ben insanlardan hiçbir kimseyi o topluluğa tâbi' olur ve onun izine basar görmüyordum (yani insanları topluluktan yüz çevirip onların ardından yürümezler görüyordum). İnsanlar Abdurrahmân üzerine meylettiler. Çünkü onlar bu geceler içinde halifelik işi üzerine istişare yapıyorlardı. Nihayet sabahlayıp da Usmân ibn Affân'a bey'at yaptığımız gece olunca, Misver ibn Mahrame şöyle dedi: Geceden bir taife geçtikten sonra Abdurrahmân ibn Avf gelip benim kapımı çaldı. Bunun üzerine ben uykumdan uyandım. O bana: Ben seni uyumuş görüyorum. Allah'a yemîn ederim ki, benim bu üç geceden beri gözüme büyük bir uyku girmedi. Haydi yürü de ez-Zubeyr ibnu'l-Avvâm'ı, Sa’d ibn Ebî Vakkaas'ı çağır! dedi. üzerine ben de onun için bu iki sahâbîyi çağırdım. o ikisiyle gizli konuşup istişare etti. Sonra Abdurrahmân ibn Avf beni tekrar çağırdı da: Bana Alî ibn Ebî Tâlib'i çağır! dedi. Alî'yi de onun yanına çağırdım. Alî geldi. Abdurrahmân ibn Avf, tâ gece yarısına kadar Alî ile gizli olarak konuştu. Sonra Alî ibn Ebî Tâlib, onun yanından kendisine tevliyet verilmesi arzusu ile kalkıp gitti. Abdurrahmân ibn Avf da Alî tarafından fitneye yönelik bir muhalefet işi meydana gelmesinden endîşe edip durmuştur. Abdurrahmân: Bana Usmân'ı çağır! dedi. Usmân'ı da çağırdım. Abdurrahmân onunla da tâ müezzin sabah ezam ile aralarını ayırıncaya kadar gizli gizli konuştu. Nihayet insanlara sabah namazını kıldırdığı zaman, bu şûra topluluğu minberin yanında toplandılar. Abdurrahmân Muhacirler'den ve Ensâr'dan hazır bulunan kimselere haber gönderip çağırttı. Ordu kumandanlarına da haber gönderip çağırttı. Bunların hepsi o yıl Omer'le beraber Mekke'ye gelip buluşmuş ve beraber hacc yapmışlardı (ve Medine'ye de beraber dönmüşlerdi). toplandıkları zaman Abdurrahmân(minber üzerinde oturup) şehâdet kelimelerini söyledi. Bundan sonra \"Amma ba'du\" diyerek, şunları söyledi: Yâ Alî! Ben insanların bu işteki tercihlerine iyice bakıp araştırdım da insanların Usmân'dan sapmalarını görmedim(yânı insanlar Usmân'ı halifelik işinde başkaları üzerine tercih ediyorlar gördüm). Onun için sen (benim Usmân'ı tercih etmemden dolayı) sakın kendi nefsin üzerinde bir kötüleme yolu tutma! dedi. Usmân'a hitâb ederek de: Yâ Usmân! Ben sana Allah'ın sünneti, Rasûlü'nün sünneti ve Rasûlü'nden sonra geçen iki halîfesinin sünneti üzere bey'at ediyorum! dedi. bu konuşmanın ardından Abdurrahmân, Usmân'a bey'at etti. Ardından bütün insanlar; Muhacirler, Ensâr, ordu kumandanları ve bütün müslümânlar da Usmân'a bey'at ettiler",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 7208,
			"arabicnumber": 7208,
			"text": "Seleme ibnu’l-Ekva' (radıyallahü anh) şöyle demiştir: Biz Hudeybiye'de ağaç altında yapılan Rıdvan Bey'ati'nde Peygamber(sallallahü aleyhi ve sellem)'e bey'at etmiştik. (Sonra ağacın gölge tarafına dönüp gelmiştik.) Peygamber bana: \"Yâ Selemetu! Sen bey'at etmez misin?\" buyurdu. Yâ Rasûlallah! Ben ilk taife içinde bey'at ettim! dedim. \"ikinci defa bey'at et!\" buyurdu. Ben de ikinci defa bey'at ettim",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 7209,
			"arabicnumber": 7209,
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 7210,
			"arabicnumber": 7210,
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 7211,
			"arabicnumber": 7211,
			"text": "Bize Mâlik, Muhammedibnu'l-Munkedir'den; oda Câbir ibn Abdüllah (radıyallahü anh)'tan şöyle haber verdi: Bir A'râbî, Rasûlüllah(sallallahü aleyhi ve sellem) ile İslâm üzere bey'at etti. Akabinde A'râbî'ye Medine'de sıtma hastalığı isabet etti. Bunun üzerine bu A'râbî, Rasûlüllah'a geldi ve: Yâ Rasûlallah! Benim bey'atimi geriye döndür (de ben çöle gideyim)! dedi. bunu kabul etmedi. Sonra A'râbî yine geldi ve: Yâ Rasûlallah! Benim bey'atimi geriye döndür! dedi. Rasûlüllah yine kabul etmedi. Sonra yine gelip: Benim bey'atimi geriye döndür! dedi. yine kabul etmedi. Bunun üzerine o A'râbî Medine'den çıkıp gitti. Rasûlüllah da: \"Medine ancak demirci körüğü gibidir; değersizlerini dışarı atar, temizlerini de meydana çıkarır\" buyurdu",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 7212,
			"arabicnumber": 7212,
			"text": "Ebû Hureyre (radıyallahü anh) şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem) şöyle buyurdu: \"Uç (şahıs vardır ki) Allah kıyâmet gününde onlarla konuşmaz, onları temize çıkarmaz, onlar için(yaptıklarına karşılık) ağrıtıp incilten müdhiş bir azâb vardır. Birincisi: Yol üzerinde (ihtiyâcından) fazla bir suyu bulunan ve onu yolculardan men' eden kimsedir, ikincisi, devlet başkanına yalnız dünyâ menfâati için muahede eder de devlet başkanı ona istemekte olduğu dünyalığı verirse, ona yaptığı muâhedeye vefa edip yerine getirir, eğer vermezse ona ahdini yerine getirmez. Üçüncüsü metâını ikindiden sonra bir adama satar ve Allah adına yemîn ederek bu mata muhakkak şöyle şöyle fıât verilmiştir der. Müşteri de o mala o kadar fiât verilmemiş olduğu hâlde, onun yaptığı yalan yemini sebebiyle o kimsenin sözünü doğru kabul eder de o malı ondan o yüksek bedelle satın alır",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 7213,
			"arabicnumber": 7213,
			"text": "el-Leys şöyle demiştir: Bana Yûnus, İbn Şihâb'dan tahdîs etti. Bana Ebû İdrîs el-Havlânî haber verdi ki, kendisi Ubâde ibnu's Sâmit (radıyallahü anh)'ten şöyle derken işitmiştir: Bizler bir mecliste otururken Rasûlüllah(sallallahü aleyhi ve sellem) bize şöyle buyurdu: \"Allah'a (ibâdette) hiçbir şeyi ortak etmemek, hırsızlık yapmamak, zina etmemek, çocuklarınızı öldürmemek, kendiliğinizden uyduracağınız hiçbir yalanla kimseye bühtan etmemek, hiçbir ma'rûf işte isyan etmemek üzere bana bey'at ediniz (yani benimle ahd ediniz). İçinizden her kim sözünde durursa, onun ecri (mükâfatı) Allah'ın fadl ve keremi üzerindedir. Bu dediklerimden birini yapıp da ondan dolayı dünyâda îkaab edilirse, bu îkaab ona keffârettir. Bunlardan birini yapıp da, yaptığı o fiili Allah Taâlâ örtüp gizlerse, onun işi Allah'a kalır: isterse Allah onu îkaab eder, isterse affeder\". de bu şart üzere Rasûlüllah(sallallahü aleyhi ve sellem)'a bey'at ettik",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 7214,
			"arabicnumber": 7214,
			"text": "Bize Ma'mer ibn Râşid, ez-Zuhrî'den; o da Urve'den haber verdi ki, Âişe (r.anha) şöyle demişti: Peygamber(sallallahü aleyhi ve sellem) kadınlarla “Kadınlar Allah'a hiçbirşeyi ortak kılmamaları...\"(el-Mümtehine: 12) âyetinin sözleri ile bey'at ederdi. Rasûlüllah’ın eli bey'at sırasında hiçbir kadının eline dokunmamıştır, ancak (nikâh veya milk ile) mâlik olduğu kadınlar müstesna, demiştir",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 7215,
			"arabicnumber": 7215,
			"text": "Ümmü Atıyye (radıyallahü anh) şöyle demiştir: Bizler Peygamber (sallallahü aleyhi ve sellem)'e İslâm üzere bey'at ettik. Şöyle ki, kendisi bize karşı \"...Kadınlar Allah'a hiçbirşeyi ortak kılmamaları, hırsızlık yapmamaları... ''(el-Mümtehine:12) âyetini okudu. Ve bizi ölü üzerine çığlıkla ma'tem tutmaktan nehyetti. Bunun üzerine kadınlardan birisi (ki Ümmü Atıyye'nin kendisidir) bey'at etmekten elini çekti ve: Yâ Rasûlallah! Fulâne kadın Câhiliyet ma'teminde bana yardım etmişti. Ben şimdi onun bendeki hakkını karşılayıp ödemek istiyorum! dedi. da o kadına hiçbirşey söylemedi. Bunun üzerine kadın gitti. Sonra (o kadından müsâade alarak) dönüp bey'at etti. Atıyye: Benimle beraber bey'at eden kadınlardan ancak (Enes'in anası ve Ebû Talha'nın karısı olan) Ümmü Suleym, Ümmü'l-Alâ, Ebû Sebre'nin kızı Muâz ibn Cebel'in karısı yahut Ebû Sebre'nin kızı ve Muâz ibn Cebel'in karısından başkası bu bey'atteki feryâdla ağlamama şartına vefa etmedi, demiştir",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 7216,
			"arabicnumber": 7216,
			"text": "Muhammed ibnu'l-Munkedir şöyle dedi: Ben Câbir ibn Abdillah (radıyallahü anh)'tan işittim, şöyle dedi: Bir bedevi, Peygamber'e geldi de; Yâ Rasûlallah! Benimle İslâm üzere bey'at et! dedi Peygamber de onunla islâm üzere bey'at etti. Sonra ertesi gün bu bedevi sıtma hastalığına tutulmuş olarak geldi ve: (Yâ Rasûlallah!) Benim bey'atimi çöz! dedi. Rasûlüllah onun bu teklifini kabul etmedi. Adam geri dönüp gittiği zaman: \"Medine şehri demirci körüğü gibidir: Değersiz olan kiri pası dışarı atar, temiz olanı da ortaya çıkarır\" buyurdu",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 7217,
			"arabicnumber": 7217,
			"text": "Yahya ibn Saîd şöyle demiştir: Ben (Âişe'nin kardeşinin oğlu) el-Kaasım ibn Muhammed'den işittim, şöyle dedi: Âişe (radıyallahü anh-bir kerre şiddetli bir baş ağrısına tutuldu da): Vay başım, (ölüyorum)! demişti. Rasûlüllah(sallallahü aleyhi ve sellem) da: \"Eğer sen ölür de ben hayâtta kalırsam, senin için mağfiret diler ve senin için duâ ederim!\" buyurdu. üzerine Âişe: Vay başıma gelen musibete! Vallahi öyle sanıyorum ki, muhakkak Sen benim ölümümü istiyorsun. Eğer ben ölürsem, muhakkak Sen o son günün gecesinde kadınlarının birisiyle gerdek olup yaşayacaksın! dedi. bu sözü üzerine Rasûlüllah şöyle buyurdu: \"Yâ Âişe! (Endişelenme!) Asıl ben 'Vay başıma!' demeliyim (çünkü senden evvel öleceğim). Yâ Âişe! (Hattâ) şimdi ben Ebû Bekr'e ve oğluna haber göndermek ve -hilâfet dedikoducularının sözlerinden ve hilâfet umanların temennilerinden nefret ederek- hilâfeti Ebû Bekr'e vasiyet etmemi kasdettim (yahut istedim). Fakat sonra düşündüm ki, Allah (hilâfeti Ebû Bekr'den başkasına müyesser kılmaktan) çekinir. Mü'minler de Ebû Bekr'den başkasının halîfe olmasını men' ederler. Yâhud Allahü Taâlâ (Ebû Bekr'den başkasının halîfe olmasını) men eder. Mü'minler de (Ebû Bekr'den başkasına bey'at ve mutâbaatten) çekinirler",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 7218,
			"arabicnumber": 7218,
			"text": "Abdullah ibn Omer (radıyallahü anh) şöyle demiştir: Babam Omer(vurulup vaziyeti ağırlaşınca, dostları tarafından): Yerine bir halîfe ta'yîn etmez misin? diye sorulmuştu. Omer: Eğer yerime halîfe ta'yîn ve tavsiye edersem (aykırı bir iş yapmış olmam). Çünkü benden hayırlı olan Ebû Bekr, yerine halîfe ta'yîn ve tavsiye etti. Eğer ta'yin etmez de (bu işi ümmete) bırakırsam, şübhesiz benden hayırlı olan Rasûlüllah(sallallahü aleyhi ve sellem) da (muayyen bir zâtı açıkça söylemeyip bu işi ümmete) bırakmıştır, dedi. Omer şöyle dedi: Halîfe ta'yîni teklifine karşı Omer'in verdiği cevâbı, mecliste hazır bulunan sahâbîler Omer'e karşı takdirle karşılayıp, onu övdüler. Bunun üzerine Omer de: Ben bir halef ta'yîn etmek ve ta'yîninde isabet ederek medholunmak isterim. Fakat isabet olunamamasından da korkarım. Ben bu hilâfet işinden ne kârlı, ne de zararlı olmayarak; başa-baş kurtuldum. Artık şimdi muayyen bir zâtı yerime halef ederek hayâtımda, ölümümde mes'ûliyetini yüklenmek istemem! Dedi. şöyle demiştir: Bana Enes ibn Mâlik (radıyallahü anh) haber verdi ki, kendisi Omer ibnu'l-Hattâb'ın minber üzerine oturup da yaptığı ikinci hutbesini işitmiştir: Bu hutbe, Peygamber(sallallahü aleyhi ve sellem)'in vefatı gününün ertesinde olmuştu. Omer şehâdet kelimelerini söyledi. Ebû Bekr ise hiç konuşmuyor, susuyordu. Omer şöyle dedi: Ben Rasûlüllah'ın yaşayıp da bizim işlerimizi üzerine alıp yazmasını (yahut düşünüp tedbîr etmesini) ümîd ederdim. bu sözüyle, Peygamberin vefatının kendilerinden sonra olmasını kasdetmektedir. devamla şöyle dedi: Muhammed ölmüş ise, şübhesiz Allahü Taâlâ sizin aranızda bir nûr (yânı Kur'ân) bırakmıştır ki, onunla Allah'ın Muhammed'e hidâyet ettiği doğru yolu bulacaksınız. Şübhesiz Ebû Bekr deRasûlüllah'ın sahibi ve (mağarada)\"İkinin ikincisidir\"(et-Tevbe: 40). Hiç şübhe yok ki, o, müslümânlann işlerini üzerine almaya en lâyık kimsedir.(Ey hazır bulunanlar!) Kalkınız ve ona bey'at ediniz! dedi. bir kısmı bundan önce Sâide oğulları sakîfesinde Ebû Bekr'e bey'at etmişlerdi. Umûmî bey'at ise, sakîfede yapılan bey'at gününün sabahında, minber üzerinde yapılan bu bey'at olmuştu. Enes ibn Mâlik'ten söyledi ki; Enes ibn Mâlik, o gün Omer'in Ebû Bekr'e ısrarla \"Minbere çık!\" deyip durduğunu işitmiş ve nihayet Ebû Bekr minbere çıkınca, insanlar ona umûmî olarak bey'at ettiler, demiştir",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 7219,
			"arabicnumber": 7219,
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 7220,
			"arabicnumber": 7220,
			"text": "Bize İbrâhîm ibn Sa'd, babasından (yani Sa'd ibn İbrâhîm ibn Abdirrahmân ibn Avf ez-Zuhrî'den); o da Muhammed ibn Cubeyr ibn Mut'ım'den tahdîs etti ki, babası Cubeyr ibn Mut'ım(radıyallahü anh) şöyle demiştir: Bir kerresinde Peygamber(sallallahü aleyhi ve sellem)'e bir kadın geldi. Peygamber'in ona vereceği birşey hakkında onunla konuştu. (Kadın dönerken)Peygamber kadına tekrar müracaat etmesini emretti. Bunun üzerine kadın, sanki Rasûlüllah'ın vefatını ifâde etmek isteyerek: Yâ Rasûlallah! Ben gelir de Sen'i bulamazsam ne buyurursun? diye sordu. da ona: \"Şayet beni bulamazsan Ebû Bekr'e gelip müracaat et!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 7221,
			"arabicnumber": 7221,
			"text": "Sufyân es-Sevrî şöyle demiştir: Bana Kays ibn Müslim, Târik ibn Şihâb'dan tahdîs etti ki, Ebû Bekr (radıyallahü anh),Rasûlüllah'ın vefatından sonra dînden çıkmış ve harble yenilmiş olan Tayy, Esed, Gatafân ve diğer kabilelerin elçilerine hitaben: Sizler çöllerde develerin kuyruklarının arkalarından gidersiniz, nihayet Allah sizlere, Peygamber'inin halîfesi ve. Muhacirler'i eliyle, bunların sizlere kusur ve günâhı çok saymakta olacakları bir iş gösterir! demiştir",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 7223,
			"arabicnumber": 7223,
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 7224,
			"arabicnumber": 7224,
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 7225,
			"arabicnumber": 7225,
			"text": "Bize el-Leys, Ukayl'den; o da İbn Şihâb'dan; oda Abdurrahmân ibn Abdillah ibn Ka'b ibn Mâlik'ten; o da Ka'b ibn Mâlik'in oğlu Abdullah'tan tahdîs etti. Bu Abdullah, Ka'b ibn Mâlik'in gözleri kör olduğu zaman, onun oğulları arasından kendisine.yedicilik yapanı idi. O şöyle demiştir: Ben babam Ka'b ibn Mâlik(radıyallahü anh)'ten işittim, şöyle dedi: Tebûk gazvesinde Rasûlüllah'tan geri kaldığı zamanki hadîsini zikretti de, bunda şöyle dedi: kendisinden seferde geri kalanlardan işte şu üçümüzle konuşmaktan müslümânları nehyetti. Halk da bizden çekindiler... Bu hâl üzere elli gün kaldık... Rasûlüllah, sabah namazını kıldığı zaman Allah'ın bizim üzerimize tevbesini (pişmanlığımızın kabulünü) i'lân etmiş, halk bize müjdelemeğe koşmuştu",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 84
			}
		}
	]
}