{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"94": "Wishes"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7226,
			"arabicnumber": 7226,
			"text": "Ebu Hureyre r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Kudreti sayesinde yaşadığım Allah'a yemin ederim ki şayet (acizlik durumlarında) kendilerini bindirecek binekler bulamadığım zamanda bile cihad'dan benim ardımda geri kalmalarını hoş görmeyip, istemeyecek birtakım adamlar olmasaydı (Allah yolunda cihada giden) hiçbir seriyyeden geri kalmazdım. Allah yolunda öldürülüp, diriltilmeyi, sonra öldürülüp diriltilmeyi, sonra öldül\"ulüp diriltilmeyi, sonra öldürülüp diriltilmeyi ne kadar isterdim",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 7227,
			"arabicnumber": 7227,
			"text": "Ebu Hureyre r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Kudreti sayesinde yaşadığım Allah'a yemin ederim ki Allah yolunda çarpışıp öldürülmeyi, sonra diriltilmeyi, sonra öldürülmeyi, sonra diriltilmeyi, sonra öldürülmeyi, sonra diriltilmeyi, sonra öldürülmeyi, sonra diriltilmeyi ne kadar isterdim!\" Hadisi Ebu Hureyre'den nakleden ravi şöyle demiştir: Ebu Hureyre bu \"öldürülme\" kelimesini üçer defa söylerdi de 'Nebi Sallallahu Aleyhi ve Sellem'in bunu böyle söylediğine Allah adına şehadet ederim!' derdi. Fethu'l-Bari Açıklaması: \"Temenni etme ve şehit olmayı temennı etme.\" \"Temennl\" kelimesi \"el-umniyye\" kökünden olup, tefe'uul babındandır. \"el-Umniyye\" kelimesinin çoğulu \"el-emanı\"dir. \"Temennı\" gelecekle ilgili bir irade anlamınadır. Bu herhangi bir hasedle birlikte olmaksızın hayır konusunda ise dinen istenilen şeylerdendir, aksi takdirde kınanmış fiillerden olur. Bazıları \"temennı\" ve \"terecd\" kelimeleri arasında umum ve husus ilişkisi olduğunu söylemişlerdir. \"Terecd\" mümkün olan şeyleri umut etmek anlamına gelirken,. \"temennı\" bundan daha geniş ve geneldir. Bazılarına göre \"temennı\" elden kaçınımış şeylerle ilgilidir. Bazıları bunu elde etmesi mümkün olmayan şeyleri talep anlamındadır diye ifade etmişlerdir. Yukarıdaki hadisin açıklaması ve temennı edildiği takdirde ortaya çıkan problemle birlikte şehiHiği temennı etmenin ne demek olduğu Cihad Bölümünde şehitliği temennı başlığı altında geçmişti. Doğruyu en iyi Yüce Allah bilir",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 7228,
			"arabicnumber": 7228,
			"text": "Ebu Hureyre r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Benim Uhud dağı kadar altınım olsaydı ondan yanımda bir dinar bulunduğu halde üzerimden üç gece geçmesini istemezdim. Ancak zimmetimdeki bir borç dolayısıyla ayırıp da onu kabul edecek kimseyi bulmak maksadıyla saklamış olduğum altın müstesnadır",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 7229,
			"arabicnumber": 7229,
			"text": "Aişe r.anha'nın nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"İşime dair sonradan bildiğimi önceden bilseydim kurbanlık sevk etmez ve insanlar {ihramdan} çıktıklan zaman elbette ben de onlarla birlikte çıkardım",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 7230,
			"arabicnumber": 7230,
			"text": "Cabir b. Abdullah şöyle anlatmıştır: Bizler (veda haccı yolunda) Resulullah Sallallahu Aleyhi ve Sellemla birlikte idik. Yalnız hac niyetiyle ihrama girdik ve iilhiccenin dördünde Mekke'ye geldik. Resulullah Sallallahu Aleyhi ve Sellem bize Kabe'yi tavaf, Safa ile Merve arasında sa'y yapmamızı ve bu haccımızı umre yapmamızı, ardından da -beraberinde kurbanlık bulunanlar hariç- ihramdan çıkmamızı emretti. Cabir şöyle devam etti: İçimizde Resulullah Sallallahu Aleyhi ve Sellem ve Talha'dan başka kimsenin beraberinde kurbanlık yoktu. Ali Yemen'den gelmiş, kurbanını beraberinde getirmişti. O \"Ben Resulullah Sallallahu Aleyhi ve Sellem'in ihrama girdiği gibi ihramlandım\" dedi. Bu sözü duyanlar \"Bizler Mina'ya cinsel isteklerimizi yerine getirerek giderken (Resulullah Sallallahu Aleyhi ve Sellem ihramh kalacaktır)\" dediler. Nebi Sallallahu Aleyhi ve Sellem bu sözleri işitince: \"Eğer ben (hac aylarında umremin caiz olduğunu şimdi) bildiğim gibi (ihrama girerken de) önceden bilmiş olsaydım, kurban sevketmezdim. Yanımda kurbanım olmasaydı, şimdi (ben de sizin gibi) ihramdan çıkardım\" buyurdu. Cabir şöyle dedi: Süraka b. Malik el-Müdlici, Nebi Sallallahu Aleyhi ve Sellem Akabe cemresini taşlarken onunla karşılaştı da \"Ya Resulallah! Bu (haccı umreye çevirmek) bize mi mahsustur?\" diye sordu. Resulullah Sallallahu Aleyhi ve Sellem \"Hayır, size mahsus değildir, ebedidir\" buyurdu. Cabir şöyle devam etti: Hz. Aişe radıyallShu anhS Mekke'ye adet halinde geldi. Nebi Sallallahu Aleyhi ve Sellem ona bütün hac ibadetlerini yapmasını, yalnız temizleninceye kadar Kabe'yi tavaf etmemesini ve namaz kılmamasını emretti. Nihayet Batha denilen yere konakladıkları zaman Hz. Aişe radıyallShu anha (temizlendi ve tavaf etti ve) \"Ya Resulallah! Sizler bir hac ve bir umre ile dönerken ben bir tek hac ile mi döneceğim?\" dedi. Ravi şöyle' devam etti: Sonra Resulullah Sallallahu Aleyhi ve Sellem, Hz. Aişe radıyallShu anhs'nın kardeşi Abdurrahman b. Ebi Bekr'e kızkardeşiyle birlikte Ten'im'e gitmesini emretti. Ve Hz. Aişe radıyallShu anhS, hac günlerinden sonra zilhicce ayında oradan ihrama girerek umre yaptı.\" Bu hadisin geniş bir açıklaması Hac Bölümünde 1568 no ile geçmişti",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 7231,
			"arabicnumber": 7231,
			"text": "Abdullah b. Amir b. Rebi'a'nın nakline göre Aişe r.anha şöyle demiştir: \"Resulullah Sallallahu Aleyhi ve Sellem (Medine'ye hicret ettiği zaman düşman saldırısından endişe ederek) bir gece uyuyamadı ve \"Keşke sahabilerimden elverişli bir kişi bu gece benim için bekçilik etse!\" dedi. Tam bu sırada biz ansızın bir silah sesi işittik. Resulullah Sallallahu Aleyhi ve Sellem \"Bu kimdir?\" diye sordu. Sa'd b. Ebi Vakkas \"Ya Resulallah! Seni bekleyip korumak için geldim!\" diye cevap verdi. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem uykuya daldı. Hatta biz onun horladığını işittik.\" Ebu Abdullah el-Buhari şöyle dedi: Hz. Aişe radıyallilhu anha'nın ifadesine göre Bilal şu şiiri söyledi: Ela leyte şi'rf hel ebftenne leyleten Bivadin ve havlf izhirun ve celflü Geceler miyim bir gece bilseydim keşke! Etrafımda izhir ve celfl otu ve ben Mekke vadisinde! Hz. Aişe radıyallahu anhil \"Ben Bilal'in bu sözlerini Nebie haber verdim\" dedi. . Fethu'l-Bari Açıklaması: \"Nebi Sallallahu Aleyhi ve Sellem'in 'Keşke şöyle şöyle olsaydı' sözü.\" \"Leyte\" temennı harflerinden birisi olup, genellikle imkansızı, az olarak da mümkün olanı temennı etmede kullanılır. Bunlardan birisi yukarıdaki hadistir. Çünkü bekçilik ve Bilal'in temennı ettiği yerde gecelemesi gerçekleşmiş hadiselerdendir. \"Urika\" vezin ve mana itibarı ile \"sehira=uyumadı\" anlamınadır. Bunun açıklaması Savaşta Bekçilik Etme başlığı altında geçmişti. \"Bu kimdir?\" sorusuna \"Sa'd\" diye cevap verilmiştir. Bir Uyarı Cihad bölümünün \"el-Hirase\" başlığı altında TirmizI'nin Abdullah b. Şakik vasıtasıyla Aişe r.anha' den naklettiği şu hadisi zikretmiştik: Resulullah Sallallahu Aleyhi ve Sellem\" dl: ......... =Allah seni insanlardan koruyacaktır\"(Maide 67) ayet-i kerimesi ininceye kadar korunuyordu. Bu haber, Nebi Sallallahu Aleyhi ve Sellem'in ayet inmiş olduğu için bu andan sonra korunmamış olmasını gerektirmektedir. Fakat birçok haberde onun Bedir' de, Uhud' da, Hendek'te, Hayber'den dönerken Vadi'l-Kura'da, kaza umresinde ve Huneyn'de korunduğu yer almaktadır.\" Sanki bu ayet Huneyn savaşından daha sonra inmiş gibidir. Bu fikri Taberanl'nin el-Mucemu's-Sağir'de naklettiği Ebu Said hadisi teyit etmektedir: \"Abbas, Nebi s.a.v.’ koruyan kimselerden biriydi. Bu ayet inince o Resulullah s.a.v. korumayı bıraktı.\" (Taberani, Mucemu's-Sağir, I, 26- 55) Abbas, Mekke'nin fethinden sonra Resulullah s.a.v.’den hiç ayrılmamıştır. Buna göre ayetin Huneyn'den sonra indiği düşünülür. Nebi s.a.v.'in, Huneyn gecesi korunduğu haberini EbU Davud, Nesai ve el-Hakim, Sehl b. elHanzallye' den şöyle nakletmiştir: \"Enes b. Ebi Mersed o gece Hz. Nebii beklemiştir.\" (Ebu Davud, Cihad; Hakim, el-Müstedrek, I, 362) Bazıları Hz, Nebie bekçilik eden sahabilerin isimlerini araştırmışlar ve bir araya toplamışlardır. Bunlardan bazıları şunlardır: Sa'd b. Muaz, Muhammed b. Mesleme, Zübeyr, Ebu Eyyub, Zekvan b. Abdulkays, el-Edra es-Sülemi, Mihcen b. el-Edra. Bazıları Seleme, Abbad b. Bişr, Abbas, Ebu Reyhane'yi de sayarlar. İsmi geçen bu sahabilerden her biri zikri geçen olaylarda sadece Hz. Nebie bekçilik etmemişlerdir. Tam tersine bunların ismi mutlak olarak bekçilik yaptıkları şeklinde zikredilmiştir. Ebu Eyyub gibi bazı isimlerin sırf Hz. Nebie bekçilik ve koruma görevi yapmış olmaları mümkündür. Nitekim Hz. Nebi sallallahu a1eyhi ve sellem Hayber'den dönüp de Safiye ile gerdeğe girdiğinde Ebu Eyyub bekçilik yapmıştır, Enes b. Ebi Mersed örneğinde olduğu gibi o savaşa katılan kimselere bekçilik yapılmas1 da mümkündür. Bu konunun gerçek bilgisi Yüce Allah'ın katındadır",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 7232,
			"arabicnumber": 7232,
			"text": "Ebu Hureyre r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"İki şeyden başkasında karşılıklı olarak hased yoktur. Biri o kimsedir ki Allah ona Kur'an (ilmi) vermiş, o da gece ve gündüz saatlerinde Kur'an okur durur. Onu işiten kimse de 'Buna verilen bana verilse idi elbette ben de onun yaptığı gibisini yapardım' der. İkincisi de o kimsedir ki Allah ona mal vermiştir, o da malını hak yolunda sarf etmektedir. Onu gören kimse de 'Şuna verilen bana verilse idi elbette ben de onun yaptığı gibisini yapardım' der.\" Fethu'l-Bari Açıklaması: \"Kur'an okumayı ve ilim öğrenmeyi temennı etmek.\" İmam Buhari bu bölümde \"İki şeyden başkasında karşılıklı olarak hased yoktur\" şeklindeki Ebu Hureyre haç:!isine yer vermiştir. Bu ifade Kur'an öğrenmeyi temennı etmek konusunda açık ve nettir. İmam Buhari başlıkta ilim öğrenmeyi Kur'an okumaya hüküm itibariyle bunu ona ilhak etme yoluyla eklemiştir. İlim Bölümünde bir başka yoldan el-A'meş'den bu hadis nakledilmişti. Hadisin geniş bir açıklaması İlim Bölümünde geçmişti. \"Bana verilse idi.\" Hadiste bunu kimin söylediği gösterilmemektedir. Zahirine göre bunu kendisine Kur'an ilmi verilen kimse söylemektedir. Ancak gerçek böyle değildir. Tam tersine bunu Kur'an okumayı duyan kimse söylemektedir. Bunu onun söylediği Fadailu'l-Kur'an bölümünde geçen rivayette açıkça yer almaktadır. O rivayet şöyledir: \"Bunu komşusu duyar ve 'Keşke ona verilen bana da verilseydi' der.\" Bu rivayetin ifadesi temennı konusu ile daha çok alakalıdır, fakat İmam Buhari adeti üzere işaretle yetinmiştir",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 7233,
			"arabicnumber": 7233,
			"text": "Nadr b. Enes'in nakline göre Enes şöyle demiştir: Ben Nebi Sallallahu Aleyhi ve Sellem'i \"Sakın ölümü temennf etmeyiniz'' buyururken işitmiş olmasaydım muhakkak onu temenni ederdim demiştir",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 7234,
			"arabicnumber": 7234,
			"text": "Kays b. Ebi Hazim şöyle demiştir: Hastalığı sırasında Habbab b. el-Eret'i ziyarete gittik. Vücudunun yedi yerine dağlama tedavisi uygulamıştı. Habbab (hastalığının şiddetli ızdırabını ifade ederek) \"Eğer Resulullah Sallallahu Aleyhi ve Sellem bizlere ölümü temennı etmemizi yasaklamış olmasaydı muhakkak ölümü temennı ederdim!\" dedi",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 7235,
			"arabicnumber": 7235,
			"text": "Ebu Ubeyd'in -asıl adı Abdurrahman b. Ezher'in azadlısı Sa'd b. Ubeyd'dir- nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Hiç biriniz sakın ölümü temennı etmesin! Eğer o, salih bir kimse ise (hayatta oldukça) salah ve faziletinin artması umulur. Eğer fena bir kimse ise onun da tövbe edip, Allah'ın rızasını kazanması mümkün olur!\" Fethu'l-Bari Açıklaması: \"Mekruh Olan Temennl.\" İbn Atıyye şöyle demiştir: Başkasıyla alakası olmayan şeyi yani mubah olan şeyleri temennı etmek caizdir. Buna göre temennı yasaklı kıskançlık, karşılıklı nefrete sebep olacak şeylere mahsustur. İmam ŞafiI'nin şu ifadesi bu şekilde yorumlanır: \"Temennı etmekle günaha girmiş olmasaydık, şöyle şöyle olmasını temennı ederdik.\" İmam Şafii bununla her türlü temennınin insanı günaha sokacağını kastetmemektedir. \"Allah'ın sizi birbirinizden üstün kıldığı şeyleri hasretle arzu etmeyin.\" Ebu Zerr'in rivayeti bu şekildedir. İmam Buhari bir başka rivayette ayetin tamamını zikretmiştir. O bu konuda üç hadise yer vermiştir. Bunların tümü ölmeyi temennı etmeyi yasaklamayla ilgilidir. Bu hadislerin ayetle olan ilişkisinde kapalılık vardır. Ancak temennınin mekruh olanı, ayetin ve hadisin delalet ettiği şeyin cinsidir demek istiyorsa arada bir ilgi olabilir. Ayetten anlaşılan kıskanma yasaklığıdır. Hadiste ifade edilen ise sabra teşviktir. Çünkü genellikle ölümü temennı etmek öyle bir durumda olur ki kişi o durumda ölmeyi yaşamaya tercih eder. Resulullah Sallallahu Aleyhi ve Sellem ölümü temennı etmeyi yasakladığına göre başa gelen şeye sabretmeyi emretmiş gibi olmaktadır. Ayet ve hadis kazaya rızayı ve Allah'ın emrine teslim olmayı teşvik etme noktasında birleşmektedir. Marda Bölümünde Hastanın Ölmeyi Temennı Etmesi başlığı altında Sabit'in naklettiği Enes hadisinde ölümü temennınin yasaklanmasından sonra şu ifade yer almaktadır: Kişi bunu mutlaka yapacaksa \"Allah 'ım! Yaşamak benim için hayırlı olduğu sürece beni yaşat\" desin. Mesela afiyet duasının meşruluğu buna karşı delil olarak ileri sürülemez. Çünkü uhrevi şeylerin elde edilmesi maksadıyla yapılacak dua Allah'a muhtaç olma, huzurunda kendini hakir ve muhtaç görme ve mahfiyat içinde olmayı ortaya koymakla birlikte gayba imanı içerir. Dua eden kimsenin ihtiyaç duyması nedeniyle dünyevi şeyleri elde etmek amaçlı duaya gelince, bunlar kişi dua ettiği takdirde kendisi için takdir edilmiş olabilir. Çünkü sebepler ve neticeleri tamamıyla takdir edilmiştir. Bunların tümü ölme duasının aksinedir. Çünkü bunda açık bir masıahat yoktur. Tam tersine mefsedet vardır. Zira ölüm duası hayat nimetinin ve onun sağlayacağı diğer faydaların elden çıkmasını talep etmek anlamına gelir. Özellikle kişi mu'minse böyledir. Zira imanın sürekliliği, amellerin en faziletlilerindendir. Doğruyu en iyi Yüce Allah bilir. \"Sakın temenni etmesin.\" Çoğu rivayetlerde bu kelime burada olduğu gibi olumsuzluk kipiyle yer almaktadır. Bu olumsuz kipten maksat, yasaklıktır ya da o yasaklık getirmek için ifade edilmiştir. Hemmam'ın işaret edilen rivayetinde Resulullah Sallallahu Aleyhi ve Sellem \"Herhangi biriniz ölümü temennı etmesin, başına gelmeden önce gelmesi için dua etmesin\" buyurmuştur. Bunun yasaklığında niyetle (kasıt) ifade (nutuk) birleşmiştir. Resulullah Sallallahu Aleyhi ve Sellem'in \"Başına gelmeden önce\" ifadesi, ölüm başa geldiğinde -kişi Allah'a kavuşmayı hoş görmeyenler zümresine dahil olmaması için- onu çirkin görmenin yasaklığına işaret vardır. Nebi Sallallahu Aleyhi ve Sellem'in eceli geldiğinde söylemiş olduğu şu cümle de buna işaret etmektedir: \"Allah'ım! Beni en yüce dosta kavuştur!\" Resulullah Sallallahu Aleyhi ve Sellem bu sözü dünyada kalmakla ölüm arasında muhayyer bırakıldıktan sonra Allah'ın katında olanı tercih ettikten sonra söylemiştir. Resulullah Sallallahu Aleyhi ve Sellem bu ifadeyi kullanmış ve Menakıb Bölümünde açıklandığı üzere Hz. Ebu Bekir onun ne demek istediğini anlamıştır. Ölmeyi temennı etmenin yasaklık hikmetine gelince, ölümü başq gelmeden talep etmede -her ne kadar eceller artıp eksilmese bile- bir çeşit kadere itiraz ve düşmanlık vardır. Çünkü ölmeyi temennı etmek, ecelin artmasına ve eksilmesine etki etmez. Fakat ecel kişinin bilmediği bir vakittir. Fiten Bölümünde Ebu Hureyre'nin rivayet ettiği \"Hayattaki bir kişi kabirdeki bir adamın yanından geçerken 'Keşke şu ölünün yerinde ben olaydım' diye ölümü temennı etmedikçe kıyamet kopmaz\" hadisinde bunun kıskandığını gösteren ifadeler yer almaktadır. Din o kimse için başa gelen bir beladan başkası olmayacaktır. Bu hadisin geniş bir açıklaması Marda Bölümünde hastanın ölümü temennı etmesi başlığı altında geçmişti. Nevevı şöyle der: Hadis başa gelen fakirlik veya düşmanın verdiği sıkıntı ve benzeri dünya meşakkatleri gibi bir zarardan dolayı ölmeyi temennı etmenin çirkin olduğunu açıkça ifade etmektedir. Buna karşılık kişi dini açısından herhangi bir zarar veya fitneden korkacak olursa bu hadisin anlamından dolayı• ölmeyi temennı etmek çirkindir. Selef alimlerinden birçokları böyle yapmışlardır. Hadise göre buna muhalefet edip, başa gelen zarara'sabretmeyen ve uğradığı bir zarardan dolayı ölmeyi temennı eden kimse, yukarıda zikri geçen duayı okusun. Biz de şunu ekleyelim: Hadisin zahirine göre mutlak olarak ölüm temennı edilmez ve sadece o dua ile yetinilir. Fakat Nevevl'nin ifadesine göre ölmeyi temennı durumunda olan kimse açısından -bunu temennı etmeyi terk etmesine yardımcı olması için- kişinin bunu yapmasında herhangi bir sakınca yoktur. \"Eğer o, salih bir kimse ise (hayatta oldukça) salah ve faziletinin artması umulur. Eğer fena bir kimse ise onun da tövbe edip, Allah'ın nzaslnı kazanması mümkün olur!\" Bu ifadede geçen \"yesta'tibu\" bundan vazgeçip, istiğfar ederek Allah'ın rızasını istemesi umulur demektir. \"el-İsti'tab\" rızayı talep etmek demektir. Hadisin zahirine göre bir mükellef sadece bu iki durumda olur. Bir üçüncü şık daha vardır ki o da mükellefin iyiliği ve kötülüğü birbirine karıştırıp, buna göre devam etmesidir ya da ihsanının artması veya kötülüğünün artması ya da iyi bir kimse iken kötüye dönüşmesi veya kötü iken kötülüğünün daha da artmasıdır. Buna verilecek cevap şudur: Bu taksim genel durum göz önüne alınarak yapılmıştır. Çünkü mu'minlerin halleri çoğunlukla böyle olur. Özellikle buna şifahı olarak muhatap olanlar sahabilerdi. Bu hadisin geniş bir açıklaması orada geçmişti. Hadisin manası ile ilgili olarak aklıma şöyle bir şey geldi: Hadiste iyi olan kimsenin iyiliğine gıpta ettirme, kötü olan kimseyi ise kötülüğünden sakındırmaya işaret vardır. Sanki Resulullah Sallallahu Aleyhi ve Sellem şöyle demektedir: İyi olan kimse ölümü temennı etmeyi bıraksın ve iyiliğine, bunu arttırmaya devam etsin, kötü olan kimse ise ölümü temennı etmeyi bıraksın, kötülük üzere ölmemek için bundan vazgeçsin, yoksa tehlikede olur. Bunun dışında sözkonusu taksimin içermiş olduğu diğer kimselerin hükmü bu iki durumdan anlaşılır. Zira bu gibi kimseler bu iki durumdan birisinin dışında olamazlar. Doğruyu en iyi Yüce Allah bilir",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 7236,
			"arabicnumber": 7236,
			"text": "Bera b. Azib şöyle demiştir: Nebi Sallallahu Aleyhi ve Sellem Ahzab gününde (hendek kazılırken) bizimle birlikte toprak taşıyordu. Yemin olsun ki ben toprağın onun karnının beyazlığını örtmüş olduğunu gördüm. Kendisi (İbn Revaha'nın) şu beyiderini söylüyordu: لولا أنت ما اهتدينا نحن Lev la ente mehtedeyna nahnu ولا تصدَّقنا ولا صلَّينا Ve la tasaddakna vela salleyna فأنزلَنْ سكينةً علينا، إنَّ الألى Fe enzifen sekineten aleyna İnne'l-ula -ve bazen de şöyle dedi إنَّ الملا - قد بغوا علينا İnne'l-melee kad beğav aleyna إذا أرادوا فتنةً أبَيْنا أبَيْنا İza eradu fitneten-eveyna eveyna Olmasaydın sen doğru yolu bulamazdık Sadaka veremez, namaz kılamazdık! İndir sekineti indir üzerimize Çünkü tecavüz etti yöneticiler bize! İstediklerinde fitne yapmak, diyen bizdik Fitneden çekindik, fitneden çekindik. Resulullah Sallallahu Aleyhi ve Sellem bunları söylerken sesini yükseltiyordu. Fethu'l-Bari Açıklaması: \"Ben toprağın onun karnının beyazlığını örtmüş olduğunu gördüm.\" Bu ifadede geçen \"vara\" \"el-muvarat\" kökündendir. Örttü manasına gelen \"gatta\" fiiliyle vezin ve anlamca aynıdır. Bir başka rivayete göre Bera şöyle demiştir: \"Nebii s.a.v. hendek toprağını taşırken gördüm. Hatta toprak karnının derisini görmemi engelledi.\" Nebi s.a.v., İbn Revaha'nın yani meşhur Ensarlı sahabi şair Abdullah b. Revaha'nın beyitlerini okurken duydum. Hayber Gazvesi başlığı altında bunun Amir b. el-Ekva'ın şiiri olduğu geçmişti. Orada bu iki rivayetin birbiriyle nasıl uzlaştırılacağından söz etmiştik. Edeb Bölümünün sonlarına doğru Hz. Nebi s.a.v.'in şiir söylemesi ve okuması ile ondan başkalarının şiir söyleyip okumaları hakkındaki hüküm -hamdolsun Allah'a- geçmişti",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 7237,
			"arabicnumber": 7237,
			"text": "Ömer b. Ubeydullah'ın azadlısı ve katibi Salim Ebü'n-Nadr şöyle demiştir: Abdullah b. Ebu Evfa, Ömer b. Ubeydullah'a bir mektup yazdı da bu mektubu ben okudum. Bir de ne göreyim! Mektupta Resulullah Sallallahu Aleyhi ve Sellem'in \"(Ey insanlar!) düşmanla karşı karşıya gelmeyi temennf etmeyiniz! Fakat Allah'tan afiyet dileyiniz\" emri yazılıydı. Fethu'l-Bari Açıklaması: \"Düşmanla karşı karşıya gelmeyi temennı etmenin çirkinliği.\" Cihad Bölümünün sonlarında düşmanla karşı karşıya gelmeyi temennı etmeyiniz başlığı altında bu hadis geçmişti. Orada şehitliği temennı etmenin caizliği ile birlikte hadisin açıklaması ve iki rivayetin birbiriyle nasıl cem ve telif edileceği geçmişti. Çünkü bu iki rivayet zahiren birbiriyle çelişmektedir. Zira şehitliği temennı etmek sevimlidir. O halde insanı sevdiği şeye götüren düşmanla karşı karşıya gelmeyi temennı etmek nasılolur da yasak olur? Bunun kısa cevabı şudur: Şehitlik düşmanla karşı karşıya gelmekten daha dar çerçevelidir. Zira İslam'a yardım ederek ve kafirleri kırıp geçirerek onun izzetini sürekli kılarak şehitliği elde etmek mümkündür. Düşmanla karşı karşıya gelmek, bazen şehitliğin aksi bir netice verebilir. Bundan dolayı onlarla karşılaşmayı temennı etmek yasak edilmiştir. Bu şehitliği temennı etmeyle çelişmez ya da hadiste sözü edilen çirkinlik, kendi kuvvetine güvenen, kendini beğenen ve benzeri kimseler için söz konusudur",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 7238,
			"arabicnumber": 7238,
			"text": "Kasım b. Muhammed şöyle demiştir: İbn Abbas birbirine karşı lian yapan karı ve kocadan söz etti. Bunun üzerine Abdullah b. Şeddad ona \"Bu kadın Resulullah Sallallahu Aleyhi ve Sellem'in 'Bir kadını beyyinesiz olarak recm etseydim' buyurduğu kadın mıdır?\" diye sordu. İbn Abbas \"Hayır, o kadın (kötülüğü) açıktan yapan bir kadındı\" demişti",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 7239,
			"arabicnumber": 7239,
			"text": "Ata b. Ebi Rebah'ın nakline göre Resulullah Sallallahu Aleyhi ve Sellem bir gece yatsı namazını gece karanlığı olan ateme vaktine kadar geciktirdi. Bunun üzerine Ömer dışarı çıktı ve \"Namaza gel Ya Resulallah! (Mesciddeki) kadınlar ve çocuklar uyudular!\" diye seslendi. Akabinde Resulullah Sallallahu Aleyhi ve Sellem başı su damlayarak dışarı çıktı ve \"Eğer ümmetime meşakkat verecek olmasaydım bu namazı işte bu vakitte kılmalarını em rederdi m \" buyurdu",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 7240,
			"arabicnumber": 7240,
			"text": "Ebu Hureyre'nin nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"Ümmetime meşakkat vermiş olmasaydım, onlara mutlaka misvak kullanmalarını emrederdim\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 7241,
			"arabicnumber": 7241,
			"text": "Enes şöyle demiştir: Nebi Sallallahu Aleyhi ve Sellem Ramazan ayının sonunda (iftar vaktinde yemeyip içmeyerek) visalorucu tuttu. Bunun üzerine birtakım insanlar da oruçlarını (arada bir şey yemeyerek) birbirine uladılar. Onların bu durumu Nebi Sallallahu Aleyhi ve Sellem'in kulağına gidince \"Eğer ay benim için uzatılsaydı, bu derinlemesine gidenlerin derinleştirmelerini terk edecekleri bir ulamayı muhakkak yapardım. Şüphesiz ben sizin gibi değilim. Rabbim beni doyurur ve içirir.\" buyurdu",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 7242,
			"arabicnumber": 7242,
			"text": "Ebu Hureyre r.a. şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem visal orucunu tutmayı yasak etti. Sahabiler \"Ya Resulallah! Sen (bir günün orucunu öbür güne ekleyerek) visal orucu tutuyorsun!\" dediler. Resulullah Sallallahu Aleyhi ve Sellem \"Sizin hanginiz bana benzer? Ben Rabbim beni doyurur ve bana su içirir halde gecelerim\" buyurdu. Sahabiler oruçları birbirine eklemekten vazgeçmeyince Resulullah Sallallahu Aleyhi ve Sellem oruçlarını bir gün, sonra bir gün daha (arka arkaya iki gün) birbirine ekledi. Sonra (üçüncü günü) hilali gördüler. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem (visal orucundan vazgeçmeyenıeri azarlar gibi) \"Eğer hilal gecikseydi sizin için (ders olsun diye) ben de o kadar daha arttımdımf\" buyurdu",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 7243,
			"arabicnumber": 7243,
			"text": "Aişe r.anha şöyle demiştir: Nebi Sallallahu Aleyhi ve Sellem'e İsmail'in duvarını (Kabedeki Hicr-i İsmail'i) kastederek \"Bu duvar Beytullahtan mıdır?\" diye sordum. Resulullah Sallallahu Aleyhi ve Sellem \"Evet (duvar, beyttendir)\" dedi. Ben yine \"(Kureyş) için ne mani vardı ki bu duvarı Beytullaha katmadılar?\" dedim. Resulullah Sallallahu Aleyhi ve Sellem \"Senin kavminin (bu hıcn Kabe'ye katmcıya) bütçeleri yetmedi. (Beyti daralttılar)\" diye cevap verdi. Ben \"Kabe'nin kapısı niçin bu kadar yüksektir?\" diye sordum. Resulullah Sallallahu Aleyhi ve Sellem \"Kavmin dilediği kimseleri Beytullaha koymak, dilediklerini de koymamak için böyle yaptı\" cevabını verdi. Sonra Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Ya Hz. Aişe radıyalldhu anhfı! Kavmin cahiliyet devrine yakın olmasaydı, ben Hicr-i İsmail'i Beytullaha katmak, kapısını da yer seviyesine indirmek isterdim. Fakat böyle yapıldığında kavminin kalplerinin kırılmasından endişe ederim",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 7244,
			"arabicnumber": 7244,
			"text": "Ebu Hureyre'nin nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: 'Hicret olmasaydı ben muhakkak Ensardan bir kişi olurdum. Eğer insanlar bir vadiye Ensar bir başka vadiye veya bir dağ yoluna girseydi, muhakkak ki ben Ensann vadisine veya dağ yoluna girerdim",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 7245,
			"arabicnumber": 7245,
			"text": "Abdullah b. Zeyd'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Eğer hicret olmasaydı, elbette ben Ensardan bir kimse olurdum. İnsanlar bir vadiye yahut bir dağ yoluna girip gitselerdi, ben muhakkak Ensann vadisine ve gittikleri dağ ya/una giderdim!\" Fethu'l-Bari Açıklaması: \"Keşke şöyle olsaydı diye temennı etmenin caizliği ve Yüce Allah'ın \"Keşke benim size karşı (koyacak) bir gücüm olsaydı veya güçlü bir kaleye sığınabilseydim\"(Hud 80) sözü.\" Kadı lyaz şöyle demiştir: İmam Buharibu başlıkla Allah'ın kazasına razı olan kimsenin \"Şöyle olsaydı şöyle olurdu\" demesinin caiz olduğunu kastetmektedir. \"Keşke benim size karşı (koyacak) bir gücüm olsaydı.\" İbn Battal şöyle demiştir: Bu örnek ayette yer alan \"lev\" şart edatının hüküm cümlesi (cevabı) mahzuftur. İfade adeta şöyledir: \"Benim size karşı (koyacak) bir gücüm olsaydı, sizinle yapmış olduğunuz bu fesad arasına girip engelolurdum.\" İbn Battal şöyle devam eder: Sözkonusu hüküm cümlesinin (cevabın) hazfi son derece beliğdir. Zira olumsuzluk kipiyle bütün engelleme çeşitleri kuşatılmış olmaktadır. Lut'un aleyhisselil.m istediği karşı koyacak çok adama sahip olmaktı. Aksi takdirde o Yüce Allah'tan sağlam ve güçlü bir kalesinin olduğunu biliyordu. Fakat ifadesini, cari olan adete göre kullanmıştır. İbn Battal şöyle devam eder: Ayet-i kerime bir mu'min gidermeye gücü yetmediği bir münkeri gördüğünde nasıl bir tavır takınması gerektiğini beyan etmektedir. Buna göre o kişi münkeri giderme de yardımcısı olmadığı için içi yanacak ve Rabbine itaat arzusu ve ona karşı günaha devam edilmesine tahammül edememekten dolayı böyle bir desteğin bulunmasını temenni edecektir. Buradan hareketle o kötülüğe diliyle ve gidermeye gücü yetmediği takdirde kalbiyle tepki gösterecektir. Sübki' nin zikretmiş olduğu hadise Buhari, \"Keşke şöyle olsaydı diye temenni etmenin caizliği\" cümlesi ile işaret etmiştir. Buhari'nin attığı bu başlık, sözkonusu temenninin istisna durumu hariç esasen caiz olmadığına işaret etmektedir. Bu hadis Nesai', İbn Mace, Tahavi'de Muhammed b. Aclan, el-A'rac, Ebu Hureyre isnadıyla Nebi Sallallahu Aleyhi ve Sellem'in ağzından şöyle nakledilmiştir: \"Kuvvetli mü'min, zayıf mü'minden daha hayırlıdır ve Yüce Allah'a daha sevimlidir. Bunların her birinde hayır vardır. Sana fayda verecek şeyi hırsla iste, bundan aciz olma. Bir şeyin üstesinden gelemediğinde 'Allah'ın kaderi böyle imiş O'nun dilediği olur' de. 'Keşke' demekten sakın. Zira 'Keşke' şeytana faaliyet kapısı açar. \"(İbn Mace, Zühd) Bu hadisi Müslim de Abdullah b. İdris'ten rivayet etmiştir.(Müslim, Kader) Taberi şöyle demiştir: \"Keşke\" demenin yasaklı ğı ile bunun caiz olduğunu gösteren hadisleri birbiriyle cem ve telif etmenin yolu şudur: Yasaklık, henüz gerçekleşmemiş bir fiil hakkında onun kesin olarak olacağına hükmetmekle ilgilidir. Buna göre mana şöyle olur: Gerçekleşmemiş bir iş için kesin olarak gerçekleşeceğine hükmederek ve içinden Allah'ın dilemesinin şart olduğunu geçirmeksizin \"Şayet şöyle yapsaydım bu iş olurdu\" deme. \"Keşke\" demenin caizliği ile ilgili rivayetler, kişi zikredilen şarta kesin olarak inandığı takdirde caizdir şeklinde yorumlanmıştır. Sözkonusu şart, Allah'ın dilemesi ve iradesi olmaksızın hiçbir şey gerçekleşmez düşüncesidir. Bu Ebu Bekir'in mağarada söylediği \"Onlardan herhangi bir ayağını kaldırsaydı bizi görecekti\" şeklindeki ifadesine benzer. Ebu Bekir, Yüce Allah'ın müşriklerin gözlerini Resulullah Sallallahu Aleyhi ve Sellem'in ve kendisinin üzerinden onlara körlük vererek veya başka bir yolla çevireceğine kesin olarak inandığı halde böyle kesin bir dil kullanmıştır. Fakat bu ifade onun ağzından cari olan adete göre çıkmıştır. O, Allah dilemedikçe müşriklerin ayaklarını kaldırsalar bile kendilerini göremeyeceklerine kesin olarak inanıyordu. Kadı Iyaz şöyle demiştir: İmam Buhari'nin kullandığı başlıktan ve bu bölümde zikrettiği hadislerden anlaşılan şudur: \"Lev ve levıa=keşke ... \" ifadesi, kişinin yaptığı şeylerden gelecekle ilgili olan hususlarda kullanılabilir. Çünkü gelecekte bundan başka bir fiilin olması da mümkündür. Bu, \"lev=keşke\" kabilindendir. Zira bu konuya ancak gelecekle ilgili olan şeyler girer. Bu da gerçek, sahih ve kesin değildir. Geçmişte olan veya olup bitmiş bulunan ya da gaybe ve geçmiş kadere itiraz niteliğinde olan şeyler böyle değildir. Kadı Iyaz şöyle devam eder: \"Keşke\" yasaklığı, kişinin bunun olacağına kesin olarak inanması açısındandır. Bu durumdaki kimse, sözkonusu fiili yapsa başına gelen kesinlikle gelmeyecekti inancındadır. Buna karşılık sözkonusu durumu Allah'ın dilemesine havale eden ve Allah bunu dilememiş olsaydı başıma gelmezdi diye düşünen kimse bu kabilden olmaz. Kadı Iyaz şöyle der: Hadisin manası hakkındaki kanaatime göre sözkonusu yasaklık, zahiri ve genelliği üzeredir. Fakat bu yasaklık tenzihidir. Bunun tenzihi olduğunu \"Zira 'Keşke' şeytana faaliyet kapısı açar\" ifadesi göstermektedir. Yani şeytan insanın kalbine kadere itiraz duygusu bırakır ve ona vesvese verir. Nevevı \"lev=keşke\" kelimesinin geçmişle ilgili olarak kullanıldığını ileri sürerek Kadı Iyaz'ı tenkit etmiş ve buna \"Sonradan bildiğimi önceden bilseydim kurbanlık sevk etmezdim\" hadisini örnek vermiştir. Doğru olanı, sözkonusu ifadenin fayda olmayan yerlerde kullanılmasının yasak olduğudur. İnsan bu cümleyi, Allah'a itaat konusunda yapamadıklarına karşı üzüntüsünden veya elde etmesi imkansız olan bir şeye içinin yanmasından ve benzeri şeylerden söylediği takdirde bunda herhangi bir sakınca yoktur. Hadislerde yer alan kullanımların ekserisi bu şekilde yorumlanır. Kurtubı el-Müfhim isimli eserinde şöyle demiştir: Müslim'in rivayet ettiği hadisten maksat, kaderde olan şeyin kişinin karşısına çıkmasından sonra yapılması gereken tek şey, Allah'ın emrine teslimiyet, takdir ettiğine razı olmak ve elden kaçana iltifat etmekten yüz çevirmektir. Zira kişi elden kaçırdığı şeyi düşünüp, 'Şöyle şöyle yapsaydım, şöyle şöyle olurdu' diyecek olursa ona şeytanın vesveseleri gelir ve bu sürüp giderek sonunda kişiyi hüsrana götürür. Böylece insan tedbirin takdirden daha önce geleceği vehmine kapılır. İşte bu, \"'Keşke' demekten sakın. Zira 'Keşke' şeytana faaliyet kapısı açar\" ifadesiyle şeytanın faaliyetlerine kapı aralayan yasak edilmiş vesilelerdir. Yoksa maksat, \"lev=keşke\" kelimesini mutlak olarak kullanmamak değildir. Zira Nebi Sallallahu Aleyhi ve Sellem bu kelimeyi birçok hadisinde kullanmıştır. Fakat bu kelimenin kullanılma yasaklığının yeri, kişinin sözkonusu mani ortadan kalksaydı kaderde olanın aksi olurdu inancıyla birlikte kadere karşı gelme şeklinde kullanılmasıyla ilgilidir. Yoksa kişinin maniyi gelecekte fayda olacak bir açıdan haber vermesiyle ilgili değildir. Zira bu gibi şeylerin söylenmesinin caiz olduğu noktasında ihtilaf yoktur ve bunda şeytana faaliyet kapısı açma olmadığı gibi, haramlığa götürecek bir şey de yoktur. \"Resulullah Sallallahu Aleyhi ve Sellem bir gece yatsı namazını gece karanlığı olan ateme vaktine kadar geciktirdi.\" Bu hadisin geniş bir açıklaması SaıM Bölümünde geçmişti. Aişe r.anha'nın Kabe'nin duvarıyla ilgili olan hadisinin geniş bir açıklaması Hac bölümünde geçmişti. Hadisten burada kastedilen \"Senin kavmin Kureyş cahiliye devrine yakın olmasaydı, ben Hicr-i İsmail'i bey te katmak, beytin kapısını da yer seviyesine indirmek isterdim. Fakat böyle yapıldığında kavminin kalplerinin kırılmasından endişe ederim\" cümlesidir. Ebu Hureyre'nin naklettiği \"Hicret olmasaydı ben muhakkak Ensardan bir kişi olurdum\" ve \"Eğer insanlar bir vadiye Ensar bir başka vadiye veya bir dağ yoluna girseydi\" ifadelerinin açıklaması Huneyn Gazvesi başlığı altında geçmişti",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 20
			}
		}
	]
}