{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"96": "Holding Fast to the Qur'an and Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7268,
			"arabicnumber": 7268,
			"text": "",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 7269,
			"arabicnumber": 7269,
			"text": "Bize el-Leys ibn Sa'd, Ukayl'den tahdîs etti ki, İbn Şihâb şöyle demiştir: Bana Enes ibn Mâlik (radıyallahü anh) haber verdi ki, kendisi, müslümânların Ebû Bekr'e bey'at ettiklerinin ertesi günü Omer'den işitmiştir. Omer, Ebû Bekr'den önce, Rasûlüllah'ın minberi üzerine doğrulmuş, şehâdet kelimelerini söylemiş, \"Amma ba'du (Sözün bundan sonrası şudur)\" deyip şunları söylemiştir: Allah kendi Rasûlü'nü dünyâda sizin yanınızda olan şeyler üzerine kendi yanında bulunan şeylere (cennet derecelerinin yükseklerine ve keramet hazînelerinin huzuruna) seçip almıştır. Ve şu Kitâb, Allah'ın kendi Rasûlü'nü hidâyete ulaştırmış olduğu Kitâb'dır. Şimdi sizler de bunu alıp tutunun ki, doğru yolu bulasınız. Ve çünkü Allah, ancak bu Kitâb vâsıtasıyle Rasûlü'ne hidâyet etmiştir",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 7270,
			"arabicnumber": 7270,
			"text": "İbn Abbâs radıyallahü anhüma:Peygamber(sallallahü aleyhi ve sellem) beni kendisine çekip sarmaştı da: \"Allah 'ım, buna Kitâb ilmîni öğret!\" diye duâ etti, demiştir",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 7271,
			"arabicnumber": 7271,
			"text": "Bize Mu'temir tahdîs edip şöyle dedi: Ben Avf'dan işittim, ona da Ebû'l-Minhâl haber vermiştir. O da Ebû Berze Nadle ibn Ubeyd el-Eslemî'den: Şübhesiz Allahü Taâlâ İslâm Dîni ile ve Peygamberi Muhammed (sallallahü aleyhi ve sellem) ile sizleri zengin kılmış yahut sizleri kaldırıp yükseltmiştir, dediğini işitmiştir",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 7272,
			"arabicnumber": 7272,
			"text": "",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 7273,
			"arabicnumber": 7273,
			"text": "",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 7274,
			"arabicnumber": 7274,
			"text": "",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 7275,
			"arabicnumber": 7275,
			"text": "Ebû Vâil şöyle dedi: Ben şu Ka'be mescidinde onun bakıcısı olan Usmân ibn Ebî Şeybe'nin yanına oturdum. O şöyle dedi: Benim yanıma Omer ibnu'l-Hattâb şu senin oturuşun gibi oturdu da: Şu Ka'be'nin içindeki sarı ve beyaz, yani altın ve gümüş hiçbirşey bırakmayıp hepsini müslümânlar arasında (onların işleri için) taksim edeyim diye kasdettim, dedi. dedi ki: Ben Omer'e: Sen bunu yapmıyorsun? dedim. Omer: (Niçin yapmıyorum?) iki sahibin, yani Rasûlüllah ile Ebû Bekr de bunu yapmadıkları için dedim, dedi. Omer: (Çünkü) o ikisi kendilerine iktidâ edilip uyulan iki insandırlar, dedi",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 7276,
			"arabicnumber": 7276,
			"text": "Ben el-A'meş'ten sordum. O Zeyd ibn Vehb'den söyledi. O da Huzeyfe (radıyallahü anh)'den şöyle derken işitmiştir: Bize Rasûlüllah (sallallahü aleyhi ve sellem) şöyle tahdîs etti: \"Emânet gökten insanların kalblerinin derinliğine iner (ve insanlar bunun üzerine fıtratlanmış olurlar). Sonra Kur'ân indi, onlar Kur'ân 'ı okudular. İnsanlar sünnetten emâneti ve onunla ilgili şeyleri öğrendiler. (Böylece insanlar için tabîat ve şerîat, emânetin korunması hususunda birleştiler)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 7277,
			"arabicnumber": 7277,
			"text": "Abdullah ibn Mes'ûd (radıyallahü anh) şöyle dedi: “Şübhesiz sözün en güzeli Allah'ın Kitâbı'dır. Yolun en güzeli de Muhammed'in yoludur. İşlerin en şerrlileri de dînde sonradan îcâd edilen bid'atlerdir. Size va'd edilegelen şeyler (tekrar dirilmek ve hâlleri) muhakkak gelecek ve siz bunlardan kaçıp kurtulacaklar değilsiniz",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 7279,
			"arabicnumber": 7279,
			"text": "",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 7280,
			"arabicnumber": 7280,
			"text": "Bize Hilâl ibnu Alî, Atâ ibn Yesâr'dan; o da Ebû Hureyre (radıyallahü anh)'den tahdîs etti ki, Rasûlüllah(sallallahü aleyhi ve sellem): \"Ümmetimin hepsi cennete girecektir. Ancak imtina edenler girmeyecektir\" buyurmuştur. Yâ Rasûlallah! Kimler imtina edecekler? diye sordular. Rasûlüllah: \"Her kim bana itaat ederse cennete girecektir. Her kim de bana âsî olursa o da (da'vetimi kabulden ve emirlerime itaatten) çekinip imtina etmiş olur (ve cennete giremez)\" buyurdu",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 7281,
			"arabicnumber": 7281,
			"text": "Bize Yezîd ibn Hârûn haber verdi. Bize Selîm ibn Hayyân tahdîs etti ve Yezîd ibn Harun'u hayırla övdü de şöyle dedi: Bize Saîd ibnu Mînâ tahdîs etti. Bize Câbir ibn Abdillah tahdîs etti yahut: Ben Câbir ibn Abdillah'tan işittim, şöyle diyordu: Bir kerre Peygamber(sallallahü aleyhi ve sellem) uyurken yanına birtakım melekler geldi de, bunlardan bâzıları: Bu zât uyuyor, dedi. Bâzıları da: Gözü uyuyor, fakat kalbi uyanıktır, dedi. üzerine bu melekler (birbirlerine): Bu dostunuzun yüksek sıfatı vardır(yüksek menkıbe sâhibidir). Haydi siz de bunun yüksek mevkiini haricî bir örnekle temsîl ediniz! dediler. Fakat bâzıları: İyi amma bu zât uyuyor, dediler. Bâzıları da: Hayır, O'nun gözü uyuyor, fakat kalbi uyanıktır, dediler. Bunun üzerine melekler: Bu Zât'ın haricî benzeri, şu bir kimsenin misâli gibidir ki, o kimse yeni bir ev yaptırır, o evde bir ziyafet yemeği tertîb eder ve bu ziyafete insanları da'vet etmek için bir da'vetçi gönderir. Bu da'vetçinin da'vetine kim icabet ederse, o (mükemmel) eve girer ve ziyafet yemeğinden yer. Her kim de da'vetçinin da'vetine icabet etmezse o eve giremez ve ziyafet yemeklerini de yiyemez. üzerine melekler yine birbirlerine: Haydi bu temsîli bu Zât'a îzâh ediniz de anlasın! dediler. Fakat yine bunlardan bâzıları: İyi amma bu Zât uyuyor, dediler. Bâzıları da: Hayır, gözleri uyuyor amma kalbi uyanıktır, dediler. Bunun üzerine melekler (kendi aralarında temsîli şöyle îzâh ettiler): O ev cennettir, da'vetçi de Muhammed(sallallahü aleyhi ve sellem)'dir. Her kim Muhammed'e itaat ederse, Allah'a itaat etmiştir. Her kim de Muhammed'e âsî olursa, Allah'a âsî olmuştur. Muhammed insanların arasını ayırdetmiştir(itaat ve isyan şiarını bildirip mü'minleri, münkirleri ayırdetmiştir)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 7282,
			"arabicnumber": 7282,
			"text": "Huzeyfe (radıyallahü anh) şöyle demiştir: Ey Kur'ân okuyucuları topluluğu!(Allah'ın emrine yapışmanız suretiyle) dosdoğru yola giriniz.(Eğer doğru yola girerseniz) şübhesiz sizler açık bir öne geçişle öne geçirilmiş olursunuz. (Eğer emre muhalefet edip de) dosdoğru yoldan sağa ve sola giden yolları tutarsanız, muhakkak pek uzak bir sapıklıkla sapmış olursunuz",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 7283,
			"arabicnumber": 7283,
			"text": "Bize Ebû Usâme, Bureyd'den; o da Ebû Burde'den; o da Ebû Mûsâ el-Eş'arî (radıyallahü anh)'den tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem) şöyle buyurmuştur: \"Benim meselim (benzerim) ve beni kendisiyle size Allah'ın peygamber gönderdiği şeyin meseli, ancak şu adamın benzeri gibidir ki, o, kavmine geldi de: Ey kavmim! Ben şurada iki gözümle ordu gördüm. (Onlar beni soydular... ben kaçtım, şimdi haber veriyorum). Görüyorsunuz, ben çıplak bir nezîrim (sizi yarının musibetinden korkutuyorum). Hemen kurtulmaya, hemen kaçmaya bakınız! der. haber üzerine kavminden bir taife ona itaat eder de bütün gece vakaar ve haysiyetle yürümüş ve kaçıp kurtulmuşlardır. Kavminden bir kısmı da onu yalanlamışlar da yerlerinde kalmışlardır. Bunun üzerine sabahleyin ansızın asker onları basıp helak etmiş ve köklerini kazımıştır. bu bana itaat eden ve benim getirdiğime uyan kimse ile bana âsî olan ve benim getirmiş olduğum hakkı yalanlayan kimsenin meselidir",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 7285,
			"arabicnumber": 7285,
			"text": "Ebû Bekr de Omer'e: Vallahi her kim namazla zekât arasını ayırırsa, ben muhakkak bu zümre ile harb ederim. Çünkü zekât mâlî bir haktır. Allah'a yemîn ederim ki, bunlar Rasûlüllah'a ödemekte oldukları bir ipi (yani az olsa bile meydana gelen zekât hakkını) benden men' ederlerse, onun men' edilmesi üzerine ben muhakkak onlarla harb ederim! dedi. üzerine Omer: Vallahi gördüm ki, dînden dönenlerin katli hakkındaki Ebû Bekr'in bu hükmü, Allah'ın Ebû Bekr'in gönlünde yarattığı genişliğin eseridir. Bu sayede (getirdiği delilden dolayı) onlarla harb etmenin hakk olduğunu öğrendim, dedi (ve Ebû Bekr'in kararını doğruladı). ibn Bukeyr ile (Leys'in kâtibi olan) Abdullah ibn Salih, İmâm el-Leys'den \"Anâkan ( = Bir dişi oğlağı)\" şeklinde söylemişlerdir ki, bu daha sahihtir",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 7286,
			"arabicnumber": 7286,
			"text": "Abdullah İbn Abbâs radıyallahü anhüma şöyle demiştir: Bir ara Uyeyne ibn Hısn ibni Huzeyfe ibn Bedr, Medîne'ye gelmiş ve kardeşi oğlu Hurr ibn Kays ibn Hısn'ın evine inip ona konuk olmuştu. Hurr ibn Kays ise Omer'in yakınlarındandı. Meclisinde genç, ihtiyar birtakım kurrâ ve fakîhler bulunurdu. Halîfe onlarla mühim âmme işlerini danışır, istişare ederdi. Uyeyne, kardeşinin oğlu Hurr ibn Kays'a: Ey kardeşim oğlu! Senin Halîfe'nin yanında yüksek mevki'-in vardır. Benim için yanına girmeye bir izin alsan da onu ziyaret etsem! dedi. de ona: Ben senin için onun yanına girmene izin isteyeceğim! dedi. Abbâs dedi ki: Hurr, Uyeyne için izni aldı. Uyeyne huzura girdiğinde: Ey Hattâb oğlu! Vallahi sen bize ne bol dünyalık verirsin, ne de aramızda adaletle hükmedersin! dedi. sözü üzerine Omer öfkelendi, hattâ Uyeyne'yi dövmeye kasdedip üzerine yürüdüğü sırada, kardeşi oğlu Hurr ibn Kays müdâhale edip: Ey Mü'minlerin Emîri! Şübhesiz Yüce Allah, Peygamberi'-ne:\"Sen affı -kolaylığı- tut. İyiliği emret. Câhillerden yüz çevir\"(el-A'râf: 199) buyurdu. Şübhesiz bu Uyeyne de o câhillerdendir, dedi. Abbâs dedi ki: Vallahi Hurr ibn Kays bu âyeti okuyunca, o haşmetli Omer olduğu yerde çakılmış gibi irkildi. Vallahi bir adım ileri gitmedi. Esasen Omer Allah Kitâbı'nın mukaddes huzurunda çok durucu bir kimse idi (yani onun hükmünü geçmezdi)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 7287,
			"arabicnumber": 7287,
			"text": "Esma bintu Ebî Bekr (radıyallahü anh) şöyle demiştir: Ben güneş tutulması sırasında Âişe'nin yanına geldim. İnsanlar hep namaza durmuşlar, Âişe de ayakta durmuş, namaz kılıyordu. Ben: İnsanlara ne oluyor ki (neden korkuyorlar)? dedim. Âişe (güneş tutulması meydana geldiğini anlatmak için) gökyüzüne doğru eli ile işaret etti de: Subhânallâhi, dedi. Bu bir (azâb için olan) âyet mi (yahut kıyâmetin yaklaşması alâmeti mi)? diye sordum. başı ile: Evet! diye işaret etti. aleyhi ve sellem) namazı bitirince, Allah'a hamd ve sena eyledi. Sonra şöyle buyurdu: \"Ben cennet ve cehenneme kadar evvelce görmediğim hiçbirşey kalmadı ki, bu makaamımda hepsini görmüş olmayayım. Bana vahyolundu ki, sizler kabirlerinizde Mesih Deccâl-yüzünden çekilecek fitneye yakın bir imtihan geçireceksiniz. Mü'min yahut müslim -râvî Fâtıma bintu’l-Munzir: Esmâ'nın bu iki lâfızdan hangisini söylediğini bilmiyorum, demiştir- o kimse, Muhammed hakkında sorulduğunda: Muhammed'dir; O bize beyyineler getirdi, biz de O'nun da'vetine icabet edip îmân eyledik! diyecek. Ona sorucu melekler tarafından: Sen iyi hâlde yat uyu! Biz senin kat'î inanmış kimse olduğunu bildik, denilir. yahut kalbinde şübhesi olan kimseye gelince -Fâtıma bintu'l-Munzir: Ben Esmâ'nın bu iki ta'bîrden hangisini söylediğini bilmiyorum, demiştir-o kimse de: O'nun kim olduğunu bilmiyorum. Ben insanlardan işittim. O'nun hakkında birşeyler söylüyorlardı, ben de onu söyledim, diyecektir",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 7288,
			"arabicnumber": 7288,
			"text": "Bize Mâlik, Ebu'z-Zinâd'dan; o da el-A'rec'den; oda Ebû Hureyre (radıyallahü anh)'den tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem) şöyle buyurmuştur: \"Sizler, sizi bırakıp teklif etmediğim hususlarda beni kendi hâlime bırakınız! Sizden evvelki ümmetler ancak çok suâl sormaları ve peygamberlerine karşı ihtilâfları sebebiyle helâk olmuşlardır. Ben sizleri birşeyden nehyettiğim zaman, ondan sakınınız. Sizlere birşey emrettiğim zaman da emrimi tutunuz. Gücünüzün yettiği kadar onu yerine getiriniz",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 7289,
			"arabicnumber": 7289,
			"text": "",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 7290,
			"arabicnumber": 7290,
			"text": "",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 7291,
			"arabicnumber": 7291,
			"text": "Ebû Mûsâ el-Eş'arî (radıyallahü anh) şöyle demiştir: Bir kerresinde Rasûlüllah(sallallahü aleyhi ve sellem)'tan hoşlanmadığı bâzı şeyler soruldu. Sahâbîler bu gibi soruları çoğalttıklarındaRasûlüllah öfkelendi ve: \"Bana istediğinizi sorun!\" diye buyurdu. üzerine (Abdullah isminde) bir adam ayağa kalktı da: Yâ Rasûlallah! Benim babam kimdir? dedi. Rasûlüllah ona: \"Senin baban Huzâfe'dir!\" buyurdu. sonra (Sa'd isminde) başka biri ayağa kalktı ve: Yâ Rasûlallah! Benim babam kimdir? dedi. Rasûlüllah ona da: \"Senin baban Şeybe'nin âzâdlısı Sâlim'dir\" buyurdu. Omer ibnu'l-Hattâb, Rasûlüllah’ın yüzündeki öfke alâmetini görünce: Yâ Rasûlallah! Biz Azîz ve Celîl olan Allah'a tevbe ediyoruz! dedi",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 7292,
			"arabicnumber": 7292,
			"text": "",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 7293,
			"arabicnumber": 7293,
			"text": "",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 7294,
			"arabicnumber": 7294,
			"text": "ez-Zuhrî şöyle demiştir: Bana Enes ibn Mâlik (radıyallahü anh) şöyle haber verdi: Peygamber(sallallahü aleyhi ve sellem) güneş gündüzün ortasından meylettiği zaman hücresinden çıktı ve öğle namazını kıldırdı. Selâm verince minber üzerine çıkıp ayakta durdu. Kıyâmet saatini zikretti ve onun önünde pek büyük işler olacağını söyledi. Sonra: \"Bana birşey sormak isteyen varsa şimdi sorsun. Vallahi bu makaamimda durduğum müddetçe bana her ne sorarsanız hemen sizlere haber vereceğim!\" buyurdu. şöyle dedi: İnsanlar (Peygamber'in gadabından müteessir olarak) pek çok ağlaştılar.Rasûlüllah da tekrar tekrar \"Bana sorunuz\" demeyi çoğaltıyordu. dedi ki: Bu sırada bir adam O'na doğru ayağa kalktı da: Yâ Rasûlallah! Benim gireceğim yer neresidir? diye sordu. Rasûlüllah ona: \"Cehennemdir\" cevâbını verdi. Abdullah ibn Huzâfe es-Sehmî(radıyallahü anh) ayağa kalktı ve: Yâ Rasûlallah! Benim babam kimdir? diye sordu. Rasûlüllah ona da: \"Baban Huzâfe'dir!\" buyurdu. dedi ki: Sonra Rasûlüllah yine \"Banasorunuz, banasorunuz\" demeyi çoğalttı. Bunun üzerine Omer ibnu'l-Hattâb (radıyallahü anh) iki dizi üzerine çöktü de: (Yâ Rasûlallah, bu kadarı yeter!) Biz Allah Taâlâ'yı Rabb, İslâm'ı dîn, Muhammed'i rasûl olarak kabul ve tasdîk ettik, dedi. dedi ki: Omer bu sözü söylediği zaman Rasûlüllah biraz sükût ettikten sonra şöyle buyurdu: \"Nefsim elinde bulunan Allah'a yemin ederim ki, demincek ben namaz kılarken cennet ile cehennem şu duvarın yüzünde bana arz olundu. Ben hayırda ve şerrde bu günün benzeri bir gün görmüş değilim\" buyurdu",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 7295,
			"arabicnumber": 7295,
			"text": "Bize Şu'be tahdîs edip şöyle dedi: Bana Basra Kaadısı Mûsâ ibnu Enes haber verip şöyle dedi: Ben Enes ibn Mâlik (radıyallahü anh)'ten işittim, şöyle dedi: Bir adam: Ey Allah'ın Peygamberi! Benim babam kimdir? diye sordu. Rasûlüllah(sallallahü aleyhi ve sellem) da ona: \"Senin baban Fulân'dır (yani Huzâfe'dir)\" buyurdu. Bunun üzerine 'Ey imân edenler! Size apaçık söylenirse fenanıza gidecek şeyler sormayınız...\"(el-Mâide: 101) âyeti indi",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 7296,
			"arabicnumber": 7296,
			"text": "Bize Verkaa ibn Amr, Abdullah ibn Abdirrahmân'dan tahdîs etti ki, o şöyle demiştir: Ben Enes ibn Mâlik (radıyallahü anh)'ten işittim, şöyle diyordu: Rasûlüllah (sallallahü aleyhi ve sellem): \"İnsanlar birbirlerine birtakım suâller sormaktan asla vazgeçmiyeceklerdir. Hattâ: 'Herşeyi yaratan Allah'tır, fakat Allah'ı kim yaratmıştır?' diyeceklerdir\" buyurdu",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 7297,
			"arabicnumber": 7297,
			"text": "",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 7298,
			"arabicnumber": 7298,
			"text": "",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 7299,
			"arabicnumber": 7299,
			"text": "",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 7300,
			"arabicnumber": 7300,
			"text": "Bana İbrâhîm ibn Yezîd et-Teymî tahdîs etti. Bana Yezîd ibn Şurayh tahdîs edip şöyle dedi: Alî ibn Ebî Tâlib bizlere pişirilmiş tuğladan yapılmış bir minber üzerinde hutbe yaptı. Üzerinde, kınında asılı bir sahîfe bulunan bir kılıç vardı. Vallahi bizim yanımızda okunan hiçbir yazı yoktur, ancak Allah'ın Kitabı ve bir de şu sahîfedeki şeyler vardır, dedi ve sahîfeyi açtı. diyet develerinin yaşlan ile“Medine Aîr Dağı 'ndan şuraya kadar haremdir. Kim Medine'nin bu haremi içinde bir bid'at çıkarırsa, Allah'ın, meleklerin ve bütün insanların la'neti onun üzerine olsun. Allah o kimseden hiçbir sarf ve adl kabul etmesin!\" hadîsi, bir de \"Müslümanların emânı birdir. O emânı müslümânların (kadın ve köle nev'inden) en aşağı bir ferdi de üzerine alır. Her kim bir müslümânın verdiği ahdi bozarsa, Allah'ın, meleklerin ve bütün insanların la'neti onun üzerine olsun. Allah o kimseden hiçbir sarf ve hiçbir adl kabul etmesin!\" o sahîfede \"Her kim de kendi efendilerinden başka bir kavmi, efendilerinin izni olmaksızın velî ve efendi edinirse, Allah'ın, meleklerin ve bütün insanların la'neti onun aleyhine olsun; Allah ondan hiçbir sarf ve hiçbir adl kabul etmesin!\" hadîsi yazılmıştır",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 7301,
			"arabicnumber": 7301,
			"text": "Âişe (r.anha) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) bir iş yaptı da o hususta ruhsat verdi. (Birtakım insanlar Peygamber'in yapıp da ruhsat verdiği o iş kendisine hâstır zannedip) o işi yapmaktan çekindiler. Onların bu çekinmesi Peygamber'e ulaşınca, Allah'a hamdettikten sonra: \"Birtakım topluluklara ne oluyor ki, onlar benim yapmakta olduğum birşeyi yapmaktan çekiniyorlar! Allah'a yemîn ederim ki, ben onların Allah'ı en çok bilenleri ve Allah'tan en çok korkanlarıyımdır!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 7302,
			"arabicnumber": 7302,
			"text": "Abdullah ibnu Ebî Muleyke şöyle demiştir: Çok hayırlı iki zât Ebû Bekr ile Omer helak olmaya yaklaşmışlardı:Peygamber'in huzuruna Temîm oğulları hey'eti geldiği zaman, bu ikisinden biri (yani Omer), \"Mucâsi' oğulları'nın kardeşi olan el-Akra ibn Habis et-Teymî el-Hanzalî'yi onlara emîr yap\" diye işaret etti. Diğeri de başkasını (yani Ka'kaa ibn Ma'bed ibn Zurâre et-Teymî'yi) emîr yap diye işaret etti. Bunun üzerine Ebû Bekr, Omer'e: Sen sırf bana muhalefet etmek istedin! dedi. Omer de: Hayır sana muhalefet etmek istemedim, dedi. yanında münâkaşa ettiler ve sesleri yükseldi. Bunun üzerine şu âyetler indi:\"Ey imân edenler, sesleriniziPeygamber'in sesinden yüksek çıkarmayın. Ona sözle, birbirinize bağırdığınız gibi bağırmayın ki, siz farkına varmadan amelleriniz boşa gider... \" (el-Hucurât: 2-3). Muleyke şöyle dedi: Abdullah ibnu'z-Zubeyr şöyle dedi: Artık Omer bu âyetin inmesinden sonra -İbnu'z-Zubeyr bunu, dedesi Ebû Bekr'i kasdederek anasının babasından zikretmedi- Peygamber'le bir hadîs konuştuğu zaman, O'na gizli şeyler söyleyen bir kardeş gibi konuşur,Peygamber anlamak isteyip soruncaya kadar sesini O'na işittirmezdi",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 7303,
			"arabicnumber": 7303,
			"text": "Bana Mâlik, Hişâm ibn Urve'den; o da babası Urve ibnu'z-Zubeyr'den; o da mü'minlerin anası Âişe (r.anha)'den tahdîs etti ki, Rasûlüllah(sallallahü aleyhi ve sellem) vefâtiyle netîcelenen hastalığı içinde: \"Ebû Bekr'e söyleyin de insanlara namazı kıldırsın!\" buyurdu. Âişe şöyle dedi: Ben: Ebû Bekr Sen'in makaamında (yani namaz kıldırdığın mihrâbda) durursa, ağlamaktan kıraati insanlara işitteremez. Omer'e emret de insanlara o namaz kıldırsın! dedim. yine: \"Ebû Bekr'e söyleyin de insanlara namaz kıldırsın!” buyurdu. Âişe şöyle dedi: Ben Hafsa'ya da: Peygamber'e: Ebû Bekr Sen'in makaamında durursa ağlamaktan kıraati insanlara işittiremez. Onun için Omer'e emret de insanlara o namaz kıldırsın! diye söyle! dedim. dediğimi yaptı. Onun üzerineRasûlüllah: \"Şübhesiz ki, sizler elbette YûsufPeygamber'in sahibeleri olan kadınlarsınız (yani onun günündeki kadınlar gibisiniz). Ebû Bekr'e emredin de insanlara namazı o kıldırsın!\" buyurdu. üzerine Hafsa, Âişe'ye hitaben: Zâten senden bana hayır gelecek değildi! dedi (de canının sıkıntısını açıkladı)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 7304,
			"arabicnumber": 7304,
			"text": "Bize ez-Zuhrî tahdîs etti ki; Sehl ibn Sa'd es-Sâidî (radıyallahü anh) şöyle demiştir: Uveymir el-Aclânî, Aclân oğulları'nın başkanı olan Âsim ibn Adiyy'e geldi de: Bana re'yini haber ver: Bir adam karısı ile beraber bir adamı bulsa, kadının kocası o adamı öldürmeli, siz de öldürdüğü adama mukaabil onu öldürmeli misiniz? (Yoksa bu koca nasıl yapar?) Yâ Âsım, sen bu mes'eleyi benim için Rasûlüllah'a soruver! dedi. üzerine Âsim bunu Peygamber'e sordu. Peygamber de böyle soruları, hoşlanmayıp, ayıpladı. Akabinde Âsım ailesi yanına döndü, Uveymir de geldi. Âsim, Uveymir'e Peygamber'in böyle sorulardan hoşlanmayıp ayıpladığını haber verdi. Bunun üzerine Uveymir: Vallahi ben bizzat kendim Peygamber'e gideceğim de bunu soracağım! dedi ve Peygamber'e geldi. sırada Yüce Allah, Âsım’ın ardından-\"Zevcelerine zina isnâd eden, kendilerinin kendilerinden başka şâhidleri de bulunmayan kimselere gelince, onlardan herbirinin yapacağı şâhidlik, kendisinin hakîkaten sâdıklardan olduğunu Allah'a yemin ile dört kerre tekrar edeceği şâhidliktir. Beşinci şehâdet de eğer yalancılardan ise Allah'ın lâ’neti muhakkak kendisinin üstüne (olmasını ifâde etmesidir...\" (en-Nûr: 6-9) âyetleri olan - Kur'ân indirmişti. Peygamber, Uveymir'e: \"Allah senin ve karın hakkında Kur'ân âyeti indirdi\" dedi ve onların ikisini çağırdı. karı-koca, Peygamber'in önüne geçip birbiriyle la'netleşme yemîni yaptılar. Uveymir: Yâ Rasûlallah! Eğer ben bu kadını yanımda tutarsam, ben bunun aleyhine yalan söylemiş olurum! dedi de Peygamber ona kadınından ayrılmasını emretmeden o kadını boşayıp ayrıldı. la'netleşme yapanlar hakkında onların birbirlerinden ayrılmaları sünnet yani kaanûn oldu. Peygamber meclistekilere: \"Bu kadına bakınız! Eğer bu kadın keler fasilesinden kızılca kurt gibi kısa bir çocuk getirirse, ben Uveymir'in kadına ancak iftira ettiğini sanırım. Eğer kadın bedeni siyah, iri gözlü ve kıçının iki yanı büyük tipte bir çocuk getirirse, ben Uveymir'in kadına zina isnadında doğru söylediğini sanırım\" buyurdu. kadın, çocuğu sevilmeyen iş üzerine getirdi (yani esmer, iri gözlü hâlde getirdi; çünkü bu, âdette kadının zinasının sübütunu tazammun etmekteydi)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 7305,
			"arabicnumber": 7305,
			"text": "İbn Şihâb şöyle dedi: Bana Mâlik ibn Evs en-Nasrî haber verdi. (İbn Şihâb dedi ki:) Muhammed ibn Cubeyr de bana bu gelecek hadîsten şöyle zikretti: Ben Mâlik ibn Evs'in yanına girdim de, ona bu hadîsi sordum. O şöyle dedi: Ben gittim, nihayet Omer'in yanına girdim. Ben onun yanında otururken, kapıcısı Yerfa, Omer'e geldi de: (Ey Mü'minlerin Emîri!) Usmân ibn Affân, Abdurrahmân ibn Avf, ez-Zubeyr ibnu'l-Avvâm, Sa'd ibn Ebî Vakkaas geldiler, senin huzuruna girmeye izin isterler, onlara iznin var mı? dedi. Evet vardır, dedi. izin verdi. Girdiler, selâm verip oturdular. Biraz sonra Yerfa yine geldi ve: Alî ile Abbâs da geldiler, izin isterler, müsâade var mı? dedi. Omer onlara da izin verdi. Bunlar da girdiler. Abbâs: Ey Mü'minlerin Emîri! Benimle (Alî'yi işaret ederek) şu zâlim arasında hükmet! dedi ve bu ikisi birbirine kaba ve sert sözler söylediler. bulunan topluluk, Usmân ve diğer arkadaşları: Ey Mü'minlerin Emîri, bunların aralarında hükmedip gönüllerine huzur ve sükûn ver! dediler. Bunun üzerine Omer: Sabrediniz, acele etmeyiniz! Gök ve Yer izni iradesiyle duran Allah hakkı için size sorarım: Siz bilirsiniz ki,Rasûlüllah(sallallahü aleyhi ve sellem):\"Biz peygamberler camiasının terîkesi vâris olunmaz. Bizim bıraktığımız her mal sadakadır, vakıftır!\" buyurdu. Ve bu sözüyleRasûlüllah kendisini kasdediyordu, değil mi? dedi. topluluk, yânı Usmân ile arkadaşları: Evet, Rasûlüllah böyle buyurdu! diye tasdîk ettiler. Bunun üzerine Omer, Alî ile Abbâs'a dönüp: Allah hakkı için size de sorarım:Rasûlüllah'ın, kendisini kasdederek böyle buyurduğunu siz de bilirsiniz, değil mi? dedi. ile Abbâs da: Evet, diye tasdîk ettiler. Bunun üzerine Omer: Şimdi ben size bu malın hukukî vaziyetini söyleyip bildireyim! diye şöyle îzâh etti: Allahü Taâlâ bu fey'de tasarrufu Rasûlüllah'a tahsîs buyurdu. O'ndan başka kimseye bu hakkı vermedi. Çünkü şânı yüce olan Allah Kur'ân'da \"Allah'ın onlardan Rasûlü'ne verdiği fey'e gelince; siz bunun üzerine ne ata, ne deveye binip koşmadınız. Fakat Allah rasûllerini dileyeceği kimselere musallat eder. Allah herşeye hakkıyle kaadirdir... \"(el-Haşr 6-8) buyurmuştur. dolayı bu malda tasarruf etme, sâde Rasûlüllah'ın hakkı idi. Sonra vallahi bu mala sizden başka kimse ortak olmadı. Ve sizin zararınıza kimse tasarruf da iddia eylemedi. Rasûlüllah bu fey' malının nemasını size verdi ve onu aranızda taksim edip dağıttı. Nihayet fey'den o malın aslı mahfuz kaldı. Peygamber bu maldan ailesinin bir senelik nafakasını ayırır, onları infâk ederdi. Sonra bundan arta kalanı alırdı. Onu Allah'ın malı (vakıf) kılardı. (Cihâd ve hayır yollarına harcardı.) Bu malı Peygamber sağlığında böyle kullandı. Ey cemâat! Size Allah adiyle soruyorum: Sizler de bunu böyle biliyor musunuz? dedi. Onlar da: Evet, dediler. Omer, Alî ile Abbâs'a: Ben sizlere de Allah adiyle soruyorum: Siz ikiniz de bunun böyle olduğunu biliyor musunuz? dedi. da: Evet biliyoruz, dediler. (Omer devamla:) Sonra Allah, Peygamber'ini vefat ettirdiğinde Ebû Bekr: Ben Rasûlüllah'ın vekîliyim! diye bu mallara el koydu ve Rasûlüllah'ın kullandığı gibi kullandı. Omer Alî ile Abbâs'a doğru dönerek: Ebû Bekr'in bu suretle muamele ettiği zamanı siz de hatırlarsınız. dedi ki: Siz ikiniz o zaman Ebû Bekr'in o mal hakkında şöyle şöyle yaptığını söylüyordunuz. Allah bilir ki, Ebû Bekr bu hareketinde doğru idi, lutufkârdı, akıl ve zekâ sahibi idi. Hakka uymuştu. Sonra Allah Ebû Bekr'i vefat ettirdi. Ben de: Rasûlüllah'ın ve Ebû Bekr'in halefiyim! dedim. Ve emaretimin ilk iki yılında bu mala el koydum. Ve Rasûlüllah ile Ebû Bekr'in kullandığı gibi idare ettim. Sonra ikiniz müştereken bir kelime üzerinde birleşip bana geldiniz. İşiniz toplu olup aranızda niza yoktu. (Sizinle görüştüm. Sonra ayrı ayrı geldiniz.) Yâ Abbâs, sen bana geldin. Benden kardeşinin oğlundan isabet eden hisseni istiyordun. (Alî'yi kasdederek:) Bu da eşinin babasından nasîbine düşen hissesini istiyordu. Bunun üzerine ben size: İsterseniz bu hurmalıkları size vereyim. Allah'ın ahdi ve andı boynunuza olmak üzere siz bu malı Rasûlüllah'ın, Ebû Bekr'in ve emirliğim zamanında benim idare ettiğimiz gibi idare ediniz. Şayet kabul etmezseniz, artık bana birşey söylemeyiniz! dedim. Bu teklifim üzerine siz de: Peki, bu şartla bize ver! dediniz. Ben de ikinize teslîm ettim. Şimdi ey cemâat! Allah adına yemînle sizlere soruyorum: Ben bu malı bu şartla bu ikisine teslîm ettim mi? dedi. Evet, teslîm ettin! dediler. Omer Alî ile Abbâs'a döndü de: Sizlere de Allah'a yemînle soruyorum: Ben bu malı bu suretle sizlere teslîm ettim mi? dedi. da: Evet, teslîm ettin! dediler. Omer onlara: (Aranızda çıkan ihtilâf üzerine) şimdi benden bunun hâricinde bir hüküm mü istiyorsunuz? Gök ve Yer kendi izniyle, iradesiyle ayakta duran Allah'a yemîn ederim ki, ben kıyâmet kopuncaya kadar bunun hâricinde bir hükümde bulunamam. Eğer siz idareden âciz iseniz bana geri veriniz. Ben onu sizin hesabınıza yeterlilikle idare ederim! dedi",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 7306,
			"arabicnumber": 7306,
			"text": "Bize Âsim ibn Süleyman el-Ahvel tahdîs edip şöyle dedi: Ben Enes ibn MâIik (radıyallahü anh)'e: Rasûlüllah(sallallahü aleyhi ve sellem) Medine'yi harem kıldı mı? diye sordum. Evet. “Medine'nin şuradan şuraya kadar olan sahası haremdir. Bu hudûdlar arası sahanın ağacı kesilmez. (Bu sahada bid'at çıkarılmaz.) Kim burada bir bid'at (dîne aykırı bir iş) meydana çıkarırsa Allah'ın, meleklerin ve bütün insanların la'neti onun üzerine olsun!” dedi. şöyle dedi: Bana Mûsâ ibnu Enes haber verdi ki: O \"Yâhud bir bid'atçiyi barındırırsa\" demiştir",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 7307,
			"arabicnumber": 7307,
			"text": "",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 7308,
			"arabicnumber": 7308,
			"text": "Ben el-A'meş'ten işittim, şöyle dedi: Ben Ebû Vâil’e: Sen Sıffîn harbinde hazır bulundun mu? diye sordum. O: Evet hazır bulundum. Ben Sehl ibn Huneyn'den şöyle derken işittim... dedi. Yine bize Mûsâ,ibnu İsmâîl tahdîs etti. Bize Ebû Avâne, el-A'meş'ten tahdîs etti ki, Ebû Vâil şöyle demiştir: insanlar, (bu kıtal hakkında) dîniniz aleyhine olan re'ylerinizi ittihâm ediniz. (Çünkü sizler ictihâd ettiğiniz bir ictihâdla İslâm'da dîn kardeşlerinizle muharebe yapmaktasınız.) Yemîn olsun ki, ben Hudeybiye'deki Ebû Cendel gününde kendi nefsimi şöyle gördüm: Eğer Rasûlüllah'ın(Ebû Cendel'i sulh maddesine göre müşriklere) geri vermesi emrini reddetmeye muktedir olaydım, muhakkak onu reddedecektim. Biz Allah yolunda kılıçlarımızı henüz omuzlarımızdan indirmemiştik. Ebû Cendel'i geri vermeme teşebbüsümüz bizleri muhakkak korkunç bir iş içine düşürecekti. Şu kadar var ki, kılıçlarımız bizi şu harb işinden başka hayırlı bilmekte olduğumuz kolay bir işe götürmüştür. şöyle dedi: Ebû Vâil: Ben Sıffîn vak'asında hazır bulundum. O ne kadar çirkin Sıffîn idi (yânı orada olan muharebe ne kadar kötü idi)! demiştir",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 7309,
			"arabicnumber": 7309,
			"text": "",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 7310,
			"arabicnumber": 7310,
			"text": "Ben Câbir ibn Abdillah (radıyallahü anh)'tan işittim, şöyle diyordu: hasta oldum. Rasûlüllah(sallallahü aleyhi ve sellem) ile Ebû Bekr yürüyerek Selime oğulları yurdundaki evime, bana hasta ziyaretine geldiler. Onlar bana geldiklerinde ben bayılmış hâldeydim. Rasûlüllah abdest aldı da sonra abdest aldığı sudan benim üzerime döktü. Ben bunun üzerine ayıldım ve: Yâ Rasûlallah! -Bazen râvî Sufyân şöyle söyledi: Ey Rasûlallah!- Ben malımda nasıl hükmedeyim, malımda nasıl yapayım? diye sordum. Rasûlüllah bana en-Nisâ: 11-13. Mîrâs Âyeti ininceye kadar hiçbir cevâb vermedi, dedi",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 7311,
			"arabicnumber": 7311,
			"text": "",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 7312,
			"arabicnumber": 7312,
			"text": "Bize İbnu Vehb, Yûnus'tan haber verdi ki, ibn Şihâb şöyle demiştir: Bana Humeyd haber verip şöyle dedi: Ben Muâviye ibn Ebî Sufyân (radıyallahü anh)'dan işittim, o hutbe yapıyordu, şöyle dedi: Ben Peygamber(sallallahü aleyhi ve sellem)'den işittim, şöyle buyuruyordu: \"Allahü Taâlâ her kimin hayrını irâde ederse, ona dîn hususunda (büyük bir) anlayış verir. Ben (verici değil) yalnız aranızda taksim ediciyim. Veren ise Allah'tır. Bu ümmetin işi, kıyâmet kopuncaya -yahut: Allah’ın emri gelinceye- kadar hep hakk dîn üzerinde dosdoğru olmakta devam edecektir",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 7313,
			"arabicnumber": 7313,
			"text": "",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 7314,
			"arabicnumber": 7314,
			"text": "",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 7315,
			"arabicnumber": 7315,
			"text": "Bize Ebû Avâne, Ebû Bişr'den; o da Saîd ibn Cubeyr'den; o da İbn Abbâs radıyallahü anhüma'tan şöyle tahdîs etti: Bir kadın Peygamber (sallallahü aleyhi ve sellem)'e geldi de: Annem hacc yapmayı nezretmişti, hacc edemeden evvel öldü. Şimdi ben onun adına hacc yapabilir miyim? diye sordu. \"Evet, ananın yerine vekâleten hacc etmelisin! Bana ne düşündüğünü söyle: Eğer onun üzerinde bir kula borcu olsaydı, sen ananın bu borcunu öder miydin?\" diye sordu. Evet öderdim, dedi. üzerine Rasûlüllah, onun şahsında: \"Allah'ın hakkı olan borcu da ödeyiniz! Şübhe yok ki, Allah hakkı ödenmeye başkalarından daha ziyâde lâyıktır!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 7316,
			"arabicnumber": 7316,
			"text": "",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 7318,
			"arabicnumber": 7318,
			"text": "",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 7319,
			"arabicnumber": 7319,
			"text": "",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 7320,
			"arabicnumber": 7320,
			"text": "Bize Yemen'den Ebû Omer es-San'ânî, Zeyd ibn Eslem'den; o da Atâ ibn Yesâr'dan; o da Ebû Saîd el-Hudrî (radıyallahü anh)’den tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem): ''Muhakkak sizler, sizden önceki ümmetlerin yolunca karış karış, arşın arşın uyup gideceksiniz. Hattâ onlar bir keler deliğine girmiş olsalar bile (siz de o daracık yere girecek) onlara tâbi' olacaksınız\" buyurdu. Yâ Rasûlallah! Bu ümmetler Yahûdîler’le Hrıstîyanlar mı? diye sorduk. \"Onlardan başka kim olacak?\" buyurdu",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 7321,
			"arabicnumber": 7321,
			"text": "",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 7322,
			"arabicnumber": 7322,
			"text": "",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 7323,
			"arabicnumber": 7323,
			"text": "Abdullah İbn Abbâs radıyallahü anhüma tahdîs edip şöyle demiştir: ibnu'l-Hattâb (radıyallahü anh) 23 yılında son haccını yaptığı zaman ben Minâ'da Abdurrahmân ibn Avf'ın yanında birtakım kimselere Kur'ân okutuyordum. Abdurrahmân ibn Avf bana şöyle dedi: Bugün ben Omer'in yanında idim. Eğer sen de Emîru'l-Mü'rninîn'ûı yanında hazır bulunsaydın (elbette acâib birşeye şâhid olurdun)! Onun yanına bir adam geldi: Ey Mü’minlerin Emîri, haberin olsun; Fulân kimse: \"Eğer Mü'minlerin Emîri Omer ölürse, ben elbette Fulân kimseye bey'at ederim!\" diyordu, dedi. üzerine Omer: Vallahi bu akşam halkın karşısına dikilip bir hutbe yapacağım da milletin mukadderatını gasbetmek isteyen bu adamları ortaya koyarak, bunların tesvîlâtından halkı sakındıracağım! dedi. Ey Mü’minlerin Emîri, böyle yapma! Çünkü bu hacc mevsimi sırasında insanların câhilleri ve rezîlleri toplanırlar ve senin meclisin üzerine gâlib olurlar. Ben onların senin konuşmanı yerli yerine koyamıyacaklarından ve onu, her nakledip taşıyıcının sür'atle ve düşüncesizce bir yerlere uçuracağından (ve bir ihtilâle sebeb olacağından) korkarım. Onun için sen sabret, nihayet Medine'ye, hicret yurdu ve sünnet yurdu olan Medine'ye var ve orada Muhacir ve Ensâr'dan olan Rasûlüllah'ın sahâbîleri ile buluşur toplanırsın. Onlar senin konuşmanı iyi muhafaza ederler ve onu gerekli yerine indirirler, dedim. üzerine Omer: Vallahi Medine'de ilk duracağım makaamda elbette dikilip bu konuşmayı yapacağım! dedi. Abbâs rivayetine devamla şöyle dedi: Medine'ye geldiğimizde (cumua günü güneş meyledince Omer geldi, minbere oturdu, müezzin susunca ayağa kalktı, Allah'a hamd ve senadan sonra) şöyle dedi: Şübhesiz Allah, Muhammed'i hakk peygamber olarak gönderdi ve O'na Kitâb'ı indirdi. O'na indirilen şeyler içinde Recm Âyeti de vardı",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 7324,
			"arabicnumber": 7324,
			"text": "Bize Hammâd ibn Zeyd, Eyyûb'dan tahdîs etti ki, Muhammed ibn Sîrîn şöyle demiştir: Biz Ebû Hureyre (radıyallahü anh)’nin yanında idik. Ebû Hureyre'nin üzerinde mışk denilen kırmızı çamur boyasıyle boyanmış ketenden iki elbise vardı. Bu sırada sümkürdü de: Bah bah! Ebû Hureyre keten elbise içinde sümkürüyor! Yemîn olsun bir vakitler ben kendimi şu hâlde görmüşümdür: Ben Rasûlüllah(sallallahü aleyhi ve sellem)'ın minberi ile Âişe'nin hücresi arasında bayılmış olarak yere düşerdim de biri gelir, ayağını boynum üzerine kor ve beni deli olmuş zannederdi; Halbuki bende hiçbir delilik yoktu, bende açlıktan başka birşey yoktu, dedi",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 7325,
			"arabicnumber": 7325,
			"text": "BizeSufyân es-Sevrî haber verdi ki, Abdurrahmân ibn Abis şöyle demiştir: İbn Abbâs radıyallahü anhüma'a: Sen Peygamber'in beraberinde bayram namazgâhında hazır bulundun mu? diye soruldu. Abbâs şu cevâbı verdi: Evet, bulundum. O'na olan yakınlığım olmasa idi, küçüklüğümden dolayı orada hazır bulunamayacaktım. Peygamber(sallallahü aleyhi ve sellem), Kesîr ibnu's-Salt (ibn Ma'dikerb el-Kindî)’ın evinin hizasındaki sütunun yanına geldi. Orada bayram namazını kıldırdı. Sonra hutbe yaptı. -Ne bir ezan ve ne bir ikaamet zikretti-. Sonra Peygamber(kadınlar tarafına gelip onlara) sadaka vermelerini emretti. Bunun üzerine kadınlar kulaklarına ve boğazlarındaki zînetlerine işaret etmeye başladılar. Peygamber, Bilâl'e emretti de Bilâl kadınların yanına vardı, kadınlar zînetlerini onun elbisesi içine attılar. Sonra Bilâl, Peygamber'in yanına döndü",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 7326,
			"arabicnumber": 7326,
			"text": "Bize Sufyân ibn Uyeyne, Abdullah ibn Dinar'dan; o da İbn Omer (radıyallahü anh) 'den: Peygamber(sallallahü aleyhi ve sellem) Küba'ya bazen yürüyerek, bazen binerek gelir idi, diye tahdîs etti",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 7328,
			"arabicnumber": 7328,
			"text": "",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 7329,
			"arabicnumber": 7329,
			"text": "ibn Şihâb şöyle dedi: Bana Enes ibn Mâlik (radıyallahü anh) şöyle haber verdi: Rasûlüllah (sallallahü aleyhi ve sellem) ikindi namazını kıldırırdı da (namazdan sonra) Avâlî'ye gider ve oraya varırdı da, güneş hâlâ yüksek bulunurdu. ibn Sa'd, Yûnus'tan: Avâlî’nin uzaklığı dört mil yahut üç mildir, dediğini ziyâde etmiştir",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 7330,
			"arabicnumber": 7330,
			"text": "",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 7331,
			"arabicnumber": 7331,
			"text": "",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 7332,
			"arabicnumber": 7332,
			"text": "Bize Mûsâ ibn Ukbe, Nâfi'den; o da İbn Omer (radıyallahü anh) 'den şöyle tahdîs etti: Yahudiler, Peygamber(sallallahü aleyhi ve sellem)'in yanına birbiri ile evli iken zina etmiş bir adamla bir kadın getirdiler. Peygamber o zinâcıların taşlanmalarını emretti de, onlar Mescid'in yanında cenazelerin konulduğu yerin yakınında taşlandılar",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 7333,
			"arabicnumber": 7333,
			"text": "",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 7334,
			"arabicnumber": 7334,
			"text": "",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 7335,
			"arabicnumber": 7335,
			"text": "",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 7336,
			"arabicnumber": 7336,
			"text": "",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 7337,
			"arabicnumber": 7337,
			"text": "",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 7338,
			"arabicnumber": 7338,
			"text": "",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 7339,
			"arabicnumber": 7339,
			"text": "",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 7341,
			"arabicnumber": 7341,
			"text": "",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 7342,
			"arabicnumber": 7342,
			"text": "Bize Bureyd tahdîs etti ki, Ebû Burde şöyle demiştir: Medine'ye geldim. Beni Abdullah ibn Selâm kavuşup karşıladı da bana: Haydi benim evime yürü de sana Resûlüllah’ın içinden su içmiş olduğu bir kadehle su içireyim ve sen de Peygamber'in namaz kıldığı bir mescid içinde namaz kılarsın, dedi. üzerine ben onunla beraber gittim. Evinde bana sevîk içirdi ve hurma yedirdi. Ben de onun mescidinde namaz kıldım",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 7343,
			"arabicnumber": 7343,
			"text": "Bana İkrime, ibn Abbâs'tan tahdîs etti ki, ona da ibn Omer tahdîs edip şöyle demiştir: Bana Peygamber(sallallahü aleyhi ve sellem) tahdîs edip şöyle buyurdu: \"Bu gece bana Rabb'im tarafından bir gelen geldi de, Akîk Vâdîsi'nde iken bana: Bu mübarek vâdîde namaz kıl ve 'Umretun ve haccun' diye söyle! buyurdu\". Hârûn ibn İsmâîl şöyle dedi: Bana Alî ibnu'l-Mubârek kendi rivayetinde \"Umretun fî haccetin (Hacc içinde umre)\" şeklinde tahdîs etti",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 7344,
			"arabicnumber": 7344,
			"text": "Bize Sufyân ibn Uyeyne, Abdullah ibn Dinar'dan; o da İbn Omer'den şöyle tahdîs etti: Peygamber(sallallahü aleyhi ve sellem- Mekke'den iki merhale uzaktaki) Kann mevkiîni Necd ahâlîsi için, (Mekke'den altı merhale uzakta ve Râbığ yakınındaki) el-Cuhfe'yi Şâm ahâlîsi için, (Medîne'den altı mil uzaktaki en uzak mîkaat olan) Zu’l-Huleyfe'yi de Medine ahâlîsi için mîkaat ta'yîn etmiştir. Omer dedi ki: Ben bunu Peygamber'den işittim. Ve bana ulaştı ki, Peygamber, “Yemen ahâlîsi için de Mekke'ye iki merhaledeki Yelem mevkiini mîkaat ta'yîn etmiştir.” Omer'in yanında Irak zikredildi de; İbn Omer: O vakit Irak yoktu (yani o zaman Irak ahâlîsi müslümân değildi), demiştir",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 7345,
			"arabicnumber": 7345,
			"text": "",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 7346,
			"arabicnumber": 7346,
			"text": "",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 7347,
			"arabicnumber": 7347,
			"text": "ez-Zuhrî'den (o, şöyle demiştir): Bana Alî ibnu Hüseyin haber verdi, ona da babası Hüseyin ibn Alî (radıyallahü anh) haber verdi; ona da babası Alî ibn Ebî Tâlib (radıyallahü anh) haber verip şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) bir gece kendisine ve Rasûlüllah'ın kızı Fâtıma aleyha's-selâma ziyaret için geldi de, bu ikisine hitaben: \"Sizler namaz kılmaz mısınız?\" buyurdu. (Bu sorusu ile teheccüd kılmayı teşvik ediyordu.) dedi ki: Ben: Yâ Rasûlallah! Nefislerimiz ancak Allah'ın elindedir. Bizi uyandırmak istediği zaman uyandırır! dedim. O' na bunu söylediği zaman Rasülullah geri döndü ve Alî'ye hiçbir cevâb vermedi. Sonra Rasûlüllah dönüp giderken Alî O' ndan, dizini vurarak: insan ne kadar da çok cidalci oluyor!” (el-Kehf: 54) âyetini söylemekte olduğunu işitmiştir. Abdillah el-Buhârî şöyle dedi: Sana geceleyin gelen \"Târık\"tır. (Işığı ile karanlıkları deldiği için) \"en-Necmu’s-sâkibu\" (et-Târık: 3) denilir. \"et-Târık (Yıldız)”; \"es-Sâkıb (Ziya saçan)\"dır. Ateş yakacak kimseye emir fiili olarak \"Eskıb nârake (Ateşini ziyâlandır)\" denilir",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 7348,
			"arabicnumber": 7348,
			"text": "Ebû Hureyre (radıyallahü anh) şöyle demiştir: Biz mescidde bulunduğumuz sırada Rasûlüllah(sallallahü aleyhi ve sellem) bizim yanımıza çıktı da: \"Haydin Yahûdîler'in yurduna yürüyün!'' buyurdu. O'nun beraberinde yola çıktık, nihayet Yahûdîler'in, içinde âlimlerinin Tevrat okudukları Beytu'l-Mıdrâs'a vardık. Peygamber ayakta dikilip onlara nida ederek: \"Ey Yahudi topluluğu! İslâm Dîni'ne girin ki, selâmette olunuz!\" buyurdu. üzerine Yahudiler: Sen elçiliğini teblîğ ettin yâ Eba'l-Kaasım! dediler (ve O'na itaate yanaşmadılar). dedi ki: Rasûlüllah onlara: \"Ben ancak bunu, yânı 'İslâm'a girin, selâmette olun' tebliğimin gerçekleşmesini istiyorum\" dedi. yine: Sen risâletini teblîğ ettin yâ Eba'l-Kaasım! dediler. Rasûlüllah onlara tekrar: \"Ben ancak bunu; 'İslâm'a girin, selâmette olun' tebliğimin gerçekleşmesini istiyorum\" buyurdu. Rasûlüllah bu sözünü üçüncü defa onlara söyledi de ardından şöyle buyurdu: \"Biliniz ki, Arz ancak Allah'a ve Rasûlü'ne âiddir. Ben sizleri bu arazîden çıkarmak istiyorum. Bunun için sizden her kim kendi malından taşıyamıyacağı birşeyi olursa onu satsın. Yoksa iyi biliniz ki, Arz ancak Allah’a ve Rasûlü'ne âiddir”",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 7349,
			"arabicnumber": 7349,
			"text": "",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 7351,
			"arabicnumber": 7351,
			"text": "",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 7352,
			"arabicnumber": 7352,
			"text": "",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 7353,
			"arabicnumber": 7353,
			"text": "",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 7354,
			"arabicnumber": 7354,
			"text": "ez-Zuhrî tahdîs etti ki, kendisi el-A'rec'den şöyle derken işitmiştir: Bana Ebû Hureyre (radıyallahü anh) haber verip şöyle dedi: Sizler: \"Ebû Hureyre, Rasûlüllah üzerine çok hadîs rivayet ediyor\" diye iddia ediyorsunuz. Allah mev'ıddır -yani kıyâmet günü sizin inkârda yahut benim çoğaltmakta hakk üzere olduğum meydana çıkacaktır-. Ben Suffa ehlinin miskinlerinden fakır bir kimse idim. Karnımın doyması karşılığında Rasûlüllah'tan hiç ayrılmazdım. Muhacirler çarşılarda alışveriş etmekle meşgul bulunurlar, Ensâr da malları, toprakları üzerindeki işlerinde çalışmalarıyle meşgul bulunurlardı. Ben bir gün Rasûlüllah'tan şuna şâhid oldum. Rasûlüllah: \"Her kim ben sözümü bitirinceye kadar ridâsını yayar, sonra onu yumarsa, benden işitmiş olduğu hiçbir şeyi asla unutmayacaktır” buyurdu. üzerine ben üzerimde bulunan bir bürdeyi yaydım. Rasûlüllah'ı hakk ile gönderen Allah adına yemîn ediyorum ki, bundan sonra ben kendisinden işittiğim hiçbir şeyi unutmadım",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 7355,
			"arabicnumber": 7355,
			"text": "",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 7356,
			"arabicnumber": 7356,
			"text": "",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 7357,
			"arabicnumber": 7357,
			"text": "Bize Sufyân ibn Uyeyne, Mansûr ibn Safiyye'den; o da annesi Safiyye bintu Şeybe ibn Usmân ibn Ebî Talha'dan; o da Âişe (r.anha)'den tahdîs etti ki, bir kadın, Peygamber (sallallahü aleyhi ve sellem)'e suâl sormuştur. Mansûr ibn Abdirrahmân ibn Şeybe tahdîs etti. Bana annem Safiyye bintu Şeybe, Âişe (r.anha)'den şöyle tahdîs etti: Bir kadın Peygamber(sallallahü aleyhi ve sellem)'e hayızdan sonra nasıl yıkanacağını sordu. Peygamber de (nasıl yıkanacağını ta'rîf etti de sonra) ona: \"Miske bulanmış pamuklu parçası alırsın ve onunla yıkanır temizlenirsin\" buyurdu. Onunla nasıl temizlenip abdest alayım yâ Rasûlallah? diye tekrar sorunca, Peygamber: \" (Subhânallah!) Temizlen işte!\" buyurdu. üzerine ben Rasûlüllah'ın kasdetmekte olduğu şeyi anladım da kadını tutup kendime doğru çektim ve ona öğrettim, dedi",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 7358,
			"arabicnumber": 7358,
			"text": "Bize Ebû Avâne, Ebû Bişr'den; o da Saîd ibn Cubeyr’den; o da İbn Abbâs radıyallahü anhüma’tan şöyle tahdîs etti: Ümmü Hafîd bintu'l-Hâris ibn Hazn -ki İbn Abbâs'in teyzesidir- bir kerre Peygamber(sallallahü aleyhi ve sellem)'e bir mikdâr tereyağı, keş ve birkaç tane keler hediye etmişti. Peygamber onların getirilmesini istedi de onun sofrası üzerinde bunlar yenildi. FakatPeygamber(yağ ile keşten yedi de) kelerleri tiksinmiş gibi bıraktı. Eğer kelerler haram olsaydı, Peygamber'in sofrası üzerinde yenilmezdi ve Peygamber onların yenilmesini emretmezdi, demiştir",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 7359,
			"arabicnumber": 7359,
			"text": "Bize ibnu Vehb, tahdîs etti. Bana Yünus,Ibn Şihâb'dan haber verdi. Bana Atâ ibn Ebî Rebâh haber verdi ki, Câbir ibn Abdillah (radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem): \"Her kim sarmısak, soğan yemiş bulunursa bizden -yahut: Mescidimizden- uzak durup evinde otursun\" buyurdu. aynı sened ile rivayet etti:-Peygamber'in huzuruna, içinde taze sebzeler bulunan yuvarlak bir kap getirildi. -Abdullah ibn Vehb: \"Bedr\" sözü ile tabak kasdediyor, dedi.- Rasûlüllah onda sevilmeyen bir koku duydu. O tabağın içinde ne olduğunu sordu. Kendisine onun içindeki sebzelerin ne olduğu haber verildi. Bunun üzerine sahâbîlerine: \"Bunu (fulân kimseye) götürünüz!\" buyurdu. da bu tencereyi yanında bulunan bir sahâbîye götürdüler. O sahâbî de Peygamber'in böyle yaptığını görünce onu yemek istemedi. Bunun üzerine: \"Sen bundan ye! Çünkü ben senin münâcât etmediklerinle münâcât ederim\" buyurdu. Ufeyr, İbnu Vehb'den: \"İçinde yeşil sebzeler bulunan bir tencere\" şeklinde söyledi. ibn Sa'd ile Ebû Safvân, Yûnus'tan \"el-Kıdr\" kıssasını zikretmediler. Ben bunun ez-Zuhrî'nin kavlinden mi, yahut bu hadîsin lafzından olarak mı rivayet edildiğini bilmiyorum",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 7360,
			"arabicnumber": 7360,
			"text": "İbrâhîm ibn Sa'd şöyle demiştir: Bana Muhammed ibn Cubeyr haber verdi: Ona da babası Cubeyr ibn Mut'ım (radıyallahü anh) şöyle haber vermiştir: Ensâr'dan bir kadın Rasûlüllah(sallallahü aleyhi ve sellem)'a geldi de O'nunla (vereceği) birşey hakkında konuşmuştu. Rasûlüllah da o kadına (dönerken) birşey emretmişti. Bunun üzerine kadın: Yâ Rasûlallah! Ben gelir de Seni bulamazsam ne dersin? dedi. Rasûlüllah: \"Şayet beni bulamazsan Ebû Bekr'e git\" buyurdu. İbrahim ibn Sa'd'dan rivayetinde: Kadın \"Eğer Seni bulamazsam\" sözüyle, Rasûlüllah'ın ölümünü kasdeder gibiydi, fıkrasını ziyâde etmiştir",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 7361,
			"arabicnumber": 7361,
			"text": "Ve Ebû'l-Yemân şöyle dedi: Bize Şuayb haber verdi ki, ez-Zuhrî şöyle demiştir: Bana Humeyd ibn Abdirrahmân haber verdi; kendisi Muâviye'den işitmiştir. Muâviye, halifeliğinde hacc ettiği zaman Medine'de tahdîs ediyordu. Ve bu arada zikretti de şöyle dedi: bu Ka'b, Kitâb ehlinden İslâm'a girip de eski kitâblardan hadîs tahdîs etmekte olan bu muhaddislerin en doğru söyleyenidir. Yine muhakkak ki, bununla beraber biz onun eski kitâblardan nakletmekte olduğu haberlerinde, Ka’bın bazen hatâ edip yalan yanlış şeyler söylemekte olduğunu da Ka'b aleyhine tecrübe etmekteyizdir",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 7362,
			"arabicnumber": 7362,
			"text": "Ebû Hureyre (radıyallahü anh) şöyle demiştir: Ehli kitâb (olan Yahûdîler) Tevrat'ı İbrânîce metni ile okurlar, Arab diliyle de onu müslümânlara tefsîr ederlerdi. Bu husustaRasûlüllah(sallallahü aleyhi ve sellem) sahâbîlerine: \"Siz kitâb ehlinin sözlerini tasdik de, tekzîb de etmeyin. Ancak ‘Şöyle deyin: Biz Allah ya, bize indirilene, İbrâhîm’e, İsmâîl’e, İshâk’a, Ya'kûb'a ve torunlarına indirilenlere; Mûsâ 'ya, Îsâ 'ya verilenlere ve bütün peygamberlere Rabb’leri katından verilenlere imân ettik. Onlardan hiçbirini diğerinden ayırdetmeyiz. Biz Allah'a teslim olmuşlarız!’\"(el-Bakara: 136)",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 7363,
			"arabicnumber": 7363,
			"text": "Abdullah İbn Abbâs radıyallahü anhüma şöyle demiştir: Sizler kitâb ehli olanlara şerîatten herhangi birşeyi nasıl soruyorsunuz? Halbuki Rasûlüllah (sallallahü aleyhi ve sellem) üzerine indirilmiş olan Kitâb'ınız, kitâbların en yenisidir. Sizler onu hâlis olarak ve içine başka hiçbirşey karışmamış olduğu hâlde okumaktasınız. Bu Kur'ân sizlere, ehli kitâb olanların Allah'ın kitabını tebdil edip değiştirdiklerini ve Kitâb'ı kendi elleriyle yazdıklarını ve bununla az bir bahâyı satın almaları için \"Bu Allah katındandır\" dediklerini sizlere söylemiştir. edin! Size gelmiş olan ilim, sizleri onlara suâl sormaktan nehyetmektedir. Vallahi biz onlardan hiçbir kimseyi size indirilmiş olan kitâbdan size suâl sorar görmüş değiliz",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 7364,
			"arabicnumber": 7364,
			"text": "Cundeb ibn Abdillah el-Becelî (radıyallahü anh) şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem): \"Kur'ân üzerinde kalbleriniz ülfet edip birleştiği müddetçe Kur'ân'ı okuyunuz. Kur'ân üzerinde ihtilâf ettiğiniz zaman da artık kalkıp ondan dağılınız\" buyurdu. Abdillah el-Buhârî: Râvî Abdurrahmân ibn Mehdî, bu hadîsi Sellâm ibn Ebî Mutî'den işitmiştir, dedi",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 7365,
			"arabicnumber": 7365,
			"text": "Bize Ebû İmrân el-Cevnî, Cundeb ibn Abdillah (radıyallahü anh)'tan tahdîs etti ki, Rasûlüllah (sallallahü aleyhi ve sellem): \"Kur'ân üzerinde kalbleriniz birleştiği müddetçe Kur'ân okuyunuz. Kur'ân hakkında ihtilâf ettiğiniz zaman da artık kalkınız\" buyurmuştur",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 7366,
			"arabicnumber": 7366,
			"text": "",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 7367,
			"arabicnumber": 7367,
			"text": "Bize ibn Cureyc tahdîs edip şöyle dedi: Bana Atâ ibn Ebî Rebâh haber verip şöyle dedi: Ben yanında bulunan birçok insanlar içinde iken Câbir ibn Abdillah (radıyallahü anh)'tan şöyle dediğini işittim: Biz Rasûlüllah(sallallahü aleyhi ve sellem)'ın sahâbîleri yalnız ve hâlis olarak, beraberinde umre olmayarak hacc niyetiyle ihrama girdik. dedi ki: Câbir şöyle dedi: Peygamber, zu’l-hiccenin dördüncü sabahında (Mekke'ye) geldi. Biz de oraya geldiğimiz zaman, Peygamber bizlere ihramdan çıkmamızı emretti ve: \"İhramlarınızdan çıkınız ve kadınlarınızdan da nasîbleniniz\" buyurdu. dedi ki: Câbir şöyle dedi: Fakat Peygamber onlara kadınlarla cinsî münâsebet etmeleri hususunda kesin emir vermedi. Lâkin kadınları erkekler için halâl kıldı. \"Bizimle arafe günü arasında ancak beş gün kaldığı hâlde kadınlarımızla cinsî münâsebet yapmamızı ve neticede zekerlerimiz menî damlatarak Arafat'a çıkmamızı emrediyor!\" diye söylendiğimiz Peygambere ulaştı. \"Câbir işaret eder ve elini hareket ettirip şöyle diye gösterirdi\" demiştir. üzerine Rasûlüllah ayağa kalktı da şöyle buyurdu: \"Kat'î olarak biliniz ki, ben sizin Allah'a en takvâlınız, en sâdıkınız, en itâatlinizim. Eğer yanımda kurbânım olmasaydı sizin ihramdan çıkışınız gibi, ben de muhakkak ihramdan çıkacaktım. Hacc aylarında umrenin cevazı şimdi olduğu gibi ihrama girerken de bana zahir olsaydı, ben beraberimde kurban sevketmezdim. Onun için artık sizler ihramdan çıkınız!\" buyurdu. üzerine bizler ihramdan çıkıpPeygamber'i dinledik ve itaat ettik",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 7368,
			"arabicnumber": 7368,
			"text": "Bana Abdullah ibnu'u Muğaffel el-Muzenî(radıyallahü anh) tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem):\"Akşam namazından önce (de iki rek'at) namaz kılınız\" buyurdu. defasında insanların bunu terkedilmez bir yol edinmelerini istemeyerek: \"Bu, isteyen içindir\" buyurdu",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 7369,
			"arabicnumber": 7369,
			"text": "İbn Şihâb'dan (şöyle demiştir): Bana Urve, İbnu'l-Müseyyeb, Alkame ibn Vakkaas ve Ubeydullah, Âişe (r.anha)'den tahdîs ettiler, Âişe, iftira ehlinin kendisi hakkında dediklerini dedikleri zaman şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) o sabah Alî ibn Ebî Tâlib ile Usâme ibn Zeyd'i yanına çağırdı. Vahy gecikince ehli ile ayrılması hususunda onlara görüşlerini sorup istişare ediyordu. Usâme Ehli Beyt için nefsinde bilip gönlünde beslediği muhabbeti ve ehlinin berâetiniRasûlüllah'a tavsiye ve işaret etti. ibn Ebî Tâlib'e gelince, o: Yâ Rasûlallah, Allah Sana dünyâyı dâr etmemiştir. Âişe'den başka kadın çoktur. Bununla beraber Âişe'nin cariyesi Berîre'ye de sor. O doğrusunu Sana söyler, demişti. üzerine Rasûlüllah, Berîre'yi çağırıp: \"Ey Berire, Âişe'de sana şübhe veren herhangibir hâl gördün mü?\" diye sordu. de: Hayır yâ Rasûlallah, görmedim. Ben ondan hatâ, ayıp olarak meydana gelmiş şundan büyük bir iş görmedim: Âişe küçük yaşta taze bir kadındı. Hamur yoğururken uyur kalırdı da evin besi koyunu gelir hamuru yerdi! demiş. üzerine Rasûlüllah o günü minber üstünde durup şöyle buyurdu: \"Ey müslümânlar topluluğu! Ehlim hakkında bana ezası ulaşan bir adamdan dolayı bana kim yardım eder de benim o kimseyi kınamamı haklı görür? Vallahi ben ehlim hakkında hayırdan başka birşey bilmiş değilim” dedi ve Âişe'nin berâetini zikretti... Ebû Usâme Hammâd ibn Usâme, Hişâm ibn Urve'den bu hadîsi rivayet etti H",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 7370,
			"arabicnumber": 7370,
			"text": "Bize Yahya ibn Ebî Zekeriyyâ el-Gassânî, Hişâm'dan; o da babası Ur ve'den; o da Âişe (r.anha)'den şöyle tahdîs etti: Rasûlüllah (sallallahü aleyhi ve sellem) insanlara bir hutbe yaptı, Allah'a hamd ve sena eyledi de: \"Kendileri üzerine asla bir kötülük bilmediğim ehlime sövmekte olan bir topluluk hakkında bana ne işaret edersiniz?”dedi... Urve ibnu'z-Zübeyr'den: O şöyle demiştir: Âişe'ye iftira ehlinin söylediği iş haber verilince, Âişe: Yâ Rasûlallah! Ebeveynimin evine gitmek üzere bana izin verir misin? dedi. da kendisine izin verdi ve Âişe'nin beraberinde hizmetçi bir köleyi de gönderdi. Bu sırada Ensâr'dan bir zât (İbn İshâk ve Hâkim'de Ebû Eyyûb Hâlid, bunu söyleyenlerden taaccüb ederek): Subhâneke! Seni tenzîh ederiz! Bu iftirayı konuşmak bizlere yakışmaz. Seni tenzîh ederiz! Bu büyük bir iftiradır! Dedi",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 97
			}
		}
	]
}