{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"10": "The Book on Jana''iz (Funerals)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1016,
			"arabicnumber": 1016,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو صَفْوَانَ، عَنْ أُسَامَةَ بْنِ زَيْدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ أَتَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى حَمْزَةَ يَوْمَ أُحُدٍ فَوَقَفَ عَلَيْهِ فَرَآهُ قَدْ مُثِّلَ بِهِ فَقَالَ ‏\"‏ لَوْلاَ أَنْ تَجِدَ صَفِيَّةُ فِي نَفْسِهَا لَتَرَكْتُهُ حَتَّى تَأْكُلَهُ الْعَافِيَةُ حَتَّى يُحْشَرَ يَوْمَ الْقِيَامَةِ مِنْ بُطُونِهَا ‏\"‏ ‏.‏ قَالَ ثُمَّ دَعَا بِنَمِرَةٍ فَكَفَّنَهُ فِيهَا فَكَانَتْ إِذَا مُدَّتْ عَلَى رَأْسِهِ بَدَتْ رِجْلاَهُ وَإِذَا مُدَّتْ عَلَى رِجْلَيْهِ بَدَا رَأْسُهُ ‏.‏ قَالَ فَكَثُرَ الْقَتْلَى وَقَلَّتِ الثِّيَابُ ‏.‏ قَالَ فَكُفِّنَ الرَّجُلُ وَالرَّجُلاَنِ وَالثَّلاَثَةُ فِي الثَّوْبِ الْوَاحِدِ ثُمَّ يُدْفَنُونَ فِي قَبْرٍ وَاحِدٍ فَجَعَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَسْأَلُ عَنْهُمْ ‏\"‏ أَيُّهُمْ أَكْثَرُ قُرْآنًا ‏\"‏ ‏.‏ فَيُقَدِّمُهُ إِلَى الْقِبْلَةِ ‏.‏ قَالَ فَدَفَنَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم وَلَمْ يُصَلِّ عَلَيْهِمْ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أَنَسٍ حَدِيثٌ حَسَنٌ غَرِيبٌ لاَ نَعْرِفُهُ مِنْ حَدِيثِ أَنَسٍ إِلاَّ مِنْ هَذَا الْوَجْهِ ‏.‏ النَّمِرَةُ الْكِسَاءُ الْخَلَقُ ‏.‏ وَقَدْ خُولِفَ أُسَامَةُ بْنُ زَيْدٍ فِي رِوَايَةِ هَذَا الْحَدِيثِ فَرَوَى اللَّيْثُ بْنُ سَعْدٍ عَنِ ابْنِ شِهَابٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبِ بْنِ مَالِكٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ‏.‏ وَرَوَى مَعْمَرٌ عَنِ الزُّهْرِيِّ عَنْ عَبْدِ اللَّهِ بْنِ ثَعْلَبَةَ عَنْ جَابِرٍ ‏.‏ وَلاَ نَعْلَمُ أَحَدًا ذَكَرَهُ عَنِ الزُّهْرِيِّ عَنْ أَنَسٍ إِلاَّ أُسَامَةَ بْنَ زَيْدٍ ‏.‏ وَسَأَلْتُ مُحَمَّدًا عَنْ هَذَا الْحَدِيثِ فَقَالَ حَدِيثُ اللَّيْثِ عَنِ ابْنِ شِهَابٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبِ بْنِ مَالِكٍ عَنْ جَابِرٍ أَصَحُّ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 52
			}
		}
	]
}