{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"10": "The Book on Jana''iz (Funerals)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1024,
			"arabicnumber": 1024,
			"text": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، أَخْبَرَنَا هِقْلُ بْنُ زِيَادٍ، حَدَّثَنَا الأَوْزَاعِيُّ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، حَدَّثَنِي أَبُو إِبْرَاهِيمَ الأَشْهَلِيُّ، عَنْ أَبِيهِ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا صَلَّى عَلَى الْجَنَازَةِ قَالَ ‏\"‏ اللَّهُمَّ اغْفِرْ لِحَيِّنَا وَمَيِّتِنَا وَشَاهِدِنَا وَغَائِبِنَا وَصَغِيرِنَا وَكَبِيرِنَا وَذَكَرِنَا وَأُنْثَانَا ‏\"‏ ‏.‏ قَالَ يَحْيَى وَحَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلَ ذَلِكَ وَزَادَ فِيهِ ‏\"‏ اللَّهُمَّ مَنْ أَحْيَيْتَهُ مِنَّا فَأَحْيِهِ عَلَى الإِسْلاَمِ وَمَنْ تَوَفَّيْتَهُ مِنَّا فَتَوَفَّهُ عَلَى الإِيمَانِ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ وَعَائِشَةَ وَأَبِي قَتَادَةَ وَعَوْفِ بْنِ مَالِكٍ وَجَابِرٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ وَالِدِ أَبِي إِبْرَاهِيمَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَرَوَى هِشَامٌ الدَّسْتَوَائِيُّ وَعَلِيُّ بْنُ الْمُبَارَكِ هَذَا الْحَدِيثَ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنِ النَّبِيِّ صلى الله عليه وسلم مُرْسَلاً ‏.‏ وَرَوَى عِكْرِمَةُ بْنُ عَمَّارٍ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ عَنْ عَائِشَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ وَحَدِيثُ عِكْرِمَةَ بْنِ عَمَّارٍ غَيْرُ مَحْفُوظٍ وَعِكْرِمَةُ رُبَّمَا يَهِمُ فِي حَدِيثِ يَحْيَى ‏.‏ وَرُوِيَ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ عَنْ أَبِيهِ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ قَالَ أَبُو عِيسَى وَسَمِعْتُ مُحَمَّدًا يَقُولُ أَصَحُّ الرِّوَايَاتِ فِي هَذَا حَدِيثُ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي إِبْرَاهِيمَ الأَشْهَلِيِّ عَنْ أَبِيهِ ‏.‏ وَسَأَلْتُهُ عَنِ اسْمِ أَبِي إِبْرَاهِيمَ فَلَمْ يَعْرِفْهُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 60
			}
		}
	]
}