{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"11": "The Book on Marriage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1114,
			"arabicnumber": 1114,
			"text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلاَّلُ، حَدَّثَنَا إِسْحَاقُ بْنُ عِيسَى، وَعَبْدُ اللَّهِ بْنُ نَافِعٍ الصَّائِغُ، قَالاَ أَخْبَرَنَا مَالِكُ بْنُ أَنَسٍ، عَنْ أَبِي حَازِمِ بْنِ دِينَارٍ، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم جَاءَتْهُ امْرَأَةٌ فَقَالَتْ إِنِّي وَهَبْتُ نَفْسِي لَكَ ‏.‏ فَقَامَتْ طَوِيلاً فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ فَزَوِّجْنِيهَا إِنْ لَمْ تَكُنْ لَكَ بِهَا حَاجَةٌ ‏.‏ فَقَالَ ‏\"‏ هَلْ عِنْدَكَ مِنْ شَيْءٍ تُصْدِقُهَا ‏\"‏ ‏.‏ فَقَالَ مَا عِنْدِي إِلاَّ إِزَارِي هَذَا ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِزَارَكَ إِنْ أَعْطَيْتَهَا جَلَسْتَ وَلاَ إِزَارَ لَكَ فَالْتَمِسْ شَيْئًا ‏\"‏ قَالَ مَا أَجِدُ ‏.‏ قَالَ ‏\"‏ فَالْتَمِسْ وَلَوْ خَاتَمًا مِنْ حَدِيدٍ ‏\"‏ ‏.‏ قَالَ فَالْتَمَسَ فَلَمْ يَجِدْ شَيْئًا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَلْ مَعَكَ مِنَ الْقُرْآنِ شَيْءٌ ‏\"‏ ‏.‏ قَالَ نَعَمْ سُورَةُ كَذَا وَسُورَةُ كَذَا ‏.‏ لِسُوَرٍ سَمَّاهَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ زَوَّجْتُكَهَا بِمَا مَعَكَ مِنَ الْقُرْآنِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَقَدْ ذَهَبَ الشَّافِعِيُّ إِلَى هَذَا الْحَدِيثِ فَقَالَ إِنْ لَمْ يَكُنْ لَهُ شَيْءٌ يُصْدِقُهَا وَتَزَوَّجَهَا عَلَى سُورَةٍ مِنَ الْقُرْآنِ فَالنِّكَاحُ جَائِزٌ وَيُعَلِّمُهَا سُورَةً مِنَ الْقُرْآنِ ‏.‏ وَقَالَ بَعْضُ أَهْلِ الْعِلْمِ النِّكَاحُ جَائِزٌ وَيَجْعَلُ لَهَا صَدَاقَ مِثْلِهَا ‏.‏ وَهُوَ قَوْلُ أَهْلِ الْكُوفَةِ وَأَحْمَدَ وَإِسْحَاقَ",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1114.2,
			"arabicnumber": 1114.2,
			"text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أَيُّوبَ، عَنِ ابْنِ سِيرِينَ، عَنْ أَبِي الْعَجْفَاءِ السُّلَمِيِّ، قَالَ قَالَ عُمَرُ بْنُ الْخَطَّابِ أَلاَ لاَ تُغَالُوا صَدُقَةَ النِّسَاءِ فَإِنَّهَا لَوْ كَانَتْ مَكْرُمَةً فِي الدُّنْيَا أَوْ تَقْوَى عِنْدَ اللَّهِ لَكَانَ أَوْلاَكُمْ بِهَا نَبِيُّ اللَّهِ صلى الله عليه وسلم مَا عَلِمْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم نَكَحَ شَيْئًا مِنْ نِسَائِهِ وَلاَ أَنْكَحَ شَيْئًا مِنْ بَنَاتِهِ عَلَى أَكْثَرَ مِنْ ثِنْتَىْ عَشْرَةَ أُوقِيَّةً ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَأَبُو الْعَجْفَاءِ السُّلَمِيُّ اسْمُهُ هَرَمٌ ‏.‏ وَالأُوقِيَّةُ عِنْدَ أَهْلِ الْعِلْمِ أَرْبَعُونَ دِرْهَمًا وَثِنْتَا عَشْرَةَ أُوقِيَّةً أَرْبَعُمِائَةٍ وَثَمَانُونَ دِرْهَمًا ‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}