{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"11": "The Book on Marriage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1135,
			"arabicnumber": 1135,
			"text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، حَدَّثَنَا أَبُو دَاوُدَ، قَالَ أَنْبَأَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي أَبُو بَكْرِ بْنُ أَبِي الْجَهْمِ، قَالَ دَخَلْتُ أَنَا وَأَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ عَلَى فَاطِمَةَ بِنْتِ قَيْسٍ فَحَدَّثَتْنَا أَنَّ زَوْجَهَا طَلَّقَهَا ثَلاَثًا وَلَمْ يَجْعَلْ لَهَا سُكْنَى وَلاَ نَفَقَةً ‏.‏ قَالَتْ وَوَضَعَ لِي عَشَرَةَ أَقْفِزَةٍ عِنْدَ ابْنِ عَمٍّ لَهُ خَمْسَةً شَعِيرًا وَخَمْسَةً بُرًّا ‏.‏ قَالَتْ فَأَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَذَكَرْتُ ذَلِكَ لَهُ ‏.‏ قَالَتْ فَقَالَ ‏\"‏ صَدَقَ ‏\"‏ ‏.‏ قَالَتْ فَأَمَرَنِي أَنْ أَعْتَدَّ فِي بَيْتِ أُمِّ شَرِيكٍ ثُمَّ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ بَيْتَ أُمِّ شَرِيكٍ بَيْتٌ يَغْشَاهُ الْمُهَاجِرُونَ وَلَكِنِ اعْتَدِّي فِي بَيْتِ ابْنِ أُمِّ مَكْتُومٍ فَعَسَى أَنْ تُلْقِي ثِيَابَكِ فَلاَ يَرَاكِ فَإِذَا انْقَضَتْ عِدَّتُكِ فَجَاءَ أَحَدٌ يَخْطُبُكِ فَآذِنِينِي ‏\"‏ ‏.‏ فَلَمَّا انْقَضَتْ عِدَّتِي خَطَبَنِي أَبُو جَهْمٍ وَمُعَاوِيَةُ ‏.‏ قَالَتْ فَأَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَذَكَرْتُ ذَلِكَ لَهُ فَقَالَ ‏\"‏ أَمَّا مُعَاوِيَةُ فَرَجُلٌ لاَ مَالَ لَهُ وَأَمَّا أَبُو جَهْمٍ فَرَجُلٌ شَدِيدٌ عَلَى النِّسَاءِ ‏\"‏ ‏.‏ قَالَتْ فَخَطَبَنِي أُسَامَةُ بْنُ زَيْدٍ فَتَزَوَّجَنِي فَبَارَكَ اللَّهُ لِي فِي أُسَامَةَ ‏.‏ هَذَا حَدِيثٌ صَحِيحٌ ‏.‏ وَقَدْ رَوَاهُ سُفْيَانُ الثَّوْرِيُّ عَنْ أَبِي بَكْرِ بْنِ أَبِي الْجَهْمِ، نَحْوَ هَذَا الْحَدِيثِ وَزَادَ فِيهِ فَقَالَ لِيَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ انْكِحِي أُسَامَةَ ‏\"‏ ‏.‏ حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ أَبِي بَكْرِ بْنِ أَبِي الْجَهْمِ بِهَذَا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 57
			}
		}
	]
}