{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"13": "The Book on Divorce and Li'an"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1185,
			"arabicnumber": 1185,
			"text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، أَنْبَأَنَا الْفَضْلُ بْنُ مُوسَى، عَنْ سُفْيَانَ، أَنْبَأَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ، وَهُوَ مَوْلَى آلِ طَلْحَةَ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنِ الرُّبَيِّعِ بِنْتِ مُعَوِّذِ بْنِ عَفْرَاءَ، أَنَّهَا اخْتَلَعَتْ عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم فَأَمَرَهَا النَّبِيُّ صلى الله عليه وسلم - أَوْ أُمِرَتْ - أَنْ تَعْتَدَّ بِحَيْضَةٍ ‏.‏ قَالَ وَفِي الْبَابِ عَنِ ابْنِ عَبَّاسٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ الرُّبَيِّعِ الصَّحِيحُ أَنَّهَا أُمِرَتْ أَنْ تَعْتَدَّ بِحَيْضَةٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1185.2,
			"arabicnumber": 1185.2,
			"text": "أَنْبَأَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ الْبَغْدَادِيُّ، أَنْبَأَنَا عَلِيُّ بْنُ بَحْرٍ، أَنْبَأَنَا هِشَامُ بْنُ يُوسُفَ، عَنْ مَعْمَرٍ، عَنْ عَمْرِو بْنِ مُسْلِمٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ امْرَأَةَ، ثَابِتِ بْنِ قَيْسٍ اخْتَلَعَتْ مِنْ زَوْجِهَا عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم فَأَمَرَهَا النَّبِيُّ صلى الله عليه وسلم أَنْ تَعْتَدَّ بِحَيْضَةٍ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ ‏.‏ وَاخْتَلَفَ أَهْلُ الْعِلْمِ فِي عِدَّةِ الْمُخْتَلِعَةِ فَقَالَ أَكْثَرُ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمْ إِنَّ عِدَّةَ الْمُخْتَلِعَةِ عِدَّةُ الْمُطَلَّقَةِ ثَلاَثُ حِيَضٍ ‏.‏ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَأَهْلِ الْكُوفَةِ وَبِهِ يَقُولُ أَحْمَدُ وَإِسْحَاقُ ‏.‏ وَقَالَ بَعْضُ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمْ إِنَّ عِدَّةَ الْمُخْتَلِعَةِ حَيْضَةٌ ‏.‏ قَالَ إِسْحَاقُ وَإِنْ ذَهَبَ ذَاهِبٌ إِلَى هَذَا فَهُوَ مَذْهَبٌ قَوِيٌّ ‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}