{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"13": "The Book on Divorce and Li'an"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1204,
			"arabicnumber": 1204,
			"text": "حَدَّثَنَا الأَنْصَارِيُّ، أَنْبَأَنَا مَعْنٌ، أَنْبَأَنَا مَالِكٌ، عَنْ سَعْدِ بْنِ إِسْحَاقَ بْنِ كَعْبِ بْنِ عُجْرَةَ، عَنْ عَمَّتِهِ، زَيْنَبَ بِنْتِ كَعْبِ بْنِ عُجْرَةَ أَنَّ الْفُرَيْعَةَ بِنْتَ مَالِكِ بْنِ سِنَانٍ، وَهِيَ أُخْتُ أَبِي سَعِيدٍ الْخُدْرِيِّ أَخْبَرَتْهَا أَنَّهَا، جَاءَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم تَسْأَلُهُ أَنْ تَرْجِعَ إِلَى أَهْلِهَا فِي بَنِي خُدْرَةَ وَأَنَّ زَوْجَهَا خَرَجَ فِي طَلَبِ أَعْبُدٍ لَهُ أَبَقُوا حَتَّى إِذَا كَانَ بِطَرَفِ الْقَدُومِ لَحِقَهُمْ فَقَتَلُوهُ ‏.‏ قَالَتْ فَسَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم أَنْ أَرْجِعَ إِلَى أَهْلِي فَإِنَّ زَوْجِي لَمْ يَتْرُكْ لِي مَسْكَنًا يَمْلِكُهُ وَلاَ نَفَقَةً ‏.‏ قَالَتْ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ نَعَمْ ‏\"‏ ‏.‏ قَالَتْ فَانْصَرَفْتُ حَتَّى إِذَا كُنْتُ فِي الْحُجْرَةِ أَوْ فِي الْمَسْجِدِ نَادَانِي رَسُولُ اللَّهِ صلى الله عليه وسلم أَوْ أَمَرَ بِي فَنُودِيتُ لَهُ فَقَالَ ‏\"‏ كَيْفَ قُلْتِ ‏\"‏ ‏.‏ قَالَتْ فَرَدَدْتُ عَلَيْهِ الْقِصَّةَ الَّتِي ذَكَرْتُ لَهُ مِنْ شَأْنِ زَوْجِي قَالَ ‏\"‏ امْكُثِي فِي بَيْتِكِ حَتَّى يَبْلُغَ الْكِتَابُ أَجَلَهُ ‏\"‏ ‏.‏ قَالَتْ فَاعْتَدَدْتُ فِيهِ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا ‏.‏ قَالَتْ فَلَمَّا كَانَ عُثْمَانُ أَرْسَلَ إِلَىَّ فَسَأَلَنِي عَنْ ذَلِكَ فَأَخْبَرْتُهُ فَاتَّبَعَهُ وَقَضَى بِهِ ‏.‏ أَنْبَأَنَا مُحَمَّدُ بْنُ بَشَّارٍ، أَنْبَأَنَا يَحْيَى بْنُ سَعِيدٍ، أَنْبَأَنَا سَعْدُ بْنُ إِسْحَاقَ بْنِ كَعْبِ بْنِ عُجْرَةَ، فَذَكَرَ نَحْوَهُ بِمَعْنَاهُ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا الْحَدِيثِ عِنْدَ أَكْثَرِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمْ لَمْ يَرَوْا لِلْمُعْتَدَّةِ أَنْ تَنْتَقِلَ مِنْ بَيْتِ زَوْجِهَا حَتَّى تَنْقَضِيَ عِدَّتُهَا ‏.‏ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَالشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَاقَ ‏.‏ وَقَالَ بَعْضُ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمْ لِلْمَرْأَةِ أَنْ تَعْتَدَّ حَيْثُ شَاءَتْ وَإِنْ لَمْ تَعْتَدَّ فِي بَيْتِ زَوْجِهَا ‏.‏ قَالَ أَبُو عِيسَى وَالْقَوْلُ الأَوَّلُ أَصَحُّ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 31
			}
		}
	]
}