{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"14": "The Book on Business"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1240,
			"arabicnumber": 1240,
			"text": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، أَخْبَرَنَا سُفْيَانُ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي الأَشْعَثِ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ الذَّهَبُ بِالذَّهَبِ مِثْلاً بِمِثْلٍ وَالْفِضَّةُ بِالْفِضَّةِ مِثْلاً بِمِثْلٍ وَالتَّمْرُ بِالتَّمْرِ مِثْلاً بِمِثْلٍ وَالْبُرُّ بِالْبُرِّ مِثْلاً بِمِثْلٍ وَالْمِلْحُ بِالْمِلْحِ مِثْلاً بِمِثْلٍ وَالشَّعِيرُ بِالشَّعِيرِ مِثْلاً بِمِثْلٍ فَمَنْ زَادَ أَوِ ازْدَادَ فَقَدْ أَرْبَى بِيعُوا الذَّهَبَ بِالْفِضَّةِ كَيْفَ شِئْتُمْ يَدًا بِيَدٍ وَبِيعُوا الْبُرَّ بِالتَّمْرِ كَيْفَ شِئْتُمْ يَدًا بِيَدٍ وَبِيعُوا الشَّعِيرَ بِالتَّمْرِ كَيْفَ شِئْتُمْ يَدًا بِيَدٍ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ أَبِي سَعِيدٍ وَأَبِي هُرَيْرَةَ وَبِلاَلٍ وَأَنَسٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ عُبَادَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَقَدْ رَوَى بَعْضُهُمْ هَذَا الْحَدِيثَ عَنْ خَالِدٍ بِهَذَا الإِسْنَادِ وَقَالَ ‏\"‏ بِيعُوا الْبُرَّ بِالشَّعِيرِ كَيْفَ شِئْتُمْ يَدًا بِيَدٍ ‏\"‏ ‏.‏ وَرَوَى بَعْضُهُمْ هَذَا الْحَدِيثَ عَنْ خَالِدٍ عَنْ أَبِي قِلاَبَةَ عَنْ أَبِي الأَشْعَثِ عَنْ عُبَادَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم الْحَدِيثَ وَزَادَ فِيهِ قَالَ خَالِدٌ قَالَ أَبُو قِلاَبَةَ ‏\"‏ بِيعُوا الْبُرَّ بِالشَّعِيرِ كَيْفَ شِئْتُمْ ‏\"‏ فَذَكَرَ الْحَدِيثَ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ لاَ يَرَوْنَ أَنْ يُبَاعَ الْبُرُّ بِالْبُرِّ إِلاَّ مِثْلاً بِمِثْلٍ وَالشَّعِيرُ بِالشَّعِيرِ إِلاَّ مِثْلاً بِمِثْلٍ فَإِذَا اخْتَلَفَ الأَصْنَافُ فَلاَ بَأْسَ أَنْ يُبَاعَ مُتَفَاضِلاً إِذَا كَانَ يَدًا بِيَدٍ ‏.‏ وَهَذَا قَوْلُ أَكْثَرِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمْ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَالشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَاقَ ‏.‏ قَالَ الشَّافِعِيُّ وَالْحُجَّةُ فِي ذَلِكَ قَوْلُ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ بِيعُوا الشَّعِيرَ بِالْبُرِّ كَيْفَ شِئْتُمْ يَدًا بِيَدٍ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى وَقَدْ كَرِهَ قَوْمٌ مِنْ أَهْلِ الْعِلْمِ أَنْ تُبَاعَ الْحِنْطَةُ بِالشَّعِيرِ إِلاَّ مِثْلاً بِمِثْلٍ ‏.‏ وَهُوَ قَوْلُ مَالِكِ بْنِ أَنَسٍ وَالْقَوْلُ الأَوَّلُ أَصَحُّ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 40
			}
		}
	]
}