{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"17": "The Book on Legal Punishments (Al-Hudud)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1429,
			"arabicnumber": 1429,
			"text": "حَدَّثَنَا بِذَلِكَ الْحَسَنُ بْنُ عَلِيٍّ الْخَلاَّلُ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَنْبَأَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَجُلاً، مِنْ أَسْلَمَ جَاءَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَاعْتَرَفَ بِالزِّنَا فَأَعْرَضَ عَنْهُ ثُمَّ اعْتَرَفَ فَأَعْرَضَ عَنْهُ حَتَّى شَهِدَ عَلَى نَفْسِهِ أَرْبَعَ شَهَادَاتٍ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَبِكَ جُنُونٌ ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ أَحْصَنْتَ ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ قَالَ فَأَمَرَ بِهِ فَرُجِمَ بِالْمُصَلَّى فَلَمَّا أَذْلَقَتْهُ الْحِجَارَةُ فَرَّ فَأُدْرِكَ فَرُجِمَ حَتَّى مَاتَ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم خَيْرًا وَلَمْ يُصَلِّ عَلَيْهِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا الْحَدِيثِ عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ أَنَّ الْمُعْتَرِفَ بِالزِّنَا إِذَا أَقَرَّ عَلَى نَفْسِهِ أَرْبَعَ مَرَّاتٍ أُقِيمَ عَلَيْهِ الْحَدُّ وَهُوَ قَوْلُ أَحْمَدَ وَإِسْحَاقَ ‏.‏ وَقَالَ بَعْضُ أَهْلِ الْعِلْمِ إِذَا أَقَرَّ عَلَى نَفْسِهِ مَرَّةً أُقِيمَ عَلَيْهِ الْحَدُّ وَهُوَ قَوْلُ مَالِكِ بْنِ أَنَسٍ وَالشَّافِعِيِّ ‏.‏ وَحُجَّةُ مَنْ قَالَ هَذَا الْقَوْلَ حَدِيثُ أَبِي هُرَيْرَةَ وَزَيْدِ بْنِ خَالِدٍ أَنَّ رَجُلَيْنِ اخْتَصَمَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ أَحَدُهُمَا يَا رَسُولَ اللَّهِ إِنَّ ابْنِي زَنَى بِامْرَأَةِ هَذَا الْحَدِيثَ بِطُولِهِ وَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ اغْدُ يَا أُنَيْسُ عَلَى امْرَأَةِ هَذَا فَإِنِ اعْتَرَفَتْ فَارْجُمْهَا ‏\"‏ ‏.‏ وَلَمْ يَقُلْ فَإِنِ اعْتَرَفَتْ أَرْبَعَ مَرَّاتٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 9
			}
		}
	]
}