{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"17": "The Book on Legal Punishments (Al-Hudud)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1446,
			"arabicnumber": 1446,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَطَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي مِجَنٍّ قِيمَتُهُ ثَلاَثَةُ دَرَاهِمَ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ سَعْدٍ وَعَبْدِ اللَّهِ بْنِ عَمْرٍو وَابْنِ عَبَّاسٍ وَأَبِي هُرَيْرَةَ وَأَيْمَنَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عُمَرَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم مِنْهُمْ أَبُو بَكْرٍ الصِّدِّيقُ قَطَعَ فِي خَمْسَةِ دَرَاهِمَ ‏.‏ وَرُوِيَ عَنْ عُثْمَانَ وَعَلِيٍّ أَنَّهُمَا قَطَعَا فِي رُبْعِ دِينَارٍ ‏.‏ وَرُوِيَ عَنْ أَبِي هُرَيْرَةَ وَأَبِي سَعِيدٍ أَنَّهُمَا قَالاَ تُقْطَعُ الْيَدُ فِي خَمْسَةِ دَرَاهِمَ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ فُقَهَاءِ التَّابِعِينَ وَهُوَ قَوْلُ مَالِكِ بْنِ أَنَسٍ وَالشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَاقَ رَأَوُا الْقَطْعَ فِي رُبْعِ دِينَارٍ فَصَاعِدًا ‏.‏ وَقَدْ رُوِيَ عَنِ ابْنِ مَسْعُودٍ أَنَّهُ قَالَ لاَ قَطْعَ إِلاَّ فِي دِينَارٍ أَوْ عَشَرَةِ دَرَاهِمَ ‏.‏ وَهُوَ حَدِيثٌ مُرْسَلٌ رَوَاهُ الْقَاسِمُ بْنُ عَبْدِ الرَّحْمَنِ عَنِ ابْنِ مَسْعُودٍ وَالْقَاسِمُ لَمْ يَسْمَعْ مِنِ ابْنِ مَسْعُودٍ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَأَهْلِ الْكُوفَةِ قَالُوا لاَ قَطْعَ فِي أَقَلَّ مِنْ عَشَرَةِ دَرَاهِمَ ‏.‏ وَرُوِيَ عَنْ عَلِيٍّ أَنَّهُ قَالَ لاَ قَطْعَ فِي أَقَلَّ مِنْ عَشَرَةِ دَرَاهِمَ ‏.‏ وَلَيْسَ إِسْنَادُهُ بِمُتَّصِلٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 29
			}
		}
	]
}