{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"21": "The Book on Military Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1548,
			"arabicnumber": 1548,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عَطَاءِ بْنِ السَّائِبِ، عَنْ أَبِي الْبَخْتَرِيِّ، أَنَّ جَيْشًا، مِنْ جُيُوشِ الْمُسْلِمِينَ كَانَ أَمِيرَهُمْ سَلْمَانُ الْفَارِسِيُّ حَاصَرُوا قَصْرًا مِنْ قُصُورِ فَارِسَ فَقَالُوا يَا أَبَا عَبْدِ اللَّهِ أَلاَ نَنْهَدُ إِلَيْهِمْ قَالَ دَعُونِي أَدْعُهُمْ كَمَا سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَدْعُوهُمْ ‏.‏ فَأَتَاهُمْ سَلْمَانُ فَقَالَ لَهُمْ إِنَّمَا أَنَا رَجُلٌ مِنْكُمْ فَارِسِيٌّ تَرَوْنَ الْعَرَبَ يُطِيعُونَنِي فَإِنْ أَسْلَمْتُمْ فَلَكُمْ مِثْلُ الَّذِي لَنَا وَعَلَيْكُمْ مِثْلُ الَّذِي عَلَيْنَا وَإِنْ أَبَيْتُمْ إِلاَّ دِينَكُمْ تَرَكْنَاكُمْ عَلَيْهِ وَأَعْطُونَا الْجِزْيَةَ عَنْ يَدٍ وَأَنْتُمْ صَاغِرُونَ ‏.‏ قَالَ وَرَطَنَ إِلَيْهِمْ بِالْفَارِسِيَّةِ وَأَنْتُمْ غَيْرُ مَحْمُودِينَ ‏.‏ وَإِنْ أَبَيْتُمْ نَابَذْنَاكُمْ عَلَى سَوَاءٍ ‏.‏ قَالُوا مَا نَحْنُ بِالَّذِي نُعْطِي الْجِزْيَةَ وَلَكِنَّا نُقَاتِلُكُمْ ‏.‏ فَقَالُوا يَا أَبَا عَبْدِ اللَّهِ أَلاَ نَنْهَدُ إِلَيْهِمْ قَالَ لاَ ‏.‏ فَدَعَاهُمْ ثَلاَثَةَ أَيَّامٍ إِلَى مِثْلِ هَذَا ثُمَّ قَالَ انْهَدُوا إِلَيْهِمْ ‏.‏ قَالَ فَنَهَدْنَا إِلَيْهِمْ فَفَتَحْنَا ذَلِكَ الْقَصْرَ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ بُرَيْدَةَ وَالنُّعْمَانِ بْنِ مُقَرِّنٍ وَابْنِ عُمَرَ وَابْنِ عَبَّاسٍ ‏.‏ وَحَدِيثُ سَلْمَانَ حَدِيثٌ حَسَنٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ عَطَاءِ بْنِ السَّائِبِ ‏.‏ وَسَمِعْتُ مُحَمَّدًا يَقُولُ أَبُو الْبَخْتَرِيِّ لَمْ يُدْرِكْ سَلْمَانَ لأَنَّهُ لَمْ يُدْرِكْ عَلِيًّا وَسَلْمَانُ مَاتَ قَبْلَ عَلِيٍّ ‏.‏ وَقَدْ ذَهَبَ بَعْضُ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم إِلَى هَذَا وَرَأَوْا أَنْ يُدْعَوْا قَبْلَ الْقِتَالِ وَهُوَ قَوْلُ إِسْحَاقَ بْنِ إِبْرَاهِيمَ قَالَ إِنْ تُقُدِّمَ إِلَيْهِمْ فِي الدَّعْوَةِ فَحَسَنٌ يَكُونُ ذَلِكَ أَهْيَبَ ‏.‏ وَقَالَ بَعْضُ أَهْلِ الْعِلْمِ لاَ دِعْوَةَ الْيَوْمَ ‏.‏ وَقَالَ أَحْمَدُ لاَ أَعْرِفُ الْيَوْمَ أَحَدًا يُدْعَى ‏.‏ وَقَالَ الشَّافِعِيُّ لاَ يُقَاتَلُ الْعَدُوُّ حَتَّى يُدْعَوْا إِلاَّ أَنْ يَعْجَلُوا عَنْ ذَلِكَ فَإِنْ لَمْ يَفْعَلْ فَقَدْ بَلَغَتْهُمُ الدَّعْوَةُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 1
			}
		}
	]
}