{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"25": "The Book on Food"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1848,
			"arabicnumber": 1848,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا الْعَلاَءُ بْنُ الْفَضْلِ بْنِ عَبْدِ الْمَلِكِ بْنِ أَبِي سَوِيَّةَ أَبُو الْهُذَيْلِ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عِكْرَاشٍ، عَنْ أَبِيهِ، عِكْرَاشِ بْنِ ذُؤَيْبٍ قَالَ بَعَثَنِي بَنُو مُرَّةَ بْنِ عُبَيْدٍ بِصَدَقَاتِ أَمْوَالِهِمْ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَدِمْتُ عَلَيْهِ الْمَدِينَةَ فَوَجَدْتُهُ جَالِسًا بَيْنَ الْمُهَاجِرِينَ وَالأَنْصَارِ قَالَ ثُمَّ أَخَذَ بِيَدِي فَانْطَلَقَ بِي إِلَى بَيْتِ أُمِّ سَلَمَةَ فَقَالَ ‏\"‏ هَلْ مِنْ طَعَامٍ ‏\"‏ ‏.‏ فَأُتِينَا بِجَفْنَةٍ كَثِيرَةِ الثَّرِيدِ وَالْوَذْرِ وَأَقْبَلْنَا نَأْكُلُ مِنْهَا فَخَبَطْتُ بِيَدِي مِنْ نَوَاحِيهَا وَأَكَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ بَيْنِ يَدَيْهِ فَقَبَضَ بِيَدِهِ الْيُسْرَى عَلَى يَدِي الْيُمْنَى ثُمَّ قَالَ ‏\"‏ يَا عِكْرَاشُ كُلْ مِنْ مَوْضِعٍ وَاحِدٍ فَإِنَّهُ طَعَامٌ وَاحِدٌ ‏\"‏ ‏.‏ ثُمَّ أُتِينَا بِطَبَقٍ فِيهِ أَلْوَانُ الرُّطَبِ أَوِ التَّمْرِ عُبَيْدُ اللَّهِ شَكَّ قَالَ فَجَعَلْتُ آكُلُ مِنْ بَيْنِ يَدَىَّ وَجَالَتْ يَدُ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي الطَّبَقِ وَقَالَ ‏\"‏ يَا عِكْرَاشُ كُلْ مِنْ حَيْثُ شِئْتَ فَإِنَّهُ غَيْرُ لَوْنٍ وَاحِدٍ ‏\"‏ ‏.‏ ثُمَّ أُتِينَا بِمَاءٍ فَغَسَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدَيْهِ وَمَسَحَ بِبَلَلِ كَفَّيْهِ وَجْهَهُ وَذِرَاعَيْهِ وَرَأْسَهُ وَقَالَ ‏\"‏ يَا عِكْرَاشُ هَذَا الْوُضُوءُ مِمَّا غَيَّرَتِ النَّارُ ‏\"‏ ‏.‏ وَفِي الْحَدِيثِ قِصَّةٌ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ الْعَلاَءِ بْنِ الْفَضْلِ وَقَدْ تَفَرَّدَ الْعَلاَءُ بِهَذَا الْحَدِيثِ وَلاَ نَعْرِفُ لِعِكْرَاشٍ عَنِ النَّبِيِّ صلى الله عليه وسلم إِلاَّ هَذَا الْحَدِيثَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 64
			}
		}
	]
}