{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"2": "The Book on Salat (Prayer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 189,
			"arabicnumber": 189,
			"text": "حَدَّثَنَا سَعِيدُ بْنُ يَحْيَى بْنِ سَعِيدٍ الأُمَوِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاقَ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ التَّيْمِيِّ، عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ زَيْدٍ، عَنْ أَبِيهِ، قَالَ لَمَّا أَصْبَحْنَا أَتَيْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم فَأَخْبَرْتُهُ بِالرُّؤْيَا فَقَالَ ‏\"‏ إِنَّ هَذِهِ لَرُؤْيَا حَقٍّ فَقُمْ مَعَ بِلاَلٍ فَإِنَّهُ أَنْدَى وَأَمَدُّ صَوْتًا مِنْكَ فَأَلْقِ عَلَيْهِ مَا قِيلَ لَكَ وَلْيُنَادِ بِذَلِكَ ‏\"‏ ‏.‏ قَالَ فَلَمَّا سَمِعَ عُمَرُ بْنُ الْخَطَّابِ نِدَاءَ بِلاَلٍ بِالصَّلاَةِ خَرَجَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَهُوَ يَجُرُّ إِزَارَهُ وَهُوَ يَقُولُ يَا رَسُولَ اللَّهِ وَالَّذِي بَعَثَكَ بِالْحَقِّ لَقَدْ رَأَيْتُ مِثْلَ الَّذِي قَالَ ‏.‏ قَالَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَلِلَّهِ الْحَمْدُ فَذَلِكَ أَثْبَتُ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنِ ابْنِ عُمَرَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ عَبْدِ اللَّهِ بْنِ زَيْدٍ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَقَدْ رَوَى هَذَا الْحَدِيثَ إِبْرَاهِيمُ بْنُ سَعْدٍ عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ أَتَمَّ مِنْ هَذَا الْحَدِيثِ وَأَطْوَلَ وَذَكَرَ فِيهِ قِصَّةَ الأَذَانِ مَثْنَى مَثْنَى وَالإِقَامَةِ مَرَّةً مَرَّةً ‏.‏ وَعَبْدُ اللَّهِ بْنُ زَيْدٍ هُوَ ابْنُ عَبْدِ رَبِّهِ وَيُقَالُ ابْنُ عَبْدِ رَبٍّ وَلاَ نَعْرِفُ لَهُ عَنِ النَّبِيِّ صلى الله عليه وسلم شَيْئًا يَصِحُّ إِلاَّ هَذَا الْحَدِيثَ الْوَاحِدَ فِي الأَذَانِ ‏.‏ وَعَبْدُ اللَّهِ بْنُ زَيْدِ بْنِ عَاصِمٍ الْمَازِنِيُّ لَهُ أَحَادِيثُ عَنِ النَّبِيِّ صلى الله عليه وسلم وَهُوَ عَمُّ عَبَّادِ بْنِ تَمِيمٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 41
			}
		}
	]
}