{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"27": "Chapters on Righteousness And Maintaining Good Relations With Relatives"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2035,
			"arabicnumber": 2035,
			"text": "حَدَّثَنَا الْحُسَيْنُ بْنُ الْحَسَنِ الْمَرْوَزِيُّ، بِمَكَّةَ وَإِبْرَاهِيمُ بْنُ سَعِيدٍ الْجَوْهَرِيُّ قَالاَ حَدَّثَنَا الأَحْوَصُ بْنُ جَوَّابٍ، عَنْ سُعَيْرِ بْنِ الْخِمْسِ، عَنْ سُلَيْمَانَ التَّيْمِيِّ، عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ، عَنْ أُسَامَةَ بْنِ زَيْدٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ صُنِعَ إِلَيْهِ مَعْرُوفٌ فَقَالَ لِفَاعِلِهِ جَزَاكَ اللَّهُ خَيْرًا فَقَدْ أَبْلَغَ فِي الثَّنَاءِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ جَيِّدٌ غَرِيبٌ لاَ نَعْرِفُهُ مِنْ حَدِيثِ أُسَامَةَ بْنِ زَيْدٍ إِلاَّ مِنْ هَذَا الْوَجْهِ ‏.‏ وَقَدْ رُوِيَ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ وَسَأَلْتُ مُحَمَّدًا فَلَمْ يَعْرِفْهُ ‏.‏ حَدَّثَنِي عَبْدُ الرَّحِيمِ بْنُ حَازِمٍ الْبَلْخِيُّ قَالَ سَمِعْتُ الْمَكِّيَّ بْنَ إِبْرَاهِيمَ يَقُولُ كُنَّا عِنْدَ ابْنِ جُرَيْجٍ الْمَكِّيِّ فَجَاءَ سَائِلٌ فَسَأَلَهُ فَقَالَ ابْنُ جُرَيْجٍ لِخَازِنِهِ أَعْطِهِ دِينَارًا ‏.‏ فَقَالَ مَا عِنْدِي إِلاَّ دِينَارٌ إِنْ أَعْطَيْتُهُ لَجُعْتَ وَعِيَالَكَ ‏.‏ قَالَ فَغَضِبَ وَقَالَ أَعْطِهِ ‏.‏ قَالَ الْمَكِّيُّ فَنَحْنُ عِنْدَ ابْنِ جُرَيْجٍ إِذْ جَاءَهُ رَجُلٌ بِكِتَابٍ وَصُرَّةٍ وَقَدْ بَعَثَ إِلَيْهِ بَعْضُ إِخْوَانِهِ وَفِي الْكِتَابِ إِنِّي قَدْ بَعَثْتُ خَمْسِينَ دِينَارًا ‏.‏ قَالَ فَحَلَّ ابْنُ جُرَيْجٍ الصُّرَّةَ فَعَدَّهَا فَإِذَا هِيَ أَحَدٌ وَخَمْسُونَ دِينَارًا ‏.‏ قَالَ فَقَالَ ابْنُ جُرَيْجٍ لِخَازِنِهِ قَدْ أَعْطَيْتَ وَاحِدًا فَرَدَّهُ اللَّهُ عَلَيْكَ وَزَادَكَ خَمْسِينَ دِينَارًا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 141
			}
		}
	]
}