{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"28": "Chapters on Medicine"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2044,
			"arabicnumber": 2044,
			"text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قال حَدَّثَنَا أَبُو دَاوُدَ، عَنْ شُعْبَةَ، عَنِ الأَعْمَشِ، قَالَ سَمِعْتُ أَبَا صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ قَتَلَ نَفْسَهُ بِحَدِيدَةٍ فَحَدِيدَتُهُ فِي يَدِهِ يَتَوَجَّأُ بِهَا فِي بَطْنِهِ فِي نَارِ جَهَنَّمَ خَالِدًا مُخَلَّدًا فِيهَا أَبَدًا وَمَنْ قَتَلَ نَفْسَهُ بِسُمٍّ فَسُمُّهُ فِي يَدِهِ يَتَحَسَّاهُ فِي نَارِ جَهَنَّمَ خَالِدًا مُخَلَّدًا فِيهَا أَبَدًا وَمَنْ تَرَدَّى مِنْ جَبَلٍ فَقَتَلَ نَفْسَهُ فَهُوَ يَتَرَدَّى فِي نَارِ جَهَنَّمَ خَالِدًا مُخَلَّدًا فِيهَا أَبَدًا ‏\"‏ ‏.‏ حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، قال حَدَّثَنَا وَكِيعٌ، وَأَبُو مُعَاوِيَةَ عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَ حَدِيثِ شُعْبَةَ عَنِ الأَعْمَشِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ وَهُوَ أَصَحُّ مِنَ الْحَدِيثِ الأَوَّلِ ‏.‏ هَكَذَا رَوَى غَيْرُ وَاحِدٍ هَذَا الْحَدِيثَ عَنِ الأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ وَرَوَى مُحَمَّدُ بْنُ عَجْلاَنَ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ قَتَلَ نَفْسَهُ بِسُمٍّ عُذِّبَ فِي نَارِ جَهَنَّمَ ‏\"‏ ‏.‏ وَلَمْ يَذْكُرْ فِيهِ خَالِدًا مُخَلَّدًا فِيهَا أَبَدًا ‏.‏ وَهَكَذَا رَوَاهُ أَبُو الزِّنَادِ عَنِ الأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم وَهَذَا أَصَحُّ لأَنَّ الرِّوَايَاتِ إِنَّمَا تَجِيءُ بِأَنَّ أَهْلَ التَّوْحِيدِ يُعَذَّبُونَ فِي النَّارِ ثُمَّ يُخْرَجُونَ مِنْهَا وَلَمْ يُذْكَرْ أَنَّهُمْ يُخَلَّدُونَ فِيهَا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 9
			}
		}
	]
}