{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"33": "Chapters On Al-Fitan"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2183,
			"arabicnumber": 2183,
			"text": "حَدَّثَنَا بُنْدَارٌ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا سُفْيَانُ، عَنْ فُرَاتٍ الْقَزَّازِ، عَنْ أَبِي الطُّفَيْلِ، عَنْ حُذَيْفَةَ بْنِ أَسِيدٍ، قَالَ أَشْرَفَ عَلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ غُرْفَةٍ وَنَحْنُ نَتَذَاكَرُ السَّاعَةَ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى تَرَوْا عَشْرَ آيَاتٍ طُلُوعُ الشَّمْسِ مِنْ مَغْرِبِهَا وَيَأْجُوجُ وَمَأْجُوجُ وَالدَّابَّةُ وَثَلاَثَةُ خُسُوفٍ خَسْفٍ بِالْمَشْرِقِ وَخَسْفٍ بِالْمَغْرِبِ وَخَسْفٍ بِجَزِيرَةِ الْعَرَبِ وَنَارٌ تَخْرُجُ مِنْ قَعْرِ عَدَنَ تَسُوقُ النَّاسَ أَوْ تَحْشُرُ النَّاسَ فَتَبِيتُ مَعَهُمْ حَيْثُ بَاتُوا وَتَقِيلُ مَعَهُمْ حَيْثُ قَالُوا ‏\"‏ ‏.‏ حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ فُرَاتٍ، نَحْوَهُ وَزَادَ فِيهِ ‏\"‏ الدُّخَانَ ‏\"‏ ‏.‏ حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ فُرَاتٍ الْقَزَّازِ، نَحْوَ حَدِيثِ وَكِيعٍ عَنْ سُفْيَانَ، ‏.‏ حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ، عَنْ شُعْبَةَ، وَالْمَسْعُودِيِّ، سَمِعَا مِنْ، فُرَاتٍ الْقَزَّازِ نَحْوَ حَدِيثِ عَبْدِ الرَّحْمَنِ عَنْ سُفْيَانَ عَنْ فُرَاتٍ وَزَادَ فِيهِ ‏\"‏ الدَّجَّالَ أَوِ الدُّخَانَ ‏\"‏ ‏.‏ حَدَّثَنَا أَبُو مُوسَى، مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا أَبُو النُّعْمَانِ الْحَكَمُ بْنُ عَبْدِ اللَّهِ الْعِجْلِيُّ، عَنْ شُعْبَةَ، عَنْ فُرَاتٍ، نَحْوَ حَدِيثِ أَبِي دَاوُدَ عَنْ شُعْبَةَ، وَزَادَ، فِيهِ قَالَ ‏\"‏ وَالْعَاشِرَةُ إِمَّا رِيحٌ تَطْرَحُهُمْ فِي الْبَحْرِ وَإِمَّا نُزُولُ عِيسَى ابْنِ مَرْيَمَ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى وَفِي الْبَابِ عَنْ عَلِيٍّ وَأَبِي هُرَيْرَةَ وَأُمِّ سَلَمَةَ وَصَفِيَّةَ بِنْتِ حُيَىٍّ ‏.‏ وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				}
			],
			"reference": {
				"book": 33,
				"hadith": 26
			}
		}
	]
}