{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"33": "Chapters On Al-Fitan"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2191,
			"arabicnumber": 2191,
			"text": "حَدَّثَنَا عِمْرَانُ بْنُ مُوسَى الْقَزَّازُ الْبَصْرِيُّ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، حَدَّثَنَا عَلِيُّ بْنُ زَيْدِ بْنِ جُدْعَانَ الْقُرَشِيُّ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ صَلَّى بِنَا رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمًا صَلاَةَ الْعَصْرِ بِنَهَارٍ ثُمَّ قَامَ خَطِيبًا فَلَمْ يَدَعْ شَيْئًا يَكُونُ إِلَى قِيَامِ السَّاعَةِ إِلاَّ أَخْبَرَنَا بِهِ حَفِظَهُ مَنْ حَفِظَهُ وَنَسِيَهُ مَنْ نَسِيَهُ وَكَانَ فِيمَا قَالَ ‏\"‏ إِنَّ الدُّنْيَا حُلْوَةٌ خَضِرَةٌ وَإِنَّ اللَّهَ مُسْتَخْلِفُكُمْ فِيهَا فَنَاظِرٌ كَيْفَ تَعْمَلُونَ أَلاَ فَاتَّقُوا الدُّنْيَا وَاتَّقُوا النِّسَاءَ ‏\"‏ ‏.‏ وَكَانَ فِيمَا قَالَ ‏\"‏ أَلاَ لاَ يَمْنَعَنَّ رَجُلاً هَيْبَةُ النَّاسِ أَنْ يَقُولَ بِحَقٍّ إِذَا عَلِمَهُ ‏\"‏ ‏.‏ قَالَ فَبَكَى أَبُو سَعِيدٍ فَقَالَ قَدْ وَاللَّهِ رَأَيْنَا أَشْيَاءَ فَهِبْنَا ‏.‏ وَكَانَ فِيمَا قَالَ ‏\"‏ أَلاَ إِنَّهُ يُنْصَبُ لِكُلِّ غَادِرٍ لِوَاءٌ يَوْمَ الْقِيَامَةِ بِقَدْرِ غَدْرَتِهِ وَلاَ غَدْرَةَ أَعْظَمَ مِنْ غَدْرَةِ إِمَامِ عَامَّةٍ يُرْكَزُ لِوَاؤُهُ عِنْدَ اسْتِهِ ‏\"‏ ‏.‏ وَكَانَ فِيمَا حَفِظْنَا يَوْمَئِذٍ ‏\"‏ أَلاَ إِنَّ بَنِي آدَمَ خُلِقُوا عَلَى طَبَقَاتٍ شَتَّى فَمِنْهُمْ مَنْ يُولَدُ مُؤْمِنًا وَيَحْيَا مُؤْمِنًا وَيَمُوتُ مُؤْمِنًا وَمِنْهُمْ مَنْ يُولَدُ كَافِرًا وَيَحْيَا كَافِرًا وَيَمُوتُ كَافِرًا وَمِنْهُمْ مَنْ يُولَدُ مُؤْمِنًا وَيَحْيَا مُؤْمِنًا وَيَمُوتُ كَافِرًا وَمِنْهُمْ مَنْ يُولَدُ كَافِرًا وَيَحْيَا كَافِرًا وَيَمُوتُ مُؤْمِنًا أَلاَ وَإِنَّ مِنْهُمُ الْبَطِيءَ الْغَضَبِ سَرِيعَ الْفَىْءِ وَمِنْهُمْ سَرِيعُ الْغَضَبِ سَرِيعُ الْفَىْءِ فَتِلْكَ بِتِلْكَ أَلاَ وَإِنَّ مِنْهُمْ سَرِيعَ الْغَضَبِ بَطِيءَ الْفَىْءِ أَلاَ وَخَيْرُهُمْ بَطِيءُ الْغَضَبِ سَرِيعُ الْفَىْءِ أَلاَ وَشَرُّهُمْ سَرِيعُ الْغَضَبِ بَطِيءُ الْفَىْءِ أَلاَ وَإِنَّ مِنْهُمْ حَسَنَ الْقَضَاءِ حَسَنَ الطَّلَبِ وَمِنْهُمْ سَيِّئُ الْقَضَاءِ حَسَنُ الطَّلَبِ وَمِنْهُمْ حَسَنُ الْقَضَاءِ سَيِّئُ الطَّلَبِ فَتِلْكَ بِتِلْكَ أَلاَ وَإِنَّ مِنْهُمُ السَّيِّئَ الْقَضَاءِ السَّيِّئَ الطَّلَبِ أَلاَ وَخَيْرُهُمُ الْحَسَنُ الْقَضَاءِ الْحَسَنُ الطَّلَبِ أَلاَ وَشَرُّهُمْ سَيِّئُ الْقَضَاءِ سَيِّئُ الطَّلَبِ أَلاَ وَإِنَّ الْغَضَبَ جَمْرَةٌ فِي قَلْبِ ابْنِ آدَمَ أَمَا رَأَيْتُمْ إِلَى حُمْرَةِ عَيْنَيْهِ وَانْتِفَاخِ أَوْدَاجِهِ فَمَنْ أَحَسَّ بِشَيْءٍ مِنْ ذَلِكَ فَلْيَلْصَقْ بِالأَرْضِ ‏\"‏ ‏.‏ قَالَ وَجَعَلْنَا نَلْتَفِتُ إِلَى الشَّمْسِ هَلْ بَقِيَ مِنْهَا شَيْءٌ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَلاَ إِنَّهُ لَمْ يَبْقَ مِنَ الدُّنْيَا فِيمَا مَضَى مِنْهَا إِلاَّ كَمَا بَقِيَ مِنْ يَوْمِكُمْ هَذَا فِيمَا مَضَى مِنْهُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى وَفِي الْبَابِ عَنْ حُذَيْفَةَ وَأَبِي مَرْيَمَ وَأَبِي زَيْدِ بْنِ أَخْطَبَ وَالْمُغِيرَةِ بْنِ شُعْبَةَ وَذَكَرُوا أَنَّ النَّبِيَّ صلى الله عليه وسلم حَدَّثَهُمَ بِمَا هُوَ كَائِنٌ إِلَى أَنْ تَقُومَ السَّاعَةُ ‏.‏ وَهَذَا حَدِيثٌ حَسَنٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 33,
				"hadith": 34
			}
		}
	]
}