{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"32": "Chapters On Al-Qadar"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2298,
			"arabicnumber": 2298,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ الْفَزَارِيُّ، عَنْ يَزِيدَ بْنِ زِيَادٍ الدِّمَشْقِيِّ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ تَجُوزُ شَهَادَةُ خَائِنٍ وَلاَ خَائِنَةٍ وَلاَ مَجْلُودٍ حَدًّا وَلاَ مَجْلُودَةٍ وَلاَ ذِي غِمْرٍ لأَخِيهِ وَلاَ مُجَرَّبِ شَهَادَةٍ وَلاَ الْقَانِعِ أَهْلَ الْبَيْتِ لَهُمْ وَلاَ ظَنِينٍ فِي وَلاَءٍ وَلاَ قَرَابَةٍ ‏\"‏ ‏.‏ قَالَ الْفَزَارِيُّ الْقَانِعُ التَّابِعُ ‏.‏ هَذَا حَدِيثٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ يَزِيدَ بْنِ زِيَادٍ الدِّمَشْقِيِّ ‏.‏ وَيَزِيدُ يُضَعَّفُ فِي الْحَدِيثِ وَلاَ يُعْرَفُ هَذَا الْحَدِيِثُ مِنْ حَدِيثِ الزُّهْرِيِّ إِلاَّ مِنْ حَدِيثِهِ ‏.‏ وَفِي الْبَابِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو ‏.‏ قَالَ وَلاَ نَعْرِفُ مَعْنَى هَذَا الْحَدِيثِ وَلاَ يَصِحُّ عِنْدِي مِنْ قِبَلِ إِسْنَادِهِ ‏.‏ وَالْعَمَلُ عِنْدَ أَهْلِ الْعِلْمِ فِي هَذَا أَنَّ شَهَادَةَ الْقَرِيبِ جَائِزَةٌ لِقَرَابَتِهِ ‏.‏ وَاخْتَلَفَ أَهْلُ الْعِلْمِ فِي شَهَادَةِ الْوَالِدِ لِلْوَلَدِ وَالْوَلَدِ لِوَالِدِهِ وَلَمْ يُجِزْ أَكْثَرُ أَهْلِ الْعِلْمِ شَهَادَةَ الْوَالِدِ لِلْوَلَدِ وَلاَ الْوَلَدِ لِلْوَالِدِ ‏.‏ وَقَالَ بَعْضُ أَهْلِ الْعِلْمِ إِذَا كَانَ عَدْلاً فَشَهَادَةُ الْوَالِدِ لِلْوَلَدِ جَائِزَةٌ وَكَذَلِكَ شَهَادَةُ الْوَلَدِ لِلْوَالِدِ ‏.‏ وَلَمْ يَخْتَلِفُوا فِي شَهَادَةِ الأَخِ لأَخِيهِ أَنَّهَا جَائِزَةٌ وَكَذَلِكَ شَهَادَةُ كُلِّ قَرِيبٍ لِقَرِيبِهِ ‏.‏ وَقَالَ الشَّافِعِيُّ لاَ تَجُوزُ شَهَادَةٌ لِرَجُلٍ عَلَى الآخَرِ وَإِنْ كَانَ عَدْلاً إِذَا كَانَتْ بَيْنَهُمَا عَدَاوَةٌ ‏.‏ وَذَهَبَ إِلَى حَدِيثِ عَبْدِ الرَّحْمَنِ الأَعْرَجِ عَنِ النَّبِيِّ صلى الله عليه وسلم مُرْسَلاً ‏\"‏ لاَ تَجُوزُ شَهَادَةُ صَاحِبِ إِحْنَةٍ ‏\"‏ ‏.‏ يَعْنِي صَاحِبَ عَدَاوَةٍ وَكَذَلِكَ مَعْنَى هَذَا الْحَدِيثِ حَيْثُ قَالَ ‏\"‏ لاَ تَجُوزُ شَهَادَةُ صَاحِبِ غِمْرٍ لأَخِيهِ ‏\"‏ يَعْنِي صَاحِبَ عَدَاوَةٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 14
			}
		}
	]
}