{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"2": "The Book on Salat (Prayer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 230,
			"arabicnumber": 230,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ حُصَيْنٍ، عَنْ هِلاَلِ بْنِ يِسَافٍ، قَالَ أَخَذَ زِيَادُ بْنُ أَبِي الْجَعْدِ بِيَدِي وَنَحْنُ بِالرَّقَّةِ فَقَامَ بِي عَلَى شَيْخٍ يُقَالُ لَهُ وَابِصَةُ بْنُ مَعْبَدٍ مِنْ بَنِي أَسَدٍ فَقَالَ زِيَادٌ حَدَّثَنِي هَذَا الشَّيْخُ أَنَّ رَجُلاً صَلَّى خَلْفَ الصَّفِّ وَحْدَهُ وَالشَّيْخُ يَسْمَعُ فَأَمَرَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُعِيدَ الصَّلاَةَ ‏.‏ قَالَ أَبُو عِيسَى وَفِي الْبَابِ عَنْ عَلِيِّ بْنِ شَيْبَانَ وَابْنِ عَبَّاسٍ ‏.‏ قَالَ أَبُو عِيسَى وَحَدِيثُ وَابِصَةَ حَدِيثٌ حَسَنٌ ‏.‏ وَقَدْ كَرِهَ قَوْمٌ مِنْ أَهْلِ الْعِلْمِ أَنْ يُصَلِّيَ الرَّجُلُ خَلْفَ الصَّفِّ وَحْدَهُ وَقَالُوا يُعِيدُ إِذَا صَلَّى خَلْفَ الصَّفِّ وَحْدَهُ ‏.‏ وَبِهِ يَقُولُ أَحْمَدُ وَإِسْحَاقُ ‏.‏ وَقَدْ قَالَ قَوْمٌ مِنْ أَهْلِ الْعِلْمِ يُجْزِئُهُ إِذَا صَلَّى خَلْفَ الصَّفِّ وَحْدَهُ ‏.‏ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَابْنِ الْمُبَارَكِ وَالشَّافِعِيِّ ‏.‏ وَقَدْ ذَهَبَ قَوْمٌ مِنْ أَهْلِ الْكُوفَةِ إِلَى حَدِيثِ وَابِصَةَ بْنِ مَعْبَدٍ أَيْضًا قَالُوا مَنْ صَلَّى خَلْفَ الصَّفِّ وَحْدَهُ يُعِيدُ ‏.‏ مِنْهُمْ حَمَّادُ بْنُ أَبِي سُلَيْمَانَ وَابْنُ أَبِي لَيْلَى وَوَكِيعٌ ‏.‏ وَرَوَى حَدِيثَ حُصَيْنٍ عَنْ هِلاَلِ بْنِ يِسَافٍ غَيْرُ وَاحِدٍ مِثْلَ رِوَايَةِ أَبِي الأَحْوَصِ عَنْ زِيَادِ بْنِ أَبِي الْجَعْدِ عَنْ وَابِصَةَ بْنِ مَعْبَدٍ ‏.‏ وَفِي حَدِيثِ حُصَيْنٍ مَا يَدُلُّ عَلَى أَنَّ هِلاَلاً قَدْ أَدْرَكَ وَابِصَةَ وَاخْتَلَفَ أَهْلُ الْحَدِيثِ فِي هَذَا فَقَالَ بَعْضُهُمْ حَدِيثُ عَمْرِو بْنِ مُرَّةَ عَنْ هِلاَلِ بْنِ يِسَافٍ عَنْ عَمْرِو بْنِ رَاشِدٍ عَنْ وَابِصَةَ بْنِ مَعْبَدٍ أَصَحُّ ‏.‏ وَقَالَ بَعْضُهُمْ حَدِيثُ حُصَيْنٍ عَنْ هِلاَلِ بْنِ يِسَافٍ عَنْ زِيَادِ بْنِ أَبِي الْجَعْدِ عَنْ وَابِصَةَ بْنِ مَعْبَدٍ أَصَحُّ ‏.‏ قَالَ أَبُو عِيسَى وَهَذَا عِنْدِي أَصَحُّ مِنْ حَدِيثِ عَمْرِو بْنِ مُرَّةَ لأَنَّهُ قَدْ رُوِيَ مِنْ غَيْرِ حَدِيثِ هِلاَلِ بْنِ يِسَافٍ عَنْ زِيَادِ بْنِ أَبِي الْجَعْدِ عَنْ وَابِصَةَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 82
			}
		}
	]
}