{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"36": "Chapters On Zuhd"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2325,
			"arabicnumber": 2325,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا عُبَادَةُ بْنُ مُسْلِمٍ، حَدَّثَنَا يُونُسُ بْنُ خَبَّابٍ، عَنْ سَعِيدٍ الطَّائِيِّ أَبِي الْبَخْتَرِيِّ، أَنَّهُ قَالَ حَدَّثَنِي أَبُو كَبْشَةَ الأَنْمَارِيُّ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ ثَلاَثَةٌ أُقْسِمُ عَلَيْهِنَّ وَأُحَدِّثُكُمْ حَدِيثًا فَاحْفَظُوهُ ‏\"‏ ‏.‏ قَالَ ‏\"‏ مَا نَقَصَ مَالُ عَبْدٍ مِنْ صَدَقَةٍ وَلاَ ظُلِمَ عَبْدٌ مَظْلِمَةً فَصَبَرَ عَلَيْهَا إِلاَّ زَادَهُ اللَّهُ عِزًّا وَلاَ فَتَحَ عَبْدٌ بَابَ مَسْأَلَةٍ إِلاَّ فَتَحَ اللَّهُ عَلَيْهِ بَابَ فَقْرٍ أَوْ كَلِمَةً نَحْوَهَا وَأُحَدِّثُكُمْ حَدِيثًا فَاحْفَظُوهُ قَالَ ‏\"‏ إِنَّمَا الدُّنْيَا لأَرْبَعَةِ نَفَرٍ عَبْدٍ رَزَقَهُ اللَّهُ مَالاً وَعِلْمًا فَهُوَ يَتَّقِي فِيهِ رَبَّهُ وَيَصِلُ فِيهِ رَحِمَهُ وَيَعْلَمُ لِلَّهِ فِيهِ حَقًّا فَهَذَا بِأَفْضَلِ الْمَنَازِلِ وَعَبْدٍ رَزَقَهُ اللَّهُ عِلْمًا وَلَمْ يَرْزُقْهُ مَالاً فَهُوَ صَادِقُ النِّيَّةِ يَقُولُ لَوْ أَنَّ لِي مَالاً لَعَمِلْتُ بِعَمَلِ فُلاَنٍ فَهُوَ بِنِيَّتِهِ فَأَجْرُهُمَا سَوَاءٌ وَعَبْدٍ رَزَقَهُ اللَّهُ مَالاً وَلَمْ يَرْزُقْهُ عِلْمًا فَهُوَ يَخْبِطُ فِي مَالِهِ بِغَيْرِ عِلْمٍ لاَ يَتَّقِي فِيهِ رَبَّهُ وَلاَ يَصِلُ فِيهِ رَحِمَهُ وَلاَ يَعْلَمُ لِلَّهِ فِيهِ حَقًّا فَهَذَا بِأَخْبَثِ الْمَنَازِلِ وَعَبْدٍ لَمْ يَرْزُقْهُ اللَّهُ مَالاً وَلاَ عِلْمًا فَهُوَ يَقُولُ لَوْ أَنَّ لِي مَالاً لَعَمِلْتُ فِيهِ بِعَمَلِ فُلاَنٍ فَهُوَ بِنِيَّتِهِ فَوِزْرُهُمَا سَوَاءٌ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 22
			}
		}
	]
}