{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"2": "The Book on Salat (Prayer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 234,
			"arabicnumber": 234,
			"text": "حَدَّثَنَا إِسْحَاقُ الأَنْصَارِيُّ، حَدَّثَنَا مَعْنٌ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ جَدَّتَهُ، مُلَيْكَةَ دَعَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم لِطَعَامٍ صَنَعَتْهُ فَأَكَلَ مِنْهُ ثُمَّ قَالَ ‏\"‏ قُومُوا فَلْنُصَلِّ بِكُمْ ‏\"‏ ‏.‏ قَالَ أَنَسٌ فَقُمْتُ إِلَى حَصِيرٍ لَنَا قَدِ اسْوَدَّ مِنْ طُولِ مَا لُبِسَ فَنَضَحْتُهُ بِالْمَاءِ فَقَامَ عَلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم وَصَفَفْتُ عَلَيْهِ أَنَا وَالْيَتِيمُ وَرَاءَهُ وَالْعَجُوزُ مِنْ وَرَائِنَا فَصَلَّى بِنَا رَكْعَتَيْنِ ثُمَّ انْصَرَفَ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أَنَسٍ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَيْهِ عِنْدَ أَكْثَرِ أَهْلِ الْعِلْمِ قَالُوا إِذَا كَانَ مَعَ الإِمَامِ رَجُلٌ وَامْرَأَةٌ قَامَ الرَّجُلُ عَنْ يَمِينِ الإِمَامِ وَالْمَرْأَةُ خَلْفَهُمَا ‏.‏ وَقَدِ احْتَجَّ بَعْضُ النَّاسِ بِهَذَا الْحَدِيثِ فِي إِجَازَةِ الصَّلاَةِ إِذَا كَانَ الرَّجُلُ خَلْفَ الصَّفِّ وَحْدَهُ وَقَالُوا إِنَّ الصَّبِيَّ لَمْ تَكُنْ لَهُ صَلاَةٌ وَكَأَنَّ أَنَسًا كَانَ خَلْفَ النَّبِيِّ صلى الله عليه وسلم وَحْدَهُ فِي الصَّفِّ ‏.‏ وَلَيْسَ الأَمْرُ عَلَى مَا ذَهَبُوا إِلَيْهِ لأَنَّ النَّبِيَّ صلى الله عليه وسلم أَقَامَهُ مَعَ الْيَتِيمِ خَلْفَهُ فَلَوْلاَ أَنَّ النَّبِيَّ صلى الله عليه وسلم جَعَلَ لِلْيَتِيمِ صَلاَةً لَمَا أَقَامَ الْيَتِيمَ مَعَهُ وَلأَقَامَهُ عَنْ يَمِينِهِ ‏.‏ وَقَدْ رُوِيَ عَنْ مُوسَى بْنِ أَنَسٍ عَنْ أَنَسٍ أَنَّهُ صَلَّى مَعَ النَّبِيِّ صلى الله عليه وسلم فَأَقَامَهُ عَنْ يَمِينِهِ ‏.‏ وَفِي هَذَا الْحَدِيثِ دَلاَلَةٌ أَنَّهُ إِنَّمَا صَلَّى تَطَوُّعًا أَرَادَ إِدْخَالَ الْبَرَكَةِ عَلَيْهِمْ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 86
			}
		}
	]
}