{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"37": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara'"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2460,
			"arabicnumber": 2460,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ أَحْمَدَ بْنُ مَدُّويَهْ التِّرْمِذِيُّ، حَدَّثَنَا الْقَاسِمُ بْنُ الْحَكَمِ الْعُرَنِيُّ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ الْوَلِيدِ الْوَصَّافِيُّ، عَنْ عَطِيَّةَ، عَنْ أَبِي سَعِيدٍ، قَالَ دَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم مُصَلاَّهُ فَرَأَى نَاسًا كَأَنَّهُمْ يَكْتَشِرُونَ قَالَ ‏\"‏ أَمَا إِنَّكُمْ لَوْ أَكْثَرْتُمْ ذِكْرَ هَاذِمِ اللَّذَّاتِ لَشَغَلَكُمْ عَمَّا أَرَى فَأَكْثِرُوا مِنْ ذِكْرِ هَاذِمِ اللَّذَّاتِ الْمَوْتِ فَإِنَّهُ لَمْ يَأْتِ عَلَى الْقَبْرِ يَوْمٌ إِلاَّ تَكَلَّمَ فِيهِ فَيَقُولُ أَنَا بَيْتُ الْغُرْبَةِ وَأَنَا بَيْتُ الْوَحْدَةِ وَأَنَا بَيْتُ التُّرَابِ وَأَنَا بَيْتُ الدُّودِ ‏.‏ فَإِذَا دُفِنَ الْعَبْدُ الْمُؤْمِنُ قَالَ لَهُ الْقَبْرُ مَرْحَبًا وَأَهْلاً أَمَا إِنْ كُنْتَ لأَحَبَّ مَنْ يَمْشِي عَلَى ظَهْرِي إِلَىَّ فَإِذْ وُلِّيتُكَ الْيَوْمَ وَصِرْتَ إِلَىَّ فَسَتَرَى صَنِيعِي بِكَ ‏.‏ قَالَ فَيَتَّسِعُ لَهُ مَدَّ بَصَرِهِ وَيُفْتَحُ لَهُ بَابٌ إِلَى الْجَنَّةِ ‏.‏ وَإِذَا دُفِنَ الْعَبْدُ الْفَاجِرُ أَوِ الْكَافِرُ قَالَ لَهُ الْقَبْرُ لاَ مَرْحَبًا وَلاَ أَهْلاً أَمَا إِنْ كُنْتَ لأَبْغَضَ مَنْ يَمْشِي عَلَى ظَهْرِي إِلَىَّ فَإِذْ وُلِّيتُكَ الْيَوْمَ وَصِرْتَ إِلَىَّ فَسَتَرَى صَنِيعِي بِكَ ‏.‏ قَالَ فَيَلْتَئِمُ عَلَيْهِ حَتَّى تَلْتَقِيَ عَلَيْهِ وَتَخْتَلِفَ أَضْلاَعُهُ ‏.‏ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِأَصَابِعِهِ فَأَدْخَلَ بَعْضَهَا فِي جَوْفِ بَعْضٍ قَالَ ‏\"‏ وَيُقَيِّضُ اللَّهُ لَهُ سَبْعِينَ تِنِّينًا لَوْ أَنَّ وَاحِدًا مِنْهَا نَفَخَ فِي الأَرْضِ مَا أَنْبَتَتْ شَيْئًا مَا بَقِيَتِ الدُّنْيَا فَيَنْهَشْنَهُ وَيَخْدِشْنَهُ حَتَّى يُفْضَى بِهِ إِلَى الْحِسَابِ ‏\"‏ ‏.‏ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّمَا الْقَبْرُ رَوْضَةٌ مِنْ رِيَاضِ الْجَنَّةِ أَوْ حُفْرَةٌ مِنْ حُفَرِ النَّارِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ هَذَا الْوَجْهِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Very Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 46
			}
		}
	]
}