{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"38": "Chapters on the description of Paradise"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2557,
			"arabicnumber": 2557,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنِ الْعَلاَءِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ يَجْمَعُ اللَّهُ النَّاسَ يَوْمَ الْقِيَامَةِ فِي صَعِيدٍ وَاحِدٍ ثُمَّ يَطَّلِعُ عَلَيْهِمْ رَبُّ الْعَالَمِينَ فَيَقُولُ أَلاَ يَتْبَعُ كُلُّ إِنْسَانٍ مَا كَانُوا يَعْبُدُونَهُ ‏.‏ فَيُمَثَّلُ لِصَاحِبِ الصَّلِيبِ صَلِيبُهُ وَلِصَاحِبِ التَّصَاوِيرِ تَصَاوِيرُهُ وَلِصَاحِبِ النَّارِ نَارُهُ فَيَتْبَعُونَ مَا كَانُوا يَعْبُدُونَ وَيَبْقَى الْمُسْلِمُونَ فَيَطَّلِعُ عَلَيْهِمْ رَبُّ الْعَالَمِينَ فَيَقُولُ أَلاَ تَتَّبِعُونَ النَّاسَ فَيَقُولُونَ نَعُوذُ بِاللَّهِ مِنْكَ نَعُوذُ بِاللَّهِ مِنْكَ اللَّهُ رَبُّنَا هَذَا مَكَانُنَا حَتَّى نَرَى رَبَّنَا ‏.‏ وَهُوَ يَأْمُرُهُمْ وَيُثَبِّتُهُمْ ثُمَّ يَتَوَارَى ثُمَّ يَطَّلِعُ فَيَقُولُ أَلاَ تَتَّبِعُونَ النَّاسَ فَيَقُولُونَ نَعُوذُ بِاللَّهِ مِنْكَ نَعُوذُ بِاللَّهِ مِنْكَ اللَّهُ رَبُّنَا وَهَذَا مَكَانُنَا حَتَّى نَرَى رَبَّنَا ‏.‏ وَهُوَ يَأْمُرُهُمْ وَيُثَبِّتُهُمْ ‏\"‏ ‏.‏ قَالُوا وَهَلْ نَرَاهُ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ وَهَلْ تُضَارُّونَ فِي رُؤْيَةِ الْقَمَرِ لَيْلَةَ الْبَدْرِ ‏\"‏ ‏.‏ قَالُوا لاَ يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ فَإِنَّكُمْ لاَ تُضَارُّونَ فِي رُؤْيَتِهِ تِلْكَ السَّاعَةَ ثُمَّ يَتَوَارَى ثُمَّ يَطَّلِعُ فَيُعَرِّفُهُمْ نَفْسَهُ ثُمَّ يَقُولُ أَنَا رَبُّكُمْ فَاتَّبِعُونِي ‏.‏ فَيَقُومُ الْمُسْلِمُونَ وَيُوضَعُ الصِّرَاطُ فَيَمُرُّونَ عَلَيْهِ مِثْلَ جِيَادِ الْخَيْلِ وَالرِّكَابِ وَقَوْلُهُمْ عَلَيْهِ سَلِّمْ سَلِّمْ ‏.‏ وَيَبْقَى أَهْلُ النَّارِ فَيُطْرَحُ مِنْهُمْ فِيهَا فَوْجٌ ثُمَّ يُقَالُ هَلِ امْتَلأْتِ فَتَقُولُ هَلْ مِنْ مَزِيدٍ ‏.‏ ثُمَّ يُطْرَحُ فِيهَا فَوْجٌ فَيُقَالُ هَلِ امْتَلأْتِ ‏.‏ فَتَقُولُ هَلْ مِنْ مَزِيدٍ ‏.‏ حَتَّى إِذَا أُوعِبُوا فِيهَا وَضَعَ الرَّحْمَنُ قَدَمَهُ فِيهَا وَأُزْوِيَ بَعْضُهَا إِلَى بَعْضٍ ثُمَّ قَالَ قَطْ قَالَتْ قَطْ قَطْ فَإِذَا أَدْخَلَ اللَّهُ أَهْلَ الْجَنَّةِ الْجَنَّةَ وَأَهْلَ النَّارِ النَّارَ قَالَ أُتِيَ بِالْمَوْتِ مُلَبَّبًا فَيُوقَفُ عَلَى السُّورِ الَّذِي بَيْنَ أَهْلِ الْجَنَّةِ وَأَهْلِ النَّارِ ثُمَّ يُقَالُ يَا أَهْلَ الْجَنَّةِ ‏.‏ فَيَطَّلِعُونَ خَائِفِينَ ثُمَّ يُقَالُ يَا أَهْلَ النَّارِ ‏.‏ فَيَطَّلِعُونَ مُسْتَبْشِرِينَ يَرْجُونَ الشَّفَاعَةَ فَيُقَالُ لأَهْلِ الْجَنَّةِ وَأَهْلِ النَّارِ هَلْ تَعْرِفُونَ هَذَا فَيَقُولُونَ هَؤُلاَءِ وَهَؤُلاَءِ قَدْ عَرَفْنَاهُ هُوَ الْمَوْتُ الَّذِي وُكِّلَ بِنَا ‏.‏ فَيُضْجَعُ فَيُذْبَحُ ذَبْحًا عَلَى السُّورِ الَّذِي بَيْنَ الْجَنَّةِ وَالنَّارِ ثُمَّ يُقَالُ يَا أَهْلَ الْجَنَّةِ خُلُودٌ لاَ مَوْتَ وَيَا أَهْلَ النَّارِ خُلُودٌ لاَ مَوْتَ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ - وَقَدْ رُوِيَ عَنِ النَّبِيِّ صلى الله عليه وسلم رِوَايَاتٌ كَثِيرَةٌ مِثْلُ هَذَا مَا يُذْكَرُ فِيهِ أَمْرُ الرُّؤْيَةِ أَنَّ النَّاسَ يَرَوْنَ رَبَّهُمْ وَذِكْرُ الْقَدَمِ وَمَا أَشْبَهَ هَذِهِ الأَشْيَاءَ وَالْمَذْهَبُ فِي هَذَا عِنْدَ أَهْلِ الْعِلْمِ مِنَ الأَئِمَّةِ مِثْلِ سُفْيَانَ الثَّوْرِيِّ وَمَالِكِ بْنِ أَنَسٍ وَابْنِ الْمُبَارَكِ وَابْنِ عُيَيْنَةَ وَوَكِيعٍ وَغَيْرِهِمْ أَنَّهُمْ رَوَوْا هَذِهِ الأَشْيَاءَ ثُمَّ قَالُوا تُرْوَى هَذِهِ الأَحَادِيثُ وَنُؤْمِنُ بِهَا وَلاَ يُقَالُ كَيْفَ وَهَذَا الَّذِي اخْتَارَهُ أَهْلُ الْحَدِيثِ أَنْ تُرْوَى هَذِهِ الأَشْيَاءُ كَمَا جَاءَتْ وَيُؤْمَنُ بِهَا وَلاَ تُفَسَّرُ وَلاَ تُتَوَهَّمُ وَلاَ يُقَالُ كَيْفَ وَهَذَا أَمْرُ أَهْلِ الْعِلْمِ الَّذِي اخْتَارُوهُ وَذَهَبُوا إِلَيْهِ ‏.‏ وَمَعْنَى قَوْلِهِ فِي الْحَدِيثِ ‏\"‏ فَيُعَرِّفُهُمْ نَفْسَهُ ‏\"‏ ‏.‏ يَعْنِي يَتَجَلَّى لَهُمْ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 35
			}
		}
	]
}