{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"2": "The Book on Salat (Prayer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 256,
			"arabicnumber": 256,
			"text": "قَالَ أَبُو عِيسَى حَدَّثَنَا الْفَضْلُ بْنُ الصَّبَّاحِ الْبَغْدَادِيُّ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، حَدَّثَنَا الزُّهْرِيُّ، بِهَذَا الإِسْنَادِ نَحْوَ حَدِيثِ ابْنِ أَبِي عُمَرَ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عُمَرَ، وَعَلِيٍّ، وَوَائِلِ بْنِ حُجْرٍ، وَمَالِكِ بْنِ الْحُوَيْرِثِ، وَأَنَسٍ، وَأَبِي، هُرَيْرَةَ وَأَبِي حُمَيْدٍ وَأَبِي أُسَيْدٍ وَسَهْلِ بْنِ سَعْدٍ وَمُحَمَّدِ بْنِ مَسْلَمَةَ وَأَبِي قَتَادَةَ وَأَبِي مُوسَى الأَشْعَرِيِّ وَجَابِرٍ وَعُمَيْرٍ اللَّيْثِيِّ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عُمَرَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَبِهَذَا يَقُولُ بَعْضُ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم مِنْهُمُ ابْنُ عُمَرَ وَجَابِرُ بْنُ عَبْدِ اللَّهِ وَأَبُو هُرَيْرَةَ وَأَنَسٌ وَابْنُ عَبَّاسٍ وَعَبْدُ اللَّهِ بْنُ الزُّبَيْرِ وَغَيْرُهُمْ وَمِنَ التَّابِعِينَ الْحَسَنُ الْبَصْرِيُّ وَعَطَاءٌ وَطَاوُسٌ وَمُجَاهِدٌ وَنَافِعٌ وَسَالِمُ بْنُ عَبْدِ اللَّهِ وَسَعِيدُ بْنُ جُبَيْرٍ وَغَيْرُهُمْ ‏.‏ وَبِهِ يَقُولُ مَالِكٌ وَمَعْمَرٌ وَالأَوْزَاعِيُّ وَابْنُ عُيَيْنَةَ وَعَبْدُ اللَّهِ بْنُ الْمُبَارَكِ وَالشَّافِعِيُّ وَأَحْمَدُ وَإِسْحَاقُ ‏.‏ وَقَالَ عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ قَدْ ثَبَتَ حَدِيثُ مَنْ يَرْفَعُ يَدَيْهِ وَذَكَرَ حَدِيثَ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ وَلَمْ يَثْبُتْ حَدِيثُ ابْنِ مَسْعُودٍ أَنَّ النَّبِيَّ صلى الله عليه وسلم لَمْ يَرْفَعْ يَدَيْهِ إِلاَّ فِي أَوَّلِ مَرَّةٍ ‏.‏ حَدَّثَنَا بِذَلِكَ أَحْمَدُ بْنُ عَبْدَةَ الآمُلِيُّ حَدَّثَنَا وَهْبُ بْنُ زَمْعَةَ عَنْ سُفْيَانَ بْنِ عَبْدِ الْمَلِكِ عَنْ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ ‏.‏ قَالَ وَحَدَّثَنَا يَحْيَى بْنُ مُوسَى قَالَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ قَالَ كَانَ مَالِكُ بْنُ أَنَسٍ يَرَى رَفْعَ الْيَدَيْنِ فِي الصَّلاَةِ ‏.‏ وَقَالَ يَحْيَى وَحَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ كَانَ مَعْمَرٌ يَرَى رَفْعَ الْيَدَيْنِ فِي الصَّلاَةِ ‏.‏ وَسَمِعْتُ الْجَارُودَ بْنَ مُعَاذٍ يَقُولُ كَانَ سُفْيَانُ بْنُ عُيَيْنَةَ وَعُمَرُ بْنُ هَارُونَ وَالنَّضْرُ بْنُ شُمَيْلٍ يَرْفَعُونَ أَيْدِيَهُمْ إِذَا افْتَتَحُوا الصَّلاَةَ وَإِذَا رَكَعُوا وَإِذَا رَفَعُوا رُءُوسَهُمْ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 108
			}
		}
	]
}