{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"44": "Chapters on Parables"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2863,
			"arabicnumber": 2863,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ، قَالَ‏ حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ‏ حَدَّثَنَا أَبَانُ بْنُ يَزِيدَ، قَالَ‏ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ، عَنْ زَيْدِ بْنِ سَلاَّمٍ، أَنَّ أَبَا سَلاَّمٍ، حَدَّثَهُ أَنَّ الْحَارِثَ الأَشْعَرِيَّ حَدَّثَهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ اللَّهَ أَمَرَ يَحْيَى بْنَ زَكَرِيَّا بِخَمْسِ كَلِمَاتٍ أَنْ يَعْمَلَ بِهَا وَيَأْمُرَ بَنِي إِسْرَائِيلَ أَنْ يَعْمَلُوا بِهَا وَإِنَّهُ كَادَ أَنْ يُبْطِئَ بِهَا فَقَالَ عِيسَى إِنَّ اللَّهَ أَمَرَكَ بِخَمْسِ كَلِمَاتٍ لِتَعْمَلَ بِهَا وَتَأْمُرَ بَنِي إِسْرَائِيلَ أَنْ يَعْمَلُوا بِهَا فَإِمَّا أَنْ تَأْمُرَهُمْ وَإِمَّا أَنَا آمُرُهُمْ ‏.‏ فَقَالَ يَحْيَى أَخْشَى إِنْ سَبَقْتَنِي بِهَا أَنْ يُخْسَفَ بِي أَوْ أُعَذَّبَ فَجَمَعَ النَّاسَ فِي بَيْتِ الْمَقْدِسِ فَامْتَلأَ الْمَسْجِدُ وَقَعَدُوا عَلَى الشُّرَفِ فَقَالَ إِنَّ اللَّهَ أَمَرَنِي بِخَمْسِ كَلِمَاتٍ أَنْ أَعْمَلَ بِهِنَّ وَآمُرَكُمْ أَنْ تَعْمَلُوا بِهِنَّ أَوَّلُهُنَّ أَنْ تَعْبُدُوا اللَّهَ وَلاَ تُشْرِكُوا بِهِ شَيْئًا وَإِنَّ مَثَلَ مَنْ أَشْرَكَ بِاللَّهِ كَمَثَلِ رَجُلٍ اشْتَرَى عَبْدًا مِنْ خَالِصِ مَالِهِ بِذَهَبٍ أَوْ وَرِقٍ فَقَالَ هَذِهِ دَارِي وَهَذَا عَمَلِي فَاعْمَلْ وَأَدِّ إِلَىَّ فَكَانَ يَعْمَلُ وَيُؤَدِّي إِلَى غَيْرِ سَيِّدِهِ فَأَيُّكُمْ يَرْضَى أَنْ يَكُونَ عَبْدُهُ كَذَلِكَ وَإِنَّ اللَّهَ أَمَرَكُمْ بِالصَّلاَةِ فَإِذَا صَلَّيْتُمْ فَلاَ تَلْتَفِتُوا فَإِنَّ اللَّهَ يَنْصِبُ وَجْهَهُ لِوَجْهِ عَبْدِهِ فِي صَلاَتِهِ مَا لَمْ يَلْتَفِتْ وَآمُرُكُمْ بِالصِّيَامِ فَإِنَّ مَثَلَ ذَلِكَ كَمَثَلِ رَجُلٍ فِي عِصَابَةٍ مَعَهُ صُرَّةٌ فِيهَا مِسْكٌ فَكُلُّهُمْ يَعْجَبُ أَوْ يُعْجِبُهُ رِيحُهَا وَإِنَّ رِيحَ الصَّائِمِ أَطْيَبُ عِنْدَ اللَّهِ مِنْ رِيحِ الْمِسْكِ وَآمُرُكُمْ بِالصَّدَقَةِ فَإِنَّ مَثَلَ ذَلِكَ كَمَثَلِ رَجُلٍ أَسَرَهُ الْعَدُوُّ فَأَوْثَقُوا يَدَهُ إِلَى عُنُقِهِ وَقَدَّمُوهُ لِيَضْرِبُوا عُنُقَهُ فَقَالَ أَنَا أَفْدِيهِ مِنْكُمْ بِالْقَلِيلِ وَالْكَثِيرِ ‏.‏ فَفَدَى نَفْسَهُ مِنْهُمْ وَآمُرُكُمْ أَنْ تَذْكُرُوا اللَّهَ فَإِنَّ مَثَلَ ذَلِكَ كَمَثَلِ رَجُلٍ خَرَجَ الْعَدُوُّ فِي أَثَرِهِ سِرَاعًا حَتَّى إِذَا أَتَى عَلَى حِصْنٍ حَصِينٍ فَأَحْرَزَ نَفْسَهُ مِنْهُمْ كَذَلِكَ الْعَبْدُ لاَ يُحْرِزُ نَفْسَهُ مِنَ الشَّيْطَانِ إِلاَّ بِذِكْرِ اللَّهِ ‏\"‏ ‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ وَأَنَا آمُرُكُمْ بِخَمْسٍ اللَّهُ أَمَرَنِي بِهِنَّ السَّمْعُ وَالطَّاعَةُ وَالْجِهَادُ وَالْهِجْرَةُ وَالْجَمَاعَةُ فَإِنَّهُ مَنْ فَارَقَ الْجَمَاعَةَ قِيدَ شِبْرٍ فَقَدْ خَلَعَ رِبْقَةَ الإِسْلاَمِ مِنْ عُنُقِهِ إِلاَّ أَنْ يَرْجِعَ وَمَنِ ادَّعَى دَعْوَى الْجَاهِلِيَّةِ فَإِنَّهُ مِنْ جُثَا جَهَنَّمَ ‏\"‏ ‏.‏ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ وَإِنْ صَلَّى وَصَامَ قَالَ ‏\"‏ وَإِنْ صَلَّى وَصَامَ فَادْعُوا بِدَعْوَى اللَّهِ الَّذِي سَمَّاكُمُ الْمُسْلِمِينَ الْمُؤْمِنِينَ عِبَادَ اللَّهِ ‏\"‏ ‏.‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ ‏.‏ قَالَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ الْحَارِثُ الأَشْعَرِيُّ لَهُ صُحْبَةٌ وَلَهُ غَيْرُ هَذَا الْحَدِيثِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 44,
				"hadith": 5
			}
		}
	]
}