{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2972,
			"arabicnumber": 2972,
			"text": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، حَدَّثَنَا الضَّحَّاكُ بْنُ مَخْلَدٍ أَبُو عَاصِمٍ النَّبِيلُ، عَنْ حَيْوَةَ بْنِ شُرَيْحٍ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ أَسْلَمَ أَبِي عِمْرَانَ التُّجِيبِيِّ، قَالَ كُنَّا بِمَدِينَةِ الرُّومِ فَأَخْرَجُوا إِلَيْنَا صَفًّا عَظِيمًا مِنَ الرُّومِ فَخَرَجَ إِلَيْهِمْ مِنَ الْمُسْلِمِينَ مِثْلُهُمْ أَوْ أَكْثَرُ وَعَلَى أَهْلِ مِصْرَ عُقْبَةُ بْنُ عَامِرٍ وَعَلَى الْجَمَاعَةِ فَضَالَةُ بْنُ عُبَيْدٍ فَحَمَلَ رَجُلٌ مِنَ الْمُسْلِمِينَ عَلَى صَفِّ الرُّومِ حَتَّى دَخَلَ فِيهِمْ فَصَاحَ النَّاسُ وَقَالُوا سُبْحَانَ اللَّهِ يُلْقِي بِيَدَيْهِ إِلَى التَّهْلُكَةِ فَقَامَ أَبُو أَيُّوبَ الأَنْصَارِيُّ فَقَالَ يَا أَيُّهَا النَّاسُ إِنَّكُمْ تَتَأَوَّلُونَ هَذِهِ الآيَةَ هَذَا التَّأْوِيلَ وَإِنَّمَا نَزَلَتْ هَذِهِ الآيَةُ فِينَا مَعْشَرَ الأَنْصَارِ لَمَّا أَعَزَّ اللَّهُ الإِسْلاَمَ وَكَثُرَ نَاصِرُوهُ فَقَالَ بَعْضُنَا لِبَعْضٍ سِرًّا دُونَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِنَّ أَمْوَالَنَا قَدْ ضَاعَتْ وَإِنَّ اللَّهَ قَدْ أَعَزَّ الإِسْلاَمَ وَكَثُرَ نَاصِرُوهُ فَلَوْ أَقَمْنَا فِي أَمْوَالِنَا فَأَصْلَحْنَا مَا ضَاعَ مِنْهَا ‏.‏ فَأَنْزَلَ اللَّهُ عَلَى نَبِيِّهِ صلى الله عليه وسلم يَرُدُّ عَلَيْنَا مَا قُلْنَا‏:‏ ‏(‏وَأَنْفِقُوا فِي سَبِيلِ اللَّهِ وَلاَ تُلْقُوا بِأَيْدِيكُمْ إِلَى التَّهْلُكَةِ ‏)‏ فَكَانَتِ التَّهْلُكَةُ الإِقَامَةَ عَلَى الأَمْوَالِ وَإِصْلاَحَهَا وَتَرَكْنَا الْغَزْوَ فَمَا زَالَ أَبُو أَيُّوبَ شَاخِصًا فِي سَبِيلِ اللَّهِ حَتَّى دُفِنَ بِأَرْضِ الرُّومِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 24
			}
		}
	]
}