{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"2": "The Book on Salat (Prayer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 303,
			"arabicnumber": 303,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ، أَخْبَرَنِي سَعِيدُ بْنُ أَبِي سَعِيدٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم دَخَلَ الْمَسْجِدَ فَدَخَلَ رَجُلٌ فَصَلَّى ثُمَّ جَاءَ فَسَلَّمَ عَلَى النَّبِيِّ صلى الله عليه وسلم فَرَدَّ عَلَيْهِ السَّلاَمَ فَقَالَ ‏\"‏ ارْجِعْ فَصَلِّ فَإِنَّكَ لَمْ تُصَلِّ ‏\"‏ ‏.‏ فَرَجَعَ الرَّجُلُ فَصَلَّى كَمَا كَانَ صَلَّى ثُمَّ جَاءَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَسَلَّمَ عَلَيْهِ فَرَدَّ عَلَيْهِ السَّلاَمَ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ ارْجِعْ فَصَلِّ فَإِنَّكَ لَمْ تُصَلِّ ‏\"‏ ‏.‏ حَتَّى فَعَلَ ذَلِكَ ثَلاَثَ مِرَارٍ فَقَالَ لَهُ الرَّجُلُ وَالَّذِي بَعَثَكَ بِالْحَقِّ مَا أُحْسِنُ غَيْرَ هَذَا فَعَلِّمْنِي ‏.‏ فَقَالَ ‏\"‏ إِذَا قُمْتَ إِلَى الصَّلاَةِ فَكَبِّرْ ثُمَّ اقْرَأْ بِمَا تَيَسَّرَ مَعَكَ مِنَ الْقُرْآنِ ثُمَّ ارْكَعْ حَتَّى تَطْمَئِنَّ رَاكِعًا ثُمَّ ارْفَعْ حَتَّى تَعْتَدِلَ قَائِمًا ثُمَّ اسْجُدْ حَتَّى تَطْمَئِنَّ سَاجِدًا ثُمَّ ارْفَعْ حَتَّى تَطْمَئِنَّ جَالِسًا وَافْعَلْ ذَلِكَ فِي صَلاَتِكَ كُلِّهَا ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ قَالَ وَقَدْ رَوَى ابْنُ نُمَيْرٍ هَذَا الْحَدِيثَ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ وَلَمْ يَذْكُرْ فِيهِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ ‏.‏ وَرِوَايَةُ يَحْيَى بْنِ سَعِيدٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ أَصَحُّ ‏.‏ وَسَعِيدٌ الْمَقْبُرِيُّ قَدْ سَمِعَ مِنْ أَبِي هُرَيْرَةَ وَرَوَى عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ وَأَبُو سَعِيدٍ الْمَقْبُرِيُّ اسْمُهُ كَيْسَانُ وَسَعِيدٌ الْمَقْبُرِيُّ يُكْنَى أَبَا سَعْدٍ وَكَيْسَانُ عَبْدٌ كَانَ مُكَاتَبًا لِبَعْضِهِمْ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 155
			}
		}
	]
}