{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3039,
			"arabicnumber": 3039,
			"text": "حَدَّثَنَا يَحْيَى بْنُ مُوسَى، وَعَبْدُ بْنُ حُمَيْدٍ، قَالاَ حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، عَنْ مُوسَى بْنِ عُبَيْدَةَ، أَخْبَرَنِي مَوْلَى ابْنِ سَبَّاعٍ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ، يُحَدِّثُ عَنْ أَبِي بَكْرٍ الصِّدِّيقِ، قَالَ كُنْتُ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَأُنْزِلَتْ عَلَيْهِ هَذِهِ الآيَةُ ‏:‏ ‏(‏ مَنْ يَعْمَلْ سُوءًا يُجْزَ بِهِ وَلاَ يَجِدْ لَهُ مِنْ دُونِ اللَّهِ وَلِيًّا وَلاَ نَصِيرًا ‏)‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَا أَبَا بَكْرٍ أَلاَ أُقْرِئُكَ آيَةً أُنْزِلَتْ عَلَىَّ ‏\"‏ ‏.‏ قُلْتُ بَلَى يَا رَسُولَ اللَّهِ ‏.‏ قَالَ فَأَقْرَأَنِيهَا فَلاَ أَعْلَمُ إِلاَّ أَنِّي قَدْ كُنْتُ وَجَدْتُ انْقِصَامًا فِي ظَهْرِي فَتَمَطَّأْتُ لَهَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا شَأْنُكَ يَا أَبَا بَكْرٍ ‏\"‏ ‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ بِأَبِي أَنْتَ وَأُمِّي وَأَيُّنَا لَمْ يَعْمَلْ سُوءًا وَإِنَّا لَمَجْزِيُّونَ بِمَا عَمِلْنَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَمَّا أَنْتَ يَا أَبَا بَكْرٍ وَالْمُؤْمِنُونَ فَتُجْزَوْنَ بِذَلِكَ فِي الدُّنْيَا حَتَّى تَلْقَوُا اللَّهَ وَلَيْسَ لَكُمْ ذُنُوبٌ وَأَمَّا الآخَرُونَ فَيُجْمَعُ ذَلِكَ لَهُمْ حَتَّى يُجْزَوْا بِهِ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ وَفِي إِسْنَادِهِ مَقَالٌ ‏.‏ مُوسَى بْنُ عُبَيْدَةَ يُضَعَّفُ فِي الْحَدِيثِ ضَعَّفَهُ يَحْيَى بْنُ سَعِيدٍ وَأَحْمَدُ بْنُ حَنْبَلٍ وَمَوْلَى ابْنِ سَبَّاعٍ مَجْهُولٌ ‏.‏ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ مِنْ غَيْرِ هَذَا الْوَجْهِ عَنْ أَبِي بَكْرٍ وَلَيْسَ لَهُ إِسْنَادٌ صَحِيحٌ أَيْضًا ‏.‏ وَفِي الْبَابِ عَنْ عَائِشَةَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 91
			}
		}
	]
}