{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3068,
			"arabicnumber": 3068,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا إِسْحَاقُ بْنُ يُوسُفَ الأَزْرَقُ، حَدَّثَنَا دَاوُدُ بْنُ أَبِي هِنْدٍ، عَنِ الشَّعْبِيِّ، عَنْ مَسْرُوقٍ، قَالَ كُنْتُ مُتَّكِئًا عِنْدَ عَائِشَةَ فَقَالَتْ يَا أَبَا عَائِشَةَ ثَلاَثٌ مَنْ تَكَلَّمَ بِوَاحِدَةٍ مِنْهُنَّ فَقَدْ أَعْظَمَ عَلَى اللَّهِ الْفِرْيَةَ مَنْ زَعَمَ أَنَّ مُحَمَّدًا رَأَى رَبَّهُ فَقَدْ أَعْظَمَ الْفِرْيَةَ عَلَى اللَّهِ وَاللَّهُ يَقُولُ ‏:‏ ‏(‏ لَا تُدْرِكُهُ الأَبْصَارُ وَهُوَ يُدْرِكُ الأَبْصَارَ وَهُوَ اللَّطِيفُ الْخَبِيرُ ‏)‏ ، ‏(‏ مَا كَانَ لِبَشَرٍ أَنْ يُكَلِّمَهُ اللَّهُ إِلاَّ وَحْيًا أَوْ مِنْ وَرَاءِ حِجَابٍ ‏)‏ وَكُنْتُ مُتَّكِئًا فَجَلَسْتُ فَقُلْتُ يَا أُمَّ الْمُؤْمِنِينَ أَنْظِرِينِي وَلاَ تُعْجِلِينِي أَلَيْسَ يَقُولُ اللَّهُ ‏:‏ ‏(‏ وَلَقَدْ رَآهُ نَزْلَةً أُخْرَى ‏)‏، ‏(‏ وَلََقَدْ رَآهُ بِالأُفُقِ الْمُبِينِ ‏)‏ قَالَتْ أَنَا وَاللَّهِ أَوَّلُ مَنْ سَأَلَ عَنْ هَذَا رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّمَا ذَاكَ جِبْرِيلُ مَا رَأَيْتُهُ فِي الصُّورَةِ الَّتِي خُلِقَ فِيهَا غَيْرَ هَاتَيْنِ الْمَرَّتَيْنِ رَأَيْتُهُ مُنْهَبِطًا مِنَ السَّمَاءِ سَادًّا عِظَمُ خَلْقِهِ مَا بَيْنَ السَّمَاءِ وَالأَرْضِ ‏\"‏ ‏.‏ وَمَنْ زَعَمَ أَنَّ مُحَمَّدًا كَتَمَ شَيْئًا مِمَّا أَنْزَلَ اللَّهُ عَلَيْهِ فَقَدْ أَعْظَمَ الْفِرْيَةَ عَلَى اللَّهِ يَقُولُ اللَّهُ ‏:‏ ‏(‏ يَا أَيُّهَا الرَّسُولُ بَلِّغْ مَا أُنْزِلَ إِلَيْكَ مِنْ رَبِّكَ ‏)‏ وَمَنْ زَعَمَ أَنَّهُ يَعْلَمُ مَا فِي غَدٍ فَقَدْ أَعْظَمَ الْفِرْيَةَ عَلَى اللَّهِ وَاللَّهُ يَقُولُ ‏:‏ ‏(‏قُلْ لاَ يَعْلَمُ مَنْ فِي السَّمَوَاتِ وَالأَرْضِ الْغَيْبَ إِلاَّ اللَّهُ ‏)‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَمَسْرُوقُ بْنُ الأَجْدَعِ يُكْنَى أَبَا عَائِشَةَ وَهُوَ مَسْرُوقُ بْنُ عَبْدِ الرَّحْمَنِ وَهَكَذَا كَانَ اسْمُهُ فِي الدِّيوَانِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 120
			}
		}
	]
}