{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3086,
			"arabicnumber": 3086,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، وَمُحَمَّدُ بْنُ جَعْفَرٍ، وَابْنُ أَبِي عَدِيٍّ، وَسَهْلُ بْنُ يُوسُفَ، قَالُوا حَدَّثَنَا عَوْفُ بْنُ أَبِي جَمِيلَةَ، حَدَّثَنَا يَزِيدُ الْفَارِسِيُّ، حَدَّثَنَا ابْنُ عَبَّاسٍ، قَالَ قُلْتُ لِعُثْمَانَ بْنِ عَفَّانَ مَا حَمَلَكُمْ أَنْ عَمَدْتُمْ، إِلَى الأَنْفَالِ وَهِيَ مِنَ الْمَثَانِي وَإِلَى بَرَاءَةَ وَهِيَ مِنَ الْمِئِينَ فَقَرَنْتُمْ بَيْنَهُمَا وَلَمْ تَكْتُبُوا بَيْنَهُمَا سَطْرَ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ وَوَضَعْتُمُوهُمَا فِي السَّبْعِ الطُّوَلِ مَا حَمَلَكُمْ عَلَى ذَلِكَ فَقَالَ عُثْمَانُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِمَّا يَأْتِي عَلَيْهِ الزَّمَانُ وَهُوَ تَنْزِلُ عَلَيْهِ السُّوَرُ ذَوَاتُ الْعَدَدِ فَكَانَ إِذَا نَزَلَ عَلَيْهِ الشَّىْءُ دَعَا بَعْضَ مَنْ كَانَ يَكْتُبُ فَيَقُولُ ضَعُوا هَؤُلاَءِ الآيَاتِ فِي السُّورَةِ الَّتِي يُذْكَرُ فِيهَا كَذَا وَكَذَا وَإِذَا نَزَلَتْ عَلَيْهِ الآيَةُ فَيَقُولُ ضَعُوا هَذِهِ الآيَةَ فِي السُّورَةِ الَّتِي يُذْكَرُ فِيهَا كَذَا وَكَذَا وَكَانَتِ الأَنْفَالُ مِنْ أَوَائِلِ مَا أُنْزِلَتْ بِالْمَدِينَةِ وَكَانَتْ بَرَاءَةُ مِنْ آخِرِ الْقُرْآنِ وَكَانَتْ قِصَّتُهَا شَبِيهَةً بِقِصَّتِهَا فَظَنَنْتُ أَنَّهَا مِنْهَا فَقُبِضَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَلَمْ يُبَيِّنْ لَنَا أَنَّهَا مِنْهَا فَمِنْ أَجْلِ ذَلِكَ قَرَنْتُ بَيْنَهُمَا وَلَمْ أَكْتُبْ بَيْنَهُمَا سَطْرَ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ فَوَضَعْتُهَا فِي السَّبْعِ الطُّوَلِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ عَوْفٍ عَنْ يَزِيدَ الْفَارِسِيِّ عَنِ ابْنِ عَبَّاسٍ ‏.‏ وَيَزِيدُ الْفَارِسِيُّ قَدْ رَوَى عَنِ ابْنِ عَبَّاسٍ غَيْرَ حَدِيثٍ وَيُقَالُ هُوَ يَزِيدُ بْنُ هُرْمُزَ وَيَزِيدُ الرَّقَاشِيُّ هُوَ يَزِيدُ بْنُ أَبَانَ الرَّقَاشِيُّ وَلَمْ يُدْرِكِ ابْنَ عَبَّاسٍ إِنَّمَا رَوَى عَنْ أَنَسِ بْنِ مَالِكٍ وَكِلاَهُمَا مِنَ التَّابِعِينَ مِنْ أَهْلِ الْبَصْرَةِ وَيَزِيدُ الْفَارِسِيُّ أَقْدَمُ مِنْ يَزِيدَ الرَّقَاشِيِّ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 138
			}
		}
	]
}