{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3102,
			"arabicnumber": 3102,
			"text": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبِ بْنِ مَالِكٍ، عَنْ أَبِيهِ، قَالَ لَمْ أَتَخَلَّفْ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي غَزْوَةٍ غَزَاهَا حَتَّى كَانَتْ غَزْوَةُ تَبُوكَ إِلاَّ بَدْرًا وَلَمْ يُعَاتِبِ النَّبِيُّ صلى الله عليه وسلم أَحَدًا تَخَلَّفَ عَنْ بَدْرٍ إِنَّمَا خَرَجَ يُرِيدُ الْعِيرَ فَخَرَجَتْ قُرَيْشٌ مُغْوِثِينَ لِعِيرِهِمْ فَالْتَقَوْا عَنْ غَيْرِ مَوْعِدٍ كَمَا قَالَ اللَّهُ عَزَّ وَجَلَّ وَلَعَمْرِي إِنَّ أَشْرَفَ مَشَاهِدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي النَّاسِ لَبَدْرٌ وَمَا أُحِبُّ أَنِّي كُنْتُ شَهِدْتُهَا مَكَانَ بَيْعَتِي لَيْلَةَ الْعَقَبَةِ حَيْثُ تَوَاثَقْنَا عَلَى الإِسْلاَمِ ثُمَّ لَمْ أَتَخَلَّفْ بَعْدُ عَنِ النَّبِيِّ صلى الله عليه وسلم حَتَّى كَانَتْ غَزْوَةُ تَبُوكَ وَهِيَ آخِرُ غَزْوَةٍ غَزَاهَا وَآذَنَ النَّبِيُّ صلى الله عليه وسلم بِالرَّحِيلِ ‏.‏ فَذَكَرَ الْحَدِيثَ بِطُولِهِ قَالَ فَانْطَلَقْتُ إِلَى النَّبِيِّ صلى الله عليه وسلم فَإِذَا هُوَ جَالِسٌ فِي الْمَسْجِدِ وَحَوْلَهُ الْمُسْلِمُونَ وَهُوَ يَسْتَنِيرُ كَاسْتِنَارَةِ الْقَمَرِ وَكَانَ إِذَا سُرَّ بِالأَمْرِ اسْتَنَارَ فَجِئْتُ فَجَلَسْتُ بَيْنَ يَدَيْهِ فَقَالَ ‏\"‏ أَبْشِرْ يَا كَعْبُ بْنَ مَالِكٍ بِخَيْرِ يَوْمٍ أَتَى عَلَيْكَ مُنْذُ وَلَدَتْكَ أُمُّكَ ‏\"‏ ‏.‏ فَقُلْتُ يَا نَبِيَّ اللَّهِ أَمِنْ عِنْدِ اللَّهِ أَمْ مِنْ عِنْدِكَ قَالَ ‏\"‏ بَلْ مِنْ عِنْدِ اللَّهِ ‏\"‏ ‏.‏ ثُمَّ تَلاَ هَؤُلاَءِ الآيَاتِ ‏:‏ ‏(‏ لَقََدْ تَابَ اللَّهُ عَلَى النَّبِيِّ وَالْمُهَاجِرِينَ وَالأَنْصَارِ الَّذِينَ اتَّبَعُوهُ فِي سَاعَةِ الْعُسْرَةِ ‏)‏ حَتَّى بَلَغََّ اللَّهَ هُوَ التَّوَّابُ الرَّحِيمُ ‏)‏ قَالَ وَفِينَا أُنْزِلَتْ أَيْضًا ‏:‏ ‏(‏ اتَّقُوا اللَّهَ وَكُونُوا مَعَ الصَّادِقِينَ ‏)‏ قَالَ قُلْتُ يَا نَبِيَّ اللَّهِ إِنَّ مِنْ تَوْبَتِي أَنْ لاَ أُحَدِّثَ إِلاَّ صِدْقًا وَأَنْ أَنْخَلِعَ مِنْ مَالِي كُلِّهِ صَدَقَةً إِلَى اللَّهِ وَإِلَى رَسُولِهِ ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَمْسِكْ عَلَيْكَ بَعْضَ مَالِكَ فَهُوَ خَيْرٌ لَكَ ‏\"‏ ‏.‏ فَقُلْتُ فَإِنِّي أُمْسِكُ سَهْمِي الَّذِي بِخَيْبَرَ قَالَ فَمَا أَنْعَمَ اللَّهُ عَلَىَّ نِعْمَةً بَعْدَ الإِسْلاَمِ أَعْظَمَ فِي نَفْسِي مِنْ صِدْقِي رَسُولَ اللَّهِ صلى الله عليه وسلم حِينَ صَدَقْتُهُ أَنَا وَصَاحِبَاىَ لاَ نَكُونُ كَذَبْنَا فَهَلَكْنَا كَمَا هَلَكُوا وَإِنِّي لأَرْجُو أَنْ لاَ يَكُونَ اللَّهُ أَبْلَى أَحَدًا فِي الصِّدْقِ مِثْلَ الَّذِي أَبْلاَنِي مَا تَعَمَّدْتُ لِكَذِبَةٍ بَعْدُ وَإِنِّي لأَرْجُو أَنْ يَحْفَظَنِي اللَّهُ فِيمَا بَقِيَ ‏.‏ قَالَ وَقَدْ رُوِيَ عَنِ الزُّهْرِيِّ هَذَا الْحَدِيثُ بِخِلاَفِ هَذَا الإِسْنَادِ وَقَدْ قِيلَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍ عَنْ عَمِّهِ عُبَيْدِ اللَّهِ عَنْ كَعْبٍ وَقَدْ قِيلَ غَيْرُ هَذَا وَرَوَى يُونُسُ بْنُ يَزِيدَ هَذَا الْحَدِيثَ عَنِ الزُّهْرِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍ أَنَّ أَبَاهُ حَدَّثَهُ عَنْ كَعْبِ بْنِ مَالِكٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 154
			}
		}
	]
}