{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3103,
			"arabicnumber": 3103,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ بْنِ السَّبَّاقِ، أَنَّ زَيْدَ بْنَ ثَابِتٍ، حَدَّثَهُ قَالَ بَعَثَ إِلَىَّ أَبُو بَكْرٍ الصِّدِّيقُ مَقْتَلَ أَهْلِ الْيَمَامَةِ فَإِذَا عُمَرُ بْنُ الْخَطَّابِ عِنْدَهُ فَقَالَ إِنَّ عُمَرَ بْنَ الْخَطَّابِ قَدْ أَتَانِي فَقَالَ إِنَّ الْقَتْلَ قَدِ اسْتَحَرَّ بِقُرَّاءِ الْقُرْآنِ يَوْمَ الْيَمَامَةِ وَإِنِّي لأَخْشَى أَنْ يَسْتَحِرَّ الْقَتْلُ بِالْقُرَّاءِ فِي الْمَوَاطِنِ كُلِّهَا فَيَذْهَبَ قُرْآنٌ كَثِيرٌ وَإِنِّي أَرَى أَنْ تَأْمُرَ بِجَمْعِ الْقُرْآنِ ‏.‏ قَالَ أَبُو بَكْرٍ لِعُمَرَ كَيْفَ أَفْعَلُ شَيْئًا لَمْ يَفْعَلْهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ عُمَرُ هُوَ وَاللَّهِ خَيْرٌ فَلَمْ يَزَلْ يُرَاجِعُنِي فِي ذَلِكَ حَتَّى شَرَحَ اللَّهُ صَدْرِي لِلَّذِي شَرَحَ لَهُ صَدْرَ عُمَرَ وَرَأَيْتُ فِيهِ الَّذِي رَأَى قَالَ زَيْدٌ قَالَ أَبُو بَكْرٍ إِنَّكَ شَابٌّ عَاقِلٌ لاَ نَتَّهِمُكَ قَدْ كُنْتَ تَكْتُبُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم الْوَحْىَ فَتَتَبَّعِ الْقُرْآنَ ‏.‏ قَالَ فَوَاللَّهِ لَوْ كَلَّفُونِي نَقْلَ جَبَلٍ مِنَ الْجِبَالِ مَا كَانَ أَثْقَلَ عَلَىَّ مِنْ ذَلِكَ قَالَ قُلْتُ كَيْفَ تَفْعَلُونَ شَيْئًا لَمْ يَفْعَلْهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ أَبُو بَكْرٍ هُوَ وَاللَّهِ خَيْرٌ ‏.‏ فَلَمْ يَزَلْ يُرَاجِعُنِي فِي ذَلِكَ أَبُو بَكْرٍ وَعُمَرُ حَتَّى شَرَحَ اللَّهُ صَدْرِي لِلَّذِي شَرَحَ صَدْرَهُمَا صَدْرَ أَبِي بَكْرٍ وَعُمَرَ فَتَتَبَّعْتُ الْقُرْآنَ أَجْمَعُهُ مِنَ الرِّقَاعِ وَالْعُسُبِ وَاللِّخَافِ يَعْنِي الْحِجَارَةَ الرِّقَاقَ وَصُدُورِ الرِّجَالِ فَوَجَدْتُ آخِرَ سُورَةِ بَرَاءَةَ مَعَ خُزَيْمَةَ بْنِ ثَابِتٍ ‏:‏ ‏(‏ قَدْ جَاءَكُمْ رَسُولٌ مِنْ أَنْفُسِكُمْ عَزِيزٌ عَلَيْهِ مَا عَنِتُّمْ حَرِيصٌ عَلَيْكُمْ بِالْمُؤْمِنِينَ رَءُوفٌ رَحِيمٌ * فَإِنْ تَوَلَّوْا فَقُلْ حَسْبِيَ اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ ‏)‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 155
			}
		}
	]
}