{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3168,
			"arabicnumber": 3168,
			"text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ ابْنِ جُدْعَانَ، عَنِ الْحَسَنِ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم لَمَّا نَزَلَتْ ‏:‏ ‏(‏ يا أَيُّهَا النَّاسُ اتَّقُوا رَبَّكُمْ إِنَّ زَلْزَلَةَ السَّاعَةِ شَيْءٌ عَظِيمٌ ‏)‏ إِلَى قَوْلِهِ ‏:‏ ‏(‏ولَكِنَّ عَذَابَ اللَّهِ شَدِيدٌ ‏)‏ قَالَ أُنْزِلَتْ عَلَيْهِ هَذِهِ وَهُوَ فِي سَفَرٍ فَقَالَ ‏\"‏ أَتَدْرُونَ أَىُّ يَوْمٍ ذَلِكَ ‏\"‏ ‏.‏ فَقَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ ‏.‏ قَالَ ‏\"‏ ذَلِكَ يَوْمَ يَقُولُ اللَّهُ لآدَمَ ابْعَثْ بَعْثَ النَّارِ فَقَالَ يَا رَبِّ وَمَا بَعْثُ النَّارِ قَالَ تِسْعُمِائَةٍ وَتِسْعَةٌ وَتِسْعُونَ إِلَى النَّارِ وَوَاحِدٌ إِلَى الْجَنَّةِ ‏\"‏ ‏.‏ قَالَ فَأَنْشَأَ الْمُسْلِمُونَ يَبْكُونَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ قَارِبُوا وَسَدِّدُوا فَإِنَّهَا لَمْ تَكُنْ نُبُوَّةٌ قَطُّ إِلاَّ كَانَ بَيْنَ يَدَيْهَا جَاهِلِيَّةٌ قَالَ فَيُؤْخَذُ الْعَدَدُ مِنَ الْجَاهِلِيَّةِ فَإِنْ تَمَّتْ وَإِلاَّ كَمُلَتْ مِنَ الْمُنَافِقِينَ وَمَا مَثَلُكُمْ وَالأُمَمِ إِلاَّ كَمَثَلِ الرَّقْمَةِ فِي ذِرَاعِ الدَّابَّةِ أَوْ كَالشَّامَةِ فِي جَنْبِ الْبَعِيرِ ثُمَّ قَالَ إِنِّي لأَرْجُو أَنْ تَكُونُوا رُبُعَ أَهْلِ الْجَنَّةِ ‏\"‏ ‏.‏ فَكَبَّرُوا ثُمَّ قَالَ ‏\"‏ إِنِّي لأَرْجُو أَنْ تَكُونُوا ثُلُثَ أَهْلِ الْجَنَّةِ ‏\"‏ ‏.‏ فَكَبَّرُوا ثُمَّ قَالَ ‏\"‏ إِنِّي لأَرْجُو أَنْ تَكُونُوا نِصْفَ أَهْلِ الْجَنَّةِ ‏\"‏ ‏.‏ فَكَبَّرُوا قَالَ وَلاَ أَدْرِي قَالَ الثُّلُثَيْنِ أَمْ لاَ ‏.‏ قَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 220
			}
		}
	]
}