{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3298,
			"arabicnumber": 3298,
			"text": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، وَغَيْرُ، وَاحِدٍ، - الْمَعْنَى وَاحِدٌ قَالُوا حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ، حَدَّثَنَا شَيْبَانُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ قَتَادَةَ، حَدَّثَنَا الْحَسَنُ، عَنْ أَبِي هُرَيْرَةَ، قَالَ بَيْنَمَا نَبِيُّ اللَّهِ صلى الله عليه وسلم جَالِسٌ وَأَصْحَابُهُ إِذْ أَتَى عَلَيْهِمْ سَحَابٌ فَقَالَ نَبِيُّ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَلْ تَدْرُونَ مَا هَذَا ‏\"‏ ‏.‏ فَقَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ ‏.‏ قَالَ ‏\"‏ هَذَا الْعَنَانُ هَذِهِ رَوَايَا الأَرْضِ يَسُوقُهُ اللَّهُ تَبَارَكَ وَتَعَالَى إِلَى قَوْمٍ لاَ يَشْكُرُونَهُ وَلاَ يَدْعُونَهُ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ هَلْ تَدْرُونَ مَا فَوْقَكُمْ ‏\"‏ ‏.‏ قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ ‏.‏ قَالَ ‏\"‏ فَإِنَّهَا الرَّقِيعُ سَقْفٌ مَحْفُوظٌ وَمَوْجٌ مَكْفُوفٌ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ هَلْ تَدْرُونَ كَمْ بَيْنَكُمْ وَبَيْنَهَا ‏\"‏ ‏.‏ قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ ‏.‏ قَالَ ‏\"‏ بَيْنَكُمْ وَبَيْنَهَا مَسِيرَةُ خَمْسِمِائَةِ سَنَةٍ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ هَلْ تَدْرُونَ مَا فَوْقَ ذَلِكَ ‏\"‏ ‏.‏ قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ ‏.‏ قَالَ ‏\"‏ فَإِنَّ فَوْقَ ذَلِكَ سَمَاءَيْنِ وَمَا بَيْنَهُمَا مَسِيرَةُ خَمْسِمِائَةِ عَامٍ ‏\"‏ ‏.‏ حَتَّى عَدَّ سَبْعَ سَمَوَاتٍ مَا بَيْنَ كُلِّ سَمَاءَيْنِ كَمَا بَيْنَ السَّمَاءِ وَالأَرْضِ ‏.‏ ثُمَّ قَالَ ‏\"‏ هَلْ تَدْرُونَ مَا فَوْقَ ذَلِكَ ‏\"‏ ‏.‏ قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ ‏.‏ قَالَ ‏\"‏ فَإِنَّ فَوْقَ ذَلِكَ الْعَرْشَ وَبَيْنَهُ وَبَيْنَ السَّمَاءِ بُعْدُ مَا بَيْنَ السَّمَاءَيْنِ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ هَلْ تَدْرُونَ مَا الَّذِي تَحْتَكُمْ ‏\"‏ ‏.‏ قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ ‏.‏ قَالَ ‏\"‏ فَإِنَّهَا الأَرْضُ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ هَلْ تَدْرُونَ مَا الَّذِي تَحْتَ ذَلِكَ ‏\"‏ ‏.‏ قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ ‏.‏ قَالَ ‏\"‏ فَإِنَّ تَحْتَهَا الأَرْضَ الأُخْرَى بَيْنَهُمَا مَسِيرَةُ خَمْسِمِائَةِ سَنَةٍ ‏\"‏ ‏.‏ حَتَّى عَدَّ سَبْعَ أَرَضِينَ بَيْنَ كُلِّ أَرْضَيْنِ مَسِيرَةُ خَمْسِمِائَةِ سَنَةٍ ثُمَّ قَالَ ‏\"‏ وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَوْ أَنَّكُمْ دَلَّيْتُمْ رَجُلاً بِحَبْلٍ إِلَى الأَرْضِ السُّفْلَى لَهَبَطَ عَلَى اللَّهِ ‏\"‏ ‏.‏ ثُمَّ قَرَأََ ‏(‏ هو الأَوَّلُ وَالآخِرُ وَالظَّاهِرُ وَالْبَاطِنُ وَهُوَ بِكُلِّ شَيْءٍ عَلِيمٌ ‏)‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ ‏.‏ قَالَ وَيُرْوَى عَنْ أَيُّوبَ وَيُونُسَ بْنِ عُبَيْدٍ وَعَلِيِّ بْنِ زَيْدٍ قَالُوا لَمْ يَسْمَعِ الْحَسَنُ مِنْ أَبِي هُرَيْرَةَ ‏.‏ وَفَسَّرَ بَعْضُ أَهْلِ الْعِلْمِ هَذَا الْحَدِيثَ فَقَالُوا إِنَّمَا هَبَطَ عَلَى عِلْمِ اللَّهِ وَقُدْرَتِهِ وَسُلْطَانِهِ ‏.‏ عِلْمُ اللَّهِ وَقُدْرَتُهُ وَسُلْطَانُهُ فِي كُلِّ مَكَانٍ وَهُوَ عَلَى الْعَرْشِ كَمَا وَصَفَ فِي كِتَابِهِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 350
			}
		}
	]
}