{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"48": "Chapters on Supplication"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3570,
			"arabicnumber": 3570,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ الْحَسَنِ، حَدَّثَنَا سُلَيْمَانُ بْنُ عَبْدِ الرَّحْمَنِ الدِّمَشْقِيُّ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا ابْنُ جُرَيْجٍ، عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ، وَعِكْرِمَةَ، مَوْلَى ابْنِ عَبَّاسٍ عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ قَالَ بَيْنَمَا نَحْنُ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِذْ جَاءَهُ عَلِيُّ بْنُ أَبِي طَالِبٍ فَقَالَ بِأَبِي أَنْتَ وَأُمِّي تَفَلَّتَ هَذَا الْقُرْآنُ مِنْ صَدْرِي فَمَا أَجِدُنِي أَقْدِرُ عَلَيْهِ ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَا أَبَا الْحَسَنِ أَفَلاَ أُعَلِّمُكَ كَلِمَاتٍ يَنْفَعُكَ اللَّهُ بِهِنَّ وَيَنْفَعُ بِهِنَّ مَنْ عَلَّمْتَهُ وَيُثَبِّتُ مَا تَعَلَّمْتَ فِي صَدْرِكَ ‏\"‏ ‏.‏ قَالَ أَجَلْ يَا رَسُولَ اللَّهِ فَعَلِّمْنِي ‏.‏ قَالَ ‏\"‏ إِذَا كَانَ لَيْلَةُ الْجُمُعَةِ فَإِنِ اسْتَطَعْتَ أَنْ تَقُومَ فِي ثُلُثِ اللَّيْلِ الآخِرِ فَإِنَّهَا سَاعَةٌ مَشْهُودَةٌ وَالدُّعَاءُ فِيهَا مُسْتَجَابٌ وَقَدْ قَالَ أَخِي يَعْقُوبُ لِبَنِيهِ ‏:‏ ‏(‏سوْفَ أَسْتَغْفِرُ لَكُمْ رَبِّي ‏)‏ يَقُولُ حَتَّى تَأْتِيَ لَيْلَةُ الْجُمُعَةِ فَإِنْ لَمْ تَسْتَطِعْ فَقُمْ فِي وَسَطِهَا فَإِنْ لَمْ تَسْتَطِعْ فَقُمْ فِي أَوَّلِهَا فَصَلِّ أَرْبَعَ رَكَعَاتٍ تَقْرَأُ فِي الرَّكْعَةِ الأُولَى بِفَاتِحَةِ الْكِتَابِ وَسُورَةِ يس وَفِي الرَّكْعَةِ الثَّانِيَةِ بِفَاتِحَةِ الْكِتَابِ وَ‏(‏ حم ‏)‏ الدُّخَانَ وَفِي الرَّكْعَةِ الثَّالِثَةِ بِفَاتِحَةِ الْكِتَابِ وَالم تَنْزِيلُ السَّجْدَةَ وَفِي الرَّكْعَةِ الرَّابِعَةِ بِفَاتِحَةِ الْكِتَابِ وَتَبَارَكَ الْمُفَصَّلَ فَإِذَا فَرَغْتَ مِنَ التَّشَهُّدِ فَاحْمَدِ اللَّهَ وَأَحْسِنِ الثَّنَاءَ عَلَى اللَّهِ وَصَلِّ عَلَىَّ وَأَحْسِنْ وَعَلَى سَائِرِ النَّبِيِّينَ وَاسْتَغْفِرْ لِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ وَلإِخْوَانِكَ الَّذِينَ سَبَقُوكَ بِالإِيمَانِ ثُمَّ قُلْ فِي آخِرِ ذَلِكَ اللَّهُمَّ ارْحَمْنِي بِتَرْكِ الْمَعَاصِي أَبَدًا مَا أَبْقَيْتَنِي وَارْحَمْنِي أَنْ أَتَكَلَّفَ مَا لاَ يَعْنِينِي وَارْزُقْنِي حُسْنَ النَّظَرِ فِيمَا يُرْضِيكَ عَنِّي اللَّهُمَّ بَدِيعَ السَّمَوَاتِ وَالأَرْضِ ذَا الْجَلاَلِ وَالإِكْرَامِ وَالْعِزَّةِ الَّتِي لاَ تُرَامُ أَسْأَلُكَ يَا اللَّهُ يَا رَحْمَنُ بِجَلاَلِكَ وَنُورِ وَجْهِكَ أَنْ تُلْزِمَ قَلْبِي حِفْظَ كِتَابِكَ كَمَا عَلَّمْتَنِي وَارْزُقْنِي أَنْ أَتْلُوَهُ عَلَى النَّحْوِ الَّذِي يُرْضِيكَ عَنِّي اللَّهُمَّ بَدِيعَ السَّمَوَاتِ وَالأَرْضِ ذَا الْجَلاَلِ وَالإِكْرَامِ وَالْعِزَّةِ الَّتِي لاَ تُرَامُ أَسْأَلُكَ يَا اللَّهُ يَا رَحْمَنُ بِجَلاَلِكَ وَنُورِ وَجْهِكَ أَنْ تُنَوِّرَ بِكِتَابِكَ بَصَرِي وَأَنْ تُطْلِقَ بِهِ لِسَانِي وَأَنْ تُفَرِّجَ بِهِ عَنْ قَلْبِي وَأَنْ تَشْرَحَ بِهِ صَدْرِي وَأَنْ تَغْسِلَ بِهِ بَدَنِي لأَنَّهُ لاَ يُعِينُنِي عَلَى الْحَقِّ غَيْرُكَ وَلاَ يُؤْتِيهِ إِلاَّ أَنْتَ وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ الْعَلِيِّ الْعَظِيمِ يَا أَبَا الْحَسَنِ تَفْعَلُ ذَلِكَ ثَلاَثَ جُمَعٍ أَوْ خَمْسَ أَوْ سَبْعَ تُجَابُ بِإِذْنِ اللَّهِ وَالَّذِي بَعَثَنِي بِالْحَقِّ مَا أَخْطَأَ مُؤْمِنًا قَطُّ ‏\"‏ ‏.‏ قَالَ عَبْدُ اللَّهِ بْنُ عَبَّاسٍ فَوَاللَّهِ مَا لَبِثَ عَلِيٌّ إِلاَّ خَمْسًا أَوْ سَبْعًا حَتَّى جَاءَ عَلِيٌّ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي مِثْلِ ذَلِكَ الْمَجْلِسِ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي كُنْتُ فِيمَا خَلاَ لاَ آخُذُ إِلاَّ أَرْبَعَ آيَاتٍ أَوْ نَحْوَهُنَّ وَإِذَا قَرَأْتُهُنَّ عَلَى نَفْسِي تَفَلَّتْنَ وَأَنَا أَتَعَلَّمُ الْيَوْمَ أَرْبَعِينَ آيَةً أَوْ نَحْوَهَا وَإِذَا قَرَأْتُهَا عَلَى نَفْسِي فَكَأَنَّمَا كِتَابُ اللَّهِ بَيْنَ عَيْنَىَّ وَلَقَدْ كُنْتُ أَسْمَعُ الْحَدِيثَ فَإِذَا رَدَّدْتُهُ تَفَلَّتَ وَأَنَا الْيَوْمَ أَسْمَعُ الأَحَادِيثَ فَإِذَا تَحَدَّثْتُ بِهَا لَمْ أَخْرِمْ مِنْهَا حَرْفًا ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم عِنْدَ ذَلِكَ ‏\"‏ مُؤْمِنٌ وَرَبِّ الْكَعْبَةِ يَا أَبَا الْحَسَنِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ الْوَلِيدِ بْنِ مُسْلِمٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Mawdu"
				},
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 201
			}
		}
	]
}