{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"2": "The Book on Salat (Prayer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 372,
			"arabicnumber": 372,
			"text": "وَقَدْ رُوِيَ هَذَا الْحَدِيثُ، عَنْ إِبْرَاهِيمَ بْنِ طَهْمَانَ، بِهَذَا الإِسْنَادِ إِلاَّ أَنَّهُ يَقُولُ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، قَالَ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ صَلاَةِ الْمَرِيضِ فَقَالَ ‏\"‏ صَلِّ قَائِمًا فَإِنْ لَمْ تَسْتَطِعْ فَقَاعِدًا فَإِنْ لَمْ تَسْتَطِعْ فَعَلَى جَنْبٍ ‏\"‏ ‏.‏ حَدَّثَنَا بِذَلِكَ هَنَّادٌ حَدَّثَنَا وَكِيعٌ عَنْ إِبْرَاهِيمَ بْنِ طَهْمَانَ عَنْ حُسَيْنٍ الْمُعَلِّمِ بِهَذَا الْحَدِيثِ ‏.‏ قَالَ أَبُو عِيسَى وَلاَ نَعْلَمُ أَحَدًا رَوَى عَنْ حُسَيْنٍ الْمُعَلِّمِ نَحْوَ رِوَايَةِ إِبْرَاهِيمَ بْنِ طَهْمَانَ ‏.‏ وَقَدْ رَوَى أَبُو أُسَامَةَ وَغَيْرُ وَاحِدٍ عَنْ حُسَيْنٍ الْمُعَلِّمِ نَحْوَ رِوَايَةِ عِيسَى بْنِ يُونُسَ ‏.‏ وَمَعْنَى هَذَا الْحَدِيثِ عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ فِي صَلاَةِ التَّطَوُّعِ ‏.‏ حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ أَشْعَثَ بْنِ عَبْدِ الْمَلِكِ عَنِ الْحَسَنِ قَالَ إِنْ شَاءَ الرَّجُلُ صَلَّى صَلاَةَ التَّطَوُّعِ قَائِمًا وَجَالِسًا وَمُضْطَجِعًا ‏.‏ وَاخْتَلَفَ أَهْلُ الْعِلْمِ فِي صَلاَةِ الْمَرِيضِ إِذَا لَمْ يَسْتَطِعْ أَنْ يُصَلِّيَ جَالِسًا فَقَالَ بَعْضُ أَهْلِ الْعِلْمِ يُصَلِّي عَلَى جَنْبِهِ الأَيْمَنِ ‏.‏ وَقَالَ بَعْضُهُمْ يُصَلِّي مُسْتَلْقِيًا عَلَى قَفَاهُ وَرِجْلاَهُ إِلَى الْقِبْلَةِ ‏.‏ وَقَالَ سُفْيَانُ الثَّوْرِيُّ فِي هَذَا الْحَدِيثِ ‏\"‏ مَنْ صَلَّى جَالِسًا فَلَهُ نِصْفُ أَجْرِ الْقَائِمِ ‏\"‏ ‏.‏ قَالَ هَذَا لِلصَّحِيحِ وَلِمَنْ لَيْسَ لَهُ عُذْرٌ ‏.‏ يَعْنِي فِي النَّوَافِلِ فَأَمَّا مَنْ كَانَ لَهُ عُذْرٌ مِنْ مَرَضٍ أَوْ غَيْرِهِ فَصَلَّى جَالِسًا فَلَهُ مِثْلُ أَجْرِ الْقَائِمِ ‏.‏ وَقَدْ رُوِيَ فِي بَعْضِ هَذَا الْحَدِيثِ مِثْلُ قَوْلِ سُفْيَانَ الثَّوْرِيِّ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 224
			}
		}
	]
}