{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"49": "Chapters on Virtues"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3879,
			"arabicnumber": 3879,
			"text": "حَدَّثَنَا يَحْيَى بْنُ دُرُسْتَ، - الْمِصْرِيُّ - قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ النَّاسُ يَتَحَرَّوْنَ بِهَدَايَاهُمْ يَوْمَ عَائِشَةَ قَالَتْ فَاجْتَمَعَ صَوَاحِبَاتِي إِلَى أُمِّ سَلَمَةَ فَقُلْنَ يَا أُمَّ سَلَمَةَ إِنَّ النَّاسَ يَتَحَرَّوْنَ بِهَدَايَاهُمْ يَوْمَ عَائِشَةَ وَإِنَّا نُرِيدُ الْخَيْرَ كَمَا تُرِيدُ عَائِشَةُ فَقُولِي لِرَسُولِ اللَّهِ صلى الله عليه وسلم يَأْمُرِ النَّاسَ يُهْدُونَ إِلَيْهِ أَيْنَمَا كَانَ فَذَكَرَتْ ذَلِكَ أُمُّ سَلَمَةَ فَأَعْرَضَ عَنْهَا ثُمَّ عَادَ إِلَيْهَا فَأَعَادَتِ الْكَلاَمَ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ صَوَاحِبَاتِي قَدْ ذَكَرْنَ أَنَّ النَّاسَ يَتَحَرَّوْنَ بِهَدَايَاهُمْ يَوْمَ عَائِشَةَ فَأْمُرِ النَّاسَ يُهْدُونَ أَيْنَمَا كُنْتَ ‏.‏ فَلَمَّا كَانَتِ الثَّالِثَةُ قَالَتْ ذَلِكَ قَالَ ‏ \"‏ يَا أُمَّ سَلَمَةَ لاَ تُؤْذِينِي فِي عَائِشَةَ فَإِنَّهُ مَا أُنْزِلَ عَلَىَّ الْوَحْىُ وَأَنَا فِي لِحَافِ امْرَأَةٍ مِنْكُنَّ غَيْرَهَا ‏\"‏ ‏‏.‏ وَقَدْ رَوَى بَعْضُهُمْ هَذَا الْحَدِيثَ عَنْ حَمَّادِ بْنِ زَيْدٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنِ النَّبِيِّ صلى الله عليه وسلم مُرْسَلاً ‏. هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ ‏ وَقَدْ رُوِيَ عَنْ هِشَامِ بْنِ عُرْوَةَ هَذَا الْحَدِيثُ عَنْ عَوْفِ بْنِ الْحَارِثِ عَنْ رُمَيْثَةَ عَنْ أُمِّ سَلَمَةَ شَيْئًا مِنْ هَذَا ‏.وَ‏هَذَا حَدِيثٌ قَدْ رُوِيَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَلَى رِوَايَاتٍ مُخْتَلِفَةٍ ‏.‏ وَقَدْ رَوَى سُلَيْمَانُ بْنُ بِلاَلٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ نَحْوَ حَدِيثِ حَمَّادِ بْنِ زَيْدٍ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 279
			}
		}
	]
}