{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"2": "The Book on Salat (Prayer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 399,
			"arabicnumber": 399,
			"text": "حَدَّثَنَا الأَنْصَارِيُّ، حَدَّثَنَا مَعْنٌ، حَدَّثَنَا مَالِكٌ، عَنْ أَيُّوبَ بْنِ أَبِي تَمِيمَةَ، وَهُوَ أَيُّوبُ السَّخْتِيَانِيُّ عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم انْصَرَفَ مِنَ اثْنَتَيْنِ فَقَالَ لَهُ ذُو الْيَدَيْنِ أَقُصِرَتِ الصَّلاَةُ أَمْ نَسِيتَ يَا رَسُولَ اللَّهِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَصَدَقَ ذُو الْيَدَيْنِ ‏\"‏ ‏.‏ فَقَالَ النَّاسُ نَعَمْ ‏.‏ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَصَلَّى اثْنَتَيْنِ أُخْرَيَيْنِ ثُمَّ سَلَّمَ ثُمَّ كَبَّرَ فَسَجَدَ مِثْلَ سُجُودِهِ أَوْ أَطْوَلَ ثُمَّ كَبَّرَ فَرَفَعَ ثُمَّ سَجَدَ مِثْلَ سُجُودِهِ أَوْ أَطْوَلَ ‏.‏ قَالَ أَبُو عِيسَى وَفِي الْبَابِ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ وَابْنِ عُمَرَ وَذِي الْيَدَيْنِ ‏.‏ قَالَ أَبُو عِيسَى وَحَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَاخْتَلَفَ أَهْلُ الْعِلْمِ فِي هَذَا الْحَدِيثِ فَقَالَ بَعْضُ أَهْلِ الْكُوفَةِ إِذَا تَكَلَّمَ فِي الصَّلاَةِ نَاسِيًا أَوْ جَاهِلاً أَوْ مَا كَانَ فَإِنَّهُ يُعِيدُ الصَّلاَةَ وَاعْتَلُّوا بِأَنَّ هَذَا الْحَدِيثَ كَانَ قَبْلَ تَحْرِيمِ الْكَلاَمِ فِي الصَّلاَةِ ‏.‏ قَالَ وَأَمَّا الشَّافِعِيُّ فَرَأَى هَذَا حَدِيثًا صَحِيحًا فَقَالَ بِهِ وَقَالَ هَذَا أَصَحُّ مِنَ الْحَدِيثِ الَّذِي رُوِيَ عَنِ النَّبِيِّ صلى الله عليه وسلم فِي الصَّائِمِ إِذَا أَكَلَ نَاسِيًا فَإِنَّهُ لاَ يَقْضِي وَإِنَّمَا هُوَ رِزْقٌ رَزَقَهُ اللَّهُ ‏.‏ قَالَ الشَّافِعِيُّ وَفَرَّقُوا هَؤُلاَءِ بَيْنَ الْعَمْدِ وَالنِّسْيَانِ فِي أَكْلِ الصَّائِمِ بِحَدِيثِ أَبِي هُرَيْرَةَ ‏.‏ وَقَالَ أَحْمَدُ فِي حَدِيثِ أَبِي هُرَيْرَةَ إِنْ تَكَلَّمَ الإِمَامُ فِي شَيْءٍ مِنْ صَلاَتِهِ وَهُوَ يَرَى أَنَّهُ قَدْ أَكْمَلَهَا ثُمَّ عَلِمَ أَنَّهُ لَمْ يُكْمِلْهَا يُتِمُّ صَلاَتَهُ وَمَنْ تَكَلَّمَ خَلْفَ الإِمَامِ وَهُوَ يَعْلَمُ أَنَّ عَلَيْهِ بَقِيَّةً مِنَ الصَّلاَةِ فَعَلَيْهِ أَنْ يَسْتَقْبِلَهَا ‏.‏ وَاحْتَجَّ بِأَنَّ الْفَرَائِضَ كَانَتْ تُزَادُ وَتُنْقَصُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَإِنَّمَا تَكَلَّمَ ذُو الْيَدَيْنِ وَهُوَ عَلَى يَقِينٍ مِنْ صَلاَتِهِ أَنَّهَا تَمَّتْ وَلَيْسَ هَكَذَا الْيَوْمَ لَيْسَ لأَحَدٍ أَنْ يَتَكَلَّمَ عَلَى مَعْنَى مَا تَكَلَّمَ ذُو الْيَدَيْنِ لأَنَّ الْفَرَائِضَ الْيَوْمَ لاَ يُزَادُ فِيهَا وَلاَ يُنْقَصُ ‏.‏ قَالَ أَحْمَدُ نَحْوًا مِنْ هَذَا الْكَلاَمِ ‏.‏ وَقَالَ إِسْحَاقُ نَحْوَ قَوْلِ أَحْمَدَ فِي الْبَابِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 252
			}
		}
	]
}