{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"4": "The Book on the Day of Friday"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 523,
			"arabicnumber": 523,
			"text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ كَانَ مِنْكُمْ مُصَلِّيًا بَعْدَ الْجُمُعَةِ فَلْيُصَلِّ أَرْبَعًا ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا عَلِيُّ بْنُ الْمَدِينِيِّ عَنْ سُفْيَانَ بْنِ عُيَيْنَةَ قَالَ كُنَّا نَعُدُّ سُهَيْلَ بْنَ أَبِي صَالِحٍ ثَبْتًا فِي الْحَدِيثِ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ ‏.‏ وَرُوِيَ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ أَنَّهُ كَانَ يُصَلِّي قَبْلَ الْجُمُعَةِ أَرْبَعًا وَبَعْدَهَا أَرْبَعًا ‏.‏ وَقَدْ رُوِيَ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ رضى الله عنه أَنَّهُ أَمَرَ أَنْ يُصَلَّى بَعْدَ الْجُمُعَةِ رَكْعَتَيْنِ ثُمَّ أَرْبَعًا ‏.‏ وَذَهَبَ سُفْيَانُ الثَّوْرِيُّ وَابْنُ الْمُبَارَكِ إِلَى قَوْلِ ابْنِ مَسْعُودٍ ‏.‏ وَقَالَ إِسْحَاقُ إِنْ صَلَّى فِي الْمَسْجِدِ يَوْمَ الْجُمُعَةِ صَلَّى أَرْبَعًا وَإِنْ صَلَّى فِي بَيْتِهِ صَلَّى رَكْعَتَيْنِ ‏.‏ وَاحْتَجَّ بِأَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُصَلِّي بَعْدَ الْجُمُعَةِ رَكْعَتَيْنِ فِي بَيْتِهِ وَحَدِيثِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ مَنْ كَانَ مِنْكُمْ مُصَلِّيًا بَعْدَ الْجُمُعَةِ فَلْيُصَلِّ أَرْبَعًا ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى وَابْنُ عُمَرَ هُوَ الَّذِي رَوَى عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ كَانَ يُصَلِّي بَعْدَ الْجُمُعَةِ رَكْعَتَيْنِ فِي بَيْتِهِ وَابْنُ عُمَرَ بَعْدَ النَّبِيِّ صلى الله عليه وسلم صَلَّى فِي الْمَسْجِدِ بَعْدَ الْجُمُعَةِ رَكْعَتَيْنِ وَصَلَّى بَعْدَ الرَّكْعَتَيْنِ أَرْبَعًا ‏.‏ حَدَّثَنَا بِذَلِكَ ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ ابْنِ جُرَيْجٍ، عَنْ عَطَاءٍ، قَالَ رَأَيْتُ ابْنَ عُمَرَ صَلَّى بَعْدَ الْجُمُعَةِ رَكْعَتَيْنِ ثُمَّ صَلَّى بَعْدَ ذَلِكَ أَرْبَعًا ‏.‏ حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ الْمَخْزُومِيُّ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَمْرِو بْنِ دِينَارٍ قَالَ مَا رَأَيْتُ أَحَدًا أَنَصَّ لِلْحَدِيثِ مِنَ الزُّهْرِيِّ وَمَا رَأَيْتُ أَحَدًا الدَّنَانِيرُ وَالدَّرَاهِمُ أَهْوَنُ عَلَيْهِ مِنْهُ إِنْ كَانَتِ الدَّنَانِيرُ وَالدَّرَاهِمُ عِنْدَهُ بِمَنْزِلَةِ الْبَعْرِ ‏.‏ قَالَ أَبُو عِيسَى سَمِعْت ابْنَ أَبِي عُمَرَ قَال سَمِعْتُ سُفْيَانَ بْنَ عُيَيْنَةَ يَقُولُ كَانَ عَمْرُو بْنُ دِينَارٍ أَسَنَّ مِنْ الزُّهْرِيِّ",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 36
			}
		}
	]
}