{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"6": "The Book on Traveling"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 548,
			"arabicnumber": 548,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا يَحْيَى بْنُ أَبِي إِسْحَاقَ الْحَضْرَمِيُّ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، قَالَ خَرَجْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم مِنَ الْمَدِينَةِ إِلَى مَكَّةَ فَصَلَّى رَكْعَتَيْنِ ‏.‏ قَالَ قُلْتُ لأَنَسٍ كَمْ أَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِمَكَّةَ قَالَ عَشْرًا ‏.‏ قَالَ وَفِي الْبَابِ عَنِ ابْنِ عَبَّاسٍ وَجَابِرٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أَنَسٍ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَقَدْ رُوِيَ عَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ أَقَامَ فِي بَعْضِ أَسْفَارِهِ تِسْعَ عَشْرَةَ يُصَلِّي رَكْعَتَيْنِ ‏.‏ قَالَ ابْنُ عَبَّاسٍ فَنَحْنُ إِذَا أَقَمْنَا مَا بَيْنَنَا وَبَيْنَ تِسْعَ عَشْرَةَ صَلَّيْنَا رَكْعَتَيْنِ وَإِنْ زِدْنَا عَلَى ذَلِكَ أَتْمَمْنَا الصَّلاَةَ ‏.‏ وَرُوِيَ عَنْ عَلِيٍّ أَنَّهُ قَالَ مَنْ أَقَامَ عَشَرَةَ أَيَّامٍ أَتَمَّ الصَّلاَةَ ‏.‏ وَرُوِيَ عَنِ ابْنِ عُمَرَ أَنَّهُ قَالَ مَنْ أَقَامَ خَمْسَةَ عَشَرَ يَوْمًا أَتَمَّ الصَّلاَةَ ‏.‏ وَقَدْ رُوِيَ عَنْهُ ثِنْتَىْ عَشْرَةَ ‏.‏ وَرُوِيَ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ أَنَّهُ قَالَ إِذَا أَقَامَ أَرْبَعًا صَلَّى أَرْبَعًا ‏.‏ وَرَوَى عَنْهُ ذَلِكَ قَتَادَةُ وَعَطَاءٌ الْخُرَاسَانِيُّ ‏.‏ وَرَوَى عَنْهُ دَاوُدُ بْنُ أَبِي هِنْدٍ خِلاَفَ هَذَا ‏.‏ وَاخْتَلَفَ أَهْلُ الْعِلْمِ بَعْدُ فِي ذَلِكَ فَأَمَّا سُفْيَانُ الثَّوْرِيُّ وَأَهْلُ الْكُوفَةِ فَذَهَبُوا إِلَى تَوْقِيتِ خَمْسَ عَشْرَةَ وَقَالُوا إِذَا أَجْمَعَ عَلَى إِقَامَةِ خَمْسَ عَشْرَةَ أَتَمَّ الصَّلاَةَ ‏.‏ وَقَالَ الأَوْزَاعِيُّ إِذَا أَجْمَعَ عَلَى إِقَامَةِ ثِنْتَىْ عَشْرَةَ أَتَمَّ الصَّلاَةَ ‏.‏ وَقَالَ مَالِكُ بْنُ أَنَسٍ وَالشَّافِعِيُّ وَأَحْمَدُ إِذَا أَجْمَعَ عَلَى إِقَامَةِ أَرْبَعَةٍ أَتَمَّ الصَّلاَةَ ‏.‏ وَأَمَّا إِسْحَاقُ فَرَأَى أَقْوَى الْمَذَاهِبِ فِيهِ حَدِيثَ ابْنِ عَبَّاسٍ قَالَ لأَنَّهُ رَوَى عَنِ النَّبِيِّ صلى الله عليه وسلم ثُمَّ تَأَوَّلَهُ بَعْدَ النَّبِيِّ صلى الله عليه وسلم إِذَا أَجْمَعَ عَلَى إِقَامَةِ تِسْعَ عَشْرَةَ أَتَمَّ الصَّلاَةَ ‏.‏ ثُمَّ أَجْمَعَ أَهْلُ الْعِلْمِ عَلَى أَنَّ الْمُسَافِرَ يَقْصُرُ مَا لَمْ يُجْمِعْ إِقَامَةً وَإِنْ أَتَى عَلَيْهِ سِنُونَ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 5
			}
		}
	]
}