{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"8": "The Book on Fasting"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 710,
			"arabicnumber": 710,
			"text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ إِلَى مَكَّةَ عَامَ الْفَتْحِ فَصَامَ حَتَّى بَلَغَ كُرَاعَ الْغَمِيمِ وَصَامَ النَّاسُ مَعَهُ فَقِيلَ لَهُ إِنَّ النَّاسَ قَدْ شَقَّ عَلَيْهِمُ الصِّيَامُ وَإِنَّ النَّاسَ يَنْظُرُونَ فِيمَا فَعَلْتَ ‏.‏ فَدَعَا بِقَدَحٍ مِنْ مَاءٍ بَعْدَ الْعَصْرِ فَشَرِبَ وَالنَّاسُ يَنْظُرُونَ إِلَيْهِ فَأَفْطَرَ بَعْضُهُمْ وَصَامَ بَعْضُهُمْ فَبَلَغَهُ أَنَّ نَاسًا صَامُوا فَقَالَ ‏\"‏ أُولَئِكَ الْعُصَاةُ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ كَعْبِ بْنِ عَاصِمٍ وَابْنِ عَبَّاسٍ وَأَبِي هُرَيْرَةَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ جَابِرٍ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَقَدْ رُوِيَ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\"‏ لَيْسَ مِنَ الْبِرِّ الصِّيَامُ فِي السَّفَرِ ‏\"‏ ‏.‏ وَاخْتَلَفَ أَهْلُ الْعِلْمِ فِي الصَّوْمِ فِي السَّفَرِ فَرَأَى بَعْضُ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمْ أَنَّ الْفِطْرَ فِي السَّفَرِ أَفْضَلُ حَتَّى رَأَى بَعْضُهُمْ عَلَيْهِ الإِعَادَةَ إِذَا صَامَ فِي السَّفَرِ ‏.‏ وَاخْتَارَ أَحْمَدُ وَإِسْحَاقُ الْفِطْرَ فِي السَّفَرِ ‏.‏ وَقَالَ بَعْضُ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمْ إِنْ وَجَدَ قُوَّةً فَصَامَ فَحَسَنٌ وَهُوَ أَفْضَلُ وَإِنْ أَفْطَرَ فَحَسَنٌ ‏.‏ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَمَالِكِ بْنِ أَنَسٍ وَعَبْدِ اللَّهِ بْنِ الْمُبَارَكِ ‏.‏ وَقَالَ الشَّافِعِيُّ وَإِنَّمَا مَعْنَى قَوْلِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ لَيْسَ مِنَ الْبِرِّ الصِّيَامُ فِي السَّفَرِ ‏\"‏ ‏.‏ وَقَوْلُهُ حِينَ بَلَغَهُ أَنَّ نَاسًا صَامُوا فَقَالَ ‏\"‏ أُولَئِكَ الْعُصَاةُ ‏\"‏ ‏.‏ فَوَجْهُ هَذَا إِذَا لَمْ يَحْتَمِلْ قَلْبُهُ قَبُولَ رُخْصَةِ اللَّهِ فَأَمَّا مَنْ رَأَى الْفِطْرَ مُبَاحًا وَصَامَ وَقَوِيَ عَلَى ذَلِكَ فَهُوَ أَعْجَبُ إِلَىَّ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 29
			}
		}
	]
}