{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"1": "The Book on Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 80,
			"arabicnumber": 80,
			"text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَقِيلٍ، سَمِعَ جَابِرًا، ‏.‏ قَالَ سُفْيَانُ وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُنْكَدِرِ، عَنْ جَابِرٍ، قَالَ خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَنَا مَعَهُ فَدَخَلَ عَلَى امْرَأَةٍ مِنَ الأَنْصَارِ فَذَبَحَتْ لَهُ شَاةً فَأَكَلَ وَأَتَتْهُ بِقِنَاعٍ مِنْ رُطَبٍ فَأَكَلَ مِنْهُ ثُمَّ تَوَضَّأَ لِلظُّهْرِ وَصَلَّى ثُمَّ انْصَرَفَ فَأَتَتْهُ بِعُلاَلَةٍ مِنْ عُلاَلَةِ الشَّاةِ فَأَكَلَ ثُمَّ صَلَّى الْعَصْرَ وَلَمْ يَتَوَضَّأْ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ أَبِي بَكْرٍ الصِّدِّيقِ وَابْنِ عَبَّاسٍ وَأَبِي هُرَيْرَةَ وَابْنِ مَسْعُودٍ وَأَبِي رَافِعٍ وَأُمِّ الْحَكَمِ وَعَمْرِو بْنِ أُمَيَّةَ وَأُمِّ عَامِرٍ وَسُوَيْدِ بْنِ النُّعْمَانِ وَأُمِّ سَلَمَةَ ‏.‏ قَالَ أَبُو عِيسَى وَلاَ يَصِحُّ حَدِيثُ أَبِي بَكْرٍ فِي هَذَا الْبَابِ مِنْ قِبَلِ إِسْنَادِهِ إِنَّمَا رَوَاهُ حُسَامُ بْنُ مِصَكٍّ عَنِ ابْنِ سِيرِينَ عَنِ ابْنِ عَبَّاسٍ عَنْ أَبِي بَكْرٍ الصِّدِّيقِ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ وَالصَّحِيحُ إِنَّمَا هُوَ عَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ هَكَذَا رَوَى الْحُفَّاظُ ‏.‏ قَالَ أَبُو عِيسَى وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَكْثَرِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَالتَّابِعِينَ وَمَنْ بَعْدَهُمْ مِثْلِ سُفْيَانَ الثَّوْرِيِّ وَابْنِ الْمُبَارَكِ وَالشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَاقَ رَأَوْا تَرْكَ الْوُضُوءِ مِمَّا مَسَّتِ النَّارُ ‏.‏ وَهَذَا آخِرُ الأَمْرَيْنِ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ وَكَأَنَّ هَذَا الْحَدِيثَ نَاسِخٌ لِلْحَدِيثِ الأَوَّلِ حَدِيثِ الْوُضُوءِ مِمَّا مَسَّتِ النَّارُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 80
			}
		}
	]
}