{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"9": "The Book on Hajj"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 828,
			"arabicnumber": 828,
			"text": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ، عَنْ عُمَارَةَ بْنِ غَزِيَّةَ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَا مِنْ مُسْلِمٍ يُلَبِّي إِلاَّ لَبَّى مَنْ عَنْ يَمِينِهِ أَوْ عَنْ شِمَالِهِ مِنْ حَجَرٍ أَوْ شَجَرٍ أَوْ مَدَرٍ حَتَّى تَنْقَطِعَ الأَرْضُ مِنْ هَا هُنَا وَهَا هُنَا ‏\"‏ ‏.‏ حَدَّثَنَا الْحَسَنُ بْنُ مُحَمَّدٍ الزَّعْفَرَانِيُّ، وَعَبْدُ الرَّحْمَنِ بْنُ الأَسْوَدِ أَبُو عَمْرٍو الْبَصْرِيُّ، قَالاَ حَدَّثَنَا عَبِيدَةُ بْنُ حُمَيْدٍ، عَنْ عُمَارَةَ بْنِ غَزِيَّةَ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَ حَدِيثِ إِسْمَاعِيلَ بْنِ عَيَّاشٍ ‏.‏ قَالَ وَفِي الْبَابِ عَنِ ابْنِ عُمَرَ وَجَابِرٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي بَكْرٍ حَدِيثٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ ابْنِ أَبِي فُدَيْكٍ عَنِ الضَّحَّاكِ بْنِ عُثْمَانَ ‏.‏ وَمُحَمَّدُ بْنُ الْمُنْكَدِرِ لَمْ يَسْمَعْ مِنْ عَبْدِ الرَّحْمَنِ بْنِ يَرْبُوعٍ وَقَدْ رَوَى مُحَمَّدُ بْنُ الْمُنْكَدِرِ عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ يَرْبُوعٍ عَنْ أَبِيهِ غَيْرَ هَذَا الْحَدِيثِ ‏.‏ وَرَوَى أَبُو نُعَيْمٍ الطَّحَّانُ ضِرَارُ بْنُ صُرَدٍ هَذَا الْحَدِيثَ عَنِ ابْنِ أَبِي فُدَيْكٍ عَنِ الضَّحَّاكِ بْنِ عُثْمَانَ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ يَرْبُوعٍ عَنْ أَبِيهِ عَنْ أَبِي بَكْرٍ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ وَأَخْطَأَ فِيهِ ضِرَارٌ ‏.‏ قَالَ أَبُو عِيسَى سَمِعْتُ أَحْمَدَ بْنَ الْحَسَنِ يَقُولُ قَالَ أَحْمَدُ بْنُ حَنْبَلٍ مَنْ قَالَ فِي هَذَا الْحَدِيثِ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنِ ابْنِ عَبْدِ الرَّحْمَنِ بْنِ يَرْبُوعٍ عَنْ أَبِيهِ فَقَدْ أَخْطَأَ ‏.‏ قَالَ وَسَمِعْتُ مُحَمَّدًا يَقُولُ وَذَكَرْتُ لَهُ حَدِيثَ ضِرَارِ بْنِ صُرَدٍ عَنِ ابْنِ أَبِي فُدَيْكٍ فَقَالَ هُوَ خَطَأٌ ‏.‏ فَقُلْتُ قَدْ رَوَاهُ غَيْرُهُ عَنِ ابْنِ أَبِي فُدَيْكٍ أَيْضًا مِثْلَ رِوَايَتِهِ ‏.‏ فَقَالَ لاَ شَىْءَ إِنَّمَا رَوَوْهُ عَنِ ابْنِ أَبِي فُدَيْكٍ وَلَمْ يَذْكُرُوا فِيهِ عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ ‏.‏ وَرَأَيْتُهُ يُضَعِّفُ ضِرَارَ بْنَ صُرَدٍ ‏.‏ وَالْعَجُّ هُوَ رَفْعُ الصَّوْتِ بِالتَّلْبِيَةِ ‏.‏ وَالثَّجُّ هُوَ نَحْرُ الْبُدْنِ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 21
			}
		}
	]
}