{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"9": "The Book on Hajj"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 885,
			"arabicnumber": 885,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ عَيَّاشِ بْنِ أَبِي رَبِيعَةَ، عَنْ زَيْدِ بْنِ عَلِيٍّ، عَنْ أَبِيهِ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، رضى الله عنه قَالَ وَقَفَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِعَرَفَةَ فَقَالَ ‏\"‏ هَذِهِ عَرَفَةُ وَهَذَا هُوَ الْمَوْقِفُ وَعَرَفَةُ كُلُّهَا مَوْقِفٌ ‏\"‏ ‏.‏ ثُمَّ أَفَاضَ حِينَ غَرَبَتِ الشَّمْسُ وَأَرْدَفَ أُسَامَةَ بْنَ زَيْدٍ وَجَعَلَ يُشِيرُ بِيَدِهِ عَلَى هَيْئَتِهِ وَالنَّاسُ يَضْرِبُونَ يَمِينًا وَشِمَالاً يَلْتَفِتُ إِلَيْهِمْ وَيَقُولُ ‏\"‏ يَا أَيُّهَا النَّاسُ عَلَيْكُمُ السَّكِينَةَ ‏\"‏ ‏.‏ ثُمَّ أَتَى جَمْعًا فَصَلَّى بِهِمُ الصَّلاَتَيْنِ جَمِيعًا فَلَمَّا أَصْبَحَ أَتَى قُزَحَ فَوَقَفَ عَلَيْهِ وَقَالَ ‏\"‏ هَذَا قُزَحُ وَهُوَ الْمَوْقِفُ وَجَمْعٌ كُلُّهَا مَوْقِفٌ ‏\"‏ ‏.‏ ثُمَّ أَفَاضَ حَتَّى انْتَهَى إِلَى وَادِي مُحَسِّرٍ فَقَرَعَ نَاقَتَهُ فَخَبَّتْ حَتَّى جَاوَزَ الْوَادِيَ فَوَقَفَ وَأَرْدَفَ الْفَضْلَ ثُمَّ أَتَى الْجَمْرَةَ فَرَمَاهَا ثُمَّ أَتَى الْمَنْحَرَ فَقَالَ ‏\"‏ هَذَا الْمَنْحَرُ وَمِنًى كُلُّهَا مَنْحَرٌ ‏\"‏ ‏.‏ وَاسْتَفْتَتْهُ جَارِيَةٌ شَابَّةٌ مِنْ خَثْعَمٍ فَقَالَتْ إِنَّ أَبِي شَيْخٌ كَبِيرٌ قَدْ أَدْرَكَتْهُ فَرِيضَةُ اللَّهِ فِي الْحَجِّ أَفَيُجْزِئُ أَنْ أَحُجَّ عَنْهُ قَالَ ‏\"‏ حُجِّي عَنْ أَبِيكِ ‏\"‏ ‏.‏ قَالَ وَلَوَى عُنُقَ الْفَضْلِ فَقَالَ الْعَبَّاسُ يَا رَسُولَ اللَّهِ لِمَ لَوَيْتَ عُنُقَ ابْنِ عَمِّكَ قَالَ ‏\"‏ رَأَيْتُ شَابًّا وَشَابَّةً فَلَمْ آمَنِ الشَّيْطَانَ عَلَيْهِمَا ‏\"‏ ‏.‏ ثُمَّ أَتَاهُ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي أَفَضْتُ قَبْلَ أَنْ أَحْلِقَ ‏.‏ قَالَ ‏\"‏ احْلِقْ أَوْ قَصِّرْ وَلاَ حَرَجَ ‏\"‏ ‏.‏ قَالَ وَجَاءَ آخَرُ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي ذَبَحْتُ قَبْلَ أَنْ أَرْمِيَ ‏.‏ قَالَ ‏\"‏ ارْمِ وَلاَ حَرَجَ ‏\"‏ ‏.‏ قَالَ ثُمَّ أَتَى الْبَيْتَ فَطَافَ بِهِ ثُمَّ أَتَى زَمْزَمَ فَقَالَ ‏\"‏ يَا بَنِي عَبْدِ الْمُطَّلِبِ لَوْلاَ أَنْ يَغْلِبَكُمُ النَّاسُ عَنْهُ لَنَزَعْتُ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ جَابِرٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ عَلِيٍّ حَدِيثٌ حَسَنٌ صَحِيحٌ لاَ نَعْرِفُهُ مِنْ حَدِيثِ عَلِيٍّ إِلاَّ مِنْ هَذَا الْوَجْهِ مِنْ حَدِيثِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ عَيَّاشٍ ‏.‏ وَقَدْ رَوَاهُ غَيْرُ وَاحِدٍ عَنِ الثَّوْرِيِّ مِثْلَ هَذَا ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ رَأَوْا أَنْ يُجْمَعَ بَيْنَ الظُّهْرِ وَالْعَصْرِ بِعَرَفَةَ فِي وَقْتِ الظُّهْرِ ‏.‏ وَقَالَ بَعْضُ أَهْلِ الْعِلْمِ إِذَا صَلَّى الرَّجُلُ فِي رَحْلِهِ وَلَمْ يَشْهَدِ الصَّلاَةَ مَعَ الإِمَامِ إِنْ شَاءَ جَمَعَ هُوَ بَيْنَ الصَّلاَتَيْنِ مِثْلَ مَا صَنَعَ الإِمَامُ ‏.‏ قَالَ وَزَيْدُ بْنُ عَلِيٍّ هُوَ ابْنُ حُسَيْنِ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ عَلَيْهِ السَّلاَمُ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 78
			}
		}
	]
}