{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"9": "The Book on Hajj"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 928,
			"arabicnumber": 928,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي ابْنُ شِهَابٍ، قَالَ حَدَّثَنِي سُلَيْمَانُ بْنُ يَسَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، عَنِ الْفَضْلِ بْنِ عَبَّاسٍ، أَنَّ امْرَأَةً، مِنْ خَثْعَمٍ قَالَتْ يَا رَسُولَ اللَّهِ إِنَّ أَبِي أَدْرَكَتْهُ فَرِيضَةُ اللَّهِ فِي الْحَجِّ وَهُوَ شَيْخٌ كَبِيرٌ لاَ يَسْتَطِيعُ أَنْ يَسْتَوِيَ عَلَى ظَهْرِ الْبَعِيرِ ‏.‏ قَالَ ‏ \"‏ حُجِّي عَنْهُ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَلِيٍّ وَبُرَيْدَةَ وَحُصَيْنِ بْنِ عَوْفٍ وَأَبِي رَزِينٍ الْعُقَيْلِيِّ وَسَوْدَةَ بِنْتِ زَمْعَةَ وَابْنِ عَبَّاسٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ الْفَضْلِ بْنِ عَبَّاسٍ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَرُوِيَ عَنِ ابْنِ عَبَّاسٍ عَنْ حُصَيْنِ بْنِ عَوْفٍ الْمُزَنِيِّ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ وَرُوِيَ عَنِ ابْنِ عَبَّاسٍ أَيْضًا عَنْ سِنَانِ بْنِ عَبْدِ اللَّهِ الْجُهَنِيِّ عَنْ عَمَّتِهِ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ وَرُوِيَ عَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ قَالَ وَسَأَلْتُ مُحَمَّدًا عَنْ هَذِهِ الرِّوَايَاتِ فَقَالَ أَصَحُّ شَيْءٍ فِي هَذَا الْبَابِ مَا رَوَى ابْنُ عَبَّاسٍ عَنِ الْفَضْلِ بْنِ عَبَّاسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ قَالَ مُحَمَّدٌ وَيَحْتَمِلُ أَنْ يَكُونَ ابْنُ عَبَّاسٍ سَمِعَهُ مِنَ الْفَضْلِ وَغَيْرِهِ عَنِ النَّبِيِّ صلى الله عليه وسلم ثُمَّ رَوَى هَذَا عَنِ النَّبِيِّ صلى الله عليه وسلم وَأَرْسَلَهُ وَلَمْ يَذْكُرِ الَّذِي سَمِعَهُ مِنْهُ ‏.‏ قَالَ أَبُو عِيسَى وَقَدْ صَحَّ عَنِ النَّبِيِّ صلى الله عليه وسلم فِي هَذَا الْبَابِ غَيْرُ حَدِيثٍ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمْ وَبِهِ يَقُولُ الثَّوْرِيُّ وَابْنُ الْمُبَارَكِ وَالشَّافِعِيُّ وَأَحْمَدُ وَإِسْحَاقُ يَرَوْنَ أَنْ يُحَجَّ عَنِ الْمَيِّتِ ‏.‏ وَقَالَ مَالِكٌ إِذَا أَوْصَى أَنْ يُحَجَّ عَنْهُ حُجَّ عَنْهُ ‏.‏ وَقَدْ رَخَّصَ بَعْضُهُمْ أَنْ يُحَجَّ عَنِ الْحَىِّ إِذَا كَانَ كَبِيرًا أَوْ بِحَالٍ لاَ يَقْدِرُ أَنْ يَحُجَّ ‏.‏ وَهُوَ قَوْلُ ابْنِ الْمُبَارَكِ وَالشَّافِعِيِّ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 121
			}
		}
	]
}