{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"5": "Establishing the Prayer and the Sunnah Regarding Them"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1235,
			"arabicnumber": 1235,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ جب رسول اللہ صلی اللہ علیہوسلمل اس بیماری میں مبتلا ہوئے جس میں آپ کی وفات ہوئی، اس وقت آپ عائشہ رضی اللہ عنہا کے گھر میں تھے، آپ صلی اللہ علیہ وسلم نے فرمایا: علی ( رضی اللہ عنہ ) کو بلاؤ عائشہ رضی اللہ عنہا نے کہا: اللہ کے رسول! کیا ہم ابوبکر رضی اللہ عنہ کو بلا دیں؟ آپ صلی اللہعلیہ وسلم نے فرمایا: انہیں بلاؤ حفصہ رضی اللہ عنہا نے کہا: اللہ کے رسول! کیا عمر رضی اللہ عنہ کو بلا دیں؟ آپ نے فرمایا: بلا دو ، ام الفضل نے کہا: اللہ کے رسول! کیا ہم عباس کو بلا دیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: ہاں جب سب لوگ جمع ہو گئے تو رسول اللہ صلی اللہ علیہ وسلم نے اپنا سر اٹھا کر ان لوگوں کی طرف دیکھا، اور خاموش رہے، عمر رضی اللہ عنہ نے کہا: رسول اللہ صلی اللہ علیہ وسلم کے پاس سے اٹھ جاؤ ۱؎، پھر بلال رضی اللہ عنہ آپ کو نماز کی اطلاع دینے کے لیے آئے تو آپ صلی اللہ علیہ وسلم نے فرمایا: ابوبکر کو حکم دو کہ وہ لوگوں کو نماز پڑھائیں عائشہ رضی اللہ عنہا نے کہا: اللہ کے رسول! ابوبکر رضی اللہ عنہ نرم دل آدمی ہیں، پڑھنے میں ان کی زبان رک جاتی ہے، اور جب آپ کو نہ دیکھیں گے تو رونے لگیں گے، اور لوگ بھی رونا شروع کر دیں گے، لہٰذا اگر آپ عمر رضی اللہ عنہ کو حکم دیں کہ وہ لوگوں کو نماز پڑھائیں ( تو بہتر ہو ) ، لیکن ابوبکر رضی اللہ عنہ نکلے، اور انہوں نے لوگوں کو نماز پڑھائی، پھر رسول اللہ صلی اللہ علیہ وسلم نے اپنی طبیعت میں کچھ ہلکا پن محسوس کیا، تو دو آدمیوں پر ٹیک دے کر تشریف لائے اور آپ صلی اللہ علیہ وسلم کے دونوں پاؤں زمین پر گھسٹ رہے تھے، جب لوگوں نے آپ کو آتے دیکھا تو ابوبکر رضی اللہ عنہ کو «سبحان الله» کہا، وہ پیچھے ہٹنے لگے تو نبی اکرم صلی اللہ علیہ وسلم نے ان کو اشارہ کیا کہ اپنی جگہ پر رہو، چنانچہ رسول اللہ صلی اللہ علیہ وسلم تشریف آئے، اور ابوبکر رضی اللہ عنہ کے دائیں جانب بیٹھ گئے، اور ابوبکر رضی اللہ عنہ کھڑے رہے، ابوبکر رضی اللہ عنہ نبی اکرم صلی اللہ علیہ وسلم کی اقتداء کر رہے تھے، اور لوگ ابوبکر رضی اللہ عنہ کی اقتداء کر رہے تھے، عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے قراءت وہاں سے شروع کی جہاں تک ابوبکر رضی اللہ عنہ پہنچے تھے ۲؎۔ وکیع نے کہا: یہی سنت ہے، راوی نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم کا اسی مرض میں انتقال ہو گیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 433
			}
		}
	]
}