{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"6": "Chapters Regarding Funerals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1628,
			"arabicnumber": 1628,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ جب صحابہ کرام رضی اللہ عنہم نے رسول اللہ صلی اللہ علیہ وسلم کے لیے قبر کھودنے کا ارادہ کیا، تو ابوعبیدہ بن جراح رضی اللہ عنہ کو بلوا بھیجا، وہ مکہ والوں کی طرح صندوقی قبر کھودتے تھے، ابوطلحہ رضی اللہ عنہ کو بھی بلوا بھیجا، وہ مدینہ والوں کی طرح بغلی قبر کھودتے تھے، صحابہ کرام رضی اللہ عنہم نے دونوں کے پاس قاصد بھیج دئیے، اور دعا کی کہ اے اللہ! تو اپنے رسول کے لیے بہتر اختیار فرما، بالآخر ابوطلحہ رضی اللہ عنہ ملے، اور ان کو لایا گیا، ابوعبیدہ بن جراح رضی اللہ عنہ نہیں ملے، لہٰذا نبی اکرم صلی اللہ علیہ وسلم کے لیے بغلی قبر کھودی گئی، عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ جب لوگ منگل کے دن آپ کی تجہیز و تکفین سے فارغ ہو گئے، تو آپ اپنے گھر میں تخت پر رکھے گئے، اور لوگوں نے جماعت در جماعت اندر آنا شروع کیا، لوگ نماز جنازہ پڑھتے جاتے تھے، جب سب مرد فارغ ہو گئے، تو عورتیں جانے لگیں جب عورتیں بھی فارغ ہو گئیں، تو بچے جانے لگے، اور آپ کے جنازے کی کسی نے امامت نہیں کی۔ پھر لوگوں نے اختلاف کیا کہ آپ کی قبر کہاں کھودی جائے، بعض نے کہا کہ آپ کو مسجد میں دفن کیا جائے، بعض نے کہا کہ آپ کو آپ کے ساتھیوں کے پاس مقبرہ بقیع میں دفن کیا جائے، ابوبکر رضی اللہ عنہ نے کہا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے: جس نبی کا بھی انتقال ہوا اسے وہیں دفن کیا گیا جہاں پہ اس کا انتقال ہوا، صحابہ کرام رضی اللہ عنہم نے یہ حدیث سن کر آپ صلی اللہ علیہ وسلم کا بستر اٹھایا جس پر آپ کا انتقال ہوا تھا، لوگوں نے آپ کے لیے قبر کھودی، پھر آپ کو بدھ کی آدھی رات میں دفن کیا گیا، آپ کی قبر میں علی بن ابی طالب، فضل بن عباس، ان کے بھائی قثم بن عباس، اور رسول اللہ صلی اللہ علیہ وسلم کے غلام شقران رضی اللہ عنہم اترے۔ ابولیلیٰ اوس بن خولہ رضی اللہ عنہ نے علی بن ابی طالب رضی اللہ عنہ سے کہا: میں آپ کو اللہ کی قسم اور اپنی اس صحبت کی قسم دیتا ہوں جو ہم کو رسول اللہ صلی اللہ علیہ وسلم کے ساتھ حاصل ہے، ( مجھ کو بھی قبر میں اترنے دیں ) تو علی رضی اللہ عنہ نے ان سے کہا: اتر جاؤ، اور شقران جو آپ کے غلام تھے، نے ایک چادر لی جس کو آپ اوڑھا کرتے تھے، اسے بھی آپ کے ساتھ قبر میں دفن کر دیا اور کہا: قسم اللہ کی! اس چادر کو آپ کے بعد کوئی نہ اوڑھے، چنانچہ اسے بھی رسول اللہ صلی اللہ علیہ وسلم کے ساتھ دفن کر دیا گیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 196
			}
		}
	]
}