{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"9": "The Chapters on Marriage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1892,
			"arabicnumber": 1892,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کو خیر کے جامع کلمات دیئے گئے تھے ۱؎ خواہ وہ اخیر کے ہوں، یا کہا: شروع کے، آپ نے ہمیں صلاۃ کا خطبہ سکھایا اور حاجت کا خطبہ بھی، صلاۃ کا خطبہ یہ ہے: «التحيات لله والصلوات والطيبات السلام عليك أيها النبي ورحمة الله وبركاته السلام علينا وعلى عباد الله الصالحين أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله» آداب بندگیاں، صلاتیں اور پاکیزہ خیراتیں، اللہ ہی کے لیے ہیں، اے نبی! آپ پر سلام اور اللہ کی رحمت اور اس کی برکتیں نازل ہوں، اور سلام ہو ہم پر اور اللہ کے تمام نیک و صالح بندوں پر، میں گواہی دیتا ہوں کہ اللہ کے سوا کوئی معبود برحق نہیں، اور میں گواہی دیتا ہوں کہ محمد صلی اللہ علیہ وسلم اس کے بند ے اور رسول ہیں اور حاجت کا خطبہ یہ ہے:«إن الحمد لله نحمده ونستعينه ونستغفره ونعوذ بالله من شرور أنفسنا ومن سيئات أعمالنا من يهده الله فلا مضل له ومن يضلل فلا هادي له وأشهد أن لا إله إلا الله وحده لا شريك له وأشهد أن محمدا عبده ورسوله» بیشک تمام تعریفیں اللہ کے لیے ہیں، ہم اسی کی تعریفیں بیان کرتے ہیں، اسی سے مدد طلب کرتے ہیں، اسی سے مغفرت چاہتے ہیں، اور ہم اپنے نفسوں کی شرارتوں، اور اپنے اعمال کی برائیوں سے اللہ کی پناہ چاہتے ہیں، اللہ جسے راہ دکھائے اسے کوئی گمراہ نہیں کر سکتا، اور جیسے گمراہ کر دے اسے کوئی راہ نہیں دکھا سکتا، اور میں اس بات کی گواہی دیتا ہوں کہ اللہ کے علاوہ کوئی معبود برحق نہیں، وہ تنہا ہے، اس کا کوئی ساجھی نہیں، اور میں اس بات کی گواہی دیتا ہوں کہ محمد صلی اللہ علیہ وسلم اس کے بندے اور رسول ہیں اس کے بعد اپنے خطبہ کے ساتھ قرآن کی تین آیتیں پڑھو: «يا أيها الذين آمنوا اتقوا الله حق تقاته» اے ایمان والو! اللہ تعالیٰ سے ڈرو جیسا کہ اس سے ڈرنے کا حق ہے، اور مسلمان ہی رہ کر مرو اخیر آیت تک «واتقوا الله الذي تساءلون به والأرحام» اے ایمان والو! اللہ سے ڈرو جس کے نام پر ایک دوسرے سے مانگتے ہو، اور رشتے ناتے توڑنے سے بھی بچو، بیشک اللہ تعالیٰ تم پر نگہبان ہے اخیر آیت تک «اتقوا الله وقولوا قولا سديدا يصلح لكم أعمالكم ويغفر لكم ذنوبكم» اے ایمان والو! اللہ سے ڈرو اور نپی تلی بات کہو اللہ تعالیٰ تمہارے کام سنوارے دے گا، اور تمہارے گناہ معاف کرے گا، اور جو بھی اللہ اور اس کے رسول کی تابعداری کرے گا اس نے بڑی مراد پالی اخیر آیت تک ۲؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 48
			}
		}
	]
}