{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"10": "The Chapters on Divorce"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2031,
			"arabicnumber": 2031,
			"text": "زینب بنت کعب بن عجرہ رضی اللہ عنہما جو ابو سعید خدری رضی اللہ عنہ کے نکاح میں تھیں سے روایت ہے کہ ابو سعید خدری رضی اللہ عنہ کی بہن فریعہ بنت مالک رضی اللہ عنہما نے کہا: میرے شوہر اپنے کچھ غلاموں کی تلاش میں نکلے اور ان کو قدوم کے کنارے پا لیا، ان غلاموں نے انہیں مار ڈالا، میرے شوہر کے انتقال کی خبر آئی تو اس وقت میں انصار کے ایک گھر میں تھی، جو میرے کنبہ والوں کے گھر سے دور تھا، میں نبی اکرم صلی اللہ علیہ وسلم کے پاس آئی اور میں نے عرض کیا: اللہ کے رسول! میرے شوہر کی موت کی خبر آئی ہے اور میں اپنے کنبہ والوں اور بھائیوں کے گھروں سے دور ایک گھر میں ہوں، اور میرے شوہر نے کوئی مال نہیں چھوڑا جسے میں خرچ کروں یا میں اس کی وارث ہوں، اور نہ اپنا ذاتی کوئی گھر چھوڑا جس کے وہ مالک ہوتے، اب اگر آپ اجازت دیں تو میں اپنے خاندان کے گھر اور بھائیوں کے گھر میں آ جاؤں؟ یہ مجھے زیادہ پسند ہے، اس میں میرے بعض کام زیادہ چل جائیں گے، آپ صلی اللہ علیہ وسلم نے فرمایا: اگر تم چاہتی ہو تو ایسا کر لو ۔ فریعہ رضی اللہ عنہا نے کہا کہ میں یہ سن کر ٹھنڈی آنکھوں کے ساتھ خوش خوش نکلی کہ اللہ تعالیٰ نے اپنے رسول صلی اللہ علیہ وسلم کی زبان پہ مجھے حکم دیا تھا، یہاں تک کہ میں ابھی مسجد میں یا حجرہ ہی میں تھی کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھے بلایا اور فرمایا: کیا کہتی ہو ؟ میں نے سارا قصہ پھر بیان کیا، تو آپ صلی اللہ علیہ وسلم نے فرمایا: اسی گھر میں جہاں تمہارے شوہر کے انتقال کی خبر آئی ہے ٹھہری رہو یہاں تک کہ کتاب ( قرآن ) میں لکھی ہوئی عدت ( چار ماہ دس دن ) پوری ہو جائے، فریعہ رضی اللہ عنہا کہتی ہیں: پھر میں نے اسی گھر میں چار ماہ دس دن عدت کے گزارے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 16
			}
		}
	]
}