{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"12": "The Chapters on Business Transactions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2198,
			"arabicnumber": 2198,
			"text": "انس بن مالک رضی اللہ عنہ سے روایت ہے کہ انصار کا ایک شخص رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں آیا، وہ آپ سے کوئی چیز چاہ رہا تھا، آپ صلی اللہ علیہ وسلم نے اس سے فرمایا: تمہارے گھر میں کوئی چیز ہے ؟، اس نے عرض کیا: جی ہاں! ایک کمبل ہے جس کا ایک حصہ ہم اوڑھتے اور ایک حصہ بچھاتے ہیں، اور ایک پیالہ ہے جس سے ہم پانی پیتے ہیں، آپ صلی اللہ علیہ وسلم نے فرمایا: وہ دونوں چیزیں میرے پاس لے آؤ ، وہ گیا، اور ان کو لے آیا، رسول اللہ صلی اللہ علیہ وسلم نے ان دونوں کو اپنے ہاتھ میں لیا پھر فرمایا: انہیں کون خریدتا ہے ؟ ایک شخص بولا: میں یہ دونوں چیزیں ایک درہم میں لیتا ہوں، آپ صلی اللہ علیہ وسلم نے فرمایا: ایک درہم پر کون بڑھاتا ہے ؟ یہ جملہ آپ صلی اللہ علیہ وسلم نے دو یا تین بار فرمایا، ایک شخص بولا: میں انہیں دو درہم میں لیتا ہوں، چنانچہ آپ صلی اللہ علیہ وسلم نے یہ دونوں چیزیں اس شخص کے ہاتھ بیچ دیں، پھر دونوں درہم انصاری کو دئیے اور فرمایا: ایک درہم کا اناج خرید کر اپنے گھر والوں کو دے دو، اور دوسرے کا ایک کلہاڑا خرید کر میرے پاس لاؤ ، اس نے ایسا ہی کیا، رسول اللہ صلی اللہ علیہ وسلم نے اس کلہاڑے کو لیا، اور اپنے ہاتھ سے اس میں ایک لکڑی جما دی اور فرمایا: جاؤ اور لکڑیاں کاٹ کر لاؤ ( اور بیچو ) اور پندرہ دن تک میرے پاس نہ آؤ ، چنانچہ وہ لکڑیاں کاٹ کر لانے لگا اور بیچنے لگا، پھر وہ آپ کے پاس آیا، اور اس وقت اس کے پاس دس درہم تھے، آپ صلی اللہ علیہ وسلم نے فرمایا: کچھ کا غلہ خرید لو، اور کچھ کا کپڑا ، پھر آپ صلی اللہ علیہ وسلم نے فرمایا: یہ تمہارے لیے اس سے بہتر ہے کہ تم قیامت کے دن اس حالت میں آؤ کہ سوال کرنے کی وجہ سے تمہارے چہرے پر داغ ہو، یاد رکھو سوال کرنا صرف اس شخص کے لیے درست ہے جو انتہائی درجہ کا محتاج ہو، یا سخت قرض دار ہو یا تکلیف دہ خون بہا کی ادائیگی میں گرفتار ہو ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 62
			}
		}
	]
}