{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"21": "The Chapters on Blood Money"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2677,
			"arabicnumber": 2677,
			"text": "سہل بن ابی حثمہ رضی اللہ عنہ اپنی قوم کے بزرگوں سے روایت کرتے ہیں کہ عبداللہ بن سہل اور محیصہ رضی اللہ عنہما دونوں محتاجی کی وجہ سے جو ان کو لاحق تھی ( روزگار کی تلاش میں ) اس یہودی بستی خیبر کی طرف نکلے، محیصہ رضی اللہ عنہ کو خبر ملی کہ عبداللہ بن سہل رضی اللہ عنہ قتل کر دئیے گئے ہیں، اور انہیں خیبر کے ایک گڑھے یا چشمے میں ڈال دیا گیا ہے، وہ یہودیوں کے پاس گئے، اور کہا: اللہ کی قسم، تم لوگوں نے ہی ان ( عبداللہ بن سہل ) کو قتل کیا ہے، وہ قسم کھا کر کہنے لگے کہ ہم نے ان کا قتل نہیں کیا ہے، اس کے بعد محیصہ رضی اللہ عنہ خیبر سے واپس اپنی قوم کے پاس پہنچے، اور ان سے اس کا ذکر کیا، پھر وہ، ان کے بڑے بھائی حویصہ، اور عبدالرحمٰن بن سہل رضی اللہ عنہما رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے، اور محیصہ رضی اللہ عنہ جو کہ خیبر میں تھے بات کرنے بڑھے تو آپ صلی اللہ علیہ وسلم نے محیصہ رضی اللہ عنہ سے فرمایا: بڑے کا لحاظ کرو آپ صلی اللہ علیہ وسلم کی مراد عمر میں بڑے سے تھی چنانچہ حویصہ رضی اللہ عنہ نے گفتگو کی، اور اس کے بعد محیصہ رضی اللہ عنہ نے، اس کے بعد رسول اللہ صلی اللہ علیہ وسلم نے فیصلہ فرمایا: یا تو یہود تمہارے آدمی کی دیت ادا کریں ورنہ اس کو اعلان جنگ سمجھیں اور یہود کو یہ بات لکھ کر بھیج دی، انہوں نے بھی جواب لکھ بھیجا کہ اللہ کی قسم، ہم نے ان کو قتل نہیں کیا ہے، تو آپ صلی اللہ علیہ وسلم نے حویصہ، محیصہ اور عبدالرحمٰن رضی اللہ عنہم سے کہا: تم قسم کھا کر اپنے ساتھی کی دیت کے مستحق ہو سکتے ہو ، انہوں نے انکار کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا: پھر یہود قسم کھا کر بری ہو جائیں گے وہ کہنے لگے: وہ تو مسلمان نہیں ہیں، ( کیا ان کی قسم کا اعتبار کیا جائے گا ) آخر کار رسول اللہ صلی اللہ علیہ وسلم نے اپنے پاس سے عبداللہ بن سہل رضی اللہ عنہ کی دیت ادا کی، اور ان کے لیے سو اونٹنیاں بھیجیں جنہیں ان کے گھر میں داخل کر دیا گیا۔ سہل رضی اللہ عنہ کا کہنا ہے کہ ان میں سے ایک لال اونٹنی نے مجھے لات ماری۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 63
			}
		}
	]
}