{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"34": "Supplication"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3859,
			"arabicnumber": 3859,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ دعا مانگتے ہوئے سنا ہے: «اللهم إني أسألك باسمك الطاهر الطيب المبارك الأحب إليك الذي إذا دعيت به أجبت وإذا سئلت به أعطيت وإذا استرحمت به رحمت وإذا استفرجت به فرجت» اے اللہ! میں تجھ سے تیرے اس پاکیزہ، مبارک اچھے نام کے واسطہ سے دعا کرتا ہوں جو تجھے زیادہ پسند ہے کہ جب اس کے ذریعہ تجھ سے دعا کی جاتی ہے، تو تو قبول فرماتا ہے، اور جب اس کے ذریعہ تجھ سے سوال کیا جاتا ہے تو تو عطا کرتا ہے، اور جب اس کے ذریعہ تجھ سے رحم طلب کی جائے تو تو رحم فرماتا ہے، اور جب مصیبت کو دور کرنے کی دعا کی جاتی ہے تو مصیبت اور تنگی کو دور کرتا ہے ، اور ایک روز آپ صلی اللہ علیہ وسلم نے فرمایا: عائشہ! کیا تم جانتی ہو کہ اللہ تعالیٰ نے مجھے اپنا وہ نام بتایا ہے کہ جب بھی اس کے ذریعہ دعا کی جائے تو وہ اسے قبول کرے گا ، میں نے عرض کیا: اللہ کے رسول! میرے ماں باپ آپ پر قربان ہوں، مجھے بھی وہ نام بتا دیجئیے، آپ صلی اللہ علیہ وسلم نے فرمایا: عائشہ! یہ تمہارے لیے مناسب نہیں ، میں یہ سن کر علیحدہ ہو گئی اور کچھ دیر خاموش بیٹھی رہی، پھر میں نے اٹھ کر آپ کے سر مبارک کو چوما، اور عرض کیا: اللہ کے رسول! مجھے بتا دیجئیے، آپ صلی اللہ علیہ وسلم نے فرمایا: عائشہ! تمہارے لیے مناسب نہیں کہ میں تمہیں بتاؤں، اور تمہارے لیے اس اسم اعظم کے واسطہ سے دنیا کی کوئی چیز طلب کرنی مناسب نہیں، یہ سن کر میں اٹھی، وضو کیا، پھر میں نے دو رکعت نماز پڑھی، اس کے بعد میں نے یہ دعا مانگی: «اللهم إني أدعوك الله وأدعوك الرحمن وأدعوك البر الرحيم وأدعوك بأسمائك الحسنى كلها ما علمت منها وما لم أعلم أن تغفر لي وترحمني» اے اللہ! میں تجھ اللہ سے دعا کرتی ہوں، میں تجھ رحمن سے دعا کرتی ہوں، اور میں تجھ محسن و مہربان سے دعا کرتی ہوں اور میں تجھ سے تیرے تمام اسماء حسنیٰ سے دعا کرتی ہوں، جو مجھے معلوم ہوں یا نہ معلوم ہوں، یہ کہ تو مجھے بخش دے، اور مجھ پر رحم فرما ، یہ سن کر آپ صلی اللہ علیہ وسلم ہنسے اور فرمایا: اسم اعظم انہی اسماء میں ہے جس کے ذریعہ تم نے دعا مانگی ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 33
			}
		}
	]
}