{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"35": "Interpretation of Dreams"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3918,
			"arabicnumber": 3918,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم کی خدمت میں ایک شخص آیا، اس وقت آپ جنگ احد سے واپس تشریف لائے تھے، اس نے آپ سے عرض کیا: اللہ کے رسول! میں نے خواب میں بادل کا ایک سایہ ( ٹکڑا ) دیکھا جس سے گھی اور شہد ٹپک رہا تھا، اور میں نے لوگوں کو دیکھا کہ اس میں سے ہتھیلی بھربھر کر لے رہے ہیں، کسی نے زیادہ لیا، کسی نے کم، اور میں نے دیکھا کہ ایک رسی آسمان تک تنی ہوئی ہے، میں نے آپ کو دیکھا کہ آپ نے وہ رسی پکڑی اور اوپر چڑھ گئے، آپ کے بعد ایک اور شخص نے پکڑی اور وہ بھی اوپر چڑھ گیا، اس کے بعد ایک اور شخص نے پکڑی تو وہ بھی اوپر چڑھ گیا، پھر اس کے بعد ایک اور شخص نے پکڑی تو رسی ٹوٹ گئی، لیکن وہ پھر جوڑ دی گئی، اور وہ بھی اوپر چڑھ گیا، یہ سن کر ابوبکر رضی اللہ عنہ نے عرض کیا: اللہ کے رسول! اس خواب کی تعبیر مجھے بتانے دیجئیے، آپ صلی اللہ علیہ وسلم نے فرمایا: تم اس کی تعبیر بیان کرو ، ابوبکر رضی اللہ عنہ نے عرض کیا کہ وہ بادل کا ٹکڑا دین اسلام ہے، شہد اور گھی جو اس سے ٹپک رہا ہے اس سے مراد قرآن، اور اس کی حلاوت ( شیرینی ) اور لطافت ہے، اور لوگ جو اس سے ہتھیلی بھربھر کر لے رہے ہیں اس سے مراد قرآن حاصل کرنے والے ہیں، کوئی زیادہ حاصل کر رہا ہے کوئی کم، اور وہ رسی جو آسمان تک گئی ہے اس سے وہ حق ( نبوت یا خلافت ) کی رسی مراد ہے جس پر آپ صلی اللہ علیہ وسلم ہیں، اور جو آپ نے پکڑی اور اوپر چلے گئے ( یعنی اس حالت میں آپ نے وفات پائی ) ، پھر اس کے بعد دوسرے نے پکڑی اور وہ بھی اوپر چڑھ گیا، پھر تیسرے نے پکڑی وہ بھی اوپر چڑھ گیا، پھر چوتھے نے پکڑی تو حق کی رسی کمزور ہو کر ٹوٹ گئی، لیکن اس کے بعد اس کے لیے وہ جوڑی جاتی ہے تو وہ اس کے ذریعے اوپر چڑھ جاتا ہے، یہ سن کر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تم نے کچھ تعبیر صحیح بتائی اور کچھ غلط ، ابوبکر رضی اللہ عنہ نے عرض کیا: اللہ کے رسول! میں آپ کو قسم دلاتا ہوں، آپ ضرور بتائیے کہ میں نے کیا صحیح کہا، اور کیا غلط؟ تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: اے ابوبکر! قسم نہ دلاؤ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 26
			}
		}
	]
}