{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"35": "Interpretation of Dreams"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3920,
			"arabicnumber": 3920,
			"text": "خرشہ بن حرر رضی اللہ عنہ کہتے ہیں کہ جب میں مدینہ آیا تو مسجد نبوی میں چند بوڑھوں کے پاس آ کر بیٹھ گیا، اتنے میں ایک بوڑھا اپنی لاٹھی ٹیکتے ہوئے آیا، تو لوگوں نے کہا: جسے کوئی جنتی آدمی دیکھنا پسند ہو وہ اس شخص کو دیکھ لے، پھر اس نے ایک ستون کے پیچھے جا کر دو رکعت نماز ادا کی، تو میں ان کے پاس گیا، اور ان سے عرض کیا کہ آپ کی نسبت کچھ لوگوں کا ایسا ایسا کہنا ہے؟ انہوں نے کہا: الحمدللہ! جنت اللہ کی ملکیت ہے وہ جسے چاہے اس میں داخل فرمائے، میں نے رسول اللہ صلی اللہ علیہ وسلم کے عہد مبارک میں ایک خواب دیکھا تھا، میں نے دیکھا، گویا ایک شخص میرے پاس آیا، اور کہنے لگا: میرے ساتھ چلو، تو میں اس کے ساتھ ہو گیا، پھر وہ مجھے ایک بڑے میدان میں لے کر چلا، پھر میرے بائیں جانب ایک راستہ سامنے آیا، میں نے اس پر چلنا چاہا تو اس نے کہا: یہ تمہارا راستہ نہیں، پھر دائیں طرف ایک راستہ سامنے آیا تو میں اس پر چل پڑا یہاں تک کہ جب میں ایک ایسے پہاڑ کے پاس پہنچا جس پر پیر نہیں ٹکتا تھا، تو اس شخص نے میرا ہاتھ پکڑا اور مجھ کو دھکیلا یہاں تک کہ میں اس چوٹی پر پہنچ گیا، لیکن وہاں پر میں ٹھہر نہ سکا اور نہ وہاں کوئی ایسی چیز تھی جسے میں پکڑ سکتا، اچانک مجھے لوہے کا ایک کھمبا نظر آیا جس کے سرے پر سونے کا ایک کڑا تھا، پھر اس شخص نے میرا ہاتھ پکڑا، اور مجھے دھکا دیا یہاں تک کہ میں نے وہ کڑا پکڑ لیا، تو اس نے مجھ سے پوچھا: کیا تم نے مضبوطی سے پکڑ لیا؟ میں نے کہا: ہاں، میں نے پکڑ لیا، پھر اس نے کھمبے کو پاؤں سے ٹھوکر ماری، لیکن میں کڑا پکڑے رہا۔ میں نے یہ خواب نبی اکرم صلی اللہ علیہ وسلم سے بیان کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا: تم نے خواب تو بہت ہی اچھا دیکھا، وہ بڑا میدان میدان حشر تھا، اور جو راستہ تمہارے بائیں جانب دکھایا گیا وہ جہنمیوں کا راستہ تھا، لیکن تم جہنم والوں میں سے نہیں ہو اور وہ راستہ جو تمہارے دائیں جانب دکھایا گیا وہ جنتیوں کا راستہ ہے، اور جو پھسلنے والا پہاڑ تم نے دیکھا وہ شہیدوں کا مقام ہے، اور وہ کڑا جو تم نے تھاما وہ اسلام کا کڑا ہے، لہٰذا تم اسے مرتے دم تک مضبوطی سے پکڑے رہو، تو مجھے امید ہے کہ میں اہل جنت میں ہوں گا اور وہ ( بوڑھے آدمی ) عبداللہ بن سلام رضی اللہ عنہ تھے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 28
			}
		}
	]
}