{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"36": "Tribulations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3930,
			"arabicnumber": 3930,
			"text": "عمران بن حصین رضی اللہ عنہما کہتے ہیں کہ نافع بن ازرق اور ان کے اصحاب ( و تلامیذ ) آئے، اور کہنے لگے: عمران! آپ ہلاک و برباد ہو گئے! عمران رضی اللہ عنہ نے کہا: میں ہلاک نہیں ہوا، انہوں نے کہا: کیوں نہیں، آپ ضرور ہلاک ہو گئے، تو انہوں نے کہا: آخر کس چیز نے مجھے ہلاک کیا ہے؟ انہوں نے کہا: اللہ تعالیٰ فرماتا ہے: «وقاتلوهم حتى لا تكون فتنة ويكون الدين كله لله» کافروں و مشرکوں سے قتال کرو یہاں تک کہ فتنہ ( یعنی شرک ) باقی نہ رہے، اور دین پورا کا پورا اللہ کا ہو جائے ( سورة الأنفال: 39 ) ، عمران رضی اللہ عنہ نے کہا: ہم نے کفار سے اسی طرح لڑائی کی یہاں تک کہ ہم نے ان کو وطن سے باہر نکال دیا، اور دین پورا کا پورا اللہ کا ہو گیا، اگر تم چاہو تو میں تم سے ایک حدیث بیان کروں جو میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنی ہے، ان لوگوں نے کہا: کیا آپ نے اسے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے؟ کہا: ہاں، میں نے خود رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے، میں آپ کے ساتھ موجود تھا، اور آپ نے مسلمانوں کا ایک لشکر مشرکین کے مقابلے کے لیے بھیجا تھا، جب ان کی مڈبھیڑ مشرکوں سے ہوئی، تو انہوں نے ان سے ڈٹ کر جنگ کی، آخر کار مشرکین نے اپنے کندھے ہماری جانب کر دئیے ( یعنی ہار کر بھاگ نکلے ) ، میرے ایک رشتہ دار نے مشرکین کا تعاقب کر کے ایک مشرک پر نیزے سے حملہ کیا، جب اس کو پکڑ لیا، ( اور کافر نے اپنے آپ کو خطرہ میں دیکھا ) تو اس نے «أشهد أن لا إله إلا الله» کہہ کر اپنے آپ کو مسلمان ظاہر کیا، لیکن اس نے اسے برچھی سے مار کر قتل کر دیا، پھر وہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں آیا، اور اس نے عرض کیا: اللہ کے رسول! میں ہلاک اور برباد ہو گیا، آپ صلی اللہ علیہ وسلم نے فرمایا: تم نے کیا کیا ؟، ایک بار یا دو بار کہا، اس نے آپ صلی اللہ علیہ وسلم سے اپنا وہ واقعہ بتایا جو اس نے کیا تھا، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تم نے اس کا پیٹ کیوں نہیں پھاڑا کہ جان لیتے اس کے دل میں کیا ہے ؟، اس نے عرض کیا: اللہ کے رسول! اگر میں اس کا پیٹ پھاڑ دیتا تو کیا میں جان لیتا کہ اس کے دل میں کیا تھا؟ آپ صلی اللہ علیہ وسلم نے فرمایا: تم نے نہ تو اس کی بات قبول کی، اور نہ تمہیں اس کی دلی حالت معلوم تھی ۱؎۔ عمران رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم اس کے متعلق خاموش رہے، پھر وہ کچھ ہی دن زندہ رہ کر مر گیا، ہم نے اسے دفن کیا، لیکن صبح کو اس کی لاش قبر کے باہر پڑی تھی، لوگوں نے خیال ظاہر کیا کہ کسی دشمن نے اس کی لاش نکال پھینکی ہے، خیر پھر ہم نے اس کو دفن کیا، اس کے بعد ہم نے اپنے غلاموں کو حکم دیا کہ اس کی قبر کی حفاظت کریں، لیکن پھر صبح اس کی لاش قبر سے باہر پڑی تھی، ہم نے سمجھا کہ شاید غلام سو گئے ( اور کسی دشمن نے آ کر پھر اس کی لاش نکال کر باہر پھینک دی ) ، آخر ہم نے اس کو دفن کیا، اور رات بھر خود پہرا دیا لیکن پھر اس کی لاش صبح کے وقت قبر کے باہر تھی، پھر ہم نے اس کی لاش ان گھاٹیوں میں سے ایک گھاٹی میں ڈال دی ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 4
			}
		}
	]
}