{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"36": "Tribulations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3952,
			"arabicnumber": 3952,
			"text": "رسول اللہ صلی اللہ علیہ وسلم کے غلام ثوبان رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: میرے لیے زمین سمیٹ دی گئی حتیٰ کہ میں نے اس کے مشرق اور مغرب کو دیکھ لیا، پھر اس کے دونوں خزانے زرد یا سرخ اور سفید ( یعنی سونا اور چاندی بھی ) مجھے دئیے گئے ۱؎ اور مجھ سے کہا گیا کہ تمہاری ( امت کی ) حکومت وہاں تک ہو گی جہاں تک زمین تمہارے لیے سمیٹی گئی ہے، اور میں نے اللہ تعالیٰ سے تین باتوں کا سوال کیا: پہلی یہ کہ میری امت قحط ( سوکھے ) میں مبتلا ہو کر پوری کی پوری ہلاک نہ ہو، دوسری یہ کہ انہیں ٹکڑے ٹکڑے نہ کر، تیسری یہ کہ آپس میں ایک کو دوسرے سے نہ لڑا، تو مجھ سے کہا گیا کہ میں جب کوئی حکم نافذ کر دیتا ہوں تو وہ واپس نہیں ہو سکتا، بیشک میں تمہاری امت کو قحط سے ہلاک نہ کروں گا، اور میں زمین کے تمام کناروں سے سارے مخالفین کو ( ایک وقت میں ) ان پر جمع نہ کروں گا جب تک کہ وہ خود آپس میں اختلاف و لڑائی اور ایک دوسرے کو مٹانے اور قتل نہ کرنے لگیں، لیکن جب میری امت میں تلوار چل پڑے گی تو وہ قیامت تک نہ رکے گی، مجھے اپنی امت پر سب سے زیادہ خوف گمراہ سربراہوں کا ہے، عنقریب میری امت کے بعض قبائل بتوں کی پرستش کریں گے، اور عنقریب میری امت کے بعض قبیلے مشرکوں سے مل جائیں گے، اور قیامت کے قریب تقریباً تیس جھوٹے دجال پیدا ہوں گے جن میں سے ہر ایک کا دعویٰ یہ ہو گا کہ وہ اللہ کا نبی ہے، اور میری امت کا ایک گروہ ہمیشہ حق پر قائم رہے گا، اور ہمیشہ ان کی مدد ہوتی رہے گی، اور جو کوئی ان کا مخالف ہو گا وہ ان کو کوئی ضرور نقصان نہیں پہنچا سکے گا، یہاں تک کہ اللہ تعالیٰ کا حکم آ جائے ۲؎۔ ابوالحسن ابن القطان کہتے ہیں: جب ابوعبداللہ ( یعنی امام ابن ماجہ ) اس حدیث کو بیان کر کے فارغ ہوئے تو فرمایا: یہ حدیث کتنی ہولناک ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 27
			}
		}
	]
}