{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"36": "Tribulations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4030,
			"arabicnumber": 4030,
			"text": "ابی بن کعب رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے معراج کی رات ایک خوشبو محسوس کی تو آپ صلی اللہ علیہ وسلم نے فرمایا: جبرائیل! یہ کیسی خوشبو ہے ؟، انہوں نے کہا: یہ اس عورت کی قبر کی خوشبو ہے جو فرعون کی بیٹی کو کنگھی کرتی تھی، اور اس کے دونوں بیٹوں اور شوہر کے قبر کی خوشبو ہے، ( جنہیں ایمان لانے کی وجہ سے فرعون نے قتل کر دیا تھا ) اور ان کے قصے کی ابتداء اس طرح ہے کہ خضر بنی اسرائیل کے شریف لوگوں میں تھے، ان کا گزر ایک ( راہب ) درویش کے عبادت خانے سے ہوتا تو وہ عابد راہب اوپر سے ان کو جھانکتا، اور ان کو اسلام کی تعلیم دیتا، آخر کار جب خضر جوان ہوئے تو ان کے والد نے ایک عورت سے ان کا نکاح کر دیا، خضر نے اس عورت کو اسلام کی تعلیم دی، اور اس سے عہد لے لیا کہ اس بات سے کسی کو باخبر مت کرنا، خضر عورتوں کے قریب نہیں جاتے تھے، آخر انہوں نے اس عورت کو طلاق دے دی، اس کے بعد ان کے والد نے ان کا نکاح دوسری عورت سے کر دیا، خضر نے اس سے بھی نہ بتانے کا عہد لے کر اسے دین کی تعلیم دی، لیکن ان میں سے ایک عورت نے اس راز کو چھپا لیا، اور دوسری نے ظاہر کر دیا ( کہ یہ دین کی تعلیم اسے خضر نے سکھائی ہے، فرعون نے ان کی گرفتاری کا حکم دیا یہ سنتے ہی ) وہ فرار ہو کر سمندر کے ایک جزیرہ میں چھپ گئے، وہاں دو شخص لکڑیاں چننے کے لیے آئے، اور ان دونوں نے خضر کو دیکھا، ان میں سے بھی ایک نے تو ان کا حال پوشیدہ رکھا، اور دوسرے نے ظاہر کر دیا اور کہا: میں نے خضر کو فلاں جزیرے میں دیکھا ہے، لوگوں نے اس سے پوچھا کہ کیا تمہارے ساتھ اور کسی شخص نے دیکھا ہے؟ اس نے کہا: فلاں شخص نے بھی دیکھا ہے، جب اس شخص سے سوال کیا گیا تو اس نے چھپایا، اور ان کا طریقہ یہ تھا کہ جو جھوٹ بولے، اسے قتل کر دیا جائے، الغرض اس شخص نے اس عورت سے نکاح کر لیا، جس نے اپنا دین چھپایا تھا، ( اور خضر کا نام نہیں بتایا تھا ) ، اسی دوران کہ یہ عورت فرعون کی بیٹی کے سر میں کنگھی کر رہی تھی، اتنے میں اس کے ہاتھ سے کنگھی گر پڑی اور اس کی زبان سے بے اختیار نکل گیا کہ فرعون تباہ و برباد ہو ( اپنی بے دینی کی وجہ سے ) بیٹی نے یہ کلمہ اس کی زبان سے سن کر اسے اپنے باپ کو بتا دیا، اور اس عورت کے دو بیٹے تھے، اور ایک شوہر تھا، فرعون نے ان سبھوں کو بلا بھیجا، اور عورت اور اس کے شوہر کو دین اسلام چھوڑ کر اپنے دین میں آنے کے لیے پھسلایا، ان دونوں نے انکار کیا، تو اس نے کہا: میں تم دونوں کو قتل کر دوں گا، ان دونوں نے جواب دیا: اگر تم ہمیں قتل کرنا چاہتے ہو تو ہم پر اتنا احسان کرنا کہ ہمیں ایک ہی قبر میں دفن کر دینا، چنانچہ فرعون نے ایسا ہی کیا، جب نبی اکرم صلی اللہعلیہ وسلم نے اسراء کی رات میں خوشبو محسوس کی، تو آپ صلی اللہ علیہ وسلم نے جبرائیل سے پوچھا تو انہوں نے آپ کو بتلایا کہ یہ انہیں لوگوں کی قبر ہے ( جس سے یہ خوشبو آ رہی ہے ) ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 105
			}
		}
	]
}