{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"36": "Tribulations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4053,
			"arabicnumber": 4053,
			"text": "حذیفہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ہم سے دو حدیثیں بیان کیں، جن میں سے ایک تو میں نے دیکھ لی ۱؎ اور دوسری کا منتظر ہوں، آپ صلی اللہ علیہ وسلم نے ہم سے یہ بیان فرمایا: امانت آدمیوں کے دلوں کی جڑ میں اتری ( پیدا ہوئی ) ، ( طنافسی نے کہا: یعنی آدمیوں کے دلوں کے بیچ میں اتری ) اور قرآن کریم نازل ہوا، تو ہم نے قرآن و سنت کی تعلیم حاصل کی ۲؎، پھر آپ صلی اللہ علیہ وسلم نے امانت کے اٹھ جانے کے متعلق ہم سے بیان کیا، آپ صلی اللہ علیہ وسلم نے فرمایا: آدمی رات کو سوئے گا تو امانت اس کے دل سے اٹھا لی جائے گی، ( اور جب وہ صبح کو اٹھے گا تو ) امانت کا اثر ایک نقطے کی طرح دل میں رہ جائے گا، پھر جب دوسری بار سوئے گا تو امانت اس کے دل سے چھین لی جائے گی، تو اس کا اثر ( اس کے دل میں ) کھال موٹا ۲؎ ہونے کی طرح رہ جائے گا، جیسے تم انگارے کو پاؤں پر لڑھکا دو تو کھال پھول کر آبلے کی طرح دکھائی دے گی، حالانکہ اس کے اندر کچھ نہیں ہوتا ، پھر حذیفہ رضی اللہ عنہ نے مٹھی بھر کنکریاں لیں اور انہیں اپنی پنڈلی پر لڑھکا لیا، اور فرمانے لگے: پھر لوگ صبح کو ایک دوسرے سے خرید و فروخت کریں گے، لیکن ان میں سے کوئی بھی امانت دار نہ ہو گا، یہاں تک کہ کہا جائے گا کہ فلاں قبیلے میں فلاں امانت دار شخص ہے، اور یہاں تک آدمی کو کہا جائے گا کہ کتنا عقلمند، کتنا توانا اور کتنا ذہین و چالاک ہے، حالانکہ اس کے دل میں رائی کے دانے کے برابر بھی ایمان نہ ہو گا، اور مجھ پر ایک زمانہ ایسا گزرا کہ مجھے پروا نہ تھی کہ میں تم میں سے کس سے معاملہ کروں، یعنی مجھے کسی کی ضمانت کی حاجت نہ تھی، اگر وہ مسلمان ہوتا تو اس کا اسلام اسے مجھ پر زیادتی کرنے سے روکتا، اور اگر وہ یہودی یا نصرانی ہوتا تو اس کا گماشتہ بھی انصاف سے کام لیتا ( یعنی ان کے عامل اور عہدہ دار بھی ایماندار اور منصف ہوتے ) اور اب آج کے دن مجھے کوئی بھی ایسا نظر نہیں آتا کہ میں اس سے معاملہ کروں سوائے فلاں فلاں کے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 128
			}
		}
	]
}