{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"36": "Tribulations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4079,
			"arabicnumber": 4079,
			"text": "ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: یاجوج و ماجوج کھول دئیے جائیں گے، پھر وہ باہر آئیں گے جیسا کہ اللہ تعالیٰ نے فرمایا:«وهم من كل حدب ينسلون» یہ لوگ ہر اونچی زمین سے دوڑتے آئیں گے ( سورة الأنبياء: 96 ) پھر ساری زمین میں پھیل جائیں گے، اور مسلمان ان سے علاحدہ رہیں گے، یہاں تک کہ جو مسلمان باقی رہیں گے وہ اپنے شہروں اور قلعوں میں اپنے مویشیوں کو لے کر پناہ گزیں ہو جائیں گے، یہاں تک کہ یاجوج و ماجوج نہر سے گزریں گے، اس کا سارا پانی پی کر ختم کر دیں گے، اس میں کچھ بھی نہ چھوڑیں گے، جب ان کے پیچھے آنے والوں کا وہاں پر گزر ہو گا تو ان میں کا کوئی یہ کہے گا کہ کسی زمانہ میں یہاں پانی تھا، اور وہ زمین پر غالب آ جائیں گے، تو ان میں سے کوئی یہ کہے گا: ان اہل زمین سے تو ہم فارغ ہو گئے، اب ہم آسمان والوں سے لڑیں گے، یہاں تک کہ ان میں سے ایک اپنا نیزہ آسمان کی طرف پھینکے گا، وہ خون میں رنگا ہوا لوٹ کر گرے گا، پس وہ کہیں گے: ہم نے آسمان والوں کو بھی قتل کر دیا، خیر یہ لوگ اسی حال میں ہوں گے کہ اللہ تعالیٰ چند جانور بھیجے گا، جو ٹڈی کے کیڑوں کی طرح ہوں گے، جو ان کی گردنوں میں گھس جائیں گے، یہ سب کے سب ٹڈیوں کی طرح مر جائیں گے، ان میں سے ایک پر ایک پڑا ہو گا، اور جب مسلمان اس دن صبح کو اٹھیں گے، اور ان کی آہٹ نہیں سنیں گے تو کہیں گے: کوئی ایسا ہے جو اپنی جان ہتھیلی پر رکھ کر کے انہیں دیکھ کر آئے کہ یاجوج ماجوج کیا ہوئے؟ چنانچہ مسلمانوں میں سے ایک شخص ( قلعہ سے ) ان کا حال جاننے کے لیے نیچے اترے گا، اور دل میں خیال کرے گا کہ وہ مجھ کو ضرور مار ڈالیں گے، خیر وہ انہیں مردہ پائے گا، تو مسلمانوں کو پکار کر کہے گا: سنو! خوش ہو جاؤ! تمہارا دشمن ہلاک ہو گیا، یہ سن کر لوگ نکلیں گے اور اپنے جانور چرنے کے لیے آزاد چھوڑیں گے، اور ان کے گوشت کے سوا کوئی چیز انہیں کھانے کے لیے نہ ملے گی، اس وجہ سے ان کا گوشت کھا کھا کر خوب موٹے تازے ہوں گے، جس طرح کبھی گھاس کھا کر موٹے ہوئے تھے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 154
			}
		}
	]
}