{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"36": "Tribulations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4081,
			"arabicnumber": 4081,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ اسراء ( معراج ) کی رات رسول اللہ صلی اللہ علیہ وسلم نے ابراہیم، موسیٰ اور عیسیٰ علیہم السلام سے ملاقات کی، تو سب نے آپس میں قیامت کا ذکر کیا، پھر سب نے پہلے ابراہیم علیہ السلام سے قیامت کے متعلق پوچھا، لیکن انہیں قیامت کے متعلق کچھ علم نہ تھا، پھر سب نے موسیٰ علیہ السلام سے پوچھا، تو انہیں بھی قیامت کے متعلق کچھ علم نہ تھا، پھر سب نے عیسیٰ بن مریم علیہما السلام سے پوچھا تو انہوں نے فرمایا: قیامت کے آ دھمکنے سے کچھ پہلے ( دنیا میں جانے کا ) مجھ سے وعدہ لیا گیا ہے، لیکن قیامت کے آنے کا صحیح علم صرف اللہ ہی کو ہے ( کہ وہ کب قائم ہو گی ) ، پھر عیسیٰ علیہ السلام نے دجال کے ظہور کا تذکرہ کیا، اور فرمایا: میں ( زمین پر ) اتر کر اسے قتل کروں گا، پھر لوگ اپنے اپنے شہروں ( ملکوں ) کو لوٹ جائیں گے، اتنے میں یاجوج و ماجوج ان کے سامنے آئیں گے، اور ہر بلندی سے وہ چڑھ دوڑیں گے، وہ جس پانی سے گزریں گے اسے پی جائیں گے، اور جس چیز کے پاس سے گزریں گے، اسے تباہ و برباد کر دیں گے، پھر لوگ اللہ سے دعا کرنے کی درخواست کریں گے، میں اللہ سے دعا کروں گا کہ انہیں مار ڈالے ( چنانچہ وہ سب مر جائیں گے ) ان کی لاشوں کی بو سے تمام زمین بدبودار ہو جائے گی، لوگ پھر مجھ سے دعا کے لیے کہیں گے تو میں پھر اللہ سے دعا کروں گا، تو اللہ تعالیٰ آسمان سے بارش نازل فرمائے گا جو ان کی لاشیں اٹھا کر سمندر میں بہا لے جائے گی، اس کے بعد پہاڑ ریزہ ریزہ کر دئیے جائیں گے، اور زمین چمڑے کی طرح کھینچ کر دراز کر دی جائے گی، پھر مجھے بتایا گیا ہے کہ جب یہ باتیں ظاہر ہوں تو قیامت لوگوں سے ایسی قریب ہو گی جس طرح حاملہ عورت کے حمل کا زمانہ پورا ہو گیا ہو، اور وہ اس انتظار میں ہو کہ کب ولادت کا وقت آئے گا، اور اس کا صحیح وقت کسی کو معلوم نہ ہو۔ عوام ( عوام بن حوشب ) کہتے ہیں کہ اس واقعہ کی تصدیق اللہ کی کتاب میں موجود ہے: «حتى إذا فتحت يأجوج ومأجوج وهم من كل حدب ينسلون» یہاں تک کہ جب یاجوج و ماجوج کھول دئیے جائیں گے، تو پھر وہ ہر ایک ٹیلے پر سے چڑھ دوڑیں گے ( سورة الأنبياء: 96 ) ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 156
			}
		}
	]
}