{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"0": "The Book of the Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 77,
			"arabicnumber": 77,
			"text": "عبداللہ بن فیروز دیلمی کہتے ہیں کہ میرے دل میں اس تقدیر کے سلسلے میں کچھ شبہات پیدا ہوئے، اور مجھے ڈر لاحق ہوا کہ کہیں یہ شبہات میرے دین اور میرے معاملے کو خراب نہ کر دیں، چنانچہ میں ابی بن کعب رضی اللہ عنہ کے پاس آیا، اور عرض کیا: ابوالمنذر! میرے دل میں اس تقدیر کے سلسلے میں کچھ شبہات وارد ہوئے ہیں، مجھے ڈر ہے کہ کہیں میرا دین اور میرا معاملہ خراب نہ ہو جائے، لہٰذا آپ اس سلسلہ میں مجھ سے کچھ بیان کریں تاکہ اللہ تعالیٰ مجھے اس سے کچھ فائدہ پہنچائے، انہوں نے کہا: اگر اللہ تعالیٰ تمام آسمان و زمین والوں کو عذاب دینا چاہے تو انہیں عذاب دے سکتا ہے، اور وہ ظالم نہیں ہو گا، اور اگر ان پر رحم کرے تو اس کی رحمت ان کے حق میں ان کے اعمال سے زیادہ بہتر ہے، اور اگر تمہارے پاس احد پہاڑ کے برابر سونا ہو ( یا کہا: احد پہاڑ کے برابر مال ہو ) اور تم اسے اللہ تعالیٰ کی راہ میں خرچ کر دو، تو یہ اس وقت تک قبول نہیں ہو گا جب تک کہ تم تقدیر پہ ایمان نہ لاؤ، تم یہ یقین رکھو کہ جو ( خیر و شر ) تمہیں پہنچا وہ تم سے چوکنے والا نہ تھا، اور جو تمہیں نہیں پہنچا وہ تمہیں پہنچنے والا نہیں تھا ۱؎، اور اگر تم اس اعتقاد کے علاوہ پر مرے تو جہنم میں داخل ہو گے، اور کوئی حرج نہیں کہ تم میرے بھائی عبداللہ بن مسعود رضی اللہ عنہ کے پاس جاؤ اور ان سے پوچھو، عبداللہ بن فیروز دیلمی کہتے ہیں: میں عبداللہ رضی اللہ عنہ کے پاس آیا، اور ان سے پوچھا، تو انہوں نے بھی وہی بتایا جو ابی رضی اللہ عنہ نے بتایا تھا، اور مجھ سے کہا: کوئی مضائقہ نہیں کہ تم حذیفہ رضی اللہ عنہ کے پاس جاؤ۔ چنانچہ میں حذیفہ رضی اللہ عنہ کے پاس آیا اور ان سے پوچھا تو انہوں نے بھی وہی بتایا جو ان دونوں ( ابی بن کعب اور عبداللہ بن مسعود رضی اللہ عنہ ) نے بتایا تھا، اور انہوں نے کہا: تم زید بن ثابت رضی اللہ عنہ کے پاس جاؤ اور ان سے بھی پوچھ لو۔ چنانچہ میں زید بن ثابت رضی اللہ عنہ کے پاس آیا، اور ان سے بھی پوچھا، تو انہوں نے کہا: میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: اگر اللہ تعالیٰ تمام آسمان و زمین والوں کو عذاب دینا چاہے تو انہیں عذاب دے سکتا ہے، اور وہ ظالم نہیں ہو گا، اور اگر ان پر رحم کرے تو اس کی رحمت ان کے حق میں ان کے اعمال سے بہتر ہے، اور اگر تمہارے پاس احد کے برابر سونا یا احد پہاڑ کے برابر سونا ہو، اور تم اسے اللہ کی راہ میں خرچ کرو تو وہ اس وقت تک تمہاری جانب سے اللہ تعالیٰ کے نزدیک قابل قبول نہ ہو گا جب تک کہ تم پوری تقدیر پہ کلی طور پر ایمان نہ لاؤ، اور تم یہ یقین رکھو کہ جو ( خیر و شر ) تمہیں پہنچا ہے تم سے چوکنے والا نہ تھا، اور جو تم سے چوک گیا وہ تمہیں پہنچنے والا نہیں تھا، اور اگر تم اس عقیدہ کے علاوہ پر مرے تو جہنم میں داخل ہو گے ۲؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 0,
				"hadith": 77
			}
		}
	]
}