{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"12": "The Book of The At-Tatbiq (Clasping One's Hands Together)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1136,
			"arabicnumber": 1136,
			"text": "It was narrated that Rifa'ah bin Rafi' said:\"While the Messenger of Allah (ﷺ) was sitting with us around him, a man came in, turned towards the Qiblah and prayed. When he had finished his prayer, he came and greeted the Messenger of Allah (ﷺ) and the people with Salam. The Messenger of Allah (ﷺ) said to him: 'And also to you. Go and pray, for you have not prayed.' So he went and prayed, and the Messenger of Allah (ﷺ) started watching him, and he (the man) did not know what was wrong with it. When he had finished the prayer, he came and greeted the Messenger of Allah (ﷺ) and the people with salam. The Messenger of Allah (ﷺ) said to him: 'And also to you. Go and pray, for you have not prayed.' He repeated it two or three times, then the man said: 'O Messenger of Allah, what is wrong with my prayer?' The Messenger of Allah (ﷺ) said: 'The prayer of any of you is not complete unless he performs wudu properly as enjoined by Allah, the Mighty and Sublime. So he should wash his face, his arms up to the elbows, and wipe his head, and (wash) his feet up to the ankles. Then he should magnify Allah (SWT) and praise Him and glorify Him.'\" - (One of the narrators) Hammam said: \"I heard him say: 'He should praise Allah and glorify Him and magnify Him.\" He said: \"I heard both of them.\" -\"He (the Prophet (ﷺ)) said: 'He should recite whatever is easy for him of the Quran that Allah has taught him and permitted him in it (the prayer). Then he should say the Takbir and bow until his joints settle and he is relaxed. Then he should say: 'Sami Allahu liman hamidah (Allah hears the one who praises Him)' and stand up straight until his backbone is straight (and at ease). Then he should say Takbir and prostrate until he has placed his face firmly on the ground.\" \"I heard him say: his forehead, until his joints settle and he is relaxed. Then he should say the Takbir and sit up until his backbone is straight (and at ease). Then he should prostrate until he has placed his face firmly on the ground and he is relaxed. If he does not do that then he has not completed his prayer",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 108
			}
		}
	]
}