{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"14": "The Book of Jumu'ah (Friday Prayer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1430,
			"arabicnumber": 1430,
			"text": "It was narrated that Abu Hurairah said:\"I went out to At-Tur and met Ka'b. He and I spent a day together, when I narrated things to him from the Messenger of Allah (ﷺ) and he narrated things to me from the Tawrah. I said to him: The Messenger of Allah (ﷺ) said: The best day on which the sun rises is Friday. On this day, Adam was created, on this day he was sent down, on it his repentance was accepted, on this day he died, and on this day the Hour will begin. There is no living creature on Earth that does not listen out from Friday morning until the sun rises, fearing the onset of the Hour, except the son of Adam. On (Friday) there is an hour in which, if a believer prays and asks Allah for something, He will give it to him. Ka'b said: Is that one day in every year? I said: No, it is every Friday.' Then Ka'b read in the Tawrah and said: The Messenger of Allah (ﷺ) spoke the truth; it is every Friday. Then I went out and met Basrah bin Abi Basrah Al-Ghifari. He said: From where have you come? I said: From At-Tur. He said: If I had met you before you went there, you would not have gone. I said to him: Why? He said: I heard the Messenger of Allah (ﷺ) say: Do not travel especially to visit any masjid except three: Al Masjid Al-Haram (in Makkah), my masjid (in Al-Madinah) and the Masjid of Bait Al-Maqdis (in Jerusalem). Then I met 'Abdullah bin Salam and said: 'If you had only seen me, I went to At-Tur and met Ka'b, and he and I spent the day together, when I narrated things to him from the Messenger of Allah (ﷺ) and he narrated things to me from the Tawrah. I said to him: The Messenger of Allah (ﷺ) said: The best day on which the sun rises is Friday. On this day, Adam was created, on this day he was sent down, on this day his repentance was accepted, on this day he died, and on this day the Hour will begin. There is no living creature on Earth that does not listen out from Friday morning until the sun rises, fearing the onset of the Hour, except the son of Adam. On (Friday) there is an hour in which, if a believer prays and asks Allah for something, He will give it to him. Ka'b said: That is one day in every year. 'Abdullah bin Salam said: Ka'b is not telling the truth. I said: Then Ka'b read (in the Tawrah) and said: The Messenger of Allah (ﷺ) spoke the truth; it is every Friday. 'Abdullah said: Ka'b spoke the truth; I know when that time is. I said: O my brother, tell me about it. He said: It is the last hour of Friday, before the sun sets. I said: Did you not hear the Messenger of Allah (ﷺ) say: If a believer prays, but that is not a time for prayer. He said: Did you not hear the Messenger of Allah (ﷺ) say: Whoever prays and sits waiting for the (next) prayer, is in a state of prayer until the next prayer comes? I said: Of course. He said: That is what it is",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 67
			}
		}
	]
}