{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"20": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1651,
			"arabicnumber": 1651,
			"text": "It was narrated that Sa'd bin Hisham bin 'Amir said:\" I came to Al-Madinah and entered upon Aishah, may Allah (SWT) be pleased with her. She said: 'Who are you?' I said: 'I am Sa'd bin Hisham bin 'Amir.' She said: 'May Allah have mercy on your father.' I said: 'Tell me about the prayer of the Messenger of Allah (ﷺ).' She said: 'The Messenger of Allah (ﷺ) did such and such.' I said: 'Yes indeed.' She said: 'The Messenger of Allah (ﷺ) used to pray Isha' at night, then he would go to his bed and sleep. In the middle of the night, he would get up to relieve himself and go to his water for purification and perform wudu. Then he went into the Masjid and prayed eight rak'ahs. I think he made the recitation, bowing and prostration equal in length. Then he prayed one rak'ah of witr, then he prayed two rak'ahs sitting down. Then he lay down on his side. Sometimes Bilal would come and tell him that it was time to pray before he napped, and sometimes he napped. And sometimes I was not sure if he had napped or not before he told him that it was time to pray. This is how the Messenger of Allah (ﷺ) used to pray until he grew older and gained weight\"- and she mentioned whatever Allah (SWT) willed about his gaining weight. She said: \"And the Prophet (ﷺ) used to lead the people in praying witr, then he would go to his bed. In the middle of the night, he would get up and go to water for purification, and to relieve himself, then he would perform wudu. Then he would go into the masjid and pray six rak'ahs, and I think he made the recitation, bowing, and prostration equal in length. Then he prayed one rak'ah of witr, then he prayed two rak'ahs sitting down. Then he lay down on his side. Sometimes Bilal would come and tell him that it was time to pray before he napped, and sometimes he napped. And sometimes I was not sure if he had napped or not before he told him that it was time to pray.\" She said: \"And this is how the Messenger of Allah (ﷺ) continued to pray",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 54
			}
		}
	]
}