{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"23": "The Book of Zakah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2447,
			"arabicnumber": 2447,
			"text": "It was narrated from Anas bin Malik that Abu Bakar wrote to them:\"This is the obligation of Sadaqah which the Messenger of Allah enjoined upon the Muslims, as Allah , the Mighty and Sublime, commanded the Messenger of Allah .Whoever is asked for it in the manner explained (in the letter of Abu Bakar), let him give it, and whoever is asked for more than that, let him not give it. When there are less than twenty-five camels, for every five camels, one sheep (is to be given). If the number reaches twenty five, then a Bint Makhad (a one-year old she-camel) is due, up to thirty-five. If a Bint Makhad is not available, then a Bin Labun (a two-year old male camel). If the number reaches thirty-six, then a Bint Labun (a two-yer-old she-camel) is due, up to forty-five. If the number reaches forty-six, then a Hiqqqah (a three-year-old she-camel) that has been bred from a stallion camel is due, up to sixty. If the number reaches sixty-one, then a Jadhah (a four-year-old she-camel) is due, up to seventy-six, then two Bint Labuns (two-year-old she-camels0 are due, up to ninety. If the number reaches ninety-one, then two Hiqqahs (three-year-old she-camels) that have been bred from stallion camels are due, up to one hundred and twenty. If there are more than one hundred and twenty, then for every forty a Bint Labun, and for every fifty a Hiqqah. In the event that a person does not have a camel of the age specified according to the Hiaqah regulations, then if a person owes a Jadhah as Sadaqah but he does not have a Jadhah, then a Hiqqah should be accepted from him, and he should give two sheep along with it if they are available, or twenty Dirhams, If he owes a Hiqqah as Sadaqah and he does not have Hiqqah but he has a Jadhah, then if should be accepted from him, and the Zakah collector should give him twenty Dirhams, or two sheep if they are available. If a person owes a Hiqqah as Sadaqah and he does not have one, but he has a Bint Labun, it should be accepted from him, and he should give two sheep along with it if they are available, or twenty Dirhams. If a person owes a Bint Labun as Sadaqah but he only has a Hiqaah, then it should be accepted from him and the Zakah collector should give him twenty Dirhams, or two sheep. If a person owes a Bint Labun as Sadaqah but he only has a Bint Makhad, then it should be accepted from him, and he should be accepted from him, and he should give two sheep along with it if they are available, or twenty Dirhams. If a person owes a Bint Makhad as Sadaqah but he only has a Bint Labun, a male; it should be accepted from him, and he does not have to give anything else along with it. If a person has only four camels he does not have to give anything unless their owner wants to. With regard to the Sadaqah on grazing sheep, if there are forty, then one sheep is due upon them, up to one hundred and twenty. If there is one more, then two sheep are due, up to two hundred. If there is one more, then three sheep are due, up to three hundred. If there are more than that, then for every hundred, one sheep is due. No feeble, defective or male sheep should be taken as Sadaqah unless the Zakah collector wishes. Do not combine separate flocks or separate combined flocks for fear of Sadaqah. Each partner (who has a share in a combined flock) should pay the Sadaqah in proportion to his shares. If a man's flock is one less than forty sheep, then nothing is due from them, unless their owner wishes. With regard to silver, one-quarter of one-tenth, and if there are only one hundred and ninety Dirhams, no Zakah is due unless the owner wishes",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 13
			}
		}
	]
}