{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"24": "The Book of Hajj"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2974,
			"arabicnumber": 2974,
			"text": "It was narrated that Jabir said:\"The Messenger of Allah circumambulated the House seven times, walking rapidly in three circuits and walking (at a normal pace)b in three. Then he stood at the Maqam (place) of Ibrahim as a place of prayer, raising his voice so that the people could hear. Then he went and touched the Black Stone and went (to perform Sai) and said: 'We will start with that with which Allah started.' So he started with As-Safa, climbing up until he could see the House and he said three times: ''La ilaha illallah, Wahdahu la sharika lah, lahul-mulku wa lahul-hamdu, yuhyi wa yumitu, wa huwaala kulli shayin qadir (There is none worthy of worship except Allah alone with no partner or associate, His is the dominion and to Him be praise, He gives life and death, and He has power over all things).' Then exclaimed Allah's greatness and praised Him, then he supplicated as much as was decreed for him. Then he came down walking, until he reached level ground at the bottom of the valley. Then he hastened until the ground began to rise. Then he walked until he came to Al-Marwah and climbed up it, and when he could see the house he said: 'La ilaha illallah, Wahdahu la sharika lah, lahul-mulku wa lahul-hamdu, yuhyi wa yumitu, wa huwaala kulli shayin qadir (There is none worthy of worship except Allah alone with no partner or associate, His is the dominion and to Him be praise, He gives life and death, and He has power over all things).' He said that three times, then he remembered Allah, and glorified and praised Him, then he supplicated there for as long as Allah willed. And he did that until he had finished Sai",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 357
			}
		}
	]
}