{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"25": "The Book of Jihad"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3137,
			"arabicnumber": 3137,
			"text": "It was narrated from Abu Hurairah, that one of the people of Ash-Sham said to him:\"O Shaikh, tell me of a Hadith that you heard from the Messenger of Allah (ﷺ).\" (He said: \"Yes; I heard the Messenger of Allah (ﷺ)) say: 'The first of people for whom judgment will be passed on the Day of Resurrection are three. A man who was martyred. He will be brought and Allah will remind him of His blessings and he will acknowledge them. He will say: What did you do with them? He will say: I fought for Your sake until I was martyred. He will say: You are lying. You fought so that it would be said that so-and-so is brave, and it was said. Then He will order that he be dragged on his face and thrown into the Fire. And (the second will be) a man who acquired knowledge and taught others,and read Qur'an. He will be brought, and Allah will remind him of His blessings, and he will acknowledge them. He will say: What did you do with them? He will say: I acquired knowledge and taught others, and read the Qur'an for Your sake. He will say: You are lying. You acquired knowledge so that it would be said that you were a scholar; and you read Qur'an so that it would be said that you were a reciter, and it was said. Then He will order that he be dragged on his face and thrown into the Fire. And (the third will be) a man whom Allah made rich and gave him all kinds of wealth. He will be brought and Allah will remind him of His blessings, and he will acknowledge them. he will say: What did you do with them? He will say: I did not leave any way that You like wealth to be spent - Abu 'Abdur-Rahman (An-Nasa'i) said: I did not understand \"what You like\" as I wanted to [1] - \"but I spent it.\" He will say: \"You are lying. You spent it so that it would be said that he was generous, and it was said.\" Then he will order that he be dragged on his face and thrown into the Fire.'\" [1] That is, he did not hear or understand what came after it as well as he wanted to, but it was similar to what follows regarding the spending. Similar was stated by Shaikh 'Abdur-Rahman Al-punjani in his notes on the text, according to Al-Funjani in his commentary At-Ta'iqat As-Salafiyyah (2:51)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 53
			}
		}
	]
}