{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"25": "The Book of Jihad"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3150,
			"arabicnumber": 3150,
			"text": "Salamah bin Al-Akwa' said:\"On the day of Khaibar, my brother fought fiercely alongside the Messenger of Allah (ﷺ), then his sword recoiled upon him and killed him. The Companions of the Messenger of Allah (ﷺ), complaining about that, said: 'A man has died by his own weapon.'\" Salamah said: \"The Messenger of Allah (ﷺ) returned from Khaibar and I said: 'O Messenger of Allah, do you permit me to recite some lines of Rajaz verse to you?' The Messenger of Allah (ﷺ) gave him permission but 'Umar bin Al-Khattab, may Allah be pleased with him, said: \"Think what you are saying.\" \"I said: 'By Allah, if Allah had not guided us we would not have been guided We would not have given in charity nor prayed' The Messenger of Allah (ﷺ) said: 'You have spoken the truth.' (I continued:) 'Send down tranquility upon us, And make us steadfast when we meet the enemy. For the idolators have transgressed against us.' When I completed my Rajaz verse, the Messenger of Allah (ﷺ) said: 'Who said that?' I said: 'My brother.' The Messenger of Allah (ﷺ) said: 'May Allah have mercy on him.' I said: 'O Messenger of Allah, some people are afraid to offer the (funeral) prayer for him, and they are saying that he is a man who died by his own weapon.' The Messenger of Allah (ﷺ) said: 'He died striving as a Mujahid.'\" Ibn Shihab said: \"Then I asked a son of Salamah bin Al-Akwa', and he narrated a similar report to me from his father, except that he said: 'When I said: Some people are afraid to offer the (funeral) prayer for him, the Messenger of Allah (ﷺ) said: They lied. He died striving as Mujahid, and he will have a twofold reward, and he gestured with two of his fingers",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 66
			}
		}
	]
}