{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"27": "The Book of Divorce"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3451,
			"arabicnumber": 3451,
			"text": "It was narrated that 'Aishah said:\"Barirah made a contract that she would be freed in return for nine Awaq, one Uqiyyah to be paid each year.\" She came to 'Aishah asking for help and she said: \"No, not unless they agree to accept the sum in one payment, and that the Wala' will go to me.\" Barirah went and spoke to her masters but they insisted that the Wala' should be for them. She came to 'Aishah and the Messenger of Allah came, and she told her what her masters had said. She said: \"No, by Allah, not unless Wala' is to me.\" The Messenger of Allah said: \"What is this?\" She said: \"O Messenger of Allah, Barirah came to me and asked me to help her with her contract of manumission, and I said no, not unless they agree to accept the sum in one payment, and that the Wala' will be for me. She mentioned that to her masters and they insisted that the Wala' should be for them.\" The Messenger of Allah said: \"Buy her, and stipulate that the Wala' is for the one who sets the slave free.\" Then he stood up and addressed the people and said: \"What is the matter with people who stipulate conditions that are not in the Book of Allah, the Mighty and Sublime? They say: 'I set so-and-so free but the Wala' will be to me.' Every condition that is not in the Book of Allah, the Mighty and Sublime, is a false condition, even if there are a hundred conditions.\" And the Messenger of Allah gave her the choice with regard to her husband who was still a slave, and she chose herself. 'Urwah said: \"If he had been free the Messenger of Allah would not have given her the choice",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 63
			}
		}
	]
}