{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"29": "The Book of Endowments"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3608,
			"arabicnumber": 3608,
			"text": "It was narrated that Thumamah bin Hazn Al-Qushairi said:\"I was present at the house when 'Uthman looked out over them and said: 'I adjure you by Allah and by Islam, are you aware that when the Messenger of Allah came to Al-Madinah, and it had no water that was considered sweet (suitable for drinking) except the well of Rumah, he said: \"Who will buy the well of Rumah and dip his bucket in it alongside the buckets of the Muslims, in return for a better one in Paradise?\" and I bought it with my capital and dipped my bucket into it alongside the buckets of the Muslims? Yet today you are preventing me from drinking from it, so that I have to drink salty water.' They said: 'By Allah, yes.' He said: 'I adjure you by Allah and by Islam, are you aware that I equipped the army of Al-'Usrah (Tabuk) from my own wealth?' They said: 'By Allah, yes.' He said: 'I adjure you by Allah and by Islam, are you aware that when the Masjid became too small for the people and the Messenger of Allah said: Who will buy the plot of the family of so and so and add it to the Masjid, in return for a better plot in Paradise? I bought it with my capital and added it to the Masjid? Yet now you are preventing me from praying two Rak'ahs therein.' They said: 'By Allah, yes.' He said: 'I adjure you by Allah and by Islam, are you aware that when the Messenger of Allah was atop Thabir -the Thabir in Makkah- and with him were Abu Bakr, 'Umar and myself, the mountain shook, and the Messenger of Allah kicked it with his foot and said: Be still, Thabir, for upon you are a Prophet, a Siddiq and two martyrs?' They said: 'By Allah, yes.' He said: 'Allahu Akbar! They have testified for me, by the Lord of the Ka'bah' -i.e., that I am a martyr",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 15
			}
		}
	]
}