{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"38": "The Book of Distribution of Al-Fay'"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4147,
			"arabicnumber": 4147,
			"text": "It was narrated that Mujahid said:\"The Khumus that is for Allah and His Messenger was for the Prophet and His relatives; they did not take anything from the Sadaqah. The Prophet was allocated one-fifth of the Khumus; his relatives were allocated one-fifth of the Khumus; the same was allocated to orphans, the poor and they wayfarers.\" (Da 'if) Abu Abdur-Rahman (An-Nasi) said: Allah, the Majestic is he and Praised, said: \"And know that whatever of spoils of war that you may gain, verily, one-fifth of it is assigned to Allah, and to the Messenger, and to the near relatives ( of the Messenger (Muhammad)), (and also) the orphans, Al-Masakin (the Poor) and the wayfarer.\" His, the Mighty and Sublime, saying to Allah starts the speech since everything is of Allah, the Mighty and Sublime, saying to Allah starts the speech since everything is of Allah, the Mighty and Sublime. And perhaps He only oened His speech about the Fay and the Khumus, mentioning Himself, because that is the noblest of earnings. And He did not attribute Sadaqah to Himself, the Mighty and Sublime, because that is the dirt of people. And Allah knows best. It was said that something should be taken form the spoils of war and placed inside the Kabah, and this is the share that is for Allah, the Mighty and Sublime. The share of the Messenger is to be given to the imam to buy horses and weapons, and to give to whomever he thinks will benefit the people of Islam, and to the people of Hadith, Knowledge, Fiqh and the Quran. The share that is for near relatives should be given to Banu Hashim and Banu Al-Muttablib, rich and poor alike, or it was said that it should be given to the poor among them and not to the rich, such as orphans and wayfarers. This is the view that is more appropriate in my view, and Allah knows best. And the young and the old, male and female, are equal in that, because Allah, the mighty and sublime, has allocated it to them and the Messenger of Allah distributed it among them, and there is nothing in the Hadith to indicate that he preferred some of them over others. And there is no scholarly dispute, as far as we know, to suggest that if a man bequeaths one-third of his wealth to such a tribe, to be distributed out among them equally, that it should be done otherwise, unless the giver stipulated otherwise. And Allah is the source of strength. And (there is) a share for the orphans among the Muslims, and a share for the poor among the Muslims, and a share for the wayfarers among the Muslims. No one should be given both a share for the poor and a share for the wayfarer; it is to be said to him: \"Take whichever of them you want.\" And the other four-fifths are to be divided by the imam among those adult Muslims who were present in the battle. (Daif)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 15
			}
		}
	]
}