{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"47": "The Book Of Faith and its Signs"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4990,
			"arabicnumber": 4990,
			"text": "Abdullah bin 'Umar said:\"Umar bin Al-Khattab told me: 'While we were with the Messenger of Allah [SAW] one day, a man appeared before us whose clothes were exceedingly white and whose hair was exceedingly black. We could see no signs of travel on him, but none of us knew him. He came and sat before the Messenger of Allah [SAW], putting his knees against his, and placing his hands on his thighs, then he said: \"O Muhammad, tell me about Islam.\" He said: \"It is to bear witness that there is none worthy of worship except Allah [SWT] and that Muhammad [SAW] is the Messenger of Allah, to establish the Salah, to give Zakah, to fast Ramadan, and to perform Hajj to the House if you are able to bear the journey.\" He said: \"You have spoken the truth.\" And we were amazed by his asking him, and then saying, \"You have spoken the truth\". Then he said: \"Tell me about Faith.\" He said: \"It is to believe in Allah [SWT] , His Angels, His Books, His Messengers, the Last Day, and in the Divine Decree, its good and its bad.\" He said: \"You have spoken the truth.\" He said: \"Tell me about Al-Ihsan.\" He said: \"It is to worship Allah [SWT] as if you can see Him, for although you cannot see Him, He can see you.\" He said: \"Tell me about the Hour.\" He said: \"The one who is asked about it does not know more about it than the one who is asking.\" He said: \"Then tell me about its signs.\" He said: \"When a slave woman gives birth to her mistress, when you see the barefoot, naked, destitute shepherds competing in making tall buildings.'\" 'Umar said: 'Three (days) passed, then the Messenger of Allah [SAW] said to me: \"O 'Umar, do you know who the questioner was?\" I said: \"Allah and His Messenger know best.\" He said: \"That was Jibril, peace be upon him, who came to you to teach you your religion",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 6
			}
		}
	]
}