{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"49": "The Book of the Etiquette of Judges"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5400,
			"arabicnumber": 5400,
			"text": "It was narrated that Ibn 'Abbas said:\"There were kings after 'Isa bin Mariam who altered the Tawrah and the Injil, but there were among them believers who read the Tawrah. It was said to their kings: 'We have never heard of any slander worse than that of those (believers) who slander us and recite: \"And whosoever does not judge by what Allah has revealed, such are the disbelievers.\" In these Verses, they are criticizing us for our deeds when they recite them.' So he called them together and gave them the choice between being put to death, or giving up reading the Tawrah and Injil, except for what had been altered. They said: 'Why do you want us to change? Leave us alone.' Some of them said: 'Build us a tower and let us go up there, and give us something to lift up our food and drink so we do not have to mix with you.' Others said: 'Let us go and wander throughout the land, and we will drink as the wild animals drink, and if you capture us in your land, you may kill us.' Others said: 'Build houses for us in the wilderness, and we will dig wells and grow vegetables, and we will not mix with you or pass by you, for there is no one of the tribes among whom we do not have close relatives.' So they did that, and Allah revealed the words: 'But the monasticism which they invented for themselves, We did not prescribe for them, but (they sought it) only to please Allah therewith, but that they did not observe it with the right observance.' Then others said: 'We will worship as so-and-so worshipped, and we will wander as so-and-so wandered, and we will adopt houses (in the wilderness) as so-and-so did.' But they were still following their Shirk with no knowledge of the faith of those whom they claimed to be following. When Allah sent the Prophet [SAW], and they were only a few of them left, a man came down from his cell, and a wanderer came from his travels, and a monk came from his monastery, and they believed in him. And Allah said: 'O you who believe! Fear Allah, and believe in His Messenger (Muhammad), He will give you a double portion of His mercy - meaning, two rewards, because of their having believed in 'Isa and in the Tawrah and Injil, and for having believing in Muhammad [SAW]; and He will give you a light by which you shall walk (straight), - meaning, the Qur'an, and their following the Prophet [SAW]; and He said: 'So that the people of the Scripture (Jews and Christians) may know that they have no power whatsoever over the Grace of Allah",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 22
			}
		}
	]
}