{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"7": "The Book of the Adhan (The Call to Prayer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 632,
			"arabicnumber": 632,
			"text": "Abdul-'Aziz bin 'Abdul-Malik bin Abu Mahdhurah narrated that 'Abdullah bin Muhairiz - who was an orphan under the care of Abu Mahdhurah until he prepared him to go to Ash-Sham - informed him:he said: \"I said to Abu Mahdhurah: 'I am going to Ash-Sham and I am afraid that I will be asked about how you say the Adhan. \"'He told me that Abu Mahdhurah said to him, I went out with a group of people and we were somewhere on the road to Hunain when the Messenger of Allah (S.A.W) was coming back from Hunain. The Messenger of Allah met us somewhere on the road and the Muadhdhin of the Messenger of Allah called the Adhan for prayer in the presence of the Messenger of Allah (S.A.W). We heard the voice of the Muadh'dhin and we were careless about it (the Adhan), so we started yelling, immitating and mocking it. The Messenger of Allah (S.A.W) heard us, so he sent some people who brought us to stand in front of him. He said, 'Who is the one whose voice I heard so loud?' The people all pointed to me, and they were telling the truth. He sent them all away, but kept me there and said to me: 'Stand up and call the Adhan for the Prayer.' I stood up and the Messenger of Allah (S.A.W) taught me the Adhan himself. He Said, 'Say: 'Allahu Akbar, Allahu akbar, Allahu Akbar, Allahu Akbar; Ashhadu an la ilaha illallah, Ashhadu an la ilaha illallah; Ashhadu anna Muhammadan Rasulallah, Ashhadu anna Muhammadan Rasulallah (Allah is the Greatest,Allah is the Greatest, Allah is the Greatest, Allah is the Greatest; I bear witness that there is none worthy of worship except Allah, I bear witness that there is none worthy of worship except Allah; I bear witness that Muhammad is the Messenger Allah,I bear witness that Muhammad is the Messenger Allah).' Then he said: 'Then repeat and say in a loud voice:Ashhadu an la ilaha illallah, Ashhadu an la ilaha illallah; Ashhadu anna Muhammadan Rasulallah, Ashhadu anna Muhammadan Rasulallah; Hayya 'alas-salah, Hayya 'ala-salah; Hayya 'alal-falah Hayya 'alal-falah; Allahu Akbar, Allahu Akbar; La ilaha ill-Allah (I bear witness that there is none worthy of worship except Allah, I bear witness that there is none worthy of worship except Allah; I bear witness that Muhammad is the Messenger of Allah, I bear witness that Muhammad is the Messenger of Allah; Come to prayer, come to prayer; come to prosperity, come to prosperity; Allah is the Greatest, Allah is the Greatest; there is none worthy of worship except Allah).' Then he called me when I had finished saying the Adhan, and he gave me a bundle in which there was some silver. I said: 'O Messenger of Allah (S.A.W), let me be the one doing the Adhan in Makkah.' He said: 'I command you to do so.' Then I came to 'Attab bin Asid who was the governor of the Messenger of Allah (S.A.W) in Makkah, and I called the Adhan for prayer with him upon the orders of the Messenger of Allah (S.A.W)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 7
			}
		}
	]
}