{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"8": "The Book of the Masjids"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 731,
			"arabicnumber": 731,
			"text": "Abdullah bin Ka'b said:\"I heard Ka'b bin Malik telling the story of when he stayed behind from going out on the campaign of Tabuk with the Messenger of Allah (ﷺ). He said: 'The Messenger of Allah (ﷺ) came back in the morning, and when he came back from a journey he would go to the Masjid first and pray two Rak'ahs there, then he would sit to (meet with) the people. When he did that, those who had stayed behind came to him and started giving their excuses, swearing by Allah. There were eighty-odd men, and the Messenger of Allah (ﷺ) accepted what they declared and accepted their oaths of allegiance; he prayed for forgiveness for them and left whatever was in their hearts to Allah. Then when I came and greeted him, he smiled as one who is angry, then he said: 'Come here.' So I came and sat in front of him, [1] and he said: 'What kept you behind? Did you not buy a mount?' I said: 'O Messenger of Allah, if I were to sit before anyone other than you of those who hold high positions in this world, I would find a way to avoid his anger. I am an eloquent man but, by Allah, I know that if I were to tell you a lie today to make you pleased with me, Allah would soon make you angry with me, but if I tell you the truth, it will make you angry with me, but I will still have the hope that Allah may forgive me. I have never been in a better position, physically or financially, than the time when I stayed behind and did not join you.' The Messenger of Allah (ﷺ) said: 'This man has spoken the truth. Go away until Allah decides concerning you.' So I got up and went away.\" This is an abridged version of narration. [1] It is this which the author cited the narration for. While the absence of the mention of a thing - in this case prayer - is not a proof that it does not exist",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 44
			}
		}
	]
}