{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"10": "The Book of Leading the Prayer (Al-Imamah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 784,
			"arabicnumber": 784,
			"text": "It was narrated from Sahl bin Sa'd that the Messenger of Allah (ﷺ) heard that there was a dispute among Banu 'Amr bin 'Awf, so he went to them with some other people to reconcile between them. The Messenger of Allah (ﷺ) was delayed there, and the time for Zuhr came. Bilal came to Abu Bakr and said to him:\"The Messenger of Allah (ﷺ) has been delayed (there) and the time for prayer has come, will you lead the people in prayer?\" Abu Bakr said: 'Yes, if you wish.' Bilal said the Iqamah and Abu Bakr went forward and said the Takbir for the people. Then the Messenger of Allah(ﷺ) came, passing through the rows (of praying people) and stood in the (first) row and the people started clapping. Abu Bakr would never glance sideways in his prayer but when the people clapped so much he looked back and (ﷺ)Messenger of Allah (ﷺ). The Messenger of Allah(ﷺ) gestured to him to carry on praying. Aha Bakr raised his hands praising Allah the Mighty and Sublime, and retreated till he reached the (first) row. Then the Messenger ofAllah(ﷺ) went forward and led the people in the prayer. When he completed the prayer he turned to face the people and said: '0 people, why did you start clapping when something unusual happened to you in the prayer? Clapping is only for women. So whoever among you comes across something in the prayer should say: 'Subhan Allah' for there is none who will not turn round when they hear him saying Subhan Allah. 0 Abu Bakr! What prevented you from leading the people in the prayer when I gestured to you to do so?' Abu Bakr replied: 'It is not fitting for the son of Abu Quhafah to lead the prayer in the presence of the Messenger of Allah (ﷺ)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 8
			}
		}
	]
}