{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"11": "The Book of the Commencement of the Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 897,
			"arabicnumber": 897,
			"text": "It was narrated from Ali, may Allah be pleased with him, that:When the Messenger of Allah (ﷺ) started to pray, he would say Takbir, then say: \"Wajahtu wajhi lilladhi fataras-samawatiwal-arda hanifan wa ma ana minal-mushrikin. Inna salati wa nusuki wa mahyaya wa mamati lillahi rabbil-alamin, la sharika lahu, wa bidhalika umirtu wa ana min al-muslimin. Allahumma! Antal-maliku la ilaha illa ant, ana abduka zalamtu nafsi wa'taraftu bidhanbi faghfirli dhunubi jami'an, la yaghfirudhunuba illa anta, wahdini lihasanil-ahklaqi, la yahdi li ahsaniha illa anta wasrif anni sayy'aha la yasrifu anni sayy'aha illa anta, labaika wa sa'daika, wal-khairu kulluhu fi yadaika wash-sharru laisa ilaika ana bika wa ilaika ana bika wa ilaika tabarkta wa ta'alaita astaghfiruka wa atubu ilaik. (Verily, I have turned my face toward Him who created the Heavens and the Earth hanifa (worhsipping none but Allah Alone), and I am not of the idolaters. Verily, my salah, my sacrifice, my living, and my dying are for Allah, the Lord of the all that exists. He has no partner. And of this I have been commanded, and I am one of the Muslims. O Allah, You are the Sovereign and there is none worthy of worship but You. I am Your slave, I have wronged myself and I acknowledge my sin. Forgive me all my sins for no one forgives sins but You. Guide me to the best of manners for none can guide to the best of them but You. Protect me from bad manners for none can protect against them but You. I am at Your service, all goodness is in Your hands, and evil is not attributed to You. I rely on You and turn to You, blessed and exalted are You, I seek Your forgiveness and repent to You",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 22
			}
		}
	]
}