{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"2": "Prayer (Kitab Al-Salat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1055,
			"arabicnumber": 1055,
			"text": "Nebi (s.a.v.)'in hanımı Âişe (r.a)'dan; demiştir ki: İnsanlar, evlerinden ve Avâlî'den nöbetleşe olarak cuma'ya gelirlerdi. izah: Buhârî, cuma; Müslim, cuma Hadis-i şerifin Buhârî'deki rivayeti yine Hz. Âişe'dendir.Fakat dana uzundur.Buradakine ilaveten, cumaya gelenle­rin üzerlerinde toz ve ter bulunduğu onlardan birinin üzerinde toz ve ter ol­duğu halde Resûlullah'a geldiğinde Efendimizin ''Keşke bu gününüzde yıkansaniz\"[Ebû Dâvûd, tahâre] buyurduğu rivayet edilmektedir. \"Nöbetleşe gelirlerdi” şeklinde türkçeleştirdiğimiz kelimesi, Kastalânî ve Aynî'nin beyânlarına göre, mastarının tefâül babın-dandır. Bu kelime bazı rivayetlerde şeklindedir. Bu, ve fiillerinin aynı manada olduğunu gösterir. Avâlî, âliye kelimesinin çoğuludur. Daha önce de temas edildiği gibi, Medine'nin doğu tarafında 2-12 mil arasındaki mesafede bulunan köylere ve yerleşim bölgelerine denir. Ebû Davud'un bu hadis-i şerifi, \"Cuma kimlere farzdır?\" başlığı altı­na alması, onun köylerde ve obalarda yaşayanlara cuma'mn farz olduğu gö­rüşünde olduğunu gösterir. Çünkü Hadis-i Şerifin ifâdesinden müslümanların köylerden cuma için Medine'ye geldikleri anlaşılmaktadır. Bu da cumanın onlara farz olmasını gerektirir. Ancak hadis-i şerif köy ve obalarda oturanlara cumanın farz olduğuna kesinlikle delil olamaz. Çünkü burada Avâlî'den olanların cumaya nöbetle­şe geldikleri söylenmektedir. Eğer cuma onlara farz olsaydı nöbetleşe değil, özrü olmayan herkesin her cuma gelmesi gerekirdi. Hepsi gelmediğine göre, bu haber onlara cumanın farz olduğuna delâlet etmez. Onların cumaya gel­meleri tamamen ihtiyarî olduğunu gösterir. Bu konuda Aynî'de; \"Eğer cuma Avâlî'de oturanlara farz olsaydı, nö­betleşe olarak gelmezler, hepsi birden gelirlerdi\" demektedir. Diğer Buhârî sarihleri Kastalânî, Askalanî ve Kirmânî de Aynî'nin söylediklerine benzer ifadelerle şehirlerin dışında oturanlara cumanın farz ol­madığını belirtmişlerdir. Burada söz konusu olan şehirden maksat, Hidâye'dc, (Ebû Yûsuf'un görüşü olmasına rağmen Hanefi mezhebinin tercihi olarak) gösterildiğine göre, idarecisi olan, hükümleri infaz ve cezalan tatbik eden hâkimi bulunan yer­lerdir. Ebu Yusuf'dan nakledilen bir başka görüşe göre de şehir, ahâlisi en büyük camilerine toplandığında cami almayacak kadar kalabalık olan yer­lerdir. Fethu'I-KadiVde Ebû Hanife'nin şehir'i şu şekilde tarif etliği bildiril­mektedir: \"İçerisinde sokaklar, çarşılar ve meskûn mahalleri olan, mazlu­mu zâlimden koruyacak valisi ve çeşitli hadiseler karşısında kendisine müracaat edilen âlimi bulunan her yerdir.\" Ancak yukarıda da ifâde edildi­ği gibi Hidâye sahibi, Ebû Yûsuf'un ilk görüşünü mezhebin görüşü olarak takdim etmiştir. Bir kimseye cuma namazının farz olması için bazı şartlar vardır. Bu şart­lardan bir kısmında bütün mezhubler müttefik olduğu halde bazılarında ara­larında görüş ayrılıkları vardır. Bütün mezheblcrin ittifak ettikleri şartlar şunlardır: Cumanm farz olması için: 1. Erkek olmak. Ancak kadınlar cumayı kılmışlarsa, bir daha öğle na­mazını kılmalarına gerek yoktur. 2. Hür olmak, 3. Kör olmamak.Gözü görmediği halde camiye giderken kendisine re­fakat edecek birumi bulabilen kişi hakkında mezhebfer arasında ihtilâf var­dır. Hanefîlerden, İmam-ı Azam'a göre böyle birine cuma farz değil, Ebû Yûsuf ve Muhammed'e göre farzdır. Şafiîlerden de iki görüş nakledilmiştir. 4. Mukim olmak. Müsâfire cuma farz değildir. Şafiî ve~\"H\"anbelîlere gö­re müsâfir, cuma kılınan bir yerde dört günden fazla kalmaya niyet ederse ona da cuma farzdır. 5. Cuma kılınan bir şehirde olup camiye Hanefîlerde 5040 m.Malikilerde üç mil, Şâfiîlerde de ezan duyulabilecek bir mesafede olmak.,Bulundu­ğu yer ile cami arasında bir boşluk olması hâlinde, arada meskun olmayan bir boşluk varsa, durum değişir.O konu bundan sonraki hadisin şerhinde açıklanacaktır.Ancak Şâfiîlerde ezan, duyulmayan yerlerde mükellef adedi kırk veya daha fazla olursa bulundukları yerde namazlarını kılmaları gerekir, 6. Sıhhati yerinde olmak: Hanefîlere göre topal olmamak, ayrı bir şart olarak zikredilir. Bunlardan başka Şafiî, Maliki ve Hanbelîlete göre şu şartların bulunması da cumanın farz olması için gereklidir: a. Cumayı terk etmeyi mubah kılan bir özrü bulunmayacak, b. İhtiyar olmayacak, (bu konu tafsilâtlıdır). c. Bir zâlimin kendisine zarar vermesinden veya hapsetmesinden kor­kusu olmayacak. d. Mal, can veya ırza bir zararın gelmesinden emin olacak. 5. Mükellef namaz kılacak yerde yerleşmiş olacak. Bu mezheplere göre mükellef sayısı kırktan fazla olan köylerde cuma kılınır. Çöllerde veya çadırlarda cuma farz değildir.Bedâyi'de belirtildiğine göre, Hanefi mezhebinde köylerde cuma farz değildir. Şehirlerde veya şehre 5040 m. mesafedeki banliyölerinde yaşayanlara cuma farzdır. Buraya kadar yazdığımız şartlar, cumanın farz olmasının şartlandır. Bir de cumanın sahih olmasının şartlan Vardır. Ancak onlar şu anda konumu­zun dışında olduğu için burada temas edilmeyecektir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 666
			}
		}
	]
}