{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"3": "The Book Of The Prayer For Rain (Kitab al-Istisqa')"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1162,
			"arabicnumber": 1162,
			"text": "Abbâd b. Temîm el-Mâzinî'den rivayet edildiğine göre; ashâbdan olan amcasını şöyle derken işitmiş: Bir gün Resûlullah (S.A.V.) yağmur duasına çıktı. Allah (c,c.)’ya duâ eder(ken), insanlara sırtını çevirerek -Süleyman b. Davud'un dedi(ğine göre), kıbleye döndü- elbisesini ters çevirdi. Sonra da iki rekat namaz kıldı. izah: Müslim, istiskâ; Tahâvî, Şerhu Meâni'l-âsâr, I, 324. Îbn Ebi Zi'b(rivayetinde) \"Resûlullah bu rekatlarde okudu\" de­di. Îbnu's-Serh de (İbn Ebi Zi'b'in bununla) \"açıktan okumayı\" kast ettiğini ilâve etti.[11] Hadisin senedine bakıldığı takdirde râvîlerin bazı tabakalarda birden fazla olduğu görülür. Bu durum, hadisin naklinde bazı farklılıkların ortaya çıkmasına sebeb olmuştur. Metindeki \"kıbleye döndü\" cümlesi müellifin şeyhlerinden Süleyman b. Davud'un rivayetinde olduğu hal­de, Îbnu's-Serh'in rivayetinde yer almamıştır. Hadisi îbn Şihâb'dan duyan râvîlerden Yûnus, H'z. Peygamberin istiska duâsındaki namazda birşey oku­duğuna dair hiçbir nakilde bulunmamış: İbn Ebî Zi'b ise, Efendimizin na­mazda okuduğunu haber vermiştir. tbnu's-Serh bu kıraatin cehri olduğunu söylemiştir. Hadis-i şerifin Müslim'deki rivayetinde de kıraatten hiç söz edilmemek­tedir. Geride kalan kısımda, oradaki ifadelerle, Ebü Dâvûd'daki ifadeler ara­sında pek fark göze çarpmamaktadır. Hz. Peygamber'in dua ederken sırtını insanlara döndü,meşine sebep kıb­leyi önüne alma arzusudur. Anlaşıldığına göre Efendimizin durduğu yer, ce­maatle kıblenin arasına düşüyordu. Onun için Resûlullah namazda olduğu gibi sırtını cemaate çevirmek zorunda kaldı. Hadiste \"sırtını cemaate verdi\" ifâdesinin yanında, \"kıbleye döndü\" sözünün zaid olduğu hatıra gelebilir. Ama İbn Hacer'in beyânına göre, bunlar arasında fark vardır. Sırtım cema­ate verdiği halde, tam kıbleye yönelmemesi bunun için de yönünü biraz da­ha çevirmiş olması muhtemeldir. Hz. Peygamberin bu hareketi, duâ esnasında kıbleye karşı durmanın sünnet olduğunu gösterir. Metinde de görüldüğü üzere, bu rivâyetde Fahr-i Kâinat Efendimizin çıktığı bir yağmur duasında duanın yanı sıra elbisesini ters çevirdiği ve iki rek'at namaz kıldığı haber verilmektedir. Bu hususlar hakkında bir önceki hadiste yeterli bilgi verilmiştir. Ancak yukarıdaki rivayette önce namaz da­ha sonra da dua zikredilmişti. Burada ise, Efendimizin evvelâ dua edip son­ra namaz kıldıkları beyân edilmektedir. Fakat bu farklılık hadisler arasında bir tezat olduğunu göstermez. Çünkü Resûlullah'm birden çok yağmur dua­sına çıkıp her iki rivayette belirtilen şekilleri uygulamış olması mümkündür",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 2
			}
		}
	]
}