{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"4": "Prayer (Kitab Al-Salat): Detailed Rules of Law about the Prayer during Journey"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1236,
			"arabicnumber": 1236,
			"text": "Ebû Ayyaş ez-Zürâkî'den; demiştir ki: Biz Resûlullah (s.a.v.) ile birlikte Usfân'da bulunuyorduk. Müşriklerin başında da Hâlid b. el-Velîd bulunuyordu. Öğleyi kıldık. Müşrikler \"gerçekten çok gafil davrandık, çok hatalı davrandık onlar namazda iken üzerlerine bir yüklenseydik (ne güzel olurdu)!\" demeye başladılar. Bunun üzerine öğle ile ikindi namazı arasında \"Kasr âyeti\" nazil oldu. ikindi (vakti) gelince Resûlullah (s.a.v.) kalkıp kıbleye karşı durdu. Müşrikler de karşısında idiler. Arkasında bir saf teşekkül etti. Bu saffın arkasında da başka bir saf (vardı). Resûlullah (s.a.v.)'in rükû'a varmasıyla hepsi birden rükû'a vardılar. Sonra arka saftakiler cemaati ayakta beklerken imam arkasındaki (birinci) safla beraber secdeye vardı. Bunlar secdeleri yapıp kalkınca arkalarında bulunan diğerleri secdeye vardılar, sonra (Resûl-i Ekrem'in) arkasındaki saf geri çekilerek arkadakilerin yerini, arka saftakiler de ilerleyerek ön saftakilerin yerini aldı. Sonra Resûlullah (s.a.v.) rükû'a varınca (her iki saftakiler) birlikte rükû'a vardılar. (Resûl-i Ekrem) secdeye varınca, hemen arkasında bulunan (birinci saf) da secdeye vardı. Diğerleri ise bunları (ayakta) bekliyorlardı. Rssûİ-i Ekrem (s.a.v.) oturunca hemen arkasındaki saf da oturdu, sonra da hep beraber oturdular ve (Resûl-i Ekrem -s.a.v.-) hepsine birden selâm verdi. (Resûl-i Ekrem) Usfan'da kıldığı bu namazı bir de Beni Süleym'de kıldı. Ebû Dâvûd dedi ki: (Hadisin metninden anlaşılan) bu mânâyı, Eyyûb ile Hişâm da Ebu'z-Zübeyr, ve Câbir vasıtasıyle Peygamber (s.a.v.)'den rivayet etmişlerdir. Yine (mana olarak) bû hadisi Dâvûd b. Husayn, îkrime vasıtasıyla İbn Abbâs'dan rivayet etti. Aynı şekilde (bu hadisi) Abdülmelik, Atâ vasıtasıyle Câbir'den rivayet etti. Katâde de el-Hasen ve Hıttân vasıtasıyle Ebû Mûsâ\"dan (Ebû Mûsâ'nın fiili olarak rivayet etti. Yine aynı şekilde (mânâ ola­rak) îkrime b. Hâlid, Mücâhid vasıtasıyla Peygamber (s.a.v.)'den riva­yet ettiği gibi Hişâm b. Urve de babası vasıtasıyla Peygamber (s. a.) 'den rivayet etmiştir ve bu (tatbikat) es-Sevr’nin görüşüdür. Diğer tahric: Nesaî, havf; Ahmed b. Hanbel, IV, 59-60",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 39
			}
		}
	]
}