{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"5": "Prayer (Kitab Al-Salat): Voluntary Prayers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1277,
			"arabicnumber": 1277,
			"text": "Amr b. Abese'den nakledilmiştir ki: (Resûl-i Ekrem'e hitaben): Ey Allah'ın Resulü, gecenin hangi saatinde (ibadet ve) dua daha çok makbuldür?\" dedim. (O şöyle) cevab verdi: Gecenin son vaktinde. Sabah namazını kılıncaya kadar ve istediğin (nâfiley)i kıl. Çünkü (bu vakitte kılınan) namaz şahitlidir, (ve sevabı) yazılmıştır. (Sabah namazını kıldıktan) sonra, güneş doğup da bir veya iki mızrak boyu yükselinceye kadar (namaz kılmayı) bırak. Çünkü güneş şeytanın boynuzları arasından doğar ve kâfirler güneşe (o saatte) tapınırlar. Sonra mızrak gölgesiyle bir oluncaya kadar ve istediğin kadar kıl. Çünkü (bu saate kadar kılınan) namaz şahitlidir (ve sevabı) yazılmıştır. Mızrak gölgesiyle bir olduktan sonra namazı bırak. (Çünkü o saatte) cehennem kızdırılır ve kapılan açılır. Güneş (batıya) meyledince ikindi namazını kılıncaya kadar (ve) istediğin (nafiley)i kıl. Çünkü bu (saatte kılınan) namaz şahidlidir. (İkindi namazından) sonra güneş baüncaya kadar namazı bırak. Çünkü (güneş) şeytanın boynuzları arasında batar ve kâfirler ona (o saatte) tapınırlar.\" bedu’l-halk 11, Müslim, müsâfirîn 290, 294; mesacid 174; Nesâî, mevâkît 35, 40; İbn Mâce, ikâme 148; Muvatta', Kur'ân 44, 49; Ahmed b. Hanbel, II, 13, 19f 24, 86, 106,210,223, 111, 348, 393, IV, 111, 112, 223f 348, 349, 385; V, 15,20, 190,216, 260, VI, 12. Dâvûd buyurdu ki) ve (şeyhim bana) uzunca bir hadis nakletti. el-Abbâs (b. Sâlity) dedi ki: Ebû Sellâm da sana Ebû Ümame'den buna benzer şeyler nakletti. Ancak (ben naklederken belki) istemeyerek bazı hatalar yapıyorum: Allah'dan af diliyorum ve ona tevbe ediyorum",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 28
			}
		}
	]
}