{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"5": "Prayer (Kitab Al-Salat): Voluntary Prayers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1277,
			"arabicnumber": 1277,
			"text": "Amr b. Abese'den; demiştir ki: Ben (Resûl-i Ekrem'e hitaben): \"Ey Allah'ın Resulü, gecenin hangi saatinde (ibadet ve) dua daha çok makbuldür?\" dedim. (O şöyle) cevab verdi: \"Gecenin son vaktinde. Sabah namazını kılıncaya kadar ve istediğin (nâfiley)'i kıl. Çünkü (bu vakitte kılınan) namaz şahitlidir, (ve sevabı) yazılmıştır. (Sabah namazını kıldıktan) sonra, güneş doğup da bir veya iki mızrak boyu yükselinceye kadar (namaz kılmayı) bırak. Çünkü güneş şeytanın boynuzları arasından doğar ve kâfirler güneşe (o saatte) tapınırlar. Sonra mızrak gölgesiyle bir oluncaya kadar ve istediğin kadar kıl. Çünkü (bu saate kadar kılınan) namaz şahitlidir (ve sevabı) yazılmıştır. Mızrak gölgesiyle bir olduktan sonra namazı bırak. (Çünkü o saatte) cehennem kızdırılır ve kapıları açılır. Güneş (batıya) meyledince ikindi namazını kıhncaya kadar (ve) istediğin (nafiley)i kıl. Çünkü bu (saatte kılınan) namaz şahidlidir. (İkindi namazından) sonra güneş batıncaya kadar namazı bırak. Çünkü (güneş) şeytanın boynuzları arasında batar ve kâfirler ona (o saatte) tapınırlar.\" (Ebû Dâvûd dedi ki) ve (şeyhim bana) uzunca bir hadis nakletti. el-Abbâs (b. Sâlity) dedi ki: \"Ebû Sellâm da sana Ebü Ümame'den buna benzer şeyler nakletti. Ancak (ben naklederken belki) istemeye­rek bazı hatalar yapıyorum: A ilah 'dan af diliyorum ve ona tevbe edi­yorum.\" Diğer tahric: Buhari, bedu'l-halk, Müslim, müsâfirîn; mesacid; Nesâî, mevâkît; İbn Mâce, ikâme ; Muvatta', Kur'ân; Ahmed b. Hanbel, II, 13, 19f 24, 86, 106,210,223, 111, 348, 393, IV, 111, 112, 223f 348, 349, 385; V, 15,20, 190,216, 260, VI, 12",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 28
			}
		}
	]
}