{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"5": "Prayer (Kitab Al-Salat): Voluntary Prayers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1303,
			"arabicnumber": 1303,
			"text": "Şüreyh b. Hâni'den; demiştir ki: Âişe (r.anhâ)'ya Resûlullah (s.a.v.)'in namazını sordum. Şöyle cevap verdi: Resûlullah (s.a.v.) yatsı namazını kıldıktan sonra yanıma geldiğinde kesinlikle dört veya altı rekat (daha nafile namaz) kılardı. Bir gece yağmura tutulduk. Kendisine deriden bir seccade verdik, sanki o derideki deliği kendisinden su fışkırırken görüyor gibiyim. Resûlullah'ı elbisesinin bir tarafını yerden sakınırken asla görmedim. İzah. Nesâî, kıyâmü'l-leyl Bu hadis-i şerifte Resûl-i Ekrem (s.a.v.)'in Hz. Âişe'nin odasında kaldığı gece, yatsı namazından sonra mutlaka evde nafile namaz kıldığı ifâde edilmektedir. Bu nafile namazın kaç rekat ol­duğu \"dört rekat\" veya \"altı rekat\" kelimeleriyle açıklanmıştır. Buradaki \"veya\" kelimesi \"tenv = çeşitleme\" anlamında kullanılmıştır. Bu takdir­de Resûl-i Ekrem (s.a.v.)'in bazan dört rekat bazan da altı rekat kıldığı anlaşı­lır. Eğer \"veya\" kelimesinin \"şek, şüphe\" için olduğu kabul edilirse, bu takdirde Resûl-i Ekrem'in bu namazı altı rekat olarak mı, yoksa dört rekat olarak mı kıldığında Hz. Âişe'nin şüphelendiği ve birini diğerine tercih ede­mediği anlaşılır. Esasen Resûl-i Ekrem (s.a.v.), bu namazı, dört rekat olarak da kılsa, altı rekat olarak da kılsa bunun iki rekatı yatsının iki rekatlık son sünnetinden başkası değildir. Geriye kalan dört rekatlık namaz \"kıyâmü'l-leyl\"dir. Bu namaz iki rekatten on rekate kadar kılınabilir.[Ö. N. Bilmen, Büyük İslâm İlmihâli, 204.] Bilindiği gibi yatsının iki rekatlık son sünneti farz namazlara bağlı ola­rak kılınan revâtip sünnetlerdendir. Tamamı on iki rekattır ve Allah Teâlâ’nın, bu sünnetleri kılanlar için cenneti hazırlayacağına dâir va'd-i ilâhisi vardır.[İbn Mâce, ikâme; Tirmizî, salât; Nesaî kıyamü'l-leyl] Resûl-i Ekrem'in yatsıdan sonra dört veya altı rekat nafile kılmış olması, bazan da yatsı namazından sonra sadece iki rekatla yetinmiş olması­na engel değildir. Nitekim bir hadis-i şerifte; \"Cemaate yatsıyı kıldırır ve yine benim evime gelerek iki rekat (nafile) kılardı.\"[Müslim, müsâfirîn] Duyurulmaktadır. Ayrıca konumuzu teşkil eden Ebû Dâvûd hadisinde Resûl-i Ekrem (s.a.v.) Efendimiz'in namaz kılarken kirlenip paslanacağı endişesiyle elbisesini yer­den sakınmadığına işaret edilmektedir. Nitekim namaz kılarken elbiseyi toplamak veya elbiseyle oynamak Ha­nefî mezhebinde mekruhtur. Kıymetli âlimlerimizden Muhammed Zihni bu konuda şunları yazmıştır: \"Secdeye giderken entariyi veya pantolonu az amel ile yukarı çekmek, diğer tarife göre -ki, Bahr-i Râik'in tarifidir- gömleğin üzerine pantolonu çekmek mekruhtur.\"[Nimet-i İslâm, s. 317]",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 54
			}
		}
	]
}