{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"6": "Prayer (Kitab Al-Salat): Detailed Injunctions about Ramadan"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1393,
			"arabicnumber": 1393,
			"text": "Evs b. Huzeyfe (radıyallahü anh)'den nakledilmiştir ki: Heyeti içinde Resûlüllah (sallallahü aleyhi ve sellem)'ın huzuruna geldik. Ahlâf sülâlesi Mugîre b. Şu'be'ye müsâfir oldu. Beni Mâlikileri de Hazret-i Peygamber kendisine ait bir çadıra aldı. Müsedded; Evs, Sakîf’den Resûlüllah'a gelen bir heyetin içinde idi\" dedi. Efendimiz her gece yatsıdan sonra bize gelir ve -Ebû Said'in dediğine göre- ayak üstü durarak anlatırdı. Hatta uzun süre ayakta kalmaktan dolayı biraz bir ayağı üzerine biraz da diğeri üzerine yaslanırdı. Hazret-i Peygamber'in en çok anlattığı şey, kavmi olan Kureyş'ten gördüğü ezâ ve cefâ idi. Resûlüllah şöyle derdi: Onlarla biz eşit değildik Bu cümlenin \" Bizim hicretten önceki halimizle, hicretten sonraki hâlimiz eşit değildir\" şeklinde anlaşılması da mümkündür. zayıf ve zelil idik (onlarsa kuvvetli idiler) -Müsedded Mekke'de der- Medine'ye gelince harb nöbetleri Bu kelimeler aslında büyük kova manasındadır. onlarla bizim aramızda devam etti. Kâh biz onlara gâlib geliyoruz kâh onlar bize.\" Bir gece Resûl-i Ekrem her zamanki geldiği vakitten geç geldi. Biz, \" bu gece geç kaldın?\" dedik. \" Kur'ân'dan (okuduğum) cüz'üm aklıma geliverdi. Buradaki \" cüz'î\" kelimesi bazı nüshalarda \" hizbî\" şeklindedir. Bu farklılık mana değişikliğini gerektirmemektedir. Onu tamamlamadan gelmeyi istemedim\" buyurdu. (sallallahü aleyhi ve sellem)'ın ashabına; nasıl hizblere ayırıyorsunuz? diye sordum: beş, yedi, dokuz, onbir, onüç, mufassalları tek hizb (olarak); cevabını verdiler. Dâvûd buyurdu ki: Ebû Said'in rivâyeti (Müsedded’inkinden) daha tamdır. Mâce, ikame 178; Ahmed b. Hanbel, IV, 9, 343",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 23
			}
		}
	]
}