{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"8": "Prayer (Kitab Al-Salat): Detailed Injunctions about Witr"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1427,
			"arabicnumber": 1427,
			"text": "Ali b. Ebi Tâlib (r.a)'den rivayet edildiğine göre; Resulullah (s.a.v.) vitir namazının sonunda şöyle dermiş: \"Allahım ! Senin gazabından rızana, cezandan affına, senden sana sığınırım. (Lâyık olduğun gibi) senin senalarını sayamam, sen kendini nasıl sena (medh) ettînse öylesin.\" Nesâî, kıyamü'l-leyl; İbn Mace, ikâme; Ahmed b. Hanbel, I, 96, 150. Ebu Dâvûd dedi ki: \"Hişam, Hammad'ın en eski hocasıdır. Ba­na Yahya b. Main'in \"Ondan Hammad b. Seleme'den başka kimse (hadis) rivayet etmedi\" dediği ulaştı.\" Yine Ebâ Dâvud şöyle dedi: \"İsa b. Yunus, Said b. Ebi Arûbe'den; o Katâde'den; Katâde, Said b. Abdirrahman b. Ebzâ'dan; o da babası vasıtasıyle Übey b. Ka’b'den, Resulullah (s.a.v.)'in vitirde rüku'dan önce kunut yaptığını rivayet etti. [Bu talikteki yani \"ruku'dan önce\" tefsiri, râvilerden birine aittir. Bizzat musannif Ebu Davud'un sözü olması da muhtemeldir. Muhammed b. Nasr bu taliki Ubey b. Ka'b'a kadar vasletmiştir.] Ebu Dâvud şunu da söyledi: \"İsa b. Yunus bu hadisi aynı şekilde Fıtr b. Halîfe'den; O, Zübeyd'den; Zübeyd, Said b. Abdirrahman b. Ebzâ'dan, o da babası kanalıyla Übey (b. Ka'b)'den; Übey (r.a.) Re­sulüllah (s. a.)'in (Önceki talikteki olduğu gibi rüku1 dan önce kunut yap­tığını) rivayet etti.[İsa b. Yunus'un Fıhr'dan yaptığı bu rivayeti Dârekutnî başka bir isnadla Ubey b. Ka'b'dan mevsul olarak rivayet etmiştir. Ubey şöyle der: \"Rükudan önce kunut yapar, selamı verince de üç defa derdi. Sesini uzatır. Sonuncusunda da derdi. (el-Menhel, VIII, 61).] Hafs b. Gıyas, Mis'ar, Zübeyd, Said b. Abdirrahman b. Ebzâ ve babası isnadı ile Übey b. Ka'b (r.a.)'den Resulüllah (sM.yin vitirde rükudan Önce kunut yaptığı rivayet edildi. Bu talik kunutun rüku dan önce yapıldığını gösteren üçüncü rivayettir. Ebû Dâvud devamla şöyle dedi: \"Said'in Katâde'den rivayet et­tiği hadisi Yezid b. Zürey, Said*den; o, Katâde'den; Katâde, Azre'-den; Azre, Said b. Abdirrahman b. Ebzâ'dan; o da, babası vasıtasıyla Nebi (s.a.v.)'den rivayet etmiş, kunutu zikretmemiş, Übeyy'i de anma­mıştır.[Bu talik Said b. Ebi Arûbe'nin Katâde'den yaptığı rivayetin mevsuk olduğuna işaret etmektedir. Bunu Ha b. Yunus, Said b. Ebi Arûbe'den mevsul olarak ve kunutu zikrederek, Yezid b. Zurcyc'den ise mürsel olarak ve kunutu anmadan rivayet etmiştir.] Aynı şekilde bu hadisi Abdul-A'la ve Muhammed b. Bişr el-Abdi (Said b. Ebû Arûbe'den) rivayet etmiş, kunutu zikretmemişlerdir.-Muhammed b. Bişr'in bu hadisi işitmesi İsa b. Yunus ile beraber Kü­fe'de gerçekleşmiştir.-Yine bu hadisi Hişam ed-Destevâî ve Şu'be, Katâde'den rivayet etmişler, kunut'u anmamışlardır.[Şu'be'nin bu rivayetini Nesâİ, şu lafızlarla tahric etmiştir: Resûlullah (s.a.v.) A'Iâ, Kâfirûn ve ihlas sureleri ile vitir kılar, bitirdiğinde de üç kerre .... derdi.\"] Zübeyd'in hadisini Süleyman el-A’meş, Şu'be, Abdulmelik b. Ebi Süleyman ve Cerir b. Hazım -hepsi Zübeyd'den rivayet etmişlerdir-onlardan hiç biri kunutu zikretmemiştir. Ancak Ha/s b. Ğıyas, ve Mis'-ar vasıtasıyla Zübeyd'den rivayet edilen bundan müstesnadır. Çünkü Mis'ar hadisinde \"Resulüllah rüku'dan önce kunut yaptı\" demiştir. Ebu Dâvud: \"Hafs hadisi olarak meşhur olan bu değildir, Onun Mis'ar'dan başkasından olduğunu zannediyoruz\" dedi. Yine Ebu Dâ­vud: \"rivayet olunuyor ki: \"Übeyy Ramazan ayının (ikinci) yarısında kunut yaparmış\" dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 12
			}
		}
	]
}