{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"9": "Zakat (Kitab Al-Zakat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1567,
			"arabicnumber": 1567,
			"text": "Hamraâd (b. Seleme)’dan demiştir ki: b. Abdullah b. Enes'ten, Ebû Bekr'in Enes'i zekât toplamak için gönderdiği zaman yazdığını ve üzerinde Resûlüllah (sallallahü aleyhi ve sellem)'in mührü olduğunu söylediği bir mektup aldım. O mektupta şunlar vardı: Bu, Allah'ın, Peygamberine emrettiği ve Resûlüllah (sallallahü aleyhi ve sellem)'ın müslümanlara takdir ve tayin ettiği zekât farizası (hükümlerini beyân eden bir mektup)dur. Hangi müslümandan buna uygun olarak zekât istenirse, onu versin; kimden de ondan fazlası istenirse vermesin. beş deveden aşağısında (zekât olarak) davar verilir. Her beş devede bir koyun verilir. Deve sayısı yirmi beşe ulaştığında otuz beşe ulaşıncaya kadar bir yaşını bitirip iki yaşma basmış bir dişi deve verilir. Eğer onların içinde bir yaşım bitirip iki yaşına basmış dişi deve yoksa iki yaşım bitirip üç yaşına basmış bir erkek deve verilir. altıya ulaştığında kırk beşe kadar iki yaşım bitirip üç yaşına basmış bir dişi deve verilir. altıya ulaştığında altmışa kadar erkek deveye çekilen üç yaşını bitirip dört yaşına basmış dişi deve verilir. bire ulaştığında yetmiş beşe kadar dört yaşını bitirip beş yaşma basmış bir dişi deve verilir. altıya ulaştığında doksana kadar iki yaşını bitirip üç yaşına basmış iki dişi deve verilir. bire ulaştığında yüz yirmiye kadar erkek deveye çekilen üç yaşını bitirip dört yaşma basmış iki dişi deve verilir. yirmiden fazla olduğunda her kırk devede iki yaşını bitirip üç yaşına basmış bir dişi deve ve her elli devede üç yaşını bitirip dört yaşına basmış bir dişi deve verilir. yanındaki (develerin) zekâtı dört yaşını bitirip beş yaşına basmış bir dişi deveye ulaşır ve onun yanında bu yaşta bir devesi bulunmaz da üç yaşım bitirip dört yaşına basmış bir dişi deve bulunursa, o (mal sahibi)nden (zekât olarak) bu deve kabul edilir. Bir de (yaş farkının telâfisi için) yanında varsa onunla beraber iki koyun yirmi dirhem (gümüş) verir. yanındaki (develerin) zekâtı üç yaşını bitirip dört yaşına basmış bir dişi deveye ulaşır, yanında böyle bir devesi bulunmaz da dört yaşını bitirip beş yaşına basmış bir dişi devesi bulunursa, ondan o (deve) kabul edilir. Zekât memuru da ona ya yirmi dirhem (gümüş) ya da iki koyun verir. de (develerinin) zekâtı üç yaşını bitirip dört yaşına basmış bir dişi deveye ulaşır ve onun yanında böyle bir devesi bulunmaz da iki yaşını bitirip üç yaşına basmış bir dişi deve bulunursa, ondan o (deve) kabul edilir. Dâvud: buradan itibaren hadisi Mûsâ'dan arzuladığım gibi zapt edemedim.\" dedi. Ve ayrıca yanında varsa onunla beraber iki koyun veya yirmi dirhem (gümüş) verir. (develerinin) zekâtı iki yaşım bitirip üç yaşma basmış bir dişi deveye ulaşır da yanında yalnız üç yaşını bitirip dört yaşına basmış bir dişi devesi bulunursa, ondan o deve kabul edilir. Dâvûd, \" hadisin buraya kadarını iyi zapt edemedim, sonrasını ise, iyi zapt ettim. \" dedi. Ve zekât memuru ona yirmi dirhem (gümüş) veya iki koyun verir. (develerinin) zekâtı iki yaşını bitirip üç yaşına basmış bir dişi deveye ulaşır da yanında yalnız bir yaşını bitirip iki yaşına basmış bir dişi devesi bulunursa, ondan o deve ile iki koyun veya yirmi dirhem kabul edilir. yanındaki (develerin) zekâtı, bir yaşını bitirip iki yaşına basmış bir dişi deveye ulaşırsa ve yanında yalnız iki yaşım bitirip üç yaşına basmış bir erkek devesi bulunursa ondan o (deve) kabul edilir. Onunla beraber başka bir şey (almak) yoktur. yanında yalnız dört devesi varsa onlara zekât yoktur. Ancak sahibi isterse (verebilir.) beslenen davarda ise kırktan yüz yirmiye kadarında bir koyun, yüzyirmiden fazla olursa, iki yüze ulaşıncaya kadar iki koyun, ikiyüz birden üç yüze ulaşıncaya kadar üç koyun, üçyüzbirden fazla olduğunda her yüz koyunda bir koyun (zekât) vardır. Zekâtta ne yaşlı ne ayıplı davar ne de (koç ve teke gibi) döl hayvanı alınmaz. Ancak zekât memuru dilerse, bunları alabilir. (artar veya eksilir) korkusuyla mufterik (ayrı olan mal), bir araya toplatılmaz. Toplu olan (mal)da tefrik edilmez. halîtin (ortak) malından alınan zekât hususunda ikisi aralarında hisselerine göre hesaplaşırlar. otlaklarda beslenen koyunları kırka ulaşmıyorsa, onlarda (zekât olarak) hiçbir şey yoktur. Ancak sahibi isterse, verebilir. kırkta bir zekât vardır. Eğer gümüş yalnız yüz doksan (dirhem) ise, onda zekât yoktur. Ancak sahibi isterse verebilir. zekat 38; Nesâî, zekât 5, 10; İbn Mace, zekât 10; Ahmed b. Hanbel, I, 11",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 12
			}
		}
	]
}