{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"9": "Zakat (Kitab Al-Zakat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1583,
			"arabicnumber": 1583,
			"text": "Übey b. Ka'b (radıyallahü anh)’dan nakledilmiştir ki: (sallallahü aleyhi ve sellem) beni zekât memuru olarak gönderdi de (develeri olan) bir adama uğradım. Malını benim için biraraya toplayınca o malda ona ancak bir yaşım bitirip iki yaşına basmış bir dişi deve (zekât vâcib) olduğu kanaatine vardım. Bunun üzerine ona: olarak) bir yaşını bitirip iki yaşına basmış bir dişi deve ver, dedim. ne sütü var ne de (taşımaya elverişli olan bir) sırtı. bu genç biri ve semiz bir dişi devedir. Binaenaleyh bunu al, dedi. Ona: olunmadığım şeyi almam. İşte Resûlüllah (sallallahü aleyhi ve sellem) yakınında. Ona gidip bana takdim ettiğini O'na takdim etmeyi arzu edersen bunu yap! Eğer O, senden bunu kabul ederse, ben de ederim. Şayet kabul etmezse, ben de kabul etmem, dedim. yaparım dedi. Hemen bana takdim ettiği deveyi getirdi ve benimle beraber çıkıp Resûlüllah (sallallahü aleyhi ve sellem)'a geldik. O'na: Allah'ın Peygamberi Malımın zekâtını benden almak için bana (şu) elçin geldi. -Allah'a yemin ederim ki, daha önce ne Resûlüllah (sallallahü aleyhi ve sellem) ne de onun elçisi benim malımın arasında bulunmadı (malımı görmedi)- Malımı onun için bir araya topladım da onda benim üzerime (vâcib) olan şeyin, bir yaşını bitirip iki yaşına basmış bir dişi deve olduğunu söyledi. Halbuki onun ne sütü var ne de (taşımaya elverişli olan bir) sırtı. Alması için ona iri ve genç bir dişi deveyi takdim ettim de benden almadı. İşte o (takdim ettiğim deve) budur. O'nu sana getirdim Ya Resûlallah (buyurun) al, dedi. Resûlüllah (sallallahü aleyhi ve sellem) O'na: Sana (vâcib) olan odur. Ama (ondan daha) iyisini tatavvu olarak verirsen, Allah sana onun sevabını verir. Biz de onu senden kabul ederiz,\" buyurdu. O'da: o, budur Ya Resûlallah! Onu sana getirdim (buyrun) al, dedi. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem) de onun teslim alınmasını emretti ve o adama malının bereketi (çoğalması) için duâ etti. b. Hanbel,-V-142",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 28
			}
		}
	]
}