{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"11": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1785,
			"arabicnumber": 1785,
			"text": "Câbir (r.a.)'dan; demiştir ki: Resûlullah (s.a.v.) ile birlikte biz sadece, hacca niyet ederek yola çıktık. Âişe ise, sadece um­reye niyet ederek yola çıktı. Şerife vardığımızda Hz. Âişe hayızlandı. (Mekke'ye) gelince biz Kâ'be'yi ve Safa ile Merve arasını tavaf ettik. Resûlullah (s.a.v.) yanında hedy bulunmayanlarımızın ihramdan çıkmasını emretti. (Bize) ne helal (olacak)? dedik. (Resûlullah (s.a.v.): \"İhrâmsıza helâl olan herşey!\" buyurdular. Bunun üzerine kadınlarla cima' ettik, güzel kokular süründük ve elbiselerimizi giyindik. Arefe günüyle aramızda ancak dört gece vardı. Sonra terviye günü tekrar hacca niyet ettik. (Daha) sonra Resûlullah (s.a.v.) Âişe (r.anhâ)'nın yanına girdi. Hz. Âişe (r.anhâ) ağlıyordu. (O'na); \"Hâlin nedir?\" diye sordu. Hâlim hayız görmüş olmamdır. Halk ihramdan çıktı, bense çıkamadım, Beyt'i de tavaf edemedim. Başkaları şimdi hacca gidiyorlar, diye cevap verdi. Bunun üzerine Resûlullah (s.a.v.); \"Bu, Allah'ın âdem kızlarına takdir buyurduğu birşeydir. Yıkan sonra hacca niyet et!\" buyurdular. (Âişe de öyle) yaptı ve bütün vakfe yerlerinde durdu. Nihayet temizlenince Kâ'be ile Safa ve Merve arasını tavaf etti. Sonra Resûlullah (s.a.v.): \"Hac ile umrenin, ikisinin de ihramından çıktın,\" buyurdu. Âişe; Ya Resûlullah! Ben içimden hacca gidip, Beyt'i tavaf etmediğimi hissediyorum, dedi. (Resûl-i Ekrem (s.a.v.) de: Öyle ise, Ey Abdurrahmân! Bunu götür de Ten'im'den umre yaptır!\" buyurdular. Bu hadise, Hasbe gecesi olmuştu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 65
			}
		}
	]
}