{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"11": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1885,
			"arabicnumber": 1885,
			"text": "Ebû't-Tufeyl'den nakledilmiştir ki: Ben, İbn Abbâs'a; kavmin Resûlüllah (sallallahü aleyhi ve sellem)'in Beyt'i (tavaf ederken) remel yaptığım ve bunun sünnet olduğunu iddia ediyorlar, dedim. doğru söylemişler, hem de yanlış söylemişler, dedi. Ben de; doğru hem de yanlış söylemişler ne demektir? dedim. söylemişler. (Çünkü) gerçekten Resûlüllah (sallallahü aleyhi ve sellem) Beyt'i (tavaf ederken) remel yaptı. Yanlış söylemişler. (Çünkü) o sünnet değildir. Kureyş (müşrikleri) Hudeybiye gününde; Şu Muhammed'i ve ashabım bırakınız da nağf (denilen ve develerin burnundan düşen kurtların sebeb olduğu deve) ölümüyle ölsün\" dediler. (Kureyşliler, müslümanların) gelecek sene Mekke'de üç gün kalmaları şartıyla Resûlüllah (sallallahü aleyhi ve sellem) ile barış yapınca, Resûlüllah (ashabıyla birlikte Mekke'ye) geldi. Müşrikler de Kuaykıân (denilen sıradağlar) tarafında idiler. Resûlüllah (sallallahü aleyhi ve sellem) ashabına; Beyt'i tavaf ederken üç (turda) remel yapınız.\" buyurdu. Ve (İbn Abbâs, işte) bu sünnet değildir, dedi. Ben; kavmin Resûlüllah (sallallahü aleyhi ve sellem)’ın Safa ile Merve arasında devesine binerken sa'y yaptığım ve bunun (sa'yı deveye binerek yapmanın) sünnet olduğunu iddia ediyorlar, dedim. Bunun üzerine (İbn Abbâs): doğru söylemişler hem de yanlış söylemişler, dedi. Ben de; doğru hem de yanlış söylemişler ne demektir? dedim. söylemişler. (Çünkü) gerçekten Resûlüllah (sallallahü aleyhi ve sellem) Safa ile Merve arasında devesi üzerinde olduğu halde sa'y etti. Yanlış söylemişler. (Çünkü) bu (sa'yederken deveye binmek) sünnet değildir. (Zira) halk(ın Resûl-i Ekrem'e yaklaşmasın)a engel olunamazdı ve (halk bundan) vazgeçirilemezdi. Bunun üzerine sözünü (halkın rahatça) işitmeleri, yerini görmeleri ve ellerinin kendisine erişmemesi için tavafı deve üzerinde yaptı, cevabını verdi. hac 237",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 165
			}
		}
	]
}