{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"11": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1905,
			"arabicnumber": 1905,
			"text": "Muhammed (b. Ali) dedi ki Câbir b. Abdülah'm yanına girmiştik. Girenlerin kimler olduğunu sordu. Sıra bana gelince: Ben Muhammed b. Ali b. Hüseyin'im, dedim. Bunun üzerine eliyle başıma uzanarak üst düğmemi çıkardı, sonra alt düğmemi de çıkardı, sonra avucunu memelerimin arasına koydu. Ben o zaman küçük bir çocuktum. (Bana): Merhaba hoş geldin, kardeşim oğlu! (Bana) istediğini sor, dedi. Ben de sordum. Kendisi â'mâ idi. Namaz vakti gelince dokuma bir elbiseye sarınarak (namaza) kalktı. Dokuma küçük olduğu için omuzlarına koydukça iki ucu geriye dönüyordu. Bize namazı kıldırdı. Cübbesi de yanıbaşında askıda duruyordu, (kendisine): Bana Resûlullah (S.A.V.)'in haccını anlat, dedim. Eliyle dokuz işareti yaptı, sonra: Gerçekten Resûlullah (S.A.V.) haccetmeden dokuz sene durdu, sonra onuncu (yıl) da kendisinin haccedeceğini halka ilan etti. Bunun üzerine Medine'ye birçok insan geldi. Bunların hepsi Resûlullah (S.A.V.)'e uymanın çaresini arıyor ve onun yaptığı gibi amel etmek istiyorlardı. Derken Resûlullah sallallahu aleyhi ve sellem (yola) çık­tı. Onunla birlikte biz de çıktık. Zülhuleyfe'ye varınca, Esma bint Umeys, Muhammed b. Ebî Bekr'i doğurdu da \"ben ne yapacağım?\" diye Resûlullah (S.A.V.)'e haber gönderdi. Nebi (S.A.V.)'de O'na: \"Yıkan, hayız bezi ile (bağlı) bir kuşak kuşan ve (hacca) niyet et\" cevabını verdi. Müteakiben Resûlullah sallallahu aleyhi ve sellem (oradaki) mescidde namaz kıldı. Sonra Kasvâ'ya bindi. Devesi kendisini \"Beydâ\" düzüne çıkardığı vakit, onun önünde gözüm görebildiği kadar binekli ve yaya(lar) gördüm. Bir o kadar sağında, bir o kadar solunda bir o kadar da arkasında vardı. Resûlulallah (S.A.V.) aramızda bulunuyordu. Kur'ân O'na iniyor, te'vilini de o biliyordu. O ne yaparsa biz de onu yapıyorduk. Derken tevhid'i ifade eden kelimelerle telbiye getirdi: \"Tekrar tekrar icabet sana yâ Rabbi! Tekrar icabet sana, tekrar icabet sana; senin ortağın yoktur, tekrar icabet sana, gerçekten haınd de, ni'met de sana mülk de sana mahsustur. Senin ortağın yoktur.\" Halkda hâlen getirmekte oldukları telbiyeye devam ettiler. Resûlullah (S.A.V.) bundan dolayı kendilerine bir şey demedi. O da kendi telbiyesine devam etti. (O sıralarda) biz ancak hacca niyet ediyor umreyi bilmiyorduk. Onunla birlikte Kabe'ye varınca, rüknü istilâm etti ve üç tur hızlı dört de (âdi) yürüyüşle tavaf yaptı. Sonra İbrahim (aleyhisselâm)'ın makamına gelip: \"İbrahim'in makamında namazgah ittihaz edin\"[Bakara 125.] âyetini okudu. Makamı kendisiyle Beyt-i Şerif arasına aldı. (Bu hadisin râvilerinin arasında) îbn Nüfeyl (Abdullah b. Muhammed en-Nüfeylî) ile Osman'ın rivâyet(ler)ine göre (Cafer b. Muhammed) dedi ki: \"Babam (Muhammed b. Ali Şöyle) derdi: (Câbir'in) bunu (yani tavaf namazında okunan sûreleri) ancak Resûlullah'tan duyduğu için zikrettiğini zannediyorum.\" (Diğer râvi) Süleyman da (Muhammed b. Ali'den naklettiği rivayetinde); \"Ben Câbir'in sadece \"Resûlullah (S.A.V.)'in (tavafdan sonra kıldığı) iki rekatlık namazda İhlâs ve Kâfirûn (surelerini) okurdu\" dediğini biliyorum,\" dedi. Sonra yine Beyt'e dönerek rüknü istilâm etti. Sonra (Safa) kapı(sın)dan çıktı Safâ'ya yaklaşınca \"Gerçekten Safa ile Merve Allah'ın alâmederindendir.\"[Bakara 158.] âyet-i kerimesini okudu ve Allah'ı tevhîd eyledi ve; \"Allah'dan başka hiçbir ilâh yoktur. O, bir ve tekdir. Onun şeriki yoktur, mülk onundur, ham de O'na mahsustur. Hayat veren de öldüren de odur. O herşeye gücü yetendir. Allah'dan başka ilâh yoktur. O, bir ve tekdir. Va'dini yerine getirdi, kulunu muzaffer kıldı. Yalnız başına bütün hizipleri bozguna uğrattı* dedi. Bu arada dua okudu ve söylediklerinin aynısını üç defa tekrarladı. Sonra Merve'ye indi, vadinin ortasına varınca, remel yaptı. Vadiden çıkınca normal yürüyüşüne devam etti. Nihayet Merve'ye geldi. Merve'de de Safâ'da yaptığı hareketi tekrarladı. Merve üzerinde son tavafını yaparken: \"Arkamda bıraktığım iş tekrar karşıma çıksaydı, kurbanlığı getirmez, bu haccı umre yapardım (Binaenaleyh) sizden hanginizin yanında kurbanlık yoksa, hemen, ihramdan çıksın ve haccını umreye çevirsin,\" buyurdu. Nebi (S.A.V.) ile yanında kurbanlık olanların dışında herkes ihramdan çıktı ve saçlarını kısalttı. Bunun üzerine Süraka b. Çu'şum ayağa kalkıp: Ya Rasûlullah! bu iş bizim bu senemize mi mahsus yoksa ilelebed devam edecek mi? diye sordu. Rasûlullah (S.A.V.)'de parmaklarını biribirine kenetledi ve iki defa: \"Umre hacca dâhil olmuştur\" dedi. (Ve devamla); \"hayır ebedi olarak devam edecektir, hayır ebedî olarak devam edecektir\" buyurdu. Ali Yemen'den Rasûlullah (S.A.V.)'in develerini getirdi. Fâtıma (r.anhâ)'yı ihramdan çıkanlar arasında buldu. Fâtıma boyalı elbiseler giymiş ve sürme çekinmişti. Hz. Ali bunu beğenmedi ve; Bunu sana kim emretti? diye sordu. Hz. Fâtıma da, \"babam (S.A.V.)\" cevabını verdi. Hz. Ali Irak'ta iken şöyle derdi: Bunun üzerine ben Fâtıma'yı bu yaptığından dolayı azarlamak ve Resûlullah (S.A.V.) adına söylediklerini sormak için Resûlullah (S.A.V.)'e gittim ve Fâtıma'nın yaptıklarını beğenmediğimi haber verdim de; \"Doğru söylemiş, doğru söylemiş, sen hacca niyyellenirken ne dedin\" buyurdu. Ben de: Ya Rabbi! Resulün neye niyyetlendiyse ben de ona niyyetlendim dedim. \"Benim yanımda kurbanlık var, sen ihramdan çıkma\" buyurdu. Hz. Ali'nin Yemen'den getirdiği kurbanlıklar ile Nebi (S.A.V.)'in Medine'den getirdiği kurbanlıklar yüz adettiler. Derken Peygamber (S.A.V.) ile yanlarında kurbanlık bulunanların dışında herkes ihramdan çıktı. Terviye günü gelince Mina'ya doğru yola çıktılar ve hacca niyyellendiler. Resûlullah sallallahu aleyhi ve sellem (hayvana) binmişti. Minâ'da öğle, ikindi, akşam, yatsı ve sabah namazlarını kıldı. Sonra güneş doğuncaya kadar biraz bekledi ve kendisine bîr çadır kurulmasını istedi. Bunun üzerine Nemire'de (bir çadır) kuruldu. Müteakiben Rasûlullah (S.A.V.) yola çıktı. Kureyş câhiliyye döneminde kendilerinin yaptığı gibi O'nun da Müzdelife'de bulunan Meş'ar-i Haram'da duracağından şüphe etmiyorlardı. Oysa Rasûlullah (S.A.V.) o yeri geçerek Arafat'a vardı ve Nemire denilen yerde kendisine ait çadırın kurulduğunu görerek oraya indi. Güneş (batıya) kayınca Kasvâ'nın hazırlanmasını emir buyurdu ve hayvana semer vuruldu. Az sonra (hayvana) binip (Urane denilen) vadinin ortasına geldi ve halka hitaben (şöyle) dedi: \"Şüphesiz ki sizin kanlarınız ve mallarınız şu beldenizde, şu ayınızda, şu gününüzde haram olduğu gibi biribirinize haramdır. Dikkat edin! Câhiliyyel işleriyle ilgili herşey ayaklarımın altına konmuştur. Câhiliyye devrinin kan davaları yürürlükten kalkmıştır. Bize ait kan davalarında yürürlükten kaldırdığını ilk kan (davası)... (Son cümlenin baş tarafını bütün râviler aynı şekilde rivayet ettikleri halde cümlenin sonunu) Osman; \"(kaldırdığım ilk kan davası) İbn Rabia'nın kanıdır\" diye Süleyman da; \"-Rabia b. el-Hâris b. Abdi'l-Muttalib'in kanıdır.\" diye rivayet etmiştir. (İyas b. Rabia) beni Sa'd kabilesinde süt anadaydı. O'nu Hüzeyl kabilesi öldürdü. \"Câhiliyyet döneminin ribâsı (faiz) da yürürlükten kaldırılmıştır. İlk yürürlükten kaldırdığım riba bizim -(yani) Abbas b. Abdullmuttalib'in- ribâsıdir. Bu ribânın hepsi kesinlikle yürürlükten kaldırılmıştır. Kadınlar hakkında Allah'dan korkun. Çünkü siz onları Allah'ın emânetiyle (Allah'a verdiğiniz söz karşılığında) aldınız ve onları Allah'ın kelimesi ile kendinize helâl kıldınız. Evlerinize sevmediğiniz bir kimseyi ayak bastırmamaları sizin onlar üzerindeki hakkınızdır. Bunu yaparlarsa onları zarar vermemek şartıyla dövün. Onların sizin üzerinizdeki hakkı da yiyeceklerim ve giyeceklerini uygun bir şekilde vermenizdir. Size öyle bir şey bıraktım ki O'na sımsıkı sarılırsanız bir daha asla sapmazsınız: Allah'ın kitabı. Benim hakkımda size sorulacak, acaba ne diyeceksiniz? (Ashab-ı kiram): Risâletini tebliğ, vazifeni edâ ettiğine ve nasihatta bulunduğuna şahitlik ederiz, dedikten sonra şehâdet parmağını semaya kaldırıp onunla insanlara işaret ederek üç defa, \"-Şahid ol ya Rabb! Şâhid ol ya Rab! Şahid ol ya Rab!\" buyurdular. (Hutbe bittikten) sonra Hz. Bilâl ezan okudu. Sonra kamet getirdi. Bunun üzerine (Hz. Nebi) öğleyi kıldırdı, sonra (Hz. Bilâl tekrar) kamet getirdi, (Hz. Nebi de) hemen arkasından ikindiyi kıldırdı. İkisi arasında başka bir namaz kılmadı. Sonra Kasvâ'ya binip vakfe yerine geldi. Devesi Kasvâ'nın göğsünü kayalara çevirdi. Yayaların toplandığı yeri önüne aldı ve kıbleye döndü. Artık güneş neredeyse batacak hâle gelinceye kadar vakfe hâlinde kaldı. Güneşin sarılığı bi­raz gitmişti. Nihayet bütün cirmi de kayboldu. (Resûlullah sallallahu aleyhi ve sellem) Usâme'yi arkasına aldı ve yola revân oldu. Kasvâ'nın yularını o kadar kısmıştı ki neredeyse başı semerinin altındaki deriye çarpıyordu. Sağ eliyle de: \"Ey cemaat! Sükûneti muhafaza edin, sükûneti\" diye işaret buyuruyordu. Kum tepeciklerinden birine geldikçe hayvanının dizginini düze çıkıncaya kadar biraz gevşetiyordu. Nihayet Müzdelife'ye vardı. Akşamla yatsıyı bir ezan ve iki kametle birleştirip kıldı. (Râvi) Osman dedi ki: Aralarında hiç bir sünnet kılmadı. Sonra Resûlullah (S.A.V.) fecr doğuncaya kadar uzandı. Sabah aydınlanınca sabah namazını kıldı. (Râvi) Süleyman, \"(sabah namazını) bir ezan ve bir ikâmetle kıldı\" diye rivayet etti. (Bundan sonraki cümleyi rivayet ederken bütün râviler) birleştiler: Sonra Kasvâ'ya binerek Meş'ar-i Haram'a geldi sonra Meş'ar-i Haram'ın üzerine çıktı. (Burada) Osman'la Süleyman (şöyle) dedi(ler): Hemen kıbleye dönerek Allah'a hamd etti. Tekbir getirdi ve tehlilde bulundu. (Bu cümleye) Osman; \"ve tevhidde bulundu\" (cümlesini de) ilâve etti. Ve ortalık iyice ağarıncaya kadar vakfeye devam etti. Sonra Resûlullah (S.A.V.) güneş doğmadan yola koyuldu. Arkasına da Fadl b. Abbas'ı aldı. (Fadl) güzel saçlı, beyaz tenli ve yakışıklı bir adamdı. Resûlullah (S.A.V.) yola çıkınca (yanından) koşarak bir takım kadınlar geçtiler Fadl, onlara bakmaya başladı. Bunun üzerine Resûlullah elini Fadl'ın yüzüne koydu. Fadl da yüzünü öbür tarafa çevirip bakmağa başla)dı. Bu sefer Resûlullah (S.A.V.) de elini öbür tarafa çevirdi. Nihayet Muhassir (denilen yer)e vardı ve (hayvanı) biraz sürdü, sonra seni büyük cemreye çıkaracak olan yola düştü. Nihayet ağacın yanındaki cemreye vardı. Oraya yedi ufak taşı attı. Her birini atarken tekbir getiriyordu. Bunlar küçük çakıl taşları gibiydi ve onları vadinin içinden attı. Sonra kesim yerine giderek kendi eliyle altmışüç deve boğazladı. Sonra Ali (r.a.)'a emretti kalanı da o kesti. (Râvi bu son cümlenin tefsirinde) diyor ki: (Yüz deveden) geriye kalanı (Hz. Ali kesti,) (ve Resûl-i Ekrem sallallahu aleyhi ve sellem O'nu) kurban(lar)ına ortak etti. (Kesim bittikten) sonra her deveden bir parça (et getirilmesini) emr etti, (bunlar) bir tencereye konarak pişirildi. İkisi de develerin etinden yiyip suyundan içtiler. (Râvi) Süleyman dedi ki. Sonra (Hz. Nebi devesine) binip oradan hızla Beyt-i Şerife doğru yola çıktı. (Tavaftan sonra) öğleyi Mekke'de kıldı. Arkasından Zemzem sâkîliği yapan Beni Abdilmuttalib'e gitti ve onlara: \"Ey Abdulmuttalib oğulları! (Suyu) çıkarınız. Siıyu çıkarmanız hususunda başkalarının size galebe çalacağından endişe etmesem, ben de sizinle beraber çıkarırdım\" buyurdu. Onlar da kendilerine bir kova su takdim ettiler (sallallahu aleyhi ve sellem de) bu sudan içti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 185
			}
		}
	]
}