{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"11": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2017,
			"arabicnumber": 2017,
			"text": "Ebû Hureyre (r.a.)'den; demiştir ki: Allah (c.c.) kendi elçisin'e Mekke'nin fethini nasibedince Peygamber (s.a.v.) halkın içinde ayağa kalkıp Allah'a hamd-ü senada bulunduktan sonra şöyle buyurdu: \"Gerçekten Âllah (c.c) Fil Ordusunun Mekke(ye girmek)den men etmiş fakat Resulü ile mu'minleri Mekke'ye girmeye muzaffer kılmıştır. Allah teâla Mekke'yi sadece bana mahsus olmak üzere, gündüzün bir saatinde helâl kılmıştır. Sonra O (yine) kıyamete kadar haram (kıhnrmş)dır. Ağacı kesilemez kaybolan eşyası(nı almak) helâl olmaz, ilân edecek olan kimsenin dışında kaybolan eşyası(nı almak hiç kimse için) helâl değildir.\" Bunun üzerine Abbâs -Yahutta el-Abbas (Abbas kelimesinin \"el\" takısı ile mi yoksa el takısından tecrid edilerek mi rivayet edilmiş olduğunda râvi şüphe ediyor); Yalnız, izhir müstesna (değil mi) ya Resûlallah? Çünkü evlerimiz ve kabirlerimiz için (lâzım olmakta)dır, dedi. Bunun üzerine Resûlullah sallallahu aleyhi ve sellem de: \"Yalnız izhir müstesna!\" buyurdu. Ebû Dâvûd dedi ki: (Bu hadisi) el-Velid'den Îbnu'l-Musaffa da (rivayet etti ve hu rivayetine şunları da) ilâve etti: Bunun üzerine Yemen'li bir zât olan Ebu Şah ayağa kalkarak: Ya Resûlullah! Bunu bana yazınız, dedi. Resûlullah sallallahu aleyhi ve sellem.de, \"(Bunu) Ebu Şah için yazınız\" buyurdu. (Velid dedi ki) Ben Evzâî'ye (Hz. Peygamber) \"Ebû Şah için yazınız\" sözüyle neyi kastediyor? diye sordum da (Evzâî, Ebû Şah'ın); Resûlullah sallallahu aleyhi ve sellem'den işitmiş olduğu şu konuşmayı (yazınız anlamınadır)\" diye cevap verdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 297
			}
		}
	]
}