{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"12": "Marriage (Kitab Al-Nikah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2068,
			"arabicnumber": 2068,
			"text": "Urve b. ez-Zübeyr'in haber verdiğine göre, Kendisi Peygamber (s.a.v.)'in hanımı Âişe'ye Allah Teâlâ'nın \"eğer yetimler hakkında adalet gösteremeyeceğinizden korkarsanız, size helal olan (diğer) kadınlardan ikişer, üçer, dörder alın”[Nisâ 3] âyet-i kerimesini sormuş. Hz. Âişe de: Ey kız kardeşimin oğlu, bu kadından maksat, velisinin terbiyesinde bulunan yetim kızdır. Velisine malında ortak olur, onun da yetim kızın malı ve güzelliği hoşuna gider ve mehrinde adalet gözetmeksizin ve ona başkasının verdiği kadar mehir vermeksizin onunla evlenmeyi düşünür. İşte bu sebeble velilerin onları nikâh etmeleri yasak edildi. Ancak onlar hakkında adalet gösterip mehirlerinde âdet olanın en yüksek derecesine ulaşanlar müstesnadır. Bir de (velilere) bu yetim kızların dışındaki kendilerine helâl olan kadınlarla evlenmeleri emr edildi, diye cevap verdi. Urve dedi ki: Âişe şunları söyledi: Bilahare halk bu âyetten sonra kadınlar hakkında Resûlullah (s.a.v.)'dan fetva istediler. Bunun üzerine Azîz ve Celîl olan Allah, 'kadınlar hakkında senden fetva istiyorlar. De ki: Onlara dair fetvayı size Allah veriyor. Kendileri için yazılmış olan miras'ı vermediğiniz ve nikahlamalarını (beğenip) istemediğiniz yetim kızlar hakkında da Kitabda okunup duran (bir âyet) vardır...\"[Nisâ 127] âyet-i keri­esini indirdi. Âişe demiştir ki: Allah Teâlâ'nın \"size Kitapda okunup duran\" diye bahsettiği ilk âyettir ki, her türlü noksan sıfatlardan münezzeh olan Allah bu âyette: \"Eğer yetimler hakkında adalet gösterememekten korkarsanız, size helâl olan başka kadınlardan alın\" buyurmuştur. Hz. Âişe şöyle demiş: Azîz ve celîl olan Allah'ın diğer âyet-i kerimede \"onları nikâh etmek istemezsiniz\"[Nisâ 127] buyurması(na gelince), bu (sizden) birinizin terbiyesi altında bulunan yetim kızın malı ve güzelliği az olduğu zaman ona rağbet göstermemesidir. Böylece veliler bunlara rağbet göstermedikleri için malına ve güzelliğine rağbet ettikleri yetim kadınları nikâh etmekten nehyolundular. Ancak adalet gösterirlerse müstesna",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 23
			}
		}
	]
}