{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"12": "Marriage (Kitab Al-Nikah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2103,
			"arabicnumber": 2103,
			"text": "Meymûne bint Kerdem demiştir ki: Resûlüllah (sallallahü aleyhi ve sellem)’ın (Veda) Haccında babamla birlikte ben de (hac yolculuğuna) çıkmıştım. Resûlüllah (sallallahü aleyhi ve sellem) devesinin üzerinde iken babamın ona yaklaştığını gördüm. Bunun üzerine (Hazret-i Peygamber) onun için durdu ve onu dinle(meye başla)dı. (Hazret-i Peygamberin) yanında Sıbyân Mektebi hocalarının sopası gibi (küçük) bir sopa vardı. Ben Arapların ve halkın; Tabtabiyye!, tabtabiyye! tabtabiyye!\" diye bağırdıklarını işitiyordum. Babam ona yaklaşıp ayağına sarıldı. (Resûl-i Ekrem de) ona engel olmadı. Onun için durdu ve onu dinle(meye başla)dı. Bunun üzerine (babam: Yâ Resûlüllah) \" Ben bir ısrân ordusu hazırladım.\" dedi. (Isrân ordusu kelimesini râvî Muhammed) -İbn-ül-Müsennâ öısrân ordusu (şeklinde) rivâyet etti.- (Babam Kerdem sözlerine şöyle devam etti) Târik b. el-Murakkı'da; karşılığında bana bir mızrak verecek yok mu? dedi. Ben de mükâfatı nedir? dedim. gelecek olan kız(lar)ımın ilkini seninle evlendireceğim diye cevâp verdi. Bunun üzerine mızrağımı verip ondan uzaklaştım. Nihayet onun bir kızının dünyaya geldiğini ve (hem de) ihtiyarlamış olduğunu öğrendim. Sonra kendisine gelip: kızın) benim ailem(dir.) Onu bana hazırla! dedim. Ben, kendisine aramızda geçen (anlaşmanın) dışında yeni bir mehir daha vermedikçe (isteğimi) yapamayacağına dâir yemin etti. Ben de ona (daha önce) verdiğimin dışında bir mehir vermeyeceğime dâir yemin ettim. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem)' O bugün hangi kadınların yaşıtıdır?\" diye sordu. (Babam Kerdem de) gördü, cevabını verdi. (Resûl-i Ekrem (sallallahü aleyhi ve sellem) de) Senin onu terk etmeni (daha uygun) görüyorum.\" buyurdu. (Kerdem) dedi ki: (Resûl-i Ekrem'in) bu (sözü) beni korkuttu. Resûlüllah (sallallahü aleyhi ve sellem)’e (doğru) baktım. Derhal bendeki bu korkuyu gördü. Sen de günahkâr olmazsın, arkadaşın da günahkâr olmaz.\" buyurdu (bendeki korkuyu giderdi.) b. Hanbel, VI, 366; Beyhaki, es-Sünenü’l-kübrâ, VII, 145. Dâvûd buyurdu ki: ihtiyarlık demektir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 58
			}
		}
	]
}