{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"12": "Marriage (Kitab Al-Nikah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2165,
			"arabicnumber": 2165,
			"text": "Enes b. Mâlik (radıyallahü anh)'den şöyle dediği rivâyet edilmişti: Yahudiler kendilerinden bir kadın hayız gördüğü zaman onu evden dışarı çıkarırlar, onunla birlikte yemezler, içmezler ve evlerde onunla birlikte oturmazlardı. Bu (mesele) Resûlüllah (sallallahü aleyhi ve sellem)'a soruldu da, noksan sıfatlardan münezzeh olan yüce Allah, \" Sana hayız halini sual ediyorlar. De ki, o bir eziyettir. Âdet halinde kadınlardan çekilin...\" el-Bakara (2), 222. âyetini indirdi. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem); oldukları zaman) onlarla birlikte evlerde oturun, cimadan başka herşeyi yapın,\" buyurdu. Sonra Yahudiler; adam bize muhalefet etmedik hiç bir işimizi bırakmayacak dediler. Sonra Abbâd b. Bişr ile Üseyd b. Hudayr Peygamber (sallallahü aleyhi ve sellem)'e gelerek; Resûlüllah, Yahudiler şöyle şöyle diyorlar (yani) biz hayız halinde bulunan kadınlar(ımız)la cinsi münâsebette bulunamaz mıyız? dediler. Resûlüllah (sallallahü aleyhi ve sellem)'in yüzü birden değişiverdi. Biz de (bunu görünce) onlara kızdığını zannetmiştik. Biraz sonra (Üseyd ile Abbad) dışarıya çıktılar? Derken karşılarına Resûlüllah (sallallahü aleyhi ve sellem)'e hediye süt (götüren biri) çıktı. Sonra Resûlüllah (sallallahü aleyhi ve sellem) o sütü arkalarından göndererek onlara içirdi. Biz de Resûl-i Ekrem'in onlara kızmadığım anladık. hayz 16; Ebû Dâvud, tahâre 102, Tirmizi, tefsir sure (2), 24; Nesâi, tehâre 180; hayz 8; Ahmed b. Hanbel, III, 132, 133, 246",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 120
			}
		}
	]
}