{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"13": "Divorce (Kitab Al-Talaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2213,
			"arabicnumber": 2213,
			"text": "İbnü’l-Ala el-Beyazî dedi ki: Ben kadınlarla kimsenin gücünün yetmeyeceği kadar (çok) temasta bulunabilen (şehvetli) bir adamdım. Ramazan ayı girince bana zarar gelecek bir şekilde karıma yaklaşmaktan ve nihayet (o şekilde) sabahlamaktan korktum da Ramazan ayı çıkıncaya kadar karımdan ziharda bulundum. Bir gece bana hizmet edip dururken birdenbire, vücudunun bir kısmı açılıverdi. (Bunun üzerine) ona yaklaşmaktan kendimi alıkoyamadım. Sabah olunca çıktım kavmime (uğradım) ve olayı onlara anlattım ve; Resûlüllah (sallallahü aleyhi ve sellem)'a gidelim, dedim; vallahi olmaz, dediler. Bunun üzerine Peygamber (sallallahü aleyhi ve sellem)'a varıp durumu anlattım; Sen mi bu işi yaptın ey Seleme?\" buyurdu. Ben de iki defa; ben yaptım Ya Resûlallah, dedim (ve şunları ilâve ettim), ve ben Allah'ın emrine sabrederim benim hakkımda Allah'ın sana bildirdiği şekilde hüküm ver diyerek sözlerimi bitirdim. (Resûlüllah sallallahü aleyhi ve sellem de); Bir köle azat et\" buyurdu. Ben de; hak ile gönderen zata yemin ederim ki (şu nefsimden ) başka bir köleyi azat etmeye gücüm yetmez, dedim ve boynumun üzerine vurdum. (Bunun üzerine); İki ay üst üste oruç tut\" buyurdu (ben de) dedi(m ki); şu başıma gelen ancak oruç yüzünden geldi. (Bunun üzerine) (Öyleyse) altmış fakire bir vesk hurma yedir\" buyurdu. Ben de; hak ile gönderen için (elimizde) hiç yiyecek yoktur, dedim. Bunun üzerine; Sen Züreyk oğullarının sadakasını toplayan memura git o da sadakayı sana versin sen de yoksullara 60 vesk hurma ver ve kalanını da ailenle birlikte ye\" buyurdu. Bunun üzerine kavmime döndüm ve onlara; yanınızda darlık ve kötü düşünce(ler)le karşılaşmışken Peygamber (sallallahü aleyhi ve sellem)'in yanında genişlik ve güzel düşünce(ler) buldum. Sizin sadakalarınızın bana verilmesini emretti\" dedim. hadîse) İbn el-Ala (şu sözleri) ilave etti; İbn İdris, Beyade'nin Züreyk oğullarından bîr kol olduğunu söyledi.\" Mâce, talak 25; Tirmizî, talak 20; Ahmed b. Hanbel, VI, 411; Darimî, talak 9",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 39
			}
		}
	]
}