{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"13": "Divorce (Kitab Al-Talaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2245,
			"arabicnumber": 2245,
			"text": "Sehl b. Sa'd es-Sâidî dedi ki; Uveymir b. Eşkar el-Aclânî, Asım b. Adiyy'e gelerek; Ey Âsim, karısını (yabancı) bir erkekle yakalayan adam hakkında görüşün nedir? O, onu (zaniyi) öldürecek, siz de onu mu öldüreceksiniz?! yoksa nasıl hareket edecek? Ey Asım, bunu benim için Rasûlullah (s.a.v.)'e soruver, dedi. Asım da (bunu) Rasûlullah (s.a.v.)'e sorunca, Rasûlullah Sallâllahu aleyhi ve sellem (bu) suallerden hoşlanmadı ve (bu şekilde sorular sormayı) ayıpladı. Hatta Rasûlullah (s.a.v.)'den işittikleri Asım'ın ağrına gitti. Asım evine dönünce Uveymir onun yanına gelip; Ey Asım, Rasûlullah (s.a.v.) sana ne cevâp verdi? dedi. Asım da; Sen bana hayır getirmedin. Rasûlllah (s.a.v.) sorduğum meseleden hoşlanmadı deyince Uveymir; Allah'a yemîn olsun ki bunu ona sormaktan vazgeçmeyeceğim, karşılığını verdi. Derken Uveymir kalkıp halk arasında bulunan Rasûlullah (s.a.v.)'in yanına geldi ve; Ey Allah'ın Rasülü, ne buyurursun, bir adam karısının yanında birini bulursa, onu öldürür siz de kendisini mi öldürürsünüz, yoksa ne yapar? diye sordu. Bunun üzerine Rasûlullah salâllahu aleyhi ve sellem; \"Senin ve hanımın hakkında Kur'an âyeti indirildi git onu getir.\" buyurdu. Sehl dedi ki: \"Ben halk ile birlikte Rasûlullah (s.a.v.)'in yanında iken onlar da lânetleştiler.\" (lânetleşmeyi) bitirdikleri zaman Uveymir; Ey Allah'ın Rasûlü, eğer ben onu (nikâhım altında) tutacak olursam, onun hakkında yalan söylemiş duruma düşerim, dedi ve daha Rasûlullah ona (hanımını boşaması için) emir vermeden önce onu üç (talâkla) boşadı. İbn Şihâb; \"Artık bu, liân yapanların âdeti olmuştur,\" dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 71
			}
		}
	]
}