{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"13": "Divorce (Kitab Al-Talaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2254,
			"arabicnumber": 2254,
			"text": "İbn Abbâs (radıyallahü anh)'dan rivâyet edildiğine göre, Hilâl b. Ümeyye Peygamber (sallallahü aleyhi ve sellem)'in huzurunda, karısını Şerîk b. Sehmâ ile zînâda bulunmakla suçladı. Peygamber (sallallahü aleyhi ve sellem) de Hilâl’e (Dört) şahid(ini) (hazırla) yahut da arkana hadd (vurulacaktır)\" buyurdu. Bunun üzerine Hilâl: Ey Allah'ın Rasûlü! Bizim birimiz karısının üzerinde bir erkek görürse, şahit mi aramaya gidecek? (o kimse şâhid getirinceye kadar, işini bitirip savuşup) gitmez mi? diye karşılık verdi. Resûl-i Ekrem de: Sen şahidlerini hazırla, yoksa arkana hadd (vurulacaktır)\" demeye devam etti. Bunun üzerine Hilâl (b. Ümeyye); hak Peygamber olarak gönderen (Allah)'a yemîn ederim ki, gerçekten ben doğru söylüyorum ve (eminim ki) Allah benim bu işim hakkında benim arkamı hadden kurtaracak bir şey (âyet) indirecektir, dedi. üzerine, \" Eşlerine (zînâ suçu) atan ve kendilerinden başka şahitleri bulunmayan kimseler- en-Nûr, (24), 6. âyeti indi ve (Hazret-i Peygamber de bu âyeti) \" doğru söyleyenlerdendir,\" kavli şerifine kadar okudu ve (âyeti) bitirince onlara haber gönderdi ikisi de geldiler (önce) Hilâl ayağa kalkıp şehâdette bulundu. Peygamber (sallallahü aleyhi ve sellem) de, Muhakkak ki Allah birinizin yalancı olduğunu biliyor (bu durunda) ikinizden tevbe edecek (birisi) var mıdır?\" diye sordu. Sonra (Hilâl'in karısı) kalkıp şehâdette bulundu ve \" Eğer (kocası) doğru söylüyorsa Allah'ın gazabının kendi üzerine olmasını\" (ifâde eden) beşinci yemîne gelince (orada bulunanlar) ona: (şehâdet azabı) mucibdir, diye ikazda bulundular. Abbâs diyor ki; Bunun üzerine kadın biraz yavaşlayıp durakladı. Hatta biz kadını (şehâdette bulunmaktan) vaz geçecek zannettik, derken (kadın kendini toparlayıp); kadar şerefle yaşamış (olan) kavmimi (ben bundan sonraki günlerde) rezîl ve rüsvây etmem, diyerek liân yemînini yerine getirdi. Bunun üzerine Peygamber (sallallahü aleyhi ve sellem); Bu kadına dikkat ediniz! Eğer gözleri sürmeli iri kalçalı, kalın baldırlı, bir çocuk dünyaya getirirse, çocuk Şerik b. Sehmâ'ya aittir,\" buyurdu. (Kadın da gerçekten) böyle bir çocuk dünyaya getirdi. Bunun üzerine Peygamber (sallallahü aleyhi ve sellem) Eğer Allah'ın kitabının (liân hakkındaki) hükmü infaz edilmemiş olsaydı, benîm ile bu kadın için (başka) bir durum vardı (yani ben o kadına zînâ haddi uygulardım)\" buyurdu. Dâvud dedi ki: Bu İbn Beşşâr hadîsi (yâni) Hilâl (b. Ümeyye) hadisesi (sadece) Medînelilerin rivâyet ettiği hadîs(ler)dendir. tefsîr Sûre (24), 1, 3; Tirmizî, tefsîr Sûre (24), 3; İbn Mâce, talâk 27; Ahmec b. Hanbel, I, 239; V, 294",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 80
			}
		}
	]
}