{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"15": "Jihad (Kitab Al-Jihad)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2501,
			"arabicnumber": 2501,
			"text": "Sehl b. el-Hanzaliyye şöyle anlatmıştır: (Hazret-i Peygamberin sahabilerinden) bir cemaat Huneyn (savaşı) günü Resûlüllah (sallallahü aleyhi ve sellem)'la birlikte yürüdüler. Yürüyüşü uzattılar. Nihayet akşam üstü oldu. Ben de Resûlüllah'ın yanında (ikindi) namaz(ın)da hazır bulundum. O anda atlı bir adam geldi ve; Allah'ın Rasûlü, ben sizin önünüzden gitmiştim şöyle bir dağa çıktım. Bir de baktım ki Havazin kabilesi develerine binili kadınları, develeri ve koyunlarıyla birlikte hiç kimse geri kalmamak kaydıyla Huneyn'de toplanmışlar, dedi. Resûlüllah (sallallahü aleyhi ve sellem)'de gülümsedi ve; İnşallah onlar yarın müslümanların ganimeti olacaktır\" buyurdu. Sonra, Bu gece bizi kim bekleyecek?\" diye sordu. Enes b. Ebû Mersed el-Ganevi; (bekleyeceğim) Ya Resûlallah cevabını verdi. (Hazret-i Peygamber ona); Bin!\" dedi. O da kendisine ait bîr ata binip Resûlüllah (sallallahü aleyhi ve sellem)'a geldi. Resûlüllah da ona (şöyle) emretti: Şu boğaza git tepesine çık. Bu gece senin tarafından (gelecek) bir pusuya düşmeyelim\" . Sabahladığımız vakit Resûlüllah (sallallahü aleyhi ve sellem) namazlarını) kıldığı yere çıkıp iki rekat naımaz kıldı. Sonra; Atlınızı gördünüz mü?\" dedi. Ya Resûlallah, diye karşılık verdiler. Namaz için kamet getirildi. Resûlüllah (sallallahü aleyhi ve sellem) namaza durdu ve boğaza da bakıyordu. Nihayet namazı bitirip de selâm verince: Müjde size (işte) atlınız geldi!\" buyurdu. Biz ağaçların arasından boğaza (doğru) bakmaya başladık. Bir de ne görelim (atlı) gelip Resûlüllah (sallallahü aleyhi ve sellem)'ın huzuruna durdu. Selâm verdi ve (şöyle) dedi: gittim şu boğazın tepesine, Resûlüllah (sallallahü aleyhi ve sellem)'in emir buyurduğu yere kadar çıktım. Sabah olunca boğazın iki yanındaki tepelere çıkıp (etrafı) gözetledim kimseyi göremedim. Resûlüllah (sallallahü aleyhi ve sellem) ona; Bu gece (atından hiç) indin mi?\" diye sordu. (O da); Ancak namaz kılmak veya abdest bozmak için inmem hariç diye cevap verdi. Resûlüllah (sallallahü aleyhi ve sellem) ona; Sana (cenneti) kazandıran bir amel işledin. Bundan sonra (başka) bir amel işlemesen de zararı yok.\" buyurdu. Ebû Dâvud rivâyet etmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 25
			}
		}
	]
}