{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"15": "Jihad (Kitab Al-Jihad)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2507,
			"arabicnumber": 2507,
			"text": "Zeyd b. Sabit (radıyallahü anh)'den; demiştir ki: Ben Resûlüllah (sallallahü aleyhi ve sellem)'ın yanında (oturuyor) idim. Kendisini bir sükûnet kapladı. Derken Resûlüllah (sallallahü aleyhi ve sellem)'ın dizi benim dizimin üzerine düştü. Resûlüllah'ın dizinden daha ağır birşey görmedim. Sonra (bu hal) ondan çekilip gidince (bana hitaben); Yaz!\" dedi. Ben de onun mübarek ağzından çıkan; inananlardan yerlerinde oturanlar ile mallarıyla canlarıyla Allah yolunda cîhad edenler bir olmaz. \" en-Nisa (4), 95. âyetini sonuna kadar bir kürek kemiği üzerine yazdım. Bu esnada âmâ bir adam olan İbn Ümm-i Mektum mücâhidlerin faziletini işitince ayağa kalktı ve; Allah'ın Rasûlü mü’minlerden cihada gücü yetmeyenlerin durumu nasıldır? dedi. (İbn Ümm-i Mektum) sözünü bitirince Resûlüllah (sallallahü aleyhi ve sellem)'i (yeniden) bir sükunet hali daha kapladı ve dizi dizimin üzerine düştü. Dizinin ağırlığını (bu) ikinci defa (ki düşüşün) de de (aynen) birinci defaki gibi (herşeyden daha ağır) buldum. Sonra (bu hal) Resûlüllah (sallallahü aleyhi ve sellem)'den çekilip gidince (bana hitaben); Ey Zeydî (yazdığını) oku!\" dedi. Ben de (yazdığım âyetin) (kısmım) okudum. Resûlüllah (sallallahü aleyhi ve sellem)'de (bu kısma) = özürsüz olarak (sözü ilâve edilecek)\" dedi (ve) âyetin tümünü okudu. Zeyd dedi ki: Allah (bu âyette bulunan -özürsüz olarak- anlamındaki) kelimeyi başlıbaşına indirdi. Ben de (âyete) ilâve ettim. Hayatım elinde olan Allah'a yemin olsun ki onun kemikte bulunan çatlağın yanındaki ilâve edildiği yeri görür gibiyim. tefsir; Nisa 18; Cihad 31; Müslim, imare 141; Ahmed b. Hanbel, V, 190, 191",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 31
			}
		}
	]
}