{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"15": "Jihad (Kitab Al-Jihad)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2612,
			"arabicnumber": 2612,
			"text": "Süleyman b. Büreyde babası (Büreyde) den; şöyle demiştir: Rasûlullah bir seriyye'nin yahut da bir ordu'nun başına bir kumandan gönderdiği zaman ona kendi nefsi hakkında Allah'dan korkmayı, (yine ona) yanında bulunan müslümanlar hakkında hayrı tavsiye eder ve (şöyle) buyururdu: \"Müşriklerden olan düşman(lar)ınla karşılaştığınız zaman, onları şu üç yoldan birine çağırınız. Bunlardan hangisinde sana icabet ederlerse onu kabul et ve kendilerini bırak. Onlan (önce) İslam'a çağır, eğer icabet ederlerse (bunu) onlardan kabul et ve kendilerini (serbest) bırak. Sonra onları kendi ülkelerinden muhacirlerin ülkesine göç'e davet et ve bunu yaptıktan takdirde, muhacirler için (tanınmış) olan (haklar)ın onlar için de (tanınacağını) muhacirlerin üzerine (getirilmiş) olan (yükümlülükler)in onların hakkında da (geçerli) olduğunu kendilerine bildir. Eğer (bunu) kabule yanaşmazlar da kendi yurtlarını tercih ederlerse, onlara müslüman bedeviler gibi olacaklarını, kendilerine Allah'ın mu'minler üzerine cereyan eden hükmünün uygulanacağını, müslümanlarla birlikte cihad etmeleri dışında haraç ve ganimetten hiçbir hisselerinin olmayacağını kendilerine bildir. Eğer İslâmı kabul etmezlerse onları cizye vermeye çağır. Eğer buna yanaşırlarsa (bunu) onlardan kabul ve kendilerini (serbest) bırak. Eğer kabul etmezlerse artık Allah'dan yardım dileyip onlarla savaş, eğer bir kale halkını kuşattığında senden kendilerine, Allah'ın hükmünü uygulamanı isterlerse (bunu) onlara uygulama. Çünkü siz Allah'ın onlar hakkındaki hükmünün ne olduğunu bilemezsiniz. Yalnız onlara kendi hükmünüzü uygulayınız. Sonra onlar hakkında dilediğiniz hükmü veriniz.” Süfyân dedi ki: Alkame (şöyle) dedi: \"Ben bu hadisi Mukâtil b. Hayyan'a naklettim de (bu hadisi) bana Müslim rivayet etti, diye karşılık verdi. Ebû Dâvûd dedi ki; (Müslim) îbn Heyzam'dır. Nu'man b. Mukarrir'den (naklen) Nebi (s.a.v.)'den Süleyman b. Büreyde'nin hadisinin bir benzerini (rivayet) etmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 136
			}
		}
	]
}