{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"15": "Jihad (Kitab Al-Jihad)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2650,
			"arabicnumber": 2650,
			"text": "Ali b. Ebi Talib'in katibi olan Ubeydullah b. Ebi Rafi' dedi ki: Ben Ali (radıyallahü anh)'yi (şöyle) derken işittim: Resûlüllah (sallallahü aleyhi ve sellem) benî Zübeyr ve Mikdad-ı; Haydin Hâh bahçesine gidin! Orada, yanında mektup bulunan bir câriye vardır. Mektubu ondan alın\" gönderdi. Atlarımızı koşturarak yola koyulduk. Bahçeye vardık. Derken ansızın cariye karşımıza çıkıverdi. Bunun üzerine: Mektubu getir, dedik. mektup yok, cevabını verdi. Ben de: Ya mektubu çıkarırsın, yahut da elbiseleri bırakırsın! dedim. Bunun üzerine örülü saçlarının arasından mektubu çıkardı. Biz de onu peygamber (sallallahü aleyhi ve sellem)'e getirdik. Bir de ne görelim mektup Hatıb b. Ebi Beltea (tarafın)dan Resûlüllah (sallallahü aleyhi ve sellem)'in bazı işlerini haber vermek üzere bazı müşriklere (hitaben yazılıp gönderilmiş) Resûlüllah (sallallahü aleyhi ve sellem); Ey Hatıb! Bu nedir?\" diye sordu. (Hatıb); Allah'ın Rasûlü! Benim hakkımda (hüküm vermekte) acele etme. Ben Kureyş'in müttefiki idim. Ama onlardan değildim. Şurası bir gerçek ki (Muhacirlerden) Kureyş (kabilesine mensup bazı kimseler)in Mekke'de hısımları vardır. (Bu akrabalar) hısımlıkları sebebiyle (muhacirlerin) Mekke'de bulunan ailelerini koruyorlar. Benim (Mekkelilerle olan hısımlığım) kalmayınca onlara bir iyilik yapmayı ve bu iyilik sebebiyle (oradaki) akrabalarımı korumalarını (sağlamayı) arzu ettim. Allah'a yemin olsun ki ey Allah'ın Rasûlü bende küfürde yok, dinden dönme de yok dedi. Resûlüllah (sallallahü aleyhi ve sellem)'de; (Bu adam), size doğru söyledi\" buyurdu. Bunun üzerine Ömer; bırakta şu münafığın boynunu vurayım, dedi. Resûlüllah (sallallahü aleyhi ve sellem) de; Gerçekten o Bedir (muharebesin) de bulunmuştur. O'nun katle layık olduğunu nereden biliyorsun. Allah onların durumuna muttali olduğu için Bedir ehli hakkında; İstediğinizi yapınız. Ben sizi affettim.\" buyurmuştur.\" cevabını verdi. cihâd 141; Tefsir sûre (60), 1; Meğazi 46; Müslim, Fezailu's-sahâbe 161; Tirmizi, Tefsir sûre, (60),l;Ahmed b. Hanbel 1,79",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 174
			}
		}
	]
}