{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"15": "Jihad (Kitab Al-Jihad)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2660,
			"arabicnumber": 2660,
			"text": "Ebû Hüreyre'den demiştir ki: Resûlüllah (sallallahü aleyhi ve sellem) (Mekke'ye) on (kişilik) casus göndermişti. Asım b. Sabit'i de onlara komutan tayin etmişti. Huzeyl (kabilesi) de bunlar(ı takib) için yüze yakın okçu çıkardı (ve peşlerine taktı). Asım (radıyallahü anh) onları(n kendilerini izlediğini) hissedince Karded (denilen yüksekçe bir yer)e sığındılarsa da okçular (oradan) ininiz ve bize elinizdekile (silahla)rı teslim ediniz. Sizden hiçbir kimseyi öldürmeyeceğimize dair söz ve teminat veriyoruz, dediler. Bunun üzerine Asım: gelince ben bir kafirin sözüne güvenerek (buradan) inmem (ve onlara teslim olmam) dedi. Bunun üzerine (kafirjer) müslümanlar üzerine ok yağdırıp Asımla birlikte yedi kişiyi şehid ettiler. (Geriye kalan) üç kişi ise (kafirlerin verdiği) söz ve teminattan dolayı (bulundukları yerden) indiler. Bu üç kişiden (birisi) Hubeyb, (birisi) Zeyd b. ed-Desinne, (birisi de) başka bir adamdı. (Kâfirler) bunları ele geçirince oklarının tellerini çözüp o iplerle kendilerini (sımsıkı) bağladılar. Bunun üzerine üçüncü zat; (bize) ilk ihanet budur. Vallahi size teslim olmam. Bu şehidler benim için bir örnektir, dedi. Onu sürükledilerse de onlarla gitmeye razı olmadığı için onu da şehid ettiler. Hubeyb bir süre esir olarak kaldı. Nihayet (haram aylar çıkınca) onu da öldürmeye ittifakla karar verdiler. Bu jöldürme kararı üzerine Hubeyb ödünç olarak bir ustura aldı. Onunla bir etek tıraşı yaptı onu öldürmek için (harem-i şerif haricindeki tenim'e) çıkardılar. Hubeyb onlara; bırakınız da iki rekat namaz kılayım, dedi ve sonra: yemin olsun ki, eğer bende olan şu halin bir korku eseri olduğunu düşünmeyecek olsaydınız (bu namazı) daha da artırırdım dedi. cihâd 170, meğazi 28",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 184
			}
		}
	]
}