{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"15": "Jihad (Kitab Al-Jihad)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2693,
			"arabicnumber": 2693,
			"text": "Urve b. ez-Zübeyr (in) el-Misver b. Mahreme ile Mervan'dan naklettiğine göre; Rasûlullah (s.a.v.) Hevâzin (kabilesi) elçileri müslümanlığı kabul ederek kendisine gelip de mallarının kendilerine geri verilmesini istedikleri zaman onlara (şöyle) konuştu: Benim yanımda şu gördüğünüz (askerler) vardır.\" (onların hepsinin de bu mallarda hakkı vardır) söz (ler)den en hoşuma gideni en doğru olanıdır. (Binaenaleyh) ya esir (leriniz)i tercih ediniz ya da mallarınız)!\" Bunun üzerine (Hevazin elçileri); Biz esir(ler)imizi tercih ediyoruz dediler. Rasûlullah (S.A.V.) de (onlara bir hitabede bulunmak üzere ayağa) kalktı Allah'a (hamd-ü) senada bulunduktan sonra dedi ki: \"...Gelelim mevzumuza! Sizin şu (Hevazinli) kardeşleriniz (müslümanlığı kabul edip) tevbe ederek geldiler. Ben onlara esirlerini (karşılıksız olarak) geri vermeyi uygun görüyorum. Sizden kim kendi arzusuyla bunu yapmayı istiyorsa (bunu) yapsın. Kim de bizim kendisine Allah'ın bize vereceği ilk fey'den (biraz mal) vermemize kadar (esirler üzerindeki) hakkını elinde tutmak istiyorsa (o da bunu) yapsın\" (orada bulunan) halk; Ey Allah'ın Rasûlü biz kendi gönlümüzle bu esirleri onlara (karşılıksız olarak) veriyoruz, dediler. Bunun üzerine Rasûlullah (s.a.v.) \"Biz (esirleri karşılıksız olarak bırakmamız hususunda bize) izin verenle vermeyeni biribirindcn ayırdedemiyoruz. Gidiniz başkanlarınıza (danışınız) sizin kararınızı bize onlar getirsinler.\" dedi. Halk da (başkanlarının yanına) gitti. Başkanları onlarla konuştular ve hepsinin de esirleri karşılıksız olarak bırakmayı gönülden istediklerini ve (buna) izin verdiklerini bildirdiler",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 217
			}
		}
	]
}