{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"15": "Jihad (Kitab Al-Jihad)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2765,
			"arabicnumber": 2765,
			"text": "Misver b. Mahreme'den demiştir ki: Nebi (S.A.V.) Hudeybiye yılında ashabından bin küsur (kişi) ile (birlikte Medine'den Mekke'ye doğru yola çıktı.) Nihayet Zü'l-huleyfe'ye vardıkları zaman kurbanlığına gerdanlık taktı, onu işaretledi ve umre (yapmak niyetiyle) ihram'a girdi, (ravi) Hadisi (ayrıntılarıyla) sevk(e devam) etti (ve daha sonra şunları söyledi): Peygamber (S.A.V.) üzerinden Mekkeliler (karargahın)a inilen Seniyye mevkiine gelmişti ki, burada (kasva isimli) devesi çöktü. Halk \"Yürü, yürü\" dedi (ler ve) iki defa \"kasva huysuzlaşıp yürümez oldu.\" diye (bağırdılar). Bunun üzerine Peygamber (S.A.V.) (kasva) \"Yürümemekte inatçılık etmez. Bu onun adeti değildir. Fakat onu (yürümekten) alakoyan (kuvvet) (Ebrehe'nin) Fili (ni yürümekten) alakoyan (kuvvet) tir-\" buyurdu. Ve (sözlerine devam ederek) \"Varlığım elinde olan Zat'a yemin olsun ki; Mekkeliler bugün Allah'ın (haram dahilinde) muhterem kıldığı şeylere ta'zim kasdederek benden ne kadar müşkül talebde bulunurlarsa ben onu (mutlaka) onlara vereceğim\" buyurdu, sonra deveyi (yürümeye) teşvik etti. Bunun üzerine (hayvan) sıçra (yıp kalk)dı ve Mekkeliler (in bulunduğu yön) den (aksi istikamete) döndü. (Hudeybiye'ye doğru ilerlemeye başladı) Nihayet (Peygamber Efendimiz) Hudeybiye'nin suyu az olan Semed kuyusu üzerindeki son noktasında konakladı. Bu sırada yanına Büdeyl b. Verka el-Huzaî, sonra da Urve b. Mes'ûd geldi. (Urve Arapların adeti üzere Peygamber (S.A.V.)'in sakalından tutarak onunla konuşmaya başladı. Muğire b. Şu'be de başında miğfer ve yanında kılıç olduğu halde Peygamber (S.A.V.)'in yanında bulunuyordu. Kılıcın sapıyla Urve'nin eline vurdu ve (Urve'ye): Elini onun sakalından geri çek!\" diye haykırdı. Bunun üzerine (Urve) başını kaldırıp: \"Bu (da) kim?\" dedi. (Oradakiler de kardeşinin oğlu) \"Muğire b. Şu'be'dir\" karşılığını verdiler. (Urve Muğire'ye hitaben): \"Ey gaddar! Ben hala senin (cahiliyyetteki) hıyanetini ödemeye çalışmakla meşgul değil miyim?\" dedi. Muğire (müslüman olmadan önce) cahiliyyette (Malik oğullarından) bazı kimselerle yol arkadaşlığı etmiş (ve yolda) bunları öldürüp mallarını almış, sonra (Medine'ye) gelip müslüman olmuştu. (Bu malları getirip Hz. Peygamber'e arz edince) Peygamber (S.A.V.) \"Müslümanlığını kabul ediyoruz, fakat mal'a gelince, o hıyanet malıdır. Bizim ona ihtiyacımız yoktur.\" buyurdu (Ravi Misver bu) hadisi (tam olarak) rivayet etti (Fakat Musannif Ebu Davud onu kısaltarak nakletti. Kureyş'in Hz. Peygamber ile sulh yapmak üzere gönderdiği Süheyl, müslümanların yanına gelince Hz. Peygamber onunla on senelik bir sulh akdi üzerinde anlaştı) Bunun üzerine Peygamber (S.A.V.) (Ali b. Ebi Talib (r.a)'ı çağırıp o'na hitaben ey Ali \"Şu, Muhammed'in üzerinde karar kıldığı hükümdür, diye yaz!\" buyurdu. Süheyl'in, Allah'ın peygamber'e indirdiği kitapları inkar ettiğini, O'na anlattı (Hz. Ali Hz. Fahr-i Kainat'ın kabul ettiği sulh akdinin metnini (yazarken) Süheyl \"Biz'den bir kimsenin sana sığınamayacağına, (sana sığınmak için yanınıza gelen bu kimse) Senin dininde bile olsa (derhal) onu bize iade edeceğine dair.\" (anlaşmaya vardığımızı da yazılsın) dedi. Hz. Peygamber (bu metnin) yazılmasını bitirdikten sonra sahabilerine \"Kalkınız (hediyelik kurbanlarınızı) boğazlayınız, sonra da tıraş olunuz.\" buyurdu. Sonra mü'min muhacir kadınlar geldi(ler. Nitekim Yüce Allah, ey iman edenler! mü'min kadınlar göç ederek size geldiği zaman, onları imtihan edin) [bk. el-Mümtehine 10] ayet (-i kerimesinde bu olaya işaret buyurmuştur. Yüce Allah mü'min kadınların muhacir olarak Medine'ye gelmeleri üzerine indirdiği bu ayet-i kerimeyle) bu kadınların Kureyşlilere geri verilmesini yasakladı ve kafir kocalarının bunlara sarfettikleri mehir kadarını onlara, müslümanların da ver(ererek onlarla evlen) melerini emretti. Daha sonra (Rasûlullah (S.A.V.) Medine'ye döndü. Bu sırada Kureyş'ten Ebû Basir (isimli) bir adam (müslüman olarak) Hz. Peygamberin yanına geldi (Kureyşliler) onu istemek üzere iki elçi gönderdiler (Rasûl-i-Zî-şan Efendimiz de sulh hükümlerine uyarak) Ebû Basir'i (bu) iki adam'a geri verdi. (Onlar da) Ebû Basir ile birlikte (yol'a) çıktılar. Nihayet Zü'l-huleyfe'ye vardıkları zaman (yanlarında bulunan) hurmadan birazını yemek için oraya indiler. Ebû Basir (bu) iki kişiden birisine (yani Huneys'e): \"Ey falanca vallahi ben senin şu kılıcını çok güzel zannediyorum.\" dedi (kılıcın sahibi olan) öbür kişi de kılıcı (kınından) çekerek: \"Evet (öyledir) Ben de bu kılıcı (çok) denedim.\" diye karşılık verdi. Ebû Basir de \"Onu bana göster de (iyice bir) bakayım\" dedi (karşıdaki) ona bu imkanı verdi. (Ebû Basir, hemen) kılıcı o'na vurdu. Nihayet (adam kılıcın darbesiyle) can verdi. (Ölünün yanında yol arkadaşı olarak bulunan) öbür adam kaçıp ta Medine'ye vardı ve koşarak mescide girdi. Bunun üzerine Peygamber (S.A.V.) \"Gerçek'ten şu adam bir korku görüp geçirmiştir.\" buyurdu, (o kimse Hz. Peygambere iyice yaklaştıktan sonra) (Vallahi) \"Arkadaşım (Ebû Basir tarafından) öldürüldü (Ona engel olmazsanız) kesinlikle ben de öldürüleceğim\" dedi. Bu sırada Ebû Basir de çıka geldi: (Ey Allah'ın Rasûlü vallahi) \"sana Allah ahdini yerine getirtti. Beni müşriklere geri gönderdin, sonra da Allah beni onlardan kurtardı.\" dedi. Peygamber (S.A.V.) \"Harbi kızıştırması yönünden, Ebû Basir'e hayret doğrusu. Eğer onun yanında bir kişi daha olsa\" (Kureyş ile aramızda olan sulhu bozup harbi yeniden başlatırdı) dedi. (Ebû Basir) Bu sözü işitince (Hz. Peygamber'in kendisini Kureyşlilere göndereceğini anladı ve hemen (Hz. Peygamber'in) huzurundan) çıktı. (Yollara düştü) Nihayet deniz sahiline geldi. (Bu sırada) Ebû Cendel'de (müşriklerin elinden) kurtulup Ebû Basir'e iltihak etti. Nihayet (Ebû Cendel'in yanında müşriklerin elinden kurtularak kaçıp gelen) bir cemaat toplandı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 289
			}
		}
	]
}