{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"15": "Jihad (Kitab Al-Jihad)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2768,
			"arabicnumber": 2768,
			"text": "Cabir'den şöyle dediği rivayet edilir ki: Rasûlullah (S.A.V.) \"Ka'b b. Eşref'e (karşı) kim çıkacak? Çünkü o, Allah'a ve Rasûlüne eza etmiştir.\" buyurdu. Muhammed b. Mesleme kalkıp: \"Ben (karşı çıkacağım) ya Rasûlullah! Onu öldürmemi ister misin?\" dedi. (Hz. Peygamber de) \"Evet\" (istiyorum) buyurdu. (Muhammed b. Mesleme) (onun hile ile öldürebilmek için ona siz'den yakınarak) \"Bir şeyler söylemem için (lütfen bana) izin verin.\" Dedi (Hz. Peygamber \"Evet (sana bu hususta izin veriyorum ona benim hakkımda gerekeni) söyle\" (yebilirsin) buyurdu. (Muhammed b. Mesleme, Ka'b b. Eşrefin) yanına gelip (Hz. Peygamberi kasdederek); \"Bu adam bizden sadaka istedi ve bizi dar'a düşürdü.\" dedi. (Ka'b b. Eşref de): \"Siz ondan daha çok bıkkınlık getireceksiniz.\" karşılığını verdi. (Muhammed b. Mesleme de) \"Biz o'na (bir defa) uy(muş bulun)duk. İşinin sonu nereye varacağını görünceye kadar, onu bırakmayı uygun görmüyoruz.\" Ve biz (senden) bize ödünç olarak bir vesk veya iki vesk (hurma) vermeni rica ediyoruz.\" dedi. Ka'b da: \"Bana (bu borç karşılığında) rehin olarak ne vereceksin?\" dedi. (Muhammed b. Mesleme) \"Sen bizden (rehin olarak) ne istiyorsun?\" diye sordu. (Ka'b): \"Kadınlarınızı\" (istiyorum) dedi (Muhammed b. Mesleme ile yanındakiler): \"Sübhanallah sen Arab'ın en yakışıklısısın. (Böyleyken) biz sana kadınlarımızı (nasıl) rehin olarak vereceğiz (öyle mi?). Bu bizim için bir utanç (kaynağı) olur.\" dediler, (o da öyleyse), ''Çocuklarınızı rehin verirsiniz.\" dedi (Muhammed b. Mesleme ile arkadaşları ise) \"Sübhanallah! Birimizin oğluna (birgün) sövülür de (kendisine bu) bir vesk -veya İki vesk (hurma) karşılığında rehin verildi, denir. Biz sana zırhı yani silahı rehin olarak verelim.\" dediler, (o da): \"Olur\" dedi. (Muhammed b. Mesleme geceleyin Ka'b'ın) yanına gelince o'na seslendi, O da güzel kokular sürünmüş bir halde başı(ndan kokular) saçarak, karşısına çıktı. (Muhammed b. Mesleme) üç veya dört kişiyle birlikte gelip, (Ka'b'ın) yanına oturunca ona (burunlarına gelmekte olan güzel bir kokudan) bahsetmeye başladılar. O da \"Benim yanımda (nikahlım olarak) falanca kadın vardır. O, halk'ın en güzel kokulu kadınıdır.\" dedi. (Muhammed b. Mesleme) \"Bana izin verir misin (başındaki bu kokuyu) koklayayım?\" dedi (Ka'b da): \"Evet !\" (izin veririm) dedi. Bunun üzerine (ibn Mesleme) elini (Ka'b'ın) başın(daki saçlarının arasın)a soktu ve (eline bulaşan kokuyu) kokladı. (Sonra Ka'b'a bu hareketini) \"Tekrar edeyim mi?\" diye sordu o da da \"Evet\" dedi. Bunun üzerine (İbn Mesleme tekrar) elini onun başın (daki saçların arasın)a soktu Ka'b (o'na) bu imkanı verince (îbn Mesleme) \"Haydin!\" (vurun!) diye bağırdı, onlar da hemen ona vurdular, nihayet onu öldürdüler",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 292
			}
		}
	]
}