{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"15": "Jihad (Kitab Al-Jihad)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2775,
			"arabicnumber": 2775,
			"text": "(Amir b. Sa'd'ın) babasından demiştir ki: Rasûlullah (S.A.V.)'le birlikte Medine'ye gitmek üzere Mekke'den (yol'a) çıktık. Azver'e yaklaştığıız zaman (hayvanından) indi, sonra ellerini kaldırıp Allah'a bir süre dua etti, sonra secde'ye kapandı, uzun bir süre (secdede) kaldı, sonra kalktı, ellerini kaldırıp bir süre daha Allah'a dua etti(kten), sonra (tekrar) secde'ye varıp uzun süre (secdede) kaldı. Sonra (tekrar) secdeden kalktı, ellerini kaldırıp bir süre Allah'a dua ettikten sonra (yine) secdeye vardı. (Bu hadisi Musannif Ebu Davud'a nakleden) Ahmed İbn Salih Rasûlullah, ellerini kaldırıp bir süre Allah'a dua etti. Sonra secde'ye vardı, anlamındaki) cümleyi üç defa zikretti ve sonra rivayetine şöyle devam etti: Rasûlü Ekrem bu duaları ve secdeleri bitirdikten sonra) buyurdu ki: \"Ben Rabbimden (rahmet) diledim ve ümmetim (in günahlarının affolması, derecelerinin yükselmesi) için, şefaat'te bulundum da bana ümmetimin üçte birini bağışladı. Bunun üzerine Rabbim'e bir şükür olmak üzere secdeye vardım. Sonra başımı kaldırıp ümmetim için (tekrar) Rabbimden dilekte bulundum. Bana üçte birini (daha) bağışladı. Bunun üzerine Rabbime şükür olmak üzere (ikinci defa) secde'ye vardım. Sonra başımı kaldırıp ümmetim için Rabbim'den (üçüncü defa olmak üzere bir) dilekte (daha) bulundum. Bunun üzerine bana (ümmetimin) son üçtebirini bağışladı. Rabbim'e şükür olmak üzere (üçüncü kez) secde'ye vardım.\" Ebû Dâvûd der ki: (Şeyhim) Ahmed b. Salih bu hadisi bize naklederken (bu hadisin sened zincirinde bulunan) Eş'âs b. İshâk'ı (zincirden) düşürmüştür, (Fakat) bu hadisi bana Ahmed b. Salih'ten, Musa b. Sehl er-Remli'de rivayet etti.) Onun rivayet senedinde ise, Eş'as b. İshak zikredilmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 299
			}
		}
	]
}