{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"17": "Game (Kitab Al-Said)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2857,
			"arabicnumber": 2857,
			"text": "Amr b. Şuayb'ın dedesinden (rivâyet olunduğuna göre) Ebû Sa'lebe denilen bir arap (Hazret-i Peygamber'in huzuruna gelerek...) Allah'ın Rasûlü! Benim eğitilmiş bir köpeğin var, bunun avladığı av hakkında bana fetva ver(ir misin?) demiş. Resûlüllah (sallallahü aleyhi ve sellem) de: Eğer senin eğitilmiş köpeklerin varsa onların senin için yakaladıkları avı yiyebilirsin.\" buyurmuş (bunun üzerine adam): avı diri olarak ele geçirince) keserek, yahut da (ölü olarak ele geçirince) kesilmeden yiyebilir miyim? demiş (Hazret-i Peygamber de:) cevabını vermiş. (Sonra adam): o avın bir tarafını yese de mi? demiş. (Resûl-i Ekrem Efendimiz de:) o avın bir tarafım yemiş olsa da, (yiyebilirsin), buyurmuş. (Daha sonra O arap): Allah'ın Resulü, bana (kendisiyle avcılık yaptığım) yayım hakkında fetva ver, demiş. Peygamber de:) avladığın avı yiyebilirsin, buyurmuş. (Adam:) elime diri olarak geçerse) \" kesilmiş olarak\" yahutta (ölü olarak geçerse) \" kesilmeden (yiyebilir miyim) demiş. Peygamber de) Evet, cevabını vermiş. (Bu defa adam): Allah'ın Rasûlü (bu av) gözümden (bir süre) kaybolmuşsa da (yiyebilir) mi (yim?) demiş. Ekrem Efendimiz de): Evet (hayvanın) bozulup kokuşmaması ve üzerinde senin okundan başka bir ok yarası bulunmamış olması şartıyla sen(in gözün) den (bir süre) kaybolmuş da olsa (yine onun etini yiyebilirsin), buyurmuş. (Daha sonra adam): Allah'ın Rasûlü! Bir de \" bana kendilerine kaçınılmaz şekilde muhtaç olduğumuz yahudi kapları hakkında, fetva versen\" demiş. (Rasûl-i Ekrem Efendimiz de) yıkar ve içlerinde yemek yersin, buyurmuş. zebaih 4, 10, 14; Müslim, sayd 8; Tirmizî, sayd 1, siyer 11; İbn-i Mâce, sayd 3; Nesâî, sayd 16; Darimî, siyer 56; Ahmed b. Hanbel, 11-184, IV-193, 195",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Munqar"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Munqar"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 14
			}
		}
	]
}