{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"1": "Purification (Kitab Al-Taharah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 293,
			"arabicnumber": 293,
			"text": "Resûlüllah'ın hanımı, Âişe (radıyallahü anhâ)'dan, demiştir ki; baldızı, Abdurrahman b. Avf’ın hanımı Ümmü Habibe bint Cahş yedi sene istihaza oldu ve bu hususta Resûlüllah (sallallahü aleyhi ve sellem)’den fetva istedi. Resûlüllah (sallallahü aleyhi ve sellem): Bu hayz değil, bir damar (kanı)dır. Yıkan ve namazını kıl\" buyurdu. kız kardeşi Zeyneb bint Cahş'ın hücresinde bir leğende yıkanır, kanın kırmızılığı suyun yüzüne çıkardı. 285. hadisin kaynaklan. Şihâb demiştir ki: Amre bint Abdirrahman bana Ümmü Habîbe'den bu (bir önceki) hadisi haber verdi. Âişe (radıyallahü anhâ): (Ümmü Habibe) her namaz için guslederdi dedi.\" b. Sa'd, İbn Şihâb'dan o da Urve tarikiyle Âişe (radıyallahü anhâ)’dan bu hadisi rivâyet edip \" O (Ümmü Habibe) her namaz için yıkanırdı\" dedi. Dâvûd, bu hadisi Kasım b. Mebrûr'un Yûnus'tan, onun İbn Şihâb'tan Onun Amre'den, Amre'nin de Âişe kanalıyla Ümmü Habibe bint Cahş'tan rivâyet ettiğini söyledi. şekilde Ma'mer, Zührî'den; o da Amre Tarikiyle Âişe'den rivâyet etmiştir. Bazan Ma'mer, Amre vasıtasıyla Ümmü Habibe'den hadisi (mu’an’an olarak) bu manada rivâyet etti. aynı şekilde İbrahim b. Sa'd ve İbn Uyeyne Zührî'den, o Amre'den Amre de Âişe'den rivâyet etmiştir. İbn Uyeyne, hadisinde Resûlüllah (sallallahü aleyhi ve sellem)’in ona (Ümmü Habibe'ye) yıkanmasını emrettiğini söylememiştir. Evzaî de aynı şekilde Âişe (radıyallahü anhâ)’nın \" her namaz için yıkanırdı\" dediğini rivâyet etmiştir. (radıyallahü anhâ)'dan, demiştir ki; Ümmü Habibe yedi sene istihaza oldu. Resûlüllah (sallallahü aleyhi ve sellem) kendisine yıkanmasını emretti. Bunun üzerine Ümmü Habibe her namaz için yıkanırdı.\" hayz 26; Müslim, hayz 64; Nesâî, tahâre 133, 134; İbn Mâce, tahâre, 116-Dârimî, vudu 80, 84, 96; Ahmed b. Hanbel, VI, 83, 119, 128, 187, 237. (radıyallahü anhâ) şöyle demiştir: Ümmü Habibe bint Cahş Resûlüllah (sallallahü aleyhi ve sellem) zamanında istihaza oldu. Resûlüllah kendisine her namaz için yıkanmasını emretti.\" İshâk bunu söyledikten) sonra (babın başında zikredilen Ümmü Habîbe) hadisi(ni) nakletti. Dâvûd buyurdu ki: hadisi Ebû'i-Velîd et-Tayâlisî -ancak ben bunu kendisinden işitmedim- Süleyman b. Kesîr'den, o Zührî tankıyla Urve'den, o da, Hazret-i Âişe'den şöyle dediğini rivâyet etmiştir: bint Cahş istihaza oldu. Resûlüllah (sallallahü aleyhi ve sellem) ona: Her namaz için guslet\" buyurdu. (Süleyman b. Kesir bunları zikrettikten sonra babın başındaki) hadisi ilâve etti. bu rivâyeti almasının maksadı, İbn Ishâk'ın rivâyetini takviyedir. Dâvûd buyurdu ki; hadisi Abdüs Samed Süleyman b. Kesîr'den \" Her namaz için abdest al\" dedi şeklinde rivâyet etti. Fakat bu Abdussamed'in vehmidir. Doğrusu Ebû'l-Velîd'irı dediğidir. Seleme (radıyallahü anh) şöyle demiştir: Zeyneb bint Ebî Seleme bana haber verdi ki; Abdurrahman b. Avf'in nikâhı altında bulunan hanımından devamlı kan geliyordu. kadın Ümmü Habîbe bint Cahş'tır. Resûlüllah ona her namaz vaktinde yıkanmasını ve namazını kılmasını emretti.\" b. Ebi Kesir der ki: Ebû Seleme bana) haber verdi ki: Ümmü Bekr Âişe'nin şöyle dediğini söyledi: Resûlüllah (sallallahü aleyhi ve sellem) temizlendikten (hayzı bittikten) sonra kendisini şüpheye düşüren bir şey (kan) gören kadın hakkında: Bu ancak bir damar (kanı)dır.\" buyurmuştur.\" birisi zamirin müzekker olarak mi, yoksa müennes olarak mı olduğunda ve mı yoksa mu olduğunda şüphe etmişlerdir. Bekr'in rivâyetini sadece İbn Mâce tahric etmiştir. Dâvûd der ki: geldiğinde namazı terk eder, babındaki) İbn Akıl hadisinde; her iki emri (işi) birlikte zikrederek Kasım’in (aşağıda) dediği gibi \" Eğer gücün yeterse her namaz için yıkan, aksi takdirde cem’et\" demiştir. söz (gücü yeterse her namaz için gusletmesi aksi halde cem’etmesi), Said b. Cubeyr tarafından, Hazret-i Ali ve İbn Abbâs (radıyallahü anhümâ)’dan rivâyet edilmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 293
			}
		}
	]
}