{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"20": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2963,
			"arabicnumber": 2963,
			"text": "Malik b. Evs. b. el-Hadesan'dan demiştir ki: Ömer (b. el-Hattab birgün) güneşin yükseldiği bir sırada bana (bir haber) gönderdi. Bunun Üzerine yanına vardım ve kendisini (mindersiz olarak) doğrudan doğruya bir karyolanın ağaç kısmı üzerine oturmuş halde buldum. Yanma girince bana; \"Ey Malik (senin) kavminden bir kaç aile koşarak geldi. Ben de onlara (ganimet mallarından) bir şeyler verilmesini emrettim, (bu atiyyeleri) onlara sen bölüştürüver\" dedi. Ben de: “Bunu sen başka birisine emretsen\" (daha iyi olurdu) dedim. O sırada (Hz. Ömer'in hizmetçisi) Yerfa' (çıkıp) geldi ve Ey mu'minler'in emiri Osman b. Afvân'la Abdurrahman b. Avf. Zübeyr b. el-Awam ve Sa'd b. Ebî Vakkas'ın yanınıza girmelerine izin verir misiniz? dedi. (Hz. Ömer de); \"Evet\" cevabını verdi, (ve yanına girmeleri için) onlara izin verdi (onlarda) girdiler. Sonra Yerfa' (tekrar) geldi ve; Ey Mu'minlerin emiri yanına Abbas ile Ali'nin girmelerine de izin verirmisin? dedi. (o da); . \"Evet\" dedi (ve yanına girmeleri için) onlara da izin verdi, (onlar da) girdiler. Biraz sonra Hz. Abbâs (söz aldı ve); \"Ey mu'minlerin emiri benimle şu Ali arasında bir hüküm ver\" dedi. Orada bulunanlardan biri de; \"Evet ey mu'minlerin emiri onlar arasında bir hüküm ver ve ikisine de merhametli ol\" dedi. Malik b. Evs (sözlerine devamla şöyle) dedi: Bana öyle geldi ki (Hz. Abbas'la Ali, Hz. Osman'la Hz. Abdurrahman, ez-Zübeyr ve Sa'd'den oluşan) bu Cemaati bir iş için (şefaatçi olmaları gayesiyle) önden göndermişlerdi. Hz. Ömer de acele etmeyin dedi. Sonra o topluluğa dönüp; \"Göğün ve yerin izniyle durduğu Allah aşkına size soruyorum Rasûlullah (S.A.V.)'in - Biz miras bırakmayız, bizim bıraktığımız sadakadır- buyurduğunu biliyor musunuz?\" dedi. (onlar da); \"Evet\" dediler. Sonra Hz. Ali ile Abbas'a dönüp \"Göğün ve yerin izniyle durduğu Allah aşkına (söyleyiniz) siz, Rasûlullah (S.A.V.)'in - Biz miras bırakmayız. Bizim (arkamızda) bıraktığımız (mal) sadakadır- buyurduğunu biliyor musunuz?\" dedi (onlar da); \"Evet\" cevabını verdiler. (Bunun üzerine Hz. Ömer şöyle) dedi. \"Şüphesiz ki Allah Rasûlünü hiç bir kimseye vermediği bir özellikle tahsis etti de (Kur'ân-ı Kerîm'inde şöyle) buyurdu: \"Allah'ın onlardan Nebiine verdiği ganimetlere gelince söz (onu elde etmek için) onun üzerine ne at ne de deve sürdünüz fakat Allah Nebilerini dilediği kimselerin üzerine salar (onlara üstün getirir) Allah her şey'e kadirdir.\"[Haşr 6] Allah Nadiroğullarını (mallarını) Rasûlüne fey olarak verdi. Allah'a yemin olsun ki: (Hz. Nebi) bu mallar(ın paylaştırılmasın)da (kendini) size (asla) tercih etmedi. Kendisi onları alıp ta size vermezlik te etmedi. Rasûlullah (S.A.V.) (Nadir-oğullarından fey olarak ele geçen) bu mallardan bir senelik nafaka -yahut nafakasını, yada ailesinin bir senelik nafakasını- alırdı. (Bu ifadedeki tereddüt raviye aittir.) Kalanı da (hazinedeki) mallar arasına koyardı. Sonra (Hz. Ömer) bu cemate yönelip: \"Göğün ve yerin izniyle durduğu Allah aşkına size soruyorum. Bunu biliyor musunuz?\" dedi. (Onlar da): \"Evet\" dediler. Sonra Hz. Abbas ile Ali (r.a.)'e yönelip: \"Göğün ve yerin kendi izniyle durduğu Allah aşkına size soruyorum bunu biliyor musunuz?\" dedi. (Onlar da): \"Evet\" cevabını verdiler, (sonra Hz. Ömer konuşmasına şöyle devam etti.) \"Rasûlullah (S.A.V.) vefat edince Ebû Bekir (r.a.): \"Ben Rasûlullah'm halifesiyim dedi. (Hz. Ömer konuşmasına şöyle devam etti.) Bunun üzerine sen (ey Abbas) şu (karşımda duran) Ali ile birlikte Ebû Bekir'e varıp kardeşinin oğlundan (yani Hz. Nebi'den hissene düşecek olan) mirasını istedin. Bu da karısı (Fatıma)'nın mirasını babası (Hz. Muhammed'in malı)ndan istiyordu. Hz. Ebû Bekir (r.a) de size (şöyle) cevap verdi: \"Rasûlullah (S.A.V.); \"Biz miras bırakmayız. Bizim bıraktığımız sadakadır.\" buyurdu. Allah bilir ya Ebû Bekir doğru sözlüdür. Allah'ın emirlerine hakkıyla uyucudur. Doğru yoldadır ve hakka tabidir. (Bu yüzden de) Hz. Nebi'den kalan bu mallar(ın idaresi) Ebû Bekr'e verildi. Ebû Bekir vefat edince de ben; \"Rasûlullah (S.A.V.)'in ve Ebû Bekir'in halifesi benim\" dedim ve Allah'ın mütevelli olmamı dilediği an'a kadar bu mallara mütevelli oldu. Derken sen ve şu (Ali) ikinizin de işi bir olduğu halde beraberce (karşıma) gelip benden bu malları istediniz. Ben de (size) eğer bu malları size vermemi istiyorsanız O malları Rasûlullah (S.A.V.)'in sarf ettiği yerlere sarf edeceğinize dair Allah'a söz vermeniz şartıyla (onları size verebilirim) dedim. Bu şartlar altında bu malı benden aldınız. Sonra aranızda bunun dışında bir hüküm vermem için (kalkıp tekrar) bana geldiniz. Allah'a yemin olsun ki: Kıyamet kopuncaya kadar aranızda bundan başka bir hüküm vermem, eğer bu şartlar(ı yerine getirmekken aciz kalırsanız. Onları bana geri veriniz. Ebû Dâvud der ki: (Hz. Abbas'la Hz. Ali, Hz. Ömer'den) O malları ikisi arasında yarıya bölmesini (ve idare ve tasarruf hakkının kendilerine verilmesini) istediler. Yoksa onlar Nebi (s.a.v.j'in \"biz miras bırakmayız* Bizim bıraktığımız sadakadır,\" dediğini bilmiyor değillerdi. Onlar doğru olandan başka bir şey istemiyorlardı. Nitekim Hz. Ömerde \"Ben bu mal'a taksim ismini koydurmam onu olduğu gibi bırakırım** (demek suretiyle bu duruma işaret etmiştir)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 36
			}
		}
	]
}