{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"20": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2984,
			"arabicnumber": 2984,
			"text": "Abdurrahman'dan demiştir ki: Ali (r.a)'ı (şöyle) derken işittim. “Ben, Abbas, Fatıma ve Zeyd b. Hariseyle Hz. Nebi (S.A.V.)'in yanında bir araya gelmiştik. (Hz. Nebi'ye hitaben): \"Ey Allah'ın Rasûlü, Aziz ve Celil olan Allah'ın kitabında (ganimet mallarından ayrılıp dağıtılmasını emrettiği) humus'tan (bize düşecek olan) hakkımızı (pay sahiplerine dağıtma görevini) bana versende (ileride) senden sonra her hangi bir kimsenin bu mevzuda benimle anlaşmazlığa düşmemesi için senin sağlığında bu geliri (hak sahiplerine) ben dağıtsam (çok isabetli olur, uygun buluyorsan bunu) yap\" dedim. (Rasül-i Ekrem Efendimiz de) bunu yaptı. Ve (humus gelirlerindeki Hz. Nebi'nin yakınlarına ait) bu hakkı, Rasûlullah (s.a.v.)'in sağlığında (hak sahiplerine) ben dağıttım. Sonra Hz. Ebû Bekir de bu görevi bana verdi. Nihayet Hz. Ömer'in (halifelik) yıllarının son yılına kadar (bu görevi yürüttüm fakat Hz. Ömer'in halifeliğinin son yılında bu görevi bıraktım) Çünkü (o sene) O'na (ganimetlerden) bir çok mal geldi. O'da bizim hakkımızı ayırdı. Sonra bana (bir haber) gönder(erek varıp onu hak sahiplerine bölüştürmemi iste)di. Ben de: \"Bizim bu sene ona ihtiyacımız yoktur, (fakat Hz. Nebi'nin yakınları olan bizlerin dışındaki) müslümanların ona ihtiyacı vardır. Sen bunu onlara ver!\" cevabını verdim. O da (bizim hissemize düşecek olan) bu malı fakir müslümanlara verdi. Hz. Ömer'den sonra kimse bana bunu teklif etmedi. Hz. Ömer'in yanından çıktıktan sonra Hz. Abbas'la karşılaş(mış)tımda (Bana) \"Ey Ali. Bu gün sen bizi (büyük bir) gelirden mahrum ettin, bir daha bu mal ebediyyen bize verilmez. \" de(miş)di. (Gerçekten Abbas) çok zeki bir adamdı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 57
			}
		}
	]
}