{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"1": "Purification (Kitab Al-Taharah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 300,
			"arabicnumber": 300,
			"text": "Mesruk'un hanımı rivayet eti, Hz. Aişe validemizden, o da, Resulullah (Sallallahu aleyhi ve Sellem)'den aynen önceki hadisin benzerini rivayet etmiştir. Ebu Davud bu rivayetler hakkında şöyle demektedir: Adiy bin Sabit'in bu hadisi A'meş'in Habib'den rivayet ettiği hadis ve Eyyub Ebu'l-Ala'nın (Hz. Aişe'den mevkuf ve merfu olarak rivayet ettiği) hadislerin hepsi zayıftır, sahih değildir. A'meş'in Habib'den rivayet ettiği hadisin zayıflığına bu (evvelki) hadis delildir. Hafs bin Ğiyas bunu A'meş'den mevkuf olarak rivayet ederek Habib'in hadisinin merfu olduğunu redDetmiştir. Aynı şekilde Esbat, A'meş'ten; o da mevkuf olarak Hz. Aişe'den rivayet etmiştir. Ebu Davud devamla, İbn Davud bu hadisin baş tarafını merfu olarak rivayet etmiş ve onda, her namazda abdest alma (nın gerekli) olduğunu (bildiren ifadenin mevcudiyetini) red etmiştir. Zuhri'nin Urve'den; onun da Hz. Aişe'den rivayet ettiği müstehaza hadisinde \"Her namaz için guslederdi\" demesi Habib'in bu hadisinin Zaafına delildir. Ebu'l-Yekzan Adiy bin Sabit'ten; o da, babası tarikiyle Ali (r.a.), Beni Haşim'in azatlısı Ammar; İbn Abbas'tan, Abdülmelik bin Meysere, Beyan, Muğire, Firas, ve Mücahid de Şabi'den; o da Kamir vasıtasıyla Hz. Aişe'den \"her namaz için abdest alır'' şeklinde rivayet etmişlerdir. Davud ve Asim'tn Şa'bi'den; onun da Kamir vasıtasıyla Aişe'den rivayeti \"müstehaza her gün bir defa yıkatıp\" şeklindedir. Hişam b. Urve de babasından \"müstehaza her namaz için abdest ahr\" diye rivayet etmiştir. Kamir ve Beni Haşim'in azatlısı Ammar ile Hişam bin Urve'nin babasından rivayet ettiği hadislerin dışındaki bütün bu hadisler zayıftır, ibn Abbas'tan bilinen (her namaz için abdest değil), ğusüldür",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 300
			}
		}
	]
}