{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"20": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3022,
			"arabicnumber": 3022,
			"text": "İbn-i Abbas'dan demiştir ki: Rasûlullah (s.a.v.) (ordusuyla beraber gecelemek üzere) Mehrizzahran (denilen yer) e inince, (kendi kendine) -Allah'a yemin olsun ki: Eğer Rasûlullah (s.a.v.) Mekkeli'ler kendisine gelip de emân istemelerinden önce Mekke'ye zorla girecek olursa, bu Kureyş'in helaki (olur)- dedim, Rasûlullah (s.a.v.)'ın katırı­nın üzerine oturdum ve (yine kendi kendine) \"Herhalde Mekke'ye giden (ve yolu buradan geçen) iş-güç sahibi birini bulurum da (Mekke'ye varınca) (Kureyşlilerin) Hz. Nebi (in karşısın)a çıkmaları ve ondan emân istemeleri için Rasûlullah (s.a.v.)'in (şu) durumunu onlara haber verir\" dedim. (Bu maksatla) yürüyordum ki birden bire Ebû Süfyan'la Budeyl b. Verka'nın ses(ler)ini işittim, ve “Ey Ebû'l-Hanzala ! diye seslendim. Sesimi hemen tanıdı ve: “Ebu'l-Fadl'mısın?\" dedi. \"Evet!\" cevabını verdim. \"Anam, babam sana feda olsun! Bu ne hal böyle?\" dedi (bende): “Bu, Rasûlullah (s.a.v.) ve (şu askerlerde ona tabi olan) insanlardır.\" dedim. (Bunların hücumundan kurtulmak için) \"Çâre ne nedir?\" diye sordu ve arkama bindi. Arkadaşı (ise Mekke'ye) dönüp gitti. Sabah olunca o'nu Rasûlullah (s.a.v.)'in huzuruna götürdüm. (Orada) müslüman oldu. (Ben de): \"Ey Allah'ın Rasûlu muhakkak ki Ebû Süfyân şu (dünyalık) övünmeyi seven bir kişidir. O'na da (övünebileceği) birşey ver!\" dedim. (Hz. Peygamber de): \"Evet Ebû Süfyân'ın evine giren emniyettedir, (kendi) Evini (n kapısını kendi) üzerine kapayan kimse de emniyettedir. Mescid'e giren emniyettedir\" buyurdu. Halk evlerine ve mescid'e (girmek üzere dağıldılar)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 95
			}
		}
	]
}