{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"20": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3055,
			"arabicnumber": 3055,
			"text": "Abdullah el-Hevzenî dedi ki: Rasûlüllah (s.a.v.)'in müezzini Bilal'Ie Haleb'de karşılaştım da \"Ey Bilal! Rasûlullah (s.a.v.)'in geçimi nasıldı bana anlat\" dedim. (Şöyle) cevab verdi: \"Yüce Allah'ın onu (Nebi olarak) gönderdiği günden beri nesi varsa, onları kendisi hesabına harcama yetkisi bana aitti. (Bu yetki bende) Rasûlullah (s.a.v.)'in vefatına kadar (devam etti) Kendisine bir müslüman gelirde o'nu(n) çıplak (olduğunu) görürse -git borç para bulda (onunla) şu adam'a bir elbise alıp giydir ve kendisini doyur- diye bana emir verirdi. Hatta (bir defasında) müşriklerden biri karşıma gelip \"Ey Bilal benim imkanım vardır. Benden başka kimse'den borç isteme\" dedi. Bende (öyle) yaptım (yine) bir gün abdest almış namaz için ezan okumak üzere kalkmıştım. Bir de baktım ki, o müşrik tacirlerden oluşan bir cemaat içersinde (bana doğru) yönelmiş (geliyor) Beni görünce: \"Ey Habeş'li\" diye seslendi. Ben de \"Buyurun!\" diye cevap verdim. Beni asık bir suratla karşıladı ve bana ağır bir söz sarfedip \"Seninle ay(ın sonu) arasında kaç (gün) kaldı biliyor musun?\" dedi Bende: (Ayın sonu): \"Yakındır\" dedim. \"Seninle onun arasında dört (gün) var. (Ayın sonu gelince seni) üzerindeki borca karşılık yakalayıp (köle olarak) göndereceğim. Daha önceki gibi yine davar güdeceksin insanların içini kaplayan (üzüntü o anda benim de) içimi kapladı. Nihayet yatsı namazını kıldım, Rasûlullah (s.a.v.) ailesinin yanına döndü. Yanına (girmek için) izin istedim, izin verdi. (Yanına girince): \"Ey Allah'ın Rasûlü anam ve babam sana feda olsun, kendisinden borç almış olduğum bir müşrik bana şöyle şöyle söyledi. Bunu benim hesabıma ödeyecek senin yanında da benim yanımda da bir mal yok. bu işse benim kepaze bir duruma düşmem demektir. Binaenaleyh Allah'ın, Rasûlüne (s.a.v.) benim borcumu ödeyecek (kadar) bir mal ihsan etmesine kadar şu müslüman olmuş kabilelerden birine kaçmama izin ver!\" dedim. Ve (yanından) çıktım. Nihayet evime geldim. Kılıcımı, (kılıcımla kınını içerisine koyduğum) torbamı, ayakkabılarımı ve kalkan»mi (alıp ertesi gün çıkacağım yolculukta yanımda götürmek üzere) yanıbaşıma koydum. Nihayet (fecr-i sadık denilen) ilk sabah'ın dikey (aydınlığı) doğunca artık yola çıkmaya karar vermiştim. Bir de baktım ki: Bir adam “Ey Bilal! Rasûlullah (s.a.v.) seni çağırıyor\" diye (bana doğru) koşuor. Bunun üzerine yola düşüp Rasûlullah (s.a.v.)'e vardım ve (orada) yükleri üzerinde çöktürülmüş, dört deve gördüm. (Konuşmak için) izin istedim, Rasûlullah (s.a.v.): \"Müjde yüce Allah sana borcunu ödeyecek imkânı gönderdi\" dedi. sonra \"çöktürülmüş dört deveyi görmedin mi?\" dedi. Bende: \"Evet\" cevabını verdim. Bunun üzerine \"Onların da, üzerlerindekilerde senindir. Üzerlerinde giyecek ve yiyecek var. Onları bana Fedek başkanı hediye etti. (Şimdi) onları al ve borcunu öde!\" buyurdu. Bende öyle yaptım. (Hz. Bilal sözlerine devam ederek) hadisi(n geri kalan kısmını şöyle) anlattı. (Bir süre) \"sonra mescid'e gittim. Birde baktım Rasûlullah (s.a.v.) mescidde oturuyor. Kendisine selam verdim: \"Üzerindeki (borç) ne oldu?\" dedi \"Yüce Allah, Rasûlullah (s.a.v.)'in üzerinde bulunan herşeyi ödedi, (ödenmedik) bir şey kalmadı\" cevabını verdim. (Gelen mallardan borç ödendikten sonra) \"Bir şey arttı mı?\" diye sordu. \"Evet\" dedim. \"Beni on(u elimizde tutmanın sıkıntısın)dan kurtarmaya bak. Çünkü sen beni bundan kurtarıncaya kadar aile halkımdan hiçbirinin yanına giremem\" buyurdu. Rasûlullah (s.a.v.) yatsı namazını kılınca beni çağırdı ve: \"Yanındaki mal ne oldu?\" diye sordu. Ben de \"O, (hala) yanımdadır. Çünkü yanıma o'nu kendisine verebileceğim ihtiyaç sahibi) bir kimse gelmedi\" dedim. Rasûlullah (s.a.v.)de geceyi mescidde geçirdi. \"Evine gitmedi\" Hz. Bilal sözlerine devam ederek) hadisi(n kalan kısmını şöyle) anlattı. Ertesi gün yatsı namazını kılınca beni (yine) çağırdı \"Yanındaki mal ne oldu?\" diye sordu. Ben de: “Ey Allah'ın Rasûlü Allah seni on(un sıkıntısın)dan kurtardı.' dedini. Bunun üzerine bu mal yanında iken kendisine ölümün yetişmesi korkusundan (kurtulmasından) dolayı \"Allahu ekber Elhamdu­lillah!\" dedi. Sonra (oradan uzaklaştı) Bende kendisini takibe koyuldum. Nihayet hanımlarının yanına varıp her birine ayrı ayrı selam verdi ve yatağına vardı. İşte senin (benden) sorduğun (Rasûl-i Ekrem'in nafakası) bundan ibarettir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 128
			}
		}
	]
}