{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"20": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3067,
			"arabicnumber": 3067,
			"text": "Sahr’den (rivâyet olunduğuna göre) Resûlüllah (sallallahü aleyhi ve sellem) savaş için Sakıf (kabilesi) üzerine yürümüş, Sahr (radıyallahü anh) bunu işitince, Peygamber (sallallahü aleyhi ve sellem)'e yardım etmek için atına bin(ip bir süvari topluluğu ile birlikte yola çık)mıştı (fakat) Peygamber (sallallahü aleyhi ve sellem)'in (Taifî) fethedemeden dönüp gitmiş olduğunu gördü ve o gün (Sakif lılar) Resûlüllah (sallallahü aleyhi ve sellem)’in hükmüne boyun eğmedikçe (onların sığındıkları) şu şatodan ayrılmayacağına dair Allah'a söz verdi. Gerçekten de Hazret-i Sahr, Onlar, Resûlüllah (sallallahü aleyhi ve sellem)’in hükmünü kabul edinceye kadar onlarla savaşı bırakmadı. (Onlar Hazret-i Peygamberin hükmünü kabule yanaşınca) Hazret-i Sahr Peygamber (sallallahü aleyhi ve sellem)’e (şöyle bir) mektup yazdı. Gelelim mevzuya, Ey Allah'ın Rasûlü Sakif (kabilesi) senin hükmünü kabul etti. Şimdi ben onların karşısında bulunuyorum onlarda at üzerinde\" (karşımda duruyorlar) (sallallahü aleyhi ve sellem) (mektubu alır almaz) namazın cemaatle kılınmasını emretti ve (cemaat namaz için toplanınca Hazret-i Sahr'in bu) kahraman (kabilesi) için \" Ey Allah'ım bu kavmin atlısına, yayasına bereket ihsan eyle!'' diye on (defa) dua etti. (Bir süre sonra) Sakif kabilesi Hazret-i Peygamberin huzuruna geldi. (İçlerinden) El-Muğire b. Şu'be sözaidi ve Ey Allah'ın Rasûlü Sahr, halamı esir aldı. Oysa müslümanlann girdiği dine halam da girmişti.\" dedi. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem) Sahr'ı çağırıp O'na Ey Sahr? Bir kavim müslümanlığa girdiği zaman kanlarını ve mallarını güvence altına almış olurlar. Binaenaleyh sen Muğıre'ye halasını geri ver\" buyurdu. Sahr'da (halasını) ona iade etti. Ve (söz alıp) Peygamber (sallallahü aleyhi ve sellem)’den Süleym oğullarının İslâm'dan kaçarken bırakıp gittikleri suyu istedi: Ey Allah'ın Peygamberi bu suyu benim ve kavmimin hürmetine ver!\" dedi (Hazret-i Peygamber de) \" Evet\" (bu suyu size veriyorum) dedi ve (suyu) onlara verdi. Bunun üzerine Sûleym kabilesi de müslüman olup Hazret-i Şahr'ın yanına geldiler ve ondan suyu kendilerine geri vermesini istediler. (Sahr, bu suyu kendilerine vermekten) kaçınınca Peygamber (sallallahü aleyhi ve sellem)'e varıp: Ey Allah'ın Peygamberi müslüman olduk ve suyumuzu bize geri vermesi için Sahr'a vardık (fakat o buna) yanaşmadı.\" diye şikâyette bulundular. (Hazret-i Peygamber de) Sahr'ı çağırıp Ey Sahr! Bir kavim müslümanlığı kabul ettiği zaman, mallarını ve kanlarını güvence altına almış olurlar. Binaenaleyh sen bu kavme sularını geri ver\" buyurdu. (Sahr da) Başüstüne Ey Allah'ın Peygamberi\" karşılığını verdi. (bu sırada) Resûlüllah (sallallahü aleyhi ve sellem)'in Hazret-i Sahr'dan Cariyeyi ve suyu geri almadan (duyduğu) utançtan dolayı yüzünün kızardığını gördüm",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 140
			}
		}
	]
}