{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"21": "Funerals (Kitab Al-Jana'iz)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3089,
			"arabicnumber": 3089,
			"text": "Amir er-Rami'den demiştir ki: Ben memleketimizde idim. Birdenbire bizim için bayrakların ve sancakların dikilmiş olduğunu gördüm (ve) \"Bu da nedir?\" dedim. \"Bu Rasulullah Sallallahu Aleyhi ve Sellem'in sancağıdır\" dediler. Bunun üzerine (Rasulullah'in) yanına vardım. Bir ağacın altında kendisi için serilen bir elbisenin üzerinde oturuyordu. Sahabileri etrafına toplanmışlardı. Ben de onlar (in arasın)a oturdum. Rasulullah (s.a.v.) hastalıklardan bahsediyordu. Bu sırada... \"Bir mu'min’e hastalık isabet eder, sonra Allah bu mü'mini o hastalıktan kurtarırsa o, hastalık, bu mü'minin günahlarına keffaret, ileride (başına) gelecek işler hakkında ona bir öğüt olur. (Fakat) bir münafık hastalanır da sonra iyileşecek olursa, tıpkı sahiblerinin bağlayıp da sonra salıverdiği bir deve gibi olur. Kendisini niçin bağladıklarını da bilmez, niçin saldıklarınıı da bilmez.\" buyurdu. Bunun üzerine orada bulunanlardan bir adam: \"Ey Allah'ın Rasulül (Bu sözünü ettiğin) hastalıklar da nedir? Vallahi ben (hayatta) hiç hastalanmadım\" dedi. Peygamber (s.a.v.) de: “Sen yanımızdan kalk. (git) Çünkü sen bizden değilsin\" (Kamil bir mü'minin özelliği bela ve musibetlere maruz kalmaktır.) dedi. Biz (Hz. Peygamber'in) yanında (böyle sohbet etmekte) iken oraya (elinin) üzerinde elbise olan bir adam çıkageldi. Elinde bir şey (daha) vardı (ve elbise o şeyin) üzerine sarılmıştı. O zat: \"Ey Allah'ın Rasulü: Ben seni görünce (huzuruna gelmek üzere) sana (doğru) yöneldim. (Gelirken) ağaçları sık olan bir yer'e uğradım. Orada (birtakım) kuş yavrusu sesleri işittim. Onları alıp elbisemin içine koydum. Bunun üzerine anneleri gelip başımın üstünde dolaş (maya başla)dı. Ben de onun için elbisemi yavruların üzerinden kaldırdım. Bunun üzerine anneleri yavruların üzerine kondu. Bende hepsini (birden) elbisemin içine sardım. îşte şu yanımdakiler onlardır\" dedi. (Hz. Peygamber de): \"Onları (yere) bırak!\" buyurdu. (Adam da) Onları (yere) bırakıverdi. Anneleri ise (yine) onlardan ayrılmadı. Bunun üzerine Rasulullah (s.a.v.)(orada bulunan) sahabilerine (şu): \"Yavruların annesinin yavrularına olan şefkatine hayret ediyor musunuz?\" diye sordu. (Onlar da): “Evet ya Rasulullah\" cevabını verdiler. (Hz. Peygamber de): “Beni hak (din) ile gönderen Zat'a yemin olsun ki, Allah kullarına yavrularına karşı şefkatini gördüğünüz şu yavruların annesinden daha merhametlidir. Onları geri götür ve anneleri ile birliktelerken kendilerini yakaladığın yere koy.\" (o zat da) onları geri götürdü",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 1
			}
		}
	]
}