{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"21": "Funerals (Kitab Al-Jana'iz)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3111,
			"arabicnumber": 3111,
			"text": "Cabir b. Atik (in Atik b. el-Haris'e) bildirdiğine göre, Rasülullah (s.a.v.) (bir gün) Abdullah b. Sabit'i hasta iken ziyaret'e gelmiş te o'nu baygın bir halde bulmuş, bunun üzerine Rasûlullah o'na seslenmiş (fakat o baygın olduğu için) karşılık ver(e)memiş. Bunun üzerine Rasûlullah (s.a.v.) \"İnnalillahi ve inna ileyhi raciun. Ey Ebu'r-Rabi biz(im) senin yanında (yapabilecek bir şeyimiz yok. Çünkü Allah'ın kaza ve kaderine) mağlub olduk\" dedi. Bunun üzerine kadınlar feryad edip ağlaştılar. ibn Atik de onları susturmaya çalıştı. Derken Rasûlullah (s.a.v.) \"Onları (kendi hallerine) bırak. (Çünkü sesleri fazla çıkmıyor. Fakat vacib olunca) hiçbir kadın ağlamasın\" buyurdu. (Orada bulunanlar) \"Ey Allah'ın Rasûlü vacib olmak nedir?\" dediler. \"Ölmektir\" buyurdu. (O sırada Abdullah b. Sabit'in) kız kardeşi (onun hakkında ey kardeşim): \"Ben senin şehit olacağını ümid ediyordum. Çünkü sen (ahiret için) gereken ihtiyaçlarını hazırlamıştın.\" diye söylenmeye başladı. Rasûlullah (s.a.v.) de \"Aziz ve celil olan Allah o'na niyyeti ölçüsünde şehid sevabı verecektir. (buyurdu ve) siz neyi şehitlik sayıyorsunuz?\" diye sordu. (Onlar da). \"Allah yolunda öldürülmeyi\" dediler. Rasûlullah (s.a.v.)'da \"Allah yolunda öldürülmekten başka yedi (tane daha) şehidlik vardır. Taundan ölen şehiddir. Boğularak ölen şehiddir. Karın ağrısıyla ölen şehiddir. Yanarak ölen şehiddir. Göçük altında kalarak ölen şehiddir. Doğum üzerine ölen şehiddir.\" buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 23
			}
		}
	]
}