{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"21": "Funerals (Kitab Al-Jana'iz)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3185,
			"arabicnumber": 3185,
			"text": "Câbir b. Semure dedi ki: adam hastalanmıştı. Bir süre sonra onun hakkında feryad-ü figan yükselmeye başladı. Bunun üzerine (o hastanın) komşusu, Resûlüllah (sallallahü aleyhi ve sellem)'a gelip: Allah'ın Rasûlü) O (adam) öldü, dedi. (Hazret-i Peygamber de): Ne biliyorsun?\" dedi. (O kimse de); onu (ölmüş halde) gördüm, dedi. Resûlüllah (sallallahü aleyhi ve sellem) de: O kimse ölmedi\" dedi. (Adam da) döndü (gitti). Derken (hastanın evinden tekrar) onun için feryad-ü figanlar yükseldi. Bunun üzerine (hastanın komşusu tekrar) Resûlüllah (sallallahü aleyhi ve sellem)'e geldi ve: Allah'ın Rasûlü o kimse gerçekten öldü, dedi. Peygamber (sallallahü aleyhi ve sellem) de: O ölmedi\" buyurdu. (Adam tekrar) döndü (gitti. Fakat) (evden yine) o kimse için ağlanıp sızlandığı işitilmeye başlandı. O sırada (hastanın) karısı (dışarı çıkıp o adama) (sallallahü aleyhi ve sellem)'e git ve (komşunun intihar ettiğini) kendisine haber ver dedi; (o adam da): Allah'ım, sen ona la'net et! dedi. Sonra (bu) adam gitti ve o kimseyi yanındaki mızrak demiri ile kendisini öldürmüş halde gördü. Ve hemen Peygamber (sallallahü aleyhi ve sellem)'e varıp onun öldüğünü kendisine bildirdi. (Rasûl-ü Zîşan Efendimiz) Ne biliyorsun?\" (dedi) O da: yanındaki mızrak demiriyle kendini öldürmüş halde gördüm, cevabını verdi. (Rasûl-i Zîşan Efendimiz tekrar): Sen onu gördün mü?\" diye sordu (o adam da): cevabını verdi. (Bunun üzerine Peygamber Efendimiz): Öyleyse ben onun namazını kılmam!\" buyurdu. cenâiz 107; Nesaî, cenâiz 68; Tirmizî, cenâiz 69; İbn Mace, cenâiz 31; Ahmed b. Hanbel V- 78, 92, 94, 97",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 97
			}
		}
	]
}