{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"21": "Funerals (Kitab Al-Jana'iz)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3194,
			"arabicnumber": 3194,
			"text": "Nafi’ Ebû Galib'den demiştir ki: Ben ağıl yolunda idim. Etrafında kalabalık cemaat bulunan bir cenaze geçti. Abdullah b. Umeyr'in cenazesidir, dediler. Bunun üzerine ben de o'nun arkasından gitmeye başladım. Bir de baktım, karşımıza üzerinde ince bir kaftan, başında da kendisini güneşten koruyan bir bez bulunan at üzerinde bir adam çıkıverdi. \"Bu kabile reisi de kimdir?\" diye sordum. \"Enes b. Malik'dir\" cevabını verdiler. Cenaze indirilince Enes kalkıp cenaze namazını kıl (dır)dı. Ben de (hemen) arkasındaydım. Benimle onun arasında hiçbir şey yoktu. (Enes) cenaze'nin başı hizasında durup dört tekbir aldı. (Namazı) ne uzattı ne de süratli kıldırdı. (Namaz bittikten) sonra oturmak istedi. (O sırada kendisine); Ey Ebû Hamza (şu cenaze) Kureyş'li bir kadındır, (onun da namazını kildınver), dediler. Kadını (Enes'e) yaklaştırdılar. (Cenazenin) üzerinde yeşil bir örtü vardı. (Enes) kalktı, cenaze'nin kalçası hizasında durup aynen erkeğin namazını kıldığı şekilde onun da namazını kıl(dır)dı, sonra oturdu. Derken el-Alâ b. Ziyad: Ey Ebû Hamza! Rasûlullah (s.a.v.) de cenaze namazını senin kıldırdığın gibi bu şekilde dört tekbir alarak, erkeğin başı hizasında, kadın'ın da kalçası hizasında durarak mı kıldırırdı? diye sordu. O da; Evet, diye cevap verdi. (Bunun üzerine el-Alâ b. Ziyad): Ey Ebû Hamza; sen Rasülullah (s.a.v.)'le birlikte savaşta bulundun mu? diye sordu. (O da): Evet, Huneyn'de onunla birlikte savaştım. Müşrikler gelip üzerimize saldırdılar. Nihayet (biz hezimete uğrayıp) kaçmaya başlamıştık. Atlarımızın da arkamızdan (hezimete uğrayıp kaçışmakta) olduklarını gördük. (Müşrik) askerleri içerisinde bir adam vardı ki, üzerimize saldırıyor ve bizi kırıp geçiriyordu. Derken'Allah onları bozguna uğrattı. (Ele geçirilen) düşman askerleri getiriliyordu. Müslüman kalmak üzere Hz.. Nebi'e söz veriyorlardı. (O sırada) Peygamber (s.a.v.)'in sahabilerinden bir adam \"Üzerime nezr olsun, eğer Allah bugün bizi kırıp geçiren adamı buraya getirecek olursa, onun boynunu vuracağım\" dedi. (Bunu duyan) Rasülullah (s.a.v.) sükut etti. (Derken sözü geçen) adam (müslüman askerler tarafından oraya) getirili-verdi. (Adam) Rasülullah (s.a.v.)'i görünce: \"Ey Allah'ın Rasûlü, ben (küfürden kurtulup) Allah'a döndüm, dedi. Rasülullah (s.a.v.); (o nezreden) adam, nezrini yerine getirsin diye o adamla biatlaşmaktan uzak durdu. (Nezreden) kişi adamı öldürmek için Rasülullah (s.a.v.)'in kendisine emir vermesini beklemeye başladı. O kimseyi (müslüman olduktan sonra öldürmek hususunda) Rasülullah (s.a.v.)'den korkuyordu. Rasûlullah (s.a.v.)\"onun hiçbir şey yapamayacağını anlayınca (müslüman olmak isteyen) adamla (müslüman olarak kalması için) biatlaştı. Bunun üzerine (nezr eden) adam: Ey Allah'ın Rasûlü, benim nezrim (ne olacak?) dedi. \"Ben denlinden beri sen nezrini yerine getiresin diye (onunla biatleşmekten) geri durdum.\" buyurdu. (Adam da): Ey Allah'ın Rasûlü, bana işaret etseydin ya! dedi. Bunun üzerine Nebi (s.a.v.): \"Hiç bir Nebi işaretle konuşmaz\" buyurdu. (Bu hadisin ravisi) Ebü Galib dedi ki: \"Ben Enes'in (cenaze namazını kıldırırken) kadının kalçalarının hizasında durmasını(n sebebini ilim adamlarına sordum da bana -çünkü (eskiden kadım gözlerinden korumak üzere üzerine örtülen) kubbe şeklindeki örtüler yoktu. (Bu yüzden) imam onu cemaatten gizlemek üzere kalçalarının hizasında dururdu. (Bu gün de onlara uymak için Hz. Enes kadının kalçaları hizasında durdu)- diye cevap verdiler.\" Ebû Dâvûd der ki: Nebi (s.a.v.)'in \"Ben insanlar -Lâ ilahe illallah- deyinceye kadar onlarla savaşmakla emrolundum\" (anlamındaki 2640 numaralı) hadisi, (mevzumuzu teşkil eden) bu hadisin (bir müslümanın öldürmeyi nezrettiği bir müşriğin) \"Ben (artık küfürden) Allah'a döndüm\"sözüyle (müslüman olduğunu ifade ettikten sonra da, müslümanın) onu öldürerek nezri(ni) yerine getirebileceğini ifade eden) kısmını neshetmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 106
			}
		}
	]
}