{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"22": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3316,
			"arabicnumber": 3316,
			"text": "İmrân b. Husayn (radıyallahü anh)'dan rivâyet edildi. Dedi ki: Adbâ, Benî Akıl kabilesinden bir adamındı ve hacıları(n develerini) geçenlerdendi. Adam (devesiyle birlikte) esir edilip bağlı olarak Hazret-i Peygamber'e getirildi. Hazret-i Peygamber (sallallahü aleyhi ve sellem); üstünde kadife olan bir eşeğin sırtında idi. Adam: Muhammed! Beni ve hacıları geçen (bu devey)i niçin tutuyorsun? dedi. Peygamber: Seni, müttefiklerin olan Sakif’in suçundan dolayı tutuyorum\" buyurdu. Hazret-i Peygamber’in ashabından iki kişiyi esir etmişlerdi. kabilesinden olan adam, söylediği sözler içerisinde \" Ben de müslümanım -veya ben de müslüman oldum\" - Buradaki şüphe raviye aittir. - dedi. Peygamber (sallallahü aleyhi ve sellem) geçip gidince -Ebû Dâvûd, \" Bu sözü Muhammed b. Îsa'dan öğrendim\" dedi-; Adam: Muhammed! Ya Muhammed! diye bağırdı. Resûlüllah (sallallahü aleyhi ve sellem), merhametli (nazik) idi. Adama dönüp; Ne istiyorsun?\" dedi. müslümanım. Eğer sen bunu kendi işine malikken (esir edilmeden önce) söyleseydin tam manasıyla kurtulurdun.\" Dâvûd; Sonra Süleyman'ın hadisine döndüm.\" dedi-: Adam: Muhammed! Ben açım, beni doyur. Ben susuzum, beni sula. Resûlüllah: Senin ihtiyacın bu -veya bu onun ihtiyacıdır- (isteğini yapın)\" buyurdu. Dâvûd; esir edilen adamın müslüman olduğunu bildiren sözlerini ve Resûlüllah'ın cevabını, Muhammed b. Îsa'nın rivâyetinden; geri kalanını da Süleyman b. Harb'in rivâyetinden nakletmiş ve buna işaret etmiştir. adam (Sakîflilerdeki) iki kişiye mukabil fidye olarak verildi. Adbâ'yı ise, Hazret-i Peygamber binmek için alıkoydu. Medinelilerin otlaktaki hayvanlarına baskın yaptılar ve Adbâ'yı da götürdüler. Onu götürdüklerinde müslümanlardan bir kadını da esir etmişlerdi. Onlar geceleyin develerini avlularında çöktürürlerdi. Bir gece hepsi uyudular, kadın kalktı. Elini hangi deveye dokundursa, deve böğürüyordu. Nihayet Adbâ’nın yanına geldi. O itaatkâr, binilmeye alışık bir devenin yanına gelmişti. Hemen ona bindi, sonra; eğer Allah kendisini kurtarırsa onu mutlaka boğazlamayı adadı. Medine'ye gelince, devenin Hazret-i Peygamber'in devesi olduğu anlaşıldı ve Resûlüllah bundan haberdar edildi. Bunun üzerine Resûlüllah haber saldı, kadın getirildi. Kendisine kadının adağı bildirildi. Ona ne de kötü ceza vermişsin -veya ona ne de kötü ceza vermiş-; eğer Allah onu bunun üzerinde kurtarırsa onu mutlaka boğazlayacakmış! Allah'a isyan konusundaki ve insanoğlunun sahibi olmadığı şeydeki nezre vefa olmaz\" buyurdu. Dâvûd: Esir edilen bu kadın, Ebû Zerr'in karışıdır\" dedi. nüzûr 8; İbn Mâce, keffârât 16 (bir bölümü); Ahmed b. Hanbel, IV, 430",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 75
			}
		}
	]
}