{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"23": "Commercial Transactions (Kitab Al-Buyu)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3394,
			"arabicnumber": 3394,
			"text": "Salim b. Abdullah b. Ömer'den rivayet edildiğine göre; İbn Ömer (r.a.), Râfi' b. Hadîc'in \"Rasûlullah (s.a.v.) araziyi kiraya vermeyi nehyederdi.\" dediği haberini alıncaya kadar toprağını kiralardı. Râfi'a varıp; Ey İbn Hadîc, araziyi kiralama konusunda Rasûlullah'dan ne haber veriyorsun? dedi. Râfi'de Abdullah b. Ömer'e şu cevabı verdi: Amcalarımı, -ikisi de Bedir'e iştirak etmişlerdir- ev halkına, Rasûlullah (s.a.v.)'in araziyi kiralamayı nehyettiğini haber verirlerken işittim. Bunun üzerine Abdullah: Vallahi, Rasûlullah (s.a.v.) devrinde tarlanın kiraya verildiğini zannediyordum, dedi. Sonra Abdullah, Rasûlullah'ın bu konuda kendisinin bilmediği bir şey ihdas etmiş olmasından korktu ve araziyi kiraya vermeyi bıraktı. Ebû Dâvûd dedi ki: Bu hadisi Eyyub, Ubeydullah, Kesîr b. Ferkad ve Mâlik, Nâfi'den, Nâfi' Râfi'den, o da Rasûlullah'tan rivayet etti. Evzaî de aynı hadisi Hafs b. înân [et-HanefîJ'den, o Nâfi'den Nâfi'de Râfi'den rivayet etmiştir. (Bu rivayette) Râfi', ''Rasûlullah'tan işittim... \" dedi. Aynı şekilde Zeyd b. Ebî Üneyse'nin Hakem'den, Hakem'in Nâfi'­den, onun da îbn Ömer'den rivayet ettiğine göre; İbn Ömer, Râfi'e gelip; \"Rasûlullah'tan işittin mi?\" demiş, Râfi' de ''evet\" karşılığını vermiştir. Yine bu hadisi, îkrime b. Ammâr, Ebû Necâşî'den, Ebû Necaşı de Râfi' [b.Hadîc)\"den, \"Rasûlullah (s.a.v.)'tan işittim\" şeklinde riva­yet etmişlerdir. el-Evzaîise, Ebû Necâşî'den, o Râfi' b. Hadîc'ten, Râfi' de amcası Zahir b. Râfi' vasıtasıyla Hz. Nebi'den rivayet etmiştir. Ebû Dâvûd: \"Necâşî'nin babası Atâ b. Süheyb'dir\" der",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 69
			}
		}
	]
}