{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"25": "The Office of the Judge (Kitab Al-Aqdiyah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3607,
			"arabicnumber": 3607,
			"text": "Umâre b. Huzeyme'den rivâyet olunduğuna göre; Peygamber (sallallahü aleyhi ve sellem)'in sahâbîlerinden olan amcası ona şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem) bedevilerden birinden bir kısrak satın aldı. Ona atının fiatını ödemek için peşinden gelmesini istedi (ve önden yürüyüp gitti). Râsulullah (sallallahü aleyhi ve sellem) hızlıca yürüyordu. Bedevi ise yavaş yavaş gidiyordu. Derken halk bedevinin etrafını sarıp (onun yedeğinde bulunan) kısrağı satın almak üzere pazarlığa giriştiler. Bu kısrağı Hazret-i Peygamber (sallallahü aleyhi ve sellem)'in bedeviden satın aldığını bilmiyorlardı. (Halkın elindeki kısrağa daha fazla fiat verdiğini gören) bedevi, Resûlüllah (sallallahü aleyhi ve sellem)'a haykırarak: kısrağı alacaksan al, yoksa ben onu sattım! dedi. Resûlüllah (sallallahü aleyhi ve sellem) bedevinin haykırışını işitince (yanına varıp): Ben bu kısrağı senden satın almadım mı?\" diye sordu. Bedevinin; -Hayır vallahi, ben bunu sana satmadım; karşılığını vermesi üzerine Peygamber (sallallahü aleyhi ve sellem): Evet, ben bu kısrağı senden satın aldım\" dedi. Bedevi de; öyleyse, şahit göster; demeye başladı. Huzeyme b. Sabit (ortaya atılarak bedeviye dönüp): senin bu hayvanı (Hazret-i Peygamber'e) sattığına şahitlik ederim, dedi. (sallallahü aleyhi ve sellem) Huzeyme'ye dönerek: Neye (dayanarak) şahitlik ediyorsun?\" diye sordu. (Huzeyme de): Allah'ın Rasûlü, (ben, Allah'ın) seni tasdik etmesiyle (şahitlik ediyorum) cevabını verdi. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem) Huzeyme'nin şahitliğini iki erkeğin şahitliğine denk saydı. cihad 12, tefsir sûre (33) 3; Nesâî, büyü 81; Ahmed b. Hanbel, V, 188, 189, 216",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 37
			}
		}
	]
}