{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"25": "The Office of the Judge (Kitab Al-Aqdiyah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3612,
			"arabicnumber": 3612,
			"text": "Şuays b. Abdullah b. ez-Zübeyb dedi ki: Ben dedem Zübeyb (b. Sa'lebe'y)i (şöyle) derken işittim: elçisi (Muhammed) (sallallahü aleyhi ve sellem) Anber oğulları üzerine (bir) asker(î kuvvet) göndermişti. (Bu askerler) onları Tâif’in nahiyelerinden Rukbe'de yakaladılar ve Peygamber (sallallahü aleyhi ve sellem)'e götürdüler. (Ben de bir hayvana) bindim (aradan sıvışarak) onlardan önce Peygamber (sallallahü aleyhi ve sellem)'e geldim. \" Selâm sana ey Allah'ın elçisi, Allah'ın rahmet ve bereketi (senin üzerine olsun). Senin askerlerin bizi yakaladılar. Oysa biz (daha önce) müslüman olmuş ve (müslüman olduğumuzun bilinmesi için) develer(imiz)in kulaklarını kesmiştik\" dedim. Anber oğulları gelince Peygamber (sallallahü aleyhi ve sellem) bana: Bu günlerde yakalanmanızdan önce nuislü man lığı kabul ettiğinize dair bir şahidiniz var mıdır?\" diye sordu. Ben \" Evet\" cevabım verdim. Şahidin kimdir?\" dedi. oğullarından Semüre isimli bir adamla, başka bir adam, dedi(m ve) Peygamber (sallallahü aleyhi ve sellem)'e adamın ismini söyledi(rri). Adam (bizim daha önceden müslümanlığı kabul ettiğimize) şahitlik etti (fakat) Semüre şahitlik etmedi. Peygamber (sallallahü aleyhi ve sellem) (bana hitaben):. (Semüre) senin lehine şahitlik etmekten kaçındı, öbür şahidin(in) şahitliğiyle birlikte sen de yemin yeder misin?\" dedi. \" Evet\" karşılığım verdim. Bunun üzerine bana yemin teklif etti. Ben de: Biz (daha önce) falanca gün müslüman olmuştuk ve develerin kulaklarını kesmiştik diye Allah'a yemin ettim. üzerine Peygamber (sallallahü aleyhi ve sellem) (oradaki sahâbilere dönerek): Haydi, gidiniz malları(nın) yarısını (onlardan alınız, diğer yarısını da) kendilerine bırakınız. Çoluk çocuklarına dokunmayınız\" buyurdu. (Sonra Anber oğullarına dönerek): Eğer Allah amelleri boşa çıkarmayı sevmez olmasaydı (bu mallardan) size bir ipi dahi eksik vermezdim\" (Fakat askerlerin emeğini boşa çıkarmak istemediğim, için mallarınızın bir kısmını onlara, verdim) buyurdu. (sözlerine devamla şöyle) dedi: O şırada, annem beni çağırıp (askerlerden birini göstererek): Bu adam benim saçaklı yaygımı aldı, diye şikâyet etti. Ben de hemen Peygamber (sallallahü aleyhi ve sellem)'e gidip şikâyette butundum. (Peygamber Efendimiz) bana: Onu yakala\" dedi. Bunun üzerine hemen (varıp onun) yakasını topladım, bulunduğumuz yerde onunla birlikte beklemeye başladım. O sırada Peygamber (sallallahü aleyhi ve sellem) bizim orada beklemekte olduğumuzu görünce (bana): Bu yakaladığın adamdan ne istiyorsun?\" dedi. Ben de onu elimden bırakıverdim. Peygamber (sallallahü aleyhi ve sellem) karşımıza geçip o adama hitap ederek:\" Bu adama annesinden aldığın saçaklı sergiyi geri ver\" buyurdu. (Adam da): Ey Allah'ın Rasûlü, o kadın benim elimden çıktı, dedi. Peygamber (sallallahü aleyhi ve sellem) de adamın kılıcını çekip aldı, bana verdi ve ona: Git, buna ilaveten bir ölçek de yiyecek ver\" buyurdu. O zat bana (kılıca) ilâve olarak bir ölçek de arpa verdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 42
			}
		}
	]
}