{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"26": "Knowledge (Kitab Al-Ilm)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3666,
			"arabicnumber": 3666,
			"text": "Ebû Saîd el-Hudrî (radıyallahü anh)'den şöyle dediği rivâyet olunmuştur: fakirlerinden oluşan bir cemaatle birlikte oturuyordum. Onlardan bazıları (avret mahallerine yakın olan) bazı çıplak yerlerini (üzerleri iyi örtülü olan) bazı (arkadaşlarının arkalarına gizlenmek suretiyle) örtüyorlardı. (Orada bulunan bir Kur'an) okuyucu (su) bize (Kur'an) okuyordu. O sırada Resûlüllah (sallallahü aleyhi ve sellem) çıkageldi ve yanımıza gelip durdu. Resûlüllah (sallallahü aleyhi ve sellem) gelince (Kur'an) okuyan (kimse okumayı bırakıp) sustu. Bunun üzerine (Hazret-i Peygamber bize) selâm verdi ve,\" Ne yapıyorsunuz?\" diye sordu. (Biz de) \" Ey Allah'ın Rasûlu, bu bizim okuyucumuzdur. Bize Kur'an okuyordu, biz de yüce Allah'ın kitabını dinliyorduk\" cevabını verdik. üzerine Allah'ın Rasûlu (sallallahü aleyhi ve sellem), \" Ümmetimden, kendileri ile birlikte sabretmekle emrolunduğum kimseler yaratan Allah'a hamd olsun\" diye hamdü senada bulundu. Aramızda kendisini (yakınlık bakımından hepimize) eşit (derecede) tutabilmek için (tam) ortamıza oturdu. Hazret-i Peygamber'in aralarına oturuş şeklini anlatabilmek için) eliyle, \" İşte şöyle\" diye işaret etti, (sonra sözlerine devamla şöyle dedi: Orada bulunan halk) hemen (onun etrafında) halka oldular, (hepsinin yüzleri) onun karşısına geldi. (Fakat) Resûlüllah (sallallahü aleyhi ve sellem)'ın karanlıkta onlardan, benden başka birini tanıyabildiğini zannetmiyordum. (sallallahü aleyhi ve sellem) (bizi karşısında bu şekilde görünce); Ey muhacirlerin fakirleri, sizi kıyamet gününde (kavuşacağınız) tam bir nurla müjdeliyorum. Siz cennete zenginlerden yarım gün önce gireceksiniz. Bir (tam) gün (dünya senesiyle) beşyüz senedir\" buyurdu. zühd 37; Tirmizî, zühd 27; İbn Mâce, zühd 6; Ahmed b. Hanbel, II, 169, III, 324",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 26,
				"hadith": 26
			}
		}
	]
}