{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"28": "Foods (Kitab Al-At'imah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3744,
			"arabicnumber": 3744,
			"text": "Enes b. Mâlik (r.a)'den rivayet olunduğuna göre; Nebi (Sallallahu aleyhi ve Sellem) Safiyye için bir kavut ve kuru hurma ziyafeti verdi. Diğer tahric. Tirmizi, nikah; İbni Mace, nikah (1909) AÇIKLAMA Ulema, evlenme münasebetiyle verilen yemeğin vaktinde ih­tilâf etmişlerdir. Bazıları bu yemeğin nikâhtan önce verilece­ğini söylerken bazıları da nikâhtan sonra verilebileceğini söylemişlerdir. Zi­faftan önce ve zifaftan sonra verilebileceğine dair görüşler de vardır.[el-İhtiyar li talilil Muhtar, IV-176.] Nikâh öncesinden itibaren zifaf sonrasına kadar olan geniş süre içeri­sinde herhangi bir zamanda verilebileceğini söyleyenler de olmuştur. Günü­müzde genellikle bu genişlikten yararlanılarak bu yemek, nikâh ile zifaf ara­sında verilmektedir, Mişkât'ta rivayet edilen bir hadis-i şerifte, Fahr-i Kâinat Efendimiz'in Hz. Safiyye'nin nikâhı münasebetiyle hays denilen bir yemek ziyafeti verdi­ği ifade edilmektedir. Mişkât'ta rivayet edilen diğer bir hadis-i şerifte de Hz. Nebidin bu ziyafette kuru hurma, yağ ve yoğurt kurusundan yapılan bir yemek verdiği rivayet edilmektedir. Aliyyü'l-Kârî'ye göre, bu iki rivayet­te anlatılmak istenen yemeklerin ikisi de aynı yemektir. Aralarında bir fark yoktur. Çünkü \"hays\" yemeği içinde de kuru hurma, kuru peynir ve yağ bulunur. Tıybî de netice itibariyle aynı şeyleri söylemiştir. Hz. Nebi, Hz. Zeyneb validemizin nikâhı münasebetiyle ise bir koyun ziyafeti vermiştir. Bu durum Hz. Nebi'in bazı ailelerinin dü­ğünlerinde etli bazı ailelerinin düğünlerinde ise etsiz ziyafet verdiğini ortaya koymaktadır. Hadis-i şeriflerde ekmekten hiç bahsedilmediğine göre etsiz ve ekmeksiz düğün ziyafeti vermek caizdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 9
			}
		}
	]
}