{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"29": "Medicine (Kitab Al-Tibb)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3900,
			"arabicnumber": 3900,
			"text": "Ebû Saîd el-Hudrî (radıyallahü anh)'den rivâyet olunduğuna göre; (sallallahü aleyhi ve sellem)'in sahâbîlerinden küçük bir topluluk çıktıkları bir yolculukta arap kabilelerinden birine uğramışlar. (Kabilenin fertlerinden) biri (onlara); başkanımız (zehirli bir böcek tarafından) sokuldu. Birinizin yanında (bizim bu) arkadaşımıza yarayacak (şifalı) bir şey var mıdır? demiş. bir adam da: (var), vallahi ben (hastalan) okuyarak tedavi ederim. Fakat biz size misafir olmak istediğimiz halde siz bizi misafir etmek istemediniz. (Bu sebeple) siz (yapacağım tedaviye karşılık) bana bir ücret, tayin etmedikçe ben nefes etmem, diye karşılık vermiş. üzerine (kabile mensupları tutmuşlar) bu adam (in edeceği nefes) için (ortaya) bir koyun sürüsü koymuşlar. (Tedavi edeceğini söyleyen bu yolcu) hastanın yanına varıp ona Fatiha sûresini okumuş ve üfürmüş. Nihayet adam ipten kurtulmuş gibi olmuş. üzerine (yukarıda sözü geçen şahıs) kabilenin (vermek için) üzerinde anlaşmış oldukları ücreti yolculara ödemiş. (Ücreti alan) yolcular, (birbirlerine) \" Bunu bölüşünüz\" demeye başlamışlar. Nefes ederek (hastayı) tedavi eden şahıs, \" Resûlüllah (sallallahü aleyhi ve sellem)'a varıp kendisine danışıncaya kadar (bunu) yapmayınız\" demiş. (sallallahü aleyhi ve sellem)'a varıp bunu (kendisine) arzetmişler. Resûlüllah (sallallahü aleyhi ve sellem): Fâtiha'nın tedaviye yaradığını nereden bildin? Aferin size, (haydi bu koyunları) bölüşünüz. Sizinle beraber bana da bir pay ayırınız\" buyurmuş. icâre 16, tıb 33, 39; Müslim, selâm 65, 66; Ebû Dâvûd, büyü 37, tıb 19; Tirmizî, tıb 20; İbn Mace, ticârât 7; Ahmed b. Hanbel, III, 3, 10, 44",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 46
			}
		}
	]
}