{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"31": "The Book of Manumission of Slaves"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3931,
			"arabicnumber": 3931,
			"text": "Urve b. ez-Zübeyri’dien rivâyet olunduğuna göre; Âişe (r. anha) şöyle demiştir: bin el-Haris b. el-Mustalik, (Beni Mustalik gazvesi sonunda) Sabit b. Kays b. Şemmas'ın yahutta (Sabit'ın) amcası oğlunun hissesine düşmüş ve (onunla) kendi üzerine bir kitabet anlaşması yapmıştır. (Cüveyriye) gözlerin kendisine takılıp kaldığı çok güzel bir kadındı. (r. anha) (sözlerine devam ederek) dedi ki: (Cüveyriye, yaptığı) kitabet anlaşmasında (yardım) istemek üzere Resûlüllah (sallallahü aleyhi ve sellem)'a geldi. Kapı (ya kadar gelip de ora) da durunca kendisini gördüm. Fevkalade güzelliği ile Hazret-i Peygamberin dikkatini çekeceğini düşünerek) durumundan hoşlandım. (Benim onda) gördüğümü Resûlüllah (sallallahü aleyhi ve sellem)'ında göreceğini anladım. Hazret-i Peygambere hitaben: Allah'ın Resulü, ben (esir aldığın Mustalik oğullarının başkanı) Haris'in kızı Cüveyriye'yim. Benim (şu andaki) durumum sana gizli değildir. Ben Sabit b. Kays b. Şemmas'ın hissesine düştüm. Kendi hakkımda bir kitabet anlaşması yaptım. Sana (bu) anlaşmada (bana yardımcı olmanı) istemek için geldim, dedi. Resûlüllah (sallallahü aleyhi ve sellem) da: Senin için bundan daha hayırlısına (bir istek) var mıdır?\" karşılığını verdi. (Cüveyriye): O nedir ey Allah'ın Resulü? diye sordu. (Hazret-i Peygamber de): Senin kitabetini(n bedelini) öderim, (sonra azad edip) seninle evlenirim.\" cevabını verdi. (Cüveyriye de), \" Kabul ettim\" dedi. (Hazret-i Âişe sözlerine devamla şöyle) dedi: Halk Resûlüllah (sallallahü aleyhi ve sellem)'ın Cüveyriye ile evlendiğini işittiler. Bunun üzerine, ellerinde bulunan esirleri serbest bırakmaya başladılar, onları azad ettiler, ve; (Bunlar) Resûlüllah (sallallahü aleyhi ve sellem)'ın hanımı tarafından yakınıdırlar, demeye başladılar. \" Biz kavmi için Cüveyriye'den daha yararlı bir kadın görmedik. Onun sayesinde Mustalik oğullarından yüz (kadar) halkı hürriyetine kavuşturuldu. Dâvûd dedi ki; Bu hadis velinin (velisi olduğu kızı) kendisi ile evlendirebileceğine dair kuvvetli bir delildir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 6
			}
		}
	]
}