{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"31": "The Book of Manumission of Slaves"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3931,
			"arabicnumber": 3931,
			"text": "Urve d. ez-Zübeyrden rivayet olunduğuna göre;; Aışe (r, anha) şöyle demiştir: Cüveyriye bin el-Haris b. el-Mustalik, (Beni Mustalik gazvesi sonunda) Sabit b. Kays. b. Şemmas'ın yahutta (Sabit'in) amcası oğlunun hissesine düşmüş ve (onunla) kendi üzerine bir kitabet anlaşması yapmıştır. (Cüveyriye) gözlerin kendisine takılıp kaldığı çok güzel bir kadındı. Aişe (r, anha) (sözlerine devam ederek) dedi ki: (Cüveyriye, yaptığı) kitabet anlaşmasında (yardım) istemek üzere Resulullah (s.a.v.)'e geldi. Kapı (ya kadar gelip de ora) da durunca kendisini gördüm. Fevkalade gü­zelliği ile Hz. Nebiin dikkatini çekeceğini düşünerek) durumundan hoşlandım. (Benim onda) gördüğümü Resulullah (s.a.v.)'inde göreceğini anladım. Cüveyriye, Hz. Nebie hitaben: Ey Allah'ın Resulü, ben (esir aldığın Mustalik oğullarının başkanı) Haris'in kızı Cüveyriye'yim. Benim (şu andaki) durumum sana gizli değildir. Ben Sabit b. Kays b. Şemmas'ın hissesine düştüm. Kendi hakkımda bir kitabet anlaşması yaptım. Sana (bu) anlaşmada (bana yardımcı olmanı) istemek için geldim, dedi. Resulullah (s..a.v.) de: \"Senin için bundan daha hayırlısına (bir istek) var mıdır?\" karşılığını verdi. (Cüveyriye): \"O nedir ey Allah'ın Resulü? diye sordu. (Hz. Nebi de): \"Senin kitabetini (n bedelini) öderim, (sonra azad edip) seninle evlenirim.\" cevabını verdi. (Cüveyriye de), \"Kabul ettim\" dedi. (Hz. Aişe sözlerine devamla şöyle) dedi: Halk Resulullah (s.a.v.)'in Cüveyriye ile evlendiğini işittiler. Bunun üzerine, ellerinde bulunan esirleri serbest bırakmaya başladılar, onları azad ettiler, ve; \"(Bunlar) Resulullah (s.a.v.)'in hanımı tarafından yakınıdırlar, demeye başladılar. \"Biz kavmi için Cüveyriye'den daha yararlı bir kadın görmedik. Onun sayesinde Mustalik oğullarından yüz (kadar) halkı hürriyetine kavuşturuldu. Ebû Davud dedi ki; Bu hadis velinin (velisi olduğu kızı) kendisi ile evlendirebileceğine dair kuvvetli bir delildir. Diğer tahric: Ahmed (hno:13599) İbnu'l-Carud (705), İbn Hibban (4054) vve Hakim (4/26) rivayet ettiler",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 6
			}
		}
	]
}