{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"2": "Prayer (Kitab Al-Salat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 394,
			"arabicnumber": 394,
			"text": "İbnİ Şihab'ın Usame b. Zeyd el-Leysi'ye bildirdiğine göre; Ömer b. Abdil-Aziz (bir gün) minberde oturmakta idi. Bu yüzden ikindiyi birazcık geciktirdi. Bunun üzerine Urve b. Zübeyr kendisine: Dikkat et, Cebrail (aleyhisselam), Muhammed (Sallallahu aleyhi ve Sellem)'e namaz vakit(leri)ni haber verdi, demiş. Ömer de Ona: Söylediğini iyi bil karşılığını vermiştir. Bu sefer Urve: Ben Beşir b. Ebi Mes'ud'dan işittim; O da Ebu Mes'ud el-Ensari'den duymuş; Ebu Mes'ud demiş ki: Resulullah (Sallallahu aleyhi ve Sellem): \"Cebrail indi ve bana namaz vaktini haber verdi. Ben de onunla namaz kıldım. Sonra (yine) onunla namaz kıldım, sonra (yine) onunla namaz kıldım, sonra (yine) onunla namaz kıldım, sonra (yine) onunla namaz kıldım\" buyuruyor, parmakları ile de beş namazı sayıyordu. (Ebu Mes'ud devamla şöyle dedi): Resuluılah'ı öğle namazını güneş batıya eğildiği zaman kılarken gördüm. Hava sıcak olduğu zaman ise, bazan biraz geciktirirdi. İkindiyi güneş sararmadan önce beyaz ve yüksek bir halde iken kıldığını gördüm. Bir kimse (ikindi) namazından çıkar ve güneş batmadan önce Zul-Huleyfe'ye gelirdi. Resulullah (Sallallahu leyhi ve Sellem) akşam güneş battığı, yatsıyı da ufuk karardığı zaman kılardı. Bazan da insanların toplanması için geciktirirdi. Sabahı bir sefer alacakaranlıkta, başka bir sefer de ortalık ağarınca kıldı. Bundan sonra, Efendimizin sabah namazı, ölünceye kadar alaca karanlıkta oldu, bir daha ortalık, ağarınca kılmadı. Ebu Davud dedi ki: Bu hadisi Zuhri'den, Ma'mer, Malik ve İbni Uyeyne, Şuayb b. Ebi Hamza, Leys b. Sa'd ve başkaları da rivayet etti. Bunların hiç biri Resulullah (Sallallahu aleyhi ve Sellem)'in namaz kıldığı vakit(ler)i zikretmediler ve açıklamadılar. Aynı şekilde, Hişam b. Urve ve Habib b. Ebi Merzuk da Urve (b. Zübeyr)'den Ma'mer ve Ashabının rivayetleri gibi rivayet ettiler. Ancak Habib Beşir'i zikretmedi. Vehb b. Keysan da Cabir kanalıyla Resulullah (Sallallahu aleyhi ve Sellem)'den akşamın vaktini rivayet etti. (Bu rivayette Cabir) şöyle dedi: Sonra (Cebrail) ertesi günü güneş battığı zaman tek vakit olarak akşam için geldi. Ebu Davud devamla şöyle dedi: Ebu Hureyre vasıtasıyla Peygamber (s.a.v.)'den aynı şekilde rivayet edilmiştir. (Bu rivayette) Resulütlah (Sallallahu aleyhi ve Sellem): \"Sonra bana akşamı (yani ertesi günü -tek vakit olarak- ) kıldırdı\" buyurdu, Abdullah b. Amr b.el-As'dan Hassan b. Atiyye'nin hadisi, Amr b. Şuayb'dan; O babasından, O da dedesinden Ebu Hureyre ve Cabir'in rivayetleri gibi rivayet edilmiştir. Diğer tahric: Buhari, mevakit; İbn-i Mace, salat",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 4
			}
		}
	]
}