{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"1": "Purification (Kitab Al-Taharah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 40,
			"arabicnumber": 40,
			"text": "Hz. Aişe (r.anha)'dan rivayet edildiğine göre Resul-i Ekrem (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: \"Herhangi biriniz, kaza-yi hacet yerine gitmek istediğinde temizlik için yanına üç taş alsın. Bu taşlar ona yeter.\" Diğer tahric: Buhari, vudu'; Müslim, tahare ; Tirmizî; tahare; Nesaî, tahâre; ibn Mace, tahare. Bazı Hükümler: Bu hadis-i şerif kaza-yi hacet yerine gitmek istediğinde üç taş kullanmanın gerekli olduğuna delildir. Mesele ihtilaflıdır. İmam Şafii, Ahmed, İshak, İbn Rahuye ve Ebu Sevr istinca'nın yapılabilmesi için mutlaka taş adedinin üç olması gerektiği üç yüzü bulunan bir taşla da taharetlenmenin kafi gelebileceğini söylerler. İmam da şer'i manada istinca sayılabilecek bir temizlik için üç taş kullanma şartı vardır. Bu görüşleri için bu hadis-i şerifle 7 ve 8 numaralı hadis-i şerifleri delil getirirler. Şayet istinca hem ön ve hem de arkadan yapılacaksa 6 taşın kullanılması lazım geleceğini; 6 taş kullanmak efdal olmakla beraber, altı yüzü bulunan bir taşla da taharetlenmenin kafi gelebileceğini söylerler. İmam Malik, Ebu Hanife ve Davud (ez-Zahiri) ise, sayı üzerinde durmazlar. Bu meselede asıl olan, istincanın hasıl olmasıdır. Muayyen bir sayı üzerinde durmak gerekmez, derler. Bu aynı zamanda, Hz. Ömer (r.a.)'in de görüşüdür. İmam Nevevi'ye göre Şafiiyyeden bazılarının kavli de budur. Bu hususta üç taş istediği halde kendisine iki taş bir tezek getirildiği için tezeği atan ve iki taşla İktifa eden Resul-i Ekrem'in İbn Mes'ud'dan rivayet edilen fiili sünnetini delil getirirler. Hattabi ise \"bu İbn Mesud hadisi iki taşla iktifa edilebileceğine delil olamaz, üç taş kullanmak vaciptir\" demektedir. Hanefi ulemasından Buhari şarini Ayni, \"Burada üç adedi tatbiki vacip olan bir sayı değil, ekseriyetle istincanın kendisiyle mümkün olduğu için kullanılmış bir sayıdır. Eğer üç taşla temizlik hasıl olmazsa dörde de çıkarılabilir, beşe de. Eğer temizlik hasıl olmuşsa 2 veya bir taşla da yetinilebilir. Bu itibarla hadis-i şerifin zahiri manası maksud değildir. Hatta 3 yüzü olan bir taşla da temizlik yapılabileceğinde icma vardır\" demiştir. İbn Mesud (r.a.) hadisiyle de delil getiren Allame Ayni: \"Nebiyy-i Ekrem (s.a.v.) kaza-yi hacet mahalline giderken orada taş bulunmadığını bildiği için üç taş istemiştir. Tezeği de kullanmadığına göre iki taşla yetinmiştir. Çünkü orada başka taş yoktur\" sözünü delillerle takviye etmiştir. Bu da gösteriyor ki, bu hususta önemli olan temizlenmedir. Üç taraflı bir taşla temizlenmede taş adedi değil, temizlenmeye işaret edilmektedir. Buna göre de üç taş olması lazımdır, şeklinde varid olan hadis-i şeriflerdeki emirlerden maksat vücup değildir, diyenlerin görüşünü takviye etmektedir. Yine bu hadis-i şerif istincanın vücubuna delildir.Şafii, Ahmed, Ebu Sevr ve İshak hazretleri de bu görüştedirler. Ebu Hanife, İmam Malik, Şafiilerden Müzeni, istincanın sünnet olduğu görüşündedirler. Fakat bu İhtilaf, necaset çıkan mahallin namaza mani olacak miktara ulaşmaması halindedir. Aksi takdirde su kullanmak ve o mahalli yıkamak, farzdır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 40
			}
		}
	]
}