{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"34": "Clothing (Kitab Al-Libas)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4131,
			"arabicnumber": 4131,
			"text": "Halid (b. Mi'damJ'dan rivayet edilmiştir; dedi ki: Mikdâm b. Madîkerb'le Amr b. el-Esed ve Kmnesrîn halkından olan Esedoğullarından bir adam. Muâviye b. Ebû Süfyân'a elçi olarak gelmişlerdi. Muâviye, Mikdâm'a: Hasan b. Ali'nin vefat ettiğini biliyor musun? dedi. Mikdâm (bu haberi işitince) hemen \"inna lillâhi ve inna ileyhi râciun\" dedi. (Esedoğullarından olan) adam (veyahut orada bulunan bir başka adam) da Muâviye'ye: Sen bu hâdiseyi (aramızda korkunç fitnelerin doğmasına yol açacak) bir musibet olarak mı görüyorsun? dedi. Muâviye de ona: Onu Rasûlullah (s.a.v.) kucağına koyup, \"Bu bendendir, Hüseyin de Ali'dendir\" buyurduğu halde ben bu hadiseyi niçin bir musibet olarak görmeyeyim? dedi. Esedoğullarından olan kişi de: (Bu hâdise gerçeklen kıvılcımları her tarafa saçılıp büyük yangınlara sebep olabilecek tehlikeli) bir ateş parçası(dır). Onu Allah söndürdü (ve bizi bu tehlikeden kurtardı) dedi. (Bu sözleri işiten) Mikdâm (Hz. Muâviye'ye hitaben): Ben bugün seni öfkelendirmekten ve sana hoşuna gitmeyen sizleri işittirmekten geri durmayacağım, dedi. Sonra şöyle devam etti: Ey Muâviye! Eğer ben (şimdi söyleyeceğim sözlerimde) doğruyu söylemişsem beni tasdik et, eğer yalan söylemişsen o zaman da beni yalanla, dedi. (Hz. Muâviye de): (Peki öyle) yaparım, dedi. (Mikdâm): (O halde ey Muâviye!) Allah aşkına söyle. Sen Rasulullah (s.a.v.)'in (erkeklere) allın (yüzük) takınmayı yasakladığını bil(m)iyor musun? dedi. (Muâviye); Evet, (biliyorum), cevabını verdi. Allah için söyle. Rasûlullan (s.a.v.)'in ipek giyinmeyi yasakladığını bil(m)iyor musun? Evet (biliyorum), dedi. Allah için söyle, Rasûlullah (s.a.v.)'in yırtıcı hayvanların derilerini giymeyi ve o derilerin üzerine binmeyi yasakladığını bil(m)iyor musun? dedi. Evet, karşılığını verdi. (Bunun üzerine Mikdam); Allah'a yemin olsun ki ey Muâviye, ben bunların hepsini senin evinde gördüm, diye konuştu. Muâviye ise; Ey Mikdâm. gerçekten anladım ki ben senin elinden asla kurtulamayacağım, dedi. (Bu hâdiseyi nakleden Halid b. Mi'dân sözlerine devam ederek) dedi ki: (Bu konuşmanın hemen arkasından) Muâviye (Mikdâm'ın) iki arkadaşına verilmesini emrettiğinden daha fazlasını Mikdâm'a verilmesini emretti ve oğlunun da (divandan) iki yüz dinar (alanlar) arasına kaydedilmesini istedi. Mikdâm (Muâviye'nin kendisine bağışladığı bu) bahşişleri (kendi yol) arkadaşlarına dağıttı. Esedoğullarından olan kişi ise (Hz. Muâviye'den aldıklarından) kimseye bir şey vermedi. Bu (haber) Muâviye'ye ulaştı (da Muâviye): \"Mikdâm cömert bir insandır. (Bu yüzden) elini açtı ve (elinde olanı arkadaşlarına dağıttı). Esed oğulların dan olan kişi ise elindekini çok iyi tutan (tutumlu) bir insandır\" dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 112
			}
		}
	]
}