{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"34": "Clothing (Kitab Al-Libas)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4131,
			"arabicnumber": 4131,
			"text": "Halid (b. Mikdam)'dan rivâyet edilmiştir; dedi ki: Mikdâm b. Madîkerb'le Amr b. el-Esed ve Kınnesrîn halkından olan Esedoğullarından bir adam. Muâviye b. Ebû Süfyân'a elçi olarak gelmişlerdi. Mikdâm'a: b. Ali'nin vefat ettiğini biliyor musun? dedi. (bu haberi işitince) hemen \" inna lillâhi ve inna ileyhi râciun\" dedi. (Esedoğullarından olan) adam (veyahut orada bulunan bir başka adam) da Muâviye'ye: bu hâdiseyi (aramızda korkunç fitnelerin doğmasına yol açacak) bir musibet olarak mı görüyorsun? dedi. Muâviye de ona: Resûlüllah (sallallahü aleyhi ve sellem) kucağına koyup, \" Bu bendendir, Hüseyin de Ali'dendir\" buyurduğu halde ben bu hadiseyi niçin bir musibet olarak görmeyeyim? dedi. Esedoğullarından olan kişi de: hâdise gerçekten kıvılcımları her tarafa saçılıp büyük yangınlara sebep olabilecek tehlikeli) bir ateş parçası(dir). Onu Allah söndürdü (ve bizi bu tehlikeden kurtardı) dedi. sözleri işiten) Mikdâm (Hazret-i Muâviye'ye hitaben): bugün seni öfkelendirmekten ve sana hoşuna gitmeyen sizleri işittirmekten geri durmayacağını, dedi. Sonra şöyle devam etti: Ey Muâviye! Eğer ben (şimdi söyleyeceğim sözlerimde) doğruyu söylemişsem beni tasdik et, eğer yalan söylemişsen o zaman da beni yalanla, dedi. (Hazret-i Muâviye de): öyle) yaparım, dedi. (Mikdâm): halde ey Muâviye!) Allah aşkına söyle. Sen Resûlüllah (sallallahü aleyhi ve sellem)'ın (erkeklere) allın (yüzük) takınmayı yasakladığını bil(m)iyor musun? dedi. (Muâviye); (biliyorum), cevabını verdi. için söyle. Rasûlullan (sallallahü aleyhi ve sellem)'ın ipek giyinmeyi yasakladığını bil(m)iyor musun? (biliyorum), dedi. için söyle, Resûlüllah (sallallahü aleyhi ve sellem)'ın yırtıcı hayvanların derilerini giymeyi ve o derilerin üzerine binmeyi yasakladığını bil(m)iyor musun? dedi. karşılığını verdi. (Bunun üzerine Mikdûm); yemin olsun ki ey Muâviye, ben bunların hepsini senin evinde gördüm, diye konuştu. ise; Mikdâm, gerçekten anladım ki ben senin elinden asla kurtulamayacağım, dedi. hâdiseyi nakleden Halid b. Mi'dân sözlerine devam ederek) dedi ki: (Bu konuşmanın hemen arkasından) Muâviye (Mikdâm'ın) iki arkadaşına verilmesini emrettiğinden daha fazlasını Mikdâm'a verilmesini emretti ve oğlunun da (divandan) iki yüz dinar (alanlar) arasına kaydedilmesini istedi. Mikdâm (Muâviye'nin kendisine bağışladığı bu) bahşişleri (kendi yol) arkadaşlarına dağıttı. Esedoğullarından olan kiş ise (Hazret-i Muâviye'den aldıklarından) kimseye bir şey vermedi. Bu (haber) Muâviye'ye ulaştı (da Muâviye): Mikdâm cömert bir insandır. (Bu yüzden) elini açtı ve (elinde olanı arkadaşlarına dağıttı). Esed oğullarından olan kişi ise elindekini çok iyi tutan (tutumlu) bir insandır\" dedi. Dâvûd, menâsik 23, tirmizi libâs 31; Nesâî. Fer 7; Dârimî, edahi 19; Ahmed b. Hanbel IV 101 - V",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 112
			}
		}
	]
}