{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"34": "Clothing (Kitab Al-Libas)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4149,
			"arabicnumber": 4149,
			"text": "Abdullah b. Ömer'den rivâyet olunduğuna göre; (sallallahü aleyhi ve sellem) (bir gün seferden dönünce doğru kızı) Fâtıma'ya vardı, (fakat) kapısında bir perde (asılı olduğunu) görünce girmedi. (Abdullah rivâyetine devam ederek şöyle) dedi: (Resûlüllah (sallallahü aleyhi ve sellem)'ın bir yolculuktan dönüşünde ziyaretine) Fâtıma'dan başlamadan (hanımlarından birinin yanına) girmesi pek az olurdu. Ali (radıyallahü anh) (evine döndüğü zaman) Fâtima'yı üzüntülü bir halde görünce, \" Neyin var?\" diye sordu. (Hazret-i Fâtıma da); (sallallahü aleyhi ve sellem) bana uğradı da yanıma girmedi, cevabını verdi. Ali (radıyallahü anh) (Hazret-i Peygambere varıp); Allah'ın Rasûlü, senin kendisine uğrayıp da yanına girmemen Fâtıma'nın pek ağrına gitmiş, dedi. (Hazret-i Peygamber de): Ben nasıl dünya ile beraber olabilirim ve nasıl nakış (lar)la bir arada bulunabilirim?\" buyurdu. üzerine (Hazret-i Ali, Hazret-i) Fâtıma'ya varıp kendisine Resûlüllah (sallallahü aleyhi ve sellem)’ın sözünü bildirdi. (Hazret-i Fâtıma Hazret-i Peygamber'in söylediklerini öğrenince Hazret-i Ali'ye; hemen git) Resûlüllah (sallallahü aleyhi ve sellem)'a (bu hususta) bana ne emrettiğini sor, dedi. (Hazret-i Ali varıp Hazret-i Peygambere, bu hususta Hazret-i Fâtıma'ya ne emrettiğini sordu.) (Hazret-i Peygamber de): Ona söyle, o perdeyi falanlara göndersin.\" Onların örtünmek için bir elbiseye çok ihtiyaçları vardır, onu kendilerine elbise yapsınlar) buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 130
			}
		}
	]
}