{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"34": "Clothing (Kitab Al-Libas)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4153,
			"arabicnumber": 4153,
			"text": "Ebû Talha el-Ensârî'den rivayet olunmuştur; dedi ki: Ben Nebi (s.a.v.)'i; \"Melekler, içerisinde köpek ve heykel bulunan ev'e girmezler\" derken işittim. (Ben bu hadisi rivayet edince Zeyd b. Halid el-Cühenî bâna; haydi) bizi müminlerin annesi Aişe'ye götür, bu hadisi kendisine soralım, dedi. Bunun üzerine (Hz. Aişe'nin yanına) gittik ve; Ey müminlerin annesi! Ebû Talha bize Rasûlullah (s.a.v.)'den şöyle (dediğini) rivayet ediyor. (Gerçekten sen de) Rasûlullah (s.a.v.)'i bunları söylerken (hiç) işittin mi? dedik. Hayır, fakat (şimdi) size Hz. Nebi'i (bizzat) yaparken gördüğüm (buna benzer) bir işi anlatacağım. Rasûlullah (s.a.v.), savaşlarından bir savaşa çıkmıştı. Ben onun savaşından dönmesini bekliyordum. Derken (yünden dokunmuş olan) bize ait bir yaygıyı genişçe bir tahtanın üzerine örttüm. (Hz. Nebi) gelince kendisini karşıladım ve; Ey Allah'ın Rasûlu! selâm, Allah'ın rahmet ve bereketi senin üzerine olsun, seni aziz ve kerim kılan Allah'a hamdolsun, dedim. Eve baktı ve yaygıyı gördü. Bana hiçbir cevap vermedi. Yüzünde bir memnuniyetsizlik (alâmeti) gördüm. Hemen yaygıya varıp onu yırttı, sonra şöyle buyurdu: \"Allah bize rızık olarak verdiği şeylerde (harcama yaparak) taşları, kerpiçleri giydirmenizi emretmedi.\" (Hz. Âişe) dedi ki: Ben de o yaygıyı kestim ve ondan iki yastık yaptım, içlerini (hurma) lif (i) ile doldurdum. Bundan dolayı bana itiraz etmedi. Bu hadis; Buharî, bediu'l-halk, meğâzi; Müslim, libâs; Tirmizi. edeb; Nesâî. zînet; Muvatta: istizan; Ahmed b. Hanbel, III 90, IV. 28. dede var. İzah 4158 de",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 134
			}
		}
	]
}