{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"34": "Clothing (Kitab Al-Libas)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4153,
			"arabicnumber": 4153,
			"text": "Ebû Talha el-Ensârî'den rivâyet olunmuştur; dedi ki: Ben Peygamber (sallallahü aleyhi ve sellem)'i; Melekler, içerisinde köpek ve heykel bulunan eve girmezler\" işittim. (Ben bu hadisi rivâyet edince Zeyd b. Halid el-Cühenî bâna; haydi) bizi müminlerin annesi Âişe'ye götür, bu hadisi kendisine soralım, dedi. Bunun üzerine (Hazret-i Âişe'nin yanına) gittik ve; müminlerin annesi! Ebû Talha bize Resûlüllah (sallallahü aleyhi ve sellem)'dan şöyle (dediğini) rivâyet ediyor. (Gerçekten sen de) Resûlüllah (sallallahü aleyhi ve sellem)'i bunları söylerken (hiç) işittin mi? dedik. fakat (şimdi) size Hazret-i Peygamberi (bizzat) yaparken gördüğüm (buna benzer) bir işi anlatacağım. Resûlüllah (sallallahü aleyhi ve sellem), savaşlarından bir savaşa çıkmıştı. Ben onun savaşından dönmesini bekliyordum. Derken (yünden dokunmuş olan) bize ait bir yaygıyı genişçe bir tahtanın üzerine örttüm. (Hazret-i Peygamber) gelince kendisini karşıladım ve; Allah'ın Rasûlu! selâm, Allah'ın rahmet ve bereketi senin üzerine olsun, seni aziz ve kerim kılan Allah'a hamdolsun, dedim. Eve baktı ve yaygıyı gördü. Bana hiçbir cevap vermedi. Yüzünde bir memnuniyetsizlik (alâmeti) gördüm. Hemen yaygıya varıp onu yırttı, sonra şöyle buyurdu: Allah bize rızık olarak verdiği şeylerde (harcama yaparak) taşları, kerpiçleri giydirmenizi emretmedi.\" Âişe) dedi ki: Ben de o yaygıyı kestim ve ondan iki yastık yaptım, içlerini (hurma) lif(i) ile doldurdum. Bundan dolayı bana itiraz etmedi. bedü'l-halk 7, megâzi 12; Müslim, libâs 87; Tirmizi. ertcb 44; Nesâî. zînet 110; Muvatta: istizan 6; Ahmed b. Hanbel, III 90, IV. 28",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 134
			}
		}
	]
}