{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"35": "Combing the Hair (Kitab Al-Tarajjul)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4169,
			"arabicnumber": 4169,
			"text": "Muhammed b. İsa ve Osman b. Ebİ Şeybe'den; Cerîr, Mansur'dan; O, İbrahim den; İbrahim, Alkame'den, o da Abdullah (îbn Mes'ûd)'dan şöyle dediğini rivayet etmişlerdir. Dövme yapan ve yaptıran - Muhammed\"in rivayetine göre - saç ekleyen, - Osman'ın rivayetine göre - Yüzün kılını yolduran - Her ikisinin rivayetine göre - güzellik için dişlerini törpülettiren, Allah Azze ve Celle'nin yarattığı şeyi değiştiren kadınlara Allah lanet etsin. Bu haber, Beni Esad kabilesinden Ümmü Ya'kîıp denilen bir kadına -Osman, Kur'an okuyan bir kadın, dedi - ulaştı. Kadın Abdullah'a geldi ve \"senin, döğme yapan ve döğme yaptıran -Muhammed'in rivayetine göre, saç ekleyen, - Osman'ın rivayetine göre, yüzünün kılını yolduran, -Her ikisinin rivayetine göre, dişlerini torpilleten - Osman, güzellik için dişlerini torpületen, dedi. - Allah'ın yarattığı şeyi değiştiren kadınlara lanet ettiğini duydum.\" dedi.Abdullah: \"Rasûlullah'ın lanet ettiği kişiye, ben niçin lanet etmeyecekmişim? Üstelik bu Allah'ın kitabında da var.” Kadın: \"Ben Kur'anın iki kapağı arasına (Kur'anın tamamını) okudum, öyle bir şey bulamadım.\"Abdullah: \"Vallahi, eğer sen Kur'anı okusaydın onu bulurdun\" dedi. Sonra da; \"Rasûl size ne getirdi ise onu alın, sizi neden nehyetti ise de derhal vazgeçin\"[Haşr 17] ayetini okudu. Kadın: Ben bunların bir kısmını senin hanımında da görüyorum\" Abdullah: \"Gir (eve) bak\" Kadın eve girdi, sonra çıktı. Abdullah: \"Ne gördün?\" Osman'ın rivayetine göre - Kadın: \" Bir şey görmedim\" dedi. Abdullah; \"Eğer öyle (dediğin gibi) olsaydı o bizimle beraber olmazdı\" dedi. Diğer tahric: Buhari, Libas: Müslim, Libas: Nesaî, Ziyne: Tirmizî Edep: İbn Mace Nikah (1989)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 11
			}
		}
	]
}