{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"37": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4244,
			"arabicnumber": 4244,
			"text": "Sübey b. Hâlid şöyle demiştir: feth edildiği zaman Kırgızistan'ın meşhur bir geliridir. Muhkem bir şehir olduğu için, Sâhâbîler orayı Feth ederken büyük güçlüklerle karşılaşmışlardır. Küfe'ye gelmiştim. Oradan katır getiriyordum. Mescide girdim, bir de ne göreyim: İnsanlardan bir topluluk ve aralarında bir adam oturuyor. Onu gördüğümde Hicazlılar'dan birisi olduğun hemen anladım. Bu (zat) kim?\" dedim. Oradakiler bana asık bir suratla dik dik baktılar ve, Sen bunu bilmiyor musun? Bu Resûlüllah'ın (sallallahü aleyhi ve sellem)'in arkadaşı Huzeyfe b. El Yamân'dır\" dediler. (radıyallahü anh): İnsanlar Resûlüllah'ın (sallallahü aleyhi ve sellem)'j (Ümmeti için) hayırlı olan şeyleri sorarlardı. Ben ise şer olanını sorardım.\" dedi. Halk ona gözlerini dikti. (Dikkatle dinlemeye başladı.) devamla şöyle dedi: Ben size hoşlanmayacağınız şeyler haber vereceğim, Ben Resûlüllah (sallallahü aleyhi ve sellem)'e Yâ Resûlüllah, Allah'ın bize verdiği bu hayırdan sonra yine eskisi gibi şer olacak mı? Bana haber ver\" dedim. karşılığını verdi, korunma(nın yolu) nedir? (Savaş), sonra ne olacak Yâ Resûlüllah? yeryüzünde Allah'ın bir halifesi olursa, sırtına (haksız yere) vursa malını alsa bile ona itaat et, ama eğer Allah'ın halifesi bulunmazsa, o zaman ağaç kökü kemirerek (Issız bir yerde öl). Ne olacak, (Yâ Resûlüllah)? Deccâl çıkacak. Onunla birlikte bir nehir ve bir ateş bulunacak. Onun ateşine düşene Ecri (sevabı) verilecek, günahı silinecek, nehrine düşene ise günahı verilecek ve sevabı silinecek sonra ne var? sonra kıyamet kopacak. b. Hanbel V-387. 403",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 5
			}
		}
	]
}