{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"37": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4252,
			"arabicnumber": 4252,
			"text": "Sevban (radıyallahü anh)'den rivâyet edildi ki; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: Allah (celle celâluhu) benim için yer yüzünü dürüp topladı -Yahut \" Rabbim benim için yeryüzünü dürüp topladı.\" dedi. Bu şüphe râvîye aittir. doğusunu ve batısını gördüm. Bir nüshada, \" ..., bana göster’di şeklindedir. Şüphesiz benim ümmetimin hükümranlığı, dünya'dan benim için dürülüp toparlanan yere ulaşacak. Ayrıca bana kırmızı (altın) ve beyaz (gümüş) olan iki hazine verdi. Rabbim'den ümmetim için, onları genel bir kıtlıkla helak etmemesini, onlara kendilerinden başka bir düşman Mûsâllat edip de köklerini kazımamasını istedim. bana şöyle dedi: Yâ Muhammed, (sallallahü aleyhi ve sellem) Şüpesiz ben bir şeyi takdir ettiğim zaman, artık o geri çevrilmez. Ben, onları genel bir kıtlıkla helak etmeyeceğim. Onlar aleyhine dünyanın dört bucağından toplansalar bile, köklerini kazısın diye, başlarına kendilerinden başka bir düşmanı Mûsâllat etmem. Ta ki, birbirlerini helak etsinler ve birbirlerini esir etsinler.\" Ümmetim için ancak sapıtıcı (yoldan çıkartıp bid'atları emreden) liderlerden korkarım. Benim ümmetimin arasına kılıç girdi mi (iç kavgalar çıkınca), artık kıyamet gününe kadar bir daha çıkmaz. Ümmetimden bazı kabileler, müşriklere iltihak etmedikçe ve yine ümmetimden bazı kabileler putlara tapmadıkça kıyamet kopmaz. Şüpesiz, ümmetim içerisinden otuz tane yalancı çıkacak. Onların her biri kendisini peygamber sanacak. Halbuki, ben, Peygamberlerin sonuncusuyum. Benden sonra Peygamber yoktur. Benim ümmetimden bir grup da Allah'ın emri gelinceye kadar hak üzerine -İbn Îsa, \" Üstün olarak\" dedi. - devam edecek. -Sonra, iki râvî ittifak ettiler - Onlara muhalefet edenler kendilerine zarar vermeyecektir. Fiten 19; Tirmizî, Filen 32; İbn Mâce 9",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 13
			}
		}
	]
}