{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"41": "Types of Blood-Wit (Kitab Al-Diyat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4521,
			"arabicnumber": 4521,
			"text": "Sehl b. Ebi Hasme ve karninin büyüklerinden (bazı) adamlar haber verdiler ki: b. Sehl ve Muhayyisa başlarına gelen bir kıtlık yüzünden Hayber'e doğru yola çıktılar. Muhayyisa'ya gelinip, Abdullah b. Sehl'in öldürüldüğü ve bir kuyuya veya çukura atıldığı haber verildi. Avnü'l-Ma'bud'un izahı göz önünde tutularak, fiillerin meçhul okunuşuna göre yapılmıştır. Aynı cümleyi, fiilleri malum okuyarak, \" Muhayyisa gelip, Abdullah b. Sehl'in öldürüldüğünü ve bir çukura veya kuyuya atıldığını haber verdi\" şeklinde terceme etmekte mümkündür. Yahudilere gelip: Vallahi onu siz öldürdünüz\" dedi. Yahudiler de: Vallahi biz öldürmedik\" dediler. Bunun üzerine döndü ve kendi kavmine geldi. Olup biteni onlara haber verdi. Sonra da kendisinden büyük olan kardeşi Huveyyisa ve Abdurrahman b. Sehl ile birlikte geldiler. -Hayberde olan o idi- konuşmak için (Resûlüllah'a) gitti. Resûlüllah (sallallahü aleyhi ve sellem) yaşı kasderek \" büyült, büyült (büyüğünüz konuşsun)\" buyurdu. Bunun üzerine, Huveyyisa konuştu, sonra Muhayyisa konuştu. (sallallahü aleyhi ve sellem): (Yahudiler) ya arkadaşınızın diyetini verirler yada (Allah ve Rasûlüne) harb açtıklarını bildirirler\" buyurdu. Ayrıca bunu Yahudilere yazdı. Yahudiler de: Vallahi onu biz öldürmedik\" diye yazdılar. (sallallahü aleyhi ve sellem): Huveyyisa, Muhayyisa ve Abdurrahman'a: Yemin eder ve arkadaşınızın kanını hak eder misiniz?\" dedi. Hayır\" dediler. Resûlüllah: Sizin için Yahudiler yemin etsinler irsi?\" buyurdu. Onlar müslüman değiller\" dediler. Bunun üzerine, Resûlüllah onun diyetini kendi yanından verdi. Onlara, yüz dişi deve gönderdi. O kadar ki, develer evlerine kadar sokuldu. Sehl şöyle dedi: O develerden kırmızı bir deve beni tepti.\" diyât 12; Müslim, kasâme 6; Nesâi, kasâme 4; İbn Mâce, diyât 28",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 28
			}
		}
	]
}