{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"41": "Types of Blood-Wit (Kitab Al-Diyat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4555,
			"arabicnumber": 4555,
			"text": "Sâid b. Müseyyeb, Zeyd b. Sâbit'ten muğallaza diyet (Şibh-i amd diyeti) konusunda rivâyette bulundu ve önceki haberin benzerini, her guruptan eşit miktarlarla rivâyet etti. bölümdeki rivâyetler bâzı sahabelerin şibh amd için gerekli gördükleri diyeti söz konusu etmektedir. Eserler izaha ihtiyaç bırakmayacak şekilde açıktır. Müctehid ulemânın görüşleri de ilk hadisin açıklamasında belirtilmiştir. Yaşları Dâvûd der ki: Ubeyd ve (ulemâdan) daha başkaları şöyle dediler: Deve dört yaşına girince o hıkktır, dişisine hıkka denilir. Çünkü o, üzerine binilecek ve yük vurulacak kıvamdadır. Beş yaşma girdiğinde ceza'dır, dişisi cezeadır. Altı yaşına girer de ön dişlerden birisini atarsa o semdir, dişisine de seniyye denir. Yedi yaşına girdiğinde raba ve rabâıyyedir. Sekiz yaşına girer de rabâiyye (köpek dişi ile ön dişler arasındaki diş) den sonraki dişi atarsa o sedes ve sedestir. Dokuz yaşına girer de köpek dişi görünürse o bâzilâir. On yaşına girdiğinde de muhliftir. Bundan sonra artık devenin adı yoktur. Ancak, bir yıllık bâzil, iki yıllık bâzil, bir yıllık muhlif, iki yıllık muhlifilâ ahırih- denilir, b. Şümeyl: Bir seneliğe bintü mehaz, iki seneliğe hintü lehûn, üç seneliğe hıkka, dört yaşındakine cezea, beş yaşındakine sent, altı yaşındakine rabâ, yedi yaşındakine sedîs, sekiz yaşındakine de bâzil denilir, demiştir. Hatim ve el-Esmâi de şöyle derler: Ceıûa bir vakittir, yaş değildir. Hatim: Bazılarının şöyle dediklerini söyler: Rabâıyyesini (köpek dişi ile ön dişler arasındaki diş) attığı zaman raha , ön dişini attığında da senidir. Ubeyd şöyle der; Hamile kaldığı zaman halifedir ve on aya kadar böyledir. On aya varınca adı; Uşerâ olur. Hatim; Ön dişini attığı zaman sent, ön dişle köpek dişi arasındaki dişini attığında da rabâ dır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 62
			}
		}
	]
}