{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"41": "Types of Blood-Wit (Kitab Al-Diyat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4564,
			"arabicnumber": 4564,
			"text": "(Ebu Dâvûd şöyle der: rivâyeti) Seyhan'dan yazdığım kitabımda bulduğum halde kendisinden işitmedim. Onu bize güvenilir bir dostumuz olan Ebûbekir haber verdi. O şöyle dedi: Bize Şeyban haber verdi, bize Muhammed -yani İbn Raşid- Süleyman'dan- yani İbn Mûsâ'dan- haber verdi. O, Amr b. Şuayb'dan, Amr de babası vasıtasıyla dedesinden şöyle rivâyet etti: Resûlüllah (sallallahü aleyhi ve sellem) hatâen öldürmenin diyetini köylülere dört yüz dinar altın veya ona mukabil gümüş olarak takdir ederdi. Onu takdir ederken deve fiyatlarını esas alırdı. Deve pahalanınca diyeti (altın ve gümüş olarak) artırır, ucuzladiğırida da azaltırdı. Resûlüllah zamanında (deve fiyatları) dört yüz dinarla sekizyüz dinar arasında oynuyordu. Onun gümüşten karşılığı da sekizbin dirhemdi. (sallallahü aleyhi ve sellem) sığır sahiplerine (tam diyeti) ikiyüz sığır olarak takdir etti. Diyeti koyundan ödeyenler de iki bin koyun verirler. (sav) \" Diyet, maktulün varisleri arasında, yakınlık derecesine göre mirastır. Artan olursa (farz sahiplerinden artarsa) o asabeye aittir.\" buyurdu. (sallallahü aleyhi ve sellem) burunda; tamamı kesildiği zaman tam diyet, ucu veya bir tarafı kesildiğinde yarım diyete hükmetti ki o da; elli deve veya onun mukabili altın yahut gümüş yada yüz sığır veya bin koyundur. El kesildiğinde yarım diyete, ayak kesildiğinde yarım diyete me'mûme (et kesilip beyin ile kemik arasındaki zarı meydana çıkaran yaralama, buna âmme de denilir) de otuz üç tam ve üçte bir deve veya onun kıymetinde altın, gümüş, sığır yada koyuna, câife (karın boşluğuna kadar ulaşan yara) de de aynısına hükmetti. Parmaklarda herbir parmak için on deve, dişlerde de herbir diş için beş deve diyet vardır. (sallallahü aleyhi ve sellem) kadının diyetinin, (farz sahiplen olan) varislerinden artandan başka miras alamayan asabesi ayasında ortak olduğuna hükmetti. (Bir kadın bir cinayet işlerse, cinayetin diyetini asabesi öder.) Eğer bir kadın öldürülürse onun diyeti varisleri arasında taksim edilir. Onlar, katillerini nüshalarda: kadının katili\" mânâsına gelecek hiçimde \" katilehâ\" şeklindedir. Bu daha uygundur. (kısas olarak) öldürür. Ölümünü izleyebilirler. (sallallahü aleyhi ve sellem): Maktulün vârisi yoksa bile katil on (un mirasından veya diyetin) den birşey alamaz. Onun varisi, insanların kendisine en yakın olanıdır. Katil, (öldürdüğü kişiden) hiçbir şeye varis olamaz\" buyurdu. Mace. diyet 6. (b. Raşid) şöyle dedi: tamamını bana Süleyman b. Mûsâ Amr b. Şuayb'tan, o babasından o da kendi babası vasıtasıyla Resûlüllah'tan haber verdi. Ebû Dâvûd der ki: Muhammed b. Raşid Dimeşk (Şam) lıdır. Katilden, Basraya kaçmıştır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 71
			}
		}
	]
}