{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"42": "Model Behavior of the Prophet (Kitab Al-Sunnah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4659,
			"arabicnumber": 4659,
			"text": "Amr b. Ebî Kurre'den (rivâyet olunmuştur); dedi ki: Huzeyfe Medayin'de idi ve Resûlüllah (sallallahü aleyhi ve sellem)'ın öfke halinde sahabilerinden bazı kimseler için sarfetmiş olduğu sözleri (halka) aktardı. Bunları Hıızeyfe'den dinleyenlerden bazıları da gider Selman'a haber verir ve Huzeyfe'den duyduklarını ona anlatırlardı. Selman da \" Huzeyfe söylediği (sözün doğruluk derecesi) ni (benden) daha iyi bilir\" derdi. Sonra da Huzeyfe'ye gelip: Senin sözlerini Selman'a anlattık. Seni ne tasdik etti ne de tekzib etti.\" derlerdi. Huzeyfe (bir gün) sebze tarlasında bulunan Selman'a varıp; Ey Selman benim Resûlüllah (sallallahü aleyhi ve sellem)'dan duyduklarımı tasdik etmekten seni engelleyen (sebep) nedir? dedi. Hazret-i Selman da (ona şöyle) cevap verdi: Gerçekten Resûlüllah (sallallahü aleyhi ve sellem) (bazan) öfkelenirdi ve öfkeli iken sahabilerinden bazıları hakkında (bazı ağır) sözler söylerdi. Bazan da hoşnut olur ve hoşnutluk halinde sahabilerinden bazıları hakkında (sitayişkâr) sözler söylerdi. Artık sen (Hazret-i Peygamberden her duyduğun sözü nakletmeye) bir son vermiyor musun? (Eğer sen bu rivâyetlerine devam edersen) Bazı kimseler (in kalbin)e bazı kimselerin sevgisini, bazı kimseler (in kalbin) de bazılarının nefretini aşılarsın ve neticede bazı anlaşmazlıkların ve bölünmelerin meydana gelmesine sebep olursun. Oysa sen Resûlüllah (sallallahü aleyhi ve sellem)’ın bir hutbesinde: Ben, öfkeli iken Ümmetimden herhangi bir kimseye sitem ya da beddua edersem (bu bir insanlık halidir); çünkü ben de Adem oğullarından biriyim. (Binaenaleyh) onların öfkelendiği gibi (bazan) ben de öfkelenirim (fakat, Allah) beni alemlere sadece rahmet için göndermiştir. (Bu sebeple ben rabbime: Ey Allah'ım, ben ancak bir beşerim, Müslümanlardan herhangi birisine, hakketmediği halde beddua ya da sitem edersem) kıyamet gününde bunu onun için bir rahmet kıl (diye dua ettim. Rabbim de bu duamı kabul etti)\" dediğini bilmektesin. Allah'a yemin olsun ki ya bu sözlerine son verirsin ya da (bunu) Ömer'e mektupla bildireceğim.\" davat 34: Müslim, birr, 88, 89,91,92,94; Darimi, rikak 52; Ahmed b. Hanbel. II. 390. 488. 496; II. 333. 384. 391. 400; V. 294. 437. 439; VI. 45",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 64
			}
		}
	]
}