{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"42": "Model Behavior of the Prophet (Kitab Al-Sunnah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4726,
			"arabicnumber": 4726,
			"text": "(Cübeyr İbn Muhammed İbn Cübeyr İbn Mut'im'in) dedesinden (Cübeyr İbn Mut'im'den) rivâyet edilmiştir, dedi ki: Hazret-i Peygamberin huzuruna bir çöl arabı gelip: Ey Allah'ın Rasulü, canlar son derece sıkıntıya girdi, çocuklar can verdi, mallar azaldı, hayvanlar helak oldu. Bizim için Allah'dan yağmur iste. Biz (yağmurumuzun yağdırılması için) seni Allah'a şefaatçi kılıyoruz. Allah'ı da sana şefaatçi kılıyoruz\" dedi. Resûlüllah (sallallahü aleyhi ve sellem) de! \" Vay, yazık sana! Sen ne dediğini biliyor musun?\" buyurdu. Sonra: Sübhanallah\" dedi ve \" sübhanallah\" demeye devam etti. Nihayet (Hazret-i Peygamberin öfkesinin, gazab-ı ilahinin nüzulüne sebep olabileceğinden endişe edildiği için) bu (öfkeden duyulan endişenin izleri orada bulunan) sahabilerinin yüzünde de belirmeye başladı. Sonra (tekrar): vay sana!: (şunu iyi bil ki) Allah yarattıklarından hiçbirisi için aracı kılınamaz. Allah'ın şanı bundan yücedir. Vay sana! Sen Allah kimdir biliyor musun? Onun Arşı semâvâtı üzerinde şu şekildedir\" buyurdu ve parmak (larıyla) la (el boşluğu) üzerinde kubbe gibi bir şekil yaptı ve: Muhakkak ki Arş Allah'(ın azametin) den (dolayı) semerin süvari(nin ağırlığın)dan (dolayı) gıcırdadığı gibi gıcırdar\" buyurdu. İbn Beşşar bu hadisi \" Allah Arşının üstündedir Arşı da göklerinin üstündedir\" diye rivâyet etti (ve sonra hadisin geri kalan kısmını) nakletti. İbnu'l Müsennâ ve İbn Beşşâr; Ya'kub b. Utbe ile Cubeyr b. Muhammed b. Cûbeyr'den, o babasından, o dedesinden\" diyerek aynı hadisi naklettiler. Dâvûd dedi ki): Hadisin Ahmed b. Said'in isnadı (ile gelen rivâyeti) sahih olandır. Aralarında Yahya b. Main ile Ali b. el-Medîm nin de bulunduğu bir topluluk, bu hususta ona muvafakat etmişlerdir. Ayrıca bir başka topluluk, bunu, -yine Ahmed'in dediği şekilde- \" İbn İshak'tan\" (diyerek) rivâyet etmişlerdir. Bana ulaştığına göre, Ahdula'lâ, İbnu’l-Müsennâ ile İbn Beşşâr'in semalan (hocalarından hadis dinlemeleri) aynı nüshadan imiş",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 131
			}
		}
	]
}