{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"42": "Model Behavior of the Prophet (Kitab Al-Sunnah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4749,
			"arabicnumber": 4749,
			"text": "Abdüsselâm İbn Ebi Hazim (yani) Ebû Talut dedi ki: Ben Ebû Berze'yi (Yezid İbn Muaviye'nin Kûfe'ye emir olarak tayin ettiği) Ubeydullah İbn Ziyad'ın yanına girerken gördüm. (Fakat onunla birlikte Ubeydullah'ın yanına girmediğim için aralarından geçen konuşmayı dinleyemedim. Ancak bu konuşmayı) bana falanca (zat) nakletti... Ebû Dâvûd der ki: Aslında bu hadisi bana nakleden şeyhim Müslim (İbn İbrahim) bu zatın ismini açıklamıştı (ama ben onu unuttum) ve (bu zat Ubeydullah İbn Ziyad'ın tabilerinden olan) cemaattendi (sözü geçn zat olayı söyle anlattı): Ebû Berze'yi görünce (etrafındakilere) onu göstererek \" Sizin Muhammed'e mensub olan sahabiniz işte şu kısa boylu ve şişman adamdır\" dedi. Şeyh (Ebû Berze, dolayısıyla Hazret-i Peygamberin sahabilerine ve dolayısıyla Hazret-i Peygambere hakaret etmek istediğini) derhal anladı ve: Muhammed (sallallahü aleyhi ve sellem)’le olan sohbetimden dolayı beni ayıplayan bir toplumun yanında kalacağımı (böyleleri ile karşılaşacağımı) zannetmiyordum\" dedi. üzerine Ubeydullah (sözü değiştirip): Şüphesiz Muhammed (sallallahü aleyhi ve sellem)'in sohbetinde bulunmak senin için bir zînettir (asla) ayıp değildir. Ben seni havuz hakkında (bildiklerini) sormak için (buraya) çağırmıştım. (Hakikaten) sen (hiç) Resûlüllah (sallallahü aleyhi ve sellem)'i bu mevzuda bir şeyler söylerken işittin mi?\" dedi. Ebû Berze (radıyallahü anh)'de; Evet\" (hem de pek çok defalar işittim, öyle) bir defa, iki defa, üç defa, dört defa, beş defa değil. Havuzu (n varlığını ve bu mevzudaki hadisleri) yalan sayan kimseyi Allah ondan içirmesin\" dedi. Sonra öfkeli olarak çıkıp gitti. b. Hanbel, IV, 419. 421,424-426",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 154
			}
		}
	]
}