{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"42": "Model Behavior of the Prophet (Kitab Al-Sunnah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4768,
			"arabicnumber": 4768,
			"text": "Zeyd İbn Vehb el-Cüheni (nin) haber verdi (ğine göre); kendisi Hariciler üzerine yürüyen ve Ali (radıyallahü anh)'in maiyyetinde olan bir askeri birlik içinde bulunuyormuş (da) Ali (radıyallahü anh) (şöyle) demiş: Ey İnsanlar ben Resûlüllah (sallallahü aleyhi ve sellem)'ı (şöyle) derken işittim: Ümmetimden öyle bir kavim zuhur edecek ki Kur'ân okuyacaklar da sizin okuyuşunuz (zahiren) onlarınkine (nisbetle) hiç kalacak. Namazınızda (zahiren) onların namazı yanında hiçbir şey olmayacak. Orucunuz onların orucuna nispetle birşey olmayacak. Kur'âni kendi lehlerine zanniyle okuyacaklar. Halbuki Kur'ân onların aleyhine olacak, namazları gırtlaklarını geçmeyecek, İslâmiyetten okun avı delip geçtiği gibi çıkacaklar. Eğer onlarla harb edecek olan ordu, (onlarla yapacakları savaştan dolayı) Peygamberleri diliyle kendilerine takdir edilen ecri bilselerdi, (yapacakları) bu işe (Allah katındaki değerinin büyüklüğüne tam manasıyla) güvenirlerdi (de bütün gayretlerini ona verirlerdi). Bu kavmin alameti içlerinde pazusu olup, kolu olmayan ve üzerinde beyaz kıllar bulunan pazusunda meme uçları gibi bir çıkıntısı bulunan bir adamın olmasıdır.\" (Bu durumda) siz (şimdi) çoluk çocuğunuza ve mallarınıza sizin adınıza halef olacak olan bu kimseleri bırakıp da Muaviye ve Şam halkı üzerine mi gideceksiniz? yemin olsun ki: (Hazret-i Peygamberin çıkacaklarını haber verdiği) o (kötü) kavmin (karşımızda bulunan ve Hariciler diye anılan) şu kavim olduğunu ümid ediyorum, Çünkü onlar (dökülmesi) haram olan kanı döktüler, halkın merada yayılan hayvanlarım gasbettiler. Öyleyse siz besmeleyle (onların üzerine) yürüyünüz. Küheyl dedi ki: Zeyd İbn Vehb bana (ordunun konakladığı) yerleri birer birer anlattı (ve şöyle dedi): Nihayet bir köprünün üzerine vardık. (Onlarla) Karşılaşınca (bir de baktık ki); Haricilerin başında (bulunan) Abdullah İbn Vehb er-Râsibî'dir. (Abdullah İbn Verîb) Haricilere \" Mızraklarınızı bırakın da (onlarla daha yakından savaşmak üzere) kılıçlarınızı (kınlarından) çekiniz. Çünkü ben (karşımızdakilerin) Harura gününde olduğu gibi size (Allah adına) ant vererek sizi barışa davet edeceklerinden korkuyorum.\" dedi. Onlar da mızraklarını atıp kılıçlarını sıyırdılar; derken (Hazret-i Ali safında bulunan) halk onlara mızraklarını sapladılar ve Haricileri üst üste öldürdüler. Neticede o gün (Hazret-i Ali safındaki) cemaatten sadece iki kişi öldürüldü. (Nihayet) Hazret-i Ali (harbin sonunda) \" Öldürülenler arasında (alamet olarak bulunan) sakat adamı arayınız, buyurdu. (Aradılar fakat) bulamadılar. Bunun üzerine Hazret-i Ali bizza. (ayağa) kalkıp üstüste öldürülen insanların yanına geldi ve onları bulundukları yerlerden çıkarınız dedi, sonra onu yere gelen cesetler arasında buldular. Ali (radıyallahü anh) tekbir getirdi ve: Allah doğru söyler, Rasulü de doğruyu tebliğ eder.\" dedi, o sırada Abidetü's-Selmanî Hazret-i Ali'nin yanına varıp: Ey mü'minlerin emiri! Kendisinden başka ilah olmayan Allah hakkı için (söyle)! Sen hakikaten bu hadisi Resûlüllah (sallallahü aleyhi ve sellem)'den işittin mi?\" diye sordu. Hazret-i Ali'de: Evet kendisinden başka ilah olmayan Allah'a yemin olsun ki (ben bu hadisi bizzat Hazret-i Peygamberin ağzından işittim)\" dedi. Abîde, Hazret-i Ali'den üç defa yemin istedi. Hazret-i Ali de yemin etti. zekât 156, 157; Ahmed b. Hanbel I, 88 92, 141",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 173
			}
		}
	]
}