{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"2": "Prayer (Kitab Al-Salat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 498,
			"arabicnumber": 498,
			"text": "Ebû Umeyr b. Enes, Ensârdan olan amcalarından birinin şöyle dediğini rivâyet etmiştir: (sallallahü aleyhi ve sellem)’in zihni halkı namaza nasıl toplayabileceği meselesiyle (meşgul) idi. Kendisine \" namaz vakti girince bir bayrak dik, onu görenler birbirlerine haber verirler\" denildi. Fakat, o, bu teklifi beğenmedi. Kurî ( çi )\" dan yani borudan söz edildi. Râvilerden Ziyâd bunun Yahudilere ait ibâdete davet borusu olduğunu bildirmiştir. Nebi (sallallahü aleyhi ve sellem) bunu da beğenmedi ve \" bu Yahudilerin işidir\" buyurdu. (Ravi) Ebû Umeyr (yahut amcası) demiştir ki; Resûl-i Ekrem (sallallahü aleyhi ve sellem)'e (bir de) çan (çalınması) teklif edildiyse de Resûl-i Ekrem (sallallahü aleyhi ve sellem) \" Bu, hıristiyan işidir\" buyurdu. Abdullah b. Zeyd Resûlüllah (sallallahü aleyhi ve sellem)’in üzüntüsünü içinde hissederek oradan ayrıldı (gece), rü'yasında kendisine ezan gösterildi. Sabahleyin hemen Resûlüllah (sallallahü aleyhi ve sellem)'a gelerek; Ben uyku ile uyanıklık arasında iken bir de baktım ki, birisi geldi bana ezanı öğretti\" diyerek rüyasını nakletti. Ebû Umeyr (yahut amcası) dedi ki, \" Halbuki Ömer b. el-Hattâb (radıyallahü anh) bu rü'yayı yirmi gün evvel görmüş (fakat gördüğünü) saklamıştır. Râvi Umeyr (veya amcası) dedi ki, sonra da (Ömer rü'yasını) Resûlüllah (sallallahü aleyhi ve sellem)’a nakletti. Resûl-i Ekrem (sallallahü aleyhi ve sellem) de ona; Bunu bana daha evvel neden haber vermedin?\" buyuranca, Ömer (radıyallahü anh) şöyle cevap verdi: b. Zeyd benden erken davrandı. Ben de utandım. Resûlüllah (sallallahü aleyhi ve sellem) de: Ya Bilal, kalk da bak Abdullah b. Zeyd sana ne söylerse ezberle ve aynen icra eyle\" buyurdu. (Râvi) dedi ki: Bilal (ilk) ezanı (böylece) okudu.\" Ebû Dâvûd rivâyet etmiştir. Bişr dedi ki: Bana Ebû Umeyr'in haber verdiğine göre, Ensâr; Şayet Abdullah b. Zeyd o gün hasta olmasaydı, Peygamber (sallallahü aleyhi ve sellem) O'nu müezzin yapardı\" derlerdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 108
			}
		}
	]
}