{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"2": "Prayer (Kitab Al-Salat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 506,
			"arabicnumber": 506,
			"text": "Amr b. Murre, \" İbn Ebî Leylâ'yı (şöyle derken) işittim\" demiştir: üç kere değişiklik geçirmiştir. Sahâbe(-i kiram efendilerimiz bize (şunları) naklettiler: (sallallahü aleyhi ve sellem) buyurdu (ki); (Bütün) müslumanların yahut mü’minlerin namazının tek (cemaatte kılınmış) olması beni memnun eder. Hatta bütün evlere namaz vakit(inin girdiği)ni ilân edecek adamlar göndermeyi (bile) düşündüm. Ve hatta (bazı) kişilere damların üzerine dikilip namaz vakti(nin girdiği)ni ilân etmelerini emretmeyi kalbimden geçirdim.\" Hatta (neredeyse bu maksatla) çan çalacaklardı. (İbn Ebî Leylâ) der ki: Ensârdan bir adam geliverdi: Resûlallah (sallallahü aleyhi ve sellem) seni tasalı olarak gördüğümden dolayı eve döndüğümde (rü'yamda) üzerinde sanki iki yeşil elbise bulunan bir adam gördüm mescidin üzerine dikilip ezan okudu, sonra birazcık oturup (tekrar) ayağa kalktı, aynı şeyleri söyledi. Ancak (bu defa fazladan olarak) namaz başladı diyordu. Eğer insanlar(ın bu yalancıdır) demeleri (korkusu) olmasaydı\" muhakkak ki ben uykuda değildim, uyanıktım derdim dedi. Müsennâ (bu cümleyi); sizin’bu yalancıdır' demeniz korkusu olmasaydı\" (şeklinde rivâyet etmiştir) Resûlüllah (sallallahü aleyhi ve sellem) buyurdu ki; Vallahi Allah (celle celâluhu) Sana hayrı göstermiştir\" . (Bu cümleyi) İbn Müsennâ rivâyet etmiştir. (Diğer râvi) Amr ise, mevzuu bahs (etmemiştir) Resûlüllah, \" Bilâl'e öğret ezan okusun\" buyurdu. (Yine İbn Ebî Leylâ) der ki: Ömer onun gördüğünün benzerini ben de gördüm lâkin (haber vermekte) geciktiğim için (söylemeye) utandım\" dedi. Kiram efendi)lerimiz(in) bize haber verdiğine göre (önceleri) bir adam (cemaate) geldiği zaman (namazın imamla kaç rekatinin kılındığım) sorardı ve kendisine namazdan (kaç rekate) geç kaldığı haber verilirdi. Resûlüllah ile beraber namaz kılan cemaat(ın kimisi) kıyamda, (kimisi) rükûda, (kimisi) oturuşta, (kimisi de) Resûlüllah (sallallahü aleyhi ve sellem) ile aynı halde olurdu. dedi ki; Amr \" Bana bunu (bu rivâyeti) bir de Husayn İbn Ebî Leylâ'dan nakletti\" demiştir. (Derken bir gün) Muaz (cemaate) çıkageldi ve (-Şu'be der ki, ben bunu bir de Hüsayn'den dinlemiştim-) Muaz'ın, \" Ben Resûlüllah'ı (namazda) hangi halde görürsem- (diye başlayan)\" , Resûlüllah'ın \" siz de böyle yapınız\" demesine kadar devam eden sözünü nakletti. Dâvûd buyurdu ki: Sonra Amr b. Merzûk hadisine dönüyorum (bu rivâyette) İbn Ebi Leylâ diyor ki: gün) Muâz (cemaate) geldi, -daha önce cemaatle kaç rekât namazın kılınmış olduğunu- kendisine işaret ettiler. (Şu'be der ki, ben bunu bir de Husayn'dan dinlemiştim.) (İbn Ebî Leylâ rivâyetine devamla) dedi ki: Muâz (radıyallahü anh); Ben O'nu (Resûlüllahı) hangi halde görürsem göreyim o haline uyarım\" dedi. Resûlüllah da (sallallahü aleyhi ve sellem) buyurdu ki: Muâz sizin için bir yol açtı, siz de böyle yapınız.\" bize naklettiğine göre: Resûlüllah Medine'ye gelince müslümanlara (her ay) üç gün oruç tutmayı emretti. Sonra Ramazanın (orucuyla ilgili âyet-i kerime) indirildi. (Medine'li müslümanlar) oruca alışmamış bir toplum idiler, oruç onlara çok zor geliyordu. (Bu yüzden) oruç tutamayan kimse (tutamadığı gün için) bir fakiri doyuruyordu. Sonra \" Sîz mü'minlerden her kim bu (mübarek) ayda hazır bulunursa (veya bu mübarek aya şahid olursa) bunda oruç tutsun \" el-Bakara (2), 185. âyeti nazil olunca oruç tutma ruhsatı sadece müsâfir ve hastalar için (geçerli) oldu. (Bunun dışındakiler) oruç tutmakla emrolundular. Ebî Leylâ der ki; (Bazı) sahabelerimiz (radıyallahü anh) bize rivâyet etti ki; (başlangıçta) bir kimse iftar zamanına erişir de yemek yemeden önce uyuyakalırsa bir daha yiyemez, oruçlu halde sabahlardı. bir sahabe şöyle) dedi: Ömer (radıyallahü anh) (eve) gelip karısını(n yatağına gelmesini) istedi. O da; (ben yemek yemeden) uyudum, dedi. Ömer karısının bahane uydurduğunu zannederek kendisine yaklaştı. (Bir de) ensârdan bir adam (evine) geldi (iftar vakti) yemek istedi (ev halkı) \" sana birşey ısıtana kadar (bekle)\" dediler, o da (yemeden) uyuyakaldı. Bunun üzerine Resûlüllah'a şu âyet-i kerime indi: Oruç gecesi kadınlarınıza yaklaşmanız size helâl kılındı.\" el-Bakara, 187",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 116
			}
		}
	]
}