{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"2": "Prayer (Kitab Al-Salat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 506,
			"arabicnumber": 506,
			"text": "Amr b. Murre, \"İbn Ebî Leyla'yı (şöyle derken) işittim\" demiştir: Namaz üç kere değişiklik geçirmiştir. Sahabe(-i kiram efendilerimiz bize (şunları) naklettiler: Resulullah (Sallallahu aleyhi ve Sellem) buyurdu (ki); \"(Bütün) müslumanların yahut müzminlerin namazının tek (cemaatte kılınmış) olması beni memnun eder. Hatta bütün evlere namaz vakit(inin girdiği)ni ilan edecek adamlar göndermeyi (bile) düşündüm. Ve hatta (bazı) kişilere damların üzerine dikilip namaz vakti(nin girdiği)ni ilan etmelerini emretmeyi kalbimden geçirdim.\" Hatta (neredeyse bu maksatla) çan çalacaklardı. (İbn Ebî Leyla) der ki: Ensardan bir adam geliverdi: Ya Resulallah (Sallallahu aleyhi ve Sellem) seni tasalı olarak gördüğümden dolayı eve döndüğümde (rü'yamda) üzerinde sanki iki yeşil elbise bulunan bir adam gördüm mescidin üzerine dikilip ezan okudu, sonra birazcık oturup (tekrar) ayağa kalktı, aynı şeyleri söyledi. Ancak (bu defa fazladan olarak) namaz başladı diyordu. Eğer insanlar(ın bu yalancıdır) demeleri (korkusu) olmasaydı\" muhakkak ki ben uykuda değildim, uyanıktım derdim dedi. (İbn Müsenna (bu cümleyi); \"sizin \"bu yalancıdır\" demeniz korkusu olmasaydı\" (şeklinde rivayet etmiştir) Resulullah (Sallallahu aleyhi ve Sellem) buyurdu ki; \"Vallahi Allah (c.c.) Sana hayrı göstermiştir\". (Bu cümleyi) İbn Müsenna rivayet etmiştir. (Diğer ravi) Amr ise, mevzuu bahis (etmemiştir) Resulullah, \"Bilal'e öğret ezan okusun\" buyurdu. (Yine İbn Ebî Leyla) der ki: \"Ömer onun gördüğünün benzerini ben de gördüm lakin (haber vermekte) geciktiğim için (söylemeye) utandım\" dedi. Sahabelerimiz(in) bize haber verdiğine göre (önceleri) bir adam (cemaate) geldiği zaman (namazın imamla kaç rekatinin kılındığını) sorardı ve kendisine namazdan (kaç rekate) geç kaldığı haber verilirdi. Resulullah (Sallallahu aleyhi ve Sellem) ile beraber namaz kılan cemaat(ın kimisi) kıyamda, (kimisi) rükuda, (kimisi) oturuşta, (kimisi de) Resulullah (Sallallahu aleyhi ve Sellem) ile aynı halde olurdu. İbnu'l-Müsenna, dedi ki; Amr \"Bana bunu (bu rivayeti) bir de Husayn İbn Ebî Leyla'dan nakletti\" demiştir. (Derken bir gün) Muaz (cemaate) çıkageldi ve (-Şu'be der ki, ben bunu bir de Hüsayn'den dinlemiştim-) Muaz'ın, \"Ben Resulullah'ı (namazda) hangi halde görürsem... (diye başlayan)\", Resulullah'ın \"siz de böyle yapınız\" demesine kadar devam eden sözünü nakletti. Ebu Davud dedi ki: Sonra Amr b. Merzuk hadisine dönüyorum (bu rivayette) İbn Ebi Leyla diyor ki: (Bir gün) Muaz (cemaate) geldi, -daha önce cemaatle kaç rekat namazın kılınmış olduğunu- kendisine işaret ettiler. (Şu'be der ki, ben bunu bir de Husayn'dan dinlemiştim.) (İbn Ebî Leyla rivayetine devamla) dedi ki: Muaz (r.a.); \"Ben O'nu (Resulullahı) hangi halde görürsem göreyim o haline uyarım\" dedi. Resulullah da (s.a) buyurdu ki: \"Muaz sizin için bir yol açtı, siz de böyle yapınız.\" Sahabe(lerimiz)in bize naklettiğine göre: Resulullah Medine'ye gelince müslümanlara (her ay) üç gün oruç tutmayı emretti. Sonra Ramazanın (orucuyla ilgili ayet-i kerime) indirildi. (Medine'li müslümanlar) oruca alışmamış bir toplum idiler, oruç onlara çok zor geliyordu. (Bu yüzden) oruç tutamayan kimse (tutamadığı gün için) bir fakiri doyuruyordu. Sonra \"Sîz mü'minlerden her kim bu (müba­rek) ayda hazır bulunursa (veya bu mübarek aya şahid olursa) bunda oruç tutsun\"[Bakara 185] ayeti nazil olunca oruç tutma ruhsatı sadece müsafir ve hastalar için (geçerli) oldu. (Bunun dışındakiler) oruç tutmakla emrolundular. İbn Ebî Leyla der ki; (Bazı) sahabelerimiz (r.a.) bize rivayet etti ki; (başlangıçta) bir kimse iftar zamanına erişir de yemek yemeden önce uyuyakalırsa bir daha yiyemez, oruçlu halde sabahlardı. (Yine bir sahabe şöyle) dedi: Ömer (r.a.) (eve) gelip karısını(n yatağına gelmesini) istedi. O da; (ben yemek yemeden) uyudum, dedi. Ömer karısının bahane uydurduğunu zannederek kendisine yaklaştı. (Bir de) ensardan bir adam (evine) geldi (iftar vakti) yemek istedi (ev halkı) \"sana birşey ısıtana kadar (bekle)\" dediler, o da (yemeden) uyuyakaldı. Bunun üzerine Resulullah'a şu ayet-i kerime indi: \"Oruç ge­cesi kadınlarınıza yaklaşmanız size helal kılındı.”[Bakara 187]",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 116
			}
		}
	]
}