{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"43": "General Behavior (Kitab Al-Adab)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5063,
			"arabicnumber": 5063,
			"text": "Ebu'l Verd b. Sümame'den (rivayet edildiğine göre, Bir gün Hz. Ali (b. Ebi Tâlib, Ali) b. A'bed'e şöyle demiş: Sana kendimden ve Rasûlullah (s.a.v.)'in kızı Fatima'dan bahsedeyim. O Hz. Nebi'in aile fertleri arasında en çok sevdiği kimse idi ve benim yanımda (fakir bir hayat sürüyor) idi. O (eliyle) değirmen çekerdi hatta değirmen elinde iz bırakmıştı. Tulumla (eve) su çekerdi, hatta (tulumun ipleri) boynunda iz yapmıştı. Ve evi (kendi elleriyle) süpürürdü, öyle ki elbisesi toz toprak içinde kalmıştı. (Yemek) tencere (sinin altında ateş) yakardı da elbiseleri islenmişti. Bu sebeplerden dolayı onun başına (birçok) sıkıntı (lar) gelmişti). Derken (birgün) Nebi (s.a.v.)'e bir takım kölelerin getirilmiş olduğunu işittik. Bunun üzerine ben (kendisine): Babana gitsen de ondan (günlük işlerinde) senin çalışmana gerek bırakmayacak bir hizmetçi istesen dedim. O da (kalktı) Hz. Nebi'e vardı. Hz. Nebi'in yanında onunla konuşan bir takım insanları görünce (derdini anlatmaktan) utanıp geri döndü. (Ertesi günü) kuşluk vakti (Hz. Nebi) yanımıza çıkageldi. Biz yorganlarımızın içinde idik. Hz. Fatıma'nın başı ucuna oturdu. Hz. Fatıma babasından utandığı için başını yorganının içine çekti. Bunun üzerine (Hz. Nebi) O'na: Muhammed ailesine olan dünkü ihtiyacın ne idi? diye (iki defa) sordu. (Hz. Fatıma da) her ikisinde de sükût etti. Bunun üzerine ben (söze başladım): Ey Allah'ın Resulü, Allah için sana ben cevap vereyim: Bu (kadıncağız) benim yanımda (fakirlikten dolayı) un öğütmek için kendi elleriyle değirmen çekmektedir. Öyle ki (değirmen) eline iz yaptı. Tulum ile su taşıdı da (tulum) boynunda iz bıraktı. Ev süpürdü, elbiseleri toz toprak içinde kaldı. (Yemek) tencere(sinin altında nefesiyle ateş) yaktı da elbiseleri is içerisinde kaldı. Bu esnada bize, sana bir takım kölelerin, ya da hizmetçilerin- geldiği (haberi) ulaştı. Ben de kendisine: Git ondan (bir hizmetçi de) iste, dedim....\" (daha sonra Ebu'l-Verd bir önceki 5062.) el-Hakem hadisinin manasını daha uzun olarak rivayet etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 291
			}
		}
	]
}