{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"2": "Prayer (Kitab Al-Salat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 507,
			"arabicnumber": 507,
			"text": "Muâz b. Cebel (radıyallahü anh)'den nakledilmiştir ki; Namaz ve oruç üç kere değişikliğe uğramıştır. Nasr (b. el-Muhâcir bu değişikliklerle ilgili) hadisin tamamım nakletmiştir. İbnü'l-Müsennâ (bu hadisin) sadece (Müslümanların) Beyt-i Makdis'e doğru namaz kılmaları (ile ilgili) kısmını nakletmiştir. (İbnu'l-Müsennâ) der ki; (Namazın değişmesiyle ilgili) üçüncü hal (şöyle olmuştur), Resûlüllah (sallallahü aleyhi ve sellem) Medine'ye geldi ve on üç ay Beyt-i Makdis'e doğru namaz kıldı. Sonra Allah azze ve celle şu âyeti indirdi: Hakîkaten yüzünün semada aranıp durduğunu görüyoruz. Artık (müsterih ol), seni hoşnud olacağın bir kıbleye döndüreceğiz. Haydi yüzünü Mescid-i Harama doğru çevir. Siz de (ey mü'minler) nerede bulunursanız bulunun, yüzünüzü ona doğru çeviriniz.\" (2), 144. âyet-i kerimeyle) Allah azze ve celle Resulünü Ka'be'ye yöneltti. (İbnu'l-Müsennâ'nın) hadisi (burada) sona erdi. Nasr (b. Muhacir) de (rivâyetinde) Rü'ya sahibinin ismini açıklayarak şöyle dedi: Ensârdan bir kimse (olan) Abdullah b. Zeyd geldi. Kıbleye yöneldi ve: Allah en büyüktür. Allah en büyüktür. Allah'dan başka ilâh olmadığına şahidlik ederim. Allah'dan başka ilâh olmadığına şâhidlik ederim. Muhammed'in Allah'ın elçisi olduğuna şahidlik ederim. Muhammed'in Allah'ın elçisi olduğuna şahidlik ederim. İki defa da: Haydi namaza, iki defa : Haydi kurtuluşa. Allah en büyüktür. Allah en büyüktür. Allah'tan başka ilâh yoktur\" dedi. Sonra biraz durdu ve ayağa kalktı, aynı sözleri (yine) söyledi. (Abdullah b. Zeyd) der ki: Ancak (bu defa rü'yamda gördüğüm kişi) haydi kurtuluşa dedikten sonra namaz başladı namaz başladı, (sözlerini) ilâve etti. (Muâz) der ki: Resûlüllah (sallallahü aleyhi ve sellem) (Abdullah'a hitaben); bunu Bilâl'e öğret\" buyurdu. Bilâl de bu kelimelerle ezan okudu. Nasr (b. el-Muhâcir rivâyetinde) oruç konusunda da şunları söyledi: (sallallahü aleyhi ve sellem) her ayın üç gününde ve bir de Aşure gününde oruç tutardı. Sonra Allahu Teala: Üzerlerinize oruç yazıldı. Nitekim sizden evvelkilere de yazılmıştır\" (ayet-i kerimesini) \" Miskin doyumu fidye\" el-Bakara(2), 184. (sözlerine) kadar indirdi. Artık oruç tutmak isteyen tutuyor, oruç yemek isteyen de her gün (için) bir fakir doyuruyordu. Bu doyurma orucun yerini tutuyordu, işte bu (oruçta bir) değişikliktir. Sonra da Allah azze ve celle: Ramazan ayı ki insanları (irşâd için), hak fürkfinı, hidayet delili feeyyineler halinde Kur’ân onda indirildi\" âyetini indirdi. Oruç bu aya erişen herkese farz oldu. Yolcular için (yolculuk esnasında orucu yeyip sonra) kaza etmeleri, oruca güçleri yetmeyen ihtiyar kadın ve erkekler için de (fakir) doyurmaları izni baki kaldı. (Derken bir gün) Sırma b. Kays bütün gün çalışmış (olarak evine) geldi...\" ve (Nasr, orucun geçirdiği devrelerle ilgili olan bu) hadisi (sonuna kadar) nakletti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 117
			}
		}
	]
}