{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"43": "General Behavior (Kitab Al-Adab)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5257,
			"arabicnumber": 5257,
			"text": "Ebu Saıb den; demiştir ki: Ebu Said'in yanına varmıştım. O'nun yanında otururken, sedirinin altında bir şeyin kıpırtısını işittim ve hemen (ona doğru bir) baktım. Bir de ne göreyim, bir yılan. Bunun üzerine hemen ayağa kalktım. Ebu Said: Sana da ne oluyor (öyle), dedi. Şurada bir yılan var, dedim. Ne yapmak istiyorsun, dedi. Onu öldüreceğim, dedim. Evinde kendi odasının karşısında bulunan bir odayı göstererek: Şu odada amcamın oğlu vardı. Hendek savaşı günü ailesine (gitmek üzere Hz. Nebi'den) izin istemişti. Kendisi daha yeni evlenmişti. Rasûlullah (s.a.v.)'de (ailesinin yanma gitmesi için) kendisine izin verdi. Ve ona silahıyle gitmesini emretti. (Kendisi) evine varınca, hanımını evin kapısı önünde ayakta dikili bir halde buldu. Bunun üzerine (kıskançlığı tuttu da) süngüsü(nü) karısına çevirdi. (Süngünün kendisine çevrildiğini gören kadın) \"Acele etme! (Eve bir gir de) beni dışarı çıkaran şeyi (sen de) gör!\" dedi. (Aldığı bu cevap üzerine) hemen eve girdi. Bir de ne görsün; büyük bir yılan. Hemen süngüyü ona sapladı, sonra (yılan) süngü kendisine saplanmış olduğu halde hareket etmekte iken onu (süngünün ucunda) dışarı çıkardı. (Yılan bir ara süngüden kurtulup hasmının üzerine saldırdı uzun bir boğuşmadan sonra her ikisi de öldüler.) Onlardan hangisi, yılan mı yoksa adam mı erken öldü, bilemiyorum. Bunun üzerine onun kavmi Rasûlullah (s.a.v.)'e gelerek: \"Ey Allah'ın Resulü): \"Allah'a dua et de arkadaşımızı (yeniden) diriltsin!\" dediler. (Hz. Nebi de:) Arkadaşınız için istiğfar ediniz.\" dedi. Sonra \"cinlerden bir topluluk Medine'de müslüman oldular. Onlardan birini (evinizde) gördüğünüz zaman onu üç defa korkutunuz. Onu öldürmek istediğiniz halde öldürmekten vazgeçip sadece korkutmakla yetindikten sonra yine de size (evinizde) görünecek olursa üç(üncü defaki tehdidinizden sonra onu öldürünüz\" buyurdu)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 485
			}
		}
	]
}