{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"2": "Prayer (Kitab Al-Salat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 930,
			"arabicnumber": 930,
			"text": "Muaviye b. el-Hakemi's-Sülemî'den; demiştir ki: Resulüllah (sallallahu aleyhi ve sellem)'le birlikte namaza durmuştum. Cemaatten birisi aksırdı. Ben de, \"Yerhamukellahu\" (Allah sana rahmet etsin)\" dedim. Bunun üzerine cemaat bana dik dik bakmaya başladı. Ben de; vay başıma gelenler, size ne oluyor ki bana böyle bakıyorsunuz? dedim. (Muaviye) dedi ki: Bunun üzerine ellerini uyluklarına vurmaya başladılar. Ben de hemen bunların beni susturmak istediklerini anladım. (Bu hadisin râvilerinden) Osman (b. Ebî Şeybe, hadisin geri kalan kısmını şöyle) nakletti: Ve ben de sustum. Resûlullah (sallallahu aleyhi ve sellem) namazı bitirince: Annem babam ona feda olsun beni ne dövdü ne azarladı ne de bana sövdü. Bir süre sonra dedi ki: \"Şu namaz (var ya) onun içinde böyle insan sözünden her hangi birşeyi konuşmak caiz değildir. O namaz sadece tesbih, tekbir ve Kuran okumaktan ibarettir.\" Yahutta Resûlullah (s.a.v.)'in buyurdu­ğu gibidir. Ben: Yâ Resülallah, biz cahiliyetten yeni kurtulmuş bir topluluğuz. Gerçi Allah İslâmı getirdi. Ama bizden öyle kimseler var kî hâlâ kâhinlere gidiyorlar dedim. (Bunun üzerine:) \"Sen gitme\" buyurdu. Bizden bazı kimseler de tetayyur ediyorlar, dedim. “Bu onların içlerinden gelen birşeydir. Ama sakın onları yoldan çıkarmasın\" buyurdu, ben: Bizden bazı kimseler de çizgi çiziyorlar, dedim. \"Nebilerden biri çizgi çizerdi. Her kimin çizgisi (onun çizgisine) uygun düşerse, isabet etmiş olur, buyurdu. (Muâviye) dedi ki: Benim bir cariyem vardı, dedim. Uhud ve Cevâniyye tarafların­da kuzuları güderdi. Bir (gün) çıkıp yanına vardım. Bir de ne göreyim bir kurt kuzulardan birini alıp götürmüş. Ben de ademoğullarından bir adamım. Onlar gibi ben de üzülürüm. Lâkin cariyeye öyle bir tokat vurdum ki... Resûlullah (s.a.v.) bunu bana çok gördü. Ben: Yâ Resûlallah (o halde) cariyeyi azad edeyim mi? dedim. \"Sen onu bana getir\" buyurdu. Hemen onu (alıp) getirdim. Peygamber (s.a.v.) ona: “Allah nerededir?\" diye sordu. (Câriye): -Göktedir, dedi. (Resûl-i Ekrem (s.a.v.): \"- Ben kimim?\" dedi. Câriye: Sen Allah'ın Nebisisin, cevabını verdi. (Resûl-i Ekrem (s.a.v.): \"- Onu âzâd et, çünkü mu'min bir kadındır\" buyurdu. Diğer tahric: Müslim, mesâcid; Nesâi, sehv; Ebû Dâvûd, eymân; Dârimî, nuzur; Muvattâ, itki; Ahmed b. Hanbel, II, 291; III, 452; IV, 222, 388, 389; V, 447, 449",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 541
			}
		}
	]
}