{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"0": ""
		}
	},
	"hadiths": [
		{
			"hadithnumber": 455,
			"arabicnumber": 455,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 815.2,
			"arabicnumber": 815.2,
			"text": "৮১৫/১। জাবির ইবনু আবদুল্লাহ্ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হাজ্জ করেছেন তিনবারঃ দু’বার হিজরাতের আগে এবং এক বার হিজরাতের পর। তিনি এই (শেষোক্ত) হাজের সাথে উমরাও করেছেন। তিনি তেষট্টিটি কুরবানীর উট এনেছিলেন এবং ইয়ামান হতে আলী (রাঃ) অবশিষ্ট (৩৭টি) উটগুলি এনেছিলেন। আবু জাহালের একটি উটও ছিল এই উটগুলির মধ্যে। একটি রূপার শিকল এর নাসারন্ত্রে (নাকের ছিদ্রে) পরানো ছিল। তিনি এটাকেও যবেহ করেছিলেন। প্রতিটি কুরবানীর উট হতে এক টুকরো করে গোশত আনার জন্য রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নির্দেশ দিলেন। এগুলো রান্না করা হলে তিনি এর শুরুয়া (ঝোল) পান করেন। - সহীহ, হাজ্জাতুন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (৬৭-৮৩), মুসলিম, হিজরাতের পূর্বে ২ হাজ্জ এবং আবু জাহল এই ব্যাক্যাংশ ছাড়া। এই হাদীসটিকে আবু ঈসা গারীব বলেছেন। শুধুমাত্র যাইদ ইবনু ইবাবের সূত্রেই আমরা এ হাদীসটি জানতে পেরেছি। আব্দুল্লাহ ইবনু বর্ণনা করেছেন। এই হাদীস সম্বন্ধে আমি মুহাম্মাদ আল-বুখারীকে প্রশ্ন করলাম। কিন্তু এই হাদীস উপরোক্ত সনদে বর্ণিত আছে বলে তিনি জানতে পারেননি। আমি দেখেছি এই হাদীসটিকে তিনি সংরক্ষিত বলে গণ্য করতেন না। তিনি বলেন, এটি সাওরী-আবূ ইসহাক-মুজাহিদের সনদে মুরসালভাবে বর্ণিত আছে। ৮১৫/২। কাতাদা (রাহঃ) বলেন, আনাস ইবনু মালিক (রাঃ)-কে আমি বললাম, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কতবার হাজ্জ করেছেন? তিনি বললেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একবার হাজ্জ এবং চারবার উমরা করেছেন। যিলকাদ মাসে একটি উমরা, হুদাইবিয়ার উমরা, হাজ্জের সাথে একটি এবং হুনাইন যুদ্ধের গানীমাত বন্টনকালে জিরানা হতে একটি উমরা। — সহীহ বুখারী, মুসলিম এই হাদীসটিকে আবু ঈসা হাসান সহীহ বলেছেন। হাব্বান ইবনু হিলাল (আবু হাবীব আল-বাসরী) একজন মর্যাদাসম্পন্ন ও নির্ভরযোগ্য বর্ণনাকারী। তাকে ইয়াহইয়া ইবনু সাঈদ আল-কাত্তান নির্ভরযোগ্য বর্ণনাকারী বলে মন্তব্য করেছেন।",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1114.2,
			"arabicnumber": 1114.2,
			"text": "১১১৪/১। সাহল ইবনু সা'দ (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট এসে একজন স্ত্রীলোক বলল, আমি আপনার জন্য নিজেকে দান (হেবা) করলাম। (একথা বলে) সে অনেকক্ষণ দাঁড়িয়ে রইল। তারপর এক ব্যক্তি বলল, হে আল্লাহর রাসূল! আপনার যদি তাকে প্রয়োজন না হয় তবে আমার সাথে তার বিয়ে দিন। তিনি বললেনঃ তার মোহর আদায়ের মত তোমার নিকট কিছু আছে কি? সে বলল, আমার এ কাপড়টি ব্যতীত আমার নিকট আর কিছুই নেই। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তাকে যদি তোমার কাপড়টি দাও তবে তোমাকে তো (ঘরে) বসে থাকতে হবে এবং তোমার কাপড় বলতে আর কিছু থাকবে না। অন্য কিছু খুঁজে নিয়ে আস। (কিছুক্ষণ পর ফিরে এসে) সে বলল, কিছুই খুঁজে পাইনি। তিনি বললেনঃ একটি লোহার আংটি হলেও খুঁজে আন। বর্ণনাকারী বলেন, সে কিছুই খুঁজে পেল না। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ কুরআনের কিছু জানা আছে কি তোমার? সে বলল, হ্যাঁ, অমুক অমুক সূরা জানি। সে সূরাগুলোর নামও বলল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ কুরআনের যেটুকু অংশ তোমার জানা আছে তার বিনিময়ে তোমার সাথে তার বিয়ে দিলাম। – সহীহ, ইবনু মা-জাহ (১৮৮৯), বুখারী, মুসলিম এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। এ হাদীস অনুযায়ী ইমাম শাফিঈ মত প্রকাশ করেছেন। তিনি বলেছেন, বিয়ের জন্য কোন লোকের নিকটে যদি মোহর আদায়ের মত কিছু না থাকে এবং যদি সে লোক কোন নারিকে কুরআনের কোন সুরার বিনিময়ে বিয়ে করে তবে তা জায়িয হবে। তার কর্তব্য হবে ঐ মহিলাকে সে সূরাটি শিখিয়ে দেয়া। কুফাবাসী আলিমগণ এবং আহমাদ ও ইসহাক বলেছেন, বিয়ে জায়িয হবে ঠিকই, কিন্তু তাকে ‘মোহরে মিসাল পরিশোধ করতে হবে। ১১১৪/২। আবুল আজফা (রাহঃ) হতে বর্ণিত আছে, তিনি বলেন, উমার ইবনুল খাত্তাব (রাঃ) বলেছেন, সাবধান! তোমরা নারীদের মোহরানা উচ্চহারে বাড়িয়ে দিও না। কেননা, তা দুনিয়াতে যদি সম্মানের বস্তু অথবা আল্লাহ্ তা'আলার নিকট তাকওয়ার বস্তু হত তবে এ ব্যাপারে আল্লাহর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তোমাদের চেয়ে বেশি উদ্যোগী হতেন। কিন্তু বার উকিয়ার বেশি পরিমাণ মোহরে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার কোন স্ত্রীকে বিয়ে করেছেন অথবা তার কোন কন্যাকে বিয়ে দিয়েছেন বলে আমার জানা নেই। — সহীহ, ইবনু মা-জাহ (১৮৮৭) এ হাদীসটিকে আবু ঈসা হাসান সহীহ বলেছেন। আবুল আজফার নাম হারিম। আলিমদের মতে চল্লিশ দিরহামের সমান এক উকিয়া এবং চারশত আশি দিরহামের সমান বার উকিয়া।",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 1904.2,
			"arabicnumber": 1904.2,
			"text": "১৯০৪। বারাআ ইবনু আযিব (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ খালা হলো মাতৃস্থানীয়। সহীহ, ইরওয়া (২১৯০), বুখারী, মুসলিম। এ হাদীসের সাথে একটি দীর্ঘ ঘটনা রয়েছে। এ হাদীসটি সহীহ। ইবনু উমর (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট একজন লোক এসে বলল, হে আল্লাহর রাসুল! আমি একটি কবিরা গুনাহ করে ফেলেছি। আমার তওবা করার সুযোগ আছে কি? তিনি প্রশ্ন করেনঃ তোমার মা কি বেঁচে আছেন? সে বলল, না। তিনি আবার প্রশ্ন করেন তোমার খালা কি বেঁচে আছেন? সে বলল, হ্যাঁ। তিনি বললেনঃ তার সাথে উত্তম আচরণ কর। সহীহ, তা’লীকুর রাগীব (৩/২১৮)। আলী এবং বারাআ ইবনু আ’-যিব (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের উপরোক্ত হাদীসের অনুরূপ হাদীস ইবনু আবী উমার-সুফিয়ান ইবনু উয়াইনা হতে, তিনি মুহাম্মাদ ইবনু সুকা হতে, তিনি আবু বাকর ইবনু হাফস হতে এই সূত্রেও বর্ণিত আছে। এ সূত্রে ইবনু উমর (রাঃ)-এর কথা উল্লেখ নেই। এই সূত্রটি পূর্বোল্লেখিত মু'আবিয়ার সূত্রের চাইতে অনেক বেশি সহীহ। আবূ বাকর ইবনু হাফস হলেন ইবনু উমার ইবনু সা’দ ইবনু আবী ওয়াক্কাস।",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2089,
			"arabicnumber": 2089,
			"text": "",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2146,
			"arabicnumber": 2146,
			"text": "২১৪৬। মাতার ইবনু উকামিস (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আল্লাহ তা'আলা যখন যে জায়গায় কারো মৃত্যু হওয়ার ফায়সালা করেন, তখন ঐ জায়গায় গমনের উদ্দেশ্যে তার কোন প্রয়োজন সৃষ্টি করে দেন। সহীহ, মিশকাত (১১০), সহীহাহ (১২২১)। আবূ ঈসা বলেন, আবূ আযযা (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। এ হাদীসটি হাসান গারীব। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে মাতার ইবনু উকামিস (রাঃ)-এর এই হাদীসটি ছাড়া আর কোন হাদীস আছে বলে আমাদের জানা নেই। উপরোক্ত হাদীসের অনুরূপ হাদীস মাহমূদ ইবনু গাইলান মুআম্মাল ও আবূ দাউদ আল-হুফারী-সুফিয়ান (রাহঃ)-এর সূত্রে বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2521,
			"arabicnumber": 2521,
			"text": "২৫২১। মু'আয ইবনু আনাস আল-জুহানী (রাঃ) হতে বর্ণিত আছে যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে লোক আল্লাহ তা'আলার উদ্দেশে দান-খয়রাত করে, আল্লাহ্ তা'আলার উদ্দেশে (দান করা হতে) নিবৃত্ত থাকে, আল্লাহ্ তা'আলার জন্য ভালবাসে, আল্লাহ্ তা'আলার জন্যই ঘৃণা করে এবং আল্লাহ্ তা'আলার (সন্তুষ্টির) উদ্দেশ্যে বিয়ে প্রদান করে, সে তার ঈমান সুসম্পন্ন করেছে। হাসানঃ সহীহাহ (১/১১৩)। আবূ ঈসা বলেন, এই হাদীসটি হাসান।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2535,
			"arabicnumber": 2535,
			"text": "২৫৩৫। আবূ সাঈদ আল-খুদরী (রাযিঃ) হতে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে দলটি কিয়ামত দিবসে সর্বপ্রথম জান্নাতে প্রবেশ করবে, দলের মুখমণ্ডল হবে আকাশে মুক্তার ন্যায় জ্বলজ্বলে তারকার মতো উজ্জ্বল। তাদের মধ্যে প্রত্যেক পুরুষের জন্য দু’জন করে স্ত্রী (হুর) থাকবে এবং প্রত্যেক স্ত্রীর সত্তরজোড়া জামা থাকবে। এই জামার ভিতর দিয়েও তার পায়ের জংঘার অস্থিমজ্জা দেখা যাবে। সহীহঃ সহীহাহ (১৭৩৬), মিশকাত তাহকীক সানী (৫৬৩৫), তা’লীকুর রাগীব (২৬১)। আবূ ঈসা বলেন, এই হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2591,
			"arabicnumber": 2591,
			"text": "২৫৯১। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ জাহান্নামের আগুন এক হাজার বছর জ্বালানোর পর তা লাল বর্ণ ধারণ করে। আবার এক হাজার বছর জ্বালানোর পর তা সাদা রং ধারণ করে। আবার এক হাজার বছর জ্বালানোর পর তা কালো বর্ণ হয়ে যায়। সুতরাং তা এখন ঘোর কালো বর্ণে অন্ধকারাচ্ছন্ন হয়ে আছে। যঈফ, ইবনু মাজাহ (৪৩২০) সুওয়াইদ ইবনু নাসর-আবদুল্লাহ ইবনুল মুবারক হতে তিনি শারীক হতে তিনি আসিম হতে তিনি আবূ সালিহ অথবা অপর কোন ব্যক্তি-আবূ হুরাইরা (রাঃ) হতে উপরোক্ত হাদীসের মতই বর্ণনা করেছেন, তবে মারফু হিসেবে নয়। আবূ ঈসা বলেনঃ এ অনুচ্ছেদে আবূ হুরাইরা (রাঃ)-এর মাওকৃফ রিওয়ায়াতটি অনেক বেশী সহীহ। ইয়াহইয়া ইবনু আবূ বুকাইর-শারীকের সূত্র ব্যতীত আর কেউ এটিকে মারফুরূপে বর্ণনা করেছেন বলে আমাদের জানা নেই।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2815,
			"arabicnumber": 2815,
			"text": "২৮১৫। আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পুরুষদেরকে জাফরানী রং ব্যবহার করতে নিষেধ করেছেন। সহীহঃ বুখারী (৫৮৪৬), মুসলিম (৬/১৫৫)। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। এ হাদীসটি শুবাহ-ইসমাঈল ইবনু উলাইয়্যা হতে, তিনি আবদুল আযীয ইবনু সুহাইব হতে, তিনি আনাস (রাযিঃ) হতে এই সূত্রে বর্ণিত আছে যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জাফরানী রং ব্যবহার করতে নিষেধ করেছেন। ‘আবদুল্লাহ ইবনু আবদুর রাহমান-আদম হতে, তিনি শুবাহ (রাহঃ) হতে এ রকম বর্ণনা করেছেন। আবূ ঈসা বলেন, “পুরুষের জন্য জাফরান লাগানো নিষেধ” এ কথার অর্থ হল জাফরানী রং-এর সুগন্ধি লাগনো তাদের জন্য নিষেধ।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2824,
			"arabicnumber": 2824,
			"text": "২৮২৪। ‘আবদুল্লাহ ইবনু উমর (রাযিঃ) হতে বর্ণিত আছে যে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ (কুলক্ষণ বলতে কিছু থাকলে) এ তিনটিতে থাকতোঃ (১) নারী, (২) ঘর ও (৩) জন্তু। “কোন বস্তুতে কুলক্ষণ থাকলে\" অংশসহ হাদীসটি সহীহঃ বুখারী ও মুসলিম। ঐ অংশ ব্যতীত হাদীসটি শাযঃ সহীহাহ (৪৪৩, ৭৯৯, ১৮৯৭) আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। ইমাম যুহরীর কিছু শিষ্য অত্র হাদীসের সনদে বর্ণনাকারী হামযার উল্লেখ করেননি। তারা এভাবে বর্ণনা করেছেনঃ সালিম-তার বাবা হতে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে। একইভাবে ইবনু আবী উমারও এ হাদীসটি বর্ণনা করেছেনঃ সুফইয়ান ইবনু উয়াইনাহ্ হতে, তারা যুহরী হতে, তিনি ইবনু উমর (রাযিঃ)-এর পুত্রদ্বয় সালিম ও হামযা-তাদের বাবা হতে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে। সাঈদ ইবনু আবদুর রাহমান-সুফইয়ান হতে, তিনি যুহরী হতে, তিনি সালিম (রহঃ) হতে তার বাবার সূত্রে উপরে বর্ণিত হাদীসের সমার্থক হাদীস বর্ণনা করেছেন। এ সূত্রে সাঈদ ইবনু আবদুর রাহমান-হামযা হতে এভাবে উল্লেখ করেননি। সাঈদের রিওয়ায়াত অধিকতর সহীহ। কেননা ‘আলী ইবনুল মাদীনী ও হুমাইদী (রহঃ) সুফইয়ানের সূত্রে বর্ণনা করেছেন। যুহরী আমাদের নিকট এ হাদীস শুধুমাত্র সালিম-ইবনু উমর (রাযিঃ)-এর সূত্রেই বর্ণনা করেছেন। মালিক ইবনু আনাস (রহঃ) এ হাদীসটি যুহরীর সূত্রে বর্ণনা করেছেন এবং বলেছেনঃ আবদুল্লাহ ইবনু উমার (রাযিঃ)-এর পুত্রদ্বয় সালিম ও হামযা হতে-তাদের বাবার সূত্রে। এ অনুচ্ছেদে সাহল ইবনু সাদ, আয়িশাহ ও আনাস (রাযিঃ) হতেও হাদীস বর্ণিত রয়েছে। অধিকন্তু নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে আরো বর্ণিত আছে যে, তিনি বলেছেনঃ “কোন কিছুতে কুলক্ষণ বলতে কিছু থাকলে, নারী, জন্তু ও ঘরের মধ্যেই থাকত।” তাছাড়া হাকীম ইবনু মু'আবিয়াহ (রাযিঃ) বলেন, আমি রাসূলুল্লাহু সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছিঃ “কুলক্ষণ বলতে কিছু নেই। তবে কখনো কখনো ঘর, নারী ও ঘোড়ার মধ্যে শুভ লক্ষণ (বারকাত) দেখা যায়।” সহীহঃ ইবনু মাজাহ (১৯৩০)। ‘আলী ইবনু হুজর-ইসমাঈল ইবনু আইয়্যাশ হতে, তিনি সুলাইমান মু'আবিয়াহ ইবনু হাকীম হতে, তিনি তার চাচা হাকীম ইবনু মু'আবিয়াহ (রাযিঃ) হতে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে, এই সূত্রে উক্ত হাদীসটি বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 2953.2,
			"arabicnumber": 2953.2,
			"text": "২৯৫৩। আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত আছে যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে লোক নামায আদায় করলো, অথচ তাতে উন্মুল কুরআন (সূরা আল-ফাতিহা) পাঠ করলো না, তা (নামায) ক্রটিযুক্ত, তা ক্ৰটিযুক্ত, তা অসম্পূর্ণ। বর্ণনাকারী (আবদুর রাহমান) বলেন, আমি বললাম, হে আবূ হুরাইরাহ! আমি তো অনেক সময় ইমামের পিছনে নামায আদায় করি। তিনি বললেন, হে পারস্য সন্তান! তুমি তা নীরবে পাঠ করবে। কারণ আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছিঃ আল্লাহ তা'আলা বলেন, আমি আমার ও আমার বান্দাদের মধ্যে নামাযকে আধাআধি ভাগ করে নিয়েছি। নামাযের অর্ধেক আমার এবং অর্ধেক আমার বান্দার। আর বান্দা আমার নিকট যা চায় তা-ই তাকে দেয়া হয়। বান্দা যখন (নামাযে দণ্ডায়মান হয়ে) বলে, আলহামদু লিল্লাহি রব্বিল আলামীন (সমস্ত প্রশংসা সারা পৃথিবীর প্রভু আল্লাহ তা'আলার জন্য), তখন কল্যাণের আধার আল্লাহ তা'আলা বলেন, “আমার বান্দা আমার প্রশংসা করেছে। যখন বান্দা বলে, আর-রাহমানির রাহীম (তিনি দয়াময় পরম দয়ালু), তখন আল্লাহ বলেন, আমার বান্দা আমার গুণগান করেছে। যখন বান্দা বলে, মালিকি ইয়াওমিদীন (প্রতিফল দিবসের মালিক), তখন আল্লাহ তা'আলা বলেনঃ আমার বান্দা আমার মর্যাদা বর্ণনা করেছে। এটা হচ্ছে আমার জন্য। আর আমার ও আমার বান্দার জন্য যোগসূত্র হচ্ছেঃ ইয়্যাকা না'বুদু ওয়া ইয়্যাকা নাসতাঈন (আমরা শুধু তোমারই ইবাদাত করি এবং তোমারই নিকট সাহায্য চাই), সূরার শেষ পর্যন্ত আমার বান্দার জন্য। আমার বান্দার জন্য তাই যা সে প্রার্থনা করে। বান্দা বলে, “ইহদিনাস সিরাতাল মুস্তাকীম। সিরাতাল্লাযীনা আন'আমতা 'আলাইহিম। গাইরিল মাগযুবি 'আলাইহিম ওয়ালায য-ললীন” আমাদেরকে সরল ও মযবুত পথ দেখাও। ঐ মানুষদের পথ যাদের তুমি নিয়ামাত দান করেছ। যারা অভিশপ্ত হয়নি, যারা পথহারা হয়নি। সহীহঃ ইবনু মা-জাহ (৮৩৮), মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান। শু'বাহ, ইসমাঈল ইবনু জাফার প্রমুখ আলা ইবনু আবদুর রাহমান হতে, তিনি তার বাবা হতে, তিনি আবূ হুরাইরাহ (রাযিঃ) হতে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এই সূত্রে একই রকম বর্ণনা করেছেন। ইবনু জুরাইজ ও মালিক ইবনু আনাস (রাহঃ) আল ইবনু 'আবদুর রাহমান হতে, তিনি হিশাম ইবনু আবূ যাহরার মুক্তদাস আবূস সায়িব হতে, তিনি আবূ হুরাইরাহ (রাযিঃ) হতে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এই সূত্রেও একই রকম বর্ণনা করেছেন। ইবনু আবূ উয়াইস-তার বাবা হতে, তিনি 'আলা ইবনু আবদুর রাহমান হতে, তিনি তার পিতা ও আবূস সাইব হতে, তিনি আবূ হুরাইরাহ (রাযিঃ) হতে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এই সূত্রে একই রকম বর্ণনা করেছেন। আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত আছে যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে লোক নামায আদায় করেছে অথচ তাতে উন্মুল কুরআন (সূরা আল-ফাতিহা) তিলাওয়াত করেনি, তার নামায ক্রটিযুক্ত অপূর্ণাঙ্গ। সহীহ দেখুন পূর্বের হাদীস। ইসমাঈল ইবনু আবূ উয়াইসের হাদীসে এর বেশি কিছু নেই। আমি এ হাদীস বিষয়ে আবূ যুর'আকে প্রশ্ন করলে তিনি বললেন, দুটি হাদীসই সহীহ। তিনি ইবনু আবী উয়াইস কর্তৃক তার বাবা হতে, তিনি আলী (রহঃ) হতে এই সূত্রে বর্ণিত হাদীস দ্বারা প্রমাণ পেশ করেন। ‘আদী ইবনু হাতিম (রাযিঃ) হতে বর্ণিত, তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট আসলাম। তখন তিনি মসজিদে বসা ছিলেন। লোকেরা বলল, এই তো আদী ইবনু হাতিম (রাযিঃ)। আর আমি কোনরূপ নিরাপত্তা লাভ বা লিখিত চুক্তিপত্র করা ছাড়াই এসেছিলাম। আমাকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সমীপে হাযির করা হলে তিনি আমার হাত ধরলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইতিপূর্বে বলেছিলেন, আমি অবশ্যই আশা করি আল্লাহ তাআলা আমার হাতে তার হাত স্থাপন করবেন। আদী (রাযিঃ) বলেন, তিনি আমাকে সাথে নিয়ে উঠে চললেন। রাস্তায় এক মহিলা একটি বালকসহ তার সাথে দেখা করে। তারা উভয়ে বলে, আপনার নিকট আমাদের একটি প্রয়োজন ছিল। তাদের প্রয়োজন পূরণ না হওয়া পর্যন্ত রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের সাথে দাঁড়িয়ে থাকলেন। তারপর তিনি আমার হাত ধরে আমাকে নিয়ে তার ঘরে এলেন। একটি বালিকা তাকে একটি গদি পেতে দিল। তিনি তাতে বসলেন। আমি তার সামনাসামনি বসলাম। তিনি আল্লাহ তা'আলার প্রশংসা ও তার গুনগান করলেন, তারপর বললেনঃ “লা ইলাহা ইল্লাল্লাহ\" (আল্লাহ তা'আলা ব্যতীত আর কোন প্ৰভু নেই)-এর স্বীকৃতি দান হতে তোমাকে কিসে পালিয়ে বেড়াতে বাধ্য করেছে? এক আল্লাহ তা'আলা ব্যতীত আরো কোন প্রভু আছে বলে কি তোমার জানা আছে? আমি বললাম, না। 'আদী (রাযিঃ) বলেন, আরো কিছুক্ষণ কথা বলার পর তিনি বললেনঃ তুমি আল্লাহু আকবার (আল্লাহ সর্বশ্রেষ্ঠ) বলা হতে পালাচ্ছ। আল্লাহ তা'আলার চাইতে শ্রেষ্ঠতর কিছু আছে বলে তোমার জানা আছে কি? আমি বললাম, না। তিনি বললেনঃ ইয়াহুদীরা অভিশপ্ত এবং নাসারাগণ পথভ্রষ্ট। আমি বললাম, আমি যে একজন একনিষ্ঠ মুসলিম (আত্মমর্পণকারী) হয়েই আগমন করেছি। আমি দেখলাম, তার চেহারা আনন্দে উদ্ভাসিত হয়ে উঠেছে। তারপর তার নির্দেশত্রুমে এক আনসার সাহাবীর বাড়িতে আমাকে মেহমান হিসেবে রাখা হয়। আমি দিনের দুই প্রান্তে তার নিকট হাযিরা দিতাম, একদা বিকেলে আমি তার নিকট হাযির ছিলাম। তখন তার নিকট একদল লোক আসলো। তারা সাদা-কালো ডোরাযুক্ত পশমী কাপড় পরিহিত ছিল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (তাদের নিয়ে) নামায আদায় করলেন। তিনি নামায শেষে দাঁড়িয়ে এদেরকে সাহায্যের উদ্দেশ্যে লোকদের উদ্বুদ্ধ করে ভাষণ দিলেন। তিনি বললেনঃ তোমরা এক সা, অর্ধ সা, এক মুঠো, এক মুঠোর অংশবিশেষ, একটি খেজুর বা খেজুরের অংশবিশেষ দান করে হলেও জাহান্নামের তাপ (আগুন) হতে আত্মরক্ষা কর। কারণ আল্লাহ তা'আলার সাথে তোমাদের সকলেরই সাক্ষাৎ হবে। তখন তিনি তোমাদেরকে তাই বলবেন যা আমি (এখন) তোমাদের বলছি। তিনি বলবেনঃ আমি কি তোমাকে শ্রবণশক্তি ও দৃষ্টিশক্তি দান করিনি? সে বলবে, হ্যাঁ। আল্লাহ বলবেন? আমি কি তোমাকে ধন-সম্পদ ও সন্তান-সন্ততি দান করিনি? সে বলবে, হ্যাঁ। আল্লাহ বলবেনঃ তুমি নিজের জন্য কি অগ্রিম পাঠিয়েছিলে? তখন সে তার সামনে, পেছনে, ডানে ও বামে তাকাবে, কিন্তু সে জাহান্নামের তাপ হতে বাচানোর মত কিছুই পাবে না। কাজেই তোমাদের প্রত্যেকে যেন নিজেকে একটি খেজুরের অংশবিশেষ দান করে হলেও জাহান্নামের আগুন হতে রক্ষা করে। কোন ব্যক্তির যদি এই সামর্থ্যও না থাকে, তবে সে যেন অন্তত ভালো কথা বলে (তা হতে আত্মরক্ষা করে)। আমি তোমাদের ব্যাপারে দুর্ভিক্ষের আশংকা করি না। কারণ আল্লাহ তা'আলা তোমাদের সাহায্যকারী ও দানকারী। এমনকি উষ্ট্রারোহিণী কোন মহিলা ইয়াসরিব (মদীনা) হতে হীরা বা ততোধিক দূরত্বের সফর করবে এবং তার জন্তুযানের কিছু চুরি যাওয়ার ভয় থাকবে না। 'আদী ইবনু হাতিম (রাযিঃ) বলেন, আমি মনে মনে বললাম, তাহলে তাঈ কবীলার চোরগুলো কোথায় যাবে? হাসান। আবূ ঈসা বলেন, এ হাদীসটি হাসান গারীব। আমরা সিমাক ইবনু হারব ব্যতীত আর কারো নিকট হতে এটা অবহিত নই। হাদীসটি দীর্ঘভাবে শুবাহ-সিমাক ইবনু হারব হতে, তিনি আব্বাদ ইবনু হুবাইশ হতে, তিনি ‘আদী ইবনু হাতিম (রাযিঃ) হতে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এই সূত্রে বর্ণনা করেছেন।",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3011,
			"arabicnumber": 3011,
			"text": "৩০১১। 'আবদুল্লাহ ইবনু মাসউদ (রাযিঃ) হতে বর্ণিত, নিম্নোক্ত আয়াত বিষয়ে তাকে প্রশ্ন করা হলঃ (অনুবাদ) “যারা আল্লাহ তা'আলার পথে নিহত হয়েছে তোমরা তাদেরকে মৃত মনে করে না, বরং তারা জীবিত এবং তাদের প্রতিপালকের নিকট হতে রিযিকপ্রাপ্ত”– (সূরা আ-লি ইমরান ১৬৯)। তিনি বললেন, আমরাও অবশ্য এ প্রসঙ্গে প্রশ্ন করেছিলাম। আমাদেরকে অবহিত করা হয় যে, জান্নাতের মধ্যে তাদের রূহগুলো সবুজ পাখির আকারে যথা ইচ্ছা ঘুরে বেড়ায়, আরশের সাথে ঝুলানো ঝাড়বাতিসমূহে (বসে) আরাম করে। একবার তোমার প্রভু তাদের প্রতি উকি দিয়ে প্রশ্ন করেনঃ তোমরা আরো কিছু চাও কি? তাহলে আমি তোমাদের আরো বাড়িয়ে দিব। তারা বলল, হে আমাদের প্রভু! আমরা এর চাইতে বেশি আর কি চাইব। আমরা জান্নাতের মধ্যে যেখানে ইচ্ছা ঘুরে বেড়াচ্ছি। আল্লাহ তা'আলা আবার উকি দিয়ে বলেনঃ তোমাদের আরো কিছু চাওয়ার আছে কি, তাহলে আমি আরো বাড়িয়ে দিব। যখন তারা দেখলো যে, কিছু চাওয়া ব্যতীত তাদের রেহাই নেই তখন তারা বলল, আপনি আমাদের দেহে প্রাণ সঞ্চার করে দিন যাতে আমরা আবার দুনিয়ায় ফিরে যেতে পারি এবং আবার আপনার পথে পুনরায় শহীদ হতে পারি। সহীহঃ ইবনু মা-জাহ (২৮০১), মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3015,
			"arabicnumber": 3015,
			"text": "৩০১৫। মুহাম্মাদ ইবনুল মুনকাদির (রাহঃ) হতে বর্ণিত, তিনি বলেন, আমি জাবির ইবনু আবদুল্লাহ (রাযিঃ)-কে বলতে শুনেছি, আমি অসুস্থ হলে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে দেখতে আসেন। আমি অজ্ঞান অবস্থায় ছিলাম। আমার চেতনা ফিরে পাওয়ার পর আমি বললাম, আমি আমার ধন-সম্পদ প্রসঙ্গে কিভাবে সিদ্ধান্ত করব? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার বিষয়ে নীরব থাকলেন। তারপর আয়াত অবতীর্ণ হয় (অনুবাদ) “আল্লাহ তা'আলা তোমাদের সন্তানদের সম্পর্কে তোমাদেরকে নির্দেশ দিচ্ছেনঃ এক পুরুষের (পুত্রের) অংশ দুজন মহিলার (কন্যার) সমান”— (সূরা আন-নিসা ১১)। সহীহঃ সহীহ আবূ দাউদ (২৭২৮), বুখারী (৪৫৭৭), মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। এ হাদীসটি মুহাম্মাদ ইবনুল মুনকাদির হতে একাধিক বর্ণনাকারী বর্ণনা করেছেন। আল-ফাযল ইবনুল মুনকাদির হতে, তিনি জাবির ইবনু আবদুল্লাহ (রাযিঃ) হতে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এই সূত্রে উপরের হাদীসের অনুরূপ বর্ণনা করেছেন। আল-ফাযল ইবনুস সাব্বাহর হাদীসে এ হাদীসের চেয়ে আরো বেশী বর্ণনা আছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3273,
			"arabicnumber": 3273,
			"text": "৩২৭৩। আবূ ওয়ায়িল (রহঃ) হতে বর্ণিত আছে, তিনি বলেন, রাবী'আহ গোত্রের এক লোক বলেন, আমি মদীনায় পৌছে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট উপস্থিত হলাম। তার নিকট আমি আদ জাতির দূত প্রসঙ্গে বললাম, আমি আদ জাতির দূতের মত হওয়া হতে আল্লাহ তা'আলার নিকট আশ্রয় প্রার্থনা করি। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম প্রশ্ন করেন; আদ জাতির দূতের কি হয়েছিল? আমি বললাম, আপনি ওয়াকিফহাল ব্যক্তিরই সাক্ষাৎ পেয়েছেন। আদ জাতি দুর্ভিক্ষে পতিত হলে তারা কায়ল নামক এক লোককে প্রেরণ করে এবং সে (মক্কার কাছাকাছি) বাকর ইবনু মু'আবিয়াহর বাড়ীতে উপস্থিত হয়। বাকর তাকে মদ পান করায় এবং তার সম্মুখে দুটি গায়িকা বাদী গান পরিবেশন করে। তারপর সে মাহরা (গোত্রের) অঞ্চলের পর্বতমালায় যাওয়ার উদ্দেশে যাত্রা শুরু করে। সে এ বলে প্রার্থনা করেঃ হে আল্লাহ! তোমার কাছে আমি কোন অসুখ হতে নিরাময় পাওয়ার জন্য আসিনি এবং কোন বন্দীকে মুক্তিপণ দিয়ে মুক্ত করার জন্যও আসিনি। অতএব আপনার এ বান্দাকে আপনি যত পারেন বৃষ্টিতে সিক্ত করুন এবং এর সঙ্গে বাকর ইবনু মু'আবিয়াহকেও সিক্ত করুন। বাকর তাকে যে মদ পান করায়, সে তার কৃতজ্ঞতা জ্ঞাপন করছিল। অতএব তার জন্য মেঘমালা উত্থিত হল এবং তাকে বলা হল, তুমি এগুলোর মাঝে যে কোন একটি মেঘখণ্ড বেছে নাও। সে মেঘমালার মাঝ হতে একখণ্ড কালো মেঘ বেছে নিল। তাকে বলা হল, কবুল কর, এটা জ্বলে পুড়ে ছাইয়ের ন্যায় করে ফেলবে, যা আদ জাতির কাউকে পরিত্রাণ দিবে না। উল্লেখ্য যে, একটি আংটির বৃত্তের পরিমাণ বাতাসের ঝাপটা তাদের উপর পাঠানো হয়েছিল মাত্র। তারপর এ আয়াতটি তিনি পাঠ করেনঃ (অনুবাদ): “তাদের উপর যখন আমি বিধ্বংসী বায়ু পাঠিয়ে ছিলাম তা তখন যা কিছুর উপর দিয়ে বয়ে গিয়েছিল সমস্ত কিছু চূর্ণ-বিচূর্ণ করে দিয়েছিল\"- (সূরা যারিয়াত ৪১-৪২)। হাসানঃ যঈফ হাদীস সিরিজ (হাঃ ১২২৮)-এর অংশ। আবূ ঈসা বলেন, একাধিক বর্ণনাকারী এ হাদীসটি আবূল মুনযির সাল্লাম (রহঃ)-এর সূত্রে তিনি আসিম ইবনু আবী নাজুদ হতে, তিনি আবূ ওয়ায়িল হতে, তিনি হারিস ইবনু হাসসান হতে এই সূত্রে বর্ণনা করেছেন। এই আল-হারিসকে ইবনু ইয়াযীদও বলা হয়।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3368,
			"arabicnumber": 3368,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3604.4,
			"arabicnumber": 3604.4,
			"text": "৩৬০৪। আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা আল্লাহ তা'আলার নিকটে জাহান্নামের শাস্তি থেকে আশ্রয় প্রার্থনা কর, আল্লাহ তা'আলার নিকট তোমরা কবরের শাস্তি হতে মুক্তি কামনা কর, তোমরা আল্লাহ তা'আলার কাছে মসীহ দাজ্জালের যুলম হতে মুক্তি চাও, তোমরা আল্লাহ তা'আলার নিকট জীবন ও মৃত্যুর বিপর্যয় হতে আশ্রয় প্রার্থনা কর। সনদ সহীহঃ মুসলিম (২/৯৩), তাশাহুদের বর্ণনার সাথে আরেক বর্ণনায় শেষ তাশাহুদে\" এই কথা উল্লেখ আছে। সিফাতুস সালাত (১৬৩)",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}