{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"11": "The Book on Marriage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1080,
			"arabicnumber": 1080,
			"text": "১০৮০। আবূ আয়্যুব আল-আনসারী (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ চারটি জিনিস নবীদের চিরাচরিত সুন্নাত। লজ্জা-শরম, সুগন্ধি ব্যবহার, মিসওয়াক করা এবং বিয়ে করা। যঈফ,মিশকাত (৩৮২),ইরওয়া (৭৫) আর রাদুআল আল-কাত্তানী পৃঃ ১২ এ অনুচ্ছেদে উসমান, সাওবান, ইবনু মাসউদ, আইশা, আবদুল্লাহ ইবনু আমর, আবূ নাজীহ, জাবির ও আক্কাফ (রাঃ) হতেও হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, আবূ আয়ূব (রাঃ)-এর হাদীসটি হাসান গারীব। মাহমূদ ইবনু খিদাশ-আব্বাদ ইবনুল আওয়াম হতে তিনি আল-হাজ্জাজ হতে তিনি মাকহুল হতে তিনি আবূশ শিমাল হতে তিনি আবূ আয়ূব (রাঃ), এর সূত্রেও উপরের হাদীসের মতই বর্ণনা করেছেন। উপরোক্ত হাদীস হুশাইম, মুহাম্মাদ ইবনু ইয়াযীদ, আবূ মুআবিয়া ও অন্যরা হাজাজ হতে তিনি মাকহল হতে তিনি আবূ আয়্যুব (রাঃ), বর্ণনা করেছেন। কিন্তু এই সনদে আবূশ শিমালের উল্লেখ নেই। হাফস ইবনু গিয়াস ও আব্বাদ ইবনুল আওয়ামের হাদীসটি অনেক বেশী সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1081,
			"arabicnumber": 1081,
			"text": "১০৮১। আবদুল্লাহ ইবনু মাসউদ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, কোন এক সময় রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সাথে আমরা বের হলাম। আমরা ছিলাম যুবক। (বিয়ের খরচ বহনের) আমাদের আর্থিক সামর্থ্য ছিল না। তিনি বললেনঃ হে যুব সমাজ! তোমাদের বিয়ে করা উচিত। কেননা, এটা দৃষ্টিকে সংযত রাখে এবং লজ্জাস্থানকে সুরক্ষিত রাখে। আর তোমাদের যে লোকের বিয়ের সামর্থ্য নেই সে লোক যেন রোযা আদায় করে। কেননা, তার যৌনশক্তিকে এটা নিয়ন্ত্রণে রাখবে। — সহীহ, ইবনু মা-জাহ (১৮৪৫), বুখারী, মুসলিম এ হাদীসটিকে আবু ঈসা হাসান সহীহ বলেছেন। উপরোক্ত হাদীসের তিনি আমাশ হতে, তিনি উমারা এর সূত্রেও হাদীস বর্ণিত হয়েছে। আবু ঈসা বলেন, একাধিক বর্ণনাকারী আমাশ হতে এই সনদে অনুরূপ বর্ণনা করেছেন। আবু মুআবিয়া ও আল মুহা-রিবী আমাশ হতে, তিনি ইবরাহীম আলাইহি ওয়াসাল্লাম হতে অনুরূপ বর্ণনা করেছেন। আবু ঈসা বলেন, উভয় সনদই সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1082,
			"arabicnumber": 1082,
			"text": "১০৮২। সামুরা (রাঃ) হতে বর্ণিত আছে, (বিয়ে না করে) চিরকুমার থাকতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বারণ করেছেন। যাইদ ইবনু আখযাম (রাহঃ)-এর বর্ণিত হাদীসে আরো আছেঃ এ আয়াতটি কাতাদাহ (রাহঃ) পাঠ করেনঃ “আমরা আরো অনেক রাসূলকেই তোমার পূর্বে প্রেরণ করেছি এবং তাদেরকে স্ত্রী ও সন্তান দিয়েছি” -(সূরাঃ রা'দঃ ৩৮) — সহীহ, পূর্বের হাদীসের সহায়তায়",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1083,
			"arabicnumber": 1083,
			"text": "১০৮৩। সাঈদ ইবনুল মুসাইয়্যিব (রহঃ) হতে বর্ণিত আছে, সাদ ইবনু আবূ ওয়াক্কাস (রাঃ) বলেন, উসমান ইবনু মাযউন (রাঃ)-এর বিয়ে না করার (চিরকুমারের) প্রস্তাবকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম প্রত্যাখ্যান করেছেন। তিনি তাকে অনুমতি দিলে আমরাও নিজেদেরকে চিরবন্ধা করে নিতাম। — সহীহ, বুখারী ও মুসলিম ৷ এ হাদীসটিকে আবু ঈসা হাসান সহীহ বলেছেন। সাদ, আনাস ইবনু মালিক, আইশা ও ইবনু আব্বাস (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আশআস ইবনু আব্দুল মালিক এই হাদীসটি হাসান হতে তিনি সা’দ ইবনু হিশাম হতে, তিনি আইশা (রাঃ) হতে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে পূর্বের হাদীসের মতই বর্ণনা করেছেন। এ হাদীসের দুটি সনদ সূত্রই সহীহ বলে কথিত।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1084,
			"arabicnumber": 1084,
			"text": "১০৮৪। আবু হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা যে ব্যক্তির দীনদারী ও নৈতিক চরিত্রে সন্তুষ্ট আছ তোমাদের নিকট সে ব্যক্তি বিয়ের প্রস্তাব করলে তবে তার সাথে বিয়ে দাও। তা যদি না কর তাহলে পৃথিবীতে ফিতনা-ফ্যাসাদ ও চরম বিপর্যয় সৃষ্টি হবে। — হাসান সহীহ, ইরওয়া (১৮৬৮), সহীহাহ (১০২২), মিশকাত (২৫৭৯) আবু হাতিম আল-মুযানী ও আইশা (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবু ঈসা বলেনঃ আবদুল হামীদের বিরোধিতা করা হয়েছে আবু হুরাইরা (রাঃ)-এর হাদীসের সনদে। এটাকে মুরসাল হিসেবে আবু হুরাইরা (রাঃ)-এর সূত্রে লাইস ইবনু সা’দ ইবনু আজলান হতে বর্ণনা করেছেন। লাইসের বর্ণনাটিকে ইমাম বুখারীও বিশুদ্ধতার নিকটতর বলেছেন এবং আবদুল হামীদের বর্ণনাকে সংরক্ষিত বলে বলে মনে করেন না।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1085,
			"arabicnumber": 1085,
			"text": "১০৮৫। আবূ হাতিম আল-মুযানী (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা যে লোকের দীনদারী ও নৈতিক চরিত্র দ্বারা সন্তুষ্ট আছ, তোমাদের নিকট যদি সে বিয়ের প্রস্তাব দেয়, তবে তার সাথে (তোমাদের পাত্রীর) বিয়ে দাও। তা না করলে পৃথিবীতে ফিতনা-ফ্যাসাদ ও বিপর্যয় ছড়িয়ে পড়বে। সাহাবীগণ বললেন, হে আল্লাহর রাসূল! কিছু (ক্রটি) তার মাঝে থাকলেও কি? তিনি বললেনঃ তোমাদের নিকটে যে লোকের দীনশীলতা ও নৈতিক চরিত্র পছন্দ হয় সে লোক তোমাদের নিকট বিয়ের প্রস্তাব করলে তবে তার সাথে বিয়ে দাও। (বর্ণনাকারী বলেন) একথা তিনি তিনবার বললেন। - হাসান, পূর্বের হাদীসের সহায়তায় এ হাদীসটিকে আবু ঈসা হাসান গারীব বলেছেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সাহচর্য পেয়েছেন আবু হাতিম আল-মুযানী। তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এ হাদীসটি ব্যতীত আর কোন হাদীস বর্ণনা করেছেন কি-না তা আমাদের জানা নেই।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1086,
			"arabicnumber": 1086,
			"text": "১০৮৬। জাবির (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মহিলাদেরকে বিয়ে করা হয় তাদের দীনদারী, ধন-সম্পদ ও সৌন্দর্য দেখে। অবশ্যই তুমি দীনদার পাত্রীকে বেশি অগ্রাধিকার দিবে; কল্যাণে তোমার হাত পরিপূর্ণ হবে। — সহীহ, ইবনু মা-জাহ (১৮৫৮), বুখারী ও মুসলিম আওফ ইবনু মালিক, আইশা, আবদুল্লাহ ইবনু আমর ও আবু সাঈদ (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। জাবির (রাঃ) হতে বর্ণিত হাদীসটিকে আবু ঈসা হাসান সহীহ বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1087,
			"arabicnumber": 1087,
			"text": "১০৮৭। মুগীরা ইবনু শুবা (রাঃ) হতে বর্ণিত আছে, তিনি এক মহিলার নিকট বিয়ের প্রস্তাব প্রেরণ করেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তাকে দেখে নাও, তোমাদের মধ্যে এটা ভালবাসার সৃষ্টি করবে। — সহীহ, ইবনু মা-জাহ (১৮৬৫) মুহাম্মাদ ইবনু মাসলামা, জাবির, আবু হুমাইদ, আনাস ও আবু হুরাইরা (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। এ হাদীসটিকে আবু ঈসা হাসান বলেছেন। এ হাদীস অনুযায়ী একদল আলিম আমল করেছেন। তারা বলেছেন, বিয়ে করার পূর্বে নিষিদ্ধ অঙ্গের প্রতি না তাকিয়ে পাত্রী দেখাতে কোন সমস্যা নেই। এই মত ইমাম আহমাদ ও ইসহাকেরও। তোমাদের উভয়ের মধ্যে ভালবাসার সৃষ্টি হবে এ কথার অর্থঃ পাত্রীকে দেখে পছন্দ করার পর বিয়ে করলে দাম্পত্য জীবনের ভালোবাসা স্থায়ী হয়।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1088,
			"arabicnumber": 1088,
			"text": "১০৮৮। মুহাম্মাদ ইবনু হাতিব আল-জুমাহী (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ দফ বাজানো ও ঘোষণা দেয়া হচ্ছে (বিয়েতে) হালাল ও হারামের পার্থক্য। — হাসান, ইবনু মা-জাহ (১৮৯৬) আইশা, জাবির ও রুবাই বিনতু মুআওব্বায (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। মুহাম্মাদ ইবনু হাতিব (রাঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা হাসান বলেছেন। আবু বালজের নাম ইয়াহইয়া, পিতা আবু সুলাইম এবং তাকে ইবনু সুলাইমও বলা হয়। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে মুহাম্মাদ ইবনু হাতিব দেখতে পেয়েছেন। সে সময় তিনি নাবালেগ ছিলেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1089,
			"arabicnumber": 1089,
			"text": "১০৮৯। আইশা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা বিয়ের ঘোষণা দিবে, বিয়ের কাজ মসজিদে সম্পন্ন করবে এবং এতে দফ পিটাবে। বিয়ের ঘোষণা দিবে এই অংশটি ব্যতীত হাদীসটি যঈফ। ইবনু মাজাহ (১৮৯৫) আবূ ঈসা বলেন, এ হাদীসটি হাসান গারীব। ঈসা ইবনু মাইমূন হাদীস শাস্ত্রে দুর্বল। তবে যে ঈসা ইবনু মাইমূন তাফসীর সম্পর্কে ইবনু আবূ নাজীহ হতে বর্ণনা করেছেন তিনি নির্ভরযোগ্য।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1090,
			"arabicnumber": 1090,
			"text": "১০৯০। মুআওব্বিয কন্যা রুবাই (রাঃ) হতে বর্ণিত আছে, তিনি সকালে আমার ঘরে এলেন। আমার কাছে তুমি (খালিদ ইবনু যাকওয়ান) যেভাবে বসে আছ, তিনি আমার বিছানায় ঠিক সেভাবে বসলেন। আমাদের বালিকারা এমন সময়ে দফ বাজিয়ে বদরের যুদ্ধের শহীদ হওয়া আমার বাপ-দাদার শোকগাথা গাইছিলো। তাদের কোন একজন গাইতে গাইতে বলল, “আমাদের মাঝে একজন নবী আছেন। আগামী কাল কি হবে তা তিনি জানেন।” তিনি (রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) তাকে বললেনঃ “এরূপ বলা হতে বিরত থাক, বরং তাই বল এতক্ষণ যা বলতেছিলে \"। — সহীহ, আল আদাব (৯৪) এ হাদীসটিকে আবু ঈসা হাসান সহীহ বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1091,
			"arabicnumber": 1091,
			"text": "১০৯১। আবু হুরাইরা (রাঃ) হতে বর্ণিত আছে, যখন কোন লোক বিয়ে করত, তখন তার জন্য রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এই দু’আ পাঠ করতেনঃ “বারাকাল্লাহু লাকা ওয়া বারাকা আলাইকা ওয়া জামাআ বাইনাকুমা ফিল খাইরি”। অর্থঃ আল্লাহ তা'আলা তোমার জীবন বারকাতময় করুন আর তোমাদেরকে কল্যাণের মধ্যে একত্রিত করুন। — সহীহ, ইবনু মা-জাহ (২৯০৫) আকীল ইবনু আবু তালিব (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবু হুরাইরা (রাঃ) হতে বর্ণিত হাদীসটিকে আবু ঈসা হাসান সহীহ বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1092,
			"arabicnumber": 1092,
			"text": "১০৯২। ইবনু আব্বাস (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের মধ্যে কোন লোক যখন তার স্ত্রীর সাথে সহবাস করে আর তখন (মিলনের পূর্বে) বলে, “বিসমিল্লাহি আল্লাহুম্মা জান্নিবনাশ শাইতানা ওয়া জান্নিবিশ শাইতানা মা রাযাকতানা”। তাদেরকে যদি আল্লাহ তা'আলা তাদের এই সহবাসে সন্তান দেয়ার সিদ্ধান্ত করেন, তবে এ সন্তানের কোনরকম ক্ষতিই শাইতান করতে পারে না। — সহীহ, ইবনু মা-জাহ (১৯১৯), বুখারী এ হাদীসটিকে আবু ঈসা হাসান সহীহ বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1093,
			"arabicnumber": 1093,
			"text": "১০৯৩। আইশা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, শাওয়াল মাসে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে বিয়ে করেছেন এবং বাসর রাতও শাওয়াল মাসেই কাটিয়েছেন। শাওয়াল মাসে আইশা (রাঃ) তার পরিবারের মেয়েদের জন্য বাসর উদযাপনের ইচ্ছা করতেন। – সহীহ, ইবনু মা-জাহ (১৯৯০), মুসলিম এ হাদীসটিকে আবু ঈসা হাসান সহীহ বলেছেন। এটিকে আমরা শুধুমাত্র ইসমাঈল ইবনু উমাইয়্যার সূত্রে যুহরীর বর্ণিত হাদীস হিসেবেই জানি।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1094,
			"arabicnumber": 1094,
			"text": "১০৯৪। আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত আছে, আবদুর রাহমান ইবনু আওফ (রাঃ)-এর গায়ে (বা পোশাকে) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হলুদ রং-এর চিহ্ন দেখে প্রশ্ন করেনঃ কি ব্যাপার! তিনি বললেন, আমি এক মহিলাকে একটি খেজুর আঁটির অনুরূপ পরিমাণ সোনার বিনিময়ে বিয়ে করেছি। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমায় আল্লাহ তা'আলা বারকাত দিন, ওয়ালীমার আয়োজন কর তা একটি ছাগল দিয়ে হলেও। — সহীহ, ইবনু মা-জাহ (১৯০৭), বুখারী, মুসলিম ইবনু মাসউদ, আইশা, জাবির ও যুহাইর ইবনু উসমান (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আনাস (রাঃ)-এর সূত্রে বর্ণিত হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। আহমাদ ইবনু হাম্বাল বলেন, প্রায় সাড়ে তিন দিরহাম ওজন হবে একটি খেজুরের বীচির পরিমাণ সোনার ওজন। ইসহাক মনে করেন এর ওজন প্রায় সাড়ে পাচ দিরহামের সমান।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1095,
			"arabicnumber": 1095,
			"text": "১০৯৫। আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত আছে, সাফিয়্যা বিনতু হুয়াইকে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বিয়ে করে ওয়ালীমা অনুষ্ঠান করেন ছাতু ও খেজুর দিয়ে। — সহীহ, ইবনু মা-জাহ (১৯০৯), বুখারী, মুসলিম এ হাদীসটিকে আবু ঈসা হাসান গারীব বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1096,
			"arabicnumber": 1096,
			"text": "১০৯৬। মুহাম্মাদ ইবনু ইয়াহইয়া হুমাইদ হতে, তিনি সুফিয়ান হতে অনুরূপ হাদীস বর্ণনা করেছেন। — সহীহ, দেখুন পূর্বের হাদীস একাধিক বর্ণনাকারী হাদীসটি ইবনু উয়াইনা হতে যুহরীর বরাতে আনাসের সূত্রে বর্ণনা করেছেন। তারা ‘ওয়াইল তার পিতা হতে এই কথাটি উল্লেখ করেননি। আবু ঈসা বলেন, সুফিয়ান ইবনু উয়াইনা এই হাদীসে তাদলীস করেছেন অর্থাৎ নিজের সাক্ষাত বর্ণনাকারীর নাম উল্লেখ না করে তার উৰ্দ্ধতন বর্ণনাকারীর নাম উল্লেখ করেছেন। তাই কোন কোন সময় ওয়াইল তার পিতা হতে এর উল্লেখ করেননি আবার কোন কোন সময় তার উল্লেখ করেছেন।",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1097,
			"arabicnumber": 1097,
			"text": "১০৯৭। ইবনু মাসউদ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ বিয়ের প্রথম দিনের ভোজের ব্যবস্থা করা আবশ্যকীয়, দ্বিতীয় দিনের ভোজের ব্যবস্থা করা সুন্নাত এবং তৃতীয় দিনের ভোজ হল নাম-ডাক ছড়ানোর উদ্দেশে। যে ব্যক্তি নাম-ডাক ছড়াতে চায়, (কিয়ামতের দিন) আল্লাহ তা'আলা তাকে তদ্রুপ (অহংকারী ও মিথ্যুক হিসেবে) প্রকাশ করবেন। যঈফ, ইবনু মাজাহ (১৯১৫) আবূ ঈসা বলেনঃ ইবনু মাসউদের হাদীসটি আমরা শুধু যিয়াদ ইবনু “আবদুল্লাহর সূত্রেই মারফু হিসেবে জেনেছি। কিন্তু যিয়াদ বেশিরভাগ সময়ই গারীব ও মুনকার (প্রত্যাখ্যাত) হাদীসগুলোই বর্ণনা করেন। ইমাম বুখারী (রাহঃ) মুহাম্মাদ ইবনু উকবার সূত্রে বর্ণনা করেছেন, ওয়াকী বলেছেন, যিয়াদ সম্মানীত ব্যক্তি হওয়া সত্ত্বেও হাদীসে অনেক মিথ্যা বর্ণনা করে থাকেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1098,
			"arabicnumber": 1098,
			"text": "১০৯৮। ইবনু উমার (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের দাওয়াত দেওয়া হলে তোমরা তাতে অংশগ্রহণ কর। — সহীহ, ইবনু মা-জাহ (১৯১৪), বুখারী, মুসলিম আলী, আবু হুরাইরা, বারাআ, আনাস ও আবু আইয়ূব (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। ইবনু উমার (রাঃ) হতে বর্ণিত হাদীসটিকে আবু ঈসা হাসান সহীহ বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1099,
			"arabicnumber": 1099,
			"text": "১০৯৯। আবু মাসউদ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আবু শুআইব নামক একজন লোক তার গোশত বিক্রেতা গোলামের নিকটে এসে বললেন, পাঁচজনের খাবার আমার জন্য বানিয়ে দাও। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের মুখমণ্ডলে আমি ক্ষুধার ছাপ দেখতে পেয়েছি। সে খাবার বানানোর পর তিনি লোক পাঠিয়ে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এবং তার সাথে বসে থাকা লোকদের দাওয়াত দেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উঠে রাওয়ানা হলে এক লোক তাদের অনুসরণ করে, দাওয়াত দেওয়ার সময় সে লোকটি তাদের সাথে ছিল না। বাড়ীর দরজায় পৌছে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বাড়ীর মালিককে বললেনঃ আরো এক লোক আমাদের পিছে পিছে এসেছে। তুমি আমাদের দাওয়াত দেওয়ার সময় সে আমাদের সাথে ছিল না। তুমি অনুমতি দিলে তবে সে তোমার বাড়ীতে আসবে। আবূ শুআইব বললেন, তাকেও আমি অনুমতি দিলাম, সে যেন আসে। — সহীহ বুখারী, মুসলিম এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। ইবনু উমর (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1100,
			"arabicnumber": 1100,
			"text": "১১০০। জাবির ইবনু আবদুল্লাহ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, এক মহিলাকে বিয়ে করে আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকটে গেলাম। তিনি বললেনঃ হে জাবির! তুমি কি বিয়ে করেছ? আমি বললাম, হ্যাঁ। তিনি বললেনঃ কুমারী মেয়ে না বিধবা মেয়ে? আমি বললাম, না, বরং বিধবা। তিনি বললেনঃ কুমারী মেয়েকে বিয়ে করলে না কেন? তাহলে তার সাথে তুমিও আনন্দ করতে পারতে এবং তোমার সাথে সেও আমোদ-প্রমোদ করতে পারত। আমি বললাম, হে আল্লাহর রাসূল! মৃত্যুর সময় আবদুল্লাহ (আমার পিতা) সাতটি অথবা নয়টি মেয়ে রেখে গেছেন। এজন্য এমন মহিলাকে এনেছি যেন সে তাদের দেখাশোনা করতে পারে। আমার জন্য তখন তিনি দু'আ করলেন। — সহীহ, ইরওয়া (১৭৮), বুখারী, মুসলিম উবাই ইবনু কাব ও কাব ইবনু উজরা (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। জাবির (রাঃ)-এর হাদীসটিকে আবু ঈসা হাসান সহীহ বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1101,
			"arabicnumber": 1101,
			"text": "১১০১। আবূ মূসা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ অভিভাবক ব্যতীত বিয়ে সম্পন্ন হতে পারে না। — সহীহ, ইবনু মা-জাহ (১৮৮১) আইশা, ইবনু আব্বাস, আবু হুরাইরা ও ইমরান ইবনু হুসাইন (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1102,
			"arabicnumber": 1102,
			"text": "১১০২। আইশা (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ অভিভাবকের অনুমতি ব্যতীত কোন মহিলা বিয়ে করলেতার বিয়ে বাতিল,তার বিয়ে বাতিল, তার বিয়ে বাতিল। কিন্তু তার সাথে তার স্বামী সহবাস করলে তবে সে তার লজ্জাস্থান হালাল মনে করে সংগত হওয়ার কারণে তার নিকট মোহরের অধিকারী হবে। যদি অভিভাবকগণ বিবাদ করে তাহলে যে ব্যক্তির কোন অভিভাবক নেই তার ওয়ালী হবে দেশের শাসক। — সহীহ, ইরওয়া (১৮৪০) আইশা (রাঃ) হতে বর্ণিত এ হাদীসটিকে আবু ঈসা হাসান বলেছেন। ইবনু জুরাইজ (রাহঃ) হতে ইয়াহইয়া ইবনু সাঈদ, ইয়াহইয়া ইবনু আইয়ুব ও সুফিয়ান সাওরীসহ একদল হাফিজ মুহাদিস এরকমই বর্ণনা করেছেন। আবু ঈসা বলেন, আবু মূসা (রাঃ)-এর সূত্রে বর্ণিত (১১০১ নং) হাদীসের সনদে মতের অমিল আছে। উপরোক্ত হাদীসটি ইসরাঈল, শারীক, আবু আওয়ানা, যুহাইর, কাইস ইবনুর রাবী প্রমুখ আবূ ইসহাক হতে, তিনি আবু বুরদা হতে, তিনি আবু মূসা (রাঃ) হতে, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেছেন। আসবাত ইবনু মুহাম্মাদ ও যাইদ ইবনু হুবাব-ইউনুস ইবনু আবু ইসহাক হতে, তিনি আবু ইসহাক হতে, তিনি আবু বুরদা হতে, তিনি আবু মূসা (রাঃ) হতে, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেছেন। আবু উবাইদা আল হাদ্দাদ ইউনুস ইবনু আবু ইসহাক হতে, তিনি আবু বুরদা হতে, তিনি আবু মূসা হতে, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে একই রকম বর্ণনা করেছেন। এ সনদের মধ্যে আবৃ ইসহাকের উল্লেখ নেই। এ সূত্রেও ইউনুস ইবনু আবূ ইসহাক-আবু ইসহাক হতে, তিনি আবু বুরদা হতে, তিনি আবু মুসা হতে তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এরকমই বর্ণিত আছে। শুবা ও সাওরী-আবু ইসহাক হতে, তিনি আবু বুরদা হতে, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেছেনঃ “অভিভাবকের অনুপস্থিতিতে বিয়ে সম্পাদন হয় না”। সুফিয়ানের কতক অনুসারী তার সুত্রে আবু ইসহাক হতে, তিনি আবু বুরদা হতে, তিনি আবু মূসার সূত্রে বর্ণনা করেছেন, কিন্তু তা সঠিক নয়। আমি মনে করি আবু ইসহাক আবু বুরদা হতে, তিনি আবু মূসা (রাঃ)-এর সূত্রে যারা বর্ণনা করেছেন যে, “অভিভাবকের অনুপস্থিতিতে বিয়ে হয় না” তাদের বর্ণনাটি অনেক বেশি সহীহ। কারণ, তারা আবু ইসহাকের নিকট বিভিন্ন সময় এ হাদীস শুনেছেন। এ হাদীসটি আবু ইসহাকের নিকট হতে যারা বর্ণনা করেছেন তাদের তুলনায় শুবা ও সুফিয়ান সাওরী বেশি স্মরণশক্তির অধিকারী ও নির্ভরযোগ্য হলেও তাদের সবার বর্ণনাই আমার মতে বেশি সহীহ ও পরস্পর সংগতিপুর্ণ। উক্ত হাদীস আবু ইসহাকের নিকট একই বৈঠকে শুবা ও সাওরী শুনেছেন এবং এ কথার প্রমাণ আছে মাহমূদ ইবনু গাইলানের বর্ণনায়। তিনি বলেন, আবু দাউদ বলেছেন যে, শুবা বলেছেন, আবু ইসহাকের নিকট আমি সুফিয়ান সাওরকে প্রশ্ন করতে শুনেছিঃ আপনি কি আবু বুরদা (রাঃ)-কে বলতে শুনেছেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ “অভিভাবকের অনুপস্থিতিতে বিয়ে হয় না”? তিনি উত্তরে বললেন, হ্যাঁ। অতএব, উপরোক্ত বর্ণনা প্রমাণ করে যে, এই হাদীসটি একই সময়ে শুবা ও সাওরী শুনেছেন। ইসরাঈল আবু ইসহাকের নিকট হতে রিওয়ায়াতের ক্ষেত্রে খুবই বিশ্বস্ত। মুহাম্মাদ ইবনুল মুসান্না বলেন, আবদুর রাহমান ইবনু মাহদীকে আমি বলতে শুনেছিঃ ইসরাঈলের উপর যে সময় হতে আমি নির্ভর করেছি আমি সে সময় হতে বঞ্চিত হয়েছি সাওয়ারীর বরাতে বর্ণিত আবু ইসহাকের হাদীসমূহ হতে। কেননা, তিনি পূর্ণভাবে আবু ইসহাকের রিওয়ায়াতগুলি বর্ণনা করতেন। আমার মতে অত্র অনুচ্ছেদে আইশা (রাঃ) হতে বর্ণিত হাদীস “অভিভাবক ব্যতীত বিয়ে ঠিক হয়না\" হাদীসটি হাসান। আলোচ্য হাদিসটি ইবনু জুরাইজ-সুলাইমান ইবনু মুসা হতে, তিনি যুহরী হতে, তিনি উরওয়া হতে, তিনি আইশা (রাঃ) হতে, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেছেন। উপরোক্ত হাদীসটি হাজ্জাজ ইবনু আরতাত ও জাফর ইবনু রাবীআ-যুহরী হতে, তিনি উরওয়া হতে, তিনি আইশা (রাঃ) হতে, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেছেন। উপরোক্ত হাদীসের ন্যায় হিশাম ইবনু উরওয়া-উরওয়া হতে, তিনি আইশা (রাঃ) হতে, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এ সনদেও বর্ণিত আছে। এই শেষোক্ত সনদ প্রসঙ্গে কোন কোন হাদীস বিশারদ সামালোচনা করেছেন। ইবনু জুরাইজ বলেন, এক সময় আমি এ হাদীস প্রসঙ্গে যুহরীর সাথে দেখা করে তাকে প্রশ্ন করলে তিনি এটাকে অস্বীকার করেন। এ কারণেই উপরোক্ত সনদসূত্রটিকে মুহাদ্দিসগণ দুর্বল বলেছেন। ইবনু মাঈন বলেন, উক্ত কথাটি ইবনু জুরাইজের বরাতে শুধুমাত্র ইসমাঈল ইবনু ইবরাহীমই উল্লেখ করেছেন। কিন্তু ইবনু জুরাইজ হতে ইসমাঈলের কিছু শ্রুতি খুব একটা প্রমাণিত নয়। তবে তিনি আবদুল মাজীদ ইবনু আবদুল আযীয ইবনু আবূ রাওয়াদের পাণ্ডুলিপির সাথে পাণ্ডুলিপিকে মিলিয়ে সংশোধন করে নেন। অন্যথায় ইসমাঈল ইবনু জুরাইজ হতে তিনি কিছুই শুনেননি। ইবনু জুরাইজের বরাতে ইসমাঈলের বর্ণিত রিওয়ায়াতসমূহকে ইয়াহইয়া (রাহঃ) দুর্বল বলেছেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের বিশেষজ্ঞ সাহাবীদের মধ্যে উমার ইবনুল খাত্তাব, আলী ইবনু আবু তালিব, আবদুল্লাহ ইবনু আব্বাস, আবু হুরাইরা (রাঃ) ও অন্যরা “অভিভাবকের অনুপস্থিতিতে বিয়ে হতে পারে না” এ হাদীস অনুযায়ী মত দিয়েছেন। একদল ফিকহবিদ তাবিঈ বলেছেন, অভিভাবকগণের বিনা অনুমতিতে কোন মহিলা বিয়েকরতে পারে না (করলে তা বাতিল বলে গণ্য হবে)। এদের মধ্যে আছেন সাঈদ ইবনুল মুসাইয়্যিব, হাসান বাসরী, শুরাইহ, ইবরাহীম নাখঈ, উমার ইবনু আবদুল আযীয ও অন্যরা। এই কথা বলেছেন সুফিয়ান সাওরী, আওযাঈ, মালিক, আবদুল্লাহ ইবনুল মুবারাক, শাফিঈ, আহমাদ ও ইসহাকও।",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1103,
			"arabicnumber": 1103,
			"text": "১১০৩৷ ইবনু আব্বাস (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ যেসব নারী সাক্ষী ছাড়া নিজেদেরকে বিয়ে দেয় তারা ব্যভিচারিনী, যেনাকারিনী। যঈফ, ইরওয়া (১৮৬২) ইউসুফ ইবনু হাম্মাদ বলেন, আবদুল আলা এ হাদীসটি কিতাবুত তাফসীরে মারফু (রাসূলের কথা) হিসেবে এবং কিতাবুত তালাকে মাওকুফ (ইবনু আব্বাসের কথা) হিসাবে বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1104,
			"arabicnumber": 1104,
			"text": "১১০৪। কুতাইবা-গুনদার মুহাম্মাদ ইবনু জাফর হতে তিনি সাঈদ ইবনু আবী আরুবার সূত্রে উপরোক্ত হাদীসের মতই হাদীস বর্ণনা করেছেন। এই সূত্রে এটা মারফু হিসেবে বর্ণনা করেন নাই। আর এটাই অধিক সহীহ। দেখুন পূর্বের হাদীস আবূ ঈসা বলেন, এটি একটি অরক্ষিত হাদীস। আবদুল আলা ব্যতীত অন্য কেউ এটাকে মারফু হিসেবে বর্ণনা করেননি। আব্দুল আ'লা-এর সূত্রে সাঈদ হতে এ হাদীসটি মাওকুফ হিসাবেও বর্ণিত হয়েছে। সঠিক কথা হল, হাদীসের উল্লেখিত কথাগুলো (সাক্ষী ব্যতীত বিয়ে হয় না) ইবনু আব্বাসের। একাধিক রাবী এটাকে সাঈদ ইবনু আবী আরূবা হতেও মাওকুফ হিসেবে বর্ণনা করেছেন। এ অনুচ্ছেদে ইমরান ইবনু হুসাইন, আনাস ও আবূ হুরাইরা (রাঃ) হতেও হাদীস বর্ণিত আছে। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সাহাবী ও তাবিঈগণ এ হাদীস অনুযায়ী আমল করেছেন। তারা সবাই বলেছেন, সাক্ষীর হাযিরা ব্যতীত বিয়ে হয় না। পূর্বকালের আলিমদের কেউই এ ব্যাপারে মতপার্থক্য করেননি। মুতাআখরীন আলিমগণ এ বিষয়ে মতভেদ করেছেন। তাদের মতদ্বৈততা হয়েছেঃ একজন সাক্ষীর সাক্ষ্য দেয়ার পর অন্য একজন হাযির হয়ে সাক্ষ্য দিলে বিয়ে বৈধ হবে কি না এ বিষয় নিয়ে। কুফার বেশীরভাগ আলিম ও অন্যান্যের মতে, একই সময়ে দু’জন সাক্ষীর হাযিরা ছাড়া বিয়ের আকদ অনুষ্ঠান জায়িয নয়। মদীনার একদল আলিমের মতেঃ একজন সাক্ষী চলে যাবার পর আর একজন সাক্ষী হাযির হলে বিয়ে জায়িয হবে, যদি তারা এর ঘোষণা দিয়ে থাকে। ইমাম মালিকেরও এই মত। মদীনাবাসীদের বর্ণনামতে ইসহাকেরও এই মত। ইমাম আহমাদ ও ইসহাক বলেছেন, একজন পুরুষ ও দুইজন মহিলার সাক্ষ্যেও বিয়ের অনুষ্ঠান জায়িয।",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1105,
			"arabicnumber": 1105,
			"text": "১১০৫ ৷ আবদুল্লাহ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমাদেরকে নামাযের তাশাহহুদ এবং (বিয়ে ইত্যাদি) প্রয়োজনের তাশাহহুদও রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম শিক্ষা দিয়েছেন। তিনি বলেনঃ নামাযের তাশাহহুদ হচ্ছে, “সমস্ত সম্মান, ইবাদাত ও পবিত্রতা আল্লাহ তা'আলার জন্য। হে নবী! আপনার উপর শান্তি বর্ষিত হোক এবং আল্লাহ তা'আলার অনুগ্রহ ও প্রাচুর্যও। আমাদের ও আল্লাহ তা'আলার নেক বান্দাদের উপর শান্তি নেমে আসুক। আমি সাক্ষ্য দিচ্ছি, আল্লাহ ব্যতীত আর কোন মা’বুদ নেই। আমি আরো সাক্ষ্য দিচ্ছি, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার বান্দা ও রাসূল\"। আর প্রয়োজনের (হাজাতের) তাশাহহুদ হলঃ “সকল প্রশংসা শুধুমাত্র আল্লাহ তা'আলার জন্য। তার নিকটই আমরা সাহায্য চাই এবং তার নিকটই ক্ষমা চাই। আমরা আল্লাহর নিকট আমাদের কু-প্রবৃত্তি ও আমাদের মন্দ কাজসমূহ হতে আশ্রয় চাই। যে লোককে তিনি হিদায়াত দান করেন তাকে কেউ পথভ্রষ্ট করতে পারে না, আর যাকে তিনি গুমরাহ করেন তাকে কেউ পথ দেখাতে পারে না। আমি সাক্ষ্য দিচ্ছি যে, আল্লাহ তা'আলা ব্যতীত আর কোন মা’বুদ নেই। আমি আরো সাক্ষ্য দিচ্ছি যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার বান্দা ও তার রাসূল\"। বর্ণনাকারী বলেন, তিনি আরো তিনটি আয়াত পাঠ করতেন। বর্ণনাকারী আবসার বলেন, এ তিনটি আয়াত সুফিয়ান সাওরী উল্লেখ করেছেনঃ ১. “হে ঈমানদারগণ! বাস্তবিকই তোমরা আল্লাহ তা'আলাকে ভয় কর এবং তোমরা মৃত্যুর পূর্ব মূহুর্ত পর্যন্ত মুসলিম (অনুগত) না হয়ে মৃত্যু বরণ করো না” (সূরাঃ আলে-ইমরান— ১০২)। ২. হে জনগণ! ভয় কর তোমাদের প্রভুকে। তিনি একটি প্রাণ হতে তোমাদেরকে সৃষ্টি করেছেন এবং তার জোড়াও তৈরী করেছেন তা হতেই। তিনি অসংখ্য পুরুষ ও স্ত্রীলোক তাদের উভয়ের মাধ্যমে পৃথিবীতে ছড়িয়ে দিয়েছেন। তোমরা ভয় কর আল্লাহ তা'আলাকে, তোমরা যার দোহাই দিয়ে নিজ নিজ অধিকার দাবি কর একে অপরের নিকট এবং বিরত থাক আত্মীয়তার সম্পর্ক বিনষ্ট করা হতে। আল্লাহ অবশ্যই তোমাদের কাজের পর্যবেক্ষণ করছেন\" (সূরাঃ নিসা- ১)। ৩. “হে ঈমানদারগণ! আল্লাহ তা'আলাকে ভয় কর এবং সত্য কথা বল। তোমাদের কাজ-কর্ম আল্লাহ সংশোধন করে দিবেন এবং তোমাদের গুনাহসমূহ মাফ করে দিবেন। যে লোক আল্লাহ ও তার রাসূলের আনুগত্য করে, সে লোক বড় রকমের সাফল্য পেল\" (সূরাঃ আহ্যাব- ৭০,৭১)। — সহীহ, ইবনু মা-জাহ (১৮৯২) আদী ইবনু হাতিম (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবদুল্লাহ (রাঃ)-এর বর্ণিত হাদীসটিকে আবু ঈসা হাসান বলেছেন। আমাশ বর্ণনা করেছেন আবু ইসহাক হতে, তিনি আল আহওয়াস হতে তিনি আব্দুল্লাহ হতে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে। আর শুবা বর্ণনা করেছেনঃ আবু ইসহাক হতে, তিনি আবু উবাইদাহ হতে তিনি আব্দুল্লাহ হতে তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে। উভয় সূত্রই সহীহ। সুফিয়ান সাওরী এবং অন্যান্য কিছু আলিম বলেছেন, খুতবা পাঠ ছাড়াও বিয়ে শুদ্ধ হবে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1106,
			"arabicnumber": 1106,
			"text": "১১০৬। আবু হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যেসব খুতবায় (বক্তৃতায়) তাশাহহুদ পাঠ করা হয় না তা কাটা হাতের সমতুল্য। — সহীহ, আল আজবিতুন নাফিয়াহ (৪৮), তামামুল মিন্নাহ তাহকীক ছানী এ হাদীসটিকে আবু ঈসা হাসান গারীব বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1107,
			"arabicnumber": 1107,
			"text": "১১০৭। আবু হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ প্রাপ্তবয়স্কা (সায়্যিব) নারীকে তার সুস্পষ্ট অনুমতি ব্যতীত বিয়ে দেয়া যাবে না। কুমারী মেয়েকে তার অনুমতি ব্যতীত বিয়ে দেয়া যাবে না। নীরবতাই তার অনুমতি। — সহীহ, ইবনু মা-জাহ (১৮৭১), বুখারী ও মুসলিম উমার, ইবনু আব্বাস, আইশা ও উরস ইবনু উমাইরা (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবু হুরাইরা (রাঃ) হতে বর্ণিত হাদীসটিকে আবু ঈসা হাসান সহীহ বলেছেন। এ হাদীস অনুযায়ী আলিমগণ আমল করেছেন। তাদের মতে, প্রাপ্তবয়স্কা (সায়্যিব) নারীকে তার সুস্পষ্ট অনুমতি ব্যতীত বিয়ে দেয়া যাবে না। তার পিতা যদি তার প্রকাশ্য অনুমতি ব্যতীত তাকে বিয়ে দেয় এবং সে মেয়ে যদি এ বিয়ে পছন্দ না করে তাহলে সকল আলিমের মত অনুযায়ী তা বাতিল বলে গণ্য বিষয়ে আলিমদের মধ্যে মত পার্থক্য আছে। যদি প্রাপ্তবয়স্কা কুমারী মেয়েকে তার পিতা তার অনুমতি ব্যতীত বিয়ে দেয় এবং এ বিয়ে যদি সে অপছন্দ করে, তবে কুফার বেশিরভাগ আলিমের মতে বিয়ে বাতিল বলে গণ্য হবে। মদীনার একদল আলিমের মতে, যদি পিতা তাকে বিয়ে দেয় এবং তা যদি সে পছন্দ না করে তবুও এ বিয়ে জায়িয হবে। এই মত দিয়েছেন ইমাম মালিক, শাফিঈ, আহমাদ ও ইসহাক।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1108,
			"arabicnumber": 1108,
			"text": "১১০৮। ইবনু আব্বাস (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, নিজের (বিয়ের) ব্যাপারে প্রাপ্তবয়স্কা নারী (আয়্যিম) তার অভিভাবক হতে বেশি কর্তৃত্বশীল। কুমারীর (বিকর, বিয়ের) ব্যাপারে তার মতামত নেয়া আবশ্যক। তার নীরবতাই তার সম্মতি। — সহীহ, ইবনু মা-জাহ (১৮৭০) মুসলিম এ হাদীসটি হাসান সহীহ। এ হাদীসটি ইমাম মালিকের সূত্রে শুবা ও সাওরী বর্ণনা করেছেন। এ হাদীসকে দলীল হিসাবে গ্রহণ করে একদল লোক বলেছেন, অভিভাবকের অনুপস্থিতিতেও বিয়ে জায়িয। কিন্তু এ হাদীসে তাদের জন্য দলীল নেই। কেননা, একাধিকসূত্রে ইবনু আব্বাসের নিকট হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ “অভিভাবকের অনুপস্থিতিতে বিয়ে হতে পারে না।” ইবনু আব্বাস (রাঃ) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মারা যাবার পর এ ফাতাওয়াই দিয়েছেন যে, অভিভাবকের অনুপস্থিতিতে বিয়ে হতে পারে না। “বয়স্কা (আয়্যিম) নারী তার বিয়ের ব্যাপারে তার অভিভাবকের চেয়ে বেশি কর্তৃত্বশীল\", বেশিরভাগ আলিমের মতে এ হাদীসের তাৎপর্য হলঃ বয়স্কা মহিলার অভিভাবক তার মতামত এবং সম্মতি না নিয়ে তাকে বিয়ে দিতে পারে না, যদি দেয় তাহলে তা বাতিল বলে গণ্য হবে, খিযামের কন্যা খানাসার হাদীসের ভিত্তিতে। তিনি বয়স্কা ছিলেন। তার বাবা তাকে বিয়ে দিলে তিনি তা অপছন্দ করেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার এ বিয়ে বাতিল করে দেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1109,
			"arabicnumber": 1109,
			"text": "১১০৯। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ইয়াতীম কুমারীর (বিয়ের) ব্যাপারে তার নিজের মত নিতে হবে। সে চুপ থাকলে তবে এটাই তার সম্মতিগণ্য হয়ে যাবে। সে সরাসরি অস্বীকার করলে তবে তার উপর জোর খাটানো যাবে না। - হাসান সহীহ, ইরওয়া (১৮৩৪), সহীহ আবু দাউদ (১৮২৫) আবু মূসা, আইশা ও ইবনু উমর (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবু হুরাইরা (রাঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা হাসান বলেছেন। আলিমদের মধ্যে ইয়াতীম মেয়ের বিয়ের ব্যাপারে মতবিরোধ আছে। একদল আলিমের মতানুযায়ী ইয়াতীম মেয়েকে বিয়ে দিলে সে বালেগ না হওয়া পর্যন্ত তা স্থগিত থাকবে। বালেগ হওয়ার পর সে চাইলে এ বিয়ে বহাল রাখতে পারে অথবা নাকচও করে দিতে পারে। এই মত দিয়েছেন একদল তাবিঈ ও অপরাপর আলিম। আর একদল আলিম বলেছেন, বালেগ না হওয়া পর্যন্ত ইয়াতীম মেয়ের বিয়ে দেয়া যাবে না। কেননা, বিয়ের ক্ষেত্রে ইখতিয়ার জায়িয নেই। এই মত দিয়েছেন সুফিয়ান সাওরী, শাফিঈ ও অপরাপর আলিম। আহমাদ ও ইসহাক বলেছেন, নয় বছরে পদার্পণ করার পর ইয়াতীম বালিকাকে বিয়ে দেয়া হলে এবং সে এতে রাজী থাকলে তা জায়িয হবে। বিয়ে বহাল রাখা বা ভেঙ্গে দেয়ার ক্ষেত্রে বালেগ হওয়ার পর তার কোন কর্তৃত্ব থাকবে না। আইশা (রাঃ)-এর বিষয়কে তারা দলীল হিসাবে নিয়েছেন। আইশা (রাঃ)-কে নিয়ে তার নয় বছর বয়সে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বাসর যাপন করেছেন। আইশা (রাঃ) বলেছেন, কোন বালিকা নয় বছরে পদার্পণ করলে সে মহিলা বলে গণ্য হবে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1110,
			"arabicnumber": 1110,
			"text": "১১১০। সামুরা ইবনু জুনদুব (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ (সম-পর্যায়ের) দুইজন অভিভাবক কোন মেয়েকে (ভিন্ন দুই ব্যক্তির নিকট) বিয়ে দিলে প্রথম জনের বিয়ে বহাল হবে। কোন ব্যক্তি (একই মাল) দু'জন খরিদ্দারের নিকট বিক্রয় করলে তা প্রথম খরিদ্দারই পাবে। যঈফ, ইরওয়া (১৮৫৩) বেচা কেনার হাদীস আবূ ঈসা বলেন, এ হাদীসটি হাসান। আলিমগণ এ হাদীস অনুযায়ী আমল করেন। বিষয়টি নিয়ে তাদের মধ্যে কোন মতদ্বৈততা আছে বলে আমাদের জানা নেই। এক অভিভাবক অপর অভিভাবকের আগে কনেকে বিয়ে দিলে প্রথম অভিভাবকের বিয়ে বহাল হবে এবং দ্বিতীয় অভিভাবকের দেয়া বিয়ে বাতিল বলে বিবেচিত হবে। আর যদি দুইজন অভিভাবক একই সময় (দুইজনের কাছে) বিয়ে দেয় তবে উভয়ের প্রদত্ত বিয়ে বাতিল বলে বিবেচিত হবে। সুফিয়ান সাওরী, আহমাদ ও ইসহাক এই মত দিয়েছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1111,
			"arabicnumber": 1111,
			"text": "১১১১। জাবির ইবনু আবদুল্লাহ (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে কোন গোলাম তার মনিবের বিনা অনুমতিতে বিয়ে করলে সে ব্যভিচারী। – হাসান, ইবনু মা-জাহ (১৯৫৯) ইবনু উমর (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। জাবির (রাঃ) হতে বর্ণিত হাদীসটিকে আবু ঈসা হাসান বলেছেন। ইবনু উমার (রাঃ) হতে আব্দুল্লাহ ইবনু মুহাম্মাদ ইবনু আকীলের সূত্রে এ হাদীসটি বর্ণিত আছে, কিন্তু তা সহীহ নয়। জাবিরের সূত্রটিই সহীহ। এ হাদীস অনুযায়ী রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সাহাবী ও তাবিঈগণ আমল করেছেন। তাদের মতে, কোন গোলাম মনিবের বিনা অনুমতিতে বিয়ে করলে তা জারিয হবে না। এই মত দিয়েছেন আহমাদ, ইসহাক ও অন্যরাও। এতে কোন মতভেদ নেই।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1112,
			"arabicnumber": 1112,
			"text": "১১১২। জাবির ইবনু আবদুল্লাহ (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ কোন গোলাম তার মনিবের বিনা অনুমতিতে বিয়ে করলে সে যিনাকারী বলে গণ্য হবে। – হাসান, দেখুন পূর্বের হাদীস এ হাদীসটিকে আবু ঈসা হাসান সহীহ বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1113,
			"arabicnumber": 1113,
			"text": "১১১৩। আবদুল্লাহ ইবনু আমির ইবনু রাবীআ (রহঃ) হতে তার পিতার সূত্রে বর্ণিত আছে, ফাযারা গোত্রের এক মহিলা একজোড়া জুতার বদলে বিয়ে করলে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তুমি একজোড়া জুতার বদলে তোমার জিন্দেগী ও সম্পদ সপে দিতে রাজী হয়ে গেলে? সে বলল, হ্যাঁ। রাবী বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এই বিয়ে অনুমোদন করলেন। যঈফ, ইবনু মাজাহ (১৮৮৮) এ অনুচ্ছেদে উমার, আবূ হুরাইরা, সাহল ইবনু সাদ, আবূ সাঈদ, আনাস, আইশা, জাবির ও আবূ হাদরাদ আল-আসলামী (রাঃ) হতেও হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, আমির ইবনু রাবীয়া (রাঃ) বর্ণিত হাদীসটি হাসান সহীহ। মোহরের পরিমাণ নিয়ে আলিমদের মধ্যে মতের অমিল আছে। সুফিয়ান সাওরী, শাফিঈ, আহমাদ ও ইসহাক বলেছেন, যে পরিমাণ মোহরে উভয়ে রাজী হবে ততটুকুই মোহর হবে। মালিক ইবনু আনাস বলেছেন, সর্বনিম্ন পরিমাণ মোহর এক দীনারের এক-চতুর্থাংশের কম হতে পারবে না। কুফাবাসী একদল আলিম বলেছেন, সর্বনিম্ন পরিমাণ মোহর দশ দিরহাম।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1114,
			"arabicnumber": 1114,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1115,
			"arabicnumber": 1115,
			"text": "১১১৫। আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সাফিয়্যাকে বিয়ে করেন তাকে আযাদ করে এবং তার মোহর নির্ধারণ করেন এই দাসত্ব মুক্তিকে। – সহীহ, ইবনু মা-জাহ (১৯৫৭), বুখারী, মুসলিম সাফিয়া (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আনাস (রাঃ) হতে বর্ণিত হাদীসটিকে আবু ঈসা হাসান সহীহ বলেছেন। এ হাদীস অনুযায়ী রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের একদল বিশেষজ্ঞ সাহাবী ও তাবিঈ আমল করেছেন। এই মত দিয়েছেন ইমাম শাফিঈ, আহমাদ ও ইসহাকও। আযাদ করে তা মোহর হিসেবে গণ্য করাকে একদল আলিম মাকরূহ বলেছেন। এক্ষেত্রে তারা মোহর নির্ধারণের পক্ষপাতী। কিন্তু প্রথম মতই অনেক বেশি সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1116,
			"arabicnumber": 1116,
			"text": "১১১৬। আবু বুরদা ইবনু আবূ মূসা (রাঃ) হতে তার পিতার সূত্রে বর্ণিত আছে, তিনি (আবু মূসা) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তিন প্রকার লোকের সাওয়াব দ্বিগুণ করা হবে। যে গোলাম আল্লাহ ও তার মনিবের হাক সঠিকভাবে আদায় করেছে। তার সাওয়াব দ্বিগুণ করা হবে। যে লোকের সুন্দরী বাদী ছিল, সে তাকে উত্তম আচরণ ও আদব-কায়দা শিখিয়েছে এবং তাকে পরবর্তীতে মুক্ত করে বিয়ে করেছে শুধুমাত্র আল্লাহ্ তা'আলার সন্তুষ্টির জন্য। তার সাওয়াবও দ্বিগুণ করা হবে। পূর্ববর্তী কিতাবের প্রতি যে লোক ঈমান এনেছে, তারপর পরবর্তী কিতাব (কুরআন) আসার পর তার উপরও ঈমান এনেছে, তাকেও দ্বিগুণ সাওয়াব প্রদান করা হবে। — সহীহ, ইবনু মা-জাহ (১৯৫৬) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের উপরোক্ত হাদীসের মত হাদীস আবূ মূসা (রাঃ) হতে বর্ণনা করেছেন ইবনু আবু উমার সুফিয়ান হতে, তিনি সালিহ ইবনু সালিহ হতে, তিনি শা'বী হতে, তিনি আবূ বুরদাহ হতে। আবু মূসা (রাঃ) হতে বর্ণিত হাদীসটিকে আবু ঈসা হাসান সহীহ বলেছেন। আবূ বুরদার নাম আমির, পিতা আবদুল্লাহ, দাদা কাইস। শুবা ও সুফিয়ান সাওরী এই হাদীসটি বর্ণনা করেছেন সালিহ ইবনু সালিহ এর সূত্রে। সালিহ ইবনু সালিহ হলেন আল-হাসান ইবনু সালিহের পিতা।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1117,
			"arabicnumber": 1117,
			"text": "১১১৭। আমর ইবনু শুআইব (রহঃ) হতে পর্যায়ক্রমে তার পিতা ও দাদার সূত্রে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে কোন লোক কোন নারীকে বিয়ে করে তার সাথে সহবাস করলে তার সাথে ঐ নারীর মেয়ের বিয়ে বৈধ নয়। সে যদি তার সাথে সহবাস না করে থাকে তবে সে তার কন্যাকে বিয়ে করতে পারে। যে কোন লোক কোন নারীকে বিয়ে করার পর তার সাথে সহবাস করুক বা না করুক, তার মায়ের সাথে তার বিয়ে বৈধ নয়। যঈফ, ইরওয়া (১৮৭৯) আবূ ঈসা বলেন, এ হাদীসটি সনদের দিক হতে সহীহ নয়। আমর ইবনু শুআইব (রাহঃ) হতে ইবনু লাহিয়া ও মুসান্না ইবনুস সাব্বাহ এই হাদীসটি বর্ণনা করেছেন। হাদীস শাস্ত্রে তারা উভয়ে যঈফ (দুর্বল)। বেশিরভাগ বিশেষজ্ঞ আলিম এ হাদীস অনুযায়ী আমল করেছেন। তারা বলেছেন, কোন ব্যক্তি কোন নারীকে বিয়ে করার পর এবং সহবাস করার আগে তালাক দিলে তার কন্যাকে তার বিয়ে করা বৈধ। এ লোক তার কন্যাকে বিয়ে করার পর এবং সহবাস করার আগে তাকে তালাক দিলে তার মাকে নতুন করে বিয়ে করা তার জন্য বৈধ হবে না। যেহেতু আল্লাহ তা'আলা বলেছেনঃ “এবং তোমাদের স্ত্রীদের মায়েদেরকে” (বিয়ে করা তোমাদের জন্য বৈধ নয়)। ইমাম শাফিঈ, আহমাদ ও ইসহাকও এই মত দিয়েছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1118,
			"arabicnumber": 1118,
			"text": "১১১৮। আইশা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকটে রিফাআ আল-কুরায়ীর স্ত্রী এসে বললো, আমি রিফাআর স্ত্রী ছিলাম। সে আমাকে বাত্তা তালাক অর্থাৎ তিন তালাক দেয়। তারপর আমি বিয়ে করি আবদুর রাহমান ইবনু যুবাইরকে কিন্তু তার সাথে কাপড়ের পাড়ের মত (অকেজো পুরুষাঙ্গ) ব্যতীত আর কিছুই নেই। তিনি প্রশ্ন করলেন, তুমি কি রিফাআর নিকটে আবার ফিরে যেতে চাও? কিন্তু তা হবে না, তুমি যতক্ষণ না তার মধু আস্বাদন করবে এবং সে তোমার মধু আস্বাদন করবে (তারপর তালাক দিবে)। — সহীহ, ইবনু মা-জাহ (১৯৩৪), নাসা-ঈ ইবনু উমার, আনাস, রুমাইসা অথবা গুমাইসা ও আবু হুরাইরা (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আইশা (রাঃ) হতে বর্ণিত হাদীসটিকে আবু ঈসা হাসান সহীহ বলেছেন। এ হাদীস অনুযায়ী রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের বেশিরভাগ বিশেষজ্ঞ সাহাবী ও অপরাপর আলিম মত দিয়েছেন। কোন লোক তার স্ত্রীকে তিন তালাক দেয়ার পর সে অন্য স্বামী গ্রহণ করলে এবং তার সাথে সহবাসের পূর্বেই এই দ্বিতীয় স্বামী তাকে তালাক দিলে সে পূর্ব স্বামীর জন্য হালাল হবে না, দ্বিতীয় স্বামীর সাথে যে পর্যন্ত না তার সহবাস হবে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1119,
			"arabicnumber": 1119,
			"text": "১১১৯। আলী (রাঃ) ও জাবির (রাঃ) হতে বর্ণিত আছে, তারা উভয়ে বলেছেন, যে লোক হিলা করে এবং যে লোকের জন্য হিলা করা হয় তাদের উভয়ের প্রতি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অভিসম্পাত করেছেন। — সহীহ, ইবনু মা-জাহ (১৫৩৫) ইবনু মাসউদ, আবু হুরাইরা, উকবা ইবনু আমির ও ইবনু আব্বাস (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। এ হাদীসটিকে আবু ঈসা মা'লুল (সনদে সূক্ষ্ম ক্রটি আছে) বলেছেন। আর এভাবে বর্ণনা করেছেন আল-হারিস হতে, তিনি আলী ও আমির হতে, তিনি আলী ও আমির হতে, তারা জাবির ইবনু আব্দুল্লাহ হতে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে, এ হাদীসের সনদ প্রতিষ্ঠিত নয়। কেননা, মুজালিদ ইবনু সাঈদকে ইমাম আহমাদ ও অন্যরা যঈফ বলেছেন। মুজালিদ-আমির হতে, তিনি জাবির (রাঃ) হতে, তিনি আলী (রাঃ)-এর সূত্রে আবদুল্লাহ ইবনু নুমাইর এই হাদীসটিকে বর্ণনা করেছেন। কিন্তু তাতে ইবনু নুমাইর বিভ্রান্তির শিকার হয়েছেন। প্রথম সূত্রটিই অনেক বেশি সহীহ। এ হাদীসটি মুগীরা, ইবনু আবু খালিদ ও অন্যরা শাবী হতে, তিনি হারিস হতে, তিনি আলী (রাঃ) হতে বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1120,
			"arabicnumber": 1120,
			"text": "১১২০। আবদুল্লাহ ইবনু মাসউদ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, যে লোক হিলা করে এবং যে লোকের জন্য হিলা করা হয় উভয়কেই রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অভিসম্পাত করেছেন। — সহীহ, দেখুন পূর্বের হাদীস এ হাদীসটিকে আবু ঈসা হাসান সহীহ বলেছেন। আবু কাইস আল-আওদীর নাম আবদুর রাহমান, পিতা সারওয়ান। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট হতে একাধিক সূত্রে এ হাদীসটি বর্ণিত হয়েছে। এ হাদীস অনুযায়ী বিশেষজ্ঞ সাহাবীদের মধ্যে উমার ইবনুল খাত্তাব, উসমান ইবনু আফফান, আবদুল্লাহ ইবনু আমর (রাঃ) প্রমুখ সাহাবী মত দিয়েছেন। এই মত ফিকহবিদ তাবিঈদেরও। একই কথা বলেছেন সুফিয়ান সাওরী, ইবনু মুবারাক, শাফিঈ, আহমাদ ও ইসহাকও। ওয়াকীও একইরকম মত দিয়েছেন এবং বলেছেন, এই বিষয়ে আহলুর রায়ের মত ছুড়ে ফেলে দেয়া কর্তব্য। ওয়াকী বলেন, সুফিয়ান সাওরী বলেছেন, হিলার উদ্দশ্যে কোন নারীকে কোন লোক বিয়ে করার পর তাকে নিজের বিবাহধীনে রাখতে চাইলে তা জায়িয নয়। নতুনভাবে এই মহিলার সাথে তার বিয়ে হতে হবে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1121,
			"arabicnumber": 1121,
			"text": "১১২১। আলী ইবনু আবু তালিব (রাঃ) হতে বর্ণিত আছে, খাইবারের যুদ্ধের দিন নারীদের সাথে মুত্আ বিয়ে করতে এবং গৃহপালিত গাধার গোশত খেতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিষিদ্ধ ঘোষণা করেছেন। – সহীহ, ইবনু মা-জাহ (১৯৬১), বুখারী, মুসলিম সাবরা আল-জুহানী ও আবু হুরাইরা (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আলী (রাঃ) বর্ণিত হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। এ হাদীস অনুযায়ী রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের বিশেষজ্ঞ সাহাবী ও তাবিঈগণ আমল করেছেন। ইবনু আব্বাস (রাঃ) হতে মুতআর অনুমতি আছে বলে বর্ণিত আছে। কিন্তু এটা করতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিষেধ করেছেন বলে তাকে জানানো হলে তিনি তার মত প্রত্যাহার করেন। মুতআ বিয়ে বেশিরভাগ আলিমের মতে হারাম। একথা বলেছেন সুফিয়ান সাওরী, ইবনুল মুবারাক, শাফিঈ, আহমাদ ও ইসহাকও।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1122,
			"arabicnumber": 1122,
			"text": "১১২২। ইবনু আব্বাস (রাঃ) হতে বর্ণিত আছে, তিনি বলেছেন, ইসলামের প্রথম যুগে মুত'আ বিয়ের চর্চা ছিল। কোন ব্যক্তি কাজের উদ্দেশে কোন অপরিচিত লোকালয়ে গিয়ে পৌছত। সেখানে সে যত দিন থাকবে বলে মনে করত তত দিনের জন্য সে কোন নারীকে বিয়ে করত। সে তার মাল-পত্রের দেখাশুনা করত এবং তাকে রান্না করে দিত। অবশেষে যখন এ আয়াত অবতীর্ণ হলঃ “যারা নিজেদের লজ্জাস্থানের হিফাযাত করে, নিজেদের স্ত্রীদের ব্যতীত এবং তাদের ডান হাত যাদের মালিক হয় সেসব মেয়েলোক ব্যতীত। এসব ক্ষেত্রে (লজ্জাস্থানের হিফাযাত না করা হলেও) তারা ভৎসনা এবং তিরস্কারের যোগ্য নয়। এদের ব্যতীত অন্য কিছু চাইলে তারা অবশ্যই সীমালংঘনকারী হবে”-সূরা মু'মিনূনঃ ৫, ৬, ৭ এবং সূরা মাআরিজঃ ২৯, ৩০, ৩১। ইবনু আব্বাস (রাঃ) বলেনঃ তারপর এ দু'টি ব্যতীত সব লজ্জাস্থানই হারাম হয়ে গেল। মুনকার, ইরওয়া (১৯০৩), মিশকাত তাহকীক ছানী (৩১৫৮)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Munqar"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1123,
			"arabicnumber": 1123,
			"text": "১১২৩। ইমরান ইবনু হুসাইন (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ইসলামে জালাব’, ‘জানাব' বা ‘শিগার কোনটারই স্থান নেই। যে লোক ছিনতাই বা লুণ্ঠন করল সে লোক আমাদের অন্তর্ভুক্ত নয়।। – সহীহ, মিশকাত তাহকীক ছানী (২৯৪৭), সহীহ আবু দাউদ (২৩২৪) এ হাদীসটিকে আবু ঈসা হাসান সহীহ্ বলেছেন। আনাস, আবূ রাইহানা, ইবনু উমার, জাবির, মুআবিয়া, আবু হুরাইরা ও ওয়াঈল ইবনু হুজর (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1124,
			"arabicnumber": 1124,
			"text": "১১২৪ ৷ ইবনু উমর (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম শিগার নিষিদ্ধ করেছেন। – সহীহ, ইবনু মা-জাহ (১৮৮৩),বুখারী, মুসলিম এ হাদীসটিকে আবূ ঈসা হাসান সহীহ্ বলেছেন। এ হাদীস অনুযায়ী বেশিরভাগ আলিম আমল করেছেন। তারা শিগার (অদল-বদল) প্রথায় বিয়েকে জায়িয বলে মনে করেন না। শিগারের অর্থ এই যে, কোন ব্যক্তি কর্তৃক এই শর্তে তার মেয়েকে অন্য ব্যক্তির সাথে বিয়ে দেওয়া যে, বিনিময়ে দ্বিতীয় ব্যক্তি তার মেয়ে অথবা বোনকে প্রথমোক্ত ব্যক্তির সাথে বিয়ে দিবে এবং এদের মধ্যে কোন মোহরের আদান-প্রদান হবে না। এ ধরণের বিয়েকে ‘নিকাহে শিগার’ বলে। ইমাম শাফিঈ, আহমাদ ও ইসহাক বলেছেন, নিকাহে শিগার বাতিল, এটা জায়িয নয়, এমনকি মোহর নির্ধারণ করলেও। আতা ইবনু আবু রাবাহ বলেছেন, উভয়ই নিজ নিজ বিয়েকে ঠিক রাখবে এবং উভয়ের স্ত্রীর জন্য “মোহরে মিসাল’ নির্দিষ্ট হবে। কুফার আলিমদেরও এই মত।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1125,
			"arabicnumber": 1125,
			"text": "১১২৫। ইবনু আব্বাস (রাঃ) হতে বর্ণিত আছে, কোন মহিলাকে তার ফুফু অথবা খালার সাথে (সতীনরপে) বিয়ে করতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বারণ করেছেন। — সহীহ, ইরওয়া (২৮৮২), যঈফ আবু দাউদ (৩৫২) বর্ণনাকারী আবু হারযের নাম আব্দুল্লাহ ইবনু হুসাইন। নাসর ইবনু আলী আব্দুল আ'লা হতে, তিনি হিশাম ইবনু হাসসান হতে, তিনি ইবনু সীরীন হতে, তিনি আবূ হুরায়রা হতে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে উপরোক্ত হাদীসের মতই বর্ণনা করেছেন। — সহীহ, ইবনু মা-জাহ (১৯২৯), নাসা-ঈ আলী, ইবনু উমার, আব্দুল্লাহ ইবনু আমর, আবূ সাইদ, আবূ উমামা, জাবির, আইশা, আবু মূসা ও সামুরা ইবনু জুনদাব (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1126,
			"arabicnumber": 1126,
			"text": "১১২৬। আবু হুরাইরা (রাঃ) হতে বর্ণিত আছে, কোন মহিলাকে তার ফুফুর সাথে অথবা ফুফুকে তার ভাইয়ের মেয়ের সাথে অথবা কোন মহিলাকে তার খালার সাথে অথবা খালাকে তার বোনের মেয়ের সাথে এবং ছোট বোনের সাথে বড় বোনকে এবং বড় বোনের সাথে ছোট বোনকে একত্রে (সতীনরপে) বিয়ে করতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বারণ করেছেন। — সহীহ, ইরওয়া (৬/২৮৯), সহীহ আবু দাউদ (১৮০২) ইবনু আব্বাস ও আবু হুরাইরা (রাঃ) হতে বর্ণিত হাদীসদ্বয়কে আবূ ঈসা হাসান সহীহ বলেছেন। এ হাদীস অনুযায়ী সকল বিশেষজ্ঞ আলিম আমল করার কথা বলেছেন। কোন মহিলাকে তার ফুফু অথবা খালার সাথে একত্রে (সতীনরপে) বিয়ে করা যে বৈধ নয় তাদের মধ্যে এই ব্যাপারে কোন মত পার্থক্য নেই। কোন মহিলাকে যদি কোন ব্যক্তি তার খালা অথবা ফুফুর সাথে একত্রে বিয়ে করে তবে পরের বিয়েটি বাতিল হয়ে যাবে। সকল আলিমই এ কথা বলেছেন। আবু ঈসা বলেন, আবূ হুরাইরা (রাঃ)-এর দেখা পেয়েছেন শাবি (রাহঃ) এবং তার নিকট হতে হাদীসও বর্ণনা করেছেন। আমি ইমাম বুখারীকে এ ব্যাপারে প্রশ্ন করলে তিনি এর সত্যতা স্বীকার করেন। শাবী এক রাবীর মধ্যস্থতায়ও আবূ হুরাইরা (রাঃ) হতে হাদীস বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1127,
			"arabicnumber": 1127,
			"text": "১১২৭। উকবা ইবনু আমির আল-জুহানী (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদেরকে (বিয়ের চুক্তির) যে সকল শর্ত পালন করতে হয় তার মধ্যে সেসব শর্তই সবচেয়ে বেশি পালনীয় যার দ্বারা কোন মহিলাকে তোমরা হালাল কর। — সহীহ, ইবনু মা-জাহ (১৯৫৪), বুখারী, মুসলিম উপরের হাদীসের মত আবু মূসা মুহাম্মাদ ইবনুল মূসান্না-ইয়াহইয়া ইবনু সাঈদ হতে, তিনি আবদুল হামীদ ইবনু জাফরের সনদসূত্রেও বর্ণনা করেছেন। এ হাদীসটিকে আবু ঈসা হাসান সহীহ বলেছেন। এ হাদীস অনুযায়ী রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের একদল বিশেষজ্ঞ সাহাবী আমল করেছেন। তাদের মধ্যে উমর (রাঃ)-ও অন্তর্ভুক্ত আছেন। তিনি বলেছেন, যদি কোন মহিলাকে বিয়ে করার সময় কোন লোক এই শর্ত করে যে, তার শহর হতে তাকে অন্য কোথাও সে নিয়ে যেতে পারবে না, তবে তার শহর হতে তাকে অন্য কোথাও স্বামী নিয়ে যেতে পারবে না তবে তার শহর হতে তাকে অন্য কোথাও স্বামী নিয়ে যেতে পারবে না। কিছু সংখ্যক আলিমেরও এই অভিমত। একথা বলেছেন ইমাম শাফিঈ, আহমাদ ও ইসহাক (রাহঃ)-ও। আলী (রাঃ) বলেছেন, আল্লাহ তা'আলার শর্ত নারীর শর্ত হতে বেশি অগ্রগণ্য। অর্থাৎ তিনি বলতে চান, কোন স্ত্রীলোক তার স্বামীর উপর ‘তাকে তার শহর হতে অন্য কোথাও নিয়ে যেতে পারবে না’ এরকম শর্ত দিলেও স্বামী তা মেনে নিতে বাধ্য নয়। এই মত একদল আলিম গ্রহণ করেছেন। এই মত সুফিয়ান সাওরী ও কোন কোন কুফাবাসী আলিমেরও।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 1128,
			"arabicnumber": 1128,
			"text": "১১২৮। ইবনু উমার (রাঃ) হতে বর্ণিত আছে, যে সময়ে গাইলান ইবনু সালামা আস-সাকাফী ইসলাম গ্রহণ করেন সে সময়ে তার দশজন স্ত্রী ছিল, যাদের তিনি বিয়ে করেছিলেন জাহিলী যুগের মধ্যে। তার সাথে সাথে তারাও মুসলিম হয়। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে এদের মধ্যে যে কোন চারজনকে বেছে নেয়ার নির্দেশ দেন। — সহীহ, ইবনু মা-জাহ (১৯৫৩) আবু ঈসা বলেন, মামার যুহরী হতে, তিনি সালিমের পিতার সুত্রেও একইরকম বর্ণনা করেছেন। তিনি আরও বলেনঃ আমি ইমাম বুখারীকে বলতে শুনেছি, এ হাদীসটি সুরক্ষিত নয়। যুহরী হতে শুআইব ইবনু আবূ হামযা ও অন্যান্যদের বর্ণিত রিওয়ায়াতটিই সহীহ। ইমাম বুখারী বলেন, আমি এ হাদীসটি মুহাম্মাদ ইবনু সুওয়াইদ সাকাফী হতে পেয়েছি। এতে আছে, গাইলান ইবনু সালামা ইসলাম গ্রহণ করলেন, সে সময় তার দশজন স্ত্রী ছিল। এই বর্ণনাটিই সহীহ। ইমাম বুখারী আরো বলেন, যুহরী সালিমের সূত্রে, তিনি তার পিতার সূত্রে যে হাদীস বর্ণনা করেছেন তা হলঃ “সাকীফ গোত্রের কোন এক লোক তার স্ত্রীদের তালাক প্রদান করলো। উমার (রাঃ) তাকে বললেন, পুনরায় তোমার স্ত্রীদেরকে তুমি ফিরিয়ে আনবে। অন্যথায় (সামূদ জাতির এক অভিশপ্ত ব্যক্তি) যেভাবে আবূ রিগালের কবরে পাথর মারা হয়েছিল, সেভাবে আমিও তোমার কবরে পাথর মারব।\" আবু ঈসা বলেন, আমাদের সাখীদের মতে, গাইলান ইবনু সালামার হাদীস অনুসারে আমল করতে হবে। তাদের মধ্যে ইমাম শাফিঈ, আহমাদ ও ইসহাকও অন্তর্ভুক্ত।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 1129,
			"arabicnumber": 1129,
			"text": "১১২৯। ইবনু ফাইরূয আদ-দাইলামী (রহঃ) হতে তার পিতার সুত্রে বর্ণিত আছে, তিনি বলেন, আমি রাসুলুল্লাহ সাল্লাল্লাহু ওয়াসাল্লামের নিকট এসে বললাম, হে আল্লাহর রাসূল! আমি ইসলাম ধর্ম গ্রহণ করেছি এবং আমার অধীনে দুই বোন স্ত্রী হিসেবে আছে। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ দু'জনের মধ্যে যাকে ভালো লাগে তাকে বেছে নাও। – হাসান, ইবনু মা-জাহ (১৯৫১)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 1130,
			"arabicnumber": 1130,
			"text": "১১৩০। ফাইরূয দাইলামী (রাঃ) বলেন, আমি বললাম, হে আল্লাহর রাসূল! আমি ইসলাম ধর্ম গ্রহণ করেছি, আমার অধীনে দুই বোন একত্রে স্ত্রী হিসেবে আছে। তিনি বললেনঃ তাদের মধ্যে যাকে খুশি তুমি বেছে নাও। — হাসান, দেখুন পূর্বের হাদীস। এই হাদীসটি হাসান। আবু ওয়াহব আল-জাইশানীর নাম আদ-দাইলাম, পিতার নাম হাওশা।",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 1131,
			"arabicnumber": 1131,
			"text": "১১৩১। রুআইফি ইবনু সাবিত (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আল্লাহ ও আখিরাতের উপর যে লোক ঈমান রাখে সে লোক যেন নিজের পানি (বীর্য) দিয়ে অন্যের সন্তানকে সিক্ত না করে। — হাসান, ইরওয়া (২১৩৭), সহীহ আবু দাউদ (১৮৭৪) এ হাদীসটিকে আবু ঈসা হাসান বলেছেন। এটি বিভিন্ন সূত্রে রুআইফি (রাঃ) হতে বর্ণিত আছে। এ হাদীস অনুযায়ী আলিমগণ আমল করার কথা বলেছেন। তাদের মতে কোন লোক কোন গর্ভবতী দাসী ক্রয় করলে সন্তান জনের পূর্বে সে লোক তার সাথে সহবাস করতে পারবে না। আবৃদ দারদা, ইবনু আব্বাস, ইরবায ইবনু সারিয়া ও আবু সাঈদ (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 1132,
			"arabicnumber": 1132,
			"text": "১১৩২। আবু সাঈদ আল-খুদরী (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমরা কিছু সংখ্যক মহিলাকে আওতাস যুদ্ধের দিন বন্দী করলাম। তাদের মধ্যে অনেকেরই স্বামী ছিল তাদের নিজ সম্প্রদায়ে। লোকেরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে বিষয়টি জানালেন। তখন এ আয়াতটি নাযিল হলঃ ‘কারো বিয়ে বন্ধনে যেসব স্ত্রীলোক আবদ্ধ আছে তারাও তোমাদের জন্য হারাম; অবশ্য যারা (যুদ্ধে) তোমাদের হস্তগত হবে তারা এর অন্তর্ভুক্ত নয়’ (সূরাঃ নিসা- ২৪)। — সহীহ, সহীহ আবু দাউদ (১৮৭১) এ হাদীসটিকে আবূ ঈসা হাসান বলেছেন। এ হাদীসটি আরো কয়েকটি সূত্রে বর্ণিত হয়েছে। সূত্রগুলো এরূপ- সাওরী উসমান আল বাৰ্ত্তী হতে, তিনি আবুল খালীল হতে, তিনি আবু সাঈদ হতে তিনি। হাম্মাম কাতাদা হতে, তিনি সালিহ আবুল খালীল হতে, তিনি আবু আলকামা আল-হাশিমী হতে, তিনি আবু সাঈদ হতে। আবুল খালীলের নাম সালিহ, পিতার নাম আবু মারইয়াম।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 1133,
			"arabicnumber": 1133,
			"text": "১১৩৩। আবূ মাসউদ আল-আনসারী (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, কুকুরের বিক্রয় মূল্য, ব্যভিচারিনীর উপার্জন এবং গণক ঠাকুরের উপঢৌকন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিষিদ্ধ করেছেন। — সহীহ, ইবনু মা-জাহ (২৫৯০), বুখারী, মুসলিম রাফি ইবনু খাদীজ, আবু জুহাইফা, আবু হুরাইরা ও ইবনু আব্বাস (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ মাসউদ (রাঃ) হতে বর্ণিত হাদীসটিকে আবু ঈসা হাসান সহীহ বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 1134,
			"arabicnumber": 1134,
			"text": "১১৩৪। আবু হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন লোক যেন তার অন্য ভাইয়ের ক্রয়-বিক্রয় প্রস্তাবের উপর নিজের ক্রয়-বিক্রয়ের প্রস্তাব না করে এবং তার বিয়ের প্রস্তাবের উপর যেন নিজের বিয়ের প্রস্তাব না দেয়। — সহীহ, ইবনু মা-জাহ (২১৭২), বুখারী, মুসলিম কুতাইবা বলেছেন, এ বর্ণনাটি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পর্যন্ত আবু হুরাইরা (রাঃ) পৌছিয়েছেন এবং ইমাম আহমাদ বলেছেন, তার নিকট হতে তিনি সরাসরি বর্ণনা করেছেন। সামুরা ও ইবনু উমার (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবু হুরাইরা (রাঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। ইমাম মালিক (রাহঃ) বলেন, এ হাদীসের অর্থ হলঃ কোন মহিলার নিকট যদি কোন লোক বিয়ের প্রস্তাব পাঠায় সে যদি তাতে সম্মত হয় তবে ঐ মহিলার নিকট অন্য কোন লোকের বিয়ের প্রস্তাব দেয়ার কোন অধিকার নেই। ইমাম শাফিঈ (রাহঃ) বলেন, এ হাদীসটির তাৎপর্য হচ্ছেঃ কোন মহিলার নিকটে কোন লোক বিয়ের প্রস্তাব পাঠানোর পর সে তা গ্রহণ করলে এবং তাতে আগ্রহ দেখালে এ অবস্থায় তার নিকট অন্য লোকের বিয়ের প্রস্তাব পাঠানো উচিত হবে না। হ্যাঁ, যদি প্রথম ব্যক্তির প্রস্তাবের পক্ষে ঐ মহিলা আকৃষ্ট কি-না তা না যানা গেলে এরকম পরিস্থিতিতে তার নিকট অন্য কোন ব্যক্তির প্রস্তাব পাঠাতে কোন সমস্যা নেই। ফাতিমা বিনতু কাইস (রাঃ)-এর ঘটনা সম্বলিত হাদীসই এর দলীল। তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট এসে তাকে বললেন, তার নিকট আবূ জাহম ইবনু হুযাইফা ও মুআবিয়া ইবনু আবৃ সুফিয়ান বিয়ের প্রস্তাব দিয়েছে। তিনি তাকে পরামর্শ দিলেনঃ আবু জাহমের হাতের লাঠি নারীদের হতে সরে না এবং মুয়াবিয়া নিঃস্ব-দরিদ্র ব্যাক্তি, তার কোন ধন-সম্পদ নেই। বরং তুমি উসমাকে বিয়ে কর। আমাদের মতে এ হাদীসের তাৎপর্য হলঃ ফাতিমা (রাঃ) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট তাদের কোন একজনের সাথে বিয়েতে আবদ্ধ হওয়ার সম্মতি চাননি। তিনি তা করলে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার নিকট অন্য ব্যক্তির প্রস্তাব করতেন না। আল্লাহ তা'আলাই ভালো জানেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 1135,
			"arabicnumber": 1135,
			"text": "১১৩৫। আবু বাকর ইবনু আবু জাহম (রহঃ) বলেন, ফাতিমা বিনতু কাইসের নিকট আমি ও আবু সালামা ইবনু আবদুর রাহমান গেলাম। কিন্তু সে তার জন্য থাকার ও ভরণপোষণের কোন ব্যবস্থা করেনি তবে আমার জন্য তার চাচাতো ভাইয়ের নিকট পাঁচ কাফীয যব ও পাঁচ কাফীয আটা মোট দশ কাফীযের ব্যবস্থা করেছে। ফাতিমা (রাঃ) বলেন, আমি বিষয়টি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট এসে তাকে অবহিত করলাম। তিনি আরো বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ “সে ঠিকই করেছে”। তিনি আমাকে নির্দেশ দিলেন উম্মু শারীকের বাড়ীতে ইদ্দাত পালনের জন্য। আবার তিনি আমাকে বললেনঃ মুহাজিরদের চলাচল খুব বেশী হয়ে থাকে উম্মু শারীকের বাড়ীতে। অতএব, তুমি ইদ্দাত পালন কর উম্মু মাকতুমের ছেলের বাড়ীতে। তুমি প্রয়োজনে কাপড় পরিবর্তন করলে সে তোমাকে দেখতে। পাবে না। কোন লোক যদি তোমাকে তোমার ইদ্দাত পূর্ণ হওয়ার পর বিয়ের প্রস্তাব দেয় তবে তুমি আমার নিকট এসো।” আমার ইদ্দাত শেষ হবার পর আবু জাহম ও মুআবিয়া উভয়ে আমার নিকট বিয়ের প্রস্তাব পাঠান। ফাতিমা (রাঃ) বলেন, আমি বিষয়টি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট এসে তাকে জানালাম। তিনি বললেনঃ মুআবিয়া দরিদ্র লোক, তার তেমন কোন ধন-সম্পদ নেই। আর স্ত্রীদের প্রতি আবু জাহম খুবই কঠোর। ফাতিমা (রাঃ) বলেন, তারপর আমার নিকট উসামা ইবনু যাইদ (রাঃ) প্রস্তাব করেন এবং আমাকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার সাথে বিয়ে দেন। আল্লাহ তা'আলা আমাকে অশেষ কল্যাণ ও বারকাত দান করেছেন উসামার মাধ্যমে। — সহীহ, ইরওয়া (৬/২০৯), সহীহ আবূ দাউদ (১৯৭৬), মুসলিম এ হাদীসটি হাসান সহীহ। এ হাদীসটি আবু জাহমের সূত্রে সুফিয়ান সাওরীও বর্ণনা করেছেন। তাতে এ কথাও আছেঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে বললেনঃ “তুমি উসামাকে বিয়ে কর।” আবু ঈসা বলেন, আমি এই হাদীসটি নিম্নোক্ত সূত্রেও পেয়েছিঃ মাহমুদ ওয়াকী হতে, তিনি সুফিয়ান হতে, তিনি আবূ বাকর ইবনু আবূ জাহম হতে। — সহীহ, দেখুন পূর্বের হাদীস, ইরওয়া (১৮৬৪)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 1136,
			"arabicnumber": 1136,
			"text": "১১৩৬। জাবির (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমরা বললাম, হে আল্লাহর রাসূল! আমরা আযল করতাম। কিন্তু এটাকে ‘জীবন্ত কবর দেয়ার’ নামান্তর মনে করে ইয়াহুদীরা। তিনি বললেনঃ ইয়াহুদীরা মিথ্যা বলেছে। নিশ্চয়ই আল্লাহ তা'আলা কোন কিছু সৃষ্টির সিদ্ধান্ত নিলে কেউই তা বাধা দিয়ে রাখতে পারে না। — সহীহ, আল-আ-দাব (৫২), সহীহ আবু দাউদ (১৮৮৪) উমার, বারাআ, আবু হুরাইরা ও আবু সাঈদ (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 1137,
			"arabicnumber": 1137,
			"text": "১১৩৭। জাবির ইবনু আবদুল্লাহ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমরা কুরআন অবতীর্ণ হতে থাকাকালে (আল্লাহর রাসূলের জীবদ্দশায়) আযল করতাম। - সহীহ, ইবনু মা-জাহ (১৯২৭), বুখারী, মুসলিম জাবির (রাঃ) হতে বর্ণিত হাদীসটিকে আবু ঈসা হাসান সহীহ বলেছেন। তার নিকট হতে এ হাদীসটি বিভিন্ন সূত্রে বর্ণিত হয়েছে। আযল করার অনুমতির পক্ষে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের একদল বিশেষজ্ঞ সাহাবী ও তাবিঈ মত দিয়েছেন। ইমাম মালিক ইবনু আনাস (রহঃ) বলেছেন, স্বাধীন স্ত্রীর অনুমতি নেওয়ার পর আযল করা জায়িয, কিন্তু দাসীর নিকট অনুমতির প্রয়োজন নেই।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 1138,
			"arabicnumber": 1138,
			"text": "১১৩৮ আবূ সাঈদ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আযল করা প্রসঙ্গে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সামনে আলোচনা করা হলে তিনি বললেনঃ তোমাদের মাঝে কোন লোক তা করে কেন? (অধস্তন বর্ণনাকারী) ইবনু আবূ উমারের বর্ণিত হাদীসের মধ্যে আরো আছেঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একথা বলেননি’ “তোমাদের মাঝে কোন লোক যেন তা না করে।\" তারপর উভয়ের (কুতাইবা ও ইবনু আবূ উমার) বর্ণনায় আরও উল্লেখ আছে, আল্লাহ তা'আলা সেসবকে অবশ্যই সৃষ্টি করবেন যেসব জীবন সৃষ্টি হওয়ার জন্য নিৰ্দ্ধারিত হয়ে আছে। — সহীহ, আল-আ-দাব (৫৪, ৫৫), সহীহ আবূ দাউদ (১৮৮৬), মুসলিম জাবির (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবু সাঈদ (রাঃ) হতে বর্ণিত হাদীসটিকে আবু ঈসা হাসান সহীহ বলেছেন। বিভিন্ন সূত্রে আবু সাঈদ (রাঃ)-এর নিকট হতে উল্লেখিত হাদীসটি বর্ণিত হয়েছে। আযল করাকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের একদল বিশেষজ্ঞ সাহাবী ও অন্যান্যরা অপছন্দ করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 1139,
			"arabicnumber": 1139,
			"text": "১১৩৯। আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমি যদি ইচ্ছা করি তবে বলতে পারি যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন। কিন্তু তিনি বলেছেনঃ সুন্নাত নিয়ম হচ্ছে, নিজের স্ত্রী থাকার পরেও কোন লোক কুমারী নারীকে বিয়ে করলে একাধারে সাত দিন সে তার সাথে অবস্থান করবে এবং সায়্যিবা (অকুমারী) নারীকে বিয়ে করলে একাধারে তিন দিন তার সাথে অবস্থান করবে। — সহীহ, ইবনু মা-জাহ (১৯১৬), বুখারী, মুসলিম উম্মু সালামা (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আনাস (রাঃ) হতে বর্ণিত হাদীসটিকে আবু ঈসা হাসান সহীহ বলেছেন। এ হাদীসটিকে মুহাম্মাদ ইবনু ইসহাক আইয়ূব হতে তিনি আবূ কিলাবা হতে তিনি আনাস (রাঃ)-এর সূত্রে মারফুভাবে বর্ণনা করেছেন এবং মাওকৃফভাবেও কিছু বর্ণনাকারী বর্ণনা করেছেন। কোন কোন আলিম এ হাদীস মোতাবেক আমল করেছেন। তারা বলেছেন, নিজের স্ত্রী থাকার পরেও কোন লোক কুমারী নারীকে বিয়ে করলে সাত দিন তার নিকট অবস্থান করবে, তারপর উভয়ের মধ্যে সঠিকভাবে পালাবণ্টন করবে। সায়্যিবা (অকুমারী) মহিলাকে যদি সে লোক বিয়ে করে তবে তিনদিন তার সাথে অবস্থান করবে। এই মত দিয়েছেন ইমাম মালিক, শাফিঈ, আহমাদ ও ইসহাক (রাহঃ)। কতিপয় তাবিঈ বলেন, নিজ স্ত্রী থাকাবস্থায় কোন লোক কুমারী নারীকে বিয়ে করলে তিন দিন এই শেষোক্তের নিকট অবস্থান করবে এবং সায়্যিবা নারীকে বিয়ে করলে তার নিকট দুইদিন অবস্থান করবে। তবে অধিক গ্রহণযোগ্য হচ্ছে প্রথমোক্ত অভিমতটি।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 1140,
			"arabicnumber": 1140,
			"text": "১১৪০। আইশা (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার বিবিদের মাঝে খুবই ন্যায়সংগতভাবে পালা বন্টন করতেন। আর তিনি বলতেনঃ “হে আল্লাহ! আমার সামর্থ্য অনুযায়ী এই আমার পালা বন্টন। যে ব্যাপারে শুধু তোমারই পূর্ণ শক্তি আছে, আমার কোন শক্তি নেই, সেই ব্যাপারে আমাকে তিরস্কার কর না।” যঈফ, ইবনু মাজাহ (১৯৭১) আবূ ঈসা বলেছেন, আইশা (রাঃ) বর্ণিত হাদীসটি একাধিক রাবী হাম্মাদ ইবনু সালামা হতে উল্লিখিত সূত্রে বর্ণনা করেছেন। কোন কোন বর্ণনায় আবূ কিলাবার সূত্রে এ হাদীসটি মুরসাল হিসেবে বর্ণিত হয়েছে এবং এটাই বেশী সহীহ। “লা তালুমনী ফীমা তামলিকু অলা আমলিকু”-এর ব্যাখ্যা প্রসঙ্গে কোন কোন আলিম বলেছেনঃ আন্তরিক প্রেম-ভালোবাসার উপর আমার কোন নিয়ন্ত্রণ নেই (এটা কম-বেশী হতে পারে)।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 1141,
			"arabicnumber": 1141,
			"text": "১১৪১। আবু হুরাইরা (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে লোকের নিকট দু’জন স্ত্রী আছে সে লোক যদি তাদের মধ্যে সমতা না রাখে তবে কিয়ামতের দিন সে লোক তার দেহের এক পার্শ্ব ভাঙ্গা অবস্থায় উপস্থিত হবে। — সহীহ, ইবনু মা-জাহ (১৯৬৯) এ হাদিসটি মুসনাদ হিসাবে কাতাদার সুত্রে হাম্মাম ইবনু ইয়াহইয়া বর্ণনা করেছেন। কাতাদার সূত্রে হিশাম আদ-দাসতাওয়াঈও এটিকে বর্ণনা করেছেন। তিনি বলেন, কথিত আছে যে, এটা মারফু হিসাবে শুধু হাম্মামের সূত্রেই বর্ণিত হয়েছে। আর হাম্মাম একজন বিশ্বস্ত ও স্মরণশক্তি সম্পন্ন বর্ণনাকারী।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 1142,
			"arabicnumber": 1142,
			"text": "১১৪২। আমর ইবনু শুআইব (রহঃ) হতে পর্যায়ক্রমে তার পিতা ও দাদার সূত্রে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম স্বীয় কন্যা যাইনাবকে পুনরায় মোহর নির্ধারণ করে এবং নতুন বিয়ের মাধ্যমে আবূল আস ইবনুর রাবীর নিকটে ফেরিয়ে দেন। যঈফ, ইবনু মাজাহ (২০১০) আবূ ঈসা বলেনঃ এ হাদীসের সনদ সম্পর্কে সমালোচনা রয়েছে। বিদ্বানগণ এই হাদীসের মর্মানুযায়ী আমল করেছেন। কোন মহিলা যদি প্রথমে ইসলাম গ্রহণ করে এবং তার ইদ্দত পালনের সময়ই তার স্বামী ইসলাম গ্রহণ করে তবে তার পূর্ব স্বামীর অধিকার অগ্রগণ্য। মালিক ইবনু আনাস, আল-আওযায়ী, শাফিঈ, আহমাদ ও ইসহাক প্রমুখ ইমামগণের ইহাই অভিমত।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 1143,
			"arabicnumber": 1143,
			"text": "১১৪৩। ইবনু আব্বাস (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার মেয়ে যাইনাবকে প্রথম বিয়ে বহাল রেখেই আবূল আস ইবনুর রাবীকে ছয় বছর পর ফিরিয়ে দিয়েছেন, নতুন করে বিয়ে দেওয়ার ব্যবস্থা করেননি। — সহীহ, ইবনু মা-জাহ (২০০৯) আবু ঈসা বলেন, এ হাদীসের সনদে কোন সমস্যা নেই। কিন্তু এর কারণ প্রসঙ্গে আমরা কিছু জানি না। সম্ভবতঃ এই বিষয়টি দাউদ ইবনু হুসাইনের স্মরণশক্তির দুর্বলতার জন্যেই উৎপত্তি হয়েছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 1144,
			"arabicnumber": 1144,
			"text": "১১৪৪৷ ইবনু আব্বাস (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সময়ে এক লোক মুসলিম হয়ে আসার পর তার স্ত্রীও মুসলিম হয়ে আসে। লোকটি বলল, হে আল্লাহর রাসূল! সে আমার সাথে মুসলিম হয়েছে। অতএব আমার স্ত্রী আমাকে ফিরিয়ে দিন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার স্ত্রী তাকে ফেরত দিলেন। এ হাদীসটি সহীহ ইয়াযীদ ইবনু হারূন মুহাম্মাদ ইবনু ইসহাকের সূত্রে হাদীসটি উল্লেখ করেছেন। হাজ্জাজের সূত্রে আমর ইবনু শুয়াইব হতে তিনি তার পিতা হতে তিনি তার দাদা হতে বর্ণনা করেছেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার কন্যা যাইনাবকে নতুনভাবে মহরানা ধাৰ্য্য করে নতুন বিয়ের মাধ্যমে আবূল আসের নিকট ফিরিয়ে দিয়েছিলেন। ইয়াযীদ ইবনু হারুন বলেছেনঃ ইবনু আব্বাস (রাঃ) বর্ণিত হাদীস সনদের দিক হতে খুবই উত্তম, কিন্তু আমর ইবনু শুআইবের হাদীস অনুসারে আমল প্রচলিত আছে। আমর ইবনু শুআইব এর হাদীসটি যঈফ; ইরওয়া (১৯১৮)। যঈফ আবূ দাউদ (৩৮৭)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 1145,
			"arabicnumber": 1145,
			"text": "১১৪৫৷ ইবনু মাসউদ (রাঃ) হতে বর্ণিত আছে, তাকে প্রশ্ন করা হলঃ এক লোক এক মহিলাকে বিয়ের পর তার মোহর না ঠিক করে এবং তার সাথে সহবাস না করেই মৃত্যুবরণ করল, তার জন্য কি হুকুম আছে? ইবনু মাসউদ (রাঃ) বললেন, মহিলাটি তার পরিবারের অন্যান্য মেয়েদের সম-পরিমাণ মোহর পাবে, তার কমও পাবে না বেশিও পাবে না। তার স্বামীর মৃত্যুর জন্য সে মহিলাটি ইদ্দাত পালন করবে এবং সে (তার) ওয়ারিসের অধিকারীও হবে। তখন মাকিল ইবনু সিনান আল-আশজাঈ (রাঃ) দাড়িয়ে বললেন, আপনি যে ধরণের ফায়সালা করেছেন, আমাদের বংশের মেয়ে ওয়াশিকের কন্যা বিরওয়াআ প্রসঙ্গে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামও একই ফায়সালা করেছেন। ইবনু মাসউদ (রাঃ) এটা শুনে খুবই আনন্দিত হন। — সহীহ, ইবনু মা-জাহ (১৮৯১) আল-জাররাহ (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। উপরোক্ত হাদীসের মত ইয়াযীদ ইবনু হারূন ও আবদুর রাযযাক-সুফিয়ান হতে, তিনি মানসূর হতে এর সূত্রেও হাদীস বর্ণিত আছে। ইবনু মাসউদ (রাঃ)-এর বর্ণিত হাদীসটিকে আবু ঈসা হাসান সহীহ বলেছেন। এ হাদীসটি তার নিকট হতে একাধিক সূত্রে বর্ণিত হয়েছে। এ হাদীস অনুযায়ী রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের একদল বিশেষজ্ঞ সাহাবী ও অপরাপর আলিম আমল করেছেন। এই মত দিয়েছেন সুফিয়ান সাওরী, আহমাদ ও ইসহাক (রাহঃ)-ও। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের অন্য একদল সাহাবী, যেমন আলী ইবনু আবূ তালিব, যাইদ ইবনু সাবিত, ইবনু আব্বাস ও ইবনু উমার (রাঃ) বলেছেন, কোন স্ত্রীলোককে কোন লোক বিয়ে করে মোহর নির্ধারণ ও সহবাসের আগে মৃত্যুবরণ করলে সে মীরাস পাবে কিন্তু মোহর পাবে না এবং সেই মহিলাকে ইদ্দাত পালন করতে হবে। একথাটি ইমাম শাফিঈও ব্যক্ত করেছেন। তিনি আরো বলেছেন, ওয়াশিকের কন্যা বিরওয়াআর হাদীস (সহীহ) হিসেবে প্রমাণিত হলে তবে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে প্রাপ্ত সর্বশেষ ফায়সালা হবে এটাই। মিসর গিয়ে শাফিঈ (রাহঃ) নিজের প্রথম অভিমতটি বাতিল করেন এবং এ হাদীস অনুযায়ী মত গ্রহণ করেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 67
			}
		}
	]
}