{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"12": "The Book on Suckling"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1146,
			"arabicnumber": 1146,
			"text": "১১৪৬। আলী (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে সকল লোককে আল্লাহ তা'আলা বংশগত সম্পর্কের কারণে (বিয়ের সম্পর্ক স্থাপনের ক্ষেত্রে) হারাম করেছেন, একইভাবে সে সকল লোককে দুধপানের কারণেও (বিয়ের সম্পর্ক স্থাপনের ক্ষেত্রে) হারাম করেছেন। — সহীহ, ইরওয়া (৬/২৮৪) আইশা, ইবনু আব্বাস ও উম্মু হাবীব (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আলী (রাঃ) হতে বর্ণিত হাদীসটিকে আবু ঈসা হাসান সহীহ বলেছেন। এ হাদীস অনুযায়ী রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের বিশেষজ্ঞ সাহাবী ও আলিমগণ আমল করতে সম্মতি দিয়েছেন। তাদের মধ্যে এ ব্যাপারে কোন রকম মতভেদ আছে বলে আমাদের জানা নেই।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1147,
			"arabicnumber": 1147,
			"text": "১১৪৭। আইশা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে সকল লোককে আল্লাহ তা'আলা জন্মসূত্রে (বিয়ের সম্পর্ক স্থাপনের ক্ষেত্রে) হারাম করেছেন, সে সকল লোককে দুধপানের কারণেও হারাম করেছেন। - সহীহ, ইবনু মাজাহ (১৯৩৭), বুখারী, মুসলিম ৷ এ হাদীসটিকে আবু ঈসা হাসান সহীহ বলেছেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের বিশেষজ্ঞ সাহাবা ও অন্যান্য বিদ্বানগণ এই হাদীস অনুযায়ী আমল করেছেন। এ বিষয়ে তাদের মাঝে কোন মতভেদ আছে বলে আমাদের জানা নেই।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1148,
			"arabicnumber": 1148,
			"text": "১১৪৮। আইশা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমার দুধ সম্পর্কের চাচা এসে ভিতরে প্রবেশের জন্য আমার নিকট অনুমতি চাইলেন। আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট হতে অনুমতি না নেওয়া পর্যন্ত তাকে ভিতরে আসতে অনুমতি প্রদানে সম্মত হইনি। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তিনি তোমার চাচা, তিনি তোমার নিকট আসতে পারেন। আইশা (রাঃ) বললেন, আমাকে তো স্ত্রীলোক দুধপান করিয়েছেন, পুরুষ লোক তো আমাকে দুধ পান করাননি। তিনি বললেনঃ তিনি তোমার চাচা, তিনি তোমার নিকট আসতে পারেন। — সহীহ, ইবনু মাজাহ (১৯৪৮), বুখারী, মুসলিম ৷ এ হাদীসটিকে আবু ঈসা হাসান সহীহ বলেছেন। এ হাদীস অনুযায়ী রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের একদল সাহাবী ও বিশেষজ্ঞ আলিম আমল করতে বলেছেন। পুরুষ আত্মীয়কেও তারা দুধপান প্রসঙ্গে মাহরাম বলেছেন। আইশা (রাঃ)-এর হাদীসই এই ক্ষেত্রে মূল ভিত্তি। এই বিষয়ে একদল আলিম সুযোগ রেখেছেন (দুধ-মা ও দুধ-বোন ছাড়া অন্য কেউ মাহরাম নয়)। কিন্তু প্রথম মতটিই অনেক বেশি সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1149,
			"arabicnumber": 1149,
			"text": "১১৪৯। ইবনু আব্বাস (রাঃ) হতে বর্ণিত আছে, তাকে প্রশ্ন করা হল, এক ব্যক্তির কাছে দুইজন দাসী আছে। তাদের মধ্যে একজন একটি কন্যা সন্তানকে দুধ পান করিয়েছে এবং অন্যজন একটি ছেলে সন্তানকে দুধ পান করিয়েছে। এরকম পরিস্থিতিতে এই ছেলেটি কি ঐ মেয়েকে বিয়ে করতে পারবে? তিনি বলেন, না। কেননা, তারা দুইজন তো একজন পুরুষের দ্বারাই দুগ্ধবতী হয়েছে। — সনদ সহীহ লাবনুল ফাহল (পুরুষের মাধ্যমে দুধ) কথার তাৎপর্য এই (অর্থাৎ বীর্য পতনের মাধ্যমে নারীর স্তনে দুধের সঞ্চার হয়)। আর ইহাই হচ্ছে এ অনুচ্ছেদের মূল ভিত্তি। এই মত দিয়েছেন ইমাম আহমাদ ও ইসহাক।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1150,
			"arabicnumber": 1150,
			"text": "১১৫০। আইশা (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ এক-দুই চুমুক দুধ পান (বিয়ের বৈধতাকে) হারাম করে না। — সহীহ, ইবনু মাজাহ (১৯৪১), মুসলিম উম্মুল ফাদল, আবূ হুরায়রা, জুবাইর ইবনুল আউয়াম ও ইবনু জুবাঈর (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। একাধিক সূত্রে হাদীসটি বর্ণিত হয়েছে। সূত্রগুলো এই– ১। হিশাম ইবনু উরওয়া তার পিতা হতে, তিনি আব্দুল্লাহ ইবনুয যুবাইর হতে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে। ২। মুহাম্মাদ ইবনু দীনার হিশাম ইবনু উরওয়া হতে, তিনি তার পিতা হতে, তিনি আব্দুল্লাহ ইবনুয যুবাইর হতে, তিনি যুবাইর হতে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এই সূত্রটি অরক্ষিত। হাদীস বিশারদদের মতানুসারে আব্দুল্লাহ ইবনুয যুবাইরের মারফতে আইশা (রাঃ)-এর সূত্রে ইবনু আবী মুলাইকা কর্তৃক বর্ণিত হাদীসটি সহীহ। আবু ঈসা বলেন, আইশা (রাঃ) হতে বর্ণিত হাদীসটি হাসান সহীহ। তিনি আরও বলেন, আমি মুহাম্মাদ বুখারীকে এ বিষয়ে প্রশ্ন করলে তিনি বললেন, যুবাইরের সূত্রে আইশা (রাঃ) হতে বর্ণিত হাদীসটিই সহীহ। এ হাদীস অনুযায়ী রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের একদল সাহাবী ও বিশেষজ্ঞ আলিম আমল করেছেন। আইশা (রাঃ) বলেন, কুরআনে “সুনির্দিষ্টভাবে দশ চুমুক\" মর্মে আয়াত অবতীর্ণ হয়েছিল, পরে ‘পাঁচবার রহিত হয়েছে এবং পাঁচবার -এর বিধান কার্যকর থাকে। এটাই কার্যকর থাকল রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের মৃত্যু পর্যন্ত। আইশা (রাঃ) হতে আরো একটি সূত্রে এ হাদীসটি বর্ণিত আছে। এ ফাতাওয়াই প্রদান করতেন আইশা (রাঃ) এবং রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের অন্যান্য স্ত্রী। — সহীহ, ইবনু মাজাহ (১৯৪২) এই কথা বলেন ইমাম শাফিঈ ও ইসহাক (রাহঃ)-ও। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের হাদীসের পরিপ্রেক্ষিতে ইমাম আহমাদ (রাহঃ) বলেন, হুরমাত সাধারণতঃ এক-দুইবার দুধ পান করাতে প্রতিষ্ঠিত হবে না। তিনি আরো বলেন, যদি আইশা (রাঃ)-এর হাদীস অনুযায়ী কোন লোক পাঁচ চুমুক দুধ পানের মত গ্রহণ করে তবে এটা সবচেয়ে শক্তিশালী মত হবে। এ প্রসঙ্গে কোন মন্তব্য করা তার দুর্বলতা বলে বিবেচিত হবে। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের অপর একদল সাহাবী ও তাবিঈ বলেছেন, দুধের পরিমাণ কম অথবা বেশি যেটাই হোকনা কেন তা শিশুর পেটে যাওয়া মাত্রই বিয়ের সম্পর্ক স্থাপন হারাম হয়ে যাবে। এই মত দিয়েছেন সুফিয়ান সাওরী, মালিক ইবনু আনাস, আওযাঈ, আবদুল্লাহ ইবনুল মুবারাক, ওয়াকী (রাহঃ) এবং কুফাবাসীগণ। আবদুল্লাহ ইবনু আবূ মুলাইকার উপনাম আবু মুহাম্মাদ, পিতার নাম উবাইদুল্লাহ এবং দাদার নাম আবু মুলাইকা। তাকে তাইফের বিচারপতি হিসেবে ইবনু যুবাইর (রাঃ) নিয়োগ করেন। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের ত্রিশজন সাহাবীকে পেয়েছি।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1151,
			"arabicnumber": 1151,
			"text": "১১৫১। উকবা ইবনুল হারিস (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমি এক মহিলাকে বিয়ে করলাম। তারপর আমাদের নিকট একজন কৃষ্ণাঙ্গ মহিলা এসে বলল, তোমাদের দুজনকেই আমি দুধ পান করিয়েছি। আমি (উকবা) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট এসে বললাম, অমুকের কন্যা অমুককে আমি বিয়ে করেছি। আমাদের নিকট এক কৃষ্ণাঙ্গ মহিলা এসে বলল, “তোমাদের দুজনকেই আমি দুধ পান করিয়েছি”। সে মিথ্যাবাদিনী। বর্ণনাকারী বলেন, (এ কথায়) তিনি আমার কাছ থেকে মুখ ফিরিয়ে নিলেন। আমি ঘুরে গিয়ে তার সামনে এলাম, তিনি আমার কাছ থেকে তার মুখ ফিরিয়ে নিলেন। আমি বললাম, সেতো মিথ্যাবাদিনী। তিনি বললেনঃ “তুমি কিভাবে এর সাথে বিয়ে বহাল রাখতে পার! অথচ সে বলেছে, সে দুধ পান করিয়েছে তোমাদের দুজনকেই। সুতরাং তুমি তাকে ছেড়ে দাও (তালাক দাও)। — সহীহ, ইরওয়া (২১৪৬), বুখারী এই অনুচ্ছেদে ইবনু উমর (রাঃ) হতেও হাদীস বর্ণিত আছে। আবু ঈসা বলেন, উকবা ইবনুল হারিস (রাঃ) হতে বর্ণিত হাদীসটি হাসান সহীহ। এই হাদীসটি উকবা (রাঃ) হতে আরো কয়েকটি সূত্রে বর্ণিত হয়েছে। কিন্তু উবাইদা ইবনু আবূ মারইয়ামের নাম সেখানে উল্লেখ নেই এবং “তুমি তাকে ছেড়ে দাও\" এ কথাটিরও উল্লেখ নেই। এ হাদীস অনুযায়ী রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের একদল বিশেষজ্ঞ সাহাবা ও তাবিঈ মত প্রকাশ করেছেন। তারা একজন মহিলাকে দুধপানের সম্পর্ক প্রমাণের জন্য সাক্ষ্য অনুমোদন করেছেন। ইবনু আব্বাস (রাঃ) বলেন, একজন স্ত্রীলোকের সাক্ষ্য দুধপান প্রমাণের ক্ষেত্রে গ্রহণ করা যায়, তবে সেই মহিলাকে শপথও করাতে হবে। এই মত গ্রহণ করেছেন ইমাম আহমাদ ও ইসহাক (রাহঃ)। আর একদল বিশেষজ্ঞ আলিম বলেছেন, একজন মহিলার সাক্ষ্য এ ক্ষেত্রে গ্রহণযোগ্য নয়, যতক্ষণ একজনের বেশি সাক্ষী না পাওয়া যায়। এই অভিমত ইমাম শাফিঈর। ওয়াকী (রাহঃ) বলেন, একজন মহিলার সাক্ষ্য দুধপানের ক্ষেত্রে সিদ্ধান্তের জন্য পর্যাপ্ত নয়। তবে দুজনকেই সতর্কতার জন্য আলাদা করে দিতে হবে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1152,
			"arabicnumber": 1152,
			"text": "১১৫২। উম্মু সালামা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ দুধ ছাড়ানোর বয়সের পূর্বে স্তনের বোটা হতে শিশুর পাকস্থলীতে দুধ না গেলে দুধপানের নিষিদ্ধতা কার্যকর হয় না (অর্থাৎ দুধপান জনিত কারণে বিয়ের সম্পর্ক স্থাপন নিষিদ্ধ হয় না)। — সহীহ, ইবনু মাজাহ (১৯৪৬) আবু ঈসা বলেন, এ হাদীসটি হাসান সহীহ্! এ হাদীস অনুযায়ী রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের বেশিরভাগ বিশেষজ্ঞ সাহাবী ও অন্যান্যরা আমল করার কথা বলেছেন। তাদের মতে, কোন শিশু দুই বছরের কম বয়সে দুধ পান করলেই বিয়ের সম্পর্ক স্থাপন হারাম হবে। কিন্তু দুই বছরের পর দুধ পান করলে বিয়ের সম্পর্ক স্থাপন হারাম হবে না।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1153,
			"arabicnumber": 1153,
			"text": "১১৫৩ ৷ হাজ্জাজ আসলামী (রাঃ) হতে বর্ণিত আছে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে প্রশ্ন করলেন, হে আল্লাহর রাসূল! আমি যে দুধপান করেছি তার হাক্ক কিভাবে মিটাতে পারি? তিনি বলেনঃ (দুধমাকে) একটি ক্রীতদাস অথবা একটি দাসী দান করে (এ দাবি মিটাতে পার)। যঈফ, যঈফ আবূ দাউদ (৩৫১) আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। এ হাদীসটি ইয়াহইয়া ইবনু সাঈদ, হাতিম ইবনু ইসমাঈল, এবং আরও অনেকে হিশাম ইবনু উরওয়া হতে, তিনি তার পিতা হতে, তিনি হাজ্জাজ ইবনু হাজ্জাজ হতে, তিনি তার পিতা হতে তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেছেন। আর সুফিয়ান ইবনু উয়াইনা বর্ণনা করেছেন হিশাম ইবনু উরওয়া হতে, তিনি তার পিতা হতে, তিনি হাজ্জাজ ইবনু আবূ হাজ্জাজ ওয়াসাল্লাম হতে বর্ণনা করেছেন। এর মধ্যে ইবনু উয়াইনার সূত্রটি অরক্ষিত এবং হিশামের সূত্রটি সহীহ। হিশাম (রাহঃ) জাবির (রাঃ)-এর দেখা পেয়েছেন। “আমি যে দুধপান করেছি তার হাক্ক কিভাবে চোকাতে পারি\" এ কথার তাৎপর্য হল, আমার (দুধ) মা দুধ পান করানোর মাধ্যমে আমার যে সেবা করলেন এর বদলা আমি কিভাবে দিতে পারি? এর উত্তরে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তুমি তোমার দুধমাকে একটি ক্রীতদাস অথবা একটি দাসী দান করলে এর বিনিময় আদায় হবে। বর্ণিত আছে যে, আবূত তুফাইল (রাঃ) বলেন, এক সময় আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সাথে বসে ছিলাম। এক মহিলা এসে হাযির হলে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার জন্য নিজের চাঁদর পেতে দিলেন এবং তিনি তার উপর বসলেন। এই মহিলা চলে গেলে বলা হল, এই মহিলাই রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে দুধপান করিয়েছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1154,
			"arabicnumber": 1154,
			"text": "১১৫৪। আইশা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, বারীরার স্বামী একজন ক্রীতদাস ছিল। বারীরাকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম স্বাধীনতা দান করলেন (দাসত্ব হতে মুক্তির পর বিয়ের বন্ধন অক্ষুন্ন রাখার বা ছিন্ন করার)। বারীরা নিজের স্বাধীনতা প্রয়োগ করেন (বিয়ের বন্ধন ছিন্ন করেন)। যদি সে লোকটি (স্বামী) স্বাধীন হতো তাহলে তিনি (নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) কখনও তাকে (বারীরাকে) এ স্বাধীনতা প্রদান করতেন না। — সহীহ, ইরওয়া (১৮৭৩), সহীহ, আবূ দাউদ (১৯৩৫), স্বামী যদি স্বাধীন হতো ব্যাক্যাংশটি উরওয়ার নিজস্ব। হাদীসের প্রথম অংশটি বুখারীতেও আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1155,
			"arabicnumber": 1155,
			"text": "১১৫৫। আইশা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, বারীরার স্বামী ছিল স্বাধীন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে (বারীরাকে) ইখতিয়ার প্রদান করলেন। — বারীরার স্বামী স্বাধীন ছিল এই শব্দে হাদীসটি শাজ। দাস ছিল এই বর্ণনাটি সংরক্ষিত। ইবনু মাজাহ (২০৭৪) আবু ঈসা বলেন, আইশা (রাঃ)-এর হাদীসটি হাসান সহীহ। হিশাম ইবনু উরওয়া তার পিতার সূত্রে আইশা (রাঃ) হতে বর্ণনা করেছেন, বারীরার স্বামী দাস ছিল। ইকরিমা বর্ণনা করেছেন, ইবনু আব্বাস (রাঃ) বলেছেন, আমি বারীরার স্বামীকে দেখেছি, সে ছিল গোলাম, তাকে মুগীস নামে ডাকা হত। ইবনু উমার (রাঃ) হতেও একইরকম বর্ণিত হয়েছে। একদল আলিম এ হাদীস অনুযায়ী আমল করেন। তারা বলেন, দাসত্বমুক্ত করে দিলে সে (স্ত্রী) বিয়ে ঠিক রাখা বা না রাখার ইখতিয়ার পাবে না। হ্যাঁ তার স্বামী যদি গোলাম হয় এবং সে (স্ত্রী) দাসত্বমুক্ত হয় তবে সে ইখতিয়ার পাবে। ইমাম শাফিঈ, আহমাদ ও ইসহাকের মত এটাই। একাধিক রাবী আমাশ হতে, তিনি ইবরাহীম হতে, তিনি আসওয়াদ হতে বর্ণনা করেছেন, আইশ (রাঃ) বলেন, “বারীরার স্বামী স্বাধীন ছিল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এ অবস্থায় বারীরাকে (বিয়ে ঠিক রাখা বা না রাখার) ইখতিয়ার দেন।\" আসওয়াদও বলেছেন, বারীরার স্বামী আযাদ ছিল। একদল বিশেষজ্ঞ তাবিঈ ও তাদের পরবর্তীগণ এ হাদীস অনুযায়ী আমল করেন। সুফিয়ান সাওরী ও কুফাবাসী আলিমদের মত এটাই।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1156,
			"arabicnumber": 1156,
			"text": "১১৫৬। ইবনু আব্বাস (রাঃ) হতে বর্ণিত আছে, বারীরাকে গোলাম হতে মুক্তি দেয়ার সময় তার কৃষ্ণাঙ্গ স্বামী মুগীরা গোত্রের গোলাম ছিল। আল্লাহর শপথ! আমি যেন মদীনার রাস্তায় ও অলিতে-গলিতে তাকে (মুগসিকে) বেড়াতে দেখছি আর তার চোখের পানি তার দাড়ি বেয়ে গড়িয়ে পড়ছিল। সে যেন তাকে ফিরিয়ে না দেয় সেই উদ্দেশ্যে বারীরাকে সম্মত করাতে চেষ্টা করছিল। কিন্তু বারীরা তা করেনি। - সহীহ, বুখারী, মুসলিম এ হাদীসটিকে আবু ঈসা হাসান সহীহ বলেছেন। সাঈদের পিতার নাম মাহরান এবং তার উপনাম আবুন নাযর।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1157,
			"arabicnumber": 1157,
			"text": "১১৫৭। আবু হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ বিছানার মালিকই বাচ্চার মালিক এবং ব্যভিচারীর জন্য রয়েছে পাথর। — সহীহ, বুখারী, মুসলিম আবদুল্লাহ ইবনু আমর, বারাআ ইবনু আযিব এবং যাইদ ইবনু আরকাম (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবু ঈসা বলেন, আবু হুরাইরা (রাঃ) হতে বর্ণিত হাদীসটি হাসান সহীহ। এ হাদীস অনুযায়ী রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের বিশেষজ্ঞ সাহাবীগণ আমল করেছেন। উপরোক্ত হাদীসটি যুহরী-সাঈদ ইবনুল মুসাইয়্যিব ও আবু সালামা হতে আবু হুরাইরা (রাঃ)-এর সূত্রে বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1158,
			"arabicnumber": 1158,
			"text": "১১৫৮। জাবির (রাঃ) হতে বর্ণিত আছে, একটি মহিলাকে দেখার পর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যাইনাব (রাঃ)-এর ঘরে যান এবং নিজের চাহিদা পূর্ণ করেন (সহবাস করেন)। তারপর বাইরে এসে বলেনঃ কোন মহিলা যখন আগমন করে সে শাইতানের বেশে আগমন করে। অতএব, কোন মহিলাকে দেখার পর তোমাদের কোন লোকের যদি তাকে ভাল লাগে তবে সে যেন নিজ স্ত্রীর নিকট যায়। কেননা, ঐ মহিলার যা আছে তার (স্ত্রীর)-ও তা আছে। — সহীহ, সহীহা (২৩৫) ইবনু মাসউদ (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবু ঈসা বলেন, জাবির (রাঃ) হতে বর্ণিত হাদীসটি হাসান সহীহ গারীব। হিশাম আদ-দাসতাওয়াঈর পিতার নাম সানবার।",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1159,
			"arabicnumber": 1159,
			"text": "১১৫৯। আবু হুরাইরা (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমি যদি কাউকে অন্য কোন লোকের প্রতি সিজদা করার নির্দেশ দিতাম তাহলে অবশ্যই স্ত্রীকে তার স্বামীর প্রতি সিজদা করার নির্দেশ দিতাম। – হাসান সহীহ, ইবনু মাজাহ (১৮৫৩) মুআয ইবনু জাবাল, সুরাকা ইবনু মালিক ইবনু জুশুম, আইশা, ইবনু আব্বাস, আবদুল্লাহ ইবনু আবু আওফা, তালক ইবনু আলী, উম্মু সালামা, আনাস ও ইবনু উমর (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবু ঈসা বলেন, আবু হুরাইরা (রাঃ) হতে বর্ণিত হাদীসটি উল্লেখিত সনদ সূত্রে হাসান গারীব।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1160,
			"arabicnumber": 1160,
			"text": "১১৬০। তলক ইবনু আলী (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন লোক তার স্ত্রীকে নিজ প্রয়োজন পূরণের উদ্দেশ্যে ডাকলে সে যেন সাথে সাথে তার নিকট আসে, এমনকি সে চুলার উপর রান্না-বান্নার কাজে ব্যস্ত থাকলেও। — সহীহ, মিশকাত (৩২৫৭), সহীহা (১২০২) এ হাদীসটিকে আবু ঈসা হাসান গারীব বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1161,
			"arabicnumber": 1161,
			"text": "১১৬১৷ উম্মু সালামা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে কোন নারী তার স্বামীকে খুশী রেখে মারা যায় সে জান্নাতে যাবে। - যঈফ, ইবনু মাজাহ (১৮৫৪) আবূ ঈসা বলেন, এ হাদীসটি হাসান গারীব।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1162,
			"arabicnumber": 1162,
			"text": "১১৬২। আবু হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের মধ্যে ঈমানে পরিপূর্ণ মুসলিম হচ্ছে সর্বোত্তম চরিত্রের অধিকারী ব্যক্তি। যেসব লোক নিজেদের স্ত্রীদের নিকট উত্তম তারাই তোমাদের মধ্যে অতি উত্তম। – হাসান সহীহ, সহীহা (২৮৪) আইশা ও ইবনু আব্বাস (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবু ঈসা বলেন, আবু হুরাইরা (রাঃ) হতে বর্ণিত হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1163,
			"arabicnumber": 1163,
			"text": "১১৬৩। সুলাইমান ইবনু আমর ইবনুল আহওয়াস (রাহঃ) হতে তার পিতার সুত্রে বর্ণিত আছে, বিদায় হাজ্জের সময় তিনি রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সাথে ছিলেন। তিনি আল্লাহ্ তা'আলার প্রশংসা ও গুণগান করলেন এবং ওয়াজ-নাসীহাত করলেন। এ হাদীসের মধ্যে বর্ণনাকারী একটি ঘটনা বর্ণনা করে বলেন, তিনি (রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বললেনঃ স্ত্রীদের সাথে ভালো আচরণের উপদেশ নাও। তোমাদের নিকট তারা বন্দীর মত। তাছাড়া তোমাদের আর কোন অধিকার নেই তাদের উপর, কিন্তু তারা যদি সুস্পষ্ট চরিত্রহীনতায় লিপ্ত হয় (তবে ভিন্ন কথা)। তারা যদি তাই করে তাহলে তাদের বিছানাকে আলাদা করে দাও এবং সামান্য প্রহার কর, মারাত্মক প্রহার নয়। যদি তারা তোমাদের অনুগত হয় তাহলে তাদেরকে নির্যাতনের অজুহাত খুঁজতে যেও না। জেনে রাখ! তোমাদের যেমন তোমাদের স্ত্রীদের প্রতি অধিকার আছে, তাদেরও তোমাদের প্রতি ঠিক সেরকমই অধিকার আছে। তাদের প্রতি তোমাদের অধিকার এই যে, তোমরা যাদেরকে পছন্দ কর না তারা যেন সেসব লোককে দিয়ে তোমাদের বিছানা পদদলিত না করায় এবং যেসব অনুমতি না দেয়। জেনে রাখ! তোমাদের প্রতি তাদের অধিকার এই যে, তোমরা তাদের উত্তম পোশাক-পরিচ্ছদ ও ভরণপোষণের ব্যবস্থা করবে। - হাসান, ইবনু মাজাহ ১৮৫১ এ হাদীসটিকে আবু ঈসা হাসান সহীহ বলেছেন। “আওয়ানুন ইনদাকুম\" অর্থাৎ 'তোমাদের নিকট বন্দী’।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1164,
			"arabicnumber": 1164,
			"text": "১১৬৪। আলী ইবনু ত্বালক (রাঃ) হতে বর্ণিত আছে, তিনি বলেছেন, এক বেদুঈন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট এসে বলল, হে আল্লাহর রাসূল! আমাদের মধ্যে কোন লোক মাঠেঘাটে বা জংগলে থাকে। এ অবস্থায় যদি তার পেট হতে বায়ু বের হয় এবং (তার নিকটে) সামান্য পানি থাকে (তবে সে কি করবে)। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তোমাদের কারো বায়ু বের হলে সে যেন ওযু করে। তোমরা নারীদের পশ্চাৎদ্বারে সহবাস কর না। আল্লাহ তা'আলা হাক কথা বলতে লজ্জাবোধ করেন না। যঈফ, মিশকাত (৩১৪, ১০০৬) এ অনুচ্ছেদে উমার, খুযাইমা ইবনু সাবিত, ইবনু আব্বাস ও আবূ হুরাইরা (রাঃ) হতেও হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, আলী ইবনু ত্বালক (রাঃ) বর্ণিত হাদীসটি হাসান। আমি ইমাম বুখারীকে বলতে শুনেছি, আলী ইবনু ত্বালকের বর্ণিত এই একটি মাত্র হাদীস ছাড়া তার সূত্রে বর্ণিত আর কোন হাদীস আছে কি-না তা আমি জানি না। এটি ত্বালক ইবনু আলী আস-সুহাইমীর হাদীসও নয়। তার মতে তিনি অন্য কোন সাহাবী হবেন। ওয়াকীও এ হাদীসটি বর্ণনা করেছেন",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1165,
			"arabicnumber": 1165,
			"text": "১১৬৫৷ ইবনু আব্বাস (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে লোক কোন পুরুষ বা স্ত্রীলোকের মলদ্বারে সংগম করে (কিয়ামতের দিন) আল্লাহ তা'আলা তার দিকে (দয়ার দৃষ্টিতে) তাকাবেন না। — হাসান, মিশকাত (৩১৯৫) এ হাদীসটিকে আবু ঈসা হাসান গারীব বলেছেন। ওয়াকীও এ হাদীসটি বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1166,
			"arabicnumber": 1166,
			"text": "১১৬৬। আলী ইবনু ত্বালক (রাঃ) হতে বর্ণিত আছে, তিনি বলেন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের কেউ বায়ু ত্যাগ করলে সে যেন ওযু করে। তোমরা নারীদের গুহ্যদ্বারে সহবাস কর না। যঈফ, যঈফ আবূ দাউদ (২৬) হাদীসে বর্ণিত রাবী আলী, ইনি হলেন আলী ইবনু তালক।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1167,
			"arabicnumber": 1167,
			"text": "১১৬৭৷ মাইমূনা বিনতু সা'দ (রাঃ) হতে বর্ণিত আছে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের খাদিমা (সেবিকা) ছিলেন। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ স্বামী ব্যতীত অন্য লোকের সামনে যে নারী সাজগোজ করে আকর্ষণীয় পোশাকে প্রকাশিত হয় সে কিয়ামতের দিনের অন্ধকার সমতুল্য। সেদিন তার জন্য কোন আলোর ব্যবস্থা থাকবে না। যঈফ, যঈফা (১৮০০) আবূ ঈসা বলেনঃ এ হাদীসটি আমরা শুধুমাত্র মূসা ইবনু উবাইদার সূত্রেই জেনেছি। কিন্তু তাকে স্মরণশক্তির দিক হতে হাদীস শাস্ত্রে দুর্বল বলা হয়েছে, যদিও তিনি একজন সত্যবাদী লোক হিসেবে স্বীকৃত। এ হাদীসটি শুবা, সুফিয়ান ও অন্যরাও তার নিকট হতে বর্ণনা করেছেন, কোন কোন বর্ণনাকারী উক্ত হাদীসটি মূসা ইবনু উবাইদা হতেও বর্ণনা করেছেন, কিন্তু তারা কেউই এটা মারফু হিসেবে বর্ণনা করেননি (মূসার উক্তি হিসাবেই বর্ণনা করেছেন)।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1168,
			"arabicnumber": 1168,
			"text": "১১৬৮। আবু হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ নিশ্চয়ই আল্লাহ তা'আলার গাইরাত (সূক্ষ্ম আত্মমর্যাদাবোধ) আছে এবং মুমিনেরও গাইরাত আছে। আল্লাহ তা'আলা মুমিনের জন্য যা হারাম করে দিয়েছেন, সে তাতে লিপ্ত হলে আল্লাহ তা'আলার গাইরাতে আঘাত লাগে। — সহীহ, বুখারী, মুসলিম আইশা ও আবদুল্লাহ ইবনু উমর (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, আবু হুরাইরা (রাঃ) হতে বর্ণিত হাদীসটি হাসান গারীব। এ হাদীস আসমা বিনতু আবু বাকর (রাঃ) হতেও অন্য একটি সূত্রে বর্ণিত আছে এবং এ সূত্রটিও সহীহ। আল হাজ্জাজ আস-সাওয়াফের পিতার নাম মইসারাহ, ডাক নাম আবূ উসমান আর বলেছেন, হাজ্জাজ আস-সাওয়াফ একজন জ্ঞানী ও অভিজ্ঞ ব্যক্তি।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1169,
			"arabicnumber": 1169,
			"text": "১১৬৯। আবু সাঈদ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আল্লাহ ও আখিরাতের উপর যে সকল মহিলা ঈমান রাখে, তার সাথে তার পিতা অথবা তার ভাই অথবা তার স্বামী অথবা তার ছেলে অথবা তার কোন মাহরাম আত্মীয় না থাকলে সে সকল মহিলার জন্য তিন দিন বা তার বেশি সময় (একাকী) সফর করা বৈধ নয়। — সহীহ, ইবনু মাজাহ (২৮৯৮), বুখারী, মুসলিম আবু হুরাইরা, ইবনু আব্বাস ও ইবনু উমার (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবু ঈসা বলেন, হাদীসটি হাসান সহীহ। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট হতে আরো বর্ণিত আছে যে, তিনি বলেছেনঃ “কোন মহিলা যেন এক দিন ও এক রাতের পথও অতিক্রম না করে তার সাথে কোন মাহরাম আত্মীয় না নিয়ে (একাকী)\"। এ হাদীস অনুযায়ী বিশেষজ্ঞ আলিমগণ আমল করেছেন। কোন মাহরাম আত্মীয় ব্যতীত কোন মহিলার একাকী ভ্রমণকে তারা মাকরূহ বলেছেন। কোন মহিলার ধন-সম্পদ আছে কিন্তু কোন মাহরাম আত্মীয় নেই, সে মহিলা এরকম পরিস্থিতিতে হাজের সফরে বের হতে পারবে কি-না এই বিষয়ে আলিমদের মধ্যে দ্বিমত আছে। একদল আলিম বলেন, হাজ্জ আদায় করা সে মহিলার জন্য ফরজ নয়। কেননা, রাস্তা অতিক্রমের যোগ্যতা থাকার শর্তের মধ্যে মাহরাম আত্মীয় সাথে থাকার শর্ত অন্তর্ভুক্ত আছে। আল্লাহ তা'আলা বলেনঃ “এই ঘরে পৌছানো পর্যন্ত যে লোকের সামর্থ্য আছে”। অতএব, তারা বলেন, যখন তার কোন মাহরাম আত্মীয় নেই তখন এই ঘর (কাবা) পর্যন্ত পৌছার সামর্থ্যও তার নেই। এই মত সুফিয়ান সাওরী ও কুফাবাসী আলিমদের। আর একদল আলিম বলেছেন, যাতায়াতের রাস্তা যদি বিপদ মুক্ত হয় তবে সে ভিন্ন লোকের সাথে হাজ্জ আদায়ের উদ্দেশ্যে যেতে পারে। এই মত দিয়েছেন ইমাম মালিক ও শাফিঈ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1170,
			"arabicnumber": 1170,
			"text": "১১৭০। আবু হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন মাহরাম আত্মীয় ব্যতীত একাকী যেন কোন মহিলা এক দিন ও এক রাতের দূরত্বও অতিক্রম না করে। — সহীহ, ইবনু মাজাহ (২৮৯৯), বুখারী, মুসলিম এ হাদীসটিকে আবু ঈসা হাসান সহীহ বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1171,
			"arabicnumber": 1171,
			"text": "১১৭১। উকবা ইবনু আমির (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ সাবধান! মহিলাদের সাথে তোমরা কেউ অবাধে দেখা-সাক্ষাৎ করবে না। আনসার সম্প্রদায়ের এক লোক বললেন, হে আল্লাহর রাসূল! দেবর সম্পর্কে আপনার মত কি? তিনি বললেনঃ সে তো মৃত্যু (সমতুল্য)। — সহীহ, গায়াতুল মারাম (১৮১), বুখারী, মুসলিম উমার, জাবির ও আমর ইবনুল আস (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। উকবা ইবনু আমির (রাঃ) হতে বর্ণিত হাদীসটিকে আবু ঈসা হাসান সহীহ বলেছেন। অবাধে স্ত্রীলোকদের সাথে মেলা-মেশার খারাপ পরিণতি সম্পর্কে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের একইরকম হাদীস আরও আছে। তিনি বলেনঃ ‘একজন স্ত্রীলোকের সাথে একজন পুরুষ একাকী থাকলে তাদের মধ্যে শাইতান তৃতীয় ব্যক্তি হিসাবে যোগ দেয়”। “হামউ\" অর্থ হচ্ছে স্বামীর ভাই'। তিনি (রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) ভাবীর সাথে দেবরকেও একাকী থাকতে নিষেধ করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1172,
			"arabicnumber": 1172,
			"text": "১১৭২। জাবির (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যাদের স্বামী উপস্থিত নেই, সে সকল মহিলাদের নিকট তোমরা যেও না। কেননা, তোমাদের সকলের মাঝেই শাইতান (প্রবাহিত) রক্তের ন্যায় বিচরণ করে। আমরা বললাম, আপনার মধ্যেও কি? তিনি বলেনঃ হ্যাঁ, আমার মধ্যেও। কিন্তু আমাকে আল্লাহ তা'আলা সাহায্য করেছেন, তাই আমি নিরাপদ। — সহীহ, এই হাদীসের প্রথম অংশকে পূর্বের হাদীস সমর্থন করে। পূর্ণ হাদীসটি সহীহতে আছে। সহীহ, আবু দাউদ (১১৩৩-২১৩৪), তাখরাজু ফিকহিস সীরাহ (৬৫)। এ হাদীসটিকে আবু ঈসা উল্লেখিত সনদসূত্রে গারীব বলেছেন। মুজালিদ ইবনু সাঈদের স্মরণশক্তি সম্পর্কে একদল মুহাদ্দিস সমালোচনা করেছেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের বাণী “কিন্তু আল্লাহ তা'আলা আমাকে সাহায্য করেছেন, তাই আমি নিরাপদ”-এর ব্যাখ্যায় সুফিয়ান ইবনু উয়াইনা বলেন, তার নিকট হতে আমি নিরাপদে থাকি বা আত্মরক্ষা করতে পারি। কারণ, আল্লাহ তা'আলা আমাকে সাহায্য করেন। সুফিয়ান আরো বলেন, কেননা, শাইতান কখনও অনুগত হয় না বা ইসলাম গ্রহণ করে না। যে সকল মহিলাদের স্বামী তাদের নিকট উপস্থিত নেই এমন স্ত্রীলোকদেরকেই মুগীবাত” বলে। মুগীবাহ’ শব্দের বহুবচন মুগীবাত।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1173,
			"arabicnumber": 1173,
			"text": "১১৭৩। আবদুল্লাহ (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মহিলারা হচ্ছে আওরাত (আবরণীয় বস্তু)। সে বাইরে বের হলে শাইতান তার দিকে চোখ তুলে তাকায়। — সহীহ, মিশকাত (৩১০৯), ইরওয়া (২৭৩), তা’লীক আলা ইবনি খুযাইমা (১৬৮৫) এ হাদীসটিকে আবু ঈসা হাসান গারীব বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1174,
			"arabicnumber": 1174,
			"text": "১১৭৪। মুআয ইবনু জাবাল (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ পৃথিবীতে কোন স্ত্রীলোক যখনই তার স্বামীকে কষ্ট দেয় তখনই (জান্নাতের) বিস্তৃত চক্ষুবিশিষ্ট হুরদের মধ্যে তার (ভাবী) স্ত্রী বলে, হে অভাগিনী! তাকে কষ্ট দিও না। তোমাকে আল্লাহ তা'আলা যেন ধ্বংস করে দেন! তোমার নিকট তো তিনি কিছু সময়ের মেহমান মাত্র। শীঘ্রই তোমার হতে বিচ্ছিন্ন হয়ে তিনি আমাদের নিকট চলে আসবেন। — সহীহ, ইবনু মাজাহ (২০৪১) এ হাদীসটিকে আবু ঈসা হাসান গারীব বলেছেন। শুধুমাত্র উল্লেখিত সনদসূত্রেই আমরা এটি জেনেছি। ইসমাঈল ইবনু আইয়্যাশের সিরিয়ার মুহাদ্দিসগণ হতে বর্ণিত হাদীসগুলো অনেক বেশি সহীহ, কিন্তু হিজায ও ইরাকের মুহাদিসদের নিকট হতে তার বর্ণনার মধ্যে অনেক প্রত্যাখ্যাত রিওয়ায়াত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 29
			}
		}
	]
}