{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"14": "The Book on Business"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1205,
			"arabicnumber": 1205,
			"text": "১২০৫। নুমান ইবনু বাশীর (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে আমি বলতে শুনেছিঃ হালালও সুস্পষ্ট, হারামও সুস্পষ্ট এবং এ দুটির মাঝে অনেক সন্দেহজনক বিষয় আছে। তা হালাল হবে না হারাম হবে সেটা অনেকেই জানে না। যে লোক এই সন্দেহজনক বিষয়গুলো নিজের দ্বীন এবং মান-ইজ্জাতের হিফাযাতের উদ্দেশ্যে ছেড়ে দেবে সে নিরাপদ হল। যে লোক এর কিছুতে লিপ্ত হল তার হারাম কাজে লিপ্ত হওয়ারও সংশয় থেকে গেল। (উদাহরণস্বরূপ) নিষিদ্ধ এলাকার আশেপাশে যে লোক পশু চড়ায়, তার এতে প্রবেশের ভয় আছে। জেনে রাখ! প্রতিটি সরকারেরই কিছু সংরক্ষিত এলাকা থাকে। সাবধান! আল্লাহ্ তা'আলার সংরক্ষিত এলাকা হল তার হারাম করা বিষয়গুলো'। - সহীহ, ইবনু মা-জাহ (৩৯৮৪),বুখারী, মুসলিম হান্নাদ ওয়াকী হতে, তিনি যাকারিয়্যা ইবনু আবী যাইদা হতে, তিনি শা'বী হতে, তিনি নুমান ইবনু বাশীর হতে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে অনুরূপ অর্থে হাদীস বর্ণনা করেছেন। আবু ঈসা বলেন, এ হাদীসটি হাসান সহীহ। একাধিক বর্ণনাকারী নুমান (রাঃ)-এর সূত্রে একই বিষয়বস্তু সম্বলিত হাদীস বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1206,
			"arabicnumber": 1206,
			"text": "১২০৬। ইবনু মাসউদ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -সূদখোর, সূদ দাতা সূদের সাক্ষীদ্বয় ও সূদের (চুক্তি বা হিসাব) লেখককে অভিসম্পাত করেছেন। — সহীহ, ইবনু মা-জাহ (২২৭৭) উমার, আলী, জাবির ও আবু জুহাইফা (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবু ঈসা বলেন, আব্দুল্লাহ (রাঃ) হতে বর্ণিত হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1207,
			"arabicnumber": 1207,
			"text": "১২০৭। আনাস (রাঃ) হতে বর্ণিত আছে, কাবীরা গুনাহ প্রসঙ্গে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আল্লাহ্ তা'আলার সাথে অংশী স্থাপন করা, পিতা-মাতার অবাধ্য হওয়া, মানুষকে মেরে ফেলা এবং মিথ্যা কথা বলা (কাবীরা গুনাহের অন্তর্ভুক্ত)। -সহীহ, গাইয়াতুল মারাম (২৭৭),বুখারী, মুসলিম৷ আবু বাকরা, আইমান ইবনু খুরাইম ও ইবনু উমর (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আনাস (রাঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা হাসান সহীহ গারীব বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1208,
			"arabicnumber": 1208,
			"text": "১২০৮। কাইস ইবনু আবী গারাযা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের নিকট বেরিয়ে আসলেন। আমাদেরকে ‘সামাসিরাহ (দালাল) বলা হত। তিনি বললেনঃ হে ব্যবসায়ী সম্প্রদায়! শাইতান ও গুনাহ ব্যবসায়িক লেনদেনের সময় এসে হাযির হয়। অতএব, ব্যবসায়ের সাথে তোমরা দান-খায়রাতও যুক্ত কর। — সহীহ, ইবনু মা-জাহ (২১৪৫) বারাআ ইবনু আযিব ও রিফাআ (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। কাইস ইবনু আবী গাযারা (রাঃ) হতে বর্ণিত হাদীসটিকে আবু ঈসা হাসান সহীহ বলেছেন। মানসূর, আমাশ, হাবীব ইবনু আবী সাবিত, এবং আরও অনেকে আবু ওয়াইল-এর সূত্রে কাইস ইবনু গারাযা হতে হাদীসটি বর্ণনা করেছেন। তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের এই একটি হাদীসই বর্ণনা করেছেন বলে আমরা জানি। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের উপরোক্ত হাদীসের মত হাদীস হান্নাদ হতে, তিনি আবু মুআবিয়া হতে, তিনি আমাশ হতে, তিনি শাকীক হতে, তিনি কাইস ইবনু আবূ গারাযা (রাঃ) হতে এই সনদেও বর্ণিত আছে। এ সূত্রটিও সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1209,
			"arabicnumber": 1209,
			"text": "১২০৯। আবূ সাঈদ (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ সত্যবাদী ও বিশ্বস্ত ব্যবসায়ীরা (আখিরাতে) নবীগণ, সিদীকগণ (সত্যবাদীগণ) ও শহীদগণের সাথে থাকবে। যঈফ, গায়াতুল মারাম (১৬৭) (বেচা-কেনার হাদীস) আবূ ঈসা বলেনঃ এই হাদীসটি হাসান। শুধুমাত্র উপরোক্ত (সুফিয়ান-আবূ হামযা) সূত্রেই আমরা হাদীসটি অবগত হয়েছি। আবূ হামযার নাম আবদুল্লাহ, পিতা জাবির। তিনি বসরার বয়স্ক আলিম ছিলেন। সুওয়াইদ-ইবনুল মুবারাক হতে, তিনি সুফিয়ান হতে, তিনি আবূ হামযা (রাহঃ) হতে এই সনদেও উপরোক্ত হাদীসের মতই বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1210,
			"arabicnumber": 1210,
			"text": "১২১০। ইসমাঈল ইবনু উবাইদ ইবনু রিফাআ (রাঃ) হতে পালাক্রমে তার পিতা ও দাদার সূত্রে বর্ণিত আছে, তিনি (রিফাআ) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সাথে ঈদের মাঠে রাওয়ানা হলেন। তিনি (রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) লোকদের কেনা-বেচায় জড়িত দেখে বলেনঃ হে ব্যবসায়ী সম্প্রদায়! তারা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের ডাকে সাড়া দিল এবং নিজেদের ঘাড় ও চোখ উঠিয়ে তার দিকে তাকালো। তিনি বললেনঃ কিয়ামতের দিন ব্যবসায়ীদের ফাসিক বা গুনাহগাররূপে উঠানো হবে, কিন্তু যেসব ব্যবসায়ী আল্লাহ্ তা'আলাকে ভয় করে, নির্ভুলভাবে কাজ করে এবং সততা ধারণ করে তারা এর ব্যতিক্রম। যঈফ, ইবনু মাজাহ (২১৪৬) আবূ ঈসা বলেনঃ এ হাদীসটি হাসান সহীহ। ইসমাঈলের পিতাকে উবাইদুল্লাহও বলা হয়।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1211,
			"arabicnumber": 1211,
			"text": "১২১১। আবূ যার (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আল্লাহ তা'আলা কিয়ামতের দিবসে তিন শ্রেণীর লোকের প্রতি ক্ৰক্ষেপ করবেন না, তাদেরকে পবিত্র করবেন না, উপরন্তু তাদের জন্য রয়েছে ভয়ানক শাস্তি। আমরা প্রশ্ন করলাম, হে আল্লাহর রাসূল! এরা কারা? এরা তো ব্যর্থ ও ধ্বংস হল। তিনি বললেনঃ (তারা হল) উপকার করার পর তার খোটাদানকারী, পায়ের গোড়ালির নিচে কাপড় পরিধানকারী এবং নিজের পণ্যদ্রব্য মিথ্যা শপথ করে বিক্রয়কারী। — সহীহ, ইবনু মা-জাহ (২২০৮) ইবনু মাসউদ, আবু হুরাইরা, আবু উমামা ইবনু সালাবা, ইমরান ইবনু হুসাইন ও মাকিল ইবনু ইয়াসার (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবু ঈসা বলেন, আবু যার (রাঃ) হতে বর্ণিত হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1212,
			"arabicnumber": 1212,
			"text": "১২১২। সাখর আল-গামিদী (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ “হে আল্লাহ! আমার উম্মাতের ভোর বেলার মধ্যে তাদেরকে বারকাত ও প্রাচুর্য দান করুন।” বর্ণনাকারী বলেন, যখন তিনি কোথাও কোন ক্ষুদ্র অথবা বৃহৎ বাহিনী পাঠানোর সিদ্ধান্ত নিতেন, তখন তাদেরকে দিনের প্রথম অংশেই পাঠাতেন। সাখর (রাঃ) ছিলেন একজন ব্যবসায়ী। তিনি তার ব্যবসায়ীদের পাঠাতে ইচ্ছা করলে তাদেরকে দিনের প্রথম অংশেই পাঠাতেন। ফলে তিনি অনেক সম্পদের মালিক হন। — সহীহ, তিনি ক্ষুদ্র অথবা বৃহৎ বাহিনী দিনের প্রথম অংশেই প্রেরণ করতেন—’অংশটুকু যঈফ রাওযুন নায়ীর (৪৯০), সহীহ আবূ দাউদ (২৬৪৫), বেচা-কেনার হাদীস, যঈফা (৪১৭৮) ও জাবির (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, সাখর আল-গামিদী (রাঃ) হতে বর্ণিত হাদীসটি হাসান। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের এই একটি মাত্র হাদিসই আমরা সাখর (রাঃ)-এর নিকট হতে জেনেছি। এ হাদীসটি সুফিয়ান সাওরী শুবা হতে, তিনি ইয়া'লা ইবনু আতা হতে পরম্পরায় বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1213,
			"arabicnumber": 1213,
			"text": "১২১৩। আইশা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের পরনের দুটি মোটা কিতরী কাপড় ছিল। যখন তিনি বসতেন তখন তার দেহের ঘামে কাপড় দু'টি ভিজে ভারী হয়ে যেত। একবার কোন এক ইয়াহুদীর সিরিয়া হতে কাপড়ের চালান এলে আমি বললাম, আপনি যদি তার নিকট হতে সুবিধামত সময়ে মূল্য পরিশোধের শর্তে লোক পাঠিয়ে একজোড়া কাপড় কিনে নিতেন। তিনি তার নিকট লোক পাঠালেন। ইয়াহুদী বলল, আমি জানি সে (মুহাম্মাদ) কি করতে চায়। সে আমার মাল অথবা নগদ অর্থ হস্তগত করার পরিকল্পনা করছে। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ সে মিথ্যা বলেছে। তার ভাল করেই জানা আছে যে, তাদের মধ্যে আমি বেশি আল্লাহ ভীরু এবং সবচেয়ে বেশি আমানাত ফিরতদাতা। — সহীহ, বেচা-কেনার হাদীস ইবনু আব্বাস, আনাস ও ইয়াযীদের কন্যা আসমা (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবু ঈসা বলেন, আইশা (রাঃ) হতে বর্ণিত হাদীসটি হাসান সহীহ গারীব। এ হাদীসটি শুবা উমারা ইবনু আবী হাফসা হতে বর্ণনা করেছেন। আবু দাউদ তায়ালিসী বলেন, এই হাদীস প্রসঙ্গে শুবাকে একদিন প্রশ্ন করলে তিনি বলেন, আমি তোমাদের নিকট এই হাদীস বর্ণনা করব না যে পর্যন্ত না তোমরা উঠে গিয়ে হারামী ইবনু উমারার মাথায় চুমা দিচ্ছ। তখন তারা তার মাথায় চুম্বন করল। উক্ত মাজলিসেই হারামী (রাহঃ) হাযির ছিলেন। আবু ঈসা বলেন, এই হাদীসের বর্ণনাকারী হারামীর প্রতি সম্মান দেখানো ছিল এই কথার উদ্দেশ্যে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1214,
			"arabicnumber": 1214,
			"text": "১২১৪। ইবনু আব্বাস (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, বিশ সা' খাদ্যশস্যের বিনিময়ে বন্ধক রাখা ছিল। তা তিনি নিজ পরিবারের জন্য নিয়েছিলেন। — সহীহ, ইবনু মা-জাহ (২২৩৯) এ হাদীসটিকে আবু ঈসা হাসান সহীহ বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1215,
			"arabicnumber": 1215,
			"text": "১২১৫। আনাস (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট গেলাম যবের রুটি ও বাসী চর্বি নিয়ে। তখন এক ইয়াহুদীর নিকট বিশ সা' খাদ্যশস্যের বিনিময়ে তার লৌহবর্মটি বন্ধক ছিল। তিনি তার পরিবারের লোকদের জন্য তা নিয়েছিলেন। আমি একদিন তাকে বলতে শুনলামঃ মুহাম্মাদের (সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের) পরিবার-পরিজনের নিকট কোন রাতে না এক সা’ পরিমাণ খেজুর আর না এক সা’ পরিমাণ খাদ্যশস্য মজুদ ছিল। এ সময় তার নয়জন স্ত্রী ছিল। — সহীহ, ইবনু মা-জাহ (২৪৩৭), বুখারী এ হাদীসটিকে আবু ঈসা হাসান সহীহ বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1216,
			"arabicnumber": 1216,
			"text": "১২১৬। আবদুল মাজীদ ইবনু ওয়াহব (রহঃ) হতে বর্ণিত আছে, তিনি বলেন, আল-আদ্দা ইবনু খালিদ ইবনু হাওযা (রাঃ) আমাকে বললেন, যে চুক্তিপত্র রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে লিখে দেন তা কি তোমাকে পড়ে শুনাব? আমি বললাম, হ্যাঁ। আমার সামনে তিনি একটি পত্র বের করলেন। তাতে লিখা ছিলঃ “রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট হতে আল-আদ্দা ইবনু খালিদ ইবনু হাওযা একটি গোলাম বা দাসী কিনলো (এটি তার দলীল), যার কোন অসুখ নেই, যা পলায়নপর নয় এবং চরিত্রহীনও নয়। এ হলো এক মুসলিমের সাথে অন্য মুসলিমের ক্রয়-বিক্রয়”। – হাসান, ইবনু মা-জাহ (২২৫১) এ হাদীসটিকে আবু ঈসা হাসান গারীব বলেছেন। আমরা এই হাদীসটি শুধু আব্বাদ ইবনু লাইসের সূত্রেই জেনেছি। একাধিক হাদীস বিশারদ তার নিকট হতে এ হাদীসটি বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1217,
			"arabicnumber": 1217,
			"text": "১২১৭। ইবনু আব্বাস (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ওজন ও পরিমাপকারীদের উদ্দেশ্যে বলেছেনঃ তোমাদের উপর (ওজন ও পরিমাপ করার) এমন দু'টি দায়িত্ব দেয়া হয়েছে যাতে (ত্রুটি করার অপরাধে) তোমাদের আগেকার অনেক জাতি ধ্বংস হয়েছে। যঈফ, সহীহ কথা হল হাদীসটি মাওকুফ, মিশকাত, তাহকীক ছানী (২৮৯০), বেচা কেনার হাদীস আবূ ঈসা বলেন, আমরা এ হাদীসটি শুধুমাত্র হুসাইন ইবনু কাইসের সূত্রেই মারফু হিসাবে জেনেছি। হুসাইনকে হাদীস শাস্ত্রে দুর্বল বলে উল্লেখ করা হয়েছে। এ হাদীসটি সহীহ সনদে ইবনু আব্বাস (রাঃ) হতে মাওকৃফ হিসেবেও বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1218,
			"arabicnumber": 1218,
			"text": "১২১৮। আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (উটের পিঠে বিছানোর) একটি ছালা (বা মোটা কাপড়) এবং একটি কাঠের পাত্র বেচার প্রস্তাব করেন এবং তিনি বলেনঃ কে এই ছালা ও পাত্রটি কিনবে? এক লোক বলল, আমি এ দু'টি এক দিরহামে কিনতে চাই। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ কে এক দিরহামের বেশী দিবে, কে এক দিরহামের বেশী দিবে? এক ব্যক্তি তাকে দুই দিরহাম দিয়ে তার নিকট হতে জিনিস দুটি কিনলো। যঈফ, ইবনু মাজাহ (২১৯৮) আবূ ঈসা বলেন, এ হাদীসটি হাসান। আমরা শুধুমাত্র আখ্যারের সূত্রেই এ হাদীসটি অবগত হয়েছি। আবদুল্লাহ হানাফী যিনি আনাস (রাঃ) হতে হাদীস বর্ণনা করেছেন তার উপনাম আবূ বকর। একদল বিশেষজ্ঞ আলিম এ হাদীস অনুযায়ী আমল করার মত দিয়েছেন। তাদের মতে গানীমাত ও ওয়ারিসী সম্পত্তি নিলাম ডাকের মাধ্যমে বিক্রয় করাতে কোন সমস্যা নেই। মুতামির-সহ একাধিক রাবী উক্ত হাদীস আখ্যারের সূত্রে বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1219,
			"arabicnumber": 1219,
			"text": "১২১৯। জাবির (রাঃ) হতে বর্ণিত আছে, আনসার বংশের এক লোক মৃত্যুবরণ করল তার গোলামকে মুদাব্বার করার পর। সে লোকটি আর কোন সম্পদ রেখে যায়নি ঐ গোলামটি ব্যতীত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একে বিক্রয় করলেন। তাকে কিনলেন নুআইম ইবনু আবদুল্লাহ ইবনু নাহহাম (রাঃ)। জাবির (রাঃ) বলেন, সে ছিল কিবতী বংশোদ্ভূত গোলাম। সে ইবনু যুবাইর (রাঃ)-এর খিলাফাতের প্রথম বছরমৃত্যুবরণ করেন। – সহীহ, ইরওয়া (১২৮৮), বেচা-কেনার হাদীস, বুখারী, মুসলিম এ হাদীসটিকে আবু ঈসা হাসান সহীহ বলেছেন। এটা বিভিন্ন সূত্রে জাবির (রাঃ) হতে বর্ণিত হয়েছে। এ হাদীস অনুযায়ী রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের একদল বিশেষজ্ঞ সাহাবী ও অপরাপর আলিম আমল করেছেন। তারা মুদাব্বার গোলাম বিক্রয়ে কোন সমস্যা আছে বলে মনে করেন না। এই মত দিয়েছেন ইমাম শাফিঈ, আহমাদ ও ইসহাক। মুদাববার গোলাম বিক্রয় করাকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের অপর একদল বিশেষজ্ঞ সাহাবী ও অপরাপর আলিম মাকরূহ বলেছেন। এই মত দিয়েছেন সুফিয়ান সাওরী, মালিক ও আওযাঈ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1220,
			"arabicnumber": 1220,
			"text": "১২২০। ইবনু মাসউদ (রাঃ) হতে বর্ণিত আছে, পণ্যদ্রব্য আমদানী করে আনা কাফিলার দিকে এগিয়ে গিয়ে পণ্য ক্রয় করতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিষেধ করেছেন। — সহীহ, ইবনু মা-জাহ (২১৮০), মুসলিম আলী, ইবনু আব্বাস, আবু হুরাইরা, আবু সাঈদ, ইবনু উমার (রাঃ)-সহ আরো একজন সাহাবী হতে এ অনুচ্ছেদে হাদীস বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1221,
			"arabicnumber": 1221,
			"text": "১২২১। আবু হুরাইরা (রাঃ) হতে বর্ণিত আছে, বাজারে পণ্যদ্রব্য নিয়ে আসা লোকের সামনে এগিয়ে গিয়ে তাদের নিকট হতে পণ্য ক্রয় করতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বারণ করেছেন। (ব্যবসায়ীদের) কোন ব্যক্তি যদি এগিয়ে গিয়ে তার পণ্যদ্রব্য কিনে, তবে বাজারে পৌছার পর বিক্রেতা বিক্রয় বাতিল করার স্বাধীনতা পাবে। — সহীহ, ইবনু মা-জাহ (২১৭৮), মুসলিম আবু ঈসা বলেন, আইয়্যুবের বর্ণিত হাদিস হিসেবে হাদিসটি হাসান গারীব। আর ইবনু মাসউদের হাদীসটি হাসান সহীহ। পণ্যদ্রব্য বাজারে আসার আগেই বাজারের বাইরে গিয়ে তা কেনাকে একদল বিশেষজ্ঞ আলিম মাকরূহ বলেছেন। তারা মনে করেন এটা এক প্রকারের প্রতারণা ও ধোকাবাজি। এই মত দিয়েছেন ইমাম শাফিঈ ও অন্যান্য আলিমগণ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1222,
			"arabicnumber": 1222,
			"text": "১২২২। আবু হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ শহরাঞ্চলের লোকেরা গ্রামাঞ্চলের লোকদের পণ্যদ্রব্য বিক্রয় করবে না। — সহীহ, ইবনু মা-জাহ (২১৭৫), নাসা-ঈ তালহা, জাবির, আনাস, ইবনু আব্বাস, হাকিম ইবনু ইয়াযিদ তার পিতার সূত্রে, আমর ইবনু আওফ (রাঃ) এবং আরো একজন সাহাবী হতে এ অনুচ্ছেদে হাদীস বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1223,
			"arabicnumber": 1223,
			"text": "১২২৩। জাবির (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ শহরের মানুষগণ গ্রামের মানুষদের পণ্যদ্রব্য বিক্রয় করবে না। লোকদেরকে তাদের স্বাভাবিক অবস্থার উপর ছেড়ে দাও। কেননা, আল্লাহ্ তা'আলা এক দলের মাধ্যমে অন্য দলের রিযিকের ব্যবস্থা করেন। - সহীহ, ইবনু মা-জাহ (২১৭৬), বুখারী, মুসলিম আবু ঈসা বলেন, আবু হুরাইরা (রাঃ) হতে বর্ণিত হাদীসটি হাসান সহীহ। আর জাবির (রাঃ) হতে বর্ণিত হাদীসটিও হাসান সহীহ। এ হাদীস অনুযায়ী রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের একদল বিশেষজ্ঞ সাহাবী ও অপরাপর আলিম আমল করেছেন। গ্রাম-গঞ্জের লোকের পক্ষে শহরে বসবাসকারীদের বিক্রয় করাকে তারা মাকরুহ বলেছেন। তাদের মধ্যে আবার কেউ কেউ এ ধরণের বিক্রয়ের অনুমতি দিয়েছেন। এ ধরণের বিক্রয় করাকে ইমাম শাফিঈ মাকরূহ বলেছেন। তবে কেউ যদি তা বিক্রয় করে তবে তা জায়িয হবে বলে মত ব্যক্ত করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1224,
			"arabicnumber": 1224,
			"text": "১২২৪। আবু হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, মুহাকালা ও মুযাবানা ধরণের ক্রয়-বিক্রয়কে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিষিদ্ধ করেছেন। — সহীহ, ইরওয়া (২৩৫৪) ইবনু উমার, ইবনু আব্বাস, যাইদ ইবনু সাবিত, সাদ, জাবির, রাফি ইবনু খাদীজ ও আবু সাঈদ (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবু ঈসা বলেন, আবু হুরাইরা (রাঃ) হতে বর্ণিত হাদীসটি হাসান সহীহ। মুহাকালা বলা হয় ক্ষেতের ফসলকে সংগৃহীত গমের বিনিময়ে বিক্রয়কে। আর মুযাবানা বলা হয় শুকনো খেজুরের বিনিময়ে গাছের (অসংগৃহীত) খেজুর বিক্রয়কে। এ হাদীস অনুযায়ী বিশেষজ্ঞ আলিমগণ আমল করেছেন। তারা মাকরূহ বলে মত দিয়েছেন মুহাকালা ও মুযাবানা ধরণের ক্রয়-বিক্রয় করাকে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1225,
			"arabicnumber": 1225,
			"text": "১২২৫। আবদুল্লাহ ইবনু ইয়াযীদ (রহঃ) হতে বর্ণিত আছে, আবৃ আইয়্যাশ যাইদ (রাহঃ) বার্লির বিনিময়ে গম বিক্রয় করা প্রসঙ্গে জানতে চাইলে তিনি সা'দ (রাঃ)-কে প্রশ্ন করলেনঃ তখন তিনি (সাদ) বললেন, এ দুটির মধ্যে কোনটি অপেক্ষাকৃত উত্তমঃ তিনি (যাইদ) বললেন, গম। তারপর তিনি (সা’দ) এ ধরণের বিক্রয় করা নিষেধ করলেন তিনি আরও বললেন, আমি তাজা খেজুরকে শুকনো খেজুরের বিনিময়ে বিক্রয় করা যায় কি-না সেই প্রসঙ্গে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট প্রশ্ন করতে শুনেছি। তিনি তার পাশের লোকদের প্রশ্ন করলেন যে, খেজুর শুকালে কি (ওজনে) কমে যায়? তারা বললেন, হ্যাঁ। তারপর এ ধরণের বিক্রয়কে তিনি নিষিদ্ধ করে দিলেন। — সহীহ, ইবনু মা-জাহ (২২৬৪) হান্নাদ বর্ণনা করেছেন ওয়াকী হতে, তিনি আব্দুল্লাহ ইবনু ইয়ামীদ হতে, তিনি যাইদ আবু আইয়্যাশ (রাহঃ) হতে, তিনি বলেন, সা’দ (রাঃ)-কে আমরা প্রশ্ন করলাম....উপরের হাদীসের মত। আবু ঈসা বলেন, হাদীসটি হাসান সহীহ। এই হাদীস অনুযায়ী আলিমগণ আমল করেছেন। এই মত দিয়েছেন ইমাম শাফিঈ এবং আমাদের সাথীরাও।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1226,
			"arabicnumber": 1226,
			"text": "১২২৬। ইবনু উমর (রাঃ) হতে বর্ণিত আছে, খেজুরের লাল বা হলুদ বর্ণ না আসা পর্যন্ত তা বিক্রয় করতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বারণ করেছেন। - সহীহ, বেচা-কেনার হাদীস।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1227,
			"arabicnumber": 1227,
			"text": "১২২৭। একই সনদ সূত্রে আরো বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম শীষ জাতীয় ফসল (ধান, গম ইত্যাদি) বিক্রয় করতে নিষেধ করেছেন যতক্ষণ তা পেকে সাদা না হয়। — সহীহ, প্রাগুক্ত আনাস, আইশা, আবু হুরাইরা, ইবনু আব্বাস, জাবির, আবু সাঈদ ও যাইদ ইবনু সাবিত (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবু ঈসা বলেন, ইবনু উমার (রাঃ)-এর হাদীসটি হাসান সহীহ। এ হাদীস অনুযায়ী রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয আল্লামের বিশেষজ্ঞ সাহাবী ও অপরাপর আলিম অমল করেছেন। ফল পক্ক হওয়ার আগেই বিক্রয় করা তাদের মতে মাকরূহ। এই মত পোষণ করেন ইমাম শাফিঈ, আহমাদ ও ইসহাকও।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1228,
			"arabicnumber": 1228,
			"text": "১২২৮। আনাস (রাঃ) হতে বর্ণিত আছে, কাল রং ধারণ না করা পর্যন্ত আঙ্গুরকে এবং হৃষ্টপুষ্ট না হওয়া পর্যন্ত শস্যকে বিক্রয় করতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিষেধ করেছেন। — সহীহ, ইবনু মা-জাহ (২২১৭) আবু ঈসা বলেন, এ হাদীসটি হাসান গারীব। আমরা এটাকে শুধু হাম্মাদ ইবনু সালামার সূত্রেই মারফু হিসেবে জেনেছি।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1229,
			"arabicnumber": 1229,
			"text": "১২২৯। ইবনু উমর (রাঃ) হতে বর্ণিত আছে, (পশুর) গর্ভস্থিত বাচ্চার বাচ্চা বিক্রি করতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিষেধ করেছেন। সহীহ, ইবনু মা-জাহ (২১৯৭), মুসলিম, বুখারী আবদুল্লাহ ইবনু আব্বাস ও আবূ সাঈদ আল-খুদরী (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, ইবনু উমর (রাঃ) হতে বর্ণিত হাদীসটি হাসান সহীহ। এ হাদীস মোতাবিক অভিজ্ঞ আলিমগণ আমল করেছেন। 'হাবলুল হাবল’ বলতে বাচ্চার বাচ্চা বুঝায়। এভাবে বিক্রয় করাটা আলিমদের মতে বাতিল বলে গণ্য হবে। এটা ক্রয়-বিক্রয়ে এক প্রকারের প্রতারণা। শুবা-আইয়ুব হতে তিনি সাঈদ ইবনু জুবাইর হতে, তিনি ইবনু আব্বাস (রাঃ)-এর সূত্রে উল্লেখিত হাদীসটি বর্ণনা করেছেন। ইবনু উমারের এ হাদীসটি আবূল ওয়াহহাব আস-সাকাফী এবং তিনি ইবনু উমার হতে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেছেন এবং এ সূত্রটি অনেক বেশি সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1230,
			"arabicnumber": 1230,
			"text": "১২৩০। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, প্রতারণামূলক ক্রয়-বিক্রয় করতে এবং কাকর নিক্ষেপে ক্রয়-বিক্রয় নির্ধারিত করতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিষেধ করেছেন। সহীহ্, ইবনু মা-জাহ (২১৯৪), মুসলিম ইবনু উমার, ইবনু আব্বাস, আবূ সাঈদ ও আনাস (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, আবূ হুরাইরা (রাঃ) হতে বর্ণিত হাদীসটি হাসান সহীহ। এ হাদীস অনুযায়ী বিশেষজ্ঞ আলিমগণ আমল করেছেন। তারা প্রতারণামূলক ক্রয়-বিক্রয় করাকে নিষিদ্ধ বলেছেন। ইমাম শাফিঈ বলেছেন, প্রতারণামূলক ক্রয়-বিক্রয়ের মধ্যে রয়েছে পানির মধ্যের মাছ, পলাতক গোলাম, শূন্যে উড়ন্ত পাখি বা অনুরূপ পর্যায়ের কোন কিছুর ক্রয়-বিক্রয়। কাকর নিক্ষেপে বিক্রয়ের ধরণ হলঃ যদি বিক্রেতা ক্রেতাকে বলে, তোমার দিকে আমি যখন কোন কাঁকর ছুঁড়ে মারবো তখন তোমার ও আমার মাঝে বাধ্যতামূলক হয়ে যাবে ক্রয়-বিক্রয় করাটা। এটা মুনাবাযা ধরণের ক্রয়-বিক্রয়ের সাথে সাদৃশ্যপূর্ণ। এটাও জাহিলী যুগের প্রথা।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1231,
			"arabicnumber": 1231,
			"text": "১২৩১। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, দুই ধরণের বিক্রয় ব্যবস্থার মাধ্যমে (দুই ধরনের শর্তে) একই জিনিসের বিক্রয় করতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিষেধ করেছেন। --- সহীহ, মিশকাত (২৮৬৮), ইরওয়া (৫/১৪৯) আবদুল্লাহ ইবনু আমর, ইবনু উমার ও ইবনু মাসউদ (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, আবূ হুরাইরা (রাঃ) হতে বর্ণিত হাদীসটি হাসান সহীহ। এ হাদীস অনুযায়ী আলিমগণ আমল করেন। “বাইআতাইনে ফী বাইআতিন”-এর ব্যাখ্যায় একদল বিশেষজ্ঞ আলিম বলেছেনঃ ক্রেতাকে বিক্রেতা বলল, এই কাপড়টি দশ টাকায় যদি নগদ মূল্যে ক্রয় করা হয়, তবে বাকীতে ক্রয় করলে বিশ টাকা। এই দুটি বিক্রয় প্রস্তাবের মধ্যে কোন একটিকে কোন পক্ষই নাকচ করল না। কিন্তু কোন একটি প্রস্তাব যদি গ্রহণ করে নেয় এবং সে অনুযায়ী চুক্তি হয় তবে তাতে কোন সমস্যা নেই। ইমাম শাফঈ বলেছেন, একই বিক্রয়ে দুই ধরনের বিক্রয় অন্তর্ভুক্ত করতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম,নিষেধ করেছেন। তার দৃষ্টান্ত হলঃ কোন লোক বলল, আমি তোমার নিকট এত টাকায় আমার এই ঘর বিক্রয় করব এই শর্তে যে, আমার নিকট তোমার গোলামটিও এত টাকায় বিক্রয় করতে হবে। তোমার গোলাম যখন আমার অধীনে আসবে আমার ঘরও তখন তোমার অধীনে চলে যাবে। এই প্রকারের ক্রয়-বিক্রয় ঐ ক্রয়-বিক্রয় হতে ভিন্ন যেখানে পণ্যের মধ্যে কোনটিরই মূল্য নির্ধারণ করা হয়নি বিধায় ক্রেতা ও বিক্রেতা উভয়ে বিক্রিত দ্রব্যের মূল্য সম্পর্কে অজ্ঞ থাকে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1232,
			"arabicnumber": 1232,
			"text": "১২৩২। হাকীম ইবনু হিযাম (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, বললাম, আমার নিকট এসে কোন লোক এমন জিনিস কিনতে চায় যা আমার নিকট নেই। আমি এভাবে বিক্রয় করতে পারি কি যে, তা বাজার হতে ক্রয় করে এনে তাকে দিব? তিনি বলেনঃ যা তোমার অধিকারে নেই তা তুমি বিক্রয় কর না। - সহীহ, ইবনু মা-জাহ (২১৮৭)। আব্দুল্লাহ ইবনু উমার হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1233,
			"arabicnumber": 1233,
			"text": "১২৩৩। হাকীম ইবনু হিযাম (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমার হাতে নেই এমনসব বস্তু বিক্রয় করতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে নিষেধ করেছেন। সহীহ, দেখুন পূর্বের হাদীস। আবূ ঈসা বলেন, এ হাদীসটি হাসান। ইসহাক ইবনু মানসূর বলেন, ইমাম আহমাদকে আমি প্রশ্ন করলাম, “ঋণ ও বিক্রয় একত্রে জায়িয নয়” এ কথার অর্থ কি? তিনি বললেন, কোন লোককে ঋণও প্রদান করলে এবং এর সাথে সাথে তার নিকট তোমার পণ্যও চড়া দামে বিক্রয় করলে। অথবা এরূপও হতে পারে যে, কোন জিনিস (বন্ধক রেখে) তাকে ঋণ দিয়ে বললে, তোমার এটা (বন্ধক) এতো দামে বিক্রীত বলে গণ্য হবে যদি ঐটা পরিশোধ করতে না পার। ইসহাক আরও বলেন, আমি ইমাম আহমাদকে পুনরায় বললাম, “লোকসানের দায়িত্ব গ্রহণ না করা পর্যন্ত বিক্রয় হয় না” কথার অর্থ কি? তিনি বললেন, আমার মতে শুধু খাদ্যদ্রব্যের বেলায় এটা প্রযোজ্য হবে অর্থাৎ যতক্ষণ এটা তোমার হস্তগত না হবে ততক্ষণ তা বিক্রয় করতে পারবে না। ইসহাক বলেন, পরিমাপ যন্ত্র বা পাত্র দিয়ে যা মাপা হয় সেই সব ক্ষেত্রে এই নীতি প্রযোজ্য। ইমাম আহমাদ বলেন, যদি এভাবে বলা হয়ঃ আমি এ কাপড় তোমার নিকট বিক্রয় করলাম এবং এর সেলাই ও ধোয়ার কাজ আমার দায়িত্বে, তবে একই বিক্রয়ের মধ্যে এটাও দুটি শর্তারোপের একটি উদাহরণ। সে যদি এরূপ বলেঃ এটা তোমার নিকট বিক্রয় করলাম এবং আমিই এটা ধুয়েও দিব, তবে এতে কোন সমস্যা নেই। কেননা, একটি শর্ত করা হয়েছে (দুটি নয়)।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1234,
			"arabicnumber": 1234,
			"text": "১২৩৪। আবদুল্লাহ ইবনু আমর (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ঋণ ও বিক্রয় একত্রে জায়িয নয় এবং দুই প্রকারের শর্তও বিক্রয়ের ক্ষেত্রে জুড়ে দেয়া জায়িয নয়, মুনাফা গ্রহণও জায়িয নয় যতক্ষণনা লোকসানের দায়িত্ব না নেয়া হয়, তোমার আয়ত্তে নেই এমন বস্তু বিক্রয় করাও জায়িয নয়। হাসান সহীহ, ইবনু মা-জাহ (২১৮৮) আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। একাধিক সূত্রে হাকীম (রাঃ)-এর বর্ণিত হাদীসটি বর্ণিত আছে। আইয়ুব সাখতিয়ানী ও আবূ বিশর বর্ণনা করেছেন, ইউসুফ ইবনু মাহিক হতে, তিনি হাকীম ইবনু হিযাম হতে। আউফ এবং হিশাম ইবনু হাসসান বর্ণনা করেছেন, ইবনু সীরীন হতে, তিনি হাকীম ইবনু হিযাম হতে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে। এর পরবর্তী বর্ণনাটি মুরসাল। প্রকৃত পক্ষে ইবনু সীরীন বর্ণনা করেছেন, আইয়ুব সাখতিয়ানী হতে, তিনি ইউসুফ ইবনু মাহাক হতে, তিনি হাকীম ইবনু হিযাম হতে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1235,
			"arabicnumber": 1235,
			"text": "১২৩৫। হাকীম ইবনু হিযাম (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে নিষেধ করেছেন আমার কাছে নেই এমন জিনিস বিক্রয় করতে। সহীহ, দেখুন হাদীস নং (১২৩২, ১২৩৩) আবূ ঈসা বলেন, ওয়াকী এই হাদীসটি বর্ণনা করেছেন, ইয়াযীদ ইবনু ইব্রাহীম হতে, তিনি ইবনু সীরিন হতে, তিনি আইয়ুব হতে তিনি হাকীম ইবনু হিযাম হতে। এতে ওয়াকী ইউসুফ ইবনু মাহাকের উল্লেখ করেননি। আব্দুস সামাদের সনদ সূত্রটি অনেক বেশি সহীহ। ইয়াহইয়া ইবনু কাসীর এই হাদীসটি বর্ণনা করেছেন ইয়া'লা ইবনু হাকীম হতে, হাকীম ইবনু হিযাম হতে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে। এ হাদীস অনুযায়ী বিশেষজ্ঞ আলিমগণ আমল করেন। তারা হস্তগতহীন জিনিসের ক্রয়-বিক্রয়কে মাকরূহ বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1236,
			"arabicnumber": 1236,
			"text": "১২৩৬। ইবনু উমর (রাঃ) হতে বর্ণিত আছে, ‘ওয়ালা স্বত্ব বিক্রয় করতে অথবা তা দান করতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিষেধ করেছেন। সহীহ, ইবনু মা-জাহ (২৭৪৭, ২৭৪৮) আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। আমরা এ হাদীসটি শুধু আব্দুল্লাহ ইবনু দীনারের সূত্রেই ইবনু উমার হতে জেনেছি। এ হাদীস অনুযায়ী আলিমগণ আমল করেছেন। উপরোক্ত হাদীসটি ইবনু উমার (রাঃ) হতে অন্য একটি সূত্রেও বর্ণিত আছে, কিন্তু তার সনদে বিপত্তি আছে [উবাইদুল্লাহ ও আবদুল্লাহ (রাঃ)-এর মাঝে নাফি (রাহঃ)-এর নাম যোগ করার]। ইয়াহইয়া ইবনু সুলাইম এই ভুল করেছেন। আবদুল ওয়াহহাব আস-সাকাকী, আবদুল্লাহ ইবনু নুমাইর এবং আরও অনেকে উবায়দুল্লাহ ইবনু উমার হতে তিনি আব্দুল্লাহ ইবনু দীনার হতে, তিনি ইবনু উমার হতে তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এই সনদ সূত্রে বর্ণনা করেছেন। এই সনদসূত্রটি ইয়াহইয়া ইবনু সুলাইমের সনদের চেয়ে অনেক বেশি সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1237,
			"arabicnumber": 1237,
			"text": "১২৩৭। সামুরা (রাঃ) হতে বর্ণিত আছে, পশুর বিনিময়ে পশু ধারে (করজে) বিক্রয় করতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিষেধ করেছেন। সহীহ, ইবনু মা-জাহ (২২৭০) ইবনু আব্বাস, জাবির ও ইবনু উমার (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, সামুরা (রাঃ) হতে বর্ণিত হাদীসটি হাসান সহীহ। আলী ইবনুল মাদীনী ও অন্যান্যের মতে সামুরা (রাঃ)-এর নিকট হাসান (রাহঃ) সরাসরি হাদীস শ্রবণ করেছেন। এ হাদীস মোতাবিক রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের বেশিরভাগ সাহাবী ও অন্যান্য আলিমগন আমল করেছেন। তাদের মতে, পশুর বিনিময়ে পশু ধারে বিক্রয় করা জায়িয নয়। এই মত দিয়েছেন সুফিয়ান সাওরী ও কূফাবাসী আলিমগণ। ইমাম আহমাদও একই রকম মত দিয়েছেন। পশুর বিনিময়ে পশু ধারে বিক্রয় করার পক্ষে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের অপর একদল সাহাবী ও অন্যান্য আলিমগন সন্মতি দিয়েছেন। এই মত ইমাম শাফিঈ ও ইসহাকের।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1238,
			"arabicnumber": 1238,
			"text": "১২৩৮। জাবির (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ দু'টি পশুর বদলে একটি পশু ধারে (করজে) বিক্রয় করা জায়িয নয়, কিন্তু উপস্থিত (নগদ) লেনদেন হলে কোন সমস্যা নেই। সহীহ, ইবনু মা-জাহ (২২৭১) এ হাদিসটিকে আবু ঈসা হাসান সহীহ বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1239,
			"arabicnumber": 1239,
			"text": "১২৩৯। জাবির (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট একজন ক্রিতদাস এসে হিজরাতের উদ্দেশ্যে তার নিকট শপথ করে। সে যে ক্রীতদাস রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সেটা জানতেন না। তার মালিক এসে উপস্থিত হল তাকে ফেরত নেয়ার জন্য। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তুমি একে আমার নিকট বিক্রয় করে দাও। তিনি তাকে কিনলেন দুইটি হাবশী গোলামের বিনিময়ে। এরপর হতে কারো বাইআত গ্রহণের পূর্বে তিনি প্রশ্ন করে নিতেন, সে ক্রীতদাস কি না। সহীহ, বেচা-কেনার হাদীস, মুসলিম আনাস (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ ঈসা ৰলেন, জাবির (রাঃ) হতে বর্ণিত হাদীসটি হাসান সহীহ। আলিমগণ এ হাদীস মোতাবিক আমল করেন। তাদের মতে দুটো গোলামের বিনিময়ে একটি গোলাম কেনাতে কোন সমস্যা নেই, তবে নগদ লেন-দেন হতে হবে। বাকীর মাধ্যমে এ জাতীয় লেনদেন সম্পাদন প্রসঙ্গে তাদের মধ্যে মতের অমিল আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1240,
			"arabicnumber": 1240,
			"text": "১২৪০। উবাদা ইবনু সামিত (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ সমপরিমাণ স্বণের পরিবর্তে সমপরিমাণ স্বর্ণ হতে হবে; সমপরিমাণ রূপার পরিবর্তে সমপরিমাণ রূপা হতে হবে; সমপরিমাণ খেজুরের পরিবর্তে সমপরিমাণ খেজুর হতে হবে; সমপরিমাণ গমের পরিবর্তে সমপরিমাণ গম হতে হবে; সমপরিমাণ লবণের পরিবর্তে সমপরিমাণ লবণ হতে হবে এবং সমপরিমাণ যবের পরিবর্তে সমপরিমাণ যব হতে হবে। যে লোক এ সবের লেনদেনে বেশি পরিমাণ দিবে অথবা নিবে সে সূদে লেনদেনকারী বলে বিবেচিত হবে। তোমাদের ইচ্ছানুযায়ী রূপার পরিমাণের পরিবর্তে স্বর্ণের পরিমাণ নির্ধারণ করে নগদ বিক্রয় করতে পার। তোমাদের ইচ্ছানুযায়ী খেজুরের পরিমাণের পরিবর্তে গমের পরিমাণ নির্ধারণ করে নগদ বিক্রয় করতে পার। তোমাদের ইচ্ছানুযায়ী খেজুরের পরিমাণের পরিবর্তে যবের পরিমাণ ঠিক করে নগদ বিক্রয় করতে পার। সহীহ, ইবনু মা-জাহ (২২৫৪), মুসলিম আবূ সাঈদ, আবূ হুরাইরা, বিলাল ও আনাস (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। উবাদা (রাঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। উল্লেখিত হাদীসের অপর এক বর্ণনায় আছেঃ “তোমাদের ইচ্ছানুযায়ী গমের পরিমাণের পরিবর্তে যবের পরিমাণ নির্ধারণ করে নগদ বিক্রয় করতে পার”। আর এক বর্ণনায় আছেঃ “তোমাদের ইচ্ছানুযায়ী বার্লির পরিমাণের পরিবর্তে গমের পরিমাণ নির্ধারণ করে (পরিমাণে কম-বেশি করে) নগদ বিক্রয় করতে পার।\" এ হাদীস অনুযায়ী বিশেষজ্ঞ আলিমগণ আমল করেছেন। তাদের মতে, সমপরিমাণ গমের পরিবর্তে সমপরিমাণ গম এবং সমপরিমাণ যবের পরিবর্তে সম-পরিমাণ যব বিক্রয় করতে কোন সমস্যা নেই। বিনিময়ের বস্তু দুটি যদি একই প্রজাতির না হয় তাহলে পরিমাণে কম-বেশি হলে কোন সমস্যা নেই, কিন্তু সেই ক্ষেত্রে নগদ আদান-প্রদান হতে হবে। এই মত প্রকাশ করেছেন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের বেশিরভাগ বিশেষজ্ঞ সাহাবী ও তাবিঈ। সুফিয়ান সাওরী, আহমাদ ও ইসহাকেরও এই মত। শাফিঈ বলেন, এ কথার দলীল হল রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের বাণীঃ “তোমাদের ইচ্ছানুযায়ী গমের পরিমাণের পরিবর্তে যবের পরিমাণ ঠিক করে নগদ বিক্রয় করতে পার।” একদল আলিমের মতে যবের পরিবর্তে গমের পরিমাণ বেশি নির্ধারণ করে বিক্রয় করা মাকরূহ, উভয়ের পরিমাণ সমান থাকতে হবে। ইমাম মালিক এই মত পোষণ করেন। কিন্তু প্রথম মতই অনেক বেশি সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1241,
			"arabicnumber": 1241,
			"text": "১২৪১। নাফি (রহঃ) হতে বর্ণিত আছে, তিনি বলেন, আবূ সাঈদ (রাঃ)-এর নিকট আমি ও ইবনু উমার (রাঃ) গেলাম। তিনি আমাদেরকে হাদীস বর্ণনা প্রসঙ্গে বলেন, আমার দুটাে কানই রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে বলতে শুনেছেঃ তোমরা স্বর্ণের পরিবর্তে স্বর্ণ বিক্রয় কর না পরিমাণে সমান না রেখে। একইভাবে তোমরা রূপার পরিবর্তে রূপা বিক্রয় কর না পরিমাণে সমান সমান না রেখে। একটি অন্যটি হতে পরিমাণে কম-বেশি করা যাবে না। উপস্থিত বস্তুর পরিবর্তে অনুপস্থিত বস্তু বিক্রয় কর না। সহীহ, ইরওয়া (৫/১৮৯) বেচা-কেনার হাদীস, নাসা-ঈ আবূ বাকার, উমার, উসমান, আবূ হুরায়রা, হিশাম ইবনু আমির, বারাআ, জাইদ ইবনু আরকাম, ফাজালা ইবনু উবাইদা, আবূ বাকরা, ইবনু উমার, আবূ দারদা ও বিলাল (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, সূদের অনুচ্ছেদে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে আবূ সাঈদ কর্তৃক বর্ণিত হাদীসটি হাসান সহীহ। এ হাদীস অনুযায়ী বিশেষজ্ঞ সাহাবী ও তাবিঈগণ আমল করেছেন। তবে ইবনু আব্বাস (রাঃ) হতে বর্ণিত আছেঃ “স্বর্ণের পরিবর্তে স্বর্ণ এবং রূপার পরিবর্তে রূপা নগদ আদান-প্রদানের ক্ষেত্রে পরিমাণে কম-বেশি করাতে তিনি কোন সমস্যা মনে করেন না। তিনি আরো বলেন, শুধুমাত্র ধার-কর্জের ক্ষেত্রেই (কম-বেশি করলে) সূদ হয়।” অন্য কতিপয় সাহাবী হতেও একইরকম বর্ণিত আছে। কিন্তু এও বর্ণিত আছে যে, তাকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের এই হাদীসটি আবূ সাঈদ (রাঃ) শুনানের পর তিনি (ইবনু আব্বাস) তার উপরোক্ত বক্তব্য বাতিল করেন। (আবূ ঈসা বলেন), উল্লেখিত দুটি মতের মধ্যে প্রথম মতই অনেক বেশি সহীহ। আবূ সাঈদের হাদীস অনুযায়ী আলিমগণ আমল করেছেন। এই মত সুফিয়ান সাওরী, ইবনুল মুবারাক, শাফিঈ, আহমাদ ও ইসহাকেরও। ইবনুল মুবারাক বলেন, মুদ্রার বিনিময় জায়িয হওয়া প্রসঙ্গে কোন দ্বিমত নেই।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1242,
			"arabicnumber": 1242,
			"text": "১২৪২। ইবনু উমার (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমি বাকী নামক বাজারে উটের ব্যবসা করতাম। আমি কখনও স্বর্ণ মুদ্রার বদলে উট বিক্রয় করতাম কিন্তু দাম নেয়ার সময় রৌপ্যমুদ্রা নিতাম। আবার কখনও রৌপ্য মুদ্রার বদলে তা বিক্রয় করতাম এবং দাম নেয়ার সময় স্বর্ণমুদ্রা নিতাম। আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকটে এসে তাকে হাফসা (রাঃ)-এর ঘর হতে বেরিয়ে আসতে দেখলাম। আমি এ সম্পর্কে তাকে প্রশ্ন করলে তিনি বলেনঃ এরূপ দাম গ্রহণ করায় কোন সমস্যা নেই। যঈফ, ইবনু মাজাহ (২২৬২) আবূ ঈসা বলেন, সিমাক ইবনু হারবের সূত্রেই আমরা এ হাদীসটি মারফু হিসাবে জেনেছি। কিন্তু দাউদ ইবনু আবূ হিন্দ সাঈদ ইবনু জুবাইরের সূত্রে ইবনু উমারের এ হাদীসটি মাওকুফ হিসেবে বর্ণনা করেছেন। একদল বিশেষজ্ঞ আলিম এই হাদীস অনুযায়ী আমল করেছেন। তাদের মতে স্বর্ণ মুদ্রার পরিবর্তে রৌপ্য মুদ্রা অথবা রৌপ্য মুদ্রার পরিবর্তে স্বর্ণ মুদ্রা নিতে কোন সমস্যা নেই। ইমাম আহমাদ ও ইসহাকের এই মত। একদল সাহাবী ও তাবিঈর মতে এরূপ করা মাকরূহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1243,
			"arabicnumber": 1243,
			"text": "১২৪৩। মালিক ইবনু আওস ইবনু হাদসান (রাহঃ) হতে বর্ণিত আছে, তিনি বলেন, আমি এই বলতে বলতে সামনে এগিয়ে গেলাম, কে রূপার মুদ্রা পরিবর্তন করবে? তালহা ইবনু উবাইদুল্লাহ এ সময়ে উমার ইবনুল খাত্তাব (রাঃ)-এর নিকট ছিলেন। তিনি বললেন, তোমার স্বর্ণ আমাদেরকে দেখাও এবং (কিছুক্ষণ) পরে আমাদের কাছে আস। আমাদের খাদিম আসার পরই তোমাকে রূপার মুদ্রা প্রদান করব। উমার ইবনুল খাত্তাব (রাঃ) বললেন, আল্লাহর শপথ! তা কখনও হতে পারে না। হয় এখনই তাকে রূপার মুদ্রা প্রদান কর না হয় তাকে তার স্বর্ণ ফেরত দাও। কেননা, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ স্বর্ণের পরিবর্তে রূপার মুদ্রা নগদ আদান-প্রদান না হলে তা গ্রহণ করা সূদের অন্তর্ভুক্ত। গমের পরিবর্তে গম নগদ আদান-প্রদান না হলে তা সূদের অন্তর্ভুক্ত; যবের পরিবর্তে যবের নগদ বিনিময় না হলে তা সূদের অন্তর্ভুক্ত এবং খেজুরের পরিবর্তে খেজুরের নগদ বিনিময় না হলে সূদ হবে। সহীহ, ইবনু মা-জাহ (২২৫৩), নাসা-ঈ এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। এ হাদীস অনুযায়ী আলিমগণ আমল করেছেন। \"হাআ ওয়া হাআ”-এর অর্থ ‘নগদ ও উপস্থিত বিনিময়’।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1244,
			"arabicnumber": 1244,
			"text": "১২৪৪৷ সালিম (রহঃ) হতে তার পিতার সূত্রে বর্ণিত আছে, তিনি (পিতা) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে আমি বলতে শুনেছিঃ তাবীরের পর কোন লোক খেজুর বাগান কিনলে এর ফলের মালিক হবে বিক্রেতা, যদি ক্রয়কারীর জন্য (মালিকানা) শর্ত করা না হয়। যদি কোন লোক সম্পদশালী গোলাম কিনে তবে ঐ সম্পদের অধিকারী হবে বিক্রেতা, ক্রেতার জন্য ঐ সম্পদের যদি কোনরূপ শর্ত করা না হয়। সহীহ, ইবনু মা-জাহ (২২১০, ২২১২), নাসা-ঈ জাবির (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। ইবনু উমার (রাঃ) হতে বর্ণিত হাদীসটি হাসান সহীহ। একইভাবে একাধিক সূত্রে যুহরী হতে, তিনি সালিমের সূত্রে, তিনি ইবনু উমারের সূত্রে বর্ণনা করেছেন, রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেনঃ কোন লোক তাবীরের পর খেজুর গাছ কিনলে বিক্রেতাই তার ফল ভোগ করবে, যদি ক্রয়কারী এর মালিকানার কোন শর্ত না করে থাকে। একইভাবে কোন লোক যদি সম্পদশালী গোলাম কিনে তবে বিক্রেতা তার সম্পদের অধিকারী হবে, যদি ক্রেতার জন্য কোন শর্ত নির্ধারণ করা না হয়। ইবনু উমার (রাঃ)-এর সূত্রে নাফি (রাঃ) বর্ণনা করেছেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তাবীরের কাজ পূর্ণ হওয়ার পর কোন শর্ত করা হলে তা সে পাবে। নাফি হতে ইবনু উমারের সূত্রে বর্ণিত আছে, তিনি উমার হতে বর্ণনা করেছেন, তিনি বলেছেন, যদি কোন লোক সম্পদশালী গোলাম কিনে তবে বিক্রেতাই এই সম্পদের মালিক হবে, কিন্তু ক্রেতার জন্য শর্ত করা হলে তা সে পাবে। একইরকম হাদীস আরো কয়েকটি সূত্রে বর্ণিত আছে। এ হাদীস অনুযায়ী একদল আলিম আমল করেছেন। একই কথা বলেছেন ইমাম শাফিঈ, আহমাদ ও ইসহাকও। ইমাম বুখারী বলেছেন, সালিমের সূত্রে যুহরী হতে বর্ণিত ইবনু উমারের হাদীসটি এ অনুচ্ছেদে সর্বাধিক সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1245,
			"arabicnumber": 1245,
			"text": "১২৪৫। ইবনু উমার (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে বলতে শুনেছিঃ ক্রেতা ও বিক্রেতা একে অপর হতে আলাদা না হওয়া পর্যন্ত অথবা উভয়ে ক্রয়-বিক্রয় সম্পন্ন করতে সম্মত না হওয়া পর্যন্ত তাদের জন্য ক্রয়-বিক্রয় বাতিল করার স্বাধীনতা বজায় থাকে। বর্ণনাকারী বলেন, বসে থাকাবস্থায় ইবনু উমার (রাঃ) কোন জিনিস কিনলে (তা নির্ধারিত করার জন্য) উঠে দাড়িয়ে যেতেন। সহীহ, ইবনু মা-জাহ (২১৮১), নাসা-ঈ আবূ হুরাইরা ও ই বনু আব্বাস (রাঃ) তেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। ইবনু উমর (রাঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। এ হাদীস অনুযায়ী একদল সাহাবী ও তাবিঈ আমল করেছেন। এই মত প্রকাশ করেছেন ইমাম শাফিঈ, আহমাদ ও ইসহাকও। তারা বলেন, একে অপর হতে আলাদা হওয়ার অর্থ হচ্ছেঃ সশরীরে আলাদা হওয়া, বাক্যালাপ বন্ধ করা নয়। অপর একদল আলিম বলেছেন, আলাদা হওয়ার অর্থ হচ্ছে কথাবার্তা বন্ধ হওয়া (অর্থাৎ চুক্তি অনুষ্ঠিত হলে এবং আলোচনার প্রসঙ্গ পরিবর্তিত হলে স্বাধীনতা বজায় থাকবে না)। কিন্তু প্রথম মতই অধিকতর সহীহ। কেননা, এ হাদীসের বর্ণনাকারী ইবনু উমার (রাঃ)। এজন্য তিনিই এ হাদীসের মর্ম বেশি ভাল বুঝতে পেরেছেন। তার প্রসঙ্গে বর্ণিত আছে যে, তিনি ক্রয়-বিক্রয় বাধ্যতামূলক করতে চাইলে উঠে দাঁড়িয়ে যেতেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1246,
			"arabicnumber": 1246,
			"text": "১২৪৬। হাকীম ইবনু হিযাম (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ক্রেতা-বিক্রেতা একে অপর হতে আলাদা না হওয়া পর্যন্ত উভয়ের জন্য (ক্রয়-বিক্রয় বাতিল করার) স্বাধীনতা বজায় থাকে। যদি তারা দুজনেই সততা অবলম্বন করে এবং পণ্যের দোষ-ত্রুটি প্রকাশ করে তবে তাদের এই লেন-দেনে বারকাত হয়। যদি তারা মিথ্যার আশ্রয় গ্রহণ করে এবং দোষ-ত্রুটিগুলো গোপন করে রাখে তবে তাদের ক্রয়-বিক্রয়ের বারকাত তুলে নেয়া হয়। সহীহ, ইরওয়া (১২৮১), বেচা-কেনার হাদীস, নাসা-ঈ এ হাদীসটি সহীহ। আবূ বারযা আসলামী (রাঃ) হতেও একইভাবে বর্ণিত আছে যে, নৌকায় বসে দুটি লোক একটি ঘোড়া কেনা-বেচা করল। এরপর দুজনের মধ্যে ঝগড়া সৃষ্টি হলে তারা আবূ বারযা (রাঃ)-এর নিকট এর সমাধান চায়। তখন তিনিও নৌকায় ছিলেন। তিনি বললেন, আমি তোমাদের দুজনকে একে অপর হতে আলাদা হতে দেখি না। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ \"ক্রেতা ও বিক্রেতা একে অপরে আলাদা না হওয়া পর্যন্ত উভয়ের বেচা-কেনা বাতিল করার স্বাধীনতা বজায় থাকে৷” কূফার আলিমগণ বলেন, আলাদা হওয়ার অর্থ কথাবার্তা হতে আলাদা হওয়া। সুফিয়ান সাওরীরও এই মত। একইরকম মত ইমাম মালিক হতেও বর্ণিত হয়েছে। ইবনুল মুবারাক বলেন, এ হাদীসের দলীল (সশরীরে পৃথক হওয়ার) আমি কিভাবে খণ্ডন করতে পারি? অথচ এ হাদীস সহীহ সনদে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত হয়েছে যা এই মতকেই মজবুত করে। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের বাণীঃ স্বাধীনতামূলক ক্রয়-বিক্রয়ের অর্থ হলঃ ক্রয়-বিক্রয় বাধ্যতামূলক হওয়ার পরও যদি বিক্রেতা ক্রেতাকে তা বাতিলের স্বাধীনতা প্রদান করে কিন্তু ক্রেতা তারপরও তা ক্রয় ঠিক রাখে, তারপর উভয়ে পৃথক না হলেও ক্রয়-বিক্রয় বাতিল করার স্বাধীনতা আর থাকে না। এ হাদীসের ব্যাখ্যা ইমাম শাফিঈ ও অন্যান্যরা এরূপই করেছেন। কিন্তু ইবনু উমারের হাদীস দ্বারা সশরীরে পৃথক হওয়ার মতটি প্রমাণিত হয়।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1247,
			"arabicnumber": 1247,
			"text": "১২৪৭। আমর ইবনু শুআইব (রহঃ) হতে পর্যায়ক্রমে তার পিতা ও দাদার সূত্রে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ক্রেতা ও বিক্রেতা উভয়ে একে অপর হতে আলাদা না হওয়া পর্যন্ত তাদের জন্য (ক্রয়-বিক্রয় প্রত্যাখ্যানে) স্বাধীনতা বজায় থাকে, কিন্তু স্বাধীনতামূলক বেচা-কেনা হলে (আলাদা হওয়ার পরও স্বাধীনতা বজায় থাকে)। দুজনের মধ্যে যে কোন একজন ক্রয় বা বিক্রয় প্রত্যাখ্যান করতে পারে, এই ভয়ে তাড়াতাড়ি আলাদা হওয়াও বৈধ নয়। হাসান সহীহ, ইরওয়া (১৩১১) এ হাদীসটিকে আবৃ ঈসা হাসান বলেছেন। এ হাদীসের তাৎপর্য হলঃ কোন জিনিস বিক্রয়ের পর ক্রেতা বা বিক্রেতা তা ফেরত দিতে বা নিতে পারে-এই ভয়ে তাড়াতাড়ি করে আলাদা হওয়া উচিত নয়। যদি কথার দ্বারা পৃথক হওয়া নির্ধারিত হত এবং বিক্রয়ের পর স্বাধীনতা না থাকত, তাহলে “ক্রয়-বিক্রয় বাতিলের ভয়ে তাড়াতাড়ি আলাদা হয়ে যাওয়া বৈধ নয়।” এ হাদীসের কোন অর্থই হত না।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1248,
			"arabicnumber": 1248,
			"text": "১২৪৮। আবূ হুরায়রা (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ক্রেতা ও বিক্রেতা ক্রয়-বিক্রয়ের পর দুজনেই একে অপরের সন্তুষ্টি ছাড়া আলাদা হবে না। - হাসান সহীহ, ইরওয়া (৫/১২৫, ১২৬) এ হাদীসটিকে আবূ ঈসা গরীব বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1249,
			"arabicnumber": 1249,
			"text": "১২৪৯। জাবির (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক বেদুইনকে বিক্রয় সম্পন্ন হওয়ার পরেও তা বাতিলের স্বাধীনতা প্রদান করেছিলেন। হাসান, বেচা-কেনার হাদীস",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 1250,
			"arabicnumber": 1250,
			"text": "১২৫০। আনাস (রাঃ) হতে বর্ণিত আছে, ক্রয়-বিক্রয়ের ক্ষেত্রে এক ব্যক্তি খুবই দুর্বল ছিল। সে ক্রয়-বিক্রয় করত (কিন্তু ঠকে যেত)। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের কাছে এসে তার পরিবারের লোকেরা বলল, হে আল্লাহর রাসূল! তাকে ক্রয়-বিক্রয় হতে বিরত থাকতে বলুন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে ডেকে ক্রয়-বিক্রয় করতে নিষেধ করলেন। সে বলল, হে আল্লাহর রাসূল! ক্রয়-বিক্রয় হতে বিরত থাকার কাজটি আমার ধৈর্যের উদ্ধে। তিনি বললেনঃ যখন তুমি ক্রয়-বিক্রয় করবে তখন বলবে, নগদ লেন-দেন হবে এবং যেন প্রতারণা না করা হয়। সহীহ, ইবনু মা-জাহ (২৩৫৪), নাসা-ঈ আবূ ঈসা বলেন, ইবনু উমার (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আনাস (রাঃ) হতে বর্ণিত হাদীসটি হাসান সহীহ গারীব। এ হাদীস অনুযায়ী একদল আলিম আমল করেছেন। তারা বলেন, দুর্বল জ্ঞানের অধিকারী লোক স্বাধীন হলেও তাকে ক্রয়-বিক্রয় হতে বিরত রাখা উচিত। এই মত ইমাম আহমাদ ও ইসহাকের। অন্য একদল আলিমের মতে, প্রাপ্তবয়স্ক স্বাধীন লোকের উপর (আর্থিক লেন-দেনে) প্রতিবন্ধকতা (হাজর) আরোপ করা উচিত নয়।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 1251,
			"arabicnumber": 1251,
			"text": "১২৫১। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ (দুধ জমা করে) স্তন ফুলানো পশু যদি কোন ব্যক্তি কিনে তবে তার জন্য (ক্রয় বাতিল করার) স্বাধীনতা আছে। সে চাইলে দুধ দোহনের পর তা ফেরত দিতে পারবে। তবে তাকে এর সাথে এক সা খেজুরও দিতে হবে। সহীহ, ইবনু মা-জাহ (২২৩৯), নাসা-ঈ আবূ ঈসা বলেন, আনাস (রাঃ) এবং আরও একজন সাহাবী হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 1252,
			"arabicnumber": 1252,
			"text": "১২৫২। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ স্তনে দুধ জমা করে রাখা পশুকে যদি কোন লোক কিনে তবে সে (ক্রয় বাতিলের জন্য) তিন দিনের স্বাধীনতা পাবে। সে তা ফেরত দিলে এর সাথে গম ব্যতীত এক সা' খাদ্যদ্রব্যও প্রদান করবে। সহীহ, প্রাগুক্ত, মুসলিম এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। আমাদের সার্থীদের মতে এ হাদীস অনুযায়ী আমল করতে হবে। তাদের অন্তর্ভুক্ত আছেন ইমাম শাফিঈ, আহমাদ ও ইসহাক। “লা সামরা\" অর্থঃ ‘গম ব্যতীত অন্য কিছু।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 1253,
			"arabicnumber": 1253,
			"text": "১২৫৩। জাবির ইবনু আবদুল্লাহ (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট তিনি একটি উট বিক্রয় করেন এবং শর্ত রাখেন এর পিঠে আরোহণ করে বাড়ী পর্যন্ত পৌছানোর। সহীহ, ইবনু মা-জাহ (২২০৫), নাসা-ঈ এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। জাবির (রাঃ) হতে বিভিন্ন সূত্রে উল্লেখিত হাদীসটি বর্ণিত হয়েছে। এ হাদীস অনুযায়ী একদল সাহাবী ও তাবিঈ আমল করেছেন। তাদের মতে, একটিমাত্র শর্ত ক্রয়-বিক্রয়ের মধ্যে অন্তর্ভুক্ত হলে তা জায়িয। এই মত দিয়েছেন ইমাম আহমাদ ও ইসহাকও। অন্য একদল আলিম বলেন, ক্রয়-বিক্রয়ের সাথে শর্তারোপ করা জায়িয নয়। শর্ত আরোপ করলে এ ধরণের ক্রয়-বিক্রয় জায়িয হবে না।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 1254,
			"arabicnumber": 1254,
			"text": "১২৫৪। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ বাহনের পশুকে বন্ধক রাখা হলে তার পিঠে আরোহণ করা যাবে। দুগ্ধবতী পশুকে বন্ধক রাখা হলে তার দুধ পান করা যাবে। যে লোক আরোহণ করবে এবং দুধ পান করবে তাকে পশুর খরচও প্রদান করতে হবে। সহীহ, ইবনু মা-জাহ (২৪৪০), বুখারী এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। আমরা এ হাদীসটিকে কেবল আমিরের সূত্রেই আবূ হুরাইরা (রাঃ) হতে মারফুভাবে জেনেছি। এটিকে আবূ হুরাইরা (রাঃ)-এর সূত্রে একাধিক বর্ণনাকারী আবৃ সালিহ (রাহঃ) হতে মাওকৃফভাবে বর্ণনা করেছেন। এ হাদীস অনুযায়ী একদল আলিম আমল করেছেন। এই মত দিয়েছেন ইমাম আহমাদ ও ইসহাকও। অপর একদল আলিমের মতে, বন্ধক রাখা জিনিস ব্যবহার করা জায়িয নয়।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 1255,
			"arabicnumber": 1255,
			"text": "১২৫৫। ফাযালা ইবনু উবাইদ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমি খাইবারের যুদ্ধের সময় বার দীনারে একটি মালা ক্রয় করলাম। এতে স্বর্ণ ও পুতির দানা মিশানো ছিল। আমি এগুলোকে আলাদা করে বার দীনারের বেশি পরিমাণ স্বর্ণ পেলাম। আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট এটা উল্লেখ করলে তিনি বললেনঃ তা বিক্রয় করা যাবে না যতক্ষণ না তা আলাদা করা হবে। সহীহ, বেচা-কেনার হাদীস, মুসলিম। এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। ইবনুল মুবারকও উল্লিখিত সনদে অনুরূপ হাদীস বর্ণনা করেছেন। এ হাদীস অনুযায়ী একদল সাহাবী ও অপরাপর আলিম আমল করেছেন। তাদের মতে রূপার কারুকার্য খচিত তরবারি, কোমরবন্ধ, তরবারির খাপ ইত্যাদি দিরহামের বিনিময়ে ক্রয়-বিক্রয় করতে হলে এর সাথে রূপা পৃথক করে নিতে হবে। এই মত দিয়েছেন ইবনুল মুবারাক, শাফিঈ, আহমাদ ও ইসহাকও। অন্য একদল সাহাবী ও অপরাপর আলিম এগুলো আলাদা না করেই তা ক্রয়-বিক্রয়ের সম্মতি দিয়েছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 1256,
			"arabicnumber": 1256,
			"text": "১২৫৬। আইশা (রাঃ) হতে বর্ণিত আছে, তিনি বারীরা নামী গোলামকে কিনতে চাইলেন, কিন্তু মালিক পক্ষ ওয়ালার শর্ত আরোপ করল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তুমি তাকে কিনতে পার। কেননা, যে লোক মূল্য পরিশোধ করে অথবা এর মালিক হয় সেই ওয়ালার অধিকারী হয়। সহীহ, ইবনু মা-জাহ (২৫২১), নাসা-ঈ ইবনু উমার (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আইশা (রাঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। এ হাদীস অনুযায়ী বিশেষজ্ঞ আলিমগণ আমল করেছেন। ইয়াহইয়া ইবনু সাঈদ বলেন, যখন তোমার নিকট মানসূরের সূত্রে বর্ণনা করা হয় তখন তুমি মনে করবে যে, তুমি তোমার হাত কল্যাণে পরিপূর্ণ করলে। আমি ইবরাহীম নাখঈ ও মুজাহিদ হতে রিওয়ায়াতের ক্ষেত্রে মানসূরের তুলনায় বেশি আস্থাভাজন অন্য কাউকে পাইনি। আবদুর রাহমান ইবনু মাহদী বলেন, কূফাবাসীদের মধ্যে মানসূর সর্বাধিক নির্ভরযোগ্য লোক।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 1257,
			"arabicnumber": 1257,
			"text": "১২৫৭। হাকীম ইবনু হিযাম (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিজের জন্য এক দীনারে একটি কুরবানীর পশু কেনার উদ্দেশ্যে তাকে (বাজারে) পাঠান। তিনি (এক দীনারে) একটি পশু কিনে (তা আবার বিক্রয় করে) এক দীনার লাভ করেন। এর পরিবর্তে তিনি আর একটি পশু কিনেন। তারপর তিনি একটি পশু ও একটি দীনারসহ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকটে চলে আসেন। তিনি বললেনঃ বকরীটা কুরবানী কর এবং দীনারটি দান-খাইরাত কর। যঈফ, বেচা-কেনার হাদীস অধ্যায়। আবূ ঈসা বলেন, হাকীম ইবনু হিযামের হাদীসটি আমরা শুধু উল্লেখিত সূত্রেই জেনেছি। আমার মতে হাকীম ইবনু হিযাম (রাঃ)-এর নিকট হতে হাবীব ইবনু আবূ সাবিত কিছু শুনেননি।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 1258,
			"arabicnumber": 1258,
			"text": "১২৫৮। উরওয়া আল-বারিকী (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে তার নিজের জন্য একটি ছাগল কেনার উদ্দেশ্যে একটি দীনার প্রদান করলেন। আমি তার জন্য দু'টি ছাগল, কিনলাম। আমি এর মধ্য হতে একটিকে এক দীনারের বিনিময়ে বিক্রয় করে দিলাম। তারপর আমি একটি ছাগল ও একটি দীনারসহ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট এলাম। (অধঃস্তন বর্ণনাকারী বলেন) তিনি তাকে পুরো ঘটনা বর্ণনা করে শুনালেন। তিনি বললেনঃ আল্লাহ তোমার ডান হাতের ব্যবসায়ে বারকাত দান করুন। তিনি কূফার অদূরে কুনাসা নামক জায়গায় চলে যান এবং ব্যবসায়ে অনেক মুনাফা অর্জন করেন। ফলে তিনি কূফার সম্পদশালী লোকে পরিণত হন। সহীহ, বেচা-কেনার হাদীস উপরোক্ত হাদীসের মত আবূ লাবীদের সূত্রেও বর্ণিত আছে। এ হাদীস অনুযায়ী একদল আলিম মত দিয়েছেন। একই কথা বলেছেন ইমাম আহমাদ ও ইসহাকও। এ হাদীস অনুযায়ী অন্য একদল আলিম মত গ্রহণ করেননি। তাদের মধ্যে ইমাম শাফিঈ অন্যতম। সাঈদ ইবনু যাইদ হাম্মাদ ইবনু যাইদের ভাই, আবূ লাবীদের নাম লিমাযাহ পিতার নাম যাব্বার।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 1259,
			"arabicnumber": 1259,
			"text": "১২৫৯। ইবনু আব্বাস (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মুকাতাব গোলামের দিয়াত বা ওয়ারিসী স্বত্ব পাওয়ার সুযোগ এলে সে যতটুকু পরিমাণ মুক্ত হয়েছে ততটুকু অংশ পরিমাণ মালিক হবে। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আরও বলেছেনঃ মুকাতাব গোলামের যতটুকু অংশ মুক্ত তাকে ততটুকু মুক্তির সমান দিয়াত প্রদান করতে হবে এবং বাকীগুলোর জন্য গোলামের সমান পরিমাণ দিয়াত প্রদান করতে হবে। সহীহ, ইরওয়া (১৭২৬) উম্মু সালামা (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। ইবনু আব্বাস (রাঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা হাসান বলেছেন। ইয়াহইয়া ইবনু কাছীর ও ইকরিমা হতে, তিনি ইবনু আব্বাস হতে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে উপরোক্ত হাদীসের মতই বর্ণনা করেছেন। ইকরামার সূত্রে আলী (রাঃ)-এর বক্তব্য হিসাবেও এটাকে খালিদ আল-হাযযা বর্ণনা করেছেন। এ হাদীস অনুযায়ী একদল সাহাবী ও তাবিঈ আমল করেছেন। কিন্তু বেশিরভাগ বিশেষজ্ঞ সাহাবী ও তাবিঈ বলেন, মুকাতাব গোলামের চুক্তিকৃত টাকার মধ্যে এক দিরহাম অনাদায়ী থাকলেও সে গোলামই গণ্য হবে (এবং গোলামের সমান আইনগত সুযোগ-সুবিধা পাবে)। এই মত দিয়েছেন সুফিয়ান সাওরী, শাফিঈ, আহমাদ ও ইসহাক।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 1260,
			"arabicnumber": 1260,
			"text": "১২৬০। আমর ইবনু শুআইব (রাহঃ) হতে পর্যায়ক্রমে তার পিতা ও দাদার সূত্রে বর্ণিত আছে, তিনি (দাদা) বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে তার এক বক্তৃতায় বলতে শুনেছিঃ একশত উকিয়া প্রদানের শর্তে কোন লোক তার গোলামকে মুক্তির চুক্তিপত্র প্রদান করল। সে চুক্তির মূল্য পরিশোধ করতে থাকল। কিন্তু দশ উকিয়া বা দশ দিরহাম পরিমাণ পরিশোধ করতে সে অসমর্থ হয়ে পড়ল। এরকম পরিস্থিতিতে সে গোলামই রয়ে যাবে। - হাসান, ইবনু মা-জাহ (২৫১৯) এ হাদীসটিকে আবূ ঈসা হাসান গারীব বলেছেন। এ হাদীস অনুযায়ী বেশিরভাগ বিশেষজ্ঞ সাহাবী ও তাবিঈ আমল করেছেন। তাদের মতে, মুকাতাব গোলাম গোলামই রয়ে যাবে চুক্তিকৃত পরিমাণ টাকার অল্প পরিমাণ বাকী থাকলেও। হাজ্জাজ ইবনু আরতাত ও আমর ইবনু শুআইব হতে অনুরূপ হাদীস বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 1261,
			"arabicnumber": 1261,
			"text": "১২৬১। উম্মু সালামাহ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের কোন মহিলার মুকাতাব ক্রীতদাসের নিকটে নিজেকে স্বাধীন করার মত সম্পদ থাকলে সে যেন তার থেকে পর্দা করে। যঈফ, ইবনু মাজাহ (২৫২০) আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। বিশেষজ্ঞ আলিমদের মতে এ হাদীসের মর্মার্থ হলঃ তাকওয়া ও পরহিযগারী হাসিলের জন্য সতর্কতামূলক ব্যবস্থা হিসেবে পর্দা করা কর্তব্য। তারা বলেন, মুকাতাব ক্রীতদাসের নিকটে নিজেকে মুক্ত করার মত সম্পদ থাকলে সে ক্রীতদাস হিসেবেই বিবেচিত। চুক্তি অনুযায়ী সকল দেনা মিটিয়ে দেবার পরই সে মুক্ত বলে বিবেচিত হবে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 1262,
			"arabicnumber": 1262,
			"text": "১২৬২। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন লোক দেউলিয়া (মুফলিস) বলে ঘোষিত হওয়ার পরেও কোন ব্যক্তি নিজের মাল পূর্বাবস্থায় তার নিকট পেয়ে গেলে সে তাতে অন্য লোকদের চেয়ে বেশি অগ্রাধিকার পাবে। সহীহ, ইবনু মা-জাহ (২৩৫৮), নাসা-ঈ সামুরা ও ইবনু উমার (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ হুরাইরা (রাঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। এ হাদীস অনুযায়ী একদল আলিম আমল করেছেন। একথা বলেছেন ইমাম শাফিঈ, আহমাদ ও ইসহাকও। অন্য একদল আলিম বলেছেন, দেউলিয়াত্ব লোকের নিকট কোন ব্যক্তি তার মাল পূর্বাবস্থায় পেলেও তাকে তা অন্যান্য পাওনাদারদের সাথে সমান ভাগে ভাগ করে নিতে হবে। কূফাবাসী আলিমদের এই অভিমত।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 1263,
			"arabicnumber": 1263,
			"text": "১২৬৩। আবূ সাঈদ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমাদের নিকট এক ইয়াতীম বালকের শারাব ছিল। সূরা মাইদা (৯০-৯১ আয়াত) অবতীর্ণ হলে আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট এ ব্যাপারে জানতে চেয়ে বললাম, এই মদ এক ইয়াতীম বালকের। তিনি বললেনঃ এগুলো ঢেলে ফেলে দাও। সহীহ, মিশকাত তাহকীক ছানী (৩৬৪৮), পরবর্তী (১৩১৬) নং হাদীসটি এই হাদীসের সহায়ক। আবূ ঈসা বলেন, আনাস ইবনু মালিক (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ সাঈদ (রাঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। এ হাদীসটি একাধিক সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়সাল্লাম হতে বর্ণিত হয়েছে। এ হাদীস অনুযায়ী একদল আলিম মত দিয়েছেন। শারাবকে সিরকাতে পরিবর্তন করাকে তারা মাকরুহ বলেছেন। প্রকৃতপক্ষে মাকরূহ মনে করার কারণ হলঃ শারাব থেকে সিরকা তৈরীর উদ্দেশ্যে একজন মুসলিমের ঘরে শরাব থাকাটা আপত্তিকর মনে হয়। আল্লাহ তা'আলাই অধিক ভালো জানেন। শারাব যদি সিরকা অবস্থায় পাওয়া যায় তবে একদল আলিমের মতে এই সিরকা ব্যবহার করা জায়িয। আবূল ওয়াদাকের নাম জুবর পিতা নাওফ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 1264,
			"arabicnumber": 1264,
			"text": "১২৬৪। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমার নিকট যে লোক কোন কিছু আমানাত রেখেছে তাকে তা ফিরিয়ে দাও। যে লোক তোমার খিয়ানাত করেছে তুমি তার খিয়ানাত (ক্ষতিসাধন) কর না। সহীহ, মিশকাত (২৯৩৪), সহীহা (৪২৩০), রাওযুন নায়ীর (১৬) এ হাদীসটিকে আবূ ঈসা হাসান গারীব বলেছেন। এ হাদীস অনুযায়ী একদল আলিম মত দিয়েছেন। তারা বলেছেন, এক লোক নিজের কিছু আমানাত রাখল অন্য লোকের নিকট, কিন্তু সে তা ফিরত দিল না। ঘটনাচক্রে প্রথমোক্ত ব্যক্তির হাতে শেষোক্ত ব্যক্তির কোন মাল এসে পড়লো। এক্ষেত্রে সে লোক যে পরিমাণ সম্পদ প্রথমোক্ত ব্যক্তি হতে আত্মসাৎ করেছিল, সেই সম্পদ হতে প্রথমোক্ত ব্যক্তি তার পাওনা পরিমাণ কেটে রাখতে পারবে না, কিন্তু কিছু তাবিঈ কেটে রাখার সম্মতি দিয়েছেন। সুফিয়ান সাওরীও এই মত দিয়েছেন। তিনি বলেছেন, এক লোক কিছু দিরহাম রাখল অন্য লোকের নিকট। সে তা আত্মসাৎ করল। ঘটনাচক্রে প্রথমোক্ত ব্যক্তির হাতে শেষোক্ত ব্যক্তির কিছু দীনার এসে পড়ল। এক্ষেত্রে প্রথমোক্ত ব্যক্তি তার দিরহামের পরিবর্তে দীনার রাখতে পারবে না। হ্যাঁ ঐ ব্যক্তির দিরহাম যদি তার হাতে আসে তাহলে সে তার দিরহামের সমপরিমাণ দিরহাম কেটে রাখতে পারবে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 1265,
			"arabicnumber": 1265,
			"text": "১২৬৫। আবূ উমামা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, নবীসাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে আমি তার বিদায় হাজ্জের বক্তৃতায় বলতে শুনেছিঃ ধার করা বস্তু ফেরত দিতে হবে, যামিনদার, পাওনা পরিশোধ করার দায় বহন করবে এবং ঋণ পরিশোধ করতে হবে। সহীহ, ইবনু মা-জাহ (২৩৯৮) সামুরা, সাফওয়ান ইবনু উমাইয়্যা ও আনাস (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ উমামা (রাঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা হাসান গারীব বলেছেন। এ হাদীসটি একাধিক সূত্রে আবূ উমামা (রাঃ) হতে বর্ণিত হয়েছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 1266,
			"arabicnumber": 1266,
			"text": "১২৬৬। সামুরা (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন ব্যক্তি যা গ্রহণ করেছে তা ফিরিয়ে না দেয়া পর্যন্ত এর জন্য সে দায়বদ্ধ থাকবে। কাতাদা বলেন, পরবর্তীতে হাসান এ হাদীস ভুলে যান। ফলে তিনি বলেছেন, সে তোমার আমানাতদার, তার উপর এর ক্ষতিপূরণ আরোপ করা হবে না অর্থাৎ তা আরিয়া। যঈফ, ইবনু মাজাহ (২৪০০) আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। একদল বিশেষজ্ঞ সাহাবী ও তাবিঈ এ হাদীস অনুসারে মত দিয়েছেন। অর্থাৎ কর্জ গ্রহণকারীকে ক্ষতিপূরণ দিতে হবে। শাফিঈ ও আহমাদের এই মত। অপর একদল সাহাবী ও তাবিঈ বলেছেন, কর্জ গ্রহণকারীকে ক্ষতিপূরণ দিতে হবে না, কিন্তু আমানাতদাতার কথার খিলাপ করলে ক্ষতিপুরণ দিতে হবে। সুফিয়ান সাওরী ও কূফাবাসী আলিমদের এই মত। ইসহাকও এই মত দিয়েছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 1267,
			"arabicnumber": 1267,
			"text": "১২৬৭। মামার ইবনু আবদুল্লাহ ইবনু নাযলাহ্ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে বলতে শুনেছিঃ “শুধুমাত্র দুর্নীতিপরায়ণ মানুষই মজুতদারি করে থাকে।” আমি (মুহাম্মাদ ইবনু ইবরাহীম) সাঈদকে বললাম, হে মুহাম্মাদের পিতা! আপনিও তো মজুতদারি করে থাকেন। তিনি বললেন, মজুতদারি তো মা’মারও করতেন। সহীহ, ইবনু মা-জাহ (২১৫৪), মুসলিম আবূ ঈসা বলেন, সাঈদ ইবনুল মুসাইয়্যিব প্রসঙ্গে বর্ণিত আছে যে, তিনি তেল, গম ও এই জাতীয় জিনিস মজুত করতেন। উমার, আলী, আবূ উমামা ও ইবনু উমর (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। মামার (রাঃ) বর্ণিত হাদীসটি হাসান সহীহ। এ হাদীস মোতাবিক আলিমগণ আমল করেছেন। খাদ্যদ্রব্যের মজুতদারি করাকে তারা মাকরূহ বলেছেন। খাদ্যদ্রব্য ব্যতীত অন্য কিছুর মজুতদারি করার পক্ষে কিছু সংখ্যক আলিম অনুমতি দিয়েছেন। ইবনুল মুবারাক বলেছেন, তুলা, ছাগলের চামড়া বা ঐ ধরণের অন্য কিছুর মজুতদারি করাতে কোন সমস্যা নেই।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 1268,
			"arabicnumber": 1268,
			"text": "১২৬৮। ইবনু আব্বাস (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ বাজারের বাইরে গিয়ে পণ্যদ্রব্য আনিত বণিকদলের সাথে মিলিত হবে না, পশুর স্তনে দুধ জমিয়ে রাখবে না এবং দাম বৃদ্ধি করে একজন অন্যজনের পণ্য বিক্রয় করে দেওয়ার অপকৌশল অবলম্বন করবে না। হাসান, বেচা-কেনার হাদীস। আবূ ঈসা বলেন, ইবনু মাসউদ ও আবূ হুরাইরা (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। ইবনু আব্বাস (রাঃ) হতে বর্ণিত হাদীসটি হাসান সহীহ। এ হাদীস মোতাবিক আলিমগণ আমল করেছেন। তাদের মতে কয়েক দিনের দুধ পশুর স্তনে জমিয়ে স্তন ফুলিয়ে তা বিক্রয় করা মাকরুহ। এতে ক্রেতা ধোকার মধ্যে পড়ে যায়। এটাও এক ধরণের প্রতারনা ও ধোঁকাবাজি।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 1269,
			"arabicnumber": 1269,
			"text": "১২৬৯ ৷ আবদুল্লাহ ইবনু মাসউদ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মিথ্যা শপথের মাধ্যমে যদি কোন লোক কোন মুসলিমের ধন-সম্পদ আত্মসাৎ করে তবে সে এরূপ অবস্থায় আল্লাহ্ তা'আলার সামনে উপস্থিত হবে যে, তিনি তার প্রতি খুবই অসন্তুষ্ট থাকবেন। আশআস ইবনু কাইস (রাঃ) বলেন, আল্লাহর শপথ! তিনি এ হাদীসটি আমার সম্পর্কে বলেছেন। আমার ও এক ইয়াহদীর মধ্যে একটি শরীকানা জমি ছিল। কিন্তু সে আমার অংশ দিতে অস্বীকার করে বসে। আমি তাকে নিয়ে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট আসি। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে বললেনঃ তোমার সাক্ষীপ্রমাণ আছে কি? আমি বললাম, না। তিনি ইয়াহুদীকে বললেনঃ শপথ কর। আমি বললাম, হে আল্লাহর রাসূল! এ তো শপথ করবেই এবং আমার সম্পদ আত্মসাৎ করবে। আল্লাহ তা'আলা তখন এ আয়াত অবতীর্ণ করেনঃ “যারা আল্লাহ তা'আলার সাথে কৃত প্রতিশ্রুতি এবং নিজেদের শপথসমূহ সামান্য স্বার্থের বিনিময়ে বিক্রয় করে, আখিরাতে তাদের জন্য কোন অংশ নেই। কিয়ামতের দিন আল্লাহ তা'আলা না তাদের সাথে কথা বলবেন, না তাদের প্রতি তাকাবেন আর না তাদেরকে পবিত্র করবেন। তাদের জন্য রয়েছে কঠিন যন্ত্রণাদায়ক শাস্তি\" (সূরাঃ আলে-ইমরান - ৭৭)। সহীহ, ইবনু মা-জাহ (২৩২৩), নাসা-ঈ আবূ ঈসা বলেন, এ অনুচ্ছেদে ওয়াইল ইবনু হুজর, আবূ মূসা, আবূ উমামা ও ইমরান ইবনু হুসাইন (রাঃ) হতেও হাদীস বর্ণিত আছে। ইবনু মাসউদ (রাঃ) হতে বর্ণিত হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 1270,
			"arabicnumber": 1270,
			"text": "১২৭০। ইবনু মাসউদ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ক্রয়কারী ও বিক্রয়কারীদের মধ্যে মত পার্থক্য হলে বিক্রেতার মতই বেশি প্রাধান্য পাবে, তবে ক্রয়কারীর ক্রয় বাতিলের স্বাধীনতা থাকবে। সহীহ, ইরওয়া (১৩২২, ১৩২৪), বেচা-কেনার হাদীস এ হাদীসটিকে আবূ ঈসা মুরসাল বলেছেন। ইবনু মাসউদ (রাঃ)-এর সাথে কখনও আওন ইবনু আবদুল্লাহর সাক্ষাৎ ঘটেনি ইবনু মাসউদ (রাঃ)-এর এ হাদীসটি কাসিম ইবনু আবদুর রাহমানও ইবনু মাসউদ হতে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেছেন। এ বর্ণনাটিও মুরসাল। ইসহাক ইবনু মানসূর বলেন, আমি ইমাম আহমাদকে প্রশ্ন করলাম, ক্রয়কারী ও বিক্রয়কারী একে অপরের সাথে ঝগড়ায় জড়িয়ে পড়লে এবং কোন সাক্ষী না থাকলে কি করতে হবে? তিনি বললেন, বিক্রেতার মতই বেশি প্রাধান্য পাবে অথবা দুজনই ক্রয়-বিক্রয় বাতিল করবে। ইমাম ইসহাক কিছুটা এভাবে বলেছেন, যার মতকে বিনা প্রমাণে গ্রহণ করা হবে তাকে শপথ করাতে হবে। কিছু সংখ্যক তাবিঈও একইরকম কথা বলেছেন। শুরাইহ (রাহঃ) তাদের অন্যতম।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 1271,
			"arabicnumber": 1271,
			"text": "১২৭১। ইয়াস ইবনু আবদ আল-মুযানী (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পানি বিক্রয় করতে নিষেধ করেছেন। সহীহ, ইবনু মা-জাহ (২৪৭৬) জাবির, বুহাইসা (তার পিতার সূত্রে), আবূ হুরাইরা, আইশ, আনাস ও আবদুল্লাহ ইবনু উমার (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। ইয়াস (রাঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। এ হাদীস অনুযায়ী বেশিরভাগ আলিম আমল করার পক্ষে সম্মতি দিয়েছেন। পানি বিক্রয়কে তারা মাকরূহ বলেছেন। এই মত দিয়েছেন ইবনুল মুবারাক, শাফিঈ, আহমাদ ও ইসহাক। পানি বিক্রয়ের পক্ষে কিছু আলিম অনুমতি প্রদান করেছেন। তাদের মধ্যে হাসান বাসরী অন্যতম।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 1272,
			"arabicnumber": 1272,
			"text": "১২৭২। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ ঘাস হতে বঞ্চিত করার উদ্দেশ্যে উদ্ধৃত্ত পানি ব্যবহারের ক্ষেত্রে লোকদের কোন প্রকার বাধা দেওয়া নিষেধ। সহীহ, ইবনু মা-জাহ (২৪৭৮), নাসা-ঈ এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। আবূল মিনহালের নাম আবদুর রাহমান, পিতা মুতঈম। তিনি কূফার অধিবাসী ছিলেন এবং তার নিকট হতে হাবীব ইবনু আবূ সাবিত হাদীস বর্ণনা করেছেন। অপরদিকে আবূল মিনহাল সাইয়্যার ইবনু সালামা বাসরার বাসিন্দা ছিলেন এবং তিনি আবূ বারযা আল-আসলামী (রাঃ)-এর সহচর ছিলেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 1273,
			"arabicnumber": 1273,
			"text": "১২৭৩৷ ইবনু উমর (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, পাল দেওয়ার উদ্দেশ্যে ষাঁড় প্রদান করে মজুরি নিতে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিষেধ করেছেন। সহীহ, বেচা-কেনার হাদীস, বুখারী আবূ হুরাইরা, আনাস ও আবূ সাঈদ (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। ইবনু উমর (রাঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। এ হাদীসের সমর্থনে একদল আলিম মত দিয়েছেন। পাল দেওয়ার বিনিময়ে পুরস্কার গ্রহণের পক্ষে অন্য একদল আলিম অনুমতি প্রদান করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 1274,
			"arabicnumber": 1274,
			"text": "১২৭৪। আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত আছে, পাল দেওয়ার উদ্দেশ্যে ষাঁড় প্রদান করে মজুরি নেওয়া প্রসঙ্গে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট কিলাব গোত্রের এক লোক প্রশ্ন করলে তিনি তা নিতে বারণ করেন। সে বলল, হে আল্লাহর রাসূল! আমরা পাল দেওয়ার উদ্দেশ্যে ষাঁড় দেই এবং আমাদেরকে (দাবি ব্যতীতই) পুরস্কার স্বরূপ কিছু দেওয়া হয়। তিনি তাকে এ ধরণের পুরষ্কার নেওয়ার অনুমতি দেন। সহীহ, মিশকাত তাহকীক ছানী (২৮৬৬), বেচা-কেনার হাদীস এ হাদীসটিকে আবূ ঈসা হাসান গারীব বলেছেন। আমরা এ হাদীসটি শুধু উল্লেখিত সূত্রেই জেনেছি।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 1275,
			"arabicnumber": 1275,
			"text": "১২৭৫। রাফি ইবনু খাদীজ (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ রক্তক্ষরণের মজুরি ঘৃণিত, ব্যভিচারের বিনিময় মূল্য জঘন্য এবং কুকুরের বিক্রয় মূল্যও ঘৃণিত। সহীহ, বেচা-কেনার হাদীস, মুসলিম উমার, আলী, ইবনু মাসউদ, আবু মাসউদ, জাবির, আবু হুরায়রা, ইবনু আব্বাস, ইবনু উমার ও আবদুল্লাহ ইবনু জাফার (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। রাফি ইবনু খাদীজ (রাঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। এ হাদীস মোতাবিক বেশিরভাগ আলিম আমল করেছেন। কুকুরের বিক্রয় মূল্য গ্রহণকে তারা মাকরূহ বলেছেন। এই মত দিয়েছেন ইমাম শাফিঈ, আহমাদ ও ইসহাক। শিকারী কুকুরের বিক্রয় মূল্য গ্রহণের পক্ষে কিছু আলিম অনুমতি প্রদান করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 1276,
			"arabicnumber": 1276,
			"text": "১২৭৬। আবূ মাসউদ আল-আনসারী (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কুকুরের বিক্রয় মূল্য, যিনার বিনিময় এবং গণকের উপঢৌকন গ্রহণ করতে নিষেধ করেছেন। সহীহ, ইবনু মা-জাহ (২১৫৯), নাসা-ঈ এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 1277,
			"arabicnumber": 1277,
			"text": "১২৭৭। মুহাইয়্যিসা (রাঃ) হতে বর্ণিত আছে, তিনি রক্তক্ষরণের মজুরি নেওয়ার জন্য রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট অনুমতি চাইলে তিনি তাকে তা নিতে নিষেধ করেন। তিনি তার নিকট বারবার কাকুতি-মিনতি করতে থাকলেন। অবশেষে তিনি বললেনঃ এই আয় তোমার পানি বহনকারী উট এবং তোমার গোলামের খাবারের জন্য খরচ কর। সহীহ, ইবনু মা-জাহ (২১৬৬), বেচা-কেনার হাদীস রাফি ইবনু খাদীজ, আবূ জুহাইফা, জাবির ও সাইব ইবনু ইয়াযীদ (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। মুহাইয়্যিসা (রাঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। এ হাদীস অনুযায়ী কিছু সংখ্যক আলিম আমল করেছেন। ইমাম আহমাদ বলেছেন, আমার নিকট রক্তক্ষরণকারী মজুরি নেওয়ার অনুমতি চাইলে আমি তাকে অনুমতি প্রদান করব না এবং নিজের মতের সপক্ষে এই হাদীসটি দলীল হিসাবে উপস্থাপন করব।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 1278,
			"arabicnumber": 1278,
			"text": "১২৭৮৷ হুমাইদ (রহঃ) হতে বর্ণিত আছে, তিনি বলেন, রক্তক্ষরণকারীর পারিশ্রমিক প্রসঙ্গে আনাস (রাঃ)-কে প্রশ্ন করা হলে তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রক্তক্ষরণ করিয়েছেন। আবূ তাইবা তার রক্তক্ষরণ করেন। তিনি তাকে দুই সা’ পরিমাণ খাদ্যদ্রব্য দেওয়ার হুকুম দেন। তার মালিক পরিবারের সাথে তিনি আলোচনা করলে তারা তার উপর ধার্যকৃত অর্থের পরিমাণ কমিয়ে দেয়। তিনি বলেনঃ তোমরা যেসব চিকিৎসা গ্রহণ কর সে সবের মধ্যে রক্তক্ষরণ উত্তম চিকিৎসা। অথবা তোমাদের ঔষধগুলোর মধ্যে রক্তক্ষরণ উত্তম ঔষধ। সহীহ, মুখতাসার শামাইল (৩০৯), বেচা-কেনার হাদীস, নাসা-ঈ আলী, ইবনু আব্বাস ও ইবনু উমার (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আনাস (রাঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। রক্তক্ষরণের মজুরি গ্রহণের পক্ষে একদল বিশেষজ্ঞ সাহাবী ও তাবিঈ সম্মতি দিয়েছেন। ইমাম শাফিঈরও এই মত।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 1279,
			"arabicnumber": 1279,
			"text": "১২৭৯। জাবির (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, কুকুর ও বিড়ালের বিক্রয় মূল্য নিতে রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিষেধ করেছেন। সহীহ, ইবনু মাজাহ ২১৬১, মুসলিম আবূ ঈসা বলেন, এ হাদীসের সনদে গরমিল আছে। বিড়ালের মূল্য সম্পর্কে সহীহ হাদীস নেই। এই হাদীসটি আমাশের কোন কোন শাগরিদ জাবির (রাঃ) হতেও বর্ণনা করেছেন। আমাশের স্তরে এসে বর্ণনাকারীগণ গরমিল করেছেন। বিড়ালের বিক্রয় মূল্য নেওয়াকে একদল বিশেষজ্ঞ আলিম মাকরূহ বলেছেন, কিন্তু তা গ্রহণের পক্ষে অন্য দল সম্মতি প্রদান করেছেন। এই শেষোক্ত মত পোষণ করেন ইমাম আহমাদ ও ইসহাক। হাদীসটি ইবনু ফুযাইল আমাশ হতে, তিনি আবূ হাযিম হতে, তিনি আবূ হুরাইরা হতে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে অন্যভাবে বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 1280,
			"arabicnumber": 1280,
			"text": "১২৮০। জাবির (রাঃ) হতে বর্ণিত আছে, তিনি বলেছেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বিড়ালের গোশত খেতে এবং এর বিক্রয় মূল্য নিতে নিষেধ করেছেন। যঈফ, ইবনু মাজাহ (৩২৫০) আবূ ঈসা বলেন, এ হাদীসটি গারীব। আবদুর রাযযাক ব্যতীত অন্য কোন বড় আলিম উমার ইবনু যাইদের নিকট হতে বর্ণনা করেছেন বলে আমাদের জানা নেই।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 1281,
			"arabicnumber": 1281,
			"text": "১২৮১। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, শিকারী কুকুর ব্যতীত অন্যান্য কুকুরের বিক্রয় মূল্য নিতে নিষেধ করা হয়েছে। হাসান, তা’লীক আলা রাওযাতিন নাদিয়্যাহ (২/৯৪) আবূ ঈসা বলেন, এ হাদীসটি উল্লেখিত সনদসূত্রে সহীহ নয়। আবূল মুহাযযিমের নাম ইয়াযীদ, পিতা সুফিয়ান। শুবা ইবনুল হাজ্জাজ তার সমালোচনা করেছেন এবং তাকে দুর্বল বলেছেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে জাবির (রাঃ)-ও উল্লেখিত হাদীসের মত একটি হাদীস বর্ণনা করেছেন। কিন্তু এই সূত্রটিও সহীহ নয়।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 1282,
			"arabicnumber": 1282,
			"text": "১২৮২। আবূ উমামা (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ গায়িকা বিক্রয় কর না, ক্রয়ও কর না এবং তাদেরকে গানের প্রশিক্ষণও দিও না। এদের ব্যবসায়ের মধ্যে কোনরকম কল্যাণ নেই এবং এদের বিনিময় মূল্য হারাম। এই আয়াত এ ধরণের লোকদের বিরুদ্ধে অবতীর্ণ হয়েছেঃ “মানুষের মধ্যে কিছু এমন ধরণের লোকও আছে, যে মন ভুলানো কথা ক্রয় করে আনে, যেন আল্লাহ তা'আলার পথ হতে লোকদেরকে তাদের অজান্তেই বিভ্রান্ত করতে পারে এবং আল্লাহ্ তা'আলার পথকে ঠাট্টা-বিদ্রুপ করে। এই ধরণের লোকদের জন্য আছে কঠিন ও অপমানজনক শাস্তি।\" (সূরাঃ লুকমান-৬)। যঈফ, সহীহা (২৯২২), তবে আয়াত অবতীর্ণ হওয়ার ঘটনা বর্ণনা সহীহ। উমার (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আমরা শুধু উল্লেখিত সনদ সূত্রেই আবূ উমামা (রাঃ)-এর হাদীসটি জেনেছি। কিছু হাদীস বিশারদ আলী ইবনু ইয়ামীদের সমালোচনা করেছেন এবং তাকে হাদীস শাস্ত্রে দুর্বল বলেছেন। তিনি একজন সিরিয়ার অধিবাসী ছিলেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 1283,
			"arabicnumber": 1283,
			"text": "১২৮৩। আবূ আইয়ূব (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে বলতে শুনেছিঃ মা ও তার সন্তানদের পরস্পর হতে যে ব্যক্তি পৃথক করে ফেলবে, আল্লাহ্ তা'আলা ঐ ব্যক্তি ও তার প্রিয়জনকে পরস্পর হতে কিয়ামতের দিন পৃথক করে দিবেন। হাসান, মিশকাত (৩৩৬১) এ হাদীসটিকে আবূ ঈসা হাসান গারীব বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 1284,
			"arabicnumber": 1284,
			"text": "১২৮৪। আলী (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে দু’জন ক্রীতদাস দান করেন। এরা ছিল আপন ভাই। আমি তাদের একজনকে বেচে দিলাম। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ হে আলী! তোমার আর একটি গোলাম কোথায়? আমি বিষয়টি তাঁকে জানালে তিনি বললেনঃ তাকে ফেরত নিয়ে আস, তাকে ফেরত নিয়ে আস। যঈফ, ইবনু মাজাহ (২২৪৯) অন্য শব্দে সংক্ষিপ্তভাবে সহীহ সনদে আবূ দাউদে আছে। (২৪১৫) আবূ ঈসা বলেন, এ হাদীসটি হাসান গারীব। একদল বিশেষজ্ঞ সাহাবী ও তাবিঈ কয়েদীদের বিক্রয় করার সময় (হাদীসে উল্লেখিত সম্পর্ক থাকলে) পরস্পর হতে আলাদা করতে মানা করেছেন। অবশ্য কিছু আলিম ইসলামী রাষ্ট্রে জন্মগ্রহণকারী কয়েদীদের একে অপরের নিকট হতে আলাদা করে বিক্রয় করার সম্মতি দিয়েছেন। কিন্তু প্রথম মতই বেশী সহীহ। ইবরাহীম নাখঈ প্রসঙ্গে বর্ণিত আছে যে, তিনি মা ও তার সন্তানকে আলাদা আলাদাভাবে বিক্রয় করেছেন। তাকে এ ব্যাপারে প্রশ্ন করা হলে তিনি বলেন, আমি তার (সন্তানের মায়ের) সম্মতি নিয়ে তা করেছি।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 1285,
			"arabicnumber": 1285,
			"text": "১২৮৫। আইশা (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফায়সালা করেছেনঃ ক্ষতির দায় বহনের শর্তেই উপকারিতা ভোগের অধিকার সৃষ্টি হয়। হাসান, ইবনু মা-জাহ (২২৪২, ২২৪৩) এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। হাদীসটি একাধিক সূত্রে বর্ণিত হয়েছে। এ হাদীস অনুযায়ী আলিমগণ আমল করেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 1286,
			"arabicnumber": 1286,
			"text": "১২৮৬। আইশা (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফায়সালা করেছেনঃ ক্ষতির দায় বহনের শর্তেই উপকারিতা ভোগের অধিকার সৃষ্টি হয়। হাসান, দেখুন পূর্বের হাদীস। এ হাদীসটি হিশাম ইবনু উরওয়ার সনদসূত্রে হাসান সহীহ গারীব। হিশাম ইবনু উরওয়া হতে মুসলিম ইবনু খালিদ এ হাদীসটি বর্ণনা করেছেন। জারীরও হিশাম হতে বর্ণনা করেছেন। জারীরের বর্ণনায় তাদলীস আছে। জারীর তাদলীস করেছেন। সরাসরি হিশাম হতে তিনি তা শুনতে পাননি। “আল-খারাজ বিয-যামান\"-এর ব্যাখ্যা হলঃ যেমন এক লোক একটি গোলাম কিনলো। সে তাকে দিয়ে কাজও করাল। তারপর তার নিকট এর দোষ ধরা পড়ল। বিক্রেতাকে গোলামটি ফিরত প্রদান করতে হবে, তবে তাকে দিয়ে কাজ করানোর আয় ক্রয়কারীই ভোগ করবে। কারণ, গোলামটি তার নিকট ফিরতের পূর্বে মৃত্যু বরণ করলে এই আর্থিক ক্ষতি ক্রেতাকেই বহন করতে হত, বিক্রেতার কোন রকম ক্ষতি হত না। এজন্যই তাকে দিয়ে সুবিধা ভোগের অধিকার অর্জিত হয়েছে। অনুরূপ ক্ষেত্রসমূহে “আল-খারাজ বিয যামান\" নীতি প্রযোজ্য। আবূ ঈসা বলেন, মুহাম্মাদ ইবনু ইসমাঈল এই হাদীসটিকে উমার ইবনু আলীর হাদীস হিসেবে গারীব মনে করেন, আমি বললাম, আপনিকি হাদীসটিকে তাদলীস মনে করেন, তিনি বললেন, না।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 1287,
			"arabicnumber": 1287,
			"text": "১২৮৭। ইবনু উমার (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ (অপরের) বাগানে প্রবেশের পর কোন লোক তা হতে খেতে পারে কিন্তু পুটুলি বেঁধে সাথে করে নিয়ে যেতে পারবে না। সহীহ, ইবনু মা-জাহ (২৩০১), দেখুন পরবর্তী হাদীস। আবূ লাহামের মুক্তদাস উমাইর ও আবূ হুরাইরা (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। ইবনু উমর (রাঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা গারীব বলেছেন। আমরা এটাকে শুধু ইয়াহইয়া ইবনু সুলাইমের সনদসূত্রেই জেনেছি। মুসাফিরদেরকে (পথিমধ্যে) বাগানের ফল খাওয়ার পক্ষে একদল আলিম অনুমতি প্রদান করেছেন, আর একদল মূল্য প্রদান না করে ফল খাওয়া মাকরূহ বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 1288,
			"arabicnumber": 1288,
			"text": "১২৮৮। রাফি ইবনু আমর (রাঃ) হতে বর্ণিত আছে, তিনি বলেছেন, আমি আনসারদের খেজুর গাছে ঢ়িল ছুড়ে বেড়াতাম। তারা আমাকে গ্রফতার করে রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকটে নিয়ে আসলে তিনি বললেনঃ হে রাফি! তুমি তাদের খেজুর গাছে কেন টিল ছুড়? আমি বললাম, হে আল্লাহর রাসূল! ক্ষুধার কারণে। তিনি বললেনঃ আর ঢ়িল ছুড়বে না, নীচে যা পড়বে তা খাবে। আল্লাহ তা'আলা তোমার পেট পূর্ণ করে দিন এবং তোমাকে সম্পূর্ণরূপে তৃপ্ত করুন। যঈফ, ইবনু মাজাহ (২২৯৯) এ হাদীসটি হাসান, গারীব সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 1289,
			"arabicnumber": 1289,
			"text": "১২৮৯। আমর ইবনু শুআইব (রহঃ) হতে পর্যায়ক্রমে তার পিতা ও দাদার সূত্রে বর্ণিত আছে, গাছের বোটায় ঝুলন্ত ফল প্রসঙ্গে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে প্রশ্ন করা হলে তিনি বলেনঃ যদি কোন লোক নিরুপায় হয়ে তা খায় কিন্তু পুটুলি বেঁধে না নিয়ে যায় তবে তার কোন অন্যায় হবে না। হাসান, ইরওয়া (২৪১৩) আবূ ঈসা এ হাদীসটিকে হাসান বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 1290,
			"arabicnumber": 1290,
			"text": "১২৯০। জাবির (রাঃ) হতে বর্ণিত আছে, মুহাকালা’, ‘মুযাবানা’, মুখাবারা’ ও ‘সুনয়া ধরণের কেনা-বেচাকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিষেধ করেছেন, যদি না (পরিমাণ) অবগত হয়। সহীহ, বেচা-কেনার হাদীস এ হাদীসটিকে আবূ ঈসা উল্লেখিত সনদসূত্রে হাসান সহীহ গারীব বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 1291,
			"arabicnumber": 1291,
			"text": "১২৯১। ইবনু আব্বাস (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন লোক খাদ্যশস্য কিনে তা হস্তগত হওয়ার পূর্বে যেন বিক্রয় না করে। ইবনু আব্বাস (রাঃ) বলেন, আমি মনে করি এই নির্দেশ প্রত্যেক বস্তুর ক্ষেত্রেই প্রযোজ্য। সহীহ, ইবনু মা-জাহ (১৮৬৮, ২১৭১) নাসা-ঈ জাবির ইবনু উমার ও আবূ হুরাইরা (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। ইবনু আব্বাস (রাঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। এ হাদীস অনুযায়ী বেশিরভাগ আলিম আমল করেছেন। কোন জিনিস কিনে হস্তগত হওয়ার পূর্বেই তা বিক্রয়কে তারা মাকরুহ বলেছেন। অন্য একদল আলিম বলেছেন, যদি কোন জিনিস খাদ্যশস্য বা পানীয় দ্রব্য না হয় এবং ওজন-পরিমাপ না করে তা ক্রয়-বিক্রয়ের প্রচলন থাকে তবে এরকম জিনিস কিনে হস্তগত হওয়ার পূর্বে বিক্রয় করা যেতে পারে। তাদের মতে উল্লেখিত নিষেধাজ্ঞা শুধু খাদ্যশস্যের ক্ষেত্রে প্রযোজ্য। ইমাম আহমাদ ও ইসহাক একথা বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 1292,
			"arabicnumber": 1292,
			"text": "১২৯২। ইবনু উমার (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের মধ্যে কোন লোক যেন অন্যের বিক্রয়ের প্রস্তাবের উপর নিজের বিক্রয়ের প্রস্তাব না দেয়। একইভাবে তোমাদের মধ্যে কেউ যেন অন্যের বিয়ের প্রস্তাবের উপর নিজের বিয়ের প্রস্তাব না দেয়। সহীহ, ইবনু মা-জাহ (১৮৬৮, ২১৭১), নাসা-ঈ আবূ হুরাইরা ও সামুরা (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। ইবনু উমর (রাঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আরো বলেছেনঃ “অন্যের দর-দামের উপর কোন ব্যক্তি যেন নিজের দর-দাম না করে\"। একদল আলিমের মতে এ হাদীসে “বাই” বেচা-কেনা অর্থ দরদাম করা।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 1293,
			"arabicnumber": 1293,
			"text": "১২৯৩। আবূ তালহা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, হে আল্লাহর রাসূল! আমি কিছু মদ কিনেছি আমার অধীনস্ত কয়েকটি ইয়াতীমের জন্য। তিনি বলেনঃ তা ঢেলে ফেলে দাও এবং পাত্রগুলো ভেঙ্গে ফেল। হাসান, মিশকাত তাহকীক ছানী (৩৬৫৯) জাবির, আইশা, আবু সাইদ, ইবনু মাসউদ ইবনু উমার ও আনাস(রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আৰূ ঈসা বলেন, সাওরী আবূ তালহার এ হাদীসটি সুদী হতে, তিনি ইয়াহইয়া ইবনু আব্বাস হতে আনাস (রাঃ)-এর সূত্রে বর্ণনা করেছেন। এই পরবর্তী সূত্রটি প্রথম সূত্রের চেয়ে অধিক সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 1294,
			"arabicnumber": 1294,
			"text": "১২৯৪। আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, মদকে সিরকা বানানো বিষয়ে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট প্রশ্ন করা হলে তিনি বলেনঃ না, তা করা যাবে না। সহীহ, মিশকাত, মুসলিম এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 1295,
			"arabicnumber": 1295,
			"text": "১২৯৫। আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, শারাবের সাথে সম্পৃক্ত দশ শ্রেণীর লোককে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অভিসম্পাত করেছেন। এরা হলঃ মদ তৈরিকারী, মদের ফরমায়েশকারী, মদ পানকারী, মদ বহনকারী, যার জন্য মদ বহন করা হয়, মদ পরিবেশনকারী, মদ বিক্রয়কারী, এর মূল্য ভোগকারী, মদ ক্রেতা এবং যার জন্য মদ ক্রয় করা হয়। হাসান সহীহ, ইবনু মা-জাহ (৩৩৮১) এ হাদীসটিকে আবূ ঈসা আনাসের হাদীস হিসেবে গারীব বলেছেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের অনুরূপ হাদীস ইবনু আব্বাস, ইবনু মাসউদ ও ইবনু উমর (রাঃ) হতেও বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 1296,
			"arabicnumber": 1296,
			"text": "১২৯৬। সামুরা ইবনু জুনদাব (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের কোন লোক কোন পশু পালের নিকট এসে পড়লে সেখানে এর মালিককে পেলে (দুধ দোহনের জন্য) তার অনুমতি চাইবে। সে অনুমতি দিলে দুধ দোহাবে এবং পান করবে। কোন লোক যদি সেখানে উপস্থিত না থাকে তবে তিনবার ডাক দিবে। তার ডাকে কোন লোক সাড়া দিলে তবে তার নিকট অনুমতি চাইবে। তার ডাকে কোন লোক সাড়া না দিলে সে দুধ দোহাবে, তা পান করবে কিন্তু সাথে করে নিয়ে যেতে পারবে না। সহীহ, ইবনু মা-জাহ (২৩০০) উমার ও আবূ সাঈদ (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। সামুরা (রাঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা হাসান গারীব সহীহ বলেছেন। এ হাদীস অনুযায়ী একদল আলিম আমল করেছেন। ইমাম আহমাদ এবং ইসহাকও একথা বলেছেন। আলী ইবনু মাদীনী বলেন, সামুরা (রাঃ)-এর নিকট হাসান যে শুনেছেন তা সত্য। সামুরা (রাঃ)-এর নিকট হাসান বাসরীর হাদীস শুনার ব্যাপারে একদল হাদীস বিশারদ ভিন্নমত পোষণ করেন। তারা বলেছেন, সামুরা (রাঃ)-এর নিকট হতে হাসান (রাহঃ) সরাসরি শুনে বর্ণনা করেননি, বরঞ্চ তার পাণ্ডুলিপি হতে বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 1297,
			"arabicnumber": 1297,
			"text": "১২৯৭ জাবির ইবনু আবদুল্লাহ (রাঃ) হতে বর্ণিত আছে, তিনি মক্কা বিজয়ের বছর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে সেখানে থাকাবস্থায় বলতে শুনেছেনঃ নিশ্চয়ই আল্লাহ ও তার রাসূল শরাব, মৃত জীব, শূকর ও মূর্তির ব্যবসা হারাম করেছেন। তাকে বলা হল, হে আল্লাহর রাসূল! মৃত জীবের চর্বি প্রসঙ্গে আপনার বক্তব্য কি? এটাতো ব্যবহার করা হয় নৌকায় প্রলেপের কাজে ও চামড়া প্রক্রিয়াজাত করার কাজে এবং লোকেরা এটা দিয়ে প্রদীপ জ্বালায়। তিনি বললেনঃ না, এটা হারাম। তারপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আরো বললেনঃ আল্লাহ তা'আলা ইয়াহুদীদের ধ্বংস করে দিন আল্লাহ তা'আলা চর্বিকে তাদের জন্য হারাম করে দিয়েছিলেন, কিন্তু তারা তা গলিয়ে বিক্রয় করেছে এবং এর মূল্য ভক্ষণ করেছে। সহীহ, ইবনু মা-জাহ (২১৬৭), নাসা-ঈ উমার ও ইবনু আব্বাস (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। জাবির (রাঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। এ হাদীস অনুযায়ী আলিমগণ আমল করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 1298,
			"arabicnumber": 1298,
			"text": "১২৯৮। ইবনু আব্বাস (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমাদের জন্য নিকৃষ্ট দৃষ্টান্ত স্থাপন করা শোভনীয় নয়। দান (হেবা) করার পর যে লোক তা আবার ফিরিয়ে নেয় সে এমন এক কুকুরের সমতুল্য যে বমি করার পর তা আবার ভক্ষণ করে। সহীহ, ইবনু মা-জাহ (২৩৮৫), নাসা-ঈ এ অনুচ্ছেদে ইবনু উমর (রাঃ)-এর সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত আছে, তিনি বলেছেনঃ কোন কিছু দান করে তা আবার ফিরিয়ে নেওয়া কোন ব্যক্তির জন্য হালাল নয়। তবে পিতা নিজ পুত্রকে দান করে তা আবার ফিরিয়ে নিতে পারে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 1299,
			"arabicnumber": 1299,
			"text": "১২৯৯। ইবনু উমার ও ইবনু আব্বাস (রাঃ)-এর সূত্রে উপরোক্ত হাদীসটি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে মারফু হিসেবে বর্ণিত আছে। সহীহ, ইবনু মা-জাহ (২৩৮৬) আবূ ঈসা বলেন, ইবনু আব্বাস (রাঃ) হতে বর্ণিত হাদীসটি হাসান সহীহ্! এ হাদীস অনুযায়ী একদল সাহাবী ও তাবিঈ আমল করেছেন। তারা বলেছেন, কোন ব্যাক্তির পক্ষে নিজের নিকটাত্মীয়কে কিছু দান করে বা উপহার দিয়ে তা ফিরিয়ে নেওয়ার অধিকার নেই। তবে নিকটাত্মীয় ব্যতীত অন্য কাউকে দান করে এবং তার বিনিময়ে কিছু গ্রহণ না করলে উক্ত দান ফিরত নেওয়া যায়। সুফিয়ান সাওরীও একথা বলেছেন। শাফিঈ বলেছেন, পিতা ব্যতীত অন্য কোন লোক দান বা উপহার ফিরিয়ে নিতে পারবে না। তিনি নিজ মতের সপক্ষে উপরে বর্ণিত ইবনু উমারের হাদীস দলীল হিসাবে গ্রহণ করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 1300,
			"arabicnumber": 1300,
			"text": "১৩০০। যাইদ ইবনু সাবিত (রাঃ) হতে বর্ণিত আছে, মুহাকালা ও ‘মুযাবানা ধরণের বেচা-কেনাকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিষেধ করেছেন, কিন্তু আরাইয়ার অনুমতি দিয়েছেন-অনুমানে যে পরিমাণ নির্ধারিত হয় তদানুযায়ী বিক্রয় করতে। সহীহ, ইবনু মা-জাহ (২২৬৮, ২২৬৯), নাসা-ঈ আবূ হুরাইরা ও জাবির (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। যাইদ (রাঃ) হতে মুহাম্মাদ ইবনু ইসহাকও এরকমই বর্ণনা করেছেন। আইয়ুব, উবাইদুল্লাহ ইবনু উমার এবং মালিক ইবনু আনাস (রাহঃ) নাফির সূত্রে, তিনি ইবনু উমারের সূত্রে বর্ণনা করেছেন, \"মুহাকালা ও ‘মুযাবানা ধরণের কেনা-বেচাকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিষিদ্ধ করেছেন। যাইদ ইবনু সাবিত (রাঃ) হতে ইবনু উমার (রাঃ) একই সনদে বর্ণনা করেছেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আরাইয়ার অনুমতি দিয়েছেন। মুহাম্মাদ ইবনু ইসহাকের হাদীসের তুলনায় এ হাদীসটি অনেক বেশি সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 1301,
			"arabicnumber": 1301,
			"text": "১৩০১। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, পাঁচ ওয়াসাকের কম পরিমাণের মধ্যে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আরাইয়া পদ্ধতিতে বিক্রয়ের সম্মতি দিয়েছেন। সহীহ, বেচা-কেনার হাদীস। মালিক (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পাঁচ ওয়াসাক বা তার কম পরিমাণের মধ্যে আরাইয়া পদ্ধতিতে বিক্রয়ের অনুমতি প্রদান করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 1302,
			"arabicnumber": 1302,
			"text": "১৩০২। যাইদ ইবনু সাবিত (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অনুমান করে পরিমাণ নির্ধারণ করার পর আরাইয়া পদ্ধতিতে বিক্রয়ের অনুমতি প্রদান করেছেন। সহীহ, বেচা-কেনার হাদীস, নাসা-ঈ এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। আবূ হুরাইরা (রাঃ) হতে বর্ণিত হাদীসটি হাসান সহীহ। এ হাদীস অনুযায়ী একদল আলিম আমল করেছেন। তাদের মধ্যে ইমাম শাফিঈ, আহমাদ ও ইসহাকও অন্তর্ভুক্ত আছেন। তারা বলেছেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মুহাকালা’ ও ‘মুযাবানা’ নিষিদ্ধ করেছেন এবং তা হতে আরাইয়াকে বাদ রেখেছেন। তারা দলীল হিসাবে আবূ হুরাইরা ও যাইদ (রাঃ)-এর হাদীসকে গ্রহণ করেছেন। তাদের মতে আরাইয়ার ফল পাঁচ ওয়াসাকের কম পরিমাণের মধ্যে (পরিপক্ক ফলের বিনিময়ে) কেনা জায়িয। কিছু সংখ্যক আলিমের মতে, এই নির্দেশের মর্মার্থ এই যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দরিদ্র লোকদেরকে এ ব্যাপারে কিছুটা সুযোগ দিতে চেয়েছেন। কেননা, তারা তার নিকট আবেদন করে যে, তারা (আরাইয়ার) গাছের কাঁচা ফল কেনার জন্য শুধু পাকা ফলই দিতে পারে সুতরাং তিনি তাজা খেজুর খাওয়ার সুযোগকে বৃদ্ধির জন্য আরাইয়ার পরিমাণ পাঁচ ওয়াসাকের কমের মধ্যে সীমাবদ্ধ করেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 1303,
			"arabicnumber": 1303,
			"text": "১৩০৩। রাফি ইবনু খাদীজ ও সাহল ইবনু আবূ হাসমা (রাঃ) হতে বর্ণিত আছে, শুকনো ফলের পরিবর্তে গাছের কাঁচা ফল (সংগৃহীত) বিক্রয় করতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিষেধ করেছেন, কিন্তু একইভাবে তাজা আঙ্গুরের বিনিময়ে শুকনো আঙ্গুর এবং অনুমানে পরিমাণ নির্ধারণ করে ফল বিক্রয় করতে নিষেধ করেছেন। সহীহ, বেচা-কেনার হাদীস এ হাদীসটিকে আবূ ঈসা উল্লেখিত সনদসূত্রে হাসান সহীহ গারীব বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 1304,
			"arabicnumber": 1304,
			"text": "১৩০৪। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা পরস্পর 'নাজাশ' (ক্রেতাকে ঠকানোর জন্য দ্রব্যের দরদাম) কর না। সহীহ, ইবনু মা-জাহ (২১৭৪), নাসা-ঈ ইবনু উমার ও আনাস (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ হুরাইরা (রাঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। এ হাদীস অনুযায়ী আলিমগণ আমল করেছেন। তারা বেচা-কেনার ক্ষেত্রে নাজাশ করাকে মাকরূহ বলেছেন। আবূ ঈসা বলেন, নাজাশ বা তানাজুশ-এর অর্থ হলঃ এক লোক বিক্রেতার মালের দেখাশোনা করে এবং সে তার মালের দর-দাম প্রসঙ্গে ওয়াকিফহাল। যখন কোন ক্রেতা বিক্রেতার নিকট এসে মালের দামাদামি করে, তখন সে এসে উপস্থিত হয়। সে নকল ক্রেতার রূপ নিয়ে এসে ক্রেতার চেয়েও বেশি দাম হাকে। এখানে ক্রেতাকে ধোকায় ফেলে বিক্রেতার মাল বেশি মূল্যে বিক্রয় করাই তার উদ্দেশ্য। ইহা এক প্রকার প্রতারণা। ইমাম শাফিঈ বলেছেন, যে লোক নাজাশ করে সে গুনাহগার হবে কিন্তু আইনগতভাবে বিক্রয়টি হালাল হবে। কেননা, মূল বিক্রেতা প্রতারণা করেনি।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 1305,
			"arabicnumber": 1305,
			"text": "১৩০৫। সুয়াইদ ইবনু কাইস (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, হাজার নামক জায়গা হতে আমি ও মাখরাফা আল-আবদী (রাঃ) কিছু কাপড় আমদানি করলাম। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের নিকট এলেন। তিনি আমাদের নিকট হতে একটি পায়জামা কেনার জন্য দামাদামি করলেন। আমাদের নিকটই একজন কয়াল (পরিমাপক) উপস্থিত ছিল। পারিশ্রমিকের বিনিময়ে সে ওজন করে দিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (দ্রব্যের মূল্য পরিশোধকালে) কয়ালকে বলেনঃ ওজন কর এবং কিছুটা বেশি দাও। সহীহ, ইবনু মা-জাহ (২২২০) জাবির ও আবূ হুরাইরা (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। সুয়াইদ (রাঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। ওজনের সময় একটু বেশি দেওয়াকে বিশেষজ্ঞ আলিমগণ উত্তম বলেছেন। সিমাকের সূত্রে শুবা উক্ত হাদীসটি বর্ণনা করেছেন এবং সনদে আবূ সাফওয়ানকে সিমাকের পরে যোগ করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 1306,
			"arabicnumber": 1306,
			"text": "১৩০৬। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে লোক অভাবী ঋণগ্রস্তকে সুযোগ প্রদান করে অথবা ঋণ মাফ করে দেয়, কিয়ামতের দিবসে আল্লাহ্‌ তায়ালা তাকে নিজ আরশের ছায়ায় আশ্রয় প্রদান করবেন, যেদিন তার আরশের ছায়া ছাড়া আর কোন ছায়া থাকবে না। সহীহ তা’লীকুর রাগীব (২/৩৭), বেচা-কেনার হাদীস আবূল ইয়াসার, আবূ কাতাদা, হুযাইফা, ইবনু মাসউদ ও উবাদা (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ হুরাইরা (রাঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা উল্লেখিত সনদসূত্রে হাসান সহীহ গারীব বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 1307,
			"arabicnumber": 1307,
			"text": "১৩০৭। আবূ মাসউদ (রাঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের পূর্ববর্তী জাতির মধ্যে কোন এক লোকের হিসাব নেওয়া হলে তার কোন ভাল কাজ পাওয়া গেল না। সে ছিল ধনীলোক। সে যখন লোকদের সাথে লেন-দেন করত তখন নিজ গোলামদের হুকুম প্রদান করতঃ অভাবী ঋণগ্রস্তদের সাথে সহানুভূতিপূর্ণ আচরণ কর। এতে আল্লাহ তা'আলা বলেনঃ আমি ক্ষমা ও সহানুভূতির ক্ষেত্রে তার চেয়ে বেশি উপযোগী। অতএব, (হে ফেরেশতাগণ!) তাকে মুক্তি প্রদান কর। সহীহ, বেচা-কেনার হাদিস, মুসলিম। এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। আবূল ইয়াসাবের নাম কাব, পিতা আমর।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 1308,
			"arabicnumber": 1308,
			"text": "১৩০৮। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ঋণ পরিশোধ করার ক্ষেত্রে সক্ষম ব্যক্তির টালবাহানা করা অন্যায়। তোমাদের কারো পাওনা পরিশোধ করার জন্য ঋণগ্রস্ত ব্যক্তি কোন সক্ষম ব্যক্তির উপর দায়িত্ব দিলে তা অনুমোদন করা উচিত। সহীহ, ইবনু মা-জাহ (২৪০৩), নাসা-ঈ ইবনু উমার ও আশ-শারীদ (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 1309,
			"arabicnumber": 1309,
			"text": "১৩০৯। ইবনু উমর (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ স্বচ্ছল অবস্থা সম্পন্ন লোকদের (ঋণ পরিশোধের ক্ষেত্রে) টালবাহানা করা যুলুম। তোমাকে অবস্থা সম্পন্ন ব্যক্তির উপর সোপর্দ করা হলে তুমি তা অনুমোদন করবে এবং এক বিক্রয় চুক্তির মধ্যে দুই বিক্রয় (শর্ত) অন্তর্ভুক্ত করবে না। সহীহ, বেচা-কেনার হাদীস আবূ হুরাইরা (রাঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। এ হাদীসের তাৎপর্য হলঃ কোন লোক তার (ঋণ ইত্যাদির) দায় স্বচ্ছল লোকের উপর অর্পণ (হাওয়ালা) করলে সে যেন তা অনুমোদন করে। কিছু আলিম বলেছেন, সক্ষম ব্যক্তির উপর ঋণ অর্পণ করা হলে এবং পাওনাদার তা অনুমোদন করলে ঋণগ্রস্ত ব্যক্তি দায়মুক্ত হয়ে যাবে। ঋণদানকারী আর তাকে তাগাদা দিতে পারবে না। এই মত দিয়েছেন ইমাম শাফিঈ, আহমাদ ও ইসহাক। অন্য একদল আলিম বলেছেন, সক্ষম অবস্থাসম্পন্ন লোকের উপর যে লোকের ঋণ পরিশোধের দায়িত্ব অর্পণ করা হয়েছিল সে যদি দেউলিয়া হয়ে যায়, তবে ঋণদানকারী তার আসল ঋণীকে তাগাদা দেয়ার অধিকারী হবে। তারা নিজেদের দলীল হিসাবে উসমান (রাঃ) ও অন্যান্য সাহাবীর একটি বক্তব্যকে গ্রহণ করেছেনঃ “মুসলিমের মাল বিলীন হতে পারে না”। ইসহাক বলেন, মুসলিমের মাল বিলীন হতে পারে না কথার তাৎপর্য এই যে, ঋণগ্রহীতা ঋণদাতাকে অন্য কোন ব্যক্তির নিকট হতে তাকে স্বচ্ছল ভেবে তার ঋণ আদায় করে নেওয়ার কথা বলে। কিন্তু দেখা গেল যে, সে আসলে দেউলিয়া। এই অবস্থায় মুসলিমের মাল বিনষ্ট হতে পারে না (হাওয়ালাকারীকেই তা পরিশোধ করতে হবে)।",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 1310,
			"arabicnumber": 1310,
			"text": "১৩১০। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, মুনাবাযা ও মুলামাসা প্রকারের বেচা-কেনাকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিষিদ্ধ করেছেন। সহীহ, বেচা-কেনার হাদীস, নাসা-ঈ আবূ সাঈদ ও ইবনু উমার (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ হুরাইরা (রাঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। এ হাদীসের তাৎপর্য এই যে, বিক্রেতা বললঃ আমি যখন তোমার দিকে কিছু নিক্ষেপ করব তখন তোমার ও আমার মাঝে বেচা-কেনা বাধ্যতামূলক হয়ে যাবে। একে বলে মুনাবাযা। মুলামাসার অর্থ হলঃ বিক্রেতা ক্রেতাকে বলল, অমুক জিনিসটি তুমি স্পর্শ করলে বেচা-কেনা করাটা বাধ্যতামূলক হয়ে যাবে, ক্রেতা যদি পণ্যটি না দেখে থাকে তারপরেও, যেমন মোড়কের মধ্যের জিনিস, খাপের মধ্যের তরবারি ইত্যাদি। এটা এক প্রকার বিক্রয় পদ্ধতি যা জাহিলী যুগে করা হতো। এ উভয় প্রকার বিক্রয় করতে রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিষেধ করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 1311,
			"arabicnumber": 1311,
			"text": "১৩১১। ইবনু আব্বাস (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যে সময় মদীনায় আসেন সে সময় বিভিন্ন ধরণের ফলমূল অগ্রিম বেচা-কেনায় এখানকার লোকজন অভ্যস্ত ছিল। তিনি বললেনঃ যে লোক অগ্রিম বেচা-কেনা করতে চায় সে যেন পরিমাপ, ওজন ও মেয়াদ নির্দিষ্ট করে নেয়। সহীহ, ইবনু মা-জাহ (২২৮০), নাসা-ঈ ইবনু আবী আওফা ও আবদুর রাহমান ইবনু আব্যা (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। ইবনু আব্বাস (রাঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। এ হাদীস অনুযায়ী সাহাবী ও তাবিঈগণ আমল করেছেন। তাদের মতে অগ্রিম বেচা-কেনা জায়িয হবে খাদ্যশস্য, কাপড়-চোপড় এবং যেসব বস্তুর পরিমাণ, বৈশিষ্ট্য, অবস্থা ও ধরণ নির্ধারণ করা যায় এমন পণ্যের ক্ষেত্রে। পশু অগ্রিম বেচা-কেনা করা যায় কিনা এ ব্যাপারে মতের অমিল আছে। পশুর অগ্রিম বেচা-কেনা করাটা একদল সাহাবী ও তাবিঈর মতে জায়িয। এই মত দিয়েছেন ইমাম শাফিঈ, আহমাদ ও ইসহাক। এটাকে আরেক দল আলিম নাজায়িয বলেছেন। সুফিয়ান সাওরী ও কূফাবাসী আলিমগণ এই শেষোক্ত মত গ্রহণ করেছেন। আবূল মিনহালের নাম আব্দুর রহমান, পিতা মুতঈম।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 1312,
			"arabicnumber": 1312,
			"text": "১৩১২। জাবির ইবনু আবদুল্লাহ (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন বাগানের মালিকানায় কোন ব্যক্তির সাথে তার আরো শরীক থাকলে, সে তার অংশ বিক্রয়ের জন্য শরীকদেরকে ক্রয়ের প্রস্তাব দেওয়ার পূর্বে যেন সেটা অন্যের নিকট বিক্রয় না করে। সহীহ, ইরওয়া (৫/৩৭৩), বেচা-কেনার হাদীস, মুসলিম অনুরূপ। আবূ ঈসা বলেন, এ হাদীসের সনদ পরস্পর সংযুক্ত (মুত্তাসিল) নয়। আমি ইমাম বুখারীকে বলতে শুনেছিঃ সুলাইমান ইয়াশকুরী প্রসঙ্গে কথিত আছে যে, জাবির (রাঃ)-এর জীবদ্দশাতেই তিনি মৃত্যু বরণ করেন। আর তার নিকট হতে বিশর ও কাতাদা (রাহঃ) কখনও কিছু শুনেননি। বুখারী আরো বলেন, সুলাইমান ইয়াশকুরীর কাছে আমর ইবনু দীনার ব্যতীত আর কেউ শুনেছেন বলে আমার জানা নেই। জাবির (রাঃ)-এর জীবদ্দশায় হয়ত আমর তার নিকট হাদীস শুনেছেন। কাতাদা (রাহঃ) সুলাইমান ইয়াশকুরীর পাণ্ডুলিপি হতেই হাদীস বর্ণনা করেছেন। তিনি এটা জাবির (রাঃ)-এর নিকট হতে অর্জন করেছিলেন। সুলাইমান আত-তাইনী বলেছেন, তারা হাসান বাসরীর নিকট জাবির (রাঃ)-এর পাণ্ডুলিপিটি নিয়ে গেলেন। তিনি এটাকে গ্রহণ করলেন বা তা হতে রিওয়ায়াত করেন। অতঃপর তারা এটাকে কাতাদার নিকট নিয়ে গেলে তিনিও তা হতে রিওয়ায়াত করেন। তারপর এটাকে তারা আমার কাছে নিয়ে এলে আমি তা হতে রিওয়ায়াত করিনি এবং তা ফিরত দেই।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 1313,
			"arabicnumber": 1313,
			"text": "১৩১৩। জাবির ইবনু আবদুল্লাহ (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মুহাকালা ‘মুযাবানা', মুখাবারা ও মুআওয়ামা’* করতে নিষেধ করেছেন, কিন্তু আরাইয়ার অনুমতি প্রদান করেছেন।* সহীহ, বেচা-কেনার হাদিস, মুসলিম। এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 1314,
			"arabicnumber": 1314,
			"text": "১৩১৪। আনাস (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের যুগে একবার দ্রব্যমূল্য বৃদ্ধি পাওয়ার ফলে লোকেরা বলতে লাগল, হে আল্লাহর রাসূল! আমাদের জন্য দ্রব্যমূল্য বেঁধে দিন। তিনি বললেনঃ আল্লাহ্ তা'আলাই মূল্য নির্ধারণ করে থাকেন, তিনিই নিয়ন্ত্রণকারী, অপ্রশস্তকারী, প্রশস্তকারী ও রিযিক দানকারী। আমি আমার প্রতিপালকের সাথে এমন অবস্থায় মিলিত হতে চাই যে, তোমাদের কোন লোক যেন এ দাবি করতে না পারে (আমার বিরুদ্ধে) যে, তার জান-মালের উপর আমি হস্তক্ষেপ করেছি। সহীহ, ইবনু মা-জাহ (২২০০) আবূ ঈসা এ হাদীসটিকে হাসান সহীহ বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 1315,
			"arabicnumber": 1315,
			"text": "১৩১৫। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, কোন একসময় রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসল্লাম (বাজারে) একটি খাদ্যশস্যের স্তূপ অতিক্রম করে যাচ্ছিলেন। তিনি নিজের হাতকে স্তূপের মধ্যে প্রবেশ করালেন। তিনি তার হাতে ভিজা অনুভব করেন। স্তূপের মালিককে তিনি প্রশ্ন করেনঃ এ কি? সে বলল, হে আল্লাহর রাসূল! এটা বৃষ্টির পানিতে ভিজে গিয়েছিল। তিনি বললেনঃ ভিজাগুলো স্তুপের উপরে রাখলে না কেন, যাতে লোকেরা দেখতে পেত? অতঃপর তিনি বললেনঃ প্রতারণাকারী ও ধোকাবাজকারীদের সাথে আমাদের কোন সম্পর্ক নেই। সহীহ, ইবনু মা-জাহ (২২২৪) ইবনু নিয়ার ও হুযাইফা ইবনুল ইয়ামান (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ হুরাইরা (রাঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। এ হাদীস অনুযায়ী আলিমগণ মত দিয়েছেন। প্রতারণা ও ধোকাবাজিকে তারা খুবই জঘন্য অপরাধ হিসাবে উল্লেখ করেছেন এবং এটাকে হারাম বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 1316,
			"arabicnumber": 1316,
			"text": "১৩১৬। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, একটি উঠতি বয়সের উটকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ধার হিসেবে গ্রহণ করেন। তিনি ফিরত দেওয়ার সময় এর চেয়েও ভাল উট প্ৰদান করলেন এবং বললেনঃ তোমাদের মধ্যে সেই বেশি উত্তম যে উত্তমভাবে ঋণ পরিশোধ করে। সহীহ, বেচা-কেনার হাদীস, নাসা-ঈ আবূ রাফি (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ হুরাইরা (রাঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। উক্ত হাদীসটি সালামার সূত্রে শুবা ও সুফিয়ান (রহঃ) বর্ণনা করেছেন। এ হাদীস অনুযায়ী একদল বিশেষজ্ঞ আলিম আমল করেছেন। নির্দিষ্ট বয়সের উট ধার হিসেবে গ্রহণ করাতে তারা কোন সমস্যা মনে করেন না। এই মত দিয়েছেন শাফিঈ, আহমাদ ও ইসহাক। কিন্তু এটাকে অন্য একদল আলিম মাকরূহ মনে করেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 1317,
			"arabicnumber": 1317,
			"text": "১৩১৭। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, এক ব্যক্তি নিজের পাওনা আদায়ের উদ্দেশ্যে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে কঠোর তাগাদা দিল। এর ফলে লোকটির উপর সাহাবীগণ রেগে গেলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তাকে উপেক্ষা কর, কেননা, পাওনাদারের অধিকার আছে কথা বলার। তিনি আরো বললেনঃ একটি উট কিনে তোমরা তাকে প্রদান কর। তারা উটের তালাশ করলেন। কিন্তু তার পাওনা উট হতে অধিক ভালটি ছাড়া অন্য কোন উট পেলেননা। তিনি বললেনঃ তাকে সেটাই কিনে দাও। কেননা, তোমাদের মধ্যে উত্তমরূপে ঋণ পরিশোধকারী লোকই উত্তম। সহীহ, বেচা-কেনার হাদীস, নাসা-ঈ এ হাদীসটি মুহাম্মাদ ইবনু বাশশার মুহাম্মাদ ইবনু জাফার হতে, তিনি শুবা হতে, তিনি সালামা ইবনু কুহাইল হতে অনুরূপ বর্ণনা করেছেন। এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 1318,
			"arabicnumber": 1318,
			"text": "১৩১৮। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের আযাদকৃত গোলাম আবূ রাফি (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, উঠতি বয়সের একটি উট রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ধার হিসেবে গ্রহণ করেছিলেন। তারপর (বাইতুল মালে) যাকাতের উট আসে। আবূ রাফি (রাঃ) বলেন, ঐ লোকের উঠতি বয়সের উটটি পরিশোধের জন্য রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে নির্দেশ দিলেন। আমি বললাম, (বাইতুল মালে) ছয় বছর বয়সের উটের চেয়ে ছোট উট পাচ্ছি না। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তাকে ঐটিই প্রদান কর। কেননা, উত্তমভাবে ঋণ পরিশোধকারী ব্যক্তিই লোকদের মধ্যে বেশি উত্তম। সহীহ, ইবনু মা-জাহ (২২৮৫), মুসলিম এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 1319,
			"arabicnumber": 1319,
			"text": "১৩১৯। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ক্রয়-বিক্রয় ও তাগাদার ক্ষেত্রে আল্লাহ তা'আলা নমতা পছন্দ করেন। সহীহ, সহীহ (৮৯০৯) জাবির (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। এ হাদীসটিকে আবূ ঈসা গারীব বলেছেন। উপরোক্ত হাদীসটি আবূ হুরাইরা (রাঃ) হতে সাঈদ আল-মাকবুরীর বরাতে ইবনুস এর সূত্রেও বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 1320,
			"arabicnumber": 1320,
			"text": "১৩২০। জাবির (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আল্লাহ তা'আলা তোমাদের পূর্বকালের এক লোককে ক্ষমা করে দিয়েছেন। সে যখন বিক্রয় করত নম্রতা দেখাতো, যখন ক্রয় করত বিনয় প্রদর্শন করতো এবং যখন ঋণের তাগাদা প্রদান করত তখনও নম্রতা ও ভদ্রতা প্রদর্শন করত। সহীহ, ইবনু মা-জাহ (২২০৩), বুখারী অনুরূপ এ হাদীসটিকে আবূ ঈসা উল্লেখিত সনদসূত্রে সহীহ্ হাসান গারীব বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 1321,
			"arabicnumber": 1321,
			"text": "১৩২১। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসল্লাম বলেছেনঃ মসজিদের ভিতরে তোমরা কোন লোককে বেচা-কেনা করতে দেখলে বলবে, আল্লাহ তা'আলা যেন তোমার ব্যবসায়ে কোন লাভ প্রদান না করেন। মসজিদের মধ্যে তোমরা কোন লোককে হারানো জিনিসের ঘোষণা দিতে দেখলে বলবে, তোমার হারানো জিনিসকে যেন আল্লাহ্ তা'আলা ফিরিয়ে না দেন। সহীহ, মিশকাত (৭৩৩), ইরওয়া (১৪৯৫) আবূ হুরাইরা (রাঃ)-এর হাদীসটিকে আবূ ঈসা হাসান গারীব বলেছেন। এই হাদীস অনুযায়ী বিশেষজ্ঞ আলিমগণ আমল করার কথা বলেছেন। তাদের মতে মসজিদের ভিতরে বেচা-কেনা করা নিষেধ। এই মত দিয়েছেন ইমাম আহমাদ ও ইসহাক (রাহঃ)। মসজিদের ভিতরে বেচা-কেনা করাটা অন্য একদল বিশেষজ্ঞ আলিমের মতে জায়িয।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 125
			}
		}
	]
}