{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"15": "The Chapters On Judgements From The Messenger of Allah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1322,
			"arabicnumber": 1322,
			"text": "১৩২২। আবদুল্লাহ ইবনু মাওহাব (রাহঃ) হতে বর্ণিত আছে, উসমান (রাঃ) ইবনু উমার (রাঃ)-কে বলেন, যাও! লোকদের মাঝে বিচার-ফায়সালা কর। তিনি বললেন, হে মু’মিনদের নেতা! আমাকে কি মাফ করবেন? তিনি বললেন, এ পদটি তুমি কেন অপছন্দ করছ, অথচ তোমার পিতা বিচার-ফায়সালা করতেন? তিনি উত্তরে বললেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে বলতে শুনেছিঃ কোন ব্যক্তি কাযী (বিচারক) নিযুক্ত হয়ে ইনসাফের উপর বিচার-ফায়সালা করলেও সে বরাবর আমল নিয়ে প্রত্যাবর্তন করবে (না তার কোন গুনাহ আছে আর না তার কোন সাওয়াব আছে)। এরপর আমি আর কি আশা করতে পারি? যঈফ, মিশকাত, তাহকীক ছানী (৩৭৪৩)। তা’লীকুর রাগীব (২/১৩২) তা’লীক আলা আহাদীস মুখতারাহ (৩৪৮, ৩৪৯) এ হাদীসের সাথে একটি ঘটনা আছে। এ অনুচ্ছেদে আবূ হুরাইরা (রাঃ) হতেও হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, ইবনু উমার (রাঃ)-এর হাদীসটি গারীব। আমার মতে এ হাদীসের সনদ পরস্পর সংযুক্ত নয়। কেননা যে আবদুল মালিক হতে মুতামির রিওয়াত করেছেন তিনি হলেন আবদুল মালিক ইবনু আবূ জামীলা। ১৩২২/২। বুরাইদা (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কাজীগণ তিন প্রকারের হয়ে থাকে। দুই প্রকারের কায়ী (বিচারক) হচ্ছে জাহান্নামী এবং এক প্রকার কায়ী হচ্ছে জান্নাতী। জেনেশুনে যে লোক (বিচারক) অন্যায় রায় প্রদান করে সে হচ্ছে জাহান্নামী। সত্যকে সম্পূর্ণরূপে উপলব্ধি না করেই যে লোক (বিচারক) মানুষের অধিকারসমূহ নস্যাৎ করে সে লোকও জাহান্নামী। আর যে লোক ন্যায়সঙ্গতভাবে ফায়সালা প্রদান করে (বিচারক) সে জান্নাতের অধিবাসী। সহীহ, ইরওয়া (২৬১৪), মিশকাত (৩৭৩৫)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1323,
			"arabicnumber": 1323,
			"text": "১৩২৩। আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তি কাযীর পদ চেয়ে নেয় তার দায়দায়িত্ব তার উপরই চাপিয়ে দেয়া হয়। আর যাকে এই পদ গ্রহণ করতে বাধ্য করা হয় আল্লাহ তা'আলা তার নিকট একজন ফিরিশতা পাঠিয়ে দেন যিনি তাকে ইনসাফের পথে থাকতে সহযোগীতা করেন। যঈফ, ইবনু মাজাহ (২৩০৯)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1324,
			"arabicnumber": 1324,
			"text": "১৩২৪। আনাস (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, যে ব্যক্তি বিচারকের পদ চায় এবং অন্যদের দিয়ে তার জন্য সুপারিশ করায়, তাকে তার নিজের উপর ছেড়ে দেয়া হয় (এবং আল্লাহ তা'আলার সাহায্য হতে বঞ্চিত করা হয়)। আর যাকে জোর করে এ পদে বসানো হয়, আল্লাহ তা'আলা তার জন্য একজন ফিরিশতা পাঠিয়ে দেন, যিনি তাকে ইনসাফের পথে অনুপ্রাণিত করেন। যঈফ, প্রাগুক্ত আবূ ঈসা বলেছেন, এ হাদীসটি হাসান গারীব। পূর্ববর্তী ইসরাঈলের হাদীসের তুলনায় এটি অনেক বেশী সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1325,
			"arabicnumber": 1325,
			"text": "১৩২৫। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তি বিচারের দায়িত্ব গ্রহণ করল অথবা জনগণের বিচারক হিসেবে যে লোককে নিয়োগ করা হল তাকে যেন ছুরি ছাড়াই যবেহ করা হল। সহীহ, ইবনু মা-জাহ (২৩০৮) এ হাদীসটিকে আবূ ঈসা উল্লেখিত সনদসূত্রে হাসান গারীব বলেছেন। এ হাদীসটি আবূ হুরাইরা (রাঃ) হতে আরো একটি সূত্রে বর্ণিত হয়েছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1326,
			"arabicnumber": 1326,
			"text": "১৩২৬। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ বিচারক যখন ফায়সালা করে এবং ইজতিহাদ করে (চিন্তা ভাবনা করে সত্যে পৌছার চেষ্টা করে), তারপর সঠিক সিদ্ধান্তে পৌছে যায়, তার জন্য দুইটি পুরস্কার রয়েছে। আর ফায়সালা করতে গিয়ে সে যদি ভুল করে ফেলে তবুও তার জন্য একটি পুরস্কার আছে। সহীহ, ইবনু মা-জাহ (২৩১৪), নাসা-ঈ আমর ইবনুল আস ও উকবা ইবনু আমির (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা উল্লেখিত সনদ সূত্রে হাসান গারীব বলেছেন। এ হাদীস প্রসঙ্গে আমরা আবদুর রাযযাক-মামার হতে, তিনি সুফিয়ান সাওরী হতে, এই সূত্র ছাড়া সুফিয়ান সাওরীর বরাতে ইয়াহইয়া ইবনু সাঈদের বর্ণনা হিসাবে কিছু জানি না।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1327,
			"arabicnumber": 1327,
			"text": "১৩২৭। মুআয (রাঃ)-এর সঙ্গীগণ হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মুআয (রাঃ)-কে ইয়ামানে পাঠান। তিনি প্রশ্ন করেনঃ তুমি কিভাবে বিচার করবে? তিনি বললেন, আমি আল্লাহ তা'আলার কিতাব অনুসারে বিচার করব। তিনি বললেনঃ যদি আল্লাহ তা'আলার কিতাবে পাওয়া না যায়? তিনি বললেন, তাহলে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সুন্নাত (হাদীস) অনুসারে বিচার করব। তিনি বললেনঃ যদি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সুন্নাতেও না পাও? তিনি বললেন, আমার জ্ঞান-বুদ্ধি দিয়ে ইজতিহাদ করব। তিনি বললেন? সকল প্রশংসা সেই আল্লাহ্ তা'আলার জন্য যিনি আল্লাহর রাসূলের প্রতিনিধিকে এইরূপ যোগ্যতা দান করেছেন। যঈফ, যঈফা (৮৮১)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1328,
			"arabicnumber": 1328,
			"text": "১৩২৮। মুহাম্মাদ ইবনু বাশশার স্বীয় সনদে মুআয (রাঃ) হতে হান্নাদের হাদীসের মতই বর্ণনা করেছেন। দেখুন পূর্বের হাদীস আবূ ঈসা বলেছেন, শুধু উল্লেখিত সূত্রেই আমরা হাদীসটি প্রসঙ্গে জেনেছি। আমার মতে এ হাদীসের সনদ পরস্পর সংযুক্ত নয়। আবূ আওন আস-সাকাফীর নাম মুহাম্মাদ, পিতা উবাইদুল্লাহ।",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1329,
			"arabicnumber": 1329,
			"text": "১৩২৯। আবূ সাঈদ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কিয়ামতের দিন লোকদের মাঝে ন্যায়নিষ্ঠ শাসকই আল্লাহ্ তা'আলার সবচাইতে প্রিয় ও নিকটে উপবেশনকারী হবে। তাদের মাঝে যালিম শাসকই আল্লাহ তা'আলার সবচাইতে ঘৃণিত এবং তার নিকট হতে সবচেয়ে দূরে অবস্থানকারী হবে। যঈফ, রাওয (২/৩৫৬-৩৫৭), যঈফা (১১৫৬) মিশকাত, তাহকীক ছানী (৩৭০৪) এ অনুচ্ছেদে ইবনু আবূ আওফা (রাঃ) হতেও হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, আবূ সাঈদ (রাঃ) বর্ণিত হাদীসটি হাসান গারীব। শুধু উপরোক্ত সূত্রেই হাদীসটি আমরা জেনেছি।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1330,
			"arabicnumber": 1330,
			"text": "১৩৩০। ইবনু আবী আওফা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে পর্যন্ত বিচারক কোন প্রকার যুলুম না করে সে পর্যন্ত আল্লাহ্ তা'আলা তার সহায়তা করেন। সে যে মুহুর্তে কোন প্রকার যুলুম করে ফেলে তখন তিনি তাকে পরিত্যাগ করেন এবং শাইতান তাকে জড়িয়ে ধরে। হাসান, ইবনু মা-জাহ (২৩১২) এ হাদীসটিকে আবূ ঈসা হাসান গারীব বলেছেন। এটি আমরা শুধুমাত্র ইমরান আল-কাত্তানের সূত্রেই জেনেছি।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1331,
			"arabicnumber": 1331,
			"text": "১৩৩১। আলী (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমাকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমার নিকট যখন দুইজন লোক বিচারের জন্য আবেদন করে তখন দ্বিতীয় পক্ষের বক্তব্য তুমি সম্পূর্ণভাবে না শুনেই প্রথম পক্ষের কথার উপর নির্ভর করে রায় প্রদান করো না। তুমি খুব শীঘ্রই জানতে পারবে, তুমি কিভাবে ফায়সালা করছ। আলী (রাঃ) বলেন, তারপর আমি বিচারক হিসাবেই রয়ে গেছি। হাসান, ইরওয়া (২৬০০) এ হাদীসটিকে আবূ ঈসা হাসান বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1332,
			"arabicnumber": 1332,
			"text": "১৩৩২। মুআবিয়া (রাঃ)-কে আমর ইবনু মুররা (রাঃ) বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে আমি বলতে শুনেছিঃ গরীব-মিসকীন ও নিজ প্রয়োজন মেটানোর উদ্দেশ্য আগমনকারী লোকের জন্য যে নেতা নিজের দরজাকে বন্ধ করে রাখে, এ ধরণের লোকের দারিদ্র্য, অভাব ও প্রয়োজনের সময় আল্লাহ তা'আলাও আকাশের দরজা বন্ধ করে রাখবেন। মুআবিয়া (রাঃ) একথা শুনার পর থেকে এক লোককে মানুষের প্রয়োজন মেটানোর উদ্দেশ্যে নিযুক্ত করেন। সহীহ, মিশকাত তাহকীক ছানী (৩৭২৮), সহীহা (৬২৯), সহীহ আবূ দাউদ (২৬১৪) ইবনু উমার (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আমর ইবনু মুররা (রাঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা গারীব বলেছেন। অন্য একটি সূত্রেও এ হাদীসটি বর্ণিত হয়েছে। আবূ মারইয়াম হচ্ছে আমর ইবনু মুররার উপনাম।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1333,
			"arabicnumber": 1333,
			"text": "১৩৩৩। আলী ইবনু হুজর ইয়াহইয়া ইবনু হামযা হতে, তিনি ইয়াযিদ ইবনু আবী মারইয়াম হতে, তিনি আল-কাসিম ইবনু মুখাইমিরাহ তিনি রাসুলের সাহাবী আবু মার‍ইয়াম হতে, তিনি রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে উপরোক্ত হাদীসের মতই হাদীস বর্ণনা করেছেন। ইয়াযীদ ইবনু আবূ মারইয়াম ছিলেন সিরিয়ার অধিবাসী এবং বুরাইদ ইবনু আবূ মারইয়াম ছিলেন কূফার অধিবাসী। আবূ মারইয়ামের নাম আমর ইবনু মুররা আল-জুহানী।",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1334,
			"arabicnumber": 1334,
			"text": "১৩৩৪। আবদুর রাহমান ইবনু আবূ বাকরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, উবাইদুল্লাহ ইবনু আবূ বাকরা একজন বিচারক ছিলেন। আমার আব্বা তাকে লিখে পাঠালেন, তুমি উত্তেজিত অবস্থায় কখনো দুই পক্ষের মধ্যে বিচারকার্য সমাধা করবে না। কেননা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে আমি বলতে শুনেছিঃ বিচারক রাগের অবস্থায় যেন দুই পক্ষের মধ্যে বিচারকার্য পরিচালনা না করে। সহীহ, ইবনু মা-জাহ (২৩১৬), নাসা-ঈ এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। আবূ বাকরা (রাঃ)-এর নাম নুফাই।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1335,
			"arabicnumber": 1335,
			"text": "১৩৩৫। মুআয ইবনু জাবাল (রাঃ) হতে বর্ণিত আছে, তিনি বলেছেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে ইয়ামানে পাঠান। আমি রাওনা হলে তিনি আমার পিছনে এক ব্যক্তিকে পাঠিয়ে আমাকে ফিরিয়ে আনলেন। তিনি আমাকে বললেনঃ তুমি কি বুঝেছো আমি তোমাকে ডাকার জন্য কেন লোক পাঠালাম? তিনি বললেন, আমার অনুমতি ব্যতীত তুমি (লোকদের নিকট হতে উপহার হিসেবে) কিছু নিবে না। কেননা এটা আত্মসাৎ৷ যে ব্যক্তি আত্মসাৎ করবে সে কিয়ামতের দিন আত্মসাতের মালসহ হাযির হবে। আমি তোমাকে এটা জানাবার উদ্দেশ্যে ডেকেছি। এখন নিজের কাজে রাওনা হয়ে যাও। সনদ দুর্বল এ অনুচ্ছেদে আদী ইবনু আমীরাহ বুরাইদা, মুসতাওরিদ ইবনু শাদাদ, আবূ হুমাইদ ও ইবনু উমার (রাঃ) হতেও হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, মুয়ায (রাঃ) বর্ণিত হাদীসটি গারীব। আবূ উসামা হতে দাউদ আল-আওদীর সূত্রেই শুধু আমরা এ হাদীস জেনেছি।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1336,
			"arabicnumber": 1336,
			"text": "১৩৩৬। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, বিচারের ক্ষেত্রে ঘুষখোর ও ঘুষ প্রদানকারীকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অভিসম্পাত করেছেন। সহীহ, ইবনু মা-জাহ (২৩১৩) আবদুল্লাহ ইবনু আমর, আইশা, ইবনু হাদীদা ও উম্মু সালামা (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। আবূ সালমার সূত্রে আবদুল্লাহ ইবনু আমর (রাঃ) হতেও উল্লেখিত হাদীসটি বর্ণিত আছে। আবূ সালামা-তার আব্বা আবদুর রাহমানের সূত্রেও রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এ হাদীসটি বর্ণিত আছে, কিন্তু তা সহীহ নয়। আমি আবদুল্লাহ ইবনু আবদুর রাহমানকে বলতে শুনেছিঃ এই অনুচ্ছেদের আওতাভুক্ত হাদীসসমূহের মধ্যে আবূ সালামা কর্তৃক আবদুল্লাহ ইবনু আমর (রাঃ)-এর সূত্রে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত হাদীসটি সর্বোত্তম ও সর্বাধিক সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1337,
			"arabicnumber": 1337,
			"text": "১৩৩৭। আবদুল্লাহ ইবনু আমর (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, ঘুষ গ্রহণকারী ও ঘুষ প্রদানকারী দুজনকেই রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অভিসম্পাত করেছেন। সহীহ, প্রাগুক্ত এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1338,
			"arabicnumber": 1338,
			"text": "১৩৩৮। আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ বকরীর পায়ের একটি খুরও যদি আমাকে উপহার হিসেবে দেওয়া হয়, আমি সেটা অবশ্যই গ্রহণ করব। আমাকে যদি তা খাওয়ার আমন্ত্রণ জানানো হয় তবে আমি তাতে সাড়া দিব। সহীহ, সহীহুল জা-মি’ মুখতাসার শামা-ইলুল মুহাম্মাদিয়া (২৯০), বুখারী আলী, আইশা, মুগীরা ইবনু শুবা, সালমান, মুআবিয়া ইবনু হাইদা ও আবদুর রাহমান ইবনু আলকামা (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আনাস (রাঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1339,
			"arabicnumber": 1339,
			"text": "১৩৩৯। উম্মু সালামা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা আমার নিকট ঝগড়া বিবাদ সমাধানের উদ্দেশ্যে এসে থাক। আমিও একজন মানুষ। হয়ত তোমাদের কোন লোক অন্য কারো তুলনায় (নিজের যুক্তি-প্রমাণ পেশে) অত্যন্ত বাকপটু হয়ে থাকবে। সুতরাং আমি তোমাদের মধ্যে কোন ব্যক্তির অনুকূলে তার ভাইয়ের প্রাপ্য কোন অংশ দিয়ে দিতে পারি। এরকম পরিস্থিতিতে আমি যেন তার জন্য জাহান্নামের একটি টুকরাই তাকে দিয়ে দিচ্ছি। অতএব সে যেন (আসল বিষয় জানা থাকলে) এর কোন কিছুই গ্রহন না করে। সহীহ, ইবনু মা-জাহ (২৩১৭), মুসলিম আবূ হুরাইরা ও আইশা (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। উম্মু সালামা (রাঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1340,
			"arabicnumber": 1340,
			"text": "১৩৪০। আলকামা ইবনু ওয়াইল (রাঃ) হতে তার বাবার সূত্রে বর্ণিত আছে, তিনি বলেন, হাযরামাওত এলাকার একজন লোক এবং কিন্‌দার একজন লোক এসে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট হাযির হল। হাযরামী বলল, হে আল্লাহর রাসূল! আমার অল্পকিছু জমি জোরপূর্বক এই লোক দখল করে নিয়েছে। কিনদী বলল, সেটা আমার জমি, আমার দখলেই আছে, সেটাতে তার কোন মালিকানা নেই। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হাযরামীকে বললেনঃ তোমার কাছে কোন প্রকারের সাক্ষী-প্রমাণ আছে কি? সে বলল, না। তিনি বললেনঃ তাহলে তোমাকে তার শপথের উপর নির্ভর করতে হবে। সে বলল, হে আল্লাহর রাসূল! এ লোকটি তো বদমাইশ, যে কোন ব্যাপারে শপথ করতে তার কোন দ্বিধা নেই, কোন কিছুতেই তার ভীতি-বিহব্বলতা নেই। তিনি বললেনঃ এটা ব্যতীত তোমার আর কোন উপায় নেই। বর্ণনাকারী বলেন, কিনদী শপথের উদ্দেশ্যে এগিয়ে আসলে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ যদি অন্যায়ভাবে তার সম্পদ আত্মসাতের উদ্দেশ্যে সে মিথ্যা শপথ করে তবে সে এমনভাবে আল্লাহর সামনে উপস্থিত হবে যে, আল্লাহ্ তা'আলা তার হতে (অসন্তোষে) মুখ সরিয়ে নিবেন। সহীহ, ইরওয়া (২৬৩২), মুসলিম উমার, ইবনু আব্বাস, আবদুল্লাহ ইবনু আমর ও আশআস ইবনু কাইস (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। ওয়াইল ইবনু হুজর (রাঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1341,
			"arabicnumber": 1341,
			"text": "১৩৪১। আমর ইবনু শুআইব (রাহঃ) হতে পর্যায়ক্রমে তার বাবা ও দাদার সূত্রে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার এক ভাষণে বলেছেনঃ বাদীর দায়িত্ব হচ্ছে সাক্ষী-প্রমাণ হাযির করা এবং বিবাদীর দায়িত্ব হচ্ছে শপথ করা। সহীহ, ইরওয়া (৮/২৬৫-২৬৭) এ হাদীসের সনদকে আবূ ঈসা সমালোচিত বলেছেন। বর্ণনাকারী মুহাম্মাদ ইবনু উবাইদুল্লাহ আরযামীর স্মরণ-শক্তি দুর্বল। তাকে ইবনুল মুবারাক ও অন্যান্যরা দুর্বল বর্ণনাকারী বলে আখ্যায়িত করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1342,
			"arabicnumber": 1342,
			"text": "১৩৪২। ইবনু আব্বাস (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এরকম রায় প্রদান করেছেন যে, বিবাদীকে শপথ করতে হবে। সহীহ, ইরওয়া (২৬৪১), নাসা-ঈ এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। এ হাদীস অনুযায়ী রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সাহাবীগণ ও অন্যান্যরা আমল করার পক্ষে অভিমত ব্যক্ত করেছেন। তাদের মতে বাদীকে সাক্ষী-প্রমাণ উপস্থিত করতে হবে এবং বিবাদীকে শপথ করতে হবে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1343,
			"arabicnumber": 1343,
			"text": "১৩৪৩। আবু হুরায়রা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, একজন সাক্ষী ও শপথের উপর নির্ভর করে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রায় প্রদান করেছেন। সহীহ, ইরওয়া (৮/৩০০-৩০৫), তানকীল (২/১৫৬), রাওজুননাযীর (৯৮৬), মুসলিম (অধঃস্তন বর্ণনাকারী) রাবীআ বলেন, সা’দ ইবনু উবাদার এক ছেলে আমাকে জানিয়েছেন এবং বলেছেন, সাদের কিতাবে আমরা লিখিত অবস্থায় পেয়েছি যে, একজন সাক্ষী ও শপথের উপর নির্ভর করে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রায় প্রদান করেছেন। সহীহ দেখুন পূর্বের হাদীস আলী, জাবির, ইবনু আব্বাস ও সুররাক (রাঃ) হতেও এ অনুচ্ছেদে হাদিস বর্ণিত আছে। আবূ হুরায়রা (রাঃ) এর হাদিসটিকে আবূ ঈসা হাসান গারীব বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1344,
			"arabicnumber": 1344,
			"text": "১৩৪৪। জাবির (রাঃ) হতে বর্ণিত আছে, একজন সাক্ষী ও শপথের উপর নির্ভর করে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মোকদ্দমার সমাধান করেছেন। সহীহ, দেখুন পূর্বের হাদীস",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1345,
			"arabicnumber": 1345,
			"text": "১৩৪৫। জাফর ইবনু মুহাম্মাদ (রহঃ) হতে তার বাবার সূত্রে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একজন সাক্ষীর সাথে (তাকে) শপথের উপর নির্ভর করে মোকদ্দমার সমাধান করেছেন। বর্ণনাকারী বলেন, তোমাদের মাঝে আলী (রাঃ)-ও এরকমভাবেই মোকদ্দমার সমাধান করেছেন। সহীহ, দেখুন পূর্বের হাদীস এ সূত্রটিকে আবূ ঈসা অনেক বেশি সহীহ বলেছেন। একইভাবে এ হাদীসটিকে সুফিয়ান সাওরী-জাফর ইবনু মুহাম্মাদ হতে, তিনি তার বাবার সূত্রে মুরসাল হিসেবে বর্ণনা করেছেন। আবদুল আযীয ইবনু আবূ সালামা ও ইয়াহইয়া ইবনু সুলাইম এই হাদীস জাফরের সূত্রে, তার পিতা হতে, আলী (রাঃ)-এর বরাতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেছেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের একদল সাহাবী ও অন্যান্যদের মতে এ হাদীস অনুযায়ী আমল করতে হবে। তাদের মতে অধিকার ও মাল সম্পর্কিত মোকদ্দমায় একজন সাক্ষী এবং শপথের উপর ভিত্তি করে ফায়সালা দেয়া জায়িয। এই মত দিয়েছেন ইমাম মালিক, শাফিঈ, আহমাদ ও ইসহাক। তারা বলেছেন, শুধু অধিকার ও মাল সম্পর্কিত ব্যাপারেই একজন সাক্ষীর সাক্ষ্যের সাথে শপথের উপর ভিত্তি করে রায় দেয়া যাবে। শুধু একজন সাক্ষী ও শপথের উপর নির্ভর করে কোন মোকদ্দমার রায় প্রদান করাটা কিছু কূফাবাসী (হানাফী) ও অন্যদের মতে জায়িয নয়।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1346,
			"arabicnumber": 1346,
			"text": "১৩৪৬৷ ইবনু উমর (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ শরীকানা গোলামের মালিকদের কোন মালিক যদি নিজের প্রাপ্য অংশকে মুক্ত করে দেয় এবং তার নিকট গোলামের ন্যায়সংগত মূল্যের সমপরিমাণ সম্পদ থাকে সে সম্পূর্ণভাবে মুক্ত হয়ে যাবে, অন্যথায় সে যেটুকু পরিমাণ মুক্ত করেছে সেটুকু পরিমাণই স্বাধীন হবে। সহীহ, ইবনু মা-জাহ (২৫২৮), নাসা-ঈ আইয়ুব বলেন, নাফি কখনো বলেছেনঃ “অন্যথায় সে যেটুকু পরিমাণ মুক্ত করেছে সেটুকু পরিমাণ মুক্ত হবে”। ইবনু উমর (রাঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের এ হাদীসটি সালিমও তার বাবার সূত্রে বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1347,
			"arabicnumber": 1347,
			"text": "১৩৪৭। সালিম (রহঃ) হতে তার বাবার সূত্রে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ শরীকানা গোলামের ক্ষেত্রে কোন লোক তার নিজের অংশকে মুক্ত করে দিলে এবং তার নিকট গোলামটির মূল্যের সমপরিমাণ মাল থাকলে সে তার (মুক্তকারী মালিকের) মালের সাহায্যে সম্পূর্ণরূপে মুক্ত হয়ে যাবে। সহীহ, প্রাগুক্ত এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1348,
			"arabicnumber": 1348,
			"text": "১৩৪৮। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন শরীকানা গোলামের ক্ষেত্রে কোন লোক তার নিজের অংশকে মুক্ত করলে তাকে তার বাকি অংশটুকুও মুক্ত করে দিতে হবে- তার যদি সেরকম আর্থিক সামর্থ থাকে। তার আর্থিক সামর্থ্য না থাকলে তবে ইনসাফের ভিত্তিতে তার ন্যায্য মূল্য ঠিক করতে হবে। তারপর সে যতটুকু পরিমাণে মুক্ত হতে পারেনি সেটুকু পরিমাণ মূল্য (কায়িক শ্রমের মাধ্যমে) পরিশোধের চেষ্টা করতে হবে। কিন্তু তাকে দিয়ে সামর্থ্যের বেশি কষ্টদায়ক কাজ করানো যাবে না। সহীহ, প্রাগুক্ত ইবনু মা-জাহ (২৫২৭), নাসা-ঈ আবদুল্লাহ ইবনু আমর (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। সাঈদ ইবনু আবূ আরূবা হতেও এরকম বর্ণিত হয়েছে। এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। আবান ইবনু ইযায়ীদ কাতাদা হতে সাঈদ ইবনু আরুবার বর্ণনার মতই বর্ণনা করেছেন। এ হাদীসটিকে শুবা কাতাদার সূত্রে বর্ণনা করেছেন কিন্তু এতে পরিশ্রম করানোর কথা উল্লেখ নেই। আলিমদের মধ্যে এ ধরণের গোলাম দিয়ে পরিশ্রম করানোর ব্যাপারে মতপার্থক্য আছে। একদল আলিমের মতে, মুক্ত করার উদ্দেশ্যে তাকে দিয়ে পরিশ্রম করানো বৈধ। এই মত দিয়েছেন সুফিয়ান সাওরী ও কূফাবাসী আলিমগণ। ইসহাকও এই মতের সমর্থক। অপর একটি দল বলেছেন, একজন ক্রীতদাসের যদি দুজন মালিক থাকে এবং একজন মালিক তার প্রাপ্য অংশকে মুক্ত করে দিলে তার (মুক্তকারীর) যদি আর্থিক সামর্থ্য থাকে, তবে সে অন্য মালিককে ক্ষতিপূরণ প্রদান করবে এবং নিজের মালের পরিবর্তে তাকে মুক্ত করবে। তার যদি এরকম আর্থিক সামর্থ্য না থাকে তবে উক্ত গোলামের যেটুকু পরিমাণ মুক্ত করা হয়েছে সেটুকু পরিমাণ মুক্ত বলে গণ্য হবে। কিন্তু তাকে কাজে খাটিয়ে তার মজুরি অন্য মালিককে দেওয়ার মাধ্যমে তাকে মুক্ত করার এ পদ্ধতিটি সঠিক নয়। আলিমগণের এই দল ইবনু উমার (রাঃ)-এর হাদীসের সমর্থক। মদীনার আলিমদেরও এই অভিমত। ইমাম মালিক, শাফিঈ, আহমাদ ও ইসহাক (রাহঃ) এই মতের সমর্থক।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1349,
			"arabicnumber": 1349,
			"text": "১৩৪৯। সামুরা (রাঃ) হতে বর্ণিত আছে, আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসল্লাম বলেছেনঃ জীবন-স্বত্ব প্রদান করা (আজীবনের জন্য কিছু দান করা) জায়িয, যে লোককে এটা প্রদান করা হবে তার জন্য অথবা (তিনি বলেন) তা তার উত্তরাধিকারগণের জন্য উত্তরাধিকার স্বত্ব হিসাবে গণ্য। সহীহ, মুসলিম (৫/৬৯,৭০), জাবির ও আবূ হুরাইরাহ হতে। যাইদ ইবনু সাবিত, জাবির, আবু হুরায়রা, আইশা, আব্দুল্লাহ ইবনু যুবাইর ও মুআবিয়া (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1350,
			"arabicnumber": 1350,
			"text": "১৩৫০। জাবির ইবনু আবদুল্লাহ (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন লোককে জীবন-স্বত্ব প্রদান করা হলে সেটা তার এবং তার উত্তরাধিকারীদের জন্য। যে লোককে তা প্রদান করা হয়েছে উহা তার জন্যই, তা দাতার দিকে ফিরে আসবে না। কেননা সে এমন দান করেছে যার উপর দান গ্রহীতার উত্তরাধিকার স্বত্ব প্রতিষ্ঠিত হয়েছে। সহীহ, ইবনু মা-জাহ (২৩৮০), মুসলিম এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। হাদীসটি মামার এবং আরও অনেকে যুহরী হতে মালিকের বর্ণনার মতই বর্ণনা করেছেন। কেহ কেহ যুহরী হতে বর্ণনা করেছেন তবে “ওয়ালিআকিবিহি” (তার উত্তরাধিকারীদের জন্য) শব্দের উল্লেখ নেই। জাবির (রাঃ) হতে একাধিক সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত হয়েছে তিনি বলেছেন, “জীবন স্বত্ব জায়িয যে লোককে প্রদান করা হয়েছে তার জন্য। এই বর্ণনায় “লিআকিবিহী” শব্দের উল্লেখ নেই। এ হাদীসটি হাসান সহীহ এ হাদীস অনুযায়ী একদল আলিম আমল করেন। তারা বলেন, কোন লোক যখন বলে, এটা তোমার জন্য তোমার সারা জীবনের জন্য এবং তোমার পরবর্তীদের জন্য, তখন তা গ্রহীতার মালিকানায় এসে যায়। জীবন-স্বত্ব প্রদানকারীর মালিকানায় তা আর ফিরে যায় না। যদি সে একথা না বলেঃ এটা তোমার পরবর্তীদের জন্যও, তবে এক্ষেত্রে গ্রহীতার মারা যাবার পর তা দাতার মালিকানায় এসে পরবে। এই মত দিয়েছেন ইমাম মালিক ও শাফিঈ। কয়েকটি সূত্রে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ \"জীবন-স্বত্ব জায়িয-এটা যে লোককে প্রদান করা হয়েছে তার\"। এ বর্ণনায় “লিআকিবিহি” শব্দের উল্লেখ নেই। এ হাদীস অনুযায়ী একদল আলিম আমল করেছেন। তারা বলেছেন, যে লোককে জীবন-স্বত্ব প্রদান করা হয়েছে তার মৃত্যুর পর তার উত্তরাধিকারীগণ এর মালিক হবে, জীবন-স্বত্ব প্রদানকারী- এটা তোমার পরবর্তীদের জন্যও -এ কথা না বলে থাকলেও। সুফিয়ান সাওরী, আহমাদ ও ইসহাকেরও এই অভিমত।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1351,
			"arabicnumber": 1351,
			"text": "১৩৫১। জাবির (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তিকে জীবন-স্বত্ব দেওয়া হয়েছে সেটা তার জন্য হালাল। যে ব্যক্তিকে রুকবা দেওয়া হয়েছে সেটা তার জন্য হালাল। সহীহ, ইবনু মা-জাহ (২৩৮৩), মুসলিম এ হাদীসটিকে আবূ ঈসা হাসান বলেছেন। এটা জাবির (রাঃ) হতে অন্য একটি সূত্রে মাওকৃফভাবেও বর্ণিত হয়েছে। এ হাদীস অনুযায়ী রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের একদল সাহাবী ও তৎপরবর্তী একদল আলিম আমল করেছেন। তাদের মতে জীবন-স্বত্বের মতো রুকবাও জায়িয। এই মত দিয়েছেন ইমাম আহমাদ ও ইসহাকও। জীবন-স্বত্ব ও রুকবার মধ্যে কূফার একদল আলিম পার্থক্য সৃষ্টি করেছেন। জীবন-স্বত্ব তারা জায়িয ভাবলেও রুকবা জায়িয হিসেবে মনে করেন না। আবূ ঈসা বলেন রুকবার ব্যাখ্যা এই যেঃ দাতা (গ্রহণকারীকে) বলল, তোমার জীবিত থাকাকাল পর্যন্ত এটা তোমার। আমার পূর্বেই তুমি মৃত্যু বরণ করলে তবে পুনরায় আমি এর মালিক হয়ে যাব (আর তোমার পূর্বে আমি মৃত্যুবরণ করলে তা তোমার অধিনেই রয়ে যাবে)। ইমাম আহমাদ ও ইসহাক বলেনঃ রুকবা হচ্ছে জীবন-স্বত্বের মতই। যে লোককে এটা প্রদান করা হয় শুধুমাত্র সে-ই এর মালিক। গ্রহীতার মৃত্যুর পর তা দাতার নিকট ফিরে আসবে না।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1352,
			"arabicnumber": 1352,
			"text": "১৩৫২। কাসীর ইবনু আবদুল্লাহ ইবনু আমর ইবনু আওফ (রাঃ) হতে পর্যায়ক্রমে তার বাবা ও দাদার সূত্রে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মুসলিমদের একে অপরের সাথে সন্ধি স্থাপন করা জায়িয। কিন্তু বৈধকে অবৈধ অথবা অবৈধকে বৈধ করার মত সন্ধি চুক্তি জায়িয নেই। মুসলিমগণ তাদের একে অপরের মধ্যে স্থিরকৃত শর্তাবলী মেনে চলতে বাধ্য। কিন্তু হালালকে হারাম অথবা হারামকে হালাল করার মত শর্ত বৈধ নয় (তা বাতিল বলে গণ্য হবে)। সহীহ, ইবনু মা-জাহ (২৩৫৩) এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1353,
			"arabicnumber": 1353,
			"text": "১৩৫৩। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের কোন লোকের নিকট যদি তার প্রতিবেশী তার (ঘরের) দেয়ালের সাথে কড়িকাঠ স্থাপনের সম্মতি চায় তবে সে যেন তাকে বারণ না করে। এ হাদীসটি আবূ হুরাইরা (রাঃ) বর্ণনা করলে লোকেরা তাদের মাথা অবনমিত করে। তিনি তখন বললেন, কি ব্যাপার! আমি তোমাদেরকে এ হতে বিমুখ হতে দেখছি কেন? আল্লাহর শপথ! আমি তা তোমাদের কাধের উপর ছুড়ে মারবো। সহীহ, ইবনু মা-জাহ (২৩৩৫), নাসা-ঈ ইবনু আব্বাস ও মুজাম্মি’ ইবনু জারিয়া (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ হুরাইরা (রাঃ) হতে বর্ণিত হাদীসটিকে আবৃ ঈসা হাসান সহীহ বলেছেন। এ হাদীস অনুযায়ী একদল আলিম আমল করেন। ইমাম শাফিঈও এমন কথা বলেছেন। অন্য একদল আলিম বলেছেন, কোন লোকের দেয়ালে তার প্রতিবেশী কড়িকাঠ স্থাপনের ইচ্ছা করলে সেটাতে তার বাধা প্রদানের অধিকার আছে। ইমাম মালিকেরও এই অভিমত। কিন্তু প্রথমোক্ত মতই অনেক বেশি সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1354,
			"arabicnumber": 1354,
			"text": "১৩৫৪। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ এরকমভাবে শপথ করতে হবে যাতে করে তোমার সাখী (প্রতিপক্ষ) তোমার প্রতি বিশ্বাস স্থাপন করতে পারে। সহীহ, ইবনু মা-জাহ (২১২১), মুসলিম এ হাদীসটিকে আবূ ঈসা হাসান গারীব বলেছেন। আমরা এটিকে শুধু উপরোক্ত (হুশাইম-আবদুল্লাহ) সূত্রেই জেনেছি। আব্দুল্লাহ ইবনু আবী সালিহ, সুহাইল ইবনু আবী সালিহের ভাই। এ হাদীস অনুযায়ী একদল বিশেষজ্ঞ আলিম আমল করেছেন। একই কথা বলেছেন ইমাম আহমাদ ও ইসহাকও। ইবরাহীম নাখঈ বলেন, যে লোক শপথ করতে বাধ্য করে সে যদি অত্যাচারী হয় তাহলে এক্ষেত্রে শপথকারীর নিয়্যাতই নির্ভরযোগ্য বলে বিবেচিত হবে। অপরদিকে যে লোক শপথ করায় সে লোক যদি অত্যাচারিত হয় তবে তার নিয়্যাতই গ্রহণযোগ্য বলে বিবেচিত হবে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1355,
			"arabicnumber": 1355,
			"text": "১৩৫৫। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ সাত হাত প্রশস্ত করে রাস্তা তৈরী কর। সহিহ ইবনু মা-জাহ (২৩৩৮)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1356,
			"arabicnumber": 1356,
			"text": "১৩৫৬। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ রাস্তার ব্যাপারে তোমাদের মতভেদ হলে তা সাত হাত পরিমাণ (প্রশস্ত) কর। সহীহ, বুখারী (২৪৭৩), এ হাদীসটিকে আবূ ঈসা ওয়াকীর হাদীসের চেয়ে অনেক বেশি সহীহ বলেছেন। ইবনু আব্বাস (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ হুরাইরা (রাঃ) হতে বুশাইর ইবনু কাব আল-আদাবী (রহঃ) কর্তৃক বর্ণিত হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। উক্ত হাদীসটি অন্য একটি সূত্রেও কেউ কেউ কাতাদা হতে, তিনি বাশীর ইবনু নাহীক হতে, তিনি আবূ হুরাইরা (রাঃ)-এর সূত্রে বর্ণনা করেছেন, কিন্তু এর সনদ সুরক্ষিত নয়।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1357,
			"arabicnumber": 1357,
			"text": "১৩৫৭। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একটি ছেলেকে তার আব্বা ও আম্মা উভয়ের যে কোন একজনকে বেছে নেওয়ার স্বাধীনতা প্রদান করেন। সহীহ, ইবনু মা-জাহ (২৩৫১) আবদুল্লাহ ইবনু আমর ও আবদুল হামীদ ইবনু জাফরের দাদা হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ হুরাইরা (রাঃ) বর্ণিত হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। আবূ মাইমুনার নাম সুলাইম। এ হাদীস অনুযায়ী রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের একদল বিশেষজ্ঞ সাহাবী ও তৎপরবর্তী একদল আলিম আমল করেছেন। তারা বলেছেন, আব্বা-আম্মার মধ্যে যদি সন্তানকে কেন্দ্র করে ঝগড়ার সৃষ্টি হয় তবে সন্তানকে স্বাধীনতা প্রদান করতে হবে। সে যাকে পছন্দ করবে তার সাথে থাকবে। ইমাম আহমাদ ও ইসহাকেরও এই মত। তারা উভয়ে বলেছেন, সন্তান ছোট হলে তার লালন-পালনের জন্যে মাই বেশি হাকদার। সে যখন সাত বছরে পৌছাবে তখন তাকে স্বাধীনতা দিতে হবে (সে যার সাথে থাকার ইচ্ছা করবে তার সাথে থাকবে)। হিলাল ইবনু আবূ মাইমূনার আব্বা আলী এবং দাদা উসামা। তিনি মদীনার অধিবাসী। ইয়াহইয়া ইবনু আবূ কাসীর, মালিক ইবনু আনাস ও ফুলাইহ ইবনু সুলাইমান তার সূত্রে হাদীস বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1358,
			"arabicnumber": 1358,
			"text": "১৩৫৮। আইশা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের নিজেদের উপার্জনই সর্বোত্তম জীবিকা। তোমাদের সন্তানগণও তোমাদের নিজস্ব উপার্জন। সহীহ, ইবনু মা-জাহ (২১৩৭) জাবির ও আবদুল্লাহ ইবনু আমর (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। এ হাদীসটি কোন কোন বর্ণনাকারী উমারা ইবনু উমাইর-তার মাতার সূত্ৰে-আইশা (রাঃ) হতে বর্ণনা করেছেন, কিন্তু তাদের বেশিরভাগই মাতার পরিবর্তে ফুফু বলেছেন। এ হাদীস অনুযায়ী রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের একদল সাহাবী ও অপরাপর আলিম আমল করেছেন। তারা বলেছেন, পিতার হাত সন্তানের সম্পদের উপর সম্প্রসারিত। সে যতটুকু ইচ্ছা তা হতে নিতে পারে। তাদের অন্য এক দল বলেছেন, পিতা যেন শুধু প্রয়োজনের সময়ই সন্তানের সম্পদ হতে নেয়। প্রয়োজন ব্যতীত সে তার মালে হস্তক্ষেপ করতে পারবে না।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1359,
			"arabicnumber": 1359,
			"text": "১৩৫৯। আনাস (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের একজন স্ত্রী তাকে একটি বাটিতে কিছু খাবার পাঠান। আইশা (রাঃ) নিজের হাত দিয়ে বাটিতে আঘাত করে খাবারগুলো ফেলে দেন এবং বাটিও ভেঙ্গে যায়। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ খাদ্যের জন্য খাবার এবং বাটির জন্য একটি বাটি প্রদান করতে হবে। সহীহ, ইবনু মা-জাহ (২৩৩৪) এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1360,
			"arabicnumber": 1360,
			"text": "১৩৬০। আনাস (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একটি বাটি ধার করে এনেছিলেন। তারপর সেটা ভেঙ্গে গেল (অথবা হারিয়ে গেল)। তিনি বাটির মালিককে ক্ষতিপূরণ দিয়েছেন। সনদ খুবই দুর্বল আবূ ঈসা বলেন, এ হাদীসটি সুরক্ষিত নয়। আমার ধারণামতে সুআইদ পূর্বোক্ত সাওরী বর্ণিত হাদীসটিই বর্ণনা করতে চেয়েছিলেন (কিন্তু সেটা সম্পূর্ণভাবে তার মনে ছিল না তাই তিনি এই হাদীসটি মিলিয়ে ঝুলিয়ে বর্ণনা করেছেন)। এ ক্ষেত্রে সুফিয়ান সাওরীর হাদীসটিই অনেক বেশী সহীহ। আবূ দাউদের নাম উমার, পিতার নাম সাদ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Very Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Very Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1361,
			"arabicnumber": 1361,
			"text": "১৩৬১। ইবনু উমার (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমাকে কোন এক সামরিক অভিযানে যাওয়ার সময় রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সামনে হাযির করা হয়। তখন আমার বয়স ছিল চৌদ বছর। তিনি আমাকে (সৈনিক হিসাবে) গ্রহণ করেননি। এর পরের বছর এক সামরিক অভিযানে যাওয়ার সময় আমাকে আবার তার সামনে হাযির করা হয়। তখন আমার বয়স ছিল পনের বছর। এবার তিনি আমাকে সেনাবাহিনীতে নিয়ে নিলেন। নাফি (রাহঃ) বলেন, আমি এ হাদীসটি উমার ইবনু আবদুল আযীয (রহঃ)-এর নিকট বর্ণনা করলে তিনি বলেনঃ এটাই হল নাবালেগ ও বালেগের মধ্যকার বয়সসীমা। তারপর তিনি লিখিত নির্দেশ প্রদান করলেন- যে পনের বছর বয়সে পৌছেছে তার ভাতা নির্ধারণের জন্য। সহীহ, বুখারী (২৬৬৪, ৬/৩০) ইবনু উমার হতে, তিনি নাফি হতে এই সূত্রেও ইবনু উমর (রাঃ) হতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের উপরের হাদীসের মত হাদীস বর্ণিত হয়েছে। কিন্তু এ কথাটুকু এই সূত্রে উল্লেখ নেইঃ উমার ইবনু আবদুল আযীয (রহঃ) লিখে পাঠালেন, এটাই বালেগ ও নাবালেগের মধ্যকার বয়সসীমা। একথাই ইবনু উআইনা তার হাদীসের মধ্যে উল্লেখ করেছেনঃ আমি এ হাদীসটিকে উমার ইবনু আবদুল আযীযের সামনে বর্ণনা করলে তিনি বলেন, এটাই হচ্ছে নাবালেগ ও সৈনিকের মধ্যে বয়সসীমা।এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। এ হাদীস অনুযায়ী বিশেষজ্ঞ আলিমগণ আমল করেছেন। এরকম মতই সুফিয়ান সাওরী, ইবনুল মুবারাক, শাফিঈ, আহমাদ ও ইসহাক (রাহঃ)-এর। তাদের মতে, নাবালেগ সন্তান পনের বছরে পৌছার সাথে সাথে বালেগদের মধ্যে গণ্য হবে। পনের বছরের পূর্বেই যদি স্বপ্লদোষ হয় তবে সে বলেগ বলে গণ্য হবে। আহমাদ ও ইসহাক বলেছেন, বালেগ হওয়ার জন্য তিনটি বিকল্প নিদর্শন রয়েছে, পনের বছর বয়স হওয়া; ইহতিলাম (বীর্যপাত) হওয়া; যদি এরকম হয় যে, বয়সও অনুমান করা যাচ্ছে না আবার ইহতিলামও হয় না এক্ষেত্রে লজ্জাস্থানে লোম গজানোকে ধরে নিতে হবে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1362,
			"arabicnumber": 1362,
			"text": "১৩৬২। বারাআ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমার মামা আবূ বুরদা (রাঃ) আমার নিকট দিয়ে যাচ্ছিলেন। তার হাতে একটি পতাকা ছিল। আমি তাকে প্রশ্ন করলাম, কোথায় যাচ্ছেন? তিনি বললেন, এক লোক তার বাবার স্ত্রীকে (সৎমাকে) বিয়ে করেছে। আমাকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পাঠিয়েছেন তার মাথা কেটে তার নিকট আনার জন্য। - সহীহ, ইবনু মা-জাহ (২৬০৭) কুররা আল-মুযানী (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। বারাআ (রাঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা হাসান গারীব বলেছেন। মুহাম্মদ ইবনু ইসহাক আদী ইবনু সাবিত হতে, তিনি আব্দুল্লাহ ইবনু ইয়াযীদ হতে তিনি বারাআ হতে, হাদীসটি বর্ণনা করেছেন। এই হাদীসটি তার পিতা হতে এই সূত্রেও বর্ণিত আছে। ইয়াযীদ ইবনু বারাআ তার মামা হতে তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এই সূত্রেও বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1363,
			"arabicnumber": 1363,
			"text": "১৩৬৩। উরওয়া (রহঃ) হতে বর্ণিত আছে, আবদুল্লাহ ইবনুয যুবাইর (রাঃ) তাকে বলেছেন, হাররা হতে বয়ে আসা নালার পানির বণ্টনকে কেন্দ্র করে যুবাইর (রাঃ)-এর বিরুদ্ধে একজন আনসার রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট অভিযোগ উত্থাপন করে। এ নালার পানি তারা খেজুর বাগানেও সিঞ্চন করতেন। আনসারী দাবি করল, পানি প্রবাহিত হতে দাও। কিন্তু যুবাইর (রাঃ) তা অস্বীকার করেন। তারা এই বিবাদকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সামনে উপস্থাপন করল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যুবাইর (রাঃ)-কে বললেনঃ হে যুবাইর! তোমার ক্ষেতে পানি প্রবাহিত কর, তারপর তোমার প্রতিবেশীর ক্ষেতের দিকে তা প্রবাহিত হতে দাও। আনসারী এতে ক্রোধান্বিত হয়ে বলল, আপনার ফুফাত ভাই তো! এ কথায় রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের মুখমণ্ডল রক্তিমবর্ণ ধারণ করল। তিনি বললেনঃ হে যুবাইর তোমার ক্ষেতে পানি প্রবাহিত কর, তারপর তা আটক করে রাখ-যাতে তা আইল পর্যন্ত উঠতে পারে। যুবাইর (রাঃ) বলেন, আল্লাহর শপথ! আমার মনে হয় এ প্রসঙ্গেই নিম্নোক্ত আয়াত অবতীর্ণ হয়েছেঃ “না, হে মুহাম্মাদ! তোমার প্রতিপালকের শপথ! এরা কোন অবস্থাতেই ঈমানদার হতে পারে না, যে পর্যন্ত না তাদের পারস্পরিক মতভেদের ব্যাপারসমূহে তোমাকে বিচারকরূপে মেনে না নিবে। তারপর তুমি যে ফায়সালাই করবে তার প্রসঙ্গে তারা নিজেদের মনে কিছুমাত্র কুষ্ঠাবোধ করবে না; বরং নিজেদেরকে এর সামনে সম্পূর্ণভাবে সমর্পণ করবে” (সূরাঃ নিসা-৬৫)। সহীহ, নাসা-ঈ এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। এই হাদীসটি শুআইব ইবনু আবূ হামযা-যুহরী হতে, তিনি উরওয়া হতে, তিনি যুবাইর (রাঃ) হতে এ সনদেও বর্ণিত আছে। তাতে আবদুল্লাহ ইবনুয যুবাইর (রাঃ)-এর উল্লেখ নেই। পূর্বোক্ত হাদীসের মত আবদুল্লাহ ইবনু ওয়াহব-লাইস হতে ও ইউনুস-যুহরী হতে, তিনি উরওয়া হতে, তিনি আবদুল্লাহ ইবনু যুবাইর (রাঃ)হতে এ সূত্রেও বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1364,
			"arabicnumber": 1364,
			"text": "১৩৬৪। ইমরান ইবনু হুসাইন (রাঃ) হতে বর্ণিত আছে, আনসার বংশের একজন লোক মারা যাওয়ার সময় তার ছয়টি গোলামই মুক্ত করে দিল। তার-নিকটে এরা ব্যতীত আর কোন সম্পদ ছিল না। এ খবর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট পৌছানোর পর তিনি তার প্রসঙ্গে কঠোর মন্তব্য করেন। তিনি তারপর গোলামদের ডেকে পাঠালেন এবং তাদেরকে (তিন) ভাগ করে তাদের মধ্যে লটারী করলেন। তিনি সে মোতাবিক দুইজনকে মুক্ত করে দিলেন এবং বাকি চারজনকে গোলাম হিসাবে রেখে দিলেন। সহীহ, ইবনু মা-জাহ (২৩৪৫), মুসলিম আবূ হুরাইরা (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। ইমরান ইবনু হুসাইন (রাঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। এ হাদীসটি ইমরান (রাঃ) হতে একাধিক সূত্রে বর্ণিত হয়েছে। এ হাদীস অনুযায়ী একদল বিশেষজ্ঞ আলিম আমল করেছেন। এ প্রসঙ্গে বা অন্য কোন ব্যাপারে লটারী করে ঠিক করে নিতে হবে বলে মালিক, শাফিঈ, আহমাদ ও ইসহাক মত প্রকাশ করেছেন। কিন্তু লটারীর পক্ষে রায় প্রদান করেননি কূফাবাসী কিছু আলিম। তাদের মতে, এক্ষেত্রে প্রতিটি গোলামের তিন ভাগের এক অংশ মুক্ত হবে। অবশিষ্ট দুই ভাগের মুক্তির জন্য তাদের মাধ্যমে কাজ করিয়ে নিতে হবে। আবূল মুহাল্লাবের নাম আবদুর রাহমান ইবনু আমর আলজারমী তিনি আবূ কিলাবা নহেন। মতান্তরে মুআবিয়া, পিতা আমর। আবূ কিলাবা আলজারমীর নাম আব্দুল্লাহ ইবনু যাইদ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1365,
			"arabicnumber": 1365,
			"text": "১৩৬৫। সামুরা (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন লোক যদি তার কোন মাহরাম আত্মীয়ের মালিক হয় তাহলে সে (দাসত্ব হতে) স্বয়ং স্বাধীন হয়ে যাবে। সহীহ, ইবনু মা-জাহ (২৫২৪) আবূ ঈসা বলেন, আমরা শুধুমাত্র হাম্মাদ ইবনু সালামার বর্ণনা হতেই এ হাদীস মুসনাদ হিসেবে জেনেছি। এ হাদীসটি কাতাদা হতে হাসানের বরাতে উমর (রাঃ)-এর সূত্রে কিছু বর্ণনাকারী বর্ণনা করেছেন। অন্য আরেকটি সনদেও সামুরা (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন লোক যদি তার কোন মাহরাম আত্মীয়ের (দাসত্ব সূত্রে) মালিক হয় তাহলে সে (দাসত্ব হতে) নিজেই মুক্ত হয়ে যাবে। আবূ ঈসা বলেন, এ হাদীসটি আসিম আল-আহওয়াল হতে হাম্মাদ ইবনু সালামার সূত্রে মুহাম্মাদ ইবনু বাকর ছাড়া আর কেউ বর্ণনা করেছেন বলে আমাদের জানা নেই। এ হাদীস অনুযায়ী একদল আলিম আমল করেছেন। ইবনু উমার (রাঃ) বর্ণনা করেছেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন লোক যদি তার কোন মাহরাম আত্মীয়ের মালিক হয় তাহলে সে নিজেই মুক্ত হয়ে যাবে। উপরোক্ত হাদীসটি যামরা ইবনু রাবীআ-সাওরী হতে, তিনি আবদুল্লাহ ইবনু দীনার হতে, তিনি ইবনু উমর (রাঃ) হতে, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এইসূত্রে বর্ণিত হয়েছে, কিন্তু এক্ষেত্রে যামরার কোন অনুসারী নেই। তাই হাদীস বিশারদগণ মনে করেন এ হাদীসের সনদে ক্রটি আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1366,
			"arabicnumber": 1366,
			"text": "১৩৬৬। রাফি ইবনু খাদীজ (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন সম্প্রদায়ের জমিতে যদি কোন লোক তাদের বিনা অনুমতিতে কৃষিকাজ করে তাহলে সে ফসলের কোন অংশ পাবে না, শুধুমাত্র চাষাবাদের খরচ পাবে। সহীহ, ইবনু মা-জাহ (২৪৬৬) এ হাদীসটিকে আবূ ঈসা উল্লেখিত সনদসূত্রে হাসান গারীব বলেছেন। আমরা আবূ ইসহাকের এই হাদীস প্রসঙ্গে শুধুমাত্র শারীক ইবনু আবদুল্লাহর সনদেই জেনেছি। এ হাদীস অনুযায়ী একদল বিশেষজ্ঞ আলিম আমল করেছেন। একই কথা বলেছেন আহমাদ ও ইসহাকও। আবূ ঈসা বলেন, আমি এ হাদীস প্রসঙ্গে মুহাম্মাদ ইবনু ইসমাঈলকে প্রশ্ন করলে তিনি বলেন, এটা হাসান হাদীস। আমরা আবূ ইসহাকের এ হাদীস প্রসঙ্গে শুধুমাত্র শারীকের সূত্রে জানতে পেরেছি। তিনি আরো বলেন, এটি মাকিল খাদীজ (রাঃ) হতে, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে অনুরূপ বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1367,
			"arabicnumber": 1367,
			"text": "১৩৬৭৷ নুমান ইবনু বাশীর (রাঃ) হতে বর্ণিত আছে, তার আব্বা তার এক ছেলেকে একটি গোলাম প্রদান করেন। তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে এর সাক্ষী করার উদ্দেশ্যে তার নিকট আসেন। তিনি বললেনঃ তুমি তোমার এই সন্তানকে যা দিয়েছ, তোমার অন্য সন্তানদেরকেও কি তা দিয়েছ? তিনি বললেন, না। তিনি (রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বললেনঃ এই দান ফিরিয়ে নাও। সহীহ, ইবনু মা-জাহ (২৩৭৫, ২৩৭৬), নাসা-ঈ এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। এ হাদীসটি আরো কয়েকটি সূত্রে নুমান ইবনু বাশীরের নিকট হতে বর্ণিত হয়েছে। এ হাদীস অনুযায়ী একদল বিশেষজ্ঞ আলিম আমল করেছেন। তারা সন্তানদের মধ্যে সমতা বজায় রাখাকে খুবই পছন্দনীয় বলেছেন। কেউ কেউ এ পর্যন্তও বলেছেন যে, তাদের মধ্যে চুম্বন দেওয়ার ক্ষেত্রেও সমতা বজায় রাখতে হবে। আর একদল বিশেষজ্ঞ আলিম বলেছেন, সন্তানদের মধ্যে উপহার-উপটৌকন প্রদানের ক্ষেত্রে সমতা বজায় রাখতে হবে। এক্ষেত্রে ছেলে ও মেয়েদের মধ্যে ব্যবধান সৃষ্টি করা যাবে না। সুফিয়ান সাওরী এই মত দিয়েছেন। আহমাদ ও ইসহাক (রাহঃ) বলেছেন, মীরাস বণ্টনের নীতি মোতাবেক উপহার-উপটৌকনের ক্ষেত্রেও ছেলে সন্তান মেয়ে সন্তানের দ্বিগুণ পাবে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1368,
			"arabicnumber": 1368,
			"text": "১৩৬৮। সামুরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ বাড়ীর প্রতিবেশী উক্ত বাড়ীর (ক্রয় করার ক্ষেত্রে) প্রাধান্য পাবে। সহীহ, ইরওয়া (১৫৩৯) শারীদ, আবূ রাফি ও আনাস (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। সামুরা (রাঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। ঈসা ইবনু ইউনুস সাঈদ ইবনু আবী আরূবা হতে, তিনি কাতাদা হতে, তিনি আনাস (রাঃ) হতে তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে অনুরূপ হাদীস বর্ণনা করেছেন। সাঈদ কাতাদা হতে, তিনি হাসান হতে, তিনি সামুরা (রাঃ) হতে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এই সূত্রেও হাদীসটি বর্ণিত আছে। হাদীস বিশারদদের মতে সামুরা হতে হাসানের বর্ণনাটিই সঠিক। আনাস হতে কাতাদার বর্ণনাটি শুধুমাত্র ঈসা ইবনু ইউনুসের সূত্রেই জানা যায়। আব্দুল্লাহ ইবনু আব্দুর রহমান আমর ইবনু শারীদ হতে, তিনি তার বাবা হতে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতেও হাদিসটি বর্ণনা করেছেন। ইবরাহীম ইবনু মাইমারী আমর ইবনু শারদ হতে, তিনি আবু রাফি হতে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এইসূত্রে হাদীসটি বর্ণনা করেছেন। উভয় হাদীসকেই ইমাম বুখারী সহীহ বলে মনে করেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 1369,
			"arabicnumber": 1369,
			"text": "১৩৬৯। জাবির (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ প্রতিবেশী তার শুফআর ক্ষেত্রে বেশি হকদার। সে অনুপস্থিত থাকলে তার জন্য অপেক্ষা করতে হবে-যদি উভয়ের যাতায়াতের একই রাস্তা হয়। সহীহ, ইবনু মা-জাহ (২৪৯৪) এ হাদীসটিকে আবূ ঈসা হাসান গারীব বলেছেন। এ হাদীসটিকে আবদুল মালিক ইবনু আবূ সুলাইমান-আতা হতে, তিনি জাবির (রাঃ)-এর সূত্র ছাড়া আর কেউ বর্ণনা করেছেন এমনটি আমাদের জানা নেই। শুবা (রাহঃ) এ হাদীসকে কেন্দ্র করে আবদুল মালিক ইবনু আবূ সুলাইমানের সমালোচনা করেছেন। হাদীস বিশারদদের মতে আবদুল মালিক একজন বিশ্বস্ত ও নির্ভরযোগ্য বর্ণনাকারী। শুবা ব্যতীত আর কেউ উল্লেখিত হাদীসকে কেন্দ্র করে তার সমালোচনা করেছেন কি-না সে সম্বন্ধে আমাদের কোনকিছু জানা নেই। এ হাদীসটি ওয়াকী (রহঃ) শুবার সূত্রে, তিনি আবদুল মালিকের সূত্রে বর্ণনা করেছেন। ইবনুল মুবারাক হতে বর্ণিত আছে, সুফিয়ান সাওরী বলেছেন, আবদুল মালিক ইবনু আবী সুলাইমান হাদীসের জ্ঞানের ক্ষেত্রে মানদণ্ডস্বরূপ। এ হাদীস মোতাবিক অভিজ্ঞ আলিমগণ আমল করেছেন। তারা মনে করেন, শুফআর ক্ষেত্রে প্রতিবেশীই অন্যান্যদের চাইতে বেশি হকদার, সে লোক হাযির না থাকা অবস্থায়ও। সে যখন ফিরবে তখন শুফআর জন্য দাবি করতে পারবে, যদিও অনুপস্থিতির সময় অনেক দীর্ঘ হয়।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 1370,
			"arabicnumber": 1370,
			"text": "১৩৭০। জাবির ইবনু আবদুল্লাহ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যখন সীমানা নির্ধারিত হয়ে যায় এবং রাস্তা আলাদা হয়ে যায় তখন শুফআর আর কোন অধিকার থাকে না। সহীহ, ইবনু মা-জাহ (৩৪৯৯), বুখারী এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। এ হাদীসটিকে কয়েকজন বর্ণনাকারী আবূ সালামার বরাতে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে মুরসাল হিসেবে বর্ণনা করেছেন। এ হাদীস মোতাবিক উমার, উসমান (রাঃ) প্রমুখ সাহাবীগণ আমল করেছেন। এরকমই বলেছেন উমার ইবনু আবদুল আযীয (রাহঃ) এবং আরো কয়েকজন তাবিঈ ও ফিকহবিদ। এই মত দিয়েছেন মদীনার আলিমগণ তথা ও মালিক ইবনু আনাসও। শাফিঈ, আহমাদ ও ইসহাকও একই রকম কথা বলেছেন। তারা সবাই মনে করেন শুফআ শুধুমাত্র শরীকানা সম্পত্তিতেই দাবি করা যায়। প্রতিবেশী অংশীদার না হলে সে শুফআর দাবি তুলতে পারে না। অন্য একদল সাহাবী ও অপরাপর আলিমের মতে, শুফআর জন্য প্রতিবেশী দাবি তুলতে পারে। এই মারফু হাদীসকে তারা দলীল হিসেবে নিয়েছেনঃ (১) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ “প্রতিবেশী (অপর প্রতিবেশীর) ঘর কেনার ক্ষেত্রে অগ্রাধিকার পাবে।\" (২) “তার নিকট অবস্থানের জন্যই প্রতিবেশী (শুফআর) বেশি হকদার”। এই মত দিয়েছেন সুফিয়ান সাওরী, ইবনুল মুবারাক ও কূফাবাসীগন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 1371,
			"arabicnumber": 1371,
			"text": "১৩৭১। ইবনু আব্বাস (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ শারীক শুফআর অধিকারী। প্রতিটা জিনিসেই শুফআ আছে। মুনকার, যঈফা (১০০৯, ১০১০) আবূ ঈসা বলেন, আমরা শুধু আবূ হামযা আস-সুককারীর সূত্রেই এ হাদীস প্রসঙ্গে জেনেছি। একাধিক রাবী আবদুল আযীয ইবনু রুআইফির সূত্রে-ইবনু আবূ মুলাইকার বরাতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে উক্ত হাদীস মুরসাল হিসেবে বর্ণনা করেছেন এবং এটাই সহীহ। হান্নাদ-আবূ বাকর ইবনু আইয়্যাশ হতে তিনি আবদুল আযীয ইবনু রুয়াইফি হতে তিনি ইবনু আবূ মুলাইকী হতে তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে উক্ত মর্মে এরকম হাদীস বর্ণনা করেছেন এবং তাতে “ইবনু আব্বাস (রাঃ) হতে\" সূত্রের উল্লেখ নেই। একইভাবে একাধিক রাবী-আবদুল আযীয ইবনু রুআইফি হতে উক্ত হাদীস বর্ণনা করেছেন এবং তাতেও \"ইবনু আব্বাস (রাঃ) হতে” সূত্রের উল্লেখ নেই। এই হাদিসটি আবু হামযার সুত্রে বর্ণিত হাদিসের তুলনায় বেশী সহিহ মনে হয়। নির্ভরযোগ্য (সিকাহ) রাবী আবূ হামযা ব্যতীত অন্য কারো এই ভুলটি হয়েছে। হান্নাদ-আবূল আহওয়াস হতে তিনি আবদুল আযীয ইবনু রুয়াইফি হতে তিনি ইবনু আবু মুলাইকা হতে তিনি রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে আবূ বাকর ইবনু আইয়্যাশের হাদীসের মতই বর্ণনা করেছেন। বেশিরভাগ বিশেষজ্ঞ আলিমের মতে, শুধুমাত্র ঘর-বাড়ি ও স্থাবর সম্পত্তিতেই শুফআ দাবি করা যাবে। তাদের মতে যে কোন জিনিসেই শুফআ দাবি করা যাবে না।অপর একদল বিশেষজ্ঞ আলিমের মতে যে কোন জিনিসেই শুফআ দাবি করা যায়। কিন্তু প্রথম মতই অনেক বেশী সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Munqar"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 1372,
			"arabicnumber": 1372,
			"text": "১৩৭২। যাইদ ইবনু খালিদ আল-জুহানী (রাঃ) হতে বর্ণিত আছে, এক লোক হারিয়ে যাওয়া জিনিস কুড়িয়ে পাওয়া প্রসঙ্গে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে প্রশ্ন করলে তিনি বললেনঃ এর ঘোষণা প্রদান করতে থাক এক বছর না হওয়া পর্যন্ত। তারপর তুমি এর ফিতা, থলে ও চামড়ার বাক্স এবং এর সংখ্যা সঠিকভাবে চিহ্নিত করে রাখ। তারপর তুমি তা খরচ কর। এর মালিক যদি পরবর্তী কালে চলে আসে তাহলে এটা তাকে ফিরত দিয়ে দিও। লোকটি আবার বলল, হে আল্লাহর রাসূল! হারিয়ে যাওয়া মেষের ক্ষেত্রে কি বিধান রয়েছে? তিনি বললেনঃ এটা ধরে রাখবে। কারণ এটা তোমার অথবা তোমার ভাইয়ের অথবা নেকড়ে বাঘের। সে আবার বলল, হে আল্লাহর রাসূল! হারানো উটের ক্ষেত্রে কি বিধান রয়েছে? বর্ণনাকারী বলেন, এবার রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উত্তেজিত হলেন, এমনকি তার দুই গাল বা মুখমণ্ডল রক্তিমবর্ণ ধারণ করল। তিনি বললেনঃ এতে তোমার মাথা ঘামানোর কি প্রয়োজন? এর সাথে এর খুর এবং পানীয় আছে, অবশেষে এটা (ঘুরতে ঘুরতে) তার মালিকের সাথে গিয়ে মিলিত হবে। সহীহ, ইবনু মা-জাহ (২৫০৪), নাসা-ঈ যাইদ ইবনু খালিদ (রাঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। এ হাদীস যাইদ (রাঃ) হতে আরো কয়েকটি সূত্রে বর্ণিত আছে। যাইদ ইবনু খালিদের বরাতে ইয়াযীদ বর্ণিত হাদীসটিও হাসান সহীহ। এটিও কয়েকটি সূত্রে বর্ণিত হয়েছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 1373,
			"arabicnumber": 1373,
			"text": "১৩৭৩। যাইদ ইবনু খালিদ আল-জুহানী (রাঃ) হতে বর্ণিত আছে, কোন হারানো জিনিস প্রাপ্তি প্রসঙ্গে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে প্রশ্ন করা হলে তিনি বললেনঃ এক বছর না হওয়া পর্যন্ত এর ঘোষণা দিতে থাক। যদি সনাক্তকারী কোন লোক পাওয়া যায় তাহলে তাকে তা ফিরত দাও। এর ব্যতিক্রম হলে তুমি এর থলে ও থলের বন্ধনী সঠিকভাবে চিনে রাখ এবং এর মধ্যকার জিনিস গণনা করার পর কাজে ব্যবহার কর। তারপর মালিক এসে গেলে এটা তাকে ফিরিয়ে দিও। সহীহ, ইবনু মা-জাহ (২৫০৭), নাসা-ঈ আবূ ঈসা বলেন, উবাই ইবনু কাব, আবদুল্লাহ ইবনু উমার, জারূদ ইবনুল মুআল্লা, ইয়ায ইবনু হিমার ও জারীর ইবনু আবদুল্লাহ (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। যাইদ ইবনু খালিদ (রাঃ) হতে বর্ণিত হাদীসটি উল্লেখিত সনদসূত্রে হাসান, সহীহ এবং গারীব। আহমাদ ইবনু হাম্বল (রাহঃ) এ অনুচ্ছেদে এ হাদীসটিকেই অনেক বেশি সহীহ বলেছেন। হাদীসটি যাইদ (রাঃ) হতে একাধিক সূত্রে বর্ণিত হয়েছে। এ হাদীস মোতাবিক নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের একদল সাহাবী ও তৎপরবর্তী আলিমগণ আমল করেছেন। তারা মনে করেন রাস্তায় কুড়িয়ে পাওয়া জিনিসের ক্ষেত্রে এক বছর পর্যন্ত ঘোষণার পরও মালিকের সন্ধান পাওয়া না গেলে তা নিজের কাজে প্রয়োগ করা যায় এই মত প্রকাশ করেছেন ইমাম শাফিঈ, আহমাদ ও ইসহাক। অন্য একদল সাহাবী ও তৎপরবর্তী আলিমগণ বলেছেন, কুড়িয়ে পাওয়া বস্তুর জন্য এক বছর পর্যন্ত ঘোষণা প্রদান করতে হবে। এর মধ্যে মালিক এসে গেলে তাকে তা ফিরত দিতে হবে অন্যথায় সাদকা (দান) করে দিতে হবে। এই মত প্রদান করেছেন সুফিয়ান সাওরী, আবদুল্লাহ ইবনুল মুবারাক ও কূফাবাসী আলিমগণও। তারা মনে করেন, যে লোক হারিয়ে যাওয়া জিনিস কুড়িয়ে পেয়েছে সে যদি সম্পদশালী হয় তবে এটাকে তার কাজে লাগানো বৈধ হবে না। ইমাম শাফিঈ মনে করেন, কুড়িয়ে পাওয়া লোকটি সম্পদশালী হলেও এটা তার কাজে লাগানো বৈধ। কেননা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের জীবদ্দশায় উবাই ইবনু কা'ব (রাঃ) এক শত দীনারের একটি থলে পেয়েছিলেন। তিনি তাকে নির্দিষ্ট মেয়াদকাল ধরে ঘোষণা দেওয়ার পরে এটা কাজে লাগানোর অনুমতি প্রদান করেন। অথচ তিনি একজন সম্পদশালী লোক ছিলেন। আলী (রাঃ)-ও একইভাবে একটি দীনার পেয়েছিলেন। এক বছর পর্যন্ত তিনি এর ঘোষণা করতে থাকেন, কিন্তু কোন লোকই এটার খোজ করল না। এটা কাজে ব্যবহারের জন্য রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে সম্মতি দেন। রাস্তায় কুড়িয়ে পাওয়া জিনিস শুধুমাত্র সাদকা ভোগকারী ব্যতীত অন্য কারো জন্য হালাল না হলে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আলী (রাঃ)-কে এটা কাজে ব্যবহারের জন্য সম্মতি প্রদান করতেন না। কেননা আলী (রাঃ)-এর জন্য সাদকার মাল ভোগ করা হারাম ছিল। কুড়িয়ে পাওয়া জিনিস সামান্য হলে তবে ঘোষণা ব্যতীতই তা ভোগ করাকে একদল আলিম জায়িয বলেছেন। আর অন্য একদল আলিম বলেছেন, এক দীনারের কম পরিমাণ সম্পদ কুড়িয়ে পেলে তবে এক সপ্তাহ পর্যন্ত ঘোষণা করতে হবে। এই মতামতটি প্রদান করেছেন ইসহাক ইবনু ইবরাহীমও।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 1374,
			"arabicnumber": 1374,
			"text": "১৩৭৪। সুয়াইদ ইবনু গাফালাহ (রহঃ) হতে বর্ণিত আছে, তিনি বলেন, আমি কোন এক সময়ে যাইদ ইবনু সূহান ও সালমান ইবনু রাবীআর সাথে যাত্রা করলাম। আমি রাস্তার মধ্যে একটি চামড়ার থলে পেলাম। ইবনু নুমাইরের বর্ণনায় আছেঃ রাস্তাতে পড়ে থাকা একটি চামড়ার থলে তুলে নিলাম। তারা উভয়ে বললেন, এটা রেখে দাও। আমি বললাম, হিংস্র জন্তুর খাবারের উদ্দেশ্যে আমি এটাকে হাতছাড়া করব না। অবশ্যই আমি এটাকে সাথে নিব এবং নিজের কাজে প্রয়োগ করব। তারপর আমি উবাই ইবনু কা'ব (রাঃ)-এর নিকট গেলাম। আমি এ প্রসঙ্গে তাকে প্রশ্ন করলাম এবং ঘটনাটি খুলে বললাম। তিনি বললেন, তুমি ভালই করেছ। আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের আমলে একশত দীনারের একটি থলে পেয়েছিলাম। আমি সেটা সাথে নিয়ে তার কাছে এলে তিনি আমাকে বলেনঃ এটার পরিচয় সহকারে এক বছর পর্যন্ত ঘোষণা করতে থাক। আমি এক বছর পর্যন্ত এর জন্য ঘোষণা দিলাম, কিন্তু এর কোন সনাক্তকারী খুঁজে পাইনি। আমি তার নিকট আবার থলেটিকে আনলে তিনি বললেনঃ আরো এক বছর পর্যন্ত ঘোষণা করতে থাক। আমি আরো এক বছর পর্যন্ত ঘোষণা প্রদান করলাম। তারপর আমি তার নিকট আসলে তিনি বললেনঃ আরো এক বছর পর্যন্ত ঘোষণা করতে থাক। (ঘোষণার সময় পেরিয়ে গেলে) তিনি বললেনঃ মুদ্রার সংখ্যা, থলে এবং এর মুখের বাধন সঠিকভাবে চিনে রাখ। যখন এর খোঁজকারী এসে তোমাকে দীনারের সংখ্যা এবং এর থলে ও মুখের বন্ধন সম্বন্ধে পরিচয় দিবে তখন এটা তাকে ফিরিয়ে দিবে। এরপরও যদি মালিক না পাওয়া যায় তাহলে তবে তুমি এটা নিজের প্রয়োজনে কাজে লাগিয়ে দাও। সহীহ, ইবনু মা-জাহ (২৫০৬), নাসা-ঈ এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 1375,
			"arabicnumber": 1375,
			"text": "১৩৭৫। ইবনু উমর (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, উমার (রাঃ) খাইবারের (গানীমাত হতে) এক খণ্ড জমি পেয়েছিলেন। তিনি বললেন, হে আল্লাহর রাসূল! আমি খাইবার এলাকাতে এমন এক খণ্ড জমি পেয়েছি যার তুলনায় উত্তম সম্পদ আমি আর কখনো লাভ করিনি। (এ প্রসঙ্গে) আমাকে আপনি কি আদেশ করেন? তিনি বললেনঃ তুমি চাইলে মূল অংশ ঠিক রেখে লাভের অংশ দান-খাইরাত করতে পার। সুতরাং উমর (রাঃ) বমিটা এভাবে ওয়াকফ করলেনঃ মূল জমিখণ্ড বিক্রয় করা যাবে না, হেবাও করা যাবে না এবং উত্তরাধিকারদের মধ্যেও ভাগ-বাটোয়ারা হবে না। সেটার আয় হতে ফকীর-মিসকীন, আত্মীয়-স্বজন, ক্রীতদাস মুক্তকরণ, আল্লাহর রাস্তায় (জিহাদে), পথিক-মুসাফির এবং মেহমানদের খরচের জন্য ব্যয় করা হবে। যে লোক এর মুতাওয়াল্লী হবে সে ন্যায্যভাবে এর আয় হতে ভোগ করতে পারবে এবং বন্ধু-বান্ধবদেরকেও খাওয়াতে পারবে, কিন্তু জমা করে রাখতে পারবে না। (অধঃস্তন) বর্ণনাকারী বলেন, আমি মুহাম্মাদ ইবনু সীরনের নিকট এ হাদীসটি উল্লেখ করলে তিনি বলেন, মুতাওয়াল্লী সম্পদশালী হওয়ার লক্ষ্যে এই ওয়াকফ মালের আয় জমা করে রাখতে পারবে না। সহীহ, ইবনু মা-জাহ (২৩৯৬), নাসা-ঈ ইবনু আওন বলেন, অন্য এক লোক আমাকে জানিয়েছেন যে, তিনি এই ওয়াকফনামা লাল রঙ-এর চামড়ায় লিখিত আকারে পড়েছেন। তাতে এও লিখা ছিলঃ এ সম্পত্তিকে সম্পদশালী হওয়ার মাধ্যম বানানো যাবে না। ইসমাঈল বলেন, আমি ইবনু উবাইদুল্লাহ ইবনু উমারের নিকট উক্ত ওয়াকফনামা পড়লাম। তাতেও লিখা ছিল, সম্পদশালী হওয়ার লক্ষ্যে তা হতে জমা করা যাবে না। এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। এ হাদীস মোতাবিক সাহাবাই কিরাম এবং অপরাপর আলিমগণ আমল করেছেন। জমিজমা বা অন্য কোন সম্পদ ওয়াকফ করা জায়িয। এ ব্যাপারে পূর্ববর্তী আলিমদের মধ্যে কোন রকম দ্বিমত আছে বলে আমাদের জানা নেই।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 1376,
			"arabicnumber": 1376,
			"text": "১৩৭৬। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মানুষের মৃত্যুর সাথে সাথে তার কাজ (কাজের সকল ক্ষমতা) ছিন্ন (বাতিল) হয়ে যায়, কিন্তু তিনটি কাজের (সাওয়াব লাভ) বাতিল হয় নাঃ সাদকায়ে জারিয়া, এমন জ্ঞান যা দ্বারা উপকৃত হওয়া যায় এবং এমন সন্তান যে তার জন্য দুআ করে। সহীহ, আহকামুল জানায়িজ (১৭৬), ইরওয়া (১৯৮০), মুসলিম এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 1377,
			"arabicnumber": 1377,
			"text": "১৩৭৭। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ জন্তুর আঘাতে দণ্ড নেই, কূপে পড়াতে দণ্ড নেই, খনিতে দণ্ড নেই এবং রিকাযে এক-পঞ্চমাংশ (যাকাত) ধার্য হবে। সহীহ, ইবনু মা-জাহ (২৫০৯, ২৬৭৩), নাসা-ঈ কুতাইবা-লাইস হতে, তিনি ইবনু শিহাব হতে, তিনি সাঈদ ইবনুল মুসাইয়্যিব আবূ সালামা হতে, তিনিও আবূ হুরাইরা (রাঃ) হতে, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সূত্রে (উপরের হাদীসের) অনুরূপ বর্ণনা করেছেন। জাবির, আমর ইবনু আওফ ও উবাদা ইবনু সামিত (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ হুরাইরা (রাঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। ইমাম মালিক ইবনু আনাস (রাহঃ) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের বাণীঃ জন্তুর আঘাতে দণ্ড নেই, এ কথার মর্মার্থ এটাই যে, জন্তু-জানোয়ার কোন লোককে আহত করলে তার কোন কিসাস নেই এবং তার জন্য কোনরকম দিয়াত (রক্তপণ) প্রদান করতে হবে না। একদল আলিম আল-আজমা’ শব্দের ব্যাখ্যায় বলেছেন, যে পশু মালিকের হাত হতে ছুটে পালায় এবং দৌড়ে যাওয়ার সময় কোন লোককে আহত করে তাকে ‘আজমা’ বলে। এজন্য মালিককে কোনরকম জরিমানা প্রদান করতে হবে না। খনিতে দণ্ড নেই কথার তাৎপর্য হল, খনিজ সম্পদ উত্তোলনের উদ্দেশ্যে কোন লোক গর্ত খুঁড়লে এবং তাতে শ্রমিক বা অন্য কোন লোক পড়ে গিয়ে আহত হলে বা মারা গেলে মালিকের কোনরকম জরিমানা ধার্য হবে না। একইভাবে পথচারীদের জন্য কোন লোক কৃপ খনন করলে এবং তাতে পড়ে গিয়ে যদি কোন লোক আহত হয় বা নিহত হয় তবে সেক্ষেত্রেও কোনরকম জরিমানা ধার্য হবে না। জাহিলী যুগে মাটির নীচে পুতে রাখা সম্পদকে রিকায বলা হয়। কোন লোক যদি এই সম্পদ পায় তবে এর এক-পঞ্চমাংশ সরকারী তহবিলে জমা করতে হবে এবং সে লোক বাকি অংশের মালিক হবে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 1378,
			"arabicnumber": 1378,
			"text": "১৩৭৮। সাঈদ ইবনু যাইদ (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ পড়ে থাকা জমিকে (মালিকানাহীন জমিকে) যদি কোন লোক চাষাবাদযোগ্য করে তুলে তাহলে সে তার মালিক হবে। জবরদখলকারীর পরিশ্রমের কোন মূল্য নেই। সহীহ, ইরওয়া (১৫২০) এ হাদীসটিকে আবূ ঈসা হাসান গারীব বলেছেন। এ হাদীসটিকে কয়েকজন বর্ণনাকারী হিশামের বরাতে উরওয়ার নিকট হতে মুরসাল হিসেবে বর্ণনা করেছেন। এ হাদীস মোতাবিক রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের একদল সাহাবী ও তৎপরবর্তী আলিমগণ আমল করেছেন। তারা বলেছেন, যে লোক (মালিকানাহীন) পতিত জমি আবাদযোগ্য করে তুলে সে সরকারের বিনা অনুমতিতেই এর মালিক হয়ে যাবে। একথা বলেছেন ইমাম আহমাদ ও ইসহাকও। তাদের মধ্যে অন্য থাকা জমি আবাদ করা বৈধ নয়। প্রথম মতই অনেক বেশি সহীহ। জাবির, আমর ইবনু আওফ আল-মুযানী ও সামুরা (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 1379,
			"arabicnumber": 1379,
			"text": "১৩৭৯। জাবির ইবনু আবদুল্লাহ (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ পড়ে থাকা (মালিকানাহীন) জমিকে যদি কোন লোক আবাদ করে তাহলে সে তার মালিক হবে। সহীহ, ইরওয়া (১৫৫০) এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। আবূ মূসা মুহাম্মাদ ইবনুল মুসান্না (রহঃ) বলেন, “জবরদখলকারীর পরিশ্রমের কোন মূল্য নেই\" কথার তাৎপর্য প্রসঙ্গে আমি আবূল ওয়ালীদ আত-তাইয়ালিসী (রাহঃ)-এর কাছে প্রশ্ন করি। তিনি বলেন, ‘জবরদখলকারী হচ্ছে অবৈধভাবে আত্মসাৎকারী। আমি বললাম, অন্যের জমিতে যে লোক গাছ রোপন করে সেইকি জবরদখলকারী। তিনি বললেন, হ্যাঁ, এ লোকই।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 1380,
			"arabicnumber": 1380,
			"text": "১৩৮০। আবইয়ায ইবনু হাম্মাল (রাঃ) হতে বর্ণিত আছে, তিনি নিজ অংশের প্রতিনিধি হয়ে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট এসে তাদেরকে লবণ খনি প্রদানের উদ্দেশ্যে প্রার্থনা করেন। তিনি তাকে সেটা দান করেন। তিনি চলে যাওয়ার সময় মজলিসের এক লোক বলেন, আপনি লক্ষ্য করেছেন কি, তাকে কি জায়গীর দিয়েছেন? আপনি প্রস্রবণের অফুরন্ত পানি (প্রচুর লবণ) তাকে প্রদান করেছেন। বর্ণনাকারী বলেন, তিনি এটাকে তার নিকট হতে ফিরিয়ে নিলেন। বর্ণনাকারী বলেন, তিনি (আবইয়াদ) আরাক’ গাছের কোন জমি রক্ষিত করা যায় কি, এবিষয়েও তার নিকট জিজ্ঞেস করেন। তিনি বলেনঃ উটের ক্ষুর যার নাগাল পায় না (অর্থাৎ পশু চারণভূমি ও বসতি এলাকা হতে দূরের জায়গা)। হাসান, ইবনু মা-জাহ (২৪৭৫) আবূ ঈসা বলেন, কুতাইবাকে এই হাদীসটি পড়ে শুনালে তিনি তা সমর্থন করেন এবং বলেন, আমার নিকট মুহাম্মাদ ইবনু ইয়াহইয়া ইবনু কাইস আল-মারিবী এরূপ হাদীস বর্ণনা করেছেন। মারিব ইয়ামান ইলাকার কোন জায়গার নাম। ওয়াইল ও আসমা বিনতু আবূ বাকর (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবইয়ায (রহঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা গরীব বলেছেন। এ হাদীস মোতাবিক রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের একদল সাহাবী ও অপরাপর আলিমগণ আমল করেছেন। তারা মনে করেন সরকার যে কোন লোককে জায়গীর দেওয়ার ক্ষেত্রে অধিকার রাখে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 1381,
			"arabicnumber": 1381,
			"text": "১৩৮১। আলকামা ইবনু ওয়াইল (রহঃ) হতে তার বাবার সূত্রে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে জায়গীর হিসাবে হাযরামাওতের এক খণ্ড জমি দান করেন। মাহমূদ বলেন, আমাদেরকে নাযর শুবার সূত্রে এ হাদীসটি শুনিয়েছেন। তিনি (শুবা) তার বর্ণনায় আরো উল্লেখ করেছেনঃ জমি নির্দিষ্ট করে দেওয়ার জন্য তিনি তার সাথে মুআবিয়া (রাঃ)-কে প্রেরণ করেন। সহীহ, তা’লীক আলা রাওযাতিন নাদীয়াহ (২/১৩৭) আবূ ঈসা বলেন, হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 1382,
			"arabicnumber": 1382,
			"text": "১৩৮২। আনাস (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন মুসলিম লোক বৃক্ষ রোপণ করলে অথবা কৃষিকাজ করলে এবং তা হতে মানুষ অথবা পশু-পাখি খেয়ে নিলে সেটা তার জন্য দান-খায়রাত হিসেবে বিবেচিত হবে। সহীহ, সহীহাহ (৭), নাসা-ঈ আবূ আইয়ুব, জাবির, উম্মু মুবাশশির ও যাইদ ইবনু খালিদ (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, আনাস (রাঃ) হতে বর্ণিত হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 1383,
			"arabicnumber": 1383,
			"text": "১৩৮৩৷ ইবনু উমার (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উৎপাদিত ফল অথবা শস্যের অর্ধেক প্রদানের চুক্তিতে খাইবারের জনগণকে কৃষিকাজে নিয়োগ করেছিলেন। সহীহ, ইবনু মা-জাহ (২৪৬৭), নাসা-ঈ আনাস, ইবনু আব্বাস, যাইদ ইবনু সাবিত ও জাবির (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। এ হাদীস মোতাবিক রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের একদল সাহাবী ও কিছু আলিম অভিমত দিয়েছেন। অর্ধেক, তিন ভাগের এক অংশ বা চার ভাগের এক অংশ ফসলের বিনিময়ে ভাগচাষ করানোকে তারা দূষণীয় বলে মনে করেন না। কিছু আলিম বলেছেন, জমির মালিককে বীজ সরবরাহ করতে হবে। এই মত দিয়েছেন ইমাম আহমাদ ও ইসহাকও। কিছু আলিম এক-তৃতীয়াংশ বা এক চতুর্থাংশের বিনিময়ে ভাগচাষ করানো মাকরুহ বলেছেন। কিন্তু তারা এক-তৃতীয়াংশ বা এক-চতুর্থাংশ ফলের বিনিময়ে খেজুর বাগান ইত্যাদি বর্গা দেয়াকে মাকরূহ বলে মনে করেন না। ইমাম মালিক ও শাফিঈ (রাহঃ) এই মতামত দিয়েছেন। অপর একদল আলিমের মতে, যে কোন প্রকারের ভাগচাষই নাজায়িয। স্বর্ণ অথবা রূপার বিনিময়ে (নগদ অর্থে) ভাড়ায় তা চাষ করতে হবে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 1384,
			"arabicnumber": 1384,
			"text": "১৩৮৪। রাফি ইবনু খাদীজ (রাঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদেরকে এমন একটি কাজ হতে বিরত থাকতে বলেন, যা ছিল আমাদের জন্য খুবই লাভজনক। তা হলঃ আমাদের কারো জমি থাকলে তা উৎপাদিত ফসলের একটি অংশ দেওয়ার বিনিময়ে অথবা নগদ মূল্যে (কাউকে) চাষ করতে দেওয়া। তিনি বলেছেনঃ তোমাদের কারো উদ্বৃত্ত জমি থাকলে সে যেন তার ভাইকে তা ধার দেয় অথবা নিজে চাষ করে। সহীহ, “নগদ মূল্যে\" অংশটুকু শাজ। ইরওয়া (৫/২৯৮-৩০০), গাইয়াতুল মারাম (৩৫৫)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 1385,
			"arabicnumber": 1385,
			"text": "১৩৮৫। ইবনু আব্বাস (রাঃ) হতে বর্ণিত আছে, বর্গাচাষ প্রথাকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হারাম করেননি। বরং তিনি পরস্পরকে পরস্পরের প্রতি দয়া ও সহানুভূতি দেখানোর নির্দেশ দিয়েছেন। সহীহ, মুসলিম (৫/২৫) আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। রাফি (রাঃ) বর্ণিত এ হাদীসের সনদে গরমিল আছে। এ হাদীস রাফি (রাঃ) তার চাচাদের সূত্রে বর্ণনা করেছেন। হাদীসটি যুহাইর ইবনু রাফি হতেও বর্ণিত আছে। তিনিও তার চাচাদের একজন। বিভিন্ন বর্ণনাকারী রাফি (রাঃ)-এর নিকট হতে এ হাদীস বর্ণনা করেছেন। যাইদ ইবনু সাবিত এবং জারির (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে (যা আবূ দাউদ, নাসাঈ ও ইবনু মাজায় বিদ্যমান রয়েছে)।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 66
			}
		}
	]
}