{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"18": "The Book on Hunting"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1464,
			"arabicnumber": 1464,
			"text": "১৪৬৪। আইযুল্লাহ ইবনু আবদুল্লাহ (রহঃ) হতে বর্ণিত আছে, তিনি আবূ সালাবা আল-খুশানী (রাঃ)-কে বলতে শুনেছেন, আমি বললাম, হে আল্লাহর রাসূল! আমরা শিকারকারী সম্প্রদায়। তিনি বললেনঃ তুমি যদি আল্লাহ্ তা'আলার নামে তোমার কুকুর ছেড়ে থাক এবং তোমার জন্য সে শিকার ধরে তাহলে তুমি তা খেতে পার। আমি বললাম, সে যদি তা মেরে ফেলে? তিনি বললেনঃ মেরে ফেললেও। আমি বললাম, আমরা তীর নিক্ষেপকারী সম্প্রদায়। তিনি বললেনঃ তোমার তীর তোমাকে যা ফিরত দেয় তা খাও। বর্ণনাকারী বলেন, আমি বললাম, আমরা ভ্রমণে বের হয়ে থাকি; ইয়াহুদী, নাসারা ও মাজুসীদের এলাকা দিয়ে চলাচল করে থাকি। আমারা তাদের পাত্র ব্যাতিত অন্য কোন পাত্র আমাদের ব্যাবহারের জন্য জোগাড় করতে পারি না। তিনি বললেনঃ এদের পাত্র ব্যতীত তোমরা অন্য পাত্র জোগাড় করতে না পারলে এগুলোকে পানি দিয়ে ভালভাবে ধুয়ে নাও, তারপর এতে পানাহার কর। সহীহ, ইবনু মা-জাহ (৩২০৭), নাসা-ঈ আদী ইবনু হাতিম (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। আইযুল্লাহর ডাকনাম আবূ ইদরীস আল-খাওলানী। আবূ সালাবা আল-খুশানী (রাঃ)-এর নাম জুরছুম, তাকে জুরছুম ইবনু নাশিদ মতান্তরে ইবনু কাইসও বলা হয়।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1465,
			"arabicnumber": 1465,
			"text": "১৪৬৫। আদী ইবনু হাতিম (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমি বললাম, হে আল্লাহর রাসূল! আমরা আমাদের প্রশিক্ষণপ্রাপ্ত কুকুর শিকারের উদ্দেশ্যে ছেড়ে দেই। তিনি বললেনঃ তোমার জন্য এরা যা ধরে রাখে তা খাও। আমি বললাম, হে আল্লাহর রাসূল! এরা যদি শিকার হত্যা করে ফেলে? তিনি বললেনঃ এরা হত্যা করলেও খেতে পার যদি এর সাথে অন্য কুকুর অংশ গ্রহণ না করে। বর্ণনাকারী বলেন, আমি বললাম, হে আল্লাহর রাসূল! আমরা বর্শা (বা লাঠি) ছুড়ে থাকি। তিনি বলেনঃ তার তীক্ষ্ম অগ্রভাগ শিকারকে জখম করলে তা খাও, কিন্তু তার পার্শ্বদেশের আঘাতে শিকার হলে তা খেও না। সহীহ, ইবনু মা-জাহ (৩২০৮, ৩২১২, ৩২১৪, ৩২১৫), নাসা-ঈ উপরোক্ত হাদীসের মত মুহাম্মাদ ইবনু ইয়াহইয়া-মুহাম্মাদ ইবনু ইউসুফ হতে, তিনি সুফিয়ান হতে, তিনি মানসূর (রহঃ) হতে এই সূত্রে বর্ণিত হয়েছে। তবে এই বর্ণনায় আছে : “তাঁকে বর্শা প্রসঙ্গে প্রশ্ন করা হল”। এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1466,
			"arabicnumber": 1466,
			"text": "১৪৬৬। জাবির ইবনু আবদুল্লাহ (রাঃ) হতে বর্ণিত আছে, তিনি বলেছেন, আমাদেরকে মাজুসীদের (অগ্নি উপাসকদের) কুকুর দ্বারা শিকার খেতে বারণ করা হয়েছে। যঈফ, ইবনু মাজাহ (৩২০৯) আবূ ঈসা বলেন, এ হাদীসটি গারীব। শুধু উপরোক্ত সূত্রেই আমরা এ হাদীসটি জেনেছি। বেশিরভাগ বিশেষজ্ঞ আলিম এ হাদীস অনুসারে আমল করেছেন। তারা মাজুসীদের কুকুরের কৃত শিকার খাওয়ার অনুমতি দেননি। কাসিম ইবনু আবী বাজ্যা হলে কাসিম ইবনু নাফি, মক্কার অধিবাসী।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1467,
			"arabicnumber": 1467,
			"text": "১৪৬৭। আদী ইবনু হাতিম (রাঃ) হতে বর্ণিত আছে, তিনি বলেছেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকটে বাজ পাখির শিকার প্রসঙ্গে প্রশ্ন করলাম। তিনি বললেনঃ সে যা তোমার জন্য ধরে রাখে তা খাও। মুনকার; সহীহ আবূ দাউদ (২৫৪১) আবূ ঈসা বলেন, শুধুমাত্র শাবী হতে মুজালিদের সনদসূত্রেই আমরা এ হাদীসটি জেনেছি। আলিমগণ এ হাদীস অনুযায়ী আমল করেছেন। তাদের মতে বাজ, ঈগল ও শিকরার শিকার খাওয়াতে কোন সমস্যা নেই। মুজাহিদ (রাহঃ) বলেছেন, বাজ হল একটি শিকারী পাখি। এটা নখরযুক্ত প্রাণীর অন্তর্ভুক্ত। এ প্রসঙ্গে আল্লাহ তা'আলা বলেনঃ “এবং যেসব শিকারী প্রাণীকে তোমরা প্রশিক্ষণ দিয়েছ\" (সূরাঃ মাইদা- ৪)। তার মতে, শিকারী জন্তু বলতে যেসব কুকুর ও পাখি দিয়ে শিকার করা হয় তা বুঝায়। কিছু আলিম বাজ পাখির শিকার প্রসঙ্গে বলেছেন, পাখি তা হতে কিছু অংশ খেয়ে নিলেও তা খাওয়া জায়িয। তারা বলেছেন, একে প্রশিক্ষণ দেয়ার অর্থ হচ্ছে, একে ডাকা হলে ফিরে আসবে। কিছু আলিম এটা খাওয়া মাকরূহ বলেছেন। কিন্তু বেশীরভাগ ফিকহবিদ আলিম বলেছেন, এই শিকার খাওয়া জায়িয যদিও পাখি তা থেকে কিছুটা খেয়েও নেয়।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Munqar"
				},
				{
					"name": "Al-Albani",
					"grade": "Munqar"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1468,
			"arabicnumber": 1468,
			"text": "১৪৬৮। আদী ইবনু হাতিম (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমি বললাম, হে আল্লাহর রাসুল! আমি শিকারের দিকে তীর ছুড়ে থাকি। পরবর্তী দিন সেটাতে আমার তীর বিদ্ধ অবস্থায় দেখি। তিনি বললেনঃ তুমি যদি জানতে পার যে, তোমার তীরই এটাকে মেরেছে এবং এতে কোন হিংস পশুর চিহ্ন না দেখ তাহলে তা খাও। সহীহ, সহীহ আবূ দাউদ (২৫৩৯), নাসা-ঈ অনুরূপ এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। এ হাদীস মোতাবিক অভিজ্ঞ আলিমগণ আমল করেছেন। শুবা-আবূ বিশর ও আবদুল মালেক ইবনু মাইসারা হতে, তিনি সাঈদ ইবনু জুবাইর (রাহঃ)-এর সূত্রেও আদী ইবনু হাতিমের এ হাদীসটি বর্ণিত হয়েছে। এ সূত্রটিও সহীহ। আবূ সালাবা আল-খুশানী (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1469,
			"arabicnumber": 1469,
			"text": "১৪৬৯। আদী ইবনু হাতিম (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে শিকারের বিষয়ে প্রশ্ন করলাম। তিনি বললেন, তুমি তোমার তীর ছোঁড়ার সময় আল্লাহ্‌ তা'আলার নাম স্মরণ কর। তুমি যদি শিকারকে মৃত পাও তবুও তা খেতে পার। কিন্তু তুমি তা পানিতে পড়ে থাকা অবস্থায় পেলে তা খাওয়া থেকে বিরত থাক। কেননা তোমার জানা নেই, এটাকে পানি হত্যা করেছে না তোমার তীর হত্যা করেছে। সহীহ, সহীহ আবূ দাউদ (২৫৪০), নাসা-ঈ এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1470,
			"arabicnumber": 1470,
			"text": "১৪৭০। আদী ইবনু হাতিম (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমি প্রশিক্ষণপ্রাপ্ত কুকুরের শিকারের বিষয়ে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে প্রশ্ন করলাম। তিনি বললেন, তুমি তোমার শিকারী কুকুরকে শিকারের উদ্দেশ্যে ছাড়ার সময় আল্লাহর নাম স্মরণ করে থাকলে সে তোমার জন্য যা ধরে রাখে তা খাও। যদি সে শিকারের কিছু অংশ খেয়ে ফেলে তবে তা খেও না। কেননা সে তা নিজের জন্য শিকার করেছে। আমি বললাম, হে আল্লাহর রাসূল! যদি আমাদের কুকুরের সাথে অন্য কুকুর এসে মিলিত হয়ে যায়? তিনি বললেনঃ তুমি তো আল্লাহর নাম নিয়েছ তোমার কুকুরের ক্ষেত্রে, অন্য কারো কুকুরের বেলায় তো নাওনি। সহীহ্, সহীহ্ আবূ দাউদ (২৫৩৮,২৫৪৩), ইরওয়া (২৫৪৬),নাসা-ঈ এটা খাওয়াকে সুফিয়ান সাওরী মাকরূহ বলেছেন। আবূ ঈসা বলেন, এ হাদীস মোতাবেক রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের একদল সাহাবী ও তৎপরবর্তীগণ আমল করেছেন। তাদের মতে শিকারকৃত এবং যবেহ কৃত পশু পানিতে মৃত অবস্থায় পাওয়া গেলে তা খাওয়া বৈধ নয়। তাদের অপর একদল বলেছেন, কণ্ঠনালী কাটার পর পানিতে পড়ে গিয়ে মারাগেলে তা খাওয়া যাবে। এই অভিমত ইবনুল মুবারাকেরও। কুকুর শিকারের কিছু অংশ খাওয়ার পর তা খাওয়া বৈধ হবে কি-না এ বিষয়েও অভিজ্ঞ আলিমগণের মধ্যে মতভেদ আছে। বেশিরভাগ অভিজ্ঞ আলিম বলেছেন, কুকুর শিকার হতে কিছু অংশ খেয়ে নিলে সেই শিকার খাওয়া বৈধ নয়। এই কথা বলেছেন সুফিয়ান সাওরী, আবদুল্লাহ ইবনুল মুবারাক, শাফিঈ, আহমাদ ও ইসহাক। অন্যদিকে এটা খাওয়ার পক্ষে একদল সাহাবী ও তৎপরবর্তীগণ সম্মতি দিয়েছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1471,
			"arabicnumber": 1471,
			"text": "১৪৭১। আদী ইবনু হাতিম (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, বর্শা দিয়ে শিকার করা প্রসঙ্গে আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে প্রশ্ন করলাম। তিনি বললেনঃ এর তীক্ষ্ণ অগ্রভাগ দিয়ে যেটা শিকার করেছ তা খাও। আর যেটা এর পাশ্বদেশ দ্বারা শিকার করেছ তা মৃত পশুর সমতুল্য (নিষিদ্ধ)। সহীহ, সহীহ আবূ দাউদ (২৫৪৩), নাসা-ঈ এ হাদিসটি ইবনু আবু উমার সুফিয়ান হতে, তিনি যাকারিয়া হতে তিনি শাবী (রহঃ)-এর সূত্রেও আদী (রাঃ) হতে বর্ণিত হয়েছে। এ হাদীসটিকে আবূ ঈসা সহীহ বলেছেন। এ হাদীস মোতাবিক আলিমগণ আমল করেছেন।",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1472,
			"arabicnumber": 1472,
			"text": "১৪৭২। জাবির ইবনু আবদুল্লাহ (রাঃ) হতে বর্ণিত আছে, তার বংশের একজন লোক একটি অথবা দুটি খরগোশ শিকার করার পর একটি সাদা পাথর দ্বারা তা যবেহ করে। সে শিকার দুটি ঝুলানো অবস্থায় রেখে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সাথে দেখা করে। সে এ বিষয়ে তাকে প্রশ্ন করে। তিনি তাকে এটা খাওয়ার নির্দেশ দেন। সহীহ, ইবনু মা-জাহ (৩১৭৫) আবূ ঈসা বলেন, মুহাম্মাদ ইবনু সাফওয়ান, রাফি ও আদী ইবনু হাতিম (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। সাদা পাথর দ্বারা যবেহ করার পক্ষে একদল আলিম অনুমতি প্রদান করেছেন। তারা খরগোশ খাওয়াতে কোন আপত্তি আছে বলে মনে করেন না। বেশিরভাগ আলিমের এই অভিমত।খরগোশের গোশত খাওয়াকে কিছু আলিম মাকরূহ বলেছেন। এ হাদীস বর্ণনায় (সনদসূত্রে) শাবী (রাহঃ)-এর শাগরিদগণ মতপার্থক্য করেছেন। দাউদ ইবনু আবূ হিন্দ-আশ-শাবী হতে, তিনি মুহাম্মাদ ইবনু সাফওয়ানের সূত্রে বর্ণনা করেছেন। আসিম আল-আহওয়াল-শাবী হতে, তিনি সাফওয়ান ইবনু মুহাম্মাদ অথবা মুহাম্মাদ ইবনু সাফওয়ানের সূত্রে বর্ণনা করেছেন। মুহাম্মাদ ইবনু সাফওয়ান অনেক বেশি সহীহ। কাতাদা-শাবী-এর সূত্রে বর্ণিত হাদীসের মত জাবির আল-জুকী-শাবী হতে, তিনি জাবির ইবনু আবদুল্লাহ (রাঃ)-এর সূত্রে এ হাদীস বর্ণনা করেছেন। হয়ত একই হাদীস দু’জনেই শাবীর সূত্রে বর্ণনা করেছেন। ইমাম বুখারী (রাহঃ) বলেছেন, জাবিরের সূত্রে শাবি হতে বর্ণিত হাদীসটি অরক্ষিত।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1473,
			"arabicnumber": 1473,
			"text": "১৪৭৩। আবূদ দারদা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, মুজাসসামা' খাওয়াকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিষেধ করেছেন। যে পশুকে চাদমারির নিশানা বানিয়ে তীর ছুড়ে হত্যা করা হয় তাকে মুজাসসামা' বলে। সহীহ, সহীহা (২৩৯১) আবূ হুরাইরা (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূদ দারদা (রাঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা গারীব বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1474,
			"arabicnumber": 1474,
			"text": "১৪৭৪। উম্মু হাবীবা বিনতু ইরবায ইবনু সারিয়া (রহঃ) হতে তার বাবার সুত্রে বর্ণিত আছে, খাইবার যুদ্ধের দিন রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিম্নের পশুগুলো খাওয়া অবৈধ ঘোষণা করেছেনঃ শিকারী দাঁতওয়ালা হিংস্র পশু, নখর ও থাবাযুক্ত হিংস্র পাখি, গৃহপালিত গাধা, মুজাসসামা এবং খালীসা। তিনি (সদ্য হস্তগত) গর্ভবতী বাদীর সাথে সন্তান প্রসব না করা পর্যন্ত সহবাস করতেও বারণ করেছেন। সহীহ, খালীসা ব্যতীত অন্যগুলি পৃথক পৃথকভাবে সহীহ, সহীহা (৪/২৩৮-২৩৯), (১৬৭৩), (২৩৫৮), (২৩৯১), ইরওয়া (২৪৮৮), সহীহ আবূ দাউদ (১৮৮৩, ২৫০৭) মুহাম্মাদ ইবনু ইয়াহইয়া বলেন, মুজাসসামার ব্যাপারে আবূ আসিমকে প্রশ্ন করা হলে তিনি বলেন, যে পাখি অথবা পশুকে চাদমারির নিশানা বানিয়ে তীর ছুড়ে মেরে ফেলা হয় তাকে মুজাসসামা’ বলে। ‘খালীসা’ বিষয়ে তাকে প্রশ্ন করা হলে তিনি বলেন, বাঘ অথবা কোন হিংস্র পশু কোন প্রাণী ধরে নিলে কোন মানুষ তা ছিনিয়ে আনল, কিন্তু তা যবেহ করার আগেই তার হাতে মারা গেলে এটাকে ‘খালীসা’ বলে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1475,
			"arabicnumber": 1475,
			"text": "১৪৭৫। ইবনু আব্বাস (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কোন জীবন্ত পশুকে তীর ছুড়ে মারার জন্য লক্ষ্যবস্তু (চাদমারি) বানাতে নিষেধ করেছেন। সহীহ, ইবনু মা-জাহ (৩১৮৭), মুসলিম এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। এ হাদীস অনুযায়ী অভিজ্ঞ আলিমগণ আমল করার কথা বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1476,
			"arabicnumber": 1476,
			"text": "১৪৭৬। আবূ সাঈদ (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ জানীন (গর্ভস্থ ভ্রুণ)-এর মাকে যবেহ করাই এর জন্য যথেষ্ট। সহীহ, ইবনু মা-জাহ (৩১৯৯) জাবির, আবূ উমামা, আবূদ দারদা ও আবূ হুরাইরা (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। এ হাদীসটি আবূ সাঈদ (রাঃ) হতে অন্য সূত্রেও বর্ণিত হয়েছে। এ হাদীস মোতাবিক রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের অভিজ্ঞ সাহাবী ও তৎপরবর্তী আলিমগণ আমল করেছেন। সুফিয়ান সাওরী, ইবনুল মুবারাক, শাফিঈ, আহমাদ এবং ইসহাকও এই মত ব্যক্ত করেছেন (গর্ভবতী পশু যবেহ করলে তার গর্ভস্থ বাচ্চা আলাদা করে যবেহ করার দরকার হবে না)। আবূল ওয়াদাক-এর নাম জাবর, পিতা নাওফ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1477,
			"arabicnumber": 1477,
			"text": "১৪৭৭। আবূ সালাবা আল-খুশানী (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, থাবা ও শিকারী দাঁতওয়ালা হিংস্র পশু (খেতে) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বারণ করেছেন। সহীহ, ইবনু মা-জাহ (৩২৩২), নাসা-ঈ উপরোক্ত হাদীসের অনুরূপ সাঈদ ইবনু আবদুর রাহমান আল-মাখযুমী ও অন্যান্যরা-সুফিয়ান ইবনু উয়াইনা হতে, তিনি যুহরী হতে, তিনি আবূ ইদরীস আল-খাওলানীর সূত্রেও বর্ণিত হয়েছে। এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। আবূ ইদরীস আল-খাওলানীর নাম আইয়ুল্লাহ, পিতা আবদুল্লাহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1478,
			"arabicnumber": 1478,
			"text": "১৪৭৮। জাবির (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, খাইবারের যুদ্ধের দিন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হারাম ঘোষণা করেছেন গৃহপালিত গাধা, খচ্চরের গোশত, প্রত্যেক শিকারী দাঁতওয়ালা হিংস্র পশু এবং পাঞ্জাধারী শিকারী পাখিকে (খাওয়াকে)। সহীহ, ইরওয়া (৮/১৩৮) আবূ হুরাইরা, ইরবায ইবনু সারিয়া ও ইবনু আব্বাস (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। জাবির (রাঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা হাসান গারীব বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1479,
			"arabicnumber": 1479,
			"text": "১৪৭৯। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম প্রত্যেক শিকারী দাঁতওয়ালা হিংস্র পশু (খাওয়া) অবৈধ বলে ঘোষণা দিয়েছেন। হাসান সহীহ, ইবনু মা-জাহ (৩২৩৩), মুসলিম এ হাদীসটিকে আবূ ঈসা হাসান বলেছেন। এ হাদীস অনুসারে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের বেশিরভাগ অভিজ্ঞ সাহাবী ও তৎপরবর্তী আলিমগণ আমল করেছেন। এই কথা বলেছেন, (এসব পশুর গোশত হারাম) আব্দুল্লাহ ইবনুল মুবারাক, শাফিঈ, আহমাদ ও ইসহাকও।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1480,
			"arabicnumber": 1480,
			"text": "১৪৮০। আবূ ওয়াকিদ আল-লাইসী (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মদীনায় আসলেন। এখানকার জনগণ জীবিত উটের কুঁজ ও মেষের লেজের গোড়ার গোশত পিন্ডের অংশ কেটে খেত। তিনি বলেন, জীবিত পশুর শরীরের কোন অংশ কেটে আলাদা করা হলে তা মৃত হিসেবেই গণ্য। সহীহ, ইবনু মা-জাহ (৩২১৬) পূর্বে বর্ণিত হাদীসের অনুরূপ ইবরাহীম ইবনু ইয়াকুব আল-জাওযাজানী-আবূন নাযর হতে, তিনি আবদুর রাহমান ইবনু আবদুল্লাহ ইবনু দীনার (রহঃ)-এর সূত্রে বর্ণনা করেছেন। এ হাদীসটিকে আবূ ঈসা হাসান গারীব বলেছেন। আমরা এ হাদীসটি শুধু যাইদ ইবনু আসলামের সূত্রেই জেনেছি। এ হাদীস মোতাবিক আলিমগণ আমল করেছেন (অর্থাৎ পশুর শরীরের কাটা অংশ খাওয়া মৃত প্রাণীর ন্যায় অবৈধ)। আবূ ওয়াকিদ আল-লাইসীর নাম আল-হারিস, পিতা আওফ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1481,
			"arabicnumber": 1481,
			"text": "১৪৮১। আবূল উশারা (রহঃ) হতে তার পিতার সূত্রে বর্ণিত আছে, তিনি (পিতা) বলেন, আমি বললাম, হে আল্লাহর রাসূল। যবেহ কি শুধু কণ্ঠনালী ও বক্ষস্থলের উপরিভাগেই (কণ্ঠনালীর শুরু এবং শেষ অংশের মধ্যবর্তী স্থানে) করতে হবে? তিনি বললেনঃ তুমি যদি তার উরুতে আঘাত করতে পার তবে তোমার জন্য যথেষ্ট হবে। যঈফ, ইবনু মাজাহ (৩১৮৪) আহমাদ ইবনু মানী (রহঃ) বলেন, ইয়াযীদ ইবনু হারূন বলেছেন, উরুতে যবেহ করা শুধুমাত্র জরুরী অবস্থায় প্রযোজ্য। এ অনুচ্ছেদে রাফি ইবনু খাদীজ (রাঃ) হতেও হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, এ হাদীসটি গারীব। হাম্মাদ ইবনু সালামার সূত্রেই শুধুমাত্র আমরা এ হাদীস জেনেছি। আবূল উশারা (রহঃ) হতে তার পিতার সূত্রে বর্ণিত উপরোক্ত হাদীস ব্যতীত আর কোন হাদীস বর্ণিত আছে কি না তা আমাদের জানা নেই। বিশেষজ্ঞগণ আবূল উশারার নামে মতভেদ করেছেন। কেউ বলেছেন তার নাম উসামা ইবনু কিহতাম, তিনি আবার ইয়াসার ইবনু বারয বা ইবনু বালয বলেও কথিত। ভিন্নমতে তার নাম উতারিদ, তার দাদার সাথে সম্পর্কিত।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1482,
			"arabicnumber": 1482,
			"text": "১৪৮২। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ প্রথম আঘাতেই যে লোক একটি গিরগিটি (টিকটিকি) মারতে পারে তার জন্য এই এই পরিমাণ সাওয়াব। সে এটাকে দ্বিতীয় আঘাতে মারতে পারলে তার জন্য এই এই পরিমাণ সাওয়াব। সে তা তৃতীয় আঘাতে মারতে পারলে তার জন্য এত এত সাওয়াব। সহীহ, মুসলিম (৭/৪২) ইবনু মাসউদ, সা’দ, আইশা ও উম্মু শারীক (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ হুরাইরা (রাঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1483,
			"arabicnumber": 1483,
			"text": "১৪৮৩। সালিম ইবনু আবদুল্লাহ (রহঃ) হতে তার বাবার সূত্রে বর্ণিত আছে, তিনি (আবদুল্লাহ) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা সাপ মার। পিঠে দু'টি দাগ বিশিষ্ট সাপ ও লেজকাটা সাপকে তোমরা মেরে ফেল। কেননা এ দু'টি সাপ দৃষ্টিশক্তি ধ্বংস করে এবং (মহিলাদের) গর্ভপাত ঘটায়। সহীহ, নাসা-ঈ ইবনু মাসউদ, আইশা, আবূ হুরাইরা ও সাহল ইবনু সা'দ (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। আবূ লুবাবা (রাঃ)-এর সূত্রে ইবনু উমর (রাঃ) বর্ণনা করেছেন, “পরবর্তীতে ঘরে বসবাসকারী সাপ মারতে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বারণ করেছেন\"। এ ধরণের সাপকে ‘আওয়ামির' বলা হয়। এ সম্পর্কিত হাদীস যাইদ ইবনুল খাত্তাব (রাঃ) হতেও ইবনু উমার (রাঃ) বর্ণনা করেছেন। ইবনুল মুবারাক বলেন, হালকা ধরণের সাদা সাপ যা চলার সময় কুঁকড়ায় না তা মারা নিষিদ্ধ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1484,
			"arabicnumber": 1484,
			"text": "১৪৮৪। আবূ সাঈদ খুদরী (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের ঘরে বসবাসকারী অন্য প্রাণীও আছে। এদেরকে তিনবার সাবধান কর। এরপরও তা হতে তোমাদের জন্য (ক্ষতিকর কিছু) প্রকাশ পেলে তবে এটাকে মেরে ফেল। সহীহ, যঈফা (৩১৬৩ নং হাদীসের অধীনে), মুসলিম আবু ঈসা বলেন, অনুরূপভাবে হাদিসটি উবাইদুল্লাহ ইবনু উমার বর্ণনা করেছেন, সাইফী হতে, তিনি আবু সাঈদ খুদরী (রাঃ) হতে। মালিক ইবনু আনাস বর্ণনা করেছেন সাইফী হতে, তিনি আবুস সাইব হতে, তিনি আবূ সাঈদ হতে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে। এই হাদীসটির একটি ঘটনা আছে। এই হাদীসটি উবাইদুল্লাহ ইবনু উমারের হাদীসের চেয়ে অধিক সহীহ। মুহাম্মাদ ইবনু আজলান সাইফী হতে মালিকের মতই বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1485,
			"arabicnumber": 1485,
			"text": "১৪৮৫। আবদুর রহমান ইবনু আবূ লাইলা (রাহঃ) হতে বর্ণিত আছে, তিনি বলেন, আবু লাইলা বলেছেন, রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ঘরের মধ্যে সাপ দেখা গেলে তোমরা বল, “আমরা নূহ (আঃ)-এর দোহাই ও সুলাইমান ইবনু দাউদ (আঃ)-এর দোহাই দিয়ে বলছি, তুমি আমাদের কষ্ট দিও না। এরপরও তা দেখা গেলে তোমরা একে হত্যা কর। যঈফ, যঈফা (১৫০৮) আবূ ঈসা বলেন, এ হাদীসটি হাসান গারীব। আমরা ইবনু আবূ লাইলার রিওয়াত হিসেবে সাবিত আল-বুনানীর সূত্রেই শুধু উল্লেখিত হাদীসটি জেনেছি।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1486,
			"arabicnumber": 1486,
			"text": "১৪৮৬। আবদুল্লাহ ইবনু মুগাফফাল (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কুকুর (আল্লাহ্ তা'আলার) সৃষ্ট প্রাণীগুলোর একটি প্রাণী না হলে আমি এর সবগুলোকে মেরে ফেলার হুকুম করতাম। অতএব এগুলোর মধ্যে যে কুকুরগুলো অত্যাধিক কালো সেগুলোকে তোমরা মেরে ফেল। সহীহ্, মিশকাত তাহকীক ছানী (৪১০২), গাইয়াতুল মারাম (১৪৮), সহীহ আৰূ দাউদ (২৫৩৫) ইবনু উমার, জাবির, আবূ রাফি ও আবূ আইয়ূব (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আব্দুল্লাহ ইবনু মুগাফফাল (রাঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। কোন কোন হাদীসের বর্ণনায় আছেঃ “কালো রং-এর কুকুরগুলো শাইতান”। সেগুলোই ঘোর কালো কুকুরের পর্যায়ে পরে যেগুলোর মধ্যে সাদা রং-এর কোন চিহ্নমাত্রও পাওয়া যায় না। কালো কুকুরের শিকার খাওয়াকে একদল আলিম মাকরূহ মনে করেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1487,
			"arabicnumber": 1487,
			"text": "১৪৮৭। ইবনু উমার (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে লোক শিকারী কুকুর অথবা গবাদিপশু পাহারাদার কুকুর ব্যতীত ভিন্ন উদ্দেশ্যে কুকুর লালন-পালন করে থাকে, তার সাওয়াব হতে প্রতিদিন দুই কীরাত (উহুদ পর্বতের সমতুল্য নেকি) পরিমাণ কমে যায়। সহীহ, সহীহ আবূ দাউদ (২৫৩৪), নাসা-ঈ আবদুল্লাহ ইবনু মুগাফফাল, আবূ হুরাইরা ও সুফিয়ান ইবনু আবৃ যুহাইর (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। ইবনু উমার (রাঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। অন্য এক বর্ণনায় আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ 'আও কালবা যারইন’ (অথবা ফসলাদি পাহারাদার কুকুর ব্যতীত)।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1488,
			"arabicnumber": 1488,
			"text": "১৪৮৮। ইবনু উমার (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম শিকারী কুকুর অথবা গবাদিপশু পাহারাদার কুকুর ব্যতীত অন্যান্য কুকুর মারার হুকুম দিয়েছেন। বর্ণনাকারী বলেন, তাকে বলা হল, আবু হুরাইরা বলেন, \"অথবা ফসলাদি পাহারাদার কুকুর\" বর্ণনাকারী বলেন, আবূ হুরাইরা (রাঃ)-এর কৃষিভূমি ছিল। সহীহ, ইরওয়া (২৫৪৯), মুসলিম এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1489,
			"arabicnumber": 1489,
			"text": "১৪৮৯। আবদুল্লাহ ইবনু মুগাফফাল (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন খুতবা দিচ্ছিলেন তখন তার চেহারার সম্মুখ থেকে যারা খেজুর গাছের ডাল সরিয়ে রেখেছিলেন তাদের মধ্যে আমিও ছিলাম। তখন তিনি বললেনঃ কুকুর যদি (আল্লাহ্ তা'আলার) সৃষ্ট প্রজাতিসমূহের মধ্যে একটি প্রজাতি না হতো তবে আমি এগুলোকে ধ্বংসের জন্য নির্দেশ দিতাম। অতএব এদের মধ্যে যে কুকুরগুলো মিশমিশে কালো তাদেরকে মেরে ফেল। যে বাড়ীর মানুষেরা শিকারের উদ্দেশ্যে, ফসলাদি ও মেষপাল পাহারা দেয়ার উদ্দেশ্য ব্যতীত কুকুর পালন করে থাকে তাদের সৎ আমল হতে প্রতিদিন এক কীরাত করে (সাওয়াব) কমে যায়। সহীহ, ইবনু মা-জাহ (৩২০৫) এ হাদীসটিকে আবূ ঈসা হাসান বলেছেন। এ হাদীসটি একাধিক সূত্রে হাসান হতে, তিনি আব্দুল্লাহ ইবনু মুগাফফাল হতে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এই সনদেও বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1490,
			"arabicnumber": 1490,
			"text": "১৪৯০। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ গবাদিপশু পাহারাদার কুকুর, শিকারী কুকুর অথবা কৃষিক্ষেত পাহারাদার কুকুর ব্যতীত অন্য উদ্দেশ্য নিয়ে যে লোক কুকুর লালন-পালন করে থাকে তার সাওয়াব হতে প্রতিদিন এক কীরাত পরিমাণ কমে যায়। সহীহ, ইবনু মা-জাহ (৩২০৪) নাসা-ঈ, বুখারীতে শিকারী কুকুরের উল্লেখ আছে মুয়াল্লাকভাবে। এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। কেবলমাত্র একটি ছাগলের মালিককেও আতা ইবনু আবূ রাবাহ (রাহঃ) কুকুর পালনের সম্মতি প্রদান করেছেন। ইসহাক ইবনু মানসূর-হাজ্জাজ ইবনু মুহাম্মাদ হতে, তিনি ইবনু জুরাইজ হতে, তিনি আতা (রাহঃ) হতে এইসূত্রে তা বর্ণিত।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1491,
			"arabicnumber": 1491,
			"text": "১৪৯১। রাফি ইবনু খাদীজ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমি বললাম, হে আল্লাহর রাসূল! আগামীকাল আমরা শত্রু পক্ষের মুখোমুখি হব। অথচ আমাদের নিকট ছুরি নেই (কিভাবে যবেহ করব)? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ দাঁত ও নখ ছাড়া রক্ত প্রবাহিত করতে সক্ষম এমন যে কোন জিনিস দিয়ে আল্লাহ তা'আলার নাম নিয়ে যবেহ করলে তোমরা তা খাও। আমি তোমাদের দাত ও নখ প্রসঙ্গে বলছি যে, দাঁত হল হাড্ডি এবং নখ হল হাবশীদের (ইথিওপিয়ার বসবাসকারীদের) ছুরি। সহীহ, ইবনু মা-জাহ (৩১৮৭), নাসা-ঈ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের উপরোক্ত হাদীসের মত মুহাম্মাদ ইবনু বাশশার-ইয়াহইয়া ইবনু সাঈদ হতে, তিনি সুফিয়ান সাওরী (রাঃ) হতে এইসূত্রে বর্ণিত হয়েছে। এ সূত্রের মধ্যে আবাইয়া হতে তার বাবার সূত্রে কথাটি নেই এবং এটাই অনেক বেশি সহীহ। রাফি (রাঃ)-এর নিকটে আবাইয়া সরাসরি হাদীস শুনেছেন। এ হাদীস মোতাবিক আলিমগণ আমল করেছেন। দাঁত ও হাড় দিয়ে যবেহ করাকে তারা জায়িয মনে করেন না।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1492,
			"arabicnumber": 1492,
			"text": "১৪৯২। আবাইয়া ইবনু রিফাআ ইবনু রাফি ইবনু খাদীজ (রাঃ) হতে পর্যায়ক্রমে তার বাবা ও দাদার সূত্রে বর্ণিত আছে, তিনি (রাফি) বলেন, এক ভ্রমণে আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সাথে ছিলাম, দলের একটি উট বাঁধন ছিড়ে পালিয়ে যায়। তাদের সাথে কোন ঘোড়া ছিল না। একজন লোক (এর প্রতি) তীর মারলে আল্লাহ তা'আলা এটাকে থামিয়ে দিলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ বন্য পশুর মত এসব পশুর মধ্যেও পালিয়ে যাওয়ার স্বভাব আছে। অতএব যে পশু ঐ রকম করবে তোমরাও তার সাথে একই ব্যবহার কর। সহীহ, এই হাদীসটি পূর্বের হাদীসের পরিপুরক রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের অনুরূপ হাদীস মাহমূদ ইবনু গাইলান-ওয়াকী হতে, তিনি সুফিয়ান হতে, তিনি তার পিতা হতে, তিনি আবাইয়া ইবনু রিফাআ হতে, তিনি তার দাদা রাফি ইবনু খাদীজ (রাঃ) হতে এ সূত্রেও বর্ণিত হয়েছে। এই সূত্রটিতে “আবাইয়া-তার আব্বা\" এরকম কথা নেই এবং এটাই অনেক বেশি সহীহ। এ হাদীস মোতাবিক আলিমগণ আমল করেছেন। সুফিয়ানের বর্ণনার মত শুবা (রহঃ) ইবনু মাসরুকের সূত্রে বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 35
			}
		}
	]
}