{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"19": "The Book on Sacrifices"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1493,
			"arabicnumber": 1493,
			"text": "১৪৯৩। আইশা (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কুরবানীর দিন মানুষ যে কাজ করে তার মধ্যে আল্লাহ তা'আলার নিকট সবচাইতে পছন্দনীয় হচ্ছে রক্ত প্রবাহিত করা (কুরবানী করা)। কিয়ামতের দিন তা নিজের শিং, পশম ও ক্ষুরসহ হাযির হবে। তার (কুরবানীর পশুর) রক্ত যমিনে পড়ার আগেই আল্লাহ্ তা'আলার নিকটে এক বিশেষ মর্যাদায় পৌছে যায়। অতএব তোমরা আনন্দিত মনে কুরবানী কর। যঈফ, ইবনু মাজাহ (৩১২৬) এ অনুচ্ছেদে ইমরান ইবনু হুসাইন ও যাইদ ইবনু আরকাম (রাঃ) হতেও হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, এ হাদীসটি হাসান গারীব। শুধু উল্লেখিত সনদ সূত্রেই আমরা এ হাদীসটি হিশাম হতে বর্ণিত হিসেবে জেনেছি। আবূল মুসান্নার নাম সুলাইমান, পিতা ইয়াযীদ। ইবনু আবূ ফুদাইক তার সূত্রে হাদীস বর্ণনা করেছেন। এক বর্ণনায় আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ “কুরবানীকারীর জন্য প্রতিটি লোমের বিনিময়ে সাওয়াব আছে। অপর এক বর্ণনায় আছে 'প্রতিটি শিং-এর বিনিময়ে। খুবই দুর্বল, মিশকাত (১৪৭৬)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1494,
			"arabicnumber": 1494,
			"text": "১৪৯৪ আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দুই শিং যুক্ত ধুসর রং-এর দুটি মেষ কুরবানী করেছেন। তিনি এ দু'টিকে বিসমিল্লাহ ও আল্লাহু আকবার বলে নিজ হাতে যবেহ করেছেন- এর পাজরে নিজের পা রেখে চেপে ধরে। সহীহ, ইবনু মা-জাহ (৩১২০), নাসা-ঈ আলী, আইশা, আবু হুরাইরা, আবু আইয়ুব, জাবির, আবুদ দারাদা আবূ রাফি, ইবনু উমার ও আবূ বাকরা (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1495,
			"arabicnumber": 1495,
			"text": "১৪৯৫। আলী (রাঃ) হতে বর্ণিত আছে, তিনি দুটি মেষ কুরবানী করতেন, একটি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের পক্ষ হতে এবং অপরটি নিজের পক্ষ হতে। এ ব্যাপারে তাকে প্রশ্ন করা হলে তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে এই হুকুম করেছেন। অতএব আমি কখনও তা বাদ দেব না। সনদ দুর্বল আবূ ঈসা বলেন, এ হাদীসটি গারীব। শুধু শারীকের সূত্রেই আমরা এ হাদীস জেনেছি। একদল আলিম মৃতের পক্ষ হতে কুরবানী করার অনুমতি দিয়েছেন এবং অপর একদল তা জায়িয মনে করেন না। আবদুল্লাহ ইবনুল মুবারাক (রাহঃ) বলেন, মৃতের পক্ষ হতে কুরবানী করার পরিবর্তে দান-খাইরাত করাই আমি পছন্দ করি। তবে মৃতের পক্ষ হতে কুরবানী করা হলে তার সম্পূর্ণ গোশত দান করে দিতে হবে, নিজেরা খেতে পারবে না। মুহাম্মাদ (বুখারী) বলেনঃ আলী ইবনু আল মাদীনী বলেছেনঃ এ হাদীটি শারীক ছাড়া অন্যরাও বর্ণনা করেছেন। আমি (তিরমিয়ী) বললাম আবূল হাসনার নাম কি? তিনি তাকে চিনতে পারলেন না। মুসলিম বলেছেন তার নাম হাসান।",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1496,
			"arabicnumber": 1496,
			"text": "১৪৯৬। আবূ সাঈদ আল-খুদরী (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম শিং বিশিষ্ট ও মোটাতাজা (শক্তিশালী) একটি মেষ কুরবানী করেছেন। এর চেহারা, পা ও চোখ ছিল মিটমিটে কালো। সহীহ, ইবনু মা-জাহ (৩১২৮) এ হাদীসটিকে আবূ ঈসা হাসান সহীহ্ গারীব বলেছেন। আমরা শুধু হাফস ইবনু গিয়াসের সূত্রেই তা জেনেছি।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1497,
			"arabicnumber": 1497,
			"text": "১৪৯৭। বারাআ ইবনু আযিব (রাঃ) মারফু হাদীস (রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের বাণী) হিসাবে বর্ণনা করেছেনঃ খোড়া জন্তু যার খোড়ামী স্পষ্টভাবে প্রকাশিত; অন্ধ পশু যার অন্ধত্ব সম্পূর্ণভাবে প্রকাশিত; রুগ্ন পশু যার রোগ দৃশ্যমান এবং ক্ষীণকায় পশু যার হাড়ের মজ্জা পর্যন্ত শুকিয়ে গেছে- তা দ্বারা কুরবানী করা যাবে না। সহীহ, ইবনু মা-জাহ (৩১৪৪) হান্নাদ-ইবনু আবূ যাইদা হতে, তিনি শুবা হতে, তিনি সুলাইমান আল-বারাআ ইবনু আযিব (রাঃ) হতে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে উক্ত মর্মে অনুরূপ হাদীস বর্ণনা করেছেন। এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। আমরা শুধুমাত্র উবাইদ ইবনু ফাইরূযের সূত্রেই বারাআর এ হাদীসটি জেনেছি। এ হাদীস মোতাবিক আমল করার পক্ষে আলিমগণ মতামত দিয়েছেন। অর্থাৎ এ ধরণের ক্রটিযুক্ত পশু দ্বারা কুরবানী আদায় হবে না।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1498,
			"arabicnumber": 1498,
			"text": "১৪৯৮। আলী (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদেরকে নির্দেশ দিয়েছেন- আমরা যেন কুরবানীর পশুর চোখ-কান ভালো করে দেখে নেই। তিনি আমাদের আরো নির্দেশ দিয়েছেন- আমরা যেন এমন পশু দিয়ে কুরবানী না করি যার কানের অগ্রভাগ বা গোড়ার অংশ কাটা; যার কান ছিদ্র করে দেয়া হয়েছে বা যার কান লম্বালম্বিভাবে ফেড়ে দেয়া হয়েছে। যঈফ, ইবনু মাজাহ (৩১৪২) অন্য একটি সূত্রেও আলী (রাঃ)-এর বরাতে অনুরূপ বর্ণিত আছে। তাতে অতিরিক্ত আছে, “মুকাবিলা\", অর্থাৎ যার কান অগ্রভাগ কাটা, মুদাবারা অর্থ যার কানের গোড়ার অংশ কাটা, শারকা অর্থ কান ফাটা খারকা অর্থাৎ যার কান ছিদ্র করে দেয়া হয়েছে। যঈফ, দেখুন পূর্বের হাদীস আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। তিনি আরও বলেনঃ শুরাইহ ইবনু নুমান কুফার অধিবাসী আলী (রাঃ)-এর শাগরিদ, শুরাইহ ইবনু হানী তিনিও কুফার অধিবাসী এবং আলী (রাঃ)-এর শাগরিদ তার পিতা সাহাবী ছিলেন। শুরাইহ ইবনুল হারিস আল-কিনদী তিনিও আলী (রাঃ) হতে হাদীস বর্ণনা করেছেন। এরা সকলেই একই যুগের এবং সকলেই আলী (রাঃ)-এর শাগরিদ। “আন-নাস তাশরিফা\" শব্দের অর্থ হল “আমরা ভালভাবে দেখি”।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1499,
			"arabicnumber": 1499,
			"text": "১৪৯৯। আবূ কিবাশ (রাহঃ) হতে বর্ণিত আছে, তিনি বলেন, আমি ছয়মাস বয়সের কিছু সংখ্যক মেষ বিক্রয়ের উদ্দেশ্যে মদীনায় আনলাম। কিন্তু সেগুলো বাজারে বিক্রয় হল না (মূল্য কমে গেল)। আমি আবূ হুরাইরা (রাঃ)-এর সাথে দেখা করে তাকে এ প্রসঙ্গে প্রশ্ন করলাম। তিনি বললেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে বলতে শুনেছিঃ \"ছয় মাস বয়সের মেষ কুরবানীর জন্য কতই না উত্তম!” রাবী বলেন, (এ কথা শুনে) লোকেরা মেষগুলো সাথে সাথে ছিনিয়ে নিল (তাড়াহুড়া করে কিনে নিল)। যঈফ, যঈফা (৪), মিশকাত (১৪৬৮), ইরওয়া (১১৪৩) এ অনুচ্ছেদে ইবনু আব্বাস, উম্মু বিলাল বিনতি হিলাল তার পিতার সূত্রে, জাবির, উকবা ইবনু আমির (রাঃ) এবং রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের আরো একজন সাহাবী হতে হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, আবূ হুরাইরা (রাঃ) বর্ণিত হাদীসটি হাসান গারীব। এটি আবূ হুরাইরা (রাঃ) হতে মাওকুফ হিসেবেও বর্ণিত হয়েছে। উসমান ইবনু ওয়াকিদ, তিনি হলেন ইবনু মুহাম্মাদ ইবনু যিয়াদ ইবনু আব্দুল্লাহ ইবনু উমার ইবনুল খাত্তাব। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সাহাবী ও তার পরবর্তী আলিমগণ এ হাদীস অনুসারে আমল করেছেন। তাদের মতে কুরবানীর জন্য ছয়মাস বয়সের ছাগল-ভেড়া যথেষ্ট।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1500,
			"arabicnumber": 1500,
			"text": "১৫০০। উকবা ইবনু আমির (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে কয়েকটি ছাগল দিলেন কুরবানীর উদ্দেশ্যে তার সাহাবীদের মধ্যে বিলিয়ে দেওয়ার জন্য। বিলিয়ে দেওয়ার পর ছয় মাস বা এক বছর বয়সের একটি বাচ্চা রয়ে গেল। আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে বিষয়টি জানালে তিনি বললেন, তুমিই এটাকে কুরবানী কর। সহীহ, ইবনু মা-জাহ (৩১৩৮) এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। ওয়াকী বলেছেন, এক বৎসর অথচ সাত মাসের বাচ্চাকে জাযাআ’ বলে। অন্য সূত্রে উকবা ইবনু আমির (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (সাহাবীদের মধ্যে) কুরবানীর পশু বন্টন করে দিলেন। একটি ছয় মাস বয়সের বাচ্চা রয়ে গেলে আমি (এ প্রসঙ্গে) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে জিজ্ঞেস করলাম। তিনি বললেনঃ তুমিই এটাকে কুরবানী কর। এটা বর্ণনা করেছেন মুহাম্মাদ ইবনু বাশশার ইয়াযীদ ইবনু হারুন ও আবূ দাউদ কাসীর হতে, বাজাহ ইবনু আব্দুল্লাহ ইবনু বাদর হতে, তিনি উকবা ইবনু আমির হতে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1501,
			"arabicnumber": 1501,
			"text": "১৫০১। ইবনু আব্বাস (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, এক ভ্রমণে আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সাথে ছিলাম। এরকম পরিস্থিতিতে কুরবানীর ঈদ উপস্থিত হল। তখন আমরা একটি গরুতে সাতজন অংশীদার হয়ে এবং একটি উটে দশজন অংশীদার হয়ে কুরবানী আদায় করলাম। সহীহ, পূর্বে ৮৯৮ নং হাদীসে বর্ণিত হয়েছে। আবূল আসাদ আস-সুলামী পর্যায়ক্রমে তার বাবা ও দাদার সূত্রে এবং আবূ আইয়ূব (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। ইবনু আব্বাস (রাঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা হাসান গারীব বলেছেন। আমরা এ হাদীস বিষয়ে শুধুমাত্র ফাযল ইবনু মূসার সূত্রেই জেনেছি।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1502,
			"arabicnumber": 1502,
			"text": "১৫০২। জাবির (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমরা হুদাইবিয়া নামক জায়গাতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সাথে একটি উটে সাতজন অংশীদার হয়ে এবং একটি গরুতেও সাতজন অংশীদার হয়ে কুরবানী সম্পন্ন করেছি। সহীহ, ইবনু মা-জাহ (৩১৩২), মুসলিম এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। এ হাদীস অনুসারে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের অভিজ্ঞ সাহাবী ও অন্যান্য আলিমগণ আমল করেছেন। একই অভিমত সুফিয়ান সাওরী, ইবনুল মুবারাক, শাফিঈ, আহমাদ ও ইসহাকের (সাতজন পর্যন্ত উট-গরুতে অংশীদার হওয়া যায়)। ইসহাক (রাহঃ) আরো বলেন, দশজন মানুষও একটি উটে অংশীদার হতে পারে। তিনি ইবনু আব্বাস (রাঃ)-এর হাদীসকে তার এ মতের সমর্থনে দলীল হিসাবে উল্লেখ করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1503,
			"arabicnumber": 1503,
			"text": "১৫০৩। আলী (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, সাতজন ব্যক্তি পর্যন্ত একটি গরুতে অংশীদার হওয়া যায়। আমি (হুযাইয়্যা) বললাম, বাচ্চা ভূমিষ্ঠ হলে (অর্থাৎ পেটে বাচ্চা পাওয়া গেলে) তিনি বললেন, বাচ্চাটিকেও এর সাথে যবেহ কর। আমি বললাম, গরুটি খোড়া হলে? তিনি বললেন, যদি তা কুরবানীর স্থান পর্যন্ত হেঁটে যেতে পারে (তবে তা কুরবানী করা যাবে)। আমি বললাম, তার শিং ভাঙ্গা হলে? তিনি বললেন, এতে কোন সমস্যা নেই। আমাদেরকে আদেশ করা হয়েছে অথবা আমরা যেন কুরবানীর পশুর (কেনার সময়) দুই চোখ ও দুই কান - ভালভাবে দেখে নেই। হাসান, ইবনু মা-জাহ (৩১৪৩) এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। এ হাদীসটিকে সুফিয়ান সাওরী ও সালামা ইবনু কুহাইলের সূত্রে বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1504,
			"arabicnumber": 1504,
			"text": "১৫০৪। আলী (রাঃ) বলেছেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম শিং ভাঙ্গা ও কান কাটা পশু কুরবানী করতে মানা করেছেন। কাতাদা (রাহঃ) বলেছেন, আমি এ প্রসঙ্গে সাঈদ ইবনুল মুসাইয়িব (রাহঃ)-এর নিকট উল্লেখ করলে তিনি বলেন, \"আল-আযব’ দ্বারা শিং-এর অর্ধেক বা তার বেশী ভাঙ্গাকে বুঝায়। যঈফ, ইবনু মাজাহ (৩১৪৫) আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1505,
			"arabicnumber": 1505,
			"text": "১৫০৫। আতা ইবনু ইয়াসার (রহঃ) বলেন, আবূ আইয়ুব (রাঃ)-কে আমি প্রশ্ন করলাম, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের যামানায় কুরবানীর বিধান কেমন ছিল। তিনি বললেন, কোন লোক তার ও তার পরিবারের সদস্যদের পক্ষে একটি ছাগল দ্বারা কুরবানী আদায় করত এবং তা নিজেরাও খেত, অন্যান্য লোকদেরকেও খাওয়াত। অবশেষে মানুষেরা গর্ব ও আভিজাত্যের প্রতিযোগিতায় অবতীর্ণ হয়। ফলে পরিস্থিতি যা দাড়িয়েছে তা তুমি নিজেই দেখতে পাচ্ছ। সহীহ, ইবনু মা-জাহ (৩১৪৭) এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। উমারা ইবনু আবদুল্লাহ (রহঃ) মদীনার বাসিন্দা ছিলেন। তার সূত্রে মালিক ইবনু আনাস (রহঃ) হাদীস বর্ণনা করেছেন। এ হাদীস মোতাবেক কিছু অভিজ্ঞ আলিম আমল করেছেন। এই অভিমত দিয়েছেন ইমাম আহমাদ ও ইসহাক (পুরো পরিবারের জন্য একটি কুরবানীই যথেষ্ট)। তারা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের এ হাদীসটিকে নিজেদের মতের সমর্থনে দলিল হিসেবে পেশ করেছেনঃ “তিনি একটি মেষ কুরবানী করলেন এবং বললেন, আমার উন্মাতের মধ্যে যারা কুরবানী করতে অক্ষম তাদের পক্ষে এই কুরবানী”। অপর একদল অভিজ্ঞ আলিম বলেছেন, একটি ছাগল শুধু একজনের পক্ষে যথেষ্ট। এই মতটি দিয়েছেন আবদুল্লাহ ইবনুল মুবারাক এবং অন্যান্য আলিমগণ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1506,
			"arabicnumber": 1506,
			"text": "১৫০৬। জাবালা ইবনু সুহাইম (রহঃ) হতে বর্ণিত আছে, এক ব্যক্তি ইবনু উমার (রাঃ)-কে কুরবানী প্রসঙ্গে প্রশ্ন করল, এটা কি ওয়াজিব। তিনি বললেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কুরবানী করেছেন এবং মুসলিমগণও (কুরবানী করেছেন)। সে আবার (একই বিষয়ে) প্রশ্ন করলে তিনি বললেন, তুমি কি বুঝেছো। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কুরবানী করেছেন এবং মুসলিমগণও। যঈফ, মিশকাত তাহকীক ছানী (১৪৭৫) আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। আলিমগণ এ হাদীসের বক্তব্য অনুযায়ী আমল করেছেন। তাদের মতে কুরবানী ওয়াজিব নয়, বরং রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সুন্নাতসমূহের অন্তর্ভুক্ত একটি সুন্নাত। তিনি এ কাজটি করা পছন্দ করতেন। সুফিয়ান সাওরী ও ইবনুল মুবারাকের এই মত।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1507,
			"arabicnumber": 1507,
			"text": "১৫০৭। ইবনু উমার (রাঃ) হতে বর্ণিত আছে, তিনি বলেছেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মদীনায় দশ বছর থেকেছেন এবং বরাবর (প্রতি বছর) কুরবানী করেছেন। যঈফ, দেখুন পূর্বের হাদীস। আবূ ঈসা বলেন, এ হাদীসটি হাসান।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1508,
			"arabicnumber": 1508,
			"text": "১৫০৮। বারাআ ইবনু আযিব (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, কুরবানীর দিন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের সামনে খুৎবা প্রদান করলেন। তিনি বললেনঃ (ঈদের) নামায আদায়ের আগে তোমাদের কোন ব্যক্তি যেন কুরবানী না করে। বর্ণনাকারী বলেন, আমার মামা দাড়িয়ে বললেন, হে আল্লাহর রাসূল! আজকের দিন তো এমন যে, পরে গোশত অপছন্দ লাগে। তাই আমি আমার পরিবারের সদস্যদের এবং প্রতিবেশীদেরকে খাওয়ানোর জন্য কুরবানী করে ফেলেছি। তিনি বললেন, তুমি আবার একটি পশু যবেহ করে দাও। তিনি বললেন, হে আল্লাহর রাসূল! দুধ খায় এমন একটি বকরীর বাচ্চা এখনও আমার নিকট আছে, যা দু'টি হৃষ্টপুষ্ট বকরীর চাইতেও উত্তম। আমি কি এটাকে যবেহ করে দেব? তিনি বললেন, হ্যাঁ, তোমার জন্য এটা উত্তম কুরবানী। তবে বকরীর এরূপ বাচ্চা কুরবানী করা তোমার পর আর কারো জন্য বৈধ হবে না। সহীহ, ইরওয়া (২৪৯৫), সহীহ আবূ দাউদ (২৪৯৫-২৪৯৬), মুসলিম, বুখারী অনুরূপ বর্ণনা করেছেন। জাবির, জুনদাব, আনাস, উয়াইমির ইবনু আশকার, ইবনু উমার ও আবূ যাইদ আল-আনসারী (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। এ হাদীস মোতাবিক বেশির ভাগ অভিজ্ঞ আলিম আমল করেছেন। তাদের মত অনুযায়ী শহরবাসী জনগণের জন্য ইমামের নামায সমাপ্তির পূর্বে কুরবানী করা বৈধ নয়। একদল আলিম গ্রামবাসীদের জন্য ফজরের নামাযের সময় হওয়ার পরই কুরবানীর সম্মতি দিয়েছেন। এই মত দিয়েছেন ইবনুল মুবারাকও। এ বিষয়ে আলিমদের মধ্যে ঐকমত্য রয়েছে যে, ছয় মাসের বকরীর বাচ্চা কুরবানী করা হলে তা যথেষ্ট হবে না। কিন্তু ছয় মাসের মেষের বাচ্ছা কুরবানী করলে তা বৈধ হবে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1509,
			"arabicnumber": 1509,
			"text": "১৫০৯। ইবনু উমর (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের মধ্যে কোন ব্যক্তি তার কুরবানীর গোশত যেন তিন দিনের অধিক না খায়। সহীহ, ইরওয়া (১১৫৫), বুখারী, মুসলিম অনুরূপ এই বিধান পরবর্তী হাদীসের দ্বারা বাতিল হয়ে গেছে। আইশা ও আনাস (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। ইবনু উমার (রাঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। তিন দিনের পরে কুরবানীর গোশত খেতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক সময় নিষেধ করেছিলেন এবং পরবর্তীতে তা (বেশি দিন) খাওয়ার সম্মতি দেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1510,
			"arabicnumber": 1510,
			"text": "১৫১০। সুলাইমান ইবনু বুরাইদা (রাঃ) হতে তার বাবার সূত্রে বর্ণিত আছে, তিনি (বুরাইদা) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কুরবানীর গোশত তিন দিনের পরেও রাখতে (খেতে) আমি তোমাদেরকে বারণ করেছিলাম, যেন সম্পদশালীরা উদারহস্তে তাদের গোশত দরিদ্রদের মধ্যে দান করে। এখন তোমরা ইচ্ছামত তৃপ্তিসহকারে তা খাও, অন্যকে খাওয়াও এবং জমা করেও রাখতে পার। সহীহ, ইরওয়া (৪/৩৬৮-৩৬৯), মুসলিম ইবনু মাসউদ, আইশা, নুবাইশা, আবূ সাঈদ, কাদাতা ইবনু নুমান, আনাস ও উম্মু সালামা (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। বুরাইদা (রাঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। এ হাদীস মোতাবিক রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের অভিজ্ঞ সাহাবী এবং অপরাপর আলিমগণ আমল করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1511,
			"arabicnumber": 1511,
			"text": "১৫১১। আবিস ইবনু রবীআহ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমি উম্মুল মু'মিনীন (আইশা)-কে প্রশ্ন করলাম, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কি কুরবানীর গোশত (তিন দিনের বেশী) খেতে মানা করেছিলেন? তিনি বললেনঃ না, তবে কুরবানী করার মত সামর্থ্যবান লোকের সংখ্যা ছিল খুবই কম। তাই তিনি চাচ্ছিলেন, যারা কুরবানী করতে সমর্থ হয়নি তারাও যেন গোশত খেতে পারে। আমরা কুরবানীর পশুর পায়া রেখে দিতাম এবং দশ দিন পরও তা খেতাম। এই বর্ণনাটি দুর্বল, এর মূল বক্তব্য সহীহ মুসলিমে বর্ণিত আছে। ইরওয়া (৪/৩৭০) আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। এখানে উম্মুল মু'মিনীন বলতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের স্ত্রী আইশা (রাঃ)-কে বুঝানো হয়েছে। উল্লেখিত হাদীসটি বিভিন্ন সূত্রে তার নিকট হতে বর্ণিত হয়েছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1512,
			"arabicnumber": 1512,
			"text": "১৫১২। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ (এখন আর কোন) ফারাআ নেই, আতীরাহও নেই। সহীহ, ইবনু মা-জাহ (৩১৬৮), নাসা-ঈ উট বা ছাগল-ভেড়ার প্রথম বাচ্চাকে ফারাআ বলে। আরব মুশরিকরা এটাকে তাদের দেব-দেবীর নামে উৎসর্গ করার উদ্দেশ্যে যবেহ করত। নুবাইশা, মিখনাফ ইবনু সুলাইম ও আবিল উশারার পিতা (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। রজাব মাস হারাম মাসগুলোর মধ্যে প্রথম মাস হওয়ার কারণে এর সম্মানার্থে আরব মুশরিকরা পশু যবেহ করত। এ উদ্দেশ্যে যবেহকৃত পশুকে আতীরাহ বলে। হারাম মাসগুলো হচ্ছেঃ রজব, যিলকাদ, যিলহাজ্জ ও মুহাররাম। হাজ্জের মাসগুলো হচ্ছেঃ শাওয়াল, যিলকাদ ও যিলহজ্জের প্রথম দশদিন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের কয়েকজন সাহাবী ও তৎপরবতীদের হতে হাজের মাসগুলি প্রসঙ্গে এমতই বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1513,
			"arabicnumber": 1513,
			"text": "১৫১৩। ইউসুফ ইবনু মাহাক (রহঃ) হতে বর্ণিত আছে, তারা কয়েকজন একত্রিত হয়ে আবদুর রাহমানের মেয়ে হাফসার নিকট গেলেন। তারা তাকে আকীকার ব্যপারে প্রশ্ন করলে তিনি তাদেরকে জানান যে, তাকে আইশা (রাঃ) জানিয়েছেন, ছেলে সন্তানের পক্ষে একই বয়সের দুটি বকরী এবং মেয়ে সন্তানের পক্ষে একটি বকরী আকীকা দেওয়ার জন্যে তাদেরকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নির্দেশ দিয়েছেন। সহীহ, ইবনু মা-জাহ (৩১৩৬) আলী, উম্মু কুরজ, বুরাইদা, সামুরা, আবূ হুরায়রা, আব্দুল্লাহ ইবনু আমর, আনাস, সালমান ইবনু আমির ও ইবনু আব্বাস (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আইশা (রাঃ)-এর হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। হাফসা হচ্ছেন আবূ বাকর (রাঃ)-এর ছেলে আবদুর রাহমানের মেয়ে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1514,
			"arabicnumber": 1514,
			"text": "১৫১৪। উবাইদুল্লাহ ইবনু আবূ রাফি (রাঃ) হতে তার পিতার সূত্রে বর্ণিত আছে, তিনি (আবূ রাফি) বলেন, ফাতিমা (রাঃ) হাসান ইবনু আলী (রাঃ)-কে প্রসব করলে আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে হাসানের কানে নামাযের আযানের মতই আযান দিতে দেখেছি। যঈফ, যঈফা নতুন সংস্করণ (১/৪৯৩) আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। আকীকা প্রসঙ্গে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বিভিন্ন সূত্রে বর্ণিত হাদীস \"ছেলে সন্তানের পক্ষ হতে সমবয়সী দুটি বকরী এবং মেয়ে সন্তানের পক্ষ হতে একটি বকরী যবেহ করতে হবে\" অনুযায়ী আমল করতে হবে। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে আরো বর্ণিত আছে যে, তিনি একটি বকরী দিয়ে হাসান ইবনু আলীর আকীকা করেছেন। একদল বিশেষজ্ঞ আলিম এ হাদীস অনুযায়ী আমল করার পক্ষে মত দিয়েছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1515,
			"arabicnumber": 1515,
			"text": "১৫১৫। সালমান ইবনু আমির আয-যাববী (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ প্রত্যেক শিশুর পক্ষেই আকীকা করা দরকার। অতএব তার পক্ষ হতে তোমরা রক্ত প্রবাহিত কর (পশু যবেহ কর) এবং তার হতে ময়লা (বা কষ্টদায়ক বস্তু, যেমন চুল) দূর কর। সহীহ, ইবনু মা-জাহ (৩১৬৪) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের এরূপ হাদীস আল-হাসান ইবনু আইয়ান-আবদুর রাযযাক হতে, তিনি ইবনু উয়াইনা হতে, তিনি আসিম ইবনু সুলাইমান আল-আহওয়াল হতে, তিনি হাফসা (রাঃ) হতে এইসূত্রে বর্ণিত হয়েছে। এই হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1516,
			"arabicnumber": 1516,
			"text": "১৫১৬। উম্মু কুরয (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট তিনি আকীকার ব্যপারে প্রশ্ন করেন। তিনি বললেনঃ ছেলে সন্তানের পক্ষে দুটি বকরী এবং মেয়ে সন্তানের পক্ষে একটি বকরী (আকীকা দিতে হবে)। আকীকার পশু নর বা মাদী যাই হোক না কেন তাতে তোমাদের কোন অসুবিধা নেই। সহীহ, ইরওয়া (৪/৩৯১) এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1517,
			"arabicnumber": 1517,
			"text": "১৫১৭। আবূ উমামা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কুরবানীর জন্য উত্তম পশু হল মেষ এবং উত্তম কাফন হল হুল্লা (হুল্লা অর্থ– নতুন কাপড় অথবা সমস্ত শরীর আবূত করে এমন কাপড়)। যঈফ, ইবনু মাজাহ (৩১৬৪) আবূ ঈসা বলেন, এ হাদীসটি গারীব। উফাইর ইবনু মাদানকে হাদীস শাস্ত্রে দুর্বল সাব্যস্ত করা হয়েছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1518,
			"arabicnumber": 1518,
			"text": "১৫১৮। মিখনাফ ইবনু সুলাইম (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমরা আরাফাতের মাঠে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সাথে ছিলাম। আমি তাকে বলতে শুনেছিঃ হে জনসমষ্টি! প্রতি বছর প্রতিটি পরিবারের পক্ষ হতে কুরবানী ও আতীরা রয়েছে। তোমরা কি জান, আতীরা কী? তোমরা যাকে রাজাবিয়া বল এটা তাই। সহীহ, ইবনু মা-জাহ (৩১২৫) এ হাদীসটিকে আবূ ঈসা হাসান গরীব বলেছেন। আমরা এ হাদীসটি শুধুমাত্র উল্লেখিত সূত্রেই ইবনু আওনের রিওয়ায়াত হিসাবে জেনেছি।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1519,
			"arabicnumber": 1519,
			"text": "১৫১৯। আলী ইবনু আবী তালিব (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, একটি বকরী দ্বারা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হাসানের আকীকা করেন এবং বলেনঃ হে ফাতিমা! তার মাথা নেড়া করে দাও এবং তার চুলের ওজনের অনুরূপ রূপা দান কর। তদানুযায়ী আমি তার চুল ওজন করলাম এবং তার ওজন এক দিরহাম বা তার কাছাকাছি হয়। হাসান, ইরওয়া (১১৭৫) এ হাদীসটিকে আবূ ঈসা হাসান গারীব বলেছেন। এর সনদ পরস্পর সংযুক্ত (মুত্তাসিল) নয়। বর্ণনাকারী আবূ জাফর মুহাম্মাদ ইবনু আলী হুসাইন (রাহঃ) আলী ইবনু আবূ তালিব (রাঃ)-এর সাক্ষাত পাননি।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1520,
			"arabicnumber": 1520,
			"text": "১৫২০। আবদুর রাহমান ইবনু আবূ বাকরা (রহঃ) হতে তার বাবার সুত্রে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঈদের নামাযের (পর) খুৎবা প্রদান করলেন। তারপর মিম্বার হতে নেমে দুটি মেষ আনতে বললেন। তারপর এ দু'টোকে তিনি যবেহ করলেন। সহীহ, মুসলিম (৫/১০৮) এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1521,
			"arabicnumber": 1521,
			"text": "১৫২১। জাবির ইবনু আবদুল্লাহ (রাঃ) হতে বর্ণিত আছে, তিনি ৰলেন, আমি মাঠে হাযির হলাম নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সাথে ঈদুল আযহার নামায আদায়ের উদ্দেশ্যে। তিনি খুৎবা সমাপ্তির পর তার মিম্বার হতে নামলেন। তারপর একটি ভেড়া আনা হলে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তা নিজ হাতে যবেহ করলেন এবং বললেনঃ “আল্লাহ্ তা'আলার নামে, আল্লাহ মহান, এই কুরবানী আমার পক্ষ হতে এবং আমার উম্মাতের যে সকল ব্যক্তিরা কুরবানী করতে পারেনি তাদের পক্ষ হতে। সহীহ, ইরওয়া (১১৩৮), সহীহ আবূ দাউদ (২৫০১) এ হাদীসটিকে আবূ ঈসা উল্লেখিত সনদ সূত্রে গারীব বলেছেন। এ হাদীস মোতাবিক রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের অভিজ্ঞ সাহাবী ও অপরাপর আলিমগণ আমল করেছেন। তারা মনে করেন যবাহের সময় “বিসমিল্লাহি আল্লাহু আকবার\" বলতে হবে। এই মত দিয়েছেন ইবনুল মুবারাকও। মুত্তালিবের পুত্র আবদুল্লাহ ইবনু হানতাব প্রসঙ্গে কথিত আছে যে, জাবির (রাঃ)-এর নিকট হতে তিনি কিছু শুনার সুযোগ লাভ করেননি।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1522,
			"arabicnumber": 1522,
			"text": "১৫২২। সামুরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ সকল শিশুই তার আকীকার সাথে বন্ধক (দায়বদ্ধ) অবস্থায় থাকে। জনুগ্রহণ করার সপ্তম দিনে তার পক্ষে যবেহ করতে হবে, তার নাম রাখতে হবে এবং তার মাথা নেড়া করতে হবে। সহীহ, ইবনু মা-জাহ (৩১৬৫) আল-হাসান ইবনু আলী আল-খাল্লাল-ইয়াজীদ ইবনু হারুন হতে, তিনি সাঈদ ইবনু আবূ আরুবা হতে, তিনি কাতাদা হতে, তিনি আল-হাসান হতে, তিনি সামুরা ইবনু জুনদাব (রাঃ) হতে, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এই সূত্রেও উপরে বর্ণিত হাদীসের মতো বর্ণিত হয়েছে। এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। এ হাদীস মোতাবিক অভিজ্ঞ আলিমগণ আমল করেছেন। তারা মনে করেন শিশু জন্মগ্রহণ করার সপ্তম দিনে তার পক্ষে আকীকা করাটা মুস্তাহাব, সপ্তম দিনে অক্ষম হলে চৌদতম দিনে এবং সেই তারিখেও অক্ষম হলে একুশতম দিনে। তারা আরো বলেন, যে ধরনের বকরী কুরবানীর জন্য বৈধ সেই ধরনের বকরী আকীকার জন্যও বৈধ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1523,
			"arabicnumber": 1523,
			"text": "১৫২৩। উম্মু সালামা (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে লোক যিলহাজের নতুন চাঁদ দেখেছে এবং কুরবানীর নিয়াত করেছে সে যেন নিজের চুল ও নখ (কুরবানী পূর্ব পর্যন্ত) না কাটে। সহীহ, ইবনু মা-জাহ (৩১৪৯), মুসলিম এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। সহীহ বর্ণনামতে নামটি হবে আমর ইবনু মুসলিম (উমার ইবনু মুসলিম নয়)। তার নিকট হতে মুহাম্মাদ ইবনু আমর ইবনু আলকামা ও অন্যান্য বর্ণনাকারীগণ হাদীস বর্ণনা করেছেন। এ হাদীসটি একাধিকভাবে সাঈদ ইবনুল মুসাইয়্যিব হতে, তিনি আবূ সালামা হতে, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এই সূত্রে অনুরূপ বর্ণিত হয়েছে। একদল আলিমের এই অভিমত (তারা কুরবানী করার আগে নখ-চুল না কাটার কথা বলেছেন)। এ কথা বলেছেন সাঈদ ইবনুল মুসইয়্যিবও। এ হাদীস মোতাবিক আহমাদ ও ইসহাকও আমল করেছেন। নখ-চুল কাটার পক্ষে অন্য একদল আলিম সম্মতি প্রদান করেছেন। তারা বলেছেন, (কুরবানী করার পূর্বে) নখ-চুল কাটায় সমস্যা নেই। একথা বলেছেন শাফিঈ। তিনি দলীল হিসাবে আইশা (রাঃ)-এর বর্ণিত হাদীস দেখিয়েছেন। \"মদীনা হতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (মক্কায়) কুরবানীর পশু পাঠাতেন। কিন্তু যেসব কাজ হতে মুহরিম বিরত থাকে তিনি তা হতে বিরত থাকতেন না।”",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 36
			}
		}
	]
}