{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"27": "Chapters on Righteousness And Maintaining Good Relations With Relatives"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1897,
			"arabicnumber": 1897,
			"text": "১৮৯৭। বাহয ইবনু হাকীমের দাদা [মু'আবিয়া ইবনু হাইদা (রাঃ)] হতে বর্ণিত আছে, তিনি বলেন, আমি বললাম, হে আল্লাহর রাসূল কোন ব্যক্তির সাথে আমি উত্তম আচরণ করব? তিনি বললেনঃ তোমার মায়ের সাথে। আমি প্রশ্ন করলাম, এরপর কার সাথে? তিনি বললেনঃ তোমার মায়ের সাথে। আমি আবার প্রশ্ন করলাম, এরপর কার সাথে? তিনি বললেনঃ তোমার মায়ের সাথে। আমি আবার প্রশ্ন করলাম, এরপর কার সাথে? তিনি বললেনঃ তারপর তোমার বাবার সাথে, তারপর নিকটাত্মীয়তার ক্রমানুসারে উত্তম আচরণ করবে। হাসান, মিশকাত (৪৯২৯) আবূ হুরাইরা, আবদুল্লাহ ইবনু আমর, আইশা ও আবূদ দারদা (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, বাহয ইবনু হাকীমের অপর নাম আবূ মুআবিয়া ইবনু হাইদা। এ হাদীসটি হাসান। শুবা (রাহঃ) বাহয ইবনু হাকীমের সমালোচনা করেছেন। কিন্তু হাদীস পারদর্শীদের মতে তিনি একজন সিকাহ বর্ণনাকারী। তার নিকট হতে মামার, সুফিয়ান সাওরী, হাম্মাদ ইবনু সালামা প্রমুখ হাদীসের ইমামগণ হাদীস বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1898,
			"arabicnumber": 1898,
			"text": "১৮৯৮। ইবনু মাসউদ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমি রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে বললাম, হে আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)। কোন কাজটি সবচাইতে উত্তম? তিনি বললেনঃ নামায তার নির্ধারিত সময়ে আদায় করা। আমি আবার প্রশ্ন করলাম, হে আল্লাহর রাসূল এরপর কোনটি? তিনি বললেনঃ বাবা-মায়ের সাথে উত্তম আচরণ করা। আমি আবাৱো প্রশ্ন করলাম, হে আল্লাহর রাসূল তারপর কোনটি? তিনি বললেনঃ আল্লাহ্ তা'আলার পথে জিহাদ করা। এরপর আমাকে কিছু বলা হতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নীরব থাকেন। আমি তাকে আরো প্রশ্ন করলে নিশ্চয়ই আমাকে তিনি আরো জানাতেন। সহীহ, সহীহা (১৪৮৯), বুখারী, মুসলিম আবূ আমরের নাম সা’দ ইবনু ইয়াস। এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। এ হাদীসটি আল-ওয়ালীদ ইবনুল আইযার হতে আশ-শাইবানী ও শুবা-সহ একাধিক বর্ণনাকারী বর্ণনা করেছেন। আবূ আমর আশ-শাইবানী-ইবনু মাসউদ (রাঃ) হতে একাধিকসূত্রে এ হাদীসটি বর্ণিত হয়েছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1899,
			"arabicnumber": 1899,
			"text": "১৮৯৯। আবদুল্লাহ ইবনু আমর (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ বাবার সন্তুষ্টির মধ্যেই আল্লাহ তা'আলার সস্তুষ্টি এবং বাবার অসন্তুষ্টির মধ্যেই আল্লাহ তা'আলার অসন্তুষ্টি রয়েছে। সহীহ, সহীহা (৫১৫) উপরোক্ত হাদীসের মতো হাদীস মুহাম্মাদ ইবনু বাশশার-মুহাম্মাদ ইবনু জাফর হতে, তিনি শুবা হতে, তিনি ইয়ালা ইবনু আতা হতে, তিনি তার পিতা-আবদুল্লাহ ইবনু আমর (রাঃ) হতে এই সূত্রেও বর্ণিত হয়েছে। এটাকে তিনি মারফু হাদীস হিসেবে বর্ণনা করেননি এবং এটাই অনেক বেশি সহীহ। আবূ ঈসা বলেন, এটিকে শুবার সঙ্গীগণ একইভাবে মাওকৃফ হিসেবে শুবা হতে, তিনি ইয়ালা ইবনু আতা হতে, তিনি তার পিতা-আবদুল্লাহ ইবনু আমর (রাঃ)-এর সূত্রে বর্ণনা করেছেন। এটা শুবার সূত্রে মারফু (রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের বাণী) হিসাবে শুধু খালিদ ইবনুল হারিস (রাহঃ) বর্ণনা করেছেন। খালিদ ইবনুল হারিস একজন সিকাহ ও বিশ্বস্ত বর্ণনাকারী। মুহাম্মাদ ইবনুল মুসান্না বলেন, আমি বসরায় খালিদের সমতুল্য এবং কৃফায় আবদুল্লাহ ইবনু ইদরীসের মতো যোগ্য কোন ব্যক্তিকে দেখিনি। আব্দুল্লাহ ইবনু মাসউদ (রাঃ) হতেও এ অনুচ্ছেদে হাদীসটি বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1900,
			"arabicnumber": 1900,
			"text": "১৯০০। আবূদ দারদা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, তার কাছে একজন লোক এসে বলল, আমার এক স্ত্রী আছে। আমার মা আমাকে নির্দেশ দিচ্ছেন তাকে তালাক দেয়ার জন্য। আবূদ দারদা (রাঃ) বললেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে আমি বলতে শুনেছিঃ জান্নাতের সর্বোত্তম দরজা হচ্ছে বাবা। তুমি ইচ্ছা করলে এটা ভেঙ্গে ফেলতে পার অথবা এর রক্ষণাবেক্ষণও করতে পার। সহীহ, সহীহা (৯১০), মিশকাত, তাহকীক ছানী (৪৯২৮) ইবনু আবী উমার বলেনঃ সুফিয়ান কখনো মায়ের কথা বলেছেন আবার কখনো বাবার কথা বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1901,
			"arabicnumber": 1901,
			"text": "১৯০১। আবদুর রাহমান ইবনু আবী বাকরা (রাঃ) হতে তার বাবার সূত্রে বর্ণিত আছে, তিনি (আবূ বাকরা) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমি কি তোমাদেরকে সর্বাধিক কাবীরা গুনাহের ব্যাপারে জানিয়ে দিবো না? সাহাবীগণ বললেন, হে আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)। অবশ্যই জানিয়ে দিন। তিনি বললেনঃ আল্লাহ্ তা'আলার সাথে অংশীদারিতু স্থাপন করা এবং বাবা-মায়ের অবাধ্য হওয়া। বর্ণনাকারী বলেন, তিনি হেলান দিয়ে বসা ছিলেন। তিনি সোজা হয়ে বসেন এবং বলেনঃ এবং মিথ্য সাক্ষ্য দেয়া ও মিথ্যা বলা। একথাটি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অবিরতভাবে বলতে থাকেন। আমরা (মনে মনে) বলতে লাগলাম, আহা! তিনি যদি থামতেন, চুপ করতেন! সহীহ, গাইয়াতুল মারাম (২৭৭), বুখারী মুসলিম আবূ সাঈদ (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। আবূ বাকরার নাম নুফাই, পিতা আল-হারিস।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1902,
			"arabicnumber": 1902,
			"text": "১৯০২। আবদুল্লাহ ইবনু আমর (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন ব্যক্তি কর্তৃক তার বাবা-মাকে গালিগালাজ করা কাবীরা গুনাহ৷ সাহাবীগণ বললেন, হে আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)। কেউ কি তার মা-বাবাকে গালিগালাজ করতে পারে? তিনি বললেনঃ হ্যাঁ। কোন লোক অন্য কারো বাবাকে গালি দেয়। এর উত্তরে সেও তার বাবাকে গালি দেয়। সে অন্য কারো মাকে গালি দেয়। এর উত্তরে ঐ ব্যক্তিও তার মাকে গালি দেয়। সহীহ, তা’লীকুর রাগীব (৩/২২১)। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1903,
			"arabicnumber": 1903,
			"text": "১৯০৩। ইবনু উমার (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে আমি বলতে শুনেছিঃ সর্বাধিক সাওয়াবের কাজ হচ্ছে বাবার বন্ধু-বান্ধবদের সাথেও সম্পর্ক বজায় রাখা। সহীহ, যঈফা (২০৮৯), মুসলিম। আবূ উসাইদ (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, এ হাদীসের সনদ সহীহ। এ হাদীসটি ইবনু উমার (রাঃ) হতে অন্যান্য সূত্রেও বর্ণিত হয়েছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1904,
			"arabicnumber": 1904,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1905,
			"arabicnumber": 1905,
			"text": "১৯০৫। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তিন প্রকারের দুআ অবশ্যই মঞ্জুর করা হয়, তাতে কোনরকম সন্দেহ নেই। নির্যাতিত ব্যক্তির দুআ, মুসাফিরের দু'আ এবং সন্তানের প্রতি বাবার বদ-দুআ। হাসান, ইবনু মা-জাহ (৩৮৬২)। আবূ ঈসা বলেন, এই হাদীসটি ইয়াহইয়া ইবনু আবী কাসীরের সূত্রে হাজ্জাজ আস-সাওয়াফ হিশামের রিওয়ায়াতের মতোই বর্ণনা করেছেন। আবূ হুরাইরা (রাঃ) হতে যে আবূ জাফার হাদীসটি বর্ণনা করেন তিনি হলেন আবূ জাফার আল-মুআযযিন। তার নাম সম্পর্কে আমরা অজ্ঞ। ইয়াহইয়া ইবনু আবী কাসীরও তার সূত্রে একাধিক হাদীস বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1906,
			"arabicnumber": 1906,
			"text": "১৯০৬। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ সন্তান কোন অবস্থাতেই তার বাবার সম্পূর্ণ অধিকার আদায়ে সক্ষম নয়। কিন্তু সে তার বাবাকে গোলাম অবস্থায় পেলে এবং তাকে কিনে মুক্ত করে দিলে তবে সামান্য অধিকার আদায় হয়। সহীহ, ইবনু মা-জাহ (৩৬৫৯), মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। আমরা এ হাদীস বিষয়ে শুধুমাত্র সুহাইল ইবনু আবূ সালিহ এর সুত্রেই জানতে পেরেছি। এ হাদিসটি সুহাইল ইবনু আবূ সালিহ এর সুত্রে সুফিয়ান সাওরী ও একাধিক বর্ণনাকারী বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1907,
			"arabicnumber": 1907,
			"text": "১৯০৭। আবূ সালামা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আবূর রাদ্দাদ (রাঃ) একবার অসুস্থ হলে তাকে আবদুর রাহমান ইবনু আওফ (রাঃ) দেখতে আসেন। আবূর রাদ্দাদ (রাঃ) বলেন, আমার জানামতে সবচেয়ে উত্তম ও সর্বাধিক আত্মীয়তার সম্পর্ক বজায় রক্ষাকারী ব্যক্তি হলেন আবূ মুহাম্মাদ (আবদুর রাহমান)। আবদুর রাহমান (রাঃ) বললেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে বলতে শুনেছিঃ পরিপূর্ণ কল্যাণ ও প্রাচুর্যের অধিকারী আল্লাহ তা'আলা বলেনঃ \"আমিই আল্লাহ এবং আমিই রাহমান। আত্মীয়তার সম্পর্ককে আমিই সৃষ্টি করেছি এবং আমার নাম হতে নির্গত করে এই নাম (রাহমান হতে রেহেম) রেখেছি। যে ব্যক্তি এই সম্পর্ক বহাল রাখবে আমিও তার সাথে (রহমতের) সম্পর্ক বহাল রাখব। আর এই সম্পর্ক যে ব্যক্তি ছিন্ন করবে আমিও তার হতে (রহমতের) সম্পর্ক ছিন্ন করব”। সহীহ, সহীহাহ (৫২০)। আবূ সাঈদ, ইবনু আবী আওফা, আমির ইবনু রাবীআ, আবূ হুরাইরা ও জুবাইর ইবনু মুতঈম (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবু ঈসা বলেন, যুহরীর সুত্রে আবু সুফিয়ান কর্তিক বর্ণিত হাদিসটি সহীহ। মামার এই হাদীসটি বর্ণনা করেছেন যুহরী হতে, তিনি আবূ আওফ (রাঃ)-এর সূত্রে। মুহাম্মাদ বলেন, মামার বর্ণিত রিওয়ায়াতটিতে ভুল আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1908,
			"arabicnumber": 1908,
			"text": "১৯০৮৷ আবদুল্লাহ ইবনু আমর (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ সমানুরূপ ব্যবহারের মনোভাব নিয়ে সম্পর্ক রক্ষাকারী আত্মীয়তার সম্পর্ক রক্ষাকারী নয়, বরং কেউ কোন ব্যক্তির সাথে সম্পর্ক নষ্ট করলেও সে যদি তার সাথে সম্পর্ক বজায় রাখে তবে সে-ই হচ্ছে প্রকৃত সম্পর্ক স্থাপনকারী। সহীহ, গাইয়াতুল মারাম (৪০৪), সহীহ আবূ দাউদ (১৪৮৯), বুখারী, মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। সালমান, আইশা ও আবদুল্লাহ ইবনু উমার (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1909,
			"arabicnumber": 1909,
			"text": "১৯০৯। মুহাম্মাদ ইবনু জুবাইর (রহঃ) হতে তার বাবার সূত্রে বর্ণিত আছে, তিনি (জুবাইর) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কর্তনকারী (আত্মীয়তার সম্পর্ক ছিন্নকারী) জান্নাতে যেতে পারবে না। সহীহ, গাইয়াতুল মারাম (৪০৮), সহীহ আবূ দাউদ (১৪৮৮), বুখারী, মুসলিম। ইবনু আবী উমার বলেন, সুফিয়ান বলেছেন, অর্থাৎ আত্মীয়তার সম্পর্ক ছিন্নকারী। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1910,
			"arabicnumber": 1910,
			"text": "১৯১০। উমার ইবনু আবদুল আযীয (রহঃ) বলেছেন, খাওলা বিনতি হাকীম (রাঃ) একজন সৎকর্মশীলা মহিলা। তিনি বলেছেন, একদিন রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর কন্যা ফামিমা (রাঃ)-এর দুই ছেলের একজনকে কোলে করে বাহিরে এলেন। তখন তিনি বলেনঃ (সন্তানের মুহাব্বাতে) তোমরাই কৃপণতা, কাপুরষতা ও অজ্ঞতার কারণ হও। তোমরা হলে আল্লাহ তা'আলার বাগানের সুগন্ধি ফুল। যঈফ, যঈফা (৩২১৪) এ অনুচ্ছেদে ইবনু উমার ও আশআস ইবনু কাইস (রাঃ) হতেও হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, শুধু উল্লেখিত সনদসূত্রেই আমরা এ হাদীসটি জেনেছি। খাওলা বিনতি হাকীম (রাঃ) হতে উমার ইবনু আবদুল আযীয (রহঃ) সরাসরি হাদীস শুনেছেন বলে আমাদের জানা নেই।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1911,
			"arabicnumber": 1911,
			"text": "১৯১১। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আল-আকরা ইবনু হাবিস (রাঃ) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে দেখলেন যে, তিনি হাসানকে চুমু খাচ্ছেন। ইবনু আবী উমার তার বর্ণনায় উল্লেখ করেছেন যে, তিনি হাসান অথবা হুসাইনকে চুমু খেয়েছেন। আল-আকরা (রাঃ) বলেন, আমার দশটি সন্তান আছে কিন্তু আমি তাদের কাউকে কখনো চুমু দেইনি। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ যে ব্যক্তি দয়া-অনুগ্রহ করে না সে দয়া-অনুগ্রহপ্রাপ্ত হয় না। সহীহ, তাখরাজ “মুশকিলাতুল ফাকর\" (১০৮), বুখারী, মুসলিম। আবূ ঈসা বলেন, আনাস ও আইশা (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ সালামার নাম আবদুল্লাহ, পিতা আবদুর রাহমান। এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1912,
			"arabicnumber": 1912,
			"text": "১৯১২। আবূ সাঈদ আল-খুদরী (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের মধ্যে যারই তিনটি মেয়ে অথবা তিনটি বোন আছে, সে তাদের সাথে স্নেহপূর্ণ ব্যবহার করলে জান্নাতে যাবে। যঈফ, দেখুন পূর্বের হাদীস আবূ ঈসা বলেনঃ এ অনুচ্ছেদে আইশা, উকবা ইবনু আমির, আনাস, জাবির, ইবনু আব্বাস, (রাঃ) হতেও হাদীস বর্ণিত আছে। আবূ সাঈদ আল-খুদরী-এর নাম সা’দ ইবনু মালিক ইবনু সিনান। সা'দ ইবনু আবূ ওয়াক্কাস (রাঃ)-এর পিতা মালিক ইবনু উহাইব। কোন কোন রাবী এ সনদে একজন রাবীকে যোগ করেছেন (তিনি হলেন সাঈদ ইবনু আবদুর রাহমান ও আবূ সাঈদ (রাঃ)-এর মাঝখানে আইউব ইবনু বাশীর)।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1913,
			"arabicnumber": 1913,
			"text": "১৯১৩। আইশা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তি তার মেয়ে সন্তানদের জন্য কোনরকম পরীক্ষার সম্মুখীন হয় (বিপদগ্ৰস্ত হয়), সে তাদের ব্যাপারে ধৈর্য ধরলে তার জন্য তারা জাহান্নাম হতে আবরণ (প্রতিবন্ধক) হবে। সহীহ, বুখারী, মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1914,
			"arabicnumber": 1914,
			"text": "১৯১৪। আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে লোক দুটি মেয়ে সন্তানকে লালন-পালন করবে, আমি এবং সে এভাবে একসাথে পাশাপাশি জান্নাতে যাব। এই বলে তিনি নিজের হাতের দুটি আঙ্গুল একত্র করে ইশারায় বুঝিয়ে দিলেন। সহীহ, সহীহাহ (২৯৭), মুসলিম। আবূ ঈসা বলেন, এই সূত্রে হাদীসটি হাসান গারীব।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1915,
			"arabicnumber": 1915,
			"text": "১৯১৫। আইশা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, একজন মহিলা তার দুই মেয়েসহ আমার নিকটে এল এবং আমার কাছে কিছু চাইল। কিন্তু একটি খেজুর ব্যতীত আমার নিকটে আর কিছুই ছিল না। আমি সেটিই তাকে দিলাম। সে খেজুরটিকে ভাগ করে তার দুই মেয়ের হাতে দিল এবং নিজে মোটেও খেল না। তারপর সে উঠে চলে গেল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঘরে আসার পর আমি বিষয়টি তাকে অবহিত করলাম। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ যে লোক মেয়ে সন্তানদের নিয়ে এ ধরনের পরীক্ষার (বিপদের) সম্মুখীন হয়, তারা তার জন্য জাহান্নামের প্রতিবন্ধক হয়ে দাড়াবে। সহীহ, তা’লীকুর রাগীব (৩/৮৩), মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। এই সনদ সূত্রে মুহাম্মাদ ইবনু উবাইদ মুহাম্মাদ ইবনু আব্দুল আযীয হতে একাধিক হাদীস বর্ণনা করেছেন। তিনি তার বর্ণনায় বর্ণনাকারীর নাম আবূ বাকর ইবনু উবাইদুল্লাহ ইবনু আনাস উল্লেখ করেছেন। সঠিক হল উবাইদুল্লাহ ইবনু আবী বাকর ইবনু আনাস।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1916,
			"arabicnumber": 1916,
			"text": "১৯১৬। আবূ সাঈদ আল-খুদরী (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যার তিনটি মেয়ে অথবা তিনটি বোন আছে, অথবা দুটি মেয়ে অথবা দুটি বোন আছে, সে তাদের প্রতি ভাল ব্যবহার করলে এবং তাদের (অধিকার) সম্পর্কে আল্লাহ্ তা'আলাকে ভয় করলে তার জন্য জান্নাত নির্ধারিত আছে। বর্ণিত শব্দে হাদীসটি যঈফ, সাহীহা (২৯৪) আবূ ঈসা বলেছেন, এ হাদীসটি গারীব।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1917,
			"arabicnumber": 1917,
			"text": "১৯১৭। ইবনু আব্বাস (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন ব্যক্তি মুসলিমদের কোন ইয়াতীমকে এনে নিজের পানাহারে শরীক করলে আল্লাহ তা'আলা তাকে জান্নাতে প্রবেশ করাবেন, যদি সে ক্ষমার অযোগ্য কোন গুনাহ না করে। যঈফ, তা’লীকুর রাগীব (৩/২৩০), যঈফা (৫৩৪৫) এ অনুচ্ছেদে মুররা আল-ফিহরী, আবূ হুরাইরা, আবূ উমামা, সাহল ইবনু সা’দ (রাঃ) হতেও হাদীস বর্ণিত আছে। আবূ ঈসা বলেনঃ হানাশের নাম হুসাইন ইবনু কাইস, উপনাম আবূ আলী আর-রাহবী। সুলাইমান আত-তাইমী বলেছেন, হাদীস বিশারদদের মতে হানাশ হাদীস শাস্ত্রে দুর্বল।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1918,
			"arabicnumber": 1918,
			"text": "১৯১৮। সাহল ইবনু সা'দ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমি ও ইয়াতীমের তত্ত্বাবধানকারী এই দুই আঙ্গুলের অনুরূপ একসাথে জান্নাতে বসবাস করব। এই কথা বলে তিনি তর্জনী ও মধ্যমা আঙ্গুল দিয়ে ইশারা করে দেখান। সহীহ, সহীহাহ (৮০০), বুখারী আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1919,
			"arabicnumber": 1919,
			"text": "১৯১৯। যারবী (রহঃ) হতে বর্ণিত আছে, তিনি বলেন, আনাস ইবনু মালিক (রাঃ)-কে আমি বলতে শুনেছিঃ একজন বয়স্ক লোক রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সাথে দেখা করার উদ্দেশ্যে আসে। লোকেরা তার জন্য পথ ছাড়তে বিলম্ব করে। (তা দেখে) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ যে লোক আমাদের শিশুদের আদর করে না এবং আমাদের বড়দের প্রতি সম্মান প্রদর্শন করে না সে আমাদের অন্তর্ভুক্ত নয়। সহীহ, সহীহাহ (২১৯৬) আবদুল্লাহ ইবনু আমর, আবূ হুরাইরা, ইবনু আব্বাস ও আবূ উমামা (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, এ হাদীসটি গারীব। আনাস (রাঃ) এবং অন্যান্য সাহাবী হতেও যারবীর বেশ কিছু মুনকার হাদীস রয়েছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1920,
			"arabicnumber": 1920,
			"text": "১৯২০। আমর ইবনু শুআইব (রাহঃ) হতে পর্যায়ক্রমে তার বাবা ও দাদার সূত্রে বর্ণিত আছে, তিনি (দাদা) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে লোক আমাদের শিশুদের আদর করে না এবং আমাদের বড়দের সম্মানের প্রতি খেয়াল রাখে না সে আমাদের অন্তর্ভুক্ত নয়।’ সহীহ, তা’লীকুর রাগীব (১/১৬) এ হাদীসটি হান্নাদ আবদাহ হতে, তিনি মুহাম্মাদ ইবনু ইসহাক হতে এই সূত্রেও বর্ণিত হয়েছে এবং তাতে রয়েছেঃ “বড়দের অধিকার জ্ঞান রাখে না”।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1921,
			"arabicnumber": 1921,
			"text": "১৯২১। ইবনু আব্বাস (রাঃ) হতে বর্ণিত আছে, তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তি আমাদের ছোটদের স্নেহ করে না বড়দের সম্মান করে না, সৎকাজের নির্দেশ দেয় না এবং অসৎ কাজে বাধা দেয় না সে আমাদের অন্তর্ভুক্ত নয়। যঈফ, মিশকাত (৪৯৭০), তা’লীকুর রাগীব (৩/১৭৩) আবূ ঈসা বলেনঃ এ হাদীসটি হাসান গারীব। আমর ইবনু শুয়াইবের সূত্রে মুহাম্মাদ ইবনু ইসহাকের হাদীসটি সাহীহ। আব্দুল্লাহ ইবনু আমর হতেও হাদীসটি অন্য সূত্রে বর্ণিত হয়েছে। একদল বিশেষজ্ঞ আলিম রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের বাণী লাইস মিন্না’-এর অর্থ বলেছেন, “আমাদের নিয়ম-নীতি ও শিষ্টাচারের অনুসারী নয়”। সুফিয়ান সাওরী লাইসা মিন্না-এর অর্থ 'লাইসা মিসলানা' (আমাদের মত নয়) করা অস্বীকার করেছেন। তিনি বলেছেন, এর অর্থ হল- আমাদের দলভুক্ত নয়।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1922,
			"arabicnumber": 1922,
			"text": "১৯২২। জারীর ইবনু আবদুল্লাহ (রাঃ) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে লোক মানুষের প্রতি দয়া-অনুগ্রহ প্রদর্শন করে না তাকে আল্লাহ তা'আলাও দয়া করেন না। সহীহ, তাখরাজু মুশকিলাতিল ফাকর (১০৮), বুখারী, মুসলিম আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। আবদুর রাহমান ইবনু আওফ, আবূ সাঈদ, ইবনু উমার, আবূ হুরাইরা ও আবদুল্লাহ ইবনু আমর (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1923,
			"arabicnumber": 1923,
			"text": "১৯২৩। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আবূল কাসিম সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে আমি বলতে শুনেছিঃ শুধুমাত্র হৃদয়হীন, নিষ্ঠুর ও দুর্ভাগা মানুষের কাছ থেকেই রহমত ছিনিয়ে নেয়া হয়। হাসান, মিশকাত তাহকীক ছানী (৪৯৬৮)। আবূ হুরাইরা (রাঃ) হতে হাদীস বর্ণনাকারী আবূ উসমানের নাম অজ্ঞাত। বর্ণিত আছে যে, তিনি মূসা ইবনু আবূ উসমানের বাবা, যার নিকট হতে আবূয যিনাদ হাদীস বর্ণনা করেছেন। আবূয যিনাদ (রাহঃ) মূসা ইবনু আবী উসমান হতে, তিনি তার পিতা হতে, তিনি আবূ হুরাইরা (রাঃ) হতে, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সূত্রে একাধিক হাদীস বর্ণনা করেছেন। আবূ ঈসা বলেন, এ হাদীসটি হাসান।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1924,
			"arabicnumber": 1924,
			"text": "১৯২৪। আবদুল্লাহ ইবনু আমর (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আল্লাহ তা'আলা দয়ালুদের উপর দয়া ও অনুগ্রহ করেন, যারা যমীনে বসবাসকারীদের প্রতি দয়া করবেন। দয়া রাহমান হতে উদগত। যে লোক দয়ার সম্পর্ক বজায় রাখে আল্লাহ তা'আলাও তার সাথে নিজ সম্পর্ক বজায় রাখেন। যে লোক দয়ার সম্পর্ক ছিন্ন করে, আল্লাহ তা'আলাও তার সাথে দয়ার সম্পর্ক ছিন্ন করেন। সহীহ, সহীহাহ (৯২২)। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1925,
			"arabicnumber": 1925,
			"text": "১৯২৫। জারীর ইবনু আবদুল্লাহ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকটে নামায বাস্তবায়ন, যাকাত আদায় এবং প্রত্যেক মুসলিমের কল্যাণ কামনার শপথ (বাই’আত) করেছি। সহীহ, বুখারী, মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1926,
			"arabicnumber": 1926,
			"text": "১৯২৬। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ধৰ্ম হচ্ছে কল্যাণ কামনার নাম। একথাটি তিনি তিনবার বললেন। সাহাবীগণ প্রশ্ন করেন, হে আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)। কার কল্যাণ কামনা করা? তিনি বললেনঃ আল্লাহ, তার গ্রন্থের, মুসলিমদের নেতৃবর্গের এবং মুসলিম সর্বসাধারণের। সহীহ, ইরওয়া(৯২৬), গাইয়াতুল মারাম (৩৩২), মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। ইবনু উমার, তামীম আদ-দারী, জারীর, হাকীম ইবনু আবী ইয়াযীদ তার পিতার সূত্রে এবং সাওবান (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1927,
			"arabicnumber": 1927,
			"text": "১৯২৭। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ এক মুসলিম অন্য মুসলিমের ভাই। সে তার সাথে কোনরকম বিশ্বাসঘাতকতা করবে না, ভার প্রসঙ্গে মিথ্যা বলবে না, তাকে অপমান করবে না। প্রত্যেক মুসলিমের মান-সন্মান, ধন-সম্পদ ও রক্তের (জীবনের) উপর হস্তক্ষেপ করা অপর মুসলিমের উপর হারাম। তাকওয়া এখানে (অন্তরে)। কেউ মন্দ বলে প্রমাণিত হওয়ার জন্য এটুকুই যথেষ্ট যে, সে তার অপর মুসলিম ভাইকে তুচ্ছ জ্ঞান করে। সহীহ, ইরওয়া (৮/৯৯-১০০), মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান গারীব। আলী ও আবূ আইয়ুব (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1928,
			"arabicnumber": 1928,
			"text": "১৯২৮। আবূ মূসা আল-আশআরী (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ একজন মু'মিন ব্যক্তি অন্য মু’মিনের জন্য একটি সুদৃঢ় প্রাসাদস্বরূপ, যার একটি অংশ অপর অংশকে শক্তিশালী করে। সহীহ, মিশকাত (১০৪), আল-ঈমান ইবনু আবী শাইবা (৯০), বুখারী, মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1929,
			"arabicnumber": 1929,
			"text": "১৯২৯। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের প্রত্যেকেই নিজ মুসলিম ভাইয়ের আয়নাস্বরূপ। অতএব সে যদি তার মধ্যে কোন দাগ (ত্রুটি) লক্ষ্য করে, তবে তা যেন দূর করে দেয়। খুবই দুর্বল, যঈফা (১৮৮৯) আবূ ঈসা বলেনঃ শুবা (রহঃ) ইয়াহইয়া ইবনু উবাইদুল্লাহকে হাদীস শাস্ত্রে দুর্বল বলেছেন। এ অনুচ্ছেদে আনাস (রাঃ) হতেও হাদীস বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Very Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1930,
			"arabicnumber": 1930,
			"text": "১৯৩০। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে লোক কোন মুসলিম লোকের দুনিয়াবী বিপদাপদের মধ্যে একটি বিপদও দূর করে দেয়, আল্লাহ তা'আলা তার পরকালের বিপদাপদের কোন একটি বিপদ দূর করে দিবেন। যে লোক দুনিয়াতে অন্য কারো অভাব দূর করে দেয়, তার দুনিয়া ও আখিরাতের অসুবিধাগুলোকে আল্লাহ তা'আলা সহজ করে দিবেন। যে লোক দুনিয়ায় কোন মুসলিমের দোষ-ক্রটিকে গোপন রাখে, আল্লাহ তা'আলা দুনিয়া ও আখিরাতে তার দোষ-ত্রুটি গোপন রাখবেন। যে পর্যন্ত বান্দাহ তার ভাইয়ের সাহায্য-সহযোগিতায় নিয়োজিত থাকে, সে পর্যন্ত আল্লাহ তা'আলাও তার সাহায্য-সহযোগিতায় নিয়োজিত থাকেন। সহীহ, ইবনু মা-জাহ (১২২৫), মুসলিম। ইবনু উমার ও উকবা ইবনু আমির (রাঃ) হতেও এ অনুচ্ছেদে হাদীসটি বর্ণিত আছে। আবূ ঈসা বলেন, এ হাদীসটি হাসান। এ হাদীসের মতো হাদীস আবূ আওয়ানা এবং বর্ণনাকারী আমাশ হতে, তিনি আবূ সালিহ হতে, তিনি আবূ হুরাইরা (রাঃ) হতে, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সূত্রে বর্ণনা করেছেন। তবে তারা এই সনদে “হুদ্দিসতু আন আবী সালিহ\" কথাটুকু উল্লেখ করেননি।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1931,
			"arabicnumber": 1931,
			"text": "১৯৩১। আবূদ দারদা (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে লোক তার কোন ভাইয়ের মান-সম্মানের উপর আঘাত প্রতিরোধ করে, কিয়ামত দিবসে আল্লাহ তা'আলা তার মুখমণ্ডল হতে জাহান্নামের আগুন প্রতিরোধ করবেন। সহীহ, গাইয়াতুল মারাম (৪৩১)। আসমা বিনতু ইয়াযীদ (রাঃ) হতেও এ অনুচ্ছেদে হাদীসটি বর্ণিত আছে। আবূ ঈসা বলেনঃ এ হাদীসটি হাসান।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1932,
			"arabicnumber": 1932,
			"text": "১৯৩২। আবূ আইয়ুব আনসারী (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন মুসলিম ব্যক্তির জন্য তিনদিনের বেশি সময় ধরে তার ভাইয়ের সাথে কথা-বার্তা ও মেলামেশা ত্যাগ করা জায়িয নয়। তাদের দুজনের মধ্যে দেখা-সাক্ষাৎ হয়, অথচ একজন এদিকে এবং অন্যজন আরেক দিকে মুখ সরিয়ে নেয়। তাদের দুজনের মধ্যে যে ব্যক্তি প্রথমে সালাম দেয় সে-ই উত্তম। সহীহ, ইরওয়া (২০২৯), বুখারী, মুসলিম। আব্দুল্লাহ ইবনু মাস'উদ, আনাস, আবু হুরায়রা, হিশাম ইবনু আমির ও আবূ হিন্দ আদ-দারী (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1933,
			"arabicnumber": 1933,
			"text": "১৯৩৩। আনাস (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আবদুর রাহমান ইবনু আওফ (রাঃ) মদীনায় পৌছানোর পর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার এবং সা’দ ইবনুর রাবী (রাঃ)-এর মধ্যে ভ্রাতৃত্বের বন্ধন স্থাপন করে দেন। সা'দ (রাঃ) তাকে বললেন, আসুন আমার সম্পদ উভয়ে অর্ধেক অর্ধেক ভাগ করে নিই। আমার দু’জন স্ত্রী আছে। আমি তাদের একজনকে তালাক দেই এবং সে তার ইদ্দাত পূর্ণ করলে আপনি তাকে বিয়ে করে ফেলুন। আবদুর রাহমান (রাঃ) বললেন, আপনাকে আপনার ধন-দৌলতে ও পরিবার-পরিজনে আল্লাহ তা'আলা বারকাত দান করুন। আপনারা আমাকে বাজারের পথটি দেখিয়ে দিন। তারা তাকে বাজারের পথটি দেখিয়ে দিলেন। সেদিন বাজার হতে তিনি লাভম্বরূপ কিছু পনির ও ঘি নিয়ে ফিরে আসেন। এরপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একদিন তার শরীরে হলুদ রং-এর চিহ্ন দেখে বললেন, কি ব্যাপার? তিনি বললেন, আমি একজন আনসার মহিলাকে বিয়ে করেছি। তিনি আবার প্রশ্ন করলেনঃ মোহরানা হিসেবে কি দিয়েছ? তিনি বললেন, খেজুর বীচি (পরিমাণ স্বর্ণ)। হুমাইদ বলেনঃ অথবা তিনি বলেছেন, এক খেজুর বীচি পরিমাণ স্বর্ণ। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ বিবাহ ভোজের ব্যবস্থা কর তা একটি ছাগল দিয়ে হলেও। সহীহ, ইবনু মা-জাহ (১৯০৭), বুখারী, মুসলিম। তবে তাতে সা’দ ও আব্দুর রাহমানের ঘটনার উল্লেখ নেই। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। ইমাম আহমাদ (রহঃ) বলেন, একটি খেজুর বীচির সমপরিমাণ স্বর্ণের ওজন হচ্ছে সোয়া তিন দিরহাম। ইমাম ইসহাক (রহঃ) বলেন, একটি খেজুর বীচির সমপরিমাণ স্বর্ণের ওজন হচ্ছে পাঁচ দিরহাম। আমি এই তথ্যটি পেয়েছি ইমাম আহমাদ ও ইসহাক (রহঃ) হতে ইসহাক ইবনু মানসূরের মধ্যস্থতায়।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1934,
			"arabicnumber": 1934,
			"text": "১৯৩৪। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, বলা হল, হে আল্লাহর রাসূল গীবত কি? তিনি বললেনঃ তোমার ভাইয়ের প্রসঙ্গে তোমার এমন ধরনের কথা-বার্তা বলা যা সে অপছন্দ করে। প্রশ্নকারী বলল, আমি যে কথাগুলো বলি তা প্রকৃতপক্ষেই তার মধ্যে নিহিত থাকলে, এক্ষেত্রে আপনার কি মত? তিনি বললেনঃ তুমি যে কথাগুলো বল তা প্রকৃতই তার মধ্যে নিহিত থাকলে তবেই তো তুমি তার গীবত করলে। তুমি যা বল তার মধ্যে যদি সেগুলো না থাকে তাহলে তুমি তাকে মিথ্যা অপবাদ দিলে। সহীহ, গাইয়াতুল মারাম (৪২৬), নাকদুল কাত্তাণী (৩৬), সহীহাহ (২৬৬৭), মুসলিম। আবূ বারযা, ইবনু উমার ও আবদুল্লাহ ইবনু আমর (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1935,
			"arabicnumber": 1935,
			"text": "১৯৩৫। আনাস (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা একজন অন্যজনের সাথে সম্পর্ক ছিন্ন করো না, পরস্পরে শত্রুতা পোষণ করো না, পরস্পরকে ঘৃনা করো না, পরস্পর হিংসা করো না, বরং আল্লাহ তা'আলার বান্দাহগণ পরস্পর ভাই হয়ে থেকো। কোন মুসলিম ব্যক্তির পক্ষেই বৈধ নয় তার ভাইকে তিনদিনের অধিক সময় ধরে ত্যাগ করে থাকা। সহীহ, ইরওয়া (৭/৯৩), বুখারী, মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ্। আবূ বাকর সিদ্দীক, যুবাইর ইবনুল আওয়াম, ইবনু মাসউদ, ও আবূ হুরাইরা (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1936,
			"arabicnumber": 1936,
			"text": "১৯৩৬। সালিম (রহঃ) হতে তার বাবার সূত্রে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ শুধু দুই প্রকারের লোকই হিংসাযোগ্য। (এক) যে লোককে আল্লাহ তা'আলা ধন-সম্পদ দান করেছেন এবং সে তা হতে দিন-রাত আল্লাহ তা'আলার পথে ব্যয় করে। (দুই) যাকে আল্লাহ তা'আলা কুরআনের জ্ঞান দিয়েছেন এবং সে দিন-রাত এর বাস্তবায়নে নিযুক্ত থাকে। সহীহ, রাওযুন নায়ীর (৮৯৭), বুখারী, মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। ইবনু মাসউদ ও আবূ হুরাইরা (রাঃ)-এর বরাতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে অনুরূপ হাদীস বর্ণিত হয়েছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1937,
			"arabicnumber": 1937,
			"text": "১৯৩৭। জাবির (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ নামায আদায়কারীরা কখনো শাইতানের পূজা করবে (সাজদা দিবে) এ বিষয়ে সে নিরাশ হয়ে গেছে। কিন্তু সে তাদের মধ্যে একজনকে অন্যজনের বিরুদ্ধে উস্কানি দিতে নিরাশ হয়নি। সহীহ, সহীহাহ (১৬০৬), মুসলিম। আনাস ও সুলাইমান ইবনু আমর ইবনু আহওয়াস (রাঃ) হতে তার পিতার সূত্রে এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। আবূ সুফিয়ানের নাম তালহা, পিতা নাফি।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1938,
			"arabicnumber": 1938,
			"text": "১৯৩৮। উম্মু কুলসুম বিনতু উকবা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে বলতে শুনেছিঃ যে ব্যক্তি লোকদের মাঝে সংশোধন করার চেষ্টা করে সে মিথ্যাবাদী নয়। সে (যা বলেছে) ভাল বলেছে অথবা ভালকাজের অগ্রগতি ঘটিয়েছে। সহীহ, রাওযুন নায়ীর (১১৯৬), সহীহাহ (৫৪৫), মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1939,
			"arabicnumber": 1939,
			"text": "১৯৩৯। আসমা বিনতু ইয়াযীদ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তিনটি ক্ষেত্র ব্যতীত মিথ্যা বলা বৈধ নয়। (এক) স্ত্রীকে খুশি করার উদ্দেশ্যে তার সাথে স্বামীর কিছু বলা, (দুই) যুদ্ধের সময় এবং (তিন) লোকদের পরস্পরের মাঝে সংশোধন করার জন্য মিথ্যা কথা বলা। অধঃস্তন রাবী মাহমূদ তার হাদীসে বলেছেন, তিনটি ক্ষেত্র ব্যতীত অন্য কোথাও মিথ্যা বলা ঠিক নয়। সহীহ, সহীহাহ (৫৪৫), মুসলিম, “স্ত্রীকে সন্তুষ্ট করার জন্য” এই অংশ ব্যাতীত হাদীসটি অনুরূপ বর্ণনা করেছেন উম্মু কুলসূম হতে। এ হাদীসটি হাসান। ইবনু খুসাইমের সূত্র ব্যতীত আসমা (রাঃ) বর্ণিত এ হাদীস আমরা অন্য কোন সূত্রে অবহিত নই। দাউদ ইবনু আবূ হিন্দ-শাহর ইবনু হাওশাবের বরাতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এ হাদীস বর্ণনা করেছেন। তাতে আসমা (রাঃ)-এর উল্লেখ নেই। মুহাম্মাদ ইবনুল আলা-ইবনু আবূ যাইদা-দাউদ সূত্রে উক্ত হাদীস আমার নিকট এ রকম বর্ণনা করেছেন। এ অনুচ্ছেদে আবূ বাকর (রাঃ) হতেও হাদীস বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1940,
			"arabicnumber": 1940,
			"text": "১৯৪০। আবূ সিরমা (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে লোক অন্য কারো ক্ষতিসাধন করে, আল্লাহ তা'আলা তা দিয়েই তার ক্ষতিসাধন করেন। যে লোক অন্যকে কষ্ট দেয়, আল্লাহ তা'আলা তাকে কষ্টের মধ্যে ফেলেন। হাসান, ইরওয়া (৮৯৬)। আবূ বাকর (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, এ হাদীসটি হাসান গারীব।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1941,
			"arabicnumber": 1941,
			"text": "১৯৪১। আবূ বাকর সিদ্দীক (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তি কোন মুমিনের ক্ষতিসাধন করে অথবা তার বিরুদ্ধে ষড়যন্ত্র করে সে অভিশপ্ত। যঈফ, যঈফা (১৯০৩) আবূ ঈসা বলেনঃ এ হাদীসটি হাসান গারীব।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1942,
			"arabicnumber": 1942,
			"text": "১৯৪২। আইশা (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ প্রতিবেশীর অধিকারের ব্যাপারে জিবরীল (আঃ) আমাকে অবিরত উপদেশ দিতে থাকেন। এতে আমার ধারণা হল যে, হয়ত শীঘ্রই তাকে উত্তরাধিকারী বানিয়ে দিবে। সহীহ, প্রাগুক্ত, বুখারী, মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1943,
			"arabicnumber": 1943,
			"text": "১৯৪৩। মুজাহিদ (রহঃ) হতে বর্ণিত আছে, আবদুল্লাহ ইবনু আমর (রাঃ)-এর জন্য তার পরিবারে একটি ছাগল যবেহ করা হল। তিনি এসে বললেন, তোমরা কি আমাদের ইয়াহুদী প্রতিবেশীকে (গোশত) উপহার পাঠিয়েছ? আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে বলতে শুনেছিঃ প্রতিবেশীর অধিকার প্রসঙ্গে জিবরীল (আঃ) আমাকে অবিরত উপদেশ দিতে থাকেন। এমনকি আমার ধারণা হল যে, হয়ত শীঘ্রই প্রতিবেশীকে উত্তরাধিকারী বানিয়ে দিবে। সহীহ, ইরওয়া (৮১১), বুখারী। এ অনুচ্ছেদে আইশা, ইবনু আব্বাস, আবূ হুরাইরা, আনাস, মিকদাদ ইবনুল আসওয়াদ, উকবা ইবনু আমির, আবূ শুরাইহ ও আবূ উমামা (রাঃ) হতেও হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, এ হাদীসটি হাসান এবং উল্লেখিত সনদসূত্রে গারীব। এ হাদীসটি-আইশা ও আবূ হুরাইরা (রাঃ) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 1944,
			"arabicnumber": 1944,
			"text": "১৯৪৪৷ আবদুল্লাহ ইবনু আমর (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আল্লাহ তা'আলার নিকট সঙ্গীদের মাঝে উত্তম সঙ্গী হল সেই ধরনের ব্যক্তি যে তার নিজ সঙ্গীর নিকট উত্তম। আল্লাহ্ তা'আলার দৃষ্টিতে প্রতিবেশীদের মাঝে উত্তম হল সেই ধরনের প্রতিবেশী যে তার নিজের প্রতিবেশীর নিকট উত্তম। সহীহ, সহীহাহ (১০৩০), মিশকাত (৪৯৮৭)। আবূ ঈসা বলেন, এ হাদীসটি হাসান গারীব। আবূ আব্দুর রাহমান আল-হুবুলীর নাম আব্দুল্লাহ ইবনু ইয়াজীদ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 1945,
			"arabicnumber": 1945,
			"text": "১৯৪৫। আবূ যার (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ এরা তোমাদের ভাই, এদেরকে আল্লাহ তা'আলা তোমাদের অধীনস্থ করেছেন। সুতরাং যে ব্যক্তির এরূপ ভাই (গোলাম, বাদী, খাদিম) তার অধীনে আছে, সে যেন তার খাদ্য হতে তাকে খেতে দেয় এবং তার পোশাক-পরিচ্ছদ হতে তাকে পরতে দেয়। সে এরূপ কাজের বোঝা যেন তার উপর না চাপায় যা করতে সে সমর্থ নয়। সে তার উপর সাধ্যাতীত কোন কাজের বোঝা চাপিয়ে দিলে সে যেন তাকে সহযোগিতা করে। সহীহ, বুখারী, মুসলিম। আলী, উম্মু সালামা, ইবনু উমার ও আবূ হুরাইরা (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, এ হাদিসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 1946,
			"arabicnumber": 1946,
			"text": "১৯৪৬। আবূ বাকর সিদ্দীক (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ অধীনস্থদের সাথে দুর্ব্যবহারকারী জান্নাতে যেতে পারবে না। যঈফ, ইবনু মাজাহ (৩৬৯১) আবূ ঈসা বলেছেন, এ হাদীসটি গরীব। আইউব সাখতিয়ানী প্রমুখ হাদীস বিশারদ ফারকাদের স্মৃতিশক্তির সমালোচনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 1947,
			"arabicnumber": 1947,
			"text": "১৯৪৭। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, তওবাকারী আবূল কাসিম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কেউ যদি তার নির্দোষ গোলামের বিরুদ্ধে (যিনার) অপবাদ আরোপ করে তবে আল্লাহ তা'আলা কিয়ামত দিবসে তার উপর হদ (নির্ধারিত শাস্তি) প্রতিষ্ঠিত করবেন। তবে গোলামটি যদি প্রকৃতপক্ষেই সেরকমের হয় তাহলে ভিন্ন কথা। সহীহ, রাওযুন নায়ীর (১১৪৬), বুখারী, মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। ইবনু আবী নুম-এর নাম আবদুর রাহমান ইবনু আবী নুম আল-বাজালী, উপনাম আবূল হাকাম। সুওয়াইদ ইবনু মুকাররিন ও আবদুল্লাহ ইবনু উমার (রাঃ) হতেও এ অনুচ্ছেদে হাদীসটি বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 1948,
			"arabicnumber": 1948,
			"text": "১৯৪৮। আবূ মাসউদ আনসারী (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, কোন এক সময় আমি আমার এক গোলামকে প্রহার করছিলাম। তখন আমার পিছন হতে একজন লোককে আমি বলতে শুনলাম, আবূ মাসউদ, জেনে রাখ, আবূ মাসউদ, জেনে রাখ! আমি পিছনে তাকানো মাত্রই দেখতে পাই রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম। তিনি বললেনঃ তুমি এর উপর যে পরিমাণ ক্ষমতার অধিকারী, তোমার উপর আল্লাহ তা'আলা এরচাইতে অনেক বেশি ক্ষমতার অধিকারী। আবূ মাসউদ (রাঃ) বলেন, এরপর হতে আমি আমার কোন গোলামকে আর কখনো মারিনি। সহীহ, মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। ইবরাহীম আত-তাইনীর পিতা ইয়ামীদ ইবনু শারীক।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 1949,
			"arabicnumber": 1949,
			"text": "১৯৪৯। আবদুল্লাহ ইবনু উমার (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকটে একজন লোক এসে বলল, হে আল্লাহর রাসূল আমি খাদিমের অপরাধ কতবার ক্ষমা করব? তার কথা শুনে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নীরব থাকলেন। সে আবার বললঃ হে আল্লাহর রাসূল আমি খাদিমের অপরাধ কতবার ক্ষমা করব? তিনি বললেনঃ প্রতিদিন সত্তরবার। সহীহ, সহীহাহ (৪৮৮)। আবূ ঈসা বলেন, এ হাদীসটি হাসান গারীব (তিরমিয়ীর কোন কোন নোসখায় হাসান সহীহ)। এ হাদীসটি আবূ হানী আল-খাওলানী হতে উক্ত সনদে আবদুল্লাহ ইবনু ওয়াহব অনুরূপ বর্ণনা করেছেন। আব্বাসের বাবার নাম জুলাইদ আল-হাজারী আল-মিসরী। কুতাইবা-আবদুল্লাহ ইবনু ওয়াহব হতে, তিনি আবূ হানী হতে এই সূত্রে একইরকম বর্ণনা করেছেন। এ হাদীসটি কয়েকজন বর্ণনাকারী আবদুল্লাহ ইবনু ওয়াহবের সূত্রে বর্ণনা করেছেন এবং তারা “আবদুল্লাহ ইবনু আমর (রাঃ) হতে” উল্লেখ করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 1950,
			"arabicnumber": 1950,
			"text": "১৯৫০। আবূ সাঈদ আল-খুদরী (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের কেউ যখন তার খাদিমকে মারে এবং সে (খাদিম) আল্লাহ তা'আলার দোহাই দেয়, তখন তোমাদের হাত তুলে নাও (মারধর বন্ধ কর)। যঈফ, যঈফা (১৪৪১) আবূ ঈসা বলেনঃ আবূ হারূন আল-আবদীর নাম উমারা ইবনু জুওয়াইন। ইয়াহইয়া ইবনু সাঈদ বলেছেন, শুবা আবূ হারূন আল-আবদীকে দুর্বল রাবী বলে উল্লেখ করেছেন। ইয়াহইয়া বলেছেন, ইবনু আওন আমৃত্যু আবূ হুরাইরাহ (রাঃ) হতে হাদীস বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 1951,
			"arabicnumber": 1951,
			"text": "১৯৫১৷ জাবির ইবনু সামুরা (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ নিজের সন্তানকে শিষ্টাচার ও আদব-কায়দা শিক্ষা দেয়া এক সা পরিমাণ বস্তু দান-খাইরাত করার চেয়েও উত্তম। যঈফ, যঈফা (১৮৮৭) আবূ ঈসা বলেনঃ এ হাদীসটি গারীব। হাদীস বিশারদদের মতে নাসিহ আবূল আলা আল-কূফী খুব একটা মজবুত রাবী নন। উল্লেখিত হাদীসটি শুধুমাত্র এই সূত্রেই জানা গেছে। বসরাবাসী শাইখ নাসিহ- যিনি আম্মার ইবনু আবী আম্মার এবং অন্যান্য শাইখ হতে হাদীস বর্ণনা করেন, এই কুফী নাসিহ-এর তুলনায় বেশী শক্তিশালী।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 1952,
			"arabicnumber": 1952,
			"text": "১৯৫২। আইউব ইবনু মূসা (রহঃ) হতে পর্যায়ক্রমে তার পিতা ও দাদার সূত্রে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন পিতা তার সন্তানকে উত্তম শিষ্টাচার শিক্ষা দেয়ার চেয়ে বেশী উত্তম কোন জিনিস দিতে পারে না। যঈফ, যঈফা (১১২১) নাকদুল কাত্তানী পৃঃ (২০) আবূ ঈসা বলেনঃ এ হাদীসটি গারীব। আমরা শুধু আমির ইবনু আবূ আমির আল-খাযযায-এর সূত্রেই এ হাদীস জেনেছি। আমিরের পিতা সালিহ ইবনু রুসতুম। আইউব ইবনু মূসা হলেন ইবনু আমর ইবনু সাঈদ আল-আসী। আমার মতে এটি মুরসাল হাদীস।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 1953,
			"arabicnumber": 1953,
			"text": "১৯৫৩। আইশা (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উপহার নিতেন এবং বিনিময়ে উপহার প্রদান করতেন। সহীহ, ইরওয়া (১৬০৩), বুখারী। আবূ হুরাইরা, আনাস, ইবনু উমার ও জাবির (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ এবং উল্লেখিত সনদসূত্রে গারীব। এটা মারফু হিসাবে শুধু ঈসা ইবনু ইউনুস হতে হিশামের সূত্রেই জেনেছি।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 1954,
			"arabicnumber": 1954,
			"text": "১৯৫৪। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মানুষের প্রতি যে লোক কৃতজ্ঞতা প্রকাশ করে না, আল্লাহ্ তা'আলার প্রতিও সে কৃতজ্ঞতা প্রকাশ করে না। সহীহ, মিশকাত (৩০২৫), সহীহাহ (৪১৭), তা’লীকুর রাগীব (২/৫৬)। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 1955,
			"arabicnumber": 1955,
			"text": "১৯৫৫। আবূ সাঈদ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মানুষের প্রতি যে লোক কৃতজ্ঞ নয় আল্লাহ্ তা'আলার প্রতিও সে কৃতজ্ঞ নয়। পূর্বের হাদীসের সহায়তায় হাদীসটি সহীহ, প্রাগুক্ত। আবূ হুরাইরা, আশআস ইবনু কাইস ও নুমান ইবনু বাশীর (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 1956,
			"arabicnumber": 1956,
			"text": "১৯৫৬। আবূ যার (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমার হাস্যোজ্জ্বল মুখ নিয়ে তোমার ভাইয়ের সামনে উপস্থিত হওয়া তোমার জন্য সাদকাস্বরূপ। তোমার সৎকাজের আদেশ এবং তোমার অসৎকাজ হতে বিরত থাকার নির্দেশ তোমার জন্য সাদকাস্বরূপ। পথহারা লোককে পথের সন্ধান দেয়া তোমার জন্য সাদকাস্বরূপ, স্বল্প দৃষ্টি সম্পন্ন লোককে সঠিক দৃষ্টি দেয়া তোমার জন্য সাদকাস্বরূপ। পথ হতে পাথর, কাটা ও হাড় সরানো তোমার জন্য সাদকাস্বরূপ। তোমার বালতি দিয়ে পানি তুলে তোমার ভাইয়ের বালতিতে ঢেলে দেয়া তোমার জন্য সাদকাস্বরূপ। সহীহ, সহীহাহ (৫৭২)। ইবনু মাসউদ, জাবির, হুযাইফা, আইশা ও আবূ হুরাইরা (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, এ হাদীসটি হাসান গারীব। আবূ যুমাইলের নাম সিমাক, পিতা আল-ওয়ালীদ আল-হানাফী।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 1957,
			"arabicnumber": 1957,
			"text": "১৯৫৭। বারাআ ইবনু আযিব (রাঃ) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে আমি বলতে শুনেছিঃ যে ব্যক্তি একবার দোহন করা দুধ দান করে অথবা টাকা-পয়সা ধার দেয় অথবা পথ হারিয়ে যাওয়া লোককে সঠিক পথের সন্ধান দেয়, তার জন্য রয়েছে একটি গোলাম মুক্ত করে দেয়ার সম-পরিমাণ সাওয়াব। সহীহ, তা’লীকুর রাগীব (২/৩৪,২৪১), মিশকাত (১৯১৭)। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ এবং আবূ ইসহাক-তালহা ইবনু মুসাররিফের সূত্রে গারীব। আমরা এ হাদীসটি শুধুমাত্র এই সূত্রেই জেনেছি। এ হাদীসটি তালহা ইবনু মুসাররিফের সূত্রে মানসূর ইবনুল মু'তামির ও শুবা (রাহঃ) বর্ণনা করেছেন। নুমান ইবনু বাশীর (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। \"মানাহা মানীহাতা ওয়ারিকিন” অর্থ টাকা-পয়সা ধার দেয়া। “হাদা যুককান\" অর্থ সঠিক পথের সন্ধান দেয়া।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 1958,
			"arabicnumber": 1958,
			"text": "১৯৫৮। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন এক সময় একজন লোক পথ দিয়ে চলাকালে একটি কাটাযুক্ত ডাল দেখতে পেল। সে তা তুলে ফেলে দিল। আল্লাহ তা'আলা তার এ কাজকে কুবুল করেন এবং তাকে ক্ষমা করে দেন। সহীহ, বুখারী ও মুসলিম। আবূ বারযা, ইবনু আব্বাস ও আবূ যার (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 1959,
			"arabicnumber": 1959,
			"text": "১৯৫৯। জাবির ইবনু আবদুল্লাহ (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন লোক কোন কথা বলার পর আশেপাশে তাকালে তার উক্ত কথা (শ্রবণকারীর জন্য) আমানাত বলে গণ্য। হাসান, সহীহাহ (১০৮৯)। আবূ ঈসা বলেন, এ হাদীসটি হাসান। আমরা এ হাদীসটি শুধুমাত্র ইবনু আবী যিব-এর বর্ণনার মাধ্যমেই জেনেছি।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 1960,
			"arabicnumber": 1960,
			"text": "১৯৬০। আসমা বিনতু আবূ বাকর (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমি বললাম হে আল্লাহর রাসুল! যুবাইর (রাঃ) আমাকে যা কিছু দেন তা ব্যতীত আমার কাছে কিছু নেই। আমি কি তা হতে দান করব? তিনি বললেনঃ হ্যাঁ। ’ তুমি থলের ফিতা বেঁধে রাখবে না, অন্যথায় তোমার জন্যও (আল্লাহ তা'আলার পক্ষ হতে) বেঁধে রাখা হবে (তোমার রিযিকের থলে)। সহীহ, সহীহ আবূ দাউদ (১৪৯০), বুখারী ও মুসলিম। অপর বর্ণনায় আছে, গুনে গুনে খরচ কর না, অন্যথায় তোমাকেও গুনে গুনে দেয়া হবে। আইশা ও আবূ হুরাইরা (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। এ হাদীসটি উপরোক্ত আবদুল্লাহ-ইবনুয যুবাইর হতে, তিনি আসমা বিনতু আবী বাকর (রাঃ) হতে এইসূত্রে বর্ণনা করেছেন। এটি আইয়ুবের সূত্রে একাধিক বর্ণনাকারী বর্ণনা করেছেন, কিন্তু তারা এতে আব্বাদ ইবনু আবদুল্লাহর উল্লেখ করেননি।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 1961,
			"arabicnumber": 1961,
			"text": "১৯৬১। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ দানশীল ব্যক্তি আল্লাহ্ তা'আলার নিকটবর্তী, জান্নাতের নিকটবর্তী, মানুষের নিকটবর্তী এবং জাহান্নাম হতে দূরবর্তী। কৃপণ ব্যক্তি আল্লাহ্ তা'আলা হতে দূরবর্তী, জান্নাত হতে দূরবর্তী, মানুষের নিকট হতেও দূরবর্তী, কিন্তু জাহান্নামের নিকটবর্তী। আল্লাহ তা'আলার নিকটে কৃপণ আলেম ব্যক্তির চেয়ে মূর্খ দানশীল ব্যক্তি বেশী প্রিয়। খুবই দুর্বল, যঈফা (১৫৪) আবূ ঈসা বলেনঃ এ হাদীসটি গারীব। শুধু সাঈদ ইবনু মুহাম্মাদের বরাতেই আমরা ইয়াহইয়া ইবনু সাঈদ-আল-আ'রাজ হতে আবূ হুরাইরা (রাঃ) সূত্রে এ হাদীস জেনেছি। ইয়াহইয়া ইবনু সাঈদ হতে এই হাদীস বর্ণনার ক্ষেত্রে সাঈদ ইবনু মুহাম্মাদের ব্যাপারে মতের অমিল করা হয়েছে। ইয়াহইয়া ইবনু সাঈদ-আইশা (রাঃ) সূত্রে এই বিষয়ে কিছু মুরসাল হাদীসও বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Very Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 1962,
			"arabicnumber": 1962,
			"text": "১৯৬২। আবূ সাঈদ আল-খুদরী (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মুমিন ব্যক্তির মধ্যে দুটি স্বভাবের (চারিত্রিক দোষ) সমাবেশ হতে পারে নাঃ কৃপণতা ও চরিত্রহীনতা। যঈফ, যঈফা (১১১৯)। নাকদুল কাত্তানী (৩৩/৩৩) আবূ ঈসা বলেনঃ এ হাদীসটি গারীব। শুধু সাদাকা ইবনু মূসার সূত্রে আমরা এ হাদীস জেনেছি। এ অনুচ্ছেদে আবূ হুরাইরা (রাঃ) হতেও হাদীস বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 1963,
			"arabicnumber": 1963,
			"text": "১৯৬৩। আবূ বাকর সিদ্দীক (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ প্রতারক-ধোকাবাজ, কৃপণ ও উপকার করে তার খোঁটা দানকারী জান্নাতে যেতে পারবে না। যঈফ (বেচা-কেনা সংক্রান্ত হাদীস) আবূ ঈসা বলেছেন, এ হাদীসটি হাসান গারীব।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 1964,
			"arabicnumber": 1964,
			"text": "১৯৬৪। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মু'মিন ব্যক্তি চিন্তাশীল, গম্ভীর ও ভদ্র হয়ে থাকে। আর পাপিষ্ঠ ব্যক্তি প্রতারক, ধোকাবাজ, কৃপণ, নীচ ও অসভ্য হয়ে থাকে। হাসান, সহীহাহ (৯৩২)। আবূ ঈসা বলেন, এ হাদীসটি গারীব। আমরা এ হাদীসটি শুধুমাত্র উল্লেখিত সনদসূত্রে জেনেছি।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 1965,
			"arabicnumber": 1965,
			"text": "১৯৬৫। আবূ মাসউদ আল-আনসারী (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ পরিবার-পরিজনের জন্য ব্যক্তির ধন-সম্পদ ব্যয় সাদকারূপে গণ্য। সহীহ, সহীহা (৯৮২), বুখারী ও মুসলিম। আবদুল্লাহ ইবনু আমর, আমর ইবনু উমাইয়্যা ও আবূ হুরাইরা (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 1966,
			"arabicnumber": 1966,
			"text": "১৯৬৬। সাওবান (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন লোক তার দীনারগুলোর মধ্যে যেটি তার পরিবারের জন্য ব্যয় করে, যে দীনারটি সে আল্লাহ তা'আলার পথে জিহাদের উদ্দেশ্যে তার পশুর জন্য ব্যয় করে এবং যে দীনারটি সে আল্লাহ তা'আলার পথে তার মুজাহিদ সঙ্গীর জন্য ব্যয় করে, তা-ই সবোত্তম দীনার। আবূ কিলাবা তার বর্ণনায় বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার বক্তব্য শুরু করেন পরিবার-পরিজন হতে। তারপর তিনি বলেনঃ যে লোক তার নিজের ছোট ছোট সন্তানদের জন্য ব্যয় করে, বিরাট সাওয়াবের ব্যাপারে তার চেয়ে বেশি বড় আর কে আছে? আল্লাহ তার মাধ্যমে এদের মান-ইজ্জাত ও সম্মান-সন্ত্রম রক্ষা করেন এবং তার ওয়াসীলায় এদের স্বনির্ভর করেন। সহীহ, ইবনু মা-জাহ (২৭৬০), মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 1967,
			"arabicnumber": 1967,
			"text": "১৯৬৭। আবূ শুরাইহ আল আদাবী (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমার উভয় চোখ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে দেখেছে এবং আমার উভয় কান তাকে বলতে শুনেছে। তিনি বলেছেনঃ আল্লাহ ও আখিরাতের প্রতি যে লোক ঈমান রাখে সে যেন তার মেহমানকে সম্মান করে, তাকে জা-ইযা দেয়। সাহাবীগণ প্রশ্ন করেন, জা-ইযা কি? তিনি বলেনঃ একদিন ও একরাতের পাথেয় সাথে দেয়া। তিনি আরো বলেনঃ মেহমানদারী তিনদিন পর্যন্ত। এর অতিরিক্তটুকু সাদকারূপে গণ্য। আল্লাহ তা'আলা ও আখিরাতের উপর সে লোক ঈমান রাখে যে যেন উত্তম কথা বলে, আর না হয় চুপ থাকে। সহীহ, ইবনু মা-জাহ (৩৬৭৫), বুখারী ও মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 1968,
			"arabicnumber": 1968,
			"text": "১৯৬৮। আবূ শুরাইহ আল-কা'বী (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মেহমানদারী তিনদিন পর্যন্ত এবং জা-ইযা হল একদিন ও একরাতের পাথেয় প্রদান। এরপর তার জন্য যা ব্যয় করা হবে তা সাদকারূপে গণ্য। অতিথিসেবক বিরক্ত হতে পারে- কোন মেহমানের পক্ষেই এতটা সময় সেখানে থাকা বৈধ নয়। সহীহ, তা’লীকুর রাগীব (৩/২৪২), বুখারী ও মুসলিম। আইশা ও আবূ হুরাইরা (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। এ হাদীসটি সাঈদ আল-মাকবুরীর সূত্রে মালিক ইবনু আনাস ও লাইস (রাহঃ) বর্ণনা করেছেন। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। আবূ শুরাইহ আল-খুযাঈ হলেন আল-কা'বী। আর তিনিই আল-আদাবী, তার নাম খুওয়াইলিদ, পিতা আমর। \"লা ইয়াসবী ইনদাহু” কথার মর্ম এই যে, মেহমানের এত দিন কোন পরিবারে থাকা যুক্তিসঙ্গত নয় যাতে তারা কষ্টের মধ্যে পতিত হয় এবং বিরক্তির কারণ হতে পারে। “হারাজ” অর্থ সংকট। “হাত্তা ইউহরিজাহু” কথার অর্থ এই যে, অনেকদিন থেকে সংশ্লিষ্ট পরিবারের জন্য মেহমান সংকট তৈরী করল।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 1969,
			"arabicnumber": 1969,
			"text": "১৯৬৯। সাফওয়ান ইবনু সুলাইম (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ বিধবা ও মিসকীনদের ভরণ-পোষণের জন্য চেষ্টা সাধনকারী আল্লাহ্ তা'আলার পথে জিহাদকারী অথবা সারাদিন রোযা পালনকারী ও সারারাত নামায আদায়কারীর সমান সাওয়াবের অধিকারী। সহীহ, ইবনু মা-জাহ (২১৪০), বুখারী ও মুসলিম। আল-আনসারী-মা'ন হতে, তিনি মালিক হতে, তিনি সাওর ইবনু যাইদ হতে, তিনি আবূল গাইস হতে, তিনি আবূ হুরাইরা (রাঃ) হতে, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে (উপরের) হাদীসের ন্যায় বর্ণনা করেছেন। এ হাদীসটি হাসান গারীব সহীহ। আবূল গাইস-এর নাম সালিম, আবদুল্লাহ ইবনু মুতীর মুক্তদাস। সাওর ইবনু যাইদ মদীনার অধিবাসী এবং সাওর ইবনু ইয়াযীদ সিরিয়ার অধিবাসী।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 1970,
			"arabicnumber": 1970,
			"text": "১৯৭০। জাবির ইবনু আবদুল্লাহ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ প্রতিটি ভালকাজই সাদকারূপে গণ্য। তোমার ভাইয়ের সাথে সহাস্য মুখে দেখা-সাক্ষাৎ করা এবং তোমার বালতির পানি দিয়ে তোমার ভাইয়ের পাত্র ভর্তি করে দেয়াও ভাল কাজের অন্তর্ভুক্ত। সহীহ, তা’লীকুর রাগীব (৩/২৬৪)। আবূ যর (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 1971,
			"arabicnumber": 1971,
			"text": "১৯৭১। আবদুল্লাহ ইবনু মাসউদ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা অবশ্যই সত্যের পথ অবলম্বন করবে। কেননা, সততাই মানুষকে কল্যাণের পথে নিয়ে যায়। আর কল্যাণ জান্নাতের দিকে নিয়ে যায়। কোন মানুষ প্রতিনিয়ত সত্য কথা বলতে থাকলে এবং সত্যের প্রতি মনোযোগী থাকলে শেষ পর্যন্ত সে আল্লাহ তা’আলার দরবারে পরম সত্যবাদী হিসাবে তালিকাভুক্ত হয়। তোমরা মিথ্যাকে অবশ্যই পরিহার করবে। কেননা, মিথ্যা (মানুষকে) পাপের পথ দেখায়, আর পাপ জাহান্নামের পথে নিয়ে যায়। কোন বান্দাহ প্রতিনিয়ত মিথ্যা বলতে থাকলে এবং মিথ্যার প্রতি ঝুঁকে থাকলে শেষ পর্যন্ত সে আল্লাহ্ তা'আলার দরবারে চরম মিথ্যাবাদী হিসাবে তালিকাভুক্ত হয়। সহীহ, বুখারী ও মুসলিম। আবূ বাকর সিদ্দীক, উমার, আবদুল্লাহ ইবনুশ শিখখীর ও ইবনু উমার (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 1972,
			"arabicnumber": 1972,
			"text": "১৯৭২। ইবনু উমর (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন বান্দা যখন মিথ্যা কথা বলে তখন তার মিথ্যা কথনের দুর্গন্ধের কারণে ফেরেশতা এক মাইল (বা দৃষ্টি সীমার বাইরে) দূরে সরে যায়। খুবই দুর্বল, যঈফা (১৮২৮) ইয়াহইয়া বলেনঃ আব্দুর রহীম ইবনু কি তাঁর স্বীকারোক্তি করেছেন? ইয়াহইয়া ইবনু মূসা বলেন, হ্যাঁ। আবূ ঈসা বলেছেন, এ হাদীসটি হাসান, উত্তম, গারীব। শুধু উল্লেখিত সূত্রেই আমরা এ হাদীস জেনেছি। এটি আবদুর রহীম ইবনু হারূনের একক রিওয়ায়াত।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Very Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 1973,
			"arabicnumber": 1973,
			"text": "১৯৭৩। আইশা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, মিথ্যা হতে অধিক ঘৃণিত চরিত্র রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট আর কিছুই ছিল না। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সামনে কেউ মিথ্যা বললে তা অবিরত তার মনে থাকত, যে পর্যন্ত না তিনি জানতে পারতেন যে, মিথ্যাবাদী তার মিথ্যা কথন হতে তওবা করেছে। সনদ সহীহ। আবূ ঈসা বলেন, এ হাদীসটি হাসান।",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 1974,
			"arabicnumber": 1974,
			"text": "১৯৭৪। আনাস (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ নির্লজ্জতা ও অশ্লীলতা কোন বস্তুর শুধুমাত্র কদর্যতাই বাড়িয়ে দেয়। আর লজ্জা কোন জিনিসের সৌন্দর্যতাই বাড়িয়ে দেয়। সহীহ, ইবনু মাজাহ (৪১৮৫) আয়িশা (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, এ হাদীসটি হাসান গারীব। আমরা এ হাদীসটি শুধুমাত্র আবদুর রাযযাকের সূত্রেই জেনেছি।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 1975,
			"arabicnumber": 1975,
			"text": "১৯৭৫। আবদুল্লাহ ইবনু আমর (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ সর্বোত্তম চরিত্রবান ব্যক্তিই তোমাদের মধ্যে শ্রেষ্ঠ। (বর্ণনাকারী বলেন,) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অশ্লীলভাষীও ছিলেন না এবং অশ্লীলতার ভানও করতেন না। সহীহ, বুখারী ও মুসলিম, দেখুন সহীহাহ (৭৯১)। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 1976,
			"arabicnumber": 1976,
			"text": "১৯৭৬। সামুরা ইবনু জুনদাব (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা পরস্পর পরস্পরকে আল্লাহ তা'আলার অভিসম্পাত, তার গযব ও জাহান্নামের বদ-দুআ করো না। সহীহ, সহীহাহ (৮৯৩)। ইবনু আব্বাস, আবূ হুরাইরা, ইবনু উমার ও ইমরান ইবনু হুসাইন (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 1977,
			"arabicnumber": 1977,
			"text": "১৯৭৭। আবদুল্লাহ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মু'মিন কখনো দোষারোপকারী ও নিন্দাকারী হতে পারে না, অভিসম্পাতকারী হতে পারে না, অশ্লীল কাজ করে না এবং কটুভাষীও হয় না। সহীহ, সহীহাহ (৩২০)। আবূ ঈসা বলেন, এ হাদীসটি হাসান গারীব। আবদুল্লাহ (রাঃ) হতে অন্যসূত্রেও এ হাদীসটি বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 1978,
			"arabicnumber": 1978,
			"text": "১৯৭৮। ইবনু আব্বাস (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সামনে একজন লোক বাতাসকে অভিসম্পাত করে। তিনি বললেনঃ বাতাসকে অভিশাপ প্রদান করো না, কারণ, সে তো হুকুমের গোলাম। কোন ব্যক্তি অপাত্রে অভিশাপ প্রদান করলে তা অভিশাপকারীর উপর ফিরে আসে। সহীহ, সহীহাহ (৫২৮)। আবূ ঈসা বলেন, এ হাদীসটি গারীব। এ হাদীসটি মুসনাদভাবে বিশর ইবনু উমার ব্যতীত আর কেউ বর্ণনা করেছেন বলে আমাদের জানা নেই।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 1979,
			"arabicnumber": 1979,
			"text": "১৯৭৯। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা নিজেদের বংশধারার ব্যাপারে জ্ঞান অর্জন কর, যাতে করে তোমাদের বংশীয় আত্মীয়তার সম্পর্ক বজায় রাখতে পার। কেননা, আত্মীয়তার সম্পর্ক বজায় থাকলে নিজেদের মধ্যে আন্তরিকতা ও ভালবাসা তৈরী হয় এবং ধন-সম্পদ ও আয়ুষ্কাল বৃদ্ধি পায়। সহীহ, সহীহাহ (২৭৬)। আবূ ঈসা বলেন, এ হাদীসটি উল্লেখিত সনদসূত্রে গারীব। “মনসাআতুন ফিল আসার\"-এর অর্থ আয়ুষ্কাল বৃদ্ধি পাওয়া।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 1980,
			"arabicnumber": 1980,
			"text": "১৯৮০। আবদুল্লাহ ইবনু আমর (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ এক অনুপস্থিত ব্যক্তির জন্য অপর অনুপস্থিত ব্যক্তির দু'আর চেয়ে বেশী দ্রুত আর কোন দু'আ কুবুল হয় না। যঈফ, যঈফ আবূ দাউদ (২/২৬৯) আবূ ঈসা বলেনঃ এ হাদীসটি গারীব। আমরা শুধু উল্লেখিত সনদসূত্রেই এ হাদীস জেনেছি। আবদুর রহমান ইবনু যিয়াদ আল-ইফরীকী হাদীস শাস্ত্রে দুর্বল। আবদুল্লাহ ইবনু ইয়াযীদের ডাকনাম আবূ আবদুর রহমান আল-হুবুলী।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 1981,
			"arabicnumber": 1981,
			"text": "১৯৮১। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ দুইজন লোক একে অপরকে গালি দেয়ার অপরাধ প্রথমে গালি প্রদানকারীর উপর এসে পড়ে, যতক্ষন পর্যন্ত নির্যাতিত ব্যক্তি (দ্বিতীয় ব্যক্তি) সীমালংঘন না করে। সহীহ, মুসলিম। সা’দ, ইবনু মাসউদ ও আবদুল্লাহ ইবনু মুগাফফাল (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, এ হাদীসটি হাসান",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 1982,
			"arabicnumber": 1982,
			"text": "১৯৮২। যিয়াদ ইবনু ইলাকা (রহ) হতে বর্ণিত আছে, তিনি বলেন, মুগীরা ইবনু শুবা (রাঃ)-কে আমি বলতে শুনেছি, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মৃত ব্যক্তিদেরকে তোমরা গালি দিও না, (যদি দাও) তাহলে জীবিতদেরই কষ্ট দিলে। সহীহ, রাওয (৩৫৭), তা’লীকুর রাগীব (৪/১৩৫), সহীহাহ (২৩৭৯) আবূ ঈসা বলেন, এই হাদীসটি বর্ণনায় সুফিয়ানের শাগরিদগণ দ্বিমত পোষণ করেছেন। তাদের কেউ কেউ আল-হাফারীর রিওয়ায়াতের অনুরূপ বর্ণনা করেছেন এবং অনেকে বলেছেন, সুফিয়ান-যিয়াদ ইবনু ইলাকা হতে বর্ণনা করেছেন যে, তিনি বলেন, আমি এক ব্যক্তিকে মুগীরা ইবনু শুবার নিকট রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সূত্রে একইরকম হাদীস বর্ণনা করতে শুনেছি।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 1983,
			"arabicnumber": 1983,
			"text": "১৯৮৩৷ আবদুল্লাহ ইবনু মাসউদ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মুসলিমকে গালি দেয়া ফাসিকী ও নাফারমানীমূলক কাজ এবং তাকে মেরে ফেলা বা তার বিরুদ্ধে অস্ত্রধারণ করা কুফরীমূলক কাজ। সহীহ, ইবনু মা-জাহ (৬৯), বুখারী ও মুসলিম। অধঃস্তন বর্ণনাকারী যুবাইদ বলেন, আবূ ওয়াইলকে আমি প্রশ্ন করলাম, আপনি এ হাদীসটি কি আবদুল্লাহ ইবনু মাসউদ (রাঃ) এর নিকট সরাসরি শুনেছেন? তিনি বলেন, হ্যাঁ। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 1984,
			"arabicnumber": 1984,
			"text": "১৯৮৪। আলী (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ জান্নাতের মধ্যে একটি বালাখানা (প্রাসাদ) আছে। এর ভিতর হতে বাইরের এবং বাহির হতে ভিতরের দৃশ্য দেখা যায়। এক বিদুঈন (গ্রাম্যলোক) দাড়িয়ে বলল, হে আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)। এই বালাখানা কোন ব্যক্তির জন্য? তিনি বললেনঃ যে লোক মানুষের সাথে উত্তমভাবে কথা বলে, ক্ষুধার্তকে খাদ্য দেয়, সর্বদা রোযা পালন করে এবং মানুষ যখন রাতে ঘুমিয়ে থাকে তখন আল্লাহ্ তা'আলার উদ্দেশ্যে নামায আদায় করে তার জন্য। হাসান, মিশকাত (২৩৩৫), তা’লীকুর রাগীব (২/৪৬)। আবূ ঈসা বলেন, এ হাদীসটি গারীব। আমরা এ হাদীস প্রসঙ্গে শুধুমাত্র আবদুর রাহমান ইবনু ইসহাকের সূত্রেই জেনেছি। এই আবদুর রাহমানের স্মরণশক্তি সম্পর্কে কোন কোন হাদীস বিশারদ সমালোচনা করেছেন। তিনি কৃফার বাসিন্দা। আর আবদুর রাহমান ইবনু ইসহাক আল-কুরাশী একজন মদীনার অধিবাসী। তিনি পূর্বোক্তজনের চাইতে বেশি বিশ্বস্ত ও নির্ভরযোগ্য। তারা উভয়ে ছিলেন সমসাময়িক।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 1985,
			"arabicnumber": 1985,
			"text": "১৯৮৫। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ সেই লোক কতই না উত্তম যে নিজের প্রভুরও আনুগত্য করে এবং নিজের মনিবের হকও আদায় করে অর্থাৎ গোলাম। সহীহ, তা’লীকুর রাগীব (৩/১৫৯), বুখারী ও মুসলিম। কা'ব (রাঃ) বলেন, আল্লাহ ও তার রাসূল সত্যিই বলেছেন। এ অনুচ্ছেদে আবূ মূসা ও ইবনু উমর (রাঃ) হতেও হাদীস বর্ণিত আছে। আৰূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 1986,
			"arabicnumber": 1986,
			"text": "১৯৮৬। ইবনু উমার (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তিন ব্যক্তি কিয়ামতের দিন কস্তরীর টিলার উপর থাকবে। (এক) যে ক্রীতদাস আল্লাহ্ তা'আলার হাক্কও আদায় করে এবং মনিবের হাক্কও আদায় করে, (দুই) যে ইমামের উপর তার মুসল্লিগণ সন্তুষ্ট এবং (তিন) যে ব্যক্তি দিনে ও রাতে পাঁচবার নামাযের জন্য আহবান জানায়। যঈফ, মিশকাত (৬৬৬) আবূ ঈসা বলেনঃ এ হাদীসটি হাসান গারীব। সুফিয়ান হতে আবূল ইয়াকজান-এর সূত্রেই শুধু আমরা এ হাদীস প্রসঙ্গে জেনেছি। আবূল ইয়াকজানের নাম উসমান ইবনু কাইস, মতান্তরে ইবনু উমাইর এবং এটাই প্রসিদ্ধ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 1987,
			"arabicnumber": 1987,
			"text": "১৯৮৭। আবূ যার (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে বলেছেনঃ তুমি যেখানেই থাক আল্লাহ্ তা'আলাকে ভয় কর, মন্দ কাজের পরপরই ভাল কাজ কর, তাতে মন্দ দূরীভূত হয়ে যাবে এবং মানুষের সাথে উত্তম আচরণ কর। হাসান, মিশকাত (৫০৮৩), রাওযুন নায়ীর (৮৫৫) আবূ হুরাইরা (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ্। মাহমূদ ইবনু গাইলান-আবূ আহমাদ হতে, তিনি আবু নুয়াইম হতে, তিনি সুফিয়ান হতে, তিনি হাবীব (রাহঃ) হতে এই সূত্রে একইরকম বর্ণনা করেছেন। মাহমূদ-ওয়াকী হতে, তিনি সুফিয়ান হতে, তিনি হাবীব ইবনু আবী সাবিত হতে, তিনি মাইমূন ইবনু আবী শাবীব হতে, তিনি মুআয ইবনু জাবাল (রাঃ) হতে, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে একইরকম বর্ণনা করেছেন। মাহমূদ বলেন, আবূ যর (রাঃ)-এর হাদীসটি সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 1988,
			"arabicnumber": 1988,
			"text": "১৯৮৮। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মন্দ ধারণা পোষণ করা হতে তোমরা দূরে থাক। কেননা, মন্দ ধারণা হলো সবচেয়ে বড় মিথ্যা কথা। সহীহ, গাইয়াতুল মারাম (৪১৭), বুখারী ও মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। সুফিয়ান বলেন ধারণা-অনুমান দুই প্রকারে বিভক্ত। এক প্রকার ধারণা পাপের অন্তর্ভুক্ত এবং অন্য প্রকার ধারণা গুনাহের অন্তর্ভুক্ত নয়। অন্তরে কাল্পনিক ধারণা পোষণ করে মুখে তা প্রকাশ করা গুনাহের অন্তর্ভুক্ত। যদি মনে মনে ধারণা পোষণ করা হয় এবং তা মুখে প্রকাশ না করা হয় তাহলে তা গুনাহের অন্তভুক্ত নয়।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 1989,
			"arabicnumber": 1989,
			"text": "১৯৮৯। আনাস (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের (ছোটদের) সাথে মিশতেন। এমনকি আমার ছোট ভাইটিকে তিনি কৌতুক করে বলতেনঃ হে আবূ উমাইর! কি করেছে নুগাইর (ছোট্ট পোষা পাখি)। সহীহ, বুখারী ও মুসলিম। ৩৩৩ নং হাদীস পূর্বে বর্ণিত হয়েছে হান্নাদ-ওয়াকী হতে, তিনি শুবা হতে, তিনি আবূত তাইয়্যাহ হতে, তিনি আনাস (রাঃ) হতে একইরকম বর্ণনা করেছেন। আবূত তাইয়্যাহ-এর নাম ইয়াযীদ, পিতা হুমাইদ আয-যুবাই। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 1990,
			"arabicnumber": 1990,
			"text": "১৯৯০। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, সাহাবীগণ বললেন, হে আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)। আপনি তো আমাদের সাথে কৌতুকও করে থাকেন। তিনি বললেনঃ আমি শুধু সত্য কথাই বলে থাকি (এমনকি কৌতুকেও)। সহীহ, সহীহাহ (১৭২৬), মুখতাসার শামা-ইল (২০২)। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 1991,
			"arabicnumber": 1991,
			"text": "১৯৯১। আনাস (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট একজন লোক আরোহণযোগ্য একটি বাহন চাইল। তিনি বললেনঃ একটি উষ্ট্রীর বাচ্চায় আমি তোমাকে আরোহণ করাব। সে বলল, হে আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)। আমি উষ্ট্রীর বাচ্চা দিয়ে কি করব? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ উষ্ট্রী ব্যতীত আর কোন কিছু কি উট প্রসব করে? সহীহ, মিশকাত (৪৮৮৬), মুখতাসার শামা-ইল (২০৩)। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ গারীব।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 1992,
			"arabicnumber": 1992,
			"text": "১৯৯২। আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে “হে দুই কান বিশিষ্ট” বলে সম্বোধন করেন। সহীহ্, মুখতাসার শামা-ইল (২০০) আবূ উসামা বলেন, তিনি কৌতুক হিসাবে তা বলতেন। আবূ ঈসা বলেন, এ হাদীসটি সহীহ গারীব।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 1993,
			"arabicnumber": 1993,
			"text": "১৯৯৩। আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তি বাতিল ও জঘন্য মিথ্যা বলা ছেড়ে দিল, তার জন্য জান্নাতের মধ্যে এক পাশে প্রাসাদ নির্মাণ করা হয়। যে ব্যক্তি ন্যায়ানুগ হওয়া সত্ত্বেও ঝগড়া-বিবাদ ছেড়ে দিল, তার জন্য জান্নাতের মাঝখানে একটি প্রাসাদ নির্মাণ করা হয়। যে ব্যক্তি নিজের চরিত্র উন্নত করে তার জন্য জান্নাতের সর্বোচ্চ জায়গাতে একটি প্রাসাদ নির্মাণ করা হয়। এই শব্দে হাদীসটি যঈফ, ইবনু মাজাহ (৫১) আবূ ঈসা বলেছেন, এ হাদীসটি হাসান। আমরা এ হাদীসটি শুধুমাত্র সালামা ইবনু ওয়ারদান হতে আনাস ইবনু মালিক (রাঃ)-এর সূত্রে জেনেছি।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Batil"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Batil"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 1994,
			"arabicnumber": 1994,
			"text": "১৯৯৪। ইবনু আব্বাস (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ঝগড়াটে হওয়াই তোমার পাপিষ্ঠ হওয়ার জন্য যথেষ্ঠ। যঈফ, যঈফা (৪০৯৬) আবূ ঈসা বলেছেন, এ হাদীসটি গারীব। শুধু উপরোক্ত সূত্রেই আমরা এ হাদীস জেনেছি।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 1995,
			"arabicnumber": 1995,
			"text": "১৯৯৫। ইবনু আব্বাস (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমার ভাইয়ের সাথে ঝগড়া করো না, তাকে ঠাট্টা-বিদ্রুপ করো না এবং তার সাথে এরূপ ওয়াদা করো না যা তুমি পরে ভেঙ্গে ফেলবে। যঈফ, মিশকাত, তাহকীক ছানী (৪৮৯২) আবূ ঈসা বলেনঃ উল্লেখিত সনদসূত্রে এ হাদীসটি গারীব। আমার মতে আব্দুল মালিক হলেন ইবনু বাশীর।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 1996,
			"arabicnumber": 1996,
			"text": "১৯৯৬। আইশা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সাথে দেখা করার জন্য একজন লোক অনুমতি চাইলো। আমি সে সময়ে তার সামনে উপস্থিত ছিলাম। তিনি বললেনঃ গোত্রের মধ্যে এই লোকটি অথবা গোত্রের এই ভাই কতই না মন্দ! তারপর তিনি তাকে ভিতরে প্রবেশের সম্মতি প্রদান করলেন এবং তার সাথে নম্র ভাষায় কথা বললেন। লোকটি চলে যাওয়ার পর আমি তাকে বললাম, হে আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)। আপনি প্রথম অবস্থায় তার ব্যাপারে এই এই কথা বললেন, তারপর তার সাথে নম্র ভাষায় কথা বললেন। তিনি বললেন, হে আইশা! মানুষের মধ্যে সেই ব্যক্তি সবচেয়ে নিকৃষ্ট, যার অশালীন আচরণ হতে মুক্তির জন্য জনগণ তাকে পরিত্যাগ করে। সহীহ, সহীহাহ (১০৪৯), মুখতাসার শামাইল (৩০১), বুখারী, মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 1997,
			"arabicnumber": 1997,
			"text": "১৯৯৭। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, (মুহাম্মাদ ইবনু সীরীন বলেন) আমার অনুমান যে, তিনি এটা মারফুভাবে বর্ণনা করেছেন (অর্থাৎ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের বাণী স্বরূপ বর্ণনা করেছেন)। তিনি বলেছেনঃ নিজের বন্ধুর সাথে ভালবাসার আধিক্য প্রদর্শন করবে না। হয়ত সে একদিন তোমার শত্রু হয়ে যাবে। তোমার শত্রুর সাথেও শত্রুতার চরম সীমা প্রদর্শন করবে না। হয়ত সে একদিন তোমার বন্ধু হয়ে যাবে। সহীহ, গাইয়াতুল মারাম (৪৭২)। আবূ ঈসা বলেন, এ হাদীসটি গারীব। আমরা তা উল্লেখিত সনদসূত্রে এভাবেই জেনেছি। এ হাদীসটি আইয়ূব (রহঃ) হতে ভিন্ন সনদেও বর্ণিত আছে। এ হাদীসটি হাসান ইবনু আবূ জাফর আলী (রাঃ)-এর সূত্রে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেছেন। কিন্তু এটি দুর্বল। সহীহ হলো আলী (রাঃ) হতে মাওকুফ বর্ণনাটি।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 1998,
			"arabicnumber": 1998,
			"text": "১৯৯৮। আবদুল্লাহ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ সরিষার দানা সমপরিমাণ অহংকারও (সামান্যতম) যার অন্তরে আছে সে জান্নাতে যেতে পারবে না। আর সরিষার দানা সমপরিমান ঈমানও যার অন্তরে আছে সে জাহান্নামে যাবে না। সহীহ, তাখরীজ ইসলাহুল মাসা-জিদ (১১৫), মুসলিম। আবূ হুরাইরা, ইবনু আব্বাস, সালামা ইবনুল আকওয়া ও আবূ সাঈদ (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 1999,
			"arabicnumber": 1999,
			"text": "১৯৯৯। আবদুল্লাহ (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তির অন্তরে অণু পরিমাণ অহংকারও আছে সে জান্নাতে যেতে পারবে না। আর যে ব্যক্তির অন্তরে অণু পরিমাণ ঈমানও আছে সে জাহান্নামে যাবে না। তখন একজন বলল, আমার নিকট এটা তো খুবই পছন্দনীয় যে, আমার জামা-কাপড় সুন্দর হোক এবং আমার জুতা জোড়াও সুন্দর হোক। তিনি বললেনঃ আল্লাহ তা'আলা অবশ্যই সৌন্দর্যকে পছন্দ করেন। কোন ব্যক্তির সদৰ্পে সত্যকে প্রত্যাখ্যান করা এবং মানুষকে তুচ্ছজান করাই হলো অহংকার। সহীহ, সহীহাহ (১৬২৬), মুসলিম। “যে ব্যক্তির অন্তরে অণু পরিমাণ ঈমানও আছে সে ব্যক্তি জাহান্নামে যাবে না\" শীর্ষক হাদীসের ব্যাখ্যায় একদল মুহাদ্দিস বলেন, সে জাহান্নামে স্থায়ী হবে না (আযাবের পর মুক্তি পাবে)। আবূ সাঈদ খুদরী (রাঃ)-এর সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত আছে, তিনি বলেছেনঃ “যার অন্তরে অনু পরিমাণ ঈমানও আছে তাকে জাহান্নাম হতে বের করা হবে”। “হে আমাদের প্রভু! তুমি যে ব্যক্তিকে জাহান্নামে দাখিল করাবে তাকে তুমি অপমান করলে\" শীর্ষক আয়াতের ব্যাখ্যায় একদল তাবিঈ বলেন, যে ব্যক্তিকে তুমি চিরস্থায়ী জাহান্নামী করলে তাকে তুমি চরম অপমান করলে। আবূ ঈসা বলেন, এ হাদিসটি হাসা সহীহ, গারীব।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 2000,
			"arabicnumber": 2000,
			"text": "২০০০। সালামা ইবনুল আকওয়া (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন ব্যক্তি নিজেকে বড় বলে ভাবতে ভাবতে এমন এক পর্যায়ে নিয়ে যায় শেষ পর্যন্ত সে অহংকারীদের তালিকাভুক্ত হয়ে যায়। ফলে অহংকারীদের যে পরিণতি হয় তারও তাই হয়। যঈফ, যঈফা (১৯১৪) আবূ ঈসা বলেনঃ এ হাদীসটি হাসান গারীব।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 2001,
			"arabicnumber": 2001,
			"text": "২০০১। নাফি ইবনু জুবাইর ইবনু মুতঈম (রাঃ) হতে তার পিতার সূত্রে বর্ণিত আছে, তিনি (যুবাইর) বলেন, তোমরা বলে থাক আমার মধ্যে অহংকার রয়েছে। অথচ আমি গাধায় আরোহণ করি, চাদর পরিধান এবং ছাগলের দুধ দোহন করি। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে এ কাজগুলো করে তার মধ্যে সামান্যতম অহংকারও নেই। সনদ সহীহ। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ্ গরীব।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 2002,
			"arabicnumber": 2002,
			"text": "২০০২। আবূদ দারদা (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কিয়ামত দিবসে মুমিনের দাড়িপাল্লায় সচ্চরিত্র ও সদাচারের চেয়ে বেশি ওজনের আর কোন জিনিস হবে না। কেননা, আল্লাহ তা'আলা অশ্লীল ও কটুভাষীকে ঘৃণা করেন। সহীহ, সহীহাহ (৮৭৬), রাওযুন নাযীর (৯৪১) আবূ ঈসা বলেন, আইশা, আবূ হুরাইরা, আনাস ও উসামা ইবনু শারীক (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 2003,
			"arabicnumber": 2003,
			"text": "২০০৩। আবূদ দারদা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে বলতে শুনেছিঃ সচ্চরিত্র ও সদাচারই দাঁড়িপাল্লায় সবচাইতে ভারী হবে। সচ্চরিত্রবান ও সদাচারী ব্যক্তি তার সদাচার ও চরিত্র মাধুর্য দ্বারা অবশ্যই রোযাদার ও নামায়ীর পর্যায়ে পৌঁছে যায়। সহীহ, প্রাগুক্ত। আবূ ঈসা বলেন, উল্লেখিত সনদসূত্রে এ হাদীসটি গারীব।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 2004,
			"arabicnumber": 2004,
			"text": "২০০৪। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে প্রশ্ন করা হলো, কোন কর্মটি সবচাইতে বেশি পরিমাণ মানুষকে জান্নাতে নিয়ে যাবে। তিনি বললেনঃ আল্লাহভীতি, সদাচার ও উত্তম চরিত্র। আবার তাকে প্রশ্ন করা হলো, কোন কাজটি সবচাইতে বেশি পরিমাণ মানুষকে জাহান্নামে নিয়ে যাবে। তিনি বললেনঃ মুখ ও লজ্জাস্থান। সনদ, হাসান। আবূ ঈসা বলেন, এ হাদীসটি সহীহ গারীব। আবদুল্লাহ ইবনু ইদরীস হলেন ইবনু ইয়াযীদ ইবনু আবদুর রাহমান আল-আওদী।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 2005,
			"arabicnumber": 2005,
			"text": "২০০৫। সদাচার ও উত্তম চরিত্রের বর্ণনা দিতে গিয়ে আবদুল্লাহ ইবনুল মুবারাক (রহঃ) বলেন, তা হলো হাস্যোজ্জ্বল চেহারা, উত্তম জিনিস দান করা এবং কষ্ট দেয়া হতে বিরত থাকা। সনদ সহীহ।",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 2006,
			"arabicnumber": 2006,
			"text": "২০০৬। আবূল আহওয়াস (রাহঃ) হতে তার বাবার সূত্রে বর্ণিত আছে, তিনি বলেন, আমি বললাম, হে আল্লাহর রাসূল আমি কোন লোককে অতিক্রম করি, সে আমাকে পানাহার করায় না, মেহমানদারীও করে না। যদি ঐ লোকটি আমাকে অতিক্রম করে, আমি কি একইভাবে তার প্রতিশোধ গ্রহণ করতে পারি? তিনি বললেনঃ না, তুমি তার মেহমানদারী কর। (বর্ণনাকারী বলেন) আমাকে খুবই পুরাতন পোশাক পরে থাকতে দেখে তিনি প্রশ্ন করলেনঃ তোমার ধন-দৌলত আছে কি? আমি বললাম, আল্লাহ তা'আলা আমাকে উট, ছাগল-ভেড়া প্রভৃতি সকল প্রকার সম্পদই দিয়েছেন। তিনি বললেনঃ তা তোমার শরীরে পরিলক্ষিত হওয়া উচিত। সহীহ, গাইয়াতুল মারাম (৭৫), সহীহাহ (১৩২০)। আবূ ঈসা বলেন, আইশ, জাবির ও আবূ হুরাইরা (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। এ হাদীসটি হাসান সহীহ। আবূল আহওয়াসের নাম আওফ, পিতা মালিক ইবনু নাযলা আল-জুশামী। “ইকরিহি” অর্থ তাকে আতিথ্য প্রদর্শন কর। “আল-কিরা\" অর্থ “আতিথেয়তা”।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 2007,
			"arabicnumber": 2007,
			"text": "২০০৭। হুযাইফা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা অনুকরণপ্রিয় হয়ো না যে, তোমরা এরূপ বলবেঃ লোকরা যদি আমাদের সাথে ভাল ব্যবহার করে তাহলে আমরাও ভাল ব্যবহার করব। যদি তারা আমাদের সাথে যুলুম করে তাহলে আমরাও যুলুম করব। বরং তোমরা নিজেদের অন্তরে এ কথা বদ্ধমূল করে নাও যে, লোকেরা তোমাদের সাথে ভাল ব্যবহার করলে তোমরাও ভাল ব্যবহার করবে। তারা তোমাদের সাথে অন্যায় ব্যবহার করলেও তোমরা যুলুমের পথ বেছে নিবে না। যঈফ, নাকদুল কাত্তানী (২৬) মিশকাত (৫১২৯) আবূ ঈসা বলেছেন, এ হাদীসটি হাসান গারীব। শুধু উল্লেখিত সনদসূত্রেই আমরা এটা জেনেছি।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 2008,
			"arabicnumber": 2008,
			"text": "২০০৮। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে লোক আল্লাহ তা'আলার সন্তুষ্টি হাসিলের আশায় কোন অসুস্থ লোককে দেখতে যায় অথবা নিজের ভাইয়ের সাথে দেখা-সাক্ষাৎ করতে যায়, একজন ঘোষক (ফিরিশতা) তাকে ডেকে বলতে থাকেনঃ কল্যাণময় তোমার জীবন, কল্যাণময় তোমার এই পথ চলাও। তুমি তো জান্নাতের মধ্যে একটি বাসস্থান নির্দিষ্ট করে নিলে। হাসান, মিশকাত (৫০১৫)। আবূ ঈসা বলেন, এ হাদীসটি হাসান গারীব। আবূ সিনানের নাম ঈসা ইবনু সিনান। হাম্মাদ ইবনু সালামা-সাবিত হতে, তিনি আবূ রাফি হতে, তিনি আবূ হুরাইরা (রাঃ) হতে, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এইরকম কিছু বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 2009,
			"arabicnumber": 2009,
			"text": "২০০৯। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ লজ্জা-সন্ত্রম হচ্ছে ঈমানের অঙ্গ, আর ঈমানের (ঈমানদারের) জায়গা জান্নাতে। নির্লজ্জতা ও অসভ্যতা হচ্ছে দুর্ব্যবহারের অঙ্গ, আর দুর্ব্যবহারের (দুর্ব্যবহারকারীর) জায়গা জাহান্নামে। সহীহ, সহীহাহ (৪৯৫), রাওযুন নায়ীর (৭৪৬)। আবূ ঈসা বলেন, ইবনু উমার, আবূ বাকরা, আবূ উমামা ও ইমরান ইবনু হুসাইন (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 2010,
			"arabicnumber": 2010,
			"text": "২০১০। আবদুল্লাহ ইবনু সারজিস আল-মুযানী (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ উত্তম আচরণ, দৃঢ়তা-স্থিরতা ও মধ্যমপন্থা অবলম্বন করা হচ্ছে নাবুওয়াতের চব্বিশ ভাগের একভাগ। হাসান, রাওযুন নায়ীর (৩৮৪), তা’লীকুর রাগীব (৩/৬)। আবূ ঈসা বলেন, ইবনু আব্বাস (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। এ হাদীসটি হাসান গারীব। কুতাইবা-নূহ ইবনু কাইস হতে, তিনি আবদুল্লাহ ইবনু ইমরান হতে, তিনি আবদুল্লাহ ইবনু সারজিস (রাঃ) হতে, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে (উপরের হাদীসের) একইরকম বর্ণনা করেছেন। এই সূত্রটিতে আসিমের উল্লেখ নেই। কিন্তু নাসর ইবনু আলীর হাদীসটিই সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 2011,
			"arabicnumber": 2011,
			"text": "২০১১। ইবনু আব্বাস (রাঃ) হতে বর্ণিত আছে, আবদুল কাইস বংশের প্রতিনিধি দলের নেতা আশাজ্জকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তোমাদের মধ্যে এরূপ দুটি গুণ রয়েছে যা আল্লাহ তা'আলা অধিক পছন্দ করেনঃ সহিষ্ণুতা ও স্থিরতা। সহীহ, ইবনু মা-জাহ (৪১৮৮), মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ গারীব। আশাজ্জ আল-আসারী (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 2012,
			"arabicnumber": 2012,
			"text": "২০১২। সাহল ইবনু সা’দ আস-সায়িদী (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ধৈর্য ও স্থিরতা আল্লাহ্ তা'আলার পক্ষ হতে, আর তাড়াহুড়া শাইতানের পক্ষ হতে। যঈফ, মিশকাত, তাহকীক ছানী (৫০৫৫) আবূ ঈসা বলেনঃ এ হাদীসটি গারীব। একদল হাদীস বিশারদ আবদুল মুহাইমিনের সমালোচনা করেছেন। তারা বলেছেন, তার স্মৃতিশক্তি দুর্বল। আল-আশাজ-এর নাম আল-মুনযির, পিতা আয়িয।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 2013,
			"arabicnumber": 2013,
			"text": "২০১৩। আবূদ দারদা (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তিকে নমনীয়তার অংশ দেয়া হয়েছে তাকে কল্যাণের অংশ দেয়া হয়েছে। নমনীয়তার অংশ হতে যে ব্যক্তিকে বঞ্চিত করা হয়েছে তাকে কল্যাণের অংশ হতে বঞ্চিত করা হয়েছে। সহীহ, সহীহাহ (৫১৫, ৮৭৪)। আবূ ঈসা বলেন, আইশ, জারীর ইবনু আবদুল্লাহ ও আবূ হুরাইরা (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 2014,
			"arabicnumber": 2014,
			"text": "২০১৪। ইবনু আব্বাস (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মুআয (রাঃ)-কে ইয়ামানে প্রেরণের সময় বলেনঃ অত্যাচারিতের বদ-দু’আকে ভয় কর। কেননা, তার বদ-দুআ এবং আল্লাহ তা'আলার মাঝখানে কোন প্রতিবন্ধকতা নেই। সহীহ, সহীহ আবূ দাউদ (১৪১২), বুখারী, মুসলিম। আবূ ঈসা বলেন, আনাস, আবূ হুরাইরা, আবদুল্লাহ ইবনু আমর ও আবূ সাঈদ (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। এ হাদীসটি হাসান সহীহ। আবূ মা'বাদের নাম না-ফিয।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 2015,
			"arabicnumber": 2015,
			"text": "২০১৫ আনাস (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমি দশবছর যাবতকাল ধরে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সেবা-যত্ন করেছি। তিনি আমার প্রতি কখনো উহ’ শব্দটিও উচ্চারণ করেননি (অসন্তোষ প্রকাশ করেননি)। তিনি আমার কোন কাজে কখনো অসন্তোষ প্রকাশ করে বলেননি যে, এটা তুমি করলে কেন অথবা কোন কাজ ছুটে যাওয়ার কারণেও তিনি বলেননি যে, এটা তুমি কেন করলে না। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ছিলেন সবচাইতে উত্তম চারিত্রিক বৈশিষ্ট্যের মানুষ। আমি রেশম এবং পশম মিশিয়ে বানানো কাপড়ও নিজ হাতে ছুয়ে দেখেছি এবং খাটি রেশমী কাপড়ও ছুয়েছি কিন্তু রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের হাতের চেয়ে অধিক নরম ও মসৃন কোন কিছু স্পর্শ করিনি। আমি মৃগনভির গন্ধও গ্রহণ করেছি এবং আতরের গন্ধও গ্রহণ করেছি কিন্তু রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের শরীরের ঘামের চেয়ে অধিক সুগন্ধ কোন কিছুতেই পাইনি। সহীহ, মুখতাসার শামা-ইল (২৯৬), বুখারী, মুসলিম। আবূ ঈসা বলেন, আইশা ও বারাআ (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 2016,
			"arabicnumber": 2016,
			"text": "২০১৬। আবূ আবদুল্লাহ আল-জাদালী (রাহঃ) বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের চরিত্র-মাধুর্য সম্বন্ধে আইশা (রাঃ)-কে প্রশ্ন করলাম। তিনি বললেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কখনো অশ্লীল ও কটুভাষী ছিলেন না, অশ্লীল ব্যবহারও করেননি। তিনি কখনো বাজারে গিয়ে হউগোল করতেন না এবং অন্যায়ের দ্বারা অন্যায়ের প্রতিশোধ নেননি। বরং তিনি উদার মন নিয়ে ক্ষমা করে দিতেন। সহীহ, মুখতাসার শামা-ইল (২৯৮), মিশকাত (৫৮২০) আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। আবূ আবদুল্লাহ আবদ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 2017,
			"arabicnumber": 2017,
			"text": "২০১৭। আইশা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমার খাদীজা (রাঃ)-এর উপর যতটুকু ঈর্ষা হয়েছিল, এতটুকু পরিমাণ ঈর্ষা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের আর কোন স্ত্রীর উপর হয়নি। অথচ আমি তাকে পাইনি। আমার ঈর্ষার কারণ ছিল, তাঁকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বেশি বেশি স্মরণ করতেন। তিনি কখনো ছাগল যবেহ করলে খাদীজা (রাঃ)-এর বান্ধবীদের খুঁজে খুঁজে তার গোশত উপহার স্বরূপ প্রদান করতেন। সহীহ, বুখারী, মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান গারীব সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 2018,
			"arabicnumber": 2018,
			"text": "২০১৮। জাবির (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের যে ব্যক্তির চরিত্র ও আচরণ সর্বোত্তম তোমাদের মধ্যে সে-ই আমার নিকট সর্বাধিক প্রিয় এবং কিয়ামত দিবসেও আমার খুবই নিকটে থাকবে। তোমাদের মধ্যে যে ব্যক্তি আমার নিকট সবচেয়ে বেশি ঘৃণ্য সে ব্যক্তি কিয়ামত দিবসে আমার নিকট হতে অনেক দূরে থাকবে তারা হলোঃ বাচাল, ধৃষ্ট-নির্লজ্জ এবং অহংকারে মত্ত ব্যক্তিরা। সাহাবীগণ বললেন, হে আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)। বাচাল ও ধৃষ্ট-দাম্ভিকদের তো আমরা জানি কিন্তু মুতাফাইহিকূন কারা? তিনি বললেনঃ অহংকারীরা। সহীহ, সহীহাহ (৭৯১)। আবূ ঈসা বলেন, আবূ হুরাইরা (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। এ হাদীসটি হাসান ও উপরোক্ত সূত্রে গারীব। একদল বর্ণনাকারী তাদের বর্ণনায় আবদু রব্বিহি ইবনু সাঈদের নাম উল্লেখ করেননি। তারা সরাসরি মুবারাক ইবনু ফাযালার মাধ্যমে মুহাম্মাদ ইবনুল মুনকাদির হতে জাবির (রাঃ)-এর সূত্রে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেছেন। এই সূত্রটিই অনেক বেশি সহীহ। ‘আস-সারসার যে লোক বেশি কথা বলে (বাচাল)। আল-মুতাশাদিক' , মানুষের সামনে যে লোক লম্বা লম্বা কথা বলে বেড়ায়, ধৃষ্টতাপূর্ণ ও অশালীন উক্তি করে, নির্লজ্জ ও দাম্ভিকতাপূর্ণ কথা বলে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 2019,
			"arabicnumber": 2019,
			"text": "২০১৯। ইবনু উমার (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মু'মিন ব্যক্তি কখনো অভিশাপকারী হতে পারে না। সহীহ, মিশকাত তাহকীক সানী (৪৮৪৮), জিলালুল জান্নাত (১০১৪)। আবূ ঈসা বলেন, ইবনু মাসউদ (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। এ হাদীসটি হাসান গারীব। এ হাদীসটিকে অন্য একদল বর্ণনাকারী উল্লেখিত সনদসূত্রে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এভাবে বর্ণনা করেছেনঃ “মুমিনের জন্য অভিশাপকারী হওয়া শোভনীয় নয়” এ হাদীসটি পূর্বের হাদীসের ব্যাখ্যা।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 2020,
			"arabicnumber": 2020,
			"text": "২০২০। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট একজন লোক এসে বলল, আমাকে কিছু শিখিয়ে দিন, তবে আমাকে বেশি বলবেন না, যাতে আমি তা মুখস্থ করতে পারি। তিনি বললেনঃ ক্রোধ প্রকাশ করো না, উত্তেজিত হয়ে না। লোকটি তার কথার পুনরাবৃত্তি করলে প্রতিবারই তিনি বললেনঃ ক্রোধ প্রকাশ করো না, উত্তেজিত হয়ো না। সহীহ বুখারী। আবূ ঈসা বলেন, আবূ সাইদ ও সুলাইমান ইবনু সারদ (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। এ হাদীসটি হাসান সহীহ এবং উল্লেখিত সনদসূত্রে গারীব। আবূ হাসীনের নাম উসমান, পিতা আসিম আল-আসাদী।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 2021,
			"arabicnumber": 2021,
			"text": "২০২১। সাহল ইবনু মুআয ইবনু আনাস আল-জুহানী (রহঃ) হতে তার বাবার সূত্রে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে লোক তার ক্রোধকে বাস্তবায়ন করার ক্ষমতা রেখেও তা নিয়ন্ত্রণ করে- আল্লাহ তা'আলা কিয়ামত দিবসে তাকে সমগ্র সৃষ্টির সামনে ডেকে এনে জান্নাতের যে কোন হুর নিজের ইচ্ছামতো বেছে নেয়ার অধিকার দিবেন। সহীহ, সহীহাহ (১৭৫০)। আবূ ঈসা বলেন, এ হাদীসটি হাসান গরীব।",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 2022,
			"arabicnumber": 2022,
			"text": "২০২২। আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে যুবক প্রবীণ ব্যাক্তিকে সম্মান করবে, আল্লাহ তা’আলা তার জন্য এক ব্যাক্তি নিযুক্ত করবেন যে তাকে তার প্রবীণ বয়সে সম্মান করবে। যঈফ, যঈফা (৩০৪), মিশকাত (৪৯৭১) আবূ ঈসা বলেছেন, এ হাদীসটি গারীব। আমরা শুধুমাত্র এই শাইখ অর্থাৎ ইয়াযীদ ইবনু বাইয়ানের সূত্রেই এই হাদীস জেনেছি। সনদে আবূর রিজাল আনসারী নামক আরও একজন রাবী আছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 2023,
			"arabicnumber": 2023,
			"text": "২০২৩। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ জান্নাতের দরজাগুলো সোমবার ও বৃহস্পতিবার খুলে দেয়া হয়। যেসব পাপী আল্লাহ তা'আলার সাথে অংশীদারিত্ব স্থাপন করেনি তাদেরকে মাফ করে দেয়া হয়। কিন্তু পরস্পর সম্পর্ক ছিন্নকারীর ব্যাপারে (আল্লাহ তা'আলা বলেন)- এদেরকে ফিরিয়ে দাও যে পর্যন্ত না এরা নিজেদের মধ্যে সমঝোতা স্থাপন করে। সহীহ, ইরওয়া (৩/১০৫), গাইয়াতুল মারাম (৪১২), মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। কোন কোন হাদীসে এভাবে বর্ণিত হয়েছেঃ “এদের উভয়ের বিষয়টি মুলতবি রাখ যে পর্যন্ত না নিজেদের পারস্পরিক সম্পর্ক সংশোধন করে নেয়।” “আল-মুহতাজিরাইনি\" বলতে এমন দুইজনকে বুঝানো হয়েছে, যারা পরস্পর সম্পর্ক ছিন্ন করে একজন অন্যজনের প্রতি শত্রুতা পোষণ করে। এটি ঐ হাদীসের মতো যাতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন মুসলিম ব্যাক্তির পক্ষে তিনদিনের বেশী সময় তার ভাইকে ছেড়ে থাকা বৈধ নয়”।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 2024,
			"arabicnumber": 2024,
			"text": "২০২৪। আবূ সাঈদ (রাঃ) হতে বর্ণিত আছে, আনসারদের কয়েকজন লোক রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকটে যৎসামান্য সাহায্য প্রার্থনা করল। তাদেরকে তিনি তা দিলেন। তারা আরো চাইলে তিনি তাদেরকে তা দিলেন। তারপর তিনি বললেনঃ আমার নিকট যে সম্পদই আছে তোমাদের তা না দিয়ে কখনো জমা করে রাখি না। যে স্বনির্ভর হতে চায় আল্লাহ তা'আলা তাকে স্বনির্ভর করেন। যে (অপরের নিকট চাওয়া হতে) সংযমী হতে চায় আল্লাহ তা'আলা তাকে সংযমী করেন। যে ধৈর্যশীল হতে চায়, আল্লাহ তা'আলা তাকে ধৈর্যের তাওফীক দেন। ধৈর্যের চেয়ে বেশি কল্যাণকর প্রাচুর্যপুর্ণ কোন সম্পদ কাউকে দেয়া হয়নি। সহীহ, তা’লীকুর রাগীব (২/১১), সহীহ আবূ দাউদ (১৪৫১), বুখারী, মুসলিম। আবূ ঈসা বলেন, আনাস (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। এ হাদীসটি হাসান সহীহ। ইমাম মালিকের বর্ণনায় আছে “ফালান আযখারাহু আনকুম\", অর্থ একই (তোমাদেরকে না দিয়ে আমি তা জমা করে রাখি না)।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 2025,
			"arabicnumber": 2025,
			"text": "২০২৫। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কিয়ামত দিবসে দ্বিমুখী স্বভাবের মানুষেরা আল্লাহ্ তা'আলার নিকট সবচেয়ে নিকৃষ্ট বলে গণ্য হবে। সহীহ, সহীহুল জামি' (২২২৬), সহীহুল আদাবিল মুফরাদ (৯৮৭), বুখারী, মুসলিম। আবূ ঈসা বলেন, আমার ও আনাস (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 2026,
			"arabicnumber": 2026,
			"text": "২০২৬। হাম্মাম ইবনুল হারিস (রাহঃ) হতে বর্ণিত আছে, তিনি বলেন, হুযাইফা ইবনুল ইয়ামান (রাঃ)-কে একজন লোক অতিক্রম করে যাচ্ছিল। তাকে বলা হলো, এই লোক জনসাধারণের কথা প্রশাসকদের কানে পৌছিয়ে দেয়। (একথা শুনে) হুযাইফা (রাঃ) বললেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে বলতে শুনেছিঃ চোগলখোর জান্নাতে যেতে পারবে না। সহীহ, সহীহাহ (১০৩৪), গাইয়াতুল মারাম (৪৩৩), বুখারী, মুসলিম। সুফিয়ান বলেন, “আল-কাত্তাত” অর্থ চোগলখোর। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 2027,
			"arabicnumber": 2027,
			"text": "২০২৭। আবূ উমামা (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ লজ্জা-সন্ত্রম ও অল্প কথা বলা ঈমানের দুইটি শাখা। অশ্লীলতা ও বাকপটুতা (বাচালতা) নিফাকের (মুনাফিকীর) দুইটি শাখা। সহীহ, ঈমান ইবনে আবী শাইবা(১১৮), মিশকাত তাহকীক ছানী(৪৭৯৬) আবূ ঈসা বলেন, এ হাদীসটি হাসান গারীব। আমরা এটিকে আবূ গাসান মুহাম্মাদ ইবনু মুতারিরকের হাদীস হিসেবে জেনেছি। বর্ণনাকারী বলেন, “আল-আয়্যু অর্থ স্বল্পবাক 'আল-বাযা-য়ু অর্থ অশ্লীল ও নির্লজ্জবাক, আল-বায়ান অর্থ বাকপটু, বাক্যবাগীশ। যেমন পেশাধারী বক্তারা লম্বা লম্বা বক্তৃতা দিয়ে বেড়ায়, কথার বন্যা ছুটিয়ে দেয় এবং বাকপটুতার আশ্রয় নিয়ে মানুষের এমন সব প্রশংসা করতে থাকে, যা আল্লাহ তা'আলা মোটেই পছন্দ করেন না।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 2028,
			"arabicnumber": 2028,
			"text": "২০২৮। ইবনু উমর (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের আমলে দুইজন লোক এসে উপস্থিত হয়। তারা দুজনে এরকম জ্বালাময়ী বক্তৃতা দিল যে, জনগণ আশ্চর্য হয়ে গেল। তখন আমাদের দৃষ্টি আকর্ষণ করে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ কোন কোন বক্তৃতায় যাদু রয়েছে অথবা কোন কোন ভাষণে রয়েছে যাদুকরী প্রভাব। সহীহঃ বুখারী আবূ ঈসা বলেন, আম্মার, ইবনু মাসউদ ও আবদুল্লাহ ইবনুশ শিখখীর (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 2029,
			"arabicnumber": 2029,
			"text": "২০২৯। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যাকাত বা দানের কারণে কখনো সম্পদের কমতি হয় না। অবশ্যই ক্ষমা ও উদারতার দ্বারা আল্লাহ তা'আলা মান-সন্মান বাড়িয়ে দেন। আল্লাহ্ তা'আলার সন্তুষ্টি হাসিলের উদ্দেশ্যে যে লোক বিনয় ও নম্রতা অবলম্বন করে আল্লাহ তা'আলা তাকে অতি মর্যাদা সম্পন্ন করেন। সহীহ, ইরওয়া (২২০০), সহীহাহ (২৩২৮), মুসলিম। আবূ ঈসা বলেন, আবদুর রাহমান ইবনু আওফ, ইবনু আব্বাস ও আবূ কাবশা আমর ইবনু সা’দ আল-আনসা-র (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 2030,
			"arabicnumber": 2030,
			"text": "২০৩০। ইবনু উমর (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কিয়ামত দিবসে যুলুম-অত্যাচার অন্ধকারের মতো আবির্ভূত হবে। সহীহ, বুখারী, মুসলিম। আবূ ঈসা বলেন, আবদুল্লাহ ইবনু আমর, আইশ, আবূ মূসা, আবূ হুরাইরা ও জাবির (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। ইবনু উমারের হাদীস হিসেবে এ হাদীসটি হাসান সহীহ গারীব।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 2031,
			"arabicnumber": 2031,
			"text": "২০৩১। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কোন খাদ্যের উপর কখনো দোষারোপ করতেন না। রুচি হলে খেতেন আর না হয় পরিত্যাগ করতেন। সহীহ, বুখারী, মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। আবূ হাযিম হলেন আল আশজাঈ আল কুফী, তার নাম সালমান, আযযা আল আশযাঈইয়ার মুক্তদাস।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 2032,
			"arabicnumber": 2032,
			"text": "২০৩২। ইবনু উমার (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মিম্বারে উঠে চিৎকার দিয়ে বললেনঃ হে ঐ জামাআত, যারা মুখে ইসলাম কুবুল করেছ কিন্তু অন্তরে এখনো ঈমান মাজবুত হয়নি। তোমরা মুসলিমদের কষ্ট দিবে না, তাদের লজ্জা দিবে না এবং তাদের গোপন দোষ অনুসন্ধানে প্রবৃত্ত হবে না। কেননা, যে লোক তার মুসলিম ভাইয়ের গোপন দোষ অনুসন্ধানে নিয়োজিত হবে আল্লাহ তা'আলা তার গোপন দোষ প্রকাশ করে দিবেন। আর যে ব্যক্তির দোষ আল্লাহ তা'আলা প্রকাশ করে দিবেন তাকে অপমান করে ছাড়বেন, সে তার উটের হাওদার ভিতরে অবস্থান করে থাকলেও। বর্ণনাকারী (নাফি) বলেন, একদিন ইবনু উমার (রাঃ) বাইতুল্লাহ বা কা'বার দিকে তাকিয়ে বললেন, তুমি কতই না ব্যাপক ও বিরাট! তুমি কতইনা সম্মানিত কিন্তু তোমার চেয়েও মুমিনের সম্মান ও মর্যাদা আল্লাহ তা'আলার নিকটে অনেক বেশি। হাসান, মিশকাত (৫০৪৪), তা’লীকুর রাগীব (৩/২৭৭)। আবূ ঈসা বলেন, এ হাদীসটি গারীব। আমরা এ হাদীসটি শুধু হুসাইন ইবনু ওয়াকিদের সূত্রেই জেনেছি। ইসহাক ইবনু ইবরাহীম আস-সামারকান্দী-হুসাইন ইবনু ওয়াকিদ হতে একইরকম বর্ণনা করেছেন। আবূ বারযা আল-আসলামী (রাঃ)-এর সূত্রে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের হতে একইরকম বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 2033,
			"arabicnumber": 2033,
			"text": "২০৩৩। আবূ সাঈদ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ পদে পদে বাধাপ্রাপ্ত ব্যক্তিই সহনশীল ও ধৈর্যশীল হয় এবং অভিজ্ঞতা ছাড়া বিচক্ষণ ও প্রজ্ঞাবান হওয়া যায় না। যঈফ, মিশকাত (৫০৫৬) আবূ ঈসা বলেনঃ এ হাদীসটি হাসান গারীব। আমরা শুধু উল্লেখিত সনদসূত্রেই এ হাদীসটি জেনেছি।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 2034,
			"arabicnumber": 2034,
			"text": "২০৩৪। জাবির (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কাউকে কিছু দান করা হলে পরে তার (দান গ্রহীতার) সংগতি হলে সে যেন এর প্রতিদান দেয়। সংগতি না হলে সে যেন তার প্রশংসা করে। কেননা, যে লোক প্রশংসা করল সে কৃতজ্ঞতা প্রকাশ করল। আর যে তা গোপন রাখল সে অকৃতজ্ঞ হলো। যে লোক এমন কিছু পাওয়ার ভান করল যা তাকে দান করা হয়নি, সে যেন ধোকাবাজি ও প্রতারণার দুটি পোশাক পরল। হাসান, সহীহাহ (২৬১৭), তা’লীকুর রাগীব (২/৫৫)। আবূ ঈসা বলেন, এ হাদীসটি হাসান গারীব। আসমা বিনতু আবী বাকর ও আইশা (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। “মান কাতামা ফাকাদ কাফারা”-এর অর্থ “যে অনুগ্রহ গোপন করল সে অকৃতজ্ঞতা প্রকাশ করল\"।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 2035,
			"arabicnumber": 2035,
			"text": "২০৩৫। উসামা ইবনু যাইদ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কাউকে অনুগ্রহ করা হলে সে যদি অনুগ্রহকারীকে বলে, “তোমাকে আল্লাহ তা'আলা কল্যাণকর প্রতিদান দিন\" তবে সে উপযুক্ত ও পরিপূর্ণ প্রশংসা করল। সহীহ, মিশকাত (৩০২৪), তা’লীকুর রাগীব (২/৫৫), রাওযুন নায়ীর (৮)। আবূ ঈসা বলেন, এ হাদীসটি হাসান, জায়্যিদ (উত্তম) গারীব। এটিকে শুধুমাত্র উক্ত সনদে উসামা ইবনু যাইদ (রাঃ)-এর হাদীস বলে আমরা জানি। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের অনুরূপ হাদীস আবূ হুরাইরা (রাঃ) হতেও বর্ণিত হয়েছে। আমি মুহাম্মাদ (বুখারীকে) কে এ প্রসঙ্গে প্রশ্ন করলে তিনি এটি জানেন না বলেছেন। আব্দুর রহিম ইবনু হাযিম আল বালখী হতে বর্ণিত, তিনি বলেন, আমি মাক্কী ইবনু ইবরাহীমকে বলতে শুনেছি, আমরা ইবনু জুরাইজ আল-মাক্কীর নিকট উপস্থিত ছিলাম এমতাবস্থায় এক ব্যক্তি এসে তার নিকট কিছু চাইল। ইবনু জুরাইজ তার অর্থ সচিবকে বললেন তাকে একটি দীনার দিন। সে বলল, আমার নিকট একটি দীনার ব্যতীত আর কিছু নেই। এটি তাকে দান করলে আমার আপনার পরিবারের সবাইকে উপোস করতে হবে। একথা শুনে তিনি রাগান্বিত হলেন এবং বললেনঃ তাকে সেটা দাও। মাক্কী বলেন, আমরা ইবনু জুরাইজের নিকট থাকাবস্থায়ই এক ব্যক্তি একটি চিঠি এবং একটি থলে নিয়ে উপস্থিত হলেন। যাহা তার কোন ভাই তার নিকট পাঠিয়েছে। চিঠিতে লিখাছিল আমি পঞ্চাশটি দীনার পাঠাইলাম। বর্ণনাকারী বলেন, ইবনু জুরাইজ থলেটি খুলে দীনার গননা করলেন। তাতে তিনি (৫১) একান্নটি দীনার পেলেন। এতে ইবনু জুরাইজ তার অর্থ সচীবকে বললেনঃ তুমি এক দীনার দান করেছ, আল্লাহ সেটা তোমাকে ফেরত দিয়েছেন তার সাথে অতিরিক্ত আরো পঞ্চাশটি দিয়েছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 141
			}
		}
	]
}