{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"28": "Chapters on Medicine"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2036,
			"arabicnumber": 2036,
			"text": "২০৩৬। কাতাদা ইবনুন নুমান (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আল্লাহ তা'আলা যখন কোন বান্দাহকে ভালবাসেন তাকে দুনিয়া হতে বাঁচিয়ে রাখেন, যেমন তোমাদের কেউ তার রোগীকে পানি হতে বাচিয়ে রাখে। সহীহ, মিশকাত তাহকীক ছানী (৫২৫০)। আবূ ঈসা বলেন, সুহাইব এবং উন্মুল মুনযির (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। এ হাদীসটি হাসান গারীব। এ হাদীসটি মুরসালরূপেও মাহমূদ ইবনু লাবীদের সূত্রে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত হয়েছে। আলী ইবনু হুজর-ইসমাঈল ইবনু জাফর ইবনি কাতাদা হতে, তিনি মাহমূদ ইবনু লাবীদ (রাঃ) হতে, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে (উপরের হাদীসের) অনুরূপ বর্ণনা করেছেন। এই সূত্রে কাতাদার উল্লেখ নেই। আবূ ঈসা বলেন, কাতাদা (রাঃ) আবূ সাঈদ আল-খুদরীর বৈপিত্রেয় ভাই। মাহমুদ ইবনু লাবীদ (রাঃ) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সাক্ষাৎ পেয়েছেন। তিনি তখন ছোট বালক ছিলেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2037,
			"arabicnumber": 2037,
			"text": "২০৩৭। উম্মুল মুনযির (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার বাসায় আসলেন। আলী (রাঃ)-ও তার সাথে ছিলেন। আমাদের খেজুরের ছড়া ঝুলিয়ে রাখা ছিল। বর্ণনাকারী বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তা থেকে খেতে আরম্ভ করলেন। তার সাথে আলী (রাঃ)-ও খেতে লাগলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আলী (রাঃ)-কে বললেনঃ হে আলী! থাম, থাম, তুমি তো অসুস্থতাজনিত দুর্বল। বর্ণনাকারী বলেন, আলী (রাঃ) বসে গেলেন এবং রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খেতে থাকলেন। আমি (উন্মুল মুনযির) তাদের জন্য বীট এবং বার্লি বানিয়ে আনলাম। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ হে আলী! তুমি এটা খেতে পার, তোমার জন্য এটা বেশি উপযোগী। হাসান, দেখুন পরবর্তী হাদীস। আবূ ঈসা বলেন, এ হাদীসটি হাসান গারীব। আমরা এ হাদীসটি শুধুমাত্র ফুলাইহ-এর সূত্রেই জেনেছি। এটি ফুলাইহু হতে আইয়ুব ইবনু আবদুর রাহমানের সূত্রেও বর্ণিত আছে। উন্মুল মুনযির আল-আনসারিয়া (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের বাড়ীতে আসলেন... উপরের হাদীসের অনুরূপ। এই বর্ণনার শেষে আছেঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমার জন্য এটা বেশি উপকারী। হাসান, ইবনু মা-জাহ (৩৪৪২)। আবু ঈসা বলেন, এ হাদিসটি হাসান গারীব। আমরা এ হাদিসটি শুধুমাত্র ফুলাইহ এর সুত্রে জেনেছি। এটি ফুলাইহ হতে আইয়ুব ইবনু আব্দুর রাহমানের সুত্রে বর্ণিত আছে। উম্মুল মুনযির আল আনসারিয়া (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের বাড়ীতে আসলেন ... উপরের হাদিসের অনুরূপ। এই বর্ণনার শেষে আছেঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমার জন্য এটা বেশি উপকারী। হাসান, ইবনু মাজাহ (৩৪৪২) মুহাম্মদ ইবনু বাশশার বলেন, এ হাদীসটি আইয়ুব ইবনু আবদুর রাহমান আমার নিকট বর্ণনা করেছেন। এ হাদীসটি উত্তম গারীব।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2038,
			"arabicnumber": 2038,
			"text": "২০৩৮। উসামা ইবনু শারীক (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, মফস্বলের লোকেরা বলল, হে আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)। আমরা কি (রোগীর) চিকিৎসা করব না? তিনি বললেন, হ্যাঁ, হে আল্লাহর বান্দাহগণ! তোমরা চিকিৎসা কর। আল্লাহ তা'আলা এমন কোন রোগ সৃষ্টি করেননি যার ঔষধ বা নিরাময়ের ব্যবস্থা রাখেননি (রোগও দিয়েছেন রোগ সারাবার ব্যবস্থাও করেছেন)। কিন্তু একটি রোগের কোন নিরাময় নেই। সাহাবীগণ বললেনঃ হে আল্লাহর রাসূল সে রোগটি কি? তিনি বললেনঃ বার্ধক্য। সহীহ, ইবনু মা-জাহ (৩৪৩৬)। আবু ঈসা বলেন। ইবনু মাসউদ, আবু হুরাইরা, আবু খুযামা তার পিতার সূত্রে ও ইবনু আব্বাস (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2039,
			"arabicnumber": 2039,
			"text": "২০৩৯। আইশা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের পরিবারের লোকদের জ্বর হলে তিনি দুধ ও ময়দা সহযোগে তরল পথ্য বানানোর নির্দেশ দিতেন। তা বানানো হলে তিনি পরিবারের লোকদের নির্দেশ দিতেন এটা হতে রোগীকে পান করাতে। তিনি বলতেনঃ এটা দুশ্চিন্তগ্রস্ত মনে শক্তি যোগায় এবং রোগীর মনের ক্লেশ ও দুঃখ দূর করে। যেমন তোমাদের কোন মহিলা পানি দ্বারা তার মুখমণ্ডলের ময়লা পরিষ্কার করে থাকে। যঈফ, ইবনু মাজাহ (৩৪৪৫) আবূ ঈসা বলেনঃ এ হাদীসটি হাসান সহীহ। এ হাদীসটি ইবনুল মুবারাক-ইউনুস হতে তিনি যুহরী হতে তিনি উরওয়া হতে তিনি আইশা (রাঃ) হতে তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2040,
			"arabicnumber": 2040,
			"text": "২০৪০। উকবা ইবনু আমির (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা তোমাদের রোগিদের জোরপূর্বক পানাহারে বাধ্য করো না। কেননা, প্রাচুর্যময় আল্লাহ তা'আলা তাদেরকে পানাহার করান। সহীহ, ইবনু মা-জাহ (৩৪৪৪)। আবূ ঈসা বলেন, এ হাদীসটি হাসান গারীব। আমরা এ হাদীসটি শুধুমাত্র উপরোক্ত সূত্রেই জেনেছি।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2041,
			"arabicnumber": 2041,
			"text": "২০৪১। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা এই কালো বীজ (কালোজিরা) নিজেদের জন্য ব্যবহারকে বাধ্যতামূলক করে নাও। কেননা, মৃত্যু ব্যতীত সকল রোগের নিরাময় এর মধ্যে রয়েছে। আস-সাম' অর্থ মৃত্যু। সহীহ, ইবনু মা-জাহ (৩৪৪৭), বুখারী, মুসলিম। আবূ ঈসা বলেন, বুরাইদা, ইবনু উমার ও আইশা (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2042,
			"arabicnumber": 2042,
			"text": "২০৪২। আনাস (রাঃ) হতে বর্ণিত আছে, উরাইনা বংশের কিছু লোক মদীনায় আসলে এ অঞ্চলের আবহাওয়া তাদের জন্যে অনুকূল হয়নি। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদেরকে সাদকার উটের নিকট পাঠিয়ে দেন এবং বলেনঃ তোমরা এর দুধ ও প্রস্রাব পান কর। সহীহ, বুখারী, মুসলিম। আবূ ঈসা বলেন, ইবনু আব্বাস (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2043,
			"arabicnumber": 2043,
			"text": "২০৪৩। আবূ হুরাইরা (রাঃ) মারফুভাবে বর্ণনা করেনঃ যে লোক লোহার অস্ত্র দ্বারা আত্মহত্যা করবে, সে ঐ লৌহঅস্ত্র হাতে নিয়ে কিয়ামত দিবসে হাযির হবে। সে নিজের পেটে এটা অবিরতভাবে বিদ্ধ করতে থাকবে এবং সে চিরকাল জাহান্নামে থাকবে। যে লোক বিষপান করে আত্মহত্যা করবে, সে ঐ বিষ হাতে নিয়ে কিয়ামত দিবসে হাযির হবে। সে চিরকাল জাহান্নামে থাকবে এবং সর্বদা এই বিষ গলাধঃকরণ করতে থাকবে। সহীহ, ইবনু মা-জাহ (৩৪৬০), বুখারী, মুসলিম।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2044,
			"arabicnumber": 2044,
			"text": "২০৪৪। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ লৌহ অস্ত্রের মাধ্যমে যে লোক আত্মহত্যা করবে, সে ঐ অস্ত্র হাতে নিয়ে কিয়ামত দিবসে হাযির হবে। জাহান্নামে সে এটা সর্বদাই তার পেটের মধ্যে বিদ্ধ করতে থাকবে এবং অনন্তকাল জাহান্নামে থাকবে। যে লোক বিষপানে আত্মহত্যা করবে, সে ঐ বিষ হাতে নিয়ে কিয়ামত দিবসে হাযির হবে জাহান্নামে। সে উহা সর্বদা পান করতে থাকবে এবং অনন্তকাল জাহান্নামে থাকবে। পাহাড়ের উপর থেকে ঝাপ দিয়ে যে লোক আত্মহত্যা করবে, সে সর্বদাই জাহান্নামের মধ্যে ঝাঁপ দিয়ে পড়তে থাকবে এবং চিরকাল জাহান্নামে থাকবে। সহীহ, দেখুন পূর্বের হাদীস। উপরোক্ত হাদীসের মতো বর্ণনা করেছেন মুহাম্মাদ ইবনুল আলা-ওয়াকী হতে, তিনি আবূ মুআবিয়া হতে, তিনি আমাশ হতে, তিনি আবূ সালিহ হতে, তিনি আবূ হুরাইরা (রাঃ) হতে, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে। আবূ ঈসা বলেন, এই হাদীসটি সহীহ। প্রথমোক্ত হাদীসের তুলনায় এটা অনেক বেশি সহীহ। এ হাদীসটি আরো অনেকে আমাশ হতে আবূ সালেহ এর বরাতে আবূ হুরাইরার সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেছেন। আবূ হুরাইরা (রাঃ) হতে একটি সূত্রে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ “বিষপানের মাধ্যমে যে লোক আত্মহত্যা করবে, তাকে জাহান্নামের আগুনে শাস্তি দেয়া হবে।” এ সূত্রে, “অনন্তকাল জাহান্নামে থাকবে” এ কথার উল্লেখ নেই। আবূয যিনাদ তার শিক্ষক আ'রাজের সূত্রে আবূ হুরাইরা (রাঃ)-এর বরাতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে একইরকম বর্ণনা করেছেন। সকল বর্ণনার মধ্যে এটাই অনেক বেশি সহীহ। কেননা, অসংখ্য হাদীসে বর্ণিত আছেঃ তৌহীদের উপর বিশ্বাসী অপরাধীরা জাহান্নামের আযাব ভোগ করবে। অবশেষে তারা জাহান্নাম হতে মুক্তি পাবে। কিন্তু তাতে এ কথার উল্লেখ নেই যে, তারা অনন্তকাল জাহান্নামে থাকবে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2045,
			"arabicnumber": 2045,
			"text": "২০৪৫। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, হারাম ঔষধ প্রয়োগ করতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিষেধ করেছেন। সহীহ, ইবনু মা-জাহ (৩৪৫৯)। আবূ ঈসা বলেন, হারাম ঔষধ। এর অর্থ বিষ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2046,
			"arabicnumber": 2046,
			"text": "২০৪৬। ওয়াইল (রাঃ) হতে বর্ণিত আছে, তিনি কোন একসময় রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সামনে উপস্থিত ছিলেন। এ সময় তাকে সুয়াইদ ইবনু তারিক অথবা তারিক ইবনু সুয়াইদ (রাঃ) মাদক দ্রব্য প্রসঙ্গে প্রশ্ন করেন। তিনি এটা ব্যবহার করতে তাকে নিষেধ করেন। তিনি (সুয়াইদ) বললেন, আমরা ঔষধ হিসাবে এটা ব্যবহার করব। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ এটা কোন ঔষধ নয়, বরং এটা স্বয়ং একটা রোগ। সহীহ, ইবনু মা-জাহ (৩৫০০), মুসলিম। মাহমূদ-নাযর ইবনু শুমাইল ও শাবাবা হতে শুবা (রাহঃ)-এর সূত্রে একইরকম বর্ণনা করেছেন। নাযর (রাহঃ) বলেছেন প্রশ্নকারী সাহাবীর নাম তারিক ইবনু সুয়াইদ এবং শাবাবা (রাহঃ) বলেছেন তার নাম সুয়াইদ ইবনু তারিক। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2047,
			"arabicnumber": 2047,
			"text": "২০৪৭। ইবনু আব্বাস (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে সব ঔষধ তোমরা ব্যবহার কর তার মধ্যে উত্তম ঔষধ হচ্ছে নস্য, মুখ দিয়ে সেবন করার ঔষধ, রক্তমোক্ষণ ও জোলাপ (বিরেচক ঔষধ)। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অসুস্থ হলে সাহাবীগণ তাকে মুখ দিয়ে ঔষধ সেবন করান। তারা অবসর হলে তিনি বলেনঃ এদের সবাইকে লাদু (মুখ দিয়ে সেব্য ঔষধ) সেবন করাও। রাবী বলেন, আব্বাস (রাঃ) ব্যতীত সবাইকে লাদু সেবন করানো হয়। যঈফ, মিশকাত, তাহকীক ছানী (৪৪৭৩)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2048,
			"arabicnumber": 2048,
			"text": "২০৪৮। ইবনু আব্বাস (রাঃ) হতে বর্ণিত আছে, তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা যেসব ঔষধ ব্যবহার কর তার মধ্যে উত্তম ঔষধ হচ্ছে, লাদুদ, নস্য, রক্তমোক্ষণ ও জোলাপ। তোমরা যে সুরমা ব্যবহার কর তার মধ্যে উত্তম হচ্ছে ইসমিদ নামক সুরমা। কেননা এটা চোখের জ্যোতি বৃদ্ধি করে এবং চোখের পাতার পশম গজায়। রাবী বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের একটি সুরমাদানী ছিল। তিনি ঘুমানোর পূর্বে তা থেকে উভয় চোখে তিনবার করে সুরমা লাগাতেন। যঈফ, “ইসমিদ সুরমা লাগানো\" অংশটুকু সহীহ। ইবনু মাজাহ (৩৪৯৫, ৩৪৯৭, ৩৪৯৯) আবূ ঈসা বলেন, এ হাদীসটি হাসান গারীব। এটি আব্বাস ইবনু মানসূর (রহঃ) বর্ণিত হাদীস।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2049,
			"arabicnumber": 2049,
			"text": "২০৪৯। ইমরান ইবনু হুসাইন (রাঃ) হতে বর্ণিত আছে, উত্তপ্ত লোহার মাধ্যমে শরীরে দাগ দিতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিষেধ করেছেন। বর্ণনাকারী বলেন, আমরা যখন রোগাক্রান্ত হয়ে উত্তপ্ত লোহা দ্বারা দাগ লাগিয়েছি তখন ব্যর্থতা ও বিফলতা ব্যতীত আর কিছুই পাইনি। সহীহ, ইবনু মা-জাহ (৩৪৯০)। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। ইমরান ইবনু হুসাইন (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমাদেরকে শরীরে উত্তপ্ত লোহার মাধ্যমে দাগ লাগাতে বারণ করা হয়েছে। আবূ ঈসা বলেন, ইবনু মাসউদ, উকবা ইবনু আমির ও ইবনু আব্বাস (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2050,
			"arabicnumber": 2050,
			"text": "২০৫০। আনাস (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সা’দ ইবনু যুরারাকে কাটা বিদ্ধ হওয়ার কারনে উত্তপ্ত লোহার মাধ্যমে দগ্ধ করেছিলেন। সহীহ, মিশকাত তাহকীক ছানী (৩৫৩৪)। আবূ ঈসা বলেন, উবাই ও জাবির (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। এ হাদীসটি হাসান গারীব।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2051,
			"arabicnumber": 2051,
			"text": "২০৫১। আনাস (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঘাড়ের দুই পাশের শিরায় এবং ঘাড়ের কাছাকাছি পিঠের ফুলা অংশে রক্তক্ষরণ করাতেন। তিনি মাসের সতের, উনিশ ও একুশ তারিখে রক্তক্ষরণ করাতেন। সহীহ, ইবনু মা-জাহ (৩৪৮৩)। আবূ ঈসা বলেন, ইবনু আব্বাস ও মাকিল ইবনু ইয়াসার (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। এ হাদীসটি হাসান গারীব।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2052,
			"arabicnumber": 2052,
			"text": "২০৫২। ইবনু মাসউদ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, মিরাজের রাত প্রসঙ্গে রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন যে, এই রাতে ফিরিশতাদের যে দলের সম্মুখ দিয়েই তিনি যাচ্ছিলেন তারা বলেছেন, “আপনার উম্মাতকে রক্তক্ষরণের নির্দেশ দিন”। সহীহ, ইবনু মা-জাহ (৩৪৭৭)। আবূ ঈসা বলেন, এ হাদীসটি হাসান ও ইবনু মাসউদ (রাঃ)-এর রিওয়ায়াত হিসাবে গারীব।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2053,
			"arabicnumber": 2053,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2054,
			"arabicnumber": 2054,
			"text": "২০৫৪। আলী ইবনু উবাইদুল্লাহ (রহঃ) হতে তার দাদীর সূত্রে বর্ণিত আছে, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের খাদিমা (সেবিকা) ছিলেন। তিনি বলেন, যখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের দেহে কোন তলোয়ার বা দা-এর আঘাতে ক্ষত হতো, তিনি তাতে মেহেদী লাগানোর জন্য আমাকে নির্দেশ দিতেন। সহীহ, ইবনু মা-জাহ (৩৫০)। আবূ ঈসা বলেন, এ হাদীসটি হাসান গারীব। আমরা এ হাদীস প্রসঙ্গে শুধুমাত্র ফাইদের সূত্রে জেনেছি। এই হাদীসটি কেউ কেউ ফাইদের সূত্রে বর্ণনা করেছেন এবং বলেছেন, উবাইদুল্লাহ ইবনু আলী-তার দাদী সালমা হতে বর্ণিত। সনদসূত্রে উবাইদুল্লাহ ইবনু আলী উল্লেখ করাই সহীহ। উপরোক্ত হাদীসের অনুরূপ বর্ণিত হয়েছে মুহাম্মাদ ইবনুল আলা হতে, তিনি যাইদ ইবনুল হুবাব হতে, তিনি উবাইদুল্লাহ ইবনি আলীর মুক্তদাস ফাইদ হতে, তিনি তার দাদী হতে, তিনি রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সূত্রে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2055,
			"arabicnumber": 2055,
			"text": "২০৫৫। আক্কার ইবনুল মুগীরা (রহঃ) হতে তার বাবার সূত্রে বর্ণিত আছে, তিনি (মুগীরা) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে লোক (শরীরে) দাগ নেয় অথবা ঝাড়ফুক করায় সে তাওয়াক্কুল (আল্লাহ তা'আলার উপর নির্ভরশীলতা) হতে বিচ্যুত হয়েছে। সহীহ, ইবনু মা-জাহ (৩৪৮৯)। আবূ ঈসা বলেন, ইবনু মাসউদ, ইবনু আব্বাস ও ইমরান ইবনু হুসাইন (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2056,
			"arabicnumber": 2056,
			"text": "২০৫৬। আনাস (রাঃ) হতে বর্ণিত আছে, জ্বর, বদ-নজর ও ব্ৰণ-ফুসকুড়ি (ক্ষুদ্র ফোড়া) ইত্যাদি ক্ষেত্রে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঝাড়ফুঁক দেয়ার সম্মতি প্রদান করেছেন। সহীহ, মুসলিম। আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত আছে, জ্বর ও ফুসকুড়ির ক্ষেত্রে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঝাড়ফুক দেয়ার সম্মতি প্রদান করেছেন। সহীহ, মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান গারীব। তিনি আরও বলেন, আমার মতে পূর্ববর্তী হাদীসের তুলনায় এ হাদীসটি অনেক বেশি সহীহ। বুরাইদা, ইমরান ইবনু হুসাইন, জাবির, আইশা, তালক ইবনু আলী, আমর ইবনু হাযম ও আবূ খিযামা (রাঃ) হতে তার বাবার সূত্রে এ অনুচ্ছেদে হাদীস বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2057,
			"arabicnumber": 2057,
			"text": "২০৫৭। ইমরান ইবনু হুসাইন (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ বদ-নজর ও জ্বর ব্যতীত আর অন্য কোন ক্ষেত্রে ঝাড়ফুঁক বৈধ নয়। সহীহ, মিশকাত (৪৫৫৭), বুখারী মাওকুফরুপে বর্ণনা করেছেন। আবূ ঈসা বলেন, এ হাদীসটি হুসাইন-শাবী হতে, তিনি বুরাইদা (রাঃ) হতে, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে একই রকম বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2058,
			"arabicnumber": 2058,
			"text": "২০৫৮। আবূ সাঈদ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জিন এবং মানুষের কু-দৃষ্টি হতে আশ্রয় চাইতেন। তারপর সূরা ফালাক ও সূরা নাস নাযিল হলে তিনি এ সূরা দুটি গ্রহণ করেন এবং বাকীগুলো পরিত্যাগ করেন। সহীহ, ইবনু মা-জাহ (৩৫১১)। আবূ ঈসা বলেন, আনাস (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। এ হাদীসটি হাসান গারীব।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2059,
			"arabicnumber": 2059,
			"text": "২০৫৯। উবাইদ ইবনু রিফাআ আয-যুরাকী (রাহঃ) হতে বর্ণিত আছে, আসমা বিনতু উমাইস (রাঃ) বলেন, হে আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)। জাফরের সন্তানদের তাড়াতাড়ি বদ-নজর লেগে যায়। আমি কি তাদেরকে ঝাড়ফুক করতে পারি? তিনি বললেনঃ হ্যাঁ। কেননা, কোন জিনিস যদি ভাগ্যকে অতিক্রম করতে পারত তাহলে বদ-নজরই তা অতিক্রম করতে পারত। সহীহ, ইবনু মা-জাহ (৩৫১০)। আবূ ঈসা বলেন, ইমরান ইবনু হুসাইন ও বুরাইদা (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। এ হাদীসটি হাসান সহীহ। এ হাদীসটি আইয়ূব-আমর ইবনু দীনার হতে, তিনি উরওয়া ইবনু আমির হতে, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এই সূত্রে বর্ণিত হয়েছে। আমাদের কাছে এই হাদীসটি হাসান ইবনু আলী আল-খাল্লাল (রাহঃ)-আবদুর রাযযাক হতে, তিনি মামার হতে, তিনি আইয়ুব (রহঃ)-এর সূত্রে বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2060,
			"arabicnumber": 2060,
			"text": "২০৬০। ইবনু আব্বাস (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, হাসান ও হুসাইন (রাঃ)-এর জন্য রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এই দু’আ পাঠ করে আশ্রয় প্রার্থনা করতেনঃ “আমি তোমাদের উভয়ের উদ্দেশ্যে আল্লাহ্ তা'আলার পরিপূর্ণ কল্যাণময় কালামের মাধ্যমে প্রতিটি শাইতান, জীবননাশক বিষ ও অনিষ্টকারী কু-দৃষ্টি হতে আশ্রয় প্রার্থনা করছি\"। তিনি বলতেনঃ এভাবে ইবরাহীম (আঃ) তার দুই ছেলে ইসহাক ও ইসমাঈলের জন্য আশ্রয় চাইতেন। সহীহ, ইবনু মা-জাহ (৩৫২৫), বুখারী। উক্ত মর্মে একইরকম হাদীস হাসান ইবনু আলী আল-খাল্লাল-ইয়াযীদ ইবনু হারুন ও আবদুর রাযযাক হতে, তিনি সুফিয়ান হতে, তিনি মানসূর (রহঃ) হতে এই সূত্রে বর্ণনা করেছেন। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2061,
			"arabicnumber": 2061,
			"text": "২০৬১। হাইয়্যা ইবনু হাবিস আত-তামীমী (রহঃ) হতে তার পিতার সূত্রে বর্ণিত আছে, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে বলতে শুনেছেনঃ হাম্ম বলতে কিছু নেই এবং বদনজ্বর সত্য। যঈফ, যঈফা (৪৮০৪)। \"আল-আইনু হারুন\" অংশটুকু সহীহ। সহীহা (১২৪৮) আবূ ঈসা বলেনঃ এ হাদীসটি গারীব।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2062,
			"arabicnumber": 2062,
			"text": "২০৬২। ইবনু আব্বাস (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ভাগ্যকে কোন জিনিস অতিক্রম করতে সমর্থ হলে কু-দৃষ্টিই তা অতিক্রম করতে পারত। যদি এ প্রসঙ্গে কেউ তোমাদেরকে গোসল করাতে চায় তাহলে তোমরা তাতে সম্মত হও। সহীহ, সহীহাহ (১২৫১-১২৫২), আল-কালিমুত তাইয়্যিব (২৪২), মুসলিম। আবূ ঈসা বলেন, আবদুল্লাহ ইবনু আমর (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। এ হাদীসটি হাসান সহীহ গারীব। হাইয়্যাহ ইবনু হাবিস হতে বর্ণিত হাদীসটি গারীব। শাইবান ইয়াহইয়া ইবনু কাদীর হতে, তিনিই হাইয়্যাহ ইবনু হাবিস হতে, তিনি তার পিতা হতে, তিনি আবূ হুরাইরা হতে তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেছেন। আলী ইবনুল মুবারক এবং হারব ইবনু শাদ্দাদ আবূ হুরাইরা (রাঃ)-এর উল্লেখ করেন নাই।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2063,
			"arabicnumber": 2063,
			"text": "২০৬৩। আবূ সাঈদ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমাদেরকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একটি সামরিক অভিযানে প্রেরণ করেন। আমরা একটি জনপদে আসার পর তাদের কাছে মেহমানদারী প্রার্থনা করলাম। কিন্তু তারা আমাদেরকে আপ্যায়ন করাল না। এরকম পরিস্থিতিতে তাদের বংশের প্রধানকে বিছু দংশন করে। তারা আমাদের নিকট এসে বলে, তোমাদের মধ্যে এমন কেউ আছে কি য়ে বিছু দংশনকারীকে ঝাড়ফুঁক করতে পারে? আমি বললাম, হ্যাঁ আমি নিজেই। কিন্তু তোমরা যদি আমাদেরকে এক পাল বকরী প্রদান না কর তাহলে আমি ঝাড়ফুঁক করতে সম্মত নই। তারা বলল, আমরা তোমাদেরকে ত্রিশটি বকরী প্রদান করব। আমরা এ প্রস্তাবে রাজি হলাম। আমি সাতবার সূরা ফাতিহা পাঠ করে তাকে ঝাড়ফুক করলাম। ফলে সে রোগমুক্ত হলো এবং আমরা বকরীগুলো হস্তগত করলাম। বর্ণনাকারী বলেন, এই বিষয়ে আমাদের মনে সন্দেহের উদ্রেক হলো। আমরা বললাম, তোমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সামনে হাযির হওয়ার আগ পর্যন্ত (সিদ্ধান্তে পৌছতে) তাড়াহুড়া করবে না। বর্ণনাকারী বলেন, আমরা তার নিকট উপস্থিত হওয়ার পর আমি যা করেছি তা তাকে অবহিত করলাম। তিনি বললেনঃ কিভাবে তুমি জানতে পারলে, এটা দিয়ে ঝাড়ফুক করা যায়? বকরীগুলো হস্তগত কর এবং তোমাদের সাথে আমার জন্যও একটি অংশ রেখ। সহীহ, ইবনু মা-জাহ (২১৫৬), বুখারী, মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান। আবূ নাযরার নাম আল-মুনযির ইবনু মালিক ইবনু কুতাআ। ইমাম শাফিঈ (রাহঃ) এ হাদীসের ভিত্তিতে বলেন, কুরআন শিক্ষা দানের ফলে বিনিময় গ্রহণ বৈধ। উস্তাদ এই বিষয়ে চুক্তিও করতে পারবেন। জাফর ইবনু ইয়াস হলেন জাফর ইবনু আবী ওয়াহসিইয়া আর তিনি আবূ বিশর। এ হাদীসটি শুবা, আবূ আওয়ানা, হিশাম, আরও অনেকে আবূ বিশর হতে, তিনি আবূল মুতাওয়াক্কিল হতে, তিনি আবূ সাঈদ (রাঃ) হতে, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এই সূত্রে বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2064,
			"arabicnumber": 2064,
			"text": "২০৬৪। আবূ সাঈদ (রাঃ) হতে বর্ণিত আছে, কোন এক আরব গোত্রের অঞ্চল দিয়ে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের একদল সাহাবী পথ চলছিলেন। তারা তাদেরকে অতিথিসেবা করল না। ঘটনাক্রমে তাদের বংশের প্রধান ব্যক্তিটি অসুস্থ হয়ে যায়। তারা আমাদের নিকট এসে বলে, তোমাদের নিকট কি কোন ঔষধ আছে? আমরা বললাম, হ্যাঁ আছে কিন্তু তোমরা আমাদের মেহমানদারী করনি। অতএব, যে পর্যন্ত তোমরা আমাদের জন্য পারিশ্রমিক ঠিক না করবে আমরা চিকিৎসা করব না। আমাদেরকে একপাল ছাগল প্রদান করতে তারা রাজি হলো। আমাদের মধ্যেকার একজন সূরা ফাতিহা দ্বারা তাকে ঝাড়ফুক করল। ফলে সে রোগমুক্ত হয়ে গেল। আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট এসে বিষয়টি তাকে খুলে বললাম। তিনি বললেনঃ তুমি কিভাবে জানতে পারলে যে, এর মাধ্যমে ঝাড়ফুক করা যায়? বর্ণনাকারী এ বিষয়ে তার পক্ষ হতে কোন নিষেধাজ্ঞা উল্লেখ করেননি। তিনি বললেনঃ এগুলো তোমরা ভোগ কর এবং তোমাদের সাথে আমার জন্যও একটা ভাগ রাখ। সহীহ, দেখুন পূর্বের হাদীস। আবূ ঈসা বলেন, এ হাদীসটি সহীহ। এটা পূর্ববর্তী জাফর ইবনু ইয়াস হতে আমাশের রিওয়ায়াতের তুলনায় অনেক বেশি সহীহ। একাধিক বর্ণনাকারী আবূ বিশর হতে, তিনি আবূল মুতাওয়াক্কিল হতে, তিনি আবূ সাঈদ (রাঃ) হতে এই সূত্রে হাদীসটি বর্ণনা করেছেন। জাফর ইবনু ইয়াস হলেন জাফর ইবনু আবূ ওয়াহুশিইয়্যা।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2065,
			"arabicnumber": 2065,
			"text": "২০৬৫। আবূ খিযামা (রহঃ) হতে তার পিতার সূত্রে বর্ণিত আছে, তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে প্রশ্ন করলাম, হে আল্লাহর রাসূল! আমরা যে ঝাড়ফুঁক করি, ঔষধ ব্যবহার করি এবং বিভিন্ন রকম সাবধানতা অবলম্বন করে থাকি, এগুলো কি আল্লাহ তা'আলার নির্ধারিত ভাগ্যকে বাতিল করতে পারে? এ ব্যাপারে আপনার কি মত? তিনি বললেনঃ এগুলোও আল্লাহ্ তা'আলার নির্ধারিত ভাগ্যের অন্তর্ভুক্ত। যঈফ, ইবনু মাজাহ (৩৪৩৭) আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2066,
			"arabicnumber": 2066,
			"text": "২০৬৬। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আজওয়া হচ্ছে জান্নাতের খেজুরবিশেষ এবং এর মধ্যে বিষের প্রতিষেধক রয়েছে। ছত্রাক হলো মান নামক আসমানী খাবারের অন্তর্ভুক্ত এবং এর পানি চক্ষুরোগের প্রতিষেধক। হাসান সহীহ, মিশকাত, তাহকীক ছানী (৪২৩৫)। আবূ ঈসা বলেন, সাঈদ ইবনু যাইদ, আবূ সাঈদ ও জাবির (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। এ হাদীসটি হাসান গারীব।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2067,
			"arabicnumber": 2067,
			"text": "২০৬৭। সাঈদ ইবনু যাইদ (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ছত্রাক’ মান্নের অন্তর্ভুক্ত। এর পানি চোখের জন্য নিরাময়। সহীহ, রাওযুন নায়ীর (৪৪৪), বুখারী, মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2068,
			"arabicnumber": 2068,
			"text": "২০৬৮। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের কিছু সাহাবী বলেন, ছত্রাক হলো যমীনের বসন্ত রোগ। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ ছত্রাক হলো মান্নের অন্তর্ভুক্ত এবং এর পানি চক্ষুরোগের প্রতিষেধক। আজওয়া হলো বেহেশতের খেজুরের অন্তর্ভুক্ত এবং এটা বিষের প্রতিষেধক। পূর্বের হাদীসের সহায়তায় সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2069,
			"arabicnumber": 2069,
			"text": "২০৬৯। কাতাদাহ (রহঃ) হতে বর্ণিত, তিনি বলেনঃ আবূ হুরাইরাহ (রাঃ) হতে বর্ণিত আছে, তিনি বলেনঃ আমি তিনটি অথবা ৫টি অথবা ৭টি ছত্রাক নিয়ে এর রস বের করলাম, তারপর রস টুকু বোতলে রেখে দিলাম, তারপর উহাদ্বারা আমার এক দাসীর চোখে সুরমা লাগালে তার চোখ ভাল হয়ে গেল। সনদ দুর্বল, মাওকুফ",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2070,
			"arabicnumber": 2070,
			"text": "২০৭০। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেনঃ কালো জিরা মৃত্যু ব্যতীত সকল রোগের ঔষধ। সনদ দুর্বল কাতাদা (রাহঃ) বলেনঃ প্রত্যেক দিন (কালো জিরার) ২১টি দানা নিবে। ঐগুলি একটি ন্যাকড়ায় নিয়ে তাহা ভিজিয়ে রাখবে। তারপর প্রত্যেকদিন নাকের ডান ছিদ্রে দুই ফুটা বাম ছিদ্রে এক ফুটা পানি দিবে। আবার ২য় দিন বামছিদ্রে দুই ফুটা এবং ডানছিদ্রে এক ফুটা পানি দিবে, ৩য় দিন ডান ছিদ্রে ২ ফুটা এবং বাম ছিদ্রে ১ ফুটা দিবে। সনদ দুর্বল, মাওকুফ। \"ইয়া খুজু\" এই শব্দ বাদে সহীহ মারফু হাদীস রয়েছে। সহীহ (১৯০৫)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2071,
			"arabicnumber": 2071,
			"text": "২০৭১। আবূ মাসউদ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, কুকুরের বিক্রয় মূল্য, বেশ্যার পারিশ্রমিক এবং গণকের উপঢৌকনকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিষিদ্ধ করেছেন। সহীহ, ইবনু মা-জাহ (২১৫৯)। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2072,
			"arabicnumber": 2072,
			"text": "২০৭২। ঈসা ইবনু আবদুর রাহমান ইবনু আবূ লাইলা (রহঃ) হতে বর্ণিত আছে, তিনি বলেন, আমি আবদুল্লাহ ইবনু উকাইম আবূ মা’বাদ আল-জুহানীর অসুস্থ অবস্থায় তাকে দেখতে গেলাম। তিনি বিষাক্ত ফোঁড়ায় আক্রান্ত ছিলেন। আমি বললাম, কিছু তাবিজ-তুমার ঝুলিয়ে রাখছেন না কেন? তিনি বললেন, মৃত্যু তো এর চেয়েও নিকটে। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে লোক কোনকিছু ঝুলিয়ে রাখে (তাবিজ-তুমার) তাকে তার উপরই সোপর্দ করা হয়। সহীহ, গাইয়াতুল মারাম (২৯৭)। আবূ ঈসা বলেন আমরা আব্দুল্লাহ ইবনু উকাইমের হাদিসটি শুধুমাত্র মুহাম্মাদ ইবনু আব্দুর রহমান-এর সূত্রেই জেনেছি। আবদুল্লাহ ইবনু উকাইম রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের আমল পেলেও তার কাছ থেকে হাদীস শ্রবণ করতে পারেননি। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের কাছে চিঠি লিখেন। মুহাম্মাদ ইবনু বাশশার-ইয়াহইয়া ইবনু সাঈদ হতে, তিনি ইবনু আবূ লাইলা (রহঃ)-এর সূত্রে উক্ত মর্মে একইরকম হাদীস বর্ণনা করেছেন। আবূ ঈসা বলেনঃ উকবা ইবনু আমির (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2073,
			"arabicnumber": 2073,
			"text": "২০৭৩। রাফি ইবনু খাদীজ (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ জর হচ্ছে জাহান্নামের একটি উত্তাপ। তোমরা পানি ঢেলে তা ঠাণ্ডা কর। সহীহ, ইবনু মা-জাহ (৩৪৭৩), বুখারী, মুসলিম। আবূ ঈসা বলেন, আসমা বিনতু আবী বাকর, ইবনু উমার, ইবনু আব্বাস, যুবাইরের স্ত্রী ও আইশা (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2074,
			"arabicnumber": 2074,
			"text": "২০৭৪। আইশা (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ জুর হলো জাহান্নামের উত্তাপের অংশবিশেষ। তোমরা পানি ঢেলে এটাকে ঠাণ্ডা কর। সহীহ, বুখারী, মুসলিম। হারুন ইবনু ইসহাক-আবদাহ হতে, তিনি হিশাম ইবনু উরওয়া হতে, তিনি ফাতিমা বিনতুল মুনযির হতে, তিনি আসমা বিনতু আবী বাকর (রাঃ) হতে তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে একইরকম হাদীস বর্ণনা করেছেন। আবূ ঈসা বলেন, এ সূত্রটিও সহীহ। আসমার হাদীসের আরও বক্তব্য আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2075,
			"arabicnumber": 2075,
			"text": "২০৭৫। ইবনু আব্বাস (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদেরকে জ্বর ও অন্যান্য সকল প্রকার ব্যথায় এই দুআ পাঠের তালিম দিতেনঃ মহান \"আল্লাহ্ তা'আলার নামে, আমি মহান আল্লাহ তা'আলার নিকটে আশ্রয় প্রার্থনা করি রক্তচাপের আক্রমণ হতে এবং জাহান্নামের উত্তপ্ত আগুনের ক্ষতি হতে। যঈফ, মিশকাত (১৫৫৪) আবূ ঈসা বলেন, এ হাদীসটি গারীব। শুধুমাত্র ইবরাহীম ইবনু ইসমাঈল ইবনু আবূ হাবীবার সূত্রেই আমরা এ হাদীস জেনেছি। ইবরাহীম ইবনু ইসমাঈলকে হাদীস শাস্ত্রে দুর্বল বলা হয়েছে। অপর এক বর্ণনায় আছে “ইরকিন ইয়াআর\" (যে শিরা ফরকায় বা লাফায়)।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2076,
			"arabicnumber": 2076,
			"text": "২০৭৬। আইশা (রাঃ) হতে জুদামা বিনতু ওয়াহব (রাঃ)-এর সূত্রে বর্ণিত আছে, তিনি (জুদামা) বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে বলতে শুনেছিঃ আমি দুগ্ধদায়িনী স্ত্রীর সাথে সহবাস করাকে নিষিদ্ধ করতে ইচ্ছা করলাম। কিন্তু আমি অবহিত হলাম যে, পারস্য ও রোমের (এশিয়া মাইনর) জনগণ এটা করে থাকে (দুগ্ধপোষ্য শিশু থাকাকালীন সময়ে স্ত্রী সহবাস করে)। অথচ তাদের সন্তানদের তারা হত্যা করে না (উল্লেখিত সময়ে সহবাসের কারণে শিশুর কোন ক্ষতি হয় না)। সহীহ, ইবনু মা-জাহ (২০১১), মুসলিম। আবূ ঈসা বলেন, আসাম বিনতু ইয়াযীদ (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। এ হাদীসটি সহীহ। মালিক-আবূল আসওয়াদ হতে, তিনি উরওয়া হতে, তিনি আইশা হতে, তিনি জুদামা বিনতু ওয়াহব (রাঃ) হতে, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে একইরকম বর্ণনা করেছেন। ইমাম মালিক (রাহঃ) বলেন, ‘গীলা অর্থ দুগ্ধপোষ্য শিশুর মায়ের সাথে সহবাস করা।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2077,
			"arabicnumber": 2077,
			"text": "২০৭৭। জুদামা বিনতু ওয়াহব আল-আসাদীয়্যাহ (রাঃ) হতে বর্ণিত আছে, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে বলতে শুনেছেনঃ আমি সন্তানের দুধ পানের সময়সীমার মধ্যে স্ত্রীসহবাস করাকে নিষিদ্ধ করতে চাইলাম। অবশেষে আমি জানলাম যে, পারস্য ও রোমের জনগণ (এ সময়) স্ত্রীসহবাস করে থাকে। এর ফলে তাদের সন্তানদের কোন ক্ষতি হয় না। সহীহ, দেখুন পূর্বের হাদীস। ঈসা ইবনু আহমাদ (রাহঃ) ইসহাক ইবনু ঈসা হতে, তিনি মালিক হতে, তিনি আবূল আসওয়াদ হতে একইরকম বর্ণনা করেছেন। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ গারীব।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2078,
			"arabicnumber": 2078,
			"text": "২০৭৮। যাইদ ইবনু আরকাম (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফুসফুসের প্রদাহে যাইতুন ও ওয়ারসের (ওষধি বিশেষ) প্রশংসা করতেন। কাতাদা (রাহঃ) বলেন, দেহের যে দিক আক্রান্ত, এ ঔষধ চামচ দিয়ে মুখের সেদিক দিয়ে ঢালতে হবে। যঈফ, ইবনু মাজাহ (৩৪৬৭) আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। আবূ আবদুল্লাহর নাম মাইমূন, তিনি বসরার মুহাদ্দিস।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 2079,
			"arabicnumber": 2079,
			"text": "২০৭৯। যাইদ ইবনু আরকাম (রাঃ) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদেরকে কুসতে বাহরী (চন্দন কাঠ) ও যাইতুনের তৈল দিয়ে নিউমোনিয়ার চিকিৎসা করার নির্দেশ (পরামর্শ) দিয়েছেন। দুর্বল, দেখুন পূর্বের হাদীস আবূ ঈসা বলেন, এ হাদীসটি হাসান গারীব সহীহ। মাইমূন হতে যাইদ ইবনু আরকাম (রাঃ) সূত্রেই শুধুমাত্র আমরা এ হাদীস প্রসঙ্গে জেনেছি। মাইমূন হতে একাধিক রাবী এ হাদীস বর্ণনা করেছেন। \"যাতুল জানব” অর্থ “আস-সিল্লু\" (ফুসফুসের প্রদাহ, যদরুন রোগী দুর্বল হয়ে যায়।)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 2080,
			"arabicnumber": 2080,
			"text": "২০৮০। উসমান ইবনু আবূল আস (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার নিকট এলেন। আমি তখন ধ্বংসাত্মক ব্যথার কারণে অস্থির ছিলাম। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ ব্যথার জায়গাতে তোমার-ডানহাত দিয়ে সাতবার মর্দন কর এবং বল, “আমি আল্লাহ তা'আলার ইজ্জাত ও সম্মান, তার কুদরাত ও শক্তি এবং তার রাজত্ব, সার্বভৌমত্ব ও কর্তৃত্বের নিকট আমার এই কষ্ট হতে মুক্তি প্রার্থনা করছি\"। বর্ণনাকারী বলেন, আমি তা-ই করলাম। আমার সম্পূর্ণ ব্যথাই আল্লাহ তা'আলা সারিয়ে দিলেন। আমি এরপর হতেই আমার পরিবারের লোকদেরকে এবং অন্যান্যদেরকে এরূপ করার জন্য নির্দেশ দিয়ে আসছি। সহীহ, ইবনু মা-জাহ (৩৫২২), মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 2081,
			"arabicnumber": 2081,
			"text": "২০৮১। আসমা বিনতু উমাইস (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে প্রশ্ন করেনঃ তোমরা কি দিয়ে জোলাপ দাও? তিনি বললেন, শুবরুম (ছোলার মত এক প্রকার দানা) দিয়ে। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ এটা তো খুব গরম ঔষধ। আসমা (রাঃ) বলেন, অতঃপর আমি সোনামুখী গাছের পাতা দিয়ে জোলাপ দেই। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ মৃত্যু' নামক রোগের নিরাময় যদি কোন জিনিস দিয়ে সম্ভব হত তবে সোনামুখী গাছ দিয়েই তা সম্ভব হত। যঈফ, মিশকাত (৪৫৩৭) আবূ ঈসা বলেন, এ হাদীসটি হাসান গারীব।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 2082,
			"arabicnumber": 2082,
			"text": "২০৮২। আবূ সাঈদ (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট একজন লোক এসে বলল, আমার ভাইয়ের পাতলা পায়খানা (উদরাময়) হচ্ছে। তিনি বললেনঃ তাকে মধু পান করাও। সে তাকে মধু পান করায়, তারপর এসে বলে, হে আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)। আমি তাকে মধু পান করিয়েছি। কিন্তু তাতে দাস্ত আরো বৃদ্ধি পেয়েছে। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তাকে মধু পান করাও। বর্ণনাকারী বলেন, সে তাকে মধু পান করানোর পর এসে বলে, হে আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)। আমি তাকে তা পান করিয়েছি। কিন্তু এর ফলে তার দাস্ত আরো বৃদ্ধি পেয়েছে। বর্ণনাকারী বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আল্লাহ তা'আলা সত্য বলেছেন (মধুতে নিরাময় আছে), কিন্তু তোমার ভাইয়ের পেটই মিথ্যা বলছে। আবার তাকে মধু পান করাও। অতএব, লোকটি তাকে মধু পান করায় এবং সে সুস্থ হয়ে উঠে। সহীহ, বুখারী, মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 2083,
			"arabicnumber": 2083,
			"text": "২০৮৩৷ ইবনু আব্বাস (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন লোক যদি কোন রোগীকে দেখতে যায় যার মৃত্যুক্ষণ আসেনি, সে তাকে সাতবার এই দুআ করলেঃ “আমি মহান আরশের রব (প্রভু) মহামহিম আল্লাহ্ তা'আলার নিকট দুআ প্রার্থনা করছি, তিনি তোমাকে রোগ হতে সুস্থতা দান করুন\", তাকে রোগমুক্ত করা হবে। সহীহ, মিশকাত (১৫৫৩), আল কালিমুত তাইয়্যিব (১৪৯)। আবূ ঈসা বলেন, এ হাদীসটি হাসান গারীব। আমরা এ হাদীসটি শুধুমাত্র আবূল মিনহালের সূত্রে জেনেছি।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 2084,
			"arabicnumber": 2084,
			"text": "২০৮৪। সাওবান (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ জ্বর হল জাহান্নামের একটি টুকরা। তোমাদের কারো জ্বর হলে সে যেন তা পানি ঢেলে নিভায়। (এর নিয়ম হচ্ছে) ফজরের নামাযের পর সূর্যোদয়ের পূর্বে প্রবাহমান ঝর্ণায় নেমে স্রোত প্রবাহের দিকে মুখ করে সে বলবে, “আল্লাহ তা'আলার নামে, হে আল্লাহ! তোমার বান্দাকে রোগমুক্ত করে দাও এবং তোমার রাসূলকে সত্যবাদী প্রমাণ কর\"। তারপর ঝর্ণার পানিতে তিনবার ডুব দিবে। তিন দিন এরূপ করবে। তিন দিনেও যদি জ্বর না ছাড়ে তবে পাঁচ দিন এরকম করবে। পাঁচ দিনেও ভাল না হলে সাত দিন এরকম করবে। সাত দিনেও ভাল না হলে নয় দিন করবে। আল্লাহ্ তা'আলার হুকুমে জ্বর নয় দিনের বেশী অতিক্রম করতে পারবে না। যঈফ, যঈফা (২৩৩৯) আবূ ঈসা বলেন, এ হাদীসটি গরীব।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 2085,
			"arabicnumber": 2085,
			"text": "২০৮৫। আবূ হাযিম (রহঃ) হতে বর্ণিত আছে, তিনি বলেন, সাহল ইবনু সা'দ (রাঃ)-কে প্রশ্ন করা হলো এবং আমিও তা শুনলাম, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের জখমের মধ্যে কোন দ্রব্য প্রয়োগ করা হয়েছিল? তিনি বললেন, এ বিষয়ে আমার চেয়ে অধিক ভাল আর কোন ব্যক্তি জানে না। আলী (রাঃ) তার ঢালে করে পানি নিয়ে আসছিলেন এবং ফাতিমা (রাঃ) তার জখমের রক্ত ধুয়ে দিচ্ছিলেন। একটি মাদুর পুড়িয়ে তার ছাই তাঁর ক্ষত স্থানের ভিতরে ঢুকিয়ে দেয়া হয়। সহীহ, বুখারী, মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 2086,
			"arabicnumber": 2086,
			"text": "২০৮৬। আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত, তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ অসুস্থ ব্যক্তি যখন সুস্থ হয়ে ভাল হয়ে যায় তার উদাহরণ হল আকাশ হতে পতিত স্বচ্ছ পরিষ্কার শিশিরের মত। মাওযু",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 2087,
			"arabicnumber": 2087,
			"text": "২০৮৭। আবূ সাঈদ আল-খুদরী (রাঃ) হতে বর্ণিত আছে, তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা কোন অসুস্থ ব্যক্তিকে দেখতে গেলে তাকে বেঁচে থাকারই আশান্বিত করবে। তা যদিও কোন কিছুকে (তাকদীরকে) রোধ করতে পারবে না তবুও তার মনটা এতে প্রফুল্ল হবে, শান্তি পাবে। খুবই দুর্বল। যঈফা (১৮৪) আবূ ঈসা বলেনঃ এ হাদীসটি গারীব।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 2088,
			"arabicnumber": 2088,
			"text": "",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 53
			}
		}
	]
}