{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"29": "Chapters On Inheritance"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2090,
			"arabicnumber": 2090,
			"text": "২০৯০। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন লোক যদি ধন-সম্পদ রেখে মৃত্যুবরণ করে তাহলে তা তার পরিবারের (উত্তরাধিকারীদের) প্রাপ্য। আর কোন লোক সহায়হীন পরিবার রেখে মৃত্যুবরণ করলে তাদের (ভরণ-পোষণের) দায়িত্ব আমার উপর। সহীহ, এটি পূর্বে বর্ণিত (১০৭০নং) হাদীসের অংশ, বুখারী, মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। জাবির ও আনাস (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। ইমাম যুহরী আবূ সালামা হতে, তিনি আবূ হুরাইরা (রাঃ) তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এ হাদীসটি আরো দীর্ঘ ও পূর্ণাঙ্গভাবে বর্ণনা করেছেন। \"মান তারাকা যাইয়াআন” অর্থঃ কেউ যদি সহায়-সম্বলহীন পরিবার রেখে মৃত্যুবরণ করে যাদের কিছুই নেই, তাদের দায়-দায়িত্ব আমার উপর। আমি তাদের ভরণ-পোষণের ব্যবস্থা করব।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2091,
			"arabicnumber": 2091,
			"text": "২০৯১। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা মীরাস বন্টন নীতি ও কুরআন শিক্ষা কর এবং তা অন্য লোকদেরও শিক্ষা দাও। কেননা আমি তো অবশ্যই মরণশীল। যঈফ, মিশকাত (২৪৪)। ইরওয়া (১৬৬৪) আবূ ঈসা বলেন, এ হাদীসের সনদে গরমিল আছে। এ হাদীস রিওয়ায়াত করেছেন আবূ উসামা-আওফ হতে তিনি জনৈক ব্যক্তি হতে তিনি সুলাইমান ইবনু জাবির হতে তিনি ইবনু মাসউদ (রাঃ) হতে তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সূত্রে। আল-হুসাইন ইবনু হুরাইস-আবূ উসামা হতে তিনি আওফ হতে উক্ত মর্মে একই রকম হাদীস বর্ণনা করেছেন। মুহাম্মাদ ইবনুল কাসিম আল-আসাদীকে আহমাদ ইবনু হাম্বল (রহঃ) প্রমুখ হাদীস শাস্ত্রে দুর্বল বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2092,
			"arabicnumber": 2092,
			"text": "২০৯২। জাবির ইবনু আবদুল্লাহ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, সা’দ ইবনুর রাবী (রাঃ)-এর স্ত্রী সা’দের ঔরসজাত তার দুই মেয়েসহ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সামনে হাযির হয়ে বললেন, হে আল্লাহর রাসূল! এরা সাদ ইবনুর রাবীর দুই মেয়ে। এদের বাবা উহুদের যুদ্ধে আপনার সাথে অংশগ্রহণ করে শহীদ হয়েছেন। এদের সমস্ত ধন-সম্পদ এদের চাচা নিয়ে নিয়েছে, এদের জন্য সামান্য কিছুও রাখেনি। এদের কোন ধন-সম্পদ না থাকলে এদের বিয়েও তো হবে না। তিনি বললেনঃ এ বিষয়টি আল্লাহ তা'আলাই সমাধান করে দিবেন। এরই পরিপ্রেক্ষিতে মীরাস বণ্টন বিষয়ক আয়াত অবতীর্ণ হয়। তাদের চাচাকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ডেকে এনে বললেনঃ সা’দের দুই মেয়েকে দুই-তৃতীয়াংশ সম্পত্তি এবং তাদের মাকে এক-অষ্টমাংশ সম্পত্তি দিয়ে দাও, তারপর যেটুকু বাকী থাকে তা তোমার হাসান, ইবনু মা-জাহ (২৭২০)। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। আমরা এ হাদীসটি শুধুমাত্র আবদুল্লাহ ইবনু মুহাম্মাদ ইবনু আকীলের সূত্রেই জেনেছি। এ হাদীসটি আবদুল্লাহ ইবনু মুহাম্মাদের সূত্রে শারীকও বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2093,
			"arabicnumber": 2093,
			"text": "২০৯৩। হুযাইল ইবনু শুরাহবীল (রহঃ) হতে বর্ণিত আছে, তিনি বলেন, আবূ মূসা (রাঃ) ও সালমান ইবনু রাবীআ (রাঃ)-এর নিকট একজন লোক এসে তাদের কাছে মেয়ে, নাতনী ও সহোদরী বোনের মীরাসের ব্যাপারে প্রশ্ন করে। তারা দুজনেই বললেন, মেয়ে পাবে অর্ধেক সম্পত্তি এবং সহোদর বোন পাবে বাকী অংশ। তারা আরো বললেন, তুমি আবদুল্লাহ ইবনু মাসউদ (রাঃ)-এর কাছে যাও এবং তাকে প্রশ্ন কর। তিনিও আমাদেরই অনুসরণ করবেন। লোকটি আবদুল্লাহ ইবনু মাসউদ (রাঃ)-এর নিকট এসে তাকে ঘটনা বলে এবং তারা দুজনে যা বলেছেন তাও তাকে অবহিত করায়। আবদুল্লাহ (রাঃ) বললেন, আমি যদি তাদের দুজনের অনুসরণ করি তাহলে পথভ্রষ্ট হব এবং সঠিক পথে অটুট থাকতে পারব না। আমি এ বিষয়ে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের অনুরূপ ফায়সালাই প্রদান করব। মেয়ে পাবে অর্ধেক সম্পত্তি এবং নাতনী পাবে এক-ষষ্ঠাংশ সম্পত্তি। এভাবে দুজনের অংশ একত্রে দুই-তৃতীয়াংশ পূর্ণ হবে। বাকী সম্পত্তি পাবে বোন। সহীহ, ইবনু মা-জাহ (২৭২১), বুখারী। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। আবূ কাইস আল-আওদীর নাম আবদুর রাহমান, পিতা সারওয়ান আল-কূফী। এ হাদীসটি শুবাও আবূ কাইসের সূত্রে বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2094,
			"arabicnumber": 2094,
			"text": "২০৯৪। আলী (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, তোমরা এ আয়াত পাঠ করে থাকঃ “যা কিছু তোমরা ওয়াসিয়াত কর বা যে ঋণ রয়েছে তা আদায় করার পর ....\" (সূরাঃ আন-নিসাঃ ১২)। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ওয়াসিয়াত পূরন করার পূর্বে ঋণ আদায়ের ফায়সালা দিয়েছেন। বৈমাত্রেয় বা বৈপিত্রেয় ভাইদের আগে সহোদর ভাই উত্তরাধিকারী হবে (যদি মৃত ব্যক্তির উভয় ধরনের ভাই থাকে)। সহোদর ভাই উত্তরাধিকারী হবে, বৈমাত্রেয় ভাইয়ের পূর্বে। হাসান, ইবনু মা-জাহ (২৭১৫)। বুনদার (রাহঃ) ইয়াযীদ ইবনু হারুন হতে, তিনি যাকারিয়া ইবনু আলী (রাঃ) হতে, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে একইরকম হাদীস বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2095,
			"arabicnumber": 2095,
			"text": "২০৯৫। আলী (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফায়সালা দিয়েছেন যে, সহোদর ভাইয়েরা একে অপরের উত্তরাধিকারী হবে, কিন্তু বৈমাত্রেয় ভাই উত্তরাধিকারী হবে না। অর্থাৎ সহোদর ভাই থাকাবস্থায় বৈমাত্রের ভাই উত্তরাধিকার হবে না। হাসান, দেখুন পূর্বের হাদীস। আবূ ঈসা বলেন, আমরা এ হাদীসটি শুধুমাত্র আবূ ইসহাক হতে আল-হারিসের বরাতে আলী (রাঃ)-এর সূত্রেই জেনেছি। একদল অভিজ্ঞ মুহাদ্দিস হারিসের সমালোচনা করেছেন। এ হাদীস মুতাবিক সব সাধারণ আলিমগণ আমল করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2096,
			"arabicnumber": 2096,
			"text": "২০৯৬। জাবির ইবনু আবদুল্লাহ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে দেখতে এলেন। তখন আমি অসুস্থ অবস্থায় সালামা গোত্রে ছিলাম। আমি বললাম, হে আল্লাহর নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)। আমি কিভাবে আমার ধন-সম্পদ আমার সন্তানদের মাঝে বণ্টন করব? তিনি আমাকে কোন জবাব দিলেন না। ইতোমধ্যে এ আয়াত নাযিল হলোঃ “আল্লাহ তা'আলা তোমাদের সন্তানদের ব্যাপারে তোমাদেরকে এই বিধান দিচ্ছেন- একজন পুরুষের অংশ দুইজন মহিলার অংশের সমান ....” (সূরাঃ আন-নিসা -১১) সহীহ, বুখারী, মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। এ হাদীসটি শুবা, ইবনু উয়াইনা আরও অনেক মুহাম্মাদ ইবনুল মুনকাদির হতে জাবির (রাঃ)-এর সূত্রে বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2097,
			"arabicnumber": 2097,
			"text": "২০৯৭। জাবির ইবনু আবদুল্লাহ (রাঃ) বলেন, আমি অসুস্থ হলে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে দেখতে এলেন। তিনি আমাকে সংজ্ঞাহীন অবস্থায় পেলেন। তার সাথে আবূ বাকর ও উমার (রাঃ)-ও আমাকে দেখতে আসেন। তারা দুজনেই পায়ে হেঁটে আসেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ওযু করলেন এবং ওযুর পানি আমার উপর ছিটিয়ে দিলেন। আমার হুশ ফিরে এল। আমি বললাম, হে আল্লাহর রাসূল! আমার ধন-সম্পদের ব্যাপারে আমি কি করব? আমার এ কথায় তিনি কোন জবাব দিলেন না। (অধঃস্তন বর্ণনাকারী বলেন) তার নয়টি বোন ছিল। অবশেষে মীরাস বিষয়ক আয়াতটি অবতীর্ণ হলোঃ “লোকেরা তোমার কাছে জানতে চায়। বল আল্লাহ তা'আলা তোমাদেরকে কালালা প্রসঙ্গে বিধান দিচ্ছেন....” (সূরাঃ আন-নিসাঃ ১৭৬)। জাবির (রাঃ) বলেন, এ আয়াতটি আমার সম্বন্ধে অবতীর্ণ হয়েছে। সহীহ, ইবনু মা-জাহ (২৭২৮), বুখারী, মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2098,
			"arabicnumber": 2098,
			"text": "২০৯৮। ইবনু আব্বাস (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ নির্ধারিত অংশ তার প্রাপককে (অধিকারীকে) দিয়ে দাও। এরপর যেটুকু অংশ বাকী থাকবে তা পুরুষ নিকটাত্মীয়দের মধ্যে বণ্টন কর। সহীহ, ইবনু মা-জাহ (২৭৪০), বুখারী, মুসলিম। আবদ ইবনু হুমাইদ (রহঃ) আবদুর রাযযাক হতে, তিনি মামার (রাঃ) হতে, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে অনুরূপ বর্ণনা করেছেন। আবূ ঈসা বলেন, এ হাদীসটি হাসান। কিছু সংখ্যক বর্ণনাকারী এটাকে ইবনু তাউসের সূত্রে, তিনি তার বাবার বরাতে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে মুরসাল হাদীস হিসেবে বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2099,
			"arabicnumber": 2099,
			"text": "২০৯৯। ইমরান ইবনু হুসাইন (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, এক ব্যক্তি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকটে এসে বলল, আমার এক ছেলে (নাতি) মারা গেছে। তার রেখে যাওয়া সম্পদের আমি কি অংশ পাব? তিনি বললেনঃ তুমি এক-ষষ্ঠাংশ পাবে। লোকটি যখন চলে যাচ্ছিল, তিনি তাকে ডেকে বললেনঃ তুমি আরো এক-ষষ্ঠাংশ পাবে। সে যখন আবার চলে যাচ্ছিল, তিনি তাকে ডেকে বলেনঃ পরবর্তী এক-ষষ্ঠাংশ তোমার জন্য অতিরিক্ত রিযিকস্বরূপ (অতিরিক্ত ওয়ারিস থাকলে তুমি তা পেতে না)। যঈফ, যঈক আবূ দাউদ (৫০০) আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। এ অনুচ্ছেদে মাকিল ইবনু ইয়াসার (রাঃ) হতেও হাদীস বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2100,
			"arabicnumber": 2100,
			"text": "২১০০। কাবীসা ইবনু যুওয়াইব (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, এক দাদী অথবা নানী আবূ বাকর (রাঃ)-এর নিকটে এসে বলল, আমার পৌত্র অথবা দৌহিত্র মারা গেছে। আমাকে জানানো হয়েছে যে, কুরআনে আমার জন্য অংশ নির্ধারিত রয়েছে। আবূ বাকর (রাঃ) বললেন, আমি কুরআনে তোমার জন্য নির্ধারিত কোন অংশ দেখতে পাচ্ছি না এবং রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকেও তোমার (দাদীর প্রাপ্য অংশের) ব্যাপারে কোন ফায়সালা দিতে শুনিনি। অতএব আমি লোকদের কাছে ব্যাপারটা জিজ্ঞেস করে নিব। তিনি লোকদের কাছে জিজ্ঞেস করলেন। মুগীরা ইবনু শুবা (রাঃ) সাক্ষ্য দিলেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে (দাদীকে) ছয় ভাগের এক অংশ দান করেছেন। তিনি বললেন, তোমার সাথে এটা আর কে শুনেছে? তিনি (মুগীরা) বললেন, মুহাম্মাদ ইবনু মাসলাম (রাঃ)। রাবী বলেন, তিনি (আবূ বাকর) তাকে (দাদীকে) ছয় ভাগের এক অংশ দান করলেন। পরবর্তীকালে আর এক দাদী বা নানী উমার (রাঃ)-এর নিকটে আসে। বলেছেন, কিন্তু আমি তা যুহরীর সূত্রে কখনো মুখস্ত করিনি, বরং আমি মামারের সূত্রে তা মুখস্ত করেছি। উমার (রাঃ) বলেন, তোমরা (দাদী-নানী) উভয়ে যদি বেঁচে থাক তবে এটা (এক-ষষ্ঠাংশ) তোমাদের উভয়ের মাঝে বণ্টিত হবে। আর তোমাদের দুইজনের মধ্যে যদি একজন বর্তমান থাকে তবে এটা সে একাই পাবে। যঈফ, ইরওয়া (১৬৮০) যঈফ আবূ দাউদ (৪৯৭)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2101,
			"arabicnumber": 2101,
			"text": "২১০১। কাবীসা ইবনু যুওয়াইব (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, এক দাদী আবূ বাকর (রাঃ)-এর নিকটে এসে তার মীরাস প্রসঙ্গে প্রশ্ন করে। তিনি তাকে বললেন, তোমার জন্য আল্লাহ তা'আলার কিতাবে কিছু নির্ধারিত নেই। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সুন্নাতেও তোমার সম্পর্কে কিছু নেই। তুমি চলে যাও, আমি লোকদের নিকটে প্রশ্ন করে ব্যাপারটি জেনে নেই। তিনি লোকদের প্রশ্ন করলে মুগীরা ইবনু শুবা (রাঃ) বললেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকটে হাযির থাকা অবস্থায় তিনি তাকে (দাদীকে) ছয় ভাগের এক অংশ দান করার ফাইসালা দিয়েছেন। তিনি (আবূ বাকর) প্রশ্ন করলেন, তোমার সাথে আরো কেউ ছিল কি? তখন মুহাম্মাদ ইবনু মাসলামা (রাঃ) উঠে দাড়িয়ে মুগীরা ইবনু শুবা (রাঃ)-এর মতই কথা বললেন। অতএব আবূ বাকর (রাঃ) তাকে ছয় ভাগের এক অংশ দেয়ার বিধান জারি করেন। পরবর্তী কালে অপর এক দাদী এসে উমার ইবনুল খাত্তাব (রাঃ)-এর কাছে তার মীরাস প্রসঙ্গে প্রশ্ন করে। তিনি বলেন, আল্লাহ তা'আলার কিতাবে তোমার জন্য কোন অংশ নির্ধারিত নেই। তবে তোমার জন্য ঐ ছয় ভাগের এক অংশ নির্ধারিত আছে। তোমরা (দাদী-নানী) যদি উভয়ে বেঁচে থাক তবে এটা (ছয় ভাগের এক অংশ) তোমাদের উভয়ের মধ্যে সমানভাবে বণ্টিত হবে। আর তোমাদের উভয়ের মধ্যে যদি একজন বেঁচে থাকে তবে এটা সে একাই পাবে। দুর্বল, দেখুন পূর্বের হাদীস এ অনুচ্ছেদে বুরাইদা (রাঃ) হতেও হাদীস বর্ণিত আছে। আবূ ঈসা বলেন এ হাদিসটি হাসান। ইবনু উয়াইনার তুলনায় এটি অনেক বেশি সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2102,
			"arabicnumber": 2102,
			"text": "২১০২৷ আবদুল্লাহ ইবনু মাসউদ (রাঃ) হতে বর্ণিত আছে, তিনি এমন এক দাদী সম্পর্কে বলেন যার পুত্রও তার সাথে জীবিত ছিল। সে ছিল প্রথম দাদী, যাকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার পুত্রের বর্তমানে তাকে ছয় ভাগের এক অংশ দিয়েছেন। যঈফ, ইরওয়া (১৬৮৭) আবূ ঈসা বলেন, আমরা শুধুমাত্র উল্লেখিত সূত্রেই এ হাদীসটি মারফু হিসাবে জেনেছি। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের কিছু সাহাবী দাদীকে তার পুত্রের বর্তমানে উত্তোরাধিকারী ঘোষণা করেছেন। তাদের অপর দল এক্ষেত্রে তাকে উত্তোরাধিকারী ঘোষণা করেননি।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2103,
			"arabicnumber": 2103,
			"text": "২১০৩। আবূ উমামা ইবনু সাহল ইবনু হুনাইফ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, উমার ইবনুল খাত্তাব (রাঃ) আবূ উবাইদা (রাঃ)-কে লিখে পাঠান যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তির কোন অভিভাবক নেই, আল্লাহ ও তার রাসূল তার অভিভাবক। যে ব্যাক্তির অন্য কোন উত্তরাধিকারী নেই, মামা তার উত্তরাধিকারী। সহীহ, ইবনু মা-জাহ (২৭৩৭)। আবূ ঈসা বলেন, আইশা ও মিকদাম ইবনু মাদীকারিব (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2104,
			"arabicnumber": 2104,
			"text": "২১০৪। আইশা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে লোকের অন্য কোন উত্তরাধিকারী নেই (তার) মামা তার উত্তরাধিকারী হবে। সহীহ, দেখুন পূর্বের হাদীস আবূ ঈসা বলেন, এ হাদীসটি হাসান গারীব। এ হাদীসটিকে একদল বর্ণনাকারী মুরসালভাবে বর্ণনা করেছেন এবং তাতে আইশা (রাঃ)-এর উল্লেখ করেননি। একদল সাহাবী মামা, খালা ও ফুফুকে উত্তরাধিকারী হিসাবে বিবেচিত করেছেন। বেশিরভাগ অভিজ্ঞ আলিম এ হাদীসটিকে যাবিল আরহামকে (যারা আসাবাগণের অবর্তমানে উত্তরধিকারী হয়) উত্তরাধিকারী হিসাবে স্বীকৃতি দেয়ার ব্যাপারে দলীলরূপে গ্রহণ করেছেন। যাইদ ইবনু সাবিত (রাঃ) যাবিল আরহামকে উত্তরাধিকারী হিসাবে মেনে নেননা। তার মতে (যাবিল ফুরূয ও আসাবাদের অবর্তমানে) মৃত ব্যক্তির রেখে যাওয়া সম্পত্তি সরকারী কোষাগারে (বাইতুল-মালে) জমা হবে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2105,
			"arabicnumber": 2105,
			"text": "২১০৫। আইশা (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের একজন মুক্তদাস খেজুর গাছের মাথা হতে পড়ে গিয়ে মৃত্যুবরণ করে। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমরা তালাশ করে দেখ তার কোন উত্তরাধিকারী আছে কি না? লোকজন বলল, কেউ নেই। তিনি বললেনঃ তার রেখে যাওয়া সম্পদ গ্রামের কাউকে দিয়ে দাও। সহীহ, ইবনু মা-জাহ (২৭৩৩)। আবূ ঈসা বলেন, এ হাদীসটি হাসান।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2106,
			"arabicnumber": 2106,
			"text": "২১০৬। ইবনু আব্বাস (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের যুগে এক ব্যক্তি উত্তোরাধিকারহীন অবস্থায় মারা যায়। তার একটি মুক্তদাস ছিল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে তার রেখে যাওয়া সম্পত্তি দান করেন। যঈফ, ইবনু মাজাহ (২৭৪১) আবূ ঈসা বলেন, এ হাদীসটি হাসান। আলিমদের মতে, কোন ব্যক্তি আসাবা না রেখে (উত্তোরাধিকারহীন অবস্থায়) মারা গেলে তার রেখে যাওয়া সম্পত্তি মুসলিমদের বাইতুল মালে (সরকারী তহবিলে) জমা হবে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2107,
			"arabicnumber": 2107,
			"text": "২১০৭। উসামা ইবনু যাইদ (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মুসলিম ব্যক্তি কাফির ব্যক্তির উত্তরাধিকারী হবে না এবং কাফিরও মুসলিম ব্যক্তির উত্তরাধিকারী হবে না",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2108,
			"arabicnumber": 2108,
			"text": "২১০৮। জাবির (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ দুটি পৃথক ধর্মের অনুসারী পরস্পরের উত্তরাধিকারী হবে না। সহীহ, ইবনু মা-জাহ (২৭৩১)। আবূ ঈসা বলেন, আমরা এ হাদীস সম্বন্ধে শুধুমাত্র ইবনু আবৃ লাইলার সূত্রে জাবির (রাঃ) হতে বর্ণিত হিসাবে জেনেছি।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2109,
			"arabicnumber": 2109,
			"text": "২১০৯৷ আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ হত্যাকারী কোন প্রকার উত্তরাধিকারী হবে না। সহীহ, ইবনু মা-জাহ (২৭৩৫)। আবূ ঈসা বলেন, এ হাদীসটি সহীহ নয়। এ হাদীসটি শুধুমাত্র উল্লেখিত সনদসূত্রেই জানা গেছে। ইসহাক ইবনু আবদুল্লাহকে কয়েকজন বিশেষজ্ঞ মুহাদ্দিস পরিত্যক্ত বলে মত প্রকাশ করেছেন। তাদের মধ্যে আহমাদ ইবনু হাম্বল অন্যতম। এ হাদীস মুতাবিক অভিজ্ঞ আলিমগণ আমল করেছেন। তাদের মতে, হত্যাকারী নিহত ব্যাক্তির উত্তরাধিকারী হবে না, চাই সে ইচ্ছাকৃতভাবে হত্যা করুক অথবা ভুলবশতঃ হত্যা করুক। ইমাম মালিকের মতে, ভুলক্রমে হত্যাকাণ্ড ঘটে গেলে হত্যাকারী নিহতের উত্তরাধিকারী হবে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2110,
			"arabicnumber": 2110,
			"text": "২১১০। সাঈদ ইবনুল মুসাইয়্যিব (রহঃ) হতে বর্ণিত আছে, তিনি বলেন, উমার (রাঃ) বললেন, আকিলার উপর দিয়াত (রক্তমূল্য) ধার্য করা হবে। স্বামীর দিয়াতের মধ্যে স্ত্রী উত্তরাধিকারী হবে না। তখন যাহহাক ইবনু সুফিয়ান আল-কিলাবী (রাঃ) তাকে বললেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে লিখে পাঠিয়েছেনঃ “আশইয়াম আয-যিবাবীর স্ত্রীকে তার স্বামীর দিয়াতের উত্তরাধিকারী বানাও”। সহীহ, ইবনু মা-জাহ (২৬৪২)। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2111,
			"arabicnumber": 2111,
			"text": "২১১১। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, লিহইয়ান বংশের একজন স্ত্রীলোককে তার (অন্যের আঘাতে মৃত্যুজনিত কারণে) গর্ভপাতের দিয়াত হিসাবে রাসূলুল্লাহ সাল্লাল্লাহু ওয়াসাল্লাম একটি গোলাম অথবা একটি দাসী প্রদানের ফায়সালা দেন। তিনি যে মহিলাটির উপর এই দিয়াত নির্ধারণ করেন পরে সে মারা যায়। তার রেখে যাওয়া সম্পত্তির ব্যাপারে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফায়সালা দেন যে, এটা তার স্বামী ও ছেলেদের মধ্যে ভাগ করে দেয়া হবে এবং তার উপর ধার্যকৃত দিয়াত তার আসাবাগণের উপর বর্তাবে। সহীহ, ইরওয়া (২২০৫), বুখারী, মুসলিম। আবূ ঈসা বলেন, ইউনুস (রাহঃ) যুহরী হতে, তিনি সাঈদ ইবনুল মুসাইয়্যিব ও আবূ সালামা হতে, তিনি আবূ হুরাইরা (রাঃ) হতে, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সূত্রে একইরকম বর্ণনা করেছেন। এ হাদীসটি মালিক-যুহরী হতে, তিনি আবূ সালামা হতে, তিনি আবূ হুরাইরা (রাঃ)-এর সূত্রেও বর্ণনা করেছেন। উক্ত হাদীসটি মালিক যুহরী হতে, তিনি সাইদ ইবনুল মুসায়্যিব হতে, তিনি রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে মুরসাল হিসাবে বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2112,
			"arabicnumber": 2112,
			"text": "২১১২। তামীমুদ দারী (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে প্রশ্ন করলাম, কোন মুসলিম লোকের হাতে কোন মুশরিক লোক ইসলাম কুবুল করলে তার কি বিধান রয়েছে? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ সে (মুসলিম লোকটি) তার (নও-মুসলিমের) জীবনে-মরণে অন্য সব মানুষের চেয়ে বেশি প্রাধান্য পাবে। হাসান সহীহঃ ইবনু মা-জাহ (২৭৫২) আবূ ঈসা বলেন, আমরা শুধুমাত্র আবদুল্লাহ ইবনু ওয়াহবের সূত্রেই এ হাদীসটি জেনেছি। আবার কেউ তা বর্ণনা করেছেন ইবনু মাওহিব হতে, তিনি তামীমুদ দারী (রাঃ)-এর সূত্রে। এই হাদীসের সনদে আবদুল্লাহ ইবনু ওয়াহব ও তামীমুদ দারী (রাঃ)-এর মাঝখানে কোন কোন বর্ণনাকারী কাবীসা ইবনু যুআইব (রাহঃ)-কে অন্তর্ভুক্ত করেছেন। কিন্তু তা সঠিক নয়। আব্দুল আযীয ইবনু উমারের সূত্রে ইয়াহইয়া ইবনু হামযা এ হাদীসটি বর্ণনা করেছেন এবং তাতে কাবীসা ইবনু যুআইবের নাম অন্তর্ভুক্ত করেছেন। আমি মনে করি এ হাদীসের সনদ মুত্তাসিল নয়। এ হাদীস অনুযায়ী একদল অভিজ্ঞ আলিম আমল করেছেন। তাদের মতে, যার হাতে সে লোকটি মুসলিম হয়েছে সে তার উত্তরাধিকারী হবে। বিশেষজ্ঞদের অন্য আরেক দল বলেছেন, তার মারা যাওয়ার পর তার রেখে যাওয়া সম্পত্তি বাইতুল মালে জমা করা হবে। ইমাম শাফিঈর এই অভিমত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের এই হাদীসটি তার দলীলঃ “যে লোক গোলাম মুক্ত করে সে-ই 'ওয়ালার স্বত্বাধিকারী হবে'।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2113,
			"arabicnumber": 2113,
			"text": "২১১৩। আমর ইবনু শুআইব (রহঃ) হতে পর্যায়ক্রমে তার বাবা ও দাদার সূত্রে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন লোক যদি কোন স্বাধীন স্ত্রীলোক অথবা দাসীর সাথে যিনায় (ব্যভিচারে) লিপ্ত হয় তাহলে (জন্মগ্রহণকারী) সন্তান জারজ সন্তান’ বলে গণ্য হবে। সে কারো উত্তরাধিকারী হবে না এবং তারও কেউ উত্তরাধিকারী হবে না। সহীহ, মিশকাত, তাহকীক ছানী (৩০৫৪)। আবূ ঈসা বলেন, এ হাদীসটি আমর ইবনু শুআইবের সূত্রে ইবনু লাহীআ ছাড়াও অন্য বর্ণনাকারীগণ বর্ণনা করেছেন। বিশেষজ্ঞ আলিমগণ এ হাদীস অনুসারে আমল করেছেন। ব্যভিচারজাত সন্তান তার জন্মদাতা পিতার উত্তরাধিকারী হবে না।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2114,
			"arabicnumber": 2114,
			"text": "২১১৪। আমর ইবনু শুআইব (রহঃ) হতে পর্যায়ক্রমে তার পিতা ও দাদার সূত্রে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ যে ব্যক্তি মালের উত্তোরাধিকারী হবে সে-ই ওয়ালার উত্তোরাধিকারী হবে (অর্থাৎ যে গোলাম মুক্ত করার মূল্য পরিশোধ করবে সে-ই গোলামের রেখে যাওয়া সম্পত্তির উত্তোরাধিকারী হবে)। যঈফ, মিশকাত, তাহকীক ছানী (৩০৬৬) আবূ ঈসা বলেন, এ হাদীসের সনদ তেমন মজবুত নয়।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2115,
			"arabicnumber": 2115,
			"text": "২১১৫। ওয়াসিলা ইবনুল আসকা (রাঃ) হতে বর্ণিত, তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ স্ত্রীলোকেরা (এককভাবে) তিন ধরনের মীরাসী সম্পত্তির ওয়ারিস হতে পারেঃ নিজের আযাদকৃত গোলামের, যে শিশুকে পরিত্যক্ত অবস্থায় পেয়ে সে তুলে নিয়ে লালন-পালন করেছে তার এবং যে শিশু সম্পর্কে সে লিআন করেছে তার। যঈফ, ইবনু মাজাহ (২৭৪২) আবূ ঈসা বলেছেনঃ এ হাদীসটি হাসান গারীব। মুহাম্মাদ ইবনু হারব-এর সূত্রেই আমরা এ হাদীস প্রসঙ্গে জেনেছি।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 26
			}
		}
	]
}