{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"35": "Chapters On Witnesses"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2295,
			"arabicnumber": 2295,
			"text": "২২৯৫। যাইদ ইবনু খালিদ আল-জুহানী (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমি কি উত্তম সাক্ষী সম্পর্কে তোমাদেরকে অবহিত করবো না? তলব (আহবান) করার পূর্বেই যে ব্যক্তি স্বেচ্ছায় সাক্ষ্য দেয় সে হলো উত্তম সাক্ষী। সহীহ, মুসলিম।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2296,
			"arabicnumber": 2296,
			"text": "২২৯৬। আহমাদ ইবনুল হাসান-আবদুল্লাহ ইবনু মাসলামা হতে, তিনি মালিক (রহঃ)-এর সূত্রে উপরোক্ত হাদীসের অনুরূপ বর্ণনা করেছেন। আবদুল্লাহ ইবনু মাসলামা তার রিওয়ায়াতে আবী আমরার স্থলে মালিক ইবনু আবী আমরা বলেছেন। আবূ ঈসা বলেন, এ হাদীসটি হাসান। বেশিরভাগ মুহাদ্দিস বলেছেন, আবদুর রাহমান ইবনু আবী আমরা। মালিক হতে এ হাদীসের বর্ণনাতে মতানৈক্য এই যে, কেউ বলেন, আবূ আমরা এবং কেউ বলেন, ইবনু আবী আমরা আনসারী। আমাদের মতে শেষেরটিই সহীহ। কারণ, মালিক (রাহঃ) ব্যতীত অন্য সনদসূত্রে আবদুর রাহমান ইবনু আবী আমরা-যাইদ ইবনু খালিদ (রাঃ) হতে এভাবে উল্লেখ আছে। আর উক্ত হাদীস ব্যতীত ইবনু আবী আমরা হতে যাইদ ইবনু খালিদ (রাঃ)-এর সূত্রে অন্য হাদীসও বর্ণিত আছে এবং সেটিও সহীহ হাদীস। আবূ আমরা হলেন যাইদ ইবনু খালিদ আল-জুহানী (রাঃ)-এর মুক্তদাস। আবূ আমরার সূত্রে গানীমাত অর্থাৎ যুদ্ধলব্ধ সম্পদ আত্মসাৎ সম্পর্কিত হাদীস বর্ণিত আছে। আর অধিকাংশ বর্ণনাকারীগণই তাকে আব্দুর রাহমান ইবনু আবী আমরাই বলেন।",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2297,
			"arabicnumber": 2297,
			"text": "২২৯৭। যাইদ ইবনু খালিদ আল-জুহানী (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে তিনি বলতে শুনেছেনঃ সাক্ষীগণের মধ্যে সেই ব্যক্তি সবচাইতে উত্তম যে তলব করার আগেই নিজ ইচ্ছায় সাক্ষ্য দেয়। পূর্বের হাদীসের সহায়তায় এ হাদীসটি সহীহ। আবূ ঈসা বলেন, এ হাদীসটি হাসান এবং উপরোক্ত সনদসূত্রে গারীব।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2299,
			"arabicnumber": 2299,
			"text": "২২৯৯৷ আইমান ইবনু খুরাইম (রহঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক সময় ভাষণ দিতে দাড়িয়ে বলেনঃ হে লোকসকল! মিথ্যা সাক্ষ্য প্রদানকে আল্লাহ তা'আলার সাথে শারীক করার সম-পর্যায়ের (অপরাধ) গণ্য করা হয়েছে। তারপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এ আয়াত তিলাওয়াত করেনঃ “তোমরা মূর্তিপূজার অপবিত্রতা বর্জন কর এবং মিথ্যা বলাও বর্জন কর\"। (সূরা হাজ্জঃ ৩০) যঈফ, ইবনু মাজাহ (২৩৭২) আবূ ঈসা বলেন, এ হাদীসটি গারীব। এ হাদীসটি আমরা শুধুমাত্র সুফিয়ান ইবনু যিয়াদের সূত্রেই জেনেছি। সুফিয়ান হতে এ হাদীস বর্ণনার ব্যাপারে রাবীগণের মতের অমিল আছে। আইমান ইবনু খুরাইম (রাহঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট হতে কোন কিছু শুনেছেন বলে আমাদের জানা নেই।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2300,
			"arabicnumber": 2300,
			"text": "২৩০০। খুরাইম ইবনু ফাতিক (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফজরের নামায আদায় করলেন। নামায শেষে তিনি দাড়িয়ে বলেনঃ মিথ্যা সাক্ষ্যপ্রদানকে আল্লাহ তা'আলার সাথে শারীক করার সমতুল্য গণ্য করা হয়েছে। তিনি একথা তিনবার বললেন। তারপর তিনি এ আয়াত তিলাওয়াত করলেনঃ “তোমরা মিথ্যা বলা পরিহার কর\"। (সূরা হাজ্জঃ ৩০) যঈফ, যঈফা (১১১০) আবূ ঈসা বলেনঃ এই বর্ণনাটি আমার মতে অধিক সহীহ। খুরাইস ইবনু ফাতিক একজন সাহাবী। তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে অনেক হাদীস বর্ণনা করেছেন। তিনি একজন প্রসিদ্ধ ব্যক্তি।",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2301,
			"arabicnumber": 2301,
			"text": "২৩০১। আবূ বাকরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমি কি তোমাদেরকে সবচেয়ে মারাত্মক কাবীরা গুনাহ প্রসঙ্গে জানিয়ে দেবনা? সাহাবীগণ বলেন, অবশ্যই, ইয়া রাসূলুল্লাহ! তিনি বললেনঃ আল্লাহ তা'আলার সাথে শারীক করা, পিতা-মাতাকে কষ্ট দেয়া ও তাদের অবাধ্য হওয়া এবং মিথ্যা সাক্ষ্য দেয়া বা মিথ্যা কথা বলা। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পুনঃপুনঃ এ কথাগুলো বলতে থাকলেন। আমরা (মনে মনে) বলতে লাগলাম, তিনি যদি চুপ করতেন। সহীহ, গাইয়াতুল মারাম (২৭৭), বুখারী, মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান ও সহীহ। এ অনুচ্ছেদে আব্দুল্লাহ ইবনু আমর (রাঃ) হতেও হাদীস বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2302,
			"arabicnumber": 2302,
			"text": "২৩০২। ইমরান ইবনু হুসাইন (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে আমি বলতে শুনেছিঃ আমার যুগই (যুগের মানুষই) সর্বোত্তম, তারপর তাদের পরবর্তী যুগ, তারপর তাদের পরবর্তী যুগ (তিনবার বলেছেন)। তাদের পরবর্তী যুগে (তিনযুগ পরে) এমন সম্প্রদায়ের আবির্ভাব ঘটবে যারা হবে মোটা দেহ বিশিষ্ট এবং তারা মোটা দেহ বিশিষ্ট হওয়াটাই পছন্দ করবে। তারা সাক্ষ্য তলবের পূর্বেই সাক্ষ্য দিতে যাবে। সহীহ, পূর্বে বর্ণিত হয়েছে, বুখারী, মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি আমাশ হতে আলী ইবনু মুদরিক (রহঃ)-এর সূত্রে বর্ণিত রিওয়ায়াত হিসাবে গারীব। এই হাদীসটি আমাশ হতে হিলাল ইবনু ইয়াসাফের বরাতে ইমরান ইবনু হুসাইন (রাঃ)-এর সূত্রে আমাশের শিষ্যগণ বর্ণনা করেছেন। উপরোক্ত হাদীসের মতো বর্ণিত তিনি আমাশ হতে, তিনি হিলাল ইবনু ইয়াসাফ হতে, তিনি ইমরান ইবনু হুসাইন (রাঃ) হতে, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এই সূত্রে। এই সূত্রে বর্ণিত হাদীসটি মুহাম্মাদ ইবনু ফুযাইলের হাদীসের চাইতে অনেক বেশি সহীহ। কোন কোন অভিজ্ঞ আলিম বলেন, “তারা সাক্ষ্য তলবের আগেই সাক্ষ্য দিতে যাবে” কথার মর্ম এই যে, তারা মিথ্যা সাক্ষ্য দিবে। অর্থাৎ সাক্ষী প্রদানের জন্য তাদের কাউকে আহবান না করলেও (অসৎ উদ্দেশ্যে) সাক্ষ্য প্রদান করতে আসবে। উমার ইবনুল খাত্তাব (রাঃ) কর্তৃক বর্ণিত রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের হাদীসটিতে এর ব্যাখ্যা বিদ্যমান রয়েছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2303,
			"arabicnumber": 2303,
			"text": "২৩০৩। উমার ইবনুল খাত্তাব (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ “আমার যুগ হচ্ছে সর্বোত্তম যুগ, তারপর তাদের পরবর্তী যুগ, তারপর তাদের পরবর্তী যুগ। তারপর এরূপভাবে মিথ্যার প্রসার ঘটবে যে, কারো নিকট সাক্ষ্য তলব না করা হলেও সে সাক্ষ্য দিবে, শপথ করতে বলা না হলেও শপথ করবে”। সহীহ, মাজমাউয যাওয়াইদ (১০/১৯)। আর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের হাদীসঃ “সেই লোকই সর্বোত্তম সাক্ষ্যদাতা যে সাক্ষ্য তলবের পূর্বেই সাক্ষ্য দেয়” আমাদের মতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের উক্ত হাদীসের মর্ম এই যে, তাকে সাক্ষ্য দিতে বলা হলে সে তার জ্ঞাত বিষয়ে সাক্ষ্য দেয়া হতে বিরত থাকে না এবং বাস্তব ঘটনা প্রকাশ করে তার দায়িত্ব পালন করে। কোন কোন আলিমের মতে এটাই হলো উক্ত হাদীসের যথার্থ ব্যাখ্যা।",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 10
			}
		}
	]
}