{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"39": "The Book on the Description of Hellfire"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2573,
			"arabicnumber": 2573,
			"text": "২৫৭৩। আবদুল্লাহ ইবনু মাসউদ (রাযিঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যেদিন জাহান্নামকে উপস্থিত করা হবে সেদিন এর সত্তর হাজার লাগাম থাকবে। প্রতিটি লাগামের জন্য নিয়োজিত থাকবে সত্তর হাজার ফেরেশতা। তারা এগুলো ধরে এটাকে টানতে থাকবে। সহীহঃ মুসলিম (৮/১৪৯) 'আবদুল্লাহ বলেন, সুফইয়ান সাওরী মারফুভাবে এ হাদীসটি বর্ণনা করেননি। আবদ ইবনু হুমাইদ-আবদুল মালিক ইবনু আমর ও আবূ আমির আল-আকাদী হতে, তিনি সুফইয়ান হতে, তিনি আলা ইবনু খালিদ (রহঃ) হতে এই সনদ সূত্রে উপরিউক্ত হাদীসের মতো হাদীস বর্ণনা করেছেন, কিন্তু মারফুভাবে নয়",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2574,
			"arabicnumber": 2574,
			"text": "২৫৭৪। আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কিয়ামত দিবসে জাহান্নাম হতে একটি গর্দান (মাথা) বের হবে। এর দুটি চোখ থাকবে যা দিয়ে সে দেখবে, দুটি কান থাকবে যা দিয়ে সে শুনবে এবং একটি জিহবা থাকবে যা দিয়ে সে কথা বলবে। সে বলবে, তিন ধরনের লোকের জন্য আমাকে নিয়োজিত করা হয়েছেঃ (১) প্রতিটি অবাধ্য অহংকারী যালিমের জন্য, (২) আল্লাহ তা'আলার সাথে অন্য কোন কিছুকে যে ব্যক্তি ইলাহ বলে ডাকে তার জন্য এবং (৩) ছবি নির্মাতাদের জন্য। সহীহঃ সহীহাহ (৫১২), তা’লীকুর রাগীব (৪/৫৬) আবূ সাঈদ (রাযিঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, এ হাদীসটি হাসান গারীব। কোন কোন বর্ণনাকারী আমাশ হতে, তিনি আতিয়্যাহ হতে, তিনি আবূ সাঈদ হতে, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এ সূত্রে উপরোক্ত হাদীসের অনুরূপ বর্ণনা করেছেন। আশআস্ ইবনু সাওয়ার আতিয়্যাহ হতে, তিনি আবূ সাঈদ খুদরী (রাযিঃ) হতে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এই সূত্রে একই রকম বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2575,
			"arabicnumber": 2575,
			"text": "২৫৭৫। হাসান বাসরী (রহঃ) হতে বর্ণিত, উতবাহ ইবনু গাযওয়ান (রাযিঃ) আমাদের এই বসরার মিম্বারে দাঁড়িয়ে বলেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ জাহান্নামের এক প্রান্ত হতে বড় একটি পাথরকে গড়িয়ে ছেড়ে দেয়া হলে এটা সত্তর বছর পর্যন্ত গড়াতেই থাকবে তবু স্থির হবার জায়গায় আসতে পারবে না। সহীহঃ সহীহাহ (১৬১২), মুসলিম। বর্ণনাকারী বলেন, \"উমার (রাযীঃ) বলতেন, তোমরা বেশি বেশি জাহান্নামের কথা স্মরণ কর। কেননা এটার গরম তীব্র, এর গহব্বর অনেক গভীর এবং এর ডাণ্ডাগুলো লোহা দ্বারা নির্মিত। আবূ ঈসা বলেন, উতবাহ ইবনু গাযওয়ান (রাযিঃ)-এর নিকট হতে হাসান বাসরী (রাহঃ) সরাসরিভাবে কিছু শুনেছেন বলে আমাদের জানা নেই। উমার ইবনুল খাত্তাব (রাযিঃ)-এর খিলাফতকালে উতবাহ ইবনু গাযওয়ান (রাযিঃ) বসরায় আগমন করেন। আর হাসান বাসরী (রহঃ) উমার (রাযিঃ)-এর খিলাতের দুই বছর বাকি থাকতে জন্মগ্রহণ করেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2576,
			"arabicnumber": 2576,
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2577,
			"arabicnumber": 2577,
			"text": "২৫৭৭। আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত আছে যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ জাহান্নামে কাফির ব্যক্তির গায়ের চামড়া হবে বিয়াল্লিশ গজ মোটা, তার মাড়ির দাত হবে উহুদের সমান বড় এবং মক্কা-মদীনার দূরত্বের সমান বিস্তৃত হবে তার বসার জায়গা (নিতম্বদেশ)। সহীহঃ মিশকাত (৫৬৭৫), সহীহাহ (১১০৫), আযযিলা-ল (৬১০) আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ এবং আমাশের বর্ণনা হিসেবে গারীব।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2578,
			"arabicnumber": 2578,
			"text": "২৫৭৮। আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কিয়ামত দিবসে কাফির ব্যক্তির মাড়ির দাঁত হবে উহুদ পাহাড়সম বড়, তার উরু হবে বাইযা পাহাড়সম বিশাল এবং তার নিতম্বদেশ হবে রাবাযার মতো তিনদিন চলার পথের দূরত্বের সমান বিস্তৃত। হাসানঃ সহীহাহ (৩/৯৫) আবূ ঈসা বলেন, এ হাদীসটি হাসান গারীব। \"মাসালুর রাবাযা” অর্থ মদীনা ও রাবাযা নামক স্থানের মাঝখানের দূরত্বের সমান। আর বাইযা' একটি পাহাড়ের নাম যা উহুদ পাহাড়ের সমতুল্য।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2579,
			"arabicnumber": 2579,
			"text": "২৫৭৯। আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ জাহান্ননামে কাফির ব্যাক্তির মাড়ির দাঁত হবে উহুদ পাহাড়ের সমান। সহীহঃ তা’লীকুর রাগীব (৪/২৩৭), সহীহাহ (৩/৯৬) আবূ ঈসা বলেন, এ হাদীসটি হাসান। আবূ হাযিম হলেন আল-আশজা গোত্রীয়, তার নাম সালমান, আযযাহ আল-আশজাইয়্যার মুক্তদাস।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2580,
			"arabicnumber": 2580,
			"text": "২৫৮০। ইবনু উমার (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ (কিয়ামতের দিন) কাফির ব্যক্তি তার জিহবা এক-দুই ফারসাখ পরিমাণ জায়গা জুড়ে বিছিয়ে রাখবে। লোকেরা তা পদদলিত করবে। যঈফ, মিশকাত (৫৬৭৬), যঈফা (১৯৮৬) আবূ ঈসা বলেন, এ হাদীসটি গারীব। আমরা শুধুমাত্র উপরোক্ত সূত্রেই হাদীসটি জেনেছি। আল-ফাযল ইবনু ইয়াযীদ হলেন কূফার অধিবাসী। হাদীসের একাধিক ইমাম তার সূত্রে হাদীস বর্ণনা করেছেন। আবূল মুখারিক তেমন প্রসিদ্ধ রাবী নন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2581,
			"arabicnumber": 2581,
			"text": "২৫৮১। আবূ সাঈদ (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আল্লাহ্ তা'আলার বাণী “কাল-মুহলি” (তা যেন গলিত তামা)-এর ব্যাখ্যায় বলেনঃ তা হল তেলের গাদ সদৃশ। জাহান্নামীদের মধ্যে কোন জাহান্নামী যখনই এটা তার মুখের নিকটে নিবে সাথে সাথে তার মুখমণ্ডলের চামড়া খসে তাতে পড়ে যাবে। যঈফ, মিশকাত (৫৬৭৮), তা’লীকুর রাগীব (৪/২৩৪) আবূ ঈসা বলেন, আমরা শুধুমাত্র রিশদীন ইবনু সাদের রিওয়ায়াত হিসাবে এ হাদীস জেনেছি। রিশদীন সমালোচিত রাবী।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2582,
			"arabicnumber": 2582,
			"text": "২৫৮২। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ জাহান্নামীদের মাথায় গরম পানীয় ঢালা হবে, এমনকি তা পেট পর্যন্ত পৌছবে এবং পেটের সব নাড়িভূড়ি গলিয়ে দিবে, তারপর তা পায়ের দিক দিয়ে বেরিয়ে পড়বে। এটাই হল সাহর’ (গলে যাওয়া)। আবার তা পূর্বের ন্যায় হয়ে যাবে (এবং এমনিভাবে শাস্তির প্রক্রিয়া চলতে থাকবে)। সাঈদ ইবনু ইয়াযীদ-এর উপনাম আবূ সুজা মিসরের অধিবাসী, লাইছ ইবনু সা’দ তার নিকট হতে হাদীস বর্ণনা করেছেন। আবূ ঈসা বলেনঃ এ হাদীসটি হাসান, সহীহ গারীব। ইবনু হুজাইরার নাম আবদুর রহমান আল-মিসরী।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2583,
			"arabicnumber": 2583,
			"text": "২৫৮৩। আবূ উমামা (রাঃ) হতে বর্ণিত আছে, আল্লাহ্ তা'আলার বাণীঃ “জাহান্নামীদেরকে গলিত পুঁজ পান করানো হবে, যা সে এক এক ঢোক করে গলধঃকরণ করবে” (সূরাঃ ইবরাহীম- ১৬, ১৭) প্রসঙ্গে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ পুঁজ যখন তার মুখের নিকটে নিয়ে আসা হবে সে তা অপছন্দ করবে। তারপর যখন আরো নিকটে নিয়ে আসা হবে তখন তার মুখমণ্ডল পুড়ে যাবে এবং মাথার চামড়া গলে পড়ে যাবে। তারপর সে যখন তা পান করবে তখন তা তার নাড়িভুড়ি গলিয়ে ছিন্নভিন্ন করে দিবে এবং তা মলদ্বার দিয়ে বেরিয়ে যাবে। আল্লাহ তা'আলা বলেনঃ “তাদের গরম পানি পান করানো হবে, যা তাদের নাড়িভুড়ি ছিন্নভিন্ন করে দিবে\" (সূরা মুহাম্মাদঃ ১৫)। তিনি আরো বলেনঃ “পিপাসার্ত হয়ে তারা পানীয় প্রার্থনা করলে তাদেরকে দেয়া হবে গলিত ধাতুর ন্যায় পানীয়, যা তাদের মুখমণ্ডল দগ্ধ করবে। তা কতই না নিকৃষ্ট পানীয় এবং (জাহান্নাম) কতই না নিকৃষ্ট স্থান\" (সূরাঃ কাহফ- ২৯)। যঈফ, মিশকাত (৫৬৮০), তা’লীক অনুরূপ আবূ ঈসা বলেন, এ হাদীসটি গারীব। মুহাম্মাদ ইবনু ইসমাঈল বুখারী (রাহঃ) উবাইদুল্লাহ ইবনু বুসরের সূত্রে এরকমই বলেছেন। এ হাদীসের দ্বারাই শুধুমাত্র উবাইদুল্লাহ ইবনু বুসরের পরিচয় পাওয়া যায়। সাফওয়ান ইবনু আমর (রাহঃ) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সাহাবী আবদুল্লাহ ইবনু বুসর (রাঃ)-এর সূত্রে এ হাদীস ব্যতীত অন্য হাদীস বর্ণনা করেছেন। আবদুল্লাহ ইবনু বুসরের এক ভাই ও এক বোন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে হাদীস বর্ণনা করেছেন। সাফওয়ান ইবনু আমর (রহঃ) যে উবাইদুল্লাহ ইবনু বুসরের সূত্রে আবূ উমামা (রাঃ)-এর হাদীস বর্ণনা করেছেন তিনি অন্য ব্যক্তি, সাহাবী নন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2584,
			"arabicnumber": 2584,
			"text": "২৫৮৪। আবূ সাঈদ আল-খুদরী (রাঃ) হতে বর্ণিত আছে, “কালমুহুলি” (গলিত ধাতুর ন্যায়) প্রসঙ্গে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তা হল গরম তেলের গাদ সদৃশ (যা জাহান্নামীদের পান কারার জন্যে দেয়া হবে)। যখনই সে এটা (মুখের) নিকটে নিবে তার মুখমণ্ডলের চামড়া এতে গলে পড়ে যাবে। যঈফ, ২৭০৭ নং হাদীসের পুনরাবৃত্তি একই সনদসূত্রে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত আছে, তিনি বলেনঃ জাহান্নামের বেষ্টনী হবে চারটি প্রাচীর এবং প্রতিটি প্রাচীর হবে চল্লিশ বছরের দূরত্বের সমান পুরু। যঈফ, মিশকাত (৫৬৮১), তা’লীকুর রাগীব (৪/২৩১) একই সনদসূত্রে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত আছে, তিনি বলেনঃ জাহান্নামীদের পুজের এক বালতিও যদি দুনিয়াতে ঢেলে দেয়া হত, তবে সমস্ত দুনিয়াই দুর্গন্ধময় হয়ে যেত। যঈফ, মিশকাত (৫৬৮২) আবূ ঈসা বলেনঃ আমরা শুধুমাত্র রিশদীন ইবনু সাদের সূত্রে এ হাদীস প্রসঙ্গে জেনেছি। স্বরণশক্তির কারণে তিনি (একজন) সমালোচিত রাবী। “কিছাফু কুল্লি জিদার”-এর অর্থ \"প্রতিটি দেয়ালের পুরু বা ঘনত্ব”।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2585,
			"arabicnumber": 2585,
			"text": "২৫৮৫। ইবনু আব্বাস (রাযি.) হতে বর্ণিত আছে। রসূলুল্লাহসাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এ আয়াত তিলাওয়াত করলেনঃ “তোমরা আল্লাহ তা'আলাকে যথাযথভাবে ভয় কর এবং মুসলিম না হয়ে কোন অবস্থায় মৃত্যু বরণ করো না”— (সূরা আ-লি ইমরানঃ ১০২)। তারপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ যাক্কুম’-এর একটি বিন্দুও যদি দুনিয়াতে পতিত হতো তাহলে দুনিয়াবাসীদের জীবন দুৰ্বিসহ হয়ে যেত। আর এটা যাদের খাদ্য হবে তাদের কি অবস্থা হবে। (য’ঈফ; ইবনু মাযাহ-হাঃ নং- ৪৩২৫) আবূ ঈসা বলেনঃ এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2586,
			"arabicnumber": 2586,
			"text": "২৫৮৬। আবূদ দারদা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ জাহান্নামীদের উপর ক্ষুধা চাপিয়ে দেয়া হবে। ফলে তারা অন্যান্য শাস্তির মতই ক্ষুধার যন্ত্রণায়ও নিপিড়িত হবে। তারা কাতর কণ্ঠে ফারিয়াদ করবে এবং কাটাযুক্ত গুলোর খাবার দিয়ে তাদের ফারিয়াদ পূর্ণ করা হবে। এ খাবার না তাদেরকে মোটাতাজা করবে, না তাদের ক্ষুধা দূর করবে। তারা আবার খাবারের জন্য ফারিয়াদ করবে। তাদের তখন এমন খাবার দেয়া হবে যা তাদের গলায় আটকে যাবে। তারা তখন মনে করবে দুনিয়াতে পানি পান করে গলায় আটকানো খাবার বের করার কথা। সুতরাং তারা পানীয়ের জন্য ফারিয়াদ জানাবে এবং তাদেরকে লোহার কাঁটাযুক্ত গরম পানি দেয়া হবে। এটা তাদের মুখের নিকটে নেয়ামাত্র তা তাদের মুখমণ্ডল পুড়ে ফেলবে এবং যখন উহা তাদের পেটে প্রবেশ করবে তখন তা তাদের নাড়িভুড়ি গলিয়ে ছিন্নভিন্ন করে দিবে। তখন তারা (পরস্পর) বলবে, জাহান্নামের তত্ত্ববধায়ককে ডাকো। সে তাদের বলবে, “তোমাদের নিকটে কি রাসূলগণ সুস্পষ্ট দলীল-প্রমাণ নিয়ে আসেননি? তারা বলবে, হ্যাঁ এসেছিলেন। তত্ত্বাবধায়ক বলবে, তোমরা ডাকতে থাক কিন্তু কাফিরের ডাক নিস্ফল\" (সূরাঃ মু'মিন- ৫০)। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তারা বলাবলি করবে, তোমরা মালিককে (জাহান্নামের প্রধান তত্ত্ববধায়ককে) ডাকো। তারা বলবে, “হে মালিক! আপনার রব যেন আমাদের মৃত্যু ঘটান\" (সূরাঃ যুখরুফ- ৭৮)। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তাদের জবাব দেয়া হবে, “তোমরা এভাবেই থাকবে (মৃত্যু আসবে না)\" (৪৩ঃ ৭৮)। আমাশ (রাহঃ) বলেন, আমি জেনেছি যে, তাদের এ আহবান ও মালিকের জবাবদানের মাঝখানে এক হাজার বছর চলে যাবে। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ এরপর তারা (পরস্পর) বলবে, তোমাদের রবকে ডাকো, কেননা তোমাদের রবের চাইতে উত্তম আর কেউ নেই। তারা বলবে, “হে আমাদের রব। দুর্ভাগ্য আমাদের পরাজিত করেছে এবং আমরা ছিলাম পথভ্রষ্ট সম্প্রদায়। হে আমাদের আল্লাহ! আমাদেরকে এখান হতে বের করে নিন। আমরা যদি আবার এরূপ করি, তাহলে অবশ্যই আমরা যালিম\" (সূরাঃ মু'মিনূন- ১০৬, ১০৭)। তিনি বলেন, তাদের জবাব দেয়া হবে, “এখানেই তোরা লাঞ্ছিত অবস্থায় থাক, আর কোন কথা বলবে না”— (সূরা আল-মু'মিনূনঃ ১০৮)। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তখন হতে তারা সব ধরনের কল্যাণলাভ থেকে হতাশ হয়ে যাবে এবং এ ভয়ংকর অবস্থায় গর্দভের ন্যায় চিৎকার দিতে থাকবে। (য’ঈফ; মিশকাত- হাঃ নং- ৫৬৮৬; তা’লীকুর রাগীব- হাঃ নং- ৪/২৩৬) 'আবদুল্লাহ ইবনু আবদুর রহমান (রাহ.) বলেনঃ রাবীগণ এ হাদীস মারফুরূপে বর্ণনা করেননি। আবূ ঈসা বলেনঃ আমাশ হতে তিনি শিমর ইবনু আতিয়া হতে তিনি শাহর ইবনু হাওশাব হতে তিনি উম্মুদ দারদা (রাযি.) হতে তিনি আবূদ দারদা (রাযি.) হতে, এ সূত্রে হাদীসটি তার উক্তি হিসেবেই আমরা জেনেছি। মূলত এটি মারফু হাদীস নয়। কুতুবাহ ইবনু আবদুল আযীয হাদীসের ইমামগণের মতে নির্ভরযোগ্য রাবী।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2587,
			"arabicnumber": 2587,
			"text": "২৫৮৭। আবূ সাঈদ আল-খুদরী (রাযি.) হতে বর্ণিত আছে। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম \"সেখানে তারা থাকবে বীভৎস চেহারায়”— (সূরা আল-মু'মিনূনঃ ১০৪) আয়াত প্রসঙ্গে বলেনঃ তাদের মুখমণ্ডল অগ্নিদগ্ধ হবে, উপরের ঠোট কুঞ্চিত হয়ে মাথার মাঝখানে এসে যাবে এবং নীচের ঠোট নাভীর সাথে আছাড় খাবে। (য’ঈফ; মিশকাত— হাঃ নং- ৫৬৮৪) আবূ ঈসা বলেনঃ এ হাদীসটি হাসান, সহীহ গারীব। আবূল হাইসামের নাম সুলাইমান ইবনু আমর ইবনু আবদুল উতওয়ারী। তিনি ইয়াতীম হিসেবে আবূ সাঈদ (রাযি.)-এর তত্ত্বাবধানে প্রতিপালিত হন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2588,
			"arabicnumber": 2588,
			"text": "২৫৮৮। আবদুল্লাহ ইবনু আমর ইবনুল আস (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মাথার খুলীর দিকে ইশারা করে বলেছেনঃ এটার মতই একটি সীসা যদি আকাশ হতে যমিনের দিকে ছেড়ে দেয়া হয় তবে রাত হওয়ার পূর্বেই তা পৃথিবীতে পৌছে যাবে। অথচ এতদুভয়ের মাঝখানে পাঁচ শত বছরের পথের ব্যবধান রয়েছে। আর জাহান্নামের জিঞ্জীরের অগ্রভাগ হতে সীসাটি নীচের দিকে নিক্ষেপ করা হলে তা চল্লিশ বছর ধরে রাত-দিন চলতে থাকবে, গর্তের শেষ সীমায় পৌছার পূর্ব পর্যন্ত। যঈফ, মিশকাত (৫৬৮৮) তা’লীকুর রাগীব (৪/২৩২) আবূ ঈসা বলেনঃ এ হাদীসের সনদ হাসান সহীহ। সাঈদ ইবনু ইয়াযীদ মিসরের অধিবাসী। তার নিকট হতে লাইস ইবনু সা’দ ও অন্যান্য ইমামগণ হাদীস বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2589,
			"arabicnumber": 2589,
			"text": "২৫৮৯। আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত আছে যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের এই আগুন যা তোমরা প্রজ্বলিত কর তা জাহান্নামের আগুনের উত্তাপের সত্তর ভাগের এক ভাগ। সাহাবীগণ বলেন, হে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম। আল্লাহর কসম! এ আগুনই তো জাহান্নামীদের আযাবের জন্য যথেষ্ট ছিল। তিনি বললেনঃ এটাকে উনসত্তর গুণ বৃদ্ধি করা হয়েছে এবং প্রতিটি অংশের উত্তাপ এর সমান হবে। সহীহঃ তা’লীকুর রাগীব (৪/২২৬), বুখারী ও মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ হাম্মাম ইবনু মুনাবিহ হলেন ওয়াহব ইবনু মুনাবিবহ-এর ভাই। ওয়াহবও তার সূত্রে হাদীস বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2590,
			"arabicnumber": 2590,
			"text": "২৫৯০। আবূ সাঈদ (রাযিঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ জাহান্নামের আগুনের তুলনায় তোমাদের এই দুনিয়ার আগুন (তাপ) মাত্র সত্তর ভাগের এক ভাগ। প্রতিটি ভাগের উত্তাপ এরই সমান। পূর্বের হাদীসের সহায়তায় সহীহ আবূ ঈসা বলেন, হাদীসটি হাসান। আবূ সাঈদ (রাযিঃ)-এর বর্ণনা হিসেবে গারীব।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2592,
			"arabicnumber": 2592,
			"text": "২৫৯২। আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন একদিন জাহান্নাম তার প্রভুর নিকট অভিযোগ করে বললো যে, আমার এক অংশ অন্য অংশকে গ্রাস করছে। সুতরাং আল্লাহ তা'আলা তার জন্য দুটি নিঃশ্বাসের ব্যবস্থা করেন। এর একটি নিঃশ্বাস শীতকালে এবং অন্যটি গ্রীষ্মকালে ৷ শীতকালের নিঃশ্বাস ‘যামহারীর’ (শৈত্যপ্রবাহ) এবং গ্রীষ্মের নিঃশ্বাস সামূম (লু হওয়া)। সহীহঃ ইবনু মা-জাহ (৪৩১৯), বুখারী ও মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। এটি আবূ হুরাইরাহ (রাযিঃ)-এর সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে একাধিক সূত্রে বর্ণিত হয়েছে। হাদীস বিশেষজ্ঞগণ মনে করেন মুফায্যাল ইবনু সালিহ খুব একটা স্মৃতিশক্তি সম্পন্ন বর্ণনাকারী নন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2593,
			"arabicnumber": 2593,
			"text": "২৫৯৩। আনাস (রাযিঃ) হতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, আল্লাহ তা'আলা বলবেনঃ (হিশামের বর্ণনায়) জাহান্নাম থেকে বের হয়ে আসবে অথবা (শুবাহুর বর্ণনায়) যে “লা-ইলা-হা ইল্লাল্লাহ (আল্লাহ তা'আলা ব্যতীত কোন প্ৰভু নেই) বলেছে তাকে বের করে আন তার অন্তরে যবের দানা পরিমাণ ঈমান থাকলেও। আর যে “লা-ইলা-হা ইল্লাল্লাহ' বলেছে এবং তার অন্তরে যদি গমের দানা পরিমাণও ঈমান থাকে তবে তাকেও জাহান্নাম হতে বের করে আন। যে “লা-ইলা-হা ইল্লাল্লাহ' বলেছে এবং তার অন্তরে যদি অণু পরিমাণও (শুবাহুর বর্ণনায় আছে, একটি হালকা জোয়ারদানা পরিমাণ) ঈমান থাকে তবে তাকেও জাহান্নাম থেকে বের করে আন। সহীহঃ ইবনু মা-জাহ (৪৩১২), বুখারী ও মুসলিম। জাবির, আবূ সাঈদ ও ইমরান ইবনু হুসাইন (রাযিঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2594,
			"arabicnumber": 2594,
			"text": "২৫৯৪। আনাস (রাযি.) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আল্লাহ তা'আলা বলবেনঃ যে ব্যক্তি কোন দিন আমাকে মনে করেছে কিংবা কোন জায়গাতে আমাকে ভয় করেছে, তাকে জাহান্নাম হতে বের করে আন। যঈফ, আয-যিলাল (৮৩৩), তা’লীকুর রাগীব (৪/১৩৮), মিশকাত তাহকীক ছানী (৫৩৪৯) আবূ ঈসা বলেন, এ হাদীসটি হাসান গারীব।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2595,
			"arabicnumber": 2595,
			"text": "২৫৯৫। ‘আবদুল্লাহ ইবনু মাসউদ (রাযিঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে লোক সবার শেষে জাহান্নাম থেকে বেরিয়ে আসবে, আমি তাকে জানি। সে নিতম্বের উপর ভর দিয়ে (জাহান্নাম থেকে) হেঁচড়িয়ে বের হয়ে আসবে। সে বলবে, হে প্ৰভু! জান্নাতের জায়গাগুলে তো মানুষজন দখল করে নিয়েছে। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তাকে বল হবে, তুমি জান্নাতের দিকে অগ্রসর হও এবং তাতে প্রবেশ কর। তখন সে জান্নাতে প্রবেশের উদ্দেশে অগ্রসর হবে এবং দেখতে পাবে যে, সম্পূর্ণ জায়গা মানুষজন দখল করে নিয়েছে। সে ফিরে এসে বলবে, হে প্ৰভু! সমস্ত জায়গা তো মানুষজন দখল করে নিয়েছে। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, তাকে বলা হবে, সে সময়ের কথা স্মরণ আছে কি যাতে তুমি অবস্থান করছিলে? সে বলবে, হ্যাঁ স্মরণ আছে। বলা হবে, তুমি আকাঙ্ক্ষা কর। সে তখন আকাঙ্ক্ষা পেশ করবে। বলা হবে, তুমি যা আকাজক্ষা করেছে তা দেয়া হল তদুপারি দুনিয়ার দশ গুণ দেয়া হল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ এ কথা শোনার পর সে বলবে, আপনি বাদশাহ হয়ে আমার সাথে উপহাস করছেন? ইবনু মাসউদ (রাযিঃ) বলেন, এ কথা বলার পর আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে হাসতে দেখলাম, এমনকি তার মুখের দাঁত প্রকাশিত হল। সহীহঃ ইবনু মা-জাহ (৪৩৩৯), বুখারী ও মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2596,
			"arabicnumber": 2596,
			"text": "২৫৯৬। আবূ যার (রাযিঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে সবার শেষে জাহান্নাম থেকে বের হয়ে আসবে এবং সবার শেষে জান্নাতে প্রবেশ করবে আমি অবশ্যই তাকে চিনি। তাকে হাযির করা হলে আল্লাহ তা'আলা বলবেনঃ তোমরা ছোটখাটো গুনাহ প্রসঙ্গে তাকে প্রশ্ন কর এবং মারাত্মক গুনাহগুলো গোপন রাখো। সে মোতাবিক তাকে প্রশ্ন করা হবে, অমুক অমুক দিন তুমি এই এই গুনাহ করেছো, অমুক অমুক দিন এই এই গুনাহ করেছো। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তারপর তাকে বলা হবে, কিন্তু আজ প্রতিটি গুনাহর বিনিময়ে তোমাকে সাওয়াব দান করা হচ্ছে। সে বলবে, হে প্ৰভু! আমি তো এগুলো ব্যতীত আরো অনেক গুনাহ করেছি, কিন্তু এখানে সেগুলো দেখতে পাচ্ছি না। বর্ণনাকারী বলেন, এ সময় আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে এমনভাবে হাসতে দেখলাম যে, তার মুখের দাঁত পর্যন্ত প্রকাশিত হয়ে যায়। সহীহঃ মুসলিম আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2597,
			"arabicnumber": 2597,
			"text": "২৫৯৭। জাবির (রাযিঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কিছু তাওহীদবাদী লোককেও জাহান্নামের শাস্তি প্রদান করা হবে। এমনকি তারা তাতে পুড়তে পুড়তে কয়লার মতো হয়ে যাবে। তারপর আল্লাহ তা'আলার রহমতে তাদেরকে জাহান্নাম থেকে বের করা হবে এবং জান্নাতের দরজায় নিক্ষেপ করা হবে। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ জান্নাতে বসবাসকারীরা তাদের উপর পানি ছিটিয়ে দিবে। যার ফলে তারা সজীব হয়ে যাবে যেমনটি বন্যার স্রোত চলে যাবার পর মাটিতে উদ্ভিদ গজায়। তারপর তারা জান্নাতে প্রবেশ করবে। সহীহঃ সহীহাহ (২৪৫১) আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। জাবির (রাযিঃ) হতে এটি ভিন্ন সনদসূত্রেও বর্ণিত হয়েছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2598,
			"arabicnumber": 2598,
			"text": "২৫৯৮। আবূ সাঈদ আল-খুদরী (রাযিঃ) হতে বর্ণিত আছে যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তির অন্তরে অনু পরিমাণ ঈমানও রয়েছে সে ব্যক্তিকেও জাহান্নাম থেকে মুক্তি দেয়া হবে। আবূ সাঈদ (রাযিঃ) বলেন, কারো এ ব্যাপারে সন্দেহ হলে সে এ আয়াতটি তিলাওয়াত করুকঃ “আল্লাহ তা'আলা অণু পরিমাণও যুলুম করেন না”— (সূরা নিসাঃ ৪০)। সহীহঃ বুখারী ও মুসলিম আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2599,
			"arabicnumber": 2599,
			"text": "২৫৯৯। আবূ হুরাইরা (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ জাহান্নামে প্রবেশকারীদের মধ্যে দুই ব্যক্তি (তাতে প্রবেশ করেই খুব) জোরে চিৎকার করবে। আল্লাহ তা'আলা বলবেনঃ এদের দু’জনকে বের করে আন। তারপর তাদের বের করে আনা হলে তিনি প্রশ্ন করবেনঃ এত জোরে চিৎকার করছিলে কেন? তারা বলবে, আমরা এরূপ করেছি, যেন আপনি আমাদের প্রতি দয়া করেন। তিনি বলবেনঃ আমি তোমাদের প্রতি দয়া করলাম। তবে তোমরা জাহান্নামের যেখানে ছিলে সেখানে গিয়ে নিজেদের নিক্ষেপ কর। তারা সেদিকে যাবে। তারপর তাদের একজন নিজেকে জাহান্নামে নিক্ষেপ করবে। তখন আল্লাহ তা'আলা তার জন্য আগুনকে শীতল ও শান্তিময় করে দিবেন। দ্বিতীয় ব্যক্তি উঠে দাঁড়াবে কিন্তু নিজেকে জাহান্নামে নিক্ষেপ করবে না। আল্লাহ তা'আলা প্রশ্ন করবেনঃ তোমার সাখীর মতো তুমি নিজেকে জাহান্নামে ফেললে না কেন? সে বলবে, হে আল্লাহ! আমি আশা করি আপনি আমাকে জাহান্নাম হতে বের করে আনার পর আবার তাতে ফিরিয়ে দিবেন না। আল্লাহ তা'আলা বলবেন? তোমার আশা পূর্ণ হোক! তারপর আল্লাহ্ তা'আলার রহমতে তারা দু’জনই জান্নাতে চলে যাবে। যঈফ, মিশকাত (৫৬০৫), যঈফা (১৯৭৭) আবূ ঈসা বলেন, এ হাদীসের সনদ যঈফ। কারণ এটি রিশদীন ইবনু সাদের সূত্রে বর্ণিত। তিনি হাদীসবেত্তাদের মতে দুর্বল রাবী। এ হাদীসের অপর রাবী ইবনু আনউম আল-ইফরীকীও হাদীসবেত্তাদের মতে দুর্বল।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2600,
			"arabicnumber": 2600,
			"text": "২৬০০। ইমরান ইবনু হুসাইন (রাযিঃ) হতে বর্ণিত আছে যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমার আবেদনের কারণে আমার উম্মাতের এক দল জাহান্নাম থেকে মুক্তি পাবে। তাদের নাম হবে জাহান্নামী। সহীহঃ ইবনু মা-জাহ (৪৩১৫), বুখারী আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। আবূ রাজা আল-উতারিদীর নাম ইমরান ইবনু তাইম, মতান্তরে ইবনু মিলহান।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2601,
			"arabicnumber": 2601,
			"text": "২৬০১। আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমি জাহান্নামের মতো এমন কিছু দেখিনি যা হতে আত্মরক্ষাকারীগণ ঘুমে অচেতন এবং জান্নাতের মতো এমন কিছুও দেখিনি যার অন্বেষণকারীগণও ঘুমে অচেতন। হাসানঃ সহীহাহ (৯৫১) আবূ ঈসা বলেন, আমরা শুধুমাত্র ইয়াহইয়া ইবনু উবাইদুল্লাহর সূত্রে এ হাদীসটি জেনেছি। অধিকাংশ মুহাদ্দীসগণের মতে তিনি যঈফ। শু'বাহ তার সমালোচনা করেছেন। ইয়াহইয়া ইবনু উবাইদুল্লাহ, যিনি ইবনু মাওহাব তিনি মদীনার অধিবাসী।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2602,
			"arabicnumber": 2602,
			"text": "২৬০২। ইবনু আব্বাস (রাযিঃ) হতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ (মি'রাজের রাতে) আমি জান্নাতের মধ্যে উঁকি দিয়ে দেখতে পেলাম যে, এর বেশিরভাগ অধিবাসীই গারীব এবং জাহান্নামের মধ্যে উঁকি দিয়ে দেখতে পেলাম যে, এর বেশিরভাগ অধিবাসীই মহিলা। সহীহঃ যঈফার (২৮০০) নং হাদীসের অধীনে, বুখারী ও মুসলিম।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2603,
			"arabicnumber": 2603,
			"text": "২৬০৩। ইমরান ইবনু হুসাইন (রাযিঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ (মি'রাজের রাতে) আমি জাহান্নামে উঁকি দিয়ে দেখলাম যে, এর বেশিরভাগ অধিবাসীই মহিলা এবং জান্নাতে উঁকি দিয়ে দেখলাম যে, এর বেশিরভাগ অধিবাসীই গারীব। সহীহঃ দেখুন পূর্বের হাদীস আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। আবূ রাজা (রহঃ) হতে তিনি ইমরান ইবনু হুসাইন (রাযিঃ) সূত্রে আওফ (রাহঃ) এবং আবূ রাজা (রাহঃ) হতে তিনি ইবনু আব্বাস (রাযিঃ) সূত্রেও ‘আওফ (রহঃ) একই রকম বর্ণনা করেছেন। এই দু’টাে হাদীসের ব্যাপারে কোন মতানৈক্য নেই। সম্ভবতঃ আবূ রাজা উভয় সাহাবীর নিকট হতেই হাদীস শ্রবণ করেছেন। আবূ রাজা ইমরান (রাযিঃ) হতে এই সূত্রে আওফ (রাহঃ) ব্যতীত অন্যরাও উক্ত হাদীস বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2604,
			"arabicnumber": 2604,
			"text": "২৬০৪। নুমান ইবনু বাশীর (রাযিঃ) হতে বর্ণিত আছে যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তিকে জাহান্নামীদের মধ্যে সবচাইতে কম শাস্তি প্রদান করা হবে তার পায়ের তালুর নীচে দুটি জ্বলন্ত অঙ্গার রাখা হবে। তাতে তার মগজ পর্যন্ত টগবগ করে ফুটতে থাকবে। সহীহঃ সহীহাহ (১৬৮০), বুখারী ও মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। আবূ সাঈদ, আল-আব্বাস ইবনু আবদুল মুত্তালিব ও আবূ হুরাইরাহ (রাযিঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2605,
			"arabicnumber": 2605,
			"text": "২৬০৫। হারিসা ইবনু ওয়াহব আল-খুজাঈ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে বলতে শুনেছিঃ আমি কি তোমাদেরকে জানিয়ে দিব না যে, কারা জান্নাতী হবে? জান্নাতী তারা হবে যারা দুর্বল, অসহায় এবং যেসব ব্যক্তিকে দুর্বল মনে করা হয়। তারা আল্লাহ তা'আলার নামে (কোন বিষয়ে) শপথ করলে আল্লাহ তা'আলা অবশ্যই তা পূরণ করেন। আমি কি তোমাদেরকে জানিয়ে দিব না যে, কোন সব ব্যক্তি জাহান্নামী হবে? প্রত্যেক অবাধ্য, আহাম্মক ও অহংকারী (জাহান্নামী হবে)। সহীহঃ ইবনু মা-জাহ (৪১১৬), বুখারী ও মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2795,
			"arabicnumber": 2795,
			"text": "২৭৯৫। জারহাদ আল-আসলামী (রাযিঃ) হতে বর্ণিত, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মসজিদের মধ্যে জারহাদের পাশ দিয়ে গেলেন। সে সময় তার উরুদেশ উলঙ্গ অবস্থায় ছিল। তিনি বললেনঃ উরুদেশও আভরণীয় অঙ্গ। সহীহঃ ইরওয়াহ (১/২৯৭-২৯৮), মিশকাত (৩১১৪)। আবূ ঈসা বলেন, এ হাদীসটি হাসান। আমার মতে এর সনদসূত্র মুত্তাসিল (পরস্পর সংযুক্ত) নয়।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 19
			}
		}
	]
}