{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"43": "Chapters on Manners"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2736,
			"arabicnumber": 2736,
			"text": "২৭৩৬। আলী (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ এক মুসলিমের সাথে অন্য মুসলিমের ছয়টি সদ্ব্যবহারের বিষয় আছেঃ (১) তার সাথে দেখা হলে তাকে সালাম করবে, (২) সে কোন ব্যাপারে আহবান করলে তাতে সাড়া দিবে, (৩) সে হাঁচি দিলে উত্তর দিবে (তার আলহামদুলিল্লাহর উত্তরে বলবে ইয়ারহামুকাল্লাহ), (৪) সে রোগাক্রান্ত হলে তাকে দেখতে যাবে, (৫) সে ইন্তেকাল করলে তার জানাযায় শারীক হবে এবং (৬) নিজের জন্য যা ভালোবাসবে পরের জন্যও তাই ভালোবাসবে। যঈফ, ইবনু মাজাহ (১৪৩৩) এ অনুচ্ছেদে আবূ হুরাইরা, আবূ আইউব, বরাআ ও আবূ মাসউদ (রাঃ) হতেও হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, এ হাদীসটি হাসান। অন্য সূত্রেও রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এ হাদীস বর্ণিত আছে। কেউ কেউ আল-হারিস আল-আওয়াবের সমালোচনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2737,
			"arabicnumber": 2737,
			"text": "২৭৩৭। আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ এক মুমিনের জন্য আরেক মুমিনের উপর ছয়টি দায়িত্ব রয়েছেঃ (১) সে অসুস্থ হলে তাকে দেখতে যাবে, (২) মারা গেলে তার জানাযায় উপস্থিত হবে, (৩) ডাকলে তাতে সাড়া দিবে, (৪) তার সাথে দেখা হলে তাকে সালাম করবে, (৫) সে হাঁচি দিলে তার জবাব দিবে এবং (৬) তার অনুপস্থিতি কিংবা উপস্থিতি সকল অবস্থায় তার শুভ কামনা করবে। সহীহঃ সহীহাহ (৮৩২), মুসলিম অনুরূপ। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। মুহাম্মাদ ইবনু মূসা আল-মাখযুমী আল-মাদানী নির্ভরযোগ্য বর্ণনাকারী। আবদুল আযীয ইবনু মুহাম্মাদ ও ইবনু আবী ফুদাইক তার সূত্রে হাদীস বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2738,
			"arabicnumber": 2738,
			"text": "২৭৩৮। নাফি’ (রহঃ) হতে বর্ণিত, জনৈক ব্যক্তি ইবনু উমার (রাযিঃ)-এর পাশে হাঁচি দিযে বলল, “আলহামদুলিল্লাহি ওয়াসসালামু আলা রাসূলিল্লাহ\"। ইবনু উমর (রাযিঃ) বললেন, আমিও তো বলি, “আলহামদুলিল্লাহ ওয়াসসালামু আল রাসূলিল্লাহ\" (সমস্ত প্রশংসা আল্লাহ তা'আলার জন্য নিবেদিত এবং তার রাসূলের উপর শান্তি বর্ষিত হোক)। কিন্তু রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদেরকে এ রকম বলতে শিখাননি, বরং তিনি আমাদেরকে \"আলহামদুলিল্লাহ আল কুল্লি হাল” (সর্বাবস্থায় আল্লাহর প্রশংসা) বলতে শিখিয়েছেন। হাসানঃ মিশকাত (৪৭৪৪), ইরওয়াহ (৩/২৪৫)। আবূ ঈসা বলেন, এ হাদীসটি গারীব। আমরা এ হাদীসটি শুধুমাত্র যিয়াদ ইবনুর রাবী'র সূত্রেই জেনেছি।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2739,
			"arabicnumber": 2739,
			"text": "২৭৩৯। আবূ মূসা (রাযিঃ) হতে বর্ণিত, তিনি বলেন, ইয়াহুদীগণ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সামনে হাঁচি দিত এবং আশা করত যে, তিনি তাদের জন্য হাঁচির জবাবে বলবেনঃ ইয়ারহামুকুমুল্লাহ। কিন্তু তিনি বলতেনঃ ইয়াহুদীকুমুল্লাহু ওয়াইউসলিহু বা-লাকুম (আল্লাহ তা'আলা তোমাদেরকে হিদায়াত করুন এবং তোমাদের অবস্থার সংশোধন করুন)। সহীহঃ মিশকাত (৪৭৪০) আলী, আবূ আইয়ুব, সালিম ইবনু উবায়দ, আবদুল্লাহ ইবনু জাফার ও আবূ হুরাইরাহ (রাযিঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত রয়েছে। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2740,
			"arabicnumber": 2740,
			"text": "২৭৪০। সালিম ইবনু উবাইদ (রহঃ) হতে বর্ণিত আছে, তিনি একদল লোকের সঙ্গে কোন এক সফরে ছিলেন। তাদের একজন হাঁচি দিয়ে বলল, আসসালামু আলাইকুম। একথা শুনে সালিম বললেন, আলাইকা ওয়া আলা উম্মিকা (তোমার উপর ও তোমার মায়ের উপর শান্তি বর্ষিত হোক)। এ উত্তরে মনে হল যেন সে অসন্তুষ্ট হয়েছে। সুতরাং তিনি বললেন, এ প্রসঙ্গে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যা বলেছেন, আমি তো তাই বললাম জনৈক ব্যক্তি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সামনে হাঁচি দিয়ে বলেছিল, আসসালামু আলাইকুম। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছিলেনঃ আলাইকা ওয়া আলা উম্মিকা। কাজেই তোমাদের কেউ যেন হাঁচি দিয়ে বলে, আলহামদুলিল্লাহি রাব্বিল আলামীন। আর যে ব্যক্তি তার জবাব দিবে সে যেন বলে, ইয়ারহামুকাল্লাহ (আল্লাহ তা'আলা আপনাকে রাহাম করুন)। হাঁচিদাতা আবার বলবে, ইয়াগফিরুল্লাহু লানা ওয়ালাকুম (আল্লাহ আমাদেরকে ও আপনাদেরকে মাফ করুন)। যঈফ, ইরওয়া (৩/২৪৬, ২৪৭), মিশকাত তাহকীক ছানী (৪৭৪১) আবূ ঈসা বলেন, মানসূর হতে এ হাদীস বর্ণনার ক্ষেত্রে রাবীগণ মতের অমিল করেছেন। তারা হিলাল ইবনু ইসাফ ও সালিম (রাহঃ)-এর মাঝখানে আরো এক ব্যক্তির উল্লেখ করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2741,
			"arabicnumber": 2741,
			"text": "২৭৪১। আবূ আইয়ূব (রাযিঃ) হতে বর্ণিত আছে যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের মাঝে কেউ যখন হাঁচি দিবে তখন সে যেন বলে, আল-হামদুলিল্লাহ আল কুল্লি হাল। উত্তরদাতা বলবে, ইয়ারহামুকাল্লাহ।হাঁচিদাতা আবার বলবে, ইয়াহদীকুমুল্লাহু ওয়াইউসলিহু বালাকুম। সহীহঃ ইবনু মা-জাহ (৩৭১৫) মুহাম্মাদ ইবনুল মুসান্না-মুহাম্মাদ ইবনু জাফার হতে, তিনি শুবাহ হতে, তিনি আবূ লাইলা (রহঃ) হতে এই সনদসূত্রে উপরের হাদীসের একই রকম হাদীস বর্ণিত হয়েছে। শু'বাহও এ হাদীসটি ইবনু আবূ লাইলার সূত্রে একই রকম বর্ণনা করেছেন এবং বলেছেনঃ আবূ আইয়ূব (রাযিঃ) হতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সূত্রে বর্ণিত। ইবনু আবী লাইলা এই হাদীস বর্ণনার ক্ষেত্রে ইযতিরাব করেছেন। কখনো বলেছেনঃ আবূ আইয়ূব নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে, আবার কখনো বলেছেন, আলী (রাযিঃ)-রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সূত্রে বর্ণিত। মুহাম্মাদ ইবনু বাশশার ও মুহাম্মাদ ইবনু ইয়াহইয়া আস-সাকাফী আল-মারওয়ায়ী তারা উভয়ে ইয়াহইয়া ইবনু সাঈদ আল-কাত্তান হতে, তিনি ইবনু আবী লাইলা হতে, তিনি আলী (রাযিঃ) হতে, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এই সূত্রে পূর্বোক্ত হাদীসের মতো বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2742,
			"arabicnumber": 2742,
			"text": "২৭৪২। আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত আছে যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর সামনে দু'জন লোক হাঁচি দিল। তিনি তাদের একজনের হাঁচির জবাবে ইয়ারহামুকাল্লাহ' বললেন, কিন্তু অন্যজনের জবাব দিলেন না। তিনি যার হাঁচির জবাব দেননি সে প্রশ্ন করল, হে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম! আপনি তার হাঁচির জবাব দিলেন কিন্তু আমার হাঁচির জবাব দেননি। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ সে তো (আল-হামদু লিল্লাহ বলে) আল্লাহর শুকরিয়া আদায় করেছে, কিন্তু তুমি তো আল-হামদু লিল্লাহ' বলনি। সহীহঃ বুখারী ও মুসলিম। আবূ ঈসা বলেনঃ এ হাদীসটি হাসান সহীহ। হাদীসটি আবূ হুরাইরাহ (রাঃ)-এর সূত্রেও নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2743,
			"arabicnumber": 2743,
			"text": "২৭৪৩৷ ইয়াস ইবনু সালামাহ্ (রহঃ) হতে তার বাবার সূত্রে বর্ণিত, তিনি বলেন, জনৈক ব্যক্তি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সামনে হাঁচি দিল। আমিও তখন উপস্থিত ছিলাম। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ ইয়ারহামুকাল্লাহ। সে আরেকবার হাঁচি দিলে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ এ লোকটি সর্দিতে আক্রান্ত। সহীহঃ ইবনু মা-জাহ (৩৭১৪) আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর উপরোক্ত হাদীসের সমার্থবোধক হাদীস মুহাম্মাদ ইবনু বাশশার ইয়াহইয়া ইবনু সাঈদ হতে, তিনি ইকরিমাহ ইবনু আম্মার হতে, তিনি ইয়াস ইবনু সালামা হতে তার বাবার বর্ণনা করেছেন। তবে বর্ণনায় তৃতীয়বার হাঁচি দেয়ার পর তিনি বলেছেনঃ তুমি সর্দিতে আক্রান্ত। ইবনুল মুবারাকের হাদীসের চাইতে এ হাদীসটি অনেক বেশি সহীহ। শু'বাহ (রহঃ) ইকরিমাহ ইবনু আম্মারের সূত্রে ইয়াহইয়া ইবনু সাঈদের হাদীসের একই রকম হাদীস বর্ণনা করেছেন। আহমাদ ইবনুল হাকাম আল-বাসরী-মুহাম্মাদ ইবনু জাফার হতে, তিনি শুবাহ হতে, তিনি ইকরিমাহ ইবনু আম্মার (রহঃ) হতে এই সূত্রেও উক্ত হাদীস অনুরূপ বর্ণনা করেছেন। আবদুর রাহমান ইবনু মাহদী ইকরিমা ইবনু আম্মার হতে ইবনু মুবারাকের বর্ণনার মতই বর্ণনা করেছেন। তাতে আছে যে, তৃতীয়বারে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তুমি সর্দিতে আক্রান্ত।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2744,
			"arabicnumber": 2744,
			"text": "২৭৪৪। উমার ইবনু ইসহাক ইবনু আবূ তালহা (রহঃ)-এর নানা বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তিনবার পর্যন্ত হাঁচির উত্তর দাও। এরপরও সে যদি হাঁচি দেয় তবে তুমি চাইলে তার উত্তর দিতেও পার নাও দিতে পার। যঈফ, যঈফা (৪৮৩০) আবূ ঈসা বলেন, এ হাদীসটি গারীব এবং এর সনদসূত্র অপরিচিত।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2745,
			"arabicnumber": 2745,
			"text": "২৭৪৫। আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত আছে যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন হাঁচি দিতেন, তখন তার হাত কিংবা কাপড় দ্বারা মুখ ঢেকে রাখতেন এবং এর মাধ্যমে তার আওয়াজ নীচু করতেন। হাসান সহীহঃ রাওযুন নায়ীর (১১০৯)। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2746,
			"arabicnumber": 2746,
			"text": "২৭৪৬। আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত আছে যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ হাঁচি আল্লাহ তা'আলার পক্ষ থেকে আর হাই তোলা শাইতানের পক্ষ থেকে। সুতরাং তোমাদের মাঝে কেউ হাই তুললে সে যেন মুখের উপর হাত রাখে। আর সে যখন আহ্ আহ্ বলে, তখন শয়তান তার ভিতর হতে হাসতে থাকে। আল্লাহ তা’আলা হাচি পছন্দ করেন এবং হাই তোলা অপছন্দ করেন। কাজেই কেউ যখন আহ আহ শব্দে হাই তোলে, তখন শাইতান তার ভিতর হতে হাসতে থাকে। হাসান সহীহঃ তা’লীক আলা ইবনে খুযাইমাহ (৯২১, ৯২২), ইরওয়াহ (৭৭৯), বুখারী অনুরূপ। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2747,
			"arabicnumber": 2747,
			"text": "২৭৪৭। আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আল্লাহ তা’আলা হাঁচি পছন্দ করেন এবং হাই তোলা অপছন্দ করেন। সুতরাং তোমাদের মাঝে কেউ হাঁচি দিয়ে আলহামদুলিল্লাহ বলার সময় সকল শ্রোতার জন্য ইয়ারহামুকাল্লাহ বলা খুবই জরুরী হয়ে যায়। আর তোমাদের মাঝে কারও হাই উঠার সময় যথাসম্ভব সে যেন তা ফিরিয়ে রাখে এবং আহ আহ না বলে। কেননা এটা শাইতানের পক্ষ হতে এবং সে তাতে হাঁসতে থাকে। সহীহঃ ইরওয়াহ (৭৭৬), বুখারী। আবূ ঈসা বলেন, এ হাদীসটি সহীহ। ইবনু আজলানের সূত্রে বর্ণিত হাদীসের চাইতে এ হাদীসটি অনেক বেশি সহীহ। সাঈদ আল-মাকবুরী হতে হাদীস বর্ণনার ক্ষেত্রে ইবনু আবূ যিব (রাহঃ) ইবনু আজলানের চাইতে অনেক হিফাযাতকারী ও নির্ভরযোগ্য। আমি তিরমিযী আবূ বাকর আল আত্তার আল বাসরীকে আলী ইবনুল মাদীনীর সুত্রে আলোচনা করতে শুনেছি, তিনি ইয়াহইয়া ইবনু সাঈদকে বলতে শুনেছেন, মুহাম্মাদ ইবনু আজলান বলেন, সাঈদ আল-মাকবুরী তার রিওয়ায়াতসমূহের কতগুলো আবূ হুরাইরাহ (রাযিঃ) হতে সরাসরি বর্ণনা করেছেন এবং কতগুলো জনৈক ব্যক্তির সূত্রে আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণনা করেছেন। তাই আমার নিকট এগুলো একটি অন্যটির সাথে মিলে যাবার কারণে আমি সবগুলো রিওয়ায়াত সাঈদ-আবূ হুরাইরাহ (রাযিঃ) হতে এই সূত্রে বর্ণনা করেছি।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2748,
			"arabicnumber": 2748,
			"text": "২৭৪৮। আদী ইবনু সাবিত (রহঃ) হতে পালাক্রমে তার পিতা ও তার দাদার সূত্রে মারফু হিসেবে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ নামাযের মধ্যে হাঁচি, তন্দ্রা ও হাই তোলা এবং হায়িয, বমি ও নাক দিয়ে রক্ত পড়া শাইতানের পক্ষ হতে। যঈফ, মিশকাত (৯৯৯) আবূ ঈসা বলেন, এ হাদীসটি গারীব। আমরা শুধুমাত্র শারীক হতে ইয়াকযান সূত্রে এ হাদীস জেনেছি। আমি মুহাম্মদ ইবনু ইসমাঈল (বুখারী)-কে আদী ইবনু সাবিত-তার পিতা-তার দাদা' এই সনদসূত্র প্রসঙ্গে প্রশ্ন করলাম। আমি বললাম, আদীর দাদার নাম কি? তিনি বললেন, আমি জানি না। ইয়াহইয়া ইবনু মাঈন প্রসঙ্গে উল্লেখ আছে যে, তিনি আদীর দাদার নাম দীনার বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2749,
			"arabicnumber": 2749,
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2750,
			"arabicnumber": 2750,
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2751,
			"arabicnumber": 2751,
			"text": "২৭৫১। ওয়াহহাব ইবনু হুযাইফাহ্ (রাযিঃ) হতে বর্ণিত আছে যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ প্রত্যেক ব্যক্তি নিজ আসনের বেশি হকদার। সে ব্যক্তি কোন প্রয়োজনে বেরিয়ে গিয়ে আবার ফিরে আসলে এ জায়গার জন্য সেই বেশি হকদার। সহীহঃ ইরওয়াহ (২/২৫৮) আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ গারীব। আবূ বাকরাহ, আবূ সাঈদ ও আবূ হুরাইরাহ (রাযিঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2752,
			"arabicnumber": 2752,
			"text": "২৭৫২। আবদুল্লাহ ইবনু আমর (রাযিঃ) হতে বর্ণিত আছে যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ অনুমতি ব্যতীত দুজন লোককে ফাঁক করে বসা কারো জন্য বৈধ নয়। হাসান সহীহঃ মিশকাত তাহকীক সানী (৭৪০৩) আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। এ হাদীসটি আমর ইবনু শু'আইব (রাহঃ) হতে আমির আল-আহওয়ালও বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2753,
			"arabicnumber": 2753,
			"text": "২৭৫৩। আবূ মিজলায (রহঃ) হতে বর্ণিত আছে, কোন এক লোক বৈঠকের মাঝখানে বসে পড়লে হুযাইফা (রাঃ) বলেন, যে ব্যক্তি বৈঠকের মাঝখানে বসে, সে মুহাম্মাদের ভাষায় লানত প্রাপ্ত অথবা আল্লাহ মুহাম্মাদের জবানীতে তাকে অভিশাপ দিয়েছেন। যঈফ, যঈফা (৬৩৮), মিশকাত (৪৭২২) আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। আবূ মিজলাযের নাম লাহিক ইবনু হুমাইদ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2754,
			"arabicnumber": 2754,
			"text": "২৭৫৪। আনাস (রাযিঃ) হতে বর্ণিত, তিনি বলেন, সাহাবীদের নিকট রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর চাইতে বেশি প্রিয় ব্যক্তি আর কেউ ছিলেন না। অথচ তারা তাকে দেখে দাঁড়াতেন না। কেননা তারা জানতেন যে, তিনি এটা পছন্দ করেন না। সহীহঃ মুখতাসার শামা-য়িল (২৮৯), যঈফা ৩৪৬ নং হাদীসের অধীনে, মিশকাত (৪৬৯৮), নাকদুল কাত্তানী পৃষ্ঠা (৫১)। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ, এই সূত্রে গারীব।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2755,
			"arabicnumber": 2755,
			"text": "২৭৫৫। আবূ মিজলায (রহঃ) হতে বর্ণিত, তিনি বলেন, মু'আবিয়াহ (রাযিঃ) বাইরে বের হলে তাকে দেখে আবদুল্লাহ ইবনুয যুবাইর ও ইবনু সাফওয়ান দাঁড়িয়ে গেলেন। তিনি বললেন, তোমরা দু’জনেই বস। আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছিঃ এতে যে লোক আনন্দিত হয় যে, মানুষ তার জন্য মূর্তির মতো দাড়িয়ে থাকুক, সে যেন জাহান্নামে তার বাসস্থান নির্দিষ্ট করে নেয়। সহীহঃ মিশকাত (৪৬৯৯) আবূ উমামাহ্ (রাযিঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, এ হাদীসটি হাসান। হান্নাদ-আবূ উসামাহ হতে, তিনি হাবীব ইবনুশ শাহীদ হতে, তিনি আবূ মিজলায হতে, তিনি মু'আবিয়াহ (রাযিঃ) হতে তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এই সূত্রে উপরোক্ত হাদীসের সমার্থবোধক হাদীস বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2756,
			"arabicnumber": 2756,
			"text": "২৭৫৬। আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ পাঁচ প্রকার কাজ ফিতরাতের (স্বভাব ধর্মের) অন্তর্গত। (১) নাভীর নীচের লোম কেটে ফেলা, (২) খৎনাহ্ করা, (৩) গোঁফ কাটা, (৪) বগলের চুল উপড়িয়ে ফেলা এবং (৫) নখ কাটা। সহীহঃ ইবনু মা-জাহ (২৯২), বুখারী ও মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2757,
			"arabicnumber": 2757,
			"text": "২৭৫৭। আয়িশাহ্ (রাযিঃ) হতে বর্ণিত আছে যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ দশ প্রকার কাজ ফিত্রাতের (স্বভাব ধর্মের) অন্তর্গতঃ (১) গোঁফ কাটা, (২) দাঁড়ি লম্বা করা, (৩) মিসওয়াক করা, (৪) নাকে পানি দেয়া, (৫) নখ কাটা, (৬) আঙ্গুলের গ্রন্থিগুলো ধোয়া, (৭) বগলের লোম উপড়িয়ে ফেলা, (৮) নাভীর নিম্নাংশের চুল কামানো এবং (৯) পানি দ্বারা শৌচ করা। যাকারিয়াহ্ (রহঃ) বলেন, মুসআব (রহঃ) বলেছেন, আমি দশম কাজটি ভুলে গেছি। তবে সম্ভবতঃ সেটা হবে কুলি করা। সহীহঃ ইবনু মা-জাহ (২৯৩), মুসলিম। আবূ ঈসা বলেন, ইনতিকাসুল মা' অর্থ পানি দিয়ে শৌচ করা। আম্মার ইবনু ইয়াসির, ইবনু উমার ও আবূ হুরাইরাহ (রাযিঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, এ হাদীসটি হাসান।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2758,
			"arabicnumber": 2758,
			"text": "২৭৫৮। আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত আছে যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সাহাবীদের জন্য চল্লিশ দিন অন্তর একবার নখ কাটা, গোঁফ খাটো করা এবং নাভীর নিম্নাংশের লোম কামানোর জন্য সময় নির্ধারণ করেছেন। সহীহঃ ইবনু মা-জাহ (২৯৫), মুসলিম।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2759,
			"arabicnumber": 2759,
			"text": "২৭৫৯। আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত, তিনি বলেন, আমাদের জন্য গোঁফ ছাটা, নখ কাটা, নাভীর নিম্নাংশের লোম কামানো এবং বগলের লোম উপড়িয়ে ফেলার জন্য সময় নির্ধারণ করা হয়েছে এমনভাবে যে, তা যেন চল্লিশ দিনের বেশি রেখে না দেয়া হয়। সহীহঃ দেখুন পূর্বের হাদীস। আবূ ঈসা বলেন, প্রথমোক্ত হাদীসের চাইতে এই হাদীসটি অনেক বেশি সহীহ। হাদীসবিশারদদের মতে সাদাক্কাহ ইবনু মূসা প্রখর স্মৃতিশক্তির অধিকারী নন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2760,
			"arabicnumber": 2760,
			"text": "২৭৬০। ইবনু আব্বাস (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার গোঁফ ছেটে খাটো করতেন এবং বলতেনঃ দয়াময়ের প্রিয় বন্ধু ইবরাহীম (আঃ) এরকম করতেন। সনদ দুর্বল আবূ ঈসা বলেন, এ হাদীসটি হাসান গারীব।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2761,
			"arabicnumber": 2761,
			"text": "২৭৬১। যাইদ ইবনু আরকাম (রাযিঃ) হতে বর্ণিত আছে যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তি গোঁফ খাটো করে না, সে আমাদের (সুন্নাতের) অনুসারী নয়। সহীহঃ রাওযুন নায়ীর (৩১৩), মিশকাত (৪৪৩৮)। মুগীরাহ ইবনু শুবাহ (রাযিঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। মুহাম্মাদ ইবনু বাশশার-ইয়াহইয়া ইবনু সাঈদ হতে, তিনি ইউসুফ ইবনু সুহাইব (রাহঃ) হতে এই সনদে উপরোক্ত হাদীসের সমার্থবোধক হাদীস বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2762,
			"arabicnumber": 2762,
			"text": "২৭৬২। আমর ইবনু শুআইব (রহঃ) হতে পর্যায়ক্রমে তার পিতা ও দাদার সূত্রে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দৈঘ্যে-প্রস্থে দু দিকে তার দাঁড়ি ছাটতেন। মাওযু, যঈফা (২৮৮) আবূ ঈসা বলেন, এ হাদীসটি গারীব। আমি মুহাম্মাদ ইবনু ইসমাঈল (আল-বুখারী)-কে বলতে শুনেছি, উমার ইবনু হারূনের বর্ণিত হাদীস গ্রহণ যোগ্য বলা যায়। “রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার দাঁড়ির দৈর্ঘ্য-প্রস্থে উভয় দিকে ছাঁটতেন” এই হাদীস ছাড়া তার অন্য কোন রিওয়ায়াত সম্পর্কে আমার জানা নাই, যার কোন বুনিয়াদ নাই বা যা তিনি এককভাবে বর্ণনা করেছেন। আমরা শুধুমাত্র ইবনু হারূনের রিওয়ায়াত হিসেবে উপরোক্ত হাদীস জেনেছি। আমি ইমাম বুখারীকে উমার ইবনু হারূন সম্পর্কে উত্তম অভিমত মনে ধারণ করতে দেখেছি। আবূ ঈসা বলেন, আমি কুতাইবাকে বলতে শুনেছি, উমার ইবনু হারূন ছিলেন হাদীসের ধারক। তিনি বলতেন, “কথা ও কাজের সমষ্টি হল ঈমান” (আল-ঈমান কাওল ওয়া আমল)। কুতাইবা বলেন, ওয়াকী ইবনু জাররাহ আমাদেরকে জানিয়েছেন এক ব্যক্তির সূত্রে, তিনি সাওর ইবনু ইয়াযীদের সূত্রেঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাইফবাসীদের বিপক্ষে মিনজানীক (পাথর নিক্ষেপক যন্ত্র) স্থাপন করেছেন। কুতাইবা বলেন, আমি ওয়াকীকে প্রশ্ন করলাম, ইনি কে? তিনি বলেন, আপনাদের সঙ্গী উমার ইবনু হারূন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Mawdu"
				},
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2763,
			"arabicnumber": 2763,
			"text": "২৭৬৩। ইবনু উমর (রাযিঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা গোঁফ খাটো কর এবং দাঁড়ি লম্বা কর। সহীহঃ আদাবুয যিফাফ নতুন সংস্করণ (২০৯) আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2764,
			"arabicnumber": 2764,
			"text": "২৭৬৪। ইবনু উমর (রাযিঃ) হতে বর্ণিত আছে যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদেরকে গোঁফ খাটো করতে এবং দাঁড়ি লম্বা করতে আদেশ করেছেন। সহীহঃ দেখুন পূর্বের হাদীস, বুখারী ও মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। আবূ বকর ইবনু নাফি নির্ভরযোগ্য বর্ণনাকারী এবং ইবনু উমার (রাযিঃ)-এর মুক্তদাস। উমার ইবনু নাফি একজন নির্ভরযোগ্য বর্ণনাকারী। কিন্তু তার অপর মুক্তদাস 'আবদুল্লাহ ইবনু নাফি হাদীস শাস্ত্রে দুর্বল।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2765,
			"arabicnumber": 2765,
			"text": "২৭৬৫। আব্বাদ ইবনু তামীম (রহঃ) হতে তার চাচার সূত্রে বর্ণিত, তিনি মসজিদের মধ্যে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে এক পায়ের উপর অন্য পা (ভাজ করে হাঁটু দাঁড় করিয়ে) রেখে চিৎ হয়ে শুয়ে থাকতে দেখেছেন। সহীহঃ বুখারী ও মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। আব্বাদ ইবনু তামীমের চাচার নাম ‘আবদুল্লাহ ইবনু যাইদ ইবনু আসিম আল-মাযিনী।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2766,
			"arabicnumber": 2766,
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2767,
			"arabicnumber": 2767,
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2768,
			"arabicnumber": 2768,
			"text": "২৭৬৮। আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জনৈক ব্যক্তিকে পেটের উপর উপুড় হয়ে শুয়ে থাকতে দেখে বললেনঃ আল্লাহ তা'আলা এ রকম শোয়া পছন্দ করেন না। হাসান সহীহঃ মিশকাত (৪৭১৮, ৪৭১৯) তিহফা ও ইবনু উমার (রাযিঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, ইয়াহইয়া ইবনু আবী কাসীর উক্ত হাদীস আবূ সালামা হতে, তিনি ইয়াঈশ ইবনু তিহফা হতে, তিনি তার বাবার সুত্রে বর্ণনা করেছেন। তিহফার স্থলে তিখফা উচ্চারণও আছে। তবে তিহফা-ই সঠিক। আবার তিগফা উচ্চারণও আছে। কিছু সংখ্যক হাদীসের হাফিয বলেন যে, তিখফা উচ্চারণই যথার্থ। ইয়াঈশ সাহাবীদের অন্তর্ভুক্ত।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2769,
			"arabicnumber": 2769,
			"text": "২৭৬৯। বাহয ইবনু হাকীম (রহঃ) হতে পর্যায়ক্রমে তার বাবা ও তার দাদার সূত্রে বর্ণিত, তিনি বলেন, আমি প্রশ্ন করলাম, হে আল্লাহর রাসূল! আমাদের লজ্জাস্থান কতটুকু ঢেকে রাখব এবং কতটুকু খোলা রাখতে পারব? তিনি বললেনঃ তোমার স্ত্রী ও দাসী ছাড়া সকলের দৃষ্টি হতে তোমার লজ্জাস্থান হিফাযাত করবে। তিনি আবার প্রশ্ন করলেন, পুরুষেরা একত্রে অবস্থানরত থাকলে? তিনি বললেনঃ যতদূর সম্ভব কেউ যেন তোমার আভরণীয় স্থান দেখতে না পারে তুমি তাই কর। আমি আবার প্রশ্ন করলাম, মানুষ তো কখনো নির্জন অবস্থায়ও থাকে। তিনি বললেনঃ আল্লাহ তা'আলা তো লজ্জার ক্ষেত্রে বেশি হাকদার। হাসানঃ ইবনু মা-জাহ (১৯২০) আবূ ঈসা বলেন, এ হাদীসটি হাসান। বাহযের দাদার নাম মুআবিয়াহ ইবনু হাইদাহ আল-কুশাইরী। আল-জুরাইরী হাকীম ইবনু মু'আবিয়ার সূত্রে হাদীসটি বর্ণনা করেছেন। তিনি হলেন বাহযের বাবা।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2770,
			"arabicnumber": 2770,
			"text": "২৭৭০। জাবির ইবনু সামুরাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে তার বাম পার্শ্বদেশে বালিশে হেলান দিয়ে শুয়ে থাকতে দেখেছি। সহীহঃ মুখতাসার শামা-য়িল (১০৪) আবূ ঈসা বলেন, এ হাদীসটি হাসান গারীব। একাধিক বর্ণনাকারী ইসরাঈল হতে, তিনি সিমাক হতে তিনি জাবির ইবনু সামুরাহ (রাযিঃ) হতে এ হাদীসটি বর্ণনা করেছেন, তাতে বাম “পার্শ্বদেশ” কথাটুকু নেই।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2771,
			"arabicnumber": 2771,
			"text": "২৭৭১। জাবির ইবনু সামুরাহ (রাযিঃ) হতে বর্ণিত, তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -কে বালিশে হেলান দিয়ে শুয়ে থাকতে দেখেছি। সহীহঃ দেখুন পূর্বের হাদীস। আবূ ঈসা বলেন, এ হাদীসটি সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2772,
			"arabicnumber": 2772,
			"text": "২৭৭২। আবূ মাসউদ (রাযিঃ) হতে বর্ণিত আছে যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন ব্যক্তির প্রভাবাধীন এলাকায় কেউ ইমামতি করবে না এবং তার বাড়ীতে তার নির্দিষ্ট আসনে তার অনুমতি ব্যতীত বসবে না। সহীহঃ ইরওয়াহ (৪৯৪), সহীহ আবূ দাউদ (৫৯৪)। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2773,
			"arabicnumber": 2773,
			"text": "২৭৭৩। বুরাইদাহ (রাযিঃ) হতে বর্ণিত, তিনি বলেন, কোন একদিন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (কোথাও) হেঁটে যাচ্ছিলেন। তখন জনৈক ব্যক্তি একটি গাধা সাথে নিয়ে এসে বলল, হে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম! আপনি আরোহণ করুন, এবং সে পিছনে সরে গেল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ না, তুমি পিছনে যেও না, তুমি তোমার বাহনের সামনে বসার অধিকার, তবে আমার জন্য স্বেচ্ছায় ছেড়ে দিলে ভিন্ন কথা। লোকটি বলল, আমি তা আপনাকে দিয়ে দিলাম। বর্ণনাকারী বলেন, তারপর তিনি সাওয়ার হলেন। সহীহঃ মিশকাত (৩৯১৮), ইরওয়াহ (২/২৫৭)। আবূ ঈসা বলেন, এ হাদীসটি হাসান এই সূত্রে গারীব। কাইস ইবনু সাদ ইবনু উবাদা (রাযিঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 2774,
			"arabicnumber": 2774,
			"text": "২৭৭৪। জাবির (রাযিঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম প্রশ্ন করলেনঃ তোমাদের চাদর আছে কি? আমি বললাম, আমরা চাদর কোথায় পাব? তিনি বললেনঃ খুব শীঘ্রই তা তোমাদের নিকট থাকবে। জাবির (রাযিঃ) বলেন, আমি আমার স্ত্রীকে বললাম, আমার নিকট হতে তোমার চাদরটি সরিয়ে নাও। সে বলল, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কি বলেননি যে, অচিরেই তোমাদের নিকট চাদর থাকবে? তিনি (জাবির) বলেন, এরপর আমি তাকে এ কথা বলা হতে বিরত হলাম। সহীহঃ বুখারী ও মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 2775,
			"arabicnumber": 2775,
			"text": "২৭৭৫। ইয়াস ইবনু সালামাহ্ (রহঃ) হতে তার বাবার সূত্রে বর্ণিত, তিনি বলেন, কোন একদিন আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর আশ-শাহবাহ নামক খচ্চরটি টেনে নিয়ে যাচ্ছিলাম। হাসান ও হুসাইন (রাযিঃ) তার সামনে-পিছনে বসা ছিলেন। আমি সেটা টেনে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর হুজরার নিকটে নিয়ে গেলাম। হাসানঃ মুসলিম (৭/১৩০) ইবনু আব্বাস ও আবদুল্লাহ ইবনু জাফার (রাযিঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ এই সূত্রে গারীব।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 2776,
			"arabicnumber": 2776,
			"text": "২৭৭৬। জারীর ইবনু ‘আবদুল্লাহ (রাযিঃ) হতে বর্ণিত, তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে (কারো প্রতি) হঠাৎ দৃষ্টি পড়া বিষয়ে প্রশ্ন করলাম। তিনি আমাকে দৃষ্টি ফিরিয়ে নিতে আদেশ করলেন। সহীহঃ হিজাবুল মারয়াহ (৩৫), সহীহ আবী দাউদ (১৮৬৪), মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। আবূ যুর'আর নাম হরিম।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 2777,
			"arabicnumber": 2777,
			"text": "২৭৭৭। বুরাইদাহ (রাযিঃ) হতে মারফু' হিসেবে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ হে ‘আলী! বারবার (অননুমোদিত জিনিসের প্রতি) তাকাবে না। তোমার প্রথম দৃষ্টি জায়িয (ও ক্ষমাযোগ্য) হলেও পরের দৃষ্টি (ক্ষমাযোগ্য) নয়। হাসানঃ হিজাবুল মারয়াহ (৩৪), সহীহ আবী দাউদ (১৮৬৫)। আবূ ঈসা বলেন, এ হাদীসটি হাসান গারীব। আমরা এটি শুধু শারীকের রিওয়ায়াত হিসেবে জেনেছি।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 2778,
			"arabicnumber": 2778,
			"text": "২৭৭৮। উম্মু সালামা (রাঃ) বলেন যে, তিনি ও মাইমূনা (রাঃ) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের পাশে হাযির ছিলেন। তিনি বলেন, আমরা দু'জন তার নিকটে অবস্থানরত থাকতেই ইবনু উম্মু মাকতুম (রাঃ) তার নিকট এলেন। এটা পর্দার নির্দেশ অবতীর্ণ হওয়ার পরের ঘটনা। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমরা উভয়ে তার থেকে পর্দা কর। আমি (উম্মু সালামা) বললাম, হে আল্লাহর রাসূল! তিনি কি অন্ধ নন? তিনি তো আমাদেরকে দেখতেও পারছেন না চিনতেও পারছেন না। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তোমরাও কি অন্ধ, তোমরাও কি তাকে দেখতে পাচ্ছ না। যঈফ, মিশকাত (৩১১৬), ইরওয়া (১৮০৬) আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 2779,
			"arabicnumber": 2779,
			"text": "২৭৭৯। আমর ইবনুল আস (রাযিঃ)-এর মুক্তদাস (আবূ কাইস 'আবদুর রাহমান ইবনু সাবিত) হতে বর্ণিত, কোন একদিন আমর ইবনুল \"আস (রাযিঃ) আসমা বিনতু উমাইসের নিকট যাবার অনুমতি প্রার্থনার জন্য তাকে আলী (রাযিঃ)-এর নিকট পাঠান। তিনি তাকে অনুমতি দিলেন। তিনি (আমর) যখন প্রয়োজনীয় আলাপ শেষ করলেন, তখন উক্ত গোলাম এ প্রসঙ্গে আমর ইবনুল আস (রাযিঃ)-কে প্রশ্ন করল। তিনি বললেন,রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম স্বামীদের অনুমতি ব্যাতিত তাদের স্ত্রীদের নিকট যেতে আমাদেরকে নিষেধ করেছেন। সহীহঃ আদাবুয যিফাফ নতুন সংস্করণ (২৮২-২৮৩) উকবা ইবনু আমির, আবদুল্লাহ ইবনু আমর ও জাবির (রাযিঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 2780,
			"arabicnumber": 2780,
			"text": "২৭৮০। উসামাহ্ ইবনু যাইদ ও সাঈদ ইবনু যাইদ ইবনু আমর ইবনু নুফাইল (রাযিঃ) হতে বর্ণিত আছে যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমার পরে (মানুষের মাঝে) পুরুষের জন্য স্ত্রীলোকের ফিতনার চাইতে মারাত্মক ক্ষতিকর ফিতনা আর রেখে যাচ্ছি না। সহীহঃ সহীহাহ (২৭০১), বুখারী ও মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। উক্ত হাদীস সুলাইমান (রাযিঃ) হতে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এই সূত্রে একাধিক নির্ভরযোগ্য বর্ণনাকারী বর্ণনা করেছেন। তারা এই সনদসূত্রে সাঈদ ইবনু যাইদ ইবনু 'আমর ইবনু নুফাইলের উল্লেখ করেননি। আল-মুতামির ব্যতীত অন্য কোন বর্ণনাকারী উপরোক্ত সনদে উসামা ইবনু যাইদ ও সাঈদ ইবনু যাইদ (রাযিঃ)-এর উল্লেখ করেছেন বলে আমাদের জানা নেই। আবূ সাঈদ (রাযিঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। ইবনু আবী উমার হতে, তিনি উসামা ইবনু যাইদ হতে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে অনুরূপ বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 2781,
			"arabicnumber": 2781,
			"text": "২৭৮১। হুমাইদ ইবনু আবদুর রহমান (রাহঃ) হতে বর্ণিত আছে যে, তিনি মু'আবিয়াহ (রাযিঃ)-কে মদীনায় এক ভাষণে বলতে শুনেছেনঃ হে মদীনাবাসীগণ! তোমাদের আলিমগণ কোথায়? আমি তো রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে এসব কুসসা' (অন্যের চুল) ব্যবহার করতে নিষেধ করতে শুনেছি। তিনি আরো বলতেনঃ বনী ইসরাঈলগণ তখনি ধ্বংস হয়েছে, যখন তাদের রমণীগণ কুসসা (অপরের চুল) ব্যবহার শুরু করে। সহীহঃ গাইয়াতুল মারাম (১০০), বুখারী ও মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। মু'আবিয়াহ (রাযিঃ) হতে বিভিন্ন সূত্রে এ হাদীসটি বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 2782,
			"arabicnumber": 2782,
			"text": "২৭৮২। আবদুল্লাহ (রাযিঃ) হতে বর্ণিত আছে যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এমন সব নারীর উপর লানত করেছেন, যারা অঙ্গে উল্কি আঁকে ও অন্যকে দিয়ে উল্কি আঁকায় এবং সৌন্দর্যের জন্য ভ্রুর চুল উপড়িয়ে আল্লাহ তা'আলার সৃষ্টিকে পরিবর্তন করে। সহীহঃ আদাবুয যিফাফ (২০২-২০৪) নতুন সংস্করণ। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। শুবাহ ও অন্যান্য হাদীস বিশারদগণ এ হাদীসটি মানসূর হতে বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 2783,
			"arabicnumber": 2783,
			"text": "২৭৮৩। ইবনু উমর (রাযিঃ) হতে বর্ণিত আছে যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে নারী পরচুলা বানায় এবং যে তা ব্যবহার করে, যে উল্কি আঁকে এবং অন্যকে দিয়ে আঁকায়, আল্লাহ তা’আলা তাদেরকে লা'নাত করেছেন। নাফি’ (রাহঃ) বলেন, উল্কি আঁকা হয় সাধারণতঃ নীচের মাড়িতে। সহীহঃ ইবনু মা-জাহ (১৯৮৭), বুখারী ও মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। আয়িশাহ, মাকিল ইবনু ইয়াসার, আসমা বিনতু আবূ বাকর ও ইবনু আব্বাস (রাযিঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। মুহাম্মাদ ইবনু বাশশার-ইয়াহইয়া ইবনু সাঈদ হতে, তিনি উবাইদুল্লাহ ইবনু উমার হতে, তিনি নাফি' হতে, তিনি ইবনু উমর (রাযিঃ) হতে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এই সূত্রে উপরোক্ত হাদীসের একই রকম হাদীস বর্ণনা করেছেন। এই সূত্রে বর্ণনাকারীগণ নাফি (রাহঃ)-এর বক্তব্যটুকু উল্লেখ করেননি। আবূ ঈসা বলেন, এই হাদীসটিও হাসান সহীহ।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 2784,
			"arabicnumber": 2784,
			"text": "২৭৮৪। ইবনু আব্বাস (রাযিঃ) হতে বর্ণিত, তিনি বলেন, যেসব নারী পুরুষের বেশ ধারণ করে এবং যেসব পুরুষ নারীদের বেশ ধারণ করে তাদেরকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অভিসম্পাত করেছেন। সহীহঃ ইবনু মা-জাহ (১৯০৪), বুখারী। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 2785,
			"arabicnumber": 2785,
			"text": "২৭৮৫। ইবনু আব্বাস (রাযিঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নারীর বেশধারী পুরুষদেরকে এবং পুরুষের বেশধারী নারীদেরকে লা’নাত করেছেন। সহীহঃ দেখুন পূর্বের হাদীস, বুখারী ও মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। আয়িশাহ (রাযিঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 2786,
			"arabicnumber": 2786,
			"text": "২৭৮৬। আবূ মূসা (রাযিঃ) হতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ প্রতিটি চোখই যিনাকরী। কোন নারী সুগন্ধি মেখে কোন মজলিসের পাশ দিয়ে গেলে সে এমন এমন অর্থাৎ যিনাকারিণী। হাসানঃ তাখরাজুল ঈমান লি আবী উবাইদ (৯৬/১১০), তাখরাজুল মিশকাত (৬৫), হিজাবুল মারয়াহ (৬৪)। আবূ হুরাইরাহ (রাযিঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 2787,
			"arabicnumber": 2787,
			"text": "২৭৮৭। আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ পুরুষের সুগন্ধি এমন হবে যার সুগন্ধ প্রকাশ পায় কিন্তু রং গোপন থাকে এবং নারীর সুগন্ধি এমন হবে যার রং প্রকাশ পায় কিন্তু সুগন্ধ গোপন থাকে। সহীহঃ মিশকাত (৪৪৪৩), মুখতাসার শামা-য়িল (১৮৮), আর-রাদু আলাল কিত্তানী পৃঃ (১১)। ‘আলী ইবনু হুজর-ইসমাঈল ইবনু ইবরাহীম হতে, তিনি আল-জুরাইরী হতে, তিনি আবু নাযরাহ হতে, তিনি আত তুফাবী হতে, তিনি আবু হুরাইরাহ (রাযিঃ) হতে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে, এই সূত্রে উক্ত মর্মে একই রকম হাদীস বর্ণনা করেছেন। আবূ ঈসা বলেন, এ হাদীসটি হাসান। এই হাদীসের মাধ্যমে আমরা আত-তুফাবীর সাথে পরিচিত কিন্তু তার নাম আমাদের নিকট অজ্ঞাত। ইসমাঈল ইবনু ইবরাহীমের হাদীসটি অনেক বেশি পরিপূর্ণ ও দীর্ঘ। ইমরান ইবনু হুসাইন (রাযিঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 2788,
			"arabicnumber": 2788,
			"text": "২৭৮৮। ইমরান ইবনু হুসাইন (রাযিঃ) হতে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে বলেছেনঃ যে সুগন্ধির গন্ধ আছে কিন্তু রং নেই সেটিই পুরুষের জন্য উত্তম সুগন্ধি এবং যে সুগন্ধির রং আছে কিন্তু গন্ধ নেই সেটিই নারীর জন্য উত্তম সুগন্ধী। আর তিনি লাল রেশমের তৈরি আসনে বসতে বারণ করেছেন। সহীহঃ প্রাগুক্ত আবূ ঈসা বলেন, এ হাদীসটি হাসান এবং উপরোক্ত সূত্রে গারীব।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 2789,
			"arabicnumber": 2789,
			"text": "২৭৮৯। সুমামাহ্ ইবনু আবদুল্লাহ (রহঃ) হতে বর্ণিত, তিনি বলেন, আনাস (রাঃ) কখনো সুগন্ধি ফিরিয়ে দিতেন না। আনাস (রাঃ) বলেছেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সুগন্ধি ফিরিয়ে দিতেন না। সহীহঃ মুখতাসার শামা-য়িল (১৮৬), বুখারী। আবূ হুরাইরাহ (রাযিঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 2790,
			"arabicnumber": 2790,
			"text": "২৭৯০। ইবনু উমর (রাযিঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তিনটি বস্তু প্রত্যাখ্যান করা যায় নাঃ (১) বালিশ, (২) সুগন্ধি তেল ও (৩) দুধ। হাসানঃ প্রাগুক্ত (১৮৭) আবূ ঈসা বলেন, এ হাদীসটি গারীব। আবদুল্লাহ ইবনু মুসলিমের দাদার নাম জুনদুব এবং তিনি মাদানী।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 2791,
			"arabicnumber": 2791,
			"text": "২৭৯১। আবূ উসমান আন-নাহদী (রাহঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের কাউকে সুগন্ধি (হাদিয়া) দেয়া হলে সে যেন তা ফিরিয়ে না দেয়। কেননা এটা জান্নাত হতে নিঃসৃত। যঈফ, মুখতাসার শামায়িল (১৮৯)যঈফা (৭৬৪) আবূ ঈসা বলেন, এ হাদীসটি গারীব। উক্ত হাদীস ছাড়া হানানের সূত্রে আর কোন হাদীস বর্ণিত আছে কি-না তা আমাদের জানা নেই। আবূ উসমান আন-নাহদীর নাম আবদুর রহমান ইবনু মুল্ল। তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সময়কাল পেলেও তাকে দেখেননি এবং তার নিকট সরাসরি হাদীসও শুনেননি।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 2792,
			"arabicnumber": 2792,
			"text": "২৭৯২। আবদুল্লাহ (রাযিঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন নারী অন্য নারীর সাথে (বস্ত্রহীন অবস্থায়) শরীর মিলিয়ে শোবে না। কেননা সে তার স্বামীর নিকট অপর নারীর শরীরের বর্ণনা দিবে এবং মনে হবে সে যেন তাকে চাক্ষুস দেখছে। সহীহঃ সহীহ আবী দাউদ (১৮৬৬), বুখারী। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 2793,
			"arabicnumber": 2793,
			"text": "২৭৯৩। আবূ সাঈদ খুদরী (রাযিঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ এক পুরুষ অন্য পুরুষের গুপ্তাঙ্গের দিকে এবং এক নারী অন্য নারীর গুপ্তাঙ্গের দিকে তাকাবে না। এক পুরুষ অন্য পুরুষের সাথে এবং এক নারী অন্য নারীর সাথে এক কাপড়ের ভেতর শোবে না। সহীহঃ ইবনু মা-জাহ (৬৬১), মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান গারীব সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 2794,
			"arabicnumber": 2794,
			"text": "২৭৯৪। বাহয ইবনু হাকীম (রাহঃ) হতে পর্যায়ক্রমে তার বাবা ও দাদার সুত্রে বর্ণিত, তিনি বলেন, আমি বললাম, হে আল্লাহর নবী! আমাদের আভরণীয় অঙ্গের কতটুকু অংশ ঢেকে রাখব এবং কতটুকু অংশ খোলা রাখতে পারব? তিনি বললেনঃ তোমার স্ত্রী ও দাসী ব্যতীত (সবার দৃষ্টি হতে) তোমার আভরণীয় অঙ্গের হিফাযাত কর। বর্ণনাকারী বলেন, আমি আবার প্রশ্ন করলাম, হে আল্লাহর রাসূল! দলের লোকেরা কখনো একত্রিত হলে? তিনি বললেনঃ তোমার দ্বারা যতটুকু সম্ভব তা ঢেকে রাখবে, কেউ যেন তা দেখতে না পায়। তিনি বলেন, আমি আবারো বললাম, হে আল্লাহর নবী। আমাদের মাঝে কেউ নির্জন স্থানে থাকলে তিনি বললেনঃ মানুষের চাইতে আল্লাহ তা'আলাকে বেশি লজ্জা করা দরকার। হাসানঃ (২৭৬৯) নং হাদীস পূর্বে বর্ণিত হয়েছে। আবূ ঈসা বলেন, এ হাদীসটি হাসান।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 2796,
			"arabicnumber": 2796,
			"text": "২৭৯৬। ইবনু আব্বাস (রাযিঃ) হতে বর্ণিত আছে যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ উরুও একটি আভরণীয় অঙ্গ। সহীহঃ দেখুন পূর্বের হাদীস।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 2797,
			"arabicnumber": 2797,
			"text": "২৭৯৭। জারহাদ (রাযিঃ) হতে বর্ণিত আছে যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ উরুও আভরণীয় অঙ্গ। সহীহ। আবূ ঈসা বলেন, এ হাদীসটি হাসান এবং উপরোক্ত সূত্রে গারীব। আলী ও মুহাম্মাদ ইবনু আবদুল্লাহ ইবনু জাহশ (রাযিঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবদুল্লাহ ইবনু জাহশ ও তার ছেলে মুহাম্মাদ (রাযিঃ) (উভয়েই) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সাহচর্য লাভ করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 2798,
			"arabicnumber": 2798,
			"text": "২৭৯৮। জারহাদ (রাযিঃ) হতে বর্ণিত আছে যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার পাশ দিয়ে যাচ্ছিলেন আর তখন তার উরু খোলা অবস্থায় ছিল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বললেনঃ তোমার উরু ঢেকে রাখ, কেননা এটাও আভরণীয় অঙ্গ। - সহীহ। আবূ ঈসা বলেন, এ হাদীসটি হাসান।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 2799,
			"arabicnumber": 2799,
			"text": "২৭৯৯। সালিহ ইবনু আবূ হাসসান (রহঃ) বলেন, আমি সাঈদ ইবনুল মুসাঈয়্যাব (রহঃ)-কে বলতে শুনেছি, অবশ্যই আল্লাহ তা'আলা পবিত্র এবং পবিত্রতা ভালোবাসেন। তিনি পরিচ্ছন্ন এবং পরিচ্ছন্নতা পছন্দ করেন। তিনি মহান ও দয়ালু, মহত্ব ও দয়া ভালোবাসেন। তিনি দানশীল, দানশীলতাকে ভালোবাসেন। সুতরাং তোমরাও পরিষ্কার-পরিচ্ছন্ন থেক। আমার মনে হয় তিনি বলেছেনঃ তোমাদের আশপাশের পরিবেশকেও পরিচ্ছন্ন রাখ এবং ইয়াহুদীদের অনুকরণ করো না। সালিহ বলেন, আমি এ প্রসঙ্গে মুহাজির মিসমারের নিকটে বর্ণনা করলাম। তিনি বলেন, আমির ইবনু সা'দ তার পিতার সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে একই রকম হাদীস আমার কাছে বলেছেন। তবে তিনি তাতে বলেছেন, তোমাদের আশপাশের পরিবেশকে পরিচ্ছন্ন রাখ। যঈফঃ গা-ইয়াতুল মারাম (১১৩), তবে “আল্লাহ দানশীল.....” এই অংশটুকু সহীহ, সহীহাহ (২৩৬-১৬২৭), হিজাবুল মারয়াহ (১০১)। আবূ ঈসা বলেন, এ হাদীসটি গারীব। খালিদ ইবনু ইলয়াস মতান্তরে ইয়াসকে হাদীস শাস্ত্রে দুর্বল বলা হয়েছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 2800,
			"arabicnumber": 2800,
			"text": "২৮০০। ইবনু উমর (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তোমরা নগ্নতা হতে বেঁচে থাক। কেননা তোমাদের এমন সঙ্গী আছেন (কিরামান-কাতিবীন) যারা পেশাব-পায়খানা ও স্বামী-স্ত্রীর সহবাসের সময় ছাড়া অন্য কোন সময় তোমাদের হতে আলাদা হন না। সুতরাং তাদের লজ্জা কর এবং সম্মান কর। যঈফ, ইরওয়া (৬৪), মিশকাত, তাহকীক ছানী (৩১১৫) আবূ ঈসা বলেন, এই হাদীসটি গারীব। আমরা শুধুমাত্র উপরোক্ত সূত্রেই এ হাদীস জানতে পেরেছি। আবূ মুহাইয়্যার নাম ইয়াহইয়া ইবনু ইয়া’লা।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 2801,
			"arabicnumber": 2801,
			"text": "২৮০১। জাবির (রাযিঃ) হতে বর্ণিত আছে যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আল্লাহ তা'আলা ও পরকালের প্রতি যে লোক ঈমান রাখে সে যেন ইযার (লুঙ্গি) পরিহিত অবস্থা ছাড়া গোসলখানায় প্রবেশ না করে। আল্লাহ তা'আলা এবং পরকালের প্রতি যে লোক ঈমান রাখে সে যেন তার স্ত্রীকে গোসলখানায় প্রবেশ না করায়। আল্লাহ তা’আলা ও পরকালের প্রতি যে লোক ঈমান রাখে সে যেন এমন দস্তরখানে (খাদ্যের মাজলিসে) না বসে যেখানে মদ পরিবেশন করা হয়। হাসানঃ তা’লীকুর রাগীব (১/৮৮-৮৯), ইরওয়াহ (১৯৪৯), গাইয়াতুল মারাম (১৯০)। আবূ ঈসা বলেন, এ হাদীসটি হাসান গারীব। আমরা শুধুমাত্র উপরোক্ত সূত্রেই তাউস হতে জাবির (রাযিঃ)-এর বর্ণনা হিসেবে জেনেছি। মুহাম্মাদ ইবনু ইসমাঈল (বুখারী) (রহঃ) বলেন, লাইস ইবনু আবূ সুলাইম বর্ণনাকারী হিসেবে সত্যবাদী, তবে কোন কোন ক্ষেত্রে সন্দেহের শিকার হন। তিনি আরো বলেন, আহমাদ ইবনু হাম্বল (রহঃ) বলেছেন যে, লাইসের বর্ণনায় উৎফুল্ল হওয়া যায় না। কেননা লাইস এমন কিছু বিষয় মারফু হিসেবে বর্ণনা করেন যা অন্যরা মারফু’ হিসেবে বর্ণনা করেন না। এই জন্যই তাকে যঈফ বলা হয়।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 2802,
			"arabicnumber": 2802,
			"text": "২৮০২। আইশা (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নারী-পুরুষ উভয়কে গোসলখানায় যেতে বারণ করেছিলেন। পরে অবশ্য পুরুষের লুঙ্গি পরে সেখানে যাবার সম্মতি দিয়েছেন। যঈফ, ইবনু মাজাহ (২৭৪৯) আবূ ঈসা বলেন, আমরা শুধুমাত্র হাম্মাদ ইবনু সালামার রিওয়ায়াত হিসাবে এ হাদীস জেনেছি। এ হাদীসের সনদসূত্র খুব দৃঢ় নয়।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 2803,
			"arabicnumber": 2803,
			"text": "২৮০৩। আবূল মালীহ আল-হুযালী (রাহঃ) হতে বর্ণিত, কোন এক সময় হিমস অথবা সিরিয়ার বসবাসকারী কয়েকজন মহিলা আয়িশাহ (রাযিঃ)-এর নিকট আসল। তিনি বললেন, তোমরা তো সেই এলাকার অধিবাসী, যার মহিলারা গোসলখানায় প্রবেশ করে। আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছিঃ যে নারী তার স্বামীর ঘর ছাড়া অন্য কোথাও তার কাপড় খোলে, সে তার ও আল্লাহ তা'আলার মধ্যকার পর্দা ছিড়ে ফেলে। সহীহঃ ইবনু মা-জাহ (৩৭৫০) আবূ ঈসা বলেন, এ হাদীসটি হাসান।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 2804,
			"arabicnumber": 2804,
			"text": "২৮০৪। আবূ তালহা (রাযিঃ) বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছিঃ কুকুর অথবা ভাস্কর্যের ছবি থাকে এমন ঘরে ফেরেশতারা প্রবেশ করেন না। সহীহঃ ইবনু মা-জাহ (৩৬৪৯), বুখারী ও মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 2805,
			"arabicnumber": 2805,
			"text": "২৮০৫। রাফি ইবনু ইসহাক (রহঃ) হতে বর্ণিত, রোগাক্রান্ত আবূ সাঈদ আল-খুদরী (রাযিঃ)-কে আমি ও আবদুল্লাহ ইবনু আবূ তালহা (রাহঃ) দেখতে গেলাম। আবূ সাঈদ (রাযিঃ) বললেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের অবহিত করেছেনঃ যে ঘরে (জীবজন্তুর) প্রতিকৃতি অথবা ছবি থাকে, সে ঘরে (রহমতের) ফেরেশতা প্রবেশ করেন না। ইসহাক সন্দেহে নিপতিত হয়েছেন, ছবির কথা না প্রতিকৃতির কথা বলেছেন। সহীহঃ গাইয়াতুল মারাম (১১৮), মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 2806,
			"arabicnumber": 2806,
			"text": "২৮০৬। আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ জিবরীল (আঃ) আমার নিকট এসে বললেন, গতরাতে আমি আপনার নিকট এসেছিলাম, কিন্তু আপনার অবস্থানরত ঘরের দরজায় একটি পুরুষের প্রতিকৃতি, ঘরের মধ্যে প্রাণীর ছবিযুক্ত একটি সূক্ষ কাপড়ের পর্দা এবং একটি কুকুর আমাকে ভিতরে প্রবেশ করতে বাধা প্রদান করেছে। সুতরাং আপনি দরজার পাশে রাখা প্রতিকৃতিটির মাথা কেটে ফেলার আদেশ করুন, তাহলে সেটা গাছের আকৃতি হয়ে যাবে। আর পর্দাটিও কেটে ফেলতে বলুন আর তা দিয়ে সাধারণতঃ ব্যবহারের জন্য দুটি গদি বানানো যাবে এবং কুকুরটিকে বের করে দেয়ার নির্দেশ দিন। তারপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জিবরীলের পরামর্শ মুতাবিক কাজ করলেন। আর কুকুর ছানাটি হাসান কিংবা হুসাইনের চৌকির নীচে বসা ছিল। যা হোক তিনি আদেশ করলেন এবং সে মুতাবিক এটাকেও বের করে দেয়া হল। সহীহঃ আদাবুয যিফাফ নতুন সংস্করণ (১৯০-১৯৬)। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। আয়িশাহ ও আবূ তালহা (রাযিঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 2807,
			"arabicnumber": 2807,
			"text": "২৮০৭। আবদুল্লাহ ইবনু আমর (রাঃ) হতে বর্ণিত আছে, তিনি বলেনঃ দু'টি লাল কাপড় পরা কোন এক ব্যক্তি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের পাশ দিয়ে অতক্রম করার সময় তাকে সালাম দিল। কিন্তু রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার সালামের উত্তর দেননি। সনদ দুর্বল আবূ ঈসা বলেনঃ এ হাদীসটি হাসান এবং উপরোক্ত সূত্রে গারীব। আলিমদের মতে এ হাদীসের অর্থ হল, তারা কুসুম রংয়ের জামা-কাপড় অপছন্দ করেছেন। তাদের মতে কুসুম রং ছাড়া লাল, মেটে ইত্যাদি রং দিয়ে যদি কাপড় লাল করা হয়, তবে কোন দোষ নেই।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 2808,
			"arabicnumber": 2808,
			"text": "২৮০৮। আলী ইবনু আবূ তালিব (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সোনার আংটি, কাসসী (রেশমী) কাপড়, রেশমী জীনপোষ (গদি) এবং যবের তৈরি মদ নিষিদ্ধ করেছেন। আবূল আহওয়াস (রাহঃ) বলেন, জি'আহ হল মিসরে যব হতে তৈরি করা এক প্রকার মদ। হাদীসের বক্তব্য সহীহ। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Matn"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Matn"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 2809,
			"arabicnumber": 2809,
			"text": "২৮০৯। বারাআ ইবনু আযিব (রাযিঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদেরকে সাতটি কাজ করার জন্য নির্দেশ দিয়েছেন এবং সাতটি কাজ করতে নিষেধ করেছেন। তিনি আমাদেরকে জানাযার অনুসরণ দাওয়াত গ্রহণ করতে, মযলুমের সাহায্য করতে, প্রতিশ্রুতি পূর্ণ করতে এবং সালামের উত্তর দিতে নির্দেশ দিয়েছেন। আর তিনি সাতটি কাজ হতে আমাদেরকে বারণ করেছেনঃ সোনার আংটি বা শাখা, রুপার পাত্র ব্যবহার করতে, রেশমী বস্ত্র, মিহি রেশমী কাপড়, মোটা রেশমী কাপড়, কাসসী কাপড় পরিধান করতে। সহীহঃ বুখারী ও মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। আশাআস ইবনু সুলাইম হলেন আশ'আস ইবনু আবীশ শাসা। আবূশ শামার নাম সুলাইম ইবনুল আসওয়াদ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 2810,
			"arabicnumber": 2810,
			"text": "২৮১০। সামুরাহ ইবনু জুনদাব (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা সাদা পোশাক পরিধান কর। কেননা এটা সবচেয়ে পবিত্র ও উত্তম। আর তোমাদের মৃতদেরকেও এ কাপড়ে কাফন দিও। সহীহঃ ইবনু মা-জাহ (১৪৭২) আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। ইবনু আব্বাস ও ইবনু উমার (রাযিঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 2811,
			"arabicnumber": 2811,
			"text": "২৮১১। জাবির ইবনু সামুরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেনঃ এক জোছনা রাতে আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে তাকিয়ে দেখলাম। তার পরনে ছিল একজোড়া লাল রং-এর পোশাক। আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের দিকে এবং চাঁদের দিকে তাকাতে লাগলাম। তিনিই আমার কাছে চাঁদের চাইতে অধিক সুন্দর মনে হল। যঈফ, মুখতাসার শামায়িল (৮)। উহাকে সাহীহ বলা ভুল। আবূ ঈসা বলেনঃ এ হাদীসটি হাসান গারীব। আমরা শুধুমাত্র আশআসের রিওয়ায়াত হিসাবে এ হাদীস জেনেছি। শুবা ও সুফিয়ান সাওরী তারা উভয়েই আবূ ইসহাক হতে বারাআ ইবনু আযিব (রাঃ)-এর সূত্রে বর্ণনা করেছেন তিনি বলেনঃ “আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের পরনে একজোড়া লাল পোশাক দেখেছি\"। সহীহ পূর্বে ১৭২৪ নং হাদীসটি বার্ণিত হয়েছে - মাহমূদ ইবনু গাইলান-ওয়াকী হতে তিনি সুফিয়ান হতে তিনি আবূ ইসহাক হতে তিনি মুহাম্মাদ ইবনু বাশশার হতে তিনি মুহাম্মাদ ইবনু জাফর হতে তিনি শুবা হতে তিনি আবূ ইসহাক হতে উপরোক্ত হাদীস বর্ণনা করেছেন। এ হাদীসে আরো অধিক কথা আছে। আমি মুহাম্মাদকে প্রশ্ন করলাম, আবূ ইসহাক-আল-বারাআ (রাঃ) সূত্রে বর্ণিত হাদীসটি বেশি সহীহ না জাবির ইবনু সামুরা (রাঃ)-এর সূত্রে বর্ণিত হাদীসটি? তিনি উভয় হাদীস সহীহ বলে মত দিয়েছেন। এ অনুচ্ছেদে বারাআ ও আবূ জুহাইফা (রাঃ) হতেও হাদীস বর্ণিত আছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 2812,
			"arabicnumber": 2812,
			"text": "২৮১২। আবূ রিমসা (রাযিঃ) হতে বর্ণিত, তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে দুটি সবুজ চাদর পরিহিত অবস্থায় দেখেছি। সহীহঃ মুখতাসার শামা-য়িল (৩৬)। আবূ ঈসা বলেন, এ হাদীসটি হাসান গারীব। আমরা এ হাদীসটি শুধুমাত্র উবাইদুল্লাহ ইবনু ইয়াদের সূত্রেই জেনেছি। আবূ রিমসা আত-তাইনীর নাম হাবীব ইবনু হাইয়্যান, মতান্তরে রিফাআ ইবনু ইয়াসরিবী।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 2813,
			"arabicnumber": 2813,
			"text": "২৮১৩। আয়িশাহ্ (রাযিঃ) হতে বর্ণিত তিনি বলেন, একদিন সকালে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কালো পশমী চাদর পরিহিত অবস্থায় বের হলেন। সহীহঃ মুখতাসার শামা-য়িল (৫৬), মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান গারীব সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 2814,
			"arabicnumber": 2814,
			"text": "২৮১৪। কাইলা বিনতু মাখরামাহ্ (রাযিঃ) হতে বর্ণিত, তিনি বলেন, আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট হাযির হলাম। তারপর তিনি লম্বা হাদীস বর্ণনা করেন। সূর্য প্রখর হয়ে উঠার পর জনৈক ব্যক্তি এসে বলল, আসসালামুআলাইকা ইয়া রাসূলাল্লাহ। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ ওয়া আলাইকাস সালাম ওয়া রহমাতুল্লাহ। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর পরনে বিবর্ণ হয়ে যাওয়া জাফরানী রং-এর দুটি পুরানো কাপড় ছিল এবং নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সাথে ছিল একটি খেজুরের ডাল। হাসানঃ মুখতাসার শামা-য়িল, তাহকীক সানী (৫৩)। আবূ ঈসা বলেন, আমরা এ হাদীস শুধুমাত্র আবদুল্লাহ ইবনু হাসসানের রিওয়ায়াত হিসেবে জেনেছি।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 2816,
			"arabicnumber": 2816,
			"text": "২৮১৬। ইয়ালা ইবনু মুররা (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কোন এক ব্যক্তিকে দেখলেন যে, সে খালুক (জাফরান মিশানো সুগন্ধি) ব্যবহার করেছে। তিনি বললেনঃ যাও, এটা ধুয়ে ফেল আবার ধুয়ে ফেল, পুনরায় তা লাগিও না। সনদ দুর্বল আবূ ঈসা বলেনঃ এ হাদীসটি হাসান। এ হাদীসের সনদে আতা ইবনুস সাইব (রাহঃ) হতে বর্ণনার ব্যাপারে কিছু হাদীস বিশারদ মতের অমিল করেছেন। আলী (রাহঃ) বলেনঃ ইয়াহইয়া ইবনু সাঈদ বলেছেন, যারা পূর্বে আতা ইবনুস সাইব এর নিকট হাদীস শুনেছেন তাদের উক্ত শ্রবণ যথার্থ। আতা ইবনুস সাইব যাযান সূত্রে বর্ণিত দুটি হাদীস ব্যতীত তার বরাতে শুবা ও সুফিয়ানের হাদীস শ্রবণের বিষয়টি সঠিক। শুবা বলেনঃ আতা হতে যাযান সূত্রে বর্ণিত হাদীস দুটো আমি আতার অন্তিম বয়সে শুনেছি। কথিত আছে যে, শেষ বয়সে আতার স্মৃতিশক্তি নষ্ট হয়ে যায়। এ অনুচ্ছেদে আম্মার, আবূ মূসা ও আনাস (রাঃ) হতেও হাদীস বর্ণিত আছে। রাবী আবূ হাফস হলেন ইবনু উমার।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 2817,
			"arabicnumber": 2817,
			"text": "২৮১৭। ইবনু উমর (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমি 'উমার (রাযিঃ)-কে উল্লেখ করতে শুনেছি যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ দুনিয়াতে যে লোক রেশমী পোশাক পরবে, সে আখিরাতে তা পরতে পারবে না। সহীহঃ গাইয়াতুল মারাম (৭৮), বুখারী ও মুসলিম। আলী, হুযইফাহ, আনাস (রাযিঃ) প্রমুখ সাহাবীদের হতে এ অনুচ্ছেদে হাদীস বর্ণিত আছে যা আমি কিতাবুল লিবাসে উল্লেখ করেছি (১৭২০ নং হাদীসের অধীনে দ্র.)। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। আবূ আমর (রাযিঃ) হতে এটি ভিন্ন সূত্রেও বর্ণিত আছে। আবূ আমর-এর নাম 'আবদুল্লাহ এবং উপনাম আবূ আমর। আতা ইবনু আবী রাবাহ ও আমর ইবনু দীনার (রহঃ) তার সূত্রে হাদীস বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 2818,
			"arabicnumber": 2818,
			"text": "২৮১৮। মিসওয়ার ইবনু মাখরামাহ্ (রাযিঃ) হতে বর্ণিত, কোন এক সময় রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কয়েকটি কুবা বণ্টন করলেন, কিন্তু মাখরামাকে এর কোন অংশই দিলেন না। তখন মাখরামাহ্ বললেন, হে পুত্র! চল আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট যাই। তিনি (মিসওয়ার) বলেন, আমি তার সাথে চললাম। (ঐখানে পৌছে) তিনি বললেন, ভিতরে যাও এবং আমার জন্য তার নিকট আবেদন কর। আমি তার নিকট গিয়ে তার জন্য আবেদন করলাম। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কুবাগুলো হতে একটি কুবা সাথে নিয়ে বেরিয়ে আসলেন এবং বললেনঃ তোমার জন্য এটি লুকিয়ে রেখেছিলাম। বর্ণনাকারী বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার দিকে তাকিয়ে বললেনঃ মাখরামাহ এবার খুশি হয়েছে। সহীহঃ বুখারী ও মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। ইবনু আবূ মুলাইকার নাম 'আবদুল্লাহ ইবনু উবাইদুল্লাহ ইবনু আবী মুলাইকাহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 2819,
			"arabicnumber": 2819,
			"text": "২৮১৯। আমর ইবনু শু'আইব (রহঃ) হতে পর্যায়ক্রমে তার বাবা ও তার দাদার সূত্রে বর্ণিত, তার দাদা বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আল্লাহ তা'আলা তার দেয়া নি’মাতের নিদর্শন তার বান্দার উপর দেখতে ভালোবাসেন (অর্থাৎ- যাকে যে রকম নি’মাত প্রদান করা হয়েছে সেনুযায়ী পোশাক-পরিচ্ছদ ব্যবহার করা আল্লাহ পছন্দ করেন)। হাসান সহীহঃ গাইয়াতুল মারাম (৭৫) আবূল আহওয়াস তার বাবা হতে, ইমরান ইবনু হুসাইন ও ইবনু মাসউদ (রাযিঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, এ হাদীসটি হাসান।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 2820,
			"arabicnumber": 2820,
			"text": "২৮২০। বুরাইদাহ (রাযিঃ) হতে বর্ণিত, (বাদশাহ) নাজাশী নকশাবিহীন দু'টি কালো রংয়ের চামড়ার মোজা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে উপহার দিয়েছিলেন। তিনি তা পরিহিত অবস্থায় উযু করলেন এবং তার উপর মসিহ করলেন। সহীহঃ ইবনু মা-জাহ (৫৪৪৯) আবূ ঈসা বলেন, এ হাদীসটি হাসান। আমরা দালহামের বর্ণনা হতে এটি জেনেছি। মুহাম্মাদ ইবনু রাবী'আও এ হাদীসটি দালহামের সূত্রে বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 2821,
			"arabicnumber": 2821,
			"text": "২৮২১। আমর ইবনু শু'আইব (রাহঃ) হতে পর্যায়ক্রমে তার বাবা ও তার দাদার সূত্রে বর্ণিত আছে যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পাকা চুল উপড়িয়ে ফেলতে নিষেধ করেছেন। তিনি আরো বলেনঃ এটা মুসলিমের নুর। সহীহঃ মিশকাত (৪৪৫৮), সহীহাহ (১২৪৩)। আবূ ঈসা বলেন, এ হাদীসটি হাসান। এ হাদীস আমর ইবনু শু'আইব-তার বাবা হতে-তার দাদার সূত্রে আবদুর রাহমান ইবনুল হারিস এবং আরো অনেকে বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 2822,
			"arabicnumber": 2822,
			"text": "২৮২২। আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যে ব্যক্তির নিকট পরামর্শ চাওয়া হয়, সে একজন আমানাতদার। সহীহঃ ইবনু মা-জাহ (৩৭৪৫)। আবূ ঈসা বলেন, এ হাদীসটি হাসান। এ হাদীসটি শাইবান ইবনু আবদুর রাহমান আন-নাহবীর সূত্রে একাধিক বর্ণনাকারী বর্ণনা করেছেন। শাইবান একজন গ্রন্থপ্রণেতা, তার বর্ণিত হাদীস সহীহ এবং তার উপনাম আবূ মু'আবিয়াহ। আবদুল জাব্বার ইবনুল আলা-আল-আত্তার-সুফইয়ান ইবনু উয়াইনাহ হতে বর্ণনা করেছেন, তিনি বলেন, ‘আবদুল মালিক ইবনু উমাইর বলেছেন, আমি হাদীস বর্ণনা করার সময় তা হতে একটি অক্ষরও কম করি না।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 2823,
			"arabicnumber": 2823,
			"text": "২৮২৩। উম্মু সালামাহ্ (রাযিঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ পরামর্শদাতা হল আমানাতদার। (সুতরাং তার আমানাত রক্ষা করা কর্তব্য অর্থাৎ- কল্যাণময় ও সৎপরামর্শ প্রদান করা উচিত)। পূর্বের হাদীসের সহায়তায় সহীহ ইবনু মাসউদ, আবূ হুরাইরাহ ও ইবনু উমার (রাযিঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, এ হাদীসটি উম্মু সালামাহ (রাযিঃ)-এর রিওয়ায়াত হিসেবে গারীব।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 2825,
			"arabicnumber": 2825,
			"text": "২৮২৫। আবদুল্লাহ (রাযিঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যখন তোমরা তিনজন একত্রে থাকবে, তখন দু'জনে তাদের সাথীকে বাদ দিয়ে কানাকানি (গোপন আলাপ) করবে না। সুফইয়ানের বর্ণনায় আছেঃ দু'জনে তৃতীয়জনকে বাদ দিযে গোপন আলাপ না করে, কেননা ইহা তাকে চিন্তিত করে। সহীহঃ ইবনু মা-জাহ (৩৭৭৫), বুখারী ও মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। আরেক বর্ণনায় আছে যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ “একজনকে বাদ দিয়ে দু'জনে কানাকানি করবে না। কেননা ইহা মুমিনের কষ্ট দেয়। আর আল্লাহ তা'আলা তো মুমিনকে কষ্ট দেয়া অপছন্দ করেন\"। ইবনু উমার, আবূ হুরাইরাহ ও ইবনু আব্বাস (রহঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 2826,
			"arabicnumber": 2826,
			"text": "২৮২৬। আবূ জুহাইফা (রাযিঃ) হতে বর্ণিত, তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে রক্তিমাভ সাদা দেখলাম এবং তার কিছু চুল সাদা হয়ে গিয়েছিল। আর হাসান ইবনু আলী ছিলেন ঠিক তারই আকৃতির। তিনি (রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) তেরটি উঠতি বয়সের উটনী আমাদেরকে দেয়ার জন্য আদেশ করলেন। কাজেই সেগুলো সংগ্রহের উদ্দেশে তার নিকট রাওয়ানা হলাম। এমন সময় আমাদের নিকট তার মৃত্যুর সংবাদ এলো। সেহেতু লোকেরা একটি উটনীও আমাদেরকে দিল না। তারপর আবূ বাকর (রাযিঃ) খিলাফাতে অধিষ্ঠিত হয়ে বললেন, যে ব্যক্তির নিকট রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর ওয়াদাহ আছে, সে যেন উপস্থিত হয়। কাজেই আমি তার নিকট উপস্থিত হয়ে সব কথা খুলে বললাম। তিনি আমাদেরকে উটনীগুলো দেয়ার আদেশ কার্যকর করলেন। সহীহঃ বুখারী ও মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান। মারওয়ান ইবনু মু'আবিয়াহও নিজস্ব সনদে আবূ জুহাইফাহ (রাযিঃ) হতে উক্ত হাদীসের মতো বর্ণনা করেছেন। একাধিক বর্ণনাকারী ইসমাঈল ইবনু আবূ খালিদ থেকে বর্ণনা করেছেন যে, আবূ জুহাইফাহ্ (রাযিঃ) বলেছেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে দেখেছি, হাসান ইবনু আলী ছিলেন ঠিক তারই সদৃশ। এই বর্ণনায় এর বেশি নেই।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 2827,
			"arabicnumber": 2827,
			"text": "২৮২৭। আবূ জুহাইফা (রাযিঃ) হতে বর্ণিত, তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে দেখেছি এবং হাসান ইবনু আলী (রাযিঃ) ছিলেন তার মতোই (অবয়ব সম্পন্ন)। সহীহঃ বুখারী ও মুসলিম আবূ ঈসা বলেন, একাধিক বর্ণনাকার ইসমাঈল ইবনু আবূ খালিদের সূত্রে একই রকম বর্ণনা করেছেন। জাবির (রাযিঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ জুহাইফাহ (রাযিঃ)-এর নাম ওয়াহব আস-সুওয়াঈ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 2828,
			"arabicnumber": 2828,
			"text": "২৮২৮। আলী (রাযিঃ) হতে বর্ণিত, তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে সা'দ ইবনু আবূ ওয়াক্কাস (রাযিঃ) ব্যতীত আর কারো জন্য তার বাবা-মাকে একত্র করতে শুনিনি (অর্থাৎ- এমন বলতে শুনিনি যে, আমার বাবা-মা তোমার জন্য কুরবান হোক)। সহীহঃ ইবনু মা-জাহ (১৩০), বুখারী ও মুসলিম।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 2829,
			"arabicnumber": 2829,
			"text": "২৮২৯। আলী (রাযিঃ) হতে বর্ণিত, তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সা'দ ইবনু আবূ ওয়াক্কাস (রাযিঃ) ছাড়া অন্য কারো জন্য তার বাবা-মাকে একত্র করে বলেননি যে, আমার বাবা-মা তোমার জন্য কুরবান হোক। উহুদ যুদ্ধের দিন তিনি তাকে (সা'দকে) বলেছেনঃ চালাও তীর, আমার বাবা-মা তোমার জন্য কুরবান হোক। হে নওজোয়ান যুবক তীর ছুড়ো। “হে তরুণ যুবক” এর উল্লেখ মুনকার, বুখারী ও মুসলিম এই অতিরিক্ত অংশ ব্যতীত বর্ণনা করেছেন। এ অনুচ্ছেদে যুবাইর ও জাবির (রাযিঃ) হতেও হাদীস বর্ণিত আছে। আবূ ঈসা বলেনঃ এ হাদীসটি হাসান সহীহ। উক্ত হাদীস আলী (রাযিঃ) হতে বিভিন্ন সূত্রে বর্ণিত আছে। একাধিক বর্ণনাকারী এ হাদীস ইয়াহইয়া ইবনু সাঈদ হতে তিনি সাঈদ ইবনুল মুসাইয়্যাব হতে তিনি সা'দ ইবনু আবী ওয়াক্কাস (রাযিঃ) বর্ণনা করেন যে, তিনি বলেন, উহুদের মাইদানে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার জন্য তার বাবা-মাকে একত্র করেছেন (অর্থাৎ- তিনি বলেছেনঃ আমার বাবা-মা তোমার জন্য কুরবান হোক তুমি নিক্ষেপ কর)।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Munqar"
				},
				{
					"name": "Al-Albani",
					"grade": "Munqar"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 2830,
			"arabicnumber": 2830,
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 2831,
			"arabicnumber": 2831,
			"text": "২৮৩১। আনাস (রাযিঃ) হতে বর্ণিত আছে যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে “হে আমার পুত্র\" বলে সম্বোধন করেছেন। সহীহঃ সহীহাহ (২৯৫৭), মুসলিম। মুগীরাহ ও উমার ইবনু আবী সালামাহ্ (রাযিঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ এবং উক্ত সূত্রে গারীব। এছাড়া অন্য সূত্রেও আনাস (রাযিঃ) হতে এ হাদীসটি বর্ণিত হয়েছে। বর্ণনাকারী আবূ উসমান হলেন হাদীসের নির্ভরযোগ্য শাইখ। তার নাম আল-জাদ ইবনু উসমান। তাকে ইবনু দীনারও বলা হয়। তিনি বাসরার অধিবাসী। ইউনুস ইবনু উবাইদ, শুবাহ এবং আরো একাধিক ইমাম তার সূত্রে হাদীস বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 2832,
			"arabicnumber": 2832,
			"text": "২৮৩২। আমর ইবনু শু'আইব (রাহঃ) হতে পর্যায়ক্রমে তার বাবা ও তার দাদার সূত্রে বর্ণিত আছে যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম শিশুর জন্মের সপ্তম দিনে তার নাম রাখতে, মাথা মুণ্ডন করতে এবং আকীকা করতে আদেশ করেছেন। হাসানঃ ইরওয়াহ (৪/৩৯৯-৪০০), তাহকীক সানী। আবূ ঈসা বলেন, এ হাদীসটি হাসান গারীব।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 2833,
			"arabicnumber": 2833,
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 2834,
			"arabicnumber": 2834,
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 2835,
			"arabicnumber": 2835,
			"text": "২৮৩৫। উমার (রাযিঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ অবশ্যই আমি নিষেধ করছি রাফি, বারাকাত ও ইয়াসার নাম রাখতে। সহীহঃ ইবনু মা-জাহ (৩৮২৯), মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি গারীব। এ হাদীসটি আবূ উমার (রাযিঃ) হতে এই সূত্রে একই রকম বর্ণনা করেছেন। অন্যান্য বর্ণনাকারীগণ সুফইয়ান হতে, তিনি আবূয যুবাইর হতে, তিনি জাবির (রাযিঃ) হতে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এই সূত্রে বর্ণনা করেছেন। আবূ আহমাদ নির্ভরযোগ্য বর্ণনাকারী এবং হাদীসের হাফিয। কিন্তু জাবির (রাযিঃ)-নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে, এই সূত্রেই লোকদের নিকট হাদীসটি প্রসিদ্ধ, তাতে উমর (রাযিঃ)-এর উল্লেখ নেই।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 2836,
			"arabicnumber": 2836,
			"text": "২৮৩৬। সামুরাহ ইবনু জুনদুব (রাযিঃ) হতে বর্ণিত আছে যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা সন্তানদের নাম রাবাহ, আফলাহ, ইয়াসার ও নাজীহ রেখো না। কেউ প্রশ্ন করবে, ঐখানে অমুক আছে কি? বলা হবেঃ না। সহীহঃ ইবনু মা-জাহ (৩৬৩০), মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 2837,
			"arabicnumber": 2837,
			"text": "২৮৩৭। আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত আছে যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কিয়ামত দিবসে সেই ব্যক্তির নাম আল্লাহ তা'আলার নিকট সবচাইতে নিকৃষ্ট নাম হবে, যে (দুনিয়ায়) রাজাধিরাজ (মালিকুল আমলাক) নাম ধারণ করে। সহীহঃ সহীহাহ (৯১৪), বুখারী ও মুসলিম। সুফইয়ান বলেন, এর অর্থ হল শাহানশাহ। আখনাউ অর্থ আকবাহু (সর্বাধিক অবাঞ্ছিত)। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 2838,
			"arabicnumber": 2838,
			"text": "২৮৩৮। ইবনু উমর (রাযিঃ) হতে বর্ণিত আছে যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আসিয়া (রাযিঃ)-এর নাম পরিবর্তন করে বলেনঃ তুমি জামীলাহ। সহীহঃ ইবনু মা-জাহ (৩৭৩৩), মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান গারীব। এ হাদীসটি উবাইদুল্লাহ নাফি হতে, তিনি ইবনু উমার (রাযিঃ) হতে, এই সূত্রে ইয়াহইয়া ইবনু সাঈদ আল-কাত্তান মারফুরূপে বর্ণনা করেছেন। এটিকে কোন কোন বর্ণনাকারী উবাইদুল্লাহ-নাফি হতে, তিনি উমর (রাযিঃ) হতে এই সূত্রে মুরসাল হাদীস হিসেবে বর্ণনা করেছেন। আবদুর রাহমান ইবনু আওফ, 'আবদুল্লাহ ইবনু সালাম, আবদুল্লাহ ইবনু মুতী’, ‘আয়িশাহ, হাকাম ইবনু সাঈদ, মুসলিম, উসামাহ ইবনু আখদারী, শুরাইহ ইবনু হানী-তার পিতা হতে এবং খাইসামাহ্ ইবনু আবদুর রাহমান-তার বাবা হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 2839,
			"arabicnumber": 2839,
			"text": "২৮৩৯। আয়িশাহ (রাযিঃ) হতে বর্ণিত আছে যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিকৃষ্ট নামসমূহ পরিবর্তন করে (ভালো নাম রেখে) দিতেন। সহীহঃ সহীহাহ (২০৭, ২০৮)। আবূ ঈসা বলেন, আবূ বাকর ইবনু নাফি' বলেছেন, এই হাদীসের সনদের ক্ষেত্রে 'উমার ইবনু ‘আলী কখনো বলেন, হিশাম ইবনু উরওয়াহ-তার বাবা হতে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে মুরসাল হিসেবে। তাতে তিনি আয়িশাহ্ (রাযিঃ)-এর উল্লেখ করেননি।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 2840,
			"arabicnumber": 2840,
			"text": "২৮৪০। জুবাইর ইবনু মুতাইম (রাযিঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আমার কতগুলো নাম আছে। আমি মুহাম্মাদ (প্রশংসিত), আমি আহমাদ (সর্বাধিক প্রশংসাকারী), আমি মাহী (বিলীনকারী)। আল্লাহ তা'আলা আমার দ্বারা কুফরী বিলীন করেন। আর আমি হাশির (সমবেতকারী), আমার পদাংক অনুসরণে মানুষকে হাশর করা হবে। আমি আকিব (চূড়ান্ত পরিণতি বা সবার পশ্চাতে আগমনকারী)। আমার পরে কোন নবী নেই। সহীহঃ মুখতাসার শামা-য়িল (৩১৫), রাওযুন নায়ীর (১/৩৪০)। হুযাইফাহ (রাযিঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 2841,
			"arabicnumber": 2841,
			"text": "২৮৪১। আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত আছে যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার নাম ও ডাকনাম মিলিয়ে মুহাম্মাদ আবূল কাসিম এভাবে নাম রাখতে নিষেধ করেছেন। হাসান সহীহঃ মিশকাত, তাহকীক সানী (৪৭৬৯), সহীহাহ (২৯৪৬)। জাবির (রাযিঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। কিছু আলিম এটা মাকরূহ মনে করেন। কিন্তু কিছু সংখ্যক আলিম রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নাম ও ডাকনাম একত্রে মিলিয়ে নাম রেখেছেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত, কোন একদিন তিনি বাজারে জনৈক ব্যক্তিকে “হে আবূল কাসিম\" বলে ডাক দিতে শুনলেন। সুতরাং রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার দিকে মুখ ফিরিয়ে তাকালে লোকটি বলল, আমি আপনাকে ডাকিনি। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমরা আমার ডাকনামে ডাকনাম রেখো না। আল হাসান ইবনু আলী আল খাল্লাল ইয়াযীদ ইবনু হারুন হতে, তিনি হুমাইদ হতে, তিনি আনাস (রাযিঃ) হতে এই সূত্রে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এ হাদীসটি বর্ণনা করেছেন। আর এ হাদীসে প্রমাণিত হয় যে, আবূল কাসিম ডাকনাম রাখা মাকরূহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 2842,
			"arabicnumber": 2842,
			"text": "২৮৪২। জাবির (রাযিঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা আমার নামে নাম রাখলে একসঙ্গে আমার ডাকনামও রেখো না। সহীহঃ ইবনু মা-জাহ (৩৭৩৬), বুখারী ও মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান এবং এই সূত্রে গারীব।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 2843,
			"arabicnumber": 2843,
			"text": "২৮৪৩। আলী ইবনু আবী তালিব (রাযিঃ) হতে বর্ণিত। তিনি বলেন, হে রাসূলাল্লাহ। আপনার পরে যদি আমার কোন ছেলে হয়, তাহলে তার নাম মুহাম্মাদ এবং আপনার ডাকনামে তার ডাকনাম রাখতে পারি কি? তিনি বললেনঃ হ্যাঁ। তিনি (আলী) বলেন, এর দ্বারা আমাকে অনুমতি দেয়া হল। সহীহঃ মুখতাসার তুফাতুল ওয়াদুদ, মিশকাত তাহকীক সানী (৪৭৭২)। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 2844,
			"arabicnumber": 2844,
			"text": "২৮৪৪। আবদুল্লাহ (রাযিঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ নিশ্চয়ই কোন কোন কবিতায় হিকমাত ও প্রজ্ঞা আছে। হাসান সহীহঃ বুখারী ও মুসলিম উবাই ইবনু কা'ব হতে। আবূ ঈসা বলেন, এ হাদীসটি উপরোক্ত সূত্রে গারীব। এ হাদীসটি ইবনু আবূ গানিয়্যার সূত্রে আবী সাইদ আল-আশাজ্জ মারফু' হিসেবে বর্ণনা করেছেন। অন্যান্য বর্ণনাকারীগণ হাদীসটি ইবনু আবী গানিয়্যাহ হতে মাওকুফ হিসেবে বর্ণনা করেছেন। উক্ত হাদীস অন্যসূত্রে আবদুল্লাহ ইবনু মাসউদ (রাযিঃ)-এর বরাতে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত আছে। উবাই ইবনু কা'ব, ইবনু আব্বাস, আয়িশাহ, বুরাইদাহ, কাসীর ইবনু আবদুল্লাহ তার পিতা হতে, তিনি তার দাদা হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 2845,
			"arabicnumber": 2845,
			"text": "২৮৪৫। ইবনু আব্বাস (রাযিঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ নিঃসন্দেহে কোন কোন কবিতায় প্রজ্ঞাপূর্ণ কথাও আছে। হাসান সহীহঃ ইবনু মা-জাহ (৩৭৫৬) আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 2846,
			"arabicnumber": 2846,
			"text": "২৮৪৬। আয়িশাহ (রাযিঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (কবি) হাসসানের জন্য মসজিদে একটি মিম্বার রেখে দিতেন। তিনি তাতে দাঁড়িয়ে রাসূলুল্লাহ -এর গৌরবগাথা আবৃত্তি করতেন অথবা তিনি (আয়িশাহ) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর পক্ষ থেকে (কাফিরদের কটুক্তির) জবাব দিতেন। আর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলতেনঃ আল্লাহ তা'আলা রূহুল কুদুস জিবরীল এর মাধ্যমে হাসসানকে সহযোগিতা করেন যতক্ষণ তিনি গৌরবগাথা আবৃত্তি করেন অথবা রাসূলের পক্ষ থেকে (কাফিরদের তিরস্কারের) জবাব দেন। হাসানঃ সহীহাহ (১৬৫৭) ইসমাঈল ইবনু মূসা ও আলী ইবনু হুজর তারা উভয়ে ইবনু আবী যিনাদ হতে, তিনি তার বাবা হতে, তিনি উরওয়া হতে, তিনি আয়িশাহ (রাযিঃ) হতে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এই সূত্রে একই রকম হাদীস বর্ণনা করেছেন। আবূ হুরাইরাহ ও আল-বারাআ (রাযিঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ গারীব। এটি ইবনু আবূয যিনাদের হাদীস।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 2847,
			"arabicnumber": 2847,
			"text": "২৮৪৭। আনাস (রাযিঃ) হতে বর্ণিত আছে যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন কাযা উমরা আদায়ের উদ্দেশে মক্কায় প্রবেশ করলেন, তখন কবি আবদুল্লাহ ইবনু রাওয়াহা (রাযিঃ) তার সামনে সামনে এ কবিতা বলে হেঁটে যাচ্ছিলেনঃ হে বানী কুফফার ছেড়ে দে তার চলার পথ। আজ মারবো তোদের কুরআনের ভাষায় মারার মতো। কল্লা উড়ে যাবে তোদের গর্দান হতে, বন্ধু হতে বন্ধু হবে পৃথক তাতে\"। উমার (রাযিঃ) তাকে বললেন, হে ইবনু রাওয়াহা! তুমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সামনে আল্লাহ তা’আলার হেরেমের মধ্যে কবিতা বলছ? নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বললেনঃ হে “উমার! তাকে বলতে দাও। কেননা এই কবিতা তীরের চাইতেও দ্রুতগতিতে গিয়ে তাদেরকে (কাফিরদের) আহতকারী। সহীহঃ মুখতাসার শামা-য়িল (২১০) আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ, উক্ত সূত্রে গারীব। এ হাদীসটি মামার-যুহরী হতে, তিনি আনাস (রাযিঃ) হতে এই সূত্রে আবদুর রাযযাকও একই রকম বর্ণনা করেছেন। এ হাদীসটি ব্যতীতও অপর হাদীসে বর্ণিত আছেঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কাযা উমরাহ আদায়ের উদ্দেশে মক্কায় প্রবেশ করলেন এবং কাব ইবনু মালিক (রাযিঃ) তার সামনে কবিতা আবৃত্তি করছিলেন”। এ বর্ণনাটি কিছু মুহাদ্দীসগণের নিকট অনেক বেশি সহীহ। কেননা ‘আবদুল্লাহ ইবনু রাওয়াহা (রাযিঃ) মুতার যুদ্ধে শহীদ হন। আর এ উমরাতুল কাযার ঘটনা ছিল সে যুদ্ধের অনেক পরে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 2848,
			"arabicnumber": 2848,
			"text": "২৮৪৮। শুরাইহ (রহঃ) হতে বর্ণিত, তিনি বলেন, ‘আয়িশাহ (রাযিঃ)-কে প্রশ্ন করা হল, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কি উপমা দেয়ার জন্য কবিতা আবৃত্তি করতেন। তিনি বললেন, তিনি ইবনু রাওয়াহার এ কবিতা আবৃত্তি করে উপমা দিতেন। \"যাকে তুমি দাওনি তোশা, খবর আনবে সে নিশ্চয়ই।\" সহীহঃ সহীহাহ (২০৫৭) ইবনু আব্বাস (রাযিঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 2849,
			"arabicnumber": 2849,
			"text": "২৮৪৯। আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত আছে যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আরব কবিদের মধ্যে সর্বোত্তম ও সত্য কথা বলেছেন লাবীদ। তা হল এই “শুনে রেখ আল্লাহ ব্যতীত সব কিছুই বাতিল\"। ‘অসদাকু” অধিক সত্য এই শব্দে হাদীসটি সহীহঃ মুখতাসার শামায়িল (২০৭), ফিকহুস সীরাহ (২৭), মুসলিম। আবূ ঈসা বলেনঃ হাদীসটি হাসান সহীহ। সাওরী ও অন্যান্য বর্ণনাকারীগণ হাদীসটি আবদুল মালিক ইবনু উমাইর-এর সূত্রে বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 2850,
			"arabicnumber": 2850,
			"text": "২৮৫০। জাবির ইবনু সামুরাহ (রাযিঃ) হতে বর্ণিত, তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সাথে শতাধিক বৈঠকে ছিলাম। সে সব বৈঠকে তার সাহাবীগণ কবিতা আবৃত্তি করতেন এবং জাহিলিয়াত যুগের বিভিন্ন বিষয় আলোচনা করতেন। তিনি সেগুলো চুপ করে শুনতেন এবং কখনো কখনো মুচকি হাসতেন। সহীহঃ মুখতাসার শামা-য়িল (২১১) আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। এ হাদীসটি সিমাকের সূত্রে যুহাইরও বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 2851,
			"arabicnumber": 2851,
			"text": "২৮৫২। সা’দ ইবনু আবী ওয়াক্কাস (রাযীঃ) হতে বর্ণিত, তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের কারো পেট (খারাপ ও চরিত্র বিধ্বংসী) কবিতার চাইতে বমি দ্বারা পূর্ণ থাকাই উত্তম। সহীহঃ ইবনু মা-জাহ (৩৭৫৯), বুখারী ও মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 2852,
			"arabicnumber": 2852,
			"text": "২৮৫১। আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের কারো পেট কবিতার চাইতে বমিতে পূর্ণ থাকাই উত্তম যা উহাকে (পেটকে) খারাপ করে ফেলে। সহীহঃ প্রাগুক্ত। সা'দ, আবূ সাঈদ, ইবনু উমার ও আবূদ দারদা (রাযিঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 2853,
			"arabicnumber": 2853,
			"text": "২৮৫৩। আবদুল্লাহ ইবনু আমর (রাযিঃ) হতে বর্ণিত আছে যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ সেসব বাকপটু-বাগ্মী লোকদেরকে আল্লাহ তা'আলা অবশ্যই ঘৃণা করেন, যারা গরুর জাবর কাটার ন্যায় কথা বলে। সহীহঃ সহীহাহ (৮৭৮) আবূ ঈসা বলেন, এ হাদীসটি হাসান এবং এই সূত্রে গারীব। সা'দ (রাযিঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 2854,
			"arabicnumber": 2854,
			"text": "২৮৫৪। জাবির (রাযিঃ) হতে বর্ণিত, তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দেয়ালবিহীন ছাদে ঘুমাতে নিষেধ করেছেন। সহীহঃ সহীহাহ (৮২৬) আবূ ঈসা বলেন, এ হাদীসটি গারীব। আমরা এ হাদীসটি শুধুমাত্র উপরোক্ত সূত্রেই মুহাম্মাদ ইবনুল মুনকাদির হতে জাবির (রাযিঃ)-এর রিওয়ায়াত হিসেবে জেনেছি। আবদুল জাব্বার ইবনু উমার আল-আইলীকে দুর্বল বর্ণনাকারী বলা হয়েছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 2855,
			"arabicnumber": 2855,
			"text": "২৮৫৫। আবদুল্লাহ (রাযিঃ) হতে বর্ণিত, তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সপ্তাহের দিনসমূহে আমাদেরকে ওয়াজ-নাসীহাতের ব্যাপারে আমাদের অবস্থার প্রতি লক্ষ্য রাখতেন, যাতে আমরা বিরক্ত হয়ে না যাই। সহীহঃ বুখারী ও মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। মুহাম্মাদ ইবনু বাশশার-ইয়াহইয়া ইবনু সাঈদ হতে, তিনি সুফইয়ান হতে, তিনি আল-আমাশ হতে, তিনি শাকীক ইবনু সালামাহ হতে, তিনি আবদুল্লাহ ইবনু মাসউদ (রাযিঃ) হতে উপরোক্ত হাদীসের সমার্থবোধক হাদীস বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 2856,
			"arabicnumber": 2856,
			"text": "২৮৫৬। আবূ সালিহ (রহঃ) হতে বর্ণিত, তিনি বলেন, ‘আয়িশাহ ও উম্মু সালামাহ্ (রাযিঃ)-কে প্রশ্ন করা হল, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট কোন ধরনের ‘আমল বেশি পছন্দনীয় ছিল? তারা বললেন, যে ‘আমল নিয়মিত করা হয়, যদিও তা অল্প হয়। সহীহঃ বুখারী (১১৩২), মুসলিম (২/১৬৭) অনুরূপ, ওয়াইন কাল্লা শব্দ ব্যতীত। হাদীসটি বুখারী ও মুসলিমে আয়িশাহ (রাযিঃ) হতে পূর্ণভাবে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর বক্তব্য হিসেবে বর্ণিত আছে। সহীহঃ আবূ দাউদ (১২৩৮) আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ এবং এ সূত্রে গারীব। হিশাম ইবনু উরওয়াহ্ তার বাবা হতে, তিনি আয়িশাহ (রাযিঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সে ধরনের আমল বেশি পছন্দ করতেন, যা নিয়মিত করা হয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 2857,
			"arabicnumber": 2857,
			"text": "২৮৫৭। জাবির ইবনু আবদুল্লাহ (রাযিঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা খাবারের পাত্রগুলো ঢেকে রেখো, মশক বা পানির পাত্রগুলোর মুখ বন্ধ করে দিও, দরজাগুলো বন্ধ করে দিও এবং (শোয়ার সময়) বাতিগুলো নিভিয়ে দিও। কেননা অনেক সময় ছোট্ট ইদুরগুলো বাতির সালতে টেনে নিয়ে যায় এবং ঘরের সবাইকে জ্বালিয়ে দেয়। সহীহঃ মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। এ হাদীসটি জাবির (রাযিঃ) সূত্রে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে একাধিকভাবে বর্ণিত হয়েছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 2858,
			"arabicnumber": 2858,
			"text": "২৮৫৮। আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত আছে যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যখন তোমরা উর্বর তৃণভূমি দিয়ে ভ্রমণ কর তখন তোমরা যমীন হতে উটকে তার প্রাপ্য দিবে, (চরে ফিরে খাবার সুযোগ দিও) এবং শুষ্ক ও উষর ভূমি দিয়ে ভ্রমণ করলে খুব দ্রুত গতিতে পথ অতিক্রম কর, যাতে জন্তুযানের শক্তি বজায় থাকে। আর তোমরা কোন মনযিলে (গন্তব্যে) শেষরাতে যাত্রাবিরতি করলে পথ থেকে সরে বিশ্রাম নিবে। কারণ এ পথ হল পশুর এবং রাতে বিচরণশীল কীট-পতঙ্গের আশ্ৰয়স্থল। সহীহঃ সহীহাহ (১৩৫৭), মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। হারূন ইবনু ইসহাক আল-হামদানী-আবদা হতে, তিনি হিশাম ইবনু উরওয়াহ হতে, তিনি তার বাবা হতে, তিনি আয়িশাহ (রাযিঃ) হতে এই সূত্রে রাসূলুল্লাহ হতে উপরোক্ত হাদীসের সমার্থবোধক হাদীস বর্ণনা করেছেন। সহীহঃ বুখারী ও মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি সহীহ। আনাস ও জাবির (রাযিঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত রয়েছে।।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 3093,
			"arabicnumber": 3093,
			"text": "৩০৯৩। আবূ সাঈদ আল-খুদরী (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা কোন ব্যক্তিকে মসজিদে যাতায়াতে অভ্যস্ত দেখলে তার ঈমানের সাক্ষী দিও। আল্লাহ তা'আলা বলেনঃ “আল্লাহ্ তা'আলার মাসজিদসমূহের রক্ষণাবেক্ষণ তো তারাই করে যারা আল্লাহ ও শেষ দিনের প্রতি ঈমান এনেছে......\" (সূরাঃ আত-তাওবা-১৮)। দুর্বল, ২৭৫০ নং হাদীস পূর্বে বর্ণিত হয়েছে ইবনু আবূ উমার-আবদুল্লাহ ইবনু ওয়াহব হতে তিনি আমর ইবনুল হারিস হতে তিনি দাররাজ হতে তিনি আবুল হাইসাম হতে তিনি আবু সাঈদ আল-খুদরী (রাঃ) এর সূত্রেও রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে উপরের হাদীসের মতই বর্ণনা করেছেন। তবে তাতে “তোমরা যাকে মসজিদের রক্ষণাবেক্ষণ করতে দেখ” এরূপ বর্ণিত আছে। দুর্বল, দেখুন পূর্বের হাদীস আবূ ঈসা বলেনঃ এ হাদীসটি হাসান গারীব। আবূল হাইসামের নাম সুলাইমান ইবনু আমর ইবনু আবদুল উতওয়ারী। তিনি ইয়াতীম ছিলেন এবং আবূ সাঈদ আল-খুদরী (রাঃ)-এর পরিবারে লালিত-পালিত হন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 131
			}
		}
	]
}