{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"6": "The Book on Traveling"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 544,
			"arabicnumber": 544,
			"text": "৫৪৪ ৷ ইবনু উমার (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম, আবু বাকর, উমার ও উসমান (রাঃ)-এর সাথে একত্রে সফর করেছি। তারা যুহর ও আসরের (ফরয) নামায দুই রাকাআত দুই রাকাআত আদায় করেছেন। তারা এর আগে বা পরে কোন (সুন্নাত বা নফল) নামায আদায় করেননি। আবদুল্লাহ (রাঃ) বলেন, আমাকে যদি এর (ফরযের) আগে অথবা পরে নামায আদায় করতেই হত তবে আমি ফরয নামায পূর্ণ আদায় করতাম! সহীহ। ইবনু মাজাহ– (১০৭১), বুখারী ও মুসলিম সংক্ষিপ্ত। এ অনুচ্ছেদে উমার, আলী, ইবনু আব্বাস, আনাস, ইমরান ইবনু হুসাইন ও আয়িশাহ (রাঃ) হতেও হাদীস বর্ণিত আছে। আবু ঈসা বলেনঃ ইবনু উমারের হাদীসটি হাসান গারীব। ইয়াহইয়া ইবনু সুলাইমের সূত্রেই শুধুমাত্র আমরা এ হাদীসটি জেনেছি। মুহাম্মাদ ইবনু ইসমাঈল (বুখারী) বলেন, উবাইদুল্লাহ ইবনু উমার সুরাকার সন্তানের সূত্রে, তিনি ইবনু উমার (রাঃ)-এর সূত্রে এ হাদীসটি বর্ণনা করেছেন। আবু ঈসা বলেনঃ আতিয়া আল-আওফী (রহঃ) ইবনু উমার (রাঃ)-এর সূত্রে বর্ণনা করেনঃ “নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সফরে ফরয নামাযের পূর্বে এবং পরে নফল নামায আদায় করতেন।” وَقَدْ صَحَّ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ كَانَ يَقْصُرُ فِي السَّفَرِ وَأَبُو بَكْرٍ وَعُمَرُ وَعُثْمَانُ صَدْرًا مِنْ خِلاَفَتِهِ সহীহ সনদসূত্রে প্রমাণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম, আবু বাকর ও উমর (রাঃ) সফরে নামায কসর করতেন। উসমান (রাঃ) তার খিলাফাতের প্রথম দিকে সফরে কসর করতেন। নবী সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লামের বেশিরভাগ বিশেষজ্ঞ সাহাবী ও তাবিঈ সফরে নামায কসর করতেন। আয়িশাহ (রাঃ) হতে বর্ণিত আছে যে, তিনি সফরে সম্পূর্ণ নামায আদায় করতেন (কসর করতেন না, বুখারী)। কিন্তু নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও তার বেশিরভাগ সাহাবী যেভাবে কসর করেছেন তদনুযায়ী আমল করতে হবে। ইমাম শাফিঈ, আহমাদ এবং ইসহাকও একই রকম কথা বলেছেন। কিন্তু ইমাম শাফিঈ আরো বলেছেন, সফরে কসর করাটা ব্যক্তির ইচ্ছাধীন ব্যাপার। যদি কেউ পূর্ণ নামায আদায় করে তবে তার নামায হয়ে যাবে, নতুন করে তা আদায় করতে হবে না।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 545,
			"arabicnumber": 545,
			"text": "৫৪৫। আবু নাযরাহ (রহঃ) হতে বর্ণিত আছে, তিনি বলেন, ইমরান ইবনু হুসাইন (রাঃ)-কে মুসাফিরের নামায প্রসঙ্গে প্রশ্ন করা হলে তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লামের সাথে হাজ্জ করেছি। তিনি চার রাকাআতের পরিবর্তে দুই রাক’আত আদায় করেছেন। আবু বাকর (রাঃ)-এর সাথেও হাজ্জ করেছি তিনিও দুই রাকাআত আদায় করেছেন। উমার (রাঃ)-এর সাথেও এবং তিনিও দুই রাকাআত আদায় করেছেন। আমি উসমান (রাঃ)-এর সাথেও হাজ্জ করেছি। তিনিও তার খিলাফাতের (প্রথম) ছয় অথবা আট বছর দুই রাকাআতই আদায় করেছেন -সহীহ। পূর্বের হাদীসের কারণে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 546,
			"arabicnumber": 546,
			"text": "৫৪৬। মুহাম্মাদ ইবনুল মুনকাদির ও ইবরাহীম ইবনু মাইসারা (রহঃ) হতে বর্ণিত আছে। তারা দুজনেই আনাস ইবনু মালিক (রাঃ)-কে বলতে শুনেছেনঃ আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সাথে মদীনায় যুহরের নামায চার রাকাআত আদায় করেছি এবং যুল-হুলাইফায় আসরের নামায দুরাকাআত আদায় করেছি। -সহীহ। সহীহ আবু দাউদ- (১০৮৫), বুখারী ও মুসলিম। আবূ ঈসা বলেনঃ এ হাদিসটি সহীহ",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 547,
			"arabicnumber": 547,
			"text": "৫৪৭। ইবনু আব্বাস (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লাম মক্কার উদ্দেশ্যে মদীনা হতে বের হলেন। এ সময় সারা বিশ্বের প্রতিপালক ছাড়া আর কারো ভয় তার ছিল না। তিনি (চার রাকাআত ফরযের স্থলে) দুই রাকাআত আদায় করেছেন। —সহীহ। ইরওয়া- (৩/৬)। আবু ঈসা বলেনঃ এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 548,
			"arabicnumber": 548,
			"text": "৫৪৮। আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমরা নবী সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লামের সাথে মক্কার উদ্দেশ্যে মদীনা হতে রাওয়ানা হলাম। তিনি দুই রাকাআত নামায আদায় করলেন। ইয়াহইয়া ইবনু ইসহাক বলেন, আমি আনাস (রাঃ)-কে প্রশ্ন করলাম, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কত দিন মক্কায় ছিলেন? তিনি বললেন, দশ দিন। -সহীহ। ইবনু মাজাহ– (১০৭৭), বুখারী ও মুসলিম। আবু ঈসা বলেনঃ এ হাদিসটি হাসান সহিহ। এ অনুচ্ছেদে ইবনু আব্বাস ও জাবির (রাঃ) হতেও হাদীস বর্ণিত আছে। وَقَدْ رُوِيَ عَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ أَقَامَ فِي بَعْضِ أَسْفَارِهِ تِسْعَ عَشْرَةَ يُصَلِّي رَكْعَتَيْنِ ‏.‏ قَالَ ابْنُ عَبَّاسٍ فَنَحْنُ إِذَا أَقَمْنَا مَا بَيْنَنَا وَبَيْنَ تِسْعَ عَشْرَةَ صَلَّيْنَا رَكْعَتَيْنِ وَإِنْ زِدْنَا عَلَى ذَلِكَ أَتْمَمْنَا الصَّلاَةَ ‏. ইবনু আব্বাস (রাঃ) হতে বর্ণিত আছে যে, নবী সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লাম তার কোন সফরে উনিশ দিন থাকলেন। তিনি বরাবর (চার রাকাআত ফরযের স্থলে) দুই রাকাআতই আদায় করতে থাকলেন। ইবনু আব্বাস (রাঃ) বলেন, এজন্য আমরাও উনিশ দিন থাকলে দুই রাকাআতই আদায় করে থাকি। যদি এরপর আরো বেশি দিন থাকতে হয় তবে আমরা পূর্ণ নামায আদায় করি।” আলী (রাঃ) বলেন, যদি কোন ব্যক্তি সফরে দশ দিন থাকেন তবে সে পূর্ণ নামায আদায় করবে। ইবনু উমর (রাঃ) বলেন, যে ব্যক্তি পনের দিন থাকবে সে পূর্ণ নামায আদায় করবে। ইবনু উমর (রাঃ)-এর অপর মতে বার দিনের কথা উল্লেখ আছে। সাঈদ ইবনুল মুসায়্যাব (রহঃ) বলেন, যে ব্যক্তি চার দিন থাকবে সে চার রাক’আত আদায় করবে। কাতাদা ও আতা তার এ মত বর্ণনা করেছেন। দাউদ ইবনু আবু হিন্দ তাঁর নিকট হতে এর বিপরীত বর্ণনা করেছেন। এ ব্যাপারে আলিমদের মধ্যে যথেষ্ট মতের অমিল রয়েছে। সুফিয়ান সাওরী ও কুফাবাসীগণ পনের দিনের সময়সীমা ঠিক করেছেন। তারা বলেছেন, যদি কমপক্ষে পনের দিন (সফর একই এলাকায়) থাকার নিয়াত করা হয় তবে পূর্ণ নামায আদায় কর। মালিক, শাফিঈ ও আহমাদ বলেন, যদি চার দিন একই জায়গায় থাকার নিয়াত করা হয় তবে পূর্ণ নামায আদায় করতে হবে। ইসহাক বলেন, শক্তিশালী মত হল ইবনু আব্বাসের হাদীসে বর্ণিত মত। তিনি এ হাদীসই অনুসরণ করেছেন। তিনি বলেন, ইবনু আব্বাস (রাঃ) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট হতে বর্ণিত তার নিজের হাদীস অনুযায়ী আমল করেছেন। এ হাদীসের মর্ম অনুযায়ী যদি কোন ব্যক্তি সফরে কোথাও উনিশ দিন থাকার নিয়াত করে তবে সে পূর্ণ নামায আদায় করবে। বহুবিধ মত পার্থক্য থাকা সত্ত্বেও বিদ্বানগণ একটি বিষয়ে মতৈক্যে পৌছেছেন। তা হল, মুসাফির ব্যক্তি কোন স্থানে নির্দিষ্ট কতদিন থাকবে তা যদি নির্ধারণ না করে থাকে বা তার নিয়াত না করে থাকে তবে সে কসরই আদায় করতে থাকবে, তা যত বছরই হোক না কেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 549,
			"arabicnumber": 549,
			"text": "৫৪৯। ইবনু আব্বাস (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক সফরে গিয়ে উনিশ দিন থাকলেন। এ কয়দিন তিনি দুই রাকাআত দুই রাকাআত করে নামায আদায় করলেন (চার রাকাআত ফরযের পরিবর্তে) ইবনু আব্বাস (রাঃ) বলেন, আমরাও আমাদের (মদীনার ও মক্কার) মধ্যেকার উনিশ দিনের পথে দুই রাকাআত দুই রাক’আত করে নামায আদায় করে থাকি। যখন এর চেয়ে বেশি দিন থাকি তখন চার রাকাআতই আদায় করে থাকি। —সহীহ। ইবনু মাজাহ– (১০৭৫), বুখারী। আবু ঈসা বলেনঃ এ হাদীসটি গারীব হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 550,
			"arabicnumber": 550,
			"text": "৫৫০। বারাআ ইবনু আযিব (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমি আঠার মাস রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সঙ্গী ছিলাম। আমি তাকে সূর্য চলে যাওয়ার পর যুহরের (ফরয নামাযের) পূর্বে দু' রাকাআত (সুন্নাত) নামায ছেড়ে দিতে দেখিনি। যঈফ,যঈফ আবূ দাউদ ২২২)) এ অনুচ্ছেদে ইবনু উমার (রাঃ) হতেও হাদীস বর্ণিত আছে। আবূ ঈসা বলেনঃ এ হাদীসটি গারীব। আমি মুহাম্মাদকে (ইমাম বুখারীকে) এ হাদীস প্রসঙ্গে প্রশ্ন করলে তিনি বলেন, আমি এটা লাইস ইবনু সাদের সূত্রেই জেনেছি এবং তিনি আবূ বুসরার নাম বলতে পারেননি, তবে তাকে উত্তম ধারণা করেছেন। ইবনু উমার (রাঃ) হতে বর্ণিত আছে যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সফরে নামাযের পূর্বে বা পরে সুন্নাত বা নফল নামায আদায় করতেন না। অপর এক বর্ণনায় আছে, তিনি (রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) সফরে নফল নামায আদায় করতেন। অতএব রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের পর আলিমদের মধ্যে মত পার্থক্য সৃষ্টি হয়েছে। একদল সাহাবার মত হল, সফরে নফল নামায আদায় করবে। ইমাম আহমাদ ও ইসহাক এই মতের পক্ষে। অপর একদল বিশেষজ্ঞ বলেছেন, সফরে ফরয নামাযের আগে বা পরে কোন নফল নামায নেই। যে লোক নফল নামায আদায় করল না সে সম্মতি ও ফুরসতের সুযোগ গ্রহণ করল। আর যদি কেউ নফল আদায় করে তবে সে ফাযীলাত লাভ করল। বেশিরভাগ বিদ্বানের মতে সফরে নফল এবং সুন্নাত নামায আদায় করাই ভাল।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 551,
			"arabicnumber": 551,
			"text": "৫৫১। ইবনু উমার (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সাথে সফরে যুহরের নামায দুই রাকাআত আদায় করেছি। এরপর আরো দুই রাক’আত আদায় করেছি। সনদ দুর্বল। তার বর্ণিত পূর্ববর্তী ৫৩৬ নং হাদীসের বিরোধী হওয়ার ফলে মতন ও মুনকার আবূ ঈসা বলেনঃ এটি হাসান হাদীস। ইবনু আবী লাইলা আতিয়্যাহ এবং নাফি এর সূত্রে ইবনু উমার হতে বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 552,
			"arabicnumber": 552,
			"text": "৫৫২। ইবনু উমার (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমি নিজ এলাকায় থাকার সময় এবং সফরে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সাথে নামায আদায় করেছি। বাড়িতে থাকার সময় তার সাথে যুহরের (ফরয) নামায চার রাকাআত আদায় করেছি। অতঃপর দুই রাকাআত (সুন্নাত) আদায় করেছি। সফরে তার সাথে যুহরের (ফরয) নামায দুই রাকাআত আদায় করেছি। অতঃপর দুই রাকাআত (সুন্নাত) নামায আদায় করেছি। আসরের (ফরয) নামায দুই রাক’আত আদায় করেছি। তারপর তিনি আর কোন নামায আদায় করেননি। মাগরিবের (ফরয) নামায সফরে ও বাসস্থানে সমানভাবে তিন রাক’আত আদায় করেছি। এটা সফরে ও বাসস্থানে কম হয় না। আর এটাই হল দিনের বিতরের (বেজোর) নামায। তারপর দুই রাকাআত (সুন্নাত) আদায় করেছি। সনদ দুর্বল, মতন মুনকার। দেখুন পূর্বের হাদীস। আবূ ঈসা বলেনঃ এটি হাসান হাদীস। আমি মুহাম্মাদকে বলতে শুনেছি, ইবনু আবী লাইলার বর্ণনাগুলোর মধ্যে এই বর্ণনাটিই আমার নিকট বেশি সুন্দর। তবে আমি তার কোন হাদীস বর্ণনা করিনা।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 553,
			"arabicnumber": 553,
			"text": "৫৫৩। মু'আয ইবনু জাবাল (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাবুকের যুদ্ধে ব্যস্ত থাকাকালে সূর্য ঢলে যাওয়ার আগে নিজের তাবু ত্যাগ করলে যুহরের নামায দেরি করে আসরের সাথে একত্রে আদায় করতেন। তিনি সূর্য ঢলে যাওয়ার পর তাবু ত্যাগ করলে ‘আসরের নামায এগিয়ে এনে যুহরের সাথে একত্রে আদায় করতেন। তিনি মাগরিবের আগে তাবু ত্যাগ করলে মাগরিব দেরি করে ইশার সাথে একত্রে আদায় করতেন। তিনি মাগরিবের পর তাবু ত্যাগ করলে ইশাকে এগিয়ে এনে মাগরিবের সাথে একত্রে আদায় করতেন। —সহীহ। সহীহ আবু দাউদ- (১১০৬), ইরওয়া (৫৭৮) এ হাদীসটি হাসান গারীব। এ অনুচ্ছেদে আলী, ইবনু উমার, যাইদ ও জাবির (রাঃ) হতেও হাদীস বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 554,
			"arabicnumber": 554,
			"text": "৫৫৪। আব্দুস সামাদ ইবনু সুলাইমান স্বীয় সানাদের কুতাইবার অর্থাৎ মু'আযের হাদীসটি বর্ণনা করেছেন। লাইসের সূত্রে কুতাইবা ছাড়া আর কেউ এ হাদীস বর্ণনা করেছেন বলে আমাদের জানা নেই। লাইস-ইয়াযীদ-আবুত তুফাইল-মুআয (রাঃ)-এর সূত্রে বর্ণনাটি গারীব। বিদ্বানদের নিকট আবুয-যুবাইর-আবুত তুফাইল-মুআয (রাঃ)-এর সনদে বর্ণিত হাদীসটি প্রসিদ্ধ যে, “রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাবুক যুদ্ধে যুহর ও আসর এবং মাগরিব ও ইশা একত্রে আদায় করেছেন।” ইমাম শাফিঈ, আহমাদ এবং ইসহাক এই মতের সমর্থক। তারা বলেছেন, সফরে দুই ওয়াক্তের নামায একত্রে আদায় করতে কোন অপরাধ নেই।",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 555,
			"arabicnumber": 555,
			"text": "৫৫৫। ইবনু উমর (রাঃ) হতে বর্ণিত আছে, তার নিকট তার কোন এক স্ত্রীর মুমূর্ষ অবস্থার খবর এলে তিনি তাড়াতাড়ি রাওয়ানা হলেন এবং পথ চলতে চলতে (পশ্চিম আকাশের লালিমা) অদৃশ্য হয়ে গেল। তারপর তিনি (বাহন হতে) নেমে মাগরিব ও ইশার নামায একত্রে আদায় করলেন। তারপর তিনি সফরসঙ্গীদের বললেন, রাসূলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লামের যখন তাড়াহুড়া করে যাওয়ার দরকার হত তখন তিনি এমনটিই করতেন। —সহীহ। সহীহ আবু দাউদ- (১০৯০), বুখারী ও মুসলিম মারফুরূপে। আবু ঈসা বলেনঃ এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 556,
			"arabicnumber": 556,
			"text": "৫৫৬। আব্বাদ ইবনু তামীম (রহঃ) হতে তার চাচার সূত্রে বর্ণিত আছে, একদা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম লোকদের নিয়ে বৃষ্টি প্রার্থনার জন্য বের হলেন। তাদেরকে নিয়ে তিনি দুই রাকাআত নামায আদায় করলেন। এতে তিনি সশব্দে কিরা'আত পাঠ করলেন। তিনি তার চাদর উল্টিয়ে দিলেন, দুই হাত উপরে তুললেন এবং কিবলামুখী হয়ে দুআ করলেন। —সহীহ। ইবনু মাজাহ– (১২৬৭), বুখারী ও মুসলিম। এ অনুচ্ছেদে ইবনু আব্বাস, আবু হুরাইরা, আনাস ও আবুল লাহাম (রাঃ) হতেও হাদীস বর্ণিত আছে। আবু ঈসা বলেনঃ আব্দুল্লাহ ইবনু যাইদের হাদীসটি হাসান সহীহ। আলিমগণ এ হাদীস অনুযায়ী আমল করেন। ইমাম শাফিঈ, আহমাদ এবং ইসহাকও একই রকম মত দিয়েছেন। আব্বাদ ইবনু তামীমের চাচার নাম ‘আবদুল্লাহ ইবনু যাইদ ইবনু আসিম আল-মাযিনী (রাঃ)।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 557,
			"arabicnumber": 557,
			"text": "৫৫৭। আবুল লাহম (রাঃ) হতে বর্ণিত আছে, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে আহজরুয-যাইত নামক জায়গায় বৃষ্টি প্রার্থনা করতে দেখলেন। তিনি দুই হাত তুলে দু’আ করলেন। -সহীহ। সহীহ আবু দাউদ- (১০৬৩)। আবু ঈসা বলেনঃ আমরা আবুল লাহমের সূত্রে রাসূলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লামের এই একটি মাত্র হাদীসই জেনেছি। তবে তার মুক্ত দাস উমাইর (রাঃ) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট হতে কয়েকটি হাদীস বর্ণনা করেছেন এবং তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সান্নিধ্য লাভ করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 558,
			"arabicnumber": 558,
			"text": "৫৫৮। হিশাম ইবনু ইসহাক (রহঃ) হতে তার পিতার সূত্রে বর্ণিত আছে, তিনি (ইসহাক) বলেন, মদীনার গভর্নর ওয়ালীদ ইবনু উকবা (রাঃ) আমাকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের বৃষ্টি প্রার্থনা প্রসঙ্গে জানার জন্য ইবনু আব্বাস (রাঃ)-এর নিকটে পাঠালেন। আমি তার নিকট এলে তিনি বললেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সাধারণ পোশাক পরে বিনয় ও নম্রতা সহকারে বৃষ্টি প্রার্থনার জন্য বের হয়ে ঈদের মাঠে আসেন। তিনি তোমাদের এ খুতবা দেওয়ার মত খুতবা দেননি। বরং তিনি অবিরত দু'আ-আরাধনা ও তাকবীর বলতে থাকেন। তিনি ঈদের নামাযের মত দুই রাকাআত নামাযও আদায় করলেন। —সহীহ। ইবনু মাজাহ– (১২৬৬)। আবু ঈসা বলেনঃ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 559,
			"arabicnumber": 559,
			"text": "৫৫৯। অপর একটি সূত্রেও একই রকম হাদীস রয়েছে। তাতে মুতাখাশশিআন’ (ভীত-সন্ত্রস্ত) শব্দটিও উল্লেখ আছে এবং এ শেষোক্ত সূত্রে বর্ণিত হাদীসটিও হাসান সহীহ। এ হাদীসের ভিত্তিতে ইমাম শাফিঈ বলেন, বৃষ্টি প্রার্থনার নামায দুই ‘ঈদের নামাযের নিয়মেই আদায় করতে হবে। প্রথম রাকাআতে সাত তাকবীর এবং দ্বিতীয় রাকাআতে পাচ তাকবীর বলতে হবে। আবু ঈসা বলেনঃ মালিক ইবনু আনাস (রহঃ) প্রসঙ্গে বর্ণিত আছে যে, তিনি বলেছেন, ঈদের নামাযের মত বৃষ্টি প্রার্থনার নামাযে (অতিরিক্ত) তাকবীর বলবে না। আবু হানিফা নুমান বলেন, বৃষ্টি প্রার্থনার নামায নেই। আমি চাদর পরিবর্তনের আদেশও দেই না। বরং তারা স্বাভাবিকভাবেই দুআ করবে। আবু ঈসা বলেনঃ তিনি সুন্নাতের বিরুদ্ধাচরণ করেছেন।",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 560,
			"arabicnumber": 560,
			"text": "৫৬০। ইবনু আব্বাস (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লাম সূর্যগ্রহণকালে নামায আদায় করলেন। তিনি কিরা'আত পাঠ করলেন, তারপর রুকূ করলেন, আবার কিরা'আত পাঠ রুকূ করলেন, তারপর দুটি সিজদা করলেন। দ্বিতীয় রাকাআতও তিনি এভাবেই আদায় করলেন। -সহীহ। সহীহ আবু দাউদ- (১০৭২), বুখারী ও মুসলিম। এই অনুচ্ছেদে আলী, আয়িশাহ, আব্দুল্লাহ ইবনু আমর, নুমান ইবনু বাশীর, মুগীরা ইবনু শুবা, আবু মাসউদ, আবু বাকরা, সামুরা, ইবনু আবদুল্লাহ, আবু মূসা, আবদুর রহমান ইবনু সামূরা ও উবাই ইবনু কা'ব (রাঃ) হতেও হাদীস বর্ণিত আছে। আবু ঈসা বলেনঃ ইবনু আব্বাসের হাদীসটি হাসান সহীহ। ইবনু আব্বাস (রাঃ) হতে এও বর্ণিত আছে, “নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম চার রুকূতে চার রাকাআত সূর্যগ্রহণের নামায আদায় করেছেন।\" ইমাম শাফিঈ, আহমাদ এবং ইসহাকও একই রকম কথা বলেছেন। সূর্যগ্রহণের নামাযের কিরা'আত প্রসঙ্গে বিশেষজ্ঞদের মধ্যে মতের অমিল রয়েছে। একদল বলেছেন, দিনের বেলা অপরিস্ফুট স্বরে কিরা'আত পাঠ করবে। অপর দল বলেছেন, দুই ঈদ ও জুমু'আর নামাযের মত এ নামাযেও স্পষ্ট স্বরে কিরা'আত পাঠ করবে। ইমাম মালিক, আহমাদ এবং ইসহাক উচ্চস্বরে কিরা'আত পাঠের সমর্থক। ইমাম শাফিঈ বলেন, কিরা'আত স্বরবে পড়বে না। নবী সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লাম হতে উভয় মতই বিশুদ্ধভাবে প্রমাণিত হয়েছে। অপর বর্ণনায় আছে– “তিনি ছয় রুকু’তে দুই রাকাআত নামায আদায় করেছেন।\" বিশেষজ্ঞদের মতে এর প্রতিটি পদ্ধতিই জায়িয। এটা সূর্যগ্রহণের সময়সীমার উপর নির্ভর করবে। গ্রহণ দীর্ঘায়িত হলে চার ছয় রুকু’তে দুই রাক’আত আদায় করাও জায়িয। আবার চার রুকু’তে ও দীর্ঘ কিরাআতে দুই রাকাআত আদায় করাও জায়িয। আমাদের সঙ্গীরা সূর্যগ্রহণ ও চন্দ্রগ্রহণের নামায জামা'আতে আদায় করার পক্ষে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 561,
			"arabicnumber": 561,
			"text": "৫৬১। আয়িশাহ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের যুগে সূর্যগ্রহণ হল। রাসূলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লাম লোকদের নিয়ে (জামা'আতে) নামায আদায় করলেন। তিনি অধিক সময় ধরে কিরাআত পাঠ করলেন, তারপর রুকু করলেন এবং দীর্ঘসময় রুকূতে থাকলেন, তারপর মাথা তুললেন (রুকূ’ হতে উঠলেন)। তিনি আবার দীর্ঘ কিরা'আত পাঠ করলেন কিন্তু প্রথমবারের চেয়ে কম লম্বা করলেন, তারপর রুকূতে গেলেন এবং দীর্ঘ সময় রুকূতে থাকলেন, কিন্তু আগের চেয়ে সংক্ষেপে করলেন। তারপর তিনি রুকূ থেকে মাথা তুলে সিজদাতে গেলেন। তিনি দ্বিতীয় রাক'আতও উল্লেখিত পদ্ধতিতে আদায় করলেন। —সহীহ। সহীহ আবু দাউদ- (১০৭১), বুখারী ও মুসলিম। আবু ঈসা বলেনঃ এ হাদীসটি হাসান সহীহ্! এ হাদীসের পরিপ্রেক্ষিতে ইমাম শাফিঈ, আহমাদ ও ইসহাক বলেছেন, সূর্যগ্রহণের নামায চার রুকু ও চার সিজদায় আদায় করবে। শাফিঈ আরো বলেছেন, প্রথম রাকাআতে সূরা ফাতিহার পর সূরা আল-বাকারার মতো যে কোন লম্বা সূরা পাঠ করবে। দিনে হলে নীরবে কিরা'আত পাঠ করবে। তারপর রুকূতে গিয়ে কিরা'আত পাঠের পরিমাণ সময় রুকূতে থাকবে। তারপর আল্লাহু আকবার বলে মাথা তুলে দাড়াবে এবং সূরা ফাতিহার পর সূরা আলে-ইমরানের মতো লম্বা সূরা পাঠ করবে। তারপর রুকূতে গিয়ে কিরা'আত পাঠের পরিমাণ সময় রুকূতে থাকবে। তারপর সামিআল্লাহু লিমান হামিদাহ' বলে মাথা তুলবে। তারপর দুটি পূর্ণাঙ্গ সিজদা করবে এবং প্রত্যেক সিজদা্তে রুকূর পরিমাণ সময় থাকবে। অতঃপর দাড়িয়ে সূরা ফাতিহার পর সূরা আন-নিসার মতো লম্বা সূরা পাঠ করবে, তারপর কিরাআতের মতো লম্বা রুকূ করবে। তারপর আল্লাহু আকবার বলে মাথা তুলে দাড়াবে। তারপর সূরা মায়িদার মতো লম্বা সূরা পাঠ করবে, রুকূও কিরাআতের মতো লম্বা করবে। অতঃপর মাথা তুলবে এবং সামিআল্লাহু লিমান হামিদাহ বলবে। অতঃপর দুটি সিজদা করে, তাশাহহুদ পাঠ করে সালাম ফিরিয়ে নামায সমাপ্ত করবে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 562,
			"arabicnumber": 562,
			"text": "৫৬২। সামুরা ইবনু জুনদুব (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের সূর্যগ্রহণের নামায আদায় করালেন। কিন্তু আমরা তার (কিরা'আত পাঠের) কোন আওয়াজ শুনতে পাইনি। যঈফ, ইবনু মাজাহ (১২৬৪) অনুযায়ী আমল করার কথা বলেছেন। ইমাম শাফিঈর এটাই মত (নিঃশব্দে কিরাআত পাঠ করবে)।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 563,
			"arabicnumber": 563,
			"text": "৫৬৩। আয়িশাহ (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লাম সূর্য বা চন্দ্র গ্রহণের নামায আদায় করলেন এবং তাতে সুস্পষ্ট আওয়াজে কিরা'আত পাঠ করলেন। —সহীহ। সহীহ আবু দাউদ- (১০৭৪), বুখারী ও মুসলিম। আবূ ঈসা বলেনঃ এ হাদীসটি হাসান সহীহ। আবু ইসহাক আল-ফাযারী হতে সুফিয়ান ইবনু হুসাইনের সূত্রেও একইভাবে হাদীস বর্ণিত আছে। ইমাম মালিক, আহমাদ ও ইসহাক সুস্পষ্ট স্বরে কিরা'আত পাঠের সমর্থক।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 564,
			"arabicnumber": 564,
			"text": "৫৬৪। সালিম (রহঃ) থেকে তার পিতার সূত্রে বর্ণিত আছে, নবী সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লাম দুই দলের মধ্য থেকে এক দলের সাথে এক রাকাআত নামায আদায় করলেন। এ সময় অপর দল শত্রুর মুখামুখি দাড়িয়ে থাকলো। তারপর প্রথম দল এক রাক’আত আদায় করে দ্বিতীয় দলের জায়গায় অপেক্ষায় থাকল। দ্বিতীয় দল আসলে তিনি তাদের সাথে দ্বিতীয় রাকাআত নামায আদায় করে সালাম ফিরান। তারা উঠে নিজেদের বাকী রাকাআত পূর্ণ করলো। তারপর তারা আবার অপেক্ষায় থাকলো এবং প্রথম দল এসে তাদের বাকি রাকাআত পূর্ণ করলো। —সহীহ। সহীহ আবু দাউদ- (১১৩২), ইরওয়া- (৩/৫০), বুখারী ও মুসলিম। আবু ঈসা বলেনঃ এ হাদীসটি সহীহ। মূসা ইবনু উকবার সূত্রেও এ হাদীসটি বর্ণিত হয়েছে। এ অনুচ্ছেদে মাসউদ, সাহল ইবনু আবু হাসমা, আবু আইয়াশ আয-যুরাকী ও আবু বাকরাহ (রাঃ) হতেও হাদীস বর্ণিত আছে। ইমাম মালিক বিপদকালীন নামাযের ব্যাপারে সাহল ইবনু আবৃ হাসমা (রাঃ)-এর হাদীসের অবলম্বন করেছেন। ইমাম শাফিঈও তার অনুসরণ করেছেন। ইমাম আহমাদ বলেছেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট হতে বিপদকালীন নামাযের বেশ কয়েকটি পদ্ধতি বর্ণিত আছে। আমি এগুলোর মধ্যে শুধু সাহল ইবনু আবু হাসমার হাদীসকেই সহীহ মনে করি। অনুরূপভাবে ইসহাক ইবনু ইবরাহীম বলেছেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট হতে বিপদকালীন নামাযের বেশ কয়েকটি পদ্ধতিই বর্ণিত আছে। এগুলোর যে কোন পদ্ধতিতেই নামায আদায় করা যায়। এটা বিপদকালীন অবস্থার উপর নির্ভর করবে। তিনি আরো বলেছেন, আমি অন্যান্য বর্ণনার উপর সাহলের বর্ণনাকে প্রাধান্য দেই না।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 565,
			"arabicnumber": 565,
			"text": "৫৬৫। সাহল ইবনু আবু হাসমা (রাঃ) হতে বর্ণিত আছে, তিনি বিপদকালীন নামায সম্পর্কে বলেন, ইমাম কিবলামুখী হয়ে দাঁড়াবে। একদল তার সাথে দাঁড়াবে এবং অপর দল শত্রুকে বাধা দান করবে। তাদের অবস্থান শত্রুর দিকে থাকবে। ইমাম প্রথম দলের সাথে এক রাক’আত আদায় করবে, তারপর মুক্তাদীরা এক রুকূ ও দুই সিজদা করবে (আরো এক রাক’আত আদায় করবে)। অতঃপর তারা গিয়ে প্রতিরক্ষা বুহ্য রচনা করবে এবং দ্বিতীয় দল আসলে ইমাম তাদের সাথে আর এক রাকাআত নামায আদায় করবে। তাদের সাথে দুটি সিজদা করবে, এতে তার দুই রাকাআত পূর্ণ হবে এবং তাদের হবে এক রাকাআত। অতঃপর তারা আরো এক রাক’আত আদায় করবে এবং দুটি সিজদা করবে। -সহীহ। ইবনু মাজাহ– (১২৫৯), বুখারী ও মুসলিম।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 566,
			"arabicnumber": 566,
			"text": "৫৬৬। ইয়াহইয়া ইবনু সাঈদ অন্য সূত্রে এ হাদীসটি সাহল ইবনু হাসমার হাদীসের মত বর্ণনা করেছেন। তিনি আমাকে আরো বলেন, এ হাদীসটি ঐ হাদীসটির পাশাপাশিই লিখে নাও। হাদীসটি আমার মনে না থাকলেও এটা ইয়াহইয়া ইবনু সাঈদ আল-আনসারীর হাদীসের মতই ছিল আবু ঈসা বলেনঃ এই হাদীসটি হাসান সহীহ। ইয়াহইয়া ইবনু সাঈদ আল-আনসারী এ হাদীসটি কাসিম ইবনু মুহাম্মাদের সূত্রে মারফু হিসেবে বর্ণনা করেননি। আনসারীর সাথীরা এ হাদীসটি মাওকূফ হিসেবে বর্ণনা করেছেন। কিন্তু শু'বা এটিকে আবদুর রহমান ইবনুল কাসিম ইবনু মুহাম্মাদের সূত্রে মারফু’ হিসেবে বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 567,
			"arabicnumber": 567,
			"text": "৫৬৭। ইমাম মালিক তার সনদ পরম্পরায় এ হাদীসের মতো হাদীস এমন একজন সাহাবী হতে বর্ণনা করেছেন যিনি নবী সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লামের সাথে সালাতুল খাওফ (শংকাকালীন নামায) আদায় করেছেন। আবু ঈসা বলেনঃ এ বর্ণনাটিও হাসান সহীহ। ইমাম মালিক, শাফিঈ, আহমাদ ও ইসহাক এ হাদীস অনুযায়ী সালাতুল খাওফ আদায় করার কথা বলেছেন। আরো কয়েকটি সূত্রে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক এক দলের সাথে এক এক রাকাআত নামায আদায় করেছেন। এভাবে তার দুই রাকাআত পূর্ণ হয়েছে এবং মুক্তাদীদের এক রাকাআত হয়েছে।",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 568,
			"arabicnumber": 568,
			"text": "৫৬৮। আবূ দারদা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সাথে (কুরআনে) এগারটি সিজদা করেছি যার মধ্যে সূরা নাজমের সিজদটিও অন্তর্ভুক্ত ছিল। যঈফ, ইবনু মাজাহ (১০৫৫)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 569,
			"arabicnumber": 569,
			"text": "৫৬৯। আবূ দারদা (রাঃ)-এর সূত্রে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে ..... পূর্বোক্ত হাদীসের মতো। যঈফ, প্রাগুক্ত আবূ ঈসা বলেনঃ এ হাদীসটি পূর্ব বর্ণিত আব্দুল্লাহ ইবনু ওয়াহবের হাদীস হতে বেশী সহীহ। তিনি আরও বলেনঃ এ অনুচ্ছেদে আলী, ইবনু আব্বাস আবূ হুরাইরাহ, ইবনু মাসউদ যাইদ ইবনু সাবিত এবং আমর ইবনু আস (রাঃ) হতেও হাদীস বর্ণিত আছে। তিনি আরও বলেনঃ আবূ দারদার এ হাদীসটি গারীব। এটি আমরা কেবল উমার ইবনু হায়্যান আদ-দিমাশকীর বরাতে সাঈদ ইবনু আবূ হিলাল হতেই জেনেছি।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 570,
			"arabicnumber": 570,
			"text": "৫৭০। মুজাহিদ (রহঃ) হতে বর্ণিত আছে, তিনি বলেন, কোন এক সময় আমরা ইবনু উমার (রাঃ)-এর কাছে হাযির ছিলাম। তিনি বললেন, রাসূলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমরা মহিলাদেরকে রাতের বেলা মসজিদে যাওয়ার সম্মতি দাও। তার (ইবনু উমারের) ছেলে বললো, আল্লাহ তা'আলার কসম! তাদেরকে মসজিদে যাওয়ার অনুমতি কখনো দিব না। কেননা তারা এটাকে মওকা হিসেবে গ্রহণ করবে। ইবনু উমার বললেন, আল্লাহ তোমার অমঙ্গল করেছেন এবং করবেন! আমি বলছি, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন (অনুমতি দিতে), আর তুমি বলছো, অনুমতি দিব না। —সহীহ। সহীহ আবু দাউদ– (৫৭৭), বুখারী ও মুসলিম। এ অনুচ্ছেদে আবু হুরাইরা, আবদুল্লাহ ইবনু মাসউদের স্ত্রী যাইনাব ও যাইদ ইবনু খালিদ (রাঃ) হতে ও হাদীস বর্ণিত আছে। আবু ঈসা বলেনঃ ইবনু উমারের হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 571,
			"arabicnumber": 571,
			"text": "৫৭১। তারিক ইবনু আবদুল্লাহ আল-মুহারিবী (রহঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তুমি নামায আদায়কালে তোমার ডান দিকে থুথু ফেল না, বরং তোমার পিছনে অথবা বাঁ দিকে অথবা বাঁ পায়ের নীচে থুথু ফেল। —সহীহ। ইবনু মাজাহ– (১০২১)। এ অনুচ্ছেদে আবু সাঈদ, ইবনু উমার, আনাস ও আবু হুরাইরা (রাঃ) হতে হাদীস বর্ণিত আছে। আবু ঈসা বলেনঃ তারিকের হাদীসটি হাসান সহীহ্। আলিমগণ এ হাদীস অনুযায়ী আমল করার কথা বলেছেন। ওয়াকী (রহঃ) বলেন, রিবঈ ইবনু হিরাশ (খিরাশ) ইসলামে কখনও মিথ্যা বলেননি। আবদুর রহমান ইবনু মাহদী বলেন, কুফায় সবচেয়ে বিশ্বস্ত হলেন, মানসূর ইবনুল মু'তামির।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 572,
			"arabicnumber": 572,
			"text": "৫৭২। আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত আছে, তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মসজিদে থুথু ফেলা গুনাহের কাজ। এর জরিমানা হলো তা মাটিতে পুঁতে ফেলা। —সহীহ। রওজ— (৪৮), সহীহ আবু দাউদ- (৪৯৪), বুখারী ও মুসলিম। আবু ঈসা বলেনঃ এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 573,
			"arabicnumber": 573,
			"text": "৫৭৩। আবু হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেনঃ আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সাথে 'ইকরা বিসমি রব্বিকা' ও 'ইযাস সামাউন শাক্কাত' সূরা দুটিতে সিজদা করেছি। —সহীহ। ইবনু মাজাহ– (১০৫৮), মুসলিম। আবু ঈসা বলেনঃ এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 574,
			"arabicnumber": 574,
			"text": "৫৭৪। অপর একটি সূত্রে আবু হুরাইরার নিকট হতেও এ হাদীসটি বর্ণিত হয়েছে। এ হাদীসর সনদে চারজন তাবিঈ রয়েছেন তারা পরস্পরের নিকট হতে বর্ণনা করেছেন। বেশির ভাগ বিদ্বান এ হাদীসের উপর আমল করেছেন তাদের মতে উল্লেখিত সূরা দুটিতে সিজদা আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 575,
			"arabicnumber": 575,
			"text": "৫৭৫। ইবনু আব্বাস (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লাম সূরা নাজম-এ সিজদা করেছেন। মুসলিম, মুশরিক, জ্বিন ও মানুষ সবাই তার সাথে সিজদা করেছেন। -সহীহ। বুখারী, কিসসাতুল গারানীক— (১৮, ২৫, ৩১ পৃঃ), বুখারী। আবু ঈসা বলেনঃ এ হাদীসটি হাসান সহীহ। এ অনুচ্ছেদে ইবনু মাসউদ ও আবু হুরাইরা (রাঃ) হতেও হাদীস বর্ণিত আছে। একদল বিদ্বানের মতে সূরা নাজম-এ সিজদা রয়েছে। একদল সাহাবা ও তাবিঈনের মতে মুফাসসাল সূরাসমূহে কোন সিজদা নেই। মালিক ইবনু আনাস এই মতের সমর্থক। কিন্তু প্রথম দলের মতই বেশি সহীহ। সুফিয়ান সাওরী, ইবনুল মুবারাক, শাফিঈ ও আহমাদ প্রথম মতের সমর্থক। (অর্থাৎ মুফাসসাল সূরায় সিজদা আছে)।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 576,
			"arabicnumber": 576,
			"text": "৫৭৬। যাইদ ইবনু সাবিত (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে সূরা নাজম পাঠ করে শুনালাম, কিন্তু তিনি সিজদা করেননি। —সহীহ। সহীহ আবু দাউদ- (১২৬৬), বুখারী ও মুসলিম। আবু ঈসা বলেনঃ যাইদ ইবনু সাবিতের হাদীসটি হাসান সহীহ। কিছু আলিম উল্লেখিত হাদীসের ব্যাখ্যায় বলেছেন, যেহেতু যাইদ ইবনু সাবিত (রাঃ) সিজদা করেননি তাই রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামও সিজদা করেননি। তাদের মতে তিলাওয়াতকারী সিজদা না করলে শ্রোতার উপর সিজদা ওয়াজিব হয় না। কতকে বলেন, শ্রবণকারীর উপরও সিজদা করা ওয়াজিব, এটা ছেড়ে দেয়ার কোন অনুমতি নেই। যদি ওযুহীন অবস্থায় শুনে তবে ওযু করার পর সিজদা করবে। সুফিয়ান সাওরী ও কুফাবাসীগণ একথা বলেছেন। ইসহাকও একই রকম মত দিয়েছেন। অপর একদল বিদ্বান বলেছেন, যে ব্যক্তি সিজদা করতে চায় এবং তার ফাযীলাত (সাওয়াব) লাভের ইচ্ছে করে শুধুমাত্র সেই সিজদা করবে। সিজদা ছেড়ে দেয়ারও অনুমতি আছে। অর্থাৎ সে ইচ্ছা করলে সিজদা নাও করতে পারে। তারা উপরে উল্লেখিত যাইদ (রাঃ)-এর মারফু হাদীসকে দলীল হিসেবে গ্রহণ করেছেন। তারা বলেন, যদি সিজদা করা ওয়াজিব হতো তবে রাসূলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লাম যাইদ (রাঃ)-কে সিজদা করতে বাধ্য করতেন এবং তিনি (সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লাম) নিজেও সিজদা করতেন। তারা উমার (রাঃ)-এর হাদীসও নিজেদের দলীল হিসেবে গ্রহণ করেছেন। “তিনি মিম্বারের উপর (জুমুআর খুতবায়) সিজদার আয়াত পাঠ করলেন, তারপর মিম্বার থেকে নেমে সিজদা করলেন। উল্লেখিত সিজদার আয়াতটি তিনি (উমার) পরবর্তী জুমুআর দিনও (খুতবার মধ্যে) পাঠ করলেন। লোকেরা সিজদা দেওয়ার প্রস্তুতি নিল। তিনি বললেন, সিজদা করা আমাদের জন্য আবশ্যক নয়, হ্যাঁ, যে চায় (সে করতে পারে)। উমার (রাঃ)-ও সিজদা করলেন না এবং লোকেরাও সিজদা করলো না।\" (বুখারীতেও এ হাদীস উল্লেখিত হয়েছে)। একদল আলিম এই মত অবলম্বন করেছেন। ইমাম শাফিঈ এবং আহমাদও এ মত সমর্থন করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 577,
			"arabicnumber": 577,
			"text": "৫৭৭। ইবনু আব্বাস (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে সূরা সাদ'-এ সিজদা করতে দেখেছি। ইবনু আব্বাস (রাঃ) বলেনঃ এটা ওয়াজিব সিজদার অন্তর্ভুক্ত নয়। —সহীহ। সহীহ আবু দাউদ- (১২৭০)। আবু ঈসা বলেনঃ এ হাদীসটি হাসান সহীহ। উল্লেখিত সিজদা প্রসঙ্গে বিশেষজ্ঞ সাহাবা ও তাবিঈদের মধ্যে মতের অমিল রয়েছে। একদল সিজদা করার পক্ষে মত দিয়েছেন। সুফিয়ান সাওরী, ইবনুল মুবারাক, শাফিঈ, আহমাদ ও ইসহাক এই মতের পক্ষপাতি। অপর দল বলেছেন, এটাতো একজন নবীর (দাউদ আলাইহিস সালামের) তওবার সিজদা ছিল। অতএব এ সূরায় কোন সিজদা নেই।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 578,
			"arabicnumber": 578,
			"text": "৫৭৮। উকবা ইবনু আমির (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমি বললাম, হে আল্লাহর রাসূল! সূরা হাজকে অত্যন্ত অধিক মর্যাদা দেয়া হয়েছে। কেননা এর মধ্যে দুটি সিজদা রয়েছে। তিনি বললেনঃ হ্যাঁ। যে ব্যক্তি এই সিজদা্ দুটো না করে সে যেন এই দুটো (সিজদার আয়াত) পাঠ না করে। —হাসান। সহীহ আবু দাউদ- (১২৬৫), মিশকাত— (১০৩০)। আবু ঈসা বলেনঃ হাদীসটির সনদ খুব একটা শক্তিশালী নয়। সূরা হাজ্জের সিজদার ব্যাপারে ‘আলিমদের মধ্যে মতের অমিল রয়েছে। উমার ইবনুল খাত্তাব ও আবদুল্লাহ ইবনু উমর (রাঃ) বলেছেন, সূরা হাজ্জকে সম্মানিত করা হয়েছে। কারণ এতে দুটো সিজদা রয়েছে। ইবনুল মুবারাক, শাফিঈ, আহমাদ এবং ইসহাকও একই রকম কথা বলেছেন। অপর এক দল বলেছেন, সূরা হাজে একটি মাত্র সিজদা। সুফিয়ান সাওরী, মালিক ও কুফাবাসীগণ এই মত গ্রহণ করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 579,
			"arabicnumber": 579,
			"text": "৫৭৯। ইবনু আব্বাস (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, এক ব্যক্তি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের কাছে বললো, হে আল্লাহর রাসূল! আমি আজ রাতে নিজেকে স্বপ্নে দেখলাম যে, আমি ঘুমিয়ে আছি, আমি যেন একটি গাছের পিছনে নামায আদায় করছি। আমি তিলাওয়াতের সিজদা করলাম এবং গাছটিও আমার সিজদার সাথে সাথে সিজদা করলো। আমি গাছটিকে বলতে শুনলাম– “হে আল্লাহ! এই সিজদার বিনিময়ে তোমার কাছে আমার জন্য সাওয়াব নির্ধারণ করে রাখ, এর বিনিময়ে আমার একটি গুনাহ দূর কর, এটাকে তোমার কাছে আমার জন্য সঞ্চয় হিসেবে জমা রাখ এবং এটা আমার নিকট হতে গ্রহণ করে নাও, যেভাবে তুমি তোমার বান্দা দাউদ (আঃ)-এর নিকট গ্রহণ করেছিলে।” ইবনু আব্বাস (রাঃ) বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সিজদার আয়াত পাঠ করলেন এবং সিজদা করলেন। ইবনু আব্বাস (রাঃ) আবার বললেন, আমি তাকে তখন সেই গাছের দু'আটির মতো পাঠ করতে শুনলাম, যে সম্পর্কে ইতোপূর্বে লোকটি তাকে জানিয়েছিল। -হাসান। ইবনু মাজাহ– (১০৫৩)। আবু ঈসা বলেনঃ এ হাদীসটি হাসান গারীব। উপরোক্ত সূত্রেই কেবল আমরা হাদীসটি জেনেছি। এ অনুচ্ছেদে আবু সাঈদ (রাঃ) হতেও হাদীস বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 580,
			"arabicnumber": 580,
			"text": "৫৮০। আয়িশাহ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রাতের বেলা তিলাওয়াতের সিজদাতে এই দু'আ পাঠ করতেনঃ “আমার চেহারা সেই মহান সত্তার জন্য সিজদা করলো যিনি নিজ শক্তি ও সামর্থে একে সৃষ্টি করেছেন এবং এতে শ্রবণশক্তি ও দৃষ্টিশক্তি দান করেছেন।” -সহীহ। সহীহ আবু দাউদ- (১২৭৩)। আবু ঈসা বলেনঃ এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 581,
			"arabicnumber": 581,
			"text": "৫৮১। ‘আবদুর রহমান ইবনু আবদুল কারী (রহঃ) হতে বর্ণিত আছে, তিনি বলেনঃ আমি 'উমার ইবনুল খাত্তাব (রাঃ)-কে বলতে শুনেছি, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যে ব্যক্তি নিজের নিয়মিত ও নির্দিষ্ট পরিমাণ (কুরআন) তিলাওয়াত অথবা তার অংশবিশেষ বাকী রেখে ঘুমিয়ে গেল এবং ফজর ও যুহরের মাঝামাঝি সময়ে তা পাঠ করে নিল, সে যেন তা রাতেই পাঠ করে নিয়েছে বলে গণ্য হবে। -সহীহ। ইবনু মাজাহ– (১৩৪৩), মুসলিম। আবু ঈসা বলেনঃ হাদীসটি হাসান সহীহ। আবু সাফওয়ানের নাম আব্দুল্লাহ ইবনু সাঈদ, হুমাইদীসহ স্বনামধন্য ইমামগণ তার থেকে হাদীস বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 582,
			"arabicnumber": 582,
			"text": "৫৮২। আবু হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ ইমামের আগে (রুকূ-সিজদা থেকে) মাথা উত্তোলনকারীর কি ভয় নেই যে, আল্লাহ তা'আলা তার মাথাকে গাধার মাথায় রূপান্তরিত করে দিবেন? —সহীহ। ইবনু মাজাহ– (৯৬১), বুখারী ও মুসলিম। আবু হুরাইরা (রাঃ) আমা ইয়াখশা' (সে কি ভয় করে না) শব্দ বলেছেন। আবু ঈসা বলেনঃ এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 583,
			"arabicnumber": 583,
			"text": "৫৮৩। জাবির ইবনু আবদুল্লাহ (রাঃ) হতে বর্ণিত আছে, মুআয ইবনু জাবাল (রাঃ) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সাথে মাগরিবের নামায আদায় করতেন, তারপর নিজের গোত্রে গিয়ে তাদের ইমামতি করতেন। —সহীহ। সহীহ আবু দাউদ- (৭৫৬), বুখারী ও মুসলিম আরো পূর্ণরূপে। আবু ঈসা বলেনঃ এ হাদীসটি হাসান সহীহ। আমাদের সঙ্গী ইমাম শাফিঈ, আহমাদ ও ইসহাক এ হাদীস অনুযায়ী আমল করেছেন। তারা বলেছেন, কোন ব্যক্তি ফরয নামায আদায় করার পর আবার ইমাম হয়ে সে যদি ঐ নামায আদায় করায় তবে তার পিছনে ইকতিদাকারীদের নামায আদায় হয়ে যাবে। তারা উপরের হাদীস নিজেদের দলীল হিসেবে গ্রহণ করেছেন। এটা একটা সহীহ হাদীস। আর এটা বেশ কয়েকটি সূত্রে জাবির (রাঃ)-এর হতে বর্ণিত হয়েছে। “আবু দারদা (রাঃ)-কে প্রশ্ন করা হলো, এক ব্যক্তি মসজিদে গেল, লোকেরা তখন আসরের নামায আদায় করছিল। সে ধারণা করলো তারা যুহরের নামায আদায় করছে। সে জামা'আতে অন্তর্ভুক্ত হয়ে নামায আদায় করলো (তার নামাযের হুকুম কি)। তিনি বলেন, তার নামায জায়িয হয়েছে।” কুফাবাসীদের একদল বলেছেন, একদল লোক ইমামের পিছনে এসে ইকতিদা করলো। সে তখন আসরের নামায আদায় করছিল। তারা মনে করলো, সে (ইমাম) যুহরের নামায আদায় করছে। সে তাদের নামায আদায় করালো এবং তারাও তার পিছনে ইকতিদা করলো। এ অবস্থায় তাদের নামায ফাসিদ (নষ্ট) হয়ে যাবে। কেননা ইমাম ও মুক্তাদীদের নিয়াতের মধ্যে প্রভেদ সৃষ্টি হয়ে গেছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 584,
			"arabicnumber": 584,
			"text": "৫৮৪। আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত আছে, তিনি বলেনঃ আমরা গরমের দিনে নবী সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লামের পিছনে নামায আদায়কালে গরম থেকে বাচার জন্য কাপড়ের উপর সিজদা করতাম। —সহীহ। ইবনু মাজাহ– (১০৩৩), বুখারী ও মুসলিম। আবু ঈসা বলেনঃ এ হাদীসটি হাসান সহীহ। এ অনুচ্ছেদে জাবির ইবনু আবদুল্লাহ ও ইবনু আব্বাস (রাঃ) হতেও হাদীস বর্ণিত আছে। উল্লেখিত হাদীসটি ওয়াকী (রহঃ) খালিদ ইবনু আবদুর রহমানের সূত্রে বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 585,
			"arabicnumber": 585,
			"text": "৫৮৫। জাবির ইবনু সামুরা হতে বর্ণিত আছে, তিনি বলেনঃ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফজরের নামায আদায়ের পর সূর্য উঠা পর্যন্ত নিজের নামাযের জায়গায় বসে থাকতেন। —সহীহ। সহীহ আবু দাউদ- (১১৭১), মুসলিম। আবু ঈসা বলেনঃ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 586,
			"arabicnumber": 586,
			"text": "৫৮৬। আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত আছে, তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যে ব্যক্তি ফজরের নামায জামাআতে আদায় করে, তারপর সূর্য উঠা পর্যন্ত বসে বসে আল্লাহ তা'আলার যিকর করে, তারপর দুই রাকাআত নামায আদায় করে- তার জন্য একটি হাজ্জ ও একটি উমরার সাওয়াব রয়েছে। আনাস (রাঃ) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ পূর্ণ, পূর্ণ, পূর্ণ (হাজ্জ ও উমরার সাওয়াব)। -হাসান। তা’লীকুর রাগীব- (১/১৬৪, ১৬৫), মিশকাত- (৯৭১)। আবু ঈসা বলেনঃ এ হাদীসটি হাসান গারীব। তিনি আরো বলেন, বললেন, তিনি হাদীস বর্ণনার উপযুক্ত। তার নাম হিলাল।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 587,
			"arabicnumber": 587,
			"text": "৫৮৭। ইবনু আব্বাস (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহু ওয়াসাল্লাম নামাযরত অবস্থায় ডানে-বাঁয়ে তাকাতেন কিন্তু পিছনের দিকে ঘাড় ফেরাতেন না। —সহীহ। মিশকাত— (৯৯৮)। আবু ঈসা বলেনঃ হাদীসটি গারীব, ওয়াকী (রহঃ) তার বর্ণনায় আল-ফাযল ইবনু মূসার বর্ণনার সাথে মতপার্থক্য করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 588,
			"arabicnumber": 588,
			"text": "৫৮৮৷ ইকরামার কিছু সঙ্গী হতে বর্ণিত আছে। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নামাযে এদিক-সেদিক চোখ ঘুরাতেন উপরের হাদীসের মতো। সহীহ দেখুন পূর্বোক্ত হাদীস। এ অনুচ্ছেদে আনাস ও আয়িশাহ (রাঃ) হতেও হাদীস বর্ণিত আছে।",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 589,
			"arabicnumber": 589,
			"text": "৫৮৯। আনাস (রাঃ) হতে বর্ণিত আছে, তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে বললেনঃ হে প্রিয় বৎস সাবধান! নামাযের মধ্যে কখনো এদিক-সেদিক দেখবে না। কেননা নামাযরত অবস্থায় এদিক-সেদিক তাকানো সর্বনাশ ডেকে আনে। যদি তাকানোর খুবই দরকার হয় তবে নফল নামাযে তাকাও, ফরয নামাযে নয়। যঈফ, তালিকাতুল জিয়াদ, তালিকুর রাগীব- (১৯৯১), মিশকাত- (৯৯৭) আবূ ঈসা বলেনঃ এ হাদীসটি হাসান গারীব।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 590,
			"arabicnumber": 590,
			"text": "৫৯০। আয়িশাহ (রাঃ) হতে বর্ণিত আছে, তিনি বলেনঃ আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে নামাযরত অবস্থায় এদিক-সেদিক তাকানো প্রসঙ্গে প্রশ্ন করলাম। তিনি বললেনঃ এটা নামায থেকে কিছু অংশ নিয়ে যায়। —সহীহ। ইরওয়া— (৩৭০), বুখারী। আবু ঈসা বলেনঃ হাদীসটি হাসান গারীব।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 591,
			"arabicnumber": 591,
			"text": "৫৯১। মু'আয ইবনু জাবাল (রাঃ) হতে বর্ণিত আছে, তিনি বলেনঃ নবী সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লাম বলেছেনঃ তোমাদের কেউ নামায আদায় করতে এসে ইমামকে কোন এক অবস্থায় পেল। ইমাম যেরূপ করে সেও যেন অনুরূপ করে (তাকে যে অবস্থায় পাবে সেই অবস্থায় তার সাথে নামাযে শারীক হয়ে যাবে।)। —সহীহ। সহীহ আবু দাউদ- (৫২২), আস-সাহীহাহ– (১১৮৮)। আবু ঈসা বলেনঃ এটি গারীব হাদীস। উল্লেখিত সূত্রটি ছাড়া আর কোন সূত্রে এ হাদীসটি কেউ বর্ণনা করেছেন বলে আমাদের জানা নেই। বিদ্বানগণ এ হাদীস অনুসারে আমল করেছেন। কোন ব্যক্তি মসজিদে এসে ইমামকে সিজদারত অবস্থায় পেলে সেও তার সাথে সিজদায় শারীক হবে। যদি ইমামকে রুকূতে না পায় তবে সেই রাকাআত পেল না। আবদুল্লাহ ইবনুল মুবারাক ইমামের সাথে সিজদায় শারীক হওয়া পছন্দ করেছেন। কোন কোন বিদ্বান প্রসঙ্গে বর্ণিত আছে, তারা বলেছেন, আশা করা যায় এ সিজদা হতে মাথা তোলার আগেই তাকে মাফ করা হবে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 592,
			"arabicnumber": 592,
			"text": "৫৯২। আব্দুল্লাহ ইবনু কাতাদা (রাঃ) হতে তার পিতার সূত্রে বর্ণিত, তিনি (আবু কাতাদা) বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ নামাযের জন্য ইকামাত দেয়া হলে আমাকে (কামরা হতে) বের হতে না দেখা পর্যন্ত তোমরা দাড়াবে না। —সহীহ। সহীহ আবু দাউদ– (৫৫০), আর রাউজুন নামীর- (১৮৩), বুখারী ও মুসলিম। আবু ঈসা বলেনঃ আবু কাতাদার হাদীসটি হাসান সহীহ। এ অনুচ্ছেদে আনাস (রাঃ) হতেও হাদীস বর্ণিত আছে। কিন্তু তার হাদীসটি সুরক্ষিত নয়। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের একদল সাহাবা ও অন্যরা দাড়িয়ে দাঁড়িয়ে ইমামের জন্য বিলম্ব করা মাকরূহ বলেছেন। অপর দল বলেছেন, ইমাম মসজিদে হাযির থাকলে এবং নামাযের ইকামাতও বললে উঠে দাঁড়াবে। ইবনুল মুবারাক একথা বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 593,
			"arabicnumber": 593,
			"text": "৫৯৩। আবদুল্লাহ ইবনু মাসউদ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমি নামায আদায় করছিলাম এবং নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সাথে আবু বাকর এবং উমর (রাঃ)-ও উপস্থিত ছিলেন। আমি (শেষ বৈঠকে) বসলাম, প্রথমে আল্লাহ তা'আলার প্রশংসা করলাম, তারপর নবী সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লামের প্রতি সালাম নিবেদন করলাম, তারপর নিজের জন্য দু'আ করলাম। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তুমি প্রার্থনা করতে থাক তোমাকে দেয়া হবে, তুমি প্রার্থনা করতে থাক তোমাকে দেয়া হবে। -হাসান সহীহ। সিফাতুস সালাত, তাখরাজুল মুখতারাহ- (২৫৫), মিশকাত— (৯৩১)। এ অনুচ্ছেদে ফাযালী ইবনু উবাইদ (রাঃ) হতেও হাদীস বর্ণিত আছে। আবু ঈসা বলেনঃ আব্দুল্লাহ ইবনু মাসউদের হাদীসটি হাসান সহীহ। আহমাদ ইবনু হাম্বাল হাদীসটি ইয়াহইয়া ইবনু আদমের সূত্রে সংক্ষিপ্ত আকারে বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 594,
			"arabicnumber": 594,
			"text": "৫৯৪। আইশাহ (রাঃ) হতে বর্ণিত আছে, তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম পাড়ায় পাড়ায় মাসজিদ নির্মাণ করতে, তা পরিষ্কার-পরিচ্ছন্ন রাখতে এবং সুবাসিত করতে হুকুম দিয়েছেন। —সহীহ। ইবনু মাজাহ– (৭৫৯)।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 595,
			"arabicnumber": 595,
			"text": "৫৯৫। হিশাম ইবনু উরওয়া (রহঃ) হতে তাঁর পিতার সূত্রে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নির্দেশ দিয়েছেন........ উপরের হাদীসের মতোই। আবু ঈসা বলেনঃ এই বর্ণনা সূত্র পূর্ববর্তী সূত্রের চেয়ে বেশি সহীহ্।",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 596,
			"arabicnumber": 596,
			"text": "৫৯৬। হিশাম ইবনু উরওয়া (রহঃ) হতে তাঁর পিতার সূত্রে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নির্দেশ দিয়েছেন...... উপরের হাদীসের মতোই। সুফিয়ান সাওরী বলেছেন, পাড়ায় পাড়ায় মাসজিদ নির্মাণের অর্থ প্রতি বংশ ও লোকালয়ে মাসজিদ তৈরী করা।",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 597,
			"arabicnumber": 597,
			"text": "৫৯৭। ইবনু উমর (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লাম বলেনঃ রাত ও দিনের (নফল) নামায দুই রাকাআত দুই রাকাআত। —সহীহ। ইবনু মাজাহ– (১৩২২)। আবু ঈসা বলেনঃ শু’বার সঙ্গীরা ইবনু উমর (রাঃ)-এর হাদীসটি বর্ণনায় মত পার্থক্য করেছেন। তাদের কয়েকজন এটাকে মারফু' হিসেবে বর্ণনা করেছেন, আবার কয়েকজন মাওকুফ হিসেবে। নাফি (রহঃ) ইবনু উমারের সূত্রে একই রকম হাদীস বর্ণনা করেছেন। সহীহ বর্ণনা হলো, ইবনু উমার (রাঃ) নবী সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লামের নিকট হতে বর্ণনা করেছেন, “রাতের নামায দুই দুই রাকাআত”। নির্ভরযোগ্য (সিকাহ) রাবীগণ ইবনু উমারের সূত্রে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট হতে যে বর্ণনা করেছেন তাতে দিনের নামাযের উল্লেখ করেননি। ইবনু উমর (রাঃ) প্রসঙ্গে বর্ণিত আছে যে, তিনি রাতের নামায দুই রাকাআত করে এবং দিনের নামায চার রাক’আত করে আদায় করতেন। এ প্রসঙ্গে বিদ্বানদের মধ্যে মতের অমিল রয়েছে। ইমাম শাফিঈ ও আহমাদ রাত ও দিনের (ফরয ছাড়া অন্যান্য) নামায এক সালামে দুই দুই রাকাআত (করে আদায় করতে হবে) বলে মত দিয়েছেন। অপর একদল বলেছেন, রাতের নামায দুই দুই রাকাআত। তাদের মতে দিনের নফল ও অন্যান্য নামায চার রাকাআত করে, যেমন যুহরের পূর্বে চার রাকাআত আদায় করা হয়। সুফিয়ান সাওরী, ইবনুল মুবারাক ও ইসহাক এ মতেই মত দিয়েছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 598,
			"arabicnumber": 598,
			"text": "৫৯৮। আসিম ইবনু যামরা (রহঃ) হতে বর্ণিত আছে, তিনি বলেনঃ আমরা আলী (রাঃ)-কে রাসূলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লামের দিনের বেলার নামায প্রসঙ্গে প্রশ্ন করলাম। তিনি বললেন, তোমরা সে রকম নামায আদায় করতে সক্ষম হবে না। আমরা বললাম, আমাদের মধ্যে কে সে রকম আদায় করতে সক্ষম হবে? তিনি বললেন, যখন সূর্য এদিকে (পূর্বকাশে) এরূপ হতো যেমন আসরের সময় হয়ে থাকে, তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দুই রাকাআত (সালাতুল ইশরাক) নামায আদায় করতেন। আবার যখন সূর্য এদিকে (পূর্বকাশে) এরূপ হতো, যেমন যুহরের ওয়াক্তের সময় (পশ্চিমাকাশে) হয় তখন তিনি চার রাকাআত (সালাতুদ যুহা) নামায আদায় করতেন। তিনি যুহরের পূর্বে চার রাকাআত এবং পরে দুই রাকাআত এবং আসরের পূর্বে চার রাকাআত নামায আদায় করতেন। তিনি নৈকট্য লাভকারী ফেরেশতা, নবী-রাসূল এবং তাদের অনুসারী মু'মিন মুসলিমদের প্রতি সালাম পাঠানোর মাধ্যমে প্রতি দুই রাকাআতের মাঝখানে অন্তরাল সৃষ্টি করতেন। (অর্থাৎ দুই দুই রাকাআত করে আদায় করতেন)। —হাসান। ইবনু মাজাহ- ১১৬১)।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 599,
			"arabicnumber": 599,
			"text": "৫৯৯। অপর একটি সূত্রেও আসিম (রাঃ) হতে এ হাদীসটি বর্ণিত হয়েছে। এটি হাসান হাদীস। ইসহাক ইবনু ইবরাহীম বলেন, নবী সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লামের দিনের বেলার নফল নামায সম্পর্কে এ হাদীসটি সর্বাধিক সহীহ। ইবনুল মুবারাক এ হাদীসটিকে যঈফ বলতেন। আমার মতে তার এ হাদীসটিকে যঈফ বলার কারণ এই যে, আল্লাহ তা'আলাই বেশি ভাল জানেন, কেবল উল্লেখিত সূত্রেই হাদীসটি বর্ণিত হয়েছে। কিন্তু হাদীস বিশারদদের মতে আসিম ইবনু যামরা নির্ভরযোগ্য রাবী। সুফিয়ান সাওরী বলেন, আমাদের কাছে হারিসের হাদীসের তুলনায় আসিমের হাদীস বেশি উত্তম।",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 600,
			"arabicnumber": 600,
			"text": "৬০০। আয়িশাহ্ (রাঃ) হতে বর্ণিত আছে, তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার বিবিদের ওড়না, চাদর ইত্যাদিতে নামায আদায় করতেন না। —সহীহ। আবু দাউদ- (৩৯১)। আবু ঈসা বলেনঃ এ হাদীসটি হাসান সহীহ। এ ব্যাপারে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট হতে সম্মতির কথাও উল্লেখ আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 601,
			"arabicnumber": 601,
			"text": "৬০১। আয়িশাহ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমি (যখন) আসলাম রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (তখন) নামায আদায় করছিলেন। এ সময় ভিতর হতে ঘরের দরজা আটকানো ছিল। তিনি (নামাযরত অবস্থায়) হেঁটে এসে আমার জন্য দরজা খুলে দিলেন। তারপর তিনি নিজের জায়গায় ফিরে আসলেন। দরজাটি কিবলার দিকে ছিল। —হাসান। সহীহ আবু দাউদ- (৮৫৫), মিশকাত— (১০০৫), আল-ইরওয়া— (৩৮৬)। আবু ঈসা বলেনঃ হাদীসটি হাসান গারীব।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 602,
			"arabicnumber": 602,
			"text": "৬০২। আমাশ (রহঃ) হতে বর্ণিত আছে, তিনি বলেন, আমি আবু ওয়ায়িলকে বলতে শুনেছি, এক ব্যক্তি আবদুল্লাহ ইবনু মাসউদ (রাঃ)-কে (সূরা মুহাম্মাদের) একটি শব্দ প্রসঙ্গে প্রশ্ন করল, এটা কি গাইর আসিনিন’ হবে না 'গাইরু ইয়াসিনিন’ হবে? তিনি বললেন, এটা ছাড়া তুমি কি সমগ্র কুরআন পাঠ করে নিয়েছ? সে বললঃ হ্যাঁ। তিনি বললেন, একদল লোক কুরআন পাঠ করে এবং তারা এটাকে ঝাড়ে নিম্নমানের খেজুর ঝাড়ার মত। তাদের (কুরআন) পাঠ তাদের কণ্ঠনালীর উপরে উঠে না। আমি দুই দুইটি সাদৃশ্যপূর্ণ সূরা সম্পর্কে জানি যেগুলো রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একত্রে মিলিয়ে পাঠ করতেন। রাবী বলেন, আমরা আলকামা (রহঃ)-কে প্রশ্ন করতে বললে তিনি আবদুল্লাহ ইবনু মাসউদ (রাঃ)-কে প্রশ্ন করলেন। তিনি বললেন, মুফাস্সাল সূরাগুলোর মধ্যে এমন বিশটি সূরা রয়েছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যেগুলোর দুই দুইটিকে পরস্পরের সাথে মিলিয়ে প্রতি রাকাআতে পাঠ করতেন (অর্থাৎ এক এক রাকাআতে দুটি করে সূরা পাঠ করতেন)। -সহীহ। সহীহ আবু দাউদ- (১২৬২), সিফাতুস সালাত, বুখারী ও মুসলিম। আবু ঈসা বলেনঃ এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 603,
			"arabicnumber": 603,
			"text": "৬০৩। আবু হুরাইরা (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লাম বলেনঃ কোন ব্যক্তি সুন্দরভাবে ওযু করল তারপর নামাযের উদ্দেশ্যে রাওয়ানা হল। একমাত্র নামাযই তাকে (ঘর হতে) বের করল অথবা নামাযই তাকে উঠিয়েছে, এ অবস্থায় তার প্রতিটি কদমের বিনিময়ে আল্লাহ তা'আলা তার একগুণ মর্যাদা বৃদ্ধি করে দিবেন অথবা একটি করে গুনাহ মাফ করে দিবেন। —সহীহ। ইবনু মাজাহ– (৭৭৪), বুখারী ও মুসলিম। আবু ঈসা বলেনঃ এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 604,
			"arabicnumber": 604,
			"text": "৬০৪। সা'দ ইবনু ইসহাক ইবনু কাব ইবনু উজরা (রাঃ) হতে পর্যায়ক্রমে তার পিতা এবং দাদার সূত্রে বর্ণিত আছে, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আবদুল আশহাল গোত্রের মসজিদে মাগরিবের নামায আদায় করলেন। লোকেরা নফল নামায আদায় করতে দাড়াল। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, এ নামায অবশ্যই তোমাদের ঘরে আদায় করা উচিৎ। -হাসান। ইবনু মাজাহ– (১১৬৫)। আবু ঈসা বলেনঃ এ হাদীসটি গারীব। কেননা এটা আমরা শুধুমাত্র উল্লেখিত সূত্রেই জেনেছি। ইবনু উমারের সূত্রে বর্ণিত হাদীসটি সহীহ। তাতে আছে, “নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মাগরিবের পরের দুই রাকাআত নিজের ঘরেই আদায় করতেন।\" হুযাইফা (রাঃ) হতে বর্ণিত আছে, “নবী সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লাম মাগরিবের নামায আদায় করলেন, তিনি বরাবর মসজিদে নামায আদায় করতে থাকলেন। এমনকি ইশার ওয়াক্ত উপস্থিত হলো। তিনি ইশার নামায আদায় করলেন।” নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মাগরিবের পর দুই রাকাআত (সুন্নাত) নামায মসজিদেও আদায় করেছেন, এ হাদীস হতে তার প্রমাণ পাওয়া যায়।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 605,
			"arabicnumber": 605,
			"text": "৬০৫। কাইস ইবনু আসিম (রাঃ) হতে বর্ণিত আছে, তিনি ইসলাম কবুল করলেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে কূলের পাতা মেশানো পানি দিয়ে গোসল করার হুকুম দিলেন। —সহীহ। তাখরীজুল মিশকাত— (৫৪৩), সহীহ আবু দাউদ- (৩৮১)। আবু ঈসা বলেনঃ এ হাদীসটি হাসান। উপরোক্ত সনদসূত্রেই আমরা হাদীসটি অবগত হয়েছি। এ অনুচ্ছেদে আবু হুরাইরা (রাঃ) হতেও হাদীস বর্ণিত আছে। এ হাদীসের পরিপ্রেক্ষিতে আলিমগণ বলেছেন, মুসলিম হওয়ার সময় গোসল করা ও পরনের পোশাক ধোয়া মুস্তাহাব।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 606,
			"arabicnumber": 606,
			"text": "৬০৬। আলী ইবনু আবু তালিব (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ জিনের দৃষ্টি ও আদম সন্তানের লজ্জাস্থানের মাঝখানে পর্দা হলো, যখন তাদের কেউ পায়খানায় প্রবেশ করে সে যেন বিসমিল্লাহ বলে। —সহীহ। ইবনু মাজাহ– (২৯৭)। আবু ঈসা বলেনঃ এ হাদীসটি গারীব। শুধুমাত্র উপরোক্ত সূত্রেই আমরা হাদীসটি জেনেছি। এর সনদ খুব একটা নির্ভরযোগ্য নয়। এ প্রসঙ্গে আনাস (রাঃ) হতেও হাদীস বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 607,
			"arabicnumber": 607,
			"text": "৬০৭। আবদুল্লাহ ইবনু বুসর (রাঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ কিয়ামতের দিন আমার উম্মাতের মুখ-মন্ডল সিজদার কল্যাণে আলোক উদ্ভাসিত হবে এবং ওযুর কল্যাণে হাত-মুখ চমকপ্রদ (আলোকিত) হবে। -সহীহ। আস-সহীহাহ– (২৮৩৬)। আবু ঈসা বলেনঃ এ হাদীসটি উপরোক্ত সূত্রে হাসান, সহীহ্ গারীব।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 608,
			"arabicnumber": 608,
			"text": "৬০৮। আয়িশাহ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লাম পবিত্রতা অর্জন, মাথা আচড়ানো এবং জুতা পরার সময় এ কাজগুলো ডান দিক থেকে শুরু করাই পছন্দ করতেন। —সহীহ। ইবনু মাজাহ– (৪০১)। বুখারী ও মুসলিম অনুরূপ বর্ণনা করেছেন। আবু ঈসা বলেনঃ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 609,
			"arabicnumber": 609,
			"text": "৬০৯। আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ দুই রিতল পানিই ওযুর জন্য যথেষ্ট। —সহীহ। ইবনু মাজাহ– (২৭০)। আবু ঈসা বলেনঃ হাদীসটি গারীব। আমরা শুধুমাত্র উপরোক্ত সূত্রেই উপরোক্ত শব্দে হাদীসটি জেনেছি। আনাস (রাঃ) হতে অপর এক বর্ণনায় আছে– “রাসূলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লাম এক মাকুক পানি দিয়ে ওযু এবং পাঁচ মাকুক পানি দিয়ে গোসল করতেন।” অপর বর্ণনায় আছে, আনাস (রাঃ) বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক মুদ্দ পানি দিয়ে ওযু এবং এক সা’ পানি দিয়ে গোসল করেছেন। এই হাদীসটি শারীকের হাদীস হতে অধিক সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 610,
			"arabicnumber": 610,
			"text": "৬১০। আলী ইবনু আবু তালিব (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দুগ্ধপোষ্য শিশুর পেশাব প্রসঙ্গে বলেনঃ পুরুষ শিশুর পেশাবে পানি ছিটিয়ে দিতে হবে এবং কন্যা শিশুর পেশাব ধুয়ে ফেলতে হবে। কাতাদা (রহঃ) বলেনঃ শিশুরা যতক্ষণ শক্ত খাবার না ধরবে ততক্ষণ এই নির্দেশ বহাল থাকবে। শক্ত খাবার খাওয়া শুরু করলে উভয়ের পেশাবই ধুয়ে ফেলতে হবে। -সহীহ। ইবনু মাজাহ– (৫২৫)। আবু ঈসা বলেনঃ এ হাদীসটি হাসান সহীহ। হিশাম আদ-দাসতাওয়াঈ এটি মারফু হিসেবে এবং কৃতাদা মাওকুফ হিসেবে বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 611,
			"arabicnumber": 611,
			"text": "৬১১। শাহর ইবনু হাওশাব হতে বর্ণিত; তিনি বলেনঃ আমি জারীর ইবনু আব্দুল্লাহ (রাঃ)-কে ওযু করতে ও মোজার উপর মসাহ করতে দেখলাম। ও তাকে এ বিষয়ে সিজ্ঞেস করলাম। তিনি বলেনঃ আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে ওযু করতে ও মোজার উপর মাসাহ করতে দেখেছি। আমি তাকে বললাম, এটা কি সূরা আল-মায়িদাহ অবতীর্ণ হওয়ার পূর্বে না পরে? তিনি বললেনঃ আমি তো মায়িদাহ অবতীর্ণ হওয়ার পরেই মুসলিম হয়েছি। —সহীহ। ইরওয়া— (১/১৩৭)।",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 612,
			"arabicnumber": 612,
			"text": "৬১২। খালিদ ইবনু যিয়াদ থেকে অন্য সূত্রেও হাদীসটি অনুরূপ বর্ণিত হয়েছে। আবু ঈসা বলেনঃ এই হাদীসটি গারীব। শাহর ইবনু হাওশাব থেকে মুকাতিল ইবনু হাইয়ান ছাড়া অন্য কোন সূত্রে হাদীসটি জানতে পারিনি।",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 613,
			"arabicnumber": 613,
			"text": "৬১৩। আম্মার (রাঃ) হতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অপবিত্র ব্যক্তিকে নামাযের ওযুর মতো ওযু করে খাওয়া-দাওয়া ও ঘুমানোর সম্মতি দিয়েছেন। যঈফ, যঈফ আবূ দাউদ (২৮) আবূ ঈসা বলেনঃ এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 614,
			"arabicnumber": 614,
			"text": "৬১৪। কাব ইবনু উজরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে বললেনঃ হে কা'ব ইবনু উজরা! আমার পরে যেসব নেতার উদয় হবে আমি তাদের (খারাবী) থেকে তোমার জন্য আল্লাহ তা'আলার সহায়তা প্রার্থনা করি। যে ব্যক্তি তাদের দ্বারস্থ হলো (সান্নিধ্য লাভ করলো), তাদের মিথ্যাকে সত্য বললো এবং তাদের স্বৈরাচার ও যুলুম-নির্যাতনে সহায়তা করলো, আমার সাথে এ ব্যক্তির কোন সম্পর্ক নেই এবং এ ব্যক্তির সাথে আমারো কোন সংস্রব নেই। এ ব্যক্তি কাওসার’ নামক হাউজের ধারে আমার নিকট আসতে পারবে না। অপরদিকে যে ব্যক্তি তাদের দ্বারস্থ হলো (তাদের কোন পদ গ্রহণ করলো) কিন্তু তাদের মিথ্যাকে সত্য বলে মানল না এবং তাদের স্বৈরাচার ও যুলুম-নির্যাতনে সহায়তা করলো না, আমার সাথে এ ব্যক্তির সম্পর্ক রয়েছে এবং এ ব্যক্তির সাথে আমারও সম্পর্ক রয়েছে। শীঘ্রই সে কাওসার’ নামক হাউজের কাছে আমার সাথে দেখা করবে। হে কা'ব ইবনু উজরা নামায হলো (মুক্তির) সনদ, রোযা হলো মজবুত ঢাল (জাহান্নামের বিরুদ্ধে প্রতিবন্ধক) এবং সাদাকা (যাকাত বা দান-খয়রাত) গুনাহসমূহ মিটিয়ে দেয়, যেভাবে পানি আগুনকে নিভিয়ে দেয়। হে কাব ইবনু উজরা! হারাম (পস্থায় উপার্জিত সম্পদ) দ্বারা সৃষ্ট ও পরিপুষ্ট গোশত (দেহ)-এর জন্য (জাহান্নামের) আগুনই উপযুক্ত। —সহীহ। তালীকুর রাগীব- (৩/১৫, ১৫০) আবু ঈসা বলেনঃ এ হাদীসটি হাসান গারীব। আমরা শুধুমাত্র উল্লেখিত সূত্রেই হাদীসটি জেনেছি। আমি মুহাম্মাদকে (বুখারীকে) এ হাদীস প্রসঙ্গে প্রশ্ন করলাম। তিনিও শুধুমাত্র উবাইদুল্লাহ ইবনু মূসার সূত্রেই হাদীসটি বর্ণনা করেছেন এবং এটাকে খুবই গারীব বলেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 615,
			"arabicnumber": 615,
			"text": "৬১৫। ইমাম মুহাম্মদ বলেন, ইবনু নুমাইর উবাইদুল্লাহ ইবনু মূসার সূত্রে গালিব হতে অনুরূপ হাদীস বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 616,
			"arabicnumber": 616,
			"text": "৬১৬। আবু উমামা (রাঃ) বলেনঃ আমি রাসূলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লামকে বিদায় হাজের ভাষণে বলতে শুনেছি, তিনি বলেছেনঃ তোমাদের প্রতিপালক আল্লাহ তা'আলাকে ভয় কর, তোমাদের পাঁচ ওয়াক্ত নামায আদায় কর। তোমাদের রামাযান মাসের রোযা রাখ, তোমাদের ধন-দৌলতের যাকাত আদায় কর এবং তোমাদের আমীরের অনুসরণ কর, তবেই তোমাদের রবের জান্নাতে প্রবেশ করতে পারবে। আমি (সুলাইম) আবু উমামা (রাঃ)-কে প্রশ্ন করলাম, আপনি কতদিন পূর্বে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট এ হাদীস শুনেছেন? তিনি বলেনঃ আমি তিরিশ বছর বয়সে তার নিকট এ হাদীস শুনেছি। —সহীহ। আস-সহীহাহ– (৮৬৭)। আবু ঈসা বলেনঃ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 73
			}
		}
	]
}