{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"3": "The Book Of The Prayer For Rain (Kitab al-Istisqa')"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1178,
			"arabicnumber": 1178,
			"text": "আহমাদ ইবন হাম্বল (রহঃ) ..... জাবের ইবন আব্দুল্লাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর যুগে তাঁর প্রিয় পুত্র ইব্রাহিমের মৃত্যুর দিন সূর্যগ্রহণ হলে লোকেরা বলাবলি করতে থাকে যে, ইব্রাহিমের ইন্তিকালের ফলে সূর্যগ্রহণ হয়েছে। নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম লোকদের নিয়ে ছয়টি রুকু ও চারটি সিজদাহ সহকারে দুই রাকাত নামায আদায় করেন। তিনি \"আল্লাহু আকবার\" বলে তাহরিমা বাঁধার পর দীর্ঘক্ষণব্যাপী কিরাত পাঠের পর রুকুতে গিয়ে অনুরূপ সময় অতিবাহিত করেন। অতঃপর তিনি মাথা তলার পর পূর্বের কিরাতের চেয়ে ছোট কিরাত পাঠ করে পুনরায় রুকুতে যান এবং দাঁড়ানোর সমপরিমান সময় রুকুতে থাকার পর পুনরায় মাথা উঠিয়ে দ্বিতীয় বারের চেয়ে আরও ছোট সূরা তিলাওয়াত করেন। অতঃপর তিনি রুকুতে গিয়ে দাঁড়ানোর সমপরিমান সময় অতিবাহিত করে মাথা তোলেন এবং পরে সিজদায় যান। তিনি দুইটি সিজদা করার পর দ্বিতীয় রাকাতের জন্য দণ্ডায়মান হন এবং এখানেও তিনি সিজদায় যাওয়ার পূর্বে তিনটি রুকু করেন। তাঁর দ্বিতীয় রাকাতের (দাঁড়ানোর) সময়ও দীর্ঘ ছিল, কিন্তু তার পরিমান প্রথম কিয়ামের চেয়ে দ্বিতীয় ও তৃতীয় কিয়ামের সময় যথাক্রমে কম ছিল এবং তাঁর রুকুতে অবস্থানের সময় কিয়ামের সমপরিমান ছিল। অতঃপর তিনি তাঁর দাঁড়ানোর স্থান হতে পেছনে সরে আসেন, যার ফলে মুসল্লিদের কাতার কিছুটা পিছনের দিকে সরে যায়। পুনরায় তিনি সস্থানে আসেন, এবং মুসল্লিগণও স্ব স্ব স্থানে ফিরে আসেন। এবং এইরূপে নামায শেষ করার মুহূর্তে সূর্যগ্রহণ শেষ হয়ে যায়। এ সময় তিনি ইরশাদ করেনঃ হে লোকগণ! নিশ্চয়ই চন্দ্র ও সূর্য আল্লাহ্‌ তাআলার মহান নিদর্শনাবলির অন্যতম। এরা কোন ব্যাক্তির মৃত্যুতে রাহুগ্রস্ত হয়না। অতএব যখন তোমরা গ্রহন হতে দেখবে, তখন তা পরিষ্কার না হওয়া পর্যন্ত নামাযে রত থাকবে। এইরূপে হাদিসের বাকি অংশ বর্ণিত হয়েছে। (মুসলিম)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 18
			}
		}
	]
}