{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"5": "Prayer (Kitab Al-Salat): Voluntary Prayers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1277,
			"arabicnumber": 1277,
			"text": "আর-রবী ইবন নাফে (রহঃ) .... আমর ইবন আনবাসা আস-সুলামী (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি বললাম, ইয়া রাসূলাল্লাহ! রাতের কোন অংশে আল্লাহ পাক দু’আ অধিক কবুল করেন? তিনি বলেনঃ রাতের শেষাংশে। অতএব তখন তুমি তোমার ইচ্ছামত নামায আদায় করবে। কেননা ঐ সময়ের নামাযে বিশেষ ফেরেশতারা উপস্থিত হয়ে তা তাদের নিকট রক্ষিত আমলনামায় লিপিবদ্ধ করে নেয় এবং তারা ফজরের সূর্য উঠা পর্যন্ত উপস্থিত থাকে। অতঃপর তুমি সূর্য উঠা পর্যন্ত অপেক্ষা করবে এবং এর পরিমাণ হল, এক বা দুই তীরের সমান। কেননা সূর্য শয়তানের দুই শিংয়ের মাঝখান দিয়ে উদিত হয় এবং ঐ সময় কাফিররা শয়তানের পূজা করে। অতঃপর তোমার ইচ্ছানুযায়ী নামায আদায় করবে। কেননা প্রত্যেক নামাযের সময়ই ফেরেশতারা দফতরসহ উপস্থিত হয়ে থাকে এবং ঠিক দ্বিপ্রহরের পূর্ব পর্যন্ত নামায আদায় করা যায়। অতঃপর সূর্য পশ্চিমাকাশে ঢলে না যাওয়া পর্যন্ত অপেক্ষা করবে। কেননা এই সময় জাহান্নামের আগুন প্রবলভাবে উদ্দীপিত হতে থাকে এবং এর দরজাসমূহ উন্মুক্ত করে দেয়া হয়। অতঃপর সূর্য পশ্চিমাকাশে ঢলে যাওয়ার পর তুমি তোমার খুশীমত আসরের পূর্ব পর্যন্ত নামায আদায় করতে পার। কেননা প্রত্যেক নামাযের সময় ফেরেশাতার হাযির হয়ে থাকে। আসরের ফরয নামায আদায়ের পর হতে সূর্যাস্ত পর্যন্ত কোনরূপ নামায পড়া থেকে বিরত থাকবে। কেননা শয়তানের দুই শিংয়ের মধ্যবর্তী স্থান দিয়ে সূর্য অস্তচলে যায় এবং কাফিররা ঐ সময় শয়তানের পূজা করে থাকে। অতঃপর রাবী দীর্ঘ হাদীছ বর্ণনা করেন। রাবী আব্বাস ইবন সালিম (রহঃ) বলেন, আবু সালামা (রহঃ) ... আবু উমামা (রাঃ) হতে আমার নিকট ঐরূপ হাদীছ বর্ণনা করেছেন। তবে অনিচ্ছাকৃতভাবে যদি আমার বর্ণনায় কোন ভুলত্রুটি হয়ে থাকে সেজন্য আমি আল্লাহর নিকটে তওবা ও ক্ষমা প্রার্থনা করছি। (তিরমিযী, মুসলিম)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 28
			}
		}
	]
}