{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"9": "Zakat (Kitab Al-Zakat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1591,
			"arabicnumber": 1591,
			"text": "অনুচ্ছেদঃ উটের বয়স সম্পর্কে ইমাম আবু দাউদ (রহঃ) বলেন, আমি রায়্যাশী, আবু হাতীম ও অন্যুদের নিকট হতে এই বর্ণনা শুনেছি এবং নাদর ইব্‌ন শুমায়েল ও আবু উবায়দের গ্রন্থে পেয়েছি, কোন কোন কথা তাদের একজনেই বলেছেন। তাঁরা বলেন, উটের বাচ্চাকে (যতকক্ষণ মাতৃগর্ভে থেকে) 'আল-হাওয়্যার', ‘আল-ফাসীল (যখন ভূমিষ্ঠ হয়) ও বিন্‌ত মাখাদ (যে বাচ্চা দ্বিতীয় বছরে পদার্পন করেছে), আর তিন বছর বয়সে পদার্পণকারী বাচ্চাকে 'বিনতে লাবূন' বলা হয়। অতঃপর উটের বয়স পূর্ণ তিন বছর হতে চার বছর পূর্ণ হওয়া পর্যন্ত বলা হয়, হিক্ক ও হিক্‌কাহ্‌। কেননা তখন হিক্কাহ বাহনের যোগ্য হয় বাচ্চা ধারণের উপযোক্ত হয় এবং যৌবনে পৌঁছে। কিন্তু হিক্কাহ ছয় বছরে না পৌঁছা পর্যন্ত প্রাপ্তবয়ষ্ক হয় না এবং হিক্‌কাহ্‌কে ‘তুরুকাতুল ফাহল’ও বলা হয়। কেননা ঐ সময় পুরুষ উট এর উপর কুঁদে পড়ে। অতঃপর যখন তার বয়স পাঁচ বছর পড়ে তখন তাকে জাযাআহ্‌ বলে এবং পাঁচ বছর পূর্ণ হওয়া পর্যন্ত তাকে এই নামেই অখ্যায়িত করা হয়। অতঃপর যখন তা ছয় বছরে পদার্পণ করে এবং সামনের দাঁত উঠে তখন তাকে ‘ছানা' বলে – ছয় বছর পূর্ণ হওয়া পর্যন্ত। অতঃপর যখন তার বয়স সাত শুরু হয় তখন হতে সাত বছর পূর্ণ হওয়া পর্যন্ত পুরুষ উটকে বলা হয় ‘রুবাঈ’ এবং স্ত্রী উষ্ট্রীকে বলা হয় ‘রুবাইয়া’। অতঃপর তা যখন আট বছরে পদার্পণ করে তখন থেকে তাকে ‘সাদীস’ বলে আট পূর্ণ হওয়া পর্যন্ত। যখন তা নয় বছরে পদার্পণ করে তখন তাকে ‘বাযিল্‌’ বলা হয়। কারণ তখন তাঁর কুঁজ নির্গত হতে থাকে। অতঃপর উট যখন দশ বছরে পদার্পণ করে তখন তাকে ‘মুখলিফা’ বলে। এর পরে উটের আর কোন নামকরণ নাই। অবশ্য এর পরে তাকে এক বছরের বাযিল, দুই বছরের বাযিল; এক বছরে মুখ্‌লি্‌ফ, দুই বছরের মুখ্‌লিফ, তিন বছরের মুখলিফ, চার বছরের মুখলিফ এবং পাঁচ বছরের মুখলিফ বলা হয়ে থাকে। গর্ভবতী উষ্ট্রীকে ‘হালাফা’ বলে। আবু হাতেম বলেন, জুযূআহ্‌ হল কাল প্রবাহের একটি সময়, কোন দাঁতের নাম নয়। উটের বয়সের পরিবর্তে হয় সুহাইল (Canopus) তারকা উদিত হওয়ার সাথে সাথে। আবু দাউদ (রহঃ) বলেন, আর-রিয়াশী আমাদেরকে নিম্নোক্ত কবিতা আবৃত্তি করে শুনানঃ (অর্থ) “রাতের প্রথম প্রহরে যখন সুহাইল তারকা উদিত হয়, তখন ইব্‌ন লাবূন হিক্কা হয়ে গেলে এবং হিক্কাহ জাযাআহ্‌ হয়ে গেল। হুবা ছাড়া এমন কোন বয়স নাই যা (সুহাইল তারকা উদয় থেকে) গণনা করা যায় না, হুবা সেই উষ্ট্রী শাবককে বলা হয় যা সুহাইল তারকা উদয়কালে ভুমিষ্ঠ হয় না, বরং অন্য সময় ভূমিষ্ঠ হয়। ১৫৯১. কুতায়বা ইব্‌ন সাঈদ (রহঃ) .... আমর ইব্‌ন শুআয়েব (রহঃ) থেকে পর্যায়ক্রমে তাঁর পিতা ও পিতামহের সূত্রে বর্ণিত। তিনি বলেন, নবী করীম সাল্লাল্লাহু আলাইহে ওয়াসাল্লাম ইরশাদ করেছেনঃ যাকাত আদায়কারী (যাকাত প্রদানকারীকে) দূরে টেনে নিবে না এবং যাকাতদাতা নিজের মাল দূরে সরিয়ে রাখবে না (যাতে লেনদেনে কষ্ট না হয়); আর তাদের যাকাতের মাল, তাদের ঘর-বাড়ি ব্যতীত অন্য কোথাও হতে গ্রহণ করা চলবে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 36
			}
		}
	]
}