{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"9": "Zakat (Kitab Al-Zakat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1641,
			"arabicnumber": 1641,
			"text": "আবদুল্লাহ্‌ ইব্‌ন মাস্‌লামা (রহঃ) ..... আনাস ইব্‌ন মালিক (রাঃ) হতে বর্ণিত। তিনি বলেন, এক আনসারী ব্যক্তি নবী করীম সাল্লাল্লাহু আলাইহে ওয়াসাল্লামের খিদমতে উপস্থিত হয়ে কিছু সাহায্য প্রার্থনা করে। তখন তিনি তাকে জিজ্ঞাসা করেনঃ তোমার ঘরে কি কিছু নাই? সে বলেঃ হ্যাঁ, একটি কম্বল মাত্র যার অর্ধেক আমি পরিধান করি এবং বাকী অর্ধেক বিছিয়ে শয়ন করি। আর আছে একটি পেয়ালা, যাতে আমি পানি পান করি। তিনি বলেনঃ উভয় বস্তু আমার নিকট নিয়ে আস। রাবী বলেনঃ সে তা আনয়ন করলে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহে ওয়াসাল্লাম তা স্বহস্তে ধারণ পূর্বক (নিলামের ডাকের মত) বলেনঃ কে এই দুটি ক্রয় করতে ইচ্ছুক? এক ব্যক্তি বলে, আমি তা এক দিরহামের বিনিময়ে গ্রহণ করতে চাই। অতঃপর তিনি বলেনঃ এক দিরহামের অধিক কে দিবে? তিনি দুই বা তিনবার এইরূপ উচ্চারণ করেন। তখন এক ব্যক্তি বলে, আমি তা দুই দিরহামের বিনিময়ে গ্রহণ করব। তিনি সেই ব্যক্তিকে তা প্রদান করেন এবং বিনিময়ে দুইটি দিরহাম গ্রহণ করেন। অতঃপর তিনি তা আনসারীর হাতে তুলে দিয়ে বলেনঃ এর একটি দিরহাম দিয়ে কিছু খাদ্য ক্রয় করে তোমার পরিবার-পরিজনদের দাও; আর বাকী এক দিরহাম দিয়ে একটি কুঠার কিনে আমার নিকট আস। লোকটি কুঠার কিনে আনলে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহে ওয়াসাল্লাম স্বহস্তে তাতে হাতল লাগিয়ে তার হাতে দিয়ে বলেনঃ এখন তুমি যাও এবং জংগল হতে কাঠ কেটে এনে বিক্রী কর। আর আমি যেন তোমাকে পনের দিন না দেখি। অতঃপর সে চলে গেল এবং কাঠ কেটে এনে বিক্রয় করতে থাকে। অতঃপর সে (পনের দিন পর) আসল। সে তখন প্রাপ্ত হয়েছিল দশটি দিরহাম যা দিয়ে সে কিছু কাপড় এবং কিছু খাদ্য ক্রয় করল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহে ওয়াসাল্লাম বলেনঃ ভিক্ষাবৃত্তির চাইতে এটা তোমার জন্য উত্তম। কেননা ভিক্ষাবৃত্তির ফলে কিয়ামতের দিন তোমার চেহারা ক্ষত-বিক্ষত হত। ভিক্ষা চাওয়া তিন শ্রেনীর ব্যক্তি ব্যতীত অন্যদের জন্য হালাল নয়ঃ (১) ধূলা-মলিন নিঃস্ব ভিক্ষুকের জন্য, (২) প্রচন্ড ঋণের চাপে জর্জরিত ব্যক্তির জন্য এবং (৩) যার উপর দিয়াত (রক্তপণ) আছে, অথচ তা পরিশোধের অক্ষমতার কারণে নিজের জীবন বিপন্ন— এ ধরনের ব্যক্তিরা যাচ্ঞা করতে পারে। (তিরমিযী, ইব্‌ন মাজা, নাসাঈ)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 86
			}
		}
	]
}