{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"11": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1778,
			"arabicnumber": 1778,
			"text": "সুলায়মান ইবন হারব (রহঃ) ...... আয়েশা (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমরা রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে যিলহাজ্জের নতুন চাঁদ উদয়ের কিছু আগে রওনা হলাম। যুলহুলায়ফাতে পৌঁছে তিনি বলেন, যে কেউ হজ্জের ইহরাম বাঁধতে পায়, সে যেন তা বাঁধে আর যদি কেউ উমরার ইহরাম বাঁধতে চায় তবে সে যেন তা-ই করে। উহাইবের সূত্রে মূসা কতৃৃর্ক বর্ণিত হাদীসে আছে, যদি আমার সাথে কুরবানীর পশু না থাকত, তবে আমি উমরার জন্য ইহরাম বাঁতাম। আর হাম্মাদ ইবন সালামের বর্ণনায় আছে, আমি (উমরার সাথে) হজ্জের ইহরাম বাঁধলাম। কেনানা আমার সাথে কুরবানীর পশু আছে। এরপর উভয় হাদীসের বর্ণনাকারী একমত হয়ে (হাদীসের বাকী অংশ) বর্ণনা করেন। এরপর আমি (আয়েশা) ছিলাম উমরার ইহরাধারী দলভূক্ত। পথিমধ্যে আমার হায়েয শুরু হল এবং আমি কাঁদতে লাগলাম। নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার কান্নার কারণ জিজ্ঞাসা করলে আমি বলি, যদি আমি এ বছর (হজ্জে) বের না হতাম, তবে ভাল ছিল। তখন তিনি বলেন, তোমার উমরা ত্যাগ কর, তোমার মাথার চুল খুলে ফেল এবং চিরুনি কর, এবং (রাবী মূসার বর্ণনা মতে) হজ্জের ইহরাম বাঁধ। রাবী সুলায়মানের বর্ণনায় আছে এবং মুসলিমেরা তাদের হজ্জে যা করে তুমিও তা-ই কর (তাওয়াফ ব্যতীত)। এরপর তাওয়াফে যিয়ারার রাতে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আবদুর রহমান (রাঃ)-কে (আয়েশার ভাই) নির্দেশ দিলে তিনি তাঁকে তানঈম নামক স্থানে যান। রাবী মূসার বর্ণনায় আরো আছে, এরপর তিনি (আয়েশা) তাঁর পূরববর্তী উমরার পরিবর্তে (নতুন) উমরার জন্য ইহরাম বাঁধেন। এরপর তিনি বায়তুল্লাহ্ তাওয়াফ করেন এবং আল্লাহ্ তাঁর হজ্জ ও উমরা পূর্ণ করেন। রাবী হিশামের বর্ণনায় আছে, আর এরূপ করার জন্য তাঁর উপর কুরবানী ওয়াজিব হয়নি। রাবী মুহাম্মদ ইবন সালামার হাদীসে আরও বর্ণনা করেছেন যে, বাতহার (মিনায় অবস্থানের) রাতে তিনি (হায়েয থেকে) পবিত্র হন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 58
			}
		}
	]
}