{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"11": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1905,
			"arabicnumber": 1905,
			"text": "আবদুল্লাহ ইবন মুহাম্মদ আন-নুয়াফলী .... জা‘ফর ইবন মুহাম্মদ (রহঃ) থেকে তাঁর পিতার সূত্রে বর্ণিত। তিনি বলেন, একদা আমরা জাবির ইবন আবদুল্লাহ্ (রাঃ) এর নিকট উপস্থিত হলাম। আমরা তাঁর নিকটবর্তী হওয়ার পর (অন্ধ হওয়া কারণে আগমণকারীদের সম্পর্কে) জিজ্ঞাসা করেন। আমার নিকট তাঁর প্রশ্নটি সমাপ্ত হওয়ার পর আমি বললাম, আমি মুহাম্মদ ইবন আলী ইবন হুসায়ন (রাঃ)। এতদশ্রবণে তিনি আমার মাথায় তাঁর হাত বোলান এবং কামীসের (জামার) উপর ও নিম্নাংশ টেনে তাঁর হস্ততালু আমার বুকের উপর স্থাপন করেন। এ সময় আমি যুবক ছিলাম। অতঃপর তিনি (জাবির) বলেনঃ তোমার জন্য মারহাবা ও খোশ-আমদেদ! হে ভ্রাতুষ্পুত্র তোমার যা ইচ্ছা, আমাকে জিজ্ঞাসা কর। আমি তাঁকে প্রশ্ন করি, আর তিনি ছিলেন অন্ধ। অতঃপর নামাযের সময় উপস্থিত হওয়ায় তিনি (জাবির) জায়নামাযে দন্ডায়মান হন, এমতাবস্থায় যে, তাঁর কাঁধে ভাঁজ করা চাঁদর ঝুলন্ত ছিল। অতঃপর তিনি (ইমাম) আমাদের সাথে নামায আদায় করেন এবং তাঁর বড় চাদর আলনায় সংরক্ষিত ছিল। আমি বললাম, আমাকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর বিদায় হজ্জ সম্পর্কে কিছু বলুন। জাবির (রাঃ) তাঁর হাতের প্রতি ইশারা করেন এবং (দু' হাতের) নয়টি আঙ্গুল বন্ধ করে বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মদীনায় নয় বছর অবস্থান করেন এবং এই সময় তিনি কোন হজ্জ সম্পন্ন করেননি। অতঃপর (অষ্টম হিজরীতে) মক্কা বিজয়ের পর, দশম হিজরীতে লোকদের নিকট এরূপ ঘোষণা দেয়া হয়ঃ রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হজ্জে গমণ করবেন। এতে মদীনায় অসংখ্য লোকের সমাগম হয় এবং প্রত্যেকেই রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর ইকতিদা করে তাঁর অনুরূপ ‘আমল করতে চায়। অতঃপর রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রওনা হলে, আমরাও তাঁর সাথে রওনা হই। অতঃপর আমরা যুল-হুলায়ফাতে উপনীত হই। ঐ সময় আসরা বিনতে উমায়স (রাঃ) মুহাম্মদ ইবন আবূ বাকরকে প্রসব করেন। তখন তিনি (আসমা) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট ইহরামের ব্যাপারে কী করবেন, তা জানার জন্য লোক পাঠান। তিনি বলেন, তুমি (পবিত্রতা হাসিলের জন্য) গোসল কর, কাপড় দ্বারা নিজের লজ্জাস্থান ব্যান্ডেজ কর এবং ইহরাম বাঁধ। অতঃপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যুল-হুলায়ফার মসজিদে দু‘ই রাকাত নামায আদায় করেন। অতঃপর তিনি তাঁর বাহণে (কাসওয়ায়) আররোহণ করে বায়দা নামক স্থানে উপস্থিত হন। জাবের (রাঃ) বলেন, আমি তাঁর সম্মুখভাগে, আমার দৃষ্টিসীমা পর্যন্ত কেবল আরোহী এবং পদাতিক লোকদের দেখি। তাঁর ডানে, বামে এবং পশ্চাতেও অনুরূপ লোক ছিল। এ সময় রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের মধ্যে ছিলেন এবং তাঁর নিকট তখনও কুরআন নাযিল হচ্ছিল। আর তিনি এর ব্যাখ্যা সম্পর্কেও ওয়াকিবহাল ছিলেন। আর তিনি যেরূপ আমল করছিলেন, আমরাও সেরূপ করছিলাম। অতঃপর তিনি তালবিয়া পাঠ শুরু করেন, যা তাওহীদ ভিত্তিক ছিল। (لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ لَبَّيْكَ لاَ شَرِيكَ لَكَ لَبَّيْكَ إِنَّ الْحَمْدَ وَالنِّعْمَةَ لَكَ وَالْمُلْكَ لاَ شَرِيكَ لَكَ) (অর্থ) ‘‘আমি উপস্থিত হে আল্লাহ্! আমি উপস্থিত, আমি উপস্থিত, তোমার কোনো শরীক নেই, আমি উপস্থিত, সকল প্রশংসা ও নে‘আমত তোমারই এবং সাম্রাজ্য, তোমার কোনো শরীক নেই।’’ আর লোকেরা এ কথার দ্বারা এবং এর অধিক দ্বারাও তালবিয়া পাঠ করছিল; কিন্তু এতদসত্তেও রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তা নিষেধ করেননি। আর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম স্বীয় তালবিয়া পাঠ অব্যাহত রাখেন। জাবির (রাঃ) বলেন, আমরা হজ্জের নিয়্যাত করি এবং উমরা সম্পর্কে কিছুই জানতাম না। অতঃপর (যিল হজ্জের চতুর্থ দিনে) আমরা তাঁর সাথে বায়তুল্লাহর নিকটবর্তী হই। তিনি হাজরে আসওয়াদকে চুম্বন করেন এবং তিনবার রমল এবং চারবার হেঁটে (তাওয়াফ) সম্পন্ন করেন। অতঃপর তিনি মাকামে উপস্থিত হন এবং বলেন, তোমরা মাকামে ইবরাহীমকে নামাযের স্থানে পরিণত কর। অতঃপর তিনি মাকামে ইবরাহীমের পশ্চাতে দু‘ই রাকাত নামায আদায় করেন। রাবী (জা‘ফর ইবন মুহাম্মদ) বলেন, আমার পিতা (মুহাম্মদ ইবন আলী ইবন হুসায়ন) বলতেন, রাবী ইবন নুফায়ল ও উসমান বলেন, তিনি নামাযে কী পড়েন তা আমার জানা নেই। তবে সুলায়মান নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, দুই রাকাতের এক রাকাতে সূরা ইখলাস ও অন্য রাকাতে সূরা কাফিরূণ পড়বে। অতঃপর তিনি বায়তুল্লাহর নিকট আগমণ করেন এবং হাজরে আসওয়াদ চুম্বন করেন। অতঃপর এর দরজা দিয়ে বের হয়ে তিন সাফার দিকে গমণ করেন। তিনি সাফার নিকটবর্তী হয়ে তিলোওয়াত করেনঃ ‘‘নিশ্চই সাফা ও মারওয়া, আল্লাহর নির্দেশবিলীর অন্যতম।’’ অতঃপর তিনি সাফা হতে সা‘ঈ শুরু করেন এবং এর উপর আরোহণ করে বায়তুল্লাহর ঘর দেখে বলেনঃ অর্থাৎ আল্লাহ্ই সর্বশ্রেষ্ঠ, আল্লাহ্ ব্যতীত কোন ইলাহ্ নেই, তাঁর কোনো শরীক নেই, তাঁর জন্যই সাম্রাজ্য, আর তাঁর জন্যই সকল প্রশংসা, তিনি সকল বস্তুর উপর ক্ষমতাবান। এক একক আল্লাহ্ ভিন্ন কোনো ইলাহ্ নেই, তিনি তাঁর প্রতিশ্রুতি পূর্ণ করেছেন এবং তা বান্দা মুহাম্মদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে সাহায্য করেছেন, এবং তিনি একাই সকল বাহিনীকে পরাভূত করেছেন।’’ অতঃপর তিনি এর মধ্যে দু‘আ করেন এবং তিনবার উত্তমরূপ ইরশাদ করেন। অতঃপর তিনি মারওয়ার দিকে গমণ করেন এবং দু' পর্বতের মধ্যবর্তী স্থানে রমল করেন। তিনি মারওয়ার উপর আরোহণ করে ঐ সমস্ত আমল করেন, যা তিনি সাফা পাহাড়ের উপর উঠে করেছিলেন। অতঃপর তিনি মারওয়ার তাওয়াফ সমাপ্ত করে বলেন, যা আমি পরে অবগত হয়েছি, যদি তা পূর্বে অবগত হতে পাতাম, তবে আমি কুরবানীর পশু অগ্রে প্রেরণ করতাম না এবং একে (হজ্জকে) উমরায় রূপান্তরিত করতাম। আর তোমাদের মধ্যে যাদের সাথে কুরবানীর পশু নেই, তারা যেন উমরার পর হালাল হয়, যাতে তা কেবল উমরা হয়। তখন নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এবং ঐ সমস্ত ব্যক্তিবর্গ যাদের সাথে কুরবানীর পশু ছিল তারা ব্যতীত অন্য সমস্ত লোকেরা হালাল হয় এবং তাদের চুল মুণ্ডন বা ছোট করে। তখন সুরাকা ইবন জা‘আশাম দন্ডয়মান হয়ে প্রশ্ন করেন, ইয়া রাসূলাল্লাহ্! এরূপ ব্যবস্থা (হজ্জের মধ্যে উমরা পালন) কি কেবল এ বছরের জন্য, না সর্বকালের জন্য? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর একহাতের অঙ্গুলি দু‘বার উচ্চারণ করেন। আর তা সর্বকালের জন্য। অতঃপর তিনি (জাবির) বলেন, এ সময় আলী (রাঃ) ইয়ামান হতে তাঁর নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কুরবানীর পশু সহ আগমণ করেন। ঐ সময় তিনি ফাতিমা (রাঃ)-কে হালাল অবস্থায় রঙিন কাপড় পরিহিতা এবং সুরমা ব্যবহারকারিণী দেখতে পেয়ে অপছন্দ করেন এবং জিজ্ঞাসা করেন, তোমাকে কে এরূপ করতে বলেছে? তিনি বলেন, আমার পিতা। জাবির (রাঃ) বলেন, আলী (রাঃ), যিনি তখন ইরাকের শাসনকর্তা ছিলেন বলেন, আমি তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর খিদমতে ফাতিমার কাজে রাগান্বিত হয়ে উপস্থিত হই এবং ঐ সম্পর্কে ফাতওয়া জিজ্ঞাসা করি, যা সে আমাকে বলেছিল। আর আমি তার কাজে অসুন্তুষ্ট হওয়ার কথা প্রকাশ করায়, ‘‘আমার পিতা আমাকে এরূপ করতে বলছে’’, তাও তাঁর কাছে বলি। তিনি বলেন, সে সত্য বলেছে, সে সত্য বলেছে। আচ্ছা, তুমি যখন হজ্জের নিয়্যাত করেছ, তখন কী বলেছ? তিনি বলেন, আমি বলেছে, ইয়া আল্লাহ্! আমি ঐরূপ ইহরাম বাঁধছি, যেরূপ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বেঁধেছেন। তিনি বলেন, আমার সাথে কুরবানীর পশু আছে, কাজেই তুমি আমার মত হালাল হতে পারবে না। জাবির বলেন, কুরবানীর পশু, যা আলী (রাঃ) ইয়ামান হতে সঙ্গে আনেন এবং যা মদীনা হতে নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে এনেছিলেন এর মোট সংখ্যা ছিল এক‘শ। এমতাবস্থায় নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এবং যাদের সাথে কুরবানীর পশু ছিল, তারা ব্যতীত অন্য সকলে হালাল হয় এবং তাদের মস্তক মুণ্ডন বা চুল ছোট করে। রাবী (জাবির (রাঃ) বলেন, অতঃপর তালবিয়ার দিন (৮ই যিল হজ্জ) আসলে, তাঁরা মিনায় গমণ করেন এবং হজ্জের জন্য ইহরাম বাঁধেন। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর বাহণে সাওয়ার হন এবং মিনায় পৌঁছে যোহর, আসর, মাগরিব এশা এবং ফজরের আযান আদায় করেন এবং সূর্যোদয় পর্যন্ত সে স্থানে অবস্থান করেন। অতঃপর তিনি তাঁর জন্য একটি পশমী কাপড়ের তাঁবু টানাতে নির্দেশ দেন। তাঁর জন্য নামেরা নামক স্থানে তা টানানো হলে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সেখানে গমণ করেন। যাতে কুরাশরা এরূপ সন্দেহ করতে না পারে যে, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হারামের নিকটবর্তী স্থান মুযদালিফায় অবস্থান করবেন, (এবং আরাফাতে গমণ করবেন না), যেরূপ কুরায়শরা জাহিলিয়াতের যুগে করত। এরপর রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মুযদলিফা অতিক্রম করে আরাফাতে পৌঁছান এবং তাঁর জন্য প্রস্তুতকৃত তাঁবু যা নামেরাতে স্থাপন করা হয়, সেখানে উপস্থিত হন। অতঃপর সূর্য পশ্চিমাকাশে ঢলে পড়লে তিনি তাঁর বাহণ প্রস্তুতের নির্দেশ দেন এবং তাতে আরোহণ করে বাতনে ওয়াদী নামক স্থানে গমণ করেন। অতঃপর তিনি লোকদের উদ্দেশ্যে খুতবা প্রদান প্রসংগে বলেন, তোমাদের রক্ত ও সম্পদ (একে অপরের জন্য) হারাম। যেমন হারাম (পবিত্র) তোমাদের আজকের এ দিন, এ মাস ও এ শহর। খবরদার! জাহিলিয়া যুগের সর্বপ্রকার কাজকর্ম (আজ) আমার পায়ের নিচে বাতিল ঘোষিত হল। জাহিলিয়া যুগের রক্ত (প্রতিশোধ গ্রহণ) পরিত্যক্ত হল। আর সর্বপ্রথম আমি আমার পক্ষ হতে (আহলে ইসলামের) যে রক্ত প্রবাহিত হয়েছে, তা দাবি পরিত্যাগ করলাম। উসমান বলেন, এটা আবূ রাবী‘আর রক্ত। আর সুলায়মান (রাঃ) বলেন, এটা রাবী‘আ ইবনুল হারিস ইবন আবদুল মুত্তালিবের খুনের রক্ত। সে (ইবন রাবী‘আ) ছিল বনী সা‘আদ গোত্রের একটি শিশুপুত্র, যাকে হুযায়ল গোত্রের লোকেরা হত্যা করে। আর জাহিলিয়া যুগের সুদ প্রথা বাতিল ঘোষিত হল। আর এ প্রসংগে আমি আমাদের প্রাপ্য সুদ, যা আব্বাস ইবন আবদুল মুত্তালিবের সবই বাতিল করলাম। আর তোমরা স্ত্রীদের ব্যাপারে আল্লাকে ভয় কর। কেননা তোমরা তাদেরকে আল্লাহর আমানত হিসাবে গ্রহণ করেছ, আর আল্লাহর তা‘আলার নির্দেশে তোমরা তাদের স্ত্রী-অঙ্গ (ব্যবহার) হালাল করেছ (অর্থাৎ শরী‘আত সম্মত পন্থায় ইজাব-কবূলের দ্বারা তাদের বিবাহ করেছ)। তাদের উপর তোমাদের হক এই যে, তারা যেন তোমাদের বিছানায় এমন কোন লোককে আসার অনুমতি প্রদান না করে, যাকে সে (স্বামী) অপছন্দ করে। যদি তারা এরূপ করে, তবে তাদের (এ জন্য) সামান্য প্রহার করবে। আর তোমাদের উপর তাদের উত্তমরূপে ভরণপোষনের দায়িত্ব অর্পিত হয়েছে। আমি তোমাদের মধ্যে একটি বিশেষ বস্তু রেখে যাচ্ছি। আমার পরে যদি তোমরা তা মজবুত ভাবে ধারণ কর, তবে তোমরা কখনও গোমরাহ্ হবে না। আর তা হলো আল্লাহর কিতাব। আর তোমাদেরকে (কিয়ামতের দিন) আমার প্রসঙ্গে জিজ্ঞাসা করা হবে, তখন তোমরা আমার সম্পর্কে কী বলবে? সাহাবীগণ বলেন, আমরা এরূপ সাক্ষ্য প্রদান করব যে, আপনি আপনার (রিসালাতের) দায়িত্ব সঠিকভাবে পৌঁছিয়েছেন, আপনার (আমানতের) হক আদায় করেছেন এবং আপনি আপনার (উম্মতকে) নসীহত করেছেন। অতঃপর তিনি তাঁর শাহাদাত অঙ্গুলি আকাশের দিকে উত্তোলন করেন এবং পরে লোকদের প্রতি ইশারা কবলেন, হে আল্লাহ্! তুমি সাক্ষী থেকো, হে আল্লাহ্! তুমি সাক্ষী থোকো, হে আল্লাহ্! তুমি সাক্ষী থেকো। অতঃপর তিনি বিলাল (রাঃ)-কে আযান দেওয়ার নির্দেশ দেন এবং যোহরের নামায আদায় করেন। অতঃপর দন্ডায়মান হয়ে আসরের নামাযও আদায় করেন এবং তিনি এর সাথে অন্য কোনো কিছুই (সুন্নাত, নফল ইত্যাদি আদায় করেননি। (অর্থাৎ যোহর ও আসরের নামায পরপর আদায় করেন।) অতঃপর তিঁনি তাঁর বাহনে সওয়ার হন এবং আরাফাতে (মূল ভূমিতে) গমণ করেন। অতঃপর তিনি তাঁর বাহণ উষ্ট্রীকে বড় প্রস্তরের নিকট (যা জাবালে রহমতের নিকটে অবস্থিত) নিয়ে যান এবং হাবল আল মাশাত-কে সম্মুখে রাখেন এবং কিবলামূখী হন। আর সূর্যাআস্ত পর্যন্ত সেখানে তিনি অবস্থান করেন। অতঃপর সূর্যের লালিমা বিলুপ্ত হওয়ার পর তিনি উসামাকে স্বীয় উষ্ট্রীর পশ্চাতে বসিয়ে নেন। অতঃপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আরাফাত হতে মুযদালিফায় গমন করেন। ঐ সময় তিনি তাঁর উষ্ট্রের লাগাম নিজের হাতে নেন, যাতে তাঁর (উষ্ট্রের) মাথা, পাদানির নিকট পৌঁছায়। আর এসময় তিনি ডান হস্তদ্বারা ইশারা করে বলেন, শান্ত হও (অর্থাৎ তোমরা এখন শান্তু বা স্বস্তি গ্রহণ কর)। হে জনগণ! তোমরা স্বস্তি গ্রহণ কর। হে লোক সকল! তোমরা শান্তি কবুল কর। অতঃপর তিনি যখন কোন পাহাড়ের নিকটবর্তী হন, তখন উষ্ট্রের লাগামকে কিছুটা ঢিল দেন এবং এই অবস্থায় মুযদালিফায় গমণ করেন। আর এ স্থানে তিনি মাগরিব ও এশার নামায একই আযান ও দুই ইকামতের দ্বারা একত্রে আদায় করেন। রাবী উসমান বলেন, তিনি মাগরিব ও এশার নামায (একত্রে আদায়ের সময়) এর মধ্যবর্তী সময়ে কোন তাসবীহ পাঠ করেন নাই। অতঃপর সমস্ত রাবী একমত হয়ে বর্ণনা করেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সকাল পর্যন্ত নিদ্রা যান। আর ফজরের সময় হওয়ার পর তিনি ফজরের নামায আদায় করেন। রাবী সুলায়মান বলেন, তিনি একই আযান এবং একই ইকামতে তা আদায় করেন। অতঃপর সকল রাবী ঐক্যমতে বর্ণনা করেন যে, অতঃপর তিনি তাঁর বাহণে আরোহণ করে মাশ‘আরুল হারামে গমণ করেন এবং সেখানে অবতরণ করেন। রাবী উসমান ও সুলায়মান বলেন, এ সময় তিনি কিবলামুখী হন এবং আল্লাহ্ তা‘আলার হামদ ও তাকবীর পাঠ করেন। রাবী উসমান একা এরূপ অতিরিক্ত বর্ণনা করেছেন যে, আর তিনি সে স্থানে ততক্ষণ অবস্থান করেন, যতক্ষণ না স্পষ্টরূপে (পূর্বের আকাশ) পরিষ্কার হয়। অতঃপর রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সূর্যোদয়ের পূর্বে মুযদালিফফা হতে মিনায় গমণ করেন। আর এ সময় তাঁর উষ্ট্রের পশ্চাতে ফযল ইবন আব্বাস (রাঃ) ছিলেন। আর ইনি ছিলেন কৃষ্ণ চুল, সুন্দর ও সুশ্রী দেহের অধিকারী যুবক। অতঃপর রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মুযদালিফা হতে গমণকালে যখন স্ত্রীলোকদের বাহণের পার্শ্ব দিয়ে করতে থাকেন, তখন ফযল (রাঃ) তাদের প্রতি দৃষ্টিপাত করতে থাকলে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফযলের চেহারায় হস্ত স্থাপন করে তার মুখ অন্যদিকে ফিরিয়ে দেন। অতঃপর ফযল (রাঃ) অন্যদিকে মুখ ফিরালে, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার চেহারা অন্যদিকে ফিরিয়ে দেন। অতঃপর ফযল আবার তাঁর চেহারা অন্যদিকে ফিরাবার সময় তাঁরা ‘মুহাসসার’ নামক স্থানে পৌঁছান। এ সময় তাঁর উট কিছুটা দ্রুতগামী হয় এবং তা মধ্যবর্তী রাস্তায় গমণ করে, যে রাস্তা ছিল জামরাতুল কুবরায় গমণের পথ। অতঃপর তিনি জামরার নিকটবর্তী হন, যা বৃক্ষের নিকটবর্তী স্থানে অবস্থিত ছিল। অতঃপর তিনি সে স্থানে সাতটি কংকর নিক্ষেপ করেন এবং প্রত্যেকবার কংকর নিক্ষেপের সময় তাকবীর (আল্লাহু আকবার) পাঠ করেন। অতঃপর তিনি বাতনুল ওয়াদীতে (গমনপূর্বক) কংকর নিক্ষেপ করেন। অতঃপর রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কুরবানীর স্থানে উপস্থিত হন এবং স্বহস্তে তেষট্টিটি পশু কুরবানী করেন এবং কুরবানীর অবশিষ্ট পশুগুলি আলী (রাঃ)-কে কুরবানী করার নির্দেশ দেন। আর তিনি প্রত্যেক কুরবানীর পশুর গোশত হতে এক টুকরা গোশত তাঁকে দেওয়ার নির্দেশ দেন। অতঃপর তা একটি পাতিলের মধ্যে রান্না করা হয়। তখন তাঁরা সকলে তা ভক্ষণ করেন এবং (তৃপ্তি সহকারে) আহার করেন। রাবী সুলায়মান বলেন, অতঃপর তিনি তাঁর বাহনে আরোহণ করেন এবং রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কা‘বা ঘরে গমণ করেন। অতঃপর তিনি মক্কায় যোহরের নামায আদায় করেন। পরে তিনি বনী আবদুল মুত্তালিবদের নিকট গমণ করেন, যারা যমযমের নিকট (লোকদের) পানি পান করাচ্ছিল। অতঃপর তিনি তাঁদেরকে বলেন, তোমরা লোকদেরকে অধিক পানি পান করাতে থাকো। আর আমি যদি লোকদের অত্যধিক ভিড়ের আশংকা না করতাম তবে আমিও তোমাদের সাথে পানি তুলে লোকদের পান করাতাম। অতঃপর তারা তাঁকে এক বালতি যমযমের পানি সরবরাহ করলে তিনি তা হতে কিছু পান করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 185
			}
		}
	]
}