{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"13": "Divorce (Kitab Al-Talaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2245,
			"arabicnumber": 2245,
			"text": "উবায়দুল্লাহ্ ইবন মাসলামা আল্ কা‘নবী ..... ইবন শিহাব (রহঃ) হতে বর্ণিত। তিনি বলেন, সাহল ইবন সা‘দ আস সাঈদী তাকে খবর দিয়েছেন যে, উওয়াইমির ইবন আশকার আল্ আজলানী (রাঃ) আসিম ইবন আদীর নিকট আগমন করেন এবং বলেন, হে আসিম! আমাকে বলুন, যদি কেউ স্ত্রীর সাথে কোন অপরিচিত লোককে এক বিছানায় দেখে সে কি তাকে হত্যা করবে? আর কিসাস্ (বদলা) হিসাবে কি তোমরা তাকে হত্যা করবে নাকি করবে না? তুমি এ সম্পর্কে আমার জন্য হে আসিম! রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে একটু জিজ্ঞাসা করো। আসিম এ সম্পর্কে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে জিজ্ঞাসা করলে, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তা শুনে অসন্তুষ্টি প্রকাশ করেন এবং তাকে দোষারোপ করেন। এমনকি আসিম রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে যা শ্রবণ করেন তা তার জন্য খুবই ভয়ানক মনে হয়। এরপর আসিম তার পরিবার-পরিজনের নিকট প্রত্যাবর্তন করলে উওয়াইমির তাঁর নিকট গমন করেন এবং বলেন, হে আসিম! রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তোমাকে কী বলেছেন? আসিম বলেন, তুমি আমার নিকট কোনো ভাল বিষয় নিয়ে আগমন করোনি। আমি ঐ মহিলা সম্পর্কে রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে যে প্রশ্ন করেছিলাম তাতে তিনি অসুন্তুষ্টি প্রকাশ করেন। এতদশ্রবণে উয়াইমির বলেন, আল্লাহর শপথ! আমি তার (মহিলার) সম্পর্কে এ প্রশ্নটি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে জিজ্ঞাসা না করা পর্যন্ত ক্ষান্ত হবো না। উওয়াইমের এমন সময় রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট গমন করেন, যখন তিনি মানুষের মাঝে উপবিষ্ট ছিলেন। তিনি বলেন, ইয়া রাসূলাল্লাহ্! যদি কেউ তার স্ত্রীর সাথে অপরিচিত কোনো লোক পায়, তবে এ সম্পর্কে আপনার অভিমত কী? সে কি তাকে হত্যা করবে? আর এজন্য কি তাকে কিসাস্ হিসাবে হত্যা করবেন? রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, আল্লাহ্ তা‘আলা তোমার ও তোমার স্ত্রীর জন্য কুরআন (আয়াত) নাযিল করেছেন। তুমি যাও এবং তাকে (স্ত্রীকে) নিয়ে এসো। রাবী সাহল বলেন, তারা উভয়ে একে অপরের প্রতি শপথ করে ব্যভিচারের দোষারোপ করতে থাকে এবং আমিও অন্যান্য লোকদের সাথে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট ছিলাম। তারপর তারা যখন অভিসম্পাত ও দোষারোপ করা হতে বিরত হয়, তখন উয়াইমির বলে, যদি এখন আমি তাকে আমার নিকট রাখি, তবে ইয়া রাসুলাল্লাহ্! তার ব্যাপারে আমি লোকদের নিকট মিথ্যুক প্রতিপন্ন হবো। উওয়াইমির নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর অনুমতি প্রদানের পূর্বে তাকে (স্ত্রীকে) তিন তালাক প্রদান করেন। রাবী ইবন শিহাব বলেন, আর তাদের মধ্যকার এ বিচ্ছেদ, শপথ করে ব্যভিচারের অপবাদকারীদের জন্য সুন্নাত স্বরূপ হয়ে যায়। (কারণ, এতে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর মৌন সম্মতি ছিল।)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 71
			}
		}
	]
}