{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"13": "Divorce (Kitab Al-Talaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2256,
			"arabicnumber": 2256,
			"text": "আল্ হাসান ইবন আলী .... ইবন আব্বাস (রাঃ) হতে বর্ণিত। তিনি বলেন, একদা হিলাল ইবন উমাইয়্যা, যিনি ঐ ব্যক্তির একজন ছিলেন, (যারা অকারণে তাবুক যুদ্ধে গমণ করনেনি, যার ফলে অপরাধী সাব্যস্ত হন এবং কান্নাকাটির পর) আল্লাহ্‌তাদের তাওবা কবুল কনে। একদা তিনি তার খামার হতে রাতে প্রত্যাবর্তনের পর তার স্ত্রীর সাথে এক ব্যক্তিকে (শুরায়ক ইবন সাহমকে) যিনায় লিপ্ত দেখতে পান এবং তার দু'কর্ণে তাদের কথোপকথন শ্রবণ করেন। কিন্তু তিনি এতদসত্ত্বেও কোনরূপ বাড়াবাড়ি না করে রাতযাপন করেন। সকালবেলা রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর খিদমতে হাযির হয়ে বলেন, ইয়া রাসূলাল্লাহ্! আমি রাতে আমার স্ত্রীর নিকট গমণপূর্বক তার সাথে এক ব্যক্তিকে (ব্যভিচারে লিপ্তবস্থায়) আমার স্বচক্ষে অবলোকন করি এবং তার কথাও আমি স্বকর্ণে শ্রবণ করি। এতে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অসন্তুষ্টি প্রকাশ করেন এবং তার নিকট ইহা খুবই গুরুতর মনে হয়। তখন এ আয়াত নাযিল হয়ঃ (অর্থ) ‘‘যারা তাদের স্ত্রীদের ব্যাপারে যিনার দোষারোপ করে, আর এব্যাপারে (স্ত্রী ব্যভিচারের) তাদের কোন সাক্ষী থাকে না নিজে ব্যতীত’’ ... আয়াতের শেষ পর্যন্ত নাযিল হয়। আর ঐ সময় রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর উপর ওহী নাযিল হওয়াকালীন সময়ের কাঠিন্যতা প্রকাশ পায়। এরপর তিনি বলেনঃ হে হিলাল! তুমি সুসংবাদ গ্রহণ কর। আল্লাহ্ তা‘আলা তোমার ব্যাপারে স্বস্তির বিধান জারি করেছেন। তখন হিলাল (রাঃ) বলেন, আমি আমার রবের নিকট এ রকম কিছুর প্রত্যাশা করেছিলাম। তখন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তাকে এখানে নিয়ে এসো! তখন সে (হিলালের স্ত্রী) সেখানে আসে। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের (উভয়ের) সম্মুখে ঐ আয়াত তিলাওয়াত করেন এবং বলেন, আখিরাতের আযাব দুনিয়ার আযাবের চাইতে ভয়াবহ। হিলাল (রাঃ) বলেন, আল্লাহর শপথ! আমি তার (স্ত্রীর) ব্যাপারে যা বলছি, সত্য বলছি। তার স্ত্রী বলে, সে মিথ্যা বলছে। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর সাহাবীদের বলেন, তোমরা তাদের পরস্পরের মধ্যে লি‘আন করতে বল। হিলালকে বলা হয়, তুমি সাক্ষ্য প্রদান কর। তিনি আল্লাহর শপথপূর্বক চারবার বলেন যে, তিনি সত্যবাদীদের অন্তর্ভুক্ত। এরপর তিনি পঞ্চমবারের জন্য সাক্ষ্য দিতে প্রস্তুত হলে তাঁকে বলা হয়, তুমি আল্লাহকে ভয় করো। কেননা, আখিরাতের আযাবের চেয়ে দুনিয়ার আযাব খুবই নগন্য। আর এ সাক্ষ্য (পঞ্চমবারের) তোমার শাস্তিকে অবধারিত করবে (যদি তুমি মিথ্যাবাদী হও)। তিনি বলেন, আল্লাহর শপথ! তিনি আমাকে এজন্য শাস্তি প্রদান করবেন না, যেমন তিনি তার সম্পর্কে বলাতে আমাকে শাস্তি প্রদান করনেনি। অতঃপর তিনি পঞ্চমবারের শাস্তি প্রদানের সময় বলেন, যদি সে (নিজে) মিথ্যাবাদীদের অন্তর্ভূক্ত হয়, তবে তার উপর আল্লাহর লা‘নত (যেন বর্ষিত হয়)। এরপর তার স্ত্রীকে সাক্ষ্য প্রদান করতে বলা হলে, সে চারবার আল্লাহ নামে এরূপ সাক্ষ্য প্রদান করে যে, সে (তার স্বামী) মিথ্যাবাদীদের অন্তর্ভূক্ত। এরপর সে পঞ্চমবার শপথবাক্য উচ্চারণের জন্য প্রস্তুত হলে তাকে বলা হয়, তুমি আল্লাহকে ভয় করো এবং (জেনে রাখ) আখিরাতের আযাবের তুলনায় দুনিয়ার আযাব খুবই নগণ্য। আর এটা তোমার জন্য শাস্তিকে অবধারিত করবে। এতদশ্রবণে সে ক্ষণকালের জন্য থেমে যায় এবং পরে বলে, আমি আমার কাওমের লোকদের হেয় করব না। এরপর সে পঞ্চমবারের মতো সাক্ষ্য প্রদানের সময় বলে, তার (নিজের) উপর আল্লাহর গযব (যেন লালায়িত হয়), যদি সে (তার স্বামী) সত্যবাদীদের অন্তর্ভূক্ত হয়। অতঃপর রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের উভয়ের মধ্যে বিচ্ছেদ ঘটিয়ে দেন এবং ফায়সালা দেন যে, তার গর্ভস্থিত সন্তান যেন তার পিতার সাথে সম্পর্কিত না করা হয়। আর সেই মহিলাকে যেন যিনাকারী হিসাবে এবং তার সন্তানকে যেন ব্যভিচারের ফসল হিসাবে আখ্যায়িত করা না হয়। আর যে ব্যক্তি তাকে (মহিলাকে) ব্যভিচারীর দোষারোপ করবে অথবা তার সন্তানের প্রতি এরূপ দোষারোপ করবে তার উপর হদ (শরী‘আতের শাস্তি বিধান) জারি করা হবে। আর তিনি এরূপ সিদ্ধান্ত ব্যক্ত করেন যে, তার উপর (স্বামীর) ঐ মহিলার থাকার জন্য এবং ভরণ পোষণের জন্য কোনরূপ দায়-দায়িত্ব বর্তাবে না। কেননা, তারা তালাক ব্যতীত উভয়েই বিচ্ছিন্ন হয়েছে। আর সে (স্বামী) তার প্রতি দৃষ্টিপাতও করতে পারবেনা। এরপর তিনি বলেনঃ সে যদি স্থুল (পায়ের) গোছাবিশিষ্ট, লাল চুল বিশিষ্ট (যার উপরিভাগ কালো) এবং হালকা পাতলা গড়নের সন্তান প্রসব করে তবে তা হবে হিলালের সন্তান। অপর পক্ষে, সে যদি স্বাস্থ্যবান, মোটাতাজা সন্তান প্রসব করে, তবে তার গর্ভজাত সন্তান হবে, যার প্রতি দোষারোপ করা হয়েছে। সে (মহিলা) মোটাতাজা, স্বাস্থ্যবান একটি সন্তান প্রসব করল। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ যদি সে আল্লাহর নামে সাক্ষ্য প্রদান না করতো, তবে তার ও আমার মধ্যকার ফায়সালার ব্যাপারটি অন্যরকম হতো। রাবী ইকরামা বলেন, পরবর্তীকালে সে (সন্তান) মুদের গোত্রের আমীর হয়। কিন্তু তাকে তার পিতার সাথে সম্পর্কিত করা হতো না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 82
			}
		}
	]
}