{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"13": "Divorce (Kitab Al-Talaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2277,
			"arabicnumber": 2277,
			"text": "আল্ হাসান ইবন আলী ..... হিলাল ইবন উসামা (রহঃ) হতে বর্ণিত। তিনি বলেন, আবূ মায়মূনা সাল্‌মা যিনি মদীনার কোন এক সত্যবাদী ব্যক্তির আযাদকৃত গোলাম ছিলেন। তিনি বলেন, একদা আমি যখন আবূ হুরায়রা (রাঃ) এর নিকট উপস্থিত ছিলাম, তখন সেখানে পারস্য দেশীয় জনৈক স্ত্রীলোক, তার সাথে একটি পুত্র নিয়ে আগমন করে; যাকে (পুত্র সন্তানকে) সে এবং তার স্বামী, যে তাকে তালাক দিয়েছিল, সন্তান হিসাবে দাবি করতে থাকে। এরপর সে (মহিলা) ফরাসী ভাষায় বলে, হে আবূ হুরায়রা! আমার স্বামী আমার পুত্রকে নিয়ে যেতে চায়। আবূ হুরায়রা (রাঃ) বলেন, তোমরা উভয়ে এর (সন্তানের) ব্যাপারে লটারী করো। এরপর তিনি (আবূ হুরায়রা) যখন তার নিকট জবাবের প্রত্যাশ্যায় ছিলেন, তখন তার স্বামী সেখানে আগমন করে এবং বলে, আমার পুত্রের ব্যাপারে কে আমার সাথে ঝগড়া করতে চায়? আবূ হুরায়রা (রাঃ) বলেন, ইয়া আল্লাহ! আমি এ সম্পর্কে যা শুনেছি, তা ব্যাতীত অধিক কিছু বলব না। একদা আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট উপবিষ্ট থাকাকালে জনৈক মহিলাকে তাঁর নিকট এসে বলতে শুনিঃ ইয়া রাসূলাল্লাহ্! আমার স্বামী আমার সন্তানকে নিয়ে যেতে চায়। আর অবস্থা এই যে, সে (সন্তান) আমাকে আবূ উকবার কুপ হতে এনে পানি পান করায় এবং সে আমার অন্যান্য খিদমতও করে। নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, এদের উভয়ের মধ্যে সন্তানের ব্যাপারে লটারীর ব্যাবস্থা করো। তখন তার স্বামী বলে, আমার থেকে আমার সন্তানকে কে ছিনিয়ে নিতে চায়? তখন নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সে সন্তানকে সম্বোধন করে বলেন, এ তোমার পিতা এবং এ তোমার মাতা। তুমি এদের মধ্যে যার হস্ত খুশি ধারণ করো। তখন সে (সন্তান) তা মাতার হস্ত ধারণ করলে তাকে নিয়ে সে (মাতা) চলে যায়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 103
			}
		}
	]
}