{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"15": "Jihad (Kitab Al-Jihad)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2501,
			"arabicnumber": 2501,
			"text": "আবূ তাওবা .... সাহল ইবন হানযালিয়্যা (রাঃ) বর্ণনা করেছেন যে, তাঁরা হুনায়নের যুদ্ধের দিন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে সফরে ছিলেন। তখন দ্রুতগতিতে উট চালিয়ে সন্ধ্যাকালে মাগরিবের নামাযের সময় রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট গিয়ে পৌঁছলেন। এমন সময় একজন অশ্বারোহী সৈনিক এসে তাঁকে বললেন, হে আল্লাহ রাসূল! আমি আপনাদের নিকট হতে আলাদা হয়ে ঐ সকল পাহাড়ের উপর আরোহণ করে দেখতে পেলাম যে, হাওয়াযিন গোত্রের স্ত্রী-পুরুষ সকলেই তাদের উট, বকরী সবকিছু নিয়ে হুনায়নে একত্রিত হয়েছে। তা শুনে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মুচকি হাসি দিয়ে বললেন, ঐ সকল বস্তু আল্লাহ্ চাহেতু আগামীকাল মুসলিমদের গনীমতের সামগ্রীতে পরিণত হবে। এরপর তিনি বললেন, আজ রাতে আমাদেরকে কে পাহারা দিবে? আনাস ইবন আবূ মারসাদ আল-গানবী (রাঃ) উত্তর করলেন, ইয়া রাসূলাল্লাহ! আমি পাহারা দেবো। তিনি বললেন, তাহলে তুমি ঘোড়ায় আরোহণ কর। তিনি তাঁর একটি ঘোড়ায় আরোহণ করে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট উপস্থিত হন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে উদ্দেশ্য করে নির্দেশ দিলেন, যাও, এ দু‘পাহাড়ের মধ্যবর্তী উপত্যকার দিকে রওয়ানা হয়ে এর চূড়ায় পৌঁছে পাহারায় রত থাকো। আমরা যেন তোমার আসার আগে আজ রাতে কোন ধোঁকায় না পড়ি। ভোরবেলায় রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার নামায়ের স্থানে গিয়ে ফজরের দু‘রাক‘আত (সুন্নাত) নামায আদায় করলেন। তারপর জিজ্ঞাসা করলেন, তোমরা তোমাদের পাহারাদার অশ্বারোহী সৈনিকের কোন সন্ধান পেয়েছ কী? সকলে উত্তর করল, ইয়া রাসূলুল্লাহ্! তিনি পাহারায় রত আছেন বলে মনে হয় কিন্তু দেখতে পাইনি। এরপর ফজর নামাযের ইকামত দেয়া হলে, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নামায পড়াতে আরম্ভ করলেন। এমতাবস্থায় তিনি উপত্যকার দিকে লক্ষ্য রাখতে রাখতে নামায শেষ করে সালাম ফিরালেন। এরপর তিনি বললেন, তোমরা সকলে সুসংবাদ নাও যে, তোমাদের পাহারাদার সৈনিক এসে পড়েছে। আমরা উপত্যকায় গাছের ফাঁকে দেখতে পেলাম যে, তিনি সত্যই এসে পড়েছেন। এমনকি তিনি রাসূলূল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সামনে দাঁড়িয়ে সালাম করলেন এবং বললেন, রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে যেভাবে নির্দেশ দিয়েছিলেন সেভাবে আমি এই উপত্যকার উপরাংশের শেষ মাথায় গিয়ে পৌঁছেছিলাম। সকাল হওয়ার পর আমি উভয় পাহাড়ের উপত্যকা দু‘টির উপরে উঠে নযর করলাম, কোনো শত্রুকেই দেখতে পেলাম না। তা শুনে রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে জিজ্ঞাসা করলেন, তুমি সারারাত কখনও কি ঘোড়ার পিঠ হতে নেমেছিলে? তিনি উত্তর করলেন, না, নামায পড়ার জন্য অথবা পায়খানা-প্রসাবের প্রয়োজন ছাড়া কখনও ঘোড়ার পিঠ হতে নামিনি। তা শুনে রাসূলূল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে উদ্দেশ্য করে বললেন, তোমার জন্য জান্নাত অবধারিত হল। তোমার জীবনে আর কোন অতিরিক্ত নেক কাজ না করলেও চলবে। (অর্থাৎ সারারাত জাগ্রত থেকে পাহারায় রত থাকার মত বৃহৎ নেক কাজটি তোমার জান্নাতে প্রবেশের জন্য যথেষ্ট। অবশ্য ফরয-ওয়াজিব যথারীতি পালনের পর)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 25
			}
		}
	]
}