{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"15": "Jihad (Kitab Al-Jihad)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2660,
			"arabicnumber": 2660,
			"text": "মূসা ইবন ইসমাঈল (রহঃ) .... আবূ হুরায়রা (রাঃ) সূত্রে নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দশ ব্যক্তিকে গুপ্তচর হিসাবে প্রেরণ করেন এবং ‘আসিম ইবন ছাবিত (রাঃ)-কে তাদের নেতা নির্ধারণ করেন। তখন হুযায়ল গোত্রের প্রায় একশত তীরন্দায তাদের প্রতিরোধে বেরিয়ে আসে। এরপর আসিম যখন তাদের দেখল, তখন এক উচুঁ টিলায় আত্মগোপন করল। কাফিররা তদের বলল, তোমরা নেমে এস এবং আমাদের নিকট আত্মসমর্পন কর। তোমাদের সাথে এই ওয়াদা যে, আমরা তোমাদের কাউকে কতল করব না। তখন ‘আসিম বললেনঃ আমি তো কাফিরদের ওয়াদা নিরাপত্তায় নামা অপছন্দ করি। তখন তারা তাদের প্রতি তীর নিক্ষেপ শুরু করে এবং ‘আসিমসহ তাঁর সাতজন সাথীকে হত্যা করে। অবশিষ্ট তিনজন কাফিরের দেওয়া প্রতিশ্রুতি ও নিরাপত্তায় নেমে আসে। এদের মাঝে ছিলেন-খুবাইব, যায়দ ইবন দাসিনা এবং অপর একজন (আবদুল্লাহ্ ইবন তারিক)। যখন তাঁরা কাফিরদের নাগালের মাঝে পৌঁছলেন, তখন তারা তাদের ধনুকের রশি খুলে তাদের বেধেঁ ফেলল। এ দেখে তৃতীয় ব্যক্তি বললঃ এই তো প্রথম চুক্তি লংঘন। আল্লাহর শপথ! আমি কখনই তোমাদের সাথে যাব না; বরং আমি আমার (শহীদ) সাথীদের সাথে মিলিত হওয়াকে পছন্দ করি। তখন কাফিররা তাকে টেনে-হিচড়ে নিতে চাইলে তিনি অস্বীকার করেন। ফলে, তারা তাকেও হত্যা করে। খুবায়র তাদের হাতে বন্দী থাকেন এবং কাফিররা তাকে হত্যার ব্যাপারে একমত হয়। এ সময় খুবায়র তাঁর লজ্জাস্থানের চুল পরিষ্কার করার জন্য একটি খুর চেয়ে নেয়। অবশেষে কাফিররা যখন তাকে হত্যা করার জন্য বের হল, তখন খুবায়র তাদের বললঃ আমাকে একটু সময় দাও, যাতে আমি দু‘রাআত সালাত আদায় করতে পারি। এরপর তিনি বলেন, আল্লাহর শপথ! যদি তোমরা এরূপ মনে করতে যে, আমি মৃত্যুর ভয়ে সালাতে বেশী সময় নিচ্ছি, তবে আমি অবশ্যই বেশী করে সালাত আদায় করতাম।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 184
			}
		}
	]
}