{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"1": "Purification (Kitab Al-Taharah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 287,
			"arabicnumber": 287,
			"text": "যুহায়ের ইবনু হারব ..... ইব্রাহীম থেকে তার চাচা ইমরানের সূত্রে এবং তিনি তাঁর মাতা হুম্‌না বিনতে জাহশ (রাঃ) হতে বর্ণনা করেছেন। তিনি বলেন, আমার খুব বেশী রক্তস্রাব হত তখন আমি এ সম্পর্কে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লামকে অবগত করাতে এবং তাঁর নিকট হতে সমাধান জানতে আসি। আমি তাকে আমার বোন যয়নব বিনতে জাহশের ঘরে পেয়ে জিজ্ঞাসা করি, ইয়া রাসূলাল্লাহ্! আমার খুব অধিক পরিমাণে ঋতুস্রাব হয়ে থাকে; এ ব্যাপারে আপনার অভিমত কি? এই ঋতুস্রাব আমাকে নামায ও রোযা হতে বিরত রাখে। তিনি বলেন, আমি তোমাকে কুরসুফ্ (তুলা) ব্যবহ্যরের পরামর্শ দেই। কেননা তা রক্ত শোষণ করবে। তখন তিনি (মহিলা বলেন, এর পরিমাণ তা হতেও বেশী (কাজেই তুলা দ্বারা বন্ধ করা সম্ভব নয়)। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, তবে তুমি এর উপর নেকড়া বাঁধবে। মহিলাটি বলেন, এর পরিমাণ তা থেকেও অধিক। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, তা হলে এর উপর একটা কাপড় বেঁধে নিবে। মহিলাটি বলেন, এর পরিমাণ তার চাইতেও আধিক; বরং আমার রক্তস্রাব অত্যধিক পরিমাণে হয়ে থাকে। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বলেনঃ আমি তোমাকে দুইঢি কাজ সম্পাদনের জন্য পরামর্শ দিচ্ছি। এর যে কোন একটি সম্পন্ন করলেই চলবে। কাজ সস্পাদন করতে তুমি সক্ষম কিনা তা জান। তিনি বলেন, এটা শয়তানের চক্রান্ত কাজেই (১ম কাজ) প্রতি মাসে ছয় বা সাত দিনের জন্য তোমার হায়েযের নির্ধারিত দিন গণনা করবে। অতঃপর গোসল করবে এবং তুমি যখন বুঝতে পারবে যে, তুমি উল্লেখিত দিনণ্ডলি অতিক্রম করে পবিত্রতা অর্জন করেছ- তখন তুমি প্রত্যেক মাসের ২৩/২৪ দিন নিয়মিতভাবে নামায আদায় করবে এবং রোযা রাখবে।এটাই তোমার জন্য যথেষ্ট। প্রত্যেক মাসে এরূপই করবে- যেরূপ অন্যান্য মহিলারা হায়েয হতে পবিত্রতা অর্জনের পর করে থাকে। (২য় কাজ) যদি তোমার সামর্থ থাকে, তবে একই গোসলে ও আসরের নামায একত্রে আদায় করবে- এইরূপে যে, যুহয়ের শেষ সময়ে উক্ত নামায এবং আসরের প্রারম্ভিক সময়ে আসরের নামায পড়ে উভয় নামায একত্রে আদায় করবে। অতঃপর মাগরিবের নামায এর শেষ সময়ে এবং এশার নামায এর প্রথম সময়ে একই গোসলে পরর্যায়ক্রমে আদায় করবে এবং একবার গোসল করে ফজরের নামায আদায় করবে। বর্ণিত উপায়ে সম্ভব হলে, নিয়মিতভাবে নামায আদায় করবে এবং রোযা রাখবে। অতঃপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বলেন, এই কাজের মধ্যে আমার নিকট শেষোক্তটি পছন্দনীয়। ইমাম আবূ দাউদ (রহঃ) বলেন, আমর ইবনু ছাবিত থেকে আকীলের সূত্রে বর্ণিত। তিনি বলেন, হুমনা (রাঃ) বলেন, আমি বললাম, “এই দু’টি বিকল্প ব্যবস্থার মধ্যে শেষোক্তটি আমার নিকট অধিক পছন্দনীয়।” তিনি (ইবনু আকীল) এটাকে মহানবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর বক্তব্য হিসাবে বর্ণনা করেননি, বরং হুমনা (রাঃ) এর কথা হিসাবে উল্লেখ করেছেন। আবূ দাউদ (রহঃ) বলেন, আমি ইমাম আহমাদ (রহঃ)-কে বলতে শুনেছি, হায়েয সস্পর্কিত বিষয়ে বর্ণিত ইবনু আকীলের হাদীছের উপর আমার মন আশ্বস্ত হতে পারছে না। আবূ দাউদ (রহঃ) আরও বলেন, আমর ইবনু ছাবিত একজন রাফিযী, নিকৃষ্ট ব্যক্তি, কিন্তু হাদীছ বর্ণনার ক্ষেত্রে বিশ্বস্ত। তবে ছাবিত ইবনুল মিকদাম বিশ্বস্ত রাবী। ইয়াহ্ইয়া ইবনু মুঈন থেকে এরূপ বর্ণিত আছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 287
			}
		}
	]
}