{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"20": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2934,
			"arabicnumber": 2934,
			"text": "মুসাদ্দাদ (রহঃ) ..... গালিব কাত্তান (রাঃ) জনৈক ব্যক্তি হতে বর্ণনা করেছেন। যিনি তাঁর পিতা হতে এবং তাঁর দাদা হতে বর্ণনা করেছেন যে, তারা একটি ঝর্ণার নিকট বসবাস করত। যখন তারা দীন-ইসলাম সম্পর্কে জানতে পারে, তখন ঝর্ণার মালিক তার অধীনস্থ লোকদের এ শর্তে একশটি উট দিতে চায় যে, তারা ইসলাম কবুল করবে। তখন তারা ইসলাম কবুল করলে তাদের মাঝে একশটি উট বন্টন করে দেন। কিন্তু পরবর্তীকালে তিনি তাদের থেকে সেগুলো ফেরত নেওয়ার খেয়াল করেন এবং স্বীয় পুত্রকে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট প্রেরণ করেন। তিনি তাঁর পুত্রকে এ মর্মে নির্দেশ দেন যে, সে যেন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট হাযির হয়ে তাকে বলেঃ আমার পিতা আপনাকে সালাম জানিয়েছেন, আর তিনি তাঁর কওমের লোকদের মাঝে এ উদ্দেশ্যে একশটি উট বিতরণ করতে চান, যাতে তারা ইসলাম কবুল করে। অতঃপর তারা ইসলাম কবুল করেছে এবং তিনিও তাদের মাঝে শত উট বিতরণ করেছেন। এখন তাদের থেকে সেগুলি ফেরত নেওয়ার ইচ্ছা করছেন। তাই তিনি কি এগুলির অধিক হকদার, না ঐ ব্যক্তিরা? তখন তিনি বললেনঃ যদি তিনি সেগুলো তাদের দিয়ে দিতে চান, তবে তিনি দিতে পারেন। আর যদি তিনি সেগুলো ফিরত নিতে চান তাহেলেও এ ব্যাপারে তিনি অধিক হকদার। আর তারা যদি সত্য-সত্যই মুসলিম হয়ে থাকে, তবে তারা এর বিনিময় (আল্লাহ্‌র নিকট) পাবে। আর যদি তারা সত্যিকারভাবে মুসলিম না হয়ে থাকে, তবে তাদেরকে ইসলামের জন্য কতল করা হবে। অতঃপর সে (ছেলে) বলেঃ আমার পিতা একজন অতি বৃদ্ধ লোক, আর তিনি পানির আরীফও। তিনি আপনার নিকট এরূপ দরখাস্ত করেছেন যে, আপনি আমাকে তার পরে ঐ পানির আরীফ নিয়োগ করবেন। তখন তিনি বলেনঃ নিশ্চয় ইরাফা (প্রতিনিধিত্ব) খুবই জরুরী বিষয়। আর লোকজনের উপকারার্থেই তাদের নির্বাচিত প্রতিনিধি প্রয়োজন। কিন্তু প্রতিনিধিত্বকারী নেতারাই জাহান্নামে যাবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 7
			}
		}
	]
}