{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"20": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3067,
			"arabicnumber": 3067,
			"text": "উমর ইবন খাত্তাব আবূ হাফস (রহঃ) .... সাখার (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ছাকীফের উপর জিহাদ পরিচালনা করেন। সাখার (রাঃ) এ খবর শুনে কিছু সৈন্য-সামন্ত নিয়ে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাহাযার্থে সেখানে পৌছান। তিনি সেখানে পৌছে দেখতে পান যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ছাকীফ গোত্রের অবস্থান দুর্গ জয় না করে ফিরে আসছেন। এ সময় সাখার (রাঃ) মহান আল্লাহ্‌র নিকট এরূপ ওয়াদা করেন এবং তার যিম্মাদারী নেন যে, যতক্ষণ না এ দুর্গের লোকজন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর আনুগত্য স্বীকার করে, ততক্ষণ আমি এ দুর্গ পরিত্যাগ করব না (অর্থাৎ অবরোধ করে রাখব)। বস্তুত যতক্ষণ না ঐ দুর্গের লোকজন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর আনুগত্য স্বীকার করলো, ততক্ষণ সাখার (রাঃ) সেখান হতে সরলেন না। অবশেষে সে দুর্গ বিজয়ের পর তিনি তাঁর নিকট এরূপ পত্র লিখেনঃ ইয়া রাসূলুল্লাহ! ছাকীফ গোত্রের লোকেরা আপনার নির্দেশ মত দুর্গ হতে অবতরণ করেছে। এখন আমি তাদের নিকট যাচ্ছি, তাদের কাছে অনেক ঘোড়া আছে। (এ খবর পাওয়ার পর) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সকলকে জামাআতে সালাত আদায়ের জন্য নির্দেশ দেন এবং (সালাত শেষে) দশ বার আহমাস গোত্রের জন্য এরূপ দু'আ করেনঃ ইয়া আল্লাহ্‌! আপনি আহমাসের ঘোড়ায় এবং লোকে বরকত দান করুন। এরপর সাখার (রাঃ) এবং তাঁর সাথীরা তাঁর নিকট আসেন। তখন মুগীরা ইবন শো'বা (রাঃ) বলেনঃ ইয়া নবীয়াল্লাহ! সাখার আমার ফুফীকে বন্দী করেছেন অথচ সে মুসলিম হয়েছে। তখন তিনি তাঁকে ডেকে বলেনঃ হে সাখার! যখন কোন কওম মুসলিম হয়, তখন তাদের জান-মালের হিফাযত করবে। তুমি মুগীরার ফুফীকে তাঁর নিকট ফিরিয়ে দাও। তখন তিনি তাকে (ফুফীকে) তাঁর (মুগীরার) হাতে প্রত্যর্পণ করেন। এরপর তিনি (সাখার) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট এরূপ আবেদন করেন যে, বনূ সালীমের একটি পুকুর আছে। তারা ইসলাম পরিত্যাগ করায় তা ছেড়ে চলে গেছে। অতএব, হে আল্লাহ্‌র নবী! আপনি আমাকে এবং আমার কওমকে ঐ পুকুরের নিকট বসবাসের অনুমতি দিন। তখন তিনি বলেনঃ হ্যাঁ, ঠিক আছে। অতঃপর তিনি সেখানে বসবাস করতে থাকেন। অবশেষে বনূ-সালীম ইসলাম গ্রহণ করার পর সাখার (রাঃ)-এর নিকট উপস্থিত হলো এবং তাঁর কাছে তাদের পুকুরটি ফেরত পাওয়ার জন্য আবেদন করল। কিন্তু তিনি তা ফিরিয়ে দিতে অস্বীকার করেন। এরপর তারা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট উপস্থিত হয় এবং বলেঃ হে আল্লাহ্‌র নবী! আমরা ইসলাম কবূলের পর সাখারের কাছে গিয়েছিলাম, যাতে তিনি আমাদের পুকুরটি আমাদের ফিরিয়ে দেন। কিন্তু তিনি তা দিতে অস্বীকার করছেন। তখন তিনি তাঁকে (সাখার) ডাকান এবং বলেনঃ হে সাখার! যখন কোন কওম ইসলাম গ্রহণ করে, তখন তাদের জান-মাল নিরাপদ হয়ে যায়। সুতরাং ঐ কওমের পুকুরটি তাদের ফিরিয়ে দাও। তখন তিনি বলেনঃ হ্যাঁ দেব হে আল্লাহর নবী! সাখার বলেনঃ তখন আমি দেখতে পাই যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর চেহারার রং লাজ-বিনম্রতার কারণে সাখার (রাঃ) হতে দাসী এবং পুকুর ফিরিয়ে দেওয়ায় পরিবর্তিত হয়ে লালবর্ণ ধারণ করেছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 140
			}
		}
	]
}