{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"1": "Purification (Kitab Al-Taharah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 333,
			"arabicnumber": 333,
			"text": "মূসা ইবনু ইসমাঈল .... আবূ কিলাবা থেকে বর্ণিত। আমরের এক ব্যক্তির সূত্রে বর্ণিত। তিনি বলেন, আমি ইসলাম কবুল করার পর তা আমার জন্য খুবই গুরুত্বপূর্ণ বিবেচিত হয়। আমি আবূ যার (রাঃ) এর নিকট যাই। তিনি বলেন, মদ্বীনায় যাওয়ার পর আমি সেখানে খুবই অসুস্থ হয়ে পড়ি। তখন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম আমাকে উট ও বকরীর পাল চরানোর নির্দেশ দেন এবং বলেন, তুমি এর দুধ পান করবে। পেশাব পানের ব্যাপারে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নির্দেশ দিয়েছিলেন কিনা তা জানা নাই। আবূ যার (রাঃ) বলেন, আমি পানি থেকে অনেক দুরে অবস্থান করতাম এবং এ সময় আমার স্ত্রীও আমার সাথে ছিল। এমতাবস্থায় আমি অপবিত্র হই এবং পবিত্রতা অর্জন করা ছাড়াই নামায আদায় করি। অতঃপর আমি দুপুরের সময় রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়া সাল্লামের খিদমতে হাযির হই, যখন তিনি একদল সাহাবীর সাথে মসজিদের পাশে আলাপে রত ছিলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ হে আবূ যার! আমি বলি- ইয়া রাসূলাল্লাহ্! আমি হাযির এবং আমি ধ্বংসপ্রাপ্ত হয়েছি। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জিজ্ঞাসা করেনঃ কিসে তোমাকে ধ্বংস করেছে? আমি বলি, আমি পানি হতে অনেক দূরে ছিলাম এবং আমার স্ত্রীও আমার সাথে ছিল। এমতাবস্থায় আমি অপবিত্র হই এবং পবিত্রতা অর্জন ব্যতিরেকেই নামায আদায় করি। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম আমার জন্য পানি আনার নির্দেশ দেন। সাওদা নাম্নী দাসী আমার জন্য পানি ভর্তি একটি পাত্র আনে। আমি উটকে আঁড়াল করে গোসল করি। অতঃপর তার নিকট আসি। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বলেনঃ হে আবূ যার! নিশ্চয়ই পাক মাটি পবিত্রতা অর্জনের জন্য যথেষ্ট, যদি তুমি দশ বৎসর পর্যন্তও পানি না পাও। অতঃপর যখন তুমি পানি পাবে তখন তোমার শরীর পরিষ্কার করবে। ইমাম আবূ দাউদ (রহঃ) বলেন, হাম্মাদ ইবনু যায়েদ (রহঃ) আইউবের সূত্রে এ হাদীছ বর্ণনা করেছেন। কিন্তু সেখানে পেশাব পানের কথা উল্লেখ নাই এবং তা সহীহ নয়। আনাস (রাঃ) হতেই কেবলমাত্র পেশাব সম্পর্কিত হাদীছ বর্ণিত হয়েছে। এই হাদীছ কেবলমাত্র বসরার অধিবাসীরাই বর্ণনা করে থাকেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 333
			}
		}
	]
}