{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"25": "The Office of the Judge (Kitab Al-Aqdiyah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3612,
			"arabicnumber": 3612,
			"text": "আহমদ ইবন আবদা (রহঃ) .... শুআয়ব ইবন উবায়দিল্লাহ (রহঃ) হতে বর্ণিত। তিনি বলেনঃ আমি আমার দাদা যাবীব আনবারী (রাঃ)-কে বলতে শুনেছি যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বনূ আনবরের প্রতি একটি সেনাদল প্রেরণ করেন। যারা তাদেরকে তায়েফের নিকটবর্তী স্থান রুকবাম্বতে বন্দী করে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট পেশ করেন। আমি অশ্বারোহী সৈন্য ছিলাম। তাই আমি তাদের আগে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট উপস্থিত হয়ে বলিঃ হে আল্লাহ্‌র নবী! আপনার প্রতি সালাম ও বরকত বর্ষিত হোক। (তিনি বলেনঃ) আপনার সেনাবাহিনী আমাদের কাছে উপস্থিত হয়ে আমাদের বন্দী করেছে, অথচ আমরা তো ইসলাম কবূল করেছি এবং আমাদের পশুর কান চিরে দিয়েছি। এর পর আনবর গোত্রের লোকেরা যখন উপস্থিত হলো, তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে জিজ্ঞাসা করলেনঃ তোমরা যে ইসলাম গ্রহণ করছো, এর কোন সাক্ষী-প্রমাণ আছে কি, যখন তোমরা বন্দী হয়েছো? তখন আমি বলি, হ্যাঁ আছে। তখন তিনি জিজ্ঞাসা করে কে সেই সাক্ষী? আমি বলিঃ সামুরা, যিনি আনবর গোত্রের জনৈক ব্যক্তি এবং আরো একজন- যার নাম সে বলে। তখন দ্বিতীয় ব্যক্তি সাক্ষ্য দিলেও সামুরা সাক্ষ্য দিতে অস্বীকার করে। এ সময় নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ সে তো তোমাদের পক্ষে সাক্ষ্য দিতে অস্বীকার করেছে, এখন তুমি তোমার দ্বিতীয় সাক্ষীর সাথে শপথ করতে পার কি? আমি বলিঃ হ্যাঁ। তখন তিনি আমাকে শপথ করতে বলেন এবং আমি আল্লাহ্‌র নামে শপথ করে বলিঃ আমরা অমুক অমুক দিন ইসলাম কবুল করেছি এবং আমাদের পশুর কান চিরে দিয়েছি। একথা শুনে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর সৈন্যদলকে এরূপ নির্দেশ দেনঃ যাও, তোমরা তাদের অর্ধেক মাল ভাগ-বণ্টন করে নাও এবং তাদের সন্তান-সন্ততিদের স্পর্শ করবে না। এরপর তিনি বলেনঃ যদি মহান আল্লাহ্‌ মুজাহিদদের চেষ্টা অহেতুক হওয়াকে অপসন্দ না করতেন, তবে আমরা তোমাদের মাল হতে একটি রশিও গ্রহন করতাম না। যাবীব বলেনঃ এ সময় আমার মা আমাকে ডেকে বলেন যে, এ লোকটি আমার তোশক ছিনিয়ে নিয়েছে। তখন আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট উপস্থিত হয়ে বিষয়টি তাকে অবহিত করি। তখন তিনি আমাকে বলেনঃ তাকে গ্রেফতার কর। তখন আমি তার গলায় কাপড় দিয়ে তাকে পাকড়াও করি এবং আমাদের অবস্থানে ফিরে যাই। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের দাঁড়িয়ে থাকতে দেখে বলেনঃ তুমি তোমার বন্দীর কাছে কি চাচ্ছ? এসময় আমি তাকে ছেড়ে দিই। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দাঁড়িয়ে তাকে এরূপ নির্দেশ দেনঃ তুমি তার মায়ের তোশক ফিরিয়ে দাও, যা তুমি ছিনিয়ে নিয়েছ। তখন সে বলেঃ ছে আল্লাহ্‌র নবী! তা তো আমার কাছে নেই। রাবী বলেনঃ তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সে ব্যক্তির তরবারি তার থেকে নিয়ে আমাকে প্রদান করেন এবং তাকে এরূপ নির্দেশ দেন যে, তাকে আরো কিছু খাদ্য- শস্য প্রধান করো। যাবীব বলেনঃ তখন সে ব্যক্তি আমাকে যবের কিছু অংশও প্রদান করে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 42
			}
		}
	]
}