{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"2": "Prayer (Kitab Al-Salat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 395,
			"arabicnumber": 395,
			"text": "মুসাদ্দাদ ..... আবূ মূসা (রাঃ) হতে বর্ণিত। এক প্রশ্নকারী নবী সাল্লাল্লাহু আলাইহি ওয়া সাল্লামকে নামাযের ওয়াক্ত সম্পর্কে জিজ্ঞাসা করে। তিনি তাকে কোন জবাব না দিয়ে বিলাল (রাঃ)-কে সুবহে-সাদকের সময় ফজরের নামাযের জন্য ইকামত দেওয়ার নির্দেশ দেন এবং ফজরের নামায এমন সময় আদায় করেন যখন কোন মুসল্লী তার পার্শ্ববর্তী ব্যক্তিকে (অন্ধকার থাকার ফলে) ভালভাবে চিনতে পারত না। অতঃপর তিনি সূর্য পশ্চিম দিকে সামান্য হেলার পরপরই অর্থাৎ দ্বিপ্রহয়ের সময় বিলাল (রাঃ)-কে যুহরের নামাযের জন্য ইকামত প্রদানের নির্দেশ দেন যখন কেবল দিনের অর্ধেক হয়েছে। অতঃপর সূর্য যখন উর্ধ্বাকাশে উজ্জল দেখা যাচ্ছিল সে সময় তিনি বিলালকে আসরের নামাযের ইকামত দেয়ার নির্দেশ দিলে তিনি ইকামত দেন। অতঃপর সূর্যাস্তের পরপরই তিনি বেলাল (রাঃ)-কে মাগরিবের নামাযের জন্য ইকামত দিতে বললে-তিনি ইকামত দেন। অতঃপর পশ্চিমাকাশের শাফাক স্তিমিত হওয়ার পর তিনি বিলাল (রাঃ)-কে এশার নামাযের ইকামত দিতে বললে- তিনি ইকামত দেন। পরের দিন সকালে ফজরের নামায আদায় করে যখন আমরা প্রত্যাবর্তন করছিলাম, তখন আমরা বলি-সূর্য উদয় হয়েছে না কি, অর্থাৎ ফজরের নামায সুর্যোদয়ের কিছু পূর্বে সমাপ্ত হয়েছে। পূর্ববর্তী দিন তিনি যে সময় আসরের নামায আদায় করেছিলেন- এদিন সেই সময় যুহরের নামায আদায় করেন, (অর্থাৎ যুহরের সর্বশেষ ও আসরের প্রারম্ভিক সময়ে)। অতঃপর পশ্চিমাকাশের সূর্য যখন হলুদ বর্ণ ধারণ করে তখন তিনি আসরের নামায আদায় করেন, এবং সূর্যাস্তের পর পশ্চিম আকাশের শাফাক স্তিমিত হওয়ার কিছু পূর্বে তিনি মাগরিবের নামায আদায় করেন; এবং এশার নামায রাতের এক-তৃতীয়াংশ অংশ অতিবাহিত হওয়ার পর আদায় করেন। অতঃপর তিনি বলেনঃ নামাযের ওয়াক্ত সম্পর্কে প্রশ্নকারী ব্যক্তি কোথায়? পূর্ববর্তী দিন ও পরের দিনে যে যে সময়ে নামায আদায় করা হয়েছে- তার মাঝেই রয়েছে (প্রারম্ভিক ও শেষ সময়) নামাযের ওয়াক্ত। (মুসলিম, তিরমিযী, ইবনু মাজাহ, নাসাঈ)। ইমাম আবূ দাউদ (রহঃ) বলেন, জাবের (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম হতে মাগরিবের নামাযের ওয়াক্ত সম্পর্কে উপরোক্ত হাদীছের অনুরূপ বর্ণনা করেছেন। অতঃপর রাবী বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এশার নামায কারও মতে রাতের তৃতীয়াংশ অতিবাহিত হওয়ার পর এবং অন্যদের মতে রাতের অর্ধাংশ অতিক্রান্ত হওয়ার পর আদায় করেন। ইবনু বুরায়দা-তাঁর পিতা হতে এবং তিনি নবী সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম হতে পূর্বোক্ত হাদীছের অনুরূপ বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 5
			}
		}
	]
}