{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"37": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4270,
			"arabicnumber": 4270,
			"text": "মুআম্মাল ইব্‌ন ফযল (রহঃ) .... খালিদ ইব্‌ন দিহ্‌কান (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ আমরা যখন কুস্‌তুন্‌তুনিয়ার যুদ্ধে ‘যালকা’ নামক স্থানে ছিলাম, তখন ফিলিস্তিনের একজন গণ্য-মান্য ব্যক্তি, যাকে সকলে চিনতো এবং তার নাম ছিল ‘হানি ইব্‌ন কুলছূম ইব্‌ন শারীক কিনানী। তিন এসে আবদুল্লাহ্‌ ইব্‌ন আবূ যাকারিয়া (রাঃ)-কে সালাম করেন, যার মর্যাদা সম্পর্কে তিনি অবহিত ছিলেন। রাবী বলেনঃ খালিদ (রহঃ) আমার নিকট বর্ণনা করেন যে, আবদুল্লাহ্‌ ইব্‌ন যাকারিয়া (রহঃ) আমাকে বলেছেনঃ আমি উম্মু দারদা (রাঃ)-কে বলতে শুনেছি, যিনি আবূ দারদা (রাঃ)-কে বলতে শোনেনঃ আমি রাসূলুল্লাহ্‌ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি, তিনি বলেনঃ মহান আল্লাহ্‌ মুশরিক অবস্থায় মৃত্যুবরণকারী ব্যক্তি এবং যে মু’মিন অন্য মু’মিনকে ইচ্ছাকৃতভাবে হত্যা করে, এরা ব্যতীত অন্য সকলের গুনাহ মাফ করবেন। এরপর হানী ইব্‌ন কুলছূম (রহঃ) বলেনঃ আমি মাহমূদ ইব্‌ন রাবী’ (রহঃ)-কে উবাদা ইব্‌ন সামিত (রাঃ) থেকে বর্ণনা করতে শুনেছি, যিনি রাসূলুল্লাহ্‌ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণনা করেছেন। তিনি বলেনঃ যে ব্যক্তি কোন মু’মিনকে ইচ্ছাকৃতভাবে হত্যা করবে এবং তাকে হত্যা করে খুশী হবে, তার কোন ফরয এবং নফল ইবাদত আল্লাহ্‌ কবূল করবেন না। রাবী বলেনঃ এরপর খালিদ আমাদের বলেন, ইব্‌ন আবূ যাকারিয়া (রহঃ) আবূ দারদা (রাঃ) সূত্রে রাসূলুল্লাহ্‌ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণনা করেন, তিনি বলেনঃ যতক্ষণ কোন মু’মিন অকারণে কাউকে হত্যা করে না, ততক্ষণ সে নিশ্চিত ও নেক্‌কার থাকে। কিন্তু যখন সে কাউকে হত্যা করে, তখন সে নির্ভীক ও জ্ঞান শূন্য হয়ে যায়। হানী ইব্‌ন কুলছূম (রহঃ) মাহমূদ ইব্‌ন রাবী’ (রহঃ) থেকে তিনি উবাদা ইব্‌ন সামিত (রাঃ) থেকে, তিনি রাসূলুল্লাহ্‌ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে এরূপ বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 31
			}
		}
	]
}