{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"40": "Prescribed Punishments (Kitab Al-Hudud)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4428,
			"arabicnumber": 4428,
			"text": "হাসান ইবন আলী (রহঃ) ..... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা আসলাম গোত্রের জনৈক ব্যক্তি নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট উপস্থিত হয়ে স্বীকার করে যে, সে হারামভাবে একজন মহিলার সাথে যিনা করেছে, আর সে ব্যক্তি চারবার এরূপ স্বীকারোক্তি করে। কিন্তু নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম প্রতিবারই তার কথা প্রত্যাখ্যান করেন। এরপর সে ব্যক্তি পঞ্চমবারের মত স্বীকারোক্তি করার জন্য হাযির হলে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে জিজ্ঞাসা করেনঃ তুমি কি তার সাথে সংগম করেছ? তখন সে বলেঃ হ্যাঁ। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জিজ্ঞাসা করেনঃ তোমার গুপ্তাংগ কি তার গুপ্তাংগের মধ্যে অদৃশ্য হয়েছিল? সে বলেঃ হ্যাঁ। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে আবার জিজ্ঞাসা করেনঃ তোমার গুপ্তাংগ কি তার গুপ্তাংগের মধ্যে এরূপ অদৃশ্য হয়েছিল, যেমন সুরমা দানির মধ্যে তার শলাকা বা কূপের মধ্যে রশি অদৃশ্য হয়ে যায়? তখন সে ব্যক্তি বলেঃ হ্যাঁ। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তুমি কি জান, যিনা কী? সে বলেঃ যেরূপ কেউ হালাল ভাবে তার স্ত্রীর সাথে সংগম করে, আমি এরূপই হারামভাবে তার সাথে সংগম করেছি। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ এখন তুমি কিসের ইচ্ছা পোষণ কর? সে ব্যক্তি বলেঃ আমি আশা করি, আপনি আমাকে পবিত্র করবেন। এরপর নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে 'রজম' করার নির্দেশ দিলে, তা কার্যকরী করা হয়। এরপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর দু'জন সাহাবীকে এরূপ বলতে শোনেন, যাদের একজন এরূপ বলছিল; আল্লাহ্‌ তা'আলা তার গুনাহকে গোপন রেখেছিলেন, কিন্তু সে ব্যক্তি নিজে তা প্রকাশ করায় কুকুরের মত মৃত্যুবরণ করলো। একথা শুনে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম চুপ থাকেন। এরপর সামনে কিছু দূর গমনের পর তিনি দেখতে পান যে, একটি মৃত গাধা পড়ে আছে, যার পা উপরের দিকে। তখন তিনি জিজ্ঞাসা করেনঃ অমুক, অমুক ব্যক্তি কোথায়? তখন তারা দু'জন সেখানে হাযির হয়ে বলেঃ ইয়া রাসূলাল্লাহ! আমরা উপস্থিত। তখন তিনি তাদের বলেনঃ এসো এবং তোমরা এ মৃত গাধার গোশত ভক্ষণ কর। তখন তারা দু'জন বলেঃ হে আল্লাহ্‌র নবী! ইহা কে ভক্ষণ করে থাকে? তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তোমরা তোমাদের ভাইয়ের ক্রটি যেভাবে আলেচনা করেছ, তা এই মরা গাধার গোশত খাওয়ার চাইতেও গুরুতর! আল্লাহর শপথ! যার নিয়ন্ত্রণে আমার জীবন; তোমরা শুনে নাও! মা'ইয (রাঃ) এখন জান্নাতের নহরে গোসল করছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 78
			}
		}
	]
}