{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"40": "Prescribed Punishments (Kitab Al-Hudud)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4448,
			"arabicnumber": 4448,
			"text": "মুহাম্মদ ইবন আলা (রহঃ) ..... বারা ইবন আযিব (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সামনে দিয়ে একজন ইয়াহূদী যাচ্ছিল, যার মুখে কাল দাগ দেয়া হয়েছিল। তখন তিনি তাদের ডেকে বলেনঃ তোমরা কি যিনাকারীর শাস্তি তাওরাত এরূপ পেয়েছ? তারা বলেঃ হ্যাঁ। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের একজন আলিমকে ডাকেন এবং বলেনঃ আমি তোমাকে আল্লাহ্‌র শপথ দিয়ে জিজ্ঞাসা করছি, যিনি মূসার উপর তাওরাত নাযিল করেন। তোমরা কি তোমাদের ধর্মগ্রন্থ তাওরাতে যিনার শাস্তি এরূপ পেয়েছ? তখন সে ব্যক্তি বলেঃ না, ইয়া রাসূলাল্লাহ! যদি আপনি আমাকে এরূপ কঠিন শপথ প্রদান না করতেন, তবে তা আমি আপনার কাছে প্রকাশ করতাম না। আমরা আমাদের ধর্মগ্রন্থে যিনার শাস্তি রজম পাই। কিন্তু যখন আমাদের সম্ভ্রান্ত ব্যক্তিদের মধ্যে যিনার প্রচলন অধিক হয়ে যায়, তখন কোন শরীফ লোক এজন্য দোষী সাব্যস্ত হলে আমরা তাকে ছেড়ে দেই এবং কোন দুর্বল লোক যিনা করলে তার উপর শরীআতের নির্দেশিত শাস্তি প্রদান করি। আমরা সর্ব সম্মতভাবে এরূপ সিদ্ধান্ত গ্রহণ করি যে, আমরা নিজেরাই এমন একটি হদ বা শাস্তি নির্ধারণ করে নেই, যা শরীফ ও দুর্বল ব্যক্তিদের উপর একইভাবে প্রয়োগ করা যায়। তখন আমরা মুখে কাল দাগ ও বেত্রাদণ্ডের ব্যবস্থা নির্ধারণ করি এবং রজমের ব্যবস্থা পরিহার করি। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ ইয়া আল্লাহ্‌! তারা যখন তোমার নির্দেশ পরিত্যাগ করেছে, তখন সর্ব প্রথম আমিই তা জারী করব। তিনি তখন সে ব্যক্তির উপর রজমের হুকুম জারী করলে তা কার্যকরী করা হয়। তখন আল্লাহ্‌ তা'আলা এ আয়াত নাযিল করেনঃ হে রাসূল! তারা যেন আপনাকে কষ্ট না দেয়, যারা কাফির হওয়ার কারণে জলদি করে .... যারা আল্লাহর কিতাব অনুসারে ফায়সালা করে না, তারা কাফির। এ নির্দেশ ইয়াহূদীদের সম্পর্কে। এরপর আল্লাহর বাণীঃ যারা আল্লাহ্‌র কিতাব অনুযায়ী ফায়সালা করে না, তারা জালিম। এ আয়াতও ইয়াহূদীদের সম্পর্কে নাযিল হয়। তারপর আল্লাহ্‌র এ বাণীঃ যারা আল্লাহ্‌র কিতাব অনুযায়ী ফায়সালা করে না, তারা ফাসিক। এ আয়াত সব ধরনের কাফিরদের সম্পর্কে নাযিল হয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 98
			}
		}
	]
}