{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"40": "Prescribed Punishments (Kitab Al-Hudud)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4450,
			"arabicnumber": 4450,
			"text": "মুহাম্মদ ইবন ইয়াহইয়া (রহঃ) ..... আবূ হুরায়রা (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ ইয়াহূদীদের থেকে একজন পুরুষ ও একজন নারী ব্যভিচারে লিপ্ত হয়। তখন তারা একজন অপর জনকে বলেঃ চল আমরা এদের নিয়ে এই নবীর কাছে যাই; কেননা, তাকে শরীআতের হালকা নির্দেশসহ পাঠানো হয়েছে। কাজেই, তিনি যদি আমাদের ব্যাপারে রজমের চাইতে নীচু পর্যায়ের কোন নির্দেশ দেন, তবে আমরা তা মেনে নেব। আর এটি আমাদের জন্য আল্লাহ্‌ তা’আলার নিকট একটি উজ্জ্বল নিদর্শনস্বরূপ হবে যে, আমরা তাক (আল্লাহ্‌কে) বলবোঃ এতো তোমার নবীদের মধ্য হতে এক নবীর নির্দেশ। রাবী বলেনঃ তখন তারা নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট আসে এবং তিনি তাঁর সাহাবীদের সাথে তখন মসজিদে বসেছিলেন। তারা বলেঃ হে আবুল কাসিম! যে সমস্ত নারী-পুরুষ যিনা করে এদের ব্যাপারে আপনার অভিমত কি? তিনি তাদের সাথে কোন কথা না বলে, তাদের এক মাদ্রাসায় গমন করেন এবং এর দরজায় দাঁড়িয়ে বলেনঃ আমি তোমাদের আল্লাহ্‌র নামের শপথ দিয়ে জিজ্ঞাসা করছি, যিনি মূসার উপর তাওরাত নাযিল করেছেন; তোমরা যিনা সম্পর্কে তাকে কিরূপ নির্দেশ দেখতে পাও, যদি সে ব্যক্তি বিবাহিত হয়? তখন তারা বলেঃ আমাদের নিকট তার শাস্তি হলোঃ তার মুখে কাল দাগ দেওয়া, অসম্মানিত করা এবং বেত্রাঘাত করা। আর এভাবে অপমান করা যে, যিনাকারীদের গাধার পিঠে, তার পিছনের দিকে মুখ ফিরিয়ে বসিয়ে দিয়ে, লোকদের মাঝে ঘুরানো। রাবী বলেনঃ এ সময় ইয়াহূদীদের এক যুবক চুপ করে বসে থাকে। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে চুপ থাকতে দেখে, তাকে আল্লাহর নামের শপথ দিতে সে সম্পর্কে জিজ্ঞাসা করে। তখন সে যুবক বলেঃ ইয়া আল্লাহ্‌! আপনি যখন আমাকে আল্লাহ্‌র নামের শপথ দিয়ে জিজ্ঞাসা করছেন, তখন আমি বলতে বাধ্য যে, তাওরাতের মধ্যে যিনার শাস্তি হলো রজম। তখন নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জিজ্ঞাসা করে, কিরূপে তা পরিবর্তন করলে? তখন সে বলেঃ আমাদের জনৈক বাদশাহ তার একজন নিকটাত্মীয় যিনা করায়, তিনি তাকে রজম করেন নি। এরপর একজন সাধারণ লোক যিনা করলে, বাদশাহ তাকে রজম করার ইচ্ছা করেন। তখন সে লোকের সম্প্রদায়ের লোকেরা উপস্থিত হয়ে এরূপ দাবী করে যে, যতক্ষণ না বাদশাহ তার নিকটাত্মীয়কে এনে আমাদের সামনে পাথর মেরে হত্যা করবে; ততক্ষণ আমরা আমাদের সম্প্রদায়ের লোককে রজম করতে দেব না। যখন তারা এরূপ শাস্তিদানে (মুখে কাল দাগ ইত্যাদি) একমত হয়ে সমস্যার সমাধান করে। তখন নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আমি তোমাদের ব্যাপারে তাওরাতের হুকুম অনুযায়ী ফায়সালা দিচ্ছি। তিনি সে দু'জনের ব্যাপারে রজমের হুকুম দিলে, তা কার্যকর করা হয়। রাবী যুহরী (রহঃ) বলেনঃ আমি জানতে পেরেছি যে, এ আয়াত তাদের সম্পর্কে নাযিল হয়ঃ আমি তাওরাত নাযিল করেছি, যাতে হিদায়াত ও নূর আছে। আর ঐ সব নবীরা তাওরাতের নির্দেশ মত ফায়সালা করে থাকে, যারা আল্লাহ্‌র অনুগত। নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লামও ঐ সমস্ত নবীদের অন্যতম ছিলেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 100
			}
		}
	]
}