{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"41": "Types of Blood-Wit (Kitab Al-Diyat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4564,
			"arabicnumber": 4564,
			"text": "যুহায়র ইবন হারব (রহঃ) ..... আমর ইবন শু'আয়েব (রহঃ) তার পিতা হতে এবং তিনি তার দাদা থেকে বর্ণনা করেন যে, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ দাঁতের দিয়াত হলো পাঁচটি উট। ইমাম আবূ দাউদ (রহঃ) বলেনঃ আমার গ্রন্থে শায়বান (রহঃ) সূত্রে একটি হাদীছ বর্ণনা করেছি; কিন্তু আমি তা তার থেকে শুনিনি। এরপর আবূ বকর নামক আমাদের একজন সাথী আমার কাছে বর্ণনা করেছেন, যিনি আমাদের কাছে নির্ভরযোগ্য। তিনি শায়াবান (রহঃ) হতে, তিনি মুহাম্মদ ইবন রাশীদ (রহঃ) হতে, সুলায়মান ইবন মূসা (রহঃ) হতে, আমর ইবন শু'আয়েব (রহঃ) হতে, তিনি তার পিতা হতে এবং তিনি তার দাদা থেকে এরূপ বর্ণনা করেছেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ভুলবশত হত্যার জন্য বস্তীবাসীদের উপর চারশো দীনার অথবা এর সম-মূল্যের দিরহাম দিয়াত স্বরূপ ধার্য করেন। আর এই মূল্য ছিল-উটের মূল্যের উপর স্থির কৃত। তিনি দুষ্প্রাপ্যতার সময় উটের মূল্য বাড়িয়ে দিতেন, আর আমদানী বেশী হওয়ার কারণে যখন তার দাম কমে যেত, তখন তিনি দিয়াতের জন্য ধার্যকৃত মূল্যমান কমিয়ে দিতেন। আর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর যামানার দিয়াতের পরিমাণ চারশো দীনার হতে আটশো দীনার পর্যন্ত পৌছাতো; যার মূল্যমান রূপার হিসাবে আট হাজার দিরহাম হতো। আর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম গরুর মালিকদের উপর দিয়াত হিসাবে দু'শো গরু নির্ধারণ করেন এবং যাদের উপর বকরীর দিয়াত ওয়াজিব হতো, তিনি তাদের দু'হাজার বকরী দেয়ার নির্দেশ দিতেন। রাবী বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যদি কারো নাক কাটা যায়, তবে এর ফলে সে পূর্ণ দিয়াত পাবে। আর যদি কেবল নাকের মাথা কাটা যায় তবে সে অর্ধেক দিয়াত পাবে। অর্থাৎ পঞ্চাশটি উট বা এর সম-মূল্যের সোনা বা রুপা, অথবা একশো গরু বা এক হাজার বকরী। আর কারো এক হাত কাটা গেলে, সে অর্ধেক দিয়াত পাবে। এভাবে এক পা কাটা গেলে, সে ও অর্ধেক দিয়াত পাবে। আর যদি কারো মাথায় যখম হয়, তবে তাকে এজন্য দিয়াতের এক-তৃতীয়াংশ প্রদান করতে হবে; যথাঃ তেত্রিশটি উট বা এর সম-মূল্যের সোনা বা রূপা। গরু ও বকরীর ক্ষেত্রে নির্দেশ এরূপই এবং পেটের দিয়াতের নির্দেশও এরূপ। আর আংগুলের ব্যাপারে, প্রতিটি আংগুলের জন্য বিনিময় হলো- দশটি উট এবং দাঁতের ব্যাপারে প্রতিটি দাঁতের বিনিময় হলো- পাঁচটি উট যা দিয়াত স্বরূপ আদায় করতে হবে। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আরো বলেছেনঃ মহিলার দিয়াত তার আত্মীয়দের মাঝে বন্টিত হবে এবং তারা হবে ঐ ধরনের লোক, যারা নিকটাত্মীদের মাঝে বণ্টনের পর তার অধিকারী হবে। আর যদি কোন মহিলা নিহত হয়, তবে তার দিয়াত, তার উত্তরাধিকারিগণের মাঝে বন্টিত হবে এবং তারাই হত্যাকারীর নিকট হতে 'কিসাস' গ্রহণ করবে। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আরো বলেছেনঃ হত্যাকারীর উত্তরাধিকারিগণ তার সম্পদের অধিকারী হবে না। আর যদি নিহত ব্যক্তির কোন ওয়ারিছ না থাকে, তবে এর পরবর্তী নিকটাত্মীয়গণ এর অধিকারী হবে এবং হত্যাকারী ব্যক্তি কোন সম্পদের উত্তরাধিকারী হবে না।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 71
			}
		}
	]
}