{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"42": "Model Behavior of the Prophet (Kitab Al-Sunnah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4612,
			"arabicnumber": 4612,
			"text": "মুহাম্মদ ইবন কাছীর (রহঃ) ... সুফিয়ান (রহঃ) থেকে বর্ণিত। তিনি বলেনঃ এক ব্যক্তি উমার ইবন আবদুল আযীয (রহঃ)-এর নিকট পত্রযোগে তাকদীর সম্পর্কে জানতে চান। আবূস সালত (রহঃ) থেকে বর্ণিত। তিনি বলেনঃ এক ব্যক্তি তাকদীর সম্পর্কে জানার জন্য উমার ইবন আবদুল আযীয (রহঃ)-কে পত্র লেখেন। এর জবাবে তিনি লেখেনঃ আমি তোমাকে ওসীয়ত করছি আল্লাহ্‌কে ভয় করার জন্য এবং তাঁর হুকুম মেনে চলার জন্য এবং তাঁর নবীর সুন্নাতের অনুসরণ করাব জন্য। আর বিদ'আতিগণ যা উদ্ভাবন করেছে, তা পরিহার করার জন্য আমি তোমাকে ওসীয়ত করছি। বিদ'আতীরা এসব কথা তখন উদ্ভাবন করেছে, যখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সুন্নাত প্রতিষ্ঠিত হয়েছে। বিদ'আত সৃষ্টির পর তারা বিভ্রান্ত হয়েছে। তোমার উচিত, সুন্নাতকে দুঢ়ভাবে ধারণ করা। কেননা, সুন্নাতের উপর আমল করলে তুমি আল্লাহর হুকুমে গুমরাহী থেকে বেঁচে যাবে। জেনে রাখ! লোকেরা এমন কোন বিদ'আত সৃষ্টি করিনি, যা বাতিল হওয়ার জন্য দলীল বর্ণিত হয়নি এবং তা দেখাতে শিক্ষা হয়নি। আর সুন্নাতকে তিনি জারী করেছেন, যিনি জানতেন, এর বিরোধিতা করলে কিরূপ গুনাহ, ক্রটি-বিচ্যূতি ও আহমকী হবে। কাজেই তুমি সে তরীকার অনুসরণ কর, যে তরীকা অনুসরণ করেছিল পূর্ববর্তীগণ। কেননা, তাঁরা দীনের ইলম সম্পর্কে গভীর জ্ঞানী ছিলেন। আর যে কাজ করতে তাঁরা নিষেধ করেছেন, তা জেনে-শুনেই করেছেন। তারা দীনের অর্থ বুঝার ক্ষেত্রে আমাদের চাইতে অনেক ক্ষমতার অধিকারী ছিল। আর তাদের মাঝে যে যোগ্যতা ছিল, তা ছিল উন্নতমানের। তোমরা যে তরীকার উপর প্রতিষ্ঠিত আছ, যদি তা-ই হিদায়াত হয়, তবে তোমরা অগ্রগামী হয়ে যাবে। আর যদি তোমরা বল, যারা দীনের মধ্যে নতুন কথা সৃষ্টি করেছে; তবে আমরা বলবোঃ আগের লোকেরাই উত্তম ছিল এবং তারা এদের চাইতে অগ্রগামী ছিল। যতটুকু বর্ণনা করার, তা তাঁরা করেছেন। আর যতটুকু বলা দরকার, তা সবই করেছেন; এর উপরেও কিছু বলার নেই এবং নীচেও কিছু বলার নেই। কিছু লোক তাদের থেকে কম বর্ণনা করেছে, তারা ক্ষতি করেছে; আর কিছু লোক তাদের চাইতে বেশী বর্ণনা করেছেন। পূর্ববর্তী আলিমগণ মধ্যপন্থী ছিলেন এবং তাঁরা সোজা-সরল রাস্তার অনুসরণকারী ছিলেন। তুমি পত্রে তাকদীর সম্পর্কে জানতে চেয়েছ। আল্লাহ্‌র হুকুমে তুমি এ প্রশ্ন সম্পর্কে তাদের চাইতে অধিক জ্ঞানী। আমি মনে করি, যত বিদ'আতী সৃষ্টি হয়েছে এবং তারা যা নতুন উদ্ভাবন করেছে, এর মধ্যে তাকদীরের বর্ণনা খুবই স্পষ্ট এবং মজবুত। জাহিলী যুগের লোকেরা তাদের কথাবার্তায় তাকদীরের কথা বলতো এবং তাদের কবিতায় তাকদীর থেকে মসীবত দূর করে দিত। অবশেষে ইসলাম এ ধারণাকে আরো শক্ত করেছে। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক বা দুই হাদীছে নয়, বরং অনেক হাদীছে তাকদীরের কথা বর্ণনা করেছেন। মুসলিমেরা তাঁর থেকে এসব শুনেছেন এবং অন্যের কাছে বর্ণনাও করেছেন তাঁর জীবদ্দশায় এবং মৃত্যুর পরও; এর উপর বিশ্বাস রেখে এবং মেনে নিয়ে। আর নিজের দুর্বলতা সম্পর্কে জেনে যে এমন কিছুই নেই, যা আল্লাহ্‌ জানেন না এবং তাঁর কিতাবে লেখা নেই, অথবা এ ব্যাপারে আল্লাহ্‌র-ফায়সালা বাস্তবায়িত হয়নি। উল্লেখ্য যে, তাকদীরের বর্ণনা আল্লাহ্‌র মজবুত কিতাবে রয়েছে, তা থেকে পূর্ববর্তীগণ তাকদীরের মাসআলা-মাসায়েল শিখেছে। যদি তুমি বলঃ কেন আল্লাহ্‌ এ আয়াত নাযিল করেন, আর কেন এমন বলেন (যা বাহ্যতঃ তাকদীরের বিপরীত)? এর জবাব হলোঃ আগের যুগের লোকেরা এ আয়াত পড়েছিল এবং তারা এর ব্যাখ্যা সম্পর্কে সম্যক অবহিত ছিল, যা তোমরা জান না। তারা আল্লাহ্‌র কিতাব ও তাকদীর সম্পর্কে বলতোঃ তা-ই হবে, যা আল্লাহ চান ; আর তা হবে না, যা তিনি চান না। আর আমরা আমাদের উপকার ও অপকারের পূর্ণ ক্ষমতা রাখি না। এ বিশ্বাসের উপর পূর্ববর্তীগণ উত্তম কাজ করতেন এবং খারাপ কাজ করতে ভয় পেতেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 17
			}
		}
	]
}