{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"42": "Model Behavior of the Prophet (Kitab Al-Sunnah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4695,
			"arabicnumber": 4695,
			"text": "উবায়দুল্লাহ ইবন মু'আয (রহঃ) ..... ইয়াহইয়া ইবন ইয়ামার (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ বসরার অধিবাসী মা'আবাদ জুহানী সর্ব প্রথম তাকদীরের সমালোচনা করেন। এ সময় আমি এবং হুমায়দ ইবন আবদুর রহমান হিময়ারী (রহঃ) হাজ্জ বা উমরার উদ্দেশ্যে বের হই। আমরা বলাবলি করিঃ যদি আমাদের সাথে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কোন সাহাবীর দেখা হয়, তবে আমরা তার সঙ্গে এ ব্যক্তিদের সম্পর্কে আলোচনা করবো, যারা তাকদীর সম্পর্কে এরূপ বলে। তখন আল্লাহ্‌র মেহেরবানীতে আমরা আবদুল্লাহ্‌ ইবন উমার (রাঃ)-এর দেখা পাই-মসজিদে প্রবেশ করার সাথে-সাথেই। আমি এবং আমার সাথী তাকে ঘিরে ধরি এবং আমি মনে করি আমার সাথী আমাকে কথা বলার সুযোগ দেবে। তখন আমি তাকে বলিঃ হে আবূ আবদুর রহমান! আমাদের মাঝে এমন কিছু লোকের সৃষ্টি হয়েছে, যারা কুরআন পাঠ করে এবং এর সূক্ষ্ম বিষয়ের প্রতি লক্ষ্য করে বলেঃ তাকদীর বলে কিছুই নেই। সব কিছুই এমনিতেই হয়ে থাকে। এ কথা শুনে তিনি বলেনঃ যখন তাদের সাথে তোমাদের দেখা হবে, তখন তাদের বলবে, আমি তাদের উপর অসন্তুষ্ট এবং তারাও আমার উপর অসন্তুষ্ট। ঐ জাতের (আল্লাহ্‌র) কসম! যার কসম আবদুল্লাহ ইবন উমার (রাঃ) করছে; যদি তাদের কারো কাছে উহুদ পরিমাণ সোনা থাকে এবং তারা তা (আল্লাহ্‌র রাস্তায় খরচ করে, তবু ও আল্লাহ্‌ ততক্ষণ তা কবূল করবেন না, যতক্ষণ না সে তাকদীরের প্রতি ঈমান আনে। এরপর তিনি বলেনঃ আমার কাছে উমার ইবন খাত্তাব (রাঃ) বর্ণনা করেছেন যে, একদা আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট বসা ছিলাম। সে সময় সেখানে শাদা পোশাক পরিহিত, কাল চুল বিশিষ্ট একজন আসে, যার মধ্যে সফরের কোন চিহ্ন ছিল না এবং তাঁর দুই জানু নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর জানুদ্বয়ের নিকট রেখে, স্বীয় দু'হাত নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর জানুর উপর রেখে জিজ্ঞাসা করেঃ হে মুহাম্মদ! ইসলাম কি, সে সম্পর্কে আমাকে অবহিত করুন। তিনি বলেনঃ ইসলাম হলো-এরূপ সাক্ষ্য দেওয়া যে, আল্লাহ্‌ ছাড়া আর কোন ইলাহ নেই এবং মুহাম্মদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর রাসূল। তুমি সালাত কায়েম করবে, যাকাত দেবে এবং রমযানের রোযা রাখবে এবং সামর্থ থাকলে আল্লাহ্‌র ঘর যিয়ারত (হাজ্জ) করবে। তখন সে বলেঃ আপনি সত্য বলেছেন। উমার (রাঃ) বলেনঃ তার এরূপ উক্তিতে আমরা বিস্মিত হই এ জন্য যে, সে নিজে প্রশ্ন করছে এবং নিজেই তা সত্যায়িত করছে! এরপর সে জিজ্ঞাসা করেঃ ঈমান কি? নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ ঈমান হলো-তুমি আল্লাহ্‌, ফেরেশতা, কিতাব, রাসূল এবং কিয়ামতের দিনের উপর দৃঢ়-বিশ্বাস রাখবে, আর এও ইয়াকীন রাখবে যে, তাকদীরের ভাল-মন্দ সবই আল্লাহ্‌র তরফ থেকে হয়। এ কথা শুনে সে বলেঃ আপনি ঠিকই বলেছেন। এরপর সে ব্যক্তি জিজ্ঞাসা করেঃ আমাকে ইহসান সম্পর্কে কিছু বলুন। জবাবে তিনি বলেনঃ তুমি আল্লাহ্‌র ইবাদত এ ভাবে করবে, যেন তুমি তাঁকে দেখছো। আর যদি তুমি তাঁকে দেখতে না পাও, তবে এরূপ মনে করবে যে, তিনি তোমাকে দেখছেন। এরপর সে ব্যক্তি জিজ্ঞাসা করেঃ কিয়ামত কবে হবে? তিনি বলেনঃ এ সম্পর্কে যাকে জিজ্ঞাসা করে হয়েছে, সে প্রশ্নকারী থেকে অধিক অবহিত নয়। তখন সে ব্যক্তি বলেঃ তাহলে এর আলামত সম্পর্কে কিছু বলুন। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ দাসী তার মনিবের জন্ম দেবে (অর্থাৎ সন্তান তার মায়ের নাফরমানী করবে); আর তুমি দেখবে যে, খালি পা ও খালি গায়ের অধিকারী মুখাপেক্ষী রাখাল সম্প্রদায়ের লোকেরা উঁচু-উঁচু প্রাসাদ তৈরী করে গর্ব প্রকাশ করবে। রাবী বলেনঃ পরে সে ব্যক্তি চলে গেলে, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কাছে কিছুক্ষণ অবস্থান করি। তিনি বলেনঃ হে উমার! তুমি কি জান, এ প্রশ্নকারী ব্যক্তিটি কে? আমি বলিঃ আল্লাহ্‌ এবং তাঁর এ বিষয়ে অধিক জ্ঞাত। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ ইনি হলেন, জিবরীল (আঃ), যিনি তোমাদের কাছে এসেছিলেন দীন সম্পর্কে শিক্ষা দেয়ার জন্যে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 100
			}
		}
	]
}