{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"42": "Model Behavior of the Prophet (Kitab Al-Sunnah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4751,
			"arabicnumber": 4751,
			"text": "মুহাম্মদ ইবন সুলায়মান (রহঃ) .... আনাস ইবন মালিক (রাঃ) থেকে বর্ণিত। তিনি বলেনঃ একদা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নাজ্জার গোত্রের একটি খেজুরের বাগানে প্রবেশ করেন। সেখানে তিনি একটা শব্দ শুনে ভীত হয়ে পড়েন এবং বলেনঃ এ কবরগুলি কাদের? তারা বলেঃ ইয়া রাসূলাল্লাহ! এরা জাহিলী যুগে মারা গেছে। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তোমরা আল্লাহ্‌র কবরের আযাব ও দাজ্জালের ফিতনা থেকে আশ্রয় প্রার্থনা কর। তখন তারা বলেঃ ইয়া রাসূলাল্লাহ! আমরা কেন এরূপ করবে। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন যখন কোন মু'মিন ব্যক্তিকে তার কবরে রাখা হয়, তখন একজন ফেরেশতা তাকে জিজ্ঞাসা করেঃ তুমি কার ইবাদত করতে? তখন মহান আল্লাহ্‌ তাকে হিদায়াত দান করেন। তখন সে বলেঃ আমি আল্লাহ্‌র ইবাদত করতাম। তখন তাকে জিজ্ঞাসা করা হবেঃ তুমি এ ব্যক্তির (মুহাম্মদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর) ব্যাপারে কিরূপ ধারণা পোষণ করতে? তখন সে বলবেঃ তিনি আল্লাহ্‌র বান্দা এবং তাঁর রাসূল। এরপর তাকে আর কিছু জিজ্ঞাসা করা হবে না। এরপর তাকে এমন একস্থানে নেওয়া হয়, যা তার জন্য জাহান্নামে বানানো হয়েছিল। তখন তাকে বলা হবেঃ এটা এটা তোমার জাহান্নামের ঘর ছিল। আল্লাহ্‌ তোমাকে এ থেকে রক্ষা করেছেন এবং তোমার উপর রহম করেছেন এবং এর বিনিময়ে তোমার জন্য জান্নাতে একটা চিরস্থায়ী ঘর দান করেছেন। তখন সে বলেঃ আমাকে ছেড়ে দাও, যাতে আমি আমার পরিবার-পরিজনদের এ সুসংবাদ দিতে পারি। তখন তাকে বলা হয়ঃ তুমি শান্ত হও। অপরপক্ষে যখন কোন কাফিরকে কবরে রাখা হয়, তখন তার কাছে একজন ফেরেশতা আসে এবং ধমকের সুরে জিজ্ঞাসা করেঃ তুমি কার ইবাদত করতে? সে বলবেঃ আমি জানি না। তখন তাকে বলা হয়ঃ তুমি নিজেও জ্ঞান অর্জন করনি। এরপর তাকে জিজ্ঞাসা করা হয়ঃ এ ব্যক্তির ব্যাপারে তোমার ধারণা কিরূপ ছিল? তখন সে বলেঃ তাঁর ব্যাপারে লোকদের যেরূপ ধারণা ছিল, আমার ধারণাও সেরূপ। এ কথা শুনে ফেরেশতা তার মাথায় লোহার মুগুর দিয়ে প্রচণ্ডভাবে আঘাত করে, ফলে সে এত জোরে চীৎকার করে যে, জিন ও ইনসান ব্যতীত সে চীৎকার সব সৃষ্ট জীব শুনতে পায়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 156
			}
		}
	]
}