{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"2": "Prayer (Kitab Al-Salat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 506,
			"arabicnumber": 506,
			"text": "আমর ইবনু মারযূক .... ইবনু আবূ লায়লা (রহঃ) বলেন, নামাযের ব্যাপারে (কিবলার) পরিবর্তন তিনবার সাধিত হয়েছে। রাবী বলেন, আমাদের সাথীরা বর্ণনা করেছেন যে, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বলেনঃ মুসলিমগণ একত্রিত হয়ে জামাআতে নামায আদায় করায় আমি খুবই আনন্দিত হয়েছি। আমি প্রথমাবস্থায় এরূপ চিন্তা করি যে, লোকদের নামাযের আহবানের জন্য বাড়ীতে বাড়ীতে কিছু লোক প্রেরণ করি আমি এরূপও ইরাদা করি যে, লোকদেরকে জামাআতে আনার জন্য কিছু সংখ্যক লোককে (মহল্লার) উঁচু স্থানে উঠিয়ে দিব, যারা তাদেরকে নামাযের জন্য আহবান করবে, অথবা তারা শিংগা ধ্বনির মাধ্যমে লোকদেরকে জামাআতে আহবান করার চিন্তাও করেছিল। রাবী বলেন, এমতাবস্থায় আনসারদের মধ্য হতে একজন এসে বলেন, ইয়া রাসূলাল্লাহ! লোকদেরকে জামাআতে-হাযির করার ব্যাপারে আপনাকে উৎকণ্ঠিত দেখার পর রাতে আমি স্বপ্নে দেখি যে এক ব্যক্তি দুটি হলুদ বর্ণের কাপড় পরিধাণ করে মসজিদের সম্মুখে আযান দিচ্ছেন। আযান শেযে কিছুক্ষণ বিশ্রামের পর তিনি ইকামত দেন এবং এখানে তিনি আযানের শব্দের সাথে “কাদ কামাতিস-সালাহ” শব্দটি যোগ করেন। অতঃপর তিনি বলেন- মানুষের মিথ্যা অপবাদের ভয় যদি আমার না থাকত তবে নিশ্চয়ই আমি বলতাম, আমি তা জাগ্রত অবস্থায় দেখেছি- স্বপ্নে নয়। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বলেনঃ আল্লাহ্ তা’আলা তোমাকে উত্তম স্বপ্ন দেখিয়েছেন। তুমি বিলালকে নির্দেশ দাও যেন সে আযান দেয়। তখন উমার (রাঃ) বলেন, আমিও ইতিপূর্বে তার অনুরূপ স্বপ্ন দেখেছি। কিন্তু আমার আগেই অনুরূপ স্বপ্নের কথা ব্যক্ত হওয়ার কারণে আমি তা প্রকাশ করতে সংকোচ বোধ করি। রাবী বলেন, ইসলামের প্রারম্ভিক যুগে যখন নামাযের হুকুম-আহকাম পরির্ণভাবে নাযিল হয় নাই তখন সাহাবায়ে কিরামদের মধ্য হতে যারা নামায আরম্ভের পরে আসতেন তারা জিজ্ঞেস করতেন- নামাযের কতটুকু আদায় করা হয়েছে। অতঃপর তাদের অবহিত করা হত। যারা রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়া সাল্লামের সাথে প্রথম হতে নামাযে শরীক হতেন তারা এক অবস্থায় থাকতেন এবং যারা পরে আসতেন তাদের কেউ দাঁড়ান, বসা বা রুকুর অবস্থায় থাকতেন। ইবনুল মুছান্না, আমর, হুসায়েন, ইবনু আবূ লায়লা হতে বর্ণনা করেছেন যে, একদা মুআয ইবনু জাবাল (রাঃ) জামাআত শুরু হওয়ার পর মসজিদে আসেন। শোবা- হুসায়েন হতে বর্ণনা করেছেন, তিনি বলেন, আমি তাকে এক অবস্হায় দেখতে পাই নাই- হতে, অনুরূপভাবে তোমরা কর…পর্যন্ত বর্ণনা করেন। ইমাম আবূ দাউদ (রহঃ) বলেন, অতঃপর আমি আমরের হাদীছ বর্ণনা করি রাবী বলেন, মুআয (রাঃ) মসজিদে আগমনের পর উপস্হিত সাহাবীগণ তাকে ইশরা করে বলেন…। শোবা বলেন, আমি হুসায়েনের নিকট শুনেছি, মুআয (রাঃ) বলেন, আমি তাকে নামাযের মধ্যে যে অবস্থায় পাই সে অবস্থায় তাঁর সাথে নামায আরম্ভ করব। রাবী বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তখন বলেনঃ মুআয তোমাদের জন্য একটি উত্তম সুন্নাত সৃষ্টি করেছে (অর্থাৎ সর্বপ্রথম ইমামের সাথে কিরূপে নামায আদায় করতে হয়, তা ভালভাবে দেখিয়েছেন। তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাথে প্রাপ্ত নামায জামাআতে আদায়ের পর অবশিষ্ট নামায পরে আদায় করেন)। অতঃপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তোমরাও এরূপ করবে। রাবী বলেন, আমাদের সাথীরা বর্ণনা করেছেন যে, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়া সাল্লামের মদ্বীনায় আসার পর তাদেরকে প্রতি মাসে তিনটি রোযা রাখার নির্দেশ দেন। অতঃপর রমযানের রোযার আয়াত নাযিল হয় সাহাবীদের ইতিপূর্বে রোযা রাখার অভ্যাস না থাকায় তা তাঁদের জন্য খুবই কষ্টকর হয়। অতঃপর যারা রোযা রাখতে অক্ষম তাঁরা মিসকীনদের আহার করাতেন। অতঃপর এই আয়াত নাযিল হয়ঃ(‏فَمَنْ شَهِدَ مِنْكُمُ الشَّهْرَ فَلْيَصُمْهُ) “তোমাদের মধ্যে যারা রমযান মাস পাবে তারা যেন অবশ্যই রোযা রাখে।” মুসাফির ও রোগগ্রস্ত ব্যক্তির জন্যই কেবলমাত্র রমযান মাসের রোযা না রাখার অনুমতি ছিল (কিন্তু অন্য সময়ে এর কাযা আদায় করতে হত)। এভাবে তাদেরকে রমযানের রোযা রাখার নির্দেশ দেয়া হয় ইসলামের প্রথম যুগে রোযার নিয়ম এইরূপ ছিল যে, ইফতারের পর খাওয়ার পূর্বে কোন ব্যক্তি যদি কোন কারণ বশত ঘুমিয়ে পড়ত তবে তার জন্য পরের দিন সূর্যাস্তের পূর্ব পর্যন্ত কোনরূপ খাদ্য গ্রহণ নাজায়েয ছিল। এক রাতে উমার (রাঃ) তাঁর স্ত্রীর নিকট সহবাসের ইচ্ছা প্রকাশ করলে তিনি বলেন, আমি তো ঘুমিয়ে ছিলাম। তখন উমার (রাঃ) এরূপ ধারণা করেন যে, তাঁর স্ত্রী মিথ্যা বাহানা করে তাঁর প্রস্তাব প্রত্যাখ্যান করেছেন। অতঃপর তিনি তাঁর সাথে সংগম করেন। অপরপক্ষে একজন আনসার সাহাবী ঘরে ফিরে খাদ্য চাইলে তাঁর পরিবারের লোকেরা বলেন, ধৈর্য ধরুন, আমরা খাবার প্রস্তুত করে আনছি। ইত্যবসরে তিনি না খেয়ে ঘুমিয়ে পড়েন পরের দিন ভোরে এই আয়াত নাযিল হয়ঃ (أُحِلَّ لَكُمْ لَيْلَةَ الصِّيَامِ الرَّفَثُ إِلَى نِسَائِكُمْ) “রমযান মাসের রাতে তোমাদের জন্য তোমাদের বিবিদের সাথে সংগম হালাল করা হয়ছে।”",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 116
			}
		}
	]
}