{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"2": "Prayer (Kitab Al-Salat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 940,
			"arabicnumber": 940,
			"text": "আল কানবী (রহঃ) ..... সাহল ইবনে সা’দ (রাঃ) হতে বর্ণিত। তিনি বলেন, একদা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বানূ আমর ইবনে আউফ গোত্রের বিবাদ মীমাংসা জন্য গমন করেন। তখন নামাযের সময় উপস্থিত হলে মুয়াযযিন [বিলাল (রাঃ)] আবু বকর (রাঃ)-কে বলেন, আপনি কি জামায়াতে নামাযের ইমামতি করবেন? তখন তিনি স্বীকৃতি প্রদান করায় ইকামত দেয়া হলে আবু বকর (রাঃ) নামায শুরু করেন। এমন সময় রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম প্রত্যাবর্তন করেন যে, তখন নামায আরম্ভ হয়ে গিয়েছে। অতঃপর তিনি পিছনের কাতার হতে সামনের কাতারে গিয়ে দণ্ডায়মান হন। মুসল্লিরা তাকে দেখে হাতের উপর হাত রেখে শব্দ করছিল, কিন্তু আবু বকর (রাঃ) এর প্রতি ভ্রুক্ষেপ করেন নাই। অতঃপর শব্দ অধিক হওয়ার কারণে তিনি সে দিকে খেয়াল করতেই রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে দর্শন করেন (এবং সাথে সাথেই পিছনের দিকে সরে আসতে চেষ্টা করেন)। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইশারায় স্বীয় স্থানে অবস্থানের নির্দেশ দেন। তখন আবু বকর (রাঃ) স্বীয় হস্তদ্বয় উপরে উত্তোলন করে, এজন্য আল্লাহর প্রশংসা করেন এবং পশ্চাতে ফিরে এসে কাতারে শামিল হন। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইমামের স্থানে গমন করে নামায সমাপান্তে আবু বকর (রাঃ)-কে বলেন, হে আবু বকর! আমার নির্দেশ সত্যেও কিসে তোমাকে ইমামের স্থানে অবস্থান করতে বাধা দিয়েছে? জবাবে তিনি বলেন, আবু কুহাফার পুত্রের (আবু বকর) জন্য রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সম্মুখে দণ্ডায়মান হয়ে ইমামতি করা শোভা পায় না। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সমবেত মুসল্লিদের উদ্দেশ্যে বলেন, তোমরা হাতের উপর হাত মেরে নামাযের মধ্যে এত বেশি শব্দ করলে কেন? যদি ইমামের কোন ত্রুটি-বিচ্যুতি পরিলক্ষিত হয় তবে তোমরা “সুবহানাল্লাহ” বলবে। কেননা তোমাদের ‘সুবহানাল্লাহ বলা শুনলে ইমাম সেদিকে খেয়াল করবে। নামাযের মধ্যে হাতের উপর হাত মেরে শব্দ করা কেবলমাত্র মহিলাদের জন্য নির্ধারিত। (বুখারী, মুসলিম, নাসাঈ)। ইমাম আবু দাউদ (রহঃ) বলেন, এটা কেবলমাত্র ফরয নামাযের ক্ষেত্রে প্রযোজ্য।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 551
			}
		}
	]
}