{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"11": "The Book of Prayer - Funerals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2123,
			"arabicnumber": "916.01",
			"text": "Telah menceritakan kepada kami [Abu Kamil Al Jahdari Fudlail bin Husain] dan [Utsman bin Abu Syaibah] keduanya dari [Bisyr] - [Abu Kamil] berkata- Telah menceritakan kepada kami [Umarah bin Ghaziyyah] telah menceritakan kepada kami [Yahya bin Umarah] ia berkata, saya mendengar [Abu Sa'id Al Khudri] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tuntunlah orang yang sedang berada di penghujung ajalnya agar membaca (kalimat), 'LAA ILAAHA ILLALLAH.'\" Dan telah menceritakannya kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Abdul Aziz Ad Darawardi] -dalam jalur lain- Dan telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Khalid bin Makhlad] telah menceritakan kepada kami [Sulaiman bin Bilal] semuanya menggunakan isnad ini",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2124,
			"arabicnumber": "916.02",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2125,
			"arabicnumber": "917",
			"text": "Telah menceritakan kepada kami [Abu Bakr] dan [Utsman] -keduanya adalah anak dari Abu Syaibah- -dalam jalur lain- Dan telah menceritakan kepadaku [Amru An Naqid] semuanya berkata, telah menceritakan kepada kami [Abu Khalid Al Ahmar] dari [Yazid bin Kaisan] dari [Abu Hazim] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda, \"Tuntunlahlah orang yang sedang berada di penghujung ajalnya dengan kalimat LAA ILAAHA ILLALLAAH",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2126,
			"arabicnumber": "918.01",
			"text": "Telah menceritakan kepada kami [Yahya bin Ayyub] dan [Qutaibah] dan [Ibnu Hujr] semuanya dari [Isma'il bin Ja'far] - [Ibnu Ayyub] berkata- telah menceritakan kepada kami [Isma'il] telah mengabarkan kepadaku [Sa'd bin Sa'id] dari [Umar bin Katsir bin Aflah] dari [Ibnu Safinah] dari [Ummu Salamah] bahwa ia berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah seorang mukmin tertimpa musibah lalu ia membaca apa yang telah diperintahkan oleh Allah, 'INAA LILLAHI WAINNAA ILAIHI RAAJI'UUN ALLAHUMMA`JURNII FII MUSHIIBATI WA AKHLIF LII KHAIRAN MINHAA (Sesungguhnya kami adalah milik Allah dan akan kembali kepada Allah. Ya Allah, berilah kami pahala karena mushibah ini dan tukarlah bagiku dengan yang lebih baik daripadanya).' melainkan Allah menukar baginya dengan yang lebih baik.\" Ummu Salamah berkata; Ketika Abu Salamah telah meninggal, saya bertanya, \"Orang muslim manakan yang lebih baik daripada Abu Salamah? Dia adalah orang-orang yang pertama-tama hijrah kepada Rasulullah shallallahu 'alaihi wasallam. Kemudian akupun mengucapkan doa tersebut. Maka Allah pun menggantikannya bagiku Rasulullah shallallahu 'alaihi wasallam.\" Ummu Salamah mengkisahkan; Rasulullah shallallahu 'alaihi wasallam mengutus Hatib bin Abu Balta'ah melamarku untuk beliau sendiri. Maka saya pun menjawab, \"Bagaimana mungkin, aku telah mempunyai seorang anak wanita, dan aku sendiri adalah seorang pencemburu.\" Selanjutnya beliau pun menjawab: \"Adapun anaknya, maka kita do'akan semoga Allah mencukupkan kebutuhannya, dan aku mendo'akan pula semoga Allah menghilangkan rasa cemburunya itu",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2127,
			"arabicnumber": "918.02",
			"text": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abu Usamah] dari [Sa'd bin Sa'id] ia berkata, telah mengabarkan kepadaku [Umar bin Katsir bin Aflah] ia berkata, saya mendengar [Ibnu Safinah] menceritakan bahwa ia mendengar [Ummu Salamah] isteri Nabi shallallahu 'alaihi wasallam berkata; Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah seorang mukmin tertimpa musibah lalu ia membaca apa yang telah diperintahkan oleh Allah, 'INAA LILLAHI WAINNAA ILAIHI RAAJI'UUN ALLAHUMMA`JURNII FII MUSHIIBATI WA AKHLIF LII KHAIRAN MINHAA (Sesungguhnya kami adalah milik Allah dan akan kembali kepada Allah. Ya Allah, berilah kami pahala karena mushibah ini dan tukarlah bagiku dengan yang lebih baik daripadanya).' melainkan Allah menukar baginya dengan yang lebih baik.\" Ummu Salamah berkata; Ketika Abu Salamah telah meninggal, maka saya pun membaca sebagaimana yang diperintahkan oleh Rasulullah shallallahu 'alaihi wasallam, lalu Allah pun menggantikannya untukku dengan yang lebih baik darinya yaitu Rasulullah shallallahu 'alaihi wasallam. Dan telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] telah menceritakan kepada kami [bapakku] telah menceritakan kepada kami [Sa'd bin Abu Sa'id] telah mengabarkan kepadaku [Umar bin Katsir] dari [Ibnu Safinah] Maula Ummu Salamah, dari [Ummu Salamah] isteri Nabi shallallahu 'alaihi wasallam, ia berkata; Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda, yakni serupa dengan haditsnya Abu Usamah, dan ia menambahkan; (Ummu Salamah) berkata, \"Siapakah yang lebih baik dari Abu Salamah sahabat Rasulullah shallallahu 'alaihi wasallam, kemudian Allah pun mengokohkan hatiku untuk mengucapkannya. Lalu aku pun menikah dengan Rasulullah shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2128,
			"arabicnumber": "918.03",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2129,
			"arabicnumber": "919",
			"text": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Abu Kuraib] keduanya berkata, telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Syaqiq] dari [Ummu Salamah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila kamu menjenguk orang sakit atau orang yang meninggal, maka ucapkanlah (do'a) yang baik, karena malaikat mengaminkan ucapan kalian.\" Abu Salamah mengkisahkan; Ketika Abu Salamah meninggal, saya mendatangi Nabi shallallahu 'alaihi wasallam dan berkata, \"Wahai Rasulullah, sesungguhnya Abu Salamah telah meninggal.\" Maka beliau pun bersabda: \"Ucapkanlah, 'ALLAHUMMAGHFIR LII WA LAHU WA`A'QIBNII MINHU UQBAA HASANAH (Ya Allah, ampunilah aku dan ampunilah dia. Dan berilah ganti kematiannya itu bagiku dengan ganti yang lebih baik).'\" maka saya pun membacanya, sehingga Allah menggantikan dengan yang lebih baik darinya, yaitu Muhammad shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2130,
			"arabicnumber": "920.01",
			"text": "Telah menceritakan kepadaku [Zuhair bin Harb] telah menceritakan kepada kami [Mua'wiyah bin Amru] telah menceritakan kepada kami [Abu Ishaq Al Fazari] dari [Khalid Al Hadzdza`] dari [Abu Qilabah] dari [Qabishah bin Dzu`aib] dari [Ummu Salamah] ia berkata; Ketika Abu Salamah meninggal, Rasulullah shallallahu 'alaihi wasallam datang ke rumah kami untuk menjenguk jenazahnya. Saat itu, mata Abu Salamah tengah terbeliak, maka beliau pun menutupnya. Kemudian beliau bersabda: \"Apabila ruh telah dicabut, maka penglihatan akan mengikutinya dan keluarganya pun meratap hiteris. Dan janganlah sekali-kali mendo'akan atas diri kalian kecuali kebaikan, sebab ketika itu malaikat akan mengaminkan apa yang kalian ucapkan.\" Setelah itu, beliau berdo'a: \"ALLAHUMMAGHFIR LIABI SALAMAH WARFA' DARAJATAHU FIL MAHDIYYIIN WAKHLUFHU FI 'AQIBIHI FIL GHAABIRIIN, WAGHFIR LANAA WALAHU YAA RABBAL 'ALAMIIN, WAFSAH LAHU FII QABRIHI WA NAWWIR LAHU FIIHI (Ya Allah, ampunilah Abu Salamah, tinggikan derajatnya di kalangan orang-orang yang terpimpin dengan petunjuk-Mu dan gantilah ia bagi keluarganya yang ditinggalkannya. Ampunilah kami dan ampunilah dia. Wahai Rabb semesta alam. Lapangkanlah kuburnya dan terangilah dia di dalam kuburnya).\" Dan telah menceritakan kepada kami [Muhammad bin Musa Al Qaththan Al Wasithi] telah menceritakan kepada kami [Al Mutsanna bin Mu'adz] telah menceritakan kepada kami [bapakku] telah menceritakan kepada kami [Ubaidullah bin Al Hasan] telah menceritakan kepada kami [Khalid Al Hadzdza`] dengan Isnad ini dan serupa dengannya. Hanya saja, ia mengatakan; \"Dan gantikanlah ia bagi keluarganya.\" Ia juga mengatakan; \"Ya Allah, lapangkanlah kuburannya.\" Dan ia tidak mengatakan; \"IFSAH LAHU (lapangkanlah baginya).\" Dan ia menambahkan lagi; Khalid Al Hadzdza` berkata; \"Dan do'a lain yang ketujuh saya lupa",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2131,
			"arabicnumber": "920.02",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2132,
			"arabicnumber": "921.01",
			"text": "Telah menceritakan kepada kami [Muhammad bin Rafi'] telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ibnu Juraij] dari [Al 'Ala` bin Ya'qub] ia berkata, telah mengabarkan kepadaku [bapakku] bahwa ia mendengar [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bukankah kalian telah menyaksikan bahwa jika seseorang meninggal dunia matanya akan terbelalak?\" Para sahabat menjawab, \"Ya, kami telah menyaksikan.\" Beliau bersabda: \"Itu terjadi sa'at pandangan matanya mengikuti ruhnya (yang keluar dari jasad-pent).\" Dan telah menceritakannya kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Abdul Aziz Ad Darawardi] dari [Al Ala`] dengan isnad ini",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2133,
			"arabicnumber": "921.02",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2134,
			"arabicnumber": "922",
			"text": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Ibnu Numair] dan [Ishaq bin Ibrahim] semuanya dari [Ibnu Uyainah] - [Ibnu Numair] berkata- telah menceritakan kepada kami [Sufyan] dari [Ibnu Abu Najih] dari [bapaknya] dari [Ubaid bin Umair] ia berkata; [Ummu Salamah] berkata; Ketika Abu Salamah meninggal dunia, saya pun berkata, \"Orang asing, meninggal pula di negeri asing. Akan kuratapi dia sepuas-puasnya sehingga menjadi buah bibir orang.\" Ketika aku bersiap-siap hendak meratapinya, tiba-tiba datang seorang perempuan dari dusun menawarkan diri hendak menolongku meratap. Lalu Rasulullah shallallahu 'alaihi wasallam mendatanginya seraya bersabda: \"Apakah kamu hendak memasukkan syetan lagi ke dalam rumah ini, yang mana Allah telah mengeluarkannya dari sini?\" beliau mengulanginya hingga dua kali. Maka mendengar sabda beliau itu, akhirnya aku menahan diri dan tidak jadi meratap",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2135,
			"arabicnumber": "923.01",
			"text": "Telah menceritakan kepada kami [Abu Kamil Al Jahdari] telah menceritakan kepada kami [Hammad bin Zaid] dari [Ashim Al Ahwali] dari [Abu Utsman An Nahdi] dari [Usamah bin Zaid] ia berkata; Pada suatu hari ketika kami sedang berada di dekat Nabi shallallahu 'alaihi wasallam, tiba-tiba datang seorang suruhan dari puteri Nabi shallallahu 'alaihi wasallam (Zainab binti Muhammad), meminta agar Nabi shallallahu 'alaihi wasallam datang dan mengabarkan kepada beliau bahwa anak puteranya (cucu Nabi shallallahu 'alaihi wasallam) telah meninggal. Rasulullah shallallahu 'alaihi wasallam pun berpesan pada suruhan itu: \"Pulang dan sampaikanlah kepada Zainab, bahwa kepunyaan Allah jualah yang telah diambil dan kepunyaan-Nya pula yang telah diberikan. Segala sesuatu telah Allah tentukan ajalnya. Karena itu, suruhlah ia bersabar dan menahan diri.\" Tidak lama kemudian, pesuruh itu datang kembali dan berkata, \"Zainab sangat mengharapkan, sekiranya Rasulullah shallallahu 'alaihi wasallam sudi menjenguknya.\" Maka berangkatlah beliau bersama para sahabatnya antara lain, Sa'ad bin Ubadah, Mu'adz bin Jabar dan aku sendiri. Sesampainya di sana, diserahkanlah anak yang telah meninggal itu pada beliau, tiba-tiba nafas beliau terengah-engah seperti sedang kepayahan dan air matanya pun menetes. Lalu Sa'ad pun bertanya, \"Ada apa wahai Rasulullah?\" beliau menjawab: \"Ini adalah rahmah (kasih sayang) yang telah dijadikan Allah dalam hati para hamba-Nya. Sesungguhnya hamba Allah yang dirahmati oleh-Nya hanyalah orang yang memiliki kasih sayang.\" Dan telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] telah menceritakan kepada kami [Ibnu Fudlail] -dalam jalur lain- Dan telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abu Mu'awiyah] semuanya dari [Ashim Al Ahwal] dengan isnad ini, hanya saja hadits Hammad lebih lengkap dan panjang",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2136,
			"arabicnumber": "923.02",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2137,
			"arabicnumber": "924",
			"text": "Telah menceritakan kepada kami [Yunus bin Abdul A'la Ash Shadafi] dan [Amru bin Sawwad Al Amiri] keduanya berkata, telah mengabarkan kepada kami [Abdullah bin Wahb] telah mengabarkan kepadaku [Amru bin Harits] dari [Sa'd bin Al Harits Al Anshari] dari [Abdullah bin Umar] ia berkata; Sa'ad bin Ubadah pernah mengeluhkan rasa sakit yang dideritanya, sehingga Rasulullah shallallahu 'alaihi wasallam bersama Abdur Rahman bin 'Auf, Sa'ad bin Abi Waqqash, dan Abdullah bin Mas'ud menjenguknya. Ketika beliau hendak masuk ternyata ia sedang dikerumuni keluarganya, maka beliau pun bertanya: \"Apakah ia telah meninggal dunia?\" Para sahabat menjawab, \"Belum wahai Rasulullah.\" Maka Rasulullah shallallahu 'alaihi wasallam meneteskan air mata. Melihat beliau menangis, para sahabatpun ikut menangis. Lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dengarkanlah oleh kalian, sesungguhnya Allah tidak mengadzab seseorang karena disebabkan tangisan atau perasaan sedih (dari orang yang ditinggalkannya) akan tetapi Dia mengadzab karena disebabkan oleh ini (beliau memberi isyarat pada lisannya), atau Dia akan mengasihinya",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2138,
			"arabicnumber": "925",
			"text": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna Al 'Anazi] telah menceritakan kepada kami [Muhammad bin Jahdlam] Telah menceritakan kepada kami [Isma'i bin Ja'far] dari [Umarah, anak Ghaziyyah] dari [Sa'id bin Al Harits Al Mu'alla] dari [Abdullah bin Umar] bahwa ia berkata; Ketika kami sedang duduk-duduk bersama Rasulullah shallallahu 'alaihi wasallam, tiba-tiba datang seorang sahabat Anshor menghampiri dan memberi salam kepada beliau. Kemudian ketika sahabat Anshar itu hendak pergi, Rasulullah shallallahu 'alaihi wasallam bertanya kepadanya: \"Wahai saudaraku dari kaum anshor, bagaimana keadaan saudaraku Sa'ad bin Ubadah?\" \"Ia baik-baik saja.\" jawabnya. Lalu Rasulullah shallallahu 'alaihi wasallam menawarkan: \"Siapakah di antara kalian yang mau menjenguknya?\" Kemudian beliau berdiri dan kamipun juga berdiri bersama beliau, dan ketika itu kami berjumlah belasan orang, kami tidak memakai sandal, sepatu, peci dan juga gamis. Kami berjalan di atas tanah yang gembur hingga kami sampai pada tempatnya, kemudian ia meminta orang yang sedang mengelilinginya untuk mundur agar Rasulullah shallallahu 'alaihi wasallam beserta para sahabat yang bersama beliau saat itu bisa mendekat padanya",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2139,
			"arabicnumber": "926.01",
			"text": "Telah menceritakan kepada kami [Muhammad bin Basysyar Al Abdi] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Tsabit] ia berkata, saya mendengar [Anas bin Malik] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya kesabaran itu letaknya pada goncangan yang pertama",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2140,
			"arabicnumber": "926.02",
			"text": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Utsman bin Umar] telah mengabarkan kepada kami [Syu'bah] dari [Tsabit Al Bunani] dari [Anas bin Malik] bahwa Rasulullah shallallahu 'alaihi wasallam mendatangi seorang wanita yang sedang menangisi bayinya yang telah meninggal. Lalu beliau bersabda kepadanya: \"Bertakwalah kepada Allah dan bersabarlah.\" Wanita itu menjawab, \"Anda tidak merasakan bagaimana pedihnya musibah yang aku derita ini.\" Setelah beliau berlalu, dikatakanlah kepada wanita itu bahwa yang berbicara kepadanya itu adalah Rasulullah shallallahu 'alaihi wasallam. Mendengar hal itu, wanita itu (setengah mati ketakutan), lalu dia pergi menemui Rasulullah shallallahu 'alaihi wasallam dan didapatinya rumah beliau tidak dikawal, lalu ia masuk dan berkata, \"Tadi aku tidak mengenal Anda wahai Rasulullah, (maafkanlah aku).\" Beliau bersabda: \"Sesungguhnya kesabaran yang sebenarnya adalah pada goncangan yang pertama.\" Dan telah menceritakannya kepada kami [Yahya bin Habib Al Haritsi] telah menceritakan kepada kami [Khalid bin Harits] -dalam jalur lain- dan telah menceritakan kepada kami [Uqbah bin Mukram Al Ammi] telah menceritakan kepada kami [Abdul Malik bin Amru] -dalam jalur lain- Dan telah menceritakan kepadaku [Ahmad bin Ibrahim Ad Dauraqi] telah menceritakan kepada kami [Abdush Shamad] mereka berkata, telah menceritakan kepada kami [Syu'bah] dengan Isnad ini dan serupa dengan hadits Utsman bin Umar serta kisahnya. Dan dalam hadits Abdush Shamad; Nabi shallallahu 'alaihi wasallam melewati seorang wanita di sisi kuburan",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2141,
			"arabicnumber": "926.03",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2142,
			"arabicnumber": "927.01",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2143,
			"arabicnumber": "927.02",
			"text": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Muhammad bin Ja'far] Telah menceritakan kepada kami [Syu'bah] ia berkata, saya mendengar [Qatadah] menceritakan dari [Sa'id bin Al Musayyab] dari [Ibnu Umar] dari [Umar] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Mayit itu akan disiksa di dalam kuburnya, lantara ratapan yang ditujukan atasnya",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2144,
			"arabicnumber": "927.03",
			"text": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Ibnu Abu Adi] dari [Sa'id] dari [Qatadah] dari [Sa'id bin Al Musayyab] dari [Ibnu Umar] dari [Umar] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Mayit itu akan disiksa di dalam kuburnya, lantara ratapan yang ditujukan atasnya",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2145,
			"arabicnumber": "927.04",
			"text": "Telah menceritakan kepadaku [Ali bin Hujr As Sa'di] telah menceritakan kepada kami [Ali bin Mushir] dari [Al A'masy] dari [Abu Shalih] dari [Ibnu Umar] ia berkata; Ketika khalifah [Umar] ditikam orang, beliau jatuh pingsan dan orang-orang pun meratapinya. Setelah siuman, Umar berkata, \"Tidakkah kalian tahu bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: 'Sesungguhnya mayit itu benar-benar akan disiksa lantara tangisan mereka yang hidup",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2146,
			"arabicnumber": "927.05",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2147,
			"arabicnumber": "927.06",
			"text": "Telah menceritakan kepadaku [Ali bin Hujr] telah mengabarkan kepada kami [Syu'aib bin Shafwan Abu Yahya] dari [Abdul Malik bin Umair] dari [Abu Burdah Abu Musa] dari [Abu Musa] ia berkata; Ketika khalifah [Umar] dapat musibah (ditikam orang) Shuhaib datang ke rumahnya. Sesampainya disana, ia berdiri di dekat Umar sambil menangis. Maka Umar pun bertanya, \"Kenapa kamu menangis, apakah kamu menangisiku?\" Shuhaib menjawab, \"Ya, demi Allah, aku menangisi Anda wahai Amirul mukminin.\" Umar berkata, \"Demi Allah, aku ingat bahwa Rasulullah shallallahu 'alaihi wasallam pernah bersabda: 'Siapa yang ditangisi, maka ia akan disiksa.'\" Maka saya pun menuturkan hal itu kepada Musa bin Thalhah, ia pun berkata, \"Aisyah berkata; Bahwa hal itu hanya akan terjadi pada orang-orang Yahudi",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2148,
			"arabicnumber": "927.07",
			"text": "Dan telah menceritakan kepadaku [Amru An Naqid] telah menceritakan kepada kami ['Affan bin Muslim] telah menceritakan kepada kami [Hammad bin Salamah] dari [Tsabit] dari [Anas] bahwa ketika [Umar] ditikam, maka Hafshah pun menangisinya dengan suara yang keras, maka seketika itu Umar berkata, \"Wahai Hafshah, tidakkah kamu mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: 'Orang yang ditangisi, akan disiksa.'\" Kemudian Shuhaib pun ikut menangis dengan mengangkat suara, maka Umar berkata, \"Wahai Shuhaib, tidakkah kamu tahu bahwa orang yang ditangisi akan diadzab?",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2151,
			"arabicnumber": "929.03",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2152,
			"arabicnumber": "930",
			"text": "Telah menceritakan kepadaku [Harmalah bin Yahya] telah menceritakan kepada kami [Abdullah bin Wahb] telah menceritakan kepadaku [Umar bin Muhammad] bahwa [Salim] telah menceritakannya dari [Abdullah bin Umar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya mayit itu akan disiksa karena tangisan mereka yang masih hidup",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2153,
			"arabicnumber": "931",
			"text": "Telah menceritakan kepada kami [Khalaf bin Hisyam] dan [Abu Rabi' Az Zahrani] semua dari [Hammad] - [Khalaf] berkata- telah menceritakan kepada kami [Hammad bin Zaid] dari [Hisyam bin Urwah] dari [bapaknya] ia berkata; Pernah dituturkan di sisi Aisyah tentang ungkapan Umar bahwa mayit itu akan disiksa lantaran tangisan keluarga atasnya, maka [Aisyah] pun berkata, \"Semoga Allah merahmati Abu Abdurrahman, ia telah mendengar (hadits Rasulullah shallallahu 'alaihi wasallam), tetapi ia belum menghafalnya (dengan baik). Peristiwanya begini; Suatu ketika lewat di hadapan Nabi shallallahu 'alaihi wasallam jenazah seorang Yahudi dan ditangisi keluarganya. Maka Nabi shallallahu 'alaihi wasallam bersabda: 'Kalian menangisinya, sementara ia benar-benar disiksa (karena tangisan kalian)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2154,
			"arabicnumber": "932.01",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2155,
			"arabicnumber": "932.02",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2156,
			"arabicnumber": "932.03",
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] dari [Malik bin Anas] -terkait dengan hadits yang telah dibacakan kepadanya- dari [Abdullah bin Abu Bakar] dari [bapaknya] dari [Amrah binti Abdurrahman] bahwa ia telah mengabarkan kepadanya bahwa ia telah mendengar [Aisyah] dan telah dituturkan kepadanya bahwa Ibnu Umar berkata, \"Sesungguhnya mayit itu benar-benar akan disiksa lantaran tangisan mereka yang masih hidup.\" Maka Aisyah pun berkata, \"Semoga Allah mengampuni Abu Abdurrahman, sesungguhnya ia tidaklah berdusta, namun ia telah lupa atau salah. Peristiwa sebenarnya adalah; suatu ketika Rasulullah shallallahu 'alaihi wasallam melewati jenazah wanita Yahudi dan ditangisi, maka beliau pun bersabda: 'Mereka benar-benar menangisinya, dan mayit itu benar-benar akan disiksa di dalam kuburnya",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2157,
			"arabicnumber": "933.01",
			"text": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Waki'] dari [Sa'id bin Ubaid Ath Tha`i] dan [Muhammad bin Qais] dari [Ali bin Rabi'ah] ia berkata; Orang yang pertama kali diratapi di Kufah adalah Qarazhah bin Ka'ab, maka [Al Mughirah bin Syu'bah] berkata; Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang meratapi mayit, maka mayit akan disiksa pada hari kiamat karena ratapan itu.\" Dan telah menceritakan kepadaku [Ali bin Hujr As Sa'di] telah menceritakan kepada kami [Ali bin Mushir] telah mengabarkan kepada kami [Muhammad bin Qais Al Asdi] dari [Ali bin Rabi'ah Al Asdi] dari [Al Mughirah bin Syu'bah] dari Nabi shallallahu 'alaihi wasallam semisalnya. Dan telah menceritakannya kepada kami [Ibnu Abu Umar] telah menceritakan kepada kami [Marwan Al Fazari] telah menceritakan kepada kami [Sa'id bin Ubaid Ath Tha`i] dari [Ali bin Rabi'ah] dari [Al Mughirah bin Syu'bah] dari Nabi shallallahu 'alaihi wasallam semisalnya",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2158,
			"arabicnumber": "933.02",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2159,
			"arabicnumber": "933.03",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2160,
			"arabicnumber": "934",
			"text": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Aban bin Yazid] -dalam jalur lain- Dan telah menceritakan kepadaku [Ishaq bin Manshur] -dan lafazh juga miliknya- telah mengabarkan kepada kami [Habban bin Hilal] telah menceritakan kepada kami [Aban] telah menceritakan kepada kami [Yahya] bahwa [Zaid] telah menceritakan kepadanya bawah [Abu Sallam] telah menceritakan kepadanya bahwa [Abu Malik Al Asy'ari] telah menceritakan kepadanya bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Ada empat perkara jahiliyah yang masih melekat pada umatku dan mereka belum meninggalkannya: Membanggakan kedudukan, mencela nasab (garis keturunan), meminta hujan dengan bintang-bintang, dan niyahah (meratapi mayit).\" Dan beliau bersabda: \"Orang yang meratapi mayit, jika ia belum bertaubat sebelum ajalnya tiba maka pada hari kiamat ia akan dibangkitkan dengan memakai baju panjang yang berwarna hitam dan memakai tameng dari pedang yang sudah karatan",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2161,
			"arabicnumber": "935.01",
			"text": "Telah menceritakan kepada kami [Ibnul Mutsanna] dan [Ibnu Abu Umar] - [Ibnul Mutsanna] berkata- telah menceritakan kepada kami [Abdul Wahhab] ia berkata, saya mendengar [Yahya bin Sa'id] berkata, telah mengabarkan kepadaku [Amrah] bahwa ia telah mendengar [Aisyah] berkata; Ketika berita mengenai tewasnya Ibnu Haritsah dan Ja'far bin Abi Thalib, dan Abdullah bin Rawahah sampai kepada Rasulullah shallallahu 'alaihi wasallam, beliau duduk dan terlihat tanda kesedihan di wajah beliau. Kata 'Aisyah selanjutnya; Aku melihat dari celah-celah pintu, seorang laki-laki datang kepada beliau seraya berkata, \"Wahai Rasulullah, isteri Ja'far menangis.\" Rasulullah shallallahu 'alaihi wasallam menyuruh orang itu agar mendiamkannya. Lalu orang itu pergi. Tidak berapa lama kemudian orang itu datang kembali dan mengatakan kepada beliau, bahwa mereka tidak mau didiamkan. Nabi shallallahu 'alaihi wasallam menyuruhnya pula kembali, namun tidak berapa lama, ia kembali lagi dan berkata, \"Demi Allah, mereka tidak mau didiamkan dan tidak mengindahkanku wahai Rasulullah.\" Aisyah mengira bahwa Rasulullah shallallahu 'alaihi wasallam menyuruh orang itu pergi dengan mengatakan: \"Pergilah! Dan sumpalkan tanah ke dalam mulutnya!\" Dan Aisyah pun berkata, \"Celaka kamu, Demi Allah, kamu belum melaksanakan dengan baik apa yang diperintahkan Rasulullah shallallahu 'alaihi wasallam kepadamu, sehingga kamu biarkan Rasulullah shallallahu 'alaihi wasallam dalam kesulitan.\" Dan telah menceritakannya kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abdullah bin Numair] -dalam jalur lain- Dan telah menceritakan kepadaku [Abu Thahir] telah mengabarkan kepada kami [Abdullah bin Wahb] dari [Mu'awiyah bin Shalih] -dalam jalur lain- telah menceritakan kepadaku [Ahmad bin Ibrahim Ad Dauraqi] telah menceritakan kepada kami [Abdush Shamad] Telah menceritakan kepada kami [Abdul Aziz bin Muslim] dari [Yahya bin Sa'id] dengan isnad ini semisalnya. Dan di dalam hadits Abdul Aziz; \"Dan kamu telah meninggalkan keletihan bagi Rasulullah shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2162,
			"arabicnumber": "935.02",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2163,
			"arabicnumber": "936.01",
			"text": "Telah menceritakan kepadaku [Abu Rabi' Az Zahrani] telah menceritakan kepada kami [Hammad] telah menceritakan kepada kami [Ayyub] dari [Muhammad] dari [Ummu 'Athiyyah] ia berkata; \"Rasulullah shallallahu 'alaihi wasallam telah membai'at kami untuk tidak melakukan Niyahah (meratapi mayit). Maka tidak seorang wanita pun dari kami yang wafat (lalu kami meratapinya) kecuali lima orang, yaitu Ummu Sulaim, Ummul 'Ala, putri Abu Sabrah isteri daripada Mu'adz atau anak perempuan Abu Sabrah dan isteri Mu'adz",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2164,
			"arabicnumber": "936.02",
			"text": "Telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Asbath] telah menceritakan kepada kami [Hisyam] dari [Hafshah] dari [Ummu 'Athiyah] ia berkata; \"Rasulullah shallallahu 'alaihi wasallam telah membai'at kami untuk tidak melakukan Niyahah (meratapi mayit). Maka tidak seorang wanita pun dari kami yang wafat (lalu kami meratapinya) kecuali lima orang, termasuk di antaranya adalah Ummu Sulaim",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2165,
			"arabicnumber": "937",
			"text": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Zuhair bin Harb] dan [Ishaq bin Ibrahim] semuanya dari [Abu Mu'awiyah] - [Zuhair] berkata- Telah menceritakan kepada kami [Muhammad bin Khazim] telah menceritakan kepada kami ['Ashim] dari [Hafshah] dari [Ummu 'Athiyyah] ia berkata; Ketika turun ayat ini, \"(Apabila datang kepadamu perempuan-perempuan yang beriman) untuk mengadakan janji setia, bahwa mereka tiada akan menyekutukan Allah, … dan tidak akan mendurhakaimu dalam urusan yang baik.\" Ummu 'Athyiyyah berkata; Termasuk di antaranya adalah An Niyahah (meratapi mayit). Saya berkata, \" Kecuali keluarga si Fulan, sesungguhnya mereka mengajakku untuk melakukan niyahah bersama mereka pada waktu jahiliyah, hingga saya terpaksa menyertai mereka melakukannya.\" Beliau bersabda: \"Kecuali keluarga si Fulan",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 2166,
			"arabicnumber": "938.01",
			"text": "Telah menceritakan kepada kami [Yahya bin Ayyub] telah menceritakan kepada kami [Ibnu 'Ulayyah] telah mengabarkan kepada kami [Ayyub] dari [Muhammad bin Sirin] ia berkata; [Ummu 'Athiyyah] berkata, \"Kami dilarang untuk turut mengiring jenazah, tetapi (larangn itu) tidak begitu ditekankan atas kami",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 2167,
			"arabicnumber": "938.02",
			"text": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abu Usamah] -dalam jalur lain- Dan telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Isa bin Yunus] keduanya dari [Hisyam] dari [Hafshah] dari [Ummu 'Athiyyah] ia berkata; \"Kami dilarang untuk turut mengiring jenazah, tetapi (larangan itu) tidak begitu ditekankan atas kami",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 2168,
			"arabicnumber": "939.01",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Yazid bin Zurai'] dari [Ayyub] dari [Muhammad bin Sirin] dari [Ummu 'Athiyyah] ia berkata; Rasulullah shallallahu 'alaihi wasallam masuk menemui kami yang sedang memandikan putrinya. Kemudian beliau pun bersabda: \"Mandikanlah ia sebanyak tiga atau lima kali, atau pun lebih dari itu. Setelah itu, gunakanlah adukan air dan daun bidara. Sedangkan untuk siraman terakhir, gunakanlah kapur barus, atau sejenis kapur barus. Setelah selesai, beritahukanlah padaku.\" Setelah selesai memandikan, kami pun memberitahukan kepada beliau, dan beliau langsung memberikan kainnya pada kami dan bersabda: \"Kenakanlah pada bagian bawah badannya.\" Dan telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Yazid bin Zurai'] dari [Ayyub] dari [Muhammad bin Sirin] dari [Hafshah binti Sirin] dari [Ummu 'Athiyyah] ia berkata, \"Kami memintal rambutnya menjadi tiga.\" Dan telah menceritakan kepada kami [Qutaibah bin Sa'id] dari [Malik bin Anas] -dalam jalur lain- Telah menceritakan kepada kami [Abu Rabi' Az Zahrani] dan [Qutaibah bin Sa'id] keduanya berkata, telah menceritakan kepada kami [Hammad] -dalam jalur lain- Dan telah menceritakan kepada kami [Yahya bin Ayyub] telah menceritakan kepada kami [Ibnu Ulayyah] semuanya dari [Ayyub] dari [Muhammad] dari [Ummu 'Athiyyah] ia berkata; \"Salah seorang putri Rasulullah shallallahu 'alaihi wasallam meninggal.\" Sementara di dalam hadits Ibnu Ulayyah; Rasulullah shallallahu 'alaihi wasallam datang menemui kami yang sedang memandikan mayit putrinya. Sedangkan di dalam haditsnya Malik; Rasulullah shallallahu 'alaihi wasallam masuk menemui kami saat anak putrinya meninggal. Serupa dengan hadits Yazid bin Zurai' dari Ayyub dari Muhamamd dari Ummu 'Atyiyyah. Dan menceritakan kepada kami [Qutaibah bin Sa'id] menceritakan kepada kami [Hammad] dari [Ayyub] dari [Hafshah] dari [Ummu Athiyyah] dengan hadits yang semisal, hanyasaja ia mengatakan 'tiga kali atau lima kali atau tujuh kali atau lebih banyak dari itu. Maka Hafshah berkata dari Ummu 'Athiyah, \"Dan kami memintal rambutnya menjadi tiga",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 2169,
			"arabicnumber": "939.02",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 2170,
			"arabicnumber": "939.03",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 2171,
			"arabicnumber": "939.04",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 2172,
			"arabicnumber": "939.05",
			"text": "Telah menceritakan kepada kami [Yahya bin Ayyub] telah menceritakan kepada kami [Ibnu Ulayyah] dan telah mengabarkan kepada kami [Ayyub] ia berkata, dan telah berkata [Hafshah] dari [Ummu 'Athiyyah] ia berkata; \"Mandikanlah ia (puteri Rasulullah shallallahu 'alaihi wasallam) dengan bilangan ganjil, yakni tiga, lima atau tujuh kali.\" Ummu 'Atyhiyyah juga berkata, \"Dan kami memintal rambutnya menjadi tiga pintalan",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 2173,
			"arabicnumber": "939.06",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 2174,
			"arabicnumber": "939.07",
			"text": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Amru An Naqid] semuanya dari [Abu Mu'awiyah] - [Amru] berkata- Telah menceritakan kepada kami [Muhammad bin Khazim Abu Mu'awiyah] Telah menceritakan kepada kami [Ashim Al Ahwal] dari [Hafshah binti Sirin] dari [Ummu 'Athiyyah] ia berkata; Ketika Zainad binti Rasulullah shallallahu 'alaihi wasallam wafat, Rasulullah shallallahu 'alaihi wasallam bersabda kepada kami, \"Mandikanlah ia dengan bilangan ganjil, tiga, lima atau tujuh. Dan pada bilangan ke lima, campurkanlah dengan kapur barus atau sesuatu dari jenis kapur barus. Dan jika kalian telah usai memandikannya, maka beritahukanlah padaku.\" Ummu 'Athiyyah berkata, \"Setelah itu, kami memberitahukan kepada beliau, sehingga beliau pun memberikan kainnya dan beliau bersabda: 'Kenakan padanya.'\" Dan telah menceritakan kepada kami [Amru An Naqid] telah menceritakan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Hisyam bin Hassan] dari [Hafshah binti Sirin] dari [Ummu 'Athiyyah] ia berkata; Rasulullah shallallahu 'alaihi wasallam menemui kami, sementara kami sedang memandikan salah seorang putinya. Beliau bersabda: \"Mandikanlah ia dengan bilangan yang ganjil, lima atau lebih dari itu.\" yakni serupa dengan hadits Ayyub dan 'Ashim. Kemudian di dalam hadits ia mengatakan; \"Lalu kami memintal rambutnya dengan tiga pintalan, yakni pada kedua tanduknya dan satu pada ubun-ubunnya",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 2175,
			"arabicnumber": "939.08",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Husyaim] dari [Khalid] dari [Hafshah binti Sirin] dari [Ummu 'Athiyyah] bahwa ketika Rasulullah shallallahu 'alaihi wasallam memerintahkannya untuk memandikan jenazah putrinya, beliau bersabda: \"Mandikanlah mulai dari sebelah kanannya dan (dahulukan) anggota wudlunya",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 2176,
			"arabicnumber": "939.09",
			"text": "Telah menceritakan kepada kami [Yahya bin Ayyub] dan [Abu Bakar bin Abu Syaibah] dan [Amru An Naqid] semuanya dari [Ibnu Ulayyah] - [Abu Bakr] berkata- telah menceritakan kepada kami [Isma'il bin Ulayyah] dari [Khalid] dari [Hafshah] dari [Ummu 'Athiyyah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda kepada mereka (ketika hendak memandikan jenazah putrinya): \"Mulailah dari sebelah kanannya dan (dahulukanlah) anggota wudlunya",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 2177,
			"arabicnumber": "940.01",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya At Tamimi] dan [Abu Bakar bin Abu Syaibah] dan [Muhammad bin Abdullah bin Numair] dan [Abu Kuraib] -lafazhnya milik Yahya- Yahya berkata, telah mengabarkan kepada kami -sementara yang lain berkata- Telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Syaqiq] dari [Khabbab bin Al Arat] ia berkata; Kami berhijrah di jalan Allah bersama Rasulullah shallallahu 'alaihi wasallam hanya untuk menggapai wajah Allah, maka Allah akan memberikan ganjarannya kepada kami (termasuk di antara adalah harta ghanimah). Namun di antara kami ada yang belum pernah mencicipi ganjarannya sedikitpun, salah satunya adalah Mush'ab bin Umair, karena ia terbunuh pada saat perang Uhud. Saat itu, tidak ada sesuatu pun untuk mengkafaninya kecuali sehelai kain burdah, yang apabila kami letakkan di atas kepalanya, maka kedua kakinya akan tampak, namun jika kami meletakkannya di atas kedua kakinya, maka kepalanya akan tampak. Maka Rasulullah shallallahu 'alaihi wasallam pun bersabda: \"Letakkanlah tepat di bawah lehernya, dan letakkan Idzkhir (sejenis tumbuh-tumbuhan) di atas kedua kakinya.\" Maka di antara kami ada yang buah-buahannya telah masak dan ia memetiknya. Dan Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Jarir] -dalam jalur lain- Dan telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Isa bin Yunus] -dalam jalur lain- Dan telah menceritakan kepada kami [Minjab bin Harits At Tamimi] telah mengabarkan kepada kami [Ali bin Mushir] -dalam jalur lain- dan Telah menceritakan kepada kami [Ishaq bin Ibrahim] dan [Ibnu Abu Umar] semuanya dari [Ibnu Uyainah] dari [Al A'masy] dengan isnad ini semisalnya",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 2178,
			"arabicnumber": "940.02",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 2179,
			"arabicnumber": "941.01",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya] dan [Abu Bakar bin Abu Syaibah] dan [Abu Kuraib] -sedangkan lafazhnya dari Yahya- [Yahya] berkata, telah mengabarkan kepada kami -sementara dua orang yang lain berkata- Telah menceritakan kepada kami [Abu Mu'awiyah] dari [Hisyam bin Urwah] dari [bapaknya] dari [Aisyah] ia berkata; Rasulullah shallallahu 'alaihi wasallam dikafani dengan tiga helai kain berwarna putih, lembut dan terbuat dari kursuf (katun), tidak ada baju di dalamnya dan tidak juga serban. Sedangkan tentang Al Hullah (kain dari Yaman) membengingkan para sahabat, padahal telah dibeli untuk digunakan sebagai kain kafan beliau, maka hullah itu pun tidak digunakan. Beliau dikafankan dengan tiga helai kain putih yang lembut. Kemudian Abdullah bin Abu Bakar mengambil Hullah tersebut dan berkata, \"Aku akan menyimpannya hingga aku mengkafani diriku dengan kain ini.\" kemudian ia berkata lagi, \"Jika Allah meridlai Nabi-Nya, tentu beliau akan dikafani dengan kain ini.\" Akhirnya, ia pun menjualnya dan menyedekahkan uangnya",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 2180,
			"arabicnumber": "941.02",
			"text": "Telah menceritakan kepadaku [Ali bin Hujr As Sa'di] telah mengabarkan kepada kami [Ali bin Mushir] Telah menceritakan kepada kami [Hisyam bin Urwah] dari [bapaknya] dari [Aisyah] ia berkata; Rasulullah shallallahu 'alaihi wasallam dimasukkan ke dalam Hullah Yamaniyyah (kain pakaian dari Yaman) milik Abdullah bin Abu Bakr. Kemudian kain itu dilepaskan darinya, lalu beliau dikafani dengan tiga helai kain putih yang terbuat dari kapas Yamani dan di dalamnya tidak ada surban, tidak pula baju. Maka Abdullah pun mengangkat Hullah Yamaniyyah itu seraya berkata, \"Aku ingin mengkafani diriku dengannya, \" Kemudian ia berkata, \"Rasulullah shallallahu 'alaihi wasallam saja tidak dikafani dengannya, pantaskah diriku akan dikafani dengannya?.\" Maka ia pun menyedekahkannya. Dan telah menceritakannya kepada kami [Abu Bakar bin Abu Syaibah] Telah menceritakan kepada kami [Hafsh bin Ghiyats] dan [Ibnu Uyainah] dan [Ibnu Idris] dan [Abdah] dan [Waki'] -dalam jalur lain- Dan telah menceritakannya kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Abdul Aziz bin Muhammad] semuanya dari [Hisyam] dengan isnad ini, dan di dalam hadits mereka tidak tercantum kisah Abdullah bin Abu Bakar",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 2181,
			"arabicnumber": "941.03",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 2182,
			"arabicnumber": "941.04",
			"text": "Telah menceritakan kepadaku [Ibnu Abu Umar] telah menceritakan kepada kami [Abdul Aziz] dari [Yazid] dari [Muhammad bin Ibrahim] dari [Abu Salamah] bahwa ia berkata; Saya bertanya kepada [Aisyah] isteri Nabi shallallahu 'alaihi wasallam, saya berkata kepadanya, \"Rasulullah shallallahu 'alaihi wasallam dikafani dengan berapa helai kain?\" Aisyah menjawab, \"(Beliau dikafani) dengan tiga helai kain putih",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 2183,
			"arabicnumber": "942.01",
			"text": "Telah menceritakan kepada kami [Zuhair bin Harb] dan [Hasan Al Hulwani] dan [Abdu bin Humaid] -Abdu berkata- telah mengabarkan kepadaku -dan dua orang yang lain berkata- telah menceritakan kepada kami [Ya'qub bin Ibrahim bin Sa'd] telah menceritakan kepada kami [bapakku] dari [Shalih] dari [Ibnu Syihab] bahwa [Abu Salamah bin Abdurrahman] telah mengabarkan kepadanya, bahwa [Aisyah] Ummul Mukminin berkata, \"Saat meninggal, Rasulullah shallallahu 'alaihi wasallam ditutupi dengan kain Hibarah (yang terbuat dari kapas).\" Dan telah menceritakannya kepada kami [Ishaq bin Ibrahim] dan [Abdu bin Humaid] keduanya berkata, telah mengabarkan kepada kami [Abdurrazaq] ia berkata, telah mengabarkan kepada kami [Ma'mar] -dalam jalur lain- Dan telah menceritakan kepada kami [Abdullah bin Abdurrahman Ad Darimi] telah mengabarkan kepada kami [Abul Yaman] telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] dengan isnad ini, dan dengan hadits yang serupa",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 2184,
			"arabicnumber": "942.02",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 2185,
			"arabicnumber": "943",
			"text": "Telah menceritakan kepada kami [Harun bin Abdullah] dan [Hajjaj bin Asy Sya'ir] keduanya berkata, telah menceritakan kepada kami [Hajjaj bin Muhammad] ia berkata, [Ibnu Juraij] berkata, telah mengabarkan kepadaku [Abu Zubair] bahwa ia mendengar [Jabir bin Abdullah] menceritakan bahwa pada suatu hari Nabi shallallahu 'alaihi wasallam berkhutbah lalu menyebutkan kisah tentang salah seorang sahabatnya yang meninggal dan dikafani dengan kain yang tidak menutupi seluruh badannya, kemudian dimakamkan di malam hari. Rasulullah shallallahu 'alaihi wasallam melarang untuk menguburkannya di malam hari sampai dishalatkan, kecuali jika keadaannya sangat terpaksa, lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian mengkafani saudaranya, maka hendaknya ia memperbagus kafannya",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 2186,
			"arabicnumber": "944.01",
			"text": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Zuhair bin Harb] semuanya dari [Ibnu Uyainah] - [Abu Bakr] berkata- telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Az Zuhri] dari [Sa'id] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Segerakanlah penguburan jenazah, karena jika ia adalah seorang yang shalih (mungkin ia akan berkata) segeralah mengantarkannya pada kebaikan. Tetapi, jika ia tidak termasuk orang yang shalih, maka berarti kalian mempercepat meletakkan keburukan dari pundak-pundak kalian.\" Dan telah menceritakan kepadaku [Muhammad bin Rafi'] dan [Abdu bin Humaid] semuanya dari [Abdurrazaq] telah mengabarkan kepada kami [Ma'mar] -dalam jalur lain- Dan telah menceritakan kepada kami [Yahya bin Habib] telah menceritakan kepada kami [Rauh bin Ubadah] Telah menceritakan kepada kami [Muhammad bin Abu Hafshah] keduanya dari [Az Zuhri] dari [Sa'id] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam. Hanya saja di dalam hadits Ma'mar ia mengatakan; Saya tidak mengetahuinya, kecuali ia telah memarfu'kan hadits",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 2187,
			"arabicnumber": "944.02",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 2188,
			"arabicnumber": "944.03",
			"text": "Dan telah menceritakan kepadaku [Abu Thahir] dan [Harmalah bin Yahya] dan [Harun bin Sa'id Al Aili] -Harun berkata- telah menceritakan kepada kami -sementara dua orang yang lain berkata- telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus bin Yazid] dari [Ibnu Syihab] ia berkata, telah menceritakan kepadaku [Abu Umamah bin Sahl bin Hunaif] dari [Abu Hurairah] ia berkata; Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Segerakanlah penguburan jenazah, karena jika ia adalah seorang yang shalih, maka kalian telah mendekatkannya pada kebaikan. Tetapi, jika ia tidak termasuk orang yang shalih, maka berarti kalian mempercepat meletakkan keburukan dari pundak-pundak kalian",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 2189,
			"arabicnumber": "945.01",
			"text": "Telah menceritakan kepadaku [Abu Thahir] dan [Harmalah bin Yahya] dan [Harun bin Sa'id Al Aili] -dan lafazh milik Harun dan Harmalah, Harun berkata- telah menceritakan kepada kami -sementara dua orang yang lain berkata- telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] ia berkata, telah menceritakan kepadaku [Abdurrahman bin Hurmuz Al A'raj] bahwa [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapa yang turut menyaksikan pengurusan jenazah hingga ia menshalitinya, maka baginya pahala sebesar satu qirath. Sedangkan siapa yang turut menyaksikan pengurusannya hingga jenazah itu dimakamkan, maka baginya pahala sebesar dua qirath.\" Lalu ditanyakanlah, \"Apakah itu dua qirath?\" beliau menjawab: \"Seperti dua gunung yang besar.\" sampai disinilah haditsnya Abu Thahir. Kemudian dua orang itu menambahkan; Ibnu Syihab berkata, Salim bin Abdullah bin Umar berkata; Ibnu Umar pernah menshalati jenazah lalu ia bubar dan pergi. Dan ketika hadits Abu Hurairah sampai padanya, ia pun berkata, \"Sungguh, kita telah menyia-nyiakan banyak qirath.\" Dan telah menceritakannya kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abdul A'la] -dalam jalur lain- Dan Telah menceritakan kepada kami [Ibnu Rafi'] dan [Abdu bin Humaid] dari [Abdurrazaq] keduanya dari [Ma'mar] dari [Az Zuhri] dari [Sa'id bin Al Musayyab] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, hingga sampai pada; \"Seperti dua gunung yang besar.\" Dan ia tidak menyebutkan sesudahnya. Dan di dalam haditsnya Abdul A'la tercantum; \"Hingga pengurusan (jenazah itu) selesai.\" Sementara di dalam riwayat Abdurrazaq tercantum; \"Hingga (jenazah itu) diletakkan di dalam liang lahad.\" Dan telah menceritakan kepadaku [Abdul Malik bin Syu'aib bin Laits] telah menceritakan kepadaku [bapakku] dari [kakekku] ia berkata, telah menceritakan kepadaku [Uqail bin Khalid] dari [Ibnu Syihab] ia berkata, telah menceritakan kepadaku [seorang laki-laki] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, yakni seperti haditsnya Ma'mar. dan ia menyebutkan; \"Hingga (jenazah itu) dikebumikan",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 2190,
			"arabicnumber": "945.02",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 2191,
			"arabicnumber": "945.03",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 2192,
			"arabicnumber": "945.04",
			"text": "Dan telah menceritakan kepadaku [Muhammad bin Hatim] telah menceritakan kepada kami [Bahz] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepadaku [Suhail] dari [bapaknya] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa yang menshalatkan jenazah, namun ia tidak sampai ikut mengantarnya maka baginya pahala satu qirath. Dan jika ia turut mengantarnya, maka baginya pahala dua qirath.\" Kemudian ditanyakanlah, \"Seperti apakah dua qirath itu?\" beliau menjawab: \"Yang paling kecil di antaranya adalah seperti gunung uhud",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 2193,
			"arabicnumber": "945.05",
			"text": "Telah menceritakan kepada kami [Muhammad bin Hatim] telah menceritakan kepada kami [Yahya bin Sa'id] dari [Yazid bin Kaisan] telah menceritakan kepadaku [Abu Hazim] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa yang menshalatkan jenazah, maka baginya pahala satu qirath, dan siapa yang mengantarnya hingga jenazah itu di letakkan di liang kubur, maka baginya pahala dua qirath.\" Saya bertanya, \"Wahai Abu Hurairah, seperti apakah dua qirath itu?\" ia menjawab, \"Yaitu seperti gunung Uhud",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 2194,
			"arabicnumber": "945.06",
			"text": "Telah menceritakan kepada kami [Syaiban bin Farukh] telah menceritakan kepada kami [Jarir bin Hazim] telah menceritakan kepada kami [Nafi'] ia berkata; telah dikatakan kepada Ibnu Umar, bahwa [Abu Hurairah] berkata; Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapa yang mengikuti jenazah, maka baginya satu qirath pahala.\" Ibnu Umar berkata, \"Yang paling banyak (menceritakan hadits kepada kita) adalah Abu Hurairah.\" Lalu ia pun mengutus seseorang kepada Aisyah dan menanyakan hal itu padanya, maka [Aisyah] pun membenarkan Abu Hurairah. Maka Ibnu Umar pun berkata, \"Sungguh, kita telah melewatkan qirath yang banyak",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 2195,
			"arabicnumber": "945.07",
			"text": "Dan telah menceritakan kepadaku [Muhammad bin Abdullah bin Numair] Telah menceritakan kepada kami [Abdullah bin Yazid] telah menceritakan kepadaku [Haiwah] telah menceritakan kepadaku [Abu Shakhrah] dari [Yazid bin Abdullah bin Qusaith] bahwa ia telah menceritakan kepadanya bahwa [Dawud bin Amir bin Sa'd bin Abu Waqash] telah menceritakan kepadanya dari [bapaknya] bahwa suatu ketika ia pernah duduk di sisi Ibnu Umar, tiba-tiba datanglah khabbab pemilik maqshurah seraya berkata, \"Wahai Abdullah bin Umar, tidakkah Anda mendengar apa yang dikatakan oleh [Abu Hurairah], bahwa ia pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: 'Barangsiapa yang menghadiri jenazah, lalu ia menshalatkannya dan turut mengantarkannya hingga jenazah itu dikuburkan, maka baginya dua qrath pahala. Setiap qrath adalah seperti gunung Uhud. Dan siapa yang menshalatinya lalu ia langsung pulang, maka baginya adalah pahala seperti gunung Uhud.'\" Maka Ibnu Umar pun mengutus Khabbab kepada [Aisyah] untuk menanyakan ungkapan Abu Hurairah. Setelah itu, ia kembali untuk mengabarkan perihal komentar Aisyah. Setelah melihat ia kembali, Ibnu Umar langsung mengambil segenggam pasir yang terhampar di dalam Masjid, ia membolak-balikkannya di tangan hingga utusannya kembali. Sesampainya di situ, sang utusan pun berkata; Aisyah berkata, \"Abu Hurairah telah berkata benar.\" Maka seketika itu, Ibnu Umar pun langsung menghempaskan segenggam tanah di tangannya ke tanah, kemudian ia berkata, \"Sungguh, kita telah melewatkan qirath yang banyak",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 2196,
			"arabicnumber": "946.01",
			"text": "Dan telah menceritakan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Yahya, yaitu anaknya Sa'id] telah menceritakan kepada kami [Syu'bah] telah menceritakan kepadaku [Qatadah] dari [Salim bin Abul Ja'd] dari [Ma'dan bin Abu Thalhah Al Ya'mari] dari [Tsauban] maula Rasulullah shallallahu 'alaihi wasallam, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa menshalatkan jenazah, maka baginya satu qirath pahala. Dan bila turut menyaksikan pemakamannya, maka baginya dua qirath pahala. Sedangkan besar satu qirath seperti besarnya gunung Uhud.\" Dan telah menceritakan kepadaku [Muhammad bin Basysyar] Telah menceritakan kepada kami [Mu'adz bin Hisyam] telah menceritakan kepadaku [bapakku] ia berkata, dan telah menceritakan kepada kami [Ibnul Mutsanna] telah menceritakan kepada kami [Ibnu Abu Adi] dari [Sa'id] -dalam jalur lain- Dan telah menceritakan kepadaku [Zuhair bin Harb] telah menceritakan kepada kami ['Affan] Telah menceritakan kepada kami [Aban] semuanya dari [Qatadah] dengan isnad ini, hadits yang semisal dengannya. Dan di dalam hadits Sa'id dan Hisyam; Nabi shallallahu 'alaihi wasallam ditanya tentang qirath, maka beliau menjawab: \"(Yaitu) sebesar gunung Uhud",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 2197,
			"arabicnumber": "946.02",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 2198,
			"arabicnumber": "947",
			"text": "Telah menceritakan kepada kami [Al Hasan bin Isa] telah menceritakan kepada kami [Ibnul Mubarak] telah mengabarkan kepada kami [Sallam bin Abu Muthi'] dari [Ayyub] dari [Abu Qilabah] dari [Abdullah bin Yazid] saudara sesusuan Aisyah, dari [Aisyah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Mayat yang dishalatkan oleh kaum muslimin dengan jumlah melebihi seratus orang, dan semuanya mendo'akannya, maka do'a mereka untuknya akan dikabulkan.\" Lalu saya menceritakannya kepada [Syu'aib bin Habhab], maka ia pun berkata; [Anas bin Malik] telah menceritakannya kepadaku dari Nabi shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 2199,
			"arabicnumber": "948",
			"text": "Telah menceritakan kepada kami [Harun bin Ma'ruf] dan [Harun bin Sa'id Al Aili] dan [Al Walid bin Syuja' As Sakuni] -[Al Walid] berkata- telah menceritakan kepadaku -sementara dua orang yang lain berkata- telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Abu Shakhr] dari [Syarik bin Abdullah bin Abu Namir] dari [Kuraib] Maula Ibnu Abbas, dari [Ibnu Abbas] bahwa anaknya telah meninggal di kawasan Qudaid atau 'Usfan, maka ia pun berkata, \"Wahai Kuraib, lihatlah berapa orang yang berkumpul untuk menshalatkannya.\" Kuraib berkata; Maka aku pun keluar, ternyata orang-orang telah berkumpul untuk (menshalatkan) -nya. Lalu aku memberitahukannya kepada Ibnu Abbas, dan ia bertanya, \"Apakah jumlah mereka mencapai empat puluh orang?\" Kuraib menjawab, \"Ya.\" Kemudian Ibnu Abbas berkata, \"Keluarkanlah mayit itu, karena aku telah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: 'Tidaklah seorang muslim meninggal dunia, dan dishalatkan oleh lebih dari empat puluh orang, yang mana mereka tidak menyekutukan Allah, niscaya Allah akan mengabulkan do'a mereka untuknya.'\" Sementara di dalam riwayat Ibnu Ma'ruf adalah dari Syarik bin Abu Namir dari Kuraib dari Ibnu Abbas",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 2200,
			"arabicnumber": "949.01",
			"text": "Dan telah menceritakan kepada kami [Yahya bin Ayyub] dan [Abu Bakar bin Abu Syaibah] dan [Zuhair bin Harb] dan [Ali bin Hujr As Sa'di] semuanya dari [Ibnu Ulayyah] -sedangkan lafazhnya milik Yahya- telah mengabarkan kepada kami [Abdul Aziz bin Shuhaib] dari [Anas bin Malik] ia berkata; Suatu ketika iringan jenazah lewat di hadapan Rasulullah shallallahu 'alaihi wasallam, mayit itu dipuji dengan kebaikan, maka beliau pun bersabda: \"Telah wajib baginya, telah wajib baginya, telah wajib baginya.\" Kemudian lewatlah iringan jenazah lain di hadapan beliau, namun mayat itu dicaci dengan keburukan, maka Rasulullah shallallahu 'alaihi wasallam pun bersabda: \"Telah wajib baginya, telah wajib baginya, telah wajib baginya.\" Maka Umar berkata, \"Ibu dan ayahku menjadi tebusan bagimu, telah lewat iringan jenazah lalu mayit itu dipuji dengan kebaikan kemudian Anda mengatakan: 'Telah wajib baginya, telah wajib baginya, telah wajib baginya.' Setelah itu, lewatlah jenazah lain, dan mayit itu dicaci dengan keburukan lalu Anda pun mengatakan: 'Telah wajib baginya, telah wajib baginya, telah wajib baginya.'\" Maka Rasulullah shallallahu 'alaihi wasallam pun bersabda: \"Siapa yang telah kalian puji dengan kebaikan, maka telah wajib baginya surga. Dan siapa yang telah kalian cela dengan keburukan, maka telah wajib pula baginya neraka. Kalian adalah Syuhada`ullahi (para saksi Allah) di muka bumi, kalian adalah Syuhada`ullahi (para saksi Allah) di muka bumi.\" Dan telah menceritakan kepadaku [Abu Rabi' Az Zahrani] telah menceritakan kepada kami [Hammad] yakni Ibnu Zaid -dalam jalur lain- Dan telah menceritakan kepadaku [Yahya bin Yahya] telah mengabarkan kepada kami [Ja'far bin Sulaiman] keduanya dari [Tsabit] dari [Anas] ia berkata; Suatu ketika iringan jenazah lewat di hadapan Rasulullah shallallahu 'alaihi wasallam. Ia pun menyebutkan makna hadits Abdul Aziz, dari Anas. Hanya saja haditsnya Abdul Aziz lebih sempurna",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 2201,
			"arabicnumber": "949.02",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 2202,
			"arabicnumber": "950.01",
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] dari [Malik bin Anas] -terkait dengan hadits yang telah dibacakan kepadanya- dari [Muhammad bin Amru bin Halhalah] dari [Ma'bad bin Ka'ab bin Malik] dari [Abu Qatadah bin Rabi'i] bahwa ia menceritakan bahwasanya; Suatu ketika iringan jenazah lewat di hadapan Rasulullah shallallahu 'alaihi wasallam, maka beliau bersabda: \"MUTARIIH dan MUSTARAAH.\" Para sahabat bertanya, \"Wahai Rasulullah, apakah itu MUSTARIIH dan MUSTARAAH?\" beliau menjawab, \"Seorang hamba yang mukmin YASTARIH (akan beristirahat) dari memakmurkan dunia, sementara seorang hamba yang fajir, justru seluruh hamba, negeri, pepohonan dan binatang melata akan YASTARIH (beristirahat) dari (kezhalimannya) \" Dan Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] Telah menceritakan kepada kami [Yahya bin Sa'id] -dalam jalur lain- Dan telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Abdurrazaq] semuanya dari [Abdullah bin Sa'id bin Abu Hind] dari [Muhammad bin Amru] dari [Ibnu Ka'ab bin Malik] dari [Abu Qatadah] dari Nabi shallallahu 'alaihi wasallam. Dan di dalam hadits Yahya bin Sa'id: \"(Seorang hamba mukmin) akan beristirahat dari kesulitan dan kepenatan dunia menuju rahmat Allah",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 2203,
			"arabicnumber": "950.02",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 2204,
			"arabicnumber": "951.01",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya] ia berkata, saya telah membacakan kepada [Malik] dari [Ibnu Syihab] dari [Sa'id bin Al Musayyab] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam memanggil kaum muslimin untuk menunaikan (shalat ghaib) untuk raja Najasyi, pada hari wafatnya. Maka beliau pun keluar menuju mushalla (tanah lapang) bersama mereka dan bertakbir sebanyak empat kali takbir",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 2205,
			"arabicnumber": "951.02",
			"text": "Dan telah menceritakan kepadaku [Abdul Malik bin Syu'aib bin Laits] telah menceritakan kepadaku [bapakku] dari [kakekku] ia berkata, telah menceritakan kepadaku [Uqail bin Khalid] dari [Ibnu Syihab] dari [Sa'id bin Al Musayyab] dan [Abu Salamah bin Abdurrahman] bahwa keduanya telah menceritakan kepadanya dari [Abu Hurairah] bahwa ia berkata; Rasulullah shallallahu 'alaihi wasallam mengajak kami untuk menunaikan shalat (ghaib) untuk kematian An Najasyi, raja negeri Habasyah. Beliau bersabda: \"Mintakanlah ampunan untuk saudara kalian (An Najasyi).\" Ibnu Syihab berkata; Dan telah menceritakan kepadaku Sa'id bin Al Musayyab, bahwa Abu Hurairah telah menceritakan kepadanya bahwa Rasulullah shallallahu 'alaihi wasallam mengatur shaf mereka di Mushalla (tanah lapang), lalu beliau shalat (ghaib) dan bertakbir atasnya sebanyak empat kali takbir. Dan telah menceritakan kepadaku [Amru An Naqid] dan [Hasan Al Hulwani] dan [Abdu Humaid] mereka berkata, telah menceritakan kepada kami [Ya'qub bin Ibrahim bin Sa'd] telah menceritakan kepada kami [bapakku] dari [Shalih] dari [Ibnu Syihab] sebagaimana riwayat Uqail dengan kedua isnad itu",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 2206,
			"arabicnumber": "951.03",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 2207,
			"arabicnumber": "952.01",
			"text": "Dan telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Yazid bin Harun] dari [Salim bin Hayyan] ia berkata, telah menceritakan kepada kami [Sa'id bin Mina`] dari [Jabir bin Abdullah] bahwa Rasulullah shallallahu 'alaihi wasallam shalat (ghaib) atas kematian raja An Najasyi, maka beliau pun bertakbir atasnya sebanyak empat kali takbir",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 2208,
			"arabicnumber": "952.02",
			"text": "Dan telah menceritakan kepadaku [Muhammad bin Hatim] telah menceritakan kepada kami [Yahya bin Sa'id] dari [Ibnu Juraij] dari [Atha`] dari [Jabir bin Abdullah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pada hari ini, seorang hamba Allah yang shalih Ashmahah meninggal dunia.\" Akhirnya beliau berdiri dan mengimami kami dan shalat (ghaib) atasnya",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 2209,
			"arabicnumber": "952.03",
			"text": "Telah menceritakan kepada kami [Muhammad bin Ubaid Al Ghubari] telah menceritakan kepada kami [Hammad] dari [Ayyub] dari [Abu Zubair] dari [Jabir bin Abdullah] -dalam jalur lain- Dan telah menceritakan kepada kami [Yahya bin Ayyub] -dan lafazh juga miliknya- Telah menceritakan kepada kami [Ibnu Ulayyah] Telah menceritakan kepada kami [Ayyub] dari [Abu Zubair] dari [Jabir bin Abdullah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya saudara kalian telah meninggal, karena itu berdirilah untuk menunaikan shalat (ghaib) atasnya.\" Maka kami pun berdiri, dan beliau mengatur shaf kami menjadi dua shaf",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 2210,
			"arabicnumber": "953",
			"text": "Dan telah menceritakan kepadaku [Zuhair bin Harb] dan [Ali bin Hujr] telah menceritakan kepada kami [Isma'il] -dalam jalur lain- Dan telah menceritakan kepada kami [Yahya bin Ayyub] Telah menceritakan kepada kami [Ibnu Ulayyah] dari [Ayyub] dari [Abu Qilabah] dari [Abu Al Muhallab] dari [Imran bin Hushain] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya saudara kalian (raja Najasyi) telah meninggal, karena itu berdirilah kalian (untuk shalat ghaib) atasnya.\" Dan di dalam riwayat Zuhair tercantum; \"Sesungguhnya saudara kalian (Inna Akhaakum)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 2211,
			"arabicnumber": "954.01",
			"text": "Telah menceritakan kepada kami [Hasan bin Rabi'] dan [Muhammad bin Abdullah bin Numair] keduanya berkata, telah menceritakan kepada kami [Abdullah bin Idris] dari [Asy Syaiban] dari [Asy Sya'bi] bahwa Rasulullah shallallahu 'alaihi wasallam pernah menshalatkan jenazah di atas kuburan setelah dikebumikannya mayit. Beliau bertakbir atasnya empat kali. [Asy Syaibani] berkata; Saya bertanya kepada [Asy Sya'bi], \"Siapa yang menceritakanmu hadits ini?\" ia menjawab, \"Yaitu seorang yang tsiqqah (terpercaya), [Abdullah bin Abbas]. Dan ini adalah lafazh haditsnya Hasan.\" Dan dalam riwayat Ibnu Numair ia berkata; Rasulullah shallallahu 'alaihi wasallam sampai pada kuburan yang masih lembab, maka beliau pun menshalatinya, kemudian para sahabat berbaris di belakangnya. Lalu beliau bertakbir empat kali. Saya bertanya kepada [Amir], \"Siapa yang menceritakan hadits ini kepadamu?\" ia menjawab, \"Dari seorang yang terpercaya yaitu [Ibnu Abbas].\" Dan Telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Husyaim] -dalam jalur lain- Dan telah menceritakan kepada kami [Hasan bin Rabi'] dan [Abu Kamil] keduanya berkata, telah menceritakan kepada kami [Abdul Wahid bin Ziyad] -dalam jalur lain- Telah menceritakan kepada kami [Abdul Wahid bin Ziyad] -dalam jalur lain- Dan telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Jarir] -dalam jalur lain- Dan telah menceritakan kepadaku [Muhammad bin Hatim] telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Sufyan] -dalam jalur lain- Dan telah menceritakan kepada kami [Ubaidullah bin Mu'adz] telah menceritakan kepada kami [bapakku] -dalam jalur lain- Dan telah menceritakan kepada kami [Muhammad bin Al Mutsanna] Telah menceritakan kepada kami [Muhammad bin Ja'far] ia berkata, telah menceritakan kepada kami [Syu'bah] semuanya dari [Asy Syaibani] dari [Asy Sya'bi] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam dengan hadits semisalnya. Dan di antara hadits mereka itu, tidak ada satu pun yang menyatakan; Bahwa Nabi shallallahu 'alaihi wasallam bertakbir atasnya empat kali. Dan Telah menceritakan kepada kami [Ishaq bin Ibrahim] dan [Harun bin Abdullah] semuanya dari [Wahb bin Jarir] dari [Syu'bah] dari [Isma'il bin Abu Khalid] -dalam jalur lain- Dan telah menceritakan kepadaku [Abu Ghassan Muhammad bin Amr Ar Razi] telah menceritakan kepada kami [Yahya bin Adl Dlurais] telah menceritakan kepada kami [Ibrahim bin Thahman] dari [Abu Hashin] keduanya dari [Asy Sya'bi] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam, mengenai shalat (jenazah) di kuburan, sebagaimana hadits Asy Syaibani, namun di dalam hadits mereka tidak tercantum; \"Beliau bertakbir sebanyak empat kali",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 2212,
			"arabicnumber": "954.02",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 2213,
			"arabicnumber": "954.03",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 2214,
			"arabicnumber": "955",
			"text": "Dan telah menceritakan kepadaku [Ibrahim bin Muhammad bin 'Ar'arah As Sami] telah menceritakan kepada kami [Ghundar] telah menceritakan kepada kami [Syu'bah] dari [Habib bin Asy Syahid] dari [Tsabit] dari [Anas] bahwa Nabi shallallahu 'alaihi wasallam pernah shalat jenazah di atas kuburan",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 2215,
			"arabicnumber": "956",
			"text": "Dan telah menceritakan kepadaku [Abu Rabi' Az Zahrani] dan [Abu Kamil Fudlail bin Husain Al Jahdari] -dan lafazhnya milik Abu Kamil- keduanya berkata, telah menceritakan kepada kami [Hammad, yaitu anaknya Zaid] dari [Tsabit Al Bunani] dari [Abu Rafi'] dari [Abu Hurairah] bahwa seorang wanita berkulit hitam atau seorang pemuda biasanya menyapu Masjid. Suatu ketika Rasulullah shallallahu 'alaihi wasallam kehilangan orang itu, sehingga beliau pun menanyakannya. Para sahabat menjawab, \"Orang itu telah meninggal.\" Beliau bersabda: \"Kenapa kalian tidak memberitahukan kepadaku?\" Sepertinya mereka menganggap remeh urusan kematiannya. Beliau pun bersabda: \"Tunjukkanlah kepadaku di mana letak kuburannya.\" Maka para sahabat pun menunjukkan kuburannya, dan akhirnya beliau menshalatkannya. Ssetelah itu, beliau bersabda: \"Sesungguhnya kuburan-kuburan ini telah dipenuhi kegelapan bagi penghuninya. Dan Allah benar-benar akan memberikan mereka cahaya karena shalat aku kerjakan atas mereka",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 2216,
			"arabicnumber": "957",
			"text": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Muhammad bin Al Mutsanna] dan [Muhammad bin Basysyar] mereka berkata, telah menceritakan kepada kami [Muhammad bin Ja'far] Telah menceritakan kepada kami [Syu'bah] - [Abu Bakr] berkata- dari [Syu'bah] dari [Amru bin Murrah] dari [Abdurrahman bin Abu Laila] ia berkata; [Zaid] biasa bertakbir empat kali (menshalati) jenazah kami. Namun suatu ketika ia bertakbir sebanyak lima kali, maka saya pun bertanya padanya. Ia menjawab, \"Sebanyak itulah Rasulullah shallallahu 'alaihi wasallam bertakbir",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 2217,
			"arabicnumber": "958.01",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 2218,
			"arabicnumber": "958.02",
			"text": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Amru An Naqid] dan [Zuhair bin Harb] dan [Ibnu Numair] mereka berkata, telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Salim] dari [bapaknya] dari [Amir bin Rabi'ah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika kalian melihat usungan jenazah, maka berdirilah hingga jenazah itu berlalu atau diletakkan.\" Dan telah menceritakannya kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Laits] -dalam jalur lain- Dan telah menceritakan kepada kami [Muhammad bin Rumh] telah mengabarkan kepada kami [Laits] -dalam jalur lain- Dan telah menceritakan kepadaku [Harmalah] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] semuanya dari [Ibnu Syihab] dengan isnad ini, dan di dalam hadits Yunus, bahwa ia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda. Dan Telah menceritakan kepada kami [Qutaibah bin Sa'id] Telah menceritakan kepada kami [Laits] -dalam jalur lain- Dan Telah menceritakan kepada kami [Ibnu Rumh] telah mengabarkan kepada kami [Laits] dari [Nafi'] dari [Ibnu Umar] dari [Amir bin Rabi'ah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Jika salah seorang dari kalian melihat usungan jenazah sementara ia tidak ikut berjalan bersamanya, maka hendaklah ia berdiri hingga jenazah itu berlalu, atau jenazah itu diletakkan sebelum berlalu dari pandangannya.\" Dan telah menceritakannya kepadaku [Abu Kamil] telah menceritakan kepada kami [Hammad] -dalam jalur lain- Dan telah menceritakan kepadaku [Ya'qub bin Ibrahim] Telah menceritakan kepada kami [Isma'il] semuanya dari [Ayyub] -dalam jalur lain- Dan telah menceritakan kepada kami [Ibnul Mutsanna] telah menceritakan kepada kami [Yahya bin Sa'id] dari [Ubaidullah] -dalam jalur lain- [Ibnul Mutsanna] Telah menceritakan kepada kami [Ibnu Abi Adi] dari [Ibnu Aun] -dalam jalur lain- Dan telah menceritakan kepadaku [Muhammad bin Rafi'] telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ibnu Juraij] semuanya dari [Nafi'] dengan isnad ini, sebagaimana hadits Laits bin Sa'id. Hanya saja dalam haditsnya Ibnu Juraij; Nabi shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian melihat jenazah, hendaklah ia berdiri saat ia melihatnya hingga usungan jenazah itu berlalu, demikian kalau sekiranya ia tidak ikut mengantar jenazah tersebut",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 2219,
			"arabicnumber": "958.03",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 2220,
			"arabicnumber": "959.01",
			"text": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Jarir] dari [Suhail bin Abu Shalih] dari [bapaknya] dari [Abu Sa'id] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika kalian mengikuti jenazah, maka janganlah kalian duduk hingga jenazah itu diletakkan",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 2221,
			"arabicnumber": "959.02",
			"text": "Dan telah menceritakan kepadaku [Suraij bin Yunus] dan [Ali bin Hajr] keduanya berkata, telah menceritakan kepada kami [Ismail, yaitu anaknya Ulayyah] dari [Hisyam Ad Dastawa`i] -dalam jalur lain- Dan telah menceritakan kepada kami [Muhammad bin Al Mutsanna] -lafazh juga darinya- Telah menceritakan kepada kami [Mu'adz bin Hisyam] telah menceritakan kepadaku [bapakku] dari [Yahya bin Abu Katsir] ia berkata, telah menceritakan kepada kami [Abu Salamah bin Abdurrahman] dari [Abu Sa'id Al Khudri] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika kalian melihat jenazah, maka berdirilah. Dan siapa yang mengikutinya, maka janganlah ia duduk hingga jenazah itu diletakkan",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 2222,
			"arabicnumber": "960.01",
			"text": "Dan telah menceritakan kepadaku [Suraij bin Yunus] dan [Ali bin Hujr] keduanya berkata, telah menceritakan kepada kami [Isma'il, yaitu anak Ulayyah] dari [Hisyam Ad Dastawa`i] dari [Yahya bin Abu Katsir] dari [Ubaidullah bin Miqsam] dari [Jabir bin Abdullah] ia berkata; Pernah ada jenazah lewat di hadapan kami, lalu Rasulullah shallallahu 'alaihi wasallam berdiri dan kami pun ikut berdiri. Kemudian kami berkata, \"Wahai Rasulullah, sesungguhnya jenazah itu adalah seorang wanita Yahudi.\" Beliau bersabda: \"Sesungguhnya kematian itu adalah Faza' (dahsyat), maka jika kalian melihat jenazah, maka berdirilah",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 2223,
			"arabicnumber": "960.02",
			"text": "Dan telah menceritakan kepadaku [Muhammad bin Rafi'] telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Abu Zubair] bahwa ia mendengar [Jabir] berkata; Rasulullah shallallahu 'alaihi wasallam berdiri ketika ada jenazah lewat di hadapan beliau hingga jenazah itu berlalu",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 2224,
			"arabicnumber": "960.03",
			"text": "Dan telah menceritakan kepadaku [Muhammad bin Rafi'] telah menceritakan kepada kami [Abdurrazaq] dari [Ibnu Juraij] ia berkata, telah mengabarkan kepadaku [Abu Zubair] bahwa ia mendengar [Jabir] berkata; Rasulullah shallallahu 'alaihi wasallam dan para sahabatnya berdiri ketika jenazah orang Yahudi (lewat di hadapan mereka) hingga jenazah itu berlalu",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 2226,
			"arabicnumber": "961.02",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 2227,
			"arabicnumber": "962.01",
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Laits] -dalam jalur lain- Dan telah menceritakan kepada kami [Muhammad bin Rumh Al Muhajir] -dan lafazh juga darinya- telah menceritakan kepada kami [Laits] dari [Yahya bin Sa'id] dari [Waqid bin Amru bin Sa'd bin Mu'adz] bahwa ia berkata; Nafi' bin Jubair melihatku masih berdiri sementara kami sedang melayat jenazah. Sedangkan ia telah duduk duluan menunggu jenazah diletakkan. Maka ia bertanya kepadaku, \"Apa yang menyebabkanmu berdiri?\" saya menjawab, \"Saya menunggu jenazah diletakkan sebagaimana yang telah diceritakan oleh [Abu Sa'id Al Khudri].\" Maka [Nafi'] berkata; Sesungguhnya [Ibnu Mas'ud bin Al Hakam] telah menceritakan kepadaku dari [Ali bin Abu Thalib] bahwa ia berkata; \"Rasulullah shallallahu 'alaihi wasallam berdiri (ketika di hadapannya lewat jenazah) kemudian beliau duduk",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 2228,
			"arabicnumber": "962.02",
			"text": "Dan telah menceritakan kepadaku [Muhammad bin Al Mutsanna] dan [Ishaq bin Ibrahim] dan [Ibnu Abu Umar] semuanya dari [Ats Tsaqafi] - [Ibnul Mutsanna] berkata- Telah menceritakan kepada kami [Abdul Wahab] ia berkata, saya mendengar [Yahya bin Sa'id] ia berkata, telah mengabarkan kepadaku [Waqid bin Amru bin Sa'id bin Mu'adz Al Anshari] bahwa [Nafi' bin Jubair] telah mengabarkan kepadanya bahwa [Mas'ud bin Al Hakam Al Anshari] telah mengabarkan kepadanya bahwa ia mendengar [Ali bin Abu Thalib] berkata tentang jenazah; \"Sesungguhnya Rasulullah shallallahu 'alaihi wasallam berdiri kemudian duduk.\" Ia menceritakan hal itu karena Nafi' bin Jubair melihat Waqid bin Amr berdiri hingga jenazah diletakkan. Dan telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Ibnu Abu Zaidah] dari [Yahya bin Sa'id] dengan isnad ini",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 2229,
			"arabicnumber": "962.03",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 2230,
			"arabicnumber": "962.04",
			"text": "Dan telah menceritakan kepadaku [Zuhair bin Harb] telah menceritakan kepada kami [Abdurrahman bin Mahdi] telah menceritakan kepada kami [Syu'bah] dari [Muhammad bin Al Munkadir] ia berkata, saya mendengar [Mas'ud bin Al Hakam] menceritakan dari [Ali] ia berkata; Suatu ketika, kami melihat Rasulullah shallallahu 'alaihi wasallam berdiri, maka kami pun ikut berdiri. Kemudian beliau duduk dan kami pun ikut duduk kembali. Yakni (mereka berdiri) karena (di hadapan mereka lewat) jenazah. Dan telah menceritakannya kepada kami [Muhammad bin Abu Bakar Al Muqaddami] dan [Ubaidullah bin Sa'id] keduanya berkata, telah menceritakan kepada kami [Yahya Al Qaththan] dari [Syu'bah] dengan isnad ini",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 2231,
			"arabicnumber": "962.05",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 2233,
			"arabicnumber": "963.02",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 2234,
			"arabicnumber": "963.03",
			"text": "Telah menceritakan kepada kami [Nashru bin Ali Al Jahdlami] dan [Ishaq bin Ibrahim] keduanya dari [Isa bin Yunus] dari [Abu Hamzah Al Himshi] -dalam jalur lain- Dan telah menceritakan kepadaku [Abu Thahir] dan [Harun bin Sa'id Al Aili] -dan lafazhnya milik Abu Thahir- keduanya berkata, telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Amru bin Harits] dari [Abu Hamzah bin Sulaim] dari [Abdurrahman bin Jubair bin Nufair] dari [bapaknya] dari ['Auf bin Malik Al Asyja'i] ia berkata; Saya mendengar Nabi shallallahu 'alaihi wasallam membaca do'a dalam shalat jenazah: \"ALLAHUMMAGHFIR LAHU WARHAMHU WA'FU 'ANHU WA 'AAFIHI WA AKRIM NUZULAHU WA WASSI' MUDKHALAHU WAGHSILHU BILMAA`I WATS TSALJI WAL BARADI WA NAQQIHI MINAL KHATHAAYAA KAMAA YUNAQQOTS TSAUBUL ABYADLU MINAD DANASI WA ABDILHU DAARAN KHAIRAN MIN DAARIHI WA AHLAN KHAIRAN MIN AHLIHI WA ZAUJAN KHAIRAN MIN ZAUJIHI WA QIHI 'ADZABAL QOBRI WA 'ADZABAN NAARI.\" (\"Ya Allah, Ampunilah dia (mayat) berilah rahmat kepadanya, maafkanlah dia dan selamatkanlah dia (dari beberapa hal yang tidak disukai), dan tempatkanlah di tempat yang mulia (Surga), luaskan kuburannya, mandikan dia dengan air salju dan air es. Bersihkan dia dari segala kesalahan, sebagaimana Engkau membersihkan baju yang putih dari kotoran, berilah rumah yang lebih baik dari rumahnya (di dunia), berilah keluarga (atau istri di Surga) yang lebih baik daripada keluarganya (di dunia), istri (atau suami) yang lebih baik daripada istrinya (atau suaminya), dan masukkan dia ke Surga, jagalah dia dari siksa kubur dan Neraka lindungilah ia dari siksa kubur atau siksa api neraka\"). Auf berkata; \"Hingga saya berangan seandainya saya saja yang menjadi mayit itu, karena do'a Rasulullah shallallahu 'alaihi wasallam kepada mayit tersebut",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 2235,
			"arabicnumber": "964.01",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya At Tamimi] telah mengabarkan kepada kami [Abdul Warits bin Sa'id] dari [Husain bin Dzakwan] ia berkata, telah menceritakan kepadaku [Abdullah bin Buraidah] dari [Samurah bin Jundub] ia berkata; \"Aku shalat (jenazah) di belakang Rasulullah shallallahu 'alaihi wasallam, menshalatkan jenazah Ummu Ka'ab yang meninggal dunia ketika masa nifas (setelah melahirkan). Ketika itu Rasulullah shallallahu 'alaihi wasallam berdiri di sebelah pinggangnya.\" Dan telah menceritakannya kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Ibnul Mubarak] dan [Yazid bin Harun] -dalam jalur lain- Dan telah menceritakan kepadaku [Ali bin Hujr] telah mengabarkan kepada kami [Ibnul Mubarak] dan [Al Fadllu bin Musa] semuanya dari [Husain] dengan isnad ini, namun mereka tidak menyebutkan Ummu Ka'ab",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 2236,
			"arabicnumber": "964.02",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 2237,
			"arabicnumber": "964.03",
			"text": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Uqbah bin Mukram Al Ammi] keduanya berkata, telah menceritakan kepada kami [Ibnu Abu Adi] dari [Husain] dari [Abdullah bin Buraidah] ia berkata, [Samurah bin Jundub] berkata; \"Pada masa Rasulullah shallallahu 'alaihi wasallam aku masih kecil, dan saya telah menghafal (beberapa hadits) dari beliau, maka tidak ada yang menghalangiku untuk berbicara kecuali karena di sini terdapat orang-orang yang usia mereka lebih tua dariku. Dan sungguh, saya pernah shalat (jenazah) di belakang Rasulullah shallallahu 'alaihi wasallam untuk menshalatkan jenazah seorang wanita yang meninggal dunia ketika masa nifas (setelah melahirkan). Maka Rasulullah shallallahu 'alaihi wasallam berdiri (Shalat jenazah) di sebelah tengah-tengah badannya.\" Dalam riwayat Ibnul Mutsanna, ia berkata; telah menceritakan kepadaku Abdullah bin Buraidah, ia berkata; \"Maka beliau pun berdiri tepat di tengahnya untuk menshalatkannya",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 2238,
			"arabicnumber": "965.01",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya] dan [Abu Bakar bin Abu Syaibah] -lafazhnya dari Yahya- Abu Bakr berkata; Telah menceritakan kepada kami -sementara Yahya berkata- telah mengabarkan kepada kami [Waki'] dari [Malik bin Mighwal] dari [Simak bin Harb] dari [Jabir bin Samurah] ia berkata; Nabi shallallahu 'alaihi wasallam diberi kuda yang tak berpelana, lalu beliau pun menaikinya usai mengurusi jenazah Ibnu Dahdah, sementara kami berjalan di sekelilingnya",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 2239,
			"arabicnumber": "965.02",
			"text": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Muhammad bin Basysyar] -lafazh dari Ibnul Mutsanna- keduanya berkata, telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Simak bin Harb] dari [Jabir bin Samurah] ia berkata; Rasulullah shallallahu 'alaihi wasallam menshalatkan jenazah Ad Dahdah. Setelah itu, beliau diberi kuda yang tak berkelana. Kuda itu kemudian diikat oleh seseorang hingga Rasulullah shallallahu 'alaihi wasallam pun menaikinya dan berjalan pelan, sementara kami berjalan mengikuti di belakang beliau. Jabir berkata; Seorang laki-laki dari sebuah kaum bertanya: \"Berapakah batang pohonkah yang tergantung di jannah yang akan diberikan untuk Dahdah?\" atau Syu'bah berkata; \"Untuk Abu Dahdah",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 2240,
			"arabicnumber": "966",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Abdullah bin Ja'far Al Miswari] dari [Isma'il bin Muhammad bin Sa'd] dari [Amir bin Sa'd bin Abu Waqash] bahwa [Sa'd bin Abu Waqash] berkata di waktu sakit yang menyebabkan kematiannya, \"Buatkan bagiku lahad dan susunkan batu-batu di atas kuburanku sebagaimana yang diperbuat pada kuburan Rasulullah shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 2241,
			"arabicnumber": "967",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Waki'] -dalam jalur lain- Dan telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] Telah menceritakan kepada kami [Ghundar] dan [Waki'] semuanya dari [Syu'bah] -dalam jalur lain- Dan telah menceritakan kepada kami [Muhammad bin Al Mutsanna] -lafazh juga miliknya- ia berkata, telah menceritakan kepada kami [Yahya bin Sa'id] telah menceritakan kepada kami [Syu'bah] telah menceritakan kepada kami [Abu jamrah] dari [Ibnu Abbas] ia berkata; \"Telah diletakkan kain berbulu tebal dan berwarna merah pada kuburan Rasulullah shallallahu 'alaihi wasallam.\" Muslim berkata; Abu Jamrah namanya adalah Nashru bin Imran dan Abu Tayyah namanya adalah Yazid bin Humaid, keduanya meninggal di Sarakhsa",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 2242,
			"arabicnumber": "968",
			"text": "Dan telah menceritakan kepadaku [Abu Thahir Ahmad bin Amru] Dan telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Amru bin Harits] -dalam jalur lain- Dan telah menceritakan kepadaku [Harun bin Sa'id Al Aili] telah menceritakan kepada kami [Ibnu Wahb] telah menceritakan kepadaku [Amru bin Harits] -sementara dalam riwayat Abu Thahir- bahwa [Abu Ali Al Hamdani] telah menceitakan kepadanya -sementara dalam riwayat Harun- bahwa [Tsumamah bin Syufay] telah menceritakan kepadanya, ia berkata; Kami pernah berada di negeri Romawi bersama Fadlalah bin Ubaid, tepatnya di Rudis. Lalu salah seorang dari sahabat kami meninggal dunia, maka [Fadlalah bin Ubaid] pun memerintahkan untuk menguburkannya dan meratakan kuburannya. Kemudian ia berkata; Saya telah mendengar Rasulullah shallallahu 'alaihi wasallam memerintahkan untuk meratakan kuburan",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 2244,
			"arabicnumber": "969.02",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 2245,
			"arabicnumber": "970.01",
			"text": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] Telah menceritakan kepada kami [Hafsh bin Ghiyats] dari [Ibnu Juraij] dari [Abu Zubair] dari [Jabir] ia berkata; \"Rasulullah shallallahu 'alaihi wasallam melarang mengapur kuburan, duduk dan membuat bangunan di atasnya.\" Dan telah menceritakan kepadaku [Harun bin Abdullah] Telah menceritakan kepada kami [Hajjaj bin Muhammad] -dalam jalur lain- Dan telah menceritakan kepadaku [Muhammad bin Rafi'] Telah menceritakan kepada kami [Abdurrazaq] semuanya dari [Ibnu Juraij] ia berkata, telah mengabarkan kepada kami [Abu Zubair] bahwa ia mendengar [Jabir bin Abdullah] berkata; Saya mendengar Nabi shallallahu 'alaihi wasallam bersabda dengan hadits semisalnya",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 2246,
			"arabicnumber": "970.02",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 2247,
			"arabicnumber": "970.03",
			"text": "Dan telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Isma'il bin Ulayyah] dari [Ayyub] dari [Abu Zubair] dari [Jabir] ia berkata; \"Telah dilarang untuk mengapur kuburan",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 2248,
			"arabicnumber": "971.01",
			"text": "Dan telah menceritakan kepadaku [Zuhair bin Harb] Telah menceritakan kepada kami [Jarir] dari [Suhail] dari [bapaknya] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian duduk di atas bara api, lalu terbakar baju dan kulitnya adalah lebih baik baginya daripada ia harus duduk di atas kuburan.\" Dan telah menceritakannya kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Abdul Aziz Ad Darawardi] -dalam jalur lain- Dan telah menceritakannya kepadaku [Amru An Naqid] Telah menceritakan kepada kami [Abu Ahmad Az Zubaidi] Telah menceritakan kepada kami [Sufyan] keduanya dari [Suhail] dengan isnad ini, hadits yang semisalnya",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 2249,
			"arabicnumber": "971.02",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 2250,
			"arabicnumber": "972.01",
			"text": "Dan telah menceritakan kepadaku [Ali bin Hujr As Sa'di] Telah menceritakan kepada kami [Al Walid bin Muslim] dari [Ibnu Jabir] dari [Busr bin Ubaidullah] dari [Watsilah] dari [Abu Martsad Al Ghanawi] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian duduk di atas kuburan, dan jangan pula kalian shalat dengan menghadap ke arahnya",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 2251,
			"arabicnumber": "972.02",
			"text": "Dan telah menceritakan kepada kami [Hasan bin Rabi' Al Bajali] Telah menceritakan kepada kami [Ibnul Mubarak] dari [Abdurrahman bin Yazid] dari [Busr bin Ubaidullah] dari [Abu Idris Al Khaulani] dari [Watsilah bin Al Asyqa'] dari [Abu Martsad Al Ghanawi] ia berkata; Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian shalat dengan menghadap kuburan dan jangan pula kalian duduk di atasnya",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 2252,
			"arabicnumber": "973.01",
			"text": "Dan telah menceritakan kepadaku [Ali bin Hujr As Sa'di] dan [Ishaq bin Ibrahim Al Hanzhali] -sedangkan lafazhnya milik Ishaq- Ali berkata, telah menceritakan kepada kami -sementara Ishaq berkata- telah mengabarkan kepada kami [Abdul Aziz bin Muhammad] dari [Abdul Wahid bin Hamzah] dari [Abbad bin Abdullah bin Zubair] bahwa [Aisyah] menyuruh orang-orang agar membawa jenazah Sa'd bin Abu Waqash ke Masjid untuk dishalatkan di situ. Tetapi mereka tidak mengindahkan perintah tersebut, maka Aisyah pun berkata, \"Alangkah cepatnya orang lupa, bahwa Rasulullah shallallahu 'alaihi wasallam pernah menshalatkan Suhail bin Baidla` di Masjid",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 2253,
			"arabicnumber": "973.02",
			"text": "Dan telah menceritakan kepadaku [Muhammad bin Hatim] Telah menceritakan kepada kami [Bahz] Telah menceritakan kepada kami [Wuhaib] Telah menceritakan kepada kami [Musa bin Uqbah] dari [Abdul Wahid] dari [Abbad bin Abdullah bin Zubair] ia menceritakan dari [Aisyah] bahwa ketika Sa'd bin Abi Waqash meninggal dunia, para isteri Nabi shallallahu 'alaihi wasallam memerintahkan orang-orang agar membawa jenazahnya ke masjid untuk dishalatkan (di situ). Permintaan tersebut mereka penuhi, maka dibawalah jenazah tersebut ke muka kamar para istri Nabi shallallahu 'alaihi wasallam untuk mereka shalatkan. Kemudian dibawa kembali keluar melalui pintu jenazah yang berhubungan dengan tempat duduk. Tidak berapa lama kemudian sampailah kabar kepada para istri nabi bahwa orang-orang banyak mencela perbuatan mereka itu. Mereka berkata, \"Jenazah tidak boleh dibawa ke masjid.\" Ucapan orang banyak itu sampai pula kepada Aisyah. Maka Aisyah pun berkata, \"Alangkah cepatnya orang-orang mencela apa yang tidak mereka ketahui. Mereka mencela kami membawa jenazah ke masjid. Padahal tidaklah Rasulullah shallallahu 'alaihi wasallam menshalatkan Suhail bin Baidla` kecuali di dalam masjid",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 2254,
			"arabicnumber": "973.03",
			"text": "Dan telah menceritakan kepadaku [Harun bin Abdullah] dan [Muhammad bin Rafi'] -lafazhnya juga milik Ibnu Rafi'- keduanya berkata, telah menceritakan kepada kami [Ibnu Abu Fudaik] telah mengabarkan kepada kami [Adl Dlahak] yakni Ibnu Utsman, dari [Abu Nadlr] dari [Abu Salamah bin Abdurrahman] bahwa ketika Sa'd bin Abu Waqash meninggal, [Aisyah] berkata, \"Masukkanlah ia ke dalam masjid hingga aku bisa menshalatkannya.\" Namun mereka tidak menyetujuinya, maka ia pun berkata, \"Demi Allah, sungguh Rasulullah shallallahu 'alaihi wasallam telah menshalatkan jenazah dua orang putra Baidla` di dalam masjid, yaitu Suhail dan saudaranya.\" Muslim berkata; \"Suhail bin Da'd adalah Ibnul Baidla`, dan ibunya adalah Baidla",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 2255,
			"arabicnumber": "974.01",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya At Tamimi] dan [Yahya bin Ayyub] dan [Qutaibah bin Sa'id] -Yahya berkata- telah mengabarkan kepada kami -sementara dua orang yang lain berkata- Telah menceritakan kepada kami [Isma'il bin Ja'far] dari [Syarik, yaitu anaknya Abu Namir] dari [Atha` bin Yasar] dari [Aisyah] bahwa ia berkata; Pada malam gilirannya bersama Rasulullah shallallahu 'alaihi wasallam, di akhir malam beliau keluar ke Bagi' dan mengucapkan: \"Semoga keselamatan atas kalian wahai para penghuni (kuburan) dari kaum mukminin. Apa yang dijanjikan Allah kepada kalian niscaya akan kalian dapati esok (pada hari kiamat), dan kami Insya Allah akan menyusul kalian. Ya Allah ampunilah penduduk Baqi' yang mati tenggelam.\" Qutaibah tidak menyebutkan; \"Wa Ataakum",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 2256,
			"arabicnumber": "974.02",
			"text": "Dan telah menceritakan kepadaku [Harun bin Sa'id Al Aili] telah menceritakan kepada kami [Abdullah bin Wahb] telah mengabarkan kepada kami [Ibnu Juraij] dari [Abdullah bin Katsir bin Muthallib] bahwa ia mendengar [Muhammad bin Qais] berkata, saya mendengar [Aisyah] menceritakan, ia berkata; \"Maukah kalian aku ceritakan sebuah hadits dari Rasulullah shallallahu 'alaihi wasallam dan juga dariku?\" Kami menjawab, \"Ya.\" -dalam jalur lain- Dan telah menceritakan kepadaku [seorang] yang mendengar Hajjaj Al A'war, dan lafazh juga miliknya, ia berkata, telah menceritakan kepada kami [Hajjaj bin Muhammad] Telah menceritakan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Abdullah] -seorang laki-laki dari Qurais- dari [Muhammad bin Qais bin Makhramah bin Al Muthallib] bahwa pada suatu hari ia berkata, \"Maukah kalian aku ceritakan (hadits) dariku dan dari ibuku?\" -maka kami pun menyangka bahwa yang ia maksud dengan ibunya adalah Ibu yang telah melahirkannya- Ia berkata; [Aisyah] berkata, \"Maukah kalian aku ceritakan hadits dariku dan dari Rasulullah shallallahu 'alaihi wasallam?\" kami menjawab, \"Ya, mau.\" Aisyah berkata; Pada suatu malam ketika giliran Rasulullah shallallahu 'alaihi wasallam di rumahku, setelah beliau menanggalkan pakaiannya, meletakkan terompahnya dekat kaki dan membentangkan pinggir jubahnya di atas kasur, beliau lantas berbaring. Setelah beberapa lama kemudian dan barangkali beliau menyangkaku telah tidur, beliau mengambil baju dan terompahnya, dibukanya pintu perlahan-lahan dan kemudian ditutupnya kembali perlahan-lahan. Menyaksikan beliau seperti itu, kukenakan pula bajuku dan kututup kepalaku dengan kain, kemudian aku mengikuti beliau dari belakang hingga sampai di Baqi'. Ketika sampai di sana beliau berdiri agak lama, kemudian beliau mengangkat kedua tangannya tiga kali, sesudah itu beliau berbalik pulang. Aku pun berbalik pula mendahului beliau. Kalau beliau berjalan cepat, maka aku pun berjalan cepat-cepat. Bila beliau berlari kecil, aku pun demikian. Ketika beliau sampai, aku pun sudah sampai lebih dulu dari beliau. Kemudian aku masuk ke dalam rumah dan langsung tidur. Setelah itu, beliau masuk dan bertanya: \"Kenapa kamu wahai Aisyah? Kudengar nafasmu kembang kempis.?\" Jawabku, \"Tidak ada apa-apa wahai Rasulullah?\" Beliau berkata: \"Ceritakanlah kepadaku atau kalau tidak Allah -Yang MahaLembut dan Mengetahui- akan menceritakannya padaku.\" Aku menjawab, \"Wahai Rasulullah, demi bapak dan ibuku.\" Lalu kuceritakanlah kepada beliau apa yang sebenarnya terjadi. Beliau berkata, \"Kalau begitu, kamulah kiranya bayangan hitam yang saya lihat di depanku tadi?\" Saya menjawab, \"Ya, benar wahai Rasulullah.\" Maka beliau pun mendorong dadaku dengan keras hingga terasa sakit bagiku. Kemudian beliau berkata, \"Apakah kamu masih curiga, Allah dan Rasul-Nya akan berbuat curang kepadamu?\" jawabku, \"Setiap apa yang dirahasiakan manusia, pasti Allah mengetahuinya pula.\" Kemudian Rasulullah shallallahu 'alaihi wasallam menceritakan kenapa beliau sampai keluar. Beliau bercerita: \"Tadi Jibril datang, tapi karena ia melihat ada kamu, dia memanggilku perlahan-lahan sehingga tidak terdengar olehmu. Aku menjawab panggilannya tanpa terdengar pula olehmu. Dia tidak masuk ke rumah, karena kamu menanggalkan pakaianmu. Dan aku pun mengira bahwa kamu telah tidur, karena itu aku segan membangunkanmu khawatir engkau akan merasa kesepian. Jibril berkata padaku, 'Allah memerintahkan agar Tuan datang ke Baqi' dan memohonkan ampunan bagi para penghuninya.' Aku berkata, 'Lalu apa yang kubaca sesampai di sana wahai rasulullah? ' Jibril menjawab, 'Bacalah: AS SALAAMU 'ALA AHLID DIYAAR MINAL MUKMINIIN WAL MUSLIMIIN WA YARHAMULLAHUL MUSTAQDIMIIN MINNAA WAL MUSTA`KHIRIIN WA INNAA INSYAA`ALLAHU BIKUM LAAHIQUUN (Semoga keselamatan tercurah bagi penduduk kampung orang-orang mukmin dan muslim ini. Dan semoga Allah memberi rahmat kepada orang-orang yang telah mendahului kami dan orang-orang kemudian, dan kami insya Allah akan menyusul kalian semua)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 2257,
			"arabicnumber": "975",
			"text": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Zuhair bin Harb] keduanya berkata, telah menceritakan kepada kami [Muhammad bin Abdullah Al Asadi] dari [Sufyan] dari [Alqamah bin Martsad] dari [Sulaiman bin Buraidah] dari [bapaknya] ia berkata; Rasulullah shallallahu 'alaihi wasallam mengajarkan kepada mereka apa yang mesti mereka kerjakan apabila mereka hendak keluar ziarah kubur. Maka salah seorang dari mereka membaca do'a sebagaimana yang tertera dalam riwayat Abu Bakar; \"AS SALAAMU 'ALA AHLID DIYAAR -sementara dalam riwayat Zuhair- AS SALAAMU 'ALAIKUM AHLAD DIYAARI MINAL MUKMINIIN WAL MUSLIMIIN WA INNAA INSYAA`ALLAHU BIKUM LAAHIQUUN ASALULLAHA LANAA WALAKUMUL 'AAFIYAH (Semoga keselamatan tercurah bagi penghuni (kubur) dari kalangan orang-orang mukmin dan muslim dan kami insya Allah akan menyulul kalian semua. Saya memohon kepada Allah bagi kami dan bagi kalian Al 'Afiyah (keselamatan)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 2258,
			"arabicnumber": "976.01",
			"text": "Telah menceritakan kepada kami [Yahya bin Ayyub] dan [Muhammad bin Abbad] -lafazhnya milik Yahya- keduanya berkata, telah menceritakan kepada kami [Marwan bin Mu'awiyah] dari [Yazid yaitu Ibnu Kaisan] dari [Abu Hazim] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku mohon izin kepada Rabb-ku untuk memohonkan ampun bagi ibuku, tetapi tidak diperkenankan. Kemudian aku meminta izin untuk menziarahi kuburnya, maka diperkenankan",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 2259,
			"arabicnumber": "976.02",
			"text": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Zuhair bin Harb] keduanya berkata, telah menceritakan kepada kami [Muhammad bin Ubaid] dari [Yazid bin Kaisan] dari [Abu Hazim] dari [Abu Hurairah] ia berkata; Nabi shallallahu 'alaihi wasallam menziarahi kubur ibunya, lalu beliau menangis sehingga orang yang berada di sekelilingnya pun ikut menangis. Kemudian beliau bersabda: \"Saya memohon izin kepada Rabb-ku untuk memintakan ampunan baginya, namun tidak diperkenankan oleh-Nya, dan saya meminta izin untuk menziarahi kuburnya lalu diperkenankan oleh-Nya. Karena itu, berziarahlah kubur karena ia akan mengingatkan kalian akan kematian",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 2260,
			"arabicnumber": "977.01",
			"text": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Muhammad bin Abdulalh bin Numair] dan [Muhammad bin Al Mutsanna] -sedangkan lafazhnya milik Abu Bakar dan Ibnu Numair- mereka berkata, telah menceritakan kepada kami [Muhammad bin Fudlail] dari [Abu Sinan] -ia adalah Dlirar bin Murrah- dari [Muharib bin Ditsar] dari [Ibnu Buraidah] dari [bapaknya] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dahulu aku melarang kalian untuk ziarah kubur, maka sekarang ziarahilah. Dahulu aku melarang kalian untuk menyimpan daging hewan kurban lebih dari tiga hari, maka sekarang simpanlah selama jelas bagimu manfaatnya. Dahulu aku melarang kalian membuat anggur selain dalam qirbah, maka sekarang minumlah dari segala tempat air, asal jangan kamu minum yang memabukkan.\" Ibnu Numair berkata dalam hadits yang diriwayatkannya; Dari [Abdullah bin Buraidah] dari [bapaknya] -dalam jalur lain- Dan Telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Abu Khaitsamah] dari [Zubaid Al Yami] dari [Muharib bin Ditsar] dari [Ibnu Buraidah] -menurutku- dari [bapaknya] -keraguan dari Abu Khaitsamah- dari Nabi shallallahu 'alaihi wasallam -dalam jalur lain- Dan Telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] Telah menceritakan kepada kami [Qabishah bin Uqbah] dari [Sufyan] dari [Alqamah bin Martsad] dari [Sulaiman bin Buraidah] dari [bapaknya] dari Nabi shallallahu 'alaihi wasallam -dalam jalur lain- Dan telah menceritakan kepada kami [Ibnu Abu Umar] dan [Muhammad bin Rafi'] dan [Abdu bin Humaid] semuanya dari [Abdurrazaq] dari [Ma'mar] dari [Atha` Al Khurasani] ia berkata, telah menceritakan kepadaku [Abdullah bin Buraidah] dari [bapaknya] dari Nabi shallallahu 'alaihi wasallam. Semuanya adalah semakna dengan hadits Abu Sinan",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 2261,
			"arabicnumber": "977.02",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 2262,
			"arabicnumber": "978",
			"text": "Telah menceritakan kepada kami ['Aun bin Sallam Al Kufi] telah mengabarkan kepada kami [Zuhair] dari [Simak] dari [Jabir bin Samurah] ia berkata; Pernah didatangkan kepada beliau shallallahu 'alaihi wasallam jenazah seorang laki-laki yang bunuh diri dengan anak panah. Tetapi jenazah tersebut tidak dishalatkan oleh beliau",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 138
			}
		}
	]
}