{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"16": "The Book of Marriage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 388,
			"arabicnumber": "154.02",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 3398,
			"arabicnumber": "1400.01",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya At Tamimi] dan [Abu Bakr bin Abu Syaibah] dan [Muhammad bin Al Ala` Al Hamdani] semuanya dari [Abu Mu'wiyah] -lafazh dari [Yahya] - telah mengabarkan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Ibrahim] dari ['Alqamah] ia berkata; Aku pernah berjalan bersama [Abdullah] di Mina, lalu ia dijumpai oleh Utsman. Maka ia pun berdiri bersamanya dan menceritakan hadits padanya. Utsman berkata, \"Wahai Abu Abdurrahman, maukah Anda kami nikahkan dengan seorang budak wanita yang masih gadis, sehingga ia dapat mengingatkan masa lalumu.\" Abdullah berkata; Jika Anda berkata seperti itu, maka sungguh, Rasulullah shallallahu 'alaihi wasallam telah bersabda kepada kami: \"Wahai para pemuda, siapa di antara kalian yang telah memperoleh kemampuan (menghidupi rumah tangga), kawinlah. Karena sesungguhnya, perhikahan itu lebih mampu menahan pandangan mata dan menjaga kemaluan. Dan, barangsiapa belum mampu melaksanakannya, hendaklah ia berpuasa karena puasa itu akan meredakan gejolak hasrat seksual.\" Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Jarir] dari [Al A'masy] dari [Ibrahim] dari [Alqamah] ia berkata; Aku pernah berjalan bersama [Abdullah bin Mas'ud] di Mina. Tiba-tiba Utsman bin Affan menemuinya dan berkata; Kemarilah wahai Abu Abdurrahman. Utsman lalu mengajaknya berbicara empat mata. Dan ketika Abdullah melihat tidak ada lagi kepentingan lain, ia memanggilku, \"Kemarilah ya Alqamah.\" Maka aku pun segera datang. Kemudian Utsman berkata kepada Abdullah, \"Wahai Abu Abdurrahman, maukah Anda kami nikahkan dengan seorang budak wanita yang masih gadis, sehingga kesemangatanmu kembali lagi seperti dulu?\" Abdullah menjawab, \"Jika Anda berkata demikian…\" Maka ia pun menyebutkan hadits yang serupa dengan haditsnya Abu Mu'awiyah",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3399,
			"arabicnumber": "1400.02",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3400,
			"arabicnumber": "1400.03",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3401,
			"arabicnumber": "1400.04",
			"text": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Abu Kuraib] keduanya berkata, Telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Umarah bin Umair] dari [Abdurrahman bin Yazid] dari [Abdullah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai para pemuda, siapa di antara kalian yang telah memperoleh kemampuan menghidupi kerumahtanggaan, kawinlah. Karena sesungguhnya, perhikahan itu lebih mampu menahan pandangan mata dan menjaga kemaluan. Dan, barangsiapa belum mampu melaksanakannya, hendaklah ia berpuasa karena puasa itu akan meredakan gejolak hasrat seksual.\" Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Jarir] dari [Al A'masy] dari [Umarah bin Umair] dari [Abdurrahman bin Yazid] ia berkata; Aku bersama pamanku Alqamah pernah masuk menemui [Abdullah bin Mas'ud], yang pada saat itu aku adalah seorang pemuda. Maka ia pun menyebutkan suatu hadits yang menurutku, ia menuturkan hadits karena karena melihatku sebagai seorang pemuda. Ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda. Yakni sebagaimana haditsnya Abu Mu'awiyah. Dan menambahkan; \"Maka tidak lama kemudian aku menikah.\" Telah menceritakan kepadaku [Abdullah bin Sa'id Al Asyajj] telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Al A'masy] dari [Umarah bin Umair] dari [Abdurrahman bin Yazid] dari [Abdullah]; \"Kami pernah menemuinya dan pada saat itu aku adalah yang paling muda usianya (belum menikah).\" Yakni serupa dengan hadits mereka. Namun ia tidak menyebutkan; \"Maka tidak lama kemudian aku menikah",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3402,
			"arabicnumber": "1400.05",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 3403,
			"arabicnumber": "1401",
			"text": "Dan telah menceritakan kepadaku [Abu Bakar bin Nafi' Al Abdi] telah menceritakan kepada kami [Bahz] telah menceritakan kepada kami [Hammad bin Salamah] dari [Tsabit] dari [Anas] bahwa sekelompok orang dari kalangan sahabat Nabi shallallahu 'alaihi wasallam bertanya kepada isteri-isteri Nabi shallallahu 'alaihi wasallam mengenai amalan beliau yang tersembunyi. Maka sebagian dari mereka pun berkata, \"Saya tidak akan menikah.\" Kemudian sebagian lagi berkata, \"Aku tidak akan makan daging.\" Dan sebagian lain lagi berkata, \"Aku tidak akan tidur di atas kasurku.\" Mendengar ucapan-ucapan itu, Nabi shallallahu 'alaihi wasallam memuji Allah dan menyanjung-Nya, kemudian beliau bersabda: \"Ada apa dengan mereka? Mereka berkata begini dan begitu, padahal aku sendiri shalat dan juga tidur, berpuasa dan juga berbuka, dan aku juga menikahi wanita. Maka siapa yang saja yang membenci sunnahku, berarti bukan dari golonganku",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3404,
			"arabicnumber": "1402.01",
			"text": "Dan Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Abdullah bin Al Mubarak] -dalam riwayat lain- Dan Telah menceritakan kepada kami [Abu Kuraib Muhammad bin Al Ala`] -lafazh darinya- telah mengabarkan kepada kami [Ibnul Mubarak] dari [Ma'mar] dari [Az Zuhri] dri [Sa'id bin Al Musayyab] dari [Sa'd bin Abu Waqash] ia berkata; Rasulullah shallallahu 'alaihi wasallam pernah melarang Utsman bin Mazh'un untuk membujang selamanya, karena semata-mata hendak melakukan ibadah kepada Allah. Andaikan beliau mengizinkannya, tentulah kami sudah mengebiri diri kami sendiri",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3405,
			"arabicnumber": "1402.02",
			"text": "Dan telah menceritakan kepadaku [Abu Imran Muhammad bin Ja'far bin Ziyad] telah menceritakan kepada kami [Ibrahim bin Sa'd] dari [Ibnu Syihab Az Zuhri] dari [Sa'id bin Al Musayyab] ia berkata, saya mendengar [Sa'd] berkata; Utsman bin Mazh'un pernah dilarang untuk membujang selamanya, karena semata-mata hendak melakukan ibadah kepada Allah. Andaikan beliau mengizinkannya, tentulah kami sudah mengebiri diri kami sendiri",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3406,
			"arabicnumber": "1402.03",
			"text": "Telah menceritakan kepada kami [Muhammad bin Rafi'] telah menceritakan kepada kami [Hujain bin Al Mutsanna] telah menceritakan kepada kami [Laits] dari [Uqail] dari [Ibnu Syihab] bahwa ia berkata, telah mengabarkan kepadaku [Sa'id bin Al Musayyab] bahwa ia mendengar [Sa'd bin Abu Waqash] berkata; \"Utsman bin Mazh'un untuk hidup membujang, lalu Rasulullah shallallahu 'alaihi wasallam melarangnya. Andaikan beliau mengizinkannya, tentulah kami sudah mengebiri diri kami sendiri",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3407,
			"arabicnumber": "1403.01",
			"text": "Telah menceritakan kepada kami [Amru bin Ali] telah menceritakan kepada kami [Abdul A'la] telah menceritakan kepada kami [Hisyam bn Abu Abdullah] dari [Abu Zubair] dari [Jabir] bahwasanya; Rasulullah shallallahu 'alaihi wasallam pernah melihat seorang wanita, lalu beliau mendatangi isterinya, yaitu Zainab yang sedang menyamak kulit, guna melepaskan rasa rindunya. Sesudah itu, beliau pergi menemui para sahabatnya, lalu beliau bersabda: \"Sesungguhnya wanita itu datang dan pergi bagaikan syetan. Maka bila kamu melihat seorang wanita, datangilah isterimu, karena yang demikian itu dapat menentramkan gejolak hatimu.\" Telah menceritakan kepada kami [Zuhair bin Harb] telah menceritakan kepada kami [Abdush Shamad bin Abdul Warits] telah menceritakan kepada kami [Harb bin Abu 'Aliyah] telah menceritakan kepada kami [Abu Zubair] dari [Jabir bin Abdullah] bahwa Nabi shallallahu 'alaihi wasallam pernah melihat seorang wanita. Maka ia pun menyebutkan hadits yang semisalnya. Hanya saja ia menyebutkan; \"Lalu beliau segera mendatangi isterinya, yaitu Zainab yang sedang menyamak kulit.\" Dan ia tidak menyebutkan; \"Pergi seperti syetan",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3408,
			"arabicnumber": "1403.02",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3409,
			"arabicnumber": "1403.03",
			"text": "Dan telah menceritakan kepadaku [Salamah bin Syabib] telah menceritakan kepada kami [Al Hasan bin A'yan] telah menceritakan kepada kami [Ma'qil] dari [Abu Zubair] ia berkata, [Jabir] berkata; Saya mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian terpikat oleh wanita lain dan menimbulkan gejolak dalam hatinya, maka segeralah ia menumpahkan hasratnya pada isterinya. Karena yang demikian itu dapat menentramkan gejolak hatinya",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3410,
			"arabicnumber": "1404.01",
			"text": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair Al Hamdani] telah menceritakan kepada kami [bapakku] dan [Waki'] dan [Ibnu Bisyr] dari [Isma'il] dari [Qais] ia berkata, saya mendengar [Abdullah] berkata; Kami pernah berperang bersama Rasulullah shallallahu 'alaihi wasallam tanpa membawa isteri, lalu kami berkata, \"Apakah sebaiknya kita mengebiri kemaluan kita?\" Rasulullah shallallahu 'alaihi wasallam melarang kami berbuat demikian, dan beliau memberikan keringanan pada kami untuk menikahi perempuan sampai pada batas waktu tertentu dengan mas kawin pakaian. Kemudian Abdullah bin Mas'ud membaca ayat: \"Hai orang-orang yang beriman, janganlah kamu haramkan apa-apa yang baik yang Telah Allah halalkan bagi kamu, dan janganlah kamu melampaui batas. Sesungguhnya Allah tidak menyukai orang-orang yang melampaui batas.\" (QS. Almaidah; 87). Dan Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Jarir] dari [Isma'il bin Abu Khalid] dengan isnad ini, semisalnya. Dan ia menyebutkan; \"Kemudian ia membacakan ayat ini kepada kami.\" Ia tidak menyebutkan; (Abdullah) membaca..\" Dan Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Waki'] dan [Isma'il] dengan isnad ini. ia berkata; Dulu kami adalah para pemuda, dan kami pun bertanya, \"Wahai Rasulullah bolehkan kami mengebiri?\" Namun ia tidak menyebutkan; \"NAGHZUU (kami berperang)",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3411,
			"arabicnumber": "1404.02",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3412,
			"arabicnumber": "1404.03",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3413,
			"arabicnumber": "1405.01",
			"text": "Dan Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Amru bin Dinar] ia berkata, saya mendengar [Al Hasan bin Muhammad] menceritakan dari [Jabir bin Abdullah] dan [Salamah bin Al Akwa'] ia berkata; utusan Rasulullah shallallahu 'alaihi wasallam datang kepada kami, lalu dia berkata, \"Rasulullah shallallahu 'alaihi wasallam telah mengizinkan kalian untuk nikah mut'ah",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 3414,
			"arabicnumber": "1405.02",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 3415,
			"arabicnumber": "1405.03",
			"text": "Dan Telah menceritakan kepada kami [Al Hasan Al Hulwani] telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ibnu Juraij] ia berkata, [Atha`] berkata; [Jabir bin Abdullah] kembali dari menunaikan Umrah, lalu kami pun menemuinya di rumahnya, dan orang-orang pun bertanya kepadanya tentang berbagai persoalan. Kemudian mereka pun menyebutkan tentang nikah mut'ah, maka Jabir menjawab; \"Ya, kami pernah melakukan nikah mut'ah pada masa Rasulullah shallallahu 'alaihi wasallam, Abu Bakar dan Umar",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 3416,
			"arabicnumber": "1405.04",
			"text": "Telah menceritakan kepadaku [Muhammad bin Rafi'] telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Abu Zubair] ia berkata, saya mendengar [Jabir bin Abdullah] berkata; \"Kami pernah melakukan nikah mut'ah selama beberapa hari dengan mas kawin beberapa genggam kurma dan tepung, pada masa Rasulullah shallallahu 'alaihi wasallam dan Abu Bakar radliallahu 'anhu sampai Umar melarang nikat mut'ah dalam kasus Amru bin Huraits",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 3417,
			"arabicnumber": "1405.05",
			"text": "Telah menceritakan kepada kami [Hamid bin Umar Al Bakrawi] telah menceritakan kepada kami [Abdul Wahid] yakni Ibnu Ziyad, dari [Ashim] dari [Abu Nadlrah] ia berkata; Aku pernah berada di dekat [Jabir bin Abdullah], lalu ia didatangi oleh seseorang dan berkata; Ibnu Abbas dan Ibnu Zubair berselisih pendapat mengenai Mut'atain (yaitu nikah mut'ah dan haji tamattu'), maka Jabir pun berkata, \"Kami pernah melakukan keduanya bersama Rasulullah shallallahu 'alaihi wasallam, kemudian Umar melarang kami untuk melakukan keduanya dan kami tidak pernah lagi melakukannya lagi",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 3418,
			"arabicnumber": "1405.06",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 3419,
			"arabicnumber": "1406.01",
			"text": "Dan telah menceritakan kepadaku [Qutaibah bin Sa'id] telah menceritakan kepada kami [Laits] dari [Ar Rabi' bin Sabrah Al Juhani] dari [bapaknya] Sabrah, bahwa ia berkata; Rasulullah shallallahu 'alaihi wasallam pernah mengizinkan kami untuk nikah mut'ah. Maka aku beserta seorang temanku mendatangi seorang wanita dari Bani Amir, sepertinya wanita itu masih gadis dan cantik jelita. Maka kami pun menyerahkan diri kami padanya, lalu wanita itu berkata, \"Mahar apa yang akan kalian berikan?\" Aku menjawab, \"Pakaianku.\" Dan temanku juga berkata, \"Pakaian milikku.\" Pakaian temanku sebenar lebih bagus dari pakaianku, namun usiaku lebih muda darinya. Bila wanita itu melirik pakaian milik temanku, ia pun terkagum olehnya. Dan ketika melirik kepadaku, aku pun membuatnya terkagum-kagum. Kemudian wanita itu pun berkata, \"Kamu dan pakaianmu telah mencukupiku.\" Maka aku pun tinggal bersamanya selama tiga hari. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang masih memiliki isteri dengan cara mut'ah, maka ceraikanlah",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 3420,
			"arabicnumber": "1406.02",
			"text": "Telah menceritakan kepada kami [Abu Kamil Fudlail bin Husain Al Jahdari] telah menceritakan kepada kami [Bisyr yaitu Ibnu Mufadldlal] telah menceritakan kepada kami [Umarah bin Ghaziyyah] dari [Ar Rabi' bin Sabrah] bahwa [ayahnya] pernah ikut perang Fathu Makkah bersama Rasulullah shallallahu 'alaihi wasallam, dia berkata; Kami tinggal di Makkah selama lima belas hari dan malam, lantas Rasulullah shallallahu 'alaihi wasallam memberikan izin kepada kami melakukan nikah mut'ah. Lalu saya bersama seorang dari kaumku pergi mencari seorang wanita untuk kami nikahi secara mut'ah, saya lebih tampan dari saudaraku yang memang dia agak jelek daripadaku. Masing-masing dari kami membawa kain baju (untuk mas kawin); tetapi baju telah usang, sedangkan baju sepupuku masih baru dan halus. Sesampainya kami di bawah kota Makkah atau di atasnya, kami bertemu seorang wanita muda yang cantik dan berleher panjang. Lantas kami bertanya kepadanya; \"Maukah kamu menerima salah satu dari kami untuk kawin mut'ah denganmu?\" Dia menjawab; \"Apa ganti (maskawin) yang akan kalian berikan?\" Lalu masing-masing dari kami memperlihatkan baju yang telah kami siapkan sebelumnya, sementara itu, wanita tersebut sedang memperhatikan kami berdua, saudara sepupuku melihat kepadanya sambil berkata; \"Sesungguhnya baju yang ini sudah usang, sedangkan bajuku masih bagus dan halus.\" Wanita tersebut berkata; \"Baju usang ini juga tak masalah.\" Dia mengatakannya sampai tiga kali atau dua kali. Kemudian saya nikah mut'ah dengannya. Saya tidak keluar dari (Makkah) sehingga Rasulullah shallallahu 'alaihi wasallam mengharamkannya (untuk selamanya).\" Dan telah menceritakan kepadaku [Ahmad bin Sa'id bin Shakhr Ad Darimi] telah menceritakan kepada kami [Abu An Nu'man] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami ['Umarah bin Ghaziyyah] telah menceritakan kepadaku [Ar Rabi' bin Sabrah Al Juhani] dari [Ayahnya] dia berkata; Kami pernah keluar bersama Rasulullah shallallahu 'alaihi wasallam pada hari penaklukan kota Makkah menuju Makkah, kemudian dia menyebutkan seperti haditsnya Bisyr dengan menambahkan; Gadis itu berkata; \"Apakah hal itu bolah?\" dan ada juga tambahan (kata sepupu Sabrah); \"Sesungguhnya kain burdah yang ini sudah usang",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 3421,
			"arabicnumber": "1406.03",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 3422,
			"arabicnumber": "1406.04",
			"text": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Abdul Aziz bin Umar] telah menceritakan kepadaku [Ar Rabi' bin Sabrah Al Juhani] bahwa [ayahnya] telah menceritakan kepadanya bahwa dia pernah bersama Rasulullah shallallahu 'alaihi wasallam (dalam Fathu Makkah), beliau bersabda: \"Wahai sekalian manusia, sesungguhnya saya pernah mengizinkan kepada kalian nikah mut'ah terhadap wanita, dan sesungguhnya (mulai saat ini) Allah telah mengharamkannya sampai Hari Kiamat, oleh karena itu barangsiapa yang masih memiliki (wanita yang dimut'ah), maka ceraikanlah dia dan jangan kamu ambil kembali apa yang telah kamu berikan padanya.\" Telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] telah menceritakan kepada kami ['Abdah bin Sulaiman] dari [Abdul Aziz bin Umar] dengan isnad ini, dia berkata; saya pernah melihat Rasulullah shallallahu 'alaihi wasallam berdiri di antara rukun (Ka'bah) dan pintu (Ka'bah) seraya bersabda seperti hadits Ibnu Numair",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 3423,
			"arabicnumber": "1406.05",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 3424,
			"arabicnumber": "1406.06",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 3425,
			"arabicnumber": "1406.07",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Abdul Aziz bin Ar-Rabi' bin Sabrah bin Ma'bad] dia berkata; Saya telah mendengar [ayahku, Ar-Rabi' bin Sabrah] menceritakan dari [ayahnya, Sabrah bin Ma'bad] bahwa pada saat penaklukan kota Makkah, Nabiyallah shallallahu 'alaihi wasallam memerintahkan kepada para sahabatnya supaya nikah mut'ah, lantas dia (Sabrah) berkata, kemudian saya bersama temanku dari Bani Sulaim keluar sampai kami bertemu dengan seorang budak perempuan dari Bani 'Amir, sepertinya dia adalah seorang perawan, lantas kami meminangnya sambil memperlihatkan kain burdah kami (sebagai maskawin), lalu dia memandangi kami, dia melihatku, dan ternyata wajahku lebih tampan daripada temanku, namun dia melihat kain burdah temanku lebih bagus daripada kain burdahku, setelah dia meminta izin untuk bermusyawarah beberapa saat, dia memilihku daripada temanku, lalu kami tinggal bersamanya selama tiga hari, kemudian Rasulullah shallallahu 'alaihi wasallam memerintahkan kami untuk menceraikannya",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 3426,
			"arabicnumber": "1406.08",
			"text": "Telah menceritakan kepada kami [Amru An Naqid] dan [Ibnu Numair] keduanya berkata; telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Az Zuhri] dari [Ar Rabi' bin Sabrah] dari [ayahnya] bahwasannya Nabi shallallahu 'alaihi wasallam telah melarang nikah mut'ah",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 3427,
			"arabicnumber": "1406.09",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 3428,
			"arabicnumber": "1406.10",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 3429,
			"arabicnumber": "1406.11",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 3430,
			"arabicnumber": "1406.12",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 3431,
			"arabicnumber": "1407.01",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 3432,
			"arabicnumber": "1407.02",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 3433,
			"arabicnumber": "1407.03",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 3434,
			"arabicnumber": "1407.04",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 3435,
			"arabicnumber": "1407.05",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 3436,
			"arabicnumber": "1408.01",
			"text": "Telah menceritakan kepada kami [Abdullah bin Maslamah Al Qa'nabi] telah menceritakan kepada kami [Malik] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah menikahi perempuan dengan bibinya sekaligus (baik bibi dari saudara ayah atau ibu)",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 3437,
			"arabicnumber": "1408.02",
			"text": "Telah menceritakan kepada kami [Muhammad bin Rumh bin Muhajir] telah mengabarkan kepada kami [Al Laits] dari [Yazid bin Abi Habib] dari ['Irak bin Malik] dari [Abu Hurairah] bahwasannya Rasulullah shallallahu 'alaihi wasallam melarang empat perempuan untuk dipoligami, yaitu menikahi wanita dengan bibinya (dari pihak ayah) sekaligus, dan seorang wanita dengan bibinya dari pihak ibu",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 3438,
			"arabicnumber": "1408.03",
			"text": "Telah menceritakan kepada kami [Abdullah bin Maslamah bin Qa'nab] telah menceritakan kepada kami [Abdurrahman bin Abdul Aziz]. Ibnu Maslamah adalah seorang dari Anshar salah seorang anak Abu Umamah bin Sahl bin Hunaif, dia berkata; dari [ibnu syihab] dari [Qabishah bin Dzuaib] dari [Abu Hurairah] dia berkata; Saya telah medengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah bibi (dari pihak ayah) dinikahi bersamaan dengan putrinya saudara laki-laki dan jangan pula putrinya saudara perempuan dinikahi dengan bibinya (dari pihak ibu) sekaligus",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 3439,
			"arabicnumber": "1408.04",
			"text": "Telah menceritakan kepada kami [Harmalah bin Yahya] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] telah mengabarkan kepadaku [Qabishah bin Dzu`aib Al Ka'bi] bahwa dia pernah mendengar [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam melarang seseorang memoligami perempuan dengan bibinya sekaligus (baik dari saudara ibu atau ayah). [Ibnu Syihab] berkata; kami memandang bibi dari jalur ayah dengan bibi dari jalur ibu sama derajatnya",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 3440,
			"arabicnumber": "1408.05",
			"text": "Telah menceritakan kepadaku [Abu Ma'n Ar Raqasyi] telah menceritakan kepada kami [Khalid bin Harits] telah menceritakan kepada kami [Hisyam] dari [Yahya] bahwa dia pernah menulis sesuatu kepadanya dari [Abu Salamah] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah seorang wanita dipoligami dengan bibinya sekaligus (baik dari saudara ayah atau ibu).\" Dan telah menceritakan kepadaku [Ishaq bin Manshur] telah menceritakan kepada kami [Ubaidullah bin Musa] dari [Syaiban] dari [Yahya] telah menceritakan kepadaku [Abu Salamah] bahwa dia mendengar [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda, seperti hadits di atas",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 3441,
			"arabicnumber": "1408.06",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 3442,
			"arabicnumber": "1408.07",
			"text": "Telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] telah menceritakan kepada kami [Abu Usamah] dari [Hisyam] dari [Muhammad bin Sirin] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Janganlah meminang wanita yang telah dipinang saudaranya, dan janganlah menawar barang yang telah ditawar saudaranya, dan janganlah wanita dipoligami dengan bibinya (baik dari saudara ayah atau ibu), dan janganlah seorang istri meminta suaminya supaya menceraikan madunya agar segala kebutuhannya terpenuhi, akan tetapi biarkanlah suami menikah (sesuai dengan kemampuannya), karena Allah telah menentukan bagiannya sang istri",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 3443,
			"arabicnumber": "1408.08",
			"text": "Telah menceritakan kepadaku [Muhriz bin 'Aun bin Abi 'Aun] telah menceritakan kepada kami [Ali bin Mushir] dari [Daud bin Abi Hind] dari [Ibnu Sirin] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam telah melarang seorang wanita dipoligami dengan bibinya sekaligus (baik dari saudara ayah atau ibu), dan melarang seorang istri meminta kepada suaminya supaya menceraikan madunya agar seluruh kebutuhannya terpenuhi, karena Allah Azza Wa Jalla yang akan memberi rizqi kepadanya",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 3444,
			"arabicnumber": "1408.09",
			"text": "Telah menceritakan kepada kami [Muhammad bin Mutsanna], [Ibnu Basyar] dan [Abu Bakar bin Nafi'] sedangkan lafazhnya dari Ibnu Mutsanna dan Ibnu Nafi' mereka berkata; Telah mengabarkan kepada kami [Ibnu Abi 'Adi] dari [Syu'bah] dari ['Amru bin Dinar] dari [Abu Salamah] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam melarang seorang wanita dipoligami dengan bibinya sekaligus (baik bibi dari saudara ayah atau ibu). Dan telah menceritakan kepadaku [Muhammad bin Hatim] telah menceritakan kepada kami [Syababah] telah menceritakan kepada kami [Warqa'] dari [Amru bin Dinar] dengan isnad seperti ini",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 3445,
			"arabicnumber": "1408.10",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 3446,
			"arabicnumber": "1409.01",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya] dia berkata; Saya membaca di hadapan [Malik] dari [Nafi'] dari [Nubaih bin Wahb] bahwa Umar bin Ubaidillah hendak menikahkan Thalhah bin Umar dengan putri Syaibah bin Jubair, lantas dia mengutus seseorang kepada Aban bin Utsman agar dia bisa hadir (dalam pernikahan), padahal dia sedang memimpin Haji, lantas [Aban] berkata; Saya pernah mendengar [Utsman bin Affan] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang yang sedang berihram tidak diperbolehkan untuk menikahkan, dinikahkan dan meminang",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 3447,
			"arabicnumber": "1409.02",
			"text": "Telah menceritakan kepada kami [Muhammad bin Abi Bakar Al Muqaddami] telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Nafi'] telah menceritakan kepadaku [Nubaih bin Wahb] dia berkata; Umar bin Ubaidillah bin Ma'mar pernah mengutusku, saat itu dia sedang meminang putri Syaibah bin Utsman untuk anaknya, lantas dia mengirimku untuk menemui [Aban bin Utsman] yang sedang berihram pada musim itu, lalu dia berkata; Saya tidak menganggapnya seorang badui, sesungguhnya orang yang berihram dilarang untuk menikahkan dan dinikahkan. Telah mengabarkan kepada kami [Utsman] seperti itu dari Rasulullah shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 3448,
			"arabicnumber": "1409.03",
			"text": "Dan telah menceritakan kepadaku [Abu Ghassan Al Misma'i] telah menceritakan kepada kami [Abdul A'la] Dan diriwayatkan dari jalur lain, telah menceritakan kepadaku [Abu Al Khaththab Ziyad bin Yahya] telah menceritakan kepada kami [Muhammad bin Sawa'] dia berkata; Telah menceritakan kepada kami [Sa'id] dari [Mathar] dan [Ya'la bin Hakim] dari [Nafi'] dari [Nubaih bin Wahb] dari [Aban bin Utsman] dari [Utsman bin Affan] bahwasannya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang yang berihram tidak diperbolehkan untuk menikah dan dinikahkan dan meminang",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 3449,
			"arabicnumber": "1409.04",
			"text": "Dan telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah], [Amru An Naqid] serta [Zuhair bin Harb] semuanya dari [Ibnu Uyainah]. [Zuhair] mengatakan; Telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Ayyub bin Musa] dari [Nubaih bin Wahb] dari [Aban bin Utsman] dari [Utsman] yang dia sampaikan sanadnya kepada Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Orang yang sedang berihram dilarang untuk menikah dan meminang",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 3450,
			"arabicnumber": "1409.05",
			"text": "Telah menceritakan kepada kami [Abdul Malik bin Syu'aib bin Al Laits] telah menceritakan kepadaku [ayahku] dari [kakekku] telah menceritakan kepadaku [Khalid bin Yazid] telah menceritakan kepadaku [Sa'id bin Abi Hilal] dari [Nubaih bin Wahb] bahwa Umar bin Ubaidillah bin Ma'mar hendak menikahkan anaknya yaitu Thalhah dengan putri Syaibah bin Jubair pada waktu haji, sedangkan [Aban bin Utsman] waktu itu menjadi amirul haji (pemandu jama'ah haji), lalu dia mengutus seseorang kepada Aban seraya berkata; Sesungguhnya saya hendak menikahkan Thalhah bin Umar, saya suka jika kamu menghadiri pernikahan tersebut, lantas Aban berkata kepadanya; Tidaklah saya menganggapmu orang iraq yang bermadzhab (namun tidak tahu sunnah), sesungguhnya saya mendengar [Utsman bin 'Affan] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang yang berihram tidak diperbolehkan untuk menikah",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 3451,
			"arabicnumber": "1410.01",
			"text": "Dan Telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah], [Ibnu Numair] dan [Ishaq Al Handlali] semuanya dari [Ibnu 'Uyainah]. [Ibnu Numair] mengatakan; Telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Amru bin Dinar] dari [Abu As Sya'tsa`] bahwa [Ibnu Abbas] telah mengabarkan kepadanya bahwa Nabi shallallahu 'alaihi wasallam menikahi Maimunah padahal beliau sedang berihram, [Ibnu Numair] menambahkan, maka saya menceritakannya kepada [Az Zuhri], maka dia berkata; Telah mengabarkan kepadaku [Yazid bin Al Asham] bahwa beliau menikahinya ketika beliau sedang halal",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 3452,
			"arabicnumber": "1410.02",
			"text": "Dan telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Daud bin Abdurrahman] dari [Amru bin Dinar] dari [Jabir bin Zaid Abu Asy Sya'tsa`] dari [Ibnu Abbas] bahwa dia berkata; Rasulullah shallallahu 'alaihi wasallam menikahi Maimunah ketika beliau sedang berihram",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 3453,
			"arabicnumber": "1411",
			"text": "Telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] telah menceritakan kepada kami [Yahya bin Adam] telah menceritakan kepada kami [Jarir bin Hazim] telah menceritakan kepada kami [Abu Fazarah] dari [Yazid bin Al Asham] telah menceritakan kepadaku [Maimunah binti Al Harits] bahwa Rasulullah shallallahu 'alaihi wasallam menikahinya ketika beliau sedang halal. Dia (Yazid) berkata; dia adalah bibiku dan bibinya Ibnu Abbas juga",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 3454,
			"arabicnumber": "1412.01",
			"text": "Dan telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Al Laits]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Ibnu Rumh] telah mengabarkan kepada kami [Al Laits] dari [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Janganlah sebagian kalian membeli barang yang telah ditawar, dan janganlah sebagian kalian meminang wanita yang telah dipinang",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 3455,
			"arabicnumber": "1412.02",
			"text": "Telah menceritakan kepada kami [Zuhair bin Harb] dan [Muhammad bin Al Mutsanna] semuanya dari [Yahya Al Qatthan], [Zuhair] mengatakan; Telah menceritakan kepada kami [Yahya] dari [Ubaidillah] telah mengabarkan kepadaku [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Janganlah seseorang membeli barang yang telah ditawar oleh saudaranya, dan janganlah seseorang meminang wanita yang telah dipinang oleh saudaranya kecuali telah mendapatkan izin darinya.\" Dan telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] telah menceritakan kepada kami [Ali bin Mushir] dari [Ubaidillah] dengan isnad ini, dan telah menceritakan kepadaku [Abu Kamil Al Jahdari] telah menceritakan kepada kami [Hammad] telah menceritakan kepada kami [Ayyub] dari [Nafi'] dengan isnad seperti ini juga",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 3456,
			"arabicnumber": "1412.03",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 3457,
			"arabicnumber": "1412.04",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 3458,
			"arabicnumber": "1413.01",
			"text": "Dan telah menceritakan kepadaku [Amru An Naqid], [Zuhair bin Harb] dan [Ibnu Abi Umar]. [Zuhair] mengatakan; Telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Az Zuhri] dari [Sa'id] dari [Abu Hurairah] bahwasannya Nabi shallallahu 'alaihi wasallam melarang orang kota bertransaksi dengan orang badui atau transaksi Najasy (yaitu menambah nilai harga barang untuk menipu pembeli) atau meminang seorang wanita yang telah dipinang oleh saudaranya atau membeli barang yang telah ditawar saudaranya, dan janganlah seorang istri meminta suaminya supaya menceraikan madunya agar semua kebutuhannya terpenuhi. Amru di dalam riwayatnya menambahkan; Dan janganlah seseorang menawar harga yang telah ditawar oleh saudaranya",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 3459,
			"arabicnumber": "1413.02",
			"text": "Telah menceritakan kepadaku [Harmalah bin Yahya] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] telah menceritakan kepadaku [Sa'id bin Musayyab] bahwa [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian melakukan transaksi najasy, dan janganlah seseorang membeli barang yang telah dibeli saudaranya, dan janganlah orang kota bertransaksi dengan orang badui, dan janganlah seseorang meminang wanita yang telah dipinang oleh saudaranya, dan janganlah seorang istri meminta suaminya supaya menceraikan madunya agar semua kebutuhannya dapat terpenuhi.\" Dan telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] telah menceritakan kepada kami [Abdul A'la]. Dan diriwayatkan dari jalur lain, telah menceritakan kepadaku [Muhammad bin Rafi'] telah menceritakan kepada kami [Abdur Razzaq] semuanya dari [Ma'mar] dari [Az Zuhri] dengan isnad seperti ini namun dalam haditsnya Ma'mar (menambahkan); \"Dan janganlah seseorang menambah (meninggikan) harga brang yang telah dibeli saudaranya",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 3460,
			"arabicnumber": "1413.03",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 3461,
			"arabicnumber": "1413.04",
			"text": "Telah menceritakan kepada kami [Yahya bin Ayyub], [Qutaibah] dan [Ibnu Hujr], semuanya dari [Isma'il bin Ja'far]. [Ibnu Ayyub] mengatakan; Telah menceritakan kepada kami [Isma'il] telah mengabarkan kepadaku [Al 'Ala`] dari [ayahnya] dari [Abu Hurairah] bahwasannya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah seorang Muslim menawar barang yang telah ditawar saudaranya, dan jangan pula meminang wanita yang telah dipinang oleh saudaranya",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 3462,
			"arabicnumber": "1413.05",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 3464,
			"arabicnumber": "1414",
			"text": "Dan telah menceritakan kepada kami [Abu At Thahir] telah mengabarkan kepada kami [Abdullah bin Wahb] dari [Al Laits] dan lainnya dari [Yazid bin Abi Habib] dari [Abdurrahman bin Syumasah] bahwa dia pernah mendengar [Uqbah bin Amir] di atas minbar berkata; Sesungguhnya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang Mukmin adalah saudara Mukmin lainnya, maka tidak halal bagi seorang Mukmin membeli barang yang telah dibeli (dipesan) saudaranya, dan tidak halal meminang pinangan saudaranya sebelum ditinggalkan",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 3465,
			"arabicnumber": "1415.01",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya] dia berkata; Saya membaca di hadapan [Malik] dari [Nafi'] dari [Ibnu 'Umar] bahwa Rasulullah shallallahu 'alaihi wasallam melarang nikah syighar, yaitu seseorang menikah dengan putri orang lain dengan syarat putrinya harus menikah dengannya tanpa ada maskawin. Dan telah menceritakan kepadaku [Zuhair bin Harb] [Muhammad bin Al Mutsanna] dan [Ubaidullah bin Sa'id] mereka berkata; telah menceritakan kepada kami [Yahya] dari [Ubaidillah] dari [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam seperti hadits di atas, namun dalam hadits Ubaidillah dia menyebutkan; Saya bertanya kepada Nafi'; \"Apa yang dimaksud dengan nikah syighar?",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 3466,
			"arabicnumber": "1415.02",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 3467,
			"arabicnumber": "1415.03",
			"text": "Dan telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Hammad bin Zaid] dari [Abdurrahman As Sarraj] dari [Nafi'] dari [Ibnu Umar] bahwasannya Rasulullah shallallahu 'alaihi wasallam melarang melakukan nikah syighar",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 3468,
			"arabicnumber": "1415.04",
			"text": "Dan telah menceritakan kepadaku [Muhammad bin Rafi'] telah menceritakan kepada kami [Abdur Razzaq] telah mengabarkan kepada kami [Ma'mar] dari [Ayyub] dari [Nafi'] dari [Ibnu Umar] bahwasannya Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak ada nikah syighar dalam Islam",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 3469,
			"arabicnumber": "1416.01",
			"text": "Telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] telah menceritakan kepada kami [Ibnu Numair] dan [Abu Usamah] dari [Ubaidillah] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam melarang melakukan nikah syighar, Ibnu Numair menambahkan, nikah syighar adalah seseorang mengatakan kepada laki-laki lain; Nikahkanlah putrimu denganku, niscaya aku akan menikahkan putriku untukmu, atau nikahkanlah sudara perempuanmu denganku, maka saya akan nikahkan saudara perempuanku denganmu. Dan telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami ['Abdah] dari [Ubaidillah] dia adalah Ibnu Umar dengan isnad ini, dan dia tidak menyebutan tambahan Ibnu Numair",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 3470,
			"arabicnumber": "1416.02",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 3471,
			"arabicnumber": "1417",
			"text": "Telah menceritakan kepadaku [Harun bin Abdillah] telah menceritakan kepada kami [Hajjaj bin Muhammad] dia berkata; [Ibnu Juraij] berkata. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Ishaq bin Ibrahim] dan [Muhammad bin Rafi'] dari [Abdur Razzaq] telah mengabarkan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Abu Az Zubair] bahwa dia mendengar [Jabir bin Abdillah] berkata; Rasulullah shallallahu 'alaihi wasallam melarang nikah syighar",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 3472,
			"arabicnumber": "1418",
			"text": "Telah menceritakan kepada kami [Yahya bin Ayyub] telah menceritakan kepada kami [Husyaim]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [Waki']. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] telah menceritakan kepada kami [Abu Khalid Al Ahmar]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Yahya yaitu Al Qaththan] dari [Abdul Hamid bin Ja'far] dari [Yazid bin Abi Habib] dari [Martsad bin Abdillah Al Yazani] dari ['Uqbah bin Amir] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya syarat yang paling layak untuk dipenuhi adalah syarat untuk menghalalkan kemaluan (untuk bersenggama).\" Ini adalah lafazh hadits Abu Bakar dan Ibnu Al Mutsanna namun Ibnu Al Mutsanna menyebutkan; \"syarat-syarat\" (dalam bentuk jamak)",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 3473,
			"arabicnumber": "1419.01",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 3474,
			"arabicnumber": "1419.02",
			"text": "Telah menceritakan kepadaku [Ubaidullah bin umar bin Maisarah Al Qawariri] telah menceritakan kepada kami [Khalid bin Harits] telah menceritakan kepada kami [Hisyam] dari [Yahya bin Abi Katsir] telah menceritakan kepada kami [Abu Salamah] telah menceritakan kepada kami [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah menikahkan seorang janda sebelum meminta persetujuannya, dan janganlah menikahkan anak gadis sebelum meminta izin darinya.\" Mereka bertanya; \"Wahai Rasulullah, bagaimana mengetahui izinnya?\" Beliau menjawab: \"Dia diam.\" Dan telah menceritakan kepadaku [Zuhair bin Harb] telah menceritakan kepada kami [Isma'il bin Ibrahim] telah menceritakan kepada kami [Hajjaj bin Abi Utsman]. Dan diriwayatkan dari jalur lain, telah menceritakan kepadaku [Ibrahim bin Musa] telah mengabarkan kepada kami [Isa yaitu Ibnu Yunus] dari [Al Auza'i]. Dan diriwayatkan dari jalur lain, telah menceritakan kepadaku [Zuhair bin Harb] telah menceritakan kepada kami [Husain bin Muhammad] telah menceritakan kepada kami [Syaiban]. Dan diriwayatkan dari jalur lain, telah menceritakan kepadaku [Amru An Naqid] dan [Muhammad bin Rafi'] keduanya berkata; Telah menceritakan kepada kami [Abdur Razzaq] dari [Ma'mar] Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Abdullah bin Abdurrahman Ad Darimi] telah mengabarkan kepada kami [Yahya bin Hasan] telah menceritakan kepada kami [Mu'awiyah] semuanya dari [Yahya bin Abi Katsir] seperti makna hadits Hisyam beserta isnadnya. Lafazh hadits ini juga sesuai dengan hadits Hisyam, Syaiban dan Mu'awiyah bin Salam",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 3475,
			"arabicnumber": "1420",
			"text": "Telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] telah menceritakan kepada kami [Abdullah bin Idris] dari [Ibnu Juraij]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Ishaq bin Ibrahim] dan [Muhammad bin Rafi'] semuanya dari [Abdur Razzaq] sedangkan lafazhnya dari [Ibnu Rafi'] telah menceritakan kepada kami [Abdur Razzaq] telah mengabarkan kepada kami [Ibnu Juraij] dia berkata; Saya pernah mendengar [Ibnu Abi Mulaikah] berkata; [Dzakwan, mantan sahay 'Aisyah] berkata; Saya telah mendengar ['Aisyah] berkata; \"Saya bertanya kepada Rasulullah shallallahu 'alaihi wasallam mengenai seorang gadis yang dinikahkan oleh keluarganya, apakah harus meminta izin darinya atau tidak?\" Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Ya, dia dimintai izin.\" 'Aisyah berkata; Lalu saya berkata kepada beliau; \"Sesungguhnya dia malu (mengemukakannya).\" Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika dia diam, maka itulah izinnya",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 3476,
			"arabicnumber": "1421.01",
			"text": "Telah menceritakan kepada kami [Sa'id bin Manshur] dan [Qutaibah bin Sa'id] keduanya berkata; Telah menceritakan kepada kami [Malik] Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Yahya bin Yahya] sedangkan lafazhnya dari dia (Yahya), dia berkata; Saya bertanya kepada [Malik]; Apakah [Abdullah bin Fadll] pernah menceritakan kepadamu dari [Nafi' bin Jubair] dari [Ibnu Abbas] bahwa Nabi shallallahu 'alaihi wasallam telah bersabda: \"Seorang janda lebih berhak atas dirinya daripada walinya, sedangkan anak gadis harus di mintai izin darinya, dan izinnya adalah diamnya\"? Dia menjawab; \"Ya",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 3477,
			"arabicnumber": "1421.02",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 3478,
			"arabicnumber": "1421.03",
			"text": "Dan telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Sufyan] dari [Ziyad bin Sa'ad] dari [Abdullah bin Fadll] bahwa dia mendengar [Nafi' bin Jubair] mengabarkan dari [Ibnu Abbas] bahwasannya Nabi shallallahu 'alaihi wasallam bersabda: \"Seorang janda lebih berhak atas dirinya daripada walinya, sedangkan perawan (gadis) harus dimintai izin darinya, dan diamnya adalah izinnya.\" Dan telah menceritakan kepada kami [Ibnu Abi Umar] telah menceritakan kepada kami [Sufyan] dengan isnad ini, beliau bersabda: \"Seorang janda lebih berhak atas dirinya daripada walinya, sedangkan perawan (gadis), maka ayahnya harus meminta persetujuan atas dirinya, dan persetujuannya adalah diamnya.\" Atau mungkin beliau bersabda: \"Dan diamnya adalah persetujuannya",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 3479,
			"arabicnumber": "1422.01",
			"text": "Telah menceritakan kepada kami [Abu Kuraib Muhammad bin Al 'Ala`] telah menceritakan kepada kami [Abu Usamah]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] dia berkata; Saya mendapatkan dalam kitabku dari [Abu Usamah] dari [Hisyam] dari [ayahnya] dari ['Aisyah] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam menikahiku waktu saya berumur enam tahun, dan memboyongku (membina rumah tangga denganku) ketika saya berusia sembilan tahun.\" 'Aisyah berkata; \"Sesampainya di Madinah, saya jatuh sakit selama sebulan, hingga rambutku pada rontok. setelah sembuh, Ummu Ruman mendatangiku, ketika itu saya sedang bermain-main bersama kawan-kawanku, lantas dia memanggilku, dan saya mendatanginya, namun saya tidak tahu apa yang dia inginkan dariku, kemudian dia memegang tanganku dan membawaku sampai ke pintu rumah, (saya terengah-engah) sambil menarik nafas; hah…hah… sehingga nafasku lega kembali. Kamudian saya dibawa masuk kedalam rumah, tiba-tiba di sana telah menunggu beberapa wanita Anshar. Mereka mengucapkan selamat dan kebaikan kepadaku, lantas Ummu Ruman menyerahkanku kepada mereka, akhirnya mereka membersihkan kepalaku dan mendandaniku, pada waktu dluha, betapa terkejutnya saya ketika melihat Rasulullah shallallahu 'alaihi wasallam muncul di tempat kami, kemudian mereka menyerahkanku kepada beliau",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 3480,
			"arabicnumber": "1422.02",
			"text": "Dan telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Abu Mu'awiyah] dari [Hisyam bin 'Urwah]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Ibnu Numair] sedangkan lafazhnya dari dia, telah menceritakan kepada kami ['Abdah yaitu Ibnu Sulaiman] dari [Hisyam] dari [ayahnya] dari ['Aisyah] dia berkata; \"Nabi shallallahu 'alaihi wasallam menikahiku ketika saya berumur enam tahun, dan beliau memboyongku (membina rumah tangga denganku) ketika saya berumur sembilan tahun",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 3481,
			"arabicnumber": "1422.03",
			"text": "Telah menceritakan kepada kami [Abd bin Humaid] telah mengabarkan kepada kami [Abdur Razzaq] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari ['Urwah] dari ['Aisyah]; \"Bahwa Nabi shallallahu 'alaihi wasallam menikahinya, ketika dia berusia enam tahun, dan dia diantar ke kamar beliau ketika berusia sembilan tahun, dan ketika itu dia sedang membawa bonekanya, sedangkan beliau wafat darinya ketika dia berusia delapan belas tahun",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 3482,
			"arabicnumber": "1422.04",
			"text": "Dan telah menceritakan kepada kami [Yahya bin Yahya], [Ishaq bin Ibrahim], [Abu Bakar bin Abi Syaibah] dan [Abu Kuraib]. [Yahya] dan [Ishaq] mengatakan; Telah mengabarkan kepada kami, sedangkan yang dua mengatakan; Telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Ibrahim] dari [Al Aswad] dari ['Aisyah] dia berkata bahwa Rasulullah shallallahu 'alaihi wasallam menikahinya ketika dia berusia enam tahun dan berumah tangga dengannya ketika berusia sembilan tahun dan tatkala beliau wafat dia berusia delapan belas tahun",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 3483,
			"arabicnumber": "1423.01",
			"text": "Telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] dan [Zuhair bin Harb] sedangkan lafazhnya dari Zuhair keduanya berkata; Telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Sufyan] dari [Isma'il bin Umayah] dari [Abdullah bin Urwah] dari [Urwah] dari ['Aisyah] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam menikahiku pada bulan Syawal, dan mulai berumah tangga bersamaku pada bulan Syawal, maka tidak ada di antara istri-istri Rasulullah shallallahu 'alaihi wasallam yang lebih mendapatkan keberuntungan daripadaku.\" Perawi berkata; \"Oleh karena itu, 'Aisyah sangat senang menikahkan para wanita di bulan Syawal.\" Dan telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Sufyan] dengan isnad seperti ini, namun dia tidak menyebutkan perbuatan 'Aisyah",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 3484,
			"arabicnumber": "1423.02",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 3485,
			"arabicnumber": "1424.01",
			"text": "Telah menceritakan kepada kami [Ibnu Abi Umar] telah menceritakan kepada kami [Sufyan] dari [Yazid bin Kaisan] dari [Abu Hazim] dari [Abu Hurairah] dia berkata; \"Saya pernah berada di samping Nabi shallallahu 'alaihi wasallam, tiba-tiba seorang laki-laki datang kepada beliau seraya mengabarkan bahwa dirinya akan menikahi seorang wanita dari Anshar.\" Lantas Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Apakah kamu telah melihatnya? Dia menjawab; Tidak. Beliau melanjutkan: \"Pergi dan lihatlah kepadanya, sesungguhnya di mata orang-orang Anshar ada sesuatu",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 3486,
			"arabicnumber": "1424.02",
			"text": "Telah menceritakan kepada kami [Yahya bin Ma'in] telah menceritakan kepada kami [Marwan bin Mu'awiyah Al Fazari] telah menceritakan kepada kami [Yazid bin Kaisan] dari [Abu Hazim] dari [Abu Hurairah] dia berkata; \"Seorang laki-laki datang menemui Rasulullah shallallahu 'alaihi wasallam seraya berkata; \"Sesungguhnya saya akan menikahi wanita dari Anshar.\" Lantas Nabi shallallahu 'alaihi wasallam balik bertanya kepadanya: \"Apakah kamu telah melihatnya? karena di mata orang-orang Anshar ada sesuatu. Dia menjawab; \"Ya saya telah melihatnya.\" Beliau bertanya lagi; \"Dengan maskawin berapa kamu menikahinya?\" Dia mejawab; \"Dengan empat uqiyah\". Lantas Nabi shallallahu 'alaihi wasallam bersabda kepadanya: \"Dengan empat uqiyyah? seakan-akan kalian memahat perak dari sisi gunung ini. Kami tidak memiliki sebanyak itu untuak diberikan kepadamu, namun suatu saat kami akan mengutusmu mengikuti suatu peperangan sehingga kamu bisa mendapatkan ghanimah.\" Maka tatkala beliau mengutus rombongan perang ke Bani Abs, beliau mengutus orang itu bersama mereka",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 3487,
			"arabicnumber": "1425.01",
			"text": "Dan telah menceritakan kepada kami [Qutaibah bin Sa'id Ats Tsaqafi] telah menceritakan kepada kami [Ya'qub yaitu Ibnu Abdirrahman Al Qari] dari [Abu Hazim] dari [Sahl bin Sa'd]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Abdul Aziz bin Abi Hazim] dari [ayahnya] dari [Sahl bin Sa'd As Sa'idi] dia berkata; Seorang wanita datang menemui Rasulullah shallallahu 'alaihi wasallam seraya berkata; \"Wahai Rasulullah, saya datang untuk menyerahkan diriku kepadamu.\" Maka Rasulullah shallallahu 'alaihi wasallam melihat wanita tersebut dari atas sampai ke bawah lalu menundukkan kepalanya. Kemudian wanita tersebut duduk setelah melihat beliau tidak memberi tanggapan apa-apa, maka berdirilah salah seorang sahabatnya sambil berkata; \"Wahai Rasulullah, jika anda tidak berminat dengannya, maka nikahkanlah saya dengannya.\" Beliau bersabda: \"Adakah kamu memiliki sesuatu sebagai maskawinnya?\" Jawab orang itu; \"Tidak, demi Allah wahai Rasulullah.\" Beliau bersabda: \"Temuilah keluargamu, barangkali kamu mendapati sesuatu (sebagai maskawin).\" Lantas dia pergi menemui keluarganya, kemudian dia kembali dan berkata; \"Demi Allah, saya tidak mendapatkan sesuatu pun.\" Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Cobalah kamu cari, walaupun hanya cincin dari besi.\" Lantas dia pergi lagi dan kembali seraya berkata; \"Demi Allah wahai Rasulullah, saya tidak mendapatkan apa pun walau hanya cincin dari besi, akan tetapi, ini kain sarungku. -Kata Sahl; Dia tidak memiliki kain sarung kecuali yang dipakainya-. Ini akan kuberikan kepadanya setengahnya (sebagai maskawin) \". Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apa yang dapat kamu perbuat dengan kain sarungmu? Jika kamu memakainya, dia tidak dapat memakainya, dan jika dia memakainya, kamu tidak dapat memakainya.\" Oleh karena itu, laki-laki tersebut duduk termenung, setelah agak lama duduk, dia berdiri, ketika Rasulullah shallallahu 'alaihi wasallam melihat dia hendak pergi, beliau menyuruh agar dia dipanggil untuk menemuinya. Tatkala dia datang, beliau bersabda: \"Apakah kamu hafal sesuatu dari Al Qur'an?\" Dia menjawab; \"Saya hafal surat ini dan ini -sambil menyebutkannya- beliau bersabda: \"Apakah kamu hafal di luar kepala?\" Dia menjawab; \"Ya\". Beliau bersabda: \"Bawalah dia, saya telah nikahkan kamu dengannya, dengan maskawin mengajarkan Al Qur'an yang kamu hafal.\" Ini adalah hadits Ibnu Abi Hazim dan hadits Ya'qub lafazhnya hampir sama dengan hadits ini. Dan telah menceritakan kepada kami [Khalf bin Hisyam] telah menceritakan kepada kami [Hammad bin Zaid]. Dan diriwayatkan dari jalur lain, telah menceritakan kepadaku [Zuhair bin Harb] telah menceritakan kepada kami [Sufyan bin 'Uyainah]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Ishaq bin Ibrahim] dari [Ad Darawardi]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] telah menceritakan kepada kami [Husain bin Ali] dari [Za`idah] semuanya dari [Abu Hazim] dari [Sahl bin Sa'd] dengan hadits ini, sebagian yang satu menambahkan atas sebagian yang lain. Namun dalam hadits Za`idah dia menyebutkan sabda beliau; \"Pergilah kepadanya, saya telah nikahkan kamu kepadanya, maka ajarilah dia surat dari Al Qur'an",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 3488,
			"arabicnumber": "1425.02",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 3489,
			"arabicnumber": "1426",
			"text": "Telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Abdul Aziz bin Muhammad] telah menceritakan kepadaku [Yazid bin Abdullah bin Usamah bin Mahdi]. Dan diriwayatkan dari jalur lain, telah menceritakan kepadaku [Muhammad bin Abi Umar Al Makki] sedangkan lafazhnya dari dia, telah menceritakan kepada kami [Abdul Aziz] dari [Yazid] dari [Muhammad bin Ibrahim] dari [Abu Salamah bin Abdurrahman] bahwa dia berkata; Saya pernah bertanya kepada ['Aisyah], istri Nabi shallallahu 'alaihi wasallam; \"Berapakah maskawin Rasulullah shallallahu 'alaihi wasallam?\" Dia menjawab; \"Mahar beliau terhadap para istrinya adalah dua belas uqiyah dan satu nasy. Tahukah kamu, berapakah satu nasy itu?\" Abu Salamah berkata; Saya menjawab; \"Tidak.\" 'Aisyah berkata; \"Setengah uqiyah, jumlahnya sama dengan lima ratus dirham. Demikianlah maskawin Rasulullah shallallahu 'alaihi wasallam untuk masing-masing istri beliau",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 3490,
			"arabicnumber": "1427.01",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya At Tamimi], [Abu Ar Rabi' Sulaiman bin Daud Al 'Ataki] dan [Qutaibah bin Sa'id] sedangkan lafazhnya dari Yahya. [Yahya] mengatakan; Telah mengabarkan kepada kami, sedangkan dua yang lainnya mengatakan; Telah menceritakan kepada kami [Hammad bin Zaid] dari [Tsabit] dari [Anas bin Malik] bahwasannya Nabi shallallahu 'alaihi wasallam melihat bekas kuning pada Abdurrahman bin Auf, maka beliau bersabda: \"Apa ini?\" Dia menjawab; \"Wahai Rasulullah, sesungguhnya saya baru menikahi wanita dengan maskawin seberat biji kurma.\" Lalu beliau bersabda: \"Semoga Allah memberkati perkawinanmu, adakanlah walimah walaupun hanya dengan seekor kambing",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 3491,
			"arabicnumber": "1427.02",
			"text": "Dan telah menceritakan kepada kami [Muhammad bin 'Ubaid Al Ghubari] telah menceritakan kepada kami [Abu 'Awanah] dari [Qatadah] dari [Anas bin Malik] bahwa Abdurrahman bin 'Auf menikah dengan maskawin emas seberat biji kurma pada masa Rasulullah shallallahu 'alaihi wasallam, lantas Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Adakanlah walimah walaupun hanya dengan seekor kambing",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 3492,
			"arabicnumber": "1427.03",
			"text": "Dan telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Waki'] telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dan [Humaid] dari [Anas] bahwa Abdurrahman bin 'Auf menikahi seorang wanita dengan maskawin emas seberat biji kurma, dan Nabi shallallahu 'alaihi wasallam bersabda kepadanya: \"Adakanlah walimah walaupun hanya dengan seekor kambing.\" Dan telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Abu Daud]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Muhammad bin Rafi'] dan [Harun bin Abdullah] keduanya berkata; Telah menceritakan kepada kami [Wahb bin Jarir]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Ahmad bin Khirasy] telah menceritakan kepada kami [Syababah] semuanya dari [Syu'bah] dari [Humaid] dengan isnad seperti ini, namun dalam hadits Wahb, dia menyebutkan; Abdurrahman berkata; \"Saya telah menikahi seorang wanita",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 3493,
			"arabicnumber": "1427.04",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 3494,
			"arabicnumber": "1427.05",
			"text": "Dan telah menceritakan kepada kami [Ishaq bin Ibrahim] dan [Muhammad bin Qudamah] keduanya berkata; Telah mengabarkan kepada kami [An Nadlr bin Syumail] telah menceritakan kepada kami [Syu'bah] telah menceritakan kepada kami [Abdul Aziz bin Shuhaib] dia berkata; Saya mendengar [Anas] berkata, Abdurrahman bin Auf berkata; Rasulullah shallallahu 'alaihi wasallam melihat wajahku seakan-akan berseri-seri di hari pernikahanku, maka saya berkata; \"Saya telah menikahi seorang wanita Anshar.\" Lantas beliau bersabda: \"Berapakah kamu memberikan maskawinnya?\" Saya menjawab; \"Nawat (nilai seharga lima dirham).\" Dalam hadits Ishaq disebutkan; \"Dari emas",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 3495,
			"arabicnumber": "1427.06",
			"text": "Dan telah menceritakan kepada kami [Ibnu Al Mutsanna] telah menceritakan kepada kami [Abu Daud] telah menceritakan kepada kami [Syu'bah] namanya adalah [Abdurrahman bin Abi Abdillah] dari [Anas bin Malik] bahwasannya Abdurrahman menikahi seorang wanita dengan maskawin emas seberat biji kurma. Dan telah menceritakan kepadaku [Muhammad bin Rafi'] telah menceritakan kepada kami [Wahb] telah mengabarkan kepada kami [Syu'bah] dengan isnad ini namun dia menyebutkan; Maka seorang laki-laki dari anaknya Abdurrahman bin Auf berkata; \"Dari emas",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 3496,
			"arabicnumber": "1427.07",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 3497,
			"arabicnumber": "1365.03",
			"text": "Telah menceritakan kepadaku [Zuhair bin Harb] telah menceritakan kepada kami [Isma'il] yaitu Ibnu 'Ulayyah dari [Abdul Aziz] dari [Anas] bahwasannya Rasulullah shallallahu 'alaihi wasallam pernah memerangi Khaibar, dia berkata; Lalu kami Shalat Shubuh dekat negeri tersebut, setelah shalat beliau mengendarai kendaraannya, Abu Thalhah juga mengendarai kendaraannya sedangkan saya membonceng Abu Thalhah, ketika beliau melewati gang di Khaibar, beliau memacu kendaraannya sampai lututku bersentuhan dengan paha Nabi shallallahu 'alaihi wasallam dan saya melihat putihnya paha Nabiyullah shallallahu 'alaihi wasallam. Tatkala beliau memasuki perkampungan, beliau mengucapkan: \"Allahu akbar, takluklah Khaibar, 'maka apabila siksaan itu turun di halaman mereka, maka amat buruklah pagi hari yang dialami oleh orang-orang yang beri peringatan itu',.\" Beliau mengulangi ucapannya itu sampai tiga kali. Anas melanjutkan; Penduduk (Khaibar) mulai keluar menuju tempat mereka bekerja, lantas mereka berteriak; \"Muhammad! Demi Allah (pasukannya telah datang).\" Abdul Aziz berkata; Sebagian dari sahabat kami menyebutkan; (mereka berteriak); Muhammad dan bala tentaranya (telah datang)!. Dia (Anas) berkata; Mereka kami taklukkan dengan kekuatan dan seluruh tawanan telah kami kumpulan. Tiba-tiba Dihyah datang kepada beliau dan berkata; \"Wahai Rasulullah, berilah saya budak perempuan dari tawanan tersebut!\" beliau bersabda: \"Pergilah dan ambilah budak perempuan darinya.\" Lantas dia membawa Shafiyah binti Huyay, kemudian datanglah seorang laki-laki kepada Nabi shallallahu 'alaihi wasallam dan berkata; \"Wahai Nabiyallah, kenapa anda mengasihkan Shafiyah kepada dihyah? Padahal dia adalah putri Huyay tokoh Bani Quraidlah dan Nadlir, dan dia tidaklah pantas untuk orang lain selain anda.\" Beliau bersabda: \"Suruh dia kembali.\" Anas melanjutkan; Lalu Dihyah datang dengan membawa Shafiyah, tatkala Nabi shallallahu 'alaihi wasallam melihatnya, beliau bersabda: \"Ambillah budak perempuan yang lain dari tawanan tersebut.\" Anas berkata; Lantas beliau memerdekannya dan menikahinya. Tsabit berkata kepadanya; \"Wahai Abu Hamzah, apakah maskawin beliau kepadanya?\" Dia menjawab; \"Diri Shafiyah sendiri, yaitu dengan memerdekannya kemudian menikahinya.\" Dalam perjalanan pulang, Ummu Sulaim mempersiapkannya dan menyerahkannya malam itu kepada beliau. Di pagi harinya, Nabi shallallahu 'alaihi wasallam mengadakan pesta pernikahan seraya bersabda: \"Siapa yang memiliki sesuatu, bawalah kesini.\" Anas berkata; \"Kemudian beliau membentangkan tikar dari kulit, maka ada orang yang membawa susu kering, ada yang membawa kurma dan ada pula yang membawa minyak samin, kemudian mereka mencampurnya, itulah jamuan walimah pernikahan Rasulullah shallallahu 'alaihi wasallam",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 3498,
			"arabicnumber": "1365.04",
			"text": "Dan telah menceritakan kepada kami [Abu Ar Rabi' Az Zahrani] telah menceritakan kepada kami [Hammad yaitu Ibnu Zaid] dari [Tsabit] dan [Abdul Aziz bin Shuhaib] dari [Anas] Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Hammad] yaitu Ibnu Zaid, dari [Tsabit] dan [Syu'aib bin Habhab] dari [Anas]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Abu 'Awanah] dari [Qatadah] dan [Abdul Aziz] dari [Anas]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Muhammad bin 'Ubaid Al Ghubari] telah menceritakan kepada kami [Abu 'Awanah] dari [Abu 'Utsman] dari [Anas]. Dan diriwayatkan dari jalur lain, telah menceritakan kepadaku [Zuhair bin Harb] telah menceritakan kepada kami [Mu'adz bin Hisyam] telah menceritakan kepadaku [ayahku] dari [Syu'aib bin Al Habhab] dari [Anas]. Dan diriwayatkan dari jalur lain, telah menceritakan kepadaku [Muhammad bin Rafi'] telah menceritakan kepada kami [Yahya bin Adam] dan [Umar bin Sa'd] serta [Abdur Razzaq] semuanya dari [Sufyan] dari [Yunus bin 'Ubaid] dari [Syu'aib bin Al Habhab] dari [Anas] dan semuanya dari Nabi shallallahu 'alaihi wasallam, bahwa beliau telah memerdekakan Shafiyyah kemudian beliau menjadikan pembebasannya itu sebagai maskawinnya. Dan dalam hadits [Mu'adz] dari [ayahnya] bahwa beliau telah menikahi Shafiyah sedangkan maskawinnya dengan memerdekakannya",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 3500,
			"arabicnumber": "1365.05",
			"text": "Telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Hammad bin Salamah] telah menceritakan kepada kami [Tsabit] dari [Anas] dia berkata; \"Saya membonceng Abu Thalhah pada waktu perang Khaibar, sedangkan kakiku bersentuhan dengan kaki Rasulullah shallallahu 'alaihi wasallam.\" Anas melanjutkan; Kemudian kami mendatangi mereka (penduduk Khaibar) sebelum matahari terbit, sedangkan mereka (penduduknya) telah keluar ke jalan-jalan mereka dan ke tempat-tempat mereka bekerja, maka mereka berteriak; \"Muhammad dan tentaranya telah datang!?.\" Anas melanjutkan; Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila siksaan itu turun di halaman mereka, maka amat buruklah pagi hari yang dialami oleh orang-orang yang beri peringatan itu.\" Anas melanjutkan; Kemudian Allah Azza Wa Jalla mengalahkan mereka, dan Dihyah menawan seorang budak perempuan yang cantik, Maka Rasulullah shallallahu 'alaihi wasallam membeli budak tersebut dengan tujuh sahaya, lalu beliau menyerahkannya kepada Ummu Sulaim supaya dia melayaninya dan mempersiapkannya. Tsabit berkata; Saya kira Anas berkata; Lalu dia menunggu masa iddah di rumahnya, dia adalah Shafiyah putri Huyay. Anas berkata; Kemudian Rasulullah shallallahu 'alaihi wasallam mengadakan walimah (pesta pernikahan) dengan kurma, susu kering dan minyak samin, lalu dibentangkannya tikar yang terbuat dari kulit di atas bumi, dan dihidangkannya susu kering dan minyak samin, maka orang-orang merasa kenyang dengannya. Anas berkata; Orang-orang sama berkata; \"Kami tidak tahu, apakah beliau menikahinya atau hanya sekedar menjadikannya sebagai Ummu Walad (yaitu budak perempuan yang lahir dari hasil hubungan ibunya dan tuannya), sebagian mereka menjawab; \"Jika beliau menutupinya (mengenakannya hijab), berarti dia adalah istrinya, tapi jika beliau tidak menutupinya, berarti statsusnya adalah Ummu Walad.\" Tatkala beliau hendak menaiki kendaraannya, beliau menutupi Shafiyah, kemudian dia duduk di belakang punggung kendaraannya, lantas orang-orang tahu bahwa beliau telah menikahinya. Ketika sudah dekat dengan Madinah, Rasulullah shallallahu 'alaihi wasallam mendahului kami. Anas berkata; Tiba-tiba unta beliau yang bernama Al 'Adlba` tergelincir, sehingga posisi Rasulullah shallallahu 'alaihi wasallam bergeser, dan (Shafiyah) pun terjatuh, lantas beliau bangun dan menutupi Shafiyah. Dan para wanita memanjangkan lehernya sambil mengatakan; \"Semoga Allah menjauhkan wanita Yahudi ini.\" Tsabit berkata; Saya bertanya; \"Wahai Abu Hamzah, apakah Rasulullah shallallahu 'alaihi wasallam telah menggaulinya?\" Dia menjawab; \"Demi Allah, beliau telah menggaulinya",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 3501,
			"arabicnumber": "1365.06",
			"text": "Telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] telah menceritakan kepada kami [Syababah] telah menceritakan kepada kami [Sulaiman] dari [Tsabit] dari [Anas]. Dan diriwayatkan dari jalur lain, telah menceritakan kepadau [Abdullah bin Hasyim bin Hayyan] sedangkan lafazhnya dari dia, telah menceritakan kepada kami [Bahz] telah menceritakan kepada kami [Sulaiman bin Mughirah] dari [Tsabit] telah menceritakan kepada kami [Anas] dia berkata; \"(ketika perang Khaibar) Shafiyah menjadi bagiannya Dihyah, lantas orang-orang memujinya di hadapan Rasulullah shallallahu 'alaihi wasallam.\" Anas berkata; Mereka berkata; \"Kami tidak pernah melihat ada tawanan perang seperti dia.\" Anas melanjutkan; Kemudian beliau mengutus kepada Dihyah, maka Dihyah membawa (Shafiyah) kepada beliau, kemudian beliau menyerahkannya kepada ibuku, beliau bersabda: \"Dandanilah dia.\" Anas berkata; Kemudian Rasulullah shallallahu 'alaihi wasallam keluar menuju Khaibar, sesampainya beliau di tengah-tengah kota (Khaibar) beliau singgah dan membuat tenda besar, di pagi harinya beliau bersabda: \"Barangsiapa memiliki perbekalan yang lebih, hendaknya ia membawanya ke sini.\" Lantas seseorang datang dengan membawa kurma dan adonan sawiq, kemudian mereka mencampurnya di dalam tungku yang agak tinggi hingga menjadi hais (yaitu makanan dari adonan susu kering, minyak samin dan kurma). Kemudian mereka memakannya dan minum dari telaga buatan untuk menampung air hujan. Anas berkata; Demikianlah pesta pernikahan Rasulullah shallallahu 'alaihi wasallam dengan Shafiyah. Dia melanjutkan; Kemudian kami melanjutkan perjalanan kami, ketika kami melihat dinding Madinah, kami bersemangat dan langsung memacu tunggangan kami, begitu juga dengan Rasulullah shallallahu 'alaihi wasallam, beliau juga memacu tunggangannya. Anas berkata; Sedangkan Shafiyah membonceng di belakang Rasulullah shallallahu 'alaihi wasallam. Anas melanjutkan; Tiba-tiba tunggangan Rasulullah shallallahu 'alaihi wasallam tergelincir hingga beliau terjatuh, begitu juga dengan Shafiyah. Anas melanjutkan; Dan tidak satu pun orang-orang yang melihatnya dan melihat Shafiyah, sehingga Rasulullah shallallahu 'alaihi wasallam bangun dan menutupi Shafiyah. Anas berkata; Kemudian kami mendatanginya, namun beliau bersabda: \"Tidak apa-apa.\" Kami pun memasuki kota Madinah, sedangkan para budak wanita milik istri-istrinya keluar melihat (Shafiyah) dan menghibur atas musibah yang menimpanya",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 3502,
			"arabicnumber": "1428.01",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 3503,
			"arabicnumber": "1428.02",
			"text": "Telah menceritakan kepada kami [Abu Ar Rabi' Az Zahrani] dan [Abu Kamil Fudlail bin Husain] serta [Qutaibah bin Sa'id] mereka berkata; Telah menceritakan kepada kami [Hammad] dia adalah Ibnu Zaid dari [Tsabit] dari [Anas] dan dalam riwayatnya Abu Kamil saya mendengar Anas berkata; \"Saya tidak pernah melihat Rasulullah shallallahu 'alaihi wasallam mengadakan jamuan makan (walimah) terhadap para istrinya -Abu kamil berkata- terhadap para istri-istrinya, seperti jamuan yang beliau adakan waktu menikahi Zainab. Ketika itu beliau menyembelih kambing",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 3504,
			"arabicnumber": "1428.03",
			"text": "Telah menceritakan kepada kami [Muhammad bin Amru bin 'Abbad bin Jabalah bin Abi Rawwad] dan [Muhammad bin Basyar] keduanya berkata; Telah menceritakan kepada kami [Muhamad] dia adalah Ibnu Ja'far, telah menceritakan kepada kami [Syu'bah] dari [Abdul Aziz bin Shuhaib] dia berkata; Saya mendengar [Anas bin Malik] berkata; \"Tidaklah Rasulullah shallallahu 'alaihi wasallam mengadakan pesta perkawinan terhadap para istrinya lebih banyak atau lebih utama dari pesta pernikahan yang beliau adakan untuk Zainab.\" Tsabit Al Bunani berkata; \"Dengan apa beliau memeriahkan pesta perniakahannya?\" Dia menjawab; \"Beliau membuat orang-orang kenyang dengan roti dan daging, sampai mereka meninggalkannya (masih banyak yang tersisa)",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 3505,
			"arabicnumber": "1428.04",
			"text": "Telah menceritakan kepada kami [Yahya bin Habib Al Haritsi], ['Ashim bin Nadlr At Taimi] dan [Muhammad bin Abdul A'la] semuanya dari [Mu`tamir bin Sulaiman] dia berkata; Saya mendengar [ayahku] telah menceritakan kepada kami [Abu Mijlaz] dari [Anas bin Malik] dia berkata; \"Ketika Nabi shallallahu 'alaihi wasallam menikahi Zainab binti Jahsy, beliau mengundang orang-orang, lalu beliau menjamu mereka, mereka pun menikmati hidangan tersebut, kemudian mereka duduk dan berbincang-bincang.\" Anas berkata; \"Lalu beliau merubah posisi seakan-akan ingin berdiri, namun orang-orang tidak juga berdiri, ketika beliau berdiri maka orang-orang pun ikut beridiri.\" Ashim dan Ibnu Abdil A'la menambahkan dalam haditsnya, Anas berkata; Lantas beliau berulang-ulang duduk sampai tiga kali, sesungguhnya Nabi shallallahu 'alaihi wasallam datang dan hendak masuk ke kamar Zainab, namun orang-orang masih tetap duduk-duduk, setelah itu mereka berdiri dan beranjak pergi, Anas berkata; Lalu saya mengabarkan kepada Nabi shallallahu 'alaihi wasallam bahwa mereka sudah beranjak pergi.\" Anas berkata; \"Kemudian beliau masuk dan saya mengikuti beliau masuk, lantas beliau menurunkan kain tirainya antara saya dengan beliau.\" Anas berkata; \"Lalu Allah Azza Wa Jalla menurunkan (ayat): \"Wahai orang-orang yang beriman, janganlah kalian masuk ke rumah Nabi kecuali kecuali bila kamu telah diizinkan masuk untuk makan, tanpa menunggu makanan tersebut terhidang -hingga firman-Nya- Sesungguhnya yang demikian itu sangatlah besar di sisi Allah",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 3506,
			"arabicnumber": "1428.05",
			"text": "Dan telah menceritakan kepadaku ['Amru An Naqid] telah menceritakan kepada kami [Ya'qub bin Ibrahim bin Sa'd] telah menceritakan kepada kami [ayahu] dari [Shalih], [Ibnu Syihab] berkata; Sesungguhnya [Anas bin Malik] pernah berkata; \"Saya adalah orang yang lebih tahu tentang ayat hijab, sesungguhnya Ubay bin Ka'ab pernah bertanya kepadaku tentang hal itu.\" Anas berkata; Di pagi hari Rasulullah shallallahu 'alaihi wasallam mengadakan pesta pernikahan dengan Zainab binti Jahsy. Anas berkata; Beliau menikahinya ketika di Madinah, lalu beliau mengundang orang-orang untuk menikmati jamuan ketika waktu mulai siang. Lantas Rasulullah shallallahu 'alaihi wasallam duduk, dan orang-orang pun duduk di samping beliau, kemudian Rasulullah berdiri dan berjalan, saya mengikuti beliau berjalan, sampai tiba di depan pintu kamar 'Aisyah. Beliau mengira bahwa tamu undangan telah pulang, maka beliau kembali, saya pun ikut kembali bersama beliau, Ternyata mereka masih duduk-duduk di tempat semula. Maka beliau pulang (ke rumah 'Aisyah) dan saya pun mengikuti beliau pulang yang kedua kalinya, hingga beliau tiba di kamar 'Aisyah. Kemudian beliau kembali lagi dan saya pun ikut beliau kembali, ternyata mereka telah pergi, lantas beliau menurunkan tirai antara saya dan beliau, kemudian Allah menurunkan ayat hijab",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 3507,
			"arabicnumber": "1428.06",
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Ja'far] yaitu Ibnu Sulaiman dari [Al Ja'd Abu Utsman] dari [Anas bin Malik] dia berkata; \"Setelah Rasulullah shallallahu 'alaihi wasallam menikah (dengan Zainab) beliau pergi ke rumah istrinya. Anas berkata; Sementara itu ibuku Ummu Sulaim membuat adonan kue yang diletakkan dalam mangkok, dia berkata; Wahai Anas, bawalah ini kepada Rasulullah shallallahu 'alaihi wasallam dan katakanlah kepada beliau bahwa ini sedikit kiriman dari ibu wahai Rasulullah, dan sampaikan salam ibu untuk beliau. Dia (Anas) berkata; Saya segera mengantar kue terebut kepada beliau, dan berujar; Ibu menyuruhku untuk mengantar sedikit kue ini kepada anda, dan dia menitip salam untuk anda. Beliau menjawab: \"Letakkanlah di situ, setelah itu, pergilah kamu untuk mengundang orang-orang supaya datang ke sini yaitu fulan, fulan dan fulan, dan siapa saja yang bertemu denganmu.\" Lalu saya pergi mengundang orang yang disebutkan beliau dan siapa saja yang bertemu denganku.\" Abu Utsman berkata; Saya bertanya kepada Anas; \"Berapa kira-kira jumlah undangan itu?\" Anas menjawab; \"Kira-kira tiga ratus orang. Dan Rasulullah shallallahu 'alaihi wasallam bersabda kepadaku: \"Wahai Anas, Bawalah kue tersebut kemari.\" Sementara itu, para undangan pun sudah banyak yang datang, sehingga memadati pelataran dan ruangan dalam, maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Buatlah kelompok-kelompok, setiap kelompok berjumlah sepuluh orang, dan masing-masing kelompok menyantap hidangan yang ada di dekatnya.\" Anas berkata; \"Para tamu pun makan hidangan tersebut sampai kenyang.\" Anas melanjutkan; \"Setiap satu kelompok selesai makan dan keluar, maka digantikan oleh kelompok yang lain, sehingga mereka semuanya makan.\" Beliau bersabda kepadaku: \"Wahai Anas, angkatlah!\" Anas berkata; \"Lantas saya mengangkat (sisa hidangan itu), saya tidak tahu apakah hidangan itu memang banyak ketika dihidangkan atau mungkin bertambah ketika saya mengangkatnya.\" Anas melanjutkan; \"Ternyata masih ada sebagian kelompok orang yang bercakap-cakap di rumah Rasulullah shallallahu 'alaihi wasallam, sedangkan Rasulullah shallallahu 'alaihi wasallam duduk dan istri beliau memalingkan wajahnya ke dinding. Sepertinya mereka telah menyusahkan Rasulullah shallallahu 'alaihi wasallam.\" Anas berkata; \"Kemudian beliau keluar menuju ke rumah para istrinya yang lain, setelah beberapa lama beliau kembali, ketika mereka melihat Rasulullah shallallahu 'alaihi wasallam telah kembali, barulah mereka merasa bahwa mereka telah menyusahkan beliau.\" Anas berkata; \"Lantas mereka beranjak pergi dan akhirnya mereka semua keluar, barulah Rasulullah shallallahu 'alaihi wasallam masuk dan menutupkan tabir, sedangkan saya masih duduk di ruangan, tidak lama kemudian, beliau keluar menemuiku, ketika itu turunlah ayat: \"Wahai orang-orang yang beriman, janganlah kamu masuk ke rumah Nabi Shallallahu 'Alaihi Wasalam, kecuali bila kamu telah dipersilahkan masuk untuk makan, tanpa menunggu lama makanan terhidang. Tetapi jika kamu diundang, maka masuklah. Dan apabila kamu selesai makan, keluarlah tanpa memperpanjang percakapan, karena yang demikian itu telah mengganggu Nabi Shallallahu 'Alaihi Wasalam…-hingga akhir ayat- (Al Ahzab: 53). Al Ja'd berkata; Anas bin Malik berkata; \"Saya kemudian menceritakan ayat ini kepada orang-orang, lalu para istri Nabi shallallahu 'alaihi wasallam mengenakan hijab",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 3508,
			"arabicnumber": "1428.07",
			"text": "Dan telah menceritakan kepadaku [Muhammad bin Rafi'] telah menceritakan kepada kami [Abdur Razzaq] telah menceritakan kepada kami [Ma'mar] dari [Abu Utsman] dari [Anas] dia berkata; Ketika Nabi shallallahu 'alaihi wasallam menikahi Zainab, Ummu Sulaim menghadiahkan kepada beliau adonan kue di dalam mangkok yang terbuat dari batu. Anas berkata; Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pergilah dan undanglah orang-orang Islam yang kamu temui.\" Lantas saya pergi dan mengundang siapa saja yang saya temui, kemudian mereka masuk (ke rumah beliau) dan menyantap makanan, lalu mereka kembali pulang. Kemudian Nabi shallallahu 'alaihi wasallam meletakkan tangannya ke dalam adonan tersebut sambil berdo'a Anas berkata; (meletakkan tangannya) ke dalam adonan tersebut dan mengucapkan do'a sebagaimana yang telah dikehendaki Allah. Saya tidak meninggalkan seorang pun yang saya temui melainkan saya mengundangnya, lantas mereka makan hidangan tersebut sampai kenyang, kemudian mereka kembali pulang. Kecuali sekelompok orang yang masih tetap bercakap-cakap, Nabi shallallahu 'alaihi wasallam malu jika menegur mereka, sehingga beliau keluar dan meninggalkan mereka ke dalam rumah, maka Allah Azza Wa Jalla menurunkan ayat: \" Wahai orang-orang yang beriman, janganlah kamu masuk ke rumah Nabi Shallallahu 'Alaihi Wasalam, kecuali bila kamu telah dipersilahkan masuk untuk makan, Qatadah menambahkan; \"Tanpa menunggu lama makanan terhidang, tetapi jika kamu diundang, maka masuklah… - sampai kepada firman-Nya - yang demikian itu lebih suci bagi hatimu dan hati mereka.\" (Al Ahzab: 53)",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 3509,
			"arabicnumber": "1429.01",
			"text": "Dan telah menceritakan kepada kami [Yahya bin Yahya] dia berkata; Saya membaca di hadapan [Malik] dari [Nafi'] dari [Ibnu Umar] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian diundang ke pesta perkawinan, maka hendaknya ia mendatanginya",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 3510,
			"arabicnumber": "1429.02",
			"text": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Khalid bin Harits] dari [Ubaidillah] dari [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Jika salah seorang dari kalian diundang ke pesta pernikahan, hendaknya ia memenuhi undangan tersebut.\" Khalid berkata; 'Ubaidullah juga selalu memenuhi undangan pernikahan",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 3511,
			"arabicnumber": "1429.03",
			"text": "Telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami ['Ubaidullah] dari [Nafi'] dari [Ibnu Umar] bahwasannya Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Jika salah seorang dari kalian diundang ke pesta pernikahan, hendaklah ia penuhi undangan tersebut",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 3512,
			"arabicnumber": "1429.04",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 3513,
			"arabicnumber": "1429.05",
			"text": "Dan telah menceritakan kepadaku [Muhammad bin Rafi'] telah menceritakan kepada kami [Abdur Razzaq] telah mengabarkan kepada kami [Ma'mar] dari [Ayyub] dari [Nafi'] bahwasannya [Ibnu Umar] pernah berkata dari Nabi shallallahu 'alaihi wasallam (beliau bersabda): \"Jika salah seorang dari kalian mengundang saudaranya, hendaknya ia penuhi undangan tersebut, baik undangan perniakahan atau semisalnya",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 3514,
			"arabicnumber": "1429.06",
			"text": "Dan telah menceritakan kepadaku [Ishaq bin Manshur] telah menceritakan kepadaku [Isa bin Mundzir] telah menceritakan kepada kami [Baqiyyah] telah menceritakan kepada kami [Az Zubaidi] dari [Nafi'] dari [Ibnu Umar] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang diundang ke pesta pernikahan atau semisalnya, hendaknya ia mendatanginya",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 3515,
			"arabicnumber": "1429.07",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 3516,
			"arabicnumber": "1429.08",
			"text": "Telah menceritakan kepadaku [Harun bin Abdullah] telah menceritakan kepada kami [Hajjaj bin Muhammad] dari [Ibnu Juraij] telah mengabarkan kepadaku [Musa bin Uqbah] dari [Nafi'] dia berkata; Saya mendengar [Abdullah bin Umar] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Penuhilah undangan ini, jika kalian diundang untuknya.\" Dan Abdullah bin Umar selalu mendatangi undangan pernikahan dan sejenisnya, dan dia mendatangi undangan tersebut meskipun dia sedang berpuasa",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 3517,
			"arabicnumber": "1429.09",
			"text": "Dan telah menceritakan kepadaku [Harmalah bin Yahya] telah mengabarkan kepada kami [Ibnu Wahb] telah menceritakan kepadaku [Umar bin Muhammad] dari [Nafi'] dari [Ibnu Umar] bahwasannya Nabi shallallahu 'alaihi wasallam bersabda: \"Jika kalian diundang ke kura' (hidangan kambing), maka penuhilah undangan tersebut",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 3518,
			"arabicnumber": "1430.01",
			"text": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Abdurrahman bin Mahdi]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] telah menceritakan kepada kami [ayahku] dia berkata; Telah menceritakan kepada kami [Sufyan] dari [Abu Az Zubair] dari [Jabir] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika kalian diundang ke jamuan makan, hendaknya ia mendatanginya, jika ia menghendaki, silakan makan, dan jika ia tidak menghendaki, ia boleh meninggalkannya.\" (Ibnu Mutsanna) tidak menyebutkan ke jamuan makanan. Dan telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [Abu 'Ashim] dari [Ibnu Juraij] dari [Abu Az Zubair] dengan isnad seperti ini",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 3519,
			"arabicnumber": "1430.02",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 3520,
			"arabicnumber": "1431",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 3521,
			"arabicnumber": "1432.01",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 3522,
			"arabicnumber": "1432.02",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya] dia berkata; Saya membaca di hadapan [Malik] dari [Ibnu Syihab] dari [Al A'raj] dari [Abu Hurairah] bahwa dia berkata; Seburuk-buruk jamuan adalah jamuan pesta pernikahan, apabila yang diundang ke pesta tersebut hanya orang-orang kaya saja dengan mengabaikan orang-orang miskin. Siapa yang tidak mendatangi suatu undangan, sungguh ia telah durhaka kepada Allah dan Rasul-Nya. Dan telah menceritakan kepada kami [Ibnu Abi Umar] telah menceritakan kepada kami [Sufyan] dia berkata; Saya berkata kepada [Az Zuhri]; Wahai Abu Bakar, bagaimana menurutmu hadits ini, yaitu: \"Seburuk-buruk jamuan adalah jamuan dalam pesta pernikahan.\" Maka dia tertawa, dan berkata; Bukan itu, maksudnya yaitu seburuk-buruk jamuan adalah jamuan arang kaya. Sufyan berkata; Ayahku adalah orang yang kaya, maka saya terkejut setelah mendengar hadits tersebut, lantas saya menanyakan kepada Az Zuhri, maka dia berkata; Telah menceritakan kepadaku [Abdurrahman Al A'raj] bahwa dia pernah mendengar [Abu Hurairah] berkata; Seburuk-buruk jamuan adalah jamuan dalam pesta pernikahan, kemudian dia menyebutkan seperti hadits Malik. Dan telah menceritakan kepadaku [Muhammad bin Rafi'] dan [Abd bin Humaid] dari [Abdur Razzaq] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Sa'id bin Musayyab]. Dan diriwayatkan dari jalur lain, dari [Al A'raj] dari [Abu Hurairah] dia berkata; Seburuk-buruk jamuan makanan adalah jamuan dalam pesta pernikahan, seperti hadits Malik. Dan telah menceritakan kepada kami [Ibnu Abi Umar] telah menceritakan kepada kami [Sufyan] dari [Abu Az Zannad] dari [Al A'raj] dari [Abu Hurairah] seperti itu",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 3523,
			"arabicnumber": "1432.03",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 3524,
			"arabicnumber": "1432.04",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 3526,
			"arabicnumber": "1433.01",
			"text": "Telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] dan [Amru An Naqid] sedangkan lafazhnya dari Amru keduanya berkata; Telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari ['Urwah] dari ['Aisyah] dia berkata; Suatu ketika istri Rifa'ah menemui Nabi shallallahu 'alaihi wasallam, dia berkata; Saya adalah istri Rifa'ah, kemudian dia menceraikanku dengan talak tiga, kemudian saya menikah dengan Abdurrahman bin Az Zabir, tapi anunya seperti ujung kain (impotent).\" Rasulullah shallallahu 'alaihi wasallam tersenyum mendengarnya, lantas beliau bersabda: \"Apakah kamu ingin kembali kepada Rifa'ah? itu tidak mungkin, sebelum kamu merasakan madunya dan dia merasakan madumu (yaitu bersenggama dengannya).\" 'Aisyah berkata; Waktu itu Abu Bakar berada di samping Rasulullah, sedangkan Khalid berada di pintu sedang menunggu untuk diizinkan, maka dia berseru; \"Wahai Abu Bakar, apakah kamu tidak mendengar perempuan ini berkata dengan keras di sisi Rasulullah shallallahu 'alaihi wasallam?",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 3527,
			"arabicnumber": "1433.02",
			"text": "Telah menceritakan kepadaku [Abu At Thahir] dan [Harmalah bin Yahya] sedangkan lafazhnya dari Harmalah, [Abu At Thahir] mengatakan; Telah menceritakan kepada kami, sedangkan [Harmalah] mengatakan; Telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] telah menceritakan kepadaku [Urwah bin Az Zubair] bahwa ['Aisyah] istri Nabi shallallahu 'alaihi wasallam telah mengabarkan kepadanya bahwa Rifa'ah Al Qurazhi telah menceraikan istrinya dengan tala tiga, setelah itu dia (istrinya) menikah dengan Abdurrahman bin Az Zabir, kemudian 'Aisyah datang kepada Nabi shallallahu 'alaihi wasallam seraya berkata; \"Wahai Rasulullah, sesunguhnya ia pernah menjadi istri Rifa'ah, kemudian ia menceraikannya dengan talak tiga.\" Setelah itu, saya (istrinya Rifa'ah) menikah dengan Abdurrahman bin Az Zabir, demi Allah, sesungguhnya anunya seperti ujung kain (maksudnya impotent), -dia memperagakan dengan memegang ujung jilbabnya- mendengar hal itu, Rasulullah shallallahu 'alaihi wasallam tersenyum sambil bersabda: \"Sepertinya kamu ingin kembali kepada Rifa'ah, itu tidak mungkin, sampai Abdurrahman merasakan madumu dan kamu merasakan madunya (bersenggama).\" Waktu itu, Abu Bakar sedang duduk di samping Rasulullah shallallahu 'alaihi wasallam, dan Khalid bin Sa'id bin Al 'Ash duduk di samping pintu, dia tidak di izinkan masuk. Perawi berkata; Maka Khalid menyeru Abu Bakar, kenapa kamu melarangku, padahal wanita itu berkata dengan keras di samping Rasulullah shallallahu 'alaihi wasallam? Telah menceritakan kepada kami [Abd bin Humaid] telah mengabarkan kepada kami [Abdur Razzaq] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari ['Urwah] dari ['Aisyah] bahwasannya Rifa'ah Al Qurazhi telah menceraikan istrinya, lantas ia dinikahi oleh Abdurrahman bin Az Zabir, lalu dia datang kepada Nabi shallallahu 'alaihi wasallam, dan berkata; Wahai Rasulullah, sesungguhnya Rifa'ah telah menceraikannya dengan talak tiga, seperti hadits Yunus",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 3528,
			"arabicnumber": "1433.03",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 3529,
			"arabicnumber": "1433.04",
			"text": "Telah menceritakan kepada kami [Muhammad bin Al 'Ala` Al Hamdani] telah menceritakan kepada kami [Abu Usamah] dari [Hisyam] dari [ayahnya] dari ['Aisyah] bahwa Rasulullah shallallahu 'alaihi wasallam pernah ditanya mengenai wanita yang dinikahi laki-laki, lalu dia menceraikannya, lantas (wanita tersebut) menikah lagi dengan laki-laki lain, lalu diceraikan lagi oleh suami kedua sebelum melakukan senggama, apakah dia halal untuk suaminya yang pertama? Beliau menjawab: Tidak, sampai dia (suami kedua) merasakan madunya\". Telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] telah menceritakan kepada kami [Ibnu Fudlail]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Abu Mu'awiyah] semuanya dari [Hisyam] dengan isnad ini",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 3530,
			"arabicnumber": "1433.05",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 3531,
			"arabicnumber": "1433.06",
			"text": "Telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] telah menceritakan kepada kami [Ali bin Mushir] dari [Ubaidillah bin Umar] dari [Al Qasim bin Muhammad] dari ['Aisyah] dia berkata; Seorang laki-laki menceraikan istrinya dengan talak tiga, lantas istrinya menikah dengan laki-laki lain, kemudian suami kedua menceraikannya sebelum menggaulinya, lantas suami pertama ingin menikahinya lagi, Rasulullah shallallahu 'alaihi wasallam ditanya mengenai hal itu, maka beliau menjawab: \"Tidak boleh, sampai suami yang kedua mencicipi madunya sebagaimana suami pertama merasakan madunya.\" Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] telah menceritakan kepada kami [ayahku]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Yahya, yaitu Ibnu Sa'id] semuanya dari [Ubaidillah] dengan isnad seperti ini, dalam haditsnya [Yahya] dari ['Ubaidillah] telah menceritakan kepada kami [Al Qasim] dari ['Aisyah]",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 3532,
			"arabicnumber": "1433.07",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 3533,
			"arabicnumber": "1434.01",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya] dan [Ishaq bin Ibrahim] sedangkan lafazhnya dari Yahya keduanya berkata; Telah mengabarkan kepada kami [Jarir] dari [Manshur] dari [Salim] dari [Kuraib] dari [Ibnu Abbas] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian ingin mendatangi istrinya (mengajak bersetubuh), hendaknya mengucapkan; BISMILLAH, ALLAHUMMA JANNIBNAS SYAITHAANA WAJANNIBIS SYAITHAANA MAA RAZAQTANAA (Dengan menyebut nama Allah, ya Allah, jauhkanlah kami dari setan dan jauhkanlah setan dari apa (anak) yang akan Engkau rizkikan kepada kami), apabila di antara keduanya ditakdirkan mendapatkan anak dari hasil persetubuhan itu, maka anak tersebut tidak akan dicelakakan setan selamanya.\" Dan telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Ibnu Basyar] keduanya berkata; Telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [ayahku]. Dan diriwayatkan dari jalur lain [Abd bin Humaid] telah mengabarkan kepada kami [Abdur Razzaq] semuanya dari [At Tsauri] keduanya dari [Manshur] dengan makna hadits Jarir, namun dalam hadits riwayat Syu'bah tidak disebutkan lafazh \"BISMILLAH\", dan dalam riwayat Abdur Razzaq dari At Tsauri menyebutkan \"BISMILLAH\" sedangkan dalam riwayat Ibnu Numair disebutkan; Manshur berkata; Saya menyangka beliau bersabda: \"BISMILLAH",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 3534,
			"arabicnumber": "1434.02",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 3535,
			"arabicnumber": "1435.01",
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] dan [Abu Bakar bin Abi Syaibah] serta [Amru An Naqid] sedangkan lafazhnya dari Abu Bakar, mereka berkata; Telah menceritakan kepada kami [Sufyan] dari [Ibnu Al Munkadir], bahwa ia mendengar [Jabir] berkata; Orang-orang yahudi mengatakan; Jika seorang lelaki menyetubuhi isterinya pada kemaluannya dari arah belakang, maka anak tersebut akan terlahir dalam keadaan cacat matanya (juling). Lalu turunlah ayat: \"Isteri-isteri kalian adalah tempat bercocok tanam bagi kalian, maka datangilah tempat bercocok tanam kalian dari mana saja kalian kehendaki",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 3536,
			"arabicnumber": "1435.02",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 3537,
			"arabicnumber": "1435.03",
			"text": "Telah menceritakan kepada kami [Muhammad bin Rumh bin Al Muhajir] telah mengabarkan kepada kami [Al Laits] dari [Ibnu Al Hadi] dari [Abu Hazim] dari [Muhammad bin Al Munkadir] dari [Jabir bin Abdullah] bahwa orang-orang yahudi mengatakan; Jika seorang wanita digauli pada kemaluannya dari arah belakang, kemudian ia hamil, maka anaknya (terlahir) juling. (Jabir) berkata; Maka turunlah ayat; \"Isteri-isteri kalian adalah tempat bercocok tanam bagi kalian, maka datangilah tempat bercocok tanam kalian dari mana saja kalian kehendaki.\" Dan telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Abu 'Awanah]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Abdul Warits bin Abdush Shamad] telah menceritakan kepadaku [ayahku] dari [kakekku] dari [Ayyub]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepadaku [Wahb bin Jarir] telah menceritakan kepada kami [Syu'bah]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Abdurrahman] telah menceritakan kepada kami [Sufyan]. Dan diriwayatkan dari jalur lain, telah menceritakan kepadaku ['Ubaidullah bin Sa'id] dan [Harun bin Abdullah] serta [Abu Ma'n Ar Raqasyi] mereka berkata; Telah menceritakan kepada kami [Wahb bin Jarir] telah menceritakan kepada kami [ayahku] dia berkata; Saya mendengar [Nu'man bin Rasyid] telah menceritakan dari [Az Zuhri]. Dan diriwayatkan dari jalur lain, telah menceritakan kepadaku [Sulaiman bin Ma'bad] telah menceritakan kepada kami [Mu'alla bin Asad] telah menceritakan kepada kami [Abdul Aziz] dia adalah Ibnu Muhtar, dari [Suhail bin Abi Shalih] mereka semua dari [Muhammad bin Al Munkadir] dari [Jabir] dengan hadits ini, dan dalam haditsnya Nu'man ditambahkan dari Az Zuhri; \"Jika ia menghendaki, ia (boleh menggauli istrinya) dari belakang, dan jika ia menghendaki ia boleh menggaulinya dari arah depan asalkan dari satu lubang",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 3538,
			"arabicnumber": "1436.01",
			"text": "Dan telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Ibnu Basysyar] sedangkan lafazhnya dari Al Mutsanna keduanya berkata; Telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dia berkata; Saya pernah mendengar [Qatadah] telah menceritakan dari [Zurarah bin Aufa] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Apabila seorang istri enggan bermalam dengan memisahkan diri dari tempat tidur suaminya, maka Malaikat akan melaknatnya sampai pagi.\" Dan telah menceritakan kepadaku [Yahya bin Habib] telah menceritakan kepada kami [Khalid] yaitu Ibnu Al Harits, telah menceritakan kepada kami [Syu'bah] dengan isnad ini, beliau bersabda: \"Sampai dia (istri) kembali (kepada suaminya)",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 3539,
			"arabicnumber": "1436.02",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 3540,
			"arabicnumber": "1436.03",
			"text": "Telah menceritakan kepada kami [Ibnu Abi Umar] telah menceritakan kepada kami [Marwan] dari [Yazid yaitu Ibnu Kaisan] dari [Abu Hazim] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Demi dzat yang jiwaku berada di Tangan-Nya, tidaklah seorang suami mengajak istrinya ke ranjang (untuk bersenggama) sedangkan dia enggan, melainkan yang ada di langit murka kepadanya sampai suaminya mema'afkannya",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 3541,
			"arabicnumber": "1436.04",
			"text": "Dan telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] dan [Abu Kuraib] keduanya berkata; Telah menceritakan kepada kami [Abu Mu'awiyah]. Dan diriwayatkan dari jalur lain, telah menceritakan kepadaku [Abu Sa'id Al Asyaj] telah menceritakan kepada kami [Waki']. Dan diriwayatkan dari jalur lain, telah menceritakan kepadaku [Zauhair bin Harb] dan lafazhnya dari dia, telah menceritakan kepada kami [Jarir] semuanya dari [Al A'masy] dari [Abu Hazim] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika seorang suami mengajak istrinya untuk berhubungan, akan tetapi ia (istri) tidak memenuhi ajakan suami, hingga malam itu suaminya marah, maka ia (istri) mendapatkan laknat para Malaikat sampai subuh",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 3542,
			"arabicnumber": "1437.01",
			"text": "Telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] telah menceritakan kepada kami [Marwan bin Mu'awiyah] dari [Umar bin Hamzah Al 'Amari] telah menceritakan kepada kami [Abdurrahman bin Sa'd] dia berkata; Saya mendengar [Abu Sa'id Al Khudri] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya manusia yang paling jelek kedudukannya di sisi Allah pada Hari Kiamat ialah seseorang yang menyetubuhi istrinya dan istri bersetubuh dengan suaminya, kemudian suami menyebarkan rahasia istrinya",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 3543,
			"arabicnumber": "1437.02",
			"text": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] dan [Abu Kuraib] keduanya berkata; Telah menceritakan kepada kami [Abu Usamah] dari [Umar bin Hamzah] dari [Abdurrahman bin Sa'd] dia berkata; Saya mendengar [Abu Sa'id Al Khudri] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya amanat yang paling besar di sisi Allah pada Hari Kiamat adalah seseorang yang bersetubuh dengan istrinya dan istri bersetubuh dengan suaminya, kemudian dia (suami) menyebarkan rahasianya.\" Ibnu Numair berkata; \"Sesungguhnya (amanat) yang paling besar",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 3544,
			"arabicnumber": "1438.01",
			"text": "Telah menceritakan kepada kami [Yahya bin Ayyub], [Qutaibah bin Sa'id] dan ['Ali bin Hujr] mereka berkata; Telah menceritakan kepada kami [Isma'il bin Ja'far] telah mengabarkan kepadaku [Rabi'ah] dari [Muhammad bin Yahya bin Hibban] dari [Ibnu Muhairiz] bahwa dia berkata; Saya bersama Abu Shirmah menemui [Abu Sa'id Al Khudri], lantas Abu Shirmah bertanya; Wahai Abu Sa'id, apakah engkau pernah mendengar Rasulullah shallallahu 'alaihi wasallam menyebutkan tentang azl (mengeluarkan air mani di luar kemaluan istri? Dia menjawab; Ya, kami pernah bersama Rasulullah shallallahu 'alaihi wasallam memerangi Bani Mushtaliq, dan kami berhasil menawan wanita-wanita arab yang cantik. Saat itu kami sudah lama kesepian, sedangkan kami menginginkan tebusan dari tawanan-tawanan tersebut, oleh karena itu, kami bermaksud bersenang-senang dengan tawanan wanita tersebut tapi dengan cara 'azl, maka kami sama berkata; Apakah kita melakukan hal ini tanpa menanyakan terlebih dahulu, padahal Rasulullah shallallahu 'alaihi wasallam berada di tengah-tengah kita? Lantas kami menanyakan hal itu kepada Rasulullah shallallahu 'alaihi wasallam, maka beliau menjawab: \"Tidak ada mudharat jika kalian tidak melakukan hal itu, sebab sesuatu yang telah di tetapkan oleh Allah Azza wa Jalla harus tercipta, maka ia akan tetap ada hingga Hari Kiamat.\" Telah menceritakan kepadaku [Muhammad bin Al Farj] budak bani Hasyim, telah menceritakan kepada kami [Muhammad bin Az Zabriqan] telah menceritakan kepada kami [Musa bin Uqbah] dari [Muhammad bin Yahya bin Habban] dengan isnad ini, sesuai dengan makna hadits Rabi'ah, namun (dalam haditsnya) dia menyebutkan sabda Rasulullah shallallahu 'alaihi wasallam: \"Sesungguhnya Allah telah menetapkan apa yang diciptakannya hingga hari Kiamat",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 3545,
			"arabicnumber": "1438.02",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 3546,
			"arabicnumber": "1438.03",
			"text": "Telah menceritakan kepadaku [Abdullah bin Muhammad bin Asma` Ad Dluba'i] telah menceritakan kepada kami [Juwairiyah] dari [Malik] dari [Az Zuhri] dari [Ibnu Muhairiz] dari [Abu Sa'id Al Khudri] bahwa dia telah mengabarkan kepadanya, dia berkata; Kami mendapatkan tawanan wanita, dan kami hendak menyetubuhinya dengan cara 'azl, lalu kami tanyakan hal itu kepada Rasulullah shallallahu 'alaihi wasallam, beliau pun bersabda kepada kami: \"Apakah kalian benar-benar melakukannya? Apakah kalian benar-benar melakukannya? Apakah kalian benar-benar melakukannya? Tidaklah ruh yang tercipta sampai Hari Kiamat, melainkan ia akan tetap tercipta",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 3547,
			"arabicnumber": "1438.04",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 3548,
			"arabicnumber": "1438.05",
			"text": "Telah menceritakan kepada kami [Nashr bin Ali Al Jahdlami] telah menceritakan kepada kami [Bisyr bin Al Mufadldlal] telah menceritakan kepada kami [Syu'bah] dari [Anas bin Sirin] dari [Ma'bad bin Sirin] dari [Abu Sa'id Al Khudri] dia (Anas) berkata; Saya bertanya kepadanya (Ma'bad), apakah kamu mendengarnya dari Abu Sa'id, dia menjawab, ya, dari Nabi Shalallahu 'alaihi wa salam beliau bersabda: \"Tidak ada mudharat jika kalian tidak melakukan Azl, karena itu berkenaan dengan takdir Allah.\" Dan telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Ibnu Basysyar] keduanya berkata; Telah menceritakan kepada kami [Muhammad bin Ja'far]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Yahya bin Habib] telah menceritakan kepada kami [Khalid yaitu Ibnu Al Harits]. Dan diriwayatkan dari jalur lain, telah menceritakan kepadaku [Muhammad bin Hatim] telah menceritakan kepada kami [Abdurrahman bin Mahdi] dan [Bahz] mereka semua berkata; Telah menceritakan kepada kami [Syu'bah] dari [Anas bin Sirin] dengan isnad seperti ini, namun dalam hadits riwayat mereka disebutkan; dari Nabi shallallahu 'alaihi wasallam beliau bersabda mengenai Azl: \"Tidak ada mudharat jika kalian tidak melakukan hal itu, karena itu berkenaan dengan takdir Allah.\" Dan dalam riwayat Bahz, Syu'bah berkata; Saya bertanya kepadanya; \"Apakah dari Abu Sa'id?\" Dia menjawab; \"Ya",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 3549,
			"arabicnumber": "1438.06",
			"text": "Telah menceritakan kepada kami [Abu Ar Rabi' Az Zahrani] dan [Abu Kamil Al Jahdari] sedangkan lafalzhnya dari Abu Kamil, keduanya berkata; Telah menceritakan kepada kami [Hammad dia adalah Ibnu Zaid] telah menceritakan kepada kami [Ayyub] dari [Muhammad] dari [Abdurrahman bin Bisyr bin Mas'ud] yang ia kembalikan (sampaikan) riwayatnya kepada [Abu Sa'id Al Khudri] dia berkata; Nabi shallallahu 'alaihi wasallam pernah ditanya mengenai Azl (yaitu mengeluarkan mani diluar kemaluan istri waktu besenggama), beliau bersabda: \"Tidak ada mudharat jika kalian tidak melakukan azl, karena sesungguhnya hal itu hanyalah berkenaan dengan takdir Allah.\" Muhammad berkata; Dan sabda beliau: \"Tidak ada mudharat jika kalian tidak melakukannya\", itu lebih mendekati kepada larangan",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 3550,
			"arabicnumber": "1438.07",
			"text": "Dan telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Mu'adz bin Mu'adz] telah menceritakan kepada kami [Ibnu 'Aun] dari [Muhammad] dari [Abdurrahman bin Bisyr Al Anshari] dia berkata; Hadits ini dikembalikan riwayatnya sampai kepada [Abu Sa'id Al Khudri] dia berkata; Seseorang menyebutkan Azl di hadapan Nabi shallallahu 'alaihi wasallam, lantas beliau bertanya: \"Apa yang kalian maksudkan?\" mereka menjawab; Seorang suami memiliki istri yang sedang menyusui, lalu laki-laki tersebut menyetubuhi istrinya tetapi ia tidak menginginkan istrinya hamil (lantas ia melakukan azl), dan seseorang memiliki budak perempuan, lalu laki-laki tersebut tidak ingin dia hamil. Maka beliau bersabda: \"Tidak ada mudharat jika kalian tidak melakukan hal itu, karena itu hanyalah berkenaan dengan takdir Allah.\" Ibnu 'Aun berkata; Saya ceritakan hal itu kepada Al Hasan, maka ia berkata; Demi Allah, sepertinya hal itu merupakan suatu peringatan keras. Dan telah menceritakan kepadaku [Hajjaj bin As Sya'ir] telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Hammad bin Zaid] dari [Ibnu 'Aun] dia berkata; Saya telah menceritakan kepada [Muhammad] dari [Ibrahim] dengan hadits Abdurrahman bin Bisyr yaitu hadits mengenai Azl, maka dia berkata; Telah menceritakan kepadaku [Abdurrahman bin Bisyr] telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Abdul A'la] telah menceritakan kepada kami [Hisyam] dari [Muhammad] dari [Ma'bad bin Sirin] dia berkata; Kami berkata kepada [Abu Sa'id] apakah engkau pernah mendengar Rasulullah shallallahu 'alaihi wasallam menyebutkan tentang Azl? Dia menjawab; Ya. Kemudian dia menyebutan hadits yang semakna dengan hadits Ibnu 'Aun sampai sabda beliau: \"Takdir Allah",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 3551,
			"arabicnumber": "1438.08",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 3552,
			"arabicnumber": "1438.09",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 3553,
			"arabicnumber": "1438.10",
			"text": "Telah menceritakan kepada kami [Ubaidullah bin Umar Al Qawariri] dan [Ahmad bin 'Abdah] -Ibnu Abdah berkata; Telah mengkhabarkan kepada kami, sedangkan [Ubaidullah] berkata; Telah menceritakan kepada kami [Sufyan bin Uyainah] - dari [Ibnu Abi Najih] dari [Mujahid] dari [Qaza'ah] dari [Abu Sa'id Al Khudri] dia berkata; Masalah Azl pernah dibicarakan di hadapan Rasulullah shallallahu 'alaihi wasallam, lantas beliau bersabda: \"Kenapa salah seorang dari kalian melakukan hal itu?\" -beliau tidak bersabda: \"Janganlah salah seorang dari kalian melakukan hal itu\"- sesungguhnya tidak ada jiwa yang telah diciptakan melainkan Allah Azza wa Jalla-lah Penciptanya",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 3554,
			"arabicnumber": "1438.11",
			"text": "Telah menceritakan kepadaku [Harun bin Sa'id Al Aili] telah menceritakan kepada kami [Abdullah bin Wahb] telah mengkhabarkan kepadaku [Mu'awiyah, yakni Ibnu Shalih] dari [Ali bin Abu Thalhah] dari [Abu Al Waddak] dari [Abu Sa'id Al Khudri] bahwa dia (Abu Waddak) pernah mendengarnya berkata; Rasulullah shallallahu 'alaihi wasallam pernah ditanya perihal azl, maka beliau menjawab: \"Tidak semua air mani akan menjadi anak, namun apabila Allah berkehendak menjadikan sesuatu, maka tidak akan ada sesuatu pun yang bisa menghalangi-Nya.\" Telah menceritakan kepadaku [Ahmad bin Mundzir Al Bashri] telah menceritakan kepada kami [Zaid bin Hubab] telah menceritakan kepada kami [Mu'awiyah] telah mengabarkan kepadaku [Ali bin Abi Thalhah Al Hasyimi] dari [Abu Al Waddak] dari [Abu Sa'id Al Khudri] dari Nabi shallallahu 'alaihi wasallam seperti hadits di atas",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 3555,
			"arabicnumber": "1438.12",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 3556,
			"arabicnumber": "1439.01",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 3557,
			"arabicnumber": "1439.02",
			"text": "Telah menceritakan kepada kami [Sa'id bin Amru Al Asy'atsi] telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Sa'id bin Hasan] dari [Urwah bin Iyadl] dari [Jabir bin Abdullah] dia berkata; Seorang laki-laki bertanya kepada Nabi Shalallahu 'alaihi Wasallam; \"Sesungguhnya saya memiliki seorang budak perempuan, dan saya melakukan azl saat berhubungan dengannya?\" Maka Rasulullah shallallahu 'alaihi wasallam menjawab: \"Sesungguhnya yang demikian itu tidak akan mampu mencegah sesuatu yang telah ditetapkan Allah.\" Dia (Jabir) berkata; Maka laki-laki tersebut menemui Nabi shallallahu 'alaihi wasallam dan berkata; \"Wahai Rasulullah, sesungguhnya budak perempuan yang pernah saya ceritakan kepadamu telah hamil.\" Rasulullah shallallahu 'alaihi wasallam pun bersabda: \"Saya adalah hamba Allah dan Rasul-Nya.\" Dan telah menceritakan kepada kami [Hajjaj bin Sya'ir] telah menceritakan kepada kami [Abu Ahmad Az Zubairi] telah menceritakan kepada kami [Sa'id bin Hasan] seorang yang menceritakan penduduk Makkah, telah mengabarkan kepadaku ['Urwah bin 'Iyadl bin 'Adi bin Al Khiyar An Naufali] dari [Jabir bin Abdullah] dia berkata; Seorang laki-laki datang kepada Nabi shallallahu 'alaihi wasallam, semakna dengan hadits Sufyan",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 3558,
			"arabicnumber": "1439.03",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 3559,
			"arabicnumber": "1440.01",
			"text": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Ishaq bin Ibrahim], Ishaq berkata; Telah mengkhabarkan kepada kami. Abu Bakar berkata; Telah menceritakan kepada kami [Sufyan] dari [Amru] dari ['Atha`] dari [Jabir] dia berkata; \"Kami biasa melakukan azl di saat Al Qur`an masih turun.\" [Ishaq] menambahkan; [Sufyan] berkata; Sekiranya azl dilarang, tentu Al Qur`an akan melarang perbuatan kami",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 3560,
			"arabicnumber": "1440.02",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 3561,
			"arabicnumber": "1440.03",
			"text": "Telah menceritakan kepadaku [Abu Ghassan Al Misma'i] telah meceritakan kepada kami [Mu'adz yaitu Ibnu Hisyam] telah menceritakan kepadaku [ayahku] dari [Abu Zubair] dari [Jabir] dia berkata; \"Kami melakukan azl di masa Rasulullah shallallahu 'alaihi wasallam, kemudian hal itu disampaikan kepada Nabi shallallahu 'alaihi wasallam, namun beliau tidak melarang kami",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 3562,
			"arabicnumber": "1441.01",
			"text": "Dan telah menceritakan kepadaku [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Yazid bin Khumair] dia berkata; Saya mendengar [Abdurrahman bin Jubair] telah menceritakan dari [ayahnya] dari [Abu Ad Darda`] dari Nabi shallallahu 'alaihi wasallam, bahwa beliau melewati seorang wanita (tawanan) yang hamil berada di depan tenda besar, lantas beliau bersabda: \"Sepertinya tuannya ingin menggaulinya.\" Mereka (para sahabat) menjawab; Sepertinya begitu. Lantas Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sungguh saya berharap bisa melaknat (tuannya), laknat yang bisa membawanya sampai ke kuburnya, bagaimana ia mewarisi (anak dalam kandungannya) padahal ia tidak berhak atas anak tersebut? Bagaimana ia menjadikan (anak tersebut) sebagai pelayannya (budaknya) padahal ia tidak halal baginya?\" Dan telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Yazid bin Harun]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Abu Daud] semuanya dari [Syu'bah] dengan isnad ini",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 3563,
			"arabicnumber": "1441.02",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 3564,
			"arabicnumber": "1442.01",
			"text": "Dan telah menceritakan kepada kami [Khalaf bin Hisyam] telah menceritakan kepada kami [Malik bin Anas]. Dan dari jalur lain, telah menceritakan kepada kami [Yahya bin Yahya] sedangkan lafazhnya dari dia (Yahya) dia berkata; Saya membaca di depan [Malik] dari [Muhammad bin Abdurrahman bin Naufal] dari [Urwah] dari [Aisyah] dari [Judamah binti Wahb Al Asadiyyah] bahwa dia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya saya bertekad untuk melarang ghilah (yaitu menyetubuhi istri yang sedang menyusui anak), akan tetapi saya perhatikan orang-orang romawi dan Persia melakukan ghilah, namun hal itu tidak membahayakan anak-anak mereka.\" Muslim berkata; Khalaf mengatakan; Dari Judzamah (dengan dzal), namun yang shahih adalah yang dikatakan Yahya, yaitu dengan dal (Judamah)",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 3565,
			"arabicnumber": "1442.02",
			"text": "Telah menceritakan kepada kami [Ubaidullah bin Sa'id] dan [Muhammad bin Abu Umar] keduanya berkata; Telah menceritakan kepada kami [Al Muqri`] telah menceritakan kepada kami [Sa'id bin Abu Ayyub] telah menceritakan kepadaku [Abu Al Aswad] dari [Urwah] dari [Aisyah] dari [Judamah binti Wahb] saudarinya Ukasyah, dia berkata; Saya hadir waktu Rasulullah bersama orang-orang, sedangkan beliau bersabda: \"Sungguh saya bertekad untuk melarang ghilah, setelah saya perhatikan orang-orang Romawi dan Persia, mereka melakukan ghilah, ternyata hal itu tidak membahayakan anak-anak mereka sedikit pun.\" Kemudian mereka bertanya mengenai azl, Maka Rasulullah shallallahu 'alaihi wasallam menjawab: \"Itu adalah pembunuhan secara tidak langsung.\" [Ubaidullah] menambahkan dalam haditsnya dari [Al Muqri`] yaitu Firman Allah: \"Jika bayi-bayi yang dibunuh ditanya.\" Dan telah menceritakan kepada kami [Abu bakar bin Abu Syaibah] telah menceritakan kepada kami [Yahya bin Ishaq] telah menceritakan kepada kami [Yahya bin Ayyub] dari [Muhammad bin Abdurrahman bin Naufal Al Qurasyi] dari [Urwah] dari [Aisyah] dari [Judamah binti Wahb Al Asadiyyah] bahwa dia berkata; Saya mendengar Rasulullah shallallahu 'alaihi wasallam, kemudian dia menyebutkan seperti hadits Sa'id bin Ayyub tentang azl dan ghilah, namun dia menggunakan kata Al Ghiyal",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 3566,
			"arabicnumber": "1442.03",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 3567,
			"arabicnumber": "1443",
			"text": "Telah menceritakan kepadaku [Muhammad bin Abdullah bin Numair] dan [Zuhair bin Harb] sedangkan lafazh dari Ibnu Numair, keduanya berkata; Telah menceritakan kepada kami [Abdullah bin Yazid Al Maqburi] telah menceritakan kepada kami [Haiwah] telah menceritakan kepadaku [Ayyasy bin Abbas] bahwasannya [Abu Nadlr] telah menceritakan kepadanya dari [Amir bin Sa'ad] bahwasannya [Usamah bin Zaid] mengabarkan kepada ayahnya Sa'd bin Abu Waqash bahwa seorang laki-laki datang menemui Rasulullah shallallahu 'alaihi wasallam dan berkata; Sesungguhnya saya telah melakukan azl terhadap istriku (yang sedang menyusui). Lantas Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Kenapa kamu lakukan hal itu?\" laki-laki tersebut menjawab; Saya kasihan terhadap anaknya atau anak-anaknya (khawatir jika anaknya menjadi cacat). Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seandainya hal itu membahayakan, niscaya telah membahayakan orang-orang Persia dan Romawi.\" Zuhair berkata dalam riwayatnya; \"Jika hal itu terjadi, niscaya hal itu juga telah membahayakan orang-orang Persia dan Romawi",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 169
			}
		}
	]
}