{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"19": "The Book of Invoking Curses"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3743,
			"arabicnumber": "1492.01",
			"text": "Dan telah menceritakan kepada kami [Yahya bin Yahya] dia berkata; Saya membaca di hadapan [Malik] dari [Ibnu Syihab] bahwa [Sahl bin Sa'd As Sa'idi] telah mengabarkan kepadanya bahwa 'Uwaimir Al 'Ajlani bertanya kepada 'Ashim bin 'Adi Al Anshari; \"Wahai 'Ashim, bagaimana pendapatmu jika seorang suami memergoki laki-laki lain yang sedang berkencan dengan istrinya? Apakah sang suami membunuh laki-laki tersebut kemudian kalian membunuhnya (sebagai qishah) atau bagaimana seharusnya yang akan diperbuatnya? Wahai 'Ashim, coba tanyakan hal ini kepada Rasulullah shallallahu 'alaihi wasallam!\" Kemudian 'Ashim bertanya kepada Rasulullah shallallahu 'alaihi wasallam, namun Rasulullah shallallahu 'alaihi wasallam tidak menyukai pertanyaan itu, bahkan beliau mencelanya, sehingga 'Ashim merasa sangat bersalah dengan apa yang didengarnya dari Rasulullah shallallahu 'alaihi wasallam. Tatkala 'Ashim kembali ke keluarganya, tiba-tiba 'Uwaimir datang, lalu dia bertanya; \"Wahai 'Ashim, apa yang telah dikatakan Rasulullah shallallahu 'alaihi wasallam terhadapmu?\" 'Ashim menjawab; \"Justru persoalan tersebut tidak membawa kebaikan bagiku sama sekali, sungguh Rasulullah shallallahu 'alaihi wasallam tidak menyukai pertanyaan yang saya ajukan kepadanya.\" 'Uwaimir berkata; \"Demi Allah, saya tidak akan berhenti sampai saya sendiri yang akan menanyakannya kepada beliau.\" 'Uwaimir lalu pergi hingga dia datang kepada Rasulullah shallallahu 'alaihi wasallam yang sedang berada di kerumunan orang banyak. 'Uwaimir bertanya; \"Wahai Rasulullah, bagaimana menurutmu, jika ada seorang suami yang mendapati istrinya sedang bersama laki-laki lain? Apakah sang suami boleh membunuh laki-laki tersebut kemudian kalian membunuhnya (sebagai qishash), atau dia harus berbuat apa?\" Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Telah turun ayat mengenai dirimu dan istrimu, maka bawalah istrimu kemari!\" Sahal berkata; Kemudian 'Uwaimir dan istrinya melontarkan li'an (saling mela'nat). Setelah keduanya selesai melontarkan li'an, maka 'Uwaimir berkata; \"Wahai Rasulullah, jika saya tetap memperistrinya, berarti saya berdusta.\" Kemudian dia metalaknya dengan talak tiga, sebelum dirinya diperintahkan oleh Rasulullah shallallahu 'alaihi wasallam.\" Ibnu Syihab berkata; \"Seperti itulah cara penyelesaian antara suami istri yang saling melaknat.\" Telah menceritakan kepada kami [Harmalah bin Yahya] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] telah mengabarkan kepadaku [Sahl bin Sa'd Al Anshari] bahwa 'Uwaimir Al Anshari dari Bani 'Ajlan menemui 'Ashim bin 'Adi, kemudian dia melanjutkan teks hadits seperti hadits Malik dan dia mengidrajkan (memasukkan lafazh yang bukan termasuk dari lafazh hadits) dalam hadits tersebut dengan perataannya; \"Kemudian beliau memisahkan dia dengan istrinya, begitulah sunnah mengajarkan suami istri yang saling melaknat.\" Dan dia menambahkan pula; Sahl berkata; \"Setelah itu istrinya hamil, sedangkan anaknya dipanggil dengan nama ibunya, kemudian sunnah berlaku kepadanya bahwa anaknya mewarisi sifat ibunya, begitu juga dengan ibnunya mewarisi sifat anaknya sebagaimana yang telah diputuskan Allah terhadap dirinya.\" Dan telah menceritakan kepada kami [Muhammad bin Rafi'] telah menceritakan kepada kami [Abdur Razzaq] telah mengabarkan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Ibnu Syihab] mengenai orang yang saling melaknat, dan ketetapan sunnah terhadapnya dari hadits Sahl bin Sa'd saudara Bani Sa'idah bahwa ada seorang laki-laki dari Anshar datang menemui Nabi shallallahu 'alaihi wasallam, dia bertanya; \"Wahai Rasulullah, bagaimana pendapatmu, jika ada seorang suami mendapati istrinya sedang bersama laki-laki lain?\" Lalu dia menyebutkan hadits tersebut dengan kisahnya. Dan dia menambahkan; \"Kemudian keduanya saling melaknat di dalam masjid, waktu itu saya ikut menyaksikan.\" Dan dia berkata dalam hadits tersebut; \"Kemudian 'Uwaimir menceraikannya dengan talak tiga sebelum dia diperintahkan oleh Rasulullah shallallahu 'alaihi wasallam, lalu dia menceraikannya di sisi Nabi shallallahu 'alaihi wasallam, selanjutnya Nabi shallallahu 'alaihi wasallam bersabda: \"Demikianlah seharusnya kalian memisahkan antara dua orang (suami istri) yang saling melaknat",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3744,
			"arabicnumber": "1492.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3745,
			"arabicnumber": "1492.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3746,
			"arabicnumber": "1493.01",
			"text": "Telah menceritakan kepada kami [Muhammad bin Abdulalh bin Numair] telah menceritakan kepada kami [ayahku], dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] sedangkan lafazhnya dari dia, telah menceritakan kepada kami [Abdullah bin Numair] telah menceritakan kepada kami [Abdul Malik bin Abu Sulaiman] dari [Sa'id bin Jubair] dia berkata; Saya pernah ditanya mengenai suami istri yang saling tuduh pada zaman pemerintahan Mush'ab, apakah keduanya diceraikan? Ibnu Jubair berkata; Saya tidak menjawabnya, sebab saya tidak mengetahui tentang hukumnya, maka saya langsung datang ke rumah [Ibnu Umar] di Makkah. Saya berkata kepada pelayannya; Izinkanlah saya bertemu dengannya. Dia menjawab; Sesungguhnya Ibnu Umar sedang istirahat siang. Namun rupanya Ibnu Umar mendengar dan mengenal suaraku, lalu dia berkata; \"Ibnu Jabirkah itu?\" Saya menjawab; \"Ya.\" Dia berkata; \"Masuklah, demi Allah tidaklah kamu datang pada saat-saat seperti ini melainkan ada urusan yang penting.\" Kemudian saya masuk ke rumahnya, sedangkan dia duduk bertelekan di atas pelana dan bantal yang terbuat dari serabut. Lalu saya bertanya; \"Wahai Abu Abdurrahman, apakah harus dipisahkan jika ada suami istri yang saling li'an?\" Dia menjawab; \"Subhanallah, ya, dia harus dipisahkan. Sesungguhnya orang yang pertama kali bertanya masalah ini adalah fulan bin fulan, dia bertanya; Wahai Rasulullah, bagaimana pendapat anda seandainya salah seorang dari kami mendapati istrinya berbuat serong? Apa yang harus diperbuatnya? Jika dia membicarakannya, maka dia akan membicarakan sesuatu yang menghebohkan, namun jika diam, dia diam terhadap masalah yang sangat besar.\" Ibnu Umar melanjutkan; Maka Nabi shallallahu 'alaihi wasallam diam, tidak menjawab apa-apa. Tidak lama kemudian, dia datang lagi kepada beliau, katanya; Sesungguhnya masalah yang pernah kutanyakan kepada anda tempo hari adalah masalah pribadiku, dan saya baru diuji dengan masalah tersebut. Mengenai kasus mereka, lalu Allah Azza Wa Jalla menurunkan ayat yang tersebut dalam surat An Nur: \"Dan orang-orang yang menuduh istrinya berzina ….\" Kemudian beliau membacakan ayat itu kepadanya, memberinya pengajaran, memperingatkannya dengan keras dan mengabarkan bahwa siksa dunia lebih ringan daripada siksa akhirat. Laki-laki itu berkata; \"Demi Allah yang mengutus anda dengan kebenaran, saya tidak berbohong.\" Kemudian beliau memanggil istrinya, lalu beliau memberi pengajaran, memperingatkannya dengan keras, serta mengabarkan kepadanya bahwa siksa dunia lebih ringan dari siks akhirat.\" Perempuan itu menjawab; \"Demi Allah yang mengutus anda dengan kebenaran, sesungguhnya laki-laki itu dusta.\" Kemudian beliau menyuruh laki-laki tersebut bersaksi atas nama Allah sebanyak empat kali bahwa dia termasuk orang-orang yang jujur, dan yang kelima mangatakan bahwa Laknat Allah akan menimpanya jika dia berdusta. Kemudian beliau menyuruh yang perempuan untuk bersaksi atas nama Allah empat kali sumpah bahwa suaminya termasuk orang-orang yang berdusta, dan yang kelima dengan mengucapkan bahwa murka Allah atasnya jika suaminya yang benar. Kemudian beliau memisahkan antara keduanya. Dan telah menceritakan kepadaku [Ali bin Hujr As Sa'di] telah menceritakan kepada kami [Isa bin Yunus] telah menceritakan kepada kami [Abdul Malik bin Abi Sulaiman] dia berkata; Saya pernah mendengar [Sa'id bin Jubair] berkata; Saya pernah ditanya mengenai seorang suami istri yang saling meli'an di zaman Mush'ab bin Zubair, dan saya tidak tahu harus menjawab apa, lalu saya menemui [Abdullah bin Umar], saya bertanya; \"Bagaimana pendapatmu jika ada suami istri yang saling meli'an, apakah keduanya harus dipisahkan?\" Kemudian dia menyebutkan seperti haditsnya Ibnu Umar",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3747,
			"arabicnumber": "1493.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 3748,
			"arabicnumber": "1493.03",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya] dan [Abu Bakar bin Abi Syaibah] serta [Zuhair bin Harb] sedangkan lafazhnya dari Yahya, dia mengatakan; Telah mengabarkan kepada kami, sedangkan yang dua mengatakan; Telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari ['Amru] dari [Sa'id bin Jubair] dari [Ibnu Umar] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda kepada sepasang suami istri yang saling meli'an: \"Hanya Allah sajalah yang tahu jika salah satu dari kalian ada yang berdusta, dan tidak ada jalan lain bagimu untuk menuntut istrimu.\" Kata suaminya; \"Wahai Rasulullah, bagaimanaah dengan hartaku?\" beliau menjawab: \"Kamu tidak dapat menuntutnya lagi karena kamu telah bersumpah. Jika sumpahmu benar, maka harta itu sebagai imbalan kehalalan kehormatannya bagimu, dan jika ternyata kamu yang dusta, maka harta tersebut akan semakin menjauh darimu.\" Dalam riwayatnya Zuhair mengatakan; Telah menceritakan kepada kami Sufyan dari 'Amru bahwa dia mendengar Sa'id bin Jubair berkata; Saya pernah mendengar Ibnu Umar berkata; Rasulullah shallallahu 'alaihi wasallam bersabda",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3749,
			"arabicnumber": "1493.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3750,
			"arabicnumber": "1493.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3751,
			"arabicnumber": "1493.06",
			"text": "Dan telah menceritakan kepada kami [Abu Ghazzan Al Misma'i] dan [Muhammad bin Al Mutsanna] serta [Ibnu Basysyar] sedangkan lafazhnya dari Al Misma'i dan Ibnu Al Mutsanna, mereka berkata; Telah menceritakan kepada kami [Mu'adz] dia adalah ibnu Hisyam, dia berkata; Telah menceritakan kepadaku [ayahku] dari [Qatadah] dari ['Azrah] dari [Sa'id bin Jubair] dia berkata; \"Mush'ab tidak memisahkan antara sepasang suami istri yang saling meli'an.\" Lalu Sa'id menyebutkan hal itu kepada [Abdullah bin Umar], maka dia berkata; Nabi shallallahu 'alaihi wasallam pernah memisahkan antara sepasang suami istri dari Bani Ajlan (yang saling meli'an)",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3752,
			"arabicnumber": "1494.01",
			"text": "Telah menceritakan kepada kami [Sa'id bin Manshur] dan [Qutaibah bin Sa'id] keduanya berkata; Telah menceritakan kepada kami [Malik]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Yahya bin Yahya] sedangkan lafazhnya darinya, dia berkata; Saya berkata kepada Malik; Apakah [Nafi'] telah menceritakan kepadamu dari [Ibnu Umar] bahwa seorang laki-laki yang meli'an istrinya di zaman Rasulullah shallallahu 'alaihi wasallam kemudian Rasulullah shallallahu 'alaihi wasallam memisahkan keduanya dan memberikan anak hasil serong itu kepada ibunya? Malik menjawab; \"Ya",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3753,
			"arabicnumber": "1494.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3754,
			"arabicnumber": "1494.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3755,
			"arabicnumber": "1495.01",
			"text": "Telah menceritakan kepada kami [Zuhair bin Harb] dan [Utsman bin Abi Syaibah] serta [Ishaq bin Ibrahim] sedangkan lafazhnya dari Zuhair. Ishaq mengatakan; Telah mengabarkan kepada kami, sedangkan yang dua mengatakan; Telah menceritakan kepada kami [Jarir] dari [Al A'masy] dari [Ibrahim] dari [Alqamah] dari [Abdullah] dia berkata; Pada malam Jum'at kami berada di Masjid, tiba-tiba datang seorang laki-laki dari Anshar sambil berkata; \"Bagaimana jika seorang suami mendapati istrinya sedang berkencan dengan laki-laki lain, apakah sang suami boleh menceritakannya kemudian kalian menderanya, ataukah sang suami membunuh laki-laki tersebut kemudian kalian mengqishahnya, atau haruskah suami diam saja, namun jika dia diam, demi Allah, dia diam dalam kemarahan! Sungguh saya akan menanyakan permasalahan ini kepada Nabi shallallahu 'alaihi wasallam.\" Di esok harinya, dia datang kepada Rasulullah shallallahu 'alaihi wasallam, lalu dia bertanya, dia berkata; \"Bagaimana jika seorang suami mendapati istrinya sedang berkencan dengan laki-laki lain, apakah sang suami boleh bercerita kemudian kalian menderanya, ataukah sang suami membunuh laki-laki tersebut lalu kalian mengqishashnya, atau haruskah dia diam saja, namun jika suami diam berarti diam dalam kemarahan yang sangat!\" Lalu beliau mengucapkan: \"Ya Allah, bukakanlah (jelaskanlah hukum ini kepada kami).\" Dan beliau pun berdo'a, lalu turunlah ayat li'an: \"Dan orang-orang yang menuduh istrinya (berzina) padahal mereka tidak mempunyai saksi-saksi selain diri mereka sendiri.\" Laki-laki tersebut telah diuji dengan perkara ini di antara manusia. Maka dia dan istrinya datang menemui Nabi shallallahu 'alaihi wasallam dan melakukan li'an, lelaki tersebut mengucapkan empat kali sumpah dengan nama Allah bahwa dia termasuk dari golongan yang benar, dan yang kelima kali dia melaknat dirinya bahwa laknat Allah siap ditimpakan kepadanya jika dia termasuk pendusta. Setelah itu ganti istrinya yang mengucapkan li'an, maka Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Tahanlah (jangan kamu lakukan).\" Namun dia enggan dan mengucapkan li'an, setelah keduanya pergi, beliau bersabda: \"Barangkali dia akan melahirkan anak yang berkulit hitam dan berambut keriting.\" Tidak lama kemudian dia melahirkan anak berkulit hitam dan berambut keriting. Dan telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Isa bin Yunus]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] telah menceritakan kepada kami ['Abdah bin Sulaiman] semuanya dari [A'masy] dengan isnad seperti ini",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3756,
			"arabicnumber": "1495.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3757,
			"arabicnumber": "1496",
			"text": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Abdul A'la] telah menceritakan kepada kami [Hisyam] dari [Muhammad] dia berkata; Saya bertanya kepada [Anas bin Malik] dan saya tahu bahwa dia orang yang berilmu, dia berkata; Sesungguhnya Hilal bin Umayyah menuduh istrinya berbuat serong dengan Syarik bin Sahma` yaitu saudara seibu Barra` bin Malik, dan laki-laki pertama kali yang melakukan li'an dalam Islam. Anas berkata; Lantas Hilal melakukan sumpah li'an di hadapan Rasulullah shallallahu 'alaihi wasallam, kemudian beliau bersabda: \"Coba perhatikan perempuan itu, jika nanti anaknya putih, berambut lurus dan mata agak merah, tandanya bayi tersebut anaknya Hilal bin Umayah, namun jika matanya agak hitam, rambutnya keriting dan betisnya ramping, maka bayi tersebut adalah milik Syarik bin Sahma`.\" Kata Anas; Kemudian saya diberitahu orang bahwa anak tersebut bermata hitam, berambut keriting dan berbetis ramping",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3758,
			"arabicnumber": "1497.01",
			"text": "Dan telah menceritakan kepada kami [Muhammad bin Rumh bin Al Muhajir] dan [Isa bin Hammad] keduanya dari negri Mesir, sedangkan lafazhnya dari Ibnu Rumh, keduanya berkata; Telah mengabarkan kepada kami [Al Laits] dari [Yahya bin Sa'id] dari [Abdurrahman bin Qasim] dari [Qasim bin Muhammad] dari [Ibnu Abbas] bahwa dia berkata; Pernah disebutkan orang yang melakukan li'an di hadapan Rasulullah shallallahu 'alaihi wasallam, lalu 'Ashim bin 'Adi berkata tentang hal itu dengan suatu ungkapan, setelah dia beranjak pergi, tiba-tiba seorang laki-laki dari kaumnya mengadu kepadanya bahwa dirinya mendapati istrinya sedang berkencan dengan laki-laki lain. 'Ashim pun menjawab; Saya belum pernah diuji dengan kasus seperti ini kecuali seperti apa yang telah saya katakan tadi. Lalu dia dengan laki-laki tersebut datang menemui Rasulullah shallallahu 'alaihi wasallam dan memberitahukan tentang apa yang telah dia dapati dari istrinya, laki-laki tersebut berperawakan kurus, agak kekuning-kuningan dan berambut keriting. Sedangkan laki-laki yang dituduhnya bersama istrinya adalah gemuk dan berbadan besar. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ya Allah, berilah kejelasan.\" Lalu perempuan tersbeut melahirkan anak yang mirip dengan llai-laki yang dituduh oleh suaminya bahwa ia berkencan dengan istrinya, kemudian Rasulullah shallallahu 'alaihi wasallam melakukan li'an terhadap pasangan suami istri. Ada seseorang yang berada di majlis Ibnu Abbas bertanya; \"Apakah wanita tersebut yang telah dikatakan oleh Rasulullah shallallahu 'alaihi wasallam bahwa: \"Sekiranya saya diperbolehkan merajam seseorang tanpa ada bukti yang jelas, maka saya akan merajamnya.\" Ibnu Abbas menjawab; \"Tidak, akan tetapi wanita tersebut adalah yang berita perbuatan kejinya telah menyebar.\" Dan telah menceritakan kepadaku [Ahmad bin Yusuf Al Azdi] telah menceritakan kepada kami [Isma'il bin Abi Uwais] telah menceritakan kepadaku [Sulaiman yaitu Ibnu Bilal] dari [Yahya] telah menceritakan kepadaku [Abdurrahman bin Qasim] dari [Qasim bin Muhammad] dari [Ibnu Abbas] bahwa dia berkata; Pernah disebutkan berita tentang pasangan suami istri yang saling meli'an di sisi Rasulullah shallallahu 'alaihi wasallam seperti haditsnya Al Laits, dan dalam haditsnya ada sedikit tambahan di perkataanya; \"Banyak dagingnya (gemuk).\" Dia berkata; \"Berambut keriting (tebal)",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 3759,
			"arabicnumber": "1497.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 3760,
			"arabicnumber": "1497.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 3761,
			"arabicnumber": "1498.01",
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Abdul Aziz yaitu Ad Darawardi] dari [Suhail] dari [ayahnya] dari [Abu Hurairah] bahwa Sa'ad bin 'Ubadah Al Anshari pernah bertanya kepada Rasulullah shallallahu 'alaihi wasallam; \"Wahai Rasulullah, bagaimana pendapatmu jika ada seorang suami mendapati lelaki lain sedang berkencan dengan isterinya, bolehkah dia membunuhnya?\" Rasulullah shallallahu 'alaihi wasallam menjawab: \"Tidak.\" Lantas Sa'ad berkata: \"Justru dia melakukannya (membunuhnya), demi Dzat yang telah mengutusmu dengan Al Haq.\" Maka Rasulullah shallallahu 'alaihi wasallam pun bersabda: \"Dengarlah apa yang telah dikatakan oleh pemuka kalian ini",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 3762,
			"arabicnumber": "1498.02",
			"text": "Telah menceritakan kepada kami [Zuhair bin Harb] telah menceritakan kepada kami [Ishaq bin Isa] telah menceritakan kepada kami [Malik] dari [Suhail] dari [ayahnya] dari [Abu Hurairah] bahwa Sa'ad bin Ubadah bertanya; \"Wahai Rasulullah, jika saya mendapati istriku bersama dengan lelaki lain, apakah saya membiarkannya sampai saya mendatangkan empat orang saksi?\" Beliau menjawab; \"Ya",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 3763,
			"arabicnumber": "1498.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 3764,
			"arabicnumber": "1499.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 3765,
			"arabicnumber": "1499.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 3766,
			"arabicnumber": "1500.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 3767,
			"arabicnumber": "1500.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 3768,
			"arabicnumber": "1500.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 3769,
			"arabicnumber": "1500.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 27
			}
		}
	]
}