{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"20": "The Book of Emancipating Slaves"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3770,
			"arabicnumber": "1501.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3771,
			"arabicnumber": "1501.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3772,
			"arabicnumber": "1502",
			"text": "",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3773,
			"arabicnumber": "1503.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3774,
			"arabicnumber": "1503.02",
			"text": "Dan telah menceritakan kepada kami [Amru An Naqid] telah menceritakan kepada kami [Isma'il bin Ibrahim] dari [Ibnu Abi Arubah] dari [Qatadah] dari [An Nadlr bin Anas] dari [Basyir bin Nahik] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa yang memerdekakan budak bagiannya (yang dimiliki secara bersama), maka ia harus memerdekakan dengan hartanya jika ia memiliki harta, jika ia tidak memiliki harta (untuk menebus bagian partnernya) maka budak tersebut dipekerjakan kepada partnernya sesuai dengan harga tebusannya tanpa memberatkannya.\" Dan telah menceritakan kepada kami ['Ali bin Khasyram] telah mengabarkan kepada kami [Isa yaitu Ibnu Yunus] dari [Sa'id bin Abi Arubah] dengan isnad ini, dengan menambahkan; \"Jika ia tidak memiliki harta, maka budak tersebut harganya dinilai dengan harga yang adil, kemudian ia dipekerjakan kepada pemilik (yang tidak memerdekakan) nya tanpa memberatkannya.\" Telah menceritakan kepadaku [Harun bin Abdullah] telah menceritakan kepada kami [Wahb bin Jarir] telah menceritakan kepada kami [ayahku] dia berkata; Saya mendengar [Qatadah] menceritakan dengan isnad ini seperti makna hadits Abu Arubah dan disebutkan dalam hadits \"(Harganya) dinilai dengan harga yang adil",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 3775,
			"arabicnumber": "1503.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3776,
			"arabicnumber": "1504.01",
			"text": "Dan telah menceritakan kepada kami [Yahya bin Yahya] dia berkata; Saya membaca di hadapan [Malik] dari [Nafi'] dari [Ibnu Umar] dari ['Aisyah] bahwa dia ingin membeli seorang budak perempuan yang akan dibebaskan, maka pemiliknya berkata; \"Kami akan menjual budak ini kepadamu dengan syarat perwaliannya untuk kami.\" Maka Aisyah memberitahukan hal itu kepada Rasulullah shallallahu 'alaihi wasallam, lantas beliau bersabda: \"Janganlah hal itu menghalangi kamu (untuk membelinya) karena perwalian itu untuk orang yang membebaskan budak",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3777,
			"arabicnumber": "1504.02",
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Al Laits] dari [Ibnu Syihab] dari ['Urwah] dari ['Aisyah] telah mengabarkan kepadanya bahwa Barirah datang kepada 'Aisyah untuk meminta bantuan dalam hal penebusan dirinya, sedangkan dia belum membayar tebusannya sama sekali, lalu 'Aisyah berkata kepadanya; \"Kembalilah kepada keluargamu, jika mereka mau saya akan membayar tebusanmu, dan hak perwalianmu padaku, maka saya akan melunasinya.\" Lalu Barirah menyampaikan hal itu kepada tuannya, namun tuannya tidak menyetujuinya, justru mereka berkata; \"Silahkan jika Aisyah ingin menebusmu, namun hak perwalianmu tetap pada kami.\" Kemudian Aisyah memberitahukan hal itu kepada Rasulullah shallallahu 'alaihi wasallam, lantas Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Tebuslah dan merdekakanlah dia, karena hak perwalian itu bagi orang yang memerdekakan.\" Setelah itu Rasulullah shallallahu 'alaihi wasallam berdiri sambil bersabda: \"Apa urusan orang-orang yang memberikan persyaratan yang tidak pernah ada pada Kitabullah. Barangsiapa yang mensyaratkan suatu syarat yang tidak terdapat dalam Kitabullah, maka ia tidak berhak mendapatkannya, walaupun dia mensyaratkan seratus kali, kerana syarat Allah lebih berhak untuk dilaksanakan dan lebih kuat.\" Telah menceritakan kepada kami [Abu Thahir] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dari ['Urwah bin Zubair] dari ['Aisyah, istri Nabi shallallahu 'alaihi wasallam] telah mengabarkan",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3778,
			"arabicnumber": "1504.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3779,
			"arabicnumber": "1504.04",
			"text": "Telah menceritakan kepada kami [Abu Kuraib Muhammad bin Al 'Ala` Al Hamdani] telah menceritakan kepada kami [Abu Usamah] telah menceritakan kepada kami [Hisyam bin Urwah] telah mengabarkan kepadaku [ayahku] dari ['Aisyah] dia berkata; Suatu ketika Barirah menemuiku dan berkata; \"Sesungguhnya keluargaku (tuanku) berjanji akan membebaskanku jika saya mampu menebus diriku dengan sembilan uqiyah selama sembilan tahun, dan saya harus membayar satu uqiyah setiap setahun, oleh karena itu bantulah saya.\" Maka saya berkata kepadanya; \"Jika keluargamu (tuanmu) rela maka saya akan menebusmu secara kontan (yaitu sembilan uqiyah sekaligus), saya akan membebaskanmu, dan hak perwalianmu padaku.\" Setelah itu dia menyampaikan hal itu kepada keluarganya (tuannya), namun mereka menolak kecuali jika hak perwaliannya tetap pada mereka. Kemudian dia menemuiku dan menyampaikan hal itu kepadaku, lalu saya meghardiknya dan berkata; \"Demi Allah, tidak seperti itu aturannya.\" Aisyah melanjutkan; Ternyata Rasulullah shallallahu 'alaihi wasallam mendengar hal ini, maka beliau bertanya kepadaku, lalu saya memberitahukan kepada beliau apa yang terjadi. Lantas beliau bersabda: \"Belilah dia dan bebaskanlah dia serta mintalah syarat supaya perwalian ada padamu, sebab perwalian itu bagi orang yang memerdekakan.\" Akhirnya saya malakukannya. Tidak lama setelah itu, Rasulullah shallallahu 'alaihi wasallam berkhutbah di waktu Isya`, setelah beliau memuji Allah dengan puji-pujian yang pantas bagi-Nya, beliau lalu bersabda: \"Amma Ba'du, apa urusannya orang-orang memberikan persyaratan? Persyaratan apa saja yang tidak pernah ada pada Kitabullah Azza Wa Jalla, maka persyaratannya bathil walaupun dia mensyaratkan seratus kali, sebab Kitabullah lebih berhak untuk ditunaikan dan syarat Allah lebih kuat. Lantas apa urusannya salah seorang dari kalian yang mengatakan; 'Merdekakanlah fulan dengan syarat perwaliannya masih padaku, \" sesungguhnya perwalian itu bagi orang yang memerdekakan.\" Dan telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] dan [Abu Kuraib] keduanya berkata; Telah menceritakan kepada kami [Abu Numair]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Waki']. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Zuhair bin Harb] dan [Ishaq bin Ibrahim] semuanya dari [Jarir] semuanya dari [Hisyam bin Urwah] dengan isnad ini, seperti hadits riwayat Abu Usamah, hanya saja dia dalam hadits Jabir disebutkan; Bahwa suaminya (Barirah) statusnya masih budak, lalu Rasulullah shallallahu 'alaihi wasallam memberikan pilihan, maka dia memilih dirinya, seandainya suaminya medeka niscaya beliau tidak memberinya pilihan. Dan dalam hadits mereka tidak disebutkan; \"Amma ba'du",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3780,
			"arabicnumber": "1504.05",
			"text": "",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3781,
			"arabicnumber": "1504.06",
			"text": "Telah menceritakan kepada kami [Zuhair bin Harb] dan [Muhammad bin Al 'Ala`] sedangkan lafazhnya dari Zuhair, keduanya berkata; Telah menceritakan kepada kami [Abu Mu'awiyah] telah menceritakan kepada kami [Hisyam bin Urwah] dari [Abdurrahman bin Qasim] dari [ayahnya] dari ['Aisyah] dia berkata; Barirah memiliki tiga perkata, yaitu tuannya menginginkan untuk menjualnya dengan syarat perwaliannya untuk mereka, lantas hal itu saya sampaikan kepada Nabi shallallahu 'alaihi wasallam, maka beliau bersabda: \"Belilah dan bebaskanlah dia, karena sesungguhnya perwalian itu bagi orang yang memerdekakannya.\" Aisyah melanjutkan; Kemudian dia dibebaskan, setelah itu Rasulullah shallallahu 'alaihi wasallam memberikan pilihan (antara dirinya atau tetap bersama suaminya yang masih budak), namun dia memilih dirinya. Aisyah melanjutkan; Suatu ketika orang-orang bersedekah kepadanya, dan dia menghadiahkannya kepada kami, lalu saya memberitahukan hal itu kepada Nabi shallallahu 'alaihi wasallam, maka beliau bersabda: \"Hal itu buatnya adalah sedekah, namun buat kalian adalah hadiah darinya, maka makanlah",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3782,
			"arabicnumber": "1504.07",
			"text": "Telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] telah menceritakan kepada kami [Husain bin 'Ali] dari [Za`idah] dari [Simak] dari [Abdurrahman bin Qasim] dari [ayahnya] dari ['Aisyah] bahwa dia membeli Barirah dari keluarga orang Anshar, namun mereka mensyaratkan hak perwalian. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hak perwalian itu bagi orang yang memerdekakannya.\" Lalu Rasulullah shallallahu 'alaihi wasallam memberikan pilihan, saat itu suaminya adalah seorang budak, dan dia pernah menghadiahkan daginga kepada Aisyah, maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sekiranya kalian membuat makanan dari daging ini.\" 'Aisyah berkata; \"Ini adalah daging yang disedekahkan kepada Barirah.\" Maka beliau bersabda: \"Daging itu untuknya adalah sedekah sedangkan untuk kita adalah hadiah",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3783,
			"arabicnumber": "1504.08",
			"text": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dia berkata; Saya mendengar [Abdurrahman bin Qasim] berkata; Saya mendengar [Qasim] menceritakan dari ['Aisyah] bahwa dia hendak membeli Barirah untuk dibebaskan, namun keluarganya mensyaratkan hak perwalian, lalu hal itu disampaikan kepada Rasulullah shallallahu 'alaihi wasallam, maka beliau bersabda: \"Belilah dan bebaskanlah dia, karena hak perwalian itu bagi orang yang memerdekakannya.\" Kemudian Rasulullah shallallahu 'alaihi wasallam diberi hadiah sepotong daging, mereka (keluarga Nabi) berkata kepada Nabi shallallahu 'alaihi wasallam, \"Daging ini disedekahkan kepada Barirah. Maka beliau bersabda: \"Baginya adalah sedekah sedangkan bagi kita adalah hadiah.\" Dan dia juga diberi pilihan. Andurrahman berkata; Suaminya adalah seorang yang merdeka. Syu'bah berkata; Kemudian saya bertanya kepadanya tentang status suaminya, dia menjawab; Saya tidak tahu. Dan telah menceritakan kepada kami [Ahmad bin Utsman An Naufali] telah menceritakan kepada kami [Abu Daud] telah menceritakan kepada kami [Syu'bah] dengan isnad seperti ini",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3784,
			"arabicnumber": "1504.09",
			"text": "",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3785,
			"arabicnumber": "1504.10",
			"text": "Dan telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Ibnu Basysyar] semuanya dari [Abu Hisyam]. [Ibnu Al Mutsanna] berkata; Telah menceritakan kepada kami [Mughirah bin Salamah Al Makhzumi Abu Hisyam] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami ['Ubaidullah] dari [Yazid bin Ruman] dari [Urwah] dari ['Aisyah] bahwa suami Barirah adalah seorang budak",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 3786,
			"arabicnumber": "1504.11",
			"text": "Telah menceritakan kepada kami [Abu Thahir] telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepada kami [Malik bin Anas] dari [Rabi'ah bin Abi Abdirrahman] dari [Qasim bin Muhammad] dari ['Aisyah] istri Nabi shallallahu 'alaihi wasallam bahwa dia berkata; \"Dalam kasus Barirah ada tiga pelajaran yaitu; dia diberi pilihan atas suaminya ketika dia dibebaskan, dia juga pernah diberi daging, lalu Rasulullah shallallahu 'alaihi wasallam masuk ke rumahku, ketika itu ada tungku yang sedang dipanasi di atas api, kemudian beliau meminta dihidangkan makanan, lalu beliau diberi roti dan lauk pauk yang ada di rumah, lalu beliau bertanya: \"Tidakkah tadi saya melihat periuk di atas api yang berisi daging?\" Mereka menjawab; \"Ya, wahai Rasulullah, itu adalah daging yang tadi disedekahkan kepada Barirah, sehingga kami tidak suka untuk memberikannya kepada Anda.\" Beliau bersabda: \"Daging tersebut bagi Barirah adalah sedekah, sedangkan bagi kita adalah hadiah dari Barirah.\" Dan Nabi shallallahu 'alaihi wasallam bersabda mengenai dirinya: \"Sesungguhnya hak perwalian adalah untuk orang yang memerdekakan",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 3787,
			"arabicnumber": "1505",
			"text": "Telah menceritakan kepada kami [Abu Bakar bin Abi syaibah] telah menceritakan kepada kami [Khalid bin Makhlad] dari [Sulaiman bin Bilal] telah menceritakan kepadaku [Suhail bin Abi Shalih] dari [ayahnya] dari [Abu Hurairah] dia berkata; 'Aisyah pernah ingin membeli seorang budak yang ingin dimerdekakan, tapi tuannya menolak kecuali jika hak perwaliannya diberikan kepada mereka. Kemudian hal itu disampaikan kepada Rasulullah shallallahu 'alaihi wasallam, lalu berliau bersabda: \"Hal itu bukan menjadi penghalang bagimu, karena hak perwalian itu untuk orang yang memerdekakan",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 3788,
			"arabicnumber": "1506.01",
			"text": "",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 3789,
			"arabicnumber": "1506.02",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya At Tamimi] telah mengabarkan kepada kami [Sulaiman bin Bilal] dari [Abdullah bin Dinar] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam melarang jual beli wala' dan menghibahkannya. Muslim berkata; \"Manusia semuanya akan selalu membutuhkan Abdullah bin Dinar dalam permasalahan hadits ini.\" Telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] dan [Zuhair bin Harb] keduanya berkata; Telah menceritakan kepada kami [Ibnu 'Uyainah]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Yahya bin Ayyub] dan [Qutaibah] serta [Ibnu Hujr] mereka berkata; Telah menceritakan kepada kami [Isma'il bin Ja'far]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Sufyan bin Sa'id]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Ibnu Al Mutsanna] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Ibnu Al Mutsanna] dia berkata; Telah menceritakan kepada kami [Abdul Wahhab] telah menceritakan kepada kami ['Ubaidullah]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Ibnu Rafi'] telah menceritakan kepada kami [Abu Fudaik] telah mengabarkan kepada kami [Adl Dlahhak yaitu Ibnu Utsman] mereka semuanya dari [Abdullah bin Dinar] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam seperti hadits di atas, hanya saja dalam hadits riwayat At Tsaqafi dari Ubaidillah tidak disebutkan kecuali tentang jual beli dan tidak menyebutkan hibah",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 3790,
			"arabicnumber": "1507",
			"text": "Dan telah menceritakan kepada kami [Muhammad bin Rafi'] telah menceritakan kepada kami [Abdur Razzaq] telah mengabarkan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Abu Az Zubair] bahwa dia mendengar [Jabir bin Abdullah] berkata; Nabi shallallahu 'alaihi wasallam menetapkan denda di setiap isi perut (janin), beliau juga menetapkan bahwa tidak halal bagi seorang Muslim mempekerjakan budak milik muslim lainnya tanpa seizinnya. Kemudian saya diberitahu bahwa beliau pernah melaknat siapa saja yang melakukan hal itu di secarik kertas",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 3791,
			"arabicnumber": "1508.01",
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Ya'qub yaitu Ibnu Abdurrahman Al Qari], dari [Suhail] dari [ayahnya] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa menjadikan budak suatu kaum tanpa seizin walinya (tuannya) maka baginya adalah laknat Allah dan para Malaikat, serta tidak akan diterima ibadahnya maupun taubatnya",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 3793,
			"arabicnumber": "1508.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 3794,
			"arabicnumber": "1370.04",
			"text": "Telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Abu Mu'awiyah] telah menceritakan kepada kami [Al A'masy] dari [Ibrahim At Taimi] dari [ayahnya] dia berkata; \" [Ali bin Abi Thalib] berkhutbah, seraya mengatakan; \"Barangsiapa yang mengira bahwa di sisi kami ada sesuatu yang kami baca selain Kitabullah dan lembaran ini -ayah Ibrahim berkata; saat itu lembaran tesebut menggantung di sarungnya- sungguh dia telah berdusta, di dalamnya terdapat penjelasan tentang umur-rumu unta dan hukum-hukum melukai, dan di dalamnya juga tertulis bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kota Madinah dijadikan kota Haram (suci) yaitu antara 'Air hingga Tsaur. Barangsiapa yang berbuat kejahatan padanya atau melindungi pelaku kejahatan, maka ia berhak mendapat laknat Allah, Maliakat dan seluruh manusia, tidak diterima amalan fardhu maupun amalan sunnahnya. Jaminan (perlindungan) kaum Muslimin adalah satu, di mana bisa diusahakan oleh orang yang paling rendah dari mereka sekalipun. Barangsiapa yang menisbatkan diri kepada selain ayahnya, atau kepada selain walinya, maka ia berhak mendapatkan laknat dari Allah, para Malaikat dan manusia seluruhnya, Allah tidak akan menerima amalan fardhunya maupun amalam sunnahnya kelak di Hari Kiamat",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 3795,
			"arabicnumber": "1509.01",
			"text": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna Al 'Anazi] telah menceritakan kepada kami [Yahya bin Sa'id] dari [Abdullah bin Sa'id] dia adalah Ibnu Abi Hind, telah menceritakan kepadaku [Isma'il bin Abi Hakim] dari [Sa'id bin Marjanah] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Barangsiapa yang memerdekakan budak beriman, maka Allah akan membebaskan setiap anggota tubuhnya dari api neraka dengan setiap anggota tubuh budak yang dia merdekakan",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 3796,
			"arabicnumber": "1509.02",
			"text": "Dan telah menceritakan kepada kami [Daud bin Rusyaid] telah menceritakan kepada kami [Walid bin Muslim] dari [Muhammad bin Mutharrif Abu Ghassan Al Madani] dari [Zaid bin Aslam] dari ['Ali bin Husain] dari [Sa'id bin Marjanah] dari [Abu Hurairah] dari Rasulullah shallallahu 'alaihi wasallam beliau bersabda: \"Barangsiapa yang memerdekakan budak, maka Allah akan membebaskan setiap anggota badannya dari api neraka dengan setiap anggota badan budak yang dimerdekakan, hingga kemaluannya dengan kemaluan (budak yang dimerdekakan)",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 3797,
			"arabicnumber": "1509.03",
			"text": "Dan telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Al Laits] dari [Ibnu Al Hadi] dari [Umar bin Ali bin Husain] dari [Sa'id bin Marjanah] dari [Abu Hurairah] dia berkata, saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang membebaskan buda beriman, maka Allah akan membebaskan setiap anggota badannya dari api neraka dengan seiap anggota tubuh budak yang dia merdekakan, sampai kemaluan dengan kemaluannya",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 3798,
			"arabicnumber": "1509.04",
			"text": "Telah menceritakan kepada kami [Humaid bin Mas'adah] telah menceritakan kepada kami [Bisr bin Al Mufadldlal] telah menceritakan kepada kami ['Ashim] dia adalah Ibnu Muhammad Al Umari, telah menceritakan kepada kami [Waqid] yaitu saudara laki-lakinya, telah menceritakan kepadaku [Sa'id bin Marjanah] sahabat Ali bin Husain, dia berkata; Saya mendengar [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapa saja seorang muslim yang memerdekakan muslim lainnya, maka Allah akan menyelamatkan setiap anggota tubuhnya dari api neraka dengan setiap anggota tubuh orang yang dimerdekakannya.\" Sa'id berkata; Setelah mendengar penuturan Abu Hurairah, saya bergegas menemui Ali bin Husain dan menyampaikan hal itu kepadanya, lantas dia memerdekakan budak dari pemberian Ibnu Ja'far dengan tebusan sepuluh ribu dirham atau seribu dinar",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 3799,
			"arabicnumber": "1510.01",
			"text": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Zuhair bin Harb] keduanya berkata; Telah menceritakan kepada kami [Jarir] dari [Suhail] dari [ayahnya] dari [Abu Hurairah] dia berkata, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang anak belum dikatakan membalas (kebaikan) orang tuanya, kecuali jika didapati bapaknya sebagai sahaya, lalu dia membelinya dan memerdekakannya.\" Dan dalam riwayatnya Abu Syaibah dikatakan; \"Seorang anak terhadap ayahnya.\" Dan telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [ayahku]. Dan diriwayatkan dari jalur lain, telah menceritakan kepadaku ['Amru An Naqid] telah menceritakan kepada kami [Abu Ahmad Az Zubairi] semuanya dari [Sufyan] dari [Suhail] dengan isnad seperti ini, dan mereka menyebutkan; \"Seorang anak terhadap ayahnya",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 3800,
			"arabicnumber": "1510.02",
			"text": "",
			"grades": [],
			"reference": {
				"book": 20,
				"hadith": 30
			}
		}
	]
}