{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"25": "The Book of Wills"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4204,
			"arabicnumber": "1627.01",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 4205,
			"arabicnumber": "1627.02",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 4206,
			"arabicnumber": "1627.03",
			"text": "Telah menceritakan kepada kami [Abu Khaitsamah Zuhair bin Harb] dan [Muhammad bin Al Mutsanna Al 'Anazi] dan ini adalah lafadz Ibnu Mutsanna, keduanya berkata; telah menceritakan kepada kami [Yahya] -yaitu Ibnu Sa'id Al Qatthan- dari ['Ubaidullah] telah mengabarkan kepadaku [Nafi'] dari [Ibnu Umar], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak halal bagi seorang Muslim bermalam selama dua malam, padahal ia mempunyai sesuatu yang harus ia wasiatkan, kecuali wasiat tersebut tertulis di sisinya.\" Dan telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] Telah menceritakan kepada kami ['Abdah bin Sulaiman] dan [Abdullah bin Numair]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepadaku [Ayahku] keduanya dari [Ubaidullah] dengan sanad ini, hanya saja keduanya menyebutkan, \"Dan dia memiliki sesuatu untuk diwasiatkan.\" Dan tidak menyebutkan, \"Memiliki sesuatu untuk ia wasiatkan.\" Dan telah menceritakan kepada kami [Abu Kamil Al Jahdari] telah menceritakan kepada kami [Hammad] -yaitu Ibnu Zaid-. (dalam jalur lain disebutkan) Telah menceritakan kepadaku [Zuhair bin Harb] telah menceritakan kepada kami [Isma'il] -yaitu Ibnu 'Ulayyah- keduanya dari [Ayyub]. (dalam jalur lain disebutkan) Telah menceritakan kepadaku [Abu At Thahir] telah mengabarkan kepada kami [Ibnu Wahhab] telah mengabarkan kepadaku [Yunus]. (dalam jalur lain disebutkan) Telah menceritakan kepadaku [Harun bin Sa'id Al Aili] telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Usamah bin Zaid Al Laitsi]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Rafi'] telah menceritakan kepada kami [Ibnu Abu Fudaik] telah mengabarkan kepada kami [Hisyam yaitu Ibnu Sa'd] semuanya dari [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam seperti hadits riwayat Ubaidullah, mereka semua menyebutkan dengan lafadz, \"Dan dia memiliki sesuatu untuk diwasiatkan.\" Kecuali dalam hadits Ayyub, ia menyebutkan dengan lafadz, \"Memiliki sesuatu untuk ia wasiatkan.\" Seperti riwayat Yahya dari 'Ubaidullah",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4207,
			"arabicnumber": "1627.04",
			"text": "Telah menceritakan kepada kami [Harun bin Ma'ruf] telah menceritakan kepada kami [Abdullah bin Wahb] telah mengabarkan kepadaku ['Amru] -yaitu Ibnu Al Harits- dari [Ibnu Syihab] dari [Salim] dari [Ayahnya], bahwa dia pernah mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak halal bagi seorang Muslim bermalam selama tiga malam, padahal ia mempunyai sesuatu yang harus ia wasiatkan, kecuali wasiat tersebut tertulis di sisinya.\" [Abdullah bin Umar] mengatakan, \"Sejak mendengar sabda Rasulullah shallallahu 'alaihi wasallam tersebut, maka tidak ada satu malam pun yang berlalu melainkan di sisi saya telah terdapat surat wasiatku.\" Dan telah menceritakan kepadaku [Abu At Thahir] dan [Harmalah] keduanya berkata; telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus]. (dalam jalur lain disebutkan) Telah menceritakan kepadaku [Abdul Malik bin Syu'aib bin Al Laits] telah menceritakan kepadaku [Ayahku] dari [kakekku] telah menceritakan kepadaku ['Uqail]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ibnu Abu 'Umar] dan ['Abd bin Humaid] keduanya berkata; telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ma'mar] semuanya dari [Az Zuhri] dengan sanad ini seperti hadits 'Amru bin Al Harits",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 4208,
			"arabicnumber": "1627.05",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 4209,
			"arabicnumber": "1628.01",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya At Taimi] telah mengabarkan kepada kami [Ibrahim bin Sa'd] dari [Ibnu Syihab] dari ['Amir bin Sa'd] dari [Ayahnya] dia berkata, \"Pada saat haji wada', Rasulullah shallallahu 'alaihi wasallam datang menjengukku yang sedang terbaring sakit, lalu saya berkata, \"Wahai Rasulullah, keadaan saya semakin parah seperti yang telah anda lihat saat ini, sedangkan saya adalah orang yang memiliki banyak harta, dan saya hanya memiliki seorang anak perempuan yang akan mewarisi harta peninggalan saya, maka bolehkah saya menyedekahkan dua pertiga dari harta saya?\" beliau bersabda: \"Jangan.\" Saya bertanya lagi, \"Bagaimana jika setengahnya?\" beliau menjawab: \"Jangan, tapi sedekahkanlah sepertiganya saja, dan sepertiganya pun sudah banyak. Sebenarnya jika kamu meninggalkan ahli warismu dalam keadaan kaya, itu lebih baik daripada kamu meninggalkan mereka dalam keadaan yang serba kekurangan dan meminta minta kepada orang lain. Tidakkah Kamu menafkahkan suatu nafkah dengan tujuan untuk mencari ridla Allah, melainkan kamu akan mendapatkan pahala karena pemberianmu itu, hingga sesuap makanan yang kamu suguhkan ke mulut isterimu juga merupakan sedekah darimu.\" Sa'ad berkata, \"Saya bertanya lagi, \"Wahai Rasulullah, apakah saya masih tetap hidup, sesudah teman-teman saya meninggal dunia?\" beliau menjawab: \"Sesungguhnya kamu tidak akan panjang umur kemudian kamu mengerjakan suatu amalan dengan tujuan untuk mencari ridla Allah, kecuali dengan amalan itu derajatmu akan semakin bertambah, semoga kamu dipanjangkan umurmu sehingga kaum Muslimin mendapatkan manfaat darimu dan orang-orang menderita kerugian karenamu. Ya Allah… sempurnakanlah hijrah para sahabatku dan janganlah kamu kembalikan mereka kepada kekufuran, akan tetapi alangkah kasihannya Sa'd bin Khaulah.\" Sa'd berkata, \"Kemudian Rasulullah shallallahu 'alaihi wasallam mendo'akannya agar ia meninggal di kota Makah.\" Telah menceritakan kepada kami [Qutaibah bin Sa'id] dan [Abu Bakar bin Abu Syaibah] keduanya berkata; telah menceritakan kepada kami [Sufyan bin 'Uyainah]. (dalam jalur lain disebutkan) Telah menceritakan kepadaku [Abu At Thahir] dan [Harmalah] keduanya berkata; telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ishaq bin Ibrahim] dan ['Abd bin Humaid] keduanya berkata; telah mengabarkan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ma'mar] semuanya dari [Az Zuhri] dengan isnad seperti ini.\" Dan telah menceritakan kepadaku [Ishaq bin Manshur] telah menceritakan kepada kami [Abu Daud Al Hafari] dari [Sufyan] dari [Sa'd bin Ibrahim] dari ['Amir bin Sa'd] dari [Sa'd] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam datang menjengukku, kemudian dia menyebutkan hadits sebagaimana makna hadits Az Zuhri, namun ia tidak menyebutkan sabda Nabi shallallahu 'alaihi wasallam mengenai Sa'd bin Khaulah kecuali kalimat, \"Dan dia tidak suka jika meninggal dunia di daerah hijrahnya",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 4210,
			"arabicnumber": "1628.02",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 4211,
			"arabicnumber": "1628.03",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 4212,
			"arabicnumber": "1628.04",
			"text": "Dan telah menceritakan kepadaku [Zuhair bin Harb] telah menceritakan kepada kami [Al Hasan bin Musa] telah menceritakan kepada kami [Zuhair] telah menceritakan kepada kami [Simak bin Harb] telah menceritakan kepadaku [Mush'ab bin Sa'd] dari [Ayahnya] dia berkata, \"Ketika saya sakit, maka saya mengutus seseorang untuk menemui Nabi shallallahu 'alaihi wasallam. Saya berkata, \"Biarkanlah saya membagi hartaku sekehendakku.\" Namun beliau tidak membolehkannya, saya berkata lagi, \"Bagaimana jika setengahnya.\" Beliau pun tetap tidak membolehkannya, saya berkata lagi, \"Bagaimana jika sepertiganya.\" Sa'd berkata, \"Beliau diam setelah saya mengatakan sepertiganya.\" Dia melanjutkan, \"Dan sepertinya beliau membolehkan sepertiganya.\" Telah menceritakan kepadaku [Muhammad bin Al Mutsanna] dan [Ibnu Basysyar] keduanya berkata; telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Simak] dengan sanad-sanad seperti ini, namun dia tidak menyebutkan, \"Dan sepertinya beliau membolehkan sepertiga",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 4213,
			"arabicnumber": "1628.05",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 4214,
			"arabicnumber": "1628.06",
			"text": "Dan telah menceritakan kepadaku [Al Qasim bin Zakaria] telah menceritakan kepada kami [Hunain bin Ali] dari [Zaidah] dari [Abdul Malik bin 'Umair] dari [Mush'ab bin Sa'd] dari [Ayahnya] dia berkata, \"Nabi shallallahu 'alaihi wasallam datang menjengukku, maka saya pun berkata, \"Saya telah mewasiatkan hartaku semuanya.\" Beliau bersabda: \"Jangan.\" Saya berkata lagi, \"Bagaimana jika setengahnya?\" beliau bersabda: \"Jangan.\" Saya berkata lagi, \"Bagaimana jika sepertiganya?\" beliau menjawab: \"Ya, tidak mengapa. Sepertiga itu sudah banyak",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 4215,
			"arabicnumber": "1628.07",
			"text": "Telah menceritakan kepada kami [Muhammad bin Abu Umar Al Makki] telah menceritakan kepada kami [Ats Tsaqafi] dari [Ayyub As Sakhtiyani] dari ['Amru bin Sa'id] dari [Humaid bin Abdurrahman Al Himyari] dari [ketiga anak Sa'd] semuanya telah menceritakan kepadanya dari [Ayahnya], bahwa Nabi shallallahu 'alaihi wasallam datang menjenguknya di Makkah, kemudian dia pun menangis hingga menjadikan Nabi bertanya kepadanya: \"Apa yang membuatmu menangis?\" Sa'd menjawab, \"Saya khawatir akan meninggal dunia di tempat kelahiran yang pernah kutinggalkan, sebagaimana meninggalnya Sa'd bin Khaulah.\" Maka Nabi shallallahu 'alaihi wasallam berdo'a: 'Ya Allah, sembuhkanlah Sa'd. Ya Allah, sembuhkanlah Sa'd.' - tiga kali-. Sa'd lalu berkata, \"Wahai Rasulullah, sesungguhnya saya memiliki harta yang banyak, dan hanya puteriku satu-satunya yang menjadi ahli warisku, bagaimana jika saya mewasiatkan seluruh hartaku?\" beliau menjawab: \"Jangan.\" Sa'd bertanya lagi, \"Bagaimana jika dua pertiganya?\" beliau menjawab: \"Jangan.\" Sa'd bertanya lagi, \"Bagaimana jika setengahnya?\" beliau menjawab: \"Jangan.\" Sa'd berkata lagi, \"Bagaimana jika sepertiganya?\" beliau menjawab: \"Sepertiga, sepertiga sudah banyak. Sesungguhnya harta yang kamu sedekahkan pasti akan mendapatkan pahala, sekalipun yang kamu belanjakan untuk keluargamu dan yang dimakan isterimu. Jika kamu tinggalkan keluargamu dalam keadaan baik -atau sabdanya- kaya, itu lebih baik daripada kamu tinggalkan mereka meminta-minta kepada orang banyak dan menadahkan tangannya.\" Dan telah menceritakan kepadaku [Abu Ar Rabi' Al Ataki] telah menceritakan kepada kami [Hammad] telah menceritakan kepada kami [Ayyub] dari ['Amru bin Sa'id] dari [Humaid bin Abdurrahman Al Himyari] dari [ketiga anaknya Sa'd] mereka berkata, \" [Sa'd] pernah sakit di Makkah, maka Rasulullah shallallahu 'alaihi wasallam datang menjenguknya…seperti hadits At Tsaqafi.\" Dan telah menceritakan kepadaku [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Abdul A'la] telah menceritakan kepada kami [Hisyam] dari [Muhammad] dari [Humaid bin Abdurrahman] telah menceritakan kepadaku [ketiga anak Sa'd bin Malik] semuanya pernah menceritakan kepadaku, seperti hadits sahabatnya. Dia mengatakan, \" [Sa'd] pernah sakit di Makkah, lantas Nabi shallallahu 'alaihi wasallam datang menjenguknya….seperti hadits 'Amru bin Sa'id dari Humaid Al Himyari",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 4216,
			"arabicnumber": "1628.08",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 4217,
			"arabicnumber": "1628.09",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 4218,
			"arabicnumber": "1629",
			"text": "Telah menceritakan kepadaku [Ibrahim bin Musa Ar Razi] telah mengabarkan kepada kami [Isa] -yaitu Ibnu Yunus-. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Abu Kuraib] keduanya berkata; telah menceritakan kepada kami [Waki']. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Ibnu Numair] semuanya dari [Hisyam bin 'Urwah] dari [Ayahnya] dari [Ibnu Abbas] dia berkata, \"Alangkah baiknya jika orang-orang mengurangi sepertiga dari harta yang diwasiatkan menjadi seperempat, karena Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sepertiga itu sudah cukup banyak.\" Dan dalam hadits Waki' disebutkan, \"Cukup besar.\" Atau, \"Cukup banyak",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 4219,
			"arabicnumber": "1630",
			"text": "Telah menceritakan kepada kami [Yahya bin Ayyub] dan [Qutaibah bin Sa'id] dan [Ali bin Hujr] mereka berkata; telah menceritakan kepada kami [Isma'il] -yaitu Ibnu Ja'far- dari [Al 'Ala'] dari [Ayahnya] dari [Abu Hurairah], bahwa seorang laki-laki bertanya kepada Nabi shallallahu 'alaihi wasallam, \"Ayahku telah meninggal dunia dan meninggalkan harta, namun dia tidak memberi wasiat terhadap harta yang ditinggalkannya, dapatkah harta itu menghapus dosa-dosanya jika harta tersebut saya sedekahkan atas namanya?\" beliau menjawab: \"Ya",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 4220,
			"arabicnumber": "1004.03",
			"text": "Telah menceritakan kepada kami [Zuhair bin Harb] telah menceritakan kepada kami [Yahya bin Sa'id] dari [Hisyam bin 'Urwah] telah mengabarkan kepadaku [Ayahku] dari ['Aisyah], bahwa seorang laki-laki bertanya kepada Nabi shallallahu 'alaihi wasallam, katanya, \"Sesungguhnya ibuku telah meninggal dunia, dan saya kira jika dia dapat bicara dia akan bersedekah, apakah saya juga akan mendapatkan pahala jika saya bersedekah atas namanya?\" beliau menjawab: \"Ya",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 4221,
			"arabicnumber": "1004.04",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 4222,
			"arabicnumber": "1004.05",
			"text": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] telah menceritakan kepada kami [Muhammad bin Bisyr] telah menceritakan kepada kami [Hisyam] dari [Ayahnya] dari ['Aisyah], bahwa seorang laki-laki datang kepada Nabi shallallahu 'alaihi wasallam seraya bertanya, \"Wahai Rasulullah, sesungguhnya ibuku telah meninggal dunia dan belum berwasiat sesuatupun, saya kira jika dia dapat bicara (ketika masih hidup) dia akan bersedekah, apakah dia mendapatkan pahala jika saya bersedekah atas namanya?\" beliau bersabda: \"Ya.\" Dan telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Abu Usamah]. (dalam jalur lain disebutkan) Telah menceritakan kepadaku [Al Hakam bin Musa] telah menceritakan kepada kami [Syu'aib bin Ishaq]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Umayyah bin Bistham] telah menceritakan kepada kami [Yazid] -yaitu Ibnu Zurai'- telah menceritakan kepada kami [Rauh] -yaitu Ibnu Al Qasim-. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Ja'far bin 'Aun] semuanya dari [Hisyam bin 'Urwah] dengan sanad-sanad ini. Adapun dalam hadits Usamah dan Rauh disebutkan, \"Apakah saya juga akan mendapatkan pahala.\" Sebagaimana perkataan Yahya bin Sa'id, sedangkan dalam haditsnya Syu'aib dan Ja'far disebutkan, \"Apakah dia akan mendapatkan pahala.\" Sebagaimana riwayat Ibnu Bisyr",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 4223,
			"arabicnumber": "1631",
			"text": "Telah menceritakan kepada kami [Yahya bin Ayyub] dan [Qutaibah] -yaitu Ibnu Sa'id- dan [Ibnu Hujr] mereka berkata; telah menceritakan kepada kami [Isma'il] -yaitu Ibnu Ja'far- dari [Al 'Ala'] dari [Ayahnya] dari [Abu Hurairah], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang manusia meninggal dunia, maka terputuslah segala amalannya kecuali tiga perkara; sedekah jariyah, ilmu yang bermanfa'at baginya dan anak shalih yang selalu mendoakannya",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 4224,
			"arabicnumber": "1632.01",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya At Tamimi] telah mengabarkan kepada kami [Sulaim bin Ahdlar] dari [Ibnu 'Aun] dari [Nafi'] dari [Ibnu Umar] dia berkata, \"Umar mendapatkan bagian tanah perkebunan di Khaibar, lalu dia datang kepada Nabi shallallahu 'alaihi wasallam dan meminta saran mengenai bagian tersebut, dia berkata, \"Wahai Rasulullah, saya mendapat bagian tanah perkebunan di Khaibar, dan saya belum pernah mendapatkan harta yang sangat saya banggakan seperti kebun itu, maka apa yang anda perintahkan mengenai kebun tersebut?\" beliau menjawab: \"Jika kamu mau, peliharalah pohonnya dan sedekahkanlah hasilnya.\" Ibnu Umar berkata, \"Kemudian Umar mensedekahkannya, tidak dijual pohonnya dan hasilnya, tidak diwariskan dan tidak dihibahkan.\" Ibnu Umar melanjutkan, \"Umar menyedekahkan hasilnya kepada orang-orang fakir, karib kerabat, pemerdekaan budak, dana perjuangan di jalan Allah, untuk pejuang-pejuang dan untuk menjamu tamu. Dan dia juga membolehkan orang lain untuk mengolah kebun tersebut dan memakan dari hasil tanamannya dengan sepantasnya, atau memberi makan temannya dengan tidak menyimpannya.\" Ibnu Umar berkata lagi, \"Dan saya telah menceritakan hadits ini kepada Muhammad, ketika saya sampai kepada perkataan; 'Dan tidak menyimpannya', maka Muhammad mengatakan, \"Dan tidak mengumpul-ngumpulkan hartanya.\" [Ibnu 'Aun] berkata, \"Dan telah memberitakan kepadaku orang yang telah membaca kitab ini, bahwa di dalamnya tertulis, 'Dan tidak mengumpul-ngumpulkan hartanya.' Dan telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Ibnu Abu Zaidah]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ishaq] telah mengabarkan kepada kami [Azhar As Saman]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Ibnu Abu 'Adi] semuanya dari [Ibnu 'Aun] dengan sanad-sanad ini, hanya saja hadits Ibnu Abu Zaidah dan Azhar selesai pada lafadz, 'atau memberi makan kepada temannya tanpa menyimpannya', dan tidak disebutkan sesuatu setelahnya. Sedangkan hadits Ibnu Abu 'Adi, di dalamnya seperti yang disebutkan oleh Sulaim, yaitu perkataanya (Ibnu Umar), 'Kemudian hadits ini saya sampaikan kepada Muhammad' dan seterusnya.\" Dan telah menceritakan kepada kami [Ishaq bin Ibrahim] telah menceritakan kepada kami [Abu Daud Al Hafari Umar bin Sa'd] dari [Sufyan] dari [Ibnu 'Aun] dari [Nafi'] dari [Ibnu Umar] dari [Umar] dia berkata, \"Saya mendapatkan bagian tanah perkebunan di Khaibar, lantas saya menemui Rasulullah shallallahu 'alaihi wasallam seraya berkata, \"Saya telah mendapatkan tanah perkebunan, dan tidak ada yang lebih saya sukai selain tanah tersebut….kemudian dia melanjutkan hadits sebagaimana hadits mereka semua, namun dia tidak menyebutkan 'Kemudian saya menyampaikan hadits ini kepada Muhammad', dan juga setelahnya",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 4225,
			"arabicnumber": "1632.02",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 4226,
			"arabicnumber": "1633",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 4227,
			"arabicnumber": "1634.01",
			"text": "Telah menceritakan kepada kami [Yahya bin Yahya At Tamimi] telah mengabarkan kepada kami [Abdurrahman bin Mahdi] dari [Malik bin Mi'wal] dari [Thalhah bin Musharif] dia berkata, \"Saya pernah bertanya kepada [Abdullah bin Abu Aufa], \"Apakah Rasulullah shallallahu 'alaihi wasallam pernah berwasiat?\" dia menjawab, \"Tidak.\" Saya bertanya lagi, \"Kenapa kaum Muslimin diperintahkan untuk berwasiat?\" dia menjawab, \"Beliau hanya mewasiatkan dengan Kitabullah Azza Wa Jalla.\" Dan telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Waki']. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [Ayahku] keduanya dari [Malik bin Mighwal] dengan sanad-sanad ini, seperti hadits tersebut. Hanya saja dalam hadits Waki' disebutkan, \"Saya bertanya, \"Kenapa manusia diperintahkan untuk berwasiat?\", dan dalam hadits Ibnu Numair disebutkan, \"Saya bertanya, \"Kenapa kaum Muslimin di wajibkan untuk berwasiat?",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 4228,
			"arabicnumber": "1634.02",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 4229,
			"arabicnumber": "1635.01",
			"text": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abdullah bin Numair] dan [Abu Mu'awiyah] dari [Al A'masy]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] telah menceritakan kepada kami [Ayahku] dan [Abu Mu'awiyah] keduanya berkata; telah menceritakan kepada kami [Al A'masy] dari [Abu Wail] dari [Masruq] dari ['Aisyah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam tidak meninggalkan dinar, dirham, seekor kambing atau unta, dan tidak mewasiatkan sesuatu sama sekali.\" Dan telah menceritakan kepada kami [Zuhair bin Harb] dan [Utsman bin Abu Syaibah] dan [Ishaq bin Ibrahim] semuanya dari [Jarir]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ali bin Khasyram] telah mengabarkan kepada kami [Isa] -yaitu Ibnu Yunus- semuanya dari [Al A'masy] dengan sanad-sanad ini, seperti hadits tersebut",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 4230,
			"arabicnumber": "1635.02",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 4231,
			"arabicnumber": "1636",
			"text": "Dan telah menceritakan kepada kami [Yahya bin Yahya] dan [Abu Bakar bin Abu Syaibah] dan ini adalah lafadz Yahya, dia berkata; telah mengabarkan kepada kami [Isma'il bin 'Ulayah] dari [Ibnu 'Aun] dari [Ibrahim] dari [Al Aswad bin Yazid] dia berkata, \"Orang-orang sama berbicara di samping ['Aisyah], bahwa 'Ali menerima wasiat dari Rasulullah shallallahu 'alaihi wasallam, maka dia berkata, \"Kapankah beliau berwasiat kepadanya? Padahal ketika beliau sakit, beliau bersandar di dadaku -atau berkata- di pangkuanku. Kemudian beliau meminta bejana, sesudah itu beliau rebahan di pangkuanku dan saya tidak sadar jika beliau telah tiada. Maka kapankah beliau berwasiat kepadanya?",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 4232,
			"arabicnumber": "1637.01",
			"text": "Telah menceritakan kepada kami [Sa'id bin Manshur] dan [Qutaibah bin Sa'id] dan [Abu Bakar bin Abu Syaibah] dan ['Amru An Naqid] dan ini lafadz Sa'id, mereka berkata; telah menceritakan kepada kami [Sufyan] dari [Sulaiman Al Ahwal] dari [Sa'id bin Jubair] dia berkata, \" [Ibnu Abbas] berkata, \"Hari kamis, apakah hari kamis itu?! Kemudian dia menangis sampai air matanya membasahi batu kerikil, lalu saya bertanya kepadanya, \"Wahai Ibnu Abbas, memangnya ada apa dengan hari kamis?\" dia menjawab, \"Pada hari kamis, sakit yang diderita Rasulullah shallallahu 'alaihi wasallam semakin parah, kemudian beliau bersabda: \"Kemarilah, saya akan menuliskan untukmu suatu catatan yang membuatmu tidak akan tersesat sepeninggalku nanti.\" Lalu para sahabat saling berbantahan, padahal tidak pantas dan tidak layak hal itu terjadi di hadapan beliau.\" Kemudian mereka bertanya, \"Ada apa dengan beliau? Tanyakanlah langsung kepada beliau!\" Lalu Rasulullah shallallahu 'alaihi wasallam menjawab: 'Biarkanlah saya, apa yang saya alami sekarang ini lebih baik. Sesungguhnya saya mewasiatkan kepada kalian tiga perkara; usirlah orang-orang musyrik dari jazirah Arab, berikanlah kepada para utusan (delegasi) sesuatu yang sama dengan apa yang pernah saya berikan kepada mereka (yaitu menghormati dan melayaninya).' Setelah itu beliau diam, tidak menyebutkan perkara yang ketiga, atau menyebutkannya namun saya lupa.\" Abu Ishaq Ibrahim berkata; telah menceritakan kepada kami Al Hasan bin Bisyr dia berkata; telah menceritakan kepada kami Sufyan dengan hadits ini",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 4233,
			"arabicnumber": "1637.02",
			"text": "Telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Waki'] dari [Malik bin Mighwal] dari [Thalhah bin Musharif] dari [Sa'id bin Jubair] dari [Ibnu Abbas] bahwa dia pernah berseru, \"Hari kamis, apakah hari kamis itu!?\" kemudian dia meneteskan air mata hingga saya melihat di pipinya seakan-akan mengeluarkan butiran permata, dia berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah bersabda: \"Kesinilah dengan membawa tulang dan lembaran, saya akan menuliskan buat kalian suatu catatan yang kalian tidak akan tersesat sepeninggalku selamanya.\" Maka mereka berkata, \"Sesungguhnya Rasulullah shallallahu 'alaihi wasallam sedang mengigau",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 4234,
			"arabicnumber": "1637.03",
			"text": "Dan telah menceritakan kepadaku [Muhammad bin Rafi'] dan [Abd bin Humaid], [Abd] berkata; telah mengabarkan kepada kami, dan [Ibnu Rafi'] berkata; telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari ['Ubaidullah bin Abdullah bin 'Utbah] dari [Ibnu Abbas] dia berkata, \"Tatkala Rasulullah shallallahu 'alaihi wasallam mendekati ajalnya, sedangkan di rumah beliau telah hadir beberapa orang yang di antaranya adalah Umar bin Khattab. Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Kemarilah, saya akan menulis suatu catatan yang kalian tidak akan tersesat sepeninggalku.\" Lalu Umar berkata, \"Tampaknya sakit beliau bertambah parah, bukankah Al Qur'an telah berada pada diri kalian? Cukuplah bagi kita Kitabullah.\" Orang-orang yang berada di sekitar beliau ketika itu berbeda pendapat, lalu mereka saling berbantah-bantahan. Ada yang mengatakan, \"Mendekatlah kepada beliau, supaya Rasulullah shallallahu 'alaihi wasallam dapat menuliskan suatu wasiat buat kalian, agar kalian tidak tersesat sepeninggalnya.\" Dan yang lain berpendapat seperti perkataan Umar, sehingga mereka menjadi ribut di sekitar Rasulullah shallallahu 'alaihi wasallam. Lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Berdirilah kalian semua (maksudnya pergi dari sisi beliau).\" Ubaidullah berkata; Ibnu Abbas berkata, \"Kerugian besar (bagi kaum Muslimin), mereka gagal menuliskan pesan terakhir Rasulullah shallallahu 'alaihi wasallam karena mereka saling berbantah-bantahan di sekitar Rasulullah shallallahu 'alaihi wasallam yang sedang sakit keras",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 31
			}
		}
	]
}